{"mid": [{"value": 37279}], "uuid": [{"value": "6dd38ea4-4fa0-4ed4-9565-c690215e1755"}], "vid": [{"value": 37279}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T17:03:01+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13274-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T17:03:01+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T17:03:01+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXXI, No. 53<br />\n<br />\nJAY RUNNERS DEFEAT<br />\nWASHINGTON COLLEGE<br />\nEastern Shoremen Furnish little<br />\nOpposition in Meet<br />\nVISITORS VERY WEAK<br />\nBlack and Blue Annex All But<br />\nTwo First Places<br />\nOutclassed and out-run in all<br />\nevents the track team of Washington College visited Homewood<br />\nSaturday to be sent down in defeat by the Blue Jay runners in<br />\nthe first home meet of the season by the score of_ 95 to 31.<br />\nThe issue was never in doubt<br />\nafter the first few races, while the<br />\ntimes of the various events were<br />\nrather slow due to the muddy<br />\ntrack.<br />\nBrown and Scheidt Win<br />\n<br />\nBrown and Scheidt were the<br />\ntwo Hopkins men to win two<br />\nraces, while Scheidt won the pole<br />\nvault and the mile run. In the<br />\nmajority of the races the Black<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., MAY 17, 1927<br />\n<br />\nHOPKINS SENIOR_ GETS<br />\nCOLUMBIA FELLOWSHIP<br />\nLeslie A. S. Harris, a senior, received word last week<br />\nfrom New York that he has<br />\nbeen appointed to the Victor<br />\nBaier Fellowship of.Columbia University for next year.<br />\nThe award, which carries a<br />\nstipend of $1,000, will enable<br />\nHarris to carry on work toward a Master of Arts degree in English and the<br />\nschool of mu§ic at Columbia.<br />\nThe Baier Fellowship is<br />\noffered annually to college<br />\ngraduates ,all over the country who have had training in<br />\nmusic in addition to the A.<br />\nB. degree.<br />\n'Harris was pianist for two<br />\nyears in the Hopkins Musical Club. He is a member<br />\nof the Tudor and Stuart Club<br />\nand of the Sigma Tau Delta<br />\nfraternity.<br />\n<br />\nStudents Give To<br />\nSchmeisser Fund<br />\n<br />\nand Blue runners had things as<br />\nApproximately thirty-two dolthey wished, the longer distances lars was collected from the stuwere turned into farces by the<br />\ndent body for a gift to William C.<br />\ndiscussions among the runners as<br />\nSchmeisser, lacrosse coach for<br />\nto the relative positions they<br />\nshould finish in. In the mile and the past twenty-five years. The<br />\ntwo-mile runs the pole vault and collection was taken after Norjavelin throw Hopkins trackmen man Robinson, captain of the<br />\nfinished one, two, three.<br />\nteam had made an appeal at asNorris Stars<br />\nsembly Thursday.<br />\nWashington's athletic endeavThe amount contributed by the<br />\nors were led by Norris, who, although unable to come through students will be added to a sum<br />\n<br />\n• with a first place, piled up a num- to be collected from the team, the<br />\nber of points with second and total being used to purchase some<br />\nthird places. He annexed the gift for \"Father Bill.\" The narunner-up post in the 100, broad<br />\nture of the gift has not as yet<br />\njump, and the shot-put, and was<br />\nbeen determined.<br />\nthird in the 220.<br />\nThat most of the students at<br />\nThe two events in which the<br />\nChestertown representatives were assembly contributed less than<br />\nsuccessful were the 220-yard dash ten cents each, or did not conin which D. Krouse nosed out tribute at all, may be easily dePindell, and the<br />\n<br />\nhigh jump, in termined from the consideration<br />\n<br />\nwhich Usilton came through with of the fact that about four hunthe honors.<br />\n<br />\ndred people were present.<br />\n<br />\nCURIOUS COLLEGIANS CONFUSED AS<br />\nCOLORFUL CROWD CRASHES CAMPUS<br />\nIf appearances mean anything<br />\nthe natural features of the campus of the Johns Hopkins University must be strangely similar to those of Africa. Last Fri-<br />\n<br />\nUpon investigation it was revealed that the children were pupils of colored school No. 113-A<br />\n<br />\nand had come all the way to our<br />\nbeautiful campus to study nature.<br />\nday shortly after lunch hour a So the sombre troupe wended its<br />\nlarge band of dark hued young- way up the road past the Engisters was observed wandering un- neering Buildings and around inconcernedly past the Barn led by to the \"forest primeval\" located<br />\n<br />\nlarger and darker teachers. We near Wymans Park, pausing ever<br />\nwondered if they had lost their so often to observe.<br />\nway.<br />\nWe are not superstitious but<br />\nPerhaps it was the balmy air<br />\nwhen a dark cloud from school<br />\nof spring, or maybe Hopkins'<br />\nNo. 113 descends upon the camvaunted supply of the juicy dandepus on Friday, the thirteenth—<br />\nlion, or even just a few of some<br />\nthis is a combination of bad omens<br />\njanitor's progeny—no one could<br />\ntoo potent to be overlooked. Oh<br />\nguess their purpose. Schools had<br />\nwell, let us hope that some one<br />\nbeen known to explore the sacred<br />\nprecincts of Johns Hopkins but of the youngsters brought a, rabbit's foot!<br />\nnever a group so colorful.<br />\n<br />\nDR. AMES EXPLAINS NEW<br />\nPLAN AT WEEKLY<br />\nASSEMBLY<br />\nStudents May Take Courses in Faculty<br />\nof Philosophy and Business Economics<br />\nWith tInstructors' Consent<br />\n<br />\nCarrying two important messages to the student body at last<br />\nweek's assembly, Dr. Joseph S.<br />\nAmes, acting president of the university and dean of the college<br />\nfaculty, emphasized significant<br />\nparts of the New Plan and urged<br />\nthe advisability of keeping politics out of student elections.<br />\n<br />\nPRICE,5 CENTS<br />\n<br />\nWEAK ANNAPOLIS TWELVE NO<br />\nMATCH FOR CHAMPION JAYS<br />\nIN LISTLESS LACROSSE TILT<br />\nMcELFRESH TO HEAD<br />\nACTIVITIES COUNCIL<br />\nCharles McElfresh was<br />\nelected president and Osmar<br />\nP. Steinwald, vice-president<br />\nof the Student Activities<br />\nCouncil for the year 1927-28,<br />\nat a meeting of that body<br />\nheld last Friday.<br />\n<br />\n•<br />\n<br />\nSt. Johns Forced on Defensive<br />\nThroughout Struggle<br />\nLOGAN HIGH SCORER<br />\nClever Hopkins Out-Home Tallies<br />\n•<br />\nFive Markers<br />\n<br />\nRumors of the Johnnies' increasing lacrosse prowess spread around<br />\nHomewood, only served as an additional spur to humble their tradiWith the beginning of the new<br />\ntional enemies as the Jay stickmen<br />\nThese men succeed Larplan next year Dean Ames exeasily piled up an 11-0 score on<br />\nkin H. Farinholt and I.<br />\nplained that limitations will not<br />\nthe Orange and Black twelve last<br />\nRodgers the present<br />\nEvans<br />\nbe in subject but in the student<br />\nSaturday. A muddy field and the<br />\nincumbents.<br />\nhimself according to his ability,<br />\nusual Biddison-to-Logan scoring<br />\ncombination,<br />\nwhich accounted for<br />\n\"First,\" continued the dean, \"it<br />\nfive<br />\n-goals,<br />\nwere<br />\nthe features of the<br />\nmust be understood that any MARYLAND TENNIS TEAM<br />\nwhich<br />\ncontest<br />\nnearly inflicted as sePLAYS JAY NETMEN<br />\ncourse in the Faculty of Philosovere<br />\na<br />\npunishment<br />\non the Annapolis<br />\nTHIS<br />\nAFTERNOON<br />\nphy can be taken only with the<br />\ndelegation as last year's 19-1 defeat.<br />\nconsent of the instructor in the State Championship at Stake in ToFor the first six minutes of the<br />\nday's Struggle; Hopkins<br />\ndepartment desired. A man can<br />\nslippery<br />\nstruggle, it looked as<br />\nLikely Winner<br />\nnot enter the Faculty automatithough reports might prove true<br />\nJohns Hopkins racqueters battle as the Black and Blue attack men<br />\ncally.<br />\nat<br />\nHomewood today for a claim to futilely battered the St. John's goal<br />\nShould Act Promptly<br />\nthe<br />\nstate collegiate tennis champion- with mud and shots as hard as the<br />\nStudents should see their advisship with the University of Mary- slippery footing would permit.<br />\nors as soon as possible so as to<br />\nland, their traditional opponents. Leaving only the required three men<br />\nget their schedule straightened The Jay team is openly out<br />\nto get in the Jay's territory, Dinty Moore's<br />\nout before the close of the aca- revenge, for it was .the Black and stick-wielders<br />\nused every available<br />\ndemic year.<br />\nGold that blasted its hopes for the man to guard their own net, but<br />\n\"Second, I want to stress the tennis crown last year by a 5-4 numbers went for naught after<br />\nLang dodged in to score the Jay's<br />\npoint that all of the language smashing.<br />\nMaryland<br />\nis<br />\nnot<br />\ngoing<br />\nso<br />\nwell<br />\nthis<br />\nFirst<br />\npoint.<br />\ncourses have undergone a comyear; indications augur a Hopkins<br />\nOnce having taken the Johnnies'<br />\nplete rearrangement, especially in<br />\nvictory. Virginia Polytechnic In- measure, the shots were no longer<br />\nGerman, French and English.<br />\nstitute, to whom the Jays adminis- futile. First Jones, growing peeved<br />\n\"Dr. L. P. Shanks will have two tered a 7-2 drubbing, plastered the at seeing Morrill waving the ball in<br />\nor possibly three sections of same score on the Ravens. Another his face, rushed the Hopkins attackindication of their decline from last er, whereupon Morrill rushed in<br />\nFrench, each having different conyear's heights is the 8-0 humiliation and chalked up the Jay's second<br />\ntent; and this will largely be true the University of North Carolina<br />\npoint.<br />\nof professors in the other depart- made them swallow. It was only<br />\nThen scoring first on a long pass<br />\nments.<br />\nwith the greatest difficulty that this from Lang, Logan started his ruth\"A great variety of courses will, latter team pulled a 5-4 victory out less onslaught on the Johnnies' goal<br />\nof the fire on its visit to Homewood. which netted him five goals before<br />\nin reality, be given under the usMaryland Improving<br />\nhe was replaced by Cone. Biddiual heads of English I, or English<br />\nThe College Parkers, however, son's passes to Logan, from behind<br />\nII, French II and so forth. These seem to be improving, for in their<br />\nthe goal, from the side of the goal,<br />\nvarious courses, which are all last matches they have been scoring and from in front of the goal, all<br />\nquite distinct are not apparent in wins. Their last conquest was over went with lightning swiftness from<br />\nthe curriculum listed in the Uni- Randolph-Macon io the tune of.4-3. Logan's stick past the bewildered<br />\nShelton, who will play number one Merkle, into his net.<br />\nversity register, so that it is parman is heralded as the Farmers' best<br />\nWith a score of 8-0 three minticularly important for each sturacqueter. He is expected to star. utes before the end of the half,<br />\ndent to see his advisor about The Hebner-Shelton match should<br />\nCoach Van Orman started sending<br />\nthem.<br />\nproduce good tennis. No quarter in his second string players. Eagan,<br />\nBusiness Courses to Count<br />\nwill be.shown by either team. Both the first to go on the field, scored<br />\n\"Courses in Political Economy are casting covetous eyes on the the final point for the first period,<br />\nmay be taken, with permission of mythical scepter of Maryland Col- bringing the score to nine points<br />\nthe instructors concerned, in the lege tennis. U. of M. is the recog- for Hopkins.<br />\nEmerging from their locker room<br />\nSchool of Business Economics, nized ruler,—Hopkins the insurgent<br />\nwith blood in their eyes, and mud<br />\ncredit for which will be counted with a fine chance of overthrowing<br />\nnearly everywhere else, it seemed as<br />\ntoward a Bachelor of Arts de- the established state. St. John's, though the<br />\nSoldier Boys were going<br />\ngree.<br />\nwhich could not seem to get around to stage a big comeback as they<br />\nhe purpose of these new ar- to meet the Homewood racquet got the draw and had it half way to<br />\nranoz,ements is to make the ad- wielders, has thereby relinquished the Black and Blue net before Malvanced courses more valuable to her claim to the championship. If lonee.took possession of it and startthe student and more interesting the Jays win today, a challenge will ed on its journey to the other end<br />\nof the field, where Covell sent it into<br />\nto the professor.\"<br />\nbe issued to Western Maryland for<br />\nthe Johnnies' net.<br />\nReferring to the nominations of a title match.<br />\nTaking advantage of the interval,<br />\ncandidates, for the offices of PresWashington and Jefferson is<br />\nCoach Van Orman sent in the rest<br />\nident of the Student Council and Hopkins' opponent tomorrow. W.<br />\nof the second • team. leaving Malmembers of the Athletic Associa- and J. has an unusually strong team.<br />\nlonee as the only veteran to comtion Board, held following his Only one match has been lost this<br />\nmand the rookies. Covell took the<br />\ntalk, Dean Ames urged the stu- season; that was to Dickinson Colnext draw from Comedys and the<br />\ndents to put up the best men re- lege. However, the Homewood racnewcomers started their march on<br />\ngardless of fraternities or friend- queters with the Terrapin match to<br />\nthe Orange and Black goal which<br />\nship.<br />\nimprove their tennis, should be in<br />\nresulted in another goal for Hop\"The Johns Hopkins University fine fettle and promise to give W.<br />\nkins when Eagan took advantage of<br />\nContinued on Page 4, Col. 2<br />\nand J. a hard struggle.<br />\nContinued on<br />\nPage 2, Col. 4<br />\n<br />\n\f2<br />\n<br />\nrHE JOHNS HOPI(LNS NEWS-LETTER. MAY 17. 1927<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGM, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nTelephone<br />\n<br />\nUniversity 01-00<br />\n<br />\nEditor-in-Chief<br />\nMORTON HAMBURGER, JR. '28<br />\nManaging Editor<br />\nAssistant Managing Editor<br />\nNORMAN B. GARDINER, JR. '28<br />\nDONALD Hiss '29<br />\nColumnist<br />\nALEXANDER C. WOODS, JR., '28<br />\nAssociate Editors<br />\nRALPH KIRKLEY '28<br />\nRICHARD R. GRIFFITH<br />\nGEORGE E. BANKS, JR. '29<br />\n•Junior Editors<br />\nCORNELIUS S. FRANCKLE, JR. '28<br />\nPHILIP W. NESS '29<br />\nA. BERNARD CHANCELLOR, JR. '28<br />\nRICHARD H. WOOD '29<br />\nLEONARD B. NOLLEY '29<br />\nW. PURNELL HALL, JR. '30<br />\nROBERT F. SKUTCH '30<br />\nBusiness Manager<br />\nSAMUEL M. HECHT '29<br />\nAdvertising Manager<br />\nCirculation Manager<br />\nZANVYL KRIEGER, '28<br />\nGEORGE M. GLAZIER '29<br />\nAssistant Business Managers<br />\nA. H. MORTON '30<br />\nDONALD C. WEILLER '28<br />\nW. GRAHAM BOYCE, JR. '30<br />\nPHOTOGRAPHIC DEPARTMENT<br />\nManaging Editor<br />\nStaff Photographer<br />\nWILLIAM B. BANKS,'29<br />\nVERNON SCHEIDT, '28<br />\nAssistant Photographers<br />\nGEORGE R. HILL, '29<br />\nWILLIAM S. PIKE, '29<br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by The Read-Taylor Press, South and Lombard Streets<br />\n<br />\nBE GOOD, GOUCHER!<br />\nBoston has very little on Goucher. The town of the Lowells<br />\nand the Cabots refuses to allow its citizens to read such naughty<br />\ndemoralizing books as \"An.American Tragedy,\" but, we dare say,<br />\nit has never refused its budding young geniuses the right to seek<br />\nother outlets for their pent-up literary enthusiasm. And this<br />\n(alas!) is just what the Press Club of our fair sisters has done.<br />\nIt has told all little G.oucherites that they may not, under penalty—<br />\n• - well, we're not sure just what the penalty is—to contribute to the<br />\nBlack and Blue Jay.<br />\n..The edict, which was so nastily unchivalrous as to mention<br />\nthe Jay specifically, said that Goucher girls might not contribute to<br />\nperiodicals of which a prototype did not exist at Goucher. Poor<br />\nAtlantic Monthly! And what is more, the ruling seems to have<br />\ncome about through the continued appearance in the Jay of drawings by Goucherites.<br />\nWe appeal to the Press- Club to rescind this cruel and vicious<br />\nordinance. What harm can there be in Goucher's helping to enliven and embellish the poor Jay? Certainly, it seems to us, glory<br />\nwill accrue to Goucher rather than be detracted from her by these<br />\ncontributions. We believe that the Club has erred, or at least has<br />\nbeen wearing smoked glasses. Let's all be friends: how about it?<br />\n<br />\nFATHER BILL<br />\nThe movement_ undertaken by the lacrosse team to secure<br />\nto \"Father Bill\" Schmeisser<br />\n• sufficient funds to present<br />\n_ a gift<br />\nthat will be commensurate with his long service to the University<br />\nis one worthy of much commendation. \"Father Bill\", like \"Pop\"<br />\nSwindell, has given his time and his invaluable advice to the team<br />\nyear after year, and has consistently declined to accept a salary<br />\nof any sort.<br />\nNo wordy panegyric is needed to inform Hopkins people of<br />\n\"Father Bill's\" contribution to Hopkins' lacrosse success. That<br />\n• all know. We are glad to see that he is about to receive a tangible<br />\nindication of the high regard in which he is held on the campus.<br />\n<br />\nYES and NO<br />\nThere are beautiful scenes in Baltimore, if one forgets that<br />\nBaltimore is home; if one puts aside his naturally casual acceptance of familiar scenes, closes that take-it-for-granted unseeing<br />\neye, and looks about him with the eagerness of a stranger or a<br />\nreturning prodigal son. The method of achieving such an appreciative state is simple; fall in love in May, spend some soft, misty<br />\nevening with the object of your affections, and walk very slowly<br />\nhome at midnight. Then, I warrant, you will see. Walk through<br />\nEutaw Place, where stiff red tulips pierce the dim night with<br />\nawful loveliness, where trees hang new festoons of dusky lacy<br />\nleaves, where an iron swan spouts upright yvhispering water unceasingly from his slender throat ;—sit for a moment on a bench<br />\nand look, and drink the exotic very warming wine of Spring, and<br />\nnight, and a city's old loveliness; for there is a charm in Eutaw<br />\nPlace at midnight, when only an occasional motor car brings back<br />\nthe .hideous remembrance of the maddening crowd, and over<br />\none,—pervasive, subtle as the intangible sensation a whiff of lilac<br />\nbrings, restful as death on a bed of crushed violet, or sleep on<br />\nthe trembling fragrant bosom, of the heart's desire, while the<br />\ntumbling tumult of her hair brushes your weary eyelids, caresses<br />\nyour forehead from frowns to. pleasant intangible dreamings-over one there creeps a quiet ecstasy of detachment, safety, peace.<br />\nThere are many white stone steps in certain of the unique<br />\n\"neighborhoods\" of ffaltimore. In Spring they are rather cold<br />\nto sit on after sun-set, unless the damsel fetches a cushion;. but<br />\nthey are invariably spotless (in certain neighborhoods) and made<br />\nof virgin marble,—or perhaps very respectably married marble,<br />\nfor they have a staid and proper look—and their whiteness is cool<br />\nand restful to the eyes under the fluctuating light of street-lamps.<br />\nAbove these lamps the green leaves hang. There is one such<br />\ncombination that I love very dearly,—not because of anything<br />\nthat occurred on the steps beneath it, but because* of its very<br />\nfamiliarity, because of the unfailing thrill brought by each<br />\nSpring's recognition of the same leaves hovering over the same<br />\nsmall flame. I have always thought of that particular flame as<br />\nwithout heat, because the eager foliage forever seems to woo it,<br />\nbending against its stolid impregnable globe with a graceful<br />\nsophisticated caress. The lamp never puffs in a tremor of excitement, nor do the gentle twigs sacrifice their poise, except occasionally when a passionate May storm whips their emotions to a<br />\nfrenzy. . . . And the habit of adoration grows year by year, in<br />\nmy romance self as well as in the soul of that romantic tree, so<br />\nthat wandering wordlessly homeward at some tiny hour of a<br />\nSpring night, I unfailingly catch my breath at the ineffable cool,<br />\nclean, very green grace of the lea:yes, and the lambent hazy light<br />\nof the worshipful lamp.<br />\n_<br />\n.. . two contributions from J. L. E. H., which I have held<br />\nfor some time in hopes that I might eventually write a column<br />\nwhose content would not counteract their poetic flavor.<br />\nDANSEUSE<br />\nYou are a living lyric, a song incarnate.<br />\nI watch with avid eyes your every movement,<br />\nAnd drink the ecstasy that flows therefrom.<br />\nYou are a statue by some ethereal Phidias<br />\nWho molded you of flawless form—<br />\nThen breathed the fire of life into your limbs.<br />\nTHESE DO PERSIST<br />\nthe bastard beams<br />\nborn of the lamplight and the wanton moon<br />\nsprawl shamelessly across the wall<br />\nBut walls recede. . . .<br />\nand You—<br />\nyour face<br />\nand those same eyes<br />\nthat erstwhile intimately spoke to mine—<br />\nthese do persist<br />\nbetween the jostle of the taxis' whizz<br />\nand drunken voices<br />\nintruding upward from the city street.<br />\nJUNE WEEK PLANS ENTICE<br />\nContinued from Page .4, Col. 1 ,<br />\n<br />\nST. JOHNS DEFEATED<br />\n• Continued from Page 1, Col. 5<br />\n<br />\nWhat He's<br />\nLooking For<br />\nWhether its pattern—or sturdy<br />\nwear—or price—or<br />\nall three—whether<br />\nfor formal wear or<br />\nbusi ness. You'll<br />\nfind them in<br />\nSTETSON'S<br />\nFABRICS<br />\n<br />\n29.50<br />\n<br />\n34.50<br />\n<br />\n\"Nationally<br />\nKnown\"<br />\n\"Justly<br />\n<br />\nth<br />\ngi<br />\n<br />\nFamous\"<br />\n<br />\nCO<br />\n<br />\n0,<br />\n<br />\nDaily Showing at<br />\n<br />\nth<br />\nth<br />\nic<br />\n<br />\n22 S. Howard St.<br />\nBaltimore, Md.<br />\n<br />\nft<br />\n<br />\nht,<br />\nTHREEto FIVE MINUTES<br />\nto FORTY THEATRES<br />\nAND ALL SHOPS<br />\n<br />\nLNN<br />\n<br />\n\\<br />\nEll<br />\n/11411COT<br />\n\\<br />\n<br />\nin!<br />\n<br />\nAM S<br />\nvat.<br />\n<br />\niat ucbiefav°'<br />\ned-bY<br />\nomt.tsda.vssle:outig<br />\nvathoaon<br />\n'utescor<br />\n<br />\nt<br />\n<br />\nwith bath Y°<br />\n<br />\nSr<br />\n<br />\nfor<br />\n<br />\net<br />\nW.JOHNSON<br />\nONCINN<br />\nPresident<br />\n<br />\nS<br />\n<br />\nqi<br />\not<br />\nbi<br />\nat<br />\nyo<br />\nPC<br />\nac<br />\nth<br />\n<br />\nG(<br />\nre,<br />\ncu<br />\nth<br />\n<br />\nE. E. ADAMS<br />\nBARN CAFETERIA<br />\n<br />\n7<br />\n<br />\nlat<br />\nlat<br />\nly<br />\n<br />\n20% reduction on all Pipes if purchase.<br />\n,resents this ad.<br />\nt'so<br />\n<br />\nin<br />\nso<br />\n<br />\nR. G. LOY and COMPANY<br />\n<br />\nPharmacists<br />\n<br />\nin.<br />\n<br />\nna<br />\n<br />\nye<br />\nco<br />\n<br />\nsp,<br />\n<br />\n100 UNIVERSITY PARKWAY<br />\nWest Corner Canterbury Road<br />\n<br />\nthe turmoil caused by the mud to<br />\nscore the Jay's final goal.<br />\n• The second string men were able Kodak&<br />\nDeveloping<br />\nto keep the ball in the St. John's Cameras<br />\nPrinting<br />\nEnlarging<br />\nterritory for the remainder of the Supplies<br />\ngame, but they were unable to get<br />\n,<br />\nit past Merkle, who was aided great- zepp Photo Supply Co.<br />\nly by the absence of the thick mud<br />\n3044 Greenmount Ave.<br />\nat the lower goal.<br />\nLet Us Develop Your Films<br />\nThe committee is leaving nothThe line-up:<br />\nLeave Them Today—<br />\ndetailed<br />\naring undone in its very<br />\nHopkins<br />\nSt. Johns<br />\nGet Them Tomorrow<br />\nG<br />\nrangements. Special emphasis is Finn<br />\nMerkle<br />\nPhone UNiversity 3829<br />\nLeibensperger<br />\nP<br />\nBouchers<br />\nlaid on its plans to present a well- Mallonee<br />\nC P<br />\nMcCauley<br />\nHall<br />\nF D<br />\nDesantis<br />\nbalanced affair. Though sponsor- Kegan<br />\nA. H. FETTING<br />\nS D<br />\nJones<br />\nBoynton<br />\nTD<br />\nfestivithe<br />\nSenior<br />\nClass,<br />\ned by the<br />\nComedysMANUFACTURING JEWELRY<br />\nLang<br />\nC<br />\nClark<br />\nCO.<br />\nT A<br />\nties are to be shared in by under- Nixdorf<br />\nMiller<br />\nMorrill<br />\n<br />\nSti<br />\n<br />\n1 TIMES SQUARE<br />\n0<br />\nITY<br />\nST<br />\n)<br />\n<br />\nwith arms loaded with despised<br />\ntexts will be an innovation.<br />\nFor each out-door event, there<br />\nwill be an in-door place to shift<br />\ninto in case of unfavorable weather. Special arrangements will be<br />\nmade sufficiently far in advance<br />\nto meet such emergencies with no<br />\ndelay.<br />\n<br />\ngraduates and alumni,—in other Robinson (c).. .F.4EsieY<br />\nA . .(c) Gessner<br />\nLogan<br />\n0 H<br />\nCross<br />\nHopkins<br />\nmen.<br />\nwords by all<br />\nBiddison<br />\nI H<br />\nGarrison<br />\n<br />\nPc<br />\nth<br />\n<br />\nManufacturers<br />\nGREEK LETTER FRATERNITY<br />\nJEWELRY<br />\n2 1 3 N. LIBERTY STREE1<br />\n<br />\nstr<br />\nCc<br />\nph<br />\nslc<br />\nthc<br />\npu<br />\nan!<br />\nXL<br />\nto<br />\n<br />\nti<br />\ncr<br />\n<br />\npc<br />\nni<br />\nbe<br />\nliii<br />\nof<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS LETTER MAY 17, 1927<br />\n<br />\nINTERCOLLEGIATE<br />\n<br />\nSTUDEN7 COUNCIL DECREES WEARING OF<br />\nGREEN TIES BY NEXT YEARS FRESHMEN<br />\n<br />\nNEWS<br />\n<br />\nThe New Plan which has been<br />\nnursed along for the past two years<br />\n\" A most interesting letter has re- took a decided step• forward last<br />\ncently been received by this paper week and it now appears that this<br />\nfrom The California Daily Bruin,<br />\nnew project has finally_ shed its<br />\nthe student publication of the Uniswaddling<br />\nclothes.<br />\nversity of California, which clearly<br />\nNext year's freshmen will have a<br />\nevinces the continual progress beIt<br />\npapers.<br />\ndecidedly individualistic twist forced<br />\ning made by collegiate<br />\nstates that on May 28 the paper will upon them by way of a new regulapublish a twenty-four page news- tion which has been adopted by the<br />\npaper, the major part of which isStudent Council. Once freshmen<br />\nsue will be turned over to the outheads of the meek<br />\nstanding events of other colleges caps adorned the<br />\nand unassuming members of the enand universities of the country.<br />\ntering class to serve as a distinguish* * *<br />\nmark. Then they were discarded<br />\nThe age old question of the \"free- ing<br />\nof some unknown power,<br />\nby<br />\norder<br />\ndom of the press\" has once more<br />\nbecome the subject of discussion— and only black ties, black socks and<br />\nthis time at the University of Geor- freshmen buttons were required to<br />\ngia. Editors of the student publi- be worn by the newest members of<br />\ncation at that university have been<br />\nordered to absent themselves from FROSH TAKE TWO TENNIS<br />\nthe school because of committing<br />\nMATCHES IN ONE DAY<br />\nthe misdemeanor of ,daring to criticize University policies and certain Friends' School and Army-Navy Prep<br />\nSuccumb to Yearling Racqueters<br />\nmembers of the faculty: -They must<br />\nhave hit a sore spot.<br />\nDouble-headers in baseball are<br />\nfrequent enough, but it remained for<br />\nthe Johns Hopkins freshmen to<br />\nstage a double-header in tennis. Last<br />\nWednesday, the frosh took the<br />\nmeasure of the racquet wielders<br />\nfrom Army-Navy Prep and then<br />\nfollowed up their victory by decisively defeating Friends School.<br />\n• * *<br />\nAs far as can be ascertained this<br />\nWe have already become acis the first instance of any Baltimore<br />\nquainted with many of -the numertennis team playing two matches in<br />\nous perversities of the opposite sex,<br />\none afternoon and winning them<br />\nbut the present whim of the. coeds<br />\nboth. The men on the team who<br />\nat the University of Idaho is beplayed in both matches were comyond the reasoning powers of our<br />\npletely exhausted as the afternoon<br />\npoor faculties. The fair ones have<br />\ndrew to a close and, when the<br />\nactually agreed to go one-half of<br />\nmatches were clinched, forfeited<br />\nthe expenses on all dates.<br />\nseveral of the doubles.<br />\n* * *<br />\nThe feature match was the numThe University Hatchet of ber one singles match with Friends<br />\nGeorge Washington University has School in which Ed Devereaux trirecently announced an increased cir- umphed over Towner French in a<br />\nculation of one thousand copies over stirring three-set match. Both men<br />\ntheir former high water mark of displayed a fine brand of tennis, but<br />\n5,500 copies, making a total circu- in the last set Deveraux's greater<br />\nlation of 6,500, which thy claim is endurance proved to be the neceslarger than any other college week- sary margin of victory.<br />\nly publication in the United States.<br />\n<br />\n* * *<br />\nStuffed ballot boxes and campus<br />\n• politics will soon become things of<br />\nthe past at Stanford University.<br />\nVoting machines have recently been<br />\ninstalled in that most up-to-date institution for use in class elections.<br />\n<br />\n* * *<br />\nThe University of Texas, taking.<br />\ncognizance of the enormous strides<br />\nin advancement being made by the<br />\nso-called \"present generation\" has<br />\ninstalled a complete course in aeronautical engineering. The first two<br />\nyears will be a general engineering<br />\ncourse, but the last two will be on<br />\nspecialized aeronautical subjects.<br />\n* * *<br />\nThe feminine roomers across the<br />\nstreet from the men's dormitory at<br />\nColumbia University have complained that their morals are being<br />\nslowly ruined by the negligence of<br />\nthe aforesaid young gentlemen in<br />\npulling down the window shades<br />\nand by the folloWing disclosures.<br />\nMaybe the boys believe in: \"Do unto others . . . .\" •<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nThe desire for college educations and \"collegiatism\" is increasing rapidly in America. Reports show that college enrollment is growing faster than ever<br />\nbefore. Over 180 institutions of<br />\nhigher learning show an it.crease<br />\nof 11 per cent over last year.<br />\n<br />\n3<br />\n<br />\nSALADS<br />\n<br />\n•PASTRIES<br />\n<br />\nRolls and Fancy Cakes<br />\nPhone HOmewood 8993<br />\n<br />\nthe University:<br />\nFOOD SHOP—BAKERY<br />\nAt a meeting of the Student<br />\nCouncil held last Friday, however, it DELICATESSEN CONFECTIONERY<br />\nwas decided that something more<br />\nFred. Mueller, Prop.<br />\n20<br />\nEAST 21ST STREET<br />\nunusual should be used by the freshBaltimore, Md.<br />\nmen to distinguish this undergraduBox<br />\nLunches<br />\nfor Automobile and<br />\nate form the common herd. ConseCard Parties<br />\n•<br />\nquently the campus will be bedecked<br />\nby brilliant emerald green ties, the<br />\n•<br />\nTHE<br />\nwearers of which will be freshmen.<br />\nPEPPER POT<br />\nIn spite of opposition by \"Ned\"<br />\nTEA ROOM<br />\nAND<br />\nPassano, the project was finally<br />\nGIFT SHOP<br />\npassed. Passano held out for red<br />\n414 N. CHARLESST., BALTIMORE<br />\nties but finally when the question<br />\nwas put to vote, he voted for the emerald cravat. When green tie was<br />\ntwisted about a fore finger and held<br />\naloft, Passano voted \"aye\" with the<br />\nrest of the council—the boy's color<br />\nblind.<br />\n<br />\nUSE<br />\n<br />\nYELLOW CABS<br />\nNO CHARGE FOR<br />\nEXTRA PASSENGERS<br />\n'PHONE<br />\n<br />\nVERNON 1212<br />\nA. HOLT Inc.<br />\nEbtlin.g &Thee<br />\n<br />\n,,ijarrialitv<br />\n<br />\n2022 N. Charles St.<br />\n<br />\nAN OPPORTUNITY<br />\n<br />\nfor pleasant and profitable work<br />\n<br />\nDR. SWARTZ DELIVERS<br />\nSECOND LECTURE<br />\n<br />\nSee<br />\n<br />\nTakes Up Astronomical and Physical<br />\nEvidence of His Beliefs<br />\n<br />\nDr. C. K. Swartz, Collegiate<br />\nProfessor of Geology, presented<br />\nlast Thursday the second of his series of four lectures . on \"Fundamental Problems Concerning the<br />\nRelations of Science and Religion.\"<br />\nAgain, the lecturer spoke to an audience of a size beyond the normal<br />\ncapacity of the room.<br />\nIn the previous lecture, Dr.<br />\nSwartz had devoted his time to a<br />\ndefinition of his terms (the mechanistic and vitalistic concepts), an assertion of his personal belief in the<br />\nlatter theory and a promise of proof<br />\nof this view in seven points, which<br />\nwould encompass astronomy, physics, biology, geology, morals, mind<br />\nand self-consciousness..<br />\nIn this lecture, he used astronomy and physics for instruments of<br />\nverification. He pointed , outl that<br />\nthe mechanistic mode of thought<br />\nhad a precarious basis upon the assumption that the universe is eternal. His work was to shatter this<br />\npremise.<br />\n<br />\nCARL F. NEW, Manager<br />\n<br />\nSUN LIFE ASSURANCE COMPANY OF CANADA<br />\n604 AMERICAN BUILDING<br />\n<br />\nPractice Saving Money —<br />\nThrift- that is, the art of systematic saving- conserves and accelerates<br />\nthe power of knowledge. Money in the<br />\nbank often leads to greater opportunity.<br />\n4%0N SAVINGS - NATIONAL BANK PROTECTION<br />\n<br />\nTHE NATIONAL BANK of BALTIMORE<br />\n\"Oldest Bank in Maryland\"<br />\nBALTIMORE AND ST. PAUL STS, (Since 1795.)<br />\n<br />\nAstronomical Evidence<br />\n<br />\nBy quoting the findings of a long<br />\nlist of eminent astronomers, such<br />\nas the President of the AstronomLOCAL NUMBER OF JAY<br />\nical Society of Great Britain, SiContinued front Page 6, Col. 1<br />\nmon Newcomb, Russell, Young and<br />\nEvening Sun is not quite so well others, he indicated these<br />\nscientists<br />\ndone, although the sketch of<br />\ncame to a conclusion diametrically<br />\nModish Mitzi's Fashion Activities opposed<br />\nto the mechanistic view.<br />\nand the comic page get.close reEvidence gathered by these astronsemblances to the originals. omers<br />\nconclusively shows that' not<br />\nGeorge Bungle, as depicted by only is the world<br />\nnot eternal, but<br />\nReese, looks a little bedraggled. that it cannot<br />\nbe very old.<br />\nPerhaps he is worrying too much<br />\nThe notable exponents of contraover the lost photograph of diction of this chemical-physiologTobias.<br />\nical-deterministic belief in the field<br />\nThree books come under the of physics are R. A. Millikan and<br />\nscrutiny of the book reviewer Clerk Maxwell. The latter partic-.<br />\nwhile the dramatic critics lavish ularly has contributed a smashing<br />\npraise on Mrs. Fiske, George Ar- blow at the eternal-universe prinliss and \"Trelawney of the ciple by his enunciation of the SecWells.\"<br />\nond Law of Thermodynamics. This<br />\nOf the work by staff members, latter theory points unequivocally<br />\nthe breezy poem illustrated by to a metaphorical evanescence of<br />\nChapman ranks first. \"The cast- this universe instead of an eternaling director joke,\" comnlented on ity.<br />\nfavorably in our last review, is<br />\nPromise of still more illuminatagain dragged out for its second ing flashes are held out in Dr.<br />\nappearance. Last month it was Swartz's future lectures, which will<br />\nprinted under a Russian sketch by adduce evidence from his own field,<br />\nEldridge. In this issue it is buried and those bugaboos, the trilogy of<br />\namong the advertising on page 3. mind, morals, and self-consciousIt's pretty good; boys, but not ness. The dates are May 19 and<br />\n26. All students are invited to atworth a curtain call.<br />\nG. E. B., JR. tend.<br />\n<br />\nDrink<br />\n<br />\n9<br />\n<br />\nin cash prizes<br />\n<br />\nDelicious and Refreshing<br />\n<br />\nHave you seen the announcement<br />\nof the $30,000 Coca-Cola prize contest—out this month in the following magazines?<br />\nThe Saturday Evening Post. .May 7<br />\nMay 14<br />\nLiterary Digest<br />\nCollier's Weekly. . May 21<br />\nLiberty<br />\nMay 14<br />\nLife<br />\nMay 5<br />\nKeep your eyes open to Coca-Cola advertising for the next three months —in these<br />\nmagazines, many newspapers, posters and<br />\noutdoor walls and signs; in the displays in<br />\ndealers'show windows and in soda fountain<br />\nand refreshment stand decorations.<br />\nFollow this contest and win a prize of real<br />\ncash.<br />\nThe Coca-Cola Co., Atlanta, Ga.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS LETTER MAY 17, 1927<br />\n<br />\n4<br />\nPROGRAMS CAUSE RENEWED<br />\nINTEREST IN JUNE<br />\nWEEK ACTIVITY<br />\nNew Features Incorporated in Attractive Schedule Lower Cost<br />\nto Student<br />\n<br />\nWith June Week programs before the student body in circular<br />\nform, every undergraduate who<br />\nlikes a good time, in nearly every<br />\nsense of the word, is beginning to<br />\nlook over and beyond the final<br />\nexam hazard to the merry period<br />\nof post-mortem festivities.<br />\nThe announcement of the events<br />\nis couched in terms of cold formality which fail to give any inkling of the quantity, quality, and<br />\nvariety of whole-hearted pleasure<br />\ncrowded into one enthusiastic<br />\nweek of merrymaking.<br />\nJune Week programs vary little from year to year, but the committee feels that, under the leadership of Thomas F. McNeal, several distinctive features place this<br />\nyear's program in a class by itself.<br />\nAn All-Hopkins Affair<br />\n<br />\nMARKLE ELECTED TO<br />\nSTUDENT COUNCIL<br />\nJohn. Markle was elected<br />\nSophomore delegate to the<br />\nStudent Council for the year<br />\n1927-'28 at the last meeting<br />\nof the Freshman Class held<br />\nafter the assembly on Thursday. According to a ruling<br />\nof the Council, the number<br />\nof votes polled by the different candidates cannot be<br />\nmade public. The other<br />\nnominees for the office were<br />\nSmith, Gettemuller, Gould,<br />\nGhent, Zepp, Young.<br />\nPLAYSHOPPERS PAY VISIT<br />\nTO EASTERN SHORE<br />\n\"The Great Galeoto\" Presented Before<br />\nLarge Audience in Salisbury<br />\n<br />\nMembers of the cast of \"The<br />\nGreat Galeoto,\" the Homewood<br />\nPlayshop's latest play, were very<br />\nenthusiastically received • in Salisbury, Maryland, last week. Their<br />\n<br />\nThe first of these features is trip to the Eastern Shore metropthe fact that this June Week cele- olis was undertaken for the benebration is to be an all-Hopkins lit of the Maryland Tuberculosis<br />\naffair. Except for the Senior As<br />\nBall, Baccalaureate Service, and<br />\nThe entire cast consisting of<br />\nconferring of degrees, for which<br />\nDr. john Earle Uhler, I. Evans<br />\nthere are not sufficient accommodations on the campus, all the Rodgers, Frances Levee, John<br />\nweek's activities will be conduct- Gorgi, Emi,ly Austin, Cyril Abed at Homewood. Furthermore, bott, Ralph Townsend and Elise<br />\nthe June Week tickets will be Cohen left Baltimore at six o'clock<br />\nprinted in a fool-proof form. A on Monday morning. During their<br />\ntriple-classified record of senior,<br />\nstay the Playshoppers played at<br />\nundergraduate, and alunini atthe Arcade Theatre before capactendants will be kept.<br />\nAll refreshments will be includ- ity audiences. Practically the ened this year in the price of June tire student bodies of the Normal<br />\nWeek tickets. The committee School, at Salisbury, and the Salhas provided for the serving of isbury High School turned out to<br />\nrefreshments at the various func- witness the performance. Everytions free of charge. This is a<br />\none was enthusiastic in acclaimgreat improvement,.for the stuing the \"Great Galeoto.\" On Mondents, over last year's arrangeday afternoon the amateur actors<br />\nments.<br />\nIn the third place, the platform were entertained at a reception<br />\nto be erected in the Dormitory<br />\nCourt this year has been \"guaranteed\" not to warp. The area of<br />\nthe floor will be exceptionally<br />\nlarge, measuring forty by eighty<br />\nfeet.<br />\nExcellent music<br />\nFourthly, the appropriate solution of the long-discussed musical<br />\nproblem by the engagement of<br />\n\"Bob\" Iula's and the Blue Jay Orchestras will attract many prospective celebrators. The former<br />\norchestra, twenty pieces in num-<br />\n<br />\nSTRAYER'S<br />\n<br />\nTHE EIVIANUEL PRESS<br />\nINCORPORATED<br />\n<br />\nPRINTING<br />\n<br />\nBUSINESS COLLEGE<br />\nCharles and Fayette Sts., Baltimore<br />\nSECRETARIAL, STENOGRAPHIC<br />\nand ACCOUNTING COURSES<br />\nDay and Night Classes All the Year<br />\n<br />\nENGRAVING<br />\n<br />\nEMBOSSING<br />\n<br />\n203 WEST FRANKLIN STREET, BALTIMORE<br />\nTELEPHONE VERNON 4519<br />\n<br />\nYou May Enter at Any Time<br />\nCall, write or phone PLAZA 5626<br />\nfor complete information<br />\n<br />\nESTABLISH1i0 1818<br />\n<br />\nTHE WOODROW<br />\nWILSON<br />\nFOUNDATION<br />\n<br />\nCLOTHING<br />\n-<br />\n<br />\nlintiltutettv Wurntolltn49tioatf,<br />\n<br />\nannounces a<br />\n<br />\nMADISON AVENUE COR. FORTY-FOURTH STREET<br />\nNEW YORK<br />\n<br />\n$57,000<br />\nPRIZE ESSAY<br />\nCONTEST<br />\n<br />\nOur Representative will be at<br />\n<br />\nTwo $25,000 prizes for the<br />\nbest 2,500 word essays written by a young man and a<br />\nyoung woman between 20<br />\nand 35 on the subject -What<br />\nWoodrow Wilson Means to<br />\nMe\"<br />\nand<br />\nSeven Thousand Dollars in<br />\nSupplementary Prizes<br />\n<br />\nThe BELVEDERE<br />\nToday, and Tomorrow<br />\nMay 17 and 18<br />\n<br />\nYOU HAVE ALL<br />\nVACATION TO<br />\nCOMPETE<br />\n<br />\nSendfor BROOKS'S Miscellany<br />\n<br />\nContest closes October 1st<br />\nFor Special Prize Rules write<br />\nThe Woodrow Wilson<br />\nFoundation<br />\n17 E. 42nd St.,<br />\nNew York City<br />\n<br />\nBi<br />\n08 T 0 N<br />\nLIMA 111111.0.0<br />\n.1.104<br />\n<br />\nPALM BEACH<br />\n<br />\nNEWPORT<br />\n<br />\nPLAZA suILDING<br />\n•<br />\nC • tp •<br />\n•.•<br />\n<br />\n•UORAIN<br />\n220 0“..1•.. Anow.<br />\n<br />\nof<br />\n<br />\nop<br />\ncal<br />\ncal<br />\nA1<br />\nth(<br />\nlo<br />\n<br />\nMi<br />\nlet<br />\n<br />\nIIipmull1111111<br />\nIII11<br />\n\"1 1\"\"\"4;11(11CIIIIIIIIII<br />\nkill<br />\n<br />\n!Ill<br />\n<br />\nIan<br />\n<br />\npei<br />\nprc<br />\n<br />\ni 1 ,1 .1.1,1,1 1 1I 1 1 1,1<br />\n<br />\nme<br />\nint<br />\nma<br />\n<br />\nheld in their honor by Mrs. Tilghman, of Salisbury.<br />\n<br />\nraj<br />\nper<br />\nzat.<br />\n<br />\nThey left for Baltimore at six<br />\no'clock on Tuesday morning in<br />\norder to reach Homewood in time<br />\n<br />\ntwc<br />\nfan<br />\n<br />\nfor the reception held that afternoon in honor of Miss Eva Le<br />\nGallienn e.<br />\n<br />\nCotillon Club To Hold<br />\nDance Saturday Night<br />\n<br />\n111111111111<br />\n<br />\n111101111,<br />\n<br />\nA dance will be held by the Co-'<br />\nber will play at the Senior Ball tillon Club at the Belvedere Hotel,<br />\nand at the dances in the Dormi- this Saturday night after the Marytory Court. The Blue Jays are to land lacrosse game. The admission<br />\nfurnish the music for all other will be $2 a couple, or $1.50 stag.<br />\ndances.<br />\nMusic by ,Bob Iula will last from<br />\nThe L'Hirondelle-New Roch- 9 until 10 o'clock.<br />\n<br />\nelle lacrosse tilt should prove enticing to all lacrosse lovers, while<br />\nNEW PLAN DISCUSSED<br />\nthe inter-fraternity ball game will<br />\nContinued on Page 2, Col. 3<br />\namong other indistinguished<br />\nis<br />\nbe witnessed by many fans. Both<br />\nare a part of the June Week stitutions of the country, in that<br />\nthe government of student affairs<br />\nschedule.<br />\nReunions of the last five grad- is managed solely by the students<br />\nThis places a great<br />\nuating classes, including a ban- themselves.<br />\nshoulders of<br />\nquet for each class, are being plan- responsibility on the<br />\nthe<br />\ncompose<br />\nto<br />\nchosen<br />\nned with the co-operation of the the men<br />\ncouncil.<br />\nvarious alumni representatives. governing<br />\n\"Therefore, I urge you to<br />\nThe atmosphere will be that of a<br />\nchoose men of character, honesty,<br />\ngreat home-coming week.<br />\ndecision—men you can trust—to<br />\nA big \"fire of knowledge,\" enrepresent you in this important<br />\ncircled by a procession of seniors<br />\nmatter.\"<br />\nContinued on Page 2, Col. 4<br />\n<br />\n% alb<br />\n<br />\nyot.<br />\nIan(<br />\nSc<br />\nchii<br />\nin I<br />\n<br />\n'1111<br />\n<br />\nModern smoking pleasure<br />\nthat never fails<br />\nTHE smokers of this age are the most<br />\nindependent ever known. Accepting<br />\nno hearsay, they have smoked out the<br />\nfacts. They have learned that the<br />\nchoicest Turkish and Domestic tobaccos grown are rolled into Camels,<br />\nthat here is the incomparable blending for goodness, that Camels simply<br />\nnever tire the taste.<br />\nCamel is the ciprette that never<br />\nfails to please the modern age. Regardless of how often you want the<br />\ncomfort of a smoke, of how steadily<br />\nyou light one after another, Camel<br />\n<br />\nwill never fail you, never give you<br />\nany but the finest thrill of smoking<br />\npleasure. This is why Camel's popularity,by far the largest in the modern<br />\nworld, keeps overwhelmingly in the<br />\nlead. As modern taste becomes more<br />\ninsistent upon choice tobaccos, increasing millions discover Camel's incomparable mildness, smoothness and<br />\nmellowness.<br />\nIf you want the cigarette that's<br />\ngood to live with from morn to midnight,the one that is the choice of the<br />\nmodern age, Have a Camel!\"<br />\n<br />\nR. J. REYNOLDS TOBACCO COMPANY, WINSTON-SALEM. N. C.<br />\n<br />\n0 1927<br />\n<br />\nest(<br />\nrep:<br />\nhou<br />\nsale<br />\nViSC<br />\nposi<br />\nerei<br />\ntrac<br />\nand<br />\nwe(<br />\nthos<br />\n<br />\nStth<br />\nsew<br />\nspec<br />\nExc<br />\nduni<br />\n<br />\nsent<br />\nmill-<br />\n<br />\n\frH E<br />\n<br />\nJOHNS HOPKINS NEWS-LE ITER. MAY 17. 1927<br />\n<br />\n5<br />\n<br />\nND THE WORLD<br />\n<br />\nNOMINATIONS FOR THURSDAY'S ELECTION<br />\n<br />\nSecond Year<br />\n<br />\nCOLLEGE CRUISE<br />\nS. S. FtYNDAM<br />\n<br />\nDELEGATES TO THE A. A. BOARD<br />\nFOR PRESIDENT OF THE<br />\n<br />\nSeniors<br />\n<br />\nJuniors<br />\n<br />\nSophomores<br />\n<br />\nAlumni<br />\n<br />\n(Vote for 5)<br />\n<br />\n(Vote for 3)<br />\n<br />\n(Vote for 2)<br />\n<br />\n(Vote for 1)<br />\n<br />\nSTUDENT<br />\nCOUNCIL<br />\n<br />\nBauernschmidt<br />\nBiddison<br />\n(Vote for 1) Blandi<br />\nBoynton<br />\nBiddison<br />\nCarroll<br />\nBlandi<br />\nKaufholz<br />\nBoynton<br />\nKaufman<br />\nRodgers<br />\nLeibensperger<br />\nWarfield<br />\nMallonee<br />\nMcElfresh<br />\nProctor<br />\nScheidt, V.<br />\n<br />\nAllen<br />\nCaplan<br />\nHelfrisch<br />\nHershey<br />\nHiss<br />\nKegan<br />\nNice<br />\nRichards<br />\nSchiebel<br />\n<br />\nCiscle<br />\nHall<br />\nLang<br />\nLyons<br />\nScheidt, W.<br />\nYoung<br />\n<br />\nSEPTEMBER TO MAY<br />\nContinue your regular academic course aboard the S.S.<br />\nRyndam, while visiting 25 countries.<br />\nA real college with a faculty<br />\nof experienced educators.<br />\nBasketball, baseball, tennis,<br />\nsoccer, swimming, with teams<br />\nof foreign universities.<br />\nA University Afloat for men<br />\nonly.<br />\nEnrollment limited to<br />\n375-17 years or more of age.<br />\nFor illustrated booklets, description of courses, map of Itinerary and cost of a school year<br />\nof travel, write:<br />\n<br />\nAbraham<br />\nGwinn<br />\nRobinson<br />\nGraduate<br />\n(Vote for 1)<br />\nEdwards<br />\nFarinholt<br />\nMorrill<br />\nMedical<br />\n(Vote for 1)<br />\nMagill<br />\nWolbert<br />\n<br />\nUNIVERSITY<br />\nTRAVEL<br />\nASS'N., INC.<br />\n285 Madison Ave. t7t.:11<br />\nNew York City<br />\n<br />\nHoward & LexingtonS<br />\n<br />\nNo proxies will be accepted. All votes must be handed in in person between 11.30 A.<br />\nM. and 1:00 P. M., Thursday, May 19. Unsigned ballots will not be counted.<br />\n<br />\nTEWART&<br />\n<br />\nco.<br />\n<br />\nCAlvert 6060<br />\n<br />\nMEN'S INTERWOVEN SOCKS<br />\nWe carry a full line of these Nationally known socks - mercerized cotton, rayon and silk, plain colors and fancies; all sizes<br />\nfm men and young men. Priced according to quality<br />\n35c to $1.00 a pair<br />\n<br />\nBUREAU ANNOUNCES LIST<br />\nOF SUMMER JOBS<br />\nBureau of Appointments Issues List of<br />\nVacation Positions<br />\n<br />\nMiss Bernadette Judge, in charge<br />\nof the Bureau of Appointments, recently announced a list of positions<br />\nopen to students for the coming vacation season. Further particulars<br />\ncan be obtained from the Bureau of<br />\nAppointments which is located in<br />\nthe Registrar's office.<br />\nThe list of positions open follows:<br />\nCounsellor wanted for boys' camp.<br />\nMust be Capable of directing .athletics.- Season—July and August.<br />\nTeacher of Latin and German<br />\nwith A. B. degree and teaching experience wanted for 1927-28 by a<br />\nprogressive private school in Baltimore.<br />\n: Personnel assistant of a Department Store in Baltimore wishes to<br />\ninterview Seniors in regard to permanent positions.<br />\nSenior with experience In stenography and typewriting wanted for<br />\npermanent position in office organization of an old Baltimore firm.<br />\nBaltimore representative needs<br />\ntwo salesmen for new type electric<br />\nfan—commission 15%.<br />\nSeveral sales positions open for<br />\nyoung- men in Baltimore, Cumberland, and Hagerstown in Dayton<br />\nScale Division of large business machines company with branch office<br />\nin Baltimore.<br />\nStudents wanted who are interested in a good summer position,<br />\nrepresenting the largest publishing<br />\nhouse in the business, as student<br />\nsalesmen, team captains and supervisors. Students who will be in a<br />\nposition to travel will be given preference. This is an eleven week contract job from June to September,<br />\nand will pay a salary of $24.00 per<br />\nweek, plus a tuition of $175.00 to<br />\nthose who qualify.<br />\nTown and Country, International<br />\nStudio and Harper's Bazar desire<br />\nseveral active representatives for<br />\nspecial campaigning in advertising.<br />\nExcellent opportunity for students<br />\nduring vacation period.<br />\nStudents wanted as service representatives for a large silk hosiery<br />\nmill—extremely good pay.<br />\nNOTICE<br />\nSenior<br />\n<br />\nclass<br />\n<br />\nmeeting<br />\n<br />\n‘.SVI1NIG70<br />\n7•<br />\n<br />\nETHOLINE<br />\n<br />\nBETTER<br />\nRESULTS<br />\n<br />\n\"THE WONDER MOTOR FUEI:<br />\n<br />\nARLINGTON HOTEL<br />\nIDEAL DOWNTOWN LOCATION<br />\nOne ,Ff<br />\n, the 4-M 7-/otels<br />\n<br />\nSHERWOOD BROS., INC.<br />\n<br />\nc4'2ways<br />\n<br />\nOTHER.<br />\n<br />\nCAIRO<br />\n4-M It COLONIAL<br />\nFAIRFAX<br />\n<br />\nA ROOM<br />\nWITH<br />\nRUNNING<br />\nWATER.<br />\n<br />\nHOTELS It MARTINIQUE<br />\nWashinIton,D.0<br />\n<br />\nEdge worth<br />\n<br />\n4.0<br />\n<br />\nTILDEN HALL<br />\n<br />\nOPERATED BY<br />\n<br />\nA ROOM<br />\nWITH<br />\nPRIVATE<br />\nBATH<br />\n<br />\n2.<br />\n<br />\nMADDUX, MARSHALL, MOSS<br />\n<br />\nEr MALLORY /A/c.<br />\n<br />\nWRITE FOR A fRff COPY OF OUR 1 1.00 PICTORIAL GUIDE MAP OF WASHINGTON<br />\n<br />\nis every<br />\npipe's<br />\n<br />\nlover<br />\n<br />\n,<br />\n<br />\nCLOTHES<br />\nReady-made<br />\nAnd Cut to Order<br />\nESTABLISHED ENGLISH UNIVERSITY<br />\nSTYLES, TAILORED OVER YOUTHFUL<br />\nCHARTS SOLELY FOR DISTINGUISHED<br />\nSERVICE IN THE UNITED STATES.<br />\nefillpf<br />\n<br />\nS<br />\n<br />\n'The College Graduate<br />\n<br />\nQ7ttlxvicer honse<br />\nSuits and Topcoats<br />\n<br />\nwho is to be a success in life, should start to save<br />\nimmediately. An endowment life insurance policy<br />\nin this company offers one of the best methods of<br />\nenforced monthly saving.<br />\n<br />\n4<br />\n•<br />\n<br />\n$40,$45,$50<br />\n<br />\ne<br />\nLIFE INSURANCE COMPANY<br />\nOF BOSTON. MASSACHUSETTS<br />\n111•1•111...<br />\n<br />\nYou are invited to enroll in our<br />\n<br />\nSUMMER SCHOOL<br />\nSPECIAL COURSE<br />\nIS OFFERED<br />\n<br />\nSTUDENTS OF JOHNS HOPKINS<br />\nUNIVERSITY<br />\nDURING JUNE, JULY and AUGUST<br />\nSECRETARIAL SUBJECTS<br />\nSHORTHAND, TYPEWRITING, FILING and ACCOUNTS<br />\n<br />\nBY SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br />\n<br />\nQ:hrtrter*mu<br />\nof Baltimore<br />\nThe character of the suits and<br />\ntopcoats tailored by Charter House<br />\nwill earn your most sincere liking.<br />\n<br />\nHub<br />\n<br />\nEATON & BURNETT BUSINESS COLLEGE<br />\ntoday,<br />\n<br />\n12:20, Room 109 M. E. Building.<br />\n<br />\nTake The<br />\nQuickest Road<br />\nTo<br />\n<br />\nPresent Address, 9-11 WEST BALTIMORE STREET<br />\nAfter June 1-7-9 EAST BALTIMORE STREET<br />\nSEND FOR TERMS and FULL INFORMATION<br />\nPHONE PLAZA 2q27<br />\n<br />\nMAKE YOUR SUMMER PAY<br />\n<br />\nCharles and Fayette Sts.<br />\nMIN11/1<br />\n<br />\n-<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER. MAY 17, 1927<br />\n<br />\n6<br />\n<br />\nLOCAL NUMBER OF BLACK ALL ATTEMPTS OF BLUE JAY TO ENTICE<br />\nAND BLUE JAY EVOKES<br />\nGOUCHER STUDENTS COME TO NAUGHT<br />\nGREAT MIRTH<br />\nThe editors of The Black and notices on the official bulletin boards<br />\nBlue<br />\nJay considered the students of in the various buildings comprising<br />\nShort<br />\nFar<br />\nFalls<br />\nNew Issue, However,<br />\nGoucher College among the lumi- the Goucher Campus.<br />\nof Famed Celebrity Number<br />\nof Last Year<br />\nnaries of Baltimore. So they asked<br />\nWhen the Goucher Press Club,<br />\nfor a page of contributions from the<br />\nLocal newspapers come in for<br />\nfair Goucherites along with other after still more careful considerathe lion's share of the punishment<br />\ntion, decided that The Black and<br />\nBaltimore celebrities.<br />\ndoled out by the current number<br />\nBut the editors of the various Blue Jay was not the kind of a jourof the Black and Blue Jay. The<br />\nGoucher publications did not con- nal for its charges to contribute to,<br />\nBaltimore News takes its razzing<br />\nsider The Black and Blue Jay a cel- it issued an edict proclaiming that<br />\nwith a scare head proclaiming to the<br />\nebrated magazine in any sense of \"contributions to. such magazines<br />\nworld that Peaches has lost. The<br />\nwere against all precedent, since the<br />\nEvening Sun is parodied by means the word. So the fair Goucherites<br />\nwere not allowed to besmirch the Goucher Press Club had never perof an editorial page, a woman's<br />\ntalent which made Goucher famous mitted contributions to any journal<br />\nsheet and a page of garbled con-ifor its clean journals by contributing of which there was not a similar one<br />\nics.<br />\npublished by students of Goucher<br />\nto The Black and Blue Jay.<br />\nThe cover by Banks, depicting<br />\nWhen the editors of The Black College.\" So as the result of this<br />\na Baltimore street of the future<br />\nand Blue Jay after careful consider- cruel and bold edict all would-be<br />\nshows some careful work in the<br />\nation decided that the fair Goucher- contributors to the famous Blue Jay<br />\nmatter of perspective. The color<br />\nites should by all means be repre- were warned that they must not on<br />\nscheme, however, is a bit weird<br />\n, well anyway it<br />\nsented along with all the other ce- penalty of<br />\nwith buildings painted a vivid<br />\nterrible.<br />\nwas<br />\nposted<br />\nlebrities of Baltimore, they<br />\norange.<br />\nThe impressionistic frontispiece DEBATERS WIN AND LOSE Garis Again Wins<br />\nTO SOUTHERNERS<br />\nby Yardley of The Sun might be<br />\nAbercrombie Cup<br />\na graphic reprqsentation of an<br />\n<br />\nSAVINGS ACCOUNTS AN IN- of gold and precious jewels; but as<br />\nDEX OF PROGRESS<br />\nthese hidden treasures were often<br />\nstolen or seized by force very few<br />\nThey May Be Opened at Barn During<br />\npeople were able to save money.<br />\nAll of This Week<br />\nOne of the most important invenPlato, Buddha, Julius Caesar, tions of modern civilization was a<br />\nChristopher Columbus, and hosts of safe way to save—with a plan for<br />\nothers were unquestionably great actually paying the individual for<br />\nmen—immortal figures in the his- his thrift that each day becomes intory of the world—but since their creasingly popular. The first organtime the world has whirled around ized savings bank was established at<br />\nmany, many times and situations Brunswick in 1765, and the growth<br />\nand opportunities are markedly dif- of savings accounts since this time<br />\nferent from those of ancient or me- has been tremendous. Naturally the<br />\ndieval days. Usually we are all sat- first to utilize the advantages of<br />\nisfied to call this change \"the on- banks were those in the vanguard of<br />\nward march of civilization\" without progress.<br />\nparticular reflection as to just what<br />\nAs a college man you already<br />\nit is all about anyhow. Trans-oceanic have a front seat in this vanguard<br />\nflights, a vast and complex economic of progress. Do you intend to hold<br />\nand industrial organization, have re- on to the advantageous position<br />\nplaced the crude methods of feudal which your education gives you?<br />\ndays. The opportunity to save with You don't if you have not got a savsecurity is one of the outstanding ad- ings account. Open one at the Barn<br />\nvantages of our modern society. None<br />\nat lunch-hour any day this week<br />\nof these truly great men had the op\"The Oldest • Bank in Maryportunity to safely save that you with<br />\nNave today—and fortunes in their land\"—The National Bank of Baltidays were in the form of buried pots more.<br />\n<br />\nNegative Teams of Washington and<br />\n<br />\nafter<br />\ndream<br />\nLeading by seven-tenths of a<br />\nundergraduate's<br />\nLee and Hopkins Best<br />\nOpponents<br />\nsteak.<br />\ndormitory<br />\nRobert W. Garis, captain of<br />\npoint,<br />\ndowning a<br />\nRead's, Vagabond Theatre, WashDebating the Washington and the Rifle Team, again won that<br />\nington's Monument and the Lee Affirmative team in the Civil team's annual Abercrombie Cup<br />\nMaryland Institute are all scram- Engineering Hall Friday night, J. contest. As Garis won the cup last<br />\nCary Thompson and Norman B. year, he has set a mark by winning<br />\nbled into an amusing bodge<br />\nGardiner, Jr., the Hopkins Negative<br />\nthe prize for two years, successively.<br />\npodge.<br />\ndebaters, were again awarded a two<br />\nOnken's sketch of Dr. Ames to one decision. The question of<br />\nThe success of the riflemen was<br />\nby averaging the total<br />\ndetermined<br />\npresents a fairly good likeness.<br />\nwhether or not there should be a<br />\nMr. Strickland Gillilan's essay uniform marriage and divorce law score of the match with the average<br />\non banquets is the best humorous for the United States was once score of the shooting for the whole<br />\nmore the subject of discussion.<br />\nseason.<br />\narticle in the entire Jay. The<br />\nW.<br />\nH.<br />\nB.<br />\nMaynard<br />\nWagand<br />\nJ.<br />\nThe sharpshooters' final averages<br />\nBrazilian pheasants whose meat<br />\nner, representing Washingion and<br />\nconas follows: Garis, 283.4; Glantz,<br />\nare<br />\n\"dehydrated<br />\nas<br />\nhe describes<br />\nLee, made excellent speeches on the<br />\ndor-bosom,\" flashlight photo- question. Wagner's rebuttal, which 282.7; Baird, 271.3; Magness,<br />\ngraphers who shot off a blast of came near to filling the negative's 264.2; Bussard, 261; Muir, 260.4.<br />\npowder at the inopportune time contentions as full of holes as a<br />\nReiblich, a member of the team,<br />\nsieve, was particularly worthy of<br />\nand toastmasters who insist on<br />\ndid not compete in the match. His<br />\nmention.<br />\nmispronouncing one's name, are<br />\naverage for the year, however, acNiles Presides<br />\nall satirized in Gillilan's clever<br />\nDonald C. Niles, secretary-treas- cording to statistics of Lieutenant<br />\nstyle.<br />\nurer of the Debating Council, preEdmund Duffy, who wields his sided at the debate. Niles took great Offley, coach of the team, was 272.<br />\nThe cup, which has been in existcharcoal to supply The Baltimore pleasure in holding the audience and<br />\nslowly<br />\nin<br />\nhe<br />\nsuspense<br />\nwhile<br />\nspeakers<br />\nSun with its daily cartoon has an<br />\nence for three years, will be, as has<br />\ncontaining<br />\nenvelopes<br />\nthe<br />\ntore<br />\nopen<br />\namusing sketch of a ponderous<br />\nthe judges' votes, and read their de- been previously announced, presentWho<br />\nAin't<br />\n\"Who<br />\nvolume entitled<br />\ncisions:<br />\ned to Captain Garis.<br />\nIn America.\" The poems by Mr.<br />\n1. Affirmative.<br />\nNyburg are both clever bits of<br />\n2. Negative.<br />\nimmorthe<br />\nof<br />\nspeaking<br />\nverse but<br />\n3. Negative.<br />\nPRODV.cT10N OF<br />\ntality of the \"man whom Al<br />\nThe three judges secured by Niles<br />\nTHE<br />\nknows,\" have you noticed that for the occasion were Dr. Ellen<br />\nIC<br />\n\"Regular Fellows\" have chased Lunn and Mr. C. I. Winslow, Pro*S.<br />\nhim off the funny sheet. •<br />\nfessors at Goucher College, and Mr.<br />\n/0/<br />\nThe most ridiculous affair in Chester F. Morrow, a well-known<br />\nthe entire magazine is the as-. member of the Baltimore Bar Assotounding discovery of the learned ciation.<br />\ndoctor whose name smacks of the<br />\nBull and O'Dunne Lose<br />\nAt the same time that the Hopfictitious. This thesis is a combination of Jule Verne, Tom kins Negative was meeting the<br />\nSwift and Hans Christian Anderson with all of the asininities of<br />\neach. Incidentally the illustration accompanying the article<br />\nshould be kept away from small<br />\nchildren.<br />\nFelix Morley, brother of Christopher, moans of the trials and<br />\ntribulations of being the younger<br />\nbrother of a luminary. So pathetic was his wail that the Editor<br />\nwas forced to pen a few consoling<br />\nwords at the end of the article.<br />\nThe take-off on Mr. Hearst's<br />\ndaily evening outrage is good, especially the illuminating photodiagrams. The parody on The<br />\nContinued on Page 3, Col. 2<br />\n<br />\nWashington and Lee Affirmative<br />\nteam here, Robert L. Bull and Eugene O'Dunne, Jr., were debating<br />\nthe latter's Negative team at Lexington, Virginia. Their part of the<br />\ndual debate was lost by a vote of<br />\ntwo to one.<br />\nThe dual debate concluded one of<br />\nthe most active seasons that the<br />\nHopkins Debating Council has ever<br />\nhad. Besides holding the debates<br />\nFriday and the two inter-class arguments, Hopkins has participated in<br />\nthree intercollegiate debates this<br />\nyear—with the University of North<br />\nCarolina, with Davidson College,<br />\nand with Wake Forest College. Two<br />\nof these debates were lost.<br />\n<br />\nna-As<br />\n<br />\nREAD-TAYLOR<br />\nCOMPANY<br />\nEngraving Printing Binding<br />\n<br />\nMANY J. H. U. GRADUATES<br />\nNOW OWNConnecticut Mutual Contracts<br />\n<br />\nCONNECTICUT MUTUAL LIFE INS. CO.<br />\nROGERS R. KRAUK<br />\n502 Citizens Bank<br />\nBuilding<br />\n<br />\nPlaza 2581<br />\n<br />\nTHE UNION SHIPBUILDING COMPANY<br />\nHAS FOR SALE<br />\nBOATS, ANCHORS, LIFE PRESERVERS, CUSHIONS, LANTERNS, COMPASSES, FIRE EXTINGUISHERS AND OTHER USED EQUIPMENT FOR<br />\nSMALL BOATS AND SHORES.<br />\n<br />\nSTRAP WATCHES<br />\nThe graduation gift for men<br />\n<br />\nHENNEGEN-BATES COMPANY<br />\nJewelers and Silversmiths Since 1 857<br />\n7 East Baltimore Street<br />\nBaltimore<br />\n<br />\nTHE GIANT<br />\nPOWER FUEL<br />\n<br />\nEsso<br />\n<br />\n\"STANDARD\" MOTOR OIL<br />\nYOU CAN ACTUALLY FEEL THE DIFFFRENCE<br />\n<br />\nSTANDARD OIL COMPANY [N. J.)<br />\n<br />\nDEPENDABLE<br />\n<br />\nJ. H. FURST CO.<br />\n<br />\nHOOD TIRES<br />\n<br />\nPrinters of<br />\nPHILOLOGICAL & SCIENTIFIC<br />\nPUBLICATIONS<br />\n23 S. Hanover St., Baltimore__<br />\n<br />\nMARTIN J. BARRY<br />\nCharles & Lanvale Sts.<br />\n<br />\nCarl J. Doederlein<br />\n<br />\nCUrtis 0184<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nBox 475<br />\n<br />\nINVESTMENT SECURITIES<br />\n<br />\nTHE SUMMIT<br />\n<br />\nWATCHES,<br />\n<br />\nSTEIN BROS. & BOYCE<br />\n<br />\nBaltimore's Country \"NIGHT CLUB\"<br />\n<br />\nDIAMONDS, JEWELRY<br />\n<br />\nESTABLISHED 1853<br />\n<br />\nFine Watch, Clock & Jewelry<br />\nRepairing a Specialty<br />\n<br />\nS. CALVERT STREET<br />\n<br />\nDINE & DANCE<br />\nto<br />\n<br />\nBALTIMORE, MARYLAND<br />\n<br />\nMfrs. of Fraternity Goods of<br />\nAll Kinds<br />\n<br />\n504 PARK BANK BUILDING<br />\nLexington at Liberty Sts.<br />\n<br />\nGLYNN MORRIS<br />\nand his<br />\n<br />\nSILVER SUPPER BAND<br />\nWOODWARD BUILDING<br />\n<br />\nWASHINGTON, D. C.<br />\n<br />\nRICHMOND TRUST BUILDING RICHMOND, VA.<br />\n<br />\nuntil 2 A. M.<br />\nClosed Sunday's<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXXI, No. 53<br /><br />\nJAY RUNNERS DEFEAT<br />\nWASHINGTON COLLEGE<br />\nEastern Shoremen Furnish little<br />\nOpposition in Meet<br />\nVISITORS VERY WEAK<br />\nBlack and Blue Annex All But<br />\nTwo First Places<br />\nOutclassed and out-run in all<br />\nevents the track team of Washington College visited Homewood<br />\nSaturday to be sent down in defeat by the Blue Jay runners in<br />\nthe first home meet of the season by the score of_ 95 to 31.<br />\nThe issue was never in doubt<br />\nafter the first few races, while the<br />\ntimes of the various events were<br />\nrather slow due to the muddy<br />\ntrack.<br />\nBrown and Scheidt Win<br /><br />\nBrown and Scheidt were the<br />\ntwo Hopkins men to win two<br />\nraces, while Scheidt won the pole<br />\nvault and the mile run. In the<br />\nmajority of the races the Black<br /><br />\nHOMEWOOD, BALTIMORE, MD., MAY 17, 1927<br /><br />\nHOPKINS SENIOR_ GETS<br />\nCOLUMBIA FELLOWSHIP<br />\nLeslie A. S. Harris, a senior, received word last week<br />\nfrom New York that he has<br />\nbeen appointed to the Victor<br />\nBaier Fellowship of.Columbia University for next year.<br />\nThe award, which carries a<br />\nstipend of $1,000, will enable<br />\nHarris to carry on work toward a Master of Arts degree in English and the<br />\nschool of mu§ic at Columbia.<br />\nThe Baier Fellowship is<br />\noffered annually to college<br />\ngraduates ,all over the country who have had training in<br />\nmusic in addition to the A.<br />\nB. degree.<br />\n'Harris was pianist for two<br />\nyears in the Hopkins Musical Club. He is a member<br />\nof the Tudor and Stuart Club<br />\nand of the Sigma Tau Delta<br />\nfraternity.<br /><br />\nStudents Give To<br />\nSchmeisser Fund<br /><br />\nand Blue runners had things as<br />\nApproximately thirty-two dolthey wished, the longer distances lars was collected from the stuwere turned into farces by the<br />\ndent body for a gift to William C.<br />\ndiscussions among the runners as<br />\nSchmeisser, lacrosse coach for<br />\nto the relative positions they<br />\nshould finish in. In the mile and the past twenty-five years. The<br />\ntwo-mile runs the pole vault and collection was taken after Norjavelin throw Hopkins trackmen man Robinson, captain of the<br />\nfinished one, two, three.<br />\nteam had made an appeal at asNorris Stars<br />\nsembly Thursday.<br />\nWashington's athletic endeavThe amount contributed by the<br />\nors were led by Norris, who, although unable to come through students will be added to a sum<br /><br />\n• with a first place, piled up a num- to be collected from the team, the<br />\nber of points with second and total being used to purchase some<br />\nthird places. He annexed the gift for \"Father Bill.\" The narunner-up post in the 100, broad<br />\nture of the gift has not as yet<br />\njump, and the shot-put, and was<br />\nbeen determined.<br />\nthird in the 220.<br />\nThat most of the students at<br />\nThe two events in which the<br />\nChestertown representatives were assembly contributed less than<br />\nsuccessful were the 220-yard dash ten cents each, or did not conin which D. Krouse nosed out tribute at all, may be easily dePindell, and the<br /><br />\nhigh jump, in termined from the consideration<br /><br />\nwhich Usilton came through with of the fact that about four hunthe honors.<br /><br />\ndred people were present.<br /><br />\nCURIOUS COLLEGIANS CONFUSED AS<br />\nCOLORFUL CROWD CRASHES CAMPUS<br />\nIf appearances mean anything<br />\nthe natural features of the campus of the Johns Hopkins University must be strangely similar to those of Africa. Last Fri-<br /><br />\nUpon investigation it was revealed that the children were pupils of colored school No. 113-A<br /><br />\nand had come all the way to our<br />\nbeautiful campus to study nature.<br />\nday shortly after lunch hour a So the sombre troupe wended its<br />\nlarge band of dark hued young- way up the road past the Engisters was observed wandering un- neering Buildings and around inconcernedly past the Barn led by to the \"forest primeval\" located<br /><br />\nlarger and darker teachers. We near Wymans Park, pausing ever<br />\nwondered if they had lost their so often to observe.<br />\nway.<br />\nWe are not superstitious but<br />\nPerhaps it was the balmy air<br />\nwhen a dark cloud from school<br />\nof spring, or maybe Hopkins'<br />\nNo. 113 descends upon the camvaunted supply of the juicy dandepus on Friday, the thirteenth—<br />\nlion, or even just a few of some<br />\nthis is a combination of bad omens<br />\njanitor's progeny—no one could<br />\ntoo potent to be overlooked. Oh<br />\nguess their purpose. Schools had<br />\nwell, let us hope that some one<br />\nbeen known to explore the sacred<br />\nprecincts of Johns Hopkins but of the youngsters brought a, rabbit's foot!<br />\nnever a group so colorful.<br /><br />\nDR. AMES EXPLAINS NEW<br />\nPLAN AT WEEKLY<br />\nASSEMBLY<br />\nStudents May Take Courses in Faculty<br />\nof Philosophy and Business Economics<br />\nWith tInstructors' Consent<br /><br />\nCarrying two important messages to the student body at last<br />\nweek's assembly, Dr. Joseph S.<br />\nAmes, acting president of the university and dean of the college<br />\nfaculty, emphasized significant<br />\nparts of the New Plan and urged<br />\nthe advisability of keeping politics out of student elections.<br /><br />\nPRICE,5 CENTS<br /><br />\nWEAK ANNAPOLIS TWELVE NO<br />\nMATCH FOR CHAMPION JAYS<br />\nIN LISTLESS LACROSSE TILT<br />\nMcELFRESH TO HEAD<br />\nACTIVITIES COUNCIL<br />\nCharles McElfresh was<br />\nelected president and Osmar<br />\nP. Steinwald, vice-president<br />\nof the Student Activities<br />\nCouncil for the year 1927-28,<br />\nat a meeting of that body<br />\nheld last Friday.<br /><br />\n•<br /><br />\nSt. Johns Forced on Defensive<br />\nThroughout Struggle<br />\nLOGAN HIGH SCORER<br />\nClever Hopkins Out-Home Tallies<br />\n•<br />\nFive Markers<br /><br />\nRumors of the Johnnies' increasing lacrosse prowess spread around<br />\nHomewood, only served as an additional spur to humble their tradiWith the beginning of the new<br />\ntional enemies as the Jay stickmen<br />\nThese men succeed Larplan next year Dean Ames exeasily piled up an 11-0 score on<br />\nkin H. Farinholt and I.<br />\nplained that limitations will not<br />\nthe Orange and Black twelve last<br />\nRodgers the present<br />\nEvans<br />\nbe in subject but in the student<br />\nSaturday. A muddy field and the<br />\nincumbents.<br />\nhimself according to his ability,<br />\nusual Biddison-to-Logan scoring<br />\ncombination,<br />\nwhich accounted for<br />\n\"First,\" continued the dean, \"it<br />\nfive<br />\n-goals,<br />\nwere<br />\nthe features of the<br />\nmust be understood that any MARYLAND TENNIS TEAM<br />\nwhich<br />\ncontest<br />\nnearly inflicted as sePLAYS JAY NETMEN<br />\ncourse in the Faculty of Philosovere<br />\na<br />\npunishment<br />\non the Annapolis<br />\nTHIS<br />\nAFTERNOON<br />\nphy can be taken only with the<br />\ndelegation as last year's 19-1 defeat.<br />\nconsent of the instructor in the State Championship at Stake in ToFor the first six minutes of the<br />\nday's Struggle; Hopkins<br />\ndepartment desired. A man can<br />\nslippery<br />\nstruggle, it looked as<br />\nLikely Winner<br />\nnot enter the Faculty automatithough reports might prove true<br />\nJohns Hopkins racqueters battle as the Black and Blue attack men<br />\ncally.<br />\nat<br />\nHomewood today for a claim to futilely battered the St. John's goal<br />\nShould Act Promptly<br />\nthe<br />\nstate collegiate tennis champion- with mud and shots as hard as the<br />\nStudents should see their advisship with the University of Mary- slippery footing would permit.<br />\nors as soon as possible so as to<br />\nland, their traditional opponents. Leaving only the required three men<br />\nget their schedule straightened The Jay team is openly out<br />\nto get in the Jay's territory, Dinty Moore's<br />\nout before the close of the aca- revenge, for it was .the Black and stick-wielders<br />\nused every available<br />\ndemic year.<br />\nGold that blasted its hopes for the man to guard their own net, but<br />\n\"Second, I want to stress the tennis crown last year by a 5-4 numbers went for naught after<br />\nLang dodged in to score the Jay's<br />\npoint that all of the language smashing.<br />\nMaryland<br />\nis<br />\nnot<br />\ngoing<br />\nso<br />\nwell<br />\nthis<br />\nFirst<br />\npoint.<br />\ncourses have undergone a comyear; indications augur a Hopkins<br />\nOnce having taken the Johnnies'<br />\nplete rearrangement, especially in<br />\nvictory. Virginia Polytechnic In- measure, the shots were no longer<br />\nGerman, French and English.<br />\nstitute, to whom the Jays adminis- futile. First Jones, growing peeved<br />\n\"Dr. L. P. Shanks will have two tered a 7-2 drubbing, plastered the at seeing Morrill waving the ball in<br />\nor possibly three sections of same score on the Ravens. Another his face, rushed the Hopkins attackindication of their decline from last er, whereupon Morrill rushed in<br />\nFrench, each having different conyear's heights is the 8-0 humiliation and chalked up the Jay's second<br />\ntent; and this will largely be true the University of North Carolina<br />\npoint.<br />\nof professors in the other depart- made them swallow. It was only<br />\nThen scoring first on a long pass<br />\nments.<br />\nwith the greatest difficulty that this from Lang, Logan started his ruth\"A great variety of courses will, latter team pulled a 5-4 victory out less onslaught on the Johnnies' goal<br />\nof the fire on its visit to Homewood. which netted him five goals before<br />\nin reality, be given under the usMaryland Improving<br />\nhe was replaced by Cone. Biddiual heads of English I, or English<br />\nThe College Parkers, however, son's passes to Logan, from behind<br />\nII, French II and so forth. These seem to be improving, for in their<br />\nthe goal, from the side of the goal,<br />\nvarious courses, which are all last matches they have been scoring and from in front of the goal, all<br />\nquite distinct are not apparent in wins. Their last conquest was over went with lightning swiftness from<br />\nthe curriculum listed in the Uni- Randolph-Macon io the tune of.4-3. Logan's stick past the bewildered<br />\nShelton, who will play number one Merkle, into his net.<br />\nversity register, so that it is parman is heralded as the Farmers' best<br />\nWith a score of 8-0 three minticularly important for each sturacqueter. He is expected to star. utes before the end of the half,<br />\ndent to see his advisor about The Hebner-Shelton match should<br />\nCoach Van Orman started sending<br />\nthem.<br />\nproduce good tennis. No quarter in his second string players. Eagan,<br />\nBusiness Courses to Count<br />\nwill be.shown by either team. Both the first to go on the field, scored<br />\n\"Courses in Political Economy are casting covetous eyes on the the final point for the first period,<br />\nmay be taken, with permission of mythical scepter of Maryland Col- bringing the score to nine points<br />\nthe instructors concerned, in the lege tennis. U. of M. is the recog- for Hopkins.<br />\nEmerging from their locker room<br />\nSchool of Business Economics, nized ruler,—Hopkins the insurgent<br />\nwith blood in their eyes, and mud<br />\ncredit for which will be counted with a fine chance of overthrowing<br />\nnearly everywhere else, it seemed as<br />\ntoward a Bachelor of Arts de- the established state. St. John's, though the<br />\nSoldier Boys were going<br />\ngree.<br />\nwhich could not seem to get around to stage a big comeback as they<br />\nhe purpose of these new ar- to meet the Homewood racquet got the draw and had it half way to<br />\nranoz,ements is to make the ad- wielders, has thereby relinquished the Black and Blue net before Malvanced courses more valuable to her claim to the championship. If lonee.took possession of it and startthe student and more interesting the Jays win today, a challenge will ed on its journey to the other end<br />\nof the field, where Covell sent it into<br />\nto the professor.\"<br />\nbe issued to Western Maryland for<br />\nthe Johnnies' net.<br />\nReferring to the nominations of a title match.<br />\nTaking advantage of the interval,<br />\ncandidates, for the offices of PresWashington and Jefferson is<br />\nCoach Van Orman sent in the rest<br />\nident of the Student Council and Hopkins' opponent tomorrow. W.<br />\nof the second • team. leaving Malmembers of the Athletic Associa- and J. has an unusually strong team.<br />\nlonee as the only veteran to comtion Board, held following his Only one match has been lost this<br />\nmand the rookies. Covell took the<br />\ntalk, Dean Ames urged the stu- season; that was to Dickinson Colnext draw from Comedys and the<br />\ndents to put up the best men re- lege. However, the Homewood racnewcomers started their march on<br />\ngardless of fraternities or friend- queters with the Terrapin match to<br />\nthe Orange and Black goal which<br />\nship.<br />\nimprove their tennis, should be in<br />\nresulted in another goal for Hop\"The Johns Hopkins University fine fettle and promise to give W.<br />\nkins when Eagan took advantage of<br />\nContinued on Page 4, Col. 2<br />\nand J. a hard struggle.<br />\nContinued on<br />\nPage 2, Col. 4<br /><br />\n2<br /><br />\nrHE JOHNS HOPI(LNS NEWS-LETTER. MAY 17. 1927<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGM, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nTelephone<br /><br />\nUniversity 01-00<br /><br />\nEditor-in-Chief<br />\nMORTON HAMBURGER, JR. '28<br />\nManaging Editor<br />\nAssistant Managing Editor<br />\nNORMAN B. GARDINER, JR. '28<br />\nDONALD Hiss '29<br />\nColumnist<br />\nALEXANDER C. WOODS, JR., '28<br />\nAssociate Editors<br />\nRALPH KIRKLEY '28<br />\nRICHARD R. GRIFFITH<br />\nGEORGE E. BANKS, JR. '29<br />\n•Junior Editors<br />\nCORNELIUS S. FRANCKLE, JR. '28<br />\nPHILIP W. NESS '29<br />\nA. BERNARD CHANCELLOR, JR. '28<br />\nRICHARD H. WOOD '29<br />\nLEONARD B. NOLLEY '29<br />\nW. PURNELL HALL, JR. '30<br />\nROBERT F. SKUTCH '30<br />\nBusiness Manager<br />\nSAMUEL M. HECHT '29<br />\nAdvertising Manager<br />\nCirculation Manager<br />\nZANVYL KRIEGER, '28<br />\nGEORGE M. GLAZIER '29<br />\nAssistant Business Managers<br />\nA. H. MORTON '30<br />\nDONALD C. WEILLER '28<br />\nW. GRAHAM BOYCE, JR. '30<br />\nPHOTOGRAPHIC DEPARTMENT<br />\nManaging Editor<br />\nStaff Photographer<br />\nWILLIAM B. BANKS,'29<br />\nVERNON SCHEIDT, '28<br />\nAssistant Photographers<br />\nGEORGE R. HILL, '29<br />\nWILLIAM S. PIKE, '29<br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by The Read-Taylor Press, South and Lombard Streets<br /><br />\nBE GOOD, GOUCHER!<br />\nBoston has very little on Goucher. The town of the Lowells<br />\nand the Cabots refuses to allow its citizens to read such naughty<br />\ndemoralizing books as \"An.American Tragedy,\" but, we dare say,<br />\nit has never refused its budding young geniuses the right to seek<br />\nother outlets for their pent-up literary enthusiasm. And this<br />\n(alas!) is just what the Press Club of our fair sisters has done.<br />\nIt has told all little G.oucherites that they may not, under penalty—<br />\n• - well, we're not sure just what the penalty is—to contribute to the<br />\nBlack and Blue Jay.<br />\n..The edict, which was so nastily unchivalrous as to mention<br />\nthe Jay specifically, said that Goucher girls might not contribute to<br />\nperiodicals of which a prototype did not exist at Goucher. Poor<br />\nAtlantic Monthly! And what is more, the ruling seems to have<br />\ncome about through the continued appearance in the Jay of drawings by Goucherites.<br />\nWe appeal to the Press- Club to rescind this cruel and vicious<br />\nordinance. What harm can there be in Goucher's helping to enliven and embellish the poor Jay? Certainly, it seems to us, glory<br />\nwill accrue to Goucher rather than be detracted from her by these<br />\ncontributions. We believe that the Club has erred, or at least has<br />\nbeen wearing smoked glasses. Let's all be friends: how about it?<br /><br />\nFATHER BILL<br />\nThe movement_ undertaken by the lacrosse team to secure<br />\nto \"Father Bill\" Schmeisser<br />\n• sufficient funds to present<br />\n_ a gift<br />\nthat will be commensurate with his long service to the University<br />\nis one worthy of much commendation. \"Father Bill\", like \"Pop\"<br />\nSwindell, has given his time and his invaluable advice to the team<br />\nyear after year, and has consistently declined to accept a salary<br />\nof any sort.<br />\nNo wordy panegyric is needed to inform Hopkins people of<br />\n\"Father Bill's\" contribution to Hopkins' lacrosse success. That<br />\n• all know. We are glad to see that he is about to receive a tangible<br />\nindication of the high regard in which he is held on the campus.<br /><br />\nYES and NO<br />\nThere are beautiful scenes in Baltimore, if one forgets that<br />\nBaltimore is home; if one puts aside his naturally casual acceptance of familiar scenes, closes that take-it-for-granted unseeing<br />\neye, and looks about him with the eagerness of a stranger or a<br />\nreturning prodigal son. The method of achieving such an appreciative state is simple; fall in love in May, spend some soft, misty<br />\nevening with the object of your affections, and walk very slowly<br />\nhome at midnight. Then, I warrant, you will see. Walk through<br />\nEutaw Place, where stiff red tulips pierce the dim night with<br />\nawful loveliness, where trees hang new festoons of dusky lacy<br />\nleaves, where an iron swan spouts upright yvhispering water unceasingly from his slender throat ;—sit for a moment on a bench<br />\nand look, and drink the exotic very warming wine of Spring, and<br />\nnight, and a city's old loveliness; for there is a charm in Eutaw<br />\nPlace at midnight, when only an occasional motor car brings back<br />\nthe .hideous remembrance of the maddening crowd, and over<br />\none,—pervasive, subtle as the intangible sensation a whiff of lilac<br />\nbrings, restful as death on a bed of crushed violet, or sleep on<br />\nthe trembling fragrant bosom, of the heart's desire, while the<br />\ntumbling tumult of her hair brushes your weary eyelids, caresses<br />\nyour forehead from frowns to. pleasant intangible dreamings-over one there creeps a quiet ecstasy of detachment, safety, peace.<br />\nThere are many white stone steps in certain of the unique<br />\n\"neighborhoods\" of ffaltimore. In Spring they are rather cold<br />\nto sit on after sun-set, unless the damsel fetches a cushion;. but<br />\nthey are invariably spotless (in certain neighborhoods) and made<br />\nof virgin marble,—or perhaps very respectably married marble,<br />\nfor they have a staid and proper look—and their whiteness is cool<br />\nand restful to the eyes under the fluctuating light of street-lamps.<br />\nAbove these lamps the green leaves hang. There is one such<br />\ncombination that I love very dearly,—not because of anything<br />\nthat occurred on the steps beneath it, but because* of its very<br />\nfamiliarity, because of the unfailing thrill brought by each<br />\nSpring's recognition of the same leaves hovering over the same<br />\nsmall flame. I have always thought of that particular flame as<br />\nwithout heat, because the eager foliage forever seems to woo it,<br />\nbending against its stolid impregnable globe with a graceful<br />\nsophisticated caress. The lamp never puffs in a tremor of excitement, nor do the gentle twigs sacrifice their poise, except occasionally when a passionate May storm whips their emotions to a<br />\nfrenzy. . . . And the habit of adoration grows year by year, in<br />\nmy romance self as well as in the soul of that romantic tree, so<br />\nthat wandering wordlessly homeward at some tiny hour of a<br />\nSpring night, I unfailingly catch my breath at the ineffable cool,<br />\nclean, very green grace of the lea:yes, and the lambent hazy light<br />\nof the worshipful lamp.<br />\n_<br />\n.. . two contributions from J. L. E. H., which I have held<br />\nfor some time in hopes that I might eventually write a column<br />\nwhose content would not counteract their poetic flavor.<br />\nDANSEUSE<br />\nYou are a living lyric, a song incarnate.<br />\nI watch with avid eyes your every movement,<br />\nAnd drink the ecstasy that flows therefrom.<br />\nYou are a statue by some ethereal Phidias<br />\nWho molded you of flawless form—<br />\nThen breathed the fire of life into your limbs.<br />\nTHESE DO PERSIST<br />\nthe bastard beams<br />\nborn of the lamplight and the wanton moon<br />\nsprawl shamelessly across the wall<br />\nBut walls recede. . . .<br />\nand You—<br />\nyour face<br />\nand those same eyes<br />\nthat erstwhile intimately spoke to mine—<br />\nthese do persist<br />\nbetween the jostle of the taxis' whizz<br />\nand drunken voices<br />\nintruding upward from the city street.<br />\nJUNE WEEK PLANS ENTICE<br />\nContinued from Page .4, Col. 1 ,<br /><br />\nST. JOHNS DEFEATED<br />\n• Continued from Page 1, Col. 5<br /><br />\nWhat He's<br />\nLooking For<br />\nWhether its pattern—or sturdy<br />\nwear—or price—or<br />\nall three—whether<br />\nfor formal wear or<br />\nbusi ness. You'll<br />\nfind them in<br />\nSTETSON'S<br />\nFABRICS<br /><br />\n29.50<br /><br />\n34.50<br /><br />\n\"Nationally<br />\nKnown\"<br />\n\"Justly<br /><br />\nth<br />\ngi<br /><br />\nFamous\"<br /><br />\nCO<br /><br />\n0,<br /><br />\nDaily Showing at<br /><br />\nth<br />\nth<br />\nic<br /><br />\n22 S. Howard St.<br />\nBaltimore, Md.<br /><br />\nft<br /><br />\nht,<br />\nTHREEto FIVE MINUTES<br />\nto FORTY THEATRES<br />\nAND ALL SHOPS<br /><br />\nLNN<br /><br />\n\\<br />\nEll<br />\n/11411COT<br />\n\\<br /><br />\nin!<br /><br />\nAM S<br />\nvat.<br /><br />\niat ucbiefav°'<br />\ned-bY<br />\nomt.tsda.vssle:outig<br />\nvathoaon<br />\n'utescor<br /><br />\nt<br /><br />\nwith bath Y°<br /><br />\nSr<br /><br />\nfor<br /><br />\net<br />\nW.JOHNSON<br />\nONCINN<br />\nPresident<br /><br />\nS<br /><br />\nqi<br />\not<br />\nbi<br />\nat<br />\nyo<br />\nPC<br />\nac<br />\nth<br /><br />\nG(<br />\nre,<br />\ncu<br />\nth<br /><br />\nE. E. ADAMS<br />\nBARN CAFETERIA<br /><br />\n7<br /><br />\nlat<br />\nlat<br />\nly<br /><br />\n20% reduction on all Pipes if purchase.<br />\n,resents this ad.<br />\nt'so<br /><br />\nin<br />\nso<br /><br />\nR. G. LOY and COMPANY<br /><br />\nPharmacists<br /><br />\nin.<br /><br />\nna<br /><br />\nye<br />\nco<br /><br />\nsp,<br /><br />\n100 UNIVERSITY PARKWAY<br />\nWest Corner Canterbury Road<br /><br />\nthe turmoil caused by the mud to<br />\nscore the Jay's final goal.<br />\n• The second string men were able Kodak&amp;<br />\nDeveloping<br />\nto keep the ball in the St. John's Cameras<br />\nPrinting<br />\nEnlarging<br />\nterritory for the remainder of the Supplies<br />\ngame, but they were unable to get<br />\n,<br />\nit past Merkle, who was aided great- zepp Photo Supply Co.<br />\nly by the absence of the thick mud<br />\n3044 Greenmount Ave.<br />\nat the lower goal.<br />\nLet Us Develop Your Films<br />\nThe committee is leaving nothThe line-up:<br />\nLeave Them Today—<br />\ndetailed<br />\naring undone in its very<br />\nHopkins<br />\nSt. Johns<br />\nGet Them Tomorrow<br />\nG<br />\nrangements. Special emphasis is Finn<br />\nMerkle<br />\nPhone UNiversity 3829<br />\nLeibensperger<br />\nP<br />\nBouchers<br />\nlaid on its plans to present a well- Mallonee<br />\nC P<br />\nMcCauley<br />\nHall<br />\nF D<br />\nDesantis<br />\nbalanced affair. Though sponsor- Kegan<br />\nA. H. FETTING<br />\nS D<br />\nJones<br />\nBoynton<br />\nTD<br />\nfestivithe<br />\nSenior<br />\nClass,<br />\ned by the<br />\nComedysMANUFACTURING JEWELRY<br />\nLang<br />\nC<br />\nClark<br />\nCO.<br />\nT A<br />\nties are to be shared in by under- Nixdorf<br />\nMiller<br />\nMorrill<br /><br />\nSti<br /><br />\n1 TIMES SQUARE<br />\n0<br />\nITY<br />\nST<br />\n)<br /><br />\nwith arms loaded with despised<br />\ntexts will be an innovation.<br />\nFor each out-door event, there<br />\nwill be an in-door place to shift<br />\ninto in case of unfavorable weather. Special arrangements will be<br />\nmade sufficiently far in advance<br />\nto meet such emergencies with no<br />\ndelay.<br /><br />\ngraduates and alumni,—in other Robinson (c).. .F.4EsieY<br />\nA . .(c) Gessner<br />\nLogan<br />\n0 H<br />\nCross<br />\nHopkins<br />\nmen.<br />\nwords by all<br />\nBiddison<br />\nI H<br />\nGarrison<br /><br />\nPc<br />\nth<br /><br />\nManufacturers<br />\nGREEK LETTER FRATERNITY<br />\nJEWELRY<br />\n2 1 3 N. LIBERTY STREE1<br /><br />\nstr<br />\nCc<br />\nph<br />\nslc<br />\nthc<br />\npu<br />\nan!<br />\nXL<br />\nto<br /><br />\nti<br />\ncr<br /><br />\npc<br />\nni<br />\nbe<br />\nliii<br />\nof<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER MAY 17, 1927<br /><br />\nINTERCOLLEGIATE<br /><br />\nSTUDEN7 COUNCIL DECREES WEARING OF<br />\nGREEN TIES BY NEXT YEARS FRESHMEN<br /><br />\nNEWS<br /><br />\nThe New Plan which has been<br />\nnursed along for the past two years<br />\n\" A most interesting letter has re- took a decided step• forward last<br />\ncently been received by this paper week and it now appears that this<br />\nfrom The California Daily Bruin,<br />\nnew project has finally_ shed its<br />\nthe student publication of the Uniswaddling<br />\nclothes.<br />\nversity of California, which clearly<br />\nNext year's freshmen will have a<br />\nevinces the continual progress beIt<br />\npapers.<br />\ndecidedly individualistic twist forced<br />\ning made by collegiate<br />\nstates that on May 28 the paper will upon them by way of a new regulapublish a twenty-four page news- tion which has been adopted by the<br />\npaper, the major part of which isStudent Council. Once freshmen<br />\nsue will be turned over to the outheads of the meek<br />\nstanding events of other colleges caps adorned the<br />\nand unassuming members of the enand universities of the country.<br />\ntering class to serve as a distinguish* * *<br />\nmark. Then they were discarded<br />\nThe age old question of the \"free- ing<br />\nof some unknown power,<br />\nby<br />\norder<br />\ndom of the press\" has once more<br />\nbecome the subject of discussion— and only black ties, black socks and<br />\nthis time at the University of Geor- freshmen buttons were required to<br />\ngia. Editors of the student publi- be worn by the newest members of<br />\ncation at that university have been<br />\nordered to absent themselves from FROSH TAKE TWO TENNIS<br />\nthe school because of committing<br />\nMATCHES IN ONE DAY<br />\nthe misdemeanor of ,daring to criticize University policies and certain Friends' School and Army-Navy Prep<br />\nSuccumb to Yearling Racqueters<br />\nmembers of the faculty: -They must<br />\nhave hit a sore spot.<br />\nDouble-headers in baseball are<br />\nfrequent enough, but it remained for<br />\nthe Johns Hopkins freshmen to<br />\nstage a double-header in tennis. Last<br />\nWednesday, the frosh took the<br />\nmeasure of the racquet wielders<br />\nfrom Army-Navy Prep and then<br />\nfollowed up their victory by decisively defeating Friends School.<br />\n• * *<br />\nAs far as can be ascertained this<br />\nWe have already become acis the first instance of any Baltimore<br />\nquainted with many of -the numertennis team playing two matches in<br />\nous perversities of the opposite sex,<br />\none afternoon and winning them<br />\nbut the present whim of the. coeds<br />\nboth. The men on the team who<br />\nat the University of Idaho is beplayed in both matches were comyond the reasoning powers of our<br />\npletely exhausted as the afternoon<br />\npoor faculties. The fair ones have<br />\ndrew to a close and, when the<br />\nactually agreed to go one-half of<br />\nmatches were clinched, forfeited<br />\nthe expenses on all dates.<br />\nseveral of the doubles.<br />\n* * *<br />\nThe feature match was the numThe University Hatchet of ber one singles match with Friends<br />\nGeorge Washington University has School in which Ed Devereaux trirecently announced an increased cir- umphed over Towner French in a<br />\nculation of one thousand copies over stirring three-set match. Both men<br />\ntheir former high water mark of displayed a fine brand of tennis, but<br />\n5,500 copies, making a total circu- in the last set Deveraux's greater<br />\nlation of 6,500, which thy claim is endurance proved to be the neceslarger than any other college week- sary margin of victory.<br />\nly publication in the United States.<br /><br />\n* * *<br />\nStuffed ballot boxes and campus<br />\n• politics will soon become things of<br />\nthe past at Stanford University.<br />\nVoting machines have recently been<br />\ninstalled in that most up-to-date institution for use in class elections.<br /><br />\n* * *<br />\nThe University of Texas, taking.<br />\ncognizance of the enormous strides<br />\nin advancement being made by the<br />\nso-called \"present generation\" has<br />\ninstalled a complete course in aeronautical engineering. The first two<br />\nyears will be a general engineering<br />\ncourse, but the last two will be on<br />\nspecialized aeronautical subjects.<br />\n* * *<br />\nThe feminine roomers across the<br />\nstreet from the men's dormitory at<br />\nColumbia University have complained that their morals are being<br />\nslowly ruined by the negligence of<br />\nthe aforesaid young gentlemen in<br />\npulling down the window shades<br />\nand by the folloWing disclosures.<br />\nMaybe the boys believe in: \"Do unto others . . . .\" •<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nThe desire for college educations and \"collegiatism\" is increasing rapidly in America. Reports show that college enrollment is growing faster than ever<br />\nbefore. Over 180 institutions of<br />\nhigher learning show an it.crease<br />\nof 11 per cent over last year.<br /><br />\n3<br /><br />\nSALADS<br /><br />\n•PASTRIES<br /><br />\nRolls and Fancy Cakes<br />\nPhone HOmewood 8993<br /><br />\nthe University:<br />\nFOOD SHOP—BAKERY<br />\nAt a meeting of the Student<br />\nCouncil held last Friday, however, it DELICATESSEN CONFECTIONERY<br />\nwas decided that something more<br />\nFred. Mueller, Prop.<br />\n20<br />\nEAST 21ST STREET<br />\nunusual should be used by the freshBaltimore, Md.<br />\nmen to distinguish this undergraduBox<br />\nLunches<br />\nfor Automobile and<br />\nate form the common herd. ConseCard Parties<br />\n•<br />\nquently the campus will be bedecked<br />\nby brilliant emerald green ties, the<br />\n•<br />\nTHE<br />\nwearers of which will be freshmen.<br />\nPEPPER POT<br />\nIn spite of opposition by \"Ned\"<br />\nTEA ROOM<br />\nAND<br />\nPassano, the project was finally<br />\nGIFT SHOP<br />\npassed. Passano held out for red<br />\n414 N. CHARLESST., BALTIMORE<br />\nties but finally when the question<br />\nwas put to vote, he voted for the emerald cravat. When green tie was<br />\ntwisted about a fore finger and held<br />\naloft, Passano voted \"aye\" with the<br />\nrest of the council—the boy's color<br />\nblind.<br /><br />\nUSE<br /><br />\nYELLOW CABS<br />\nNO CHARGE FOR<br />\nEXTRA PASSENGERS<br />\n'PHONE<br /><br />\nVERNON 1212<br />\nA. HOLT Inc.<br />\nEbtlin.g &amp;Thee<br /><br />\n,,ijarrialitv<br /><br />\n2022 N. Charles St.<br /><br />\nAN OPPORTUNITY<br /><br />\nfor pleasant and profitable work<br /><br />\nDR. SWARTZ DELIVERS<br />\nSECOND LECTURE<br /><br />\nSee<br /><br />\nTakes Up Astronomical and Physical<br />\nEvidence of His Beliefs<br /><br />\nDr. C. K. Swartz, Collegiate<br />\nProfessor of Geology, presented<br />\nlast Thursday the second of his series of four lectures . on \"Fundamental Problems Concerning the<br />\nRelations of Science and Religion.\"<br />\nAgain, the lecturer spoke to an audience of a size beyond the normal<br />\ncapacity of the room.<br />\nIn the previous lecture, Dr.<br />\nSwartz had devoted his time to a<br />\ndefinition of his terms (the mechanistic and vitalistic concepts), an assertion of his personal belief in the<br />\nlatter theory and a promise of proof<br />\nof this view in seven points, which<br />\nwould encompass astronomy, physics, biology, geology, morals, mind<br />\nand self-consciousness..<br />\nIn this lecture, he used astronomy and physics for instruments of<br />\nverification. He pointed , outl that<br />\nthe mechanistic mode of thought<br />\nhad a precarious basis upon the assumption that the universe is eternal. His work was to shatter this<br />\npremise.<br /><br />\nCARL F. NEW, Manager<br /><br />\nSUN LIFE ASSURANCE COMPANY OF CANADA<br />\n604 AMERICAN BUILDING<br /><br />\nPractice Saving Money —<br />\nThrift- that is, the art of systematic saving- conserves and accelerates<br />\nthe power of knowledge. Money in the<br />\nbank often leads to greater opportunity.<br />\n4%0N SAVINGS - NATIONAL BANK PROTECTION<br /><br />\nTHE NATIONAL BANK of BALTIMORE<br />\n\"Oldest Bank in Maryland\"<br />\nBALTIMORE AND ST. PAUL STS, (Since 1795.)<br /><br />\nAstronomical Evidence<br /><br />\nBy quoting the findings of a long<br />\nlist of eminent astronomers, such<br />\nas the President of the AstronomLOCAL NUMBER OF JAY<br />\nical Society of Great Britain, SiContinued front Page 6, Col. 1<br />\nmon Newcomb, Russell, Young and<br />\nEvening Sun is not quite so well others, he indicated these<br />\nscientists<br />\ndone, although the sketch of<br />\ncame to a conclusion diametrically<br />\nModish Mitzi's Fashion Activities opposed<br />\nto the mechanistic view.<br />\nand the comic page get.close reEvidence gathered by these astronsemblances to the originals. omers<br />\nconclusively shows that' not<br />\nGeorge Bungle, as depicted by only is the world<br />\nnot eternal, but<br />\nReese, looks a little bedraggled. that it cannot<br />\nbe very old.<br />\nPerhaps he is worrying too much<br />\nThe notable exponents of contraover the lost photograph of diction of this chemical-physiologTobias.<br />\nical-deterministic belief in the field<br />\nThree books come under the of physics are R. A. Millikan and<br />\nscrutiny of the book reviewer Clerk Maxwell. The latter partic-.<br />\nwhile the dramatic critics lavish ularly has contributed a smashing<br />\npraise on Mrs. Fiske, George Ar- blow at the eternal-universe prinliss and \"Trelawney of the ciple by his enunciation of the SecWells.\"<br />\nond Law of Thermodynamics. This<br />\nOf the work by staff members, latter theory points unequivocally<br />\nthe breezy poem illustrated by to a metaphorical evanescence of<br />\nChapman ranks first. \"The cast- this universe instead of an eternaling director joke,\" comnlented on ity.<br />\nfavorably in our last review, is<br />\nPromise of still more illuminatagain dragged out for its second ing flashes are held out in Dr.<br />\nappearance. Last month it was Swartz's future lectures, which will<br />\nprinted under a Russian sketch by adduce evidence from his own field,<br />\nEldridge. In this issue it is buried and those bugaboos, the trilogy of<br />\namong the advertising on page 3. mind, morals, and self-consciousIt's pretty good; boys, but not ness. The dates are May 19 and<br />\n26. All students are invited to atworth a curtain call.<br />\nG. E. B., JR. tend.<br /><br />\nDrink<br /><br />\n9<br /><br />\nin cash prizes<br /><br />\nDelicious and Refreshing<br /><br />\nHave you seen the announcement<br />\nof the $30,000 Coca-Cola prize contest—out this month in the following magazines?<br />\nThe Saturday Evening Post. .May 7<br />\nMay 14<br />\nLiterary Digest<br />\nCollier's Weekly. . May 21<br />\nLiberty<br />\nMay 14<br />\nLife<br />\nMay 5<br />\nKeep your eyes open to Coca-Cola advertising for the next three months —in these<br />\nmagazines, many newspapers, posters and<br />\noutdoor walls and signs; in the displays in<br />\ndealers'show windows and in soda fountain<br />\nand refreshment stand decorations.<br />\nFollow this contest and win a prize of real<br />\ncash.<br />\nThe Coca-Cola Co., Atlanta, Ga.<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER MAY 17, 1927<br /><br />\n4<br />\nPROGRAMS CAUSE RENEWED<br />\nINTEREST IN JUNE<br />\nWEEK ACTIVITY<br />\nNew Features Incorporated in Attractive Schedule Lower Cost<br />\nto Student<br /><br />\nWith June Week programs before the student body in circular<br />\nform, every undergraduate who<br />\nlikes a good time, in nearly every<br />\nsense of the word, is beginning to<br />\nlook over and beyond the final<br />\nexam hazard to the merry period<br />\nof post-mortem festivities.<br />\nThe announcement of the events<br />\nis couched in terms of cold formality which fail to give any inkling of the quantity, quality, and<br />\nvariety of whole-hearted pleasure<br />\ncrowded into one enthusiastic<br />\nweek of merrymaking.<br />\nJune Week programs vary little from year to year, but the committee feels that, under the leadership of Thomas F. McNeal, several distinctive features place this<br />\nyear's program in a class by itself.<br />\nAn All-Hopkins Affair<br /><br />\nMARKLE ELECTED TO<br />\nSTUDENT COUNCIL<br />\nJohn. Markle was elected<br />\nSophomore delegate to the<br />\nStudent Council for the year<br />\n1927-'28 at the last meeting<br />\nof the Freshman Class held<br />\nafter the assembly on Thursday. According to a ruling<br />\nof the Council, the number<br />\nof votes polled by the different candidates cannot be<br />\nmade public. The other<br />\nnominees for the office were<br />\nSmith, Gettemuller, Gould,<br />\nGhent, Zepp, Young.<br />\nPLAYSHOPPERS PAY VISIT<br />\nTO EASTERN SHORE<br />\n\"The Great Galeoto\" Presented Before<br />\nLarge Audience in Salisbury<br /><br />\nMembers of the cast of \"The<br />\nGreat Galeoto,\" the Homewood<br />\nPlayshop's latest play, were very<br />\nenthusiastically received • in Salisbury, Maryland, last week. Their<br /><br />\nThe first of these features is trip to the Eastern Shore metropthe fact that this June Week cele- olis was undertaken for the benebration is to be an all-Hopkins lit of the Maryland Tuberculosis<br />\naffair. Except for the Senior As<br />\nBall, Baccalaureate Service, and<br />\nThe entire cast consisting of<br />\nconferring of degrees, for which<br />\nDr. john Earle Uhler, I. Evans<br />\nthere are not sufficient accommodations on the campus, all the Rodgers, Frances Levee, John<br />\nweek's activities will be conduct- Gorgi, Emi,ly Austin, Cyril Abed at Homewood. Furthermore, bott, Ralph Townsend and Elise<br />\nthe June Week tickets will be Cohen left Baltimore at six o'clock<br />\nprinted in a fool-proof form. A on Monday morning. During their<br />\ntriple-classified record of senior,<br />\nstay the Playshoppers played at<br />\nundergraduate, and alunini atthe Arcade Theatre before capactendants will be kept.<br />\nAll refreshments will be includ- ity audiences. Practically the ened this year in the price of June tire student bodies of the Normal<br />\nWeek tickets. The committee School, at Salisbury, and the Salhas provided for the serving of isbury High School turned out to<br />\nrefreshments at the various func- witness the performance. Everytions free of charge. This is a<br />\none was enthusiastic in acclaimgreat improvement,.for the stuing the \"Great Galeoto.\" On Mondents, over last year's arrangeday afternoon the amateur actors<br />\nments.<br />\nIn the third place, the platform were entertained at a reception<br />\nto be erected in the Dormitory<br />\nCourt this year has been \"guaranteed\" not to warp. The area of<br />\nthe floor will be exceptionally<br />\nlarge, measuring forty by eighty<br />\nfeet.<br />\nExcellent music<br />\nFourthly, the appropriate solution of the long-discussed musical<br />\nproblem by the engagement of<br />\n\"Bob\" Iula's and the Blue Jay Orchestras will attract many prospective celebrators. The former<br />\norchestra, twenty pieces in num-<br /><br />\nSTRAYER'S<br /><br />\nTHE EIVIANUEL PRESS<br />\nINCORPORATED<br /><br />\nPRINTING<br /><br />\nBUSINESS COLLEGE<br />\nCharles and Fayette Sts., Baltimore<br />\nSECRETARIAL, STENOGRAPHIC<br />\nand ACCOUNTING COURSES<br />\nDay and Night Classes All the Year<br /><br />\nENGRAVING<br /><br />\nEMBOSSING<br /><br />\n203 WEST FRANKLIN STREET, BALTIMORE<br />\nTELEPHONE VERNON 4519<br /><br />\nYou May Enter at Any Time<br />\nCall, write or phone PLAZA 5626<br />\nfor complete information<br /><br />\nESTABLISH1i0 1818<br /><br />\nTHE WOODROW<br />\nWILSON<br />\nFOUNDATION<br /><br />\nCLOTHING<br />\n-<br /><br />\nlintiltutettv Wurntolltn49tioatf,<br /><br />\nannounces a<br /><br />\nMADISON AVENUE COR. FORTY-FOURTH STREET<br />\nNEW YORK<br /><br />\n$57,000<br />\nPRIZE ESSAY<br />\nCONTEST<br /><br />\nOur Representative will be at<br /><br />\nTwo $25,000 prizes for the<br />\nbest 2,500 word essays written by a young man and a<br />\nyoung woman between 20<br />\nand 35 on the subject -What<br />\nWoodrow Wilson Means to<br />\nMe\"<br />\nand<br />\nSeven Thousand Dollars in<br />\nSupplementary Prizes<br /><br />\nThe BELVEDERE<br />\nToday, and Tomorrow<br />\nMay 17 and 18<br /><br />\nYOU HAVE ALL<br />\nVACATION TO<br />\nCOMPETE<br /><br />\nSendfor BROOKS'S Miscellany<br /><br />\nContest closes October 1st<br />\nFor Special Prize Rules write<br />\nThe Woodrow Wilson<br />\nFoundation<br />\n17 E. 42nd St.,<br />\nNew York City<br /><br />\nBi<br />\n08 T 0 N<br />\nLIMA 111111.0.0<br />\n.1.104<br /><br />\nPALM BEACH<br /><br />\nNEWPORT<br /><br />\nPLAZA suILDING<br />\n•<br />\nC • tp •<br />\n•.•<br /><br />\n•UORAIN<br />\n220 0“..1•.. Anow.<br /><br />\nof<br /><br />\nop<br />\ncal<br />\ncal<br />\nA1<br />\nth(<br />\nlo<br /><br />\nMi<br />\nlet<br /><br />\nIIipmull1111111<br />\nIII11<br />\n\"1 1\"\"\"4;11(11CIIIIIIIIII<br />\nkill<br /><br />\n!Ill<br /><br />\nIan<br /><br />\npei<br />\nprc<br /><br />\ni 1 ,1 .1.1,1,1 1 1I 1 1 1,1<br /><br />\nme<br />\nint<br />\nma<br /><br />\nheld in their honor by Mrs. Tilghman, of Salisbury.<br /><br />\nraj<br />\nper<br />\nzat.<br /><br />\nThey left for Baltimore at six<br />\no'clock on Tuesday morning in<br />\norder to reach Homewood in time<br /><br />\ntwc<br />\nfan<br /><br />\nfor the reception held that afternoon in honor of Miss Eva Le<br />\nGallienn e.<br /><br />\nCotillon Club To Hold<br />\nDance Saturday Night<br /><br />\n111111111111<br /><br />\n111101111,<br /><br />\nA dance will be held by the Co-'<br />\nber will play at the Senior Ball tillon Club at the Belvedere Hotel,<br />\nand at the dances in the Dormi- this Saturday night after the Marytory Court. The Blue Jays are to land lacrosse game. The admission<br />\nfurnish the music for all other will be $2 a couple, or $1.50 stag.<br />\ndances.<br />\nMusic by ,Bob Iula will last from<br />\nThe L'Hirondelle-New Roch- 9 until 10 o'clock.<br /><br />\nelle lacrosse tilt should prove enticing to all lacrosse lovers, while<br />\nNEW PLAN DISCUSSED<br />\nthe inter-fraternity ball game will<br />\nContinued on Page 2, Col. 3<br />\namong other indistinguished<br />\nis<br />\nbe witnessed by many fans. Both<br />\nare a part of the June Week stitutions of the country, in that<br />\nthe government of student affairs<br />\nschedule.<br />\nReunions of the last five grad- is managed solely by the students<br />\nThis places a great<br />\nuating classes, including a ban- themselves.<br />\nshoulders of<br />\nquet for each class, are being plan- responsibility on the<br />\nthe<br />\ncompose<br />\nto<br />\nchosen<br />\nned with the co-operation of the the men<br />\ncouncil.<br />\nvarious alumni representatives. governing<br />\n\"Therefore, I urge you to<br />\nThe atmosphere will be that of a<br />\nchoose men of character, honesty,<br />\ngreat home-coming week.<br />\ndecision—men you can trust—to<br />\nA big \"fire of knowledge,\" enrepresent you in this important<br />\ncircled by a procession of seniors<br />\nmatter.\"<br />\nContinued on Page 2, Col. 4<br /><br />\n% alb<br /><br />\nyot.<br />\nIan(<br />\nSc<br />\nchii<br />\nin I<br /><br />\n'1111<br /><br />\nModern smoking pleasure<br />\nthat never fails<br />\nTHE smokers of this age are the most<br />\nindependent ever known. Accepting<br />\nno hearsay, they have smoked out the<br />\nfacts. They have learned that the<br />\nchoicest Turkish and Domestic tobaccos grown are rolled into Camels,<br />\nthat here is the incomparable blending for goodness, that Camels simply<br />\nnever tire the taste.<br />\nCamel is the ciprette that never<br />\nfails to please the modern age. Regardless of how often you want the<br />\ncomfort of a smoke, of how steadily<br />\nyou light one after another, Camel<br /><br />\nwill never fail you, never give you<br />\nany but the finest thrill of smoking<br />\npleasure. This is why Camel's popularity,by far the largest in the modern<br />\nworld, keeps overwhelmingly in the<br />\nlead. As modern taste becomes more<br />\ninsistent upon choice tobaccos, increasing millions discover Camel's incomparable mildness, smoothness and<br />\nmellowness.<br />\nIf you want the cigarette that's<br />\ngood to live with from morn to midnight,the one that is the choice of the<br />\nmodern age, Have a Camel!\"<br /><br />\nR. J. REYNOLDS TOBACCO COMPANY, WINSTON-SALEM. N. C.<br /><br />\n0 1927<br /><br />\nest(<br />\nrep:<br />\nhou<br />\nsale<br />\nViSC<br />\nposi<br />\nerei<br />\ntrac<br />\nand<br />\nwe(<br />\nthos<br /><br />\nStth<br />\nsew<br />\nspec<br />\nExc<br />\nduni<br /><br />\nsent<br />\nmill-<br /><br />\nrH E<br /><br />\nJOHNS HOPKINS NEWS-LE ITER. MAY 17. 1927<br /><br />\n5<br /><br />\nND THE WORLD<br /><br />\nNOMINATIONS FOR THURSDAY'S ELECTION<br /><br />\nSecond Year<br /><br />\nCOLLEGE CRUISE<br />\nS. S. FtYNDAM<br /><br />\nDELEGATES TO THE A. A. BOARD<br />\nFOR PRESIDENT OF THE<br /><br />\nSeniors<br /><br />\nJuniors<br /><br />\nSophomores<br /><br />\nAlumni<br /><br />\n(Vote for 5)<br /><br />\n(Vote for 3)<br /><br />\n(Vote for 2)<br /><br />\n(Vote for 1)<br /><br />\nSTUDENT<br />\nCOUNCIL<br /><br />\nBauernschmidt<br />\nBiddison<br />\n(Vote for 1) Blandi<br />\nBoynton<br />\nBiddison<br />\nCarroll<br />\nBlandi<br />\nKaufholz<br />\nBoynton<br />\nKaufman<br />\nRodgers<br />\nLeibensperger<br />\nWarfield<br />\nMallonee<br />\nMcElfresh<br />\nProctor<br />\nScheidt, V.<br /><br />\nAllen<br />\nCaplan<br />\nHelfrisch<br />\nHershey<br />\nHiss<br />\nKegan<br />\nNice<br />\nRichards<br />\nSchiebel<br /><br />\nCiscle<br />\nHall<br />\nLang<br />\nLyons<br />\nScheidt, W.<br />\nYoung<br /><br />\nSEPTEMBER TO MAY<br />\nContinue your regular academic course aboard the S.S.<br />\nRyndam, while visiting 25 countries.<br />\nA real college with a faculty<br />\nof experienced educators.<br />\nBasketball, baseball, tennis,<br />\nsoccer, swimming, with teams<br />\nof foreign universities.<br />\nA University Afloat for men<br />\nonly.<br />\nEnrollment limited to<br />\n375-17 years or more of age.<br />\nFor illustrated booklets, description of courses, map of Itinerary and cost of a school year<br />\nof travel, write:<br /><br />\nAbraham<br />\nGwinn<br />\nRobinson<br />\nGraduate<br />\n(Vote for 1)<br />\nEdwards<br />\nFarinholt<br />\nMorrill<br />\nMedical<br />\n(Vote for 1)<br />\nMagill<br />\nWolbert<br /><br />\nUNIVERSITY<br />\nTRAVEL<br />\nASS'N., INC.<br />\n285 Madison Ave. t7t.:11<br />\nNew York City<br /><br />\nHoward &amp; LexingtonS<br /><br />\nNo proxies will be accepted. All votes must be handed in in person between 11.30 A.<br />\nM. and 1:00 P. M., Thursday, May 19. Unsigned ballots will not be counted.<br /><br />\nTEWART&amp;<br /><br />\nco.<br /><br />\nCAlvert 6060<br /><br />\nMEN'S INTERWOVEN SOCKS<br />\nWe carry a full line of these Nationally known socks - mercerized cotton, rayon and silk, plain colors and fancies; all sizes<br />\nfm men and young men. Priced according to quality<br />\n35c to $1.00 a pair<br /><br />\nBUREAU ANNOUNCES LIST<br />\nOF SUMMER JOBS<br />\nBureau of Appointments Issues List of<br />\nVacation Positions<br /><br />\nMiss Bernadette Judge, in charge<br />\nof the Bureau of Appointments, recently announced a list of positions<br />\nopen to students for the coming vacation season. Further particulars<br />\ncan be obtained from the Bureau of<br />\nAppointments which is located in<br />\nthe Registrar's office.<br />\nThe list of positions open follows:<br />\nCounsellor wanted for boys' camp.<br />\nMust be Capable of directing .athletics.- Season—July and August.<br />\nTeacher of Latin and German<br />\nwith A. B. degree and teaching experience wanted for 1927-28 by a<br />\nprogressive private school in Baltimore.<br />\n: Personnel assistant of a Department Store in Baltimore wishes to<br />\ninterview Seniors in regard to permanent positions.<br />\nSenior with experience In stenography and typewriting wanted for<br />\npermanent position in office organization of an old Baltimore firm.<br />\nBaltimore representative needs<br />\ntwo salesmen for new type electric<br />\nfan—commission 15%.<br />\nSeveral sales positions open for<br />\nyoung- men in Baltimore, Cumberland, and Hagerstown in Dayton<br />\nScale Division of large business machines company with branch office<br />\nin Baltimore.<br />\nStudents wanted who are interested in a good summer position,<br />\nrepresenting the largest publishing<br />\nhouse in the business, as student<br />\nsalesmen, team captains and supervisors. Students who will be in a<br />\nposition to travel will be given preference. This is an eleven week contract job from June to September,<br />\nand will pay a salary of $24.00 per<br />\nweek, plus a tuition of $175.00 to<br />\nthose who qualify.<br />\nTown and Country, International<br />\nStudio and Harper's Bazar desire<br />\nseveral active representatives for<br />\nspecial campaigning in advertising.<br />\nExcellent opportunity for students<br />\nduring vacation period.<br />\nStudents wanted as service representatives for a large silk hosiery<br />\nmill—extremely good pay.<br />\nNOTICE<br />\nSenior<br /><br />\nclass<br /><br />\nmeeting<br /><br />\n‘.SVI1NIG70<br />\n7•<br /><br />\nETHOLINE<br /><br />\nBETTER<br />\nRESULTS<br /><br />\n\"THE WONDER MOTOR FUEI:<br /><br />\nARLINGTON HOTEL<br />\nIDEAL DOWNTOWN LOCATION<br />\nOne ,Ff<br />\n, the 4-M 7-/otels<br /><br />\nSHERWOOD BROS., INC.<br /><br />\nc4'2ways<br /><br />\nOTHER.<br /><br />\nCAIRO<br />\n4-M It COLONIAL<br />\nFAIRFAX<br /><br />\nA ROOM<br />\nWITH<br />\nRUNNING<br />\nWATER.<br /><br />\nHOTELS It MARTINIQUE<br />\nWashinIton,D.0<br /><br />\nEdge worth<br /><br />\n4.0<br /><br />\nTILDEN HALL<br /><br />\nOPERATED BY<br /><br />\nA ROOM<br />\nWITH<br />\nPRIVATE<br />\nBATH<br /><br />\n2.<br /><br />\nMADDUX, MARSHALL, MOSS<br /><br />\nEr MALLORY /A/c.<br /><br />\nWRITE FOR A fRff COPY OF OUR 1 1.00 PICTORIAL GUIDE MAP OF WASHINGTON<br /><br />\nis every<br />\npipe's<br /><br />\nlover<br /><br />\n,<br /><br />\nCLOTHES<br />\nReady-made<br />\nAnd Cut to Order<br />\nESTABLISHED ENGLISH UNIVERSITY<br />\nSTYLES, TAILORED OVER YOUTHFUL<br />\nCHARTS SOLELY FOR DISTINGUISHED<br />\nSERVICE IN THE UNITED STATES.<br />\nefillpf<br /><br />\nS<br /><br />\n'The College Graduate<br /><br />\nQ7ttlxvicer honse<br />\nSuits and Topcoats<br /><br />\nwho is to be a success in life, should start to save<br />\nimmediately. An endowment life insurance policy<br />\nin this company offers one of the best methods of<br />\nenforced monthly saving.<br /><br />\n4<br />\n•<br /><br />\n$40,$45,$50<br /><br />\ne<br />\nLIFE INSURANCE COMPANY<br />\nOF BOSTON. MASSACHUSETTS<br />\n111•1•111...<br /><br />\nYou are invited to enroll in our<br /><br />\nSUMMER SCHOOL<br />\nSPECIAL COURSE<br />\nIS OFFERED<br /><br />\nSTUDENTS OF JOHNS HOPKINS<br />\nUNIVERSITY<br />\nDURING JUNE, JULY and AUGUST<br />\nSECRETARIAL SUBJECTS<br />\nSHORTHAND, TYPEWRITING, FILING and ACCOUNTS<br /><br />\nBY SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br /><br />\nQ:hrtrter*mu<br />\nof Baltimore<br />\nThe character of the suits and<br />\ntopcoats tailored by Charter House<br />\nwill earn your most sincere liking.<br /><br />\nHub<br /><br />\nEATON &amp; BURNETT BUSINESS COLLEGE<br />\ntoday,<br /><br />\n12:20, Room 109 M. E. Building.<br /><br />\nTake The<br />\nQuickest Road<br />\nTo<br /><br />\nPresent Address, 9-11 WEST BALTIMORE STREET<br />\nAfter June 1-7-9 EAST BALTIMORE STREET<br />\nSEND FOR TERMS and FULL INFORMATION<br />\nPHONE PLAZA 2q27<br /><br />\nMAKE YOUR SUMMER PAY<br /><br />\nCharles and Fayette Sts.<br />\nMIN11/1<br /><br />\n-<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER. MAY 17, 1927<br /><br />\n6<br /><br />\nLOCAL NUMBER OF BLACK ALL ATTEMPTS OF BLUE JAY TO ENTICE<br />\nAND BLUE JAY EVOKES<br />\nGOUCHER STUDENTS COME TO NAUGHT<br />\nGREAT MIRTH<br />\nThe editors of The Black and notices on the official bulletin boards<br />\nBlue<br />\nJay considered the students of in the various buildings comprising<br />\nShort<br />\nFar<br />\nFalls<br />\nNew Issue, However,<br />\nGoucher College among the lumi- the Goucher Campus.<br />\nof Famed Celebrity Number<br />\nof Last Year<br />\nnaries of Baltimore. So they asked<br />\nWhen the Goucher Press Club,<br />\nfor a page of contributions from the<br />\nLocal newspapers come in for<br />\nfair Goucherites along with other after still more careful considerathe lion's share of the punishment<br />\ntion, decided that The Black and<br />\nBaltimore celebrities.<br />\ndoled out by the current number<br />\nBut the editors of the various Blue Jay was not the kind of a jourof the Black and Blue Jay. The<br />\nGoucher publications did not con- nal for its charges to contribute to,<br />\nBaltimore News takes its razzing<br />\nsider The Black and Blue Jay a cel- it issued an edict proclaiming that<br />\nwith a scare head proclaiming to the<br />\nebrated magazine in any sense of \"contributions to. such magazines<br />\nworld that Peaches has lost. The<br />\nwere against all precedent, since the<br />\nEvening Sun is parodied by means the word. So the fair Goucherites<br />\nwere not allowed to besmirch the Goucher Press Club had never perof an editorial page, a woman's<br />\ntalent which made Goucher famous mitted contributions to any journal<br />\nsheet and a page of garbled con-ifor its clean journals by contributing of which there was not a similar one<br />\nics.<br />\npublished by students of Goucher<br />\nto The Black and Blue Jay.<br />\nThe cover by Banks, depicting<br />\nWhen the editors of The Black College.\" So as the result of this<br />\na Baltimore street of the future<br />\nand Blue Jay after careful consider- cruel and bold edict all would-be<br />\nshows some careful work in the<br />\nation decided that the fair Goucher- contributors to the famous Blue Jay<br />\nmatter of perspective. The color<br />\nites should by all means be repre- were warned that they must not on<br />\nscheme, however, is a bit weird<br />\n, well anyway it<br />\nsented along with all the other ce- penalty of<br />\nwith buildings painted a vivid<br />\nterrible.<br />\nwas<br />\nposted<br />\nlebrities of Baltimore, they<br />\norange.<br />\nThe impressionistic frontispiece DEBATERS WIN AND LOSE Garis Again Wins<br />\nTO SOUTHERNERS<br />\nby Yardley of The Sun might be<br />\nAbercrombie Cup<br />\na graphic reprqsentation of an<br /><br />\nSAVINGS ACCOUNTS AN IN- of gold and precious jewels; but as<br />\nDEX OF PROGRESS<br />\nthese hidden treasures were often<br />\nstolen or seized by force very few<br />\nThey May Be Opened at Barn During<br />\npeople were able to save money.<br />\nAll of This Week<br />\nOne of the most important invenPlato, Buddha, Julius Caesar, tions of modern civilization was a<br />\nChristopher Columbus, and hosts of safe way to save—with a plan for<br />\nothers were unquestionably great actually paying the individual for<br />\nmen—immortal figures in the his- his thrift that each day becomes intory of the world—but since their creasingly popular. The first organtime the world has whirled around ized savings bank was established at<br />\nmany, many times and situations Brunswick in 1765, and the growth<br />\nand opportunities are markedly dif- of savings accounts since this time<br />\nferent from those of ancient or me- has been tremendous. Naturally the<br />\ndieval days. Usually we are all sat- first to utilize the advantages of<br />\nisfied to call this change \"the on- banks were those in the vanguard of<br />\nward march of civilization\" without progress.<br />\nparticular reflection as to just what<br />\nAs a college man you already<br />\nit is all about anyhow. Trans-oceanic have a front seat in this vanguard<br />\nflights, a vast and complex economic of progress. Do you intend to hold<br />\nand industrial organization, have re- on to the advantageous position<br />\nplaced the crude methods of feudal which your education gives you?<br />\ndays. The opportunity to save with You don't if you have not got a savsecurity is one of the outstanding ad- ings account. Open one at the Barn<br />\nvantages of our modern society. None<br />\nat lunch-hour any day this week<br />\nof these truly great men had the op\"The Oldest • Bank in Maryportunity to safely save that you with<br />\nNave today—and fortunes in their land\"—The National Bank of Baltidays were in the form of buried pots more.<br /><br />\nNegative Teams of Washington and<br /><br />\nafter<br />\ndream<br />\nLeading by seven-tenths of a<br />\nundergraduate's<br />\nLee and Hopkins Best<br />\nOpponents<br />\nsteak.<br />\ndormitory<br />\nRobert W. Garis, captain of<br />\npoint,<br />\ndowning a<br />\nRead's, Vagabond Theatre, WashDebating the Washington and the Rifle Team, again won that<br />\nington's Monument and the Lee Affirmative team in the Civil team's annual Abercrombie Cup<br />\nMaryland Institute are all scram- Engineering Hall Friday night, J. contest. As Garis won the cup last<br />\nCary Thompson and Norman B. year, he has set a mark by winning<br />\nbled into an amusing bodge<br />\nGardiner, Jr., the Hopkins Negative<br />\nthe prize for two years, successively.<br />\npodge.<br />\ndebaters, were again awarded a two<br />\nOnken's sketch of Dr. Ames to one decision. The question of<br />\nThe success of the riflemen was<br />\nby averaging the total<br />\ndetermined<br />\npresents a fairly good likeness.<br />\nwhether or not there should be a<br />\nMr. Strickland Gillilan's essay uniform marriage and divorce law score of the match with the average<br />\non banquets is the best humorous for the United States was once score of the shooting for the whole<br />\nmore the subject of discussion.<br />\nseason.<br />\narticle in the entire Jay. The<br />\nW.<br />\nH.<br />\nB.<br />\nMaynard<br />\nWagand<br />\nJ.<br />\nThe sharpshooters' final averages<br />\nBrazilian pheasants whose meat<br />\nner, representing Washingion and<br />\nconas follows: Garis, 283.4; Glantz,<br />\nare<br />\n\"dehydrated<br />\nas<br />\nhe describes<br />\nLee, made excellent speeches on the<br />\ndor-bosom,\" flashlight photo- question. Wagner's rebuttal, which 282.7; Baird, 271.3; Magness,<br />\ngraphers who shot off a blast of came near to filling the negative's 264.2; Bussard, 261; Muir, 260.4.<br />\npowder at the inopportune time contentions as full of holes as a<br />\nReiblich, a member of the team,<br />\nsieve, was particularly worthy of<br />\nand toastmasters who insist on<br />\ndid not compete in the match. His<br />\nmention.<br />\nmispronouncing one's name, are<br />\naverage for the year, however, acNiles Presides<br />\nall satirized in Gillilan's clever<br />\nDonald C. Niles, secretary-treas- cording to statistics of Lieutenant<br />\nstyle.<br />\nurer of the Debating Council, preEdmund Duffy, who wields his sided at the debate. Niles took great Offley, coach of the team, was 272.<br />\nThe cup, which has been in existcharcoal to supply The Baltimore pleasure in holding the audience and<br />\nslowly<br />\nin<br />\nhe<br />\nsuspense<br />\nwhile<br />\nspeakers<br />\nSun with its daily cartoon has an<br />\nence for three years, will be, as has<br />\ncontaining<br />\nenvelopes<br />\nthe<br />\ntore<br />\nopen<br />\namusing sketch of a ponderous<br />\nthe judges' votes, and read their de- been previously announced, presentWho<br />\nAin't<br />\n\"Who<br />\nvolume entitled<br />\ncisions:<br />\ned to Captain Garis.<br />\nIn America.\" The poems by Mr.<br />\n1. Affirmative.<br />\nNyburg are both clever bits of<br />\n2. Negative.<br />\nimmorthe<br />\nof<br />\nspeaking<br />\nverse but<br />\n3. Negative.<br />\nPRODV.cT10N OF<br />\ntality of the \"man whom Al<br />\nThe three judges secured by Niles<br />\nTHE<br />\nknows,\" have you noticed that for the occasion were Dr. Ellen<br />\nIC<br />\n\"Regular Fellows\" have chased Lunn and Mr. C. I. Winslow, Pro*S.<br />\nhim off the funny sheet. •<br />\nfessors at Goucher College, and Mr.<br />\n/0/<br />\nThe most ridiculous affair in Chester F. Morrow, a well-known<br />\nthe entire magazine is the as-. member of the Baltimore Bar Assotounding discovery of the learned ciation.<br />\ndoctor whose name smacks of the<br />\nBull and O'Dunne Lose<br />\nAt the same time that the Hopfictitious. This thesis is a combination of Jule Verne, Tom kins Negative was meeting the<br />\nSwift and Hans Christian Anderson with all of the asininities of<br />\neach. Incidentally the illustration accompanying the article<br />\nshould be kept away from small<br />\nchildren.<br />\nFelix Morley, brother of Christopher, moans of the trials and<br />\ntribulations of being the younger<br />\nbrother of a luminary. So pathetic was his wail that the Editor<br />\nwas forced to pen a few consoling<br />\nwords at the end of the article.<br />\nThe take-off on Mr. Hearst's<br />\ndaily evening outrage is good, especially the illuminating photodiagrams. The parody on The<br />\nContinued on Page 3, Col. 2<br /><br />\nWashington and Lee Affirmative<br />\nteam here, Robert L. Bull and Eugene O'Dunne, Jr., were debating<br />\nthe latter's Negative team at Lexington, Virginia. Their part of the<br />\ndual debate was lost by a vote of<br />\ntwo to one.<br />\nThe dual debate concluded one of<br />\nthe most active seasons that the<br />\nHopkins Debating Council has ever<br />\nhad. Besides holding the debates<br />\nFriday and the two inter-class arguments, Hopkins has participated in<br />\nthree intercollegiate debates this<br />\nyear—with the University of North<br />\nCarolina, with Davidson College,<br />\nand with Wake Forest College. Two<br />\nof these debates were lost.<br /><br />\nna-As<br /><br />\nREAD-TAYLOR<br />\nCOMPANY<br />\nEngraving Printing Binding<br /><br />\nMANY J. H. U. GRADUATES<br />\nNOW OWNConnecticut Mutual Contracts<br /><br />\nCONNECTICUT MUTUAL LIFE INS. CO.<br />\nROGERS R. KRAUK<br />\n502 Citizens Bank<br />\nBuilding<br /><br />\nPlaza 2581<br /><br />\nTHE UNION SHIPBUILDING COMPANY<br />\nHAS FOR SALE<br />\nBOATS, ANCHORS, LIFE PRESERVERS, CUSHIONS, LANTERNS, COMPASSES, FIRE EXTINGUISHERS AND OTHER USED EQUIPMENT FOR<br />\nSMALL BOATS AND SHORES.<br /><br />\nSTRAP WATCHES<br />\nThe graduation gift for men<br /><br />\nHENNEGEN-BATES COMPANY<br />\nJewelers and Silversmiths Since 1 857<br />\n7 East Baltimore Street<br />\nBaltimore<br /><br />\nTHE GIANT<br />\nPOWER FUEL<br /><br />\nEsso<br /><br />\n\"STANDARD\" MOTOR OIL<br />\nYOU CAN ACTUALLY FEEL THE DIFFFRENCE<br /><br />\nSTANDARD OIL COMPANY [N. J.)<br /><br />\nDEPENDABLE<br /><br />\nJ. H. FURST CO.<br /><br />\nHOOD TIRES<br /><br />\nPrinters of<br />\nPHILOLOGICAL &amp; SCIENTIFIC<br />\nPUBLICATIONS<br />\n23 S. Hanover St., Baltimore__<br /><br />\nMARTIN J. BARRY<br />\nCharles &amp; Lanvale Sts.<br /><br />\nCarl J. Doederlein<br /><br />\nCUrtis 0184<br /><br />\nBALTIMORE, MD.<br /><br />\nBox 475<br /><br />\nINVESTMENT SECURITIES<br /><br />\nTHE SUMMIT<br /><br />\nWATCHES,<br /><br />\nSTEIN BROS. &amp; BOYCE<br /><br />\nBaltimore's Country \"NIGHT CLUB\"<br /><br />\nDIAMONDS, JEWELRY<br /><br />\nESTABLISHED 1853<br /><br />\nFine Watch, Clock &amp; Jewelry<br />\nRepairing a Specialty<br /><br />\nS. CALVERT STREET<br /><br />\nDINE &amp; DANCE<br />\nto<br /><br />\nBALTIMORE, MARYLAND<br /><br />\nMfrs. of Fraternity Goods of<br />\nAll Kinds<br /><br />\n504 PARK BANK BUILDING<br />\nLexington at Liberty Sts.<br /><br />\nGLYNN MORRIS<br />\nand his<br /><br />\nSILVER SUPPER BAND<br />\nWOODWARD BUILDING<br /><br />\nWASHINGTON, D. C.<br /><br />\nRICHMOND TRUST BUILDING RICHMOND, VA.<br /><br />\nuntil 2 A. M.<br />\nClosed Sunday's<br /><br />"}], "field_media_file": [{"target_id": 38169, "display": null, "description": null, "target_type": "file", "target_uuid": "a5c7a9fc-ff5d-4aaa-ad08-a8cf692780e4", "url": "http://digital.library.jhu.edu/system/files/2022-03/13274-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13274, "target_type": "node", "target_uuid": "dbffcd53-2903-4904-af31-2e8b755b0ee7", "url": "/node/13274"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "e3d9d4b7-a6ab-43b8-8b96-75f1653e2aec"}]}