{"mid": [{"value": 51478}], "uuid": [{"value": "75eab40d-7abd-4316-9842-8c8f9bbda40a"}], "vid": [{"value": 51478}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-20T10:35:36+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "16269-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-20T10:35:36+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-20T10:35:36+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": " <br />\n<br />\nDISCOVER AMERICA ax<br />\n<br />\nDISCOVER AMERICA<br />\n<br />\ndiscover the<br />\n<br />\n <br />\n<br />\n~ discover<br />\n<br />\nOFFICIAL HIGHWAY MAP<br />\n<br />\n   <br />\n <br />\n <br />\n <br />\n <br />\n <br />\n <br />\n   <br />\n  <br />\n <br />\n <br />\n  <br />\n  <br />\n   <br />\n    <br />\n  <br />\n <br />\n<br />\nLR DL<br />\n<br />\ng B WASHINGTON o _®<br />\n<br />\n5 \" 40<br />\n<br />\nSO MUCH OF AMERICA DID! o e L AN oo<br />\n<br />\nJUST MINUTES FROM WASHINGTON, D.C. 23 / ALLEGANY_ N\\ i | o | . |<br />\n<br />\n' &3}? g wr e FREDERICK | . > . estera<br />\n% ep<br />\n<br />\nCreek (135) : ‘ e 4‘1>5<br />\n421 Lake, ‘ i<br />\n<br />\n    <br />\n   <br />\n<br />\nBALTIMORE<br />\n<br />\n <br />\n <br />\n  <br />\n      <br />\n    <br />\n  <br />\n<br />\n <br />\n<br />\nis picturesque tiaewater coun-<br />\n, & try with lush farms, quaint<br />\nT fishing villages, magnificent<br />\n<br />\ncolonial estates, historic<br />\ntowns, Ocean City and<br />\nAssateague National<br />\nSeashore.<br />\n<br />\n <br />\n<br />\n <br />\n<br />\nFREDERICK<br />\n<br />\n@ OAKLAND<br />\n<br />\n429<br />\n<br />\n <br />\n<br />\n50<br />\n<br />\n <br />\n<br />\n5<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\nCHESTERTOWN<br />\n<br />\n <br />\n<br />\n <br />\n<br />\nSkipjack race at the Chesapeake Bay Bridge, gateway to the Eastern Shore : Y 13<br />\n<br />\n <br />\n<br />\nTHIS MAP IS FOLDED TO PROVIDE CONVENIENT ARQLING<br />\nACCESS TO TOURIST INFORMATION ON MARYLAND'S<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n  <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n  <br />\n <br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n <br />\n  <br />\n <br />\n  <br />\n <br />\n <br />\n <br />\n  <br />\n  <br />\n <br />\n <br />\n <br />\n <br />\n <br />\n  <br />\n   <br />\n  <br />\n <br />\n <br />\n <br />\n  <br />\n <br />\n <br />\n  <br />\n   <br />\n <br />\n <br />\n   <br />\n   <br />\n  <br />\n  <br />\n <br />\n  <br />\n <br />\n   <br />\n  <br />\n  <br />\n  <br />\n <br />\n <br />\n <br />\n  <br />\n   <br />\n <br />\n <br />\n  <br />\n  <br />\n <br />\n  <br />\n  <br />\n   <br />\n  <br />\n <br />\n  <br />\n <br />\n  <br />\n <br />\n <br />\n  <br />\n  <br />\n <br />\n   <br />\n  <br />\n<br />\n  <br />\n <br />\n   <br />\n<br />\n <br />\n <br />\n<br />\n    <br />\n<br />\nFOUR REGIONS INDICATED BELOW. 0<br />\nv E FREDERICK 4 4<br />\n10 <<br />\n' LAND, a commercially operated recreation area, and south of POPES &<br />\nCREEK CRAB HOUSES overlooking the Potomac, on U.S. 301 the popular '<br />\nFlorida route. - -<br />\n” S ST. CLEMENT’S ISLAND (Blakistone Island) with its impressive 40 Salisbury, “Tennis Town, U.S.A.\" —site of ?ﬂh‘:‘:‘?ﬂm’?\" indoor T‘“ﬂh;cbmﬂimsmp<br />\nESTERN MARYLAND - s foot cross marking the landing of the English ships, “Arkf\" and “Dove,” = e o o 7<br />\nMarch 24, 1634, bringing Maryland’s first settlers, viewed from mainland,<br />\nENTRAL MARYLAND S<br />\nThis is a land | ( Pt e A<br />\nOUTHERN MARYLAND filled with re- Ny o SOTTERLEY, a beautiful 1730 working plantation and manor house, o— »<br />\nASTERN SHORE ; N i ~ with period furnishings, open daily June to October, overlooking the -<br />\nminders of Early D ™ Patuxent River, on Md. 245, about 20 miles southeast of Charlotte Hall tique seekers, waterfowl<br />\n; . : ) \\ Boys Preparatory School, site of YE COOLE SPRINGS OF ST. MARIES, hunters and sport fisher-<br />\nAmerican hlstory and Ry ! \" “healing waters” discovered in 1697, and FARMER’'S MARKET, open ; men, on U.S. 50.<br />\nEnglieh- Cavalier traditions. It is also e year-round on Wednesdays and Saturdays. L . OXFORD, a water- '<br />\ni . g ST. MARY’S CITY, Maryland’s first settlement (1634) and capital side village noted for its .<br />\none of the greatest pleasure boating \" until 1694, with a replica of the first State House of 1676, a monument to sailing craft and the<br />\ncenters on the East Coast, as well as . the Maryland General Assembly’s 1649 ‘“Act Concerning Religion,” Robert Morris Inn, the 5<br />\n making the colonial practice of religious freedom the first such law in family house of the “Fi- €<br />\nthe heart of Maryland tobacco country. history, the FATHER ANDREW WHITE MEMORIAL, and the LEONARD nancier of the Revolu- S<br />\nCALVERT MONUMENT, on Md. 5. tion.” OXFORD-BELLE- ?<br />\nSPEED LIMITS : PRINCESS T VUE FERRY, carrying =<br />\n. d POINT LOOKOUT, southern tip of Southern Maryland, where the ROGERS TAVERN, Perryville, - ANNE 9y three cars, is the oldest c<br />\nUnlessl;)thelr\\mse pol_?'teh are: e LAUREL RACE COURSE, home of the Washington, D.C. International Potomac joins the Chesapeake Bay, site of a Civil War prison, now a and 18th century stagecoach station S P ¥ I, non-cable ferry in the -<br />\n8°\"f\"ﬁ o thcces; H!ghways \"\"\"\"\" 55 MPH and other top horse racing events, off U.S. 1 at Laurel. waterfront state park, on Md. 5 near the CONFEDERATE MONUMENT at now restored as a museum. United States, on Md. 333 5<br />\ng Ty WP ek 20 MPH Scotland and 30 miles from the HARRY LUNDEBERG SCHOOL OF offds. =8, £<br />\nrdinary Highway i e 5 - UNIVERSITY OF MARYLAND, College Park, one of the largest uni- SEAMANSHIP at Piney Point, with its collection of fine vessels, including GILPINS COVERED BRIDGE, e 3<br />\nBusiness or Residential Area........ versities in the Uni.- 1 States, on U.S. 1. John F. Kennedy’s Manitou. Cecil County, about four miles north LINCHESTER MILL, o<br />\naPortionsho; :nterstate f;ighwayz are postedd f;)r ak maximum of f70:nyPH gf No(r:th E:st, on Md. 272, over North 13 an ancient water pow- %<br />\nRO O Ry A O N e BOWIE RACE TRACK, one of Maryland’s famous horse race SOLOMONS ISLAND, fishing and boating center where Patuxent ast Creek. . ered mill, the nation’s &<br />\noy s S okt SF s Sl ” courses, on Md. 197, of’ U.S. 50. River meets the Chesapeake Bay, site of the CHESAPEAKE BIOLOGICAL VIRGINIA oldest (since 1660) in- =<br />\nLABORATORY, with marine exhibits, open Monday through Friday, 9 a.m. FAIR HILL RACES, annual ; dustry in continuous op- 3<br />\nSCHOOL BUSSES MARLBORO PARK SPEEDWAY, Upper Marlboro, features Inter- to 5 p.m. (closed 12:30-1:30) and on summer Saturdays, on Md. 2 eight steeple-chase and flat turf racing, e | , eration, on Md. 318, near ravarh o<br />\n: | & . national Championship Sports Car Racing from April through October,|  miles from COVE POINT LIGHT HOUSE TOWER off Md. 497. horse and cattle shows, spring and | | ' ~ Preston. o | ) Wiy olollY<br />\nWhen approaching a school bus from either direction, which has off U.S. 301. fall at Fair Hill, on Md. 273 and 280. = : ~ i Wi Vi \"}<br />\nstopped to receive or discharge any passengers, driver must stop CLIFFS OF CALVERT, (not open to the public) discovered (1608) by OLD TRINITY CHURCH, the oldest Protestant church (1674) in use<br />\nand not proceed until school bus resumes motion. Motorist need FORT WASHINGTON, cor.manding the Potomac River and con- Captain John Smith, stretch 30 miles along the Bay and are noted for CHESAPEAKE & DELAWARE | in the country, on Md. 16, 5 miles south of Cambridge. :<br />\nnot stop if the bus is on the opposite lane of a dual highway or structed in 1808, was the first fort built to protect the new nation’s capital. fossil treasures of the Miocene Age (10-25 million years ago), site of the CANAL, Chesapeake City, links Port z ; B o . onap<br />\nwithin the limits of any incorporated city or town with a population BALTIMORE GAS & ELECTRIC COMPANY NUCLEAR POWER PLANT, of Baltimore with Philadelphia and : BLACKWATER NATIONAL WILDLIFE REFUGE, the fall and winter g e Jiv<br />\nin excess of 25,000. NATIONAL COLONIAL FARM, formerly owned by John Hanson, first scheduled for completion in 1974, where visitors are welcome to an North Atlantic, site of Pump House and Water Wheel (1851). Registered  habitat of the nation’s largest concentration of waterfowl, off Md. 355,<br />\nPresident of the United States In Congress Assembled, now dedicated observation platform, off Md. 2. National Historic Landmark. U.S. 213. - 9 miles south of Cambridge. : c Z<br />\nSTOPPING ON HIGHWAYS to the preserving of strains of crops raised in Colonial America, on the . . - E ©<br />\nWhen stopping for any purpose, park off the traveled portion of the Potomac River near MARSHALL HALL AMUSEMENT PARK, a com- BATTLE CREEK CYPRESS SWAMP, a Registered National Natural OLD BOHEMIA CHURCH, Warwick, the site of the first Catholic | MASON-DIXON MARKER, one of the boundary stones, set 200 years 2 25 1 ImOYTION<br />\nhighway outside the line of traffic. If your vehicle is disabled, raising mercially operated facility served by Md. 237 and cruise boats from Landmark, the northernmost U.S. stand of Bald Cypress (50-100’), an school in the British colonies, on Md. 282, off US. 213. , | ago by the famous surveyors, Mason and Dixon, to divide Maryland from = 2«q LIWIN<br />\nthe hood or tying a handkerchief to the door handle or radio Washington, and north of the 800-acre MYRTLE GROVE WILDLIFE important amphibian breeding ground, off Md. 2. , | Pennsylvania and Delaware, and establishing the traditional line between > §N<br />\nantenna will. help call: sttention: to J0T-predicament REFUGE, east of Mason Springs. FREDERICKTOWN, a picturesque, waterside village with an old . the North and the South, off U.S. 50 on Md. 467. . SA52 23<br />\n: CHESAPEAKE BAY BEACHES (North Beach and Chesapeake g_rain warehouse of by-gone days converted into a restaurant. GEORGE- | e 8Z0 S <®<br />\nPASSING ZONE TOBACCO AUCTIONS, at Upper Marlboro, Wayson's Corner, Beach) offer to the public fishing, swimming, picnic areas, amusements OWN, site of the Kitty Knight House, now an inn named for Mistress | SALISBURY, the Eastern Shore’s major commercial center, the site ES z2. >3<br />\nWaldorf, La Plata, and Hughesville. World’s largest loose-leaf tobacco and Maryland seafood delicacies, with a rare old carousel a special Kitty, who matched wits with a British admiral and saved the town in the = of the NATIONAL INDOOR OPEN TENNIS CHAMPIONSHIP TOURNA- 5>23 SQESS<br />\nAs you drive, observe the center lines on the roadway. Keep in the auctions, held April to July, Monday-Friday, a.m. TOBACCO CURING attraction at Chesapeake Beach. War of 1812, on U.S. 213. ! MENT, on U.S. 50 and 13. : ‘ o LI( ‘é £ EQBEE<br />\nright-hand lane and do not pass the car ahead when the solid line BARNS, large wooden buildings with vertical louvers, rising to the roof . ; . , ® s@ 2 <[ a3l5<br />\nis on your side of the road. Posted speed signs, warning and to admit air for tobacco curing, dot the Southern Maryland countryside. ANNAPOLIS, Maryland’s CHESTERTOWN, the site of Washington College (1782), to which OCEAN CITY, one of the finest resorts on the Atlantic Coast, on B oW g sl Tils<br />\ndirectional signs are placed along the highway for your guidance capital since 1694, a charming : George Washington gave the right to use his name, on U.S. 213. | ten miles of wide, white sandy beach, with a three-mile boardwalk, and =EX=E sl L8 g<br />\nand protection. When approaching a vehicle from the front, head- SMALLWOOD’S RETREAT, Smallwood State Park, unusual small waterfront community of na- . all facilities and accommodations. Marlin fishing, off Ocean City and S >k ®© @ §O<br />\nlights should be dimmed within 500 feet of the oncoming vehicle, brick colonial home of General William Smallwood, a Revolutionary War tional historic significance, CENTREVILLE, an 18th | Assateague Island is unexcelled anywhere. aownn - »<br />\nand when following another vehicle, headlights should be dimmed hero who became Governor of Maryland in 1785. Open June to Sep- where the American Revolu- century town, with its old | ‘<br />\nwithin 200 feet to the rear of the vehicle being followed. tember, 10 a.m.-6 p.m., closed December to March, but open Saturdays tion officially ended; home of Court House and Lawyer’s i ASSATEAGUE ISLAND, wildly beautiful barrier reef, the home of<br />\nand Sundays, 10 a.m. to 5 p.m., other months, Md. 225 west off U.S. 301. the U.S. Naval Academy and Row still in wuse, and | the famous Chincoteague ponies, the site of national and state parks =0<br />\nSt. John's College; a major WRIGHT’S CHANCE, an ex- . being developed for campers and sport fishermen. ‘,, .2<br />\n_ ol ; PORT TOBACCO, once yachting center and port for cellent example of a colonial ! : ' > 3<br />\nMaryland law requires the operator of a vehicle involved in an a flourishing 17th century the sailing vessels of the Bay’s Eastern Shore plantation B SNOW HILL, the site of the Nassawango lron Furnace ruins, and 2 ac<br />\naccident to stop immediately and remain at the scene of the accident naval port of entry for the oyster and fishing fleet; the ‘home, now a museum. ~ the Julia Purnell Museum with its unusual collection of historic memor- S o<br />\nuntil the following requirements have been fulfilled: Crown, and a major sea- site of some of the country’s _ abilia, on U.S. 113. : £ s<br />\n1) Render assistance to any person injured. ggétme Cgrll}éneemorative ﬁner?itt <t:0|0ni.a| thang! fe:jer%l tva “t'LLsi’H? 18&2 .: ‘#RINCESS 5 x | ti' . a i 5 g 5 w =<br />\ni ® et : H , an arche- architecture, in the Registere century country village w NNE, an century town retaining much of its e - 0 ¥ <<br />\n. ﬁév?shaiic%rgeén%diﬁli 3Bgnri%gltlgttlogxt?imbﬁirsch)ptf:‘rzt\\é?hslccl)? ological dig at the Port National Historic District of the an old school house and - original charm where in Mid-October, '“Olde Princess Anne Days” § 3 S ﬁ<br />\nchauffeur’s license to the person struck or the person attending Tobacco Court House site, town. THE UNITED STATES Maryland’s official tree, a festival is held, on U.S. 13. A 2 ‘S o<br />\nany vehicles involved in the collision and (not open to public) the NAVAL ACADEMY, established white oak, 450 years old, on ‘ - _ 3 =0 = - c<br />\n' CHIMNEY HOUSE (1763) in Annapolis in 1845, has the Md. 404 off U.S. 50. g DEAL ISLAND, typical of many Chesapeake Bay fishing villages, on o5 = 5 Q “E‘ 283<br />\nREPORTING ACCIDENTS and STAG HOUSE (1732) world’s largest dormitory, Ban- . Md. 363, off U.S. 13. _ o 8 2 553<br />\n: may be seen, off U.S. 301 croft Hall, housing 4000 future CHESAPEAKE BAY o ; ‘ o oo Z 23<br />\nThe operator of every motor vehicle which is in any manner involved at La Plata, north of nearby admirals, the Chapel crypt of MARITIME MUSEUM, St : - CRISFIELD, a leading Eastern Shore seafood center, port for the 3 8 * g o Lo<br />\nin an accident within the state in which any person is killed or beautiful ST. IGNATIUS John Paul Jones, and the Naval Michael’s, presents an array Smith Island excursion boats, on Md. 413, off U.S. 13. S Q95 B33s<br />\ninjured, or in which damage to the property of any person including CHURCH and ST. THOMAS Museum. of Bay relics and memor- ; - O <>( 2 @ -9<br />\nhimself, in excess of $100.00 is sustained, shall within 15 days re- MANOR in one of the oldest abilia, including several old SMITH ISLAND, ten miles off shore, in Tangier Sound, a fishing = Bk =<br />\nport the matter in writing to the DEPARTMENT OF MOTOR VEHICLES, practicing Catholic par- CHESAPEAKE BAY sailing craft, a lighthouse village virtually unchanged since its settling 300 years ago. Visited by C w E =<br />\n6601 RITCHIE HIGHWAY, N.E., GLEN BURNIE, MARYLAND 21061. ishes in America. BRIDGE, (Gov. Wm. P. Lane and lightshi(?, on Md. 33 off - excursion boats from Crisfield in spring and summer. : § : O Q5,5<br />\nAccident report forms may be obtained from the Department of Memorial Bridge) linking Balti- U.S. 50. (Closed Monday) - = s Q %2<br />\nMotor Vehicles, State and Local Police Department. POTOMAC RIVER more, Washington, D.C., and REHOBETH PRESBYTERIAN CHURCH, the first Presbyterian church N 28<br />\nBRIDGE (Governor Harry W, Southern Maryland with the EASTON, a charming in America (1705), on Md. 667, off U.S. 13. £ On<br />\nNice Memorial Bridge), link- Eastern Shore, the world’s 18th century town, once the : , = &<br />\ning Maryland with Virginia The Officiat State Sport — Jousting longest all-steel bridge oOver  caching a breeze on the Chesapeake Bay, capital of the Eastern Shore. : ‘ POCOMOKE CITY, on the tropical-like Pocomoke River, noted for its & T<br />\nand the South, near AQUA- (tilting tournament) salt water, U.S. 301 and U.S. 50. one of the great sailing centers of the World Especially appealing to an- Surf casting on Maryland waters annual NATIONAL BASS ROUND-UP, on U.S. 13. O ;g<br />\nwnxI<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n      <br />\n <br />\n<br />\nEpping<br />\nForest<br />\n<br />\n  <br />\n <br />\n  <br />\n<br />\nW<br />\n<br />\n   <br />\n<br />\nTO : e -<br />\n<br />\n  <br />\n <br />\n      <br />\n     <br />\n    <br />\n  <br />\n<br />\nHIA<br />\nQXCAMDEN<br />\n<br />\n  <br />\n<br />\n     <br />\n <br />\n    <br />\n <br />\n<br />\n  <br />\n<br />\n    <br />\n   <br />\n<br />\n <br />\n<br />\n  <br />\n <br />\n<br />\n“4“2‘ ’/ 7-‘,<br />\nw > ! -<br />\nINNE o g Lg® \\g«ﬂ<br />\noo Gl oI e b ; s s i i s : J : 3 % /x S T & RO<br />\nL B e = 5 o . . : s o : 3 / Springhill = 2/ 0 = 5 e v K& BT NN<br />\nMARYLAND &= . s : . . il ‘ : . & Acres E oX . Z z o = I g @ - N<br />\ne oo % ot - : ; . & o g Z 3 7\\ g ] 3<br />\n! . WOl e . o ! s Tl i A ¥ g . \" < i Pendennis 8 3 o & 3 & g€ o 4 85 <<br />\nn . : : o . & 4 o S - 1 0 @ o <<br />\n. s % 4 0 Mount JGREENBURY PT gp 2 G 2 S g I J\\< & ‘;E‘; L o<br />\ng z R a = S =0<br />\ng Z \" b < o 2y P a<br />\n0 z = X & f gz 3 =<br />\n2 V[T £ o E2gF =<br />\nNoval Ship 8 3 i B S - Q z<br />\nR. & D Center << ;m g \\ T<br />\nI z<br />\n<br />\n   <br />\n<br />\nBestgate<br />\n<br />\nLoretta 3 ; Bigmans<br />\nHeights — 3 7 P<br />\n<br />\n\\<br />\n1<br />\n%@FTON<br />\n\\ N<br />\n\\<br />\n<br />\n{<br />\n\\A\\G\\<br />\nPN<br />\n<br />\n3 1<br />\ne,<br />\nMARDELA ™\\<br />\n<br />\nSPRINGS<br />\n<br />\n   <br />\n<br />\n\\TE<br />\nol<br />\n<br />\n&<br />\n«ﬁ%<br />\n<br />\n   <br />\n<br />\ney<br />\n<br />\nOXFORD 3<br />\no — = —FaR<br />\nY<br />\n'<br />\n5 A 1<br />\n. 1<br />\nERTON L<br />\n<br />\nYE MILLS<br />\n<br />\nJ%VL<br />\n<br />\n   <br />\n   <br />\n   <br />\n  <br />\n <br />\n  <br />\n   <br />\n    <br />\n    <br />\n    <br />\n<br />\nX 5y<br />\nRESTS ap P\\l<br />\n<br />\nCOATESVILLE<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n   <br />\n  <br />\n  <br />\n<br />\n <br />\n<br />\n   <br />\n<br />\n   <br />\n <br />\n    <br />\n  <br />\n  <br />\n<br />\n    <br />\n<br />\n      <br />\n<br />\n     <br />\n  <br />\n  <br />\n<br />\n      <br />\n    <br />\n     <br />\n<br />\n  <br />\n<br />\n <br />\n<br />\n      <br />\n   <br />\n<br />\n <br />\n<br />\n     <br />\n   <br />\n<br />\n   <br />\n<br />\n   <br />\n <br />\n <br />\n<br />\n  <br />\n <br />\n <br />\n   <br />\n      <br />\n   <br />\n<br />\n <br />\n  <br />\n <br />\n<br />\n  <br />\n  <br />\n  <br />\n<br />\n <br />\n      <br />\n    <br />\n  <br />\n <br />\n  <br />\n <br />\n<br />\n  <br />\n <br />\n  <br />\n<br />\n <br />\n<br />\n <br />\n <br />\n<br />\n    <br />\n  <br />\n  <br />\n<br />\n    <br />\n<br />\n     <br />\n  <br />\n  <br />\n   <br />\n    <br />\n   <br />\n     <br />\n   <br />\n   <br />\n   <br />\n    <br />\n      <br />\n    <br />\n  <br />\n      <br />\n        <br />\n     <br />\n    <br />\n   <br />\n  <br />\n       <br />\n       <br />\n    <br />\n  <br />\n   <br />\n     <br />\n  <br />\n<br />\n <br />\n<br />\n           <br />\n <br />\n<br />\n    <br />\n<br />\n  <br />\n  <br />\n   <br />\n  <br />\n    <br />\n<br />\n <br />\n<br />\n   <br />\n    <br />\n<br />\n  <br />\n  <br />\n <br />\n<br />\n     <br />\n<br />\n <br />\n   <br />\n    <br />\n  <br />\n <br />\n <br />\n  <br />\n  <br />\n   <br />\n <br />\n  <br />\n  <br />\n <br />\n  <br />\n<br />\n  <br />\n   <br />\n  <br />\n    <br />\n   <br />\n  <br />\n    <br />\n  <br />\n<br />\n   <br />\n <br />\n<br />\n     <br />\n<br />\n      <br />\n    <br />\n  <br />\n <br />\n  <br />\n  <br />\n     <br />\n  <br />\n<br />\n   <br />\n  <br />\n    <br />\n      <br />\n   <br />\n<br />\n <br />\n   <br />\n  <br />\n<br />\n  <br />\n <br />\n<br />\n   <br />\n  <br />\n<br />\n  <br />\n<br />\n       <br />\n<br />\n   <br />\n     <br />\n     <br />\n       <br />\n  <br />\n<br />\n  <br />\n  <br />\n<br />\n  <br />\n <br />\n<br />\n        <br />\n<br />\n      <br />\n      <br />\n  <br />\n<br />\n     <br />\n <br />\n<br />\n       <br />\n  <br />\n   <br />\n    <br />\n  <br />\n<br />\n    <br />\n<br />\n     <br />\n  <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n    <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n  <br />\n<br />\n <br />\n<br />\n    <br />\n <br />\n<br />\n   <br />\n   <br />\n<br />\n     <br />\n       <br />\n<br />\n <br />\n<br />\n   <br />\n<br />\n <br />\n<br />\n   <br />\n<br />\n <br />\n <br />\n   <br />\n     <br />\n<br />\n  <br />\n <br />\n<br />\n <br />\n      <br />\n   <br />\n     <br />\n<br />\n      <br />\n  <br />\n<br />\n   <br />\n  <br />\n     <br />\n  <br />\n<br />\n <br />\n<br />\n    <br />\n<br />\n   <br />\n<br />\n     <br />\n  <br />\n <br />\n<br />\n   <br />\n<br />\n   <br />\n  <br />\n<br />\n     <br />\n  <br />\n<br />\n    <br />\n<br />\n      <br />\n<br />\n    <br />\n    <br />\n<br />\n   <br />\n  <br />\n    <br />\n   <br />\n   <br />\n  <br />\n  <br />\n  <br />\n<br />\n <br />\n <br />\n<br />\n    <br />\n  <br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n    <br />\n    <br />\n    <br />\n     <br />\n     <br />\n  <br />\n<br />\n       <br />\n  <br />\n<br />\n  <br />\n    <br />\n<br />\n    <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n   <br />\n    <br />\n  <br />\n<br />\n   <br />\n<br />\n <br />\n<br />\nL3 Bost Basin =<br />\ne %<br />\n< ' 3 E w<br />\n\" X ;3 y 2<br />\nWHEN YOU NEED A FRIEND PRIMITIVE AREA - NO ACCESS TO \"CLIFFS\" i :|° : 2 fg<br />\n1 : gl \\2 ¥<br />\nNG AREAS 6 B ' i 34 . . Foal QIL @ 3<br />\n14 MI MARKED FOOT TRAILS I-16 e ; , X Q8D sty Z 7/57 % 5/<br />\nThe Maryland State Police are highly trained to perform the functions F STATE PAR WATERFALL Fountain Head 14 a0 ; v ruxtun f;g‘:{ TRUXTUN : E o g/<br />\nwhich will assure the safe and lawful use of the highways of the State NI TAS ’ gy Gl || eights  \\(ud) ; 39-30 i ¥4<br />\nof Maryland. There are over 1,100 troopers quartered at 29 key locations DEEP K LAKE STATE PARK MILE ARTIFI LAKE , ; \\ o \\3! \\ i : 4 o N : > ho ;’:3;' * 35 /;<br />\nthroughout the State and they are constantly on patrol in the interest : R, o// ™\\ e RN ) / - ol : o , = 2 /82 \\ 25 :<br />\n| i i ion — G g Sh 3 Park |3 State Hospital o . 3 : . . 5 : ¥ [ £ & ¢} ¥zZo S =<br />\nof the motorist. If you need assistance or information e e e g . . $ = s L W X :<br />\nCALL OR VISIT HISTORIC FORT & M Heights LA S Coliage A > f/ g £ A 2] 2 ;ﬂ\\ﬂ_<br />\nek SITE OF HISTORIC FORT Junction . 38°22° . #83 /I g = e )z 2<br />\nHeadquarters u.S. 140 Pikesville, Md. 486-3101 ENI PIN N g LESS2 ] 5 < il L5/8 :<br />\nBarrack ‘‘A” us. 1 Jessup, Md. 799-2101 W AT B /%% E §/8 AN RS \\<br />\nBarrack ‘‘B” U.S. 40 Frederick, Md. 663-3101 F ONARY WAR HER w P - . 38°01 2 Tl / g’/ E\\ E é 3 < g<br />\nBarrack *‘C\" U.S. 40 Cumberland, Md. 729-2101 ATE P 42 ACRE LAKE & BEACH 3 e Se—— o N / ‘ : ; 39°36 E~= E | Ew /8 s - g<br />\nBarrack ‘D\" us. 1 Bel Air, Md. 838-4101 TIVE o \"nchorage & e : 7% < Bgh N3 A |y / g<br />\nBarrack “‘E\" u.s. 13 Salisbury, Md. 749-3101 TE PARK- W = : ‘ , 724 ; z e 4 4 7% BEW\\: X : : .<br />\nN R STATE PAR s 2 -4 38°48 g BN - : 2<br />\nBarrack “‘F”’ u.s. 40 North East, Md. 287-8101 NS : : 0, \\ - : / ) o LN : ey B = V R<br />\nBarrack “‘G” U.S. 140 Westminster, Md.  848-3111 NAK STA PAR; - MooLEIJII\\:ESCAMHNGI\\LACIL?TfE?D \" £ .‘ | 1 : g A y; X . > ol & C(’)Lén | ‘* 39731 g il<br />\nBarrack “‘H\" u.s. 301 Waldorf, Md. 645-8101 M LANDING STATE PARK N v ‘ : £ : Sunset s ' 'S i ot el § A0 Z<br />\nBarrack ‘\" u.s. 50 Easton, Md. 822-3101 A ] | A ! 39°25'| 7°22 fg B O<br />\nBarrack ‘‘J” Bladen St. Armory Annapolis, Md. 263-3101 PATAPSCO STATE PARK 5 REC. AREAS ALONG PATAPSCO RIVER ::“f?’ ;:\"40' o] & o a<br />\nBarrack ‘K\" Md. 26 Randallstown, Md. 922-4101 din Recreation PICNICKIN N ; 7/ — 4 5) - e % g : O | i g/ = 2 - =<br />\nCambridge Det. County Jail Cambridge, Md. 228-5231 eld Recreation N . d 7 . : b £ : i , [REDERICK 9 S e 8 < ll-.llJJ L =<br />\nCatonsville Det. 130 Mellor Avenue Catonsville, Md. 747-8040 Hilton Avenue Recreation PICNI HIKIN H s P - 4 \\ \\ 3 P : ; R ’ (5 39°42| 77° I ; 5 =<br />\nCentreville Post County Office Bldg. Centreville, Md. 758-1101 en on PICNICKING, CAMPING & HIKIN : ~Lix X 38°45' | 76°56' O B<br />\nConowingo Post uUs. 1 Conowingo, Md. 457-4101 Recreation Area SWINGING BRI H : ; 4 : ¢ % Country N P < \\ » e 4 : 38°55'| 76°21\" : < U g 5<br />\nEllicott City Det. Montgomery Road Ellicott City, Md. 465-1901 = Z =~ L $ = 7 2 Hg:::ts ) - S - / - y 76' : 2 N L =<br />\nGlen Burnie Det. DMV Building—Md. 2 Glen Burnie, Md. 761-5130 POINT STATE PARK Y ES : ' 7 e g ;::Z 76°25 5 : z Qo o=<br />\nGolden Ring Det. 8052 Old Philadelphia Rd. Baltimore, Md. 866-8181 STA T PRIMITIVE MOUNTAIN S DINGS s : /§< 5 i E o<br />\nGreenbelt Post 9300 Kenilworth Ave.  Greenbelt, Md. 345-3101 EANgi AREA OF DEERPCREEK STATE PARK ROCKIgORM,gTYIONS AL DEER CREEK A , 1 ot s . g (I.I'..)l % o =<br />\nHagerstown Post U.S. 40 Hagerstown, Md. 739-2101 e A : 20 L on s \\ . z = O<br />\nLeonardtown Post County Health Bldg. Leonardtown, Md. 475-8001 SAVAGE RIVER STATE FOREST D5 LARGEST STATE FOREST . . L T (P 38°1¥ Y X \" g |<_[ - S<br />\nN K STATE PARK D 90 G, e e b ' w 0 = =<br />\nOakland Det. Court House Oakland, Md. 334-2400 : STA ‘ N 8 ® &t O X A\\ > 88 X 2 w0 wr<br />\nOxon Hill Det. 6001 St. Barnabas St. Oxon Hill, Md. 248-2402 NA STATE PARK : T . W / FUNKSTOWN s = , / - S S 39°29’ £ SRt _inlre gy B. 3 = 0 & «<br />\nPrince Frederick Det. Court House Prince Frederick, Md. 535-1401 : o e 2 O | i & ; ‘ : 3 3 y\\ s 16 g / | /% _\\ E \"<br />\nRockville Post U.S. 240 Rockville, Md. 424-2101 SWALLOW FALLS STATE PARK FALLS ON YOUGHIOGHENY RIVER : : : ) ' \\ A / PN 38°20 z/ : 2 -<br />\nUpper Marlboro Post  Pratt St. Upper Mariboro, r;nd. 627-2787 2 W INS(EOS? ATAE()::\\Id STATE PARK 1ST MEM. TO WASHINGTON IN U.S. ; . , \\ dENTR AL/ ( e \\“ “\\“\\“\\\\“\\ \\m‘\\\\\\‘“ \\“<br />\nValley Post Joppa and Falls Roads Brooklandville, Md.  828-5101 e REST D HUNTING & HIKING 3 y 2 & :<br />\nJohn F. Kennedy Interstate 95 Perryville, Md. 642-2940 WYE PARK = HAG/ERSTOWN = ~ AJMNAPOLIS N e %3¢ m\\\\“\\“\\\\\\ \\\\\\\\\\\\ 1459<br />\n: 39°18’<br />\n3 1151 02152<br />\n<br />\n <br />\n<br />\n <br />\n<br />\nMemorial Highway Det.<br />\nTHE EISENHOWER LIBRARY<br />\n<br />\n <br />\n<br />\n111 Thomson Park Drive<br />\nCranberry Township, PA 16066<br />\n<br />\n <br />\n<br />\n(724) 779-2111<br />\n\f", "format": "basic_html", "processed": "<br /><br />\nDISCOVER AMERICA ax<br /><br />\nDISCOVER AMERICA<br /><br />\ndiscover the<br /><br /><br /><br />\n~ discover<br /><br />\nOFFICIAL HIGHWAY MAP<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nLR DL<br /><br />\ng B WASHINGTON o _®<br /><br />\n5 \" 40<br /><br />\nSO MUCH OF AMERICA DID! o e L AN oo<br /><br />\nJUST MINUTES FROM WASHINGTON, D.C. 23 / ALLEGANY_ N\\ i | o | . |<br /><br />\n' &amp;3}? g wr e FREDERICK | . &gt; . estera<br />\n% ep<br /><br />\nCreek (135) : ‘ e 4‘1&gt;5<br />\n421 Lake, ‘ i<br /><br /><br /><br /><br />\nBALTIMORE<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nis picturesque tiaewater coun-<br />\n, &amp; try with lush farms, quaint<br />\nT fishing villages, magnificent<br /><br />\ncolonial estates, historic<br />\ntowns, Ocean City and<br />\nAssateague National<br />\nSeashore.<br /><br /><br /><br /><br /><br />\nFREDERICK<br /><br />\n@ OAKLAND<br /><br />\n429<br /><br /><br /><br />\n50<br /><br /><br /><br />\n5<br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nCHESTERTOWN<br /><br /><br /><br /><br /><br />\nSkipjack race at the Chesapeake Bay Bridge, gateway to the Eastern Shore : Y 13<br /><br /><br /><br />\nTHIS MAP IS FOLDED TO PROVIDE CONVENIENT ARQLING<br />\nACCESS TO TOURIST INFORMATION ON MARYLAND'S<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nFOUR REGIONS INDICATED BELOW. 0<br />\nv E FREDERICK 4 4<br />\n10 &lt;<br />\n' LAND, a commercially operated recreation area, and south of POPES &amp;<br />\nCREEK CRAB HOUSES overlooking the Potomac, on U.S. 301 the popular '<br />\nFlorida route. - -<br />\n” S ST. CLEMENT’S ISLAND (Blakistone Island) with its impressive 40 Salisbury, “Tennis Town, U.S.A.\" —site of ?ﬂh‘:‘:‘?ﬂm’?\" indoor T‘“ﬂh;cbmﬂimsmp<br />\nESTERN MARYLAND - s foot cross marking the landing of the English ships, “Arkf\" and “Dove,” = e o o 7<br />\nMarch 24, 1634, bringing Maryland’s first settlers, viewed from mainland,<br />\nENTRAL MARYLAND S<br />\nThis is a land | ( Pt e A<br />\nOUTHERN MARYLAND filled with re- Ny o SOTTERLEY, a beautiful 1730 working plantation and manor house, o— »<br />\nASTERN SHORE ; N i ~ with period furnishings, open daily June to October, overlooking the -<br />\nminders of Early D ™ Patuxent River, on Md. 245, about 20 miles southeast of Charlotte Hall tique seekers, waterfowl<br />\n; . : ) \\ Boys Preparatory School, site of YE COOLE SPRINGS OF ST. MARIES, hunters and sport fisher-<br />\nAmerican hlstory and Ry ! \" “healing waters” discovered in 1697, and FARMER’'S MARKET, open ; men, on U.S. 50.<br />\nEnglieh- Cavalier traditions. It is also e year-round on Wednesdays and Saturdays. L . OXFORD, a water- '<br />\ni . g ST. MARY’S CITY, Maryland’s first settlement (1634) and capital side village noted for its .<br />\none of the greatest pleasure boating \" until 1694, with a replica of the first State House of 1676, a monument to sailing craft and the<br />\ncenters on the East Coast, as well as . the Maryland General Assembly’s 1649 ‘“Act Concerning Religion,” Robert Morris Inn, the 5<br />\n making the colonial practice of religious freedom the first such law in family house of the “Fi- €<br />\nthe heart of Maryland tobacco country. history, the FATHER ANDREW WHITE MEMORIAL, and the LEONARD nancier of the Revolu- S<br />\nCALVERT MONUMENT, on Md. 5. tion.” OXFORD-BELLE- ?<br />\nSPEED LIMITS : PRINCESS T VUE FERRY, carrying =<br />\n. d POINT LOOKOUT, southern tip of Southern Maryland, where the ROGERS TAVERN, Perryville, - ANNE 9y three cars, is the oldest c<br />\nUnlessl;)thelr\\mse pol_?'teh are: e LAUREL RACE COURSE, home of the Washington, D.C. International Potomac joins the Chesapeake Bay, site of a Civil War prison, now a and 18th century stagecoach station S P ¥ I, non-cable ferry in the -<br />\n8°\"f\"ﬁ o thcces; H!ghways \"\"\"\"\" 55 MPH and other top horse racing events, off U.S. 1 at Laurel. waterfront state park, on Md. 5 near the CONFEDERATE MONUMENT at now restored as a museum. United States, on Md. 333 5<br />\ng Ty WP ek 20 MPH Scotland and 30 miles from the HARRY LUNDEBERG SCHOOL OF offds. =8, £<br />\nrdinary Highway i e 5 - UNIVERSITY OF MARYLAND, College Park, one of the largest uni- SEAMANSHIP at Piney Point, with its collection of fine vessels, including GILPINS COVERED BRIDGE, e 3<br />\nBusiness or Residential Area........ versities in the Uni.- 1 States, on U.S. 1. John F. Kennedy’s Manitou. Cecil County, about four miles north LINCHESTER MILL, o<br />\naPortionsho; :nterstate f;ighwayz are postedd f;)r ak maximum of f70:nyPH gf No(r:th E:st, on Md. 272, over North 13 an ancient water pow- %<br />\nRO O Ry A O N e BOWIE RACE TRACK, one of Maryland’s famous horse race SOLOMONS ISLAND, fishing and boating center where Patuxent ast Creek. . ered mill, the nation’s &amp;<br />\noy s S okt SF s Sl ” courses, on Md. 197, of’ U.S. 50. River meets the Chesapeake Bay, site of the CHESAPEAKE BIOLOGICAL VIRGINIA oldest (since 1660) in- =<br />\nLABORATORY, with marine exhibits, open Monday through Friday, 9 a.m. FAIR HILL RACES, annual ; dustry in continuous op- 3<br />\nSCHOOL BUSSES MARLBORO PARK SPEEDWAY, Upper Marlboro, features Inter- to 5 p.m. (closed 12:30-1:30) and on summer Saturdays, on Md. 2 eight steeple-chase and flat turf racing, e | , eration, on Md. 318, near ravarh o<br />\n: | &amp; . national Championship Sports Car Racing from April through October,|  miles from COVE POINT LIGHT HOUSE TOWER off Md. 497. horse and cattle shows, spring and | | ' ~ Preston. o | ) Wiy olollY<br />\nWhen approaching a school bus from either direction, which has off U.S. 301. fall at Fair Hill, on Md. 273 and 280. = : ~ i Wi Vi \"}<br />\nstopped to receive or discharge any passengers, driver must stop CLIFFS OF CALVERT, (not open to the public) discovered (1608) by OLD TRINITY CHURCH, the oldest Protestant church (1674) in use<br />\nand not proceed until school bus resumes motion. Motorist need FORT WASHINGTON, cor.manding the Potomac River and con- Captain John Smith, stretch 30 miles along the Bay and are noted for CHESAPEAKE &amp; DELAWARE | in the country, on Md. 16, 5 miles south of Cambridge. :<br />\nnot stop if the bus is on the opposite lane of a dual highway or structed in 1808, was the first fort built to protect the new nation’s capital. fossil treasures of the Miocene Age (10-25 million years ago), site of the CANAL, Chesapeake City, links Port z ; B o . onap<br />\nwithin the limits of any incorporated city or town with a population BALTIMORE GAS &amp; ELECTRIC COMPANY NUCLEAR POWER PLANT, of Baltimore with Philadelphia and : BLACKWATER NATIONAL WILDLIFE REFUGE, the fall and winter g e Jiv<br />\nin excess of 25,000. NATIONAL COLONIAL FARM, formerly owned by John Hanson, first scheduled for completion in 1974, where visitors are welcome to an North Atlantic, site of Pump House and Water Wheel (1851). Registered  habitat of the nation’s largest concentration of waterfowl, off Md. 355,<br />\nPresident of the United States In Congress Assembled, now dedicated observation platform, off Md. 2. National Historic Landmark. U.S. 213. - 9 miles south of Cambridge. : c Z<br />\nSTOPPING ON HIGHWAYS to the preserving of strains of crops raised in Colonial America, on the . . - E ©<br />\nWhen stopping for any purpose, park off the traveled portion of the Potomac River near MARSHALL HALL AMUSEMENT PARK, a com- BATTLE CREEK CYPRESS SWAMP, a Registered National Natural OLD BOHEMIA CHURCH, Warwick, the site of the first Catholic | MASON-DIXON MARKER, one of the boundary stones, set 200 years 2 25 1 ImOYTION<br />\nhighway outside the line of traffic. If your vehicle is disabled, raising mercially operated facility served by Md. 237 and cruise boats from Landmark, the northernmost U.S. stand of Bald Cypress (50-100’), an school in the British colonies, on Md. 282, off US. 213. , | ago by the famous surveyors, Mason and Dixon, to divide Maryland from = 2«q LIWIN<br />\nthe hood or tying a handkerchief to the door handle or radio Washington, and north of the 800-acre MYRTLE GROVE WILDLIFE important amphibian breeding ground, off Md. 2. , | Pennsylvania and Delaware, and establishing the traditional line between &gt; §N<br />\nantenna will. help call: sttention: to J0T-predicament REFUGE, east of Mason Springs. FREDERICKTOWN, a picturesque, waterside village with an old . the North and the South, off U.S. 50 on Md. 467. . SA52 23<br />\n: CHESAPEAKE BAY BEACHES (North Beach and Chesapeake g_rain warehouse of by-gone days converted into a restaurant. GEORGE- | e 8Z0 S &lt;®<br />\nPASSING ZONE TOBACCO AUCTIONS, at Upper Marlboro, Wayson's Corner, Beach) offer to the public fishing, swimming, picnic areas, amusements OWN, site of the Kitty Knight House, now an inn named for Mistress | SALISBURY, the Eastern Shore’s major commercial center, the site ES z2. &gt;3<br />\nWaldorf, La Plata, and Hughesville. World’s largest loose-leaf tobacco and Maryland seafood delicacies, with a rare old carousel a special Kitty, who matched wits with a British admiral and saved the town in the = of the NATIONAL INDOOR OPEN TENNIS CHAMPIONSHIP TOURNA- 5&gt;23 SQESS<br />\nAs you drive, observe the center lines on the roadway. Keep in the auctions, held April to July, Monday-Friday, a.m. TOBACCO CURING attraction at Chesapeake Beach. War of 1812, on U.S. 213. ! MENT, on U.S. 50 and 13. : ‘ o LI( ‘é £ EQBEE<br />\nright-hand lane and do not pass the car ahead when the solid line BARNS, large wooden buildings with vertical louvers, rising to the roof . ; . , ® s@ 2 &lt;[ a3l5<br />\nis on your side of the road. Posted speed signs, warning and to admit air for tobacco curing, dot the Southern Maryland countryside. ANNAPOLIS, Maryland’s CHESTERTOWN, the site of Washington College (1782), to which OCEAN CITY, one of the finest resorts on the Atlantic Coast, on B oW g sl Tils<br />\ndirectional signs are placed along the highway for your guidance capital since 1694, a charming : George Washington gave the right to use his name, on U.S. 213. | ten miles of wide, white sandy beach, with a three-mile boardwalk, and =EX=E sl L8 g<br />\nand protection. When approaching a vehicle from the front, head- SMALLWOOD’S RETREAT, Smallwood State Park, unusual small waterfront community of na- . all facilities and accommodations. Marlin fishing, off Ocean City and S &gt;k ®© @ §O<br />\nlights should be dimmed within 500 feet of the oncoming vehicle, brick colonial home of General William Smallwood, a Revolutionary War tional historic significance, CENTREVILLE, an 18th | Assateague Island is unexcelled anywhere. aownn - »<br />\nand when following another vehicle, headlights should be dimmed hero who became Governor of Maryland in 1785. Open June to Sep- where the American Revolu- century town, with its old | ‘<br />\nwithin 200 feet to the rear of the vehicle being followed. tember, 10 a.m.-6 p.m., closed December to March, but open Saturdays tion officially ended; home of Court House and Lawyer’s i ASSATEAGUE ISLAND, wildly beautiful barrier reef, the home of<br />\nand Sundays, 10 a.m. to 5 p.m., other months, Md. 225 west off U.S. 301. the U.S. Naval Academy and Row still in wuse, and | the famous Chincoteague ponies, the site of national and state parks =0<br />\nSt. John's College; a major WRIGHT’S CHANCE, an ex- . being developed for campers and sport fishermen. ‘,, .2<br />\n_ ol ; PORT TOBACCO, once yachting center and port for cellent example of a colonial ! : ' &gt; 3<br />\nMaryland law requires the operator of a vehicle involved in an a flourishing 17th century the sailing vessels of the Bay’s Eastern Shore plantation B SNOW HILL, the site of the Nassawango lron Furnace ruins, and 2 ac<br />\naccident to stop immediately and remain at the scene of the accident naval port of entry for the oyster and fishing fleet; the ‘home, now a museum. ~ the Julia Purnell Museum with its unusual collection of historic memor- S o<br />\nuntil the following requirements have been fulfilled: Crown, and a major sea- site of some of the country’s _ abilia, on U.S. 113. : £ s<br />\n1) Render assistance to any person injured. ggétme Cgrll}éneemorative ﬁner?itt \ni ® et : H , an arche- architecture, in the Registere century country village w NNE, an century town retaining much of its e - 0 ¥ &lt;<br />\n. ﬁév?shaiic%rgeén%diﬁli 3Bgnri%gltlgttlogxt?imbﬁirsch)ptf:‘rzt\\é?hslccl)? ological dig at the Port National Historic District of the an old school house and - original charm where in Mid-October, '“Olde Princess Anne Days” § 3 S ﬁ<br />\nchauffeur’s license to the person struck or the person attending Tobacco Court House site, town. THE UNITED STATES Maryland’s official tree, a festival is held, on U.S. 13. A 2 ‘S o<br />\nany vehicles involved in the collision and (not open to public) the NAVAL ACADEMY, established white oak, 450 years old, on ‘ - _ 3 =0 = - c<br />\n' CHIMNEY HOUSE (1763) in Annapolis in 1845, has the Md. 404 off U.S. 50. g DEAL ISLAND, typical of many Chesapeake Bay fishing villages, on o5 = 5 Q “E‘ 283<br />\nREPORTING ACCIDENTS and STAG HOUSE (1732) world’s largest dormitory, Ban- . Md. 363, off U.S. 13. _ o 8 2 553<br />\n: may be seen, off U.S. 301 croft Hall, housing 4000 future CHESAPEAKE BAY o ; ‘ o oo Z 23<br />\nThe operator of every motor vehicle which is in any manner involved at La Plata, north of nearby admirals, the Chapel crypt of MARITIME MUSEUM, St : - CRISFIELD, a leading Eastern Shore seafood center, port for the 3 8 * g o Lo<br />\nin an accident within the state in which any person is killed or beautiful ST. IGNATIUS John Paul Jones, and the Naval Michael’s, presents an array Smith Island excursion boats, on Md. 413, off U.S. 13. S Q95 B33s<br />\ninjured, or in which damage to the property of any person including CHURCH and ST. THOMAS Museum. of Bay relics and memor- ; - O &lt;&gt;( 2 @ -9<br />\nhimself, in excess of $100.00 is sustained, shall within 15 days re- MANOR in one of the oldest abilia, including several old SMITH ISLAND, ten miles off shore, in Tangier Sound, a fishing = Bk =<br />\nport the matter in writing to the DEPARTMENT OF MOTOR VEHICLES, practicing Catholic par- CHESAPEAKE BAY sailing craft, a lighthouse village virtually unchanged since its settling 300 years ago. Visited by C w E =<br />\n6601 RITCHIE HIGHWAY, N.E., GLEN BURNIE, MARYLAND 21061. ishes in America. BRIDGE, (Gov. Wm. P. Lane and lightshi(?, on Md. 33 off - excursion boats from Crisfield in spring and summer. : § : O Q5,5<br />\nAccident report forms may be obtained from the Department of Memorial Bridge) linking Balti- U.S. 50. (Closed Monday) - = s Q %2<br />\nMotor Vehicles, State and Local Police Department. POTOMAC RIVER more, Washington, D.C., and REHOBETH PRESBYTERIAN CHURCH, the first Presbyterian church N 28<br />\nBRIDGE (Governor Harry W, Southern Maryland with the EASTON, a charming in America (1705), on Md. 667, off U.S. 13. £ On<br />\nNice Memorial Bridge), link- Eastern Shore, the world’s 18th century town, once the : , = &amp;<br />\ning Maryland with Virginia The Officiat State Sport — Jousting longest all-steel bridge oOver  caching a breeze on the Chesapeake Bay, capital of the Eastern Shore. : ‘ POCOMOKE CITY, on the tropical-like Pocomoke River, noted for its &amp; T<br />\nand the South, near AQUA- (tilting tournament) salt water, U.S. 301 and U.S. 50. one of the great sailing centers of the World Especially appealing to an- Surf casting on Maryland waters annual NATIONAL BASS ROUND-UP, on U.S. 13. O ;g<br />\nwnxI<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nEpping<br />\nForest<br /><br /><br /><br /><br /><br />\nW<br /><br /><br /><br />\nTO : e -<br /><br /><br /><br /><br /><br /><br /><br /><br />\nHIA<br />\nQXCAMDEN<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\n“4“2‘ ’/ 7-‘,<br />\nw &gt; ! -<br />\nINNE o g Lg® \\g«ﬂ<br />\noo Gl oI e b ; s s i i s : J : 3 % /x S T &amp; RO<br />\nL B e = 5 o . . : s o : 3 / Springhill = 2/ 0 = 5 e v K&amp; BT NN<br />\nMARYLAND &amp;= . s : . . il ‘ : . &amp; Acres E oX . Z z o = I g @ - N<br />\ne oo % ot - : ; . &amp; o g Z 3 7\\ g ] 3<br />\n! . WOl e . o ! s Tl i A ¥ g . \" &lt; i Pendennis 8 3 o &amp; 3 &amp; g€ o 4 85 &lt;<br />\nn . : : o . &amp; 4 o S - 1 0 @ o &lt;<br />\n. s % 4 0 Mount JGREENBURY PT gp 2 G 2 S g I J\\&lt; &amp; ‘;E‘; L o<br />\ng z R a = S =0<br />\ng Z \" b &lt; o 2y P a<br />\n0 z = X &amp; f gz 3 =<br />\n2 V[T £ o E2gF =<br />\nNoval Ship 8 3 i B S - Q z<br />\nR. &amp; D Center &lt;&lt; ;m g \\ T<br />\nI z<br /><br /><br /><br />\nBestgate<br /><br />\nLoretta 3 ; Bigmans<br />\nHeights — 3 7 P<br /><br />\n\\<br />\n1<br />\n%@FTON<br />\n\\ N<br />\n\\<br /><br />\n{<br />\n\\A\\G\\<br />\nPN<br /><br />\n3 1<br />\ne,<br />\nMARDELA ™\\<br /><br />\nSPRINGS<br /><br /><br /><br />\n\\TE<br />\nol<br /><br />\n&amp;<br />\n«ﬁ%<br /><br /><br /><br />\ney<br /><br />\nOXFORD 3<br />\no — = —FaR<br />\nY<br />\n'<br />\n5 A 1<br />\n. 1<br />\nERTON L<br /><br />\nYE MILLS<br /><br />\nJ%VL<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nX 5y<br />\nRESTS ap P\\l<br /><br />\nCOATESVILLE<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nL3 Bost Basin =<br />\ne %<br />\n&lt; ' 3 E w<br />\n\" X ;3 y 2<br />\nWHEN YOU NEED A FRIEND PRIMITIVE AREA - NO ACCESS TO \"CLIFFS\" i :|° : 2 fg<br />\n1 : gl \\2 ¥<br />\nNG AREAS 6 B ' i 34 . . Foal QIL @ 3<br />\n14 MI MARKED FOOT TRAILS I-16 e ; , X Q8D sty Z 7/57 % 5/<br />\nThe Maryland State Police are highly trained to perform the functions F STATE PAR WATERFALL Fountain Head 14 a0 ; v ruxtun f;g‘:{ TRUXTUN : E o g/<br />\nwhich will assure the safe and lawful use of the highways of the State NI TAS ’ gy Gl || eights  \\(ud) ; 39-30 i ¥4<br />\nof Maryland. There are over 1,100 troopers quartered at 29 key locations DEEP K LAKE STATE PARK MILE ARTIFI LAKE , ; \\ o \\3! \\ i : 4 o N : &gt; ho ;’:3;' * 35 /;<br />\nthroughout the State and they are constantly on patrol in the interest : R, o// ™\\ e RN ) / - ol : o , = 2 /82 \\ 25 :<br />\n| i i ion — G g Sh 3 Park |3 State Hospital o . 3 : . . 5 : ¥ [ £ &amp; ¢} ¥zZo S =<br />\nof the motorist. If you need assistance or information e e e g . . $ = s L W X :<br />\nCALL OR VISIT HISTORIC FORT &amp; M Heights LA S Coliage A &gt; f/ g £ A 2] 2 ;ﬂ\\ﬂ_<br />\nek SITE OF HISTORIC FORT Junction . 38°22° . #83 /I g = e )z 2<br />\nHeadquarters u.S. 140 Pikesville, Md. 486-3101 ENI PIN N g LESS2 ] 5 &lt; il L5/8 :<br />\nBarrack ‘‘A” us. 1 Jessup, Md. 799-2101 W AT B /%% E §/8 AN RS \\<br />\nBarrack ‘‘B” U.S. 40 Frederick, Md. 663-3101 F ONARY WAR HER w P - . 38°01 2 Tl / g’/ E\\ E é 3 &lt; g<br />\nBarrack *‘C\" U.S. 40 Cumberland, Md. 729-2101 ATE P 42 ACRE LAKE &amp; BEACH 3 e Se—— o N / ‘ : ; 39°36 E~= E | Ew /8 s - g<br />\nBarrack ‘D\" us. 1 Bel Air, Md. 838-4101 TIVE o \"nchorage &amp; e : 7% &lt; Bgh N3 A |y / g<br />\nBarrack “‘E\" u.s. 13 Salisbury, Md. 749-3101 TE PARK- W = : ‘ , 724 ; z e 4 4 7% BEW\\: X : : .<br />\nN R STATE PAR s 2 -4 38°48 g BN - : 2<br />\nBarrack “‘F”’ u.s. 40 North East, Md. 287-8101 NS : : 0, \\ - : / ) o LN : ey B = V R<br />\nBarrack “‘G” U.S. 140 Westminster, Md.  848-3111 NAK STA PAR; - MooLEIJII\\:ESCAMHNGI\\LACIL?TfE?D \" £ .‘ | 1 : g A y; X . &gt; ol &amp; C(’)Lén | ‘* 39731 g il<br />\nBarrack “‘H\" u.s. 301 Waldorf, Md. 645-8101 M LANDING STATE PARK N v ‘ : £ : Sunset s ' 'S i ot el § A0 Z<br />\nBarrack ‘\" u.s. 50 Easton, Md. 822-3101 A ] | A ! 39°25'| 7°22 fg B O<br />\nBarrack ‘‘J” Bladen St. Armory Annapolis, Md. 263-3101 PATAPSCO STATE PARK 5 REC. AREAS ALONG PATAPSCO RIVER ::“f?’ ;:\"40' o] &amp; o a<br />\nBarrack ‘K\" Md. 26 Randallstown, Md. 922-4101 din Recreation PICNICKIN N ; 7/ — 4 5) - e % g : O | i g/ = 2 - =<br />\nCambridge Det. County Jail Cambridge, Md. 228-5231 eld Recreation N . d 7 . : b £ : i , [REDERICK 9 S e 8 &lt; ll-.llJJ L =<br />\nCatonsville Det. 130 Mellor Avenue Catonsville, Md. 747-8040 Hilton Avenue Recreation PICNI HIKIN H s P - 4 \\ \\ 3 P : ; R ’ (5 39°42| 77° I ; 5 =<br />\nCentreville Post County Office Bldg. Centreville, Md. 758-1101 en on PICNICKING, CAMPING &amp; HIKIN : ~Lix X 38°45' | 76°56' O B<br />\nConowingo Post uUs. 1 Conowingo, Md. 457-4101 Recreation Area SWINGING BRI H : ; 4 : ¢ % Country N P &lt; \\ » e 4 : 38°55'| 76°21\" : &lt; U g 5<br />\nEllicott City Det. Montgomery Road Ellicott City, Md. 465-1901 = Z =~ L $ = 7 2 Hg:::ts ) - S - / - y 76' : 2 N L =<br />\nGlen Burnie Det. DMV Building—Md. 2 Glen Burnie, Md. 761-5130 POINT STATE PARK Y ES : ' 7 e g ;::Z 76°25 5 : z Qo o=<br />\nGolden Ring Det. 8052 Old Philadelphia Rd. Baltimore, Md. 866-8181 STA T PRIMITIVE MOUNTAIN S DINGS s : /§&lt; 5 i E o<br />\nGreenbelt Post 9300 Kenilworth Ave.  Greenbelt, Md. 345-3101 EANgi AREA OF DEERPCREEK STATE PARK ROCKIgORM,gTYIONS AL DEER CREEK A , 1 ot s . g (I.I'..)l % o =<br />\nHagerstown Post U.S. 40 Hagerstown, Md. 739-2101 e A : 20 L on s \\ . z = O<br />\nLeonardtown Post County Health Bldg. Leonardtown, Md. 475-8001 SAVAGE RIVER STATE FOREST D5 LARGEST STATE FOREST . . L T (P 38°1¥ Y X \" g |&lt;_[ - S<br />\nN K STATE PARK D 90 G, e e b ' w 0 = =<br />\nOakland Det. Court House Oakland, Md. 334-2400 : STA ‘ N 8 ® &amp;t O X A\\ &gt; 88 X 2 w0 wr<br />\nOxon Hill Det. 6001 St. Barnabas St. Oxon Hill, Md. 248-2402 NA STATE PARK : T . W / FUNKSTOWN s = , / - S S 39°29’ £ SRt _inlre gy B. 3 = 0 &amp; «<br />\nPrince Frederick Det. Court House Prince Frederick, Md. 535-1401 : o e 2 O | i &amp; ; ‘ : 3 3 y\\ s 16 g / | /% _\\ E \"<br />\nRockville Post U.S. 240 Rockville, Md. 424-2101 SWALLOW FALLS STATE PARK FALLS ON YOUGHIOGHENY RIVER : : : ) ' \\ A / PN 38°20 z/ : 2 -<br />\nUpper Marlboro Post  Pratt St. Upper Mariboro, r;nd. 627-2787 2 W INS(EOS? ATAE()::\\Id STATE PARK 1ST MEM. TO WASHINGTON IN U.S. ; . , \\ dENTR AL/ ( e \\“ “\\“\\“\\\\“\\ \\m‘\\\\\\‘“ \\“<br />\nValley Post Joppa and Falls Roads Brooklandville, Md.  828-5101 e REST D HUNTING &amp; HIKING 3 y 2 &amp; :<br />\nJohn F. Kennedy Interstate 95 Perryville, Md. 642-2940 WYE PARK = HAG/ERSTOWN = ~ AJMNAPOLIS N e %3¢ m\\\\“\\“\\\\\\ \\\\\\\\\\\\ 1459<br />\n: 39°18’<br />\n3 1151 02152<br /><br /><br /><br /><br /><br />\nMemorial Highway Det.<br />\nTHE EISENHOWER LIBRARY<br /><br /><br /><br />\n111 Thomson Park Drive<br />\nCranberry Township, PA 16066<br /><br /><br /><br />\n(724) 779-2111<br />"}], "field_media_file": [{"target_id": 52401, "display": null, "description": null, "target_type": "file", "target_uuid": "8f0f3788-48d4-4e70-8b97-22738441a236", "url": "http://digital.library.jhu.edu/system/files/2022-03/16269-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 16269, "target_type": "node", "target_uuid": "2e5c7a3b-b917-4ef1-899b-3557c0e4dea9", "url": "/node/16269"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "a01d036b-735b-4c1e-8f2b-4e126aff9f64"}]}