{"mid": [{"value": 37363}], "uuid": [{"value": "c5a079a7-bb6b-44ef-9cbb-6cdbf44acec7"}], "vid": [{"value": 37363}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T17:04:59+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13316-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T17:04:59+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T17:04:59+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXXII, No. 46<br />\n<br />\nLower Classes Hold<br />\nBanquets Peacefully<br />\nFreshman and Sophomore Affairs<br />\nUndisturbed for First Time<br />\n<br />\nFor the first time in the history<br />\nof lower class banquets, the freshmen held their annual feast at the<br />\nHotel Kernan on Saturday night,<br />\nabsolutely undisturbed and with no<br />\nencircling cordon of protecting police. War was officially declared<br />\noff at 5.30, two hours before the beginning of the dinner. At this time<br />\nall sophomores held as prisoners<br />\nwere doomed to remain so and be<br />\ntaken to the opposing class feed,<br />\nwhile freshman officers were given<br />\nthe opportunity to return to their<br />\ncohorts and preside over the sumptuous repast.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., APRIL 3, 1928<br />\n<br />\nFARINHOLT AND FINN<br />\nLOST TO TWELVE<br />\nServices of Larkin Farinholt<br />\nand Raymond Finn, two regulars on last year's lacrosse<br />\nteam, may be lost to the twelve<br />\nthis season. Farinholt underwent an operation for appendicitis last Thursday and will<br />\nbe definitely out of the line-up<br />\nfor the rest of the season. Finn,<br />\nwho was struck in the eye by a<br />\nball last week, was also at the<br />\nhospital for several days. He<br />\nwill be unable to play for the<br />\nfirst part of the schedule, at<br />\nleast.<br />\nAlthough the team is well<br />\nsupplied with reserve material<br />\nin both midfield attack and<br />\ngoal positions, it is expected<br />\nthat these unforeseen losses<br />\nwill be keenly felt.<br />\n<br />\nMR. JERE DUNNE SPEAKS<br />\nAT WEEKLY ASSEMBLY<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nALLEN ELECTED TO<br />\nEDIT HULLABALOO<br />\n<br />\nFormer Actor Entertains Large<br />\nCrowd at Thursday<br />\nMeeting.<br />\n<br />\nSelection Takes Place During<br />\nJunior Banquet<br />\nELDRIDGE BUSINESS HEAD<br />\n<br />\nLast week's assembly was one of<br />\nthe best which has been held this<br />\nyear. Mr. Jere Dunne of the Keith<br />\ncircuit talked on the showmanship<br />\nneeded in placing vaudeville acts in<br />\ntheir proper sequence on the bill.<br />\n<br />\nLouis Llewelyn Furnishes<br />\nSeveral Selections<br />\n<br />\nHamilton Allen and John Eldridge, were chosen editor-in-chief<br />\nand business manager, respectively,<br />\nof the Hullabaloo, for the ensuing<br />\nyear. The elections took place at<br />\nthe banquet of the Junior Class at<br />\nthe New Howard Hotel on Thursday, March 29. Don White, and Len Dalsemer,<br />\npresent editor-in-chief and business<br />\nmanager, respectively, of the annual<br />\nHostilities began with the junior Three Professors to<br />\nwere guests of the juniors at their'<br />\nbanquet on Thursday night. From Have Leave of Absence<br />\nclass<br />\n-function. Both gave short exthat time until yesterday at 5.30,<br />\nProfessor Robert W. Wood is<br />\nBill Opens<br />\nplanatory<br />\ntalks on the nature of the<br />\nwith the one exception of the fresh- among those members of the facHonored election of men for these- very -imFriz<br />\nand<br />\nalso<br />\nCaplan<br />\nThe bill, itself, opens with a picman banquet interruption, the cam- ulty of the University who are leavat Election and Banquet at<br />\nportant offices of the year-book. •<br />\ning<br />\nin<br />\nthe<br />\nnear<br />\nfuture<br />\nfor<br />\nvarious<br />\nso that all late comers may be<br />\nture<br />\npus was the scene of wholesale kidSouthern<br />\nparts of Europe. Dr. Wood will seated without disturbing the actors.<br />\nIn the, absence of Dr; Carol Van<br />\nnapping, the members of the lower<br />\nsail on May 19th on the \"Ile de Pictures are not temperamental. But<br />\nBuren Wight, honorary president.<br />\nClasses subjects of long-time impris- France\" with Mr. Arthur Loomis,<br />\n-William B. Banks. and George of the • Junior Class, Mr.<br />\nsufdoesn't<br />\nthen<br />\nthe<br />\npicture<br />\neven<br />\nGeorge<br />\nonment, and the roads leading into with whom he will take a motor trip<br />\nGlazier were elected president and<br />\nseat<br />\nconic<br />\nup<br />\nto<br />\nso<br />\nthe<br />\nlights<br />\nfice,<br />\nDarley,<br />\nAssistant<br />\nAthletic<br />\nDirector<br />\nBaltimore the paths of toil for many through Holland and Germany.<br />\nbusiness manager of the Barnstormers, respectively, at their annual ban- of John's., Hopkins, presided as<br />\na lonely captive wending his way They will visit the Universities of these late comers.<br />\nNext comes the first act. This is quet and election which was held at toast-master. The latter, in opening<br />\nhome early in the morning. Friday Bahn, Berlin, and Gottinger on the<br />\nway. The party intends to visit<br />\nthe juniors and seniors were made<br />\nalways a \"dumb\" act—it usually the Southern Hotel last Friday the program for the evening,, on<br />\nCopenhagen.<br />\nconsists of some tricks or it is an night. Clyde Friz was chosen pro- completion of the dinner, expressed<br />\nmerry with the clumsy antics of the<br />\nDr. Robles of the Romance acrobatic presentation. It has a cer- duction manager and Howard Caphis own regret as that of the Junior<br />\nkidnapping parties of the lower Languages department is also pretain definite routine which doesn't lan secretary. Dow Strader, who class, that Dr. Wight was unable'to<br />\nclasses, unaccustomed as they were paring to sail shortly for Spain, depend on what's happening in the before coming to Hopkins was very<br />\nto fighting—a la Homewood. Never where he will study. Dr. Kurch- audience.<br />\nactive in dramatics at West Virginia, be.present at the affair.<br />\nBill Kegan, President of the Junabof<br />\nmeyer<br />\nwill<br />\ntake<br />\na<br />\nyear's<br />\nleave<br />\nwas elected to membership in the<br />\nbefore had the frosh been forced to<br />\nSecond Act Critical<br />\nBarnstormefs' Club. The election ior class, was introduced as the first<br />\nsence for the purpose of studying<br />\nraise a hand in self-defense, and<br />\nin Germany during 1928-29.<br />\nThe critical act follows—the sec- was held just before the banquet.<br />\nspeaker of the evening. The toastaccordingly they found it peculiar<br />\nond on the bill. Number two is<br />\n\"Pop\" Swindell Given Present<br />\nmaster then introduced Louis Llew-:<br />\nWhen they were made to fight, both<br />\nusually a mixed double. The girl<br />\nRidgely Warfield, retiring presi- elyn, member of the Junior class, by the sophs and the onlookers.<br />\nSeniors Unable to Pick must be extremely good looking; in dent of the Barnstormers was toastfact, she is hired for her appearance. master at the banquet. Of course, and baritone solosit of the Musical<br />\nLast night two hours before the<br />\nHonorary President The<br />\nman must be rather pleasing in the feature of the evening was Club, who sang several very delightsophs trooped into the Southern for<br />\nStrong partisan interest was looks and help out the girl; he also<br />\nful numbers. His selections were<br />\ntheir dinner the season for open evinced in the Senior class election furnishes any talent which the act \"Pop\" Swindell's talk. In appreciation of his able and untiring ser- enthusiastically received by the<br />\nmurder and fisticuffs came to an for honorary president held last may possess. Several introductions<br />\nvices as coach, the club presented members of the class.<br />\nend. But it was not always so. Wednesday. After many speeches are played to her song before she Mr. Swindell with a silver afterAfter several short talks by<br />\nLast year two days after the ban- extolling the relative merits of Drs. comes on and the spot is focused on dinner coffee set appropriately inBroadas Mitchel and W.P. Christie, one end of the stage. The whole<br />\nWhite<br />\nand Dalsemer in regard to<br />\nscribed, and a gold watch chain.<br />\nquets were over the 'West Coast and a vote was taken and a tie resulted.<br />\npurpose of number two is to key up Warfield, personally and on behalf the offices, as well as the candidates.<br />\nSouth America were just beginning<br />\nThe election was featured by the the audience and get them interested of the \"Barnstormers,\" thanked for the responsible positions of<br />\nto hear the news.<br />\n\"straight-ticket\" voting by members in the show. However, not too great George Berry as production man- editor-in-chief and business manof the engineering and arts and sci- a pace may be set, or the acts which ager and Douglas Prahl as business ager, ballots were distributed and a<br />\nence schools. The engineers voted follow will not be able to measure manager for the large parts they vote taken in each case. Allen and<br />\nsolidly for Dr. Christie and Dr. Mit- up.<br />\n\"acted\" in achieving the success of Eldridge received a majority of the<br />\npolled the entire vote of the<br />\nchel<br />\nNumber three isn't so important, the year's production. A letter votes cast for the editorial and<br />\nVarsity Debating Team candidates<br />\nfor the A. B. degree.<br />\na dancing or talking act utilizing two from Mrs. Swindell was read, business staff heads, respectively. Win Over Lafayette A selection will be held sometime parts of the stage. This act often which thanked the club for the Among the other guests present<br />\nthis week to break the deadlock.<br />\n(Continued on Page 7, Column 2)<br />\nflowers and good wishes sent her. was H. Ridgely Warfield, president<br />\nGetting off to a flying start, the<br />\nMrs. Swindell and Miss Margaret of the Senior class, who wished the\"<br />\nvarsity debating team gained a deHABERDASHERS SEE SALES INCREASE<br />\nSwindell were presented with Barn- Junior class success for the coming<br />\ncisive decision over the team repreAS SOPS AND FROSH WAGE BATTLE stormer pins (replicas of the usual year, and extended the compliments<br />\nsenting Lafayette College in the first<br />\nkey), for their services during the of the graduating class.<br />\nA quiet reigned on the campus aroused by the vision of real action<br />\ninter-collegiate debate of the season,<br />\nyear, especially getting the \"girls\"<br />\nWith the speaking program and<br />\nthat was broken only by the col- and memories of the famous Annheld in the Civil Engineering Hall lective scouting around of small apolis scrap, immediately jumped ready for the show. Keen appre- elections over, the toast-master inciation was evidenced for the great formed the members of the last,<br />\nlast Friday evening.<br />\nfreshman groups. For the first into the fray. A race through the<br />\nwhich Mrs. Swindell gives so but certainly not the least, part of<br />\naid<br />\nThe Hopkins team, composed of time this year was there any display Barn ensued in which the cause of unselfishly each year, and which is the evening's festivities—the arrival<br />\nof organized frosh spirit on the Col- the class of '30 seemed to be doomed.<br />\nunknown to most persons except of the scintillating but as it later<br />\nNorman B. Gardiner, W. R. Mclege grounds. Collegiates in clothes Reserve forces in the form of BarnDorman and Wilmer H. Driver, decidedly non-collegiate and nonde- ward strolling frosh and sophs aug- those in the production.<br />\nturned out, reticent entertainers.<br />\nrepresented the affirmative of the script prowled around. A little spirit mented the setto to the size of a Production Staff Will Work Hard Their interpretations of the latest,<br />\nquestion, \"Resolved, That the United of the annual banquet season hov- good, old-fashioned class battle. 0, Next year there will be twenty perhaps the oldest, too, of the light<br />\nwere I in a Homeric muse! With men in the Barnstormers compared fantastic creations, were received<br />\nStates should refuse military pro- ered about.<br />\nUnaccustomed to participation in what delight could be pictured the to the fourteen of this year. This with favor—but only \"protempore\"<br />\ntection to investments abroad.\"<br />\nuntoward acts,the freshmen searched rolling, struggling figures of antag- is the largest membership the or- for it was generally conceded by all<br />\nThe Lafayette team presented a about with a negative aggressive- onistic classmen, the frantic and un- ganization has ever possessed at the present that these artists suffered<br />\nstrong case and not until the latter ness. Small skirmishes ensued and organized runnings about. After start of a new season. A severe from sheer artistic temperament. Fifty-six members of the Class<br />\nstages of rebuttal did the Hopkins were immediately squelched. Final- ties had been torn from throats, hats loss will be felt in the male talent<br />\nly, three daring and impulsive fresh- taken by rival classmen, this prelim- due to the graduation of Warfield, of '29 were present. The excellent<br />\nteam gain an upper hand.<br />\nmen entered the second floor of the inary scrimmage ended. Favor the White and Boynton. As to \"girls\" dinner eaten in open peace and quiet<br />\nBarn,<br />\nA dance scheduled to be held after<br />\npounced with unaccustomed sophs. It was soon to be followed, the Thespians are pretty well fixed. formed a strange contrast to forforce<br />\nupon<br />\nan unsuspecting, bridge- however, by a battle of more No definite plans have been made mer years of bad food eaten in<br />\nthe debate was postponed because of<br />\nplaying<br />\nsoph<br />\nand attempted to make Homeric proportions on the steps of this early for next year. The pro- secret and midst a noisy class.<br />\nthe small crowd. Though the audiaway with him. Dead as the classes the Memorial Dormitory whither duction staff will face the hardest<br />\nThe committee in charge of the<br />\nence was few in number, the apof '30 and '31 are reputed to be; this blood-lusty freshmen had gone in season ever experienced as all the Junior banquet consisted of Paul<br />\nPlause and interest was manifest by action could not be allowed to go quest of sophs. This battle resulted<br />\nold \"flats\" will have to be scrapped Frisch, chairman; B. Hammond, H.<br />\nan unusual amount of handclapping. unchecked. A nearby sophomore,<br />\nand new ones built to replace them. Caplan, and R. Stevenson.<br />\n(Continued on Page 7, Column 1)<br />\nThe so-called \"big time\" show<br />\ncontains on an average of eight acts.<br />\nThese are gathered from all over the<br />\nadjacent territory. If the show is<br />\nto be in Baltimore the acts will be<br />\ntaken from Washington, Pittsburg,<br />\nWilliam B. Banks, who has been<br />\nPhiladelphia, and so forth. In the<br />\nmain office in the Puttman building, elected President of the Barnstormers.<br />\nNew York, a man is assigned to each<br />\nof the large Keith houses. The acts<br />\nare juggled around to fit best in this<br />\ncentral office.<br />\n<br />\nBANKS AND GLAZIER ARE<br />\nELECTED BY 'STORMERS<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 3, 1928<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\nCONCUCT AND RESPECT<br />\n<br />\nTHE LITTLE THEATRE<br />\nFRANKLIN<br />\n<br />\nN. HOWARD ST. NEAR<br />\nMotion Picture Guild Presents:<br />\n<br />\nThe conditions which are subject wane, to a slight extent, but the<br />\nto mediocre discussion are, in all basic elements have not been subEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nprobability, not general throughout jected to disintegration.<br />\nBaltimore, Md., under Act of Congress, November 3. 1879.<br />\nIn considering the matter of<br />\nthe lecture and class rooms of the<br />\nOF<br />\ncourtesy to the professor or inPublished semi-weekly from October to June by the students of Johns University, but many come into con- structor, who conducts the class for<br />\nHopkins University.<br />\ntact with such a state of affairs in the students' benefit, the idea of<br />\nvarious classes. The subject is an respect is brought up, to say nothing<br />\nFirst<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nold<br />\none, but yet after grammar of being polite to a man who is suHopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nBaltimore Presentation<br />\nschool and prep-school training perior and is making an effort to<br />\nother communications to the EDITOR-IN-CHIEF.<br />\nways<br />\nA spectacular production, impresnumerous individuals still persist in offer an explanation of the<br />\nshowing the life and ROsively<br />\nand<br />\nprocess<br />\nof the world, scientific<br />\nTelephone<br />\nMANCE of great Gotama BudUniversity 0100 maintaining, here and there, a state<br />\ncultural knowledge. As every one<br />\ndha.<br />\nof disorder and discourtesy.<br />\nknows, respect and courtesy are due<br />\nEDITORIAL DEPARTMENT<br />\nAll leading roles are enacted by<br />\nThe question of order, attention, to superiors and this idea has been<br />\nPrinces and Princesses of East<br />\nEditor-in-Chief<br />\nIndia; only natives are in film.<br />\nand quiet in recitation and lecture impressed on the individual since<br />\nGEORGE E. BANKS, JR., '29<br />\nhas many times been hashed over his childhood. In some cases the<br />\nOther Entertaining Short Films,<br />\nManaging Editor<br />\nAssistant Managing Editor<br />\nand probably will be many more professor is actually insulted and<br />\nincluding the Second Chapter of<br />\nPHILIP W. NESS, '29<br />\nGEORGE GUMP, '30<br />\nthe \"Heavenly Bodies\" Series.<br />\ntimes. In the days of \"Way back there may be resentment caused by<br />\nprofessor<br />\ncases<br />\nthe<br />\nother<br />\nColumnist<br />\ninsult.<br />\nIn<br />\nWhen\" the teachers and instrucLITTLE THEATRE ORCHESTRA<br />\nDONALD HISS, '29<br />\ntors from kindergarten to high is subject to disgust. Likewise the<br />\nAssociate Editors<br />\nschool have inflicted punishments conduct is tolerated in other cases,<br />\nWILMER H. DRIVER, '29<br />\nRICHARD H. WOOD, '29<br />\nfrom \"Please leave the room; I'll but in none is it approved or enBUSINESS DEPARTMENT<br />\nattend to you after class\" to the couraged. In every case a respect<br />\nuse of the raw-hide whip, of the is desired whether it is sincere or<br />\nBusiness Manager<br />\ngrammar<br />\nschool days, to even ex- pretended, depending on numerous<br />\nHARRY 0. SCHLOSS, JR., '29<br />\nE. E. ADAMS<br />\nfrom<br />\npulsion<br />\nhigh school on conditions of interest in the course.<br />\nAdvertising Manager<br />\nCirculation Manager<br />\nis<br />\nstudents<br />\nfellow<br />\nto<br />\nCourtesy<br />\ngrounds<br />\ngeneral<br />\nof<br />\nprinciples<br />\nand<br />\nGEORGE M. GLAZIER, '29<br />\nJ. ROBERT MYERS, '29<br />\nBARN CAFETERIA<br />\nmild incorrigibility. In most cases also an idea that is of no minor imconsidering<br />\nconduct<br />\nwhen<br />\nPrinted by Fleet-McGinley, Inc., 8th floor, Candler Building, Baltimore, Md. the results, order and quiet, were portance<br />\ndue to threatened corporal punish- in its entirety. In every classroom<br />\nment in the lower grades to sus- or lecture everyone has the right<br />\npension or even expulsion in prep- to demand that confusion and disschool. In that stage of life it is order do not distract his attention<br />\nassumed that the average individual or make it impossible for him to<br />\ndoes not have all the qualities that acquire full benefit from the class Phone, CAl. 1380<br />\nHome—HO. 20954<br />\nthe gaping, wide-eyed school boy he would keep him on the \"Straight or lecture. In a few cases the conPROGRESS<br />\nFRANCES T. BANNON<br />\nbecomes the reincarnation of Frank and Narrow\" of class room deport- fusion prevents anyone in the back Successor to HARBAUGH & BANNON<br />\nOR POVERTY?<br />\nment, and hence the ideas of chagrin of the room from hearing every- 2 E. LEXINGTON ST., Cor. Charles<br />\nOLLOWING on the heels of the Merriwell, Fred Fearnot or some<br />\n(Room 28)<br />\nand frictional warmth were by ne- thing that goes on. If a student has<br />\nother<br />\nmythological<br />\nchampion.<br />\nHe<br />\nis<br />\nI'announcement that publicationStenographic Dictation, Copying,<br />\nshould<br />\nhe<br />\nwork<br />\nfor<br />\nthe<br />\nno<br />\ninterest<br />\nthe<br />\nof<br />\nover<br />\nthe<br />\nheads<br />\ncessity held<br />\nstaff members would be compensated the recipient of much back slapping<br />\nMultigraphing, Mimeographing<br />\nstudents. It is taken for granted at least not be detrimental toward<br />\nand<br />\nhandshaking.<br />\nThus<br />\nthe<br />\npleasant<br />\nBaltimore, Md.<br />\nby sharing in the fruits of their labor,<br />\nthat by the time the individual has the work of others. In case the<br />\nthere has come much mumbling and feeling of being the idol of the hour<br />\nacquired all the knowledge neces- student feels that he must attend<br />\ngrumbling from a small group on the is, for the athlete, sufficient compenCarl J. Doederlein<br />\nsary for college and has mani- quiz or lecture because of the roll<br />\nsation<br />\nfor<br />\na<br />\nseason<br />\nof<br />\nhard<br />\nwork.<br />\ncampus. These well-meaning individthat<br />\nothers<br />\nconsider<br />\nshould<br />\nhe<br />\nbook<br />\nabsorb<br />\nhigher<br />\nability<br />\nfested<br />\nto<br />\nhis<br />\nDIAMONDS<br />\nNow let us consider the position of<br />\nuals are still laboring under the archeducation he should have the quali- are not present for the same reathe<br />\nstudent<br />\nwho<br />\nembraces<br />\nthe<br />\nvocaMfrs.<br />\nof<br />\nFraternity<br />\nGoods of All Kinds<br />\naic notion that the editors and business<br />\nfications of order and deportment son that he is.<br />\ntion<br />\nof<br />\na<br />\ncollege<br />\njournalist.<br />\nA<br />\nman<br />\n504<br />\nPARK<br />\nBANK<br />\nBUILDING<br />\nmen on the various campus journals<br />\nThe discussion herein attempted<br />\nby virtue of his craving for knowl(Lexington at Liberty Sts.)<br />\nwould become stained with the blot on the Blue Jay may sit up for half<br />\nedge, training, and common sense. follows an old vein and no doubt<br />\nof \"Commercialism\" if they were to the night and, by means of much Apparently, a certain group has is a repetition of ideas that have<br />\nA. H. FETTING<br />\naccept a portion of the year's profits. brain racking and mental effort, suc- been short-suited in the endow- been more or less prevalent for a<br />\nMANUFACTURING<br />\nJEWELRY<br />\nceed<br />\nin<br />\nproducing<br />\nseverAl<br />\ncolumns<br />\nof<br />\nSeveral weeks ago, in these colment of the three above mentioned number of years. Also, the condiCO.<br />\ngood<br />\ncopy.<br />\nThe<br />\nmagazine<br />\nis<br />\npubumns, our predecessor showed very<br />\nqualities. The idea back of the tions which are criticised are of<br />\nManufacturers<br />\nclearly how, year after year, the lished, his jokes may cause consider- honor system is based partly on this little importance relative to the<br />\nGREEK<br />\nLETTER<br />\nFRATERNITY<br />\nable<br />\nmerriment<br />\nbut<br />\nthe<br />\nauthor,<br />\nout of<br />\nBlack and Blue Jay and the NEWSJEWELRY<br />\nidea of common sense and mostly whole mass of student affairs, but it<br />\nthe<br />\nspot<br />\nlight's<br />\nglare,<br />\nremains<br />\nob213 N. LIBERTY STREET<br />\nLETTER lose valuable and efficient<br />\non the moral aspects of honesty is true that there should be an immen who are forced, because of finan- scurely in the background.<br />\nand truth. Here is an idea of in- provement in this minority of stuA<br />\ncial difficulties, to seek part-time em- Take the case of a member of the tegrity in supporting the ideals of dents although ideal conditions can<br />\nployment in downtown business es- business staff who, by means of inYELLOW CAB STAND<br />\nthe student body in general. Ap- be only remotely approached.<br />\ntablishments. Many of these men numerable visits and much persuasion, parently the honor system is on the<br />\nW. H. O.<br />\nAT<br />\nmight have been retained if they had may cause a client to renew his adverHOMEWOOD FIELD<br />\nbeen allowed to share in the earnings tising contract. Although, he has<br />\nSECRETS<br />\nTRANSMISSION<br />\nBLACK<br />\nWELL<br />\nTELLS<br />\nOF<br />\nadded<br />\nmuch<br />\nto<br />\nthe<br />\npublication's<br />\ninat the end of the year.<br />\nNo Charge for Extra Passengers<br />\n(Continued From Page 3, Column 1)<br />\nTo the opponents of this plan, the come, he receives no compensation for<br />\n'PHONE<br />\nwhole scheme has assumed the shape his work. He remains among the record a telegraph dot sent from them is also impossible to counterof an immense bogy man which has silent heroes, \"unhonored and un- London to New York, a second dot act, while in the cable it is easily<br />\nVERNON 1212<br />\nno more basis in real fact than Mr. sung.\"<br />\nFOR A<br />\nwill appear over the first. This is gotten rid of.<br />\nThere is still another angle from due to the fact that the waves also<br />\nHearst's \"Mexican plot\" and perenbe<br />\nseem<br />\nto<br />\nCables, on the whole,<br />\nYELLOW CAB<br />\nnial \"yellow peril.\" Amateurism has which the problem may be viewed. went around the earth in the oppo- the better means of transmission at<br />\nbeen set upon a pedestal, surrounded Under the present system, there is site direction. In contrast to this present. By 1934 over three-quarters<br />\nby a halo of light and worshiped absolutely no incentive for the staffs the cable uses a very small space. of the communication of the long<br />\nwith all the fervor exhibited at the to practice economy. The publicaThe cable looses all but about ten distance telephone circuits will be by<br />\ntions' members realize that any prof- to the minus 333 power of the origi- cable. \"It is getting to the point<br />\nshrine of a martyred saint.<br />\nThe NORMAN-REMINGTON CO.<br />\nFrom the athletes we also hear loud its which they accumulate by means nal energy put into it. If the cable where you can talk to any part of<br />\nMAIN<br />\nSTORE,347 N. CHARLES ST.<br />\nshouts of protest. Why, they ask, of their industry will be handed over has inductance put into it, however, the country and your voice won't<br />\nBranch<br />\nBargain, 1217 N. Charles St<br />\nshould we practice for long hours and to the staff for the following year. to counteract the capacitance effect have to go out of doors.\"<br />\nsubject ourselves to rigid training This condition has given rise to the of the sea this percentage is raised<br />\nMr. Blackwell's lecture was illusrules without pay in order to repre- philosophy of \"gather ye rosebuds to about ten to the minus 131. To trated all the way through by slides.<br />\nPHONES: HOMEWOOD 7806<br />\nsent our University in sports while while ye may.\" In order to consume get an idea of about how much is After it a moving picture was shown<br />\nHOMEWOOD 7807<br />\nmembers of the publications' staffs are any surplus, the outgoing board of lost, if all the energy radiating from of how communication is done bePhone Us—We Deliver<br />\nallowed to share in the profits which' control will indulge in spending orgies the sun were fed in one end of a tween Los Angeles and Plymouth,<br />\nwhich rival even the Congressional thousand mile cable not enough England.<br />\nthey earn?<br />\nR. M.BIRELY,Phar.D.<br />\nTo compare the position of the junkets in extravagance.<br />\nwould be left at the other end to be<br />\nThis was the third of a series of<br />\n0. D. K. and the other campus audible.<br />\nathleie with that of the publication<br />\nlectures on Engineering Practice<br />\nPrescription Pharmacist<br />\nworker is quite ridiculous. On the groups -which oppose the compensaThe thing to do then is to amplify. given in the Mechanical Engineer<br />\nSODA - CANDY - CIGARS<br />\nfield, the athlete is in the public eye. tion scheme seem to look upon the This is done about every fifty miles. Building. Mr. Blackwell is TransThe cheering section shouts his name whole idea as if it were something<br />\nmission Development Engineer for<br />\nCor. St. Paul and 33rd Sts.<br />\nEffect of Temperature<br />\nto the high heavens. His pictures radically novel in college activities.<br />\nthe American Telephone and TeleBALTIMORE, MD.<br />\nThe change in temperature be- graph Company.<br />\nadorn the sporting pages of the local In many of the large colleges of the<br />\nnewspapers. Let him score the win- East, the plan has been operating for tween the hottest day in summer and<br />\nning touchdown in a hotly contested years. The newspaper and magazine the coldest day in winter causes an<br />\nEdwin H. Knopf and William P. Farnsworth<br />\nfootball game and his name is on staffs are paid certain stipulated sal- extremely high effect on the cable.<br />\nAnnounce for the week of April the Second<br />\nevery tongue. Let him shoot a much- aries and the whole organization is This is taken care of by using a pair<br />\nbusiness-like<br />\nin<br />\nan<br />\nact<br />\nas<br />\npilots.<br />\noperated<br />\nefficient,<br />\nwires<br />\nin<br />\nthe<br />\ncable<br />\nto<br />\nand<br />\nof<br />\ndesired goal in a lacrosse match<br />\nhe is borne off the field on the should- manner. With the present condition The change in resistance in these<br />\nby Walter Hackett<br />\ners of his admirers to the accompani- at Hopkins, the publication is under regulates the amplifiers, and the subment of much frantic pennant wav- obligation to the individual rather scriber doesn't notice any difference.<br />\nA rollicking, rousing and romantic story of<br />\nthan the individual to the publication. Radio may not be controlled in<br />\ning and hysterical huzzaing.<br />\nthe Spanish Main<br />\nSuch a state of affairs stands as a this way. The sun's radiation, esThe athlete is playing for the love<br />\nNever before in Baltimore<br />\nof his Alma Mater. That may be bulwark against any attempt to intro- pecially, effects it. On some days,<br />\nAsk<br />\nabout<br />\nour special subscription plan<br />\nperfectly true, but at the same time duce improved methods. It is impos- even with all the improved devices,<br />\nhe is enjoying the unmistakable sensa- sible to bring about progress when all oceanic transmission becomes imAUDITORIUM THEATRE<br />\npossible by radio. Distortion in<br />\ntion of being the popular hero. To incentive is lacking.<br />\nSubscription<br />\n<br />\n$2.00<br />\n<br />\nLIGHT<br />\nASIA<br />\n<br />\nEDITORIAL COMMENT<br />\n<br />\nF<br />\n<br />\nBOOKS<br />\n<br />\n•••••••<br />\n<br />\n\"CAPTAIN APPLEJACK\"<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 3, 1928<br />\n<br />\n•••••••••••<br />\n<br />\n15-3-<br />\n<br />\nON<br />\n<br />\nEly<br />\n<br />\n3<br />\n<br />\ners<br />\n<br />\n0.<br />\n<br />\n;<br />\n<br />\n•••••••••<br />\n<br />\nk<br />\n<br />\nBLACKWELL LECTURES ON ULTRA-VIOLET RAYS<br />\nTYPES OF TRANSMISSION EXPLAINED IN LECTURE<br />\nExplains Intricacies of Radia, Dr. Wood Mystifies Group by<br />\nVarious Gastly Effects on<br />\nOpen Wire, and Cable<br />\nPaper<br />\nCommunication<br />\n\"It is the popular conception that<br />\nthe energy transmitted in the open<br />\nwire telephone goes through the<br />\nWires,\" said Mr. 0. B. Blackwell in<br />\nhis lecture last Wednesday on \"The<br />\nThree Types of Transmission Used<br />\nin Communication — Radio, Open<br />\nWire and Cable.\" However, according to Mr. Blackwell, this is<br />\nnot the case, but rather that the<br />\nelectrons of the air for a space of<br />\nabout a yard surrounding the wires<br />\nare the means whereby the energy<br />\nis propagated. The purpose of the<br />\nwires is the guidance of this electricity and the prevention of its dissipation.<br />\nThe Cable<br />\n<br />\n\"No secret writing here\" read the<br />\nperfectly blank and white piece of<br />\npaper that Dr. R. W. Wood, during<br />\nthe course of a lecture last Thursday, placed in the practically invisible rays emanating from an ultraviolet ray projection lantern.<br />\nDr. Wood, whose brilliant experiments on light have achieved worldwide renown, and who addressed the<br />\nStudent Assembly some time ago on<br />\nhigh frequency sound waves,showed<br />\nseveral startling properties of this<br />\nbut dimly discernible beam to prove<br />\nsome points in connection with his<br />\nsubject \"Phosphorescence and Fluorescence.\"<br />\nAll Objects Fluoresce<br />\n<br />\nThe cable is a more extreme case<br />\nAccording to this authority, very<br />\nof wire transmission, for in the<br />\nspace of less than three inches there nearly all substances fluoresce to a<br />\nare over three hundred circuits each certain extent. Fluorescence, in<br />\nof whose energy follows a path lit- short, is the term applied to that<br />\ntle more than a fifth of an inch in property of bodies in general to give<br />\ndiameter, about the size of a lead out light of their own under the<br />\npencil. Here is the difference becolored light<br />\ntween the immense area used in stimulus of a different<br />\nthis is<br />\nthem.<br />\nThat<br />\nshining<br />\nupon<br />\nradio transmission and the small<br />\nfor<br />\nnot<br />\nordinarily<br />\napparent<br />\ntrue,<br />\nis<br />\nthe<br />\nin<br />\nused<br />\nlead pencil size of field<br />\nthe reason that, in ordinary light this<br />\ncable.<br />\nRadio, on the other hand, permits newly created light from the suba huge amount of stations to be stances is so weak as to avoid deplaced in a small frequency space.<br />\ntection with the eye because of the<br />\nThis large number is made possible<br />\nenormous<br />\namount of other light.<br />\nby the use of carrier waves of high<br />\nfrequency which the voice controls.<br />\nMany Ghastly Effects<br />\nEach station is alloted its own band<br />\nBut in ultra violet light, which is<br />\nand the voice acts on only that one<br />\nalmost invisible, substances may<br />\ncarrier.<br />\nEconomy on open wire systems glow so as to be very clearly seen,<br />\nhas resulted in the use of four tele- due to the fact that other light is<br />\nphone circuits and several telegrams eliminated (the experiment taking<br />\nper pair of wires. By using con- place in a darkened room.) Many<br />\nductors to guide the energy, its space ghastly effects were brought out.<br />\nis determined, whereas, by using The hand glows with a peculiar<br />\ncarrier waves several messages are tinge. The teeth stand out with an<br />\ntransmitted over the same wires. unearthly sheen. Diamonds, or any<br />\nStill, however, it is impossible to ap- other of the so-called precious stones<br />\nproach the number of messages glow most beautifully—and all apwhich may go over the radio at the parently in the dark due to the invisibility of the ray.<br />\nsame time.<br />\nIt Was during this part of the exTelephones Create Problem<br />\nperiment that Dr. Wood held a plain<br />\nWhen telephones began to become white piece of paper before the<br />\nnumerous a very objectionable con- assemblage and told how, during the<br />\ngestion arose with the use of open course of the World War, he had<br />\nwires. The cables have done away astonished several British officials by<br />\nwith this. In a diameter less than taking a piece 'of paper which was<br />\nthree inches, 1,200 subscribers' mes- supposedly, so treated with chemicals<br />\nsages may be carried with only a that it was impossible to place any<br />\nmillionth fraction of any mix. Even secret writing on it with invisible<br />\nwith these cables, though, conges- ifik, and after having stamped an<br />\ntion is beginning to rise in the con- invisible message on it placed it in<br />\nduits.<br />\nthe rays of the violet ray machine.<br />\nCables have proven so successful Then the words \"no secret writing<br />\nthat they are over almost all of the here\" might easily be read.<br />\ncountry; about 2,000 miles are being<br />\nColors Not Colors<br />\nlaid yearly. Such a system is imWhy does a picture appear colmune from storm and most atmosored? This beautiful panorama in<br />\npheric noises.<br />\nIn transoceanic radio we are variegated tints shows a young girl<br />\nusing about all the space on the holding fruit. Why do the colors apearth. If a seismograph is used to pear as colors? Dr. Wood said that<br />\n(Continued on Page 2, Column 3)<br />\n<br />\n(Continued on Page 4, Column 1)<br />\n<br />\nauJo gei More<br />\nMileage fro<br />\n<br />\nBETHOLIN-E<br />\n\"THE WONDER MOTOri FUEL:'<br />\n<br />\nSTETSON HATS<br />\n<br />\nLured by<br />\nAroma of<br />\nNeighbor's<br />\nTobacco<br />\n<br />\n°rkunt5Xen<br />\ni<br />\neVed<br />\n<br />\nBoston, Mass.,<br />\nApril 21, 1927<br />\nLarus & Bro. Co.,<br />\nRichmond, Va.<br />\nGentlemen:<br />\nThis morning I had a smoking adventure worth recording.<br />\nNext to me in the smoking car a<br />\ngentleman was puffing his pipe contentedly. I was not smoking at the<br />\nmoment,and the aroma of his tobacco<br />\nintrigued me exceedingly. For twelve<br />\nyears I had smoked Edgeworth without being tempted by any other brand,<br />\nbut the fragrance emanating from the<br />\npipe of the gentleman beside me was<br />\nso agreeable that I could not resist<br />\nthe temptation to speak of it.<br />\n\"That is wonderfully fragrant tobacco you have there,\" I remarked.<br />\n\"Would you mind telling me the name<br />\nof it?\"<br />\n\"It is Edgeworth,\" he answered.<br />\nWe then congratulated each other<br />\nupon our mutual good taste, and I<br />\ndecided that I would continue to use<br />\nhis brand and mine.<br />\nSincerely yours,<br />\nS. H.<br />\n<br />\nSoft hats for travel comfort<br />\n—hats of Stetson quality to<br />\nwithstand travel wear—and<br />\nStetson style to travel as<br />\nbecomes a gentleman.<br />\nEight to<br />\nForty Dollars<br />\n<br />\nEdgeworth<br />\nExtra High Grade<br />\n<br />\nSmoking Tobacco<br />\n<br />\nSKILL<br />\nHE twist of the wrist, the<br />\n\"throw\" ofthe arm,the shifting<br />\nofthe weight—these are among the<br />\nmany little points which make the<br />\nskill that you admire in the javelin<br />\nthrower as he hurls the shaft two<br />\nhundred feet or more.<br />\nAs on the track or the football<br />\n• field,in the gymnasium or on<br />\nthe water,so in industry progress is the result of fine<br />\nimprovements—a thousandth<br />\n<br />\nT<br />\n<br />\nof an inch here—a minute variation<br />\nin a curve there—slight changes<br />\nforeseen by engineers and carried<br />\nout by skilled workmen.<br />\nIt is this attention to detail that<br />\nis constantly improving General<br />\nElectric apparatus and contributing<br />\nto the electrical industry, which,<br />\nthough still young,is already<br />\na dominant force, increasing<br />\nprofitand promoting success<br />\nin every walk of life.<br />\n<br />\nWhether you find this monogram on an electric refrigerator<br />\nfor the home or on a'206,600-horsepower turbine-generator<br />\nfor a power station, you can be sure that it staas for<br />\nskilled engineering and high manufacturing quality.<br />\n;<br />\n1<br />\n<br />\n9<br />\n<br />\n9DH<br />\n<br />\nGENERAL EliCTRIC<br />\nGENERAL<br />\n<br />\nELECTRIC<br />\n<br />\nCOMPANY,<br />\n<br />\nSCHENEOTADY,<br />\n<br />\nNEW<br />\n<br />\nYORK<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 3, 1928<br />\n<br />\n4<br />\nVIOLET RAY LECTURE<br />\n(Continued from Page 3, Column 2)<br />\n<br />\nthe answer to this was that they do<br />\nnot, that is at least not always. To<br />\nprove this contention he illuminated<br />\nthe picture with a sodium light,<br />\nwhich is a pure yellow light. All the<br />\ncolors with the exception of yellow<br />\ndisappeared, and only- a flat picture<br />\ncontaining yellow and various shades<br />\nof black was seen.<br />\nWhy such a result should occur is<br />\nrather simply explained by this<br />\nfact: it is only by virtue of the reflecting of light that falls on it does<br />\nan object show color. The color of<br />\nthe light that is not absorbed, but<br />\nreflected determines the color that<br />\nwe see. Hence a rose appeared red<br />\nin white light, which is a mixture<br />\nof all colors because it absorbs all<br />\nlight but red and this it reflects<br />\nwhich makes it appear red to us.<br />\n<br />\nS<br />\n<br />\n0<br />\n<br />\nYou do get Better Kodak Pictures<br />\nfro m<br />\n<br />\nConvenient and Economical<br />\nTRANSPORTATION<br />\n<br />\nTHE<br />\n<br />\nSTREET<br />\n<br />\nDecorations<br />\n<br />\nCARS<br />\nInterior Wood Work<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\n3044 GREENMOUNT AVENUE<br />\nUniversity<br />\n<br />\n3829<br />\n<br />\nBALTIMORE, MD.<br />\nShow Rooms<br />\n343 N. Charles Street<br />\n<br />\nFactory<br />\n600 S. Pulaski Street<br />\n<br />\nPicture Framing<br />\n<br />\nPhotographic Supplies<br />\n<br />\nI<br />\n<br />\n.,)<br />\nC. T. PEARCE,<br />\nDesign of Generators.<br />\nUniversity of New<br />\nMexico,'23<br />\n<br />\nWI<br />\n<br />\ntho_<br />\n<br />\nTL<br />\n,11 _1<br />\n:<br />\n11;<br />\n<br />\nirCILILA Ita<br />\n<br />\nu nun Raul./..<br />\n<br />\nW. A. McGILL,<br />\nTraction Apparatus<br />\nSales.<br />\nCarnegie Tech, '22<br />\n<br />\nWhere have you<br />\nbeen all your life?<br />\n•• •.Europe?<br />\nFor $193.50 you can sail and<br />\nreturn in the modernized<br />\nCARMANIA and CARONIA<br />\nto Plymouth, Havre, and<br />\nLondon,or in the ci-devant<br />\nthree-class ships SCYTHIA<br />\nand LACONIA to Liverpool<br />\n... gateway to picturesque<br />\nEngland ... Cathedrals,the<br />\nLakes, the Dukeries, Oxford,Cambridge,London...<br />\nRecognizing the justifiable<br />\npopularity of tourist travel<br />\namong those willing to economize on the ocean to have<br />\nmore money to invest in<br />\nmemories of Europe... we<br />\nhave taken two new 20,000<br />\ntonners the SCYTHIA and<br />\nLACONIA from first class<br />\nservice and made them<br />\nCabin and Tourist Third to<br />\nLiverpool ... staterooms<br />\nsold up to a few weeks ago<br />\nat second cabin rates now<br />\navailable at Tourist Third<br />\n... one of the world's best<br />\nsteamship bargains.<br />\nDancing to the syncopation<br />\nof a college orchestrano feet<br />\nhave yet resisted...longwide (leeks on which you<br />\ncan do your 'mile'... or<br />\nwork up your back-hand at<br />\ndeck tennis...or start that<br />\ncasual conversation which<br />\nbecomes a tete-a-tete the<br />\nthird day out...<br />\nAnd, of course, that wellconsidered food ...that<br />\ncheerful attendance— you<br />\nare traveling Cunard.<br />\n<br />\nCUNARD<br />\nLINE<br />\n<br />\n.44<br />\n,<br />\n44P.\"4444:<br />\n,<br />\n<br />\n••<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\n?:77:77grag!!!<br />\n<br />\n-<br />\n<br />\nYOUNGER COLLEGE MEN<br />\nH. C. COLMAN,<br />\nHeadquarters Sales,<br />\nOhio State. '23<br />\n<br />\nON RECENT WESTINGHOUSE JOBS<br />\n<br />\n1928<br />\n<br />\nEIGHTY • EIGHT • YEARS • OF • SERVICE<br />\n<br />\nW. R. OVERHOLT,<br />\nContract<br />\nAdministration,<br />\nOhio Northern, '08<br />\n<br />\nThe San Francisco Ferries<br />\nWhere do young college men get in a large<br />\nindustrial organization? Have they<br />\nopportunity to exercise creative talent?<br />\nIs individual work recognized?<br />\n<br />\nnow has the<br />\nfinest ferry fleet in all the<br />\nworld. Recently there were added<br />\nto it four Golden Gate Dieselelectric auto ferries; one Southern<br />\nPacific Diesel-electric auto ferry;<br />\none Northwestern<br />\nPacific Dieselelectric auto ferry;<br />\nand the Key SysAN<br />\n<br />\n0<br />\n<br />\nFRANCISCO<br />\n<br />\ntern's two electric-drive giants—<br />\nthe largest passenger ferries ever<br />\nbuilt. These modern steel boats<br />\n— all Westinghouse-equipped —<br />\ngive to the Bay cities a ferry<br />\nservice unsurpassed for speed and<br />\nsafety, cleanliness and comfort.<br />\nThe big jobs go to big organizations. Westinghouse attracts<br />\nyoung men of enterprise and<br />\ngenius because it daily provides<br />\nopportunities for pioneering and<br />\n<br />\noutstanding work which smaller<br />\ncompanies can seldom offer.<br />\n.<br />\n7<br />\n<br />\n7.7<br />\n,<br />\n<br />\nThe Key System ferries are each<br />\nequipped with two 2,2so-shp. Westinghouse main propulsion motors;<br />\none i,9oo-kilowatt Westinghouse<br />\ngenerator; and one 3,oio-hp. Westinghouse-Parsons turbine.The Southern Pacific, Northwestern Pacific,<br />\nand Golden Gate boats likewise have<br />\nWestinghouse propelling motors and<br />\ngenerators. Auxiliary units, such as<br />\nmotor-drive pumps<br />\nand steering apparatus, are Westinghouse on all these<br />\n<br />\nWestinghouse<br />\n<br />\n319 NO. CHARLES ST.,<br />\nBaltimore., Md.<br />\n<br />\n1840<br />\n<br />\nL. C. FLETCHER,<br />\nTurbine Test,<br />\nClemson,'17<br />\n<br />\nMERLE ROBISON,<br />\nSwitchboard Engineer,<br />\nCarnegie Tech,'20<br />\n<br />\nferries.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 3, 1928<br />\n<br />\nAnd still another leading tobacconist in<br />\nBaltimore, Md.,says:<br />\n\"OLD GOLD is easily the fastest-growing cigarette in this locality, andIshouldn't be surprised<br />\nbefore long to find it the most popular cigarette<br />\non the campus. The boys sure do like its<br />\nsmoothness.\"<br />\n<br />\nEphram Bacon, Regtsct Pharmacist<br />\n31st and St. Paul Sts.<br />\n<br />\nFor a most refreshing change:<br />\n<br />\n\"Follow your friends and smoke<br />\nthis smoother and better cigarette<br />\n<br />\n5<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 3, 1928<br />\n<br />\nHALL HEARINGS<br />\nSpring has come not without its<br />\nvarious effects. Everywhere in the<br />\nvicinity of the Hall one can see<br />\nverdant signs. Baseball is the most<br />\nsignificant. Every day there are several of the boys on the quadrangle<br />\ncatching. In fact the spirit of the<br />\ngame has gotten them so badly that<br />\nthey tried it on Sunday. Sergeant<br />\nFrank put a quick stop to this with<br />\nthreats of backing up the \"wagon.\"<br />\n<br />\nThe batteries for the Hall baseball<br />\naggregation have been \"warming up\"<br />\nall winter on their curves. The organized practice was held every Friday after lunch. When baseballs<br />\nwere impractical they used the apples served at lunch on Friday.<br />\nThese served a double purpose in<br />\nthat they provided good practice<br />\nand that they could be used to bear<br />\nout grudges.<br />\n<br />\nIt has been observed that more<br />\nand more \"automobiles\" have come<br />\ninto use lately. Within the last few<br />\ndays an old Ford appeared from<br />\nnowhere running around the campus<br />\nwith 1925 license plates. It runs<br />\nperfectly downhill. It was also<br />\nnoticed that one night an old Chevrolet with half a rear mudguard and<br />\nno top went out and returned with<br />\na rather ill-fitting top and engine<br />\nhood.<br />\n<br />\nB Entry has lost its claim to being the noisiest entry in the Hall.<br />\nWhen it began to quiet down C began to become more active, with the<br />\nresult that it now holds the crown.<br />\nIt seems that the occupants work in<br />\nshifts, the first of which begins at<br />\n11 P. M. and these continue until<br />\nabout 2 A. M. The main duties of<br />\nthe men on the shifts are to shout<br />\nas loudly as possible in the halls, run<br />\nnoisily up and down the stairs and<br />\noccasionally stage a pillow or water<br />\nfight.<br />\n<br />\nPsychology I has played havoc<br />\nwith the greater part of the residents for the past week. Hypnotism has become the chief pastime<br />\nof the boys. Sessions are held in a<br />\nnumber of the rooms from seven<br />\nuntil midnight. These provide for<br />\na great deal of enjoyment at no cost.<br />\nFor information apply to Professor<br />\nRosenthal or his assistants.<br />\n<br />\nWith the end of the month drawing near, money has, as usual, become exceedingly scarce. Most of<br />\nthe residents are at their wits' ends<br />\nas to how to pay for their \"dates\"<br />\nto the Lyric.<br />\n<br />\nMany of the residents have been<br />\nhaving an extremely hard time getting telephone calls through to Goucher residence halls. We suggest<br />\nthat the Goucher authorities see that<br />\nmore phones are installed, especially<br />\nin Glitner.<br />\n<br />\nAt noon time, Tuesday, the residents were entertained by a \"strolling troubadour\" who sang in the<br />\n\"quad.\" We wonder if he got a free<br />\nmeal.<br />\n<br />\nAs to the plan of naming the<br />\nentries, we wish to say that \"B\"<br />\nentry will never be anything else but<br />\n\"B.\" There's a tradition in that letter.<br />\n<br />\nSMALL PIECE OF PAPER FROM WEST<br />\nSENDS JAY STAFF INTO HIGH GLEE<br />\nBlack and Blue Jay adherents<br />\nwere given a thrill yesterday. The<br />\nbusiness department was set to<br />\ntalking, the editorial board to grinning, and the whole staff to congratulating the postal service. No,<br />\na carload of good copy was not<br />\ndumped at the door, nor did the<br />\nprinter decide to set up and print<br />\nthe last two issues gratis, nor did<br />\nthe NEWS-LETTER promise to refrain from certain harsh criticisms.<br />\nWhat, then, could cause all of the<br />\nexcitement? Had the president decided to name the C. E. Hall after<br />\nthe present editors? Had the Gilman Memorial Room been turned<br />\nover to the staff as offices, or had<br />\nthe deal officially sanctioned the Jay<br />\nas a needed New Plan publication?<br />\nNo, none of these. What then?<br />\nThe cause of the disturbance was a<br />\nminor matter, a little slip of paper<br />\na few inches wide and hardly more<br />\nin length.<br />\n<br />\nAlong one edge were little perforations. At the top of this slip<br />\nof paper was printed a few words<br />\nin English. At the bottom was a<br />\nfew more in the same language.<br />\nThe space in between was filled out<br />\nwith typewriting. At the extreme<br />\nbottom on the right-hand side there<br />\nwas an ink mark, hardly more than<br />\na scratch, yet, oh so necessary!<br />\nThe printing at the top was of the<br />\nname of some trust company in<br />\nCleveland. The name at the bottom<br />\nwas Newton D. Baker, former Secretary of War in the Cabinet of<br />\nWoodrow Wilson. The check—for<br />\nthis slip of paper was a check—was<br />\nin payment for a year's subscription<br />\nto the Blue Jay.<br />\nThe Jay members say that the<br />\nSecretary has always been noted for<br />\nhis discernment and sagacity. The<br />\nstaff of the sister publication are<br />\ntrying to reconcile this statement<br />\nwith the check.<br />\n<br />\nTHE MAIL BAG<br />\nEXIT TRADITIONS<br />\nAll letters intended for publication must be concise, written<br />\nin ink, on one side of the paper<br />\nonly.<br />\nNo attention will be paid to<br />\nanonymous letters, but names<br />\nsigned as an evidence of good<br />\nfaith will not be printed if request is made that they be omitted.<br />\nThe publication of a letter is<br />\nnot to be taken as an endorsement of its views by \"The NewsLetter\" which invites the freest<br />\ndiscussion of all matters of general interest.<br />\n<br />\nMORE ABOUT THE \"Y\"<br />\nTo the Editor of the NEWS LETTER:<br />\nDear Sir:<br />\n<br />\nI rise in protest!!!!<br />\nI do not think that anyone who<br />\nknows me will question my loyalty<br />\nto my Alma Mater, nor will they<br />\ndoubt that I am more than willing<br />\nto work untiringly for those things<br />\nthat go to or belong to Johns Hopkins. I am a firm believer in Student<br />\nActivities, including the Hopkins Y.<br />\nM. C. A., which is so unfortunately<br />\nAll Schools Send Representa- connected with the Baltimore and<br />\nNational organizations.<br />\ntives To Saturday Night<br />\nGathering<br />\nLeads<br />\nSecretary of Commerce<br />\nThe fact that a Student Activities<br />\nBuilding is badly needed on the<br />\nNew York Governor By<br />\nLARGE CROWD ATTENDS campus is unquestionable and I<br />\nWide Margin in Colleges<br />\nwould try to be the first one to make<br />\nWhole Upper Barn Decorated a contribution, as small as it would<br />\nIn Black and Blue<br />\nHerbert Hoover and Governor<br />\nhave to be, to a STUDENTS'<br />\nAlfred E. Smith polled more than<br />\nBUILDING, or any building owned<br />\nOn last Saturday night, for the<br />\nthree-quarters of the total number<br />\nsecond<br />\ntime in its history, the Var- by the student body or the trustees<br />\nof votes in the country-wide university Club held its annual prep school of Johns Hopkins. The control of<br />\nsity ballot, conducted by the Inde- smoker. Members of the club, asthis building although of vital impendent, a Boston weekly, and in sisted by various co-eds, began on<br />\nportance, is a secondary matter.<br />\nwhich the NEWS-LETTER took part. Saturday afternoon to decorate the<br />\nBut to be asked to contribute to<br />\nThe Secretary of Commerce polled second floor reading room of The<br />\nthe proposed Levering Hall with the<br />\n22,086 votes, while the New York Barn, obscuring the dingy walls and<br />\nfollowing conditions is in my mind<br />\ngraying<br />\nsteamers<br />\nof<br />\nrafters<br />\nwith<br />\nTammany Hall candidate was only<br />\nblack and blue. The various posts ridiculous and bordering on an ina fair second, with 13,534 votes.<br />\nwere covered with large placards on sult:<br />\nNationally, Reed was runner-up which were inscribed the members<br />\nFirst, at the end of a certain<br />\nto the Democratic leader, with 2208 of the Varsity Club, the Student<br />\nperiod<br />\nof years in case of a dispute<br />\nvotes. At Hopkins, however, Gov- Council, the Student Activities<br />\nCouncil, and various other commit- or in case the University does not<br />\nernor Ritchie occupied this place,<br />\ntees and organizations.<br />\nwant the Y. M. C. A., it cannot acpolling 90 votes to 12 for Reed.<br />\nBefore the hour of eight, the prep quire the building without paying the<br />\nDawes and Lowden trailed Hoover school men began to arrive. They<br />\nHopkins, Baltimore, or National Y.<br />\nin that order nationally, while at were welcomed by Dave Kaufman,<br />\nM. C. A. (it does not matter which)<br />\nHomewood the order was reversed. president, and other members of the<br />\na<br />\nsum which I or any other alumnus<br />\nVarsity Club.<br />\nForty-Five Colleges Take Part<br />\nwould<br />\ngladly help to raise now for<br />\nBlue Jays Entertain<br />\nSeventy publications were reThe meeting opened with Carl Johns Hopkins, but unwillingly for<br />\nquested to take part in the poll. Of Lausch and his Blue Jays giving a the Y. M. C. A. In other words, the<br />\nthis group forty-five accepted, but few selections. Following this,<br />\nownership of the Y. M. C. A. Buildthirty-nine only have sent final re- speeches were made by David Kaufing,<br />\nor Levering Hall, will be vested<br />\nsults, the others delaying because of man, president of the Varsity Club;<br />\nspring vacation and examination Gardiner Mallonee ; George Darley, in the Baltimore Y, which is an offperiods.<br />\ncoach of the basketball team; Her- spring of the National Y, that illusOne of the interesting things man Schiebel, Norman Robinson, trous organization that made such a<br />\nbrought out by the poll is that the \"Father Bill\" Schmeisser and Dr. glorious(?) name for itself during<br />\nSouth is not a \"solid South\" behind Ray. Van Orman, director of ath- the late war. We are being asked<br />\nSmith. Not only did the Republi- letics.<br />\nto contribute to the tune of about<br />\nVan Orman Speaks<br />\ncans run the Democrats a close race<br />\n$160,000<br />\nto a building to be erected<br />\nVan Orman stressed the point<br />\nin the Southern colleges, but in some<br />\nthat,<br />\nof<br />\nwhereas he was a director<br />\non the campus of Hopkins that will<br />\nof them, notably Louisiana, Missouri, West Virginia and Kentucky, athletics, yet he knew the principal not belong to Hopkins, nor even the<br />\nHoover was victorious over the New purpose of Hopkins to be study. Board of Management of the HopYorker. In the University of Ohio, He said that professors at Hopkins kins Y. M. C. A.<br />\nin a State generally considered a were behind the effort to establish<br />\nSecondly, the building is to be run<br />\nlarge factor in any election, the Re- a cage at Homewood, and that just<br />\nby the Y. M. C. A., a<br />\nexclusively<br />\napthat<br />\nmorning<br />\nhe<br />\nhad<br />\nbeen<br />\npublicans, with Hoover leading the<br />\nbeing set aside for stusmall<br />\ncorner<br />\nexpressed<br />\nthis<br />\nproached<br />\nby<br />\none<br />\nwho<br />\nadvance, were swept into office by<br />\ndent activities. The program is to be<br />\nidea.<br />\nlarge majorities.<br />\nframed by the Y. M. C. A. and the<br />\nWillis Polls Few Votes<br />\nchances<br />\nare that they will resort to<br />\nFirst, Second and Third Churches<br />\nmethods of requiring a<br />\nusual<br />\ntheir<br />\nIt is doubtful whether the absence<br />\nof Christ, Scientist<br />\nY. M. C. A. membership as admisof Willis from the election lists<br />\nBaltimore, Maryland<br />\nsion to the facilities, as was my exwould have had any effect, the SenaAnnounce a Free Lecture on<br />\nperience in the Baltimore Y not so<br />\ntor from Ohio polling only a total<br />\nmany years back although I had<br />\ncounthroughout<br />\nthe<br />\nof 443 votes<br />\nbeen a member for several years.<br />\ntry; even in his own State being<br />\nThey will most probably exclude the<br />\nforced to bow to Hoover and Smith,<br />\nJews as was done at the Baltimore Y<br />\none with 604 votes and the other<br />\nBy PAUL STARK SEELEY, C.S.B.<br />\nto one of our most popular athletes.<br />\nwith 146 counts, while his supof Portland, Oregon, member of the<br />\nThe Klu Klux Klan should be<br />\nporters numbered 145.<br />\nBoard of Lectureship of the Mother<br />\nasked<br />\nto come on the campus next<br />\nChurch, the First Church of Christ, SciOver 12,000 votes were cast for<br />\nentist, in Boston, Mass.<br />\nwould then have a 100 perand<br />\nwe<br />\npeople other than those listed on the<br />\nat the<br />\nAmerican<br />\nCollege.<br />\ncent<br />\nballot. Borah, Hughes and PresiTHEATRE<br />\nNEW<br />\nGARDEN<br />\nfor<br />\nthe royal order of<br />\nHurrah<br />\ndent Coolidge received the majority<br />\nBeavers<br />\nand<br />\nthe<br />\nrest of the Morons.<br />\nSUNDAY,<br />\nAPRIL<br />\n8,<br />\n192.8<br />\nthe<br />\nwhile<br />\namong<br />\nvotes,<br />\nof these<br />\nAT 3:3o P. M.<br />\nother also rans were Will Rogers,<br />\nProtestingly yours,<br />\nLindbergh, \"Big Bill\" Thompson<br />\nThe Public Is Cordially invited to Attend<br />\nA Member of the Class of 1923.<br />\nand Senator Heflin.<br />\n<br />\nVARSITY CLUB HAS<br />\nNATIONAL POLL<br />\nPREP SCHOOL SMOKER<br />\nSHOWS HOOVER<br />\nLEADING CANDIDATE<br />\n<br />\nCHRISTIAN<br />\nSCIENCE<br />\n<br />\nTo the Editor of the News-Letter:<br />\nDear Sir—A crack in a tradition,<br />\nas in a building, will soon cause the<br />\nwhole rigid structure to come tumbling down.<br />\nIt is thus with freshman-sophomore hostilities. Year after year<br />\nthe two classes fought each other<br />\nwith varying degrees of violence<br />\nsimply because it was expected of<br />\nthem to do so. The rivalry became<br />\na habit which afforded excellent occasional outlets for pure animal spirits and the instincts of savagery that<br />\nsurvive from jungle days. These<br />\noutbreaks, from time to time, are<br />\nlooked upon by the general public<br />\nwith tolerance because the intermittent blowing off of steam became<br />\ntraditional.<br />\nLast year the annual banquet season eruption reached the highest and<br />\nmost explosive climax of all, when<br />\nattacking sophomores at the Annapolis freshman affair got mixed up<br />\nwith the clubs of the town police<br />\nafter making a glorious mess of<br />\nthings in the armory.<br />\nThe affair got into the front pages<br />\nof the newspapers. There was a<br />\ngreat deal of unfavorable criticism,<br />\nand more of cynical comment on the<br />\nrowdyism of many undergraduates<br />\non the road to higher education.<br />\nReaction came—the law of the<br />\npendulum—and the Student Council this year passed restricting rules,<br />\nthe first fissure in the structure of<br />\ntradition. After a sudden but brief<br />\noutburst of fighting on the opening<br />\nday of the season and a few miscellaneous splutterings, the number of<br />\nthose attracted by the battle cries of<br />\nthe classes diminished considerably,<br />\nand it remained with a belligerent<br />\nfew to carry on with the banner of<br />\ncustom.<br />\nThis is a marked turning against<br />\nthis sort of horseplay, which is a<br />\nhealthy sign of the future. In a<br />\nfew years artificial class struggles<br />\nwill be relegated to the graveyard of<br />\nthe out-of-date and few will mourn<br />\nover the corpse.<br />\nThe same tendencies to a disappearance of eruptions is at work in<br />\nother lines of \"social\" activity. The<br />\nrecent powwow marked the beginning of the end of drunken brawls<br />\non the campus, where certain students were unable to drink like gentlemen and became disgustingly seasick or hopelessly boorish.<br />\nThe Student .Council is the organization which can most effectively get rid of unpleasant affairs<br />\nthat leave bad feeling behind them.<br />\nThe council has but to drive in the<br />\nentering wedge by a few minor rulings and time will hasten the end.<br />\nSLIGHTLY BILIOUS.<br />\n<br />\nFleet-McGinley,<br />\nIncorporated<br />\n<br />\nPrinters and Publishers<br />\n<br />\nCANDLER BUILDING<br />\nBALTIMORE, MD.<br />\n<br />\nin<br />\n'• shi<br />\nsp;<br />\ncal<br />\n<br />\nth(<br />\nov<br />\ncei<br />\nde<br />\n01<br />\nan<br />\n.; bu<br />\nh<br />\n.;<br />\niii<br />\n;: ha<br />\nG<br />\nro<br />\n<br />\nin<br />\n<br />\nri<br />\nle;<br />\ncc<br />\n1-1<br />\nfr<br />\nti(<br />\nit<br />\nin<br />\nth<br />\ntr<br />\nat<br />\ntF<br />\n<br />\nki<br />\ncl;<br />\nst<br />\n<br />\n\f;<br />\n<br />\n'7<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 3, 1928<br />\namusing selections were played.<br />\nA roar of applause brought Mr.<br />\nThe City of Happiness Is in the State of Mind<br />\n(Continued from page 1, Column 2)<br />\non the stage. He sang<br />\nback<br />\nDunne<br />\nSee FORDYCE CAMPBELL - AETNAIZER<br />\nin torn up flag stones, in ripped carries its own drop. The stage is \"How Ireland Got Its Name\" and<br />\n9th Floor Citizens Nat'l Bank Bldg. Plaza 1062<br />\njust<br />\none<br />\nthe<br />\nact,<br />\nbefourth<br />\nthe<br />\nblood<br />\nfor<br />\nin<br />\nand<br />\nreset<br />\ncoats,<br />\nand<br />\nshirts<br />\n\"On the Road to Mandalay\" to the<br />\nLIFE - ACCIDENT - HEALTH - AUTO - LIABILITY - FIRE<br />\nspattered steps. Result: one soph before the intermission. This has to delight of the entire assembly.<br />\nbe a rip-roaring one in order to<br />\ncaptured.<br />\nThe invading horde next besieged bring the people back after they've<br />\nthe NEWS-LETTER office where with gone out for the intermission.<br />\nThe show must now start all over<br />\noverpowering numbers they sucThe first act after the interagain.<br />\nGump<br />\nGeorge<br />\ncapturing<br />\nceeded in<br />\ndespite frantic efforts to save him. mission must be big. or, in other<br />\nOne soph of 155 pounds was bound words, the footer. He or she must<br />\nDrink<br />\nand carried as far as the M. E. \"make\" the show.<br />\nExheadliner.<br />\nthe<br />\ncomes<br />\nNext<br />\nweight<br />\nhis<br />\ntime<br />\nbuilding but at this<br />\nhad become too much for five frosh bandits, Peaches Brownings, and so<br />\n—(0,Freshmen, where is Thy Vir- forth, are the type. What it is<br />\nility?) At this point rescuing forces doesn't matter so long as the crowd<br />\nDelicious and Refreshing<br />\nhad come onto the scene and only is drawn. That is the headliner's<br />\nGump was carried off. End of one function. A person who was<br />\ngood in old times may fill this part.<br />\nround 3.<br />\nThe act next to the last is the<br />\nBut not yet were the action-cravone. Here you wipe out the<br />\nticklish<br />\nthe<br />\n• ing undergraduates satisfied. In<br />\n\"Ever precise in<br />\n, hollow in front of M. E., the war- bad taste left by the headliner.<br />\npromise keeping\"<br />\n• ring factions again clashed but with Artists like Belle Baker are needed<br />\nless decesive effects. Action was —ones who can smash over a big<br />\nThe point of Lucio's remark is<br />\nelongated hit anywhere.<br />\naround<br />\nnot what he said it about, but<br />\nconcentrated<br />\nThe final act is another dumb one<br />\nwhat he said. It surely describes<br />\nAhroon.<br />\nL.<br />\nand<br />\nsoph,<br />\nHarry Love,<br />\nCoca-Cola, for consider these<br />\nfreshman of elephantine propor- for the same reason as the first.<br />\nfacts:<br />\ntions. Efforts of each class to secure Most of the house clears out here,<br />\n\"die<br />\nsome<br />\nalways<br />\nare<br />\nthere<br />\nPure as Sunlight<br />\nits desired man were in vain. Ex- but<br />\nhausted by the protracted struggles, hards\" to be swept out. To do this<br />\nAnd the proof of its purity is in<br />\nthe testing. Twenty-two scientific<br />\nthe freshmen finally proposed a a closing moving picture is shown.<br />\ntests, covering every step in its<br />\ntruce. After having raised a feeble, Such a show is a travel picture, napreparation, safeguard this pure<br />\nand supposed defiant \"Hullabaloo,\" ture film, or the like. This type is<br />\ndrink of naturalflavors.<br />\nguaranteed to clean out the house.<br />\nthe yearlings dispersed.<br />\nMEASURE FOR MEASURE<br />\nFollowing this speech a demonThe Coca-Cola Company, Atlanta, Ga.<br />\nQuiet again reigned on the HopAct I. Scene 2<br />\n7-CN<br />\nkins campus. But what a glorious stration of the Columbia Talking<br />\n8 million a day — IT HAD TO BE GOO D TO GET WHERE IT IS<br />\nday for the tailors, cleaners, tie Machine was given by courtesy of<br />\nstores, and sellers of adhesive tape. the Columbia people. Two rather<br />\nFROSH-SOPH BATTLES<br />\n<br />\nDUNNE AT ASSEMBLY<br />\n<br />\n(Continued from page 1, column 3.)<br />\n<br />\nWhat Shakespear<br />\nsays about Coca-Co<br />\n<br />\nTHE GIANT<br />\nPOWER FUEL<br />\n<br />\nNEW LIFE<br />\nFOR MOTORS<br />\n<br />\nESSO<br />\n<br />\n\"STANDARD\" MOTOR OIL<br />\nThe Measure of Oil Value<br />\nSTANDARD OIL COMPANY OF N. J.<br />\n<br />\n-<br />\n<br />\nCLOTHES Ready-made<br />\nAnd Cut to Order<br />\nESTABLISHED ENGLISH UNIVERSITY<br />\nSTYLES, TAILORED OVER YOUTHFUL<br />\nCHARTS SOLELY FOR DISTINGUISHED<br />\nSERVICE IN THE UNITED STATES.<br />\n<br />\nThArterlousc<br />\n50<br />\nSuits 1140,$45,$<br />\n<br />\nTopcoats<br />\n<br />\nAVARt<br />\n'<br />\n,<br />\n<br />\nft*.etia,K<br />\n<br />\n11,Se<br />\n<br />\n•<br />\nammo<br />\n<br />\nBY SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br />\n<br />\nThtarter<br />\n<br />\n01.1%0<br />\n<br />\nOF BALTIMORE<br />\n<br />\nThe character of the suits and<br />\ntopcoats tailored by Charter House<br />\nwill earn your most sincere liking.<br />\n<br />\nllie<br />\n<br />\nHub<br />\n<br />\nBALTIMORE<br />\n<br />\nHere's some \"inside stuff\" on smoking<br />\nin the neighborhood of your center of gravity there's<br />\na spot devoted to smoke appreciation. We could describe it more<br />\nfully, but this is no organ recital. The point is: Light a Camel, pull<br />\n<br />\nSOMEWHERE<br />\n<br />\nin a fragrant cloud of cool joy—and listen to your smoke-spot sing<br />\nout—\"Haleelooya!\" As the noble redskin puts it—we have said!<br />\n(0<br />\n<br />\n=MN.<br />\n<br />\n1928<br />\n<br />\nem. N. C.<br />\nR. 3. REYNOLDS TOBACCO COMPANY. Winston-Sal<br />\n<br />\n\f8<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 3, 1928<br />\n<br />\nWILLIAM AND MARY<br />\nTO MEET JAYS<br />\nRidgely Edwards Announces<br />\nMen Who Will Go<br />\nW. AND<br />\n<br />\nM. IS<br />\n<br />\nSTRONG<br />\n<br />\nSouthern Team Is Especially<br />\nStrong in Field Events<br />\nPreparing themselves for an exceptionally hard meet, the Hopkins<br />\ntrack team will journey to Williamsburg to meet William and Mary's<br />\ncrack cinder path men.<br />\nAlthough Ridgely Edwards, Hopkins mentor, has not announced definitely those who will go, he has<br />\ndrawn up a tentative list. This list<br />\nis as follows: For the hundred and<br />\ntwo-twenty, Pindell ; the eighteighty, Wheeler and Yellot; the<br />\nmile, Gwinn and Schiebel ; the twomile, Schiebel and Kelly; the onetwenty high hurdles, Vivell ; the<br />\ntwo-twenty low hurdles, Vivell and<br />\nW. Scheidt; the high and broad<br />\njumps, Vivell ; the pole vault, W.<br />\nScheidt; the 100-shot-put and discuss throw, Berger and Fowler.<br />\nThe four-forty run and the javelin<br />\nthrow trials were held yesterday.<br />\nThe trials may be continued this<br />\nafternoon.<br />\n<br />\nFOUR MEN SELECTED<br />\nON TENNIS TEAM<br />\nFour out of the six men to<br />\nmake the Southern trip of the<br />\ntennis team during the spring<br />\nholidays were selected by Captain Proctor of this organization over the week-end after<br />\npractice matches were held at<br />\nthe Fifth Regiment Armory.<br />\nThe men selected were PoIan, Brockman, Leonard and<br />\nProctor. The remaining two<br />\nmen will be chosen from Devereux, Seidel, Gump and Finegold. This squad will leave<br />\non Wednesday morning, playing University of Virginia on<br />\nApril 5, Washington and Lee<br />\non April 6, and Virginia Polytechnic Institute on April 7.<br />\n<br />\nCavalier Stickmen<br />\nTo Open Season<br />\n<br />\nUniversity of Virginia stick-men<br />\nwill journey up to Baltimore to meet<br />\nthe Jays in the opening game of the<br />\nBlack and Blue team's schedule, and<br />\nto try to get revenge for the lickings the overpowering Hopkins aggregation has given them the past<br />\ntwo years.<br />\nThe Virginia team, composed of<br />\nnearly all the regulars of last year,<br />\nExtras to Be Taken<br />\nis out for blood. In '26 they went<br />\nSeveral men will be taken for each down before the Jays on a raw,<br />\nevent except the one mile, accord- windy day to the tune of 11-1. Last<br />\ning to Edwards. The others to run year they were defeated 13-1 on a<br />\nin the one hundred and two-twenty wet and sloppy field. This year, we<br />\nwill be chosen from Armstrong, hope to have a good, fast field on<br />\nNess, Willison, Bernstein, and which the visitors can show their<br />\nLockard. Those who run in the worth.<br />\nfour-forty will be selected from<br />\nThe Blue team goes into its season<br />\nHemmeter, Leverance, V. Scheidt, with a badly injured team. The goal<br />\nGraff, and Hershey. For the two tender, Ray Finn, is out because of<br />\nmile event it is probable that Em- injuries, and the second attack, Larerson may accompany the team. kin Farinholt, is out because of an<br />\nHershey or Long will probably ac- operation undergone recently. The<br />\ncompany the team in the capacity of attack, with the exception of Logan<br />\nhigh hurdlers. Trials will be held and Biddison, the two last year<br />\nthis week to determine this. In the homes, will be made up of an enlow hurdles the two men mentioned tirely different set of players.<br />\nabove will run. The men from Ge9rge Helfrich, attack man of two<br />\nwhich will be selected one for the years ago, Louis Nixdorf, a sub last<br />\nbroad and high jumps each are Gar- year, and Ben Egan, former City<br />\nrett, Ness, Neu, and Hershey. College player, will be the new men.<br />\nEither Scheidt, Long, or Almond Lang will be at the center position.<br />\nwill be the other person to repre- The defense will consist of Captain<br />\nsent Hopkins in the pole vault de- Liebensperger, Rob Roy, Bill Kepartment.<br />\ngall, Frank Dotterweich, and Len<br />\nCovell. Goal will be taken care of<br />\nBest in Distances<br />\nby either Bradley or Cone. There is<br />\nThe best chance for the Hopkins<br />\nplenty of reserve material, a good<br />\nteam to score, said Edwards, is in<br />\nbit of which is sure to see some acthe long distance runs. It is extion in this game.<br />\npected that the Jay team will place<br />\nCaptain Liebensperger's sole comseveral men among the winners, alment on the coming struggle was:<br />\nthough Campbell of the opposing<br />\n\\\"It's going to be a tight game.\"<br />\nteam, holds the records at William<br />\nand Mary in the mile run.<br />\nWilliam and Mary has the second Johns Hopkins Avukah<br />\nstrongest team in its state, UniverSociety Loses Debate<br />\nsity of Virginia taking the honors<br />\nin this respect. The southern team<br />\nOn Wednesday evening, March<br />\nis strongest in the field events. Its 28, the debating team of the Johns<br />\ncaptain, Davis, participates in the Hopkins Avukah Society met the<br />\nhigh and broad jump and according joint team representing the Avukah<br />\nto all reports, he is a hard man to Society of Georgetown and George<br />\nbeat. In the hurdles, William and Washington Universities at the MerMary is also well represented. cantile Club. Although the HopBagget, of the low hurdle depart- kins team, composed of Paul Corment, especially shines.<br />\ndish, Milton Blumenfeld, David<br />\nLovett, chairman, lost the decision<br />\nJumpers Unfortunate<br />\nby a vote of 2 to 1, Milton BlumenThe jumpers at Hopkins have feld, second speaker on the<br />\nHopkins<br />\nbeen unfortunate because of weather team, was declared in the decision<br />\nconditions, the pits being in poor to be the best speaker of the evencondition.<br />\ning. The judges were Mr. Leonard<br />\nAnother condition which will Weinberg, local attorney; Dr. Sampresent difficulty to the Black and uel Rosenblatt, son of the famous<br />\nBlue track team is the difference in cantor, and Mrs. Emil Crockin.<br />\nclimates. The team will journey The Washington team presented a<br />\nfrom a cold climate to an extremely striking contrast to the Hopkins<br />\nwarm one. The climate at the team in that among their three<br />\nsouthern institution has afforded the speakers there was one co-ed, one<br />\nteam of that college an excellent practicing attorney, and one underopportunity for development.<br />\n• graduate, whereas the Hopkins team<br />\nThe meet will take place Satur- was composed of three bona-fide<br />\nday of this week.<br />\ncollegiates.<br />\n<br />\nMusical Club Presents<br />\nOfficers with Gifts<br />\nPresentation of gifts of appreciation to the retiring officers of The<br />\nMusical Club was made last week<br />\nwhen Charles McElfresh and Osmar Steinwald received remembrances of their year with the organization. The presentation was<br />\nmade by Charles Harris and Bennett Kolb, president for next year.<br />\n<br />\n><br />\nUSED<br />\n<br />\nCHARLES B. HINES '27 Un. 0447<br />\nThe Backus Motor Co. Ver.4300<br />\n10 E. NORTH AVENUE<br />\n<br />\nDemand<br />\nThe Original<br />\nSPECIAL MOTOR FUEL<br />\n<br />\nMcElfresh, who got the club off<br />\nto such a fine start, but who was<br />\nlater forced to relinquish many of<br />\nhis duties as manager because of<br />\nserious illness, was given a handsome Gruen strap watch—an expression of the good will the club<br />\nbears him and of its sincere regret<br />\nthat he missed so many good times<br />\nwith them while he was sick.<br />\nSteinwald, who, in addition to his<br />\nduties as director of the Glee Club,<br />\nwas untiring in his efforts to make<br />\nthis the best year ever, was presented with a set of International<br />\nEncyclopoedias and a handsome sectional bookcase, bearing, as did both<br />\ngifts, a suitable inscription.<br />\nThe Musical Club will still have,<br />\nas a result of its exceptional season,<br />\na very solid balance with which to<br />\nstart the new year—something over<br />\n$400.00.<br />\n<br />\nFORDS<br />\n<br />\nNEW<br />\n<br />\nAMOCO-GASI<br />\nThe M•M•T<br />\nMOTOR COMPANY<br />\n<br />\nYour nearest new and used Chevrolet Dealer<br />\nPlenty of good Ford used cars as low as $45.00. Terms—<br />\nno cash—small weekly payments to property owners.<br />\n<br />\nGenuine Chevrolet Parts and excellent Service.<br />\n25th St. at Greenmount Ave.<br />\n<br />\nHomewood 3300-3301<br />\n<br />\nTelephone men<br />\nare continually<br />\nscouting along<br />\nthe frontier of<br />\nbetter methods.<br />\n<br />\nWho will scout<br />\nn<br />\nthis electrical frontier?<br />\nW<br />\n<br />\nHETHER in the Bell Telephone<br />\nLaboratories, in the Western<br />\nElectric workshop, in the various operating companies or in the American Telephone and Telegraph Company, telephone executives are scouts on the frontier of new and better methods.<br />\nIt is significant that your true telephone man never speaks of having<br />\n<br />\n\"perfected the art of communication.\"<br />\nAnd this in spite of the fact that America,<br />\nin fifty years, has telephones everywhere<br />\nand talks beyond its borders.<br />\nWork in the Bell System demands the<br />\nbold curiosity of pioneers and the infinite<br />\npains of pioneers who, like Columbus,<br />\nLincoln and Lindbergh, prepared \"and<br />\nwhen their chance came they were ready.\"<br />\n<br />\nBELL SYSTEM<br />\neAr nation-wide system of 18,5oo,000 inter-connecting telephones<br />\n<br />\n\"OUR . PIONEERING<br />\n<br />\nWORK<br />\n<br />\nHAS<br />\n<br />\nJUST<br />\n<br />\nBEGUN\"<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXXII, No. 46<br /><br />\nLower Classes Hold<br />\nBanquets Peacefully<br />\nFreshman and Sophomore Affairs<br />\nUndisturbed for First Time<br /><br />\nFor the first time in the history<br />\nof lower class banquets, the freshmen held their annual feast at the<br />\nHotel Kernan on Saturday night,<br />\nabsolutely undisturbed and with no<br />\nencircling cordon of protecting police. War was officially declared<br />\noff at 5.30, two hours before the beginning of the dinner. At this time<br />\nall sophomores held as prisoners<br />\nwere doomed to remain so and be<br />\ntaken to the opposing class feed,<br />\nwhile freshman officers were given<br />\nthe opportunity to return to their<br />\ncohorts and preside over the sumptuous repast.<br /><br />\nHOMEWOOD, BALTIMORE, MD., APRIL 3, 1928<br /><br />\nFARINHOLT AND FINN<br />\nLOST TO TWELVE<br />\nServices of Larkin Farinholt<br />\nand Raymond Finn, two regulars on last year's lacrosse<br />\nteam, may be lost to the twelve<br />\nthis season. Farinholt underwent an operation for appendicitis last Thursday and will<br />\nbe definitely out of the line-up<br />\nfor the rest of the season. Finn,<br />\nwho was struck in the eye by a<br />\nball last week, was also at the<br />\nhospital for several days. He<br />\nwill be unable to play for the<br />\nfirst part of the schedule, at<br />\nleast.<br />\nAlthough the team is well<br />\nsupplied with reserve material<br />\nin both midfield attack and<br />\ngoal positions, it is expected<br />\nthat these unforeseen losses<br />\nwill be keenly felt.<br /><br />\nMR. JERE DUNNE SPEAKS<br />\nAT WEEKLY ASSEMBLY<br /><br />\nPRICE 5 CENTS<br /><br />\nALLEN ELECTED TO<br />\nEDIT HULLABALOO<br /><br />\nFormer Actor Entertains Large<br />\nCrowd at Thursday<br />\nMeeting.<br /><br />\nSelection Takes Place During<br />\nJunior Banquet<br />\nELDRIDGE BUSINESS HEAD<br /><br />\nLast week's assembly was one of<br />\nthe best which has been held this<br />\nyear. Mr. Jere Dunne of the Keith<br />\ncircuit talked on the showmanship<br />\nneeded in placing vaudeville acts in<br />\ntheir proper sequence on the bill.<br /><br />\nLouis Llewelyn Furnishes<br />\nSeveral Selections<br /><br />\nHamilton Allen and John Eldridge, were chosen editor-in-chief<br />\nand business manager, respectively,<br />\nof the Hullabaloo, for the ensuing<br />\nyear. The elections took place at<br />\nthe banquet of the Junior Class at<br />\nthe New Howard Hotel on Thursday, March 29. Don White, and Len Dalsemer,<br />\npresent editor-in-chief and business<br />\nmanager, respectively, of the annual<br />\nHostilities began with the junior Three Professors to<br />\nwere guests of the juniors at their'<br />\nbanquet on Thursday night. From Have Leave of Absence<br />\nclass<br />\n-function. Both gave short exthat time until yesterday at 5.30,<br />\nProfessor Robert W. Wood is<br />\nBill Opens<br />\nplanatory<br />\ntalks on the nature of the<br />\nwith the one exception of the fresh- among those members of the facHonored election of men for these- very -imFriz<br />\nand<br />\nalso<br />\nCaplan<br />\nThe bill, itself, opens with a picman banquet interruption, the cam- ulty of the University who are leavat Election and Banquet at<br />\nportant offices of the year-book. •<br />\ning<br />\nin<br />\nthe<br />\nnear<br />\nfuture<br />\nfor<br />\nvarious<br />\nso that all late comers may be<br />\nture<br />\npus was the scene of wholesale kidSouthern<br />\nparts of Europe. Dr. Wood will seated without disturbing the actors.<br />\nIn the, absence of Dr; Carol Van<br />\nnapping, the members of the lower<br />\nsail on May 19th on the \"Ile de Pictures are not temperamental. But<br />\nBuren Wight, honorary president.<br />\nClasses subjects of long-time impris- France\" with Mr. Arthur Loomis,<br />\n-William B. Banks. and George of the • Junior Class, Mr.<br />\nsufdoesn't<br />\nthen<br />\nthe<br />\npicture<br />\neven<br />\nGeorge<br />\nonment, and the roads leading into with whom he will take a motor trip<br />\nGlazier were elected president and<br />\nseat<br />\nconic<br />\nup<br />\nto<br />\nso<br />\nthe<br />\nlights<br />\nfice,<br />\nDarley,<br />\nAssistant<br />\nAthletic<br />\nDirector<br />\nBaltimore the paths of toil for many through Holland and Germany.<br />\nbusiness manager of the Barnstormers, respectively, at their annual ban- of John's., Hopkins, presided as<br />\na lonely captive wending his way They will visit the Universities of these late comers.<br />\nNext comes the first act. This is quet and election which was held at toast-master. The latter, in opening<br />\nhome early in the morning. Friday Bahn, Berlin, and Gottinger on the<br />\nway. The party intends to visit<br />\nthe juniors and seniors were made<br />\nalways a \"dumb\" act—it usually the Southern Hotel last Friday the program for the evening,, on<br />\nCopenhagen.<br />\nconsists of some tricks or it is an night. Clyde Friz was chosen pro- completion of the dinner, expressed<br />\nmerry with the clumsy antics of the<br />\nDr. Robles of the Romance acrobatic presentation. It has a cer- duction manager and Howard Caphis own regret as that of the Junior<br />\nkidnapping parties of the lower Languages department is also pretain definite routine which doesn't lan secretary. Dow Strader, who class, that Dr. Wight was unable'to<br />\nclasses, unaccustomed as they were paring to sail shortly for Spain, depend on what's happening in the before coming to Hopkins was very<br />\nto fighting—a la Homewood. Never where he will study. Dr. Kurch- audience.<br />\nactive in dramatics at West Virginia, be.present at the affair.<br />\nBill Kegan, President of the Junabof<br />\nmeyer<br />\nwill<br />\ntake<br />\na<br />\nyear's<br />\nleave<br />\nwas elected to membership in the<br />\nbefore had the frosh been forced to<br />\nSecond Act Critical<br />\nBarnstormefs' Club. The election ior class, was introduced as the first<br />\nsence for the purpose of studying<br />\nraise a hand in self-defense, and<br />\nin Germany during 1928-29.<br />\nThe critical act follows—the sec- was held just before the banquet.<br />\nspeaker of the evening. The toastaccordingly they found it peculiar<br />\nond on the bill. Number two is<br />\n\"Pop\" Swindell Given Present<br />\nmaster then introduced Louis Llew-:<br />\nWhen they were made to fight, both<br />\nusually a mixed double. The girl<br />\nRidgely Warfield, retiring presi- elyn, member of the Junior class, by the sophs and the onlookers.<br />\nSeniors Unable to Pick must be extremely good looking; in dent of the Barnstormers was toastfact, she is hired for her appearance. master at the banquet. Of course, and baritone solosit of the Musical<br />\nLast night two hours before the<br />\nHonorary President The<br />\nman must be rather pleasing in the feature of the evening was Club, who sang several very delightsophs trooped into the Southern for<br />\nStrong partisan interest was looks and help out the girl; he also<br />\nful numbers. His selections were<br />\ntheir dinner the season for open evinced in the Senior class election furnishes any talent which the act \"Pop\" Swindell's talk. In appreciation of his able and untiring ser- enthusiastically received by the<br />\nmurder and fisticuffs came to an for honorary president held last may possess. Several introductions<br />\nvices as coach, the club presented members of the class.<br />\nend. But it was not always so. Wednesday. After many speeches are played to her song before she Mr. Swindell with a silver afterAfter several short talks by<br />\nLast year two days after the ban- extolling the relative merits of Drs. comes on and the spot is focused on dinner coffee set appropriately inBroadas Mitchel and W.P. Christie, one end of the stage. The whole<br />\nWhite<br />\nand Dalsemer in regard to<br />\nscribed, and a gold watch chain.<br />\nquets were over the 'West Coast and a vote was taken and a tie resulted.<br />\npurpose of number two is to key up Warfield, personally and on behalf the offices, as well as the candidates.<br />\nSouth America were just beginning<br />\nThe election was featured by the the audience and get them interested of the \"Barnstormers,\" thanked for the responsible positions of<br />\nto hear the news.<br />\n\"straight-ticket\" voting by members in the show. However, not too great George Berry as production man- editor-in-chief and business manof the engineering and arts and sci- a pace may be set, or the acts which ager and Douglas Prahl as business ager, ballots were distributed and a<br />\nence schools. The engineers voted follow will not be able to measure manager for the large parts they vote taken in each case. Allen and<br />\nsolidly for Dr. Christie and Dr. Mit- up.<br />\n\"acted\" in achieving the success of Eldridge received a majority of the<br />\npolled the entire vote of the<br />\nchel<br />\nNumber three isn't so important, the year's production. A letter votes cast for the editorial and<br />\nVarsity Debating Team candidates<br />\nfor the A. B. degree.<br />\na dancing or talking act utilizing two from Mrs. Swindell was read, business staff heads, respectively. Win Over Lafayette A selection will be held sometime parts of the stage. This act often which thanked the club for the Among the other guests present<br />\nthis week to break the deadlock.<br />\n(Continued on Page 7, Column 2)<br />\nflowers and good wishes sent her. was H. Ridgely Warfield, president<br />\nGetting off to a flying start, the<br />\nMrs. Swindell and Miss Margaret of the Senior class, who wished the\"<br />\nvarsity debating team gained a deHABERDASHERS SEE SALES INCREASE<br />\nSwindell were presented with Barn- Junior class success for the coming<br />\ncisive decision over the team repreAS SOPS AND FROSH WAGE BATTLE stormer pins (replicas of the usual year, and extended the compliments<br />\nsenting Lafayette College in the first<br />\nkey), for their services during the of the graduating class.<br />\nA quiet reigned on the campus aroused by the vision of real action<br />\ninter-collegiate debate of the season,<br />\nyear, especially getting the \"girls\"<br />\nWith the speaking program and<br />\nthat was broken only by the col- and memories of the famous Annheld in the Civil Engineering Hall lective scouting around of small apolis scrap, immediately jumped ready for the show. Keen appre- elections over, the toast-master inciation was evidenced for the great formed the members of the last,<br />\nlast Friday evening.<br />\nfreshman groups. For the first into the fray. A race through the<br />\nwhich Mrs. Swindell gives so but certainly not the least, part of<br />\naid<br />\nThe Hopkins team, composed of time this year was there any display Barn ensued in which the cause of unselfishly each year, and which is the evening's festivities—the arrival<br />\nof organized frosh spirit on the Col- the class of '30 seemed to be doomed.<br />\nunknown to most persons except of the scintillating but as it later<br />\nNorman B. Gardiner, W. R. Mclege grounds. Collegiates in clothes Reserve forces in the form of BarnDorman and Wilmer H. Driver, decidedly non-collegiate and nonde- ward strolling frosh and sophs aug- those in the production.<br />\nturned out, reticent entertainers.<br />\nrepresented the affirmative of the script prowled around. A little spirit mented the setto to the size of a Production Staff Will Work Hard Their interpretations of the latest,<br />\nquestion, \"Resolved, That the United of the annual banquet season hov- good, old-fashioned class battle. 0, Next year there will be twenty perhaps the oldest, too, of the light<br />\nwere I in a Homeric muse! With men in the Barnstormers compared fantastic creations, were received<br />\nStates should refuse military pro- ered about.<br />\nUnaccustomed to participation in what delight could be pictured the to the fourteen of this year. This with favor—but only \"protempore\"<br />\ntection to investments abroad.\"<br />\nuntoward acts,the freshmen searched rolling, struggling figures of antag- is the largest membership the or- for it was generally conceded by all<br />\nThe Lafayette team presented a about with a negative aggressive- onistic classmen, the frantic and un- ganization has ever possessed at the present that these artists suffered<br />\nstrong case and not until the latter ness. Small skirmishes ensued and organized runnings about. After start of a new season. A severe from sheer artistic temperament. Fifty-six members of the Class<br />\nstages of rebuttal did the Hopkins were immediately squelched. Final- ties had been torn from throats, hats loss will be felt in the male talent<br />\nly, three daring and impulsive fresh- taken by rival classmen, this prelim- due to the graduation of Warfield, of '29 were present. The excellent<br />\nteam gain an upper hand.<br />\nmen entered the second floor of the inary scrimmage ended. Favor the White and Boynton. As to \"girls\" dinner eaten in open peace and quiet<br />\nBarn,<br />\nA dance scheduled to be held after<br />\npounced with unaccustomed sophs. It was soon to be followed, the Thespians are pretty well fixed. formed a strange contrast to forforce<br />\nupon<br />\nan unsuspecting, bridge- however, by a battle of more No definite plans have been made mer years of bad food eaten in<br />\nthe debate was postponed because of<br />\nplaying<br />\nsoph<br />\nand attempted to make Homeric proportions on the steps of this early for next year. The pro- secret and midst a noisy class.<br />\nthe small crowd. Though the audiaway with him. Dead as the classes the Memorial Dormitory whither duction staff will face the hardest<br />\nThe committee in charge of the<br />\nence was few in number, the apof '30 and '31 are reputed to be; this blood-lusty freshmen had gone in season ever experienced as all the Junior banquet consisted of Paul<br />\nPlause and interest was manifest by action could not be allowed to go quest of sophs. This battle resulted<br />\nold \"flats\" will have to be scrapped Frisch, chairman; B. Hammond, H.<br />\nan unusual amount of handclapping. unchecked. A nearby sophomore,<br />\nand new ones built to replace them. Caplan, and R. Stevenson.<br />\n(Continued on Page 7, Column 1)<br />\nThe so-called \"big time\" show<br />\ncontains on an average of eight acts.<br />\nThese are gathered from all over the<br />\nadjacent territory. If the show is<br />\nto be in Baltimore the acts will be<br />\ntaken from Washington, Pittsburg,<br />\nWilliam B. Banks, who has been<br />\nPhiladelphia, and so forth. In the<br />\nmain office in the Puttman building, elected President of the Barnstormers.<br />\nNew York, a man is assigned to each<br />\nof the large Keith houses. The acts<br />\nare juggled around to fit best in this<br />\ncentral office.<br /><br />\nBANKS AND GLAZIER ARE<br />\nELECTED BY 'STORMERS<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 3, 1928<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\nCONCUCT AND RESPECT<br /><br />\nTHE LITTLE THEATRE<br />\nFRANKLIN<br /><br />\nN. HOWARD ST. NEAR<br />\nMotion Picture Guild Presents:<br /><br />\nThe conditions which are subject wane, to a slight extent, but the<br />\nto mediocre discussion are, in all basic elements have not been subEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nprobability, not general throughout jected to disintegration.<br />\nBaltimore, Md., under Act of Congress, November 3. 1879.<br />\nIn considering the matter of<br />\nthe lecture and class rooms of the<br />\nOF<br />\ncourtesy to the professor or inPublished semi-weekly from October to June by the students of Johns University, but many come into con- structor, who conducts the class for<br />\nHopkins University.<br />\ntact with such a state of affairs in the students' benefit, the idea of<br />\nvarious classes. The subject is an respect is brought up, to say nothing<br />\nFirst<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nold<br />\none, but yet after grammar of being polite to a man who is suHopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nBaltimore Presentation<br />\nschool and prep-school training perior and is making an effort to<br />\nother communications to the EDITOR-IN-CHIEF.<br />\nways<br />\nA spectacular production, impresnumerous individuals still persist in offer an explanation of the<br />\nshowing the life and ROsively<br />\nand<br />\nprocess<br />\nof the world, scientific<br />\nTelephone<br />\nMANCE of great Gotama BudUniversity 0100 maintaining, here and there, a state<br />\ncultural knowledge. As every one<br />\ndha.<br />\nof disorder and discourtesy.<br />\nknows, respect and courtesy are due<br />\nEDITORIAL DEPARTMENT<br />\nAll leading roles are enacted by<br />\nThe question of order, attention, to superiors and this idea has been<br />\nPrinces and Princesses of East<br />\nEditor-in-Chief<br />\nIndia; only natives are in film.<br />\nand quiet in recitation and lecture impressed on the individual since<br />\nGEORGE E. BANKS, JR., '29<br />\nhas many times been hashed over his childhood. In some cases the<br />\nOther Entertaining Short Films,<br />\nManaging Editor<br />\nAssistant Managing Editor<br />\nand probably will be many more professor is actually insulted and<br />\nincluding the Second Chapter of<br />\nPHILIP W. NESS, '29<br />\nGEORGE GUMP, '30<br />\nthe \"Heavenly Bodies\" Series.<br />\ntimes. In the days of \"Way back there may be resentment caused by<br />\nprofessor<br />\ncases<br />\nthe<br />\nother<br />\nColumnist<br />\ninsult.<br />\nIn<br />\nWhen\" the teachers and instrucLITTLE THEATRE ORCHESTRA<br />\nDONALD HISS, '29<br />\ntors from kindergarten to high is subject to disgust. Likewise the<br />\nAssociate Editors<br />\nschool have inflicted punishments conduct is tolerated in other cases,<br />\nWILMER H. DRIVER, '29<br />\nRICHARD H. WOOD, '29<br />\nfrom \"Please leave the room; I'll but in none is it approved or enBUSINESS DEPARTMENT<br />\nattend to you after class\" to the couraged. In every case a respect<br />\nuse of the raw-hide whip, of the is desired whether it is sincere or<br />\nBusiness Manager<br />\ngrammar<br />\nschool days, to even ex- pretended, depending on numerous<br />\nHARRY 0. SCHLOSS, JR., '29<br />\nE. E. ADAMS<br />\nfrom<br />\npulsion<br />\nhigh school on conditions of interest in the course.<br />\nAdvertising Manager<br />\nCirculation Manager<br />\nis<br />\nstudents<br />\nfellow<br />\nto<br />\nCourtesy<br />\ngrounds<br />\ngeneral<br />\nof<br />\nprinciples<br />\nand<br />\nGEORGE M. GLAZIER, '29<br />\nJ. ROBERT MYERS, '29<br />\nBARN CAFETERIA<br />\nmild incorrigibility. In most cases also an idea that is of no minor imconsidering<br />\nconduct<br />\nwhen<br />\nPrinted by Fleet-McGinley, Inc., 8th floor, Candler Building, Baltimore, Md. the results, order and quiet, were portance<br />\ndue to threatened corporal punish- in its entirety. In every classroom<br />\nment in the lower grades to sus- or lecture everyone has the right<br />\npension or even expulsion in prep- to demand that confusion and disschool. In that stage of life it is order do not distract his attention<br />\nassumed that the average individual or make it impossible for him to<br />\ndoes not have all the qualities that acquire full benefit from the class Phone, CAl. 1380<br />\nHome—HO. 20954<br />\nthe gaping, wide-eyed school boy he would keep him on the \"Straight or lecture. In a few cases the conPROGRESS<br />\nFRANCES T. BANNON<br />\nbecomes the reincarnation of Frank and Narrow\" of class room deport- fusion prevents anyone in the back Successor to HARBAUGH &amp; BANNON<br />\nOR POVERTY?<br />\nment, and hence the ideas of chagrin of the room from hearing every- 2 E. LEXINGTON ST., Cor. Charles<br />\nOLLOWING on the heels of the Merriwell, Fred Fearnot or some<br />\n(Room 28)<br />\nand frictional warmth were by ne- thing that goes on. If a student has<br />\nother<br />\nmythological<br />\nchampion.<br />\nHe<br />\nis<br />\nI'announcement that publicationStenographic Dictation, Copying,<br />\nshould<br />\nhe<br />\nwork<br />\nfor<br />\nthe<br />\nno<br />\ninterest<br />\nthe<br />\nof<br />\nover<br />\nthe<br />\nheads<br />\ncessity held<br />\nstaff members would be compensated the recipient of much back slapping<br />\nMultigraphing, Mimeographing<br />\nstudents. It is taken for granted at least not be detrimental toward<br />\nand<br />\nhandshaking.<br />\nThus<br />\nthe<br />\npleasant<br />\nBaltimore, Md.<br />\nby sharing in the fruits of their labor,<br />\nthat by the time the individual has the work of others. In case the<br />\nthere has come much mumbling and feeling of being the idol of the hour<br />\nacquired all the knowledge neces- student feels that he must attend<br />\ngrumbling from a small group on the is, for the athlete, sufficient compenCarl J. Doederlein<br />\nsary for college and has mani- quiz or lecture because of the roll<br />\nsation<br />\nfor<br />\na<br />\nseason<br />\nof<br />\nhard<br />\nwork.<br />\ncampus. These well-meaning individthat<br />\nothers<br />\nconsider<br />\nshould<br />\nhe<br />\nbook<br />\nabsorb<br />\nhigher<br />\nability<br />\nfested<br />\nto<br />\nhis<br />\nDIAMONDS<br />\nNow let us consider the position of<br />\nuals are still laboring under the archeducation he should have the quali- are not present for the same reathe<br />\nstudent<br />\nwho<br />\nembraces<br />\nthe<br />\nvocaMfrs.<br />\nof<br />\nFraternity<br />\nGoods of All Kinds<br />\naic notion that the editors and business<br />\nfications of order and deportment son that he is.<br />\ntion<br />\nof<br />\na<br />\ncollege<br />\njournalist.<br />\nA<br />\nman<br />\n504<br />\nPARK<br />\nBANK<br />\nBUILDING<br />\nmen on the various campus journals<br />\nThe discussion herein attempted<br />\nby virtue of his craving for knowl(Lexington at Liberty Sts.)<br />\nwould become stained with the blot on the Blue Jay may sit up for half<br />\nedge, training, and common sense. follows an old vein and no doubt<br />\nof \"Commercialism\" if they were to the night and, by means of much Apparently, a certain group has is a repetition of ideas that have<br />\nA. H. FETTING<br />\naccept a portion of the year's profits. brain racking and mental effort, suc- been short-suited in the endow- been more or less prevalent for a<br />\nMANUFACTURING<br />\nJEWELRY<br />\nceed<br />\nin<br />\nproducing<br />\nseverAl<br />\ncolumns<br />\nof<br />\nSeveral weeks ago, in these colment of the three above mentioned number of years. Also, the condiCO.<br />\ngood<br />\ncopy.<br />\nThe<br />\nmagazine<br />\nis<br />\npubumns, our predecessor showed very<br />\nqualities. The idea back of the tions which are criticised are of<br />\nManufacturers<br />\nclearly how, year after year, the lished, his jokes may cause consider- honor system is based partly on this little importance relative to the<br />\nGREEK<br />\nLETTER<br />\nFRATERNITY<br />\nable<br />\nmerriment<br />\nbut<br />\nthe<br />\nauthor,<br />\nout of<br />\nBlack and Blue Jay and the NEWSJEWELRY<br />\nidea of common sense and mostly whole mass of student affairs, but it<br />\nthe<br />\nspot<br />\nlight's<br />\nglare,<br />\nremains<br />\nob213 N. LIBERTY STREET<br />\nLETTER lose valuable and efficient<br />\non the moral aspects of honesty is true that there should be an immen who are forced, because of finan- scurely in the background.<br />\nand truth. Here is an idea of in- provement in this minority of stuA<br />\ncial difficulties, to seek part-time em- Take the case of a member of the tegrity in supporting the ideals of dents although ideal conditions can<br />\nployment in downtown business es- business staff who, by means of inYELLOW CAB STAND<br />\nthe student body in general. Ap- be only remotely approached.<br />\ntablishments. Many of these men numerable visits and much persuasion, parently the honor system is on the<br />\nW. H. O.<br />\nAT<br />\nmight have been retained if they had may cause a client to renew his adverHOMEWOOD FIELD<br />\nbeen allowed to share in the earnings tising contract. Although, he has<br />\nSECRETS<br />\nTRANSMISSION<br />\nBLACK<br />\nWELL<br />\nTELLS<br />\nOF<br />\nadded<br />\nmuch<br />\nto<br />\nthe<br />\npublication's<br />\ninat the end of the year.<br />\nNo Charge for Extra Passengers<br />\n(Continued From Page 3, Column 1)<br />\nTo the opponents of this plan, the come, he receives no compensation for<br />\n'PHONE<br />\nwhole scheme has assumed the shape his work. He remains among the record a telegraph dot sent from them is also impossible to counterof an immense bogy man which has silent heroes, \"unhonored and un- London to New York, a second dot act, while in the cable it is easily<br />\nVERNON 1212<br />\nno more basis in real fact than Mr. sung.\"<br />\nFOR A<br />\nwill appear over the first. This is gotten rid of.<br />\nThere is still another angle from due to the fact that the waves also<br />\nHearst's \"Mexican plot\" and perenbe<br />\nseem<br />\nto<br />\nCables, on the whole,<br />\nYELLOW CAB<br />\nnial \"yellow peril.\" Amateurism has which the problem may be viewed. went around the earth in the oppo- the better means of transmission at<br />\nbeen set upon a pedestal, surrounded Under the present system, there is site direction. In contrast to this present. By 1934 over three-quarters<br />\nby a halo of light and worshiped absolutely no incentive for the staffs the cable uses a very small space. of the communication of the long<br />\nwith all the fervor exhibited at the to practice economy. The publicaThe cable looses all but about ten distance telephone circuits will be by<br />\ntions' members realize that any prof- to the minus 333 power of the origi- cable. \"It is getting to the point<br />\nshrine of a martyred saint.<br />\nThe NORMAN-REMINGTON CO.<br />\nFrom the athletes we also hear loud its which they accumulate by means nal energy put into it. If the cable where you can talk to any part of<br />\nMAIN<br />\nSTORE,347 N. CHARLES ST.<br />\nshouts of protest. Why, they ask, of their industry will be handed over has inductance put into it, however, the country and your voice won't<br />\nBranch<br />\nBargain, 1217 N. Charles St<br />\nshould we practice for long hours and to the staff for the following year. to counteract the capacitance effect have to go out of doors.\"<br />\nsubject ourselves to rigid training This condition has given rise to the of the sea this percentage is raised<br />\nMr. Blackwell's lecture was illusrules without pay in order to repre- philosophy of \"gather ye rosebuds to about ten to the minus 131. To trated all the way through by slides.<br />\nPHONES: HOMEWOOD 7806<br />\nsent our University in sports while while ye may.\" In order to consume get an idea of about how much is After it a moving picture was shown<br />\nHOMEWOOD 7807<br />\nmembers of the publications' staffs are any surplus, the outgoing board of lost, if all the energy radiating from of how communication is done bePhone Us—We Deliver<br />\nallowed to share in the profits which' control will indulge in spending orgies the sun were fed in one end of a tween Los Angeles and Plymouth,<br />\nwhich rival even the Congressional thousand mile cable not enough England.<br />\nthey earn?<br />\nR. M.BIRELY,Phar.D.<br />\nTo compare the position of the junkets in extravagance.<br />\nwould be left at the other end to be<br />\nThis was the third of a series of<br />\n0. D. K. and the other campus audible.<br />\nathleie with that of the publication<br />\nlectures on Engineering Practice<br />\nPrescription Pharmacist<br />\nworker is quite ridiculous. On the groups -which oppose the compensaThe thing to do then is to amplify. given in the Mechanical Engineer<br />\nSODA - CANDY - CIGARS<br />\nfield, the athlete is in the public eye. tion scheme seem to look upon the This is done about every fifty miles. Building. Mr. Blackwell is TransThe cheering section shouts his name whole idea as if it were something<br />\nmission Development Engineer for<br />\nCor. St. Paul and 33rd Sts.<br />\nEffect of Temperature<br />\nto the high heavens. His pictures radically novel in college activities.<br />\nthe American Telephone and TeleBALTIMORE, MD.<br />\nThe change in temperature be- graph Company.<br />\nadorn the sporting pages of the local In many of the large colleges of the<br />\nnewspapers. Let him score the win- East, the plan has been operating for tween the hottest day in summer and<br />\nning touchdown in a hotly contested years. The newspaper and magazine the coldest day in winter causes an<br />\nEdwin H. Knopf and William P. Farnsworth<br />\nfootball game and his name is on staffs are paid certain stipulated sal- extremely high effect on the cable.<br />\nAnnounce for the week of April the Second<br />\nevery tongue. Let him shoot a much- aries and the whole organization is This is taken care of by using a pair<br />\nbusiness-like<br />\nin<br />\nan<br />\nact<br />\nas<br />\npilots.<br />\noperated<br />\nefficient,<br />\nwires<br />\nin<br />\nthe<br />\ncable<br />\nto<br />\nand<br />\nof<br />\ndesired goal in a lacrosse match<br />\nhe is borne off the field on the should- manner. With the present condition The change in resistance in these<br />\nby Walter Hackett<br />\ners of his admirers to the accompani- at Hopkins, the publication is under regulates the amplifiers, and the subment of much frantic pennant wav- obligation to the individual rather scriber doesn't notice any difference.<br />\nA rollicking, rousing and romantic story of<br />\nthan the individual to the publication. Radio may not be controlled in<br />\ning and hysterical huzzaing.<br />\nthe Spanish Main<br />\nSuch a state of affairs stands as a this way. The sun's radiation, esThe athlete is playing for the love<br />\nNever before in Baltimore<br />\nof his Alma Mater. That may be bulwark against any attempt to intro- pecially, effects it. On some days,<br />\nAsk<br />\nabout<br />\nour special subscription plan<br />\nperfectly true, but at the same time duce improved methods. It is impos- even with all the improved devices,<br />\nhe is enjoying the unmistakable sensa- sible to bring about progress when all oceanic transmission becomes imAUDITORIUM THEATRE<br />\npossible by radio. Distortion in<br />\ntion of being the popular hero. To incentive is lacking.<br />\nSubscription<br /><br />\n$2.00<br /><br />\nLIGHT<br />\nASIA<br /><br />\nEDITORIAL COMMENT<br /><br />\nF<br /><br />\nBOOKS<br /><br />\n•••••••<br /><br />\n\"CAPTAIN APPLEJACK\"<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 3, 1928<br /><br />\n•••••••••••<br /><br />\n15-3-<br /><br />\nON<br /><br />\nEly<br /><br />\n3<br /><br />\ners<br /><br />\n0.<br /><br />\n;<br /><br />\n•••••••••<br /><br />\nk<br /><br />\nBLACKWELL LECTURES ON ULTRA-VIOLET RAYS<br />\nTYPES OF TRANSMISSION EXPLAINED IN LECTURE<br />\nExplains Intricacies of Radia, Dr. Wood Mystifies Group by<br />\nVarious Gastly Effects on<br />\nOpen Wire, and Cable<br />\nPaper<br />\nCommunication<br />\n\"It is the popular conception that<br />\nthe energy transmitted in the open<br />\nwire telephone goes through the<br />\nWires,\" said Mr. 0. B. Blackwell in<br />\nhis lecture last Wednesday on \"The<br />\nThree Types of Transmission Used<br />\nin Communication — Radio, Open<br />\nWire and Cable.\" However, according to Mr. Blackwell, this is<br />\nnot the case, but rather that the<br />\nelectrons of the air for a space of<br />\nabout a yard surrounding the wires<br />\nare the means whereby the energy<br />\nis propagated. The purpose of the<br />\nwires is the guidance of this electricity and the prevention of its dissipation.<br />\nThe Cable<br /><br />\n\"No secret writing here\" read the<br />\nperfectly blank and white piece of<br />\npaper that Dr. R. W. Wood, during<br />\nthe course of a lecture last Thursday, placed in the practically invisible rays emanating from an ultraviolet ray projection lantern.<br />\nDr. Wood, whose brilliant experiments on light have achieved worldwide renown, and who addressed the<br />\nStudent Assembly some time ago on<br />\nhigh frequency sound waves,showed<br />\nseveral startling properties of this<br />\nbut dimly discernible beam to prove<br />\nsome points in connection with his<br />\nsubject \"Phosphorescence and Fluorescence.\"<br />\nAll Objects Fluoresce<br /><br />\nThe cable is a more extreme case<br />\nAccording to this authority, very<br />\nof wire transmission, for in the<br />\nspace of less than three inches there nearly all substances fluoresce to a<br />\nare over three hundred circuits each certain extent. Fluorescence, in<br />\nof whose energy follows a path lit- short, is the term applied to that<br />\ntle more than a fifth of an inch in property of bodies in general to give<br />\ndiameter, about the size of a lead out light of their own under the<br />\npencil. Here is the difference becolored light<br />\ntween the immense area used in stimulus of a different<br />\nthis is<br />\nthem.<br />\nThat<br />\nshining<br />\nupon<br />\nradio transmission and the small<br />\nfor<br />\nnot<br />\nordinarily<br />\napparent<br />\ntrue,<br />\nis<br />\nthe<br />\nin<br />\nused<br />\nlead pencil size of field<br />\nthe reason that, in ordinary light this<br />\ncable.<br />\nRadio, on the other hand, permits newly created light from the suba huge amount of stations to be stances is so weak as to avoid deplaced in a small frequency space.<br />\ntection with the eye because of the<br />\nThis large number is made possible<br />\nenormous<br />\namount of other light.<br />\nby the use of carrier waves of high<br />\nfrequency which the voice controls.<br />\nMany Ghastly Effects<br />\nEach station is alloted its own band<br />\nBut in ultra violet light, which is<br />\nand the voice acts on only that one<br />\nalmost invisible, substances may<br />\ncarrier.<br />\nEconomy on open wire systems glow so as to be very clearly seen,<br />\nhas resulted in the use of four tele- due to the fact that other light is<br />\nphone circuits and several telegrams eliminated (the experiment taking<br />\nper pair of wires. By using con- place in a darkened room.) Many<br />\nductors to guide the energy, its space ghastly effects were brought out.<br />\nis determined, whereas, by using The hand glows with a peculiar<br />\ncarrier waves several messages are tinge. The teeth stand out with an<br />\ntransmitted over the same wires. unearthly sheen. Diamonds, or any<br />\nStill, however, it is impossible to ap- other of the so-called precious stones<br />\nproach the number of messages glow most beautifully—and all apwhich may go over the radio at the parently in the dark due to the invisibility of the ray.<br />\nsame time.<br />\nIt Was during this part of the exTelephones Create Problem<br />\nperiment that Dr. Wood held a plain<br />\nWhen telephones began to become white piece of paper before the<br />\nnumerous a very objectionable con- assemblage and told how, during the<br />\ngestion arose with the use of open course of the World War, he had<br />\nwires. The cables have done away astonished several British officials by<br />\nwith this. In a diameter less than taking a piece 'of paper which was<br />\nthree inches, 1,200 subscribers' mes- supposedly, so treated with chemicals<br />\nsages may be carried with only a that it was impossible to place any<br />\nmillionth fraction of any mix. Even secret writing on it with invisible<br />\nwith these cables, though, conges- ifik, and after having stamped an<br />\ntion is beginning to rise in the con- invisible message on it placed it in<br />\nduits.<br />\nthe rays of the violet ray machine.<br />\nCables have proven so successful Then the words \"no secret writing<br />\nthat they are over almost all of the here\" might easily be read.<br />\ncountry; about 2,000 miles are being<br />\nColors Not Colors<br />\nlaid yearly. Such a system is imWhy does a picture appear colmune from storm and most atmosored? This beautiful panorama in<br />\npheric noises.<br />\nIn transoceanic radio we are variegated tints shows a young girl<br />\nusing about all the space on the holding fruit. Why do the colors apearth. If a seismograph is used to pear as colors? Dr. Wood said that<br />\n(Continued on Page 2, Column 3)<br /><br />\n(Continued on Page 4, Column 1)<br /><br />\nauJo gei More<br />\nMileage fro<br /><br />\nBETHOLIN-E<br />\n\"THE WONDER MOTOri FUEL:'<br /><br />\nSTETSON HATS<br /><br />\nLured by<br />\nAroma of<br />\nNeighbor's<br />\nTobacco<br /><br />\n°rkunt5Xen<br />\ni<br />\neVed<br /><br />\nBoston, Mass.,<br />\nApril 21, 1927<br />\nLarus &amp; Bro. Co.,<br />\nRichmond, Va.<br />\nGentlemen:<br />\nThis morning I had a smoking adventure worth recording.<br />\nNext to me in the smoking car a<br />\ngentleman was puffing his pipe contentedly. I was not smoking at the<br />\nmoment,and the aroma of his tobacco<br />\nintrigued me exceedingly. For twelve<br />\nyears I had smoked Edgeworth without being tempted by any other brand,<br />\nbut the fragrance emanating from the<br />\npipe of the gentleman beside me was<br />\nso agreeable that I could not resist<br />\nthe temptation to speak of it.<br />\n\"That is wonderfully fragrant tobacco you have there,\" I remarked.<br />\n\"Would you mind telling me the name<br />\nof it?\"<br />\n\"It is Edgeworth,\" he answered.<br />\nWe then congratulated each other<br />\nupon our mutual good taste, and I<br />\ndecided that I would continue to use<br />\nhis brand and mine.<br />\nSincerely yours,<br />\nS. H.<br /><br />\nSoft hats for travel comfort<br />\n—hats of Stetson quality to<br />\nwithstand travel wear—and<br />\nStetson style to travel as<br />\nbecomes a gentleman.<br />\nEight to<br />\nForty Dollars<br /><br />\nEdgeworth<br />\nExtra High Grade<br /><br />\nSmoking Tobacco<br /><br />\nSKILL<br />\nHE twist of the wrist, the<br />\n\"throw\" ofthe arm,the shifting<br />\nofthe weight—these are among the<br />\nmany little points which make the<br />\nskill that you admire in the javelin<br />\nthrower as he hurls the shaft two<br />\nhundred feet or more.<br />\nAs on the track or the football<br />\n• field,in the gymnasium or on<br />\nthe water,so in industry progress is the result of fine<br />\nimprovements—a thousandth<br /><br />\nT<br /><br />\nof an inch here—a minute variation<br />\nin a curve there—slight changes<br />\nforeseen by engineers and carried<br />\nout by skilled workmen.<br />\nIt is this attention to detail that<br />\nis constantly improving General<br />\nElectric apparatus and contributing<br />\nto the electrical industry, which,<br />\nthough still young,is already<br />\na dominant force, increasing<br />\nprofitand promoting success<br />\nin every walk of life.<br /><br />\nWhether you find this monogram on an electric refrigerator<br />\nfor the home or on a'206,600-horsepower turbine-generator<br />\nfor a power station, you can be sure that it staas for<br />\nskilled engineering and high manufacturing quality.<br />\n;<br />\n1<br /><br />\n9<br /><br />\n9DH<br /><br />\nGENERAL EliCTRIC<br />\nGENERAL<br /><br />\nELECTRIC<br /><br />\nCOMPANY,<br /><br />\nSCHENEOTADY,<br /><br />\nNEW<br /><br />\nYORK<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 3, 1928<br /><br />\n4<br />\nVIOLET RAY LECTURE<br />\n(Continued from Page 3, Column 2)<br /><br />\nthe answer to this was that they do<br />\nnot, that is at least not always. To<br />\nprove this contention he illuminated<br />\nthe picture with a sodium light,<br />\nwhich is a pure yellow light. All the<br />\ncolors with the exception of yellow<br />\ndisappeared, and only- a flat picture<br />\ncontaining yellow and various shades<br />\nof black was seen.<br />\nWhy such a result should occur is<br />\nrather simply explained by this<br />\nfact: it is only by virtue of the reflecting of light that falls on it does<br />\nan object show color. The color of<br />\nthe light that is not absorbed, but<br />\nreflected determines the color that<br />\nwe see. Hence a rose appeared red<br />\nin white light, which is a mixture<br />\nof all colors because it absorbs all<br />\nlight but red and this it reflects<br />\nwhich makes it appear red to us.<br /><br />\nS<br /><br />\n0<br /><br />\nYou do get Better Kodak Pictures<br />\nfro m<br /><br />\nConvenient and Economical<br />\nTRANSPORTATION<br /><br />\nTHE<br /><br />\nSTREET<br /><br />\nDecorations<br /><br />\nCARS<br />\nInterior Wood Work<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\n3044 GREENMOUNT AVENUE<br />\nUniversity<br /><br />\n3829<br /><br />\nBALTIMORE, MD.<br />\nShow Rooms<br />\n343 N. Charles Street<br /><br />\nFactory<br />\n600 S. Pulaski Street<br /><br />\nPicture Framing<br /><br />\nPhotographic Supplies<br /><br />\nI<br /><br />\n.,)<br />\nC. T. PEARCE,<br />\nDesign of Generators.<br />\nUniversity of New<br />\nMexico,'23<br /><br />\nWI<br /><br />\ntho_<br /><br />\nTL<br />\n,11 _1<br />\n:<br />\n11;<br /><br />\nirCILILA Ita<br /><br />\nu nun Raul./..<br /><br />\nW. A. McGILL,<br />\nTraction Apparatus<br />\nSales.<br />\nCarnegie Tech, '22<br /><br />\nWhere have you<br />\nbeen all your life?<br />\n•• •.Europe?<br />\nFor $193.50 you can sail and<br />\nreturn in the modernized<br />\nCARMANIA and CARONIA<br />\nto Plymouth, Havre, and<br />\nLondon,or in the ci-devant<br />\nthree-class ships SCYTHIA<br />\nand LACONIA to Liverpool<br />\n... gateway to picturesque<br />\nEngland ... Cathedrals,the<br />\nLakes, the Dukeries, Oxford,Cambridge,London...<br />\nRecognizing the justifiable<br />\npopularity of tourist travel<br />\namong those willing to economize on the ocean to have<br />\nmore money to invest in<br />\nmemories of Europe... we<br />\nhave taken two new 20,000<br />\ntonners the SCYTHIA and<br />\nLACONIA from first class<br />\nservice and made them<br />\nCabin and Tourist Third to<br />\nLiverpool ... staterooms<br />\nsold up to a few weeks ago<br />\nat second cabin rates now<br />\navailable at Tourist Third<br />\n... one of the world's best<br />\nsteamship bargains.<br />\nDancing to the syncopation<br />\nof a college orchestrano feet<br />\nhave yet resisted...longwide (leeks on which you<br />\ncan do your 'mile'... or<br />\nwork up your back-hand at<br />\ndeck tennis...or start that<br />\ncasual conversation which<br />\nbecomes a tete-a-tete the<br />\nthird day out...<br />\nAnd, of course, that wellconsidered food ...that<br />\ncheerful attendance— you<br />\nare traveling Cunard.<br /><br />\nCUNARD<br />\nLINE<br /><br />\n.44<br />\n,<br />\n44P.\"4444:<br />\n,<br /><br />\n••<br /><br />\n•<br /><br />\n•<br /><br />\n?:77:77grag!!!<br /><br />\n-<br /><br />\nYOUNGER COLLEGE MEN<br />\nH. C. COLMAN,<br />\nHeadquarters Sales,<br />\nOhio State. '23<br /><br />\nON RECENT WESTINGHOUSE JOBS<br /><br />\n1928<br /><br />\nEIGHTY • EIGHT • YEARS • OF • SERVICE<br /><br />\nW. R. OVERHOLT,<br />\nContract<br />\nAdministration,<br />\nOhio Northern, '08<br /><br />\nThe San Francisco Ferries<br />\nWhere do young college men get in a large<br />\nindustrial organization? Have they<br />\nopportunity to exercise creative talent?<br />\nIs individual work recognized?<br /><br />\nnow has the<br />\nfinest ferry fleet in all the<br />\nworld. Recently there were added<br />\nto it four Golden Gate Dieselelectric auto ferries; one Southern<br />\nPacific Diesel-electric auto ferry;<br />\none Northwestern<br />\nPacific Dieselelectric auto ferry;<br />\nand the Key SysAN<br /><br />\n0<br /><br />\nFRANCISCO<br /><br />\ntern's two electric-drive giants—<br />\nthe largest passenger ferries ever<br />\nbuilt. These modern steel boats<br />\n— all Westinghouse-equipped —<br />\ngive to the Bay cities a ferry<br />\nservice unsurpassed for speed and<br />\nsafety, cleanliness and comfort.<br />\nThe big jobs go to big organizations. Westinghouse attracts<br />\nyoung men of enterprise and<br />\ngenius because it daily provides<br />\nopportunities for pioneering and<br /><br />\noutstanding work which smaller<br />\ncompanies can seldom offer.<br />\n.<br />\n7<br /><br />\n7.7<br />\n,<br /><br />\nThe Key System ferries are each<br />\nequipped with two 2,2so-shp. Westinghouse main propulsion motors;<br />\none i,9oo-kilowatt Westinghouse<br />\ngenerator; and one 3,oio-hp. Westinghouse-Parsons turbine.The Southern Pacific, Northwestern Pacific,<br />\nand Golden Gate boats likewise have<br />\nWestinghouse propelling motors and<br />\ngenerators. Auxiliary units, such as<br />\nmotor-drive pumps<br />\nand steering apparatus, are Westinghouse on all these<br /><br />\nWestinghouse<br /><br />\n319 NO. CHARLES ST.,<br />\nBaltimore., Md.<br /><br />\n1840<br /><br />\nL. C. FLETCHER,<br />\nTurbine Test,<br />\nClemson,'17<br /><br />\nMERLE ROBISON,<br />\nSwitchboard Engineer,<br />\nCarnegie Tech,'20<br /><br />\nferries.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 3, 1928<br /><br />\nAnd still another leading tobacconist in<br />\nBaltimore, Md.,says:<br />\n\"OLD GOLD is easily the fastest-growing cigarette in this locality, andIshouldn't be surprised<br />\nbefore long to find it the most popular cigarette<br />\non the campus. The boys sure do like its<br />\nsmoothness.\"<br /><br />\nEphram Bacon, Regtsct Pharmacist<br />\n31st and St. Paul Sts.<br /><br />\nFor a most refreshing change:<br /><br />\n\"Follow your friends and smoke<br />\nthis smoother and better cigarette<br /><br />\n5<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 3, 1928<br /><br />\nHALL HEARINGS<br />\nSpring has come not without its<br />\nvarious effects. Everywhere in the<br />\nvicinity of the Hall one can see<br />\nverdant signs. Baseball is the most<br />\nsignificant. Every day there are several of the boys on the quadrangle<br />\ncatching. In fact the spirit of the<br />\ngame has gotten them so badly that<br />\nthey tried it on Sunday. Sergeant<br />\nFrank put a quick stop to this with<br />\nthreats of backing up the \"wagon.\"<br /><br />\nThe batteries for the Hall baseball<br />\naggregation have been \"warming up\"<br />\nall winter on their curves. The organized practice was held every Friday after lunch. When baseballs<br />\nwere impractical they used the apples served at lunch on Friday.<br />\nThese served a double purpose in<br />\nthat they provided good practice<br />\nand that they could be used to bear<br />\nout grudges.<br /><br />\nIt has been observed that more<br />\nand more \"automobiles\" have come<br />\ninto use lately. Within the last few<br />\ndays an old Ford appeared from<br />\nnowhere running around the campus<br />\nwith 1925 license plates. It runs<br />\nperfectly downhill. It was also<br />\nnoticed that one night an old Chevrolet with half a rear mudguard and<br />\nno top went out and returned with<br />\na rather ill-fitting top and engine<br />\nhood.<br /><br />\nB Entry has lost its claim to being the noisiest entry in the Hall.<br />\nWhen it began to quiet down C began to become more active, with the<br />\nresult that it now holds the crown.<br />\nIt seems that the occupants work in<br />\nshifts, the first of which begins at<br />\n11 P. M. and these continue until<br />\nabout 2 A. M. The main duties of<br />\nthe men on the shifts are to shout<br />\nas loudly as possible in the halls, run<br />\nnoisily up and down the stairs and<br />\noccasionally stage a pillow or water<br />\nfight.<br /><br />\nPsychology I has played havoc<br />\nwith the greater part of the residents for the past week. Hypnotism has become the chief pastime<br />\nof the boys. Sessions are held in a<br />\nnumber of the rooms from seven<br />\nuntil midnight. These provide for<br />\na great deal of enjoyment at no cost.<br />\nFor information apply to Professor<br />\nRosenthal or his assistants.<br /><br />\nWith the end of the month drawing near, money has, as usual, become exceedingly scarce. Most of<br />\nthe residents are at their wits' ends<br />\nas to how to pay for their \"dates\"<br />\nto the Lyric.<br /><br />\nMany of the residents have been<br />\nhaving an extremely hard time getting telephone calls through to Goucher residence halls. We suggest<br />\nthat the Goucher authorities see that<br />\nmore phones are installed, especially<br />\nin Glitner.<br /><br />\nAt noon time, Tuesday, the residents were entertained by a \"strolling troubadour\" who sang in the<br />\n\"quad.\" We wonder if he got a free<br />\nmeal.<br /><br />\nAs to the plan of naming the<br />\nentries, we wish to say that \"B\"<br />\nentry will never be anything else but<br />\n\"B.\" There's a tradition in that letter.<br /><br />\nSMALL PIECE OF PAPER FROM WEST<br />\nSENDS JAY STAFF INTO HIGH GLEE<br />\nBlack and Blue Jay adherents<br />\nwere given a thrill yesterday. The<br />\nbusiness department was set to<br />\ntalking, the editorial board to grinning, and the whole staff to congratulating the postal service. No,<br />\na carload of good copy was not<br />\ndumped at the door, nor did the<br />\nprinter decide to set up and print<br />\nthe last two issues gratis, nor did<br />\nthe NEWS-LETTER promise to refrain from certain harsh criticisms.<br />\nWhat, then, could cause all of the<br />\nexcitement? Had the president decided to name the C. E. Hall after<br />\nthe present editors? Had the Gilman Memorial Room been turned<br />\nover to the staff as offices, or had<br />\nthe deal officially sanctioned the Jay<br />\nas a needed New Plan publication?<br />\nNo, none of these. What then?<br />\nThe cause of the disturbance was a<br />\nminor matter, a little slip of paper<br />\na few inches wide and hardly more<br />\nin length.<br /><br />\nAlong one edge were little perforations. At the top of this slip<br />\nof paper was printed a few words<br />\nin English. At the bottom was a<br />\nfew more in the same language.<br />\nThe space in between was filled out<br />\nwith typewriting. At the extreme<br />\nbottom on the right-hand side there<br />\nwas an ink mark, hardly more than<br />\na scratch, yet, oh so necessary!<br />\nThe printing at the top was of the<br />\nname of some trust company in<br />\nCleveland. The name at the bottom<br />\nwas Newton D. Baker, former Secretary of War in the Cabinet of<br />\nWoodrow Wilson. The check—for<br />\nthis slip of paper was a check—was<br />\nin payment for a year's subscription<br />\nto the Blue Jay.<br />\nThe Jay members say that the<br />\nSecretary has always been noted for<br />\nhis discernment and sagacity. The<br />\nstaff of the sister publication are<br />\ntrying to reconcile this statement<br />\nwith the check.<br /><br />\nTHE MAIL BAG<br />\nEXIT TRADITIONS<br />\nAll letters intended for publication must be concise, written<br />\nin ink, on one side of the paper<br />\nonly.<br />\nNo attention will be paid to<br />\nanonymous letters, but names<br />\nsigned as an evidence of good<br />\nfaith will not be printed if request is made that they be omitted.<br />\nThe publication of a letter is<br />\nnot to be taken as an endorsement of its views by \"The NewsLetter\" which invites the freest<br />\ndiscussion of all matters of general interest.<br /><br />\nMORE ABOUT THE \"Y\"<br />\nTo the Editor of the NEWS LETTER:<br />\nDear Sir:<br /><br />\nI rise in protest!!!!<br />\nI do not think that anyone who<br />\nknows me will question my loyalty<br />\nto my Alma Mater, nor will they<br />\ndoubt that I am more than willing<br />\nto work untiringly for those things<br />\nthat go to or belong to Johns Hopkins. I am a firm believer in Student<br />\nActivities, including the Hopkins Y.<br />\nM. C. A., which is so unfortunately<br />\nAll Schools Send Representa- connected with the Baltimore and<br />\nNational organizations.<br />\ntives To Saturday Night<br />\nGathering<br />\nLeads<br />\nSecretary of Commerce<br />\nThe fact that a Student Activities<br />\nBuilding is badly needed on the<br />\nNew York Governor By<br />\nLARGE CROWD ATTENDS campus is unquestionable and I<br />\nWide Margin in Colleges<br />\nwould try to be the first one to make<br />\nWhole Upper Barn Decorated a contribution, as small as it would<br />\nIn Black and Blue<br />\nHerbert Hoover and Governor<br />\nhave to be, to a STUDENTS'<br />\nAlfred E. Smith polled more than<br />\nBUILDING, or any building owned<br />\nOn last Saturday night, for the<br />\nthree-quarters of the total number<br />\nsecond<br />\ntime in its history, the Var- by the student body or the trustees<br />\nof votes in the country-wide university Club held its annual prep school of Johns Hopkins. The control of<br />\nsity ballot, conducted by the Inde- smoker. Members of the club, asthis building although of vital impendent, a Boston weekly, and in sisted by various co-eds, began on<br />\nportance, is a secondary matter.<br />\nwhich the NEWS-LETTER took part. Saturday afternoon to decorate the<br />\nBut to be asked to contribute to<br />\nThe Secretary of Commerce polled second floor reading room of The<br />\nthe proposed Levering Hall with the<br />\n22,086 votes, while the New York Barn, obscuring the dingy walls and<br />\nfollowing conditions is in my mind<br />\ngraying<br />\nsteamers<br />\nof<br />\nrafters<br />\nwith<br />\nTammany Hall candidate was only<br />\nblack and blue. The various posts ridiculous and bordering on an ina fair second, with 13,534 votes.<br />\nwere covered with large placards on sult:<br />\nNationally, Reed was runner-up which were inscribed the members<br />\nFirst, at the end of a certain<br />\nto the Democratic leader, with 2208 of the Varsity Club, the Student<br />\nperiod<br />\nof years in case of a dispute<br />\nvotes. At Hopkins, however, Gov- Council, the Student Activities<br />\nCouncil, and various other commit- or in case the University does not<br />\nernor Ritchie occupied this place,<br />\ntees and organizations.<br />\nwant the Y. M. C. A., it cannot acpolling 90 votes to 12 for Reed.<br />\nBefore the hour of eight, the prep quire the building without paying the<br />\nDawes and Lowden trailed Hoover school men began to arrive. They<br />\nHopkins, Baltimore, or National Y.<br />\nin that order nationally, while at were welcomed by Dave Kaufman,<br />\nM. C. A. (it does not matter which)<br />\nHomewood the order was reversed. president, and other members of the<br />\na<br />\nsum which I or any other alumnus<br />\nVarsity Club.<br />\nForty-Five Colleges Take Part<br />\nwould<br />\ngladly help to raise now for<br />\nBlue Jays Entertain<br />\nSeventy publications were reThe meeting opened with Carl Johns Hopkins, but unwillingly for<br />\nquested to take part in the poll. Of Lausch and his Blue Jays giving a the Y. M. C. A. In other words, the<br />\nthis group forty-five accepted, but few selections. Following this,<br />\nownership of the Y. M. C. A. Buildthirty-nine only have sent final re- speeches were made by David Kaufing,<br />\nor Levering Hall, will be vested<br />\nsults, the others delaying because of man, president of the Varsity Club;<br />\nspring vacation and examination Gardiner Mallonee ; George Darley, in the Baltimore Y, which is an offperiods.<br />\ncoach of the basketball team; Her- spring of the National Y, that illusOne of the interesting things man Schiebel, Norman Robinson, trous organization that made such a<br />\nbrought out by the poll is that the \"Father Bill\" Schmeisser and Dr. glorious(?) name for itself during<br />\nSouth is not a \"solid South\" behind Ray. Van Orman, director of ath- the late war. We are being asked<br />\nSmith. Not only did the Republi- letics.<br />\nto contribute to the tune of about<br />\nVan Orman Speaks<br />\ncans run the Democrats a close race<br />\n$160,000<br />\nto a building to be erected<br />\nVan Orman stressed the point<br />\nin the Southern colleges, but in some<br />\nthat,<br />\nof<br />\nwhereas he was a director<br />\non the campus of Hopkins that will<br />\nof them, notably Louisiana, Missouri, West Virginia and Kentucky, athletics, yet he knew the principal not belong to Hopkins, nor even the<br />\nHoover was victorious over the New purpose of Hopkins to be study. Board of Management of the HopYorker. In the University of Ohio, He said that professors at Hopkins kins Y. M. C. A.<br />\nin a State generally considered a were behind the effort to establish<br />\nSecondly, the building is to be run<br />\nlarge factor in any election, the Re- a cage at Homewood, and that just<br />\nby the Y. M. C. A., a<br />\nexclusively<br />\napthat<br />\nmorning<br />\nhe<br />\nhad<br />\nbeen<br />\npublicans, with Hoover leading the<br />\nbeing set aside for stusmall<br />\ncorner<br />\nexpressed<br />\nthis<br />\nproached<br />\nby<br />\none<br />\nwho<br />\nadvance, were swept into office by<br />\ndent activities. The program is to be<br />\nidea.<br />\nlarge majorities.<br />\nframed by the Y. M. C. A. and the<br />\nWillis Polls Few Votes<br />\nchances<br />\nare that they will resort to<br />\nFirst, Second and Third Churches<br />\nmethods of requiring a<br />\nusual<br />\ntheir<br />\nIt is doubtful whether the absence<br />\nof Christ, Scientist<br />\nY. M. C. A. membership as admisof Willis from the election lists<br />\nBaltimore, Maryland<br />\nsion to the facilities, as was my exwould have had any effect, the SenaAnnounce a Free Lecture on<br />\nperience in the Baltimore Y not so<br />\ntor from Ohio polling only a total<br />\nmany years back although I had<br />\ncounthroughout<br />\nthe<br />\nof 443 votes<br />\nbeen a member for several years.<br />\ntry; even in his own State being<br />\nThey will most probably exclude the<br />\nforced to bow to Hoover and Smith,<br />\nJews as was done at the Baltimore Y<br />\none with 604 votes and the other<br />\nBy PAUL STARK SEELEY, C.S.B.<br />\nto one of our most popular athletes.<br />\nwith 146 counts, while his supof Portland, Oregon, member of the<br />\nThe Klu Klux Klan should be<br />\nporters numbered 145.<br />\nBoard of Lectureship of the Mother<br />\nasked<br />\nto come on the campus next<br />\nChurch, the First Church of Christ, SciOver 12,000 votes were cast for<br />\nentist, in Boston, Mass.<br />\nwould then have a 100 perand<br />\nwe<br />\npeople other than those listed on the<br />\nat the<br />\nAmerican<br />\nCollege.<br />\ncent<br />\nballot. Borah, Hughes and PresiTHEATRE<br />\nNEW<br />\nGARDEN<br />\nfor<br />\nthe royal order of<br />\nHurrah<br />\ndent Coolidge received the majority<br />\nBeavers<br />\nand<br />\nthe<br />\nrest of the Morons.<br />\nSUNDAY,<br />\nAPRIL<br />\n8,<br />\n192.8<br />\nthe<br />\nwhile<br />\namong<br />\nvotes,<br />\nof these<br />\nAT 3:3o P. M.<br />\nother also rans were Will Rogers,<br />\nProtestingly yours,<br />\nLindbergh, \"Big Bill\" Thompson<br />\nThe Public Is Cordially invited to Attend<br />\nA Member of the Class of 1923.<br />\nand Senator Heflin.<br /><br />\nVARSITY CLUB HAS<br />\nNATIONAL POLL<br />\nPREP SCHOOL SMOKER<br />\nSHOWS HOOVER<br />\nLEADING CANDIDATE<br /><br />\nCHRISTIAN<br />\nSCIENCE<br /><br />\nTo the Editor of the News-Letter:<br />\nDear Sir—A crack in a tradition,<br />\nas in a building, will soon cause the<br />\nwhole rigid structure to come tumbling down.<br />\nIt is thus with freshman-sophomore hostilities. Year after year<br />\nthe two classes fought each other<br />\nwith varying degrees of violence<br />\nsimply because it was expected of<br />\nthem to do so. The rivalry became<br />\na habit which afforded excellent occasional outlets for pure animal spirits and the instincts of savagery that<br />\nsurvive from jungle days. These<br />\noutbreaks, from time to time, are<br />\nlooked upon by the general public<br />\nwith tolerance because the intermittent blowing off of steam became<br />\ntraditional.<br />\nLast year the annual banquet season eruption reached the highest and<br />\nmost explosive climax of all, when<br />\nattacking sophomores at the Annapolis freshman affair got mixed up<br />\nwith the clubs of the town police<br />\nafter making a glorious mess of<br />\nthings in the armory.<br />\nThe affair got into the front pages<br />\nof the newspapers. There was a<br />\ngreat deal of unfavorable criticism,<br />\nand more of cynical comment on the<br />\nrowdyism of many undergraduates<br />\non the road to higher education.<br />\nReaction came—the law of the<br />\npendulum—and the Student Council this year passed restricting rules,<br />\nthe first fissure in the structure of<br />\ntradition. After a sudden but brief<br />\noutburst of fighting on the opening<br />\nday of the season and a few miscellaneous splutterings, the number of<br />\nthose attracted by the battle cries of<br />\nthe classes diminished considerably,<br />\nand it remained with a belligerent<br />\nfew to carry on with the banner of<br />\ncustom.<br />\nThis is a marked turning against<br />\nthis sort of horseplay, which is a<br />\nhealthy sign of the future. In a<br />\nfew years artificial class struggles<br />\nwill be relegated to the graveyard of<br />\nthe out-of-date and few will mourn<br />\nover the corpse.<br />\nThe same tendencies to a disappearance of eruptions is at work in<br />\nother lines of \"social\" activity. The<br />\nrecent powwow marked the beginning of the end of drunken brawls<br />\non the campus, where certain students were unable to drink like gentlemen and became disgustingly seasick or hopelessly boorish.<br />\nThe Student .Council is the organization which can most effectively get rid of unpleasant affairs<br />\nthat leave bad feeling behind them.<br />\nThe council has but to drive in the<br />\nentering wedge by a few minor rulings and time will hasten the end.<br />\nSLIGHTLY BILIOUS.<br /><br />\nFleet-McGinley,<br />\nIncorporated<br /><br />\nPrinters and Publishers<br /><br />\nCANDLER BUILDING<br />\nBALTIMORE, MD.<br /><br />\nin<br />\n'• shi<br />\nsp;<br />\ncal<br /><br />\nth(<br />\nov<br />\ncei<br />\nde<br />\n01<br />\nan<br />\n.; bu<br />\nh<br />\n.;<br />\niii<br />\n;: ha<br />\nG<br />\nro<br /><br />\nin<br /><br />\nri<br />\nle;<br />\ncc<br />\n1-1<br />\nfr<br />\nti(<br />\nit<br />\nin<br />\nth<br />\ntr<br />\nat<br />\ntF<br /><br />\nki<br />\ncl;<br />\nst<br /><br />\n;<br /><br />\n'7<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 3, 1928<br />\namusing selections were played.<br />\nA roar of applause brought Mr.<br />\nThe City of Happiness Is in the State of Mind<br />\n(Continued from page 1, Column 2)<br />\non the stage. He sang<br />\nback<br />\nDunne<br />\nSee FORDYCE CAMPBELL - AETNAIZER<br />\nin torn up flag stones, in ripped carries its own drop. The stage is \"How Ireland Got Its Name\" and<br />\n9th Floor Citizens Nat'l Bank Bldg. Plaza 1062<br />\njust<br />\none<br />\nthe<br />\nact,<br />\nbefourth<br />\nthe<br />\nblood<br />\nfor<br />\nin<br />\nand<br />\nreset<br />\ncoats,<br />\nand<br />\nshirts<br />\n\"On the Road to Mandalay\" to the<br />\nLIFE - ACCIDENT - HEALTH - AUTO - LIABILITY - FIRE<br />\nspattered steps. Result: one soph before the intermission. This has to delight of the entire assembly.<br />\nbe a rip-roaring one in order to<br />\ncaptured.<br />\nThe invading horde next besieged bring the people back after they've<br />\nthe NEWS-LETTER office where with gone out for the intermission.<br />\nThe show must now start all over<br />\noverpowering numbers they sucThe first act after the interagain.<br />\nGump<br />\nGeorge<br />\ncapturing<br />\nceeded in<br />\ndespite frantic efforts to save him. mission must be big. or, in other<br />\nOne soph of 155 pounds was bound words, the footer. He or she must<br />\nDrink<br />\nand carried as far as the M. E. \"make\" the show.<br />\nExheadliner.<br />\nthe<br />\ncomes<br />\nNext<br />\nweight<br />\nhis<br />\ntime<br />\nbuilding but at this<br />\nhad become too much for five frosh bandits, Peaches Brownings, and so<br />\n—(0,Freshmen, where is Thy Vir- forth, are the type. What it is<br />\nility?) At this point rescuing forces doesn't matter so long as the crowd<br />\nDelicious and Refreshing<br />\nhad come onto the scene and only is drawn. That is the headliner's<br />\nGump was carried off. End of one function. A person who was<br />\ngood in old times may fill this part.<br />\nround 3.<br />\nThe act next to the last is the<br />\nBut not yet were the action-cravone. Here you wipe out the<br />\nticklish<br />\nthe<br />\n• ing undergraduates satisfied. In<br />\n\"Ever precise in<br />\n, hollow in front of M. E., the war- bad taste left by the headliner.<br />\npromise keeping\"<br />\n• ring factions again clashed but with Artists like Belle Baker are needed<br />\nless decesive effects. Action was —ones who can smash over a big<br />\nThe point of Lucio's remark is<br />\nelongated hit anywhere.<br />\naround<br />\nnot what he said it about, but<br />\nconcentrated<br />\nThe final act is another dumb one<br />\nwhat he said. It surely describes<br />\nAhroon.<br />\nL.<br />\nand<br />\nsoph,<br />\nHarry Love,<br />\nCoca-Cola, for consider these<br />\nfreshman of elephantine propor- for the same reason as the first.<br />\nfacts:<br />\ntions. Efforts of each class to secure Most of the house clears out here,<br />\n\"die<br />\nsome<br />\nalways<br />\nare<br />\nthere<br />\nPure as Sunlight<br />\nits desired man were in vain. Ex- but<br />\nhausted by the protracted struggles, hards\" to be swept out. To do this<br />\nAnd the proof of its purity is in<br />\nthe testing. Twenty-two scientific<br />\nthe freshmen finally proposed a a closing moving picture is shown.<br />\ntests, covering every step in its<br />\ntruce. After having raised a feeble, Such a show is a travel picture, napreparation, safeguard this pure<br />\nand supposed defiant \"Hullabaloo,\" ture film, or the like. This type is<br />\ndrink of naturalflavors.<br />\nguaranteed to clean out the house.<br />\nthe yearlings dispersed.<br />\nMEASURE FOR MEASURE<br />\nFollowing this speech a demonThe Coca-Cola Company, Atlanta, Ga.<br />\nQuiet again reigned on the HopAct I. Scene 2<br />\n7-CN<br />\nkins campus. But what a glorious stration of the Columbia Talking<br />\n8 million a day — IT HAD TO BE GOO D TO GET WHERE IT IS<br />\nday for the tailors, cleaners, tie Machine was given by courtesy of<br />\nstores, and sellers of adhesive tape. the Columbia people. Two rather<br />\nFROSH-SOPH BATTLES<br /><br />\nDUNNE AT ASSEMBLY<br /><br />\n(Continued from page 1, column 3.)<br /><br />\nWhat Shakespear<br />\nsays about Coca-Co<br /><br />\nTHE GIANT<br />\nPOWER FUEL<br /><br />\nNEW LIFE<br />\nFOR MOTORS<br /><br />\nESSO<br /><br />\n\"STANDARD\" MOTOR OIL<br />\nThe Measure of Oil Value<br />\nSTANDARD OIL COMPANY OF N. J.<br /><br />\n-<br /><br />\nCLOTHES Ready-made<br />\nAnd Cut to Order<br />\nESTABLISHED ENGLISH UNIVERSITY<br />\nSTYLES, TAILORED OVER YOUTHFUL<br />\nCHARTS SOLELY FOR DISTINGUISHED<br />\nSERVICE IN THE UNITED STATES.<br /><br />\nThArterlousc<br />\n50<br />\nSuits 1140,$45,$<br /><br />\nTopcoats<br /><br />\nAVARt<br />\n'<br />\n,<br /><br />\nft*.etia,K<br /><br />\n11,Se<br /><br />\n•<br />\nammo<br /><br />\nBY SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br /><br />\nThtarter<br /><br />\n01.1%0<br /><br />\nOF BALTIMORE<br /><br />\nThe character of the suits and<br />\ntopcoats tailored by Charter House<br />\nwill earn your most sincere liking.<br /><br />\nllie<br /><br />\nHub<br /><br />\nBALTIMORE<br /><br />\nHere's some \"inside stuff\" on smoking<br />\nin the neighborhood of your center of gravity there's<br />\na spot devoted to smoke appreciation. We could describe it more<br />\nfully, but this is no organ recital. The point is: Light a Camel, pull<br /><br />\nSOMEWHERE<br /><br />\nin a fragrant cloud of cool joy—and listen to your smoke-spot sing<br />\nout—\"Haleelooya!\" As the noble redskin puts it—we have said!<br />\n(0<br /><br />\n=MN.<br /><br />\n1928<br /><br />\nem. N. C.<br />\nR. 3. REYNOLDS TOBACCO COMPANY. Winston-Sal<br /><br />\n8<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 3, 1928<br /><br />\nWILLIAM AND MARY<br />\nTO MEET JAYS<br />\nRidgely Edwards Announces<br />\nMen Who Will Go<br />\nW. AND<br /><br />\nM. IS<br /><br />\nSTRONG<br /><br />\nSouthern Team Is Especially<br />\nStrong in Field Events<br />\nPreparing themselves for an exceptionally hard meet, the Hopkins<br />\ntrack team will journey to Williamsburg to meet William and Mary's<br />\ncrack cinder path men.<br />\nAlthough Ridgely Edwards, Hopkins mentor, has not announced definitely those who will go, he has<br />\ndrawn up a tentative list. This list<br />\nis as follows: For the hundred and<br />\ntwo-twenty, Pindell ; the eighteighty, Wheeler and Yellot; the<br />\nmile, Gwinn and Schiebel ; the twomile, Schiebel and Kelly; the onetwenty high hurdles, Vivell ; the<br />\ntwo-twenty low hurdles, Vivell and<br />\nW. Scheidt; the high and broad<br />\njumps, Vivell ; the pole vault, W.<br />\nScheidt; the 100-shot-put and discuss throw, Berger and Fowler.<br />\nThe four-forty run and the javelin<br />\nthrow trials were held yesterday.<br />\nThe trials may be continued this<br />\nafternoon.<br /><br />\nFOUR MEN SELECTED<br />\nON TENNIS TEAM<br />\nFour out of the six men to<br />\nmake the Southern trip of the<br />\ntennis team during the spring<br />\nholidays were selected by Captain Proctor of this organization over the week-end after<br />\npractice matches were held at<br />\nthe Fifth Regiment Armory.<br />\nThe men selected were PoIan, Brockman, Leonard and<br />\nProctor. The remaining two<br />\nmen will be chosen from Devereux, Seidel, Gump and Finegold. This squad will leave<br />\non Wednesday morning, playing University of Virginia on<br />\nApril 5, Washington and Lee<br />\non April 6, and Virginia Polytechnic Institute on April 7.<br /><br />\nCavalier Stickmen<br />\nTo Open Season<br /><br />\nUniversity of Virginia stick-men<br />\nwill journey up to Baltimore to meet<br />\nthe Jays in the opening game of the<br />\nBlack and Blue team's schedule, and<br />\nto try to get revenge for the lickings the overpowering Hopkins aggregation has given them the past<br />\ntwo years.<br />\nThe Virginia team, composed of<br />\nnearly all the regulars of last year,<br />\nExtras to Be Taken<br />\nis out for blood. In '26 they went<br />\nSeveral men will be taken for each down before the Jays on a raw,<br />\nevent except the one mile, accord- windy day to the tune of 11-1. Last<br />\ning to Edwards. The others to run year they were defeated 13-1 on a<br />\nin the one hundred and two-twenty wet and sloppy field. This year, we<br />\nwill be chosen from Armstrong, hope to have a good, fast field on<br />\nNess, Willison, Bernstein, and which the visitors can show their<br />\nLockard. Those who run in the worth.<br />\nfour-forty will be selected from<br />\nThe Blue team goes into its season<br />\nHemmeter, Leverance, V. Scheidt, with a badly injured team. The goal<br />\nGraff, and Hershey. For the two tender, Ray Finn, is out because of<br />\nmile event it is probable that Em- injuries, and the second attack, Larerson may accompany the team. kin Farinholt, is out because of an<br />\nHershey or Long will probably ac- operation undergone recently. The<br />\ncompany the team in the capacity of attack, with the exception of Logan<br />\nhigh hurdlers. Trials will be held and Biddison, the two last year<br />\nthis week to determine this. In the homes, will be made up of an enlow hurdles the two men mentioned tirely different set of players.<br />\nabove will run. The men from Ge9rge Helfrich, attack man of two<br />\nwhich will be selected one for the years ago, Louis Nixdorf, a sub last<br />\nbroad and high jumps each are Gar- year, and Ben Egan, former City<br />\nrett, Ness, Neu, and Hershey. College player, will be the new men.<br />\nEither Scheidt, Long, or Almond Lang will be at the center position.<br />\nwill be the other person to repre- The defense will consist of Captain<br />\nsent Hopkins in the pole vault de- Liebensperger, Rob Roy, Bill Kepartment.<br />\ngall, Frank Dotterweich, and Len<br />\nCovell. Goal will be taken care of<br />\nBest in Distances<br />\nby either Bradley or Cone. There is<br />\nThe best chance for the Hopkins<br />\nplenty of reserve material, a good<br />\nteam to score, said Edwards, is in<br />\nbit of which is sure to see some acthe long distance runs. It is extion in this game.<br />\npected that the Jay team will place<br />\nCaptain Liebensperger's sole comseveral men among the winners, alment on the coming struggle was:<br />\nthough Campbell of the opposing<br />\n\\\"It's going to be a tight game.\"<br />\nteam, holds the records at William<br />\nand Mary in the mile run.<br />\nWilliam and Mary has the second Johns Hopkins Avukah<br />\nstrongest team in its state, UniverSociety Loses Debate<br />\nsity of Virginia taking the honors<br />\nin this respect. The southern team<br />\nOn Wednesday evening, March<br />\nis strongest in the field events. Its 28, the debating team of the Johns<br />\ncaptain, Davis, participates in the Hopkins Avukah Society met the<br />\nhigh and broad jump and according joint team representing the Avukah<br />\nto all reports, he is a hard man to Society of Georgetown and George<br />\nbeat. In the hurdles, William and Washington Universities at the MerMary is also well represented. cantile Club. Although the HopBagget, of the low hurdle depart- kins team, composed of Paul Corment, especially shines.<br />\ndish, Milton Blumenfeld, David<br />\nLovett, chairman, lost the decision<br />\nJumpers Unfortunate<br />\nby a vote of 2 to 1, Milton BlumenThe jumpers at Hopkins have feld, second speaker on the<br />\nHopkins<br />\nbeen unfortunate because of weather team, was declared in the decision<br />\nconditions, the pits being in poor to be the best speaker of the evencondition.<br />\ning. The judges were Mr. Leonard<br />\nAnother condition which will Weinberg, local attorney; Dr. Sampresent difficulty to the Black and uel Rosenblatt, son of the famous<br />\nBlue track team is the difference in cantor, and Mrs. Emil Crockin.<br />\nclimates. The team will journey The Washington team presented a<br />\nfrom a cold climate to an extremely striking contrast to the Hopkins<br />\nwarm one. The climate at the team in that among their three<br />\nsouthern institution has afforded the speakers there was one co-ed, one<br />\nteam of that college an excellent practicing attorney, and one underopportunity for development.<br />\n• graduate, whereas the Hopkins team<br />\nThe meet will take place Satur- was composed of three bona-fide<br />\nday of this week.<br />\ncollegiates.<br /><br />\nMusical Club Presents<br />\nOfficers with Gifts<br />\nPresentation of gifts of appreciation to the retiring officers of The<br />\nMusical Club was made last week<br />\nwhen Charles McElfresh and Osmar Steinwald received remembrances of their year with the organization. The presentation was<br />\nmade by Charles Harris and Bennett Kolb, president for next year.<br /><br />\n&gt;<br />\nUSED<br /><br />\nCHARLES B. HINES '27 Un. 0447<br />\nThe Backus Motor Co. Ver.4300<br />\n10 E. NORTH AVENUE<br /><br />\nDemand<br />\nThe Original<br />\nSPECIAL MOTOR FUEL<br /><br />\nMcElfresh, who got the club off<br />\nto such a fine start, but who was<br />\nlater forced to relinquish many of<br />\nhis duties as manager because of<br />\nserious illness, was given a handsome Gruen strap watch—an expression of the good will the club<br />\nbears him and of its sincere regret<br />\nthat he missed so many good times<br />\nwith them while he was sick.<br />\nSteinwald, who, in addition to his<br />\nduties as director of the Glee Club,<br />\nwas untiring in his efforts to make<br />\nthis the best year ever, was presented with a set of International<br />\nEncyclopoedias and a handsome sectional bookcase, bearing, as did both<br />\ngifts, a suitable inscription.<br />\nThe Musical Club will still have,<br />\nas a result of its exceptional season,<br />\na very solid balance with which to<br />\nstart the new year—something over<br />\n$400.00.<br /><br />\nFORDS<br /><br />\nNEW<br /><br />\nAMOCO-GASI<br />\nThe M•M•T<br />\nMOTOR COMPANY<br /><br />\nYour nearest new and used Chevrolet Dealer<br />\nPlenty of good Ford used cars as low as $45.00. Terms—<br />\nno cash—small weekly payments to property owners.<br /><br />\nGenuine Chevrolet Parts and excellent Service.<br />\n25th St. at Greenmount Ave.<br /><br />\nHomewood 3300-3301<br /><br />\nTelephone men<br />\nare continually<br />\nscouting along<br />\nthe frontier of<br />\nbetter methods.<br /><br />\nWho will scout<br />\nn<br />\nthis electrical frontier?<br />\nW<br /><br />\nHETHER in the Bell Telephone<br />\nLaboratories, in the Western<br />\nElectric workshop, in the various operating companies or in the American Telephone and Telegraph Company, telephone executives are scouts on the frontier of new and better methods.<br />\nIt is significant that your true telephone man never speaks of having<br /><br />\n\"perfected the art of communication.\"<br />\nAnd this in spite of the fact that America,<br />\nin fifty years, has telephones everywhere<br />\nand talks beyond its borders.<br />\nWork in the Bell System demands the<br />\nbold curiosity of pioneers and the infinite<br />\npains of pioneers who, like Columbus,<br />\nLincoln and Lindbergh, prepared \"and<br />\nwhen their chance came they were ready.\"<br /><br />\nBELL SYSTEM<br />\neAr nation-wide system of 18,5oo,000 inter-connecting telephones<br /><br />\n\"OUR . PIONEERING<br /><br />\nWORK<br /><br />\nHAS<br /><br />\nJUST<br /><br />\nBEGUN\"<br /><br />"}], "field_media_file": [{"target_id": 38253, "display": null, "description": null, "target_type": "file", "target_uuid": "93860f53-a331-465b-82cd-9391acdaeb3a", "url": "http://digital.library.jhu.edu/system/files/2022-03/13316-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13316, "target_type": "node", "target_uuid": "31c32d1a-63db-4522-85e0-ed7f966d069c", "url": "/node/13316"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "c6862087-bfa1-4574-8c12-ba89a792310d"}]}