{"mid": [{"value": 51441}], "uuid": [{"value": "bd655d4e-195e-4785-a989-c56eb0c78532"}], "vid": [{"value": 51441}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-20T03:39:03+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "16210-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-20T03:39:03+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-20T03:39:03+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "+<br />\n<br />\n¥<br />\n<br />\n8509 9//¢0<br />\n<br />\ni<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n    <br />\n<br />\n     <br />\n<br />\n   <br />\n<br />\n(724) 779-2111<br />\n<br />\n     <br />\n<br />\n <br />\n<br />\n   <br />\n  <br />\n<br />\n <br />\n<br />\n         <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\nAYVHEIT HIMOHN3SI3 3 j<br />\nHISTORICAL POINT> : - ememe-—au’s troops camped here 1781 on their way to Yorktown. 1018-605 ““The Labadie Tract.”” 3,750 acres occupied 1684 by a Religious Sect who 1125-604 o<br />\n“Harford Town”” or “Bush.” The first Declaration of Independence was 1016-626 led a communist form of life. : EXTENSION SERVICE, UNIVERSITY OF MARYLAND 3 %<br />\nsigned here; March 22, 1775. ; . Warwick. Washington stopped here on his way from Fort Cumberland to 1146-580 PLEASANT VALLEY RECREATION AREA, 1904 acres, central Garrett 169-637 ] % 2 <<br />\nWESTERN MARYLAND Ro(i:aimbefa%s }(rtoops camped here in 1782 on their way back from the 1035-612 B_?ﬁStIOI’\\. mf 3756, a?qd on sevtehral_othert occ?snﬁns. County, 10 miles south of Grantsville on State 495. Elevations 2,000- B 5%<br />\nvictory of Yorktown. irthplace of James Rumsey, the inventor of the steamboat. 1146-580 2,900 feet. Public facilities for picnicking include a covered pavilion, ol % %<br />\n”MtcCullgc’P:'s Pasth.’t’ Th: ﬁr;.é tqa;iil;:hrough the Glades. George Washington 110-577 Abe':geent:’roving Grounds. Military reservation of 55,000 acres of land 1047-595 Georgetown, burned by the British on May 6, 1814, 1116-561 tables _%ll_r'l‘d open fireplaces. A.30-36224‘%?;:“30\\/\"38“?:\"61;%fpr;ligggsSWiT’; éc‘g ¢<br />\nstopped here, September 26, i and water. Galena. Washington stopped here in 1774. 1117-551 ming. lhere are group camping ac e 3 £3c<br />\n““Charles Friend’s Home.” George Washington stopped here on Septem- 114-560 Spesutia Island (Utie’s Hope), 2300 acres surveyed 1658. The only Manor 1061-592 Shrewsbury Church and Tomb of Brigadier General John Cadwalader 1104-546 FUNEING B S g5 SRS 0 410 SR I AW & G- zE&<br />\n3 b ; ; : \" t facilities for swimming and hiking. (For group camping reservations, oE 8<br />\ng?vre'?s, 1784, looking for the best route from the Potomac to the Ohio :2 ’1\"636:'(;0“’ County. Treaty with the Susquehannock Indians made here Chesterto\\xv/n. (a) Washington College, founded 1782. (b) Worsell’s Tavern 1065-502 (ax(,ir(‘jreil.(s“Il:)zten.gionwslerviceg,l Universitg o(f Magry!agd, Cgllege Park, Md.) wo§<br />\n. ok where Washington stopped. (c¢) Site of First Free School of Kent County. gi=o<br />\n“Bear Can‘}p.” (38?201ral178£gddock’s 6th Camp on the march to Fort Du- 154-690 R(:ﬁl;aswot;epzuciggg (():e&reti?iv?;\\{(r’eYdoerSgace Race Track). Here in 1781 1054-624 <ad) Churth where thepname of “Prostestant Episcopal church\"uwa{s NATION ARK SERVI .<br />\nquesne, June e i 1 0 wn. adopted. For additional information apply for pamphlet at Hotels and L<br />\nWhere George Washington was taken sick and remained for a few days 175-682 Havre de Grace. Originally called Susquehanna Lower Ferry. Washington 1056-626 Chamber of Commerce. AL P CE AREAS IN MARYLAND<br />\ntill he could proceed and catch up with Braddock. stopped here many times. : Rock Hall. Tench Tilghman used this route in carrying the news of the 1017-475 The National Park Service of the United States Department of the Interior admin-<br />\n“The Little Crossings” of the Youghiogheny River (now called Castleman’s 198-684 John O’Neill’s memorial and gun used in the defense of Havre de Grace 1056-626 victory of Yorktown. isters several areas in Maryland, as follows:<br />\nRiver). Old stone arch bridge built in 1813. An arch of 80 foot span, the 1814 (in City park). “Rock Hall Landing.” Eastern Shore Landing of the Colonial Annapolis- 1010-478 ANTIETAM NATIONAL BATTLEFIELD SITE commemorates the Civil 593-596<br />\nlongest built up to that time. “Tudor Hall.” Birthplace of Edwin Booth and John Wilkes Booth. 982-635 Rock Hall Packet. War battle of A;\\\\tietqm, scr)‘r_netimes'callqd Sha’r(psabg:g. Ités. °f°‘;5éa\"di\"9'<br />\n“Little Meadows.” Braddock’s fourth Camp on the march to “Fort 216-684 “Medical Hall.”” The home of Dr. John Archer, the first graduate of medi- 992-624 ‘“Kent Island’’ (the Isle of Kent). William Claiborne of Virginia established 995-410 importance in e istory, since it marke FRliog O aegors<br />\nDugquesne,” 1755. Washington stopped here many times afterwards. cine in America. . a trading post, settlement and fort here in 1631. . I R.°b,ertEE' |Leg,s ft-','ft o?vas(njon of th-‘:- Nortpigheéeb)f/ %OStp°\"'ngd'n-(j9ﬁ'<br />\n“Martin’s Plantation” (near Frostburg). Braddock’s 2nd Camp, 1755. 254-660 Churchville. Rochambeau’s heavy artillery here September, 1781, on way 1012-630 ““Bolingly.” Surveyed 1658 for James Bowling. 1048-434 3',‘;’3%’“,',}95?,008.,, taeeaoepr:;mrﬁ‘(i:to)?rt\\; 'f;'s‘u% h;:En‘,’:nﬁipe;ﬁﬁﬁ ?Dr:oc?:,,yl,r;g<br />\nFirst Toll Gate House on National Road 262-665 to Yorktown. “Bloomingdale.”” Patented 1685 by Capt. Robert Morris. 1049-416 tion. The neighboring Antietam National Cemetery is also under the<br />\nBronze tablet on boulder, in memory of the Pioneers who traveled this 278-662 “Indian Spring.” Where Rochambeau’s heavy artillery camped after 1016-670 “Stagwell.”” Patented to Thomas Stagwell, 1649. 1050-416 administration of the National Park Service, since it is part of the historic<br />\nhistoric road. Erected by the D. A. R. crossing the Susquehanna River. ““Cheston-on-Wye.” Survayed 1659 for John and William Coursey. 1043-408 ground over which the battle was fought. It is the burial place of Federal<br />\nThe National Road. First internal improvement undertaken by the U. S. 286-662 Lafayette at Col. Rigbie’'s House April 13, 1781, where he quelled a 1025-658 “Wye Plantation.” Home of William Paca, signer of the Declaration, and 1088-398 SRS SN S S O Stiotam, BRRY Blausitale, IS Minor SRgag<br />\nGovernment. mutiny of his soldiers. twice Governor of Maryland. He lies buried here : I'r’:{?ﬁsnﬁﬂ%a'fg & if?e“ebrfa%zgdt: Tha;'rzlnal;?::ai? '(Dlgrcr?é?gr'yn;?g 335‘5’6?;<br />\nFirst Iron Rails manufactured in the U. S. at Mt. Savage. : 271-683 COROV\"'__'\"SON(S“G of the Conowingo Dam) an Indian name meaning ‘At 1034-667 “Wye Island.” Patented to Col. Philemon Lloyd 1682 as “‘Lloyd’s Insula.” 1051-385 for the use of visitors. Organizations and groups of visitors will be given<br />\n“The Narrows,” the bridge to carry the new route of the National Highway 297-672 the Falls. “Clover Field.” 1522 acres patented to William Hamsley, 1730 1086-416 special service if arrangements are made in advance with the superin-<br />\nover Will's Creek, built 1883. Dentogit Diiginally GAGE Edenton ¢ Mubert Eriun, Dekdanis. ettt ahius SIN, Aiiress: Sharnguary, Marylenit<br />\nety b Db ey s g it f by Eo [ T I e s A IR e e<br />\no Gl Fori Cumberland, () Gorge Washington's eadauartrs. (4 The T gty b iy - R SRR Lo of Fars Moklaney ageinet a hoat Bugkan neval bomoapdrrart 68 Wer<br />\nParade Ground of Old Fort Cumberland. (e) The Thomas Cresap ttg 0 omeho Col. William Richardson, Col. of the ““Flying Camp’’ of the 1112-296 of 1812 and the writing by Francis Scott Key of the ‘‘Star-Spangled<br />\nMonument in Riverside Park. (f) The original Headquarters House in Annapolis, Capital of Maryland and site of the U. S. Naval Academy, also 942-416 % astern S i His tomb is located h'ere.. G Banner.” Key, detained by the British on a small vessel anchored behind<br />\nRiverside Park. , numerous points of historical interest. For additional information apply Wye House.” Home of the Lloyd family since Colonial times. 1035-381 the enemy fleet, during the night watched the spectacle of the British<br />\n“Washington’s Road.” Washington’s troops first opened this road from 316-684 at Hotels and Chamber of Commerce. Saint Michaels. Attacked by the British during the War of 1812. 1021-348 m\"z_“”'\"g a“ﬂ?ntnr(\\juous bSt\"Ea'L‘ of Sh‘;f' Rombs, \"‘?d rockets at Fort . T<br />\nCumberland to Reas-Town (Bedford, Pa.) in July, 1758. Governor Ritchie Highway and Memorial 915-473 “The Mannour of Ratcliffe.” Colonial home of the Hollyday family. 1048-343 wacs ,ﬁg()&, ta :/r:iteamr; v;?—sgs oef?ﬁ,v: ,Ea?ion’;‘f’;',ft?,';nla%ﬁﬂ';J,'ty'{;ga' 22‘; Herd typical of Maryland’s fine food products<br />\nWhtgﬁe ilan:. Frazier was captured by the Indians in 1754. Original house 312-644 “Whitehfll.\"fT(';he home of Governor Horatio Sharpe, considered the finest 959-431 Williarp Perp‘n's visit 'R 1682 to the Friends Meeting House, the oldest frame 1058-346 example of late 18th century military architecture, with bastions forming<br />\nstill standing. example of Colonial country houses in Maryland. meeting house in America. a five-pointed star. e ’ 3 3 :<br />\nOld Fording Place across the Potomac of the Warriors Path, and site of the 347-622 “Widow Ramsey’s Tavern,” on the General’s Highway. 909-443 ““Canterbury Manor.” Laid out for Richard Tilghman 1659. 1060-323 Fort McHenry is open to the public daily throughout the year, including . ; 3 Homewood”, on campus of Johns Hopkins University<br />\nStockade Fort of Col. Thomas Cresap. Washington stopped here many Washington and Rochambeau passed over this road on their way to York- 920-431 Oxford, one of the first towns and ports authorized by Assembly in 1683. 1036-313 Sundays, from 7:30 a.m. to 5:30 p.m. The museum buildings are open Point to Point Racing, a famous Maryland sport<br />\n times. 3 : A town. “Hole in the Wall.” Early name of this village located near Whitemarsh 1062-315 between 9 a.m. and 5 p.m. An admission fee of 10 cents is charged to<br />\nThe Warriors Path.” War path of the five nations of Indians of New York 366-678 Route taken by Washington on his way to Annapolis to resign his com- 906-446 Church where Robert Morris’ father lies buried. \\Llngltt:qsamg;ersﬂ:)?naﬁi?gr:dﬁﬁggég:g:pghat me;qbers P g;ﬂugs<br />\n. State to the (Earollna I\\{Ilour.\\tgms. _ * L. mission. (Bronze tablet at Severn cross roads). ““Compton.” Home of Governor Stevens who welcomed General Lafayette 888-161 given speycial servic% if arrangements are ,:,g:;;z\\z;t'mf,:;gggzﬁe‘%enf<br />\nOaltdBr:aMI;eEmtS;r!:ggn%V \\\\‘ISIted by Washington in 1769, while visiting 450-680 “Belvoir.” Rochambeau’s troops camped here on their way to Yorktown. 918-434 at Fort McHenry 1825. Address: Baltimore, Maryland. :<br />\nrkeley Ings, W. va. “Three Mile Oak.” Portion of the old h iti i h ““Crosiadore.” The home of the Dickinson family f 1695 to the t 1058-291 : : :<br />\nSite of Tonoloway Fort. Built 1755 as a protection against the Indians. 463-686 General Washington in 17083 onohistrwer:ywtoerrgs?gr:zﬁ?ssc(gnﬁg?s?g“s . . time. Dickinson College at Carlisle, Ps, wasn;\\la%erg?fter Johon oacﬁ?ﬁigﬁ Cwisgﬁ%ﬁ‘c’f%f%':ﬂm%ﬂ'% %ﬁmﬁ:ﬂzﬂlﬂowﬂ%tren:otomac_ River from 321-666<br />\no § ! ’ . A . . . . \" and, occ<br />\nIt now belongs to the State. _ Birthplace of Johns Hopkins, May 19, 1795. Founder of Johns Hopkins 894-440 Cambridge. Originally part of the “Choptank Indian Reservation.” Made 1063-270 right-of-way totalling 5,253 acres, and is adnzinistered ua{)s,'e;a?tn:f\"t%v;<br />\nSthoTsP;%r;afsorle;gn,Tl;lgncock- Founded 1835. During 1861-62 used as a 472-680 Hospital and University. a port of entry 1684. - National Capital Park System. This old waterway, one of the least altered<br />\n0ps. “Elk Ridge Landing.” An i i i 3 \"“Appleby.” The home of Governor Thomas Holliday Hicks. 1063-263 of the older American canals, is an example of the ever-improvi<br />\nRoad to Fort Frederick. Built 1756. Stone fort of Colonial days in America. 517-659 mbaccofJ B B0 Trontam Do S Snin phiwment o SR “Tf\\z T:eaty Oak.” Where the earlyoseitlerg ::o?f/err;cd swith Choptank 1048-270 of transportation that helped to bind the Nation toget’l‘e\"—)r'r\\{‘lfr:’g“g\"’e?az<br />\nGen. J. dEt hB. I\\?t;\"art’? '%avzlrgl on (h)ist ril(i)d 1ati;‘t;%r the Battle of Antietam 524-662 “Spurrier’s Tavern.” Visited over twenty-five times by Washington. 857-482 Indians for the purchase of land. ng/zrzlag::gatgheewlar{dgnﬂt‘fai\\llv ?:f)tloarrifglr(?:g:r{ :(P’\\:dPg;?‘r:Iacrgli::;dviéllzy<br />\ncrossed the.i¥ationa’.ipag here, Ust. 10, . : “Montpelier.” The Colonial home of Col. Thomas Snowden 844-448 “Old Trinity Church.”” Built prior to 1670 1042-272 s : . ! Rl<br />\nA - . V8 ; % % % ] - ! . | 70, graph and telephone, and the modern superhighway. By these constantl<br />\nThe Federal signal s'tatlon on the top of Fairview Mountain was captured 528-662 The first telegram ever sent in the world passed this spot May 24, 1844. 838-453 ‘“‘Choptank Indian Reservation.” The first Indian Reservation in America, 1082-254 improving modes of communication the once widely separated easterz<br />\nby J. E. B. Stuart Iry, Oct. 10, 1862 P V. e<br />\nSR ¥ Fu . SEET Sy, S5 Y, i “Van Horn’s Tavern.” A Colonial Inn at which Washington stopped many 834-448 1669. and western regions of the fast-growing Union were firmly linked both<br />\nT'c'e Blanlé _ﬁoad : g)unltt : bew;et%n 1816-21|. ff-'tnnapcg(:‘ bty the Banks of 570-664 it Rehoboth, granted Richard Lee of Virginia 1673 (2350 acres). The ancestor 1142-272 Eocia”ytand coomgefcia('jws- Twentmtwolm“eshof the old canal, between<br />\naryland in consideration of the renewal of their Charters. “ , »” : . : : f th i eorgetown, D. C., and Seneca, Maryland, have been restored by the<br />\nB La's it IS adghured hisre, Suliinier 15, 1008 i Tl:hodes (Tj'ax/er'n, : Geor%e Washington’s last stopping place in Maryland. 820-403 \"Uonntaczt:s,e;;:n':)ﬂna'mérr]:;;e?(?rv.o?;z?a;asrlg‘c;:: \"”na;i::se ?:v:‘demh'ere b flatane National Park Service. Specially conducted tours via an old-time mule-<br />\nGen. J. E. B. Stuart attacked & large Penneylvania force hore September 572-644 “Re secon gr,l’cu tural College in the We_;stern Hemisphere started 1754. 816-419 1677, X ’ dCrawn. bargéa a{e av:_llqble fgnhghe canal during the summer months.<br />\n20, 1862, but being outnumbered retired across the Potomac. ossburg Inn.” A famous Colonial stopping place. 820-403 “ ) ” ; : anoming, boating, \"ikings filing, picicking, osture walks, and ice<br />\ne, s ) \" N : “Adelphi Mill.” Built 1796 Patty Cannon’s House.” where the noted kidnapping group had head- 1168-296 skating are among the recreational opportunities. Canoes and rowboats<br />\nWilliamsport. An important point during the French and Indian War. It 568-644 ) S - 812-420 quarters. Described in the novel “The Entailed Hat.” may be rented at Great Falls; and privately owned canoes are permitted<br />\nwas considered as one of the sites for the capital of the United States, “Bladensburg.” Site of the Battle of Bladensburg, War of 1812. 820-403 “Green Hill Town and Port,” authorized by an Act of Assembly, 1706 1150-176 on the canal. Address: The Superintendent, National Capital Parks,<br />\nbut George Washington chose the site of the present Washington, D. C. e benbls, | The home and school of the Flev. Jonathan Boucher, 848:388 Birthplace of Commodore Stephen Decatur, January 5, 1779, 1310-180 RS NSPI TN N<br />\nThe Long Meadow. Originally patented in 1739 to Colonel Thomas Cresap. 582-682 © tutor of Jackie Custis. ek ’ : Sk G 4 5 i v<br />\nMason and Dixon Line. The 105th Milestone erected in 1763. The 104th, 597-688 “St. Barnabas Church,” erected in 1774. Washington and Governor Eden 868-359 A{S‘Ilél;?l)nokonson (ndian Town). The larpast indian town in Maryland 1227161 Cizggzwat’:lsqggég;g?:& raslrﬂgmslgrﬁﬁycg”y¢(§8E£ego¢;ilgfn;?; oe—<br />\n103rd, 102nd and 101st with M. on the Maryland side and P. on the attended services here together. Piades i frein R B e Matend es s elevation from 500 to 1,890 feet. It is located in northern Frederick<br />\nPennsylvania are all visible along the road. “Northampton.” The birthplace of Albert Lord Fairfax. 874-418 “Birthol gof T N e OISRy . 1590-139 County, 16 miles north of Frederick near Thurmont, Maryland, on U. S.<br />\nMason and Dixon Line. The 100th Milestone. One of the “Crown’ stones 617-688 ““Queen Anne.” A post town in 1707, where Washington stopped. 891-387 “Rnrt . ace-? S A S - D_eclaratvqn v Independe_nce. PRI gl g A g, p'cnmkm:g’- R T . -<br />\nset every five miles. On one side Lord Baltimore’s coat of arms, and “Tulip Hill.” Colonial home of Samuel Galloway, built in 1756 932-372 lehobeth.” It was here that Francis Makemie established Presbyterian- 1185-075 are among the recreational opportunities. Three organized group camps,<br />\nWilliam Penn’s on the other “Paniings’ TEvom.” Washington disbdhe 'S iy 26‘ 773 016-386 ism in Maryland. developed on the modern ““unit” plan, are available to civic, social, and<br />\n> g re on September 26, ; - “ ¥ : 2 e o B |<br />\nGen. Robert E. Lee entered Hagerstown Sept. 11, 1862, along this road. 610-660 “Larkins Hills,” where Lord gBaltimore and the Asspembly met, 1683. 914-388 Make Peace.” One of the finest examples of early Colonial houses. STNO ir:{;grlrg‘:zig{g?g:z:ﬂgptstgm é(;sri‘slf(?e?ci?i?i(i:sc?r:ntpr:ggc::#;’:’in%?u%:i?ggg-’<br />\nHarpers Ferry Bridge where John Brown crossed in his raid on Harpers 592-542 William P to the h c ; Maryland-Virginia Line. One of the boundary stones and one of the 1220-066 ing cabins, unit lodges with outdoor kitchens, sanitary facilities in<br />\niam Penn came to the home of Colonel Thomas Tailler on December 908-376 “Marri T Pt located th t i ini i<br />\nFerry, Oct. 17, 1859. 13, 1682, for his first conference with Charles Lord Baltimore as to the TN RN TR S e e each unit, central dining hall and kitchen, central shower house,<br />\nWashington-Frederick County Line. Washington County was the first 608-546 location of the Maryland-Pennsylvania Boundary Line swimming pool and infirmary. The sleeping quarters are equipped with<br />\nCounty in the U. S. named for the Father of his countr ¥ . 2 ¥ iron cots, but campers must provide their own mattresses, bedding,<br />\no 2 e B ; g William Penn attended a meeting of the Friends (Quakers) at Thomas 932-358 kitchen utensils, and dishes. Address: Superintendent, National Capital<br />\nCrampton’s Gap” and_ ‘“‘South Mountain,” an important battle of Sept. 619-573 Hooker’s in 1682. STATE FORESTS AND STATE PARKS IN MARYLAND Parks, Interior Building, Washington 25, D. C. $<br />\n14-15, 1&62. Sl)t( U. S. markers mark the spot, and a large stone arch Marlboro County seat of Prince George’s County since 1720. 870-358 HAMPTON NATIONAL HISTORIC SITE 913-575 M ttoF i s<br />\n“Ncro:ms dchres £ the h f G Th Sim L Site of home and grave of Dr. Beanes whose arrest by the British in 1814, 862-352 The state parks of Maryland were selected for their scenic o~ historic values and for T v onument to Francis Scott Key-._AUthor .Of the ““Star Spangled<br />\needwood Forest,” the home of Governor Thomas Sim Lee. 634-576 indirectly provided occasion for Francis Scott Key to write the ““Star their recreational possibilities. The state forests were established primarily for ' —in Frederick<br />\nBraddock’s Heights and Braddock’s Spring, marked by a bronze tablet 658-579 Spangled Banner.” conservation, but they also afford extensive recreational opportunities. For detailed THE APPALACHIAN TRAIL<br />\non a large boulder. The first Bishop consecrated in the United States, Thomas John Claggett. 870-345 information regarding cabin rentals, seasons of use and description of accommo-<br />\nWhere Gen. Meade took command of the Federal Army. 684-566 Birthplace of Archbishop John Carroll. 877-343 dations, write to Department of State Forests and Parks, State Office Building, THE APPALACHIAN TRAIL, the longest marked and chartered footpath g33. 626<br />\nFrederick. (a) Site of the Brothers Tavern where Washington stopped. 685-576 Marking the route of Washington from Annapolis to Mt. V in 1783 Annapolis, Md. in the world, extending from Maine to Georgia enters Maryland at Pen<br />\n(b) Statue at grave of Francis Scott Key. (c) Tablet at old barracks “ ” 9 i SRAVES S0 (N ‘Veraim. Ix 1700, e Iny CEDARVILLE STAT : ) Mar, stretching thirty-eight miles to Harpers Ferry. A fully equipped<br />\nbuilt in 1777. (d) Tablet at corner of Church and Market Streets. (o) Melwood Park.” The home of Ignatius Digges and Governor Thomas 849-354 s ATE FOREST, 3,510 acres, Charles and Prince George’s 850-294 shelter and five lean-tos are available for the hiker. Many points of<br />\n: T . Sim Lee. Counties, off U. S. 301, 5 miles southeast of Brandywine. The Zekiah : include the first monument to George Washington near Turners<br />\nTaney House (Bentz Street). (f) Barbara Fritchie House. For additional % = : : Swamp, msandering streams and mixed pine and hardwoods feature this oot gl Rii-eddy « 9 d th nificant<br />\ninformation apply at Hotels and Chamber of Commerce. Mount Airy,” The home of Benedict Calvert, whose daughter married 854-348 e . e p : : Gap, a stone arch erected to news correspondents, and the magn!<br />\nG f : ; Washington’s stepson. area. Limited facilities for picnicking and camping, forest roads and trails panorama of the Potomac at Weverton Rocks. Address: The Potomac<br />\n(Wei;r;_'%rlddgggtstogcsm:lyow:s, t\\;\\(r)&:grge\\rlgashmgton stopped several times. 688-604 “Mrs. Surratt’s House.” where John Wilkes Booth stopped to secure 829-339 for hiking, hunting in season. Address: Forest Supt., Brandywine, Md. Appalachian Trail Club, 1916 Sunderland Place, N.W., Washington 6,<br />\nCatoctin Furnace, an important Iron Eaivinse during the Revolution, 1776, 678-636 ammunition. DONCASTER STATE FOREST, 1,464 acres, Charles County, west of La 743-246 D.C.<br />\n- i V- o lon, . “T. B.” The initials of Thomas Brooke on a boundary stone at Brookfield. 834-316 Plata and 114 miles east of Doncaster on State 6. Virginia pine forest. For G | Information<br />\nJug Bridge,” where Lafayette was met by the Citizens of Frederick, 1824. 696-571 Y . g iti ionicki i : OEAARREEN, AN<br />\nHeadquarters of Generals Robert E. Lee, Stonewall Jackson and Long- 688-566 “Dr. Mudd's House.” Home of Dr. Mudd, who set the broken leg of John  862-255 fLol:n;\\t?(d oppgrtutn|t|e§ 44 ptcnlctxgg - ci_mpmtg,sfor?stéoads atnd trl\\a)lllciis About Maryland, Write<br />\n; : k. b Wilkes Booth. iking, hunting in season. ress: Forest Supt., Doncaster, : . :<br />\nstreet, Sept. 6-9, 1862 \" o . : . THE DEPARTMENT OF INFORMATION<br />\n“Monocacy Battlefield,” July 9, 1864. Apply for pamphlets at Frederick. 685-562 l%(; é?’g?ggkgozﬂna;;or. Surveyed in 1650 for Robert Brooke, Commander 866-298 ELI\\:(orThEeg:t. SCTJT;EerFca)r':;:sir‘\\r’w?l'gsczor?g;ﬁso'ncﬁic&lngggr}E\\y’s;a;?)‘rie east of 1110-640 ', ARSI AR, s<br />\ni : rasame<br />\n[ nowozwa<vi<br />\nNOILOZT<br />\nV‘d |<br />\n“Carrollton,” 10,000 acres of land from which Charles Carroll derived the 686-516 ““Three Notch Road.” An early law provided that three notches marked on 920-190 ELK NECK STATE PARK, 995 acres, Cecil County, 10 miles south of 1088-602 m sz }‘ s<br />\ntitle, Charles Carroll of Carrolliton. trees indicated a road to a ferry. Northeast, traversing peninsular at head of Chesa;’)eake Bay, fronting s<br />\nRoute taken by Gen. Anthony Wayne in 1781 on his march from Phila- 670-528 Charlotte Hall School, continuously open since 1796. 863-230 both on bay and Elk River. Mixed pine and hardwood forest. Extensive Washington Monument, Baltimore<br />\ndelphia to Virginia. “Ye Coole Springs.” The first medicinal springs in America. 863-235 facilities for picnicking, limited opportunities for camping, swimming and daa g ’ Chapel, U. S. Naval Academy<br />\n““Amelung Glass Works.” First glass works in America was established 697-547 Benedict. British troops landed here August, 1814. 892-247 boating, housekeeping cabins with central toilet and wash house (for _L‘SO<br />\nhere in 1789. : k “District Line.” Point where Washington first entered Prince George’s 818-394 \\,;acatnon US?\\I only, by hzldvance reservation at Annapolis). Address: NDHOHS<br />\nSugar Loaf Mountain. So called by Baron Graffenried, a Swiss Nobleman, 690-524 County, Maryland (1751). ark supt., Northeast, Md. , Al \\SHBNN('\\ S<br />\nin 1710. G “‘Oxon Hill.” Home of the Addison family. John Hanson died here. 804-351 FORT FREDERICK STATE PARK, 279 acres, Washington County, off 518-646 e :<br />\n“Whites Ferry.” Important crossing of the Potomac during the Civil War. 652-482 “Broad Creek Church.” Mother Church of the District of Columbia, erected 800-336 U. 8. 40, 5 miles south of Clear Spring or Indian Springs via State 56<br />\nWoodstock. Farm owned by Washington at the time of his death. 702-472 in 1723. through Big Pool, entrance on State 44. Restored old frontier fort built<br />\nRockville. (a) Site of camping grounds of Braddock’s troops, 1755. (b) 758-456 Fort Washington built by Major L’Enfant who laid out the City of Wash- 792-320 of stone in 1756 during French and Indian Wars, also used during<br />\nJ E. B Stuart's raid: 1863; ington . Revolutionary and Civil Wars. Stone museum illustrates successive<br />\n3 g g i > PP historical events. Facilities for picnicking, camping and fishing in Big<br />\nGreat Falls.of the Potomac. One of the most picturesque spots in Maryland. 729-425 Piscataway Town.” Visited by Governor Leonard Calvert, March 1634, 807-316 ; ; .<br />\nWestminster. The first complete county rural free delivery service in the 801-634 (before he landed at St. Mary’s) to visit the Indian Emperor. gg(r)ll( OSnug'tfi (B:rnlge sgg:lak&;n s, I . -<br />\nUnited Sta_tes. Marshall Hall. Maryland landing of Washington’s private ferry. 772-310 - . s i<br />\nUnion Mills. Gen. J. E. B. Stuart’s Camp on June 29, 1863, and Gen. James 792-669 “Araby.” The Colonial home of Widow Eilbeck, whose daughter married 780-260 GAMBRILL STATE PARK, 1,088 acres, Frederick County, 6 miles north-  660-595<br />\nBarnes’ Camp on June 30, 1863, on their way to Gettysburg. George Mason. ;vf?gﬁd?; Freexdtgzgikv'e ’-{vluger\\]/v;< n:\\?er? \"lv?:rsgmg M:,Tj ﬂ?ﬁf\"f\" 1,630”feet.<br />\n“Cookerly’s Tavern.” Washington stopped here on July 1, 1791. 712-619 “Widow Chapman’s.” Mt. Aventine on the Potomac opposite Gunston 770-288 Facilitie% for picnicking and hiking refr:sah%earllt buil(iﬁnge ﬁ;ﬂou:e g%sd. Ocean City, Maryland’s Sea Resort<br />\n“Terra Rubra.” Birthplace of Francis Scott Key. 710-619 Hall, Virginia. shelters (reserve in advance). Address Forest Supervisor, R.F.D. %5<br />\nOld Friends Meeting House, of which President Hoover's ancestors 750-632 ““Governor Smallwood’s Home.” Washington here in October, 1785. 742-256 Frederick, Md. : :<br />\nwere members. “Durham Church.” Built 1732. Rebuilt in 1791. 755-233 A ;<br />\nFirst Reaping Machine in the world was invented here. 761-631 “Washington’s Farm.”” 600 acres acquired by him in 1775. 738-226 G?JnHal;,gr\\::?edS;QI%ozﬁt?e}:’aloé;?;ﬁoﬁo&fg ghhslt\\:é)euat:&?e«g;g/ aéllgcg: sTeas<br />\n“Doughoregan Manor.” The home of Charles Carroll of Carrollton. The 830-526 “The Ret_reat.” Home of Daniel of St. Thomas of Jenifer. 795-248 tion of 930 feet. Located on the Appalachian Trail and surrouncjing the<br />\nlast survivor of the signers of the Declaration of Independence. ‘““Rose Hill.” The home of Dr. Gustavus Brown, one of Washington’s 795-248 Civil War Correspondents Monument, a national memorial. Undeveloped<br />\n“Ellicott’s Mills.” Terminus of the B. & O. R. R. in 1830 857-522 physicians. but plans for development are now under way.<br />\n“Rolling Road.” a Colonial road built for the purpose of rolling hogheads 869-538 ‘“Habre de Venture,” the home of Thomas Stone, signer of the Declaration 800-266 GREEN RIDGE STATE FOREST, 25,451 acres, Allegany County, be- 360-650 T<br />\nof tobacco to Elk Ridge Landing. of Independence. : tween Town Hill, Polish Mtn. and the Potomac River, 15 miles east of =<br />\nPort Tobacco. The County Seat of Charles County until 1895. 795-248 Cumberland along U. S. 40. Elevations 500-1,800 feet. Roadside picnic e<br />\n“LadGr?‘nge,\" the home of Dr. James Craik, Washington’s lifelong friend 795-248 area near Forest Hdgrs., 15-mile Creek and U. S. 40. Undeveloped i<br />\nand physician. opportunities for camping, hiking, fishing and hunting in season. Address: i<br />\nNORTH CENTRAL MARYLAND “Sfamuel Cox’s Farm,” where John Wilkes Booth and his accomplice hid 804-229 Forest Supt., Flintstone P. O., Md. s<br />\n; 4 or several days. MT. NEBO—STATE FOREST AND GAME REFUGE, 1791 acres, 190-622<br />\nSite of Home of Governor Augustus W. Bradford which was burned by 906-564 Cedar Point. Washington’s schooner ran aground here in February, 1766. 844-156 located along U. S. Route 19 in Garrett C Tract admini i<br />\nConfederate troops on July 11, 1864 ; ; ” g9 Tt CONLY. LTI Sdministeres<br />\n5 \" p 5 o E Ay $ s 3 - “Laidlow’s Ferry.”” Washington crossed here many times on his way to 803-193 jointly by the Department of State Forests and Parks and the Depart-<br />\nGca':l\"'rs:h\" g‘;ﬁ??rzggurf;'éz Built for the Forest inhabitants of St. Paul’s 869-573 Williamsburg. ment of Game and Inland Fish. Undeveloped.<br />\n’ » 5 The birthplace of Roger Brooke Taney, Chief Justice of th i 19- ; ;<br />\nOld Court Road. The original road leading to the Court at Joppa Town. 871-560 1836-64[.) . e ST Jtinn of the Liine s SR PlﬂArEi?SsofrsoLATBglt'i: rﬁ?r}g’(])i?f“Ha:ﬁrlesf ?na;'g\"r“%'r‘:haxgs{\"g;”ﬂd SCO;\"‘ftr'gﬁ; 860-535-<br />\nT-h1°31%'d United States Arsenal. Built in 1816 after the close of the War of 877-562 “The Cliffs of Calvert.” One of the most picturesque spots in Maryland. 938-265 Elkridge, along Patapsco River between Relay and Hollofield. Extensive<br />\n- e e s 3 i s : “Preston on Patuxent.” Seat of the Puritan government of Maryland, 952-196 facilities for picnicking, camping, hiking, horseback riding and nature<br />\nThe Garrison Fort.” Built in 1695 as a protection against ho§tlle Indians. 869-573 1653-57. study, limited opportunities for swimming and fishing. Address: Park<br />\n”T;_g%afeaglg’ss Bf\\lrets;';' :arr‘te dofp ;;Tp:gtV:Irl‘?rg:) Jttzl’r!&:gp!:‘aﬁ\"n\\'gmh was con- 927-594 \"hgattapany.” Site of 1st Jesuit Mission, later home of Charles (3rd Lord 965-162 Supt., lichester, Md. '<br />\ng st Y - 3 e altimore). POCOMOKE STATE FOREST, 12,377 acres, southwestern Worcester 1225-140<br />\nQump or Sweet_Alr. Patented 1704. Long associated with the Carroll 930-612 ‘““Manor of Cornwaley’s Cross.” One of the oldest homes in Maryland. 982-096 County, between Snow Hill and Pocomoke Clt,y in “Eastern Shore’’ area. Ba|t|m0re Skyhne Fort MCHem’ Baltimore B'(th |ace Of the “St r S ' d B 2 H ” f R d A l<br />\nfamily. House built about 1752 : e O : i Y, ’ p a pangie anner aill o ecordas, Annapolis<br />\n& ol : : Saint Mary’s City. (a) Reproduction of State House of 1676. (b) Monument 963-129 Forest of bald cypress, southern gum, cottonwood poplar and loblolly . ?<br />\nTq%e??:)t:«;:in?ari‘:iaonudt zOftl;ltOVgt\\ qunqgg?'qoad- Authorized 1805, to rebuild 895-635 to Leonard Calvert. (c) Trinity Church, erected from bricks of first State pine. Milburn Landing Recreational Area on Pocomoke River, 7 miles ) bernt e 5 3 - ol i, : : e 5<br />\nK y the State in - X House of 1676. (d) Site of the 1st State House. (e) Governor Lionel Cop- northeast of Pocomoke City off State 364. Facilities for picnicking, e ot BBAL s & bk el bl R e - i - - - Rl o - ’ B<br />\n40}!_;63hfélgstone on the Mason and Dixon Line, surveyed and marked 925-685 I(e))/’s Ftomg. (f) f\"(!:\\/lattapany Street.” thte (f;l:;st, I_l'oar:i owg in Maryland. %pportunitg_es forS campgng, Dhiking',: fishing and hunting in season.<br />\ng) “Freedom of Conscience”” monument. “Father ite”’ memorial. ddress: Forest Supt., R.F.D. #1 Pocomoke, Md. % : ; g : .<br />\n\"Bbl:gl': fl;!oor:‘s?\\‘;l':v$;rr\\i;’\"\\‘l\\l1h7g7r; Washington spent the night on his way 927-653 |(r|1) Mh:r;rlr;?‘:;?l(gaé%zg%orgjs) Ssé}inar{r:)sgirtnén(;r)ﬁrs(,{()csalttl'?oﬂz fgﬁtu;gll:l POTOMng STATEEIFOREST, 12,057 acres, southern Garrett County 150-560 Maryland’s State House, Oldest Capitol in use in the nation, Annapolis The Hager House—Home of the Founder of Hagerstown<br />\nSt. James Church, My Lady’s Manor, started 1750. (no marker). 921-628 St. Mary’s Female Seminary. The State’s 200th anniversary memorial 963-129 ggfitng th: lgg?:ﬁ\\acegiavté?nir:& one%??%égﬁ%olnnethv;lgn?e:lttl)?\\?;s’S?aqz ?gg—<br />\nClynmalyra, 5,000 acres surveyed 1705 for Charles Carroll, Lord Balti- 908-636 established 1839. 3 : i Roads and trails provide access and opportunities for camping, hiking,<br />\n- more’s Attorney-General; in 1822, his great-great grandson Henry P%ln(} L0t0k0u_t- Site OJ.PJISOH Camp during Civil War; where 3,000 Con- 995-075 fishing and hunting in season. Forest Hdgrs. near Tasker Corners.<br />\nederate k : i<br />\n”aant)lld bun:n the h?,u?(e).ooo s T i . Cler:entg;--?:lr:;r: F|ierst i atase of ia i i T Address: Forest Supt., Deer Park, Md. The Old Chesapeake and<br />\ny Lady’s Manor.” 10,000 acres owned by Lady Baroness of Baltimore. the D March 25. 1634 ap SANDY POINT STATE PARK, 725 acres, located on Chesapeake Bay at 970-433<br />\nBel Air. County seat of Harford County since 1783. See portraits and 984-620 e Dove on March 29, . Sandy Point in A Arundel C U R i -<br />\n- = 3 p andy Point in Anne Arundel County on U. S. Route 50. Work is pro<br />\nmurals in Court House and Post Office. Deep Falls.” Home and burial place of Dr. James Thomas, Governor of 862-195 ceeding on the development of this park.<br />\n“Harry Gilmor’s Raid.” A serious Confederate invasion of Maryland. 975-608 Maryland (1833-36). . ;<br />\n“Jerusalem Mills.”” Established in 1772 by David Lee, a Quaker from 972-594 “The Monastery.” First Carmelite convent in U. S. Founded 1790. 804-268 SAVAGE RIVER STATE FOREST, 52,672 acres, northeastern Garrett 173-335<br />\nBuck,s County Pennsylvania. “The Old South River Club.” Oldest Social Club in America. 923-392 County. Elevatlon_s 1,400-3,000 feet. 1 mile east of Grantsville on U S.<br />\n3 ’ o 40, turn south 5 miles to Forest Hdqrs. at New Germany. In two sections,<br />\nThe House of Ishmael Day.” who shot a Confererate Cavalryman at- 975-608 ; ; ;<br />\ng - i 3 . S 4 one on Negro Mountain near Keysers Ridge on U. S. 40, and one in the<br />\ntempting to pull down his Union flag during Harry Gilmor’s raid. Savage River watershed between Meadow and Big Savage Mtns.<br />\n“The Sweathouse Road,” called from the Indian p.ract'l'ce of throwm’g' 960-588 . EASTERN SHORE Recreational areas with cabins (for vacation use only, by advance reser-<br />\nwater on heated stones to generate steam, an Indian ”Turkish Bath vation at Annapolis), campsites and picnicking facilities at New Germany<br />\nfor a curative purpose. : , and Big Run. Swimming in 13-acre lake at New Germany. Skiing facili-<br />\nPe':ry Hall. Trt‘ne h(:mntzj of Harry Dorsey Gough. One of the largest colonial 951-375 \"TRO P!ODflf;ggs of the Susquehanna Canal” one of the first canals in 1048-659 ties include open slopes with rope tow, downhill and cross-country ski<br />\nouses in Maryland. merica, . trails and ski lodge with cooking and sleeping accommodations for 26<br />\n“The Joppa Road.” An old Indian trail used as a route to Joppa, the 958-572 ‘‘Susquehannock Indian Fort” (site of an important point in the contro- 1042-668 persons at any time of year (organized groups only, by advance reserva-<br />\nCounty seat of Baltimore County 1712. versy between Penn and Lord Baltimore). tion at Annapolis). Address: Forest Supt., Grantsville P.O., Md.<br />\nThe Baltimore and Harford Turnpike, built 1816. 950-590 “Smith’s Falls.” In 1608 Captain John Smith ascended the Susquehanna 1040-658 3<br />\nSt o Nrt P Sutember 1214 e e i o o o, TALy Ty poRSET, 20 gy e Sfan ikt<br />\nBritish attack on Baltimore on the Battlefield of North Point. 943-528 cumn}mgthaé/ern. :‘Nhere’?ochambeau s heavy artillery camped before 1070-658 ary of West Virginia. Elevations 2,200-2,900 feet. Recreational areas at<br />\nBaltimore. For information regarding points of historic interest apply to 908-533 . SO SN SRS — E . Herrington Manor, Forest Hdars. 5 miles from Oakland, with cabins (for<br />\nthe Mayor and City Council, Association of Commerce and Hotels. Richards’ Oak.” Lafayette’s troops camped under this tree in 1781. 1049-679 vacation use only, by advance reservation at Annapolis), bathhouse and<br />\nRochambeau’s Camp at Whitemarsh on his way to Yorktown, 1781, and 960-565 West Nottingham Academy, founded 1744, by Dr. Samuel Finley, who in 1061-671 beach for swimming in 53-acre lake, and at picturesque Swallow Falls<br />\non his return to the north. 1761 became the President of Princeton. aﬁd Mll:ddy Creek Falls (highest in the State) 3 miles beyond, with trails<br />\na v : = . : “Nottingham Lots.” Important in the controversy over the Mason and 1074-690 through virgin white pines and hemlocks, picnicking facilities, opportuni-<br />\n'S'ate of “The Red L'fm vaern where Washington stopped over 25 times. 966-554 Dixong Line. g v ties for camping, fishing and hunting in season. Address: Forest Supt.,<br />\nThe Gunpowder River.” So called as early as 1660. 993-550 . . ; P g Oakland, Md<br />\n“Joppa Town.” County seat of Baltimore County, 1712 to 1768. A port 982-584 “Brick Meeting House,” Established by William Penn in 1702. 1086-683 T e<br />\nfrom which tobacco was shipped to England. L(;ng the rival of “Balti- “Blue Ball Tavern.” Established in 1710, by Andrew Job. 1112-680 WASHINGTON MONUMENT STATE PARK, 96 acres, eastern Wash- 624-608<br />\nmore Town.” “New Munster.” 6,000 acres granted in 1683, to Edwin O’Dwire and 15 1133-681 ington County, 2 miles east of Boonsboro, then 134 miles north of U. S.<br />\n“The Gunpowdér Neck.” One of the earliest settled portions of Baltimore 998-565 other Irishmen. 48 am Zhtisatown. EAeae Sigpiecio S sops of. South Mn.,<br />\nCounty, now the site of Fort Hoyle and Edgewood Arsenal. Perryville, Cecil County, terminus of the “Susquehanna Lower Ferry.” 1060-630 elevatlog 1§°0 feet. Extensive views from restored 30-foot stone monu-<br />\nBirthplace of William Paca, signer of the Declaration of Independence.  997-588 Rochambeau’s troops camped here on their way to Yorktown in 1781. e s L S e T T<br />\nCapt. John Smith ascended to this point 1608. 1014-596 e et WRE. - S5O0 Jiren, $ne SERRYRAG'S Tergat Manirs, 1COMEN Range to the east, Located on route of the Appalachian trail. Museum—<br />\nSophia’s Dairy. Built 1768, by Aquila Paca. 1020-600 The Principio Qompany. The first iron works in America (1715): 1072-638 refreshment building, and facilities for picnicking, including shelters (re-<br />\nSite of “Old Baltimore,” 1683. 1st County Seat of Baltimore County. 1011-594 Charlestown. Laid out in 1742. Washington stopped here many times.  1087-636 serve in advance). Address: Park Supt., Middletown, Md.<br />\n“Spesutia P. E. Church” (St. George’s Parish). Founded 1671. 1025-599 North East. Site of the iron forges of the “Principio Company. 1099-645 WYE OAK STATE PARK, 1.5 acres, northern Talbot County near Wye 1061-405<br />\n<br />\nElkton, originally called ‘““Head of Elk”, Important during the Revolution. 1129-648<br />\n<br />\n“Constant Friendship” Owned by Col. Thomas White, father of Bishop 995-598 Mills on U. S. 213. A nature mounument preserving 400-year-old white<br />\n<br />\nWilliam White. The old “Post Road.” where it crosses the Maryland-Delaware Line. 1143-648 oak, said to be the largest of this species found east of Mississippi River i i ; | i I ‘ . ; i<br />\n“Cokesbury College” the first Methodist College in the world established 1014-604 ““Bohemia Mannour.” Patented to Augustine Hermann in 1662 “for making 1110-608 with circumference ofgs7 feet, 7 ir?ches—% foot above ground,pl?eight of Proposed Chesapeake Bay Bridge u.s. ‘Naval Academy, Annapolis The Government House, Home of Maryland’s Governors, Annapolis The Hammend-Harwood House, Annapqhs Fatri-scane n wth Westecn: Macsanahills DO SO MATVISNT'S I T, e P<br />\n1785. the Map of the Province of Maryland.” 95 feet and spread of 165 feet. State Tree of Maryland.<br />\n.-f.‘<br />\n\f", "format": "basic_html", "processed": "+<br /><br />\n¥<br /><br />\n8509 9//¢0<br /><br />\ni<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\n(724) 779-2111<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nAYVHEIT HIMOHN3SI3 3 j<br />\nHISTORICAL POINT&gt; : - ememe-—au’s troops camped here 1781 on their way to Yorktown. 1018-605 ““The Labadie Tract.”” 3,750 acres occupied 1684 by a Religious Sect who 1125-604 o<br />\n“Harford Town”” or “Bush.” The first Declaration of Independence was 1016-626 led a communist form of life. : EXTENSION SERVICE, UNIVERSITY OF MARYLAND 3 %<br />\nsigned here; March 22, 1775. ; . Warwick. Washington stopped here on his way from Fort Cumberland to 1146-580 PLEASANT VALLEY RECREATION AREA, 1904 acres, central Garrett 169-637 ] % 2 &lt;<br />\nWESTERN MARYLAND Ro(i:aimbefa%s }(rtoops camped here in 1782 on their way back from the 1035-612 B_?ﬁStIOI’\\. mf 3756, a?qd on sevtehral_othert occ?snﬁns. County, 10 miles south of Grantsville on State 495. Elevations 2,000- B 5%<br />\nvictory of Yorktown. irthplace of James Rumsey, the inventor of the steamboat. 1146-580 2,900 feet. Public facilities for picnicking include a covered pavilion, ol % %<br />\n”MtcCullgc’P:'s Pasth.’t’ Th: ﬁr;.é tqa;iil;:hrough the Glades. George Washington 110-577 Abe':geent:’roving Grounds. Military reservation of 55,000 acres of land 1047-595 Georgetown, burned by the British on May 6, 1814, 1116-561 tables _%ll_r'l‘d open fireplaces. A.30-36224‘%?;:“30\\/\"38“?:\"61;%fpr;ligggsSWiT’; éc‘g ¢<br />\nstopped here, September 26, i and water. Galena. Washington stopped here in 1774. 1117-551 ming. lhere are group camping ac e 3 £3c<br />\n““Charles Friend’s Home.” George Washington stopped here on Septem- 114-560 Spesutia Island (Utie’s Hope), 2300 acres surveyed 1658. The only Manor 1061-592 Shrewsbury Church and Tomb of Brigadier General John Cadwalader 1104-546 FUNEING B S g5 SRS 0 410 SR I AW &amp; G- zE&amp;<br />\n3 b ; ; : \" t facilities for swimming and hiking. (For group camping reservations, oE 8<br />\ng?vre'?s, 1784, looking for the best route from the Potomac to the Ohio :2 ’1\"636:'(;0“’ County. Treaty with the Susquehannock Indians made here Chesterto\\xv/n. (a) Washington College, founded 1782. (b) Worsell’s Tavern 1065-502 (ax(,ir(‘jreil.(s“Il:)zten.gionwslerviceg,l Universitg o(f Magry!agd, Cgllege Park, Md.) wo§<br />\n. ok where Washington stopped. (c¢) Site of First Free School of Kent County. gi=o<br />\n“Bear Can‘}p.” (38?201ral178£gddock’s 6th Camp on the march to Fort Du- 154-690 R(:ﬁl;aswot;epzuciggg (():e&amp;reti?iv?;\\{(r’eYdoerSgace Race Track). Here in 1781 1054-624 \nquesne, June e i 1 0 wn. adopted. For additional information apply for pamphlet at Hotels and L<br />\nWhere George Washington was taken sick and remained for a few days 175-682 Havre de Grace. Originally called Susquehanna Lower Ferry. Washington 1056-626 Chamber of Commerce. AL P CE AREAS IN MARYLAND<br />\ntill he could proceed and catch up with Braddock. stopped here many times. : Rock Hall. Tench Tilghman used this route in carrying the news of the 1017-475 The National Park Service of the United States Department of the Interior admin-<br />\n“The Little Crossings” of the Youghiogheny River (now called Castleman’s 198-684 John O’Neill’s memorial and gun used in the defense of Havre de Grace 1056-626 victory of Yorktown. isters several areas in Maryland, as follows:<br />\nRiver). Old stone arch bridge built in 1813. An arch of 80 foot span, the 1814 (in City park). “Rock Hall Landing.” Eastern Shore Landing of the Colonial Annapolis- 1010-478 ANTIETAM NATIONAL BATTLEFIELD SITE commemorates the Civil 593-596<br />\nlongest built up to that time. “Tudor Hall.” Birthplace of Edwin Booth and John Wilkes Booth. 982-635 Rock Hall Packet. War battle of A;\\\\tietqm, scr)‘r_netimes'callqd Sha’r(psabg:g. Ités. °f°‘;5éa\"di\"9'<br />\n“Little Meadows.” Braddock’s fourth Camp on the march to “Fort 216-684 “Medical Hall.”” The home of Dr. John Archer, the first graduate of medi- 992-624 ‘“Kent Island’’ (the Isle of Kent). William Claiborne of Virginia established 995-410 importance in e istory, since it marke FRliog O aegors<br />\nDugquesne,” 1755. Washington stopped here many times afterwards. cine in America. . a trading post, settlement and fort here in 1631. . I R.°b,ertEE' |Leg,s ft-','ft o?vas(njon of th-‘:- Nortpigheéeb)f/ %OStp°\"'ngd'n-(j9ﬁ'<br />\n“Martin’s Plantation” (near Frostburg). Braddock’s 2nd Camp, 1755. 254-660 Churchville. Rochambeau’s heavy artillery here September, 1781, on way 1012-630 ““Bolingly.” Surveyed 1658 for James Bowling. 1048-434 3',‘;’3%’“,',}95?,008.,, taeeaoepr:;mrﬁ‘(i:to)?rt\\; 'f;'s‘u% h;:En‘,’:nﬁipe;ﬁﬁﬁ ?Dr:oc?:,,yl,r;g<br />\nFirst Toll Gate House on National Road 262-665 to Yorktown. “Bloomingdale.”” Patented 1685 by Capt. Robert Morris. 1049-416 tion. The neighboring Antietam National Cemetery is also under the<br />\nBronze tablet on boulder, in memory of the Pioneers who traveled this 278-662 “Indian Spring.” Where Rochambeau’s heavy artillery camped after 1016-670 “Stagwell.”” Patented to Thomas Stagwell, 1649. 1050-416 administration of the National Park Service, since it is part of the historic<br />\nhistoric road. Erected by the D. A. R. crossing the Susquehanna River. ““Cheston-on-Wye.” Survayed 1659 for John and William Coursey. 1043-408 ground over which the battle was fought. It is the burial place of Federal<br />\nThe National Road. First internal improvement undertaken by the U. S. 286-662 Lafayette at Col. Rigbie’'s House April 13, 1781, where he quelled a 1025-658 “Wye Plantation.” Home of William Paca, signer of the Declaration, and 1088-398 SRS SN S S O Stiotam, BRRY Blausitale, IS Minor SRgag<br />\nGovernment. mutiny of his soldiers. twice Governor of Maryland. He lies buried here : I'r’:{?ﬁsnﬁﬂ%a'fg &amp; if?e“ebrfa%zgdt: Tha;'rzlnal;?::ai? '(Dlgrcr?é?gr'yn;?g 335‘5’6?;<br />\nFirst Iron Rails manufactured in the U. S. at Mt. Savage. : 271-683 COROV\"'__'\"SON(S“G of the Conowingo Dam) an Indian name meaning ‘At 1034-667 “Wye Island.” Patented to Col. Philemon Lloyd 1682 as “‘Lloyd’s Insula.” 1051-385 for the use of visitors. Organizations and groups of visitors will be given<br />\n“The Narrows,” the bridge to carry the new route of the National Highway 297-672 the Falls. “Clover Field.” 1522 acres patented to William Hamsley, 1730 1086-416 special service if arrangements are made in advance with the superin-<br />\nover Will's Creek, built 1883. Dentogit Diiginally GAGE Edenton ¢ Mubert Eriun, Dekdanis. ettt ahius SIN, Aiiress: Sharnguary, Marylenit<br />\nety b Db ey s g it f by Eo [ T I e s A IR e e<br />\no Gl Fori Cumberland, () Gorge Washington's eadauartrs. (4 The T gty b iy - R SRR Lo of Fars Moklaney ageinet a hoat Bugkan neval bomoapdrrart 68 Wer<br />\nParade Ground of Old Fort Cumberland. (e) The Thomas Cresap ttg 0 omeho Col. William Richardson, Col. of the ““Flying Camp’’ of the 1112-296 of 1812 and the writing by Francis Scott Key of the ‘‘Star-Spangled<br />\nMonument in Riverside Park. (f) The original Headquarters House in Annapolis, Capital of Maryland and site of the U. S. Naval Academy, also 942-416 % astern S i His tomb is located h'ere.. G Banner.” Key, detained by the British on a small vessel anchored behind<br />\nRiverside Park. , numerous points of historical interest. For additional information apply Wye House.” Home of the Lloyd family since Colonial times. 1035-381 the enemy fleet, during the night watched the spectacle of the British<br />\n“Washington’s Road.” Washington’s troops first opened this road from 316-684 at Hotels and Chamber of Commerce. Saint Michaels. Attacked by the British during the War of 1812. 1021-348 m\"z_“”'\"g a“ﬂ?ntnr(\\juous bSt\"Ea'L‘ of Sh‘;f' Rombs, \"‘?d rockets at Fort . T<br />\nCumberland to Reas-Town (Bedford, Pa.) in July, 1758. Governor Ritchie Highway and Memorial 915-473 “The Mannour of Ratcliffe.” Colonial home of the Hollyday family. 1048-343 wacs ,ﬁg()&amp;, ta :/r:iteamr; v;?—sgs oef?ﬁ,v: ,Ea?ion’;‘f’;',ft?,';nla%ﬁﬂ';J,'ty'{;ga' 22‘; Herd typical of Maryland’s fine food products<br />\nWhtgﬁe ilan:. Frazier was captured by the Indians in 1754. Original house 312-644 “Whitehfll.\"fT(';he home of Governor Horatio Sharpe, considered the finest 959-431 Williarp Perp‘n's visit 'R 1682 to the Friends Meeting House, the oldest frame 1058-346 example of late 18th century military architecture, with bastions forming<br />\nstill standing. example of Colonial country houses in Maryland. meeting house in America. a five-pointed star. e ’ 3 3 :<br />\nOld Fording Place across the Potomac of the Warriors Path, and site of the 347-622 “Widow Ramsey’s Tavern,” on the General’s Highway. 909-443 ““Canterbury Manor.” Laid out for Richard Tilghman 1659. 1060-323 Fort McHenry is open to the public daily throughout the year, including . ; 3 Homewood”, on campus of Johns Hopkins University<br />\nStockade Fort of Col. Thomas Cresap. Washington stopped here many Washington and Rochambeau passed over this road on their way to York- 920-431 Oxford, one of the first towns and ports authorized by Assembly in 1683. 1036-313 Sundays, from 7:30 a.m. to 5:30 p.m. The museum buildings are open Point to Point Racing, a famous Maryland sport<br />\n times. 3 : A town. “Hole in the Wall.” Early name of this village located near Whitemarsh 1062-315 between 9 a.m. and 5 p.m. An admission fee of 10 cents is charged to<br />\nThe Warriors Path.” War path of the five nations of Indians of New York 366-678 Route taken by Washington on his way to Annapolis to resign his com- 906-446 Church where Robert Morris’ father lies buried. \\Llngltt:qsamg;ersﬂ:)?naﬁi?gr:dﬁﬁggég:g:pghat me;qbers P g;ﬂugs<br />\n. State to the (Earollna I\\{Ilour.\\tgms. _ * L. mission. (Bronze tablet at Severn cross roads). ““Compton.” Home of Governor Stevens who welcomed General Lafayette 888-161 given speycial servic% if arrangements are ,:,g:;;z\\z;t'mf,:;gggzﬁe‘%enf<br />\nOaltdBr:aMI;eEmtS;r!:ggn%V \\\\‘ISIted by Washington in 1769, while visiting 450-680 “Belvoir.” Rochambeau’s troops camped here on their way to Yorktown. 918-434 at Fort McHenry 1825. Address: Baltimore, Maryland. :<br />\nrkeley Ings, W. va. “Three Mile Oak.” Portion of the old h iti i h ““Crosiadore.” The home of the Dickinson family f 1695 to the t 1058-291 : : :<br />\nSite of Tonoloway Fort. Built 1755 as a protection against the Indians. 463-686 General Washington in 17083 onohistrwer:ywtoerrgs?gr:zﬁ?ssc(gnﬁg?s?g“s . . time. Dickinson College at Carlisle, Ps, wasn;\\la%erg?fter Johon oacﬁ?ﬁigﬁ Cwisgﬁ%ﬁ‘c’f%f%':ﬂm%ﬂ'% %ﬁmﬁ:ﬂzﬂlﬂowﬂ%tren:otomac_ River from 321-666<br />\no § ! ’ . A . . . . \" and, occ<br />\nIt now belongs to the State. _ Birthplace of Johns Hopkins, May 19, 1795. Founder of Johns Hopkins 894-440 Cambridge. Originally part of the “Choptank Indian Reservation.” Made 1063-270 right-of-way totalling 5,253 acres, and is adnzinistered ua{)s,'e;a?tn:f\"t%v;<br />\nSthoTsP;%r;afsorle;gn,Tl;lgncock- Founded 1835. During 1861-62 used as a 472-680 Hospital and University. a port of entry 1684. - National Capital Park System. This old waterway, one of the least altered<br />\n0ps. “Elk Ridge Landing.” An i i i 3 \"“Appleby.” The home of Governor Thomas Holliday Hicks. 1063-263 of the older American canals, is an example of the ever-improvi<br />\nRoad to Fort Frederick. Built 1756. Stone fort of Colonial days in America. 517-659 mbaccofJ B B0 Trontam Do S Snin phiwment o SR “Tf\\z T:eaty Oak.” Where the earlyoseitlerg ::o?f/err;cd swith Choptank 1048-270 of transportation that helped to bind the Nation toget’l‘e\"—)r'r\\{‘lfr:’g“g\"’e?az<br />\nGen. J. dEt hB. I\\?t;\"art’? '%avzlrgl on (h)ist ril(i)d 1ati;‘t;%r the Battle of Antietam 524-662 “Spurrier’s Tavern.” Visited over twenty-five times by Washington. 857-482 Indians for the purchase of land. ng/zrzlag::gatgheewlar{dgnﬂt‘fai\\llv ?:f)tloarrifglr(?:g:r{ :(P’\\:dPg;?‘r:Iacrgli::;dviéllzy<br />\ncrossed the.i¥ationa’.ipag here, Ust. 10, . : “Montpelier.” The Colonial home of Col. Thomas Snowden 844-448 “Old Trinity Church.”” Built prior to 1670 1042-272 s : . ! Rl<br />\nA - . V8 ; % % % ] - ! . | 70, graph and telephone, and the modern superhighway. By these constantl<br />\nThe Federal signal s'tatlon on the top of Fairview Mountain was captured 528-662 The first telegram ever sent in the world passed this spot May 24, 1844. 838-453 ‘“‘Choptank Indian Reservation.” The first Indian Reservation in America, 1082-254 improving modes of communication the once widely separated easterz<br />\nby J. E. B. Stuart Iry, Oct. 10, 1862 P V. e<br />\nSR ¥ Fu . SEET Sy, S5 Y, i “Van Horn’s Tavern.” A Colonial Inn at which Washington stopped many 834-448 1669. and western regions of the fast-growing Union were firmly linked both<br />\nT'c'e Blanlé _ﬁoad : g)unltt : bew;et%n 1816-21|. ff-'tnnapcg(:‘ bty the Banks of 570-664 it Rehoboth, granted Richard Lee of Virginia 1673 (2350 acres). The ancestor 1142-272 Eocia”ytand coomgefcia('jws- Twentmtwolm“eshof the old canal, between<br />\naryland in consideration of the renewal of their Charters. “ , »” : . : : f th i eorgetown, D. C., and Seneca, Maryland, have been restored by the<br />\nB La's it IS adghured hisre, Suliinier 15, 1008 i Tl:hodes (Tj'ax/er'n, : Geor%e Washington’s last stopping place in Maryland. 820-403 \"Uonntaczt:s,e;;:n':)ﬂna'mérr]:;;e?(?rv.o?;z?a;asrlg‘c;:: \"”na;i::se ?:v:‘demh'ere b flatane National Park Service. Specially conducted tours via an old-time mule-<br />\nGen. J. E. B. Stuart attacked &amp; large Penneylvania force hore September 572-644 “Re secon gr,l’cu tural College in the We_;stern Hemisphere started 1754. 816-419 1677, X ’ dCrawn. bargéa a{e av:_llqble fgnhghe canal during the summer months.<br />\n20, 1862, but being outnumbered retired across the Potomac. ossburg Inn.” A famous Colonial stopping place. 820-403 “ ) ” ; : anoming, boating, \"ikings filing, picicking, osture walks, and ice<br />\ne, s ) \" N : “Adelphi Mill.” Built 1796 Patty Cannon’s House.” where the noted kidnapping group had head- 1168-296 skating are among the recreational opportunities. Canoes and rowboats<br />\nWilliamsport. An important point during the French and Indian War. It 568-644 ) S - 812-420 quarters. Described in the novel “The Entailed Hat.” may be rented at Great Falls; and privately owned canoes are permitted<br />\nwas considered as one of the sites for the capital of the United States, “Bladensburg.” Site of the Battle of Bladensburg, War of 1812. 820-403 “Green Hill Town and Port,” authorized by an Act of Assembly, 1706 1150-176 on the canal. Address: The Superintendent, National Capital Parks,<br />\nbut George Washington chose the site of the present Washington, D. C. e benbls, | The home and school of the Flev. Jonathan Boucher, 848:388 Birthplace of Commodore Stephen Decatur, January 5, 1779, 1310-180 RS NSPI TN N<br />\nThe Long Meadow. Originally patented in 1739 to Colonel Thomas Cresap. 582-682 © tutor of Jackie Custis. ek ’ : Sk G 4 5 i v<br />\nMason and Dixon Line. The 105th Milestone erected in 1763. The 104th, 597-688 “St. Barnabas Church,” erected in 1774. Washington and Governor Eden 868-359 A{S‘Ilél;?l)nokonson (ndian Town). The larpast indian town in Maryland 1227161 Cizggzwat’:lsqggég;g?:&amp; raslrﬂgmslgrﬁﬁycg”y¢(§8E£ego¢;ilgfn;?; oe—<br />\n103rd, 102nd and 101st with M. on the Maryland side and P. on the attended services here together. Piades i frein R B e Matend es s elevation from 500 to 1,890 feet. It is located in northern Frederick<br />\nPennsylvania are all visible along the road. “Northampton.” The birthplace of Albert Lord Fairfax. 874-418 “Birthol gof T N e OISRy . 1590-139 County, 16 miles north of Frederick near Thurmont, Maryland, on U. S.<br />\nMason and Dixon Line. The 100th Milestone. One of the “Crown’ stones 617-688 ““Queen Anne.” A post town in 1707, where Washington stopped. 891-387 “Rnrt . ace-? S A S - D_eclaratvqn v Independe_nce. PRI gl g A g, p'cnmkm:g’- R T . -<br />\nset every five miles. On one side Lord Baltimore’s coat of arms, and “Tulip Hill.” Colonial home of Samuel Galloway, built in 1756 932-372 lehobeth.” It was here that Francis Makemie established Presbyterian- 1185-075 are among the recreational opportunities. Three organized group camps,<br />\nWilliam Penn’s on the other “Paniings’ TEvom.” Washington disbdhe 'S iy 26‘ 773 016-386 ism in Maryland. developed on the modern ““unit” plan, are available to civic, social, and<br />\n&gt; g re on September 26, ; - “ ¥ : 2 e o B |<br />\nGen. Robert E. Lee entered Hagerstown Sept. 11, 1862, along this road. 610-660 “Larkins Hills,” where Lord gBaltimore and the Asspembly met, 1683. 914-388 Make Peace.” One of the finest examples of early Colonial houses. STNO ir:{;grlrg‘:zig{g?g:z:ﬂgptstgm é(;sri‘slf(?e?ci?i?i(i:sc?r:ntpr:ggc::#;’:’in%?u%:i?ggg-’<br />\nHarpers Ferry Bridge where John Brown crossed in his raid on Harpers 592-542 William P to the h c ; Maryland-Virginia Line. One of the boundary stones and one of the 1220-066 ing cabins, unit lodges with outdoor kitchens, sanitary facilities in<br />\niam Penn came to the home of Colonel Thomas Tailler on December 908-376 “Marri T Pt located th t i ini i<br />\nFerry, Oct. 17, 1859. 13, 1682, for his first conference with Charles Lord Baltimore as to the TN RN TR S e e each unit, central dining hall and kitchen, central shower house,<br />\nWashington-Frederick County Line. Washington County was the first 608-546 location of the Maryland-Pennsylvania Boundary Line swimming pool and infirmary. The sleeping quarters are equipped with<br />\nCounty in the U. S. named for the Father of his countr ¥ . 2 ¥ iron cots, but campers must provide their own mattresses, bedding,<br />\no 2 e B ; g William Penn attended a meeting of the Friends (Quakers) at Thomas 932-358 kitchen utensils, and dishes. Address: Superintendent, National Capital<br />\nCrampton’s Gap” and_ ‘“‘South Mountain,” an important battle of Sept. 619-573 Hooker’s in 1682. STATE FORESTS AND STATE PARKS IN MARYLAND Parks, Interior Building, Washington 25, D. C. $<br />\n14-15, 1&amp;62. Sl)t( U. S. markers mark the spot, and a large stone arch Marlboro County seat of Prince George’s County since 1720. 870-358 HAMPTON NATIONAL HISTORIC SITE 913-575 M ttoF i s<br />\n“Ncro:ms dchres £ the h f G Th Sim L Site of home and grave of Dr. Beanes whose arrest by the British in 1814, 862-352 The state parks of Maryland were selected for their scenic o~ historic values and for T v onument to Francis Scott Key-._AUthor .Of the ““Star Spangled<br />\needwood Forest,” the home of Governor Thomas Sim Lee. 634-576 indirectly provided occasion for Francis Scott Key to write the ““Star their recreational possibilities. The state forests were established primarily for ' —in Frederick<br />\nBraddock’s Heights and Braddock’s Spring, marked by a bronze tablet 658-579 Spangled Banner.” conservation, but they also afford extensive recreational opportunities. For detailed THE APPALACHIAN TRAIL<br />\non a large boulder. The first Bishop consecrated in the United States, Thomas John Claggett. 870-345 information regarding cabin rentals, seasons of use and description of accommo-<br />\nWhere Gen. Meade took command of the Federal Army. 684-566 Birthplace of Archbishop John Carroll. 877-343 dations, write to Department of State Forests and Parks, State Office Building, THE APPALACHIAN TRAIL, the longest marked and chartered footpath g33. 626<br />\nFrederick. (a) Site of the Brothers Tavern where Washington stopped. 685-576 Marking the route of Washington from Annapolis to Mt. V in 1783 Annapolis, Md. in the world, extending from Maine to Georgia enters Maryland at Pen<br />\n(b) Statue at grave of Francis Scott Key. (c) Tablet at old barracks “ ” 9 i SRAVES S0 (N ‘Veraim. Ix 1700, e Iny CEDARVILLE STAT : ) Mar, stretching thirty-eight miles to Harpers Ferry. A fully equipped<br />\nbuilt in 1777. (d) Tablet at corner of Church and Market Streets. (o) Melwood Park.” The home of Ignatius Digges and Governor Thomas 849-354 s ATE FOREST, 3,510 acres, Charles and Prince George’s 850-294 shelter and five lean-tos are available for the hiker. Many points of<br />\n: T . Sim Lee. Counties, off U. S. 301, 5 miles southeast of Brandywine. The Zekiah : include the first monument to George Washington near Turners<br />\nTaney House (Bentz Street). (f) Barbara Fritchie House. For additional % = : : Swamp, msandering streams and mixed pine and hardwoods feature this oot gl Rii-eddy « 9 d th nificant<br />\ninformation apply at Hotels and Chamber of Commerce. Mount Airy,” The home of Benedict Calvert, whose daughter married 854-348 e . e p : : Gap, a stone arch erected to news correspondents, and the magn!<br />\nG f : ; Washington’s stepson. area. Limited facilities for picnicking and camping, forest roads and trails panorama of the Potomac at Weverton Rocks. Address: The Potomac<br />\n(Wei;r;_'%rlddgggtstogcsm:lyow:s, t\\;\\(r)&amp;:grge\\rlgashmgton stopped several times. 688-604 “Mrs. Surratt’s House.” where John Wilkes Booth stopped to secure 829-339 for hiking, hunting in season. Address: Forest Supt., Brandywine, Md. Appalachian Trail Club, 1916 Sunderland Place, N.W., Washington 6,<br />\nCatoctin Furnace, an important Iron Eaivinse during the Revolution, 1776, 678-636 ammunition. DONCASTER STATE FOREST, 1,464 acres, Charles County, west of La 743-246 D.C.<br />\n- i V- o lon, . “T. B.” The initials of Thomas Brooke on a boundary stone at Brookfield. 834-316 Plata and 114 miles east of Doncaster on State 6. Virginia pine forest. For G | Information<br />\nJug Bridge,” where Lafayette was met by the Citizens of Frederick, 1824. 696-571 Y . g iti ionicki i : OEAARREEN, AN<br />\nHeadquarters of Generals Robert E. Lee, Stonewall Jackson and Long- 688-566 “Dr. Mudd's House.” Home of Dr. Mudd, who set the broken leg of John  862-255 fLol:n;\\t?(d oppgrtutn|t|e§ 44 ptcnlctxgg - ci_mpmtg,sfor?stéoads atnd trl\\a)lllciis About Maryland, Write<br />\n; : k. b Wilkes Booth. iking, hunting in season. ress: Forest Supt., Doncaster, : . :<br />\nstreet, Sept. 6-9, 1862 \" o . : . THE DEPARTMENT OF INFORMATION<br />\n“Monocacy Battlefield,” July 9, 1864. Apply for pamphlets at Frederick. 685-562 l%(; é?’g?ggkgozﬂna;;or. Surveyed in 1650 for Robert Brooke, Commander 866-298 ELI\\:(orThEeg:t. SCTJT;EerFca)r':;:sir‘\\r’w?l'gsczor?g;ﬁso'ncﬁic&amp;lngggr}E\\y’s;a;?)‘rie east of 1110-640 ', ARSI AR, s<br />\ni : rasame<br />\n[ nowozwa\nNOILOZT<br />\nV‘d |<br />\n“Carrollton,” 10,000 acres of land from which Charles Carroll derived the 686-516 ““Three Notch Road.” An early law provided that three notches marked on 920-190 ELK NECK STATE PARK, 995 acres, Cecil County, 10 miles south of 1088-602 m sz }‘ s<br />\ntitle, Charles Carroll of Carrolliton. trees indicated a road to a ferry. Northeast, traversing peninsular at head of Chesa;’)eake Bay, fronting s<br />\nRoute taken by Gen. Anthony Wayne in 1781 on his march from Phila- 670-528 Charlotte Hall School, continuously open since 1796. 863-230 both on bay and Elk River. Mixed pine and hardwood forest. Extensive Washington Monument, Baltimore<br />\ndelphia to Virginia. “Ye Coole Springs.” The first medicinal springs in America. 863-235 facilities for picnicking, limited opportunities for camping, swimming and daa g ’ Chapel, U. S. Naval Academy<br />\n““Amelung Glass Works.” First glass works in America was established 697-547 Benedict. British troops landed here August, 1814. 892-247 boating, housekeeping cabins with central toilet and wash house (for _L‘SO<br />\nhere in 1789. : k “District Line.” Point where Washington first entered Prince George’s 818-394 \\,;acatnon US?\\I only, by hzldvance reservation at Annapolis). Address: NDHOHS<br />\nSugar Loaf Mountain. So called by Baron Graffenried, a Swiss Nobleman, 690-524 County, Maryland (1751). ark supt., Northeast, Md. , Al \\SHBNN('\\ S<br />\nin 1710. G “‘Oxon Hill.” Home of the Addison family. John Hanson died here. 804-351 FORT FREDERICK STATE PARK, 279 acres, Washington County, off 518-646 e :<br />\n“Whites Ferry.” Important crossing of the Potomac during the Civil War. 652-482 “Broad Creek Church.” Mother Church of the District of Columbia, erected 800-336 U. 8. 40, 5 miles south of Clear Spring or Indian Springs via State 56<br />\nWoodstock. Farm owned by Washington at the time of his death. 702-472 in 1723. through Big Pool, entrance on State 44. Restored old frontier fort built<br />\nRockville. (a) Site of camping grounds of Braddock’s troops, 1755. (b) 758-456 Fort Washington built by Major L’Enfant who laid out the City of Wash- 792-320 of stone in 1756 during French and Indian Wars, also used during<br />\nJ E. B Stuart's raid: 1863; ington . Revolutionary and Civil Wars. Stone museum illustrates successive<br />\n3 g g i &gt; PP historical events. Facilities for picnicking, camping and fishing in Big<br />\nGreat Falls.of the Potomac. One of the most picturesque spots in Maryland. 729-425 Piscataway Town.” Visited by Governor Leonard Calvert, March 1634, 807-316 ; ; .<br />\nWestminster. The first complete county rural free delivery service in the 801-634 (before he landed at St. Mary’s) to visit the Indian Emperor. gg(r)ll( OSnug'tfi (B:rnlge sgg:lak&amp;;n s, I . -<br />\nUnited Sta_tes. Marshall Hall. Maryland landing of Washington’s private ferry. 772-310 - . s i<br />\nUnion Mills. Gen. J. E. B. Stuart’s Camp on June 29, 1863, and Gen. James 792-669 “Araby.” The Colonial home of Widow Eilbeck, whose daughter married 780-260 GAMBRILL STATE PARK, 1,088 acres, Frederick County, 6 miles north-  660-595<br />\nBarnes’ Camp on June 30, 1863, on their way to Gettysburg. George Mason. ;vf?gﬁd?; Freexdtgzgikv'e ’-{vluger\\]/v;&lt; n:\\?er? \"lv?:rsgmg M:,Tj ﬂ?ﬁf\"f\" 1,630”feet.<br />\n“Cookerly’s Tavern.” Washington stopped here on July 1, 1791. 712-619 “Widow Chapman’s.” Mt. Aventine on the Potomac opposite Gunston 770-288 Facilitie% for picnicking and hiking refr:sah%earllt buil(iﬁnge ﬁ;ﬂou:e g%sd. Ocean City, Maryland’s Sea Resort<br />\n“Terra Rubra.” Birthplace of Francis Scott Key. 710-619 Hall, Virginia. shelters (reserve in advance). Address Forest Supervisor, R.F.D. %5<br />\nOld Friends Meeting House, of which President Hoover's ancestors 750-632 ““Governor Smallwood’s Home.” Washington here in October, 1785. 742-256 Frederick, Md. : :<br />\nwere members. “Durham Church.” Built 1732. Rebuilt in 1791. 755-233 A ;<br />\nFirst Reaping Machine in the world was invented here. 761-631 “Washington’s Farm.”” 600 acres acquired by him in 1775. 738-226 G?JnHal;,gr\\::?edS;QI%ozﬁt?e}:’aloé;?;ﬁoﬁo&amp;fg ghhslt\\:é)euat:&amp;?e«g;g/ aéllgcg: sTeas<br />\n“Doughoregan Manor.” The home of Charles Carroll of Carrollton. The 830-526 “The Ret_reat.” Home of Daniel of St. Thomas of Jenifer. 795-248 tion of 930 feet. Located on the Appalachian Trail and surrouncjing the<br />\nlast survivor of the signers of the Declaration of Independence. ‘““Rose Hill.” The home of Dr. Gustavus Brown, one of Washington’s 795-248 Civil War Correspondents Monument, a national memorial. Undeveloped<br />\n“Ellicott’s Mills.” Terminus of the B. &amp; O. R. R. in 1830 857-522 physicians. but plans for development are now under way.<br />\n“Rolling Road.” a Colonial road built for the purpose of rolling hogheads 869-538 ‘“Habre de Venture,” the home of Thomas Stone, signer of the Declaration 800-266 GREEN RIDGE STATE FOREST, 25,451 acres, Allegany County, be- 360-650 T<br />\nof tobacco to Elk Ridge Landing. of Independence. : tween Town Hill, Polish Mtn. and the Potomac River, 15 miles east of =<br />\nPort Tobacco. The County Seat of Charles County until 1895. 795-248 Cumberland along U. S. 40. Elevations 500-1,800 feet. Roadside picnic e<br />\n“LadGr?‘nge,\" the home of Dr. James Craik, Washington’s lifelong friend 795-248 area near Forest Hdgrs., 15-mile Creek and U. S. 40. Undeveloped i<br />\nand physician. opportunities for camping, hiking, fishing and hunting in season. Address: i<br />\nNORTH CENTRAL MARYLAND “Sfamuel Cox’s Farm,” where John Wilkes Booth and his accomplice hid 804-229 Forest Supt., Flintstone P. O., Md. s<br />\n; 4 or several days. MT. NEBO—STATE FOREST AND GAME REFUGE, 1791 acres, 190-622<br />\nSite of Home of Governor Augustus W. Bradford which was burned by 906-564 Cedar Point. Washington’s schooner ran aground here in February, 1766. 844-156 located along U. S. Route 19 in Garrett C Tract admini i<br />\nConfederate troops on July 11, 1864 ; ; ” g9 Tt CONLY. LTI Sdministeres<br />\n5 \" p 5 o E Ay $ s 3 - “Laidlow’s Ferry.”” Washington crossed here many times on his way to 803-193 jointly by the Department of State Forests and Parks and the Depart-<br />\nGca':l\"'rs:h\" g‘;ﬁ??rzggurf;'éz Built for the Forest inhabitants of St. Paul’s 869-573 Williamsburg. ment of Game and Inland Fish. Undeveloped.<br />\n’ » 5 The birthplace of Roger Brooke Taney, Chief Justice of th i 19- ; ;<br />\nOld Court Road. The original road leading to the Court at Joppa Town. 871-560 1836-64[.) . e ST Jtinn of the Liine s SR PlﬂArEi?SsofrsoLATBglt'i: rﬁ?r}g’(])i?f“Ha:ﬁrlesf ?na;'g\"r“%'r‘:haxgs{\"g;”ﬂd SCO;\"‘ftr'gﬁ; 860-535-<br />\nT-h1°31%'d United States Arsenal. Built in 1816 after the close of the War of 877-562 “The Cliffs of Calvert.” One of the most picturesque spots in Maryland. 938-265 Elkridge, along Patapsco River between Relay and Hollofield. Extensive<br />\n- e e s 3 i s : “Preston on Patuxent.” Seat of the Puritan government of Maryland, 952-196 facilities for picnicking, camping, hiking, horseback riding and nature<br />\nThe Garrison Fort.” Built in 1695 as a protection against ho§tlle Indians. 869-573 1653-57. study, limited opportunities for swimming and fishing. Address: Park<br />\n”T;_g%afeaglg’ss Bf\\lrets;';' :arr‘te dofp ;;Tp:gtV:Irl‘?rg:) Jttzl’r!&amp;:gp!:‘aﬁ\"n\\'gmh was con- 927-594 \"hgattapany.” Site of 1st Jesuit Mission, later home of Charles (3rd Lord 965-162 Supt., lichester, Md. '<br />\ng st Y - 3 e altimore). POCOMOKE STATE FOREST, 12,377 acres, southwestern Worcester 1225-140<br />\nQump or Sweet_Alr. Patented 1704. Long associated with the Carroll 930-612 ‘““Manor of Cornwaley’s Cross.” One of the oldest homes in Maryland. 982-096 County, between Snow Hill and Pocomoke Clt,y in “Eastern Shore’’ area. Ba|t|m0re Skyhne Fort MCHem’ Baltimore B'(th |ace Of the “St r S ' d B 2 H ” f R d A l<br />\nfamily. House built about 1752 : e O : i Y, ’ p a pangie anner aill o ecordas, Annapolis<br />\n&amp; ol : : Saint Mary’s City. (a) Reproduction of State House of 1676. (b) Monument 963-129 Forest of bald cypress, southern gum, cottonwood poplar and loblolly . ?<br />\nTq%e??:)t:«;:in?ari‘:iaonudt zOftl;ltOVgt\\ qunqgg?'qoad- Authorized 1805, to rebuild 895-635 to Leonard Calvert. (c) Trinity Church, erected from bricks of first State pine. Milburn Landing Recreational Area on Pocomoke River, 7 miles ) bernt e 5 3 - ol i, : : e 5<br />\nK y the State in - X House of 1676. (d) Site of the 1st State House. (e) Governor Lionel Cop- northeast of Pocomoke City off State 364. Facilities for picnicking, e ot BBAL s &amp; bk el bl R e - i - - - Rl o - ’ B<br />\n40}!_;63hfélgstone on the Mason and Dixon Line, surveyed and marked 925-685 I(e))/’s Ftomg. (f) f\"(!:\\/lattapany Street.” thte (f;l:;st, I_l'oar:i owg in Maryland. %pportunitg_es forS campgng, Dhiking',: fishing and hunting in season.<br />\ng) “Freedom of Conscience”” monument. “Father ite”’ memorial. ddress: Forest Supt., R.F.D. #1 Pocomoke, Md. % : ; g : .<br />\n\"Bbl:gl': fl;!oor:‘s?\\‘;l':v$;rr\\i;’\"\\‘l\\l1h7g7r; Washington spent the night on his way 927-653 |(r|1) Mh:r;rlr;?‘:;?l(gaé%zg%orgjs) Ssé}inar{r:)sgirtnén(;r)ﬁrs(,{()csalttl'?oﬂz fgﬁtu;gll:l POTOMng STATEEIFOREST, 12,057 acres, southern Garrett County 150-560 Maryland’s State House, Oldest Capitol in use in the nation, Annapolis The Hager House—Home of the Founder of Hagerstown<br />\nSt. James Church, My Lady’s Manor, started 1750. (no marker). 921-628 St. Mary’s Female Seminary. The State’s 200th anniversary memorial 963-129 ggfitng th: lgg?:ﬁ\\acegiavté?nir:&amp; one%??%égﬁ%olnnethv;lgn?e:lttl)?\\?;s’S?aqz ?gg—<br />\nClynmalyra, 5,000 acres surveyed 1705 for Charles Carroll, Lord Balti- 908-636 established 1839. 3 : i Roads and trails provide access and opportunities for camping, hiking,<br />\n- more’s Attorney-General; in 1822, his great-great grandson Henry P%ln(} L0t0k0u_t- Site OJ.PJISOH Camp during Civil War; where 3,000 Con- 995-075 fishing and hunting in season. Forest Hdgrs. near Tasker Corners.<br />\nederate k : i<br />\n”aant)lld bun:n the h?,u?(e).ooo s T i . Cler:entg;--?:lr:;r: F|ierst i atase of ia i i T Address: Forest Supt., Deer Park, Md. The Old Chesapeake and<br />\ny Lady’s Manor.” 10,000 acres owned by Lady Baroness of Baltimore. the D March 25. 1634 ap SANDY POINT STATE PARK, 725 acres, located on Chesapeake Bay at 970-433<br />\nBel Air. County seat of Harford County since 1783. See portraits and 984-620 e Dove on March 29, . Sandy Point in A Arundel C U R i -<br />\n- = 3 p andy Point in Anne Arundel County on U. S. Route 50. Work is pro<br />\nmurals in Court House and Post Office. Deep Falls.” Home and burial place of Dr. James Thomas, Governor of 862-195 ceeding on the development of this park.<br />\n“Harry Gilmor’s Raid.” A serious Confederate invasion of Maryland. 975-608 Maryland (1833-36). . ;<br />\n“Jerusalem Mills.”” Established in 1772 by David Lee, a Quaker from 972-594 “The Monastery.” First Carmelite convent in U. S. Founded 1790. 804-268 SAVAGE RIVER STATE FOREST, 52,672 acres, northeastern Garrett 173-335<br />\nBuck,s County Pennsylvania. “The Old South River Club.” Oldest Social Club in America. 923-392 County. Elevatlon_s 1,400-3,000 feet. 1 mile east of Grantsville on U S.<br />\n3 ’ o 40, turn south 5 miles to Forest Hdqrs. at New Germany. In two sections,<br />\nThe House of Ishmael Day.” who shot a Confererate Cavalryman at- 975-608 ; ; ;<br />\ng - i 3 . S 4 one on Negro Mountain near Keysers Ridge on U. S. 40, and one in the<br />\ntempting to pull down his Union flag during Harry Gilmor’s raid. Savage River watershed between Meadow and Big Savage Mtns.<br />\n“The Sweathouse Road,” called from the Indian p.ract'l'ce of throwm’g' 960-588 . EASTERN SHORE Recreational areas with cabins (for vacation use only, by advance reser-<br />\nwater on heated stones to generate steam, an Indian ”Turkish Bath vation at Annapolis), campsites and picnicking facilities at New Germany<br />\nfor a curative purpose. : , and Big Run. Swimming in 13-acre lake at New Germany. Skiing facili-<br />\nPe':ry Hall. Trt‘ne h(:mntzj of Harry Dorsey Gough. One of the largest colonial 951-375 \"TRO P!ODflf;ggs of the Susquehanna Canal” one of the first canals in 1048-659 ties include open slopes with rope tow, downhill and cross-country ski<br />\nouses in Maryland. merica, . trails and ski lodge with cooking and sleeping accommodations for 26<br />\n“The Joppa Road.” An old Indian trail used as a route to Joppa, the 958-572 ‘‘Susquehannock Indian Fort” (site of an important point in the contro- 1042-668 persons at any time of year (organized groups only, by advance reserva-<br />\nCounty seat of Baltimore County 1712. versy between Penn and Lord Baltimore). tion at Annapolis). Address: Forest Supt., Grantsville P.O., Md.<br />\nThe Baltimore and Harford Turnpike, built 1816. 950-590 “Smith’s Falls.” In 1608 Captain John Smith ascended the Susquehanna 1040-658 3<br />\nSt o Nrt P Sutember 1214 e e i o o o, TALy Ty poRSET, 20 gy e Sfan ikt<br />\nBritish attack on Baltimore on the Battlefield of North Point. 943-528 cumn}mgthaé/ern. :‘Nhere’?ochambeau s heavy artillery camped before 1070-658 ary of West Virginia. Elevations 2,200-2,900 feet. Recreational areas at<br />\nBaltimore. For information regarding points of historic interest apply to 908-533 . SO SN SRS — E . Herrington Manor, Forest Hdars. 5 miles from Oakland, with cabins (for<br />\nthe Mayor and City Council, Association of Commerce and Hotels. Richards’ Oak.” Lafayette’s troops camped under this tree in 1781. 1049-679 vacation use only, by advance reservation at Annapolis), bathhouse and<br />\nRochambeau’s Camp at Whitemarsh on his way to Yorktown, 1781, and 960-565 West Nottingham Academy, founded 1744, by Dr. Samuel Finley, who in 1061-671 beach for swimming in 53-acre lake, and at picturesque Swallow Falls<br />\non his return to the north. 1761 became the President of Princeton. aﬁd Mll:ddy Creek Falls (highest in the State) 3 miles beyond, with trails<br />\na v : = . : “Nottingham Lots.” Important in the controversy over the Mason and 1074-690 through virgin white pines and hemlocks, picnicking facilities, opportuni-<br />\n'S'ate of “The Red L'fm vaern where Washington stopped over 25 times. 966-554 Dixong Line. g v ties for camping, fishing and hunting in season. Address: Forest Supt.,<br />\nThe Gunpowder River.” So called as early as 1660. 993-550 . . ; P g Oakland, Md<br />\n“Joppa Town.” County seat of Baltimore County, 1712 to 1768. A port 982-584 “Brick Meeting House,” Established by William Penn in 1702. 1086-683 T e<br />\nfrom which tobacco was shipped to England. L(;ng the rival of “Balti- “Blue Ball Tavern.” Established in 1710, by Andrew Job. 1112-680 WASHINGTON MONUMENT STATE PARK, 96 acres, eastern Wash- 624-608<br />\nmore Town.” “New Munster.” 6,000 acres granted in 1683, to Edwin O’Dwire and 15 1133-681 ington County, 2 miles east of Boonsboro, then 134 miles north of U. S.<br />\n“The Gunpowdér Neck.” One of the earliest settled portions of Baltimore 998-565 other Irishmen. 48 am Zhtisatown. EAeae Sigpiecio S sops of. South Mn.,<br />\nCounty, now the site of Fort Hoyle and Edgewood Arsenal. Perryville, Cecil County, terminus of the “Susquehanna Lower Ferry.” 1060-630 elevatlog 1§°0 feet. Extensive views from restored 30-foot stone monu-<br />\nBirthplace of William Paca, signer of the Declaration of Independence.  997-588 Rochambeau’s troops camped here on their way to Yorktown in 1781. e s L S e T T<br />\nCapt. John Smith ascended to this point 1608. 1014-596 e et WRE. - S5O0 Jiren, $ne SERRYRAG'S Tergat Manirs, 1COMEN Range to the east, Located on route of the Appalachian trail. Museum—<br />\nSophia’s Dairy. Built 1768, by Aquila Paca. 1020-600 The Principio Qompany. The first iron works in America (1715): 1072-638 refreshment building, and facilities for picnicking, including shelters (re-<br />\nSite of “Old Baltimore,” 1683. 1st County Seat of Baltimore County. 1011-594 Charlestown. Laid out in 1742. Washington stopped here many times.  1087-636 serve in advance). Address: Park Supt., Middletown, Md.<br />\n“Spesutia P. E. Church” (St. George’s Parish). Founded 1671. 1025-599 North East. Site of the iron forges of the “Principio Company. 1099-645 WYE OAK STATE PARK, 1.5 acres, northern Talbot County near Wye 1061-405<br /><br />\nElkton, originally called ‘““Head of Elk”, Important during the Revolution. 1129-648<br /><br />\n“Constant Friendship” Owned by Col. Thomas White, father of Bishop 995-598 Mills on U. S. 213. A nature mounument preserving 400-year-old white<br /><br />\nWilliam White. The old “Post Road.” where it crosses the Maryland-Delaware Line. 1143-648 oak, said to be the largest of this species found east of Mississippi River i i ; | i I ‘ . ; i<br />\n“Cokesbury College” the first Methodist College in the world established 1014-604 ““Bohemia Mannour.” Patented to Augustine Hermann in 1662 “for making 1110-608 with circumference ofgs7 feet, 7 ir?ches—% foot above ground,pl?eight of Proposed Chesapeake Bay Bridge u.s. ‘Naval Academy, Annapolis The Government House, Home of Maryland’s Governors, Annapolis The Hammend-Harwood House, Annapqhs Fatri-scane n wth Westecn: Macsanahills DO SO MATVISNT'S I T, e P<br />\n1785. the Map of the Province of Maryland.” 95 feet and spread of 165 feet. State Tree of Maryland.<br />\n.-f.‘<br />"}], "field_media_file": [{"target_id": 52364, "display": null, "description": null, "target_type": "file", "target_uuid": "2d42321b-bce1-4f43-9267-a505d0e491e9", "url": "http://digital.library.jhu.edu/system/files/2022-03/16210-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 16210, "target_type": "node", "target_uuid": "dfe211a3-63dc-4f3c-a9a9-084196db9ec0", "url": "/node/16210"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "9e4250c3-5657-4d2f-abe0-a45f66b0938f"}]}