{"mid": [{"value": 37025}], "uuid": [{"value": "e41e5361-264f-4c94-884d-6eb87bd67be9"}], "vid": [{"value": 37025}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:58:11+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13146-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:58:11+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:58:11+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "LT<br />\n<br />\nVOL. X__XIX, No 16<br />\n<br />\nHOMEWOOD, BALTIMORE. MD., NOVEMBER 26, 1924<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHOPKINS MEETS MARYLAND<br />\nW. F. ROBERTS ADDRESSES HOPKINS REPRESENTED AT FIRST HOPKINS COTILLION<br />\nWILL BE GIVEN ON<br />\nNEW YORK CONFERENCE<br />\nASSEMBLY ON THE STEEL<br />\nBY FONDA<br />\nDECEMBER 12<br />\nINDUSTRY TODAY<br />\nGives History of Steel and Iron and Conference to Attempt to Improve In- luia Will Supply Music for Dance,<br />\nterfraternity Relations, and Discuss<br />\nWhich is Crowning Social Event<br />\nDescribes Their Production in AnFraternity Problems<br />\nof Pre-Xmas Season<br />\ncient and Modern Times<br />\n<br />\nBLUE JAYS WILL FACE OLD LINERS AT STADIUM<br />\nTOMORROW IN ANNUAL GAME<br />\nSeason Closes Following Biggest Clash of Year; Van Orman to<br />\nSpring Surprise Attack to End Season Successfully<br />\nThe curtain will come down on the 1924 football season at Johns<br />\nHopkins after the Maryland game. Whether it will be a success or<br />\nfailure depends on tomorrow's result. Although the Blue Jays have<br />\nlost only to the strong Pittsburgh team this year their season cannot<br />\nbe crowned with glory unless Maryland is subdued.<br />\nMaryland is equally as determined to carry off the laurels at the<br />\nStadium tomorrow. They were taught a lesson last year, when the<br />\ngame appeared so one-sided on paper only to have the battle of their<br />\nlife to stave off defeat. The Old Liners' desires to turn the tables<br />\nhas caused the contest to be the goal of Maryland's grid season.<br />\nIn short, the success or failure<br />\nVARD CLUB GETS BREAKS of both Universities' teams is<br />\nAND TRIMS FROSH<br />\nhinged about tomorrow's conflict.<br />\nRealizing what an attack is<br />\nFreshmen Team Loses by 19 to 0 Score<br />\nin Game With Athletic- Mb;<br />\nneeded to penetrate an eleven oi<br />\nSchwartz Stars Again<br />\nMuch to the surprise of the Maryland's strength, Coach Ray<br />\npromising Freshmen eleven the Van Orman has brought from up<br />\nVard Athletic Club scored a 19 to his sleeve many new plays intend-<br />\n<br />\nThe Interfraternity Conference, With the Maryland Casualty<br />\nannual gathering of Greek-letter Club House for a stage, the evefraternity men from American col- ning of Friday the twelfth of Deleges and universities, is to be held cember for the time, and colorat the Hotel Pennsylvania the 28th fully dresed young women with<br />\nand 29th of this month. This con- their \"tuxedoed\" escorts, for the<br />\nference, established in Chicago in actors, the first formal cotillion of<br />\n1909 with the purpose of foster- the season, under the auspices of<br />\ning a closer interfraternity 'spirit the Johns Hopkins Cotillion Club,<br />\namong the American colleges and will be enacted. Tickets were<br />\nuniversities, is this year in combina- placed on sale yesterday for this<br />\ntion with the Intercollegiate Inter- ball, which is generally considered<br />\nfraternity Conference. In. this way, the crowning social event of the<br />\nAncients Used Iron<br />\nalumni, faculty and undergraduates Johns Hopkins fall season. StuBegining with a discussion of are drawn closer together in their<br />\ndents are urged to immediately<br />\nthe use of iron in the past, Mr. work for national relations,<br />\ncollege purchase stickets, the demand for<br />\nRoberts commented upon the long relations, and intercollegiate relawhich is expected to exceed those<br />\nhistory of the metal. He pointed tions between fraternities.<br />\nof all previous years. The price<br />\nout the fact that there are referFifty Fraternities Represented<br />\nof admission has been set at $4.00<br />\n0 win in last Saturday's contest, ed to cross the defense of the opences in 'the Bible to objects<br />\nThere will be represented in the a couple and $3.00<br />\nstag.<br />\nTwo \"breaks\" in the first quarter position. With a comparatively<br />\nmade -of iron and that many bar- conference more than fifty -fraterMusic<br />\nby<br />\nlula's<br />\nOrchestra<br />\ncrave the visitors two touchdowns easy schedule all season there has<br />\nbaric tribes, without knowing the nities, and more than half a million<br />\nThat the alcoves of the spacious before the 1928 team had even been no<br />\nmeaning of ferrous oxide, found a college Men. About three hundred<br />\nneed for other than alnon-technical way of getting the delegates are expected to be in at- Maryland Casualty ballroom will gotten warmed up. A fumble on<br />\nmost straight football by the<br />\nmetal from the ore. Crude im- tendance, about fifty of whom will resound with the highest type of the second play of the game and<br />\nHomewood eleven. Tomorrow,<br />\nplements were found in ancient be college undergraduates, each dance music, there is not the an intercepted forward a few minA.syria and in the. Pyramids. La- representing the Interfraternity slightest doubt, as an orchestra of uates later were the lapses of for- however, the Blue Jays intend to<br />\nter, in Medieval times, iron was Council of his college. A number eight musicians, led by \"Bob\" tune which seemed to take the unleash a variated attack that has<br />\nused extensively for military pur- of prominent educators, including Iula, will furnish the syncopation. spirit out of the Frosh.<br />\nbeen two weeks in the making.<br />\nposes.<br />\nseveral college presidents, will meet Mr. Iula's orchestra is well known<br />\nAfter this disastrous first quar- Whether or not it will effect the<br />\nThe first improvement in meth- with the fraternity representatives to Baltimoreans as one of the fin- ter the Hopkins youngsters bat- Maryland<br />\nline, which has been<br />\n0d of manufacture came in the and the group of undergraduates, est musical aggregations in the tled their opponents on fairly even<br />\ntempered by such teams as Yale,<br />\n14th Century when a clay fur- to discuss college- and - fraternity city.<br />\nterms. Schwartz, who scored the<br />\nV. P. I. and Washington and Lee,<br />\nFollowing the custom adhered lone<br />\nnace and a hand-bellows were de- problems.<br />\ntouchdown of the Poly game,<br />\nwill be the turning point of the<br />\nvised. This, of course, involved<br />\nAs the result of the suceess of to in former years, attractive fa- was again in the limelight.<br />\na slow and painful process and a an experiment tried last year, a vors will be presented to the wogame.<br />\nThe Vard Club team showed<br />\nsmall output. Today, Mr. Rob- new fraternity will probably be men. Although the character of<br />\nNew Attack Kept Secret<br />\nexcellent team work for this type<br />\nerts said, the average blast fur- formed at the conference. The these Balfour favors has not even<br />\nVan Orman has taken great<br />\nnace produces from 600 to 700 number of collegre students desir- been made public, it is certain that of aggregation. Their best weapon<br />\nwas<br />\na<br />\nwide<br />\nwell<br />\nend<br />\nrun<br />\nwith<br />\npains<br />\nto keep these new plays untons of metal every—twenty-four ing fraternity affiliations is increas- they will, as in other years, add a<br />\norganized<br />\ninterference.<br />\nThe<br />\nder cover. This was a wise prehours. Iron ore, coke,. and lime- ing so rapidly that they cannot be touch of beauty to the affair.<br />\nFreshmen ends were at a loss to<br />\nstone are dumped into the top of accommodated, with the result that<br />\ncaution, perhaps, for after dark<br />\nPrizes Will Be Awarded<br />\ncope with this play and frequent<br />\nthe furnace and great blasts of the Interfratemity Conference is<br />\nthe patrollers of Homewood have<br />\nNo little excitement will be<br />\nsubstitutions made little differair are blown into the mass. In aiding groups of locals to band to- caused at the cotillion when<br />\nthe ence. The Vard<br />\nClubbers showed already been forced to chase men,<br />\nburning, certain chemical changes gether. Nearly a score of locals winners of the June Week chances<br />\narmed with pads and pencils, from<br />\ntake place which reduce the ore. from all parts of the country are will be determined. For some time up as much faster than their opThe liquid iron goes to the bot- anxious to .start a new national fra- the 1925 June Week Committee ponents but were slightly at a dis- the shelter of the hedges.<br />\nadvantage in the center of the line<br />\ntom and is drained off into ternity.<br />\nMaryland, likewise, has also<br />\nhas offered Hopkins students the<br />\nwhere the Frosh weight was cen- been holding<br />\ntroughs. The remaining products<br />\npractices in secret.<br />\nA committee of the Interfrater- opportunity of taking chances on<br />\nform a slag which is disposed of nity Conference has been at work three prizes offered by that com- tered.<br />\nCurly Byrd is a coach whose cunThis was the last appearance of ning is not to be taken lightly. It<br />\nas waste matter.<br />\nfor- a year investigating • what the mittee. These prizes which give<br />\nPassing on to the • subject of ideals and aims of college frater- credit in the Barn Store, managed the 1928 eleven at Homewood be- is not necessary to fool him twice<br />\nsteel, Mr. Roberts outlined mod- nities really are. This committee by Thomas Magill and Douglas fore the Sophomore game on De- and he will more than likely be<br />\nContinued on page 4, col. 1<br />\nprepared for all manner of tricks<br />\nCantinued on page 3,(0!. 1.<br />\nTurnbull, and amount to: first, cember 6.<br />\nknown to football strategy. As<br />\n$50; second, $15; third, $10, will<br />\n$3,000,000 EYE INSTITUTE PLANNED<br />\nbe awarded to the holders of the ENGLAND AND LLOYD WILL the two teams are very nearly<br />\nequal in strength, the result of the<br />\nWITH DR. W. H. WILMER LIKELY HEAD three lucky chances. A prominent<br />\nHANDLE TRACK SQUAD<br />\ngame<br />\nseems to narrow down to<br />\nwill draw the lots. This event<br />\nJoe England, the South Atlantic<br />\nPlans for a $3,000,000 institute work, as well as a place where his man<br />\nfor the study and treatment of dis- abilities may be given wider scope is expected to create widespread quarter mile champion, who is the superiority in coaching and<br />\ninterest.<br />\nconceded to be one of the greatest the backing given the elevens by<br />\neases of the eye and for research during his lifetime.<br />\nRequired<br />\nPledge<br />\ncoaches of the country, together their rooters.<br />\ndealing with the causes of blindness<br />\nAn institute such as is now con\"Pep\" a Necessity<br />\nIn order to avoid the possibil- with Huntley Lloyd, also a faand allied ailments, were announced templated, it is said, will not only<br />\nmous<br />\nquarter<br />\nmiler,<br />\nsebeen<br />\nhave<br />\nCotillion<br />\nThe<br />\ndrunkenness,<br />\nability<br />\nthe<br />\nof<br />\nof Dr. Van Orman<br />\nity<br />\nrecently by Dr. Frank J. Goodnow, be the first of its kind ever estabcured<br />\nto<br />\ncoach<br />\nthis<br />\nthe<br />\nteam<br />\ntrack<br />\nPresident<br />\nas<br />\nJ.<br />\na<br />\naccording<br />\nfootball<br />\nClub,<br />\nto<br />\ncoach<br />\nneeds no extolPresident of the Johns Hopkins lished in America, but also the<br />\ncontinue<br />\nyear.<br />\nwil<br />\nteam<br />\nThe<br />\nto<br />\nling.<br />\ndemands<br />\nthe<br />\nTo<br />\nEdward<br />\nBrown,<br />\nget<br />\nspirit<br />\ninto the HopUniversity. The establishment is to equal of any in Europe or elseform a part of the Johns Hopkins where in the world.<br />\npledge of every Hopkins man to work out daily in preparation for kins rooters is the purpose of toMedical School and the Johns Hop- \"There is probably no field in abstain from any intoxicating the coming indoor season which night's bon-fire and \"pep\" meetThanks- ing. Maryland also has been hard<br />\nkins Hospital.<br />\nwhich the facilities of American liquor from noon of the day of the begins shortly after the<br />\nvacation.<br />\ngiving<br />\nat work encouraging their team<br />\nThe present intention is to place medical schools and hospitals are so dance throughout the day and<br />\nand rooters. After the game with<br />\nit under the direction of Dr. Wil- inadequate as that which deals with night. Dancing, according to the<br />\nNorth Carolina State two weeks<br />\nliam Holland Wilmer, of Washing- diseases of the eye,\" said President Cotillion Club president, will be<br />\nago they had planned a reunion<br />\nNOTICES<br />\nthe noted ophthalmologist. For Goodnow. \"Almost all our fore- from 9 P. M. to 1 A. M.<br />\nof all the old gridiron stars. The<br />\nthat reason the Wilmer Foundation, most ophthalmologists have - been<br />\nThe patrons and patronesses for<br />\nBonfire before Maryland game,<br />\nWednesday, November 26, at<br />\nof which Henry Breckinridge, of 2 trained in Europe. Today American the cotillion are: Dr. and Mrs.<br />\nuntimely snow storm put a slight<br />\non lot behind C. E.<br />\nP.<br />\nM.,<br />\n7:30<br />\nGoodnow,<br />\ndamper on the proceedings, but<br />\nDr. and Mrs.<br />\nRector Street, New York City, is medical students who have the am- Frank J.<br />\nHall. Freshmen bring boxes. Insecretary-treasurer, is co-operating bition and ability to excel in this Joseph S. Ames, Dr. and Mrs.<br />\nformal torchlight parade downnevertheless much was accomtown afterwards.<br />\nWith the Johns Hopkins authorities field must go to Europe to obtain John B. Whitehead, Dr. and Mrs.<br />\nplished in rousing spirit. Johns<br />\nin financing the project. The trus- the best training. Great ophthalmo- John H. Latane, Dr and Mrs.<br />\nHopkins has followed suit this<br />\ntees of the foundation are intent on logical institutes have been in exist- John C. French, Dr. and Mrs.<br />\nweek.<br />\nCopy for next issue of NewsLetter due today.<br />\nOsborn and Pugh of the Old<br />\nmaking the institute a permanent ence there for more than half a Charles Thatch and Dr. and Mrs.<br />\nMitchell.<br />\nBroadus<br />\nContinued on page 3, col. 3<br />\nmemorial to Dr. Wilmer and his<br />\nContinued on page 3 col. 2<br />\nThose who attended the Assembly last Thursday mentally<br />\nenjoyed a trip to Sparrows Point<br />\nconducted by Mr. W..Frank Roberts, with the help of numerous<br />\nlantern slides. Mr. Roberts is the<br />\nGeneral Manager of the Sparrows<br />\nPoint plant of the Bethlehem<br />\nSteel Company and as Dean<br />\nWhitehead said upon presenting<br />\nhim, he is familiar with every detail of the , methods employed in<br />\nthe manufacture of iron and steel.<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS - LL I I ER, NOVEMBER 26, 1924<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nPlayshop<br />\nFOUNDED 1897<br />\n<br />\nPRESENTS<br />\nSubscription<br />\n<br />\n$2.00<br />\n66 11<br />\n<br />\nF 99<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\n<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all artic7es and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\n<br />\nTelephone<br />\n<br />\nHomewood 0100<br />\n<br />\nEditor-in-Chief<br />\nR. CARMICHAEL TILGHMAN, '25<br />\n<br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\n<br />\nManaging Editor<br />\nALGER Hiss, '26<br />\n<br />\nAdvertising Manager<br />\nALFRED J. McKAY, '26<br />\n<br />\nAssistant Managing Editor<br />\nERNEST A. STRATHMAN, '26<br />\nAssociate Editors<br />\nBENJAMIN T. ROME, '25<br />\nARTHUR L. NELSON, '26<br />\n<br />\nCirculation Manager<br />\nOTHO J. KELLER, III, '26<br />\n<br />\nJunior Editors<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nA. RISLEY ENSOR, '26<br />\nJ. HENRY JARRETT, '27<br />\nCHARLES F. REESE, '27<br />\nW. BARNES HALL, '27<br />\nWILLIAM E. THOMSEN, JR., '26<br />\n<br />\nAssistant Business Managers<br />\nG. DONALD GIESKE, '25<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\nROBERT T. SAUERWEIN, '26<br />\nARTHUR SWANSON, '27<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\n<br />\nLet me state at the start that<br />\nthe scenery, settings, and lighting<br />\neffects of the Playshop's production of Lord Dunsany's \"If\" were<br />\ngood, were very good, in short<br />\nwere excellent. Here, but for a<br />\nfew exceptions, the merit of the<br />\nperformance ended; the rest was<br />\nmore or less rotten, to use a mild<br />\nHE finest materials, expert deadjective.<br />\nsigning and careful workmanship<br />\nIn the first place the play was<br />\nmake every Stetson a masterpiece.<br />\npoor. Some months ago I read<br />\none of Dunsany's one-act plays,<br />\nwhich gave me the idea that he<br />\nwas a playwright of more than<br />\naverage ability; I believe still in<br />\nmy former view, but I likewise<br />\nbelieve that \"If\" is one of the<br />\nworst plays ever put on paper. It<br />\nis a sort of combination of Avery<br />\nHopwood and Anne Nichols, with<br />\nAnne handling the English scenes,<br />\nand Avery the Persian. With a<br />\nWe Solicit Your Patronage<br />\nlittle more freedom in the costuming the piece would have made an<br />\nexcellent bedroom drama; that is<br />\nthe third and fourth acts would.<br />\nPerhaps I am putting it a little<br />\nOPTOMETRISTS<br />\nOPTICIANS<br />\nstrongly. Possibly it was the acting that added insult to injury by<br />\n3269 Greenmount Avenue<br />\nmaking a mediocre play extremely bad. At times Stanley Worden<br />\nHomewood 6717<br />\nBalti mare<br />\ngave a pretty fair performance, at<br />\ntimes one or another of the cast<br />\nrose to the level of a fair amateur's performance; but except for<br />\nthese rare intervals the acting was<br />\na nightmare. True, Byron McCandless was competent as Daoud,<br />\nand Mengers was pretty good as<br />\nthe \"Man in the corner\"; but the<br />\nrest—oh, never mind the rest.<br />\nHere I am doing a grave injusand enjoy its dignified and really literary atmosphere.<br />\ntice: G. W. Miller was a fine railThe attractive appointments, the range of Books<br />\nway guard; he has missed his voand the intellegent service will tempt you back again<br />\ncation in life by coming to college,<br />\nand again.<br />\nand Fay Allen was 0. K. as the<br />\nmaid.<br />\nThe intelligentsia of Baltimore<br />\nturned out en mass for the opening night. Among the prominent BRANCH<br />\npeople present were Lt. W. Sher- AT THE BARN<br />\nwood, Allan Gump, Cushing, the<br />\ncritic, and myself. Among the<br />\nprominent people who will not be<br />\npresent at the next production are<br />\nG. B. S. and myself.<br />\nH. R. T.<br />\n<br />\nT<br />\n<br />\nSTETSON HATS<br />\nStyled for young men<br />\n<br />\nBOULEVARD OPTICAL CO.<br />\n<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., NOVEMBER 26, 1924<br />\n<br />\nTHE GAME<br />\nThere is only one thing to write about today. To attempt to fill<br />\nthis column with a long treatise on some deep scholastic problem<br />\nwould be senseless, with the Maryland game tomorrow at the Stadium. And though what we say about it may have been already said<br />\nand thought by everyone interested in the encounter, we think it<br />\nstill should be put down here, simply as a reminder of the traditional<br />\nbattle for State Championship.<br />\n<br />\nCXeHLITZLER<br />\n<br />\nBOOKSHOP<br />\nInvites You to Call<br />\n<br />\nThere are many sport fans in the City of Baltimore who will not<br />\nconcede Johns Hopkins a chance to win tomorrow's game. We make<br />\nno predictions. We realize the type of team that Coach Byrd of<br />\nMaryland produces. We realize that the Maryland team and the<br />\nMaryland supporters are primed for this contest. But, Hopkins'<br />\ntradition of fighting football teams has been continued this year. The<br />\nHopkins.squad has performed magnificently, displaying courage and<br />\ndetermination which thrills every onlooker. We recall the knowledge<br />\nof the fundamentals and the uncanny alertness which has made the<br />\nHopkins team famous for \"following the ball\" and taking advantage<br />\nof the breaks. -We recall the airtight defense which prevented Maryland last year from gaining victory. We recall the 6 6 score against<br />\na heavier team which was conceded the odds in every department<br />\nof the game.<br />\nBOB IULA'S ORCHESTRA AT<br />\nDOUG TURNBULL<br />\nTOM MAGILL,<br />\nTHANKSGIVING DANCE<br />\nThe undergraduate and our ;Thunni need have no fear that the<br />\nRepresentatives<br />\nManager<br />\nBob Tula will conduct his own<br />\neleven will not perform admirably. The team will give everything<br />\nthey have. No one can question that, if they have ever witnessed orchestra of seven pieces at a<br />\ndance to be given tomorrow by<br />\na Hopkins football game. Our problem then is not what the team<br />\nthe Class of 1924 at the Southwill do, but what we will do in support of the team. The University<br />\nern Hotel. It is hoped that the<br />\nand individuality is offered here at prices that are not<br />\nof Maryland will have approximately three thousand rooters on her dance will be whole-heartedly supand cannot be underquoted by any house at any time.<br />\nside of the Stadium. Johns Hopkins cannot hope for that many. We ported by the student body, since<br />\n411Besides the reputation of an old-established firm<br />\nbelieve, however, that the Black and Blue can produce as large a the proceeds will be turned over<br />\nis back of each sale with a guarantee.<br />\nvolume of sound with a lesser number. That \"lesser number\" should to the class of 1924 to help pay<br />\nbe composed of every student at Homewood. While the Black and off the debt incurred by that class<br />\nin financing June Week last year.<br />\nBlue team is giving its all on the field, the Black and Blue rooters<br />\nDancing will be from nine until FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nwill be giving their all in the stands. Both will be satisfied with but one in the main ballroom<br />\nof the<br />\n343 NORTH CHARLES STREET<br />\none concluson : a victory over Maryland.<br />\nSouthern .<br />\n<br />\nNUTZLEK BFOTHEK5 C).<br />\n<br />\nClothes if Custom QI uatity,<br />\n14 N.Charles Street.<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nUnlucky Motorist(having killed<br />\nRastus—Ah can't get dis spot<br />\nStudent—Have you tried amthe lady's puppy)—Madam, I will off'n yo' trousers.<br />\nmonia?<br />\nOUR NEXT ISSUE<br />\nreplace the animal.<br />\nStudent—Have you tried gasoRastus—Naw, sub, but I'm alThe next issue of The News-Letter will appear on Tuesday, DeIndignant Owner—Sir, you flat- line?<br />\nmost sure they'll fit.—Yellow<br />\nter yourself.—Bison.<br />\ncember 2, on account of the Thanksgiving holiday.<br />\nRastus—Yas, suh.<br />\nJacket.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS LETTER, NOVEMBER 26, 1924<br />\n<br />\n$3,000,000 EYE INSTITUTE PLANNED<br />\nWITH DR. W. H. WILMER LIKELY HEAD<br />\n<br />\nErnest G. Leimbach<br />\n2819 Greenmount Avenue<br />\n<br />\nContinued from page 1<br />\n<br />\ncentury.<br />\n\"The result is that the American public does not receive such<br />\nskilled attention in the treatment of<br />\ndiseases of the eye as would be possible if there were a first rank institution for the training of ophthalmologists in this country.<br />\n'\"The movement to found such an<br />\ninstitute began among the friends<br />\nand patients of Dr. Wilmer. Several years ago they incorporated<br />\nthe Wilmer Foundation for the<br />\npurpose of raising a fund to be used<br />\nin any manner which might result<br />\nin enlarging the usefulness of his<br />\nwork. When the trustees of the<br />\nfoundation discovered that an institute of ophthalmology was contemplated as a part of the present tenyear program of •the Johns Hopkins University and the Johns Hopkins Hospital, they decided that<br />\ntheir purpose, as well as ours, might<br />\nbest be served through the integration of both plans.\"<br />\n<br />\n(Opposite Ilchester)<br />\n<br />\nA high-grade Haberdashery Shop<br />\nWithin Walking Distance of the<br />\nUniversity<br />\n<br />\nUPTOWN<br />\nQUALTIES<br />\n<br />\nDOWNTOWN<br />\nPRICES<br />\n<br />\nOPEN EVENINGS<br />\n<br />\nNot a hair out of place and not<br />\na single flake of dandruff. Big<br />\nand strong also.<br />\nnothing on him.<br />\n<br />\nAdonis had<br />\n<br />\nYou can gamble he doesn't say a word<br />\nabouz \"Vaseline\" Hair Tonic. But he<br />\nuses it almost religiously. Nothing like<br />\nit for mastering unruly hair and keeping<br />\nthe scalp healthy. Rub it in regularly<br />\nand your hair will stay with you and<br />\nlook right. At all drug stores and student barber shops.<br />\nEvery\"Vaseline\"product is recommended everywhere because of its<br />\nabsolute purity and effectiveness.<br />\n<br />\nCosts Divided Into Three Parts<br />\n<br />\nVaseline<br />\nREG U.S PAT. OFF.,<br />\n<br />\nHAIR TONIC<br />\nFor the Health and<br />\nAppearance of the Hair<br />\n<br />\nChesebrough<br />\nState Street<br />\n<br />\nmfg. Company (Cons'd)<br />\nNew York<br />\n<br />\n.........<br />\n<br />\nENUS<br />\nPENCILS<br />\n<br />\nV<br />\n<br />\na* largest setling cuii<br />\npencil in the world<br />\n<br />\nOR thestudent or prof.,the<br />\nsuperb VENUS out-rivals<br />\nall for perfect pencil work.<br />\n17 black degrees-3 copying.<br />\nAmerican Lead<br />\nPencil Co.<br />\n<br />\n,<br />\n<br />\nF<br />\n<br />\nPil<br />\n<br />\n220 Fifth Ave.<br />\nNew York<br />\n<br />\nOle<br />\n<br />\nWrite for<br />\nbooklet on<br />\nVENUS Pencils and<br />\nVENUS EVERPOINTED<br />\nMechanical Pencils<br />\n......<br />\nLS<br />\n<br />\n3<br />\n<br />\nIi<br />\n<br />\nDr. Goodnow said that it would<br />\ncost approximately $1,000,000 to<br />\nerect and equip the proposed Wilmer Institute. The plan also calls<br />\nfor $1,000,000 to endow at least<br />\nforty free beds and provide income<br />\nfor the treatment of patients who<br />\nhave not the means to pay the full<br />\ncost of hospital care. A third $1,000,000 will be required to endow<br />\nthe teaching of ophthalmology in<br />\nthe medical school and to pay the<br />\nsalaries of the institute's staff, who<br />\nwill also be officers of the Johns<br />\nHopkins Hospital and members of<br />\nthe medical faculty.<br />\nDr. Wilmer, according to the<br />\npresent plan, will become Professor of Ophthalmology in the Medical School and Ophthalmologist of<br />\nthe Johns Hopkins Hospital.<br />\nThe Wilmer Foundation already<br />\nhas $200,000 to contribute to the<br />\nproject, but under the present tentative arrangement the entire $3,000,000, or a large part of it, must<br />\nbe raised before January 1, 1925.<br />\n<br />\nWARNER & CO.<br />\nHatters<br />\n<br />\nHATS—OVERCOATS<br />\nNECKWEAR<br />\n<br />\n• \"\"11,-Nrcpw+rFFR-TiVf.WilltInfas.tliRliilf1F1.!RIF.111-Mlf‘21)(111,211:d_IXIX<br />\n<br />\nFONDA GOES TO CONFERENCE<br />\nContinued front page 1<br />\n<br />\nWill present a highly interesting rePort to the plenary session of the<br />\nConference.<br />\nA. Bruce Bielaski, a graduate of<br />\nGeorge Washington University and<br />\nPresident of Delta Tau Delta, is<br />\nchairman of the Conference.<br />\nThe representative of the Interfraternity Council of the Johns<br />\nHopkins University is Bayard P.<br />\nFonda.<br />\n<br />\nDr. Wilmer a Virginian<br />\n<br />\nDr. Wilmer was born in Powhatan County, Virginia, in 1863.<br />\nHe was graduated from the medical school of the University of Virginia. in 1885. and afterwards studied in the Polyclinic Hospital, New<br />\nYork, and in various European hospitals. He began the practice of<br />\nmedicine in Washington, D. C., in<br />\n1889, and for many years was proin<br />\nOphthalmology<br />\nfessor<br />\nof<br />\nGeorgetown University.<br />\nD.uring the war he was officer in<br />\ncharge of the Medical Research<br />\nLaboratory of the Air Service at<br />\nMineola, L. I., and was later surgeon in charge of the Medical Research Laboratories of the A. E. F.<br />\nHe is a member of the advisory<br />\nboard of'.directory of the National<br />\nCommittee for the Prevention of<br />\nBlindness and holds positions of<br />\nlike importance in many other similar organizations.<br />\nHis publications, particularly in regard to glaucoma, one of the common causes of<br />\nblindness among adults, have been<br />\nregarded as most important contributions in advancing methods for<br />\ntreatment of diseases of the eye.<br />\n<br />\nCollege men and women now<br />\nkeep their hair fashionably smooth<br />\nT_TER smooth, lustrous hair, done<br />\nwith fashionable plainness in<br />\nlines that follow closely the shape of<br />\nthe head . . . .<br />\nHis well-kept hair,always in place,<br />\nalways trim, neatly parted, naturallooking . . . .<br />\nStacomb is responsible for this<br />\nnew trimness, never before possible.<br />\nIt keeps your hair looking at all<br />\n<br />\n90RE<br />\n<br />\nClass dues for 1924-25 were.announced by the treasurer. Each<br />\nsenior will be assessed twentyfive dollars, of which eighteen<br />\ndollars vill be used for the Hullabaloo, five dollars for June Week,<br />\nand the remaining two dollars for<br />\nincidental expenses.<br />\nPresident Calhoun brought to<br />\nthe attention of the class a plan<br />\nfor a $25,000 endowmeiit policy.<br />\nThe scheme, suggested to him by<br />\nlocal insurance men, was to take<br />\nout $1,000 policies on twenty-five<br />\nmembers of the class, and pay for<br />\nthis in yearly installments. At<br />\nthe end of a certain time the money will be used as a gift to the<br />\n<br />\ntimes just the way you want it to<br />\nlook. Non-staining and non-greasy.<br />\nIn jars and tubes. At all drug and<br />\ndepartment stores.<br />\n<br />\nKEEPS THE HAIR IN PLACE<br />\n<br />\nDept.<br />\nLaboratories, Inc., or t City<br />\nNI<br />\new<br />\nStan.darci<br />\nStreet,N<br />\ngenerous<br />\n1.8th<br />\ncharge, a<br />\n113 W est<br />\nfree of<br />\n<br />\nE<br />\nOF FEIL<br />\n<br />\nme,<br />\nflease send of Stacomb.<br />\nsample tube<br />\nNarrte •<br />\nAddress<br />\n<br />\nHis Patients Prominent<br />\n<br />\nDr. Wilmer's patients have included many of the foremost persons of America. The trustees of<br />\nthe Wilmer Foundation are: Robert W. Kelley, president; Henry<br />\nBreckinridge, secretary-treasurer;<br />\nMrs. Aida de Acosta Root, Robert<br />\nM. Thompson, William P. Eno, Joseph Pulitzer, Mrs. Henry R. Rea,<br />\nMrs. Douglas Robinson, Felix<br />\nWarburg, Mrs. William K. Vanderbilt, Jr., Major General Merritt \\V.<br />\nIreland, Mrs. William Ross Proctor, Herbert L. Satterlee and Harold F. Pierce.<br />\n<br />\nemington<br />\nPortable<br />\nThis is the verdict of countless students. And<br />\nyou will feel the same way, once you have en-<br />\n<br />\njoyed the many advantages of the Remington<br />\nPortable Typewriter.<br />\nIt will save your time. It will make all writing tasks easier. It will help you to do better<br />\nwork, and that means better marks. It will give<br />\nyou a training that will be useful in all your<br />\nafter life.<br />\nPuy a portable typewriter at once, and be sure<br />\nit's a Remington Portable—the students' favorite—the recognized leader in sales and popularity.<br />\nPrice, complete with case, $60. Easy payments, if desired.<br />\nCall in and see the Remington Portable.<br />\n<br />\nIMPORTANT BUSINESS AT University from the class of 1925.<br />\nSENIOR CLASS MEETING<br />\nAction on the matter was post-<br />\n<br />\nFifty-seven Seniors were present in the M. E. Hall on November 17, when nominations for Student Council were reopened. Previously, Post and Fringer had<br />\nbeen nominated for the position,<br />\nbut it was contended that most of<br />\nthe class was absent at the time.<br />\nWhen the motion to reopen the<br />\nlists was made a heated discussion<br />\nensued, but the motion was finally<br />\n222 & 224 W_ Baltimore St.<br />\ncarried by a vote of twenty-nine<br />\ntammtamtcmc= to twenty-eight. A. L. Gump was<br />\nthen nominated and placed on the<br />\nballot along with Fringer and<br />\nPost<br />\nThe election will take<br />\nplace on Wednesday, November<br />\n26.<br />\n<br />\nSHERWOOD BROTHERS, INC.<br />\n<br />\nAs yet the trustees of the Johns<br />\nHopkins University and the Johns<br />\nHopkins Hospital have not taken<br />\n.inal action on the project but this<br />\nwill not delay the plans for finaning it.<br />\n<br />\nponed to a later date.<br />\nW. C. Gardner spoke again on<br />\nJune Week. Among other things<br />\nhe said that Seniors will be expected to sell two books of tickets<br />\ninstead of one, in order to compensate for those not sold by underclassmen.<br />\n<br />\nREMINGTON TYPEWRITER CO.<br />\n25 W. Fayette Street, Baltimore, Md.<br />\n<br />\nMARYLAND GAME TOMORROW AT STADIUM<br />\nContinued from page 1<br />\n<br />\nLine backfield both received injuries in the North Carolina State<br />\ngame. It looked for a while as<br />\nthough both would be unable to<br />\nparticipate on Thanksgiving Day.<br />\nAt present, however, Pugh has almost entirely recovered. Whether<br />\nor not Osborne will get in the<br />\ngame is still doubtful. The Blue<br />\nJays, on the other hand, have been<br />\nexceedingly lucky in escaping<br />\nwith only one injury. Carroll<br />\nLeibensperger's knee will in all<br />\nprobability prevent his playing an<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\n.X<br />\n<br />\nCorner cAzyelle<br />\n.and gaztaw Sts.<br />\n-Where Wholesale and Retail Districts Meet-<br />\n<br />\nVernon 4986<br />\n<br />\nPayne &Merrill<br />\n<br />\nactive part, but Wallace Oles has<br />\nCLOTHIERS<br />\nbeen inserted at guard in his<br />\nHABERDASHERS<br />\nplace. Otherwise the Blue Jays<br />\nwill take the field with all the<br />\n315 Charles St. North<br />\nother regulars intact.<br />\n<br />\n-Say It With Flowers\"<br />\n<br />\nSMITH & CO.<br />\nFlorists<br />\n1822 N. CHARLES STREET<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKI.NS NEWS-LETTER, NOVEMBER 26, 1924<br />\n<br />\nRESULTS OF THIRD RIFLE HULLABALOO PICTURES TO E210101-01-1<br />\nMATCH ANNOUNCED<br />\nBE TAKEN NEXT WEEK<br />\n*WADERS<br />\nGroup pictures for the 1925 ETIGRADERS •—• PRUITERS<br />\nThe results of the shooting in<br />\nthe third rifle match given under Hullabaloo will be taken during<br />\nthe auspices of the Military De- the week of December 1 by the<br />\nWhite Studio of New York. Since<br />\npartment were as follows:<br />\nFirst Prize—F. E. Williams; the time is limited, several of the<br />\npictures being scheduled for lunch<br />\nscore 95.<br />\nSecond Prize—F Torres; score hour, it is imperative that everyone be on time.<br />\n82.<br />\nA further schedule of group and<br />\nThird Prize—J. Casche ; score<br />\nindividual sittings wil be pub82.<br />\nFourth Prize—R. J. Waring; lished Tuesday. Hhe fdllowing is<br />\na schedule for Monday only:<br />\nscore 79.<br />\nFifth Prize—J. B. Calder; score 12.25-12.40—Senior class and offiPrinters of<br />\n78. •<br />\ncers.<br />\nThe second and third prizes 12.40-12.55—Sophomore class and<br />\ncrhe Johns Hopkins<br />\nwere decided by lot. The respecofficers.<br />\nNE1DS,-LETTER<br />\ntive prizes were (1) box of toilet<br />\n4.05-4.10—R.<br />\n0.<br />\nT.<br />\nC.<br />\nUnit<br />\nand<br />\narticles, (2) silver cigarette case,<br />\nBand<br />\n(3) belt buckle, (4) necktie, and<br />\nLOMBARD and SOUTH STREETS<br />\n(5) 100 rounds of ammunition. 4.10-4.15—Officers of Scabbard<br />\nand Blade.<br />\nMIME<br />\n<br />\n_ROM<br />\n<br />\ne<br />\n<br />\nHub<br />\n<br />\nBaltimore's Great<br />\nMen's Store<br />\nLATEST STYLES AND FORMS<br />\n<br />\nJ. F. APPLE CO.<br />\nMANUFACTURING JEWEL FRS<br />\nLANCASTER, PA.<br />\nClass Rings, Pins, Fraternity Pins, Cups,<br />\nMedals, Etc.<br />\nStationery, Invitations, Programmes<br />\n<br />\nEngraved<br />\n<br />\nWEDDING INVITATIONS,<br />\nANNOUNCEMENTS AND<br />\nVISITING CARDS<br />\n<br />\nSAMUEL H. KIRBY<br />\nENGRAVER<br />\nSamples and Prices on Request<br />\n<br />\n\"MAKERS OF THE VARSITY SEALS\".<br />\n42 SOUTH ST. •<br />\n<br />\nW. F. ROBERTS ADDRESSES<br />\nASSEMBLY ON STEEL<br />\nContinued from page 1<br />\n<br />\nern processes of manufacture.<br />\nThe crucible process, he said, has<br />\nproved unsatisfactory i recent<br />\nyears. Bessemer's method of<br />\nforcing air through molten pigiron in a giant converter is much<br />\nmore simple and convenient. In<br />\ncommunities where electric power is cheap, the electric arc furnace is used, which has a capacity<br />\nof about 30 tons. The openhearth process, however, is generally accepted as better than any<br />\nother in the manufacturing of<br />\nsteel on a large scale. Pig-iron<br />\nis placed in an open furnace and<br />\nsubjected to a tremendously high<br />\ntemperature, as high as the brick<br />\nwork can stand, for eight or<br />\ntwelve hours. 250 tons of molten<br />\nsteel is the result. Most of the<br />\nsteel manufactured in the world<br />\ntoday is open hearth steel.<br />\nA number of illustrative slides<br />\nwere thrown on the screen showing pictures .of the extensive steel<br />\nworks at Sparrows Point. These<br />\nincluded the rolling mills, with<br />\ntheir vast system of complicated<br />\nrollers capable of reducing huge<br />\ningots of red-hot steel to thin<br />\nstrips or plates; the huge blast<br />\nfurnace; the insatiable Bessemer<br />\nconverters with bursts of flame<br />\nroaring out of their upturned<br />\nmouths; the orderly rows of coke<br />\novens-; and many other interesting<br />\npictures of the mighty machinery<br />\nused in the iron and steel industry.<br />\nMr. Roberts concluded his talk<br />\nwith the statement that, although<br />\nthere has been a great deal of<br />\nspeculation as to the suppiy 01<br />\niron ore in the world, it has been<br />\nestimated that only seven percent of the reserve of ore has been<br />\nused in the history of iron.<br />\nAfter George Hess announced<br />\nthat notices would be posted some<br />\ntime this week advising Seniors<br />\nwhere the Hullabaloo pictures<br />\nwill be taken, Townsend rolled*<br />\nup the slide screen disclosing on<br />\nthe blackboard two magic words:<br />\n\"Beat Maryland !\" The noise<br />\nthat ensued must have convinced<br />\nanyone within the radius of a mile<br />\nthat Hopkins is in dead earnest<br />\nabout backing up the team on<br />\nThanksgiving Day. There will<br />\nbe a giant bonfire to prove it.<br />\n<br />\nHe—Do you think that you<br />\ncould learn to love me?<br />\nShe—I'm afraid not.<br />\nHe—'Tis as I feared, too old to<br />\nlearn.—Jack o' Lantern.<br />\n<br />\nAcross Another Man's Desk<br />\nThose looking forward to careers in<br />\nbusiness often associate the big accomplishments with men in private offices, who sit<br />\nback of massive desks. As a matter offact,<br />\nthere are many important men in an organization like Westinghouse who seldom use<br />\na desk or office at all. They achieve by<br />\ngoing to other men's offices. They are termed<br />\n\"sales engineers\".<br />\n<br />\nbe witnessed in every branch of industrial<br />\nlife today.<br />\n<br />\nGeorge Westinghouse,for example,rendered his greatest service to industry and<br />\nmankind not merely by perfecting alternating current but by selling it—in the face<br />\nof the stiffest kind of opposition.<br />\n<br />\nFollowing the example of its Founder,<br />\nthe Westinghouse organization includes a<br />\nbody of engineers whose work is to carry<br />\nelectrical advancement into every nook and<br />\ncorner of the world. They have sold electrification to the factories, the farms, the<br />\nhomes, the railroads, the mines, the ships.<br />\nThey are mechanical and electrical, engineers whose imaginations are fired, not<br />\nmerely by engineering achievement, but<br />\nby the benefits from such achievement to<br />\n\"the market\".<br />\n<br />\nAuthorities declared it was impractical; laws were urged against it; yet the<br />\nsalesman, Westinghouse, threw back of<br />\nalternating current, the strength of his<br />\nselling personality—with results that can<br />\n<br />\nEngineering needs men of sales ability<br />\nand sales personality; and industry needs<br />\nto have them in engineering. Organizations like Westinghouse, must sell before<br />\nthey can serve.<br />\n<br />\nWestinghouse<br />\nACHIEVEMENT8 OPPORTUNITY<br />\n<br />\nBALTIMORE<br />\n<br />\n\f", "format": "basic_html", "processed": "LT<br /><br />\nVOL. X__XIX, No 16<br /><br />\nHOMEWOOD, BALTIMORE. MD., NOVEMBER 26, 1924<br /><br />\nPRICE 5 CENTS<br /><br />\nHOPKINS MEETS MARYLAND<br />\nW. F. ROBERTS ADDRESSES HOPKINS REPRESENTED AT FIRST HOPKINS COTILLION<br />\nWILL BE GIVEN ON<br />\nNEW YORK CONFERENCE<br />\nASSEMBLY ON THE STEEL<br />\nBY FONDA<br />\nDECEMBER 12<br />\nINDUSTRY TODAY<br />\nGives History of Steel and Iron and Conference to Attempt to Improve In- luia Will Supply Music for Dance,<br />\nterfraternity Relations, and Discuss<br />\nWhich is Crowning Social Event<br />\nDescribes Their Production in AnFraternity Problems<br />\nof Pre-Xmas Season<br />\ncient and Modern Times<br /><br />\nBLUE JAYS WILL FACE OLD LINERS AT STADIUM<br />\nTOMORROW IN ANNUAL GAME<br />\nSeason Closes Following Biggest Clash of Year; Van Orman to<br />\nSpring Surprise Attack to End Season Successfully<br />\nThe curtain will come down on the 1924 football season at Johns<br />\nHopkins after the Maryland game. Whether it will be a success or<br />\nfailure depends on tomorrow's result. Although the Blue Jays have<br />\nlost only to the strong Pittsburgh team this year their season cannot<br />\nbe crowned with glory unless Maryland is subdued.<br />\nMaryland is equally as determined to carry off the laurels at the<br />\nStadium tomorrow. They were taught a lesson last year, when the<br />\ngame appeared so one-sided on paper only to have the battle of their<br />\nlife to stave off defeat. The Old Liners' desires to turn the tables<br />\nhas caused the contest to be the goal of Maryland's grid season.<br />\nIn short, the success or failure<br />\nVARD CLUB GETS BREAKS of both Universities' teams is<br />\nAND TRIMS FROSH<br />\nhinged about tomorrow's conflict.<br />\nRealizing what an attack is<br />\nFreshmen Team Loses by 19 to 0 Score<br />\nin Game With Athletic- Mb;<br />\nneeded to penetrate an eleven oi<br />\nSchwartz Stars Again<br />\nMuch to the surprise of the Maryland's strength, Coach Ray<br />\npromising Freshmen eleven the Van Orman has brought from up<br />\nVard Athletic Club scored a 19 to his sleeve many new plays intend-<br /><br />\nThe Interfraternity Conference, With the Maryland Casualty<br />\nannual gathering of Greek-letter Club House for a stage, the evefraternity men from American col- ning of Friday the twelfth of Deleges and universities, is to be held cember for the time, and colorat the Hotel Pennsylvania the 28th fully dresed young women with<br />\nand 29th of this month. This con- their \"tuxedoed\" escorts, for the<br />\nference, established in Chicago in actors, the first formal cotillion of<br />\n1909 with the purpose of foster- the season, under the auspices of<br />\ning a closer interfraternity 'spirit the Johns Hopkins Cotillion Club,<br />\namong the American colleges and will be enacted. Tickets were<br />\nuniversities, is this year in combina- placed on sale yesterday for this<br />\ntion with the Intercollegiate Inter- ball, which is generally considered<br />\nfraternity Conference. In. this way, the crowning social event of the<br />\nAncients Used Iron<br />\nalumni, faculty and undergraduates Johns Hopkins fall season. StuBegining with a discussion of are drawn closer together in their<br />\ndents are urged to immediately<br />\nthe use of iron in the past, Mr. work for national relations,<br />\ncollege purchase stickets, the demand for<br />\nRoberts commented upon the long relations, and intercollegiate relawhich is expected to exceed those<br />\nhistory of the metal. He pointed tions between fraternities.<br />\nof all previous years. The price<br />\nout the fact that there are referFifty Fraternities Represented<br />\nof admission has been set at $4.00<br />\n0 win in last Saturday's contest, ed to cross the defense of the opences in 'the Bible to objects<br />\nThere will be represented in the a couple and $3.00<br />\nstag.<br />\nTwo \"breaks\" in the first quarter position. With a comparatively<br />\nmade -of iron and that many bar- conference more than fifty -fraterMusic<br />\nby<br />\nlula's<br />\nOrchestra<br />\ncrave the visitors two touchdowns easy schedule all season there has<br />\nbaric tribes, without knowing the nities, and more than half a million<br />\nThat the alcoves of the spacious before the 1928 team had even been no<br />\nmeaning of ferrous oxide, found a college Men. About three hundred<br />\nneed for other than alnon-technical way of getting the delegates are expected to be in at- Maryland Casualty ballroom will gotten warmed up. A fumble on<br />\nmost straight football by the<br />\nmetal from the ore. Crude im- tendance, about fifty of whom will resound with the highest type of the second play of the game and<br />\nHomewood eleven. Tomorrow,<br />\nplements were found in ancient be college undergraduates, each dance music, there is not the an intercepted forward a few minA.syria and in the. Pyramids. La- representing the Interfraternity slightest doubt, as an orchestra of uates later were the lapses of for- however, the Blue Jays intend to<br />\nter, in Medieval times, iron was Council of his college. A number eight musicians, led by \"Bob\" tune which seemed to take the unleash a variated attack that has<br />\nused extensively for military pur- of prominent educators, including Iula, will furnish the syncopation. spirit out of the Frosh.<br />\nbeen two weeks in the making.<br />\nposes.<br />\nseveral college presidents, will meet Mr. Iula's orchestra is well known<br />\nAfter this disastrous first quar- Whether or not it will effect the<br />\nThe first improvement in meth- with the fraternity representatives to Baltimoreans as one of the fin- ter the Hopkins youngsters bat- Maryland<br />\nline, which has been<br />\n0d of manufacture came in the and the group of undergraduates, est musical aggregations in the tled their opponents on fairly even<br />\ntempered by such teams as Yale,<br />\n14th Century when a clay fur- to discuss college- and - fraternity city.<br />\nterms. Schwartz, who scored the<br />\nV. P. I. and Washington and Lee,<br />\nFollowing the custom adhered lone<br />\nnace and a hand-bellows were de- problems.<br />\ntouchdown of the Poly game,<br />\nwill be the turning point of the<br />\nvised. This, of course, involved<br />\nAs the result of the suceess of to in former years, attractive fa- was again in the limelight.<br />\na slow and painful process and a an experiment tried last year, a vors will be presented to the wogame.<br />\nThe Vard Club team showed<br />\nsmall output. Today, Mr. Rob- new fraternity will probably be men. Although the character of<br />\nNew Attack Kept Secret<br />\nexcellent team work for this type<br />\nerts said, the average blast fur- formed at the conference. The these Balfour favors has not even<br />\nVan Orman has taken great<br />\nnace produces from 600 to 700 number of collegre students desir- been made public, it is certain that of aggregation. Their best weapon<br />\nwas<br />\na<br />\nwide<br />\nwell<br />\nend<br />\nrun<br />\nwith<br />\npains<br />\nto keep these new plays untons of metal every—twenty-four ing fraternity affiliations is increas- they will, as in other years, add a<br />\norganized<br />\ninterference.<br />\nThe<br />\nder cover. This was a wise prehours. Iron ore, coke,. and lime- ing so rapidly that they cannot be touch of beauty to the affair.<br />\nFreshmen ends were at a loss to<br />\nstone are dumped into the top of accommodated, with the result that<br />\ncaution, perhaps, for after dark<br />\nPrizes Will Be Awarded<br />\ncope with this play and frequent<br />\nthe furnace and great blasts of the Interfratemity Conference is<br />\nthe patrollers of Homewood have<br />\nNo little excitement will be<br />\nsubstitutions made little differair are blown into the mass. In aiding groups of locals to band to- caused at the cotillion when<br />\nthe ence. The Vard<br />\nClubbers showed already been forced to chase men,<br />\nburning, certain chemical changes gether. Nearly a score of locals winners of the June Week chances<br />\narmed with pads and pencils, from<br />\ntake place which reduce the ore. from all parts of the country are will be determined. For some time up as much faster than their opThe liquid iron goes to the bot- anxious to .start a new national fra- the 1925 June Week Committee ponents but were slightly at a dis- the shelter of the hedges.<br />\nadvantage in the center of the line<br />\ntom and is drained off into ternity.<br />\nMaryland, likewise, has also<br />\nhas offered Hopkins students the<br />\nwhere the Frosh weight was cen- been holding<br />\ntroughs. The remaining products<br />\npractices in secret.<br />\nA committee of the Interfrater- opportunity of taking chances on<br />\nform a slag which is disposed of nity Conference has been at work three prizes offered by that com- tered.<br />\nCurly Byrd is a coach whose cunThis was the last appearance of ning is not to be taken lightly. It<br />\nas waste matter.<br />\nfor- a year investigating • what the mittee. These prizes which give<br />\nPassing on to the • subject of ideals and aims of college frater- credit in the Barn Store, managed the 1928 eleven at Homewood be- is not necessary to fool him twice<br />\nsteel, Mr. Roberts outlined mod- nities really are. This committee by Thomas Magill and Douglas fore the Sophomore game on De- and he will more than likely be<br />\nContinued on page 4, col. 1<br />\nprepared for all manner of tricks<br />\nCantinued on page 3,(0!. 1.<br />\nTurnbull, and amount to: first, cember 6.<br />\nknown to football strategy. As<br />\n$50; second, $15; third, $10, will<br />\n$3,000,000 EYE INSTITUTE PLANNED<br />\nbe awarded to the holders of the ENGLAND AND LLOYD WILL the two teams are very nearly<br />\nequal in strength, the result of the<br />\nWITH DR. W. H. WILMER LIKELY HEAD three lucky chances. A prominent<br />\nHANDLE TRACK SQUAD<br />\ngame<br />\nseems to narrow down to<br />\nwill draw the lots. This event<br />\nJoe England, the South Atlantic<br />\nPlans for a $3,000,000 institute work, as well as a place where his man<br />\nfor the study and treatment of dis- abilities may be given wider scope is expected to create widespread quarter mile champion, who is the superiority in coaching and<br />\ninterest.<br />\nconceded to be one of the greatest the backing given the elevens by<br />\neases of the eye and for research during his lifetime.<br />\nRequired<br />\nPledge<br />\ncoaches of the country, together their rooters.<br />\ndealing with the causes of blindness<br />\nAn institute such as is now con\"Pep\" a Necessity<br />\nIn order to avoid the possibil- with Huntley Lloyd, also a faand allied ailments, were announced templated, it is said, will not only<br />\nmous<br />\nquarter<br />\nmiler,<br />\nsebeen<br />\nhave<br />\nCotillion<br />\nThe<br />\ndrunkenness,<br />\nability<br />\nthe<br />\nof<br />\nof Dr. Van Orman<br />\nity<br />\nrecently by Dr. Frank J. Goodnow, be the first of its kind ever estabcured<br />\nto<br />\ncoach<br />\nthis<br />\nthe<br />\nteam<br />\ntrack<br />\nPresident<br />\nas<br />\nJ.<br />\na<br />\naccording<br />\nfootball<br />\nClub,<br />\nto<br />\ncoach<br />\nneeds no extolPresident of the Johns Hopkins lished in America, but also the<br />\ncontinue<br />\nyear.<br />\nwil<br />\nteam<br />\nThe<br />\nto<br />\nling.<br />\ndemands<br />\nthe<br />\nTo<br />\nEdward<br />\nBrown,<br />\nget<br />\nspirit<br />\ninto the HopUniversity. The establishment is to equal of any in Europe or elseform a part of the Johns Hopkins where in the world.<br />\npledge of every Hopkins man to work out daily in preparation for kins rooters is the purpose of toMedical School and the Johns Hop- \"There is probably no field in abstain from any intoxicating the coming indoor season which night's bon-fire and \"pep\" meetThanks- ing. Maryland also has been hard<br />\nkins Hospital.<br />\nwhich the facilities of American liquor from noon of the day of the begins shortly after the<br />\nvacation.<br />\ngiving<br />\nat work encouraging their team<br />\nThe present intention is to place medical schools and hospitals are so dance throughout the day and<br />\nand rooters. After the game with<br />\nit under the direction of Dr. Wil- inadequate as that which deals with night. Dancing, according to the<br />\nNorth Carolina State two weeks<br />\nliam Holland Wilmer, of Washing- diseases of the eye,\" said President Cotillion Club president, will be<br />\nago they had planned a reunion<br />\nNOTICES<br />\nthe noted ophthalmologist. For Goodnow. \"Almost all our fore- from 9 P. M. to 1 A. M.<br />\nof all the old gridiron stars. The<br />\nthat reason the Wilmer Foundation, most ophthalmologists have - been<br />\nThe patrons and patronesses for<br />\nBonfire before Maryland game,<br />\nWednesday, November 26, at<br />\nof which Henry Breckinridge, of 2 trained in Europe. Today American the cotillion are: Dr. and Mrs.<br />\nuntimely snow storm put a slight<br />\non lot behind C. E.<br />\nP.<br />\nM.,<br />\n7:30<br />\nGoodnow,<br />\ndamper on the proceedings, but<br />\nDr. and Mrs.<br />\nRector Street, New York City, is medical students who have the am- Frank J.<br />\nHall. Freshmen bring boxes. Insecretary-treasurer, is co-operating bition and ability to excel in this Joseph S. Ames, Dr. and Mrs.<br />\nformal torchlight parade downnevertheless much was accomtown afterwards.<br />\nWith the Johns Hopkins authorities field must go to Europe to obtain John B. Whitehead, Dr. and Mrs.<br />\nplished in rousing spirit. Johns<br />\nin financing the project. The trus- the best training. Great ophthalmo- John H. Latane, Dr and Mrs.<br />\nHopkins has followed suit this<br />\ntees of the foundation are intent on logical institutes have been in exist- John C. French, Dr. and Mrs.<br />\nweek.<br />\nCopy for next issue of NewsLetter due today.<br />\nOsborn and Pugh of the Old<br />\nmaking the institute a permanent ence there for more than half a Charles Thatch and Dr. and Mrs.<br />\nMitchell.<br />\nBroadus<br />\nContinued on page 3, col. 3<br />\nmemorial to Dr. Wilmer and his<br />\nContinued on page 3 col. 2<br />\nThose who attended the Assembly last Thursday mentally<br />\nenjoyed a trip to Sparrows Point<br />\nconducted by Mr. W..Frank Roberts, with the help of numerous<br />\nlantern slides. Mr. Roberts is the<br />\nGeneral Manager of the Sparrows<br />\nPoint plant of the Bethlehem<br />\nSteel Company and as Dean<br />\nWhitehead said upon presenting<br />\nhim, he is familiar with every detail of the , methods employed in<br />\nthe manufacture of iron and steel.<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS - LL I I ER, NOVEMBER 26, 1924<br /><br />\nThe Johns Hopkins News-Letter<br />\nPlayshop<br />\nFOUNDED 1897<br /><br />\nPRESENTS<br />\nSubscription<br /><br />\n$2.00<br />\n66 11<br /><br />\nF 99<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br /><br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br /><br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all artic7es and other communications<br />\nshould be sent to the MANAGING EDITOR.<br /><br />\nTelephone<br /><br />\nHomewood 0100<br /><br />\nEditor-in-Chief<br />\nR. CARMICHAEL TILGHMAN, '25<br /><br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br /><br />\nManaging Editor<br />\nALGER Hiss, '26<br /><br />\nAdvertising Manager<br />\nALFRED J. McKAY, '26<br /><br />\nAssistant Managing Editor<br />\nERNEST A. STRATHMAN, '26<br />\nAssociate Editors<br />\nBENJAMIN T. ROME, '25<br />\nARTHUR L. NELSON, '26<br /><br />\nCirculation Manager<br />\nOTHO J. KELLER, III, '26<br /><br />\nJunior Editors<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nA. RISLEY ENSOR, '26<br />\nJ. HENRY JARRETT, '27<br />\nCHARLES F. REESE, '27<br />\nW. BARNES HALL, '27<br />\nWILLIAM E. THOMSEN, JR., '26<br /><br />\nAssistant Business Managers<br />\nG. DONALD GIESKE, '25<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\nROBERT T. SAUERWEIN, '26<br />\nARTHUR SWANSON, '27<br /><br />\nMember Southern Intercollegiate Newspaper Association<br /><br />\nLet me state at the start that<br />\nthe scenery, settings, and lighting<br />\neffects of the Playshop's production of Lord Dunsany's \"If\" were<br />\ngood, were very good, in short<br />\nwere excellent. Here, but for a<br />\nfew exceptions, the merit of the<br />\nperformance ended; the rest was<br />\nmore or less rotten, to use a mild<br />\nHE finest materials, expert deadjective.<br />\nsigning and careful workmanship<br />\nIn the first place the play was<br />\nmake every Stetson a masterpiece.<br />\npoor. Some months ago I read<br />\none of Dunsany's one-act plays,<br />\nwhich gave me the idea that he<br />\nwas a playwright of more than<br />\naverage ability; I believe still in<br />\nmy former view, but I likewise<br />\nbelieve that \"If\" is one of the<br />\nworst plays ever put on paper. It<br />\nis a sort of combination of Avery<br />\nHopwood and Anne Nichols, with<br />\nAnne handling the English scenes,<br />\nand Avery the Persian. With a<br />\nWe Solicit Your Patronage<br />\nlittle more freedom in the costuming the piece would have made an<br />\nexcellent bedroom drama; that is<br />\nthe third and fourth acts would.<br />\nPerhaps I am putting it a little<br />\nOPTOMETRISTS<br />\nOPTICIANS<br />\nstrongly. Possibly it was the acting that added insult to injury by<br />\n3269 Greenmount Avenue<br />\nmaking a mediocre play extremely bad. At times Stanley Worden<br />\nHomewood 6717<br />\nBalti mare<br />\ngave a pretty fair performance, at<br />\ntimes one or another of the cast<br />\nrose to the level of a fair amateur's performance; but except for<br />\nthese rare intervals the acting was<br />\na nightmare. True, Byron McCandless was competent as Daoud,<br />\nand Mengers was pretty good as<br />\nthe \"Man in the corner\"; but the<br />\nrest—oh, never mind the rest.<br />\nHere I am doing a grave injusand enjoy its dignified and really literary atmosphere.<br />\ntice: G. W. Miller was a fine railThe attractive appointments, the range of Books<br />\nway guard; he has missed his voand the intellegent service will tempt you back again<br />\ncation in life by coming to college,<br />\nand again.<br />\nand Fay Allen was 0. K. as the<br />\nmaid.<br />\nThe intelligentsia of Baltimore<br />\nturned out en mass for the opening night. Among the prominent BRANCH<br />\npeople present were Lt. W. Sher- AT THE BARN<br />\nwood, Allan Gump, Cushing, the<br />\ncritic, and myself. Among the<br />\nprominent people who will not be<br />\npresent at the next production are<br />\nG. B. S. and myself.<br />\nH. R. T.<br /><br />\nT<br /><br />\nSTETSON HATS<br />\nStyled for young men<br /><br />\nBOULEVARD OPTICAL CO.<br /><br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nHOMEWOOD, BALTIMORE, MD., NOVEMBER 26, 1924<br /><br />\nTHE GAME<br />\nThere is only one thing to write about today. To attempt to fill<br />\nthis column with a long treatise on some deep scholastic problem<br />\nwould be senseless, with the Maryland game tomorrow at the Stadium. And though what we say about it may have been already said<br />\nand thought by everyone interested in the encounter, we think it<br />\nstill should be put down here, simply as a reminder of the traditional<br />\nbattle for State Championship.<br /><br />\nCXeHLITZLER<br /><br />\nBOOKSHOP<br />\nInvites You to Call<br /><br />\nThere are many sport fans in the City of Baltimore who will not<br />\nconcede Johns Hopkins a chance to win tomorrow's game. We make<br />\nno predictions. We realize the type of team that Coach Byrd of<br />\nMaryland produces. We realize that the Maryland team and the<br />\nMaryland supporters are primed for this contest. But, Hopkins'<br />\ntradition of fighting football teams has been continued this year. The<br />\nHopkins.squad has performed magnificently, displaying courage and<br />\ndetermination which thrills every onlooker. We recall the knowledge<br />\nof the fundamentals and the uncanny alertness which has made the<br />\nHopkins team famous for \"following the ball\" and taking advantage<br />\nof the breaks. -We recall the airtight defense which prevented Maryland last year from gaining victory. We recall the 6 6 score against<br />\na heavier team which was conceded the odds in every department<br />\nof the game.<br />\nBOB IULA'S ORCHESTRA AT<br />\nDOUG TURNBULL<br />\nTOM MAGILL,<br />\nTHANKSGIVING DANCE<br />\nThe undergraduate and our ;Thunni need have no fear that the<br />\nRepresentatives<br />\nManager<br />\nBob Tula will conduct his own<br />\neleven will not perform admirably. The team will give everything<br />\nthey have. No one can question that, if they have ever witnessed orchestra of seven pieces at a<br />\ndance to be given tomorrow by<br />\na Hopkins football game. Our problem then is not what the team<br />\nthe Class of 1924 at the Southwill do, but what we will do in support of the team. The University<br />\nern Hotel. It is hoped that the<br />\nand individuality is offered here at prices that are not<br />\nof Maryland will have approximately three thousand rooters on her dance will be whole-heartedly supand cannot be underquoted by any house at any time.<br />\nside of the Stadium. Johns Hopkins cannot hope for that many. We ported by the student body, since<br />\n411Besides the reputation of an old-established firm<br />\nbelieve, however, that the Black and Blue can produce as large a the proceeds will be turned over<br />\nis back of each sale with a guarantee.<br />\nvolume of sound with a lesser number. That \"lesser number\" should to the class of 1924 to help pay<br />\nbe composed of every student at Homewood. While the Black and off the debt incurred by that class<br />\nin financing June Week last year.<br />\nBlue team is giving its all on the field, the Black and Blue rooters<br />\nDancing will be from nine until FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nwill be giving their all in the stands. Both will be satisfied with but one in the main ballroom<br />\nof the<br />\n343 NORTH CHARLES STREET<br />\none concluson : a victory over Maryland.<br />\nSouthern .<br /><br />\nNUTZLEK BFOTHEK5 C).<br /><br />\nClothes if Custom QI uatity,<br />\n14 N.Charles Street.<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nUnlucky Motorist(having killed<br />\nRastus—Ah can't get dis spot<br />\nStudent—Have you tried amthe lady's puppy)—Madam, I will off'n yo' trousers.<br />\nmonia?<br />\nOUR NEXT ISSUE<br />\nreplace the animal.<br />\nStudent—Have you tried gasoRastus—Naw, sub, but I'm alThe next issue of The News-Letter will appear on Tuesday, DeIndignant Owner—Sir, you flat- line?<br />\nmost sure they'll fit.—Yellow<br />\nter yourself.—Bison.<br />\ncember 2, on account of the Thanksgiving holiday.<br />\nRastus—Yas, suh.<br />\nJacket.<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER, NOVEMBER 26, 1924<br /><br />\n$3,000,000 EYE INSTITUTE PLANNED<br />\nWITH DR. W. H. WILMER LIKELY HEAD<br /><br />\nErnest G. Leimbach<br />\n2819 Greenmount Avenue<br /><br />\nContinued from page 1<br /><br />\ncentury.<br />\n\"The result is that the American public does not receive such<br />\nskilled attention in the treatment of<br />\ndiseases of the eye as would be possible if there were a first rank institution for the training of ophthalmologists in this country.<br />\n'\"The movement to found such an<br />\ninstitute began among the friends<br />\nand patients of Dr. Wilmer. Several years ago they incorporated<br />\nthe Wilmer Foundation for the<br />\npurpose of raising a fund to be used<br />\nin any manner which might result<br />\nin enlarging the usefulness of his<br />\nwork. When the trustees of the<br />\nfoundation discovered that an institute of ophthalmology was contemplated as a part of the present tenyear program of •the Johns Hopkins University and the Johns Hopkins Hospital, they decided that<br />\ntheir purpose, as well as ours, might<br />\nbest be served through the integration of both plans.\"<br /><br />\n(Opposite Ilchester)<br /><br />\nA high-grade Haberdashery Shop<br />\nWithin Walking Distance of the<br />\nUniversity<br /><br />\nUPTOWN<br />\nQUALTIES<br /><br />\nDOWNTOWN<br />\nPRICES<br /><br />\nOPEN EVENINGS<br /><br />\nNot a hair out of place and not<br />\na single flake of dandruff. Big<br />\nand strong also.<br />\nnothing on him.<br /><br />\nAdonis had<br /><br />\nYou can gamble he doesn't say a word<br />\nabouz \"Vaseline\" Hair Tonic. But he<br />\nuses it almost religiously. Nothing like<br />\nit for mastering unruly hair and keeping<br />\nthe scalp healthy. Rub it in regularly<br />\nand your hair will stay with you and<br />\nlook right. At all drug stores and student barber shops.<br />\nEvery\"Vaseline\"product is recommended everywhere because of its<br />\nabsolute purity and effectiveness.<br /><br />\nCosts Divided Into Three Parts<br /><br />\nVaseline<br />\nREG U.S PAT. OFF.,<br /><br />\nHAIR TONIC<br />\nFor the Health and<br />\nAppearance of the Hair<br /><br />\nChesebrough<br />\nState Street<br /><br />\nmfg. Company (Cons'd)<br />\nNew York<br /><br />\n.........<br /><br />\nENUS<br />\nPENCILS<br /><br />\nV<br /><br />\na* largest setling cuii<br />\npencil in the world<br /><br />\nOR thestudent or prof.,the<br />\nsuperb VENUS out-rivals<br />\nall for perfect pencil work.<br />\n17 black degrees-3 copying.<br />\nAmerican Lead<br />\nPencil Co.<br /><br />\n,<br /><br />\nF<br /><br />\nPil<br /><br />\n220 Fifth Ave.<br />\nNew York<br /><br />\nOle<br /><br />\nWrite for<br />\nbooklet on<br />\nVENUS Pencils and<br />\nVENUS EVERPOINTED<br />\nMechanical Pencils<br />\n......<br />\nLS<br /><br />\n3<br /><br />\nIi<br /><br />\nDr. Goodnow said that it would<br />\ncost approximately $1,000,000 to<br />\nerect and equip the proposed Wilmer Institute. The plan also calls<br />\nfor $1,000,000 to endow at least<br />\nforty free beds and provide income<br />\nfor the treatment of patients who<br />\nhave not the means to pay the full<br />\ncost of hospital care. A third $1,000,000 will be required to endow<br />\nthe teaching of ophthalmology in<br />\nthe medical school and to pay the<br />\nsalaries of the institute's staff, who<br />\nwill also be officers of the Johns<br />\nHopkins Hospital and members of<br />\nthe medical faculty.<br />\nDr. Wilmer, according to the<br />\npresent plan, will become Professor of Ophthalmology in the Medical School and Ophthalmologist of<br />\nthe Johns Hopkins Hospital.<br />\nThe Wilmer Foundation already<br />\nhas $200,000 to contribute to the<br />\nproject, but under the present tentative arrangement the entire $3,000,000, or a large part of it, must<br />\nbe raised before January 1, 1925.<br /><br />\nWARNER &amp; CO.<br />\nHatters<br /><br />\nHATS—OVERCOATS<br />\nNECKWEAR<br /><br />\n• \"\"11,-Nrcpw+rFFR-TiVf.WilltInfas.tliRliilf1F1.!RIF.111-Mlf‘21)(111,211:d_IXIX<br /><br />\nFONDA GOES TO CONFERENCE<br />\nContinued front page 1<br /><br />\nWill present a highly interesting rePort to the plenary session of the<br />\nConference.<br />\nA. Bruce Bielaski, a graduate of<br />\nGeorge Washington University and<br />\nPresident of Delta Tau Delta, is<br />\nchairman of the Conference.<br />\nThe representative of the Interfraternity Council of the Johns<br />\nHopkins University is Bayard P.<br />\nFonda.<br /><br />\nDr. Wilmer a Virginian<br /><br />\nDr. Wilmer was born in Powhatan County, Virginia, in 1863.<br />\nHe was graduated from the medical school of the University of Virginia. in 1885. and afterwards studied in the Polyclinic Hospital, New<br />\nYork, and in various European hospitals. He began the practice of<br />\nmedicine in Washington, D. C., in<br />\n1889, and for many years was proin<br />\nOphthalmology<br />\nfessor<br />\nof<br />\nGeorgetown University.<br />\nD.uring the war he was officer in<br />\ncharge of the Medical Research<br />\nLaboratory of the Air Service at<br />\nMineola, L. I., and was later surgeon in charge of the Medical Research Laboratories of the A. E. F.<br />\nHe is a member of the advisory<br />\nboard of'.directory of the National<br />\nCommittee for the Prevention of<br />\nBlindness and holds positions of<br />\nlike importance in many other similar organizations.<br />\nHis publications, particularly in regard to glaucoma, one of the common causes of<br />\nblindness among adults, have been<br />\nregarded as most important contributions in advancing methods for<br />\ntreatment of diseases of the eye.<br /><br />\nCollege men and women now<br />\nkeep their hair fashionably smooth<br />\nT_TER smooth, lustrous hair, done<br />\nwith fashionable plainness in<br />\nlines that follow closely the shape of<br />\nthe head . . . .<br />\nHis well-kept hair,always in place,<br />\nalways trim, neatly parted, naturallooking . . . .<br />\nStacomb is responsible for this<br />\nnew trimness, never before possible.<br />\nIt keeps your hair looking at all<br /><br />\n90RE<br /><br />\nClass dues for 1924-25 were.announced by the treasurer. Each<br />\nsenior will be assessed twentyfive dollars, of which eighteen<br />\ndollars vill be used for the Hullabaloo, five dollars for June Week,<br />\nand the remaining two dollars for<br />\nincidental expenses.<br />\nPresident Calhoun brought to<br />\nthe attention of the class a plan<br />\nfor a $25,000 endowmeiit policy.<br />\nThe scheme, suggested to him by<br />\nlocal insurance men, was to take<br />\nout $1,000 policies on twenty-five<br />\nmembers of the class, and pay for<br />\nthis in yearly installments. At<br />\nthe end of a certain time the money will be used as a gift to the<br /><br />\ntimes just the way you want it to<br />\nlook. Non-staining and non-greasy.<br />\nIn jars and tubes. At all drug and<br />\ndepartment stores.<br /><br />\nKEEPS THE HAIR IN PLACE<br /><br />\nDept.<br />\nLaboratories, Inc., or t City<br />\nNI<br />\new<br />\nStan.darci<br />\nStreet,N<br />\ngenerous<br />\n1.8th<br />\ncharge, a<br />\n113 W est<br />\nfree of<br /><br />\nE<br />\nOF FEIL<br /><br />\nme,<br />\nflease send of Stacomb.<br />\nsample tube<br />\nNarrte •<br />\nAddress<br /><br />\nHis Patients Prominent<br /><br />\nDr. Wilmer's patients have included many of the foremost persons of America. The trustees of<br />\nthe Wilmer Foundation are: Robert W. Kelley, president; Henry<br />\nBreckinridge, secretary-treasurer;<br />\nMrs. Aida de Acosta Root, Robert<br />\nM. Thompson, William P. Eno, Joseph Pulitzer, Mrs. Henry R. Rea,<br />\nMrs. Douglas Robinson, Felix<br />\nWarburg, Mrs. William K. Vanderbilt, Jr., Major General Merritt \\V.<br />\nIreland, Mrs. William Ross Proctor, Herbert L. Satterlee and Harold F. Pierce.<br /><br />\nemington<br />\nPortable<br />\nThis is the verdict of countless students. And<br />\nyou will feel the same way, once you have en-<br /><br />\njoyed the many advantages of the Remington<br />\nPortable Typewriter.<br />\nIt will save your time. It will make all writing tasks easier. It will help you to do better<br />\nwork, and that means better marks. It will give<br />\nyou a training that will be useful in all your<br />\nafter life.<br />\nPuy a portable typewriter at once, and be sure<br />\nit's a Remington Portable—the students' favorite—the recognized leader in sales and popularity.<br />\nPrice, complete with case, $60. Easy payments, if desired.<br />\nCall in and see the Remington Portable.<br /><br />\nIMPORTANT BUSINESS AT University from the class of 1925.<br />\nSENIOR CLASS MEETING<br />\nAction on the matter was post-<br /><br />\nFifty-seven Seniors were present in the M. E. Hall on November 17, when nominations for Student Council were reopened. Previously, Post and Fringer had<br />\nbeen nominated for the position,<br />\nbut it was contended that most of<br />\nthe class was absent at the time.<br />\nWhen the motion to reopen the<br />\nlists was made a heated discussion<br />\nensued, but the motion was finally<br />\n222 &amp; 224 W_ Baltimore St.<br />\ncarried by a vote of twenty-nine<br />\ntammtamtcmc= to twenty-eight. A. L. Gump was<br />\nthen nominated and placed on the<br />\nballot along with Fringer and<br />\nPost<br />\nThe election will take<br />\nplace on Wednesday, November<br />\n26.<br /><br />\nSHERWOOD BROTHERS, INC.<br /><br />\nAs yet the trustees of the Johns<br />\nHopkins University and the Johns<br />\nHopkins Hospital have not taken<br />\n.inal action on the project but this<br />\nwill not delay the plans for finaning it.<br /><br />\nponed to a later date.<br />\nW. C. Gardner spoke again on<br />\nJune Week. Among other things<br />\nhe said that Seniors will be expected to sell two books of tickets<br />\ninstead of one, in order to compensate for those not sold by underclassmen.<br /><br />\nREMINGTON TYPEWRITER CO.<br />\n25 W. Fayette Street, Baltimore, Md.<br /><br />\nMARYLAND GAME TOMORROW AT STADIUM<br />\nContinued from page 1<br /><br />\nLine backfield both received injuries in the North Carolina State<br />\ngame. It looked for a while as<br />\nthough both would be unable to<br />\nparticipate on Thanksgiving Day.<br />\nAt present, however, Pugh has almost entirely recovered. Whether<br />\nor not Osborne will get in the<br />\ngame is still doubtful. The Blue<br />\nJays, on the other hand, have been<br />\nexceedingly lucky in escaping<br />\nwith only one injury. Carroll<br />\nLeibensperger's knee will in all<br />\nprobability prevent his playing an<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br />\n.X<br /><br />\nCorner cAzyelle<br />\n.and gaztaw Sts.<br />\n-Where Wholesale and Retail Districts Meet-<br /><br />\nVernon 4986<br /><br />\nPayne &amp;Merrill<br /><br />\nactive part, but Wallace Oles has<br />\nCLOTHIERS<br />\nbeen inserted at guard in his<br />\nHABERDASHERS<br />\nplace. Otherwise the Blue Jays<br />\nwill take the field with all the<br />\n315 Charles St. North<br />\nother regulars intact.<br /><br />\n-Say It With Flowers\"<br /><br />\nSMITH &amp; CO.<br />\nFlorists<br />\n1822 N. CHARLES STREET<br /><br />\n4<br /><br />\nTHE JOHNS HOPKI.NS NEWS-LETTER, NOVEMBER 26, 1924<br /><br />\nRESULTS OF THIRD RIFLE HULLABALOO PICTURES TO E210101-01-1<br />\nMATCH ANNOUNCED<br />\nBE TAKEN NEXT WEEK<br />\n*WADERS<br />\nGroup pictures for the 1925 ETIGRADERS •—• PRUITERS<br />\nThe results of the shooting in<br />\nthe third rifle match given under Hullabaloo will be taken during<br />\nthe auspices of the Military De- the week of December 1 by the<br />\nWhite Studio of New York. Since<br />\npartment were as follows:<br />\nFirst Prize—F. E. Williams; the time is limited, several of the<br />\npictures being scheduled for lunch<br />\nscore 95.<br />\nSecond Prize—F Torres; score hour, it is imperative that everyone be on time.<br />\n82.<br />\nA further schedule of group and<br />\nThird Prize—J. Casche ; score<br />\nindividual sittings wil be pub82.<br />\nFourth Prize—R. J. Waring; lished Tuesday. Hhe fdllowing is<br />\na schedule for Monday only:<br />\nscore 79.<br />\nFifth Prize—J. B. Calder; score 12.25-12.40—Senior class and offiPrinters of<br />\n78. •<br />\ncers.<br />\nThe second and third prizes 12.40-12.55—Sophomore class and<br />\ncrhe Johns Hopkins<br />\nwere decided by lot. The respecofficers.<br />\nNE1DS,-LETTER<br />\ntive prizes were (1) box of toilet<br />\n4.05-4.10—R.<br />\n0.<br />\nT.<br />\nC.<br />\nUnit<br />\nand<br />\narticles, (2) silver cigarette case,<br />\nBand<br />\n(3) belt buckle, (4) necktie, and<br />\nLOMBARD and SOUTH STREETS<br />\n(5) 100 rounds of ammunition. 4.10-4.15—Officers of Scabbard<br />\nand Blade.<br />\nMIME<br /><br />\n_ROM<br /><br />\ne<br /><br />\nHub<br /><br />\nBaltimore's Great<br />\nMen's Store<br />\nLATEST STYLES AND FORMS<br /><br />\nJ. F. APPLE CO.<br />\nMANUFACTURING JEWEL FRS<br />\nLANCASTER, PA.<br />\nClass Rings, Pins, Fraternity Pins, Cups,<br />\nMedals, Etc.<br />\nStationery, Invitations, Programmes<br /><br />\nEngraved<br /><br />\nWEDDING INVITATIONS,<br />\nANNOUNCEMENTS AND<br />\nVISITING CARDS<br /><br />\nSAMUEL H. KIRBY<br />\nENGRAVER<br />\nSamples and Prices on Request<br /><br />\n\"MAKERS OF THE VARSITY SEALS\".<br />\n42 SOUTH ST. •<br /><br />\nW. F. ROBERTS ADDRESSES<br />\nASSEMBLY ON STEEL<br />\nContinued from page 1<br /><br />\nern processes of manufacture.<br />\nThe crucible process, he said, has<br />\nproved unsatisfactory i recent<br />\nyears. Bessemer's method of<br />\nforcing air through molten pigiron in a giant converter is much<br />\nmore simple and convenient. In<br />\ncommunities where electric power is cheap, the electric arc furnace is used, which has a capacity<br />\nof about 30 tons. The openhearth process, however, is generally accepted as better than any<br />\nother in the manufacturing of<br />\nsteel on a large scale. Pig-iron<br />\nis placed in an open furnace and<br />\nsubjected to a tremendously high<br />\ntemperature, as high as the brick<br />\nwork can stand, for eight or<br />\ntwelve hours. 250 tons of molten<br />\nsteel is the result. Most of the<br />\nsteel manufactured in the world<br />\ntoday is open hearth steel.<br />\nA number of illustrative slides<br />\nwere thrown on the screen showing pictures .of the extensive steel<br />\nworks at Sparrows Point. These<br />\nincluded the rolling mills, with<br />\ntheir vast system of complicated<br />\nrollers capable of reducing huge<br />\ningots of red-hot steel to thin<br />\nstrips or plates; the huge blast<br />\nfurnace; the insatiable Bessemer<br />\nconverters with bursts of flame<br />\nroaring out of their upturned<br />\nmouths; the orderly rows of coke<br />\novens-; and many other interesting<br />\npictures of the mighty machinery<br />\nused in the iron and steel industry.<br />\nMr. Roberts concluded his talk<br />\nwith the statement that, although<br />\nthere has been a great deal of<br />\nspeculation as to the suppiy 01<br />\niron ore in the world, it has been<br />\nestimated that only seven percent of the reserve of ore has been<br />\nused in the history of iron.<br />\nAfter George Hess announced<br />\nthat notices would be posted some<br />\ntime this week advising Seniors<br />\nwhere the Hullabaloo pictures<br />\nwill be taken, Townsend rolled*<br />\nup the slide screen disclosing on<br />\nthe blackboard two magic words:<br />\n\"Beat Maryland !\" The noise<br />\nthat ensued must have convinced<br />\nanyone within the radius of a mile<br />\nthat Hopkins is in dead earnest<br />\nabout backing up the team on<br />\nThanksgiving Day. There will<br />\nbe a giant bonfire to prove it.<br /><br />\nHe—Do you think that you<br />\ncould learn to love me?<br />\nShe—I'm afraid not.<br />\nHe—'Tis as I feared, too old to<br />\nlearn.—Jack o' Lantern.<br /><br />\nAcross Another Man's Desk<br />\nThose looking forward to careers in<br />\nbusiness often associate the big accomplishments with men in private offices, who sit<br />\nback of massive desks. As a matter offact,<br />\nthere are many important men in an organization like Westinghouse who seldom use<br />\na desk or office at all. They achieve by<br />\ngoing to other men's offices. They are termed<br />\n\"sales engineers\".<br /><br />\nbe witnessed in every branch of industrial<br />\nlife today.<br /><br />\nGeorge Westinghouse,for example,rendered his greatest service to industry and<br />\nmankind not merely by perfecting alternating current but by selling it—in the face<br />\nof the stiffest kind of opposition.<br /><br />\nFollowing the example of its Founder,<br />\nthe Westinghouse organization includes a<br />\nbody of engineers whose work is to carry<br />\nelectrical advancement into every nook and<br />\ncorner of the world. They have sold electrification to the factories, the farms, the<br />\nhomes, the railroads, the mines, the ships.<br />\nThey are mechanical and electrical, engineers whose imaginations are fired, not<br />\nmerely by engineering achievement, but<br />\nby the benefits from such achievement to<br />\n\"the market\".<br /><br />\nAuthorities declared it was impractical; laws were urged against it; yet the<br />\nsalesman, Westinghouse, threw back of<br />\nalternating current, the strength of his<br />\nselling personality—with results that can<br /><br />\nEngineering needs men of sales ability<br />\nand sales personality; and industry needs<br />\nto have them in engineering. Organizations like Westinghouse, must sell before<br />\nthey can serve.<br /><br />\nWestinghouse<br />\nACHIEVEMENT8 OPPORTUNITY<br /><br />\nBALTIMORE<br /><br />"}], "field_media_file": [{"target_id": 37915, "display": null, "description": null, "target_type": "file", "target_uuid": "0e5b52dd-c1aa-48ad-875e-969168c2f668", "url": "http://digital.library.jhu.edu/system/files/2022-03/13146-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13146, "target_type": "node", "target_uuid": "a8931f94-ac8a-4d9b-87d9-76f9b98f06ce", "url": "/node/13146"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "95fb2ae4-82ab-4ef5-900a-1d34ac78b06a"}]}