{"mid": [{"value": 36879}], "uuid": [{"value": "e263a4ed-34b2-49fd-bde8-62f9f3763599"}], "vid": [{"value": 36879}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:55:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13074-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:55:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:55:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "47-<br />\n<br />\nVOL. XXVIII, No.2<br />\n<br />\nBALTIMORE, MD., OCTOBER 9, 1923<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nR. O. T. C. HOLDS ORGANI- \"DON\" VANNEMAN LEADS ATHLETIC BOARD HOLDS<br />\nMEETING TO DISCUSS<br />\nYELL PRACTICE AT THE<br />\nZATION MEETING FOR<br />\nCONFERENCE<br />\nTHURSDAY ASSEMBLY<br />\nAPPOINTMENTS<br />\n<br />\nBLACK AND BLUE GRIDDERS HOLD HEAVY PRINCETON TEAM<br />\nTO 16-7 SCORE<br />\n<br />\nMajor Hoisington Not to Arrive Until Short Meeting Devoted to Student Af- Bonner Presides at First Meeting of<br />\nAthletic Body<br />\nfairs. Pep Aroused for PrinceFirst of November<br />\nton Game<br />\nThe advisability of Hopkins<br />\n<br />\nWolbert Makes Touchdown Which Saves Hopkins from Being<br />\nBlanked by Tigers<br />\n<br />\nThe Reserve Officers Training<br />\nCorps held its organization meeting on Wednesday, October 3, at<br />\n4:15 P. M., in the C. E. Hall. The<br />\nentire unit appeared in uniform.<br />\nCaptain Paul took charge of the<br />\nCorps in the absence of Major<br />\nHoisington. The new commander<br />\nwill take charge November 1; until<br />\nthat time Captain Paul will be in<br />\n<br />\nCharlie Wolbert saved the day<br />\nAffairs at Johns Hopkins re- entering the Maryland ConTRACK TEAM TO HOLD OR- for Hopkins last Saturday when<br />\nturned to \"status quo\" when \"Don\" ference on Athletics formed the<br />\nGANIZATION MEETING<br />\nhe scored the Black and Blue's<br />\nVanneman, last year's popular cheer principle topic for discussion at<br />\nTHIS AFTERNOON<br />\nleader, returned to lead yell prac- the first meeting of the Athletic Return of Stars Gives Team Bright only touchdown. in a hardfought game against the PrinceOutlook.<br />\ntice at the Thursday assembly. The Board, which was held in the<br />\ncantrack<br />\nof<br />\nmeeting<br />\nthe<br />\nton eleven. The contest was full<br />\nWith<br />\ngreater part of the meeting was de- Barn. Many other matters were<br />\nvoted to going over the yells and considered including the award- didates today the fall track season, of interest throughout, but weak<br />\nit<br />\nsongs for the benefit of the Fresh- ing of letters to the members of will be in full swing, as the cross spots on both teams prevented<br />\nmen in preparation for the Prince- the swimming team of last year; country squad had its first prac- from being an exhibition of extra<br />\ngood football. Neither team<br />\nton game. Vanneman spoke for a the football season; and a num- tice yesterday.<br />\ncharge.<br />\nplayed a steady game, both sides<br />\n12.20<br />\nat<br />\nis•<br />\ntodays<br />\nmeeting<br />\nThe<br />\nfew minutes on the value of cheer- ber of topics which were left inAn appeal was made for candiing the team, and urged that the complete by last years Board. at 110 M. E. Drs. Abercrombie waiting for the breaks which<br />\ndates for the Band. All men who<br />\nUnfortunately, this edition of the and Van Orman, Captain Booth eventually came their way. The<br />\nlarge Hopkins attendance at the<br />\nNews-Letter had to go to press<br />\nwish to join and former Band memgreat number of substitutes used<br />\nPrinceton game of last year be before the results of the meeting and Coach Le Cato will give short<br />\nbers desiring instruments are asked<br />\nby the Tigers was probably the<br />\nseathe<br />\naddresses, and plan's for<br />\nduplicated. Jenifer and Townsend could be determined.<br />\nbox<br />\noffice<br />\npost<br />\nnames,<br />\ntheir<br />\nto leave<br />\nThose seek- cause of their uneven brand of<br />\nalso led the cheering.<br />\nThe newly formed Maryland son will be discussed.<br />\nnumbers and type of -instrument<br />\nplaying.<br />\nRandolph Norwood, president of Conference on Athletics held a ing positions as assistant managers<br />\nOffice.<br />\nMilitary<br />\nthe<br />\nin<br />\nthey play<br />\nIt was the powerful onslaught<br />\nthe Student Council, told the Fresh- meeting last Thursday at which are especially urged to attend.<br />\n,The Band will play at all games,<br />\nof<br />\nPrinceton's huge backfield<br />\nthe rules on eligibility and mem- Freshmen will find one of the best<br />\nboth at Homewood and on foreign men that the burden of selling sea- bership were adopted. These<br />\nof recent years to men which caused the downfall of<br />\nfields. The first rehearsal will be son tickets for the Hopkins foot- rules are detrimental to Hopkins, opportunities<br />\nthe J. H. U. gridders. Supported<br />\nheld immediately after the organi- ball games would fall on them. The so it is believed that this Univer- race under varsity colors as there<br />\nby a line that can not be rated<br />\nzation of the R. 0. T. C. on Mon- upperclassmen are busy at this time sity will not join the Conference. are many vacancies to be filled.<br />\nday, October 8. Fr the present starting the ball rolling in the many The faculty rules at Hopkins deOf last year's stars, Captain high arriong the greater college<br />\nteams, Beattie and Snively forced<br />\nscholastic year Junior and Senior<br />\nstudent activities, so the Frosh is mand a more stringent rule for Booth, Clarke, Maxwell, Dorcus,<br />\nengineering students are required<br />\neligibility of players than is called Norwood and Proctor are the nu- their way past their opponents<br />\nto attend only one recitation and called upon to 'assume the roll of for by the<br />\nConference rule, which cleus for a fine team. New hur- for gains which seemed to carry<br />\none drill during the week. This Salesman Sam. The price for a redoes not specify that players be dlers especially are needed to fill them dangerously'near the goal.<br />\nplan was adopted in order that served seat for the six games played<br />\nbona fide members of the collegiThe Tiger backs failed to make<br />\nthe places left vacant by Aaronthese men might have the advan- at home, not including the Maryate or graduate schools. This<br />\ngains through the line,<br />\nconsistent<br />\ntage of this training yet not be hard land game, is five dollars.<br />\nAaronson was last<br />\nwould allow the smaller colleges son and Hearn.<br />\npushed for time.<br />\nThe Freshmen will have a chance to play men who are members of because of the four-year competi- the Hopkins players stopping<br />\nnumber<br />\nAt this writing the total<br />\nto prove their mettle in the ticket- the high schools which are con- tion rule and Hearn through grad- nearly every attempt to gain by<br />\nof men in the R. 0. T. C. is 299. selling campaign for the stadium<br />\nnected with those institutions. uation. In the weights, broad that route and on several occaOf this number 142 are freshmen. attractions will furnish stiff compeHopkins teams are forbidden to jump and pole vault new faces will sions throwing them for a loss.<br />\nIt is hoped by the Military Depart- tition this year.<br />\nstage contests with such organi- appear. Fred Rich, ineligible this Princeton baffled the Blue Jays<br />\nment that before the middle of the \"Buck\" Bonner, captain of the<br />\nby one line play, however, using a<br />\nzations. It is doubtful that Hopmonth our quota of 300 students Varsity football team, has succeedspring for baseball, may be a find tactic which hefted them very<br />\nkins will enter the State Conferwill be oversubscribed. This is a ed Tom Landy, captain of last<br />\nworthwhile gains at the most opence when the entries close on in the shot and discus.<br />\ndistinction which few of the units year's Varsity, as proprietor of the<br />\nwill<br />\nteam<br />\ntimes. The forward passcountry<br />\nportune<br />\ncross<br />\nThe<br />\nOctober 14.<br />\nabout the country will be able to store at the Barn. He is an agent<br />\nwhich<br />\nfeatured in Princeton's<br />\ning<br />\nThe Board was also 'concerned have most of its veterans back,<br />\n•attain. All members of the Hop- for Katz & Sons (clothing); Hess<br />\nlast<br />\nplaying<br />\nfall was not as helpwith the voting of letters to the and Captain Booth is encouraged<br />\nkins Unit are wearing the gold star & Sons (shoes); the Hatterie<br />\nthis year, although<br />\nto<br />\nful<br />\nthem<br />\nmembers of last year's swimming by the size of the squad.<br />\non their sleeves to signify that this (hats); Spalding & Bachrach (aththeir<br />\ntouchdowns was<br />\none<br />\nof<br />\nteam. The natators were awardgroup is on the distinguished list. letic goods and Ford supplies) ; and<br />\n\"The freshmen look promising, made by a pass from Gorman to<br />\ned their letters but due to some<br />\nThe following are the officers the Van Company (men's furnishthe best pros- Beattie.<br />\nin the A. A. Board and the team has<br />\ncomplication<br />\n,<br />\nfor 1923-24:<br />\nings). \"Buck\" will appreciate the<br />\nmeeting, there was no vote of pects it has had for some time,\" Princeton scored the first<br />\nmen.<br />\ntrade<br />\nof<br />\nHopkins<br />\npoints in the game about five minASSISTANT INSTRUCTORS<br />\naward made. This is only a for- said Booth.<br />\nDean Latane announced that all<br />\nutes after the opening whistle by<br />\nCadet Majors<br />\nmality in the management of the<br />\nfirst and second year students must<br />\nwell placed dropkick from the<br />\na<br />\nClinton Rector<br />\nAssociation, but it is necessary CHRISTIAN SERVICE CLUB HOLDS<br />\nline. The ball had pre30-yard<br />\ntake a physical examination as soon<br />\nFIRST MEETING<br />\nthat all such forms be followed to<br />\nWilliam H. B. Howard<br />\nwill<br />\nbeen<br />\nplaced in Hopkins'<br />\nviously<br />\nas possible. Dr. Abercrombie<br />\nThe Chri-stian.Service Club held<br />\nRussel R. E. Passano<br />\npreserve the equilibrium of the<br />\nlong punt from the<br />\na<br />\nby<br />\nbe prepared to make examinations<br />\nan organization meeting on Mon- territory<br />\nJohn V. B. Shriver<br />\nAthletic body.<br />\nof<br />\nthe field which passed<br />\nmiddle<br />\nevery day except Saturday and SunThe question as to whether day, October 8, in Room 103, GilJames L. Wasson<br />\nwell over Bonner's head. Turnday from three to six o'clock in the<br />\nCharles E. Sener<br />\nHopkins should have a basketball man Hall, at which plans for the<br />\nbull made a poor kick on the next<br />\nafternoon. The Dean also called<br />\nConrad R. Kennedy.<br />\nteam this year was another sub- coming year were discussed, the play giving<br />\nPrinceton the ball on<br />\nattention to the ruling thai all first<br />\nject for debate at the session. The<br />\nField and Staff<br />\nprogram includes a good number the 20-yard line. Smith easily<br />\nand second year men must take<br />\nlapse of two years since J. H. U.<br />\nMajor James E. Mount, Comeither R. 0. T. C. or Physical<br />\nwhich will be ad- made the field goal. The 'remainwas represented on the court has of meetings<br />\nmanding Unit (Section I).<br />\nTraining, unless excused by Dr.<br />\nwide der of the first quarter looked sad<br />\nMajor Robert E. Peyton, Com- Abercrombie on account of physical caused interest in the game to lag dressed by speakers having<br />\nfor the j. H. U. as the Tiger backbut those who are familiar with reputation in the religious field.<br />\nmanding . Infantry Batt. (Section<br />\nfield ran ragged over the field,<br />\ndisability.<br />\nHopkins activities realize that<br />\nII).<br />\nThis club was originally the skirting the ends for large gains.<br />\nCaptain Randolph Norwood, 0.D. K. APPOINTS COMMITTEES ON there is much promising material Preachers' Club, formed in 1920, They failed to score any more beat Homewood with which to build<br />\nPlans and Training (Section I).<br />\nCAMPUS AFFAIRS<br />\nbut the membership qualification fore the end of the period.<br />\nCaptain .Alan N. Gump, Unit Omicron Delta Kappa Honorary up a team. The principle drawvery<br />\nwas changed from \"those who are The second quarter was<br />\nAdjutant (Section I).<br />\nmuch like the first although the<br />\nFraternity held its first meeting back at present is the lack of a<br />\ntheir life to religious<br />\nFirst Lieutenant Thomas W. of the year on Wednesday, Octo- place in which to play and an ef- to devote<br />\nHopkins team showed signs of<br />\nJenifer, Battalion Adjutant (Sec- ber 3, in Room 206, M. E. Build- fort is. being made to obtain a work\" to \"all those interested in tightening. The J. H. U. rooters<br />\ntion II).<br />\ning, at 1.30 P. M. Joseph Leopold hall in which games and practice Christian work\" and the object of were thrilled and then disappointManaMaster Sergeant W. T.<br />\nwas elected secretary to fill the va- can be held. The Board also dis- the club is to promote religious ed when Turnbull missed a placement kick by a margin which was<br />\nhan (Section II).<br />\ncancy caused by the withdrawal of cussed the appointment of a bas- fellowship.<br />\nThe officers are E. Paul Sylves- measured in inches.<br />\nStaff Sergeants R. H. Clark C. P. Coady from the university. ket-ball manager at last *night's<br />\nter, president; William N. Mc- Toward the close of the half a<br />\n(color,sergeant), Section I; T. B. Dormitory, Membership, Publici- meeting.<br />\nFaul, Jr., vice-president; Reno spectacular 60-yard run through a<br />\nMagill (color sergeant), Section I. ty, Extension and Improvements<br />\nHarp, Jr., secretary, and Allison broken field placed the ball withCommittees were named. In addiCOMPANY \"A\"<br />\nNOTICE!<br />\nin 15 yards of Princeton's goal.<br />\nLong, Jr., treasurer.<br />\ntion two men have been appointed<br />\nCaptains<br />\nThere will be a meeting of<br />\nbecome<br />\nto<br />\ninvitation<br />\nAfter two unsuccessful attempts<br />\ncordial<br />\nA<br />\nto investigate the subject of tutors<br />\nthe Student Activities CounGeorge M. Shriver, I.<br />\nService<br />\ngain through the line the Tigers<br />\nto<br />\nChristian<br />\nthe<br />\nof<br />\nmembers<br />\nfor backward athletes. The meetcil today at 12.30 in Room<br />\nArthur C. Milchael, II.<br />\nand completed a forward<br />\nuniversity<br />\ntried<br />\nall<br />\nto<br />\nClub is extended<br />\nAll Business<br />\n109, M. E.<br />\ning also passed a resolution that<br />\nFirst Lieutenants<br />\nput them on the 2-yard<br />\nwhich<br />\npass<br />\nexinare<br />\nthe<br />\nto<br />\nactivities<br />\nof<br />\nespecially<br />\nManatzers<br />\nstudents, and<br />\neach day, before the evening meal,<br />\nJohn T. Martin, I.<br />\npected to attend, as an atplunge gave<br />\noff-tackle<br />\nline<br />\n.An<br />\ncoming class, Who are interested<br />\nat the dormitory, the University<br />\nOliver M. Shipley, II.<br />\ntempt will be made to sysThe try for<br />\ntouchdown.<br />\na<br />\nthem<br />\nin the work of the club or in<br />\nOde or some other suitable song<br />\ntematize the bookkeeping.<br />\nHerman Chor, II.<br />\nContinued on page 4, col. 2<br />\nChristian work of any kind.<br />\nbe sung.<br />\nContinued on page 2, col. 5<br />\n<br />\n\f•<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 9, 1923<br />\n<br />\n2<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\nTRYOUTS FOR BARNSTORMERS<br />\nCLUB TO BE HELD SOON<br />\n<br />\nY. M. C. A. RECEPTION TAKES<br />\nPLACE IN C. E. BUILDING<br />\n<br />\nETY MAKCIVIL ENGINEERING SOCI.<br />\nING PLANS FOR THIS YEAR<br />\n<br />\nPlans are now being formulated<br />\nAbout three hundred undergradFreshman \"tryouts\" for the<br />\nthe executive committee of the<br />\nby<br />\nBarnstormers' Musical Comedy uates attended the annual Y. M. C.<br />\nFOUNDED 1897.<br />\nstudent. chapter of the<br />\nHopkins<br />\nwill be in the form of vaudeville A. freshman reception which was American Society of Civil Engiheld in the C. E. Hall last Thurs- neers that are expected to assure<br />\n$2.00 acts. At a meeting of the BarnSubscription<br />\nstormers' Club last Thursday day evening. T. R. Marsh, the one the most successful seasons in<br />\nat<br />\nnight it was announced that this president of the, Hopkins Y. M .C. the history of the local branch.<br />\nEntered as second-class matter December 3, 1909, at the Postoffice<br />\n1879.<br />\n3,<br />\nNovember<br />\nCongress,<br />\nof<br />\nAct<br />\nunder<br />\nSome of the best known civil enBaltimore, Md.,<br />\nyear the' usual one-act plays held A., was the presiding officer.<br />\nA change in the progiam was gineers in this section of the coununcover talent for<br />\nPublished semi-weekly from October to June by the students of Johns in the fall to<br />\ntry will be brought to Homewood Hopkins University.<br />\nthe spring production would be necessitated at the last minute, due to address the members at the regto President Goodnow's inability to<br />\nMAN- abandoned. As dancers, singers,<br />\nular monthly meetings. Interest in<br />\nBusiness communications should be addressed to the BUSINESS<br />\nattend. The faculty was representcommunications<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other<br />\nthese talks will be greatly encomedians (and comediennes)<br />\ned by Dr. Latane, dean of the colMould be sent to the MANAGING EDITOR.<br />\nand other musical comedy enter- lege faculty, who made the welcom- hanced by the improved motionpicture projecting machine purHomewood 100 tainers are needed it was decided<br />\ning address, and by Dr. John C.<br />\nTelephone<br />\nchased during the latter part of<br />\nto have Freshmen show their French, chairman of the student afpast scholastic year by the exthe<br />\nManager<br />\nBusiness<br />\nEditor-in-Chief<br />\na \"vaudeville night\" fairs committee of the Board of ecutive committee.<br />\nin<br />\nabilities<br />\n'25.<br />\nPHILIP W. HOWARD,<br />\nJOSEPH LEOPOLD, '24.<br />\nStudies.<br />\nat which members of the club and Collegiate<br />\nOpportunity will also be providalso included short<br />\nThe<br />\nprogram<br />\nManaging Edttor<br />\nAdvcrasing Manager<br />\nthis year for the members of the<br />\nwill<br />\nbe<br />\ned<br />\npresent.<br />\nmembers<br />\nalumni<br />\nWILLIAM G. DEAN, JR., '24.<br />\ntalks by J. I. Bonner, president of<br />\n'24.<br />\nto meet and talk over some<br />\nchapter<br />\nFITZGERALD DUNNING,<br />\nThe new men are to arrange their the Athletic Association; D. C.<br />\nAssistant Managing Editor<br />\nstunts and work them up. Clar- Turnbull, president of 0. D. K.; of the interesting current engineerT. REESE MARSH, '24.<br />\nCirculation Manager<br />\ning problems. Regarding this, Proence Adams,'24, will coach those Randolph Norwood, president of<br />\nAssociate Editors<br />\nfessor John H. Gregory, head of<br />\nJOHN C. LEWIS, JR., '24.<br />\nwho wish to learn dancing. The the Student Council, and G. M. the department of civil engineering,<br />\nRICHARD C. TILGHMAN, '25.<br />\nShriver, Jr., president of the StuJOHN W. PARSONS, '25.<br />\ndate of these \"tryouts\" will be anAssistant Business Managers<br />\nhas expressed the opinion that the.<br />\nBENJAMIN T. ROME, '25.<br />\ndent Activities Council. The final<br />\nSmallwood,<br />\nmonthly meetings should provide<br />\nHugh<br />\nby<br />\nnounced<br />\n'25.<br />\nMA.RRIAN,<br />\nD. MILES<br />\nJunior Editors<br />\ntalk of the evening was made by<br />\nan<br />\nexcellent oportunity for the<br />\nG. DONALD GIESKE, '25.<br />\nV. EDWARD THOMSEN, JR., '26.<br />\nnext<br />\nat<br />\nthe<br />\nclub,<br />\nthe<br />\npresident of<br />\nE. A. Schaal, from the NorthwestARTHUR L. NELSON, '26.<br />\nJOHN T. DIXON,'24.<br />\nof the noted inability<br />\novercoming<br />\nAssembly.<br />\nERNEST A. STRATHMAN, '26.<br />\nern University, who was recently<br />\nA. J. McKAY, '26.<br />\nof engineers as a whole to get upon<br />\nLEO C. MUTH, '24.<br />\nThe week of Monday, March made general secretary of the HopC. EUGENE TOVELL, '24.<br />\nALGER G. Hiss, '26<br />\ntheir feet, express their opinion,'<br />\nOTHO J. KELLER, III, '25<br />\nEDWARD 0. MICHEL, '26.<br />\nas kins Y. M. C. A.<br />\ndefinitely<br />\nchosen<br />\n17,<br />\nbeen<br />\nhas<br />\n'26<br />\nKIDD,<br />\nJACKSON<br />\nJ.<br />\n'24.<br />\nHUTZLER,<br />\nand impart to others their knowlG.<br />\nCHARLES<br />\nthe date of the show. The theaedge.<br />\ntre will be either the Lyceum or SOPHOMORES NOMINATE CLASS<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nAn organization meeting of the<br />\nOFFICERS AT CLASS MEETING<br />\nthe Academy—either of which<br />\nAt the first meeting of the Soph- chapter will be held within the next<br />\nthis<br />\ndate.<br />\nfor<br />\nsecured<br />\nbe<br />\ncan<br />\nMd.<br />\nBaltimore,<br />\nSts.,<br />\nSouth<br />\nand<br />\nLombard<br />\nCo.,<br />\nr<br />\nPrinted by The Read-Taylo<br />\nomore class held Wednesday, Oc- few days in the C. E. Building. The 1<br />\nProminent local charities will<br />\ntober 3, Randy Norwood, president regular combined monthly meeting<br />\nback the show, each night of the<br />\nof the Student Council, asked that and smoker will be held as forweek's run being for the benefit<br />\nBALTIMORE, MD., OCTOBER 9, 1923<br />\nthe Sophomores, at the request of merly.<br />\nof a different charity.<br />\nAll civil engineering students<br />\nthe Dean, should not appear on the<br />\nThe plot, location, and music<br />\nthe status of freshmen are<br />\nabove<br />\nthe night of the Y. M. C.<br />\nof the new production are guard- campus<br />\nfor membership in the soeligible<br />\nA. reception.<br />\nThis step was<br />\nAN ALMA MATER<br />\ned with utmost secrecy. The<br />\nyear forty undergradciety.<br />\nLast<br />\nthought advisable to prevent hosOmicron Delta Kappa's recent recommendation that \"the Uni- plot is said to be far above the<br />\nthe roster, the highwere<br />\non<br />\nuates<br />\ntilities which might arise between<br />\nin<br />\ninteraverage<br />\ncomedy<br />\nmusical<br />\nevening<br />\neach<br />\nbefore<br />\nin<br />\nsung<br />\nthe<br />\nest<br />\nhistory of the club<br />\nmark<br />\nbe<br />\nsong)<br />\nversity Ode (or some suitable<br />\nthe two lower classes on that night.<br />\nand continuity. The lyrics,<br />\nest<br />\nwho<br />\nwere elected last<br />\nofficers<br />\nThe<br />\nmeal at the Memorial Dormitory\" brings to mind the fact that Johns written by a Hopkins man, fill The Sophomores pledged to the<br />\nWilliam N.<br />\nPresident,<br />\nare:<br />\nspring<br />\nPresident of the LALident Council<br />\nHopkins has no suitable Alma Mater. \"Veritas Vos Liberabit\", al- out a well rounded show.<br />\nVice-President,<br />\nClayton C.<br />\nthat they would make no disturb- Crout;<br />\nare<br />\nrequested<br />\nin<br />\nUndergraduates<br />\nconsidered<br />\nbe<br />\nnot<br />\nmay<br />\ntradition,<br />\nthough it is valuable because of<br />\nance on that evening but saw no Singleton; Secretary, John Wythey<br />\nany<br />\nsuggestions<br />\nover<br />\nturn<br />\nto<br />\nsong, and Treasurer, Robert B.<br />\nthis category; firstly, because the score is extremely difficult to render may have, in the way of jokes, reason why they should not attend<br />\nBurgess.<br />\nthe reception.<br />\nharmonoiusly and, secondly, because the words are more or less songs, dialogues, and such, to<br />\nBuck Bonner announced that he<br />\nHugh Smallwood, Tom Jenifer,<br />\nR. 0. T. C. HOLDS ORGANIZATION<br />\nuninspiring to a group of college undergraduates.<br />\nwould .have charge of the store at<br />\nMEETING FOR APPOINTMENT<br />\nHamburger.<br />\nIsaac<br />\nor<br />\nthe Barn this year and solicited<br />\nAn Alma Mater should include sentiment similar to that conContinued from page 1<br />\nSophomore trade. Kelso Morrill<br />\nCayuSecond<br />\nAbove<br />\n\"Far<br />\nLieutenants<br />\nCornell<br />\nin<br />\nHarvard,\"<br />\n\"Fair<br />\ntained in Harvard's<br />\nMUSICAL CLUB TO BE ORGANIZED<br />\ntold of the University ring, which<br />\nI.<br />\nC.<br />\nRoberts,<br />\nWilliam<br />\nBARN<br />\nAT<br />\nNIGHT<br />\nTHURSDAY<br />\nga's Waters\" and in innumerable others. The Ode is only approit is hoped will eventually be worn<br />\nII.<br />\nN.<br />\nHooper,<br />\nJoseph<br />\nthe<br />\nof<br />\nmeeting<br />\nThe organization<br />\nHe, as<br />\npriate for a formal occasion such as Commencement. For a song Musical Club, composed of the by most Hopkins men.<br />\nJames V. Alfriend, II.<br />\nof<br />\nthe<br />\nchairman<br />\nRing<br />\nCommittee,<br />\ncomes<br />\nteam<br />\nfootball<br />\nJoseph Kaplan, II.<br />\nthe<br />\nas<br />\nor<br />\nmeal<br />\nevening<br />\nMusical and Glee Clubs, will take<br />\nto be rendered before the<br />\nhas<br />\na<br />\nfor<br />\nring.<br />\nreceived<br />\nplans<br />\nThis<br />\nCOMPANY \"B\"<br />\nthe Trophy<br />\non the field, however, it is a bit too heavy. And as the Ode is too place Thursday night in<br />\nring<br />\nan<br />\nis<br />\nin<br />\nstone<br />\nonyx<br />\nto<br />\nhave<br />\nCaptains<br />\nRoom of the Barn. The purposes<br />\nheavy so are \"On the Line\", \"Come Stand Together\" and others, of the meeting are to elect a bus- the center; on side of the ring<br />\nRobert D. Ohrenschal, II.<br />\nthere will be the year of your class<br />\nWilliam N. Young, I.<br />\ntoo light.<br />\niness manager to succeed \"Jimmy\"<br />\nand<br />\non<br />\nthe<br />\nother<br />\nside<br />\nthe<br />\nHopkins<br />\nFirst Lieutenants<br />\nwho will not return to the<br />\nThe News-Letter is open to suggestions for old Hopkins songs Thomas,<br />\nseal. The ring will be offered for<br />\nFred W. Geib, I.<br />\nuniversity, and to start work in<br />\nwhich may be used as an Alma Mater. And if suggestions are lack- earnest for the year's musical pro- fifteen ($15) dollars a piece. HowAustin A. Lamar, I.<br />\never, it will be necessary for fifty<br />\nA. Tongue, II.<br />\nan<br />\nThomas<br />\nundergraduate<br />\ninclined,<br />\neither<br />\nmusically<br />\nfor<br />\ncandidates<br />\nthat<br />\nanyone<br />\nask<br />\nAll<br />\nwe<br />\ngram.<br />\ning may<br />\nsales before this price may be obSecond<br />\nLieutenants<br />\nthis<br />\nat<br />\nPresent<br />\nbe<br />\nto<br />\nurged<br />\nalumnus, try a hand at writing Johns Hopkins University an Alma club are<br />\ntained.<br />\nWilliam<br />\nC.<br />\nI.<br />\nGardner,<br />\nbe<br />\nwill<br />\ntime<br />\nno<br />\nthat<br />\ntime in order<br />\nPresident Middleton called for<br />\nMater.<br />\nLawrason<br />\nII.<br />\nR.<br />\nKent,<br />\nlost.<br />\nnominations for the class officers<br />\nFrederic L. Mohle, II.<br />\nPresident Jack Croker is very<br />\nfor the year 1923-24. The followEdgar<br />\nT. Moseley. I.<br />\nmuch impressed with the prospects<br />\nFor<br />\ning<br />\nthe<br />\nnominations.<br />\nwere<br />\nA BANNER SEASON<br />\n\"C\"<br />\nCOMPANY<br />\nof the Musical Club this season.<br />\nBrown,<br />\nFonda,<br />\nE.<br />\nPresident,<br />\nwere<br />\nSaturday<br />\nlast<br />\nPrinceton<br />\nto<br />\njourneyed<br />\nCaptains<br />\nwho<br />\nHopkins men<br />\nThe absence of Johii Sherwood,<br />\nTownsend, Howard, Hiss and<br />\nHerbert E. Wilgis, I.<br />\nwell rewarded by the splendid exhibition which the Black and Blue. second bass, and Tom Macubbin,<br />\ndent,<br />\nAlmy,<br />\nFor<br />\nVice-Presi<br />\nLove.<br />\nWilliam M. Rowland, II.<br />\neleven put'forth. Recovering quickly from an inauspicious begin- tenor, and the late Harry Mercer, Welsh, Stock, W. Taylor, Nelson,<br />\nFirst Lieutenants<br />\nfirst bass, will leave Croker as a<br />\nning, the Hopkins men fought the Tiger every inch until, towards<br />\nKidd and Kaufholz. For SecreP. Barton, I.<br />\nHubert<br />\nThere<br />\nquartette.<br />\nanother<br />\nfor<br />\nnucleus<br />\ntary, Stevens, Burgess, Ningard, Lloyd W. Hyatt, II.<br />\nthe end of the third quarter, Coach Roper sent in a steady stream of<br />\nis plenty of available material from<br />\nNelson, T. Taylor, Love and Jacksubstitutes in an effort to check the Hopkins onslaught.<br />\nSecond Lieutenants<br />\nthe members of last year's Glee<br />\nFor Treasurer, Crook, Thomas, Kenneth L. Gilbert, I.<br />\nson.<br />\nand<br />\nkicks<br />\nfive<br />\nblocked<br />\nBlue<br />\ncombination.<br />\ngood<br />\nand<br />\na<br />\nBlack<br />\nmake<br />\nClub to<br />\nThe mere fact that the<br />\nBaldwin and Bold. For §erWilliam N. McFaul, I.<br />\nMandolin Club has lost only Love,<br />\nin<br />\nthree<br />\nbeen<br />\nbeaten<br />\nThe<br />\nnot<br />\nhas<br />\nwhich<br />\neleven<br />\nan<br />\non<br />\ntouchdown<br />\nscored a<br />\nSlowik, Howard, William E. Hopkins, II.<br />\ngeant-at-arms,<br />\nthrough<br />\none man, Foster Morrell,<br />\nyears and whose goal line has been crossed only once since the fall<br />\nLevy, Strobel, Berndt and Jewett. Julian D. Tebo,<br />\ngraduation. Its prospects are therea<br />\nhas<br />\ndeveloped<br />\nOrman<br />\nVan<br />\nCoach<br />\nthat<br />\nevidence<br />\nsufficient<br />\nThe following were appointed as<br />\nof '21, is<br />\nCOMPANY \"D\"<br />\nfore even brighter than those of<br />\nalbe<br />\nnot<br />\nshould<br />\nhowever,<br />\nPep Committee:<br />\nthe<br />\nSophomore<br />\ngood football team. Excess optimism,<br />\nCaptains<br />\nthe Glee Club.<br />\nthat<br />\nPrinceton<br />\nStephens,<br />\nLove,<br />\nHoward,<br />\nCrook,<br />\nmind<br />\nin<br />\nborne<br />\nbe<br />\nmust<br />\nfact<br />\nMarsh, I.<br />\nThe<br />\nR.<br />\nThomas<br />\nlowed to prevail.<br />\nThe Glee Club will probably meet<br />\nand<br />\nBaldwin,<br />\nMartin,<br />\nNelson,<br />\nMills<br />\nfrom<br />\nopposition<br />\nno<br />\nor<br />\nLeo J. Gould, II.<br />\nfor rehearsal every Thursday evenhad an inexperienced team and expected little<br />\n.<br />\nFonda.<br />\nFirst Lieutenants<br />\nthe invaders. And then, too, it must be remembered that all state ing and the Mandolin Club on MonWysong, II.<br />\nB.<br />\nJohn<br />\nopgood<br />\na<br />\nis<br />\nThere<br />\nevening.<br />\nday<br />\nteams are one hundred per cent, stronger than ever before.<br />\nJoseph G. Leopold, I.<br />\nportunity for many candidates to<br />\nNOTICE!<br />\nCoach Van Orman and his team are to be congratulated for the make the clubs. If the Dramatic<br />\nSecond Lieutenants<br />\nwill<br />\nbe a meeting of<br />\nThere<br />\nLewis P..Gundry, I.<br />\nshowing made Saturday. The News-Letter predicts a banner foot- Club presents a musical comedy<br />\nthe. entire News-Letter Staff<br />\nCharles G. Post, I.<br />\nball season and victory over Maryland and St. John's. It warns, the support of the Musical Club<br />\nin the office today at 12.20.<br />\nThomas Summers, II.<br />\nhowever, that only hard work and co-operation between student body will be necessary to put their show<br />\nGeary A. Long, II.<br />\nacross.<br />\nand team can bring this to pass.<br />\n<br />\nMA<br />\n<br />\nsiv<br />\nCo<br />\nem<br />\nins<br />\ngt;<br />\ngz<br />\nEr<br />\nde<br />\n<br />\nit<br />\nCa<br />\nalt<br />\net;<br />\nan<br />\nco<br />\nan<br />\nac<br />\n<br />\nth<br />\net<br />\nco<br />\nki<br />\n<br />\n\fAK-<br />\n<br />\nited<br />\nthe<br />\nthe<br />\n<br />\nigi-<br />\n<br />\nure<br />\n; in<br />\n<br />\nenunDo(I<br />\n.eg: in<br />\nenonurof<br />\nex-<br />\n<br />\nridthe<br />\n,me<br />\n!eriroof<br />\nng,<br />\nthe.;<br />\nide<br />\nthe<br />\nlity<br />\n)on<br />\non;<br />\nwl-<br />\n<br />\nthe<br />\next<br />\n:he<br />\ning<br />\nor-<br />\n<br />\nnts<br />\nare<br />\n<br />\nSO-<br />\n<br />\nad-<br />\n<br />\n;hub<br />\nast<br />\nN.<br />\nC.<br />\nTyB.<br />\n<br />\nON<br />\n<br />\n3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 9, 1923<br />\ntreasurer, Messrs. Geib,<br />\nMAJOR CAREY, PRESIDENT OF ST. TENNIS TEAM TO INAUGUURATE B. Garey, who resigned from the for<br />\nJOHN'S,PLANS FOR GREATER<br />\nFALL PRACTICE<br />\npresident of Thomas, Howard, Smallwood and<br />\nbecome<br />\nto<br />\nuniversity<br />\nCOLLEGE<br />\n<br />\nTHE READ-TAYLOR Co.<br />\n<br />\nWith, the influx of expert ten- St. John's College. Elections will Turnbull; for -3ergeant-at-arms,<br />\nBaltimore, Oct. 5.-ComprehenPrinters or<br />\nBarton, Wilgis, Tovell, J.<br />\nsive plans to provide St. John's nis players in the freshman class be held on Friday. The following Messrs.<br />\nand<br />\nPackard;<br />\nand<br />\nRector<br />\nHonorary<br />\nShriver,<br />\nFor<br />\nCollege at Annapolis a minimum and the return of nearly all of last were nominated:<br />\nThe Johns Hopkins<br />\nCouncil, G. Shriver,<br />\nendowment of $300,000 in order to year's squad the prospects for President, Doctors Thack, Chris- for Student<br />\nKennedy, Perkins, SmallNEWS-LETTER<br />\ninsure the retention of the high- the 1924 tennis team are very tie, Schwartz, Hulburt and W. B. Barton,<br />\nO'Connor.<br />\nand<br />\nwood<br />\npresident,<br />\nclass<br />\nfor<br />\n;<br />\nen<br />\n.<br />\nKouwenhov<br />\nwhen<br />\nlast<br />\nbright.<br />\nyear,<br />\nUnlike<br />\ngrade faculty that has been engaged by the new president, Dr. experienced match players were Messrs. Bonner, Dean, Smallwood,<br />\nEnoch B. Garey, are now well un- according to Jean Hofmeister, Croker and Thomas;for vice-presder way and progressing rapidly, tennis materials at Hopkins now, ident, Messrs. Perkins, Kennedy<br />\nit was announced at the Geenral few, there isa vast wealth of and Marsh; for secretary, Messrs.<br />\ncaptain of the team. In view of jenifer, Marrian, Chor and Gelb<br />\nCampaign Headquarters.<br />\nthe<br />\nfine squad which Capt. Hof<br />\nJudge Walter I. Dawkins, an<br />\nalumnus, has been selected gen- meister expects to turn out he is<br />\neral chairman of the campaign, working on an attractive schedule<br />\nand already has enlisted a general for the spring sport and he hopes<br />\ncommittee composed of alumni to stage matches with many coland a few others who have been leges which have not heretofore<br />\nactively identified with the college been met by the J. H. U. racquethrough membership on its gov- ters.<br />\nIn order to make sure of just<br />\nerning board.<br />\nwhat<br />\nmaterial he has to draw<br />\nThe members of the general<br />\ncommittee enrolled by Judge Daw- from, the Hopkins tennis leader<br />\nkins to date, with their graduation will call his squad out for regular<br />\nfall practice within the next 'few<br />\nyears given, are as follows:<br />\nin.field and parlor<br />\nT. W. Claggett, 1891; Dr. Jo- days. This, he states, will facilYou should see them when<br />\nseph Clement Clark, 1877; Wil- itate the selection of the players<br />\nthey tackle the drawing<br />\nrooms. They shine from the<br />\nliam C. Devecmon, 1881 ; James A. next spring. An organization<br />\ntips of their patent leather<br />\nFechtig, Jr., 1895; Dr. Thomas meeting for the tennis team is to<br />\npumps to the tops of their<br />\npatent leather heads:<br />\nFell; retiring president of St. be arranged just as soon as posThey slick their hair with<br />\nJohn's; State Senator -George A. sible, probably sometime this<br />\n\"Vaseline\" Hair Tonic. It<br />\ngives them that elegant,<br />\nFrick, 1880; former Governor week.<br />\nfinished look.<br />\nThe<br />\nfollowing<br />\nmemlist<br />\ngives the<br />\nPhillips Lee Goldsborough,<br />\nAt all drug stores and student barber shops.<br />\nber of College Board of Vistors nominations for Freshman class<br />\nCHESEBROUGH MANUFACTURING CO.<br />\nand Governors; Judge James P. offices. The election will be held<br />\n(Consolidated)<br />\nNew York<br />\nState Street<br />\nGorter, 1879; Judge Henry. D. in the C. E. Building Assembly<br />\nEvery\"Vaseline\"product is recommended<br />\neverywhere because of its absolute purity<br />\nHarlan, 1878; Judge William H. Hall immediately after Assembly<br />\nand effectiveness<br />\nIn buying a Stetson you need only be conHarlan, 1872; former Governor on October 1 1 :<br />\ncerned with the style-the quality is guaranEmerson C. Harrington, 1884; W:<br />\nPresident<br />\nteed by the name \"Stetson-.<br />\nThomas Kemp, 1897; Ridgely P. 1. Brown<br />\nMelvin, 1899; Addison E. Mulli- 2. Niner<br />\nSTYLED FOR YOUNG ME.14<br />\nken, 1895;'James M. Munroe, 3. Harwood<br />\n1874; Dr. Jame.s A. Nydegger, 4. Day<br />\n1890; Herbert Noble, 1889; for- 5. McNeal<br />\nmer Mayor James H. Preston,<br />\nVice-President<br />\n1881; William Woodward, mem1. Schwim<br />\nber of College Governing Board.<br />\n2. Young<br />\n•- The appeal for contributions to 3. Frantz<br />\nthe endowment fund will be 4. Miller<br />\nlaunched in Baltimore on October<br />\n5. Harwood<br />\n26, and will be carried on through- 6. Farinholt<br />\nout the state and in cities where<br />\n7.' Gibson<br />\nalumni are located. The majority<br />\n8. Hazel<br />\nof the alumni are located in MarySecretary<br />\nland.<br />\n1. Levy<br />\nAll expenses of the campaign<br />\n2. Seletzky<br />\nare borne by the alumni, and every 3. Blumberg<br />\ndollar contributed Ty the general 4. Kerus<br />\npublic will be used for the pur- 5. Marley<br />\nJOSEPH HENRY<br />\nposes for which it is given.<br />\n1797-1878<br />\n6. McAllister<br />\nThe appeal to the general public<br />\nIf any bell was ever heard around the<br />\nBorn at Albany, N.Y., where<br />\nTreasurer<br />\nhe became teacher of mathecarries with it what is believed to<br />\n1. Kleff<br />\nmatics and physics in Albany<br />\nworld, Joseph Henry rang it in his<br />\nbe a novelty in education in MaryAcademy. Leading American<br />\n2. Waters<br />\nphysicist of his time. First<br />\nland. While all alumni subscripfamous experiment at the Albany<br />\n3. Egerton<br />\ndirector of the Smithsonian<br />\ntions will be used to build up the<br />\nInstitution.<br />\n4. Brian<br />\nAcademy. The amazing development<br />\nendowment fund, and all non5. Bauernschmidt<br />\nof the electrical industry traces back<br />\nalumni contributors may have<br />\nStudent Council<br />\ntheir gifts go solely into the ento this schoolmaster's coil of insulated<br />\n1. Grinsfelter<br />\ndowment fund, each non-alumnus<br />\n2. Meredith<br />\nwire and his electro-magnet that lifted<br />\nsubscriber may have the privilege<br />\n3. Cleveland<br />\nof designating a portion of his or<br />\na ton of iron.<br />\n4. Lord<br />\nher gift to be used to create a Stu5. O'Dunne<br />\ndent Aid Fund, from which de6.<br />\nWinchester<br />\nFour years later when Morse used<br />\nserving young men of limited<br />\n7.<br />\nStone<br />\nmeans may borrow to pay part of<br />\nHenry's electro-magnet to invent the<br />\nthe cost of their education. Fre- SENIOR CLASS HOLDS MEETING<br />\ntelegraph, Henry congratulated him<br />\nquently the loan of,a few hundred FOR NOMINATION OF OFFICERS<br />\nwarmly and unselfishly.<br />\ndollars means the difference beRandolph Norwood was aptween remaining in college until pointed chairman of the June<br />\n•graduation or dropping out. The Week Committee of this year's<br />\nThe principle of Henry's coil of wire is<br />\nStudent Aid plan gives to the peo- senior class, at a meeting of<br />\nThe work that was begun<br />\nutilized by the General Electric Comby pioneers like Joseph<br />\nple of each county the opportunity the Senior Class held Friday, Ocbeing carried on<br />\nis<br />\nHenry<br />\nto help ambitious young men in tober 5, in C. E. Hall. George M.<br />\nby the scientists in the Repany in motors and generators that<br />\nsearch Laboratories of the<br />\nt1;eir respective counties.<br />\nShriver and W. Carville Gardner<br />\n<br />\nAthletes<br />\n<br />\n(STETSON<br />\n<br />\nBats<br />\n<br />\nVaseline<br />\n<br />\nHAIREkai'ONIC<br />\n<br />\nWhen Henry<br />\nrang the bell<br />\n<br />\nBLACK AND BLUE JAY TO APPEAR<br />\nEARLY IN NOVEMBER<br />\n<br />\nThe first issue of the 1923-24<br />\nBlack and Blue Jay will appear<br />\nabout November 10, according to<br />\nmembers of the staff interviewed<br />\ntoday. Due to the existence of a<br />\nlarge surplus from last year the<br />\nBoard will ptit out seven iss.ues instead of six. Copy for the publication is already started to pour in<br />\n:and a large number of advertisements have been obtained.<br />\n<br />\nare the other members of the committee. These men were appointed<br />\nby President Bonner at a meeting<br />\nof the senior class held last Friday.<br />\nWork on the June Week will start<br />\nimmediately.<br />\nAt the meeting members of last<br />\nyear's sophomore class who are<br />\ngraduating this year were elevated<br />\ninto the class. Nominations were<br />\nmade for officers for the coming<br />\nyear and also for an honorary class<br />\npresident to succeed Major Enoch<br />\n<br />\nGeneral Electric Company.<br />\nTheyare constantlysearching for fundamental principles in order that electricity may be of greater<br />\nService to mankind.<br />\n<br />\nlight cities, drive railroad trains, do<br />\naway with household drudgery and<br />\nperform the work of millions of men.<br />\n<br />\nGENE AL ELECT<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 9, 1923<br />\nwhich the Princeton coach sent<br />\ninto the game from time to time,<br />\nthe Black and Blue warriors<br />\ngamely resisted the powerful attack which was launched against<br />\nthem. It was by sheer brute<br />\nstrength that the New Jersey team<br />\nJunior Class meeting in Room<br />\ngained the distance which finally<br />\n12.0, C. E. today at 12.20 for<br />\nthe nomination of officers.<br />\nplaced the pigskin over the line<br />\nVery important.<br />\nfor their second touchdown. After<br />\nthat Hopkins abandoned the deINTERFRATERNITY BOARD HOLDS<br />\nfensive<br />\nstyle of play which they<br />\nINITIAL MEETING OF 1923-24<br />\nhad heretofore used and went<br />\nSEASON<br />\nJohn H. Croker presided over tooth and nail after the heavier<br />\nthe meeting of the Interfraternity team.<br />\nBoard, which convened for the \"Doug\" Turnbull started the<br />\nfirst time of the year in Gilman Hopkins attack in the last period<br />\nHall yesterday. The meeting was by running the ball back from a<br />\ncalled for the discussion of the long punt by Van Gerbig of<br />\nrushing agreement and particular- Princeton for a gain of 40 yards.<br />\nly for the drawing of dates for the The visitors fought like Turks<br />\nNovember entertainments. The from then on gaining ground<br />\nallotting of these dates at an early steadily until forced to kick. from<br />\nperiod is considered to be very im- the 40-yard line. Princeton tried<br />\nportant as the various fraternities to punt back immediately after<br />\nwish to make arrangements for receiving the ball, but Schact<br />\nrushed in and blocked the kick,<br />\ntheir parties as ,soon as possible.<br />\nthe home team recovering the ball<br />\nNEW FRATERNITY ON CAMPUS behind the goal line. The referee<br />\nThe past week has witnessed refused to allow Hopkins the safethe advent of apother national fra- ty which it seemed fo have gained<br />\nternity on Johns Hopkins campus basing his decision on a new rulin the installation of Rho chapter ing of the National Football Comof Phi Sigma Delta. Its present mittee. Princeton was then almembership consists of Emanuel lowed to play the ball from the 20Z. Aaronson, Albert E. Blumberg, yard line.<br />\nThe Tigers had gained nearly 15<br />\nHerman Chor, Albert Dickman<br />\nyards<br />\nwhen they tried a forward<br />\nand Leonard Stulman. This is the<br />\nseventeenth chapter of the frater- pass. The pass was intercepted<br />\nnity, the others being located at by \\\\Tolbert, who, with perfect inthe Universities of Columbia, terference by his teammates ran<br />\nCornell, Pennsylvania, Michigan, beyond the goal line for Hopkins'<br />\nTexas, Denver, Colorado, Chicago, only touchdown. Turnbull sucWisconsin, Rensellaer, New York ceeded on the try for point. The<br />\nUniversity, Boston College, Union Tigers made a fierce attempt to<br />\nCollege, Western Reserve, Ohio regain their former lead of 16<br />\nState and Massachusetts Institute points but the final whistle blew<br />\nwhen they had the ball within 15<br />\nof Technology.<br />\nyards of the goal. The lineup:<br />\nNOTICE!<br />\nCandidates for Hullabaloo<br />\nStaff meet in the Hullabaloo<br />\noffice in the Barn tomorrow<br />\nat 12.20.<br />\n<br />\nDamon—<br />\n\"What did Professor Smith mean<br />\nthis morning when he told you<br />\nthat no man could ever make a<br />\nsilk purse out of a sow's ear?\"<br />\nPythias—<br />\n\"He meant that I'd never be able<br />\nto do good work with a poor pencil.<br />\nGuess I'll have to get a Dixon's<br />\nEldorado. Old Smity says it's the<br />\nbest drawing pencil made.\"<br />\n<br />\nDIXON's<br />\n<br />\nEthoRAD<br />\n\"the masterthawilrgpencil\"<br />\n17 leads—all dealers<br />\n<br />\n111111.111111.1111<br />\n.<br />\n1111111111111M1<br />\n.<br />\n.<br />\n111 1111=<br />\n.<br />\n1 10<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\nLimited<br />\n<br />\nBARN CAFETERIA<br />\nORDERS RECEIVED FOR<br />\n<br />\nCOGGINS'<br />\nTransfer & Baggage Express<br />\nAUTOMOBILE SERVICE<br />\nPHONE, HOMEWOOD 6886<br />\n<br />\nThe Flag, Banner & Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br />\n<br />\nSANFORD'S<br />\n<br />\nHOPKINS-PRINCETON<br />\n<br />\nContinued from page 1<br />\n<br />\nFOUNTAIN PEN INK<br />\n<br />\nWill Improve the Action<br />\nof Any<br />\nFountain<br />\nPen<br />\n•<br />\nALL<br />\niu1111<br />\n./(<br />\nCOLORS<br />\n<br />\nPRINCETON (16)<br />\nL E<br />\nEmery<br />\nL T<br />\n3uckner<br />\nL G<br />\nCaldwell<br />\nC<br />\nHoward<br />\nR G<br />\nHills<br />\nR T<br />\nGorman<br />\nQ E<br />\nStout<br />\nR B<br />\nBeatti e<br />\nL H<br />\nSnively (cap.) R H<br />\nVan Gerb'g<br />\nB<br />\n<br />\nGAME 3mith<br />\n<br />\npoint failed, leaving the score at<br />\nthe end of the half 9-0 favor of<br />\nPrinceton.<br />\nHopkins showed a complete<br />\nchange of form in the second half.<br />\nBattling always against fresh men<br />\n<br />\nHOPKINS (7)<br />\nBerndt<br />\nMagill<br />\nWolbert<br />\nDay<br />\nMilanusky<br />\nSlowik<br />\nSchact<br />\nBonner (cap.)<br />\nTurnbull<br />\nMaxwell<br />\nRich<br />\n<br />\nScore by periods:<br />\nPrinceton<br />\n3 6 7 0-16<br />\nHopkins<br />\n0 7 0 0— 7<br />\nTouchdowns — Princeton, Crum,<br />\nBeattie; Johns<br />\nHopkins, Wolbert.<br />\nPoints after touchdown—Princeton,<br />\nCaulkins; Johns Hopkins, Turnbull.<br />\nDropkick — Smith. Substitutions —<br />\nPrinceton, Dinsmore for Gorman, Newby for Snively, Crum for Beattie, Drews<br />\nfor Smith, M. Legendre for Van Gerbig. Tilson for Stout, Paschal for How-<br />\n<br />\nard, Ewing for Crum, Forrest for Caldwell, Booth for Hills, Heimrath for Paschal, Caldwell for Forrest, Caulkins for<br />\nDinsmore, Stout for Tillson, Van Gerbig<br />\nfor Legendre, Beattie for Ewing, Snyder for Emery, Gorman for Caulkins,<br />\nShackleford for Newby, Crum for Beattie, Smith for .Drews, P. Bergen for<br />\nBuckner, Gibson for Van Gerbig, Howard for Heimrath, Dinsmore for Gorman; Johns Hopkins, Carter for Slowik.<br />\nTime of periods-10 minutes.<br />\n<br />\nA. JACOBS & SONS<br />\n<br />\nine,<br />\nove<br />\nas<br />\npre<br />\nics<br />\nBoi<br />\nGei<br />\n<br />\nTailors<br />\nUniforms and Liveries<br />\n128 W. Fayette St., Near Liberty St.<br />\nBaltimore, Md.<br />\n<br />\nlila<br />\n<br />\npr(<br />\nart<br />\n<br />\nUse It<br />\nAnyzvhere!<br />\nHE Remington Portable Typewriter carTries<br />\nits table on its back. You can use<br />\nit<br />\n<br />\nanywhere—at any time.<br />\nIt is a complete typewriter with four-row<br />\nkeyboard—just like the big machines. Also<br />\nmany other useful features of the office typewriter. Yet it is small, compact, and fits in a<br />\ncase only four inches high.<br />\nPrice, complete with case,$60<br />\nEasy payment terms ifdesired<br />\n<br />\nRemington<br />\nPortable<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underauoted by any house at any time.<br />\ntL Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\n\"The Ink That Made<br />\nThe Fountain Pen Possible\"<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\nAt the<br />\n<br />\nWashington Monument<br />\n<br />\nDRAPERIES<br />\n<br />\nOscar Thomas Olson, D.D.<br />\nMinister<br />\n<br />\nURNER'S<br />\n<br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br />\n<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\n<br />\nThe purpose and program of this<br />\nChurch will appeal to you. Look in<br />\non the Sunday afternoon -At Home\"<br />\nfrom five to seven.<br />\n<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBaltimore<br />\n<br />\nSunday morning worship at 11 o'clock.<br />\n••••••111<br />\n,<br />\n<br />\nSunday evening service at 8 o'clock.<br />\nMusic by vested chorus—choir of soloists.<br />\n<br />\nEstablished 1873<br />\n<br />\nA. H. FETTING MAN'FG<br />\nJEWELRY CO.<br />\nManufacturers<br />\nGreek Letter Fraternity Jewelry<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\n<br />\n.`itif<br />\nIME]lregc<br />\n,<br />\n<br />\nMOE]<br />\nH01702 01111,5<br />\n\"The King of Lubricants\"<br />\nSHERWOOD BR .THERS, INC.<br />\n<br />\nHE constant'<br />\nsmoker finds<br />\nin Melachrino<br />\nCigarettes a delicacy of flavor of<br />\nwhich he never<br />\ntires.<br />\n<br />\nT<br />\n<br />\nIGINAL<br />\nMELktINO<br />\n\"The One Cigarette Sold the World Over\"<br />\n<br />\nCA'<br />\n<br />\n192<br />\n<br />\n27b<br />\n<br />\nALL<br />\nSIZES<br />\n•<br />\n<br />\nVO<br />\n<br />\n\"At the heart of the City\"<br />\n<br />\nALL SEATS FREE<br />\n<br />\nRE T A CAR<br />\nDrive It Yourself!<br />\nALL NEW, CLEAN CARS<br />\nFORDS, 12c PER MILE—DODGES OR HUPS, 18c PER MILE<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br />\n<br />\nDRIVE IT YOURSELF CO.<br />\n1725 N. CHARLES ST.<br />\n<br />\nVERNON 4049<br />\n<br />\nONE BLOCK SOUTH OF NORTH AVE.<br />\n<br />\ntut<br />\nan<br />\nsec<br />\nlea<br />\nCu<br />\nso:<br />\n<br />\nCz<br />\nwl<br />\nrn;<br />\n<br />\nsli<br />\nSt<br />\n<br />\nin<br />\n<br />\nhi<br />\nrn<br />\ntr<br />\ntr<br />\n<br />\nsi<br />\n<br />\n\f", "format": "basic_html", "processed": "47-<br /><br />\nVOL. XXVIII, No.2<br /><br />\nBALTIMORE, MD., OCTOBER 9, 1923<br /><br />\nPRICE 5 CENTS<br /><br />\nR. O. T. C. HOLDS ORGANI- \"DON\" VANNEMAN LEADS ATHLETIC BOARD HOLDS<br />\nMEETING TO DISCUSS<br />\nYELL PRACTICE AT THE<br />\nZATION MEETING FOR<br />\nCONFERENCE<br />\nTHURSDAY ASSEMBLY<br />\nAPPOINTMENTS<br /><br />\nBLACK AND BLUE GRIDDERS HOLD HEAVY PRINCETON TEAM<br />\nTO 16-7 SCORE<br /><br />\nMajor Hoisington Not to Arrive Until Short Meeting Devoted to Student Af- Bonner Presides at First Meeting of<br />\nAthletic Body<br />\nfairs. Pep Aroused for PrinceFirst of November<br />\nton Game<br />\nThe advisability of Hopkins<br /><br />\nWolbert Makes Touchdown Which Saves Hopkins from Being<br />\nBlanked by Tigers<br /><br />\nThe Reserve Officers Training<br />\nCorps held its organization meeting on Wednesday, October 3, at<br />\n4:15 P. M., in the C. E. Hall. The<br />\nentire unit appeared in uniform.<br />\nCaptain Paul took charge of the<br />\nCorps in the absence of Major<br />\nHoisington. The new commander<br />\nwill take charge November 1; until<br />\nthat time Captain Paul will be in<br /><br />\nCharlie Wolbert saved the day<br />\nAffairs at Johns Hopkins re- entering the Maryland ConTRACK TEAM TO HOLD OR- for Hopkins last Saturday when<br />\nturned to \"status quo\" when \"Don\" ference on Athletics formed the<br />\nGANIZATION MEETING<br />\nhe scored the Black and Blue's<br />\nVanneman, last year's popular cheer principle topic for discussion at<br />\nTHIS AFTERNOON<br />\nleader, returned to lead yell prac- the first meeting of the Athletic Return of Stars Gives Team Bright only touchdown. in a hardfought game against the PrinceOutlook.<br />\ntice at the Thursday assembly. The Board, which was held in the<br />\ncantrack<br />\nof<br />\nmeeting<br />\nthe<br />\nton eleven. The contest was full<br />\nWith<br />\ngreater part of the meeting was de- Barn. Many other matters were<br />\nvoted to going over the yells and considered including the award- didates today the fall track season, of interest throughout, but weak<br />\nit<br />\nsongs for the benefit of the Fresh- ing of letters to the members of will be in full swing, as the cross spots on both teams prevented<br />\nmen in preparation for the Prince- the swimming team of last year; country squad had its first prac- from being an exhibition of extra<br />\ngood football. Neither team<br />\nton game. Vanneman spoke for a the football season; and a num- tice yesterday.<br />\ncharge.<br />\nplayed a steady game, both sides<br />\n12.20<br />\nat<br />\nis•<br />\ntodays<br />\nmeeting<br />\nThe<br />\nfew minutes on the value of cheer- ber of topics which were left inAn appeal was made for candiing the team, and urged that the complete by last years Board. at 110 M. E. Drs. Abercrombie waiting for the breaks which<br />\ndates for the Band. All men who<br />\nUnfortunately, this edition of the and Van Orman, Captain Booth eventually came their way. The<br />\nlarge Hopkins attendance at the<br />\nNews-Letter had to go to press<br />\nwish to join and former Band memgreat number of substitutes used<br />\nPrinceton game of last year be before the results of the meeting and Coach Le Cato will give short<br />\nbers desiring instruments are asked<br />\nby the Tigers was probably the<br />\nseathe<br />\naddresses, and plan's for<br />\nduplicated. Jenifer and Townsend could be determined.<br />\nbox<br />\noffice<br />\npost<br />\nnames,<br />\ntheir<br />\nto leave<br />\nThose seek- cause of their uneven brand of<br />\nalso led the cheering.<br />\nThe newly formed Maryland son will be discussed.<br />\nnumbers and type of -instrument<br />\nplaying.<br />\nRandolph Norwood, president of Conference on Athletics held a ing positions as assistant managers<br />\nOffice.<br />\nMilitary<br />\nthe<br />\nin<br />\nthey play<br />\nIt was the powerful onslaught<br />\nthe Student Council, told the Fresh- meeting last Thursday at which are especially urged to attend.<br />\n,The Band will play at all games,<br />\nof<br />\nPrinceton's huge backfield<br />\nthe rules on eligibility and mem- Freshmen will find one of the best<br />\nboth at Homewood and on foreign men that the burden of selling sea- bership were adopted. These<br />\nof recent years to men which caused the downfall of<br />\nfields. The first rehearsal will be son tickets for the Hopkins foot- rules are detrimental to Hopkins, opportunities<br />\nthe J. H. U. gridders. Supported<br />\nheld immediately after the organi- ball games would fall on them. The so it is believed that this Univer- race under varsity colors as there<br />\nby a line that can not be rated<br />\nzation of the R. 0. T. C. on Mon- upperclassmen are busy at this time sity will not join the Conference. are many vacancies to be filled.<br />\nday, October 8. Fr the present starting the ball rolling in the many The faculty rules at Hopkins deOf last year's stars, Captain high arriong the greater college<br />\nteams, Beattie and Snively forced<br />\nscholastic year Junior and Senior<br />\nstudent activities, so the Frosh is mand a more stringent rule for Booth, Clarke, Maxwell, Dorcus,<br />\nengineering students are required<br />\neligibility of players than is called Norwood and Proctor are the nu- their way past their opponents<br />\nto attend only one recitation and called upon to 'assume the roll of for by the<br />\nConference rule, which cleus for a fine team. New hur- for gains which seemed to carry<br />\none drill during the week. This Salesman Sam. The price for a redoes not specify that players be dlers especially are needed to fill them dangerously'near the goal.<br />\nplan was adopted in order that served seat for the six games played<br />\nbona fide members of the collegiThe Tiger backs failed to make<br />\nthe places left vacant by Aaronthese men might have the advan- at home, not including the Maryate or graduate schools. This<br />\ngains through the line,<br />\nconsistent<br />\ntage of this training yet not be hard land game, is five dollars.<br />\nAaronson was last<br />\nwould allow the smaller colleges son and Hearn.<br />\npushed for time.<br />\nThe Freshmen will have a chance to play men who are members of because of the four-year competi- the Hopkins players stopping<br />\nnumber<br />\nAt this writing the total<br />\nto prove their mettle in the ticket- the high schools which are con- tion rule and Hearn through grad- nearly every attempt to gain by<br />\nof men in the R. 0. T. C. is 299. selling campaign for the stadium<br />\nnected with those institutions. uation. In the weights, broad that route and on several occaOf this number 142 are freshmen. attractions will furnish stiff compeHopkins teams are forbidden to jump and pole vault new faces will sions throwing them for a loss.<br />\nIt is hoped by the Military Depart- tition this year.<br />\nstage contests with such organi- appear. Fred Rich, ineligible this Princeton baffled the Blue Jays<br />\nment that before the middle of the \"Buck\" Bonner, captain of the<br />\nby one line play, however, using a<br />\nzations. It is doubtful that Hopmonth our quota of 300 students Varsity football team, has succeedspring for baseball, may be a find tactic which hefted them very<br />\nkins will enter the State Conferwill be oversubscribed. This is a ed Tom Landy, captain of last<br />\nworthwhile gains at the most opence when the entries close on in the shot and discus.<br />\ndistinction which few of the units year's Varsity, as proprietor of the<br />\nwill<br />\nteam<br />\ntimes. The forward passcountry<br />\nportune<br />\ncross<br />\nThe<br />\nOctober 14.<br />\nabout the country will be able to store at the Barn. He is an agent<br />\nwhich<br />\nfeatured in Princeton's<br />\ning<br />\nThe Board was also 'concerned have most of its veterans back,<br />\n•attain. All members of the Hop- for Katz &amp; Sons (clothing); Hess<br />\nlast<br />\nplaying<br />\nfall was not as helpwith the voting of letters to the and Captain Booth is encouraged<br />\nkins Unit are wearing the gold star &amp; Sons (shoes); the Hatterie<br />\nthis year, although<br />\nto<br />\nful<br />\nthem<br />\nmembers of last year's swimming by the size of the squad.<br />\non their sleeves to signify that this (hats); Spalding &amp; Bachrach (aththeir<br />\ntouchdowns was<br />\none<br />\nof<br />\nteam. The natators were awardgroup is on the distinguished list. letic goods and Ford supplies) ; and<br />\n\"The freshmen look promising, made by a pass from Gorman to<br />\ned their letters but due to some<br />\nThe following are the officers the Van Company (men's furnishthe best pros- Beattie.<br />\nin the A. A. Board and the team has<br />\ncomplication<br />\n,<br />\nfor 1923-24:<br />\nings). \"Buck\" will appreciate the<br />\nmeeting, there was no vote of pects it has had for some time,\" Princeton scored the first<br />\nmen.<br />\ntrade<br />\nof<br />\nHopkins<br />\npoints in the game about five minASSISTANT INSTRUCTORS<br />\naward made. This is only a for- said Booth.<br />\nDean Latane announced that all<br />\nutes after the opening whistle by<br />\nCadet Majors<br />\nmality in the management of the<br />\nfirst and second year students must<br />\nwell placed dropkick from the<br />\na<br />\nClinton Rector<br />\nAssociation, but it is necessary CHRISTIAN SERVICE CLUB HOLDS<br />\nline. The ball had pre30-yard<br />\ntake a physical examination as soon<br />\nFIRST MEETING<br />\nthat all such forms be followed to<br />\nWilliam H. B. Howard<br />\nwill<br />\nbeen<br />\nplaced in Hopkins'<br />\nviously<br />\nas possible. Dr. Abercrombie<br />\nThe Chri-stian.Service Club held<br />\nRussel R. E. Passano<br />\npreserve the equilibrium of the<br />\nlong punt from the<br />\na<br />\nby<br />\nbe prepared to make examinations<br />\nan organization meeting on Mon- territory<br />\nJohn V. B. Shriver<br />\nAthletic body.<br />\nof<br />\nthe field which passed<br />\nmiddle<br />\nevery day except Saturday and SunThe question as to whether day, October 8, in Room 103, GilJames L. Wasson<br />\nwell over Bonner's head. Turnday from three to six o'clock in the<br />\nCharles E. Sener<br />\nHopkins should have a basketball man Hall, at which plans for the<br />\nbull made a poor kick on the next<br />\nafternoon. The Dean also called<br />\nConrad R. Kennedy.<br />\nteam this year was another sub- coming year were discussed, the play giving<br />\nPrinceton the ball on<br />\nattention to the ruling thai all first<br />\nject for debate at the session. The<br />\nField and Staff<br />\nprogram includes a good number the 20-yard line. Smith easily<br />\nand second year men must take<br />\nlapse of two years since J. H. U.<br />\nMajor James E. Mount, Comeither R. 0. T. C. or Physical<br />\nwhich will be ad- made the field goal. The 'remainwas represented on the court has of meetings<br />\nmanding Unit (Section I).<br />\nTraining, unless excused by Dr.<br />\nwide der of the first quarter looked sad<br />\nMajor Robert E. Peyton, Com- Abercrombie on account of physical caused interest in the game to lag dressed by speakers having<br />\nfor the j. H. U. as the Tiger backbut those who are familiar with reputation in the religious field.<br />\nmanding . Infantry Batt. (Section<br />\nfield ran ragged over the field,<br />\ndisability.<br />\nHopkins activities realize that<br />\nII).<br />\nThis club was originally the skirting the ends for large gains.<br />\nCaptain Randolph Norwood, 0.D. K. APPOINTS COMMITTEES ON there is much promising material Preachers' Club, formed in 1920, They failed to score any more beat Homewood with which to build<br />\nPlans and Training (Section I).<br />\nCAMPUS AFFAIRS<br />\nbut the membership qualification fore the end of the period.<br />\nCaptain .Alan N. Gump, Unit Omicron Delta Kappa Honorary up a team. The principle drawvery<br />\nwas changed from \"those who are The second quarter was<br />\nAdjutant (Section I).<br />\nmuch like the first although the<br />\nFraternity held its first meeting back at present is the lack of a<br />\ntheir life to religious<br />\nFirst Lieutenant Thomas W. of the year on Wednesday, Octo- place in which to play and an ef- to devote<br />\nHopkins team showed signs of<br />\nJenifer, Battalion Adjutant (Sec- ber 3, in Room 206, M. E. Build- fort is. being made to obtain a work\" to \"all those interested in tightening. The J. H. U. rooters<br />\ntion II).<br />\ning, at 1.30 P. M. Joseph Leopold hall in which games and practice Christian work\" and the object of were thrilled and then disappointManaMaster Sergeant W. T.<br />\nwas elected secretary to fill the va- can be held. The Board also dis- the club is to promote religious ed when Turnbull missed a placement kick by a margin which was<br />\nhan (Section II).<br />\ncancy caused by the withdrawal of cussed the appointment of a bas- fellowship.<br />\nThe officers are E. Paul Sylves- measured in inches.<br />\nStaff Sergeants R. H. Clark C. P. Coady from the university. ket-ball manager at last *night's<br />\nter, president; William N. Mc- Toward the close of the half a<br />\n(color,sergeant), Section I; T. B. Dormitory, Membership, Publici- meeting.<br />\nFaul, Jr., vice-president; Reno spectacular 60-yard run through a<br />\nMagill (color sergeant), Section I. ty, Extension and Improvements<br />\nHarp, Jr., secretary, and Allison broken field placed the ball withCommittees were named. In addiCOMPANY \"A\"<br />\nNOTICE!<br />\nin 15 yards of Princeton's goal.<br />\nLong, Jr., treasurer.<br />\ntion two men have been appointed<br />\nCaptains<br />\nThere will be a meeting of<br />\nbecome<br />\nto<br />\ninvitation<br />\nAfter two unsuccessful attempts<br />\ncordial<br />\nA<br />\nto investigate the subject of tutors<br />\nthe Student Activities CounGeorge M. Shriver, I.<br />\nService<br />\ngain through the line the Tigers<br />\nto<br />\nChristian<br />\nthe<br />\nof<br />\nmembers<br />\nfor backward athletes. The meetcil today at 12.30 in Room<br />\nArthur C. Milchael, II.<br />\nand completed a forward<br />\nuniversity<br />\ntried<br />\nall<br />\nto<br />\nClub is extended<br />\nAll Business<br />\n109, M. E.<br />\ning also passed a resolution that<br />\nFirst Lieutenants<br />\nput them on the 2-yard<br />\nwhich<br />\npass<br />\nexinare<br />\nthe<br />\nto<br />\nactivities<br />\nof<br />\nespecially<br />\nManatzers<br />\nstudents, and<br />\neach day, before the evening meal,<br />\nJohn T. Martin, I.<br />\npected to attend, as an atplunge gave<br />\noff-tackle<br />\nline<br />\n.An<br />\ncoming class, Who are interested<br />\nat the dormitory, the University<br />\nOliver M. Shipley, II.<br />\ntempt will be made to sysThe try for<br />\ntouchdown.<br />\na<br />\nthem<br />\nin the work of the club or in<br />\nOde or some other suitable song<br />\ntematize the bookkeeping.<br />\nHerman Chor, II.<br />\nContinued on page 4, col. 2<br />\nChristian work of any kind.<br />\nbe sung.<br />\nContinued on page 2, col. 5<br /><br />\n•<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 9, 1923<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\nTRYOUTS FOR BARNSTORMERS<br />\nCLUB TO BE HELD SOON<br /><br />\nY. M. C. A. RECEPTION TAKES<br />\nPLACE IN C. E. BUILDING<br /><br />\nETY MAKCIVIL ENGINEERING SOCI.<br />\nING PLANS FOR THIS YEAR<br /><br />\nPlans are now being formulated<br />\nAbout three hundred undergradFreshman \"tryouts\" for the<br />\nthe executive committee of the<br />\nby<br />\nBarnstormers' Musical Comedy uates attended the annual Y. M. C.<br />\nFOUNDED 1897.<br />\nstudent. chapter of the<br />\nHopkins<br />\nwill be in the form of vaudeville A. freshman reception which was American Society of Civil Engiheld in the C. E. Hall last Thurs- neers that are expected to assure<br />\n$2.00 acts. At a meeting of the BarnSubscription<br />\nstormers' Club last Thursday day evening. T. R. Marsh, the one the most successful seasons in<br />\nat<br />\nnight it was announced that this president of the, Hopkins Y. M .C. the history of the local branch.<br />\nEntered as second-class matter December 3, 1909, at the Postoffice<br />\n1879.<br />\n3,<br />\nNovember<br />\nCongress,<br />\nof<br />\nAct<br />\nunder<br />\nSome of the best known civil enBaltimore, Md.,<br />\nyear the' usual one-act plays held A., was the presiding officer.<br />\nA change in the progiam was gineers in this section of the coununcover talent for<br />\nPublished semi-weekly from October to June by the students of Johns in the fall to<br />\ntry will be brought to Homewood Hopkins University.<br />\nthe spring production would be necessitated at the last minute, due to address the members at the regto President Goodnow's inability to<br />\nMAN- abandoned. As dancers, singers,<br />\nular monthly meetings. Interest in<br />\nBusiness communications should be addressed to the BUSINESS<br />\nattend. The faculty was representcommunications<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other<br />\nthese talks will be greatly encomedians (and comediennes)<br />\ned by Dr. Latane, dean of the colMould be sent to the MANAGING EDITOR.<br />\nand other musical comedy enter- lege faculty, who made the welcom- hanced by the improved motionpicture projecting machine purHomewood 100 tainers are needed it was decided<br />\ning address, and by Dr. John C.<br />\nTelephone<br />\nchased during the latter part of<br />\nto have Freshmen show their French, chairman of the student afpast scholastic year by the exthe<br />\nManager<br />\nBusiness<br />\nEditor-in-Chief<br />\na \"vaudeville night\" fairs committee of the Board of ecutive committee.<br />\nin<br />\nabilities<br />\n'25.<br />\nPHILIP W. HOWARD,<br />\nJOSEPH LEOPOLD, '24.<br />\nStudies.<br />\nat which members of the club and Collegiate<br />\nOpportunity will also be providalso included short<br />\nThe<br />\nprogram<br />\nManaging Edttor<br />\nAdvcrasing Manager<br />\nthis year for the members of the<br />\nwill<br />\nbe<br />\ned<br />\npresent.<br />\nmembers<br />\nalumni<br />\nWILLIAM G. DEAN, JR., '24.<br />\ntalks by J. I. Bonner, president of<br />\n'24.<br />\nto meet and talk over some<br />\nchapter<br />\nFITZGERALD DUNNING,<br />\nThe new men are to arrange their the Athletic Association; D. C.<br />\nAssistant Managing Editor<br />\nstunts and work them up. Clar- Turnbull, president of 0. D. K.; of the interesting current engineerT. REESE MARSH, '24.<br />\nCirculation Manager<br />\ning problems. Regarding this, Proence Adams,'24, will coach those Randolph Norwood, president of<br />\nAssociate Editors<br />\nfessor John H. Gregory, head of<br />\nJOHN C. LEWIS, JR., '24.<br />\nwho wish to learn dancing. The the Student Council, and G. M. the department of civil engineering,<br />\nRICHARD C. TILGHMAN, '25.<br />\nShriver, Jr., president of the StuJOHN W. PARSONS, '25.<br />\ndate of these \"tryouts\" will be anAssistant Business Managers<br />\nhas expressed the opinion that the.<br />\nBENJAMIN T. ROME, '25.<br />\ndent Activities Council. The final<br />\nSmallwood,<br />\nmonthly meetings should provide<br />\nHugh<br />\nby<br />\nnounced<br />\n'25.<br />\nMA.RRIAN,<br />\nD. MILES<br />\nJunior Editors<br />\ntalk of the evening was made by<br />\nan<br />\nexcellent oportunity for the<br />\nG. DONALD GIESKE, '25.<br />\nV. EDWARD THOMSEN, JR., '26.<br />\nnext<br />\nat<br />\nthe<br />\nclub,<br />\nthe<br />\npresident of<br />\nE. A. Schaal, from the NorthwestARTHUR L. NELSON, '26.<br />\nJOHN T. DIXON,'24.<br />\nof the noted inability<br />\novercoming<br />\nAssembly.<br />\nERNEST A. STRATHMAN, '26.<br />\nern University, who was recently<br />\nA. J. McKAY, '26.<br />\nof engineers as a whole to get upon<br />\nLEO C. MUTH, '24.<br />\nThe week of Monday, March made general secretary of the HopC. EUGENE TOVELL, '24.<br />\nALGER G. Hiss, '26<br />\ntheir feet, express their opinion,'<br />\nOTHO J. KELLER, III, '25<br />\nEDWARD 0. MICHEL, '26.<br />\nas kins Y. M. C. A.<br />\ndefinitely<br />\nchosen<br />\n17,<br />\nbeen<br />\nhas<br />\n'26<br />\nKIDD,<br />\nJACKSON<br />\nJ.<br />\n'24.<br />\nHUTZLER,<br />\nand impart to others their knowlG.<br />\nCHARLES<br />\nthe date of the show. The theaedge.<br />\ntre will be either the Lyceum or SOPHOMORES NOMINATE CLASS<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nAn organization meeting of the<br />\nOFFICERS AT CLASS MEETING<br />\nthe Academy—either of which<br />\nAt the first meeting of the Soph- chapter will be held within the next<br />\nthis<br />\ndate.<br />\nfor<br />\nsecured<br />\nbe<br />\ncan<br />\nMd.<br />\nBaltimore,<br />\nSts.,<br />\nSouth<br />\nand<br />\nLombard<br />\nCo.,<br />\nr<br />\nPrinted by The Read-Taylo<br />\nomore class held Wednesday, Oc- few days in the C. E. Building. The 1<br />\nProminent local charities will<br />\ntober 3, Randy Norwood, president regular combined monthly meeting<br />\nback the show, each night of the<br />\nof the Student Council, asked that and smoker will be held as forweek's run being for the benefit<br />\nBALTIMORE, MD., OCTOBER 9, 1923<br />\nthe Sophomores, at the request of merly.<br />\nof a different charity.<br />\nAll civil engineering students<br />\nthe Dean, should not appear on the<br />\nThe plot, location, and music<br />\nthe status of freshmen are<br />\nabove<br />\nthe night of the Y. M. C.<br />\nof the new production are guard- campus<br />\nfor membership in the soeligible<br />\nA. reception.<br />\nThis step was<br />\nAN ALMA MATER<br />\ned with utmost secrecy. The<br />\nyear forty undergradciety.<br />\nLast<br />\nthought advisable to prevent hosOmicron Delta Kappa's recent recommendation that \"the Uni- plot is said to be far above the<br />\nthe roster, the highwere<br />\non<br />\nuates<br />\ntilities which might arise between<br />\nin<br />\ninteraverage<br />\ncomedy<br />\nmusical<br />\nevening<br />\neach<br />\nbefore<br />\nin<br />\nsung<br />\nthe<br />\nest<br />\nhistory of the club<br />\nmark<br />\nbe<br />\nsong)<br />\nversity Ode (or some suitable<br />\nthe two lower classes on that night.<br />\nand continuity. The lyrics,<br />\nest<br />\nwho<br />\nwere elected last<br />\nofficers<br />\nThe<br />\nmeal at the Memorial Dormitory\" brings to mind the fact that Johns written by a Hopkins man, fill The Sophomores pledged to the<br />\nWilliam N.<br />\nPresident,<br />\nare:<br />\nspring<br />\nPresident of the LALident Council<br />\nHopkins has no suitable Alma Mater. \"Veritas Vos Liberabit\", al- out a well rounded show.<br />\nVice-President,<br />\nClayton C.<br />\nthat they would make no disturb- Crout;<br />\nare<br />\nrequested<br />\nin<br />\nUndergraduates<br />\nconsidered<br />\nbe<br />\nnot<br />\nmay<br />\ntradition,<br />\nthough it is valuable because of<br />\nance on that evening but saw no Singleton; Secretary, John Wythey<br />\nany<br />\nsuggestions<br />\nover<br />\nturn<br />\nto<br />\nsong, and Treasurer, Robert B.<br />\nthis category; firstly, because the score is extremely difficult to render may have, in the way of jokes, reason why they should not attend<br />\nBurgess.<br />\nthe reception.<br />\nharmonoiusly and, secondly, because the words are more or less songs, dialogues, and such, to<br />\nBuck Bonner announced that he<br />\nHugh Smallwood, Tom Jenifer,<br />\nR. 0. T. C. HOLDS ORGANIZATION<br />\nuninspiring to a group of college undergraduates.<br />\nwould .have charge of the store at<br />\nMEETING FOR APPOINTMENT<br />\nHamburger.<br />\nIsaac<br />\nor<br />\nthe Barn this year and solicited<br />\nAn Alma Mater should include sentiment similar to that conContinued from page 1<br />\nSophomore trade. Kelso Morrill<br />\nCayuSecond<br />\nAbove<br />\n\"Far<br />\nLieutenants<br />\nCornell<br />\nin<br />\nHarvard,\"<br />\n\"Fair<br />\ntained in Harvard's<br />\nMUSICAL CLUB TO BE ORGANIZED<br />\ntold of the University ring, which<br />\nI.<br />\nC.<br />\nRoberts,<br />\nWilliam<br />\nBARN<br />\nAT<br />\nNIGHT<br />\nTHURSDAY<br />\nga's Waters\" and in innumerable others. The Ode is only approit is hoped will eventually be worn<br />\nII.<br />\nN.<br />\nHooper,<br />\nJoseph<br />\nthe<br />\nof<br />\nmeeting<br />\nThe organization<br />\nHe, as<br />\npriate for a formal occasion such as Commencement. For a song Musical Club, composed of the by most Hopkins men.<br />\nJames V. Alfriend, II.<br />\nof<br />\nthe<br />\nchairman<br />\nRing<br />\nCommittee,<br />\ncomes<br />\nteam<br />\nfootball<br />\nJoseph Kaplan, II.<br />\nthe<br />\nas<br />\nor<br />\nmeal<br />\nevening<br />\nMusical and Glee Clubs, will take<br />\nto be rendered before the<br />\nhas<br />\na<br />\nfor<br />\nring.<br />\nreceived<br />\nplans<br />\nThis<br />\nCOMPANY \"B\"<br />\nthe Trophy<br />\non the field, however, it is a bit too heavy. And as the Ode is too place Thursday night in<br />\nring<br />\nan<br />\nis<br />\nin<br />\nstone<br />\nonyx<br />\nto<br />\nhave<br />\nCaptains<br />\nRoom of the Barn. The purposes<br />\nheavy so are \"On the Line\", \"Come Stand Together\" and others, of the meeting are to elect a bus- the center; on side of the ring<br />\nRobert D. Ohrenschal, II.<br />\nthere will be the year of your class<br />\nWilliam N. Young, I.<br />\ntoo light.<br />\niness manager to succeed \"Jimmy\"<br />\nand<br />\non<br />\nthe<br />\nother<br />\nside<br />\nthe<br />\nHopkins<br />\nFirst Lieutenants<br />\nwho will not return to the<br />\nThe News-Letter is open to suggestions for old Hopkins songs Thomas,<br />\nseal. The ring will be offered for<br />\nFred W. Geib, I.<br />\nuniversity, and to start work in<br />\nwhich may be used as an Alma Mater. And if suggestions are lack- earnest for the year's musical pro- fifteen ($15) dollars a piece. HowAustin A. Lamar, I.<br />\never, it will be necessary for fifty<br />\nA. Tongue, II.<br />\nan<br />\nThomas<br />\nundergraduate<br />\ninclined,<br />\neither<br />\nmusically<br />\nfor<br />\ncandidates<br />\nthat<br />\nanyone<br />\nask<br />\nAll<br />\nwe<br />\ngram.<br />\ning may<br />\nsales before this price may be obSecond<br />\nLieutenants<br />\nthis<br />\nat<br />\nPresent<br />\nbe<br />\nto<br />\nurged<br />\nalumnus, try a hand at writing Johns Hopkins University an Alma club are<br />\ntained.<br />\nWilliam<br />\nC.<br />\nI.<br />\nGardner,<br />\nbe<br />\nwill<br />\ntime<br />\nno<br />\nthat<br />\ntime in order<br />\nPresident Middleton called for<br />\nMater.<br />\nLawrason<br />\nII.<br />\nR.<br />\nKent,<br />\nlost.<br />\nnominations for the class officers<br />\nFrederic L. Mohle, II.<br />\nPresident Jack Croker is very<br />\nfor the year 1923-24. The followEdgar<br />\nT. Moseley. I.<br />\nmuch impressed with the prospects<br />\nFor<br />\ning<br />\nthe<br />\nnominations.<br />\nwere<br />\nA BANNER SEASON<br />\n\"C\"<br />\nCOMPANY<br />\nof the Musical Club this season.<br />\nBrown,<br />\nFonda,<br />\nE.<br />\nPresident,<br />\nwere<br />\nSaturday<br />\nlast<br />\nPrinceton<br />\nto<br />\njourneyed<br />\nCaptains<br />\nwho<br />\nHopkins men<br />\nThe absence of Johii Sherwood,<br />\nTownsend, Howard, Hiss and<br />\nHerbert E. Wilgis, I.<br />\nwell rewarded by the splendid exhibition which the Black and Blue. second bass, and Tom Macubbin,<br />\ndent,<br />\nAlmy,<br />\nFor<br />\nVice-Presi<br />\nLove.<br />\nWilliam M. Rowland, II.<br />\neleven put'forth. Recovering quickly from an inauspicious begin- tenor, and the late Harry Mercer, Welsh, Stock, W. Taylor, Nelson,<br />\nFirst Lieutenants<br />\nfirst bass, will leave Croker as a<br />\nning, the Hopkins men fought the Tiger every inch until, towards<br />\nKidd and Kaufholz. For SecreP. Barton, I.<br />\nHubert<br />\nThere<br />\nquartette.<br />\nanother<br />\nfor<br />\nnucleus<br />\ntary, Stevens, Burgess, Ningard, Lloyd W. Hyatt, II.<br />\nthe end of the third quarter, Coach Roper sent in a steady stream of<br />\nis plenty of available material from<br />\nNelson, T. Taylor, Love and Jacksubstitutes in an effort to check the Hopkins onslaught.<br />\nSecond Lieutenants<br />\nthe members of last year's Glee<br />\nFor Treasurer, Crook, Thomas, Kenneth L. Gilbert, I.<br />\nson.<br />\nand<br />\nkicks<br />\nfive<br />\nblocked<br />\nBlue<br />\ncombination.<br />\ngood<br />\nand<br />\na<br />\nBlack<br />\nmake<br />\nClub to<br />\nThe mere fact that the<br />\nBaldwin and Bold. For §erWilliam N. McFaul, I.<br />\nMandolin Club has lost only Love,<br />\nin<br />\nthree<br />\nbeen<br />\nbeaten<br />\nThe<br />\nnot<br />\nhas<br />\nwhich<br />\neleven<br />\nan<br />\non<br />\ntouchdown<br />\nscored a<br />\nSlowik, Howard, William E. Hopkins, II.<br />\ngeant-at-arms,<br />\nthrough<br />\none man, Foster Morrell,<br />\nyears and whose goal line has been crossed only once since the fall<br />\nLevy, Strobel, Berndt and Jewett. Julian D. Tebo,<br />\ngraduation. Its prospects are therea<br />\nhas<br />\ndeveloped<br />\nOrman<br />\nVan<br />\nCoach<br />\nthat<br />\nevidence<br />\nsufficient<br />\nThe following were appointed as<br />\nof '21, is<br />\nCOMPANY \"D\"<br />\nfore even brighter than those of<br />\nalbe<br />\nnot<br />\nshould<br />\nhowever,<br />\nPep Committee:<br />\nthe<br />\nSophomore<br />\ngood football team. Excess optimism,<br />\nCaptains<br />\nthe Glee Club.<br />\nthat<br />\nPrinceton<br />\nStephens,<br />\nLove,<br />\nHoward,<br />\nCrook,<br />\nmind<br />\nin<br />\nborne<br />\nbe<br />\nmust<br />\nfact<br />\nMarsh, I.<br />\nThe<br />\nR.<br />\nThomas<br />\nlowed to prevail.<br />\nThe Glee Club will probably meet<br />\nand<br />\nBaldwin,<br />\nMartin,<br />\nNelson,<br />\nMills<br />\nfrom<br />\nopposition<br />\nno<br />\nor<br />\nLeo J. Gould, II.<br />\nfor rehearsal every Thursday evenhad an inexperienced team and expected little<br />\n.<br />\nFonda.<br />\nFirst Lieutenants<br />\nthe invaders. And then, too, it must be remembered that all state ing and the Mandolin Club on MonWysong, II.<br />\nB.<br />\nJohn<br />\nopgood<br />\na<br />\nis<br />\nThere<br />\nevening.<br />\nday<br />\nteams are one hundred per cent, stronger than ever before.<br />\nJoseph G. Leopold, I.<br />\nportunity for many candidates to<br />\nNOTICE!<br />\nCoach Van Orman and his team are to be congratulated for the make the clubs. If the Dramatic<br />\nSecond Lieutenants<br />\nwill<br />\nbe a meeting of<br />\nThere<br />\nLewis P..Gundry, I.<br />\nshowing made Saturday. The News-Letter predicts a banner foot- Club presents a musical comedy<br />\nthe. entire News-Letter Staff<br />\nCharles G. Post, I.<br />\nball season and victory over Maryland and St. John's. It warns, the support of the Musical Club<br />\nin the office today at 12.20.<br />\nThomas Summers, II.<br />\nhowever, that only hard work and co-operation between student body will be necessary to put their show<br />\nGeary A. Long, II.<br />\nacross.<br />\nand team can bring this to pass.<br /><br />\nMA<br /><br />\nsiv<br />\nCo<br />\nem<br />\nins<br />\ngt;<br />\ngz<br />\nEr<br />\nde<br /><br />\nit<br />\nCa<br />\nalt<br />\net;<br />\nan<br />\nco<br />\nan<br />\nac<br /><br />\nth<br />\net<br />\nco<br />\nki<br /><br />\nAK-<br /><br />\nited<br />\nthe<br />\nthe<br /><br />\nigi-<br /><br />\nure<br />\n; in<br /><br />\nenunDo(I<br />\n.eg: in<br />\nenonurof<br />\nex-<br /><br />\nridthe<br />\n,me<br />\n!eriroof<br />\nng,<br />\nthe.;<br />\nide<br />\nthe<br />\nlity<br />\n)on<br />\non;<br />\nwl-<br /><br />\nthe<br />\next<br />\n:he<br />\ning<br />\nor-<br /><br />\nnts<br />\nare<br /><br />\nSO-<br /><br />\nad-<br /><br />\n;hub<br />\nast<br />\nN.<br />\nC.<br />\nTyB.<br /><br />\nON<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 9, 1923<br />\ntreasurer, Messrs. Geib,<br />\nMAJOR CAREY, PRESIDENT OF ST. TENNIS TEAM TO INAUGUURATE B. Garey, who resigned from the for<br />\nJOHN'S,PLANS FOR GREATER<br />\nFALL PRACTICE<br />\npresident of Thomas, Howard, Smallwood and<br />\nbecome<br />\nto<br />\nuniversity<br />\nCOLLEGE<br /><br />\nTHE READ-TAYLOR Co.<br /><br />\nWith, the influx of expert ten- St. John's College. Elections will Turnbull; for -3ergeant-at-arms,<br />\nBaltimore, Oct. 5.-ComprehenPrinters or<br />\nBarton, Wilgis, Tovell, J.<br />\nsive plans to provide St. John's nis players in the freshman class be held on Friday. The following Messrs.<br />\nand<br />\nPackard;<br />\nand<br />\nRector<br />\nHonorary<br />\nShriver,<br />\nFor<br />\nCollege at Annapolis a minimum and the return of nearly all of last were nominated:<br />\nThe Johns Hopkins<br />\nCouncil, G. Shriver,<br />\nendowment of $300,000 in order to year's squad the prospects for President, Doctors Thack, Chris- for Student<br />\nKennedy, Perkins, SmallNEWS-LETTER<br />\ninsure the retention of the high- the 1924 tennis team are very tie, Schwartz, Hulburt and W. B. Barton,<br />\nO'Connor.<br />\nand<br />\nwood<br />\npresident,<br />\nclass<br />\nfor<br />\n;<br />\nen<br />\n.<br />\nKouwenhov<br />\nwhen<br />\nlast<br />\nbright.<br />\nyear,<br />\nUnlike<br />\ngrade faculty that has been engaged by the new president, Dr. experienced match players were Messrs. Bonner, Dean, Smallwood,<br />\nEnoch B. Garey, are now well un- according to Jean Hofmeister, Croker and Thomas;for vice-presder way and progressing rapidly, tennis materials at Hopkins now, ident, Messrs. Perkins, Kennedy<br />\nit was announced at the Geenral few, there isa vast wealth of and Marsh; for secretary, Messrs.<br />\ncaptain of the team. In view of jenifer, Marrian, Chor and Gelb<br />\nCampaign Headquarters.<br />\nthe<br />\nfine squad which Capt. Hof<br />\nJudge Walter I. Dawkins, an<br />\nalumnus, has been selected gen- meister expects to turn out he is<br />\neral chairman of the campaign, working on an attractive schedule<br />\nand already has enlisted a general for the spring sport and he hopes<br />\ncommittee composed of alumni to stage matches with many coland a few others who have been leges which have not heretofore<br />\nactively identified with the college been met by the J. H. U. racquethrough membership on its gov- ters.<br />\nIn order to make sure of just<br />\nerning board.<br />\nwhat<br />\nmaterial he has to draw<br />\nThe members of the general<br />\ncommittee enrolled by Judge Daw- from, the Hopkins tennis leader<br />\nkins to date, with their graduation will call his squad out for regular<br />\nfall practice within the next 'few<br />\nyears given, are as follows:<br />\nin.field and parlor<br />\nT. W. Claggett, 1891; Dr. Jo- days. This, he states, will facilYou should see them when<br />\nseph Clement Clark, 1877; Wil- itate the selection of the players<br />\nthey tackle the drawing<br />\nrooms. They shine from the<br />\nliam C. Devecmon, 1881 ; James A. next spring. An organization<br />\ntips of their patent leather<br />\nFechtig, Jr., 1895; Dr. Thomas meeting for the tennis team is to<br />\npumps to the tops of their<br />\npatent leather heads:<br />\nFell; retiring president of St. be arranged just as soon as posThey slick their hair with<br />\nJohn's; State Senator -George A. sible, probably sometime this<br />\n\"Vaseline\" Hair Tonic. It<br />\ngives them that elegant,<br />\nFrick, 1880; former Governor week.<br />\nfinished look.<br />\nThe<br />\nfollowing<br />\nmemlist<br />\ngives the<br />\nPhillips Lee Goldsborough,<br />\nAt all drug stores and student barber shops.<br />\nber of College Board of Vistors nominations for Freshman class<br />\nCHESEBROUGH MANUFACTURING CO.<br />\nand Governors; Judge James P. offices. The election will be held<br />\n(Consolidated)<br />\nNew York<br />\nState Street<br />\nGorter, 1879; Judge Henry. D. in the C. E. Building Assembly<br />\nEvery\"Vaseline\"product is recommended<br />\neverywhere because of its absolute purity<br />\nHarlan, 1878; Judge William H. Hall immediately after Assembly<br />\nand effectiveness<br />\nIn buying a Stetson you need only be conHarlan, 1872; former Governor on October 1 1 :<br />\ncerned with the style-the quality is guaranEmerson C. Harrington, 1884; W:<br />\nPresident<br />\nteed by the name \"Stetson-.<br />\nThomas Kemp, 1897; Ridgely P. 1. Brown<br />\nMelvin, 1899; Addison E. Mulli- 2. Niner<br />\nSTYLED FOR YOUNG ME.14<br />\nken, 1895;'James M. Munroe, 3. Harwood<br />\n1874; Dr. Jame.s A. Nydegger, 4. Day<br />\n1890; Herbert Noble, 1889; for- 5. McNeal<br />\nmer Mayor James H. Preston,<br />\nVice-President<br />\n1881; William Woodward, mem1. Schwim<br />\nber of College Governing Board.<br />\n2. Young<br />\n•- The appeal for contributions to 3. Frantz<br />\nthe endowment fund will be 4. Miller<br />\nlaunched in Baltimore on October<br />\n5. Harwood<br />\n26, and will be carried on through- 6. Farinholt<br />\nout the state and in cities where<br />\n7.' Gibson<br />\nalumni are located. The majority<br />\n8. Hazel<br />\nof the alumni are located in MarySecretary<br />\nland.<br />\n1. Levy<br />\nAll expenses of the campaign<br />\n2. Seletzky<br />\nare borne by the alumni, and every 3. Blumberg<br />\ndollar contributed Ty the general 4. Kerus<br />\npublic will be used for the pur- 5. Marley<br />\nJOSEPH HENRY<br />\nposes for which it is given.<br />\n1797-1878<br />\n6. McAllister<br />\nThe appeal to the general public<br />\nIf any bell was ever heard around the<br />\nBorn at Albany, N.Y., where<br />\nTreasurer<br />\nhe became teacher of mathecarries with it what is believed to<br />\n1. Kleff<br />\nmatics and physics in Albany<br />\nworld, Joseph Henry rang it in his<br />\nbe a novelty in education in MaryAcademy. Leading American<br />\n2. Waters<br />\nphysicist of his time. First<br />\nland. While all alumni subscripfamous experiment at the Albany<br />\n3. Egerton<br />\ndirector of the Smithsonian<br />\ntions will be used to build up the<br />\nInstitution.<br />\n4. Brian<br />\nAcademy. The amazing development<br />\nendowment fund, and all non5. Bauernschmidt<br />\nof the electrical industry traces back<br />\nalumni contributors may have<br />\nStudent Council<br />\ntheir gifts go solely into the ento this schoolmaster's coil of insulated<br />\n1. Grinsfelter<br />\ndowment fund, each non-alumnus<br />\n2. Meredith<br />\nwire and his electro-magnet that lifted<br />\nsubscriber may have the privilege<br />\n3. Cleveland<br />\nof designating a portion of his or<br />\na ton of iron.<br />\n4. Lord<br />\nher gift to be used to create a Stu5. O'Dunne<br />\ndent Aid Fund, from which de6.<br />\nWinchester<br />\nFour years later when Morse used<br />\nserving young men of limited<br />\n7.<br />\nStone<br />\nmeans may borrow to pay part of<br />\nHenry's electro-magnet to invent the<br />\nthe cost of their education. Fre- SENIOR CLASS HOLDS MEETING<br />\ntelegraph, Henry congratulated him<br />\nquently the loan of,a few hundred FOR NOMINATION OF OFFICERS<br />\nwarmly and unselfishly.<br />\ndollars means the difference beRandolph Norwood was aptween remaining in college until pointed chairman of the June<br />\n•graduation or dropping out. The Week Committee of this year's<br />\nThe principle of Henry's coil of wire is<br />\nStudent Aid plan gives to the peo- senior class, at a meeting of<br />\nThe work that was begun<br />\nutilized by the General Electric Comby pioneers like Joseph<br />\nple of each county the opportunity the Senior Class held Friday, Ocbeing carried on<br />\nis<br />\nHenry<br />\nto help ambitious young men in tober 5, in C. E. Hall. George M.<br />\nby the scientists in the Repany in motors and generators that<br />\nsearch Laboratories of the<br />\nt1;eir respective counties.<br />\nShriver and W. Carville Gardner<br /><br />\nAthletes<br /><br />\n(STETSON<br /><br />\nBats<br /><br />\nVaseline<br /><br />\nHAIREkai'ONIC<br /><br />\nWhen Henry<br />\nrang the bell<br /><br />\nBLACK AND BLUE JAY TO APPEAR<br />\nEARLY IN NOVEMBER<br /><br />\nThe first issue of the 1923-24<br />\nBlack and Blue Jay will appear<br />\nabout November 10, according to<br />\nmembers of the staff interviewed<br />\ntoday. Due to the existence of a<br />\nlarge surplus from last year the<br />\nBoard will ptit out seven iss.ues instead of six. Copy for the publication is already started to pour in<br />\n:and a large number of advertisements have been obtained.<br /><br />\nare the other members of the committee. These men were appointed<br />\nby President Bonner at a meeting<br />\nof the senior class held last Friday.<br />\nWork on the June Week will start<br />\nimmediately.<br />\nAt the meeting members of last<br />\nyear's sophomore class who are<br />\ngraduating this year were elevated<br />\ninto the class. Nominations were<br />\nmade for officers for the coming<br />\nyear and also for an honorary class<br />\npresident to succeed Major Enoch<br /><br />\nGeneral Electric Company.<br />\nTheyare constantlysearching for fundamental principles in order that electricity may be of greater<br />\nService to mankind.<br /><br />\nlight cities, drive railroad trains, do<br />\naway with household drudgery and<br />\nperform the work of millions of men.<br /><br />\nGENE AL ELECT<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 9, 1923<br />\nwhich the Princeton coach sent<br />\ninto the game from time to time,<br />\nthe Black and Blue warriors<br />\ngamely resisted the powerful attack which was launched against<br />\nthem. It was by sheer brute<br />\nstrength that the New Jersey team<br />\nJunior Class meeting in Room<br />\ngained the distance which finally<br />\n12.0, C. E. today at 12.20 for<br />\nthe nomination of officers.<br />\nplaced the pigskin over the line<br />\nVery important.<br />\nfor their second touchdown. After<br />\nthat Hopkins abandoned the deINTERFRATERNITY BOARD HOLDS<br />\nfensive<br />\nstyle of play which they<br />\nINITIAL MEETING OF 1923-24<br />\nhad heretofore used and went<br />\nSEASON<br />\nJohn H. Croker presided over tooth and nail after the heavier<br />\nthe meeting of the Interfraternity team.<br />\nBoard, which convened for the \"Doug\" Turnbull started the<br />\nfirst time of the year in Gilman Hopkins attack in the last period<br />\nHall yesterday. The meeting was by running the ball back from a<br />\ncalled for the discussion of the long punt by Van Gerbig of<br />\nrushing agreement and particular- Princeton for a gain of 40 yards.<br />\nly for the drawing of dates for the The visitors fought like Turks<br />\nNovember entertainments. The from then on gaining ground<br />\nallotting of these dates at an early steadily until forced to kick. from<br />\nperiod is considered to be very im- the 40-yard line. Princeton tried<br />\nportant as the various fraternities to punt back immediately after<br />\nwish to make arrangements for receiving the ball, but Schact<br />\nrushed in and blocked the kick,<br />\ntheir parties as ,soon as possible.<br />\nthe home team recovering the ball<br />\nNEW FRATERNITY ON CAMPUS behind the goal line. The referee<br />\nThe past week has witnessed refused to allow Hopkins the safethe advent of apother national fra- ty which it seemed fo have gained<br />\nternity on Johns Hopkins campus basing his decision on a new rulin the installation of Rho chapter ing of the National Football Comof Phi Sigma Delta. Its present mittee. Princeton was then almembership consists of Emanuel lowed to play the ball from the 20Z. Aaronson, Albert E. Blumberg, yard line.<br />\nThe Tigers had gained nearly 15<br />\nHerman Chor, Albert Dickman<br />\nyards<br />\nwhen they tried a forward<br />\nand Leonard Stulman. This is the<br />\nseventeenth chapter of the frater- pass. The pass was intercepted<br />\nnity, the others being located at by \\\\Tolbert, who, with perfect inthe Universities of Columbia, terference by his teammates ran<br />\nCornell, Pennsylvania, Michigan, beyond the goal line for Hopkins'<br />\nTexas, Denver, Colorado, Chicago, only touchdown. Turnbull sucWisconsin, Rensellaer, New York ceeded on the try for point. The<br />\nUniversity, Boston College, Union Tigers made a fierce attempt to<br />\nCollege, Western Reserve, Ohio regain their former lead of 16<br />\nState and Massachusetts Institute points but the final whistle blew<br />\nwhen they had the ball within 15<br />\nof Technology.<br />\nyards of the goal. The lineup:<br />\nNOTICE!<br />\nCandidates for Hullabaloo<br />\nStaff meet in the Hullabaloo<br />\noffice in the Barn tomorrow<br />\nat 12.20.<br /><br />\nDamon—<br />\n\"What did Professor Smith mean<br />\nthis morning when he told you<br />\nthat no man could ever make a<br />\nsilk purse out of a sow's ear?\"<br />\nPythias—<br />\n\"He meant that I'd never be able<br />\nto do good work with a poor pencil.<br />\nGuess I'll have to get a Dixon's<br />\nEldorado. Old Smity says it's the<br />\nbest drawing pencil made.\"<br /><br />\nDIXON's<br /><br />\nEthoRAD<br />\n\"the masterthawilrgpencil\"<br />\n17 leads—all dealers<br /><br />\n111111.111111.1111<br />\n.<br />\n1111111111111M1<br />\n.<br />\n.<br />\n111 1111=<br />\n.<br />\n1 10<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\nLimited<br /><br />\nBARN CAFETERIA<br />\nORDERS RECEIVED FOR<br /><br />\nCOGGINS'<br />\nTransfer &amp; Baggage Express<br />\nAUTOMOBILE SERVICE<br />\nPHONE, HOMEWOOD 6886<br /><br />\nThe Flag, Banner &amp; Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br /><br />\nSANFORD'S<br /><br />\nHOPKINS-PRINCETON<br /><br />\nContinued from page 1<br /><br />\nFOUNTAIN PEN INK<br /><br />\nWill Improve the Action<br />\nof Any<br />\nFountain<br />\nPen<br />\n•<br />\nALL<br />\niu1111<br />\n./(<br />\nCOLORS<br /><br />\nPRINCETON (16)<br />\nL E<br />\nEmery<br />\nL T<br />\n3uckner<br />\nL G<br />\nCaldwell<br />\nC<br />\nHoward<br />\nR G<br />\nHills<br />\nR T<br />\nGorman<br />\nQ E<br />\nStout<br />\nR B<br />\nBeatti e<br />\nL H<br />\nSnively (cap.) R H<br />\nVan Gerb'g<br />\nB<br /><br />\nGAME 3mith<br /><br />\npoint failed, leaving the score at<br />\nthe end of the half 9-0 favor of<br />\nPrinceton.<br />\nHopkins showed a complete<br />\nchange of form in the second half.<br />\nBattling always against fresh men<br /><br />\nHOPKINS (7)<br />\nBerndt<br />\nMagill<br />\nWolbert<br />\nDay<br />\nMilanusky<br />\nSlowik<br />\nSchact<br />\nBonner (cap.)<br />\nTurnbull<br />\nMaxwell<br />\nRich<br /><br />\nScore by periods:<br />\nPrinceton<br />\n3 6 7 0-16<br />\nHopkins<br />\n0 7 0 0— 7<br />\nTouchdowns — Princeton, Crum,<br />\nBeattie; Johns<br />\nHopkins, Wolbert.<br />\nPoints after touchdown—Princeton,<br />\nCaulkins; Johns Hopkins, Turnbull.<br />\nDropkick — Smith. Substitutions —<br />\nPrinceton, Dinsmore for Gorman, Newby for Snively, Crum for Beattie, Drews<br />\nfor Smith, M. Legendre for Van Gerbig. Tilson for Stout, Paschal for How-<br /><br />\nard, Ewing for Crum, Forrest for Caldwell, Booth for Hills, Heimrath for Paschal, Caldwell for Forrest, Caulkins for<br />\nDinsmore, Stout for Tillson, Van Gerbig<br />\nfor Legendre, Beattie for Ewing, Snyder for Emery, Gorman for Caulkins,<br />\nShackleford for Newby, Crum for Beattie, Smith for .Drews, P. Bergen for<br />\nBuckner, Gibson for Van Gerbig, Howard for Heimrath, Dinsmore for Gorman; Johns Hopkins, Carter for Slowik.<br />\nTime of periods-10 minutes.<br /><br />\nA. JACOBS &amp; SONS<br /><br />\nine,<br />\nove<br />\nas<br />\npre<br />\nics<br />\nBoi<br />\nGei<br /><br />\nTailors<br />\nUniforms and Liveries<br />\n128 W. Fayette St., Near Liberty St.<br />\nBaltimore, Md.<br /><br />\nlila<br /><br />\npr(<br />\nart<br /><br />\nUse It<br />\nAnyzvhere!<br />\nHE Remington Portable Typewriter carTries<br />\nits table on its back. You can use<br />\nit<br /><br />\nanywhere—at any time.<br />\nIt is a complete typewriter with four-row<br />\nkeyboard—just like the big machines. Also<br />\nmany other useful features of the office typewriter. Yet it is small, compact, and fits in a<br />\ncase only four inches high.<br />\nPrice, complete with case,$60<br />\nEasy payment terms ifdesired<br /><br />\nRemington<br />\nPortable<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underauoted by any house at any time.<br />\ntL Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\n\"The Ink That Made<br />\nThe Fountain Pen Possible\"<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\nAt the<br /><br />\nWashington Monument<br /><br />\nDRAPERIES<br /><br />\nOscar Thomas Olson, D.D.<br />\nMinister<br /><br />\nURNER'S<br /><br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br /><br />\nMEN'S SHOES<br />\nOf the Better Class<br /><br />\nThe purpose and program of this<br />\nChurch will appeal to you. Look in<br />\non the Sunday afternoon -At Home\"<br />\nfrom five to seven.<br /><br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBaltimore<br /><br />\nSunday morning worship at 11 o'clock.<br />\n••••••111<br />\n,<br /><br />\nSunday evening service at 8 o'clock.<br />\nMusic by vested chorus—choir of soloists.<br /><br />\nEstablished 1873<br /><br />\nA. H. FETTING MAN'FG<br />\nJEWELRY CO.<br />\nManufacturers<br />\nGreek Letter Fraternity Jewelry<br />\n213 N. LIBERTY ST., Baltimore, Md.<br /><br />\n.`itif<br />\nIME]lregc<br />\n,<br /><br />\nMOE]<br />\nH01702 01111,5<br />\n\"The King of Lubricants\"<br />\nSHERWOOD BR .THERS, INC.<br /><br />\nHE constant'<br />\nsmoker finds<br />\nin Melachrino<br />\nCigarettes a delicacy of flavor of<br />\nwhich he never<br />\ntires.<br /><br />\nT<br /><br />\nIGINAL<br />\nMELktINO<br />\n\"The One Cigarette Sold the World Over\"<br /><br />\nCA'<br /><br />\n192<br /><br />\n27b<br /><br />\nALL<br />\nSIZES<br />\n•<br /><br />\nVO<br /><br />\n\"At the heart of the City\"<br /><br />\nALL SEATS FREE<br /><br />\nRE T A CAR<br />\nDrive It Yourself!<br />\nALL NEW, CLEAN CARS<br />\nFORDS, 12c PER MILE—DODGES OR HUPS, 18c PER MILE<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br /><br />\nDRIVE IT YOURSELF CO.<br />\n1725 N. CHARLES ST.<br /><br />\nVERNON 4049<br /><br />\nONE BLOCK SOUTH OF NORTH AVE.<br /><br />\ntut<br />\nan<br />\nsec<br />\nlea<br />\nCu<br />\nso:<br /><br />\nCz<br />\nwl<br />\nrn;<br /><br />\nsli<br />\nSt<br /><br />\nin<br /><br />\nhi<br />\nrn<br />\ntr<br />\ntr<br /><br />\nsi<br /><br />"}], "field_media_file": [{"target_id": 37769, "display": null, "description": null, "target_type": "file", "target_uuid": "2ce968a0-4ae1-41c6-b781-2ca030f6218c", "url": "http://digital.library.jhu.edu/system/files/2022-03/13074-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13074, "target_type": "node", "target_uuid": "612a3b43-e27f-47b1-bedd-6c0944772a44", "url": "/node/13074"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "eadd2191-0f61-4286-aa64-bea519e007b5"}]}