{"mid": [{"value": 35717}], "uuid": [{"value": "9c15c5fb-33f6-486a-b2c3-cfc652491b08"}], "vid": [{"value": 35717}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12252-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "annarezna.<br />\n<br />\n%nom<br />\n<br />\nTHE•JOHNS-HOFKINS•UNIVERSITY<br />\nBALTIMORE<br />\n<br />\n\f\fA<br />\n<br />\nThe News-Letter<br />\nVol. IX.<br />\n<br />\nFortnightly.<br />\n<br />\nNo.<br />\n<br />\n2<br />\n<br />\nReminiscences of Hopkins Athletics.<br />\nN the last number of the I\\Nws-LETTp:R,<br />\nmention was made of an article on football. I feel that an apology is due at the<br />\nstart from one who knows nothing of the<br />\ngame, whose recollections are therefore<br />\nvague. The few data given were kindly<br />\nfurnished by Prof. Paul Dashiell of the Naval<br />\nAcademy, who played on the team in '86,<br />\nwas captain in '87 and '88, and was at the<br />\nsame time our leader ih baseball and in athletics generally. He is well known to all<br />\nfootball players as expert and umpire. I<br />\nhad hoped to give some data of the game<br />\nin the '90s, but the information requested<br />\nhas not reached me.<br />\nAmong the players on Dashiell'a team<br />\nand shortly afterwards, were George<br />\nMorrison, now a rising lawyer here,<br />\nWyatt Randall, formerly associate in<br />\nthe University, Stuart Symington, Professor<br />\nat Amherst, Horace Burrough, now in business here, the Willoughby brothers, one of<br />\nwhom is Professor in the University, the<br />\nother Treasurer of Porto Rico, Charles<br />\nCoates, Professor at Tulane University, and<br />\nCharles Herty, Professor at the University<br />\nof Georgia.<br />\nHopkins teams were never heavy teams,<br />\nthe average weight of the men being about<br />\n155 lbs. In those days there was no medical<br />\nschool; the players were undergraduates or<br />\ngraduate students who were mostly Hopkins<br />\nB. A.'s ; they had grown up together and<br />\ntried from their Freshman year to make the<br />\nteam; it was a home combination; hence<br />\nthere was the same spirit of friendship and<br />\ncomradeship, the same subordination of individual interest to team interest, which has<br />\nin late years been the noticeable characteristic of our lacrosse teams. Our undergraduates are generally light men, hence the difficulty of getting an undergraduate team in<br />\nthese days when weight is so important.<br />\nFormerly heavy teams were not as common,<br />\nand we could encounter with hope of success<br />\nthe players of institutions whose present<br />\n<br />\nI<br />\n<br />\nteams would outclass any undergraduate<br />\nteam we could get together, as the following<br />\ndata show.<br />\nWe played the Naval Academy every year.<br />\nThey usually won, but in the year '88 (or<br />\n'87) we beat them. We played the University of Virginia for the first time in '88;<br />\nscore 16 to 0 in favor of Hophins. In the<br />\nsame year we played the University of Pennsylvania; they won by the score of 22 to 12.<br />\nThe chief features of the game as I recall<br />\nit were the crumpling of the Hopkins line<br />\nby Penn's giant heavy weight, Wagenhurst,<br />\nand the skill of Dashiell and his light team.<br />\nThe only game with Princeton which Prof.<br />\nDashiell remembers was in '86, Princeton<br />\nwon; score 104 to 01 Something to remember; we have not played Princeton since,<br />\nI think. St. John's was always a rival, and<br />\nthe games were close. We played Gallaudet, Western Maryland, and, I think, Maryland Agricultural every year.<br />\nOf the players in the '90s I chiefly recall<br />\nStuart Janney, who captained the team and<br />\nwas an all-round athlete, taking the leading<br />\nplace in his day that Dashiell had held previuosly. Mr. Janney is now practicing law<br />\nin Baltimore and is the present alumni delegate to the Athletic Board.<br />\nThe conditions then were so different from<br />\nthe present conditions, that a sketch of them<br />\nmay be novel to most of the readers of the<br />\n1\\11,vs-LETTER. There was no cage, and practice for games was at Druid Hill Park on<br />\nthe field now used for lacrosse practice.<br />\nThough we had no cage, we had a beautiful<br />\nathletic field of our own. Clifton, the country place of Mr. Johns Hopkins, since bought<br />\nby the city as Clifton Park, was then owned<br />\nby the University. The trustees had drained.<br />\nlevelled and sodded a large field close to<br />\nthe Hopkins Mansion. A room in the latter<br />\nwas fitted up with lockers Its dressing room.<br />\nThere was no grand stand, but a broad<br />\ngrassy terrace a few feet higher than the<br />\nfield and shaded by fine trees served the<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\npurpose; settees and chairs from the house<br />\nwere brought out for those who wished them<br />\nbut the students and most of the other spectators stood or sat on the grass. Athletics<br />\nin this field made a lovely picture; the perfectly levelled field with the uniformed<br />\nteams, the bright dresses of the ladies on<br />\nthe green terrace against the background of<br />\ngiant pines and cedars, the view bounded on<br />\nevery side by masses of foliage, nothing dirty<br />\nin sight. It was beautiful but there were<br />\ndrawbacks. We could collect gate-money at<br />\nthe western entrance to the grounds, but<br />\nfrom the rear anyone could enter, and many<br />\nthrifty souls preferred the rear entrance.<br />\nHence gate-moneys were small. Then the<br />\ndistance from the University! I suppose it<br />\nis about the same distance now, but rapid<br />\ntransit annihilates distance, and this was before the days of rapid transit. horse cars<br />\nmeandered through Baltimore Street and<br />\nfound their way out the Harford Road as<br />\nfar as a brewery; there they stopped, and<br />\nthere was a quarter-mile of dust or mud to<br />\ntramp through to the grounds. The correct<br />\nthing was to take a seat in one of the omnibuses hired by the Athletic Association on<br />\nspeculation—sometimes a losing speculation.<br />\nThe 'buses lined up on 'Toward Street in<br />\nfront of the gym. at 2 P. M. The teams<br />\nwere in the big 'bus in the van, the spectators<br />\nfollowing in smaller 'buses; with banners<br />\nwaving, college yells resounding, the procession slowly rambled out Charles Street,<br />\nNorth Avenue and the Harford Road to the<br />\ngrounds, taking an hour or more for the<br />\ntrip. The 'buses were slow, but the students<br />\nwere not. They enjoyed every dusty moment; friends and strangers were greeted<br />\nimpartially; the chief rooter was busy; one<br />\ncould hear him roar \"What's the matter<br />\nwith the girl in the blue dress?\" and the<br />\nanswering chorus \"She's all right.\" The<br />\ngirls in blue or any other color seemed to<br />\nenjoy it—it was a break in the quiet of the<br />\nstreets—for Baltimore streets were quiet<br />\nthen; it was before they were made a roaring<br />\npandemonium by the electric cars.<br />\nThere were no locker-rents then to maintain athletics. The Athletic Association was<br />\na body of students numbering 80 or 90 who<br />\npaid $2.00 each per year. The necessary<br />\nbalance was raised by passing the hat—<br />\namong the faculty mostly. It began in the<br />\n<br />\nfall when the football team made the first<br />\ntouch. Towards Spring there was a generous rivalry between the baseball and lacrosse<br />\nteams as to which should get at the faculty<br />\nfirst. It was an old custom in most colleges<br />\nthat the faculty should have the perennial<br />\nprivilege of helping the boys out, yet the<br />\nteam emissaries were not always received<br />\nwith enthusiasm. There were artists among<br />\nthem, however, who had a magic touch, chief<br />\nof whom was IIerty, a very genial man; it<br />\nwas believed that no one could resist his<br />\nblandishments; some of his friends were so<br />\nimpressed with his ability in this line, that<br />\nthey declared the University missed the<br />\nchance of its life in not electing him President.<br />\nOur finances were on a precarious footing<br />\nat best. Yet we ran the teams. The players<br />\nhelped by paying their own petty expenses,<br />\noften buying their own uniforms. Expenses<br />\nwere far below the present standard; paid<br />\ncoaches, trainers and rubbers were unknown.<br />\nOld players coached without pay. Jim, the<br />\ngymnasium janitor, was rubber, students assisting if needed.<br />\nThe spirit of self help and mutual help in<br />\nthose days was admirable. The weak point<br />\nin the situation was the begging for funds,<br />\nwhich was unavoidable. This came to an<br />\nend when the new gymnasium and the cage<br />\nwere built with considerable cost to the<br />\nUniversity at a time when the University was<br />\nsuffering from a depreciation in value of investments. It is the custom in many of the<br />\nlarger colleges to charge a gymnasium lockerrent, which pays or helps to pay the expenses<br />\nof the gymnasium; the University authorities<br />\ndecided to adopt this plan in the new gymnasium, but the student body requested that<br />\nthe locker-rents should be given to the Athletic Association to defray the expense for<br />\nthe athletics, promising that no further assistance should be asked of the faculty or<br />\nalumni. The Board of Trustees granted this<br />\nrequest. The directors of the Athletic Association know about what sum they can<br />\ncount on in a given year, and have never exceeded it.<br />\nIn closing, I wish to add a few words on<br />\nwhat appear to an older man dangers in the<br />\nathletic system of the present day. I am<br />\nnot referring to Hopkins conditions, which<br />\nfor obvious reasons are exceptional, but to<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nthe conditions prevailing in many large colleges.<br />\nAn idea seems to be gaining ground among<br />\nAmerican students that a man who plays<br />\non a team gives something to his fellow students which it is their duty to pay for; that<br />\nhe not only should receive reward in athletic<br />\nhonors, in medals or in costly trophies, but<br />\nshould have his personal expenses paid in<br />\ngreater or less degree, still feeling magnanimous in that he has \"given\" his time. Is<br />\nthis a sportsmanlike spirit? It introduces<br />\nthe idea of payment for service rendered;<br />\nis it not rather a step in the direction of the<br />\nspirit of the hired gladiator? The teams of the<br />\ngreat. athletic colleges with their enormous<br />\nrevenues and lavish expenditure have set a<br />\nstandard which has affected every college<br />\nin the country, and which seems to me a<br />\nmenace to a healthy athletic spirit. Men<br />\nnow are doubtless better trained, but I regret<br />\nthe old simple days when college athletics<br />\nwere less business and more sport.<br />\nAnother danger is the advent of students<br />\nwhose chief or only interest in college is athletics. I gave the present standing of the<br />\nold football players whom I remember, with<br />\na purpose. I wished to show you that they<br />\nhad become men of mark. Everyone of these<br />\nmen ranked high as scholars, some exceptionally high. They were fine athletes because<br />\nthey were men who would not undertake<br />\na thing unless they could do it well. Athletics to them was sport for leisure hours,<br />\nnot a thing foremost in their minds.<br />\nIt is a good trait of our people to strive<br />\nto attain the highest excellence in whatever<br />\nthey undertake, but students should remember that colleges, if they fulfil their purpose,<br />\nprepare them for their life-work. Few wish<br />\nto make athletics their life-work, many find<br />\nit a pleasant mode of frittering away three<br />\nor four years of their life.<br />\n<br />\nEDWARD RENOUlt.<br />\nLittle Willie died last night,<br />\nHis face we'11 see no more;<br />\nFor what he thought was 1-1 2 0<br />\nWas H 2 S 0 4.<br />\n—Collegian.<br />\n\"Why did the color run on my shirt?\"<br />\n\"I guess it was afraid to dye.\"<br />\n—Harvard Lampoon.<br />\n<br />\n3<br />\n<br />\nTHE FIRST FEED OF THE<br />\nHULLABALOO CLUB.<br />\nThe Hullabaloo Club of the Johns Hopkins<br />\nUniversity was founded in 1903 by the members of that year's Senior Class. Its object,<br />\nas set forth by its founders, was to promote<br />\ngood fellow-ship among the members of the<br />\nSenior class. .In the two years of the existence of the organization, it has ably fulfilled<br />\nthe purpose of its founders, and in its<br />\n\"feeds\" there has been shown an enthusiasm<br />\nand class spirit which has not often had a<br />\nchance to show itself elsewhere. Last year<br />\nthe Club held a series of field nights which<br />\nproved very popular, and attracted almost<br />\nthe whole Senior class. This year the Board<br />\nof Governors has planned to have a smoker<br />\nand \"feed\" on the first Friday of each<br />\nmonth, the subscription for each being 50<br />\ncents. The Johns Hopkins Club has given<br />\npermission to the Board to use its rooms<br />\nfor the celebrations, and, for the present at<br />\nleast, they will be held there.<br />\nThe Club will hold its first \"feed\" in the<br />\nJohns IIopkins Club's rooms on Friday, November 4th.<br />\nThe ceremonies will begin<br />\nat 8.30. Every effort has been made to<br />\nmake the evening a success, and it is expected that every member of the Senior class<br />\nwill be present. Everyone certainly ought<br />\nto turn out on occasions like this. There is<br />\nno better way of getting really to know the<br />\nmembers of one's class, and besides, the<br />\nbigger the crowd, the faster and \"furiouser\"<br />\nthe fun will be, the greater the enthusiasm<br />\nand noise, and the better the general good<br />\ntime all round. And after all, when you<br />\ncome to think of it, such occasions are almost the only times when our classes can<br />\nget together and see something of the fascination of that careless atmosphere of smoke<br />\nand song which forms part of what is called,<br />\nin other Universities, college life. When our<br />\nclasses do have a chance to get together, no<br />\none can afford to be absent from the gathering. The Hullabaloo Board is going to make<br />\nsuch chances more frequent in future, and<br />\nif the present feed is successful, the first<br />\nof each month will see another of the same<br />\nkind.<br />\nSo far as providing the actual \"feed\" for<br />\nFriday night goes, the Committee has done<br />\neverything to supply enough for all, and a<br />\nvariety of everything. There will be all<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nkinds of refreshments—liquids guaranteed If experienced men would join the club and<br />\nto satisfy the cravings of every political play in the tournaments, within a year or<br />\nparty that is now represented in the Senate; two, the choice of a Hopkins representative<br />\nsolids, fresh from the ovens of the National in an intercollegiate match would be a hard<br />\nBiscuit Co., and refreshments of the vapor- one because of the number of first-class playous variety, for which the material will be ers that would be available. The members<br />\nsupplied in such profusion that anyone who are always willing to teach new men and<br />\ncan see across the room ten minutes after to coach promising players. The duties are<br />\nthings are started, will be given back his not onerous, the dues not burdensome. As<br />\nThere will be a rule the playing of a match-game is open<br />\nsubscription at the door.<br />\ngood Hopkins songs such as we hear too to the convenience of the players. The deseldom, and good popular songs, which will mand on one's time is not at all severe, and<br />\nsound better than ever before; yells which the good resulting to the members is subwill stir the sluggish blood of the graduates stantial.<br />\nThe club will hold a preliminary meeting,<br />\nin neighboring rooms, and in short, such<br />\na rousing good time as the members of the early in the year, and hopes that the faculty.<br />\nclass of 1905 have seldom had together, and graduate students, seniors, juniors, and especially the in-coming freshmen will take<br />\ncannot afford to miss.<br />\nan interest in the royal game, and hand their<br />\nnames to J. F. Cremen, the secretary of the<br />\nTHE CHESS CLUB.<br />\n1905.<br />\nClub.<br />\nT the Hopkins there has been a chess<br />\nBut there has been no continued and<br />\nMUSICAL CLUBS.<br />\nclub of some kind for esveral years.<br />\nstudents<br />\nWith<br />\nthe commencement of work at the<br />\nenthusiastic interest shown by<br />\nfor<br />\nUniversity, the Musical Clubs begin what,<br />\nwhich would enable the club to flourish<br />\nany length of time. Now, however, there it is hoped will be the most successful year<br />\nof their existence. Already a large number<br />\nneed be no lack of interest in the game;<br />\nof candidates have applied, but, judging<br />\nand<br />\nplace to play has been secured, boards<br />\ncan<br />\nfrom<br />\nthe size of the Freshman class, there<br />\nchessmen are always at hand, instruction<br />\nbasis<br />\nmust<br />\nbe a great many others who play or<br />\nbe easily gained—and, above all, the<br />\nsing,<br />\nwho have given no intimation of<br />\nbut<br />\nof a live club has been made.<br />\nit.<br />\nwas<br />\nLast year, a revival of chess-playing<br />\nThe great need of the Clubs is guitars and<br />\nattempted at the University. A gratifying<br />\nof<br />\non the instrumental clubs, and first<br />\nefforts<br />\nbanjos<br />\nnumber of men responded to the<br />\ntenors<br />\na<br />\nin<br />\nand<br />\nthe Glee Club. The guitar is an<br />\nthose interested in forming a club;<br />\nmatch<br />\nA<br />\nimportant<br />\ninstrument and the man who<br />\nvery good season was the result.<br />\nViron<br />\nplays<br />\nis sure to be taken on the difit<br />\nof<br />\nwas arranged with the University<br />\nBlack<br />\nferent<br />\nthe<br />\ntrips,<br />\npartly because of this fact, and<br />\nginia Chess Club, and, although<br />\nand Blue lost, it was not without ad- partly because he will play on two clubs,<br />\nvantage, and this step has opened the the Mandolin and the Banjo.<br />\nAll the Clubs promise to be up to their<br />\nway for an annual contest. A very<br />\nusual<br />\nhigh standard. The Glee Club has<br />\nsuccessful tournament was also held in<br />\nengaged<br />\nMr. A. L. Holloway as instructor,<br />\nLevering Hall, and all the members<br />\nand<br />\nwith<br />\nhis aid has made great progress.<br />\nwith<br />\nexpressed themselves highly satisfied<br />\nA<br />\nnumber<br />\nof last year's men are back, and,<br />\nthe result. The last, but not least enjoyable<br />\nhence,<br />\nthere<br />\nhas been little difficulty in workevent of the year was a \"chess evening.\"<br />\nDr. Morley and Mr. Liddell played simul- ing up \"Jemima's Piano\" and \"Jencks's<br />\ntaneous games against the members. The Vegetable Compound,\" both of which pieces<br />\nevening passed pleasantly, many old students were sung last year. At present, Mr. Ruth,<br />\nthe leader, is collecting popular songs for a<br />\nbeing present to watch the games.<br />\nThis year the club wishes to claim more medley. He has also an old English song,<br />\nattention from the student-body. The train- \"A Franklyn'a Dogge Leped Over a Style,\"<br />\ning and pleasure derived from playing chess which promises to have some excellent harare too well-known to need mention here. mony.<br />\n<br />\nF.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n5<br />\n—<br />\n<br />\n• The prospects for the Mandolin Club are<br />\nvery promising. A number of candidates<br />\nhave come forward, so that, with the old<br />\nmen, the Club will consist of about thirty.<br />\nOf the candidates, however, only two are<br />\nFreshmen. This is a poor showing, especially when one considers that next year and<br />\nthe year after they will have to help make<br />\nup the Club. So far, only one man has<br />\noffered to play the guitar. This is unfortunate, as it forces both Mandolin and Banjo<br />\nClubs to depend on men who have left the<br />\nUniversity, and who are unable, consequently, to come to rehearsals.<br />\nThe Banjo Club, under Mr. Marshall, who<br />\nled it several years ago, should be very good.<br />\nAs in former years, it has started out badly,<br />\nbut it will probably improve a great deal as<br />\nsoon as more banjos and guitars can be<br />\nfound.<br />\nSo much for the Clubs, now for the trips.<br />\nTwo long trips are taken each year. This<br />\nyear they will probably be to the Eastern<br />\nShore and to northern and eastern Virginia,<br />\nalthough it has not been decided yet which<br />\nwill be taken at Christmas and which at<br />\nEaster. Another trip is the one to National<br />\nPark Seminary. This is so popular that a<br />\ngreat many men come to practice just to be<br />\nable to go on it. Then there is the Hannah<br />\nMore trip. On this the men always have<br />\nan enjoyable evening with the girls, and<br />\ncome home with trophies of various kinds,<br />\nsuch as handkerchiefs, etc. The Catonsville<br />\ntrip is popular, too. Besides these there are<br />\na number of other concerts where the men<br />\nhave a little recreation singing \"The Little<br />\nOld Red Shawl,\" \"I've Been Working On<br />\nThe Railroad,\" \"Mona,\" etc., and where<br />\nMr. Bristol brings the house down with his<br />\n\"0-0-0-oo-O'Brien\" and the story about the<br />\nman who fell to the ground \"peachless.\"<br />\nAltogether the men pass a very pleasant year<br />\nand are sorry when it is over.<br />\n<br />\nW. WATURS PAGON.<br />\n<br />\nUNDERGRADUATE NOTES.<br />\nThe Freshman class has elected the following permanent officers:—<br />\nPresident—G. Pitts Raleigh.<br />\nVice-President—W ii. Iglehart.<br />\nSecretary—Albert Grauer.<br />\n- Treasurer—George A Stewart.<br />\nHistorian—M. S. Caples.<br />\nSergeant at Arms—L. W. Pierce.<br />\nThe Senate has been organized by the<br />\nSenior class. The election resulted as follows:—<br />\nPresident—Francis Morris Miller.<br />\nClerk—J. Earle Mifflin.<br />\nSergeant at Arms—H. V. Morse.<br />\nThe Chess Club will re-organize this week<br />\nfor the work of the year. The Club expects<br />\nto arrange some good matches with other<br />\norganizations ,and the indications are that<br />\nsomething will be doing this year in the<br />\n\"sport of kings.\" Here's success to the<br />\nChess Club!<br />\n<br />\nEXPLAINED.<br />\nSaw I once the queerest chickens<br />\nWhich have ever been;<br />\nFeathers red, and gold, and crimson,<br />\nYellow, purple green.<br />\nAsking how the colors got there,<br />\nThis is what I heard;<br />\n\"They were hatched out by a rooster,<br />\nSo each one's a son-set bird.\"<br />\n'06,<br />\n<br />\nA POINT AT LAW.<br />\n\"It is a case of murder,\"<br />\nThe prosecutor said;<br />\n\"And so I ask the jury<br />\nTo hang him till he's dead.\"<br />\n<br />\nThe Glee Club's trainer is very appropriately named Prof. Holl(er)away.<br />\n<br />\nDefendant did not like this.<br />\nSo persuasive was his tongue,<br />\nThat he did not get convicted;<br />\nAnd the jury—it was hung.<br />\n<br />\nJapanese Soldier (sharpening his sword)<br />\n—\"Blessed are the piece-makers, for they<br />\nshall inherit Manchuria.\"<br />\n<br />\nJohn—What shape is a kiss?<br />\nJack—A-lip-tickle.<br />\n—McGill Outlook.<br />\n<br />\n'06.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n=,<br />\n<br />\nhe llews•letter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINs UNwERsITY.<br />\n<br />\nNOVEMBER 4, 1904.<br />\n<br />\nSubscription $1.50 per year.<br />\n<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n<br />\n10 Cents a single copy.<br />\n<br />\nHAR1AON V. MonsE,<br />\nTHOMAS OWINGS,<br />\nORMOND W. HAMMOND,<br />\n{H. FINDLAY FRENCH,<br />\n<br />\n1905.<br />\n1805.<br />\n1906.<br />\n1906.<br />\n<br />\nW. R. STRATTOHN,<br />\n{E. LELAND SHACKELFORD,<br />\nBusiness Manager,<br />\nG. WOLTERECK,<br />\nAssistant Business Manager,<br />\nCARLYLE BARTON,<br />\n<br />\n1005.<br />\n1906.<br />\n1905.<br />\n1906<br />\n<br />\nAssistant News Editors<br />\nAthletic Editors,<br />\n<br />\nAddress all articles, communications, etc., to HARMON V.<br />\nMown, box 431, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\n0. Wourinticos:, box 677, J. H. U.<br />\n<br />\nEDITORIAL.<br />\nSome comment has been heard upon the<br />\nsmall but very select number of students<br />\npresent at the football game with St. Mary's<br />\ntwo weeks ago. Some students expressed<br />\nthe feeling that fifty cents was too much to<br />\npay to see a game with such a team as St.<br />\nMary's.<br />\nNot long ago, in talking with a prominent<br />\nmember of the Athletic Board who opposed<br />\nhaving baseball and football teams under<br />\nthe present conditions, he expressed the following opinion in support of his view: \"The<br />\nundergraduate body at Hopkins has the<br />\nworst reputation of any such body in this<br />\ncountry when it comes to going to games<br />\nand to 'rooting' the teams on to victory.\"<br />\nNot having definite information on the<br />\nsubject, this statement could not be refuted.<br />\nAnd yet the NEWS-LETTER believes that, after<br />\nall, part of this fault lies with the management of the teams. What the NEWS-LETTER<br />\nmeans is this: we believe that fifty cents is<br />\na price which keeps many students away who<br />\nwould otherwise be glad to go to the majority of the games. Making the price, say<br />\ntwenty-five cents for students only, we think,<br />\nwould be money in the hands of the<br />\nmanagement. If there was a large and enthusiastic body of students at each game to<br />\n\"whoop things up\" so to speak, there would<br />\n<br />\nundoubtedly be a larger crowd of outsiders<br />\npresent, for the simple reason that if the<br />\nstudents themselves are enthusiastic over<br />\ntheir teams, others will also take a more<br />\nlively interest in Hopkins.<br />\nIn suggesting the advisability of the various athletic teams of the University making<br />\nspecial rates of admission to games for students, we believe we are simply voicing a<br />\nfeeling that has long been felt if not expressed. We are convinced that not only<br />\nwould such a procedure be a great relief to<br />\nloyal supporters of the teams, but would<br />\nalso be a source of increased revenue to the<br />\nAthletic Association.<br />\nOf course this is all conjecture as to the<br />\nfinal results. But judging from the results<br />\nat other colleges, which have special rates<br />\nfor students, the same plan should be successful here. The plan of offering season tickets<br />\nat a reduced rate last spring was a step in<br />\nthe right direction, but it was not enough.<br />\nFew students will buy a season ticket. On<br />\nthe other hand the NEWS-LETTER thinks most<br />\nstudents would go if the price were twentyfive cents. At any rate the NEWS-LETTER<br />\noffers this as a suggestion to the management<br />\nwith the hope that it will be tried several<br />\ntimes to see whether it is a successful or an<br />\nunsuccessful plan.<br />\nIn a letter to the \"News\" last week, Mr.<br />\nRichard H. Pleasants, of the Baltimore bar,<br />\nmade the suggestion that the city should<br />\npurchase the present buildings of the University for the use of its various free schools.<br />\nHe gave several reasons for thinking that<br />\nsuch an action would be desirable, among<br />\nwhich were the following:<br />\nIt would give the University the nucleus<br />\nof a fund for the erection of new buildings<br />\non our grounds at IIomewood.<br />\nIt would provide homes for the Polytechnic Institute, the Maryland Institute and a<br />\nfinely located public hall for educational<br />\ngatherings.<br />\nMr. Keyser, President of the Board of<br />\nTrustees of the University, said when told of<br />\nMr. Pleasant's suggestion, that the University was not trying to sell its buildings at<br />\nthe present time, but that if the city should<br />\nrenew the offer at any future time when the<br />\nUniversity was about to move to Homewood,<br />\nit would certainly be favorably considered.<br />\n<br />\n1<br />\n<br />\n\f7<br />\n<br />\nTHE NEWS-LETTER.<br />\nThe group of buildings would naturally be<br />\nbest adapted for educational purposes and<br />\nwould be what is needed for the use of the<br />\nMaryland and of the Polytechnic Institutes.<br />\nPresident Remsen confirmed what Mr.<br />\nKeyser said on the subject, and there seems<br />\nto be little chance that the subject will come<br />\nup again until the University is moving to<br />\nthe country, when such a disposition of the<br />\nbuildings would probably be advantageous<br />\nto both sides. The sale of the six buildings<br />\nshould bring the University quite a large<br />\namount, which would probably come in very<br />\nuseful for the erection of new buildings at<br />\nHomewood.<br />\nTo the NEWS-LETTER:<br />\nNot for a number of years has such lively<br />\ninterest been evidenced at Hopkins as is<br />\ntoday in athletic sports. There is a general<br />\nfeeling among the students that Hopkins<br />\nmust be represented not only on the lacrosse<br />\nfield, but on the gridiron, the oval and the<br />\ndiamond, too. When the football team was<br />\nrecognized a few weeks ago it was a step in<br />\nthe right direction; but it was only brought<br />\nabout by the students insisting that the members of the Athletic Board, as their representative, take this action. These same men<br />\nare DOW clamoring for a baseball team, saying that if the \"prep\" schools and small<br />\ncolleges can be represented by teams playing<br />\nthe national game, what, then, is the matter<br />\nwith Hopkins? This early in the year we<br />\nare told, and by men who ,know, that there<br />\nare over 25 men, the majority of whom<br />\nhave been stars in other University teams,<br />\nand who are ready and anxious to represent<br />\nHopkins on the diamond next Spring. These<br />\nmen have pledged themselves to play, the<br />\nstudents want a team, and the Ahtletic Association, as the representative body of the<br />\nstudents, should act promptly. If the Athletic Association carries out the will of the<br />\nstudent body, the University will have a<br />\nbaseball team next Spring.<br />\nGrad.<br />\n<br />\npresent at the meeting and consulted with<br />\nan advisory Board consisting of Mr. Frederick Law Olmstead, the celebrated landscape architect, who has charge of the development of the Homewood grounds; Mr.<br />\nWalter Cook; and Mr. J. B. Noel Wyatt, of<br />\nthis city.<br />\nFive architectural firms were asked to submit designs; they were: Peabody & Sterns,<br />\nof Boston, Carrere & Hastings, of New York.<br />\nW. H. Boring, of New York, Parker &<br />\nThomas, of Baltimore, and Baldwin & Pennington, also of this city. The ones decided<br />\nto be best will possibly be requested to proceed with the work of construction. No<br />\npublic statement about the outcome of the<br />\ncompetition will be made until the findings<br />\nof the advisory Board are submitted to the<br />\nUniversity trustees.<br />\n11111111111MME111<br />\n<br />\nJOHN MARSHALL CHEW.<br />\nWhereas, it has pleased Almighty God,<br />\nin His infinite wisdom, to remove from our<br />\nmidst our class-mate, John Marshall Chew,<br />\nbe it<br />\nResolved, that we, the members of the<br />\nClass of Nineteen Hundred and Seven, extend our heart-felt sympathy to his family<br />\nin this, their great bereavement<br />\nAnd be it further resolved, that a copy<br />\nof these resolutions be sent to his family<br />\nand also published in the NEWS-LETTER and<br />\nin the year-book of the Class of Nineteen<br />\nHundred and Seven.<br />\nRICHARD MAC SHERRY,<br />\nCHARLES F. PIETSCH,<br />\nHENRY P. HYNSON, JR.,<br />\nMIIIMIIIIIIM11111<br />\n<br />\nDR. OSLER TO ADDRESS DOCTORS.<br />\n<br />\nDr. William Osier was the principal<br />\nspeaker at the regular meeting of the Laennec, a society of physicians organized for the<br />\nstudy of tuberculosis, held in the medical amphitheatre of the Johns Hopkins Hospital on Thursday night. \"Acute TuberThe first meeting to consider plans for the cular Pnecmonia\" was the general subject<br />\ndevelopment of Homewood took place on for the meeting, and Dr. Osier discussed<br />\nThursday of last week, and sketches were the clinical features of the disease. The<br />\nsubmitted to the Board by five architectural pathological side of the subject was taken<br />\nfirms. Dr. Remsen and Mr. Keyser were up by Dr. W. G. MacCullum.<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nHOPKINS, 0; U. M., 0.<br />\nBacked by about twenty-five or thirty enthusiastic rooters, the 'Varsity foottball team<br />\nwent to Westminster, Saturday, October 29,<br />\nand played a peculiarly interesting game<br />\nwith Western Maryland College. Despite<br />\nthe rocky and undulating cornfield on which<br />\nthe game was played, and which bore no<br />\ntrace of ever having been marked off, our<br />\nmen put up a creditable showing. The team<br />\narrived at Westminster about noon, and at<br />\n2.30 started down the half-mile cow-path,<br />\nwhich led from the dressing room to the<br />\nfield. Western Maryland won the kick-off,<br />\nand sent the pigskin through a number of<br />\nerratic evolutions for the distance of about<br />\nten feet. Hopkins fumbled on the catch and<br />\nthe ball went to Western Maryland for the<br />\nfirst down. Hopkins held them for downs<br />\nand recovered the ball.<br />\nAbout this time the much talked of Roberts, Western Maryland's fullback, received<br />\nthe greater part of Blanck's knee in the<br />\nregions of his dinner. The Western<br />\nMaryland rooters began to grow restless and despite the noble efforts of their<br />\nleader (whose voice, by the way, was only<br />\nharmonious when quiet), their songs lapsed<br />\ninto a nursery whine of dissatisfaction. This<br />\nwhine increased as the game proceeded. It<br />\nwas almost impossible for the referee to<br />\njudge downs on the unmarked field. Consequently it was necessary for the line-keepers<br />\nto carry the line across the field at every<br />\ndown, to satisfy our opponents that they<br />\nwere not being cheated. At the Western<br />\nMaryland fifteen-yard line, Blanck, who was<br />\ntaking the ball around left-end for a touchdown, severely wrenched his ankle on one of<br />\nthe many small bowlders which were inter-<br />\n<br />\nspersed with the corn stubble, and in falling<br />\nhe lost the ball. By a series of clever plays<br />\nWestern Maryland worked the ball up to<br />\nHopkins five-yard line, when time was called.<br />\nHopkins had the kick-off in the second<br />\nhalf, and were about to line up, when there<br />\narose a difficulty which taxed the combined<br />\nmathematical abilities of umpire and referee<br />\nto settle. The faint line, which before the<br />\ngame fixed the centre of the field, had faded<br />\ninto the \"heterogeneity\" of the ground. The<br />\nonly other line on the field was behind our<br />\ngoal posts and it was evidently the intention<br />\nof the Western Maryland people that the<br />\nkick-off should be from that point, when a<br />\ncompromise was arranged. It was found<br />\nthat, with a few irregularities the field sloped<br />\nfrom either end, down to a miniature gorge.<br />\nThis gorge was decided upon for the kickoff, and Randall sent the ball to what would<br />\nhave been Western Maryland's I5-yard line.<br />\nHopkins held them for two downs, and end<br />\nplay was tried by Western Maryland. This<br />\nsucceeded to the point of losing the ball.<br />\nMcDonald fell on it, and in the frenzy of<br />\ntheir grief, Western Maryland said they<br />\n\"wouldn't play unless the ball was returned.\" As McDonald has scruples about<br />\nthe humoring of spoiled children, he refused<br />\nto comply and was sustained by the decision<br />\nof the referee. Western Maryland carried<br />\nout their threat and left the field. As the<br />\nball was still in play our men carried it up<br />\nfor a touchdown. At this point ,one of the<br />\nWestern Maryalnd backs came out on the<br />\nfield and wanted to fight Blanek. The latter<br />\nwas accommodating and the half-back woke<br />\nup some ten feet away. The field then<br />\nswarmed with the rooters of both teams and<br />\nfor a few moments things were lively. The<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n9<br />\n<br />\nof whom played in last year's team. These<br />\nmen are all enthusiastic for baseball, and if<br />\n\"spirit\" has anything to do with making<br />\na team a big success, this year's team will<br />\nbe one that the students and friends of Hopkins can look upon with pride. These men<br />\n.911 have the advantage of last year's experience, and their strength, combined with<br />\nthat of the new men just entering the University, will be a big boon to baseball this<br />\ncoming season.<br />\nAmong the new and experienced players<br />\nnow in the University are the captain of<br />\nthe Syracuse University team, Lipscum of<br />\nthe Randolph-Macon College team, Wight<br />\nW. M. C.<br />\nPosition<br />\nJ. H. U.<br />\nCooling and Hand, old Hopkins stars who have just<br />\n.Center<br />\nPrebble<br />\nStayton returned to the University, and Higgins in<br />\nRight guard<br />\nIkleberger<br />\n.Curry<br />\nLeft guard<br />\nCrothers<br />\nLoft tackle....Henry, Thomas the first year of the Medical School, who<br />\nKelley<br />\nSmith<br />\nRight tackle<br />\nWorthington<br />\npitched last season for the Kentucky State<br />\nRanier<br />\nLeft end<br />\nBoyce<br />\nMyers (capt.) College team.<br />\nRight end<br />\nHolland<br />\nRoberts, Henry<br />\nFullback<br />\nBlanch<br />\nIn addition to these it will be safe to count<br />\nLawyer<br />\nPearre (capt.).... Right halfback<br />\nWeeks on several of the present Freshman class.<br />\nLeft halfback<br />\nMcDonald<br />\nHiggins<br />\nQuarterback<br />\nRandall<br />\nMost of last year's games were played<br />\nLinesmen—Sioussat (J. H. U.) and Stephens away from home. This year, however, it<br />\n(W. M. C.). Timekeepers—Dill (J. IL U.) and<br />\nis hoped that the majority of games may be<br />\nWilson (W. M. C.). Referee—Milton. Umpire—<br />\nProfessor Davy.<br />\nplayed at home, and by so doing, give the<br />\nbaseball followers the chance of seeing Hopkins represented on the \"diamond\" by as<br />\nTHE 'VARSITY BASEBALL TEAM.<br />\ngood a ball team as she is represented on<br />\nREATLY elated by the fine showing the lacrosse field by a good lacrosse team.<br />\nThe management hopes to secure the serof the baseball team of last season,<br />\nthe baseball enthusiasts are setting a vices of Mr. Adkins, who made so much of<br />\nmovement on foot for organizing a strong last year's team, for coach. It does not<br />\npropose to play a lot of petty teams, but<br />\nteam for the coming season.<br />\nConsidering the difficulty which last year's intends to schedule and play games that will<br />\nteam had of organizing and getting in the reflect credit on the team and on the Unifield, it deserves the praises of the student versity. All it asks is that it will be given<br />\nbody. Although it did not receive the sup- the support of the Athletic Association, and<br />\nport of the Athletic Association—a very de- of the students, and it will see that a creditplorable fact—the team was under the man- able team will be put into the field.<br />\nagement of those who went about it in the<br />\nright spirit, and was what may be called<br />\nMARSTONS, 17; JUNIORS, 5.<br />\nself-supporting.<br />\nThe Junior football team played their secWith the impetus given it last year, baseball promises this coming season, to be one ond game of the season last Wednesday<br />\nof the leading sports of the University. Pres- afternoon, October 26, when they were deent prospects indicate that this year's team feated by the Marstons team by a score of<br />\nwill be stronger in every respect than last 17 to 5.<br />\nOn the first kick-off, which was by Maryear's.<br />\nAmong the old players to be seen again ston, Revell carried the ball back to the<br />\nare Randall, Lyon, Brown and Boyd—all 30-yd. line. A few moments later the Juniors<br />\nmedical men—who made big sacrifices in lost the ball on downs. This was followed<br />\norder to accompany the team on its various by a series of line plunges by the Marston<br />\ntrips.<br />\nIn the collegiate department are team, which secured the first touchdown for<br />\nBowie, Goldman, Straughn and Baetjer, all Marstons.<br />\nvillage hostler and constable had his hands<br />\nfull, but finally cleared the field. Hopkins<br />\nthen left the field, and after they had disappeared Western Maryland recovered from<br />\ntheir sulkiness, and proceeded to run from<br />\ngoal to goal scoring imaginary touchdowns,<br />\nwhile their rooters shrieked with hysterical<br />\nglee. The referee, however, decided that<br />\nthe score should be 0-0.<br />\nConspicuous among the players deserving<br />\nmention are Blanck, Worthington, Carruthers and McDonald of Hopkins, and Myers<br />\nand Higgins of Western Maryland. The<br />\nline up was as follows:<br />\n<br />\nG<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nOn the second kick-off, Marston advanced<br />\nthe ball as far as the 40-yd. line, and followed this up with a 70-yd. run which netted<br />\na second touchdown for Marston.<br />\nIn the second half, the Juniors seemed<br />\nstronger than their opponents. Near the<br />\nmiddle of the half Marston secured her last<br />\ntouchdown. At this point, the Juniors took<br />\na decided brace; and,. with a sensational run<br />\nof 70 yards by Griffith, made their only score.<br />\nCrothers, at left tackle, did the best work<br />\nfor the Juniors. Others who did notable<br />\nwork for the Juniors were Mengel, Morse,<br />\nHack, and Zimmerman.<br />\nConsidering the little practice which the<br />\nJuniors have done so far, they put up a very<br />\ngood game. But, nevertheless, much hard<br />\npractice is necessary to get them in good<br />\nform for the class \"contest.\"<br />\n<br />\nDr. Renouf—The water supply of Baltimore is entirely unfit to drink.<br />\nStudent (anxiously)—I wonder what<br />\nabout Milwaukee's?<br />\n<br />\nY. M. C. A. MAIL.<br />\nOh, it's every day I wander,<br />\nTo the basement down below,<br />\nWhere the pigeon holes are many<br />\nIn the J. H. U. P. 0.;<br />\nOh, it's every day I wander,<br />\nBut forever and for aye,<br />\nCome my only, only letters,<br />\nFrom the Y. (why?) M. C. A.<br />\nMany cordial invitations,<br />\nDo these kindly missives bear.<br />\nSuch as \"Come and be a member,<br />\nJoin with us in evening prayer;\"<br />\nOr \"A Bible class is forming<br />\nUnder Mr. So and So,<br />\nYou'll perform an act of kindness,<br />\nIf you would but try and go.\"<br />\nAnd they've other invitations,<br />\nFormal bids to formal lunch,<br />\n(Tis too bad that at these functions<br />\nThey debar all Roman punch).<br />\nLarge receptions in the evening,<br />\n\"Evening dress is not the style,\"<br />\nAnd St. Andrew chapter meetings;<br />\n\"Just drop in a little while.\"<br />\n<br />\nThough these bids are very many,<br />\nWhich I get from day to day,<br />\nFour, or five, or six, or seven,<br />\nFrom the Y. (why?) M. C. A.;<br />\nYet another kind of bidding,<br />\nComing first in ones and twos,<br />\nThen increasing to the hundreds,<br />\n\"You will please to pay your dues.\"<br />\nSometimes think I that these people<br />\nAre not financiers a bit,<br />\nSpending fortunes out on paper,<br />\nGetting nothing back from it.<br />\nBut of course there are some members,<br />\nOne, or two, or mayhap, three,<br />\nWho do pay with great devotion,<br />\n(Oftimes one year out of three).<br />\nSurely bills would try a mortal<br />\nMuch more saintly than am I,<br />\nWhen they teem by tens of hundreds,<br />\nWhile I stand defenseless by;<br />\nThink you, I should view them calmly?<br />\nBills are bills, some people say,<br />\nTrue, with but one lone exception,<br />\nThat's the Y. (why?. M. C. A.<br />\nFirst, I used to like attention<br />\nFrom the Y. (why?) M. C. A.,<br />\nNow I do grow tired and tireder,<br />\nTired and more tired every day;<br />\nFor the way my box is crowded<br />\nFrom the bottom to the top,<br />\nMakes me ask the fatal question,<br />\nY. M. C. A won't you stop?<br />\nOh, it's every day I wander,<br />\nTo the basement down below,<br />\nWhere the pigeon holes are many<br />\nIn the J. H. U. P. 0.;<br />\nOh, it's every day I wander,<br />\nBut forever and for aye,<br />\nCome my only, only letters,<br />\nFrom the Y.(why?) M. C. A.<br />\n'06.<br />\nA youth went forth to serenade<br />\nThe lady he loved best,<br />\nAnd by her house at evening,<br />\nWhen the sun had gone to rest,<br />\nHe warbled until daylight<br />\nAnd would have warbled more,<br />\nBut morning light disclosed a sign<br />\n\"To Let\" upon the door.<br />\n—Exchange.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nPROGRESS IN THE ORIENTAL<br />\nSEMINARY.<br />\nThe work of the Oriental Seminary has<br />\nopened up this year most auspiciously.<br />\nAbout a dozen new students have taken up<br />\nwork in the Seminary viz., Mr. J. R. Gaar<br />\nof Dodson, La., A. B. of Westminster (Texas), College, 1901; Mr. 0. J. H. Preus of Decorah, Ia., A. B. of Luther College, 1901;<br />\nMr. Applestein, Mr. Bernstein, Mr. Bransky,<br />\nMr. Bloudheim, Mr. Potz, Mr. Ellison, Mr.<br />\nEdlavitch, Mr. Parelhoff, Mr. Pleet, etc.<br />\nThe impression is rapidly gaining more<br />\nand more ground that ancient history in the<br />\nlight of the important discoveries made in<br />\nWestern Asia and Egypt can be treated<br />\nauthoritatively only by an Orientalist, and<br />\ntherefore the number of historical students<br />\nwho avail themselves of Professor Johnston's course on the history of the Ancient<br />\nEast shows a gratifying increase.<br />\nIn accordance with its policy of not repeating certain definite courses in rotation<br />\nin a cycle of three or four years, as other<br />\ndepartments do, a number of entirely new<br />\ncourses has been begun in the Oriental Seminary. Professor Haupt interprets this year<br />\nthe Books of Ruth, Lamentations, and Esther<br />\nin the Old Testament Seminary. Professor<br />\nJohnston is giving n new course on the<br />\nfamous Babylonian Code of IIammurabi with<br />\nspecial reference to the corresponding legal<br />\nsections of the Old Testament. Dr. Blake,<br />\nin addition to his courses in Tagalog, the<br />\nprincipal dialect spoken in the Philippine<br />\nIslands, has for the first time begun a course<br />\nin Ilokan. Another innovation in the Seminary is Dr. Ember's course in Hebrew conversation, in which the German, Russian and<br />\nPolish method of pronunciation is used. As<br />\n90 per cent. of Jews at the present time use<br />\nthis so-called Ashkenazic pronunciation, this<br />\ncourse is important for practical purposes.<br />\nMr. Dennis, who spent last winter with<br />\nDr. Reissner assisting in and directing certain archeological excavations in Egypt, has<br />\nreturned to the University and will resume<br />\nhis work in Egyptology under the direction<br />\nof Professor Johnston.<br />\nProfessor Haupt has just published his<br />\nnew metrical translation of Ecclesiastes.<br />\nThis translation was read by the author at<br />\nthe second International Congress for the<br />\nHistory of Religions, held this summer at<br />\n<br />\n11<br />\n<br />\nBasle, and attracted a great deal of attention.<br />\nThe book is dedicated to President D. C.<br />\nGilman of the Carnegie Institute, whom the<br />\nauthor calls the creator of the First American University.<br />\n<br />\nLOCKE: THE MAN AND HIS WORK.<br />\nThe programme for the two hundredth<br />\nanniversary of the death of the philosopher,<br />\nJohn Locke, which was held in McCoy<br />\nHall, Johns Hopkins University, on Tuesday,<br />\nNovember 1, at 5 P. M., was as follows:<br />\n\"Locke's Philosophy and Psychology,\"<br />\nPrincipal C. Lloyd Morgan of Bristol, England, and Prof. F. J. E. Woodbridge, of<br />\nColumbia University.<br />\n\"Locke as a Physician,\" Dr. William Osier<br />\nof the Johns Hopkins Medical School.<br />\n\"Locke on Toleration,\" Prof. J. McBride<br />\nSterrett of George Washington University.<br />\n\"Locke's Political and Social Views,\" Dr.<br />\nWilliam T. Harris, United States Commissioner of Education.<br />\nProfessor J. Mark Baldwin, director of the<br />\ndepartment of psychology at Johns Hopkins,<br />\nwill make a brief introductory address as<br />\nthe presiding officer at the celebration.<br />\n<br />\nMRS. FRANKLIN LECTURES.<br />\nMrs. Christine Ladd Franklin delivered<br />\nthis week before the Psychological Seminary<br />\nof the Johns Hopkins University, her lecture<br />\nupon \"The New Concept of the Infinite,\"<br />\nwhich she recently presented in St. Louis<br />\nbefore the Congress of Arts and Sciences.<br />\nThe latter part of November Mrs. Franklin<br />\nwill begin in the department of philosophy<br />\nand psychology of the University a course<br />\nof lectures in logic and vision. Mrs. Franklin is a fellow of the University.<br />\n'07—The mathematical department has imported four hundred rabbits from Germany.<br />\n'08—And why?<br />\n'07—Merely because they multiply with<br />\nsuch rare celerity.<br />\n—Harvard Lampoon.<br />\nShe (indicating Police Station with her<br />\nindex finger)—And is that a dormitory, too?<br />\nHe—It's used for one in a pinch.<br />\n—Harvard Lampoon.<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nNOTES FROM OTHER COLLEGES.<br />\nDr. Dudley Allen Sargent, the well-known<br />\ndirector of Harvard's Hemenway Gymnasium, has just published an authoritative<br />\ntreatise on Physical Culture under the title<br />\nof \"Health, Strength and Power.\"<br />\nIn this work of 280 pages, Dr. Sargent<br />\nhas aimed to make physical training more<br />\npopular by devising a series of exercises<br />\nwhich require no apparatus whatever. It<br />\nis profusely illustrated with half-tone illustrations from original photographs furnished<br />\nby the author. At this time, when the benefits of outdoor living and breathing pure<br />\nair are being agitated, the simple exercsies,<br />\nwhen followed as here described, cannot but<br />\nbe found beneficial to the highest degree.<br />\nThe corporation committee on the retirement of professors has proposed a plan<br />\nwhereby professors over seventy years of<br />\nage who have been with Brown University<br />\ntwenty yeras or more shall be retired. The<br />\ndetails are not ready for publication, as the<br />\nplan must be submitted to the faculty, but<br />\nit may be said that the scheme is practically<br />\nthe same as that in vogue at Yale and other<br />\ninstitutions.<br />\nThe subject of dress reform is to the fore<br />\nat Princeton this year. It has been a fad<br />\nwith the undergraduate of late years to appear in the class room in the garb of a stone<br />\nbreaker, and of an impecunious stone breaker at that. Now certain upper-class men<br />\nhave decided that this habit is injurious to<br />\nthe reputation of the university and have<br />\nundertaken its reform with a fair prospect of<br />\nsuccess. Flannel shirts, overalls, brimless<br />\nhats have been tabooed and even the sweater<br />\nhas fallen under the ban.<br />\nThe latest West Point toast to the ladies<br />\nis:<br />\nOur arms your defense,<br />\nYour arms our recompense—<br />\nFall in!<br />\nThe rooters in leading eastern universities<br />\nare very chary of giving the cheer for individual players on the football field. When<br />\n<br />\nit is given it means something and is one<br />\nof the greatest honors that can be accorded<br />\na player. Oftentimes when a man makes<br />\na long gain the one who made the run possible deserves the cheer. Nice discriminations, then, must be made, and when three<br />\ncheers are given a man he knows he really<br />\ndeserved the ovation.<br />\nThe following are a few of the summaries<br />\nof the report of Professor Edwin G. Dexter<br />\nof the University of Illinois, who has been<br />\nconducting an extensive investigation of injuries received in college football.<br />\n1. About one college man in ten the<br />\ncountry over plays football.<br />\n2. About twice as large a proportion of<br />\nthe men in the small colleges play the game<br />\nas in the larger universities.<br />\n3. About one player in thirty-five is injured sufficiently each season to necessitate<br />\nloss of time from college duties.<br />\n4. The opinion of college officers regarding the value of the game is about 17 to 1<br />\nin its favor.<br />\nThese results are based on statistics furnished by the officers of sixty of the more<br />\nimportant colleges of the country. The figures cover the last ten years, during which<br />\nperiod of time, out of the number of 22,766<br />\nstudents playing the game 654 were injured<br />\nto such a degree that they lost time from<br />\ntheir classes. This is in the proportion of<br />\nless than 3 to every 100 players. Of the<br />\nserious injuries but eight were of a permanent nature. Three cases resulted fatally;<br />\ntwo of these were untrained men.<br />\nPresident Guy P. Benton, of Miami University, has expressed the following strong<br />\nopposition to football:<br />\n\"I recognise the fact that one college could<br />\nnot act alone. It would be dubbed a 'sissy'<br />\ninstitution. I should like to see the presidents of all colleges get together to abolish<br />\nfootball.<br />\n\"I favor athletics, and want boys to have<br />\na good time, but football is too hazardous<br />\nto be a justifiable college sport.\"<br />\nSeveral Miami football players were hurt<br />\nin a game at Columbus recently.<br />\n<br />\n\f\"<br />\n<br />\n1:44-011'ki?ED1iSilartalfT\"<br />\n<br />\n'DAS ri!ii oc.e.A.Ca<br />\n<br />\nn<br />\n<br />\n,e0<br />\n<br />\nTAILORING<br />\n<br />\n'We ha.v(arite Salenmeil.<br />\nWe have Expert Cutters,<br />\n421 N. I i()WAPI)<br />\n<br />\nWe have a Large Assortment of Mato.<br />\n<br />\n.<br />\nI:tc. at Poptailr Pricks.<br />\n<br />\nis,<br />\nAT POPULAR PRICES.<br />\n<br />\not $i.001)t.r Palr.<br />\n.111111•4•11111.4.11.<br />\n<br />\nCOLLEGE AND CLASS STATIONERY,<br />\n<br />\nB. Wcyforth & Sons,<br />\n<br />\nKlastli AND tietiNiCtUrfk CARDS.<br />\n<br />\n...Tailors...<br />\n<br />\nIDO1AL<br />\n<br />\ns.<br />\n<br />\nSTATIONER AND ENGRA.VER,<br />\n<br />\n217-219 North Pace Street.,<br />\n<br />\nBaltimore, Md.<br />\n<br />\nJ. IL-LICIJUAIRD NUNN.IL.etteo with C.'teehlrigig<br />\n<br />\n229 NORTH MMUS SWUM<br />\n4Ccb.<br />\n<br />\nNUNN & COMPANY,<br />\n--BOOKSELLERS .FIND S1ATIONERS227 NORTH HOWARD STREET, Between<br />\n<br />\nLexington<br />\n<br />\nand Saratoga Streets, BALTIMORE,MD.<br />\n<br />\nAll Text Hooks used at the Johns Hopkins University promptly supplied. Full line of Stationery, Note.Books,etc.<br />\nPAPER STAMPED WITII COLLEGE HEADING.<br />\nav.11.111•1111.<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nNew York to Bremen. London, Paris, Gibraltar, Naples. Genoa, etc.<br />\nBALTIMORE TO BREMEN ntREcT. •<br />\n419 S. Einnover St.<br />\n<br />\nror particulars apply to<br />\n<br />\nSFudio<br />\nCummins.<br />\n<br />\nil(jCIArritZ<br />\n<br />\nsuccessor to<br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington Street,<br />\n<br />\nA. SCHUMACHER & CO-, General Agents.<br />\nMICROSCOPIC SUPPLIES,<br />\n<br />\nMICROSCOPES,<br />\n<br />\nnissEcriNa<br />\n<br />\nRUBBER GLOVES,<br />\n<br />\nCASES,<br />\n<br />\nTHE CHARLES WILLKS SURG. INST. CO.,<br />\n<br />\nBALTIMORE.<br />\n<br />\n300 NORTH HOWARD STREET,<br />\n<br />\n#pecial Discount to Students.<br />\n<br />\nBALTIMORE. MARYLAND<br />\n<br />\nNNW<br />\n<br />\n. H. PETTING.<br />\n<br />\nE300K Si SECOND-HPENDI<br />\nSchool, Medical and Miscellaneous,<br />\nBought, Sold and Exchanged.<br />\n<br />\nManufecturer of<br />\n<br />\nGreek Letter Fraternity jewelry,<br />\n213 NORTH LIBERTY STREET.<br />\nBALTIMORE, MD.<br />\nPlean0 call and examine our line before purchasing.<br />\n<br />\nEliDERsotcs univcrsitvismt<br />\n<br />\nPIPPEN'S BOOK STORE<br />\nNEAR THE UNIVERSITY.<br />\n605 N. EUTAW<br />\nBALTIMORE'S LAROEST OLD BOOK STORE.<br />\nJ. V/.<br />\n<br />\nmatokantovir,<br />\n<br />\nWILIICUVI V. 1/./01141101-<br />\n<br />\nVli•NK<br />\n<br />\nST.<br />\nl<br />\n<br />\nOD,<br />\n<br />\nJ. 'N.- BREEDLOVE & CO.<br />\nMERCHANT TAILORS<br />\n<br />\nMADISON and HOWARD STS.<br />\n<br />\nSTYLISH GARMENTS FOR GENTLEMEN.<br />\n115 WEST SARATOGA ST. NEAR HOTEL RENNERT<br />\n<br />\nText Books, Note Books, Students' Supplies.<br />\n<br />\nBALTIMORE, MARYLAND.<br />\n<br />\nOOKS AND STATIONSRY<br />\nMiscellaneous Books<br />\nand Rare Editions.<br />\nWolters dies for the UNIVERSITY tind MEDICAL SCHOOL.<br />\n<br />\nTHE EICHELBERGER BOOK CO.<br />\nBOA Borth Charles Street.<br />\n<br />\n10 West Saratoga Street.<br />\n<br />\nSMITH'S BOOK STORE<br />\n805 N. HOWARD ST.,<br />\n:3rd door above Madison St.<br />\n<br />\nSCHOOL AND COLLEGE TEXT BOOKS<br />\nBOUGHT, SOLD AND EXCHANGED.<br />\n<br />\n\fNapalk Nimainvlipook vasillk•volikk<br />\n<br />\n'VOW'VOA NOW,1010u, NOOK 1.111\",<br />\n<br />\nTheft is aothing likc or colat<br />\nto a I rAAMIArr Solt for stgic<br />\n(oitAmt<br />\n<br />\n------ YOU MAY SEE —<br />\n<br />\nFownes Gloves<br />\n<br />\nHiN1N11 1?-1<br />\n<br />\non the man who doesn't<br />\nknow what's what—<br />\n<br />\nW. NAPA 1 06A S\" UPETT.<br />\nNolo,Wok *milk'WOW ‘111110, vino,'NOM VIM'IOW `mak'NOW NOM.<br />\nC. & P. Telephone 445-Y.<br />\n<br />\nyou're SURE to see<br />\nthem on the man who<br />\ndoes know<br />\n<br />\nJ 11. U. DINDRR.<br />\n<br />\nLibraries arranged and put in order without removal.<br />\n<br />\nPUZICKA<br />\nBookbinder,<br />\n609<br />\n<br />\nN 0 I?<br />\n<br />\nMOO BROS<br />\n18 West<br />\nLexInicton St.<br />\nBALTIMORE, MD.<br />\n<br />\nII<br />\n<br />\nL LI<br />\n<br />\n03 aim<br />\n>>r<br />\n0Z<br />\nZ6.)<br />\nri<br />\nfl;<br />\n<br />\nIX W<br />\n<br />\ns<br />\n<br />\nJohn S. Kerr<br />\nW. Parvie Ralph<br />\n<br />\n1.?<br />\n<br />\nr_ T.<br />\n<br />\nC. & P. Phone<br />\nMMIIIM10110111101.<br />\n<br />\nKERR & ROLPH<br />\nRepreenting Arthur Johnson & Co.,<br />\nNow York City.<br />\n<br />\nSporting Goods<br />\nand<br />\n<br />\nAthletic Supplies<br />\n304 PARK AVENUE,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n•••••••••••••••••••••••••••••••••••<br />\n<br />\nFOR ADVERTISING RATES<br />\nIN THIS PAPER,<br />\nADDRESS<br />\n<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n:<br />\n•<br />\n:<br />\n•<br />\n• WANTED :<br />\n•<br />\n••••••••••••••••••••••••••••••••••••••<br />\n<br />\nto<br />\n•<br />\n—ALUMNI 10 INSERTIDEIR BUSI•<br />\n.<br />\n•<br />\n•<br />\nAND PROFF.SSIONAL CARDS<br />\nNESS<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\nIN THE NEWS-LETTER.<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n••••••••••••••••••••••••••••••••••••••••<br />\n<br />\nTHE<br />\nNEWS-LETTER,<br />\nJohns Hopkins University,<br />\nBALTIMORE.<br />\n<br />\nf<br />\n<br />\nv•••••*•••••••*••••••••*•••••••••••*<br />\n<br />\n\f", "format": "basic_html", "processed": "annarezna.<br /><br />\n%nom<br /><br />\nTHE•JOHNS-HOFKINS•UNIVERSITY<br />\nBALTIMORE<br /><br />\nA<br /><br />\nThe News-Letter<br />\nVol. IX.<br /><br />\nFortnightly.<br /><br />\nNo.<br /><br />\n2<br /><br />\nReminiscences of Hopkins Athletics.<br />\nN the last number of the I\\Nws-LETTp:R,<br />\nmention was made of an article on football. I feel that an apology is due at the<br />\nstart from one who knows nothing of the<br />\ngame, whose recollections are therefore<br />\nvague. The few data given were kindly<br />\nfurnished by Prof. Paul Dashiell of the Naval<br />\nAcademy, who played on the team in '86,<br />\nwas captain in '87 and '88, and was at the<br />\nsame time our leader ih baseball and in athletics generally. He is well known to all<br />\nfootball players as expert and umpire. I<br />\nhad hoped to give some data of the game<br />\nin the '90s, but the information requested<br />\nhas not reached me.<br />\nAmong the players on Dashiell'a team<br />\nand shortly afterwards, were George<br />\nMorrison, now a rising lawyer here,<br />\nWyatt Randall, formerly associate in<br />\nthe University, Stuart Symington, Professor<br />\nat Amherst, Horace Burrough, now in business here, the Willoughby brothers, one of<br />\nwhom is Professor in the University, the<br />\nother Treasurer of Porto Rico, Charles<br />\nCoates, Professor at Tulane University, and<br />\nCharles Herty, Professor at the University<br />\nof Georgia.<br />\nHopkins teams were never heavy teams,<br />\nthe average weight of the men being about<br />\n155 lbs. In those days there was no medical<br />\nschool; the players were undergraduates or<br />\ngraduate students who were mostly Hopkins<br />\nB. A.'s ; they had grown up together and<br />\ntried from their Freshman year to make the<br />\nteam; it was a home combination; hence<br />\nthere was the same spirit of friendship and<br />\ncomradeship, the same subordination of individual interest to team interest, which has<br />\nin late years been the noticeable characteristic of our lacrosse teams. Our undergraduates are generally light men, hence the difficulty of getting an undergraduate team in<br />\nthese days when weight is so important.<br />\nFormerly heavy teams were not as common,<br />\nand we could encounter with hope of success<br />\nthe players of institutions whose present<br /><br />\nI<br /><br />\nteams would outclass any undergraduate<br />\nteam we could get together, as the following<br />\ndata show.<br />\nWe played the Naval Academy every year.<br />\nThey usually won, but in the year '88 (or<br />\n'87) we beat them. We played the University of Virginia for the first time in '88;<br />\nscore 16 to 0 in favor of Hophins. In the<br />\nsame year we played the University of Pennsylvania; they won by the score of 22 to 12.<br />\nThe chief features of the game as I recall<br />\nit were the crumpling of the Hopkins line<br />\nby Penn's giant heavy weight, Wagenhurst,<br />\nand the skill of Dashiell and his light team.<br />\nThe only game with Princeton which Prof.<br />\nDashiell remembers was in '86, Princeton<br />\nwon; score 104 to 01 Something to remember; we have not played Princeton since,<br />\nI think. St. John's was always a rival, and<br />\nthe games were close. We played Gallaudet, Western Maryland, and, I think, Maryland Agricultural every year.<br />\nOf the players in the '90s I chiefly recall<br />\nStuart Janney, who captained the team and<br />\nwas an all-round athlete, taking the leading<br />\nplace in his day that Dashiell had held previuosly. Mr. Janney is now practicing law<br />\nin Baltimore and is the present alumni delegate to the Athletic Board.<br />\nThe conditions then were so different from<br />\nthe present conditions, that a sketch of them<br />\nmay be novel to most of the readers of the<br />\n1\\11,vs-LETTER. There was no cage, and practice for games was at Druid Hill Park on<br />\nthe field now used for lacrosse practice.<br />\nThough we had no cage, we had a beautiful<br />\nathletic field of our own. Clifton, the country place of Mr. Johns Hopkins, since bought<br />\nby the city as Clifton Park, was then owned<br />\nby the University. The trustees had drained.<br />\nlevelled and sodded a large field close to<br />\nthe Hopkins Mansion. A room in the latter<br />\nwas fitted up with lockers Its dressing room.<br />\nThere was no grand stand, but a broad<br />\ngrassy terrace a few feet higher than the<br />\nfield and shaded by fine trees served the<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\npurpose; settees and chairs from the house<br />\nwere brought out for those who wished them<br />\nbut the students and most of the other spectators stood or sat on the grass. Athletics<br />\nin this field made a lovely picture; the perfectly levelled field with the uniformed<br />\nteams, the bright dresses of the ladies on<br />\nthe green terrace against the background of<br />\ngiant pines and cedars, the view bounded on<br />\nevery side by masses of foliage, nothing dirty<br />\nin sight. It was beautiful but there were<br />\ndrawbacks. We could collect gate-money at<br />\nthe western entrance to the grounds, but<br />\nfrom the rear anyone could enter, and many<br />\nthrifty souls preferred the rear entrance.<br />\nHence gate-moneys were small. Then the<br />\ndistance from the University! I suppose it<br />\nis about the same distance now, but rapid<br />\ntransit annihilates distance, and this was before the days of rapid transit. horse cars<br />\nmeandered through Baltimore Street and<br />\nfound their way out the Harford Road as<br />\nfar as a brewery; there they stopped, and<br />\nthere was a quarter-mile of dust or mud to<br />\ntramp through to the grounds. The correct<br />\nthing was to take a seat in one of the omnibuses hired by the Athletic Association on<br />\nspeculation—sometimes a losing speculation.<br />\nThe 'buses lined up on 'Toward Street in<br />\nfront of the gym. at 2 P. M. The teams<br />\nwere in the big 'bus in the van, the spectators<br />\nfollowing in smaller 'buses; with banners<br />\nwaving, college yells resounding, the procession slowly rambled out Charles Street,<br />\nNorth Avenue and the Harford Road to the<br />\ngrounds, taking an hour or more for the<br />\ntrip. The 'buses were slow, but the students<br />\nwere not. They enjoyed every dusty moment; friends and strangers were greeted<br />\nimpartially; the chief rooter was busy; one<br />\ncould hear him roar \"What's the matter<br />\nwith the girl in the blue dress?\" and the<br />\nanswering chorus \"She's all right.\" The<br />\ngirls in blue or any other color seemed to<br />\nenjoy it—it was a break in the quiet of the<br />\nstreets—for Baltimore streets were quiet<br />\nthen; it was before they were made a roaring<br />\npandemonium by the electric cars.<br />\nThere were no locker-rents then to maintain athletics. The Athletic Association was<br />\na body of students numbering 80 or 90 who<br />\npaid $2.00 each per year. The necessary<br />\nbalance was raised by passing the hat—<br />\namong the faculty mostly. It began in the<br /><br />\nfall when the football team made the first<br />\ntouch. Towards Spring there was a generous rivalry between the baseball and lacrosse<br />\nteams as to which should get at the faculty<br />\nfirst. It was an old custom in most colleges<br />\nthat the faculty should have the perennial<br />\nprivilege of helping the boys out, yet the<br />\nteam emissaries were not always received<br />\nwith enthusiasm. There were artists among<br />\nthem, however, who had a magic touch, chief<br />\nof whom was IIerty, a very genial man; it<br />\nwas believed that no one could resist his<br />\nblandishments; some of his friends were so<br />\nimpressed with his ability in this line, that<br />\nthey declared the University missed the<br />\nchance of its life in not electing him President.<br />\nOur finances were on a precarious footing<br />\nat best. Yet we ran the teams. The players<br />\nhelped by paying their own petty expenses,<br />\noften buying their own uniforms. Expenses<br />\nwere far below the present standard; paid<br />\ncoaches, trainers and rubbers were unknown.<br />\nOld players coached without pay. Jim, the<br />\ngymnasium janitor, was rubber, students assisting if needed.<br />\nThe spirit of self help and mutual help in<br />\nthose days was admirable. The weak point<br />\nin the situation was the begging for funds,<br />\nwhich was unavoidable. This came to an<br />\nend when the new gymnasium and the cage<br />\nwere built with considerable cost to the<br />\nUniversity at a time when the University was<br />\nsuffering from a depreciation in value of investments. It is the custom in many of the<br />\nlarger colleges to charge a gymnasium lockerrent, which pays or helps to pay the expenses<br />\nof the gymnasium; the University authorities<br />\ndecided to adopt this plan in the new gymnasium, but the student body requested that<br />\nthe locker-rents should be given to the Athletic Association to defray the expense for<br />\nthe athletics, promising that no further assistance should be asked of the faculty or<br />\nalumni. The Board of Trustees granted this<br />\nrequest. The directors of the Athletic Association know about what sum they can<br />\ncount on in a given year, and have never exceeded it.<br />\nIn closing, I wish to add a few words on<br />\nwhat appear to an older man dangers in the<br />\nathletic system of the present day. I am<br />\nnot referring to Hopkins conditions, which<br />\nfor obvious reasons are exceptional, but to<br /><br />\nTHE NEWS-LETTER.<br />\nthe conditions prevailing in many large colleges.<br />\nAn idea seems to be gaining ground among<br />\nAmerican students that a man who plays<br />\non a team gives something to his fellow students which it is their duty to pay for; that<br />\nhe not only should receive reward in athletic<br />\nhonors, in medals or in costly trophies, but<br />\nshould have his personal expenses paid in<br />\ngreater or less degree, still feeling magnanimous in that he has \"given\" his time. Is<br />\nthis a sportsmanlike spirit? It introduces<br />\nthe idea of payment for service rendered;<br />\nis it not rather a step in the direction of the<br />\nspirit of the hired gladiator? The teams of the<br />\ngreat. athletic colleges with their enormous<br />\nrevenues and lavish expenditure have set a<br />\nstandard which has affected every college<br />\nin the country, and which seems to me a<br />\nmenace to a healthy athletic spirit. Men<br />\nnow are doubtless better trained, but I regret<br />\nthe old simple days when college athletics<br />\nwere less business and more sport.<br />\nAnother danger is the advent of students<br />\nwhose chief or only interest in college is athletics. I gave the present standing of the<br />\nold football players whom I remember, with<br />\na purpose. I wished to show you that they<br />\nhad become men of mark. Everyone of these<br />\nmen ranked high as scholars, some exceptionally high. They were fine athletes because<br />\nthey were men who would not undertake<br />\na thing unless they could do it well. Athletics to them was sport for leisure hours,<br />\nnot a thing foremost in their minds.<br />\nIt is a good trait of our people to strive<br />\nto attain the highest excellence in whatever<br />\nthey undertake, but students should remember that colleges, if they fulfil their purpose,<br />\nprepare them for their life-work. Few wish<br />\nto make athletics their life-work, many find<br />\nit a pleasant mode of frittering away three<br />\nor four years of their life.<br /><br />\nEDWARD RENOUlt.<br />\nLittle Willie died last night,<br />\nHis face we'11 see no more;<br />\nFor what he thought was 1-1 2 0<br />\nWas H 2 S 0 4.<br />\n—Collegian.<br />\n\"Why did the color run on my shirt?\"<br />\n\"I guess it was afraid to dye.\"<br />\n—Harvard Lampoon.<br /><br />\n3<br /><br />\nTHE FIRST FEED OF THE<br />\nHULLABALOO CLUB.<br />\nThe Hullabaloo Club of the Johns Hopkins<br />\nUniversity was founded in 1903 by the members of that year's Senior Class. Its object,<br />\nas set forth by its founders, was to promote<br />\ngood fellow-ship among the members of the<br />\nSenior class. .In the two years of the existence of the organization, it has ably fulfilled<br />\nthe purpose of its founders, and in its<br />\n\"feeds\" there has been shown an enthusiasm<br />\nand class spirit which has not often had a<br />\nchance to show itself elsewhere. Last year<br />\nthe Club held a series of field nights which<br />\nproved very popular, and attracted almost<br />\nthe whole Senior class. This year the Board<br />\nof Governors has planned to have a smoker<br />\nand \"feed\" on the first Friday of each<br />\nmonth, the subscription for each being 50<br />\ncents. The Johns Hopkins Club has given<br />\npermission to the Board to use its rooms<br />\nfor the celebrations, and, for the present at<br />\nleast, they will be held there.<br />\nThe Club will hold its first \"feed\" in the<br />\nJohns IIopkins Club's rooms on Friday, November 4th.<br />\nThe ceremonies will begin<br />\nat 8.30. Every effort has been made to<br />\nmake the evening a success, and it is expected that every member of the Senior class<br />\nwill be present. Everyone certainly ought<br />\nto turn out on occasions like this. There is<br />\nno better way of getting really to know the<br />\nmembers of one's class, and besides, the<br />\nbigger the crowd, the faster and \"furiouser\"<br />\nthe fun will be, the greater the enthusiasm<br />\nand noise, and the better the general good<br />\ntime all round. And after all, when you<br />\ncome to think of it, such occasions are almost the only times when our classes can<br />\nget together and see something of the fascination of that careless atmosphere of smoke<br />\nand song which forms part of what is called,<br />\nin other Universities, college life. When our<br />\nclasses do have a chance to get together, no<br />\none can afford to be absent from the gathering. The Hullabaloo Board is going to make<br />\nsuch chances more frequent in future, and<br />\nif the present feed is successful, the first<br />\nof each month will see another of the same<br />\nkind.<br />\nSo far as providing the actual \"feed\" for<br />\nFriday night goes, the Committee has done<br />\neverything to supply enough for all, and a<br />\nvariety of everything. There will be all<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br /><br />\nkinds of refreshments—liquids guaranteed If experienced men would join the club and<br />\nto satisfy the cravings of every political play in the tournaments, within a year or<br />\nparty that is now represented in the Senate; two, the choice of a Hopkins representative<br />\nsolids, fresh from the ovens of the National in an intercollegiate match would be a hard<br />\nBiscuit Co., and refreshments of the vapor- one because of the number of first-class playous variety, for which the material will be ers that would be available. The members<br />\nsupplied in such profusion that anyone who are always willing to teach new men and<br />\ncan see across the room ten minutes after to coach promising players. The duties are<br />\nthings are started, will be given back his not onerous, the dues not burdensome. As<br />\nThere will be a rule the playing of a match-game is open<br />\nsubscription at the door.<br />\ngood Hopkins songs such as we hear too to the convenience of the players. The deseldom, and good popular songs, which will mand on one's time is not at all severe, and<br />\nsound better than ever before; yells which the good resulting to the members is subwill stir the sluggish blood of the graduates stantial.<br />\nThe club will hold a preliminary meeting,<br />\nin neighboring rooms, and in short, such<br />\na rousing good time as the members of the early in the year, and hopes that the faculty.<br />\nclass of 1905 have seldom had together, and graduate students, seniors, juniors, and especially the in-coming freshmen will take<br />\ncannot afford to miss.<br />\nan interest in the royal game, and hand their<br />\nnames to J. F. Cremen, the secretary of the<br />\nTHE CHESS CLUB.<br />\n1905.<br />\nClub.<br />\nT the Hopkins there has been a chess<br />\nBut there has been no continued and<br />\nMUSICAL CLUBS.<br />\nclub of some kind for esveral years.<br />\nstudents<br />\nWith<br />\nthe commencement of work at the<br />\nenthusiastic interest shown by<br />\nfor<br />\nUniversity, the Musical Clubs begin what,<br />\nwhich would enable the club to flourish<br />\nany length of time. Now, however, there it is hoped will be the most successful year<br />\nof their existence. Already a large number<br />\nneed be no lack of interest in the game;<br />\nof candidates have applied, but, judging<br />\nand<br />\nplace to play has been secured, boards<br />\ncan<br />\nfrom<br />\nthe size of the Freshman class, there<br />\nchessmen are always at hand, instruction<br />\nbasis<br />\nmust<br />\nbe a great many others who play or<br />\nbe easily gained—and, above all, the<br />\nsing,<br />\nwho have given no intimation of<br />\nbut<br />\nof a live club has been made.<br />\nit.<br />\nwas<br />\nLast year, a revival of chess-playing<br />\nThe great need of the Clubs is guitars and<br />\nattempted at the University. A gratifying<br />\nof<br />\non the instrumental clubs, and first<br />\nefforts<br />\nbanjos<br />\nnumber of men responded to the<br />\ntenors<br />\na<br />\nin<br />\nand<br />\nthe Glee Club. The guitar is an<br />\nthose interested in forming a club;<br />\nmatch<br />\nA<br />\nimportant<br />\ninstrument and the man who<br />\nvery good season was the result.<br />\nViron<br />\nplays<br />\nis sure to be taken on the difit<br />\nof<br />\nwas arranged with the University<br />\nBlack<br />\nferent<br />\nthe<br />\ntrips,<br />\npartly because of this fact, and<br />\nginia Chess Club, and, although<br />\nand Blue lost, it was not without ad- partly because he will play on two clubs,<br />\nvantage, and this step has opened the the Mandolin and the Banjo.<br />\nAll the Clubs promise to be up to their<br />\nway for an annual contest. A very<br />\nusual<br />\nhigh standard. The Glee Club has<br />\nsuccessful tournament was also held in<br />\nengaged<br />\nMr. A. L. Holloway as instructor,<br />\nLevering Hall, and all the members<br />\nand<br />\nwith<br />\nhis aid has made great progress.<br />\nwith<br />\nexpressed themselves highly satisfied<br />\nA<br />\nnumber<br />\nof last year's men are back, and,<br />\nthe result. The last, but not least enjoyable<br />\nhence,<br />\nthere<br />\nhas been little difficulty in workevent of the year was a \"chess evening.\"<br />\nDr. Morley and Mr. Liddell played simul- ing up \"Jemima's Piano\" and \"Jencks's<br />\ntaneous games against the members. The Vegetable Compound,\" both of which pieces<br />\nevening passed pleasantly, many old students were sung last year. At present, Mr. Ruth,<br />\nthe leader, is collecting popular songs for a<br />\nbeing present to watch the games.<br />\nThis year the club wishes to claim more medley. He has also an old English song,<br />\nattention from the student-body. The train- \"A Franklyn'a Dogge Leped Over a Style,\"<br />\ning and pleasure derived from playing chess which promises to have some excellent harare too well-known to need mention here. mony.<br /><br />\nF.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n5<br />\n—<br /><br />\n• The prospects for the Mandolin Club are<br />\nvery promising. A number of candidates<br />\nhave come forward, so that, with the old<br />\nmen, the Club will consist of about thirty.<br />\nOf the candidates, however, only two are<br />\nFreshmen. This is a poor showing, especially when one considers that next year and<br />\nthe year after they will have to help make<br />\nup the Club. So far, only one man has<br />\noffered to play the guitar. This is unfortunate, as it forces both Mandolin and Banjo<br />\nClubs to depend on men who have left the<br />\nUniversity, and who are unable, consequently, to come to rehearsals.<br />\nThe Banjo Club, under Mr. Marshall, who<br />\nled it several years ago, should be very good.<br />\nAs in former years, it has started out badly,<br />\nbut it will probably improve a great deal as<br />\nsoon as more banjos and guitars can be<br />\nfound.<br />\nSo much for the Clubs, now for the trips.<br />\nTwo long trips are taken each year. This<br />\nyear they will probably be to the Eastern<br />\nShore and to northern and eastern Virginia,<br />\nalthough it has not been decided yet which<br />\nwill be taken at Christmas and which at<br />\nEaster. Another trip is the one to National<br />\nPark Seminary. This is so popular that a<br />\ngreat many men come to practice just to be<br />\nable to go on it. Then there is the Hannah<br />\nMore trip. On this the men always have<br />\nan enjoyable evening with the girls, and<br />\ncome home with trophies of various kinds,<br />\nsuch as handkerchiefs, etc. The Catonsville<br />\ntrip is popular, too. Besides these there are<br />\na number of other concerts where the men<br />\nhave a little recreation singing \"The Little<br />\nOld Red Shawl,\" \"I've Been Working On<br />\nThe Railroad,\" \"Mona,\" etc., and where<br />\nMr. Bristol brings the house down with his<br />\n\"0-0-0-oo-O'Brien\" and the story about the<br />\nman who fell to the ground \"peachless.\"<br />\nAltogether the men pass a very pleasant year<br />\nand are sorry when it is over.<br /><br />\nW. WATURS PAGON.<br /><br />\nUNDERGRADUATE NOTES.<br />\nThe Freshman class has elected the following permanent officers:—<br />\nPresident—G. Pitts Raleigh.<br />\nVice-President—W ii. Iglehart.<br />\nSecretary—Albert Grauer.<br />\n- Treasurer—George A Stewart.<br />\nHistorian—M. S. Caples.<br />\nSergeant at Arms—L. W. Pierce.<br />\nThe Senate has been organized by the<br />\nSenior class. The election resulted as follows:—<br />\nPresident—Francis Morris Miller.<br />\nClerk—J. Earle Mifflin.<br />\nSergeant at Arms—H. V. Morse.<br />\nThe Chess Club will re-organize this week<br />\nfor the work of the year. The Club expects<br />\nto arrange some good matches with other<br />\norganizations ,and the indications are that<br />\nsomething will be doing this year in the<br />\n\"sport of kings.\" Here's success to the<br />\nChess Club!<br /><br />\nEXPLAINED.<br />\nSaw I once the queerest chickens<br />\nWhich have ever been;<br />\nFeathers red, and gold, and crimson,<br />\nYellow, purple green.<br />\nAsking how the colors got there,<br />\nThis is what I heard;<br />\n\"They were hatched out by a rooster,<br />\nSo each one's a son-set bird.\"<br />\n'06,<br /><br />\nA POINT AT LAW.<br />\n\"It is a case of murder,\"<br />\nThe prosecutor said;<br />\n\"And so I ask the jury<br />\nTo hang him till he's dead.\"<br /><br />\nThe Glee Club's trainer is very appropriately named Prof. Holl(er)away.<br /><br />\nDefendant did not like this.<br />\nSo persuasive was his tongue,<br />\nThat he did not get convicted;<br />\nAnd the jury—it was hung.<br /><br />\nJapanese Soldier (sharpening his sword)<br />\n—\"Blessed are the piece-makers, for they<br />\nshall inherit Manchuria.\"<br /><br />\nJohn—What shape is a kiss?<br />\nJack—A-lip-tickle.<br />\n—McGill Outlook.<br /><br />\n'06.<br /><br />\nTHE NEWS-LETTER.<br />\n=,<br /><br />\nhe llews•letter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINs UNwERsITY.<br /><br />\nNOVEMBER 4, 1904.<br /><br />\nSubscription $1.50 per year.<br /><br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br /><br />\n10 Cents a single copy.<br /><br />\nHAR1AON V. MonsE,<br />\nTHOMAS OWINGS,<br />\nORMOND W. HAMMOND,<br />\n{H. FINDLAY FRENCH,<br /><br />\n1905.<br />\n1805.<br />\n1906.<br />\n1906.<br /><br />\nW. R. STRATTOHN,<br />\n{E. LELAND SHACKELFORD,<br />\nBusiness Manager,<br />\nG. WOLTERECK,<br />\nAssistant Business Manager,<br />\nCARLYLE BARTON,<br /><br />\n1005.<br />\n1906.<br />\n1905.<br />\n1906<br /><br />\nAssistant News Editors<br />\nAthletic Editors,<br /><br />\nAddress all articles, communications, etc., to HARMON V.<br />\nMown, box 431, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\n0. Wourinticos:, box 677, J. H. U.<br /><br />\nEDITORIAL.<br />\nSome comment has been heard upon the<br />\nsmall but very select number of students<br />\npresent at the football game with St. Mary's<br />\ntwo weeks ago. Some students expressed<br />\nthe feeling that fifty cents was too much to<br />\npay to see a game with such a team as St.<br />\nMary's.<br />\nNot long ago, in talking with a prominent<br />\nmember of the Athletic Board who opposed<br />\nhaving baseball and football teams under<br />\nthe present conditions, he expressed the following opinion in support of his view: \"The<br />\nundergraduate body at Hopkins has the<br />\nworst reputation of any such body in this<br />\ncountry when it comes to going to games<br />\nand to 'rooting' the teams on to victory.\"<br />\nNot having definite information on the<br />\nsubject, this statement could not be refuted.<br />\nAnd yet the NEWS-LETTER believes that, after<br />\nall, part of this fault lies with the management of the teams. What the NEWS-LETTER<br />\nmeans is this: we believe that fifty cents is<br />\na price which keeps many students away who<br />\nwould otherwise be glad to go to the majority of the games. Making the price, say<br />\ntwenty-five cents for students only, we think,<br />\nwould be money in the hands of the<br />\nmanagement. If there was a large and enthusiastic body of students at each game to<br />\n\"whoop things up\" so to speak, there would<br /><br />\nundoubtedly be a larger crowd of outsiders<br />\npresent, for the simple reason that if the<br />\nstudents themselves are enthusiastic over<br />\ntheir teams, others will also take a more<br />\nlively interest in Hopkins.<br />\nIn suggesting the advisability of the various athletic teams of the University making<br />\nspecial rates of admission to games for students, we believe we are simply voicing a<br />\nfeeling that has long been felt if not expressed. We are convinced that not only<br />\nwould such a procedure be a great relief to<br />\nloyal supporters of the teams, but would<br />\nalso be a source of increased revenue to the<br />\nAthletic Association.<br />\nOf course this is all conjecture as to the<br />\nfinal results. But judging from the results<br />\nat other colleges, which have special rates<br />\nfor students, the same plan should be successful here. The plan of offering season tickets<br />\nat a reduced rate last spring was a step in<br />\nthe right direction, but it was not enough.<br />\nFew students will buy a season ticket. On<br />\nthe other hand the NEWS-LETTER thinks most<br />\nstudents would go if the price were twentyfive cents. At any rate the NEWS-LETTER<br />\noffers this as a suggestion to the management<br />\nwith the hope that it will be tried several<br />\ntimes to see whether it is a successful or an<br />\nunsuccessful plan.<br />\nIn a letter to the \"News\" last week, Mr.<br />\nRichard H. Pleasants, of the Baltimore bar,<br />\nmade the suggestion that the city should<br />\npurchase the present buildings of the University for the use of its various free schools.<br />\nHe gave several reasons for thinking that<br />\nsuch an action would be desirable, among<br />\nwhich were the following:<br />\nIt would give the University the nucleus<br />\nof a fund for the erection of new buildings<br />\non our grounds at IIomewood.<br />\nIt would provide homes for the Polytechnic Institute, the Maryland Institute and a<br />\nfinely located public hall for educational<br />\ngatherings.<br />\nMr. Keyser, President of the Board of<br />\nTrustees of the University, said when told of<br />\nMr. Pleasant's suggestion, that the University was not trying to sell its buildings at<br />\nthe present time, but that if the city should<br />\nrenew the offer at any future time when the<br />\nUniversity was about to move to Homewood,<br />\nit would certainly be favorably considered.<br /><br />\n1<br /><br />\n7<br /><br />\nTHE NEWS-LETTER.<br />\nThe group of buildings would naturally be<br />\nbest adapted for educational purposes and<br />\nwould be what is needed for the use of the<br />\nMaryland and of the Polytechnic Institutes.<br />\nPresident Remsen confirmed what Mr.<br />\nKeyser said on the subject, and there seems<br />\nto be little chance that the subject will come<br />\nup again until the University is moving to<br />\nthe country, when such a disposition of the<br />\nbuildings would probably be advantageous<br />\nto both sides. The sale of the six buildings<br />\nshould bring the University quite a large<br />\namount, which would probably come in very<br />\nuseful for the erection of new buildings at<br />\nHomewood.<br />\nTo the NEWS-LETTER:<br />\nNot for a number of years has such lively<br />\ninterest been evidenced at Hopkins as is<br />\ntoday in athletic sports. There is a general<br />\nfeeling among the students that Hopkins<br />\nmust be represented not only on the lacrosse<br />\nfield, but on the gridiron, the oval and the<br />\ndiamond, too. When the football team was<br />\nrecognized a few weeks ago it was a step in<br />\nthe right direction; but it was only brought<br />\nabout by the students insisting that the members of the Athletic Board, as their representative, take this action. These same men<br />\nare DOW clamoring for a baseball team, saying that if the \"prep\" schools and small<br />\ncolleges can be represented by teams playing<br />\nthe national game, what, then, is the matter<br />\nwith Hopkins? This early in the year we<br />\nare told, and by men who ,know, that there<br />\nare over 25 men, the majority of whom<br />\nhave been stars in other University teams,<br />\nand who are ready and anxious to represent<br />\nHopkins on the diamond next Spring. These<br />\nmen have pledged themselves to play, the<br />\nstudents want a team, and the Ahtletic Association, as the representative body of the<br />\nstudents, should act promptly. If the Athletic Association carries out the will of the<br />\nstudent body, the University will have a<br />\nbaseball team next Spring.<br />\nGrad.<br /><br />\npresent at the meeting and consulted with<br />\nan advisory Board consisting of Mr. Frederick Law Olmstead, the celebrated landscape architect, who has charge of the development of the Homewood grounds; Mr.<br />\nWalter Cook; and Mr. J. B. Noel Wyatt, of<br />\nthis city.<br />\nFive architectural firms were asked to submit designs; they were: Peabody &amp; Sterns,<br />\nof Boston, Carrere &amp; Hastings, of New York.<br />\nW. H. Boring, of New York, Parker &amp;<br />\nThomas, of Baltimore, and Baldwin &amp; Pennington, also of this city. The ones decided<br />\nto be best will possibly be requested to proceed with the work of construction. No<br />\npublic statement about the outcome of the<br />\ncompetition will be made until the findings<br />\nof the advisory Board are submitted to the<br />\nUniversity trustees.<br />\n11111111111MME111<br /><br />\nJOHN MARSHALL CHEW.<br />\nWhereas, it has pleased Almighty God,<br />\nin His infinite wisdom, to remove from our<br />\nmidst our class-mate, John Marshall Chew,<br />\nbe it<br />\nResolved, that we, the members of the<br />\nClass of Nineteen Hundred and Seven, extend our heart-felt sympathy to his family<br />\nin this, their great bereavement<br />\nAnd be it further resolved, that a copy<br />\nof these resolutions be sent to his family<br />\nand also published in the NEWS-LETTER and<br />\nin the year-book of the Class of Nineteen<br />\nHundred and Seven.<br />\nRICHARD MAC SHERRY,<br />\nCHARLES F. PIETSCH,<br />\nHENRY P. HYNSON, JR.,<br />\nMIIIMIIIIIIM11111<br /><br />\nDR. OSLER TO ADDRESS DOCTORS.<br /><br />\nDr. William Osier was the principal<br />\nspeaker at the regular meeting of the Laennec, a society of physicians organized for the<br />\nstudy of tuberculosis, held in the medical amphitheatre of the Johns Hopkins Hospital on Thursday night. \"Acute TuberThe first meeting to consider plans for the cular Pnecmonia\" was the general subject<br />\ndevelopment of Homewood took place on for the meeting, and Dr. Osier discussed<br />\nThursday of last week, and sketches were the clinical features of the disease. The<br />\nsubmitted to the Board by five architectural pathological side of the subject was taken<br />\nfirms. Dr. Remsen and Mr. Keyser were up by Dr. W. G. MacCullum.<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nHOPKINS, 0; U. M., 0.<br />\nBacked by about twenty-five or thirty enthusiastic rooters, the 'Varsity foottball team<br />\nwent to Westminster, Saturday, October 29,<br />\nand played a peculiarly interesting game<br />\nwith Western Maryland College. Despite<br />\nthe rocky and undulating cornfield on which<br />\nthe game was played, and which bore no<br />\ntrace of ever having been marked off, our<br />\nmen put up a creditable showing. The team<br />\narrived at Westminster about noon, and at<br />\n2.30 started down the half-mile cow-path,<br />\nwhich led from the dressing room to the<br />\nfield. Western Maryland won the kick-off,<br />\nand sent the pigskin through a number of<br />\nerratic evolutions for the distance of about<br />\nten feet. Hopkins fumbled on the catch and<br />\nthe ball went to Western Maryland for the<br />\nfirst down. Hopkins held them for downs<br />\nand recovered the ball.<br />\nAbout this time the much talked of Roberts, Western Maryland's fullback, received<br />\nthe greater part of Blanck's knee in the<br />\nregions of his dinner. The Western<br />\nMaryland rooters began to grow restless and despite the noble efforts of their<br />\nleader (whose voice, by the way, was only<br />\nharmonious when quiet), their songs lapsed<br />\ninto a nursery whine of dissatisfaction. This<br />\nwhine increased as the game proceeded. It<br />\nwas almost impossible for the referee to<br />\njudge downs on the unmarked field. Consequently it was necessary for the line-keepers<br />\nto carry the line across the field at every<br />\ndown, to satisfy our opponents that they<br />\nwere not being cheated. At the Western<br />\nMaryland fifteen-yard line, Blanck, who was<br />\ntaking the ball around left-end for a touchdown, severely wrenched his ankle on one of<br />\nthe many small bowlders which were inter-<br /><br />\nspersed with the corn stubble, and in falling<br />\nhe lost the ball. By a series of clever plays<br />\nWestern Maryland worked the ball up to<br />\nHopkins five-yard line, when time was called.<br />\nHopkins had the kick-off in the second<br />\nhalf, and were about to line up, when there<br />\narose a difficulty which taxed the combined<br />\nmathematical abilities of umpire and referee<br />\nto settle. The faint line, which before the<br />\ngame fixed the centre of the field, had faded<br />\ninto the \"heterogeneity\" of the ground. The<br />\nonly other line on the field was behind our<br />\ngoal posts and it was evidently the intention<br />\nof the Western Maryland people that the<br />\nkick-off should be from that point, when a<br />\ncompromise was arranged. It was found<br />\nthat, with a few irregularities the field sloped<br />\nfrom either end, down to a miniature gorge.<br />\nThis gorge was decided upon for the kickoff, and Randall sent the ball to what would<br />\nhave been Western Maryland's I5-yard line.<br />\nHopkins held them for two downs, and end<br />\nplay was tried by Western Maryland. This<br />\nsucceeded to the point of losing the ball.<br />\nMcDonald fell on it, and in the frenzy of<br />\ntheir grief, Western Maryland said they<br />\n\"wouldn't play unless the ball was returned.\" As McDonald has scruples about<br />\nthe humoring of spoiled children, he refused<br />\nto comply and was sustained by the decision<br />\nof the referee. Western Maryland carried<br />\nout their threat and left the field. As the<br />\nball was still in play our men carried it up<br />\nfor a touchdown. At this point ,one of the<br />\nWestern Maryalnd backs came out on the<br />\nfield and wanted to fight Blanek. The latter<br />\nwas accommodating and the half-back woke<br />\nup some ten feet away. The field then<br />\nswarmed with the rooters of both teams and<br />\nfor a few moments things were lively. The<br /><br />\nTHE NEWS-LETTER.<br /><br />\n9<br /><br />\nof whom played in last year's team. These<br />\nmen are all enthusiastic for baseball, and if<br />\n\"spirit\" has anything to do with making<br />\na team a big success, this year's team will<br />\nbe one that the students and friends of Hopkins can look upon with pride. These men<br />\n.911 have the advantage of last year's experience, and their strength, combined with<br />\nthat of the new men just entering the University, will be a big boon to baseball this<br />\ncoming season.<br />\nAmong the new and experienced players<br />\nnow in the University are the captain of<br />\nthe Syracuse University team, Lipscum of<br />\nthe Randolph-Macon College team, Wight<br />\nW. M. C.<br />\nPosition<br />\nJ. H. U.<br />\nCooling and Hand, old Hopkins stars who have just<br />\n.Center<br />\nPrebble<br />\nStayton returned to the University, and Higgins in<br />\nRight guard<br />\nIkleberger<br />\n.Curry<br />\nLeft guard<br />\nCrothers<br />\nLoft tackle....Henry, Thomas the first year of the Medical School, who<br />\nKelley<br />\nSmith<br />\nRight tackle<br />\nWorthington<br />\npitched last season for the Kentucky State<br />\nRanier<br />\nLeft end<br />\nBoyce<br />\nMyers (capt.) College team.<br />\nRight end<br />\nHolland<br />\nRoberts, Henry<br />\nFullback<br />\nBlanch<br />\nIn addition to these it will be safe to count<br />\nLawyer<br />\nPearre (capt.).... Right halfback<br />\nWeeks on several of the present Freshman class.<br />\nLeft halfback<br />\nMcDonald<br />\nHiggins<br />\nQuarterback<br />\nRandall<br />\nMost of last year's games were played<br />\nLinesmen—Sioussat (J. H. U.) and Stephens away from home. This year, however, it<br />\n(W. M. C.). Timekeepers—Dill (J. IL U.) and<br />\nis hoped that the majority of games may be<br />\nWilson (W. M. C.). Referee—Milton. Umpire—<br />\nProfessor Davy.<br />\nplayed at home, and by so doing, give the<br />\nbaseball followers the chance of seeing Hopkins represented on the \"diamond\" by as<br />\nTHE 'VARSITY BASEBALL TEAM.<br />\ngood a ball team as she is represented on<br />\nREATLY elated by the fine showing the lacrosse field by a good lacrosse team.<br />\nThe management hopes to secure the serof the baseball team of last season,<br />\nthe baseball enthusiasts are setting a vices of Mr. Adkins, who made so much of<br />\nmovement on foot for organizing a strong last year's team, for coach. It does not<br />\npropose to play a lot of petty teams, but<br />\nteam for the coming season.<br />\nConsidering the difficulty which last year's intends to schedule and play games that will<br />\nteam had of organizing and getting in the reflect credit on the team and on the Unifield, it deserves the praises of the student versity. All it asks is that it will be given<br />\nbody. Although it did not receive the sup- the support of the Athletic Association, and<br />\nport of the Athletic Association—a very de- of the students, and it will see that a creditplorable fact—the team was under the man- able team will be put into the field.<br />\nagement of those who went about it in the<br />\nright spirit, and was what may be called<br />\nMARSTONS, 17; JUNIORS, 5.<br />\nself-supporting.<br />\nThe Junior football team played their secWith the impetus given it last year, baseball promises this coming season, to be one ond game of the season last Wednesday<br />\nof the leading sports of the University. Pres- afternoon, October 26, when they were deent prospects indicate that this year's team feated by the Marstons team by a score of<br />\nwill be stronger in every respect than last 17 to 5.<br />\nOn the first kick-off, which was by Maryear's.<br />\nAmong the old players to be seen again ston, Revell carried the ball back to the<br />\nare Randall, Lyon, Brown and Boyd—all 30-yd. line. A few moments later the Juniors<br />\nmedical men—who made big sacrifices in lost the ball on downs. This was followed<br />\norder to accompany the team on its various by a series of line plunges by the Marston<br />\ntrips.<br />\nIn the collegiate department are team, which secured the first touchdown for<br />\nBowie, Goldman, Straughn and Baetjer, all Marstons.<br />\nvillage hostler and constable had his hands<br />\nfull, but finally cleared the field. Hopkins<br />\nthen left the field, and after they had disappeared Western Maryland recovered from<br />\ntheir sulkiness, and proceeded to run from<br />\ngoal to goal scoring imaginary touchdowns,<br />\nwhile their rooters shrieked with hysterical<br />\nglee. The referee, however, decided that<br />\nthe score should be 0-0.<br />\nConspicuous among the players deserving<br />\nmention are Blanck, Worthington, Carruthers and McDonald of Hopkins, and Myers<br />\nand Higgins of Western Maryland. The<br />\nline up was as follows:<br /><br />\nG<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nOn the second kick-off, Marston advanced<br />\nthe ball as far as the 40-yd. line, and followed this up with a 70-yd. run which netted<br />\na second touchdown for Marston.<br />\nIn the second half, the Juniors seemed<br />\nstronger than their opponents. Near the<br />\nmiddle of the half Marston secured her last<br />\ntouchdown. At this point, the Juniors took<br />\na decided brace; and,. with a sensational run<br />\nof 70 yards by Griffith, made their only score.<br />\nCrothers, at left tackle, did the best work<br />\nfor the Juniors. Others who did notable<br />\nwork for the Juniors were Mengel, Morse,<br />\nHack, and Zimmerman.<br />\nConsidering the little practice which the<br />\nJuniors have done so far, they put up a very<br />\ngood game. But, nevertheless, much hard<br />\npractice is necessary to get them in good<br />\nform for the class \"contest.\"<br /><br />\nDr. Renouf—The water supply of Baltimore is entirely unfit to drink.<br />\nStudent (anxiously)—I wonder what<br />\nabout Milwaukee's?<br /><br />\nY. M. C. A. MAIL.<br />\nOh, it's every day I wander,<br />\nTo the basement down below,<br />\nWhere the pigeon holes are many<br />\nIn the J. H. U. P. 0.;<br />\nOh, it's every day I wander,<br />\nBut forever and for aye,<br />\nCome my only, only letters,<br />\nFrom the Y. (why?) M. C. A.<br />\nMany cordial invitations,<br />\nDo these kindly missives bear.<br />\nSuch as \"Come and be a member,<br />\nJoin with us in evening prayer;\"<br />\nOr \"A Bible class is forming<br />\nUnder Mr. So and So,<br />\nYou'll perform an act of kindness,<br />\nIf you would but try and go.\"<br />\nAnd they've other invitations,<br />\nFormal bids to formal lunch,<br />\n(Tis too bad that at these functions<br />\nThey debar all Roman punch).<br />\nLarge receptions in the evening,<br />\n\"Evening dress is not the style,\"<br />\nAnd St. Andrew chapter meetings;<br />\n\"Just drop in a little while.\"<br /><br />\nThough these bids are very many,<br />\nWhich I get from day to day,<br />\nFour, or five, or six, or seven,<br />\nFrom the Y. (why?) M. C. A.;<br />\nYet another kind of bidding,<br />\nComing first in ones and twos,<br />\nThen increasing to the hundreds,<br />\n\"You will please to pay your dues.\"<br />\nSometimes think I that these people<br />\nAre not financiers a bit,<br />\nSpending fortunes out on paper,<br />\nGetting nothing back from it.<br />\nBut of course there are some members,<br />\nOne, or two, or mayhap, three,<br />\nWho do pay with great devotion,<br />\n(Oftimes one year out of three).<br />\nSurely bills would try a mortal<br />\nMuch more saintly than am I,<br />\nWhen they teem by tens of hundreds,<br />\nWhile I stand defenseless by;<br />\nThink you, I should view them calmly?<br />\nBills are bills, some people say,<br />\nTrue, with but one lone exception,<br />\nThat's the Y. (why?. M. C. A.<br />\nFirst, I used to like attention<br />\nFrom the Y. (why?) M. C. A.,<br />\nNow I do grow tired and tireder,<br />\nTired and more tired every day;<br />\nFor the way my box is crowded<br />\nFrom the bottom to the top,<br />\nMakes me ask the fatal question,<br />\nY. M. C. A won't you stop?<br />\nOh, it's every day I wander,<br />\nTo the basement down below,<br />\nWhere the pigeon holes are many<br />\nIn the J. H. U. P. 0.;<br />\nOh, it's every day I wander,<br />\nBut forever and for aye,<br />\nCome my only, only letters,<br />\nFrom the Y.(why?) M. C. A.<br />\n'06.<br />\nA youth went forth to serenade<br />\nThe lady he loved best,<br />\nAnd by her house at evening,<br />\nWhen the sun had gone to rest,<br />\nHe warbled until daylight<br />\nAnd would have warbled more,<br />\nBut morning light disclosed a sign<br />\n\"To Let\" upon the door.<br />\n—Exchange.<br /><br />\nTHE NEWS-LETTER.<br />\nPROGRESS IN THE ORIENTAL<br />\nSEMINARY.<br />\nThe work of the Oriental Seminary has<br />\nopened up this year most auspiciously.<br />\nAbout a dozen new students have taken up<br />\nwork in the Seminary viz., Mr. J. R. Gaar<br />\nof Dodson, La., A. B. of Westminster (Texas), College, 1901; Mr. 0. J. H. Preus of Decorah, Ia., A. B. of Luther College, 1901;<br />\nMr. Applestein, Mr. Bernstein, Mr. Bransky,<br />\nMr. Bloudheim, Mr. Potz, Mr. Ellison, Mr.<br />\nEdlavitch, Mr. Parelhoff, Mr. Pleet, etc.<br />\nThe impression is rapidly gaining more<br />\nand more ground that ancient history in the<br />\nlight of the important discoveries made in<br />\nWestern Asia and Egypt can be treated<br />\nauthoritatively only by an Orientalist, and<br />\ntherefore the number of historical students<br />\nwho avail themselves of Professor Johnston's course on the history of the Ancient<br />\nEast shows a gratifying increase.<br />\nIn accordance with its policy of not repeating certain definite courses in rotation<br />\nin a cycle of three or four years, as other<br />\ndepartments do, a number of entirely new<br />\ncourses has been begun in the Oriental Seminary. Professor Haupt interprets this year<br />\nthe Books of Ruth, Lamentations, and Esther<br />\nin the Old Testament Seminary. Professor<br />\nJohnston is giving n new course on the<br />\nfamous Babylonian Code of IIammurabi with<br />\nspecial reference to the corresponding legal<br />\nsections of the Old Testament. Dr. Blake,<br />\nin addition to his courses in Tagalog, the<br />\nprincipal dialect spoken in the Philippine<br />\nIslands, has for the first time begun a course<br />\nin Ilokan. Another innovation in the Seminary is Dr. Ember's course in Hebrew conversation, in which the German, Russian and<br />\nPolish method of pronunciation is used. As<br />\n90 per cent. of Jews at the present time use<br />\nthis so-called Ashkenazic pronunciation, this<br />\ncourse is important for practical purposes.<br />\nMr. Dennis, who spent last winter with<br />\nDr. Reissner assisting in and directing certain archeological excavations in Egypt, has<br />\nreturned to the University and will resume<br />\nhis work in Egyptology under the direction<br />\nof Professor Johnston.<br />\nProfessor Haupt has just published his<br />\nnew metrical translation of Ecclesiastes.<br />\nThis translation was read by the author at<br />\nthe second International Congress for the<br />\nHistory of Religions, held this summer at<br /><br />\n11<br /><br />\nBasle, and attracted a great deal of attention.<br />\nThe book is dedicated to President D. C.<br />\nGilman of the Carnegie Institute, whom the<br />\nauthor calls the creator of the First American University.<br /><br />\nLOCKE: THE MAN AND HIS WORK.<br />\nThe programme for the two hundredth<br />\nanniversary of the death of the philosopher,<br />\nJohn Locke, which was held in McCoy<br />\nHall, Johns Hopkins University, on Tuesday,<br />\nNovember 1, at 5 P. M., was as follows:<br />\n\"Locke's Philosophy and Psychology,\"<br />\nPrincipal C. Lloyd Morgan of Bristol, England, and Prof. F. J. E. Woodbridge, of<br />\nColumbia University.<br />\n\"Locke as a Physician,\" Dr. William Osier<br />\nof the Johns Hopkins Medical School.<br />\n\"Locke on Toleration,\" Prof. J. McBride<br />\nSterrett of George Washington University.<br />\n\"Locke's Political and Social Views,\" Dr.<br />\nWilliam T. Harris, United States Commissioner of Education.<br />\nProfessor J. Mark Baldwin, director of the<br />\ndepartment of psychology at Johns Hopkins,<br />\nwill make a brief introductory address as<br />\nthe presiding officer at the celebration.<br /><br />\nMRS. FRANKLIN LECTURES.<br />\nMrs. Christine Ladd Franklin delivered<br />\nthis week before the Psychological Seminary<br />\nof the Johns Hopkins University, her lecture<br />\nupon \"The New Concept of the Infinite,\"<br />\nwhich she recently presented in St. Louis<br />\nbefore the Congress of Arts and Sciences.<br />\nThe latter part of November Mrs. Franklin<br />\nwill begin in the department of philosophy<br />\nand psychology of the University a course<br />\nof lectures in logic and vision. Mrs. Franklin is a fellow of the University.<br />\n'07—The mathematical department has imported four hundred rabbits from Germany.<br />\n'08—And why?<br />\n'07—Merely because they multiply with<br />\nsuch rare celerity.<br />\n—Harvard Lampoon.<br />\nShe (indicating Police Station with her<br />\nindex finger)—And is that a dormitory, too?<br />\nHe—It's used for one in a pinch.<br />\n—Harvard Lampoon.<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br /><br />\nNOTES FROM OTHER COLLEGES.<br />\nDr. Dudley Allen Sargent, the well-known<br />\ndirector of Harvard's Hemenway Gymnasium, has just published an authoritative<br />\ntreatise on Physical Culture under the title<br />\nof \"Health, Strength and Power.\"<br />\nIn this work of 280 pages, Dr. Sargent<br />\nhas aimed to make physical training more<br />\npopular by devising a series of exercises<br />\nwhich require no apparatus whatever. It<br />\nis profusely illustrated with half-tone illustrations from original photographs furnished<br />\nby the author. At this time, when the benefits of outdoor living and breathing pure<br />\nair are being agitated, the simple exercsies,<br />\nwhen followed as here described, cannot but<br />\nbe found beneficial to the highest degree.<br />\nThe corporation committee on the retirement of professors has proposed a plan<br />\nwhereby professors over seventy years of<br />\nage who have been with Brown University<br />\ntwenty yeras or more shall be retired. The<br />\ndetails are not ready for publication, as the<br />\nplan must be submitted to the faculty, but<br />\nit may be said that the scheme is practically<br />\nthe same as that in vogue at Yale and other<br />\ninstitutions.<br />\nThe subject of dress reform is to the fore<br />\nat Princeton this year. It has been a fad<br />\nwith the undergraduate of late years to appear in the class room in the garb of a stone<br />\nbreaker, and of an impecunious stone breaker at that. Now certain upper-class men<br />\nhave decided that this habit is injurious to<br />\nthe reputation of the university and have<br />\nundertaken its reform with a fair prospect of<br />\nsuccess. Flannel shirts, overalls, brimless<br />\nhats have been tabooed and even the sweater<br />\nhas fallen under the ban.<br />\nThe latest West Point toast to the ladies<br />\nis:<br />\nOur arms your defense,<br />\nYour arms our recompense—<br />\nFall in!<br />\nThe rooters in leading eastern universities<br />\nare very chary of giving the cheer for individual players on the football field. When<br /><br />\nit is given it means something and is one<br />\nof the greatest honors that can be accorded<br />\na player. Oftentimes when a man makes<br />\na long gain the one who made the run possible deserves the cheer. Nice discriminations, then, must be made, and when three<br />\ncheers are given a man he knows he really<br />\ndeserved the ovation.<br />\nThe following are a few of the summaries<br />\nof the report of Professor Edwin G. Dexter<br />\nof the University of Illinois, who has been<br />\nconducting an extensive investigation of injuries received in college football.<br />\n1. About one college man in ten the<br />\ncountry over plays football.<br />\n2. About twice as large a proportion of<br />\nthe men in the small colleges play the game<br />\nas in the larger universities.<br />\n3. About one player in thirty-five is injured sufficiently each season to necessitate<br />\nloss of time from college duties.<br />\n4. The opinion of college officers regarding the value of the game is about 17 to 1<br />\nin its favor.<br />\nThese results are based on statistics furnished by the officers of sixty of the more<br />\nimportant colleges of the country. The figures cover the last ten years, during which<br />\nperiod of time, out of the number of 22,766<br />\nstudents playing the game 654 were injured<br />\nto such a degree that they lost time from<br />\ntheir classes. This is in the proportion of<br />\nless than 3 to every 100 players. Of the<br />\nserious injuries but eight were of a permanent nature. Three cases resulted fatally;<br />\ntwo of these were untrained men.<br />\nPresident Guy P. Benton, of Miami University, has expressed the following strong<br />\nopposition to football:<br />\n\"I recognise the fact that one college could<br />\nnot act alone. It would be dubbed a 'sissy'<br />\ninstitution. I should like to see the presidents of all colleges get together to abolish<br />\nfootball.<br />\n\"I favor athletics, and want boys to have<br />\na good time, but football is too hazardous<br />\nto be a justifiable college sport.\"<br />\nSeveral Miami football players were hurt<br />\nin a game at Columbus recently.<br /><br />\n\"<br /><br />\n1:44-011'ki?ED1iSilartalfT\"<br /><br />\n'DAS ri!ii oc.e.A.Ca<br /><br />\nn<br /><br />\n,e0<br /><br />\nTAILORING<br /><br />\n'We ha.v(arite Salenmeil.<br />\nWe have Expert Cutters,<br />\n421 N. I i()WAPI)<br /><br />\nWe have a Large Assortment of Mato.<br /><br />\n.<br />\nI:tc. at Poptailr Pricks.<br /><br />\nis,<br />\nAT POPULAR PRICES.<br /><br />\not $i.001)t.r Palr.<br />\n.111111•4•11111.4.11.<br /><br />\nCOLLEGE AND CLASS STATIONERY,<br /><br />\nB. Wcyforth &amp; Sons,<br /><br />\nKlastli AND tietiNiCtUrfk CARDS.<br /><br />\n...Tailors...<br /><br />\nIDO1AL<br /><br />\ns.<br /><br />\nSTATIONER AND ENGRA.VER,<br /><br />\n217-219 North Pace Street.,<br /><br />\nBaltimore, Md.<br /><br />\nJ. IL-LICIJUAIRD NUNN.IL.etteo with C.'teehlrigig<br /><br />\n229 NORTH MMUS SWUM<br />\n4Ccb.<br /><br />\nNUNN &amp; COMPANY,<br />\n--BOOKSELLERS .FIND S1ATIONERS227 NORTH HOWARD STREET, Between<br /><br />\nLexington<br /><br />\nand Saratoga Streets, BALTIMORE,MD.<br /><br />\nAll Text Hooks used at the Johns Hopkins University promptly supplied. Full line of Stationery, Note.Books,etc.<br />\nPAPER STAMPED WITII COLLEGE HEADING.<br />\nav.11.111•1111.<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nNew York to Bremen. London, Paris, Gibraltar, Naples. Genoa, etc.<br />\nBALTIMORE TO BREMEN ntREcT. •<br />\n419 S. Einnover St.<br /><br />\nror particulars apply to<br /><br />\nSFudio<br />\nCummins.<br /><br />\nil(jCIArritZ<br /><br />\nsuccessor to<br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington Street,<br /><br />\nA. SCHUMACHER &amp; CO-, General Agents.<br />\nMICROSCOPIC SUPPLIES,<br /><br />\nMICROSCOPES,<br /><br />\nnissEcriNa<br /><br />\nRUBBER GLOVES,<br /><br />\nCASES,<br /><br />\nTHE CHARLES WILLKS SURG. INST. CO.,<br /><br />\nBALTIMORE.<br /><br />\n300 NORTH HOWARD STREET,<br /><br />\n#pecial Discount to Students.<br /><br />\nBALTIMORE. MARYLAND<br /><br />\nNNW<br /><br />\n. H. PETTING.<br /><br />\nE300K Si SECOND-HPENDI<br />\nSchool, Medical and Miscellaneous,<br />\nBought, Sold and Exchanged.<br /><br />\nManufecturer of<br /><br />\nGreek Letter Fraternity jewelry,<br />\n213 NORTH LIBERTY STREET.<br />\nBALTIMORE, MD.<br />\nPlean0 call and examine our line before purchasing.<br /><br />\nEliDERsotcs univcrsitvismt<br /><br />\nPIPPEN'S BOOK STORE<br />\nNEAR THE UNIVERSITY.<br />\n605 N. EUTAW<br />\nBALTIMORE'S LAROEST OLD BOOK STORE.<br />\nJ. V/.<br /><br />\nmatokantovir,<br /><br />\nWILIICUVI V. 1/./01141101-<br /><br />\nVli•NK<br /><br />\nST.<br />\nl<br /><br />\nOD,<br /><br />\nJ. 'N.- BREEDLOVE &amp; CO.<br />\nMERCHANT TAILORS<br /><br />\nMADISON and HOWARD STS.<br /><br />\nSTYLISH GARMENTS FOR GENTLEMEN.<br />\n115 WEST SARATOGA ST. NEAR HOTEL RENNERT<br /><br />\nText Books, Note Books, Students' Supplies.<br /><br />\nBALTIMORE, MARYLAND.<br /><br />\nOOKS AND STATIONSRY<br />\nMiscellaneous Books<br />\nand Rare Editions.<br />\nWolters dies for the UNIVERSITY tind MEDICAL SCHOOL.<br /><br />\nTHE EICHELBERGER BOOK CO.<br />\nBOA Borth Charles Street.<br /><br />\n10 West Saratoga Street.<br /><br />\nSMITH'S BOOK STORE<br />\n805 N. HOWARD ST.,<br />\n:3rd door above Madison St.<br /><br />\nSCHOOL AND COLLEGE TEXT BOOKS<br />\nBOUGHT, SOLD AND EXCHANGED.<br /><br />\nNapalk Nimainvlipook vasillk•volikk<br /><br />\n'VOW'VOA NOW,1010u, NOOK 1.111\",<br /><br />\nTheft is aothing likc or colat<br />\nto a I rAAMIArr Solt for stgic<br />\n(oitAmt<br /><br />\n------ YOU MAY SEE —<br /><br />\nFownes Gloves<br /><br />\nHiN1N11 1?-1<br /><br />\non the man who doesn't<br />\nknow what's what—<br /><br />\nW. NAPA 1 06A S\" UPETT.<br />\nNolo,Wok *milk'WOW ‘111110, vino,'NOM VIM'IOW `mak'NOW NOM.<br />\nC. &amp; P. Telephone 445-Y.<br /><br />\nyou're SURE to see<br />\nthem on the man who<br />\ndoes know<br /><br />\nJ 11. U. DINDRR.<br /><br />\nLibraries arranged and put in order without removal.<br /><br />\nPUZICKA<br />\nBookbinder,<br />\n609<br /><br />\nN 0 I?<br /><br />\nMOO BROS<br />\n18 West<br />\nLexInicton St.<br />\nBALTIMORE, MD.<br /><br />\nII<br /><br />\nL LI<br /><br />\n03 aim<br />\n&gt;&gt;r<br />\n0Z<br />\nZ6.)<br />\nri<br />\nfl;<br /><br />\nIX W<br /><br />\ns<br /><br />\nJohn S. Kerr<br />\nW. Parvie Ralph<br /><br />\n1.?<br /><br />\nr_ T.<br /><br />\nC. &amp; P. Phone<br />\nMMIIIM10110111101.<br /><br />\nKERR &amp; ROLPH<br />\nRepreenting Arthur Johnson &amp; Co.,<br />\nNow York City.<br /><br />\nSporting Goods<br />\nand<br /><br />\nAthletic Supplies<br />\n304 PARK AVENUE,<br /><br />\nBALTIMORE, MD.<br /><br />\n•••••••••••••••••••••••••••••••••••<br /><br />\nFOR ADVERTISING RATES<br />\nIN THIS PAPER,<br />\nADDRESS<br /><br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n:<br />\n•<br />\n:<br />\n•<br />\n• WANTED :<br />\n•<br />\n••••••••••••••••••••••••••••••••••••••<br /><br />\nto<br />\n•<br />\n—ALUMNI 10 INSERTIDEIR BUSI•<br />\n.<br />\n•<br />\n•<br />\nAND PROFF.SSIONAL CARDS<br />\nNESS<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\nIN THE NEWS-LETTER.<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n••••••••••••••••••••••••••••••••••••••••<br /><br />\nTHE<br />\nNEWS-LETTER,<br />\nJohns Hopkins University,<br />\nBALTIMORE.<br /><br />\nf<br /><br />\nv•••••*•••••••*••••••••*•••••••••••*<br /><br />"}], "field_media_file": [{"target_id": 36276, "display": null, "description": null, "target_type": "file", "target_uuid": "fdbecd10-17ff-430b-8266-a58c3760c868", "url": "http://digital.library.jhu.edu/system/files/2022-03/12252-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12252, "target_type": "node", "target_uuid": "5e162054-7072-4924-b254-f7d4dfb467bb", "url": "/node/12252"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "b13bd734-4543-47ab-b166-34fe69190229"}]}