{"mid": [{"value": 37011}], "uuid": [{"value": "0970d3f7-488e-42b9-8b3b-319afa3c355e"}], "vid": [{"value": 37011}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:57:54+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13139-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:57:54+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:57:54+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXIX, No 9<br />\n<br />\nHOMEWOOD, BALTIMORE. MD., OCTOBER 31, 1924<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nDR. EDMUNDS ON WESTERN CALHOUN ELECTED<br />\nSOPHOMORE CLASS ADOPTS SEA-WALNUTS AND<br />\nHOPKINS WILL CLASH WITH<br />\nSENIOR PRESIDE]% T<br />\nTOUR TO AROUSE<br />\nMEASURES REGARDING<br />\nEAGLE'S NEST FOUND<br />\nGEORGE WASHINGTON<br />\nWilliam C. Calhoun was elected<br />\nALUMNI<br />\nJellyfish, sea-walnuts and an<br />\nFRESHMEN<br />\nTOMORROW<br />\npresident of the Senior Class at a<br />\neagle's<br />\nnest.<br />\nProvost Has Erected Tower in Botanical<br />\nPep Committee is Reorganized; Annual<br />\nBlue Jays May Start With Devereux At<br />\nspecial class meeting held WedGardens for Purpose of Taking<br />\nThese were the three unusual<br />\nAthletic Clashes Planned<br />\nQuarter to Improve Aerial<br />\nPictures of University<br />\nAt Meeting<br />\nnesday at noon. Calhoun defeated<br />\nAnd Running Attack<br />\nobjects sought by the Field Club<br />\nIntense interest has centered Kelso Morrill by a margin of 20<br />\nThe Sophomore Pep Commit- when six members, accompanied<br />\n•<br />\nPROBABLE LINE-UP:<br />\naround a structure in the north- votes. The official count was Cal- tee promises to keep regulations by Dr. Andrews and Mr. Everett<br />\nHopkins<br />\nGeo. Washington<br />\nwest corner of the botanical gar- houn, 72 votes; Morrill, 52 votes.<br />\nin force among the class of 1928. C. Myers, took a trip to the Sev- No. Player<br />\nPos.<br />\nPlayer No.<br />\ndens. The question \"What's it<br />\nA Senior Class by-law requirern River last Saturday.<br />\n2 Mallonee ...L.E.<br />\nZoller 13<br />\nfor?\" has passed among the stu- ing a majority in. all elections At a recent meeting of the com- The eagle's nest was inspected 13 Magill (C.)..L.T.<br />\nLoeb 9<br />\n11<br />\nOles<br />\nL G .(C.) Hottel 20<br />\ndents and even the wisest of facul- made the special meeting neces- mittee, plans were discussed for from an observation platform built 4 Day<br />\nc<br />\nClements 18<br />\nty sages have interrupted lengthy sary, as Calhoun had only a plu- the most efficient methods of car- high in the air opposite the nest. 3 Slowik .....R.G..... Fletcher<br />\n23<br />\nRT<br />\nMiller 8<br />\ndiscourses to inquire the purpose rality over Morrill in the regular rying out the freshman regula- The eagles are of the American, 7 Levy<br />\nBerndt<br />\n.R E.<br />\nBowen .22<br />\nof this building which resembles a fall elections. Others in the field tions. The<br />\nTaylor ....Q.B..... McLain 1<br />\nmost favorable plan or Bald-headed, species and have 15<br />\n6 Turnbull ..L.H.B..... Wagner 2<br />\nminiature oil derrick. At last the withdrew, leaving only Morrill<br />\nlived in the vicinity of their home 20 Sauerw'n ..R.H.B..... Mallone 3<br />\nwas as follows:<br />\nstory has leaked Out.<br />\n10 Blandi<br />\nF B.<br />\nand Calhoun, the latter being<br />\nLaux 16<br />\n1. Freshmen will be held respon- for the past 30 or 40 years, it is<br />\nDr. Edmunds, the- provost of the elected on the first ballot.<br />\nsaid.<br />\nIt will be Hopkins against the<br />\nsible for all requirements.<br />\n1-T,niversity, who is on an extended<br />\nMany specimens of sea-walnuts<br />\n2.'Sophomores are privileged to and jellyfish were found<br />\ntour of the west, with his assist- PITTSBURGH-HOPKINS MEN<br />\nremade<br />\nGeorge Washington team<br />\nnear the<br />\nant, W. H. Moore, who was Edquestion any Frosh, but not to river.<br />\nat Homewood tomorrow. With a<br />\nORGANIZE ALUMNI<br />\nitor-in-Chief of the 1923 Newsbad year of football behind them,<br />\npaddle him.<br />\nASSOCIATION<br />\nLetter, is concerned in the mys3. Sophomores will report to the MONTEBELLO<br />\nPLANT<br />\nIS the Washington eleven has blosK. Edmunds Addresses<br />\ntery. The portable structure was Dr. Charles<br />\nMeeting Of Thirty Hopkins<br />\nVIEWED<br />\nHOPKINS<br />\nBY<br />\nsom-ed forth and taken a new lease<br />\npep committee names of any freshbuilt for the purpose of taking picGraduates<br />\nSTUDENTS<br />\non life this year. It is the same<br />\nmen<br />\nwho<br />\nfound<br />\nto<br />\nare<br />\nbe<br />\nunfatures, at a diagonal, of the botanReports from Pittsburgh indiical gardens. Now, however, the cate that on Friday night, Octo- miliar with the Who's Who, etc. Electricity for Baltimore Generated college that fell so ingloriously beForty Miles Away, At Holtwood,<br />\nfore the Blue Jays last fall,61 to 6.<br />\nProvost is on a trip for the purpose ber 24, • 30 of the 84 Johns Hop- 4. The pep committee will meet<br />\nPennsylvania<br />\nof organizing the alumnae. He kins alumni residing in that city the men whose<br />\nOne of the largest and best This season, however, they prenames are handed<br />\nwill pass through Pittsburgh, Chi- met at the University Club of<br />\nequipped<br />\nfiltration plants in the sent a different aspect because of<br />\nin at a secret place and make them<br />\ncago, Milwaukee, Madison, Indi- Pittsburgh and formed an alumni<br />\nUnited<br />\nStates<br />\nwas inspected by the defeat they administered<br />\ncome to terms.<br />\nanapolis, St. Louis and Chicago, association. Dr. Charles K. Edmembers of the Sanitary Engineer- Western -Maryland, a strong team,<br />\n5. Any freshman who does not<br />\nattending banquets and making munds, Provost, who was the<br />\ning course at Hopkins when the and their 41-to-0 victory over AlSpeeches to the alumnae gathered speaker for the evening, told of appear will be brought before the class visited the Montebello Filters, bright.<br />\nin the respective cities who are the distinctive work. in research Student Council.<br />\nShift In Backfield Likely<br />\nat Baltimore, Monday, October 27.<br />\nWhether<br />\ninterested in a better organization carried on in all departments of<br />\nthe Blue Jays will sufThe local plant is now supplying<br />\nTuesday Chosen As \"Pep Day\"<br />\nof that body. Not until November the University.<br />\nfer<br />\na<br />\nrelapse<br />\nfrom their present<br />\nThough the spirit of .the fresh- regularly about 110,000,000 gal10 or later wil be return to this<br />\nFollowing the organization of man class as a whole is greatly im- lons of water a day to residents of splendid form remains to be seen.<br />\nCity.<br />\nthis city. Additions and improve- The slight injuries to Oles and<br />\nthe association, officers were<br />\nOn his tour the Provost will ex- unanimously chosen as follows: proved, the committee has its eyes ments which are now under course Magill, however, will not keep<br />\nhibit pictures that he has taken of Dr. Thomas S. Baker, A. B., '91, on three or four men who are not of construction are expected to these men out of the game and<br />\nthe University. Pictures_ of his Ph. D.,.!95, President of Carnegie getting into the spirit of the regu- practically double this rate.<br />\nHopkins will 'probably take tile<br />\nAlma Mater should stir in every Institute of Technology, president lations. These men will be brought<br />\nfield<br />\nwith last week's line-up inFollowing the course of the waalumnus a desire to do more in of the association; Thomas Fitz- to account if they are not careful, ter through the filtration plant it tact. The only change in the backthe future than he has done in the gerald, A. II, '98, General Mana- says Eddie Day.<br />\ncan be seen that water as delivered field may be the addition of DevPast for his University.<br />\nIt was also decided to inaugu- to the city can no longer be classed ereux as quarterback, in which<br />\nger of Pittsburgh Railways, secNow we return to the tower. retary; Dr. Clifford C. Hartman, rate a \"Pep Day\" on which the as a product of nature, but is in case Walker Taylor will be moved<br />\nPictures taken from This will be M. D., '11, treasurer.<br />\nregulations would be enforced to reality a manufactured article. ,.kf- to the right halfback position. The<br />\nPlaced in the collection that Dr. The meeting, which was a most the utmost. This does not mean ter traveling seven miles through a reason for this possible change lies<br />\nEdmunds has ordered to be placed enthusiastic one, was attended by that there will be a let-up on the tunnel, the water is sucked up by in Devereux's running ability,<br />\nOn sale tomorrow in the postoffice, Dr. Thomas S. Baker, E. Mac- other days of the week, but that pumps, which are operated by elec which last Saturday was superior<br />\nthe dormitories and the Book coun,<br />\nTheodore Baker, M. D.; L. more attention than usual will be tricity, generated forty miles away, to any of the present backs.<br />\nStore. The Doctor had planned to C. Bixler, M. D.; A. A. Born- turned toward the matter on Tues- at Holtwood, Pa. Upon entering Whether he will also take up Taytake these pictures on the Satur- sheuer, M. D.; Frank A. Evans, days.<br />\nthe plant, chemicals are added to lor's signal-calling duties is doubtday before he left for his trip, but<br />\nM, D.; Thomas Fitzgerld ; H. B. Pep was the keynote of a meet- the water, which congeal the sus- ful. This combination would prehe was unable to complete his arGardner, M. D.; S. J. Glass, Jr., ing of the sophomore class pended matter and collect with it sent a formidable aerial attack a:,<br />\nrangements. Therefore, the struc- M. D.; C. C. Hartman, M. D.; R. held Monday, October 27. Coach most of the bacteria. The next step both Taylor and Devereux are exture must stand for at least two S. Major, M. D.; Watson Mar- Keen of the freshman baseball is to settle out most of the chemi- cellent passers and receivers. Tayweeks in the far corner of the gar- shall, M. D.; W. T. Mitchell, Jr.. team warned the sophomores cals with the heavier particles of lor may also prove the man Coach<br />\ndens as a memorial to the high M. D.; S. B. Myers, C. S. Palmer, that the freshmen were getting too suspended matter and prepare the Van Orman has been searching<br />\nWater mark of curiosity.<br />\nself-confident, and that a defeat to water for filtration in the coagu- for to fill the right halfback posiContinued on page 2 coL 3<br />\nthe class baseball team would \"take lating basins. The remainder of tion. •<br />\nTWENTY-FOUR TONS COAL AVERAGE CONSUMPTION them down a peg or two.\" .This the chemicals and suspended matHopkins' Opponents Improve<br />\nWhen George Washington was<br />\nFOR ONE DAY AT HOPKINS<br />\nview was upheld by Niner of the ter, together with most of the bacWhile standing in front of the really the \"screenage\" or the fine football squad who urged all can- teria, are removed from the water added to the schedule it wasintendBarn many piles of coal may be particles that are \"screened\" off didates to report on November •10. by the filters. After filtration the ed that an easy game should prewater is perfectly clear, but as an cede the St. John's contest the folAppointments Made<br />\nseen on the lot adjoining the from the hard coal. On the lot, at<br />\nprecaution a small lowing week. When St. John's enadditional<br />\nSeveral<br />\nappointments<br />\nwere<br />\nthis time, are about 900 tons of<br />\nPowerhouse. Students were inquichlorine is inject- countered so much difficulty in<br />\nliquid<br />\namount<br />\nof<br />\nthis screenage. It will soon be made, Broening being placed in<br />\nsitive to know how many tons are<br />\ncompletely ster- getting a team together the first<br />\ned<br />\nthe<br />\ninto<br />\nto<br />\nwater<br />\nmixed in the rpoper proportion charge of the Frosh-Soph rush;<br />\npart of the season it looked as<br />\nthere, how many tons are used in with the soft coal and used.<br />\nPassario, chairman of the smoker lize it.<br />\na winter, and several other ques- . The coal is used wisely. It runs committee, and Rosenfeld, chairthough<br />\nneither team would preFollowing the inspection of the<br />\nsent<br />\ngreat opposition. Now, howtions concerning the coal supply the giant turbines which make the man of the debating committee. filtration plant proper the party visof the University. After a rather electricity at two cents per kilo- The most important, however, ited the new unit now under con- ever, both teams rise before the<br />\nthorough investigation was made, watt. As the electricity that is was the appointment of a new pep struction. As this is still in a pre- Blue Jays like black clouds on the<br />\nthe following interesting facts furnished by the Gas and Electric committee. This consisted of Day, liminary stage, a good first hand horizon and neither can be taken<br />\n.Were found:<br />\nCompany would cost three cents chairman; Hines, Ward.well, Mc- view of the design of such a plant lightly.<br />\n\"Doug\" Turnbull, after a bad<br />\nThe coal supply of the Universi- a kilowatt, a great saving is made Neal, Ward, Lord, Kleff, Alt, was obtained.<br />\nstart, has gradually been approachty comes from the Emerson-Mor- by this system. Then, the exhaust Grinsfelder, Broening, Gassaway,<br />\ngan Coal Company and the Con- steam that would otherwise be Dempsey, France, McAllister and STUDENT COUNCIL MEETS ing his last season's place-kicking<br />\nsolidation Coal Company. It conDue to a conflict on the time of form. ,Turnbull has booted ten<br />\nwasted in that complex process of Niner.<br />\nsists of 3,000 tons each of anthra- making electricity, is used for<br />\nIn regard to dues, the class de- meeting, only two members of the goals ,out of seventeen attempts,<br />\ncite and bituminous, or a total of heat. This eliminates the special cided to follow the lead of the Council answered to roll call, FriContinued on page 2, col. 3<br />\n6,000 tons in eight months. This boilers and other parts that are so juniors in making the payment of day afternoon. Because of the abNOTICE<br />\nmeans that twenty-four tons of vital to a steam-heating plant. clues come under the Honor Sys- sence of the other members, MaImportant meeting of members<br />\ncoal are consumed each day. At Moreover, the exhaust steam has tem . In this way the individual is gill and Turnbull merely discussed<br />\nand candidates for Barnstormers<br />\nClub in Studio, today at 12.20.<br />\nthe present times, because of the been found to heat all the build- not required to pay his dues at cer- plans for the Frosh-Soph football<br />\nWarm weather, the mixture is not ings as efficiently as possible. tain required times, but instead is game, December 6. Officials for<br />\nThe Johns Hopkins Zionist<br />\nSociety smoker will be held Sunan even amount of both kinds of Thus the coal supply of the Uni- placed upon his honor to have all the game are: Magill, referee;<br />\nday evening at the Y. M. H. A.,<br />\ncoal but consists of 400 of hard to versity is led through a very inter- his dues paid up by the end of the Turnbull, umpire, and Parsons,<br />\nMadison Ave., at North. Everybody invited.<br />\n200 of soft. Also, the hard coal is esting and economical course.<br />\nyear.<br />\nhead linesman.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 31, 1924<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\n\"CRAFTSMANSHIP IN VERSE\"<br />\nSUBJECT OF DE LA<br />\nMARE LECTURE<br />\n<br />\nFOUNDED 1897<br />\n<br />\nEnglish Poet \"Discusses Technical Side<br />\nOf Poet's Art in Fifth Lecture<br />\n<br />\n\"Craftsmanship in Verse\" was<br />\nsubject of Walter De La Mare's<br />\nthe<br />\n$2.00<br />\nSubscription<br />\nfifth lecture under the Percy Turnbull Memorial Lectureship last<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at Tuesday in the C. E. Hall.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nTo understand the craftsmanship<br />\nof a poem, Mr. De La Mare said,<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nwe must \"fraction by fraction take<br />\nHopkins University.<br />\nit to pieces.\" During the course of<br />\nthe lecture well-known poems, less<br />\nBusiness communications should be addressed to the BUSINESS MAN- respected jingles, and extempore<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nwork of Mr. De La Mare's were<br />\nshould be sent to the MANAGING Enrron.<br />\nyou want it to<br />\nsubjected to this dissection.<br />\nER smooth,lustrous hair, done times just the way and<br />\nnon-greasy.<br />\nfashionable plainness in look. Non-staining<br />\nwith<br />\nTechnical names and the pedantdrug and<br />\nHomewood 0100<br />\nlines that follow closely the shape of In jars and tubes. At all<br />\nTelephone<br />\ndepartment stores.<br />\nry of verse Mr. De La Mare treatthe head....<br />\nHis well-kept hair,alwaysin place,<br />\ned rather jokingly, but very famililways trim, neatly parted, naturallooking ..<br />\niarly. He observed that some attenBusiness Manager<br />\nEditor-in-Chief<br />\nStacomb is responsible for this<br />\nquantity—<br />\nas<br />\nknown<br />\nis<br />\nwhat<br />\nto<br />\ntion<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nnew trimness, never before possible.<br />\nPHILIP W. HOWARD, '25<br />\nKEEPS THE HAIR IN PLACE<br />\nIt keeps your hair looking at all<br />\nthe principal characteristic of<br />\nManaging Editor<br />\nGreek and Latin writing—should<br />\nALGER HISS, '26<br />\nAdvertising Manager<br />\nFKI<br />\nbe<br />\nobserved even in .English verse.<br />\nInc., Dept.<br />\nAssistant Managing Editor<br />\nALFRED J. McKAY, '26<br />\nries,<br />\nYork.City<br />\nborato<br />\nOne of the minor points to be noted<br />\ngenerous<br />\nStreet,<br />\nERNEST A. STRATHMAN, '26<br />\nStandard La<br />\nWest18thfree of charge, a<br />\nin<br />\nthe<br />\nwriting<br />\nof<br />\nside<br />\nmechanical<br />\n113<br />\nManager<br />\nCirculation<br />\nme,<br />\nAssociate Editors<br />\nStacorab.<br />\nPlease send<br />\nof<br />\nis the \"look of the letter\"—the imsaraPle tube<br />\nBENJAMIN T. ROME, '25<br />\nOTHO J. KELLER, III, '26<br />\nARTHUR L. NELSON, '26<br />\npression of a printed word on the<br />\nmind from its form rather than its<br />\nJunior Editors<br />\nAssistant Business Managers<br />\nEDWARD 0. MICHEL, '26<br />\ndictionary meaning.<br />\nG. DONALD GMSKE, '25<br />\nJAMES YOUNG, '25<br />\nThe chief strength of poetry lies,<br />\nHENRY R. TURNBULL, '26<br />\nJ. JACKSON KIDD, '26<br />\nJAY TO APPEAR ON<br />\nA. RISLEY ENSOR, '26<br />\nthe lecturer, in verbal sounds BLUE<br />\nsaid<br />\nT. STRAN SUMMERS, '25<br />\n10; FOUR NEW<br />\nNOV.<br />\nJ. HENRY JARRETT, '27<br />\n—the effect on the ear—and in verHEYWARD E. BOYCE, JR., '27<br />\nCHARLES F. REESE, '27<br />\nELECTED<br />\nMEN<br />\nROBERT 'Iv. SAUERWEIN, '26<br />\nW. BARNES HALL, '27<br />\nbal sense—the effect on the mind.<br />\n'27<br />\nSWANSON,<br />\nARTHUR<br />\nWILLIAM E. THONISEN, JR., '26<br />\nMetre, which is a \"pattern in Bortner, Kerns, Dennis, and Dalsemer<br />\nElected<br />\nsounds,\" and rhythm, the \"diversiAt a recent meeting of the<br />\nfication of metre\"are the twochief<br />\nDamon—<br />\nMember Southern Intercollegiate Newspaper Association<br />\n\"Do you really think that a<br />\nmechanical aids to the sonorous side Black and Blue Jay staff four new<br />\ngood pencil helps you to do<br />\nbetter work?\"<br />\nof verse. This pattern in verse is men were elected to the business<br />\nPythias—<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md. the result of man's unconscious<br />\n\"I know it does! Why. I'm<br />\nstaff. The men whose work has<br />\neven able to read my own<br />\nlonging for symmetry. \"Throughhandwriting, now that I've<br />\nstarted using a Dixon's<br />\nout nature there is the instinctive earned them positions on the<br />\nEldorado!\"<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 31, 1924<br />\nstriving after what man calls plan, board are Bortner, '27; Kerns,<br />\npattern, beauty,\" said Mr. De La '27; Dennis, '27, and Dalsemer,<br />\nMare. Rythm is in man's blood. '28. George Hess resigned as CirVie masterdratdogpencil'<br />\nBut man loathes monotony, he tries<br />\nculation Manager because of his<br />\n17<br />\nleads- —all dealers<br />\nA PRIZE FOR POETRY<br />\nto invent or discover a pattern in<br />\nother<br />\nduties<br />\nthe<br />\nwith<br />\nHullabaloo.<br />\n. -\"<br />\n1111r<br />\nIn order to encourage the writing of verse by students at Hopkins the regular tick of a clock or the<br />\nPhilip Sachs, '28, was elected to<br />\nmeasured<br />\nclick<br />\na<br />\ncarof<br />\nrailway<br />\nA friend of THE NEWS-LETTER has offered a prize of fifteen dollars in<br />\nriage. Unconsciously, in moments succeed him.<br />\ngold, open to all undergraduates, for the best piece of poetry published in of stress, men speak in rythm.<br />\nNovember 10 is the date set for<br />\nTHE NEWS-LETTER during the year 1924-1925. The conditions of the To secure the best in \"verbal<br />\nthe next issue. The staff is parprize are such that the winner is to be picked by a member of the Fac- sense\" an author must grasp the<br />\nticularly pleased with the general<br />\nulty, who has been selected as judge by the Editor of THE NEWS-LETTER. delicate shades of difference beof the old members<br />\nimprovement<br />\nWith the gift comes a request that the winner be designated \"Poet Laure- tween words.<br />\nand the good showing of the<br />\n\"Plain prose.- he concluded,<br />\nate of Johns Hopkins.\"<br />\nfreshmen.<br />\nfor plain thoughts, but on\"suffices<br />\nthis<br />\ntakes<br />\nNEWS-LETTER<br />\nprize<br />\nTHE<br />\nthis<br />\nof<br />\ndonor<br />\nTo the generous<br />\nCo-operation of the Editorial<br />\nly a noble form of an utterance that<br />\nwith the Art staff has<br />\nmeans of expressing its heartiest appreciation.<br />\nDepartment<br />\nis noble.\" A poem is \"a flowing unthe improvement of<br />\nin<br />\nresulted<br />\nencumbered patterned speech.\"<br />\nthe art to a noticeable degree.<br />\nSanford's<br />\nWhereas, before, the art staff was<br />\nHOPKINS WILL CLASH WITH<br />\nPEN!<br />\nfounAINFLOWING<br />\nGEORGE WASHINGTON<br />\nhandicapped by the last minute<br />\nSANFORD MFG.CO.<br />\nIN FAVOR OF REVIVAL<br />\nContinued from page 1<br />\n\"The<br />\nsubmission of editorial copy, they<br />\nand has been credited with one are now given a better opportuniINK<br />\nIn the old days, which.our Alumni delight in recalling, scholarship<br />\nother because of an off-side pen- ty to work through the earlier<br />\nstuthe<br />\nthe<br />\nof<br />\ninterest<br />\nin<br />\nposition<br />\nprominent<br />\nundoubtedly held a more<br />\n(That Made the Fountain Pen POSSIBLE\"'<br />\nalty. \"Doug,\" however, has a presentation of material.<br />\nAla<br />\ndent than it does at the present time. Love of knowledge, which burned dangerous competitor in LeibenIncluded in the idea of general<br />\nso intensely in the hearts of college students but a few generations back, sperger, whose kick-offs and extra improvement is the installation of<br />\nseemed to demand a respect for those men who had won distinction by point kicks were a feature of the two new departments. One of<br />\nLATEST STYLES AND FORMS<br />\nEngraved<br />\ntheir scholarship. The popular idea that colleges have become too com- game. The tackle had a perfect these is the department for \"Dragoals<br />\nplacement<br />\nthree<br />\naverage<br />\nof<br />\nare<br />\nactivities<br />\nextra-curricular<br />\nCriticism,\"<br />\nmatic<br />\nthat<br />\nwhich,<br />\nunder<br />\nthe<br />\nof<br />\nstudy<br />\nintensive<br />\nmercialized for<br />\nWEDDING INVITATIONS,<br />\nin three trys. He bids fair to step capable leadership of Alger Hiss,<br />\nANNOUNCEMENTS AND<br />\nusurping the former position of scholarship, is indeed a question to be left<br />\ninto Turnbull's shoes when the president of the Barnstormers,<br />\nVISITING CARDS<br />\nto individual decision. However true these current theories may be, it latter graduates.<br />\nwill consider the popular plays<br />\nH. KIRBY<br />\nis certainly regrettable that the old respect for professors has been so<br />\nTomorrow may give the Home- coming to this city. The other is SAMUEL<br />\nENGRAVER<br />\nfar lost as to be noticeable.<br />\nwood supporters their first chance established for . the purpose of<br />\nSamples and Prices on Request<br />\nAt Hopkins, not many years ago, it was a custom among all stu- to cheer until their throats are Book Reviews under Henry R.<br />\n42 SOUTH sf.<br />\nBALTIMORE<br />\ndents to raise their hats to the professors as a sign of respect for them. hoarse. Each preceding game has Turnbull.<br />\nThis was a cherished tradition and many upperclassmen regret that such been somewhat one-sided but with<br />\nFurthermore, this next issue,<br />\nlast year's shining defeat behind the \"Fraternity and Football\"<br />\nobActual<br />\nUniversity.<br />\nour<br />\nat<br />\nout<br />\ndying<br />\nfast<br />\nis<br />\ncustom<br />\nadmirable<br />\nan<br />\nthem, George Washington may number, will reach the unusual<br />\nj._F. APPLE CO.<br />\nservance reveals the fact that only a few undergraduates of \"the old<br />\nJEWELERS<br />\nMANUFACTURING<br />\nspring a surprise.<br />\nsize of 32 pages. The efforts of<br />\nschool\" remain.<br />\nLANCASTER, PA.<br />\nthe advertising department are Class<br />\nRings, Pins, Fraternity Pins, Cups,<br />\nWhile, obviously, regulations can be enforced only upon first-year PITTSBURGH-HOPKINS MEN ORlargely resonsible for this inMedals, Etc.<br />\nGANIZE<br />\nwisdom<br />\nthe<br />\nrealize<br />\nbehind the<br />\nmen, it is hoped that upperclassmen will<br />\ncrease. They deserve credit for Stationery, Invitations, Programmes<br />\nContinued from page 1<br />\n\"MAKERS OF THE VARSITY SEALS\"<br />\ninsertion by the Student Council of the clause in the Freshmen RegulaL. 0. Grondahl, Bartow Griffiss, their activity.<br />\ntions pertaining to this courtesy to professors and will do their part Rowland S. Briggs, M. D.; RichMany Freshmen, some of whom<br />\ntradition.<br />\nhonorable<br />\nthis<br />\nin reviving<br />\nard T. Eearl, Charles E. MacFar- worked on preparatory school<br />\nCollege and Fraternity Stationery<br />\nlane, Richard E. Marine, Frank E. publications, are out for the vari- Banquet and Dance Cards, Invitations<br />\nReader, Charles Grieder, Edward ous departments of the magazine.<br />\nJAS. H. DOWNS<br />\nP. Van Kirk, George L. Winslow, Of 'these there are many hard ENGRAVER<br />\nPRINTER STATIONER<br />\nTHE NEWS-LETTER wishes to announce the reappointment Frank Orbin and Dorsey Bran- workers and men who show a<br />\n229 N. CHARLES ST.<br />\npleasing display of talent.<br />\nof William E. Thomsen, Jr., '26, to the position of Junior Editor. nan M. I).<br />\n<br />\nCollege men and women now.<br />\nkeep their hair fashionably smooth<br />\n<br />\nH<br />\n<br />\nEtEADxcm<br />\noR o<br />\n<br />\nRef 1 With<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 31, 1924<br />\n<br />\nErnest G.Leimbach<br />\n2819 Greenmount Avenue<br />\n(Opposite Ilchester)<br />\nA high-grade Haberdashery Shop<br />\nWithin Walking Distance of the<br />\nUniversity<br />\n<br />\nUPTOWN<br />\nQUALTIES<br />\n<br />\nDOWNTOWN<br />\nPRICES<br />\n<br />\nTHE NEWS-LETTER<br />\nMAILBAG<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\nOPEN EVENINGS<br />\n<br />\nTHE WIND AND THE MOON<br />\nBRANCH<br />\n<br />\nSaid the wind to the moon, on a AT THE BARN<br />\nmid-winter's night,<br />\n\"Come let us have a game,<br />\nI will blow my hardest to put out<br />\nyour light,<br />\nAnd you, to resist me with all of<br />\nyour might,<br />\nWill try to shine forth just the<br />\nsame!\"<br />\n<br />\nDOUG TURNBULL<br />\n<br />\nPOETS AND STUDENTS<br />\n<br />\nTo the Editor:<br />\n<br />\n3<br />\n<br />\nRepresentatives<br />\n<br />\nThe moon consented; the game had<br />\nbegun,<br />\nAnd oh, what a sight to behold!<br />\nThe wind bent trees in her furious<br />\nfun,<br />\nBut the moon still shone (though<br />\nthe race was not won)<br />\nWith • bright beams silver and<br />\ngold.<br />\n<br />\nGalles • Custom Ouality.<br />\n14 N.Citarles reet<br />\n<br />\nTOM MAGILL,<br />\nManager<br />\n<br />\nThe Turnbull Lectures on poetry are outstanding events of the<br />\nBaltimore's Best Store<br />\nUniversity year—for the female<br />\ncitizens of Baltimore. The lecHOCHSCHILDKOHN<br />\nturers however are usually men<br />\nwho have something to say, or<br />\nHoward and Lexington<br />\nSOPHOMORES<br />\nmight have something to say, of<br />\nFRESHMEN<br />\ninterest to the members of the<br />\nUniversity itself. Yet no proviThe wind then, with a tempestuous<br />\nsion is made for University audipuff, ences. It may be that those in<br />\nBlew a cloud over the moon,<br />\ncharge of the lectures are of the<br />\nand individuality is offered here at prices that are not<br />\n\"I have won,\" he cried, \"you have<br />\nand cannot be underquoted by any house at any time.<br />\nopinion that they are beneath the<br />\nhad enough!\"<br />\nRESTAURANT<br />\nattention of serious people, and<br />\n41Besides the reputation of an old-established firm<br />\nBut the moon, not cowed by this reis back of each sale with a guarantee.<br />\nare<br />\nmerely<br />\nconcessions<br />\nvulto<br />\nthe<br />\nSt.<br />\nCharles<br />\n1817 N.<br />\nbuff,<br />\ngar • and- unenlightened taste.<br />\nWilled not to yield so soon.<br />\nHowever that may be, the practical situation is that the Univer- For through<br />\nthe fleecy cotton white<br />\nOpen All Hours<br />\nFURNITURE<br />\nDECORATIONS<br />\nsity is practically excluded from<br />\nDRAPERIES<br />\nOf the drifting cloud,<br />\nthe lectures. In some years, half- One lone ray<br />\nshone out dazzling<br />\n343 NORTH CHARLES STREET<br />\nhearted attempts have been made<br />\nbright<br />\nCampus<br />\nNear Your<br />\nto reserve a few chairs for .mem- That lit like day the frosty<br />\nnight,<br />\nhers of the faculty, but even the<br />\nAnd cheered black winter's<br />\nProfessors, profiting by their past<br />\nshroud!<br />\nunsuccessful attempts to attend,<br />\nLouis P. HAMBURGER, JR.<br />\nare g,enerfally - discouraged from<br />\nfresh trials. When Dr. Gayley<br />\nR. 0. T. C. NOTES<br />\nlectured, a number of Professors<br />\nsucceeded in Igaining admission<br />\nThe cap device which was anby bribing their wives to go an<br />\nXfrecyrneravelie and Cutaw<br />\nhour early and hold seats for nounced in the News-Letter on<br />\n\"Where Wholesale and Retail Districts Meet\"<br />\nthem: a performance that even October 14 is showing poor redutiful wives shrink from after sults. Eight designs have been<br />\nonce braving the wrathful looks submitted so far.<br />\n(and voices) of feminine competiA small chart, about a foot<br />\n222 & 224 W Baltimore St.<br />\ntors for seats. Neither faculty nor<br />\nsquare, which hangs outside the<br />\nstudents have time to go an hour<br />\nmilitary office, is responsible for<br />\nIf your fountain<br />\nor an hour and a half before the<br />\nmuch of the improvement shown<br />\nlectures in<br />\nthe<br />\ntime<br />\nfor<br />\nscheduled<br />\npen has hardeninamacom===<br />\nby the freshmen companies.<br />\norder to pre-empt seats before the<br />\ning<br />\nof the arteries<br />\nAfter each drill, the best comavalanche of flappers and clubpany of the day gets a red mark<br />\nwomen arrive; or, if they have<br />\non the chart. This system creates<br />\ntime, there must be something<br />\ngreat competition between the<br />\nradically wrong with the Univercompanies, and causes. more intersity work.<br />\n\"THE WONDER MOTOR MI:<br />\nest to be taken in the work.<br />\nAssuming that those who arThe new caps have all arrived<br />\nrange the lectures are right in<br />\nand<br />\nare now being distributed in<br />\nSHERWOOD BROTHERS, INC.<br />\ntheir apparent assumption that<br />\nthe north loft. The loft has been<br />\nthe Turnbull lectures are too trivrearranged, and there may be a litial to warrant the attention of<br />\ntle trouble in locating equipment.<br />\nUniversity men, is it not possiChevrons are on hand for those<br />\nble that the lecturers would have<br />\nwho rate them, and new uniforms<br />\nsomething more worthy to say to<br />\nwill soon be here.<br />\nan exclusively University audience if a single lecture were arranged for it? Other colleges and to walk on the grass. There is such<br />\nOES your pen refuse to feed<br />\nuniversities before whom these flagrant abuse of this rule that<br />\nsame men have lectured have be- something should be done towards<br />\nthe right amount of ink<br />\nlieved this: why do we think its enforcement; or, what would be<br />\nwhen you start to write?<br />\notherwise? Or do we?<br />\nbetter, towards making conditions<br />\nThose who are enthusiastic such that students could go where<br />\nTake the cap off your fountain<br />\nover poetry do not need stimula- they wanted in a nearly straight<br />\npen. Is the feed section clean<br />\ntion. They will cut laboratory course.<br />\nand lecture, and go to other<br />\nand dry or does it smear a gummy<br />\nMonday I stood in front of the<br />\nlengths to attend such lectures. Barn from twenty-eight minutes afmass on your fingers?<br />\nDo we want to encourage the ma- ter twelve o'clock until two minutes<br />\njority, who have not this enthusi- after one—a period of one-half<br />\nUse Skrip and correct your founasm, to take a little interest in hour. In this short time 106 used<br />\nMade By The<br />\ntain pen troubles.<br />\nORDERS RECEIVED FOR<br />\npoetry? Or do we really think the dirt path leading from the Barn<br />\nCreators of<br />\n\"Lifetime\"<br />\n(as we obviously seem to think) to the upper quadrangle. Of these<br />\nMade in brilliant colors of blue, Pens and Penthat poetry is really a contempti- 106 there were: 3 professors, 3 fecils.<br />\nviolet, green and red.<br />\nble subject, and that interest in it male students, 21 freshmen, and 79<br />\nTransfer & Baggage Express<br />\nis a pitiable weakness in a scien- undergraduates—which count exAUTOMOBILE SERVICE<br />\ntific man?<br />\ncludes janitors. And the same conPHONE, HOMEWOOD 6886<br />\nS. -R. O. dition exists to an even worse extent in the method of approach towards the Chemical Laboratory<br />\nSTATISTICS AND THE PATHS<br />\nBuilding.<br />\nSHIRTS<br />\nNECKWEAR<br />\nTo the Editor of THE NEWSThese are facts, they cannot be<br />\nLETTER:<br />\ndisputed. The thing to do is to find<br />\nDear Sir: In the assembly but a remedy. There are only two, they<br />\n421 N. HOWARD ST.<br />\nPENS \"LIFETIME\" PENCILS<br />\ntwo weeks past, Dean Ames are:<br />\nHOSIERY<br />\nGLOVES<br />\nwattled, no, even forbade students<br />\nContinued on page 4, col. 2<br />\nW. A.SHEAFFER PEN CO., Fort Madison,Iowa<br />\n<br />\nSENIORS<br />\nJUNIORS<br />\n<br />\ngc Co.<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nSt. Regis<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nWARNER & CO.<br />\nHatters<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\n<br />\nHATS—OVERCOATS<br />\nNECKWEAR<br />\n<br />\nIETIIOLI1<br />\n<br />\nLondon Pipes<br />\nCollege Styles<br />\nMilano and handmade and many<br />\nOthers at<br />\nThe Barn<br />\n<br />\nD<br />\n<br />\nCOGGIN'S<br />\n<br />\nSold by The Better Dealers &verywhere<br />\n<br />\nLeFranc 8z Ault<br />\n<br />\nSHEAFFEI(S<br />\n<br />\n\f4<br />\nEDWARDS, S. A. RECORD<br />\nHOLDER, RETURNS TO<br />\nHOPKINS<br />\n<br />\n• THE JOHNS HOPKINS NEWS-LETTER, OCTOBER 31, 1924<br />\nMAILBAG<br />\n<br />\nEllgRAVERS<br />\n<br />\nPRMTERS<br />\n<br />\nBlUDE.RS<br />\n<br />\nContinued from page 3<br />\n(1) That students use the cir-<br />\n<br />\nTheSlickestCoatontheCampus!<br />\ndindtdroacithiciont<br />\n<br />\nZeigler, Who Pushed Clarke to World's cuitous routes of the roads or of<br />\nRecord, A Student at Hopkins;<br />\nthe provided paths.<br />\nMany Report for Practice<br />\n<br />\n(2) That the paths the students<br />\nEleven veterans of last year's<br />\nnow<br />\nuse be covered with cinders or<br />\nsquad have reported to preliminary<br />\nhave<br />\na boardwalk built over them.<br />\ntrack practice held Tuesday and<br />\nThe<br />\nfirst will not work, the secFriday afternoons. These practices<br />\nwill;<br />\nond<br />\nmay I suggest that the<br />\nare primarily for the purpose of<br />\ncinders<br />\nor<br />\nboards be laid as soon<br />\nlimbering up, and putting the men<br />\nas<br />\npossible?<br />\ninto condition for the indoor seaVery truly yours,<br />\nson. Of course, the chief objective<br />\nN. C. D.<br />\nRegiHopkins-Fifth<br />\nannual<br />\nis the<br />\nposalso<br />\na<br />\nthere<br />\nis<br />\nment meet, but<br />\nsibility of the team entering the THE FLAG, BANNER AND<br />\nPENNANT SHOP<br />\nWilco Games and several other<br />\nSuccessors<br />\nto SISCO BROTHERS<br />\nmeets. The cross-country team<br />\nFlags, Banners, Pennants, Arm<br />\nwill not be organized this year.<br />\nBands, Emblems, Church and Society<br />\nGold, Silver and Antique<br />\nThe team will be strengthened Goods, Fringes,<br />\nTassels, Beads and<br />\nBraids,<br />\nmaterially by the addition of Ridge- Novelties.<br />\nly Edwards, holder of the South Silk Banners for Schools, Societies,<br />\nand Fraternities<br />\nAtlantic half-mile record, who is<br />\nR. H. TAYLOR<br />\npursuing graduate courses. Cap302 Park Avenue<br />\ntain Heyn will compete in the pole Baltimore, Md.<br />\nVernon 2355<br />\nvault, dashes and hurdles; Meredith and Baurenschmidt, the middle distances, while Gwynn, Stevens<br />\nand Thatch, a freshman, will take<br />\ncare of the longer grinds. Proctor<br />\nand Black are the jumpers on the<br />\nsquad, while Conning and Brown<br />\nwill be on hand for the hurdles.<br />\nWeight men are Strauss and Wales.<br />\nThe outstanding stars among the<br />\nnew men are Zeigler, the Central<br />\nHigh sprinter; the Scheidt brothers, Kohr, Harris and Benton, a<br />\nhalf-miler from Canterbury High.<br />\nZeigler, it will be recalled, was the<br />\nman who forced Louis Clarke to<br />\nhis world's indoor record last winter.<br />\nWhile there are no brilliant performers such as Booth and Clarke<br />\non the squad this year, the team<br />\nwill be particularly well balanced<br />\nand should be able to win many<br />\nmatches. The schedule, which is being prepared by Manager Donaldson, will be announced in a later<br />\nissue Of THE NEWS-LETTER.<br />\nRUSHING SEASON TO BEGIN<br />\nMONDAY MORNING AT<br />\nEIGHT O'CLOCK<br />\nEight peals from the chimes in<br />\nGilman Hall echoing down the<br />\ncampus next Monday morning<br />\nvvill be the official herald of the<br />\nrushing season. The bars will be<br />\ndown, and keen-eyed fraternity<br />\nmen will start the search for goggle-eyed rushees.<br />\nThis momentous event was the<br />\nsubject discussed at the meeting<br />\nof the Interfraternity Board held<br />\nlast Monday. Particular emphasis<br />\nwas put upon the previsions of the<br />\nrushing agreement. All fraternities were reminded of these rules<br />\nfor the \"rushing\" of new members.<br />\nThe attention of the Board has<br />\nbeen directed to the failure of<br />\nsome fraternity men to observe<br />\nand comply with the \"Gentlemen's<br />\nAgreement\" by which all fraternities have honorably bound themselves. This agreement states in<br />\nsubstance that: \"Fraternity men<br />\nwill not make the nomination of a<br />\nfraternity brother for any elective<br />\noffices in the University.\" Every<br />\nrepresentative .has been urged to<br />\nagain announce the agreement to<br />\ntheir chapters.<br />\nAccording to Article II of the<br />\nBy-Laws, an assessment of one<br />\ndollar will be levied upon any fraternity absent from a regular<br />\nmeeting of the Board. All representatives should be present at the<br />\nnext meeting,. which will be held<br />\non Wednesday, November 5, in<br />\n104 M. E. at 12.20 P. M.<br />\n<br />\nREG.v.S.PAT<br />\n<br />\nNo well dressed college man is<br />\nwithout one. It's the original,<br />\ncorrectslicker and there'snothing as smart or sensible for<br />\nrough weather and chilly days.<br />\nMade offamous yellow waterproof oiled fabric. Has allround strap on collar and elastic at wrist-bands.<br />\nClasp-closing style<br />\nButton-closing style<br />\nStamp the correctnamein your<br />\nmemory, and buy no other.<br />\nThe \"Standard Student\" is<br />\nmade only by the Standard<br />\nOiled Clothing Co., N.Y. C.<br />\n<br />\nPrinters of<br />\n<br />\nSlip one on at<br />\n<br />\ncrhe Johns Hopkins<br />\nNEIDS.-LETTER<br />\n<br />\nLO M BARD<br />\n<br />\nand<br />\n<br />\nSOUTH<br />\n<br />\nALL GOOD DEALERS<br />\n<br />\nSTREETS<br />\n<br />\n__.<br />\n<br />\n==--)11:%, elf--...,_-_-_-;, itiflii<br />\n-_--,;.- vrz--:_-, - -A7<br />\n,-,_-4.<br />\n'-'-----___<br />\nM111111(1111111111110,<br />\n---- ,Itfs'i.-,..------------____-777,.--.<br />\n<br />\nCenters and (11 uarterb cks<br />\n(<br />\n.401<br />\n<br />\nCA- GOOD basketball center or football<br />\nquarterback knows more than the resources<br />\nof his team. He knows what resources to<br />\ncall upon at decisive moments. To him,<br />\nthe condition of his opponents,their weight<br />\nand style of play, the time left to go—all<br />\ndictate a strategy, which he follows.<br />\nThere is in industry a group of engineers<br />\nwhose position resembles that of field<br />\ngeneral. They keep their eyes continuously<br />\nupon all fields of human activity. They<br />\nobserve how each is affected by changing<br />\neconomic situations. They calculate what<br />\ndemands the future will make upon each.<br />\nThen they bring to its aid new discoveries<br />\nand beneficial methods.<br />\nIn 1886, George Westinghouse saw that<br />\nindustrial growth could not be furthered<br />\nby direct current alone. The \"game\" required a new style of play. So when the<br />\nrudiments of a transformer came along—<br />\n<br />\nopening the way for alternating current,<br />\nWestinghouse adopted both, perfected<br />\nthem, and paved the way for the electrical<br />\nera of the present time.<br />\nIn an organization like Westinghouse,<br />\nthese \"quarterbacks of industry\" are called<br />\n\"application engineers\". They are mechanical and electrical engineers who apply the<br />\nforces of electricity to every variety of<br />\nhuman need.<br />\n<br />\nWestinghouse application engineers first<br />\napplied motors to the steel industry, the<br />\ntextile industry, the automobile industry.<br />\nThey introduced electricity to railroads<br />\nand ships. They developed it for heating<br />\npurposes.<br />\nApplication engineers are needed in industry — they fill an important and expanding place. Westinghouse service to<br />\nindustry starts with their efforts.<br />\n<br />\nACHIEVEMENT8 OPPORTUNITY<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXIX, No 9<br /><br />\nHOMEWOOD, BALTIMORE. MD., OCTOBER 31, 1924<br /><br />\nPRICE 5 CENTS<br /><br />\nDR. EDMUNDS ON WESTERN CALHOUN ELECTED<br />\nSOPHOMORE CLASS ADOPTS SEA-WALNUTS AND<br />\nHOPKINS WILL CLASH WITH<br />\nSENIOR PRESIDE]% T<br />\nTOUR TO AROUSE<br />\nMEASURES REGARDING<br />\nEAGLE'S NEST FOUND<br />\nGEORGE WASHINGTON<br />\nWilliam C. Calhoun was elected<br />\nALUMNI<br />\nJellyfish, sea-walnuts and an<br />\nFRESHMEN<br />\nTOMORROW<br />\npresident of the Senior Class at a<br />\neagle's<br />\nnest.<br />\nProvost Has Erected Tower in Botanical<br />\nPep Committee is Reorganized; Annual<br />\nBlue Jays May Start With Devereux At<br />\nspecial class meeting held WedGardens for Purpose of Taking<br />\nThese were the three unusual<br />\nAthletic Clashes Planned<br />\nQuarter to Improve Aerial<br />\nPictures of University<br />\nAt Meeting<br />\nnesday at noon. Calhoun defeated<br />\nAnd Running Attack<br />\nobjects sought by the Field Club<br />\nIntense interest has centered Kelso Morrill by a margin of 20<br />\nThe Sophomore Pep Commit- when six members, accompanied<br />\n•<br />\nPROBABLE LINE-UP:<br />\naround a structure in the north- votes. The official count was Cal- tee promises to keep regulations by Dr. Andrews and Mr. Everett<br />\nHopkins<br />\nGeo. Washington<br />\nwest corner of the botanical gar- houn, 72 votes; Morrill, 52 votes.<br />\nin force among the class of 1928. C. Myers, took a trip to the Sev- No. Player<br />\nPos.<br />\nPlayer No.<br />\ndens. The question \"What's it<br />\nA Senior Class by-law requirern River last Saturday.<br />\n2 Mallonee ...L.E.<br />\nZoller 13<br />\nfor?\" has passed among the stu- ing a majority in. all elections At a recent meeting of the com- The eagle's nest was inspected 13 Magill (C.)..L.T.<br />\nLoeb 9<br />\n11<br />\nOles<br />\nL G .(C.) Hottel 20<br />\ndents and even the wisest of facul- made the special meeting neces- mittee, plans were discussed for from an observation platform built 4 Day<br />\nc<br />\nClements 18<br />\nty sages have interrupted lengthy sary, as Calhoun had only a plu- the most efficient methods of car- high in the air opposite the nest. 3 Slowik .....R.G..... Fletcher<br />\n23<br />\nRT<br />\nMiller 8<br />\ndiscourses to inquire the purpose rality over Morrill in the regular rying out the freshman regula- The eagles are of the American, 7 Levy<br />\nBerndt<br />\n.R E.<br />\nBowen .22<br />\nof this building which resembles a fall elections. Others in the field tions. The<br />\nTaylor ....Q.B..... McLain 1<br />\nmost favorable plan or Bald-headed, species and have 15<br />\n6 Turnbull ..L.H.B..... Wagner 2<br />\nminiature oil derrick. At last the withdrew, leaving only Morrill<br />\nlived in the vicinity of their home 20 Sauerw'n ..R.H.B..... Mallone 3<br />\nwas as follows:<br />\nstory has leaked Out.<br />\n10 Blandi<br />\nF B.<br />\nand Calhoun, the latter being<br />\nLaux 16<br />\n1. Freshmen will be held respon- for the past 30 or 40 years, it is<br />\nDr. Edmunds, the- provost of the elected on the first ballot.<br />\nsaid.<br />\nIt will be Hopkins against the<br />\nsible for all requirements.<br />\n1-T,niversity, who is on an extended<br />\nMany specimens of sea-walnuts<br />\n2.'Sophomores are privileged to and jellyfish were found<br />\ntour of the west, with his assist- PITTSBURGH-HOPKINS MEN<br />\nremade<br />\nGeorge Washington team<br />\nnear the<br />\nant, W. H. Moore, who was Edquestion any Frosh, but not to river.<br />\nat Homewood tomorrow. With a<br />\nORGANIZE ALUMNI<br />\nitor-in-Chief of the 1923 Newsbad year of football behind them,<br />\npaddle him.<br />\nASSOCIATION<br />\nLetter, is concerned in the mys3. Sophomores will report to the MONTEBELLO<br />\nPLANT<br />\nIS the Washington eleven has blosK. Edmunds Addresses<br />\ntery. The portable structure was Dr. Charles<br />\nMeeting Of Thirty Hopkins<br />\nVIEWED<br />\nHOPKINS<br />\nBY<br />\nsom-ed forth and taken a new lease<br />\npep committee names of any freshbuilt for the purpose of taking picGraduates<br />\nSTUDENTS<br />\non life this year. It is the same<br />\nmen<br />\nwho<br />\nfound<br />\nto<br />\nare<br />\nbe<br />\nunfatures, at a diagonal, of the botanReports from Pittsburgh indiical gardens. Now, however, the cate that on Friday night, Octo- miliar with the Who's Who, etc. Electricity for Baltimore Generated college that fell so ingloriously beForty Miles Away, At Holtwood,<br />\nfore the Blue Jays last fall,61 to 6.<br />\nProvost is on a trip for the purpose ber 24, • 30 of the 84 Johns Hop- 4. The pep committee will meet<br />\nPennsylvania<br />\nof organizing the alumnae. He kins alumni residing in that city the men whose<br />\nOne of the largest and best This season, however, they prenames are handed<br />\nwill pass through Pittsburgh, Chi- met at the University Club of<br />\nequipped<br />\nfiltration plants in the sent a different aspect because of<br />\nin at a secret place and make them<br />\ncago, Milwaukee, Madison, Indi- Pittsburgh and formed an alumni<br />\nUnited<br />\nStates<br />\nwas inspected by the defeat they administered<br />\ncome to terms.<br />\nanapolis, St. Louis and Chicago, association. Dr. Charles K. Edmembers of the Sanitary Engineer- Western -Maryland, a strong team,<br />\n5. Any freshman who does not<br />\nattending banquets and making munds, Provost, who was the<br />\ning course at Hopkins when the and their 41-to-0 victory over AlSpeeches to the alumnae gathered speaker for the evening, told of appear will be brought before the class visited the Montebello Filters, bright.<br />\nin the respective cities who are the distinctive work. in research Student Council.<br />\nShift In Backfield Likely<br />\nat Baltimore, Monday, October 27.<br />\nWhether<br />\ninterested in a better organization carried on in all departments of<br />\nthe Blue Jays will sufThe local plant is now supplying<br />\nTuesday Chosen As \"Pep Day\"<br />\nof that body. Not until November the University.<br />\nfer<br />\na<br />\nrelapse<br />\nfrom their present<br />\nThough the spirit of .the fresh- regularly about 110,000,000 gal10 or later wil be return to this<br />\nFollowing the organization of man class as a whole is greatly im- lons of water a day to residents of splendid form remains to be seen.<br />\nCity.<br />\nthis city. Additions and improve- The slight injuries to Oles and<br />\nthe association, officers were<br />\nOn his tour the Provost will ex- unanimously chosen as follows: proved, the committee has its eyes ments which are now under course Magill, however, will not keep<br />\nhibit pictures that he has taken of Dr. Thomas S. Baker, A. B., '91, on three or four men who are not of construction are expected to these men out of the game and<br />\nthe University. Pictures_ of his Ph. D.,.!95, President of Carnegie getting into the spirit of the regu- practically double this rate.<br />\nHopkins will 'probably take tile<br />\nAlma Mater should stir in every Institute of Technology, president lations. These men will be brought<br />\nfield<br />\nwith last week's line-up inFollowing the course of the waalumnus a desire to do more in of the association; Thomas Fitz- to account if they are not careful, ter through the filtration plant it tact. The only change in the backthe future than he has done in the gerald, A. II, '98, General Mana- says Eddie Day.<br />\ncan be seen that water as delivered field may be the addition of DevPast for his University.<br />\nIt was also decided to inaugu- to the city can no longer be classed ereux as quarterback, in which<br />\nger of Pittsburgh Railways, secNow we return to the tower. retary; Dr. Clifford C. Hartman, rate a \"Pep Day\" on which the as a product of nature, but is in case Walker Taylor will be moved<br />\nPictures taken from This will be M. D., '11, treasurer.<br />\nregulations would be enforced to reality a manufactured article. ,.kf- to the right halfback position. The<br />\nPlaced in the collection that Dr. The meeting, which was a most the utmost. This does not mean ter traveling seven miles through a reason for this possible change lies<br />\nEdmunds has ordered to be placed enthusiastic one, was attended by that there will be a let-up on the tunnel, the water is sucked up by in Devereux's running ability,<br />\nOn sale tomorrow in the postoffice, Dr. Thomas S. Baker, E. Mac- other days of the week, but that pumps, which are operated by elec which last Saturday was superior<br />\nthe dormitories and the Book coun,<br />\nTheodore Baker, M. D.; L. more attention than usual will be tricity, generated forty miles away, to any of the present backs.<br />\nStore. The Doctor had planned to C. Bixler, M. D.; A. A. Born- turned toward the matter on Tues- at Holtwood, Pa. Upon entering Whether he will also take up Taytake these pictures on the Satur- sheuer, M. D.; Frank A. Evans, days.<br />\nthe plant, chemicals are added to lor's signal-calling duties is doubtday before he left for his trip, but<br />\nM, D.; Thomas Fitzgerld ; H. B. Pep was the keynote of a meet- the water, which congeal the sus- ful. This combination would prehe was unable to complete his arGardner, M. D.; S. J. Glass, Jr., ing of the sophomore class pended matter and collect with it sent a formidable aerial attack a:,<br />\nrangements. Therefore, the struc- M. D.; C. C. Hartman, M. D.; R. held Monday, October 27. Coach most of the bacteria. The next step both Taylor and Devereux are exture must stand for at least two S. Major, M. D.; Watson Mar- Keen of the freshman baseball is to settle out most of the chemi- cellent passers and receivers. Tayweeks in the far corner of the gar- shall, M. D.; W. T. Mitchell, Jr.. team warned the sophomores cals with the heavier particles of lor may also prove the man Coach<br />\ndens as a memorial to the high M. D.; S. B. Myers, C. S. Palmer, that the freshmen were getting too suspended matter and prepare the Van Orman has been searching<br />\nWater mark of curiosity.<br />\nself-confident, and that a defeat to water for filtration in the coagu- for to fill the right halfback posiContinued on page 2 coL 3<br />\nthe class baseball team would \"take lating basins. The remainder of tion. •<br />\nTWENTY-FOUR TONS COAL AVERAGE CONSUMPTION them down a peg or two.\" .This the chemicals and suspended matHopkins' Opponents Improve<br />\nWhen George Washington was<br />\nFOR ONE DAY AT HOPKINS<br />\nview was upheld by Niner of the ter, together with most of the bacWhile standing in front of the really the \"screenage\" or the fine football squad who urged all can- teria, are removed from the water added to the schedule it wasintendBarn many piles of coal may be particles that are \"screened\" off didates to report on November •10. by the filters. After filtration the ed that an easy game should prewater is perfectly clear, but as an cede the St. John's contest the folAppointments Made<br />\nseen on the lot adjoining the from the hard coal. On the lot, at<br />\nprecaution a small lowing week. When St. John's enadditional<br />\nSeveral<br />\nappointments<br />\nwere<br />\nthis time, are about 900 tons of<br />\nPowerhouse. Students were inquichlorine is inject- countered so much difficulty in<br />\nliquid<br />\namount<br />\nof<br />\nthis screenage. It will soon be made, Broening being placed in<br />\nsitive to know how many tons are<br />\ncompletely ster- getting a team together the first<br />\ned<br />\nthe<br />\ninto<br />\nto<br />\nwater<br />\nmixed in the rpoper proportion charge of the Frosh-Soph rush;<br />\npart of the season it looked as<br />\nthere, how many tons are used in with the soft coal and used.<br />\nPassario, chairman of the smoker lize it.<br />\na winter, and several other ques- . The coal is used wisely. It runs committee, and Rosenfeld, chairthough<br />\nneither team would preFollowing the inspection of the<br />\nsent<br />\ngreat opposition. Now, howtions concerning the coal supply the giant turbines which make the man of the debating committee. filtration plant proper the party visof the University. After a rather electricity at two cents per kilo- The most important, however, ited the new unit now under con- ever, both teams rise before the<br />\nthorough investigation was made, watt. As the electricity that is was the appointment of a new pep struction. As this is still in a pre- Blue Jays like black clouds on the<br />\nthe following interesting facts furnished by the Gas and Electric committee. This consisted of Day, liminary stage, a good first hand horizon and neither can be taken<br />\n.Were found:<br />\nCompany would cost three cents chairman; Hines, Ward.well, Mc- view of the design of such a plant lightly.<br />\n\"Doug\" Turnbull, after a bad<br />\nThe coal supply of the Universi- a kilowatt, a great saving is made Neal, Ward, Lord, Kleff, Alt, was obtained.<br />\nstart, has gradually been approachty comes from the Emerson-Mor- by this system. Then, the exhaust Grinsfelder, Broening, Gassaway,<br />\ngan Coal Company and the Con- steam that would otherwise be Dempsey, France, McAllister and STUDENT COUNCIL MEETS ing his last season's place-kicking<br />\nsolidation Coal Company. It conDue to a conflict on the time of form. ,Turnbull has booted ten<br />\nwasted in that complex process of Niner.<br />\nsists of 3,000 tons each of anthra- making electricity, is used for<br />\nIn regard to dues, the class de- meeting, only two members of the goals ,out of seventeen attempts,<br />\ncite and bituminous, or a total of heat. This eliminates the special cided to follow the lead of the Council answered to roll call, FriContinued on page 2, col. 3<br />\n6,000 tons in eight months. This boilers and other parts that are so juniors in making the payment of day afternoon. Because of the abNOTICE<br />\nmeans that twenty-four tons of vital to a steam-heating plant. clues come under the Honor Sys- sence of the other members, MaImportant meeting of members<br />\ncoal are consumed each day. At Moreover, the exhaust steam has tem . In this way the individual is gill and Turnbull merely discussed<br />\nand candidates for Barnstormers<br />\nClub in Studio, today at 12.20.<br />\nthe present times, because of the been found to heat all the build- not required to pay his dues at cer- plans for the Frosh-Soph football<br />\nWarm weather, the mixture is not ings as efficiently as possible. tain required times, but instead is game, December 6. Officials for<br />\nThe Johns Hopkins Zionist<br />\nSociety smoker will be held Sunan even amount of both kinds of Thus the coal supply of the Uni- placed upon his honor to have all the game are: Magill, referee;<br />\nday evening at the Y. M. H. A.,<br />\ncoal but consists of 400 of hard to versity is led through a very inter- his dues paid up by the end of the Turnbull, umpire, and Parsons,<br />\nMadison Ave., at North. Everybody invited.<br />\n200 of soft. Also, the hard coal is esting and economical course.<br />\nyear.<br />\nhead linesman.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 31, 1924<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\n\"CRAFTSMANSHIP IN VERSE\"<br />\nSUBJECT OF DE LA<br />\nMARE LECTURE<br /><br />\nFOUNDED 1897<br /><br />\nEnglish Poet \"Discusses Technical Side<br />\nOf Poet's Art in Fifth Lecture<br /><br />\n\"Craftsmanship in Verse\" was<br />\nsubject of Walter De La Mare's<br />\nthe<br />\n$2.00<br />\nSubscription<br />\nfifth lecture under the Percy Turnbull Memorial Lectureship last<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at Tuesday in the C. E. Hall.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nTo understand the craftsmanship<br />\nof a poem, Mr. De La Mare said,<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nwe must \"fraction by fraction take<br />\nHopkins University.<br />\nit to pieces.\" During the course of<br />\nthe lecture well-known poems, less<br />\nBusiness communications should be addressed to the BUSINESS MAN- respected jingles, and extempore<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nwork of Mr. De La Mare's were<br />\nshould be sent to the MANAGING Enrron.<br />\nyou want it to<br />\nsubjected to this dissection.<br />\nER smooth,lustrous hair, done times just the way and<br />\nnon-greasy.<br />\nfashionable plainness in look. Non-staining<br />\nwith<br />\nTechnical names and the pedantdrug and<br />\nHomewood 0100<br />\nlines that follow closely the shape of In jars and tubes. At all<br />\nTelephone<br />\ndepartment stores.<br />\nry of verse Mr. De La Mare treatthe head....<br />\nHis well-kept hair,alwaysin place,<br />\ned rather jokingly, but very famililways trim, neatly parted, naturallooking ..<br />\niarly. He observed that some attenBusiness Manager<br />\nEditor-in-Chief<br />\nStacomb is responsible for this<br />\nquantity—<br />\nas<br />\nknown<br />\nis<br />\nwhat<br />\nto<br />\ntion<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nnew trimness, never before possible.<br />\nPHILIP W. HOWARD, '25<br />\nKEEPS THE HAIR IN PLACE<br />\nIt keeps your hair looking at all<br />\nthe principal characteristic of<br />\nManaging Editor<br />\nGreek and Latin writing—should<br />\nALGER HISS, '26<br />\nAdvertising Manager<br />\nFKI<br />\nbe<br />\nobserved even in .English verse.<br />\nInc., Dept.<br />\nAssistant Managing Editor<br />\nALFRED J. McKAY, '26<br />\nries,<br />\nYork.City<br />\nborato<br />\nOne of the minor points to be noted<br />\ngenerous<br />\nStreet,<br />\nERNEST A. STRATHMAN, '26<br />\nStandard La<br />\nWest18thfree of charge, a<br />\nin<br />\nthe<br />\nwriting<br />\nof<br />\nside<br />\nmechanical<br />\n113<br />\nManager<br />\nCirculation<br />\nme,<br />\nAssociate Editors<br />\nStacorab.<br />\nPlease send<br />\nof<br />\nis the \"look of the letter\"—the imsaraPle tube<br />\nBENJAMIN T. ROME, '25<br />\nOTHO J. KELLER, III, '26<br />\nARTHUR L. NELSON, '26<br />\npression of a printed word on the<br />\nmind from its form rather than its<br />\nJunior Editors<br />\nAssistant Business Managers<br />\nEDWARD 0. MICHEL, '26<br />\ndictionary meaning.<br />\nG. DONALD GMSKE, '25<br />\nJAMES YOUNG, '25<br />\nThe chief strength of poetry lies,<br />\nHENRY R. TURNBULL, '26<br />\nJ. JACKSON KIDD, '26<br />\nJAY TO APPEAR ON<br />\nA. RISLEY ENSOR, '26<br />\nthe lecturer, in verbal sounds BLUE<br />\nsaid<br />\nT. STRAN SUMMERS, '25<br />\n10; FOUR NEW<br />\nNOV.<br />\nJ. HENRY JARRETT, '27<br />\n—the effect on the ear—and in verHEYWARD E. BOYCE, JR., '27<br />\nCHARLES F. REESE, '27<br />\nELECTED<br />\nMEN<br />\nROBERT 'Iv. SAUERWEIN, '26<br />\nW. BARNES HALL, '27<br />\nbal sense—the effect on the mind.<br />\n'27<br />\nSWANSON,<br />\nARTHUR<br />\nWILLIAM E. THONISEN, JR., '26<br />\nMetre, which is a \"pattern in Bortner, Kerns, Dennis, and Dalsemer<br />\nElected<br />\nsounds,\" and rhythm, the \"diversiAt a recent meeting of the<br />\nfication of metre\"are the twochief<br />\nDamon—<br />\nMember Southern Intercollegiate Newspaper Association<br />\n\"Do you really think that a<br />\nmechanical aids to the sonorous side Black and Blue Jay staff four new<br />\ngood pencil helps you to do<br />\nbetter work?\"<br />\nof verse. This pattern in verse is men were elected to the business<br />\nPythias—<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md. the result of man's unconscious<br />\n\"I know it does! Why. I'm<br />\nstaff. The men whose work has<br />\neven able to read my own<br />\nlonging for symmetry. \"Throughhandwriting, now that I've<br />\nstarted using a Dixon's<br />\nout nature there is the instinctive earned them positions on the<br />\nEldorado!\"<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 31, 1924<br />\nstriving after what man calls plan, board are Bortner, '27; Kerns,<br />\npattern, beauty,\" said Mr. De La '27; Dennis, '27, and Dalsemer,<br />\nMare. Rythm is in man's blood. '28. George Hess resigned as CirVie masterdratdogpencil'<br />\nBut man loathes monotony, he tries<br />\nculation Manager because of his<br />\n17<br />\nleads- —all dealers<br />\nA PRIZE FOR POETRY<br />\nto invent or discover a pattern in<br />\nother<br />\nduties<br />\nthe<br />\nwith<br />\nHullabaloo.<br />\n. -\"<br />\n1111r<br />\nIn order to encourage the writing of verse by students at Hopkins the regular tick of a clock or the<br />\nPhilip Sachs, '28, was elected to<br />\nmeasured<br />\nclick<br />\na<br />\ncarof<br />\nrailway<br />\nA friend of THE NEWS-LETTER has offered a prize of fifteen dollars in<br />\nriage. Unconsciously, in moments succeed him.<br />\ngold, open to all undergraduates, for the best piece of poetry published in of stress, men speak in rythm.<br />\nNovember 10 is the date set for<br />\nTHE NEWS-LETTER during the year 1924-1925. The conditions of the To secure the best in \"verbal<br />\nthe next issue. The staff is parprize are such that the winner is to be picked by a member of the Fac- sense\" an author must grasp the<br />\nticularly pleased with the general<br />\nulty, who has been selected as judge by the Editor of THE NEWS-LETTER. delicate shades of difference beof the old members<br />\nimprovement<br />\nWith the gift comes a request that the winner be designated \"Poet Laure- tween words.<br />\nand the good showing of the<br />\n\"Plain prose.- he concluded,<br />\nate of Johns Hopkins.\"<br />\nfreshmen.<br />\nfor plain thoughts, but on\"suffices<br />\nthis<br />\ntakes<br />\nNEWS-LETTER<br />\nprize<br />\nTHE<br />\nthis<br />\nof<br />\ndonor<br />\nTo the generous<br />\nCo-operation of the Editorial<br />\nly a noble form of an utterance that<br />\nwith the Art staff has<br />\nmeans of expressing its heartiest appreciation.<br />\nDepartment<br />\nis noble.\" A poem is \"a flowing unthe improvement of<br />\nin<br />\nresulted<br />\nencumbered patterned speech.\"<br />\nthe art to a noticeable degree.<br />\nSanford's<br />\nWhereas, before, the art staff was<br />\nHOPKINS WILL CLASH WITH<br />\nPEN!<br />\nfounAINFLOWING<br />\nGEORGE WASHINGTON<br />\nhandicapped by the last minute<br />\nSANFORD MFG.CO.<br />\nIN FAVOR OF REVIVAL<br />\nContinued from page 1<br />\n\"The<br />\nsubmission of editorial copy, they<br />\nand has been credited with one are now given a better opportuniINK<br />\nIn the old days, which.our Alumni delight in recalling, scholarship<br />\nother because of an off-side pen- ty to work through the earlier<br />\nstuthe<br />\nthe<br />\nof<br />\ninterest<br />\nin<br />\nposition<br />\nprominent<br />\nundoubtedly held a more<br />\n(That Made the Fountain Pen POSSIBLE\"'<br />\nalty. \"Doug,\" however, has a presentation of material.<br />\nAla<br />\ndent than it does at the present time. Love of knowledge, which burned dangerous competitor in LeibenIncluded in the idea of general<br />\nso intensely in the hearts of college students but a few generations back, sperger, whose kick-offs and extra improvement is the installation of<br />\nseemed to demand a respect for those men who had won distinction by point kicks were a feature of the two new departments. One of<br />\nLATEST STYLES AND FORMS<br />\nEngraved<br />\ntheir scholarship. The popular idea that colleges have become too com- game. The tackle had a perfect these is the department for \"Dragoals<br />\nplacement<br />\nthree<br />\naverage<br />\nof<br />\nare<br />\nactivities<br />\nextra-curricular<br />\nCriticism,\"<br />\nmatic<br />\nthat<br />\nwhich,<br />\nunder<br />\nthe<br />\nof<br />\nstudy<br />\nintensive<br />\nmercialized for<br />\nWEDDING INVITATIONS,<br />\nin three trys. He bids fair to step capable leadership of Alger Hiss,<br />\nANNOUNCEMENTS AND<br />\nusurping the former position of scholarship, is indeed a question to be left<br />\ninto Turnbull's shoes when the president of the Barnstormers,<br />\nVISITING CARDS<br />\nto individual decision. However true these current theories may be, it latter graduates.<br />\nwill consider the popular plays<br />\nH. KIRBY<br />\nis certainly regrettable that the old respect for professors has been so<br />\nTomorrow may give the Home- coming to this city. The other is SAMUEL<br />\nENGRAVER<br />\nfar lost as to be noticeable.<br />\nwood supporters their first chance established for . the purpose of<br />\nSamples and Prices on Request<br />\nAt Hopkins, not many years ago, it was a custom among all stu- to cheer until their throats are Book Reviews under Henry R.<br />\n42 SOUTH sf.<br />\nBALTIMORE<br />\ndents to raise their hats to the professors as a sign of respect for them. hoarse. Each preceding game has Turnbull.<br />\nThis was a cherished tradition and many upperclassmen regret that such been somewhat one-sided but with<br />\nFurthermore, this next issue,<br />\nlast year's shining defeat behind the \"Fraternity and Football\"<br />\nobActual<br />\nUniversity.<br />\nour<br />\nat<br />\nout<br />\ndying<br />\nfast<br />\nis<br />\ncustom<br />\nadmirable<br />\nan<br />\nthem, George Washington may number, will reach the unusual<br />\nj._F. APPLE CO.<br />\nservance reveals the fact that only a few undergraduates of \"the old<br />\nJEWELERS<br />\nMANUFACTURING<br />\nspring a surprise.<br />\nsize of 32 pages. The efforts of<br />\nschool\" remain.<br />\nLANCASTER, PA.<br />\nthe advertising department are Class<br />\nRings, Pins, Fraternity Pins, Cups,<br />\nWhile, obviously, regulations can be enforced only upon first-year PITTSBURGH-HOPKINS MEN ORlargely resonsible for this inMedals, Etc.<br />\nGANIZE<br />\nwisdom<br />\nthe<br />\nrealize<br />\nbehind the<br />\nmen, it is hoped that upperclassmen will<br />\ncrease. They deserve credit for Stationery, Invitations, Programmes<br />\nContinued from page 1<br />\n\"MAKERS OF THE VARSITY SEALS\"<br />\ninsertion by the Student Council of the clause in the Freshmen RegulaL. 0. Grondahl, Bartow Griffiss, their activity.<br />\ntions pertaining to this courtesy to professors and will do their part Rowland S. Briggs, M. D.; RichMany Freshmen, some of whom<br />\ntradition.<br />\nhonorable<br />\nthis<br />\nin reviving<br />\nard T. Eearl, Charles E. MacFar- worked on preparatory school<br />\nCollege and Fraternity Stationery<br />\nlane, Richard E. Marine, Frank E. publications, are out for the vari- Banquet and Dance Cards, Invitations<br />\nReader, Charles Grieder, Edward ous departments of the magazine.<br />\nJAS. H. DOWNS<br />\nP. Van Kirk, George L. Winslow, Of 'these there are many hard ENGRAVER<br />\nPRINTER STATIONER<br />\nTHE NEWS-LETTER wishes to announce the reappointment Frank Orbin and Dorsey Bran- workers and men who show a<br />\n229 N. CHARLES ST.<br />\npleasing display of talent.<br />\nof William E. Thomsen, Jr., '26, to the position of Junior Editor. nan M. I).<br /><br />\nCollege men and women now.<br />\nkeep their hair fashionably smooth<br /><br />\nH<br /><br />\nEtEADxcm<br />\noR o<br /><br />\nRef 1 With<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 31, 1924<br /><br />\nErnest G.Leimbach<br />\n2819 Greenmount Avenue<br />\n(Opposite Ilchester)<br />\nA high-grade Haberdashery Shop<br />\nWithin Walking Distance of the<br />\nUniversity<br /><br />\nUPTOWN<br />\nQUALTIES<br /><br />\nDOWNTOWN<br />\nPRICES<br /><br />\nTHE NEWS-LETTER<br />\nMAILBAG<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nOPEN EVENINGS<br /><br />\nTHE WIND AND THE MOON<br />\nBRANCH<br /><br />\nSaid the wind to the moon, on a AT THE BARN<br />\nmid-winter's night,<br />\n\"Come let us have a game,<br />\nI will blow my hardest to put out<br />\nyour light,<br />\nAnd you, to resist me with all of<br />\nyour might,<br />\nWill try to shine forth just the<br />\nsame!\"<br /><br />\nDOUG TURNBULL<br /><br />\nPOETS AND STUDENTS<br /><br />\nTo the Editor:<br /><br />\n3<br /><br />\nRepresentatives<br /><br />\nThe moon consented; the game had<br />\nbegun,<br />\nAnd oh, what a sight to behold!<br />\nThe wind bent trees in her furious<br />\nfun,<br />\nBut the moon still shone (though<br />\nthe race was not won)<br />\nWith • bright beams silver and<br />\ngold.<br /><br />\nGalles • Custom Ouality.<br />\n14 N.Citarles reet<br /><br />\nTOM MAGILL,<br />\nManager<br /><br />\nThe Turnbull Lectures on poetry are outstanding events of the<br />\nBaltimore's Best Store<br />\nUniversity year—for the female<br />\ncitizens of Baltimore. The lecHOCHSCHILDKOHN<br />\nturers however are usually men<br />\nwho have something to say, or<br />\nHoward and Lexington<br />\nSOPHOMORES<br />\nmight have something to say, of<br />\nFRESHMEN<br />\ninterest to the members of the<br />\nUniversity itself. Yet no proviThe wind then, with a tempestuous<br />\nsion is made for University audipuff, ences. It may be that those in<br />\nBlew a cloud over the moon,<br />\ncharge of the lectures are of the<br />\nand individuality is offered here at prices that are not<br />\n\"I have won,\" he cried, \"you have<br />\nand cannot be underquoted by any house at any time.<br />\nopinion that they are beneath the<br />\nhad enough!\"<br />\nRESTAURANT<br />\nattention of serious people, and<br />\n41Besides the reputation of an old-established firm<br />\nBut the moon, not cowed by this reis back of each sale with a guarantee.<br />\nare<br />\nmerely<br />\nconcessions<br />\nvulto<br />\nthe<br />\nSt.<br />\nCharles<br />\n1817 N.<br />\nbuff,<br />\ngar • and- unenlightened taste.<br />\nWilled not to yield so soon.<br />\nHowever that may be, the practical situation is that the Univer- For through<br />\nthe fleecy cotton white<br />\nOpen All Hours<br />\nFURNITURE<br />\nDECORATIONS<br />\nsity is practically excluded from<br />\nDRAPERIES<br />\nOf the drifting cloud,<br />\nthe lectures. In some years, half- One lone ray<br />\nshone out dazzling<br />\n343 NORTH CHARLES STREET<br />\nhearted attempts have been made<br />\nbright<br />\nCampus<br />\nNear Your<br />\nto reserve a few chairs for .mem- That lit like day the frosty<br />\nnight,<br />\nhers of the faculty, but even the<br />\nAnd cheered black winter's<br />\nProfessors, profiting by their past<br />\nshroud!<br />\nunsuccessful attempts to attend,<br />\nLouis P. HAMBURGER, JR.<br />\nare g,enerfally - discouraged from<br />\nfresh trials. When Dr. Gayley<br />\nR. 0. T. C. NOTES<br />\nlectured, a number of Professors<br />\nsucceeded in Igaining admission<br />\nThe cap device which was anby bribing their wives to go an<br />\nXfrecyrneravelie and Cutaw<br />\nhour early and hold seats for nounced in the News-Letter on<br />\n\"Where Wholesale and Retail Districts Meet\"<br />\nthem: a performance that even October 14 is showing poor redutiful wives shrink from after sults. Eight designs have been<br />\nonce braving the wrathful looks submitted so far.<br />\n(and voices) of feminine competiA small chart, about a foot<br />\n222 &amp; 224 W Baltimore St.<br />\ntors for seats. Neither faculty nor<br />\nsquare, which hangs outside the<br />\nstudents have time to go an hour<br />\nmilitary office, is responsible for<br />\nIf your fountain<br />\nor an hour and a half before the<br />\nmuch of the improvement shown<br />\nlectures in<br />\nthe<br />\ntime<br />\nfor<br />\nscheduled<br />\npen has hardeninamacom===<br />\nby the freshmen companies.<br />\norder to pre-empt seats before the<br />\ning<br />\nof the arteries<br />\nAfter each drill, the best comavalanche of flappers and clubpany of the day gets a red mark<br />\nwomen arrive; or, if they have<br />\non the chart. This system creates<br />\ntime, there must be something<br />\ngreat competition between the<br />\nradically wrong with the Univercompanies, and causes. more intersity work.<br />\n\"THE WONDER MOTOR MI:<br />\nest to be taken in the work.<br />\nAssuming that those who arThe new caps have all arrived<br />\nrange the lectures are right in<br />\nand<br />\nare now being distributed in<br />\nSHERWOOD BROTHERS, INC.<br />\ntheir apparent assumption that<br />\nthe north loft. The loft has been<br />\nthe Turnbull lectures are too trivrearranged, and there may be a litial to warrant the attention of<br />\ntle trouble in locating equipment.<br />\nUniversity men, is it not possiChevrons are on hand for those<br />\nble that the lecturers would have<br />\nwho rate them, and new uniforms<br />\nsomething more worthy to say to<br />\nwill soon be here.<br />\nan exclusively University audience if a single lecture were arranged for it? Other colleges and to walk on the grass. There is such<br />\nOES your pen refuse to feed<br />\nuniversities before whom these flagrant abuse of this rule that<br />\nsame men have lectured have be- something should be done towards<br />\nthe right amount of ink<br />\nlieved this: why do we think its enforcement; or, what would be<br />\nwhen you start to write?<br />\notherwise? Or do we?<br />\nbetter, towards making conditions<br />\nThose who are enthusiastic such that students could go where<br />\nTake the cap off your fountain<br />\nover poetry do not need stimula- they wanted in a nearly straight<br />\npen. Is the feed section clean<br />\ntion. They will cut laboratory course.<br />\nand lecture, and go to other<br />\nand dry or does it smear a gummy<br />\nMonday I stood in front of the<br />\nlengths to attend such lectures. Barn from twenty-eight minutes afmass on your fingers?<br />\nDo we want to encourage the ma- ter twelve o'clock until two minutes<br />\njority, who have not this enthusi- after one—a period of one-half<br />\nUse Skrip and correct your founasm, to take a little interest in hour. In this short time 106 used<br />\nMade By The<br />\ntain pen troubles.<br />\nORDERS RECEIVED FOR<br />\npoetry? Or do we really think the dirt path leading from the Barn<br />\nCreators of<br />\n\"Lifetime\"<br />\n(as we obviously seem to think) to the upper quadrangle. Of these<br />\nMade in brilliant colors of blue, Pens and Penthat poetry is really a contempti- 106 there were: 3 professors, 3 fecils.<br />\nviolet, green and red.<br />\nble subject, and that interest in it male students, 21 freshmen, and 79<br />\nTransfer &amp; Baggage Express<br />\nis a pitiable weakness in a scien- undergraduates—which count exAUTOMOBILE SERVICE<br />\ntific man?<br />\ncludes janitors. And the same conPHONE, HOMEWOOD 6886<br />\nS. -R. O. dition exists to an even worse extent in the method of approach towards the Chemical Laboratory<br />\nSTATISTICS AND THE PATHS<br />\nBuilding.<br />\nSHIRTS<br />\nNECKWEAR<br />\nTo the Editor of THE NEWSThese are facts, they cannot be<br />\nLETTER:<br />\ndisputed. The thing to do is to find<br />\nDear Sir: In the assembly but a remedy. There are only two, they<br />\n421 N. HOWARD ST.<br />\nPENS \"LIFETIME\" PENCILS<br />\ntwo weeks past, Dean Ames are:<br />\nHOSIERY<br />\nGLOVES<br />\nwattled, no, even forbade students<br />\nContinued on page 4, col. 2<br />\nW. A.SHEAFFER PEN CO., Fort Madison,Iowa<br /><br />\nSENIORS<br />\nJUNIORS<br /><br />\ngc Co.<br /><br />\nFURNITURE OF QUALITY<br /><br />\nSt. Regis<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nWARNER &amp; CO.<br />\nHatters<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br /><br />\nHATS—OVERCOATS<br />\nNECKWEAR<br /><br />\nIETIIOLI1<br /><br />\nLondon Pipes<br />\nCollege Styles<br />\nMilano and handmade and many<br />\nOthers at<br />\nThe Barn<br /><br />\nD<br /><br />\nCOGGIN'S<br /><br />\nSold by The Better Dealers &amp;verywhere<br /><br />\nLeFranc 8z Ault<br /><br />\nSHEAFFEI(S<br /><br />\n4<br />\nEDWARDS, S. A. RECORD<br />\nHOLDER, RETURNS TO<br />\nHOPKINS<br /><br />\n• THE JOHNS HOPKINS NEWS-LETTER, OCTOBER 31, 1924<br />\nMAILBAG<br /><br />\nEllgRAVERS<br /><br />\nPRMTERS<br /><br />\nBlUDE.RS<br /><br />\nContinued from page 3<br />\n(1) That students use the cir-<br /><br />\nTheSlickestCoatontheCampus!<br />\ndindtdroacithiciont<br /><br />\nZeigler, Who Pushed Clarke to World's cuitous routes of the roads or of<br />\nRecord, A Student at Hopkins;<br />\nthe provided paths.<br />\nMany Report for Practice<br /><br />\n(2) That the paths the students<br />\nEleven veterans of last year's<br />\nnow<br />\nuse be covered with cinders or<br />\nsquad have reported to preliminary<br />\nhave<br />\na boardwalk built over them.<br />\ntrack practice held Tuesday and<br />\nThe<br />\nfirst will not work, the secFriday afternoons. These practices<br />\nwill;<br />\nond<br />\nmay I suggest that the<br />\nare primarily for the purpose of<br />\ncinders<br />\nor<br />\nboards be laid as soon<br />\nlimbering up, and putting the men<br />\nas<br />\npossible?<br />\ninto condition for the indoor seaVery truly yours,<br />\nson. Of course, the chief objective<br />\nN. C. D.<br />\nRegiHopkins-Fifth<br />\nannual<br />\nis the<br />\nposalso<br />\na<br />\nthere<br />\nis<br />\nment meet, but<br />\nsibility of the team entering the THE FLAG, BANNER AND<br />\nPENNANT SHOP<br />\nWilco Games and several other<br />\nSuccessors<br />\nto SISCO BROTHERS<br />\nmeets. The cross-country team<br />\nFlags, Banners, Pennants, Arm<br />\nwill not be organized this year.<br />\nBands, Emblems, Church and Society<br />\nGold, Silver and Antique<br />\nThe team will be strengthened Goods, Fringes,<br />\nTassels, Beads and<br />\nBraids,<br />\nmaterially by the addition of Ridge- Novelties.<br />\nly Edwards, holder of the South Silk Banners for Schools, Societies,<br />\nand Fraternities<br />\nAtlantic half-mile record, who is<br />\nR. H. TAYLOR<br />\npursuing graduate courses. Cap302 Park Avenue<br />\ntain Heyn will compete in the pole Baltimore, Md.<br />\nVernon 2355<br />\nvault, dashes and hurdles; Meredith and Baurenschmidt, the middle distances, while Gwynn, Stevens<br />\nand Thatch, a freshman, will take<br />\ncare of the longer grinds. Proctor<br />\nand Black are the jumpers on the<br />\nsquad, while Conning and Brown<br />\nwill be on hand for the hurdles.<br />\nWeight men are Strauss and Wales.<br />\nThe outstanding stars among the<br />\nnew men are Zeigler, the Central<br />\nHigh sprinter; the Scheidt brothers, Kohr, Harris and Benton, a<br />\nhalf-miler from Canterbury High.<br />\nZeigler, it will be recalled, was the<br />\nman who forced Louis Clarke to<br />\nhis world's indoor record last winter.<br />\nWhile there are no brilliant performers such as Booth and Clarke<br />\non the squad this year, the team<br />\nwill be particularly well balanced<br />\nand should be able to win many<br />\nmatches. The schedule, which is being prepared by Manager Donaldson, will be announced in a later<br />\nissue Of THE NEWS-LETTER.<br />\nRUSHING SEASON TO BEGIN<br />\nMONDAY MORNING AT<br />\nEIGHT O'CLOCK<br />\nEight peals from the chimes in<br />\nGilman Hall echoing down the<br />\ncampus next Monday morning<br />\nvvill be the official herald of the<br />\nrushing season. The bars will be<br />\ndown, and keen-eyed fraternity<br />\nmen will start the search for goggle-eyed rushees.<br />\nThis momentous event was the<br />\nsubject discussed at the meeting<br />\nof the Interfraternity Board held<br />\nlast Monday. Particular emphasis<br />\nwas put upon the previsions of the<br />\nrushing agreement. All fraternities were reminded of these rules<br />\nfor the \"rushing\" of new members.<br />\nThe attention of the Board has<br />\nbeen directed to the failure of<br />\nsome fraternity men to observe<br />\nand comply with the \"Gentlemen's<br />\nAgreement\" by which all fraternities have honorably bound themselves. This agreement states in<br />\nsubstance that: \"Fraternity men<br />\nwill not make the nomination of a<br />\nfraternity brother for any elective<br />\noffices in the University.\" Every<br />\nrepresentative .has been urged to<br />\nagain announce the agreement to<br />\ntheir chapters.<br />\nAccording to Article II of the<br />\nBy-Laws, an assessment of one<br />\ndollar will be levied upon any fraternity absent from a regular<br />\nmeeting of the Board. All representatives should be present at the<br />\nnext meeting,. which will be held<br />\non Wednesday, November 5, in<br />\n104 M. E. at 12.20 P. M.<br /><br />\nREG.v.S.PAT<br /><br />\nNo well dressed college man is<br />\nwithout one. It's the original,<br />\ncorrectslicker and there'snothing as smart or sensible for<br />\nrough weather and chilly days.<br />\nMade offamous yellow waterproof oiled fabric. Has allround strap on collar and elastic at wrist-bands.<br />\nClasp-closing style<br />\nButton-closing style<br />\nStamp the correctnamein your<br />\nmemory, and buy no other.<br />\nThe \"Standard Student\" is<br />\nmade only by the Standard<br />\nOiled Clothing Co., N.Y. C.<br /><br />\nPrinters of<br /><br />\nSlip one on at<br /><br />\ncrhe Johns Hopkins<br />\nNEIDS.-LETTER<br /><br />\nLO M BARD<br /><br />\nand<br /><br />\nSOUTH<br /><br />\nALL GOOD DEALERS<br /><br />\nSTREETS<br /><br />\n__.<br /><br />\n==--)11:%, elf--...,_-_-_-;, itiflii<br />\n-_--,;.- vrz--:_-, - -A7<br />\n,-,_-4.<br />\n'-'-----___<br />\nM111111(1111111111110,<br />\n---- ,Itfs'i.-,..------------____-777,.--.<br /><br />\nCenters and (11 uarterb cks<br />\n(<br />\n.401<br /><br />\nCA- GOOD basketball center or football<br />\nquarterback knows more than the resources<br />\nof his team. He knows what resources to<br />\ncall upon at decisive moments. To him,<br />\nthe condition of his opponents,their weight<br />\nand style of play, the time left to go—all<br />\ndictate a strategy, which he follows.<br />\nThere is in industry a group of engineers<br />\nwhose position resembles that of field<br />\ngeneral. They keep their eyes continuously<br />\nupon all fields of human activity. They<br />\nobserve how each is affected by changing<br />\neconomic situations. They calculate what<br />\ndemands the future will make upon each.<br />\nThen they bring to its aid new discoveries<br />\nand beneficial methods.<br />\nIn 1886, George Westinghouse saw that<br />\nindustrial growth could not be furthered<br />\nby direct current alone. The \"game\" required a new style of play. So when the<br />\nrudiments of a transformer came along—<br /><br />\nopening the way for alternating current,<br />\nWestinghouse adopted both, perfected<br />\nthem, and paved the way for the electrical<br />\nera of the present time.<br />\nIn an organization like Westinghouse,<br />\nthese \"quarterbacks of industry\" are called<br />\n\"application engineers\". They are mechanical and electrical engineers who apply the<br />\nforces of electricity to every variety of<br />\nhuman need.<br /><br />\nWestinghouse application engineers first<br />\napplied motors to the steel industry, the<br />\ntextile industry, the automobile industry.<br />\nThey introduced electricity to railroads<br />\nand ships. They developed it for heating<br />\npurposes.<br />\nApplication engineers are needed in industry — they fill an important and expanding place. Westinghouse service to<br />\nindustry starts with their efforts.<br /><br />\nACHIEVEMENT8 OPPORTUNITY<br /><br />"}], "field_media_file": [{"target_id": 37901, "display": null, "description": null, "target_type": "file", "target_uuid": "bec94f7f-724a-45e5-b877-37c6df4b4ac9", "url": "http://digital.library.jhu.edu/system/files/2022-03/13139-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13139, "target_type": "node", "target_uuid": "16692f82-e10d-48c2-8e51-3183c0c240b7", "url": "/node/13139"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "ab346b81-051c-4a52-a211-95b67a48bfed"}]}