{"mid": [{"value": 36713}], "uuid": [{"value": "cbe0d162-9d62-4d70-be4b-730d4bad2b33"}], "vid": [{"value": 36713}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:52:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12991-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:52:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:52:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVI. No 37<br />\ne,<br />\nae<br />\nsLs.<br />\n0Le.<br />\npt<br />\nvger<br />\n<br />\n[al<br />\n70.<br />\n70.<br />\n<br />\ner<br />\nnd<br />\n0/.<br />\nne<br />\nin<br />\nor.<br />\ngn<br />\n50.<br />\n25.<br />\nP.<br />\n0.<br />\nw.<br />\n<br />\nPP.<br />\n50.<br />\nby<br />\n<br />\nnk.<br />\n<br />\noAr-<br />\n<br />\nBASEBALL PROSPECTS ARE<br />\nGOOD FOR SEASON OF<br />\n1922<br />\nCandidates Turning Out Nicely. Many<br />\nVeterans Back and in Form.<br />\n<br />\nThe baseball season for 1922 was<br />\nforinal:y ushered in at Homewoo,I<br />\nlast Friday afternoon, when candidates for the nine held their first<br />\nworkout under Coach Armstrong's<br />\ndirection. Practically all of las:<br />\nyear's veterans and about twenty<br />\nnew men, all former prep schoo.<br />\nplayers, turned out.' The workout<br />\nconsisted of a light throwing and<br />\nbatting practice, designed to loosen<br />\nup stiff muscles in preparation foi<br />\nthe hard work to follow.<br />\n\"Shad\" Sharretts, last year's captain and clean-up hitter on the team<br />\nfor several seasons, will be one of<br />\nthe mainstays in the outfield. Fred<br />\nRich, another veteran, will probably<br />\nhold down his old position in right<br />\ngarden, while Miles Marrian, Poly's<br />\n\"home-run king,\" will make a<br />\nstrong bid for the third outfield position.<br />\nOf last year's infield only \"Buck\"<br />\nGrace, at second, and Herb Reifschneider, at second, have survived<br />\nboth graduation and the blacklist.<br />\nErdman, a freshman, is showing<br />\ngood form at short and may push<br />\nReifschneider for his old position.<br />\nAmong the many candidates for first<br />\nbase, Bill Merrick, a substitute on<br />\nlast year's squad, is showing up<br />\nwell. As yet no one has shown suf-<br />\n<br />\nBALTIMORE, MD., MARCH 1 , 1922<br />\n<br />\nLET'S GO<br />\n<br />\nPRICE 5 CENTS<br />\nHOPKINS SWIMMERS TO PARTICIPATE IN EASTERN INTERCOLLEGIATES<br />\n<br />\nA THOUSAND A DAY<br />\n<br />\nBlack and Bliie Mermen to Make Strong<br />\nBid for Honors in Lehigh Pool.<br />\n<br />\n1. (An Approach) Mr. Blank, I want to talk to you a moment about out-of-doors and tell you about a<br />\nseries of real games that are going to take place at Hop rcins Field.<br />\n2. (An Approach) Mr. Blank, I'm a Hopkins Man. We are interested in enlarging attendance at our<br />\ngames and sports and in bringing to Baltimore, the best college teams in the country—and I believe that you<br />\nwill be interested in our plan (follow with the descrip on cf ticket and its features).<br />\n3. EPrg-'n F-atu- - of the ticket. Twenty-one games for the $5.00—at regular admission prices $10.00<br />\nworth for $5.00--two dollars for one.<br />\n4. On all week days other than Saturday, this ticket gives the privilege of bringing in a lady or ladies<br />\nfree. This is a worthwhile saving for any ticket buyer and is by itself worth the price.<br />\n5. At all times this ticket gives the holder the privilege of bringing in children under the age of 12 free.<br />\nTo an old college man this gives the opportunity for him to bring his children where they will get a healthy<br />\nview of true sportsmanship in its best expression.<br />\n6. This ticket is transferable, i. e., if you have an engagement on a certain day and cannot come out yourself, you can loan your ticket to a friend for that day and he wilj be able to take in the games.<br />\n7. (To Prep and High School Prospects.) Review all the privileges of the season ticket at five dollars,<br />\nbut the price to these is $2.00 and the ticket is non-transferable.<br />\n8. It costs money to bring the best teams here. Ralroad fares, food and shelter for visiting teams have to<br />\nbe provided and this money comes from these season tickets. Uniforms and the various tools and implements<br />\nused in the games have to be replaced—and to keep all these angles of outdoor sports at the point of efficiency,<br />\nwe must sell $15,000 worth.<br />\n9. Another point, the character of our audience is high class. A lady can be brought as a guest to any<br />\ngame on Hopkins field with the full knowledge that she is as safe from harm and as well surrounded with thoughtful friends as she would be in her own home.<br />\n10. Look at this schedule of games. It is crammed full of interest and exciting contests. Championship<br />\nLacrosse with Lehigh and Syracuse, and a game with Oxford, England. Baseball with the best college teams<br />\nand two outdoor meets thrown in for good measure.<br />\n11. Mr. Ticket Buyer, in the spring of the year you and every other man likes to be out of doors—how<br />\nmany times do you have the desire and yet do not go because you cannot think of any special place to go. Here<br />\nis an interesting place to go and spend an enjoyable afternoon.<br />\n12. Many big business men get the inspiration for their organizations from their observance of the spirit<br />\nof Fair Play and whole-souled enthusiasm which is a part of college sport at all times.<br />\n13. (To the Alumnus). Support Hopkins athletics and thus help the school that gave you its best. The<br />\nmore support our athletics get, the more widely known our college becomes and this in the end is both good for<br />\nthe university and the city.<br />\n14. (To the liusiness Man not an Alumnus). New Haven, Conn., is as well known in the United States as<br />\nmany cities much larger and appears in the newspapers of the country much more frequently than Baltimore<br />\nbecause it is the seat of Yale University. Support Hopkins athletics and help advertise Baltimore.<br />\n15. I am here as a Hopkins Student because I believe in my school and in its teams and college spirit.<br />\nI believe that these things are worth something to every citizen of Baltimore—if you buy one of these tickets<br />\nand come out, you will appreciate Hopkins as much as we do.<br />\nThese are a few of the many points you can bring out and use to sell these tickets. Do<br />\nnot use all your points at once. Ask for the order and show that you can give a receipt<br />\nfor his check—and if he does not buy then, go right ahead with some more points and<br />\ntry again.<br />\nRemember that PEP and College spirit will win this Campaign just as it wins games. Talk<br />\nto the Prospect confidently, positively and enthusiastically.<br />\n<br />\nTomorrow. night, with Lehigh,<br />\nRutgers, Swarthmore and possibly<br />\nStevens as opponents, the Black and<br />\nBlue swimmers will participate in<br />\nthe annual Eastern Intercollegiate<br />\nChampionships, to be held in the<br />\nLehigh pool.<br />\nRutgers, last year's Eastern Intercollegiate champions, again expect to make a strong bid for honors. They are captained by Giebel,<br />\nwho last year captured several first<br />\nplaces in the meet. In the NavyRutgers dual meet, Giebel defeated<br />\nSinclair, who holds the intercollegiate record in this event. The Rutgers star added to his laurels when<br />\nhe broke the Eastern Intercollegiate<br />\nfor the 100, negotiating the distance<br />\nin 59 seconds.<br />\nThe majorjty of the dopesters,<br />\nhowever, pick Lehigh to capture<br />\nthis year's laurels, due to their recent victory over the Rutgers mermen in a dual meet, which they<br />\ncaptured by a 42-29 score. Harmon,<br />\nof Lehigh, was the individual star<br />\nof this meet, capturing two firsts<br />\nand swimming on the victorious relay.<br />\n<br />\npolished<br />\n<br />\nE nthusiastic<br />\nP<br />\n<br />\nresentations<br />\n<br />\nwill sell<br />\n<br />\nSwarthmore's chances were considerably lowered with the announcement that Charlie Crownover, Olympic star, was in scholastic<br />\n<br />\nA THOUSAND A DAY<br />\nficient ability to hold down the hot<br />\ndifficulties, and in all probability<br />\ncorner, and competition among the<br />\nwill not be able to swim.<br />\nACTIVITIES<br />\nCENSUS<br />\nBE<br />\nTO<br />\nDR.<br />\nHOLLANDER<br />\nEXPOSES<br />\nA.<br />\nA. BOARD COMBINES<br />\nnew men for this position should be<br />\nThe ruling which restricts one<br />\nTAKEN BY PUBLICITY •<br />\nTHE FAULTS OF<br />\nDINNER AND BUSINESS<br />\nvery keen.<br />\ncontestant to two events will work<br />\nBOARD<br />\nSOCIALISM<br />\nMEETING<br />\nThe most promising boxmen are Accurate Records to be Kept. Plans<br />\nhardships on both Lehigh and RutHopkins Professor Gives Interesting Spring Ticket Sale's Success Determines<br />\nUnder Consideration for AdvertisAndy Knecht and Bill Tucker, who<br />\ngers. Giebel and Harmon in previLecture Before Social Science<br />\nFuture Policy. New Track<br />\ning Hopkins-Oxford Lacrosse<br />\nClub and Guests.<br />\nAwards Decided Upon.<br />\nwill probably handle the majority of<br />\nGame.<br />\nous meets have entered three or<br />\n\"Socialists<br />\nare<br />\nnot<br />\nalways<br />\nun<br />\nInstead<br />\nof<br />\nholding<br />\nthe<br />\nFollowing<br />\nrecommendation<br />\nof<br />\nMarchetti<br />\na<br />\nregular<br />\nspring.<br />\nthe pitching this<br />\nmore races. Here, however, the<br />\nshorn, red-shirted ruffians with<br />\nmonthly meeting di the Athletic<br />\nis another of last year's squad who the Omicron Delta Kappa Honorascope of their abilities will be limstick of dynamite in each pocket.' Board at the Barn on Monday<br />\nwill do part of the hurling, while ry Society, the Publicity Board will With this rather forceful remark,<br />\nnight, President Knecht marshalled ited ,and it will be necessary to find<br />\ntake a census of the recognized acMcMillan, of Poly, and Calhoun.<br />\ntivities of each man in the under- Dr. Jacob H. Hollander of th, his associates into dinner array other men to fill their suits.<br />\nof City, are candidates of unknown graduate school. Forms will be Hopkins faculty began his addres: and brought them out to Roland<br />\nHopkins has suffered defeat at<br />\nability at present. The biggest gap placed in the postoffice boxes to be ,vhich was entitled \"The Plight o Park to do full justice to the fine the hands of Swarthmore,<br />\nLehigh<br />\nin the team and the position that filled out in detail and returned. Socialism,\" last Tuesday afternoon meal Dr. Ronald T. Abercrombie, and<br />\nRutgers this season, although<br />\nWill be hardest to fill is the one be- The members of the Board particu- Another high light of his speed faculty member of the board, had<br />\nthe two former meets were lost by<br />\nhind the bat, left vacant by Bill larly<br />\nrequest that, inasmuch as there was his answer to the charge that provided.<br />\nextremely<br />\nclose scores, the former<br />\nWood. Candidates for this position are only a certain number of blanks, many of the Hopkins professors<br />\nThe<br />\nagreeable<br />\nsurroundings<br />\nare Mike Levin, substitute last<br />\nby a margin of two, and the latter<br />\nthe information returned be accu- are \"half-baked radicals.\" He said, made the proceedings of the board<br />\nYear; Oates, Asendorf and Bushey.<br />\n\"If<br />\nwe<br />\nuse<br />\nculinary terms, it is pleasanter in every way and con- by one point. The Black and Blue<br />\nrate and free of unnecessary huIn order to have the squad in<br />\noften better to be a 'half-baked rad- siderably more business than is swimmers may, however, spring<br />\nmorous material.<br />\nShape for the first game of the seaThe census takers desire a record ical' than a 'hard-boiled standpat- usually transacted was dispatched. several surprises. \"Davvy\" Rowson, which is with Dickinson on of the class, college course, home ter.'\"<br />\nThe big thing before the board land can be looked<br />\nupon to capApril 1, Coach Armstrong will di- and<br />\nat<br />\nHollander<br />\npresent is the spring season ticket<br />\nDr.<br />\nis<br />\na<br />\ntypical<br />\nHopcity address, fraternity and acture the breast stroke, as he is Eastrect practice every afternoon as<br />\ntivities of every undergraduate at kins man. He received both his sale drive, upon the success of<br />\nern Intercollegiate champion in this<br />\nlong as the weather is good. He<br />\nthe university. In an instance where A. B. and Ph. D. degrees here. which hinges all of the athletic polthe<br />\ncoaching<br />\nwil be geratly aided in<br />\na man is out for a team or a board From 1900 on he has been associ- icy for the remainder of the year. event. Coady in the 220, Buhrer<br />\nSquad by several members of the he is requested to report \"candidate ated with the Department of Polit- Plans for it is ready to<br />\nbe placed in the 50 and the 100 and Morrell<br />\n9,<br />\nOrioles and a few other profession- for<br />\nical Economy. As Treasurer of before the students and the NEWS- in the back stroke can be looked<br />\n.<br />\nals who will practice regularly with<br />\nThe records will be referred to Porto Rico in 1900, he revised the LETTER is today printing much of upon to furnish some close compethe team.<br />\nhereafter in compiling Hullabaloo laws concerning taxation and rev- the information prepared by Mr. tition and may<br />\nout-swim some of<br />\nother publication data. After enue for that island. In 1906, he Palmer.<br />\nand<br />\nNEW BLACK AND BLUE JAY OUT<br />\nthe favorites.<br />\nThe desire of many students to<br />\nSOON<br />\nthe filing of these forms, the rec- was special commissioner to Santo<br />\nThe following men will probably<br />\nThe fourth issue of the Black and ords will become a matter of regis- Domingo, and was later financial have track letters awarded as soon<br />\nBlue Jay will make its appearance tration, and in order to receive rec- adviser to the republic. During the as they are won will be realized represent Hopkins:<br />\nRelay—Coady, Rowland, Buhrer,<br />\nsometime before the end of next ognition, it will be necessary for the last election he was economical ad- only in so far as Seniors are conviser<br />\nto<br />\nRepublican<br />\nof<br />\nthe<br />\nBoard<br />\nCommitted<br />\ncerned.<br />\nthe<br />\nAs no Seniors who have Morrell or Lord.<br />\nWeek. Following this publication, individual to notify<br />\nThe substance of his speech is not already received letters have<br />\nan el ection of candidates for the additional honors. Upon graduation<br />\nPlunge—Hambleton.<br />\nwon them, none will be granted. 50-yard Dash—Buhrer,<br />\nBusiness Board will be held It has the student's card will be filed by as follows:<br />\nRowland.<br />\n\"The current interest in social- A certificate is being prepared for<br />\nbeen decided to postpone the elec- the University Registrar.<br />\nFancy Dive—Coady.<br />\nThe Board has been releasing in- ism is a natural accompaniment of presentation to men who b'reak<br />\ntion of the circulation manager un100-yard Dash—Buhrer, Johnstil later in the year, possibly waiting formation weekly both in form lots business depression. As in times Hopkins records that they may ton.<br />\n41161 next fall. Two more issues of and special articles. A campaign past, when the course of the eco- have some permanent memento of<br />\n220-yard Dash—Coady, Lord.<br />\nthe Blue Jay will appear before the is under contemplation to advertise nomic cycle brings us hard times, their record-breaking achievment.<br />\nBreast Stroke—Rowland, Dun\"R'l of the term, the next number, the coming Oxforl-Hopkins la- with attendant falling wages, un- W. Ridgely Edwards, Jr., 1922, ning.<br />\nthe last week in April, and the final crosse match. It will be necessary t•mployment, and working class dis- will be the first man to receive the Back Stroke—Hambleton, MorContinued on page 3, col. 1<br />\nContinued on page 2, ea 3<br />\nContinued on page 2, col. 5<br />\n()Ile about the first of June.<br />\nrell.<br />\n<br />\n\fTHE JOHN.,<br />\n<br />\n2<br />\n<br />\nACTIVITIES CENSUS TO BE TAKEN<br />\nBY PUBLICITY BOARD _<br />\nContinued 'tom Page 1, col. 2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897.<br />\n<br />\n$2.50<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\n<br />\nto draw a crowd of 2,000 spectators<br />\nto pay the expenses of the Britishers, and the Board has high hopes<br />\nof making it a success.<br />\nPages have been reserved in a<br />\nnumber of preparatory school magazines and space in the papers of<br />\nthose schools who have them. Bulletin boards will be installed in the<br />\nlocal prep schools as soon as possible.<br />\n<br />\nHomewood 100<br />\n<br />\nTelephone<br />\n<br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br />\n<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\n<br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br />\n<br />\nAssistant Managing Editor:<br />\nJ. HUDSON HUFFARD, '23<br />\nAssociate Editors:<br />\nELI FRANK, JR., '22.<br />\nCHARLES C. MARBURY,'22.<br />\nJunior Editors:<br />\nJOSEPH S. LEOPOLD, '24.<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br />\n<br />\nV.WS-LETTER, MARCH 10, 1922<br />\n<br />\nTwo pints one quart,<br />\nTwo quarts, one fight,<br />\nOne fight, two cops,<br />\nTwo cops, one Judge,<br />\nOne Judge, thirty days.<br />\n—Exchange.<br />\n<br />\nSKATING RINK AT PRINCETON<br />\n<br />\nAn ice-skating rink is being<br />\nerected on the campus of Princeton University.' It will have, when<br />\nfinished, a seating capacity for<br />\n2,500 people. In addition, it will<br />\ncontain two dressing rooms with<br />\nshowers and baths for visiting<br />\nteams. The ice is ready for skating now, but the building operations will not be completed until<br />\nspring.<br />\n<br />\nA. A. BOARD COMBINES DINNER<br />\nAND BUSINESS MEETING<br />\nContinued from page 1 col. 4<br />\n<br />\ncertificate and the privilege of wearing a Hopkins blue silk stripe with<br />\nhis letter on his jersey. Any man<br />\nwho breaks a record or wins a<br />\npoint in the intercollegiates will be<br />\nentitled, it was decided, to wear<br />\nthis stripe.<br />\nIt now seems. probable that all<br />\nSeniors who have been awarded<br />\nletters and have not qet received<br />\ntheir sweaters will get them within<br />\nHARD LUCK!<br />\na month. The Varsity Club reptonight;<br />\n\"Twins arrived<br />\nDr. Stewart and Mr.<br />\nsentatives,<br />\nHe<br />\nread<br />\nMore by mail.\"<br />\nMonday that the club<br />\nsaid<br />\nRay,<br />\nThis telegram his wife had sent,<br />\nupon the results of the<br />\nwaiting<br />\nwas<br />\nAn,d then—poor man—dropped<br />\ndrive before deciding<br />\nticket<br />\nspring<br />\ndead.<br />\nits<br />\nspring<br />\non<br />\nbudget.<br />\n—Exchange.<br />\n<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\n<br />\n•<br />\n<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN G. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br />\n<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nBALTIMORE, MD., MARCH 10, 1922<br />\n\"VALE\"<br />\nThis number of the NEWS-LETTER is the last to be issued under the<br />\npresent Board of Control, since the editor for 1921-22 takes charge today.<br />\nIt is not without a feeling of regret, in spite of the spring fever in<br />\nthe air, that the present editors lay down their pens. Our administration<br />\nhas lasted for almost two years, in which time the NEWS-LETTER has<br />\nsucceeded in wiping out the debt and in changing from a weekly to a<br />\nsemi-weekly publication. Other activities have not been idle and this<br />\nperiod has witnessed a remarkable development in undergraduate life.<br />\nThe campus is becoming more collegiate and an \"esprit de corps' is<br />\nrapidly being developed.<br />\nAmong the new activities which have appeared and seem well on<br />\nthe road to success are the Black and Blue Jay, the undergraduate<br />\norchestra and the student band. The athletic management has shown<br />\nmarked increase in efficiency and our teams have displayed corresponding<br />\nimprovement. The Student Publicity Board, recently organized, should<br />\ndo much to bring the undergraduate college before the public eye. Many<br />\nnew fraternities, engineering and other social societies have made their<br />\nappearance. A home for stray Greeks is now provided by Sigma Chi<br />\nBeta; and Omicron Delta Kappa is taking an active lead in affairs on the<br />\ncampus and is publishing a long needed Hopkins Song Book. A dormitory is still the most essential need of the Undergraduate Department<br />\nand the erection of this building and the new chemical laboratory at<br />\nHomewood should usher in a new era for the college.<br />\nMany of the changes which have taken place can be attributed either<br />\ndirectly or indirectly to the NEWS-LETTER. The Student Activities fee,<br />\nthe Varsity Seal, the 0. D. K. cup, the freshman activities button and<br />\nthe regulation requiring all freshmen to go out for an activity are<br />\nexamples. We have also done our best to bring about a change in the<br />\nmethod of class elections and in the entrance requirements, and have<br />\nadvocated the keeping of accurate records of each student's activity.<br />\nIn all things we have endeavored to present accurately the student opinion<br />\nand to promote undergraduate life.<br />\nOur period of activity is now over, and the new Board of Control<br />\ntakes up our work. We have the greatest confidence in their ability and<br />\nfeel sure that their efforts will be crowned with success.<br />\n<br />\nKeeping faith<br />\nwith the<br />\n<br />\nSMOKER<br />\nOur lifelong knowledge of choice<br />\ntobaccos, our years of manufacturing<br />\nexperience and our up-to-date facilities<br />\nare concentrated on making CAMELS<br />\nthe finest cigarette that can be produced.<br />\nInto THIS ONE BRAND we put the<br />\nUTMOST QUALITY. A better cigarette<br />\ncannot be made—even for a higher price.<br />\nCAMELisTHE QUALITY CIGARETTE<br />\nmade for men who think for themselves<br />\n—for folks who appreciate really fine<br />\ntobacco.<br />\nONE BRAND—ONE QUALITY ONE<br />\nSIZE PACKAGE.<br />\nThat is the way we keep faith with the<br />\nsmoker.<br />\n<br />\nELECTION ANNOUNCEMENTS<br />\nThe NEWS-LETTER announces with pleasure the following elections<br />\nW. H. Moore, Jr., Editor-in-Chief; G. P. Fallon, Business Manager;<br />\nJ. H. Huffard, Managing Editor; D. K. Vannemann, Advertising Manager; J. S. Leopold, Assistant Managing Editor; R. W. Baldwin, Associate Editor; G. C. Doub, T. C. Routson and C. Tilghman, Junior Editors, and P. Howard, M. D. Marrian, D. Gieske and D. H. Stevenson,<br />\nJr., Assistant Business Managers.<br />\n<br />\nR. .1, REYNOLDS TOBACCO CO.. Winitan•Salets. N.gi<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 10, 1922<br />\nANNOUNCEMENT OF THE<br />\nJAMES SCHOULER LECTURESHIP PROGRAM<br />\n<br />\n3<br />\n<br />\nSTUDENT BAND RECEIVES<br />\nDESERVED CONGRATULATIONS<br />\n<br />\nTeachers!<br />\n<br />\nEmil Smith, leader of the band,<br />\nsubmitted<br />\na petition some time ago<br />\nFriday, March 10—\"Aspects of<br />\nUY or rent a Corona<br />\ntypewriter on easy<br />\nthe Russian Revolution.\" Baron S. to the Student Activities Council,<br />\npayments. Carry it to<br />\nschool every day in its<br />\nA. Korff, formerly professor of requesting that the band be recogneat case. Make extra<br />\nmoney writing articles or<br />\nPublic Law in the University of nized as a legitimate college activity<br />\ndoing typing for others!<br />\nand as such should be given repreHelsingfors.<br />\nCall today at the nearest<br />\nCorona store—or teleThursday, March 16 \"Spanish sentation on the Council and should<br />\nphone for a demonstraEnglish Clothes Tailored in America<br />\ntion at your home.<br />\nAmerica: Its Culture and Ideals.\" have a certain number of Varsity<br />\nFor Snort, Dress<br />\n$30 to $45<br />\nDr. Victor Andres Belaunde, pro- Seals allotted to it. The Council<br />\nM. W. LUCY & CO.<br />\n118 W. Fayette St.<br />\nMt. Vernon 4999<br />\nfessor of Political .Science in the passed a resolution a short while<br />\nago<br />\nin<br />\nrecognizing<br />\nfavor of<br />\n\"Queen Quality\" Home Made<br />\nthe<br />\nUniversity of San Marcos, Lima,<br />\nWeighs G4lbs.<br />\nFolds and fits<br />\nChocolates<br />\nband. On Thursday this resolution<br />\nPeru.<br />\nin a neat carrycase.<br />\nVISIT OUR ICE CREAM PARLORS<br />\ning<br />\nThursday, March 23—\"China at will be passed on for the approval<br />\n518 N. CHARLES ST.<br />\nCommercial Photography<br />\n$An with<br />\nthe Conference.\" Dr. Westel W. of all the men in the university who<br />\ncase<br />\nCircuit Photography<br />\nWilloughby, professor of Political hold Varsity Seals. Secretary Lipps<br />\nFlash Lights<br />\nViews<br />\nScience in the Johns Hopkins Uni- has been<br />\ninstructed to see these men<br />\nGroups<br />\nEnlargemen<br />\nts<br />\nCharles and 22nd Sts.<br />\nversity.<br />\nKODAK<br />\nand obtain their votes. It will reFINISHING<br />\nDelicious Sodas and Sundaes<br />\nThe Personal Writing Machine<br />\nThe lectures will be given at 4.30<br />\n325 N. Howard St.<br />\nThe Best of Candies<br />\nquire two-thirds of all the votes<br />\no'clock in the hall of the Civil EnPrompt<br />\n8z<br />\nEfficient<br />\nService<br />\ngineering Building and will be open cast to pass the petition requesting<br />\nthe<br />\nrecognition of the band.<br />\nto the public. Cards of admission<br />\nElltridge Farms Dairy<br />\nYoung Men's Clothing<br />\nwill not be requisite.<br />\nThe band has been congratulated<br />\nSTRICTLY FRESH MILK<br />\n1 W. University Parkway<br />\nProduced, Pasteurized and Bottled<br />\nThe first of the series, \"New for its excellent performance at the<br />\nand Furnishings<br />\nOpposite J. H. U. Athletic Field<br />\nin Howard County<br />\nForces in Old India,\" by Dr. S. L. Fifth Regiment Armory games on<br />\nCLARK BROS.<br />\nEllicott City 231-R DRUG STORE for J. H. U. BOYS<br />\nJoshi, was delivered on Thursday, February 25. The<br />\nAthletic Board Are made a special feature of<br />\nPHONE, HOMEWOOD 2121<br />\nMarch 2.<br />\nhere.<br />\nand games committee anounced<br />\nDR. HOLLANDER EXPOSES THE \"that the good work of the band on<br />\nGive us a call and let us become<br />\nBuy an (H) Pipe made special<br />\nFAULTS OF SOCIALISM<br />\nthe<br />\nnight<br />\nthe<br />\nof<br />\nmeet<br />\ncannot<br />\nbe<br />\nContinued from page 1, Col. 3<br />\nbetter acquainted for mutual<br />\nfor the Boys<br />\nLIBERTY ST. at SARATOGA<br />\ntress—there is likely to be a revival overestimated.\" Major Walter E.<br />\nbenefit.<br />\n(Opposite Hotel Rennert)<br />\nof projects of social reconstruction Black, chairman of the Fifth RegiORDERS RECEIVED FOR<br />\nLUNCHEON—:—DINNER<br />\nwhich are to free humanity from ment Athletic Association, also<br />\n11:30 until 7:30<br />\nCOGGINS'<br />\nall such ills and to usher in an era commended them on the excellent<br />\nBANQUETS<br />\nSMOKERS<br />\nDANCES Transfer and Baggage Express<br />\nshowing that they made. The memBy Arrangement<br />\nof universal well-being.<br />\nAUTOMOBILE SERVICE<br />\nTelephone St. Paul 6987<br />\nPHONE, HOMEWOOD 2645-W<br />\n\"It is right that these proposals bers of the band deserve all this<br />\nshould receive careful examination. praise, for even though the acousHoward at Lexington<br />\nTheir authors are often men of the tics in such a large place were very<br />\nmuch<br />\nagainst<br />\nthem,<br />\nthey<br />\nmade quite<br />\nhighest ideals, who rarely deserve<br />\nOur -prep\" room on the<br />\nDo you know how best to provide<br />\nthe, obloquy that is often accorded a name for themselves.<br />\nThe band is now preparing for<br />\nan income for your old age?<br />\nthird floor specializes in<br />\nthem. M<br />\n- oreover. economic fallnConsult with<br />\neventful<br />\nan<br />\nspring season. The men<br />\ncies have never been exposed by<br />\nclothes for young men.<br />\nW. W. WALKER<br />\nabuse. If socialism is, as we believe are turning out faithfully for pracit, an unsound philosophy, let us tice every Monday afternoon on the 909 Calvert Bldg.<br />\nSt. Paul 2581<br />\n'establish that fact by logic and second floor of the barn. This comevidence and not by epithet and ing Monday, however, there will be<br />\nno practice, for the orchestra will<br />\nsuppression.<br />\nAi.e You Planning A<br />\n\"Barring minor variations ,the es- use the room. In the coming outVACATION ABROAD)<br />\nBaltimore. Charles and Fayette<br />\nsence of socialism is the collective door athletic season, the band will<br />\nplay<br />\nat<br />\nevery<br />\ngame,<br />\nIf<br />\njust<br />\nSo,<br />\nas<br />\nthey<br />\nCall<br />\ndid<br />\non<br />\n• ownership of all instruments of<br />\nproduction, and the distribution of in the football season. The wooden<br />\nA. SCHUMACHER & CO.<br />\nthe national product acording- to grandstand between the two conBAND WILL PROBABLY RECEIVE<br />\nA PROTEST<br />\nPASSENGER<br />\nsome common stan(lard, We can crete ones, constructed by the MaVARSITY SEALS<br />\nTo<br />\nthe<br />\nEditor of the NEWS-LETTER:<br />\nAGENTS<br />\nconceive its introduction by assum- rines for the Army-Marine game,<br />\nEmil Smith, leader of the band,<br />\nhas<br />\nbeen<br />\nturned over to the band<br />\nEvery Hullabaloo has had four<br />\ning that the state should take posfor all<br />\nhas submitted a petition to the<br />\nsources of revenue. Money has<br />\nTrans-Atlantic Lines<br />\nsession in the name of the nation of for their use during the games.<br />\nStudent Activities Council requestall mills, factories and farms and They wil use the box at the lower<br />\nbeen obtained from senior class<br />\ning<br />\nthat the band be recognized as<br />\nCharles & Redwood Sts.<br />\nconscript the entire population for end of the stand as a band stand.<br />\ndues, from advertisers and from<br />\na legitimate college activity, and<br />\ntheir operation. The resulting<br />\nsubscriptions. These first-mentioned<br />\nas such be giveir representation on<br />\nproduct would thereafter be distrib- retirement from two of these hismodes of obtaining money are about<br />\nuted according to some common toric positions. In face of the comthe Council and a certain number of<br />\nas<br />\nlegitimate as any that could be<br />\npelling logic of facts, the doctrine<br />\nPre-determined principle.<br />\nVarsity Seals. A resolution to<br />\nJ.<br />\nF.<br />\nAPPLE<br />\nCO<br />\n•<br />\ndevised. But the fourth method is<br />\n\"The general grounds upon of increased misery has been abanLancaster, Pa.<br />\nthis effect was passed by the CounWhich socialism has been urged for doned and no important group of<br />\nabsolutely<br />\nnothing more or less than<br />\nMANUFACTURING JEWELERS<br />\ncil and will be referred to all the<br />\nalmost a century are twofold: socialists any longer maintains that<br />\na graft.<br />\nMakers of Hopkins Jewelry.<br />\nholders of the Varsity Seals who<br />\nPirst, that there are evils in the progress and poverty is the actual Write for Special<br />\nEvery activity on the campus is<br />\nDesigns and Prices<br />\nare now in the University for their<br />\ncompetitive system which are irre- course of economic growth. In the<br />\nCall at University P. 0. for<br />\nbeing taxed $10 a page for its writemediable; and, second, that there same way there has been a virtual<br />\napproval. Secretary Lipps has<br />\nInformation.<br />\nup<br />\nin the Hullabaloo. This has been<br />\nWould result from collective own- abandonment of the contention that<br />\nbeen instructed to see these men and<br />\nthe<br />\npractice since time immemorial,<br />\ngains<br />\nin<br />\noperation<br />\ngreat<br />\nthe economies of socialized producership and<br />\nrecord their votes. It will require<br />\nwell-i)eing.<br />\nthe way of social<br />\ntion would be greater than the<br />\nand so no slur can be cast on the<br />\nCHAS. E. HERRING<br />\ntwo-thirds of these votes to pass<br />\n\"The principal evils as to which losses due to the passing of individpresent management. Indeed,\"Ted\"<br />\nConfectioner and Caterer<br />\nthe petition. However, some oppothe socialists indict the competitive ual initiative and enterprise.<br />\nHuey is one of the finest and best<br />\nS. E. Cor. Maryland and North Ayes.<br />\nsition to the passage of this meassystem are implied in the theory of \"The present case for socialism<br />\n\"JUST THE PLACE FOR<br />\nbusiness managers a Hullabaloo has<br />\nincreasing misery and the theory thus seems to rest very largely<br />\nure is expected.<br />\nREFRESHMENTS\"<br />\never<br />\nhad. But this practice of chargof business crises. The first main- upon the assumption that recurrent Balcony Service<br />\nSoda Booths<br />\ning $10 a page for write-ups of actains that under capitalism the rich crises are the necessary accompaTAU BETA PI HOLDS MEETING<br />\ntivities ought to be stopped after<br />\ninevitably grow richer and the poor niments of capitalism and that a<br />\nPoorer; and the second insists that larger measure of personal freedom sonal freedom under the competiA meeting of the Tau Beta Pi this year. The Students' Activities<br />\nalternating periods of speculative would be attained under collective tive system, it is by no means clear Honorary Engineering Fraternity Council ought not to allow its assoactivity and disastrous depression industry.<br />\nthat enrollment in a vast industrial was held last Monday in Room 206, ciated organizations to be mulcted<br />\nare unavoidable, as business is now<br />\nby the Hullabaloo. It should set<br />\n\"As to the first, there is much army with<br />\nits grades and ranks M. E., at 4 o'clock. There were no<br />\naside a certain appropriation for<br />\nreason to suppose that the business<br />\n°r,ganized.<br />\nwould mean more personal liberty speeches at the meeting, for the<br />\nthis, as for other activities and<br />\n\"The important advantages which cycle is traceable to deep-seated<br />\nthe socialists claim would grow out physical and psychological forces than is now enjoyed by the ordinary whole time was devoted to the busi- make them stick to it. Otherwise;<br />\nness of the society. A similar meet- the Hullabaloo is a parasitic organi°f their project are first, a tremen- and not to the principle of business individual.<br />\ndous increase in social wealth con- competition. Economic science is<br />\n\"All in all, socialism presents it- ing will be held next Monday at zation and deserves to be weeded<br />\nsequent upon the. economy of col- concentrating its efforts upon pre- self even more than heretofore, as the same time.<br />\nThe officers of the out.<br />\nlectivist production, and second, an ventive measures in this direction, a perilous leap in the<br />\nPOLITICUS.<br />\ndark. Its ad- society were unwilling to make any<br />\nenlargement of individual liberty, and it seems not reasonable to<br />\nvocates fail completely in establish- statement concerning the proceedcrowing out of the displacement hope that just as we have been able<br />\nHe (a very good boy)—Who<br />\neither that the evils of the per- ings of the meeting. The fraternity<br />\ning<br />\nto prevent money panics further<br />\n°f the wage.system.<br />\never<br />\nsaw such dancing as this.<br />\n\"At the present time, however, the progress will permit us to avert sonal system are beyond remedy or will award keys to some of the men<br />\nShe (opposite)—I have. But<br />\nease for socialism has been very business crises.<br />\nthat the proposed substitute is free in the upper quarter of the senior<br />\nthe place was closed up a few<br />\npractical<br />\n\"As to the impairment of per- from even greater defects.\"<br />\n4laterially weakened by a<br />\nclass near the end of this semester. days later.<br />\n—Exchange.<br />\n<br />\nB<br />\n<br />\nORTMAN'S<br />\n<br />\nW.L. Mann<br />\n<br />\nCorzoith<br />\n<br />\nChelsea Pharmacy<br />\n<br />\nR. G.Loy & Company<br />\n<br />\nSTEWART& O.<br />\n<br />\n°lite<br />\n<br />\nHub<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LET FER, MARCH 10, 1922<br />\n<br />\n4<br />\n<br />\nAN OPPORTUNITY FOR THE<br />\nEDITORIALLY INCLINED<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\n<br />\nTENNIS TEAM TO OPEN SCHEDULE<br />\nIN A MONTH<br />\n<br />\nC(re beXatterie)<br />\n°AM Zs H.& OSCAR G.1-51if<br />\nOWNERS<br />\n4<br />\n1<br />\n/<br />\n.\".listr44 0/°<br />\n'0<br />\n111<br />\n<br />\n29 Baltimore St., East<br />\n<br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\n<br />\nThe Chas. Willms Surgical<br />\nInstrument Co.<br />\nHO N. HOWARD ST., Baltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br />\n<br />\nJ. H. Furst & Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\n<br />\nThe Spring Top Coat<br />\n<br />\nAccording to Captain Wilson<br />\nDuffy, the tennis team will have a<br />\nvery attractive schedule this spring.<br />\nDuffy, who is manager of the team<br />\nWe have them in unusually attractive<br />\nas well as captain, has arranged<br />\nmodels. Loose swagger backs, with<br />\nmatches with some of the best color set-in sleeves, and priced<br />\nraglan<br />\nlege teams in this part of the counready-to-wear at<br />\ntry; some of which are to be played<br />\nmatch<br />\nfirst<br />\non foreign courts. The<br />\nof the season will be played with<br />\non Line to the Gulf, and from the Georgetown on April 7 in WashMississippi to the coast. For this, ington. The Hopkins team will<br />\nthe first contest, a writable subject travel to Annapolis on April 12 to<br />\nhas been selected, which is as fol- meet the Navy racqueters, and<br />\nlows: \"Contributions of the College Swarthmore will come to Homewood to compete with the local<br />\nNewspaper to College Life.\"<br />\nteam on April 14. There have been<br />\nThe contest opens immediately no other games definitely scheduled,<br />\nand will close April 10, 1922, at but Captain Duffy is negotiating<br />\n211-213 E. BALTIMORE ST.<br />\nwhich time editorials must be in the with Gettysburg, Bucknell, West<br />\ncomand<br />\nPoint, New York University<br />\nhands of Hon. N. B. Forrest,<br />\nCollege.<br />\nDickinson<br />\nHeadGeneral<br />\nhief,<br />\nmander-in-c<br />\nA<br />\ncall<br />\nfor<br />\ntennis candidates will<br />\nThe Episcopal Church of<br />\nquarters, Sons Conferedate Vetabout March 14,<br />\nbe<br />\nmade<br />\nprobably<br />\nchairis<br />\nwho<br />\nerans, Atlanta, Ga.,<br />\nSt. Michael and All Angels<br />\ndeclares Captain Duffy. The canman of the committee of judges. didates who are expected to report<br />\nMEN'S SHOES<br />\nST. PAUL and TWENTIETH STS.<br />\nOf the Better Class<br />\nAppropriately designed gold, sil- for practice are Duffy, Wells, JaWyatt Brown, D.D., Litt.D., Rector<br />\nbe<br />\nwill<br />\nmedals<br />\nbronze<br />\nver and<br />\ncobsen, Rowland and Totterdale, Holy Communion at 7.30<br />\nawarded for first second and third of last year's team, besides a great Young Men's Bible Class, 9130<br />\nplaces in the contest, while every number of inexperienced men.<br />\nURNER BROTHERS<br />\nWith this good material in hand, Morning Service, 11 o'clock<br />\nwriter getting his editorial sent to<br />\nEvening Service, 8 o'clock<br />\n111 E. BALTIMORE STREET<br />\nHopkins will probably turn out an<br />\nBALTIMORE<br />\nthe judges will receive a Certificate excellent team.<br />\nSpecial Invitation to Hopkins Students<br />\nMention.<br />\nHonorable<br />\nof<br />\nThe editorials must not exceed HONORARY FRATERNITY TO HOLD<br />\nST. DAVID'S<br />\nINITIATION<br />\n500 words and are to be typewritProtestant Episcopal Church<br />\nThe newly pledged members of<br />\nten on one side of regular plain<br />\nCorner<br />\nOAKDALE ROAD and ROLAND AVE.<br />\nN. W.<br />\nSigma Chi Beta will be formally iniletter-size sheets.<br />\nRoland Park<br />\nIn order to save embarrassment tiated at the Beta Theta Pi fraterThe<br />\nSaturday.<br />\nnext<br />\nSouthhouse<br />\nnity<br />\nand<br />\nlocal<br />\nthe<br />\nof<br />\npart<br />\nthe<br />\non<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\nern committees, assumed names are pledges are all men prominent on the<br />\nSUNDAY SERVICES<br />\nrequired on the upper right hand campus, and their initiation should<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\ncorner of the editorials and that materially increase the weight of<br />\n8 P. M.—Choral Evening Prayer<br />\nThe<br />\nuniversity.<br />\non<br />\nin<br />\nthe<br />\nfraternity<br />\nrequired<br />\nthe<br />\nis<br />\nsame assumed name<br />\nplain sealed envelope, in which the old members gave a large dance<br />\nproper name, address, school and last Friday at L'Hirondell in honor<br />\nhome of the writer will be con- of the pledges and some \"prep\"<br />\ntained. The editorial, with this en- school men.<br />\nAt the formal initiation Saturday<br />\nvelope attached, will first be given<br />\nto the local committee, and, still the pledges will be given the pins,<br />\nsealed, sent to general committee which are worn under the regular<br />\nchairman.<br />\nfraternity pins. They are white<br />\n'Awards in this contest will be gold skull and cross-bones, with a<br />\nmade at the annual convention of black and a blue eye and pearl teeth.<br />\nthe association, to be held the latter The Greek letters E X B in black<br />\npart of April at a place yet to be enamel are written across the foreFORTY-SIXTH YEAR OF INSTRUCTION, 1921-22<br />\nhead of the skull.<br />\nselected.<br />\n<br />\nThe Southern Intercollegiate<br />\nNewspaper Association, which came<br />\nComplete Stock of<br />\nMedical Books and College<br />\ninto being at the University of<br />\nRequisites<br />\nRichmond last spring, has anBooks<br />\nFine<br />\nin<br />\nImporters and Dealers<br />\nnounced a South-wide editorial con301 N. CHARLES ST.<br />\ntest, which is open to all bona fide<br />\nBaltimore, Md.<br />\nstudents of every white college and<br />\nuniversity from the Mason and Dix-<br />\n<br />\nA Necessity and a Luxury<br />\n<br />\n$35 and $40.<br />\n<br />\nCLOTHES<br />\n<br />\nURNER'S<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br />\n\"<br />\n,<br />\n'exfteito V/te,'‘<br />\n<br />\nTtis<br />\nAVDOR<br />\n<br />\nThe Johns Hopkins<br />\nUniversity<br />\n<br />\nLACROSSE TEAM ROUNDING<br />\nINTO FORM<br />\n<br />\nMEET FOR BALTIMORE AND<br />\nCANADIAN SCHOOLS<br />\n<br />\nThe lacrosse team is fast being<br />\nINSTRUCTION<br />\nOn the 17th of March, at the<br />\nwhipped into shape and by the time Fifth Regiment Armory, there will<br />\nfor the first game,it should be one of be held a track meet between Cana- GRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master of Arts; Doctor<br />\nthe most formidable organizations dian and Baltimore schools. In adof Philosophy.<br />\nbeen<br />\nhas<br />\n,winter<br />\nThe<br />\nEast.<br />\nin<br />\nthe<br />\nSCHOOL. Degree: Doctor of Medicine; courses for physidans.<br />\nMEDICAL<br />\nLiterature<br />\nCollege<br />\ndition to the regular events, it has<br />\nbut<br />\npractice,<br />\noutdoor<br />\nfor<br />\nhard<br />\nvery<br />\nARTS AND SCIENCES. Degree: Bachelor *of Arts.<br />\nOF<br />\nCOLLEGE<br />\nLOMBARD and SOUTH STREETS<br />\nbeen decided to have three open<br />\nthere have already been several events.<br />\nDEPARTMENT OF ENGINEERING. Degrees: Doctor of Engineering; Master of<br />\nEngineering; Bachelor of Engineering; Bachelor of Science in Chemistry.<br />\nscrimmages, and with spring now<br />\nAlthough not definitey decided<br />\nSCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Public Health;<br />\ncoming on, this should soon become<br />\nupon, it is expected that Lafayette<br />\nDoctor of Science and Bachelor of Science in Hygiene; Certificate in<br />\na daily occurrence. There is an<br />\nand Hopkins will stage two relays,<br />\nHealth.<br />\nPublic<br />\nTeach a Lesson in Style<br />\nunusually large number of promaddiIn<br />\nmedley.<br />\none<br />\nand<br />\none<br />\nmile<br />\nFOR TEACHERS. Degree of Bachelor of Science.<br />\nCOURSES<br />\nCOLLEGE<br />\nThey possess the \"dash\" that<br />\nising candidates, and it will only<br />\ntion, Mr. Kistler hopes to have the SUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of Arts<br />\nappeals to college men, toned<br />\nbe by hard, consistent work that<br />\ndown to distinctiveness. And<br />\nor of Science. Also for graduates in Medicine.<br />\nNavy and Hopkins participate in<br />\nwearing qualities that provoke<br />\neven the old men from last year<br />\nthree relays—a half mile, mile and EVENING COURSES in Business Economics and for Technical Workers.<br />\nenthusiasm.<br />\ncan land a permanent berth. The<br />\nmedley.<br />\nN. HESS' SONS<br />\nfirst game, on April 1, with the<br />\nAlumni, should be an easy victory<br />\n8 E. BALTIMORE ST.<br />\nTHE SYRACUSE WITS<br />\nfor the Varsity, since the Alumni<br />\nUniversity professors,<br />\nSHOES<br />\nteam will be materially 'weakened. Syracuse<br />\nPUBLICATIONS.<br />\nselect the most JOHNS HOPKINS PRESS<br />\nyear<br />\neach<br />\nwho<br />\ndue to the fact that some of their<br />\nSTATE BUREAUS: Geological Survey; Weather Service; Forestry.<br />\noriginal and oddest answers given<br />\nmen will play with Mt. WashingUNIVERSITY MEN<br />\non mid-year examinaon that date. by students<br />\nFor Sport Wear ton against St. John's<br />\nFor Dress<br />\nBUILDINGS<br />\ntion papers, have released a list<br />\n'Smart Styles—Best Leathers<br />\nof<br />\nsome<br />\nto<br />\ndo<br />\ncredit<br />\nwould<br />\nwhich<br />\nMILK<br />\nSKIMMED<br />\nModerate Prices<br />\nDr. A., a very popular alumnus, Thomas A. Edison's famous ques- GILMAN HALL—general library, class rooms, biology, administration.<br />\nis training his youngster to take an tions. A part of the list follows: MECHANICAL AND ELECTRICAL ENGINEERING—housing also Physics and College Chemistry.<br />\nactive interest in Hopkins affairs. Dido means \"just the same\";<br />\nmanua<br />\nwas<br />\nENGINEERING—housing also Geology.<br />\nA.<br />\nDouglas<br />\nStephen<br />\nCIVIL<br />\n19 W. LEXINGTON ST.<br />\nLast fall he came home from a footmade<br />\nPaul<br />\nshoes;<br />\nof<br />\nfacturer<br />\nPOWER HOUSE.<br />\nball game and told her:<br />\nafter<br />\none<br />\nlast<br />\nthe<br />\nBOTANY AND PLANT PHYSIOLOGY—with Greenhouses and Botanical Garden\"Hopkins took a football game three journeys,<br />\nthePetrine<br />\nthe<br />\nhis martyrdom;<br />\nCHEMICAL LABORATORY—for graduate work.<br />\nfrom Western Maryland today.\"<br />\nwords,<br />\nChrist's<br />\nPHYSIOLOGICAL BUILDING.<br />\n\"And what did they take from ory was based on<br />\nwas<br />\nof Arc<br />\nANATOMICAL LABORATORY.<br />\nMADE TO ORDER<br />\nCity Dairy?\" she mildly inquired. \"Feed my goat\"; Joan<br />\nNew<br />\nLABORATORIES.<br />\ncaptured<br />\nwho<br />\ngirl<br />\na<br />\npeasant<br />\nHUNTERIAN<br />\nAND<br />\nof PATHOLOGICAL LABORATORY.<br />\na<br />\nSultan<br />\nwas<br />\n\"Am<br />\nand<br />\ntelegram:<br />\nsick<br />\nSedan<br />\nSon's<br />\nOrleans;<br />\nFINISHED CLOTHES<br />\nhave no money.\"<br />\nTurkey; hordes of Goths, Lom- SCHOOL OF HYGIENE.<br />\nPLAZA BUILDING<br />\nDad's reply:\"Am well and have bards and Osteopaths overran CARROLL MANSION—Johns Hopkins Club.<br />\nSouthern Europe.<br />\nplenty.\"—Exchange.<br />\nSTUDENT ACTIVITIES BUILDING.<br />\n19 AND 21 EAST FAYETTE ST.<br />\n<br />\n8441000<br />\n<br />\nHess Shoes<br />\n<br />\nWYMAN<br />\n<br />\nLEMMERT<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVI. No 37<br />\ne,<br />\nae<br />\nsLs.<br />\n0Le.<br />\npt<br />\nvger<br /><br />\n[al<br />\n70.<br />\n70.<br /><br />\ner<br />\nnd<br />\n0/.<br />\nne<br />\nin<br />\nor.<br />\ngn<br />\n50.<br />\n25.<br />\nP.<br />\n0.<br />\nw.<br /><br />\nPP.<br />\n50.<br />\nby<br /><br />\nnk.<br /><br />\noAr-<br /><br />\nBASEBALL PROSPECTS ARE<br />\nGOOD FOR SEASON OF<br />\n1922<br />\nCandidates Turning Out Nicely. Many<br />\nVeterans Back and in Form.<br /><br />\nThe baseball season for 1922 was<br />\nforinal:y ushered in at Homewoo,I<br />\nlast Friday afternoon, when candidates for the nine held their first<br />\nworkout under Coach Armstrong's<br />\ndirection. Practically all of las:<br />\nyear's veterans and about twenty<br />\nnew men, all former prep schoo.<br />\nplayers, turned out.' The workout<br />\nconsisted of a light throwing and<br />\nbatting practice, designed to loosen<br />\nup stiff muscles in preparation foi<br />\nthe hard work to follow.<br />\n\"Shad\" Sharretts, last year's captain and clean-up hitter on the team<br />\nfor several seasons, will be one of<br />\nthe mainstays in the outfield. Fred<br />\nRich, another veteran, will probably<br />\nhold down his old position in right<br />\ngarden, while Miles Marrian, Poly's<br />\n\"home-run king,\" will make a<br />\nstrong bid for the third outfield position.<br />\nOf last year's infield only \"Buck\"<br />\nGrace, at second, and Herb Reifschneider, at second, have survived<br />\nboth graduation and the blacklist.<br />\nErdman, a freshman, is showing<br />\ngood form at short and may push<br />\nReifschneider for his old position.<br />\nAmong the many candidates for first<br />\nbase, Bill Merrick, a substitute on<br />\nlast year's squad, is showing up<br />\nwell. As yet no one has shown suf-<br /><br />\nBALTIMORE, MD., MARCH 1 , 1922<br /><br />\nLET'S GO<br /><br />\nPRICE 5 CENTS<br />\nHOPKINS SWIMMERS TO PARTICIPATE IN EASTERN INTERCOLLEGIATES<br /><br />\nA THOUSAND A DAY<br /><br />\nBlack and Bliie Mermen to Make Strong<br />\nBid for Honors in Lehigh Pool.<br /><br />\n1. (An Approach) Mr. Blank, I want to talk to you a moment about out-of-doors and tell you about a<br />\nseries of real games that are going to take place at Hop rcins Field.<br />\n2. (An Approach) Mr. Blank, I'm a Hopkins Man. We are interested in enlarging attendance at our<br />\ngames and sports and in bringing to Baltimore, the best college teams in the country—and I believe that you<br />\nwill be interested in our plan (follow with the descrip on cf ticket and its features).<br />\n3. EPrg-'n F-atu- - of the ticket. Twenty-one games for the $5.00—at regular admission prices $10.00<br />\nworth for $5.00--two dollars for one.<br />\n4. On all week days other than Saturday, this ticket gives the privilege of bringing in a lady or ladies<br />\nfree. This is a worthwhile saving for any ticket buyer and is by itself worth the price.<br />\n5. At all times this ticket gives the holder the privilege of bringing in children under the age of 12 free.<br />\nTo an old college man this gives the opportunity for him to bring his children where they will get a healthy<br />\nview of true sportsmanship in its best expression.<br />\n6. This ticket is transferable, i. e., if you have an engagement on a certain day and cannot come out yourself, you can loan your ticket to a friend for that day and he wilj be able to take in the games.<br />\n7. (To Prep and High School Prospects.) Review all the privileges of the season ticket at five dollars,<br />\nbut the price to these is $2.00 and the ticket is non-transferable.<br />\n8. It costs money to bring the best teams here. Ralroad fares, food and shelter for visiting teams have to<br />\nbe provided and this money comes from these season tickets. Uniforms and the various tools and implements<br />\nused in the games have to be replaced—and to keep all these angles of outdoor sports at the point of efficiency,<br />\nwe must sell $15,000 worth.<br />\n9. Another point, the character of our audience is high class. A lady can be brought as a guest to any<br />\ngame on Hopkins field with the full knowledge that she is as safe from harm and as well surrounded with thoughtful friends as she would be in her own home.<br />\n10. Look at this schedule of games. It is crammed full of interest and exciting contests. Championship<br />\nLacrosse with Lehigh and Syracuse, and a game with Oxford, England. Baseball with the best college teams<br />\nand two outdoor meets thrown in for good measure.<br />\n11. Mr. Ticket Buyer, in the spring of the year you and every other man likes to be out of doors—how<br />\nmany times do you have the desire and yet do not go because you cannot think of any special place to go. Here<br />\nis an interesting place to go and spend an enjoyable afternoon.<br />\n12. Many big business men get the inspiration for their organizations from their observance of the spirit<br />\nof Fair Play and whole-souled enthusiasm which is a part of college sport at all times.<br />\n13. (To the Alumnus). Support Hopkins athletics and thus help the school that gave you its best. The<br />\nmore support our athletics get, the more widely known our college becomes and this in the end is both good for<br />\nthe university and the city.<br />\n14. (To the liusiness Man not an Alumnus). New Haven, Conn., is as well known in the United States as<br />\nmany cities much larger and appears in the newspapers of the country much more frequently than Baltimore<br />\nbecause it is the seat of Yale University. Support Hopkins athletics and help advertise Baltimore.<br />\n15. I am here as a Hopkins Student because I believe in my school and in its teams and college spirit.<br />\nI believe that these things are worth something to every citizen of Baltimore—if you buy one of these tickets<br />\nand come out, you will appreciate Hopkins as much as we do.<br />\nThese are a few of the many points you can bring out and use to sell these tickets. Do<br />\nnot use all your points at once. Ask for the order and show that you can give a receipt<br />\nfor his check—and if he does not buy then, go right ahead with some more points and<br />\ntry again.<br />\nRemember that PEP and College spirit will win this Campaign just as it wins games. Talk<br />\nto the Prospect confidently, positively and enthusiastically.<br /><br />\nTomorrow. night, with Lehigh,<br />\nRutgers, Swarthmore and possibly<br />\nStevens as opponents, the Black and<br />\nBlue swimmers will participate in<br />\nthe annual Eastern Intercollegiate<br />\nChampionships, to be held in the<br />\nLehigh pool.<br />\nRutgers, last year's Eastern Intercollegiate champions, again expect to make a strong bid for honors. They are captained by Giebel,<br />\nwho last year captured several first<br />\nplaces in the meet. In the NavyRutgers dual meet, Giebel defeated<br />\nSinclair, who holds the intercollegiate record in this event. The Rutgers star added to his laurels when<br />\nhe broke the Eastern Intercollegiate<br />\nfor the 100, negotiating the distance<br />\nin 59 seconds.<br />\nThe majorjty of the dopesters,<br />\nhowever, pick Lehigh to capture<br />\nthis year's laurels, due to their recent victory over the Rutgers mermen in a dual meet, which they<br />\ncaptured by a 42-29 score. Harmon,<br />\nof Lehigh, was the individual star<br />\nof this meet, capturing two firsts<br />\nand swimming on the victorious relay.<br /><br />\npolished<br /><br />\nE nthusiastic<br />\nP<br /><br />\nresentations<br /><br />\nwill sell<br /><br />\nSwarthmore's chances were considerably lowered with the announcement that Charlie Crownover, Olympic star, was in scholastic<br /><br />\nA THOUSAND A DAY<br />\nficient ability to hold down the hot<br />\ndifficulties, and in all probability<br />\ncorner, and competition among the<br />\nwill not be able to swim.<br />\nACTIVITIES<br />\nCENSUS<br />\nBE<br />\nTO<br />\nDR.<br />\nHOLLANDER<br />\nEXPOSES<br />\nA.<br />\nA. BOARD COMBINES<br />\nnew men for this position should be<br />\nThe ruling which restricts one<br />\nTAKEN BY PUBLICITY •<br />\nTHE FAULTS OF<br />\nDINNER AND BUSINESS<br />\nvery keen.<br />\ncontestant to two events will work<br />\nBOARD<br />\nSOCIALISM<br />\nMEETING<br />\nThe most promising boxmen are Accurate Records to be Kept. Plans<br />\nhardships on both Lehigh and RutHopkins Professor Gives Interesting Spring Ticket Sale's Success Determines<br />\nUnder Consideration for AdvertisAndy Knecht and Bill Tucker, who<br />\ngers. Giebel and Harmon in previLecture Before Social Science<br />\nFuture Policy. New Track<br />\ning Hopkins-Oxford Lacrosse<br />\nClub and Guests.<br />\nAwards Decided Upon.<br />\nwill probably handle the majority of<br />\nGame.<br />\nous meets have entered three or<br />\n\"Socialists<br />\nare<br />\nnot<br />\nalways<br />\nun<br />\nInstead<br />\nof<br />\nholding<br />\nthe<br />\nFollowing<br />\nrecommendation<br />\nof<br />\nMarchetti<br />\na<br />\nregular<br />\nspring.<br />\nthe pitching this<br />\nmore races. Here, however, the<br />\nshorn, red-shirted ruffians with<br />\nmonthly meeting di the Athletic<br />\nis another of last year's squad who the Omicron Delta Kappa Honorascope of their abilities will be limstick of dynamite in each pocket.' Board at the Barn on Monday<br />\nwill do part of the hurling, while ry Society, the Publicity Board will With this rather forceful remark,<br />\nnight, President Knecht marshalled ited ,and it will be necessary to find<br />\ntake a census of the recognized acMcMillan, of Poly, and Calhoun.<br />\ntivities of each man in the under- Dr. Jacob H. Hollander of th, his associates into dinner array other men to fill their suits.<br />\nof City, are candidates of unknown graduate school. Forms will be Hopkins faculty began his addres: and brought them out to Roland<br />\nHopkins has suffered defeat at<br />\nability at present. The biggest gap placed in the postoffice boxes to be ,vhich was entitled \"The Plight o Park to do full justice to the fine the hands of Swarthmore,<br />\nLehigh<br />\nin the team and the position that filled out in detail and returned. Socialism,\" last Tuesday afternoon meal Dr. Ronald T. Abercrombie, and<br />\nRutgers this season, although<br />\nWill be hardest to fill is the one be- The members of the Board particu- Another high light of his speed faculty member of the board, had<br />\nthe two former meets were lost by<br />\nhind the bat, left vacant by Bill larly<br />\nrequest that, inasmuch as there was his answer to the charge that provided.<br />\nextremely<br />\nclose scores, the former<br />\nWood. Candidates for this position are only a certain number of blanks, many of the Hopkins professors<br />\nThe<br />\nagreeable<br />\nsurroundings<br />\nare Mike Levin, substitute last<br />\nby a margin of two, and the latter<br />\nthe information returned be accu- are \"half-baked radicals.\" He said, made the proceedings of the board<br />\nYear; Oates, Asendorf and Bushey.<br />\n\"If<br />\nwe<br />\nuse<br />\nculinary terms, it is pleasanter in every way and con- by one point. The Black and Blue<br />\nrate and free of unnecessary huIn order to have the squad in<br />\noften better to be a 'half-baked rad- siderably more business than is swimmers may, however, spring<br />\nmorous material.<br />\nShape for the first game of the seaThe census takers desire a record ical' than a 'hard-boiled standpat- usually transacted was dispatched. several surprises. \"Davvy\" Rowson, which is with Dickinson on of the class, college course, home ter.'\"<br />\nThe big thing before the board land can be looked<br />\nupon to capApril 1, Coach Armstrong will di- and<br />\nat<br />\nHollander<br />\npresent is the spring season ticket<br />\nDr.<br />\nis<br />\na<br />\ntypical<br />\nHopcity address, fraternity and acture the breast stroke, as he is Eastrect practice every afternoon as<br />\ntivities of every undergraduate at kins man. He received both his sale drive, upon the success of<br />\nern Intercollegiate champion in this<br />\nlong as the weather is good. He<br />\nthe university. In an instance where A. B. and Ph. D. degrees here. which hinges all of the athletic polthe<br />\ncoaching<br />\nwil be geratly aided in<br />\na man is out for a team or a board From 1900 on he has been associ- icy for the remainder of the year. event. Coady in the 220, Buhrer<br />\nSquad by several members of the he is requested to report \"candidate ated with the Department of Polit- Plans for it is ready to<br />\nbe placed in the 50 and the 100 and Morrell<br />\n9,<br />\nOrioles and a few other profession- for<br />\nical Economy. As Treasurer of before the students and the NEWS- in the back stroke can be looked<br />\n.<br />\nals who will practice regularly with<br />\nThe records will be referred to Porto Rico in 1900, he revised the LETTER is today printing much of upon to furnish some close compethe team.<br />\nhereafter in compiling Hullabaloo laws concerning taxation and rev- the information prepared by Mr. tition and may<br />\nout-swim some of<br />\nother publication data. After enue for that island. In 1906, he Palmer.<br />\nand<br />\nNEW BLACK AND BLUE JAY OUT<br />\nthe favorites.<br />\nThe desire of many students to<br />\nSOON<br />\nthe filing of these forms, the rec- was special commissioner to Santo<br />\nThe following men will probably<br />\nThe fourth issue of the Black and ords will become a matter of regis- Domingo, and was later financial have track letters awarded as soon<br />\nBlue Jay will make its appearance tration, and in order to receive rec- adviser to the republic. During the as they are won will be realized represent Hopkins:<br />\nRelay—Coady, Rowland, Buhrer,<br />\nsometime before the end of next ognition, it will be necessary for the last election he was economical ad- only in so far as Seniors are conviser<br />\nto<br />\nRepublican<br />\nof<br />\nthe<br />\nBoard<br />\nCommitted<br />\ncerned.<br />\nthe<br />\nAs no Seniors who have Morrell or Lord.<br />\nWeek. Following this publication, individual to notify<br />\nThe substance of his speech is not already received letters have<br />\nan el ection of candidates for the additional honors. Upon graduation<br />\nPlunge—Hambleton.<br />\nwon them, none will be granted. 50-yard Dash—Buhrer,<br />\nBusiness Board will be held It has the student's card will be filed by as follows:<br />\nRowland.<br />\n\"The current interest in social- A certificate is being prepared for<br />\nbeen decided to postpone the elec- the University Registrar.<br />\nFancy Dive—Coady.<br />\nThe Board has been releasing in- ism is a natural accompaniment of presentation to men who b'reak<br />\ntion of the circulation manager un100-yard Dash—Buhrer, Johnstil later in the year, possibly waiting formation weekly both in form lots business depression. As in times Hopkins records that they may ton.<br />\n41161 next fall. Two more issues of and special articles. A campaign past, when the course of the eco- have some permanent memento of<br />\n220-yard Dash—Coady, Lord.<br />\nthe Blue Jay will appear before the is under contemplation to advertise nomic cycle brings us hard times, their record-breaking achievment.<br />\nBreast Stroke—Rowland, Dun\"R'l of the term, the next number, the coming Oxforl-Hopkins la- with attendant falling wages, un- W. Ridgely Edwards, Jr., 1922, ning.<br />\nthe last week in April, and the final crosse match. It will be necessary t•mployment, and working class dis- will be the first man to receive the Back Stroke—Hambleton, MorContinued on page 3, col. 1<br />\nContinued on page 2, ea 3<br />\nContinued on page 2, col. 5<br />\n()Ile about the first of June.<br />\nrell.<br /><br />\nTHE JOHN.,<br /><br />\n2<br /><br />\nACTIVITIES CENSUS TO BE TAKEN<br />\nBY PUBLICITY BOARD _<br />\nContinued 'tom Page 1, col. 2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897.<br /><br />\n$2.50<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br /><br />\nto draw a crowd of 2,000 spectators<br />\nto pay the expenses of the Britishers, and the Board has high hopes<br />\nof making it a success.<br />\nPages have been reserved in a<br />\nnumber of preparatory school magazines and space in the papers of<br />\nthose schools who have them. Bulletin boards will be installed in the<br />\nlocal prep schools as soon as possible.<br /><br />\nHomewood 100<br /><br />\nTelephone<br /><br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br /><br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br /><br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br /><br />\nAssistant Managing Editor:<br />\nJ. HUDSON HUFFARD, '23<br />\nAssociate Editors:<br />\nELI FRANK, JR., '22.<br />\nCHARLES C. MARBURY,'22.<br />\nJunior Editors:<br />\nJOSEPH S. LEOPOLD, '24.<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br /><br />\nV.WS-LETTER, MARCH 10, 1922<br /><br />\nTwo pints one quart,<br />\nTwo quarts, one fight,<br />\nOne fight, two cops,<br />\nTwo cops, one Judge,<br />\nOne Judge, thirty days.<br />\n—Exchange.<br /><br />\nSKATING RINK AT PRINCETON<br /><br />\nAn ice-skating rink is being<br />\nerected on the campus of Princeton University.' It will have, when<br />\nfinished, a seating capacity for<br />\n2,500 people. In addition, it will<br />\ncontain two dressing rooms with<br />\nshowers and baths for visiting<br />\nteams. The ice is ready for skating now, but the building operations will not be completed until<br />\nspring.<br /><br />\nA. A. BOARD COMBINES DINNER<br />\nAND BUSINESS MEETING<br />\nContinued from page 1 col. 4<br /><br />\ncertificate and the privilege of wearing a Hopkins blue silk stripe with<br />\nhis letter on his jersey. Any man<br />\nwho breaks a record or wins a<br />\npoint in the intercollegiates will be<br />\nentitled, it was decided, to wear<br />\nthis stripe.<br />\nIt now seems. probable that all<br />\nSeniors who have been awarded<br />\nletters and have not qet received<br />\ntheir sweaters will get them within<br />\nHARD LUCK!<br />\na month. The Varsity Club reptonight;<br />\n\"Twins arrived<br />\nDr. Stewart and Mr.<br />\nsentatives,<br />\nHe<br />\nread<br />\nMore by mail.\"<br />\nMonday that the club<br />\nsaid<br />\nRay,<br />\nThis telegram his wife had sent,<br />\nupon the results of the<br />\nwaiting<br />\nwas<br />\nAn,d then—poor man—dropped<br />\ndrive before deciding<br />\nticket<br />\nspring<br />\ndead.<br />\nits<br />\nspring<br />\non<br />\nbudget.<br />\n—Exchange.<br /><br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br /><br />\n•<br /><br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN G. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br /><br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nBALTIMORE, MD., MARCH 10, 1922<br />\n\"VALE\"<br />\nThis number of the NEWS-LETTER is the last to be issued under the<br />\npresent Board of Control, since the editor for 1921-22 takes charge today.<br />\nIt is not without a feeling of regret, in spite of the spring fever in<br />\nthe air, that the present editors lay down their pens. Our administration<br />\nhas lasted for almost two years, in which time the NEWS-LETTER has<br />\nsucceeded in wiping out the debt and in changing from a weekly to a<br />\nsemi-weekly publication. Other activities have not been idle and this<br />\nperiod has witnessed a remarkable development in undergraduate life.<br />\nThe campus is becoming more collegiate and an \"esprit de corps' is<br />\nrapidly being developed.<br />\nAmong the new activities which have appeared and seem well on<br />\nthe road to success are the Black and Blue Jay, the undergraduate<br />\norchestra and the student band. The athletic management has shown<br />\nmarked increase in efficiency and our teams have displayed corresponding<br />\nimprovement. The Student Publicity Board, recently organized, should<br />\ndo much to bring the undergraduate college before the public eye. Many<br />\nnew fraternities, engineering and other social societies have made their<br />\nappearance. A home for stray Greeks is now provided by Sigma Chi<br />\nBeta; and Omicron Delta Kappa is taking an active lead in affairs on the<br />\ncampus and is publishing a long needed Hopkins Song Book. A dormitory is still the most essential need of the Undergraduate Department<br />\nand the erection of this building and the new chemical laboratory at<br />\nHomewood should usher in a new era for the college.<br />\nMany of the changes which have taken place can be attributed either<br />\ndirectly or indirectly to the NEWS-LETTER. The Student Activities fee,<br />\nthe Varsity Seal, the 0. D. K. cup, the freshman activities button and<br />\nthe regulation requiring all freshmen to go out for an activity are<br />\nexamples. We have also done our best to bring about a change in the<br />\nmethod of class elections and in the entrance requirements, and have<br />\nadvocated the keeping of accurate records of each student's activity.<br />\nIn all things we have endeavored to present accurately the student opinion<br />\nand to promote undergraduate life.<br />\nOur period of activity is now over, and the new Board of Control<br />\ntakes up our work. We have the greatest confidence in their ability and<br />\nfeel sure that their efforts will be crowned with success.<br /><br />\nKeeping faith<br />\nwith the<br /><br />\nSMOKER<br />\nOur lifelong knowledge of choice<br />\ntobaccos, our years of manufacturing<br />\nexperience and our up-to-date facilities<br />\nare concentrated on making CAMELS<br />\nthe finest cigarette that can be produced.<br />\nInto THIS ONE BRAND we put the<br />\nUTMOST QUALITY. A better cigarette<br />\ncannot be made—even for a higher price.<br />\nCAMELisTHE QUALITY CIGARETTE<br />\nmade for men who think for themselves<br />\n—for folks who appreciate really fine<br />\ntobacco.<br />\nONE BRAND—ONE QUALITY ONE<br />\nSIZE PACKAGE.<br />\nThat is the way we keep faith with the<br />\nsmoker.<br /><br />\nELECTION ANNOUNCEMENTS<br />\nThe NEWS-LETTER announces with pleasure the following elections<br />\nW. H. Moore, Jr., Editor-in-Chief; G. P. Fallon, Business Manager;<br />\nJ. H. Huffard, Managing Editor; D. K. Vannemann, Advertising Manager; J. S. Leopold, Assistant Managing Editor; R. W. Baldwin, Associate Editor; G. C. Doub, T. C. Routson and C. Tilghman, Junior Editors, and P. Howard, M. D. Marrian, D. Gieske and D. H. Stevenson,<br />\nJr., Assistant Business Managers.<br /><br />\nR. .1, REYNOLDS TOBACCO CO.. Winitan•Salets. N.gi<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 10, 1922<br />\nANNOUNCEMENT OF THE<br />\nJAMES SCHOULER LECTURESHIP PROGRAM<br /><br />\n3<br /><br />\nSTUDENT BAND RECEIVES<br />\nDESERVED CONGRATULATIONS<br /><br />\nTeachers!<br /><br />\nEmil Smith, leader of the band,<br />\nsubmitted<br />\na petition some time ago<br />\nFriday, March 10—\"Aspects of<br />\nUY or rent a Corona<br />\ntypewriter on easy<br />\nthe Russian Revolution.\" Baron S. to the Student Activities Council,<br />\npayments. Carry it to<br />\nschool every day in its<br />\nA. Korff, formerly professor of requesting that the band be recogneat case. Make extra<br />\nmoney writing articles or<br />\nPublic Law in the University of nized as a legitimate college activity<br />\ndoing typing for others!<br />\nand as such should be given repreHelsingfors.<br />\nCall today at the nearest<br />\nCorona store—or teleThursday, March 16 \"Spanish sentation on the Council and should<br />\nphone for a demonstraEnglish Clothes Tailored in America<br />\ntion at your home.<br />\nAmerica: Its Culture and Ideals.\" have a certain number of Varsity<br />\nFor Snort, Dress<br />\n$30 to $45<br />\nDr. Victor Andres Belaunde, pro- Seals allotted to it. The Council<br />\nM. W. LUCY &amp; CO.<br />\n118 W. Fayette St.<br />\nMt. Vernon 4999<br />\nfessor of Political .Science in the passed a resolution a short while<br />\nago<br />\nin<br />\nrecognizing<br />\nfavor of<br />\n\"Queen Quality\" Home Made<br />\nthe<br />\nUniversity of San Marcos, Lima,<br />\nWeighs G4lbs.<br />\nFolds and fits<br />\nChocolates<br />\nband. On Thursday this resolution<br />\nPeru.<br />\nin a neat carrycase.<br />\nVISIT OUR ICE CREAM PARLORS<br />\ning<br />\nThursday, March 23—\"China at will be passed on for the approval<br />\n518 N. CHARLES ST.<br />\nCommercial Photography<br />\n$An with<br />\nthe Conference.\" Dr. Westel W. of all the men in the university who<br />\ncase<br />\nCircuit Photography<br />\nWilloughby, professor of Political hold Varsity Seals. Secretary Lipps<br />\nFlash Lights<br />\nViews<br />\nScience in the Johns Hopkins Uni- has been<br />\ninstructed to see these men<br />\nGroups<br />\nEnlargemen<br />\nts<br />\nCharles and 22nd Sts.<br />\nversity.<br />\nKODAK<br />\nand obtain their votes. It will reFINISHING<br />\nDelicious Sodas and Sundaes<br />\nThe Personal Writing Machine<br />\nThe lectures will be given at 4.30<br />\n325 N. Howard St.<br />\nThe Best of Candies<br />\nquire two-thirds of all the votes<br />\no'clock in the hall of the Civil EnPrompt<br />\n8z<br />\nEfficient<br />\nService<br />\ngineering Building and will be open cast to pass the petition requesting<br />\nthe<br />\nrecognition of the band.<br />\nto the public. Cards of admission<br />\nElltridge Farms Dairy<br />\nYoung Men's Clothing<br />\nwill not be requisite.<br />\nThe band has been congratulated<br />\nSTRICTLY FRESH MILK<br />\n1 W. University Parkway<br />\nProduced, Pasteurized and Bottled<br />\nThe first of the series, \"New for its excellent performance at the<br />\nand Furnishings<br />\nOpposite J. H. U. Athletic Field<br />\nin Howard County<br />\nForces in Old India,\" by Dr. S. L. Fifth Regiment Armory games on<br />\nCLARK BROS.<br />\nEllicott City 231-R DRUG STORE for J. H. U. BOYS<br />\nJoshi, was delivered on Thursday, February 25. The<br />\nAthletic Board Are made a special feature of<br />\nPHONE, HOMEWOOD 2121<br />\nMarch 2.<br />\nhere.<br />\nand games committee anounced<br />\nDR. HOLLANDER EXPOSES THE \"that the good work of the band on<br />\nGive us a call and let us become<br />\nBuy an (H) Pipe made special<br />\nFAULTS OF SOCIALISM<br />\nthe<br />\nnight<br />\nthe<br />\nof<br />\nmeet<br />\ncannot<br />\nbe<br />\nContinued from page 1, Col. 3<br />\nbetter acquainted for mutual<br />\nfor the Boys<br />\nLIBERTY ST. at SARATOGA<br />\ntress—there is likely to be a revival overestimated.\" Major Walter E.<br />\nbenefit.<br />\n(Opposite Hotel Rennert)<br />\nof projects of social reconstruction Black, chairman of the Fifth RegiORDERS RECEIVED FOR<br />\nLUNCHEON—:—DINNER<br />\nwhich are to free humanity from ment Athletic Association, also<br />\n11:30 until 7:30<br />\nCOGGINS'<br />\nall such ills and to usher in an era commended them on the excellent<br />\nBANQUETS<br />\nSMOKERS<br />\nDANCES Transfer and Baggage Express<br />\nshowing that they made. The memBy Arrangement<br />\nof universal well-being.<br />\nAUTOMOBILE SERVICE<br />\nTelephone St. Paul 6987<br />\nPHONE, HOMEWOOD 2645-W<br />\n\"It is right that these proposals bers of the band deserve all this<br />\nshould receive careful examination. praise, for even though the acousHoward at Lexington<br />\nTheir authors are often men of the tics in such a large place were very<br />\nmuch<br />\nagainst<br />\nthem,<br />\nthey<br />\nmade quite<br />\nhighest ideals, who rarely deserve<br />\nOur -prep\" room on the<br />\nDo you know how best to provide<br />\nthe, obloquy that is often accorded a name for themselves.<br />\nThe band is now preparing for<br />\nan income for your old age?<br />\nthird floor specializes in<br />\nthem. M<br />\n- oreover. economic fallnConsult with<br />\neventful<br />\nan<br />\nspring season. The men<br />\ncies have never been exposed by<br />\nclothes for young men.<br />\nW. W. WALKER<br />\nabuse. If socialism is, as we believe are turning out faithfully for pracit, an unsound philosophy, let us tice every Monday afternoon on the 909 Calvert Bldg.<br />\nSt. Paul 2581<br />\n'establish that fact by logic and second floor of the barn. This comevidence and not by epithet and ing Monday, however, there will be<br />\nno practice, for the orchestra will<br />\nsuppression.<br />\nAi.e You Planning A<br />\n\"Barring minor variations ,the es- use the room. In the coming outVACATION ABROAD)<br />\nBaltimore. Charles and Fayette<br />\nsence of socialism is the collective door athletic season, the band will<br />\nplay<br />\nat<br />\nevery<br />\ngame,<br />\nIf<br />\njust<br />\nSo,<br />\nas<br />\nthey<br />\nCall<br />\ndid<br />\non<br />\n• ownership of all instruments of<br />\nproduction, and the distribution of in the football season. The wooden<br />\nA. SCHUMACHER &amp; CO.<br />\nthe national product acording- to grandstand between the two conBAND WILL PROBABLY RECEIVE<br />\nA PROTEST<br />\nPASSENGER<br />\nsome common stan(lard, We can crete ones, constructed by the MaVARSITY SEALS<br />\nTo<br />\nthe<br />\nEditor of the NEWS-LETTER:<br />\nAGENTS<br />\nconceive its introduction by assum- rines for the Army-Marine game,<br />\nEmil Smith, leader of the band,<br />\nhas<br />\nbeen<br />\nturned over to the band<br />\nEvery Hullabaloo has had four<br />\ning that the state should take posfor all<br />\nhas submitted a petition to the<br />\nsources of revenue. Money has<br />\nTrans-Atlantic Lines<br />\nsession in the name of the nation of for their use during the games.<br />\nStudent Activities Council requestall mills, factories and farms and They wil use the box at the lower<br />\nbeen obtained from senior class<br />\ning<br />\nthat the band be recognized as<br />\nCharles &amp; Redwood Sts.<br />\nconscript the entire population for end of the stand as a band stand.<br />\ndues, from advertisers and from<br />\na legitimate college activity, and<br />\ntheir operation. The resulting<br />\nsubscriptions. These first-mentioned<br />\nas such be giveir representation on<br />\nproduct would thereafter be distrib- retirement from two of these hismodes of obtaining money are about<br />\nuted according to some common toric positions. In face of the comthe Council and a certain number of<br />\nas<br />\nlegitimate as any that could be<br />\npelling logic of facts, the doctrine<br />\nPre-determined principle.<br />\nVarsity Seals. A resolution to<br />\nJ.<br />\nF.<br />\nAPPLE<br />\nCO<br />\n•<br />\ndevised. But the fourth method is<br />\n\"The general grounds upon of increased misery has been abanLancaster, Pa.<br />\nthis effect was passed by the CounWhich socialism has been urged for doned and no important group of<br />\nabsolutely<br />\nnothing more or less than<br />\nMANUFACTURING JEWELERS<br />\ncil and will be referred to all the<br />\nalmost a century are twofold: socialists any longer maintains that<br />\na graft.<br />\nMakers of Hopkins Jewelry.<br />\nholders of the Varsity Seals who<br />\nPirst, that there are evils in the progress and poverty is the actual Write for Special<br />\nEvery activity on the campus is<br />\nDesigns and Prices<br />\nare now in the University for their<br />\ncompetitive system which are irre- course of economic growth. In the<br />\nCall at University P. 0. for<br />\nbeing taxed $10 a page for its writemediable; and, second, that there same way there has been a virtual<br />\napproval. Secretary Lipps has<br />\nInformation.<br />\nup<br />\nin the Hullabaloo. This has been<br />\nWould result from collective own- abandonment of the contention that<br />\nbeen instructed to see these men and<br />\nthe<br />\npractice since time immemorial,<br />\ngains<br />\nin<br />\noperation<br />\ngreat<br />\nthe economies of socialized producership and<br />\nrecord their votes. It will require<br />\nwell-i)eing.<br />\nthe way of social<br />\ntion would be greater than the<br />\nand so no slur can be cast on the<br />\nCHAS. E. HERRING<br />\ntwo-thirds of these votes to pass<br />\n\"The principal evils as to which losses due to the passing of individpresent management. Indeed,\"Ted\"<br />\nConfectioner and Caterer<br />\nthe petition. However, some oppothe socialists indict the competitive ual initiative and enterprise.<br />\nHuey is one of the finest and best<br />\nS. E. Cor. Maryland and North Ayes.<br />\nsition to the passage of this meassystem are implied in the theory of \"The present case for socialism<br />\n\"JUST THE PLACE FOR<br />\nbusiness managers a Hullabaloo has<br />\nincreasing misery and the theory thus seems to rest very largely<br />\nure is expected.<br />\nREFRESHMENTS\"<br />\never<br />\nhad. But this practice of chargof business crises. The first main- upon the assumption that recurrent Balcony Service<br />\nSoda Booths<br />\ning $10 a page for write-ups of actains that under capitalism the rich crises are the necessary accompaTAU BETA PI HOLDS MEETING<br />\ntivities ought to be stopped after<br />\ninevitably grow richer and the poor niments of capitalism and that a<br />\nPoorer; and the second insists that larger measure of personal freedom sonal freedom under the competiA meeting of the Tau Beta Pi this year. The Students' Activities<br />\nalternating periods of speculative would be attained under collective tive system, it is by no means clear Honorary Engineering Fraternity Council ought not to allow its assoactivity and disastrous depression industry.<br />\nthat enrollment in a vast industrial was held last Monday in Room 206, ciated organizations to be mulcted<br />\nare unavoidable, as business is now<br />\nby the Hullabaloo. It should set<br />\n\"As to the first, there is much army with<br />\nits grades and ranks M. E., at 4 o'clock. There were no<br />\naside a certain appropriation for<br />\nreason to suppose that the business<br />\n°r,ganized.<br />\nwould mean more personal liberty speeches at the meeting, for the<br />\nthis, as for other activities and<br />\n\"The important advantages which cycle is traceable to deep-seated<br />\nthe socialists claim would grow out physical and psychological forces than is now enjoyed by the ordinary whole time was devoted to the busi- make them stick to it. Otherwise;<br />\nness of the society. A similar meet- the Hullabaloo is a parasitic organi°f their project are first, a tremen- and not to the principle of business individual.<br />\ndous increase in social wealth con- competition. Economic science is<br />\n\"All in all, socialism presents it- ing will be held next Monday at zation and deserves to be weeded<br />\nsequent upon the. economy of col- concentrating its efforts upon pre- self even more than heretofore, as the same time.<br />\nThe officers of the out.<br />\nlectivist production, and second, an ventive measures in this direction, a perilous leap in the<br />\nPOLITICUS.<br />\ndark. Its ad- society were unwilling to make any<br />\nenlargement of individual liberty, and it seems not reasonable to<br />\nvocates fail completely in establish- statement concerning the proceedcrowing out of the displacement hope that just as we have been able<br />\nHe (a very good boy)—Who<br />\neither that the evils of the per- ings of the meeting. The fraternity<br />\ning<br />\nto prevent money panics further<br />\n°f the wage.system.<br />\never<br />\nsaw such dancing as this.<br />\n\"At the present time, however, the progress will permit us to avert sonal system are beyond remedy or will award keys to some of the men<br />\nShe (opposite)—I have. But<br />\nease for socialism has been very business crises.<br />\nthat the proposed substitute is free in the upper quarter of the senior<br />\nthe place was closed up a few<br />\npractical<br />\n\"As to the impairment of per- from even greater defects.\"<br />\n4laterially weakened by a<br />\nclass near the end of this semester. days later.<br />\n—Exchange.<br /><br />\nB<br /><br />\nORTMAN'S<br /><br />\nW.L. Mann<br /><br />\nCorzoith<br /><br />\nChelsea Pharmacy<br /><br />\nR. G.Loy &amp; Company<br /><br />\nSTEWART&amp; O.<br /><br />\n°lite<br /><br />\nHub<br /><br />\nTHE JOHNS HOPKINS NEWS-LET FER, MARCH 10, 1922<br /><br />\n4<br /><br />\nAN OPPORTUNITY FOR THE<br />\nEDITORIALLY INCLINED<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br /><br />\nTENNIS TEAM TO OPEN SCHEDULE<br />\nIN A MONTH<br /><br />\nC(re beXatterie)<br />\n°AM Zs H.&amp; OSCAR G.1-51if<br />\nOWNERS<br />\n4<br />\n1<br />\n/<br />\n.\".listr44 0/°<br />\n'0<br />\n111<br /><br />\n29 Baltimore St., East<br /><br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br /><br />\nThe Chas. Willms Surgical<br />\nInstrument Co.<br />\nHO N. HOWARD ST., Baltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br /><br />\nJ. H. Furst &amp; Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br /><br />\nThe Spring Top Coat<br /><br />\nAccording to Captain Wilson<br />\nDuffy, the tennis team will have a<br />\nvery attractive schedule this spring.<br />\nDuffy, who is manager of the team<br />\nWe have them in unusually attractive<br />\nas well as captain, has arranged<br />\nmodels. Loose swagger backs, with<br />\nmatches with some of the best color set-in sleeves, and priced<br />\nraglan<br />\nlege teams in this part of the counready-to-wear at<br />\ntry; some of which are to be played<br />\nmatch<br />\nfirst<br />\non foreign courts. The<br />\nof the season will be played with<br />\non Line to the Gulf, and from the Georgetown on April 7 in WashMississippi to the coast. For this, ington. The Hopkins team will<br />\nthe first contest, a writable subject travel to Annapolis on April 12 to<br />\nhas been selected, which is as fol- meet the Navy racqueters, and<br />\nlows: \"Contributions of the College Swarthmore will come to Homewood to compete with the local<br />\nNewspaper to College Life.\"<br />\nteam on April 14. There have been<br />\nThe contest opens immediately no other games definitely scheduled,<br />\nand will close April 10, 1922, at but Captain Duffy is negotiating<br />\n211-213 E. BALTIMORE ST.<br />\nwhich time editorials must be in the with Gettysburg, Bucknell, West<br />\ncomand<br />\nPoint, New York University<br />\nhands of Hon. N. B. Forrest,<br />\nCollege.<br />\nDickinson<br />\nHeadGeneral<br />\nhief,<br />\nmander-in-c<br />\nA<br />\ncall<br />\nfor<br />\ntennis candidates will<br />\nThe Episcopal Church of<br />\nquarters, Sons Conferedate Vetabout March 14,<br />\nbe<br />\nmade<br />\nprobably<br />\nchairis<br />\nwho<br />\nerans, Atlanta, Ga.,<br />\nSt. Michael and All Angels<br />\ndeclares Captain Duffy. The canman of the committee of judges. didates who are expected to report<br />\nMEN'S SHOES<br />\nST. PAUL and TWENTIETH STS.<br />\nOf the Better Class<br />\nAppropriately designed gold, sil- for practice are Duffy, Wells, JaWyatt Brown, D.D., Litt.D., Rector<br />\nbe<br />\nwill<br />\nmedals<br />\nbronze<br />\nver and<br />\ncobsen, Rowland and Totterdale, Holy Communion at 7.30<br />\nawarded for first second and third of last year's team, besides a great Young Men's Bible Class, 9130<br />\nplaces in the contest, while every number of inexperienced men.<br />\nURNER BROTHERS<br />\nWith this good material in hand, Morning Service, 11 o'clock<br />\nwriter getting his editorial sent to<br />\nEvening Service, 8 o'clock<br />\n111 E. BALTIMORE STREET<br />\nHopkins will probably turn out an<br />\nBALTIMORE<br />\nthe judges will receive a Certificate excellent team.<br />\nSpecial Invitation to Hopkins Students<br />\nMention.<br />\nHonorable<br />\nof<br />\nThe editorials must not exceed HONORARY FRATERNITY TO HOLD<br />\nST. DAVID'S<br />\nINITIATION<br />\n500 words and are to be typewritProtestant Episcopal Church<br />\nThe newly pledged members of<br />\nten on one side of regular plain<br />\nCorner<br />\nOAKDALE ROAD and ROLAND AVE.<br />\nN. W.<br />\nSigma Chi Beta will be formally iniletter-size sheets.<br />\nRoland Park<br />\nIn order to save embarrassment tiated at the Beta Theta Pi fraterThe<br />\nSaturday.<br />\nnext<br />\nSouthhouse<br />\nnity<br />\nand<br />\nlocal<br />\nthe<br />\nof<br />\npart<br />\nthe<br />\non<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\nern committees, assumed names are pledges are all men prominent on the<br />\nSUNDAY SERVICES<br />\nrequired on the upper right hand campus, and their initiation should<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\ncorner of the editorials and that materially increase the weight of<br />\n8 P. M.—Choral Evening Prayer<br />\nThe<br />\nuniversity.<br />\non<br />\nin<br />\nthe<br />\nfraternity<br />\nrequired<br />\nthe<br />\nis<br />\nsame assumed name<br />\nplain sealed envelope, in which the old members gave a large dance<br />\nproper name, address, school and last Friday at L'Hirondell in honor<br />\nhome of the writer will be con- of the pledges and some \"prep\"<br />\ntained. The editorial, with this en- school men.<br />\nAt the formal initiation Saturday<br />\nvelope attached, will first be given<br />\nto the local committee, and, still the pledges will be given the pins,<br />\nsealed, sent to general committee which are worn under the regular<br />\nchairman.<br />\nfraternity pins. They are white<br />\n'Awards in this contest will be gold skull and cross-bones, with a<br />\nmade at the annual convention of black and a blue eye and pearl teeth.<br />\nthe association, to be held the latter The Greek letters E X B in black<br />\npart of April at a place yet to be enamel are written across the foreFORTY-SIXTH YEAR OF INSTRUCTION, 1921-22<br />\nhead of the skull.<br />\nselected.<br /><br />\nThe Southern Intercollegiate<br />\nNewspaper Association, which came<br />\nComplete Stock of<br />\nMedical Books and College<br />\ninto being at the University of<br />\nRequisites<br />\nRichmond last spring, has anBooks<br />\nFine<br />\nin<br />\nImporters and Dealers<br />\nnounced a South-wide editorial con301 N. CHARLES ST.<br />\ntest, which is open to all bona fide<br />\nBaltimore, Md.<br />\nstudents of every white college and<br />\nuniversity from the Mason and Dix-<br /><br />\nA Necessity and a Luxury<br /><br />\n$35 and $40.<br /><br />\nCLOTHES<br /><br />\nURNER'S<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br />\n\"<br />\n,<br />\n'exfteito V/te,'‘<br /><br />\nTtis<br />\nAVDOR<br /><br />\nThe Johns Hopkins<br />\nUniversity<br /><br />\nLACROSSE TEAM ROUNDING<br />\nINTO FORM<br /><br />\nMEET FOR BALTIMORE AND<br />\nCANADIAN SCHOOLS<br /><br />\nThe lacrosse team is fast being<br />\nINSTRUCTION<br />\nOn the 17th of March, at the<br />\nwhipped into shape and by the time Fifth Regiment Armory, there will<br />\nfor the first game,it should be one of be held a track meet between Cana- GRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master of Arts; Doctor<br />\nthe most formidable organizations dian and Baltimore schools. In adof Philosophy.<br />\nbeen<br />\nhas<br />\n,winter<br />\nThe<br />\nEast.<br />\nin<br />\nthe<br />\nSCHOOL. Degree: Doctor of Medicine; courses for physidans.<br />\nMEDICAL<br />\nLiterature<br />\nCollege<br />\ndition to the regular events, it has<br />\nbut<br />\npractice,<br />\noutdoor<br />\nfor<br />\nhard<br />\nvery<br />\nARTS AND SCIENCES. Degree: Bachelor *of Arts.<br />\nOF<br />\nCOLLEGE<br />\nLOMBARD and SOUTH STREETS<br />\nbeen decided to have three open<br />\nthere have already been several events.<br />\nDEPARTMENT OF ENGINEERING. Degrees: Doctor of Engineering; Master of<br />\nEngineering; Bachelor of Engineering; Bachelor of Science in Chemistry.<br />\nscrimmages, and with spring now<br />\nAlthough not definitey decided<br />\nSCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Public Health;<br />\ncoming on, this should soon become<br />\nupon, it is expected that Lafayette<br />\nDoctor of Science and Bachelor of Science in Hygiene; Certificate in<br />\na daily occurrence. There is an<br />\nand Hopkins will stage two relays,<br />\nHealth.<br />\nPublic<br />\nTeach a Lesson in Style<br />\nunusually large number of promaddiIn<br />\nmedley.<br />\none<br />\nand<br />\none<br />\nmile<br />\nFOR TEACHERS. Degree of Bachelor of Science.<br />\nCOURSES<br />\nCOLLEGE<br />\nThey possess the \"dash\" that<br />\nising candidates, and it will only<br />\ntion, Mr. Kistler hopes to have the SUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of Arts<br />\nappeals to college men, toned<br />\nbe by hard, consistent work that<br />\ndown to distinctiveness. And<br />\nor of Science. Also for graduates in Medicine.<br />\nNavy and Hopkins participate in<br />\nwearing qualities that provoke<br />\neven the old men from last year<br />\nthree relays—a half mile, mile and EVENING COURSES in Business Economics and for Technical Workers.<br />\nenthusiasm.<br />\ncan land a permanent berth. The<br />\nmedley.<br />\nN. HESS' SONS<br />\nfirst game, on April 1, with the<br />\nAlumni, should be an easy victory<br />\n8 E. BALTIMORE ST.<br />\nTHE SYRACUSE WITS<br />\nfor the Varsity, since the Alumni<br />\nUniversity professors,<br />\nSHOES<br />\nteam will be materially 'weakened. Syracuse<br />\nPUBLICATIONS.<br />\nselect the most JOHNS HOPKINS PRESS<br />\nyear<br />\neach<br />\nwho<br />\ndue to the fact that some of their<br />\nSTATE BUREAUS: Geological Survey; Weather Service; Forestry.<br />\noriginal and oddest answers given<br />\nmen will play with Mt. WashingUNIVERSITY MEN<br />\non mid-year examinaon that date. by students<br />\nFor Sport Wear ton against St. John's<br />\nFor Dress<br />\nBUILDINGS<br />\ntion papers, have released a list<br />\n'Smart Styles—Best Leathers<br />\nof<br />\nsome<br />\nto<br />\ndo<br />\ncredit<br />\nwould<br />\nwhich<br />\nMILK<br />\nSKIMMED<br />\nModerate Prices<br />\nDr. A., a very popular alumnus, Thomas A. Edison's famous ques- GILMAN HALL—general library, class rooms, biology, administration.<br />\nis training his youngster to take an tions. A part of the list follows: MECHANICAL AND ELECTRICAL ENGINEERING—housing also Physics and College Chemistry.<br />\nactive interest in Hopkins affairs. Dido means \"just the same\";<br />\nmanua<br />\nwas<br />\nENGINEERING—housing also Geology.<br />\nA.<br />\nDouglas<br />\nStephen<br />\nCIVIL<br />\n19 W. LEXINGTON ST.<br />\nLast fall he came home from a footmade<br />\nPaul<br />\nshoes;<br />\nof<br />\nfacturer<br />\nPOWER HOUSE.<br />\nball game and told her:<br />\nafter<br />\none<br />\nlast<br />\nthe<br />\nBOTANY AND PLANT PHYSIOLOGY—with Greenhouses and Botanical Garden\"Hopkins took a football game three journeys,<br />\nthePetrine<br />\nthe<br />\nhis martyrdom;<br />\nCHEMICAL LABORATORY—for graduate work.<br />\nfrom Western Maryland today.\"<br />\nwords,<br />\nChrist's<br />\nPHYSIOLOGICAL BUILDING.<br />\n\"And what did they take from ory was based on<br />\nwas<br />\nof Arc<br />\nANATOMICAL LABORATORY.<br />\nMADE TO ORDER<br />\nCity Dairy?\" she mildly inquired. \"Feed my goat\"; Joan<br />\nNew<br />\nLABORATORIES.<br />\ncaptured<br />\nwho<br />\ngirl<br />\na<br />\npeasant<br />\nHUNTERIAN<br />\nAND<br />\nof PATHOLOGICAL LABORATORY.<br />\na<br />\nSultan<br />\nwas<br />\n\"Am<br />\nand<br />\ntelegram:<br />\nsick<br />\nSedan<br />\nSon's<br />\nOrleans;<br />\nFINISHED CLOTHES<br />\nhave no money.\"<br />\nTurkey; hordes of Goths, Lom- SCHOOL OF HYGIENE.<br />\nPLAZA BUILDING<br />\nDad's reply:\"Am well and have bards and Osteopaths overran CARROLL MANSION—Johns Hopkins Club.<br />\nSouthern Europe.<br />\nplenty.\"—Exchange.<br />\nSTUDENT ACTIVITIES BUILDING.<br />\n19 AND 21 EAST FAYETTE ST.<br /><br />\n8441000<br /><br />\nHess Shoes<br /><br />\nWYMAN<br /><br />\nLEMMERT<br /><br />"}], "field_media_file": [{"target_id": 37603, "display": null, "description": null, "target_type": "file", "target_uuid": "d4a43a8c-3988-415d-b951-247e0672b1c0", "url": "http://digital.library.jhu.edu/system/files/2022-03/12991-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12991, "target_type": "node", "target_uuid": "689134cb-a865-4fad-9603-ec81d9253b14", "url": "/node/12991"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "06232b3e-8ddf-479a-81a3-5d572c9add5c"}]}