{"mid": [{"value": 51439}], "uuid": [{"value": "ee5cda44-db45-4fba-982e-a3f1465290ca"}], "vid": [{"value": 51439}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-20T03:30:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "16207-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-20T03:30:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-20T03:30:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "AYVHEIT ¥IMOHN3ISI3 3HL<br />\n<br />\nm’v’v L 3‘\\9 “\\ZO LGl L\\\\\\\\‘S<br />\n<br />\nHISTORICAL POINTS<br />\n<br />\nWESTERN MARYLAND<br />\n<br />\n“McCulloch’s Path.” The first trail through the Glades. George Washington<br />\nstopped here, September 26, 1784, for lunch, but got nothing but boiled<br />\n<br />\ncorn.<br />\n<br />\n“Charles Friend’s Home.” George Washington stopped here on Septem-<br />\ntéer 26, 1784, looking for the best route from the Potomac to the Ohio<br />\n<br />\niver.<br />\n<br />\n“Bear Camp.” General Braddock’s 6th Camp on the march to Fort Du-<br />\nquesne, June 20-21, 1755.<br />\n<br />\nGeneral Braddock’s 5th Camp on the ill-fated march to “Fort Duquesne,”<br />\nJune 19, 1755.<br />\n<br />\nWhere George Washington was taken sick and remained for a few days<br />\ntill he could proceed and catch up with Braddock.<br />\n<br />\n“The Little Crossings’’ of the Youghiogheny River (now called Castleman’s<br />\nRiver). Old stone arch bridge built in 1813. An arch of 80 foot span, the<br />\nlongest built up to that time.<br />\n<br />\n“Ljttle Meadows.” Braddock’s fourth Camp on the march to “Fort<br />\nDugquesne,” 1755. Washington stopped here many times afterwards.<br />\n“Savage River Camp.” Braddock’s 3rd Camp, 1755. Many of the wagons<br />\n<br />\nwere broken descending the mountain.<br />\n<br />\n“Martin’s Plantation”” (near Frostburg). Braddock’s 2nd Camp, 1755.<br />\n<br />\nFirst Toll Gate House on National Road.<br />\n<br />\nBronze tablet on boulder, in memory of the Pioneers who traveled this<br />\nhistoric road. Erected by the D. A. R.<br />\n<br />\nThe National Road. First internal improvement undertaken by the U. S.<br />\nGovernment.<br />\n<br />\nFirst Iron Rails manufactured in the U. S. at Mt. Savage.<br />\n<br />\n“The Narrows,” the bridge to carry the new route of the National Highway<br />\nover Will’s Creek, built 1833.<br />\n<br />\n“Spendelow Camp.” Braddock’s 1st Camp out of Fort Cumberland. This<br />\nroute went over “Will’s Mountain.”<br />\n<br />\nCumberland—For further information apply at Hotels and Chamber of<br />\nCommerce. (a) The beginning of Braddock’s original road. (b) the site<br />\nof Old Fort Cumberland. (c) George Washington’s headquarters. (d) The<br />\nParade Ground of Old Fort Cumberland. (e) The Thomas Cresap<br />\nMonument in Riverside Park. (f) The original Headquarters House in<br />\nRiverside Park.<br />\n<br />\n‘“Washington’s Road.” Washington’s troops first opened this road from<br />\nCumberland to Reas-Town (Bedford, Pa.) in July, 1758.<br />\n<br />\nWhere Jane Frazier was captured by the Indians in 1754. Original house<br />\nstill standing.<br />\n<br />\nOld Fording Place across the Potomac of the Warriors Path, and site of the<br />\nStockade Fort of Col. Thomas Cresap. Washington stopped here many<br />\n<br />\ntimes.<br />\n<br />\n“The Warriors Path.” War path of the five nations of Indians of New York<br />\nState to the Carolina Mountains.<br />\n<br />\n“Old Mr. Flint’s Home.” Visited by Washington in 1769, while visiting<br />\nat Berkeley Springs, W. Va.<br />\n<br />\nSite of Tonoloway Fort. Built 1755 as a protection against the Indians.<br />\nIt now belongs to the State.<br />\n<br />\nSite of Fort Coombe, a stockade fort of 1756. One of a line of forts across<br />\nPennsylvania and Maryland.<br />\n<br />\nSt. Thomas Church, Hancock. Founded 1835. During 1861-62 used as a<br />\nhospital for Union Troops.<br />\n<br />\nSite g&Fort Mills on Licking Creek, as an outlying fort for Fort Frederick,<br />\n<br />\n1756.<br />\n<br />\nRoad to Fort Frederick. Built 1756. The best preserved stone fort of<br />\nColonial days in America.<br />\n<br />\nGen. J. E. B. Stuart’s cavalry on his raid after the Battle of Anteitam<br />\ncrossed the National Road here, Oct. 10, 1862.<br />\n<br />\nThe Federal signal station on the top of Fairview Mountain was captured<br />\nby J. E. B. Stuart’s cavalry, Oct. 10, 1862 ¢<br />\n<br />\nAnother road at Clearspring leading to Fort Frederick. *<br />\n<br />\nThe house of Lancelot Jacques, built about 1766, at Green Spring Furnace.<br />\n<br />\n“The Bank Road” built between 1816-21. Financed by the Banks of<br />\nMaryland in consideration of the renewal of their Charters.<br />\n<br />\nGen. Lee’s ammunition train captured here, September 15, 1862.<br />\n<br />\nGen. J. E. B. Stuart attacked a large Pennsylvania force here September<br />\n20, 1862, but being outnumbered retired across the Potomac.<br />\n<br />\nWilliamsport. An important point during the French and Indian War. It<br />\nwas considered as one of the sites for the capital of the United States,<br />\nbut George Washington chose the site of the present Washington, D. C<br />\n<br />\nThe Long Meadow. Originally patented in 1739 to Colonel Thomas Cresap.<br />\n<br />\nMason and Dixon Line. The 105th Milestone erected in 1763. The 104th,<br />\n103rd, 102nd and 101st with M. on the Maryland side and P. on the<br />\nPennsylvania are all visible along the road along the line.<br />\n<br />\nMason and Dixon Line. The 100th Milestone. One of the “Crown’’ stones<br />\nset every five miles. On one side Lord Baltimore’s coat of arms, and<br />\nWilliam Penn’s on the other.<br />\n<br />\nCol. Nathaniel Rochester who founded Rochester, N. Y., lived for many<br />\nyears in Hagerstown.<br />\n<br />\nGen. Robert E. Lee entered Hagerstown Sept. 11, 1862, along this road.<br />\n<br />\nGen. Edward Braddock crossed into Virginia near this point in April, 1755.<br />\n<br />\nAn Indian Deed to Israel Friend, 1727. “‘Beginning at the mouth of Antie-<br />\ntam Creek, thence 200 shoots of an arrow up the Potomac,” etc.<br />\n<br />\nHouse where John Brown and his accomplices gathered together arms<br />\nand ammunition for the raid on Harpers Ferry.<br />\n<br />\nHarpers Ferry Bridge where John Brown crossed in his raid on Harpers<br />\nFerry, Oct. 17, 1859.<br />\n<br />\nWashington-Frederick County Line. Washington County was the first<br />\nCounty in the U. S. named for the Father of his country.<br />\n<br />\n“Crampton’s Gap”’ and “South Mountain,” .an important battle of Sept.<br />\n14-15, 1862. Six U. S. markers mark the spot, and a large stone arch<br />\ncrowns the crest.<br />\n<br />\n“Needwood Forest,” the home of Governor Thomas Sim Lee.<br />\n<br />\nBraddock’s Heights and Braddock’s Spring, marked by a bronze tablet<br />\non a large boulder.<br />\n<br />\n110-577<br />\n<br />\n114-560<br />\n<br />\n154-690<br />\n170-682<br />\n175-682<br />\n198-684<br />\n<br />\n216-684<br />\n248-681<br />\n254-660<br />\n262-665<br />\n278-662<br />\n286-662<br />\n<br />\n271-683<br />\n297-672<br />\n<br />\n300-666<br />\n304-666<br />\n<br />\n316-684<br />\n312-644<br />\n347-622<br />\n<br />\n366-678<br />\n450-680<br />\n463-686<br />\n470-690<br />\n472-680<br />\n506-666<br />\n517-659<br />\n524-662<br />\n528-662<br />\n533-663<br />\n530-652<br />\n570-664<br />\n<br />\n594-650<br />\n572-644<br />\n<br />\n568-644<br />\n<br />\n582-682<br />\n597-688<br />\n<br />\n617-688<br />\n<br />\n597-659<br />\n610-660<br />\n580-592<br />\n590-580<br />\n594-566<br />\n592-542<br />\n608-546<br />\n619-573<br />\n<br />\n634-576<br />\n658-579<br />\n<br />\nGeneral Braddock travelled this road in a coach and six horses on his way 675-578<br />\n<br />\nto Fort Duquesne.<br />\nWhere Gen. Meade took command of the Federal Army.<br />\n<br />\n684-566<br />\nFrederick. (a) Site of the Brothers Taverti where Washington stopped. 685-576<br />\n<br />\n(b) Statute at grave of Francis Scott Key. (c) Tablet at old barracks<br />\nbuilt in 1777. (d) Tablet at corner of Church and Market Streets. (e)<br />\nTaney House (Bentz Street). (f) Barbara Fritchie House. For additional<br />\ninformation apply at Hotels and Chamber of Commerce. B<br />\n<br />\nGovernor Johnson’s House, where Washington stopped several times. 688-604<br />\n<br />\nWinfield Scott Schiey was born here.<br />\n<br />\nCatoctin Furnace, an important lron Furnace during the Revoiutipn, 1776.. 678-636<br />\n“Jug Bridge,” where Lafayette was met by the Citizens of Frederick, 1824. 696-571<br />\nHeadquarters of Generals Robert E. Lee, Stonewall Jackson and Long- 688-566<br />\n<br />\nstreet, Sept. 6-9, 1862.<br />\n<br />\n“Monocacy Battlefield,” July 9, 1864. Apply for pamphlets at Frederick. 685-562<br />\n“Carrollton,” 10,000 acres of land from which Charles Carrol derived the 686-516<br />\n<br />\ntitle, Charles Carrol of Carrollton.<br />\n<br />\nRoute taken by Gen. Anthony Wayne in 1781 on his march from Phila- 670-528<br />\n<br />\ndelphia to Virginia.<br />\n<br />\n“Knowlands Ferry.” Washington stopped here on August 5, 1785. 670-522<br />\n“Amelung Glass %Vorks.\" First glass works in America was established 697-547<br />\nhere in 1789.<br />\n“Peter’s Tavern.” Washington stopped here on June 30, 1791. 700-544<br />\n“Dowdens Ordinary” (Inn). Stopping place of Braddock’s troops in 1765 721-512<br />\n(at Clarksburg). $ :<br />\nSugar Loaf Mountain. So called by Baron Graffenried, a Swiss Nobleman, 690-524<br />\nin 1710.<br />\n“Whites Ferry.” Important crossing of the Potomac during the Civil War. 652-482<br />\nWoodstock. Farm owned by Washington at the time of his death. 702-472<br />\nGeneral E%\\gard Braddock travelled this road on his way to Frederick in 750-470<br />\nApril, 1755.<br />\nRockville. (a) Site of camping grounds of Braddock’s troops, 1755. (b) 758-456<br />\nJ. E. B. Stuart’s raid, 1863.<br />\nGreat Falls of the Potomac. One of the most picturesque spots in Maryland. 729-425<br />\nWestminster. The first complete county rural free delivery service in the 801-634<br />\nUnited States.<br />\nUnion Mills. Gen. J. E. B. Stuart’s Camp on June 29, 1863, and Gen. James 792-669<br />\nBarnes’ Camp on June 30, 1863, on their way to Gettysburg.<br />\n“Goods’ Tavern.” Washington stopped here, July 2, 1791. 750-665<br />\n“Cookerly’s Tavern.” Washington stopped here on July 1, 1791. 712-619<br />\n“Terra Rubra.” Birthplace of Francis Scott Key. 8 710-619<br />\nOld Friends Meeting House, of which President Hoover’s ancestors 750-632<br />\nwere members.<br />\nFirst Reaping Machine in the world was invented here. 761-631<br />\n“Doughoregan Manor.” The home of Charles Carroll of Carrollton. The 830-526<br />\nlast survivor of the signers of the Declaration of Independence.<br />\n“Ellicott’s Mills.” Terminus of the B. & O. R. R. in 1830. 857-522<br />\n“Rolling Road.” A Colonial road built for the purpose of rolling hogsheads 869-538<br />\nof tobacco to Elk Ridge Landing. .<br />\n“Old Court Road.” the road to the Court at Joppa Town. 871-560<br />\nNORTH CENTRAL MARYLAND<br />\nSite of Home of Governor Augustus W. Bradford which was burned by 906-564<br />\nConfederate troops on July 11, 1864.<br />\n“Joppa Road.” Originally an Indian Trail. 927-571<br />\n“Garrison Forest Church.” Built for the Forest inhabitants of St. Paul’s 869-573<br />\nChurch, Baltimore, 1742.<br />\nOld Court Road. The original road leading to the Court at Joppa Town. 871-560<br />\nThe Old United States Arsenal. Built in 1816 after the close of the War of 877-562<br />\n1812.<br />\n“The Garrison Fort.”” Built in 1695 as a protection against hostile Indians. 869-573<br />\n“Nicholson’s Manor.” 4200 acres granted to William Nicholson 1719. 886-606<br />\n“The Valley of Jehosophat.” 2500 acres patented 1685, now known as 927-594<br />\nDulaney’s Valley.<br />\n“The Eagle’s Nest.” Part of “The Valley of Jehosophat” which was con- 927-594<br />\nfiscated as British owned property and repatented in 1788.<br />\n“Quinn” or “Sweet Air.” Patented 1704. Long associated with the Carroll 930-612<br />\nfamily. House built about 1752.<br />\nThe Baltimore and Yorktown Turnpike Road. Authorized 1805, to rebuild 895-635<br />\nthe road laid out by the State in 1787.<br />\n40th Milestone on the Mason and Dixon Line, surveyed and marked 925-685<br />\n1763-68.<br />\n“Black Horse Tavern.” Where Washington spent the night on his way 927-653<br />\nback from New York in 1773.<br />\nSt. James Church, My Lady’s Manor, started 1750. . 921-628<br />\nClynmalyra, 5,000 acres surveyed 1705 for Charles Carroll, Lord Balti- 908-636<br />\nmore’s Attorney-General; in 1822, his great-great grandson Henry<br />\nCarroll built the house. )<br />\n“My Lady’s Manor.” 10,000 acres owned by Lady Baroness of Baltimore. 927-638<br />\nBel Air. County seat of Harford County since 1783. See portraits and 984-620<br />\nmurals in Court House and Post Office.<br />\n“Olney.” Patented 1704 as “Prospect.” ; 982-612<br />\n“Harry Gilmor’s Raid.” A serious Confederate invasion of Maryland. 975-608<br />\n“Jerusalem Mills.” Established in 1772 by David Lee, a Quaker from 972-594<br />\nBuck’s County, Pennsylvania.<br />\n“The House of Ishmael Day.” who shot a Confederate Cavalryman at- 975-608<br />\ntempting to pull down his {Jnion flag during Harry Gilmor’s raid. :<br />\n“The Sweathouse Road,” called from the Indian practice of throwing 960-588<br />\nwater on heated stones to generate steam, an Indian “Turkish Bath”<br />\nfor a curative purpose. :<br />\nPerry Hall. The home of Harry Dorsey Gough. One of the largest colonial 951-375<br />\nhouses in Maryland. Y<br />\n“The Joppa Road.”” An old Indian trail used as a route to Joppa, the 958-572<br />\nCounty$eat of Baltimore County 1712.<br />\nThe Baltimore and Harford Turnpike, built 1816. 950-590<br />\n“Battle of North Point,”” September 12, 1814. i 943-528<br />\nBritish attack on Baltimore on the Battlefield of North Point. 943-528<br />\n<br />\nBaltimore. For information regarding points of historic interest apply to<br />\nthe Mayor and City Council, Chamber of Commerce and Hotels.<br />\n<br />\nRochambeau’s Camp at Whitemarsh on his way to Yorktown, 1781, and 960-565<br />\non his return to the north.<br />\n<br />\nSite of “The Red Lion Tavern’” where Washington stopped over 25 times. 966-554<br />\n<br />\n“The Gunpowder River.” So called as early as 1660. 993-550<br />\n<br />\n“Joppa Town.” County seat of Baltimore County, 1712 to 1768. A port 982-584<br />\nfrom which tobacco was shipped to England. Long the rival of “Balti-<br />\nmore Town.”<br />\n<br />\n“The Gunpowder Neck.” One of the earliest settled portions of Baltimore 998-565<br />\nCounty, now the site of Fort Hoyle and Edgewood Arsenal.<br />\n<br />\nBirthplace of William Paca, signer of the Declaration of Independence. 997-588<br />\n<br />\nCapt. John Smith ascended to this point 1608. 1014-596<br />\n<br />\nSophia’s Dairy. Built 1768, by Aquila Paca. 1020-600<br />\n<br />\nSite of “Old Baltimore,” 1683. 1st County Seat of Baltimore County. 1011-594<br />\n<br />\n““‘Spesutia P. E. Church” (St. George’s Parish). Founded 1671. 1025-599<br />\n<br />\n“Constant Friendship” Owned by Col. Thomas White, father of Bishop 995-598<br />\nWilliam White.<br />\n<br />\n“Cokesbury College” the first Methodist College in the world established 1014-604<br />\n1785.<br />\n<br />\nRochambeau’s troops camped here 1781 on their way to Yorktown. 1018-605<br />\n<br />\n“Harford Town’”’ or “Bush.” The first Declaration of Independence was 1016-626<br />\nsigned here March 22, 1775.<br />\n<br />\nRochambeau’s troops camped here in 1782 on their way back from the 1035-612<br />\nvictory of Yorktown.<br />\n<br />\nAberdeen Proving Grounds. Military reservation of 55,000 acres of land 1047-595<br />\nand water.<br />\n<br />\nSpesutia Island (Utie’s Hope), 2300 acres surveyed 1658. The only Manor 1061-592<br />\nin 1I-ég£ford County. Treaty with the Susquehanna Indians made here<br />\nin k<br />\n<br />\nRochambeau’s Camp (near the Havre de Grace Race Track). Here in 1781 1054-624<br />\nthe troops camped on their way to Yorktown.<br />\n<br />\nHavre de Grace. Orginally called Susquehanna Lower Ferry. Washington 1056-626<br />\nstopped here many times.<br />\n<br />\nJohn O’Neill’s memorial and gun used in the defense of Havre de Grace 1056-62b<br />\n1814 (in City park).<br />\n<br />\n“Tudor Hall.”” Birthplace of Edwin Booth and John Wilkes Booth. 982-635<br />\n<br />\n“Maedical Hall.” The home of Dr. John Archer, the first graduate of medi- 992-624<br />\ncine in America.<br />\n<br />\nChurchville. Rochambeau’s heavy artillery here September, 1781, on way 1012-630<br />\nto Yorktown.<br />\n<br />\n“Indian Spring.” Where Rochambeau’s heavy artillery camped after 1016-670<br />\ncrossing the Susquehanna River.<br />\n<br />\nLafayette marker pointing to Col. Rigbie’s house. 1025-658<br />\n<br />\nLafayette at Col. Rigbie’s House April 13, 1781, where he quelled a 1025-658<br />\nmutiny of his soldiers.<br />\n<br />\nConowingo (site of the Conowingo Dam) an Indian name meaning “At 1034-667<br />\nthe Falls.”<br />\n<br />\nSOUTHERN MARYLAND<br />\n<br />\nAnnapolis, Capital of Maryland and site of the U. S. Naval Academy, also 942-416<br />\nnumerous points of historical interest. For additional information apply<br />\nat Hotels and Chamber of Commerce.<br />\n<br />\nGovernor Ritchie Highway and Memorial. 915-473<br />\n<br />\n“Whitehall.” The home of Governor Horatio Sharpe, considered the finest 959-431<br />\nexample of Colonial country houses in Maryland.<br />\n<br />\n“Widow Ramsey’s Tavern,” on the General’s Highway. 905-465<br />\n<br />\nWashington and Rochambeau passed over this road on their way to York- 920-431<br />\ntown.<br />\n<br />\nRoute taken by Washington on his way to Annapolis to resign his com- 906-446<br />\nmission. (Bronze tablet at Severn cross roads).<br />\n<br />\n“Belvoir.” Rochambeau’s troops camped here on their way to Yorktown. 918-434<br />\n<br />\n“Three Mile Oak.” Portion of the old tree where citizens of Annapolis met 928-420<br />\nGeneral Washington in 1783, on his way to resign his commission.<br />\n<br />\nBirthplace of Johns Hopkins, May 19, 1795. Founder of Johns Hopkins 894-440<br />\nHospital and University.<br />\n<br />\n“Elk Ridge Landing.” An important Colonial Port for the shipment of 881-502<br />\ntobacco.<br />\n<br />\n“Spurrier’s Tavern.” Visited over twenty-five times by Washington. 857-482<br />\n<br />\n“Montpelier.”” The Colonial home of Col. Thomas Snowden. 844-448<br />\n<br />\nThe first telegram ever sent in the world passed this spot May 24, 1844, 838-453<br />\n<br />\n“Van Horn’s Tavern.”” A Colonial Inn at which Washington stopped many 834-448<br />\ntimes.<br />\n<br />\n“Rhodes’ Tavern.” George Washington’s last stopping place in Maryland. 820-403<br />\n<br />\nThe first Agricultural College in the Western Hemisphere started 1754. 816-419<br />\n<br />\n“Rossburg Inn.”” A famous Colonial stopping place. 820-403<br />\n<br />\n“Adelphi Mill.”” Built 1796. 812-420<br />\n<br />\n“Bladensburgh.” Site of the Battle of Bladensburgh, War of 1812. 820-403<br />\n<br />\n“Mount Lubentia.”” The home and school of the Rev. Jonathan Boucher, 848-388<br />\nthe tutor of Jackie Custis. .<br />\n<br />\n“St. Barnabas Church,” erected in 1774. Washington and Governor Eden 811-359<br />\nattended services here together.<br />\n<br />\n“Northampton.” The birthplace of Albert Lord Fairfax. 874-418<br />\n<br />\n“Queen Anne.”’ A post town in 1707, where Washington stopped. 891-387<br />\n<br />\n“Tulip Hill.” Colonial home of Samuel Galloway, built in 1756. 932-379<br />\n<br />\n“Rawlings’ Tavern,” Washington dined here on September 26, 1773. 916-386<br />\n<br />\n“Larkins Hills,” where Lord Baltimore and the Assembly met, 1683. 914-388<br />\n<br />\nWilliam Penn came to the home of Colonel Thomas Tailler on December 908-376<br />\n13, 1682, for his first conference with Charles Lord Baltimore as to the<br />\nlocation of the Maryland-Pennsylvania Boundary Line.<br />\n<br />\nWilliam Penn visited William Richardson near this spot on December 13, 929-368<br />\n1682.<br />\n<br />\nWilliam Penn attended a meeting of the Friends (Quakers) at Thomas 932-358<br />\nHooker’s in 1682.<br />\n<br />\n“Portland Manor’’ surveyed 1667. 898-354<br />\n<br />\nMarlborough. County seat of Prince George’s County since 1720. 870-358<br />\n<br />\nSite of home and grave of Dr. Beanes whose arrest by the British in 1814, 862-352<br />\nwas the cause of Francis Scott Key writing the ‘“Star Spangled Banner.”<br />\n<br />\nThe first Bishop consecrated in the United States, Thomas John Claggett. 870-345<br />\n<br />\nBirthplace of Archbishop John Carroll. 877-343<br />\n<br />\nMarking the route of Washington from Annapolis to Mt. Vernon in 1783. 850-356<br />\n<br />\n“hgglwgod Park.” The home of Ignatius Digges and Governor Thomas 849-354<br />\n<br />\nim Lee.<br />\n<br />\n“Mount Airy,” The home of Benedict Calvert, whose daughter married 854-348<br />\nWashington’s stepson.<br />\n<br />\n“Mrs. Surratt’s House.” where John Wilkes Booth stopped to secure 829-339<br />\nammunition.<br />\n<br />\n“T. B.”” The initials of Thomas Brooke on a boundary stone at Brookfield. 834-316<br />\n<br />\n“Dr. Mudd’s House.” Home of Dr. Mudd, who set the broken leg of John 862-255<br />\nWilkes Booth.<br />\n<br />\n“De La Brooke Manor.” Surveyed in 1650 for Robert Brooke, Commander 866-298<br />\nof Charles County.<br />\n<br />\n“Three Notch Road.”” An early law provided that three notches marked on 920-190<br />\ntrees indicated a road to a ferry.<br />\n<br />\nCharlotte Hall School, continuously open since 1796. 863-230<br />\n<br />\n“Ye Coole Springs.” The first medicinal springs in America. 863-235<br />\n<br />\nBenedict. British troops landed here August ,1814. 892-247<br />\n<br />\n“District Line.” Point where Washington first entered Prince George’s 818-394<br />\nCounty, Maryland (1751).<br />\n<br />\n“Oxon Hill.” Home of the Addison family. John Hanson died here. 804-351<br />\n<br />\n\"Bro?g?%reek Church.” Mother Church of the District of Columbia, erected 800-336<br />\nin b<br />\n<br />\nFort \\tNashington built by Major L’Enfant who laid out the City of Wash- 792-320<br />\nington.<br />\n<br />\nWarburton Manor. The Digges home visited by Washington many times. 792-330<br />\n<br />\n“Piscataway Town.” Visited by Governor Leonard Calvert, March 1634, 807-316<br />\n(before he landed at St. Mary’s) to visit the Indian Emperor.<br />\n<br />\nMarshall Hall. Maryland landing of Washington’s private ferry. 772-310<br />\n<br />\n“Araby.” The Colonial home of Widow Eilbeck, whose daughter married 780-260<br />\nGeorge Mason.<br />\n<br />\n“Widow Chapman’s.” Mt. Aventine on the Potomac opposite Gunston 770-288<br />\nHall, Virginia.<br />\n<br />\n“Governor Smallwood’s Home.”” Washington here in October, 1785. 742-256<br />\n<br />\n“Durham Church.” Built 1732. Rebuilt in 1791. 755-233<br />\n<br />\n“Washington’s Farm.” 600 acres acquired by him in 1775. 738-226<br />\n<br />\n“The Retreat.”” Home of Daniel of St. Thomas of Jenifer. 795-248<br />\n<br />\n“Rose Hill.” The home of Dr. Gustavus Brown, one of Washington’s 795-248<br />\nphysicians.<br />\n<br />\n““‘Habre de Venture,” the home of Thomas Stone, signer of the Declaration 800-266<br />\nof Independence.<br />\n<br />\nPort Tobacco. The County Seat of Charles County until 1895. 795-248<br />\n<br />\n“La Grange,” the home of Dr. James Craik, Washington’s lifelong friend 795-248<br />\nand physician.<br />\n<br />\n“Samuel Cox’s Farm,” where John Wilkes Booth and his accomplice hid 804-229<br />\nfor several days.<br />\n<br />\nCedar Point. Washington’s schooner ran aground here in February, 1766. 844-156<br />\n<br />\n“Laidlow’s Ferry.” Washington crossed here many times on his way to 803-193<br />\nWilliamsburg.<br />\n<br />\n“Wolleston Manor.” Patented in 1642 to Captain James Neale. 835-180<br />\n<br />\nThe birthplace of Roger Brooke Taney, Chief Justice of the United States, 919-258<br />\n1836-64.<br />\n<br />\n“The Cliffs of Calvert.” One of the most picturesque spots in Maryland. 938-265<br />\n<br />\n“':1?352270“ Patuxent.” Seat of the Puritan government of Maryland, 952-196<br />\n<br />\n“Nllgatltapany.)\" Site of 1st Jesuit Mission, later home of Charles (3rd Lord 965-162<br />\n<br />\naltimore).<br />\n<br />\n““Manor of Cornwaley’s Cross.” One of the oldest homes in Maryland. 982-096<br />\n<br />\nSaint Mary’s City. (a) Reproduction of State House of 1676. (b) Monument 963-129<br />\nto Leonard Calvert. (¢c) Trinity Church, erected from bricks of first State<br />\nHouse of 1676. (d) Site of the 1st State House. (e) Governor Lionel Cop-<br />\nley’s tomb. (f) “Mattapany Street,” the first road opened in Maryland.<br />\n(g) “Freedom of Conscience’’ monument. (h) “Father White’”” memorial.<br />\n(i) “Memorial Gateway.” (j) St. Mary’s Seminary. (k) Site of first mill<br />\nin Maryland. (1) Governor’s Spring. (m) Site of first Catholic Church.<br />\n<br />\nSt. Mary’s Female Seminary. The State’s 200th anniversary memorial 963-129<br />\nestablished 1839.<br />\n<br />\nPoint Lookout. Site of Prison Camp during Civil War; where 3,000 Con- 995-075<br />\nfederate prisoners died.<br />\n<br />\nSt. Clement’s Island. First landing place of the Colonists from the Ark and 874-137<br />\nthe Dove on March 25, 1634.<br />\n<br />\n“Deep Falls.” Home and burial place of Dr. James Thomas, Governor of 862-195<br />\nMaryland (1833-36).<br />\n“The Monastery.” First carmel in U. S. Founded 1790. 804-268<br />\n‘The Old South River Club.” Oldest Social Club in America. 930-394<br />\nEASTERN SHORE<br />\n“The Proprietors of the Susquehanna Canal’’ one of the first canals in 1048-659<br />\nAmerica, 1783.<br />\n<br />\n“Susquehannock Indian Fort” (site of an important point in the contro- 1042-668<br />\nversy between Penn and Lord Baltimore).<br />\n<br />\n“Smith’s Falls.” In 1608 Captain John Smith ascended the Susquehanna 1040-658<br />\nRiver to this point.<br />\n<br />\n“Cummings Tavern.” Where Rouchambeau’s heavy artillery camped before 1070-658<br />\ncrossing the Susquehanna River.<br />\n<br />\n“Richards’ Oak.” Lafayette’s troops camped under this tree in 1781. 1049-679<br />\n<br />\nWest Nottingham Academy, founded 1744, by Dr. Samuel Finley, who in 1061-671<br />\n1761 became the President of Princeton.<br />\n<br />\n“Nottingham Lots.” Important in the controversy over the Mason and 1074-690<br />\nDixon Line.<br />\n<br />\n“Brick Meeting House,” Established by William Penn in 1702. 1086-683<br />\n<br />\n“Blue Ball Tavern.” Established in 1710, by Andrew Job. 1112-680<br />\n<br />\n“New Munster.” 6,000 acres granted in 1683, to Edwin O’Dwire and 15 1133-681<br />\n<br />\nother Irishmen.<br />\n<br />\nPerryville, Cecil County, terminus of the ‘“Susquehanna Lower Ferry.” 1060-630<br />\n<br />\nRochambeau’s troops camped here on their way to Yorktown in 1781.<br />\n“Susquehanna Manor,” 32,000 acres, one of Maryland’s largest Manors.<br />\n“The Principio Company.” The first iron works in America (1715).<br />\nCharlestown. Laid out in 1742. Washington stopped here many times.<br />\n<br />\n1054-638<br />\n1072-638<br />\n1087-636<br />\n<br />\nNorth East. Site of the iron forges of the “Principio Company.”<br />\n<br />\nElkton, originally called ‘“Head of Elk,” Important during the Revolution.<br />\n<br />\nThe old “Post Road.” where it crosses the Maryland-Delaware Line.<br />\n<br />\n“Bohemia Mannour.” Patented to Augustine Hermann in 1662 ‘“for making<br />\nthe Map of the Province of Maryland.”<br />\n<br />\n“The Labadie Tract.” 3,750 acres occupied 1684 by a Religious Sect who<br />\nled a Communist form of life.<br />\n<br />\n“Worsell Manor,” 1,000 acres patented 1685.<br />\n<br />\nWarwick. Washington stopped here on his way from Fort Cumberland to<br />\nBoston, in 1756, and on several other occasions.<br />\n<br />\nBirthplace of James Rumsey, the inventor of the steamboat.<br />\n<br />\nFredericktown. Discovered and explored by Captain John Smith in 1608-9.<br />\n<br />\nGeorgetown, burned by the British on May 6, 1814.<br />\n<br />\nGalena. Washington stopped here in 1774.<br />\n<br />\nTomb of Brigadier General John Cadwalader.<br />\n<br />\nChestertown. (a) Washington College, founded 1782. (b) Worsell’s Tavern<br />\nwhere Washington stopped. (c) Site of First Free School of Kent County.<br />\n(d) Church where the name of ‘“Prostestant Episcopal church” was<br />\nadopted. For additional information apply for pamphlet at Hotels and<br />\nChamber of Commerce.<br />\n<br />\n“Battle of Caulk’s Field.” September 1, 1814,<br />\n<br />\nRock Hall. Tench Tilghman used this route in carrying the news of the<br />\nvictory of Yorktown.<br />\n<br />\n““Rock Hall Landing.” Eastern Shore Landing of the Colonial Annapolis-<br />\nRock Hall Packet.<br />\n<br />\n“Kent Island”’ (the Isle of Kent). William Claiborne of Virginia established<br />\na trading post, settlement and fort here in 1631.<br />\n<br />\n“Lord’s Gift.” 1,000 acres granted to Henry Coursey, 1658.<br />\n<br />\n“Bolingly.” Surveyed 1658 for James Bowling.<br />\n<br />\n‘“Bloomingdale.” Patented 1685 by Capt. Robert Morris.<br />\n<br />\n“Stagwell.” Patented to Thomas Stagwell, 1649.<br />\n<br />\n“Chesten-on-Wye.”” Surveyed 1659 for John and William Coursey.<br />\n<br />\n‘“Wye Plantation.” Home of William Paca, signer of the Declaration, and<br />\ntwice Governor of Maryland. He lies buried here.<br />\n<br />\n“Wye Island.” Patented to Col. Philemon Lloyd 1682 as ““Lloyd’s Insula.”<br />\n<br />\n“Clover Field.” 1522 acres patented to William Hamsley, 1730.<br />\n<br />\nDenton. Originally called Edenton for Robert Eden, Maryland’s last<br />\nColonial Governor and ancestor of Anthony Eden.<br />\n<br />\nPreston. Started 1846 around “Frazier’s Chapel.”<br />\n<br />\nSite of home of Col. William Richardson, Col. of the “Flying Camp”’ of the<br />\nEastern Shore. His tomb is located here.<br />\n<br />\n‘““Wye House.” Home of the Lloyd family since Colonial times.<br />\n<br />\nSaint Michaels. Attacked by the British during the War of 1812,<br />\n<br />\n“The Mannour of Ratcliffe.” Colonial home of the Holliday family.<br />\n<br />\nWilliam Penn’s visit in 1682 to the Friends Meeting House, the oldest frame<br />\nmeeting house in America.<br />\n<br />\n“Canterbury Manor.” Laid out for Richard Tilghman 1659.<br />\n<br />\nOxford, one of the first towns and ports authorized by Assembly in 1683.<br />\n<br />\n““Hole in the Wall.” Early name of this village located near Whitemarsh<br />\nChurch where Robert Morris’ father lies buried.<br />\n<br />\n“Compton.” Home of Governor Stevens who welcomed General Lafayette<br />\nat Fort McHenry 1825.<br />\n<br />\n“Crosiadore.” The home of the Dickinson family from 1695 to the present<br />\ntime. Dickinson College at Carlisle, Pa. was named after John Dickinson.<br />\n<br />\nCambridge. Originally part of the “Choptank Indian Reservation.” Made<br />\na port of entry 1684.<br />\n<br />\n“Appleby.” The home of Governor Thomas Holliday Hicks.<br />\n<br />\n“The Treaty Oak.” Where the early settlers conferred with Choptank<br />\nIndians for the purchase of land.<br />\n<br />\n“0Old Trinity Church.” Built prior to 1670.<br />\n<br />\n“Ch%pgtank Indian Reservation.” The first Indian Reservation in America,<br />\n1669.<br />\n<br />\nRehoboth, granted Richard Lee of Virginia 1673 (2350 acres). The ancestor<br />\nof the Lees of Maryland. Gov. Thomas Sim Lee was one of them.<br />\n<br />\n“Unr}acokossimmon.” Emperor of the Nanticoke Indians, lived here in<br />\n1677.<br />\n<br />\n“Patty Cannon’s House.” where the noted kidnapping group had head-<br />\nquarters. Described in the novel ‘“The Entailed Hat.”<br />\n<br />\n“Green Hill Town and Port.”” authorized by an Act of Assembly, 1706.<br />\n<br />\nBirthplace of Commodore Stephan Decatur, January 5, 1779.<br />\n<br />\n\"A(slgmi)nokonson” (Indian Town). The largest Indian town in Maryland<br />\n1671). )<br />\n<br />\n“Nassawango Iron Furnace.” built in 1832, by the Maryland Iron Company.<br />\n<br />\n“Birthplace of Samuel Chase,” signer of the Declaration of Independence.<br />\n<br />\n“Rehoboth.” It was here that Francis Makemie established Presbyterian-<br />\nism in Maryland.<br />\n<br />\n““ Make Peace.” One of the finest examples of early Colonial houses.<br />\n<br />\nMaryland-Virginia Line. One of the boundary stones and one of the<br />\n““Marriage Trees” are located near this point.<br />\n<br />\n1099-645<br />\n1129-648<br />\n1143-648<br />\n1110-608<br />\n<br />\n1125-604<br />\n<br />\n1124-575<br />\n1146-580<br />\n<br />\n1146-580<br />\n1115-559<br />\n1116-561<br />\n1117-551<br />\n1104-546<br />\n1065-502<br />\n<br />\n1028-500<br />\n1017-475<br />\n<br />\n1010-478<br />\n995-410<br />\n<br />\n1032-416<br />\n1048-434<br />\n1049-416<br />\n1050-416<br />\n1043-408<br />\n1088-398<br />\n<br />\n1051-385<br />\n1086-416<br />\n1133-385<br />\n<br />\n112-322<br />\n112-296<br />\n<br />\n1035-381<br />\n1021-348<br />\n1048-343<br />\n1058-346<br />\n1060-323<br />\n1036-313<br />\n1062-315<br />\n<br />\n888-161<br />\n1058-291<br />\n1063-270<br />\n<br />\n1063-263<br />\n1048-270<br />\n<br />\n1<br />\n1<br />\n<br />\n1042-272<br />\n1082-254<br />\n<br />\n1142-272<br />\n1135-257<br />\n1168-296<br />\n1150-176<br />\n1312-185<br />\n1227-161<br />\n1250-143<br />\n1174-146<br />\n1185-075<br />\n<br />\n1146-050<br />\n1220-066<br />\n<br />\nSTATE FORESTS AND STATE PARKS IN MARYLAND<br />\n<br />\nThe state parks of Maryland were selected for their scenic or historic values and for<br />\ntheir recreational possiblities. The state forests were established primarily for<br />\nconservation, but they also afford extensive recreational opportunities. For detailed<br />\ninformation regarding cabin rentals, seasons of use and description of accommo-<br />\n<br />\ndations, write to Department of State Forests and Parks, State Office<br />\nAnnapolis, Md.<br />\n<br />\nCEDARVILLE STATE FOREST, 3,510 acres, Charles and Prince George’s<br />\nCounties, off U. S. 301, 5 miles southeast of Brandywine. The Zekiah<br />\nSwamp, meandering streams and mixed pine and hardwoods feature this<br />\narea. Limited facilities for picnicking and camping, forest roads and trails<br />\nfor hiking, hunting in season. Address: Forest Supt., Brandywine, Md.<br />\n<br />\nDONCASTER STATE FOREST, 1,464 acres, Charles County, west of La<br />\nPlata and 114 miles east of Doncaster on State 6. Virginia pine forest.<br />\nLimited opportunities for picnicking and camping, forest roads and trails<br />\nfor hiking, hunting in season. Address: Forest Supt., Doncaster, Md.<br />\n<br />\nBuilding,<br />\n<br />\n850-294<br />\n<br />\n743-246<br />\n<br />\nELK NECK STATE FOREST, 3,762 acres, Cecil County, 1 mile east of 1110-640<br />\n<br />\nNortheast. Cut-over area in wild condition. Hunting in season.<br />\n<br />\nELK NECK STATE PARK, 995 acres, Cecil County, 10 miles south of 1088-602<br />\n<br />\nNortheast, traversing peninsular at head of Chesapeake Bay, fronting<br />\nboth on bay and Elk River. Mixed pine and hardwood forest. Extensive<br />\nfacilities for picnicking, limited opportunities for camping, swimming and<br />\nboating, housekeeping cabins with central toilet and wash house (for<br />\nvacation use only, by advance reservation at Annapolis) Address:<br />\nPark supt., Northeast, Md.<br />\n<br />\nFORT FREDERICK STATE PARK, 279 acres, Washington County, off<br />\nU. S. 40, 5 miles south of Clear Spring or Indian Springs via State 56<br />\nthrough Big Pool, entrance on State 44. Restored old frontier fort built<br />\nof stone in 1756 during French and Indian Wars, also used during<br />\nRevolutionary and Civil Wars. Stone museum illustrates successive<br />\nhistorical events. Facilities for picnicking, camping and fishing in Big<br />\nPool on old Chesapeake and Ohio Canal, near Potomac River. Address:<br />\nPark Supt., Big Pool, Md.<br />\n<br />\nGAMBRILL STATE PARK, 1,088 acres, Frederick County, 6 miles north-<br />\nwest of Frederick. High Knob on Catoctin Mtn., elevation 1,600 feet,<br />\naffording extensive views over Monocacy and Middletown Valleys.<br />\nFacilities for picnicking and hiking, refreshment building, teahouse and<br />\nshelters (reserve in advance). Address Forest Supervisor, R.F.D. #5,<br />\nFrederick, Md.<br />\n<br />\nGREEN RIDGE STATE FOREST, 25,451 acres, Allegany County, be-<br />\ntween Town Hill, Polish Mtn. and the Potomac River, 15 miles east of<br />\nCumberland along U. S. 40. Elevations 500-1,800 feet. Roadside picnic<br />\narea near Forest Hdars., 15-mile Creek and U. S. 40. Undeveloped<br />\nopportunities for camping, hiking, fishing and hunting in season. Address:<br />\nForest Supt., Flintstone P.O., Md.<br />\n<br />\nPATAPSCO STATE PARK, 1,582 acres, Baltimore and Howard Counties,<br />\n11 miles from Baltimore City Hall, 1 mile northwest of U. S. 1 from<br />\nElkridge, along Patapsco River between Relay and Hollofield. Extensive<br />\nfacilities for picnicking, camping, hiking, horseback riding and nature<br />\nstudy, limited opportunities for swimming and fishing. Address: Park<br />\nSupt., lichester, Md.<br />\n<br />\n518-646<br />\n<br />\n660-595<br />\n<br />\n360-650<br />\n<br />\n860-535<br />\n<br />\nPOCOMOKE STATE FOREST, 12,377 acres, southwestern Worcester 1225-140<br />\n<br />\nCounty, between Snow Hill and Pocomoke City in ‘““Eastern Shore’’ area.<br />\nForest of bald cypress, southern gum, cottonwood poplar and loblolly<br />\npine. Milburn Landing Recreational Area on Pocomoke River, 7 miles<br />\nnortheast of Pocomoke City off State 364. Facilities for picnicking,<br />\nopportunities for camping, hiking, fishing and hunting in season. Address:<br />\nForest Supt., R.F.D. #1, Pocomoke, Md.<br />\n<br />\nPOTOMAC STATE FOREST, 12,057 acres, southern Garrett County<br />\neast of Oakland. Elevations 1,500-3,000 feet. In two sections, one bor-<br />\ndering the Potomac River, and one on Backbone Mtn. along State 135.<br />\nRoads and trails provide access and opportunities for camping, hiking,<br />\nfishing and hunting in season. Forest Hdgrs. near Tasker Corners.<br />\nAddress: Forest Supt., Deer Park, Md.<br />\n<br />\nSAVAGE RIVER STATE FOREST, 51,517 acres, northeastern Garrett<br />\nCounty. Elevations 1,400-3,000 feet. 1 mile east of Grantsville on U. S.<br />\n40, turn south 5 miles to Forest Hdgrs. at New Germany. In two sections,<br />\none on Negro Mountain near Keysers Ridge on U. S. 40, and one in the<br />\nSavage River watershed between Meadow and Big Savage Mtns.<br />\nRecreational areas with cabins (for vacation use only, by advance reser-<br />\nvation at Annapolis), campsites and picnicking facilities at New Germany<br />\nand Big Run. Swimming in 13-acre lake at New Germany. Skiing facili-<br />\nties include open slopes with rope tow, downhill and cross-county ski<br />\ntrails and ski lodge with cooking and sleeping accommodations for 26<br />\npersons at any time of year (organized groups only, by advance reserva-<br />\ntion at Annapolis). Address: Forest Supt., 8rantsville P.O., Md.<br />\n<br />\nSWALLOW FALLS STATE FOREST, 7,133 acres, western Garrett<br />\nCounty, northwest of Oakland between Youghiogheny River and bound-<br />\nary of West Virginia. Elevations 2,200-2,900 feet. Recreational areas at<br />\nHerrington Manor, Forest Hdqrs. 5 miles from Oakland, with cabins (for<br />\nvacation use only, by advance reservation at Annapolis), bathhouse and<br />\nbeach for swimming in 53-acre lake, and at picturesque Swallow Falls<br />\nand Muddy Creek Falls (highest in the State) 3 miles beyond, with trails<br />\nthrough virgin white pines and hemlocks, picnicking facilities, opportuni-<br />\nties for camping, fishing and hunting in season. Address: Forest Supt.,<br />\nOakland, Md.<br />\n<br />\nWASHINGTON MONUMENT STATE PARK, 96 acres, eastern Wash-<br />\nington County, 2 miles east of Boonsboro, then 114 miles north of U. S.<br />\n40 from Zittlestown. Famous Blue Rocks on west slope of South Mtn.,<br />\nelevation 1,600 feet. Extensive views from restored 30-foot stone monu-<br />\nment and observation tower, built in 1827 as the first completed memorial<br />\nto George Washington, of Hagerstown Valley to the west and. Catoctin<br />\nRange to the east. Located on route of the Appalachian trail. Museum—<br />\nrefreshment building, and facilities for picnicking, including shelters (re-<br />\nserve in advance). Address: Park Supt., Middletown, Md.<br />\n<br />\nWYE OAK STATE PARK, 1.5 acres, northern Talbot County near Wye<br />\nMills on U. S. 213. A nature monument preserving 400-year-old white<br />\noak, said to be the largest of this species found east of Mississippi River,<br />\nwith circumference of 57 feet, 7 inches—1 foot above ground, height of<br />\n95 feet and spread of 165 feet. State Tree of Maryland.<br />\n<br />\n150-560<br />\n<br />\n173-335<br />\n<br />\n110-615<br />\n<br />\n624-608<br />\n<br />\n1061-405<br />\n<br />\nEXTENSION SERVICE, UNIVERSITY OF MARYLAND<br />\n<br />\nPLEASANT VALLEY RECREATION AREA, 1904 acres, central Garrett<br />\nCounty, 10 miles south of Grantsville on State 495. Elevations 2,000-<br />\n2,900 feet. Public facilities for picnicking include a covered pavilion,<br />\ntables and open fireplaces. A 30-acre lake is available for public swim-<br />\nming. There are group camping accommodations for 120 persons, with<br />\n15 cabins and a large combination lodge and dining hall, as well as adja-<br />\ncent facilities for swimming and hiking. ‘For group camping reservations,<br />\naddress Extension Service, University of Maryland, College Park, Md.)<br />\n<br />\n169-637<br />\n<br />\nNATIONAL PARK SERVICE AREAS IN MARYLAND<br />\n<br />\nThe National Park Service of the United States Department of the Interior admin-<br />\n<br />\nisters several areas in Maryland, as follows:<br />\n<br />\nANTIETAM NATIONAL BATTLEFIELD. SITE commemorates the Civil<br />\nWar battle of Antietam, sometimes called Sharpsburg. It is of outstand-<br />\ning importance in American history, since it marked the ending of General<br />\nRobert E. Lee’s first invasion of the North, thereby postponing indefi-<br />\nnitely England’s threatened recognition of the Confederacy and giving<br />\nPresident Lincoln the opportunity to issue his Emancipation Proclama-<br />\ntion. The neighboring Antietam National Cemetery is also under the<br />\nadministration of the National Park Service, since it is part of the historic<br />\nground over which the battle was fought. It is the burial place of Federal<br />\ndead from the battles of Antietam, South Mountain, and minor engage-<br />\nments of the region. A library and small museum, located in the adminis-<br />\ntration building at the entrance to the National Cemetery, are available<br />\nfor the use of visitors. Organizations and groups of visitors will be given<br />\nspecial service if arrangements are made in advance with the custodian.<br />\nAddress: Sharpsburg, Maryland.<br />\n<br />\nFORT McHENRY NATIONAL MONUMENT AND HISTORIC SHRINE<br />\n<br />\nlocated in the city of Baltimore, commemorates the successful defense<br />\nof Fort McHenry against a heavy British naval bombardment in the War<br />\nof 1812 and the writing by Francis Scott Key of the ‘‘Star-Spangled<br />\nBanner.” Key, detained by the British on a small vesse! anchored behind<br />\nthe enemy fleet, during the night watched the spectacle of the British<br />\nthrowing a continuous stream of shot, bombs, and rockets at Fort<br />\nMcHenry. When dawn broke he saw the American flag still flying, and<br />\nwas moved to write the verses of our national anthem. gI'he fort is a fine<br />\nexample of late 18th century military architecture, with bastions forming<br />\na five-pointed star.<br />\nFort McHenry is open to the public dai_lly throughout the year, including<br />\nSundays, from 7:30 a.m. to 5:30 p.m. The museum buildings are open<br />\nbetween 9 a.m. and 5 p.m. An admission fee of 10 cents is charged to<br />\nvisitors more than 16 years of age, except that members of school groups<br />\nup to 18 years of age are admitted free. Organizations or groups will be<br />\ngiven special service if arrangemants are made with the custodian.<br />\nAddress: Baltimore, Maryland.<br />\n<br />\nCHESAPEAKE AND OHIO CANAL following the Potomac River from<br />\nthe District of Columbia to Cumberland, Maryland, occupies a narrow<br />\nright-of-way totalling 5,253 acres, and is administered as part of the<br />\nNational Capital Park System. This old waterway, one of the least altered<br />\nof the older American canals, is an example of the ever-improving means<br />\nof transportation that helped to bind the Nation together. Through the<br />\nnatural passageway to the West afforded by the Potomac River Valley<br />\nhave passed the Indian trail, colonial wagon road, canal, railroad, tele-<br />\ngraph and telephone, and the modern superhighway. By these constantly<br />\nimproving modes of communication the once widely separated eastern<br />\nand western regions of the fast-growing Union were firmly linked both<br />\nsocially and commercially. Twenty-two miles of the old canal, between<br />\nGeorgetown, D. C., and Seneca, Maryland, have been restored by the<br />\nNational Park Service. Specially conducted tours via an old-time mule-<br />\ndrawn barge are available on the canal during the summer months.<br />\nCanoeing, boating, hiking, fishing, picnicking, nature walks, and ice<br />\nskating are among the recreational opportunities. Canoes and rowboats<br />\nmay be rented at Great Falls; and privately owned canoes are permitted<br />\non the canal. Address: The Superintendent, National Capital Parks,<br />\nInterior Building, Washington 25, D. C.<br />\n<br />\nCATOCTIN RECREATIONAL DEMONSTRATION AREA contains ap-<br />\napproximately 10,000 acres of mountain land, mostly forested, ranging in<br />\nelevation from 500 to 1,890 feet. It is located in northern Frederick<br />\nCounty, 16 miles north of Frederick near Thurmont, Maryland, on U. S.<br />\nRoute 15. Group camping, picnicking, hiking, fishing and nature study<br />\nare among the recreational opportunities. Three organized group camps,<br />\ndeveloped on the modern “unit’ plan, are available to civic, social, and<br />\nreligious organizations and to hiking and camping clubs, on a season,<br />\nintermediate, or short term basis. Facilities in the camps include sleep-<br />\ning cabins, unit lodges with outdoor kitchens, sanitary facilities in<br />\neach unit, central dining hall and kitchen, central shower house,<br />\nswimming pool and infirmary. The sleeping quarters are equipped with<br />\niron cots, but campers must provide their own mattresses, bedding,<br />\nkitchen utensils, and dishes. Address: Superintendent, National Capital<br />\nParks, Interior Building, Washington 25, D. C.<br />\n<br />\nTHE APPALACHIAN TRAIL<br />\n<br />\nTHE APPALACHIAN TRAIL, the longest marked and chartered footpath<br />\nin the world, extending from Maine to Georgia enters Maryland at Pen<br />\nMar, stretching thirty-eight miles to Harpers Ferry. A fully equipped<br />\nshelter and five lean-tos are available for the hiker. Many points of<br />\ninterest include the first monument to George Washington near Turners<br />\nGap, a stone arch erected to news correspondents, and the ma'gniﬁcent<br />\npanorama of the Potomac at Weverton Rocks. Address: The Potomac<br />\ngppglachian Trail Club, 1916 Sunderland Place, N.W., Washington 6,<br />\n<br />\nFor General Information<br />\nAbout Maryland, Write<br />\nTHE DEPARTMENT OF INFORMATION<br />\nAnnapolis, Md.<br />\n<br />\nHerd typical of Maryland’s fine food products<br />\n<br />\nFarm scene in rich Western Maryland hills<br />\n<br />\n593-596<br />\n<br />\n919-522<br />\n<br />\n321-666<br />\n<br />\n670-660<br />\n<br />\n <br />\n<br />\n <br />\n<br />\nConowingo Dam<br />\n<br />\no<br />\n<br />\nSpring at Savage River State Forest<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\nWye Oak, Maryland’s State Tree, Wye Mills<br />\n<br />\nFort McHenry, Baltimore, Birthplace of the “Star Spangled<br />\n<br />\nU. S. Naval<br />\n<br />\n <br />\n<br />\nAcademy, Annapolis<br />\n<br />\n <br />\n<br />\nBanner” Baltimore Skyline<br />\n<br />\n      <br />\n<br />\n <br />\n<br />\n <br />\n<br />\ni . T<br />\nL W<br />\nR e<br />\n<br />\nR L<br />\n& s o<br />\n<br />\nMaryland’s State House, Oldest Capitol in use in the nation, Annapolis<br />\n<br />\nChapel, U. S. Naval Academy<br />\n<br />\n      <br />\n<br />\n <br />\n<br />\nAdministration Buil_ding, University of Maryland, College Park<br />\n<br />\n““Homewood”, on campus of Johns Hopkins University<br />\n<br />\n <br />\n<br />\n“They’re off”’—Preakness start at Pimlico : : :<br />\nPoint to Point Racing, a famous Maryland sport<br />\n<br />\n <br />\n<br />\ng<br />\n<br />\nFerry boat in system uniting Eastern and Western Shores<br />\n<br />\n <br />\n<br />\nState House Portico, Statue of (former) Chief Justice, R. B. Taney Chesapeake Biological Laboratory, Solomons<br />\n<br />\nFey<br />\n<br />\n4 ‘*-fﬁ-_??\":\" ;<br />\n<br />\n <br />\n<br />\nOcean City, Maryland’s Sea Resort Catch of succulent shad, a Maryland Product<br />\n\f", "format": "basic_html", "processed": "AYVHEIT ¥IMOHN3ISI3 3HL<br /><br />\nm’v’v L 3‘\\9 “\\ZO LGl L\\\\\\\\‘S<br /><br />\nHISTORICAL POINTS<br /><br />\nWESTERN MARYLAND<br /><br />\n“McCulloch’s Path.” The first trail through the Glades. George Washington<br />\nstopped here, September 26, 1784, for lunch, but got nothing but boiled<br /><br />\ncorn.<br /><br />\n“Charles Friend’s Home.” George Washington stopped here on Septem-<br />\ntéer 26, 1784, looking for the best route from the Potomac to the Ohio<br /><br />\niver.<br /><br />\n“Bear Camp.” General Braddock’s 6th Camp on the march to Fort Du-<br />\nquesne, June 20-21, 1755.<br /><br />\nGeneral Braddock’s 5th Camp on the ill-fated march to “Fort Duquesne,”<br />\nJune 19, 1755.<br /><br />\nWhere George Washington was taken sick and remained for a few days<br />\ntill he could proceed and catch up with Braddock.<br /><br />\n“The Little Crossings’’ of the Youghiogheny River (now called Castleman’s<br />\nRiver). Old stone arch bridge built in 1813. An arch of 80 foot span, the<br />\nlongest built up to that time.<br /><br />\n“Ljttle Meadows.” Braddock’s fourth Camp on the march to “Fort<br />\nDugquesne,” 1755. Washington stopped here many times afterwards.<br />\n“Savage River Camp.” Braddock’s 3rd Camp, 1755. Many of the wagons<br /><br />\nwere broken descending the mountain.<br /><br />\n“Martin’s Plantation”” (near Frostburg). Braddock’s 2nd Camp, 1755.<br /><br />\nFirst Toll Gate House on National Road.<br /><br />\nBronze tablet on boulder, in memory of the Pioneers who traveled this<br />\nhistoric road. Erected by the D. A. R.<br /><br />\nThe National Road. First internal improvement undertaken by the U. S.<br />\nGovernment.<br /><br />\nFirst Iron Rails manufactured in the U. S. at Mt. Savage.<br /><br />\n“The Narrows,” the bridge to carry the new route of the National Highway<br />\nover Will’s Creek, built 1833.<br /><br />\n“Spendelow Camp.” Braddock’s 1st Camp out of Fort Cumberland. This<br />\nroute went over “Will’s Mountain.”<br /><br />\nCumberland—For further information apply at Hotels and Chamber of<br />\nCommerce. (a) The beginning of Braddock’s original road. (b) the site<br />\nof Old Fort Cumberland. (c) George Washington’s headquarters. (d) The<br />\nParade Ground of Old Fort Cumberland. (e) The Thomas Cresap<br />\nMonument in Riverside Park. (f) The original Headquarters House in<br />\nRiverside Park.<br /><br />\n‘“Washington’s Road.” Washington’s troops first opened this road from<br />\nCumberland to Reas-Town (Bedford, Pa.) in July, 1758.<br /><br />\nWhere Jane Frazier was captured by the Indians in 1754. Original house<br />\nstill standing.<br /><br />\nOld Fording Place across the Potomac of the Warriors Path, and site of the<br />\nStockade Fort of Col. Thomas Cresap. Washington stopped here many<br /><br />\ntimes.<br /><br />\n“The Warriors Path.” War path of the five nations of Indians of New York<br />\nState to the Carolina Mountains.<br /><br />\n“Old Mr. Flint’s Home.” Visited by Washington in 1769, while visiting<br />\nat Berkeley Springs, W. Va.<br /><br />\nSite of Tonoloway Fort. Built 1755 as a protection against the Indians.<br />\nIt now belongs to the State.<br /><br />\nSite of Fort Coombe, a stockade fort of 1756. One of a line of forts across<br />\nPennsylvania and Maryland.<br /><br />\nSt. Thomas Church, Hancock. Founded 1835. During 1861-62 used as a<br />\nhospital for Union Troops.<br /><br />\nSite g&amp;Fort Mills on Licking Creek, as an outlying fort for Fort Frederick,<br /><br />\n1756.<br /><br />\nRoad to Fort Frederick. Built 1756. The best preserved stone fort of<br />\nColonial days in America.<br /><br />\nGen. J. E. B. Stuart’s cavalry on his raid after the Battle of Anteitam<br />\ncrossed the National Road here, Oct. 10, 1862.<br /><br />\nThe Federal signal station on the top of Fairview Mountain was captured<br />\nby J. E. B. Stuart’s cavalry, Oct. 10, 1862 ¢<br /><br />\nAnother road at Clearspring leading to Fort Frederick. *<br /><br />\nThe house of Lancelot Jacques, built about 1766, at Green Spring Furnace.<br /><br />\n“The Bank Road” built between 1816-21. Financed by the Banks of<br />\nMaryland in consideration of the renewal of their Charters.<br /><br />\nGen. Lee’s ammunition train captured here, September 15, 1862.<br /><br />\nGen. J. E. B. Stuart attacked a large Pennsylvania force here September<br />\n20, 1862, but being outnumbered retired across the Potomac.<br /><br />\nWilliamsport. An important point during the French and Indian War. It<br />\nwas considered as one of the sites for the capital of the United States,<br />\nbut George Washington chose the site of the present Washington, D. C<br /><br />\nThe Long Meadow. Originally patented in 1739 to Colonel Thomas Cresap.<br /><br />\nMason and Dixon Line. The 105th Milestone erected in 1763. The 104th,<br />\n103rd, 102nd and 101st with M. on the Maryland side and P. on the<br />\nPennsylvania are all visible along the road along the line.<br /><br />\nMason and Dixon Line. The 100th Milestone. One of the “Crown’’ stones<br />\nset every five miles. On one side Lord Baltimore’s coat of arms, and<br />\nWilliam Penn’s on the other.<br /><br />\nCol. Nathaniel Rochester who founded Rochester, N. Y., lived for many<br />\nyears in Hagerstown.<br /><br />\nGen. Robert E. Lee entered Hagerstown Sept. 11, 1862, along this road.<br /><br />\nGen. Edward Braddock crossed into Virginia near this point in April, 1755.<br /><br />\nAn Indian Deed to Israel Friend, 1727. “‘Beginning at the mouth of Antie-<br />\ntam Creek, thence 200 shoots of an arrow up the Potomac,” etc.<br /><br />\nHouse where John Brown and his accomplices gathered together arms<br />\nand ammunition for the raid on Harpers Ferry.<br /><br />\nHarpers Ferry Bridge where John Brown crossed in his raid on Harpers<br />\nFerry, Oct. 17, 1859.<br /><br />\nWashington-Frederick County Line. Washington County was the first<br />\nCounty in the U. S. named for the Father of his country.<br /><br />\n“Crampton’s Gap”’ and “South Mountain,” .an important battle of Sept.<br />\n14-15, 1862. Six U. S. markers mark the spot, and a large stone arch<br />\ncrowns the crest.<br /><br />\n“Needwood Forest,” the home of Governor Thomas Sim Lee.<br /><br />\nBraddock’s Heights and Braddock’s Spring, marked by a bronze tablet<br />\non a large boulder.<br /><br />\n110-577<br /><br />\n114-560<br /><br />\n154-690<br />\n170-682<br />\n175-682<br />\n198-684<br /><br />\n216-684<br />\n248-681<br />\n254-660<br />\n262-665<br />\n278-662<br />\n286-662<br /><br />\n271-683<br />\n297-672<br /><br />\n300-666<br />\n304-666<br /><br />\n316-684<br />\n312-644<br />\n347-622<br /><br />\n366-678<br />\n450-680<br />\n463-686<br />\n470-690<br />\n472-680<br />\n506-666<br />\n517-659<br />\n524-662<br />\n528-662<br />\n533-663<br />\n530-652<br />\n570-664<br /><br />\n594-650<br />\n572-644<br /><br />\n568-644<br /><br />\n582-682<br />\n597-688<br /><br />\n617-688<br /><br />\n597-659<br />\n610-660<br />\n580-592<br />\n590-580<br />\n594-566<br />\n592-542<br />\n608-546<br />\n619-573<br /><br />\n634-576<br />\n658-579<br /><br />\nGeneral Braddock travelled this road in a coach and six horses on his way 675-578<br /><br />\nto Fort Duquesne.<br />\nWhere Gen. Meade took command of the Federal Army.<br /><br />\n684-566<br />\nFrederick. (a) Site of the Brothers Taverti where Washington stopped. 685-576<br /><br />\n(b) Statute at grave of Francis Scott Key. (c) Tablet at old barracks<br />\nbuilt in 1777. (d) Tablet at corner of Church and Market Streets. (e)<br />\nTaney House (Bentz Street). (f) Barbara Fritchie House. For additional<br />\ninformation apply at Hotels and Chamber of Commerce. B<br /><br />\nGovernor Johnson’s House, where Washington stopped several times. 688-604<br /><br />\nWinfield Scott Schiey was born here.<br /><br />\nCatoctin Furnace, an important lron Furnace during the Revoiutipn, 1776.. 678-636<br />\n“Jug Bridge,” where Lafayette was met by the Citizens of Frederick, 1824. 696-571<br />\nHeadquarters of Generals Robert E. Lee, Stonewall Jackson and Long- 688-566<br /><br />\nstreet, Sept. 6-9, 1862.<br /><br />\n“Monocacy Battlefield,” July 9, 1864. Apply for pamphlets at Frederick. 685-562<br />\n“Carrollton,” 10,000 acres of land from which Charles Carrol derived the 686-516<br /><br />\ntitle, Charles Carrol of Carrollton.<br /><br />\nRoute taken by Gen. Anthony Wayne in 1781 on his march from Phila- 670-528<br /><br />\ndelphia to Virginia.<br /><br />\n“Knowlands Ferry.” Washington stopped here on August 5, 1785. 670-522<br />\n“Amelung Glass %Vorks.\" First glass works in America was established 697-547<br />\nhere in 1789.<br />\n“Peter’s Tavern.” Washington stopped here on June 30, 1791. 700-544<br />\n“Dowdens Ordinary” (Inn). Stopping place of Braddock’s troops in 1765 721-512<br />\n(at Clarksburg). $ :<br />\nSugar Loaf Mountain. So called by Baron Graffenried, a Swiss Nobleman, 690-524<br />\nin 1710.<br />\n“Whites Ferry.” Important crossing of the Potomac during the Civil War. 652-482<br />\nWoodstock. Farm owned by Washington at the time of his death. 702-472<br />\nGeneral E%\\gard Braddock travelled this road on his way to Frederick in 750-470<br />\nApril, 1755.<br />\nRockville. (a) Site of camping grounds of Braddock’s troops, 1755. (b) 758-456<br />\nJ. E. B. Stuart’s raid, 1863.<br />\nGreat Falls of the Potomac. One of the most picturesque spots in Maryland. 729-425<br />\nWestminster. The first complete county rural free delivery service in the 801-634<br />\nUnited States.<br />\nUnion Mills. Gen. J. E. B. Stuart’s Camp on June 29, 1863, and Gen. James 792-669<br />\nBarnes’ Camp on June 30, 1863, on their way to Gettysburg.<br />\n“Goods’ Tavern.” Washington stopped here, July 2, 1791. 750-665<br />\n“Cookerly’s Tavern.” Washington stopped here on July 1, 1791. 712-619<br />\n“Terra Rubra.” Birthplace of Francis Scott Key. 8 710-619<br />\nOld Friends Meeting House, of which President Hoover’s ancestors 750-632<br />\nwere members.<br />\nFirst Reaping Machine in the world was invented here. 761-631<br />\n“Doughoregan Manor.” The home of Charles Carroll of Carrollton. The 830-526<br />\nlast survivor of the signers of the Declaration of Independence.<br />\n“Ellicott’s Mills.” Terminus of the B. &amp; O. R. R. in 1830. 857-522<br />\n“Rolling Road.” A Colonial road built for the purpose of rolling hogsheads 869-538<br />\nof tobacco to Elk Ridge Landing. .<br />\n“Old Court Road.” the road to the Court at Joppa Town. 871-560<br />\nNORTH CENTRAL MARYLAND<br />\nSite of Home of Governor Augustus W. Bradford which was burned by 906-564<br />\nConfederate troops on July 11, 1864.<br />\n“Joppa Road.” Originally an Indian Trail. 927-571<br />\n“Garrison Forest Church.” Built for the Forest inhabitants of St. Paul’s 869-573<br />\nChurch, Baltimore, 1742.<br />\nOld Court Road. The original road leading to the Court at Joppa Town. 871-560<br />\nThe Old United States Arsenal. Built in 1816 after the close of the War of 877-562<br />\n1812.<br />\n“The Garrison Fort.”” Built in 1695 as a protection against hostile Indians. 869-573<br />\n“Nicholson’s Manor.” 4200 acres granted to William Nicholson 1719. 886-606<br />\n“The Valley of Jehosophat.” 2500 acres patented 1685, now known as 927-594<br />\nDulaney’s Valley.<br />\n“The Eagle’s Nest.” Part of “The Valley of Jehosophat” which was con- 927-594<br />\nfiscated as British owned property and repatented in 1788.<br />\n“Quinn” or “Sweet Air.” Patented 1704. Long associated with the Carroll 930-612<br />\nfamily. House built about 1752.<br />\nThe Baltimore and Yorktown Turnpike Road. Authorized 1805, to rebuild 895-635<br />\nthe road laid out by the State in 1787.<br />\n40th Milestone on the Mason and Dixon Line, surveyed and marked 925-685<br />\n1763-68.<br />\n“Black Horse Tavern.” Where Washington spent the night on his way 927-653<br />\nback from New York in 1773.<br />\nSt. James Church, My Lady’s Manor, started 1750. . 921-628<br />\nClynmalyra, 5,000 acres surveyed 1705 for Charles Carroll, Lord Balti- 908-636<br />\nmore’s Attorney-General; in 1822, his great-great grandson Henry<br />\nCarroll built the house. )<br />\n“My Lady’s Manor.” 10,000 acres owned by Lady Baroness of Baltimore. 927-638<br />\nBel Air. County seat of Harford County since 1783. See portraits and 984-620<br />\nmurals in Court House and Post Office.<br />\n“Olney.” Patented 1704 as “Prospect.” ; 982-612<br />\n“Harry Gilmor’s Raid.” A serious Confederate invasion of Maryland. 975-608<br />\n“Jerusalem Mills.” Established in 1772 by David Lee, a Quaker from 972-594<br />\nBuck’s County, Pennsylvania.<br />\n“The House of Ishmael Day.” who shot a Confederate Cavalryman at- 975-608<br />\ntempting to pull down his {Jnion flag during Harry Gilmor’s raid. :<br />\n“The Sweathouse Road,” called from the Indian practice of throwing 960-588<br />\nwater on heated stones to generate steam, an Indian “Turkish Bath”<br />\nfor a curative purpose. :<br />\nPerry Hall. The home of Harry Dorsey Gough. One of the largest colonial 951-375<br />\nhouses in Maryland. Y<br />\n“The Joppa Road.”” An old Indian trail used as a route to Joppa, the 958-572<br />\nCounty$eat of Baltimore County 1712.<br />\nThe Baltimore and Harford Turnpike, built 1816. 950-590<br />\n“Battle of North Point,”” September 12, 1814. i 943-528<br />\nBritish attack on Baltimore on the Battlefield of North Point. 943-528<br /><br />\nBaltimore. For information regarding points of historic interest apply to<br />\nthe Mayor and City Council, Chamber of Commerce and Hotels.<br /><br />\nRochambeau’s Camp at Whitemarsh on his way to Yorktown, 1781, and 960-565<br />\non his return to the north.<br /><br />\nSite of “The Red Lion Tavern’” where Washington stopped over 25 times. 966-554<br /><br />\n“The Gunpowder River.” So called as early as 1660. 993-550<br /><br />\n“Joppa Town.” County seat of Baltimore County, 1712 to 1768. A port 982-584<br />\nfrom which tobacco was shipped to England. Long the rival of “Balti-<br />\nmore Town.”<br /><br />\n“The Gunpowder Neck.” One of the earliest settled portions of Baltimore 998-565<br />\nCounty, now the site of Fort Hoyle and Edgewood Arsenal.<br /><br />\nBirthplace of William Paca, signer of the Declaration of Independence. 997-588<br /><br />\nCapt. John Smith ascended to this point 1608. 1014-596<br /><br />\nSophia’s Dairy. Built 1768, by Aquila Paca. 1020-600<br /><br />\nSite of “Old Baltimore,” 1683. 1st County Seat of Baltimore County. 1011-594<br /><br />\n““‘Spesutia P. E. Church” (St. George’s Parish). Founded 1671. 1025-599<br /><br />\n“Constant Friendship” Owned by Col. Thomas White, father of Bishop 995-598<br />\nWilliam White.<br /><br />\n“Cokesbury College” the first Methodist College in the world established 1014-604<br />\n1785.<br /><br />\nRochambeau’s troops camped here 1781 on their way to Yorktown. 1018-605<br /><br />\n“Harford Town’”’ or “Bush.” The first Declaration of Independence was 1016-626<br />\nsigned here March 22, 1775.<br /><br />\nRochambeau’s troops camped here in 1782 on their way back from the 1035-612<br />\nvictory of Yorktown.<br /><br />\nAberdeen Proving Grounds. Military reservation of 55,000 acres of land 1047-595<br />\nand water.<br /><br />\nSpesutia Island (Utie’s Hope), 2300 acres surveyed 1658. The only Manor 1061-592<br />\nin 1I-ég£ford County. Treaty with the Susquehanna Indians made here<br />\nin k<br /><br />\nRochambeau’s Camp (near the Havre de Grace Race Track). Here in 1781 1054-624<br />\nthe troops camped on their way to Yorktown.<br /><br />\nHavre de Grace. Orginally called Susquehanna Lower Ferry. Washington 1056-626<br />\nstopped here many times.<br /><br />\nJohn O’Neill’s memorial and gun used in the defense of Havre de Grace 1056-62b<br />\n1814 (in City park).<br /><br />\n“Tudor Hall.”” Birthplace of Edwin Booth and John Wilkes Booth. 982-635<br /><br />\n“Maedical Hall.” The home of Dr. John Archer, the first graduate of medi- 992-624<br />\ncine in America.<br /><br />\nChurchville. Rochambeau’s heavy artillery here September, 1781, on way 1012-630<br />\nto Yorktown.<br /><br />\n“Indian Spring.” Where Rochambeau’s heavy artillery camped after 1016-670<br />\ncrossing the Susquehanna River.<br /><br />\nLafayette marker pointing to Col. Rigbie’s house. 1025-658<br /><br />\nLafayette at Col. Rigbie’s House April 13, 1781, where he quelled a 1025-658<br />\nmutiny of his soldiers.<br /><br />\nConowingo (site of the Conowingo Dam) an Indian name meaning “At 1034-667<br />\nthe Falls.”<br /><br />\nSOUTHERN MARYLAND<br /><br />\nAnnapolis, Capital of Maryland and site of the U. S. Naval Academy, also 942-416<br />\nnumerous points of historical interest. For additional information apply<br />\nat Hotels and Chamber of Commerce.<br /><br />\nGovernor Ritchie Highway and Memorial. 915-473<br /><br />\n“Whitehall.” The home of Governor Horatio Sharpe, considered the finest 959-431<br />\nexample of Colonial country houses in Maryland.<br /><br />\n“Widow Ramsey’s Tavern,” on the General’s Highway. 905-465<br /><br />\nWashington and Rochambeau passed over this road on their way to York- 920-431<br />\ntown.<br /><br />\nRoute taken by Washington on his way to Annapolis to resign his com- 906-446<br />\nmission. (Bronze tablet at Severn cross roads).<br /><br />\n“Belvoir.” Rochambeau’s troops camped here on their way to Yorktown. 918-434<br /><br />\n“Three Mile Oak.” Portion of the old tree where citizens of Annapolis met 928-420<br />\nGeneral Washington in 1783, on his way to resign his commission.<br /><br />\nBirthplace of Johns Hopkins, May 19, 1795. Founder of Johns Hopkins 894-440<br />\nHospital and University.<br /><br />\n“Elk Ridge Landing.” An important Colonial Port for the shipment of 881-502<br />\ntobacco.<br /><br />\n“Spurrier’s Tavern.” Visited over twenty-five times by Washington. 857-482<br /><br />\n“Montpelier.”” The Colonial home of Col. Thomas Snowden. 844-448<br /><br />\nThe first telegram ever sent in the world passed this spot May 24, 1844, 838-453<br /><br />\n“Van Horn’s Tavern.”” A Colonial Inn at which Washington stopped many 834-448<br />\ntimes.<br /><br />\n“Rhodes’ Tavern.” George Washington’s last stopping place in Maryland. 820-403<br /><br />\nThe first Agricultural College in the Western Hemisphere started 1754. 816-419<br /><br />\n“Rossburg Inn.”” A famous Colonial stopping place. 820-403<br /><br />\n“Adelphi Mill.”” Built 1796. 812-420<br /><br />\n“Bladensburgh.” Site of the Battle of Bladensburgh, War of 1812. 820-403<br /><br />\n“Mount Lubentia.”” The home and school of the Rev. Jonathan Boucher, 848-388<br />\nthe tutor of Jackie Custis. .<br /><br />\n“St. Barnabas Church,” erected in 1774. Washington and Governor Eden 811-359<br />\nattended services here together.<br /><br />\n“Northampton.” The birthplace of Albert Lord Fairfax. 874-418<br /><br />\n“Queen Anne.”’ A post town in 1707, where Washington stopped. 891-387<br /><br />\n“Tulip Hill.” Colonial home of Samuel Galloway, built in 1756. 932-379<br /><br />\n“Rawlings’ Tavern,” Washington dined here on September 26, 1773. 916-386<br /><br />\n“Larkins Hills,” where Lord Baltimore and the Assembly met, 1683. 914-388<br /><br />\nWilliam Penn came to the home of Colonel Thomas Tailler on December 908-376<br />\n13, 1682, for his first conference with Charles Lord Baltimore as to the<br />\nlocation of the Maryland-Pennsylvania Boundary Line.<br /><br />\nWilliam Penn visited William Richardson near this spot on December 13, 929-368<br />\n1682.<br /><br />\nWilliam Penn attended a meeting of the Friends (Quakers) at Thomas 932-358<br />\nHooker’s in 1682.<br /><br />\n“Portland Manor’’ surveyed 1667. 898-354<br /><br />\nMarlborough. County seat of Prince George’s County since 1720. 870-358<br /><br />\nSite of home and grave of Dr. Beanes whose arrest by the British in 1814, 862-352<br />\nwas the cause of Francis Scott Key writing the ‘“Star Spangled Banner.”<br /><br />\nThe first Bishop consecrated in the United States, Thomas John Claggett. 870-345<br /><br />\nBirthplace of Archbishop John Carroll. 877-343<br /><br />\nMarking the route of Washington from Annapolis to Mt. Vernon in 1783. 850-356<br /><br />\n“hgglwgod Park.” The home of Ignatius Digges and Governor Thomas 849-354<br /><br />\nim Lee.<br /><br />\n“Mount Airy,” The home of Benedict Calvert, whose daughter married 854-348<br />\nWashington’s stepson.<br /><br />\n“Mrs. Surratt’s House.” where John Wilkes Booth stopped to secure 829-339<br />\nammunition.<br /><br />\n“T. B.”” The initials of Thomas Brooke on a boundary stone at Brookfield. 834-316<br /><br />\n“Dr. Mudd’s House.” Home of Dr. Mudd, who set the broken leg of John 862-255<br />\nWilkes Booth.<br /><br />\n“De La Brooke Manor.” Surveyed in 1650 for Robert Brooke, Commander 866-298<br />\nof Charles County.<br /><br />\n“Three Notch Road.”” An early law provided that three notches marked on 920-190<br />\ntrees indicated a road to a ferry.<br /><br />\nCharlotte Hall School, continuously open since 1796. 863-230<br /><br />\n“Ye Coole Springs.” The first medicinal springs in America. 863-235<br /><br />\nBenedict. British troops landed here August ,1814. 892-247<br /><br />\n“District Line.” Point where Washington first entered Prince George’s 818-394<br />\nCounty, Maryland (1751).<br /><br />\n“Oxon Hill.” Home of the Addison family. John Hanson died here. 804-351<br /><br />\n\"Bro?g?%reek Church.” Mother Church of the District of Columbia, erected 800-336<br />\nin b<br /><br />\nFort \\tNashington built by Major L’Enfant who laid out the City of Wash- 792-320<br />\nington.<br /><br />\nWarburton Manor. The Digges home visited by Washington many times. 792-330<br /><br />\n“Piscataway Town.” Visited by Governor Leonard Calvert, March 1634, 807-316<br />\n(before he landed at St. Mary’s) to visit the Indian Emperor.<br /><br />\nMarshall Hall. Maryland landing of Washington’s private ferry. 772-310<br /><br />\n“Araby.” The Colonial home of Widow Eilbeck, whose daughter married 780-260<br />\nGeorge Mason.<br /><br />\n“Widow Chapman’s.” Mt. Aventine on the Potomac opposite Gunston 770-288<br />\nHall, Virginia.<br /><br />\n“Governor Smallwood’s Home.”” Washington here in October, 1785. 742-256<br /><br />\n“Durham Church.” Built 1732. Rebuilt in 1791. 755-233<br /><br />\n“Washington’s Farm.” 600 acres acquired by him in 1775. 738-226<br /><br />\n“The Retreat.”” Home of Daniel of St. Thomas of Jenifer. 795-248<br /><br />\n“Rose Hill.” The home of Dr. Gustavus Brown, one of Washington’s 795-248<br />\nphysicians.<br /><br />\n““‘Habre de Venture,” the home of Thomas Stone, signer of the Declaration 800-266<br />\nof Independence.<br /><br />\nPort Tobacco. The County Seat of Charles County until 1895. 795-248<br /><br />\n“La Grange,” the home of Dr. James Craik, Washington’s lifelong friend 795-248<br />\nand physician.<br /><br />\n“Samuel Cox’s Farm,” where John Wilkes Booth and his accomplice hid 804-229<br />\nfor several days.<br /><br />\nCedar Point. Washington’s schooner ran aground here in February, 1766. 844-156<br /><br />\n“Laidlow’s Ferry.” Washington crossed here many times on his way to 803-193<br />\nWilliamsburg.<br /><br />\n“Wolleston Manor.” Patented in 1642 to Captain James Neale. 835-180<br /><br />\nThe birthplace of Roger Brooke Taney, Chief Justice of the United States, 919-258<br />\n1836-64.<br /><br />\n“The Cliffs of Calvert.” One of the most picturesque spots in Maryland. 938-265<br /><br />\n“':1?352270“ Patuxent.” Seat of the Puritan government of Maryland, 952-196<br /><br />\n“Nllgatltapany.)\" Site of 1st Jesuit Mission, later home of Charles (3rd Lord 965-162<br /><br />\naltimore).<br /><br />\n““Manor of Cornwaley’s Cross.” One of the oldest homes in Maryland. 982-096<br /><br />\nSaint Mary’s City. (a) Reproduction of State House of 1676. (b) Monument 963-129<br />\nto Leonard Calvert. (¢c) Trinity Church, erected from bricks of first State<br />\nHouse of 1676. (d) Site of the 1st State House. (e) Governor Lionel Cop-<br />\nley’s tomb. (f) “Mattapany Street,” the first road opened in Maryland.<br />\n(g) “Freedom of Conscience’’ monument. (h) “Father White’”” memorial.<br />\n(i) “Memorial Gateway.” (j) St. Mary’s Seminary. (k) Site of first mill<br />\nin Maryland. (1) Governor’s Spring. (m) Site of first Catholic Church.<br /><br />\nSt. Mary’s Female Seminary. The State’s 200th anniversary memorial 963-129<br />\nestablished 1839.<br /><br />\nPoint Lookout. Site of Prison Camp during Civil War; where 3,000 Con- 995-075<br />\nfederate prisoners died.<br /><br />\nSt. Clement’s Island. First landing place of the Colonists from the Ark and 874-137<br />\nthe Dove on March 25, 1634.<br /><br />\n“Deep Falls.” Home and burial place of Dr. James Thomas, Governor of 862-195<br />\nMaryland (1833-36).<br />\n“The Monastery.” First carmel in U. S. Founded 1790. 804-268<br />\n‘The Old South River Club.” Oldest Social Club in America. 930-394<br />\nEASTERN SHORE<br />\n“The Proprietors of the Susquehanna Canal’’ one of the first canals in 1048-659<br />\nAmerica, 1783.<br /><br />\n“Susquehannock Indian Fort” (site of an important point in the contro- 1042-668<br />\nversy between Penn and Lord Baltimore).<br /><br />\n“Smith’s Falls.” In 1608 Captain John Smith ascended the Susquehanna 1040-658<br />\nRiver to this point.<br /><br />\n“Cummings Tavern.” Where Rouchambeau’s heavy artillery camped before 1070-658<br />\ncrossing the Susquehanna River.<br /><br />\n“Richards’ Oak.” Lafayette’s troops camped under this tree in 1781. 1049-679<br /><br />\nWest Nottingham Academy, founded 1744, by Dr. Samuel Finley, who in 1061-671<br />\n1761 became the President of Princeton.<br /><br />\n“Nottingham Lots.” Important in the controversy over the Mason and 1074-690<br />\nDixon Line.<br /><br />\n“Brick Meeting House,” Established by William Penn in 1702. 1086-683<br /><br />\n“Blue Ball Tavern.” Established in 1710, by Andrew Job. 1112-680<br /><br />\n“New Munster.” 6,000 acres granted in 1683, to Edwin O’Dwire and 15 1133-681<br /><br />\nother Irishmen.<br /><br />\nPerryville, Cecil County, terminus of the ‘“Susquehanna Lower Ferry.” 1060-630<br /><br />\nRochambeau’s troops camped here on their way to Yorktown in 1781.<br />\n“Susquehanna Manor,” 32,000 acres, one of Maryland’s largest Manors.<br />\n“The Principio Company.” The first iron works in America (1715).<br />\nCharlestown. Laid out in 1742. Washington stopped here many times.<br /><br />\n1054-638<br />\n1072-638<br />\n1087-636<br /><br />\nNorth East. Site of the iron forges of the “Principio Company.”<br /><br />\nElkton, originally called ‘“Head of Elk,” Important during the Revolution.<br /><br />\nThe old “Post Road.” where it crosses the Maryland-Delaware Line.<br /><br />\n“Bohemia Mannour.” Patented to Augustine Hermann in 1662 ‘“for making<br />\nthe Map of the Province of Maryland.”<br /><br />\n“The Labadie Tract.” 3,750 acres occupied 1684 by a Religious Sect who<br />\nled a Communist form of life.<br /><br />\n“Worsell Manor,” 1,000 acres patented 1685.<br /><br />\nWarwick. Washington stopped here on his way from Fort Cumberland to<br />\nBoston, in 1756, and on several other occasions.<br /><br />\nBirthplace of James Rumsey, the inventor of the steamboat.<br /><br />\nFredericktown. Discovered and explored by Captain John Smith in 1608-9.<br /><br />\nGeorgetown, burned by the British on May 6, 1814.<br /><br />\nGalena. Washington stopped here in 1774.<br /><br />\nTomb of Brigadier General John Cadwalader.<br /><br />\nChestertown. (a) Washington College, founded 1782. (b) Worsell’s Tavern<br />\nwhere Washington stopped. (c) Site of First Free School of Kent County.<br />\n(d) Church where the name of ‘“Prostestant Episcopal church” was<br />\nadopted. For additional information apply for pamphlet at Hotels and<br />\nChamber of Commerce.<br /><br />\n“Battle of Caulk’s Field.” September 1, 1814,<br /><br />\nRock Hall. Tench Tilghman used this route in carrying the news of the<br />\nvictory of Yorktown.<br /><br />\n““Rock Hall Landing.” Eastern Shore Landing of the Colonial Annapolis-<br />\nRock Hall Packet.<br /><br />\n“Kent Island”’ (the Isle of Kent). William Claiborne of Virginia established<br />\na trading post, settlement and fort here in 1631.<br /><br />\n“Lord’s Gift.” 1,000 acres granted to Henry Coursey, 1658.<br /><br />\n“Bolingly.” Surveyed 1658 for James Bowling.<br /><br />\n‘“Bloomingdale.” Patented 1685 by Capt. Robert Morris.<br /><br />\n“Stagwell.” Patented to Thomas Stagwell, 1649.<br /><br />\n“Chesten-on-Wye.”” Surveyed 1659 for John and William Coursey.<br /><br />\n‘“Wye Plantation.” Home of William Paca, signer of the Declaration, and<br />\ntwice Governor of Maryland. He lies buried here.<br /><br />\n“Wye Island.” Patented to Col. Philemon Lloyd 1682 as ““Lloyd’s Insula.”<br /><br />\n“Clover Field.” 1522 acres patented to William Hamsley, 1730.<br /><br />\nDenton. Originally called Edenton for Robert Eden, Maryland’s last<br />\nColonial Governor and ancestor of Anthony Eden.<br /><br />\nPreston. Started 1846 around “Frazier’s Chapel.”<br /><br />\nSite of home of Col. William Richardson, Col. of the “Flying Camp”’ of the<br />\nEastern Shore. His tomb is located here.<br /><br />\n‘““Wye House.” Home of the Lloyd family since Colonial times.<br /><br />\nSaint Michaels. Attacked by the British during the War of 1812,<br /><br />\n“The Mannour of Ratcliffe.” Colonial home of the Holliday family.<br /><br />\nWilliam Penn’s visit in 1682 to the Friends Meeting House, the oldest frame<br />\nmeeting house in America.<br /><br />\n“Canterbury Manor.” Laid out for Richard Tilghman 1659.<br /><br />\nOxford, one of the first towns and ports authorized by Assembly in 1683.<br /><br />\n““Hole in the Wall.” Early name of this village located near Whitemarsh<br />\nChurch where Robert Morris’ father lies buried.<br /><br />\n“Compton.” Home of Governor Stevens who welcomed General Lafayette<br />\nat Fort McHenry 1825.<br /><br />\n“Crosiadore.” The home of the Dickinson family from 1695 to the present<br />\ntime. Dickinson College at Carlisle, Pa. was named after John Dickinson.<br /><br />\nCambridge. Originally part of the “Choptank Indian Reservation.” Made<br />\na port of entry 1684.<br /><br />\n“Appleby.” The home of Governor Thomas Holliday Hicks.<br /><br />\n“The Treaty Oak.” Where the early settlers conferred with Choptank<br />\nIndians for the purchase of land.<br /><br />\n“0Old Trinity Church.” Built prior to 1670.<br /><br />\n“Ch%pgtank Indian Reservation.” The first Indian Reservation in America,<br />\n1669.<br /><br />\nRehoboth, granted Richard Lee of Virginia 1673 (2350 acres). The ancestor<br />\nof the Lees of Maryland. Gov. Thomas Sim Lee was one of them.<br /><br />\n“Unr}acokossimmon.” Emperor of the Nanticoke Indians, lived here in<br />\n1677.<br /><br />\n“Patty Cannon’s House.” where the noted kidnapping group had head-<br />\nquarters. Described in the novel ‘“The Entailed Hat.”<br /><br />\n“Green Hill Town and Port.”” authorized by an Act of Assembly, 1706.<br /><br />\nBirthplace of Commodore Stephan Decatur, January 5, 1779.<br /><br />\n\"A(slgmi)nokonson” (Indian Town). The largest Indian town in Maryland<br />\n1671). )<br /><br />\n“Nassawango Iron Furnace.” built in 1832, by the Maryland Iron Company.<br /><br />\n“Birthplace of Samuel Chase,” signer of the Declaration of Independence.<br /><br />\n“Rehoboth.” It was here that Francis Makemie established Presbyterian-<br />\nism in Maryland.<br /><br />\n““ Make Peace.” One of the finest examples of early Colonial houses.<br /><br />\nMaryland-Virginia Line. One of the boundary stones and one of the<br />\n““Marriage Trees” are located near this point.<br /><br />\n1099-645<br />\n1129-648<br />\n1143-648<br />\n1110-608<br /><br />\n1125-604<br /><br />\n1124-575<br />\n1146-580<br /><br />\n1146-580<br />\n1115-559<br />\n1116-561<br />\n1117-551<br />\n1104-546<br />\n1065-502<br /><br />\n1028-500<br />\n1017-475<br /><br />\n1010-478<br />\n995-410<br /><br />\n1032-416<br />\n1048-434<br />\n1049-416<br />\n1050-416<br />\n1043-408<br />\n1088-398<br /><br />\n1051-385<br />\n1086-416<br />\n1133-385<br /><br />\n112-322<br />\n112-296<br /><br />\n1035-381<br />\n1021-348<br />\n1048-343<br />\n1058-346<br />\n1060-323<br />\n1036-313<br />\n1062-315<br /><br />\n888-161<br />\n1058-291<br />\n1063-270<br /><br />\n1063-263<br />\n1048-270<br /><br />\n1<br />\n1<br /><br />\n1042-272<br />\n1082-254<br /><br />\n1142-272<br />\n1135-257<br />\n1168-296<br />\n1150-176<br />\n1312-185<br />\n1227-161<br />\n1250-143<br />\n1174-146<br />\n1185-075<br /><br />\n1146-050<br />\n1220-066<br /><br />\nSTATE FORESTS AND STATE PARKS IN MARYLAND<br /><br />\nThe state parks of Maryland were selected for their scenic or historic values and for<br />\ntheir recreational possiblities. The state forests were established primarily for<br />\nconservation, but they also afford extensive recreational opportunities. For detailed<br />\ninformation regarding cabin rentals, seasons of use and description of accommo-<br /><br />\ndations, write to Department of State Forests and Parks, State Office<br />\nAnnapolis, Md.<br /><br />\nCEDARVILLE STATE FOREST, 3,510 acres, Charles and Prince George’s<br />\nCounties, off U. S. 301, 5 miles southeast of Brandywine. The Zekiah<br />\nSwamp, meandering streams and mixed pine and hardwoods feature this<br />\narea. Limited facilities for picnicking and camping, forest roads and trails<br />\nfor hiking, hunting in season. Address: Forest Supt., Brandywine, Md.<br /><br />\nDONCASTER STATE FOREST, 1,464 acres, Charles County, west of La<br />\nPlata and 114 miles east of Doncaster on State 6. Virginia pine forest.<br />\nLimited opportunities for picnicking and camping, forest roads and trails<br />\nfor hiking, hunting in season. Address: Forest Supt., Doncaster, Md.<br /><br />\nBuilding,<br /><br />\n850-294<br /><br />\n743-246<br /><br />\nELK NECK STATE FOREST, 3,762 acres, Cecil County, 1 mile east of 1110-640<br /><br />\nNortheast. Cut-over area in wild condition. Hunting in season.<br /><br />\nELK NECK STATE PARK, 995 acres, Cecil County, 10 miles south of 1088-602<br /><br />\nNortheast, traversing peninsular at head of Chesapeake Bay, fronting<br />\nboth on bay and Elk River. Mixed pine and hardwood forest. Extensive<br />\nfacilities for picnicking, limited opportunities for camping, swimming and<br />\nboating, housekeeping cabins with central toilet and wash house (for<br />\nvacation use only, by advance reservation at Annapolis) Address:<br />\nPark supt., Northeast, Md.<br /><br />\nFORT FREDERICK STATE PARK, 279 acres, Washington County, off<br />\nU. S. 40, 5 miles south of Clear Spring or Indian Springs via State 56<br />\nthrough Big Pool, entrance on State 44. Restored old frontier fort built<br />\nof stone in 1756 during French and Indian Wars, also used during<br />\nRevolutionary and Civil Wars. Stone museum illustrates successive<br />\nhistorical events. Facilities for picnicking, camping and fishing in Big<br />\nPool on old Chesapeake and Ohio Canal, near Potomac River. Address:<br />\nPark Supt., Big Pool, Md.<br /><br />\nGAMBRILL STATE PARK, 1,088 acres, Frederick County, 6 miles north-<br />\nwest of Frederick. High Knob on Catoctin Mtn., elevation 1,600 feet,<br />\naffording extensive views over Monocacy and Middletown Valleys.<br />\nFacilities for picnicking and hiking, refreshment building, teahouse and<br />\nshelters (reserve in advance). Address Forest Supervisor, R.F.D. #5,<br />\nFrederick, Md.<br /><br />\nGREEN RIDGE STATE FOREST, 25,451 acres, Allegany County, be-<br />\ntween Town Hill, Polish Mtn. and the Potomac River, 15 miles east of<br />\nCumberland along U. S. 40. Elevations 500-1,800 feet. Roadside picnic<br />\narea near Forest Hdars., 15-mile Creek and U. S. 40. Undeveloped<br />\nopportunities for camping, hiking, fishing and hunting in season. Address:<br />\nForest Supt., Flintstone P.O., Md.<br /><br />\nPATAPSCO STATE PARK, 1,582 acres, Baltimore and Howard Counties,<br />\n11 miles from Baltimore City Hall, 1 mile northwest of U. S. 1 from<br />\nElkridge, along Patapsco River between Relay and Hollofield. Extensive<br />\nfacilities for picnicking, camping, hiking, horseback riding and nature<br />\nstudy, limited opportunities for swimming and fishing. Address: Park<br />\nSupt., lichester, Md.<br /><br />\n518-646<br /><br />\n660-595<br /><br />\n360-650<br /><br />\n860-535<br /><br />\nPOCOMOKE STATE FOREST, 12,377 acres, southwestern Worcester 1225-140<br /><br />\nCounty, between Snow Hill and Pocomoke City in ‘““Eastern Shore’’ area.<br />\nForest of bald cypress, southern gum, cottonwood poplar and loblolly<br />\npine. Milburn Landing Recreational Area on Pocomoke River, 7 miles<br />\nnortheast of Pocomoke City off State 364. Facilities for picnicking,<br />\nopportunities for camping, hiking, fishing and hunting in season. Address:<br />\nForest Supt., R.F.D. #1, Pocomoke, Md.<br /><br />\nPOTOMAC STATE FOREST, 12,057 acres, southern Garrett County<br />\neast of Oakland. Elevations 1,500-3,000 feet. In two sections, one bor-<br />\ndering the Potomac River, and one on Backbone Mtn. along State 135.<br />\nRoads and trails provide access and opportunities for camping, hiking,<br />\nfishing and hunting in season. Forest Hdgrs. near Tasker Corners.<br />\nAddress: Forest Supt., Deer Park, Md.<br /><br />\nSAVAGE RIVER STATE FOREST, 51,517 acres, northeastern Garrett<br />\nCounty. Elevations 1,400-3,000 feet. 1 mile east of Grantsville on U. S.<br />\n40, turn south 5 miles to Forest Hdgrs. at New Germany. In two sections,<br />\none on Negro Mountain near Keysers Ridge on U. S. 40, and one in the<br />\nSavage River watershed between Meadow and Big Savage Mtns.<br />\nRecreational areas with cabins (for vacation use only, by advance reser-<br />\nvation at Annapolis), campsites and picnicking facilities at New Germany<br />\nand Big Run. Swimming in 13-acre lake at New Germany. Skiing facili-<br />\nties include open slopes with rope tow, downhill and cross-county ski<br />\ntrails and ski lodge with cooking and sleeping accommodations for 26<br />\npersons at any time of year (organized groups only, by advance reserva-<br />\ntion at Annapolis). Address: Forest Supt., 8rantsville P.O., Md.<br /><br />\nSWALLOW FALLS STATE FOREST, 7,133 acres, western Garrett<br />\nCounty, northwest of Oakland between Youghiogheny River and bound-<br />\nary of West Virginia. Elevations 2,200-2,900 feet. Recreational areas at<br />\nHerrington Manor, Forest Hdqrs. 5 miles from Oakland, with cabins (for<br />\nvacation use only, by advance reservation at Annapolis), bathhouse and<br />\nbeach for swimming in 53-acre lake, and at picturesque Swallow Falls<br />\nand Muddy Creek Falls (highest in the State) 3 miles beyond, with trails<br />\nthrough virgin white pines and hemlocks, picnicking facilities, opportuni-<br />\nties for camping, fishing and hunting in season. Address: Forest Supt.,<br />\nOakland, Md.<br /><br />\nWASHINGTON MONUMENT STATE PARK, 96 acres, eastern Wash-<br />\nington County, 2 miles east of Boonsboro, then 114 miles north of U. S.<br />\n40 from Zittlestown. Famous Blue Rocks on west slope of South Mtn.,<br />\nelevation 1,600 feet. Extensive views from restored 30-foot stone monu-<br />\nment and observation tower, built in 1827 as the first completed memorial<br />\nto George Washington, of Hagerstown Valley to the west and. Catoctin<br />\nRange to the east. Located on route of the Appalachian trail. Museum—<br />\nrefreshment building, and facilities for picnicking, including shelters (re-<br />\nserve in advance). Address: Park Supt., Middletown, Md.<br /><br />\nWYE OAK STATE PARK, 1.5 acres, northern Talbot County near Wye<br />\nMills on U. S. 213. A nature monument preserving 400-year-old white<br />\noak, said to be the largest of this species found east of Mississippi River,<br />\nwith circumference of 57 feet, 7 inches—1 foot above ground, height of<br />\n95 feet and spread of 165 feet. State Tree of Maryland.<br /><br />\n150-560<br /><br />\n173-335<br /><br />\n110-615<br /><br />\n624-608<br /><br />\n1061-405<br /><br />\nEXTENSION SERVICE, UNIVERSITY OF MARYLAND<br /><br />\nPLEASANT VALLEY RECREATION AREA, 1904 acres, central Garrett<br />\nCounty, 10 miles south of Grantsville on State 495. Elevations 2,000-<br />\n2,900 feet. Public facilities for picnicking include a covered pavilion,<br />\ntables and open fireplaces. A 30-acre lake is available for public swim-<br />\nming. There are group camping accommodations for 120 persons, with<br />\n15 cabins and a large combination lodge and dining hall, as well as adja-<br />\ncent facilities for swimming and hiking. ‘For group camping reservations,<br />\naddress Extension Service, University of Maryland, College Park, Md.)<br /><br />\n169-637<br /><br />\nNATIONAL PARK SERVICE AREAS IN MARYLAND<br /><br />\nThe National Park Service of the United States Department of the Interior admin-<br /><br />\nisters several areas in Maryland, as follows:<br /><br />\nANTIETAM NATIONAL BATTLEFIELD. SITE commemorates the Civil<br />\nWar battle of Antietam, sometimes called Sharpsburg. It is of outstand-<br />\ning importance in American history, since it marked the ending of General<br />\nRobert E. Lee’s first invasion of the North, thereby postponing indefi-<br />\nnitely England’s threatened recognition of the Confederacy and giving<br />\nPresident Lincoln the opportunity to issue his Emancipation Proclama-<br />\ntion. The neighboring Antietam National Cemetery is also under the<br />\nadministration of the National Park Service, since it is part of the historic<br />\nground over which the battle was fought. It is the burial place of Federal<br />\ndead from the battles of Antietam, South Mountain, and minor engage-<br />\nments of the region. A library and small museum, located in the adminis-<br />\ntration building at the entrance to the National Cemetery, are available<br />\nfor the use of visitors. Organizations and groups of visitors will be given<br />\nspecial service if arrangements are made in advance with the custodian.<br />\nAddress: Sharpsburg, Maryland.<br /><br />\nFORT McHENRY NATIONAL MONUMENT AND HISTORIC SHRINE<br /><br />\nlocated in the city of Baltimore, commemorates the successful defense<br />\nof Fort McHenry against a heavy British naval bombardment in the War<br />\nof 1812 and the writing by Francis Scott Key of the ‘‘Star-Spangled<br />\nBanner.” Key, detained by the British on a small vesse! anchored behind<br />\nthe enemy fleet, during the night watched the spectacle of the British<br />\nthrowing a continuous stream of shot, bombs, and rockets at Fort<br />\nMcHenry. When dawn broke he saw the American flag still flying, and<br />\nwas moved to write the verses of our national anthem. gI'he fort is a fine<br />\nexample of late 18th century military architecture, with bastions forming<br />\na five-pointed star.<br />\nFort McHenry is open to the public dai_lly throughout the year, including<br />\nSundays, from 7:30 a.m. to 5:30 p.m. The museum buildings are open<br />\nbetween 9 a.m. and 5 p.m. An admission fee of 10 cents is charged to<br />\nvisitors more than 16 years of age, except that members of school groups<br />\nup to 18 years of age are admitted free. Organizations or groups will be<br />\ngiven special service if arrangemants are made with the custodian.<br />\nAddress: Baltimore, Maryland.<br /><br />\nCHESAPEAKE AND OHIO CANAL following the Potomac River from<br />\nthe District of Columbia to Cumberland, Maryland, occupies a narrow<br />\nright-of-way totalling 5,253 acres, and is administered as part of the<br />\nNational Capital Park System. This old waterway, one of the least altered<br />\nof the older American canals, is an example of the ever-improving means<br />\nof transportation that helped to bind the Nation together. Through the<br />\nnatural passageway to the West afforded by the Potomac River Valley<br />\nhave passed the Indian trail, colonial wagon road, canal, railroad, tele-<br />\ngraph and telephone, and the modern superhighway. By these constantly<br />\nimproving modes of communication the once widely separated eastern<br />\nand western regions of the fast-growing Union were firmly linked both<br />\nsocially and commercially. Twenty-two miles of the old canal, between<br />\nGeorgetown, D. C., and Seneca, Maryland, have been restored by the<br />\nNational Park Service. Specially conducted tours via an old-time mule-<br />\ndrawn barge are available on the canal during the summer months.<br />\nCanoeing, boating, hiking, fishing, picnicking, nature walks, and ice<br />\nskating are among the recreational opportunities. Canoes and rowboats<br />\nmay be rented at Great Falls; and privately owned canoes are permitted<br />\non the canal. Address: The Superintendent, National Capital Parks,<br />\nInterior Building, Washington 25, D. C.<br /><br />\nCATOCTIN RECREATIONAL DEMONSTRATION AREA contains ap-<br />\napproximately 10,000 acres of mountain land, mostly forested, ranging in<br />\nelevation from 500 to 1,890 feet. It is located in northern Frederick<br />\nCounty, 16 miles north of Frederick near Thurmont, Maryland, on U. S.<br />\nRoute 15. Group camping, picnicking, hiking, fishing and nature study<br />\nare among the recreational opportunities. Three organized group camps,<br />\ndeveloped on the modern “unit’ plan, are available to civic, social, and<br />\nreligious organizations and to hiking and camping clubs, on a season,<br />\nintermediate, or short term basis. Facilities in the camps include sleep-<br />\ning cabins, unit lodges with outdoor kitchens, sanitary facilities in<br />\neach unit, central dining hall and kitchen, central shower house,<br />\nswimming pool and infirmary. The sleeping quarters are equipped with<br />\niron cots, but campers must provide their own mattresses, bedding,<br />\nkitchen utensils, and dishes. Address: Superintendent, National Capital<br />\nParks, Interior Building, Washington 25, D. C.<br /><br />\nTHE APPALACHIAN TRAIL<br /><br />\nTHE APPALACHIAN TRAIL, the longest marked and chartered footpath<br />\nin the world, extending from Maine to Georgia enters Maryland at Pen<br />\nMar, stretching thirty-eight miles to Harpers Ferry. A fully equipped<br />\nshelter and five lean-tos are available for the hiker. Many points of<br />\ninterest include the first monument to George Washington near Turners<br />\nGap, a stone arch erected to news correspondents, and the ma'gniﬁcent<br />\npanorama of the Potomac at Weverton Rocks. Address: The Potomac<br />\ngppglachian Trail Club, 1916 Sunderland Place, N.W., Washington 6,<br /><br />\nFor General Information<br />\nAbout Maryland, Write<br />\nTHE DEPARTMENT OF INFORMATION<br />\nAnnapolis, Md.<br /><br />\nHerd typical of Maryland’s fine food products<br /><br />\nFarm scene in rich Western Maryland hills<br /><br />\n593-596<br /><br />\n919-522<br /><br />\n321-666<br /><br />\n670-660<br /><br /><br /><br /><br /><br />\nConowingo Dam<br /><br />\no<br /><br />\nSpring at Savage River State Forest<br /><br /><br /><br /><br /><br /><br /><br />\nWye Oak, Maryland’s State Tree, Wye Mills<br /><br />\nFort McHenry, Baltimore, Birthplace of the “Star Spangled<br /><br />\nU. S. Naval<br /><br /><br /><br />\nAcademy, Annapolis<br /><br /><br /><br />\nBanner” Baltimore Skyline<br /><br /><br /><br /><br /><br /><br /><br />\ni . T<br />\nL W<br />\nR e<br /><br />\nR L<br />\n&amp; s o<br /><br />\nMaryland’s State House, Oldest Capitol in use in the nation, Annapolis<br /><br />\nChapel, U. S. Naval Academy<br /><br /><br /><br /><br /><br />\nAdministration Buil_ding, University of Maryland, College Park<br /><br />\n““Homewood”, on campus of Johns Hopkins University<br /><br /><br /><br />\n“They’re off”’—Preakness start at Pimlico : : :<br />\nPoint to Point Racing, a famous Maryland sport<br /><br /><br /><br />\ng<br /><br />\nFerry boat in system uniting Eastern and Western Shores<br /><br /><br /><br />\nState House Portico, Statue of (former) Chief Justice, R. B. Taney Chesapeake Biological Laboratory, Solomons<br /><br />\nFey<br /><br />\n4 ‘*-fﬁ-_??\":\" ;<br /><br /><br /><br />\nOcean City, Maryland’s Sea Resort Catch of succulent shad, a Maryland Product<br />"}], "field_media_file": [{"target_id": 52362, "display": null, "description": null, "target_type": "file", "target_uuid": "fa3d2802-7753-4324-ab2f-31597a433c92", "url": "http://digital.library.jhu.edu/system/files/2022-03/16207-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 16207, "target_type": "node", "target_uuid": "d2048599-5365-448f-a658-f7fddcc62e54", "url": "/node/16207"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "64d8aa97-3fd1-429d-ab94-b81895ec4637"}]}