{"mid": [{"value": 35720}], "uuid": [{"value": "a524c9ee-5e85-43d4-937e-b13788bfe771"}], "vid": [{"value": 35720}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12254-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "9?<br />\nrty:3mprirrk<br />\n<br />\nIffIEMF<br />\n<br />\ns1 i E N foCR<br />\n<br />\nTHENTOHNS•HOFKINS-UNIVERSITY<br />\nBALTIMORE<br />\n<br />\n\f\fThe News-Letter<br />\nVol. IX.<br />\n<br />\nNovember 18, 1904,<br />\n<br />\nNo. 3<br />\n<br />\nAN ANTIQUARIAN ROMANCE.<br />\n\"Yes; and •I knew monsieur was fond of<br />\nOW strange,\" said the English antiis it not so? and the English are so<br />\nmarble,<br />\ntrain<br />\nthe<br />\noff<br />\nquary, as he stepped<br />\nin their tastes, I thought perhaps<br />\nstrange<br />\nthey<br />\n\"that<br />\nhim,<br />\nand looked around<br />\nit<br />\nbe well to have the cook sweep out<br />\nwould<br />\nin<br />\ncomforts<br />\nare so scantily provided with<br />\nand wash the columns.\"<br />\nmausoleum<br />\nthe<br />\nrural France; now in England—\"<br />\n\"<br />\n!\"<br />\nWhat<br />\nif<br />\nway,<br />\nthis<br />\n\"Good morning, monsieur;<br />\n\"Ah, ah ; if monsieur would not jump so<br />\nmonsieur will please.\" A bustling porter<br />\nbuggy would be more steady; she has<br />\nthe<br />\nporter<br />\nThe<br />\nsidled up and cut him short.<br />\nit yet. I only suggested it.\"<br />\ndone<br />\nnot<br />\ntoaway<br />\ntook up his luggage and trudged<br />\nthe antiquary breathed a sigh of<br />\n;\"<br />\n\"Oh<br />\nplatform.<br />\nwards a vehicle that stood at the<br />\nboth relapsed into silence until<br />\nrelief,<br />\nand<br />\nyears<br />\nIt was a nondescript affair of many<br />\nsight of a small stone cottage,<br />\nin<br />\ncame<br />\nthey<br />\nhorse<br />\nservice with a still more nondescript<br />\nand perched high up on<br />\nruinous<br />\nhalf<br />\nitself<br />\nantiquary<br />\nThe<br />\nthat wheezed constantly.<br />\nvineyards.<br />\namidst<br />\nhill<br />\nthe<br />\na<br />\nwas<br />\nfollowed without murmuring for he<br />\n\"They say, monsieur,\" resumed the pormeek, abstracted man with a soul harbored<br />\nmore seriously, \"that there are spirits<br />\nter<br />\nsomewhere in the Italy of the classics and<br />\nthere.\"<br />\nover<br />\nonly a little dried up body moving in the<br />\nyou mean.\"<br />\n\"Ghosts,<br />\nvisible sight of men. His thin figure and<br />\nis it, ghosts.\"<br />\nthat<br />\n\"Yes,<br />\nsharp face were in striking contrast to the<br />\nhave been there since—\"<br />\nthey<br />\n\"And<br />\nburly muscles of the porter, a large and<br />\nthe palace. Mere Carrand<br />\nsince<br />\never<br />\n\"Oh,<br />\nfinely moulded Savoyard with a perfect hayher grandmother who,<br />\nfrom<br />\nstraight<br />\nit<br />\nhas<br />\nstack of black hair and large, clear eyes<br />\none walking on the<br />\nsaw<br />\nsoul,<br />\nher<br />\nrest<br />\nGod<br />\nthat suggested nothing but merely sunshiny<br />\nwere killed on the<br />\nTwo<br />\nlovers<br />\nhillside.<br />\nexistence. As he clucked to the horse he<br />\nBut that was—<br />\nsay.<br />\nsome<br />\ndevil,<br />\nhill;<br />\nthe<br />\nby<br />\nbegan:<br />\nin Latin.<br />\ntalked<br />\npeople<br />\nwhen<br />\nago,<br />\nlong<br />\noh,<br />\n\"I have taken a cottage as monsieur dedo you,<br />\nabout,<br />\nbe<br />\nstill<br />\nthink<br />\ncan<br />\nhe<br />\nnot<br />\ndo<br />\nI<br />\nsired, high up on the hill with a view over<br />\nmonsieur?\"<br />\nthe valley that is—ah, charming. And cool?<br />\n\"I do not think he will trouble you, my<br />\nWell, monsieur does not expect snow here<br />\nin June, but the wind sweeps over the hill good Pierre.\"<br />\n\"God knows, monsieur, but I do not underlike a breeze from the Alps.<br />\nthese matters. Father Murrain will<br />\nstand<br />\n\"And the ruins, Pierre, they are near?\"<br />\n-it to you. Father Murrain knows<br />\nexplain<br />\n\"Ruins? Oh. yes, yes, very near; and there<br />\nA good man is Father Murrain.<br />\neverything.<br />\nis a well in the yard and water that is the<br />\nask<br />\nto come up and talk with<br />\nhim<br />\nshall<br />\nI<br />\nenvy of all Vaucluse. Monsieur will be well<br />\nhe knows—oh, so much.\" The porfor<br />\nyou,<br />\npleased, and I have secured a cook that—\"<br />\nter made a gesture of awe.<br />\n\"You are sure you have the right ruins,<br />\n\"Never mind, I shall be very busy, and it<br />\nPierre, the ones Livy mentions, you know.\" is<br />\ntoo far for the good father to come. This<br />\n\"Livy? Yes, yes, very near; Monsieur is the house, is it?\"<br />\nLivy told me all *about them; very near in- i The two dismounted and went in. The<br />\n1<br />\ndeed.\"<br />\nantiquary quickly dined and dismissed<br />\nThe antiquary looked at the landscape and - Pierre who went off chattering; and then<br />\n1<br />\nthen continued:<br />\nclasping his hands behind him began to walk<br />\n!<br />\n\"There are the remains of a palace, I be- nervously up and down on the restricted<br />\nlieve, with a Greek mausoleum to one side.\"i veranda. The legend of the two lovers dis•<br />\n<br />\nrell<br />\n<br />\n1<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nturbed him. He was an authority on the<br />\nLatin ruins of southern France, and yet this<br />\ntale was apparently new. It could be but<br />\nthe idle chatter of a garrulous porter, possibly a village fabrication. Still there was<br />\na distinct gap in his knowledge of the ruins<br />\nof St. Remy, and to the delicately trained<br />\nmind there seemed to be here glimmerings<br />\nof truth, of remote facts and interlocking<br />\nconnections which the layman would pass<br />\nover unseeingly. At any rate it was worth<br />\nan investigation. He walked up and down<br />\nuntil far into the night.<br />\nTwo weeks, three weeks, however, a month<br />\nflitted by, and the antiquary, deep in other<br />\nresearches almost forgot the suggestions of<br />\na possible romance that had come with the<br />\nhearing of the legend. He was more than<br />\never fascinated and enraptured with the<br />\nclear, cold beauty which formed the subject<br />\nof his study and would in moments of extravagance even throw his arms about the<br />\nsnowy pillars of the mausoleum and almost<br />\nworship their forms with the delicately<br />\nchiseled capitals. The place was hopelessly<br />\nin ruins, but these columns with part of the<br />\npediment jutted out of the hillside almost<br />\nintact. He seated himself on a stone in<br />\nfront of them one afternoon and began to<br />\nrecall pictures of the life that throbbed on<br />\nthe hill seventeen centuries before. To his<br />\nidealizing fancy there came visions of beautiful women with the chiseled features of<br />\nAthena, and men of Ciceronian clearness of<br />\nmind, all overshadowed by the pure whiteness of these columns.<br />\nThe antiquary looked down on the village<br />\nin the valley beneath him with a gesture of<br />\ncontempt. What, after all, had modern life<br />\nto offer compared with the sublimity of those<br />\nsplendid days. He looked north-westward<br />\ntowards Paris and thought of the grime and<br />\npoverty and sin, the hot, nervous, brilliantly<br />\nscintillating but over excited and jaded life<br />\nof the metropolis. He thought with a shudder of disgust of the railway trains and great<br />\nmills full of machines grinding up men with<br />\nthe iron and cotton. Then he turned once<br />\nmore to the cold beautiful pillars which to<br />\nhim were not so much shapely pieces of marble as embodiments of a national soul, of<br />\na national intelligence now dead. The western sun bathed all below in a soft radiance<br />\nand shot gleams into the cool silent recesses<br />\n<br />\nof the porch where the shadows set off the<br />\ncolumns in chiaroscure and made them seem<br />\neven whiter than before. As he was engaged<br />\nin these reflections his eye wandered over<br />\nthe walls around him, but suddenly stopped<br />\nshort.<br />\nWith the keen sight of a trained investigator he stepped to the stone and brushed<br />\naway a few bits of dirt. A line of mortar<br />\nran straight upward and bent into an arch.<br />\nOne does not stop to think in such cases;<br />\nnor did the antiquary, but flew back to the<br />\nhouse for spade and hammer. A dozen<br />\nmaster strokes reduced the door to ruin.<br />\nHe applied the spade. There was a little<br />\nflying of fine dust, a blinding of mortar, and<br />\nthen the sun gleamed back into the depths<br />\nof a great cavernous hole in the hillside.<br />\nThe mausoleum itself; was ever perplexed<br />\nscholar so lucky. He clapped his hands<br />\nwith glee and danced a funny little wrinkled<br />\ncan-can on the stone flagging; then suddenly<br />\nrecalled himself, chid himself for his folly,<br />\nadjusted his spectacles, and proceeded. The<br />\nvault was damp, cold, and dismal, and oozy<br />\nlittle streams trickled over the walls and<br />\nmade slush upon the floor. There was something uncanny about the whole thing, so<br />\nuncanny that the antiquary shivered, not<br />\nwith cold, but with little creepy feelings up<br />\nand down his backbone. On either side<br />\nloomed, dark and eery, a stone sarcophagus,<br />\nthe only contents of the gloomy place. The<br />\nantiquary lit his lantern and approached one.<br />\nAfter brushing away the accumulated mold<br />\nof seventeen centuries he descried some worn<br />\nletters and read in the Latin:<br />\n\"Tullia, best beloved and slave of Taelus.\"<br />\n\"Ahem,\" chuckled the old man, and he<br />\nput the different parts of the inscription<br />\ntogether and drew his conclusions. Then<br />\nhe espied beneath some smaller letters and<br />\nread:<br />\n\"The gods love surpassingly even in anger, but their anger grows through love.\"<br />\nThe antiquary suddenly recalled the<br />\npeasant legend and nervously brushed off<br />\nmore dirt. The fever of research was beginning to light up his eyes, and excitement<br />\nburned wildly in his veins Without, the<br />\nsun sank lower and gloomier shadows crept<br />\ninto the vault, but he noticed none of this.<br />\nTurning to the other sarcophagus he read:<br />\n\"Corydon, beloved of Taelus.\"<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nand underneath a line from an eclogue of<br />\nVirgil, followed by another inscription:<br />\n\"Who are faithless to the gods shall feel<br />\ntheir anger.\"<br />\nThe antiquary sat down abruptly on the<br />\ndamp floor and ran his hands through his<br />\nhair in the travail of close reasoning.<br />\n\"A peasant legend; ahem; two lovers<br />\nkilled by master, jealous perhaps; of woman<br />\ncertainly; see inscription; then the man;<br />\nahem, yes;\" he paused to run through portions of the eclogue from memory. Two<br />\nJealousies perhaps. The old gentleman's affairs were a bit muddled. And then there<br />\nloomed before his mind the picture Corydon<br />\nand 'Pullin.; a stolen kiss under the soft shade<br />\nof the acacias; the sun in the west and one<br />\nlong, sweet moment compassing the very<br />\nbounds of eternity. Ah, now he saw the<br />\nsoul itself of these tall white columns, the<br />\ngrandeur and beauty, the simplicity and<br />\nsoftness.<br />\nThen across the picture strode a grim, severe man. On his face were marks of sensuality and dissipation and in his eyes<br />\ngleamed the light of cruelty, commingled<br />\nwith a certain maudlin sentimentality, the<br />\nremains of something noble. It was the<br />\npicture of the beast coming forth from the<br />\ndegenerate remains of an originally sturdy<br />\nRoman. There flashes from the brutal face<br />\na gleam of passion, then one of anger. There<br />\n<br />\nis a brow red, perhaps with wine, the flash<br />\nof steel, blood, and then—the mausoleum,<br />\nlast passionate expression of a master's love<br />\nand the two faithful, undutiful loiters lying<br />\nforever in the dank stone with the pale white<br />\npillars without. Now the antiquary saw it<br />\nall, but it was with a shudder.<br />\nAnd this beautiful Roman over which he<br />\nraved; ugh! It was as though the pure<br />\nbeauty of the outside were stripped off and<br />\nhere beneath lay the foul, poisonous miasma<br />\nof a mental pestilence. As he stepped towards the entrance a lizard without whisked<br />\naway into the shadow. The sun had set and<br />\nin the half darkness the marble seemed damp<br />\nand slimy. Even the beautiful capitals were<br />\ncrawly and unholy, and he shuddeded again<br />\nwith horror and disgust and shook himself<br />\nas though to shake off the impurity and bestiality. Slowly and rather sadly he walked<br />\nback to the cottage, and then turned to look<br />\nonce more at the mausoleum.<br />\nIn front he seemed to see again the tall<br />\nbeautiful pillars and the two lovers, spirits<br />\nof a far antiquity, the spirits of the nobility<br />\nof all men; and then across the porch strode<br />\nthe monster, Taelus, and all again was horrible with strange and unspeakable iniquity.<br />\n\"After all, it is nothing but the same old<br />\nlife,\" he sighed; and coldly and wearily<br />\nturned away from the ruined tomb.<br />\n<br />\nTHE SONG.<br />\nOthers may sing of the ocean blue,<br />\nOr the depth of the azure skies,<br />\nOf the Mediterranean's violet hue,<br />\nThe purple hills in the hazy view,<br />\nOr the blue bird bright as it flies.<br />\nBut the song I sing is a different song,<br />\nAnd one which never can be too long,<br />\n—I sing of my darling's eyes.<br />\n<br />\nOthers may sing of the yellow moon,<br />\nOr the sunlight's glittering glare,<br />\nOf buttercups sweet of an early June,<br />\nThe golden light of. the sun at noon,<br />\nOr the yellow daisies so fair.<br />\nBut the song I sing is a different song,<br />\nAnd one which never can be too long,<br />\nI sing of my darling's hair.<br />\n<br />\nOthers may sing of the murmuring brooks,<br />\nOr the light of the stars above,<br />\nOf the quiet joy in the hidden nooks,<br />\nThe stream and woods and the croaking<br />\nrooks,<br />\nOr the call of the cooing dove.<br />\nBut the song 1 sing is a different song,<br />\nAnd one which never can be tog long,<br />\nI sing of my darling love.<br />\n'06.<br />\n<br />\n•<br />\n<br />\n3<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n4<br />\n=<br />\n<br />\nTHE PLANS FOR HOMEWOOD.<br />\nPresident Remsen gave a very interesting<br />\nlecture in McCoy Hall last Friday .on the subject of the development of Homewood. He<br />\nspoke for the most part of. the laying out of<br />\nthe grounds and of the placing of the buildings, but also of the general style of architecture which was recommended by the<br />\nBoard and which will be followed out in the<br />\nerection of future buildings.<br />\nThe plan adopted was prepared by Parker<br />\nand Thomas, of Baltimore, and was chosen<br />\nfrom among the drawings of five firms of<br />\nNew York, Boston and Baltimore architects.<br />\nThe plan provides for the buildings needed<br />\nfor the immediate work of the University,<br />\nand also shows how these buildings can be<br />\nenlarged and new ones added so as to form<br />\nan harmonious part of the whole scheme.<br />\nPresident Remsen enumerated the buildings<br />\nthat will be necessary before the University<br />\ncan move to its new site. Among these he<br />\nmentioned the following:<br />\nA library; for present and future books to<br />\nnumber about 300,000 volumes.<br />\nA building containing about 20 seminary<br />\nclassrooms, for about 25 students each, arranged like large committee rooms. This<br />\nbuilding may be separate from the library,<br />\nbut conveniently connected with it, or there<br />\nmay be one building containing library and<br />\nthese seminary classrooms.<br />\n\"Levering Hall,\" Young Men's Christian<br />\nAssociation Building.<br />\nA building to contain administrative offices; president's, treasurer's and registrar's<br />\nrooms; an assembly hall to seat 1500 with a<br />\ndancing floor, and a small assembly hall to<br />\nseat about 200. The offices and assembly<br />\nhall may be separated into two buildings, if<br />\nthought desirable.<br />\nOne or two buildings to be two to four<br />\nstories in height and to contain in the aggregate 25 rooms, each seating about 40, to be<br />\nused as classrooms or lecture halls in nonlaboratory subjects.<br />\nSix buildings for laboratory purposes, each<br />\nincluding classrooms and department libraries for subjects mainly taught by laboratory<br />\nmethods, 19,006 square feet each. Two museums in connection with these, 10,000 square<br />\nfeet each. Two other museums one story<br />\nhigh, 10,000 square feet each.<br />\n<br />\nAuditorium for audience of about 2000,<br />\nwith stage, etc. A distinct and somewhat<br />\nmonumental building not necessarily among<br />\nthe first to be erected.<br />\nThree buildings for dormitories, three to<br />\nfive stories, 7500 square feet each.<br />\nDining establishments, with kitchen and<br />\nother domestic offices combined. Seating<br />\nand serving capacity of about 300.<br />\nA building or buildings containing provision for athletics, conveniently located for<br />\neasy access to students, and not necessarily<br />\ncombined with athletic grounds, which will<br />\nprobably be located at a more distant part<br />\nof the site.<br />\nPower-house. Provision will be made for<br />\nsupplying heat, light, etc. from this house<br />\nby underground conduits to all buildings.<br />\nPresident Remsen said he did not want<br />\nanyone to think, because the Chapel was not<br />\nnumbered among the immediate needs of the<br />\nUniversity, that not enough emphasis was<br />\nlaid on the religious side of University life.<br />\nThe Chapel is not one of the absolutely necessary buildings, because the new Levering<br />\nhail, which will be one of the first structures<br />\nto be begun at Homewood, will contain an<br />\nassembly room large enough to be used as<br />\na Chapel for the present.<br />\nIn addition to the outline of the general<br />\nplans for the grounds, Parker and Thomas<br />\nalso offered two specimen buildings with<br />\nfront and side elevations and floor plans.<br />\nThe particular buildings which they took for<br />\nillustration were a laboratory and a museum.<br />\nThe two buildings are designed in a style<br />\nwhich is an adaptation of classic ideas to<br />\nmodern needs. The probability iP that they<br />\nare intended to be constructed of marble and<br />\nthat \"cheerful red brick\" which Baedecker<br />\ndescribes as characteristically Baltimorean.<br />\nIt seems a pity that some form of Gothic<br />\narchitecture was not chosen, better suited,<br />\nperhaps, by its centuries of identification<br />\nwith Anglo-Saxon places of learning, for the<br />\nuse of a great University. The Commission,<br />\nhowever, in their tour of investigation<br />\nthrough the principal colleges of the East<br />\nand Middle West, were best pleased with the<br />\narchitecture of the Universtiy of Virginia.<br />\nThe plan there seemed to be both well suited<br />\nto its purpose and also consistently carried<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nout. This visit to Virginia may have had<br />\nsome influence on their choice. Perhaps also<br />\nthe following paragraph from Dr. Remsen's<br />\nreport may throw some light on the subject:<br />\n\"My preference is decidedly for simple and<br />\ncomparatively inexpensive buildings, though<br />\nI feel very strongly that they should represent a high type of architecture. After consultation with the advisory board and Mr.<br />\nKeyser, I sent the following notice to the<br />\ncompeting architects:<br />\n\"'In regard to the style of architecture<br />\nfor the buildings of the Johns Hopkins University at Homewood, the advisory board<br />\nhereby suggests to the competing architects<br />\nthat their preference is for such buildings<br />\nas are not elaborate and expensive in general<br />\nscheme or detail, but rather for such as are<br />\nsimple and dignified, with characteristics indicative of the purpose, and as inexpensive<br />\nas may be consistent with thoroughly good<br />\nconstruction.'\"<br />\nIn regard to the cost of moving to the<br />\ncountry, President Remsen can give no definite answer, but the following statement<br />\nsounds very encouraging, and leads us to<br />\nhope that the removal may be possible at<br />\nsome time in the near future:<br />\n\"In regard to the sum required to enable<br />\nus to move to Homewood, I do not venture<br />\nhere to make any specific statement; but such<br />\ncalculations as I have been able to make .<br />\n. . convince me that the problem of<br />\nmoving is one that can be solved.\"<br />\n<br />\n—A hustling promoter name Coe<br />\nWas head of a big cocoa Co.<br />\nA native named Koko<br />\nSaid, \"Pay what you owe, Coe,<br />\nOr give me the Coe Cocoa Co.\"<br />\nHe had other projects, had Coe—<br />\nCoke ovens were one line, and so<br />\nThe two coalesced.<br />\nImagine the rest:<br />\n\"Coe-Koko Coke and Cocoa Co!\"<br />\n—Exchange.<br />\n<br />\nChauncey Depew was once asked why a<br />\ncollege man was referred to as \"college<br />\nbred.\" \"I suppose,\" he said, \"it's because<br />\nit is usually a four years' loaf.\"<br />\n<br />\n•<br />\n<br />\n6<br />\n<br />\nTHE JOHNS HOPKINS<br />\nCOTILLON CLUB.<br />\nA movement was recently started in the<br />\nUniversity for the purpose of arranging a<br />\nseries of dances to be given through the<br />\nyear, similar to the dances that are given<br />\nin other colleges. The movement has been<br />\nvery enthusiastically carried forward by the<br />\nwhole student body, and has resulted in the<br />\nformation of the Johns Hopkins Cotillon<br />\nClub. Membership in the Club is open to<br />\nany student of the University upon the payment of the dues; these cannot be definitely<br />\nfixed until the number of members is known,<br />\nbut they will certainly be moderate. The<br />\nClub proposes to give four dances during the<br />\nwinter and spring, the dates, as arranged at<br />\npresent, being Wednesday, November 23rd,<br />\nJanuary 6th, February 21st, and April 28th;<br />\nthus the dances will be so distributed that<br />\none will occur at Thanksgiving, one during<br />\nthe Christmas holidays, one at Washington's<br />\nBirthday, and one at Easter.<br />\nThe University has permitted the Club to<br />\nhold the dances in McCoy Hall, on condition<br />\nthat they shall close at twelve. On account<br />\nof the short space of time allowed for the<br />\naffair, dancing will have to start promptly<br />\nat quarter to nine so as to get through in<br />\ntime. There will be twenty dances, with<br />\nan interval of \"twenty minutes for refreshments\" after the tenth dance. Mr. Griswold, of the Musical Clubs, has chosen the<br />\nmusic, so that it will undoubtedly be very<br />\ngood.<br />\nThe Governors of the Johns Hopkins Cotillon Club are the following: Maurice Miller, '05, President; Thomas Owings, '05,<br />\nTreasurer; Robertson Griswold, '05, W. H.<br />\nHudgins, '05, T. R. Chambers, '05, T. P. Maynard, '05, N. P. Pitcher, '05, Carlyle Barton,<br />\n'06, Leonard Sioussat, '06, Henry Hynson,<br />\n'07, and Iredell Iglehart, '07.<br />\nThe Humpt-up Monkey<br />\nSat in a tree.<br />\nHe fell by Darwinian Theory;<br />\nAnd all the King's asses,<br />\nAnd some so-called men,<br />\nAre trying to change<br />\nTo the monkey again.<br />\n—Vale Record.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n6<br />\n<br />\nEbe lflewsaietter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br />\n<br />\nNOVEMBER 18, 1904.<br />\n<br />\n10 Cents a single copy.<br />\n<br />\nSubscription $1.50 per year.<br />\n<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors<br />\n<br />\nTHOMAS OWINGS, 1905.<br />\nORMOND W. HAMMOND, 1906.<br />\nH. FINDLAY FRENCH, 1906.<br />\nTHOMAS G. MACHEN, 1906.<br />\n<br />\nW. R. STRAVORN,<br />\n{ E. LELAND SHACKELFORD,<br />\nG. Wourzuzcx,<br />\nBusiness Manager,<br />\nCARLY LIC BARTON,<br />\nAssistant Business Manager<br />\n<br />\nAthletic Editors,<br />\n<br />\n1905.<br />\n1906.<br />\n1905.<br />\n1906<br />\n<br />\nAddress all articles, communications, etc., to THOMAS<br />\nOWINGH, box 467, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\n<br />\nG. WOLTERECK, box 677, J. H. U.<br />\n<br />\nEDITORIAL.<br />\nDuring the last two or three years the<br />\nNEWS-LErniR has often heard the question,<br />\noften impatiently asked, why does not the<br />\nUniversity build an athletic field at Homewood? It was argued that even if the plans<br />\nhad not yet been definitely settled, it would<br />\nbe perfectly possible to level off a temporary<br />\nathletic field, which could be moved later<br />\non if the site were needed for buildings. The<br />\nUniversity authorities, however, preferred to<br />\nwait, and then build a permannet athletic<br />\nfield on the site provided for in the plans<br />\nadopted by the Trustees. Now that these<br />\nplans have been decided on, the athletic<br />\nfield is a thing of the immediate future, and<br />\nwill probably be begun very shortly. There<br />\nis a sum amounting to something over $2000<br />\navailable for the work. The one difficulty<br />\nin the case is the distance of the site chosen<br />\nfor the field from the city, and the fact that<br />\nno car line passes anywhere near it. The<br />\nnearest cars are at St. Paul and Thirtyfirst Sts., several squares away. Of course,<br />\nit would be very hard to get any large crowd<br />\nof spectators out to a field so difficult of<br />\naccess, and until the cars are brought nearer,<br />\ngames at such a field could hardly be great<br />\nfinancial successes. People nowadays are<br />\nnot willing to put up with such inconveniences in pursuit of pleasure as they -were<br />\n<br />\nin the days described in Dr. Renouf's article<br />\nin our last issue, when crowds arrived at<br />\nClifton after a weary ride in the horse-cars,<br />\nfollowed by a walk or 'bus ride to the field.<br />\nHappily, therefore, the problem of how to<br />\nget people out to the Homewood grounds<br />\nhas been nearly settled. A motion is now<br />\nin its third reading in the City Council to<br />\nchange the route of the St. Paul St. cars so<br />\nthat they will run out St. Paul Street (extended), to Merryman's Lane, and thence<br />\nacross to Roland Park. This would make<br />\nthe tracks pass by the proposed entrance<br />\nto the field on Merryman's Lane. It is expected that the permit for this change in<br />\nthe route of the cars will soon be issued, and<br />\nas soon as it is definitely settled, work on<br />\nthe field at Homewood will begin. It is to<br />\nbe hoped that the first leveling and sodding<br />\nof the ground can be begun this fall, so that<br />\nthe new field will be in condition for lacrosse<br />\nnext spring.<br />\nThe first feed of the Hullabaloo Club was<br />\nheld on Friday, November 4th. Although<br />\neveryone who attended had a very good<br />\ntime, the evening was not such a success<br />\nas had been anticipated, owing largely to<br />\nthe absence of nearly half the Senior class<br />\neither on business, or pleasure, or perhaps<br />\nboth. Whatever the reason, the fact remains that the class did not crowd the rooms<br />\nof the Hopkins Club in such numbers as to<br />\nseriously discomfort anybody. The members<br />\nof the committee who made arrangements<br />\nfor the use of the rooms for the feed, were<br />\na little doubtful whether the quarters that<br />\nwere assigned us would be large enough to<br />\ncontain the class; but as it turned out, things<br />\nwould probably have been lonesome if the<br />\nrooms had been any larger. Another thing<br />\nthat detracted from the complete success of<br />\nthe \"feed\" was the early hour at which it<br />\nstopped. This is, perhaps, directly traceable<br />\nto the smallness of the number present. The<br />\nNtWS-LETTF,R does not know a great deal<br />\nabout the feed before half-past ten. According to our ideas no well-regulated feed<br />\nshould ever stop before midnight, at the very<br />\nleast. This feed, however, was otherwise.<br />\nWhatever may have happened before half..<br />\npast ten (and we know of a couple of interesting and heretofore unheard of occurrences), certainly nothing occurred after-<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nward. Except for a few congenial souls<br />\nthat still basked in the proximity of the<br />\ncopious keg, everyone had adjourned to another room, where some read magazines and<br />\nothers—we hesitate to reveal it—played<br />\nchess! Let us draw the curtain on the<br />\nsolemn scene.<br />\nThe next feed will take place some time<br />\nin the latter part of this month; it is to be<br />\nhoped that the attendance will be larger than<br />\nthe last one. A very true proverb is that<br />\nwhich declares: \"The more the merrier!\"<br />\nand it is especially applicable to \"feeds.\"<br />\n<br />\n7<br />\n<br />\nmagazines. Three things govern the selection: literary merit of contributions, excellence of departments, and neatness in appearance. Following ia the list arranged alphabetically:<br />\nColumbia Literary Monthly....Columbia<br />\nUniversity<br />\nCollege<br />\nDartmouth<br />\n.<br />\nMagazine<br />\nDartmouth<br />\nGeorgetown<br />\n.<br />\nJournal.<br />\nCollege<br />\nGeorgetown<br />\nUniversity<br />\nUniversity<br />\nHarvard<br />\nMonthly<br />\nHarvard<br />\n.Princeton<br />\nMonthly.<br />\nLiterary<br />\nThe Nassau<br />\nUniversity<br />\nof<br />\nUniversity<br />\nBlue<br />\nThe Red and<br />\nPennsylvania<br />\nThe Santa Clara Redwood...Santa Clara<br />\nCollege<br />\nCollege<br />\nLafayette<br />\nTouchstone<br />\nThe<br />\nCalifornia<br />\nof<br />\n.University<br />\nMagazine.<br />\nIT. of Cal.<br />\nU. of North Carolina Magazine..University of N. C.<br />\n<br />\nThrough the generosity of Joseph Pulitzer,<br />\nColumbia University now possesses an endowed School of Journalism, the first of its<br />\nkind to be connected with any university.<br />\nThe Columbia Literary Monthly, commenting<br />\neditorially upon the gift, says in part:<br />\nIn making the gift, Mr. Pulitzer believed<br />\nthat journalism should be ranked as a proSYNOPSIS OF WAR NEWS.<br />\nfession, just as much as law, medicine, engineering, architecture and learning, and that<br />\n[By cable to the NEWS-LETTER, from our<br />\nthere should be established a well-equipped special correspondents in Manchuria].<br />\nprofessional school that would place the<br />\nGeneral Kuropatkin is preparing to resume<br />\nSchool of Journalism \"upon a level with his advance on St. Petersburg.<br />\nothers in supplying a definite educational<br />\nFor the 711th time Port Arthur has fallen.<br />\ncourse for students, and in affording the It fell 239 times last week.<br />\nnewspapers an opportunity to recruit their<br />\nThe Baltic fleet mistook the continent of<br />\nstaffs from men adequately prepared for the Africa for a Japanese torpedo-boat and<br />\nduties of that service.\"<br />\ncaused some injury to the Great Sahara<br />\nIn the new school, the university will Desert.<br />\naim to give both the theoretical and the pracGeneral Kumcutyourwhiskersoff has trans<br />\ntical side of journalism; to make a man pro- ferred his headquarters from Ohgotoh-ellski<br />\nficient and thorough in his methods.<br />\nto Ureanotherovitch.<br />\nWhat is wanted in our newspapers of toThe Tsarevitch, it is said, is about to asday is less quantity and better quality, and sume the chief command in Manchuria.<br />\nIf the men who are to write for the press<br />\nin a few years could be guided by a thorough<br />\nCUT OUT FOR THE JOB.<br />\ncourse in the fundamental principles that<br />\nMy Papa is a carver,<br />\nunderlie journalism a better class of newsThe bestest in the land;<br />\npapers would undoubtedly supplant the senAnd so he's often called upon,<br />\nsational, prejudiced journals of the present<br />\nTo lend the helping hand.<br />\nday.<br />\nThe University of Chicago will adopt the<br />\nOxford system of having the different departments of the college entirely distinct.<br />\nThe change will involve an expenditure of<br />\nfrom $2,000,000 to $3,000,000 in new buildings.<br />\nThe University of Virginia Magazine<br />\nmakes a classification of the ten best college<br />\n<br />\nTHE RHETORIC CLUB<br />\nThere's just one class in College,<br />\nWhich blends in mighty well;<br />\nThinks its instructor learned,<br />\nAnd even pretty swell.<br />\nThe reason isn't hidden,<br />\nMay easily be seen:<br />\nThe Freshmen are but children,<br />\nThe Prof. is also Green.<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nCAN WE WIN.<br />\nHAT are the chances of Hopkins<br />\nwinning the Lacrosse Championship next spring? This is the question which has greeted me on all sides ever<br />\nsince my return to the city after my summer<br />\nvacation. When this article appears in the<br />\nNEWS-LETTER, it will be but a short while before the end of the football season; and the<br />\nstudent body will be ready to hear the above<br />\nquestion answered by cold facts.<br />\nOf last year's team we have exactly five<br />\nmen left. These are Dill, Blanck, Strobar,<br />\nMeyer and Morse. It is true that Pearre is<br />\nstill with us, but when the match games begin he will have completed his course at the<br />\nUniversity. Hence, as a nucleus, around<br />\nwhich we are compelled to build up a winning team, we have two attack and three defense men. Of course, we have our faithful<br />\nscrub of last year, but, I may safely say, that<br />\nat present there is no man among them with<br />\nequal ability to any man we lost last spring.<br />\nI am not putting it too strong when I say<br />\nthat Hopkins has a larger gap to fill in her<br />\nline-up this year, than she has for many years<br />\npast. We have lost the best midfield combination which has ever represented the<br />\nblack and blue on the lacrosse field. Neither<br />\nmust we forget Putts, who has held down<br />\nin-home for four successive years. He, with<br />\nStrobar, Rosenheim, Dill, Bird and Mathai<br />\nmay be considered although not the strongest the fastest attack Hopkins has ever had.<br />\nOn the defense we have not lost so many<br />\nmen; nevertheless the three positions that<br />\nare open are the most difficult to fill. The<br />\ngame played by ex-captain Tough at third<br />\ndefense will not be equalled for some time.<br />\nPearre at first defense and Erlanger at goal<br />\nwere very steady players.<br />\n<br />\nW<br />\n<br />\nIn contrast to our loss it may be interesting to know that our strongest opponent,<br />\nSwarthmore, has no less than ten men of<br />\nlast year's team back. To fill one of the two<br />\nopen positions she has a man who is better<br />\nthan many of her last year's regulars. He<br />\ndid not play against us because of an injury<br />\nreceived in practice.<br />\nCan Hopkins beat this team of veterans,<br />\nand how? The first part of this question<br />\nhas but one answer. \"We must beat them,<br />\nor give up our title of the best Lacrosse College in the United• States.\" The answer to<br />\n\"how\" is that the coaches must get together,<br />\nand with the assistance of the student body,<br />\nas material, hammer together a team which<br />\nwill out-play and if possible, out-weigh<br />\nSwarthmore.<br />\nThere are two fundamental facts which, all<br />\nthe coaches agree, were the cause of our defeat last spring. In the year 1901; almost in<br />\n1903; and in 1904 Swarthmore defeated us<br />\nbecause she out-ran and out-weighed us.<br />\nTo fill the seven open places on our team,<br />\nwe must have men. In answer to the students who hold back on the excuse that they<br />\nhave never had a stick in their hands before,<br />\nwe may say, neither did any of us before we<br />\nentered the Freshman class. To those who<br />\ngive us the response \"I have never done anything in athletics,\" we in turn reply, neither<br />\nhad many of our best players before they<br />\ntook up lacrosse. Others when approached<br />\non the subject seem to be disinclined to come<br />\nout because they think that the places are<br />\npractically filled by men who have made a<br />\nnewspaper reputation at the prep. schools.<br />\nBy way of information for this class of men<br />\nI may add, that not one man out of twenty<br />\nprep-school athletes ever makes good at col-<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n9<br />\n<br />\nstrength, both defensively and offensively.<br />\nOnly twice during the entire game did Mount<br />\nWashington make the allotted five yards on<br />\nthe first down, and nearly every five yards<br />\nthat was ganied was obtained only after<br />\nthree plunges, and then not a large margin<br />\n.was left. The ends, which up to this game<br />\nhad showed up weak, took a decided brace,<br />\nand only two end runs were succesfully<br />\nmade, due to splendid interference. On the<br />\ndefense Kellam, Kelley and Higgins did great<br />\nwork for the line, while Crothers and Preble<br />\nexcelled on the offense. Several times<br />\nCrothers broke through guard and captured<br />\nthe runner, once for a loss of ten yards.<br />\nPreble also held Matthews back for a loss.<br />\nThe greatest surprise of the day, however,<br />\nwas when the Hopkins backs repeatedly<br />\nplunged through the club lines for gains of<br />\nfive and eight yards. Benton, who played<br />\nfullback, made his initial appearance at that<br />\nposition, and made tremendous gains. PreWM. C. SCHMEISSF,R.<br />\nviously he had been playing right tackle,<br />\nand it was only Friday night that he went<br />\ninto practice at the new position, when McHOPKINS, 6; MT. WASHINGTON, 0. Donnell, the -regular full, was called away<br />\nIn one of the most exciting and hotly con- on important business. He made the only<br />\ntested games of football seen on the local touchdown of the game. The two halfbacks<br />\ngridiron this season Johns Hopkins Univer- for Hopkins, Betts and Boyd, although<br />\nsity defeated the strong Mount Washington weighing only 138 and 139 pounds, respecclub on the grounds of the latter, November tively, played a thoroughly scientific game.<br />\n12, by the score of 6 to 0. The outcome of Betts made just ten successful dives after<br />\nthe game was totally unexpected by the 'var- Matthews, Reinhardt and Griffin, and in<br />\nsity adherents. Probably it was due to the several instances these men were thrown<br />\nfact that the 'varsity eleven knew that they back by him for big losses. During the enhad in the club men opponents who had tire contest not a single successful play was<br />\nbeen playing the strongest kind of a game made around his side. Several beautiful end<br />\nthis season that they pulled together as a runs were also made by the little right halfteam and played as they never played before. back. \"Mony\"Boyd also put up a brilliant<br />\nFrom the very start the 'varsity set such game at left halfback. He, too, never failed<br />\na terrific pace that the club men did not on a tackle, and his end runs were spectacsucceed in holding them for downs until ular.<br />\nwithin the 30-yard line. The Hopkins men<br />\nProbably the prettiest play of the entire<br />\nplayed with more dash than usual, and the game was the thirty-five yard run made by<br />\nfear was expressed that they could not hold \"Sandy\" Randall, Hopkins' star quarterout, but they did, and it was this fact that back. It was near the middle of the second<br />\nmade the game certain. In almost every half when Hopkins had the ball in the centre<br />\nstage of the game the collegians, although of the field. Randall tried a quarterback<br />\nconsiderably outweighed in the back field, run, and, aided by beautiful interference on<br />\nout-pointed their opponents. The backs of the part of Benton, Boyd and Betts, successthe club were strong and swift, but Hopkins' fully cleared the scrimmage.<br />\nbacks were swifter, and almost before the<br />\nChandlee, of Mount Washingotn, was layclub interference was formed either Betts or ing back, but Randall could have escaped<br />\nBoyd had nailed the runner.<br />\nhim had he not mistook Pearre, who was<br />\nThe Hopkins line developed unexpected running immediately behind him, endeavor-<br />\n<br />\nlege. It is true that we have some of these<br />\nplayers with us; but none of them have as<br />\nyet cinched a place on the team.<br />\nIn conclusion let me say, that whosoever<br />\nyou may be, come out and try for the team.<br />\nWe need you; if you are a large man we<br />\nneed you that much more. If you are a<br />\ntrack-man you will be in your element. The<br />\nmajority of our best players have won their<br />\nfirsts on the track team. Fitzgerald, Abercrombie, McInnes, Wilson, Bruton, Tyler,<br />\nBlanck and many others have won honors in<br />\nboth sports. The Freshman class is large,<br />\nand I know that there are many Juniors who<br />\nare sorry that they did not take up the game<br />\nlast year. From these two classes we must<br />\nget the men who will win the championships<br />\nof the future. Can Hopknis win the Lacrosse<br />\nChampionship next spring? \"Yes, provided<br />\nthat each student will do his share of the<br />\nwork.\"<br />\n<br />\n•<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n_<br />\n<br />\ning to pass to form interference, for a Mount<br />\nWashington player and run into the arms of<br />\nof Chandlee. He was downed on the sixteen<br />\nyard line. Then three line plunges and Benton carried the ball over for a touchdown<br />\namid the deafening cheers of the Hopkins<br />\nrooters. Randall kicked goal. It was in<br />\nthe last plunge that Randall displayed his<br />\nsteadiness. Ile dropped the ball on a pass<br />\ntrom centre, and although several Mount<br />\nWashington players dived for it, he picked<br />\nit up and coolly handed it to Benton.<br />\nIn the first half Hopkins came near scoring, but lost the ball by a fumble on the<br />\nfifteen-yard line. The game was called about<br />\nthree minutes before the end of the second<br />\nhalf on account of darkness, and Hopkins<br />\nthen had the ball on Mount Washington's<br />\nfifteen-yard line.<br />\nThe line-up:<br />\nHopkins—Pearre (captain), r. e.; Higgins and<br />\n131auck, r. t.; Kellam, r. g.; Preble, c.; Crothers, 1.<br />\ng.; Kelley, I. t.; Boyce, 1. e.; Randall, q. b.; Benton,<br />\nf.b.; Betts, r. h. b.; Boyd, 1. h. b.<br />\nMount Washington—Williams, r. e.; Robinson, r.<br />\nt.; Ridgely, r. g.; Gordan and Griffith, c.; Cogswell,<br />\n1. g.; Rider, I. t.; Marye and Nine, 1. e.; Chandlee,<br />\nq. b.; Matthews, r. h. b.; Griffin, f. b.; Reinhardt<br />\nand Marye, 1. h. b.<br />\nEteferee—Dr. Bray, of Lafayette College. Umpire<br />\n—Mr. Randall, of M. A. C. Timers—Messrs. Dill<br />\nand Gill. Linesmen—Messrs. Mealy and Hudgins.<br />\nTime of halves—Twenty minutes.<br />\n<br />\npass by our centre, and by clever end-runs<br />\nWashington brought the pig-skin down to<br />\nour 30-yard line. They got no further, however, and were forced to give up the ball.<br />\nWe then worked up to within 15 yards of<br />\na touchdown, but the calling of time prevented our securing it.<br />\nThe second half opened with a pretty kickoff by Randall to Bielaski, of Washington,<br />\nwho, supported by splendid interference,<br />\nmade repeated gains around our right end.<br />\nAt our 30-yard line Washington fumbled,<br />\nand Betts and McDonnell mercilessly revenged themselves on Washington's line.<br />\nOur opponents braced up and held us for<br />\ndowns on their 30-yard line, but were unable<br />\nto follow up their advantage. They punted<br />\nand Randall caught the ball. The teams<br />\nwere again lined up on Washington's 30yard mark, when time was called.<br />\nRandall, Betts and McDonnell starred for<br />\nHopkins, while Stienerson and Bielaski played best for Washington. The line up was<br />\nas follows:<br />\nHopkins.<br />\nBoyce<br />\nKelly<br />\nCrothers<br />\nPreble<br />\nKellam<br />\nBenton<br />\nPearre (Capt.)<br />\nRandall<br />\nBoyd<br />\nBetts<br />\nMcDonnell<br />\n<br />\nPositions.<br />\nG. Washington.<br />\nLeft end<br />\nVanvliet<br />\nLeft tackle<br />\nLaw<br />\nLeft guard<br />\nPerry<br />\nCenter<br />\nWoods<br />\nRight guard<br />\nKilgore<br />\nRight tackle<br />\nMorris<br />\nRight end<br />\nW West<br />\nQuarterback<br />\nStienerson<br />\nLeft half back....Bielaski (capt.)<br />\nRight halfback<br />\nStevenson<br />\nFullback<br />\nF West<br />\nReferee—Bray, Lafayette. Umpire—Kelly, Geo.<br />\nWashington. Linesmen—Sutton, George Washington; Hill, Johns Hopkins University. Timekeepers<br />\n—Collins, George Washington, and Dill, Johns Hopkins University. Length of Halves-25 minutes.<br />\n<br />\nHopkins football team showed its mettle<br />\non Saturday, Nov. 5, when it played George<br />\nWashington University, of Washington, D.<br />\nC., with the score of 0-0. The game was<br />\nexciting and clean from start to finish, and<br />\nthe rivalry was voiced by the rooters of both<br />\nUniversities. The day, though cloudy, was<br />\nan admirable one for the game, as it was<br />\njust cool enough to keep the men moving.<br />\nWith whiskers thick upon my face<br />\nThough our back-field was weakened by the<br />\n.1 went my fair to see;<br />\nabsence of Blanck, whose knee was injured<br />\nShe told me she could never love<br />\nin the game with Western Maryland, and of<br />\nA bear-faced chap like me.<br />\nCampbell, their places were ably filled by<br />\nBetts and Boyd.<br />\nI then shaved clean, and called again,<br />\nThe kick-off was won by the visitors, and<br />\nAnd thought my troubles o'er;<br />\nRandall cleverly caught the ball at our 25She laughed outright, and said I was<br />\nyard line. In an incredibly short time we<br />\nMore bare-faced than before.<br />\nploughed our way down to Washingtons'<br />\nA. C. M.<br />\n40-yard line, but lost the ball on a fumble.<br />\nOur opponents then forced the centre of battle back to our 5-yard line. Here Hopkins He wrote a letter to his love,<br />\nAnd filled it full of warm and keen desire;<br />\nheld them for downs and Betts, Boyd and<br />\nHe hoped to raise a flame, and so he did:<br />\nWorthington alternately hammered the visThe lady put his nonsense in the fire.<br />\nitors ,until again their goal was neared. We<br />\nfumble,<br />\nball<br />\non<br />\npoor<br />\nowing<br />\na<br />\nto a<br />\nlost the<br />\nA. C. M.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nTHE GRADUATE DEPARTMENT.<br />\nEconomic Jottings—The Economic Seminary is still investigating the structure and<br />\nfunctions of trade unions. A second edition<br />\nof the \"Trial Bibliography of Trade Union<br />\nPublications\" will probably appear some<br />\nAnother manifestime during the year.<br />\ntation of the department's co-operative<br />\nactivity, there are rumors of a collective publication. This publication, it appears, will<br />\nconsist of a series of essays on special phases<br />\nof trade unionism as exemplified in the history of a particular union.<br />\nWith the addition of a Swede, Mr. Gosta<br />\nA. Bagge, and a student front the far away<br />\nisland of Japan, Mr. Z. Watanahe, the Economic Seminary this year takes on quite a<br />\ncosmopolitan air.<br />\nLuther M. R. Wills, who took his bachelor's degree last June, is back at the University studying economics and politics in addition to his course in law at the University of<br />\nMaryland. He is also working at the thesis<br />\n\"The Legal Aspects of Trade Unionism.\"<br />\nOriental Department—About a dozen students have come over from the Medical<br />\nSchool to attend a series of lectures upon the<br />\nliterature of the Bible, based on the authorized version.<br />\nIn the History Department—Things have<br />\nopened auspiciously with the addition of a<br />\nnew member to the teaching staff and several<br />\nnew students. The new students are S. Lynch<br />\nWare, A: B., Oxford, 1895, L. L. B. Columbia<br />\nUniversity; D. S. Freeman, B. F. Wilson and<br />\nL. G. Corkran.<br />\nDr. Vincent has, heretofore, kept the department well in touch with the spirit of<br />\nGerman historical method. But under Dr.<br />\nKeutgen, of Jena, more intimate study than<br />\nhas hitherto been possible, will be given to<br />\ncertain sciences, auxiliary to historical research, particularly Diplomatics and Paleography. Already the men are beginning to<br />\n-pore over dry and dusty Latin diplomas.<br />\nDepartment of Political Science—Dr. Willoughby is giving this year a course of lectures on the \"Legal Aspects of Economic<br />\nProblems.\" Many interesting topics will be<br />\ndiscussed, such as the interstate commerce<br />\nlaws, employers' liability, the incorporation<br />\nof trade unions. Dr. Willoughby will also<br />\ncontinue to lecture on the \"History of Political Philosophy.\" In the seminary, particular<br />\nphases of international law will be taken up.<br />\n<br />\n11<br />\n<br />\nALUMNI NOTES.<br />\n'03 Alan Haughton has a position as professor in the Peabody Preparatory School.<br />\n'98 Edgeworth Smith has left the University, where he was studying in the Graduate<br />\nDepartment, and is devoting his time to the<br />\nstudy of music.<br />\n'01 Fishack has managed the recent campaign of Robert Garrett, for Congress.<br />\n'04 Jesse Bennett has accepted a position<br />\nin a broker's office in New York City.<br />\n'00 T. Noel De L. Purcell has returned to<br />\nthe University, and is taking courses connected with the Romance Department.<br />\n<br />\nAT THE MEDICAL SCHOOL.<br />\nThe Johns Hopkins Hospital Historical<br />\nClub held an interesting session last Monday<br />\nnight in the Medical Amphitheatre, The<br />\nprogram was as follows:-1. A Manuscript Copy of a Work by John<br />\nCrawford on Tropical Diseases, written between 1794 and 1796—Dr. E. F. Cordell.<br />\n2. Recent Works on the History of Medicine—Dr. William Osier.<br />\n3. History of Guy's House, London—Dr.<br />\nMcCrae.<br />\nSoon after Dr. Osler's intention to accept<br />\nthe professorship in Oxford had been announced, some of his closest friends in the<br />\nMedical School met to discuss plans for<br />\nerecting a memorial building to the great<br />\nphysician. The first meeting of the committee was at the home of the Medical and<br />\nChirurgical Faculty on Hamilton Terrace. A<br />\nsecond committee was appointed to consult<br />\nwith the first.<br />\nSeveral plans have been discussed by the<br />\ncommittees. One idea was to buy Dr. Osler's present home on Franklin Street. Another was to erect a building to be added to<br />\nthe present group of buildings of the Medical School; but this was rejected, as being<br />\ntoo local an idea for a memorial to a man of<br />\nworld-wide reputation. Still another plan<br />\nwas to use the building for the library of<br />\nthe Medical and Chirurgical Faculty, for<br />\nwhich appropriations had been asked from<br />\nthe Legislature to use for a building. This<br />\nwas considered a good idea, as Dr. Osier<br />\nhas for years been identified with this library.<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nNOTES FROM OTHER COLLEGES.<br />\n[From the Princeton Alumni Weekly].<br />\nA new verse for \"Ramble.\"<br />\n\"The Tiger plays at football<br />\nWith vigor, force and vim,<br />\nAnd in the game of baseball<br />\nOld Yale is pie for him.<br />\nThe famous Eli bulldog<br />\nWill soon be in the soup,<br />\nAgain we'll see the Tiger<br />\nMake the bulldog loop the loop.\"<br />\nAlthough this verse failed to have the desired effect, that of making \" the bulldog<br />\nloop tile loop,\" yet Princeton will soon attack Yale on another flank. She has chosen<br />\nthe negative of the following question for<br />\nthe annual debate with Yale, to be held at<br />\nNew Haven on December 9th: Resolved,<br />\nThat it should be the policy of the United<br />\nStates not to hold territory permanently unless with the purpose that it should ultimately enjoy statehood. In the final trials last<br />\nweek the following provisional team was<br />\nchosen: J. L. Semple '05, N. M. Thomas '05,<br />\nThe Spencer Trask<br />\nW. S. Davison '06.<br />\nPrize of $50, awarded annually in these trials<br />\nto the man who delivers the best debate,<br />\nexclusive of those who have won it in former<br />\nyears, was awarded to J. L. Semple.<br />\n<br />\nActive work has been started in the organization of clubs to represent not only<br />\nevery county in Pennsylvania and every<br />\nState in the Union, but every country<br />\nthroughout the world from which students<br />\nhave come to Pennsylvania. When the task<br />\nis completed there should be fully 200 clubs<br />\nin the university.<br />\n<br />\nSeveral prominent members of the upper<br />\nclasses at Minnesota University have organied a novel club. The club will be called<br />\nthe Red Stripe.<br />\nThe object and purpose of the members<br />\nwill be to see all the football games played<br />\nby Minnesota outside of Minneapolis, and<br />\nby so doing not pay car fare.<br />\nThey will beat their way to the points<br />\nwhere the games are held and, if possible,<br />\ngain free admission to the grounds.<br />\nOfficers were elected, and the director of<br />\nroutes instructed the members of the club<br />\nto assemble the day before the Northwestern<br />\ngame.<br />\n<br />\nLast year, Michigan had representatives<br />\nfrom every state but Delaware arid South<br />\nCarolina, from every territory except Alaska,<br />\nfrom all new possessions—Hawaii, Porto<br />\nRico and the Philippines—and from the following states and provinces: Germany, Holland, Turkey, Arabia, Bulgaria, Japan, Mexico, Columbia, Cuba, England, Jamaica, Ontario, Quebec, Nova Scotia.—The Michigan<br />\nDaily.<br />\n<br />\nFourteen colleges in the United States now<br />\npublish daily papers. In all other countries<br />\ncollege journalism is practically unknown.<br />\n<br />\nYale University's education mission in<br />\nChina has received 517,000 from the British<br />\nGovernment, which will probably be used<br />\nto erect a memorial building to Yale's first<br />\nmissionary, Rev. John Lawrence Thurston.<br />\n<br />\n\f\"A WTJ<br />\n<br />\nn..-,.)Da.<br />\n<br />\nuWLErEsTABL:camaparr\"<br />\n<br />\nikt'•<br />\n<br />\n°<br />\n<br />\nTo Our, fACILITIES FOL, TAIZOB-ING<br />\n<br />\n(<br />\n<br />\n,<br />\n<br />\n'4?„<br />\n<br />\nii‘1311?I)/vsi<br />\n<br />\nW8 ffve Polite Salesmen.<br />\nWe Have Expert Cutters.<br />\nWe Have a Large Assortment of Materials.<br />\n<br />\n421<br />\n<br />\nN. 1-10Ar/A1.2D<br />\n<br />\nt.<br />\n<br />\n2<br />\n<br />\nAT POPULAR PRICES,<br />\n<br />\nFhc<br />\n<br />\noesi(ikwc.['lade at $1.00 Per<br />\n<br />\nMENU AND BANQUET CARDS.<br />\n<br />\nD01/SL 1\\1<br />\n<br />\nBaltimore, Md.<br />\n<br />\nSTATIONER AND ENGRAVER,<br />\n<br />\n220 NORTH CHARLES MINT,<br />\n<br />\n......1141•116W8.1.1MOISIIMINVINOINIMNIL<br />\n<br />\nIE,<br />\n<br />\nr.1 14 NUNN. 1. elite with Cu• I In<br />\n<br />\nPrices,<br />\n<br />\nCOLLEGE AND CLASS STATIONERY,<br />\n<br />\neyforth & Sons,<br />\n...Tailors...<br />\n217-219 North NCO Street,<br />\n<br />\nPoor.s totiow rronklin .!tihmt.<br />\n<br />\nrtc. at Popuior<br />\n<br />\n.ShIrts, Nedtwe,ar,<br />\n<br />\ndik<br />\n<br />\nN UNN & CON 1)ANY,<br />\nBOOKSELLERS AND STATIONERS-<br />\n<br />\n\fseeigia leak IOW'rag\"•aillak ',WOK siiarrok. Nagich,<br />\n<br />\n'NSW WINK mask<br />\n<br />\nLI AMI-VI,<br />\n<br />\nToilor<br />\nIf you like<br />\nFiler('<br />\n<br />\n110lhillti<br />\n<br />\nlo a 1_1-.MMI1V<br />\noc (01W:cwt.<br />\n<br />\nIke or c4itiai<br />\n1.4)1.<br />\n<br />\nto wear your<br />\ngloves long, wear<br />\n<br />\nI ['AWL:VI -<br />\n<br />\n.<br />\n<br />\nFownes Gloves<br />\n<br />\n19 W. .s/1PA 1-0(<br />\n<br />\nI<br />\n<br />\nwok<br />\n<br />\nlassa,,assok<br />\n<br />\nrsois, yolk Nola low<br />\n<br />\n01.0.40.00.0101..0.00<br />\n,<br />\n.1•00.00.<br />\n<br />\nThey wear longer.<br />\n<br />\nBOOKBINDING<br />\nWe Bind Tastefully.<br />\n<br />\nBooks, Phamplets, Music, Etc.<br />\nSpecimens Submitted with Pleasure.<br />\n<br />\nRUZICK7N,<br />\n609 N. EUTAW ST.,<br />\nTelephone, Mt, Vernon 3022.<br />\n001.0100110001.1010.001010<br />\n•<br />\n0100<br />\n.<br />\n00100.<br />\n<br />\nSISCO HOS<br />\n<br />\nms to -11<br />\n>> r<br />\n<br />\n18 West<br />\nLexington SI.<br />\n<br />\nZ><br />\nZ<br />\n<br />\nJohn S. Kerr<br />\nW. Parris Rolph<br />\n<br />\nC. & P. Phone<br />\n<br />\nJAMES CLARK, President.<br />\n<br />\nKERR & ROLPH<br />\nilepramt,ng Arthur Johnson & Co..<br />\nNew York City.<br />\n<br />\n11<br />\n<br />\nlovers awl Jilecollics liatiollai<br />\n<br />\nSpo!tIng Goods<br />\nand<br />\n<br />\nAthletic -upplies<br />\n<br />\nBALTIMORE, MO. \"<br />\n<br />\n301 PARK AVENUE,<br />\n<br />\nBALTIMORE. MD.<br />\n<br />\nLAW<br />\n<br />\nPAUL A. SEEGER, Vice-President.<br />\nCHARLES S. MILLER.Cashier.<br />\nEDWIN P. HAYDEN, Ass't Casb.<br />\n<br />\nLECTURES_<br />\nBetween 6 and 9 P. M.<br />\n. . at the .<br />\n<br />\nnot.<br />\n<br />\nCapital, - —•------ $300,000.00<br />\nSurplus and undivided profits, $495,000.00<br />\nBoxes Rented.<br />\nSafe Deposit Vaults.<br />\nCareful Attention to the interests of Depositors.<br />\nWe Invite You to Open an Account with Us.<br />\n•••••0••••44004.4144*********4***••••1<br />\n<br />\nBaltimore University,<br />\n<br />\nAddress .J. V. KELLY, Sec.-Treas.<br />\n840 North OharIes Street,<br />\n<br />\nBaltimore. Md.<br />\n<br />\nFOR ADVERTISING RATES<br />\nIN THIS PAPER,<br />\n<br />\n.<br />\n<br />\n••••••••••••••••••••••••••••••••••••••<br />\n<br />\n0<br />\n•<br />\n•<br />\n•<br />\n.<br />\n.<br />\n•<br />\n: WIINTED :0<br />\n•<br />\n•<br />\n<br />\n••<br />\n•<br />\n—ALUMNI TO INSERT THEIR BUSI.<br />\n•<br />\n•<br />\nNESS AND PROFESSIONAL CARDS<br />\n•<br />\n•<br />\n•<br />\n•<br />\n<br />\nIN THE NEWS-LETTER.<br />\n<br />\nADDRESS<br />\n<br />\n0<br />\n<br />\n•<br />\n*<br />\n•<br />\nft<br />\nto<br />\n<br />\nTHE<br />\nNEWS-LETTER,<br />\njohns Hopkins University,<br />\n<br />\nV<br />\n*<br />\n<br />\ne<br />\n•<br />\n•<br />\n•<br />\n•<br />\n0<br />\n•<br />\n0<br />\n••••••••••••••••••••••••••••••••••••••<br />\n<br />\nBALTIMORE.<br />\n<br />\n\f", "format": "basic_html", "processed": "9?<br />\nrty:3mprirrk<br /><br />\nIffIEMF<br /><br />\ns1 i E N foCR<br /><br />\nTHENTOHNS•HOFKINS-UNIVERSITY<br />\nBALTIMORE<br /><br />\nThe News-Letter<br />\nVol. IX.<br /><br />\nNovember 18, 1904,<br /><br />\nNo. 3<br /><br />\nAN ANTIQUARIAN ROMANCE.<br />\n\"Yes; and •I knew monsieur was fond of<br />\nOW strange,\" said the English antiis it not so? and the English are so<br />\nmarble,<br />\ntrain<br />\nthe<br />\noff<br />\nquary, as he stepped<br />\nin their tastes, I thought perhaps<br />\nstrange<br />\nthey<br />\n\"that<br />\nhim,<br />\nand looked around<br />\nit<br />\nbe well to have the cook sweep out<br />\nwould<br />\nin<br />\ncomforts<br />\nare so scantily provided with<br />\nand wash the columns.\"<br />\nmausoleum<br />\nthe<br />\nrural France; now in England—\"<br />\n\"<br />\n!\"<br />\nWhat<br />\nif<br />\nway,<br />\nthis<br />\n\"Good morning, monsieur;<br />\n\"Ah, ah ; if monsieur would not jump so<br />\nmonsieur will please.\" A bustling porter<br />\nbuggy would be more steady; she has<br />\nthe<br />\nporter<br />\nThe<br />\nsidled up and cut him short.<br />\nit yet. I only suggested it.\"<br />\ndone<br />\nnot<br />\ntoaway<br />\ntook up his luggage and trudged<br />\nthe antiquary breathed a sigh of<br />\n;\"<br />\n\"Oh<br />\nplatform.<br />\nwards a vehicle that stood at the<br />\nboth relapsed into silence until<br />\nrelief,<br />\nand<br />\nyears<br />\nIt was a nondescript affair of many<br />\nsight of a small stone cottage,<br />\nin<br />\ncame<br />\nthey<br />\nhorse<br />\nservice with a still more nondescript<br />\nand perched high up on<br />\nruinous<br />\nhalf<br />\nitself<br />\nantiquary<br />\nThe<br />\nthat wheezed constantly.<br />\nvineyards.<br />\namidst<br />\nhill<br />\nthe<br />\na<br />\nwas<br />\nfollowed without murmuring for he<br />\n\"They say, monsieur,\" resumed the pormeek, abstracted man with a soul harbored<br />\nmore seriously, \"that there are spirits<br />\nter<br />\nsomewhere in the Italy of the classics and<br />\nthere.\"<br />\nover<br />\nonly a little dried up body moving in the<br />\nyou mean.\"<br />\n\"Ghosts,<br />\nvisible sight of men. His thin figure and<br />\nis it, ghosts.\"<br />\nthat<br />\n\"Yes,<br />\nsharp face were in striking contrast to the<br />\nhave been there since—\"<br />\nthey<br />\n\"And<br />\nburly muscles of the porter, a large and<br />\nthe palace. Mere Carrand<br />\nsince<br />\never<br />\n\"Oh,<br />\nfinely moulded Savoyard with a perfect hayher grandmother who,<br />\nfrom<br />\nstraight<br />\nit<br />\nhas<br />\nstack of black hair and large, clear eyes<br />\none walking on the<br />\nsaw<br />\nsoul,<br />\nher<br />\nrest<br />\nGod<br />\nthat suggested nothing but merely sunshiny<br />\nwere killed on the<br />\nTwo<br />\nlovers<br />\nhillside.<br />\nexistence. As he clucked to the horse he<br />\nBut that was—<br />\nsay.<br />\nsome<br />\ndevil,<br />\nhill;<br />\nthe<br />\nby<br />\nbegan:<br />\nin Latin.<br />\ntalked<br />\npeople<br />\nwhen<br />\nago,<br />\nlong<br />\noh,<br />\n\"I have taken a cottage as monsieur dedo you,<br />\nabout,<br />\nbe<br />\nstill<br />\nthink<br />\ncan<br />\nhe<br />\nnot<br />\ndo<br />\nI<br />\nsired, high up on the hill with a view over<br />\nmonsieur?\"<br />\nthe valley that is—ah, charming. And cool?<br />\n\"I do not think he will trouble you, my<br />\nWell, monsieur does not expect snow here<br />\nin June, but the wind sweeps over the hill good Pierre.\"<br />\n\"God knows, monsieur, but I do not underlike a breeze from the Alps.<br />\nthese matters. Father Murrain will<br />\nstand<br />\n\"And the ruins, Pierre, they are near?\"<br />\n-it to you. Father Murrain knows<br />\nexplain<br />\n\"Ruins? Oh. yes, yes, very near; and there<br />\nA good man is Father Murrain.<br />\neverything.<br />\nis a well in the yard and water that is the<br />\nask<br />\nto come up and talk with<br />\nhim<br />\nshall<br />\nI<br />\nenvy of all Vaucluse. Monsieur will be well<br />\nhe knows—oh, so much.\" The porfor<br />\nyou,<br />\npleased, and I have secured a cook that—\"<br />\nter made a gesture of awe.<br />\n\"You are sure you have the right ruins,<br />\n\"Never mind, I shall be very busy, and it<br />\nPierre, the ones Livy mentions, you know.\" is<br />\ntoo far for the good father to come. This<br />\n\"Livy? Yes, yes, very near; Monsieur is the house, is it?\"<br />\nLivy told me all *about them; very near in- i The two dismounted and went in. The<br />\n1<br />\ndeed.\"<br />\nantiquary quickly dined and dismissed<br />\nThe antiquary looked at the landscape and - Pierre who went off chattering; and then<br />\n1<br />\nthen continued:<br />\nclasping his hands behind him began to walk<br />\n!<br />\n\"There are the remains of a palace, I be- nervously up and down on the restricted<br />\nlieve, with a Greek mausoleum to one side.\"i veranda. The legend of the two lovers dis•<br /><br />\nrell<br /><br />\n1<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nturbed him. He was an authority on the<br />\nLatin ruins of southern France, and yet this<br />\ntale was apparently new. It could be but<br />\nthe idle chatter of a garrulous porter, possibly a village fabrication. Still there was<br />\na distinct gap in his knowledge of the ruins<br />\nof St. Remy, and to the delicately trained<br />\nmind there seemed to be here glimmerings<br />\nof truth, of remote facts and interlocking<br />\nconnections which the layman would pass<br />\nover unseeingly. At any rate it was worth<br />\nan investigation. He walked up and down<br />\nuntil far into the night.<br />\nTwo weeks, three weeks, however, a month<br />\nflitted by, and the antiquary, deep in other<br />\nresearches almost forgot the suggestions of<br />\na possible romance that had come with the<br />\nhearing of the legend. He was more than<br />\never fascinated and enraptured with the<br />\nclear, cold beauty which formed the subject<br />\nof his study and would in moments of extravagance even throw his arms about the<br />\nsnowy pillars of the mausoleum and almost<br />\nworship their forms with the delicately<br />\nchiseled capitals. The place was hopelessly<br />\nin ruins, but these columns with part of the<br />\npediment jutted out of the hillside almost<br />\nintact. He seated himself on a stone in<br />\nfront of them one afternoon and began to<br />\nrecall pictures of the life that throbbed on<br />\nthe hill seventeen centuries before. To his<br />\nidealizing fancy there came visions of beautiful women with the chiseled features of<br />\nAthena, and men of Ciceronian clearness of<br />\nmind, all overshadowed by the pure whiteness of these columns.<br />\nThe antiquary looked down on the village<br />\nin the valley beneath him with a gesture of<br />\ncontempt. What, after all, had modern life<br />\nto offer compared with the sublimity of those<br />\nsplendid days. He looked north-westward<br />\ntowards Paris and thought of the grime and<br />\npoverty and sin, the hot, nervous, brilliantly<br />\nscintillating but over excited and jaded life<br />\nof the metropolis. He thought with a shudder of disgust of the railway trains and great<br />\nmills full of machines grinding up men with<br />\nthe iron and cotton. Then he turned once<br />\nmore to the cold beautiful pillars which to<br />\nhim were not so much shapely pieces of marble as embodiments of a national soul, of<br />\na national intelligence now dead. The western sun bathed all below in a soft radiance<br />\nand shot gleams into the cool silent recesses<br /><br />\nof the porch where the shadows set off the<br />\ncolumns in chiaroscure and made them seem<br />\neven whiter than before. As he was engaged<br />\nin these reflections his eye wandered over<br />\nthe walls around him, but suddenly stopped<br />\nshort.<br />\nWith the keen sight of a trained investigator he stepped to the stone and brushed<br />\naway a few bits of dirt. A line of mortar<br />\nran straight upward and bent into an arch.<br />\nOne does not stop to think in such cases;<br />\nnor did the antiquary, but flew back to the<br />\nhouse for spade and hammer. A dozen<br />\nmaster strokes reduced the door to ruin.<br />\nHe applied the spade. There was a little<br />\nflying of fine dust, a blinding of mortar, and<br />\nthen the sun gleamed back into the depths<br />\nof a great cavernous hole in the hillside.<br />\nThe mausoleum itself; was ever perplexed<br />\nscholar so lucky. He clapped his hands<br />\nwith glee and danced a funny little wrinkled<br />\ncan-can on the stone flagging; then suddenly<br />\nrecalled himself, chid himself for his folly,<br />\nadjusted his spectacles, and proceeded. The<br />\nvault was damp, cold, and dismal, and oozy<br />\nlittle streams trickled over the walls and<br />\nmade slush upon the floor. There was something uncanny about the whole thing, so<br />\nuncanny that the antiquary shivered, not<br />\nwith cold, but with little creepy feelings up<br />\nand down his backbone. On either side<br />\nloomed, dark and eery, a stone sarcophagus,<br />\nthe only contents of the gloomy place. The<br />\nantiquary lit his lantern and approached one.<br />\nAfter brushing away the accumulated mold<br />\nof seventeen centuries he descried some worn<br />\nletters and read in the Latin:<br />\n\"Tullia, best beloved and slave of Taelus.\"<br />\n\"Ahem,\" chuckled the old man, and he<br />\nput the different parts of the inscription<br />\ntogether and drew his conclusions. Then<br />\nhe espied beneath some smaller letters and<br />\nread:<br />\n\"The gods love surpassingly even in anger, but their anger grows through love.\"<br />\nThe antiquary suddenly recalled the<br />\npeasant legend and nervously brushed off<br />\nmore dirt. The fever of research was beginning to light up his eyes, and excitement<br />\nburned wildly in his veins Without, the<br />\nsun sank lower and gloomier shadows crept<br />\ninto the vault, but he noticed none of this.<br />\nTurning to the other sarcophagus he read:<br />\n\"Corydon, beloved of Taelus.\"<br /><br />\nTHE NEWS-LETTER.<br />\nand underneath a line from an eclogue of<br />\nVirgil, followed by another inscription:<br />\n\"Who are faithless to the gods shall feel<br />\ntheir anger.\"<br />\nThe antiquary sat down abruptly on the<br />\ndamp floor and ran his hands through his<br />\nhair in the travail of close reasoning.<br />\n\"A peasant legend; ahem; two lovers<br />\nkilled by master, jealous perhaps; of woman<br />\ncertainly; see inscription; then the man;<br />\nahem, yes;\" he paused to run through portions of the eclogue from memory. Two<br />\nJealousies perhaps. The old gentleman's affairs were a bit muddled. And then there<br />\nloomed before his mind the picture Corydon<br />\nand 'Pullin.; a stolen kiss under the soft shade<br />\nof the acacias; the sun in the west and one<br />\nlong, sweet moment compassing the very<br />\nbounds of eternity. Ah, now he saw the<br />\nsoul itself of these tall white columns, the<br />\ngrandeur and beauty, the simplicity and<br />\nsoftness.<br />\nThen across the picture strode a grim, severe man. On his face were marks of sensuality and dissipation and in his eyes<br />\ngleamed the light of cruelty, commingled<br />\nwith a certain maudlin sentimentality, the<br />\nremains of something noble. It was the<br />\npicture of the beast coming forth from the<br />\ndegenerate remains of an originally sturdy<br />\nRoman. There flashes from the brutal face<br />\na gleam of passion, then one of anger. There<br /><br />\nis a brow red, perhaps with wine, the flash<br />\nof steel, blood, and then—the mausoleum,<br />\nlast passionate expression of a master's love<br />\nand the two faithful, undutiful loiters lying<br />\nforever in the dank stone with the pale white<br />\npillars without. Now the antiquary saw it<br />\nall, but it was with a shudder.<br />\nAnd this beautiful Roman over which he<br />\nraved; ugh! It was as though the pure<br />\nbeauty of the outside were stripped off and<br />\nhere beneath lay the foul, poisonous miasma<br />\nof a mental pestilence. As he stepped towards the entrance a lizard without whisked<br />\naway into the shadow. The sun had set and<br />\nin the half darkness the marble seemed damp<br />\nand slimy. Even the beautiful capitals were<br />\ncrawly and unholy, and he shuddeded again<br />\nwith horror and disgust and shook himself<br />\nas though to shake off the impurity and bestiality. Slowly and rather sadly he walked<br />\nback to the cottage, and then turned to look<br />\nonce more at the mausoleum.<br />\nIn front he seemed to see again the tall<br />\nbeautiful pillars and the two lovers, spirits<br />\nof a far antiquity, the spirits of the nobility<br />\nof all men; and then across the porch strode<br />\nthe monster, Taelus, and all again was horrible with strange and unspeakable iniquity.<br />\n\"After all, it is nothing but the same old<br />\nlife,\" he sighed; and coldly and wearily<br />\nturned away from the ruined tomb.<br /><br />\nTHE SONG.<br />\nOthers may sing of the ocean blue,<br />\nOr the depth of the azure skies,<br />\nOf the Mediterranean's violet hue,<br />\nThe purple hills in the hazy view,<br />\nOr the blue bird bright as it flies.<br />\nBut the song I sing is a different song,<br />\nAnd one which never can be too long,<br />\n—I sing of my darling's eyes.<br /><br />\nOthers may sing of the yellow moon,<br />\nOr the sunlight's glittering glare,<br />\nOf buttercups sweet of an early June,<br />\nThe golden light of. the sun at noon,<br />\nOr the yellow daisies so fair.<br />\nBut the song I sing is a different song,<br />\nAnd one which never can be too long,<br />\nI sing of my darling's hair.<br /><br />\nOthers may sing of the murmuring brooks,<br />\nOr the light of the stars above,<br />\nOf the quiet joy in the hidden nooks,<br />\nThe stream and woods and the croaking<br />\nrooks,<br />\nOr the call of the cooing dove.<br />\nBut the song 1 sing is a different song,<br />\nAnd one which never can be tog long,<br />\nI sing of my darling love.<br />\n'06.<br /><br />\n•<br /><br />\n3<br /><br />\nTHE NEWS-LETTER.<br /><br />\n4<br />\n=<br /><br />\nTHE PLANS FOR HOMEWOOD.<br />\nPresident Remsen gave a very interesting<br />\nlecture in McCoy Hall last Friday .on the subject of the development of Homewood. He<br />\nspoke for the most part of. the laying out of<br />\nthe grounds and of the placing of the buildings, but also of the general style of architecture which was recommended by the<br />\nBoard and which will be followed out in the<br />\nerection of future buildings.<br />\nThe plan adopted was prepared by Parker<br />\nand Thomas, of Baltimore, and was chosen<br />\nfrom among the drawings of five firms of<br />\nNew York, Boston and Baltimore architects.<br />\nThe plan provides for the buildings needed<br />\nfor the immediate work of the University,<br />\nand also shows how these buildings can be<br />\nenlarged and new ones added so as to form<br />\nan harmonious part of the whole scheme.<br />\nPresident Remsen enumerated the buildings<br />\nthat will be necessary before the University<br />\ncan move to its new site. Among these he<br />\nmentioned the following:<br />\nA library; for present and future books to<br />\nnumber about 300,000 volumes.<br />\nA building containing about 20 seminary<br />\nclassrooms, for about 25 students each, arranged like large committee rooms. This<br />\nbuilding may be separate from the library,<br />\nbut conveniently connected with it, or there<br />\nmay be one building containing library and<br />\nthese seminary classrooms.<br />\n\"Levering Hall,\" Young Men's Christian<br />\nAssociation Building.<br />\nA building to contain administrative offices; president's, treasurer's and registrar's<br />\nrooms; an assembly hall to seat 1500 with a<br />\ndancing floor, and a small assembly hall to<br />\nseat about 200. The offices and assembly<br />\nhall may be separated into two buildings, if<br />\nthought desirable.<br />\nOne or two buildings to be two to four<br />\nstories in height and to contain in the aggregate 25 rooms, each seating about 40, to be<br />\nused as classrooms or lecture halls in nonlaboratory subjects.<br />\nSix buildings for laboratory purposes, each<br />\nincluding classrooms and department libraries for subjects mainly taught by laboratory<br />\nmethods, 19,006 square feet each. Two museums in connection with these, 10,000 square<br />\nfeet each. Two other museums one story<br />\nhigh, 10,000 square feet each.<br /><br />\nAuditorium for audience of about 2000,<br />\nwith stage, etc. A distinct and somewhat<br />\nmonumental building not necessarily among<br />\nthe first to be erected.<br />\nThree buildings for dormitories, three to<br />\nfive stories, 7500 square feet each.<br />\nDining establishments, with kitchen and<br />\nother domestic offices combined. Seating<br />\nand serving capacity of about 300.<br />\nA building or buildings containing provision for athletics, conveniently located for<br />\neasy access to students, and not necessarily<br />\ncombined with athletic grounds, which will<br />\nprobably be located at a more distant part<br />\nof the site.<br />\nPower-house. Provision will be made for<br />\nsupplying heat, light, etc. from this house<br />\nby underground conduits to all buildings.<br />\nPresident Remsen said he did not want<br />\nanyone to think, because the Chapel was not<br />\nnumbered among the immediate needs of the<br />\nUniversity, that not enough emphasis was<br />\nlaid on the religious side of University life.<br />\nThe Chapel is not one of the absolutely necessary buildings, because the new Levering<br />\nhail, which will be one of the first structures<br />\nto be begun at Homewood, will contain an<br />\nassembly room large enough to be used as<br />\na Chapel for the present.<br />\nIn addition to the outline of the general<br />\nplans for the grounds, Parker and Thomas<br />\nalso offered two specimen buildings with<br />\nfront and side elevations and floor plans.<br />\nThe particular buildings which they took for<br />\nillustration were a laboratory and a museum.<br />\nThe two buildings are designed in a style<br />\nwhich is an adaptation of classic ideas to<br />\nmodern needs. The probability iP that they<br />\nare intended to be constructed of marble and<br />\nthat \"cheerful red brick\" which Baedecker<br />\ndescribes as characteristically Baltimorean.<br />\nIt seems a pity that some form of Gothic<br />\narchitecture was not chosen, better suited,<br />\nperhaps, by its centuries of identification<br />\nwith Anglo-Saxon places of learning, for the<br />\nuse of a great University. The Commission,<br />\nhowever, in their tour of investigation<br />\nthrough the principal colleges of the East<br />\nand Middle West, were best pleased with the<br />\narchitecture of the Universtiy of Virginia.<br />\nThe plan there seemed to be both well suited<br />\nto its purpose and also consistently carried<br /><br />\nTHE NEWS-LETTER.<br />\nout. This visit to Virginia may have had<br />\nsome influence on their choice. Perhaps also<br />\nthe following paragraph from Dr. Remsen's<br />\nreport may throw some light on the subject:<br />\n\"My preference is decidedly for simple and<br />\ncomparatively inexpensive buildings, though<br />\nI feel very strongly that they should represent a high type of architecture. After consultation with the advisory board and Mr.<br />\nKeyser, I sent the following notice to the<br />\ncompeting architects:<br />\n\"'In regard to the style of architecture<br />\nfor the buildings of the Johns Hopkins University at Homewood, the advisory board<br />\nhereby suggests to the competing architects<br />\nthat their preference is for such buildings<br />\nas are not elaborate and expensive in general<br />\nscheme or detail, but rather for such as are<br />\nsimple and dignified, with characteristics indicative of the purpose, and as inexpensive<br />\nas may be consistent with thoroughly good<br />\nconstruction.'\"<br />\nIn regard to the cost of moving to the<br />\ncountry, President Remsen can give no definite answer, but the following statement<br />\nsounds very encouraging, and leads us to<br />\nhope that the removal may be possible at<br />\nsome time in the near future:<br />\n\"In regard to the sum required to enable<br />\nus to move to Homewood, I do not venture<br />\nhere to make any specific statement; but such<br />\ncalculations as I have been able to make .<br />\n. . convince me that the problem of<br />\nmoving is one that can be solved.\"<br /><br />\n—A hustling promoter name Coe<br />\nWas head of a big cocoa Co.<br />\nA native named Koko<br />\nSaid, \"Pay what you owe, Coe,<br />\nOr give me the Coe Cocoa Co.\"<br />\nHe had other projects, had Coe—<br />\nCoke ovens were one line, and so<br />\nThe two coalesced.<br />\nImagine the rest:<br />\n\"Coe-Koko Coke and Cocoa Co!\"<br />\n—Exchange.<br /><br />\nChauncey Depew was once asked why a<br />\ncollege man was referred to as \"college<br />\nbred.\" \"I suppose,\" he said, \"it's because<br />\nit is usually a four years' loaf.\"<br /><br />\n•<br /><br />\n6<br /><br />\nTHE JOHNS HOPKINS<br />\nCOTILLON CLUB.<br />\nA movement was recently started in the<br />\nUniversity for the purpose of arranging a<br />\nseries of dances to be given through the<br />\nyear, similar to the dances that are given<br />\nin other colleges. The movement has been<br />\nvery enthusiastically carried forward by the<br />\nwhole student body, and has resulted in the<br />\nformation of the Johns Hopkins Cotillon<br />\nClub. Membership in the Club is open to<br />\nany student of the University upon the payment of the dues; these cannot be definitely<br />\nfixed until the number of members is known,<br />\nbut they will certainly be moderate. The<br />\nClub proposes to give four dances during the<br />\nwinter and spring, the dates, as arranged at<br />\npresent, being Wednesday, November 23rd,<br />\nJanuary 6th, February 21st, and April 28th;<br />\nthus the dances will be so distributed that<br />\none will occur at Thanksgiving, one during<br />\nthe Christmas holidays, one at Washington's<br />\nBirthday, and one at Easter.<br />\nThe University has permitted the Club to<br />\nhold the dances in McCoy Hall, on condition<br />\nthat they shall close at twelve. On account<br />\nof the short space of time allowed for the<br />\naffair, dancing will have to start promptly<br />\nat quarter to nine so as to get through in<br />\ntime. There will be twenty dances, with<br />\nan interval of \"twenty minutes for refreshments\" after the tenth dance. Mr. Griswold, of the Musical Clubs, has chosen the<br />\nmusic, so that it will undoubtedly be very<br />\ngood.<br />\nThe Governors of the Johns Hopkins Cotillon Club are the following: Maurice Miller, '05, President; Thomas Owings, '05,<br />\nTreasurer; Robertson Griswold, '05, W. H.<br />\nHudgins, '05, T. R. Chambers, '05, T. P. Maynard, '05, N. P. Pitcher, '05, Carlyle Barton,<br />\n'06, Leonard Sioussat, '06, Henry Hynson,<br />\n'07, and Iredell Iglehart, '07.<br />\nThe Humpt-up Monkey<br />\nSat in a tree.<br />\nHe fell by Darwinian Theory;<br />\nAnd all the King's asses,<br />\nAnd some so-called men,<br />\nAre trying to change<br />\nTo the monkey again.<br />\n—Vale Record.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n6<br /><br />\nEbe lflewsaietter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br /><br />\nNOVEMBER 18, 1904.<br /><br />\n10 Cents a single copy.<br /><br />\nSubscription $1.50 per year.<br /><br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors<br /><br />\nTHOMAS OWINGS, 1905.<br />\nORMOND W. HAMMOND, 1906.<br />\nH. FINDLAY FRENCH, 1906.<br />\nTHOMAS G. MACHEN, 1906.<br /><br />\nW. R. STRAVORN,<br />\n{ E. LELAND SHACKELFORD,<br />\nG. Wourzuzcx,<br />\nBusiness Manager,<br />\nCARLY LIC BARTON,<br />\nAssistant Business Manager<br /><br />\nAthletic Editors,<br /><br />\n1905.<br />\n1906.<br />\n1905.<br />\n1906<br /><br />\nAddress all articles, communications, etc., to THOMAS<br />\nOWINGH, box 467, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br /><br />\nG. WOLTERECK, box 677, J. H. U.<br /><br />\nEDITORIAL.<br />\nDuring the last two or three years the<br />\nNEWS-LErniR has often heard the question,<br />\noften impatiently asked, why does not the<br />\nUniversity build an athletic field at Homewood? It was argued that even if the plans<br />\nhad not yet been definitely settled, it would<br />\nbe perfectly possible to level off a temporary<br />\nathletic field, which could be moved later<br />\non if the site were needed for buildings. The<br />\nUniversity authorities, however, preferred to<br />\nwait, and then build a permannet athletic<br />\nfield on the site provided for in the plans<br />\nadopted by the Trustees. Now that these<br />\nplans have been decided on, the athletic<br />\nfield is a thing of the immediate future, and<br />\nwill probably be begun very shortly. There<br />\nis a sum amounting to something over $2000<br />\navailable for the work. The one difficulty<br />\nin the case is the distance of the site chosen<br />\nfor the field from the city, and the fact that<br />\nno car line passes anywhere near it. The<br />\nnearest cars are at St. Paul and Thirtyfirst Sts., several squares away. Of course,<br />\nit would be very hard to get any large crowd<br />\nof spectators out to a field so difficult of<br />\naccess, and until the cars are brought nearer,<br />\ngames at such a field could hardly be great<br />\nfinancial successes. People nowadays are<br />\nnot willing to put up with such inconveniences in pursuit of pleasure as they -were<br /><br />\nin the days described in Dr. Renouf's article<br />\nin our last issue, when crowds arrived at<br />\nClifton after a weary ride in the horse-cars,<br />\nfollowed by a walk or 'bus ride to the field.<br />\nHappily, therefore, the problem of how to<br />\nget people out to the Homewood grounds<br />\nhas been nearly settled. A motion is now<br />\nin its third reading in the City Council to<br />\nchange the route of the St. Paul St. cars so<br />\nthat they will run out St. Paul Street (extended), to Merryman's Lane, and thence<br />\nacross to Roland Park. This would make<br />\nthe tracks pass by the proposed entrance<br />\nto the field on Merryman's Lane. It is expected that the permit for this change in<br />\nthe route of the cars will soon be issued, and<br />\nas soon as it is definitely settled, work on<br />\nthe field at Homewood will begin. It is to<br />\nbe hoped that the first leveling and sodding<br />\nof the ground can be begun this fall, so that<br />\nthe new field will be in condition for lacrosse<br />\nnext spring.<br />\nThe first feed of the Hullabaloo Club was<br />\nheld on Friday, November 4th. Although<br />\neveryone who attended had a very good<br />\ntime, the evening was not such a success<br />\nas had been anticipated, owing largely to<br />\nthe absence of nearly half the Senior class<br />\neither on business, or pleasure, or perhaps<br />\nboth. Whatever the reason, the fact remains that the class did not crowd the rooms<br />\nof the Hopkins Club in such numbers as to<br />\nseriously discomfort anybody. The members<br />\nof the committee who made arrangements<br />\nfor the use of the rooms for the feed, were<br />\na little doubtful whether the quarters that<br />\nwere assigned us would be large enough to<br />\ncontain the class; but as it turned out, things<br />\nwould probably have been lonesome if the<br />\nrooms had been any larger. Another thing<br />\nthat detracted from the complete success of<br />\nthe \"feed\" was the early hour at which it<br />\nstopped. This is, perhaps, directly traceable<br />\nto the smallness of the number present. The<br />\nNtWS-LETTF,R does not know a great deal<br />\nabout the feed before half-past ten. According to our ideas no well-regulated feed<br />\nshould ever stop before midnight, at the very<br />\nleast. This feed, however, was otherwise.<br />\nWhatever may have happened before half..<br />\npast ten (and we know of a couple of interesting and heretofore unheard of occurrences), certainly nothing occurred after-<br /><br />\nTHE NEWS-LETTER.<br />\nward. Except for a few congenial souls<br />\nthat still basked in the proximity of the<br />\ncopious keg, everyone had adjourned to another room, where some read magazines and<br />\nothers—we hesitate to reveal it—played<br />\nchess! Let us draw the curtain on the<br />\nsolemn scene.<br />\nThe next feed will take place some time<br />\nin the latter part of this month; it is to be<br />\nhoped that the attendance will be larger than<br />\nthe last one. A very true proverb is that<br />\nwhich declares: \"The more the merrier!\"<br />\nand it is especially applicable to \"feeds.\"<br /><br />\n7<br /><br />\nmagazines. Three things govern the selection: literary merit of contributions, excellence of departments, and neatness in appearance. Following ia the list arranged alphabetically:<br />\nColumbia Literary Monthly....Columbia<br />\nUniversity<br />\nCollege<br />\nDartmouth<br />\n.<br />\nMagazine<br />\nDartmouth<br />\nGeorgetown<br />\n.<br />\nJournal.<br />\nCollege<br />\nGeorgetown<br />\nUniversity<br />\nUniversity<br />\nHarvard<br />\nMonthly<br />\nHarvard<br />\n.Princeton<br />\nMonthly.<br />\nLiterary<br />\nThe Nassau<br />\nUniversity<br />\nof<br />\nUniversity<br />\nBlue<br />\nThe Red and<br />\nPennsylvania<br />\nThe Santa Clara Redwood...Santa Clara<br />\nCollege<br />\nCollege<br />\nLafayette<br />\nTouchstone<br />\nThe<br />\nCalifornia<br />\nof<br />\n.University<br />\nMagazine.<br />\nIT. of Cal.<br />\nU. of North Carolina Magazine..University of N. C.<br /><br />\nThrough the generosity of Joseph Pulitzer,<br />\nColumbia University now possesses an endowed School of Journalism, the first of its<br />\nkind to be connected with any university.<br />\nThe Columbia Literary Monthly, commenting<br />\neditorially upon the gift, says in part:<br />\nIn making the gift, Mr. Pulitzer believed<br />\nthat journalism should be ranked as a proSYNOPSIS OF WAR NEWS.<br />\nfession, just as much as law, medicine, engineering, architecture and learning, and that<br />\n[By cable to the NEWS-LETTER, from our<br />\nthere should be established a well-equipped special correspondents in Manchuria].<br />\nprofessional school that would place the<br />\nGeneral Kuropatkin is preparing to resume<br />\nSchool of Journalism \"upon a level with his advance on St. Petersburg.<br />\nothers in supplying a definite educational<br />\nFor the 711th time Port Arthur has fallen.<br />\ncourse for students, and in affording the It fell 239 times last week.<br />\nnewspapers an opportunity to recruit their<br />\nThe Baltic fleet mistook the continent of<br />\nstaffs from men adequately prepared for the Africa for a Japanese torpedo-boat and<br />\nduties of that service.\"<br />\ncaused some injury to the Great Sahara<br />\nIn the new school, the university will Desert.<br />\naim to give both the theoretical and the pracGeneral Kumcutyourwhiskersoff has trans<br />\ntical side of journalism; to make a man pro- ferred his headquarters from Ohgotoh-ellski<br />\nficient and thorough in his methods.<br />\nto Ureanotherovitch.<br />\nWhat is wanted in our newspapers of toThe Tsarevitch, it is said, is about to asday is less quantity and better quality, and sume the chief command in Manchuria.<br />\nIf the men who are to write for the press<br />\nin a few years could be guided by a thorough<br />\nCUT OUT FOR THE JOB.<br />\ncourse in the fundamental principles that<br />\nMy Papa is a carver,<br />\nunderlie journalism a better class of newsThe bestest in the land;<br />\npapers would undoubtedly supplant the senAnd so he's often called upon,<br />\nsational, prejudiced journals of the present<br />\nTo lend the helping hand.<br />\nday.<br />\nThe University of Chicago will adopt the<br />\nOxford system of having the different departments of the college entirely distinct.<br />\nThe change will involve an expenditure of<br />\nfrom $2,000,000 to $3,000,000 in new buildings.<br />\nThe University of Virginia Magazine<br />\nmakes a classification of the ten best college<br /><br />\nTHE RHETORIC CLUB<br />\nThere's just one class in College,<br />\nWhich blends in mighty well;<br />\nThinks its instructor learned,<br />\nAnd even pretty swell.<br />\nThe reason isn't hidden,<br />\nMay easily be seen:<br />\nThe Freshmen are but children,<br />\nThe Prof. is also Green.<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nCAN WE WIN.<br />\nHAT are the chances of Hopkins<br />\nwinning the Lacrosse Championship next spring? This is the question which has greeted me on all sides ever<br />\nsince my return to the city after my summer<br />\nvacation. When this article appears in the<br />\nNEWS-LETTER, it will be but a short while before the end of the football season; and the<br />\nstudent body will be ready to hear the above<br />\nquestion answered by cold facts.<br />\nOf last year's team we have exactly five<br />\nmen left. These are Dill, Blanck, Strobar,<br />\nMeyer and Morse. It is true that Pearre is<br />\nstill with us, but when the match games begin he will have completed his course at the<br />\nUniversity. Hence, as a nucleus, around<br />\nwhich we are compelled to build up a winning team, we have two attack and three defense men. Of course, we have our faithful<br />\nscrub of last year, but, I may safely say, that<br />\nat present there is no man among them with<br />\nequal ability to any man we lost last spring.<br />\nI am not putting it too strong when I say<br />\nthat Hopkins has a larger gap to fill in her<br />\nline-up this year, than she has for many years<br />\npast. We have lost the best midfield combination which has ever represented the<br />\nblack and blue on the lacrosse field. Neither<br />\nmust we forget Putts, who has held down<br />\nin-home for four successive years. He, with<br />\nStrobar, Rosenheim, Dill, Bird and Mathai<br />\nmay be considered although not the strongest the fastest attack Hopkins has ever had.<br />\nOn the defense we have not lost so many<br />\nmen; nevertheless the three positions that<br />\nare open are the most difficult to fill. The<br />\ngame played by ex-captain Tough at third<br />\ndefense will not be equalled for some time.<br />\nPearre at first defense and Erlanger at goal<br />\nwere very steady players.<br /><br />\nW<br /><br />\nIn contrast to our loss it may be interesting to know that our strongest opponent,<br />\nSwarthmore, has no less than ten men of<br />\nlast year's team back. To fill one of the two<br />\nopen positions she has a man who is better<br />\nthan many of her last year's regulars. He<br />\ndid not play against us because of an injury<br />\nreceived in practice.<br />\nCan Hopkins beat this team of veterans,<br />\nand how? The first part of this question<br />\nhas but one answer. \"We must beat them,<br />\nor give up our title of the best Lacrosse College in the United• States.\" The answer to<br />\n\"how\" is that the coaches must get together,<br />\nand with the assistance of the student body,<br />\nas material, hammer together a team which<br />\nwill out-play and if possible, out-weigh<br />\nSwarthmore.<br />\nThere are two fundamental facts which, all<br />\nthe coaches agree, were the cause of our defeat last spring. In the year 1901; almost in<br />\n1903; and in 1904 Swarthmore defeated us<br />\nbecause she out-ran and out-weighed us.<br />\nTo fill the seven open places on our team,<br />\nwe must have men. In answer to the students who hold back on the excuse that they<br />\nhave never had a stick in their hands before,<br />\nwe may say, neither did any of us before we<br />\nentered the Freshman class. To those who<br />\ngive us the response \"I have never done anything in athletics,\" we in turn reply, neither<br />\nhad many of our best players before they<br />\ntook up lacrosse. Others when approached<br />\non the subject seem to be disinclined to come<br />\nout because they think that the places are<br />\npractically filled by men who have made a<br />\nnewspaper reputation at the prep. schools.<br />\nBy way of information for this class of men<br />\nI may add, that not one man out of twenty<br />\nprep-school athletes ever makes good at col-<br /><br />\nTHE NEWS-LETTER.<br /><br />\n9<br /><br />\nstrength, both defensively and offensively.<br />\nOnly twice during the entire game did Mount<br />\nWashington make the allotted five yards on<br />\nthe first down, and nearly every five yards<br />\nthat was ganied was obtained only after<br />\nthree plunges, and then not a large margin<br />\n.was left. The ends, which up to this game<br />\nhad showed up weak, took a decided brace,<br />\nand only two end runs were succesfully<br />\nmade, due to splendid interference. On the<br />\ndefense Kellam, Kelley and Higgins did great<br />\nwork for the line, while Crothers and Preble<br />\nexcelled on the offense. Several times<br />\nCrothers broke through guard and captured<br />\nthe runner, once for a loss of ten yards.<br />\nPreble also held Matthews back for a loss.<br />\nThe greatest surprise of the day, however,<br />\nwas when the Hopkins backs repeatedly<br />\nplunged through the club lines for gains of<br />\nfive and eight yards. Benton, who played<br />\nfullback, made his initial appearance at that<br />\nposition, and made tremendous gains. PreWM. C. SCHMEISSF,R.<br />\nviously he had been playing right tackle,<br />\nand it was only Friday night that he went<br />\ninto practice at the new position, when McHOPKINS, 6; MT. WASHINGTON, 0. Donnell, the -regular full, was called away<br />\nIn one of the most exciting and hotly con- on important business. He made the only<br />\ntested games of football seen on the local touchdown of the game. The two halfbacks<br />\ngridiron this season Johns Hopkins Univer- for Hopkins, Betts and Boyd, although<br />\nsity defeated the strong Mount Washington weighing only 138 and 139 pounds, respecclub on the grounds of the latter, November tively, played a thoroughly scientific game.<br />\n12, by the score of 6 to 0. The outcome of Betts made just ten successful dives after<br />\nthe game was totally unexpected by the 'var- Matthews, Reinhardt and Griffin, and in<br />\nsity adherents. Probably it was due to the several instances these men were thrown<br />\nfact that the 'varsity eleven knew that they back by him for big losses. During the enhad in the club men opponents who had tire contest not a single successful play was<br />\nbeen playing the strongest kind of a game made around his side. Several beautiful end<br />\nthis season that they pulled together as a runs were also made by the little right halfteam and played as they never played before. back. \"Mony\"Boyd also put up a brilliant<br />\nFrom the very start the 'varsity set such game at left halfback. He, too, never failed<br />\na terrific pace that the club men did not on a tackle, and his end runs were spectacsucceed in holding them for downs until ular.<br />\nwithin the 30-yard line. The Hopkins men<br />\nProbably the prettiest play of the entire<br />\nplayed with more dash than usual, and the game was the thirty-five yard run made by<br />\nfear was expressed that they could not hold \"Sandy\" Randall, Hopkins' star quarterout, but they did, and it was this fact that back. It was near the middle of the second<br />\nmade the game certain. In almost every half when Hopkins had the ball in the centre<br />\nstage of the game the collegians, although of the field. Randall tried a quarterback<br />\nconsiderably outweighed in the back field, run, and, aided by beautiful interference on<br />\nout-pointed their opponents. The backs of the part of Benton, Boyd and Betts, successthe club were strong and swift, but Hopkins' fully cleared the scrimmage.<br />\nbacks were swifter, and almost before the<br />\nChandlee, of Mount Washingotn, was layclub interference was formed either Betts or ing back, but Randall could have escaped<br />\nBoyd had nailed the runner.<br />\nhim had he not mistook Pearre, who was<br />\nThe Hopkins line developed unexpected running immediately behind him, endeavor-<br /><br />\nlege. It is true that we have some of these<br />\nplayers with us; but none of them have as<br />\nyet cinched a place on the team.<br />\nIn conclusion let me say, that whosoever<br />\nyou may be, come out and try for the team.<br />\nWe need you; if you are a large man we<br />\nneed you that much more. If you are a<br />\ntrack-man you will be in your element. The<br />\nmajority of our best players have won their<br />\nfirsts on the track team. Fitzgerald, Abercrombie, McInnes, Wilson, Bruton, Tyler,<br />\nBlanck and many others have won honors in<br />\nboth sports. The Freshman class is large,<br />\nand I know that there are many Juniors who<br />\nare sorry that they did not take up the game<br />\nlast year. From these two classes we must<br />\nget the men who will win the championships<br />\nof the future. Can Hopknis win the Lacrosse<br />\nChampionship next spring? \"Yes, provided<br />\nthat each student will do his share of the<br />\nwork.\"<br /><br />\n•<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br />\n_<br /><br />\ning to pass to form interference, for a Mount<br />\nWashington player and run into the arms of<br />\nof Chandlee. He was downed on the sixteen<br />\nyard line. Then three line plunges and Benton carried the ball over for a touchdown<br />\namid the deafening cheers of the Hopkins<br />\nrooters. Randall kicked goal. It was in<br />\nthe last plunge that Randall displayed his<br />\nsteadiness. Ile dropped the ball on a pass<br />\ntrom centre, and although several Mount<br />\nWashington players dived for it, he picked<br />\nit up and coolly handed it to Benton.<br />\nIn the first half Hopkins came near scoring, but lost the ball by a fumble on the<br />\nfifteen-yard line. The game was called about<br />\nthree minutes before the end of the second<br />\nhalf on account of darkness, and Hopkins<br />\nthen had the ball on Mount Washington's<br />\nfifteen-yard line.<br />\nThe line-up:<br />\nHopkins—Pearre (captain), r. e.; Higgins and<br />\n131auck, r. t.; Kellam, r. g.; Preble, c.; Crothers, 1.<br />\ng.; Kelley, I. t.; Boyce, 1. e.; Randall, q. b.; Benton,<br />\nf.b.; Betts, r. h. b.; Boyd, 1. h. b.<br />\nMount Washington—Williams, r. e.; Robinson, r.<br />\nt.; Ridgely, r. g.; Gordan and Griffith, c.; Cogswell,<br />\n1. g.; Rider, I. t.; Marye and Nine, 1. e.; Chandlee,<br />\nq. b.; Matthews, r. h. b.; Griffin, f. b.; Reinhardt<br />\nand Marye, 1. h. b.<br />\nEteferee—Dr. Bray, of Lafayette College. Umpire<br />\n—Mr. Randall, of M. A. C. Timers—Messrs. Dill<br />\nand Gill. Linesmen—Messrs. Mealy and Hudgins.<br />\nTime of halves—Twenty minutes.<br /><br />\npass by our centre, and by clever end-runs<br />\nWashington brought the pig-skin down to<br />\nour 30-yard line. They got no further, however, and were forced to give up the ball.<br />\nWe then worked up to within 15 yards of<br />\na touchdown, but the calling of time prevented our securing it.<br />\nThe second half opened with a pretty kickoff by Randall to Bielaski, of Washington,<br />\nwho, supported by splendid interference,<br />\nmade repeated gains around our right end.<br />\nAt our 30-yard line Washington fumbled,<br />\nand Betts and McDonnell mercilessly revenged themselves on Washington's line.<br />\nOur opponents braced up and held us for<br />\ndowns on their 30-yard line, but were unable<br />\nto follow up their advantage. They punted<br />\nand Randall caught the ball. The teams<br />\nwere again lined up on Washington's 30yard mark, when time was called.<br />\nRandall, Betts and McDonnell starred for<br />\nHopkins, while Stienerson and Bielaski played best for Washington. The line up was<br />\nas follows:<br />\nHopkins.<br />\nBoyce<br />\nKelly<br />\nCrothers<br />\nPreble<br />\nKellam<br />\nBenton<br />\nPearre (Capt.)<br />\nRandall<br />\nBoyd<br />\nBetts<br />\nMcDonnell<br /><br />\nPositions.<br />\nG. Washington.<br />\nLeft end<br />\nVanvliet<br />\nLeft tackle<br />\nLaw<br />\nLeft guard<br />\nPerry<br />\nCenter<br />\nWoods<br />\nRight guard<br />\nKilgore<br />\nRight tackle<br />\nMorris<br />\nRight end<br />\nW West<br />\nQuarterback<br />\nStienerson<br />\nLeft half back....Bielaski (capt.)<br />\nRight halfback<br />\nStevenson<br />\nFullback<br />\nF West<br />\nReferee—Bray, Lafayette. Umpire—Kelly, Geo.<br />\nWashington. Linesmen—Sutton, George Washington; Hill, Johns Hopkins University. Timekeepers<br />\n—Collins, George Washington, and Dill, Johns Hopkins University. Length of Halves-25 minutes.<br /><br />\nHopkins football team showed its mettle<br />\non Saturday, Nov. 5, when it played George<br />\nWashington University, of Washington, D.<br />\nC., with the score of 0-0. The game was<br />\nexciting and clean from start to finish, and<br />\nthe rivalry was voiced by the rooters of both<br />\nUniversities. The day, though cloudy, was<br />\nan admirable one for the game, as it was<br />\njust cool enough to keep the men moving.<br />\nWith whiskers thick upon my face<br />\nThough our back-field was weakened by the<br />\n.1 went my fair to see;<br />\nabsence of Blanck, whose knee was injured<br />\nShe told me she could never love<br />\nin the game with Western Maryland, and of<br />\nA bear-faced chap like me.<br />\nCampbell, their places were ably filled by<br />\nBetts and Boyd.<br />\nI then shaved clean, and called again,<br />\nThe kick-off was won by the visitors, and<br />\nAnd thought my troubles o'er;<br />\nRandall cleverly caught the ball at our 25She laughed outright, and said I was<br />\nyard line. In an incredibly short time we<br />\nMore bare-faced than before.<br />\nploughed our way down to Washingtons'<br />\nA. C. M.<br />\n40-yard line, but lost the ball on a fumble.<br />\nOur opponents then forced the centre of battle back to our 5-yard line. Here Hopkins He wrote a letter to his love,<br />\nAnd filled it full of warm and keen desire;<br />\nheld them for downs and Betts, Boyd and<br />\nHe hoped to raise a flame, and so he did:<br />\nWorthington alternately hammered the visThe lady put his nonsense in the fire.<br />\nitors ,until again their goal was neared. We<br />\nfumble,<br />\nball<br />\non<br />\npoor<br />\nowing<br />\na<br />\nto a<br />\nlost the<br />\nA. C. M.<br /><br />\nTHE NEWS-LETTER.<br />\nTHE GRADUATE DEPARTMENT.<br />\nEconomic Jottings—The Economic Seminary is still investigating the structure and<br />\nfunctions of trade unions. A second edition<br />\nof the \"Trial Bibliography of Trade Union<br />\nPublications\" will probably appear some<br />\nAnother manifestime during the year.<br />\ntation of the department's co-operative<br />\nactivity, there are rumors of a collective publication. This publication, it appears, will<br />\nconsist of a series of essays on special phases<br />\nof trade unionism as exemplified in the history of a particular union.<br />\nWith the addition of a Swede, Mr. Gosta<br />\nA. Bagge, and a student front the far away<br />\nisland of Japan, Mr. Z. Watanahe, the Economic Seminary this year takes on quite a<br />\ncosmopolitan air.<br />\nLuther M. R. Wills, who took his bachelor's degree last June, is back at the University studying economics and politics in addition to his course in law at the University of<br />\nMaryland. He is also working at the thesis<br />\n\"The Legal Aspects of Trade Unionism.\"<br />\nOriental Department—About a dozen students have come over from the Medical<br />\nSchool to attend a series of lectures upon the<br />\nliterature of the Bible, based on the authorized version.<br />\nIn the History Department—Things have<br />\nopened auspiciously with the addition of a<br />\nnew member to the teaching staff and several<br />\nnew students. The new students are S. Lynch<br />\nWare, A: B., Oxford, 1895, L. L. B. Columbia<br />\nUniversity; D. S. Freeman, B. F. Wilson and<br />\nL. G. Corkran.<br />\nDr. Vincent has, heretofore, kept the department well in touch with the spirit of<br />\nGerman historical method. But under Dr.<br />\nKeutgen, of Jena, more intimate study than<br />\nhas hitherto been possible, will be given to<br />\ncertain sciences, auxiliary to historical research, particularly Diplomatics and Paleography. Already the men are beginning to<br />\n-pore over dry and dusty Latin diplomas.<br />\nDepartment of Political Science—Dr. Willoughby is giving this year a course of lectures on the \"Legal Aspects of Economic<br />\nProblems.\" Many interesting topics will be<br />\ndiscussed, such as the interstate commerce<br />\nlaws, employers' liability, the incorporation<br />\nof trade unions. Dr. Willoughby will also<br />\ncontinue to lecture on the \"History of Political Philosophy.\" In the seminary, particular<br />\nphases of international law will be taken up.<br /><br />\n11<br /><br />\nALUMNI NOTES.<br />\n'03 Alan Haughton has a position as professor in the Peabody Preparatory School.<br />\n'98 Edgeworth Smith has left the University, where he was studying in the Graduate<br />\nDepartment, and is devoting his time to the<br />\nstudy of music.<br />\n'01 Fishack has managed the recent campaign of Robert Garrett, for Congress.<br />\n'04 Jesse Bennett has accepted a position<br />\nin a broker's office in New York City.<br />\n'00 T. Noel De L. Purcell has returned to<br />\nthe University, and is taking courses connected with the Romance Department.<br /><br />\nAT THE MEDICAL SCHOOL.<br />\nThe Johns Hopkins Hospital Historical<br />\nClub held an interesting session last Monday<br />\nnight in the Medical Amphitheatre, The<br />\nprogram was as follows:-1. A Manuscript Copy of a Work by John<br />\nCrawford on Tropical Diseases, written between 1794 and 1796—Dr. E. F. Cordell.<br />\n2. Recent Works on the History of Medicine—Dr. William Osier.<br />\n3. History of Guy's House, London—Dr.<br />\nMcCrae.<br />\nSoon after Dr. Osler's intention to accept<br />\nthe professorship in Oxford had been announced, some of his closest friends in the<br />\nMedical School met to discuss plans for<br />\nerecting a memorial building to the great<br />\nphysician. The first meeting of the committee was at the home of the Medical and<br />\nChirurgical Faculty on Hamilton Terrace. A<br />\nsecond committee was appointed to consult<br />\nwith the first.<br />\nSeveral plans have been discussed by the<br />\ncommittees. One idea was to buy Dr. Osler's present home on Franklin Street. Another was to erect a building to be added to<br />\nthe present group of buildings of the Medical School; but this was rejected, as being<br />\ntoo local an idea for a memorial to a man of<br />\nworld-wide reputation. Still another plan<br />\nwas to use the building for the library of<br />\nthe Medical and Chirurgical Faculty, for<br />\nwhich appropriations had been asked from<br />\nthe Legislature to use for a building. This<br />\nwas considered a good idea, as Dr. Osier<br />\nhas for years been identified with this library.<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br /><br />\nNOTES FROM OTHER COLLEGES.<br />\n[From the Princeton Alumni Weekly].<br />\nA new verse for \"Ramble.\"<br />\n\"The Tiger plays at football<br />\nWith vigor, force and vim,<br />\nAnd in the game of baseball<br />\nOld Yale is pie for him.<br />\nThe famous Eli bulldog<br />\nWill soon be in the soup,<br />\nAgain we'll see the Tiger<br />\nMake the bulldog loop the loop.\"<br />\nAlthough this verse failed to have the desired effect, that of making \" the bulldog<br />\nloop tile loop,\" yet Princeton will soon attack Yale on another flank. She has chosen<br />\nthe negative of the following question for<br />\nthe annual debate with Yale, to be held at<br />\nNew Haven on December 9th: Resolved,<br />\nThat it should be the policy of the United<br />\nStates not to hold territory permanently unless with the purpose that it should ultimately enjoy statehood. In the final trials last<br />\nweek the following provisional team was<br />\nchosen: J. L. Semple '05, N. M. Thomas '05,<br />\nThe Spencer Trask<br />\nW. S. Davison '06.<br />\nPrize of $50, awarded annually in these trials<br />\nto the man who delivers the best debate,<br />\nexclusive of those who have won it in former<br />\nyears, was awarded to J. L. Semple.<br /><br />\nActive work has been started in the organization of clubs to represent not only<br />\nevery county in Pennsylvania and every<br />\nState in the Union, but every country<br />\nthroughout the world from which students<br />\nhave come to Pennsylvania. When the task<br />\nis completed there should be fully 200 clubs<br />\nin the university.<br /><br />\nSeveral prominent members of the upper<br />\nclasses at Minnesota University have organied a novel club. The club will be called<br />\nthe Red Stripe.<br />\nThe object and purpose of the members<br />\nwill be to see all the football games played<br />\nby Minnesota outside of Minneapolis, and<br />\nby so doing not pay car fare.<br />\nThey will beat their way to the points<br />\nwhere the games are held and, if possible,<br />\ngain free admission to the grounds.<br />\nOfficers were elected, and the director of<br />\nroutes instructed the members of the club<br />\nto assemble the day before the Northwestern<br />\ngame.<br /><br />\nLast year, Michigan had representatives<br />\nfrom every state but Delaware arid South<br />\nCarolina, from every territory except Alaska,<br />\nfrom all new possessions—Hawaii, Porto<br />\nRico and the Philippines—and from the following states and provinces: Germany, Holland, Turkey, Arabia, Bulgaria, Japan, Mexico, Columbia, Cuba, England, Jamaica, Ontario, Quebec, Nova Scotia.—The Michigan<br />\nDaily.<br /><br />\nFourteen colleges in the United States now<br />\npublish daily papers. In all other countries<br />\ncollege journalism is practically unknown.<br /><br />\nYale University's education mission in<br />\nChina has received 517,000 from the British<br />\nGovernment, which will probably be used<br />\nto erect a memorial building to Yale's first<br />\nmissionary, Rev. John Lawrence Thurston.<br /><br />\n\"A WTJ<br /><br />\nn..-,.)Da.<br /><br />\nuWLErEsTABL:camaparr\"<br /><br />\nikt'•<br /><br />\n°<br /><br />\nTo Our, fACILITIES FOL, TAIZOB-ING<br /><br />\n(<br /><br />\n,<br /><br />\n'4?„<br /><br />\nii‘1311?I)/vsi<br /><br />\nW8 ffve Polite Salesmen.<br />\nWe Have Expert Cutters.<br />\nWe Have a Large Assortment of Materials.<br /><br />\n421<br /><br />\nN. 1-10Ar/A1.2D<br /><br />\nt.<br /><br />\n2<br /><br />\nAT POPULAR PRICES,<br /><br />\nFhc<br /><br />\noesi(ikwc.['lade at $1.00 Per<br /><br />\nMENU AND BANQUET CARDS.<br /><br />\nD01/SL 1\\1<br /><br />\nBaltimore, Md.<br /><br />\nSTATIONER AND ENGRAVER,<br /><br />\n220 NORTH CHARLES MINT,<br /><br />\n......1141•116W8.1.1MOISIIMINVINOINIMNIL<br /><br />\nIE,<br /><br />\nr.1 14 NUNN. 1. elite with Cu• I In<br /><br />\nPrices,<br /><br />\nCOLLEGE AND CLASS STATIONERY,<br /><br />\neyforth &amp; Sons,<br />\n...Tailors...<br />\n217-219 North NCO Street,<br /><br />\nPoor.s totiow rronklin .!tihmt.<br /><br />\nrtc. at Popuior<br /><br />\n.ShIrts, Nedtwe,ar,<br /><br />\ndik<br /><br />\nN UNN &amp; CON 1)ANY,<br />\nBOOKSELLERS AND STATIONERS-<br /><br />\nseeigia leak IOW'rag\"•aillak ',WOK siiarrok. Nagich,<br /><br />\n'NSW WINK mask<br /><br />\nLI AMI-VI,<br /><br />\nToilor<br />\nIf you like<br />\nFiler('<br /><br />\n110lhillti<br /><br />\nlo a 1_1-.MMI1V<br />\noc (01W:cwt.<br /><br />\nIke or c4itiai<br />\n1.4)1.<br /><br />\nto wear your<br />\ngloves long, wear<br /><br />\nI ['AWL:VI -<br /><br />\n.<br /><br />\nFownes Gloves<br /><br />\n19 W. .s/1PA 1-0(<br /><br />\nI<br /><br />\nwok<br /><br />\nlassa,,assok<br /><br />\nrsois, yolk Nola low<br /><br />\n01.0.40.00.0101..0.00<br />\n,<br />\n.1•00.00.<br /><br />\nThey wear longer.<br /><br />\nBOOKBINDING<br />\nWe Bind Tastefully.<br /><br />\nBooks, Phamplets, Music, Etc.<br />\nSpecimens Submitted with Pleasure.<br /><br />\nRUZICK7N,<br />\n609 N. EUTAW ST.,<br />\nTelephone, Mt, Vernon 3022.<br />\n001.0100110001.1010.001010<br />\n•<br />\n0100<br />\n.<br />\n00100.<br /><br />\nSISCO HOS<br /><br />\nms to -11<br />\n&gt;&gt; r<br /><br />\n18 West<br />\nLexington SI.<br /><br />\nZ&gt;<br />\nZ<br /><br />\nJohn S. Kerr<br />\nW. Parris Rolph<br /><br />\nC. &amp; P. Phone<br /><br />\nJAMES CLARK, President.<br /><br />\nKERR &amp; ROLPH<br />\nilepramt,ng Arthur Johnson &amp; Co..<br />\nNew York City.<br /><br />\n11<br /><br />\nlovers awl Jilecollics liatiollai<br /><br />\nSpo!tIng Goods<br />\nand<br /><br />\nAthletic -upplies<br /><br />\nBALTIMORE, MO. \"<br /><br />\n301 PARK AVENUE,<br /><br />\nBALTIMORE. MD.<br /><br />\nLAW<br /><br />\nPAUL A. SEEGER, Vice-President.<br />\nCHARLES S. MILLER.Cashier.<br />\nEDWIN P. HAYDEN, Ass't Casb.<br /><br />\nLECTURES_<br />\nBetween 6 and 9 P. M.<br />\n. . at the .<br /><br />\nnot.<br /><br />\nCapital, - —•------ $300,000.00<br />\nSurplus and undivided profits, $495,000.00<br />\nBoxes Rented.<br />\nSafe Deposit Vaults.<br />\nCareful Attention to the interests of Depositors.<br />\nWe Invite You to Open an Account with Us.<br />\n•••••0••••44004.4144*********4***••••1<br /><br />\nBaltimore University,<br /><br />\nAddress .J. V. KELLY, Sec.-Treas.<br />\n840 North OharIes Street,<br /><br />\nBaltimore. Md.<br /><br />\nFOR ADVERTISING RATES<br />\nIN THIS PAPER,<br /><br />\n.<br /><br />\n••••••••••••••••••••••••••••••••••••••<br /><br />\n0<br />\n•<br />\n•<br />\n•<br />\n.<br />\n.<br />\n•<br />\n: WIINTED :0<br />\n•<br />\n•<br /><br />\n••<br />\n•<br />\n—ALUMNI TO INSERT THEIR BUSI.<br />\n•<br />\n•<br />\nNESS AND PROFESSIONAL CARDS<br />\n•<br />\n•<br />\n•<br />\n•<br /><br />\nIN THE NEWS-LETTER.<br /><br />\nADDRESS<br /><br />\n0<br /><br />\n•<br />\n*<br />\n•<br />\nft<br />\nto<br /><br />\nTHE<br />\nNEWS-LETTER,<br />\njohns Hopkins University,<br /><br />\nV<br />\n*<br /><br />\ne<br />\n•<br />\n•<br />\n•<br />\n•<br />\n0<br />\n•<br />\n0<br />\n••••••••••••••••••••••••••••••••••••••<br /><br />\nBALTIMORE.<br /><br />"}], "field_media_file": [{"target_id": 36279, "display": null, "description": null, "target_type": "file", "target_uuid": "80e1ae15-38d1-476e-a06b-e26448c2d781", "url": "http://digital.library.jhu.edu/system/files/2022-03/12254-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12254, "target_type": "node", "target_uuid": "dd7862f3-debe-48f0-822f-9d29f881080d", "url": "/node/12254"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "deaeeaff-a200-4a2c-9618-632279ae17c7"}]}