{"mid": [{"value": 36729}], "uuid": [{"value": "415d1dd1-4cd8-4f89-84c7-00ab1c502a93"}], "vid": [{"value": 36729}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:52:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12999-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:52:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:52:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "he<br />\nTill<br />\nrs-<br />\n<br />\n:he<br />\n<br />\nof<br />\nng<br />\na<br />\nassttsime<br />\n<br />\nin<br />\nan<br />\nins<br />\ning<br />\niudr.<br />\nnilas<br />\nof<br />\nqr.<br />\nthe<br />\n[se,<br />\nil-<br />\n<br />\nits<br />\n41e,<br />\nfolght<br />\nque<br />\nof<br />\nvas<br />\nthe<br />\nw<br />\n<br />\nfor<br />\nivas<br />\n<br />\nBALTIMORE, MD., APRIL 7, 1922<br />\n<br />\nVOL. XXVI. No 45<br />\n<br />\nDARTMOUTH TEAM WINS ANNUAL REPORT IS ISSUED VARSITY AND NON-VARSITY<br />\nMEN SET FOR INTERFIRST PLACE IN TICKET<br />\nOF THE ACTIVITIES OF<br />\nSALE CAMPAIGN<br />\nCLASS MEET<br />\nTHE Y. M.C. A. AT HOPLafayette and Georgetown Capture SecFirst<br />\nTeam<br />\nMen to Run Separately.<br />\nKINS<br />\nMarchant Wins<br />\nond and Third.<br />\nIndividual Prize.<br />\n<br />\nOrganization Is Doing Great Work for<br />\n<br />\nThe final returns of the Spring<br />\nReligion and Social Good of<br />\nUndergraduate Body.<br />\nSport Ticket Sale Campaign<br />\nshowed<br />\nSaturday<br />\nwhich ended last<br />\nThe annual report for the year<br />\na total of $2,710 collected for 416 1921-1922 answers fully the ques$5 tickets and 315 $2 tickets. After tion of what the Hopkins Y. M. C.<br />\na rather inglorious start the cam- A. does for the University.<br />\npaign livened up towards the end<br />\nThe activities connected with the<br />\nwhen the competition between opening of the University come<br />\nleading teams became very keen. first. An index of two hundred<br />\nThe Dartmouth team, led by cards for room and board is prePearce Coady, which jumped into pared by the secretary after a perthe lead at the beginning of the sonal inspection of the addresses<br />\nfinal week, managed to hold first submitted to the office. This is<br />\nplace by a good maigin with $451. available for the students coming to<br />\nLafayette, captained by John Hopkins from out of town. Also<br />\nMarchant, carried off second place during the summer the hand-book,<br />\nhonors with $313, and George- better known as the Freshman<br />\ntown, led by 0. D. Collins, placed Bible, is published, 'containing<br />\nthird, with $253.<br />\nnecessary information about the<br />\nThe individual prize was won University and the student activby John Marchant, who sold tick- ities; about 800 are given out yearets to the value Of $245. 0. D. ly. At the opening reception, held<br />\nCollins was second, with $142, the first Friday in the fall term, the<br />\nwhile Coady, Brawner and Bald- undergraduates of Hopkins meet<br />\nwin, all of the Dartmouth team, for the first time together and are<br />\nare each credited with sales of addressed by the Deans of the two<br />\nslightly over $100. The individual<br />\nschools, and also by representatives<br />\nsales of these few men really acof the various student organizacounted for the standing of their<br />\ntions. Later in the month an inforrespective teams.<br />\nmal dinner at the Hopkins Club is<br />\nThe award for the winning<br />\nheld<br />\nfor the foreign students; eight<br />\nteam will be a silver loving cup,<br />\ndifferent<br />\ncountries were representand for the winning individual<br />\nby the students in the<br />\nyear<br />\nthis<br />\ned<br />\na Hopkins seal gold ring. Winners<br />\nat Homewood.<br />\ndepartments<br />\nvarious<br />\nof second and third individual<br />\nconstitutes<br />\nwork<br />\nreligious<br />\nThe<br />\nprizes, as well as captains of secaction.<br />\n\"Y's\"<br />\nthe<br />\nof<br />\nbody<br />\nmain<br />\nthe<br />\nond and third teams, will each reM. P.<br />\nH.<br />\nof<br />\nleadership<br />\nthe<br />\nUnder<br />\nceive a Hopkins song book. These<br />\nBible<br />\nthe<br />\nchairman,<br />\nas<br />\nDavidson,<br />\nawar'ds will be made at a later assecuring<br />\nin<br />\nfortunate<br />\nwas<br />\nClass<br />\nsembly this spring after the song<br />\nRev. Reynolds, of Baltimore, an exbooks have been published.<br />\nchaplain of the U. S. Army, as leadFour teams which did not place<br />\ner for the first term; after the middeserve<br />\nin the money, however<br />\nPrescommendation for passing the year exams Rev. Coale, of the<br />\ntake<br />\nto<br />\nBoard,<br />\nasked<br />\nwas<br />\nbyterian<br />\nCornell,<br />\n$100 mark. These were<br />\nillness<br />\nsevere<br />\na<br />\nto<br />\ndue<br />\nbut<br />\ncharge,<br />\n$168;<br />\nwith $192; Pittsburg with<br />\nAL I. T., with $160, and Maryland his work was assumed by Rev. McFederawith $102. Other leading teams Creary, of the Baltimore<br />\nled<br />\nwho<br />\nthe<br />\nof<br />\nweekChurches,<br />\ntion<br />\nwere Holy Cross, $93; Navy,$84;<br />\nRauschenbusche's<br />\nof<br />\nly<br />\ndiscussions<br />\nOregon, $82; Penn State, $49;<br />\nThere<br />\nYale,$47, and Syracuse, $42. Only \"Social Principles of Jesus.\"<br />\nto<br />\ntwenty<br />\nof<br />\nattendance<br />\nan<br />\nbeen<br />\nseven teams allowed themselves has<br />\nweekly<br />\nthese<br />\nat<br />\nmen<br />\nthe disgrace of having blank twenty-five<br />\nspaces opposite their names. meetings.<br />\nThese were Illinois, Ohio State, The deputation work, with P. B.<br />\nCalifornia, Colorado, North Caro- Stevens as chairman, has completed a very active year, visiting<br />\nlina, Missouri and Trinity.<br />\ncamthe<br />\nof<br />\n24 churches and talking to an estiWhile the success<br />\nof<br />\ngoal<br />\nthe<br />\nmated total attendance of 2,000<br />\npaign fell far short of<br />\n$15,000 and slightly short of the people. The general plan has been<br />\nexpected amount of $3,000, yet to present to the smaller out-ofthe campaign has done much for town churches the student aspect of<br />\nthe benefit of Hopkins. The Christianity, and for this work two<br />\namount realized is - sufficient to teams of four men apiece have been<br />\ninsure the financial support of all organized. Their work has reSpring sports, a thing that has not ceived state-wide attention.<br />\nbeen accomplished for the last<br />\nThe ry\" co-operates with the<br />\nfew years. It has also put more town churches in endeavoring to<br />\nHopkins spirit into the few men get the out-of-town men affiliated<br />\nWho actively participated.<br />\nwith their respective denominations.<br />\nRIFLE TEAM \"SHOOTING\" V. P. I.<br />\nAND OHIO STATE<br />\nOne of the strongest of the social<br />\nThe Hopkins rifle team is now activities in former years has been<br />\nengaged in dual matches with the the Americanization work done by<br />\nVirginia Polytechnic Institute and the Hopkins men among foreigners<br />\nOhio State University. Ten-men of Baltimore; this year, however,<br />\nteams are firing in each match. In the School Board of Baltimore has<br />\nthe first, all the rounds will be fired<br />\ntaken the work under supervision.<br />\nin the prone position. In the sec- Also<br />\nthe settlement houses, in which<br />\nond, the rounds will be fired off<br />\nfrom five to ten Hopkins 'students<br />\nin sitting, standing, kneeling and<br />\nformerly coached athletic teams,<br />\nProne positions. The results will<br />\nContinued on page 3, col 3<br />\nnot be known before a few days.<br />\nJOURNALISTIC CO TEST<br />\nIn the next issue of the News-Letter there will be published the details of a contest for the would-be journalists of<br />\nthe undergraduate body. A prize has been offered to the<br />\nwriter of the best news or editorial article for the NewsLetter.<br />\n<br />\nL<br />\n<br />\nCompetition Expected to Be Keen,<br />\nWith Many Entries.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nVARSITY LACROSSE TWELVE READY<br />\nFOR INVASION OF ENGLISH TEAM<br />\nInterest at Fever Heat. Both Teams Have Demonstrated Prowess.<br />\nBritish Goal-keeper a Marvel. Frank Morley Expected to Star<br />\nThe attention of English and American lacrosse enthusiasts<br />\nwill be centered upon Homewood Field tomorrow, when the combined lacrosse teams of Oxford and Cambridge, fresh from their recent victories over the championship Lehigh team and the Penn<br />\nState stickmen, will meet the powerful twelve representing Johns<br />\nHopkins University. Intense interest has been indicated by a large<br />\nadvance sale of tickets, and lacrosse fans from Washington, Philadelphia, Annapolis and other nearby points will probably be a part<br />\nof the record crowd which is expected to be on hand when the referee's whistle announces the commencement of hostilities.<br />\n<br />\nThe Inter-Class Track Meet will<br />\nget under way this afternoon<br />\npromptly at 4.15 o'clock. The order<br />\nof events will be as announced in<br />\nlast Friday's issue, and the points<br />\nto be awarded are 5, 3 and 1 for<br />\nnon-varsity men, and 3, 2 and 1 for<br />\nvarsity men. All men will be eligible to competein thenon-varsity<br />\nevents with the exception of Clark,<br />\nAaronson, Thompson, R. Skinner,<br />\nWhile the English invaders<br />\nM. Skinner, Dorcus, Norwood, HOPKINS BALL TOSSERS EXshowing the Lehigh stickwere<br />\nEdwards, Somerville, Booth, MilPECTED TO TAKE GALfew points about the old<br />\na<br />\nmen<br />\nLAUDET INTO CAMP<br />\nligan, Holsopple, J. Shriver,<br />\nIndian<br />\ngame last Saturday, the<br />\nHearn, Wickham, Dixon, How- \"Herb\" Armstrong's Proteges Working to Wipe Out Sting of Last<br />\nBlack and Blue Varsity was demard, Freeman, Gilpin and HamWeek's Defeat.<br />\nits prowess by defeatonstrating<br />\nbleton.<br />\nThe Black and Blue ball tossers<br />\nFrom present indications, either will be strongly tested tomorrow ing the strong Alumni team, comthe Senior or Sophomore class at one o'clock, when Gallaudet Col- posed mostly of Mt. Washington<br />\nThe<br />\nshould emerge from the meet with lege will be met. , The Washing- players, by a 6-3 score.<br />\nthe greatest number of points. The tonians will no doubt be out to twelve showed much latent powFreshmen will also bear watching, avenge their 9-to-0 defeat at the er, both on the attack and the<br />\nwhile the Juniors, even though lim- hands of Hopkins last season, when defense, and, although a few<br />\nited in numbers, might upset the \"Bill\" Tucker literally stood them rough spots were visible to the<br />\ndope and spring some surprises. on their heads. Boatwright, who coaches, a week of intense trainFor the men listed above as the hurled against J. H. U. last year, ing has succeeded in rounding the<br />\nvarsity squad, this afternoon's meet will again probably be seen at team into a smoothly-running<br />\nwill be a serious matter, for it is Homewood, as will five other mem- machine.<br />\nlargely upon the results of this bers of the 1921 squad. At the<br />\nEye-witnesses of the game at<br />\nmeet that a man's eligibility for the present time the Gallaudet team South Bethlehem last Saturday,<br />\nEaster vacation trip will be deter- seems to be more or less of an from which the invaders emerged<br />\nmined.<br />\nuncertain quantity, for although it a 7-2 victor, report that the excelContrary o the usual custom of is reported that they have been lent physical condition of the<br />\nthe track mentors, no man will be showing up very well in practice Englishmen was responsible, in a<br />\nable to take the trip until he shall games, they were forced to bow to large part, for their decisive vichave satisfied certain requirements Catholic University by a count of tory. Their men, so it is said, are<br />\nfor his particular events. From the 13 to 5 in the initial contest of the older, heavier and more experiThis game, however, enced than the average American<br />\nlist of times given below, it will be season.<br />\nseen that the varsity men will have should not be taken as a criterion player, and, besides, display an<br />\nto hustle if they expect to enjoy of the strength of the Gallaudetians, excellent brand of teamwork.<br />\nthe balmy Southern air at Easter- as Catholic University presented, Penn State team was snowed<br />\ntide. Most of the men will have practically intact, her strong line- under by a 6-0 score.<br />\nto demonstrate their ability this af- up of last year.<br />\nThe work of Lett, the Oxford<br />\nIt is not considered likely that goal-keeper, stood out prominentternoon, so the quality of the meet<br />\nshould be much higher than here- there will be any change in the ly in both the Lehigh and Penn<br />\nlineup of the Hopkins team for to- State games. Using stickwork<br />\ntofore.<br />\nmorrow's game. The team looked as is seldom observed and divertTimes and distances required:<br />\nin the Dickinson game, with ing many baffling shots, this wellgood<br />\n100 Yards-102-5 sec.<br />\nof a few rough edges built Englishman made things<br />\nexception<br />\nthe<br />\n220 Yards-23 1-5 sec.<br />\nwhich Coach \"Herb\" Armstrong difficult for the Pennsylvanians'<br />\n440 Yards-53 1-5 sec.<br />\nhas been endeavoring to polish off attack, which found it nearly im880 Yards-2:04.<br />\nthis week in the long practices possible to get the ball past the<br />\nMile-4:40.<br />\nwhich have been held. With an crease. Lett was greatly aided by<br />\nTwo Miles-10:45.<br />\neven<br />\nnumber of the breaks of thc Frank Morley, former Hopkins<br />\n220 Low Hurdles-27 1-5 sec.<br />\ngame<br />\ncoming to Hopkins, it is not star defense man, who showed<br />\n120 High Hurdles-17 3-5 sec.<br />\nto predict victory tomorrow that many of the fine points<br />\namiss<br />\nShot Put-35 ft. 6 in.<br />\nfor<br />\nBlack and Blue tossers.<br />\nthe<br />\ntaught him by Coaches SchmeisDiscus-100 ft.<br />\nLineup:<br />\nser and Knipp had not been forJavelin-135 ft.<br />\nGallaudet—Seipp, ss.; Rose, c.; gotten.<br />\nHigh Jump-5 ft. 5 in.<br />\n2b.; Boatwright, rf. or<br />\nDanofsky,<br />\nBroad Jump-20 ft. 9 in.<br />\nIt is expected that members of<br />\np.; Bradley, lb.; Lucado, cf.; WalPole Vault-10 ft.<br />\nthe English Embassy will motor<br />\nlf.; Hawkins, 3b.; Lahn, p.<br />\nMore or less humor floats around lace,<br />\nHopkins — Grace, 2b.; Reif- over from Washington to cheer<br />\namong the spectators as their unShar- for their countrymen. A committrained friends compete .in an en- schneider, 3b.; Hayter, rf.;<br />\nRich, cf.; tee, of which Dr. Ronald T. Aberdeavor to uphold class honors. Th.. retts, lf.; Marrian or<br />\ncrombie is chairman, has been<br />\nevents this year will be far more Knecht, lb.; Thomas ss.; Holland,<br />\nOwings, Marchetti, formed and has charge of the enClayton,<br />\nc.;<br />\ninteresting to the non-varsity men,<br />\ntertainment of the Oxford team<br />\nbecause of the absence of the var- Tucker, McMillan, p.<br />\nsity stars, who generally managed HULLABALOO READY TO GO TO and distinguished guests. The<br />\nto win their events in spite of the<br />\nteam will be met at the station by<br />\nPRESS<br />\nhandicaps. For the varsity men, The material for the Hullabaloo a Hopkins delegation and band.<br />\nthe outlook is not so pleasant, for has all been collected and is comJohns Hopkins<br />\nOxford-Cambridge<br />\nthey will be forced to exert them- pletely arranged for publication.<br />\nRoutson or<br />\nC<br />\nLett<br />\nselves from start to finish in order<br />\nThe issue of this season will difBenedict<br />\nto retain their jobs on the team. fer from that of last year in that Clark<br />\n......P........ Bachman<br />\nTurner or<br />\nCP<br />\nThe meet will furnish a splendid each member of the Senior Class Morley<br />\nMoore<br />\nopportunity for every man to show will be assigned a full page, which Switzel .......F.D... ... Zoller<br />\nS D<br />\nBenedict or<br />\nhis class spirit and loyalty. If he is to contain a photograph, a snap- Mennie .<br />\nLandy<br />\ncannot compete, a man can at least shot, a list of the senior's activities, Hopkins ......T.D......Murphy or<br />\nCromwell<br />\nurge on his classmates, and there and an individual writeup.<br />\nC<br />\nBurnham or<br />\nCurrie .<br />\nMiddleton<br />\nis no reason why every undergradThese Writeups have been comBennet or Coats T A<br />\n. Huey or<br />\nuate should not be present.<br />\npleted and are in the hands of the<br />\nCoady<br />\nGriffis&<br />\nS A<br />\nCoach Le Cato announces that it printers. It is likely that, if all Neilan<br />\nF A<br />\nMee<br />\n. Turnbull<br />\nis imperative that every man who group photographs have been Pearson<br />\n0 H.. Bauernschmidt<br />\nor Parsons<br />\nexpects to compete be at the field taken, the book will go to press<br />\nWansbrough .• •I• H.<br />\nMcDaniel or<br />\nin uniform by 4:15.<br />\nwithin the\"next week.<br />\nO'Connor<br />\n•<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 7, 1922<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\nHOPKINS DISTINGUISHED<br />\nSCIENTISTS<br />\n<br />\nFOUNDED 1897.<br />\n<br />\nDr. Ira Remsen was born in<br />\nNew York City, February 10, 1846.<br />\nHe received the degree of A. B. in<br />\n1865 from the College of the City<br />\nof New York. This was followed<br />\nby an M. D. at Columbia in '67.<br />\nDr. Remsen later received degrees<br />\nof LL. D. at a number of the lead-.<br />\ning universities of North America,<br />\nincluding Yale, Harvard, Toronto,<br />\nPrinceton, etc. From 1872 to 1876<br />\nhe was professor at Williams College. From that date until 1913<br />\nDr. Remsen was Professor of<br />\nChemistry at Johns Hopkins. In<br />\n1901 he was elected President of<br />\nthe University and he held that office until his resignation in 1913.<br />\nHe belonged to practically all the<br />\nforemost chemical and scientific societies in this country and abroad,<br />\nand has written a number of books<br />\nwhich have added greatly to the<br />\nliterature upon chemistry. Among<br />\nthem are \"The Principles of Theoretical Chemistry,\" \"The Elements<br />\nof Chemistry,\" \"Inorganic Chemistry,\" and \"Chemical Experiments.\" These books had a vast<br />\ninfluence in the study of the science<br />\n<br />\n$2.50<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\n<br />\nTelephone<br />\nEditor-in-Chief:<br />\nWILLIAM H. MOORE, JR., '23<br />\n<br />\nBusiness Manager:<br />\nGLOVER P. FALLON, '23.<br />\n<br />\nManaging Editor:<br />\nJ. HUDSON HUFFARD,'23<br />\nAssistant Managing Editor:<br />\nJOSEPH S. LEOPOLD, '24.<br />\n<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\n<br />\nAssociate Editors:<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN,'23.<br />\nFITZGERALD DUNNING, '24.<br />\nPHILIP W. HOWARD, '25.<br />\nMILES D. MARRIAN, '25.<br />\nG. DONALD GIESKE, '25.<br />\nD. H. STEVENSON, JR., '25.<br />\n<br />\nJunior Editors:<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br />\nG. COCHRAN DOUR, '23.<br />\nT. CLYDE ROUTSON, '23.<br />\nR. C. TILGHMAN,'25.<br />\n<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nBALTIMORE, MD., APRIL 7, 1922<br />\n<br />\nand at the time of publication<br />\nwere recognized as the best text<br />\nbooks on the subject. Indeed, his<br />\nworks were translated into almost<br />\nall the modern languages.<br />\nDr. Remsen is undoubtedly one<br />\nof the greatest chemists this country has produced. Perhaps more<br />\nthan any other man, he was responble for blasting the idea that the<br />\nreal study of chemistry was impossible outside of Germany. His<br />\ninfluence was felt all over the country through the trained men which<br />\nwere sent out after study under<br />\nhim.<br />\n<br />\nThe TheatreGuild<br />\nPresents a<br />\nSpecial Easter Holiday Festival<br />\n<br />\nBACK TO<br />\n<br />\nMETHUSELAH<br />\nBernard Shaw's Fantastic Comedy is<br />\nnow being given in cycles of three performances at the Garrick Theatre, New<br />\nYork. All three performances are given<br />\nin one week.<br />\n1st part, Mon. Tues. & Tues. Mat.<br />\n2nd part, Wed. Thurs. & Thurs. Mat.<br />\n3rd part, Fri. Sat. & Sat. Mat.<br />\n<br />\nFOUND<br />\n<br />\nPRICES<br />\n<br />\nA gold watch containing a 3 parts, evenings, $9.90; $8.25; $6.60; $4.95.<br />\n3 parts, matinees, $6.60; $4.95; $3.30.<br />\nSwiss movement was found at Single parts at one-third the above rates.<br />\nathletic field by Mr. Middleton.<br />\nThe watch also bears a monoMail checks for reservations to<br />\ngram.<br />\nOwner may secure same by applying to Y. M. C. A. office or Ath- 65 West 35th St.<br />\nNew York city<br />\nletic Office.<br />\n<br />\nGARRICK THEATRE<br />\n<br />\nOur -prep- room on the<br />\nthird floor specializes in<br />\nclothes for young men.<br />\n<br />\nCotillon Board Dance<br />\nTomorrow Immediately<br />\nAfter Lacrosse Game<br />\nC. E. Hall<br />\nAdmission 50c per Couple<br />\n<br />\nhub<br />\nBaltimore. Charles and Fayette<br />\n<br />\nWE HAVE WITH US<br />\nTomorrow we will have as our guests a group of selected athletes, representing the two oldest universities in the world.<br />\nMost of them are obtaining their first impression of America on<br />\nthis trip. Thus far, they have invaded the lacrosse field of three universities and have come away with the victor's end of the spoils. We<br />\nhave reason to believe that things will not go so easily with them out<br />\nat Homewood Field tomorrow. The game should be hotly contested throughout and it is therefore essential that both rooters and<br />\nplayers make an especial effort to display good sportsmanship.<br />\nThe fact that an ex-Hopkins student and player is among the<br />\nvisitors should serve as an incentive to us to \"do him proud\".<br />\nThis international contest, more than all of the other games<br />\ncombined, will carry with it a great amount of advertising and comment concerning Johns Hopkins.<br />\nWe can afford to do nothing else than put our best foot forward.<br />\nLet's show the visitors from the old world what clean winners—or<br />\nwhat good losers we are.<br />\n<br />\nBut he's really trying out<br />\nfor Sales Manager<br />\nrr HE freshman<br />\n<br />\nSpeaking of the Oxford-Cambridge schedule, ask the \"Man Who<br />\nKnows\" Why Navy didn't book a game.<br />\n<br />\nWANTED<br />\nThe cheering at the games last Saturday, although good, lacked<br />\nthe force of supervised effort. The scattered groups of rooters were<br />\nenthusiastic and generous with their applause, but the result was<br />\nweak and would have been far more pleasing had their efforts been<br />\nconcentrated.<br />\nThrough the endeavors of the Sigma Chi Beta Honorary Society, last year, spring sport cheer-leaders were provided. Their<br />\nservices, with that of the band, served to produce a much smootherrunning rooting section.<br />\nInasmuch as our collection of yell-directors will be sadly depleted by the opening of next term, these spring games seem to offer<br />\nan excellent opportunity for the schooling of the new aspirants in<br />\nthe art of writhing and twisting.<br />\nThe position of Head Cheer Leader is one offering splendid occasions for an injection of personality. While at first consideration<br />\nthe office may not appear as exalted a one as that of fullback on<br />\nthe<br />\nfootball team or star, twirler on the nine, it should be<br />\nremembered<br />\nthat it can be made what its holder wills.<br />\nCheer Leader Mike Curley will be remembered long after<br />\nmost<br />\nof the \"star twirlers\" of his institution have faded into the<br />\nbackground of memory.<br />\nWe haven't had any new songs or.yells tried for some time. Spring's<br />\na good time to get that'out of yourveinsr too.<br />\n<br />\nPublished in<br />\nthe interest ofElectrical Development by<br />\nan Institution that will<br />\nbe helped by whatever helps the<br />\nIndustry.<br />\n<br />\nwho corn s out for baseball<br />\nmanager and who sticks is learning a lesson<br />\nwhich, whether or not it wins that honor for him,<br />\nshould win some honors in after life.<br />\nHe will learn that his plugging on the diamond,<br />\nhis efforts four years hence to get the upper hand<br />\non his first job, and after that his striving to climb<br />\ninto the managerial and executive class are all<br />\npart of the same game.<br />\nNow,just as ten years from now, he will have<br />\nto do many things that are hard, many things that<br />\nare unpleasant. The more willing he is, the more<br />\nwork will other men put upon him. But by that<br />\nhe grows.<br />\nThe rewards after college are given on about the<br />\nsame basis as now. Theygo to the man who besides<br />\ndoing his main job well,still has the time to reach<br />\nout after other work and the spirit that masters it.<br />\nHere is where this comes home to you. Don't<br />\nbe content with standing high in the classroom.<br />\nSupport your college activities and go after some<br />\ncampus honors too. This broadening of your<br />\ninterests will become a habit that in .after life will<br />\nprove a mighty big help.<br />\n<br />\nestern Electric companv<br />\nSince 1869 makers and distributors ofelectrical equipment<br />\n<br />\nNumber 16 of a series<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 7, 1922<br />\nRIFLE TEAM MAY BE VOTED<br />\nRECOGNITION BY A. A.<br />\nASSOCIATION<br />\n<br />\nPROFITABLE CONTEST FOR UNDERGRADUATES IS OFFERED<br />\nBY \"THE OUTLOOK\"<br />\n<br />\nDRAMATIC CLUB ELECTS 20 NEW<br />\nSPORT WEAR<br />\nMEN TO ORGANIZATION<br />\n<br />\nFULL DRESS<br />\n<br />\nAt a meeting of the Dramatic<br />\nlast Tuesday, the men who<br />\nClub<br />\nResolution to Be Placed Before Stumembership<br />\nthrough their parwon<br />\nTeam<br />\nHas<br />\ndents at Mass-meeting.<br />\nSuccessful Season.<br />\nticipation in the cast of \"If I Were<br />\nKing\" were elected. They are: H.<br />\nAt a meeting of the Athletic<br />\nTaylor White, Wm. H. Moore,<br />\nS.<br />\nBoard, which was held April 3,<br />\nJr.,<br />\nDonald Kirkley, Charles Evthe Johins Hopkins Rifle Team was<br />\nter so much what college faculties ans, Hugh Smallwood, Fred Rich,<br />\nrecommended for recognition to<br />\nthink about athletics. It is what Carl Buckheister, Hugh English,<br />\nthe Athletic Association. The Asthe undergraduate thinks that is W. C. Gardner, Thomas Jenifer,<br />\nEnglish Clothes Tailored in America<br />\nsociation is to vote upon the recogS30 to SI-5<br />\nreally vital.\" It is the purpose of Edward Mount, Philip Sachs, Nelnition May 4. After a brief introthis<br />\nhelp<br />\nto<br />\nothers<br />\nto<br />\nknow<br />\ncontest<br />\nson Young, John Croker, Clarence<br />\nduction by Dr. Abercrombie and a<br />\nthe trend of this undergraduate Adams, Howard Reaney, Henry<br />\nMt. Vernon 4999<br />\ndetailed explanation by Major<br />\nopinion.<br />\njoesting, George M. Shriver, Jr., \"Queen Quality\" Home Made<br />\nGarey, the following resolution was<br />\nSome of the questions which Isaac Hamburger II, and John<br />\nadopted: \"A Varsity H may be<br />\nChocolates<br />\nmaterially aid those partici- Sherwood.<br />\nshould<br />\nVISIT OUR ICE CREAM PARLORS<br />\nawarded to a member, or qualifying<br />\nThe club will !hold its annual<br />\n518 N. CHARLES ST.<br />\nmembers, winning an intercollegi- pating in the contest are:<br />\nCommercial Photography<br />\non Tuesday, April 11,<br />\nplace<br />\nof<br />\nthe<br />\nbanquet<br />\nin<br />\nathletics<br />\nis<br />\nWhat<br />\nate championship, or to individuals<br />\nCircuit Photography<br />\nHotel.<br />\nFlash Lights<br />\nViews<br />\nwinning first place. An H R T education? What constitutes the probably at the Emerson<br />\nmembers of<br />\nactive<br />\nthe<br />\nBesides<br />\nIs<br />\nit<br />\nspirit?<br />\namateur<br />\nendangered<br />\nparticmembers<br />\nto<br />\nawarded<br />\nGroups<br />\nEnlargements<br />\nmay be<br />\nCharles and 22nd Sts.<br />\nfollowing alumni<br />\nKODAK FINISHING<br />\nipating in seventy-five per cent. of by proselyting? By athletic \"schol- the club, the<br />\nDelicious Sodas and Sundaes<br />\nand honorary members will atarships\"? By professionalism?<br />\n325 N. Howard St.<br />\nall matches.\"<br />\nThe Best of Candies<br />\nIs too much emphasis, or too lit- tend the banquet: Harry Morriss,<br />\nAccording to Article V of the<br />\nPrompt & Efficient Service<br />\nDonald Mossom, Terry Berger,<br />\nConstitution of the Athletic Asso- tle, placed upon sport? Should the<br />\nSmith, Jr., and Miss Clemciation, \"Amendments to the Con- present system of intercollegiate Frank<br />\nWalter, all of k‘rflom are<br />\nentine!<br />\nElkridge Farms Dairy<br />\nstitution and By-Laws shall be pro- athletics be modified? How?<br />\nAdvisory<br />\nAlumni<br />\nof<br />\nthe<br />\nmembers<br />\nSTRICTLY FRESH MILK<br />\nposed at a general meeting of the<br />\nW. University Parkway<br />\nWhat does the undergraduate<br />\nCouncil; Mr. Walter B. Swindell,<br />\nAssociation, and shall stand, if think of the ethical standards and<br />\nOpposite J. H. U. Athletic Field<br />\nPasteurized and Bottled<br />\nJr., the producer of \"If I Were Produced,<br />\nin Howard County<br />\nunanimously approved by the As- attitude of sport writers? What<br />\nDRUG STORE for J. H. U. BOYS<br />\nKing,\" Holmes Boyde, H. J.<br />\nsociation. Otherwise, they shall lie does he think of newspaper pubEllicott City 231 -R<br />\nCLARK BROS.<br />\nand<br />\nTrew.<br />\nBartus<br />\nGrins<br />\nfelder<br />\nPHONE, HOMEWOOD 2121<br />\nover until a second meeting, when licity?<br />\nof<br />\nAs<br />\nthe<br />\nis<br />\nofficers<br />\ncustomary,<br />\na two-thirds vote of those present<br />\nIt is not desired that those who the club for next year will be electBuy an (H) Pipe made special<br />\nshall be necessary for their adopfor prizes should attempt to ed at the banquet. Also the electry<br />\ntion. These meetings shall be adfor the Boys<br />\nanswer all the questions—in fact, it tion of the Advisory Council of<br />\nvertised and proposed amendments is not necessary to answer any of<br />\n1922-23 will be held.<br />\nLIBERTY ST. at SARATOGA<br />\npublished in the University papers<br />\nthose listed. They are merely sugThe club has decided to present<br />\n(Opposite Hotel Rennert)<br />\nat least two weeks before being<br />\nORDERS RECEIVED FOR<br />\ngestions.<br />\nLUNCHEON—:—DINNER<br />\nMr.<br />\nSwindell<br />\nhandsome<br />\nwith<br />\na<br />\nheld.\"<br />\nCOGGINS'<br />\n11:30 until 7:30<br />\nThe prizes offered are: $25, $20, leather traveling case in recogniThe members of the Athletic AsDANCES Transfer and Baggage Express<br />\nSMOKERS<br />\nBANQUETS<br />\nsociation by Article II, Section 2, $15, and seven prizes of $10. The tion of his untiring services to the<br />\nBy Arrangement<br />\nAUTOMOBILE SERVICE<br />\nTelephone St. Paul 6987<br />\nPHONE, HOMEWOOD 2645-W<br />\nis composed of \"The active roll contest is subject to the following club during the past year.<br />\nshall be \"all registered members conditions: 1. Only college underof the University paying the gym- graduates are eligible. 2. Name A. A. BOARD AWARDS MINOR \"H\"<br />\nand address with college and class<br />\nnasium locker fee.\"<br />\nDo you know how best to provide<br />\nAt the meeting of the Athletic<br />\nis to be placed in upper lefthand<br />\nfirst,<br />\nAre You Planning A<br />\nan income for your old age?<br />\nDr. Abercrombie spoke<br />\nBoard, on April 3, the following<br />\nConsult with<br />\nVACATION ABROAD?<br />\nbringing to attention the fact that corner of letter. 3. All letters must<br />\nmembers of the cross-country team<br />\npaper<br />\non<br />\nof<br />\none<br />\ntypewritten<br />\nside<br />\nbe<br />\nasthe R. 0. T. C. has thus far<br />\nW. W. WALKER<br />\nIf So, Call on<br />\nwere recommended and awarded<br />\nsumed all responsibility of the Rifle only. 4. Letter must not be over their H. C. C.: Captain W. H.<br />\n909 Calvert Bldg. St.Paul 2581<br />\nTeam, in which it expended seven 600 words in length. 5. The letter Somerville and W. R. Edwards, A. SCHUMACHER & CO.<br />\nhundred dollars of its own money, must reach the Outlook office before both wearers of the H.; Milligan,<br />\nPASSENGER<br />\nIt has won twelve out of thirteen April 15, 1922. 6. The right is reAGENTS<br />\nR. Fenton and Manager Fortney.<br />\nJ. F. APPLE CO.<br />\nmatches, Yale University being the served to purchase for publication<br />\nfor all<br />\nThe board decided to send a spewinning<br />\nnot<br />\nletters<br />\nLancaster, Pa.<br />\ndesirable<br />\nsole victor.<br />\nTrans-Atlantic Lines<br />\nPalmer<br />\nto<br />\nthanks<br />\nof<br />\nMr.<br />\ncial<br />\nletter<br />\nwill<br />\nletters<br />\nMANUFACTURING<br />\nUnavailable<br />\nJEWELERS<br />\n7.<br />\nprizes.<br />\nthe<br />\nin<br />\nthat<br />\nstated<br />\nMajor Garey<br />\nin<br />\nhis<br />\nwork<br />\nof<br />\nin<br />\nbeappreciation<br />\nof<br />\nMakers<br />\nof<br />\nJewelry.<br />\nHopkins<br />\nstaff<br />\nThe<br />\n8.<br />\nbe<br />\nreturned.<br />\nnot<br />\nHopJohns<br />\nintercollegiate matches,<br />\nCharles & Redwood Sts.<br />\nWrite for Special Designs and Prices<br />\nSale.<br />\nTicket<br />\nSpring<br />\nof<br />\nthe<br />\nhalf<br />\njudges.<br />\nbe<br />\nwill<br />\nThe<br />\nOutlook<br />\ndefeating<br />\nkins won eighth place,<br />\nCall at University P. 0. for<br />\nAll letters should be addressed to Also, Mr. Wilmer Ray was conYale University by two points. He<br />\nInformation.<br />\non the progress of the<br />\nalso said that of all athletic con- \"Contest Editor, The Outlook Com- gratulated<br />\ncampaign.<br />\ntests with which he had had con- pany, 381 Fourth Avenue, New<br />\nThe board will vote on the resYork<br />\nCity.\"<br />\nnection, \"there is none which reolution to recognize the Rifle Team<br />\nquires such co-operation of the<br />\nas a minor sport. The men of the<br />\nmembers as the Rifle Team.\"<br />\nBIG<br />\ncannot be awarded their letIN<br />\nteam<br />\nREPRESENTED<br />\nHOPKINS<br />\nrecwho<br />\nuniversities<br />\nthe<br />\nSome of<br />\nMEN'S SHOES<br />\nORATORICAL CONTEST<br />\nuntil an amendment is<br />\nthough,<br />\nter,<br />\nminor<br />\nas<br />\nteams<br />\nrifle<br />\nognize their<br />\nITY or rent a Corona<br />\nOf the Better Class<br />\ntypewriter on easy<br />\nthe<br />\nto<br />\nadded<br />\nto<br />\nrecogconstitution<br />\nConOratorical<br />\nColumSouthern<br />\nThe<br />\nTech,<br />\nsports are Carnegie<br />\npayments. Carry it to<br />\nschool every day in its<br />\nbia, Cornell, Georgetown, Georgia test will take place tomorrow, April nize the Rifle Team.<br />\nneat case. Make extra<br />\nNashUniversity,<br />\nUniVanderbilt<br />\nthe<br />\nat<br />\n8,<br />\nTech, Syracuse, Yale and<br />\nmoney writing articles or<br />\ndoing typing for others!<br />\nANNUAL Y. M. C. A. REPORT<br />\nversity of Pennsylvania. Upon the ville, Tenn. Hopkins is to be repCalltoday atthe nearest<br />\nBROTHERS<br />\nURNER<br />\nAlMr.<br />\nby<br />\ncontest<br />\nContinued from page 1<br />\nbasis of these facts, Major Garey resented in the<br />\nCorona store—or teleIII E. BALTIMORE STREET<br />\nphone for a demonstrarequested that minor sport letters bert J. Langeluttig, Jr., '22. Mr. have been discontinued. The one<br />\nBALTIMORE<br />\nat your home.<br />\ntion<br />\nbe awarded the team and if cham- Langeluttig has chosen as his sub- big accomplishment in the social<br />\nM. W. LUCY & CO.<br />\npions of the United States the letter ject \"The Senate and Treaty-mak- field has been the raising of $450<br />\nGould,<br />\nTheodore<br />\ning<br />\nPower.\"<br />\n118 W. Fayette St.<br />\nawarded.<br />\nH be<br />\nfor the Student Friendship Fund,<br />\nwinner<br />\nof<br />\nprize<br />\nChurch<br />\nEpiscopal<br />\nThe<br />\nabove<br />\nsecond<br />\n'21,<br />\nthe<br />\nHopkins,<br />\nthat<br />\nfact<br />\nDue to the<br />\naid given to the students of Central<br />\nWeighs Oilbs.<br />\namendment to the constitution of of last year's contest, is now presi- Europe, who are still struggling to<br />\nFolds and fits<br />\nSt. Michael and All Angels<br />\na neat carryin<br />\nthe Athletic Association is to be dent of the Southern Oratorical reconstruct their physical and eduing case.<br />\nST. PAUL and TWENTIETH STS.<br />\nvoted upon May 4, it is requested League. Mr. Gould has been called cational life. Finally, is the wellSAn with<br />\n\"ow Case<br />\nadof<br />\nAssociaupon to rule on the question<br />\nthat every member of the<br />\nknown care of the reading room at Wyatt Brown, D.D., Litt.D., Rector<br />\ntion should be present and record mitting Sewanee University in the the Barn, supplying magazines, Holy Communion at 7.30<br />\nplace of the University of Alabama, checkers and chess, a piano and a Young Men's Bible Class, 9.30<br />\ntheir respective vote.<br />\nwhich recently withdrew from the victrola.<br />\nMorning Service, 11 o'clock<br />\nThe Personal Writing Machme<br />\nY. M. C. A. TO HOLD ELECTION OF league.<br />\nEvening Service, 8 o'clock<br />\nof<br />\nmany<br />\nfields<br />\nare<br />\nthere<br />\nWhile<br />\nNEW OFFICERS<br />\nThe Adams Public-speaking activity the Hopkins \"Y\" has not Special Invitation to Hopkins Students<br />\nAn election of officers for the<br />\nwill be held at Assembly on touched, the record of the year<br />\nContest<br />\nHopkins Y. M. C. A. Cabinet will April 20. The contestants for the<br />\n1921-1922 contains evidence of the<br />\ntake place in Room 104, M. E. Adams Medal are Rignal Baldwin,<br />\nvalue of this organization in relaST. DAVID'S<br />\nBuilding, at 12.30, Tuesday, April Arthur Koff, C. Moninonier and<br />\nHomewood,<br />\nat<br />\nstudent<br />\nthe<br />\nto<br />\ntion<br />\nProtestant Episcopal Church<br />\n11. All men who have participated<br />\nof Baltimore.<br />\nRodman.<br />\nlife<br />\nMorris<br />\nreligious<br />\nthe<br />\nand<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nin \"Y\" work at the University and<br />\nbe<br />\nwill<br />\nContest<br />\nThe<br />\nTocqueville<br />\nintention<br />\ntheir<br />\nRoland Park<br />\nWho have declared<br />\nCHAS. E. HERRING<br />\nof joining are invited to atterid the held at the Assembly of May 4.<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\nAlbert Dimond, E. L. Putzel, John<br />\nYour Caterer at Hopkins Dances<br />\nelection.<br />\nSUNDAY SERVICES<br />\nO'Keefe and E. F. Wolfe have been<br />\nMeet Your Friends in my<br />\ncontest.<br />\nthis<br />\nin<br />\nparticipate<br />\nto<br />\nchosen<br />\nBalcony—Soda Booths<br />\nThe Pi Kappa Chi Fraternity<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\nannounces with pleasure the pledg- The subject for this year is \"France S. E. Cor. Maryland and North Ayes.<br />\n8 P. M.—Choral Evening Prayer<br />\nDANCING<br />\nAs a Democracy.\"<br />\nMUSIC<br />\ning of C. Ely Wickham, '25.<br />\nThe Outlook magazine has recently offered ten prizes for the<br />\nbest letters of six hundred words<br />\nor less from college undergraduates<br />\non Intercollegiate Athletics. The<br />\nOutlook feels that \"it doesn't mat-<br />\n<br />\nf Cusiom Quality.<br />\nN,ChurtesStreet_<br />\n<br />\nORTMAN'S<br />\n<br />\nW.L. Mann<br />\n<br />\nChelsea Pharmacy<br />\n<br />\nR.G.by & Company<br />\n1<br />\n<br />\n111111111111111111•111111•1111\\<br />\n<br />\nURNER'S<br />\n<br />\nTeachers!<br />\nB<br />\n<br />\nCoRoNA<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 7, 1922<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co. 4:8:€4:9)4)4)4iKea4)4:6:8:€1)4:oce:E4:8)3:8)4:6)3:koo of-town men as well as Baltimor4)<br />\neans, to come together in social<br />\n(THE BOOK MART)<br />\n(Trietas to fly<br />\ncommunion to have a good time;<br />\nas this is exclusively a Hopkins afComplete Stock of<br />\n8<br />\nMedical Books and College<br />\nC828:928N:8:8:8:928X(3:ECECO:9:61:428:19:8:8:8:8:3 fair and a real Hopkins affair at<br />\nRequisites<br />\n<br />\nUNBECOMING CONDUCT AT<br />\nASSEMBLY<br />\n<br />\nImporters and Dealers in Fine Books<br />\n<br />\nEditor of the News-Letter,<br />\nDear Sir :<br />\nBaltimore, Md.<br />\nI should like to publicly give<br />\n'expression to some of the feelings<br />\naroused in the minds of many of<br />\nthe students after the disgraceful<br />\nexhibition of lack of courtesy<br />\ngiven to Mrs. Wright at a recent<br />\nAssembly during the latter<br />\n\",.ar<br />\npart of her interesting lecture<br />\non Alaska. A person possessing<br />\nXatterievy)<br />\nany of the inherent qualities of a<br />\n4elbem<br />\n`Ldl • Es H.N, OSCAR<br />\ngentleman cannot help but proOWNERS<br />\n1,4?<br />\ntest against shameful breaches of<br />\nADEt\" stre4 r'1P<br />\n'<br />\n°<br />\ncourtesy such as have just been<br />\n29 Baltimore St., East<br />\nwitnessed.<br />\nOne Door West of Light St.<br />\nThe worst of it is that it is not<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\nonce or twice that the speaker has<br />\n(Greek Letter Societies)<br />\nbeen treated disrespectfully, but<br />\nthe same thing happens almost<br />\ninvariably every Thursday. It is<br />\nThe Chas. Willms Surgical<br />\ncertainly time to call a halt. DurInstrument Co.<br />\n300 N. HOWARD ST., Baltimore, Md. ing the last fifteen minutes of the<br />\nSURGICAL INSTRUMENTS<br />\nlecture Mrs. Wright was comMicroscopes and Supplies,<br />\npelled to attempt to talk above<br />\nStethoscopes<br />\nBlood Lancets a great many whispered converBlood Counters<br />\nsations being carried on in different parts of the room. In addition<br />\nto this the entire assemblage was<br />\nmore or less restless, chairs creakl'rinters of Philological and<br />\ning and unnecessary personal exScientific Works<br />\nhibitions of boredom • being ob23 S. HANOVER ST.<br />\nserved.<br />\nLaltimore, Md.<br />\nSome excuse for the discourtesies on the part of the students<br />\nmight be offered when it is considered that half of the dinner<br />\nhour was taken up by the lecture.<br />\nAll the students are very jealous<br />\n9<br />\nof their forty- minutes for lunch<br />\nand hate to lose any time from<br />\nthis all too short period. I think<br />\nthat the authorities should make<br />\nt very plain to the lecturer that<br />\n17 E. Baltimore St.<br />\nhe should finish by 12.20. If this<br />\nwere seen to, the students would<br />\nbe only too glad to give rapt attention to any subject under discussion for forty or fifty minutes.<br />\nPrinters of the<br />\nBut whatever action is taken or<br />\nJohns Hopkins News-Letter<br />\ns not taken, let us all co-operate<br />\nn giving the assembly speakers<br />\n; n enthusiastic reception and<br />\n!\"exfteztoVitede\" /I<br />\ni ourteous attention, and let us<br />\nI ot forget that it is through our<br />\n. \\ . -,- THE'<br />\n; ssemblies that visitors get their<br />\ni 4C, ti%-irr<br />\ni mpressions of us.<br />\n:A'-1P01<br />\nYours for J. H. U.<br />\nPROGRESS.<br />\n301 N. CHARLES ST.<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n<br />\n]N<br />\n<br />\n,<br />\n<br />\nREGARD TO THE ZIONIST CLUB<br />\nDANCE<br />\n<br />\nditor-in-Chief of NEWS-LETTER.<br />\nDear Sir: It is the custom of<br />\n1341411N<br />\n°<br />\n4<br />\nt he Johns Hopkins Zionist Society<br />\nI o give an annual spring dance to<br />\n(<br />\nelebrate both the passing of bleak<br />\nCollege Literature<br />\nvinter<br />\nand the advent of happy<br />\nLOMBARD.and SOUTH STREETS 1<br />\n5 pring. The affair this year will be<br />\n,<br />\niven on Saturday night, April 8,<br />\nt the Civil Engineer*. Hall. As<br />\nhis<br />\nt<br />\ndate is four days before the<br />\nSHOES<br />\nI aster recess begins, an opportunity<br />\nfor<br />\nis afforded to all the students—outUNIVERSITY MEN<br />\nI<br />\n<br />\nFor Dress<br />\nFor Sport Wear<br />\nSmart Styles—Best Leathers<br />\nModerate Price.;<br />\n<br />\nWYMAN ,<br />\n19 W. LEXINGTON ST.<br />\n<br />\nthat, there is no reason why any<br />\nstudent should stay away.<br />\nAll arrangements have been completed; tickets have been distributed ; invitations have been sent out<br />\nto the alumni and medical school<br />\nstudents, and large representations<br />\nof these are expected. It is very<br />\nprobable that there are some who<br />\nhave not yet obtained their tickets.<br />\nThey should at once see Jolson,<br />\nAaronson, Miller or Perlman, or<br />\ndrop a note in P. 0. Box 265.<br />\nRespectfully submitted,<br />\nMEYER JoLsoN.<br />\n<br />\nvc<br />\n<br />\nSPRING Clothes that are soft, pliant,<br />\nN EW<br />\nand skillfully tailored; with collars that fit<br />\n<br />\nTo<br />\n<br />\nthe neck snugly and lapels that roll easily and<br />\ngradually. Ready for service at $30 upwards.<br />\nall<br />\n<br />\n211-213 E. BALTIMORE ST.<br />\n<br />\nye:<br />\n<br />\nye;<br />\nrei<br />\n<br />\nIt took<br />\nYEARSandYEARS<br />\n<br />\nto develop<br />\n<br />\nCAMEL<br />\n<br />\noum,rr<br />\n<br />\nWe worked on Camels for years before we<br />\nput them on the market. Years of testing<br />\nblending—experimenting with the world's<br />\nchoicest tobaccos.<br />\nAnd now,EVERY DAY,all our skill, manufacturing experience and lifelong knowledge<br />\nof fine tobaccos are concentrated on making<br />\nCamel the best cigarette that can be produced.<br />\nThere's nothing else like Camel QUALITY.<br />\nAnd there's nothing else like Camels wonderful smoothness,fine tobacco flavor and freedom<br />\nfrom cigaretty aftertaste.<br />\nThat's why Camel popularity is growing<br />\nfaster than ever.<br />\nA better cigarette cannot be made.<br />\nWe put the UTMOST QUALITY into<br />\nTHIS ONE BRAND.<br />\n<br />\nYoung Men's Clothing<br />\nand Furnishings<br />\n<br />\ned<br />\ndei<br />\ninc<br />\nsh(<br />\novi<br />\n<br />\nth(<br />\nGr<br />\n<br />\nDe<br />\nSc]<br />\n<br />\nCo<br />\nD(<br />\nCo<br />\nSo<br />\nNi<br />\n<br />\nSu<br />\n<br />\nCo<br />\n<br />\ncrf<br />\n<br />\nin<br />\n44'<br />\nof<br />\n7<br />\npr<br />\n77<br />\n<br />\nas<br />\n<br />\nye<br />\n<br />\nto<br />\n<br />\nflic<br />\n<br />\nth(<br />\n<br />\nsi)<br />\nrei<br />\n<br />\nen<br />\nTI<br />\nto<br />\n<br />\nar,<br />\n<br />\npa<br />\nric<br />\nPE<br />\nN(<br />\nva<br />\n<br />\nJo<br />\n23<br />\nrei<br />\nscl<br />\nCc<br />\nBt<br />\n<br />\nSt<br />\nin<br />\nfe;<br />\npii<br />\noti<br />\n<br />\nre made a special feature of<br />\nhere.<br />\n<br />\n(ive us a call and let us become<br />\n<br />\nbetter acquainted for mutual<br />\n<br />\nLEMMERT<br />\nMADE TO ORDER<br />\nAND<br />\nFINISHED CLOTHES<br />\n<br />\nbenefit.<br />\n<br />\nSTEWART&<br />\nto n<br />\n<br />\nU.<br />\n<br />\nILA James iltsCrcery .t C.New tort.<br />\n<br />\nTURKISH &DOMESTIC<br />\nBLEND<br />\nCIGA<br />\n<br />\nPLAZA BUILDING<br />\n19 AND 21 EAST FAYETTE ST.<br />\n<br />\nD,<br />\nD,<br />\nC.<br />\n1.<br />\n<br />\nHoward at Lexington<br />\n<br />\nTTE S<br />\n<br />\nR. .1. REYNOLDS TOBACCO CO., Winston-Salem, N.C.<br />\n<br />\nri<br />\n31<br />\n<br />\nP,<br />\n<br />\ntn<br />\n<br />\n\f", "format": "basic_html", "processed": "he<br />\nTill<br />\nrs-<br /><br />\n:he<br /><br />\nof<br />\nng<br />\na<br />\nassttsime<br /><br />\nin<br />\nan<br />\nins<br />\ning<br />\niudr.<br />\nnilas<br />\nof<br />\nqr.<br />\nthe<br />\n[se,<br />\nil-<br /><br />\nits<br />\n41e,<br />\nfolght<br />\nque<br />\nof<br />\nvas<br />\nthe<br />\nw<br /><br />\nfor<br />\nivas<br /><br />\nBALTIMORE, MD., APRIL 7, 1922<br /><br />\nVOL. XXVI. No 45<br /><br />\nDARTMOUTH TEAM WINS ANNUAL REPORT IS ISSUED VARSITY AND NON-VARSITY<br />\nMEN SET FOR INTERFIRST PLACE IN TICKET<br />\nOF THE ACTIVITIES OF<br />\nSALE CAMPAIGN<br />\nCLASS MEET<br />\nTHE Y. M.C. A. AT HOPLafayette and Georgetown Capture SecFirst<br />\nTeam<br />\nMen to Run Separately.<br />\nKINS<br />\nMarchant Wins<br />\nond and Third.<br />\nIndividual Prize.<br /><br />\nOrganization Is Doing Great Work for<br /><br />\nThe final returns of the Spring<br />\nReligion and Social Good of<br />\nUndergraduate Body.<br />\nSport Ticket Sale Campaign<br />\nshowed<br />\nSaturday<br />\nwhich ended last<br />\nThe annual report for the year<br />\na total of $2,710 collected for 416 1921-1922 answers fully the ques$5 tickets and 315 $2 tickets. After tion of what the Hopkins Y. M. C.<br />\na rather inglorious start the cam- A. does for the University.<br />\npaign livened up towards the end<br />\nThe activities connected with the<br />\nwhen the competition between opening of the University come<br />\nleading teams became very keen. first. An index of two hundred<br />\nThe Dartmouth team, led by cards for room and board is prePearce Coady, which jumped into pared by the secretary after a perthe lead at the beginning of the sonal inspection of the addresses<br />\nfinal week, managed to hold first submitted to the office. This is<br />\nplace by a good maigin with $451. available for the students coming to<br />\nLafayette, captained by John Hopkins from out of town. Also<br />\nMarchant, carried off second place during the summer the hand-book,<br />\nhonors with $313, and George- better known as the Freshman<br />\ntown, led by 0. D. Collins, placed Bible, is published, 'containing<br />\nthird, with $253.<br />\nnecessary information about the<br />\nThe individual prize was won University and the student activby John Marchant, who sold tick- ities; about 800 are given out yearets to the value Of $245. 0. D. ly. At the opening reception, held<br />\nCollins was second, with $142, the first Friday in the fall term, the<br />\nwhile Coady, Brawner and Bald- undergraduates of Hopkins meet<br />\nwin, all of the Dartmouth team, for the first time together and are<br />\nare each credited with sales of addressed by the Deans of the two<br />\nslightly over $100. The individual<br />\nschools, and also by representatives<br />\nsales of these few men really acof the various student organizacounted for the standing of their<br />\ntions. Later in the month an inforrespective teams.<br />\nmal dinner at the Hopkins Club is<br />\nThe award for the winning<br />\nheld<br />\nfor the foreign students; eight<br />\nteam will be a silver loving cup,<br />\ndifferent<br />\ncountries were representand for the winning individual<br />\nby the students in the<br />\nyear<br />\nthis<br />\ned<br />\na Hopkins seal gold ring. Winners<br />\nat Homewood.<br />\ndepartments<br />\nvarious<br />\nof second and third individual<br />\nconstitutes<br />\nwork<br />\nreligious<br />\nThe<br />\nprizes, as well as captains of secaction.<br />\n\"Y's\"<br />\nthe<br />\nof<br />\nbody<br />\nmain<br />\nthe<br />\nond and third teams, will each reM. P.<br />\nH.<br />\nof<br />\nleadership<br />\nthe<br />\nUnder<br />\nceive a Hopkins song book. These<br />\nBible<br />\nthe<br />\nchairman,<br />\nas<br />\nDavidson,<br />\nawar'ds will be made at a later assecuring<br />\nin<br />\nfortunate<br />\nwas<br />\nClass<br />\nsembly this spring after the song<br />\nRev. Reynolds, of Baltimore, an exbooks have been published.<br />\nchaplain of the U. S. Army, as leadFour teams which did not place<br />\ner for the first term; after the middeserve<br />\nin the money, however<br />\nPrescommendation for passing the year exams Rev. Coale, of the<br />\ntake<br />\nto<br />\nBoard,<br />\nasked<br />\nwas<br />\nbyterian<br />\nCornell,<br />\n$100 mark. These were<br />\nillness<br />\nsevere<br />\na<br />\nto<br />\ndue<br />\nbut<br />\ncharge,<br />\n$168;<br />\nwith $192; Pittsburg with<br />\nAL I. T., with $160, and Maryland his work was assumed by Rev. McFederawith $102. Other leading teams Creary, of the Baltimore<br />\nled<br />\nwho<br />\nthe<br />\nof<br />\nweekChurches,<br />\ntion<br />\nwere Holy Cross, $93; Navy,$84;<br />\nRauschenbusche's<br />\nof<br />\nly<br />\ndiscussions<br />\nOregon, $82; Penn State, $49;<br />\nThere<br />\nYale,$47, and Syracuse, $42. Only \"Social Principles of Jesus.\"<br />\nto<br />\ntwenty<br />\nof<br />\nattendance<br />\nan<br />\nbeen<br />\nseven teams allowed themselves has<br />\nweekly<br />\nthese<br />\nat<br />\nmen<br />\nthe disgrace of having blank twenty-five<br />\nspaces opposite their names. meetings.<br />\nThese were Illinois, Ohio State, The deputation work, with P. B.<br />\nCalifornia, Colorado, North Caro- Stevens as chairman, has completed a very active year, visiting<br />\nlina, Missouri and Trinity.<br />\ncamthe<br />\nof<br />\n24 churches and talking to an estiWhile the success<br />\nof<br />\ngoal<br />\nthe<br />\nmated total attendance of 2,000<br />\npaign fell far short of<br />\n$15,000 and slightly short of the people. The general plan has been<br />\nexpected amount of $3,000, yet to present to the smaller out-ofthe campaign has done much for town churches the student aspect of<br />\nthe benefit of Hopkins. The Christianity, and for this work two<br />\namount realized is - sufficient to teams of four men apiece have been<br />\ninsure the financial support of all organized. Their work has reSpring sports, a thing that has not ceived state-wide attention.<br />\nbeen accomplished for the last<br />\nThe ry\" co-operates with the<br />\nfew years. It has also put more town churches in endeavoring to<br />\nHopkins spirit into the few men get the out-of-town men affiliated<br />\nWho actively participated.<br />\nwith their respective denominations.<br />\nRIFLE TEAM \"SHOOTING\" V. P. I.<br />\nAND OHIO STATE<br />\nOne of the strongest of the social<br />\nThe Hopkins rifle team is now activities in former years has been<br />\nengaged in dual matches with the the Americanization work done by<br />\nVirginia Polytechnic Institute and the Hopkins men among foreigners<br />\nOhio State University. Ten-men of Baltimore; this year, however,<br />\nteams are firing in each match. In the School Board of Baltimore has<br />\nthe first, all the rounds will be fired<br />\ntaken the work under supervision.<br />\nin the prone position. In the sec- Also<br />\nthe settlement houses, in which<br />\nond, the rounds will be fired off<br />\nfrom five to ten Hopkins 'students<br />\nin sitting, standing, kneeling and<br />\nformerly coached athletic teams,<br />\nProne positions. The results will<br />\nContinued on page 3, col 3<br />\nnot be known before a few days.<br />\nJOURNALISTIC CO TEST<br />\nIn the next issue of the News-Letter there will be published the details of a contest for the would-be journalists of<br />\nthe undergraduate body. A prize has been offered to the<br />\nwriter of the best news or editorial article for the NewsLetter.<br /><br />\nL<br /><br />\nCompetition Expected to Be Keen,<br />\nWith Many Entries.<br /><br />\nPRICE 5 CENTS<br /><br />\nVARSITY LACROSSE TWELVE READY<br />\nFOR INVASION OF ENGLISH TEAM<br />\nInterest at Fever Heat. Both Teams Have Demonstrated Prowess.<br />\nBritish Goal-keeper a Marvel. Frank Morley Expected to Star<br />\nThe attention of English and American lacrosse enthusiasts<br />\nwill be centered upon Homewood Field tomorrow, when the combined lacrosse teams of Oxford and Cambridge, fresh from their recent victories over the championship Lehigh team and the Penn<br />\nState stickmen, will meet the powerful twelve representing Johns<br />\nHopkins University. Intense interest has been indicated by a large<br />\nadvance sale of tickets, and lacrosse fans from Washington, Philadelphia, Annapolis and other nearby points will probably be a part<br />\nof the record crowd which is expected to be on hand when the referee's whistle announces the commencement of hostilities.<br /><br />\nThe Inter-Class Track Meet will<br />\nget under way this afternoon<br />\npromptly at 4.15 o'clock. The order<br />\nof events will be as announced in<br />\nlast Friday's issue, and the points<br />\nto be awarded are 5, 3 and 1 for<br />\nnon-varsity men, and 3, 2 and 1 for<br />\nvarsity men. All men will be eligible to competein thenon-varsity<br />\nevents with the exception of Clark,<br />\nAaronson, Thompson, R. Skinner,<br />\nWhile the English invaders<br />\nM. Skinner, Dorcus, Norwood, HOPKINS BALL TOSSERS EXshowing the Lehigh stickwere<br />\nEdwards, Somerville, Booth, MilPECTED TO TAKE GALfew points about the old<br />\na<br />\nmen<br />\nLAUDET INTO CAMP<br />\nligan, Holsopple, J. Shriver,<br />\nIndian<br />\ngame last Saturday, the<br />\nHearn, Wickham, Dixon, How- \"Herb\" Armstrong's Proteges Working to Wipe Out Sting of Last<br />\nBlack and Blue Varsity was demard, Freeman, Gilpin and HamWeek's Defeat.<br />\nits prowess by defeatonstrating<br />\nbleton.<br />\nThe Black and Blue ball tossers<br />\nFrom present indications, either will be strongly tested tomorrow ing the strong Alumni team, comthe Senior or Sophomore class at one o'clock, when Gallaudet Col- posed mostly of Mt. Washington<br />\nThe<br />\nshould emerge from the meet with lege will be met. , The Washing- players, by a 6-3 score.<br />\nthe greatest number of points. The tonians will no doubt be out to twelve showed much latent powFreshmen will also bear watching, avenge their 9-to-0 defeat at the er, both on the attack and the<br />\nwhile the Juniors, even though lim- hands of Hopkins last season, when defense, and, although a few<br />\nited in numbers, might upset the \"Bill\" Tucker literally stood them rough spots were visible to the<br />\ndope and spring some surprises. on their heads. Boatwright, who coaches, a week of intense trainFor the men listed above as the hurled against J. H. U. last year, ing has succeeded in rounding the<br />\nvarsity squad, this afternoon's meet will again probably be seen at team into a smoothly-running<br />\nwill be a serious matter, for it is Homewood, as will five other mem- machine.<br />\nlargely upon the results of this bers of the 1921 squad. At the<br />\nEye-witnesses of the game at<br />\nmeet that a man's eligibility for the present time the Gallaudet team South Bethlehem last Saturday,<br />\nEaster vacation trip will be deter- seems to be more or less of an from which the invaders emerged<br />\nmined.<br />\nuncertain quantity, for although it a 7-2 victor, report that the excelContrary o the usual custom of is reported that they have been lent physical condition of the<br />\nthe track mentors, no man will be showing up very well in practice Englishmen was responsible, in a<br />\nable to take the trip until he shall games, they were forced to bow to large part, for their decisive vichave satisfied certain requirements Catholic University by a count of tory. Their men, so it is said, are<br />\nfor his particular events. From the 13 to 5 in the initial contest of the older, heavier and more experiThis game, however, enced than the average American<br />\nlist of times given below, it will be season.<br />\nseen that the varsity men will have should not be taken as a criterion player, and, besides, display an<br />\nto hustle if they expect to enjoy of the strength of the Gallaudetians, excellent brand of teamwork.<br />\nthe balmy Southern air at Easter- as Catholic University presented, Penn State team was snowed<br />\ntide. Most of the men will have practically intact, her strong line- under by a 6-0 score.<br />\nto demonstrate their ability this af- up of last year.<br />\nThe work of Lett, the Oxford<br />\nIt is not considered likely that goal-keeper, stood out prominentternoon, so the quality of the meet<br />\nshould be much higher than here- there will be any change in the ly in both the Lehigh and Penn<br />\nlineup of the Hopkins team for to- State games. Using stickwork<br />\ntofore.<br />\nmorrow's game. The team looked as is seldom observed and divertTimes and distances required:<br />\nin the Dickinson game, with ing many baffling shots, this wellgood<br />\n100 Yards-102-5 sec.<br />\nof a few rough edges built Englishman made things<br />\nexception<br />\nthe<br />\n220 Yards-23 1-5 sec.<br />\nwhich Coach \"Herb\" Armstrong difficult for the Pennsylvanians'<br />\n440 Yards-53 1-5 sec.<br />\nhas been endeavoring to polish off attack, which found it nearly im880 Yards-2:04.<br />\nthis week in the long practices possible to get the ball past the<br />\nMile-4:40.<br />\nwhich have been held. With an crease. Lett was greatly aided by<br />\nTwo Miles-10:45.<br />\neven<br />\nnumber of the breaks of thc Frank Morley, former Hopkins<br />\n220 Low Hurdles-27 1-5 sec.<br />\ngame<br />\ncoming to Hopkins, it is not star defense man, who showed<br />\n120 High Hurdles-17 3-5 sec.<br />\nto predict victory tomorrow that many of the fine points<br />\namiss<br />\nShot Put-35 ft. 6 in.<br />\nfor<br />\nBlack and Blue tossers.<br />\nthe<br />\ntaught him by Coaches SchmeisDiscus-100 ft.<br />\nLineup:<br />\nser and Knipp had not been forJavelin-135 ft.<br />\nGallaudet—Seipp, ss.; Rose, c.; gotten.<br />\nHigh Jump-5 ft. 5 in.<br />\n2b.; Boatwright, rf. or<br />\nDanofsky,<br />\nBroad Jump-20 ft. 9 in.<br />\nIt is expected that members of<br />\np.; Bradley, lb.; Lucado, cf.; WalPole Vault-10 ft.<br />\nthe English Embassy will motor<br />\nlf.; Hawkins, 3b.; Lahn, p.<br />\nMore or less humor floats around lace,<br />\nHopkins — Grace, 2b.; Reif- over from Washington to cheer<br />\namong the spectators as their unShar- for their countrymen. A committrained friends compete .in an en- schneider, 3b.; Hayter, rf.;<br />\nRich, cf.; tee, of which Dr. Ronald T. Aberdeavor to uphold class honors. Th.. retts, lf.; Marrian or<br />\ncrombie is chairman, has been<br />\nevents this year will be far more Knecht, lb.; Thomas ss.; Holland,<br />\nOwings, Marchetti, formed and has charge of the enClayton,<br />\nc.;<br />\ninteresting to the non-varsity men,<br />\ntertainment of the Oxford team<br />\nbecause of the absence of the var- Tucker, McMillan, p.<br />\nsity stars, who generally managed HULLABALOO READY TO GO TO and distinguished guests. The<br />\nto win their events in spite of the<br />\nteam will be met at the station by<br />\nPRESS<br />\nhandicaps. For the varsity men, The material for the Hullabaloo a Hopkins delegation and band.<br />\nthe outlook is not so pleasant, for has all been collected and is comJohns Hopkins<br />\nOxford-Cambridge<br />\nthey will be forced to exert them- pletely arranged for publication.<br />\nRoutson or<br />\nC<br />\nLett<br />\nselves from start to finish in order<br />\nThe issue of this season will difBenedict<br />\nto retain their jobs on the team. fer from that of last year in that Clark<br />\n......P........ Bachman<br />\nTurner or<br />\nCP<br />\nThe meet will furnish a splendid each member of the Senior Class Morley<br />\nMoore<br />\nopportunity for every man to show will be assigned a full page, which Switzel .......F.D... ... Zoller<br />\nS D<br />\nBenedict or<br />\nhis class spirit and loyalty. If he is to contain a photograph, a snap- Mennie .<br />\nLandy<br />\ncannot compete, a man can at least shot, a list of the senior's activities, Hopkins ......T.D......Murphy or<br />\nCromwell<br />\nurge on his classmates, and there and an individual writeup.<br />\nC<br />\nBurnham or<br />\nCurrie .<br />\nMiddleton<br />\nis no reason why every undergradThese Writeups have been comBennet or Coats T A<br />\n. Huey or<br />\nuate should not be present.<br />\npleted and are in the hands of the<br />\nCoady<br />\nGriffis&amp;<br />\nS A<br />\nCoach Le Cato announces that it printers. It is likely that, if all Neilan<br />\nF A<br />\nMee<br />\n. Turnbull<br />\nis imperative that every man who group photographs have been Pearson<br />\n0 H.. Bauernschmidt<br />\nor Parsons<br />\nexpects to compete be at the field taken, the book will go to press<br />\nWansbrough .• •I• H.<br />\nMcDaniel or<br />\nin uniform by 4:15.<br />\nwithin the\"next week.<br />\nO'Connor<br />\n•<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 7, 1922<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\nHOPKINS DISTINGUISHED<br />\nSCIENTISTS<br /><br />\nFOUNDED 1897.<br /><br />\nDr. Ira Remsen was born in<br />\nNew York City, February 10, 1846.<br />\nHe received the degree of A. B. in<br />\n1865 from the College of the City<br />\nof New York. This was followed<br />\nby an M. D. at Columbia in '67.<br />\nDr. Remsen later received degrees<br />\nof LL. D. at a number of the lead-.<br />\ning universities of North America,<br />\nincluding Yale, Harvard, Toronto,<br />\nPrinceton, etc. From 1872 to 1876<br />\nhe was professor at Williams College. From that date until 1913<br />\nDr. Remsen was Professor of<br />\nChemistry at Johns Hopkins. In<br />\n1901 he was elected President of<br />\nthe University and he held that office until his resignation in 1913.<br />\nHe belonged to practically all the<br />\nforemost chemical and scientific societies in this country and abroad,<br />\nand has written a number of books<br />\nwhich have added greatly to the<br />\nliterature upon chemistry. Among<br />\nthem are \"The Principles of Theoretical Chemistry,\" \"The Elements<br />\nof Chemistry,\" \"Inorganic Chemistry,\" and \"Chemical Experiments.\" These books had a vast<br />\ninfluence in the study of the science<br /><br />\n$2.50<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br /><br />\nTelephone<br />\nEditor-in-Chief:<br />\nWILLIAM H. MOORE, JR., '23<br /><br />\nBusiness Manager:<br />\nGLOVER P. FALLON, '23.<br /><br />\nManaging Editor:<br />\nJ. HUDSON HUFFARD,'23<br />\nAssistant Managing Editor:<br />\nJOSEPH S. LEOPOLD, '24.<br /><br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br /><br />\nAssociate Editors:<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN,'23.<br />\nFITZGERALD DUNNING, '24.<br />\nPHILIP W. HOWARD, '25.<br />\nMILES D. MARRIAN, '25.<br />\nG. DONALD GIESKE, '25.<br />\nD. H. STEVENSON, JR., '25.<br /><br />\nJunior Editors:<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br />\nG. COCHRAN DOUR, '23.<br />\nT. CLYDE ROUTSON, '23.<br />\nR. C. TILGHMAN,'25.<br /><br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nBALTIMORE, MD., APRIL 7, 1922<br /><br />\nand at the time of publication<br />\nwere recognized as the best text<br />\nbooks on the subject. Indeed, his<br />\nworks were translated into almost<br />\nall the modern languages.<br />\nDr. Remsen is undoubtedly one<br />\nof the greatest chemists this country has produced. Perhaps more<br />\nthan any other man, he was responble for blasting the idea that the<br />\nreal study of chemistry was impossible outside of Germany. His<br />\ninfluence was felt all over the country through the trained men which<br />\nwere sent out after study under<br />\nhim.<br /><br />\nThe TheatreGuild<br />\nPresents a<br />\nSpecial Easter Holiday Festival<br /><br />\nBACK TO<br /><br />\nMETHUSELAH<br />\nBernard Shaw's Fantastic Comedy is<br />\nnow being given in cycles of three performances at the Garrick Theatre, New<br />\nYork. All three performances are given<br />\nin one week.<br />\n1st part, Mon. Tues. &amp; Tues. Mat.<br />\n2nd part, Wed. Thurs. &amp; Thurs. Mat.<br />\n3rd part, Fri. Sat. &amp; Sat. Mat.<br /><br />\nFOUND<br /><br />\nPRICES<br /><br />\nA gold watch containing a 3 parts, evenings, $9.90; $8.25; $6.60; $4.95.<br />\n3 parts, matinees, $6.60; $4.95; $3.30.<br />\nSwiss movement was found at Single parts at one-third the above rates.<br />\nathletic field by Mr. Middleton.<br />\nThe watch also bears a monoMail checks for reservations to<br />\ngram.<br />\nOwner may secure same by applying to Y. M. C. A. office or Ath- 65 West 35th St.<br />\nNew York city<br />\nletic Office.<br /><br />\nGARRICK THEATRE<br /><br />\nOur -prep- room on the<br />\nthird floor specializes in<br />\nclothes for young men.<br /><br />\nCotillon Board Dance<br />\nTomorrow Immediately<br />\nAfter Lacrosse Game<br />\nC. E. Hall<br />\nAdmission 50c per Couple<br /><br />\nhub<br />\nBaltimore. Charles and Fayette<br /><br />\nWE HAVE WITH US<br />\nTomorrow we will have as our guests a group of selected athletes, representing the two oldest universities in the world.<br />\nMost of them are obtaining their first impression of America on<br />\nthis trip. Thus far, they have invaded the lacrosse field of three universities and have come away with the victor's end of the spoils. We<br />\nhave reason to believe that things will not go so easily with them out<br />\nat Homewood Field tomorrow. The game should be hotly contested throughout and it is therefore essential that both rooters and<br />\nplayers make an especial effort to display good sportsmanship.<br />\nThe fact that an ex-Hopkins student and player is among the<br />\nvisitors should serve as an incentive to us to \"do him proud\".<br />\nThis international contest, more than all of the other games<br />\ncombined, will carry with it a great amount of advertising and comment concerning Johns Hopkins.<br />\nWe can afford to do nothing else than put our best foot forward.<br />\nLet's show the visitors from the old world what clean winners—or<br />\nwhat good losers we are.<br /><br />\nBut he's really trying out<br />\nfor Sales Manager<br />\nrr HE freshman<br /><br />\nSpeaking of the Oxford-Cambridge schedule, ask the \"Man Who<br />\nKnows\" Why Navy didn't book a game.<br /><br />\nWANTED<br />\nThe cheering at the games last Saturday, although good, lacked<br />\nthe force of supervised effort. The scattered groups of rooters were<br />\nenthusiastic and generous with their applause, but the result was<br />\nweak and would have been far more pleasing had their efforts been<br />\nconcentrated.<br />\nThrough the endeavors of the Sigma Chi Beta Honorary Society, last year, spring sport cheer-leaders were provided. Their<br />\nservices, with that of the band, served to produce a much smootherrunning rooting section.<br />\nInasmuch as our collection of yell-directors will be sadly depleted by the opening of next term, these spring games seem to offer<br />\nan excellent opportunity for the schooling of the new aspirants in<br />\nthe art of writhing and twisting.<br />\nThe position of Head Cheer Leader is one offering splendid occasions for an injection of personality. While at first consideration<br />\nthe office may not appear as exalted a one as that of fullback on<br />\nthe<br />\nfootball team or star, twirler on the nine, it should be<br />\nremembered<br />\nthat it can be made what its holder wills.<br />\nCheer Leader Mike Curley will be remembered long after<br />\nmost<br />\nof the \"star twirlers\" of his institution have faded into the<br />\nbackground of memory.<br />\nWe haven't had any new songs or.yells tried for some time. Spring's<br />\na good time to get that'out of yourveinsr too.<br /><br />\nPublished in<br />\nthe interest ofElectrical Development by<br />\nan Institution that will<br />\nbe helped by whatever helps the<br />\nIndustry.<br /><br />\nwho corn s out for baseball<br />\nmanager and who sticks is learning a lesson<br />\nwhich, whether or not it wins that honor for him,<br />\nshould win some honors in after life.<br />\nHe will learn that his plugging on the diamond,<br />\nhis efforts four years hence to get the upper hand<br />\non his first job, and after that his striving to climb<br />\ninto the managerial and executive class are all<br />\npart of the same game.<br />\nNow,just as ten years from now, he will have<br />\nto do many things that are hard, many things that<br />\nare unpleasant. The more willing he is, the more<br />\nwork will other men put upon him. But by that<br />\nhe grows.<br />\nThe rewards after college are given on about the<br />\nsame basis as now. Theygo to the man who besides<br />\ndoing his main job well,still has the time to reach<br />\nout after other work and the spirit that masters it.<br />\nHere is where this comes home to you. Don't<br />\nbe content with standing high in the classroom.<br />\nSupport your college activities and go after some<br />\ncampus honors too. This broadening of your<br />\ninterests will become a habit that in .after life will<br />\nprove a mighty big help.<br /><br />\nestern Electric companv<br />\nSince 1869 makers and distributors ofelectrical equipment<br /><br />\nNumber 16 of a series<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 7, 1922<br />\nRIFLE TEAM MAY BE VOTED<br />\nRECOGNITION BY A. A.<br />\nASSOCIATION<br /><br />\nPROFITABLE CONTEST FOR UNDERGRADUATES IS OFFERED<br />\nBY \"THE OUTLOOK\"<br /><br />\nDRAMATIC CLUB ELECTS 20 NEW<br />\nSPORT WEAR<br />\nMEN TO ORGANIZATION<br /><br />\nFULL DRESS<br /><br />\nAt a meeting of the Dramatic<br />\nlast Tuesday, the men who<br />\nClub<br />\nResolution to Be Placed Before Stumembership<br />\nthrough their parwon<br />\nTeam<br />\nHas<br />\ndents at Mass-meeting.<br />\nSuccessful Season.<br />\nticipation in the cast of \"If I Were<br />\nKing\" were elected. They are: H.<br />\nAt a meeting of the Athletic<br />\nTaylor White, Wm. H. Moore,<br />\nS.<br />\nBoard, which was held April 3,<br />\nJr.,<br />\nDonald Kirkley, Charles Evthe Johins Hopkins Rifle Team was<br />\nter so much what college faculties ans, Hugh Smallwood, Fred Rich,<br />\nrecommended for recognition to<br />\nthink about athletics. It is what Carl Buckheister, Hugh English,<br />\nthe Athletic Association. The Asthe undergraduate thinks that is W. C. Gardner, Thomas Jenifer,<br />\nEnglish Clothes Tailored in America<br />\nsociation is to vote upon the recogS30 to SI-5<br />\nreally vital.\" It is the purpose of Edward Mount, Philip Sachs, Nelnition May 4. After a brief introthis<br />\nhelp<br />\nto<br />\nothers<br />\nto<br />\nknow<br />\ncontest<br />\nson Young, John Croker, Clarence<br />\nduction by Dr. Abercrombie and a<br />\nthe trend of this undergraduate Adams, Howard Reaney, Henry<br />\nMt. Vernon 4999<br />\ndetailed explanation by Major<br />\nopinion.<br />\njoesting, George M. Shriver, Jr., \"Queen Quality\" Home Made<br />\nGarey, the following resolution was<br />\nSome of the questions which Isaac Hamburger II, and John<br />\nadopted: \"A Varsity H may be<br />\nChocolates<br />\nmaterially aid those partici- Sherwood.<br />\nshould<br />\nVISIT OUR ICE CREAM PARLORS<br />\nawarded to a member, or qualifying<br />\nThe club will !hold its annual<br />\n518 N. CHARLES ST.<br />\nmembers, winning an intercollegi- pating in the contest are:<br />\nCommercial Photography<br />\non Tuesday, April 11,<br />\nplace<br />\nof<br />\nthe<br />\nbanquet<br />\nin<br />\nathletics<br />\nis<br />\nWhat<br />\nate championship, or to individuals<br />\nCircuit Photography<br />\nHotel.<br />\nFlash Lights<br />\nViews<br />\nwinning first place. An H R T education? What constitutes the probably at the Emerson<br />\nmembers of<br />\nactive<br />\nthe<br />\nBesides<br />\nIs<br />\nit<br />\nspirit?<br />\namateur<br />\nendangered<br />\nparticmembers<br />\nto<br />\nawarded<br />\nGroups<br />\nEnlargements<br />\nmay be<br />\nCharles and 22nd Sts.<br />\nfollowing alumni<br />\nKODAK FINISHING<br />\nipating in seventy-five per cent. of by proselyting? By athletic \"schol- the club, the<br />\nDelicious Sodas and Sundaes<br />\nand honorary members will atarships\"? By professionalism?<br />\n325 N. Howard St.<br />\nall matches.\"<br />\nThe Best of Candies<br />\nIs too much emphasis, or too lit- tend the banquet: Harry Morriss,<br />\nAccording to Article V of the<br />\nPrompt &amp; Efficient Service<br />\nDonald Mossom, Terry Berger,<br />\nConstitution of the Athletic Asso- tle, placed upon sport? Should the<br />\nSmith, Jr., and Miss Clemciation, \"Amendments to the Con- present system of intercollegiate Frank<br />\nWalter, all of k‘rflom are<br />\nentine!<br />\nElkridge Farms Dairy<br />\nstitution and By-Laws shall be pro- athletics be modified? How?<br />\nAdvisory<br />\nAlumni<br />\nof<br />\nthe<br />\nmembers<br />\nSTRICTLY FRESH MILK<br />\nposed at a general meeting of the<br />\nW. University Parkway<br />\nWhat does the undergraduate<br />\nCouncil; Mr. Walter B. Swindell,<br />\nAssociation, and shall stand, if think of the ethical standards and<br />\nOpposite J. H. U. Athletic Field<br />\nPasteurized and Bottled<br />\nJr., the producer of \"If I Were Produced,<br />\nin Howard County<br />\nunanimously approved by the As- attitude of sport writers? What<br />\nDRUG STORE for J. H. U. BOYS<br />\nKing,\" Holmes Boyde, H. J.<br />\nsociation. Otherwise, they shall lie does he think of newspaper pubEllicott City 231 -R<br />\nCLARK BROS.<br />\nand<br />\nTrew.<br />\nBartus<br />\nGrins<br />\nfelder<br />\nPHONE, HOMEWOOD 2121<br />\nover until a second meeting, when licity?<br />\nof<br />\nAs<br />\nthe<br />\nis<br />\nofficers<br />\ncustomary,<br />\na two-thirds vote of those present<br />\nIt is not desired that those who the club for next year will be electBuy an (H) Pipe made special<br />\nshall be necessary for their adopfor prizes should attempt to ed at the banquet. Also the electry<br />\ntion. These meetings shall be adfor the Boys<br />\nanswer all the questions—in fact, it tion of the Advisory Council of<br />\nvertised and proposed amendments is not necessary to answer any of<br />\n1922-23 will be held.<br />\nLIBERTY ST. at SARATOGA<br />\npublished in the University papers<br />\nthose listed. They are merely sugThe club has decided to present<br />\n(Opposite Hotel Rennert)<br />\nat least two weeks before being<br />\nORDERS RECEIVED FOR<br />\ngestions.<br />\nLUNCHEON—:—DINNER<br />\nMr.<br />\nSwindell<br />\nhandsome<br />\nwith<br />\na<br />\nheld.\"<br />\nCOGGINS'<br />\n11:30 until 7:30<br />\nThe prizes offered are: $25, $20, leather traveling case in recogniThe members of the Athletic AsDANCES Transfer and Baggage Express<br />\nSMOKERS<br />\nBANQUETS<br />\nsociation by Article II, Section 2, $15, and seven prizes of $10. The tion of his untiring services to the<br />\nBy Arrangement<br />\nAUTOMOBILE SERVICE<br />\nTelephone St. Paul 6987<br />\nPHONE, HOMEWOOD 2645-W<br />\nis composed of \"The active roll contest is subject to the following club during the past year.<br />\nshall be \"all registered members conditions: 1. Only college underof the University paying the gym- graduates are eligible. 2. Name A. A. BOARD AWARDS MINOR \"H\"<br />\nand address with college and class<br />\nnasium locker fee.\"<br />\nDo you know how best to provide<br />\nAt the meeting of the Athletic<br />\nis to be placed in upper lefthand<br />\nfirst,<br />\nAre You Planning A<br />\nan income for your old age?<br />\nDr. Abercrombie spoke<br />\nBoard, on April 3, the following<br />\nConsult with<br />\nVACATION ABROAD?<br />\nbringing to attention the fact that corner of letter. 3. All letters must<br />\nmembers of the cross-country team<br />\npaper<br />\non<br />\nof<br />\none<br />\ntypewritten<br />\nside<br />\nbe<br />\nasthe R. 0. T. C. has thus far<br />\nW. W. WALKER<br />\nIf So, Call on<br />\nwere recommended and awarded<br />\nsumed all responsibility of the Rifle only. 4. Letter must not be over their H. C. C.: Captain W. H.<br />\n909 Calvert Bldg. St.Paul 2581<br />\nTeam, in which it expended seven 600 words in length. 5. The letter Somerville and W. R. Edwards, A. SCHUMACHER &amp; CO.<br />\nhundred dollars of its own money, must reach the Outlook office before both wearers of the H.; Milligan,<br />\nPASSENGER<br />\nIt has won twelve out of thirteen April 15, 1922. 6. The right is reAGENTS<br />\nR. Fenton and Manager Fortney.<br />\nJ. F. APPLE CO.<br />\nmatches, Yale University being the served to purchase for publication<br />\nfor all<br />\nThe board decided to send a spewinning<br />\nnot<br />\nletters<br />\nLancaster, Pa.<br />\ndesirable<br />\nsole victor.<br />\nTrans-Atlantic Lines<br />\nPalmer<br />\nto<br />\nthanks<br />\nof<br />\nMr.<br />\ncial<br />\nletter<br />\nwill<br />\nletters<br />\nMANUFACTURING<br />\nUnavailable<br />\nJEWELERS<br />\n7.<br />\nprizes.<br />\nthe<br />\nin<br />\nthat<br />\nstated<br />\nMajor Garey<br />\nin<br />\nhis<br />\nwork<br />\nof<br />\nin<br />\nbeappreciation<br />\nof<br />\nMakers<br />\nof<br />\nJewelry.<br />\nHopkins<br />\nstaff<br />\nThe<br />\n8.<br />\nbe<br />\nreturned.<br />\nnot<br />\nHopJohns<br />\nintercollegiate matches,<br />\nCharles &amp; Redwood Sts.<br />\nWrite for Special Designs and Prices<br />\nSale.<br />\nTicket<br />\nSpring<br />\nof<br />\nthe<br />\nhalf<br />\njudges.<br />\nbe<br />\nwill<br />\nThe<br />\nOutlook<br />\ndefeating<br />\nkins won eighth place,<br />\nCall at University P. 0. for<br />\nAll letters should be addressed to Also, Mr. Wilmer Ray was conYale University by two points. He<br />\nInformation.<br />\non the progress of the<br />\nalso said that of all athletic con- \"Contest Editor, The Outlook Com- gratulated<br />\ncampaign.<br />\ntests with which he had had con- pany, 381 Fourth Avenue, New<br />\nThe board will vote on the resYork<br />\nCity.\"<br />\nnection, \"there is none which reolution to recognize the Rifle Team<br />\nquires such co-operation of the<br />\nas a minor sport. The men of the<br />\nmembers as the Rifle Team.\"<br />\nBIG<br />\ncannot be awarded their letIN<br />\nteam<br />\nREPRESENTED<br />\nHOPKINS<br />\nrecwho<br />\nuniversities<br />\nthe<br />\nSome of<br />\nMEN'S SHOES<br />\nORATORICAL CONTEST<br />\nuntil an amendment is<br />\nthough,<br />\nter,<br />\nminor<br />\nas<br />\nteams<br />\nrifle<br />\nognize their<br />\nITY or rent a Corona<br />\nOf the Better Class<br />\ntypewriter on easy<br />\nthe<br />\nto<br />\nadded<br />\nto<br />\nrecogconstitution<br />\nConOratorical<br />\nColumSouthern<br />\nThe<br />\nTech,<br />\nsports are Carnegie<br />\npayments. Carry it to<br />\nschool every day in its<br />\nbia, Cornell, Georgetown, Georgia test will take place tomorrow, April nize the Rifle Team.<br />\nneat case. Make extra<br />\nNashUniversity,<br />\nUniVanderbilt<br />\nthe<br />\nat<br />\n8,<br />\nTech, Syracuse, Yale and<br />\nmoney writing articles or<br />\ndoing typing for others!<br />\nANNUAL Y. M. C. A. REPORT<br />\nversity of Pennsylvania. Upon the ville, Tenn. Hopkins is to be repCalltoday atthe nearest<br />\nBROTHERS<br />\nURNER<br />\nAlMr.<br />\nby<br />\ncontest<br />\nContinued from page 1<br />\nbasis of these facts, Major Garey resented in the<br />\nCorona store—or teleIII E. BALTIMORE STREET<br />\nphone for a demonstrarequested that minor sport letters bert J. Langeluttig, Jr., '22. Mr. have been discontinued. The one<br />\nBALTIMORE<br />\nat your home.<br />\ntion<br />\nbe awarded the team and if cham- Langeluttig has chosen as his sub- big accomplishment in the social<br />\nM. W. LUCY &amp; CO.<br />\npions of the United States the letter ject \"The Senate and Treaty-mak- field has been the raising of $450<br />\nGould,<br />\nTheodore<br />\ning<br />\nPower.\"<br />\n118 W. Fayette St.<br />\nawarded.<br />\nH be<br />\nfor the Student Friendship Fund,<br />\nwinner<br />\nof<br />\nprize<br />\nChurch<br />\nEpiscopal<br />\nThe<br />\nabove<br />\nsecond<br />\n'21,<br />\nthe<br />\nHopkins,<br />\nthat<br />\nfact<br />\nDue to the<br />\naid given to the students of Central<br />\nWeighs Oilbs.<br />\namendment to the constitution of of last year's contest, is now presi- Europe, who are still struggling to<br />\nFolds and fits<br />\nSt. Michael and All Angels<br />\na neat carryin<br />\nthe Athletic Association is to be dent of the Southern Oratorical reconstruct their physical and eduing case.<br />\nST. PAUL and TWENTIETH STS.<br />\nvoted upon May 4, it is requested League. Mr. Gould has been called cational life. Finally, is the wellSAn with<br />\n\"ow Case<br />\nadof<br />\nAssociaupon to rule on the question<br />\nthat every member of the<br />\nknown care of the reading room at Wyatt Brown, D.D., Litt.D., Rector<br />\ntion should be present and record mitting Sewanee University in the the Barn, supplying magazines, Holy Communion at 7.30<br />\nplace of the University of Alabama, checkers and chess, a piano and a Young Men's Bible Class, 9.30<br />\ntheir respective vote.<br />\nwhich recently withdrew from the victrola.<br />\nMorning Service, 11 o'clock<br />\nThe Personal Writing Machme<br />\nY. M. C. A. TO HOLD ELECTION OF league.<br />\nEvening Service, 8 o'clock<br />\nof<br />\nmany<br />\nfields<br />\nare<br />\nthere<br />\nWhile<br />\nNEW OFFICERS<br />\nThe Adams Public-speaking activity the Hopkins \"Y\" has not Special Invitation to Hopkins Students<br />\nAn election of officers for the<br />\nwill be held at Assembly on touched, the record of the year<br />\nContest<br />\nHopkins Y. M. C. A. Cabinet will April 20. The contestants for the<br />\n1921-1922 contains evidence of the<br />\ntake place in Room 104, M. E. Adams Medal are Rignal Baldwin,<br />\nvalue of this organization in relaST. DAVID'S<br />\nBuilding, at 12.30, Tuesday, April Arthur Koff, C. Moninonier and<br />\nHomewood,<br />\nat<br />\nstudent<br />\nthe<br />\nto<br />\ntion<br />\nProtestant Episcopal Church<br />\n11. All men who have participated<br />\nof Baltimore.<br />\nRodman.<br />\nlife<br />\nMorris<br />\nreligious<br />\nthe<br />\nand<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nin \"Y\" work at the University and<br />\nbe<br />\nwill<br />\nContest<br />\nThe<br />\nTocqueville<br />\nintention<br />\ntheir<br />\nRoland Park<br />\nWho have declared<br />\nCHAS. E. HERRING<br />\nof joining are invited to atterid the held at the Assembly of May 4.<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\nAlbert Dimond, E. L. Putzel, John<br />\nYour Caterer at Hopkins Dances<br />\nelection.<br />\nSUNDAY SERVICES<br />\nO'Keefe and E. F. Wolfe have been<br />\nMeet Your Friends in my<br />\ncontest.<br />\nthis<br />\nin<br />\nparticipate<br />\nto<br />\nchosen<br />\nBalcony—Soda Booths<br />\nThe Pi Kappa Chi Fraternity<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\nannounces with pleasure the pledg- The subject for this year is \"France S. E. Cor. Maryland and North Ayes.<br />\n8 P. M.—Choral Evening Prayer<br />\nDANCING<br />\nAs a Democracy.\"<br />\nMUSIC<br />\ning of C. Ely Wickham, '25.<br />\nThe Outlook magazine has recently offered ten prizes for the<br />\nbest letters of six hundred words<br />\nor less from college undergraduates<br />\non Intercollegiate Athletics. The<br />\nOutlook feels that \"it doesn't mat-<br /><br />\nf Cusiom Quality.<br />\nN,ChurtesStreet_<br /><br />\nORTMAN'S<br /><br />\nW.L. Mann<br /><br />\nChelsea Pharmacy<br /><br />\nR.G.by &amp; Company<br />\n1<br /><br />\n111111111111111111•111111•1111\\<br /><br />\nURNER'S<br /><br />\nTeachers!<br />\nB<br /><br />\nCoRoNA<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 7, 1922<br /><br />\n4<br /><br />\nThe Medical Standard Book Co. 4:8:€4:9)4)4)4iKea4)4:6:8:€1)4:oce:E4:8)3:8)4:6)3:koo of-town men as well as Baltimor4)<br />\neans, to come together in social<br />\n(THE BOOK MART)<br />\n(Trietas to fly<br />\ncommunion to have a good time;<br />\nas this is exclusively a Hopkins afComplete Stock of<br />\n8<br />\nMedical Books and College<br />\nC828:928N:8:8:8:928X(3:ECECO:9:61:428:19:8:8:8:8:3 fair and a real Hopkins affair at<br />\nRequisites<br /><br />\nUNBECOMING CONDUCT AT<br />\nASSEMBLY<br /><br />\nImporters and Dealers in Fine Books<br /><br />\nEditor of the News-Letter,<br />\nDear Sir :<br />\nBaltimore, Md.<br />\nI should like to publicly give<br />\n'expression to some of the feelings<br />\naroused in the minds of many of<br />\nthe students after the disgraceful<br />\nexhibition of lack of courtesy<br />\ngiven to Mrs. Wright at a recent<br />\nAssembly during the latter<br />\n\",.ar<br />\npart of her interesting lecture<br />\non Alaska. A person possessing<br />\nXatterievy)<br />\nany of the inherent qualities of a<br />\n4elbem<br />\n`Ldl • Es H.N, OSCAR<br />\ngentleman cannot help but proOWNERS<br />\n1,4?<br />\ntest against shameful breaches of<br />\nADEt\" stre4 r'1P<br />\n'<br />\n°<br />\ncourtesy such as have just been<br />\n29 Baltimore St., East<br />\nwitnessed.<br />\nOne Door West of Light St.<br />\nThe worst of it is that it is not<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\nonce or twice that the speaker has<br />\n(Greek Letter Societies)<br />\nbeen treated disrespectfully, but<br />\nthe same thing happens almost<br />\ninvariably every Thursday. It is<br />\nThe Chas. Willms Surgical<br />\ncertainly time to call a halt. DurInstrument Co.<br />\n300 N. HOWARD ST., Baltimore, Md. ing the last fifteen minutes of the<br />\nSURGICAL INSTRUMENTS<br />\nlecture Mrs. Wright was comMicroscopes and Supplies,<br />\npelled to attempt to talk above<br />\nStethoscopes<br />\nBlood Lancets a great many whispered converBlood Counters<br />\nsations being carried on in different parts of the room. In addition<br />\nto this the entire assemblage was<br />\nmore or less restless, chairs creakl'rinters of Philological and<br />\ning and unnecessary personal exScientific Works<br />\nhibitions of boredom • being ob23 S. HANOVER ST.<br />\nserved.<br />\nLaltimore, Md.<br />\nSome excuse for the discourtesies on the part of the students<br />\nmight be offered when it is considered that half of the dinner<br />\nhour was taken up by the lecture.<br />\nAll the students are very jealous<br />\n9<br />\nof their forty- minutes for lunch<br />\nand hate to lose any time from<br />\nthis all too short period. I think<br />\nthat the authorities should make<br />\nt very plain to the lecturer that<br />\n17 E. Baltimore St.<br />\nhe should finish by 12.20. If this<br />\nwere seen to, the students would<br />\nbe only too glad to give rapt attention to any subject under discussion for forty or fifty minutes.<br />\nPrinters of the<br />\nBut whatever action is taken or<br />\nJohns Hopkins News-Letter<br />\ns not taken, let us all co-operate<br />\nn giving the assembly speakers<br />\n; n enthusiastic reception and<br />\n!\"exfteztoVitede\" /I<br />\ni ourteous attention, and let us<br />\nI ot forget that it is through our<br />\n. \\ . -,- THE'<br />\n; ssemblies that visitors get their<br />\ni 4C, ti%-irr<br />\ni mpressions of us.<br />\n:A'-1P01<br />\nYours for J. H. U.<br />\nPROGRESS.<br />\n301 N. CHARLES ST.<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br /><br />\n]N<br /><br />\n,<br /><br />\nREGARD TO THE ZIONIST CLUB<br />\nDANCE<br /><br />\nditor-in-Chief of NEWS-LETTER.<br />\nDear Sir: It is the custom of<br />\n1341411N<br />\n°<br />\n4<br />\nt he Johns Hopkins Zionist Society<br />\nI o give an annual spring dance to<br />\n(<br />\nelebrate both the passing of bleak<br />\nCollege Literature<br />\nvinter<br />\nand the advent of happy<br />\nLOMBARD.and SOUTH STREETS 1<br />\n5 pring. The affair this year will be<br />\n,<br />\niven on Saturday night, April 8,<br />\nt the Civil Engineer*. Hall. As<br />\nhis<br />\nt<br />\ndate is four days before the<br />\nSHOES<br />\nI aster recess begins, an opportunity<br />\nfor<br />\nis afforded to all the students—outUNIVERSITY MEN<br />\nI<br /><br />\nFor Dress<br />\nFor Sport Wear<br />\nSmart Styles—Best Leathers<br />\nModerate Price.;<br /><br />\nWYMAN ,<br />\n19 W. LEXINGTON ST.<br /><br />\nthat, there is no reason why any<br />\nstudent should stay away.<br />\nAll arrangements have been completed; tickets have been distributed ; invitations have been sent out<br />\nto the alumni and medical school<br />\nstudents, and large representations<br />\nof these are expected. It is very<br />\nprobable that there are some who<br />\nhave not yet obtained their tickets.<br />\nThey should at once see Jolson,<br />\nAaronson, Miller or Perlman, or<br />\ndrop a note in P. 0. Box 265.<br />\nRespectfully submitted,<br />\nMEYER JoLsoN.<br /><br />\nvc<br /><br />\nSPRING Clothes that are soft, pliant,<br />\nN EW<br />\nand skillfully tailored; with collars that fit<br /><br />\nTo<br /><br />\nthe neck snugly and lapels that roll easily and<br />\ngradually. Ready for service at $30 upwards.<br />\nall<br /><br />\n211-213 E. BALTIMORE ST.<br /><br />\nye:<br /><br />\nye;<br />\nrei<br /><br />\nIt took<br />\nYEARSandYEARS<br /><br />\nto develop<br /><br />\nCAMEL<br /><br />\noum,rr<br /><br />\nWe worked on Camels for years before we<br />\nput them on the market. Years of testing<br />\nblending—experimenting with the world's<br />\nchoicest tobaccos.<br />\nAnd now,EVERY DAY,all our skill, manufacturing experience and lifelong knowledge<br />\nof fine tobaccos are concentrated on making<br />\nCamel the best cigarette that can be produced.<br />\nThere's nothing else like Camel QUALITY.<br />\nAnd there's nothing else like Camels wonderful smoothness,fine tobacco flavor and freedom<br />\nfrom cigaretty aftertaste.<br />\nThat's why Camel popularity is growing<br />\nfaster than ever.<br />\nA better cigarette cannot be made.<br />\nWe put the UTMOST QUALITY into<br />\nTHIS ONE BRAND.<br /><br />\nYoung Men's Clothing<br />\nand Furnishings<br /><br />\ned<br />\ndei<br />\ninc<br />\nsh(<br />\novi<br /><br />\nth(<br />\nGr<br /><br />\nDe<br />\nSc]<br /><br />\nCo<br />\nD(<br />\nCo<br />\nSo<br />\nNi<br /><br />\nSu<br /><br />\nCo<br /><br />\ncrf<br /><br />\nin<br />\n44'<br />\nof<br />\n7<br />\npr<br />\n77<br /><br />\nas<br /><br />\nye<br /><br />\nto<br /><br />\nflic<br /><br />\nth(<br /><br />\nsi)<br />\nrei<br /><br />\nen<br />\nTI<br />\nto<br /><br />\nar,<br /><br />\npa<br />\nric<br />\nPE<br />\nN(<br />\nva<br /><br />\nJo<br />\n23<br />\nrei<br />\nscl<br />\nCc<br />\nBt<br /><br />\nSt<br />\nin<br />\nfe;<br />\npii<br />\noti<br /><br />\nre made a special feature of<br />\nhere.<br /><br />\n(ive us a call and let us become<br /><br />\nbetter acquainted for mutual<br /><br />\nLEMMERT<br />\nMADE TO ORDER<br />\nAND<br />\nFINISHED CLOTHES<br /><br />\nbenefit.<br /><br />\nSTEWART&amp;<br />\nto n<br /><br />\nU.<br /><br />\nILA James iltsCrcery .t C.New tort.<br /><br />\nTURKISH &amp;DOMESTIC<br />\nBLEND<br />\nCIGA<br /><br />\nPLAZA BUILDING<br />\n19 AND 21 EAST FAYETTE ST.<br /><br />\nD,<br />\nD,<br />\nC.<br />\n1.<br /><br />\nHoward at Lexington<br /><br />\nTTE S<br /><br />\nR. .1. REYNOLDS TOBACCO CO., Winston-Salem, N.C.<br /><br />\nri<br />\n31<br /><br />\nP,<br /><br />\ntn<br /><br />"}], "field_media_file": [{"target_id": 37619, "display": null, "description": null, "target_type": "file", "target_uuid": "05dcf9a7-7f02-488d-bd53-51558a7e614b", "url": "http://digital.library.jhu.edu/system/files/2022-03/12999-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12999, "target_type": "node", "target_uuid": "42cd6649-7020-49a8-9ebe-b81c73a920a7", "url": "/node/12999"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "07f3b0bb-d0e5-4815-a73c-79f2c9e88c5a"}]}