{"mid": [{"value": 37683}], "uuid": [{"value": "2d866457-f352-42ee-a1db-65b664507597"}], "vid": [{"value": 37683}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:37:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12213-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:37:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:37:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "H. L. F.<br />\n<br />\nNO ONE will be admitted to today's mid-day informal musicale<br />\nafter 1:30 P. M.<br />\n<br />\nVol. XXXV, No. 23<br />\n<br />\nON THE LIBERALISM<br />\nOF MR. SCHAAL<br />\nPage 2<br />\n<br />\nTHE JOHNS HOPKINS UNIVERSITY, HOMEWOOD, BALTIMORE, MD., JANUARY 13, 1931<br />\n<br />\nPrice 5 Cents<br />\n<br />\nCOLLEGE BOARD ABOLISHES CREDIT SYSTEM<br />\nCotillion To<br />\nNEW STICK RULING Frosh Blood Pressure Decreases, FRAT INITIATIONS Second<br />\nBe Held February 3 CHANGE IN<br />\nStrength Increases, Report Says SET FOR THURSDAY<br />\nTO BE ATTEMPTED<br />\nAT JOHNS HOPKINS Statistics From Medical Department Reveal That Freshman AT O.D.K. ASSEMBLY The Mid-Year Cotillion will be FOR FINAL<br />\nDance Music To Be Furnished By T.<br />\nWorth Murphy And His<br />\nJoy Boys<br />\n<br />\nSTUDY<br />\nYEARS<br />\nEFFECTIVE IN '32<br />\n<br />\nheld on Tuesday evening, February<br />\n3,<br />\nat the ballroom of the Maryland<br />\nTaken<br />\nNames of Those To Be<br />\nCasualty<br />\nClub. T. Worth MurIn Will Not Be Divulged Until<br />\nphy<br />\nand<br />\nhis Belvidere band will<br />\nthe Day of Initiation<br />\nIn spite of the fact that the Class<br />\nThe total number of examinafurnish the music.<br />\nFew Elective Subjects and<br />\nof '34 is six-hundredths of a year tions, made totalled some 607, of<br />\nTHREE PLAYERS CUT<br />\nFavors are to .be given to the Comprehensive Exam To Reyounger than its predecessors of the which 324 are of the first year en- DR. J. S. AMES WILL BE<br />\nUNDER NEW RULES<br />\nyoung ladies, and a number of speplace Credits<br />\nlast twenty-five years have been, it tering students. Of these 146 are<br />\nPRINCIPAL SPEAKER cialty dances<br />\nare on the program.<br />\nthe Physical Training Unit and<br />\nThe charge for admission is $2.50 MANY NEW COURSES<br />\nSpectators Nearer to Field; is four and twenty-four thousandths in<br />\n178 in the R. 0. T. C. Dr. Aber- Edwin Lockard, Robert Kyle, per<br />\nunits<br />\nbigger<br />\nand<br />\nstronger.<br />\nIts<br />\nblood<br />\nTO BE INSTITUTED<br />\ncouple and $2.00 stag.<br />\nCan Watch Game<br />\npressure has decreased 9.76 milli- crombie, in commenting on the low John Heinzerling and John<br />\nMore Closely<br />\nmeters of mercury, systolic, with a percentage of the group infected by<br />\nYellot Are Members<br />\nAnnual Military Ball Aim of Collegiate Board Is for<br />\ncorresponding drop of 1.88 milli- ringworm, said the average of less<br />\nHomewood Field, this spring,<br />\nSet For February 27 Greater Specialization of<br />\nthan one per cent was in \"wondermeters diastolic.<br />\nan<br />\nexperiment<br />\nscene<br />\nwill be the<br />\nof<br />\nCollege Study<br />\nAt Thursday's Assembly the<br />\nThese, in part, are the figures re- ful contrast\" to the percentages at<br />\nAdmission To The Dance, Which Is<br />\nwhich may have a deeply imporSponsored By the Officers' Club<br />\nvealed by a physical examination of other institutions where fifty to Omicron Delta Kappa Honorary<br />\ntant effect upon the game of<br />\nAbolition of the present, credit<br />\nWill Be $1.50<br />\nthe yearlings, made by Dr. Aber- ninety per cent infection is reported. Fraternity will initiate its new memThe date for the annual Military system at the Johns Hopkins Unilacrosse as played in America,<br />\ncrombie and his staff at the beginWould Bring 314.56<br />\nbers. The initiation will be public Ball has been definitely set for FriCanada and England, according<br />\nversity was effected last Saturday<br />\nfacts, however, imply and will be witnessed by the stu- day,<br />\nThe<br />\nabove<br />\nning<br />\nof<br />\nthe<br />\nyear.<br />\nacademic<br />\nThey<br />\nto Dr. Ray Van Orman, coach of<br />\nFeb. 27, according to Sweetser by the adoption by the Board of<br />\ncompare quite favorably with sim- a great deal which is, perhaps, not dents present. Dr. Ames, who has Linthicum, president of<br />\nthe Hopkins lacrosse team.<br />\nthe Officers' Collegiate Studies of the plan subat first evident. For instance, if been a member of the fraternity for Club. The<br />\nscene of the dance will mitted to it by the Committee on<br />\nDr. Van Orman intends intro- ilar statistics made at other institua rising the Freshman class were sold at the a good many years will make the be the Great Hall of<br />\nducing the Australian style of tions, all of which show<br />\nLevering. It Educational Methods and Policies,<br />\ncurrent price for fertilizer it would chief address. This is the first of will be<br />\nopen to all members of the headed by Dr. George Boas.<br />\nPlaying to his team, and will use improvement in the health of the<br />\nbring a gross sum of $314.56, F. 0. the two initiations held during the R. 0. T. C., the<br />\nit in practice sessions. If it proves college man.<br />\ncharge being $1.50.<br />\nTo Major In Letter Years<br />\nFreshmen Are Excellent Specimens B., Baltimore. Compared to the school year the other being held<br />\nThe<br />\nOfficers'<br />\nClub,<br />\ncomposed of<br />\nsuccessful, he intends to advocate<br />\nNo longer may the college comic bulk of said class, however, 44,The<br />\nplan, effective in the autumn<br />\nin the spring. The names of those cadet corps officers is sponsoring<br />\nits use in regular games instead of represent the Hopkins frosh as a<br />\nof<br />\n1932,<br />\nwhen the present freshman<br />\n682.44 lbs.), it would be extremely to be initiated will not be divulged the affair. The<br />\nthe present system.<br />\ncommittee of club class<br />\nbespectacled pygmy or an animated unprofitable to transport them any<br />\nwill be juniors, provides for<br />\nuntil the Assembly ceremony.<br />\nmembers who are in charge of the<br />\nStyle Reduces Team Size<br />\nbookworm, for the statistics show great distance, since their economic<br />\nmajoring in a specific subject in the<br />\nBall are: Ruark, chairman; Gordon,<br />\nThe most important feature of that he is physically an excellent<br />\nFounded in 1914<br />\ncurriculum, and a set of comprevalue is but $14 per ton.<br />\nOmicron Delta Kappa is a na- Finneran, Pfeiffer and Wrightson. hensive<br />\nthe Anzac style of play is that the specimen, measuring, on the averexaminations in the study in<br />\nIf placed end to end, aside from tional honorary fraternity with<br />\nteam is cut down from eleven to age, five feet, ten and eight-tenths<br />\nthe<br />\nspring<br />\nof the year in which the<br />\nfact that they might some time chapters, or circles, throughout the<br />\neight men. The field is also made inches and tipping the bar at 140.07 the<br />\nSinger,<br />\nSpeaker<br />\nHolds<br />\n;<br />\ns<br />\ntudent<br />\npresents<br />\nhimself for the dethe food ill the Levering Hall South and East. The society was<br />\nsmaller, being only 70 yards in pounds avoirdupois. His chest ex- reach<br />\ngree.<br />\nRecital At Levering<br />\nCafeteria, they would stretch some founded at Washington and Lee<br />\nlength, as compared with 110-yard pired measures 33.08 inches across,<br />\nAt the culmination of his sopho1,770.61 feet or roughly a quarter University on December 3, 1914,<br />\nfield now in use.<br />\nHenry E. Mozealous to Perform more year the<br />\nand inspired 36.22 inches.<br />\nstudent, by the new<br />\nof<br />\ntop<br />\non<br />\none<br />\nIf<br />\nplaced<br />\nmile.<br />\nof a<br />\nBefore Public Speaking Class;<br />\nand in two years' time the circle<br />\nThe field is enclosed with a fiveIn brief the following table shows<br />\nplan,<br />\nmust<br />\nchoose<br />\nhis major from<br />\nGeneral<br />\nPublic<br />\ntop<br />\nthe<br />\nInvited<br />\ncolumns<br />\nother<br />\nin<br />\ntwo<br />\nwas formed at Johns Hopkins Unifoot high wire fence. This is done the high, low and average of the the<br />\nHenry<br />\nE.<br />\nMozealous,<br />\nwelldefinite<br />\na<br />\ngroup<br />\nof<br />\nstudies organthe<br />\nacross<br />\nshake<br />\nhands<br />\ncould<br />\nmen<br />\nversity.<br />\nin order to keep, the ball constantly most important features of the phyknown<br />\nvocal<br />\nculturist<br />\nof<br />\nBaltiized<br />\nby<br />\nthe<br />\nCollege<br />\nfaculty. The<br />\nBuilding.<br />\ntop of the Woolworth<br />\nin play, since it does away with off- sical exam.<br />\nMembership Is Elective<br />\nmore, will give a lecture recital tentative grouping of studies, arThe NEWS LETTER does not offer<br />\nNorm.<br />\nLow<br />\nHigh<br />\nside plays. It also permits the specThe members of 0. D. K. are se- in Levering Hall on Wednesday, ranged solely to organize<br />\nthe work<br />\n18.34<br />\n15<br />\n29<br />\nAge<br />\nfollowing as a suggestion, of lected from the recognized 'leaders<br />\nthe<br />\n140.07 lbs.<br />\n63.8 lbs.<br />\n187 lbs.<br />\ntators to be moved nearer to the Weight<br />\nJanuary<br />\n14,<br />\nat<br />\n8.30<br />\nP.<br />\nM.<br />\n•<br />\nof<br />\nthe<br />\nindividual<br />\nstudents<br />\nand not<br />\nin.<br />\n69.96 in.<br />\n55.2<br />\n76.6 in.<br />\nlierght<br />\ncourse, but if the entire Freshman on the campus in the following five<br />\nplaying field, thus enabling the Chest Expired 39.5 in. 26.5 in. 36.22 in.<br />\nMembers<br />\nof<br />\nMr.<br />\nWheeler's<br />\nas<br />\na<br />\nfinal<br />\ncurriculum,<br />\nis<br />\ngiven<br />\nas<br />\n33.08 in.<br />\n28 in.<br />\nChest Expnd. 43 in.<br />\n(Continued on page 4, cot. 3)<br />\nclassifications — scholarship, ath- public speaking class are required follows:<br />\n536.3<br />\n276.3<br />\ncourse of the ball to be followed Strength Test 848.2<br />\nletics, social leadership (including to attend the lecture. Because of<br />\nWith much more ease than at pres(a) Laboratory science and logic:<br />\nent.<br />\nconspicuous service to the institu- various requests, the lecture will<br />\nLogic, mathematics, physics,<br />\ntion) non-athletic activities other be open to all others who are inGame Popular in Australia<br />\nchemistry, geology, biology,<br />\nthan publication, and publications. terested.<br />\nEvidently, this type of play has<br />\npsychology.<br />\nIts purpose is two-fold: to accord<br />\ncaught the fancy of Australian fans,<br />\nMr. Mozealous has previously<br />\nCotillion<br />\nJanuary<br />\nDate<br />\nof<br />\n17<br />\nis<br />\n(b)<br />\nSocial science and ethics: HisKirkley<br />\nDonald<br />\nhonor to the men that have distin- lectured to the public speaking<br />\nfor reports have been brought back Play By<br />\nAmong the Selected<br />\nBoard Affair<br />\ntory, ethics and the history<br />\nguished themselves during their classes on the uses of the voice.<br />\nto America, of crowds of 35,000<br />\nPieces<br />\nof<br />\nphilosophy, education, pounder-graduate<br />\ncareers and to form<br />\ndrawn to games in that country.<br />\nAn interesting and varied<br />\nTWO MAT MEETS ON CARD an organization of college leaders<br />\nlitical<br />\neconomy, political sci\"The most convincing argument CAST SELECTION BEGUN<br />\ngroup of songs has been selected<br />\nence.<br />\nthat<br />\nwill work for the good of the by Mr. Mozealous for his proadvanced by exponents of the new<br />\nEntrance into South Atlantic student body and the University.<br />\n(c) Literature and language:<br />\nSystem,\" Dr. Van Orman said, \"is Dramas to Be Presented Somegram.<br />\nTests is Planned<br />\nSanskrit, English, Latin, HeTo quote from the constitution of<br />\nthat it speeds up the game trementime Next Month<br />\nThe first song on the program<br />\nbrew, Greek, Ger man,<br />\nthe organization: \"Character shall will be an old English song endously. The smaller team and<br />\nIn<br />\norder<br />\nto<br />\nto<br />\naid<br />\nfinancial<br />\nlend<br />\nFrench,<br />\nItalian, Spanish,<br />\nbe the primal consideration for titled \"By the Daily Circling<br />\nThree one-act plays have been<br />\nsmaller enclosed field all aid in dothe<br />\nnewly-organized<br />\nteam,<br />\nwrestling<br />\narchaeology.<br />\nmembership.\" Thus membership in Glass,\" composed by one of Enging this. It will become second only selected from among the fifty subDoes Not Preclude Exams<br />\nin speed to ice hockey, a game which mitted in the recent contest spon- the Cotillion Board has agreed to a circle of 0. D. K. is one of the land's early composers, Dr.<br />\nThe comprehensive examination<br />\nit resembles in many respects. The sored by the Homewood Playshop, sponsor a dance and divide re- highest local as well as national Ames. This will be followed by<br />\nceipts with them. This dance will honors obtainable and the posses- a<br />\nrecitation and air from Judas does not preclude the taking of<br />\nfencing-in of the small field will it was said yesterday by N. Bryllion<br />\ntake place January 17, and is the sion of its key forms a tangible Maccabeus<br />\nin<br />\nplaywrighting<br />\ninstructor<br />\nFagin,<br />\nin<br />\n\"Arm Ye Brave.\" Course examinations. Courses in<br />\nalso allow it to be played indoors,<br />\nlast one to be held before the mid- symbol of success.<br />\ncoach.<br />\nand<br />\nTeachers<br />\nCollege<br />\nfor<br />\nthe<br />\nMr.<br />\nMozealous will also sing conjunction with the subject conthus lengthening the season.<br />\nyear examinations.<br />\nPrizes<br />\nthe<br />\nhave<br />\ngiven<br />\nwinners<br />\nto<br />\n3<br />\nPer<br />\nCent<br />\nof Students are Eligible some of Schubert's songs, among centrated upon will be compulsory,<br />\nTeam's Size Continually Decreasing<br />\nfar<br />\nthere<br />\nSo<br />\nlarge<br />\nhas<br />\na<br />\nbeen<br />\ndivulged.<br />\nplays<br />\nnot<br />\nbeen<br />\nare<br />\nThese<br />\n\"As for the cutting-down on the<br />\n0. D. K. is the final authority in which will be, \"Hark, Hark the according to the report of the Board<br />\nturnout<br />\nfor<br />\nwhich<br />\nthe<br />\nsquad<br />\nto<br />\npracFeb.<br />\nbe<br />\npresented<br />\n9,<br />\n12,<br />\n13,<br />\n14.<br />\nteam,\" continued the coach,\"history<br />\nall student matters; undergraduate Lark\" and the famous \"Ere of Collegiate Studies.<br />\nHopkins Grads Victors<br />\no'clock.<br />\nevery<br />\nafternoon<br />\ntices<br />\nat<br />\n4<br />\nIn reference to the plan, the reKoenig.\" Among the other meloshows that through the years, the<br />\nThe winning dramas are \"There Due to its financial condition Dr. rules are placed before it for interpretation; its decrees carry with dies will be the \"Gypsy Songs,\" port further declared: \"This does<br />\nnumber of men have been cut down Is No Underworld,\"<br />\nby Donald Van Orman does not deem it adsince the days the Indians played 'Kirkley,<br />\nthem weight and authority; its by Anton Dvorak and songs by not mean that courses will not have<br />\nformer Barnstormer and visable to enter collegiate competiit with vast teams over miles of<br />\nmodern English and American to be passed in the usual way, but<br />\nJohns Hopkins graduate, now dra- tion this year. Several local meets recommendations are never scorned.<br />\ncomposers. Musical analysis and it plans to do away with the heteroOnly<br />\nthree<br />\nper<br />\ncent<br />\nof<br />\nthe<br />\nunderterritory.<br />\nmatic critic for the Sunpapers ; have been arranged, however, and<br />\ngraduate enrollment is eligible for literary phases of the songs will genousness of subject matter and<br />\n\"If the innovations catch on, it \"Swing Low,\" by<br />\nElmer GreensShould stir up great interest, if we felder, a Hopkins graduate who has some of the squad will probably election to the society during the be carefully noted by Dr. Mo- to insist that a student shall know<br />\ntake part in the South Atlantic In- collegiate year.<br />\nzealous. Musical accompaniment something about his own and closely<br />\nean judge by what has happened in had several plays<br />\npurchased by<br />\nwill be rendered by Mr. Emory related subjects.\"<br />\nAustralia. If I find it successful Broadway producers; \"Be Your ter-collegiate meets.<br />\nLockard is President<br />\nPractices Four Times Weekly<br />\nH.<br />\nRoss, a graduate of Peabody.<br />\nGroup Committee In Charge<br />\nduring practice sessions, I will ad- Age,\" by Diana Ragge, a former<br />\nThe society has been often called<br />\nThe team which has been pracEach<br />\njunior's and senior's course<br />\nthe<br />\nacvocate its introduction as<br />\nPlayshop member.<br />\nticing every Monday, Tuesday, upon by Trustees, Faculty and unof<br />\nstudy<br />\nwill be determined by the<br />\ncepted style of play.\"<br />\nSelection of the casts for the Wednesday and Thursday at four dergraduate organizations on many Barnstormers Hold<br />\ninstruction<br />\nin charge of his major<br />\nproduction of the prize winning o'clock, will make its debut Satur- occasions to render its opinion. Its<br />\n\"Y\" Barn Dance subject, subject<br />\nto a group commitAnnual Engineer Ball plays has already begun, says Mr. day, January 23, at the Baltimore high standing on the campus is evi- Expect Work To Begin On Barn Imtee<br />\ncomposed<br />\nof<br />\neither all the memprovements Within Three<br />\nHeld In Y.M.C.A. Hall Fagin.<br />\nM. C. A. invitation tournament. denced by the fact that the Senior<br />\nbers<br />\nof<br />\nthe<br />\nfaculty<br />\ngiving courses<br />\nWeeks<br />\nHopes for Better Attendance<br />\nClass usually votes membership in<br />\nThe first of a series of dances to in the group or of specially desigThe Playshop coach has ex- The tournament is considered in the 0. D. K. the highest honor obbance Marks Continuance of a Cuspressed his hope that the. one-act sporting circles as one of the most tainable on the Hopkins campus. It be given monthly by the Barn- nated members, named by the detont Inaugurated By Engineering<br />\nSociety<br />\nproductions will be better attended important amateur wrestling fra- incarnates the theory of Democracy stormers was held last Friday eve- partments as their representatives.<br />\nThe second annual Engineers'<br />\nthan the presentation of \"The Faith- cases in Maryland..<br />\nin its purest form, that of equality ning in the Barn. Members of the Normally, the Board plans, the upbance was held last Saturday night Healer,\" in December.<br />\narbeing<br />\nTwo dual meets are<br />\ndramatic organization and their perclassman will spent all his time<br />\nand Fraternity.<br />\nat Levering Hall. The dance,<br />\nranged for the month of Februguests well filled the former stu- within the group of studies related<br />\nCORRECTION<br />\nThe officers for this year are as dent activities building.<br />\nMarks the continuance of a cusA colored 'to his major, but if his instructor<br />\nIt was incorrectly stated in THE ary; one with Y. M. C. A. Reserves<br />\ntom inaugurated by the various NEWS-LETTER that the program for and the other with the Y. M. H. A. follows:<br />\norchestra furnished music.<br />\ndetermines so, he may take any<br />\nengineering societies on the campus the third informal mid-day musicale, team. The Y. M. C. A. Reserves<br />\nPresident—Edwin<br />\nLockard.<br />\nPlans<br />\nfor<br />\ncourses<br />\nBarn<br />\nimprovements<br />\nelsewhere.<br />\nare<br />\nto be held today, \"will consist of a<br />\nand shows promise as a prominent joint recital by Dr. Lawrence<br />\nVice-Pres.—Bob Kyle.<br />\nunder way. It is expected by club<br />\nand Mr. which are under the direction of<br />\nTo determine whether the student<br />\nevent at the Johns Hopkins Uni- Apetran.\" Dr. Laurence A. Petran, pi- Fred Peths is usually considered<br />\nSecretary—John Heinzerling.<br />\nofficials that work will begin within has the knowledge of his subjectanist, will appear at 1.30 P. M. today<br />\nversity.<br />\nTreasurer—John Yellott.<br />\nthree weeks.<br />\nIn the musicale.<br />\n(Continued on page 4, col. 1)<br />\n(Continued on page 3, col. 4)<br />\nCoach Ray Van Orman Believes Faster Australian<br />\nGame is Improvement<br />\n<br />\nClass Would Bring $314,..56 For Fertilizer<br />\nAt Current Prices<br />\n<br />\nTHREE PLAYS SELECTED DANCE TO BE HELD<br />\nFOR MAT BENEFIT<br />\nIN PLAYSHOP'S CONTEST<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 13, 1931<br />\n<br />\nNEWSLETTER<br />\n<br />\nThe Liberalism of Mr. Schaal<br />\n<br />\nFOUNDED 1897<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice in Baltimore,<br />\nMd., under the Act of Congress November 3, 1879.<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins<br />\nUniversity.<br />\n<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nother communications to the EDITOR-IN-CHIEF.<br />\n<br />\nBelmont 8778<br />\n<br />\nTelephone<br />\n<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\nGEORGE H. DOWELL,'31<br />\nManaging Editor<br />\nFRANK CONE, '31<br />\nAssistant Managing Editors<br />\nROWLAND McD. NESS, '32<br />\nSYLVAN LEBOW, '32<br />\nJunior Editors<br />\nRAYMOND Durrx,'33<br />\nNATHAN M. HARRIS, '32<br />\nDONALD PROCTOR, '33<br />\nHAROLD B. YUDKIN,'32<br />\nHARRY GOODMAN, '33<br />\nMELVIN GUDE, '33<br />\nDAVID DOLOWITZ, '33<br />\nHERBERT L. FRIEDBERG,'33<br />\nJACK GREENFIELD, '33<br />\nMARION GROVE, '33<br />\nHAROLD KUSLOWITZ, '34<br />\nHYMAN LEVIN, '34<br />\nSANFORD SARNEY, '34<br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager<br />\n<br />\nS THE day approaches for the<br />\nreckoning of the case of the<br />\nHonorable E. A. Schaal versus the<br />\nsuzerains of the Central Y. M. C.<br />\nA., reminiscences of the recent New<br />\nThought assembly crop up rather<br />\npungently. Although the assembly<br />\nwas reputedly devoted to the emancipation of the dormant undergraduate intelligence, little was emancipated on the occasion save a number of beautiful illustrations of mob<br />\nphenomena. The chief difficulty<br />\nencountered at the time was that of<br />\nkeeping the gentlemen of Hopkins<br />\non the same subject long enough to<br />\ndiscuss it.<br />\n<br />\nA<br />\n<br />\nFrom the ousting of Schaal by the<br />\nY. M. C. A., supposedly for his<br />\nliberalism, they shifted to homilies<br />\non Mr. Schaal's wife and children,<br />\nhis powerful handshake, and the<br />\nsympathy that he offers to sad<br />\nfreshmen. From deprecations of the<br />\nboys of the Trustee Board, they<br />\nswerved to proposals to buy Levering Hall. From plans to sweat a<br />\ngymnasium out of Shylock Iddins,<br />\nthey jumped to plans to build the<br />\nswellest bon fire that Johns Hopkins had ever seen, by God! What<br />\nbetter denouement could there have<br />\nbeen to such an assembly than the<br />\nstreet brawl that actually followed?<br />\nII<br />\n<br />\nGus BURK, '31<br />\nAdvertising Manager<br />\nDAVID SYKES, '32<br />\n<br />\nCirculation Manager<br />\nGEORGE W. LA MONT,'32<br />\n<br />\nST. REGIS<br />\n<br />\nBy H. L. FRIEDBERG<br />\n<br />\nthe entire awful affair,<br />\nB UTthe OF<br />\nmost interesting and aston-<br />\n<br />\nishing item was the unearthing of<br />\nthe liberalism of Mr. Schaal. If<br />\none would believe Mr. Schaal's<br />\nroyal staff, he is liberalism incarnate.<br />\nHe thinks, talks and swears by libVICTOR FRENKIL, '34<br />\nWm. N. MYERS,'33<br />\nIt exudes from him and<br />\neralism.<br />\nEDGAR BLUMSTEIN, '34<br />\nMORTON ROME, '33<br />\nhis coadjutors like<br />\nruns<br />\nthrough<br />\n'34<br />\nDAVID GUTMAN,<br />\nWILBUR BLOOM, '33<br />\nGEORGE BAYLIN, '31<br />\nMAURICE R. CHASSIN,'33<br />\nsyphilis runs through an army. Personally, I am yet to be convinced<br />\nnot that Schaal has liberal views,<br />\nProduced by the R. L. Polk Printing Company, 1930 Clifton Ave., Baltimore, Md.<br />\nbut that he has any views at all.<br />\nAs far as I can determine, he's<br />\nstrictly. neuter. But for mere argument's sake—wherein has he<br />\nmanifested liberal propensities? In<br />\nprohibition? He is as dry as Professor Hollander's lectures. In literature? Glance at the Y. M. C. A.<br />\nCHANGES IN CURRICULUM<br />\nlibrary sometime. In religion? His<br />\nmeditations are a cross<br />\ntheological<br />\nuring the last decade, their has been a movement in American colbeliefs of a Negro<br />\nthe<br />\nbetween<br />\ntowards more and more elective courses. A reaction to this is<br />\nand<br />\nthe easy philosophy<br />\nMethods<br />\nand<br />\nevangelist<br />\nEducational<br />\nseen in the report of the Committee on<br />\nthis<br />\nadopting<br />\nIn<br />\nCurriculum.<br />\nyear<br />\nfourth<br />\nChrists<br />\nwho conceive<br />\nRotary<br />\nand<br />\nthird<br />\nof<br />\nPolicies on the<br />\nreport, the Board of Collegiate Studies emphasizes the fact that students<br />\nsuch pep epigrams as \"religion is<br />\nneed not be strictly confined to one of the three groups, but a major<br />\nlike an extra gallon of gasoline.\"<br />\nsubject must be selected and the student must have special permission<br />\nWhere Mr. Schaal may lay confrom his instructor or his group committee to take courses in other<br />\ngroups.<br />\ntentions to liberalism with any eviactual<br />\nan<br />\nhave<br />\nwill<br />\ndegree<br />\nA.B.<br />\nan<br />\nsystem<br />\nadopted<br />\ndence at all is perhaps in a reputed<br />\nUnder the newly<br />\nvalue. At present, the fact that a man is awarded his degree does not<br />\nprogressiveness in political or ecoshow that he has done any definite amount of work. True he has<br />\nnomic<br />\nthought and in Negro-Cauearned a certain specified number of credits, but the credit system is<br />\nsocial intercourse. The libcasian<br />\nin<br />\nspent<br />\nbeen<br />\nhave<br />\nhours<br />\nunjust. The fact that a certain number of<br />\nof<br />\nof the latter is perhaps a<br />\namount<br />\neralism<br />\ndefinite<br />\nany<br />\nthat<br />\nproves<br />\nway<br />\nno<br />\nin<br />\nlaboratory<br />\nand<br />\nclassroom<br />\ndubious liberalism, but is it at least<br />\nwor khas been done, or that any definite amount of knowledge has<br />\nbeen acquired. One course for which one receives six points may reevidence. But when Mr. Schaal<br />\nquire one hour of preparation a week outside of class, while another<br />\non the former before the<br />\nexpounded<br />\nwill require four times as much. At present a student may carefully<br />\nsome time ago, he was<br />\nLiberal<br />\nClub<br />\nselect all the courses of the former type and receive the same degree<br />\nat the fear of<br />\nprostrated<br />\nsomewhat<br />\nhard.<br />\nas<br />\ntwice<br />\nas another man who has learned much more and worked<br />\nonly<br />\nis<br />\ncourses<br />\nand refused<br />\nquoted<br />\nelective<br />\npublicly<br />\nbeing<br />\nof<br />\nndance<br />\nover-abu<br />\nan<br />\nThis reaction against<br />\nto permit any portion of his address<br />\nnatural. Some organization of the work of student is necessary in<br />\nseveral ways. In the first place, the student will now have a compreto be published. I have always<br />\nhensive knowledge of some field rather than some slight leaning in<br />\ninclined to believe that people<br />\nbeen<br />\nmany unrelated subjects. Secondly, the A.B. degree assumes some<br />\nand rant behind closed<br />\nswear<br />\nwho<br />\nactual value as mentioned above. Lastly, the student will not be so inas sincere is peoabout<br />\nimmedare<br />\ndoors<br />\nclined to sweep from his mind everything related to a course<br />\nneed<br />\nwill<br />\nhe<br />\nthat<br />\nknows<br />\nhe<br />\nfor<br />\nof their physical<br />\nexamination<br />\nboast<br />\nple who<br />\niately following the final<br />\nthe knowledge acquired in latter courses and must take a comprehensive<br />\nsafety of secondthe<br />\nprowess from<br />\nexamination.<br />\nstory windows. Mr. Schaal may<br />\nIn planning the curriculum of the third and yourth years, the comcall this and the above liberalism.<br />\nmittee considered the needs of two types of students. In the first place,<br />\nBut if it is liberalism, then the<br />\nit was necessary to consider those who know definitely what their work<br />\nLiberal of all died making<br />\ngreatest<br />\nUnithe<br />\nat<br />\nwhile<br />\npursue<br />\nto<br />\nwish<br />\nthey<br />\nin life is to be, and what courses<br />\nfaces at a monkey down in Tenversity. The plan adequately provides for these students. The other<br />\nnessee!<br />\ngroup consists of those who desire \"a liberal education.\" At first sight,<br />\nit would appear that ample provision for these men has not been made<br />\nIII<br />\nas there is not so good an opportunity as formerly to take courses in<br />\nobto<br />\nthat<br />\nassuming<br />\nthus<br />\nis<br />\none<br />\nHowever,<br />\nmany different subjects.<br />\nHE Y. M. C. A. is doubtless the<br />\ntain \"a liberal education\" one must have a free choice of courses. This<br />\nmost unsavory, ignorant and<br />\nmore<br />\na<br />\nreceive<br />\nshould<br />\nis not the case. Under the proposed system one<br />\nfirst<br />\nthe<br />\nDuring<br />\norganization of its<br />\nsystem.<br />\npresent<br />\nhypocritical<br />\nthe<br />\nunder<br />\nthan<br />\neducation<br />\nthorough<br />\nbreed. It has shielded congenital<br />\ntwo years, as now planned one takes many general survey courses and<br />\nreally covers the same ground only in less detail than the average stuill-humor and bigotry with a most<br />\ndent at present takes four years to cover. In the last two years as<br />\nand odious affability. Its<br />\ntransparent<br />\nplanned, one begins to specialize and gains a thorough knowledge of<br />\nfor human brothdevotion<br />\nof<br />\nshouts<br />\none field. All in all one obtains a more liberal education by this<br />\ninterrupted only<br />\nbeen<br />\nhave<br />\nerhood<br />\nmethod than under the former system.<br />\nexaminacomprehensive<br />\nthe<br />\nsystem,<br />\nthe vilest sort<br />\nin<br />\nindulgence<br />\ncredit<br />\nthe<br />\nby its<br />\nThe abolishment of<br />\ntion, and the organization of the student's studies are forward steps in<br />\nto those<br />\ndiscourtesy<br />\nand<br />\nof prejudice<br />\nthe of education. The committee had a difficult task before it, and to<br />\nis born<br />\nIt<br />\naid.<br />\nto<br />\nit has contracted<br />\nour mind, they have solved their problems very successfully. The<br />\nof and patronized by mediocre perpresent administration has been eminently successful in its efforts to<br />\nsons who sacrifice truth and honesty<br />\nkeep Hopkins in a prominent place in the educational world.<br />\nOffice Manager<br />\nISADOR GUTMAN, '33<br />\nWILSON RUTHERFORD, '31<br />\nCHARLES NEY, '33<br />\nABRAM BURK, '34<br />\nSIMON LITT, '33<br />\n<br />\nEDITORIALS<br />\n<br />\nD<br />\n<br />\nT<br />\n<br />\nto mediocre thoughts. It is as unChristian as it is conservative.<br />\nJust as the Y. M. C. A. is in<br />\nbelligerent antithesis to intellectual<br />\nprogress, just so it maintains a<br />\nsimilar attitude toward social progress. And no one will question<br />\nthe statement that it is a conservative organization. Consequently, if<br />\nMr. Schaal gives us his own word<br />\nfor his liberalism and if the Central Y. M. C. A. is convinced that<br />\nMr. Schaal is profaning thereby the<br />\nY. M. C. A. and its swimming pools<br />\nand prayer rooms then there is as<br />\nlittle excuse for Mr. Schaal's presence in the Y. M. C. A. organization as there is for the Y. M. C. A.<br />\norganization's presence on the Johns<br />\nHopkins campus!<br />\nMany have attempted to play up a<br />\nsort of maudlin pathos in the matter,<br />\nto wit: the tearing of embryo liberals from the bosom of the papa<br />\nliberal, Mr. Schaal. But to me the<br />\nwhole business is so delightfully ridiculous that it almost eclipses all<br />\n)ther considerations. Consider, if<br />\nyou will, the glorious fun encountered in a situation wherein an undisputably conservative organization as the Y. M. C. A. proposes to<br />\noust for liberalism from a campus<br />\nsupposedly a birthplace of liberalism, a man who professes liberal<br />\nbeliefs but who actually is about as<br />\nliberal as the King of England.<br />\n<br />\n1815-1817N. Charles Street<br />\nSTUDENTS MEETING PLACE<br />\nClub Breakfasts<br />\nSpecial Luncheons 50 cents<br />\nDinners 65 cents<br />\nRenowned as \"Just the Place\" for Supper<br />\nAfter the Theatre or Dance<br />\nOPEN UNTIL 3:00 A. M.<br />\n<br />\nA. H. FETTING<br />\nMANUFA CTURING JEWELRY CO.<br />\nManufacturers<br />\n<br />\nGreek Letter Fraternity Jewelry<br />\n314 NORTH CHARLES STREET•<br />\n<br />\nU-DIR1VE-IT, Inc<br />\n<br />\n•<br />\n<br />\n15 N. High St.<br />\n<br />\nCHEVROLETS AND FORDS<br />\n15-10c Per Mile<br />\nSEDANS, COACHES, SPORT COUPES, ROADSTERS<br />\nPlaza 4089—Calvert 5769<br />\n<br />\nIV<br />\nSCHAAL is<br />\nWHETHER<br />\neventually removed or not,<br />\nmakes little difference to me. Apparently it means little to anybody<br />\nelse on the campus, for since the<br />\nNew Thought assembly no reference to the matter has been made,<br />\nwhile the Student Council has carefully neglected to forward to the<br />\nCentral Y. M. C. A. the resolution<br />\n)f disapproval passed by the Student Council at the assembly. I do<br />\nnot regard this apparent disinterest<br />\nas an expression of antipathy to Mr.<br />\nSchaal, but merely for what it is<br />\n—disinterest.<br />\nMr. Schaal palpably is not a leader of campus thought. His periodic<br />\ncamp meeting that goes under the<br />\nponderous title of \"Conference\"<br />\ndoes not even. attract the Y. M. C.<br />\nA. royal staff. The Liberal Club,<br />\ncredited as his achievement, is little<br />\npopular with graduates or undergraduates. Nor, indeed, in my opinion, is its liberalism unimpeachable.<br />\nLevering Hall despite the swift<br />\nstyle of Y. M. C. A. literature is<br />\nnot a Student center for reasons<br />\nother than convenience and expedience. I, myself rarely make use of<br />\nthe building outside of my connection with the NEWS-LETTER. And<br />\njudging by some of the specimens of journalism that appear<br />\nin both the Black and Blue Jay and<br />\nthe NEWS-LETTER either could be<br />\nwritten in an alley as well as behind<br />\nmahogany desks.<br />\nBut neither Schaal nor the soft<br />\nsofas of Levering Hall are indispensible to Hopkins. No one particularly wants him to go. No one<br />\nparticularly cares if he stays. If<br />\nhe goes the Barnstormers will continue as they have continued, the<br />\nJay will persist in stories of Virgin<br />\nLove, Coach Van Orman will still<br />\nput out bum football teams, Broadus Mitchell's sense of humor will<br />\nstill thrive and Mr. Lockard will<br />\nsell as many roast beef sandwiches<br />\nas heretofore. And if he stays . ..<br />\n<br />\n\"Friend of the Hopkins Man\"<br />\n<br />\nUnion Trust Company of Maryland<br />\nCHARLES AND FAYETTE STREETS<br />\n\"On the Route of the Charles Street Bus\"<br />\n<br />\nDECORATIONS<br />\n<br />\nINTERIOR WOOD WORK<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\nShow Rooms<br />\n343 N. Charles Street<br />\n<br />\nFactory<br />\n600 S. Pulaski Street<br />\n<br />\nF. Y. I.<br />\nmeans<br />\nFor<br />\nYour<br />\nInformation\"<br />\nHIM/ lell ON Read Tompl<br />\n<br />\nF. Y. I.<br />\nYou read, of course, but how do you select your<br />\nreading? The entire booktrade is co-operating in<br />\nthe publication of a newsy, up-to-date magazine<br />\nthat will keep you posted. Would you like us to<br />\nsend it to you with our compliments?<br />\n<br />\nNorman Remington Co.<br />\n347 N. Charles St.<br />\nBaltimore, Md.<br />\n<br />\nSurely! I want to know what's<br />\ngoing on. Send your magazine<br />\nmonthly. No obligation, of<br />\ncourse.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 13, 1931<br />\n<br />\nBASKETEERS SHARE<br />\nWEEK-END HONORS<br />\nJays Win Over Brooklyn<br />\n22-14; Lose To Army 41-33<br />\nLOSERS SLATED<br />\n<br />\nTO<br />\n<br />\nWIN<br />\n<br />\nKelly Stars In Both Games for<br />\nJohns Hopkins<br />\nAfter their surprising showing<br />\nagainst Loyola College last week the<br />\nHopkins basketball team kept up<br />\nthe good work an a trip to New<br />\nYork State over the week-end. On<br />\nFriday night Brooklyn Poly fell before the Jay quint the score being<br />\n22-14. Saturday afternoon the Army<br />\nwon a 41-33game from the Black<br />\nand Blue five at West Point. However as was the case against Loyola,<br />\nthe Jays proved much stronger than<br />\ntheir rivals had expected.<br />\nPoly Unable To Score<br />\n<br />\nBefore meeting the Jays, the<br />\nBrooklyn team had won three<br />\nstraight games and were given more<br />\nthan an even chance to defeat the<br />\nBaltimore team. Don Kelly and Silverman, who had done good work<br />\nagainst the Loyola forwards, were<br />\nagain on the job and the Poly team<br />\ncould not break into the scoring<br />\ncolumn during the first twenty minutes of play. In the meantime field<br />\ngoals by Don Kelly, Jones and<br />\nBrook, and a foul goal by Jones<br />\nhad enabled Hopkins to run upa<br />\nfairly safe margin and the half ended with the Jays enjoying a 9-0<br />\nlead.<br />\nWith the start of the second half<br />\nthe Brooklyn attack began to find<br />\nthe range with the result that Wilson and Staehlick scored two<br />\ndouble-deckers apiece. Jansen, Poly<br />\nforward, was their high point scorer<br />\nwith six points to his credit. These<br />\npoints were the result of three field<br />\ngoals.<br />\nKelly Scores Four Goals<br />\n<br />\nHowever, during this interval<br />\nthe Jays had not been idle for Jones<br />\nhad scored another field goal,<br />\nBrooks had made good on a free<br />\nthrow, the result of a foul, and<br />\nGunnett, who replaced the redhaired center later on, had counted<br />\non a field goal. In addition Don<br />\nKelly counted four double decker<br />\nand this total gave the Jays their<br />\nmargin of victory.<br />\nDon Kelly was the high point<br />\nscorer of the evening with twelve<br />\npoints credited to him. Jones with<br />\nfive followed him, while Brooks<br />\nwith three, and Gunnett with two<br />\npoints were the other scorers. Silverman, although not among the<br />\nscorers, played a fine defensive<br />\ngame and was instrumental in holding down the number of field goals<br />\ngarnered by the New orkers.<br />\nThe inability of the Poly team to<br />\ntake advantage of their foul shots<br />\ncost them several points and aided<br />\nin their downfall.<br />\nVisitors Rush Jays<br />\n<br />\nWhen Coach Darley's men lined<br />\nUp against Army Saturday afternoon they realized that they were in<br />\nfor a struggle. As a matter of fact,<br />\nthe Soldiers had just run a string<br />\nof three consecutive victories which<br />\nthey intended not only to keep unbroken but which they wished to<br />\nextend at the expense of the Baltimoreans. Realizing this, the visiting quint started off with a rush.<br />\nShortly after the opening jump,<br />\nDon Kelly sank one from the side<br />\nof the court. Herb, a member of<br />\nthe Army backfield during the football season, made it 2-all after taking a pass from Blanning. Then<br />\nBrooks, rangy Jay center, scored a<br />\nfield goal and when Blanning<br />\nfouled Silverman, the latter made<br />\ngood on his free shot.<br />\nCadets Take Lead<br />\n<br />\n- THE MAIL BAG<br />\nEditor of the NEWS-LETTER:<br />\nDear Sir:<br />\nFrequently individuals of the<br />\ncampus are .inspired with initiative<br />\nenough to make inquiries as to their<br />\nstatus quo in the policies of this<br />\ninstitution. There is one question<br />\nwhich I would wish answered because it has remained a mystery to<br />\nthe unsophisticated collegian an unduly long time.<br />\nWhat has happened to the Cage<br />\nFund drive?<br />\nRumors have it that the Varsity<br />\nClub has taken the matter into their<br />\nown hands and are attempting to<br />\nfinance the construction. Well and<br />\ngood, but is there any verification<br />\nfor this rumor?<br />\nThe average student's conception<br />\nof the history and plans of the Cage<br />\nare not at all clarified. The class of<br />\ntwenty-nine took the matter into<br />\ntheir hands when their chairman<br />\nwas appointed. But due to no fault<br />\nof the capable chairman, sufficient<br />\nfunds could not be raised and so<br />\nthe matter apparently came to an<br />\nundignified and ignominious finish.<br />\nThe other outside sources of revenue had already been tapped and<br />\nstill the required quota had not been<br />\nattained. There was no other organization in any way affiliated with<br />\nthe University who were depressed<br />\nabout the failure to do anything<br />\nabout it except the Varsity Club.<br />\nThe rumor concerning their activities has this logical justification. It<br />\nit justly placed too for the Club<br />\npersonifies those men who should<br />\ntake an interest in the athletics of<br />\nthe University, because they know<br />\nthe needs at Homewood. And if<br />\nthere is one thing that is a requisite<br />\naround campus, it is a place for<br />\nthe indoor sports to have free lance.<br />\nIt is rather a pathetic need too, for<br />\nHopkins is one of a few modern<br />\ncolleges that have no gymnasium of<br />\nany sort.<br />\nIt would seem that other expenditures that the University has<br />\nliquidated could have been used to<br />\na better advantage. The artificial<br />\nlighting system has proved rather<br />\nuseless and void, football at night<br />\ndoes not have the attraction that the<br />\nold afternoon contests had, the<br />\nlighting can be used only two and a<br />\nhalf months in the year, Lacrosse<br />\nis impossible because the pellet can<br />\nnot be seen and the money employed<br />\nin construction could well have been<br />\nutilized in the Cage Fund where its<br />\nadvantage can in no way be doubted<br />\nnor impaired.<br />\nThat has all passed and still the<br />\nquestion of Cage Fund remains a<br />\nmystery and a curiosity.<br />\nWould some one advise the campus in its entirety exactly what has<br />\nhappened to the Cage Fund and its<br />\nfuture possibilities?<br />\nC. F.<br />\nquintet scored three more field<br />\ngoals, the home team added seventeen points with the result that at<br />\nthe end of the half the score stood:<br />\nWest Point 23, Hopkins 11.<br />\nWest Point Increases Lead<br />\n<br />\nSoon after the start of the second<br />\nhalf the West Pointers added two<br />\npoints to their lead by virtue of a<br />\nfield goal scored by Strother. A<br />\nrally by the Hopkins team was<br />\nstarted by Jones with a field goal<br />\nand continued by Don Kelly, who<br />\ncaged two more in succession.<br />\nFor the remainder of the game<br />\nthe Jays outscored their opponents<br />\nand although they sliced the lead to<br />\na great extent they were unable to<br />\nknot the count and at the final gun<br />\nthey had missed by a margin of<br />\nfour field goals.<br />\nBlanning and Strother of West<br />\nPoint scored thirteen points between them. Kreuger, with six<br />\nfield goals and a foul to his credit,<br />\nwas high point man of the game.<br />\n<br />\nThe Cadets then took the ball into<br />\ntheir opponents' territory and after<br />\nmissing several attempts, Kreuger<br />\nscored a field goal for them. AlMost immediately Blanning counted<br />\ntwo points with a nice shot.<br />\nThis gave the Hudson river boys<br />\nKelly Stars for Jays<br />\na lead that they never relinquished<br />\nFor Hopkins, Don Kelly was the<br />\nand although the blue-jerseyed individual star. In addition to<br />\n<br />\nOLD POINT SYSTEM<br />\nCHANGED BY BOARD<br />\n<br />\nJ. H. U. Blue Jay To Be<br />\nIssued On Hopkins<br />\nCampus Next Friday<br />\nThe 'Black and Blue Jay\" will<br />\nmake its appearance on the campus sometime next Friday, January 16.<br />\nThe cover page by Miles Murphy, is entitled \"Exam Number.\"<br />\nOther features include an interview with Dr. Joseph T. Singewald, professor of Economic<br />\nGeology at Hopkins, by Harold<br />\nKuslovitz.<br />\nTwo of the jokes which appeared in the last issue of the<br />\n\"Black and Blue Jay\" were selected by the College Humour<br />\nmagazine for a recent issue.<br />\n<br />\nRevision of Curriculum to be<br />\nEffective in 1932<br />\nNEW COURSE PLANNED<br />\nAim<br />\n<br />\nof Collegiate Board Is<br />\nGreater Specialization<br />\n<br />\n'matter organized and should go beyond the material offered in his<br />\ncourses is the purpose of the final<br />\ncourse—examinations, as outlined<br />\nby the committee.<br />\n<br />\nBoyce, Stearn Clip Time On<br />\nJ. H. U. Records<br />\nJAYS GET YOOR START<br />\nMeet New York U. Next Saturday At N. Y.<br />\nJourneying to Newark for their<br />\ninitial appearance, the Hopkins<br />\nswimming team met defeat at the<br />\nhands of the University of Delaware by the close score of 35 to 30.<br />\nHowever, the fact that two Hopkins<br />\nrecords were broken shows that the<br />\nteam made a very creditable showing.<br />\nBoyce, swimming in two previous<br />\nevents, won the 440 yard freestyle<br />\nin the fine time of 6 minutes, 26 3/5<br />\nseconds.<br />\nClip Seconds from Records<br />\n<br />\nOutline Comprehensive Examinations<br />\n<br />\nReferring to the comprehensive<br />\ntype of examinations, it was suggested by the committee that \"in<br />\ngeneral, the questions should avoid<br />\nsearching detail and should be so<br />\nchosen as to show whether the student has a grasp, first, of the fundamental principles of his own and<br />\nclosely allied subjects, and, second,<br />\nof the technique of workers in his<br />\nfield.\"<br />\nSubsequent to consultation with<br />\nthe various Departments in the<br />\nHopkins, arrangements have been<br />\nmade to offer additional new courses<br />\nin the curriculum in order that sufficient supplementary material for<br />\nthe effective operation of the groupstudy system may be provided.<br />\n\"Evils\" Cited By Committee<br />\n<br />\nIt is the belief of the committee<br />\nthat three practices now impede the<br />\nsatisfactory educational training of<br />\nthe student: (1) the determination<br />\nof a man's fitness for the A. B. degree on the number of Points-credit<br />\nhe has acquired; (2) the lack of<br />\nprovision for the organization of a<br />\ncoherent education in the third and<br />\nfourth years; (3) the presentation<br />\nof lecture courses for upperclassmen, \"which has put a premium<br />\nupon the student's receptivity and<br />\ndiscouraged that skeptical and inquiring spirit extremely important<br />\nin men who wish to contribute to<br />\nthe progress of civilization rather<br />\nthan be its beneficiaries alone.\"<br />\n<br />\nThis clipped (<br />\n7 3/5 seconds from<br />\nthe previous record of 6 minutes,<br />\n34 1/5 seconds, held by Brinton<br />\nStone, '26. Cook added to the Hopkins' score by taking second place in<br />\nthis event.<br />\nAnother Hopkins' record fell<br />\nwhen Stearn won the 200 yard<br />\nCharges Made Against System<br />\nbreast-stroke in 3 minutes flat, lowAdmitting the credit system as<br />\nering the former record held by A. 'being a convenient way of counting<br />\nSwanson,'27 by 3 2/5 seconds. Sad- up courses, the committee charged<br />\nler captured second place.<br />\n\"in practice it amounts first to<br />\nJays Have Uphill Battle<br />\nequating .the number of hours a<br />\nGetting off to a bad start by losing week a student has spent in classthe relay, 50 yard freestyle and 150 rooms with the amount of knowlyard back-stroke, the Jays had an edge he has received; second, it<br />\nuphill battle. Frey, Hanhart, Doel- gives the student the idea that once<br />\nler, Boyce .swam in the relay but a course is ended, it is absolved and<br />\nthe University of Delaware natators- may be forgotten.\"<br />\nwere too strong for the Hopkins<br />\nBecause of the point-credit sysswimmers.<br />\ntem and schedule difficulties, the reDelaware carried off first honors port continues, students are perin the 50, yard freestyle but Capt. mitted to take any courses whatsoDoeller and Boyce took second and ever so long as the prerequisites<br />\nthird places respectively..<br />\nhave been filled. As a consequence<br />\nDelaware Wins First<br />\nthey are graduated \"with a heteroIn the 100 yard freestyle Dela- geneous collection of information<br />\nware won first and second and Bud which is bound to be superficial.\"<br />\nFrey third. The time for this event . Lecturers Repeat Information .<br />\nIn regard to the lecture courses<br />\nwas 1 minute, 1 2/5 seconds.<br />\nit<br />\nwas averred the practice has deHoffman placed third in the 150<br />\nveloped<br />\na tendency on the part of<br />\nyard back-stroke but was disqualiteachers<br />\nto \"repeat information<br />\nfied, giving all three places to Delawhich<br />\nthey<br />\nor their colleagues have<br />\nware.<br />\nalready<br />\nprinted<br />\nin text-books and<br />\nReid, South Atlantic Champion,<br />\narticles.\"<br />\ntook first in the diving. Second and<br />\nTo allow the Johns Hopkins stuthird went to Delaware.<br />\ndents<br />\nto gain preeminence, and not<br />\nA three man medley was added<br />\nwhich Delaware won. For Hop- mediocrity, in their fields, it was<br />\nkins Doeller swam the 100 yard said, they must early acquire the art<br />\nback, Reid, the 100 yard breast and of teaching,themselves in preference<br />\nto the habit of being taught.<br />\nAdams the 100 yard free.<br />\nThe Committee on Educational<br />\nBoyce was high point scorer folMethods<br />\nand Policies includes Dr.<br />\nReid.<br />\nand<br />\nStearn<br />\nlowed by<br />\nDean; Kent K. GreenBerry,<br />\nE.<br />\nW.<br />\nTo Meet New York U.<br />\nof<br />\nthe<br />\nhistory department;<br />\nfield,<br />\njourteam<br />\nJay<br />\nNext Saturday the<br />\nBroadus<br />\nMitchell,<br />\nof the politiDr.<br />\nstrong<br />\nmeet<br />\nthe<br />\nneys to New ork to<br />\ndepartment;<br />\nDr. Ernst<br />\ncal<br />\neconomy<br />\nwhich<br />\nteam<br />\nNew York University<br />\nGerman<br />\ndepartment;<br />\nand Dr.<br />\nFeise,<br />\nvictory<br />\nopened their season with a<br />\nphilchairman,<br />\nof<br />\nthe<br />\nGeorge<br />\nBoas,<br />\nover Rider College.<br />\nosophy department.<br />\nscoring eleven points, his passing<br />\nand floorwork were the features of Committee Organized<br />\nthe game.<br />\nFor Public Speaking<br />\nThe line-ups and summaries of<br />\nIn order that the Public Speakthe game were as follows:<br />\n'Mg Classes may arrange for the<br />\nARMY<br />\nFG F TP<br />\n0<br />\n1<br />\n1<br />\n0<br />\n0<br />\n1<br />\n0<br />\n0<br />\n0<br />\n—<br />\n3<br />\n<br />\nHOPKINS<br />\nFG T TP<br />\n2 6<br />\n0 6<br />\n0 0<br />\n1 3<br />\n1 1<br />\n1 11<br />\n2 6<br />\n<br />\n4 Jones f<br />\n9 C. Kelly, f.....3<br />\n0<br />\n13 Wood, f<br />\n1<br />\n0 Brooke, c<br />\n....0<br />\nc<br />\nGunnett,<br />\n8<br />\n5 D. Kelly, g....5<br />\n2 Silverman, g...2<br />\n0<br />\n01<br />\n—<br />\nTotals ....13<br />\n41<br />\n<br />\nPhone Belmont 7908<br />\n<br />\nBirely's Pharmacy<br />\n<br />\nMembers Florists Telegraph Delivery Association<br />\n<br />\nST. PAUL at 33rd STREET<br />\nYour Neighborhood Drug Store<br />\n<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy,<br />\nCigars<br />\nUnexcelled Fountain<br />\nService<br />\n<br />\nFLORISTS<br />\n<br />\nMake Our Store Your Store<br />\n<br />\nAND<br />\n<br />\n(Continued from page 1, col. 6)<br />\n<br />\nHOPKINS NATATORS SUNK<br />\nBY DELAWARE U., 35-30<br />\n<br />\nBlanning, f...2<br />\nStrother, f....4<br />\nKreuger, f....6<br />\nBesson, f<br />\n0<br />\nEpler, c<br />\n4<br />\nHerb, g<br />\n2<br />\nMalloy, g<br />\n1<br />\nAdams, g<br />\n0<br />\nGregory, g....0<br />\n—<br />\nTotals ...19<br />\n<br />\n3<br />\n<br />\n7 33<br />\n<br />\nvarious activities connected with the<br />\ncourse a committee consisting of<br />\none member from each section has<br />\nbeen elected. Triplett, chairman;<br />\nLockard, secretary; Arias, temporary treasurer; Darrell and Heaney<br />\nare the committeemen.<br />\n<br />\nDECORATORS<br />\nBelmont 8040-8041<br />\n<br />\n1918 N. Charles St., near 20th<br />\nPhone: Vernon 0573<br />\n<br />\nPARISIAN TAILORING<br />\nCOMPANY<br />\nCleaning, Dyeing, Pressing<br />\nRepairing<br />\n<br />\nFor Better Cleaning and<br />\nDyeing<br />\n<br />\n346 E. 33rd STREET<br />\n<br />\nFRIED'S<br />\n<br />\nCor. University Parkway<br />\n<br />\n101 E. 21st St.<br />\n<br />\nBelmont 5501<br />\n<br />\nD'S<br />\nF°<br />\nTHIS WEEK<br />\n<br />\nNights, 8.30; $1 to $3. Wed. Mat., 2.30; $1, $1.50, $2.<br />\nSat. Mat., 2.30; $1 to $2.50<br />\n<br />\nThe Theatre Guild, Inc., Presents<br />\n(The Fourth Play of the Third Baltimore Subscription Season)<br />\n<br />\nThe Theatre Guild Acting Company in<br />\n<br />\nGREEN GROW THE LILACS<br />\nAn American Folk Play by LYNN RIGGS<br />\nStaged by Herbert J. Biberman<br />\nSetting by Raymond Sovey<br />\nWith This Distinguished Cast<br />\nJUNE WALKER<br />\nHELEN WESTLEY<br />\nRICHARD HALE<br />\nFRANCHOT TONE<br />\nLEE STRASBERG<br />\nTEX COOPER<br />\nRUTH CHORPENNING<br />\nWOODWARD RITTER<br />\nAnd Many Cowboys<br />\n<br />\nHOPKINS STUDENTS EAT AT<br />\n<br />\nThe Stadium Restaurant<br />\nCor. Greenmount Avenue and 31st Street<br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br />\n<br />\nJ. H. FURST CO.<br />\n<br />\nTHE RELIABLE WEAVING CO.<br />\n<br />\nPRINTERS OF<br />\n<br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br />\n<br />\nPhilological and Scientific<br />\nPublications<br />\n12-20 Hopkins Place, Baltimore<br />\n<br />\nWhen in 1New York dine at<br />\n<br />\nSt. Regis Restaurants<br />\nLocated at<br />\n<br />\n1491 Bdwy at 41st St.<br />\n1400 Bdwy at 42nd St.<br />\n1500 Bdwy (Cadillac)<br />\n1570 Bdwy. at 47th St.<br />\n1627 Bdwy. at 50th St.<br />\n<br />\nSelf Service Stores<br />\n145 W. 42nd St.<br />\n210 W. 42nd St.<br />\n410 Leington Ave.<br />\n(Grand Central Terminal)<br />\n<br />\nPHONE: VERNON 5013<br />\n<br />\nCENTRAL PARKING CO.<br />\nLargest Open Air Parking in the State of Maryland<br />\n309-311 W. Franklin St.<br />\n5 CONVENIENT PLACES:<br />\n209 Davis St.<br />\nHoward and Druid Hill Ave.<br />\n20 Clay St.<br />\nHoward and Centre Sts.<br />\nBALTIMORE, MD.<br />\n<br />\nSTETSON CLOTHES<br />\nfor<br />\n<br />\nCollege z)Nen<br />\n<br />\nNationally<br />\n<br />\nJustly<br />\n<br />\nKnown<br />\n<br />\nFamous<br />\n<br />\nMADE FOR YOU<br />\n<br />\nFOUR NORTH HOWARD STREET<br />\n<br />\n\f4<br />\n<br />\nCALLS ON U. S. FOR<br />\nUNEMPLOYMENT AID<br />\nNorman T homas Declares<br />\nGovernment Would be Most<br />\nEffective Agent<br />\nCITES CAPITAL FAILURE<br />\n---- —<br />\nProgressive Believes U n e mployment is Direct Result of<br />\nIndustrial Revolution<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 13, 1931<br />\n<br />\nDr. Paul Harrison Tells<br />\nOf His Twenty Years'<br />\nStay In Arabia<br />\nDr. Paul Harrison, a graduate<br />\nof Johns Hopkins Medical School<br />\naddressed the University Supper last night.<br />\nDr. Harrison, who has spent<br />\ntwenty years in medical work in<br />\nArabia, gave an account of his<br />\nlife and experiences, among the<br />\nnatives of Arabia.<br />\nDr. Harrison will speak at the<br />\nAssembly on Thursday, March 5.<br />\n<br />\nUnemployment, the direct result<br />\nof the industrial revolution, should<br />\nbe relieved by the national government, the most effective agent in<br />\nthe nation-wide depression, the belief expressed by Norman Thomas,<br />\nnoted Socialist, in his address be- Club Supplies Unemployed<br />\nfore a Hopkins Y. M. C. A. supper With Copies of Magazine To<br />\nmeeting last Thursday evening.<br />\nPeddle On Street<br />\n<br />\nHOPKINS LIBERAL CLUB<br />\nHELPS IDLE WORKERS<br />\n<br />\nFederal Government More Effective<br />\n<br />\n\"Since we are now in the midst<br />\nof one of the periods of unemployment,\" said Mr. Thomas, \"steps<br />\nshould be taken to relieve immediate needs. Although charitable<br />\norganizations and local governments<br />\ncan do much to help, the national<br />\ngovernment can be the most effective agent, since the depression is<br />\nnation-wide.\"<br />\nThe existing system, believes the<br />\nSocialist leader, should be changed<br />\nto prevent recurrences of economic<br />\ndepression. The capitalist system<br />\nhas had its chance and has failed, it<br />\nwas held.<br />\n<br />\nSENIORS HOLD UP<br />\nHULLABALOO WORK<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWS<br />\n<br />\nUnemployment is not a problem<br />\nin the liquor traffic, according to 3 4 2 6 7 3 9 4 5 7 8 6 I 5 1<br />\nDr. Nicholas Murray Butler, president of Columbia University.<br />\n<br />\nCo-eds at the University of DeLack of Senior Statistics Slows troit, although they number only<br />\nGiving a ride to another student<br />\n50, have been forbidden to converse at the University of Michigan is<br />\nUp Advancement<br />\nwith the male students at anytime against the college rules.<br />\nTO USE NEW PROF CUTS or at any place on the campus.<br />\nWill Withhold Cover Contest<br />\nWinners Until June<br />\n<br />\nThe University of Rochester refuses to go beyond its own size in<br />\nAdvancement of work on the arranging its football schedule, and<br />\n1931 Hullabaloo is taking' place has turned down offers from N.<br />\nY. U., Army, Penn and several<br />\nrapidly, annual editors said yesterother big institutions.<br />\nday. Aside from the usual features<br />\nor requirements of a year book it<br />\nwas declared this year's publication<br />\nThree hundred Washington and<br />\nwill contain a number of novel in- Lee fresh clad only in pajamas<br />\ncrashed a local theater after a pep<br />\nnovations.<br />\nrally.<br />\nIt is expected that the senior section will go to press before the midyear examinations. The cause of<br />\nThe Columbia \"Spectator\" took a<br />\nthe delay has been the negligence poll of the men in the street. last<br />\non the part of the seniors in failing week to find out his opinion of colto turn in their Statistics Sheets. lege men, and discovered that the<br />\ngeneral idea was that college stuWithout these sheets more importdents spend most of their time<br />\nant work can not proceed. It is loafing.<br />\nhoped by Hidlabaloo officials that<br />\nall who have been delinquent in fillOnly one freshman in four has a<br />\ning out these statistics blanks will<br />\nchance to stand the grind of coldo so shortly so that this section of lege life,<br />\naccording to the president<br />\nthe book may be entirely completed. of Michigan State University.<br />\n<br />\nThe Liberal Club is at present<br />\nengaged in an enterprise that it<br />\nhopes will aid somewhat in alleviating the situation among the<br />\ncity's unemployed. Every day,<br />\naccording to Joel Seidman, the<br />\nClub is distributing copies of the<br />\nmagazine \"Unemployed\" among<br />\nout-of-work men, for five cents<br />\nper copy, which are peddled on<br />\nthe streets for ten cents. The<br />\ndistribution center is in a labor<br />\nhall down-town, and members of<br />\nthe Liberal Club alternate in<br />\nmanaging the project.<br />\nCross-Country Section Ready<br />\nIssues Now On Sale<br />\nThe football section, it was<br />\nMust Study Production Distribution<br />\nThe first issue of \"Unemployed\"<br />\nProduction and distribution fnust offered in New York last month, learned, has been finished. It will<br />\nbe studied and regulated. Mr. and the second issue are now on include a sheretofore resumes of the<br />\nThomas said, and must be done by sale. The magazine is published games, supported by action pictures<br />\ngovernment agents who do not re- by the New York chapter of the<br />\nand individual photographs of the<br />\ngard the profit motive as all-im- National League for Industrial<br />\nAlong with the football,<br />\nportant. The motive was attributed Democracy with which the local players.<br />\nsection of the pubcountry<br />\ncross<br />\nas the cause for the downfall of Liberal Club is affiliated. Nor- the<br />\npress as soon as<br />\nto<br />\ngoing<br />\nis<br />\nlication<br />\nthe capitalistic system.<br />\nman Thomas, who spoke here last the dummy sheet is arranged with<br />\nDeclaring himself in favor of un- Thursday, is the president of the<br />\nphotographs and the team<br />\nemployment and old age insurance League. The cost of publication action<br />\nthese two<br />\nfor workers, Mr. Thomas discussed is five cents, so the League is mak- picture. Aside from<br />\nwritten<br />\nbeing<br />\nis<br />\nbasketball<br />\nsports,<br />\nthe dole, which he considers \"the ing no profit on this venture.<br />\nAlgame.<br />\nsuccessive<br />\nup with each<br />\nway out.\"<br />\nThe method of permitting un- though the season is just getting<br />\nCapitalists Only, Disfavor Doles '<br />\nThose who have subsisted on employed men to vend the copies started, the dummy sheet for this<br />\nrents and dividends in return for in New York resulted in the sale sec only lacks the write-ups for the<br />\nwhich no work was put in, are the of 75,000 issues. The magazine games to come. When these games<br />\nonly persons who disfavor the dole; spread to Philadelphia, where it have been played and their resumes<br />\nmet with success, and now the writtes, the section will be ready for<br />\ndeclared the \"Y\" speaker.<br />\nLiberals<br />\nare attempting to intro- publication.<br />\nUnemployment, according to him,<br />\nduce<br />\nit<br />\nin<br />\nBaltimore. Prominent , Many designs have been submitis an especial result of the Induswriters,<br />\ncommentators<br />\nand car- ted for the cover. The final selectrial Revolution,\" because of the extoonists<br />\nsuch<br />\nas<br />\nBroun,<br />\nHeywood<br />\ntensive machinization of industry.<br />\ntion will be made at a board-of-conNorman<br />\nThomas,<br />\nDr.<br />\nHenry<br />\nAt the conclusion of his address,<br />\ntrol Meeting in the near future.<br />\nthe Socialist answered questions Emerson Fosdick, Edm un d However, the decision of the board<br />\nDuffy, Art Young and many<br />\nasked by the audience.<br />\nwill not be made public until the<br />\nothers, have contributed to the<br />\npublication is distributed in June.<br />\nmagazine without any remuneraFraternity Pictures Delayed<br />\ntion.<br />\nThe fraternity pictures have been<br />\nTo Circulate Petition<br />\nrecently inAnother project which the held up because of the<br />\nRushing.\" The<br />\nLiberal Club has under way is stituted \"Freshman<br />\nJanuary 17 is Date of Cotillion<br />\nnot be taken<br />\nwill<br />\npictures<br />\ngroup<br />\nthe circulation of a petition seekBoard Affair<br />\nfraternities<br />\nthe<br />\nafter<br />\nspring<br />\nuntil<br />\ning the abolition of compulsory<br />\n(Continued from page 1, col. 3)<br />\nmen.<br />\ntheir<br />\npledged<br />\nhave<br />\none of the best amateur teams in military training from American<br />\nIn previous editions for a great<br />\ncolleges and universities. They<br />\nthe state.<br />\nY. M. 11. A. Team To Compete<br />\nhope to get 2,000 signatures to number of years, the same faculty<br />\nThe Y. M. H. A. team will enter this circular, which is being pictures have been used. This year<br />\ncompetition for the first time They floated through all universities the publication heads plan to obare under the able direction of J. and colleges.<br />\ntain more recent photographs.<br />\nSalzman.<br />\nHullabaloo Working For Prize<br />\nThe South Atlantic ChampionThe Intercollegiate Year Book<br />\n15 Students Attend<br />\nships which are held every year in<br />\nAssociation has offered a prize for<br />\nBaltimore will also be an important Mid-Winter Assembly the best year book published in<br />\nengagement for the newly organized \"The Religion<br />\nHullabaloo is entered in<br />\nof Jesus in a Confused 1931. The<br />\nHopkins team. V. P. I. is usually<br />\nand is striving to put<br />\nWorld\" to Be Topic<br />\ncontest<br />\nthe<br />\nFifteen students of the Johns out an edition that will win this<br />\nrepresented at this tournament so<br />\nthat the Hopkins wrestlers will get Hopkins University will attend the prize.<br />\na chance to oppose one of the best annual mid-winter conference of<br />\nwrestling teams in the Southern the Middle Atlantic Field Council Pressure Decreases;<br />\nof the Y. M. C. A., to be held Feb.<br />\nCollegiate Conference.<br />\nStrength Increases<br />\n6-8, inclusive, at Buck Hill Falls,<br />\nBarn Used For Training<br />\nThe Barn, with its equipment of Pennsylvania.<br />\nStatistics Show Fall of<br />\nAt the group meetings, which Freshman<br />\nmats, has been used as training<br />\nBlood Pressure, Increase of<br />\nStrength<br />\nquarters for the team. Dr. Van will be attended by leaders from<br />\n(Continued from page 1, col. 3)<br />\nOrman has seen to it that the team various colleges and universities,<br />\nhas plenty of towels and lockers. \"The Religion of Jesus in a Con- class were dropped into the middle<br />\nof the Atlantic the ratio of the<br />\nIf the 'grunt and groan\" boys make fused World\" will be discussed.<br />\nwater to the land would be increased<br />\nUniversity<br />\nstudents<br />\nwho<br />\ndesire<br />\na good showing this year they will<br />\nby<br />\n.00000000249 of a billionth of a<br />\nto<br />\nattend<br />\nthe<br />\nconference<br />\nare<br />\nasked<br />\nprobably enter collegiate competimillimeter.<br />\nIf it were dropped into<br />\nto<br />\nsee<br />\nGaillard<br />\nFrey,<br />\nchairman<br />\nof<br />\ntion next year with a full schedule.<br />\nthe<br />\npool<br />\nin<br />\nthe botanical gardens,<br />\nthe<br />\nJ.<br />\nH.<br />\nU.<br />\ndelegation.<br />\nThe<br />\ncamThere will also be a junior varsity<br />\nnot<br />\nmuch<br />\ndifference<br />\nwould be appus<br />\n\"Y\"<br />\nhas<br />\nconsented<br />\nto<br />\npay<br />\nthe<br />\nteam which will compete against<br />\nparent.<br />\nregistration<br />\nand<br />\ntransportation<br />\nfees<br />\nGilman, Poly, City and other leadfor Hopkins students. Living exWith both feet on the ground the<br />\ning High School teams.<br />\npenses<br />\nat<br />\nthe<br />\nhotel must be paid by frosh can lift about three times<br />\nWill Hold School Tourney<br />\nToward the end of March an In- the delegates.<br />\ntheir total weight of 22.34 tons, or<br />\nter-Scholastic tournament will get<br />\nJ. Stitt Wilson, former mayor of approximately the equivalent of<br />\nunder way. The bouts will be held Berkeley, California; Dr. Robert E. enough coal to keep an apartment<br />\nin accordance with the intercol- Speer, leader in the Presbyterian house going through a hard winter;<br />\nlegiate ruling and medals will be Church; and David R. Porter will and now, perhaps some one can find<br />\nawarded.<br />\nbe leaders at the \"Y\" conference.<br />\na good use for them.<br />\n<br />\nCo-eds at the University of<br />\nMinnesota refuse to pay student<br />\norchestras any more than the minimum scale of prices as set by the<br />\n'musicians' union.<br />\n<br />\nUniversity of Minnesota students residing in St. Paul are petitioning the Twin City railroad<br />\ncompany to give them better rates<br />\non the trolley lines between St. Paul<br />\nand Minneapolis.<br />\n<br />\nDUKE UNIVERSITY<br />\nSCHOOL OF MEDICINE<br />\nDURHAM, N. C.<br />\n<br />\nRENT A CAR<br />\n<br />\nOn your radio tonight...listen to Lorna Fantin, famous<br />\nnumerologist. She'll tell you<br />\nhow names and dates affect<br />\nsuccess in business, love or<br />\nmarriage. A real radio thrill.<br />\n<br />\nWEAN at 9 o'clock To-night<br />\nEVSTERNSTANDARD TIME<br />\nP. Lorillard Co., Inc.<br />\n<br />\nOPERATE IT YOURSELF<br />\n<br />\nThe Auto Rental Company<br />\nCars for Hopkins Students<br />\nDeposit Not Required<br />\n<br />\n2125 HARFORD AVE.<br />\n<br />\n111 W NORTH AVE.<br />\nPhone, Wolfe 1413<br />\n<br />\nSimon Ackerman Clothes<br />\nREADY TO WEAR<br />\n<br />\nOn October 1, 1931, carefully<br />\nselected first and third year students will be admitted. Applications may be sent at any time and<br />\nwill be considered in the order of<br />\nreceipt. Catalogues and application forms may be obtained from<br />\nthe Dean.<br />\n<br />\nA. JACOBS & SONS<br />\n... Tailors ...<br />\n128<br />\n<br />\nW. Fayette Street<br />\n<br />\nDANCE TO BE HELD<br />\nFOR MAT BENEFIT<br />\n<br />\nrROM a mass of claims and counterchims,one fact stands out—AMOCOGAS gives more miles per gallon --least<br />\ncost per mile.<br />\nThis is proved every day by hundreds of<br />\ntruck-fleet operators who must know to a<br />\npenny their cost per mile—and by thousands of motorists who want low operating costs and better performance, too.<br />\nProve it to yourself by figuring your own<br />\ncost per mile. Note how many more miles<br />\nyou get to each gallon -- how this extra<br />\nmileage cuts down your cost per mile.<br />\nOver a period of time, notice your reduction in repair bills and generally reduced<br />\noperating costs.<br />\nPut it up to AMOCO-GAS, your motor<br />\nand a lead pencil. A little old-fashioned<br />\narithmetic will save you money.When you<br />\ncome to AMOCO-GAS and the lowest<br />\ncost per mile, you'll come to better allaround performance, too.<br />\nThe AMERICAN OIL COMPANY<br />\nAm...with Pas Mark= Paptheimi Is Tarpon Compirr<br />\nGemmel Office\" Baltimore. Md.<br />\n<br />\nviiiltdaViPi9,1741MIPAY tin;<br />\n<br />\n\f", "format": "basic_html", "processed": "H. L. F.<br /><br />\nNO ONE will be admitted to today's mid-day informal musicale<br />\nafter 1:30 P. M.<br /><br />\nVol. XXXV, No. 23<br /><br />\nON THE LIBERALISM<br />\nOF MR. SCHAAL<br />\nPage 2<br /><br />\nTHE JOHNS HOPKINS UNIVERSITY, HOMEWOOD, BALTIMORE, MD., JANUARY 13, 1931<br /><br />\nPrice 5 Cents<br /><br />\nCOLLEGE BOARD ABOLISHES CREDIT SYSTEM<br />\nCotillion To<br />\nNEW STICK RULING Frosh Blood Pressure Decreases, FRAT INITIATIONS Second<br />\nBe Held February 3 CHANGE IN<br />\nStrength Increases, Report Says SET FOR THURSDAY<br />\nTO BE ATTEMPTED<br />\nAT JOHNS HOPKINS Statistics From Medical Department Reveal That Freshman AT O.D.K. ASSEMBLY The Mid-Year Cotillion will be FOR FINAL<br />\nDance Music To Be Furnished By T.<br />\nWorth Murphy And His<br />\nJoy Boys<br /><br />\nSTUDY<br />\nYEARS<br />\nEFFECTIVE IN '32<br /><br />\nheld on Tuesday evening, February<br />\n3,<br />\nat the ballroom of the Maryland<br />\nTaken<br />\nNames of Those To Be<br />\nCasualty<br />\nClub. T. Worth MurIn Will Not Be Divulged Until<br />\nphy<br />\nand<br />\nhis Belvidere band will<br />\nthe Day of Initiation<br />\nIn spite of the fact that the Class<br />\nThe total number of examinafurnish the music.<br />\nFew Elective Subjects and<br />\nof '34 is six-hundredths of a year tions, made totalled some 607, of<br />\nTHREE PLAYERS CUT<br />\nFavors are to .be given to the Comprehensive Exam To Reyounger than its predecessors of the which 324 are of the first year en- DR. J. S. AMES WILL BE<br />\nUNDER NEW RULES<br />\nyoung ladies, and a number of speplace Credits<br />\nlast twenty-five years have been, it tering students. Of these 146 are<br />\nPRINCIPAL SPEAKER cialty dances<br />\nare on the program.<br />\nthe Physical Training Unit and<br />\nThe charge for admission is $2.50 MANY NEW COURSES<br />\nSpectators Nearer to Field; is four and twenty-four thousandths in<br />\n178 in the R. 0. T. C. Dr. Aber- Edwin Lockard, Robert Kyle, per<br />\nunits<br />\nbigger<br />\nand<br />\nstronger.<br />\nIts<br />\nblood<br />\nTO BE INSTITUTED<br />\ncouple and $2.00 stag.<br />\nCan Watch Game<br />\npressure has decreased 9.76 milli- crombie, in commenting on the low John Heinzerling and John<br />\nMore Closely<br />\nmeters of mercury, systolic, with a percentage of the group infected by<br />\nYellot Are Members<br />\nAnnual Military Ball Aim of Collegiate Board Is for<br />\ncorresponding drop of 1.88 milli- ringworm, said the average of less<br />\nHomewood Field, this spring,<br />\nSet For February 27 Greater Specialization of<br />\nthan one per cent was in \"wondermeters diastolic.<br />\nan<br />\nexperiment<br />\nscene<br />\nwill be the<br />\nof<br />\nCollege Study<br />\nAt Thursday's Assembly the<br />\nThese, in part, are the figures re- ful contrast\" to the percentages at<br />\nAdmission To The Dance, Which Is<br />\nwhich may have a deeply imporSponsored By the Officers' Club<br />\nvealed by a physical examination of other institutions where fifty to Omicron Delta Kappa Honorary<br />\ntant effect upon the game of<br />\nAbolition of the present, credit<br />\nWill Be $1.50<br />\nthe yearlings, made by Dr. Aber- ninety per cent infection is reported. Fraternity will initiate its new memThe date for the annual Military system at the Johns Hopkins Unilacrosse as played in America,<br />\ncrombie and his staff at the beginWould Bring 314.56<br />\nbers. The initiation will be public Ball has been definitely set for FriCanada and England, according<br />\nversity was effected last Saturday<br />\nfacts, however, imply and will be witnessed by the stu- day,<br />\nThe<br />\nabove<br />\nning<br />\nof<br />\nthe<br />\nyear.<br />\nacademic<br />\nThey<br />\nto Dr. Ray Van Orman, coach of<br />\nFeb. 27, according to Sweetser by the adoption by the Board of<br />\ncompare quite favorably with sim- a great deal which is, perhaps, not dents present. Dr. Ames, who has Linthicum, president of<br />\nthe Hopkins lacrosse team.<br />\nthe Officers' Collegiate Studies of the plan subat first evident. For instance, if been a member of the fraternity for Club. The<br />\nscene of the dance will mitted to it by the Committee on<br />\nDr. Van Orman intends intro- ilar statistics made at other institua rising the Freshman class were sold at the a good many years will make the be the Great Hall of<br />\nducing the Australian style of tions, all of which show<br />\nLevering. It Educational Methods and Policies,<br />\ncurrent price for fertilizer it would chief address. This is the first of will be<br />\nopen to all members of the headed by Dr. George Boas.<br />\nPlaying to his team, and will use improvement in the health of the<br />\nbring a gross sum of $314.56, F. 0. the two initiations held during the R. 0. T. C., the<br />\nit in practice sessions. If it proves college man.<br />\ncharge being $1.50.<br />\nTo Major In Letter Years<br />\nFreshmen Are Excellent Specimens B., Baltimore. Compared to the school year the other being held<br />\nThe<br />\nOfficers'<br />\nClub,<br />\ncomposed of<br />\nsuccessful, he intends to advocate<br />\nNo longer may the college comic bulk of said class, however, 44,The<br />\nplan, effective in the autumn<br />\nin the spring. The names of those cadet corps officers is sponsoring<br />\nits use in regular games instead of represent the Hopkins frosh as a<br />\nof<br />\n1932,<br />\nwhen the present freshman<br />\n682.44 lbs.), it would be extremely to be initiated will not be divulged the affair. The<br />\nthe present system.<br />\ncommittee of club class<br />\nbespectacled pygmy or an animated unprofitable to transport them any<br />\nwill be juniors, provides for<br />\nuntil the Assembly ceremony.<br />\nmembers who are in charge of the<br />\nStyle Reduces Team Size<br />\nbookworm, for the statistics show great distance, since their economic<br />\nmajoring in a specific subject in the<br />\nBall are: Ruark, chairman; Gordon,<br />\nThe most important feature of that he is physically an excellent<br />\nFounded in 1914<br />\ncurriculum, and a set of comprevalue is but $14 per ton.<br />\nOmicron Delta Kappa is a na- Finneran, Pfeiffer and Wrightson. hensive<br />\nthe Anzac style of play is that the specimen, measuring, on the averexaminations in the study in<br />\nIf placed end to end, aside from tional honorary fraternity with<br />\nteam is cut down from eleven to age, five feet, ten and eight-tenths<br />\nthe<br />\nspring<br />\nof the year in which the<br />\nfact that they might some time chapters, or circles, throughout the<br />\neight men. The field is also made inches and tipping the bar at 140.07 the<br />\nSinger,<br />\nSpeaker<br />\nHolds<br />\n;<br />\ns<br />\ntudent<br />\npresents<br />\nhimself for the dethe food ill the Levering Hall South and East. The society was<br />\nsmaller, being only 70 yards in pounds avoirdupois. His chest ex- reach<br />\ngree.<br />\nRecital At Levering<br />\nCafeteria, they would stretch some founded at Washington and Lee<br />\nlength, as compared with 110-yard pired measures 33.08 inches across,<br />\nAt the culmination of his sopho1,770.61 feet or roughly a quarter University on December 3, 1914,<br />\nfield now in use.<br />\nHenry E. Mozealous to Perform more year the<br />\nand inspired 36.22 inches.<br />\nstudent, by the new<br />\nof<br />\ntop<br />\non<br />\none<br />\nIf<br />\nplaced<br />\nmile.<br />\nof a<br />\nBefore Public Speaking Class;<br />\nand in two years' time the circle<br />\nThe field is enclosed with a fiveIn brief the following table shows<br />\nplan,<br />\nmust<br />\nchoose<br />\nhis major from<br />\nGeneral<br />\nPublic<br />\ntop<br />\nthe<br />\nInvited<br />\ncolumns<br />\nother<br />\nin<br />\ntwo<br />\nwas formed at Johns Hopkins Unifoot high wire fence. This is done the high, low and average of the the<br />\nHenry<br />\nE.<br />\nMozealous,<br />\nwelldefinite<br />\na<br />\ngroup<br />\nof<br />\nstudies organthe<br />\nacross<br />\nshake<br />\nhands<br />\ncould<br />\nmen<br />\nversity.<br />\nin order to keep, the ball constantly most important features of the phyknown<br />\nvocal<br />\nculturist<br />\nof<br />\nBaltiized<br />\nby<br />\nthe<br />\nCollege<br />\nfaculty. The<br />\nBuilding.<br />\ntop of the Woolworth<br />\nin play, since it does away with off- sical exam.<br />\nMembership Is Elective<br />\nmore, will give a lecture recital tentative grouping of studies, arThe NEWS LETTER does not offer<br />\nNorm.<br />\nLow<br />\nHigh<br />\nside plays. It also permits the specThe members of 0. D. K. are se- in Levering Hall on Wednesday, ranged solely to organize<br />\nthe work<br />\n18.34<br />\n15<br />\n29<br />\nAge<br />\nfollowing as a suggestion, of lected from the recognized 'leaders<br />\nthe<br />\n140.07 lbs.<br />\n63.8 lbs.<br />\n187 lbs.<br />\ntators to be moved nearer to the Weight<br />\nJanuary<br />\n14,<br />\nat<br />\n8.30<br />\nP.<br />\nM.<br />\n•<br />\nof<br />\nthe<br />\nindividual<br />\nstudents<br />\nand not<br />\nin.<br />\n69.96 in.<br />\n55.2<br />\n76.6 in.<br />\nlierght<br />\ncourse, but if the entire Freshman on the campus in the following five<br />\nplaying field, thus enabling the Chest Expired 39.5 in. 26.5 in. 36.22 in.<br />\nMembers<br />\nof<br />\nMr.<br />\nWheeler's<br />\nas<br />\na<br />\nfinal<br />\ncurriculum,<br />\nis<br />\ngiven<br />\nas<br />\n33.08 in.<br />\n28 in.<br />\nChest Expnd. 43 in.<br />\n(Continued on page 4, cot. 3)<br />\nclassifications — scholarship, ath- public speaking class are required follows:<br />\n536.3<br />\n276.3<br />\ncourse of the ball to be followed Strength Test 848.2<br />\nletics, social leadership (including to attend the lecture. Because of<br />\nWith much more ease than at pres(a) Laboratory science and logic:<br />\nent.<br />\nconspicuous service to the institu- various requests, the lecture will<br />\nLogic, mathematics, physics,<br />\ntion) non-athletic activities other be open to all others who are inGame Popular in Australia<br />\nchemistry, geology, biology,<br />\nthan publication, and publications. terested.<br />\nEvidently, this type of play has<br />\npsychology.<br />\nIts purpose is two-fold: to accord<br />\ncaught the fancy of Australian fans,<br />\nMr. Mozealous has previously<br />\nCotillion<br />\nJanuary<br />\nDate<br />\nof<br />\n17<br />\nis<br />\n(b)<br />\nSocial science and ethics: HisKirkley<br />\nDonald<br />\nhonor to the men that have distin- lectured to the public speaking<br />\nfor reports have been brought back Play By<br />\nAmong the Selected<br />\nBoard Affair<br />\ntory, ethics and the history<br />\nguished themselves during their classes on the uses of the voice.<br />\nto America, of crowds of 35,000<br />\nPieces<br />\nof<br />\nphilosophy, education, pounder-graduate<br />\ncareers and to form<br />\ndrawn to games in that country.<br />\nAn interesting and varied<br />\nTWO MAT MEETS ON CARD an organization of college leaders<br />\nlitical<br />\neconomy, political sci\"The most convincing argument CAST SELECTION BEGUN<br />\ngroup of songs has been selected<br />\nence.<br />\nthat<br />\nwill work for the good of the by Mr. Mozealous for his proadvanced by exponents of the new<br />\nEntrance into South Atlantic student body and the University.<br />\n(c) Literature and language:<br />\nSystem,\" Dr. Van Orman said, \"is Dramas to Be Presented Somegram.<br />\nTests is Planned<br />\nSanskrit, English, Latin, HeTo quote from the constitution of<br />\nthat it speeds up the game trementime Next Month<br />\nThe first song on the program<br />\nbrew, Greek, Ger man,<br />\nthe organization: \"Character shall will be an old English song endously. The smaller team and<br />\nIn<br />\norder<br />\nto<br />\nto<br />\naid<br />\nfinancial<br />\nlend<br />\nFrench,<br />\nItalian, Spanish,<br />\nbe the primal consideration for titled \"By the Daily Circling<br />\nThree one-act plays have been<br />\nsmaller enclosed field all aid in dothe<br />\nnewly-organized<br />\nteam,<br />\nwrestling<br />\narchaeology.<br />\nmembership.\" Thus membership in Glass,\" composed by one of Enging this. It will become second only selected from among the fifty subDoes Not Preclude Exams<br />\nin speed to ice hockey, a game which mitted in the recent contest spon- the Cotillion Board has agreed to a circle of 0. D. K. is one of the land's early composers, Dr.<br />\nThe comprehensive examination<br />\nit resembles in many respects. The sored by the Homewood Playshop, sponsor a dance and divide re- highest local as well as national Ames. This will be followed by<br />\nceipts with them. This dance will honors obtainable and the posses- a<br />\nrecitation and air from Judas does not preclude the taking of<br />\nfencing-in of the small field will it was said yesterday by N. Bryllion<br />\ntake place January 17, and is the sion of its key forms a tangible Maccabeus<br />\nin<br />\nplaywrighting<br />\ninstructor<br />\nFagin,<br />\nin<br />\n\"Arm Ye Brave.\" Course examinations. Courses in<br />\nalso allow it to be played indoors,<br />\nlast one to be held before the mid- symbol of success.<br />\ncoach.<br />\nand<br />\nTeachers<br />\nCollege<br />\nfor<br />\nthe<br />\nMr.<br />\nMozealous will also sing conjunction with the subject conthus lengthening the season.<br />\nyear examinations.<br />\nPrizes<br />\nthe<br />\nhave<br />\ngiven<br />\nwinners<br />\nto<br />\n3<br />\nPer<br />\nCent<br />\nof Students are Eligible some of Schubert's songs, among centrated upon will be compulsory,<br />\nTeam's Size Continually Decreasing<br />\nfar<br />\nthere<br />\nSo<br />\nlarge<br />\nhas<br />\na<br />\nbeen<br />\ndivulged.<br />\nplays<br />\nnot<br />\nbeen<br />\nare<br />\nThese<br />\n\"As for the cutting-down on the<br />\n0. D. K. is the final authority in which will be, \"Hark, Hark the according to the report of the Board<br />\nturnout<br />\nfor<br />\nwhich<br />\nthe<br />\nsquad<br />\nto<br />\npracFeb.<br />\nbe<br />\npresented<br />\n9,<br />\n12,<br />\n13,<br />\n14.<br />\nteam,\" continued the coach,\"history<br />\nall student matters; undergraduate Lark\" and the famous \"Ere of Collegiate Studies.<br />\nHopkins Grads Victors<br />\no'clock.<br />\nevery<br />\nafternoon<br />\ntices<br />\nat<br />\n4<br />\nIn reference to the plan, the reKoenig.\" Among the other meloshows that through the years, the<br />\nThe winning dramas are \"There Due to its financial condition Dr. rules are placed before it for interpretation; its decrees carry with dies will be the \"Gypsy Songs,\" port further declared: \"This does<br />\nnumber of men have been cut down Is No Underworld,\"<br />\nby Donald Van Orman does not deem it adsince the days the Indians played 'Kirkley,<br />\nthem weight and authority; its by Anton Dvorak and songs by not mean that courses will not have<br />\nformer Barnstormer and visable to enter collegiate competiit with vast teams over miles of<br />\nmodern English and American to be passed in the usual way, but<br />\nJohns Hopkins graduate, now dra- tion this year. Several local meets recommendations are never scorned.<br />\ncomposers. Musical analysis and it plans to do away with the heteroOnly<br />\nthree<br />\nper<br />\ncent<br />\nof<br />\nthe<br />\nunderterritory.<br />\nmatic critic for the Sunpapers ; have been arranged, however, and<br />\ngraduate enrollment is eligible for literary phases of the songs will genousness of subject matter and<br />\n\"If the innovations catch on, it \"Swing Low,\" by<br />\nElmer GreensShould stir up great interest, if we felder, a Hopkins graduate who has some of the squad will probably election to the society during the be carefully noted by Dr. Mo- to insist that a student shall know<br />\ntake part in the South Atlantic In- collegiate year.<br />\nzealous. Musical accompaniment something about his own and closely<br />\nean judge by what has happened in had several plays<br />\npurchased by<br />\nwill be rendered by Mr. Emory related subjects.\"<br />\nAustralia. If I find it successful Broadway producers; \"Be Your ter-collegiate meets.<br />\nLockard is President<br />\nPractices Four Times Weekly<br />\nH.<br />\nRoss, a graduate of Peabody.<br />\nGroup Committee In Charge<br />\nduring practice sessions, I will ad- Age,\" by Diana Ragge, a former<br />\nThe society has been often called<br />\nThe team which has been pracEach<br />\njunior's and senior's course<br />\nthe<br />\nacvocate its introduction as<br />\nPlayshop member.<br />\nticing every Monday, Tuesday, upon by Trustees, Faculty and unof<br />\nstudy<br />\nwill be determined by the<br />\ncepted style of play.\"<br />\nSelection of the casts for the Wednesday and Thursday at four dergraduate organizations on many Barnstormers Hold<br />\ninstruction<br />\nin charge of his major<br />\nproduction of the prize winning o'clock, will make its debut Satur- occasions to render its opinion. Its<br />\n\"Y\" Barn Dance subject, subject<br />\nto a group commitAnnual Engineer Ball plays has already begun, says Mr. day, January 23, at the Baltimore high standing on the campus is evi- Expect Work To Begin On Barn Imtee<br />\ncomposed<br />\nof<br />\neither all the memprovements Within Three<br />\nHeld In Y.M.C.A. Hall Fagin.<br />\nM. C. A. invitation tournament. denced by the fact that the Senior<br />\nbers<br />\nof<br />\nthe<br />\nfaculty<br />\ngiving courses<br />\nWeeks<br />\nHopes for Better Attendance<br />\nClass usually votes membership in<br />\nThe first of a series of dances to in the group or of specially desigThe Playshop coach has ex- The tournament is considered in the 0. D. K. the highest honor obbance Marks Continuance of a Cuspressed his hope that the. one-act sporting circles as one of the most tainable on the Hopkins campus. It be given monthly by the Barn- nated members, named by the detont Inaugurated By Engineering<br />\nSociety<br />\nproductions will be better attended important amateur wrestling fra- incarnates the theory of Democracy stormers was held last Friday eve- partments as their representatives.<br />\nThe second annual Engineers'<br />\nthan the presentation of \"The Faith- cases in Maryland..<br />\nin its purest form, that of equality ning in the Barn. Members of the Normally, the Board plans, the upbance was held last Saturday night Healer,\" in December.<br />\narbeing<br />\nTwo dual meets are<br />\ndramatic organization and their perclassman will spent all his time<br />\nand Fraternity.<br />\nat Levering Hall. The dance,<br />\nranged for the month of Februguests well filled the former stu- within the group of studies related<br />\nCORRECTION<br />\nThe officers for this year are as dent activities building.<br />\nMarks the continuance of a cusA colored 'to his major, but if his instructor<br />\nIt was incorrectly stated in THE ary; one with Y. M. C. A. Reserves<br />\ntom inaugurated by the various NEWS-LETTER that the program for and the other with the Y. M. H. A. follows:<br />\norchestra furnished music.<br />\ndetermines so, he may take any<br />\nengineering societies on the campus the third informal mid-day musicale, team. The Y. M. C. A. Reserves<br />\nPresident—Edwin<br />\nLockard.<br />\nPlans<br />\nfor<br />\ncourses<br />\nBarn<br />\nimprovements<br />\nelsewhere.<br />\nare<br />\nto be held today, \"will consist of a<br />\nand shows promise as a prominent joint recital by Dr. Lawrence<br />\nVice-Pres.—Bob Kyle.<br />\nunder way. It is expected by club<br />\nand Mr. which are under the direction of<br />\nTo determine whether the student<br />\nevent at the Johns Hopkins Uni- Apetran.\" Dr. Laurence A. Petran, pi- Fred Peths is usually considered<br />\nSecretary—John Heinzerling.<br />\nofficials that work will begin within has the knowledge of his subjectanist, will appear at 1.30 P. M. today<br />\nversity.<br />\nTreasurer—John Yellott.<br />\nthree weeks.<br />\nIn the musicale.<br />\n(Continued on page 4, col. 1)<br />\n(Continued on page 3, col. 4)<br />\nCoach Ray Van Orman Believes Faster Australian<br />\nGame is Improvement<br /><br />\nClass Would Bring $314,..56 For Fertilizer<br />\nAt Current Prices<br /><br />\nTHREE PLAYS SELECTED DANCE TO BE HELD<br />\nFOR MAT BENEFIT<br />\nIN PLAYSHOP'S CONTEST<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 13, 1931<br /><br />\nNEWSLETTER<br /><br />\nThe Liberalism of Mr. Schaal<br /><br />\nFOUNDED 1897<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice in Baltimore,<br />\nMd., under the Act of Congress November 3, 1879.<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins<br />\nUniversity.<br /><br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nother communications to the EDITOR-IN-CHIEF.<br /><br />\nBelmont 8778<br /><br />\nTelephone<br /><br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\nGEORGE H. DOWELL,'31<br />\nManaging Editor<br />\nFRANK CONE, '31<br />\nAssistant Managing Editors<br />\nROWLAND McD. NESS, '32<br />\nSYLVAN LEBOW, '32<br />\nJunior Editors<br />\nRAYMOND Durrx,'33<br />\nNATHAN M. HARRIS, '32<br />\nDONALD PROCTOR, '33<br />\nHAROLD B. YUDKIN,'32<br />\nHARRY GOODMAN, '33<br />\nMELVIN GUDE, '33<br />\nDAVID DOLOWITZ, '33<br />\nHERBERT L. FRIEDBERG,'33<br />\nJACK GREENFIELD, '33<br />\nMARION GROVE, '33<br />\nHAROLD KUSLOWITZ, '34<br />\nHYMAN LEVIN, '34<br />\nSANFORD SARNEY, '34<br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager<br /><br />\nS THE day approaches for the<br />\nreckoning of the case of the<br />\nHonorable E. A. Schaal versus the<br />\nsuzerains of the Central Y. M. C.<br />\nA., reminiscences of the recent New<br />\nThought assembly crop up rather<br />\npungently. Although the assembly<br />\nwas reputedly devoted to the emancipation of the dormant undergraduate intelligence, little was emancipated on the occasion save a number of beautiful illustrations of mob<br />\nphenomena. The chief difficulty<br />\nencountered at the time was that of<br />\nkeeping the gentlemen of Hopkins<br />\non the same subject long enough to<br />\ndiscuss it.<br /><br />\nA<br /><br />\nFrom the ousting of Schaal by the<br />\nY. M. C. A., supposedly for his<br />\nliberalism, they shifted to homilies<br />\non Mr. Schaal's wife and children,<br />\nhis powerful handshake, and the<br />\nsympathy that he offers to sad<br />\nfreshmen. From deprecations of the<br />\nboys of the Trustee Board, they<br />\nswerved to proposals to buy Levering Hall. From plans to sweat a<br />\ngymnasium out of Shylock Iddins,<br />\nthey jumped to plans to build the<br />\nswellest bon fire that Johns Hopkins had ever seen, by God! What<br />\nbetter denouement could there have<br />\nbeen to such an assembly than the<br />\nstreet brawl that actually followed?<br />\nII<br /><br />\nGus BURK, '31<br />\nAdvertising Manager<br />\nDAVID SYKES, '32<br /><br />\nCirculation Manager<br />\nGEORGE W. LA MONT,'32<br /><br />\nST. REGIS<br /><br />\nBy H. L. FRIEDBERG<br /><br />\nthe entire awful affair,<br />\nB UTthe OF<br />\nmost interesting and aston-<br /><br />\nishing item was the unearthing of<br />\nthe liberalism of Mr. Schaal. If<br />\none would believe Mr. Schaal's<br />\nroyal staff, he is liberalism incarnate.<br />\nHe thinks, talks and swears by libVICTOR FRENKIL, '34<br />\nWm. N. MYERS,'33<br />\nIt exudes from him and<br />\neralism.<br />\nEDGAR BLUMSTEIN, '34<br />\nMORTON ROME, '33<br />\nhis coadjutors like<br />\nruns<br />\nthrough<br />\n'34<br />\nDAVID GUTMAN,<br />\nWILBUR BLOOM, '33<br />\nGEORGE BAYLIN, '31<br />\nMAURICE R. CHASSIN,'33<br />\nsyphilis runs through an army. Personally, I am yet to be convinced<br />\nnot that Schaal has liberal views,<br />\nProduced by the R. L. Polk Printing Company, 1930 Clifton Ave., Baltimore, Md.<br />\nbut that he has any views at all.<br />\nAs far as I can determine, he's<br />\nstrictly. neuter. But for mere argument's sake—wherein has he<br />\nmanifested liberal propensities? In<br />\nprohibition? He is as dry as Professor Hollander's lectures. In literature? Glance at the Y. M. C. A.<br />\nCHANGES IN CURRICULUM<br />\nlibrary sometime. In religion? His<br />\nmeditations are a cross<br />\ntheological<br />\nuring the last decade, their has been a movement in American colbeliefs of a Negro<br />\nthe<br />\nbetween<br />\ntowards more and more elective courses. A reaction to this is<br />\nand<br />\nthe easy philosophy<br />\nMethods<br />\nand<br />\nevangelist<br />\nEducational<br />\nseen in the report of the Committee on<br />\nthis<br />\nadopting<br />\nIn<br />\nCurriculum.<br />\nyear<br />\nfourth<br />\nChrists<br />\nwho conceive<br />\nRotary<br />\nand<br />\nthird<br />\nof<br />\nPolicies on the<br />\nreport, the Board of Collegiate Studies emphasizes the fact that students<br />\nsuch pep epigrams as \"religion is<br />\nneed not be strictly confined to one of the three groups, but a major<br />\nlike an extra gallon of gasoline.\"<br />\nsubject must be selected and the student must have special permission<br />\nWhere Mr. Schaal may lay confrom his instructor or his group committee to take courses in other<br />\ngroups.<br />\ntentions to liberalism with any eviactual<br />\nan<br />\nhave<br />\nwill<br />\ndegree<br />\nA.B.<br />\nan<br />\nsystem<br />\nadopted<br />\ndence at all is perhaps in a reputed<br />\nUnder the newly<br />\nvalue. At present, the fact that a man is awarded his degree does not<br />\nprogressiveness in political or ecoshow that he has done any definite amount of work. True he has<br />\nnomic<br />\nthought and in Negro-Cauearned a certain specified number of credits, but the credit system is<br />\nsocial intercourse. The libcasian<br />\nin<br />\nspent<br />\nbeen<br />\nhave<br />\nhours<br />\nunjust. The fact that a certain number of<br />\nof<br />\nof the latter is perhaps a<br />\namount<br />\neralism<br />\ndefinite<br />\nany<br />\nthat<br />\nproves<br />\nway<br />\nno<br />\nin<br />\nlaboratory<br />\nand<br />\nclassroom<br />\ndubious liberalism, but is it at least<br />\nwor khas been done, or that any definite amount of knowledge has<br />\nbeen acquired. One course for which one receives six points may reevidence. But when Mr. Schaal<br />\nquire one hour of preparation a week outside of class, while another<br />\non the former before the<br />\nexpounded<br />\nwill require four times as much. At present a student may carefully<br />\nsome time ago, he was<br />\nLiberal<br />\nClub<br />\nselect all the courses of the former type and receive the same degree<br />\nat the fear of<br />\nprostrated<br />\nsomewhat<br />\nhard.<br />\nas<br />\ntwice<br />\nas another man who has learned much more and worked<br />\nonly<br />\nis<br />\ncourses<br />\nand refused<br />\nquoted<br />\nelective<br />\npublicly<br />\nbeing<br />\nof<br />\nndance<br />\nover-abu<br />\nan<br />\nThis reaction against<br />\nto permit any portion of his address<br />\nnatural. Some organization of the work of student is necessary in<br />\nseveral ways. In the first place, the student will now have a compreto be published. I have always<br />\nhensive knowledge of some field rather than some slight leaning in<br />\ninclined to believe that people<br />\nbeen<br />\nmany unrelated subjects. Secondly, the A.B. degree assumes some<br />\nand rant behind closed<br />\nswear<br />\nwho<br />\nactual value as mentioned above. Lastly, the student will not be so inas sincere is peoabout<br />\nimmedare<br />\ndoors<br />\nclined to sweep from his mind everything related to a course<br />\nneed<br />\nwill<br />\nhe<br />\nthat<br />\nknows<br />\nhe<br />\nfor<br />\nof their physical<br />\nexamination<br />\nboast<br />\nple who<br />\niately following the final<br />\nthe knowledge acquired in latter courses and must take a comprehensive<br />\nsafety of secondthe<br />\nprowess from<br />\nexamination.<br />\nstory windows. Mr. Schaal may<br />\nIn planning the curriculum of the third and yourth years, the comcall this and the above liberalism.<br />\nmittee considered the needs of two types of students. In the first place,<br />\nBut if it is liberalism, then the<br />\nit was necessary to consider those who know definitely what their work<br />\nLiberal of all died making<br />\ngreatest<br />\nUnithe<br />\nat<br />\nwhile<br />\npursue<br />\nto<br />\nwish<br />\nthey<br />\nin life is to be, and what courses<br />\nfaces at a monkey down in Tenversity. The plan adequately provides for these students. The other<br />\nnessee!<br />\ngroup consists of those who desire \"a liberal education.\" At first sight,<br />\nit would appear that ample provision for these men has not been made<br />\nIII<br />\nas there is not so good an opportunity as formerly to take courses in<br />\nobto<br />\nthat<br />\nassuming<br />\nthus<br />\nis<br />\none<br />\nHowever,<br />\nmany different subjects.<br />\nHE Y. M. C. A. is doubtless the<br />\ntain \"a liberal education\" one must have a free choice of courses. This<br />\nmost unsavory, ignorant and<br />\nmore<br />\na<br />\nreceive<br />\nshould<br />\nis not the case. Under the proposed system one<br />\nfirst<br />\nthe<br />\nDuring<br />\norganization of its<br />\nsystem.<br />\npresent<br />\nhypocritical<br />\nthe<br />\nunder<br />\nthan<br />\neducation<br />\nthorough<br />\nbreed. It has shielded congenital<br />\ntwo years, as now planned one takes many general survey courses and<br />\nreally covers the same ground only in less detail than the average stuill-humor and bigotry with a most<br />\ndent at present takes four years to cover. In the last two years as<br />\nand odious affability. Its<br />\ntransparent<br />\nplanned, one begins to specialize and gains a thorough knowledge of<br />\nfor human brothdevotion<br />\nof<br />\nshouts<br />\none field. All in all one obtains a more liberal education by this<br />\ninterrupted only<br />\nbeen<br />\nhave<br />\nerhood<br />\nmethod than under the former system.<br />\nexaminacomprehensive<br />\nthe<br />\nsystem,<br />\nthe vilest sort<br />\nin<br />\nindulgence<br />\ncredit<br />\nthe<br />\nby its<br />\nThe abolishment of<br />\ntion, and the organization of the student's studies are forward steps in<br />\nto those<br />\ndiscourtesy<br />\nand<br />\nof prejudice<br />\nthe of education. The committee had a difficult task before it, and to<br />\nis born<br />\nIt<br />\naid.<br />\nto<br />\nit has contracted<br />\nour mind, they have solved their problems very successfully. The<br />\nof and patronized by mediocre perpresent administration has been eminently successful in its efforts to<br />\nsons who sacrifice truth and honesty<br />\nkeep Hopkins in a prominent place in the educational world.<br />\nOffice Manager<br />\nISADOR GUTMAN, '33<br />\nWILSON RUTHERFORD, '31<br />\nCHARLES NEY, '33<br />\nABRAM BURK, '34<br />\nSIMON LITT, '33<br /><br />\nEDITORIALS<br /><br />\nD<br /><br />\nT<br /><br />\nto mediocre thoughts. It is as unChristian as it is conservative.<br />\nJust as the Y. M. C. A. is in<br />\nbelligerent antithesis to intellectual<br />\nprogress, just so it maintains a<br />\nsimilar attitude toward social progress. And no one will question<br />\nthe statement that it is a conservative organization. Consequently, if<br />\nMr. Schaal gives us his own word<br />\nfor his liberalism and if the Central Y. M. C. A. is convinced that<br />\nMr. Schaal is profaning thereby the<br />\nY. M. C. A. and its swimming pools<br />\nand prayer rooms then there is as<br />\nlittle excuse for Mr. Schaal's presence in the Y. M. C. A. organization as there is for the Y. M. C. A.<br />\norganization's presence on the Johns<br />\nHopkins campus!<br />\nMany have attempted to play up a<br />\nsort of maudlin pathos in the matter,<br />\nto wit: the tearing of embryo liberals from the bosom of the papa<br />\nliberal, Mr. Schaal. But to me the<br />\nwhole business is so delightfully ridiculous that it almost eclipses all<br />\n)ther considerations. Consider, if<br />\nyou will, the glorious fun encountered in a situation wherein an undisputably conservative organization as the Y. M. C. A. proposes to<br />\noust for liberalism from a campus<br />\nsupposedly a birthplace of liberalism, a man who professes liberal<br />\nbeliefs but who actually is about as<br />\nliberal as the King of England.<br /><br />\n1815-1817N. Charles Street<br />\nSTUDENTS MEETING PLACE<br />\nClub Breakfasts<br />\nSpecial Luncheons 50 cents<br />\nDinners 65 cents<br />\nRenowned as \"Just the Place\" for Supper<br />\nAfter the Theatre or Dance<br />\nOPEN UNTIL 3:00 A. M.<br /><br />\nA. H. FETTING<br />\nMANUFA CTURING JEWELRY CO.<br />\nManufacturers<br /><br />\nGreek Letter Fraternity Jewelry<br />\n314 NORTH CHARLES STREET•<br /><br />\nU-DIR1VE-IT, Inc<br /><br />\n•<br /><br />\n15 N. High St.<br /><br />\nCHEVROLETS AND FORDS<br />\n15-10c Per Mile<br />\nSEDANS, COACHES, SPORT COUPES, ROADSTERS<br />\nPlaza 4089—Calvert 5769<br /><br />\nIV<br />\nSCHAAL is<br />\nWHETHER<br />\neventually removed or not,<br />\nmakes little difference to me. Apparently it means little to anybody<br />\nelse on the campus, for since the<br />\nNew Thought assembly no reference to the matter has been made,<br />\nwhile the Student Council has carefully neglected to forward to the<br />\nCentral Y. M. C. A. the resolution<br />\n)f disapproval passed by the Student Council at the assembly. I do<br />\nnot regard this apparent disinterest<br />\nas an expression of antipathy to Mr.<br />\nSchaal, but merely for what it is<br />\n—disinterest.<br />\nMr. Schaal palpably is not a leader of campus thought. His periodic<br />\ncamp meeting that goes under the<br />\nponderous title of \"Conference\"<br />\ndoes not even. attract the Y. M. C.<br />\nA. royal staff. The Liberal Club,<br />\ncredited as his achievement, is little<br />\npopular with graduates or undergraduates. Nor, indeed, in my opinion, is its liberalism unimpeachable.<br />\nLevering Hall despite the swift<br />\nstyle of Y. M. C. A. literature is<br />\nnot a Student center for reasons<br />\nother than convenience and expedience. I, myself rarely make use of<br />\nthe building outside of my connection with the NEWS-LETTER. And<br />\njudging by some of the specimens of journalism that appear<br />\nin both the Black and Blue Jay and<br />\nthe NEWS-LETTER either could be<br />\nwritten in an alley as well as behind<br />\nmahogany desks.<br />\nBut neither Schaal nor the soft<br />\nsofas of Levering Hall are indispensible to Hopkins. No one particularly wants him to go. No one<br />\nparticularly cares if he stays. If<br />\nhe goes the Barnstormers will continue as they have continued, the<br />\nJay will persist in stories of Virgin<br />\nLove, Coach Van Orman will still<br />\nput out bum football teams, Broadus Mitchell's sense of humor will<br />\nstill thrive and Mr. Lockard will<br />\nsell as many roast beef sandwiches<br />\nas heretofore. And if he stays . ..<br /><br />\n\"Friend of the Hopkins Man\"<br /><br />\nUnion Trust Company of Maryland<br />\nCHARLES AND FAYETTE STREETS<br />\n\"On the Route of the Charles Street Bus\"<br /><br />\nDECORATIONS<br /><br />\nINTERIOR WOOD WORK<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\nShow Rooms<br />\n343 N. Charles Street<br /><br />\nFactory<br />\n600 S. Pulaski Street<br /><br />\nF. Y. I.<br />\nmeans<br />\nFor<br />\nYour<br />\nInformation\"<br />\nHIM/ lell ON Read Tompl<br /><br />\nF. Y. I.<br />\nYou read, of course, but how do you select your<br />\nreading? The entire booktrade is co-operating in<br />\nthe publication of a newsy, up-to-date magazine<br />\nthat will keep you posted. Would you like us to<br />\nsend it to you with our compliments?<br /><br />\nNorman Remington Co.<br />\n347 N. Charles St.<br />\nBaltimore, Md.<br /><br />\nSurely! I want to know what's<br />\ngoing on. Send your magazine<br />\nmonthly. No obligation, of<br />\ncourse.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 13, 1931<br /><br />\nBASKETEERS SHARE<br />\nWEEK-END HONORS<br />\nJays Win Over Brooklyn<br />\n22-14; Lose To Army 41-33<br />\nLOSERS SLATED<br /><br />\nTO<br /><br />\nWIN<br /><br />\nKelly Stars In Both Games for<br />\nJohns Hopkins<br />\nAfter their surprising showing<br />\nagainst Loyola College last week the<br />\nHopkins basketball team kept up<br />\nthe good work an a trip to New<br />\nYork State over the week-end. On<br />\nFriday night Brooklyn Poly fell before the Jay quint the score being<br />\n22-14. Saturday afternoon the Army<br />\nwon a 41-33game from the Black<br />\nand Blue five at West Point. However as was the case against Loyola,<br />\nthe Jays proved much stronger than<br />\ntheir rivals had expected.<br />\nPoly Unable To Score<br /><br />\nBefore meeting the Jays, the<br />\nBrooklyn team had won three<br />\nstraight games and were given more<br />\nthan an even chance to defeat the<br />\nBaltimore team. Don Kelly and Silverman, who had done good work<br />\nagainst the Loyola forwards, were<br />\nagain on the job and the Poly team<br />\ncould not break into the scoring<br />\ncolumn during the first twenty minutes of play. In the meantime field<br />\ngoals by Don Kelly, Jones and<br />\nBrook, and a foul goal by Jones<br />\nhad enabled Hopkins to run upa<br />\nfairly safe margin and the half ended with the Jays enjoying a 9-0<br />\nlead.<br />\nWith the start of the second half<br />\nthe Brooklyn attack began to find<br />\nthe range with the result that Wilson and Staehlick scored two<br />\ndouble-deckers apiece. Jansen, Poly<br />\nforward, was their high point scorer<br />\nwith six points to his credit. These<br />\npoints were the result of three field<br />\ngoals.<br />\nKelly Scores Four Goals<br /><br />\nHowever, during this interval<br />\nthe Jays had not been idle for Jones<br />\nhad scored another field goal,<br />\nBrooks had made good on a free<br />\nthrow, the result of a foul, and<br />\nGunnett, who replaced the redhaired center later on, had counted<br />\non a field goal. In addition Don<br />\nKelly counted four double decker<br />\nand this total gave the Jays their<br />\nmargin of victory.<br />\nDon Kelly was the high point<br />\nscorer of the evening with twelve<br />\npoints credited to him. Jones with<br />\nfive followed him, while Brooks<br />\nwith three, and Gunnett with two<br />\npoints were the other scorers. Silverman, although not among the<br />\nscorers, played a fine defensive<br />\ngame and was instrumental in holding down the number of field goals<br />\ngarnered by the New orkers.<br />\nThe inability of the Poly team to<br />\ntake advantage of their foul shots<br />\ncost them several points and aided<br />\nin their downfall.<br />\nVisitors Rush Jays<br /><br />\nWhen Coach Darley's men lined<br />\nUp against Army Saturday afternoon they realized that they were in<br />\nfor a struggle. As a matter of fact,<br />\nthe Soldiers had just run a string<br />\nof three consecutive victories which<br />\nthey intended not only to keep unbroken but which they wished to<br />\nextend at the expense of the Baltimoreans. Realizing this, the visiting quint started off with a rush.<br />\nShortly after the opening jump,<br />\nDon Kelly sank one from the side<br />\nof the court. Herb, a member of<br />\nthe Army backfield during the football season, made it 2-all after taking a pass from Blanning. Then<br />\nBrooks, rangy Jay center, scored a<br />\nfield goal and when Blanning<br />\nfouled Silverman, the latter made<br />\ngood on his free shot.<br />\nCadets Take Lead<br /><br />\n- THE MAIL BAG<br />\nEditor of the NEWS-LETTER:<br />\nDear Sir:<br />\nFrequently individuals of the<br />\ncampus are .inspired with initiative<br />\nenough to make inquiries as to their<br />\nstatus quo in the policies of this<br />\ninstitution. There is one question<br />\nwhich I would wish answered because it has remained a mystery to<br />\nthe unsophisticated collegian an unduly long time.<br />\nWhat has happened to the Cage<br />\nFund drive?<br />\nRumors have it that the Varsity<br />\nClub has taken the matter into their<br />\nown hands and are attempting to<br />\nfinance the construction. Well and<br />\ngood, but is there any verification<br />\nfor this rumor?<br />\nThe average student's conception<br />\nof the history and plans of the Cage<br />\nare not at all clarified. The class of<br />\ntwenty-nine took the matter into<br />\ntheir hands when their chairman<br />\nwas appointed. But due to no fault<br />\nof the capable chairman, sufficient<br />\nfunds could not be raised and so<br />\nthe matter apparently came to an<br />\nundignified and ignominious finish.<br />\nThe other outside sources of revenue had already been tapped and<br />\nstill the required quota had not been<br />\nattained. There was no other organization in any way affiliated with<br />\nthe University who were depressed<br />\nabout the failure to do anything<br />\nabout it except the Varsity Club.<br />\nThe rumor concerning their activities has this logical justification. It<br />\nit justly placed too for the Club<br />\npersonifies those men who should<br />\ntake an interest in the athletics of<br />\nthe University, because they know<br />\nthe needs at Homewood. And if<br />\nthere is one thing that is a requisite<br />\naround campus, it is a place for<br />\nthe indoor sports to have free lance.<br />\nIt is rather a pathetic need too, for<br />\nHopkins is one of a few modern<br />\ncolleges that have no gymnasium of<br />\nany sort.<br />\nIt would seem that other expenditures that the University has<br />\nliquidated could have been used to<br />\na better advantage. The artificial<br />\nlighting system has proved rather<br />\nuseless and void, football at night<br />\ndoes not have the attraction that the<br />\nold afternoon contests had, the<br />\nlighting can be used only two and a<br />\nhalf months in the year, Lacrosse<br />\nis impossible because the pellet can<br />\nnot be seen and the money employed<br />\nin construction could well have been<br />\nutilized in the Cage Fund where its<br />\nadvantage can in no way be doubted<br />\nnor impaired.<br />\nThat has all passed and still the<br />\nquestion of Cage Fund remains a<br />\nmystery and a curiosity.<br />\nWould some one advise the campus in its entirety exactly what has<br />\nhappened to the Cage Fund and its<br />\nfuture possibilities?<br />\nC. F.<br />\nquintet scored three more field<br />\ngoals, the home team added seventeen points with the result that at<br />\nthe end of the half the score stood:<br />\nWest Point 23, Hopkins 11.<br />\nWest Point Increases Lead<br /><br />\nSoon after the start of the second<br />\nhalf the West Pointers added two<br />\npoints to their lead by virtue of a<br />\nfield goal scored by Strother. A<br />\nrally by the Hopkins team was<br />\nstarted by Jones with a field goal<br />\nand continued by Don Kelly, who<br />\ncaged two more in succession.<br />\nFor the remainder of the game<br />\nthe Jays outscored their opponents<br />\nand although they sliced the lead to<br />\na great extent they were unable to<br />\nknot the count and at the final gun<br />\nthey had missed by a margin of<br />\nfour field goals.<br />\nBlanning and Strother of West<br />\nPoint scored thirteen points between them. Kreuger, with six<br />\nfield goals and a foul to his credit,<br />\nwas high point man of the game.<br /><br />\nThe Cadets then took the ball into<br />\ntheir opponents' territory and after<br />\nmissing several attempts, Kreuger<br />\nscored a field goal for them. AlMost immediately Blanning counted<br />\ntwo points with a nice shot.<br />\nThis gave the Hudson river boys<br />\nKelly Stars for Jays<br />\na lead that they never relinquished<br />\nFor Hopkins, Don Kelly was the<br />\nand although the blue-jerseyed individual star. In addition to<br /><br />\nOLD POINT SYSTEM<br />\nCHANGED BY BOARD<br /><br />\nJ. H. U. Blue Jay To Be<br />\nIssued On Hopkins<br />\nCampus Next Friday<br />\nThe 'Black and Blue Jay\" will<br />\nmake its appearance on the campus sometime next Friday, January 16.<br />\nThe cover page by Miles Murphy, is entitled \"Exam Number.\"<br />\nOther features include an interview with Dr. Joseph T. Singewald, professor of Economic<br />\nGeology at Hopkins, by Harold<br />\nKuslovitz.<br />\nTwo of the jokes which appeared in the last issue of the<br />\n\"Black and Blue Jay\" were selected by the College Humour<br />\nmagazine for a recent issue.<br /><br />\nRevision of Curriculum to be<br />\nEffective in 1932<br />\nNEW COURSE PLANNED<br />\nAim<br /><br />\nof Collegiate Board Is<br />\nGreater Specialization<br /><br />\n'matter organized and should go beyond the material offered in his<br />\ncourses is the purpose of the final<br />\ncourse—examinations, as outlined<br />\nby the committee.<br /><br />\nBoyce, Stearn Clip Time On<br />\nJ. H. U. Records<br />\nJAYS GET YOOR START<br />\nMeet New York U. Next Saturday At N. Y.<br />\nJourneying to Newark for their<br />\ninitial appearance, the Hopkins<br />\nswimming team met defeat at the<br />\nhands of the University of Delaware by the close score of 35 to 30.<br />\nHowever, the fact that two Hopkins<br />\nrecords were broken shows that the<br />\nteam made a very creditable showing.<br />\nBoyce, swimming in two previous<br />\nevents, won the 440 yard freestyle<br />\nin the fine time of 6 minutes, 26 3/5<br />\nseconds.<br />\nClip Seconds from Records<br /><br />\nOutline Comprehensive Examinations<br /><br />\nReferring to the comprehensive<br />\ntype of examinations, it was suggested by the committee that \"in<br />\ngeneral, the questions should avoid<br />\nsearching detail and should be so<br />\nchosen as to show whether the student has a grasp, first, of the fundamental principles of his own and<br />\nclosely allied subjects, and, second,<br />\nof the technique of workers in his<br />\nfield.\"<br />\nSubsequent to consultation with<br />\nthe various Departments in the<br />\nHopkins, arrangements have been<br />\nmade to offer additional new courses<br />\nin the curriculum in order that sufficient supplementary material for<br />\nthe effective operation of the groupstudy system may be provided.<br />\n\"Evils\" Cited By Committee<br /><br />\nIt is the belief of the committee<br />\nthat three practices now impede the<br />\nsatisfactory educational training of<br />\nthe student: (1) the determination<br />\nof a man's fitness for the A. B. degree on the number of Points-credit<br />\nhe has acquired; (2) the lack of<br />\nprovision for the organization of a<br />\ncoherent education in the third and<br />\nfourth years; (3) the presentation<br />\nof lecture courses for upperclassmen, \"which has put a premium<br />\nupon the student's receptivity and<br />\ndiscouraged that skeptical and inquiring spirit extremely important<br />\nin men who wish to contribute to<br />\nthe progress of civilization rather<br />\nthan be its beneficiaries alone.\"<br /><br />\nThis clipped (<br />\n7 3/5 seconds from<br />\nthe previous record of 6 minutes,<br />\n34 1/5 seconds, held by Brinton<br />\nStone, '26. Cook added to the Hopkins' score by taking second place in<br />\nthis event.<br />\nAnother Hopkins' record fell<br />\nwhen Stearn won the 200 yard<br />\nCharges Made Against System<br />\nbreast-stroke in 3 minutes flat, lowAdmitting the credit system as<br />\nering the former record held by A. 'being a convenient way of counting<br />\nSwanson,'27 by 3 2/5 seconds. Sad- up courses, the committee charged<br />\nler captured second place.<br />\n\"in practice it amounts first to<br />\nJays Have Uphill Battle<br />\nequating .the number of hours a<br />\nGetting off to a bad start by losing week a student has spent in classthe relay, 50 yard freestyle and 150 rooms with the amount of knowlyard back-stroke, the Jays had an edge he has received; second, it<br />\nuphill battle. Frey, Hanhart, Doel- gives the student the idea that once<br />\nler, Boyce .swam in the relay but a course is ended, it is absolved and<br />\nthe University of Delaware natators- may be forgotten.\"<br />\nwere too strong for the Hopkins<br />\nBecause of the point-credit sysswimmers.<br />\ntem and schedule difficulties, the reDelaware carried off first honors port continues, students are perin the 50, yard freestyle but Capt. mitted to take any courses whatsoDoeller and Boyce took second and ever so long as the prerequisites<br />\nthird places respectively..<br />\nhave been filled. As a consequence<br />\nDelaware Wins First<br />\nthey are graduated \"with a heteroIn the 100 yard freestyle Dela- geneous collection of information<br />\nware won first and second and Bud which is bound to be superficial.\"<br />\nFrey third. The time for this event . Lecturers Repeat Information .<br />\nIn regard to the lecture courses<br />\nwas 1 minute, 1 2/5 seconds.<br />\nit<br />\nwas averred the practice has deHoffman placed third in the 150<br />\nveloped<br />\na tendency on the part of<br />\nyard back-stroke but was disqualiteachers<br />\nto \"repeat information<br />\nfied, giving all three places to Delawhich<br />\nthey<br />\nor their colleagues have<br />\nware.<br />\nalready<br />\nprinted<br />\nin text-books and<br />\nReid, South Atlantic Champion,<br />\narticles.\"<br />\ntook first in the diving. Second and<br />\nTo allow the Johns Hopkins stuthird went to Delaware.<br />\ndents<br />\nto gain preeminence, and not<br />\nA three man medley was added<br />\nwhich Delaware won. For Hop- mediocrity, in their fields, it was<br />\nkins Doeller swam the 100 yard said, they must early acquire the art<br />\nback, Reid, the 100 yard breast and of teaching,themselves in preference<br />\nto the habit of being taught.<br />\nAdams the 100 yard free.<br />\nThe Committee on Educational<br />\nBoyce was high point scorer folMethods<br />\nand Policies includes Dr.<br />\nReid.<br />\nand<br />\nStearn<br />\nlowed by<br />\nDean; Kent K. GreenBerry,<br />\nE.<br />\nW.<br />\nTo Meet New York U.<br />\nof<br />\nthe<br />\nhistory department;<br />\nfield,<br />\njourteam<br />\nJay<br />\nNext Saturday the<br />\nBroadus<br />\nMitchell,<br />\nof the politiDr.<br />\nstrong<br />\nmeet<br />\nthe<br />\nneys to New ork to<br />\ndepartment;<br />\nDr. Ernst<br />\ncal<br />\neconomy<br />\nwhich<br />\nteam<br />\nNew York University<br />\nGerman<br />\ndepartment;<br />\nand Dr.<br />\nFeise,<br />\nvictory<br />\nopened their season with a<br />\nphilchairman,<br />\nof<br />\nthe<br />\nGeorge<br />\nBoas,<br />\nover Rider College.<br />\nosophy department.<br />\nscoring eleven points, his passing<br />\nand floorwork were the features of Committee Organized<br />\nthe game.<br />\nFor Public Speaking<br />\nThe line-ups and summaries of<br />\nIn order that the Public Speakthe game were as follows:<br />\n'Mg Classes may arrange for the<br />\nARMY<br />\nFG F TP<br />\n0<br />\n1<br />\n1<br />\n0<br />\n0<br />\n1<br />\n0<br />\n0<br />\n0<br />\n—<br />\n3<br /><br />\nHOPKINS<br />\nFG T TP<br />\n2 6<br />\n0 6<br />\n0 0<br />\n1 3<br />\n1 1<br />\n1 11<br />\n2 6<br /><br />\n4 Jones f<br />\n9 C. Kelly, f.....3<br />\n0<br />\n13 Wood, f<br />\n1<br />\n0 Brooke, c<br />\n....0<br />\nc<br />\nGunnett,<br />\n8<br />\n5 D. Kelly, g....5<br />\n2 Silverman, g...2<br />\n0<br />\n01<br />\n—<br />\nTotals ....13<br />\n41<br /><br />\nPhone Belmont 7908<br /><br />\nBirely's Pharmacy<br /><br />\nMembers Florists Telegraph Delivery Association<br /><br />\nST. PAUL at 33rd STREET<br />\nYour Neighborhood Drug Store<br /><br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy,<br />\nCigars<br />\nUnexcelled Fountain<br />\nService<br /><br />\nFLORISTS<br /><br />\nMake Our Store Your Store<br /><br />\nAND<br /><br />\n(Continued from page 1, col. 6)<br /><br />\nHOPKINS NATATORS SUNK<br />\nBY DELAWARE U., 35-30<br /><br />\nBlanning, f...2<br />\nStrother, f....4<br />\nKreuger, f....6<br />\nBesson, f<br />\n0<br />\nEpler, c<br />\n4<br />\nHerb, g<br />\n2<br />\nMalloy, g<br />\n1<br />\nAdams, g<br />\n0<br />\nGregory, g....0<br />\n—<br />\nTotals ...19<br /><br />\n3<br /><br />\n7 33<br /><br />\nvarious activities connected with the<br />\ncourse a committee consisting of<br />\none member from each section has<br />\nbeen elected. Triplett, chairman;<br />\nLockard, secretary; Arias, temporary treasurer; Darrell and Heaney<br />\nare the committeemen.<br /><br />\nDECORATORS<br />\nBelmont 8040-8041<br /><br />\n1918 N. Charles St., near 20th<br />\nPhone: Vernon 0573<br /><br />\nPARISIAN TAILORING<br />\nCOMPANY<br />\nCleaning, Dyeing, Pressing<br />\nRepairing<br /><br />\nFor Better Cleaning and<br />\nDyeing<br /><br />\n346 E. 33rd STREET<br /><br />\nFRIED'S<br /><br />\nCor. University Parkway<br /><br />\n101 E. 21st St.<br /><br />\nBelmont 5501<br /><br />\nD'S<br />\nF°<br />\nTHIS WEEK<br /><br />\nNights, 8.30; $1 to $3. Wed. Mat., 2.30; $1, $1.50, $2.<br />\nSat. Mat., 2.30; $1 to $2.50<br /><br />\nThe Theatre Guild, Inc., Presents<br />\n(The Fourth Play of the Third Baltimore Subscription Season)<br /><br />\nThe Theatre Guild Acting Company in<br /><br />\nGREEN GROW THE LILACS<br />\nAn American Folk Play by LYNN RIGGS<br />\nStaged by Herbert J. Biberman<br />\nSetting by Raymond Sovey<br />\nWith This Distinguished Cast<br />\nJUNE WALKER<br />\nHELEN WESTLEY<br />\nRICHARD HALE<br />\nFRANCHOT TONE<br />\nLEE STRASBERG<br />\nTEX COOPER<br />\nRUTH CHORPENNING<br />\nWOODWARD RITTER<br />\nAnd Many Cowboys<br /><br />\nHOPKINS STUDENTS EAT AT<br /><br />\nThe Stadium Restaurant<br />\nCor. Greenmount Avenue and 31st Street<br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br /><br />\nJ. H. FURST CO.<br /><br />\nTHE RELIABLE WEAVING CO.<br /><br />\nPRINTERS OF<br /><br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br /><br />\nPhilological and Scientific<br />\nPublications<br />\n12-20 Hopkins Place, Baltimore<br /><br />\nWhen in 1New York dine at<br /><br />\nSt. Regis Restaurants<br />\nLocated at<br /><br />\n1491 Bdwy at 41st St.<br />\n1400 Bdwy at 42nd St.<br />\n1500 Bdwy (Cadillac)<br />\n1570 Bdwy. at 47th St.<br />\n1627 Bdwy. at 50th St.<br /><br />\nSelf Service Stores<br />\n145 W. 42nd St.<br />\n210 W. 42nd St.<br />\n410 Leington Ave.<br />\n(Grand Central Terminal)<br /><br />\nPHONE: VERNON 5013<br /><br />\nCENTRAL PARKING CO.<br />\nLargest Open Air Parking in the State of Maryland<br />\n309-311 W. Franklin St.<br />\n5 CONVENIENT PLACES:<br />\n209 Davis St.<br />\nHoward and Druid Hill Ave.<br />\n20 Clay St.<br />\nHoward and Centre Sts.<br />\nBALTIMORE, MD.<br /><br />\nSTETSON CLOTHES<br />\nfor<br /><br />\nCollege z)Nen<br /><br />\nNationally<br /><br />\nJustly<br /><br />\nKnown<br /><br />\nFamous<br /><br />\nMADE FOR YOU<br /><br />\nFOUR NORTH HOWARD STREET<br /><br />\n4<br /><br />\nCALLS ON U. S. FOR<br />\nUNEMPLOYMENT AID<br />\nNorman T homas Declares<br />\nGovernment Would be Most<br />\nEffective Agent<br />\nCITES CAPITAL FAILURE<br />\n---- —<br />\nProgressive Believes U n e mployment is Direct Result of<br />\nIndustrial Revolution<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 13, 1931<br /><br />\nDr. Paul Harrison Tells<br />\nOf His Twenty Years'<br />\nStay In Arabia<br />\nDr. Paul Harrison, a graduate<br />\nof Johns Hopkins Medical School<br />\naddressed the University Supper last night.<br />\nDr. Harrison, who has spent<br />\ntwenty years in medical work in<br />\nArabia, gave an account of his<br />\nlife and experiences, among the<br />\nnatives of Arabia.<br />\nDr. Harrison will speak at the<br />\nAssembly on Thursday, March 5.<br /><br />\nUnemployment, the direct result<br />\nof the industrial revolution, should<br />\nbe relieved by the national government, the most effective agent in<br />\nthe nation-wide depression, the belief expressed by Norman Thomas,<br />\nnoted Socialist, in his address be- Club Supplies Unemployed<br />\nfore a Hopkins Y. M. C. A. supper With Copies of Magazine To<br />\nmeeting last Thursday evening.<br />\nPeddle On Street<br /><br />\nHOPKINS LIBERAL CLUB<br />\nHELPS IDLE WORKERS<br /><br />\nFederal Government More Effective<br /><br />\n\"Since we are now in the midst<br />\nof one of the periods of unemployment,\" said Mr. Thomas, \"steps<br />\nshould be taken to relieve immediate needs. Although charitable<br />\norganizations and local governments<br />\ncan do much to help, the national<br />\ngovernment can be the most effective agent, since the depression is<br />\nnation-wide.\"<br />\nThe existing system, believes the<br />\nSocialist leader, should be changed<br />\nto prevent recurrences of economic<br />\ndepression. The capitalist system<br />\nhas had its chance and has failed, it<br />\nwas held.<br /><br />\nSENIORS HOLD UP<br />\nHULLABALOO WORK<br /><br />\nINTERCOLLEGIATE<br />\nNEWS<br /><br />\nUnemployment is not a problem<br />\nin the liquor traffic, according to 3 4 2 6 7 3 9 4 5 7 8 6 I 5 1<br />\nDr. Nicholas Murray Butler, president of Columbia University.<br /><br />\nCo-eds at the University of DeLack of Senior Statistics Slows troit, although they number only<br />\nGiving a ride to another student<br />\n50, have been forbidden to converse at the University of Michigan is<br />\nUp Advancement<br />\nwith the male students at anytime against the college rules.<br />\nTO USE NEW PROF CUTS or at any place on the campus.<br />\nWill Withhold Cover Contest<br />\nWinners Until June<br /><br />\nThe University of Rochester refuses to go beyond its own size in<br />\nAdvancement of work on the arranging its football schedule, and<br />\n1931 Hullabaloo is taking' place has turned down offers from N.<br />\nY. U., Army, Penn and several<br />\nrapidly, annual editors said yesterother big institutions.<br />\nday. Aside from the usual features<br />\nor requirements of a year book it<br />\nwas declared this year's publication<br />\nThree hundred Washington and<br />\nwill contain a number of novel in- Lee fresh clad only in pajamas<br />\ncrashed a local theater after a pep<br />\nnovations.<br />\nrally.<br />\nIt is expected that the senior section will go to press before the midyear examinations. The cause of<br />\nThe Columbia \"Spectator\" took a<br />\nthe delay has been the negligence poll of the men in the street. last<br />\non the part of the seniors in failing week to find out his opinion of colto turn in their Statistics Sheets. lege men, and discovered that the<br />\ngeneral idea was that college stuWithout these sheets more importdents spend most of their time<br />\nant work can not proceed. It is loafing.<br />\nhoped by Hidlabaloo officials that<br />\nall who have been delinquent in fillOnly one freshman in four has a<br />\ning out these statistics blanks will<br />\nchance to stand the grind of coldo so shortly so that this section of lege life,<br />\naccording to the president<br />\nthe book may be entirely completed. of Michigan State University.<br /><br />\nThe Liberal Club is at present<br />\nengaged in an enterprise that it<br />\nhopes will aid somewhat in alleviating the situation among the<br />\ncity's unemployed. Every day,<br />\naccording to Joel Seidman, the<br />\nClub is distributing copies of the<br />\nmagazine \"Unemployed\" among<br />\nout-of-work men, for five cents<br />\nper copy, which are peddled on<br />\nthe streets for ten cents. The<br />\ndistribution center is in a labor<br />\nhall down-town, and members of<br />\nthe Liberal Club alternate in<br />\nmanaging the project.<br />\nCross-Country Section Ready<br />\nIssues Now On Sale<br />\nThe football section, it was<br />\nMust Study Production Distribution<br />\nThe first issue of \"Unemployed\"<br />\nProduction and distribution fnust offered in New York last month, learned, has been finished. It will<br />\nbe studied and regulated. Mr. and the second issue are now on include a sheretofore resumes of the<br />\nThomas said, and must be done by sale. The magazine is published games, supported by action pictures<br />\ngovernment agents who do not re- by the New York chapter of the<br />\nand individual photographs of the<br />\ngard the profit motive as all-im- National League for Industrial<br />\nAlong with the football,<br />\nportant. The motive was attributed Democracy with which the local players.<br />\nsection of the pubcountry<br />\ncross<br />\nas the cause for the downfall of Liberal Club is affiliated. Nor- the<br />\npress as soon as<br />\nto<br />\ngoing<br />\nis<br />\nlication<br />\nthe capitalistic system.<br />\nman Thomas, who spoke here last the dummy sheet is arranged with<br />\nDeclaring himself in favor of un- Thursday, is the president of the<br />\nphotographs and the team<br />\nemployment and old age insurance League. The cost of publication action<br />\nthese two<br />\nfor workers, Mr. Thomas discussed is five cents, so the League is mak- picture. Aside from<br />\nwritten<br />\nbeing<br />\nis<br />\nbasketball<br />\nsports,<br />\nthe dole, which he considers \"the ing no profit on this venture.<br />\nAlgame.<br />\nsuccessive<br />\nup with each<br />\nway out.\"<br />\nThe method of permitting un- though the season is just getting<br />\nCapitalists Only, Disfavor Doles '<br />\nThose who have subsisted on employed men to vend the copies started, the dummy sheet for this<br />\nrents and dividends in return for in New York resulted in the sale sec only lacks the write-ups for the<br />\nwhich no work was put in, are the of 75,000 issues. The magazine games to come. When these games<br />\nonly persons who disfavor the dole; spread to Philadelphia, where it have been played and their resumes<br />\nmet with success, and now the writtes, the section will be ready for<br />\ndeclared the \"Y\" speaker.<br />\nLiberals<br />\nare attempting to intro- publication.<br />\nUnemployment, according to him,<br />\nduce<br />\nit<br />\nin<br />\nBaltimore. Prominent , Many designs have been submitis an especial result of the Induswriters,<br />\ncommentators<br />\nand car- ted for the cover. The final selectrial Revolution,\" because of the extoonists<br />\nsuch<br />\nas<br />\nBroun,<br />\nHeywood<br />\ntensive machinization of industry.<br />\ntion will be made at a board-of-conNorman<br />\nThomas,<br />\nDr.<br />\nHenry<br />\nAt the conclusion of his address,<br />\ntrol Meeting in the near future.<br />\nthe Socialist answered questions Emerson Fosdick, Edm un d However, the decision of the board<br />\nDuffy, Art Young and many<br />\nasked by the audience.<br />\nwill not be made public until the<br />\nothers, have contributed to the<br />\npublication is distributed in June.<br />\nmagazine without any remuneraFraternity Pictures Delayed<br />\ntion.<br />\nThe fraternity pictures have been<br />\nTo Circulate Petition<br />\nrecently inAnother project which the held up because of the<br />\nRushing.\" The<br />\nLiberal Club has under way is stituted \"Freshman<br />\nJanuary 17 is Date of Cotillion<br />\nnot be taken<br />\nwill<br />\npictures<br />\ngroup<br />\nthe circulation of a petition seekBoard Affair<br />\nfraternities<br />\nthe<br />\nafter<br />\nspring<br />\nuntil<br />\ning the abolition of compulsory<br />\n(Continued from page 1, col. 3)<br />\nmen.<br />\ntheir<br />\npledged<br />\nhave<br />\none of the best amateur teams in military training from American<br />\nIn previous editions for a great<br />\ncolleges and universities. They<br />\nthe state.<br />\nY. M. 11. A. Team To Compete<br />\nhope to get 2,000 signatures to number of years, the same faculty<br />\nThe Y. M. H. A. team will enter this circular, which is being pictures have been used. This year<br />\ncompetition for the first time They floated through all universities the publication heads plan to obare under the able direction of J. and colleges.<br />\ntain more recent photographs.<br />\nSalzman.<br />\nHullabaloo Working For Prize<br />\nThe South Atlantic ChampionThe Intercollegiate Year Book<br />\n15 Students Attend<br />\nships which are held every year in<br />\nAssociation has offered a prize for<br />\nBaltimore will also be an important Mid-Winter Assembly the best year book published in<br />\nengagement for the newly organized \"The Religion<br />\nHullabaloo is entered in<br />\nof Jesus in a Confused 1931. The<br />\nHopkins team. V. P. I. is usually<br />\nand is striving to put<br />\nWorld\" to Be Topic<br />\ncontest<br />\nthe<br />\nFifteen students of the Johns out an edition that will win this<br />\nrepresented at this tournament so<br />\nthat the Hopkins wrestlers will get Hopkins University will attend the prize.<br />\na chance to oppose one of the best annual mid-winter conference of<br />\nwrestling teams in the Southern the Middle Atlantic Field Council Pressure Decreases;<br />\nof the Y. M. C. A., to be held Feb.<br />\nCollegiate Conference.<br />\nStrength Increases<br />\n6-8, inclusive, at Buck Hill Falls,<br />\nBarn Used For Training<br />\nThe Barn, with its equipment of Pennsylvania.<br />\nStatistics Show Fall of<br />\nAt the group meetings, which Freshman<br />\nmats, has been used as training<br />\nBlood Pressure, Increase of<br />\nStrength<br />\nquarters for the team. Dr. Van will be attended by leaders from<br />\n(Continued from page 1, col. 3)<br />\nOrman has seen to it that the team various colleges and universities,<br />\nhas plenty of towels and lockers. \"The Religion of Jesus in a Con- class were dropped into the middle<br />\nof the Atlantic the ratio of the<br />\nIf the 'grunt and groan\" boys make fused World\" will be discussed.<br />\nwater to the land would be increased<br />\nUniversity<br />\nstudents<br />\nwho<br />\ndesire<br />\na good showing this year they will<br />\nby<br />\n.00000000249 of a billionth of a<br />\nto<br />\nattend<br />\nthe<br />\nconference<br />\nare<br />\nasked<br />\nprobably enter collegiate competimillimeter.<br />\nIf it were dropped into<br />\nto<br />\nsee<br />\nGaillard<br />\nFrey,<br />\nchairman<br />\nof<br />\ntion next year with a full schedule.<br />\nthe<br />\npool<br />\nin<br />\nthe botanical gardens,<br />\nthe<br />\nJ.<br />\nH.<br />\nU.<br />\ndelegation.<br />\nThe<br />\ncamThere will also be a junior varsity<br />\nnot<br />\nmuch<br />\ndifference<br />\nwould be appus<br />\n\"Y\"<br />\nhas<br />\nconsented<br />\nto<br />\npay<br />\nthe<br />\nteam which will compete against<br />\nparent.<br />\nregistration<br />\nand<br />\ntransportation<br />\nfees<br />\nGilman, Poly, City and other leadfor Hopkins students. Living exWith both feet on the ground the<br />\ning High School teams.<br />\npenses<br />\nat<br />\nthe<br />\nhotel must be paid by frosh can lift about three times<br />\nWill Hold School Tourney<br />\nToward the end of March an In- the delegates.<br />\ntheir total weight of 22.34 tons, or<br />\nter-Scholastic tournament will get<br />\nJ. Stitt Wilson, former mayor of approximately the equivalent of<br />\nunder way. The bouts will be held Berkeley, California; Dr. Robert E. enough coal to keep an apartment<br />\nin accordance with the intercol- Speer, leader in the Presbyterian house going through a hard winter;<br />\nlegiate ruling and medals will be Church; and David R. Porter will and now, perhaps some one can find<br />\nawarded.<br />\nbe leaders at the \"Y\" conference.<br />\na good use for them.<br /><br />\nCo-eds at the University of<br />\nMinnesota refuse to pay student<br />\norchestras any more than the minimum scale of prices as set by the<br />\n'musicians' union.<br /><br />\nUniversity of Minnesota students residing in St. Paul are petitioning the Twin City railroad<br />\ncompany to give them better rates<br />\non the trolley lines between St. Paul<br />\nand Minneapolis.<br /><br />\nDUKE UNIVERSITY<br />\nSCHOOL OF MEDICINE<br />\nDURHAM, N. C.<br /><br />\nRENT A CAR<br /><br />\nOn your radio tonight...listen to Lorna Fantin, famous<br />\nnumerologist. She'll tell you<br />\nhow names and dates affect<br />\nsuccess in business, love or<br />\nmarriage. A real radio thrill.<br /><br />\nWEAN at 9 o'clock To-night<br />\nEVSTERNSTANDARD TIME<br />\nP. Lorillard Co., Inc.<br /><br />\nOPERATE IT YOURSELF<br /><br />\nThe Auto Rental Company<br />\nCars for Hopkins Students<br />\nDeposit Not Required<br /><br />\n2125 HARFORD AVE.<br /><br />\n111 W NORTH AVE.<br />\nPhone, Wolfe 1413<br /><br />\nSimon Ackerman Clothes<br />\nREADY TO WEAR<br /><br />\nOn October 1, 1931, carefully<br />\nselected first and third year students will be admitted. Applications may be sent at any time and<br />\nwill be considered in the order of<br />\nreceipt. Catalogues and application forms may be obtained from<br />\nthe Dean.<br /><br />\nA. JACOBS &amp; SONS<br />\n... Tailors ...<br />\n128<br /><br />\nW. Fayette Street<br /><br />\nDANCE TO BE HELD<br />\nFOR MAT BENEFIT<br /><br />\nrROM a mass of claims and counterchims,one fact stands out—AMOCOGAS gives more miles per gallon --least<br />\ncost per mile.<br />\nThis is proved every day by hundreds of<br />\ntruck-fleet operators who must know to a<br />\npenny their cost per mile—and by thousands of motorists who want low operating costs and better performance, too.<br />\nProve it to yourself by figuring your own<br />\ncost per mile. Note how many more miles<br />\nyou get to each gallon -- how this extra<br />\nmileage cuts down your cost per mile.<br />\nOver a period of time, notice your reduction in repair bills and generally reduced<br />\noperating costs.<br />\nPut it up to AMOCO-GAS, your motor<br />\nand a lead pencil. A little old-fashioned<br />\narithmetic will save you money.When you<br />\ncome to AMOCO-GAS and the lowest<br />\ncost per mile, you'll come to better allaround performance, too.<br />\nThe AMERICAN OIL COMPANY<br />\nAm...with Pas Mark= Paptheimi Is Tarpon Compirr<br />\nGemmel Office\" Baltimore. Md.<br /><br />\nviiiltdaViPi9,1741MIPAY tin;<br /><br />"}], "field_media_file": [{"target_id": 38574, "display": null, "description": null, "target_type": "file", "target_uuid": "66556d79-c5fc-4687-b5ed-dde71167c777", "url": "http://digital.library.jhu.edu/system/files/2022-03/12213-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12213, "target_type": "node", "target_uuid": "4f5b9bad-5db2-41ce-8584-0919a05229f3", "url": "/node/12213"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "f9e3a32a-bff6-46d2-9679-511aed108c8a"}]}