{"mid": [{"value": 35787}], "uuid": [{"value": "ea952f70-f764-49fd-9464-1568f325d617"}], "vid": [{"value": 35787}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:13:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12314-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:13:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:13:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Yo-<br />\n<br />\nHoo@larm<br />\n<br />\np<br />\n<br />\nguircHymI DE Nis<br />\nTHE401INSIIOFKINSINFIRMITY<br />\nBALTIMORE<br />\nU6 I S MOD I'ail NO<br />\n<br />\n\fThe Johns Hopkins University.<br />\nBALTIMORE, MD.<br />\nThirty-First Year.<br />\n<br />\nThe Johns Hopkins Press.<br />\nI.<br />\n<br />\nBeginning October 2, 1906.<br />\n<br />\nII.<br />\n<br />\nIRA REMSEN, President.<br />\nDean of the College Faculty.<br />\nDean of the Medical Faculty.<br />\n<br />\nEDWARD H. GRIPFIN,<br />\nNITILL1Alt H. HowELL,<br />\n<br />\nINSTRUCTION.<br />\n<br />\nIII.<br />\n<br />\nIV.<br />\n<br />\nFor Graduatp Students:<br />\nIn Philosophy and the Arts. (Courses for<br />\n(a)<br />\ncandidates for the degree of Ph. D.)<br />\n(b)<br />\nIn Medicine. (Courses for candidates for the<br />\ndegree of M. I).; courses for physicians.)<br />\n<br />\nV.<br />\nVI.<br />\n<br />\nFor Undergraduates:<br />\nAs candidates for the degree of B. A.<br />\n(c)<br />\nAs special students.<br />\n(d)<br />\n<br />\nVII.<br />\n<br />\nLibraries.<br />\n130,000 volumes.<br />\n157,xo volumes.<br />\n240,000 volumes.<br />\n<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\nLaboratories.<br />\n<br />\nDirectors.<br />\n<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nExperimental Psychology.<br />\n<br />\nIra Remsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark,<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam II. Howell<br />\nWilliam II. Welch,<br />\nJohn J. Abel.<br />\nJohn f: Abel.<br />\nGeorge M. Stratton.<br />\n<br />\nSeminaries.<br />\n<br />\nDirectors.<br />\n<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance,<br />\nEnglish.<br />\nHistory.<br />\nPolitical Economy.<br />\nPolitical Science.<br />\nPhilosophy.<br />\nMathematics.<br />\nPhysics.<br />\n<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. H. Hollander.<br />\nW. W. tkilloughby.<br />\nJ. Mark Baldwin.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nUndergraduate Courses (leading to B. A.)<br />\nOROUPS:<br />\ni.<br />\n2.<br />\n<br />\n3.<br />\n4.<br />\n5.<br />\n<br />\nAncient Languages.<br />\nModern Languages.<br />\nHistory and Political Economy.<br />\nMathematics and Physics.<br />\nChemistry, Biology and Geology.<br />\nSerial Publications.<br />\n<br />\nAmerican Journal of Mathematics (vol. XXVIII).<br />\nAmerican Chemical Journal (vol. XXXVI).<br />\nAmericril Journal of Philology (vol. XXVII).<br />\nStudies in Historical and Political Science (vol. XXIV).<br />\nModern Language Notes (vol. XXI).<br />\nMemoirs from the Biological Laboratory (vol. VI).<br />\nContributions to Assyriology (vol. VI).<br />\nTerrestrial Magnetism (vol. XI).<br />\nUniversity Circular (vol. XXV).<br />\n<br />\nProgrammes of the courses offered to graduate students<br />\nin Philosophy and the Arts and in the department of Medicine, and also of the undergraduate or collegiate courses,<br />\nwill be sent on application to the Registrar.<br />\n<br />\nVIII.<br />\n<br />\nIX.<br />\nX.<br />\n<br />\nXl.<br />\n<br />\nXII.<br />\n<br />\nXIII.<br />\n<br />\nXIV.<br />\n<br />\nXV.<br />\n<br />\nXVI.<br />\n<br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor. .Quarterly. 4t0. Volume<br />\nXXVIII in progress. $5 per volume. (Foreign<br />\npostage 5o cents).<br />\nAmerican Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume<br />\nXXXVI in progress. $s per volume. (Foreign<br />\n. postage so cents).<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. 'Quarterly. 8vo.<br />\nVolume XXVII in progress. $3 per volume.<br />\n(Foreign postage so cents).<br />\nStudies in Historical and Political Science.<br />\nJ. M. VINCENT, J. H. HOLLANDER and W. W.<br />\nWILLOUGHBY, Editors. Monthly. 8vo. Series<br />\nXXIV in progress. $3 per volume. (Foreign<br />\npostage so cents).<br />\nJohns Hopkins University Circular.<br />\n8vo. Volume XXV in progress. $1 per year.<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4to.<br />\nVolume XVI! in progress. $2 per year. (Foreign<br />\npostage so cents).<br />\nJohns Hopkins Hospital Reports. 4t0. volume<br />\nx III in progress. $5 per volume. (Foreign postage 50 cents).<br />\nContributions to Assyriology and Semitic Philology (Beitrage zur Assyriologie, etc.) PAUL<br />\nHAUP I` and P RI EDRICH DELITZSCH, Editors. Volume VI. in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume VI in progress.<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXXI in progress. Vs° per volume. (Foreign<br />\npostage 25 cents).<br />\nAmerican journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 8vo. $5<br />\nper vollIMC.<br />\nTerrestrial Magnetism and Atmospheric Electricity. L. A. BAUER, Editor. Quarterly. 8vo.<br />\nVolitine XI in progress. $2.5o per volume.<br />\n( Foreign postage 25 cents).<br />\nReprint of Economic Tracts.<br />\nj. II. HOLLANDER, Editor. First Series, $1.5o.<br />\nSecond Series in progress. $1.<br />\nAnnual Report.<br />\nPresented by the President to the Board of Trustees,<br />\nreviewing the operations of the University during<br />\nthe past academic year.<br />\nAnnual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published<br />\nat the close of the academic year.<br />\nReports of the Maryland Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\n<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland. $7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old Testament. Edited by Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum. to<br />\nplates. $20.<br />\nSelections from the Early Scottish Poets, By William<br />\nHand Browne. 240 pages. $1.25.<br />\nStudies in Honor of Professor Gildersleeve. 527 pages,<br />\noctavo, $6.<br />\nThe Taill . of Rauf Coilyear. Edited by William Hand<br />\nBrowne. T64 pages. $1.<br />\nPoems de Vernan Goticalez. Edited by C. Carroll Marden.<br />\n282 pages. $2.50.<br />\nBaltimore Lectures on Molecular Dynamics and the Wave<br />\nTheory of Light. By Lord Kelvin. 716 pages. $4.50.<br />\nThe Oyster. By W. K. Brooks. 226 pages. $1.<br />\nEcclesiastes: A New Metrical Translation. By Paul Haupt.<br />\nso pages. so cents.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances<br />\nmay be sent to the Johns Hopkins Press Baltimore, Md.<br />\n<br />\n\frg1r irfirst<br />\n<br />\nTilthitmas.<br />\n<br />\nTHE INN.<br />\nHE INN is full this eve<br />\nNay! I care not where you go.<br />\nHaste you! Beggar take your<br />\nleave!<br />\nNo room in the Inn. I told you so.<br />\n(Faith! Like's not she will but thieve.)<br />\nGo to the stable till the morning glow.<br />\nTHE KING'S STAR.<br />\nI see a King's Star the East Heaven ride,<br />\nWith blazing gleam and awful light,<br />\nPast all the Houses of Despair and Pride.<br />\nAnd with no show of earthly might<br />\nI see three King's at eventide<br />\nFollow the King's Aar through the night.<br />\nTHE STABLE.<br />\nA gabled ox and docile sheep;<br />\nA weary mother and her child.<br />\nThe woman's eyelids long to weep—<br />\nHer girlish face is pale and mild.<br />\n\"Little darling go to sleep.\"<br />\nThen the baby turned and smiled.<br />\nTHREE KINGS.<br />\nSpices, Frankincense, Balm and Myrrh,<br />\nFinely gilled Balsam all fresh from the fir,<br />\nA crown and sceptre of rubies rare<br />\nPoor gifts for the Heaven-born King we bear.<br />\n0, King of Kings! look down upon us,<br />\nWe be Kings of the East, so Kings of the<br />\nEarth<br />\nWe saw Thy gar, gleaming afar<br />\nCalling the Nations to worship Thy birth.<br />\nANGELS.<br />\nHalleleujah! Halleleujah !<br />\nPraise ye the Lord, bless Him<br />\nAnd magnify Him forever.<br />\n<br />\n\fTHE NEWS=LETTER<br />\nVol,. XI.<br />\nSubscriptions, $1.50 per year.<br />\n<br />\nDECEMBER 21, 1906.<br />\n<br />\nNo. 5<br />\n<br />\nPublished Fortnightly.<br />\n<br />\nio Cents per copy<br />\n<br />\nBOARD OF EDITORS.<br />\n<br />\nCarl Bernhardt, 1908, Editor-in-Chief.<br />\nLawrence Melville Riddle, 1908, Ass't Editor-in-Chief.<br />\nHarry K. Hardcastle, 1908, News Editor.<br />\nF. B. Pedrick, 1909, Ass't News Editor.<br />\n<br />\nLeGrand Winfield Perce, 1907, Athletic Editor.<br />\nAlan Chesney, 19o8, Asst't Athletic Editor.<br />\nHermann J. Hughes, 1908, Business Manager.<br />\nJ. Purdon Wright, tgo8, Asst's Business Manager.<br />\n<br />\nAddress all articles, communications, etc., to Carl Bernhardt, Box 55 Johns Hopkins University,<br />\nBaltimore, Md.<br />\nSubscriptions and business communications should be sent to Business Manager, Box 224, Johns<br />\nHopkins University, Baltimore, Md.<br />\n<br />\nEDITORIAL.<br />\nHE NEWS-LETTER wishes on behalf of the students to thank the Lacrosse<br />\nTeam of 1902 for their generous offer. Such spirit is surely an answer<br />\nto the mistaken theory that spirit is wanting at Hopkins. The class<br />\nteams of last year were recognized as one of the reasons for the successful lacrosse year. They not only aroused interest but developed<br />\nmaterial. Without interest and a well-trained scrub a team is seriously<br />\nhandicapped. Let us hope that 1902's enthusiasm will be well repaid in the shape of another<br />\nchampionship team in 1907!<br />\n<br />\nHE gentle reader will notice in this issue two letters. One is the official<br />\nstatement of the Board of Governors of the Athletic Association in regard to baseball and undergraduate football; the other a letter from Mr.<br />\nThomas Campbell apropos of baseball. Mr. Campbell's letter is equally<br />\nauthorative. THE NEWS-LETTER believes there should be a baseball<br />\nteam if it is possible. Also it believes there should be no criticism of<br />\nthe J. H. U. A. A., in its attitude on baseball up to this time, it should<br />\nbe recognized that no team can be run without money. But it seems to<br />\nTHE NEWS-LETTER that money is the only consideration. It is to be<br />\nhoped that the undergraduate team idea will not be overworked. It has many advantages but<br />\nthe fact must ever be remembered that the graduate and medical departments have just as good<br />\na right on the teams (other things being equal) as the undergraduates. As a member of the<br />\nAthletic Board has said, \"the undergraduate idea can easily he run into the ground.\"<br />\nThere is no cause for excited words over the baseball situation; if there is need<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n3<br />\n<br />\nof money for baseball let steps be taken at once, by every one, to raise funds. The writer was<br />\nmuch impressed by the fact that other colleges have taken a very great interest in Hopkins<br />\nsince the defeat of Lehigh and Virginia. THE NEWS-LETTER hopes that baseball will not be<br />\ndropped for there is plenty of material worthy of the financial backing of the students.<br />\n\"Money for Baseball !\"<br />\n<br />\nS we have said before in a previous issue, it is not exactly our intention<br />\nto pull up this or that skeleton which may lurk around the University,<br />\nor to continually point the finger of shame at the various activities which<br />\ngo to make up the daily life of the institution, but rather do we intend<br />\nto furnish a fair statement of the consensus of opinion of the under'graduate body and at the same time to bring out a really interesting<br />\npaper which will count for much in the raising of much lowered moral<br />\nstandards. \"But, 'now to business;' said Sue.\"<br />\nThe recent controversy which has arisen among the students as to<br />\nthe recognition of the baseball team has brought to our mind a question concerning the Athletic Board, that is, what does the Athletic Board really represent? One<br />\nhears on all sides statements as to the partiality of the board as to the unfairness and so on<br />\nuntil one wonders how the board ever were elected.<br />\n<br />\nWhen we acknowledge their election the<br />\n<br />\nquestion arises as to what consensus of opinion do they follow. Among the list of members<br />\nwe see that there are senior delegates, junior delegates and a freshman delegate but as far as<br />\ncan be seen the only thing necessary for their election is that they belong to their respective<br />\nclasses. Do they then necessarily represent the members of their class. According to the<br />\npresent system of election we do not think so. The delegates are elected by the members of<br />\nthe University in toto and it matters little if the class which the delegate is going to represent<br />\nis for or against the one elected. Consequently the delegates of the various classes do not in<br />\nany way represent the opinions of their classes and are in no way bound to carry out any of<br />\nthe plans which that class may see fit to suggest. To my mind this mode of procedure is not<br />\nexactly just to say the least.<br />\nA better plan might be to have the various classes elect their own delegates separately<br />\nand have it understood that these delegates are to follow the expression of opinion of that<br />\nclass. How far it would be beneficial to carry this out is a question which we will not undertake to state here.<br />\nIt is obviously necessary that something must be done in this direction on account of<br />\nthe hammering that the Athletic Board has been receiving in the last two years. Last year<br />\non account of the track team and this year on account of this baseball question. While we<br />\nknow that there will always be complainers, would it not be better to do something to hush<br />\nthis continual knocking than to let things run on as they are? It would be better in our<br />\nopinion to have these delegates elected at the same time as the other officers of the class.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n4<br />\n<br />\nBALTIMORE, MD., December 13, 1906.<br />\nMR. CARL BERNHARDT,<br />\nEditor-in-Chief of the NEWS-LETTER,<br />\nJohns Hopkins University.<br />\nDEAR SIR :<br />\nNow that the football team has completed its schedule, and the Lacrosse candidates<br />\nought to be beginning to take up their sticks again so as to get into practice for the coming<br />\nseason, we, the undersigned, take this opportunity to come to the front and congratulate the<br />\npersonnel and candidates of the team of 1906 on bringing back the Championship Lacrosse<br />\nBanner to its proper place—in our Trophy Room. Those of us who saw the final contest<br />\nwith Swarthmore were impressed with the good-fellowship and spirit which prevailed in the<br />\nranks of our team; and also by the article of play which was delivered. All we can say is<br />\n\"Good work\" for 1906.<br />\nAt this time we take the liberty to sound a note of warning: \"Do not get chesty;\"<br />\nSwarthmore's team of last Spring will not be able to hold a candle to the same team this next<br />\nSpring. A word to the wise is sufficient.<br />\nHaving indulged in a little preliminary discourse, we will now turn to the real object<br />\nof this letter. The Lacrosse Team of 1902 being satisfied both that its attempt to encourage<br />\nthe beginners met with success last Spring; and that many of the new men, who may have<br />\nfallen by the way-side, were kept at practice, it is again willing to donate twelve silver ioving<br />\ncups to the student body of the Johns Hopkins University. These to be presented to the<br />\nplayers of the team carrying off the palm of victory in two out of a series of three lacrosse<br />\ngames to be played between the Junior and Freshman classes.<br />\nThe condition to govern the contest to be as follows:<br />\nFIRST—The parties to the contest shall be twelve players picked from the Junior Class<br />\non the one side; and twelve players picked from the Freshman and Sub-Freshman classes on<br />\nthe other.<br />\nSECOND—The games may be played on any field the contesting classes may select.<br />\nTHIRD—The games are to be played if possible in March and up to the middle of April<br />\nand on such dates as not to interfere with the practice of the University Lacrosse Team.<br />\nFOURTH—Two out of three games must be played.<br />\nFIFTH—Should any disputes arise between the two classes as to the eligbility o3 any<br />\nstudent, date and place of games, length of halves, officials, etc., it shall devolve upon a<br />\ncommittee consisting of the captain of the 'Varsity Lacrosse Team, the Physical Director of<br />\nthe University and the President of the Board of Governors of the Athletic Association to pass<br />\non such disputes. Whatever decission may be reached by this Committee shall be final.<br />\nSIXTH—If it should so happen that two or more men should be called on to fill the<br />\nin the same or different games throughout the series, it shall devolve on the<br />\nposition,<br />\nsame<br />\nto select the player entitled to receive the prize.<br />\norganization<br />\nclass<br />\nWe suggest that the two classes appoint their respective captains at their earliest opportunity, so that these men may see to it that their candidates report to practice with the<br />\n'Varsity squad and thus raise the standard of the class teams.<br />\nBefore leaving this matter with you we wish to call the attention of the students, who<br />\nare interested in our future lacrosse teams to the fact that the City College Lacrosse Team of<br />\nlast year had a hard struggle to maintain its existence; owing largely to the fact that many of<br />\ntheir men graduated from that institution to swell our number at the Unfversity. Some of the<br />\nundersigned have spent sleepless nights and also class hours in trying to work out plans to<br />\nmake lacrosse a fixture at the City College. Shall we give up this valuable training school for<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n5<br />\n<br />\nour teams of the future? We ask that you do all in your power to foster this year's team at<br />\nthe College; 'we need its members in our business.\"<br />\nTrusting that you will give this matter your attention in the columns of the NEwsLETTER, and hoping to hear from you that the undergraduates are ready to play a series of<br />\ngames under the conditions as suggested above, we remain,<br />\nYours respectfully,<br />\nTHE LACROSSE TEAM OF 1902.<br />\nB. Swayne Putts, Allegheny, Pa.<br />\nJ. Abner Saylor, Jr., Baltimore.<br />\nE. P. Bernheim, Louisville, Ky.<br />\nL. M. Tough, Jr., Fort Wayne, Ind.<br />\nH. P. Straus, Belleville, N. J.<br />\nWm. C. Schmeisser, Baltimore.<br />\n<br />\nB. M. Bernheim, Louisville, Ky.<br />\nW. S. Bird, Chicago, Ill.<br />\nRonald T. Abercrombie, Baltimore.<br />\nF. C. Blanck, Baltimore.<br />\nErnest G. Schmeisser, New York City.<br />\nJ. Straith Briscoe, Baltimore.<br />\n<br />\nHISTORY 7.<br />\nThere was once a course in the University<br />\ncalled History 7, if there had not been this<br />\nstory would not have been written. By some<br />\nchance the instructor of this course was<br />\nnamed Blinkensop, Ph. D. His real name<br />\nwas Holy Blinky. By chance, in the guise of<br />\na hurried and worried advisor, my friend<br />\nWarren Caruthers Carteret took this course.<br />\nPerhaps it was not chance, but assuredly it<br />\nwas not by design that \"Carrie\" Carderet<br />\nflunked the Christmas examination in History<br />\n7. \"Hence,\" as my friend 'Hooley\" puts<br />\nit, \"the trade winds.\"<br />\nNow it is remarkable how many people<br />\nliked \"Carrie Carteret. Dogs, men and girls<br />\nhad him for their friend and he had them. It<br />\nmay be doubted whether even the instructors<br />\ndid not in the bottom of their hearts, really<br />\nrejoice in his atmosphere. Even little crabbed<br />\nGuerber, the instructor in German 2, was<br />\ncheered when \"Carrie\" politely uncovered to<br />\nhim.<br />\nIt was true that Carruthers did flunk, but<br />\nit as he said was probably because Blinkensop<br />\ndid not approve of tweeds and cigarettes.<br />\n\"And now,\" said Carteret, \"I will thank any<br />\none for a simple paper cigarrette whilst I regale myself (and possibly you) with the tale<br />\nof the 'voyage de M. Blinkensop.'\"<br />\n\"It seems,\" continued Carteret, \"that at<br />\none time my friend Blinky, Ph. D.. was<br />\nselected as the historian of an expedition to<br />\n<br />\nthe West Indies. No. I don't know what<br />\nthe expedition was about, nor why the devil<br />\nhe was selected. But I do want you to understand that Edmund Thensaurochryson<br />\nichochrysides Blinkensop is a most religious,<br />\ncareful, conscientious, scrupulous person, and<br />\nthat is exactly why I didn't get through History 7.<br />\n\"Now on this expedition were, I should<br />\nsay, a very jolly set, even if they were doctors<br />\nof philosophy, and on arriving in port at some<br />\nfoolish island, which belongs to the British<br />\nthey paid their respects to the governor, who<br />\nwas lonesome in his solemnity, which consisted of niggers. And after consuming many<br />\ncooling drinks,(They grow mint on those<br />\nislands, don't they? If they don't I wont<br />\npatronize them.) they, as I was about to say,<br />\nbefore I interrupted myself, were invited to a<br />\nlarge luncheon the following day, which I<br />\nthink was perfectly sweet of the governor. I<br />\nwill thank anyone for another cigarette.<br />\n\"Yes, sir! They were all invited to this<br />\nparty, every man on board, including Holy<br />\nBlinky. Well, naturally, they all put on their<br />\nfine apparel and Blinky primped longer than<br />\nthe rest. So the men on deck, all glorious<br />\nwith white flannel and hat bands, waited for<br />\nBlinky. Finally Blinky appeared in a frock<br />\ncoat, red tie, duck trousers, a yachting cap.<br />\nIt was a great thing, he thought, to be entertained by the representive of the British.<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\n\"As for the governor, he was looking for a<br />\ntime. His niggers prepared a feast and had<br />\nfrom the cellar the most cobwebby bottles,<br />\n1798 Maderia, and all the rest of it.<br />\n''So Blinky, with the rest of them, entered<br />\ninto the long squatty house, over which waved<br />\nthe British flag. They were taken into the<br />\ndining hall immediately. It is true Blinky<br />\ndid insist on taking his hat and umbrella into<br />\nthe dining room. All these he craftily put<br />\nunder his chair. Nor would he remove the<br />\ncotton gloves. But these are mere details and<br />\nthey were all very polite, of course.<br />\n\"Well, Blinky had never tasted wine, but<br />\nthe heat of the day had aroused an unquenchable thirst. He drank all manner of cooling<br />\ndrinks, which looked harmless and tasted<br />\nawfully good, and then he got red behind the<br />\ngills.<br />\n\"Now just why the conversation turned on<br />\nRoman Government I can't say, because, as I<br />\nsaid before, they were, with Blinky's exception, awfully nice chaps. (Winslow was there—<br />\n'Pinky' Winslow—and he's a corker. He<br />\nwas my brother's roommate at college, and<br />\nthough he is quite a shark at history, he can<br />\ndrink like a fish and tell stories by the yard,<br />\nand his parlor tricks are killing.) But at any<br />\nrate they talked of Roman judicial proceedure.<br />\nThen Blinky pounded on the table with his<br />\nfist and demanded attention. Just to be polite<br />\nthey gave him room. Now if you can understand what a mixture of Bible and Roman<br />\nHistory and cooling drinks are you will be by<br />\nway of knowing what happened.<br />\n\"The Governor being a polite man only<br />\nsaid, 'Only fawncy! Quite true, but what a<br />\nbally ass, don't you know.'<br />\n\"At any rate, just as they grabbed him by<br />\nthe coat tails, Blinky emitted this: 'The<br />\nwhole of Roman judicial proceedure is summed<br />\nup as the Bible excellently and elegantly puts<br />\nit: 'Thou hast appealed unto Cmsar; unto<br />\nCaesar shalt thou go.' Then they tenderly<br />\nbut firmly withdrew him, not forgetting the<br />\nyachting cap and the green cotton umbrella.<br />\nSo W. Carruthers Carteret took a re-examination after Christmas. He was asked one<br />\nquestion: \"Describe in a few words the proceedure of the Roman courts.\" And after<br />\nten minutes \"Carrie\" handed in the paper<br />\nwith the following answer;<br />\n<br />\n\"The whole of Roman judicial proceedure<br />\nis summed up as the Bible excellently and<br />\nelegantly puts it: 'Thou hast appealed unto<br />\nCxsar; unto Cxsar shalt tou go.'<br />\n\"I am much surprised,\" said Mr. Blinkensop, \"to see the excellent grasp you have of<br />\nthe subject. It is by far the best answer I<br />\nhave ever received from a class.\"<br />\nCarteret needed the 10 he got at Easter<br />\nnext, he went to the town of New York and<br />\nstayed for seme days by way of spending the<br />\ncheck a generous paternal parent gave him<br />\n\"for such an excellent mark in History 7.\"<br />\n<br />\nTHE DOLOROUS HISTORY OF SIR<br />\nLIONET.<br />\nI.<br />\nDay-time, or night? nay, love, I hardly know,<br />\nWith me the clouds have fallen now so low<br />\nI cannot tell if night or day be here;<br />\nAll that I know is that the hours do go.<br />\nThen, must I leave the sun and pass away?<br />\nAh, will you in the earth my body lay?<br />\nAll the fair flowers and forests I must leave,<br />\nAll the bright beauties of the dazziing day?<br />\nOutside, the fields are sunny and the trees<br />\nRustle melodiously amidst the breeze,<br />\nThe air is filled with song of happy birds<br />\nAnd droning hum of honey-bearing bees.<br />\nIV.<br />\nAnd here, within this chamber, at my side<br />\nArt thou, my love, my fair one, 0 my bride!<br />\nYou must I leave, 0 worser fate by far<br />\nAnd my one comfort is \"All men have died.\"<br />\nV. .<br />\nThe darkness closes in, night comes apace,<br />\nNow would I give all hope of Heaven's grace,<br />\nAll future joys and all life divine,<br />\nFor one lost lingering look upon thy face.<br />\nVI•<br />\nThe shadow wraps me round and all is dark;—<br />\nI see, I feel. I hear not.—Nay, but hark!<br />\nMy inner conscience tells me that without<br />\nCarrols with joyous note the morning lark!<br />\nS. C, C.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nCAMILLE.<br />\n\"Que tu es belle, Camille, quand tea yeux s'animent.—<br />\nAlfred de Musset.<br />\n<br />\nI.<br />\nDisdainfully you flash those eyes,<br />\nAs hard as steel,<br />\nYet, even so, the fairer prize<br />\nyou are, Camille!<br />\nYou, with a cold, an icy glance,<br />\nMy blood congeal<br />\nThen. witly they fiery, love-like dance,<br />\nPierce me, Camille.<br />\n. Upon my weary heart, in scorn<br />\nYou press your heal,<br />\nSuch heartlessness makes me forlorn<br />\nAnd sad; Camille.<br />\nIV.<br />\nTo you, 0 fair, most scornful fair,<br />\nTo you, I kneel.—<br />\nForget that proud, disdainful air;<br />\nLove me, Camille!<br />\nS. C. C.<br />\n<br />\nSEPARATION.<br />\nI.<br />\nWe watched the clouds together—you and I—<br />\nFloat over land, and over summer sea;<br />\nLong years have past, but there comes back<br />\nto me<br />\nThoughts of those summers now so far<br />\npassed by.<br />\nAs clouds, those happy thoughts of happy<br />\ndays<br />\nFloat towards me through life's russet sunset glow;<br />\nI dream of days together—long ago—<br />\nE'er we approached the parting of the ways.<br />\nThe stream was dark—the river wide and deep;<br />\nWe separated—one on either shore,<br />\nAll, then we parted, to approach no more.<br />\nNow I, beside Death's ocean watching, weep;<br />\nand thou—thou art asleep!<br />\nS. C. C.<br />\n<br />\nBASEBALL.<br />\nDecember 8, 1906.<br />\nTo the Editor of the News-Letter:<br />\nDEAR SIR.—I was delighted to read, in<br />\nyour last issue, an article advocating the recognition of the baseball team for this year. This,<br />\ncoming from a member of last year's team,<br />\nshows that the spiritfor baseball has not entirely succumbed, while at the same time it<br />\nproves that those who took part in the game<br />\nand know most about the matter are eager for<br />\nthe maintenance of the team, and fully aware<br />\nof the fact that it is not only possible to have<br />\none, but that it is the best thing and the only<br />\nthing to do.<br />\nThere are two reasons given for not recognizing the team—namely, lack of interest and<br />\nlack of funds.<br />\nFor anyone to say that there is a lack of interest is as absurd as it would be immaterial<br />\nif it were a fact. If there's no interest—make<br />\nit. Anyone who was present at the Lehigh<br />\ngame last year would have been a poor interpreter of human actions if he should not have<br />\nseen that the fellows were with the team, and<br />\ncrazy for victory and delighted when it came.<br />\nTo tell the truth, I believe there was more interest shown at that game than at any Lacrosse game last year, with the possible exception of;the Swarthmore game, for which I cannot speak as I was not fortunate enough to be<br />\npresent, being at the time at Charlottesville<br />\nwhere we enjoyed another glorious victory.<br />\nBut whatever might have been the real feeling in the matter, the fact remains that there<br />\nwere as many fellows present at the baseball<br />\ngames, and as much rooting, if not more,<br />\nthan at the Lacrosse games.<br />\nSomeone might say: \"Oh, yes, when we<br />\nhave a team, the fellows come out to see the<br />\ngames, but they are not interested enough to<br />\ntry for the team, etc., etc.\" All of which is<br />\nagain absurd, and contrary to fact. We had<br />\nsomething like fifteen or twenty candidates<br />\nlast year. Some of these, it is true, were not<br />\nup to the standard, but the fact remains that<br />\nthey had the spirit to come out. What's more,<br />\nat least half the fellows are back again, and<br />\nthere are other good men who said they would<br />\ncome out this year. All that is needed now,<br />\nis a manager to arrange a schedule and to<br />\ndrum up players, but he's needed immediately.<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nThe objection that there are not enough<br />\nfunds to run a baseball team together with the<br />\nother teams, of course is a different matter,<br />\nand can best be decided by the Athletic Board—<br />\nfor they know what money they have and for<br />\nwhat it is to be spent.<br />\nStill, I think if they make a careful study<br />\nof the thing they will come to the conclusion<br />\nthat a baseball team can easily be recognized<br />\nand backed financially. To back up this<br />\nstatement we have only to look at last years<br />\nrecord of expenses, etc.<br />\nThe appropriation for baseball last year was<br />\n$225. Their actual expenses—over gate receipts, etc.—was about $157. This means<br />\nthat the team spent only $157 of the appropriation, i. e. $70 less than was authorized.<br />\nIf this could be done last year, it can be<br />\ndone this year. In fact, I think the team will<br />\nhave fewer expenses this year than last. Last<br />\nyear we had to buy suits which cost about $42;<br />\nwe had to buy a mitt which cost $5. This is<br />\n$47 which will not have to be spent this year.<br />\nBut this is not all—for last year we played St.<br />\nJohn's in Baltimore—or rather scheduled the<br />\ngame there. This year we would have to<br />\nplay at Annapolis, and would receive $30<br />\nguarantee which would more than pay expenses. We could get $40 from Navy, which<br />\nmuch more than pays expenses. West Point<br />\ngave us $125 last year, which paid expenses<br />\nall but about $10. They were very much<br />\npleased with the game, and asked us to be<br />\nsure to come again. I'm certain they would<br />\ngive a guarantee to cover expenses this year.<br />\nUniversity of Virginia gave a guarantee which<br />\npaid expenses all but 8 cents.<br />\nCertainly, from these few facts it is plain<br />\nthat the financial difficulty is more of a myth<br />\nthan a reality. Nor does the fact that the<br />\nthree games played at home failed to pay expenses, alter the matter. It must be remembered that these games were played—two of<br />\nthem on Friday, and the other on Saturday<br />\nmorning. The only other game we had<br />\nscheduled at home was the St. John's game<br />\nwhich more than paid expenses by over $80,<br />\nand which would have paid still more had not<br />\nthe storm come up, and kept the people away.<br />\nI don't want to be \"butting in\" on anything that is none of my business, but as I am<br />\nvery much interested in the team, and as I<br />\n<br />\nknow the facts of the case, I thought it would<br />\nbe worth while acquainting the fellows with<br />\nthe same. While I think the Athletic Board<br />\nhas done what it deems best, I think also that<br />\nthey acted too hastily in abandoning the team,<br />\nand most inexcusably slow in electing another<br />\nmanager. They evidently have an erroneous<br />\nidea of the amount of interest in the game at<br />\nJ. H. U., and they over-estimate the expense<br />\nof running the team.<br />\nWhat would be the result if someone should<br />\nsuggest that we drop Lacrosse? There's not<br />\none of us who would not fight to the last ditch<br />\nto maintain the game. Its our game. In<br />\nLacrosse we're \"it.\" Just so will we fight<br />\nfor baseball. It's the game of America—the<br />\ngame of all colleges. And, while we have<br />\nobtained more glory in Lacrosse, we feel that<br />\nthe baseball team has done, taking everything<br />\ninto consideration, as much.<br />\nLet us not then stand back and say there<br />\nare.too many difficulties to be overcome, but<br />\nlet us get together, have a team, and make it<br />\nsuccessful. The greatest pleasure and glory<br />\nis in doing the hard things. The weakest and<br />\nmeanest thing a man can do, is to give up<br />\nbeforehand because he thinks he's going to be<br />\nlicked.<br />\nThen here's to the success of baseball at<br />\nHopkins, the game which most men, who<br />\nhave played all the games and know them,<br />\nrecognize as, not only one of the most open<br />\nand beautiful games to watch, but, with the<br />\npossible exception of tennis, as the cleanest<br />\nand most sportsmanlike game we have.<br />\n<br />\nTHOS. G. CAMPBELL, '05.<br />\nA STATEMENT.<br />\nGENERAL ATHLETIC ASSOCIATION<br />\nJOHNS HOPKINS UNIVERSITY<br />\nBaltimore, Md.<br />\nTo the Editor of the News-Letter:<br />\nDEAR SIR —There has been a great deal of<br />\ndiscussion about the action of the Athletic<br />\nBoard in regard to the baseball and football<br />\nteams and it was deemed advisable than an<br />\nexplanation should be made.<br />\nBaseball was not recognized for two reasons.<br />\n1st—There was no money to support the<br />\nteam.<br />\n2nd—There was not sufficient interest mani-<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nfested among the undergraduate students.<br />\nIn explantion of the first reason let me give<br />\na few figures.<br />\nThere is placed in the hands of the Athletic<br />\nBoard each year by the University about $800.<br />\nThis is usually divided among the four<br />\nteams of football, track, lacrosse and baseball<br />\nby appropriations of $200 to each team.<br />\nLast year however, the football team had a<br />\ndeficit of $79 extra of their appropriation but<br />\nthis was covered by the fact that the track<br />\nteam turned back $76 to the treasury since<br />\nthey made $242 at the meet held in the<br />\nArmory and the lacrosse team turned back<br />\n$79 owing to the gain of $321 from the<br />\nSwarthmore game.<br />\nThe. baseball team, thanks to the excellent<br />\nmanagement of Mr. Cambell turned back<br />\n$59. So all was well.<br />\nThis year the football was given their usual<br />\nappropriation of $200 and besides that they<br />\nhave a deficit of nearly $400. The lacrosse<br />\nteam will in all probability not have as successful a season as last year since the Swarthmore game will be played out of town and the<br />\n$321 made at that game will not be forthcoming this year. This means that most likely<br />\nthe lacrosse team will need more money than<br />\ntheir $200 appropriation.<br />\nThe track team so far, has been unable to<br />\nsecure the Armory for a meet and that means<br />\nthat $242 made last year at the Armory games<br />\nwill be cut off from the track team this year.<br />\nIf the Armory is secured one-half the gain<br />\ngoes to the Homewood. This team will most<br />\nassuredly need more than $200.<br />\nNow if the football team had just used their<br />\n$200 there might have been a possibility of<br />\nhaving enough for the other three teams, but<br />\nthe football team used $600 of the $800 in the<br />\ntreasury and with the fact that lacrosse and<br />\ntrack will probably need more, it simply<br />\nmeant that one team had to be dropped.<br />\nWhich one should it be? The Board looked<br />\nat it in this light. There was less interest in<br />\nbaseball than in any of the other sports and<br />\nbaseball was dropped.<br />\nFrom the Senior class, Mr. Iglehart was the<br />\nonly man who has been out for the team in<br />\npast years and he would be debarred this year.<br />\nFrom the Junior class, Mr. Hardcastle was<br />\nthe only man out last year. From the Fresh-<br />\n<br />\n9<br />\n<br />\nmen let us say, four would come out for the<br />\nteam.<br />\nWould it be right to drop track or lacrosse<br />\nfor baseball when only five undergrads. were<br />\neven out for the team and there are twice that<br />\nmany out for lacrosse and track? It would<br />\nmean that most of the men on the baseball<br />\nteam would be meds. or grads.<br />\nThe money paid into the treasury is paid by<br />\nthe undergrads. and surely it should be used<br />\nfor their teams as far as possible.<br />\nIn regard to the football team the only<br />\nmotion passed was that next year the captain<br />\nbe an undergraduate. There was no motion<br />\nmade or passed to debar meds., grads. or any<br />\nother department of the University.<br />\nThe sentiment of the Board was that the<br />\ncaptain be undergrad. a good coach secured,<br />\nand everybody who wants to come out for the<br />\nteam can do so. But the men who practice<br />\nfaithfully and regularly would not be replaced<br />\non the day before the game by some man who<br />\ncomes out with a reputation but who has not<br />\ntrained and who, previous to this, had not<br />\nbeen out for the team. The Board wants to<br />\nsee every man given a fair show and in the<br />\npast the undergrad. were certainly not given<br />\nthis in football.<br />\nNow, if you will pardon it, a few personal<br />\nreasons why we should have an undergraduate<br />\nfootball team.<br />\n1st—It would save a bill of $190 to $200 a<br />\nyear for meals.<br />\n2nd—The men could get out on the field<br />\nat least once a week, which is an essential.<br />\n3rd—The men would train which has not<br />\nbeen done by the team in the past two years.<br />\n4th—The players would be Hopkins men<br />\nwho would fight for all they were worth to<br />\nwin and not men playing merely for the love<br />\nof the game.<br />\n5th—The team would be better supported<br />\nby the student body and its friends, and the<br />\nalumni.<br />\n6th—Under new rules the game does not<br />\nneed so much weight as it needs speed and<br />\nhead-work, and by having practice on the<br />\nfield once a week a better team could be<br />\ndeveloped than by relying on the medical men<br />\nto work in the cage two or three nights a<br />\nweek.<br />\nTo summarize the team would be a better<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nteam, would be supported by the student<br />\nbody, and would be more successful financially.<br />\nIt is not right that the other teams should<br />\nsuffer on account of football and at least $190<br />\nof the $400 deficit this year was due to meals<br />\nwhich amount would be saved by an undergrad. team.<br />\nYours very truly,<br />\nJOHN MALLORY HOLMES.<br />\nCorresponding Secretary.<br />\n<br />\nJUNIOR VS. FRESHMAN.<br />\nAnother class football game has come and<br />\ngone and, as is usually the case, the Juniors<br />\ngained the victory. The victory was a hard<br />\nearned one, and both teams deserve great<br />\ncredit for their sterling exhibition of hard,<br />\nclean football. The victory was won by the<br />\nnarrow margin of five points, scored in the<br />\nlatter part of the first half. After a series of<br />\neven plays, the ball was in the possession of<br />\nthe Freshmen on their own 15-yard line; an<br />\nattempt to punt was blocked by Tilghman of<br />\nthe Juniors, and Street '08 fell on the ball on<br />\nthe Freshmen's 4-yard line. From there, in<br />\nthree line plunges, the Juniors pushed Bridgman over the line for a touch down. The attempt at goal failed and the half ended soon<br />\nafter. In the second half the playing was<br />\nslightly in favor of the Juniors, but the advantage was very slight. In this half '09<br />\nworked the prettiest forward pass that has<br />\nbeen seen around Baltimore this year; Bevan<br />\ntheir end receiving the ball nicely and gaining<br />\nabout 25 yards on the play.<br />\nOne of the surprises of the game was the<br />\nremarkable strength shown by the '08 line.<br />\nThe Freshmen were supposed to have a slight<br />\nadvantage there, but the Junior line played so<br />\nwell, that they easily offset the advantage the<br />\nFreshmen had in Michael, by successfully<br />\nbreaking three and blocking his punts. For<br />\nthe juniors Abel at right half played the best<br />\ngame, closely followed by Chesney and Bridgman. Chesney had the call over Bird '09 in<br />\nbacking up the line, and was in the main part<br />\nresponsible for the failure of the Freshmen's<br />\nattempted end runs.<br />\nToby Tilghman played well at left tackle,<br />\nand it was through him that the Juniors were<br />\n<br />\nable to score. For the Freshmen Gutman<br />\nplayed the best game.<br />\nFollowing the football game came the cane<br />\nrush and, contrary to general expectations,<br />\nthis was won by the Freshmen by 11 hands to<br />\n10. This was due partly to the fact that Bird,<br />\npresident of '09, succeeded in pulling the '08<br />\npresident, Wegefarth, over his head as the<br />\nwhistle blew, and partly to the fact that the<br />\nFreshmen were more successful in getting<br />\nhands on the cane after the time was up.<br />\nWith all the regard due to those in charge<br />\nof affairs, we must say that there should be<br />\nsome change made in the future, in the manner of running the cane rush, for there was<br />\nsuch confusion and debate in the counting<br />\nthat it was hard to tell who had a hand on the<br />\ncane and who had not. Moreover, the present<br />\ngeneration must be possessed of remarkable<br />\nsmall hands to get 21 good grips an a cane<br />\nscarcely longer than 3 feet 6 inches. The<br />\nFreshmen won the contest squarely nevertheless, and it will pass on to history as a victory<br />\nfor '09 by the score of 11 to 10.<br />\nAnother important event which was noticed<br />\nat the game, was the blossoming out of the<br />\n1908 class flag. This particular banner is a<br />\nwonderful creation of red, white, and what<br />\nnot, and with the respect due it we are somewhat possessed of the idea that its designer<br />\nmust have been under the influence of a welsh<br />\nrabbit when he produced a design of such<br />\nnightmare qualities.<br />\n<br />\nLACROSSE.<br />\nThe first call has been issued, the necessary notices have been posted, and Wednesday,<br />\nDecember 26th will see an enthusiastic bunch<br />\nof candidates out in the cage. According to<br />\npast custom, there will be a meeting in the<br />\ntrophy room at 3 p. in., at which the candidates will be instructed in the Hopkins system<br />\nof play by the graduate coaches. This marks<br />\nthe formal opening of the Lacrosse season.<br />\nAll along during the Fall, many of the men<br />\nhave been handling the ball in the cage,<br />\nbreaking in new sticks, and getting in track<br />\nwork.<br />\nAs in previous years, the hardest practices<br />\nof the year will be held on Wednesdays and<br />\nSaturdays. The Monday and Friday practice<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n11<br />\n<br />\nwill be confined to instruction in the rudi- monument and tomb to the man who, nearly<br />\nments of the game, such as stick-work, body- a hundred years ago, navigated the Hudson<br />\nchecking and picking up the ball. Track with the Steamship \"Clermont.\" A number<br />\nwork will also be conducted. With this defi- have been awakened out of the apparent state<br />\nnite plan in view, we may expect a thorough of neglect by the foreign homage paid Fulton,<br />\ndrilling of the men in the fundamentals of and by the intention of the French to hold<br />\nlacrosse.<br />\nnext year at Bordeau an exposition in honor<br />\nA survey of the squad reveals much good of the inventor of the steamboat.<br />\nmaterial. The old men have been mentioned<br />\nDr. Nicholas Murray Butler. President of<br />\nbefore, so they should uot feel hurt if they do Columbia University, appointed to get the<br />\nnot see their names in print. Moreover, if colleges and schools interested, asks for the<br />\nthey are spoken of too often, they might get subscription of $1 from students. Colleges<br />\nswelled heads. After a year's absence from which contribute will have their names pnt on<br />\nthe game, Morse is again out, and should be the bronze which will line the interior of the<br />\nof help; to the svuad, with his experience and monument.<br />\nweight. Among those who played on the<br />\nsecond team last year, are Mathias, Abel,<br />\nWegefarth, Streett, Price, Wylie, Hecht,<br />\nSTUDENT CONTRIBUTION FUND.<br />\nReinhart, Williams, Tillghman, Armstrong—<br />\n(Contributions should be sent to Mr. Herall Juniors. But few Seniors other than the<br />\nmann<br />\nJ. Hughes, Business Manager, Johns<br />\n'Varsity men, including MacSherry, have<br />\nHopkins NEWS-IA=1m, Box 224, John Hopbeen out.<br />\nkins<br />\nUniversity.)<br />\nFrom the incoming class there are several<br />\nNEWS-LI=ER<br />\n$5.00<br />\nwho now have sticks. They are Maddren,<br />\nArthur R. Padgett, '07<br />\n5.00<br />\nChandlee, Michael, Gutman, Stewart, JohnS. M. R., '07<br />\n5.00<br />\nson, Russell, Smith, Vogeler and some others.<br />\nMore are needed from this class, however, and<br />\n$15.00<br />\nthey should begin at once. Remember the<br />\ndate, Wednesday, December 26th, in the<br />\ntrophy room, and let everyone come out.<br />\nMake the season start with a rush, and make<br />\nthis rush continue until another banner is<br />\nlanded.<br />\n<br />\nGIFFARD DE J. MESNY<br />\nROBERT FULTON MONUMENT.<br />\nDr. Remsen received several weeks past, a<br />\nletter from the Secretary of the Robert Pulton<br />\nMonument Association, in which are set forth<br />\nthe object of the new movement and a nutuber of interesting facts connected with it.<br />\nWith Mr. Cornelius Vanderbilt as President,<br />\nthe Association proposes to raise $600,000 to<br />\nerect at some spot on Manhattan Island a<br />\n<br />\nARTIST PHOTOGRAPHER<br />\n<br />\n226 N. Charles Street<br />\n<br />\nBaltimore<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n12<br />\n<br />\nR. Q. TAYLOR & CO.<br />\nHats, Umbrellas, Canes, Hand Satchels<br />\nMark Cross Co.'s London Gloves<br />\n11<br />\n<br />\nNORTH<br />\n<br />\nConklin's<br />\nSelf- DAm<br />\nFilling A %All<br />\n<br />\nCHARLES STREET<br />\n<br />\nFor busy people.<br />\nNo bother.<br />\nFills itself.<br />\nCleans itself.<br />\nNo dropper.<br />\nNothing to take apart.<br />\nNothing to spill.<br />\nA dip in ink, a touch<br />\nof thumb to nickel<br />\ncrescent and the<br />\npen is full, ready<br />\nto write.<br />\n<br />\nDo You Enjoy GOOD Cigarettes?<br />\n<br />\nE<br />\n<br />\nWe put Monogram or Name on Cigarettes<br />\nT ,, 07.01 ”I ,<br />\n,<br />\n‘<br />\n,<br />\n01.$...<br />\nt4,WAN.,,,• II , T • 11 ,1.t 1 II<br />\n.-,14,<br />\n<br />\nAll ObWhillhatairleal<br />\n<br />\n0<br />\nougAlitraer,ffiura ma'am&la,ta.<br />\n<br />\nitivi,thiglia<br />\n<br />\nJ. MANKOWITZ, 1101 E. Baltimore Street<br />\nG. FRANK WARD<br />\n<br />\nCHAS. T. RYAN<br />\n<br />\nRYAN & WARD<br />\nDesigners and Makers of<br />\n<br />\nMen's Clothes<br />\n16 NORTH LIBERTY STREET<br />\n<br />\n,<br />\n1 ::1110b<br />\n:<br />\n411/11 A<br />\n<br />\nAll the best dealers everywhere—<br />\nStationers, Druggists, Jewelers—<br />\nhandle the Conklin Pen or can supply you if you insist upon having it.<br />\nCosts no more than other fountain<br />\npens of hest grade. 100 styles and<br />\nsizes to select from shown in our<br />\ncatalog, furnished free upon request. Any make or style of fowltam pen repaired promptly.<br />\nTHE CONKLIN PEN CO..<br />\n514•616-61N Jefferson Av... Toledo,Olito.<br />\n11litit Pen<br />\nBole 111Prs Conklin Wolf-1,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nUnder Brewers' Exchange<br />\n<br />\nBaltimore Steam Packet Company<br />\n(OLD<br />\n<br />\n13A1r<br />\n<br />\nLINE)<br />\n<br />\nFOR<br />\n<br />\nOld Point Comfort, \"Fortress Monroe,\"<br />\nNorfolk and Portsmouth<br />\nCONNECTIONS FOR ALL POINTS SOUTH<br />\n<br />\nTicKET<br />\n<br />\nOFFICES<br />\n<br />\n107 East Baltimore Street<br />\nBaltimore and Calvert Street<br />\n(Continental Trust Bldg.)<br />\n<br />\n109 North Charles Street<br />\n506 Light Street<br />\n<br />\nSteamers Virginia, \"New\" Alabama and Georgia leave Light Street Piers, foot of Barre, daily except<br />\nSunday, 6.30 p. m. These steamers pass in full view \"Jamestown Exposition Grounds.\"<br />\n<br />\nJ. R. SHERWOOD,<br />\nVice-President and General Manager<br />\n<br />\nE. BROWN,<br />\nGeneral Passenger Agent<br />\n<br />\n\fSecond-Hand School and College Text Books<br />\nBOUGHT and SOLD AT<br />\n<br />\nSETH'S BOOK STORE<br />\n<br />\nLEFRANC & AULT<br />\nL. & A. Gloves at $1.00 and $1.50<br />\nare Guaranteed.<br />\n<br />\n805 N, Howard Street<br />\n3rd door above Madison<br />\n<br />\n/r)EN-r,s tivrA'r IONIPCIRY<br />\n<br />\nOur Own Make of Shirts at $1.00<br />\nand $1.50<br />\nCollars in Quarter Sizes<br />\n<br />\nNrtistic Shop<br />\n<br />\nBuy Early at re<br />\nof LYCETT STATIONERS<br />\n<br />\n421 NORTH HOWARD STREET<br />\nNear Franklin Street<br />\n<br />\n317 N. CHARLES STREET<br />\nOur display of Brass Articles, Fine Leather Requisites, Art Curios<br />\nand China is unsurpassed and combine elegance with Moderate<br />\nprices.<br />\n<br />\nCollege and Class Stationery. Menu, Banquet and Dance Cards<br />\n<br />\nC. & P. Phone, Mt. Vernon 3557<br />\n<br />\nStationer and Engraver<br />\n229 NORTH CHARLES STREET<br />\n<br />\nWM. A. CASLER CO.<br />\nMEN'S FURNISHINGS<br />\n<br />\nMAKERS OF SHIRTS<br />\n<br />\nNUNN & COMPANY<br />\nBOOKSELLERS and STATIONERS<br />\nCarry a complete line of School Books and College<br />\nText Books,Miscellaneous, Books, Fine Stationery,<br />\nand Students' Supplies of Every Description, together with a large assortment of<br />\n<br />\nWATERMAN'S IDEAL FOUNTAIN PENS<br />\n<br />\nExclusive Designs in English and French Cloths<br />\nUnder Club Hotel<br />\n<br />\n224 E. BALTIMORE STREET<br />\n<br />\nENGRAVING<br />\n<br />\nPRINTING<br />\n<br />\n,TA.M 14:S Ii. L/C/NV:NIS<br />\n<br />\n227 North Howard<br />\nBINDING<br />\n<br />\nStreet<br />\nSTATIONERY<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES<br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBALTIMORE TO BREMEN DIRECT<br />\n<br />\nFor Particulars apply to A. SCHUMACHER Sr CO., General Agents, 7 South Gay Street<br />\n<br />\nILGENFRITZ STUDIO<br />\nSuccessor to Comm INS<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington Street<br />\nSpecial Discount to Students<br />\n<br />\n.<br />\n<br />\nMICROSCOPIC SUPPLIES<br />\nDISSECTING CASES<br />\n<br />\nTHE CHARLES WILLMS SURG. INST. CO.<br />\n300 NORTH HOWARD STREET<br />\n<br />\nBALTIMORE<br />\n<br />\na'IN-<br />\n<br />\nManufacturer of<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nBOOKS! SECOND-HAND!<br />\nSchool, Medical and Miscellaneous, Bought, Sold and Exchanged<br />\n<br />\nGreek Letter Fraternity Jewelery<br />\n213 NORTH LIBERTY STREET<br />\nPlease call and examine our line before purchasing<br />\n<br />\nN. HESS' SONS<br />\nShoes for All Occasians<br />\n<br />\nPIPPEN'S BOOK STORE<br />\n605 NORTH EUTAW ST.,<br />\n<br />\nNear the University<br />\n<br />\nBALTMORB'S LAROESI OLD BOOK S'i ORE<br />\n<br />\nChocolates<br />\n<br />\nBonbons<br />\n<br />\n$3.50 to $8.00<br />\n<br />\n8 Baltimore Street, East of Charles<br />\n<br />\n18 and 20 E. Baltimore St., Baltimore, Md.<br />\n<br />\nFOSNOT, WILLIAMS & CO.<br />\nPRINTERS<br />\n<br />\nWM. J. MILLER, JEWELER<br />\n28 E. Baltimore Street<br />\nCOLLEGE JEWELRY<br />\n<br />\nMICROSCOPES<br />\nRUBBER GLOVES<br />\n<br />\n5 1 4- 1 6 WEST FRANKLIN STREET<br />\n<br />\nAND CLASS PINS<br />\n<br />\nIopkins Seal in Buttons, Brooches and Fobs<br />\n<br />\nThe Nows-Letter, a product of our plant<br />\n.111=01111.<br />\n<br />\nHENDERSON'S UNIVBEOROSKITSYTORE<br />\nMADISON AND HOWARD STS.<br />\n<br />\nTEWART&<br />\n<br />\nS<br />\n<br />\nWOWARD.N.LEXINGTONSub.<br />\n<br />\nWE SHOW A COMPLETE LINE OF<br />\n<br />\nText Books, Note Books, Students' Supplies<br />\n<br />\nMEN'S STYLISH CLOTHES AND FURNISHINGS<br />\n<br />\n\fLEMMERT•<br />\nTailor<br />\n<br />\n•<br />\n•<br />\n<br />\n•<br />\n<br />\n•••<br />\n11<br />\n<br />\nDo you want to be well dressed? Try<br />\nLEMMERT on his College Clothes.<br />\nNot high in price, but way up in<br />\n.ot<br />\nJI<br />\nstyle.<br />\n<br />\n•<br />\n<br />\nAND NOT BE FOWNES<br />\nBUT THEY CAN'T BE<br />\n<br />\nFOWNES<br />\n<br />\n10 E. FAYETTE STREET<br />\n<br />\nI<br />\n.<br />\n<br />\nGLOVES MAY BE RIGHT<br />\n<br />\nAND NOT BE RIGHT<br />\n<br />\n.11.•<br />\n<br />\n+++-I<br />\n<br />\n+-I<br />\n<br />\n++ I<br />\n<br />\nWE MAKETO ORDER IN<br />\nTHE CITY . .<br />\nTHE BEST<br />\n<br />\n$150 SHIRT<br />\n<br />\nMcPHERSON'S<br />\n11<br />\n<br />\nEAST BALTIMORE STREET<br />\nSISCCI 13I1CIS.<br />\n<br />\nBANNERS<br />\nJe<br />\nFLAGS<br />\n13 WEST LEXINGTON STREET,<br />\n<br />\nJit<br />\n•<br />\n<br />\nBADGES<br />\nBALTIMORE, MD.<br />\n<br />\nF. C. FOSSETT & SON<br />\n(I)en'o Ifurnisbinga<br />\n311 EAST BALTIMORE ST.<br />\nBaltimore, Md.<br />\n<br />\nTHE YOUNG MEN'S STORE<br />\n<br />\nSTRAUS BROS.<br />\nTAILORS<br />\nFURNISHERS<br />\n<br />\n2<br />\n<br />\nHATTERS<br />\nCLOTHIERS<br />\n<br />\nW. Baltimore St.<br />\n<br />\n20<br />\n<br />\nARE YOU WATCHING<br />\nTHIS SPACE?<br />\n<br />\nAdjoining New B. & 0. Building<br />\n<br />\nVISITORS ARE ALWAYS WELCOME<br />\n<br />\nrtisers<br />\n<br />\n\f", "format": "basic_html", "processed": "Yo-<br /><br />\nHoo@larm<br /><br />\np<br /><br />\nguircHymI DE Nis<br />\nTHE401INSIIOFKINSINFIRMITY<br />\nBALTIMORE<br />\nU6 I S MOD I'ail NO<br /><br />\nThe Johns Hopkins University.<br />\nBALTIMORE, MD.<br />\nThirty-First Year.<br /><br />\nThe Johns Hopkins Press.<br />\nI.<br /><br />\nBeginning October 2, 1906.<br /><br />\nII.<br /><br />\nIRA REMSEN, President.<br />\nDean of the College Faculty.<br />\nDean of the Medical Faculty.<br /><br />\nEDWARD H. GRIPFIN,<br />\nNITILL1Alt H. HowELL,<br /><br />\nINSTRUCTION.<br /><br />\nIII.<br /><br />\nIV.<br /><br />\nFor Graduatp Students:<br />\nIn Philosophy and the Arts. (Courses for<br />\n(a)<br />\ncandidates for the degree of Ph. D.)<br />\n(b)<br />\nIn Medicine. (Courses for candidates for the<br />\ndegree of M. I).; courses for physicians.)<br /><br />\nV.<br />\nVI.<br /><br />\nFor Undergraduates:<br />\nAs candidates for the degree of B. A.<br />\n(c)<br />\nAs special students.<br />\n(d)<br /><br />\nVII.<br /><br />\nLibraries.<br />\n130,000 volumes.<br />\n157,xo volumes.<br />\n240,000 volumes.<br /><br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\nLaboratories.<br /><br />\nDirectors.<br /><br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nExperimental Psychology.<br /><br />\nIra Remsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark,<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam II. Howell<br />\nWilliam II. Welch,<br />\nJohn J. Abel.<br />\nJohn f: Abel.<br />\nGeorge M. Stratton.<br /><br />\nSeminaries.<br /><br />\nDirectors.<br /><br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance,<br />\nEnglish.<br />\nHistory.<br />\nPolitical Economy.<br />\nPolitical Science.<br />\nPhilosophy.<br />\nMathematics.<br />\nPhysics.<br /><br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. H. Hollander.<br />\nW. W. tkilloughby.<br />\nJ. Mark Baldwin.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nUndergraduate Courses (leading to B. A.)<br />\nOROUPS:<br />\ni.<br />\n2.<br /><br />\n3.<br />\n4.<br />\n5.<br /><br />\nAncient Languages.<br />\nModern Languages.<br />\nHistory and Political Economy.<br />\nMathematics and Physics.<br />\nChemistry, Biology and Geology.<br />\nSerial Publications.<br /><br />\nAmerican Journal of Mathematics (vol. XXVIII).<br />\nAmerican Chemical Journal (vol. XXXVI).<br />\nAmericril Journal of Philology (vol. XXVII).<br />\nStudies in Historical and Political Science (vol. XXIV).<br />\nModern Language Notes (vol. XXI).<br />\nMemoirs from the Biological Laboratory (vol. VI).<br />\nContributions to Assyriology (vol. VI).<br />\nTerrestrial Magnetism (vol. XI).<br />\nUniversity Circular (vol. XXV).<br /><br />\nProgrammes of the courses offered to graduate students<br />\nin Philosophy and the Arts and in the department of Medicine, and also of the undergraduate or collegiate courses,<br />\nwill be sent on application to the Registrar.<br /><br />\nVIII.<br /><br />\nIX.<br />\nX.<br /><br />\nXl.<br /><br />\nXII.<br /><br />\nXIII.<br /><br />\nXIV.<br /><br />\nXV.<br /><br />\nXVI.<br /><br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor. .Quarterly. 4t0. Volume<br />\nXXVIII in progress. $5 per volume. (Foreign<br />\npostage 5o cents).<br />\nAmerican Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume<br />\nXXXVI in progress. $s per volume. (Foreign<br />\n. postage so cents).<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. 'Quarterly. 8vo.<br />\nVolume XXVII in progress. $3 per volume.<br />\n(Foreign postage so cents).<br />\nStudies in Historical and Political Science.<br />\nJ. M. VINCENT, J. H. HOLLANDER and W. W.<br />\nWILLOUGHBY, Editors. Monthly. 8vo. Series<br />\nXXIV in progress. $3 per volume. (Foreign<br />\npostage so cents).<br />\nJohns Hopkins University Circular.<br />\n8vo. Volume XXV in progress. $1 per year.<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4to.<br />\nVolume XVI! in progress. $2 per year. (Foreign<br />\npostage so cents).<br />\nJohns Hopkins Hospital Reports. 4t0. volume<br />\nx III in progress. $5 per volume. (Foreign postage 50 cents).<br />\nContributions to Assyriology and Semitic Philology (Beitrage zur Assyriologie, etc.) PAUL<br />\nHAUP I` and P RI EDRICH DELITZSCH, Editors. Volume VI. in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume VI in progress.<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXXI in progress. Vs° per volume. (Foreign<br />\npostage 25 cents).<br />\nAmerican journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 8vo. $5<br />\nper vollIMC.<br />\nTerrestrial Magnetism and Atmospheric Electricity. L. A. BAUER, Editor. Quarterly. 8vo.<br />\nVolitine XI in progress. $2.5o per volume.<br />\n( Foreign postage 25 cents).<br />\nReprint of Economic Tracts.<br />\nj. II. HOLLANDER, Editor. First Series, $1.5o.<br />\nSecond Series in progress. $1.<br />\nAnnual Report.<br />\nPresented by the President to the Board of Trustees,<br />\nreviewing the operations of the University during<br />\nthe past academic year.<br />\nAnnual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published<br />\nat the close of the academic year.<br />\nReports of the Maryland Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br /><br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland. $7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old Testament. Edited by Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum. to<br />\nplates. $20.<br />\nSelections from the Early Scottish Poets, By William<br />\nHand Browne. 240 pages. $1.25.<br />\nStudies in Honor of Professor Gildersleeve. 527 pages,<br />\noctavo, $6.<br />\nThe Taill . of Rauf Coilyear. Edited by William Hand<br />\nBrowne. T64 pages. $1.<br />\nPoems de Vernan Goticalez. Edited by C. Carroll Marden.<br />\n282 pages. $2.50.<br />\nBaltimore Lectures on Molecular Dynamics and the Wave<br />\nTheory of Light. By Lord Kelvin. 716 pages. $4.50.<br />\nThe Oyster. By W. K. Brooks. 226 pages. $1.<br />\nEcclesiastes: A New Metrical Translation. By Paul Haupt.<br />\nso pages. so cents.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances<br />\nmay be sent to the Johns Hopkins Press Baltimore, Md.<br /><br />\nrg1r irfirst<br /><br />\nTilthitmas.<br /><br />\nTHE INN.<br />\nHE INN is full this eve<br />\nNay! I care not where you go.<br />\nHaste you! Beggar take your<br />\nleave!<br />\nNo room in the Inn. I told you so.<br />\n(Faith! Like's not she will but thieve.)<br />\nGo to the stable till the morning glow.<br />\nTHE KING'S STAR.<br />\nI see a King's Star the East Heaven ride,<br />\nWith blazing gleam and awful light,<br />\nPast all the Houses of Despair and Pride.<br />\nAnd with no show of earthly might<br />\nI see three King's at eventide<br />\nFollow the King's Aar through the night.<br />\nTHE STABLE.<br />\nA gabled ox and docile sheep;<br />\nA weary mother and her child.<br />\nThe woman's eyelids long to weep—<br />\nHer girlish face is pale and mild.<br />\n\"Little darling go to sleep.\"<br />\nThen the baby turned and smiled.<br />\nTHREE KINGS.<br />\nSpices, Frankincense, Balm and Myrrh,<br />\nFinely gilled Balsam all fresh from the fir,<br />\nA crown and sceptre of rubies rare<br />\nPoor gifts for the Heaven-born King we bear.<br />\n0, King of Kings! look down upon us,<br />\nWe be Kings of the East, so Kings of the<br />\nEarth<br />\nWe saw Thy gar, gleaming afar<br />\nCalling the Nations to worship Thy birth.<br />\nANGELS.<br />\nHalleleujah! Halleleujah !<br />\nPraise ye the Lord, bless Him<br />\nAnd magnify Him forever.<br /><br />\nTHE NEWS=LETTER<br />\nVol,. XI.<br />\nSubscriptions, $1.50 per year.<br /><br />\nDECEMBER 21, 1906.<br /><br />\nNo. 5<br /><br />\nPublished Fortnightly.<br /><br />\nio Cents per copy<br /><br />\nBOARD OF EDITORS.<br /><br />\nCarl Bernhardt, 1908, Editor-in-Chief.<br />\nLawrence Melville Riddle, 1908, Ass't Editor-in-Chief.<br />\nHarry K. Hardcastle, 1908, News Editor.<br />\nF. B. Pedrick, 1909, Ass't News Editor.<br /><br />\nLeGrand Winfield Perce, 1907, Athletic Editor.<br />\nAlan Chesney, 19o8, Asst't Athletic Editor.<br />\nHermann J. Hughes, 1908, Business Manager.<br />\nJ. Purdon Wright, tgo8, Asst's Business Manager.<br /><br />\nAddress all articles, communications, etc., to Carl Bernhardt, Box 55 Johns Hopkins University,<br />\nBaltimore, Md.<br />\nSubscriptions and business communications should be sent to Business Manager, Box 224, Johns<br />\nHopkins University, Baltimore, Md.<br /><br />\nEDITORIAL.<br />\nHE NEWS-LETTER wishes on behalf of the students to thank the Lacrosse<br />\nTeam of 1902 for their generous offer. Such spirit is surely an answer<br />\nto the mistaken theory that spirit is wanting at Hopkins. The class<br />\nteams of last year were recognized as one of the reasons for the successful lacrosse year. They not only aroused interest but developed<br />\nmaterial. Without interest and a well-trained scrub a team is seriously<br />\nhandicapped. Let us hope that 1902's enthusiasm will be well repaid in the shape of another<br />\nchampionship team in 1907!<br /><br />\nHE gentle reader will notice in this issue two letters. One is the official<br />\nstatement of the Board of Governors of the Athletic Association in regard to baseball and undergraduate football; the other a letter from Mr.<br />\nThomas Campbell apropos of baseball. Mr. Campbell's letter is equally<br />\nauthorative. THE NEWS-LETTER believes there should be a baseball<br />\nteam if it is possible. Also it believes there should be no criticism of<br />\nthe J. H. U. A. A., in its attitude on baseball up to this time, it should<br />\nbe recognized that no team can be run without money. But it seems to<br />\nTHE NEWS-LETTER that money is the only consideration. It is to be<br />\nhoped that the undergraduate team idea will not be overworked. It has many advantages but<br />\nthe fact must ever be remembered that the graduate and medical departments have just as good<br />\na right on the teams (other things being equal) as the undergraduates. As a member of the<br />\nAthletic Board has said, \"the undergraduate idea can easily he run into the ground.\"<br />\nThere is no cause for excited words over the baseball situation; if there is need<br /><br />\nTHE NEWS-LETTER.<br /><br />\n3<br /><br />\nof money for baseball let steps be taken at once, by every one, to raise funds. The writer was<br />\nmuch impressed by the fact that other colleges have taken a very great interest in Hopkins<br />\nsince the defeat of Lehigh and Virginia. THE NEWS-LETTER hopes that baseball will not be<br />\ndropped for there is plenty of material worthy of the financial backing of the students.<br />\n\"Money for Baseball !\"<br /><br />\nS we have said before in a previous issue, it is not exactly our intention<br />\nto pull up this or that skeleton which may lurk around the University,<br />\nor to continually point the finger of shame at the various activities which<br />\ngo to make up the daily life of the institution, but rather do we intend<br />\nto furnish a fair statement of the consensus of opinion of the under'graduate body and at the same time to bring out a really interesting<br />\npaper which will count for much in the raising of much lowered moral<br />\nstandards. \"But, 'now to business;' said Sue.\"<br />\nThe recent controversy which has arisen among the students as to<br />\nthe recognition of the baseball team has brought to our mind a question concerning the Athletic Board, that is, what does the Athletic Board really represent? One<br />\nhears on all sides statements as to the partiality of the board as to the unfairness and so on<br />\nuntil one wonders how the board ever were elected.<br /><br />\nWhen we acknowledge their election the<br /><br />\nquestion arises as to what consensus of opinion do they follow. Among the list of members<br />\nwe see that there are senior delegates, junior delegates and a freshman delegate but as far as<br />\ncan be seen the only thing necessary for their election is that they belong to their respective<br />\nclasses. Do they then necessarily represent the members of their class. According to the<br />\npresent system of election we do not think so. The delegates are elected by the members of<br />\nthe University in toto and it matters little if the class which the delegate is going to represent<br />\nis for or against the one elected. Consequently the delegates of the various classes do not in<br />\nany way represent the opinions of their classes and are in no way bound to carry out any of<br />\nthe plans which that class may see fit to suggest. To my mind this mode of procedure is not<br />\nexactly just to say the least.<br />\nA better plan might be to have the various classes elect their own delegates separately<br />\nand have it understood that these delegates are to follow the expression of opinion of that<br />\nclass. How far it would be beneficial to carry this out is a question which we will not undertake to state here.<br />\nIt is obviously necessary that something must be done in this direction on account of<br />\nthe hammering that the Athletic Board has been receiving in the last two years. Last year<br />\non account of the track team and this year on account of this baseball question. While we<br />\nknow that there will always be complainers, would it not be better to do something to hush<br />\nthis continual knocking than to let things run on as they are? It would be better in our<br />\nopinion to have these delegates elected at the same time as the other officers of the class.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n4<br /><br />\nBALTIMORE, MD., December 13, 1906.<br />\nMR. CARL BERNHARDT,<br />\nEditor-in-Chief of the NEWS-LETTER,<br />\nJohns Hopkins University.<br />\nDEAR SIR :<br />\nNow that the football team has completed its schedule, and the Lacrosse candidates<br />\nought to be beginning to take up their sticks again so as to get into practice for the coming<br />\nseason, we, the undersigned, take this opportunity to come to the front and congratulate the<br />\npersonnel and candidates of the team of 1906 on bringing back the Championship Lacrosse<br />\nBanner to its proper place—in our Trophy Room. Those of us who saw the final contest<br />\nwith Swarthmore were impressed with the good-fellowship and spirit which prevailed in the<br />\nranks of our team; and also by the article of play which was delivered. All we can say is<br />\n\"Good work\" for 1906.<br />\nAt this time we take the liberty to sound a note of warning: \"Do not get chesty;\"<br />\nSwarthmore's team of last Spring will not be able to hold a candle to the same team this next<br />\nSpring. A word to the wise is sufficient.<br />\nHaving indulged in a little preliminary discourse, we will now turn to the real object<br />\nof this letter. The Lacrosse Team of 1902 being satisfied both that its attempt to encourage<br />\nthe beginners met with success last Spring; and that many of the new men, who may have<br />\nfallen by the way-side, were kept at practice, it is again willing to donate twelve silver ioving<br />\ncups to the student body of the Johns Hopkins University. These to be presented to the<br />\nplayers of the team carrying off the palm of victory in two out of a series of three lacrosse<br />\ngames to be played between the Junior and Freshman classes.<br />\nThe condition to govern the contest to be as follows:<br />\nFIRST—The parties to the contest shall be twelve players picked from the Junior Class<br />\non the one side; and twelve players picked from the Freshman and Sub-Freshman classes on<br />\nthe other.<br />\nSECOND—The games may be played on any field the contesting classes may select.<br />\nTHIRD—The games are to be played if possible in March and up to the middle of April<br />\nand on such dates as not to interfere with the practice of the University Lacrosse Team.<br />\nFOURTH—Two out of three games must be played.<br />\nFIFTH—Should any disputes arise between the two classes as to the eligbility o3 any<br />\nstudent, date and place of games, length of halves, officials, etc., it shall devolve upon a<br />\ncommittee consisting of the captain of the 'Varsity Lacrosse Team, the Physical Director of<br />\nthe University and the President of the Board of Governors of the Athletic Association to pass<br />\non such disputes. Whatever decission may be reached by this Committee shall be final.<br />\nSIXTH—If it should so happen that two or more men should be called on to fill the<br />\nin the same or different games throughout the series, it shall devolve on the<br />\nposition,<br />\nsame<br />\nto select the player entitled to receive the prize.<br />\norganization<br />\nclass<br />\nWe suggest that the two classes appoint their respective captains at their earliest opportunity, so that these men may see to it that their candidates report to practice with the<br />\n'Varsity squad and thus raise the standard of the class teams.<br />\nBefore leaving this matter with you we wish to call the attention of the students, who<br />\nare interested in our future lacrosse teams to the fact that the City College Lacrosse Team of<br />\nlast year had a hard struggle to maintain its existence; owing largely to the fact that many of<br />\ntheir men graduated from that institution to swell our number at the Unfversity. Some of the<br />\nundersigned have spent sleepless nights and also class hours in trying to work out plans to<br />\nmake lacrosse a fixture at the City College. Shall we give up this valuable training school for<br /><br />\nTHE NEWS-LETTER.<br /><br />\n5<br /><br />\nour teams of the future? We ask that you do all in your power to foster this year's team at<br />\nthe College; 'we need its members in our business.\"<br />\nTrusting that you will give this matter your attention in the columns of the NEwsLETTER, and hoping to hear from you that the undergraduates are ready to play a series of<br />\ngames under the conditions as suggested above, we remain,<br />\nYours respectfully,<br />\nTHE LACROSSE TEAM OF 1902.<br />\nB. Swayne Putts, Allegheny, Pa.<br />\nJ. Abner Saylor, Jr., Baltimore.<br />\nE. P. Bernheim, Louisville, Ky.<br />\nL. M. Tough, Jr., Fort Wayne, Ind.<br />\nH. P. Straus, Belleville, N. J.<br />\nWm. C. Schmeisser, Baltimore.<br /><br />\nB. M. Bernheim, Louisville, Ky.<br />\nW. S. Bird, Chicago, Ill.<br />\nRonald T. Abercrombie, Baltimore.<br />\nF. C. Blanck, Baltimore.<br />\nErnest G. Schmeisser, New York City.<br />\nJ. Straith Briscoe, Baltimore.<br /><br />\nHISTORY 7.<br />\nThere was once a course in the University<br />\ncalled History 7, if there had not been this<br />\nstory would not have been written. By some<br />\nchance the instructor of this course was<br />\nnamed Blinkensop, Ph. D. His real name<br />\nwas Holy Blinky. By chance, in the guise of<br />\na hurried and worried advisor, my friend<br />\nWarren Caruthers Carteret took this course.<br />\nPerhaps it was not chance, but assuredly it<br />\nwas not by design that \"Carrie\" Carderet<br />\nflunked the Christmas examination in History<br />\n7. \"Hence,\" as my friend 'Hooley\" puts<br />\nit, \"the trade winds.\"<br />\nNow it is remarkable how many people<br />\nliked \"Carrie Carteret. Dogs, men and girls<br />\nhad him for their friend and he had them. It<br />\nmay be doubted whether even the instructors<br />\ndid not in the bottom of their hearts, really<br />\nrejoice in his atmosphere. Even little crabbed<br />\nGuerber, the instructor in German 2, was<br />\ncheered when \"Carrie\" politely uncovered to<br />\nhim.<br />\nIt was true that Carruthers did flunk, but<br />\nit as he said was probably because Blinkensop<br />\ndid not approve of tweeds and cigarettes.<br />\n\"And now,\" said Carteret, \"I will thank any<br />\none for a simple paper cigarrette whilst I regale myself (and possibly you) with the tale<br />\nof the 'voyage de M. Blinkensop.'\"<br />\n\"It seems,\" continued Carteret, \"that at<br />\none time my friend Blinky, Ph. D.. was<br />\nselected as the historian of an expedition to<br /><br />\nthe West Indies. No. I don't know what<br />\nthe expedition was about, nor why the devil<br />\nhe was selected. But I do want you to understand that Edmund Thensaurochryson<br />\nichochrysides Blinkensop is a most religious,<br />\ncareful, conscientious, scrupulous person, and<br />\nthat is exactly why I didn't get through History 7.<br />\n\"Now on this expedition were, I should<br />\nsay, a very jolly set, even if they were doctors<br />\nof philosophy, and on arriving in port at some<br />\nfoolish island, which belongs to the British<br />\nthey paid their respects to the governor, who<br />\nwas lonesome in his solemnity, which consisted of niggers. And after consuming many<br />\ncooling drinks,(They grow mint on those<br />\nislands, don't they? If they don't I wont<br />\npatronize them.) they, as I was about to say,<br />\nbefore I interrupted myself, were invited to a<br />\nlarge luncheon the following day, which I<br />\nthink was perfectly sweet of the governor. I<br />\nwill thank anyone for another cigarette.<br />\n\"Yes, sir! They were all invited to this<br />\nparty, every man on board, including Holy<br />\nBlinky. Well, naturally, they all put on their<br />\nfine apparel and Blinky primped longer than<br />\nthe rest. So the men on deck, all glorious<br />\nwith white flannel and hat bands, waited for<br />\nBlinky. Finally Blinky appeared in a frock<br />\ncoat, red tie, duck trousers, a yachting cap.<br />\nIt was a great thing, he thought, to be entertained by the representive of the British.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br /><br />\n\"As for the governor, he was looking for a<br />\ntime. His niggers prepared a feast and had<br />\nfrom the cellar the most cobwebby bottles,<br />\n1798 Maderia, and all the rest of it.<br />\n''So Blinky, with the rest of them, entered<br />\ninto the long squatty house, over which waved<br />\nthe British flag. They were taken into the<br />\ndining hall immediately. It is true Blinky<br />\ndid insist on taking his hat and umbrella into<br />\nthe dining room. All these he craftily put<br />\nunder his chair. Nor would he remove the<br />\ncotton gloves. But these are mere details and<br />\nthey were all very polite, of course.<br />\n\"Well, Blinky had never tasted wine, but<br />\nthe heat of the day had aroused an unquenchable thirst. He drank all manner of cooling<br />\ndrinks, which looked harmless and tasted<br />\nawfully good, and then he got red behind the<br />\ngills.<br />\n\"Now just why the conversation turned on<br />\nRoman Government I can't say, because, as I<br />\nsaid before, they were, with Blinky's exception, awfully nice chaps. (Winslow was there—<br />\n'Pinky' Winslow—and he's a corker. He<br />\nwas my brother's roommate at college, and<br />\nthough he is quite a shark at history, he can<br />\ndrink like a fish and tell stories by the yard,<br />\nand his parlor tricks are killing.) But at any<br />\nrate they talked of Roman judicial proceedure.<br />\nThen Blinky pounded on the table with his<br />\nfist and demanded attention. Just to be polite<br />\nthey gave him room. Now if you can understand what a mixture of Bible and Roman<br />\nHistory and cooling drinks are you will be by<br />\nway of knowing what happened.<br />\n\"The Governor being a polite man only<br />\nsaid, 'Only fawncy! Quite true, but what a<br />\nbally ass, don't you know.'<br />\n\"At any rate, just as they grabbed him by<br />\nthe coat tails, Blinky emitted this: 'The<br />\nwhole of Roman judicial proceedure is summed<br />\nup as the Bible excellently and elegantly puts<br />\nit: 'Thou hast appealed unto Cmsar; unto<br />\nCaesar shalt thou go.' Then they tenderly<br />\nbut firmly withdrew him, not forgetting the<br />\nyachting cap and the green cotton umbrella.<br />\nSo W. Carruthers Carteret took a re-examination after Christmas. He was asked one<br />\nquestion: \"Describe in a few words the proceedure of the Roman courts.\" And after<br />\nten minutes \"Carrie\" handed in the paper<br />\nwith the following answer;<br /><br />\n\"The whole of Roman judicial proceedure<br />\nis summed up as the Bible excellently and<br />\nelegantly puts it: 'Thou hast appealed unto<br />\nCxsar; unto Cxsar shalt tou go.'<br />\n\"I am much surprised,\" said Mr. Blinkensop, \"to see the excellent grasp you have of<br />\nthe subject. It is by far the best answer I<br />\nhave ever received from a class.\"<br />\nCarteret needed the 10 he got at Easter<br />\nnext, he went to the town of New York and<br />\nstayed for seme days by way of spending the<br />\ncheck a generous paternal parent gave him<br />\n\"for such an excellent mark in History 7.\"<br /><br />\nTHE DOLOROUS HISTORY OF SIR<br />\nLIONET.<br />\nI.<br />\nDay-time, or night? nay, love, I hardly know,<br />\nWith me the clouds have fallen now so low<br />\nI cannot tell if night or day be here;<br />\nAll that I know is that the hours do go.<br />\nThen, must I leave the sun and pass away?<br />\nAh, will you in the earth my body lay?<br />\nAll the fair flowers and forests I must leave,<br />\nAll the bright beauties of the dazziing day?<br />\nOutside, the fields are sunny and the trees<br />\nRustle melodiously amidst the breeze,<br />\nThe air is filled with song of happy birds<br />\nAnd droning hum of honey-bearing bees.<br />\nIV.<br />\nAnd here, within this chamber, at my side<br />\nArt thou, my love, my fair one, 0 my bride!<br />\nYou must I leave, 0 worser fate by far<br />\nAnd my one comfort is \"All men have died.\"<br />\nV. .<br />\nThe darkness closes in, night comes apace,<br />\nNow would I give all hope of Heaven's grace,<br />\nAll future joys and all life divine,<br />\nFor one lost lingering look upon thy face.<br />\nVI•<br />\nThe shadow wraps me round and all is dark;—<br />\nI see, I feel. I hear not.—Nay, but hark!<br />\nMy inner conscience tells me that without<br />\nCarrols with joyous note the morning lark!<br />\nS. C, C.<br /><br />\nTHE NEWS-LETTER.<br /><br />\nCAMILLE.<br />\n\"Que tu es belle, Camille, quand tea yeux s'animent.—<br />\nAlfred de Musset.<br /><br />\nI.<br />\nDisdainfully you flash those eyes,<br />\nAs hard as steel,<br />\nYet, even so, the fairer prize<br />\nyou are, Camille!<br />\nYou, with a cold, an icy glance,<br />\nMy blood congeal<br />\nThen. witly they fiery, love-like dance,<br />\nPierce me, Camille.<br />\n. Upon my weary heart, in scorn<br />\nYou press your heal,<br />\nSuch heartlessness makes me forlorn<br />\nAnd sad; Camille.<br />\nIV.<br />\nTo you, 0 fair, most scornful fair,<br />\nTo you, I kneel.—<br />\nForget that proud, disdainful air;<br />\nLove me, Camille!<br />\nS. C. C.<br /><br />\nSEPARATION.<br />\nI.<br />\nWe watched the clouds together—you and I—<br />\nFloat over land, and over summer sea;<br />\nLong years have past, but there comes back<br />\nto me<br />\nThoughts of those summers now so far<br />\npassed by.<br />\nAs clouds, those happy thoughts of happy<br />\ndays<br />\nFloat towards me through life's russet sunset glow;<br />\nI dream of days together—long ago—<br />\nE'er we approached the parting of the ways.<br />\nThe stream was dark—the river wide and deep;<br />\nWe separated—one on either shore,<br />\nAll, then we parted, to approach no more.<br />\nNow I, beside Death's ocean watching, weep;<br />\nand thou—thou art asleep!<br />\nS. C. C.<br /><br />\nBASEBALL.<br />\nDecember 8, 1906.<br />\nTo the Editor of the News-Letter:<br />\nDEAR SIR.—I was delighted to read, in<br />\nyour last issue, an article advocating the recognition of the baseball team for this year. This,<br />\ncoming from a member of last year's team,<br />\nshows that the spiritfor baseball has not entirely succumbed, while at the same time it<br />\nproves that those who took part in the game<br />\nand know most about the matter are eager for<br />\nthe maintenance of the team, and fully aware<br />\nof the fact that it is not only possible to have<br />\none, but that it is the best thing and the only<br />\nthing to do.<br />\nThere are two reasons given for not recognizing the team—namely, lack of interest and<br />\nlack of funds.<br />\nFor anyone to say that there is a lack of interest is as absurd as it would be immaterial<br />\nif it were a fact. If there's no interest—make<br />\nit. Anyone who was present at the Lehigh<br />\ngame last year would have been a poor interpreter of human actions if he should not have<br />\nseen that the fellows were with the team, and<br />\ncrazy for victory and delighted when it came.<br />\nTo tell the truth, I believe there was more interest shown at that game than at any Lacrosse game last year, with the possible exception of;the Swarthmore game, for which I cannot speak as I was not fortunate enough to be<br />\npresent, being at the time at Charlottesville<br />\nwhere we enjoyed another glorious victory.<br />\nBut whatever might have been the real feeling in the matter, the fact remains that there<br />\nwere as many fellows present at the baseball<br />\ngames, and as much rooting, if not more,<br />\nthan at the Lacrosse games.<br />\nSomeone might say: \"Oh, yes, when we<br />\nhave a team, the fellows come out to see the<br />\ngames, but they are not interested enough to<br />\ntry for the team, etc., etc.\" All of which is<br />\nagain absurd, and contrary to fact. We had<br />\nsomething like fifteen or twenty candidates<br />\nlast year. Some of these, it is true, were not<br />\nup to the standard, but the fact remains that<br />\nthey had the spirit to come out. What's more,<br />\nat least half the fellows are back again, and<br />\nthere are other good men who said they would<br />\ncome out this year. All that is needed now,<br />\nis a manager to arrange a schedule and to<br />\ndrum up players, but he's needed immediately.<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nThe objection that there are not enough<br />\nfunds to run a baseball team together with the<br />\nother teams, of course is a different matter,<br />\nand can best be decided by the Athletic Board—<br />\nfor they know what money they have and for<br />\nwhat it is to be spent.<br />\nStill, I think if they make a careful study<br />\nof the thing they will come to the conclusion<br />\nthat a baseball team can easily be recognized<br />\nand backed financially. To back up this<br />\nstatement we have only to look at last years<br />\nrecord of expenses, etc.<br />\nThe appropriation for baseball last year was<br />\n$225. Their actual expenses—over gate receipts, etc.—was about $157. This means<br />\nthat the team spent only $157 of the appropriation, i. e. $70 less than was authorized.<br />\nIf this could be done last year, it can be<br />\ndone this year. In fact, I think the team will<br />\nhave fewer expenses this year than last. Last<br />\nyear we had to buy suits which cost about $42;<br />\nwe had to buy a mitt which cost $5. This is<br />\n$47 which will not have to be spent this year.<br />\nBut this is not all—for last year we played St.<br />\nJohn's in Baltimore—or rather scheduled the<br />\ngame there. This year we would have to<br />\nplay at Annapolis, and would receive $30<br />\nguarantee which would more than pay expenses. We could get $40 from Navy, which<br />\nmuch more than pays expenses. West Point<br />\ngave us $125 last year, which paid expenses<br />\nall but about $10. They were very much<br />\npleased with the game, and asked us to be<br />\nsure to come again. I'm certain they would<br />\ngive a guarantee to cover expenses this year.<br />\nUniversity of Virginia gave a guarantee which<br />\npaid expenses all but 8 cents.<br />\nCertainly, from these few facts it is plain<br />\nthat the financial difficulty is more of a myth<br />\nthan a reality. Nor does the fact that the<br />\nthree games played at home failed to pay expenses, alter the matter. It must be remembered that these games were played—two of<br />\nthem on Friday, and the other on Saturday<br />\nmorning. The only other game we had<br />\nscheduled at home was the St. John's game<br />\nwhich more than paid expenses by over $80,<br />\nand which would have paid still more had not<br />\nthe storm come up, and kept the people away.<br />\nI don't want to be \"butting in\" on anything that is none of my business, but as I am<br />\nvery much interested in the team, and as I<br /><br />\nknow the facts of the case, I thought it would<br />\nbe worth while acquainting the fellows with<br />\nthe same. While I think the Athletic Board<br />\nhas done what it deems best, I think also that<br />\nthey acted too hastily in abandoning the team,<br />\nand most inexcusably slow in electing another<br />\nmanager. They evidently have an erroneous<br />\nidea of the amount of interest in the game at<br />\nJ. H. U., and they over-estimate the expense<br />\nof running the team.<br />\nWhat would be the result if someone should<br />\nsuggest that we drop Lacrosse? There's not<br />\none of us who would not fight to the last ditch<br />\nto maintain the game. Its our game. In<br />\nLacrosse we're \"it.\" Just so will we fight<br />\nfor baseball. It's the game of America—the<br />\ngame of all colleges. And, while we have<br />\nobtained more glory in Lacrosse, we feel that<br />\nthe baseball team has done, taking everything<br />\ninto consideration, as much.<br />\nLet us not then stand back and say there<br />\nare.too many difficulties to be overcome, but<br />\nlet us get together, have a team, and make it<br />\nsuccessful. The greatest pleasure and glory<br />\nis in doing the hard things. The weakest and<br />\nmeanest thing a man can do, is to give up<br />\nbeforehand because he thinks he's going to be<br />\nlicked.<br />\nThen here's to the success of baseball at<br />\nHopkins, the game which most men, who<br />\nhave played all the games and know them,<br />\nrecognize as, not only one of the most open<br />\nand beautiful games to watch, but, with the<br />\npossible exception of tennis, as the cleanest<br />\nand most sportsmanlike game we have.<br /><br />\nTHOS. G. CAMPBELL, '05.<br />\nA STATEMENT.<br />\nGENERAL ATHLETIC ASSOCIATION<br />\nJOHNS HOPKINS UNIVERSITY<br />\nBaltimore, Md.<br />\nTo the Editor of the News-Letter:<br />\nDEAR SIR —There has been a great deal of<br />\ndiscussion about the action of the Athletic<br />\nBoard in regard to the baseball and football<br />\nteams and it was deemed advisable than an<br />\nexplanation should be made.<br />\nBaseball was not recognized for two reasons.<br />\n1st—There was no money to support the<br />\nteam.<br />\n2nd—There was not sufficient interest mani-<br /><br />\nTHE NEWS-LETTER.<br /><br />\nfested among the undergraduate students.<br />\nIn explantion of the first reason let me give<br />\na few figures.<br />\nThere is placed in the hands of the Athletic<br />\nBoard each year by the University about $800.<br />\nThis is usually divided among the four<br />\nteams of football, track, lacrosse and baseball<br />\nby appropriations of $200 to each team.<br />\nLast year however, the football team had a<br />\ndeficit of $79 extra of their appropriation but<br />\nthis was covered by the fact that the track<br />\nteam turned back $76 to the treasury since<br />\nthey made $242 at the meet held in the<br />\nArmory and the lacrosse team turned back<br />\n$79 owing to the gain of $321 from the<br />\nSwarthmore game.<br />\nThe. baseball team, thanks to the excellent<br />\nmanagement of Mr. Cambell turned back<br />\n$59. So all was well.<br />\nThis year the football was given their usual<br />\nappropriation of $200 and besides that they<br />\nhave a deficit of nearly $400. The lacrosse<br />\nteam will in all probability not have as successful a season as last year since the Swarthmore game will be played out of town and the<br />\n$321 made at that game will not be forthcoming this year. This means that most likely<br />\nthe lacrosse team will need more money than<br />\ntheir $200 appropriation.<br />\nThe track team so far, has been unable to<br />\nsecure the Armory for a meet and that means<br />\nthat $242 made last year at the Armory games<br />\nwill be cut off from the track team this year.<br />\nIf the Armory is secured one-half the gain<br />\ngoes to the Homewood. This team will most<br />\nassuredly need more than $200.<br />\nNow if the football team had just used their<br />\n$200 there might have been a possibility of<br />\nhaving enough for the other three teams, but<br />\nthe football team used $600 of the $800 in the<br />\ntreasury and with the fact that lacrosse and<br />\ntrack will probably need more, it simply<br />\nmeant that one team had to be dropped.<br />\nWhich one should it be? The Board looked<br />\nat it in this light. There was less interest in<br />\nbaseball than in any of the other sports and<br />\nbaseball was dropped.<br />\nFrom the Senior class, Mr. Iglehart was the<br />\nonly man who has been out for the team in<br />\npast years and he would be debarred this year.<br />\nFrom the Junior class, Mr. Hardcastle was<br />\nthe only man out last year. From the Fresh-<br /><br />\n9<br /><br />\nmen let us say, four would come out for the<br />\nteam.<br />\nWould it be right to drop track or lacrosse<br />\nfor baseball when only five undergrads. were<br />\neven out for the team and there are twice that<br />\nmany out for lacrosse and track? It would<br />\nmean that most of the men on the baseball<br />\nteam would be meds. or grads.<br />\nThe money paid into the treasury is paid by<br />\nthe undergrads. and surely it should be used<br />\nfor their teams as far as possible.<br />\nIn regard to the football team the only<br />\nmotion passed was that next year the captain<br />\nbe an undergraduate. There was no motion<br />\nmade or passed to debar meds., grads. or any<br />\nother department of the University.<br />\nThe sentiment of the Board was that the<br />\ncaptain be undergrad. a good coach secured,<br />\nand everybody who wants to come out for the<br />\nteam can do so. But the men who practice<br />\nfaithfully and regularly would not be replaced<br />\non the day before the game by some man who<br />\ncomes out with a reputation but who has not<br />\ntrained and who, previous to this, had not<br />\nbeen out for the team. The Board wants to<br />\nsee every man given a fair show and in the<br />\npast the undergrad. were certainly not given<br />\nthis in football.<br />\nNow, if you will pardon it, a few personal<br />\nreasons why we should have an undergraduate<br />\nfootball team.<br />\n1st—It would save a bill of $190 to $200 a<br />\nyear for meals.<br />\n2nd—The men could get out on the field<br />\nat least once a week, which is an essential.<br />\n3rd—The men would train which has not<br />\nbeen done by the team in the past two years.<br />\n4th—The players would be Hopkins men<br />\nwho would fight for all they were worth to<br />\nwin and not men playing merely for the love<br />\nof the game.<br />\n5th—The team would be better supported<br />\nby the student body and its friends, and the<br />\nalumni.<br />\n6th—Under new rules the game does not<br />\nneed so much weight as it needs speed and<br />\nhead-work, and by having practice on the<br />\nfield once a week a better team could be<br />\ndeveloped than by relying on the medical men<br />\nto work in the cage two or three nights a<br />\nweek.<br />\nTo summarize the team would be a better<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nteam, would be supported by the student<br />\nbody, and would be more successful financially.<br />\nIt is not right that the other teams should<br />\nsuffer on account of football and at least $190<br />\nof the $400 deficit this year was due to meals<br />\nwhich amount would be saved by an undergrad. team.<br />\nYours very truly,<br />\nJOHN MALLORY HOLMES.<br />\nCorresponding Secretary.<br /><br />\nJUNIOR VS. FRESHMAN.<br />\nAnother class football game has come and<br />\ngone and, as is usually the case, the Juniors<br />\ngained the victory. The victory was a hard<br />\nearned one, and both teams deserve great<br />\ncredit for their sterling exhibition of hard,<br />\nclean football. The victory was won by the<br />\nnarrow margin of five points, scored in the<br />\nlatter part of the first half. After a series of<br />\neven plays, the ball was in the possession of<br />\nthe Freshmen on their own 15-yard line; an<br />\nattempt to punt was blocked by Tilghman of<br />\nthe Juniors, and Street '08 fell on the ball on<br />\nthe Freshmen's 4-yard line. From there, in<br />\nthree line plunges, the Juniors pushed Bridgman over the line for a touch down. The attempt at goal failed and the half ended soon<br />\nafter. In the second half the playing was<br />\nslightly in favor of the Juniors, but the advantage was very slight. In this half '09<br />\nworked the prettiest forward pass that has<br />\nbeen seen around Baltimore this year; Bevan<br />\ntheir end receiving the ball nicely and gaining<br />\nabout 25 yards on the play.<br />\nOne of the surprises of the game was the<br />\nremarkable strength shown by the '08 line.<br />\nThe Freshmen were supposed to have a slight<br />\nadvantage there, but the Junior line played so<br />\nwell, that they easily offset the advantage the<br />\nFreshmen had in Michael, by successfully<br />\nbreaking three and blocking his punts. For<br />\nthe juniors Abel at right half played the best<br />\ngame, closely followed by Chesney and Bridgman. Chesney had the call over Bird '09 in<br />\nbacking up the line, and was in the main part<br />\nresponsible for the failure of the Freshmen's<br />\nattempted end runs.<br />\nToby Tilghman played well at left tackle,<br />\nand it was through him that the Juniors were<br /><br />\nable to score. For the Freshmen Gutman<br />\nplayed the best game.<br />\nFollowing the football game came the cane<br />\nrush and, contrary to general expectations,<br />\nthis was won by the Freshmen by 11 hands to<br />\n10. This was due partly to the fact that Bird,<br />\npresident of '09, succeeded in pulling the '08<br />\npresident, Wegefarth, over his head as the<br />\nwhistle blew, and partly to the fact that the<br />\nFreshmen were more successful in getting<br />\nhands on the cane after the time was up.<br />\nWith all the regard due to those in charge<br />\nof affairs, we must say that there should be<br />\nsome change made in the future, in the manner of running the cane rush, for there was<br />\nsuch confusion and debate in the counting<br />\nthat it was hard to tell who had a hand on the<br />\ncane and who had not. Moreover, the present<br />\ngeneration must be possessed of remarkable<br />\nsmall hands to get 21 good grips an a cane<br />\nscarcely longer than 3 feet 6 inches. The<br />\nFreshmen won the contest squarely nevertheless, and it will pass on to history as a victory<br />\nfor '09 by the score of 11 to 10.<br />\nAnother important event which was noticed<br />\nat the game, was the blossoming out of the<br />\n1908 class flag. This particular banner is a<br />\nwonderful creation of red, white, and what<br />\nnot, and with the respect due it we are somewhat possessed of the idea that its designer<br />\nmust have been under the influence of a welsh<br />\nrabbit when he produced a design of such<br />\nnightmare qualities.<br /><br />\nLACROSSE.<br />\nThe first call has been issued, the necessary notices have been posted, and Wednesday,<br />\nDecember 26th will see an enthusiastic bunch<br />\nof candidates out in the cage. According to<br />\npast custom, there will be a meeting in the<br />\ntrophy room at 3 p. in., at which the candidates will be instructed in the Hopkins system<br />\nof play by the graduate coaches. This marks<br />\nthe formal opening of the Lacrosse season.<br />\nAll along during the Fall, many of the men<br />\nhave been handling the ball in the cage,<br />\nbreaking in new sticks, and getting in track<br />\nwork.<br />\nAs in previous years, the hardest practices<br />\nof the year will be held on Wednesdays and<br />\nSaturdays. The Monday and Friday practice<br /><br />\nTHE NEWS-LETTER.<br /><br />\n11<br /><br />\nwill be confined to instruction in the rudi- monument and tomb to the man who, nearly<br />\nments of the game, such as stick-work, body- a hundred years ago, navigated the Hudson<br />\nchecking and picking up the ball. Track with the Steamship \"Clermont.\" A number<br />\nwork will also be conducted. With this defi- have been awakened out of the apparent state<br />\nnite plan in view, we may expect a thorough of neglect by the foreign homage paid Fulton,<br />\ndrilling of the men in the fundamentals of and by the intention of the French to hold<br />\nlacrosse.<br />\nnext year at Bordeau an exposition in honor<br />\nA survey of the squad reveals much good of the inventor of the steamboat.<br />\nmaterial. The old men have been mentioned<br />\nDr. Nicholas Murray Butler. President of<br />\nbefore, so they should uot feel hurt if they do Columbia University, appointed to get the<br />\nnot see their names in print. Moreover, if colleges and schools interested, asks for the<br />\nthey are spoken of too often, they might get subscription of $1 from students. Colleges<br />\nswelled heads. After a year's absence from which contribute will have their names pnt on<br />\nthe game, Morse is again out, and should be the bronze which will line the interior of the<br />\nof help; to the svuad, with his experience and monument.<br />\nweight. Among those who played on the<br />\nsecond team last year, are Mathias, Abel,<br />\nWegefarth, Streett, Price, Wylie, Hecht,<br />\nSTUDENT CONTRIBUTION FUND.<br />\nReinhart, Williams, Tillghman, Armstrong—<br />\n(Contributions should be sent to Mr. Herall Juniors. But few Seniors other than the<br />\nmann<br />\nJ. Hughes, Business Manager, Johns<br />\n'Varsity men, including MacSherry, have<br />\nHopkins NEWS-IA=1m, Box 224, John Hopbeen out.<br />\nkins<br />\nUniversity.)<br />\nFrom the incoming class there are several<br />\nNEWS-LI=ER<br />\n$5.00<br />\nwho now have sticks. They are Maddren,<br />\nArthur R. Padgett, '07<br />\n5.00<br />\nChandlee, Michael, Gutman, Stewart, JohnS. M. R., '07<br />\n5.00<br />\nson, Russell, Smith, Vogeler and some others.<br />\nMore are needed from this class, however, and<br />\n$15.00<br />\nthey should begin at once. Remember the<br />\ndate, Wednesday, December 26th, in the<br />\ntrophy room, and let everyone come out.<br />\nMake the season start with a rush, and make<br />\nthis rush continue until another banner is<br />\nlanded.<br /><br />\nGIFFARD DE J. MESNY<br />\nROBERT FULTON MONUMENT.<br />\nDr. Remsen received several weeks past, a<br />\nletter from the Secretary of the Robert Pulton<br />\nMonument Association, in which are set forth<br />\nthe object of the new movement and a nutuber of interesting facts connected with it.<br />\nWith Mr. Cornelius Vanderbilt as President,<br />\nthe Association proposes to raise $600,000 to<br />\nerect at some spot on Manhattan Island a<br /><br />\nARTIST PHOTOGRAPHER<br /><br />\n226 N. Charles Street<br /><br />\nBaltimore<br /><br />\nTHE NEWS-LETTER.<br /><br />\n12<br /><br />\nR. Q. TAYLOR &amp; CO.<br />\nHats, Umbrellas, Canes, Hand Satchels<br />\nMark Cross Co.'s London Gloves<br />\n11<br /><br />\nNORTH<br /><br />\nConklin's<br />\nSelf- DAm<br />\nFilling A %All<br /><br />\nCHARLES STREET<br /><br />\nFor busy people.<br />\nNo bother.<br />\nFills itself.<br />\nCleans itself.<br />\nNo dropper.<br />\nNothing to take apart.<br />\nNothing to spill.<br />\nA dip in ink, a touch<br />\nof thumb to nickel<br />\ncrescent and the<br />\npen is full, ready<br />\nto write.<br /><br />\nDo You Enjoy GOOD Cigarettes?<br /><br />\nE<br /><br />\nWe put Monogram or Name on Cigarettes<br />\nT ,, 07.01 ”I ,<br />\n,<br />\n‘<br />\n,<br />\n01.$...<br />\nt4,WAN.,,,• II , T • 11 ,1.t 1 II<br />\n.-,14,<br /><br />\nAll ObWhillhatairleal<br /><br />\n0<br />\nougAlitraer,ffiura ma'am&amp;la,ta.<br /><br />\nitivi,thiglia<br /><br />\nJ. MANKOWITZ, 1101 E. Baltimore Street<br />\nG. FRANK WARD<br /><br />\nCHAS. T. RYAN<br /><br />\nRYAN &amp; WARD<br />\nDesigners and Makers of<br /><br />\nMen's Clothes<br />\n16 NORTH LIBERTY STREET<br /><br />\n,<br />\n1 ::1110b<br />\n:<br />\n411/11 A<br /><br />\nAll the best dealers everywhere—<br />\nStationers, Druggists, Jewelers—<br />\nhandle the Conklin Pen or can supply you if you insist upon having it.<br />\nCosts no more than other fountain<br />\npens of hest grade. 100 styles and<br />\nsizes to select from shown in our<br />\ncatalog, furnished free upon request. Any make or style of fowltam pen repaired promptly.<br />\nTHE CONKLIN PEN CO..<br />\n514•616-61N Jefferson Av... Toledo,Olito.<br />\n11litit Pen<br />\nBole 111Prs Conklin Wolf-1,<br /><br />\nBALTIMORE, MD.<br /><br />\nUnder Brewers' Exchange<br /><br />\nBaltimore Steam Packet Company<br />\n(OLD<br /><br />\n13A1r<br /><br />\nLINE)<br /><br />\nFOR<br /><br />\nOld Point Comfort, \"Fortress Monroe,\"<br />\nNorfolk and Portsmouth<br />\nCONNECTIONS FOR ALL POINTS SOUTH<br /><br />\nTicKET<br /><br />\nOFFICES<br /><br />\n107 East Baltimore Street<br />\nBaltimore and Calvert Street<br />\n(Continental Trust Bldg.)<br /><br />\n109 North Charles Street<br />\n506 Light Street<br /><br />\nSteamers Virginia, \"New\" Alabama and Georgia leave Light Street Piers, foot of Barre, daily except<br />\nSunday, 6.30 p. m. These steamers pass in full view \"Jamestown Exposition Grounds.\"<br /><br />\nJ. R. SHERWOOD,<br />\nVice-President and General Manager<br /><br />\nE. BROWN,<br />\nGeneral Passenger Agent<br /><br />\nSecond-Hand School and College Text Books<br />\nBOUGHT and SOLD AT<br /><br />\nSETH'S BOOK STORE<br /><br />\nLEFRANC &amp; AULT<br />\nL. &amp; A. Gloves at $1.00 and $1.50<br />\nare Guaranteed.<br /><br />\n805 N, Howard Street<br />\n3rd door above Madison<br /><br />\n/r)EN-r,s tivrA'r IONIPCIRY<br /><br />\nOur Own Make of Shirts at $1.00<br />\nand $1.50<br />\nCollars in Quarter Sizes<br /><br />\nNrtistic Shop<br /><br />\nBuy Early at re<br />\nof LYCETT STATIONERS<br /><br />\n421 NORTH HOWARD STREET<br />\nNear Franklin Street<br /><br />\n317 N. CHARLES STREET<br />\nOur display of Brass Articles, Fine Leather Requisites, Art Curios<br />\nand China is unsurpassed and combine elegance with Moderate<br />\nprices.<br /><br />\nCollege and Class Stationery. Menu, Banquet and Dance Cards<br /><br />\nC. &amp; P. Phone, Mt. Vernon 3557<br /><br />\nStationer and Engraver<br />\n229 NORTH CHARLES STREET<br /><br />\nWM. A. CASLER CO.<br />\nMEN'S FURNISHINGS<br /><br />\nMAKERS OF SHIRTS<br /><br />\nNUNN &amp; COMPANY<br />\nBOOKSELLERS and STATIONERS<br />\nCarry a complete line of School Books and College<br />\nText Books,Miscellaneous, Books, Fine Stationery,<br />\nand Students' Supplies of Every Description, together with a large assortment of<br /><br />\nWATERMAN'S IDEAL FOUNTAIN PENS<br /><br />\nExclusive Designs in English and French Cloths<br />\nUnder Club Hotel<br /><br />\n224 E. BALTIMORE STREET<br /><br />\nENGRAVING<br /><br />\nPRINTING<br /><br />\n,TA.M 14:S Ii. L/C/NV:NIS<br /><br />\n227 North Howard<br />\nBINDING<br /><br />\nStreet<br />\nSTATIONERY<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES<br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBALTIMORE TO BREMEN DIRECT<br /><br />\nFor Particulars apply to A. SCHUMACHER Sr CO., General Agents, 7 South Gay Street<br /><br />\nILGENFRITZ STUDIO<br />\nSuccessor to Comm INS<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington Street<br />\nSpecial Discount to Students<br /><br />\n.<br /><br />\nMICROSCOPIC SUPPLIES<br />\nDISSECTING CASES<br /><br />\nTHE CHARLES WILLMS SURG. INST. CO.<br />\n300 NORTH HOWARD STREET<br /><br />\nBALTIMORE<br /><br />\na'IN-<br /><br />\nManufacturer of<br /><br />\nBALTIMORE, MD.<br /><br />\nBOOKS! SECOND-HAND!<br />\nSchool, Medical and Miscellaneous, Bought, Sold and Exchanged<br /><br />\nGreek Letter Fraternity Jewelery<br />\n213 NORTH LIBERTY STREET<br />\nPlease call and examine our line before purchasing<br /><br />\nN. HESS' SONS<br />\nShoes for All Occasians<br /><br />\nPIPPEN'S BOOK STORE<br />\n605 NORTH EUTAW ST.,<br /><br />\nNear the University<br /><br />\nBALTMORB'S LAROESI OLD BOOK S'i ORE<br /><br />\nChocolates<br /><br />\nBonbons<br /><br />\n$3.50 to $8.00<br /><br />\n8 Baltimore Street, East of Charles<br /><br />\n18 and 20 E. Baltimore St., Baltimore, Md.<br /><br />\nFOSNOT, WILLIAMS &amp; CO.<br />\nPRINTERS<br /><br />\nWM. J. MILLER, JEWELER<br />\n28 E. Baltimore Street<br />\nCOLLEGE JEWELRY<br /><br />\nMICROSCOPES<br />\nRUBBER GLOVES<br /><br />\n5 1 4- 1 6 WEST FRANKLIN STREET<br /><br />\nAND CLASS PINS<br /><br />\nIopkins Seal in Buttons, Brooches and Fobs<br /><br />\nThe Nows-Letter, a product of our plant<br />\n.111=01111.<br /><br />\nHENDERSON'S UNIVBEOROSKITSYTORE<br />\nMADISON AND HOWARD STS.<br /><br />\nTEWART&amp;<br /><br />\nS<br /><br />\nWOWARD.N.LEXINGTONSub.<br /><br />\nWE SHOW A COMPLETE LINE OF<br /><br />\nText Books, Note Books, Students' Supplies<br /><br />\nMEN'S STYLISH CLOTHES AND FURNISHINGS<br /><br />\nLEMMERT•<br />\nTailor<br /><br />\n•<br />\n•<br /><br />\n•<br /><br />\n•••<br />\n11<br /><br />\nDo you want to be well dressed? Try<br />\nLEMMERT on his College Clothes.<br />\nNot high in price, but way up in<br />\n.ot<br />\nJI<br />\nstyle.<br /><br />\n•<br /><br />\nAND NOT BE FOWNES<br />\nBUT THEY CAN'T BE<br /><br />\nFOWNES<br /><br />\n10 E. FAYETTE STREET<br /><br />\nI<br />\n.<br /><br />\nGLOVES MAY BE RIGHT<br /><br />\nAND NOT BE RIGHT<br /><br />\n.11.•<br /><br />\n+++-I<br /><br />\n+-I<br /><br />\n++ I<br /><br />\nWE MAKETO ORDER IN<br />\nTHE CITY . .<br />\nTHE BEST<br /><br />\n$150 SHIRT<br /><br />\nMcPHERSON'S<br />\n11<br /><br />\nEAST BALTIMORE STREET<br />\nSISCCI 13I1CIS.<br /><br />\nBANNERS<br />\nJe<br />\nFLAGS<br />\n13 WEST LEXINGTON STREET,<br /><br />\nJit<br />\n•<br /><br />\nBADGES<br />\nBALTIMORE, MD.<br /><br />\nF. C. FOSSETT &amp; SON<br />\n(I)en'o Ifurnisbinga<br />\n311 EAST BALTIMORE ST.<br />\nBaltimore, Md.<br /><br />\nTHE YOUNG MEN'S STORE<br /><br />\nSTRAUS BROS.<br />\nTAILORS<br />\nFURNISHERS<br /><br />\n2<br /><br />\nHATTERS<br />\nCLOTHIERS<br /><br />\nW. Baltimore St.<br /><br />\n20<br /><br />\nARE YOU WATCHING<br />\nTHIS SPACE?<br /><br />\nAdjoining New B. &amp; 0. Building<br /><br />\nVISITORS ARE ALWAYS WELCOME<br /><br />\nrtisers<br /><br />"}], "field_media_file": [{"target_id": 36346, "display": null, "description": null, "target_type": "file", "target_uuid": "20daf433-81cc-46b2-9dfe-771ab5528d02", "url": "http://digital.library.jhu.edu/system/files/2022-03/12314-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12314, "target_type": "node", "target_uuid": "2ccccb42-42a9-403d-8e5c-33b0ba71fa88", "url": "/node/12314"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "a3ecc7ad-b731-4417-b735-0aacd131a8c5"}]}