{"mid": [{"value": 36815}], "uuid": [{"value": "5fca4f27-0b5f-404b-bf3b-b6f5024c3650"}], "vid": [{"value": 36815}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:54:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13043-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:54:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:54:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVII. No. 29<br />\n<br />\nBALTIMORE, MD., FEBRUARY 9, 1923<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nSPECIAL RELAY MATCHES<br />\nDATE OF MT. WASHINGTONTO BE FEATURE OF<br />\nHOPKINS LACROSSE GAME<br />\nENCLOSED PLEASE FIND BALLOT ON C 0-EDUCATION<br />\nMEET<br />\nANNOUNCED<br />\nYou have read a great deal recently concerning the advantages, for and against co-eduHopkins to Meet Maryland in<br />\nJune 9th Decided Upon for Imcation at Hopkins. You must have formed so me opinion upon the proposition. If you have<br />\nSpecial Race. Joie Ray May<br />\nportant Battle. Red Eagle<br />\nno opinion on the matter, the enclosed ballot d oes not concern you. If you have, cast the<br />\nParticipate in Mile<br />\nTeam to Be Formed<br />\nballot immediately in P. 0. Box, No. 390.<br />\nWith the Johns Hopkins-Fifth<br />\nGraduate Manager Norman C.<br />\nKeyes recently announced that<br />\nRegiment games only two weeks<br />\nJune 9 has been decided upon as<br />\noff, Athletic Director Ray Van Orthe date of the annual Hopkins- LAST ASSEMBLY OF FIRST BLACK AND BLUE MERMEN BLACK AND BLUE JAY STAFF<br />\nman has arranged some extremely<br />\nSEMESTER DEVOTED TO<br />\nTO SWIM CATHOLIC U.<br />\nTO BEGIN SPRING COMMt. Washington lacrosse game. The<br />\ninteresting relays. A special feaHONOR SYSTEM<br />\nTEAM TOMORROW<br />\nPETITION<br />\ngame will take place at Homewood<br />\nField. This game, always'a hotly- Dean Latane and Pres. Sherwood Hopkins Team in Second Meet at Vacancies on Editorial and Art ture will be a triangular mile relay<br />\ncontested battle, will be one of the<br />\nAddress Student Body. MuWashington. Team Not AfStaffs. Next Issue May Be Ju- between Virginia, Princeton and<br />\nfeatures of the June week festivsical Club Concert<br />\nfected by Blacklist<br />\nNavy or Pennsylvania. Princeton<br />\nnior Prom Number<br />\nities. It should be a fitting specAt the assembly on Thursday, The Hopkins mermen are schedAt a meeting of the Black and won from Navy last year in a spetacle for the alumni who will be January 25, immediately preceding uled to meet the Catholic University Blue Jay staff, held Tuesday, Febcial match race, and should these<br />\non hand for the rest of the grad- the examinations, the history, swimming team tomorrow night in ruary 7, the Jay formulated plans<br />\nteams meet again a great race is<br />\nuation exercises.<br />\nmeaning, and operation of the hon- the Washington pool. It has been for a spring competition for canA game with the Crescent Ath- or system were explained, partic- announced that all but one mem- didates to the art and editorial predicted. Other mile relays will<br />\nletic Club had been originally ularly for the benefit of new stu- ber of the Homewood team is eli- staffs. The members of the lower be specials between Hopkins and<br />\nscheduled, but the Brooklyn organ- dents who came from schools gible for future meets, as a result classes will have a splendid oppor- Maryland, Lafayette and Lehigh,<br />\nand George Washington and Galization decided at the last minute where the honor system is not in of the examinations.<br />\ntunity at this time to gain positions<br />\nlaudet.<br />\nthat it could not make the trip. effect.<br />\nThe Black and Blue swimming on the staff. Inasmuch as the senAn effort is being made to secure<br />\nMt. Washington and the UniverDean Latane pointed out that un- season was opened with a triumph iors on the staff will resign after<br />\nJoie<br />\nRay, the star distance man of<br />\nsity of Toronto were _then consid- der the honor system the student over Swarthmore last month. Af- the publication of the next .issue,,<br />\nthe<br />\nChicago<br />\nA. C., to compete in<br />\nered and Mt. Washington finally body is responsible for the honest ter a hard struggle, Hopkins won there will be many vacancies open<br />\nthe<br />\nmile<br />\nopen.<br />\nRay, although he<br />\nconsented to play on that day.<br />\nconduct of examinations and all by a score of 38-24. The swim- to competent men. This competinever attended college, is holder of<br />\nIn view of the.fact that it is a other school work. This means ming in every race was all that tion for the staff begins with the<br />\npractically every world's championpost-season game, it is thought that that every student must not only could be desired, and the diving next issue, and all copy will have to<br />\nship record for the middle disit will not be possible to admit un- refrain from cheating himself, but was a feature event of the even- be in the Black and Blue Jay office<br />\ntances. He will be quite a drawing<br />\ndergraduates to the game on their also must not give assistance to ing. Hopkins won five firsts out by March 1. Men who show abilcard in Baltimore, and it is likely,<br />\nathletic tickets. Some arrange- others. Moreover, no matter how of six events, including the relay. ity will be appointed to the staff<br />\naccording to Van Orman, that he<br />\nments may be made with the June unpleasant the task may seem, he Welsh took the 40-yard dash in at this time. Candidates for the<br />\nwill be one of the starters at the<br />\nweek committee as to the financial must report all violations of the easy fashion; Howard and Hamble- business staff should report at the<br />\nArmory.<br />\nend of the game. It is thought, system that come to his attention. ton took first and second in the Black and Blue Jay office on MonThe entries for the championship<br />\nhowever, that it will be necessary By not doing so, he puts his stamp plunge; Dunning broke the South day, February 11, at 12:30 P. M.<br />\nof America Medley Relay are comto have an admission charge for of approval upon cheating. Dr. Atlantic record in the breast stroke, At this. meeting it was decided<br />\ning in. Georgetown and Fordham<br />\nLatane emphasized the fact that and Lord captured the 100-yard not to have regular meetings, as<br />\nstudents as well as outsiders.<br />\nare definitely running and Yale and<br />\nwas the custom, but to hold the<br />\nThe scheduling of the Mt. Wash- only student support would make swim.<br />\nPitsburgh are very likely starters.<br />\nThe same team will probably meetings of the art and editorial<br />\nington game puts the finishing it possible for the honor system to<br />\nAbout six teams are expected to toe<br />\ntouches on the lacrosse schedule. be maintained; that the spirit as represent the Black and Blue this staffs on the first and third Tues- the mark in this special event. The<br />\nday of each month. By doing this<br />\n,WelLaS the letter of the system had week.<br />\nIt has been found necessary to<br />\nleading South Atlantic and Mictdie<br />\nThe lineup is as follows:<br />\nthe number of meetings the men are<br />\neel the contest with Army at West to be obeyed. He closed by showAtlantic teams will compete in their<br />\nRelay—Welsh, Buhrer, Coady required to attend will be reduced<br />\nPoints but there are two out-of- ing that observance of the honor<br />\nrespective territorial championship<br />\nto a minimum.<br />\ntown games arranged: Stevens system helped the individual to fos- and Lord.<br />\nrelays.<br />\n100-yard Swim—Buhrer, Lord.<br />\nTech, at Hoboken, and Lehigh, at ter his own integrity, itself a valA committee consisting of ParkQuite.a few mile relays have been<br />\n220-yard Swim—Coady.<br />\nuable asset.<br />\nSouth Bethlehem.<br />\ner C. Williams, chairman; Joseph arranged,'which will attract the at50-yard Dash—Welsh and Buhr- A. Moran and Kenneth C. Watson<br />\nJohn Sherwood, president of the<br />\nThe committee named in place<br />\ntention of the high school lads.<br />\ner.<br />\nhas been appointed to arrange a Friends School, Baltimore City Colof a head coach will meet at an ear- Student Council, gave his entire<br />\nBreast Stroke—Dunning.<br />\nly date to make plans—for the com- approval to what Dean Latane had<br />\ndinner once a month for the Jay lege, Baltimore Polytechnic InstiBack Stroke—Morrell.<br />\nsaid. He repeated that it was in<br />\nstaff.<br />\ning season.<br />\ntute, McKinley High School of<br />\nPlunge—Hambleton and HowThe next issue of the Black and Washington, Central High School<br />\nA regular Red Eagle team is to the hands of the student body, not<br />\nard.<br />\nBlue Jay will appear on March 20. of Washington, and Episcopal<br />\nbe formed in addition to the Var- the Student Council, to decide<br />\nFancy Diving—Coady.<br />\nMembers of the junior class have High SchOol of Alexandria, Va.,<br />\nsity lacrosse team. It will be whether the honor system should<br />\nHopkins is expected to make a suggested that the staff make the<br />\ncoached by Sam Silberstein, one of stand or fall. Sherwood expressed<br />\nwill furnish considerable rivalry for<br />\nthe former Varsity stars. Its his opinion of what the highest goal strong bid for honors in the Mid- next number of.the Jay the \"Junior relay honors. The Maryland Cathschedule, which will be made up by of the honor system should be, and dle States Championships this year. Prom Number.\" It is believed that olic High Schools will compete in<br />\nManager H..S. Baker, a Hopkins urged that all co-operate to produce Rutgers is greatly handicapped be- this will give prominence to the a closed mile relay event.<br />\ncause of a ruling of the Middle Junior Prom, and at the same time<br />\ngraduate, will include games with the desired result.<br />\nMany entries have been received<br />\nCity, Poly, Maryland, St. John's, Don Vanneman announced that Atlantic Swimming Association, will establish it better as a tradition for ;the open events. Hopkins,<br />\nand possibly Pennsylvania. Thus, the Musical Club would give its big which prevents any man from ap- at Hopkins. Members of the jun- Georgetown, Maryland, Navy, Rutinterest will be maintained on the concert this year .at the Maryland pearing in more than two events. ior class have promised to co-oper- gers, .Cross Country Club, Washpart of those men who are unable Casualty Clubhouse on February Because of this ruling, Geibel will ate with staff in this publication, ington Canoe Club, and other col21. A dance will follow. The not be permitted to take such a and will contribute to the number. leges and clubs have entered teams.<br />\nto make the Varsity team.<br />\nprominent part in the meet as he A meeting will be held in order to<br />\nSpectators will see such stars as<br />\nManager Collins wishes to im- price of the reserved seats will be<br />\ndid<br />\nlast year, when he swam in present this matter to the class.<br />\nstueach<br />\nand<br />\na<br />\nhalf,<br />\nand<br />\ndollar<br />\na<br />\nAl Leconey, of Lafayette; Jim Conpress on the lacrosse men the imthree events and the relay.<br />\nA meeting of the business staff nolly, of Georgetown; Joie Ray, of<br />\nportance of coming-out for every dent activities card will be good for<br />\nThe remainder of the schedule and candidates will be held on<br />\nbe<br />\non<br />\nwill<br />\ntickets<br />\nticket.<br />\nThe<br />\nMon- Chicago A. C.; Clarke, of Cross<br />\nPractice, as there remains only two one<br />\nincludes a meet every week-end day at 12:30 P. M.<br />\nCountry Club; Curtis, of Navy, and<br />\nmonths until the beginning of the sale immediately after the exams.<br />\nduring March.<br />\nChamberlain, of Cross Country<br />\nschedule.<br />\nClub, in action in the different<br />\nThe team was not hit very hard<br />\nCOTILLON<br />\nCLUB<br />\nDANCE<br />\nevents.<br />\nby the examinations, only a few of<br />\nVARSITY CLUB ADMITS<br />\nThere will be an informal dance<br />\nLACROSSE MEETING<br />\nThe Black and Blue team was<br />\nthe better men being lost. The<br />\nNINE NEW MEN<br />\nin<br />\nthe<br />\nC.<br />\nE.<br />\nHall<br />\ntomorrow<br />\nFebruary<br />\n13,<br />\nafterTuesday,<br />\nOn<br />\nhit unusually hard this year by exProspects for a successful season<br />\nAt a recent meeting of the Var- noon at 4.30.<br />\nat 4.30 P. M., there will be<br />\naminations. Unfortunately, exams<br />\nare exceedingly bright, as coman organization meeting tcrbe<br />\nsity Club the following nine men<br />\ncome just at that time of the year<br />\npared with previous years.<br />\nattended by all coaches and<br />\nwere admitted to membership:<br />\nwhen track men should be doing<br />\nseveral interested alumni.<br />\nPlease pay Russian Student ReCromwell, Skinner, Slovvik, lief<br />\ntheir hardest conditioning work.<br />\nThe presence of all old and<br />\nPledges at Y. M. C. A. Office<br />\nnew players is requested.<br />\nHowever, every man on the squad<br />\nBonner, Coady, Hensel, Hardy, at once.<br />\nDR. WARMING LECTURES<br />\nis<br />\nnow training regularly. The mile<br />\nTurnbull, Murphy.<br />\nTHIS AFTERNOON<br />\nAll students desiring group<br />\nrelay<br />\nteam may have a couple of<br />\npictures are requested to<br />\nThere are still a number of letThe University will hold a lecfreshmen<br />\nin the lineup, but it will<br />\nplace their orders with Mr.<br />\nMeeting of Business Staff<br />\nter men in the university who have<br />\nture today at 5 P. M. in the audino doubt make an extremely credMeyers, the postmaster, at<br />\nand candidates of Black and<br />\nnot joined the Varsity Club. All<br />\nonce.<br />\ntorium of the Civil Engineering<br />\nitable showing and bring home the<br />\nBlue Jay Monday at 12.20.<br />\nexpected<br />\nto<br />\nthese<br />\nare<br />\nsign<br />\nup<br />\nof<br />\nof<br />\nbacon once more to Homewood.<br />\nAspects<br />\nbuilding. \"Economic<br />\nSpring competition for<br />\nThe usual South Atlantic chamat an early date.<br />\nMeeting of 1922 Football<br />\nDanish Co-operative Agriculture\"<br />\nBack and Blue Jay Editoripionship mile relay will not be on<br />\nAssistant Managers and canal Staff to begin next<br />\nA meeting of the Varsity Club<br />\nWill be the subject taken by the lecthe<br />\nprogram this year. In its place<br />\nweek. Candidates for staff<br />\ndidates for 1923 in Newswas held Friday to discuss future<br />\nturer, Dr. Jens Warming, profesreport to office any day durthe Hopkins sprint quartet will try<br />\nLetter office next Wednesday<br />\nplans of the club as well as athletic<br />\nsor of political science in the Uniing noon hour.<br />\nconclusions with Maryland. Prac12.30.<br />\nconditions at the university:<br />\nversity of Copenhagen.<br />\nContinued on page 2, col. 3<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 9, 1923<br />\n<br />\n2<br />\n<br />\nDean Williams of Medical School Y. M. C. A. ADOPTS NEW 0. D. K. NOT TO HOLD A<br />\nDANCE DURING JUNE<br />\nPLAN FOR BIBLE STUDY<br />\nMakes Annual Report<br />\nWEEK<br />\nTo take the place of the Bible<br />\nThree times as many students as<br />\nAt the last meeting of the 0. D.<br />\ncan be accommodated are seeking study discussions which have been<br />\nFOUNDED 1897.<br />\nK.,<br />\nheld at the Beta House, at 7.30<br />\nadmission to the Johns Hopkins held each Wednesday during the<br />\nMedical School, according to the year, the Y. M. C. A. has substi- P. M., on Monday, February 6, it<br />\n$2.00 annual report of Dean J. Whitridge tuted a program which they believe was definitely decided that that orSubscription<br />\nWilliams.<br />\nwill be of greater advantage to ganization would not give a dance<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\n\"Pursuant to regulations formu- those persons interested. This new during June Week.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nThe financial difficulties conlated a year previously, the num- plan will be put into operation beber of students in the incoming ginning Thursday, February 15, at fronting the 0. D. K. in respect<br />\nPublished semi-weekly ,from October to June by the students of Johns<br />\nclass was limited to 75,\" Dr. Wil- 7 P. M. Meetings will be conduct- to the publication of the Hopkins<br />\nHopkins University.<br />\nliams' report said, \"and this num- ed by the Rev. J. J. Coale, secre- Song Book have been overcome.<br />\nBusiness communications should be addressed to the BUSINESS MANThis was brought about by the loAGER,JOHNS HOPKINS UNIVERSITY; all articles and other communications ber was chosen from three times tary of the Presbyterian Federashould be sent to the MANAGING EDITOR.<br />\nthat many applicants.\"<br />\ntion, at the Methodist Protestant cation of three hundred misplaced<br />\nThe loss of the income incident Church, at St. Paul and 27th Sts., volumes at Read-Taylor Company.<br />\nHomewood 100<br />\nTelephone<br />\nA motion was passed by which<br />\nto the reduction in the number of and by Victor S. Mills, pastor of<br />\ncomstudents admitted has been<br />\nthe Grace M. E. Church, on Ed- all the students of the undergradBusiness Manager:<br />\nEditor-in-Chief:<br />\npensated for by an advance in year- mondson Ave.<br />\nuate body will be urged to give<br />\nWILLIAM H. MOORE, JR., '23.<br />\nGLOVER P. FALLON, '23.<br />\nly tuition from $250 to $300.<br />\nThese meetings will be held ev- every possible support to the MaryManaging Editor:<br />\nAdvertising Manager:<br />\nThe advisory board of the school ery Thursday during February, land-Hopkins Debate, which will<br />\nJ. HUDSON HUFFARD, '23.<br />\nDONALD K. VANNEMAN,'23.<br />\nhas decided to rescind its regula- March and April, beginning at 7<br />\nbe held in the near future.<br />\nAssistant Managing Editor:<br />\ntion, established in 1921, raising P. M., and ending at 7:45 P. M.<br />\nCirculation Manager:<br />\nJOSEPH S. LEOPOLL '24.<br />\nA member of the 0. D. K. was<br />\nthe entrance requirements in chem- sharp. At these meetings probPHILIP W. HOWARD, '25.<br />\nAssociate Editors<br />\nistry from two to three years' prep- lems, objective and personal, of a appointed to see Dean Latane and<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nManagers:<br />\nBusiness<br />\nAssistant<br />\nJR.,<br />\n'24.<br />\narrange for the reservation of one<br />\nWILLIAM G. DEAN,<br />\naration in college.<br />\nman's religious life will be disRANDOLPH NORWOOD, '24.<br />\nBERNARD C. HEARN, '23.<br />\nassembly during the year for the<br />\n\"During the course of the past cussed.<br />\nT. REESE MARSH, '24.<br />\nFITZGERALD DUNNING, '24.<br />\nWilliams<br />\nreported,<br />\n\"it<br />\nDr.<br />\nyear,\"<br />\nD. MILES MARRIAN, '25.<br />\nJunior Editors:<br />\nIt was thought that this change purpose of reading the history and<br />\nwas learned that numerous institu- in time would offer persons who traditions of the university.<br />\nRICHARD C. TILGHMAN, '25.<br />\nG. DONALD GIESKE, '25.<br />\nJOHN W. PARSONS, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\ntions of good standing either found<br />\nwish to take part in this work, a 0. D. Collins was appointed delBENJAMIN T. ROME, '25.<br />\nC. LEWIS, JR., '23<br />\nJOHN<br />\nit impossible to give such an better opportunity to indulge in its egate from the Hopkins Chapter to<br />\nW. EDWARD THOMSEN, '26.<br />\nJOHN T. DIXON, '24.<br />\nJ. ARTHUR NELSON, JR., '26.<br />\namount of work to medical stu- advantages. At the meeting held the annual National Convention of<br />\nERNEST A. STRATHMAN, '26.<br />\nA. J. McKAY, '26.<br />\ndents, or considered, if it were done, at school, various things continual- the 0. D. K. to be held at Richthat it would diminish the cultural ly came up which interfered with mond University, on February 15<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nvalue of the college course.<br />\nregular holding of the meetings, and 16. The entire chapter will,<br />\ncommuni\"Consequently,<br />\nafter<br />\nand for this purpose the time has in all likelihood, attend the convenPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ncating with the deans and profes- been changed.<br />\ntion.<br />\nsors of chemistry in many of the<br />\nThe Y. M. C. A. wishes to extend<br />\nRandolph Norwood, Business<br />\nmore important colleges and uni- to the students of the university a Manager of the Hopkins Songbook,<br />\nBALTIMORE, MD., FEBRUARY 9, 1923<br />\nversities, our regulation was re- cordial invitation to atend any or requests that all back subscriptions<br />\nscinded, and only two years' prep- all of these meetings.<br />\nbe paid up at once.<br />\naration was made obligatory, but<br />\nit was stated that three years were<br />\nMORE ABOUT CO-EDUCATION<br />\nOn the front page of this issue, we are requesting that the under- desirable, and, other things being<br />\ngraduate readers fill out an enclosed ballot expressing their stand on equal, that students presenting such<br />\npreparation would receive preferco-education.<br />\nence.\"<br />\nThe recent discussion in the editorial and Mail-bag columns.has<br />\ncaused so wide a comment upon the campus that the News-Letter is \"Radical reorganization\" of the<br />\nanxious to see just what is the opinion of the undergraduate school sub-department dealing with social<br />\nIs what every ambitious senior is<br />\nas a whole. Before signing the ballot, consider both sides of the hygiene cases was effected during<br />\nthe<br />\nWilliams<br />\nsaid.<br />\nThis<br />\nyear,<br />\nDr.<br />\nlogical<br />\nmind<br />\non<br />\nsome<br />\nyour<br />\nown<br />\nquestion and justify your stand in<br />\nthinking about at the present time.<br />\nground. Do not thoughtlessly make an \"X\" opposite \"or\" simply was brought about through a gift<br />\nLife insurance is one of the best, one<br />\nbecause you think that female companionship would be pleasant; do of $9,000 from the Inter-departmenof the most desirable, and one of the<br />\nnot in as light a frame of mind vote \"Opposed To\" because such tal Social Hygiene Board. Dr.<br />\nhas<br />\nbeen<br />\nChesney<br />\nmade<br />\nAlan<br />\nM.<br />\nmost satisfactory as a permanent<br />\ncompanionship would appear annoying.<br />\nassociate professor of medicine to<br />\nDo you believe that the attendance upon full undergraduate<br />\ncalling.<br />\ndirect research work in the study<br />\ncourses would affect the work or standards at the University in one<br />\nof social diseases, while Dr. Albert<br />\nway or another? Would competition with women stir YOU to harder<br />\nIn assets and volume of business,<br />\nKeidel will continue in charge of<br />\nstudy or would it distract you from study altogether? With a limited<br />\nlife insurance is one of the three leadthe practical work.<br />\nattendance, do you believe that the mixed student activities, that<br />\ning businesses of this country, yet the<br />\n\"Moreover,\" Dr. Williams rewould necessarily result, would be improved or weakened? Do you<br />\nported,<br />\n\"it<br />\nwas<br />\nagreed<br />\nthat<br />\nwhen<br />\nuniversities<br />\nother<br />\nfield is comparatively under-developed.<br />\nknow whether co-education has helped or hindered<br />\nGovernment's<br />\nsubvention<br />\nof Hopkins' size and character? Would the matter of tradition influ- the<br />\nOnly 7 per cent of the economic value<br />\nence you one way or another.? If Hopkins had been a mixed under- ceased, the university would conof human life in the United States is<br />\ngraduate school, would it have influenced you for or against enroll- tinue to make sufficient appropriations<br />\ncarry<br />\nthe<br />\nwork<br />\nto<br />\nforward.<br />\ncovered by insurance. This gives an<br />\ning? Finally, overlooking the effect upon your person, do you believe<br />\nthat co-education would be better for the Johns Hopkins University? This represents a great advance,<br />\nidea of the big field still to be worked,<br />\nand it is confidently expected that<br />\nConsider these questions as fully as possible and check off your<br />\nespecially business insurance for firms<br />\nit will result in fruitful developdecision upon the ballot.<br />\nment in that important subject.\"<br />\nand corporations.<br />\nWe take this test vote in fear that we may have done an injusPlans<br />\nfor<br />\nestablishment<br />\nthe<br />\nof<br />\na<br />\ntice to the female students who recently expressed a desire to become<br />\nAs to remuneration: Reports of<br />\nresearch department in physics in<br />\n\"of us.\" The results will be turned over to some faculty member for<br />\nthe<br />\nMedical<br />\nSchool<br />\nwere<br />\napproved,<br />\ncollege graduates who have entered<br />\ncounting so that all care may be exercised toward fairness. If, after<br />\nDr. Williams said, and an effort<br />\nrepresent<br />\nthe<br />\nnot<br />\ntruly<br />\neditorial<br />\nstaff<br />\ndid<br />\nthat<br />\nour<br />\nfind<br />\ncount,<br />\nwe<br />\na<br />\nbusiness indicate that life insurance is<br />\nsentiment of the undergraduate body, we will most extravagantly made to start the department. Howat the very top as a source of income.<br />\never, the ;establishment has been<br />\napologize.<br />\ndelayed through inability to secure<br />\nNow is the time for you to consider<br />\nthe services of a scientist especialwhat you are going to do after graduly desired for the conduct of the<br />\nTHE GREATEST MAN<br />\nation. If you are ambitious and willdepartment, so the matter is being<br />\nIt is perfectly possible that our staff may, at times, hold an opin- held in abeyance.<br />\ning to work hard and are interested<br />\nion different from the majority of our fellow-students. Twenty men,<br />\nto know about life insurance, address<br />\nthe usual size of our entire staff, should be a large enough number to<br />\nrepresent University opinion, yet at times that body might be influ- RELAY MATCHES TO FEATURE<br />\nenced by one of their number who is of a strong mind.<br />\nAgency Department<br />\nMEET<br />\noutsider<br />\ninto<br />\nholidays,<br />\nan<br />\ndrifted<br />\nChristmas<br />\nthe<br />\nContinued<br />\nbefore<br />\nthe<br />\nfrom<br />\npage<br />\n1.<br />\nJust<br />\nNews-Letter office and asked,\"Who is the greatest living man in the tice is being held daily at 4:30 at<br />\nworld?\" After the usual humorous response, serious opinions were the Fifth Regiment Armory. It is<br />\nexpressed and Woodrow Wilson was declared the \"greatest living not yet too late to get in trim for<br />\nM T AL<br />\nman\" by an overwhelming majority.<br />\nthe sport classic on February 24th.<br />\nLIFE INSURANCE COMPANY<br />\nOF BOSTON. MASSACHUSETTS<br />\nIf the same question had been put up to a large body there would Every man with latent or occult<br />\nand,<br />\nalthough<br />\nanswers,<br />\nit<br />\nis<br />\nvery<br />\nof<br />\nvariety<br />\ngreater<br />\nfar<br />\na<br />\nbeen<br />\nLargest Fiduciary Institution in New England<br />\nhave<br />\ntrack ability should report to Manpossible that the same result would have been indicated, the ma- ager Kirwan without fail at the<br />\njority would have been nowhere near so overwhelming.<br />\nearliest. opportunity. No equipment is necessary.<br />\nStill, we do our best!<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\n••••IIIIIIII••11111111111111111111111111<br />\n<br />\nTheBestBusinessCareer<br />\n<br />\n•<br />\n•<br />\n<br />\n•<br />\n•<br />\n•<br />\n•<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 9, 1923<br />\nA<br />\n<br />\nD.<br />\n.30<br />\nIt<br />\n)rice<br />\n<br />\n)nect<br />\nins<br />\nne.<br />\nlo:ed<br />\nfly.<br />\nich<br />\n<br />\nive<br />\nry7ill<br />\n<br />\nA. S. C. E. MAKING PLANS<br />\nFOR NEXT MEETING<br />\nThe Hopkins Student Chapter<br />\nof the American Society of Civil<br />\nEngineers is laying elaborate plans<br />\nfor its next meeting and smoker,<br />\nwhich will be held during the latter part of this month. A committee, consisting of Walter H. Sommerville, '23, chairman; Ed Watson, '24, and Benj. Rome, '25, were<br />\nappointed by President Wills to obtain a speaker and to provide entertainment and refreshments for<br />\nthe smoker. The last affair of the<br />\nsociety, held a few weeks ago, was<br />\ndeclared by all present to be one<br />\nof the best ever given by the organization.<br />\nThe emblems of the society, consisting of a maroon shield engraved<br />\nin gold on a circular white background, which were originally in-<br />\n<br />\ntended to have been distributed at RIFLE TEAM ENTERS FIRST<br />\nSTAGE OF INTERCOLthe last meeting, have just been reLEGIATES<br />\nceived and are being well-received<br />\non the campus.<br />\nThe Johns Hopkins Rifle Team<br />\ndid not meet Yale during the week<br />\nCOADY?<br />\nending- January 26, and, conseFootball Recruit—I'm a little quently, did not defeat Yale's team<br />\nstiff from bowling.<br />\nas it has been reported. During<br />\nCoach—I don't care where you're the present week, a five-man team<br />\nfrom. Get on your duds and go to is competing in the first stage of<br />\nwork.—Judge.<br />\nthe intercollegiate matches. Whatever score the team makes will be<br />\nCo-ed (angrily)—I should think<br />\ncounted as the score against<br />\nyou'd be ashamed to look me in<br />\nGeorgetown, with whom we have a<br />\nthe face or speak to me on the<br />\nmatch this week. The shooting<br />\nstreet.<br />\nwill be done from the prone and<br />\nHe—I am kinda, but I've got to<br />\nstanding positions.<br />\nbe courteous.—Purple Cow.<br />\n<br />\n3<br />\n<br />\nThe \"COLLEGIAN\"<br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br />\n<br />\n.50<br />\n4up<br />\n<br />\nWARNER /<br />\nc1<br />\n4 COMPANY<br />\nHATTERS<br />\n222 W. BALTIMORE ST.<br />\n<br />\nYou collegians who stroll along the campus will<br />\nbe among the first to sense the coming of Spring.<br />\nDoesn't that suggest something to you in the<br />\nmatter of clothes?<br />\nGo in for Stein-Bloch and Goodman and Suss<br />\nSuits if you want to know college style at its best.<br />\n<br />\n\"When I marry, I'm going to<br />\nTHEN WHO WAS IT?<br />\nmarry a girl who can take a joke.\" \"If I had known that tunnel was<br />\n\"Don't worry, little boy, it's the so long, I would have kissed you.\"<br />\n\"Good heavens, wasn't that you ?\"<br />\nonly kind you'll get.\"—The Bean—Voo Doo.<br />\npot.<br />\n<br />\nelaaelian-ducie4N Y-400- 4(Y. M. B. 0. D.)<br />\n<br />\nTas<br />\nnd<br />\n)ne<br />\n:he<br />\nnd<br />\n<br />\nelto<br />\nof<br />\n:h15<br />\n<br />\noliPlcwaSiPZZIP7.71PG.S..3'<br />\n.<br />\n<br />\nBaltimore and Hanover<br />\n<br />\nFOR THE THIRD CONSECUTIVE YEAR<br />\n<br />\n•<br />\n<br />\nONLY THE DIAL<br />\n<br />\nURNER'S<br />\n1,1<br />\n•<br />\n<br />\namong America's leading magazines<br />\nhas been awarded the rating of<br />\n<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\n<br />\n!n-<br />\n<br />\n\"The Wonder Motor Fuel\"<br />\n<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\n<br />\n100%<br />\n<br />\n2SS<br />\n<br />\nBALTIMORE<br />\n<br />\n)k,<br />\n<br />\nns<br />\n<br />\nWinter Weather Does Not<br />\nLessen Efficiency of<br />\n<br />\nfor the short stories of distinction it has published. Edward J. O'Brien,<br />\nthe American authority on the short story, in his annual review of American magazine fiction recently published in the Boston Transcript, again<br />\nrated THE DIAL above every other maRATING BY PERCENTAGE OF<br />\ngazine in America for the percentage of<br />\nDISTINCTIVE STORIES<br />\nPer Cent Average<br />\npubliit<br />\nhas<br />\ndistinction<br />\nstories<br />\nof<br />\nshort<br />\n1922-1921-1920 3 years<br />\nyear.<br />\nshed during the past<br />\n1 THE DIAL 100 100 100 100<br />\n2 World Fiction<br />\n(Aug.-Sept.)<br />\n3 Century<br />\n4 Asia<br />\n5 Harper's<br />\nMagazine<br />\n6 Atlantic<br />\nMonthly<br />\n7 Broom<br />\n8 Scribner's<br />\nMagazine<br />\n9 Pictorial<br />\nReview<br />\n10 Double Dealer<br />\n11 Smart Set<br />\n12 Hearst's<br />\nInternational<br />\n13 McClure's<br />\nMagazine<br />\n14 Delineator<br />\n15 Red Book<br />\nMagazine<br />\n16 Metropolitan<br />\n17 Ladies' Home<br />\nJournal<br />\n18 Collier's<br />\nWeekly<br />\n<br />\nEvery year Mr 'O'Brien makes a survey of the<br />\nfiction published by American magazines, and<br />\nhis appraisal is generally accepted as authoritative by students of literature. The best of<br />\nthe stories selected by Mr O'Brien are annually<br />\nrepublished in book form.<br />\n<br />\nTHE DIAL was first awarded the rating of 100%<br />\nin 1920, at the end of its first year as a magazine of art and letters. Again in 1921 THE DIAL<br />\nheaded Mr O'Brien's list, and now in 1922,<br />\nfor the third consecutive year, THE DIAL has<br />\nachieved the highest rating in Mr O'Brien's<br />\nclassification.<br />\nThis record is particularly significant in view<br />\nof the fact that Mr O'Brien selects for his percentage ratings only stories of unusual merit<br />\nand distinction. THE DIAL'S record of 100%<br />\nmeans, therefore, that since 1920 it has not<br />\npublished a single mediocre story.<br />\n<br />\n95<br />\n93<br />\n90<br />\n89<br />\n<br />\nTO<br />\n90<br />\n74<br />\n<br />\n734<br />\n<br />\n83<br />\n<br />\n—<br />\n75<br />\n<br />\n80<br />\n<br />\n88<br />\n87<br />\n<br />\n65<br />\n<br />\n95<br />\n<br />\n83<br />\n<br />\n71<br />\n<br />\n52<br />\n<br />\n72<br />\n<br />\n65<br />\n<br />\n65 71<br />\n57 —<br />\n35 25<br />\n<br />\n65<br />\n40<br />\n<br />\n68<br />\n—<br />\n34<br />\n<br />\n29<br />\n<br />\n23<br />\n<br />\n28<br />\n28<br />\n<br />\n18<br />\n—<br />\n<br />\n45<br />\n<br />\n31<br />\n<br />\n24<br />\n19<br />\n<br />\n20 15<br />\n24 26<br />\n<br />\n20<br />\n23<br />\n<br />\n19<br />\n<br />\n15<br />\n<br />\n_<br />\n<br />\n17<br />\n<br />\n15<br />\n<br />\n25<br />\n<br />\n•<br />\n<br />\nti<br />\n<br />\n•<br />\n•<br />\n<br />\n14<br />\nN<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\nOur business is one which calls for an investment consisting of time and effort.<br />\nIt is the largest, most profitable business in the world. We are going to invest<br />\nour time in order to train a selected class of students so that they will b t able to<br />\nconvert their spare time into money.<br />\nThis course will be free of any cost to the students selected. It will be arranged<br />\nso as not to conflict with other work and studies. The successful student will<br />\nfind himself equipped to enjoy a clean, profitable vocation during the spring<br />\nand summer months. Then, too, every effort expended during your spare time<br />\nand the summer months will multiply and form the nucleus of your income in<br />\nthe future.<br />\n<br />\n1031 CALVERT BUILDING<br />\nBALTIMORE, MD.<br />\n<br />\nCHANTILLY<br />\nRestaurant Francais<br />\n518 N. CHARLES STREET,BALTIMORE<br />\nOrchestra—Dancing<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M.<br />\nTABLE D'HOTE<br />\nDINNER—$1.00<br />\nLUNCHEON-60c<br />\nSUNDAY D1NNER—$1.25<br />\n<br />\nTelephone, Vernon 3442<br />\n<br />\n4.00<br />\n<br />\nThe regular annual subscription rate of THE DIAL is $5 00. Our special rate of<br />\n$4.00 is made to students and faculty only if they subscribe through one of our<br />\ncampus representatives, several of whom are now taking subscriptions for THE<br />\nDIAL. Our representatives are all students who are earning part of their expenses<br />\nby taking subscriptions to THE DIAL. THE DIAL is allowing its representatives<br />\na liberal commission on each subscription. Subscriptions may be placed with the<br />\nBusiness Manager of your paper. In all such cases, the usual commission will be<br />\nallowed, and will be apportioned by the Business Manager among our campus representatives.<br />\n<br />\n-11S7<br />\n1411•<br />\n<br />\nDRAPERIES<br />\n<br />\nIf you live in the State of Maryland and are 18 years of age or over, write for<br />\ninterview, giving your telephone number.<br />\n<br />\nPA<br />\n<br />\nand Faculty Offer---------•<br />\n•<br />\n<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\nTURN YOUR SPARE TIME<br />\nINTO DOLLARS<br />\n<br />\n19<br />\n<br />\nwhose latest novel will be published in the spring issues of THE DIAL.<br />\n<br />\n•<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nGerhart Hauptmann<br />\nTHE DIAL for one year<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nThis record becomes all the more remarkable when it is realized that THE<br />\nDIAL is not exclusively a fiction magazine. Short stories form but a part<br />\nof the material in each issue. The poetry, essays, criticism, and reproductions of the fine arts published by THE DIAL are equally distinctive. The<br />\neditorial policy of THE DIAL is directed towards achieving distinction in<br />\nall lines. THE DIAL'S better known contributors include the most distinguished writers of Europe and America. A new name will shortly be<br />\nadded to this notable list of contributors—<br />\n<br />\n-- -Special Student<br />\n<br />\nA Quick, Sure Start!<br />\nSHERWOOD BROTHERS, INC.<br />\n<br />\nlic\"k411 •111 71 4bc—lbc\"4P..1V-%<br />\nArn.<br />\n<br />\n•<br />\ni4<br />\n\\j<br />\nI.<br />\n<br />\nRADIO!!<br />\nYOU WILL FIND OUR STOCK OF STANDARD MAKE SETS<br />\nAND APPARATUS WILL MEET YOUR EVERY NEED<br />\nCOMPLETE VACUUM TUBE RECEIVERS, $39.95 UP<br />\n<br />\nCO.<br />\nRADIO SUPPLY<br />\nCHARLES ST.<br />\n1724 N.<br />\n<br />\nVernon 3055<br />\n<br />\n10 Minutes from Hopkins<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 9, 1923<br />\n<br />\nDRAMATIC CLUB MAKES DR.DIXON DELIVERS SERMON ON SIDNEY LACHANGES IN CONSTITUNIER ON BIRTHDAY<br />\nMEETING<br />\nTION AT<br />\nThe Greetings of a Fine Store<br />\nDr. A. C. Dixon, of University<br />\nMerit Clause Amended. Coach<br />\nNow In Its<br />\nBaptist Church, had as the subject<br />\nSelects Tentative Cast. Club<br />\nTo the Students of a Fine University<br />\nof his morning sermon on February<br />\nto Present Burlesque<br />\nEIGHTH WEEK<br />\nAt the last meeting of the Dra- 4th, \"Sidney Lanier, the Bard of<br />\nJohns Hopkins, and His Crystal<br />\nANNE NICHOLS' LAUGHING<br />\nmatic Club, a . radical change was<br />\nChrist.\" Sidney Lanier's birthday<br />\nSUCCESS<br />\nmade in the constitution. It was<br />\nwas celebrated on Saturday, Fehmoved that, \"It is our intention to ruary 3, and Dr. Dixon took this<br />\ninterpret the special merit clause of opportunity to stress the life and<br />\nthe constitution to make eligible for work of this poet, whose name is<br />\nelection to the club, men who suc- so closely associated with that of<br />\nPRESCRIPTION DRUGGISTS<br />\nthis university.<br />\ncessfully understudy the principal<br />\nTWO STORES:<br />\nDr. Dixon considered Lanier as<br />\nparts of a main production.\"<br />\na man, a musician, a poet, a teachEutaw Place and North Ave.<br />\nCharles and Chase Sts.<br />\nThis step was taken only after er, and a Christian. As a man he<br />\nVernon 0890<br />\nMadison 0405<br />\nmuch discussion and due consider- was always winsome, kind and lovation. The club will realize several able. He was not embittered by<br />\nTHE PLAY THAT PUT<br />\nft<br />\nadvantages as a result of this move: the ravages of poverty and disease<br />\n41<br />\nU IN HUMOR<br />\nof February 12, 1923<br />\nto<br />\nfor<br />\nthe<br />\nWeek<br />\nwhich<br />\nhe<br />\nwas<br />\nsubject<br />\n41<br />\nan increase in membership, with<br />\n41<br />\nALL HEADLINE BILL<br />\ngreater part of his life, and had<br />\n41<br />\nconsequently more members being<br />\nnothing but good words for his felThe Maryland's Most Popular Star<br />\n0<br />\nFACULTY PLANS RESEARCH<br />\nleft in the club at the end of the lowmen.<br />\nAileen Stanley<br />\n\"THE PHONOGRAPH GIRL\"<br />\nOver one hundred years 41<br />\nIN HISTORY OF IDEAS<br />\nyear; and interest will be stimuAs a musician he was pre-emi> of designing and creating 4141<br />\nBy Popular Demand<br />\nPlans have been made to establated in the productions, on the nent. At the age of seven he had<br />\nSilverware assures the pur- 41<br />\nSouthland Entertainers<br />\n41<br />\nlish<br />\namong<br />\nthe<br />\nmembers<br />\nof<br />\nthe<br />\nchaser<br />\nof Kirk pieces in 41<br />\nfrom.<br />\na<br />\nriver<br />\nbank<br />\nand<br />\ncut<br />\na<br />\nreed<br />\npart of those making a cast in order<br />\n41<br />\nGeorgie Moran & Mack Charles<br />\nsilver absolute certainty of 41<br />\nThrough Johns Hopkins faculty a club which<br />\nTwo Black Crows<br />\nto remain there, and on the part had made his first flute.<br />\n4<br />\n41<br />\n4 superiority.<br />\nhis astounding 'ability he .early shall have as its principal purpose<br />\n41<br />\nGeorge Choos Presents<br />\n4/<br />\nof those who are understudying.<br />\ngained a place in the Peabody Or- the investigation of the \"history of<br />\n41<br />\n• Frank Sinclair & Cliff Hess<br />\n41<br />\nMr. Swindell, the coach, has se- chestra of Baltimore, and was one<br />\nIN<br />\nideas\" in literature and philosophy.<br />\n\"The Little Cottage\"<br />\n41<br />\nlected a tentative cast for \"The of the leading attractions of that<br />\n4<br />\nIntroducing Ethel Russel, Marie Saxon 4<br />\n41<br />\nDr.<br />\nArthur<br />\n0.<br />\nLovejoy,<br />\nprofesseveral<br />\n41<br />\nand Kathalene Morris. Literary construcPurple Mask.\" It includes at least body for many years. By<br />\n4/<br />\ntion by Danl MacBoyle. Music by Walter<br />\nsor of philosophy, who has just L. Rosemont,<br />\n41<br />\ntwo names for every important reliable critics he was acclaimed the<br />\n0<br />\n41<br />\n41<br />\n41<br />\nrole. This is expected to cause a most accomplished living flutist in returned to Hopkins after a sixB. C. Hilliam<br />\n40<br />\n41<br />\nof \"Buddies\" and other Broad- 41<br />\n41<br />\nBaltimore, Md.<br />\nmonths' leave of absence, is given Composer<br />\nmore perfect attendance at rehear- the world.<br />\n4<br />\nway Successes in \"ORIGINALITIES\"<br />\n41<br />\n41<br />\nInterrupted<br />\nby Jim Kilpatrick<br />\n4/<br />\nactuated<br />\nby<br />\nthe<br />\nAs<br />\na<br />\npoet<br />\nhe<br />\nwas<br />\nmore<br />\ninterest.<br />\ndeal<br />\ngreat<br />\nsals and a<br />\n41<br />\nthe credit for forming the club<br />\nOldest Silversmiths in America 41<br />\nGus Fowler<br />\nThe competition will thus increase highest of ideals, and refused to Professor Lovejoy spent the sum0<br />\n0<br />\nthe effort on the part of the candi- lower them, though he could have mer abroad and<br />\nHerbert Clifton<br />\nEstablished in 1 8 1 7<br />\non his return in<br />\n41<br />\nby<br />\nso<br />\ndogreater<br />\npopularity<br />\ngained<br />\n4<br />\ndates to do their best.<br />\n41<br />\nOctober went to the University of<br />\nThe Follies Girls<br />\ning.<br />\nHe<br />\nwas<br />\na<br />\ngreat<br />\npoet<br />\nand<br />\nknew<br />\nRehearsals are being held five<br />\nKIMMCieMCK-Taeve^<br />\nBill, Genevieve & Walter<br />\ntimes a week, for there are only it. Everything with which he came California as visiting lecturer in<br />\nSHOES<br />\nfive weeks left until the presenta- into contact furnished sufficient ma- philosophy.<br />\nfor<br />\ntion of the play; and all are work- terial for many poems, so that his<br />\nIn the near future the faculty<br />\nUNIVERSITY MEN<br />\ning hard in order to make this the head and soul were always over- members will be invited by Dr.<br />\nwith<br />\nyet<br />\nunwritten<br />\nverse.<br />\nflowing<br />\nNEXT WEEK<br />\nmost successful production ever<br />\nFor Dress<br />\nFor Sport,Wear<br />\nUnfortunately, much of this poetry James Wilson Bright, head of the Matinees Wednesday & Saturday<br />\ngiven.<br />\ndepartment of English, to organSmart Styles—Best Leathers<br />\nOwing tc, inability to get the was never to be written, for, in letThe Supreme Theatrical Event of<br />\nframe<br />\nconfessed<br />\nize,<br />\na<br />\nconstitution,<br />\nelect<br />\nofhis<br />\nfriends,<br />\nhe<br />\nters<br />\nto<br />\nModerate Pricer;<br />\nscenery into the Dramatic Club<br />\nthe Season<br />\nStudio, the club has had great dif- that, because of his poverty, he of- ficers, and determine a program.<br />\nThe Selwyns Present<br />\nficulty in obtaining a place for stor- ten had not the strength to put pen The club will be called the History<br />\ning and painting its scenery this to paper. With all this misery, of Ideas Club.<br />\n19 W. LEXINGTON ST.<br />\nyear. As the Homewood Playshop however, he retained his indomitIt<br />\nhad<br />\nbeen<br />\nproposed<br />\nto<br />\nestabhas taken over the old gym, behind able optimism.<br />\nPrinters of the<br />\nlish the club last spring, and the<br />\nAs a teacher he was also of the<br />\nthe Hopkins Club House, the club<br />\nJohns Hopkins News-Letter<br />\nin<br />\nhad to look elsewhere for a suit- first rank, and through his wide promoters held one preliminary<br />\nmeeting,<br />\nbut<br />\non<br />\na<br />\naccount<br />\nof<br />\nacquired<br />\npressremarkably<br />\nreading<br />\nable place. The paint shop, in the<br />\nrear of the Botanical Gardens, was broad vision. Lanier declared that ure of other activities the plan<br />\nthe only place obtainable. This Poe 'did pot know enough to be a was postponed until the return of<br />\nW. Somerset Maugham's Modern<br />\nshop is highly inadequate and at good poet, and, setting out to qual- Professor Lovejoy from CaliforComedy Triumph<br />\npresent it isn't certain as to its be- ify himself in his chosen field of ennia.<br />\nWith<br />\nAll-Star Cast<br />\nProfessor Bright was made<br />\ndeavor, he spent years in reading<br />\ning satisfactory.<br />\nErnest Lawfofd<br />\nClara Moores<br />\nThe club will welcome as candi- the literature of all ages, also delv- chairman of that meeting, 'with Dr. Jerome Patrick<br />\nLionel Glenister<br />\ndates for membership any men who ing to some extent in the sciences. H. Carrington Lancaster, head of<br />\nare interested in the art and prop- He accepted readily the basic part the.department of French, as sec- 'Due of the ten best plays of the<br />\nyear.''—Pulitzer Decision.<br />\nerty sections of dramatics, as these of the theory of evolution, but re- retary.<br />\ndepartments will be left vacant by jected the theory that one species<br />\nAlthough the study of the history<br />\ncould ever develop from another. of<br />\ngraduations this year.<br />\n0<br />\nliterary and philosophic ideas is<br />\nI<br />\nDuring June Week the club will<br />\nFinally, as a Christian, he was not a new thing, it is believed that<br />\nNext Week<br />\npresent a burlesque in the form of one of the best members that the Hopkins will be unique in the esCollege Literature<br />\nPurple<br />\na musical comedy, on \"The<br />\nChurch has ever known. He found tablishment of a special club of this Matines Wednesday & Saturday<br />\nLOMBARD and SOUTH S7RIL7S<br />\nMask.\" The title has not been de- a sense of God in everything, es- sort. The members of<br />\nthe club will<br />\ncided upon as yet, but it is expect- pecially in music, which, he said, engage in research ,to trace<br />\nDirect from Here to N. Y.!<br />\nthe<br />\ned that it will be very similar to would be the church of the future, course of philosophic<br />\nHarvard Considering Intramural<br />\nthought re\"The Purple Flask.\"<br />\nin which all creeds would unite. garding problems which have preContests<br />\nDebating teams of Harvard will<br />\nReligion permeated his whole life, sented themselves in the evolution The George W. Lederer Musical<br />\nargue the question, \"Resolved,<br />\nand faith in God was the basis for of human knowledge.<br />\nHit<br />\nThat Harvard should limit interNEWSPAPER SCOOP IS<br />\nall his achievements. Educated in<br />\ncollegiate football games to one conPREMATURE<br />\na Southern Presbyterian atmotest with Yale, supplementing this<br />\nRecently there was a great deal sphere, he grew to desire above all Baltimore, because of the art, muwith the Oxford system of intrawalk<br />\nin<br />\nthe<br />\nways<br />\nof<br />\nGod.<br />\nelse<br />\nto<br />\nsic, and religion which flourished<br />\nof gossip current to the effect that<br />\nmural<br />\ncontests.\" Harvard students<br />\ngreatest<br />\none<br />\nof<br />\nhis<br />\npoems<br />\nin<br />\nhere.<br />\nplans were being made for rush- It was<br />\nsay<br />\nthey<br />\nare serious about the propIncludes<br />\nCast<br />\nExtraordinary<br />\ning through the building of a gym- —\"Crystal\"—that he found someOne of the last persons Lanier The<br />\nosition.<br />\nnasium in time for spring training. thing to forgive in all of the great- saw before he left Baltimore was Ada Mae Weeks<br />\nFred Heider<br />\nThe daily newspapers heard of the est men which the world has ever Dr. Gilman, then - president of the Stella Mayhew<br />\nTyler Brooks<br />\nBan on Knickers<br />\nstory and sent out representatives known, whereas he found nothing Johns Hopkins University. He<br />\nMarguerite Zender<br />\nDean Florence Purrington, of<br />\nto take in this big scoop. Dr. Ron- to forgive in Jesus, his \"Crystal spent his last days in the North<br />\nStanley Forde<br />\nMt. Holyoke College, recently ruled<br />\nald T. Abercrombie, director of Christ.\" Carolina Mountains, and, from his<br />\nSee Peaches and Scream!<br />\nthat \"knickers\" must not be worn<br />\nPhysical Education, however, when<br />\nLanier's ideal in art was purity, deathbed, dictated to his wife his<br />\nin the college classroom. Many of<br />\ninterviewed yesterday afternoon absolute purity, and he declined to last and possibly his greatest poem<br />\n1st Barber—Why were you so the students had been ,wearing<br />\nsaid that the rumor was entirely agree with Walt Whitman's theory —\"Sunrise\"—in which his eternal<br />\n\"knickers\" throughout the day.<br />\nunfounded. \"I have had the plans that whatever was natural was optimism shines forth like a jewel. late?<br />\nThe college authorities do not enfor the gymnasium ready for the good. He continued to admire<br />\nSidney Lanier will always retain<br />\n2nd Barber—I was shaving my- tirely condemn the wearing of<br />\nthe<br />\nlast twenty years,\" he said, \"but we Whitman for his talent, but could a place in the esteem of the faculty<br />\nI'd<br />\nuntil<br />\naway<br />\ncouldn't<br />\nget<br />\nand<br />\nself<br />\nknickerbockers<br />\nby<br />\nwomen,<br />\nbut<br />\nconfor<br />\nsome public- never be reconciled to him as an and students of this university for<br />\nare still waiting<br />\nspirited Hopkins alumnus to die artist. It is striking to note that his \"Ode to Hopkins,\" one of his talked myself into a haircut and a sider them inappropriate as classroom costumes.<br />\nshampoo.—Royal Gaboon.<br />\nand leave us the wherewithal.\"<br />\nLanier always retained a love for best compositions.<br />\n<br />\nAcademy of Music<br />\n<br />\nA<br />\n<br />\nHOCESCHILD,KOHN 8,c Co.<br />\n<br />\nABIE<br />\nIRISH<br />\nROSE<br />\n<br />\nFlynson, Westcott and Dunning<br />\n<br />\nMARYLAND THEATRE<br />\n<br />\nQuality<br />\n<br />\nSamuelKirk<br />\nand Son Co.<br />\n<br />\nAUDITORIUM<br />\n<br />\nJohn Drew<br />\nMrs. Leslie Carter<br />\n\"The Circle\"<br />\n<br />\nFOR<br />\n<br />\n\"PEACHES\"<br />\n<br />\nWYMAN<br />\n<br />\nti<br />\n<br />\nat<br />\nfc<br />\nti<br />\n<br />\nfi<br />\na]<br />\n<br />\nti<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVII. No. 29<br /><br />\nBALTIMORE, MD., FEBRUARY 9, 1923<br /><br />\nPRICE 5 CENTS<br /><br />\nSPECIAL RELAY MATCHES<br />\nDATE OF MT. WASHINGTONTO BE FEATURE OF<br />\nHOPKINS LACROSSE GAME<br />\nENCLOSED PLEASE FIND BALLOT ON C 0-EDUCATION<br />\nMEET<br />\nANNOUNCED<br />\nYou have read a great deal recently concerning the advantages, for and against co-eduHopkins to Meet Maryland in<br />\nJune 9th Decided Upon for Imcation at Hopkins. You must have formed so me opinion upon the proposition. If you have<br />\nSpecial Race. Joie Ray May<br />\nportant Battle. Red Eagle<br />\nno opinion on the matter, the enclosed ballot d oes not concern you. If you have, cast the<br />\nParticipate in Mile<br />\nTeam to Be Formed<br />\nballot immediately in P. 0. Box, No. 390.<br />\nWith the Johns Hopkins-Fifth<br />\nGraduate Manager Norman C.<br />\nKeyes recently announced that<br />\nRegiment games only two weeks<br />\nJune 9 has been decided upon as<br />\noff, Athletic Director Ray Van Orthe date of the annual Hopkins- LAST ASSEMBLY OF FIRST BLACK AND BLUE MERMEN BLACK AND BLUE JAY STAFF<br />\nman has arranged some extremely<br />\nSEMESTER DEVOTED TO<br />\nTO SWIM CATHOLIC U.<br />\nTO BEGIN SPRING COMMt. Washington lacrosse game. The<br />\ninteresting relays. A special feaHONOR SYSTEM<br />\nTEAM TOMORROW<br />\nPETITION<br />\ngame will take place at Homewood<br />\nField. This game, always'a hotly- Dean Latane and Pres. Sherwood Hopkins Team in Second Meet at Vacancies on Editorial and Art ture will be a triangular mile relay<br />\ncontested battle, will be one of the<br />\nAddress Student Body. MuWashington. Team Not AfStaffs. Next Issue May Be Ju- between Virginia, Princeton and<br />\nfeatures of the June week festivsical Club Concert<br />\nfected by Blacklist<br />\nNavy or Pennsylvania. Princeton<br />\nnior Prom Number<br />\nities. It should be a fitting specAt the assembly on Thursday, The Hopkins mermen are schedAt a meeting of the Black and won from Navy last year in a spetacle for the alumni who will be January 25, immediately preceding uled to meet the Catholic University Blue Jay staff, held Tuesday, Febcial match race, and should these<br />\non hand for the rest of the grad- the examinations, the history, swimming team tomorrow night in ruary 7, the Jay formulated plans<br />\nteams meet again a great race is<br />\nuation exercises.<br />\nmeaning, and operation of the hon- the Washington pool. It has been for a spring competition for canA game with the Crescent Ath- or system were explained, partic- announced that all but one mem- didates to the art and editorial predicted. Other mile relays will<br />\nletic Club had been originally ularly for the benefit of new stu- ber of the Homewood team is eli- staffs. The members of the lower be specials between Hopkins and<br />\nscheduled, but the Brooklyn organ- dents who came from schools gible for future meets, as a result classes will have a splendid oppor- Maryland, Lafayette and Lehigh,<br />\nand George Washington and Galization decided at the last minute where the honor system is not in of the examinations.<br />\ntunity at this time to gain positions<br />\nlaudet.<br />\nthat it could not make the trip. effect.<br />\nThe Black and Blue swimming on the staff. Inasmuch as the senAn effort is being made to secure<br />\nMt. Washington and the UniverDean Latane pointed out that un- season was opened with a triumph iors on the staff will resign after<br />\nJoie<br />\nRay, the star distance man of<br />\nsity of Toronto were _then consid- der the honor system the student over Swarthmore last month. Af- the publication of the next .issue,,<br />\nthe<br />\nChicago<br />\nA. C., to compete in<br />\nered and Mt. Washington finally body is responsible for the honest ter a hard struggle, Hopkins won there will be many vacancies open<br />\nthe<br />\nmile<br />\nopen.<br />\nRay, although he<br />\nconsented to play on that day.<br />\nconduct of examinations and all by a score of 38-24. The swim- to competent men. This competinever attended college, is holder of<br />\nIn view of the.fact that it is a other school work. This means ming in every race was all that tion for the staff begins with the<br />\npractically every world's championpost-season game, it is thought that that every student must not only could be desired, and the diving next issue, and all copy will have to<br />\nship record for the middle disit will not be possible to admit un- refrain from cheating himself, but was a feature event of the even- be in the Black and Blue Jay office<br />\ntances. He will be quite a drawing<br />\ndergraduates to the game on their also must not give assistance to ing. Hopkins won five firsts out by March 1. Men who show abilcard in Baltimore, and it is likely,<br />\nathletic tickets. Some arrange- others. Moreover, no matter how of six events, including the relay. ity will be appointed to the staff<br />\naccording to Van Orman, that he<br />\nments may be made with the June unpleasant the task may seem, he Welsh took the 40-yard dash in at this time. Candidates for the<br />\nwill be one of the starters at the<br />\nweek committee as to the financial must report all violations of the easy fashion; Howard and Hamble- business staff should report at the<br />\nArmory.<br />\nend of the game. It is thought, system that come to his attention. ton took first and second in the Black and Blue Jay office on MonThe entries for the championship<br />\nhowever, that it will be necessary By not doing so, he puts his stamp plunge; Dunning broke the South day, February 11, at 12:30 P. M.<br />\nof America Medley Relay are comto have an admission charge for of approval upon cheating. Dr. Atlantic record in the breast stroke, At this. meeting it was decided<br />\ning in. Georgetown and Fordham<br />\nLatane emphasized the fact that and Lord captured the 100-yard not to have regular meetings, as<br />\nstudents as well as outsiders.<br />\nare definitely running and Yale and<br />\nwas the custom, but to hold the<br />\nThe scheduling of the Mt. Wash- only student support would make swim.<br />\nPitsburgh are very likely starters.<br />\nThe same team will probably meetings of the art and editorial<br />\nington game puts the finishing it possible for the honor system to<br />\nAbout six teams are expected to toe<br />\ntouches on the lacrosse schedule. be maintained; that the spirit as represent the Black and Blue this staffs on the first and third Tues- the mark in this special event. The<br />\nday of each month. By doing this<br />\n,WelLaS the letter of the system had week.<br />\nIt has been found necessary to<br />\nleading South Atlantic and Mictdie<br />\nThe lineup is as follows:<br />\nthe number of meetings the men are<br />\neel the contest with Army at West to be obeyed. He closed by showAtlantic teams will compete in their<br />\nRelay—Welsh, Buhrer, Coady required to attend will be reduced<br />\nPoints but there are two out-of- ing that observance of the honor<br />\nrespective territorial championship<br />\nto a minimum.<br />\ntown games arranged: Stevens system helped the individual to fos- and Lord.<br />\nrelays.<br />\n100-yard Swim—Buhrer, Lord.<br />\nTech, at Hoboken, and Lehigh, at ter his own integrity, itself a valA committee consisting of ParkQuite.a few mile relays have been<br />\n220-yard Swim—Coady.<br />\nuable asset.<br />\nSouth Bethlehem.<br />\ner C. Williams, chairman; Joseph arranged,'which will attract the at50-yard Dash—Welsh and Buhr- A. Moran and Kenneth C. Watson<br />\nJohn Sherwood, president of the<br />\nThe committee named in place<br />\ntention of the high school lads.<br />\ner.<br />\nhas been appointed to arrange a Friends School, Baltimore City Colof a head coach will meet at an ear- Student Council, gave his entire<br />\nBreast Stroke—Dunning.<br />\nly date to make plans—for the com- approval to what Dean Latane had<br />\ndinner once a month for the Jay lege, Baltimore Polytechnic InstiBack Stroke—Morrell.<br />\nsaid. He repeated that it was in<br />\nstaff.<br />\ning season.<br />\ntute, McKinley High School of<br />\nPlunge—Hambleton and HowThe next issue of the Black and Washington, Central High School<br />\nA regular Red Eagle team is to the hands of the student body, not<br />\nard.<br />\nBlue Jay will appear on March 20. of Washington, and Episcopal<br />\nbe formed in addition to the Var- the Student Council, to decide<br />\nFancy Diving—Coady.<br />\nMembers of the junior class have High SchOol of Alexandria, Va.,<br />\nsity lacrosse team. It will be whether the honor system should<br />\nHopkins is expected to make a suggested that the staff make the<br />\ncoached by Sam Silberstein, one of stand or fall. Sherwood expressed<br />\nwill furnish considerable rivalry for<br />\nthe former Varsity stars. Its his opinion of what the highest goal strong bid for honors in the Mid- next number of.the Jay the \"Junior relay honors. The Maryland Cathschedule, which will be made up by of the honor system should be, and dle States Championships this year. Prom Number.\" It is believed that olic High Schools will compete in<br />\nManager H..S. Baker, a Hopkins urged that all co-operate to produce Rutgers is greatly handicapped be- this will give prominence to the a closed mile relay event.<br />\ncause of a ruling of the Middle Junior Prom, and at the same time<br />\ngraduate, will include games with the desired result.<br />\nMany entries have been received<br />\nCity, Poly, Maryland, St. John's, Don Vanneman announced that Atlantic Swimming Association, will establish it better as a tradition for ;the open events. Hopkins,<br />\nand possibly Pennsylvania. Thus, the Musical Club would give its big which prevents any man from ap- at Hopkins. Members of the jun- Georgetown, Maryland, Navy, Rutinterest will be maintained on the concert this year .at the Maryland pearing in more than two events. ior class have promised to co-oper- gers, .Cross Country Club, Washpart of those men who are unable Casualty Clubhouse on February Because of this ruling, Geibel will ate with staff in this publication, ington Canoe Club, and other col21. A dance will follow. The not be permitted to take such a and will contribute to the number. leges and clubs have entered teams.<br />\nto make the Varsity team.<br />\nprominent part in the meet as he A meeting will be held in order to<br />\nSpectators will see such stars as<br />\nManager Collins wishes to im- price of the reserved seats will be<br />\ndid<br />\nlast year, when he swam in present this matter to the class.<br />\nstueach<br />\nand<br />\na<br />\nhalf,<br />\nand<br />\ndollar<br />\na<br />\nAl Leconey, of Lafayette; Jim Conpress on the lacrosse men the imthree events and the relay.<br />\nA meeting of the business staff nolly, of Georgetown; Joie Ray, of<br />\nportance of coming-out for every dent activities card will be good for<br />\nThe remainder of the schedule and candidates will be held on<br />\nbe<br />\non<br />\nwill<br />\ntickets<br />\nticket.<br />\nThe<br />\nMon- Chicago A. C.; Clarke, of Cross<br />\nPractice, as there remains only two one<br />\nincludes a meet every week-end day at 12:30 P. M.<br />\nCountry Club; Curtis, of Navy, and<br />\nmonths until the beginning of the sale immediately after the exams.<br />\nduring March.<br />\nChamberlain, of Cross Country<br />\nschedule.<br />\nClub, in action in the different<br />\nThe team was not hit very hard<br />\nCOTILLON<br />\nCLUB<br />\nDANCE<br />\nevents.<br />\nby the examinations, only a few of<br />\nVARSITY CLUB ADMITS<br />\nThere will be an informal dance<br />\nLACROSSE MEETING<br />\nThe Black and Blue team was<br />\nthe better men being lost. The<br />\nNINE NEW MEN<br />\nin<br />\nthe<br />\nC.<br />\nE.<br />\nHall<br />\ntomorrow<br />\nFebruary<br />\n13,<br />\nafterTuesday,<br />\nOn<br />\nhit unusually hard this year by exProspects for a successful season<br />\nAt a recent meeting of the Var- noon at 4.30.<br />\nat 4.30 P. M., there will be<br />\naminations. Unfortunately, exams<br />\nare exceedingly bright, as coman organization meeting tcrbe<br />\nsity Club the following nine men<br />\ncome just at that time of the year<br />\npared with previous years.<br />\nattended by all coaches and<br />\nwere admitted to membership:<br />\nwhen track men should be doing<br />\nseveral interested alumni.<br />\nPlease pay Russian Student ReCromwell, Skinner, Slovvik, lief<br />\ntheir hardest conditioning work.<br />\nThe presence of all old and<br />\nPledges at Y. M. C. A. Office<br />\nnew players is requested.<br />\nHowever, every man on the squad<br />\nBonner, Coady, Hensel, Hardy, at once.<br />\nDR. WARMING LECTURES<br />\nis<br />\nnow training regularly. The mile<br />\nTurnbull, Murphy.<br />\nTHIS AFTERNOON<br />\nAll students desiring group<br />\nrelay<br />\nteam may have a couple of<br />\npictures are requested to<br />\nThere are still a number of letThe University will hold a lecfreshmen<br />\nin the lineup, but it will<br />\nplace their orders with Mr.<br />\nMeeting of Business Staff<br />\nter men in the university who have<br />\nture today at 5 P. M. in the audino doubt make an extremely credMeyers, the postmaster, at<br />\nand candidates of Black and<br />\nnot joined the Varsity Club. All<br />\nonce.<br />\ntorium of the Civil Engineering<br />\nitable showing and bring home the<br />\nBlue Jay Monday at 12.20.<br />\nexpected<br />\nto<br />\nthese<br />\nare<br />\nsign<br />\nup<br />\nof<br />\nof<br />\nbacon once more to Homewood.<br />\nAspects<br />\nbuilding. \"Economic<br />\nSpring competition for<br />\nThe usual South Atlantic chamat an early date.<br />\nMeeting of 1922 Football<br />\nDanish Co-operative Agriculture\"<br />\nBack and Blue Jay Editoripionship mile relay will not be on<br />\nAssistant Managers and canal Staff to begin next<br />\nA meeting of the Varsity Club<br />\nWill be the subject taken by the lecthe<br />\nprogram this year. In its place<br />\nweek. Candidates for staff<br />\ndidates for 1923 in Newswas held Friday to discuss future<br />\nturer, Dr. Jens Warming, profesreport to office any day durthe Hopkins sprint quartet will try<br />\nLetter office next Wednesday<br />\nplans of the club as well as athletic<br />\nsor of political science in the Uniing noon hour.<br />\nconclusions with Maryland. Prac12.30.<br />\nconditions at the university:<br />\nversity of Copenhagen.<br />\nContinued on page 2, col. 3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 9, 1923<br /><br />\n2<br /><br />\nDean Williams of Medical School Y. M. C. A. ADOPTS NEW 0. D. K. NOT TO HOLD A<br />\nDANCE DURING JUNE<br />\nPLAN FOR BIBLE STUDY<br />\nMakes Annual Report<br />\nWEEK<br />\nTo take the place of the Bible<br />\nThree times as many students as<br />\nAt the last meeting of the 0. D.<br />\ncan be accommodated are seeking study discussions which have been<br />\nFOUNDED 1897.<br />\nK.,<br />\nheld at the Beta House, at 7.30<br />\nadmission to the Johns Hopkins held each Wednesday during the<br />\nMedical School, according to the year, the Y. M. C. A. has substi- P. M., on Monday, February 6, it<br />\n$2.00 annual report of Dean J. Whitridge tuted a program which they believe was definitely decided that that orSubscription<br />\nWilliams.<br />\nwill be of greater advantage to ganization would not give a dance<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\n\"Pursuant to regulations formu- those persons interested. This new during June Week.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nThe financial difficulties conlated a year previously, the num- plan will be put into operation beber of students in the incoming ginning Thursday, February 15, at fronting the 0. D. K. in respect<br />\nPublished semi-weekly ,from October to June by the students of Johns<br />\nclass was limited to 75,\" Dr. Wil- 7 P. M. Meetings will be conduct- to the publication of the Hopkins<br />\nHopkins University.<br />\nliams' report said, \"and this num- ed by the Rev. J. J. Coale, secre- Song Book have been overcome.<br />\nBusiness communications should be addressed to the BUSINESS MANThis was brought about by the loAGER,JOHNS HOPKINS UNIVERSITY; all articles and other communications ber was chosen from three times tary of the Presbyterian Federashould be sent to the MANAGING EDITOR.<br />\nthat many applicants.\"<br />\ntion, at the Methodist Protestant cation of three hundred misplaced<br />\nThe loss of the income incident Church, at St. Paul and 27th Sts., volumes at Read-Taylor Company.<br />\nHomewood 100<br />\nTelephone<br />\nA motion was passed by which<br />\nto the reduction in the number of and by Victor S. Mills, pastor of<br />\ncomstudents admitted has been<br />\nthe Grace M. E. Church, on Ed- all the students of the undergradBusiness Manager:<br />\nEditor-in-Chief:<br />\npensated for by an advance in year- mondson Ave.<br />\nuate body will be urged to give<br />\nWILLIAM H. MOORE, JR., '23.<br />\nGLOVER P. FALLON, '23.<br />\nly tuition from $250 to $300.<br />\nThese meetings will be held ev- every possible support to the MaryManaging Editor:<br />\nAdvertising Manager:<br />\nThe advisory board of the school ery Thursday during February, land-Hopkins Debate, which will<br />\nJ. HUDSON HUFFARD, '23.<br />\nDONALD K. VANNEMAN,'23.<br />\nhas decided to rescind its regula- March and April, beginning at 7<br />\nbe held in the near future.<br />\nAssistant Managing Editor:<br />\ntion, established in 1921, raising P. M., and ending at 7:45 P. M.<br />\nCirculation Manager:<br />\nJOSEPH S. LEOPOLL '24.<br />\nA member of the 0. D. K. was<br />\nthe entrance requirements in chem- sharp. At these meetings probPHILIP W. HOWARD, '25.<br />\nAssociate Editors<br />\nistry from two to three years' prep- lems, objective and personal, of a appointed to see Dean Latane and<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nManagers:<br />\nBusiness<br />\nAssistant<br />\nJR.,<br />\n'24.<br />\narrange for the reservation of one<br />\nWILLIAM G. DEAN,<br />\naration in college.<br />\nman's religious life will be disRANDOLPH NORWOOD, '24.<br />\nBERNARD C. HEARN, '23.<br />\nassembly during the year for the<br />\n\"During the course of the past cussed.<br />\nT. REESE MARSH, '24.<br />\nFITZGERALD DUNNING, '24.<br />\nWilliams<br />\nreported,<br />\n\"it<br />\nDr.<br />\nyear,\"<br />\nD. MILES MARRIAN, '25.<br />\nJunior Editors:<br />\nIt was thought that this change purpose of reading the history and<br />\nwas learned that numerous institu- in time would offer persons who traditions of the university.<br />\nRICHARD C. TILGHMAN, '25.<br />\nG. DONALD GIESKE, '25.<br />\nJOHN W. PARSONS, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\ntions of good standing either found<br />\nwish to take part in this work, a 0. D. Collins was appointed delBENJAMIN T. ROME, '25.<br />\nC. LEWIS, JR., '23<br />\nJOHN<br />\nit impossible to give such an better opportunity to indulge in its egate from the Hopkins Chapter to<br />\nW. EDWARD THOMSEN, '26.<br />\nJOHN T. DIXON, '24.<br />\nJ. ARTHUR NELSON, JR., '26.<br />\namount of work to medical stu- advantages. At the meeting held the annual National Convention of<br />\nERNEST A. STRATHMAN, '26.<br />\nA. J. McKAY, '26.<br />\ndents, or considered, if it were done, at school, various things continual- the 0. D. K. to be held at Richthat it would diminish the cultural ly came up which interfered with mond University, on February 15<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nvalue of the college course.<br />\nregular holding of the meetings, and 16. The entire chapter will,<br />\ncommuni\"Consequently,<br />\nafter<br />\nand for this purpose the time has in all likelihood, attend the convenPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ncating with the deans and profes- been changed.<br />\ntion.<br />\nsors of chemistry in many of the<br />\nThe Y. M. C. A. wishes to extend<br />\nRandolph Norwood, Business<br />\nmore important colleges and uni- to the students of the university a Manager of the Hopkins Songbook,<br />\nBALTIMORE, MD., FEBRUARY 9, 1923<br />\nversities, our regulation was re- cordial invitation to atend any or requests that all back subscriptions<br />\nscinded, and only two years' prep- all of these meetings.<br />\nbe paid up at once.<br />\naration was made obligatory, but<br />\nit was stated that three years were<br />\nMORE ABOUT CO-EDUCATION<br />\nOn the front page of this issue, we are requesting that the under- desirable, and, other things being<br />\ngraduate readers fill out an enclosed ballot expressing their stand on equal, that students presenting such<br />\npreparation would receive preferco-education.<br />\nence.\"<br />\nThe recent discussion in the editorial and Mail-bag columns.has<br />\ncaused so wide a comment upon the campus that the News-Letter is \"Radical reorganization\" of the<br />\nanxious to see just what is the opinion of the undergraduate school sub-department dealing with social<br />\nIs what every ambitious senior is<br />\nas a whole. Before signing the ballot, consider both sides of the hygiene cases was effected during<br />\nthe<br />\nWilliams<br />\nsaid.<br />\nThis<br />\nyear,<br />\nDr.<br />\nlogical<br />\nmind<br />\non<br />\nsome<br />\nyour<br />\nown<br />\nquestion and justify your stand in<br />\nthinking about at the present time.<br />\nground. Do not thoughtlessly make an \"X\" opposite \"or\" simply was brought about through a gift<br />\nLife insurance is one of the best, one<br />\nbecause you think that female companionship would be pleasant; do of $9,000 from the Inter-departmenof the most desirable, and one of the<br />\nnot in as light a frame of mind vote \"Opposed To\" because such tal Social Hygiene Board. Dr.<br />\nhas<br />\nbeen<br />\nChesney<br />\nmade<br />\nAlan<br />\nM.<br />\nmost satisfactory as a permanent<br />\ncompanionship would appear annoying.<br />\nassociate professor of medicine to<br />\nDo you believe that the attendance upon full undergraduate<br />\ncalling.<br />\ndirect research work in the study<br />\ncourses would affect the work or standards at the University in one<br />\nof social diseases, while Dr. Albert<br />\nway or another? Would competition with women stir YOU to harder<br />\nIn assets and volume of business,<br />\nKeidel will continue in charge of<br />\nstudy or would it distract you from study altogether? With a limited<br />\nlife insurance is one of the three leadthe practical work.<br />\nattendance, do you believe that the mixed student activities, that<br />\ning businesses of this country, yet the<br />\n\"Moreover,\" Dr. Williams rewould necessarily result, would be improved or weakened? Do you<br />\nported,<br />\n\"it<br />\nwas<br />\nagreed<br />\nthat<br />\nwhen<br />\nuniversities<br />\nother<br />\nfield is comparatively under-developed.<br />\nknow whether co-education has helped or hindered<br />\nGovernment's<br />\nsubvention<br />\nof Hopkins' size and character? Would the matter of tradition influ- the<br />\nOnly 7 per cent of the economic value<br />\nence you one way or another.? If Hopkins had been a mixed under- ceased, the university would conof human life in the United States is<br />\ngraduate school, would it have influenced you for or against enroll- tinue to make sufficient appropriations<br />\ncarry<br />\nthe<br />\nwork<br />\nto<br />\nforward.<br />\ncovered by insurance. This gives an<br />\ning? Finally, overlooking the effect upon your person, do you believe<br />\nthat co-education would be better for the Johns Hopkins University? This represents a great advance,<br />\nidea of the big field still to be worked,<br />\nand it is confidently expected that<br />\nConsider these questions as fully as possible and check off your<br />\nespecially business insurance for firms<br />\nit will result in fruitful developdecision upon the ballot.<br />\nment in that important subject.\"<br />\nand corporations.<br />\nWe take this test vote in fear that we may have done an injusPlans<br />\nfor<br />\nestablishment<br />\nthe<br />\nof<br />\na<br />\ntice to the female students who recently expressed a desire to become<br />\nAs to remuneration: Reports of<br />\nresearch department in physics in<br />\n\"of us.\" The results will be turned over to some faculty member for<br />\nthe<br />\nMedical<br />\nSchool<br />\nwere<br />\napproved,<br />\ncollege graduates who have entered<br />\ncounting so that all care may be exercised toward fairness. If, after<br />\nDr. Williams said, and an effort<br />\nrepresent<br />\nthe<br />\nnot<br />\ntruly<br />\neditorial<br />\nstaff<br />\ndid<br />\nthat<br />\nour<br />\nfind<br />\ncount,<br />\nwe<br />\na<br />\nbusiness indicate that life insurance is<br />\nsentiment of the undergraduate body, we will most extravagantly made to start the department. Howat the very top as a source of income.<br />\never, the ;establishment has been<br />\napologize.<br />\ndelayed through inability to secure<br />\nNow is the time for you to consider<br />\nthe services of a scientist especialwhat you are going to do after graduly desired for the conduct of the<br />\nTHE GREATEST MAN<br />\nation. If you are ambitious and willdepartment, so the matter is being<br />\nIt is perfectly possible that our staff may, at times, hold an opin- held in abeyance.<br />\ning to work hard and are interested<br />\nion different from the majority of our fellow-students. Twenty men,<br />\nto know about life insurance, address<br />\nthe usual size of our entire staff, should be a large enough number to<br />\nrepresent University opinion, yet at times that body might be influ- RELAY MATCHES TO FEATURE<br />\nenced by one of their number who is of a strong mind.<br />\nAgency Department<br />\nMEET<br />\noutsider<br />\ninto<br />\nholidays,<br />\nan<br />\ndrifted<br />\nChristmas<br />\nthe<br />\nContinued<br />\nbefore<br />\nthe<br />\nfrom<br />\npage<br />\n1.<br />\nJust<br />\nNews-Letter office and asked,\"Who is the greatest living man in the tice is being held daily at 4:30 at<br />\nworld?\" After the usual humorous response, serious opinions were the Fifth Regiment Armory. It is<br />\nexpressed and Woodrow Wilson was declared the \"greatest living not yet too late to get in trim for<br />\nM T AL<br />\nman\" by an overwhelming majority.<br />\nthe sport classic on February 24th.<br />\nLIFE INSURANCE COMPANY<br />\nOF BOSTON. MASSACHUSETTS<br />\nIf the same question had been put up to a large body there would Every man with latent or occult<br />\nand,<br />\nalthough<br />\nanswers,<br />\nit<br />\nis<br />\nvery<br />\nof<br />\nvariety<br />\ngreater<br />\nfar<br />\na<br />\nbeen<br />\nLargest Fiduciary Institution in New England<br />\nhave<br />\ntrack ability should report to Manpossible that the same result would have been indicated, the ma- ager Kirwan without fail at the<br />\njority would have been nowhere near so overwhelming.<br />\nearliest. opportunity. No equipment is necessary.<br />\nStill, we do our best!<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\n••••IIIIIIII••11111111111111111111111111<br /><br />\nTheBestBusinessCareer<br /><br />\n•<br />\n•<br /><br />\n•<br />\n•<br />\n•<br />\n•<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 9, 1923<br />\nA<br /><br />\nD.<br />\n.30<br />\nIt<br />\n)rice<br /><br />\n)nect<br />\nins<br />\nne.<br />\nlo:ed<br />\nfly.<br />\nich<br /><br />\nive<br />\nry7ill<br /><br />\nA. S. C. E. MAKING PLANS<br />\nFOR NEXT MEETING<br />\nThe Hopkins Student Chapter<br />\nof the American Society of Civil<br />\nEngineers is laying elaborate plans<br />\nfor its next meeting and smoker,<br />\nwhich will be held during the latter part of this month. A committee, consisting of Walter H. Sommerville, '23, chairman; Ed Watson, '24, and Benj. Rome, '25, were<br />\nappointed by President Wills to obtain a speaker and to provide entertainment and refreshments for<br />\nthe smoker. The last affair of the<br />\nsociety, held a few weeks ago, was<br />\ndeclared by all present to be one<br />\nof the best ever given by the organization.<br />\nThe emblems of the society, consisting of a maroon shield engraved<br />\nin gold on a circular white background, which were originally in-<br /><br />\ntended to have been distributed at RIFLE TEAM ENTERS FIRST<br />\nSTAGE OF INTERCOLthe last meeting, have just been reLEGIATES<br />\nceived and are being well-received<br />\non the campus.<br />\nThe Johns Hopkins Rifle Team<br />\ndid not meet Yale during the week<br />\nCOADY?<br />\nending- January 26, and, conseFootball Recruit—I'm a little quently, did not defeat Yale's team<br />\nstiff from bowling.<br />\nas it has been reported. During<br />\nCoach—I don't care where you're the present week, a five-man team<br />\nfrom. Get on your duds and go to is competing in the first stage of<br />\nwork.—Judge.<br />\nthe intercollegiate matches. Whatever score the team makes will be<br />\nCo-ed (angrily)—I should think<br />\ncounted as the score against<br />\nyou'd be ashamed to look me in<br />\nGeorgetown, with whom we have a<br />\nthe face or speak to me on the<br />\nmatch this week. The shooting<br />\nstreet.<br />\nwill be done from the prone and<br />\nHe—I am kinda, but I've got to<br />\nstanding positions.<br />\nbe courteous.—Purple Cow.<br /><br />\n3<br /><br />\nThe \"COLLEGIAN\"<br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br /><br />\n.50<br />\n4up<br /><br />\nWARNER /<br />\nc1<br />\n4 COMPANY<br />\nHATTERS<br />\n222 W. BALTIMORE ST.<br /><br />\nYou collegians who stroll along the campus will<br />\nbe among the first to sense the coming of Spring.<br />\nDoesn't that suggest something to you in the<br />\nmatter of clothes?<br />\nGo in for Stein-Bloch and Goodman and Suss<br />\nSuits if you want to know college style at its best.<br /><br />\n\"When I marry, I'm going to<br />\nTHEN WHO WAS IT?<br />\nmarry a girl who can take a joke.\" \"If I had known that tunnel was<br />\n\"Don't worry, little boy, it's the so long, I would have kissed you.\"<br />\n\"Good heavens, wasn't that you ?\"<br />\nonly kind you'll get.\"—The Bean—Voo Doo.<br />\npot.<br /><br />\nelaaelian-ducie4N Y-400- 4(Y. M. B. 0. D.)<br /><br />\nTas<br />\nnd<br />\n)ne<br />\n:he<br />\nnd<br /><br />\nelto<br />\nof<br />\n:h15<br /><br />\noliPlcwaSiPZZIP7.71PG.S..3'<br />\n.<br /><br />\nBaltimore and Hanover<br /><br />\nFOR THE THIRD CONSECUTIVE YEAR<br /><br />\n•<br /><br />\nONLY THE DIAL<br /><br />\nURNER'S<br />\n1,1<br />\n•<br /><br />\namong America's leading magazines<br />\nhas been awarded the rating of<br /><br />\nMEN'S SHOES<br />\nOf the Better Class<br /><br />\n!n-<br /><br />\n\"The Wonder Motor Fuel\"<br /><br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br /><br />\n100%<br /><br />\n2SS<br /><br />\nBALTIMORE<br /><br />\n)k,<br /><br />\nns<br /><br />\nWinter Weather Does Not<br />\nLessen Efficiency of<br /><br />\nfor the short stories of distinction it has published. Edward J. O'Brien,<br />\nthe American authority on the short story, in his annual review of American magazine fiction recently published in the Boston Transcript, again<br />\nrated THE DIAL above every other maRATING BY PERCENTAGE OF<br />\ngazine in America for the percentage of<br />\nDISTINCTIVE STORIES<br />\nPer Cent Average<br />\npubliit<br />\nhas<br />\ndistinction<br />\nstories<br />\nof<br />\nshort<br />\n1922-1921-1920 3 years<br />\nyear.<br />\nshed during the past<br />\n1 THE DIAL 100 100 100 100<br />\n2 World Fiction<br />\n(Aug.-Sept.)<br />\n3 Century<br />\n4 Asia<br />\n5 Harper's<br />\nMagazine<br />\n6 Atlantic<br />\nMonthly<br />\n7 Broom<br />\n8 Scribner's<br />\nMagazine<br />\n9 Pictorial<br />\nReview<br />\n10 Double Dealer<br />\n11 Smart Set<br />\n12 Hearst's<br />\nInternational<br />\n13 McClure's<br />\nMagazine<br />\n14 Delineator<br />\n15 Red Book<br />\nMagazine<br />\n16 Metropolitan<br />\n17 Ladies' Home<br />\nJournal<br />\n18 Collier's<br />\nWeekly<br /><br />\nEvery year Mr 'O'Brien makes a survey of the<br />\nfiction published by American magazines, and<br />\nhis appraisal is generally accepted as authoritative by students of literature. The best of<br />\nthe stories selected by Mr O'Brien are annually<br />\nrepublished in book form.<br /><br />\nTHE DIAL was first awarded the rating of 100%<br />\nin 1920, at the end of its first year as a magazine of art and letters. Again in 1921 THE DIAL<br />\nheaded Mr O'Brien's list, and now in 1922,<br />\nfor the third consecutive year, THE DIAL has<br />\nachieved the highest rating in Mr O'Brien's<br />\nclassification.<br />\nThis record is particularly significant in view<br />\nof the fact that Mr O'Brien selects for his percentage ratings only stories of unusual merit<br />\nand distinction. THE DIAL'S record of 100%<br />\nmeans, therefore, that since 1920 it has not<br />\npublished a single mediocre story.<br /><br />\n95<br />\n93<br />\n90<br />\n89<br /><br />\nTO<br />\n90<br />\n74<br /><br />\n734<br /><br />\n83<br /><br />\n—<br />\n75<br /><br />\n80<br /><br />\n88<br />\n87<br /><br />\n65<br /><br />\n95<br /><br />\n83<br /><br />\n71<br /><br />\n52<br /><br />\n72<br /><br />\n65<br /><br />\n65 71<br />\n57 —<br />\n35 25<br /><br />\n65<br />\n40<br /><br />\n68<br />\n—<br />\n34<br /><br />\n29<br /><br />\n23<br /><br />\n28<br />\n28<br /><br />\n18<br />\n—<br /><br />\n45<br /><br />\n31<br /><br />\n24<br />\n19<br /><br />\n20 15<br />\n24 26<br /><br />\n20<br />\n23<br /><br />\n19<br /><br />\n15<br /><br />\n_<br /><br />\n17<br /><br />\n15<br /><br />\n25<br /><br />\n•<br /><br />\nti<br /><br />\n•<br />\n•<br /><br />\n14<br />\nN<br /><br />\n•<br /><br />\n•<br /><br />\nOur business is one which calls for an investment consisting of time and effort.<br />\nIt is the largest, most profitable business in the world. We are going to invest<br />\nour time in order to train a selected class of students so that they will b t able to<br />\nconvert their spare time into money.<br />\nThis course will be free of any cost to the students selected. It will be arranged<br />\nso as not to conflict with other work and studies. The successful student will<br />\nfind himself equipped to enjoy a clean, profitable vocation during the spring<br />\nand summer months. Then, too, every effort expended during your spare time<br />\nand the summer months will multiply and form the nucleus of your income in<br />\nthe future.<br /><br />\n1031 CALVERT BUILDING<br />\nBALTIMORE, MD.<br /><br />\nCHANTILLY<br />\nRestaurant Francais<br />\n518 N. CHARLES STREET,BALTIMORE<br />\nOrchestra—Dancing<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M.<br />\nTABLE D'HOTE<br />\nDINNER—$1.00<br />\nLUNCHEON-60c<br />\nSUNDAY D1NNER—$1.25<br /><br />\nTelephone, Vernon 3442<br /><br />\n4.00<br /><br />\nThe regular annual subscription rate of THE DIAL is $5 00. Our special rate of<br />\n$4.00 is made to students and faculty only if they subscribe through one of our<br />\ncampus representatives, several of whom are now taking subscriptions for THE<br />\nDIAL. Our representatives are all students who are earning part of their expenses<br />\nby taking subscriptions to THE DIAL. THE DIAL is allowing its representatives<br />\na liberal commission on each subscription. Subscriptions may be placed with the<br />\nBusiness Manager of your paper. In all such cases, the usual commission will be<br />\nallowed, and will be apportioned by the Business Manager among our campus representatives.<br /><br />\n-11S7<br />\n1411•<br /><br />\nDRAPERIES<br /><br />\nIf you live in the State of Maryland and are 18 years of age or over, write for<br />\ninterview, giving your telephone number.<br /><br />\nPA<br /><br />\nand Faculty Offer---------•<br />\n•<br /><br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\nTURN YOUR SPARE TIME<br />\nINTO DOLLARS<br /><br />\n19<br /><br />\nwhose latest novel will be published in the spring issues of THE DIAL.<br /><br />\n•<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nGerhart Hauptmann<br />\nTHE DIAL for one year<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nThis record becomes all the more remarkable when it is realized that THE<br />\nDIAL is not exclusively a fiction magazine. Short stories form but a part<br />\nof the material in each issue. The poetry, essays, criticism, and reproductions of the fine arts published by THE DIAL are equally distinctive. The<br />\neditorial policy of THE DIAL is directed towards achieving distinction in<br />\nall lines. THE DIAL'S better known contributors include the most distinguished writers of Europe and America. A new name will shortly be<br />\nadded to this notable list of contributors—<br /><br />\n-- -Special Student<br /><br />\nA Quick, Sure Start!<br />\nSHERWOOD BROTHERS, INC.<br /><br />\nlic\"k411 •111 71 4bc—lbc\"4P..1V-%<br />\nArn.<br /><br />\n•<br />\ni4<br />\n\\j<br />\nI.<br /><br />\nRADIO!!<br />\nYOU WILL FIND OUR STOCK OF STANDARD MAKE SETS<br />\nAND APPARATUS WILL MEET YOUR EVERY NEED<br />\nCOMPLETE VACUUM TUBE RECEIVERS, $39.95 UP<br /><br />\nCO.<br />\nRADIO SUPPLY<br />\nCHARLES ST.<br />\n1724 N.<br /><br />\nVernon 3055<br /><br />\n10 Minutes from Hopkins<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 9, 1923<br /><br />\nDRAMATIC CLUB MAKES DR.DIXON DELIVERS SERMON ON SIDNEY LACHANGES IN CONSTITUNIER ON BIRTHDAY<br />\nMEETING<br />\nTION AT<br />\nThe Greetings of a Fine Store<br />\nDr. A. C. Dixon, of University<br />\nMerit Clause Amended. Coach<br />\nNow In Its<br />\nBaptist Church, had as the subject<br />\nSelects Tentative Cast. Club<br />\nTo the Students of a Fine University<br />\nof his morning sermon on February<br />\nto Present Burlesque<br />\nEIGHTH WEEK<br />\nAt the last meeting of the Dra- 4th, \"Sidney Lanier, the Bard of<br />\nJohns Hopkins, and His Crystal<br />\nANNE NICHOLS' LAUGHING<br />\nmatic Club, a . radical change was<br />\nChrist.\" Sidney Lanier's birthday<br />\nSUCCESS<br />\nmade in the constitution. It was<br />\nwas celebrated on Saturday, Fehmoved that, \"It is our intention to ruary 3, and Dr. Dixon took this<br />\ninterpret the special merit clause of opportunity to stress the life and<br />\nthe constitution to make eligible for work of this poet, whose name is<br />\nelection to the club, men who suc- so closely associated with that of<br />\nPRESCRIPTION DRUGGISTS<br />\nthis university.<br />\ncessfully understudy the principal<br />\nTWO STORES:<br />\nDr. Dixon considered Lanier as<br />\nparts of a main production.\"<br />\na man, a musician, a poet, a teachEutaw Place and North Ave.<br />\nCharles and Chase Sts.<br />\nThis step was taken only after er, and a Christian. As a man he<br />\nVernon 0890<br />\nMadison 0405<br />\nmuch discussion and due consider- was always winsome, kind and lovation. The club will realize several able. He was not embittered by<br />\nTHE PLAY THAT PUT<br />\nft<br />\nadvantages as a result of this move: the ravages of poverty and disease<br />\n41<br />\nU IN HUMOR<br />\nof February 12, 1923<br />\nto<br />\nfor<br />\nthe<br />\nWeek<br />\nwhich<br />\nhe<br />\nwas<br />\nsubject<br />\n41<br />\nan increase in membership, with<br />\n41<br />\nALL HEADLINE BILL<br />\ngreater part of his life, and had<br />\n41<br />\nconsequently more members being<br />\nnothing but good words for his felThe Maryland's Most Popular Star<br />\n0<br />\nFACULTY PLANS RESEARCH<br />\nleft in the club at the end of the lowmen.<br />\nAileen Stanley<br />\n\"THE PHONOGRAPH GIRL\"<br />\nOver one hundred years 41<br />\nIN HISTORY OF IDEAS<br />\nyear; and interest will be stimuAs a musician he was pre-emi&gt; of designing and creating 4141<br />\nBy Popular Demand<br />\nPlans have been made to establated in the productions, on the nent. At the age of seven he had<br />\nSilverware assures the pur- 41<br />\nSouthland Entertainers<br />\n41<br />\nlish<br />\namong<br />\nthe<br />\nmembers<br />\nof<br />\nthe<br />\nchaser<br />\nof Kirk pieces in 41<br />\nfrom.<br />\na<br />\nriver<br />\nbank<br />\nand<br />\ncut<br />\na<br />\nreed<br />\npart of those making a cast in order<br />\n41<br />\nGeorgie Moran &amp; Mack Charles<br />\nsilver absolute certainty of 41<br />\nThrough Johns Hopkins faculty a club which<br />\nTwo Black Crows<br />\nto remain there, and on the part had made his first flute.<br />\n4<br />\n41<br />\n4 superiority.<br />\nhis astounding 'ability he .early shall have as its principal purpose<br />\n41<br />\nGeorge Choos Presents<br />\n4/<br />\nof those who are understudying.<br />\ngained a place in the Peabody Or- the investigation of the \"history of<br />\n41<br />\n• Frank Sinclair &amp; Cliff Hess<br />\n41<br />\nMr. Swindell, the coach, has se- chestra of Baltimore, and was one<br />\nIN<br />\nideas\" in literature and philosophy.<br />\n\"The Little Cottage\"<br />\n41<br />\nlected a tentative cast for \"The of the leading attractions of that<br />\n4<br />\nIntroducing Ethel Russel, Marie Saxon 4<br />\n41<br />\nDr.<br />\nArthur<br />\n0.<br />\nLovejoy,<br />\nprofesseveral<br />\n41<br />\nand Kathalene Morris. Literary construcPurple Mask.\" It includes at least body for many years. By<br />\n4/<br />\ntion by Danl MacBoyle. Music by Walter<br />\nsor of philosophy, who has just L. Rosemont,<br />\n41<br />\ntwo names for every important reliable critics he was acclaimed the<br />\n0<br />\n41<br />\n41<br />\n41<br />\nrole. This is expected to cause a most accomplished living flutist in returned to Hopkins after a sixB. C. Hilliam<br />\n40<br />\n41<br />\nof \"Buddies\" and other Broad- 41<br />\n41<br />\nBaltimore, Md.<br />\nmonths' leave of absence, is given Composer<br />\nmore perfect attendance at rehear- the world.<br />\n4<br />\nway Successes in \"ORIGINALITIES\"<br />\n41<br />\n41<br />\nInterrupted<br />\nby Jim Kilpatrick<br />\n4/<br />\nactuated<br />\nby<br />\nthe<br />\nAs<br />\na<br />\npoet<br />\nhe<br />\nwas<br />\nmore<br />\ninterest.<br />\ndeal<br />\ngreat<br />\nsals and a<br />\n41<br />\nthe credit for forming the club<br />\nOldest Silversmiths in America 41<br />\nGus Fowler<br />\nThe competition will thus increase highest of ideals, and refused to Professor Lovejoy spent the sum0<br />\n0<br />\nthe effort on the part of the candi- lower them, though he could have mer abroad and<br />\nHerbert Clifton<br />\nEstablished in 1 8 1 7<br />\non his return in<br />\n41<br />\nby<br />\nso<br />\ndogreater<br />\npopularity<br />\ngained<br />\n4<br />\ndates to do their best.<br />\n41<br />\nOctober went to the University of<br />\nThe Follies Girls<br />\ning.<br />\nHe<br />\nwas<br />\na<br />\ngreat<br />\npoet<br />\nand<br />\nknew<br />\nRehearsals are being held five<br />\nKIMMCieMCK-Taeve^<br />\nBill, Genevieve &amp; Walter<br />\ntimes a week, for there are only it. Everything with which he came California as visiting lecturer in<br />\nSHOES<br />\nfive weeks left until the presenta- into contact furnished sufficient ma- philosophy.<br />\nfor<br />\ntion of the play; and all are work- terial for many poems, so that his<br />\nIn the near future the faculty<br />\nUNIVERSITY MEN<br />\ning hard in order to make this the head and soul were always over- members will be invited by Dr.<br />\nwith<br />\nyet<br />\nunwritten<br />\nverse.<br />\nflowing<br />\nNEXT WEEK<br />\nmost successful production ever<br />\nFor Dress<br />\nFor Sport,Wear<br />\nUnfortunately, much of this poetry James Wilson Bright, head of the Matinees Wednesday &amp; Saturday<br />\ngiven.<br />\ndepartment of English, to organSmart Styles—Best Leathers<br />\nOwing tc, inability to get the was never to be written, for, in letThe Supreme Theatrical Event of<br />\nframe<br />\nconfessed<br />\nize,<br />\na<br />\nconstitution,<br />\nelect<br />\nofhis<br />\nfriends,<br />\nhe<br />\nters<br />\nto<br />\nModerate Pricer;<br />\nscenery into the Dramatic Club<br />\nthe Season<br />\nStudio, the club has had great dif- that, because of his poverty, he of- ficers, and determine a program.<br />\nThe Selwyns Present<br />\nficulty in obtaining a place for stor- ten had not the strength to put pen The club will be called the History<br />\ning and painting its scenery this to paper. With all this misery, of Ideas Club.<br />\n19 W. LEXINGTON ST.<br />\nyear. As the Homewood Playshop however, he retained his indomitIt<br />\nhad<br />\nbeen<br />\nproposed<br />\nto<br />\nestabhas taken over the old gym, behind able optimism.<br />\nPrinters of the<br />\nlish the club last spring, and the<br />\nAs a teacher he was also of the<br />\nthe Hopkins Club House, the club<br />\nJohns Hopkins News-Letter<br />\nin<br />\nhad to look elsewhere for a suit- first rank, and through his wide promoters held one preliminary<br />\nmeeting,<br />\nbut<br />\non<br />\na<br />\naccount<br />\nof<br />\nacquired<br />\npressremarkably<br />\nreading<br />\nable place. The paint shop, in the<br />\nrear of the Botanical Gardens, was broad vision. Lanier declared that ure of other activities the plan<br />\nthe only place obtainable. This Poe 'did pot know enough to be a was postponed until the return of<br />\nW. Somerset Maugham's Modern<br />\nshop is highly inadequate and at good poet, and, setting out to qual- Professor Lovejoy from CaliforComedy Triumph<br />\npresent it isn't certain as to its be- ify himself in his chosen field of ennia.<br />\nWith<br />\nAll-Star Cast<br />\nProfessor Bright was made<br />\ndeavor, he spent years in reading<br />\ning satisfactory.<br />\nErnest Lawfofd<br />\nClara Moores<br />\nThe club will welcome as candi- the literature of all ages, also delv- chairman of that meeting, 'with Dr. Jerome Patrick<br />\nLionel Glenister<br />\ndates for membership any men who ing to some extent in the sciences. H. Carrington Lancaster, head of<br />\nare interested in the art and prop- He accepted readily the basic part the.department of French, as sec- 'Due of the ten best plays of the<br />\nyear.''—Pulitzer Decision.<br />\nerty sections of dramatics, as these of the theory of evolution, but re- retary.<br />\ndepartments will be left vacant by jected the theory that one species<br />\nAlthough the study of the history<br />\ncould ever develop from another. of<br />\ngraduations this year.<br />\n0<br />\nliterary and philosophic ideas is<br />\nI<br />\nDuring June Week the club will<br />\nFinally, as a Christian, he was not a new thing, it is believed that<br />\nNext Week<br />\npresent a burlesque in the form of one of the best members that the Hopkins will be unique in the esCollege Literature<br />\nPurple<br />\na musical comedy, on \"The<br />\nChurch has ever known. He found tablishment of a special club of this Matines Wednesday &amp; Saturday<br />\nLOMBARD and SOUTH S7RIL7S<br />\nMask.\" The title has not been de- a sense of God in everything, es- sort. The members of<br />\nthe club will<br />\ncided upon as yet, but it is expect- pecially in music, which, he said, engage in research ,to trace<br />\nDirect from Here to N. Y.!<br />\nthe<br />\ned that it will be very similar to would be the church of the future, course of philosophic<br />\nHarvard Considering Intramural<br />\nthought re\"The Purple Flask.\"<br />\nin which all creeds would unite. garding problems which have preContests<br />\nDebating teams of Harvard will<br />\nReligion permeated his whole life, sented themselves in the evolution The George W. Lederer Musical<br />\nargue the question, \"Resolved,<br />\nand faith in God was the basis for of human knowledge.<br />\nHit<br />\nThat Harvard should limit interNEWSPAPER SCOOP IS<br />\nall his achievements. Educated in<br />\ncollegiate football games to one conPREMATURE<br />\na Southern Presbyterian atmotest with Yale, supplementing this<br />\nRecently there was a great deal sphere, he grew to desire above all Baltimore, because of the art, muwith the Oxford system of intrawalk<br />\nin<br />\nthe<br />\nways<br />\nof<br />\nGod.<br />\nelse<br />\nto<br />\nsic, and religion which flourished<br />\nof gossip current to the effect that<br />\nmural<br />\ncontests.\" Harvard students<br />\ngreatest<br />\none<br />\nof<br />\nhis<br />\npoems<br />\nin<br />\nhere.<br />\nplans were being made for rush- It was<br />\nsay<br />\nthey<br />\nare serious about the propIncludes<br />\nCast<br />\nExtraordinary<br />\ning through the building of a gym- —\"Crystal\"—that he found someOne of the last persons Lanier The<br />\nosition.<br />\nnasium in time for spring training. thing to forgive in all of the great- saw before he left Baltimore was Ada Mae Weeks<br />\nFred Heider<br />\nThe daily newspapers heard of the est men which the world has ever Dr. Gilman, then - president of the Stella Mayhew<br />\nTyler Brooks<br />\nBan on Knickers<br />\nstory and sent out representatives known, whereas he found nothing Johns Hopkins University. He<br />\nMarguerite Zender<br />\nDean Florence Purrington, of<br />\nto take in this big scoop. Dr. Ron- to forgive in Jesus, his \"Crystal spent his last days in the North<br />\nStanley Forde<br />\nMt. Holyoke College, recently ruled<br />\nald T. Abercrombie, director of Christ.\" Carolina Mountains, and, from his<br />\nSee Peaches and Scream!<br />\nthat \"knickers\" must not be worn<br />\nPhysical Education, however, when<br />\nLanier's ideal in art was purity, deathbed, dictated to his wife his<br />\nin the college classroom. Many of<br />\ninterviewed yesterday afternoon absolute purity, and he declined to last and possibly his greatest poem<br />\n1st Barber—Why were you so the students had been ,wearing<br />\nsaid that the rumor was entirely agree with Walt Whitman's theory —\"Sunrise\"—in which his eternal<br />\n\"knickers\" throughout the day.<br />\nunfounded. \"I have had the plans that whatever was natural was optimism shines forth like a jewel. late?<br />\nThe college authorities do not enfor the gymnasium ready for the good. He continued to admire<br />\nSidney Lanier will always retain<br />\n2nd Barber—I was shaving my- tirely condemn the wearing of<br />\nthe<br />\nlast twenty years,\" he said, \"but we Whitman for his talent, but could a place in the esteem of the faculty<br />\nI'd<br />\nuntil<br />\naway<br />\ncouldn't<br />\nget<br />\nand<br />\nself<br />\nknickerbockers<br />\nby<br />\nwomen,<br />\nbut<br />\nconfor<br />\nsome public- never be reconciled to him as an and students of this university for<br />\nare still waiting<br />\nspirited Hopkins alumnus to die artist. It is striking to note that his \"Ode to Hopkins,\" one of his talked myself into a haircut and a sider them inappropriate as classroom costumes.<br />\nshampoo.—Royal Gaboon.<br />\nand leave us the wherewithal.\"<br />\nLanier always retained a love for best compositions.<br /><br />\nAcademy of Music<br /><br />\nA<br /><br />\nHOCESCHILD,KOHN 8,c Co.<br /><br />\nABIE<br />\nIRISH<br />\nROSE<br /><br />\nFlynson, Westcott and Dunning<br /><br />\nMARYLAND THEATRE<br /><br />\nQuality<br /><br />\nSamuelKirk<br />\nand Son Co.<br /><br />\nAUDITORIUM<br /><br />\nJohn Drew<br />\nMrs. Leslie Carter<br />\n\"The Circle\"<br /><br />\nFOR<br /><br />\n\"PEACHES\"<br /><br />\nWYMAN<br /><br />\nti<br /><br />\nat<br />\nfc<br />\nti<br /><br />\nfi<br />\na]<br /><br />\nti<br /><br />"}], "field_media_file": [{"target_id": 37705, "display": null, "description": null, "target_type": "file", "target_uuid": "2049263b-bb06-4478-8016-047439112044", "url": "http://digital.library.jhu.edu/system/files/2022-03/13043-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13043, "target_type": "node", "target_uuid": "0c39c543-7c00-49c8-93ec-e5829e4a57ae", "url": "/node/13043"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "65e4c7b8-6916-46ea-990b-6efac606c7cc"}]}