{"mid": [{"value": 38201}], "uuid": [{"value": "b331e57b-cdd2-4f72-ac76-f57a99ceae2c"}], "vid": [{"value": 38201}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:50:23+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12768-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:50:23+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:50:23+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "iqopkim Nrinoirtirr<br />\n<br />\nNews-Letter Opinion On<br />\nBrowder Case<br />\n—Look On Page 2<br />\n<br />\nSENIORS: BUY<br />\nYOUR JUNE WEEK<br />\nTICKETS<br />\n<br />\n....111•••••••••<br />\n<br />\nVOL. XLI, No. 31<br />\n<br />\nJuneWeekPlans<br />\nProgress; Many<br />\nSeniors Sign Up<br />\n<br />\n(<br />\nirce<br />\nhe<br />\nLn-<br />\n<br />\n!ed<br />\nof<br />\nle-<br />\n<br />\nmfor<br />\n)ut<br />\nto<br />\n<br />\nat*<br />\nthe<br />\n.mthe<br />\n, a<br />\ning<br />\non-<br />\n<br />\nof<br />\n;<br />\n)1in<br />\nof<br />\n<br />\n3,ve<br />\nnes<br />\nose<br />\n<br />\njer,<br />\nH.<br />\n)er;<br />\nJay<br />\nwn,<br />\n[tie;<br />\nsn't<br />\n<br />\nof<br />\nas<br />\nits:<br />\nLou,<br />\nepan,<br />\n<br />\nvay<br />\n'ay<br />\nnue<br />\niiiii<br />\n<br />\n'ay<br />\nme<br />\nme<br />\n<br />\nurg<br />\n<br />\nace<br />\nit ry<br />\n<br />\neye<br />\n)(nit<br />\nicier<br />\nTihe<br />\nere<br />\nive<br />\ncts<br />\nadthe<br />\nr a<br />\naceld<br />\n<br />\n4<br />\n<br />\n6<br />\n6<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHOMEWOOD, BALTIMORE, MARCH 16, 1937<br />\n<br />\nStudent Council To Head<br />\nDorm Governors Board<br />\n<br />\nFreshmen Receive Plans For Soph<br />\nBallots For Newly Dinner At Belair<br />\nProposed Dues Plan Near Completion<br />\n<br />\nCommittee Calls<br />\nAnti-War Strike<br />\nRepresentatives<br />\n<br />\nHopkins Medical School<br />\nAdmits Fourteen Men<br />\n<br />\nThe Medical School of the<br />\nJohns Hopkins University has announced that the following Hopkins undergraduates have been admitted to the 1937-38 Freshinim<br />\nNew Budget Will Make Ac- Inter-Fraternity Ball Included; Class:<br />\ntivities More Numerous<br />\nChick Webb and Rita Rio<br />\nRobert Austrian.<br />\n'News-Letter', YMCA, And<br />\n'Clean' And 'Usual'Types Of<br />\nWilliam G. Beadenkopf.<br />\nAnd<br />\nConsideration<br />\nUnder<br />\nExpensive<br />\nLess<br />\nASU Release Appeal For<br />\nEntertainment Effects<br />\nGrant L. Boland.<br />\nRepresentatives<br />\nGeorge J. Coloviras, Jr.<br />\nOf Compromise<br />\nHershner Cross Explained Tinley Chosen To CommitErnest J. Cross, Jr.<br />\nSidney R. Gladstein.<br />\nProject At Recent<br />\ntee; To Announce Junior<br />\nBOWMAN INTERESTED<br />\nSEVEN COURSE DINNER<br />\nHarold M. Goldstein.<br />\nSelection Soon<br />\nClass Meeting<br />\nMilton Gussack.<br />\nCall Stresses Need For CoJames Hopkins.<br />\nPrice Is Lowest In Years;<br />\nThe class of 1940 has been offered<br />\nGood fellows will get together<br />\nFloyd Katske.<br />\noperation Among All<br />\nTransportation To Be<br />\na revolutionary, far-sighted financial Thursday night when the Sophomore<br />\nErnest Pieper, Jr.<br />\nplan<br />\nfor<br />\nClass<br />\nits<br />\nconsideration.<br />\nblowout<br />\nholds<br />\nannual<br />\nat<br />\nYesterday<br />\nAffected By War<br />\nProvided For All<br />\nBernard G. Pinck.<br />\nballots were distributed to members the Kenmore Inn in Belair.<br />\nMyrick W. Pullen, Jr.<br />\nPlans for a Hopkins demonstration<br />\nIn view of the nearly 50-50 result<br />\nof the Freshman Class concerning<br />\nThe annual Hopkins InterfraterJohn R. Steeper.<br />\n(luring<br />\nthis<br />\nnew<br />\nthe nation-wide annual Stubudget<br />\nballoting<br />\nof<br />\nplan.<br />\nthe<br />\nlast<br />\nweek<br />\ntype<br />\non<br />\nthe<br />\nnity Ball wll definitely be a part of<br />\nThese successful candidates for<br />\ndent Strike against War next April<br />\nUnder the proposed scheme dues of entertainment the Sophs wanted<br />\nthe 1937 June Week festivities, acadmission were notified of their<br />\nwill be raised slightly with an ac- at their banquet, the committee has<br />\n22nd were taking form this week<br />\nacceptance by mail last Friday.<br />\ncording to Moe Bradford, chairman<br />\nWith the dispatch of a call to various<br />\ncumulation of dividends resulting in decided to compromise. Besides the<br />\nof the June Week .Committee. Sevcampus organizations to take part.<br />\nthe marked reduction of expenses \"usual entertainment\" which was<br />\nThe call was issued over the signafrom $25 to $12 in their four years. slightly favored in the referendum,<br />\neral well-known \"name\" bands are<br />\nAs explained on the ballots, the idea \"clean\" entertainers will also be pretures of the American Student<br />\nbeing considered to play at the dance,<br />\nUnion, the NEWS-LETTER, and the Hopruns as follows:<br />\nsented.<br />\nincluding the popular Chick Webb<br />\nY.M.C.A., organizations which have<br />\n1. Dues will be compulsory and<br />\n\"Dinner will be served at about 7:30<br />\nand the vivacious Rio Rita and her<br />\nalready<br />\nfixed at $3.00 a year per member.<br />\nsignified their intention to<br />\np.m., during which several acts of the<br />\nall-girl orchestra.<br />\nparticipate.<br />\n2. A budget has been prepared for 'clean' variety will be shown,\" said<br />\nWill Speak On \"Fascist The appeal asked that representathe entire four years.<br />\nHenry Blucher, chairman of the banSidney Tinley, a member of the<br />\nTendencies And Their<br />\ntives be elected in time fqr an organiBecome Sec. - Treas. And 3. Payment of dues will entitle all quet committee. \"Following the last<br />\nKappa Alpha fraternity and a Senior<br />\nfreshmen, without additional pay- course of the meal, the boys will have<br />\nzation meeting to be held in Levering<br />\nSignificance\"<br />\nProd.<br />\nRespectively<br />\nMan.<br />\nin the Business School, is a new adment, to admittance and participa- an hour and a half to do with what<br />\nHall at 12.20 this Thursday. At this<br />\nRev. Henry Smith Leiper, executive time a committee, it is said, will be<br />\ndition to the June Week Committee.<br />\nAt Election Friday<br />\ntion in all the social functions of the they may. Then at about 10 o'clock<br />\nsecretary of the American Section delegated to discuss plans with Dr.<br />\nclass, and the June Week and Hulla- entertainment will be resumed.\"<br />\nThe Junior Class representative to<br />\nWilliam L. Snyder and Daniel baloo in their Senior year.<br />\nof the Universal Christian Council en Isaiah Bowman, president of the Unithe committee, who automatically<br />\nBlucher emphasized the fact that<br />\nGidinsky were elected to the offices<br />\nLife and<br />\nWork, also executive versity, reputedly \"much interested<br />\nAt a recent meeting of the Class<br />\nno one will be allowed to come in after<br />\nbecomes the chairman of next year's of secretary-treasurer and production<br />\nsecretary of the Department on Rela- in the strike.\" It is hoped that the<br />\nat which Hershner Cross, president of<br />\ndinner, in order to see the entertainJune Week, will be appointed in manager respectively in the Barn- the Student Council,<br />\ntions with Churches Abroad, Federal campaign will have, by this time,<br />\nexplained the<br />\nstormer elections held last Friday. project, it was definitely decided that ment, without paying the full admis- Churches of Christ in America, will reached a point of development, which<br />\nthe near future.<br />\nLouis Swyer had been chosen as some new budget plan this year would sion price—$1.50 a seat. Those Sopho- be the Supper Club Speaker and Uni- will permit the establishment of a<br />\n\"The committee,\" said Bradford,<br />\npresident and Frank Crist as business be needed. This was unanimously the mores who have paid their dues will versity Lecturer tonight. He will ad- formal strike committee to take care<br />\nget a fifty cent reduction on their<br />\n\"was very gratified at the turn of manager the week before.<br />\ndress the Supper Club at Levering of a pre-strike education committee.<br />\nopinion of the members of the Class,<br />\nticklts.<br />\nevents during the past week. The<br />\nHall at 6 p.m. on \"Fascist Tendencies<br />\nIn the contest for secretary-treas- since it was pointed out to them that<br />\nDelegates of the three organizations<br />\nMeans of transportation to Belair and Their Significance.\"<br />\nnumber of promissary notes turned urer, Snyder defeated Merel Harmel if the proposed plan or some other<br />\nrepresented are: C. Hammond Brown,<br />\nwill be provided each man separately<br />\nAt 8:15 he will speak on the and Brian Murphy, for the Y.M.C.A.;<br />\nin by the Seniors has gone far be- and Stanley Prager, and Gidinski's were not accepted, the dances, banas<br />\nhe purchases his ticket from one University Lecture Series at the WilMorris Shils, and Milton Brotma.n, for<br />\nyond our expectations.\" Bradford opponents were Milton Saul and Stan- quets, and other regular activities of of the<br />\nmembers of the committee. son Memorial Church on \"Patriotism<br />\nley Isaacson. Both Snyder and Gidin- the Class would be greatly curtailed.<br />\nthe American Student Union; and J.<br />\nreferred to the notes being distributed<br />\nski will be seniors next year. Gidin- Also, from a realization of their Automobiles will be used wherever and Religion.\"<br />\nMurray Kemptqn, for the NEWSamong upper-classmen, the purpose ski was<br />\npossible. A bus, however, will be<br />\nDr. Leiper's activities have taken LETTER. A pamphlet explaining the<br />\nrecently inducted into the present financial status, it will<br />\nof which is to determine the exact Tau Alpha Omega Fraternity and is have to be adopted next year. The hired to accommodate those who can- him throughout the world, and dur- national scope and theory of the<br />\nbe conveniently distributed in pri- ing the last few years he has made an<br />\nnumber of men who plan to support a member of the swimming team and majority of the freshmen have al- not<br />\nstrike accompanied each call.<br />\nvate<br />\ncars.<br />\nintensive study of the Church situaof the Science Club. Snyder is a ready paid their dues of two dollars.<br />\nCampus organizations invited to<br />\nthe Week.<br />\nChairman Blucher urged the sup- tion in Germany, both before and send representatives include the<br />\nmember of the Musical Club and a The additional dollar required would<br />\nHulAn option on the main ball-room<br />\ncandidate for the NEWS-LETTER staff. not be a strain commensurate with port of all Sophomores. \"In the mat- after Nazi Church regulations. In labaloo, the Barnstromer Club, the<br />\nof the Alcazar has been obtained, but<br />\nAt the meeting after the elections the expenses that they would have to ter of entertainment, we have tried 1930 he served as speaker for the non- Student Council, the Musical Club,<br />\nit was pointed out that those Seniors<br />\na new plan was broached which will undergo as seniors. The benefits are to please every one. We are provid- Roman American Church at the 400th the Cotillion Board, the Debating<br />\nwho had not signed up must do so at be voted upon at the next meeting. manifold, and special provisions can ing transportation and an excellent Anniversary of the Augsburg Confes- Council, the Science Club, the R. 0.<br />\nmeal at the cheapest price in years. sion, held at Augsburg.<br />\nT. C., Omicron Delta Kappa, the Inonce, if the option is to be retained.<br />\nThe plan provides that only seniors be made for those freshmen who do<br />\nHis undergraduate work was done terfraternty Board and the<br />\nwill be eligible to full membership in not expect to be in the class for the Your cooperation and support are<br />\nsix sociTariff of $10<br />\nneeded to insure the success of this at Amherst, and he graduated from eties not represented<br />\non the board<br />\nthe Club and allowed to wear the key. entire four years.<br />\nA tariff of ten dollars has been<br />\nthe Union Theological Seminary in<br />\nFreshmen who voted yesterday had affair,\" he concludeg.<br />\nIn their call for delegates, the orIt is hoped that this innovation will<br />\nlevied to cover the entire June Week remedy two present evils. It will the choice of going on the budget<br />\nA menu which boasts one pound of 1917 and also received his M A. de- ganizations which have already enactivities, which heretofore have in- make the Barnstormer Club more (fixed $3.00 dues) this year, or not. Roast Harford County Turkey on gree at Columbia the same year. He tered the committee stressed the<br />\nIn either case the scheme will be put each plate and second helpings upon was ordained a Presbyterian Minister need for cooperation in making the<br />\ncluded at least three dances, a beach \"exclusive\" than at present, and will<br />\nrequest, also includes shrimp and in 1915, but recently he has been more strike a success and expressed the<br />\nbecoming inactive into effect next year.<br />\nparty, beer gatherings, and an ex- prevent a member<br />\nLeroy Applefeld, treasurer of the crab<br />\ncocktails, cranberry sauce, active in Congregational circles.<br />\ndesire that the committee be as wideafter his ellection to the club if it be<br />\ntensive athletic program. Payment of<br />\nSince 1915 he has served in China ly<br />\nFreshman<br />\nClass,<br />\nand<br />\nBen<br />\nCourtright,<br />\nmashed potatoes, lima beans, Roquerepresentative as possible.<br />\nat the end of his sophomore or junior<br />\nsecretary, submitted the ballots to fort salad, ice cream and fresh straw- as a missionary, as as traveling secthe fee must be made by March 31st, yeEr.<br />\n\"Surely,\" the appeal concludes,<br />\nthe freshmen.<br />\nberries, and many other side dishes. retary of the Student Volunteer \"all Atudents<br />\nat which date a monetary fine of one<br />\nPlans are also being made to hold<br />\nare for peace and<br />\nMovement, as pastor of the Rutgers<br />\nagainst wasteful destruction of madollar will be added to the cost of the a stag within a few weeks. The comPresbyterian Church In New York,<br />\nterials and men. The menace of<br />\nticket. After April 15th a further rise mittee in charge of this undertaking<br />\nand with the Army Y. M. C. Ak in<br />\narmed conflict is the vital concern of<br />\nis composed of Brian Murphy, Frank<br />\nin prices will occur, with the addition<br />\nSiberia.<br />\nCrist and Herman Saul.<br />\neach one of us: Let us all cooperate.<br />\nHe is the author of \"Blind Spots,\"<br />\nof a penalty, if the fee is not yet paid.<br />\n\"Experiments in Cure of Race Prejudice,\" and numerous magazine arHullabaloo Asks Nine<br />\nticles on these and other subjects.<br />\nJames<br />\nEd.<br />\ncommittee<br />\nof<br />\ntwo,<br />\nS.<br />\nNote:<br />\nMorrow,<br />\nA<br />\nJr.<br />\nand<br />\nJ.<br />\nJudge<br />\nMehTo Complete Payments<br />\nling have ascertained the facts concerning the rejection of Earl Browder,<br />\nThe Hullabaloo announces that nine Communist presidential candidate, as Assembly speaker. This report at- Kirkley To Discuss<br />\nHead of Hopkins Institute Of History<br />\nhave neglected to pay the money tempts to draw no conclusions; it merely consists of a factual statement<br />\nmen<br />\nInstructor In Philosophy To Lead<br />\nMaxwell<br />\nAnderson<br />\nOf Medicine Talks At<br />\nissued<br />\nafter<br />\nof<br />\na<br />\nmonth<br />\ninvestigation.<br />\nthat is long due for their pictures.<br />\nDiscussion On \"Place<br />\nA. S. U. Meeting<br />\nAn address on \"Maxwell Anderson\"<br />\nSeven of them, who owe $3.00 each,<br />\nOf Religion\"<br />\nTo The Student Body:<br />\nassembly.<br />\nOne<br />\nmember<br />\nthe<br />\nof<br />\nBoard<br />\nfollowed<br />\ndramatic<br />\nby<br />\nreadings<br />\nwill<br />\nare Joseph Sarnovitz, Henry G. F.<br />\nDr. Henry L. Sigerist, director of<br />\nThe following is a history of events dissented.<br />\nbe tendered under the auspices of the<br />\nDr. Albert E. Blumberg, instructor Siems, James Lyle, Richard Love,<br />\nthe Institute of the History of Medileading up to the rejection of Earl<br />\nthis<br />\nFrom<br />\nit<br />\nappeared<br />\npresthat<br />\nJohns<br />\nHopkins<br />\nin<br />\nPlayshop<br />\nLatrobe<br />\nin philosophy at the Hopkins, will Theodore Ember, R. A. Baer, and Browder as assembly<br />\nspeaker by the sure had been brought to bear by the 120 tonight at 8:30. Lecturing on the cine, at the Johns Hopkins Medical<br />\nJohn E. Bamberger. The others who<br />\ndeliver the third in a series of talks<br />\nBoard of Control of the NEWS-LETTER: Administration on Mr. Diamond.<br />\nfamous Broadway playwright will be School, will be the guest speaker at<br />\nowe $2.00, are Robert McCarthy and<br />\nApproximately a month ago the<br />\nto the Fireside Discussion Club, on<br />\nOn February 9 a group of inter- Donald Kirkley, dramatic and music the regular meeting of the Hopkins<br />\nHerman Sody. ,<br />\nChapter of the American Student<br />\nYoung<br />\nCommunist<br />\nLeague<br />\nstudents, went to see Dr. Bow- critic of the Baltimore Sun.<br />\napested<br />\nPlace<br />\n\"The<br />\nof Religion<br />\nthe subject of<br />\nRobert Austrian, editor of the an- proached William<br />\nUnion on Thursday, March 18, at<br />\nDiamond,<br />\nediman<br />\nthen<br />\nas<br />\na<br />\nfact-finding<br />\ncommittee.<br />\nMr.<br />\nKirkley,<br />\na<br />\nHopkins<br />\nalumnus,<br />\nIn Modern Society,\" today at 4:15 nual, asks that these men get the<br />\ntor of the NEWS-LETTER, requesting This group consisted of Henry Leber, played with the Playshop during his 11:30, in Levering Parlor. Dr. Sigermoney in immediately, for they are<br />\np.m. at the Levering Hall Parlor.<br />\nthat it be allowed to sponsor an as- Maurice Shils, Walter Schlesinger, work here. Work with Gilbert and ist will speak on \"Spain--1937.\"<br />\nHis talk will be the first in a holding up some of the work on the sembly. (The NEWS-LETTER at that J. Judge Mehling,.Stanley Morton Fin- Sul/ivan<br />\nDr. Albert Blumberg, Instructor in<br />\noperettas and the Theatre<br />\nseries of three on religion, the other book.<br />\ntime had been given complete charge kel and James S. Morrow. Dr. Bow- Guild ensued, with correspondingly Philosophy at the Hopkins, will give<br />\ntwo of which will be given by Dr.<br />\nof four experimental assemblies by man welcomed the group, but re- favorable comment by critics. His a short talk on the political history<br />\nHoward A. Kelly and Dr. T. Guthrie Guttmacher's<br />\nthe 'Student Council.) Diamond ten- fused to discuss the question with reviews and comment in the Sun are of Spain, preceding Dr. Sigerist's<br />\nLectures<br />\nTo<br />\nSpears, pastor of the Brown Memorial<br />\ntatively approved the request, and two members of the committee, Shils held in high regard, and attract a talk. American Student Union meetBe Held In Remsen 1 the<br />\nChurch.<br />\nYCL submitted to him a list of and Schlesigner, because they stated large reading public.<br />\nings are open to all members of the<br />\nspeakers,<br />\nforemost<br />\nUniversity.<br />\namong<br />\nwhom<br />\nthat<br />\nalthough<br />\nthey<br />\nwere<br />\ninterested<br />\nDr. Isaiah Bowman delivered the<br />\nMiss<br />\nPatty<br />\nSingewald,<br />\nremembered<br />\nThe scene of Dr. Guttmacher's lecfirst fireside talk three weeks ago, tures on Human Reproduction has were Joseph Freeman and Earl in hearing what Dr. Bowman had to for her portrayal of the nurse in the<br />\nIn the last year Dr. Sigerist has<br />\nBrowder.<br />\nsay, their minds were already made recent presentation of \"The Father,\" been associated with the North Amerand last week Dean Berry spoke.<br />\nbeen transferred from Rowland 58 to<br />\nAt the next meeting of the Board up as to the faelts of the case.<br />\nwill be heard in the dramatic pre- ican Committee for the Aid of SpanStudents who wish to hear Dr. Remsen 1. Due to the extreme popuDr. Bowman invited two of the re- sentations. Miss Dolly Ashley and ish Democracy. He is a member of<br />\nBlumberg's lecture must sign up on larity of the course, Rowland accom- of Control of the NEWS-LETTER<br />\nsheets for that purpose in the post modations have become cramped for tike step taken by Diamond was maining four members of the group Martin Rude will also participate in the Baltimore Committee of the<br />\nunanimously approved by the Board, to meet Diamond, P. S. Macaulay, these presentations.<br />\noffice and Levering Hall. Only 20 the large attendance.<br />\nNorth American Committee, and he<br />\nbut the YCL was not informed of the Secretary of the University, and himstudents are admitted to the meeting.<br />\nis also a member of the National<br />\nThe course, under the auspices of<br />\ndecision.<br />\nself in order to ascertain the facts in<br />\nMedical Committee of the same orthe Hopkins branch of the American<br />\nRequests NYA Reports<br />\nOn his own initiative, Diamond the case. This meeting was to take<br />\nganization. It was this committee<br />\nStudent<br />\nUnion,<br />\nhas had audiences went to Dr. Bowman<br />\nAll-Mozart Concert April 28<br />\nfor advice in the place without the previous knowledge<br />\nMiss Judge has requested that all which recently sent over several amsteadily increasing in size.<br />\nmatter.<br />\nof Diamond as to what was to tran- NYA time reports for the month of bulances and doctors and nurses to<br />\nThe Friends of Music Society will<br />\nLast Thursday's lecture was not deThe following day another meeting spire.<br />\nMarch be turned into the office of Spain.<br />\npresent a concert on April 28 at Lev- livered, as Dr. Guttmacher, one of of the Board of<br />\nControl of the NEWSOn February 17, Mehling, Morrow, the Bureau of Appointments on or<br />\nThe Institute of the History of<br />\nering Hall. The program is to con- Baltimore's leading obstetricians, was LETTER was called<br />\nat which it was Diamond and Mr. Macaulay met Dr. before the following dates:<br />\nMedicine at Hopkins has become<br />\nsist of selections from the works of needed for an emergency operation. voted that Mr.<br />\nBrowder, who had Bowman in the office of the presiGraduate reports on Saturday, world famous under the leadership<br />\nMozart. Tickets will be on sale in Lectures are given every Thursday by that time<br />\n'been invited by the dent, and during the ensuing inquiry March 20.<br />\nof Dr. Sigerist, and the Hopkins Medthe main reading room of the library at 4 p.m. This week's lecture is on Young Communist<br />\nLeague, be re- Mr. Diamond made the following<br />\nUndergraduate reports on Monday, ical School is one of the few in<br />\nthe<br />\nfor 50 cents.<br />\n\"Male Adolescence.\"<br />\nfused permission to speak at the<br />\n(Continued on Page 3, Col. 2)<br />\nMarch 22.<br />\ncountry that has such a department.<br />\nThe results of the recent disturbances in the Dorimtory are<br />\nnow taking fruit in the proposal of<br />\nthe Student Council to return to<br />\nthe \"dormers\" a voice in their government to partially supercede the<br />\npresent system of proctors appointed by the University.<br />\nA Board of Governors, whose<br />\nmembership is to consist of one<br />\nrepresentative from each entry,<br />\nelected by the students in each,<br />\nwill be formed in the first week<br />\naftr the Spring vacation./<br />\nA member of the Student Council is to be chairman of this board,<br />\nthus placing all possible complaints concerning the Dorm in<br />\ntheir hands.<br />\nThe new board will not supercede the committe now in operation but will cooperate with it.<br />\nRead your NEWS-LETTER for developments.<br />\n<br />\nSupper Club Hears<br />\nRev.Leiper Tonight<br />\n<br />\nSnyder, Gidinsky<br />\nGet 'Stormer Posts<br />\n<br />\nCommittee Reports Findings<br />\nOn Browder Incident<br />\n<br />\nBlumberg To Speak<br />\nTo Fireside Group<br />\n<br />\nSigerist To Speak<br />\nOn Spain Thursday<br />\n<br />\n\fT<br />\n<br />\nHOMEWOOD, BALTIMORE, MARCH 16, 1937<br />\n<br />\n2<br />\n<br />\nof a new social order. Not only do we suggest this as<br />\na schedule for the Student Council, but we strongly urge<br />\nits adoption as consistent with the fundamental basis<br />\nof the Johns Hopkins University. Here is an opportunity<br />\nto show that our reputation as an unequivocable proponent of free speech and liberal though exist in fact.<br />\nIf our observance of student reactions is correct, we<br />\nare certain that we reflect the opinions of a considerable<br />\nnumber in asking that an extremist be made part of<br />\n$2.00<br />\nSubscription per year<br />\na balanced speaking program. At present the Young<br />\n$2.50<br />\nBy Mail<br />\nCommunist League has applied to the Student Council<br />\nfor permission to hold an assembly with Browder or<br />\nRemit subscription fees to Treasurer, Student. Activities Council, some other such representative as the speaker.<br />\nRemsen Hall, Postoffice, Johns Hopkins University.<br />\nThe chance of absolutely wiping out all doubt as to<br />\nthe policy of the administration, the NEWS-LETTER, and<br />\nEntered as second class matter December 3, 1909, at the Postoffice the Student Council is definitely here. Dr. Bowman has<br />\nin Ilaltimore, Md., under the Act of Congress, November 3, 1879.<br />\ngiven out the printed comment quoted on page one;<br />\nwe have voiced ours. What about the Student Council?<br />\n<br />\nIje3obtis jt)opkirtz<br />\n<br />\nletter<br />\n<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods by undergraduates of the Johns<br />\nHopkins University.<br />\n<br />\nEDITORIAL STAFF<br />\n<br />\nEditor-in-Chief<br />\n.<br />\nStanley Finkel<br />\nManaging Editors<br />\nJames Morrow, David Caplan .<br />\nSports Editor<br />\nBernard D. Pinck<br />\nAssistant Mangaing Editors<br />\nBenjamin Root, Wethered Barroll, Jr<br />\nAssistant Sports Editor<br />\nHarold Zheutlin<br />\nColumnist<br />\nPaul Berge<br />\nReporters—Max lskowitz, Nathaniel Finkelstein, Jewett Goldsmith,<br />\nHoward Reizenstein, Julian Adler, Carl Rasin, Leonard Rubinger,<br />\nMorris Wessel, Arthur Katz, Martin Krieger, Lester Rosenthal,<br />\nMurray Kempton, Victor Victoroff, Charles Diggs, William Burford, J. C. Handelsman, Mal Boshnack, Arnold Glantz, Joe<br />\nSamovitz.<br />\n<br />\nWilliam B. Kempton<br />\nMelville Locker<br />\nWm. C. Erlanger<br />\nGerald Willen<br />\nHoward Linkoff<br />\nNathaniel Soifer<br />\n<br />\nBUSINESS STAFF<br />\nBusiness<br />\n..<br />\n.<br />\nAssistant Business<br />\nAdvertising<br />\n_ Circulation<br />\nOffice<br />\nCopy and Filing<br />\n<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\n<br />\nOn The Literary Horizon<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\nwith a degree, supposedly fitted to lock Holmes,\" and the \"Mystery of<br />\ntake his place among the people of Edwin Drood,\" regrettably left unIt is frequently asked by college<br />\nfinished by the master Dickens, he<br />\nthe world about him, indicates that a<br />\nhas at last achieved his object. To<br />\nstudents, \"Why should I waste my<br />\ngreat deal of knowledge of human naquote from the note reputed to have<br />\ntime reading, anything?\" There then<br />\nture and getting along with people is<br />\nsent monthly to the publishing<br />\nfollows a long and impressive list of undeveloped and unappreciated. Nor been<br />\nhouse, he asked \"When are you nitreasons why there is little sense in a is it a subject which can be taught<br />\nwits going to do \"The Moonstone\" and<br />\ncollege man passing his valued hours from text-books. But it is gained \"The Woman in White\" in a single<br />\naway from study between the covers slowly and painfully through exper- volume—in a type that these tired old<br />\nience, require sometimes many more<br />\neyes can actually read?\"<br />\nof books, particularly fiction. They<br />\nyears than the results justify. Nor<br />\ntell us that a recent survey by Har- is college exactly the most ideal atAnd so, The Modern Library has<br />\nper's Monthly revealed the fact that mosphere for acquiring such experi- come forth with one of their remarkthe average American family buys ence, for a student moves in his lim- able \"giants,\" containing both these<br />\nless than two books a year, and reads ited circle, mostly among people as stories. They are by Wilkie Collins,<br />\nperhaps five; that there isn't any- immature as he, and although he may and were published first when Dickens<br />\nOf the<br />\nthing worth reading being published learn the lesson of that group, it is a himself was still alive.<br />\nwrites,<br />\nMr.<br />\nWoollcott<br />\n\"Moonstone,\"<br />\nhe<br />\ninto<br />\nwhich<br />\nworld<br />\nvery<br />\ndifferent<br />\nright now—that most of the modern<br />\nThe American Student Union should be given full supnovels are trash—and, amazingly plunges in the short few minutes of \"The 'Moonstone' was the first fullport in its petition to extend the lecure course on Human<br />\nlength detective novel. It is still<br />\nenough, that they don't get anything a Graduation Exercise.<br />\nReproduction to the permanent place of the Hopkins<br />\nprobably •the best.\" Indeed, he even<br />\nout of it.<br />\nBut in current fiction are paraded<br />\ncurriculum.<br />\ngoes so far as to suggest that the<br />\nThe survey results are surely not all the varied sorts of people, who<br />\nauthor of \"Edwin Drood\" was atThe widespread interest as well as need for such a<br />\ncalculated as a defense, but rather as exist in the minds of the author, and,<br />\ntempting to emulate the \"Moonsource is evident to anyone observing the attendance<br />\na statement of the appalling illiter- after a certain amount of reading is<br />\nstone,\" and died in the attempt.<br />\nand attitude of the audience every Thursday afternoon.<br />\nacy in the republic we are so com- accomplished, the critical appreciaEven though this is the first year of the lecture's existThe format is pleasing and easy to<br />\nplacently proud of. And, we must tion of these portrayals permits<br />\nas are all the Modern LIibrary<br />\nence, its bold and sensible attractions for the students admit, a large part of modern<br />\nnovels evaluation of their truth and value. read,<br />\nseem fairly steady and permanent.<br />\nand the price is standardized<br />\nbooks,<br />\nare trash, pure and simple. In fact, The whole picture of our day is reEveryone should get behind the movement to incor- an entirely too great proportion, but flected in the fiction of the period, and at $1.10. To those who have not read<br />\nporate this necessary feature of any college curriculum. there is no need to waste time with the constant reader acquires, second both of these, a recommendation is<br />\nBut we repeat that especially does it behoove the Hop- them, and there are certainly as many hand though it may be, a more tol- useless--they are as much required<br />\nreading as, if we may presume, some<br />\nkins to contain such a course because of its tradiion, truly great books being brought forth erant and understanding outlook.<br />\nthe works of Mr. Dickens. Those<br />\nof<br />\nfacilities, and student body.<br />\nin this day and age as ever there were,<br />\nAnd, to place it entirely on the<br />\nmodern auwhich includes the golden period of plane of pleasure, start that way, and who read avidly from<br />\nnot at<br />\nsuffering<br />\nthese<br />\nthors<br />\nfind<br />\nwill<br />\nRomantic literature. There is much read almost anything, so long as you<br />\nall in comparison—may indeed recoginfollow<br />\nThe<br />\nwill<br />\nrest<br />\nenough.<br />\nread<br />\nworth reading—appeat•ing now, last<br />\nnize the original source of many a<br />\nThe future of annual June Week depends upon the month, and next month. There al- evitably, as appreciation of a thing<br />\ntrick of the modern \"Scotstandard<br />\nsuccess of this year's attempt of the June Week Com- ways will be, forming a flexible pic- grows always with understanding.<br />\nland Yard School.\"<br />\nthe<br />\nraise<br />\nand<br />\noff<br />\nof<br />\ntake<br />\nblinders,<br />\nture<br />\nour<br />\nBooks<br />\nsociety<br />\nand<br />\nprogram<br />\na<br />\ntimes.<br />\nenterprise,<br />\nsheer<br />\nper<br />\nmittee to put through,<br />\nCongratulations, Mr. Woollcott!<br />\nAnd what does a student get out of curtains, even though there is freof festivities for which Hopkins men have declared themmerit<br />\nthem.<br />\nto<br />\nreal<br />\nlittle<br />\nquently<br />\nit? Aside from enjoyment, and an<br />\nselves overwhelmingly in favor.<br />\nBY WILLIAM BURFORD<br />\n<br />\nGet Behind It<br />\n<br />\nJune Week At Stake<br />\n<br />\nREPRESENTED FOR NATIONAL ADVERTISING ST<br />\nNational<br />\n<br />\nAdvertising Service, Inc.<br />\n<br />\nCollege Publishers Representative<br />\nNEW YORK. N.Y.<br />\n420 MADISON AVE.<br />\nSAN FRANCISCO<br />\npnnToN<br />\nC•.,c, C.<br />\nSrATTLF<br />\n<br />\n1936<br />\n<br />\nMember<br />\n<br />\n1917<br />\n<br />\nAssociated Colleesiate Press<br />\nDistributors ot<br />\n<br />\nCoffee Dieest<br />\nMember Of The<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nThis year's Committee inherited such a bad financial<br />\ncondition and reputation that the University put it entirely up to the students to make a financial success of<br />\nthis traditional period of celebration that would justify<br />\nits continuation in the future.<br />\nYou members of the Senior Class, have shown<br />\nyour earnest desire to continue June Week. It is up to<br />\nyou to support a policy to which you have given your<br />\napproval.<br />\n<br />\nThe June Week Committee is working hard to give<br />\nTUESDAY, MARCH 16, 1937<br />\nyou a good time after your Hopkins work is finished<br />\nthis spring. In order to continue their work, the Committee needs financial assurance that its work is not in<br />\nvain. Bradord has asked for this assurance in the form<br />\nLittle do students at the Hopkins appreciate the very of either the purchase of a June Week ticket, or a promdesirable and enlightened position of its campus news- ise to buy a ticket before March 31. Board members<br />\npaper in regard to faculty administration censorship. are contacting seniors with these written promises.<br />\nIt is fully in keeping with the Hopkins spirit and tradiLet's get behind June Week; show that we desire its<br />\ntion that the paper be a student one, student dominated, continuation by giving our full support. It is only by<br />\nand written editorially from a student viewpoint for doing this that the assurance will be given of financial<br />\nstudent interests.<br />\nsuccess, and without this assurance the June Week ComBut we do grasp our fortunate situation when we mittee cannot continue its plans.<br />\nobserve and hear of other college newspapers and their<br />\nrelative position. Recently we read a headline from<br />\nLafayette College's paper stating:<br />\n<br />\nWe Answer Now<br />\n<br />\nCENSORSHIP IS MODIFIED<br />\nAT FACULTY GATHERING<br />\nand the article reading:<br />\n\"Compulsory censorship of the editorial colurns of The Lafayette has been abolished by<br />\nfaculty action, and discretionary power to lift<br />\nthe existing censorship has been granted the<br />\ncommittee on publications, Dr. F. B. Hunt,<br />\nchairman of the Committee,announced to the<br />\nEditorial Board of Control yesterday.\"<br />\nThis ruling is not absolute as at the Hopkins, but it<br />\nis a large step in the direction of a free press.<br />\n<br />\nAbout A Free Press<br />\nIn reply to several letters which we have received and<br />\nthe many comments made a propos the Browder assembly situation, we state now that previously we had<br />\nwithheld our opinions entirely until the fact-finding committee had finished its work. The matter was too much<br />\nin doubt to warrant any comment until the actual facts<br />\nin the case could be gathered.<br />\nOn the front page can be found the report of an independent committee composed of two students who had<br />\nvoluntarily gone to an authoritative source to secure the<br />\nfacts of an incident about which the campus knew only<br />\na partial side, and conflicting rumors, and colored news.<br />\nWe had nothing to do with the committee. But<br />\nwe did know of its work, and we purposely restrained<br />\nany mention of the affair until the matter was cleared<br />\nup by the committee. In no case was there any deliberate suppression of news--by the administration or by<br />\nUS.<br />\n<br />\nAnother important consideraton here is in regard to<br />\nthe present administration set-up of the NEWS-LETTER.<br />\nA most important change has been made; there is a new<br />\neditor-in-chief. Even the editorial board is revamped. So<br />\nthe opinions expressed hare the conclusions of a new<br />\nNEWS-LETTER administration. Also now the Student<br />\nCouncil is officially and actually running assemblies.<br />\nThe NEws-LETTER plan is still being followed, and we<br />\nare continuing suggestions for speakers.<br />\nTo begin with, we accept the report of the committee<br />\nas factually sound. After all, the important points have<br />\nbeen made by the one person who is in the unique position of knowing. And besides we have the statement<br />\nfrom President Bowman declaring in no uncertain terms<br />\nexacly how he feels in the matter.<br />\nSo there is not much point in discussing post-mortems when little can be established and nothing can be<br />\ndone practically. The important things is the future<br />\nand the fundamental principle of a Hopkins tradition<br />\nand vertebrate of our reputation.<br />\nRight now we should like to follow President Bowman's opinion on the matter and suggest Earl Browder<br />\nor some other well-known and authoritative speaker<br />\nwho represents a similar viewpoint on a program which<br />\nis balanced by the other side or sides on the problem<br />\n<br />\nopportunity to get clear away from<br />\nhimself and surroundngs, perhaps the<br />\nmost valuable single gain is in critical appreciation of writing and the<br />\nsubjects. For . you meet a vast new<br />\nworld of types and situations in reading even five novels, selected very<br />\nmuch at random, and to decide whether they hold truth and value for you<br />\nis in itself a broadening exercise.<br />\nIn addition, it cannot be denied<br />\nthat the sad experience of many a<br />\nyoung person turned out of college<br />\n<br />\n• THE NEW<br />\n<br />\nMr. Woollcott Sponsors<br />\nMr. Alexander Woollcott, the amazingly effective Town Crier, whose<br />\nhuman comment delights a large<br />\naudience in written and spoken word,<br />\nhas singled out for his special praise<br />\na pair of detective stories which were<br />\nwell on their way to being forgotten<br />\nunder the weight of new mystery fiction which forms a large part of<br />\nAmerica's reading interest. Ranking<br />\nthem with the best of their kind—<br />\nthe immortal Conan Doyle's \"Sher-<br />\n<br />\nDENTISTRY<br />\nA Phase of Preventive Medicine<br />\nCollege Men find in it unusual<br />\nopportunities for a career<br />\nHARVARD UNIVERSITY<br />\n<br />\nPhi Beta Kappa members are never selected until<br />\nMarch of their senior year and because, together with<br />\nsenior Tau Betes, they compose the committee, Leonard<br />\nhas a month to prepare ground. He has started by<br />\nasking members of the engineering fraternity to begin<br />\nthinking along critical lines and in March, he expects<br />\nto make a formal call to the student body. It is essential<br />\n--because the committee has such a short lie—that<br />\nstudent complaints be matured and gathered in the<br />\nmoments Phi Betes are chosen, that tne committe may<br />\nswing immediately into action.<br />\nLeonard will take care that the Voice speaks well.<br />\nIt is the privilege of the student body to discuss and<br />\nconsider right now, the suggestions it may have to<br />\nmake next month.<br />\n---Lehigh Brown and White.<br />\n<br />\nLetter To The Editor<br />\nTo the editor of the NEWS-LETTER:<br />\nNow that Dr. Bowman has cleared up the issue by<br />\nsaying anyone was welcome as Assembly speaker as a<br />\npart of a balanced program, why not invite the rejected<br />\nextremist, Earl Browder, making it clear to the sensitive public that he is merely one of a group of talkers<br />\non the general subject, Modern Problems in Political and<br />\nSocial Reform? or some such title.<br />\nAs long as our b'hoys seem to have declared their<br />\nIntellectual curiosity in Mr. Browder and what he might<br />\nhave to say, this would be a solution to the problem<br />\ncreated by that curiosity, and with no injury to the<br />\nUniversiy; nor would it draw any objections from authoritative sources, if we believe Dr. Bowman.<br />\nIntelectualmente Curioso.<br />\n<br />\nBy<br />\n<br />\nAp<br />\ndance<br />\nbeen<br />\npresic<br />\nbanqt<br />\nmake<br />\nforth(<br />\nDamn<br />\n<br />\nfresh]<br />\n'It'd<br />\nornff<br />\nFro<br />\ncl<br />\n<br />\n!nate!<br />\nC<br />\nion,<br />\nhid J<br />\n<br />\nJeff l<br />\nHall,<br />\nZaver<br />\n<br />\nHerbs<br />\n<br />\nThe<br />\nt ion c<br />\n!lien,<br />\nFre<br />\n\"It th<br />\nthis V<br />\n<br />\nMu<br />\n<br />\nDENTAL SCHOOL<br />\nA competent course of preparation for<br />\nthe dental profession. A \"Class A\"<br />\nSchool. Write for catalogue.<br />\nLEROY M. S. MINER. D.M.D.. M.D.. Dean<br />\nDept. 9, 188 Longwood Ave., Boston, Mass.<br />\n<br />\nThe<br />\n<br />\nSUCCCE<br />\n<br />\nthe m<br />\n11111MEM<br />\n<br />\nApril<br />\non A<br />\n<br />\nMEM<br />\n<br />\nSchool<br />\nAt<br />\n<br />\n_e, also, had a<br />\n<br />\ntively<br />\nCray<br />\ntion<br />\n<br />\nvariou<br />\n<br />\nConsidered Criticism<br />\n<br />\nThe sudent body has a voice in faculty affairs. For<br />\nnine months in the year it is a mute voice, but, when it<br />\nspeaks, it is clear and effective.<br />\nBorn as recently as last March the Tau Beta Pi-Phi<br />\nBeta Kappa student criticism committee is already on<br />\na permanent basis. The president of the 1937 committee has just been appointed. He is Lehigh's Rhodes<br />\nscholar, Nelson Leonard, Tau Beta Pi member and president of Omocron Delta Kappa. His task is to see that<br />\nthe Voice speaks intelligently and wisely, and that it<br />\nis heard justly and honestly.<br />\nHis committee hears any and all reasonable complaints and criticisms, by students, of faculty members,<br />\ncourses, and other administrative affairs; votes on each<br />\nquestion, and passes on its decision and comments to<br />\nPreident Williams, who in turn, acts on the committee's<br />\ndecisions as his administration deems best. One important point not to be overlooked—all proceedings<br />\nare conducted in secreacy with absolutely no faculty<br />\ninterference. The results this committee achieves are<br />\nknown only by observation of any faculty changes or<br />\nmodifications which might have arisen from this criticism.<br />\n<br />\nFri<br />\n<br />\norgani<br />\n<br />\nGRAND TOUR<br />\n<br />\nMehlit<br />\n<br />\nRydst]<br />\n<br />\nTake a squint at the family archives over this<br />\nEaster vacation—the daguerreotypes of the<br />\nGrand Old Grad off on his GRAND TOUR, and<br />\nhis exuberant letters home: \"indescribable luxon ship\"...\"swift, eagle-like flight of pasuries<br />\n••••<br />\n,•••••.$•••••• .fts•<br />\n\"Nanio<br />\nsage\"...\"truly epicurean fare\"...\"hospitality<br />\nwedded indissolubly to perfection in seamanand \"the delightful fellow voyagers,among them one whose beauty makes me<br />\nship\"<br />\ntremble like an aspen leaf e'en as I pen these inadequate lines in her blushing praise.\"<br />\nOf course, the dears met on either HAMBURG-AMERICAN LINE or NORTH GERMAN LLOYD,<br />\nthose express services founded in 1847 and 1857 in the charming Hanseatic cities of<br />\nHamburg and Bremen.(Lots of adjectives, Greek Letter fraternities and romances have<br />\nhad this shipboard origin during the past 80 and 90 years.)<br />\n<br />\nthe North German Lloyd swift expresses BREMEN and<br />\nEUROPA, and palatial COLUMBUS; the Hamburg-Americcm<br />\nLine's Famous Four Expresses—NEW YORK,HANSA,HAMBURG,<br />\nDEUTSCHLAND wherein Cabin Class, even in the height of<br />\nseason, is only $171 up to Irish-English parts, with $5 more<br />\nto Cherbourg, $13 more to Hamburg.<br />\nTake Your Car Along...More than1400 with uslast year.Ideal<br />\ntouring abroad. Ask for booklet: \"Motorbridge to Europe\".<br />\n..that's consulting<br />\nLike having the Dean for a father-in-law.<br />\nwith our EDUCATIONAL SERVICE DEPARTMENT. All about<br />\n.Summer Courses Abroad and Specials in Arts and<br />\nSciences at German Universities(just like Grandfather did)<br />\nand all other matters concerning Students on Grand<br />\nTours. Personal Consultations arranged on your inquiry.<br />\n<br />\n90 PEARS<br />\n<br />\n\"THE<br />\nSERVICE ON<br />\n<br />\nCOLLEGE ORCHESTRAS<br />\non Summer Sailings<br />\nExpresses from New York midtown piers to mid-European<br />\nports—Cobh, Southampton,<br />\nPlymouth, Cherbourg,<br />\nHamburg or Bremen.<br />\n<br />\nEuropa . .<br />\nDeutschlanb<br />\nColumbus .<br />\nnew god; . .<br />\nBremen . . .<br />\nqamburg . •<br />\nEuropa . . •<br />\nfiansa . . •<br />\nDeutschlanb •<br />\nColumbus . .<br />\n•<br />\n<br />\nJune 19<br />\nJune 20<br />\nJune 26<br />\nJune 27<br />\nJune 30<br />\nJuly<br />\n<br />\n1<br />\n<br />\nJuly<br />\nJuly<br />\nJuly<br />\nJuly<br />\n<br />\n7<br />\n8<br />\n15<br />\n15<br />\n<br />\nQUICK —YOUR TRAVEL AGENT,<br />\nif you want to pick your accom-<br />\n<br />\nmodations in Cabin Class,<br />\nTourist or Third Classes. Delay<br />\nIs hazardous. Or inquire of—<br />\n<br />\nSEAS<br />\n<br />\nSERVICE ON THE sE.44<br />\n80 YEARS NORTH<br />\nGERMAN<br />\nLOY()<br />\n<br />\nMen a<br />\npresid<br />\n<br />\nof EUROPE<br />\n<br />\nFor these LINES set the pace of luxury-security-speed<br />\nthat leads right through the ages (with almost Fourteen<br />\nMillion passengers carried) into our 90th and 80th Anniversaries in the ultra modern way....<br />\n<br />\nAlla<br />\n<br />\nare th<br />\n<br />\nford J<br />\n<br />\nfice of<br />\n<br />\nAt I<br />\nClub<br />\nness ii<br />\nates it<br />\nmemb<br />\n4—<br />\n<br />\nth,<br />\n<br />\nWh2<br />\nStuder<br />\nevery<br />\nAnd s<br />\nThorm<br />\nbut<br />\nknow<br />\nAnd a<br />\nTER is<br />\nMake<br />\nWeak,<br />\nWhich<br />\nTER cc<br />\nreforn<br />\ntell m<br />\n<br />\nEve<br />\ni$ ano<br />\nways<br />\nMust<br />\nlike ti<br />\nOh Tc<br />\nleave<br />\nIne, 1<br />\nlag.\"<br />\n<br />\nTak<br />\nWhich<br />\nour is<br />\ndrums<br />\nphilosi<br />\nWande<br />\nsearch<br />\nIDumk<br />\n<br />\nHitler<br />\nway.<br />\n<br />\nto pie(<br />\n<br />\n323 North Charles Street, Baltimore<br />\n<br />\nDea<br />\nand I<br />\n<br />\n\fa<br />\n<br />\nHOMEWOOD, BALTIMORE, MARCH 16, 1937<br />\n<br />\nIncident<br />\nMcGovern Named Browder By<br />\nFactReported<br />\nFrosh Banquet Head Finding Committee<br />\nBy Dan Kirkwood<br />\nHamilton Heads Dance Committee Represented<br />\nWidely<br />\nAppointments to the freshmen class<br />\ndance and banquet committees have<br />\nbeen announced by Dan Kirkwood,<br />\npresident of the freshman class. The<br />\nbanquet committee is to plan for and<br />\nmake<br />\n<br />\narrangements regarding<br />\n<br />\nforthcoming<br />\n<br />\nthe<br />\n<br />\nbanquet.<br />\n<br />\nfreshman<br />\n<br />\nDances, as discussed at the recent<br />\nfreshman class meeting, will be planned and reported on by the dance<br />\ncommittee.<br />\nFrank McGovern has been appointed chairamn of the banquet committee. Serving under him are Maurice Conorey, Dick Green, Bob Vernon, Harry Brayshaw, Ray Cluster,<br />\nand John Billovits.<br />\nFraternities Represented<br />\nHeading the dance committee is<br />\neff Hamilton with committee John<br />\nHall, Hal Jaffee, Ernest Keiney, Joe<br />\nZavertnick, Ed<br />\n<br />\nLothian<br />\n<br />\nand<br />\n<br />\nJohn<br />\n<br />\nHerbst.<br />\nThese men represent a wide selection of fraternity and non-fraternity<br />\nInen.<br />\n<br />\nFreshmen will render their decision<br />\non the new budget system by vote<br />\nthis Wednesday.<br />\n<br />\nMusical Club<br />\nPlans Banquet<br />\nIlection<br />\n<br />\nFor Next Year's<br />\nTo Be Held At<br />\nBanquet<br />\n<br />\nOfficers<br />\n<br />\nThe culmination of one of the most<br />\nsuccessful season ever enjoyed by<br />\nthe musical club will be its banquet<br />\nApril 15th preceded by a final concert<br />\non April 9 at the Catonsville High<br />\nSchool Catonsville, Maryland.<br />\nAt the banquet, which is tenta-<br />\n<br />\ntively<br />\n<br />\narranged to be given at the<br />\n<br />\nray Goose Inn, Baltimore, an election will be held for positions on the<br />\nvarious staffs and divisions of the<br />\norganization.<br />\nAllan Pinkerton and John Ghinger<br />\nare the nominees for president. Three<br />\nmen are nominated for the two vicepresidential offices. They are Bud<br />\nMehling, Harry Hopkins, and Herb<br />\nRydstrom. Thomas Ellis and Bradford Johnson are running for the office of Business Manager.<br />\nAt the last meeting of the Musical<br />\nClub J. Judge Mehling, present business manager of theClub who graduates in June, was appointed ex-officio<br />\nmember of the Business Staff.<br />\n•<br />\n<br />\n.<br />\n•••••••,111..M./..-.11...!..411.,•••••••••••••••••11,-.N<br />\n<br />\nSuperfluosity<br />\n'<br />\n<br />\no the Editor of the NEWS-LETTER:<br />\n<br />\nWhy is it there are so many funny<br />\nstudents here? They are found in<br />\nevery corner of the Halls of Hopkins.<br />\nAnd so many of them, too. There is<br />\nThomas Dukehart, Algernon Mimby<br />\n-but why go into details? You must<br />\nknow what I mean. So many . . .<br />\nAnd another thing, if the NEWS-LETTER is going to exist, why doesn't it<br />\nmake a healthy attempt at it. So<br />\nweak, so futile, this world of ours in<br />\nWhich the Johns Hopkins NEws-LETTEE could play such a healthy part in<br />\nreforming it, but just won't. Can you<br />\ntell me, dear Editor, why this is?<br />\nEverybody is always talking. That<br />\nis another point I wish to make. AlWays talking. And saying nothing.<br />\nMust this go on? There is no saying<br />\nlike the one which says: \"That this<br />\nOh Too Solid Flesh would melt, and<br />\nleave the world to darkness and to<br />\nme, Graves Energy notwithstanding.\"<br />\nTake all the pseudo-philosophies<br />\nWhich are stuffed ram-jammy into<br />\nour innocent and unsuspecting eardrums, and there you have it. My<br />\nPhilosophy of Life. Me. A weary soul<br />\nWandering through the centuries in<br />\nsearch of piece. And what do I get.<br />\nDumkopfs with pipe dreams. Like<br />\nHitler and Mrs. Reuben Ross HalloWay. People who hate what they got<br />\nto pieces and want us to have it.<br />\nDear editor, Hurrah for the Black<br />\nrid Blue!!<br />\n<br />\nGREEK LETTER NOTES<br />\nGREEK LETTER NOTES<br />\n<br />\nBy SEYMOUR SACKS<br />\nDeadline for articles to be printed<br />\nMehling And Morrow Release Facts;<br />\nin the column is each Friday afterAttempt To Draw No<br />\nnoon. Communications should be adConclusions<br />\ndressed to Box 1026 or to the NEWSLETTER office.<br />\n(Continued from Page 1, Col. 4)<br />\n* * *<br />\nstatements in answer to questions by<br />\nKAPPA ALPHA<br />\nDr. Bowman:<br />\n1. \"Dr. Bowman definitely did not<br />\nDon Wooden was recently elected<br />\nrefuse permission to anyone to speak Number I of the local chapter of<br />\nat an assembly. I have repeated more ICA.. Charles Councilman and Bill<br />\nthan once that neither Dr. Bow- Schmied were chosen Numbers II<br />\nman, Mr. Macaulay, nor Dean Berry and III respectively. These men will<br />\nrefused to permit anyone to do so.\" assume office at the joint installation<br />\nIt was disclosed that at no time of officers for this province.<br />\nduring the discussion between DiaIt seems that the Soph Engineers<br />\nmond and Dr. Bowman was the name didn't enjoy themselves at one of<br />\nof Earl Browder mentioned by Dia- Kappa Alpha's tea dances Sunday<br />\nman, and that both Dr. Bowman and afternoon. The reason? A Materials<br />\nMr. Macauley understood when ap- quiz on Monday.<br />\nproached by Diamond that nobody<br />\nannounce the<br />\nThe frater also<br />\nhad yet been invited to speak. Dia- pledging of Lindsay Scheer to the<br />\nmond told Mr. M.acauley that no in- Fraternity.<br />\nvitation had been issued.<br />\n* * *<br />\n2. Questioned as to whether Dr.<br />\n• Holt Maulsby, head of the S.A.C.;<br />\nBowman said extremists and comFrank Crist, Barnstormer business<br />\nmunists were not welcome on the<br />\nmanager, and Billy Erlanger, ancampus, Diamond said: \"As I recall,<br />\nother member of the S.A.C.—all of<br />\nDr. Bowman and Mi.. Macaulay said<br />\nwhich positions iinvolve the handling<br />\nthat personally they did not think it<br />\nof finances—have each just purchased<br />\ndesirable for people of that calibre<br />\nPlymouth convertible coupes. Nice<br />\nto speak at an assembly, unless the<br />\nwork, b'hoys.<br />\nassembly program be balanced by<br />\n*<br />\nspeakers with different ideas on that<br />\nTAU ALPHA OMEGA<br />\nparticular subject.\"<br />\nDiatold<br />\nBowman<br />\nAlvin Savage was elected Chancel3. Asked if Dr.<br />\nmond to tell the Student Council that lor of TAO last week. Other officers<br />\nit was unconstitutional for the S. C. are Sigmund Safier, Vice-chancellor;<br />\nto delegate assemblies to the NEWS- Max Iskowitz, Treasurer; Harry NierLETTER, Diamond answered: \"No.\" enberg, Scribe; and Jewett Gold4. Asked by the fact-finding com- smith, Historian.<br />\nA banquet and dance for members<br />\nmittee if he had called Diamond in to<br />\nBrowder, Mr. Macaulay of the Fraternity will be thrown a<br />\ndiscuss<br />\nstated: \"Mr. Bowman informed me<br />\n•<br />\nthat Diamond had a problem he wished<br />\nto discuss, and I asked Diamond in. I<br />\ndid not know of the nature of the<br />\nproblem before I spoke to Diamond.\"<br />\n5. Diamond stated: \"I definitely<br />\ntook the initiative in discussing the<br />\nwhole assembly question with Dr.<br />\nBowman.\"<br />\n6. The committee asked Dr. Bowman why he declined to write to<br />\nWoodring, Secretary of War, asking<br />\nhim to speak here, after the Browder question came up. Dr. Bowman<br />\nsaid: \"I called in Hershner Cross<br />\n(president of Student Council) and<br />\ntold him that I couldn't write to<br />\nWoodring because this might imply<br />\nthat I was willing to write to Woodring and not to Browder.<br />\n7. Diamond said: \"When the Young<br />\nCommunist League approached me<br />\nabout an assembly, I found a date,<br />\nchecked on names, and said that the<br />\nNEWS-LETTER Editorial Board would<br />\nprobably 0. K. the assembly. I do<br />\nnot recall whether or not I said that<br />\nthe Y. C. L. could go ahead and send<br />\nthe invitations, but I do know that I<br />\ntold them that the final decision<br />\nwould depend upon the Editorial<br />\nBoard.<br />\n8. Finally, the committee asked<br />\nDiamond if Dr. Bowman brought<br />\npressure to bear by asking Diamond<br />\nto hear his opinion or in any other<br />\nway. Diamond said: \"I took the initiative in asking the personal opinions of the Administration on this<br />\nquestion, and I have repeatedly said<br />\nthat neither Dr. Bowman, Mr. Macaulay, nor Dean Berry said that we<br />\nmust not have Browder, or any one<br />\nelse.\"<br />\nDr. Bowman said: \"My position in<br />\nte matter is, if you're going to have<br />\nan assembly program and invite any<br />\nextremist, Right or Left, make sure<br />\nin your announcement that the University is not endorsing the cause of<br />\nan extremist.<br />\n\"If you're going to have an extremist, why not announce him as part<br />\nof a balanced program?\"<br />\n<br />\nShipment By Express<br />\nPopular Among Students<br />\n\"Getting away from college, reaching'home and seeing to the safe transportation of baggage containing precious mementos of college days are the<br />\nchief concerns of the thousands of<br />\ncollege men and women who are now<br />\nleaving for Easter vacations,\" C. R.<br />\nGraham, Vice President of the Ralway Express Agency., said today.<br />\n\"The students take care of themselves, but the Agency has been increasingly active each year, in taking<br />\nover the job of calling for trunks and<br />\nseeing to it that they are speedily dispatched to their destination. The<br />\nfeature of pick-up and delivery appeals to the young men .and women<br />\nwho wish to dash from dormitories to<br />\ntrains, without having to worry<br />\nabout their baggage,\" Mr. Graham<br />\nstated.<br />\n<br />\nweek after the initiation of Leon Quitt,<br />\nDaniel Gidinsky, and Joe Samovitz<br />\non March 13.<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nDELTA PHI<br />\nSt. Elmo has spring in their bones<br />\nand lead in their—pencils. So God<br />\nhelp the women. The boys are saving<br />\ntheir money and building up their<br />\nsystems to withstand the frivolities<br />\naccompanying the forthcoming pointto-points in the Valley.<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nBETA THETA PI<br />\nThe Betas are denying any rumors<br />\nto the effect that some of them were<br />\ntarred and feathered last week. They<br />\nclaim that the truth of the matter is<br />\nthat while they were tarring the roof,<br />\nthe wind played some tricks on them.<br />\nMoe Bradford, Master Beta, has<br />\nbeen so successful in planning social<br />\nfunctions for the school, that the boys<br />\nhave entrusted their social gatherings at the fraternity house to him.<br />\nYe olde Beta House is in A-1 shape<br />\nthese days. With new curtains, new<br />\nwallpaper, fancy paint jobs, and no<br />\nleaks in the roof, she's a sight for<br />\nsore eyes.<br />\n* * *<br />\n<br />\nit GOESI<br />\n<br />\nYour<br />\n<br />\nVacation<br />\n<br />\nworry,<br />\nfuss or<br />\nwithout any<br />\nnation-wide<br />\nlast,<br />\naway<br />\nback. by<br />\nbaggage gets<br />\nand<br />\nconvenient-it home<br />\nship<br />\nsure and<br />\npiup<br />\ncksale,<br />\nwhen you<br />\nSwift,<br />\nt<br />\nEZrellS.<br />\nRemember, promp<br />\nand<br />\nRailway<br />\ncities<br />\ncost.<br />\neconomical<br />\ncharge, in all<br />\nspecify<br />\n03Ctre.<br />\nat low<br />\nto<br />\nWitUOUli<br />\nsure<br />\ndelivery,<br />\nof<br />\nservice (be<br />\nand<br />\nnearest office<br />\ntowns. For<br />\nthe<br />\nprincipal<br />\ncall), phone<br />\nto<br />\nexact time<br />\nthe<br />\n<br />\ntold<br />\n<br />\nPHI SIGMA DELTA<br />\nThe Phi Sigs are resuming their<br />\npolicy of holding at least one weekend party each semester. They claim<br />\nto be the only frat on the campus at<br />\nwhich out of town girls stay during<br />\nsuch an affair—with a chaperon, of<br />\ncourse.<br />\nMilt Tuerk was appointed manager<br />\nof the year's soft ball team, which<br />\nthe fraternity is entering into the<br />\nleague<br />\n<br />\nCharles & Fayette Sts.<br />\nVernal 0600<br />\n<br />\nDepot Office: 208 E. Franklin St<br />\nVernon 0600<br />\nBaltimore, Md.<br />\n<br />\nPA!LWA<br />\n<br />\nXPRES's<br />\n<br />\nGEISCY.<br />\nAGENCY N. JINC.<br />\n<br />\nNATION - WIDE<br />\n<br />\nRAIL- AIR<br />\n<br />\nSERVICE<br />\n•<br />\n<br />\nRuby Keeler says:<br />\n<br />\n\"Luckies are a light smoke that treat a<br />\ntender throat right\"<br />\n\"In a way, it's easier to keep in condition as a dancer than as a singer.<br />\nExercise can keep the muscles in<br />\nshape, but there are a lot of things<br />\nthat can go wrong with the voice and<br />\nthroat. It stands to reason, then, that<br />\nany actress wants a cigarette that is<br />\ngentle and strikes the right note with<br />\nher throat. I started smoking Luckies<br />\n4 years ago. They're a light smoke<br />\nthat treat a tender throat right.\"<br />\n<br />\nLOVELY WARNER BROS.STAR<br />\nNOW APPEARING IN<br />\n\"READY, WILLING AND ABLE\"<br />\n<br />\nAn independent survey was made recently<br />\namong professional men and women—lawyers,<br />\ndoctors, lecturers, scientists, etc. Of those who<br />\nsaid they smoke cigarettes, more than 87% stated<br />\nthey personally prefer a light smoke.<br />\nMiss Keeler verifies the wisdom of this preference, and so do other leading artists of the<br />\nradio, stage, screen and opera. Their voices are<br />\ntheir fortunes. That's why so many of them<br />\nsmoke Luckies. You,too,can have the throat protection of Luckies—a light smoke,free of certain<br />\nharsh irritants removed by the exclusive process<br />\n\"It's Toasted\". Luckies are gentle on the throat.<br />\n<br />\nTHE FINEST TOBACCOS\"THE CREAM OF THE CROP\"<br />\n<br />\nA Light Smoke<br />\nit's Toasted\" Your Throat Protection<br />\nAGAINST IRRITATION—AGAINST COUGH<br />\nCopyright 1937, The American Tobacco Company<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MARCH 16, 1937<br />\n<br />\nIntramural Boxing Tourney<br />\nClimaxed By Crowning Of<br />\nFour New School Champions<br />\nWinners In Each Division<br />\nTo Receive Gold<br />\nCharms<br />\n125<br />\n145<br />\n155<br />\n175<br />\n<br />\nlb.<br />\nlb.<br />\nlb.<br />\nlb.<br />\n<br />\nClass R. H. Reynolds<br />\nClass- Elmer Almquist<br />\nClass-Harry Brayshaw<br />\nClass -\"Reds\" Richards<br />\n<br />\nTHIS SPORT WORLD<br />\nii<br />\n<br />\nBLA CK<br />\nAND<br />\n<br />\nBLUE<br />\nBY HAL ZHEUTLIN<br />\n<br />\nSportlight<br />\n<br />\nSynopsis Of Intercollegiate Sports In Various States;<br />\nPitt Battles Temple For Top Honors<br />\nAs intercollegiate Conference Ends<br />\n<br />\nPittsburg, Pa.-As the Eastern In- ling in the Middle Atlantic State<br />\ntercollegiate Basketball Conference Tournament. They scored 26 points<br />\ndraws to a close, Pitt is battling Tem- to defeat Gettysburg.<br />\nple for top honors. Temple held the<br />\nChicago,<br />\nan eastern tour,<br />\nforemost position, but Temple's upset<br />\nDe Paul University copped two of<br />\nby the Mountaineers from the Unithree court games. Victories were<br />\nversity of West Virginia enabled Pitt<br />\nmarked up over St. Johns of Brookto deadlock the Philadelphia team.<br />\nlyn and St. Joseph.<br />\nBethlehem, Pa.-Lehigh wrestlers<br />\nUniversity of Richmond, Va.completed their dual meet season<br />\nwith a 21-15 victory over Navy. The Richmond's star, Bill Lumpkin, after<br />\nmatmen of the University of Lehigh competing in the Maryland-Fifth<br />\nRegiment track meet, was invited to<br />\ncopped five of the eight bouts.<br />\nAlfred, N. Y. - - Playing its last enter a collegiat meet at Notre Dame.<br />\nmatch, the court men of Alfred Uni- Lumpkin holds the two-mile record<br />\nversity dropped a 38-35 to Colgate. of the Maryland meet.<br />\nAnnapolis, Md.-On an all-star<br />\nThis lost broke Alfred's seven game<br />\nwinning streak.<br />\nbasket ball team, Paul Menton, sports<br />\nDetroit, Mich.-The University of editor of the Baltimore Sun, placed<br />\nDetroit cagers chalked up another two St. John's cagers on his team.<br />\nwin by downing De Paul University Lambros, high scoring forward, and<br />\n29-24. It was Detroit's ninth win De Lesio, guard, were honored by<br />\nagainst four setbacks.<br />\nMenton. A strong fencing team repEaston, Pa.--Starting track early, resenting St. Johns with a record of<br />\nLafayette opened its season with a seven wins and no defeats left on a<br />\n61-39 victory over Swarthmore. La- southern tour. They will play Wilfayette's matmen also were victorious liams & Mary, Rollins, Georgia Tech,<br />\nin intercollegiate competition wrest- , North Carolina and V. M. I.<br />\n<br />\nWinter Rears Its Ugly Head<br />\nGlancing about we notice that Old<br />\nThe Intramural Boxing Tourna- Man Winter refuses to yield his doment held under the direction of the main to the ever-encroaching spring<br />\nIntramural Committee was conducted and the mass of sports mentors are<br />\nlast Thursday at the gymnasium. Al- in a perplexing position. Continual<br />\nthough there were not enough fighters snowfall and persistent cold weather<br />\npresent to allow bouts in each class, has confined eager athletes to the inthere were a number of matches in doors. Coach Kels Morrill and his<br />\nrugged stickmen are preparing to<br />\nfour divisions.<br />\nthat coveted national crown<br />\ncapture<br />\nHuffman<br />\nH.<br />\ndivision<br />\nlb.<br />\nIn the 125<br />\nwas drawn to fight A. H. Smith, by working out on the gymnasium<br />\nwhile R. H Reynolds was given a floor. Coach Bob Owings and his<br />\nbye. Huffman won his initial scrap diamond stars are forced to take their<br />\nballs and bats to the Gilman cage.<br />\nby scoring a technical knockout over<br />\nCoach Waldo Hambleton has hopes of<br />\nSmith in the second round of their<br />\ntraining his cinderpath enthusiasts<br />\nscheduled three-round fracas. Howat a local indoor track. Coach Jean<br />\nclass<br />\nthis<br />\never, in the final bout of<br />\nHofmeister finds there is little hope<br />\nHuffman met his superior in Reynaexercising his tennis group among<br />\nfor<br />\nolds. The referee's card awarded<br />\nthe snow-flakes.<br />\nReynolds 30 points for the three<br />\nAre Jays Sissies?<br />\nrounds to Huffman's 26.<br />\nIn the past few years boxing has<br />\nLyman Weakens<br />\nmade notable strides in collegiate cirElmer Almquist scored a decisive<br />\ncles and has now manifested itself as<br />\ndecision over John Lyman to capture<br />\none of the foremost winter activities.<br />\nthe 145 lb. title. Lyman started out<br />\nNo doubt boxing will go far and soon<br />\nwell but seemed to wear down as<br />\nConcludes<br />\nwill reach a par of commercialism 1 9 3 7 Season<br />\nthe battle progressed. It was Almonly surpassed by the king of all,<br />\nWith Sherman, Peale,<br />\nquist's better physical condition that<br />\nfootball. With such a growing interenabled him to carry off the prize.<br />\nAs Stars<br />\nest in the technical skill of fighting,<br />\nThe scoring was as follows: 10-10it should seem strange that none has<br />\n10 for Almquist and 9-8-9 for Lyrpan.<br />\nspread to Hopkins. The crux of the Team Records Four Losses<br />\nThe 15g lb. battle between Harry<br />\nwhole matter is that a disappointingly<br />\nAgainst Two Wins;<br />\nBrayshaw and W. Freyer was ansmall number of students participated<br />\nother close contest with Referee Ed<br />\nSt. J. Victors<br />\nin the annual intramural boxing<br />\n_<br />\nLotz giving Brayshaw the nod with<br />\nchampionships. So few in quantity<br />\n30 points to 27 for Freyer.<br />\nJohns Hopkins fencing team<br />\nThe<br />\nwere they that it's an injustice to conStiff Battle<br />\nsider those, who so gamely took part finished its 1937 fencing season on<br />\nThe Richards-Gillelan battle for the<br />\nas crowned title holders. It is hoped March 5 at home when it just fell<br />\n175 lb. championship proved the<br />\nthat next year boxing will achieve the short of a victory against Virginia<br />\nclosest of the entire tourney. Richards<br />\nattention it rightfully deserves.<br />\nMilitary Institute. The match ended<br />\noutslugged his erstwhile opponent to<br />\nOur Slim Chances<br />\ngain a 10-6 margin in the first round,<br />\nwith a score of 9-8.<br />\nIn the past few weeks the newsbut Gillelan staged a brilliant comeThe first bout for the J.H.U. fencers<br />\npapers have been exposing, as it were,<br />\nback in he second round to get the<br />\nthe championship possibilities of St. was against Maryland on Jan. 15<br />\nreferee's choice at 10 points to eight.<br />\nJohn's, Maryland, etc., in lacrosse.<br />\nwhich ended in a narrow margin for<br />\nIn the final and deciding round \"Reds\"<br />\nSpeaking for the Hopkins, let us say,<br />\nRichards managed to eke out a two<br />\nAlaryland to the tune of 9-8. The boys<br />\nin an unbiased (?) way, the Blue<br />\npoint margin and the title.<br />\nshowed<br />\nplenty of skill and spirit but<br />\npossibilities,<br />\nhowhave<br />\nJays, it seems<br />\nThere were no bouts in the 135<br />\never slight as they may appear to the not enough to overcome the Marylb., 165 lb., and heavweight classes<br />\nsports writers. Are Swindell, Kobl, landers. The J.H.U. men dropped anbecause the coptestants failed to<br />\nSiegal, Naylor, Ghinger, Kaufman,<br />\nother game to St. Johns on Feb. 9 at<br />\nshow up. Millard Kaufman, a 165<br />\nYearley, Melvin, Hines, Dukehart,<br />\npound and considered the best boxer Beeler, Bernnheim, Mewshaw, Love, Annapolis However the foilers made<br />\nin the school, was present but because Kempton<br />\nand Blucher slight? Not a comeback on Feb. 17, against Maryhis opponent, Phil Greenberg, was<br />\nquite-you ought to see them throw land, 14-13. Sherman, Peale, and<br />\nnot available, so he was unabled to<br />\nsnowballs!<br />\nSmall starred in that match; Sherbe accorded the title of his class.<br />\nman won 3 out of 3 in saber and 2<br />\nThe winners in each division will<br />\nout of 3 infoils while Small won 3<br />\nbe the recipients of a gold charm<br />\nout of 5 In foils. Several substitutes<br />\nthe contribution of the Intramural<br />\nwere used in this affair.<br />\nCommittee.<br />\n<br />\nBlue Jay Fencers Lacrosse Men Get<br />\nLose To V.M.I., 9-8 New 1937 Rulings<br />\n<br />\nBaseball Practices<br />\nContinue At Gilman<br />\nCountry School Cage<br />\n<br />\nTwo Matches ByMail<br />\nPractice Sessions Guided By Coach<br />\nRiflemen To Shoot Bob Owings; First Game Two<br />\n<br />\nHowever, the fencers bowed to<br />\nNavy on Feb. 20, 10-7. In this match,<br />\nSherman and Small proved their ability at the foils both winning all of<br />\ntheir matches in the foil division.<br />\nThen on March 5. Hopkins was defeated by Virginia Military Institute 9-8. The J.H.U. boys leaped into<br />\nthe lead by v4nning' the first 5<br />\nmatches Theye were unable to keep<br />\nthe pace and netted VM.I. a victory.<br />\n<br />\nFaceoff And Offside Penalties<br />\nAre Changed At Meeting Of Association<br />\nMen Are Confined To Two<br />\nDefinite Areas On<br />\nField<br />\nAt a meeting of the Intercollegiate<br />\nLacrosse Association, the rules committee, at the suggestion of \"Father<br />\nBill\" Schmeiser, passed several rulings which will go into effect in this<br />\nseason of 1937.<br />\nThe first ruling concerns the face<br />\noff. The old ruling provided for three<br />\nmen behind the center line. The new<br />\nprovision provides for \"all cases<br />\nwhere the ball is forced in the center of the field each team shall confine the goal tender and two other<br />\nplayers in the defense goal area, two<br />\nplayers in the attack goal area and<br />\none player in each of the two wing<br />\nareas.<br />\nWhen the whistle sounds<br />\nstarting play, the players shall be immediately released from the two<br />\nareas.\"<br />\nFor infraction of the offside rule<br />\nthe penalty is 30 seconds instead of<br />\nthe former 60 second layoff.<br />\n<br />\nIntramurals<br />\nTomorrow afternoon, three intramural teams consisting of the winners<br />\nof the graduate volley ball league,<br />\nthe interclass basketball league the<br />\nfraternity basketball league, will go<br />\nextra-mural when they meet the University of Maryland at College Park.<br />\nThe Kappa Sigs will represent the<br />\nHopkins in the frat basketball match<br />\nwhile the Chemistry team will play<br />\nthe volley ball game. At the same<br />\ntime, the representative badminton<br />\nteam will meet the University of<br />\nMaryland at the Hopkins gym.<br />\nOn Thursday, a Western Maryland<br />\nVolleyball team and Handball squad<br />\nwill be entertained by the Jays at<br />\nHomewood in the afternoon.<br />\n<br />\n--Weeks Away<br />\nUniversity of Hawaii R. 0. T. C.,<br />\nVarsity baseball practice was held<br />\nU. of California Are<br />\nSaturday at the Gilman Country<br />\nlast<br />\nOpponents<br />\nSchool cage under the active guidance<br />\ngathThe Hopkins rifle team will meet of Coach Bob Owings. A smaller<br />\nbepresent<br />\nwas<br />\nweek<br />\nlast<br />\nthan<br />\nering<br />\nits final competition after vacation<br />\nwhen it will shoot matches by mail cause of the inclement weather.<br />\nThose who participated in matches<br />\nThe practice was mainly devoted to<br />\nwith the University of Hawaii<br />\nduring<br />\nthe past season are Captain<br />\nposipitching<br />\nR. 0. rg. C. and the University of Cali- the candidates for the<br />\nPeale<br />\n(sabre), Sherman, three<br />\npositions.<br />\nA<br />\ninfield<br />\nthe<br />\nfor<br />\nand<br />\ntions<br />\nfornia rifle teams on April 10.<br />\nweapon<br />\nman, Small, Silver, Reed, and<br />\nheld within the<br />\nOn March 13 the Jay team lost two practice game was<br />\nHormel, foil, Davis epee and Harris<br />\noutfieldservices<br />\nof<br />\nthe<br />\nwithout<br />\ncage<br />\nmail matches, one to the University<br />\nsabre.. The team was under the capaof Missouri by a score of 1430 to 1362 ers, substituting the nets for the fly- ble<br />\ndirection of Paul Kaiss.<br />\nchasers.<br />\nand the other to the Indiana UniverPractice<br />\nDrill<br />\nsity R. O. T. C. sharpshooters to the<br />\nLen Rubinger, veteran hurler and<br />\ntune of 1354-1325. Lindenmayer was<br />\nMilberg, bolstered the showing of<br />\nIra<br />\nhigh scorer for the losers with a tally<br />\npitching staff with high hopes<br />\nthe<br />\nof 278 in each match.<br />\nthe other candidates who did<br />\nheld<br />\nfor<br />\nThe score card shows 16 wins and<br />\nconsidering<br />\nthe lack of practice.<br />\nwell,<br />\n16 losses for the Black and Blue this<br />\nA spirited infield drill was held Records Show Jays To Be On Par With Other Schools<br />\nseason. The team lost only two of<br />\ngame. Clisham and<br />\nits seven shoulder to shoulder after the practice<br />\nIn Minor Amateur Play; Won<br />\nHarthe, first baseman and shortstop,<br />\nmatches.<br />\n140 Games And Lost 136<br />\nrespectively, showed up well in practice with Alperstein, Romanofsky,<br />\nThe records of the varsity major<br />\n'34-35 '35-36 '36-37 Total<br />\nTennis Schedule<br />\nTraggis and Price alternating at the<br />\nW.L. W.L. W.L. W.L.<br />\nand minor teams aid only to make<br />\nother infield positions.<br />\n2 6 0 5 1 6 3 17<br />\nApril 9----J. H. U. vs. Swarthmore.<br />\nTh next practice will be held today evident the fact that the Hopkins is Football<br />\n4 11 2 12 8 10 14 33<br />\nAt home.<br />\nat the field near Levering Hall, if the able to hold its head athletically as Basketball<br />\n3 2 4 2 .. . 7<br />\n4<br />\nLacrosse<br />\nApril 16-J. H. U. vs. Duke. At home. weather permits. In case of bad<br />\nhigh as the all-tooted and praised<br />\nApril 23--J. H. U. vs. Lehigh. Away. weather notices will be posted for the<br />\n9 19 6 19 9 16 24 54<br />\nTotals<br />\nApril 24- -J. H. U. vs. Lafayette<br />\nnext meeting of the team. With the subsidized teams.<br />\n7 0 7 1 2 1 16<br />\n2<br />\nThe only sports with continual glar- Fencing<br />\nAway.<br />\nfirst game against Towson only two<br />\n1<br />\n3 3 3 5 4 3 10<br />\nApril 27-3. H. U. vs. St. John's. At weeks away, baseball hopefuls are ing misfortune are those of football Wresting<br />\n4 0 5 1 8 1 17<br />\n2<br />\nlooking for a break in the weather so and perhaps basketball, although the Handball<br />\nhome.<br />\nCross Country 4 2 3 3 2 4 9<br />\n9<br />\nApril 29 -J. H. U. vs. Western Mary- that the team will be in the beat conlatter in the past year has shown im- Soccer<br />\n52 42 5414<br />\n8<br />\nland. Away.<br />\ndition.<br />\nprovement.<br />\nGolf<br />\n80 6<br />\n14<br />\n4<br />\nAll candidates for the freshman<br />\nMay 1-J. H. U. vs. Catholic. (Tent.)<br />\n13 12<br />\n7 6 6<br />\nprofessionalized Tennis<br />\nElimination<br />\nof<br />\nMay 4-J. H. U. vs. Loyola. At managerial post, which has not been<br />\n5 4 2 8 5 1 12 13<br />\nfilled as yet, should notify either play in colleges would produce the Swimming<br />\nhome.<br />\n33 15 .... . 4<br />\n8<br />\nMay 6 -J. H. U. vs. St. Johns. Away. Coach Owings or put a note in Man- records made by the minor teams Track<br />\nBaseball<br />\n1 7 7<br />\n8 13<br />\nthe<br />\nand<br />\nthroughout<br />\nsports,<br />\nH.<br />\nU.<br />\nJ.<br />\nager<br />\nBoshnak's<br />\nbox.<br />\n-Open.<br />\noffice<br />\nAspost<br />\nMay 8<br />\nMay 11 --J. H. U. vs. Loyola. Away. pirants for the position should also result would be gratifying to both<br />\n47 27 44 41 25 14 116 82<br />\nTotals<br />\nMay 14-4. H. U. vsl. College of try to be present at the next practice the student body and the prestige of<br />\nGrand totals 56 46 50 60 34 30 140 136<br />\nthe University as a whole.<br />\nWilliam and Mary. Away. which will be held today.<br />\n<br />\nMajor And Minor J. II. U. Sports<br />\nOver 3 Years---Read 'em And Weep<br />\n<br />\nDaniel Weiner<br />\nDan's a City College product of '32.<br />\n\"Back-stroked,\" \"free-styled,\"<br />\nand played water polo for \"school on<br />\nthe hill.\" . . . In addition was a lacrosse man for two years and ran<br />\nthe 70-yard dash (8:03). . . Matriculated in \"Dear Old Johnny Hopkins as<br />\nengineer in '33. . . . Varsity swimming 1, 2, 3.. . . Oaptain, 4. . . .Specialty: backstroke. . . . Other extracurricular activities, A. S. C. E.,<br />\nNews-Letter, cross-country,<br />\nutramural athletics.<br />\nDanny's made a brilliant swimming<br />\ncareer . . . Bettered Hopkins 150<br />\nyard backstroke record by 3 2-5 seconds... time 1:51.. . Note: The Hopkins torpedo took the Atlantic 100yard backstroke championship this<br />\npast summer with time of 1:09 1-10<br />\n. . . Also, has represented Baltimore<br />\nfor 4 years in meet between Baltimore and<br />\nWashington<br />\nAll-Stars<br />\nswimming teams . . . Likewise has<br />\n100 yard backstroke record for this<br />\ncompetition-1:07 4-5 . . . Keenest<br />\ncompetition of '37 season--Lehigh.<br />\n<br />\nJay Wallmen<br />\nBeat St. John's<br />\nBy 4-1 Score<br />\nJays Sweep Singles But Lose<br />\nDoubles Match To<br />\nJohnnies<br />\nFIVE STRAIGHT WINS<br />\nHandballers Go To Philly<br />\nFor Last Match On<br />\nSaturday<br />\nFor the third consecutive year,<br />\nthe Jay handball team has succeeded<br />\nin trimming the traditional rival St.<br />\nJohns squad to the melody of 4-1 at<br />\nthe Johnny four wall courts, Friday,<br />\nMarch 12.<br />\n<br />\nThe win marked the fifth consecutive victory for the Hopkins HandHe is the backbone of the campus bailers of this year since their<br />\ndefeat<br />\nmovement for a Hopkins pool . . . If<br />\nby Brooklyn College during the<br />\nand when the issue comes up he expects a student body backing -- and Christmas holidays. The Jay wallmen<br />\nhe's getting it! . . . Let's give three number among its victims L.I.U.,<br />\ncheers for \"little man, big stuff\" Dan- Universty of Pennsylvania, Police<br />\nny Weiner-the first for his record A.C. of Baltimore, Western Marybreaking; second for the pool movelands, and the University of Virginia.<br />\nment; third, for captaining the best<br />\nMilberg Victor<br />\nBlack and Blue swimming team in<br />\nIn the first single match against<br />\nyears!!<br />\nthe Johnnies, Iry Milberg defeated<br />\n<br />\nSun Selects<br />\nState Stars<br />\n<br />\nM. Hecht, the St. Johns number one<br />\nman by a score of 15-9, 15-11.<br />\n<br />\nIn the second singles match big<br />\nDick Pasternak just managed to defeat B. Goldstein of St. Johns by the<br />\nHerb Siegal Snares Forward close scores of 15-11, 15-13. In this<br />\nmatch the contestants were closely<br />\nBerth On Second<br />\nmatched and the victor was decided<br />\nafter a streak in the last game in<br />\nTeam<br />\nwhich Pasternak ran up ten points<br />\nHerb Siegal, leader of this year's to completely bewilder Goldstein.<br />\nBlue Jay quintet, was named captain<br />\nAlperstein Takes Close One<br />\nof the second All State team, selected<br />\nIn the third singles match Milt<br />\nby The Sun. Siegal was given one Alperstein put down R. Sommeville<br />\nof St. Johns, after stubborn resistance<br />\nof the forward posts.<br />\nThe Jay captain earned the honor by the score of 15-6, 15-3. This game<br />\nwas more closely contested than the<br />\nby his stellar floor playing, and his<br />\nscore indicates and the lead changed<br />\nrespected defensive ability. Besides be- hands quite<br />\na few times in the early<br />\ning one of the most effective men in part of each game before<br />\nAlperstein<br />\npoint average, with a fraction under finally defeated Sommeville.<br />\nIn the first doubles match, Milberg<br />\n10 points per game, Siegal has more<br />\nand Alperstein went down to unexdefensive cunning than most high<br />\npected defeat before Hecht and Goldscorers are required to have.<br />\nstein to the tune of 15-13, 15-10. The<br />\nHopkins combination played far beFour Years' Service<br />\nCaptain Siegal topped the leading low their usual form and suffered<br />\ntheir second defeat in varsity compeforwards of the Maryland Intercoltion in two years.<br />\nlegiate Lague in scoring, besides having the most foul points to his credit.<br />\nWin Second Deubles<br />\nHerb has seen action on the varsity<br />\nThe second doubles match was a<br />\nfive for the last four seasons, making brilliantly played game<br />\nwith Capt.<br />\nhis last the best. His consistent scor- Nat Finkelstein and<br />\nRed Glantz deing and good all around playing was feating Wright and Grey<br />\nof St. Johns.<br />\npartly responsible for the fine 36-37 This stellar combination<br />\nhave proved<br />\nBlue Jay basket ball record.<br />\nthemselves to be a good doubles team,<br />\nas this was their third consecutive<br />\nLambros Heads First Team<br />\nHerb lost a first team all-state win playing together.<br />\nThe Johnnies put a much better<br />\nberth to Mik Pellino and John Lambras, who are considered the best squad of men on the court than the<br />\ngroup that played last year, when<br />\nMaryland forwards.<br />\nThe Sun's selections are as follows: the Jays defeated them 7-0.<br />\nU. of P. Next Foe<br />\nThe Hopkins team travel to Philadelphia this Saturday to play the University of Pennsylvania on the latter's four wall courts. The Quaker<br />\n1-Jus are looking forward to avenging<br />\nthe defeat suffered by them at Homewood on the singles wall court. The<br />\nRed and Blue team defeated the Jay<br />\nSecond Team<br />\nsquad last year in the four wall game,<br />\nHerb Siegal, F., Johns Hopkins.<br />\nand the match Saturday will determFrank Apichella, F., Mt. St. Mary's. ine<br />\nwho takes the lead in the series<br />\nAlex Zebrowski, C., Washington.<br />\nwhich now stands at one match<br />\nEdward Pulvino, C., Baltimore.<br />\napiece.<br />\nStan Kopie, G., Mt. St. Mary's.<br />\nCaptain, Siegal.<br />\nBest Bet, Apichella.<br />\nSports Schedule<br />\nFirst Team<br />\nMike Pellino, F., Baltimore.<br />\nJohn Lambros, F., St. Johns.<br />\nVic Probst, C., Baltimore.<br />\nTom Carney, G., Layola.<br />\nCharley Keller, G., Maryland.<br />\nCaptain, Lambros.<br />\nBest Bet, Probst.<br />\n<br />\nWEDNESDAY<br />\nEXTRA MURAL<br />\nPRAT BASKETBALL-Represented<br />\nby Kappa Sigma<br />\nJohns Hopkins vs. U. of MaryThis business of providing for the<br />\nland. At College Park.<br />\nvarious sports the proverbial freshmen managers has indeed become, in INTERCLASS BASKETBALL<br />\na word, irksome to the esteemed<br />\nJohns Hopkins vs. U. of Maryland.<br />\ncoaches and their managers proper.<br />\nAt College Park.<br />\nWhere are the freshmen?<br />\nGRADUATE VOLLEY BALL<br />\nJohns Hopkins, represented by<br />\nBreathes there a frosh with soul so<br />\nChemists vs. U. of Maryland. At<br />\ndead<br />\nCollege Park.<br />\nWho never to himself hath said,<br />\nTHURSDAY<br />\nThis is my own, my Black and Blue,<br />\nHANDBALL<br />\nJay Vee<br />\nWhose heart hath ne'er within him<br />\nJ. H. U. vs. Western Maryland. At<br />\nburned<br />\nHomewood.<br />\nAs dormward his footsteps he hath<br />\nVOLLEY BALL<br />\nturned<br />\nJ. H. U. vs. Western Maryland. At<br />\nFrom LOAFING at the J. H. U.<br />\nHomewood.<br />\n<br />\nSir Walter Scott<br />\nCalls lorManagers<br />\n<br />\n\f", "format": "basic_html", "processed": "iqopkim Nrinoirtirr<br /><br />\nNews-Letter Opinion On<br />\nBrowder Case<br />\n—Look On Page 2<br /><br />\nSENIORS: BUY<br />\nYOUR JUNE WEEK<br />\nTICKETS<br /><br />\n....111•••••••••<br /><br />\nVOL. XLI, No. 31<br /><br />\nJuneWeekPlans<br />\nProgress; Many<br />\nSeniors Sign Up<br /><br />\n(<br />\nirce<br />\nhe<br />\nLn-<br /><br />\n!ed<br />\nof<br />\nle-<br /><br />\nmfor<br />\n)ut<br />\nto<br /><br />\nat*<br />\nthe<br />\n.mthe<br />\n, a<br />\ning<br />\non-<br /><br />\nof<br />\n;<br />\n)1in<br />\nof<br /><br />\n3,ve<br />\nnes<br />\nose<br /><br />\njer,<br />\nH.<br />\n)er;<br />\nJay<br />\nwn,<br />\n[tie;<br />\nsn't<br /><br />\nof<br />\nas<br />\nits:<br />\nLou,<br />\nepan,<br /><br />\nvay<br />\n'ay<br />\nnue<br />\niiiii<br /><br />\n'ay<br />\nme<br />\nme<br /><br />\nurg<br /><br />\nace<br />\nit ry<br /><br />\neye<br />\n)(nit<br />\nicier<br />\nTihe<br />\nere<br />\nive<br />\ncts<br />\nadthe<br />\nr a<br />\naceld<br /><br />\n4<br /><br />\n6<br />\n6<br /><br />\nPRICE 5 CENTS<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 16, 1937<br /><br />\nStudent Council To Head<br />\nDorm Governors Board<br /><br />\nFreshmen Receive Plans For Soph<br />\nBallots For Newly Dinner At Belair<br />\nProposed Dues Plan Near Completion<br /><br />\nCommittee Calls<br />\nAnti-War Strike<br />\nRepresentatives<br /><br />\nHopkins Medical School<br />\nAdmits Fourteen Men<br /><br />\nThe Medical School of the<br />\nJohns Hopkins University has announced that the following Hopkins undergraduates have been admitted to the 1937-38 Freshinim<br />\nNew Budget Will Make Ac- Inter-Fraternity Ball Included; Class:<br />\ntivities More Numerous<br />\nChick Webb and Rita Rio<br />\nRobert Austrian.<br />\n'News-Letter', YMCA, And<br />\n'Clean' And 'Usual'Types Of<br />\nWilliam G. Beadenkopf.<br />\nAnd<br />\nConsideration<br />\nUnder<br />\nExpensive<br />\nLess<br />\nASU Release Appeal For<br />\nEntertainment Effects<br />\nGrant L. Boland.<br />\nRepresentatives<br />\nGeorge J. Coloviras, Jr.<br />\nOf Compromise<br />\nHershner Cross Explained Tinley Chosen To CommitErnest J. Cross, Jr.<br />\nSidney R. Gladstein.<br />\nProject At Recent<br />\ntee; To Announce Junior<br />\nBOWMAN INTERESTED<br />\nSEVEN COURSE DINNER<br />\nHarold M. Goldstein.<br />\nSelection Soon<br />\nClass Meeting<br />\nMilton Gussack.<br />\nCall Stresses Need For CoJames Hopkins.<br />\nPrice Is Lowest In Years;<br />\nThe class of 1940 has been offered<br />\nGood fellows will get together<br />\nFloyd Katske.<br />\noperation Among All<br />\nTransportation To Be<br />\na revolutionary, far-sighted financial Thursday night when the Sophomore<br />\nErnest Pieper, Jr.<br />\nplan<br />\nfor<br />\nClass<br />\nits<br />\nconsideration.<br />\nblowout<br />\nholds<br />\nannual<br />\nat<br />\nYesterday<br />\nAffected By War<br />\nProvided For All<br />\nBernard G. Pinck.<br />\nballots were distributed to members the Kenmore Inn in Belair.<br />\nMyrick W. Pullen, Jr.<br />\nPlans for a Hopkins demonstration<br />\nIn view of the nearly 50-50 result<br />\nof the Freshman Class concerning<br />\nThe annual Hopkins InterfraterJohn R. Steeper.<br />\n(luring<br />\nthis<br />\nnew<br />\nthe nation-wide annual Stubudget<br />\nballoting<br />\nof<br />\nplan.<br />\nthe<br />\nlast<br />\nweek<br />\ntype<br />\non<br />\nthe<br />\nnity Ball wll definitely be a part of<br />\nThese successful candidates for<br />\ndent Strike against War next April<br />\nUnder the proposed scheme dues of entertainment the Sophs wanted<br />\nthe 1937 June Week festivities, acadmission were notified of their<br />\nwill be raised slightly with an ac- at their banquet, the committee has<br />\n22nd were taking form this week<br />\nacceptance by mail last Friday.<br />\ncording to Moe Bradford, chairman<br />\nWith the dispatch of a call to various<br />\ncumulation of dividends resulting in decided to compromise. Besides the<br />\nof the June Week .Committee. Sevcampus organizations to take part.<br />\nthe marked reduction of expenses \"usual entertainment\" which was<br />\nThe call was issued over the signafrom $25 to $12 in their four years. slightly favored in the referendum,<br />\neral well-known \"name\" bands are<br />\nAs explained on the ballots, the idea \"clean\" entertainers will also be pretures of the American Student<br />\nbeing considered to play at the dance,<br />\nUnion, the NEWS-LETTER, and the Hopruns as follows:<br />\nsented.<br />\nincluding the popular Chick Webb<br />\nY.M.C.A., organizations which have<br />\n1. Dues will be compulsory and<br />\n\"Dinner will be served at about 7:30<br />\nand the vivacious Rio Rita and her<br />\nalready<br />\nfixed at $3.00 a year per member.<br />\nsignified their intention to<br />\np.m., during which several acts of the<br />\nall-girl orchestra.<br />\nparticipate.<br />\n2. A budget has been prepared for 'clean' variety will be shown,\" said<br />\nWill Speak On \"Fascist The appeal asked that representathe entire four years.<br />\nHenry Blucher, chairman of the banSidney Tinley, a member of the<br />\nTendencies And Their<br />\ntives be elected in time fqr an organiBecome Sec. - Treas. And 3. Payment of dues will entitle all quet committee. \"Following the last<br />\nKappa Alpha fraternity and a Senior<br />\nfreshmen, without additional pay- course of the meal, the boys will have<br />\nzation meeting to be held in Levering<br />\nSignificance\"<br />\nProd.<br />\nRespectively<br />\nMan.<br />\nin the Business School, is a new adment, to admittance and participa- an hour and a half to do with what<br />\nHall at 12.20 this Thursday. At this<br />\nRev. Henry Smith Leiper, executive time a committee, it is said, will be<br />\ndition to the June Week Committee.<br />\nAt Election Friday<br />\ntion in all the social functions of the they may. Then at about 10 o'clock<br />\nsecretary of the American Section delegated to discuss plans with Dr.<br />\nclass, and the June Week and Hulla- entertainment will be resumed.\"<br />\nThe Junior Class representative to<br />\nWilliam L. Snyder and Daniel baloo in their Senior year.<br />\nof the Universal Christian Council en Isaiah Bowman, president of the Unithe committee, who automatically<br />\nBlucher emphasized the fact that<br />\nGidinsky were elected to the offices<br />\nLife and<br />\nWork, also executive versity, reputedly \"much interested<br />\nAt a recent meeting of the Class<br />\nno one will be allowed to come in after<br />\nbecomes the chairman of next year's of secretary-treasurer and production<br />\nsecretary of the Department on Rela- in the strike.\" It is hoped that the<br />\nat which Hershner Cross, president of<br />\ndinner, in order to see the entertainJune Week, will be appointed in manager respectively in the Barn- the Student Council,<br />\ntions with Churches Abroad, Federal campaign will have, by this time,<br />\nexplained the<br />\nstormer elections held last Friday. project, it was definitely decided that ment, without paying the full admis- Churches of Christ in America, will reached a point of development, which<br />\nthe near future.<br />\nLouis Swyer had been chosen as some new budget plan this year would sion price—$1.50 a seat. Those Sopho- be the Supper Club Speaker and Uni- will permit the establishment of a<br />\n\"The committee,\" said Bradford,<br />\npresident and Frank Crist as business be needed. This was unanimously the mores who have paid their dues will versity Lecturer tonight. He will ad- formal strike committee to take care<br />\nget a fifty cent reduction on their<br />\n\"was very gratified at the turn of manager the week before.<br />\ndress the Supper Club at Levering of a pre-strike education committee.<br />\nopinion of the members of the Class,<br />\nticklts.<br />\nevents during the past week. The<br />\nHall at 6 p.m. on \"Fascist Tendencies<br />\nIn the contest for secretary-treas- since it was pointed out to them that<br />\nDelegates of the three organizations<br />\nMeans of transportation to Belair and Their Significance.\"<br />\nnumber of promissary notes turned urer, Snyder defeated Merel Harmel if the proposed plan or some other<br />\nrepresented are: C. Hammond Brown,<br />\nwill be provided each man separately<br />\nAt 8:15 he will speak on the and Brian Murphy, for the Y.M.C.A.;<br />\nin by the Seniors has gone far be- and Stanley Prager, and Gidinski's were not accepted, the dances, banas<br />\nhe purchases his ticket from one University Lecture Series at the WilMorris Shils, and Milton Brotma.n, for<br />\nyond our expectations.\" Bradford opponents were Milton Saul and Stan- quets, and other regular activities of of the<br />\nmembers of the committee. son Memorial Church on \"Patriotism<br />\nley Isaacson. Both Snyder and Gidin- the Class would be greatly curtailed.<br />\nthe American Student Union; and J.<br />\nreferred to the notes being distributed<br />\nski will be seniors next year. Gidin- Also, from a realization of their Automobiles will be used wherever and Religion.\"<br />\nMurray Kemptqn, for the NEWSamong upper-classmen, the purpose ski was<br />\npossible. A bus, however, will be<br />\nDr. Leiper's activities have taken LETTER. A pamphlet explaining the<br />\nrecently inducted into the present financial status, it will<br />\nof which is to determine the exact Tau Alpha Omega Fraternity and is have to be adopted next year. The hired to accommodate those who can- him throughout the world, and dur- national scope and theory of the<br />\nbe conveniently distributed in pri- ing the last few years he has made an<br />\nnumber of men who plan to support a member of the swimming team and majority of the freshmen have al- not<br />\nstrike accompanied each call.<br />\nvate<br />\ncars.<br />\nintensive study of the Church situaof the Science Club. Snyder is a ready paid their dues of two dollars.<br />\nCampus organizations invited to<br />\nthe Week.<br />\nChairman Blucher urged the sup- tion in Germany, both before and send representatives include the<br />\nmember of the Musical Club and a The additional dollar required would<br />\nHulAn option on the main ball-room<br />\ncandidate for the NEWS-LETTER staff. not be a strain commensurate with port of all Sophomores. \"In the mat- after Nazi Church regulations. In labaloo, the Barnstromer Club, the<br />\nof the Alcazar has been obtained, but<br />\nAt the meeting after the elections the expenses that they would have to ter of entertainment, we have tried 1930 he served as speaker for the non- Student Council, the Musical Club,<br />\nit was pointed out that those Seniors<br />\na new plan was broached which will undergo as seniors. The benefits are to please every one. We are provid- Roman American Church at the 400th the Cotillion Board, the Debating<br />\nwho had not signed up must do so at be voted upon at the next meeting. manifold, and special provisions can ing transportation and an excellent Anniversary of the Augsburg Confes- Council, the Science Club, the R. 0.<br />\nmeal at the cheapest price in years. sion, held at Augsburg.<br />\nT. C., Omicron Delta Kappa, the Inonce, if the option is to be retained.<br />\nThe plan provides that only seniors be made for those freshmen who do<br />\nHis undergraduate work was done terfraternty Board and the<br />\nwill be eligible to full membership in not expect to be in the class for the Your cooperation and support are<br />\nsix sociTariff of $10<br />\nneeded to insure the success of this at Amherst, and he graduated from eties not represented<br />\non the board<br />\nthe Club and allowed to wear the key. entire four years.<br />\nA tariff of ten dollars has been<br />\nthe Union Theological Seminary in<br />\nFreshmen who voted yesterday had affair,\" he concludeg.<br />\nIn their call for delegates, the orIt is hoped that this innovation will<br />\nlevied to cover the entire June Week remedy two present evils. It will the choice of going on the budget<br />\nA menu which boasts one pound of 1917 and also received his M A. de- ganizations which have already enactivities, which heretofore have in- make the Barnstormer Club more (fixed $3.00 dues) this year, or not. Roast Harford County Turkey on gree at Columbia the same year. He tered the committee stressed the<br />\nIn either case the scheme will be put each plate and second helpings upon was ordained a Presbyterian Minister need for cooperation in making the<br />\ncluded at least three dances, a beach \"exclusive\" than at present, and will<br />\nrequest, also includes shrimp and in 1915, but recently he has been more strike a success and expressed the<br />\nbecoming inactive into effect next year.<br />\nparty, beer gatherings, and an ex- prevent a member<br />\nLeroy Applefeld, treasurer of the crab<br />\ncocktails, cranberry sauce, active in Congregational circles.<br />\ndesire that the committee be as wideafter his ellection to the club if it be<br />\ntensive athletic program. Payment of<br />\nSince 1915 he has served in China ly<br />\nFreshman<br />\nClass,<br />\nand<br />\nBen<br />\nCourtright,<br />\nmashed potatoes, lima beans, Roquerepresentative as possible.<br />\nat the end of his sophomore or junior<br />\nsecretary, submitted the ballots to fort salad, ice cream and fresh straw- as a missionary, as as traveling secthe fee must be made by March 31st, yeEr.<br />\n\"Surely,\" the appeal concludes,<br />\nthe freshmen.<br />\nberries, and many other side dishes. retary of the Student Volunteer \"all Atudents<br />\nat which date a monetary fine of one<br />\nPlans are also being made to hold<br />\nare for peace and<br />\nMovement, as pastor of the Rutgers<br />\nagainst wasteful destruction of madollar will be added to the cost of the a stag within a few weeks. The comPresbyterian Church In New York,<br />\nterials and men. The menace of<br />\nticket. After April 15th a further rise mittee in charge of this undertaking<br />\nand with the Army Y. M. C. Ak in<br />\narmed conflict is the vital concern of<br />\nis composed of Brian Murphy, Frank<br />\nin prices will occur, with the addition<br />\nSiberia.<br />\nCrist and Herman Saul.<br />\neach one of us: Let us all cooperate.<br />\nHe is the author of \"Blind Spots,\"<br />\nof a penalty, if the fee is not yet paid.<br />\n\"Experiments in Cure of Race Prejudice,\" and numerous magazine arHullabaloo Asks Nine<br />\nticles on these and other subjects.<br />\nJames<br />\nEd.<br />\ncommittee<br />\nof<br />\ntwo,<br />\nS.<br />\nNote:<br />\nMorrow,<br />\nA<br />\nJr.<br />\nand<br />\nJ.<br />\nJudge<br />\nMehTo Complete Payments<br />\nling have ascertained the facts concerning the rejection of Earl Browder,<br />\nThe Hullabaloo announces that nine Communist presidential candidate, as Assembly speaker. This report at- Kirkley To Discuss<br />\nHead of Hopkins Institute Of History<br />\nhave neglected to pay the money tempts to draw no conclusions; it merely consists of a factual statement<br />\nmen<br />\nInstructor In Philosophy To Lead<br />\nMaxwell<br />\nAnderson<br />\nOf Medicine Talks At<br />\nissued<br />\nafter<br />\nof<br />\na<br />\nmonth<br />\ninvestigation.<br />\nthat is long due for their pictures.<br />\nDiscussion On \"Place<br />\nA. S. U. Meeting<br />\nAn address on \"Maxwell Anderson\"<br />\nSeven of them, who owe $3.00 each,<br />\nOf Religion\"<br />\nTo The Student Body:<br />\nassembly.<br />\nOne<br />\nmember<br />\nthe<br />\nof<br />\nBoard<br />\nfollowed<br />\ndramatic<br />\nby<br />\nreadings<br />\nwill<br />\nare Joseph Sarnovitz, Henry G. F.<br />\nDr. Henry L. Sigerist, director of<br />\nThe following is a history of events dissented.<br />\nbe tendered under the auspices of the<br />\nDr. Albert E. Blumberg, instructor Siems, James Lyle, Richard Love,<br />\nthe Institute of the History of Medileading up to the rejection of Earl<br />\nthis<br />\nFrom<br />\nit<br />\nappeared<br />\npresthat<br />\nJohns<br />\nHopkins<br />\nin<br />\nPlayshop<br />\nLatrobe<br />\nin philosophy at the Hopkins, will Theodore Ember, R. A. Baer, and Browder as assembly<br />\nspeaker by the sure had been brought to bear by the 120 tonight at 8:30. Lecturing on the cine, at the Johns Hopkins Medical<br />\nJohn E. Bamberger. The others who<br />\ndeliver the third in a series of talks<br />\nBoard of Control of the NEWS-LETTER: Administration on Mr. Diamond.<br />\nfamous Broadway playwright will be School, will be the guest speaker at<br />\nowe $2.00, are Robert McCarthy and<br />\nApproximately a month ago the<br />\nto the Fireside Discussion Club, on<br />\nOn February 9 a group of inter- Donald Kirkley, dramatic and music the regular meeting of the Hopkins<br />\nHerman Sody. ,<br />\nChapter of the American Student<br />\nYoung<br />\nCommunist<br />\nLeague<br />\nstudents, went to see Dr. Bow- critic of the Baltimore Sun.<br />\napested<br />\nPlace<br />\n\"The<br />\nof Religion<br />\nthe subject of<br />\nRobert Austrian, editor of the an- proached William<br />\nUnion on Thursday, March 18, at<br />\nDiamond,<br />\nediman<br />\nthen<br />\nas<br />\na<br />\nfact-finding<br />\ncommittee.<br />\nMr.<br />\nKirkley,<br />\na<br />\nHopkins<br />\nalumnus,<br />\nIn Modern Society,\" today at 4:15 nual, asks that these men get the<br />\ntor of the NEWS-LETTER, requesting This group consisted of Henry Leber, played with the Playshop during his 11:30, in Levering Parlor. Dr. Sigermoney in immediately, for they are<br />\np.m. at the Levering Hall Parlor.<br />\nthat it be allowed to sponsor an as- Maurice Shils, Walter Schlesinger, work here. Work with Gilbert and ist will speak on \"Spain--1937.\"<br />\nHis talk will be the first in a holding up some of the work on the sembly. (The NEWS-LETTER at that J. Judge Mehling,.Stanley Morton Fin- Sul/ivan<br />\nDr. Albert Blumberg, Instructor in<br />\noperettas and the Theatre<br />\nseries of three on religion, the other book.<br />\ntime had been given complete charge kel and James S. Morrow. Dr. Bow- Guild ensued, with correspondingly Philosophy at the Hopkins, will give<br />\ntwo of which will be given by Dr.<br />\nof four experimental assemblies by man welcomed the group, but re- favorable comment by critics. His a short talk on the political history<br />\nHoward A. Kelly and Dr. T. Guthrie Guttmacher's<br />\nthe 'Student Council.) Diamond ten- fused to discuss the question with reviews and comment in the Sun are of Spain, preceding Dr. Sigerist's<br />\nLectures<br />\nTo<br />\nSpears, pastor of the Brown Memorial<br />\ntatively approved the request, and two members of the committee, Shils held in high regard, and attract a talk. American Student Union meetBe Held In Remsen 1 the<br />\nChurch.<br />\nYCL submitted to him a list of and Schlesigner, because they stated large reading public.<br />\nings are open to all members of the<br />\nspeakers,<br />\nforemost<br />\nUniversity.<br />\namong<br />\nwhom<br />\nthat<br />\nalthough<br />\nthey<br />\nwere<br />\ninterested<br />\nDr. Isaiah Bowman delivered the<br />\nMiss<br />\nPatty<br />\nSingewald,<br />\nremembered<br />\nThe scene of Dr. Guttmacher's lecfirst fireside talk three weeks ago, tures on Human Reproduction has were Joseph Freeman and Earl in hearing what Dr. Bowman had to for her portrayal of the nurse in the<br />\nIn the last year Dr. Sigerist has<br />\nBrowder.<br />\nsay, their minds were already made recent presentation of \"The Father,\" been associated with the North Amerand last week Dean Berry spoke.<br />\nbeen transferred from Rowland 58 to<br />\nAt the next meeting of the Board up as to the faelts of the case.<br />\nwill be heard in the dramatic pre- ican Committee for the Aid of SpanStudents who wish to hear Dr. Remsen 1. Due to the extreme popuDr. Bowman invited two of the re- sentations. Miss Dolly Ashley and ish Democracy. He is a member of<br />\nBlumberg's lecture must sign up on larity of the course, Rowland accom- of Control of the NEWS-LETTER<br />\nsheets for that purpose in the post modations have become cramped for tike step taken by Diamond was maining four members of the group Martin Rude will also participate in the Baltimore Committee of the<br />\nunanimously approved by the Board, to meet Diamond, P. S. Macaulay, these presentations.<br />\noffice and Levering Hall. Only 20 the large attendance.<br />\nNorth American Committee, and he<br />\nbut the YCL was not informed of the Secretary of the University, and himstudents are admitted to the meeting.<br />\nis also a member of the National<br />\nThe course, under the auspices of<br />\ndecision.<br />\nself in order to ascertain the facts in<br />\nMedical Committee of the same orthe Hopkins branch of the American<br />\nRequests NYA Reports<br />\nOn his own initiative, Diamond the case. This meeting was to take<br />\nganization. It was this committee<br />\nStudent<br />\nUnion,<br />\nhas had audiences went to Dr. Bowman<br />\nAll-Mozart Concert April 28<br />\nfor advice in the place without the previous knowledge<br />\nMiss Judge has requested that all which recently sent over several amsteadily increasing in size.<br />\nmatter.<br />\nof Diamond as to what was to tran- NYA time reports for the month of bulances and doctors and nurses to<br />\nThe Friends of Music Society will<br />\nLast Thursday's lecture was not deThe following day another meeting spire.<br />\nMarch be turned into the office of Spain.<br />\npresent a concert on April 28 at Lev- livered, as Dr. Guttmacher, one of of the Board of<br />\nControl of the NEWSOn February 17, Mehling, Morrow, the Bureau of Appointments on or<br />\nThe Institute of the History of<br />\nering Hall. The program is to con- Baltimore's leading obstetricians, was LETTER was called<br />\nat which it was Diamond and Mr. Macaulay met Dr. before the following dates:<br />\nMedicine at Hopkins has become<br />\nsist of selections from the works of needed for an emergency operation. voted that Mr.<br />\nBrowder, who had Bowman in the office of the presiGraduate reports on Saturday, world famous under the leadership<br />\nMozart. Tickets will be on sale in Lectures are given every Thursday by that time<br />\n'been invited by the dent, and during the ensuing inquiry March 20.<br />\nof Dr. Sigerist, and the Hopkins Medthe main reading room of the library at 4 p.m. This week's lecture is on Young Communist<br />\nLeague, be re- Mr. Diamond made the following<br />\nUndergraduate reports on Monday, ical School is one of the few in<br />\nthe<br />\nfor 50 cents.<br />\n\"Male Adolescence.\"<br />\nfused permission to speak at the<br />\n(Continued on Page 3, Col. 2)<br />\nMarch 22.<br />\ncountry that has such a department.<br />\nThe results of the recent disturbances in the Dorimtory are<br />\nnow taking fruit in the proposal of<br />\nthe Student Council to return to<br />\nthe \"dormers\" a voice in their government to partially supercede the<br />\npresent system of proctors appointed by the University.<br />\nA Board of Governors, whose<br />\nmembership is to consist of one<br />\nrepresentative from each entry,<br />\nelected by the students in each,<br />\nwill be formed in the first week<br />\naftr the Spring vacation./<br />\nA member of the Student Council is to be chairman of this board,<br />\nthus placing all possible complaints concerning the Dorm in<br />\ntheir hands.<br />\nThe new board will not supercede the committe now in operation but will cooperate with it.<br />\nRead your NEWS-LETTER for developments.<br /><br />\nSupper Club Hears<br />\nRev.Leiper Tonight<br /><br />\nSnyder, Gidinsky<br />\nGet 'Stormer Posts<br /><br />\nCommittee Reports Findings<br />\nOn Browder Incident<br /><br />\nBlumberg To Speak<br />\nTo Fireside Group<br /><br />\nSigerist To Speak<br />\nOn Spain Thursday<br /><br />\nT<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 16, 1937<br /><br />\n2<br /><br />\nof a new social order. Not only do we suggest this as<br />\na schedule for the Student Council, but we strongly urge<br />\nits adoption as consistent with the fundamental basis<br />\nof the Johns Hopkins University. Here is an opportunity<br />\nto show that our reputation as an unequivocable proponent of free speech and liberal though exist in fact.<br />\nIf our observance of student reactions is correct, we<br />\nare certain that we reflect the opinions of a considerable<br />\nnumber in asking that an extremist be made part of<br />\n$2.00<br />\nSubscription per year<br />\na balanced speaking program. At present the Young<br />\n$2.50<br />\nBy Mail<br />\nCommunist League has applied to the Student Council<br />\nfor permission to hold an assembly with Browder or<br />\nRemit subscription fees to Treasurer, Student. Activities Council, some other such representative as the speaker.<br />\nRemsen Hall, Postoffice, Johns Hopkins University.<br />\nThe chance of absolutely wiping out all doubt as to<br />\nthe policy of the administration, the NEWS-LETTER, and<br />\nEntered as second class matter December 3, 1909, at the Postoffice the Student Council is definitely here. Dr. Bowman has<br />\nin Ilaltimore, Md., under the Act of Congress, November 3, 1879.<br />\ngiven out the printed comment quoted on page one;<br />\nwe have voiced ours. What about the Student Council?<br /><br />\nIje3obtis jt)opkirtz<br /><br />\nletter<br /><br />\nPublished semi-weekly from October to June, except during examination and college holiday periods by undergraduates of the Johns<br />\nHopkins University.<br /><br />\nEDITORIAL STAFF<br /><br />\nEditor-in-Chief<br />\n.<br />\nStanley Finkel<br />\nManaging Editors<br />\nJames Morrow, David Caplan .<br />\nSports Editor<br />\nBernard D. Pinck<br />\nAssistant Mangaing Editors<br />\nBenjamin Root, Wethered Barroll, Jr<br />\nAssistant Sports Editor<br />\nHarold Zheutlin<br />\nColumnist<br />\nPaul Berge<br />\nReporters—Max lskowitz, Nathaniel Finkelstein, Jewett Goldsmith,<br />\nHoward Reizenstein, Julian Adler, Carl Rasin, Leonard Rubinger,<br />\nMorris Wessel, Arthur Katz, Martin Krieger, Lester Rosenthal,<br />\nMurray Kempton, Victor Victoroff, Charles Diggs, William Burford, J. C. Handelsman, Mal Boshnack, Arnold Glantz, Joe<br />\nSamovitz.<br /><br />\nWilliam B. Kempton<br />\nMelville Locker<br />\nWm. C. Erlanger<br />\nGerald Willen<br />\nHoward Linkoff<br />\nNathaniel Soifer<br /><br />\nBUSINESS STAFF<br />\nBusiness<br />\n..<br />\n.<br />\nAssistant Business<br />\nAdvertising<br />\n_ Circulation<br />\nOffice<br />\nCopy and Filing<br /><br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br /><br />\nOn The Literary Horizon<br /><br />\n•<br /><br />\n•<br /><br />\n•<br /><br />\n•<br /><br />\nwith a degree, supposedly fitted to lock Holmes,\" and the \"Mystery of<br />\ntake his place among the people of Edwin Drood,\" regrettably left unIt is frequently asked by college<br />\nfinished by the master Dickens, he<br />\nthe world about him, indicates that a<br />\nhas at last achieved his object. To<br />\nstudents, \"Why should I waste my<br />\ngreat deal of knowledge of human naquote from the note reputed to have<br />\ntime reading, anything?\" There then<br />\nture and getting along with people is<br />\nsent monthly to the publishing<br />\nfollows a long and impressive list of undeveloped and unappreciated. Nor been<br />\nhouse, he asked \"When are you nitreasons why there is little sense in a is it a subject which can be taught<br />\nwits going to do \"The Moonstone\" and<br />\ncollege man passing his valued hours from text-books. But it is gained \"The Woman in White\" in a single<br />\naway from study between the covers slowly and painfully through exper- volume—in a type that these tired old<br />\nience, require sometimes many more<br />\neyes can actually read?\"<br />\nof books, particularly fiction. They<br />\nyears than the results justify. Nor<br />\ntell us that a recent survey by Har- is college exactly the most ideal atAnd so, The Modern Library has<br />\nper's Monthly revealed the fact that mosphere for acquiring such experi- come forth with one of their remarkthe average American family buys ence, for a student moves in his lim- able \"giants,\" containing both these<br />\nless than two books a year, and reads ited circle, mostly among people as stories. They are by Wilkie Collins,<br />\nperhaps five; that there isn't any- immature as he, and although he may and were published first when Dickens<br />\nOf the<br />\nthing worth reading being published learn the lesson of that group, it is a himself was still alive.<br />\nwrites,<br />\nMr.<br />\nWoollcott<br />\n\"Moonstone,\"<br />\nhe<br />\ninto<br />\nwhich<br />\nworld<br />\nvery<br />\ndifferent<br />\nright now—that most of the modern<br />\nThe American Student Union should be given full supnovels are trash—and, amazingly plunges in the short few minutes of \"The 'Moonstone' was the first fullport in its petition to extend the lecure course on Human<br />\nlength detective novel. It is still<br />\nenough, that they don't get anything a Graduation Exercise.<br />\nReproduction to the permanent place of the Hopkins<br />\nprobably •the best.\" Indeed, he even<br />\nout of it.<br />\nBut in current fiction are paraded<br />\ncurriculum.<br />\ngoes so far as to suggest that the<br />\nThe survey results are surely not all the varied sorts of people, who<br />\nauthor of \"Edwin Drood\" was atThe widespread interest as well as need for such a<br />\ncalculated as a defense, but rather as exist in the minds of the author, and,<br />\ntempting to emulate the \"Moonsource is evident to anyone observing the attendance<br />\na statement of the appalling illiter- after a certain amount of reading is<br />\nstone,\" and died in the attempt.<br />\nand attitude of the audience every Thursday afternoon.<br />\nacy in the republic we are so com- accomplished, the critical appreciaEven though this is the first year of the lecture's existThe format is pleasing and easy to<br />\nplacently proud of. And, we must tion of these portrayals permits<br />\nas are all the Modern LIibrary<br />\nence, its bold and sensible attractions for the students admit, a large part of modern<br />\nnovels evaluation of their truth and value. read,<br />\nseem fairly steady and permanent.<br />\nand the price is standardized<br />\nbooks,<br />\nare trash, pure and simple. In fact, The whole picture of our day is reEveryone should get behind the movement to incor- an entirely too great proportion, but flected in the fiction of the period, and at $1.10. To those who have not read<br />\nporate this necessary feature of any college curriculum. there is no need to waste time with the constant reader acquires, second both of these, a recommendation is<br />\nBut we repeat that especially does it behoove the Hop- them, and there are certainly as many hand though it may be, a more tol- useless--they are as much required<br />\nreading as, if we may presume, some<br />\nkins to contain such a course because of its tradiion, truly great books being brought forth erant and understanding outlook.<br />\nthe works of Mr. Dickens. Those<br />\nof<br />\nfacilities, and student body.<br />\nin this day and age as ever there were,<br />\nAnd, to place it entirely on the<br />\nmodern auwhich includes the golden period of plane of pleasure, start that way, and who read avidly from<br />\nnot at<br />\nsuffering<br />\nthese<br />\nthors<br />\nfind<br />\nwill<br />\nRomantic literature. There is much read almost anything, so long as you<br />\nall in comparison—may indeed recoginfollow<br />\nThe<br />\nwill<br />\nrest<br />\nenough.<br />\nread<br />\nworth reading—appeat•ing now, last<br />\nnize the original source of many a<br />\nThe future of annual June Week depends upon the month, and next month. There al- evitably, as appreciation of a thing<br />\ntrick of the modern \"Scotstandard<br />\nsuccess of this year's attempt of the June Week Com- ways will be, forming a flexible pic- grows always with understanding.<br />\nland Yard School.\"<br />\nthe<br />\nraise<br />\nand<br />\noff<br />\nof<br />\ntake<br />\nblinders,<br />\nture<br />\nour<br />\nBooks<br />\nsociety<br />\nand<br />\nprogram<br />\na<br />\ntimes.<br />\nenterprise,<br />\nsheer<br />\nper<br />\nmittee to put through,<br />\nCongratulations, Mr. Woollcott!<br />\nAnd what does a student get out of curtains, even though there is freof festivities for which Hopkins men have declared themmerit<br />\nthem.<br />\nto<br />\nreal<br />\nlittle<br />\nquently<br />\nit? Aside from enjoyment, and an<br />\nselves overwhelmingly in favor.<br />\nBY WILLIAM BURFORD<br /><br />\nGet Behind It<br /><br />\nJune Week At Stake<br /><br />\nREPRESENTED FOR NATIONAL ADVERTISING ST<br />\nNational<br /><br />\nAdvertising Service, Inc.<br /><br />\nCollege Publishers Representative<br />\nNEW YORK. N.Y.<br />\n420 MADISON AVE.<br />\nSAN FRANCISCO<br />\npnnToN<br />\nC•.,c, C.<br />\nSrATTLF<br /><br />\n1936<br /><br />\nMember<br /><br />\n1917<br /><br />\nAssociated Colleesiate Press<br />\nDistributors ot<br /><br />\nCoffee Dieest<br />\nMember Of The<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nThis year's Committee inherited such a bad financial<br />\ncondition and reputation that the University put it entirely up to the students to make a financial success of<br />\nthis traditional period of celebration that would justify<br />\nits continuation in the future.<br />\nYou members of the Senior Class, have shown<br />\nyour earnest desire to continue June Week. It is up to<br />\nyou to support a policy to which you have given your<br />\napproval.<br /><br />\nThe June Week Committee is working hard to give<br />\nTUESDAY, MARCH 16, 1937<br />\nyou a good time after your Hopkins work is finished<br />\nthis spring. In order to continue their work, the Committee needs financial assurance that its work is not in<br />\nvain. Bradord has asked for this assurance in the form<br />\nLittle do students at the Hopkins appreciate the very of either the purchase of a June Week ticket, or a promdesirable and enlightened position of its campus news- ise to buy a ticket before March 31. Board members<br />\npaper in regard to faculty administration censorship. are contacting seniors with these written promises.<br />\nIt is fully in keeping with the Hopkins spirit and tradiLet's get behind June Week; show that we desire its<br />\ntion that the paper be a student one, student dominated, continuation by giving our full support. It is only by<br />\nand written editorially from a student viewpoint for doing this that the assurance will be given of financial<br />\nstudent interests.<br />\nsuccess, and without this assurance the June Week ComBut we do grasp our fortunate situation when we mittee cannot continue its plans.<br />\nobserve and hear of other college newspapers and their<br />\nrelative position. Recently we read a headline from<br />\nLafayette College's paper stating:<br /><br />\nWe Answer Now<br /><br />\nCENSORSHIP IS MODIFIED<br />\nAT FACULTY GATHERING<br />\nand the article reading:<br />\n\"Compulsory censorship of the editorial colurns of The Lafayette has been abolished by<br />\nfaculty action, and discretionary power to lift<br />\nthe existing censorship has been granted the<br />\ncommittee on publications, Dr. F. B. Hunt,<br />\nchairman of the Committee,announced to the<br />\nEditorial Board of Control yesterday.\"<br />\nThis ruling is not absolute as at the Hopkins, but it<br />\nis a large step in the direction of a free press.<br /><br />\nAbout A Free Press<br />\nIn reply to several letters which we have received and<br />\nthe many comments made a propos the Browder assembly situation, we state now that previously we had<br />\nwithheld our opinions entirely until the fact-finding committee had finished its work. The matter was too much<br />\nin doubt to warrant any comment until the actual facts<br />\nin the case could be gathered.<br />\nOn the front page can be found the report of an independent committee composed of two students who had<br />\nvoluntarily gone to an authoritative source to secure the<br />\nfacts of an incident about which the campus knew only<br />\na partial side, and conflicting rumors, and colored news.<br />\nWe had nothing to do with the committee. But<br />\nwe did know of its work, and we purposely restrained<br />\nany mention of the affair until the matter was cleared<br />\nup by the committee. In no case was there any deliberate suppression of news--by the administration or by<br />\nUS.<br /><br />\nAnother important consideraton here is in regard to<br />\nthe present administration set-up of the NEWS-LETTER.<br />\nA most important change has been made; there is a new<br />\neditor-in-chief. Even the editorial board is revamped. So<br />\nthe opinions expressed hare the conclusions of a new<br />\nNEWS-LETTER administration. Also now the Student<br />\nCouncil is officially and actually running assemblies.<br />\nThe NEws-LETTER plan is still being followed, and we<br />\nare continuing suggestions for speakers.<br />\nTo begin with, we accept the report of the committee<br />\nas factually sound. After all, the important points have<br />\nbeen made by the one person who is in the unique position of knowing. And besides we have the statement<br />\nfrom President Bowman declaring in no uncertain terms<br />\nexacly how he feels in the matter.<br />\nSo there is not much point in discussing post-mortems when little can be established and nothing can be<br />\ndone practically. The important things is the future<br />\nand the fundamental principle of a Hopkins tradition<br />\nand vertebrate of our reputation.<br />\nRight now we should like to follow President Bowman's opinion on the matter and suggest Earl Browder<br />\nor some other well-known and authoritative speaker<br />\nwho represents a similar viewpoint on a program which<br />\nis balanced by the other side or sides on the problem<br /><br />\nopportunity to get clear away from<br />\nhimself and surroundngs, perhaps the<br />\nmost valuable single gain is in critical appreciation of writing and the<br />\nsubjects. For . you meet a vast new<br />\nworld of types and situations in reading even five novels, selected very<br />\nmuch at random, and to decide whether they hold truth and value for you<br />\nis in itself a broadening exercise.<br />\nIn addition, it cannot be denied<br />\nthat the sad experience of many a<br />\nyoung person turned out of college<br /><br />\n• THE NEW<br /><br />\nMr. Woollcott Sponsors<br />\nMr. Alexander Woollcott, the amazingly effective Town Crier, whose<br />\nhuman comment delights a large<br />\naudience in written and spoken word,<br />\nhas singled out for his special praise<br />\na pair of detective stories which were<br />\nwell on their way to being forgotten<br />\nunder the weight of new mystery fiction which forms a large part of<br />\nAmerica's reading interest. Ranking<br />\nthem with the best of their kind—<br />\nthe immortal Conan Doyle's \"Sher-<br /><br />\nDENTISTRY<br />\nA Phase of Preventive Medicine<br />\nCollege Men find in it unusual<br />\nopportunities for a career<br />\nHARVARD UNIVERSITY<br /><br />\nPhi Beta Kappa members are never selected until<br />\nMarch of their senior year and because, together with<br />\nsenior Tau Betes, they compose the committee, Leonard<br />\nhas a month to prepare ground. He has started by<br />\nasking members of the engineering fraternity to begin<br />\nthinking along critical lines and in March, he expects<br />\nto make a formal call to the student body. It is essential<br />\n--because the committee has such a short lie—that<br />\nstudent complaints be matured and gathered in the<br />\nmoments Phi Betes are chosen, that tne committe may<br />\nswing immediately into action.<br />\nLeonard will take care that the Voice speaks well.<br />\nIt is the privilege of the student body to discuss and<br />\nconsider right now, the suggestions it may have to<br />\nmake next month.<br />\n---Lehigh Brown and White.<br /><br />\nLetter To The Editor<br />\nTo the editor of the NEWS-LETTER:<br />\nNow that Dr. Bowman has cleared up the issue by<br />\nsaying anyone was welcome as Assembly speaker as a<br />\npart of a balanced program, why not invite the rejected<br />\nextremist, Earl Browder, making it clear to the sensitive public that he is merely one of a group of talkers<br />\non the general subject, Modern Problems in Political and<br />\nSocial Reform? or some such title.<br />\nAs long as our b'hoys seem to have declared their<br />\nIntellectual curiosity in Mr. Browder and what he might<br />\nhave to say, this would be a solution to the problem<br />\ncreated by that curiosity, and with no injury to the<br />\nUniversiy; nor would it draw any objections from authoritative sources, if we believe Dr. Bowman.<br />\nIntelectualmente Curioso.<br /><br />\nBy<br /><br />\nAp<br />\ndance<br />\nbeen<br />\npresic<br />\nbanqt<br />\nmake<br />\nforth(<br />\nDamn<br /><br />\nfresh]<br />\n'It'd<br />\nornff<br />\nFro<br />\ncl<br /><br />\n!nate!<br />\nC<br />\nion,<br />\nhid J<br /><br />\nJeff l<br />\nHall,<br />\nZaver<br /><br />\nHerbs<br /><br />\nThe<br />\nt ion c<br />\n!lien,<br />\nFre<br />\n\"It th<br />\nthis V<br /><br />\nMu<br /><br />\nDENTAL SCHOOL<br />\nA competent course of preparation for<br />\nthe dental profession. A \"Class A\"<br />\nSchool. Write for catalogue.<br />\nLEROY M. S. MINER. D.M.D.. M.D.. Dean<br />\nDept. 9, 188 Longwood Ave., Boston, Mass.<br /><br />\nThe<br /><br />\nSUCCCE<br /><br />\nthe m<br />\n11111MEM<br /><br />\nApril<br />\non A<br /><br />\nMEM<br /><br />\nSchool<br />\nAt<br /><br />\n_e, also, had a<br /><br />\ntively<br />\nCray<br />\ntion<br /><br />\nvariou<br /><br />\nConsidered Criticism<br /><br />\nThe sudent body has a voice in faculty affairs. For<br />\nnine months in the year it is a mute voice, but, when it<br />\nspeaks, it is clear and effective.<br />\nBorn as recently as last March the Tau Beta Pi-Phi<br />\nBeta Kappa student criticism committee is already on<br />\na permanent basis. The president of the 1937 committee has just been appointed. He is Lehigh's Rhodes<br />\nscholar, Nelson Leonard, Tau Beta Pi member and president of Omocron Delta Kappa. His task is to see that<br />\nthe Voice speaks intelligently and wisely, and that it<br />\nis heard justly and honestly.<br />\nHis committee hears any and all reasonable complaints and criticisms, by students, of faculty members,<br />\ncourses, and other administrative affairs; votes on each<br />\nquestion, and passes on its decision and comments to<br />\nPreident Williams, who in turn, acts on the committee's<br />\ndecisions as his administration deems best. One important point not to be overlooked—all proceedings<br />\nare conducted in secreacy with absolutely no faculty<br />\ninterference. The results this committee achieves are<br />\nknown only by observation of any faculty changes or<br />\nmodifications which might have arisen from this criticism.<br /><br />\nFri<br /><br />\norgani<br /><br />\nGRAND TOUR<br /><br />\nMehlit<br /><br />\nRydst]<br /><br />\nTake a squint at the family archives over this<br />\nEaster vacation—the daguerreotypes of the<br />\nGrand Old Grad off on his GRAND TOUR, and<br />\nhis exuberant letters home: \"indescribable luxon ship\"...\"swift, eagle-like flight of pasuries<br />\n••••<br />\n,•••••.$•••••• .fts•<br />\n\"Nanio<br />\nsage\"...\"truly epicurean fare\"...\"hospitality<br />\nwedded indissolubly to perfection in seamanand \"the delightful fellow voyagers,among them one whose beauty makes me<br />\nship\"<br />\ntremble like an aspen leaf e'en as I pen these inadequate lines in her blushing praise.\"<br />\nOf course, the dears met on either HAMBURG-AMERICAN LINE or NORTH GERMAN LLOYD,<br />\nthose express services founded in 1847 and 1857 in the charming Hanseatic cities of<br />\nHamburg and Bremen.(Lots of adjectives, Greek Letter fraternities and romances have<br />\nhad this shipboard origin during the past 80 and 90 years.)<br /><br />\nthe North German Lloyd swift expresses BREMEN and<br />\nEUROPA, and palatial COLUMBUS; the Hamburg-Americcm<br />\nLine's Famous Four Expresses—NEW YORK,HANSA,HAMBURG,<br />\nDEUTSCHLAND wherein Cabin Class, even in the height of<br />\nseason, is only $171 up to Irish-English parts, with $5 more<br />\nto Cherbourg, $13 more to Hamburg.<br />\nTake Your Car Along...More than1400 with uslast year.Ideal<br />\ntouring abroad. Ask for booklet: \"Motorbridge to Europe\".<br />\n..that's consulting<br />\nLike having the Dean for a father-in-law.<br />\nwith our EDUCATIONAL SERVICE DEPARTMENT. All about<br />\n.Summer Courses Abroad and Specials in Arts and<br />\nSciences at German Universities(just like Grandfather did)<br />\nand all other matters concerning Students on Grand<br />\nTours. Personal Consultations arranged on your inquiry.<br /><br />\n90 PEARS<br /><br />\n\"THE<br />\nSERVICE ON<br /><br />\nCOLLEGE ORCHESTRAS<br />\non Summer Sailings<br />\nExpresses from New York midtown piers to mid-European<br />\nports—Cobh, Southampton,<br />\nPlymouth, Cherbourg,<br />\nHamburg or Bremen.<br /><br />\nEuropa . .<br />\nDeutschlanb<br />\nColumbus .<br />\nnew god; . .<br />\nBremen . . .<br />\nqamburg . •<br />\nEuropa . . •<br />\nfiansa . . •<br />\nDeutschlanb •<br />\nColumbus . .<br />\n•<br /><br />\nJune 19<br />\nJune 20<br />\nJune 26<br />\nJune 27<br />\nJune 30<br />\nJuly<br /><br />\n1<br /><br />\nJuly<br />\nJuly<br />\nJuly<br />\nJuly<br /><br />\n7<br />\n8<br />\n15<br />\n15<br /><br />\nQUICK —YOUR TRAVEL AGENT,<br />\nif you want to pick your accom-<br /><br />\nmodations in Cabin Class,<br />\nTourist or Third Classes. Delay<br />\nIs hazardous. Or inquire of—<br /><br />\nSEAS<br /><br />\nSERVICE ON THE sE.44<br />\n80 YEARS NORTH<br />\nGERMAN<br />\nLOY()<br /><br />\nMen a<br />\npresid<br /><br />\nof EUROPE<br /><br />\nFor these LINES set the pace of luxury-security-speed<br />\nthat leads right through the ages (with almost Fourteen<br />\nMillion passengers carried) into our 90th and 80th Anniversaries in the ultra modern way....<br /><br />\nAlla<br /><br />\nare th<br /><br />\nford J<br /><br />\nfice of<br /><br />\nAt I<br />\nClub<br />\nness ii<br />\nates it<br />\nmemb<br />\n4—<br /><br />\nth,<br /><br />\nWh2<br />\nStuder<br />\nevery<br />\nAnd s<br />\nThorm<br />\nbut<br />\nknow<br />\nAnd a<br />\nTER is<br />\nMake<br />\nWeak,<br />\nWhich<br />\nTER cc<br />\nreforn<br />\ntell m<br /><br />\nEve<br />\ni$ ano<br />\nways<br />\nMust<br />\nlike ti<br />\nOh Tc<br />\nleave<br />\nIne, 1<br />\nlag.\"<br /><br />\nTak<br />\nWhich<br />\nour is<br />\ndrums<br />\nphilosi<br />\nWande<br />\nsearch<br />\nIDumk<br /><br />\nHitler<br />\nway.<br /><br />\nto pie(<br /><br />\n323 North Charles Street, Baltimore<br /><br />\nDea<br />\nand I<br /><br />\na<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 16, 1937<br /><br />\nIncident<br />\nMcGovern Named Browder By<br />\nFactReported<br />\nFrosh Banquet Head Finding Committee<br />\nBy Dan Kirkwood<br />\nHamilton Heads Dance Committee Represented<br />\nWidely<br />\nAppointments to the freshmen class<br />\ndance and banquet committees have<br />\nbeen announced by Dan Kirkwood,<br />\npresident of the freshman class. The<br />\nbanquet committee is to plan for and<br />\nmake<br /><br />\narrangements regarding<br /><br />\nforthcoming<br /><br />\nthe<br /><br />\nbanquet.<br /><br />\nfreshman<br /><br />\nDances, as discussed at the recent<br />\nfreshman class meeting, will be planned and reported on by the dance<br />\ncommittee.<br />\nFrank McGovern has been appointed chairamn of the banquet committee. Serving under him are Maurice Conorey, Dick Green, Bob Vernon, Harry Brayshaw, Ray Cluster,<br />\nand John Billovits.<br />\nFraternities Represented<br />\nHeading the dance committee is<br />\neff Hamilton with committee John<br />\nHall, Hal Jaffee, Ernest Keiney, Joe<br />\nZavertnick, Ed<br /><br />\nLothian<br /><br />\nand<br /><br />\nJohn<br /><br />\nHerbst.<br />\nThese men represent a wide selection of fraternity and non-fraternity<br />\nInen.<br /><br />\nFreshmen will render their decision<br />\non the new budget system by vote<br />\nthis Wednesday.<br /><br />\nMusical Club<br />\nPlans Banquet<br />\nIlection<br /><br />\nFor Next Year's<br />\nTo Be Held At<br />\nBanquet<br /><br />\nOfficers<br /><br />\nThe culmination of one of the most<br />\nsuccessful season ever enjoyed by<br />\nthe musical club will be its banquet<br />\nApril 15th preceded by a final concert<br />\non April 9 at the Catonsville High<br />\nSchool Catonsville, Maryland.<br />\nAt the banquet, which is tenta-<br /><br />\ntively<br /><br />\narranged to be given at the<br /><br />\nray Goose Inn, Baltimore, an election will be held for positions on the<br />\nvarious staffs and divisions of the<br />\norganization.<br />\nAllan Pinkerton and John Ghinger<br />\nare the nominees for president. Three<br />\nmen are nominated for the two vicepresidential offices. They are Bud<br />\nMehling, Harry Hopkins, and Herb<br />\nRydstrom. Thomas Ellis and Bradford Johnson are running for the office of Business Manager.<br />\nAt the last meeting of the Musical<br />\nClub J. Judge Mehling, present business manager of theClub who graduates in June, was appointed ex-officio<br />\nmember of the Business Staff.<br />\n•<br /><br />\n.<br />\n•••••••,111..M./..-.11...!..411.,•••••••••••••••••11,-.N<br /><br />\nSuperfluosity<br />\n'<br /><br />\no the Editor of the NEWS-LETTER:<br /><br />\nWhy is it there are so many funny<br />\nstudents here? They are found in<br />\nevery corner of the Halls of Hopkins.<br />\nAnd so many of them, too. There is<br />\nThomas Dukehart, Algernon Mimby<br />\n-but why go into details? You must<br />\nknow what I mean. So many . . .<br />\nAnd another thing, if the NEWS-LETTER is going to exist, why doesn't it<br />\nmake a healthy attempt at it. So<br />\nweak, so futile, this world of ours in<br />\nWhich the Johns Hopkins NEws-LETTEE could play such a healthy part in<br />\nreforming it, but just won't. Can you<br />\ntell me, dear Editor, why this is?<br />\nEverybody is always talking. That<br />\nis another point I wish to make. AlWays talking. And saying nothing.<br />\nMust this go on? There is no saying<br />\nlike the one which says: \"That this<br />\nOh Too Solid Flesh would melt, and<br />\nleave the world to darkness and to<br />\nme, Graves Energy notwithstanding.\"<br />\nTake all the pseudo-philosophies<br />\nWhich are stuffed ram-jammy into<br />\nour innocent and unsuspecting eardrums, and there you have it. My<br />\nPhilosophy of Life. Me. A weary soul<br />\nWandering through the centuries in<br />\nsearch of piece. And what do I get.<br />\nDumkopfs with pipe dreams. Like<br />\nHitler and Mrs. Reuben Ross HalloWay. People who hate what they got<br />\nto pieces and want us to have it.<br />\nDear editor, Hurrah for the Black<br />\nrid Blue!!<br /><br />\nGREEK LETTER NOTES<br />\nGREEK LETTER NOTES<br /><br />\nBy SEYMOUR SACKS<br />\nDeadline for articles to be printed<br />\nMehling And Morrow Release Facts;<br />\nin the column is each Friday afterAttempt To Draw No<br />\nnoon. Communications should be adConclusions<br />\ndressed to Box 1026 or to the NEWSLETTER office.<br />\n(Continued from Page 1, Col. 4)<br />\n* * *<br />\nstatements in answer to questions by<br />\nKAPPA ALPHA<br />\nDr. Bowman:<br />\n1. \"Dr. Bowman definitely did not<br />\nDon Wooden was recently elected<br />\nrefuse permission to anyone to speak Number I of the local chapter of<br />\nat an assembly. I have repeated more ICA.. Charles Councilman and Bill<br />\nthan once that neither Dr. Bow- Schmied were chosen Numbers II<br />\nman, Mr. Macaulay, nor Dean Berry and III respectively. These men will<br />\nrefused to permit anyone to do so.\" assume office at the joint installation<br />\nIt was disclosed that at no time of officers for this province.<br />\nduring the discussion between DiaIt seems that the Soph Engineers<br />\nmond and Dr. Bowman was the name didn't enjoy themselves at one of<br />\nof Earl Browder mentioned by Dia- Kappa Alpha's tea dances Sunday<br />\nman, and that both Dr. Bowman and afternoon. The reason? A Materials<br />\nMr. Macauley understood when ap- quiz on Monday.<br />\nproached by Diamond that nobody<br />\nannounce the<br />\nThe frater also<br />\nhad yet been invited to speak. Dia- pledging of Lindsay Scheer to the<br />\nmond told Mr. M.acauley that no in- Fraternity.<br />\nvitation had been issued.<br />\n* * *<br />\n2. Questioned as to whether Dr.<br />\n• Holt Maulsby, head of the S.A.C.;<br />\nBowman said extremists and comFrank Crist, Barnstormer business<br />\nmunists were not welcome on the<br />\nmanager, and Billy Erlanger, ancampus, Diamond said: \"As I recall,<br />\nother member of the S.A.C.—all of<br />\nDr. Bowman and Mi.. Macaulay said<br />\nwhich positions iinvolve the handling<br />\nthat personally they did not think it<br />\nof finances—have each just purchased<br />\ndesirable for people of that calibre<br />\nPlymouth convertible coupes. Nice<br />\nto speak at an assembly, unless the<br />\nwork, b'hoys.<br />\nassembly program be balanced by<br />\n*<br />\nspeakers with different ideas on that<br />\nTAU ALPHA OMEGA<br />\nparticular subject.\"<br />\nDiatold<br />\nBowman<br />\nAlvin Savage was elected Chancel3. Asked if Dr.<br />\nmond to tell the Student Council that lor of TAO last week. Other officers<br />\nit was unconstitutional for the S. C. are Sigmund Safier, Vice-chancellor;<br />\nto delegate assemblies to the NEWS- Max Iskowitz, Treasurer; Harry NierLETTER, Diamond answered: \"No.\" enberg, Scribe; and Jewett Gold4. Asked by the fact-finding com- smith, Historian.<br />\nA banquet and dance for members<br />\nmittee if he had called Diamond in to<br />\nBrowder, Mr. Macaulay of the Fraternity will be thrown a<br />\ndiscuss<br />\nstated: \"Mr. Bowman informed me<br />\n•<br />\nthat Diamond had a problem he wished<br />\nto discuss, and I asked Diamond in. I<br />\ndid not know of the nature of the<br />\nproblem before I spoke to Diamond.\"<br />\n5. Diamond stated: \"I definitely<br />\ntook the initiative in discussing the<br />\nwhole assembly question with Dr.<br />\nBowman.\"<br />\n6. The committee asked Dr. Bowman why he declined to write to<br />\nWoodring, Secretary of War, asking<br />\nhim to speak here, after the Browder question came up. Dr. Bowman<br />\nsaid: \"I called in Hershner Cross<br />\n(president of Student Council) and<br />\ntold him that I couldn't write to<br />\nWoodring because this might imply<br />\nthat I was willing to write to Woodring and not to Browder.<br />\n7. Diamond said: \"When the Young<br />\nCommunist League approached me<br />\nabout an assembly, I found a date,<br />\nchecked on names, and said that the<br />\nNEWS-LETTER Editorial Board would<br />\nprobably 0. K. the assembly. I do<br />\nnot recall whether or not I said that<br />\nthe Y. C. L. could go ahead and send<br />\nthe invitations, but I do know that I<br />\ntold them that the final decision<br />\nwould depend upon the Editorial<br />\nBoard.<br />\n8. Finally, the committee asked<br />\nDiamond if Dr. Bowman brought<br />\npressure to bear by asking Diamond<br />\nto hear his opinion or in any other<br />\nway. Diamond said: \"I took the initiative in asking the personal opinions of the Administration on this<br />\nquestion, and I have repeatedly said<br />\nthat neither Dr. Bowman, Mr. Macaulay, nor Dean Berry said that we<br />\nmust not have Browder, or any one<br />\nelse.\"<br />\nDr. Bowman said: \"My position in<br />\nte matter is, if you're going to have<br />\nan assembly program and invite any<br />\nextremist, Right or Left, make sure<br />\nin your announcement that the University is not endorsing the cause of<br />\nan extremist.<br />\n\"If you're going to have an extremist, why not announce him as part<br />\nof a balanced program?\"<br /><br />\nShipment By Express<br />\nPopular Among Students<br />\n\"Getting away from college, reaching'home and seeing to the safe transportation of baggage containing precious mementos of college days are the<br />\nchief concerns of the thousands of<br />\ncollege men and women who are now<br />\nleaving for Easter vacations,\" C. R.<br />\nGraham, Vice President of the Ralway Express Agency., said today.<br />\n\"The students take care of themselves, but the Agency has been increasingly active each year, in taking<br />\nover the job of calling for trunks and<br />\nseeing to it that they are speedily dispatched to their destination. The<br />\nfeature of pick-up and delivery appeals to the young men .and women<br />\nwho wish to dash from dormitories to<br />\ntrains, without having to worry<br />\nabout their baggage,\" Mr. Graham<br />\nstated.<br /><br />\nweek after the initiation of Leon Quitt,<br />\nDaniel Gidinsky, and Joe Samovitz<br />\non March 13.<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nDELTA PHI<br />\nSt. Elmo has spring in their bones<br />\nand lead in their—pencils. So God<br />\nhelp the women. The boys are saving<br />\ntheir money and building up their<br />\nsystems to withstand the frivolities<br />\naccompanying the forthcoming pointto-points in the Valley.<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nBETA THETA PI<br />\nThe Betas are denying any rumors<br />\nto the effect that some of them were<br />\ntarred and feathered last week. They<br />\nclaim that the truth of the matter is<br />\nthat while they were tarring the roof,<br />\nthe wind played some tricks on them.<br />\nMoe Bradford, Master Beta, has<br />\nbeen so successful in planning social<br />\nfunctions for the school, that the boys<br />\nhave entrusted their social gatherings at the fraternity house to him.<br />\nYe olde Beta House is in A-1 shape<br />\nthese days. With new curtains, new<br />\nwallpaper, fancy paint jobs, and no<br />\nleaks in the roof, she's a sight for<br />\nsore eyes.<br />\n* * *<br /><br />\nit GOESI<br /><br />\nYour<br /><br />\nVacation<br /><br />\nworry,<br />\nfuss or<br />\nwithout any<br />\nnation-wide<br />\nlast,<br />\naway<br />\nback. by<br />\nbaggage gets<br />\nand<br />\nconvenient-it home<br />\nship<br />\nsure and<br />\npiup<br />\ncksale,<br />\nwhen you<br />\nSwift,<br />\nt<br />\nEZrellS.<br />\nRemember, promp<br />\nand<br />\nRailway<br />\ncities<br />\ncost.<br />\neconomical<br />\ncharge, in all<br />\nspecify<br />\n03Ctre.<br />\nat low<br />\nto<br />\nWitUOUli<br />\nsure<br />\ndelivery,<br />\nof<br />\nservice (be<br />\nand<br />\nnearest office<br />\ntowns. For<br />\nthe<br />\nprincipal<br />\ncall), phone<br />\nto<br />\nexact time<br />\nthe<br /><br />\ntold<br /><br />\nPHI SIGMA DELTA<br />\nThe Phi Sigs are resuming their<br />\npolicy of holding at least one weekend party each semester. They claim<br />\nto be the only frat on the campus at<br />\nwhich out of town girls stay during<br />\nsuch an affair—with a chaperon, of<br />\ncourse.<br />\nMilt Tuerk was appointed manager<br />\nof the year's soft ball team, which<br />\nthe fraternity is entering into the<br />\nleague<br /><br />\nCharles &amp; Fayette Sts.<br />\nVernal 0600<br /><br />\nDepot Office: 208 E. Franklin St<br />\nVernon 0600<br />\nBaltimore, Md.<br /><br />\nPA!LWA<br /><br />\nXPRES's<br /><br />\nGEISCY.<br />\nAGENCY N. JINC.<br /><br />\nNATION - WIDE<br /><br />\nRAIL- AIR<br /><br />\nSERVICE<br />\n•<br /><br />\nRuby Keeler says:<br /><br />\n\"Luckies are a light smoke that treat a<br />\ntender throat right\"<br />\n\"In a way, it's easier to keep in condition as a dancer than as a singer.<br />\nExercise can keep the muscles in<br />\nshape, but there are a lot of things<br />\nthat can go wrong with the voice and<br />\nthroat. It stands to reason, then, that<br />\nany actress wants a cigarette that is<br />\ngentle and strikes the right note with<br />\nher throat. I started smoking Luckies<br />\n4 years ago. They're a light smoke<br />\nthat treat a tender throat right.\"<br /><br />\nLOVELY WARNER BROS.STAR<br />\nNOW APPEARING IN<br />\n\"READY, WILLING AND ABLE\"<br /><br />\nAn independent survey was made recently<br />\namong professional men and women—lawyers,<br />\ndoctors, lecturers, scientists, etc. Of those who<br />\nsaid they smoke cigarettes, more than 87% stated<br />\nthey personally prefer a light smoke.<br />\nMiss Keeler verifies the wisdom of this preference, and so do other leading artists of the<br />\nradio, stage, screen and opera. Their voices are<br />\ntheir fortunes. That's why so many of them<br />\nsmoke Luckies. You,too,can have the throat protection of Luckies—a light smoke,free of certain<br />\nharsh irritants removed by the exclusive process<br />\n\"It's Toasted\". Luckies are gentle on the throat.<br /><br />\nTHE FINEST TOBACCOS\"THE CREAM OF THE CROP\"<br /><br />\nA Light Smoke<br />\nit's Toasted\" Your Throat Protection<br />\nAGAINST IRRITATION—AGAINST COUGH<br />\nCopyright 1937, The American Tobacco Company<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 16, 1937<br /><br />\nIntramural Boxing Tourney<br />\nClimaxed By Crowning Of<br />\nFour New School Champions<br />\nWinners In Each Division<br />\nTo Receive Gold<br />\nCharms<br />\n125<br />\n145<br />\n155<br />\n175<br /><br />\nlb.<br />\nlb.<br />\nlb.<br />\nlb.<br /><br />\nClass R. H. Reynolds<br />\nClass- Elmer Almquist<br />\nClass-Harry Brayshaw<br />\nClass -\"Reds\" Richards<br /><br />\nTHIS SPORT WORLD<br />\nii<br /><br />\nBLA CK<br />\nAND<br /><br />\nBLUE<br />\nBY HAL ZHEUTLIN<br /><br />\nSportlight<br /><br />\nSynopsis Of Intercollegiate Sports In Various States;<br />\nPitt Battles Temple For Top Honors<br />\nAs intercollegiate Conference Ends<br /><br />\nPittsburg, Pa.-As the Eastern In- ling in the Middle Atlantic State<br />\ntercollegiate Basketball Conference Tournament. They scored 26 points<br />\ndraws to a close, Pitt is battling Tem- to defeat Gettysburg.<br />\nple for top honors. Temple held the<br />\nChicago,<br />\nan eastern tour,<br />\nforemost position, but Temple's upset<br />\nDe Paul University copped two of<br />\nby the Mountaineers from the Unithree court games. Victories were<br />\nversity of West Virginia enabled Pitt<br />\nmarked up over St. Johns of Brookto deadlock the Philadelphia team.<br />\nlyn and St. Joseph.<br />\nBethlehem, Pa.-Lehigh wrestlers<br />\nUniversity of Richmond, Va.completed their dual meet season<br />\nwith a 21-15 victory over Navy. The Richmond's star, Bill Lumpkin, after<br />\nmatmen of the University of Lehigh competing in the Maryland-Fifth<br />\nRegiment track meet, was invited to<br />\ncopped five of the eight bouts.<br />\nAlfred, N. Y. - - Playing its last enter a collegiat meet at Notre Dame.<br />\nmatch, the court men of Alfred Uni- Lumpkin holds the two-mile record<br />\nversity dropped a 38-35 to Colgate. of the Maryland meet.<br />\nAnnapolis, Md.-On an all-star<br />\nThis lost broke Alfred's seven game<br />\nwinning streak.<br />\nbasket ball team, Paul Menton, sports<br />\nDetroit, Mich.-The University of editor of the Baltimore Sun, placed<br />\nDetroit cagers chalked up another two St. John's cagers on his team.<br />\nwin by downing De Paul University Lambros, high scoring forward, and<br />\n29-24. It was Detroit's ninth win De Lesio, guard, were honored by<br />\nagainst four setbacks.<br />\nMenton. A strong fencing team repEaston, Pa.--Starting track early, resenting St. Johns with a record of<br />\nLafayette opened its season with a seven wins and no defeats left on a<br />\n61-39 victory over Swarthmore. La- southern tour. They will play Wilfayette's matmen also were victorious liams &amp; Mary, Rollins, Georgia Tech,<br />\nin intercollegiate competition wrest- , North Carolina and V. M. I.<br /><br />\nWinter Rears Its Ugly Head<br />\nGlancing about we notice that Old<br />\nThe Intramural Boxing Tourna- Man Winter refuses to yield his doment held under the direction of the main to the ever-encroaching spring<br />\nIntramural Committee was conducted and the mass of sports mentors are<br />\nlast Thursday at the gymnasium. Al- in a perplexing position. Continual<br />\nthough there were not enough fighters snowfall and persistent cold weather<br />\npresent to allow bouts in each class, has confined eager athletes to the inthere were a number of matches in doors. Coach Kels Morrill and his<br />\nrugged stickmen are preparing to<br />\nfour divisions.<br />\nthat coveted national crown<br />\ncapture<br />\nHuffman<br />\nH.<br />\ndivision<br />\nlb.<br />\nIn the 125<br />\nwas drawn to fight A. H. Smith, by working out on the gymnasium<br />\nwhile R. H Reynolds was given a floor. Coach Bob Owings and his<br />\nbye. Huffman won his initial scrap diamond stars are forced to take their<br />\nballs and bats to the Gilman cage.<br />\nby scoring a technical knockout over<br />\nCoach Waldo Hambleton has hopes of<br />\nSmith in the second round of their<br />\ntraining his cinderpath enthusiasts<br />\nscheduled three-round fracas. Howat a local indoor track. Coach Jean<br />\nclass<br />\nthis<br />\never, in the final bout of<br />\nHofmeister finds there is little hope<br />\nHuffman met his superior in Reynaexercising his tennis group among<br />\nfor<br />\nolds. The referee's card awarded<br />\nthe snow-flakes.<br />\nReynolds 30 points for the three<br />\nAre Jays Sissies?<br />\nrounds to Huffman's 26.<br />\nIn the past few years boxing has<br />\nLyman Weakens<br />\nmade notable strides in collegiate cirElmer Almquist scored a decisive<br />\ncles and has now manifested itself as<br />\ndecision over John Lyman to capture<br />\none of the foremost winter activities.<br />\nthe 145 lb. title. Lyman started out<br />\nNo doubt boxing will go far and soon<br />\nwell but seemed to wear down as<br />\nConcludes<br />\nwill reach a par of commercialism 1 9 3 7 Season<br />\nthe battle progressed. It was Almonly surpassed by the king of all,<br />\nWith Sherman, Peale,<br />\nquist's better physical condition that<br />\nfootball. With such a growing interenabled him to carry off the prize.<br />\nAs Stars<br />\nest in the technical skill of fighting,<br />\nThe scoring was as follows: 10-10it should seem strange that none has<br />\n10 for Almquist and 9-8-9 for Lyrpan.<br />\nspread to Hopkins. The crux of the Team Records Four Losses<br />\nThe 15g lb. battle between Harry<br />\nwhole matter is that a disappointingly<br />\nAgainst Two Wins;<br />\nBrayshaw and W. Freyer was ansmall number of students participated<br />\nother close contest with Referee Ed<br />\nSt. J. Victors<br />\nin the annual intramural boxing<br />\n_<br />\nLotz giving Brayshaw the nod with<br />\nchampionships. So few in quantity<br />\n30 points to 27 for Freyer.<br />\nJohns Hopkins fencing team<br />\nThe<br />\nwere they that it's an injustice to conStiff Battle<br />\nsider those, who so gamely took part finished its 1937 fencing season on<br />\nThe Richards-Gillelan battle for the<br />\nas crowned title holders. It is hoped March 5 at home when it just fell<br />\n175 lb. championship proved the<br />\nthat next year boxing will achieve the short of a victory against Virginia<br />\nclosest of the entire tourney. Richards<br />\nattention it rightfully deserves.<br />\nMilitary Institute. The match ended<br />\noutslugged his erstwhile opponent to<br />\nOur Slim Chances<br />\ngain a 10-6 margin in the first round,<br />\nwith a score of 9-8.<br />\nIn the past few weeks the newsbut Gillelan staged a brilliant comeThe first bout for the J.H.U. fencers<br />\npapers have been exposing, as it were,<br />\nback in he second round to get the<br />\nthe championship possibilities of St. was against Maryland on Jan. 15<br />\nreferee's choice at 10 points to eight.<br />\nJohn's, Maryland, etc., in lacrosse.<br />\nwhich ended in a narrow margin for<br />\nIn the final and deciding round \"Reds\"<br />\nSpeaking for the Hopkins, let us say,<br />\nRichards managed to eke out a two<br />\nAlaryland to the tune of 9-8. The boys<br />\nin an unbiased (?) way, the Blue<br />\npoint margin and the title.<br />\nshowed<br />\nplenty of skill and spirit but<br />\npossibilities,<br />\nhowhave<br />\nJays, it seems<br />\nThere were no bouts in the 135<br />\never slight as they may appear to the not enough to overcome the Marylb., 165 lb., and heavweight classes<br />\nsports writers. Are Swindell, Kobl, landers. The J.H.U. men dropped anbecause the coptestants failed to<br />\nSiegal, Naylor, Ghinger, Kaufman,<br />\nother game to St. Johns on Feb. 9 at<br />\nshow up. Millard Kaufman, a 165<br />\nYearley, Melvin, Hines, Dukehart,<br />\npound and considered the best boxer Beeler, Bernnheim, Mewshaw, Love, Annapolis However the foilers made<br />\nin the school, was present but because Kempton<br />\nand Blucher slight? Not a comeback on Feb. 17, against Maryhis opponent, Phil Greenberg, was<br />\nquite-you ought to see them throw land, 14-13. Sherman, Peale, and<br />\nnot available, so he was unabled to<br />\nsnowballs!<br />\nSmall starred in that match; Sherbe accorded the title of his class.<br />\nman won 3 out of 3 in saber and 2<br />\nThe winners in each division will<br />\nout of 3 infoils while Small won 3<br />\nbe the recipients of a gold charm<br />\nout of 5 In foils. Several substitutes<br />\nthe contribution of the Intramural<br />\nwere used in this affair.<br />\nCommittee.<br /><br />\nBlue Jay Fencers Lacrosse Men Get<br />\nLose To V.M.I., 9-8 New 1937 Rulings<br /><br />\nBaseball Practices<br />\nContinue At Gilman<br />\nCountry School Cage<br /><br />\nTwo Matches ByMail<br />\nPractice Sessions Guided By Coach<br />\nRiflemen To Shoot Bob Owings; First Game Two<br /><br />\nHowever, the fencers bowed to<br />\nNavy on Feb. 20, 10-7. In this match,<br />\nSherman and Small proved their ability at the foils both winning all of<br />\ntheir matches in the foil division.<br />\nThen on March 5. Hopkins was defeated by Virginia Military Institute 9-8. The J.H.U. boys leaped into<br />\nthe lead by v4nning' the first 5<br />\nmatches Theye were unable to keep<br />\nthe pace and netted VM.I. a victory.<br /><br />\nFaceoff And Offside Penalties<br />\nAre Changed At Meeting Of Association<br />\nMen Are Confined To Two<br />\nDefinite Areas On<br />\nField<br />\nAt a meeting of the Intercollegiate<br />\nLacrosse Association, the rules committee, at the suggestion of \"Father<br />\nBill\" Schmeiser, passed several rulings which will go into effect in this<br />\nseason of 1937.<br />\nThe first ruling concerns the face<br />\noff. The old ruling provided for three<br />\nmen behind the center line. The new<br />\nprovision provides for \"all cases<br />\nwhere the ball is forced in the center of the field each team shall confine the goal tender and two other<br />\nplayers in the defense goal area, two<br />\nplayers in the attack goal area and<br />\none player in each of the two wing<br />\nareas.<br />\nWhen the whistle sounds<br />\nstarting play, the players shall be immediately released from the two<br />\nareas.\"<br />\nFor infraction of the offside rule<br />\nthe penalty is 30 seconds instead of<br />\nthe former 60 second layoff.<br /><br />\nIntramurals<br />\nTomorrow afternoon, three intramural teams consisting of the winners<br />\nof the graduate volley ball league,<br />\nthe interclass basketball league the<br />\nfraternity basketball league, will go<br />\nextra-mural when they meet the University of Maryland at College Park.<br />\nThe Kappa Sigs will represent the<br />\nHopkins in the frat basketball match<br />\nwhile the Chemistry team will play<br />\nthe volley ball game. At the same<br />\ntime, the representative badminton<br />\nteam will meet the University of<br />\nMaryland at the Hopkins gym.<br />\nOn Thursday, a Western Maryland<br />\nVolleyball team and Handball squad<br />\nwill be entertained by the Jays at<br />\nHomewood in the afternoon.<br /><br />\n--Weeks Away<br />\nUniversity of Hawaii R. 0. T. C.,<br />\nVarsity baseball practice was held<br />\nU. of California Are<br />\nSaturday at the Gilman Country<br />\nlast<br />\nOpponents<br />\nSchool cage under the active guidance<br />\ngathThe Hopkins rifle team will meet of Coach Bob Owings. A smaller<br />\nbepresent<br />\nwas<br />\nweek<br />\nlast<br />\nthan<br />\nering<br />\nits final competition after vacation<br />\nwhen it will shoot matches by mail cause of the inclement weather.<br />\nThose who participated in matches<br />\nThe practice was mainly devoted to<br />\nwith the University of Hawaii<br />\nduring<br />\nthe past season are Captain<br />\nposipitching<br />\nR. 0. rg. C. and the University of Cali- the candidates for the<br />\nPeale<br />\n(sabre), Sherman, three<br />\npositions.<br />\nA<br />\ninfield<br />\nthe<br />\nfor<br />\nand<br />\ntions<br />\nfornia rifle teams on April 10.<br />\nweapon<br />\nman, Small, Silver, Reed, and<br />\nheld within the<br />\nOn March 13 the Jay team lost two practice game was<br />\nHormel, foil, Davis epee and Harris<br />\noutfieldservices<br />\nof<br />\nthe<br />\nwithout<br />\ncage<br />\nmail matches, one to the University<br />\nsabre.. The team was under the capaof Missouri by a score of 1430 to 1362 ers, substituting the nets for the fly- ble<br />\ndirection of Paul Kaiss.<br />\nchasers.<br />\nand the other to the Indiana UniverPractice<br />\nDrill<br />\nsity R. O. T. C. sharpshooters to the<br />\nLen Rubinger, veteran hurler and<br />\ntune of 1354-1325. Lindenmayer was<br />\nMilberg, bolstered the showing of<br />\nIra<br />\nhigh scorer for the losers with a tally<br />\npitching staff with high hopes<br />\nthe<br />\nof 278 in each match.<br />\nthe other candidates who did<br />\nheld<br />\nfor<br />\nThe score card shows 16 wins and<br />\nconsidering<br />\nthe lack of practice.<br />\nwell,<br />\n16 losses for the Black and Blue this<br />\nA spirited infield drill was held Records Show Jays To Be On Par With Other Schools<br />\nseason. The team lost only two of<br />\ngame. Clisham and<br />\nits seven shoulder to shoulder after the practice<br />\nIn Minor Amateur Play; Won<br />\nHarthe, first baseman and shortstop,<br />\nmatches.<br />\n140 Games And Lost 136<br />\nrespectively, showed up well in practice with Alperstein, Romanofsky,<br />\nThe records of the varsity major<br />\n'34-35 '35-36 '36-37 Total<br />\nTennis Schedule<br />\nTraggis and Price alternating at the<br />\nW.L. W.L. W.L. W.L.<br />\nand minor teams aid only to make<br />\nother infield positions.<br />\n2 6 0 5 1 6 3 17<br />\nApril 9----J. H. U. vs. Swarthmore.<br />\nTh next practice will be held today evident the fact that the Hopkins is Football<br />\n4 11 2 12 8 10 14 33<br />\nAt home.<br />\nat the field near Levering Hall, if the able to hold its head athletically as Basketball<br />\n3 2 4 2 .. . 7<br />\n4<br />\nLacrosse<br />\nApril 16-J. H. U. vs. Duke. At home. weather permits. In case of bad<br />\nhigh as the all-tooted and praised<br />\nApril 23--J. H. U. vs. Lehigh. Away. weather notices will be posted for the<br />\n9 19 6 19 9 16 24 54<br />\nTotals<br />\nApril 24- -J. H. U. vs. Lafayette<br />\nnext meeting of the team. With the subsidized teams.<br />\n7 0 7 1 2 1 16<br />\n2<br />\nThe only sports with continual glar- Fencing<br />\nAway.<br />\nfirst game against Towson only two<br />\n1<br />\n3 3 3 5 4 3 10<br />\nApril 27-3. H. U. vs. St. John's. At weeks away, baseball hopefuls are ing misfortune are those of football Wresting<br />\n4 0 5 1 8 1 17<br />\n2<br />\nlooking for a break in the weather so and perhaps basketball, although the Handball<br />\nhome.<br />\nCross Country 4 2 3 3 2 4 9<br />\n9<br />\nApril 29 -J. H. U. vs. Western Mary- that the team will be in the beat conlatter in the past year has shown im- Soccer<br />\n52 42 5414<br />\n8<br />\nland. Away.<br />\ndition.<br />\nprovement.<br />\nGolf<br />\n80 6<br />\n14<br />\n4<br />\nAll candidates for the freshman<br />\nMay 1-J. H. U. vs. Catholic. (Tent.)<br />\n13 12<br />\n7 6 6<br />\nprofessionalized Tennis<br />\nElimination<br />\nof<br />\nMay 4-J. H. U. vs. Loyola. At managerial post, which has not been<br />\n5 4 2 8 5 1 12 13<br />\nfilled as yet, should notify either play in colleges would produce the Swimming<br />\nhome.<br />\n33 15 .... . 4<br />\n8<br />\nMay 6 -J. H. U. vs. St. Johns. Away. Coach Owings or put a note in Man- records made by the minor teams Track<br />\nBaseball<br />\n1 7 7<br />\n8 13<br />\nthe<br />\nand<br />\nthroughout<br />\nsports,<br />\nH.<br />\nU.<br />\nJ.<br />\nager<br />\nBoshnak's<br />\nbox.<br />\n-Open.<br />\noffice<br />\nAspost<br />\nMay 8<br />\nMay 11 --J. H. U. vs. Loyola. Away. pirants for the position should also result would be gratifying to both<br />\n47 27 44 41 25 14 116 82<br />\nTotals<br />\nMay 14-4. H. U. vsl. College of try to be present at the next practice the student body and the prestige of<br />\nGrand totals 56 46 50 60 34 30 140 136<br />\nthe University as a whole.<br />\nWilliam and Mary. Away. which will be held today.<br /><br />\nMajor And Minor J. II. U. Sports<br />\nOver 3 Years---Read 'em And Weep<br /><br />\nDaniel Weiner<br />\nDan's a City College product of '32.<br />\n\"Back-stroked,\" \"free-styled,\"<br />\nand played water polo for \"school on<br />\nthe hill.\" . . . In addition was a lacrosse man for two years and ran<br />\nthe 70-yard dash (8:03). . . Matriculated in \"Dear Old Johnny Hopkins as<br />\nengineer in '33. . . . Varsity swimming 1, 2, 3.. . . Oaptain, 4. . . .Specialty: backstroke. . . . Other extracurricular activities, A. S. C. E.,<br />\nNews-Letter, cross-country,<br />\nutramural athletics.<br />\nDanny's made a brilliant swimming<br />\ncareer . . . Bettered Hopkins 150<br />\nyard backstroke record by 3 2-5 seconds... time 1:51.. . Note: The Hopkins torpedo took the Atlantic 100yard backstroke championship this<br />\npast summer with time of 1:09 1-10<br />\n. . . Also, has represented Baltimore<br />\nfor 4 years in meet between Baltimore and<br />\nWashington<br />\nAll-Stars<br />\nswimming teams . . . Likewise has<br />\n100 yard backstroke record for this<br />\ncompetition-1:07 4-5 . . . Keenest<br />\ncompetition of '37 season--Lehigh.<br /><br />\nJay Wallmen<br />\nBeat St. John's<br />\nBy 4-1 Score<br />\nJays Sweep Singles But Lose<br />\nDoubles Match To<br />\nJohnnies<br />\nFIVE STRAIGHT WINS<br />\nHandballers Go To Philly<br />\nFor Last Match On<br />\nSaturday<br />\nFor the third consecutive year,<br />\nthe Jay handball team has succeeded<br />\nin trimming the traditional rival St.<br />\nJohns squad to the melody of 4-1 at<br />\nthe Johnny four wall courts, Friday,<br />\nMarch 12.<br /><br />\nThe win marked the fifth consecutive victory for the Hopkins HandHe is the backbone of the campus bailers of this year since their<br />\ndefeat<br />\nmovement for a Hopkins pool . . . If<br />\nby Brooklyn College during the<br />\nand when the issue comes up he expects a student body backing -- and Christmas holidays. The Jay wallmen<br />\nhe's getting it! . . . Let's give three number among its victims L.I.U.,<br />\ncheers for \"little man, big stuff\" Dan- Universty of Pennsylvania, Police<br />\nny Weiner-the first for his record A.C. of Baltimore, Western Marybreaking; second for the pool movelands, and the University of Virginia.<br />\nment; third, for captaining the best<br />\nMilberg Victor<br />\nBlack and Blue swimming team in<br />\nIn the first single match against<br />\nyears!!<br />\nthe Johnnies, Iry Milberg defeated<br /><br />\nSun Selects<br />\nState Stars<br /><br />\nM. Hecht, the St. Johns number one<br />\nman by a score of 15-9, 15-11.<br /><br />\nIn the second singles match big<br />\nDick Pasternak just managed to defeat B. Goldstein of St. Johns by the<br />\nHerb Siegal Snares Forward close scores of 15-11, 15-13. In this<br />\nmatch the contestants were closely<br />\nBerth On Second<br />\nmatched and the victor was decided<br />\nafter a streak in the last game in<br />\nTeam<br />\nwhich Pasternak ran up ten points<br />\nHerb Siegal, leader of this year's to completely bewilder Goldstein.<br />\nBlue Jay quintet, was named captain<br />\nAlperstein Takes Close One<br />\nof the second All State team, selected<br />\nIn the third singles match Milt<br />\nby The Sun. Siegal was given one Alperstein put down R. Sommeville<br />\nof St. Johns, after stubborn resistance<br />\nof the forward posts.<br />\nThe Jay captain earned the honor by the score of 15-6, 15-3. This game<br />\nwas more closely contested than the<br />\nby his stellar floor playing, and his<br />\nscore indicates and the lead changed<br />\nrespected defensive ability. Besides be- hands quite<br />\na few times in the early<br />\ning one of the most effective men in part of each game before<br />\nAlperstein<br />\npoint average, with a fraction under finally defeated Sommeville.<br />\nIn the first doubles match, Milberg<br />\n10 points per game, Siegal has more<br />\nand Alperstein went down to unexdefensive cunning than most high<br />\npected defeat before Hecht and Goldscorers are required to have.<br />\nstein to the tune of 15-13, 15-10. The<br />\nHopkins combination played far beFour Years' Service<br />\nCaptain Siegal topped the leading low their usual form and suffered<br />\ntheir second defeat in varsity compeforwards of the Maryland Intercoltion in two years.<br />\nlegiate Lague in scoring, besides having the most foul points to his credit.<br />\nWin Second Deubles<br />\nHerb has seen action on the varsity<br />\nThe second doubles match was a<br />\nfive for the last four seasons, making brilliantly played game<br />\nwith Capt.<br />\nhis last the best. His consistent scor- Nat Finkelstein and<br />\nRed Glantz deing and good all around playing was feating Wright and Grey<br />\nof St. Johns.<br />\npartly responsible for the fine 36-37 This stellar combination<br />\nhave proved<br />\nBlue Jay basket ball record.<br />\nthemselves to be a good doubles team,<br />\nas this was their third consecutive<br />\nLambros Heads First Team<br />\nHerb lost a first team all-state win playing together.<br />\nThe Johnnies put a much better<br />\nberth to Mik Pellino and John Lambras, who are considered the best squad of men on the court than the<br />\ngroup that played last year, when<br />\nMaryland forwards.<br />\nThe Sun's selections are as follows: the Jays defeated them 7-0.<br />\nU. of P. Next Foe<br />\nThe Hopkins team travel to Philadelphia this Saturday to play the University of Pennsylvania on the latter's four wall courts. The Quaker<br />\n1-Jus are looking forward to avenging<br />\nthe defeat suffered by them at Homewood on the singles wall court. The<br />\nRed and Blue team defeated the Jay<br />\nSecond Team<br />\nsquad last year in the four wall game,<br />\nHerb Siegal, F., Johns Hopkins.<br />\nand the match Saturday will determFrank Apichella, F., Mt. St. Mary's. ine<br />\nwho takes the lead in the series<br />\nAlex Zebrowski, C., Washington.<br />\nwhich now stands at one match<br />\nEdward Pulvino, C., Baltimore.<br />\napiece.<br />\nStan Kopie, G., Mt. St. Mary's.<br />\nCaptain, Siegal.<br />\nBest Bet, Apichella.<br />\nSports Schedule<br />\nFirst Team<br />\nMike Pellino, F., Baltimore.<br />\nJohn Lambros, F., St. Johns.<br />\nVic Probst, C., Baltimore.<br />\nTom Carney, G., Layola.<br />\nCharley Keller, G., Maryland.<br />\nCaptain, Lambros.<br />\nBest Bet, Probst.<br /><br />\nWEDNESDAY<br />\nEXTRA MURAL<br />\nPRAT BASKETBALL-Represented<br />\nby Kappa Sigma<br />\nJohns Hopkins vs. U. of MaryThis business of providing for the<br />\nland. At College Park.<br />\nvarious sports the proverbial freshmen managers has indeed become, in INTERCLASS BASKETBALL<br />\na word, irksome to the esteemed<br />\nJohns Hopkins vs. U. of Maryland.<br />\ncoaches and their managers proper.<br />\nAt College Park.<br />\nWhere are the freshmen?<br />\nGRADUATE VOLLEY BALL<br />\nJohns Hopkins, represented by<br />\nBreathes there a frosh with soul so<br />\nChemists vs. U. of Maryland. At<br />\ndead<br />\nCollege Park.<br />\nWho never to himself hath said,<br />\nTHURSDAY<br />\nThis is my own, my Black and Blue,<br />\nHANDBALL<br />\nJay Vee<br />\nWhose heart hath ne'er within him<br />\nJ. H. U. vs. Western Maryland. At<br />\nburned<br />\nHomewood.<br />\nAs dormward his footsteps he hath<br />\nVOLLEY BALL<br />\nturned<br />\nJ. H. U. vs. Western Maryland. At<br />\nFrom LOAFING at the J. H. U.<br />\nHomewood.<br /><br />\nSir Walter Scott<br />\nCalls lorManagers<br /><br />"}], "field_media_file": [{"target_id": 39092, "display": null, "description": null, "target_type": "file", "target_uuid": "3f28a540-66a9-4d57-bcc8-9af8de6092bc", "url": "http://digital.library.jhu.edu/system/files/2022-03/12768-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12768, "target_type": "node", "target_uuid": "0da5fc57-8df5-4a3f-870e-c80ed9e5c6ad", "url": "/node/12768"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "a3828e88-4e4b-4f50-abf5-87fd05aabd2d"}]}