{"mid": [{"value": 38077}], "uuid": [{"value": "e2939b04-9f75-44d4-a651-d25dd5fd110a"}], "vid": [{"value": 38077}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:47:19+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12645-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:47:19+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:47:19+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "opkitts Nruisi.firttrr<br />\n<br />\nirmommi<br />\n<br />\nin<br />\nIs<br />\n<br />\nMember Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nWEAK-MINDED FRESHMEN?<br />\n(EDITORIAL)<br />\n(See Page 2)<br />\nPrice<br />\n<br />\nHOME WOOD, BALTIMORE, MD., FRIDAY, OCTOBER 18, 1935<br />\n<br />\nVol XL—No. 6<br />\n<br />\nans<br />\n<br />\n;ht;<br />\nled<br />\nGus<br />\nare<br />\nOn.<br />\n<br />\nout,<br />\nDefor<br />\nof<br />\nht.<br />\n<br />\nthe<br />\n; of<br />\nv ith<br />\nwho<br />\nlast<br />\n<br />\n'ned<br />\nexoff-<br />\n<br />\nion,<br />\nmd<br />\nfull<br />\n<br />\n0111111r<br />\n<br />\nJay Team Opens<br />\nGrid Season On<br />\nShore Saturday<br />\n<br />\nCheerleaders Wanted<br />\nAmong Upper Classes<br />\nUpperclassmen are urged to come<br />\nout for positions on the cheerleading squad, Reuben Baer, coach<br />\nof the cheer-leaders, stated.<br />\n\"So far, the sophs, juniors, and<br />\nseniors have shown a hesitancy to<br />\ntry out for this activity,\" he continued. \"We hope to mold a wellgroomed bunch which will be a<br />\ncredit to the University, as tbe<br />\nupper classes need not feel reluctant to try their hand at this,\"<br />\nBaer added.<br />\nTen boys have been practicing<br />\nevery afternoon in the gymnasium<br />\nunder Baer's tutelage. From this<br />\ngroup, a team of from five to seven members will be chosen.<br />\n\"The cheer-leaders will be at all<br />\nmajor athletic contests, but will<br />\npreviously try to standardize the<br />\ncheers,\" Baer asserted.<br />\n<br />\nStrong Washington College<br />\nTeam To Furnish Gruelling Test To Varsity Team<br />\n<br />\nIs Annual Game<br />\nDarleymen Possess Spirit,<br />\nFast Backfield; Tough<br />\nWell-Drilled Men In Line<br />\nThe Blue Jay football team will<br />\nofficially inaugurate the 1935 season<br />\nwhen they encounter a highly touted<br />\nWashington College eleven at Chestertown tomorrow afternoon. A whistle<br />\nwill be blown, a ball booted high in<br />\nthe air and a spirited, untried Hopkins team will pry the lid off the<br />\n<br />\nDr. McComas Publishes Scientific<br />\niews On Spiritualistic iVlediums<br />\n<br />\nSponsors Picked<br />\nFor Grad Dance At<br />\nY. M.C. A. Tonight<br />\n<br />\nGhosts I Have Talked With\" Author Reveals ExperiEn \"Ghosts<br />\nences With Psychic Phenomena; Refuses Comment,<br />\nSaying He Already \"Talked Too Much\"<br />\nElves, hobgoblins and errant spir- a medium intrigue you? Would you<br />\nits, and the shadowy things that creep like to bring messages to your<br />\nby night—how do these look in the friends? Has the role of mystic an<br />\ncold hard light of scientific analysis? appeal for you? If so, hark back to<br />\nIn his latest book, which bears the the words of Sir Arthur Conan Doyle,<br />\nintriguing title of \"Ghosts I Have 'Nearly every woman is an undevelTalked With,\" just published by Wil- oped medium. Let her try her own<br />\nliams and Wilkins, Dr. H. C. McCo- powers of automatic writing.'\"<br />\nExperience Justifies Scorn<br />\nmas, lectures in psychology at the<br />\nMuch of his experience, however,<br />\nUniversity, discusses the application<br />\nof his scientific training to the high- seems to justify the fine scorn with<br />\nly controversial subject of psychic which we more enlightened souls<br />\nphenomena, in all its manifestations treat the subject of spiritualism.<br />\nfrom flying trumpets to automatic Some of the most readable matter<br />\nin the book is to be found in descripwriting.<br />\nDr. McComas has been, for some tions of the crude devices used by<br />\nyears, scientific investigator for the many popular mediums.<br />\nIt is with some humility that the<br />\nAmerican Society for Psychical Re-<br />\n<br />\nPiccolo Player Won't<br />\nDon R.O.T.0. Uniform<br />\nWANTED—A militaristic piccolo player. Apply to Ed Ottenheimer, Hopkins Band leader before next Monday at 5 P. M., when<br />\nthe Band, resplendent in R. 0. T.<br />\nC. uniforms, supplies the music,<br />\nfor drill. Must be willing to play<br />\nin uniform, without fear of becoming a Blackshirt (from the heat)!<br />\nThe reason for this ad is obvious: the Band has but one piccolo player, name withheld, and<br />\nhe is a member of the local branch<br />\nof the N. S. L.; hence, to supply<br />\nmusic for the local \"army\", would<br />\nbe bad enough to do so in their<br />\nuniform would be worse.<br />\nThe result is that on Mondays<br />\nthe Band will play only the deeper<br />\nnotes to Mars unless a patrioticminded successor appears.<br />\n<br />\nFive Cents<br />\n<br />\nPres. Describes<br />\nWest'sDroughts<br />\nTo Sophs, Frosh<br />\n<br />\nVaried Program<br />\nCarded For Rally<br />\nMon. In Playshop<br />\n<br />\nDr. Bowman Intimates That<br />\n\"Shelter Belt\" May Be Influencing Elections Factor<br />\n<br />\nTapped By Frat<br />\nPresident Illustrates Speech<br />\nWith Slides Of Farms,<br />\nMaps Of Dry Regions<br />\nAfter being presented with a laurel<br />\nwreath indicative of his induction into 0. D. K., President Isaiah Bowman<br />\nspoke to the assembly on the drought<br />\narea of the west, later pointing out<br />\nits possible national importance.<br />\nWith the aid of lantern slides, Dr.<br />\nBowman showed how erosion and<br />\nlack of cultivation was ruining the<br />\nfarm lands in the west. He also told<br />\nhow poor farming conditions were<br />\nfurther aggravated by natural causes.<br />\nDelving into his trip into the western farming lands, Dr. Bowman told<br />\nof the agricultural aspects he found<br />\nin this area. In this manner he supplemented the slides, many of which<br />\nwere photographs of the arid wastes<br />\nof the west.<br />\n<br />\nsearch. In this capacity, he has twite.1 author approaches his reader. \"To<br />\nsuch famous mediums as \"Margery\" publish another book on spiritualism<br />\n(says his foreword), while the spruce<br />\nand Cartheuser. Although he has<br />\nforests are being so quickly deplete- Playshop Scene Of Meeting<br />\nnever fallen victim either to the skep- ed to make the pages of<br />\nimportant<br />\nWhere Program, RefreshBowman To Address Group; ticism of Houdini or the blind faith works, would seem to be an economic<br />\nments, Talks Scheduled<br />\nAffair To Feature Ed Nor- of Conan Doyle, the author displays crime. No one who believes in spirithigh respect for the greater psychics ualism ever changes his opinion by<br />\nwood; From 8.30 To 1 and considerable amusement at the reading arguments against it. Few An entertaining program, including skits, talks by old and new Barnclumsy efforts of the charlatan. The who do not believe are won over by<br />\nand refreshments will<br />\nMembers of the Hopkins faculty in- summary of his experiences is there- anything they read. What possible stormers,<br />\nertown lads.<br />\nof the Hopkins Drarally<br />\nthe<br />\nmark<br />\nvited to serve as sponsors for the fore replete both with amusing anec- justification can there be for a book<br />\nThis led to a discourse on the merMaroon Squad Powerful<br />\nMonday, October 21, in<br />\nGroup<br />\nmatic<br />\nfirst graduate dance tonight in Lev- dote and interesting scientific mate- of this sort? None, so far as the auits<br />\nof the \"Shelter Belt\" which will<br />\nproduction<br />\nfirst<br />\nmost<br />\nThe<br />\nthe<br />\nof<br />\nPlayshop.<br />\none<br />\nthe<br />\nare<br />\nThe shoremen<br />\nthor can see. It is perpetrated at the<br />\nering Hall have just been named. rial.<br />\nof the season will be announced at probably be placed before Congress.<br />\nformidable elevens in the state. They are: Dr. and Mrs. Bowman, Dr.<br />\ninstigation of a number of insistent<br />\nNot So Skeptical<br />\nDr. Bowman stated that the shelter<br />\nthis gatherng.<br />\nSweeping victoriously through a diffi- Ames, Dean and Mrs. Berry, Dr.<br />\nScientific though he is, Dr. McCo- friends. It was their belief that the<br />\nthe first time in its history, belt would be definitely beneficial.<br />\nFor<br />\ncult schedule last season, they have Donald H. Andrews, Dr. Florence<br />\nmas is by no means so skeptical of point of view of a scientist who had<br />\nand it is the oldest activity on the<br />\nUsing colored map slides near the<br />\nalready trounced American Univer- Bamberger, Dr. and Mrs. Alan M.<br />\nsuperstitions and curious psychic ex- tried seriously to learn something<br />\ncampus, the Barnstormeers have se- end of his talk Dr. Bowman pointed<br />\nsity and outfought Swarthmore this Chesney, Dr. and Mrs. W. W. Cort,<br />\nas his degree and position about modern spiritualism would<br />\nperience<br />\nsured the services of a professional out the way in which the coming nayear. A veteran group, reinforced by Dr. Kent Roberts Greenfield, Dr. and<br />\nwill attest. He is thus willing to re- prove of value to many people who<br />\ncoach for their initial play of the tional election would be affected by<br />\nan ample supply of new material, the Mrs. R. W. Hagner, Dr. Karl Herzcount several curious tales without are interested but are neither believcoming season. Paul Hinrichs, ex- the condition of the farming areas in<br />\nmaroon team has brilliant possibilities feld, Dr. and Mrs. Duncan S. Johnson,<br />\nattempting to explain them except ers or unbelievers. I hope that they<br />\nBarnstormer and Hopkins graduate, the west.<br />\nfor repeating its 1934 performance. Dr. and Mrs. W. B. Kouwenhoven,<br />\nare<br />\nstories<br />\nright.\"<br />\nthe<br />\nof<br />\nThose<br />\nby spiritualism.<br />\nformerly connected with the TheaBecause of their experience and Dr. and Mrs. Warren H. Lewis, Dr.<br />\nDavid H. Levy, president of the<br />\nDr. McComas was no less modest<br />\nwhich deal with the scientific pheter Guild, the PlaymaSters, and other Omicron Delta Kappa Honorary frabulk the linesmen form a powerful and Mrs. Samuel 0. Mast, and Dr.<br />\nwhen<br />\nare<br />\napproached<br />\nfor comment on the<br />\nnomenon of automatic writing<br />\namateur theatrical groups of Balti- ternity, introduced President Bowforward wall. The ends are Jim Salter and Mrs. David M. Robinson.<br />\nparticularly interesting. In summar- publication of his work. He shook his<br />\nathversatile<br />\nboth<br />\nmore.<br />\nand Al Bilancioni,<br />\nman and also prestented him with a<br />\nThe affair, which will last from izing this form of spiritualism, Dr. head aggrievedly, and remarked, \"I<br />\nSears Gives Statement<br />\nletes who are as capable on the bask- 8:30 to 1, is sponsored jointly by the<br />\nlaurel wreath.<br />\nsays, \"Does the career of think 'I' is said too much already.\"<br />\nMcComas<br />\nZenas Sears, president of the<br />\netball court as on the gridiron. The Y. M. C. A. and the Graduate StuBefore this presentation, Levy said<br />\nBarnstormers, stated:<br />\ntackles are Kirby and Benham. Gal- dent Social Committee. Ed Norwood's<br />\na few words about the 0. D. K. He<br />\nbring<br />\npost<br />\nto<br />\nintended<br />\nis<br />\nrally<br />\n\"The<br />\nlant is stationed at the pivot<br />\nseven-piece orchestra will provide the<br />\nannounced that the fraternity selecttogether all persons interested in the<br />\nand flanking him are Tignor, a pow- music.<br />\ned its members from the outstanding<br />\ndewho<br />\ngroup, especially freshmen,<br />\nerful lad, and Anderson. Capable remen in extra-curricular activities on<br />\nBowman To Speak<br />\nsire positions on the production,<br />\nplacements for these varsity men are<br />\nthe campus.<br />\nDr. Isaiah Bowman, president of<br />\nhighly<br />\nbusiness or acting staffs. It is<br />\namong the reserves. Judged by their<br />\nthe University, will be present to<br />\nThere are five qualifications, a<br />\nessential that everyone attend this<br />\nperformance in the first game of the<br />\nmeet the graduate students for the<br />\ngood<br />\npart of which 0. D. K. candiPlay<br />\nTo<br />\nTomorrow gathering, for it will afford all who<br />\nHopkins Chapter To Find Band<br />\nseason, the second string linesmen<br />\nfirst time and will make a short<br />\ndates must fulfil in order to become<br />\nour<br />\nwhat<br />\nto<br />\nan<br />\ncome<br />\nintroduction<br />\ngroup.<br />\nare a scrappy, willing<br />\nFrom 9 Till 12 In Lever- group is like.<br />\nTrend To War And Fasspeech of welcome. A musical proa member of this national honorary<br />\nYoung Outstanding<br />\ngram will be rendered by three men,<br />\nIs<br />\nAdmission<br />\n$1.10<br />\ning;<br />\nThem<br />\nFight<br />\nTo<br />\n\"Many of the old-timers will be on fraternity, Levy stated. They are, he<br />\nPlans<br />\ncism;<br />\nFour veterans comprise the fast, two former Hopkins students and one<br />\nhand to greet the assemblage and said, character, scholarship, athletic<br />\nheavy backfield. Outstanding in this present student. Dr. Lawrence A.<br />\nThe second in a series of weekly they will certainly furnish some en- achievement, publications work and<br />\nthe third United<br />\nfor<br />\nIn<br />\npreparation<br />\nquartet is Gibby Young, diminuitive Petran, who received a Ph.D. in psyStates Congress Against War and dances given by the Cotillion Board tertainment. Besides this, a number other extra-curricular activities.<br />\nquarterback. Young—Hopkins fans chology in 1930, and who is now ReFascism, the Johns Hopkins chapter of the University will be held tomor- of Baltimores prettiest young acwill bitterly recall—was the brilliant search Associate at the Peabody<br />\nwill play host to the Baltimore area row night in Levering Hall. The tresses will be at the Playshop and<br />\nback who,twisting and turning, reeled Conservatory, will play the piano.<br />\na conference to be held at Lever- \"Townsmen\", popular Baltimore or- this in itself is attraction enough.<br />\nin<br />\noff a 102 yard run after he had in- Included among his selections is a<br />\nchestra, have been secured again to<br />\nHall on November 2 and 3.<br />\ning<br />\nTwo Plays Presented<br />\ntercepted a pass behind his own goal work composed by Dr. Donald H.<br />\nPreliminary conferences for this play at the dance which will last<br />\nThe Barnstormers presented two<br />\nline in the last Hopkins-Washington Andrews, of the chemistry departCongress which is to meet in Cleve- from 9 until 1.<br />\nplays last season for the first time in<br />\ntiff. This season again Young is in ment. Stuart LeCompte, graduate of<br />\nThe members of the Cotillion a number of years. They were \"See<br />\nAll students who are interested in<br />\nland on January 3, 4, 5, 1936, are befast form and has made several long two years ago, and now working in<br />\ning held all over the United States. Board, which is headed by Allen Del- Naples and Die,\" and \"The Road to joining the Rifle Club during the<br />\nruns, including a 90 yard dash against plant physiology, will sing. George<br />\nThe conference at the Hopkins will evett, includes D. Mead Johnson, Rome.\" This year's first production coming season are advised to sign<br />\nAmerican University.<br />\nSteiner, a freshman, who recently<br />\nup now with Sergeant Perry in the<br />\ndetermine the trends and develop- John L. V. Murphy, Jr., David Erck, will be given on November 14.<br />\nNicholson, Berry, and Huffman are won a competitive scholarship at the<br />\nNorth Loft of Gilman Hall. A new<br />\nment toward war and fascism and Brian Murphy, James Bradford, WilConcluding his statement, Sears<br />\nthe other varsity backs. Powerful and Peabody; will play the violin.<br />\nman, for his $2 dues, receives instrucmake special recommendations liam B. Kempton, John Ghinger, and said:<br />\nwill<br />\nshifty, they play a hard driving game<br />\ntion, if desired, targets, 50 rounds of<br />\nto the national Congress as to prog- J. Judge Mehling.<br />\nWhen we announce the play Monand are formidable opponents.<br />\nagainst<br />\nfight<br />\nthe<br />\nin<br />\ntactics<br />\nand<br />\neach week, the use of a<br />\nress<br />\nAny<br />\nmemfor<br />\naspirants<br />\nprospective<br />\nThree<br />\nDramas<br />\nBe<br />\nWill<br />\nday, work will begin in earnest. We ammunition<br />\n(Continued on Page 4, Col. 6)<br />\nwar and fascism.<br />\nbership on the Cotillion Board should have secured a fine coach and look rifle and of the 50-foot range in the<br />\nPresented By Playshop<br />\nreport to the Board Room in Lever- forward to a very successful season.\" North Loft. Returning members have<br />\nCleveland Congress<br />\nonly $1 dues to pay.<br />\nat Cleveland will be ing Hall on Tuesday at 12:20. At that<br />\nCongress<br />\nThe<br />\nDr. Fagin to Direct Plays in Celebraplan<br />\nthe<br />\nyear<br />\nfor<br />\ntime<br />\ncurrent<br />\nwork<br />\nthe<br />\ndiscussion<br />\nround-table<br />\na<br />\nThe range will open in the early<br />\non<br />\nrun<br />\ntion of the Fifteenth Annigeneral headings of: Youth, will .be explained in more detail Ex-Pres. Ames Invited<br />\nof November probably about the<br />\nthe<br />\npart<br />\nunder<br />\nversary of Group<br />\nwomen, labor, religion and education, Elections to the group are held in<br />\nsecond week. Tryouts for the Rifle<br />\nOhio<br />\nTo<br />\nInauguration<br />\nDr. Florence Rena Sabin, former<br />\nnational minorities, organizational June of next year.<br />\nTeam will start about a month later,<br />\nUnder the direction of Dr. N.<br />\nprofessor of history at the Hopkins,<br />\nstructure and tactics, and local deDr.<br />\nAt<br />\nGuests<br />\nAmes<br />\nAmong<br />\nTwelfth weekly scores for three positions—<br />\nBryllion Fagin, the Johns Hopkins<br />\nwas announced this week as the third<br />\nvelopments. Local branches will furprone, kneeling and standing, deterPresidential Induction At Ohio<br />\nPlayshop will celebrate its fifteenth<br />\nrecipient of the M. Carey Thomas<br />\nthe material from their local<br />\nmine a member's chances for placing<br />\nnish<br />\nState<br />\nUniversity<br />\nanniversary by presenting three plays<br />\nPrize of $5,000 for achievement by<br />\nstandpoint.<br />\non the team. Returning team memduring the coming season. `eJeppe of<br />\nwomen in science.<br />\nThe League Against War and Fasbers this year are P. W. Guild, Cathe Hills,\" by Ludvig Holberg, a faAmong the invited guests at the<br />\nDr. Sabin has been a member of<br />\ncism was started in Amsterdam by<br />\ndet major and team captain; Henry<br />\nplaywright,<br />\nopens<br />\nmous Danish<br />\nthe<br />\nJesse N. Borden, editor-in-chief of inauguration of Ohio State's twelfth Leber, and Don Noonan. J. A. Macthe Rockefeller Institution for MedHenri Barbusse. The idea in mind of<br />\nseason. Hermann Sudermann's \"The<br />\nNewsLetter, and David Levy, president on November 14 is former Williams is<br />\nthe<br />\n'al Research in New York since 1925.<br />\nsummer<br />\nthe<br />\nin<br />\nmet<br />\nthe delegates who<br />\nteam manager. A schedFires of St. John,\" a German drama,<br />\nmanager, will attend the In- President Joseph S. Ames of the ule of<br />\nbusiness<br />\nmember<br />\nwoman<br />\nShe was the first<br />\nof 1932 was to combine all peace ormatches with other colleges in<br />\nhas<br />\nfollows.<br />\nchoice<br />\nAs<br />\nthird<br />\nJohns<br />\nthe<br />\nyet<br />\nHopkins<br />\nUniversity.<br />\nconNews Association<br />\non the staff of the Institute and also<br />\nthe East is now being arranged.<br />\nganizations and organizations oppos- tercollegiate<br />\nnot been made.<br />\nThe selection of Dr. Herman Gervention which is to be held in Pittsfirst of her sex to be elected to memed to war and fascism and to decide<br />\nSherwood Anderson, well-known<br />\nburgh starting Friday, November 15. lash James has been made by the<br />\nbership in the National Academy of<br />\n(Continued on Page 3, Col. 6)<br />\nAmerican author; Prof. Kemp MaThe featured speaker of the first Board of Trustees and the faculty, Morphopolus To Talk<br />\nSciences.<br />\nlone, of the Department of English at<br />\nwill be the Honorable George H. who issued approximately 500 invitaday<br />\nTo N.S.L. On Greece<br />\nSpecialty Blood Diseases<br />\nthe University; and Mr. Ernst Feise, Dr. Bowman To Speak<br />\nEarle, Governor of Pennsylvania. On tions, extended to presidents of colThe majority of her time has been<br />\nof the German Department, will dewitness leges throughout the nation; the conAt International Party Saturday, the delegates willNebraska<br />\ndevoted to the study of blood and<br />\nMr. George Morphopolus will speak<br />\nliver lectures preceding the presenthe football game between<br />\nstitutional officers of the State of<br />\n-blood diseases, with particular attento the National Student League toscenes<br />\none-act<br />\nof<br />\ntation<br />\nfrom<br />\nvarious<br />\nand<br />\nPittsburgh.<br />\nof<br />\nOhio;<br />\nlearned<br />\nedupresident<br />\nand<br />\nDr. Isaiah Bowman, president of<br />\ntion to research on tuberculosis. Her<br />\nday at 1 o'clock Room B, Levering<br />\nplays.<br />\nThe editors of the three daily Pitts- cational societies.<br />\nthe Johns Hopkins, will speak at the<br />\ncontributions to science include disHall. His subject will be \"Recent Poto<br />\nDr.<br />\ncomesOhio<br />\nUniverJames<br />\nInternational Reception to be held burgh papers and representatives<br />\ncoveries concerning origin of lymlitical Developments In Greece.'.:.<br />\nsity<br />\nthe<br />\nof<br />\nUnivercampus<br />\nthe<br />\nfrom<br />\ndiswill<br />\nmen<br />\nLevernewspaper<br />\nand<br />\nin<br />\nbusiness<br />\n8:30<br />\nat<br />\nevening<br />\nphatics and functions of the white Heads Medical Research tomorrow<br />\n'According to reports in The Naing Hall. The party is being con- cuss problems of college journalism sity of South Dakota, where he had<br />\nand red corpuscles.<br />\nthe change from a Venizelos<br />\ntion,<br />\nHe<br />\nbeen<br />\n1929.<br />\nsucsince<br />\npresident<br />\nThey<br />\nRelations<br />\ntheir<br />\nin<br />\nof<br />\nlight<br />\nexperience.<br />\nthe<br />\nFriendly<br />\nthe<br />\nDr. Herbert Spencer Gasser, who ducted by<br />\nPresentation of the $5,000 prize<br />\nceeds the late Dr. Elmer Burritt dominated mock democracy to a<br />\nis<br />\nwhat<br />\nan<br />\nof<br />\nM.<br />\nY.<br />\naccount<br />\nwill<br />\ngive<br />\nalso<br />\nthe<br />\nby<br />\nsponsored<br />\nCommittee,<br />\n1915<br />\nin<br />\nfrom<br />\ndegree<br />\nM.D.<br />\nhis<br />\nWill be made on November 2, on the received<br />\nBryan in a line of distinguished pres- monarchy, implies a shift from Italthe Johns Hopkins University, has C. A. of the Johns Hopkins Univer- going on in their fields today.<br />\nBryn Mawr College campus.<br />\nidents<br />\nof this, the oldest university ian domination to British,\" Maus<br />\nthe<br />\nbe<br />\nwill<br />\nspeakers<br />\nthe<br />\nAmong<br />\nsity<br />\nthe<br />\nof<br />\nhead<br />\nnew<br />\nDr. Sabin, who was born in Cen- been appointed the<br />\nin<br />\nthe<br />\nNorthwest Territory. Former Darling, a member of the organizaJohn<br />\nDaniel De Lima, chairman of the former editor of the Pitt News,<br />\ntral City, Colorado, served as profes- Rockefeller Institute for Medical Represidents<br />\nof Ohio University include tion stated. \"In advent of a war bepresiMoore,<br />\nHerbert<br />\nTibby;<br />\nM.<br />\nK.<br />\nstated<br />\nCommittee,<br />\nRelations<br />\nForeign<br />\nFlexsor of histology at the Hopkins from search. He succeeds Dr. Simon<br />\nthat invitations had been issued to all dent of the Transradio Press Service, William Holmes McGuffey, author of tween Italy and Britain control of<br />\n1902-1925. She received her doctor's ner.<br />\nthe famous Readers, and William Grecian seaports would play an imHis work being that of a physiolo- non-American students who had reg- and probably Heywood Broun.<br />\ndegree in 1900 and was Assistant in<br />\nHenry Scott, a past president of Ohio portant role,\" he added, \"and we feel<br />\nconvention<br />\nthe<br />\nfor<br />\nHeadquarters<br />\nother<br />\nHowever,<br />\ntrY\".<br />\nthe<br />\nat<br />\nistered<br />\n50<br />\nlast<br />\nthe<br />\n\"In<br />\nsaid,<br />\nGasser<br />\nAnatomy from 1902 to 1903. From gist, Dr.<br />\nState University and at present Ohio that this talk will be very enlighten1905 to 1917 Dr. Sabin was an As- years the conquest of infectious dis- foreign scholars in the city are wel- will be the Hotel Schenley, in the<br />\ning.\"<br />\nUniversity's oldest living graduate.<br />\nPittsburgh.<br />\nof<br />\nheart<br />\ncome.<br />\nsociate Professor at the University. eases has been very successful.\"<br />\n<br />\ncurrent schedule.<br />\nThe game promises to be a crucial<br />\ntest for the Darley men. The maroon<br />\nand black will present almost intact<br />\nthe same powerhouse aggregation<br />\nthat handed the Jays a setback last<br />\nseason. However, showing an enthusiasm unequalled in recent years, the<br />\nHopkins squad will endeavor to cut<br />\nshort the victory march of the Chest-<br />\n<br />\nLeague Conference Townsmen Carded<br />\nTo Be Held Nov.2,3 At Second Cotillion<br />\n<br />\nRifle Club Members<br />\nUrged To Sign Up<br />\n<br />\nDr.Sabin Wins Prize<br />\nFor Work In Science<br />\n<br />\nBorden,Levy To Go<br />\nTo I. N. A. Sessions<br />\n<br />\n\f2<br />\n<br />\nHOME WOOD, BALTIMORE, MD., OCTOBER 18, 1935<br />\n<br />\nTbe Pews=letter<br />\n<br />\nDeaf, Dumb and Blind<br />\n<br />\nFashions In Love<br />\n<br />\nBy HAROLD M. KROPMAN<br />\nLord, how are they increased that trouble me:<br />\nMany are they that rise up against me . . . Psalm<br />\nIII, line 2 . . .<br />\nParticularly apropo is the above quotation just about<br />\nthis time. Seniors are being shown the dark and dismal side of life by having the senior essay list rubbed<br />\nover their faces, made into handkerchiefs and towels,<br />\nand ground up and placed in their food—just so they<br />\nwon't forget about it. Juniors are learning to spend<br />\ntwenty-four and forty-eight hours at a time parted from<br />\ntheir light o' loves. Sophomores and freshmen do battle<br />\nevery day with their arch-enemies, the profs. Quizzs,<br />\npapers and readings are thrust on everyone . . . Is<br />\nthere no peace?<br />\n<br />\n(From Reader's Digest)<br />\n<br />\nFounded 1897<br />\nSubscription per year<br />\nBy Mail<br />\n<br />\n$2.00<br />\n$2.50<br />\n<br />\nRemit subscription fees to Treasurer, Student Activities Council, Remsen Hall, Postoffice, Johns Hopkins University.<br />\nEntered as second-class matter December 3, 1909,<br />\nat the Postoffice in Baltimore, Md., under the Act of<br />\nCongress, November 3, 1879.<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods<br />\nby undergraduates of the Johns Hopkins University.<br />\nEDITORIAL DEPARTMENT<br />\nJesse N. Borden<br />\nEditor-in-Chief<br />\nIrving Leberfeld<br />\nManaging Editor<br />\nWilliam Diamond, Stanley M Finkel,<br />\nAssistant Managing Editors<br />\nHershner Cross<br />\nNews Editor<br />\nKenneth Zierler<br />\nSports Editor<br />\nAssistant Sports Editor<br />\nDavid Caplan<br />\nEdgar Kemler<br />\nFeature Editor<br />\nHarold Kropman, Jack Stein, Sidney Green,<br />\nColumnists<br />\nBUSINESS DEPARTMENT<br />\nDavid H. Levy<br />\nRobert Watkins<br />\nRobert Levi<br />\nWilliam Kempton<br />\nMelville Locker<br />\n<br />\nBusiness<br />\nAdvertising<br />\nCirculation<br />\nOffice<br />\nCopy and Filing<br />\n<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\n<br />\nBUSINESS STAFF<br />\nS. Prager, G. Willen, H. Linkoff, W. Erlanger,<br />\nN. Soifer, S. Tinley<br />\n<br />\nFriday, October 18, 1935<br />\n<br />\nWeak-Minded Freshmen<br />\n<br />\nIt is curious how fashions , rule<br />\neven in love making. The vogue fifty years ago was for a man to approach a lady in a very delicate manner and about halfway, he had to stop<br />\nshort. The woman was far too precious, too angelic, to touch. This<br />\nmust have made women feel very<br />\nsafe, but kind of desperate. The prin-<br />\n<br />\nSO THEY SAY<br />\n<br />\nIntercollegiates<br />\n<br />\n\"I am sure of one thing. America,<br />\nin formulating a clear, emphatic and<br />\naffirmative peace policy, will have<br />\nunbounded support from former European citizens who have seared on<br />\ntheir minds and hearts a memory<br />\nof war and the fear of war. I have<br />\nhad American citizenship only three<br />\nyears.\" — Benito Cimbalo, former<br />\nItalian citizen.<br />\n<br />\nPrincton students are complaining<br />\nabout the dirty dormitories.<br />\n* * *<br />\n<br />\nI<br />\n<br />\nOver 9,000 miles will be covered<br />\nby Colgate's football team.<br />\n<br />\nI<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\n91<br />\n<br />\n*<br />\n<br />\nA squad of 34 former college play- ?coi<br />\ners from the Pacific Coast will play<br />\nten football games in Japan this fall.<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\n\"Postcard from Yuma, Arizona: I asked a miss, \"What is a kiss,<br />\ncipal aim of a high-minded man was I just stepped out of a plane here<br />\nGrammatically defined?\"<br />\nnot necessarily to win the beautiful with the only girl and got off a lit- She. said, \"A kiss is a conjunction:<br />\ntle mot, which I thought, if I do say,<br />\nsir,<br />\ncreature he loved, but to sit in his<br />\nrather good. But she topped it by<br />\nAnd cannot be declined.\"<br />\nGr<br />\nroom<br />\nand have the right kind of<br />\nAnd then there is the new one about the constiremarking: 'The old sense of Yuma,<br />\n*<br />\n*<br />\n*<br />\npated driver who paid no attention to the honking<br />\ngentlemanly vapors about her.<br />\neh, baby?'\"-0. 0. McIntyre, New<br />\nA play in fie a As from the Emof a horn. This is a joke. If you don't get it, drop<br />\nOne of the most famous love lyrics York Day By Day.<br />\nporia bulletin:<br />\nme a note. P. 0. 653.<br />\n*<br />\n*<br />\n*<br />\nof this era, Lord Tennyson's thin litACT I<br />\n\"Government<br />\nin<br />\nBy<br />\nbusiness is like an<br />\n\"Filltm up again, McGinnis.\"<br />\nMiss Lanier, librarian, who once tried her hand at tle series of sighs, inserted as a song<br />\numpire<br />\ncoaching<br />\na<br />\nbaserunner.<br />\nIf<br />\nACT II<br />\nA<br />\npoetry, because she is the nice of Sidney Lanier, and in his poem about \"The Miller's<br />\nthat happened in the World Series,<br />\n\"Fillemupagain, McGinnis.\"<br />\nthen resigned herself to a less significant life, is study- Daughter.\" He says he wishes he<br />\nkins<br />\nthe park would be filled with pop<br />\nACT III<br />\ning library work at Harvard. She has a long way to were the<br />\nGiln<br />\ngirdle \"about her dainty bottles and brickbats.<br />\n\"Fillumupginnis.\"<br />\ngo to catch up to Miss Tiese.<br />\nteri;<br />\nwaist.\" If he were, he could hear her<br />\n\"If you let the professors run this<br />\nACT IV<br />\nPart of the space-saving equipment of the comcountry four years more, you won't<br />\nC.<br />\nheart<br />\nbeat,<br />\nhe<br />\n\"Finis!\"<br />\nexplains.<br />\nIt<br />\nmakes<br />\nhim<br />\nplete prefabricated home is built into the toilet seat.<br />\n*<br />\n*<br />\n*<br />\nting<br />\nquite excited to hear a lady's heart want to own even a good setting<br />\nIt weighs the sitter when he raises his feet.<br />\nhen.\"—Eugene Talmadge, Governor<br />\nThe officers of the Lehigh unit of retu<br />\nbeat, and apparently the only way he<br />\n—Business Week.<br />\nof Georgia.<br />\nthe R. 0. T. C. will be equipped with abs<br />\nsees how to do it is to get himself<br />\n* * *<br />\nleggings and puttees this year inToward A More Picturesque Speech<br />\ntur:<br />\nturned into a girdle.<br />\n'Say, tell me about these colored<br />\nstead of the riding boots. The stuThe train belched forth a traveler or two, and swalter(<br />\nIn the next stanza, however, he boys I gotta pitch against tonight. I dent officers are<br />\nmostly athletes with<br />\nlowed down a couple of fresh arrivals. Peppery exclahear they're pretty good. Gimme the<br />\noverdeveloped leg muscles and it has and<br />\nmations shuttlecocked to and fro. Again the locomotive changes his mind. He gets thinking dope, pal.<br />\nAre they hot stuff, sure been<br />\ndifficult to fit the men boots auc<br />\nuttered a raucous cry as it started off, dragging a dark about \"her balmy, balmy bosom\" and enough?\"—Je<br />\nrome (Dizzy) Dean, heretofore.<br />\nins<br />\nserpent behind „it, to disappear into the tunnel's maw. (1) wants to be a necklace instead. Then pitcher of St.<br />\nLouis Cardinals, just<br />\n* * *<br />\nThere's no one like him for getting up steam in the he could just rest and \"fall<br />\nmb<br />\nbefore<br />\nexhibition game in Baltimore<br />\nand rise\"<br />\nAll intoxicated persons will be<br />\nengine, but he can't stop at the platform (2) . . . His<br />\nSpE<br />\nall day and have a fine time. This Tuesday night.<br />\nkept out of the Ohio State stadium.<br />\nconscience was more his accomplice than his guide. (3)<br />\nSUI<br />\n* * *<br />\nthought works him up into such a<br />\nAs a test of sobriety, thumb wigglShe cast no bread upon the water unless it was sure<br />\nRei<br />\n\"In the Cathedral of St. Mary the ing will be tried.<br />\nto return a three-tiered layer cake (4) . . . He was state that he becomes very daring inoriginal Ark of the Covenant is bescr<br />\nenclosed in the monastery of his absorbd interests. (5) deed and says:<br />\n*<br />\n*<br />\n*<br />\nlieved to be preserved. Ethiopian<br />\nHe shook hands with me up to the elbow (6) . . .<br />\n\"And I would lie so light, so light<br />\nAt<br />\nthe<br />\nUniversity<br />\nof Holland,<br />\nhistory relates that when Solomon<br />\nEars like ventilators (7) . . . She wasn't exactly crossfreshmen must shave their heads and tril<br />\nI scarce should be unclasp'd at sent the son of his<br />\nhigh priest, with<br />\neyed—one of her eyes just ignored the other.<br />\nmay not use the doors. All entrances th<br />\nnight.\"<br />\nother sons of great dignitaries, to acMoonlight was poi,vderingthe world's face (8 . . . .<br />\nand exits must be made through the her<br />\ncompany<br />\nShebas<br />\nson, after his visit<br />\nAnd the song ends at that point,<br />\nHe looked down upon the marshland's smoking with<br />\nwindows.<br />\nto his father, the son of the high<br />\nse\\<br />\nmorning. (9) . . . The mosquito's plaintive hum and with this large bearded man presum* * *<br />\npriest took the original Ark of the<br />\nde(<br />\npointed address. (10)<br />\nably swooning away at the very idea<br />\nTwo-thirds of the students at the<br />\nCovenant with him, substituting an<br />\n\"cl<br />\nHe not only could neatly cock an eyebrow—he could of such ecstacy.<br />\nimitation ark, much to the indigna- University of Paris are Americans.<br />\nalso produce in his victim a feeling that he had aimed<br />\nThen take Mr. Thackeray.<br />\ni,t<br />\nHe tion of Solomon and that high priest.<br />\nand fired it. (11)<br />\ncan't very well wish he were a neckter<br />\n\"In justice to the high priest's son,<br />\nAn assignment at a mid-western<br />\nHe has a tremendous capacity for bleeding when lace, too, because Tennyson had that<br />\nit must be stated that an angel ap- university was to bring in a report<br />\nothers are wounded (12) . . . As sensitive as a seismo- big idea first, but he's got to get on<br />\npeared and gave him instructions on the Middle Ages. The professor<br />\ngraph (13) . . . Silent as a shadow. (14)<br />\na lady's breast some way or other.<br />\nabout stealing the ark.\"—Arthur received a review of \"Life Begins<br />\nat<br />\nShe held up her end of the conversation until it was So he decides he wants to be a violet.<br />\nBrisbane, columnist.<br />\nForty.\"<br />\nwa<br />\npractically perpendicular. (15)<br />\nThat is even better than wanting to<br />\nHe had caved in and gone down like a landslide (16) be a necklace; it shows he's more<br />\nha<br />\n. . . Anne of Brittany was expecting her first child of ethereal, and has sweeter and purer<br />\nbr,<br />\nthe new series (17) . . . If he had been a little machine thoughts. He delicately avoids night<br />\nrn<br />\ninstead of a little child, he might have grown up to be thoughts, too. He tells his girl that<br />\nfa<br />\na stam roller. (18)<br />\nall he wants of her, and the only kind<br />\ntic<br />\nA Pekingese—a cross between a muff and a chry- of love life he asks, is<br />\nsanthemum (19) . . . A forlorn dog with bowed head and<br />\nco<br />\n\"An hour to rest on that sweet<br />\ntail withdrawn from service. (16)<br />\nto<br />\nbreast,<br />\n1. Stefan Zweig. 2. Sir Arthur Solter. 3 Mrs. Dan<br />\nfo<br />\nAnd then contented, die.\"<br />\nMcCowan. 4. Margaret Widdemer. 5. Winifred Holtby.<br />\nof<br />\nIf a modern man were obsessed<br />\n6. Robert Louis Stevenson. 7. Archie Binns. 8. John Galsin<br />\nworthy. 9. Sinclair Lewis. 10. Charles F. Lummis. 11. with the noble ambition of being a<br />\nfa<br />\nZona Gale. 12. Virginia Faulkner. 13. Francis Brett violet, the family would take him to<br />\nin<br />\nYoung. 14. Walter Benton. 15. Weare Holbrook.<br />\n6. a psychiatrist. Yet that was once the<br />\nMark Twain. 17. Francis Hackett. 18. Gouverneur Mor- right way to woo a lady, and it may<br />\nin<br />\ncome back into fashion again—some<br />\nris. 19. Alexander Woolcott.<br />\na<br />\ngallant may be forlornly wishing he<br />\n—Readers' Digest.<br />\nsc<br />\nwere a coral lipstick.<br />\nle<br />\n<br />\nIn announcing the time for the election<br />\nof Freshman Class officers, D. Mead Johnson, president of the Student Council,<br />\noffered pertinent comment.<br />\nHe said, \"I would like to see every student pay serious attention to these elections.<br />\nTheir importance is too often disregarded.<br />\nHowever, it is easy to see that the election<br />\npf inept officers is a very serious matter.\"<br />\nThis statement is no doubt prompted h:y<br />\nthe action of the Class of '36 in electing<br />\nits Junior officers entirely unopposed. This<br />\nwas the first time in the history of the University that any class had elected its officers automatically.<br />\nA situation such as this is unhealthy. It<br />\nreveals that the class is either unanimously in favor of the candidates, or that politics<br />\nmake it useless to put an opposition candidate on the slate.<br />\nWhile there is some possibility that the<br />\nformer may be the case, its occurrence is<br />\n!Aare in an institgtion harboring so many<br />\ndifferent factions as the Hopkins. From a<br />\nknowledge of campus politics, it is easy to<br />\n*duce that some coalition of fraternities<br />\n;ot a strangle hold on the class during<br />\nthe frgshman and sophomore years and so sential to a good football game.<br />\n2ffectively beat down all opposition that it<br />\nAn analysis of the question as to why<br />\nFellow Foams<br />\nwas able to coast into all major offices in there is such a lack of spirit on the HopAt Freddie<br />\nthe third year.<br />\nkins campus entertains a rather confused<br />\nFrom this example it can be seen that mass of answers. Enthusiasm for the sports<br />\nA LETTER TO THE<br />\nJnce any particular group gets into power, at Hopkins has always been a questionable<br />\nEDITOR<br />\nt is hard to shake it from its position. And, 'subject covered by the assertion that Hopinfortunately, the attitude on this campus kins is a place for scholars alone; the ref- My dear Mr. Editor-in-Chief:<br />\nI am a man of very few words-las been to sit back, assume an apathetic erenck. being that study and athletics are but—!<br />\nlir, and say, \"Oh, well, we couldn't do any- incom,patible. It is certainly out of order As a stude of this here<br />\nnoble<br />\nhing, even if we wanted to.\" In public life, o claim that the Hopkins student is not versity I will not stand for allUnithe<br />\nis well as in campus life, the line of least the type. The effervescent attitude of the nasty-nasty remarks about fraternity<br />\n7esistance is to sit back and let the profes- students during any of the past Frosh- men. This statement may seem a bit<br />\niional politician take complete control, and Soph weeks is enough indication to war- hot-headed, but I'm mad—mad as<br />\nthe Dickens! (please excuse all strong<br />\nnstitute a corrupt system to further his rant contradiction on the point. It is fur- language).<br />\nher out of order for anyone to claim that<br />\n)wn ends.<br />\n\"Interfrat Freddie's Filth\", indeed!<br />\nfootball<br />\nis not wanted by the student body. Such a thing!<br />\nThe only way for a class to keep from<br />\nWe boys won't stand<br />\n'ailing into this political stagnation is for The olerwhelming majority in favor of for it—we just won't!<br />\n.veiry member to take an active interest in football at the student poll last year gives onWhy must we have such a person<br />\nour<br />\ncampus? Why? Why<br />\nhe elections and by his vote keep out the un- enough evidence to disprove this erroneous was he lovely<br />\nborn?<br />\nnotion.<br />\nlesirable elements which are always ready<br />\npoor deah boys of the S. P.<br />\nAt the beginning of this year there was, E.The<br />\nhouse feel badly their beau-ti-ful<br />\no slip into public office merely for the<br />\nhowever, an unmistakable enthusiasm, not home called a \"hovel\" . . . Oh! I<br />\n;raft attached thereto.<br />\nonly for football, but a general spirit un- could just scratch out your eyes.<br />\nAs no one faction has as yet gained any derlying the student body. Whatever<br />\nthe This might be a little firm and<br />\n!ontrol, The Freshman Class is starting reason, this has now practically disappeare hard on you, Freddie—but you must<br />\nd. be put in your<br />\nvith a clean record. Its first election is a Where football is concerned some blame<br />\nplace.<br />\nthe you bad, bad boy! Don't forget—<br />\n!rucial one, because it will demonstrate faulty schedule—claiming that<br />\nin addition I can see no reason—none at all—<br />\n:hat the class of '39 is either a group of iLo a very late beginning, the first<br />\ntwo to make a column so uncouth. (If<br />\nveak-minded babies who can be bossed by I ames are played away, a fact<br />\nwhich gives you must be indecent, be indecent by<br />\n'professional\" politicians, or a group of ithe student body ample<br />\ntime to lose inter- all means; but, er, be indecent.) Of<br />\nhinking men who are anxious to perform ,est. Maybe that is<br />\ncourse, I realize. that I am taking a<br />\nthe case—maybe not! lot<br />\non my shoulders to write this—I<br />\nheir duty to themselves and their class.<br />\nAt any rate, there is apparently a definite guess<br />\nI'm just a devil.<br />\nlack of that indefinable collegiate vitality All I can say is, if you don't stop<br />\n1 n the campus now. It has already been writing about the Alpha Delts \"blood<br />\nmachine\" (which is a lie!)—<br />\nFootball And Spirit<br />\nI ointed out that past events indicate this to testing<br />\nyou're<br />\na<br />\nword! Oh! to think I<br />\n1be just a dormant characteristic at the time. have beendirty<br />\nable to control myself for<br />\nThe spirit on the campus is hardly inThe Hopkins football team is something the period I have. Is it any<br />\nwonder<br />\nicativle of the fact that the first game of Lo be proud of. It is a college team true to I'm<br />\njust bubbling over?<br />\nhe current season is only one day off. o the sense of the word—one of the few In closing, may I say that I hope<br />\nFortunately, the football squad itself is ]remaining teams whose athletes are subsi- you will take this to heart. A public<br />\nmbued withh enthusiasm enough to carry (ized in no way whatsoever. Men composing apology in the next issue of our dear<br />\nt a long way towards a successful year. It I he team are out for th sport's sake itself: paper will be accepted in good spirit.<br />\nlove you to address it to me—<br />\nLevertheless lacks the ardent backing of I or no other reason. It's a team 'worth I'd<br />\nyou rat!<br />\nn interested student body which is so es- J-ooting for.<br />\n\"BILLY\".<br />\n<br />\n[11<br />\n<br />\nHOUGH large,the Bell System is simple in structure.<br />\n<br />\nT<br />\n<br />\nThink of it as a tree.<br />\nBranches: 24 associated operating companies, each<br />\nattuned to the area it serves.<br />\nTrunk: The American Telephone and Telegraph<br />\nCompany, which coordinates all system activities.<br />\nRoots: Bell Telephone Laboratories and Western<br />\nElectric, whose functions are scientific research and<br />\nmanufacture; Long Lines Department of A. T. and T.,<br />\nwhich through its country-wide network of wires links<br />\ntogether the 24 operating companies, handles overseas<br />\nservice; Advisory Staff of A. T. and T., which advises<br />\nthe operating companies on all phases of telephone<br />\noperation and searches constantly for better methods.<br />\nWorking as one, these<br />\nmany Bell System units en- Why not call your folks<br />\nable you to talk to almost tonight?<br />\nFor lowest rates,<br />\nanyone, anywhere, any time.<br />\ncall<br />\n<br />\nby number after 7 P. M.<br />\n<br />\nBELL<br />\n<br />\nTELEPHONE SYSTEM<br />\n<br />\n\f3<br />\n<br />\nHOME WOOD, BALTIMORE, MD., OCTOBER 18, 1935<br />\n<br />\n9r.BurtonTalks Flying Circuses<br />\nOn Shakespeare<br />\nBefore Teachers<br />\n<br />\n1<br />\n<br />\nMARRIAGES A LA CAMPUS<br />\nBy FLORENCE HAXTON BRITTEN<br />\nAdvance Quotations From \"Red Book\"<br />\n<br />\nTalking About<br />\nFrats<br />\n<br />\nMeets, Discusses<br />\nYear's Program<br />\n<br />\nThey're getting married at college are kept secret, they are necessarily<br />\nWith all the talk about improper<br />\nAre To Discuss Fraternities<br />\nThrilling Incidents of the Old Gates<br />\na followed by deceptions and falsificathese days! Seniors, juniors, even<br />\na little story about a New<br />\nrushing,<br />\nFlying<br />\nCircus<br />\na<br />\nsource<br />\nare<br />\nthe<br />\nwhich<br />\nultimately<br />\ntions,<br />\njoined<br />\nred<br />\nAt Next Meeting Tuesday;<br />\nfew sophomores have<br />\nYork chapter might prove interesting.<br />\nmarch to the altar anh said their \"I of unhappiness to family and friends,<br />\nTurnbull To Address Frosh<br />\nBy GORDON GRAHAME DUCE<br />\nIt appears that Hell Week had just<br />\nbut more particularly to the man and<br />\ndo's.\"<br />\nflock<br />\nthe<br />\namong<br />\n137- ?opularity Of Shalfud Bard From 1919 to 1924<br />\nI decided to find out, if I could, the girl who continually make them a started, and the brothers wanted to<br />\nLay<br />\nof so-called \"flying circuses\", the<br />\nof this student rush toward ma- practice. Nevertheless, the girl who be sure of some unusual fun. ThereThe<br />\nwhy<br />\nStays Intact Despite<br />\n.<br />\nGates Flying Circus was the most fatrimony. And even more important, has secretly married has broken no fore, they ordered one of the pledges<br />\nMany Changes, He States mous and greatest of all time, and the whither. Do marriage and college college rule.\"<br />\nCampus Activities Next Topto change the age-old sign of \"Barthe one upon which this story is<br />\nmodern<br />\nthese<br />\nSmith, for instance, has no rule<br />\ngo nicely together in<br />\nic Of Commission; Membased. But, first we are going to start<br />\nnard\", the femme college of Columor are they substances, each against student marriages—has not<br />\ntimes,<br />\nwith the name of Clyde E. \"Upsidebers To Attend<br />\n\". Due<br />\ncm<br />\nexcellent in its own way, which do had since the war. Marriages without bia University, to \"Barn\"y\"ard<br />\ndown\" Pangborn, who was perhaps<br />\nand<br />\nground<br />\nthe<br />\na<br />\nfrom<br />\nlegal<br />\nadvantage?<br />\nraise<br />\nheight<br />\nconsent<br />\nparents'<br />\nthe<br />\nto it's<br />\nnot mix to<br />\nFull attendance marked the meetthe nucleus of the flying circus. Early<br />\nGraduate Recalls Early Days in<br />\nCollege has always been an excel- problem in the matter of guardian- its distance from the roof, the ing of the Freshman Commission<br />\n1919 he was sent to Ellington<br />\nThe divorce- ship, for which the college cannot, of<br />\nAt The Old Hopkins Field, Houston, Texas, as an instruc- lent mating-ground.<br />\n\"gents\" promised to excuse said held Tuesday evening. The program<br />\nwould go out of business if course, be responsible.<br />\ncourts<br />\nMfor the coming year was planned at<br />\nhe<br />\nhis<br />\nwartime<br />\nhere<br />\nmet<br />\nwas<br />\nIt<br />\ntor.<br />\npledge from further \"Hell\" if he<br />\nOn Howard Street<br />\nhad to depend on the couples<br />\nthey<br />\nC.<br />\nGilderthe session held at Levering Hall.<br />\nDean<br />\nVirginia<br />\nBernard's<br />\nbuddy, Ralph A. Reid.<br />\nthe night.<br />\nwho meet each athet in college and sleeve hopes that I will not treat the completed the task during<br />\nFraternities pro and con will be<br />\none<br />\nthem<br />\nC.<br />\n0.<br />\napproached<br />\nThe<br />\nBy WETHERED BARROLL, JR.<br />\nafterward. But undergraduate subject of undergraduate marriage in<br />\nSaid neophyte, with the aid of God, the subject taken under consideramarry<br />\nday \"How would you fellows care to<br />\nA graduate who attended the Hopmarriages are something else again. any sensational way in my article— completed said task, and the morning tion at the next meeting of the group.<br />\nhave your own personal ship while<br />\ninstance, how<br />\nkins back in the days of President here at the field?\" They accepted en- One wishes to know, for<br />\n\"Because there's really nothing sen- sun informed the \"studes\" that they Douglas Turnbull, a graduate of the<br />\ndo not choose sational about it. A woman who was<br />\nwho<br />\npeople<br />\nyoung<br />\nthese<br />\nJohns Hopkins and a member of the<br />\ncharacBurton,<br />\nRichard<br />\nthat<br />\nGilman, Dr.<br />\nthusiastically, but soon found<br />\nwere inmates of a farming school—<br />\nto wait, stack up as students. What already married entered with our secMount Washington Club lacrosse<br />\nJohn<br />\nwas<br />\ntiresome,<br />\nDr.<br />\nflying<br />\ny<br />\npupil,<br />\nstraight-awa<br />\nformer<br />\nterized by his<br />\nthem to take that leap ond class ,in 1890. Ever since then, I or so the sign read!<br />\nlead<br />\nmotive's<br />\nwill take the side of the frateam,<br />\nso they began thinking up things to<br />\nC. French, head librarian, as a disWell, this is where the fun began. teritnies in a speech to the group. A<br />\nfor life called marriage so early? imagine, we have had married women<br />\ndo.<br />\ntinguished teacher, critic, and poet,\"<br />\nAnd more important in the long run, enrolled as students.\"<br />\nIt seems as if the \"higehr ups\" didn't discussion will follow Turnbull's talk<br />\nThey would fly high until they saw<br />\ndo these marriages a la campus give<br />\nof returned to his alma mater after an<br />\nlike the new view—or somethin'. next Tuesday evening.<br />\nobsituation<br />\nsame<br />\nthe<br />\nSomewhat<br />\na barnyard and then dive down<br />\npromise of developing into permanent, tains in New London at the ConnecThe following Tuesday evening,<br />\nth ;absence of over a quarter of a cenTherefore they suspended the lucky<br />\n\"hedgehopping.\" Horses leaped over<br />\nalliances, or the reverse?<br />\n29, the organization will elect<br />\nhappy<br />\nOctober<br />\nyesis<br />\n\"There<br />\nHall<br />\nWomen.<br />\nfor<br />\nticut College<br />\nfences, cows kicked over milk buck11- tury to lecture in Latrobe<br />\nboy until he removed that which he its officers. At the same time memI discovered that college profesBlunt,<br />\nterday on the topic, \"Shakespeare ets, hens stopped laying. They tried sors in all the colleges that dot our no ruling,\" says President<br />\nhad wrought.<br />\nbers of the Student Activities Comstudents. Whether<br />\nmarried<br />\n\"against<br />\nthe<br />\ncommuof<br />\nto<br />\noff<br />\nthe<br />\ntake<br />\nknob<br />\nan<br />\nBefore<br />\nIs and the Modern Theatre.\"<br />\nstory long, \"pret- mittee will lead a discussion of some<br />\nshort<br />\na<br />\nStates, from the University of Calimake<br />\nTo<br />\nsuch students live in the dormitories<br />\nnity flagpole and tried to pick the<br />\nts audience of high school and college<br />\nfornia to Maine, and from Minnety boy\" did everything he could— of the phases of activities carried on<br />\ndepends upon the individual case.\"<br />\nhands from the town hall clock. They<br />\nSouth to Missisinstructors, Dr. Burton stressed the waved to stenographers in Houston sota way down<br />\nof the wo- even blasted—but no good came of about the campus.<br />\nattitude<br />\nliberal<br />\nthe<br />\nBut<br />\n;<br />\nThe following freshmen compose<br />\nsippi, have decided, and varied, opinmen's colleges is in striking contrast it; he still remained \"ex-college boy.\"<br />\nintense interest shown in Shake- office-huildings. They would fly high<br />\nthe Commission: Zoel Radner, Nelson<br />\nions on all these matters.<br />\nof<br />\nmany<br />\nin<br />\neffective<br />\npolicy<br />\nwith the<br />\nspeare's comedies, especilally \"Mid- until they would sight an interurban<br />\nAnd to this day that naughty \"y\" Lloyd: William Sattler, J. H. Beeler,<br />\nPerhaps the most radical of all in<br />\nfull of<br />\nthe large Eastern men's colleges. For<br />\nErnest<br />\nsummer Night's Dream,\" which Max trolley car. Deciding it was<br />\nProfessor<br />\nis<br />\nview<br />\nof<br />\npoint<br />\nJoseph Ashbrook, Abraham Schneidhis<br />\nstill clings to its dizzy perch.<br />\n,1the most part the administrators of<br />\nGermans, they would dive down in<br />\npin!<br />\nGroves of the Institute of Research<br />\ner, William Schmied, George MurgaR.<br />\nfraternity<br />\n_Reinhardt has produced for the<br />\nhis<br />\ngot<br />\nP. S.—He<br />\nthe conservative \"gentlemen's colfront of it and wag their tail in the<br />\ntroyd, Miguel Firpi, Warren Lawin Social Science at the University of<br />\nscreen.<br />\nundat<br />\nnoses<br />\nastonished conductor's face. ComGroves is leges\" look down their<br />\nProfessor<br />\nCarolina.<br />\nrence, Robert Patton, J. E. Thomas,<br />\nNorth<br />\nSaying that \"there is no greater plaints came pouring in. The Comergraduate marriages or forbid them<br />\nShows<br />\nCensus<br />\nJr., N'ewland Day, Robert Ward, John<br />\nn a position to speak with authority,<br />\nA.<br />\nC.<br />\nM.<br />\nY.<br />\nId tribute to Shakespeare than the fact mandant called them on the carpet not only for his own but for other entirely.<br />\nSnodgrass, Howard Stier, Allan Spier,<br />\nTake Princeton: According to Dean<br />\nVaried Religious<br />\nes that he has survived the misappre- and gave them heck.<br />\nJohn Sigsby, Edwin Nye, William<br />\nuniversities. He is a research 'sociHad they been carrying on endan- ologist of wide reputation, and his Christian Gauss, the University rul; hensions that have followed him for<br />\nMehling, Henry Howeip, Andrew<br />\nInterests<br />\ngering their own and other people's book on \"The American Family\" is a ing is that \"any student who marries<br />\nFrommelt, C. A. Druah, E. V. Cross,<br />\nseveral hundred years, the -essayist<br />\nlives with wild stunts? Why, no, of standard college text.<br />\nwhile an undergraduate will be comEwan Chambers, Robert McBaur and<br />\ne ; declared he disliked the appellation<br />\nA census was recently compiled,<br />\nfrom the Univercourse not; they had been several<br />\nStreet Baldwin.<br />\nfor marriage,\" pelled to withdraw<br />\nwait<br />\nlong<br />\n\"The<br />\n\"classic\" to the Bard's works, since miles away at that time, shooting<br />\nsity unless excused from this compul- taken from the information filled out<br />\nProfessor Groves, \"particularly<br />\nsays<br />\nit was likely to frighten away po- landings on an emergency field. The<br />\nsion by the President or the Dean of on the Y. M. C. A. cards at the beprofessional preparation is<br />\nnumber was 314? \"Well, well, must when<br />\nthe College.\" And the ;burden of proof<br />\ntential readers.<br />\nginning of the school year. The folnecessary, is from every point of<br />\nbe another ship with the same nummost decidedly rests with the impetuFilm Is Vision<br />\nview, it seems to me, unfortunate.<br />\net<br />\nis a list of the various religlowing<br />\nber.\"<br />\nous lover, for Dean Gauss tells me<br />\nDr. Burton asserted that the film,<br />\nThere is the temptation to find a sub>r<br />\nns contributed by<br />\nious<br />\ndenominatio<br />\nexceptions<br />\nfew<br />\nvery<br />\n(Continued from Page 1, Col. 3)<br />\nthat \"there are<br />\nThey went shopping for some washsitute for marriage; and with the<br />\nIt \"A Midsummer Night's Dream,\"<br />\nupon a minimum program of action<br />\nable showcard paint and turned the present liberal thinking and knowl- made to this rule—at the most, not 634 students:<br />\nwas the embodiment of a vision he number into a puzzle. They made the<br />\nthan one or two a year. At the No preference 76 Evangelical ......2 upon which they could all agree.<br />\nedge of birth control, this danger is more<br />\nhad seen in his lifetime. By the un- \"3\" look like an \"8\", and the \"1\"<br />\n_1<br />\nrhe Hopkins Chapter of the Amertime there are no undergrad- Catholics<br />\npresent<br />\n74 Christian<br />\ngreater than it has ever been.\"<br />\nwith the<br />\nmarried<br />\n..7<br />\nO<br />\nReformers<br />\nare<br />\nLeague Against War and Fasican<br />\nwho<br />\nuates<br />\nbroken sequence of the story in the look like a \"4\", etc. Sometimes the<br />\nspeaks<br />\nOf course Professor Groves<br />\n165 Unitarian<br />\nJewish<br />\n5 cism was organized last March by a<br />\n' movie, he stated, the illusion of a numbers 4841\", \"341\" or \"344\" were as a research sociologist and not an knowledge of the University author1 Christian Sc.<br />\n4 group of graduate students. It was<br />\nreported, but never 314, and they administrator. But the attitude of ities, and it is customery that there Mormon<br />\nfairyland mood was kept, a \"parProtestant<br />\nto<br />\nand<br />\nZion<br />\n1<br />\ncontinued to strafe trolleys,<br />\nnone.\"<br />\nare<br />\nbe<br />\nto<br />\n6 active last year in protesting against<br />\nseems<br />\nns<br />\nadminisratio<br />\nticular lost when on the stage on ac- run their wheels on the roof of Pull- college<br />\n85<br />\nEpiscopal<br />\nis<br />\nthe Teachers' Oath Bill and most rebut<br />\npermits,<br />\nalso<br />\nDartmouth<br />\nQuaker<br />\n4<br />\nchanging considerably. Let us intercount of intermissions.\" He pointed man coaches.<br />\n12 cently took the initiative in protesting<br />\nBaptist<br />\nNeidK.<br />\nL.<br />\nDean<br />\nhough<br />\napathetic—t<br />\nto<br />\npresidents<br />\nthe<br />\nand<br />\nview the deans<br />\nCongregation. ..2<br />\n65 against the recent Italian gift, conMethodist<br />\n(Continued in subsequent issues)<br />\nto the recent activity in placing bediscover what the actual practice in linger tells me that the number of Church of<br />\n49 sidering it \"an ill-advised action on<br />\nLutheran<br />\nfore the movie public film versions<br />\nincreasbe<br />\nto<br />\nseems<br />\nstudents<br />\nmarriage<br />\nmarried<br />\nte<br />\nregard to undergradua<br />\n2<br />\nBrethren<br />\n62<br />\nPresbyterian<br />\nof great classics and urged that the<br />\nthe part of the University in lending<br />\nmotives<br />\n\"The<br />\ning to a slight degree.<br />\nreally is.<br />\nits prestige to a government inimiof<br />\nOut<br />\nthe<br />\ndifferof<br />\ntotal<br />\nnumber<br />\nstunot<br />\nintelligent public ignore distasteful<br />\nare<br />\nmarry<br />\nwho<br />\nstudents<br />\nTake the women's colleges in the of<br />\nof<br />\nclass<br />\nfare, but show their active interest<br />\nthose of any other<br />\ndents who contributed data, 484 de- cable to everything Hopkins stands<br />\nEast: Vassar, under the leadership of ent from<br />\nin intellectual cinema.<br />\nfor.\"<br />\nof<br />\nresult<br />\nthe<br />\nare<br />\n•<br />\nusually<br />\nbut<br />\nclared their intentions of turning out<br />\nDr. Henry Noble MacCracken, has persons,<br />\nMembership in the League, accordfamily inwith<br />\ncombined<br />\nA reporter from the NEWS-LETTER,<br />\nimpatience<br />\nbeen steadily taking a more liberal<br />\nfor athletics and 464 stated they ing to the executive committee, is<br />\nYale's<br />\nthat<br />\nAfter<br />\nrecent<br />\ndefeat<br />\nthese<br />\nevidence<br />\nhim<br />\nno<br />\nis<br />\nfound<br />\nThere<br />\nInterviewing Dr. Burton,<br />\nattitude in recent years toward stu- dulgence.<br />\na vigorous gentleman, despite his lines appeared in the \"Pennsylvan- dent marriages. \"At Vassar College,\" marriage affects the scholarship of would participate in extra-curricular open to \"all individuals and organiexcept in activities. The census cards also zations who believe that war and<br />\nThe eminent ian\":<br />\nseventy-four years.<br />\nsays Dr. MacCracken \"the basic prin- students at Dartmouth,<br />\n\"Pennsylvania's humiliating defeat<br />\nserious show that 399 students out of the fascism are menaces to civilization,<br />\nmore<br />\na<br />\nwhere<br />\nleader in belles-lettres said that \"he<br />\ncases,<br />\nciple in dealing with its students is some<br />\nthey are not inevitable, and that<br />\nclearly<br />\ndemonYale<br />\nof<br />\nimprovehands<br />\nat<br />\nthe<br />\ncause<br />\nwas in a daze\" over the change that<br />\ntotal of 634 have signified their in- that<br />\nto confer on them the prvileges of purpose is apparent to<br />\ncan be forestalled.\"<br />\nthey<br />\nhad come over the Hopkins since his strates that our team is one of the<br />\nmaturity. With a slight reservation ment.\"<br />\nterest in football.<br />\nEvery Friday the Hopkins chapter<br />\nday.<br />\ngreatest 30-minute clubs tha ever in the<br />\nperDartmouth<br />\nAmherst,<br />\nyear<br />\nUnlike<br />\nfirst half of the freshman<br />\nholds meetings at 2:00 p. m. in Levwore the red and blue. For the first<br />\nfor purposes of adjustment, it is as- mits its married students to live in<br />\n\"Smallness Startled Me\"<br />\nfor<br />\n'champs',<br />\nering Hall, Room D. Students and<br />\nlike<br />\nhalf they looked<br />\nwives.<br />\ns<br />\nTen<br />\ntheir<br />\nAppear<br />\nCandidate<br />\nwith<br />\nHanover<br />\nsumed that students at Vassar Col- town of<br />\n\"When, back in '83 I first saw the<br />\nfaculty members are invited to atthe second half they looked like lege desire to be<br />\ntreated as mature Brown university takes much the<br />\nHopkins, the smallness of its quarFor First Band Rehearsal tend.<br />\nlooked like `chumps'.\"<br />\nUniversity,\"<br />\n\"The<br />\npersons, self-governed with respect same attitude.<br />\nters startled me. But I soon found<br />\nEvidently the Penn students don't<br />\nto academic work. In social contact, Dean Samuel T. Arnold tells me,<br />\nthat the success of this pioneer gradTen new members turned out for<br />\ncheer when \"the eleven's in the rain\";<br />\ntherefore, the college makes no terms \"does have some undergraduate men the first<br />\nuate school lay in its men, not int<br />\nrehearsal of the Band last<br />\nthey sneer.<br />\nits buildings. Sidney Lanier, my<br />\nof behavior in any way different from in the student body who are married.<br />\n* * *<br />\nMonday afternoon at the Barn. The<br />\na<br />\nthat<br />\nthe uses of society. Thus the question Our rule of the faeulty states<br />\nYouthful idol, had been dead but two<br />\nThis week: ROBERT LEVI<br />\nThis contribution comes from Le- of marriage in the student body is student may not be married without first part of the rehearsal was unYears; but I found encouragement<br />\nder the direction of Mr. Conrad GebThe old adage that \"an athlete<br />\nentirely incidental. Whenever the receiving the approval of the dean's elein,<br />\nand companionship in Professor Gi1. high's \"Brown and White:<br />\ndirector. Ace Wegard, this can't have brains\" apparently doesn't<br />\nthe<br />\ncamabout<br />\njourneys<br />\n\"Fruitless<br />\nplans of the family are in favor of it, office, in advance.\"<br />\ndersleeve who confided to me that<br />\nyear's Drum Major, took charge of apply to Bob. He came to Hopkins<br />\nhe was a disappointed poet, AssO-d pus are a present defect in the regis- and whenever the student feels that<br />\nHarvard, of course, has no restric- the second half of the rehearsal.<br />\nas a holder of a trustee's grant and<br />\nbe<br />\nelimshould<br />\ntration<br />\nThey<br />\nsystem.<br />\nmarriage would be of advantage to tions against undergraduate marriciation for six years with such men<br />\nThe next rehearsal of the Band has had this grant renewed twice.<br />\ninated.\"<br />\nyears<br />\nmata<br />\nas<br />\nit<br />\nmany<br />\nher, the college regards<br />\nas Gildersleeve, Haupt, and Dri G114<br />\nage. Their attitude for<br />\nwill be held next Monday, at 4:10<br />\nHe has been one of the main cogs<br />\nWhere have we heard that before? to decide.\"<br />\nMan, who was at all time charmone of enlightened laissez- p. m., at the Barn.<br />\nbeen<br />\nhas<br />\n*<br />\n*<br />\n*<br />\nHopkins' lacrosse machine for the<br />\nin<br />\nside<br />\nbeen<br />\ning, debonnair and amiable, has<br />\nThis, then, is the policy at Vassar. rival Yale on quite the opposite<br />\ntwo years. . . . a member of the<br />\npast<br />\nWilliam Randolph Hearst seems to For its practical application, let us<br />\na source of great inspiration to me.\"<br />\nof the fence. The rule at Yale is that<br />\nHullabaloo for three years . . . busPamphlet<br />\ncampus<br />\npublications<br />\ninto<br />\nSpanish<br />\nPublished<br />\nbreaking<br />\nbe<br />\nturn to Eleanor C. Dodge, Warden of \"any undergraduate who marries reAsked by the reporter where he<br />\niness manager for two years . . . a<br />\noften lately. Somehow, the edi- Vassar College. Last year Miss Dodge<br />\nWould have sought his Ph. D. if there quite<br />\nautomatically from the<br />\nhimself<br />\nmoves<br />\nBarnstormer for the past two years<br />\nlatest<br />\nof<br />\nThe<br />\nthe<br />\npublication<br />\nto<br />\nhave<br />\nsame<br />\nseem<br />\nthe<br />\nall<br />\nhad ;been no Johns Hopkins at the torials<br />\nfound it advisable to publish in the<br />\nReinstatement is in the dis- Johns Hopkins University Press is . .. member of the Varsity Club since<br />\nLafayette\"<br />\n\"The<br />\ncollege.<br />\nexample,<br />\nFor<br />\nring.<br />\ntime Dr. Burton answered that the<br />\nVassar Miscellany News, the followprovided that he the Catalog° Bibliografico y Critic° his first year . . . Student Council<br />\nus this line:<br />\ning statement of the college's official cretion of the dean,<br />\nonly possible place would have been gives<br />\npeoof de las Comedies Anunciadas en Los representative and member of the<br />\nfor<br />\nwrite<br />\nto<br />\nclaiming<br />\n\"Hearst,<br />\na foreign university. Then a man<br />\nattitude toward student marriages:<br />\nhas been served with declaration<br />\nthe past<br />\nof<br />\nthe<br />\none<br />\nis no doubt<br />\nthe Periodicos de Madrid Desde 1661 News-Letter staff during<br />\ncould secure a higher education at ple who think,<br />\n\"Will Vassar allow a girl who mar- intention at least a month before<br />\nis now circulation manaBob<br />\nyear.<br />\nproductive<br />\nHasta<br />\nto<br />\n1819„<br />\na<br />\nThe<br />\nbook,<br />\npaper-bound<br />\nobstacles<br />\ngreatest<br />\nno other institution in the United<br />\nries to stay in college, May she stay event, together with a statement of<br />\nvolume, was written by Ada M. Coe, ger of the News-Letter and vicethinking in this country.\"<br />\nStates.<br />\non in her dormitory? May a girl approval from parents or guardians.\"<br />\ndon't<br />\nAssistant Professor of Spanish at president of the honorary journalistic<br />\napparently<br />\nCollege<br />\neditors<br />\nIn 1888, Dr. Burton at the Johns<br />\nwhose secret marriage is discovered<br />\nfraternity, Pi Delta Epsilon.<br />\nor do they?<br />\n•••••••••••••••••••••••••1<br />\nWellesley<br />\nHearst<br />\nappreciate<br />\nCollege.<br />\n•<br />\n••<br />\n•<br />\n••<br />\n•<br />\n••<br />\n•••••••••••••<br />\n••••••••«•••••••••••••••<br />\nremain in college? The answer to all<br />\nHopkins received his doctor of philos* * *<br />\nophy in English. The following year<br />\nthe above questions is 'Yes.' This<br />\nAn intimate confession comes from<br />\nhe taught Anglo-Saxon here and lecstatement of policy is not an appeal<br />\nthe souls of the staff of the \"Concor- to the<br />\nST. PAUL at 33RD STREET<br />\ntured in English again in 1897. In<br />\ncolege to get married! It is<br />\nPrescriptions-School Supplies<br />\nUnion<br />\nin<br />\nof<br />\nCollege<br />\nSchenecdiennes\"<br />\nthe meantime,, Dr. Burton began his<br />\naddressed particuarly to those stuCandy-Cigars<br />\nlong and active career in the literary tady, New York:<br />\ndents who are engaged and want to<br />\nUnexcelled Fountain Service<br />\n\"We personally like to whistle. marry, but at the same time to finish<br />\nWorld. For a long time he edited the<br />\n•-111 •-• •«••••••••<br />\n•••• Fe.• lb 55OOOOO<br />\nHartford Courant and other maga- Sometimes we whistle off key, but their college courses. We do not in<br />\nzines. During the past twenty years there are some tunes we would rath- general believe in long engagements,<br />\nhe has been a member of the Pulit- er whistle than listen to over the ra- because of the emotional strain inJ. H. FURST CO.<br />\nzer Prize Committee. His biogra- dio\"<br />\nvolved; and we reconize that those<br />\nPrinters of<br />\nlong engaged and of college age are<br />\nphies, \"Bernard Shaw—the Man and<br />\nPHILOLOGICAL and<br />\nthe Mask,\" and \"Charles Dickens—<br />\nfrquently not in a position to assume<br />\nSCIENTIFIC PUBLICATIONS<br />\nHow to Know Him,\" have won him 25 At Chess Club Meeting the full costs of married life. Nor do<br />\nBaltimore<br />\n12-20 Hopkins Place<br />\nwe 'believe in secret marriaes; if they<br />\nattention. He was head of the English Department at the University of<br />\nTwenty-five candidates were pres00<br />\no.4<br />\n.<br />\n.<br />\n0<br />\n.<br />\n06<br />\n.<br />\n.<br />\n40.404.40.•»41.4.,«40.41.40.4,.4.40.41.4\".•«0»,<br />\nMinnesota from 1902 to 1935, and isl ent at a meeting of the Chess Club,<br />\nnow professor of English Literature held Wednesday at the S. A. C. Room #<br />\nBARBER SHOP<br />\nPEABODY<br />\nat Relion College. Following the ad- in the basement of Levering Hall.<br />\nTheodore's<br />\ndress the English Department of the Due to the large turnout some diffiPHARMACY<br />\nand 33RD STREETS<br />\nPAUL<br />\nST.<br />\nJohns Hopkins tendered Dr. Burton a culty will be had in arranging a<br />\n211 - 213 E. Baltimore St.<br />\nCALVERT and 30TH STREETS<br />\nTo Birely's<br />\nNext<br />\ndinner at the Greenway. Dr. French schedule for games that will be suitWe Sell Drugs and Give Service<br />\nmade the arrangements.<br />\nable to all.<br />\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••<br />\n<br />\nHas Full Attendance<br />\n<br />\nMovies An Asset<br />\n<br />\nPlan Anti-War Meet<br />\nFor November 2,3<br />\n<br />\nIn Other<br />\nColleges<br />\n<br />\nCampus Captains'<br />\n<br />\nBirely's Pharmacy<br />\n<br />\nr<br />\n<br />\nMoving Soon to<br />\n7 &9E. Baltimore St.<br />\nat Charles<br />\nKATZ CLOTHES<br />\n<br />\n\f4<br />\n<br />\nHOME WOOD, BALTIMORE, MD., OCTOBER 18,<br />\n1935<br />\n<br />\nRunnersVieFor<br />\nTryout Places<br />\n<br />\nJay Walks<br />\n<br />\n_1<br />\n<br />\nPAST AND PRESENT:CROSS COUNTRY<br />\n<br />\nCALL FOR FENCERS<br />\n<br />\n_ By KENNETH ZIERLER<br />\n<br />\nJay Team OpenL<br />\nGrid Season On<br />\nShore SaturdayC<br />\n<br />\nIt has been fifteen years since Jimmy runners start at<br />\nHomewood, run down<br />\nThere will be an organization meetLe Cato issued the call for the first the road, then behind<br />\nGilman in front ing of the Johns Hopkins Fencing<br />\nThe Jays lift the lid off their foot- cross country practice at Hopkins.<br />\nof Levering, circle the soecer field and Team on Saturday<br />\n, Oct. 19, in the<br />\nball season with a jaunt to the Sho' During these years, cross country<br />\nhas then through Wyman Park back to Barn. All<br />\ninterested are urged to atCross-Country Workout To where they will swap blocks and developed into one of the most popu- the football field, and<br />\nonce around the tend this first reunion as plans for<br />\nwith Washington College, un- lar of the fall sports.<br />\ntrack. The contestants must circle for the future will<br />\nBe Held Tomorrow; Start- tackles<br />\nbe discussed.<br />\ndefeated since 1933 and bigger and<br />\nVerne Booth, of the 1922, 1923 and the course twice during<br />\nthe race,<br />\ning Line-Up Is Sought better than ever this year.<br />\n1924 teams, was the first Jay harrier which is about a<br />\ntotal of four and a<br />\nAn unknown quantity—as the Mon- to gain national prominen<br />\nStrong Washington College-ce. In 1923, half miles.<br />\nday morning quarterbacks would say he won the National Intercoll<br />\negiate<br />\nAs in other sports, Maryland has<br />\nTeam To Furnish Gruel—the Blue team is naturally the und- Cross Country Champion<br />\nships at been one of Hopkins'<br />\nchief rivals and<br />\nerdog since the Maroons have thus far Van Cortland<br />\nlin Test To Varsity Teatn\"<br />\nPark. The Middle Atdivided equally their meets from<br />\nNew Material Expected To this campaign scrimmaged through lantic States Cross Country Champ- they<br />\n1926-1931<br />\n, but Maryland may renew<br />\nAmerican Universit and out-touch- ionship was annexed<br />\n(Continued from Page 1, Col. 1) BC<br />\nby him in 1923 their meetings<br />\nThe second week of interfraternity<br />\nFill Vacancies; Gray Is downed Swarthmore.y While<br />\nthis year.<br />\nthe husky and 1924. He was also the national inJays Have Spirit<br />\nfootball got under way with many<br />\nMaryland Series Close<br />\nShoremen have been playing games door and outdoor<br />\nUnable To Compete<br />\nDespite this imposing array of<br />\ntwo mile champion.<br />\nstirring and exciting games. Most of<br />\nand getting valuable experience, the Competin<br />\nSt. John's wag met from 1930-1933 the<br />\ng in the 1924 Olympics,<br />\ngames were closely fought the veteran opposition, George Darley's<br />\nThe first step towards deciding up- home eleven has been idle as far as Booth finished in the first ten in the and the Jays won three of the races. victor in<br />\ndoubt until the final whistle. blue-tacked warriors are intent upon<br />\non the personnel of the varsity the record goes.<br />\nteam race. As a Whole, the team was An odd feature of these races was<br />\nKappa Alpha opened its •season writing the closing chapter of the<br />\nAs far as activity goes, they weak<br />\ncross-country team will be taken toand victories were few and far that all were decided by one point. with a hard-fought 12 to 0 victory Washington winning streak. The disFain<br />\nThe Jays have been a competitor in over Phi<br />\nmorrow when Coach Hambleton haven't been loafing. Coach George between.<br />\nEpsilon Pi. Thomas and play of enthusiasm, pep, and fight<br />\nsends his charges through a stiff Darley has already given them more<br />\nSouth Atlantic Cross Country Champ- Counselman<br />\nmanifeste<br />\nGwinn Outstanding<br />\nd<br />\nby the squad during pracA<br />\naccounted for the two<br />\ntryout run. The results of this com- scrimmaging than was done all seas-tice drills, intimates that if spirit and<br />\nThe team had increased success in ionships held at Clifton Park since touchdowns.<br />\npetition will, to a great extent, de- on by every Hopkins team for the the next few years, with Dick Gwinn, 1927, and have always finished secIn another match which featured intestinal fortitude are deciding facttermine the lineup for the first meet past three years put together. The later an Olympic alternate, the back- ond to the Stonewall Democratic Club some close defensive<br />\nplay on the part ors in ball games, the Blue Jays will<br />\ngridmen are thus in shape and not<br />\nwhich will be held one week later.<br />\nbone of the team. In 1926 he won the of Baltimore, who are led by Bill of both teams, 0. K. 0. fraternity stem the maroon tide. The gridders,<br />\nuninitiated to the sound of bones<br />\nHard Schedule Ahead<br />\nMiddle Atlantic States Cross Country Agee, former Olympic marathon and Bette Theta Pi ended up in a 6 after six weeks of practice, have derunner, and Pat Denges, national to 6 tie. Jenkins scored<br />\nThe team faces a rather difficult crushing underfoot and other charac- Championship.<br />\nthe touch- veloped a polished running and aerial<br />\nschedule but with the new material teristic cacophony of football.<br />\nBec;<br />\nIn 1927 the harriers composed of marathon champion.<br />\ndown for 0. K. 0. while Stevenson attack and a sturdy defense.<br />\nEspecially does Hopkins have spirit.<br />\nacquired this year, the Jays have an<br />\nBill Bishop, one of the brightest<br />\nScheible, Gwinn and Kelly, had<br />\nIn 1934, the Black and Blue an- kept Beta in the running with a<br />\nexcellent chance for an undefeated It takes a lot of enthusiasm to hit marked success, scoring victories nexed the college section champion- touchdown to his nredit.<br />\nbackfield psospects, is lost to the team<br />\nfor the whole season. Bishop, sterling<br />\ncampaign. The season does not end the blocking dummy and the tackling over Maryland and Navy.<br />\nship of the District of Columbia's<br />\nAnother Close Game<br />\nwith the termination of the dual dummy and scrimmage every day<br />\nWaldo Hambleton was appointed Cross Country Tournament, and will<br />\nThe game between Delta Upsilon blocking back, who promised to be<br />\nDr,<br />\nmeets as the Black and Blue will while other colleges are playing two, coach in 1928 and since that time defend the championship this fall.<br />\nand Tau Alpha Omega resulted in a a tower of strength in the backfield,<br />\nenter a squad in the South Atlantics three, or even four games. With this the team has won three-fourths of<br />\nDual meets are won by the team 6 to 6 tie. This was one of the most broke his jaw in a scrimmage prac- ecom<br />\ntice. This is the first casualty of the<br />\nand in the National Capital champ- enthusiasm the Jays have ability. The thefr dual meets, although the squads having he lowest score. Five men thrilling struggles of the week. T.<br />\nA.<br />\nline will concede nothing to Washingionships. In 1934 Hopkins succeeded<br />\nhave been small.<br />\nfrom each school compete and each 0. gained a 6 to 0 lead early in the season.<br />\nchief<br />\nton College. It is only the dinosaur<br />\nCharlie Kelly, a splendid passer<br />\nin capturing the team championship<br />\nThe teams of the last few years man gets the same amount of points contest by virtue of a touchdown by<br />\nbacks that give the edge to the Shore\\yin<br />\ndirect the Jays from his quarterin the latter event, while they were<br />\nhave been built around Sam Furst, as the position in which he finishes. Don Shapiro and managed to mainmen.<br />\nthird in the S. A. meet, only a few<br />\nJack King and Paul Hiltzman. All Thus, if a man finishes first, he re- tain this margin up until the last back post. Kahl and Graziano will<br />\nSpeaking of backs calls to mind the<br />\nc°<br />\ntesll<br />\npoints behind the winner.<br />\nthese broke country records during ceived one point. A perfect score is few minutes of play. Then, with but start the game in the half-back eall<br />\nfate of two of Hopkins backs. CapGray Lost To Team<br />\none minute remaining to be played, berths. Both are fast and able kicktheir stay at Hopkins.<br />\nfifteen,<br />\nthis<br />\nattained<br />\nand<br />\ncan<br />\nbe<br />\nif<br />\ntain Reuben Pasarew, a ferocious<br />\nThe Blue Jays recently lost a valuThe course, at present, is much five of the runners of one school de- Johnny Murphy caught a long pass ers. Graziano will no doubt do blockblocker, a deadly tackler, a ballable man when Eddie Gray, former<br />\nand turned it into a touchdown. At ing duty, while Kahl will take care<br />\neasier than in previous years. The feat all from the other school.<br />\ncarrier, and a punter (out of adjecof a good portion of the ball carrySt. John's runner, announced that he<br />\nthat point, the game ended.<br />\ntives), is not officially back in the<br />\nwould be unable to compete this fall.<br />\nAlpha Tau Omega defeated Phi ing. Bob Ward at full back is the e88°°ta<br />\nx<br />\neo<br />\ntfunini<br />\nrh<br />\ntIl:<br />\ne<br />\nrrnYtili11:'<br />\n:<br />\nUniversity, although he is attending<br />\nGray, who performed on the track<br />\nAlpha in another close game by a fourth member of the backfield. He Matc<br />\nboth classes and practice. The rumor<br />\nsquad last spring, is prevented from<br />\nscore of 6 to 0. Fankford scored the is an agile, shifty runner, a fair passis that the Board for the Admission<br />\ner and kicker, and will be a hard man<br />\nlone touchdown.<br />\nparticipating because of his studies,<br />\nof Football Players is waiting for<br />\nwhich take up all of his available<br />\nPhi Sigma Delta, one of the favor- to hold.<br />\nRube to consider several offers from<br />\nThe reserve backfield is also a fortime.<br />\nFour Frosh, Sophomore Teams To ites this year, opened their campaign<br />\nthe Big Ten.<br />\nwith a 12 to 0 victory over Alpha midable quartet. Bernie Vincent is<br />\nIn addition to the varsity, HambleBe Organized After Week Of<br />\nAspiran<br />\nts<br />\nPositio<br />\nFor<br />\nns<br />\nAre<br />\nMore seriously, we speak of Bill<br />\nDelta Phi. After attempting numer- one of the best blocking and defenston is working hard with the second<br />\nInformal Practice<br />\nBishop who suffered a broken jaw in<br />\nNumerous; Large Schedous passes over the goal line which ive backs on the squad. Kaufman, a Pfd°a<br />\nstring men in order to whip in shape<br />\ntr(ueftuicesi1tn<br />\n--1<br />\nc,<br />\nirth<br />\n:<br />\nSaturday's scrimmage. Last year Bill<br />\nwere<br />\na capable junior varsity aggregation.<br />\nall incompleted, Ken Zierler potential punter and runner; Bradule Planned For Season The Fall Lacrosse Leagues started<br />\ndid himself credit on the line as a<br />\nscored the first touchdown on a run ford and Traggis are the other sec- h<br />\nThe latter has, in the past, been<br />\nda<br />\nids:<br />\nguard, a tackle, and an end—with<br />\nthe season's play Tuesday, Oct. 15, on<br />\naround the end. The second score was ond string backs.<br />\nsingularly unsuccessful in its enAlthough the wrestling team will<br />\na little fullbacking now and then. But<br />\nthe lower field. This first week of ac- made on a pass to Hal Goldstein<br />\nThe Hopkins forward wall expected<br />\ncounters with local high schools and<br />\n.<br />\nthis year he was never out of the not begin intensive practise until the tivity<br />\nIn another game, Phi Lambda Phi to prove an inseperable barrier to<br />\nwill<br />\nconsist<br />\nintends to seek revenge this year.<br />\nin<br />\ninformal<br />\npracbackfield, where his hard work and latter part of November, informal<br />\ntice. However, next week, four Fresh- retained its leadership in the B league the maroon onslaught. Halbert will las n.\"11.1!11<br />\ndogged pursuit of all the backfield practice will be held every Thursday<br />\nstart off at center with Mehling his<br />\nmen and Sophomore teams will be by defeating Phi Gamma Delta.<br />\nlore he could get soon made up for afternoon in the gym. These pracunderstudy, Swindell and Schmidt<br />\norganized<br />\n.<br />\nThe<br />\nFrosh<br />\nLeague<br />\nwill<br />\nuse<br />\nhis lack of experience in this new tises will be held under the superwill be at the wing posts with Baum \"Ei<br />\nvision of Captain Julian Gelber and the field on Tuesday, while the Sophs<br />\nHandballers Urged Out and<br />\nposition.<br />\nLeberfeld as reserve ends. Davis, frn<br />\noa<br />\nwill<br />\nr rl<br />\npractice<br />\non<br />\nThursday<br />\ns. On the<br />\nAll handball enthusiasts, whether Royster, Phillips,<br />\nA fast-charging, unrelenting block- Coach Gus van Sant.<br />\nand Day will no<br />\nremaining days of the week, the field<br />\ninterested in the game for league doubt all see<br />\nA great deal of enthusiasm has<br />\ner, he is an<br />\nblocking back. Add<br />\naction at the guard powill be open to all corners.<br />\nElec-Mechs Win Close Game; to this his ideal<br />\ncompetition or for their personal en- sitions, while<br />\nfast-developing bucking been formed and a turnout of fifty<br />\nMcGuire and Ellis will<br />\nAfter<br />\nweeks of games, the joyment, are requested to get in<br />\nline up in the tackle berths. Reserve<br />\nN. J. All-Stars Continue and passing ability and you have a men is expected. A large numer of championtwo<br />\nw<br />\nborn<br />\n;r11<br />\nFrosh and Soph teams will touch with Dick Pasternak, Post<br />\nreal menace to the opposition. He candidates are expected for the<br />\ntackles are Pinski and Hopkins, both<br />\nWinners In Soph League was so much a vital factor<br />\nheavyweight division, in particular, be matched with Junior and Senior Office Box 781 for further informa- of whom will probably<br />\nthat Bill<br />\nget into the<br />\nteams in a Round Robin Tournament. tion.<br />\ngame.<br />\nThe interclass football teams began Bishop's broken jaw is a broken jaw and the gaps which have been formed<br />\nthere because of graduation are extheir second season of competition for the team.<br />\nrn<br />\no<br />\nnlr sci<br />\npected to be filled satisfactorily.<br />\nlast week with several close and indel<br />\ntordE<br />\nSOME QUICK PICKS OF STATE<br />\nNew equipment has been secured<br />\nteresting battles.<br />\nRESULTS:<br />\nthus insuring all wrestling aspirants<br />\ntyheias<br />\nThe Electrical-Mechanics opened'<br />\nYale<br />\nto<br />\ntake<br />\nthe<br />\nwind<br />\nout<br />\nof<br />\nNavy's enough facilities for practise.<br />\ntheir campaign with a hard-fought<br />\nsails.<br />\ne<br />\nvgen<br />\nvdci:i(<br />\nA freshman manager is needed and<br />\n24 to 18 victory over the Gas-Civils.<br />\nl:<br />\nevr<br />\nMaryland<br />\nto recuperate against V. all candidates for this position are<br />\nThis high-scoring game was featured<br />\nM. I.<br />\nurged to see Coach Gus van Sant as<br />\nby the fine passing attacks shown by<br />\nboth teams. Skinner, Knecht, and Western Maryland to squeeze through soon as possible.<br />\nCI]H<br />\npi<br />\nBarker scored touchdowns for the<br />\nBuck nell.<br />\nManager Bill McFeely has secured<br />\nlosers, while Bayliss was the out- Mt. St. Mary's to<br />\na complete wrestling program for the<br />\nget Gettysburg.<br />\nstanding star of the Electrical-Meteam.<br />\nThe schedule follows:<br />\nStart the school year with<br />\nVirginia to make it four losses for<br />\nchanics, scoring three of their four<br />\n11))<br />\nJan. 10—Hopkins vs. Swarthmore at<br />\nSt John's.<br />\nSheaffer's which are supreme<br />\ntouchdowns. The other score was<br />\nHomewood<br />\nWest Chester Teachers to give Balmade by Mewshaw.<br />\n.501<br />\nin quality and performance<br />\nJan 18—Hopkins vs. Rutgers away<br />\ntimore a lesson.<br />\ndOa(<br />\n'ItYr<br />\nThe New Jersey All-Stars, freshand cost no more but last<br />\nin<br />\nman champions of last year, contin- Washington College to start Hopkins *Feb. 8—Hopkins vs. U. of M. at<br />\nlonger.AllSheaffer'sfill,empty,<br />\nHomewood<br />\noff on the wrong foot.<br />\nstr<br />\nued where they left off by gaining<br />\n12—Hopk<br />\nins<br />\nvs.<br />\nLafayette<br />\nFeb.<br />\naway<br />\nan easy 30 to 0 victory over the<br />\nclean with one stroke and<br />\nBusiness Men. The victors exhibited<br />\nFeb. 15—Hopkins vs. Ursinus at<br />\nau<br />\ntake in over 400% more Skrip<br />\na fine passing attack and a brand<br />\nhi;<br />\nHomewood<br />\nper stroke than multiple-stroke<br />\nof all-around ability which makes<br />\ntri<br />\nAdd 1, Wrestling<br />\nthem a favorite to once more win the<br />\nPc<br />\npens. Visibility is kept permaFeb. 22—Hopkins vs. Temple away<br />\nlaurels in their division.<br />\ntic<br />\nFeb. 29—Hopkins<br />\nHaverford<br />\nvs.<br />\nnent by a patented vacuum<br />\n.The Engineers were also easy vicaway<br />\nThe Johns Hopkins Soccer team is<br />\ndisc. The two-tone Feathertors in their opening game, gaining<br />\nleaving at 11.30 today for the Eastern *Mar. 7—Hopkins vs. Gettysburg<br />\nA<br />\nan 18 to 0 victory over a pickup<br />\ntouch°po<br />\naway<br />\nintthatonly Sheaffer's<br />\nShore to play State Teachers' Colteam.<br />\nMar. 22—South Atlantics<br />\nlege at Salisbury.<br />\nhave makes two-way writing<br />\nIn the Junior division, the Civil* Tentative<br />\nCoach Dotterweich foresees a close<br />\nperfect. All these wonderful<br />\nGas team won a hard-fought 6 to 0<br />\ngame as well as a possibly favorable<br />\nvictory over the Electrical-Mechanics.<br />\nfeatures combined with the<br />\nclimax. In his own inimitable way,<br />\nGuarantee make<br />\nLifetime°<br />\nCoach Dotterweich said, \"We gotta<br />\nteam, and dey gotta team. Mix dem<br />\nID<br />\nSheaffer's the world's most<br />\nThe<br />\nup, and we're on top.\"<br />\nwhite<br />\neconomical pens. See all<br />\ndot<br />\nAfter the game, the team will be<br />\nFall track practice has been going<br />\nident:fies<br />\ngradeso<br />\nfSheaffer'5f10m$2.25<br />\nentertained at dinner by the school on every day except Monday, for the<br />\nthe<br />\nPermission for the use of the City<br />\nwhich consists of 95% females and last week, under the capable direction<br />\nLifetime°<br />\nup at your dealer's. SHEAFFER<br />\nCollege swimming pool has just been<br />\n5% males.<br />\nof Edgar Vine11.<br />\npen<br />\n$8.50<br />\ngranted to the Hopkins swimming<br />\nDEALERS:WRITE IMMEDIATELY FOR<br />\nto $15<br />\nSpecial<br />\nattention<br />\nbeing<br />\nis<br />\nLineup<br />\ngiven<br />\nto<br />\nteam.<br />\nINFORMATION ON THE WONthose men who are out for the hurdCoach Hambleton feels the grant Hartman<br />\nGoal<br />\nSICRIP-WELL<br />\nles,<br />\njump,<br />\nand<br />\nDERFUL<br />\nweight<br />\nDRY-PROOF DESK SET.<br />\nthrowing<br />\n. Those<br />\nto be a help in that improvement of Price, Burnheim<br />\nFullbacks<br />\nevents<br />\npromise<br />\nto<br />\nneed<br />\nbolsterin<br />\nin<br />\ng<br />\nGough<br />\nSHEAFF<br />\nER PEN CO.<br />\nthe team is expected in place of its<br />\nCenter Halfback<br />\nW. A.<br />\nBaker<br />\njust keeping in form.<br />\nRight Halfback the spring and the fall is the best<br />\nMADIS<br />\nON, IOWA<br />\nFORT<br />\nPractice will be held every day Phillips<br />\nLeft Halfback time to prepare for spring by way<br />\nUses<br />\nand the schedule plus the opening Dertzbough<br />\nOutside Left of learning and inmproving form.<br />\nthe<br />\nThere<br />\nare<br />\nstill<br />\nplenty<br />\nberths<br />\nof<br />\nto<br />\nbe<br />\nLast<br />\npractice day will be announced some- Hahn<br />\nCenter Forward<br />\nDrop<br />\nCooper<br />\ntime after the football schedule.<br />\nCenter Forward filled by capable men and candidates<br />\nare desired.<br />\nLitwin<br />\nOutside Right<br />\nInside Right<br />\nBadminton Courts Open Mace<br />\nReserves<br />\nSHEAFFER PENS,<br />\nTumbling Gets Under Way<br />\nArrangements for the use of BadSilver, Kemp, Hubbard<br />\n$225 to $10<br />\nminton material can be settled any<br />\nWednesday, the team scrimmaged<br />\nInformation concerning future plans<br />\nafternoon with Mr. Reuben Baer. New with Kenwood High School and have for tumbling can be secured<br />\nSHEAFFER<br />\nby conbadminton equipment has recently also spent about a week<br />\nPen-SKRIP, Successor to<br />\nPARA.LASTIK, the new gum<br />\nSKRIP•GRIP<br />\nand a half tacting Mr. Reuben Baer, P.O. Box<br />\nPENCILS, $1 to $5<br />\nInk, 2 or., 15c. Permaadhesive; doesn't curl thinLiquid Paste<br />\nbeen acquired by the athletic depart- in practice. The next game<br />\nnent SKRIP makes better<br />\nwill be 236.<br />\nnest sheets; with handy<br />\nor Mucilage,<br />\nbusiness records<br />\nspreader brush, 25c<br />\nReg. U. S. l'at. Off.<br />\nment, and this equipment is open to at Homewood on October 24,<br />\n10c up<br />\nwhen the<br />\nAn appointment with Mr. Baer is<br />\nthe use of all those interested in the team will meet Maryland State Norrequired of those especially interested<br />\nsport.<br />\nmal School.<br />\nin corrective work.<br />\nSUCCESSOR-<br />\n<br />\nFrat Football<br />\nGames Continue<br />\n<br />\nOutlook Optimistic<br />\n<br />\nhit<br />\n<br />\nNc<br />\n<br />\nEx<br />\n<br />\nW estlers Begin Fall Lacrosse Under<br />\nInformal Drills Way On Lower Field<br />\n<br />\nInterclass Teams<br />\nStart New Season<br />\n<br />\nA REVOLUTION IN WRITING AND<br />\nFILLING '1 SHEAFFE<br />\n<br />\nSoccer Men Open<br />\n'35 Season Today<br />\n<br />\nNatators Gain Use Of<br />\nCity College Pool<br />\n<br />\nFall Track Practice<br />\nProgressing Well<br />\n<br />\n15c<br />\n<br />\nFREE PENCIL-SKRIP,<br />\n<br />\nTO-LEADS.<br />\n<br />\nSEE YOUR DEALER<br />\n<br />\n\f", "format": "basic_html", "processed": "opkitts Nruisi.firttrr<br /><br />\nirmommi<br /><br />\nin<br />\nIs<br /><br />\nMember Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nWEAK-MINDED FRESHMEN?<br />\n(EDITORIAL)<br />\n(See Page 2)<br />\nPrice<br /><br />\nHOME WOOD, BALTIMORE, MD., FRIDAY, OCTOBER 18, 1935<br /><br />\nVol XL—No. 6<br /><br />\nans<br /><br />\n;ht;<br />\nled<br />\nGus<br />\nare<br />\nOn.<br /><br />\nout,<br />\nDefor<br />\nof<br />\nht.<br /><br />\nthe<br />\n; of<br />\nv ith<br />\nwho<br />\nlast<br /><br />\n'ned<br />\nexoff-<br /><br />\nion,<br />\nmd<br />\nfull<br /><br />\n0111111r<br /><br />\nJay Team Opens<br />\nGrid Season On<br />\nShore Saturday<br /><br />\nCheerleaders Wanted<br />\nAmong Upper Classes<br />\nUpperclassmen are urged to come<br />\nout for positions on the cheerleading squad, Reuben Baer, coach<br />\nof the cheer-leaders, stated.<br />\n\"So far, the sophs, juniors, and<br />\nseniors have shown a hesitancy to<br />\ntry out for this activity,\" he continued. \"We hope to mold a wellgroomed bunch which will be a<br />\ncredit to the University, as tbe<br />\nupper classes need not feel reluctant to try their hand at this,\"<br />\nBaer added.<br />\nTen boys have been practicing<br />\nevery afternoon in the gymnasium<br />\nunder Baer's tutelage. From this<br />\ngroup, a team of from five to seven members will be chosen.<br />\n\"The cheer-leaders will be at all<br />\nmajor athletic contests, but will<br />\npreviously try to standardize the<br />\ncheers,\" Baer asserted.<br /><br />\nStrong Washington College<br />\nTeam To Furnish Gruelling Test To Varsity Team<br /><br />\nIs Annual Game<br />\nDarleymen Possess Spirit,<br />\nFast Backfield; Tough<br />\nWell-Drilled Men In Line<br />\nThe Blue Jay football team will<br />\nofficially inaugurate the 1935 season<br />\nwhen they encounter a highly touted<br />\nWashington College eleven at Chestertown tomorrow afternoon. A whistle<br />\nwill be blown, a ball booted high in<br />\nthe air and a spirited, untried Hopkins team will pry the lid off the<br /><br />\nDr. McComas Publishes Scientific<br />\niews On Spiritualistic iVlediums<br /><br />\nSponsors Picked<br />\nFor Grad Dance At<br />\nY. M.C. A. Tonight<br /><br />\nGhosts I Have Talked With\" Author Reveals ExperiEn \"Ghosts<br />\nences With Psychic Phenomena; Refuses Comment,<br />\nSaying He Already \"Talked Too Much\"<br />\nElves, hobgoblins and errant spir- a medium intrigue you? Would you<br />\nits, and the shadowy things that creep like to bring messages to your<br />\nby night—how do these look in the friends? Has the role of mystic an<br />\ncold hard light of scientific analysis? appeal for you? If so, hark back to<br />\nIn his latest book, which bears the the words of Sir Arthur Conan Doyle,<br />\nintriguing title of \"Ghosts I Have 'Nearly every woman is an undevelTalked With,\" just published by Wil- oped medium. Let her try her own<br />\nliams and Wilkins, Dr. H. C. McCo- powers of automatic writing.'\"<br />\nExperience Justifies Scorn<br />\nmas, lectures in psychology at the<br />\nMuch of his experience, however,<br />\nUniversity, discusses the application<br />\nof his scientific training to the high- seems to justify the fine scorn with<br />\nly controversial subject of psychic which we more enlightened souls<br />\nphenomena, in all its manifestations treat the subject of spiritualism.<br />\nfrom flying trumpets to automatic Some of the most readable matter<br />\nin the book is to be found in descripwriting.<br />\nDr. McComas has been, for some tions of the crude devices used by<br />\nyears, scientific investigator for the many popular mediums.<br />\nIt is with some humility that the<br />\nAmerican Society for Psychical Re-<br /><br />\nPiccolo Player Won't<br />\nDon R.O.T.0. Uniform<br />\nWANTED—A militaristic piccolo player. Apply to Ed Ottenheimer, Hopkins Band leader before next Monday at 5 P. M., when<br />\nthe Band, resplendent in R. 0. T.<br />\nC. uniforms, supplies the music,<br />\nfor drill. Must be willing to play<br />\nin uniform, without fear of becoming a Blackshirt (from the heat)!<br />\nThe reason for this ad is obvious: the Band has but one piccolo player, name withheld, and<br />\nhe is a member of the local branch<br />\nof the N. S. L.; hence, to supply<br />\nmusic for the local \"army\", would<br />\nbe bad enough to do so in their<br />\nuniform would be worse.<br />\nThe result is that on Mondays<br />\nthe Band will play only the deeper<br />\nnotes to Mars unless a patrioticminded successor appears.<br /><br />\nFive Cents<br /><br />\nPres. Describes<br />\nWest'sDroughts<br />\nTo Sophs, Frosh<br /><br />\nVaried Program<br />\nCarded For Rally<br />\nMon. In Playshop<br /><br />\nDr. Bowman Intimates That<br />\n\"Shelter Belt\" May Be Influencing Elections Factor<br /><br />\nTapped By Frat<br />\nPresident Illustrates Speech<br />\nWith Slides Of Farms,<br />\nMaps Of Dry Regions<br />\nAfter being presented with a laurel<br />\nwreath indicative of his induction into 0. D. K., President Isaiah Bowman<br />\nspoke to the assembly on the drought<br />\narea of the west, later pointing out<br />\nits possible national importance.<br />\nWith the aid of lantern slides, Dr.<br />\nBowman showed how erosion and<br />\nlack of cultivation was ruining the<br />\nfarm lands in the west. He also told<br />\nhow poor farming conditions were<br />\nfurther aggravated by natural causes.<br />\nDelving into his trip into the western farming lands, Dr. Bowman told<br />\nof the agricultural aspects he found<br />\nin this area. In this manner he supplemented the slides, many of which<br />\nwere photographs of the arid wastes<br />\nof the west.<br /><br />\nsearch. In this capacity, he has twite.1 author approaches his reader. \"To<br />\nsuch famous mediums as \"Margery\" publish another book on spiritualism<br />\n(says his foreword), while the spruce<br />\nand Cartheuser. Although he has<br />\nforests are being so quickly deplete- Playshop Scene Of Meeting<br />\nnever fallen victim either to the skep- ed to make the pages of<br />\nimportant<br />\nWhere Program, RefreshBowman To Address Group; ticism of Houdini or the blind faith works, would seem to be an economic<br />\nments, Talks Scheduled<br />\nAffair To Feature Ed Nor- of Conan Doyle, the author displays crime. No one who believes in spirithigh respect for the greater psychics ualism ever changes his opinion by<br />\nwood; From 8.30 To 1 and considerable amusement at the reading arguments against it. Few An entertaining program, including skits, talks by old and new Barnclumsy efforts of the charlatan. The who do not believe are won over by<br />\nand refreshments will<br />\nMembers of the Hopkins faculty in- summary of his experiences is there- anything they read. What possible stormers,<br />\nertown lads.<br />\nof the Hopkins Drarally<br />\nthe<br />\nmark<br />\nvited to serve as sponsors for the fore replete both with amusing anec- justification can there be for a book<br />\nThis led to a discourse on the merMaroon Squad Powerful<br />\nMonday, October 21, in<br />\nGroup<br />\nmatic<br />\nfirst graduate dance tonight in Lev- dote and interesting scientific mate- of this sort? None, so far as the auits<br />\nof the \"Shelter Belt\" which will<br />\nproduction<br />\nfirst<br />\nmost<br />\nThe<br />\nthe<br />\nof<br />\nPlayshop.<br />\none<br />\nthe<br />\nare<br />\nThe shoremen<br />\nthor can see. It is perpetrated at the<br />\nering Hall have just been named. rial.<br />\nof the season will be announced at probably be placed before Congress.<br />\nformidable elevens in the state. They are: Dr. and Mrs. Bowman, Dr.<br />\ninstigation of a number of insistent<br />\nNot So Skeptical<br />\nDr. Bowman stated that the shelter<br />\nthis gatherng.<br />\nSweeping victoriously through a diffi- Ames, Dean and Mrs. Berry, Dr.<br />\nScientific though he is, Dr. McCo- friends. It was their belief that the<br />\nthe first time in its history, belt would be definitely beneficial.<br />\nFor<br />\ncult schedule last season, they have Donald H. Andrews, Dr. Florence<br />\nmas is by no means so skeptical of point of view of a scientist who had<br />\nand it is the oldest activity on the<br />\nUsing colored map slides near the<br />\nalready trounced American Univer- Bamberger, Dr. and Mrs. Alan M.<br />\nsuperstitions and curious psychic ex- tried seriously to learn something<br />\ncampus, the Barnstormeers have se- end of his talk Dr. Bowman pointed<br />\nsity and outfought Swarthmore this Chesney, Dr. and Mrs. W. W. Cort,<br />\nas his degree and position about modern spiritualism would<br />\nperience<br />\nsured the services of a professional out the way in which the coming nayear. A veteran group, reinforced by Dr. Kent Roberts Greenfield, Dr. and<br />\nwill attest. He is thus willing to re- prove of value to many people who<br />\ncoach for their initial play of the tional election would be affected by<br />\nan ample supply of new material, the Mrs. R. W. Hagner, Dr. Karl Herzcount several curious tales without are interested but are neither believcoming season. Paul Hinrichs, ex- the condition of the farming areas in<br />\nmaroon team has brilliant possibilities feld, Dr. and Mrs. Duncan S. Johnson,<br />\nattempting to explain them except ers or unbelievers. I hope that they<br />\nBarnstormer and Hopkins graduate, the west.<br />\nfor repeating its 1934 performance. Dr. and Mrs. W. B. Kouwenhoven,<br />\nare<br />\nstories<br />\nright.\"<br />\nthe<br />\nof<br />\nThose<br />\nby spiritualism.<br />\nformerly connected with the TheaBecause of their experience and Dr. and Mrs. Warren H. Lewis, Dr.<br />\nDavid H. Levy, president of the<br />\nDr. McComas was no less modest<br />\nwhich deal with the scientific pheter Guild, the PlaymaSters, and other Omicron Delta Kappa Honorary frabulk the linesmen form a powerful and Mrs. Samuel 0. Mast, and Dr.<br />\nwhen<br />\nare<br />\napproached<br />\nfor comment on the<br />\nnomenon of automatic writing<br />\namateur theatrical groups of Balti- ternity, introduced President Bowforward wall. The ends are Jim Salter and Mrs. David M. Robinson.<br />\nparticularly interesting. In summar- publication of his work. He shook his<br />\nathversatile<br />\nboth<br />\nmore.<br />\nand Al Bilancioni,<br />\nman and also prestented him with a<br />\nThe affair, which will last from izing this form of spiritualism, Dr. head aggrievedly, and remarked, \"I<br />\nSears Gives Statement<br />\nletes who are as capable on the bask- 8:30 to 1, is sponsored jointly by the<br />\nlaurel wreath.<br />\nsays, \"Does the career of think 'I' is said too much already.\"<br />\nMcComas<br />\nZenas Sears, president of the<br />\netball court as on the gridiron. The Y. M. C. A. and the Graduate StuBefore this presentation, Levy said<br />\nBarnstormers, stated:<br />\ntackles are Kirby and Benham. Gal- dent Social Committee. Ed Norwood's<br />\na few words about the 0. D. K. He<br />\nbring<br />\npost<br />\nto<br />\nintended<br />\nis<br />\nrally<br />\n\"The<br />\nlant is stationed at the pivot<br />\nseven-piece orchestra will provide the<br />\nannounced that the fraternity selecttogether all persons interested in the<br />\nand flanking him are Tignor, a pow- music.<br />\ned its members from the outstanding<br />\ndewho<br />\ngroup, especially freshmen,<br />\nerful lad, and Anderson. Capable remen in extra-curricular activities on<br />\nBowman To Speak<br />\nsire positions on the production,<br />\nplacements for these varsity men are<br />\nthe campus.<br />\nDr. Isaiah Bowman, president of<br />\nhighly<br />\nbusiness or acting staffs. It is<br />\namong the reserves. Judged by their<br />\nthe University, will be present to<br />\nThere are five qualifications, a<br />\nessential that everyone attend this<br />\nperformance in the first game of the<br />\nmeet the graduate students for the<br />\ngood<br />\npart of which 0. D. K. candiPlay<br />\nTo<br />\nTomorrow gathering, for it will afford all who<br />\nHopkins Chapter To Find Band<br />\nseason, the second string linesmen<br />\nfirst time and will make a short<br />\ndates must fulfil in order to become<br />\nour<br />\nwhat<br />\nto<br />\nan<br />\ncome<br />\nintroduction<br />\ngroup.<br />\nare a scrappy, willing<br />\nFrom 9 Till 12 In Lever- group is like.<br />\nTrend To War And Fasspeech of welcome. A musical proa member of this national honorary<br />\nYoung Outstanding<br />\ngram will be rendered by three men,<br />\nIs<br />\nAdmission<br />\n$1.10<br />\ning;<br />\nThem<br />\nFight<br />\nTo<br />\n\"Many of the old-timers will be on fraternity, Levy stated. They are, he<br />\nPlans<br />\ncism;<br />\nFour veterans comprise the fast, two former Hopkins students and one<br />\nhand to greet the assemblage and said, character, scholarship, athletic<br />\nheavy backfield. Outstanding in this present student. Dr. Lawrence A.<br />\nThe second in a series of weekly they will certainly furnish some en- achievement, publications work and<br />\nthe third United<br />\nfor<br />\nIn<br />\npreparation<br />\nquartet is Gibby Young, diminuitive Petran, who received a Ph.D. in psyStates Congress Against War and dances given by the Cotillion Board tertainment. Besides this, a number other extra-curricular activities.<br />\nquarterback. Young—Hopkins fans chology in 1930, and who is now ReFascism, the Johns Hopkins chapter of the University will be held tomor- of Baltimores prettiest young acwill bitterly recall—was the brilliant search Associate at the Peabody<br />\nwill play host to the Baltimore area row night in Levering Hall. The tresses will be at the Playshop and<br />\nback who,twisting and turning, reeled Conservatory, will play the piano.<br />\na conference to be held at Lever- \"Townsmen\", popular Baltimore or- this in itself is attraction enough.<br />\nin<br />\noff a 102 yard run after he had in- Included among his selections is a<br />\nchestra, have been secured again to<br />\nHall on November 2 and 3.<br />\ning<br />\nTwo Plays Presented<br />\ntercepted a pass behind his own goal work composed by Dr. Donald H.<br />\nPreliminary conferences for this play at the dance which will last<br />\nThe Barnstormers presented two<br />\nline in the last Hopkins-Washington Andrews, of the chemistry departCongress which is to meet in Cleve- from 9 until 1.<br />\nplays last season for the first time in<br />\ntiff. This season again Young is in ment. Stuart LeCompte, graduate of<br />\nThe members of the Cotillion a number of years. They were \"See<br />\nAll students who are interested in<br />\nland on January 3, 4, 5, 1936, are befast form and has made several long two years ago, and now working in<br />\ning held all over the United States. Board, which is headed by Allen Del- Naples and Die,\" and \"The Road to joining the Rifle Club during the<br />\nruns, including a 90 yard dash against plant physiology, will sing. George<br />\nThe conference at the Hopkins will evett, includes D. Mead Johnson, Rome.\" This year's first production coming season are advised to sign<br />\nAmerican University.<br />\nSteiner, a freshman, who recently<br />\nup now with Sergeant Perry in the<br />\ndetermine the trends and develop- John L. V. Murphy, Jr., David Erck, will be given on November 14.<br />\nNicholson, Berry, and Huffman are won a competitive scholarship at the<br />\nNorth Loft of Gilman Hall. A new<br />\nment toward war and fascism and Brian Murphy, James Bradford, WilConcluding his statement, Sears<br />\nthe other varsity backs. Powerful and Peabody; will play the violin.<br />\nman, for his $2 dues, receives instrucmake special recommendations liam B. Kempton, John Ghinger, and said:<br />\nwill<br />\nshifty, they play a hard driving game<br />\ntion, if desired, targets, 50 rounds of<br />\nto the national Congress as to prog- J. Judge Mehling.<br />\nWhen we announce the play Monand are formidable opponents.<br />\nagainst<br />\nfight<br />\nthe<br />\nin<br />\ntactics<br />\nand<br />\neach week, the use of a<br />\nress<br />\nAny<br />\nmemfor<br />\naspirants<br />\nprospective<br />\nThree<br />\nDramas<br />\nBe<br />\nWill<br />\nday, work will begin in earnest. We ammunition<br />\n(Continued on Page 4, Col. 6)<br />\nwar and fascism.<br />\nbership on the Cotillion Board should have secured a fine coach and look rifle and of the 50-foot range in the<br />\nPresented By Playshop<br />\nreport to the Board Room in Lever- forward to a very successful season.\" North Loft. Returning members have<br />\nCleveland Congress<br />\nonly $1 dues to pay.<br />\nat Cleveland will be ing Hall on Tuesday at 12:20. At that<br />\nCongress<br />\nThe<br />\nDr. Fagin to Direct Plays in Celebraplan<br />\nthe<br />\nyear<br />\nfor<br />\ntime<br />\ncurrent<br />\nwork<br />\nthe<br />\ndiscussion<br />\nround-table<br />\na<br />\nThe range will open in the early<br />\non<br />\nrun<br />\ntion of the Fifteenth Annigeneral headings of: Youth, will .be explained in more detail Ex-Pres. Ames Invited<br />\nof November probably about the<br />\nthe<br />\npart<br />\nunder<br />\nversary of Group<br />\nwomen, labor, religion and education, Elections to the group are held in<br />\nsecond week. Tryouts for the Rifle<br />\nOhio<br />\nTo<br />\nInauguration<br />\nDr. Florence Rena Sabin, former<br />\nnational minorities, organizational June of next year.<br />\nTeam will start about a month later,<br />\nUnder the direction of Dr. N.<br />\nprofessor of history at the Hopkins,<br />\nstructure and tactics, and local deDr.<br />\nAt<br />\nGuests<br />\nAmes<br />\nAmong<br />\nTwelfth weekly scores for three positions—<br />\nBryllion Fagin, the Johns Hopkins<br />\nwas announced this week as the third<br />\nvelopments. Local branches will furprone, kneeling and standing, deterPresidential Induction At Ohio<br />\nPlayshop will celebrate its fifteenth<br />\nrecipient of the M. Carey Thomas<br />\nthe material from their local<br />\nmine a member's chances for placing<br />\nnish<br />\nState<br />\nUniversity<br />\nanniversary by presenting three plays<br />\nPrize of $5,000 for achievement by<br />\nstandpoint.<br />\non the team. Returning team memduring the coming season. `eJeppe of<br />\nwomen in science.<br />\nThe League Against War and Fasbers this year are P. W. Guild, Cathe Hills,\" by Ludvig Holberg, a faAmong the invited guests at the<br />\nDr. Sabin has been a member of<br />\ncism was started in Amsterdam by<br />\ndet major and team captain; Henry<br />\nplaywright,<br />\nopens<br />\nmous Danish<br />\nthe<br />\nJesse N. Borden, editor-in-chief of inauguration of Ohio State's twelfth Leber, and Don Noonan. J. A. Macthe Rockefeller Institution for MedHenri Barbusse. The idea in mind of<br />\nseason. Hermann Sudermann's \"The<br />\nNewsLetter, and David Levy, president on November 14 is former Williams is<br />\nthe<br />\n'al Research in New York since 1925.<br />\nsummer<br />\nthe<br />\nin<br />\nmet<br />\nthe delegates who<br />\nteam manager. A schedFires of St. John,\" a German drama,<br />\nmanager, will attend the In- President Joseph S. Ames of the ule of<br />\nbusiness<br />\nmember<br />\nwoman<br />\nShe was the first<br />\nof 1932 was to combine all peace ormatches with other colleges in<br />\nhas<br />\nfollows.<br />\nchoice<br />\nAs<br />\nthird<br />\nJohns<br />\nthe<br />\nyet<br />\nHopkins<br />\nUniversity.<br />\nconNews Association<br />\non the staff of the Institute and also<br />\nthe East is now being arranged.<br />\nganizations and organizations oppos- tercollegiate<br />\nnot been made.<br />\nThe selection of Dr. Herman Gervention which is to be held in Pittsfirst of her sex to be elected to memed to war and fascism and to decide<br />\nSherwood Anderson, well-known<br />\nburgh starting Friday, November 15. lash James has been made by the<br />\nbership in the National Academy of<br />\n(Continued on Page 3, Col. 6)<br />\nAmerican author; Prof. Kemp MaThe featured speaker of the first Board of Trustees and the faculty, Morphopolus To Talk<br />\nSciences.<br />\nlone, of the Department of English at<br />\nwill be the Honorable George H. who issued approximately 500 invitaday<br />\nTo N.S.L. On Greece<br />\nSpecialty Blood Diseases<br />\nthe University; and Mr. Ernst Feise, Dr. Bowman To Speak<br />\nEarle, Governor of Pennsylvania. On tions, extended to presidents of colThe majority of her time has been<br />\nof the German Department, will dewitness leges throughout the nation; the conAt International Party Saturday, the delegates willNebraska<br />\ndevoted to the study of blood and<br />\nMr. George Morphopolus will speak<br />\nliver lectures preceding the presenthe football game between<br />\nstitutional officers of the State of<br />\n-blood diseases, with particular attento the National Student League toscenes<br />\none-act<br />\nof<br />\ntation<br />\nfrom<br />\nvarious<br />\nand<br />\nPittsburgh.<br />\nof<br />\nOhio;<br />\nlearned<br />\nedupresident<br />\nand<br />\nDr. Isaiah Bowman, president of<br />\ntion to research on tuberculosis. Her<br />\nday at 1 o'clock Room B, Levering<br />\nplays.<br />\nThe editors of the three daily Pitts- cational societies.<br />\nthe Johns Hopkins, will speak at the<br />\ncontributions to science include disHall. His subject will be \"Recent Poto<br />\nDr.<br />\ncomesOhio<br />\nUniverJames<br />\nInternational Reception to be held burgh papers and representatives<br />\ncoveries concerning origin of lymlitical Developments In Greece.'.:.<br />\nsity<br />\nthe<br />\nof<br />\nUnivercampus<br />\nthe<br />\nfrom<br />\ndiswill<br />\nmen<br />\nLevernewspaper<br />\nand<br />\nin<br />\nbusiness<br />\n8:30<br />\nat<br />\nevening<br />\nphatics and functions of the white Heads Medical Research tomorrow<br />\n'According to reports in The Naing Hall. The party is being con- cuss problems of college journalism sity of South Dakota, where he had<br />\nand red corpuscles.<br />\nthe change from a Venizelos<br />\ntion,<br />\nHe<br />\nbeen<br />\n1929.<br />\nsucsince<br />\npresident<br />\nThey<br />\nRelations<br />\ntheir<br />\nin<br />\nof<br />\nlight<br />\nexperience.<br />\nthe<br />\nFriendly<br />\nthe<br />\nDr. Herbert Spencer Gasser, who ducted by<br />\nPresentation of the $5,000 prize<br />\nceeds the late Dr. Elmer Burritt dominated mock democracy to a<br />\nis<br />\nwhat<br />\nan<br />\nof<br />\nM.<br />\nY.<br />\naccount<br />\nwill<br />\ngive<br />\nalso<br />\nthe<br />\nby<br />\nsponsored<br />\nCommittee,<br />\n1915<br />\nin<br />\nfrom<br />\ndegree<br />\nM.D.<br />\nhis<br />\nWill be made on November 2, on the received<br />\nBryan in a line of distinguished pres- monarchy, implies a shift from Italthe Johns Hopkins University, has C. A. of the Johns Hopkins Univer- going on in their fields today.<br />\nBryn Mawr College campus.<br />\nidents<br />\nof this, the oldest university ian domination to British,\" Maus<br />\nthe<br />\nbe<br />\nwill<br />\nspeakers<br />\nthe<br />\nAmong<br />\nsity<br />\nthe<br />\nof<br />\nhead<br />\nnew<br />\nDr. Sabin, who was born in Cen- been appointed the<br />\nin<br />\nthe<br />\nNorthwest Territory. Former Darling, a member of the organizaJohn<br />\nDaniel De Lima, chairman of the former editor of the Pitt News,<br />\ntral City, Colorado, served as profes- Rockefeller Institute for Medical Represidents<br />\nof Ohio University include tion stated. \"In advent of a war bepresiMoore,<br />\nHerbert<br />\nTibby;<br />\nM.<br />\nK.<br />\nstated<br />\nCommittee,<br />\nRelations<br />\nForeign<br />\nFlexsor of histology at the Hopkins from search. He succeeds Dr. Simon<br />\nthat invitations had been issued to all dent of the Transradio Press Service, William Holmes McGuffey, author of tween Italy and Britain control of<br />\n1902-1925. She received her doctor's ner.<br />\nthe famous Readers, and William Grecian seaports would play an imHis work being that of a physiolo- non-American students who had reg- and probably Heywood Broun.<br />\ndegree in 1900 and was Assistant in<br />\nHenry Scott, a past president of Ohio portant role,\" he added, \"and we feel<br />\nconvention<br />\nthe<br />\nfor<br />\nHeadquarters<br />\nother<br />\nHowever,<br />\ntrY\".<br />\nthe<br />\nat<br />\nistered<br />\n50<br />\nlast<br />\nthe<br />\n\"In<br />\nsaid,<br />\nGasser<br />\nAnatomy from 1902 to 1903. From gist, Dr.<br />\nState University and at present Ohio that this talk will be very enlighten1905 to 1917 Dr. Sabin was an As- years the conquest of infectious dis- foreign scholars in the city are wel- will be the Hotel Schenley, in the<br />\ning.\"<br />\nUniversity's oldest living graduate.<br />\nPittsburgh.<br />\nof<br />\nheart<br />\ncome.<br />\nsociate Professor at the University. eases has been very successful.\"<br /><br />\ncurrent schedule.<br />\nThe game promises to be a crucial<br />\ntest for the Darley men. The maroon<br />\nand black will present almost intact<br />\nthe same powerhouse aggregation<br />\nthat handed the Jays a setback last<br />\nseason. However, showing an enthusiasm unequalled in recent years, the<br />\nHopkins squad will endeavor to cut<br />\nshort the victory march of the Chest-<br /><br />\nLeague Conference Townsmen Carded<br />\nTo Be Held Nov.2,3 At Second Cotillion<br /><br />\nRifle Club Members<br />\nUrged To Sign Up<br /><br />\nDr.Sabin Wins Prize<br />\nFor Work In Science<br /><br />\nBorden,Levy To Go<br />\nTo I. N. A. Sessions<br /><br />\n2<br /><br />\nHOME WOOD, BALTIMORE, MD., OCTOBER 18, 1935<br /><br />\nTbe Pews=letter<br /><br />\nDeaf, Dumb and Blind<br /><br />\nFashions In Love<br /><br />\nBy HAROLD M. KROPMAN<br />\nLord, how are they increased that trouble me:<br />\nMany are they that rise up against me . . . Psalm<br />\nIII, line 2 . . .<br />\nParticularly apropo is the above quotation just about<br />\nthis time. Seniors are being shown the dark and dismal side of life by having the senior essay list rubbed<br />\nover their faces, made into handkerchiefs and towels,<br />\nand ground up and placed in their food—just so they<br />\nwon't forget about it. Juniors are learning to spend<br />\ntwenty-four and forty-eight hours at a time parted from<br />\ntheir light o' loves. Sophomores and freshmen do battle<br />\nevery day with their arch-enemies, the profs. Quizzs,<br />\npapers and readings are thrust on everyone . . . Is<br />\nthere no peace?<br /><br />\n(From Reader's Digest)<br /><br />\nFounded 1897<br />\nSubscription per year<br />\nBy Mail<br /><br />\n$2.00<br />\n$2.50<br /><br />\nRemit subscription fees to Treasurer, Student Activities Council, Remsen Hall, Postoffice, Johns Hopkins University.<br />\nEntered as second-class matter December 3, 1909,<br />\nat the Postoffice in Baltimore, Md., under the Act of<br />\nCongress, November 3, 1879.<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods<br />\nby undergraduates of the Johns Hopkins University.<br />\nEDITORIAL DEPARTMENT<br />\nJesse N. Borden<br />\nEditor-in-Chief<br />\nIrving Leberfeld<br />\nManaging Editor<br />\nWilliam Diamond, Stanley M Finkel,<br />\nAssistant Managing Editors<br />\nHershner Cross<br />\nNews Editor<br />\nKenneth Zierler<br />\nSports Editor<br />\nAssistant Sports Editor<br />\nDavid Caplan<br />\nEdgar Kemler<br />\nFeature Editor<br />\nHarold Kropman, Jack Stein, Sidney Green,<br />\nColumnists<br />\nBUSINESS DEPARTMENT<br />\nDavid H. Levy<br />\nRobert Watkins<br />\nRobert Levi<br />\nWilliam Kempton<br />\nMelville Locker<br /><br />\nBusiness<br />\nAdvertising<br />\nCirculation<br />\nOffice<br />\nCopy and Filing<br /><br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br /><br />\nBUSINESS STAFF<br />\nS. Prager, G. Willen, H. Linkoff, W. Erlanger,<br />\nN. Soifer, S. Tinley<br /><br />\nFriday, October 18, 1935<br /><br />\nWeak-Minded Freshmen<br /><br />\nIt is curious how fashions , rule<br />\neven in love making. The vogue fifty years ago was for a man to approach a lady in a very delicate manner and about halfway, he had to stop<br />\nshort. The woman was far too precious, too angelic, to touch. This<br />\nmust have made women feel very<br />\nsafe, but kind of desperate. The prin-<br /><br />\nSO THEY SAY<br /><br />\nIntercollegiates<br /><br />\n\"I am sure of one thing. America,<br />\nin formulating a clear, emphatic and<br />\naffirmative peace policy, will have<br />\nunbounded support from former European citizens who have seared on<br />\ntheir minds and hearts a memory<br />\nof war and the fear of war. I have<br />\nhad American citizenship only three<br />\nyears.\" — Benito Cimbalo, former<br />\nItalian citizen.<br /><br />\nPrincton students are complaining<br />\nabout the dirty dormitories.<br />\n* * *<br /><br />\nI<br /><br />\nOver 9,000 miles will be covered<br />\nby Colgate's football team.<br /><br />\nI<br /><br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\n91<br /><br />\n*<br /><br />\nA squad of 34 former college play- ?coi<br />\ners from the Pacific Coast will play<br />\nten football games in Japan this fall.<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\n\"Postcard from Yuma, Arizona: I asked a miss, \"What is a kiss,<br />\ncipal aim of a high-minded man was I just stepped out of a plane here<br />\nGrammatically defined?\"<br />\nnot necessarily to win the beautiful with the only girl and got off a lit- She. said, \"A kiss is a conjunction:<br />\ntle mot, which I thought, if I do say,<br />\nsir,<br />\ncreature he loved, but to sit in his<br />\nrather good. But she topped it by<br />\nAnd cannot be declined.\"<br />\nGr<br />\nroom<br />\nand have the right kind of<br />\nAnd then there is the new one about the constiremarking: 'The old sense of Yuma,<br />\n*<br />\n*<br />\n*<br />\npated driver who paid no attention to the honking<br />\ngentlemanly vapors about her.<br />\neh, baby?'\"-0. 0. McIntyre, New<br />\nA play in fie a As from the Emof a horn. This is a joke. If you don't get it, drop<br />\nOne of the most famous love lyrics York Day By Day.<br />\nporia bulletin:<br />\nme a note. P. 0. 653.<br />\n*<br />\n*<br />\n*<br />\nof this era, Lord Tennyson's thin litACT I<br />\n\"Government<br />\nin<br />\nBy<br />\nbusiness is like an<br />\n\"Filltm up again, McGinnis.\"<br />\nMiss Lanier, librarian, who once tried her hand at tle series of sighs, inserted as a song<br />\numpire<br />\ncoaching<br />\na<br />\nbaserunner.<br />\nIf<br />\nACT II<br />\nA<br />\npoetry, because she is the nice of Sidney Lanier, and in his poem about \"The Miller's<br />\nthat happened in the World Series,<br />\n\"Fillemupagain, McGinnis.\"<br />\nthen resigned herself to a less significant life, is study- Daughter.\" He says he wishes he<br />\nkins<br />\nthe park would be filled with pop<br />\nACT III<br />\ning library work at Harvard. She has a long way to were the<br />\nGiln<br />\ngirdle \"about her dainty bottles and brickbats.<br />\n\"Fillumupginnis.\"<br />\ngo to catch up to Miss Tiese.<br />\nteri;<br />\nwaist.\" If he were, he could hear her<br />\n\"If you let the professors run this<br />\nACT IV<br />\nPart of the space-saving equipment of the comcountry four years more, you won't<br />\nC.<br />\nheart<br />\nbeat,<br />\nhe<br />\n\"Finis!\"<br />\nexplains.<br />\nIt<br />\nmakes<br />\nhim<br />\nplete prefabricated home is built into the toilet seat.<br />\n*<br />\n*<br />\n*<br />\nting<br />\nquite excited to hear a lady's heart want to own even a good setting<br />\nIt weighs the sitter when he raises his feet.<br />\nhen.\"—Eugene Talmadge, Governor<br />\nThe officers of the Lehigh unit of retu<br />\nbeat, and apparently the only way he<br />\n—Business Week.<br />\nof Georgia.<br />\nthe R. 0. T. C. will be equipped with abs<br />\nsees how to do it is to get himself<br />\n* * *<br />\nleggings and puttees this year inToward A More Picturesque Speech<br />\ntur:<br />\nturned into a girdle.<br />\n'Say, tell me about these colored<br />\nstead of the riding boots. The stuThe train belched forth a traveler or two, and swalter(<br />\nIn the next stanza, however, he boys I gotta pitch against tonight. I dent officers are<br />\nmostly athletes with<br />\nlowed down a couple of fresh arrivals. Peppery exclahear they're pretty good. Gimme the<br />\noverdeveloped leg muscles and it has and<br />\nmations shuttlecocked to and fro. Again the locomotive changes his mind. He gets thinking dope, pal.<br />\nAre they hot stuff, sure been<br />\ndifficult to fit the men boots auc<br />\nuttered a raucous cry as it started off, dragging a dark about \"her balmy, balmy bosom\" and enough?\"—Je<br />\nrome (Dizzy) Dean, heretofore.<br />\nins<br />\nserpent behind „it, to disappear into the tunnel's maw. (1) wants to be a necklace instead. Then pitcher of St.<br />\nLouis Cardinals, just<br />\n* * *<br />\nThere's no one like him for getting up steam in the he could just rest and \"fall<br />\nmb<br />\nbefore<br />\nexhibition game in Baltimore<br />\nand rise\"<br />\nAll intoxicated persons will be<br />\nengine, but he can't stop at the platform (2) . . . His<br />\nSpE<br />\nall day and have a fine time. This Tuesday night.<br />\nkept out of the Ohio State stadium.<br />\nconscience was more his accomplice than his guide. (3)<br />\nSUI<br />\n* * *<br />\nthought works him up into such a<br />\nAs a test of sobriety, thumb wigglShe cast no bread upon the water unless it was sure<br />\nRei<br />\n\"In the Cathedral of St. Mary the ing will be tried.<br />\nto return a three-tiered layer cake (4) . . . He was state that he becomes very daring inoriginal Ark of the Covenant is bescr<br />\nenclosed in the monastery of his absorbd interests. (5) deed and says:<br />\n*<br />\n*<br />\n*<br />\nlieved to be preserved. Ethiopian<br />\nHe shook hands with me up to the elbow (6) . . .<br />\n\"And I would lie so light, so light<br />\nAt<br />\nthe<br />\nUniversity<br />\nof Holland,<br />\nhistory relates that when Solomon<br />\nEars like ventilators (7) . . . She wasn't exactly crossfreshmen must shave their heads and tril<br />\nI scarce should be unclasp'd at sent the son of his<br />\nhigh priest, with<br />\neyed—one of her eyes just ignored the other.<br />\nmay not use the doors. All entrances th<br />\nnight.\"<br />\nother sons of great dignitaries, to acMoonlight was poi,vderingthe world's face (8 . . . .<br />\nand exits must be made through the her<br />\ncompany<br />\nShebas<br />\nson, after his visit<br />\nAnd the song ends at that point,<br />\nHe looked down upon the marshland's smoking with<br />\nwindows.<br />\nto his father, the son of the high<br />\nse\\<br />\nmorning. (9) . . . The mosquito's plaintive hum and with this large bearded man presum* * *<br />\npriest took the original Ark of the<br />\nde(<br />\npointed address. (10)<br />\nably swooning away at the very idea<br />\nTwo-thirds of the students at the<br />\nCovenant with him, substituting an<br />\n\"cl<br />\nHe not only could neatly cock an eyebrow—he could of such ecstacy.<br />\nimitation ark, much to the indigna- University of Paris are Americans.<br />\nalso produce in his victim a feeling that he had aimed<br />\nThen take Mr. Thackeray.<br />\ni,t<br />\nHe tion of Solomon and that high priest.<br />\nand fired it. (11)<br />\ncan't very well wish he were a neckter<br />\n\"In justice to the high priest's son,<br />\nAn assignment at a mid-western<br />\nHe has a tremendous capacity for bleeding when lace, too, because Tennyson had that<br />\nit must be stated that an angel ap- university was to bring in a report<br />\nothers are wounded (12) . . . As sensitive as a seismo- big idea first, but he's got to get on<br />\npeared and gave him instructions on the Middle Ages. The professor<br />\ngraph (13) . . . Silent as a shadow. (14)<br />\na lady's breast some way or other.<br />\nabout stealing the ark.\"—Arthur received a review of \"Life Begins<br />\nat<br />\nShe held up her end of the conversation until it was So he decides he wants to be a violet.<br />\nBrisbane, columnist.<br />\nForty.\"<br />\nwa<br />\npractically perpendicular. (15)<br />\nThat is even better than wanting to<br />\nHe had caved in and gone down like a landslide (16) be a necklace; it shows he's more<br />\nha<br />\n. . . Anne of Brittany was expecting her first child of ethereal, and has sweeter and purer<br />\nbr,<br />\nthe new series (17) . . . If he had been a little machine thoughts. He delicately avoids night<br />\nrn<br />\ninstead of a little child, he might have grown up to be thoughts, too. He tells his girl that<br />\nfa<br />\na stam roller. (18)<br />\nall he wants of her, and the only kind<br />\ntic<br />\nA Pekingese—a cross between a muff and a chry- of love life he asks, is<br />\nsanthemum (19) . . . A forlorn dog with bowed head and<br />\nco<br />\n\"An hour to rest on that sweet<br />\ntail withdrawn from service. (16)<br />\nto<br />\nbreast,<br />\n1. Stefan Zweig. 2. Sir Arthur Solter. 3 Mrs. Dan<br />\nfo<br />\nAnd then contented, die.\"<br />\nMcCowan. 4. Margaret Widdemer. 5. Winifred Holtby.<br />\nof<br />\nIf a modern man were obsessed<br />\n6. Robert Louis Stevenson. 7. Archie Binns. 8. John Galsin<br />\nworthy. 9. Sinclair Lewis. 10. Charles F. Lummis. 11. with the noble ambition of being a<br />\nfa<br />\nZona Gale. 12. Virginia Faulkner. 13. Francis Brett violet, the family would take him to<br />\nin<br />\nYoung. 14. Walter Benton. 15. Weare Holbrook.<br />\n6. a psychiatrist. Yet that was once the<br />\nMark Twain. 17. Francis Hackett. 18. Gouverneur Mor- right way to woo a lady, and it may<br />\nin<br />\ncome back into fashion again—some<br />\nris. 19. Alexander Woolcott.<br />\na<br />\ngallant may be forlornly wishing he<br />\n—Readers' Digest.<br />\nsc<br />\nwere a coral lipstick.<br />\nle<br /><br />\nIn announcing the time for the election<br />\nof Freshman Class officers, D. Mead Johnson, president of the Student Council,<br />\noffered pertinent comment.<br />\nHe said, \"I would like to see every student pay serious attention to these elections.<br />\nTheir importance is too often disregarded.<br />\nHowever, it is easy to see that the election<br />\npf inept officers is a very serious matter.\"<br />\nThis statement is no doubt prompted h:y<br />\nthe action of the Class of '36 in electing<br />\nits Junior officers entirely unopposed. This<br />\nwas the first time in the history of the University that any class had elected its officers automatically.<br />\nA situation such as this is unhealthy. It<br />\nreveals that the class is either unanimously in favor of the candidates, or that politics<br />\nmake it useless to put an opposition candidate on the slate.<br />\nWhile there is some possibility that the<br />\nformer may be the case, its occurrence is<br />\n!Aare in an institgtion harboring so many<br />\ndifferent factions as the Hopkins. From a<br />\nknowledge of campus politics, it is easy to<br />\n*duce that some coalition of fraternities<br />\n;ot a strangle hold on the class during<br />\nthe frgshman and sophomore years and so sential to a good football game.<br />\n2ffectively beat down all opposition that it<br />\nAn analysis of the question as to why<br />\nFellow Foams<br />\nwas able to coast into all major offices in there is such a lack of spirit on the HopAt Freddie<br />\nthe third year.<br />\nkins campus entertains a rather confused<br />\nFrom this example it can be seen that mass of answers. Enthusiasm for the sports<br />\nA LETTER TO THE<br />\nJnce any particular group gets into power, at Hopkins has always been a questionable<br />\nEDITOR<br />\nt is hard to shake it from its position. And, 'subject covered by the assertion that Hopinfortunately, the attitude on this campus kins is a place for scholars alone; the ref- My dear Mr. Editor-in-Chief:<br />\nI am a man of very few words-las been to sit back, assume an apathetic erenck. being that study and athletics are but—!<br />\nlir, and say, \"Oh, well, we couldn't do any- incom,patible. It is certainly out of order As a stude of this here<br />\nnoble<br />\nhing, even if we wanted to.\" In public life, o claim that the Hopkins student is not versity I will not stand for allUnithe<br />\nis well as in campus life, the line of least the type. The effervescent attitude of the nasty-nasty remarks about fraternity<br />\n7esistance is to sit back and let the profes- students during any of the past Frosh- men. This statement may seem a bit<br />\niional politician take complete control, and Soph weeks is enough indication to war- hot-headed, but I'm mad—mad as<br />\nthe Dickens! (please excuse all strong<br />\nnstitute a corrupt system to further his rant contradiction on the point. It is fur- language).<br />\nher out of order for anyone to claim that<br />\n)wn ends.<br />\n\"Interfrat Freddie's Filth\", indeed!<br />\nfootball<br />\nis not wanted by the student body. Such a thing!<br />\nThe only way for a class to keep from<br />\nWe boys won't stand<br />\n'ailing into this political stagnation is for The olerwhelming majority in favor of for it—we just won't!<br />\n.veiry member to take an active interest in football at the student poll last year gives onWhy must we have such a person<br />\nour<br />\ncampus? Why? Why<br />\nhe elections and by his vote keep out the un- enough evidence to disprove this erroneous was he lovely<br />\nborn?<br />\nnotion.<br />\nlesirable elements which are always ready<br />\npoor deah boys of the S. P.<br />\nAt the beginning of this year there was, E.The<br />\nhouse feel badly their beau-ti-ful<br />\no slip into public office merely for the<br />\nhowever, an unmistakable enthusiasm, not home called a \"hovel\" . . . Oh! I<br />\n;raft attached thereto.<br />\nonly for football, but a general spirit un- could just scratch out your eyes.<br />\nAs no one faction has as yet gained any derlying the student body. Whatever<br />\nthe This might be a little firm and<br />\n!ontrol, The Freshman Class is starting reason, this has now practically disappeare hard on you, Freddie—but you must<br />\nd. be put in your<br />\nvith a clean record. Its first election is a Where football is concerned some blame<br />\nplace.<br />\nthe you bad, bad boy! Don't forget—<br />\n!rucial one, because it will demonstrate faulty schedule—claiming that<br />\nin addition I can see no reason—none at all—<br />\n:hat the class of '39 is either a group of iLo a very late beginning, the first<br />\ntwo to make a column so uncouth. (If<br />\nveak-minded babies who can be bossed by I ames are played away, a fact<br />\nwhich gives you must be indecent, be indecent by<br />\n'professional\" politicians, or a group of ithe student body ample<br />\ntime to lose inter- all means; but, er, be indecent.) Of<br />\nhinking men who are anxious to perform ,est. Maybe that is<br />\ncourse, I realize. that I am taking a<br />\nthe case—maybe not! lot<br />\non my shoulders to write this—I<br />\nheir duty to themselves and their class.<br />\nAt any rate, there is apparently a definite guess<br />\nI'm just a devil.<br />\nlack of that indefinable collegiate vitality All I can say is, if you don't stop<br />\n1 n the campus now. It has already been writing about the Alpha Delts \"blood<br />\nmachine\" (which is a lie!)—<br />\nFootball And Spirit<br />\nI ointed out that past events indicate this to testing<br />\nyou're<br />\na<br />\nword! Oh! to think I<br />\n1be just a dormant characteristic at the time. have beendirty<br />\nable to control myself for<br />\nThe spirit on the campus is hardly inThe Hopkins football team is something the period I have. Is it any<br />\nwonder<br />\nicativle of the fact that the first game of Lo be proud of. It is a college team true to I'm<br />\njust bubbling over?<br />\nhe current season is only one day off. o the sense of the word—one of the few In closing, may I say that I hope<br />\nFortunately, the football squad itself is ]remaining teams whose athletes are subsi- you will take this to heart. A public<br />\nmbued withh enthusiasm enough to carry (ized in no way whatsoever. Men composing apology in the next issue of our dear<br />\nt a long way towards a successful year. It I he team are out for th sport's sake itself: paper will be accepted in good spirit.<br />\nlove you to address it to me—<br />\nLevertheless lacks the ardent backing of I or no other reason. It's a team 'worth I'd<br />\nyou rat!<br />\nn interested student body which is so es- J-ooting for.<br />\n\"BILLY\".<br /><br />\n[11<br /><br />\nHOUGH large,the Bell System is simple in structure.<br /><br />\nT<br /><br />\nThink of it as a tree.<br />\nBranches: 24 associated operating companies, each<br />\nattuned to the area it serves.<br />\nTrunk: The American Telephone and Telegraph<br />\nCompany, which coordinates all system activities.<br />\nRoots: Bell Telephone Laboratories and Western<br />\nElectric, whose functions are scientific research and<br />\nmanufacture; Long Lines Department of A. T. and T.,<br />\nwhich through its country-wide network of wires links<br />\ntogether the 24 operating companies, handles overseas<br />\nservice; Advisory Staff of A. T. and T., which advises<br />\nthe operating companies on all phases of telephone<br />\noperation and searches constantly for better methods.<br />\nWorking as one, these<br />\nmany Bell System units en- Why not call your folks<br />\nable you to talk to almost tonight?<br />\nFor lowest rates,<br />\nanyone, anywhere, any time.<br />\ncall<br /><br />\nby number after 7 P. M.<br /><br />\nBELL<br /><br />\nTELEPHONE SYSTEM<br /><br />\n3<br /><br />\nHOME WOOD, BALTIMORE, MD., OCTOBER 18, 1935<br /><br />\n9r.BurtonTalks Flying Circuses<br />\nOn Shakespeare<br />\nBefore Teachers<br /><br />\n1<br /><br />\nMARRIAGES A LA CAMPUS<br />\nBy FLORENCE HAXTON BRITTEN<br />\nAdvance Quotations From \"Red Book\"<br /><br />\nTalking About<br />\nFrats<br /><br />\nMeets, Discusses<br />\nYear's Program<br /><br />\nThey're getting married at college are kept secret, they are necessarily<br />\nWith all the talk about improper<br />\nAre To Discuss Fraternities<br />\nThrilling Incidents of the Old Gates<br />\na followed by deceptions and falsificathese days! Seniors, juniors, even<br />\na little story about a New<br />\nrushing,<br />\nFlying<br />\nCircus<br />\na<br />\nsource<br />\nare<br />\nthe<br />\nwhich<br />\nultimately<br />\ntions,<br />\njoined<br />\nred<br />\nAt Next Meeting Tuesday;<br />\nfew sophomores have<br />\nYork chapter might prove interesting.<br />\nmarch to the altar anh said their \"I of unhappiness to family and friends,<br />\nTurnbull To Address Frosh<br />\nBy GORDON GRAHAME DUCE<br />\nIt appears that Hell Week had just<br />\nbut more particularly to the man and<br />\ndo's.\"<br />\nflock<br />\nthe<br />\namong<br />\n137- ?opularity Of Shalfud Bard From 1919 to 1924<br />\nI decided to find out, if I could, the girl who continually make them a started, and the brothers wanted to<br />\nLay<br />\nof so-called \"flying circuses\", the<br />\nof this student rush toward ma- practice. Nevertheless, the girl who be sure of some unusual fun. ThereThe<br />\nwhy<br />\nStays Intact Despite<br />\n.<br />\nGates Flying Circus was the most fatrimony. And even more important, has secretly married has broken no fore, they ordered one of the pledges<br />\nMany Changes, He States mous and greatest of all time, and the whither. Do marriage and college college rule.\"<br />\nCampus Activities Next Topto change the age-old sign of \"Barthe one upon which this story is<br />\nmodern<br />\nthese<br />\nSmith, for instance, has no rule<br />\ngo nicely together in<br />\nic Of Commission; Membased. But, first we are going to start<br />\nnard\", the femme college of Columor are they substances, each against student marriages—has not<br />\ntimes,<br />\nwith the name of Clyde E. \"Upsidebers To Attend<br />\n\". Due<br />\ncm<br />\nexcellent in its own way, which do had since the war. Marriages without bia University, to \"Barn\"y\"ard<br />\ndown\" Pangborn, who was perhaps<br />\nand<br />\nground<br />\nthe<br />\na<br />\nfrom<br />\nlegal<br />\nadvantage?<br />\nraise<br />\nheight<br />\nconsent<br />\nparents'<br />\nthe<br />\nto it's<br />\nnot mix to<br />\nFull attendance marked the meetthe nucleus of the flying circus. Early<br />\nGraduate Recalls Early Days in<br />\nCollege has always been an excel- problem in the matter of guardian- its distance from the roof, the ing of the Freshman Commission<br />\n1919 he was sent to Ellington<br />\nThe divorce- ship, for which the college cannot, of<br />\nAt The Old Hopkins Field, Houston, Texas, as an instruc- lent mating-ground.<br />\n\"gents\" promised to excuse said held Tuesday evening. The program<br />\nwould go out of business if course, be responsible.<br />\ncourts<br />\nMfor the coming year was planned at<br />\nhe<br />\nhis<br />\nwartime<br />\nhere<br />\nmet<br />\nwas<br />\nIt<br />\ntor.<br />\npledge from further \"Hell\" if he<br />\nOn Howard Street<br />\nhad to depend on the couples<br />\nthey<br />\nC.<br />\nGilderthe session held at Levering Hall.<br />\nDean<br />\nVirginia<br />\nBernard's<br />\nbuddy, Ralph A. Reid.<br />\nthe night.<br />\nwho meet each athet in college and sleeve hopes that I will not treat the completed the task during<br />\nFraternities pro and con will be<br />\none<br />\nthem<br />\nC.<br />\n0.<br />\napproached<br />\nThe<br />\nBy WETHERED BARROLL, JR.<br />\nafterward. But undergraduate subject of undergraduate marriage in<br />\nSaid neophyte, with the aid of God, the subject taken under consideramarry<br />\nday \"How would you fellows care to<br />\nA graduate who attended the Hopmarriages are something else again. any sensational way in my article— completed said task, and the morning tion at the next meeting of the group.<br />\nhave your own personal ship while<br />\ninstance, how<br />\nkins back in the days of President here at the field?\" They accepted en- One wishes to know, for<br />\n\"Because there's really nothing sen- sun informed the \"studes\" that they Douglas Turnbull, a graduate of the<br />\ndo not choose sational about it. A woman who was<br />\nwho<br />\npeople<br />\nyoung<br />\nthese<br />\nJohns Hopkins and a member of the<br />\ncharacBurton,<br />\nRichard<br />\nthat<br />\nGilman, Dr.<br />\nthusiastically, but soon found<br />\nwere inmates of a farming school—<br />\nto wait, stack up as students. What already married entered with our secMount Washington Club lacrosse<br />\nJohn<br />\nwas<br />\ntiresome,<br />\nDr.<br />\nflying<br />\ny<br />\npupil,<br />\nstraight-awa<br />\nformer<br />\nterized by his<br />\nthem to take that leap ond class ,in 1890. Ever since then, I or so the sign read!<br />\nlead<br />\nmotive's<br />\nwill take the side of the frateam,<br />\nso they began thinking up things to<br />\nC. French, head librarian, as a disWell, this is where the fun began. teritnies in a speech to the group. A<br />\nfor life called marriage so early? imagine, we have had married women<br />\ndo.<br />\ntinguished teacher, critic, and poet,\"<br />\nAnd more important in the long run, enrolled as students.\"<br />\nIt seems as if the \"higehr ups\" didn't discussion will follow Turnbull's talk<br />\nThey would fly high until they saw<br />\ndo these marriages a la campus give<br />\nof returned to his alma mater after an<br />\nlike the new view—or somethin'. next Tuesday evening.<br />\nobsituation<br />\nsame<br />\nthe<br />\nSomewhat<br />\na barnyard and then dive down<br />\npromise of developing into permanent, tains in New London at the ConnecThe following Tuesday evening,<br />\nth ;absence of over a quarter of a cenTherefore they suspended the lucky<br />\n\"hedgehopping.\" Horses leaped over<br />\nalliances, or the reverse?<br />\n29, the organization will elect<br />\nhappy<br />\nOctober<br />\nyesis<br />\n\"There<br />\nHall<br />\nWomen.<br />\nfor<br />\nticut College<br />\nfences, cows kicked over milk buck11- tury to lecture in Latrobe<br />\nboy until he removed that which he its officers. At the same time memI discovered that college profesBlunt,<br />\nterday on the topic, \"Shakespeare ets, hens stopped laying. They tried sors in all the colleges that dot our no ruling,\" says President<br />\nhad wrought.<br />\nbers of the Student Activities Comstudents. Whether<br />\nmarried<br />\n\"against<br />\nthe<br />\ncommuof<br />\nto<br />\noff<br />\nthe<br />\ntake<br />\nknob<br />\nan<br />\nBefore<br />\nIs and the Modern Theatre.\"<br />\nstory long, \"pret- mittee will lead a discussion of some<br />\nshort<br />\na<br />\nStates, from the University of Calimake<br />\nTo<br />\nsuch students live in the dormitories<br />\nnity flagpole and tried to pick the<br />\nts audience of high school and college<br />\nfornia to Maine, and from Minnety boy\" did everything he could— of the phases of activities carried on<br />\ndepends upon the individual case.\"<br />\nhands from the town hall clock. They<br />\nSouth to Missisinstructors, Dr. Burton stressed the waved to stenographers in Houston sota way down<br />\nof the wo- even blasted—but no good came of about the campus.<br />\nattitude<br />\nliberal<br />\nthe<br />\nBut<br />\n;<br />\nThe following freshmen compose<br />\nsippi, have decided, and varied, opinmen's colleges is in striking contrast it; he still remained \"ex-college boy.\"<br />\nintense interest shown in Shake- office-huildings. They would fly high<br />\nthe Commission: Zoel Radner, Nelson<br />\nions on all these matters.<br />\nof<br />\nmany<br />\nin<br />\neffective<br />\npolicy<br />\nwith the<br />\nspeare's comedies, especilally \"Mid- until they would sight an interurban<br />\nAnd to this day that naughty \"y\" Lloyd: William Sattler, J. H. Beeler,<br />\nPerhaps the most radical of all in<br />\nfull of<br />\nthe large Eastern men's colleges. For<br />\nErnest<br />\nsummer Night's Dream,\" which Max trolley car. Deciding it was<br />\nProfessor<br />\nis<br />\nview<br />\nof<br />\npoint<br />\nJoseph Ashbrook, Abraham Schneidhis<br />\nstill clings to its dizzy perch.<br />\n,1the most part the administrators of<br />\nGermans, they would dive down in<br />\npin!<br />\nGroves of the Institute of Research<br />\ner, William Schmied, George MurgaR.<br />\nfraternity<br />\n_Reinhardt has produced for the<br />\nhis<br />\ngot<br />\nP. S.—He<br />\nthe conservative \"gentlemen's colfront of it and wag their tail in the<br />\ntroyd, Miguel Firpi, Warren Lawin Social Science at the University of<br />\nscreen.<br />\nundat<br />\nnoses<br />\nastonished conductor's face. ComGroves is leges\" look down their<br />\nProfessor<br />\nCarolina.<br />\nrence, Robert Patton, J. E. Thomas,<br />\nNorth<br />\nSaying that \"there is no greater plaints came pouring in. The Comergraduate marriages or forbid them<br />\nShows<br />\nCensus<br />\nJr., N'ewland Day, Robert Ward, John<br />\nn a position to speak with authority,<br />\nA.<br />\nC.<br />\nM.<br />\nY.<br />\nId tribute to Shakespeare than the fact mandant called them on the carpet not only for his own but for other entirely.<br />\nSnodgrass, Howard Stier, Allan Spier,<br />\nTake Princeton: According to Dean<br />\nVaried Religious<br />\nes that he has survived the misappre- and gave them heck.<br />\nJohn Sigsby, Edwin Nye, William<br />\nuniversities. He is a research 'sociHad they been carrying on endan- ologist of wide reputation, and his Christian Gauss, the University rul; hensions that have followed him for<br />\nMehling, Henry Howeip, Andrew<br />\nInterests<br />\ngering their own and other people's book on \"The American Family\" is a ing is that \"any student who marries<br />\nFrommelt, C. A. Druah, E. V. Cross,<br />\nseveral hundred years, the -essayist<br />\nlives with wild stunts? Why, no, of standard college text.<br />\nwhile an undergraduate will be comEwan Chambers, Robert McBaur and<br />\ne ; declared he disliked the appellation<br />\nA census was recently compiled,<br />\nfrom the Univercourse not; they had been several<br />\nStreet Baldwin.<br />\nfor marriage,\" pelled to withdraw<br />\nwait<br />\nlong<br />\n\"The<br />\n\"classic\" to the Bard's works, since miles away at that time, shooting<br />\nsity unless excused from this compul- taken from the information filled out<br />\nProfessor Groves, \"particularly<br />\nsays<br />\nit was likely to frighten away po- landings on an emergency field. The<br />\nsion by the President or the Dean of on the Y. M. C. A. cards at the beprofessional preparation is<br />\nnumber was 314? \"Well, well, must when<br />\nthe College.\" And the ;burden of proof<br />\ntential readers.<br />\nginning of the school year. The folnecessary, is from every point of<br />\nbe another ship with the same nummost decidedly rests with the impetuFilm Is Vision<br />\nview, it seems to me, unfortunate.<br />\net<br />\nis a list of the various religlowing<br />\nber.\"<br />\nous lover, for Dean Gauss tells me<br />\nDr. Burton asserted that the film,<br />\nThere is the temptation to find a sub&gt;r<br />\nns contributed by<br />\nious<br />\ndenominatio<br />\nexceptions<br />\nfew<br />\nvery<br />\n(Continued from Page 1, Col. 3)<br />\nthat \"there are<br />\nThey went shopping for some washsitute for marriage; and with the<br />\nIt \"A Midsummer Night's Dream,\"<br />\nupon a minimum program of action<br />\nable showcard paint and turned the present liberal thinking and knowl- made to this rule—at the most, not 634 students:<br />\nwas the embodiment of a vision he number into a puzzle. They made the<br />\nthan one or two a year. At the No preference 76 Evangelical ......2 upon which they could all agree.<br />\nedge of birth control, this danger is more<br />\nhad seen in his lifetime. By the un- \"3\" look like an \"8\", and the \"1\"<br />\n_1<br />\nrhe Hopkins Chapter of the Amertime there are no undergrad- Catholics<br />\npresent<br />\n74 Christian<br />\ngreater than it has ever been.\"<br />\nwith the<br />\nmarried<br />\n..7<br />\nO<br />\nReformers<br />\nare<br />\nLeague Against War and Fasican<br />\nwho<br />\nuates<br />\nbroken sequence of the story in the look like a \"4\", etc. Sometimes the<br />\nspeaks<br />\nOf course Professor Groves<br />\n165 Unitarian<br />\nJewish<br />\n5 cism was organized last March by a<br />\n' movie, he stated, the illusion of a numbers 4841\", \"341\" or \"344\" were as a research sociologist and not an knowledge of the University author1 Christian Sc.<br />\n4 group of graduate students. It was<br />\nreported, but never 314, and they administrator. But the attitude of ities, and it is customery that there Mormon<br />\nfairyland mood was kept, a \"parProtestant<br />\nto<br />\nand<br />\nZion<br />\n1<br />\ncontinued to strafe trolleys,<br />\nnone.\"<br />\nare<br />\nbe<br />\nto<br />\n6 active last year in protesting against<br />\nseems<br />\nns<br />\nadminisratio<br />\nticular lost when on the stage on ac- run their wheels on the roof of Pull- college<br />\n85<br />\nEpiscopal<br />\nis<br />\nthe Teachers' Oath Bill and most rebut<br />\npermits,<br />\nalso<br />\nDartmouth<br />\nQuaker<br />\n4<br />\nchanging considerably. Let us intercount of intermissions.\" He pointed man coaches.<br />\n12 cently took the initiative in protesting<br />\nBaptist<br />\nNeidK.<br />\nL.<br />\nDean<br />\nhough<br />\napathetic—t<br />\nto<br />\npresidents<br />\nthe<br />\nand<br />\nview the deans<br />\nCongregation. ..2<br />\n65 against the recent Italian gift, conMethodist<br />\n(Continued in subsequent issues)<br />\nto the recent activity in placing bediscover what the actual practice in linger tells me that the number of Church of<br />\n49 sidering it \"an ill-advised action on<br />\nLutheran<br />\nfore the movie public film versions<br />\nincreasbe<br />\nto<br />\nseems<br />\nstudents<br />\nmarriage<br />\nmarried<br />\nte<br />\nregard to undergradua<br />\n2<br />\nBrethren<br />\n62<br />\nPresbyterian<br />\nof great classics and urged that the<br />\nthe part of the University in lending<br />\nmotives<br />\n\"The<br />\ning to a slight degree.<br />\nreally is.<br />\nits prestige to a government inimiof<br />\nOut<br />\nthe<br />\ndifferof<br />\ntotal<br />\nnumber<br />\nstunot<br />\nintelligent public ignore distasteful<br />\nare<br />\nmarry<br />\nwho<br />\nstudents<br />\nTake the women's colleges in the of<br />\nof<br />\nclass<br />\nfare, but show their active interest<br />\nthose of any other<br />\ndents who contributed data, 484 de- cable to everything Hopkins stands<br />\nEast: Vassar, under the leadership of ent from<br />\nin intellectual cinema.<br />\nfor.\"<br />\nof<br />\nresult<br />\nthe<br />\nare<br />\n•<br />\nusually<br />\nbut<br />\nclared their intentions of turning out<br />\nDr. Henry Noble MacCracken, has persons,<br />\nMembership in the League, accordfamily inwith<br />\ncombined<br />\nA reporter from the NEWS-LETTER,<br />\nimpatience<br />\nbeen steadily taking a more liberal<br />\nfor athletics and 464 stated they ing to the executive committee, is<br />\nYale's<br />\nthat<br />\nAfter<br />\nrecent<br />\ndefeat<br />\nthese<br />\nevidence<br />\nhim<br />\nno<br />\nis<br />\nfound<br />\nThere<br />\nInterviewing Dr. Burton,<br />\nattitude in recent years toward stu- dulgence.<br />\na vigorous gentleman, despite his lines appeared in the \"Pennsylvan- dent marriages. \"At Vassar College,\" marriage affects the scholarship of would participate in extra-curricular open to \"all individuals and organiexcept in activities. The census cards also zations who believe that war and<br />\nThe eminent ian\":<br />\nseventy-four years.<br />\nsays Dr. MacCracken \"the basic prin- students at Dartmouth,<br />\n\"Pennsylvania's humiliating defeat<br />\nserious show that 399 students out of the fascism are menaces to civilization,<br />\nmore<br />\na<br />\nwhere<br />\nleader in belles-lettres said that \"he<br />\ncases,<br />\nciple in dealing with its students is some<br />\nthey are not inevitable, and that<br />\nclearly<br />\ndemonYale<br />\nof<br />\nimprovehands<br />\nat<br />\nthe<br />\ncause<br />\nwas in a daze\" over the change that<br />\ntotal of 634 have signified their in- that<br />\nto confer on them the prvileges of purpose is apparent to<br />\ncan be forestalled.\"<br />\nthey<br />\nhad come over the Hopkins since his strates that our team is one of the<br />\nmaturity. With a slight reservation ment.\"<br />\nterest in football.<br />\nEvery Friday the Hopkins chapter<br />\nday.<br />\ngreatest 30-minute clubs tha ever in the<br />\nperDartmouth<br />\nAmherst,<br />\nyear<br />\nUnlike<br />\nfirst half of the freshman<br />\nholds meetings at 2:00 p. m. in Levwore the red and blue. For the first<br />\nfor purposes of adjustment, it is as- mits its married students to live in<br />\n\"Smallness Startled Me\"<br />\nfor<br />\n'champs',<br />\nering Hall, Room D. Students and<br />\nlike<br />\nhalf they looked<br />\nwives.<br />\ns<br />\nTen<br />\ntheir<br />\nAppear<br />\nCandidate<br />\nwith<br />\nHanover<br />\nsumed that students at Vassar Col- town of<br />\n\"When, back in '83 I first saw the<br />\nfaculty members are invited to atthe second half they looked like lege desire to be<br />\ntreated as mature Brown university takes much the<br />\nHopkins, the smallness of its quarFor First Band Rehearsal tend.<br />\nlooked like `chumps'.\"<br />\nUniversity,\"<br />\n\"The<br />\npersons, self-governed with respect same attitude.<br />\nters startled me. But I soon found<br />\nEvidently the Penn students don't<br />\nto academic work. In social contact, Dean Samuel T. Arnold tells me,<br />\nthat the success of this pioneer gradTen new members turned out for<br />\ncheer when \"the eleven's in the rain\";<br />\ntherefore, the college makes no terms \"does have some undergraduate men the first<br />\nuate school lay in its men, not int<br />\nrehearsal of the Band last<br />\nthey sneer.<br />\nits buildings. Sidney Lanier, my<br />\nof behavior in any way different from in the student body who are married.<br />\n* * *<br />\nMonday afternoon at the Barn. The<br />\na<br />\nthat<br />\nthe uses of society. Thus the question Our rule of the faeulty states<br />\nYouthful idol, had been dead but two<br />\nThis week: ROBERT LEVI<br />\nThis contribution comes from Le- of marriage in the student body is student may not be married without first part of the rehearsal was unYears; but I found encouragement<br />\nder the direction of Mr. Conrad GebThe old adage that \"an athlete<br />\nentirely incidental. Whenever the receiving the approval of the dean's elein,<br />\nand companionship in Professor Gi1. high's \"Brown and White:<br />\ndirector. Ace Wegard, this can't have brains\" apparently doesn't<br />\nthe<br />\ncamabout<br />\njourneys<br />\n\"Fruitless<br />\nplans of the family are in favor of it, office, in advance.\"<br />\ndersleeve who confided to me that<br />\nyear's Drum Major, took charge of apply to Bob. He came to Hopkins<br />\nhe was a disappointed poet, AssO-d pus are a present defect in the regis- and whenever the student feels that<br />\nHarvard, of course, has no restric- the second half of the rehearsal.<br />\nas a holder of a trustee's grant and<br />\nbe<br />\nelimshould<br />\ntration<br />\nThey<br />\nsystem.<br />\nmarriage would be of advantage to tions against undergraduate marriciation for six years with such men<br />\nThe next rehearsal of the Band has had this grant renewed twice.<br />\ninated.\"<br />\nyears<br />\nmata<br />\nas<br />\nit<br />\nmany<br />\nher, the college regards<br />\nas Gildersleeve, Haupt, and Dri G114<br />\nage. Their attitude for<br />\nwill be held next Monday, at 4:10<br />\nHe has been one of the main cogs<br />\nWhere have we heard that before? to decide.\"<br />\nMan, who was at all time charmone of enlightened laissez- p. m., at the Barn.<br />\nbeen<br />\nhas<br />\n*<br />\n*<br />\n*<br />\nHopkins' lacrosse machine for the<br />\nin<br />\nside<br />\nbeen<br />\ning, debonnair and amiable, has<br />\nThis, then, is the policy at Vassar. rival Yale on quite the opposite<br />\ntwo years. . . . a member of the<br />\npast<br />\nWilliam Randolph Hearst seems to For its practical application, let us<br />\na source of great inspiration to me.\"<br />\nof the fence. The rule at Yale is that<br />\nHullabaloo for three years . . . busPamphlet<br />\ncampus<br />\npublications<br />\ninto<br />\nSpanish<br />\nPublished<br />\nbreaking<br />\nbe<br />\nturn to Eleanor C. Dodge, Warden of \"any undergraduate who marries reAsked by the reporter where he<br />\niness manager for two years . . . a<br />\noften lately. Somehow, the edi- Vassar College. Last year Miss Dodge<br />\nWould have sought his Ph. D. if there quite<br />\nautomatically from the<br />\nhimself<br />\nmoves<br />\nBarnstormer for the past two years<br />\nlatest<br />\nof<br />\nThe<br />\nthe<br />\npublication<br />\nto<br />\nhave<br />\nsame<br />\nseem<br />\nthe<br />\nall<br />\nhad ;been no Johns Hopkins at the torials<br />\nfound it advisable to publish in the<br />\nReinstatement is in the dis- Johns Hopkins University Press is . .. member of the Varsity Club since<br />\nLafayette\"<br />\n\"The<br />\ncollege.<br />\nexample,<br />\nFor<br />\nring.<br />\ntime Dr. Burton answered that the<br />\nVassar Miscellany News, the followprovided that he the Catalog° Bibliografico y Critic° his first year . . . Student Council<br />\nus this line:<br />\ning statement of the college's official cretion of the dean,<br />\nonly possible place would have been gives<br />\npeoof de las Comedies Anunciadas en Los representative and member of the<br />\nfor<br />\nwrite<br />\nto<br />\nclaiming<br />\n\"Hearst,<br />\na foreign university. Then a man<br />\nattitude toward student marriages:<br />\nhas been served with declaration<br />\nthe past<br />\nof<br />\nthe<br />\none<br />\nis no doubt<br />\nthe Periodicos de Madrid Desde 1661 News-Letter staff during<br />\ncould secure a higher education at ple who think,<br />\n\"Will Vassar allow a girl who mar- intention at least a month before<br />\nis now circulation manaBob<br />\nyear.<br />\nproductive<br />\nHasta<br />\nto<br />\n1819„<br />\na<br />\nThe<br />\nbook,<br />\npaper-bound<br />\nobstacles<br />\ngreatest<br />\nno other institution in the United<br />\nries to stay in college, May she stay event, together with a statement of<br />\nvolume, was written by Ada M. Coe, ger of the News-Letter and vicethinking in this country.\"<br />\nStates.<br />\non in her dormitory? May a girl approval from parents or guardians.\"<br />\ndon't<br />\nAssistant Professor of Spanish at president of the honorary journalistic<br />\napparently<br />\nCollege<br />\neditors<br />\nIn 1888, Dr. Burton at the Johns<br />\nwhose secret marriage is discovered<br />\nfraternity, Pi Delta Epsilon.<br />\nor do they?<br />\n•••••••••••••••••••••••••1<br />\nWellesley<br />\nHearst<br />\nappreciate<br />\nCollege.<br />\n•<br />\n••<br />\n•<br />\n••<br />\n•<br />\n••<br />\n•••••••••••••<br />\n••••••••«•••••••••••••••<br />\nremain in college? The answer to all<br />\nHopkins received his doctor of philos* * *<br />\nophy in English. The following year<br />\nthe above questions is 'Yes.' This<br />\nAn intimate confession comes from<br />\nhe taught Anglo-Saxon here and lecstatement of policy is not an appeal<br />\nthe souls of the staff of the \"Concor- to the<br />\nST. PAUL at 33RD STREET<br />\ntured in English again in 1897. In<br />\ncolege to get married! It is<br />\nPrescriptions-School Supplies<br />\nUnion<br />\nin<br />\nof<br />\nCollege<br />\nSchenecdiennes\"<br />\nthe meantime,, Dr. Burton began his<br />\naddressed particuarly to those stuCandy-Cigars<br />\nlong and active career in the literary tady, New York:<br />\ndents who are engaged and want to<br />\nUnexcelled Fountain Service<br />\n\"We personally like to whistle. marry, but at the same time to finish<br />\nWorld. For a long time he edited the<br />\n•-111 •-• •«••••••••<br />\n•••• Fe.• lb 55OOOOO<br />\nHartford Courant and other maga- Sometimes we whistle off key, but their college courses. We do not in<br />\nzines. During the past twenty years there are some tunes we would rath- general believe in long engagements,<br />\nhe has been a member of the Pulit- er whistle than listen to over the ra- because of the emotional strain inJ. H. FURST CO.<br />\nzer Prize Committee. His biogra- dio\"<br />\nvolved; and we reconize that those<br />\nPrinters of<br />\nlong engaged and of college age are<br />\nphies, \"Bernard Shaw—the Man and<br />\nPHILOLOGICAL and<br />\nthe Mask,\" and \"Charles Dickens—<br />\nfrquently not in a position to assume<br />\nSCIENTIFIC PUBLICATIONS<br />\nHow to Know Him,\" have won him 25 At Chess Club Meeting the full costs of married life. Nor do<br />\nBaltimore<br />\n12-20 Hopkins Place<br />\nwe 'believe in secret marriaes; if they<br />\nattention. He was head of the English Department at the University of<br />\nTwenty-five candidates were pres00<br />\no.4<br />\n.<br />\n.<br />\n0<br />\n.<br />\n06<br />\n.<br />\n.<br />\n40.404.40.•»41.4.,«40.41.40.4,.4.40.41.4\".•«0»,<br />\nMinnesota from 1902 to 1935, and isl ent at a meeting of the Chess Club,<br />\nnow professor of English Literature held Wednesday at the S. A. C. Room #<br />\nBARBER SHOP<br />\nPEABODY<br />\nat Relion College. Following the ad- in the basement of Levering Hall.<br />\nTheodore's<br />\ndress the English Department of the Due to the large turnout some diffiPHARMACY<br />\nand 33RD STREETS<br />\nPAUL<br />\nST.<br />\nJohns Hopkins tendered Dr. Burton a culty will be had in arranging a<br />\n211 - 213 E. Baltimore St.<br />\nCALVERT and 30TH STREETS<br />\nTo Birely's<br />\nNext<br />\ndinner at the Greenway. Dr. French schedule for games that will be suitWe Sell Drugs and Give Service<br />\nmade the arrangements.<br />\nable to all.<br />\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••<br /><br />\nHas Full Attendance<br /><br />\nMovies An Asset<br /><br />\nPlan Anti-War Meet<br />\nFor November 2,3<br /><br />\nIn Other<br />\nColleges<br /><br />\nCampus Captains'<br /><br />\nBirely's Pharmacy<br /><br />\nr<br /><br />\nMoving Soon to<br />\n7 &amp;9E. Baltimore St.<br />\nat Charles<br />\nKATZ CLOTHES<br /><br />\n4<br /><br />\nHOME WOOD, BALTIMORE, MD., OCTOBER 18,<br />\n1935<br /><br />\nRunnersVieFor<br />\nTryout Places<br /><br />\nJay Walks<br /><br />\n_1<br /><br />\nPAST AND PRESENT:CROSS COUNTRY<br /><br />\nCALL FOR FENCERS<br /><br />\n_ By KENNETH ZIERLER<br /><br />\nJay Team OpenL<br />\nGrid Season On<br />\nShore SaturdayC<br /><br />\nIt has been fifteen years since Jimmy runners start at<br />\nHomewood, run down<br />\nThere will be an organization meetLe Cato issued the call for the first the road, then behind<br />\nGilman in front ing of the Johns Hopkins Fencing<br />\nThe Jays lift the lid off their foot- cross country practice at Hopkins.<br />\nof Levering, circle the soecer field and Team on Saturday<br />\n, Oct. 19, in the<br />\nball season with a jaunt to the Sho' During these years, cross country<br />\nhas then through Wyman Park back to Barn. All<br />\ninterested are urged to atCross-Country Workout To where they will swap blocks and developed into one of the most popu- the football field, and<br />\nonce around the tend this first reunion as plans for<br />\nwith Washington College, un- lar of the fall sports.<br />\ntrack. The contestants must circle for the future will<br />\nBe Held Tomorrow; Start- tackles<br />\nbe discussed.<br />\ndefeated since 1933 and bigger and<br />\nVerne Booth, of the 1922, 1923 and the course twice during<br />\nthe race,<br />\ning Line-Up Is Sought better than ever this year.<br />\n1924 teams, was the first Jay harrier which is about a<br />\ntotal of four and a<br />\nAn unknown quantity—as the Mon- to gain national prominen<br />\nStrong Washington College-ce. In 1923, half miles.<br />\nday morning quarterbacks would say he won the National Intercoll<br />\negiate<br />\nAs in other sports, Maryland has<br />\nTeam To Furnish Gruel—the Blue team is naturally the und- Cross Country Champion<br />\nships at been one of Hopkins'<br />\nchief rivals and<br />\nerdog since the Maroons have thus far Van Cortland<br />\nlin Test To Varsity Teatn\"<br />\nPark. The Middle Atdivided equally their meets from<br />\nNew Material Expected To this campaign scrimmaged through lantic States Cross Country Champ- they<br />\n1926-1931<br />\n, but Maryland may renew<br />\nAmerican Universit and out-touch- ionship was annexed<br />\n(Continued from Page 1, Col. 1) BC<br />\nby him in 1923 their meetings<br />\nThe second week of interfraternity<br />\nFill Vacancies; Gray Is downed Swarthmore.y While<br />\nthis year.<br />\nthe husky and 1924. He was also the national inJays Have Spirit<br />\nfootball got under way with many<br />\nMaryland Series Close<br />\nShoremen have been playing games door and outdoor<br />\nUnable To Compete<br />\nDespite this imposing array of<br />\ntwo mile champion.<br />\nstirring and exciting games. Most of<br />\nand getting valuable experience, the Competin<br />\nSt. John's wag met from 1930-1933 the<br />\ng in the 1924 Olympics,<br />\ngames were closely fought the veteran opposition, George Darley's<br />\nThe first step towards deciding up- home eleven has been idle as far as Booth finished in the first ten in the and the Jays won three of the races. victor in<br />\ndoubt until the final whistle. blue-tacked warriors are intent upon<br />\non the personnel of the varsity the record goes.<br />\nteam race. As a Whole, the team was An odd feature of these races was<br />\nKappa Alpha opened its •season writing the closing chapter of the<br />\nAs far as activity goes, they weak<br />\ncross-country team will be taken toand victories were few and far that all were decided by one point. with a hard-fought 12 to 0 victory Washington winning streak. The disFain<br />\nThe Jays have been a competitor in over Phi<br />\nmorrow when Coach Hambleton haven't been loafing. Coach George between.<br />\nEpsilon Pi. Thomas and play of enthusiasm, pep, and fight<br />\nsends his charges through a stiff Darley has already given them more<br />\nSouth Atlantic Cross Country Champ- Counselman<br />\nmanifeste<br />\nGwinn Outstanding<br />\nd<br />\nby the squad during pracA<br />\naccounted for the two<br />\ntryout run. The results of this com- scrimmaging than was done all seas-tice drills, intimates that if spirit and<br />\nThe team had increased success in ionships held at Clifton Park since touchdowns.<br />\npetition will, to a great extent, de- on by every Hopkins team for the the next few years, with Dick Gwinn, 1927, and have always finished secIn another match which featured intestinal fortitude are deciding facttermine the lineup for the first meet past three years put together. The later an Olympic alternate, the back- ond to the Stonewall Democratic Club some close defensive<br />\nplay on the part ors in ball games, the Blue Jays will<br />\ngridmen are thus in shape and not<br />\nwhich will be held one week later.<br />\nbone of the team. In 1926 he won the of Baltimore, who are led by Bill of both teams, 0. K. 0. fraternity stem the maroon tide. The gridders,<br />\nuninitiated to the sound of bones<br />\nHard Schedule Ahead<br />\nMiddle Atlantic States Cross Country Agee, former Olympic marathon and Bette Theta Pi ended up in a 6 after six weeks of practice, have derunner, and Pat Denges, national to 6 tie. Jenkins scored<br />\nThe team faces a rather difficult crushing underfoot and other charac- Championship.<br />\nthe touch- veloped a polished running and aerial<br />\nschedule but with the new material teristic cacophony of football.<br />\nBec;<br />\nIn 1927 the harriers composed of marathon champion.<br />\ndown for 0. K. 0. while Stevenson attack and a sturdy defense.<br />\nEspecially does Hopkins have spirit.<br />\nacquired this year, the Jays have an<br />\nBill Bishop, one of the brightest<br />\nScheible, Gwinn and Kelly, had<br />\nIn 1934, the Black and Blue an- kept Beta in the running with a<br />\nexcellent chance for an undefeated It takes a lot of enthusiasm to hit marked success, scoring victories nexed the college section champion- touchdown to his nredit.<br />\nbackfield psospects, is lost to the team<br />\nfor the whole season. Bishop, sterling<br />\ncampaign. The season does not end the blocking dummy and the tackling over Maryland and Navy.<br />\nship of the District of Columbia's<br />\nAnother Close Game<br />\nwith the termination of the dual dummy and scrimmage every day<br />\nWaldo Hambleton was appointed Cross Country Tournament, and will<br />\nThe game between Delta Upsilon blocking back, who promised to be<br />\nDr,<br />\nmeets as the Black and Blue will while other colleges are playing two, coach in 1928 and since that time defend the championship this fall.<br />\nand Tau Alpha Omega resulted in a a tower of strength in the backfield,<br />\nenter a squad in the South Atlantics three, or even four games. With this the team has won three-fourths of<br />\nDual meets are won by the team 6 to 6 tie. This was one of the most broke his jaw in a scrimmage prac- ecom<br />\ntice. This is the first casualty of the<br />\nand in the National Capital champ- enthusiasm the Jays have ability. The thefr dual meets, although the squads having he lowest score. Five men thrilling struggles of the week. T.<br />\nA.<br />\nline will concede nothing to Washingionships. In 1934 Hopkins succeeded<br />\nhave been small.<br />\nfrom each school compete and each 0. gained a 6 to 0 lead early in the season.<br />\nchief<br />\nton College. It is only the dinosaur<br />\nCharlie Kelly, a splendid passer<br />\nin capturing the team championship<br />\nThe teams of the last few years man gets the same amount of points contest by virtue of a touchdown by<br />\nbacks that give the edge to the Shore\\yin<br />\ndirect the Jays from his quarterin the latter event, while they were<br />\nhave been built around Sam Furst, as the position in which he finishes. Don Shapiro and managed to mainmen.<br />\nthird in the S. A. meet, only a few<br />\nJack King and Paul Hiltzman. All Thus, if a man finishes first, he re- tain this margin up until the last back post. Kahl and Graziano will<br />\nSpeaking of backs calls to mind the<br />\nc°<br />\ntesll<br />\npoints behind the winner.<br />\nthese broke country records during ceived one point. A perfect score is few minutes of play. Then, with but start the game in the half-back eall<br />\nfate of two of Hopkins backs. CapGray Lost To Team<br />\none minute remaining to be played, berths. Both are fast and able kicktheir stay at Hopkins.<br />\nfifteen,<br />\nthis<br />\nattained<br />\nand<br />\ncan<br />\nbe<br />\nif<br />\ntain Reuben Pasarew, a ferocious<br />\nThe Blue Jays recently lost a valuThe course, at present, is much five of the runners of one school de- Johnny Murphy caught a long pass ers. Graziano will no doubt do blockblocker, a deadly tackler, a ballable man when Eddie Gray, former<br />\nand turned it into a touchdown. At ing duty, while Kahl will take care<br />\neasier than in previous years. The feat all from the other school.<br />\ncarrier, and a punter (out of adjecof a good portion of the ball carrySt. John's runner, announced that he<br />\nthat point, the game ended.<br />\ntives), is not officially back in the<br />\nwould be unable to compete this fall.<br />\nAlpha Tau Omega defeated Phi ing. Bob Ward at full back is the e88°°ta<br />\nx<br />\neo<br />\ntfunini<br />\nrh<br />\ntIl:<br />\ne<br />\nrrnYtili11:'<br />\n:<br />\nUniversity, although he is attending<br />\nGray, who performed on the track<br />\nAlpha in another close game by a fourth member of the backfield. He Matc<br />\nboth classes and practice. The rumor<br />\nsquad last spring, is prevented from<br />\nscore of 6 to 0. Fankford scored the is an agile, shifty runner, a fair passis that the Board for the Admission<br />\ner and kicker, and will be a hard man<br />\nlone touchdown.<br />\nparticipating because of his studies,<br />\nof Football Players is waiting for<br />\nwhich take up all of his available<br />\nPhi Sigma Delta, one of the favor- to hold.<br />\nRube to consider several offers from<br />\nThe reserve backfield is also a fortime.<br />\nFour Frosh, Sophomore Teams To ites this year, opened their campaign<br />\nthe Big Ten.<br />\nwith a 12 to 0 victory over Alpha midable quartet. Bernie Vincent is<br />\nIn addition to the varsity, HambleBe Organized After Week Of<br />\nAspiran<br />\nts<br />\nPositio<br />\nFor<br />\nns<br />\nAre<br />\nMore seriously, we speak of Bill<br />\nDelta Phi. After attempting numer- one of the best blocking and defenston is working hard with the second<br />\nInformal Practice<br />\nBishop who suffered a broken jaw in<br />\nNumerous; Large Schedous passes over the goal line which ive backs on the squad. Kaufman, a Pfd°a<br />\nstring men in order to whip in shape<br />\ntr(ueftuicesi1tn<br />\n--1<br />\nc,<br />\nirth<br />\n:<br />\nSaturday's scrimmage. Last year Bill<br />\nwere<br />\na capable junior varsity aggregation.<br />\nall incompleted, Ken Zierler potential punter and runner; Bradule Planned For Season The Fall Lacrosse Leagues started<br />\ndid himself credit on the line as a<br />\nscored the first touchdown on a run ford and Traggis are the other sec- h<br />\nThe latter has, in the past, been<br />\nda<br />\nids:<br />\nguard, a tackle, and an end—with<br />\nthe season's play Tuesday, Oct. 15, on<br />\naround the end. The second score was ond string backs.<br />\nsingularly unsuccessful in its enAlthough the wrestling team will<br />\na little fullbacking now and then. But<br />\nthe lower field. This first week of ac- made on a pass to Hal Goldstein<br />\nThe Hopkins forward wall expected<br />\ncounters with local high schools and<br />\n.<br />\nthis year he was never out of the not begin intensive practise until the tivity<br />\nIn another game, Phi Lambda Phi to prove an inseperable barrier to<br />\nwill<br />\nconsist<br />\nintends to seek revenge this year.<br />\nin<br />\ninformal<br />\npracbackfield, where his hard work and latter part of November, informal<br />\ntice. However, next week, four Fresh- retained its leadership in the B league the maroon onslaught. Halbert will las n.\"11.1!11<br />\ndogged pursuit of all the backfield practice will be held every Thursday<br />\nstart off at center with Mehling his<br />\nmen and Sophomore teams will be by defeating Phi Gamma Delta.<br />\nlore he could get soon made up for afternoon in the gym. These pracunderstudy, Swindell and Schmidt<br />\norganized<br />\n.<br />\nThe<br />\nFrosh<br />\nLeague<br />\nwill<br />\nuse<br />\nhis lack of experience in this new tises will be held under the superwill be at the wing posts with Baum \"Ei<br />\nvision of Captain Julian Gelber and the field on Tuesday, while the Sophs<br />\nHandballers Urged Out and<br />\nposition.<br />\nLeberfeld as reserve ends. Davis, frn<br />\noa<br />\nwill<br />\nr rl<br />\npractice<br />\non<br />\nThursday<br />\ns. On the<br />\nAll handball enthusiasts, whether Royster, Phillips,<br />\nA fast-charging, unrelenting block- Coach Gus van Sant.<br />\nand Day will no<br />\nremaining days of the week, the field<br />\ninterested in the game for league doubt all see<br />\nA great deal of enthusiasm has<br />\ner, he is an<br />\nblocking back. Add<br />\naction at the guard powill be open to all corners.<br />\nElec-Mechs Win Close Game; to this his ideal<br />\ncompetition or for their personal en- sitions, while<br />\nfast-developing bucking been formed and a turnout of fifty<br />\nMcGuire and Ellis will<br />\nAfter<br />\nweeks of games, the joyment, are requested to get in<br />\nline up in the tackle berths. Reserve<br />\nN. J. All-Stars Continue and passing ability and you have a men is expected. A large numer of championtwo<br />\nw<br />\nborn<br />\n;r11<br />\nFrosh and Soph teams will touch with Dick Pasternak, Post<br />\nreal menace to the opposition. He candidates are expected for the<br />\ntackles are Pinski and Hopkins, both<br />\nWinners In Soph League was so much a vital factor<br />\nheavyweight division, in particular, be matched with Junior and Senior Office Box 781 for further informa- of whom will probably<br />\nthat Bill<br />\nget into the<br />\nteams in a Round Robin Tournament. tion.<br />\ngame.<br />\nThe interclass football teams began Bishop's broken jaw is a broken jaw and the gaps which have been formed<br />\nthere because of graduation are extheir second season of competition for the team.<br />\nrn<br />\no<br />\nnlr sci<br />\npected to be filled satisfactorily.<br />\nlast week with several close and indel<br />\ntordE<br />\nSOME QUICK PICKS OF STATE<br />\nNew equipment has been secured<br />\nteresting battles.<br />\nRESULTS:<br />\nthus insuring all wrestling aspirants<br />\ntyheias<br />\nThe Electrical-Mechanics opened'<br />\nYale<br />\nto<br />\ntake<br />\nthe<br />\nwind<br />\nout<br />\nof<br />\nNavy's enough facilities for practise.<br />\ntheir campaign with a hard-fought<br />\nsails.<br />\ne<br />\nvgen<br />\nvdci:i(<br />\nA freshman manager is needed and<br />\n24 to 18 victory over the Gas-Civils.<br />\nl:<br />\nevr<br />\nMaryland<br />\nto recuperate against V. all candidates for this position are<br />\nThis high-scoring game was featured<br />\nM. I.<br />\nurged to see Coach Gus van Sant as<br />\nby the fine passing attacks shown by<br />\nboth teams. Skinner, Knecht, and Western Maryland to squeeze through soon as possible.<br />\nCI]H<br />\npi<br />\nBarker scored touchdowns for the<br />\nBuck nell.<br />\nManager Bill McFeely has secured<br />\nlosers, while Bayliss was the out- Mt. St. Mary's to<br />\na complete wrestling program for the<br />\nget Gettysburg.<br />\nstanding star of the Electrical-Meteam.<br />\nThe schedule follows:<br />\nStart the school year with<br />\nVirginia to make it four losses for<br />\nchanics, scoring three of their four<br />\n11))<br />\nJan. 10—Hopkins vs. Swarthmore at<br />\nSt John's.<br />\nSheaffer's which are supreme<br />\ntouchdowns. The other score was<br />\nHomewood<br />\nWest Chester Teachers to give Balmade by Mewshaw.<br />\n.501<br />\nin quality and performance<br />\nJan 18—Hopkins vs. Rutgers away<br />\ntimore a lesson.<br />\ndOa(<br />\n'ItYr<br />\nThe New Jersey All-Stars, freshand cost no more but last<br />\nin<br />\nman champions of last year, contin- Washington College to start Hopkins *Feb. 8—Hopkins vs. U. of M. at<br />\nlonger.AllSheaffer'sfill,empty,<br />\nHomewood<br />\noff on the wrong foot.<br />\nstr<br />\nued where they left off by gaining<br />\n12—Hopk<br />\nins<br />\nvs.<br />\nLafayette<br />\nFeb.<br />\naway<br />\nan easy 30 to 0 victory over the<br />\nclean with one stroke and<br />\nBusiness Men. The victors exhibited<br />\nFeb. 15—Hopkins vs. Ursinus at<br />\nau<br />\ntake in over 400% more Skrip<br />\na fine passing attack and a brand<br />\nhi;<br />\nHomewood<br />\nper stroke than multiple-stroke<br />\nof all-around ability which makes<br />\ntri<br />\nAdd 1, Wrestling<br />\nthem a favorite to once more win the<br />\nPc<br />\npens. Visibility is kept permaFeb. 22—Hopkins vs. Temple away<br />\nlaurels in their division.<br />\ntic<br />\nFeb. 29—Hopkins<br />\nHaverford<br />\nvs.<br />\nnent by a patented vacuum<br />\n.The Engineers were also easy vicaway<br />\nThe Johns Hopkins Soccer team is<br />\ndisc. The two-tone Feathertors in their opening game, gaining<br />\nleaving at 11.30 today for the Eastern *Mar. 7—Hopkins vs. Gettysburg<br />\nA<br />\nan 18 to 0 victory over a pickup<br />\ntouch°po<br />\naway<br />\nintthatonly Sheaffer's<br />\nShore to play State Teachers' Colteam.<br />\nMar. 22—South Atlantics<br />\nlege at Salisbury.<br />\nhave makes two-way writing<br />\nIn the Junior division, the Civil* Tentative<br />\nCoach Dotterweich foresees a close<br />\nperfect. All these wonderful<br />\nGas team won a hard-fought 6 to 0<br />\ngame as well as a possibly favorable<br />\nvictory over the Electrical-Mechanics.<br />\nfeatures combined with the<br />\nclimax. In his own inimitable way,<br />\nGuarantee make<br />\nLifetime°<br />\nCoach Dotterweich said, \"We gotta<br />\nteam, and dey gotta team. Mix dem<br />\nID<br />\nSheaffer's the world's most<br />\nThe<br />\nup, and we're on top.\"<br />\nwhite<br />\neconomical pens. See all<br />\ndot<br />\nAfter the game, the team will be<br />\nFall track practice has been going<br />\nident:fies<br />\ngradeso<br />\nfSheaffer'5f10m$2.25<br />\nentertained at dinner by the school on every day except Monday, for the<br />\nthe<br />\nPermission for the use of the City<br />\nwhich consists of 95% females and last week, under the capable direction<br />\nLifetime°<br />\nup at your dealer's. SHEAFFER<br />\nCollege swimming pool has just been<br />\n5% males.<br />\nof Edgar Vine11.<br />\npen<br />\n$8.50<br />\ngranted to the Hopkins swimming<br />\nDEALERS:WRITE IMMEDIATELY FOR<br />\nto $15<br />\nSpecial<br />\nattention<br />\nbeing<br />\nis<br />\nLineup<br />\ngiven<br />\nto<br />\nteam.<br />\nINFORMATION ON THE WONthose men who are out for the hurdCoach Hambleton feels the grant Hartman<br />\nGoal<br />\nSICRIP-WELL<br />\nles,<br />\njump,<br />\nand<br />\nDERFUL<br />\nweight<br />\nDRY-PROOF DESK SET.<br />\nthrowing<br />\n. Those<br />\nto be a help in that improvement of Price, Burnheim<br />\nFullbacks<br />\nevents<br />\npromise<br />\nto<br />\nneed<br />\nbolsterin<br />\nin<br />\ng<br />\nGough<br />\nSHEAFF<br />\nER PEN CO.<br />\nthe team is expected in place of its<br />\nCenter Halfback<br />\nW. A.<br />\nBaker<br />\njust keeping in form.<br />\nRight Halfback the spring and the fall is the best<br />\nMADIS<br />\nON, IOWA<br />\nFORT<br />\nPractice will be held every day Phillips<br />\nLeft Halfback time to prepare for spring by way<br />\nUses<br />\nand the schedule plus the opening Dertzbough<br />\nOutside Left of learning and inmproving form.<br />\nthe<br />\nThere<br />\nare<br />\nstill<br />\nplenty<br />\nberths<br />\nof<br />\nto<br />\nbe<br />\nLast<br />\npractice day will be announced some- Hahn<br />\nCenter Forward<br />\nDrop<br />\nCooper<br />\ntime after the football schedule.<br />\nCenter Forward filled by capable men and candidates<br />\nare desired.<br />\nLitwin<br />\nOutside Right<br />\nInside Right<br />\nBadminton Courts Open Mace<br />\nReserves<br />\nSHEAFFER PENS,<br />\nTumbling Gets Under Way<br />\nArrangements for the use of BadSilver, Kemp, Hubbard<br />\n$225 to $10<br />\nminton material can be settled any<br />\nWednesday, the team scrimmaged<br />\nInformation concerning future plans<br />\nafternoon with Mr. Reuben Baer. New with Kenwood High School and have for tumbling can be secured<br />\nSHEAFFER<br />\nby conbadminton equipment has recently also spent about a week<br />\nPen-SKRIP, Successor to<br />\nPARA.LASTIK, the new gum<br />\nSKRIP•GRIP<br />\nand a half tacting Mr. Reuben Baer, P.O. Box<br />\nPENCILS, $1 to $5<br />\nInk, 2 or., 15c. Permaadhesive; doesn't curl thinLiquid Paste<br />\nbeen acquired by the athletic depart- in practice. The next game<br />\nnent SKRIP makes better<br />\nwill be 236.<br />\nnest sheets; with handy<br />\nor Mucilage,<br />\nbusiness records<br />\nspreader brush, 25c<br />\nReg. U. S. l'at. Off.<br />\nment, and this equipment is open to at Homewood on October 24,<br />\n10c up<br />\nwhen the<br />\nAn appointment with Mr. Baer is<br />\nthe use of all those interested in the team will meet Maryland State Norrequired of those especially interested<br />\nsport.<br />\nmal School.<br />\nin corrective work.<br />\nSUCCESSOR-<br /><br />\nFrat Football<br />\nGames Continue<br /><br />\nOutlook Optimistic<br /><br />\nhit<br /><br />\nNc<br /><br />\nEx<br /><br />\nW estlers Begin Fall Lacrosse Under<br />\nInformal Drills Way On Lower Field<br /><br />\nInterclass Teams<br />\nStart New Season<br /><br />\nA REVOLUTION IN WRITING AND<br />\nFILLING '1 SHEAFFE<br /><br />\nSoccer Men Open<br />\n'35 Season Today<br /><br />\nNatators Gain Use Of<br />\nCity College Pool<br /><br />\nFall Track Practice<br />\nProgressing Well<br /><br />\n15c<br /><br />\nFREE PENCIL-SKRIP,<br /><br />\nTO-LEADS.<br /><br />\nSEE YOUR DEALER<br /><br />"}], "field_media_file": [{"target_id": 38968, "display": null, "description": null, "target_type": "file", "target_uuid": "aceb62a2-8ee1-44e8-9d10-c6dd9615149d", "url": "http://digital.library.jhu.edu/system/files/2022-03/12645-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12645, "target_type": "node", "target_uuid": "bc0983fb-b5c6-481b-a02d-be17f28daea3", "url": "/node/12645"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "31350cda-30e3-494f-8675-95167649d98b"}]}