{"mid": [{"value": 39284}], "uuid": [{"value": "40876514-2c66-4409-a87d-cb52e5e2ca6c"}], "vid": [{"value": 39284}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T19:26:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13902-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T19:26:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T19:26:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "1141<br />\nVOL. LXX, NO. 25<br />\n<br />\nNam ;Irma ***<br />\n<br />\n70TH YEAR<br />\n<br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND, APRIL 29, 1966<br />\n<br />\nShriver Sets<br />\nJazz, Ballet<br />\nTwo cultural events, running the gamut of musical<br />\nOxperience from jazz to ballet, will take place this<br />\nWeekend in the person of Dave Brubeck and the Balt/it/lore City Ballet Company.<br />\nThe Dave Brubeck Quartet will play their gig tonight at 8:30 in Shriver under the sponsorship of the<br />\n1/ICA and the Junior Class. Brubeck, to many the<br />\nMainstay of progressive jazz, has garnered international acclaim in recognition for his contribution to<br />\nlaze.<br />\nThe Baltimore City Ballet will present their program<br />\nat classical and modern dance Sunday night at 8:30'<br />\nP.M. also at Shrivel.. The five-year old company congists of 25 dancers and is Baltimore's only dance organization.<br />\nThe Ballet group appearing Sunday will include<br />\nvisiting artists from the Metropolitan Opera and Manhattan Festival Ballet Companies. The production will<br />\nbe under the direction of Danny Diamond.<br />\nJazz buffs tonight will be treated to improvisation<br />\nend polyrhythms. Brubeck believes that improvisation<br />\nIs the heart of jazz. Brubeck thinks that jazz can be<br />\nWritten, and that ultimately the dividing line between<br />\nClassical music and jazz will disappear.<br />\nThe Brubeck Quartet is well known for its successes<br />\nIn the Time series of albums, \"Time Out,\" \"Time<br />\nPurther Out,\" and \"Count Down Time in Outer<br />\nSpace.\" It IS in these recordings in which the jazz<br />\nstsartet experiences polyrhythms.<br />\nAlong with Brubeck will appear Paul Desmond on<br />\nidto sax, Joe Morello as percussionist, and Gene<br />\nWright on bass. Brubeck pounds on the piano. Each<br />\nitl( the other members of the Brubeck Quartet are famous in their own right.<br />\nThe program to be presented to ballet lovers Sunday<br />\nWill include several Brahms waltzes, described by Diamond as \"romantic in style and feeling, and classicai<br />\nIn technique.\"<br />\nAlso presented will be Children's Corner by Claude<br />\nDebussey, seen as \"classical ballet with some modern.<br />\nOne is stylized and contrasted against a more modern<br />\none,\" explains Diamond. The Jazz Suite done to the<br />\nmusic of Robert Prince and a period piece by Mozart<br />\nWill round out the program.<br />\nDiamond describes romanticism as a form in ballet<br />\nma characterized by toe dancing and white filmy<br />\ndrosses. \"Poses and forms are important in this kind<br />\nOf dance.\" Naturalism is described by Diamond as<br />\n4'people doing as they really do. It is a rebirth of expression, but for a whole group rather than one<br />\ndancer.\"<br />\nModern dance is seen by the director of the Baltimore City Ballet Company as a \"reaction to the impulse of the music. The different eras of the dance is<br />\nsimply a philosophical difference. Modem dance is a<br />\nresult of meaning inside the dancer rather than Victorian representation of the romantic.\"<br />\nTickets for the ballet are available at the YMCA<br />\noffice and Fred Walker's Music Store for $1, $1.50,<br />\nand $2.<br />\n<br />\n\"B. Fenster\"<br />\nDated for May<br />\nTheatre Hopkins will close its season on May 12<br />\nWith William Snyder's The Days and Nights of Beebee<br />\nFenstermaker to be presented in the Barn.<br />\nThe play, which ran off-Broadway for one year<br />\nduring the 1962-63 season, received wide acclaim as<br />\none of the best contemporary American plays. Richard<br />\nGilman, writing in Commonweal. states that it is<br />\n\"informed by an acute sense of what it means to be<br />\nalive at this moment in this place; that is to say now.<br />\nIn America, where the meaning of existence is fuzzier<br />\nDOW than almost anywhere else.\"<br />\nThe role of Beebee will be portrayed by Jane Singer.<br />\na member of the new professional company at the<br />\nWashington Theatre Club. Miss Singer has appeared<br />\nthis year in John Dos Passos' U.S.A.. Anouilh's Romeo<br />\nand Jeanette and in the musical Ernest in Love.<br />\nAlso appearing will be Elsa Rowel, the wife of a<br />\nstudent at Hopkins and herself a graduate of the Yale<br />\nDrama School.<br />\nIrvin Turner will follow up his Theatre Hopkins<br />\nroles in The Killer and Do You Know the Milky Way,<br />\nas the Iruterviewer in the Snyder play.<br />\nThe play will be directed by Ed Golden, Jr., with<br />\nsets by James Edmund Brady. The production will run<br />\nMay 12-15 and May 19-22. Tickets cost $2 and are<br />\navailable at the Public Relations Office in Shrivel',<br />\n<br />\ndThyd<br />\nz%Vgingir liovxntO<br />\n<br />\nBig Weekend<br />\nRun Down<br />\nBy GERALD BRECHER<br />\n<br />\nTonight the Big Weekend begins. That's right Hop.<br />\npies, THE BIG WEEKEND!! Four this afternoon, at<br />\nLevering, the prelims are scheduled. Up and coming<br />\nyoung musicologist Dave Brubeck leads what promises<br />\nto be a most exciting discussion of that peculiarly<br />\nAmerican folk music idiom known as Jazz. This extravaganza, sponsored by the junior class, will be<br />\nfollowed later this evening with the Y.M.C.A. sponsoring Brubeck in concert; putting his fingers where<br />\n• his mouth was.<br />\nEveryone will probably be at the Homewood Field<br />\nat 2:30 Saturday to watch the Varsity Lacrosse team<br />\nbeat on the Black Knights of the Hudson—known to<br />\nthe uninitiates as Army. Though the grim visage of<br />\nprohibition still rears its ugly head in the stands, the<br />\nnatural excitement and interest generated by the fast<br />\nmoving sport will keep the fans at a fever's (if only<br />\na dry fever) pitch.<br />\nLater that evening though, the crowd can indulge<br />\nits yearnings for nectar and ambrosia at , the Big<br />\ndra.•<br />\nWeekend Dance, sponsored graciously for us by the<br />\nStudent Council. This, the social event of the year,<br />\nwill be held in the Gym from nine in the evening until<br />\none in the Morning. Tommy Vann and the Echoes, and<br />\nWilly and the Hand Jives will let loose the smoothly<br />\nIn celebration of the 1966 Spring Weekend the<br />\nstrum strains of their melodic music for the diversion<br />\nNews-Letter thoughtfully provides a camouflage<br />\nand excitement to vibration of the expected large<br />\nlabel to cut out and paste on bottles of Pikescrowd. Set-ups will be available. O.K. Hoppies? Sound<br />\nvine Rye. The glue will be included in next weeks<br />\nIssue.<br />\nfine to you guys? Real swinging, huh? It sure Is.<br />\nYes sir, here at Hopkins High they certainly have<br />\n=M1<br />\nWPM=<br />\noutdone themselves this time. This must be the most<br />\nexciting, new and different and wonderfully imaginative weekend in memory. We should really all vote one<br />\ngreat and large cheer (Bronx style) to those magnificent men in their flying machines, the Student Council; and also to the gifted hierarchy (whoever that<br />\nmay be this week) of the junior class for treating us<br />\nwith what is, surely the most pitifully inadequate,<br />\nsorry excuse for a weekend in the whole realm of dull<br />\nweekends.<br />\nBy JOE WEINBERG<br />\nNot that we don't appreciate the effort boys. We<br />\nknow how you all are just dying to bring back the<br />\n\"The Difference\" committee closed its fund raising<br />\ndrive today with the comiletion of the solicitation of<br />\nthe undergraduate body. As of last Tuesday, a total of<br />\n$6,000 had been raised. Further donations will be accepted by the Financial Aid Office in Maryland Hall.<br />\n<br />\n!<br />\n<br />\nL<br />\n<br />\nDifference<br />\nHits $6,000<br />\n<br />\nThe reported figure includes an anonymous $1,000<br />\ndonation received this week, a $1,000 contribution from<br />\nthe Biophysics Department, and approximately $1,500<br />\nin proceeds from The Boys from Syracuse. The figure<br />\ndoes not include pledges. Final figures will be published<br />\nIn next week's News-Letter.<br />\nThe committee, under the co-chairmanship of Barbara Ellis, a graduate student in Chemistry, Thomas<br />\nCarpenter, and Dr. Philip Hartman of Biology, expects the final total to be higher than the original<br />\ngoal of $8,000. Dr. Hartman sent a letter to his faculty<br />\nsolicitors indicating that the committee hoped to be<br />\nable to raise $12,000, and thus send three underprivileged students to Hopkins rather than two.<br />\nStudent Contributions Low<br />\nThis opthnism is due to the fact that the bulk of<br />\nthe contributions so far have come from relatively few<br />\nsources. Only five departments in the faculty have<br />\ncontributed on an organized basis, Biology, Romance<br />\nLanguages, Biophysics, Chemistry, and Philosophy.<br />\nThe Humanities and Social Sciences have not as yet<br />\nresponded to the solicitations. Students themselves<br />\nhave contributed very little, with only $1,000 coming<br />\nfrom students, and most of these contributors have<br />\nbeen graduate students.<br />\nThe lack of undergraduate participation is partly<br />\nattributed to the fact that the undergraduate solicitation was delayed until this week.<br />\nThe letters that were to be distributed to the offcampus students could not be given out. The Post<br />\nOffice has recently refused to allow the stuffing of the<br />\nmail boxes in Gilman Hall. All mail must have a name<br />\nand box number on it, and the committee did not have<br />\nthe manpower necessary to perform this task.<br />\nSandy Cohn, who recently took charge of undergraduate solicitation, is expected to take action in the<br />\nnear future to increase the student participation on<br />\nthe drive.<br />\n\"Syracuse\" Contributes<br />\nLast weekend's performance of The Boys from Syracuse aided the drive. In addition to donating the proceeds of the show to \"The Difference\" fund, the show<br />\nalso entertained .ft hundred inner-city high school<br />\nstudents Friday night.<br />\n<br />\nThe Dave Brubeck Quartet rests after recording<br />\ntheir most recent hit record; Take Five.<br />\nglory days from High School, and that a great deal of<br />\nG.0.-like effort has been spent recreating just the<br />\nproper atmosphere and spirit here at what some people<br />\nthought was a University. I guess we were wrong.<br />\nHonest Injun, guys, can't you do any better? Just<br />\nhow many yews is Dave Brubeok going to have to<br />\nplay the same saccharine music at Hopkins weekends<br />\nbefore anyone gets tired of it? It would be too much<br />\nto ask for someone who has something significant to<br />\nsay—like Ornettet Coleman, maybe? Or John Lewis?<br />\nOr Milt Jackson? Or Miles Davis? But no: this, I<br />\nimagine, would require a modicum of imagination,<br />\nvision even; and this, one can bet any ranch on, is<br />\none thing of which we can be sure the talented organizers of this weekend have not even the -slightest<br />\nconception. No, we must have Brubeck. It's like an<br />\nunwritten law, a gospel from the mount. Brubeck, they<br />\nsay, is cool. Ergo, here he comes to Hopkins. Home of<br />\ncool. (Suggestion Student Council: rent yourselves out<br />\nas air-conditioners for the summer.)<br />\nBut that dance. Grrr! If that isn't the most<br />\nludicrous collection of no-talent, no-name, no-nothing<br />\nperformers I have ever heard of—come to think of it,<br />\nhas anyone ever heard of these people? Or are they<br />\nanother of these Baltimore wonder bands from Hollywood Park? As usual, the dance can be expected to<br />\nbe the already worn out cliche Johnny horror show<br />\nwith more drunks (and unseemly drunks to boot) to<br />\nthe square inch than any place outside the Central<br />\nJail.<br />\nI don't know; is this really fun? Someone must<br />\nthink so. Does anyone think so?<br />\n<br />\n\fPAGE TWO<br />\n<br />\nNEWS -LETTER<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 29, 1966<br />\n<br />\nAnalysis<br />\nEarp Presidency Ends<br />\nEn Election Controversy Run-Off S.C. Election<br />\nCalled Unnecessary<br />\n<br />\nThe Student Council substituted National Bohemian at<br />\n3230 Abell Avenue for the usual<br />\ncoffee in the \"J\" Room to commemorate the end of the Earp<br />\nregime last Monday evening.<br />\nMore than anything else, perhaps, the outgoing and incoming<br />\ncandidates will remember the<br />\nElection Committee's unexpected<br />\nannouncement that the election<br />\nreturns were not valid, as a result of a tie that had been discovered for the positions of<br />\nsophomore class representative<br />\nam. sophomore class president.<br />\n<br />\nmission has recently been busy<br />\nfitting its 98 applicant's into 8<br />\navailable positions, and President Milton S. Eisenhower has<br />\ntaken an active role in investigating fraternity hazing and the<br />\nastounding<br />\nfees<br />\nthe<br />\nplant<br />\nmanager charges groups using<br />\nHopkins facilities. The Council<br />\nannounced that it is awarding<br />\nthe Gilman Trophy to Mr. John<br />\nSynodinos, of the Committee of<br />\nSpecial Events, for the contributions his work has made to undergraduate life.<br />\n<br />\nWoe Tail<br />\nThe Elections Committee then<br />\nrevealed a tale of woe. Until<br />\nthis moment, everyone on the<br />\nCouncil and the few students<br />\nwho cared thought that Mark<br />\nSteinberg had won the class<br />\npresidency from Jack Kirk by<br />\none vote last week, and likewise that Bruce Resnick had dispossessed Bud Bozarth from his<br />\nMeanwhile the Honor Com- position as class representative<br />\nfrom the class of 1968 by one<br />\nI We need your head in our<br />\nvote. But alas, Clements' Committee uncovered one \"ballot\"<br />\nbusfness<br />\nwhich had not been counted previously because of an irregularity.<br />\n3120 St. Paul St.<br />\nA fate would have it, the elecAcross from Eddies<br />\ntor cast one ballot for Jack Kirk<br />\nOutgoing President Shelley<br />\nEarp, commenting on the Council's achievements during the<br />\npast year, remarked that this<br />\nwas the first time anyone could<br />\nremember that the Council had<br />\nnot only spent all its money but<br />\nwiped out the contingency fund<br />\nas well.<br />\n<br />\nSt. Paul Barber Shop<br />\n<br />\nand one for Bud Bozarth. The<br />\nElections Committee unanimously recommended that the Council hold run-off elections for<br />\nBy PETER HAAS<br />\narrived and ruled the Alapas<br />\nboth offices. All the candidates<br />\nLast Monday evening the out- ballot invalid because it was not<br />\nconcerned felt this was fair ex- going Student Council met to<br />\nan official ballot cast at a proper<br />\ncept Resnick, who exclaimed, turn control over to the Council\"What! You can't expect me to elect. The Elections Committee, time. The remaining ballots were<br />\ngo through a whole week more however, surprised everyone by counted that evening, and Resof campaigning! This is unfair\" recommending that run-off elec- nick and Steinberg were declared<br />\nEarp explained that the can- tions be scheduled next Monday winners, each by one vote.<br />\ndidates do not officially a.ssume and Tuesday for the position of<br />\nSubsequently<br />\nan<br />\nunknown<br />\noffice until the report of the junior class president and for<br />\nElection Committee has been one of the positions of junior person informed Alapas that his<br />\nclass representative, because ties ballot had been defenestrated,<br />\nadopted by the Council.<br />\nRegarding this arrangement, existed for each position between so to speak, and called Jack Kirk,<br />\nJack Kirk and Mark Steinberg,<br />\nwho referred the matter to Doyle<br />\nEarp opined: \"This is justice.\"<br />\nand between Bruce Resnick and<br />\nSmith, a member of the Elections<br />\nDoyle Smith recommended that<br />\nBud Bozarth respectively.<br />\nCommittee. Over the weekend<br />\nnext year's Committee make the<br />\nAll four candidates acquiesced Smith asked Clements to call a<br />\nvoting procedure more explicit.<br />\nto the Council's decision to ac- meeting of the Committee to deBozarth approached Resnick to<br />\ncept the Committee's recommen- cide the matter. The Committee<br />\nask him if they could speak about dation, although Resnick<br />\nsaw fit<br />\nthe matter. Resnick retorted, to call on Dennis Clements, held a privy meeting in Clements'<br />\nbedroom during the first few<br />\n\"I'd rather not.\"<br />\nchairman of the Committee, at minutes of the regular Council<br />\nAbove the din senior class pres- 1:30 a.m. Tuesday morning to<br />\nmeeting and voted 4-0 to count<br />\nident-elect Jim Mongiarclo an- Inquire about Clements' personal the Alapas<br />\nballot on the grounds<br />\nnounced that the Junior Class Interests in the matter.<br />\nthat an official Council member<br />\nPicnic will not be held because<br />\nFollowing are the facts behind had assured him that his vote<br />\nthe proprietor of Beaver Dam the fiasco.<br />\nwould be counted. His ballot<br />\nwill not allow Negroes. The<br />\nOn Tuesday, April 19, George created the two ties which now<br />\nCouncil unanimously voted to Alapas approached Ken Bond, a necessitate the run-off election.<br />\nsend a letter of protest.<br />\nCouncil member, in the dormiIt is unfortunate that the<br />\nBill Fteinsch was installed as tory cafeteria about 5:00, and candidates had<br />\nto learn of the<br />\nthe new president. Sandy Cohn informed Bond that he had an mess so long after the<br />\nelection<br />\nwas elected vice-president by ac- engagement at 5:15. The polls and without any warning. It<br />\nofficially<br />\n5:15.)<br />\nopen<br />\nwere<br />\nto<br />\nat<br />\nclamation. The new secretary is<br />\nwould be easy to accu.se Ken<br />\nDave Wirtz, and Jan Mongiardo Bond expressed his inaccurate Bond of incompetence and the<br />\nwill chair the Social Committee. belief that the polls probably Elections Committee of twoshould have been opened at 5:00, facedness, but it would probably<br />\nand directed Alapas to write be more accurate to blame the<br />\nA Favorite Render Wu<br />\ndown the names of those candi- confusion on the inadequate pubfor Hopkins Men<br />\ndates for whom he wished to licity given the election. The<br />\nJIMMY WU'S vote and to sign it, whereupon Elections Committee's posters<br />\nBond countersigned and assured announcing the election were<br />\nNEW<br />\nAlapas: \"As a member of the often difficult to read, and the<br />\nCHINA INN<br />\nElections Committee, I'll see that committee failed to be sure<br />\nthat<br />\nCharles Street below 25th<br />\nyour vote will be counted.\" the News-Letter was adequately<br />\nAlapas voted for Jack Kirk and informed of the election parJIMMY WU'S<br />\nBud Bozarth. This all transpired ticulars. Recognition must also be<br />\nCARRY OUT SHOP<br />\nbefore 5:10.<br />\n1411 E. Cold Spring Lane<br />\ngiven to the perverted individuals<br />\nA few minutes later Clements who removed the election<br />\nannouncements from the dormitories and to the 52% of the<br />\nsophomores class which couldn't<br />\nbe bothered to vote.<br />\nAt DAR Constitution Hall<br />\nAnd still, it's not too late.<br />\n<br />\nThe amazing NINA SIMONE<br />\n18th and C St., N.W. Washington, D.C.<br />\n<br />\nSAC<br />\n<br />\nFriday, May 6 - 8:30 P.M.<br />\n<br />\nAll Sophomores Interested<br />\nIn applying to the Student Activities Commission should<br />\nsubmit their names, box numbers, and class schedules to<br />\nBox 907 by Friday, May 6.<br />\n<br />\nTickets: $1.80, 2.50, 3.50, 4.25. 4.75<br />\nTalbert Ticket Agency, Willard Hotel, Washington. D.C.<br />\nMail orders accepted, send self addressed stamped envelope.<br />\nPhone NA 8-5575, NA 8-4420.<br />\n••••••-••-•••••-••••• •• • • •• •••••••••••••••••••••••••.•••••••••••••• •<br />\n• ••••<br />\n•<br />\n<br />\nBooster Club<br />\nThe Booster Club has six<br />\npositions for freshman and<br />\ntwo at-large positions open.<br />\nApplications for interviews<br />\nare due in Box 789 by May 2.<br />\n<br />\nSUMMER JOBS<br />\nUNDER AMERICAN FORESIGHT'S UNIQUE<br />\nGUARANTEED INCOME PROGRAM<br />\nYOU CAN EARN<br />\n<br />\nRx Rx Rx Rx Rx Rx Rx Rx ltx Rx<br />\n<br />\nDON'T FORGET<br />\nMOTHER'S DAY<br />\nMAY 8<br />\n<br />\n$1,000 To $2,500<br />\nWITH NO PREVIOUS EXPERIENCE<br />\nQUALIFICATIONS:<br />\n1. You must have a car.<br />\n2. You must live within these areas:<br />\n<br />\nmasculine<br />\n...that's the kind of aroma she likes being close to. The aroma of Old Spice.<br />\nCrisp, tangy, persuasive. Old Spice ...<br />\nunmistakably the after shave lotion for<br />\nthe untamed male. Try it soon ...she's<br />\nwaiting.<br />\n1.25 & 2.00<br />\n<br />\nOr Within 50 Miles of:<br />\nSpringfield, Massachusetts<br />\nBoston, Massachusetts<br />\nProvidence, Rhode Island<br />\nNewark, New Jersey<br />\nPhiladelphia, Pennsylvania<br />\nBaltimore, Maryland<br />\n<br />\nCome and Learn About This Terrific<br />\nSummer Job Opportunity<br />\n<br />\n...that's the way it is<br />\nwith Old Spice<br />\n<br />\nTHURSDAY, MAY 5<br />\nOtelcOice<br />\n<br />\nSHULTON<br />\n<br />\nMassachusetts<br />\nRhode Island<br />\nWestern Connecticut<br />\nNew Jersey<br />\nEastern Pennsylvania<br />\nDelaware<br />\nMaryland<br />\n<br />\n2:00 P.M.—Placement Office, '100 Whitehead Hall<br />\n4:00 P.M.—Placement Office, 100 Whitehead Hall<br />\n<br />\n04<br />\n14<br />\n•<br />\n<br />\n4<br />\n<br />\n—we hare a<br />\ncomplete assortment<br />\nof Mother's Day Cards 0<br />\nand Gifts<br />\n<br />\nH<br />\nH<br />\n• Greenway Pharmacy .1<br />\ng<br />\n<br />\nr<br />\n<br />\nCharles and 34th Sts.<br />\nRx Rx Rx Rx Rx Rx Rx Rx Ex Ra<br />\n<br />\nSeats still available on special Johns Hopkins flight to<br />\nGermany. Leaves on June 15<br />\nfrom NYC, returns on Sept.<br />\n6. Open to all students, faculty, and employees. $360.<br />\nCall Mrs. Haynes, Jenkins<br />\nHall, HO 7-3300, Ext. 429.<br />\n<br />\n\fHOMEWOOD, BALTIMORE, APRIL 29, 1966<br />\n<br />\nTwo Concert Series Campus Parking<br />\nAt J.H.U. Next Year Prob. Examined<br />\nBy TIM OLIVER<br />\nHalf the subscriptions to the<br />\n1966-67 Hopkins concert series<br />\nhave been sold to students, faculty and alumni, and sales will<br />\nsoon be opened to the public.<br />\nConcert lovers will be offered an<br />\nadditional treat by the annual<br />\nBaltimore Chamber Music Society series.<br />\nThe University series, of six<br />\nconcerts supported by the Elizabeth Sprague Coolidge Foundation, will run, except for one<br />\nconcert, Sundays in Shriver Hall.<br />\nThe Chamber Music Society<br />\nseries, featuring, as in seasons<br />\npast, artists of international<br />\nfame in programs of both standard and contemporary works,<br />\nwill be held Sundays at 3:30 in<br />\nthe auditorium of the Baltimore<br />\nMuseum of Art.<br />\nUniversity Series<br />\nThe Shriver series will open<br />\non November 13 with the Julhard String Quartet, called by<br />\n<br />\nBrody to Give<br />\nLabor Speech<br />\n<br />\nthe Times \"the very model of<br />\nmodern string quartet playing at<br />\nits best.\"<br />\nJean-Pierre Rampal and Robert Veyron-Lacroix, the French<br />\nflute and harpsichord duo who<br />\nreceived ten curtain calls and a<br />\nstanding ovation from a capacity audience last year, will return<br />\non December 18.<br />\nMieczyslaw Horszowski, acclaimed by Newsweek as \"the<br />\nleast known of the world's great<br />\nPianists,\" and who has accompanied many great musicians, including his old friend Pablo<br />\nCasals, will appear in concert on<br />\nFebruary 26.<br />\nQuartetto Italiano<br />\nThe Quartetto Italiano, to<br />\nwhich the Times attributes \"intensity and beauty of sounds so<br />\ngreat as to seem larger than life<br />\nand fill the auditorium easily,\"<br />\nwill come on March 12.<br />\nThe fifth concert will feature<br />\nthe great Russian cellist Mstislav<br />\nRostropovich at the Lyric Theatre on Wednesday, April 19.<br />\nSubscribers will return to<br />\nShriver for the, final concert,<br />\nfeaturing the Virtuosi di Roma<br />\nand directed by Renato Fasano,<br />\non April 30. According to the<br />\nChicago<br />\nTribune, \"The<br />\nmen play for Fasano as if their<br />\nlives hung in the balance . . .<br />\nVirtuosi is no idle word picked<br />\nto look well on a poster.\"<br />\n<br />\nDr. David Brody, associate<br />\nprofessor of history at Ohio<br />\nState University, will deliver . a<br />\nlecture on the rise of American<br />\nlabor today at 4:00.<br />\nThe lecture, scheduled for delivery in the new classroom<br />\nChamber Series<br />\nbuilding, is entitled 'The Growth<br />\nThe opening concert of the<br />\nof the Labor Movement: Sources<br />\nArt Museum series on October<br />\nof Restraint and Expansion.\"<br />\nDr. Brody is one of four speak- 23 will present the Trio Flauto<br />\ners on the evolution of American Dolce (recorder, bassoon and<br />\npolitical parties, corporations, harPsichord) with Jean Hakes,<br />\nlabor movements, and the mili- soprano, in a program of Barotary establishment in a lecture que music.<br />\nseries here.<br />\nStockholm Quartet<br />\n- Under the auspices of The<br />\n19 will bring the<br />\nFebruary<br />\nthe<br />\nJohns Hopkins Center for<br />\nStudy of Recent American His- Stockholm Kyndel String Quartory, the James Schouler lec- tet with the great Swedish<br />\ntures will interpret 'The Chang- guitarist Per-Olaf Johnson. The<br />\ning Nature of American Institu- program will include Bartok's<br />\ntions in the Twentieth Century.\" fourth string quartet with reDr. David Brody, the Schouler marks by Sandor Veress of the<br />\nlecturer on the American labor Peabody Faculty.<br />\nmovement, earned his doctorate<br />\nSubscriptions for the five<br />\nat Harvard University in 1958 Museum concerts may be oband subsequently has written tained from the Music Centre<br />\nthree books about labor, Steek Concert Bureau (LE 9-3100).<br />\nworkers in America, The ButchSubscriptions for the six Shriver<br />\ner Workmen, and Labor in Crisis:<br />\nconcerts may be obtained from<br />\nHe is currently writing a history<br />\nRelations Office (467of labor during the New Deal. the Public<br />\nThe lecture is open to the public. 6382) for six dollars.<br />\n<br />\nPAGE THREE<br />\n<br />\nNEWS-LETTER<br />\n<br />\nThe campus parking problem<br />\nremains a perplexing one which<br />\nhas yet to be solved. There are<br />\napproximately eight thousand<br />\ncampus authorized vehicles for<br />\nsome one thousand parking<br />\nspaces.<br />\n<br />\nThis situation is alleviated<br />\nsomewhat by the fact that 5800<br />\nof the parking permits are issued to night students, but the<br />\npermits issued to day students,<br />\nfaculty, employees, and guests<br />\ntax the present parking facilities.<br />\n<br />\nCampus Notes<br />\nSpring Glee<br />\nThe annual Spring concert of<br />\nthe Hopkins Glee Club and the<br />\nHopkins Orchestra will feature<br />\nparts two and three of Handel's<br />\n\"Messiah\". The concert will also<br />\nfeature the voices of the Mary<br />\nWashington College Choir and<br />\nthe solo voices of Laurie Kopec,<br />\nsoprano; Ralph Marquis, Tenor;<br />\nand Frank Whitmore, bass.<br />\n<br />\nTau Tutors<br />\n<br />\nIn an effort to provide interThe University created the ested students with majors in the<br />\nCampus Traffic and Parking<br />\nCommittee several years ago to<br />\nstudy the situation.<br />\nBesides issuing permits, the<br />\ncommittee must maintain the<br />\nparking lots and enforce its regulations. The committee makes<br />\nregulations it feels are necessary<br />\nfor the safety of the campus<br />\ncommunity. The blocking of<br />\nroads creates a fire hazard, prevents the passage of emergency<br />\nvehicles and hinders delivery of<br />\nnecessary supplies.<br />\nThe committee does not have<br />\nthe funds to investigate the<br />\nproblem of increasing the parking facilities. The university<br />\nauthorized the hiring of a professional planning service to investigate this problem. The report of this group is expected in<br />\nthe near future.<br />\n<br />\nPART-TIME<br />\nIIELP WANTED<br />\n<br />\nengineering sciences an opportunity to become more intimately acquainted with the courses<br />\noffered in engineering, the members of Tau Beta Pi will offer a<br />\nspring advising service.<br />\n<br />\nPublic Events<br />\nAll organizations planning<br />\nto sponsor public events during the 1966-67 year should<br />\nsend representatives to the<br />\nmeeting of the Social Committee of the Student Council<br />\non Thursday, May 5 at 4:00.<br />\n<br />\nHARLEY'S<br />\nFAMOUS SANDWICH CREATIONS<br />\nGREENMOUNT AT 32nd<br />\n<br />\nNo. 1 for 18 Years<br />\nALSO<br />\n<br />\nTHE CHILI BOWL<br />\n32nd & OLD YORK ROAD<br />\n<br />\nCustom Sound installation work.<br />\nContract bards through Hummer. Egperience necessary. SA 7-2077.<br />\n<br />\nDRAFT DEFERMENT<br />\nTESTS<br />\nThese books will help you prepare 'for the<br />\nSelective Service Qualification Tests. You<br />\nmay take'this test only once. Be prepared!<br />\nBarron's How to Prepare for Student<br />\n$2.95<br />\nDraft Deferment Test<br />\nScore High on Selective Service College Qualification Test<br />\n<br />\nThe Johns Hopkins Bookstore<br />\nGILMAN HALL 11<br />\n<br />\nHow to look good on any golf course: play it bold with Arrow's Mr. Golf, the Decton wash(<br />\nand wear knit that stays fresh and crisp to the eighteenth and beyond. Stays tucked-in,)<br />\ntoo. An extra-long back tail keeps down while you swing. Many<br />\nrrfo,<br />\nstandout colors, $5. Pick out a few at your Arrow retailers.<br />\n<br />\n,„,ARRo<br />\n<br />\n\f\"PAGE FOUR<br />\n<br />\nNEWS-LETTER<br />\n<br />\nallg Mins Wopktits News-EMIT<br />\nEditors-in-Chief<br />\nMelvin R. Shuster<br />\n<br />\nHenry J. Korn<br />\nBusiness Managers<br />\nAllan &rile11<br />\n<br />\nWilliam Schenck<br />\n<br />\nExecutive Editor<br />\nGarth Mackenzie<br />\n<br />\nManaging Editor<br />\nMarshall Paul<br />\nAssociate Editors<br />\nRoger Toil<br />\n<br />\nGregory Altshuh<br />\n<br />\nNews Editor<br />\nPeter Koper<br />\n<br />\nArts Editor<br />\nChris Molloy<br />\n<br />\nFeatures Editor<br />\nHenry M. Hocherman<br />\n<br />\nPhotography Editor<br />\nJoel Crawford<br />\n<br />\nSports Editor<br />\nJed Ludlow<br />\n<br />\nCopy Editors<br />\nSteve Levinson<br />\nJos Weinberg<br />\n<br />\nContributing Editors<br />\nShe Katz<br />\nMike Phillips<br />\nNeil Grauer<br />\nPete Hass<br />\nRichard Hammond<br />\nRobert Blitzer<br />\n.Jim Sloan<br />\n<br />\nAssociate Staff<br />\n-----<br />\n<br />\nGraphics Editor<br />\n. News Editor<br />\n__...Asst<br />\n.<br />\nAsst. Photography Editor<br />\n-Advertising Manager<br />\n----Asst. Sports Editor<br />\n<br />\nReporters<br />\nNews: Mary Berg, Peter HilfUl, Colin Alcott, Dennis Massey, Sam Francis:<br />\nFeatures: Evan Wilson, Gerry Brecher: Sports: Iver Minded. Otis Seidel,<br />\nJosh Treern. Gary Smith, Jeff Lauren; Copy: Tim Oliver; Business: John<br />\nThornton, Merrill Egorin, Don Bierly, Ronald Ginsberg, Paul Smith,<br />\n•<br />\n<br />\nCurriculum Committee<br />\nThe current plight of undergraduate education at<br />\nHopkins is a well-established fact. Poor graduate instruction, insufficient course offerings in most departments, the small size of the teaching faculty, and incompetent advising have been lamented before. In the<br />\nrecently compiled Report of the Undergraduate Committee for Curriculum Studies, its authors have successfully laid bare the relationship between these problems<br />\nand the general Hopkins approach to education, also providing concrete suggestions for improving the situation.<br />\nBecause the departments are extremely graduatebriented, and due to the demands of the \"publish or<br />\nperish\" doctrine, the attention of the faculty is diverted,<br />\nnot unwillingly, from the undergraduate student body.<br />\nFurthermore, the Report states, \"proposals that the administration act to alter this imbalance involves a transgression of the traditional departmental autonomy. Most<br />\nfaculty members feel that such autonomy should remain<br />\nbecause it preserves the freedom of the scholar.\" Many<br />\nadministrators, we might add, go along with this philosophy.<br />\nWhile this approach embodies the \"uniqueness\"<br />\nof Hopkins, some modification is presently called for.<br />\nThe administration will he characteristicly slow to react, although the combination of the Schools of Philosophy and Engineering Science into one School of Arts<br />\nand Sciences suggests that interdepartmental communication could improve, facilitating changes in basic academic requirements and scheduling, and encouraging<br />\nthe establishment of more interdepartmental courses.<br />\nMore importantly, the administration could encourage<br />\nprofessors to teach more courses by awarding promotions to good teachers as well as by increasing their<br />\naalaries.<br />\nFor any real improvement to take place, however,<br />\nthe faculty in the various departments will have to<br />\nmodify their views in favor of increased teaching responsibilities. Only in this way can qualified and interested graduate students receive the opportunity to teach<br />\nspecialized courses in their particular fields, as has been<br />\nsuggested, thus helping to alleviate the shortage of<br />\ncourses. More thorough supervision and coordination<br />\nof graduate instructors also requires the belief by professors that the effort is worth it. There is no reason why<br />\nthe departments on their own cannot effect the necessary<br />\nchanges, if they are but willing to employ the current<br />\ndepartmental system more flexibly.<br />\nDealing with departments individually and directly<br />\nproved a successful approach to the Undergraduate<br />\nCommittee on Curriculum Studies in writing its report.<br />\nProfessors were both frank and at least open to ideas.<br />\nIn continuing to follow this approach, the Committee<br />\nmay find the departments more responsive to the suggestions proposed in its Report.<br />\nThe Committee itself currently hold ad hoe status,<br />\nview of its accomplishments to date, there seems<br />\nin<br />\nand<br />\nto he no reason to change it. Its greatest asset is the fact<br />\nthat it is composed of concerned and informed individuals. It would be a mistake to destroy its influence by<br />\nmaking it a political plum for either the Student Council<br />\nor the administration.<br />\n<br />\nI<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 29,<br />\n<br />\nMe<br />\n<br />\nlite alkonewaaci Scene<br />\nWEEKEND WEAKENED<br />\n<br />\nBy HENRY M. HOCHERMAN<br />\nIn h recent cover story, Time.<br />\nthe Weekly Newsmr gazine, proclaimed that London is the socalled \"city of the decade.\"<br />\nNothing could be further from<br />\nthe truth. Anyone who has been<br />\nto the Monumental City, the<br />\ngem of of the Chesapeake Bay,<br />\nscenic Baltimore, knows that she<br />\nand only she is the city of the<br />\ndecade.<br />\nToday marks the beginning of<br />\nthe Spring Weekend, and to<br />\nthose Hoppies who have brought<br />\ngirls to this wondrous city for<br />\nthe occasion, this reporter humbly offers a plan of things to see<br />\nand do in Baltimore.<br />\nFriday, April 29<br />\n6:00 P.M. Your date arrives at<br />\nPenn Station.<br />\n6:01 P.M. You go to the parking lot to find that your car is<br />\nsurrounded by fourteen other<br />\ncars.<br />\nmemorate the birthday of Oscar for exhibition of Nouvelle Vague<br />\n6:45 P.M. You get out.<br />\n7:00 P.M. Dinner,<br />\nMary's \"Flash\" Flashmayer, a friend of Jailhouse Art. Key on Plaster.<br />\nGrotto. (A small restaurant lo- John Birch.<br />\n10:30 P.M. Baltimore Civie<br />\n1:30 P.M. Calvert Street, to see Center for<br />\ncated off University Parkway,<br />\nInternational Trivia<br />\nhundred<br />\nfour<br />\nmembers<br />\nthe<br />\nof<br />\nreferred to by regulars as the<br />\nOpen. \"Trivs\" Brickman takes<br />\nUniversity Heights Improvement on fifteen world<br />\n\"Snack Bar\").<br />\ngrand masters.<br />\n8:00 P.M. Brubeck (go early Association sneer in silent con11:00<br />\nP.M.<br />\nFollowing<br />\ncondolfraternity<br />\ntempt<br />\nat<br />\nhouses.<br />\nfor seats).<br />\nence party for \"Trivs\" Brickman,<br />\n11:00 P.M. Leave Brubeck, just<br />\n1:31 P.M. Calvert Street to see<br />\nin time to see the changing of four fraternity men who ca.'e dramatic reading of Where the<br />\nBoys Are by Sally Fields in<br />\nthe guard in front of Polnitzky's enough to sneer back.<br />\nWyman Park.<br />\nJewelry Store, Baltimore Street.<br />\n2:00 P.M. Lacrosse, Army at<br />\n12:00 midnight.<br />\n12 midnight. Ceremony honor- Home.<br />\nSubmarine<br />\ning the twelfth anniversary of<br />\n4:30 P.M. Bluejay Victory Par- races in Loch Raven.<br />\nthe mugging of Lucifer Sforts on ade.<br />\n1:00 A.M. Tour of the Gait?.<br />\nGay Street, followed by a re5:00 P.M. Six minutes of sil- Only building in the world built<br />\nenactment of the scene by the ence in front of Recrutiing Sta- for the purpose of Burlesque and<br />\nGay Players.<br />\ntion at Greenrnount Avenue to never used for anything else.<br />\n1:00 A.M. Late Snack at Nate's honor Six who sat. (A mixer fol- George Washington slept there.<br />\nand Leons.<br />\nlows.)<br />\n3:00 A.M. Baltimore Harbor<br />\n2:00 A.M. Fort McHenry to<br />\n6:00 P.M. Dinner, the B and for the 16th annual whaleboat<br />\nsee three masked men attempt- M sub shop, Guilford. Horatio regatta and bagel roll.<br />\ning to lower flag over Ft. Mc- Niblet once ate tl.ere. No Mich4:00 A.M. Sleep.<br />\nHenry. One can be overheard elin rating.<br />\nSunday, May 1<br />\nsaying, \"We'll get it this year.\"<br />\n7:00 P.M. South Broadway to<br />\n12:00 Noon. Brunch, AchmudIP<br />\n3:00 A.M. Sleep.<br />\nsee the home of Fifi \"Chuckles\" Cave.<br />\nSaturday, April 30<br />\nLarue. George Washington slept.<br />\n1:00 P.M. Poetry reading in<br />\n12 noon. Rise. Brunch at the there.<br />\nfront of court house.<br />\nOpen Sewer, a little known diner<br />\n8:00 P.M. Dance.<br />\n1:30 P.M. Poetry reading In.<br />\non Twenty-Ninth Street. Mich9:00 P.M.<br />\nNorth<br />\nCharles side the courthouse.<br />\nelin gives it four stars.<br />\nStreet. Baltimore Department of<br />\n2:00 P.M. Penn Station and<br />\n1:00 P.M. Blackstone Phar- Public Works holding snow re- home.<br />\nmacy for a meeting of the Bal- moval drill.<br />\n2:01 P.M. You go to the parktimore Junior League to com9:30 P.M. Baltimore City Jail ing lot ...<br />\n<br />\nTHEATRE<br />\n<br />\n'Syracuse'Funny Despite Faults<br />\nThe Boys from Syracuse was a<br />\nfunny play. It was not great<br />\ntheater, it was not meant to be<br />\ngreat theater, but it was funny.<br />\nIt was an attempt on the part<br />\nof one group of people to cause<br />\nanother group of people to forget themselves for a moment and<br />\nlaugh out loud. It succeeded admirably. One can not ask more<br />\nof a musical comedy.<br />\nThe play can be criticized at<br />\nmany points. It was amateurish,<br />\nmany of the lines were trite,<br />\nslapstick cliches. Some of the<br />\nsongs were badly written, badly<br />\nsung. But the production made<br />\nno pretense of being professional, and the trite lines were those<br />\nof George Abbott, not Theatre<br />\nHopkins. The tone of the production was light, and it may be<br />\nsaid that those involved in producing the play viewed the task<br />\nof production and presentation<br />\nwith just the right degree of seriousness. Never does the play become 80 heavy handed, the actors<br />\nso engrossed in themselves that<br />\nthe primary object of the play,<br />\nhumor, is forgotten.<br />\nNone of the music can be described as great, but \"Falling in<br />\nLove With Love\" and \"This<br />\nCan't be Love\", come quite close,<br />\nand over the years have achieved<br />\n\"standard\" stature. \"The Shortest Day of the Year\" is one<br />\neverybody would rather forget.<br />\nIt can be said that the music<br />\n<br />\nis the weakest point of the proBonnie Kahn as Luce did itet<br />\nduction, there being little out- the joke, and so did everyone<br />\nstanding singing and little out- else. She was the classical<br />\nstanding to sing. The orchestra, shrew, a screaming, scolding<br />\na slightly overzealous drummer Xanthippe who sang well<br />\nand<br />\nnotwithstanding, made quite a screamed well, and who even<br />\ngood showing.<br />\nmanaged to elicit a little passion<br />\nThe acting varied in quality (but just a little) for her plight.<br />\nfrom very good to very mediocre, She caused everyone to<br />\nfeel<br />\neach character running the sorry for Dromio, who had<br />\nnot<br />\ngamut during his performance. the strength to feel sorry for<br />\nThe two Dromios, Conner and himself.<br />\nKahn can only be described as<br />\nRenay Lois was lovely, but in.<br />\ndelightful, while the sorcerer, convincing.<br />\nHer voice was good,<br />\nRick Wessler, can only be de- her<br />\npresentation excellent, but<br />\nscribed as magnificent. He com- she didn't<br />\nstrike one as the jealbined the charlatanry and humor ous wife<br />\nwhose husband is out<br />\nof sorcerers from Merlin to with<br />\nthe local courtesan. Not so<br />\nMandrake and appeared to float for her<br />\nsister who appeared for<br />\nthrough his part as if he firmly a moment,<br />\nif only for a moment,<br />\nbelieved that at any moment he to be in love.<br />\ncould turn himself into a basketBruce Fag in as the Merchant<br />\nball and go bouncing off the<br />\nwas good, but Bruce Fagin as<br />\nstage. He seemed the favorite of<br />\nthe gong ringer in the final<br />\naudience and company alike, and<br />\nhis appearance on stage Caused' scene was great. Without saying<br />\na smile to form in a little corner a word he managed to perform<br />\none of the funniest bits of bustof one's face and spread as he<br />\nness in the play.<br />\nmagically unfolded his bag of<br />\nThe scenery was well contricks. It was Wessler laughing<br />\nat the sorcerer and the soi•cerer* ceived and well executed. It VMS<br />\nlaughing at Wessler, and every- simple but not so simple that<br />\nthe viewer was in doubt as to<br />\none else was caught in fray.<br />\nThe Wex brothers as Anti- where a given scene was taking<br />\npholus (or is it Antipholae) place.<br />\nwere good, but not great. They<br />\nSyracuse claimed only to be a<br />\nsang well, but there was little funny play. This reporter hasn't<br />\nfeeling in their performances. laughed so much ;since Nixon<br />\nOne got the idea that they didn't ran for president.<br />\nget the joke.<br />\nH.M.H.<br />\n<br />\n\fHOMEWOOD, BALTIMORE, APRIL 29, 1966<br />\n<br />\nNEWS.LETTER<br />\n<br />\nPAGE FIVE<br />\n-<br />\n<br />\neaue<br />\nJustice may be blind but she's<br />\nnot deaf.<br />\nRobert H. Hinton, Jr.<br />\nEditors note: Mr. Hinton's letter also appeared in the April 26<br />\nissue of The Baltimore Sun.<br />\n<br />\nLamdin Criticized<br />\n<br />\n4;4144.4.S.'<br />\n<br />\n1 Have 10 howls of<br />\n<br />\nce<br />\n<br />\nappeared in your story and edi- thavior at all times except durtorial.<br />\ning his discussion with the arIn your article, you state that resting officer.<br />\nWilson stated to Caleb DaRchI cannot say the game about<br />\nanel, also a Hopkins student, your editorial, which calls Judge<br />\nthat the arresting officer was Lamdin an idiot and implies he<br />\nan idiot. The testimony is dis- is illegitimately born. You can<br />\nputed whether the remark, which do no service to the Hopkins<br />\nundoubtedly was made was di- students whose \"town-gown\" afrected at the officer or Deschanel. fairs result in arrests, nor to<br />\nYou also state that Judge I. your newspaper, if you resort to<br />\nSewell Lamdin refused to hear diatribe in place of calm reason.<br />\ndiscussion on the details of the<br />\nSincerely yours.<br />\narrest and of Wilson's conduct.<br />\nH. Rutherford Turnbull, BA '59<br />\nThis is incorrect and Judge<br />\n(Formerly Editor-in-Chief,<br />\nLamdin heard the testimony of<br />\nNews-Letter)<br />\nthe arresting officer and the defendant and argument from<br />\nLamdin Benched<br />\ncounsel. I cannot remember the<br />\nTo the Editors:<br />\nJudge's exact words concerning<br />\nIn the conviction of the six<br />\nWilson's conduct, but I do reantiwar demonstrators I feel<br />\ncall his statement that, when he that an<br />\ninjustice was done in<br />\nwas a Hopkins student, he was that the demonstrators<br />\nwere<br />\ntaught to behave like a gentle- convicted of one charge while<br />\nin<br />\nman.<br />\nreality they were tried not on<br />\nConcerning your editorial, the any charge but on the validity<br />\noriginal sentence of $25.00 and of the belief which they held. It<br />\ncosts was never reversed nor was is likely that they are guilty<br />\nan appeal ever taken. After the under the provisions of the staNEW<br />\nhearing, I spoke with Judge tute concerning disorderly conLamdin in chambers and obtain- duct, but the fact that the judge<br />\nused the occasion to try to refute<br />\ned his assurance that he would<br />\ntheir beliefs to which he was<br />\nsuspend the imposition of senstrongly opposed throws doubt<br />\ntence and grant Wilson proba- on<br />\nthe validity of the reasons for<br />\ntion before verdict, so that Wil- convicting<br />\nthe students.<br />\nson's record can remain \"clean\"<br />\nThe poem praising soldiers re— he has never, in the eyes of cited by Judge Lanidin<br />\nAROMATIC SMOKING TOBACCO<br />\nhad<br />\nthe law, been convicted. I would nothing to do with the specific<br />\nlike to repeat that there is no charge at hand. It was • aimed<br />\nEnjoy a free full-size pouch of<br />\ndoubt but that Wilson stated rather at the convictions of the<br />\nBurgundy. An aromatic blend of<br />\nthat the policeman was an idiot; students. The quote used by<br />\nvintage tobaccos,fine taste and<br />\nhe also stated the situation was Judge Lamdin about \"my counpleasant wine aroma, for the<br />\ntry<br />\nright<br />\nor wrong\", besides<br />\nidiotic.<br />\nsounding<br />\nsmoothest<br />\nsmoke ever to come<br />\nlike<br />\nthe<br />\nrationale<br />\nof<br />\nIt is my opinion however, that<br />\nout ot a pipe. Clip the coupoR<br />\n(Continued on Page 8)<br />\nhe was not guilty of disorderly<br />\nnow. Cheers,<br />\nconduct, as charged.<br />\nIt seems to me that Judge<br />\nMI SO MN MI MI UN<br />\n1118 NS1<br />\nLamdin did budge; he granted<br />\nmy request for a revision of the<br />\nsentence. Wilson is to be commented for his conduct before<br />\nDOWN<br />\nthe Judge and for his good be-<br />\n<br />\nTo the Editors:<br />\nThe circumstances surrounding<br />\nthe recent trial of six students<br />\nfor protesting the war in Viet<br />\nNam led me to believe that Baltimore's judicial system is in need<br />\nLamdin Lambasted<br />\nof close scrutiny similar to that<br />\ndone recently for our police de- To the Editors:<br />\nOne wonders just what we are<br />\npartment.<br />\nfighting for in Vietnam if six colI found it most disturbing that lege students can be sentenced to<br />\nIn order to have benefit of the 60 days in jail for lying on the<br />\nnew bail-releaSe system one has pavement in front of a recruiting<br />\nto appeal to the prejudices of an office after<br />\nattempting to disassistant State's attorney who tribute anti-Vietnam-war literacan arbitrarily say no for no ture inside.<br />\nreason other than that he \"deVietnam is a serious and contests and dislikes the ideas\" that troversial problem and<br />\nthere is<br />\nthe defendant might \"stand for.\" certainly<br />\na need for some people<br />\nThe young men In question to protest and demonstrate. Dewere supposed to be on trial for monstration against Government<br />\ndisorderly conduct but Judge I. policies implies some civil disSewell Lamdin made it quite obedience; however, six students<br />\nClear, in his reported remarks, lying on a pavement does not<br />\nthat he convicted them because seem to be too much in excess of<br />\nof their views on the Vietnam \"the right of the people peacewar. I would like to hear how ably to assemble, and to petition<br />\nJudge Lamdin explains the re- the Government for a redress of<br />\nlevance of \"God and the soldier\" grievances.\"<br />\nto a charge of disorderly conduct.<br />\nThe court should have simply<br />\nJudge Lamdin used a quote concerned itself with six young<br />\nfrom Stephen Decatur that is of- college students lying on a paveten used to justify the suppres- ment, but it attempted to prosion of dissent about foreign poli- mulgate them a general condemcy when he said \"Our country! nation of anyone who attempts<br />\nIn her intercourse with foreign to demonstrate against our counnations, may she always be in the try's policies. This does not seem<br />\nright: but our country, right or to be the job of a Baltimore<br />\nWrong.\" It may be irrelevant, but Municipal Court of of any court.<br />\ninteresting, that Decatur was<br />\nPhilip Littman<br />\nEditor's Note: Mr. Littman's<br />\ndrinking at the time he made that<br />\nletter appeared in the April 27th<br />\ntoast.<br />\nissue of the Baltimore Sun.<br />\nA more relevant quote and one<br />\nthat says the anti-war movement<br />\nLaw and Lamdin<br />\nIs all about is a paraphrase of<br />\nTo The Editors:<br />\nDecatur's toast spoken by Carl<br />\nAs counsel for Evan Wilson, a<br />\nShurz, Senator from Missouri, in<br />\nHopkins student about whom<br />\na speech before the United States<br />\nSenate in 1872 when he said \"My you wrote in your columns on<br />\nMarch 25 and in your editorial,<br />\ncountry right or wrong! When<br />\n\"Budge,<br />\nJudge\" on April 22, I<br />\nright to be kept right. When<br />\nwould like to correct some of<br />\nWrong to be put right.\"<br />\nthe misstatements of fact which<br />\nIf the principles of personal<br />\nl'esnonsibility outlined at Nuremberg are truly a part of international law and morality and not<br />\nsimply justification for self-righteous vengeance, then the Schurz<br />\nconcept of patriotism<br />\nmust<br />\nDaily 8 A.M. to 6 P.M.<br />\nsuPnlant that of Decatur.<br />\nMon., Thurs., Fri. Till 8 P.M.<br />\nIf judges and assistant State's<br />\nattorneys are going to base their<br />\n\"WE WASH, DRY &<br />\ndecisions on their reactions to a<br />\nSAME DAY SERVICE<br />\ndefendant's beliefs, then they<br />\nshould make a more open-minded<br />\nattempt to find out• just what<br />\nthese beliefs are and to underin by 9 a.m.... out by 3 p.m.<br />\nstand the person's motivation.<br />\n<br />\nWAVERLY LAUNDROMAT<br />\n3330 GREENMOUNT AVENUE<br />\n<br />\nFOLD\"<br />\n<br />\nSHIRTS—DRY CLEANING<br />\n<br />\nvintage Duluth<br />\n...on us!<br />\n<br />\nndy<br />\n<br />\nWelcome Parents<br />\n<br />\nTOWN<br />\n<br />\nHARVEY<br />\nHOUSE<br />\n<br />\nBaltimore's<br />\nFashionable Restaurant<br />\nCOCKTAILS - PIANO BAR<br />\nALL CREDIT CARDS HONORED<br />\n<br />\nLE. 9-3110<br />\n920 N. CHARLES<br />\n<br />\nI<br />\n<br />\nMN IMO NS ENI MK UN 111.1<br />\n<br />\nhen's<br />\nMEN'S WEAR<br />\n516 S. Broadway<br />\nNEW AND WE HAVE IT!<br />\nVAN HEUSEN \"417\" BUTTON-DOWN<br />\nIN PERMANENT PRESS<br />\nA PERMANENT PRESS sm<br />\nwrni POW...<br />\n',fur<br />\n<br />\n1,'Li I<br />\n<br />\ncloy it<br />\n<br />\nI I<br />\n<br />\n0'<br />\n4<br />\n<br />\n,<br />\n<br />\nor VLititpiity h!ik. No<br />\niTii) Pro inotii.,y orr<br />\n<br />\n. 1':<br />\n<br />\nVA.<br />\n<br />\nF-I E.<br />\n<br />\nS 1E<br />\n<br />\n,417\"<br />\n<br />\nCan you believe it? The same<br />\ngreat authentic buttondown has arrived in new<br />\nPermanent Press — complete with smooth \"V-Taper\" fit and the softest<br />\n'collar roll going. It was<br />\npressed the day it was made<br />\n' and it will never need pressing again. Come in and try<br />\nseveral from our new Van°.<br />\npress spring collection,<br />\n$6.00<br />\n<br />\nVAN HEUGEIt<br />\n,109impic p 11,61.11<br />\n<br />\n'<br />\n<br />\n\fPAGE SIX<br />\n<br />\nNEWS -LETTER<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 29, 1966<br />\n<br />\nREPUBLICAN BIAS<br />\n<br />\nThe Nixon Legacy: Circa 1966<br />\nBy GEOFFREY LEBAR<br />\nIt is clear now that the 1966<br />\nelections will in some way be a<br />\nreferendum on the Viet Nam<br />\nWar. Withdrawal or escalation<br />\nwill not be the main issue,<br />\nthough. Since all the Republican<br />\ncandidates will be patriotic<br />\nAmericans, their strategy will<br />\nnot be to undermine the war<br />\neffort. The issue will center<br />\naround what Ambass:sador Goldberg confusingly calls the \"credi-<br />\n<br />\nbility gap.\" In simple terms this<br />\nmeans one's confidence or lack<br />\nof confidence in the government's<br />\ndetermination to carry out a<br />\npolicy which it talks about.<br />\nThe limited war in South Viet<br />\nNam has lost much of its limited<br />\ncharacter. The supply of career<br />\nsoldiers, high school drop-outs,<br />\nand voluntary enlistees has been<br />\nused up. The tentacles of the<br />\ndraft have now extended to<br />\n<br />\nLOOKING FOR A GOOD<br />\nPLACE TO EAT?<br />\n<br />\nOPEN HOUSE<br />\nCOFFEE SHOPPE<br />\n227 W. 29th St.<br />\n3 blocks off campus<br />\nNear Howard<br />\n<br />\nNEVER CLOSED<br />\n<br />\nmany college seniors who were<br />\non their rightful way to graduate school. We have many such<br />\npeople at Hopkins. Thousands of<br />\nother students will be taking<br />\narmy scholastic tests to maintain<br />\ntheir IIS status. As more men<br />\nare touched by the war, a higher<br />\ninterest in our Viet Nam policy<br />\nwill develop.<br />\nRepublicans must be very<br />\ncareful and avoid reckless statements on this most serious international problem. Republicans<br />\nshould look back to the legacy<br />\nof the Eisenhower and Nixon<br />\nyears for advise on the war issue.<br />\nIn those 8 years, not only was<br />\npeace maintained, but where<br />\nlimited troop action was needed<br />\nIt was carried out with dispatch<br />\nand success (Lebanon). In situations where long term stalemate<br />\nwars or unbearable political<br />\ntensions would result, Eisenhower and Nixon restrained<br />\nthemselves (Hungary). John<br />\nFoster Dulles preached \"brinkmanship\" everywhere, but used<br />\n<br />\nnuclear weapons and bombs nowhere.<br />\nGeography and logistics are<br />\nworking against the U.S. in Viet<br />\nNam as well as internal political<br />\ntrouble. But these difficulties<br />\nshould have been assessed before<br />\nthe first U.S. adviser was killed<br />\nthere in December, 1961. Obviously many mistakes were<br />\nmade, especially concerning the<br />\nDiem government. As the Republicans fielded a candidate in<br />\n1952 who was able to end conflict in Korea in an honorable<br />\nfashion, so they may again in<br />\n1968.<br />\nIronically in the Presidential<br />\ncampaign of 1960, Richard Nixon<br />\nchose to stand and fight on the<br />\nforeign policy issue. Unfortunately, Quemoy and Matsu. Cuba,<br />\nHungary, and Lebanon did not<br />\nstimulate the people. The nonexistent missile gap held the<br />\nstage as the defense issue.<br />\nThe Nixon legacy on foreign<br />\naffairs is strikingly related by<br />\nTheodore White in his book,<br />\n<br />\nDO YOU HAVE<br />\nWHAT IT<br />\nTAKES TO BE<br />\nA LEADER?*<br />\n*If you do, don't settle for less.'<br />\n<br />\ncollege this spring'<br />\nIf you will complete your first two years of<br />\nand have not had ROTC training, you now have a special<br />\nopportunity to earn an Army officer's commission in the next<br />\ntwo years. You can qualify to fulfill your military obligation as<br />\nan officer while you study for a college degree in a field of<br />\nyour choice. ,<br />\nThrough a new two-VeiF Army ROTC program—you- will<br />\nreceive leadership training and experience that will be valuable assets for the rest of your life, in either a military or a<br />\ncivilian career. You will receive an allowance of $40 each<br />\nEcontn during your Junior and Senior years. If you desire, yoke<br />\n<br />\nmay request postponement of yout military service while yoti<br />\ncomplete your studies for a graduate degree.<br />\nMost large business and industrial firms prefer the college<br />\ngraduate who has been trained and commissioned as an<br />\nofficer—who has the ability to organize, motivate and lead<br />\nothers—and who has had experience in accer,iting responsk<br />\nbilities beyond his years.<br />\nYou owe it to yourself to investigate this irinportant op'<br />\nportunity.<br />\nFor complete information on the new two-year Army RO'T'<br />\nprogram see the Professor ot Military Science on carripu<br />\n<br />\nThe Making of the President<br />\n<br />\n1960. In the meeting by which a<br />\nVice-Presidential candidate was<br />\nchosen, there was a disagreement<br />\nas to whether the candidate<br />\nshould be knowledgeable in<br />\ndomestic or foreign policy. Governor Stratton of Illinois said:<br />\n\"You can say all you want to<br />\nabout foreign affairs, but what's<br />\nreally important is the price of<br />\nhogs in Chicago and St. Louis.'<br />\nNixon declared, \"If you ever let<br />\nthem the Democrats) campaign<br />\nonly on domestic issues, they'll<br />\nbeat us—our only hope is to<br />\nkeep it on foreign policy.\"<br />\nTheodore White relates a<br />\nmemorable speech of Nixon's at<br />\nPeachtree Street and Hurt Park<br />\nin Atlanta, Georgia on August<br />\n26, 1960. Nixon said, \". . May<br />\nI turn now to what I believe is<br />\nthe overriding issue confronting<br />\nu.s in this election campaign..<br />\nYou know what it is. Look at<br />\nthose boys sitting around that<br />\npool. We want those boys to<br />\ngrow up in a world of Peace<br />\nwithout Surrender. (Applause)<br />\nBecause we can have the best<br />\nsocial security program and the<br />\nbest health program and the<br />\nbest job that anybody can possibly imagine and it Isn't going<br />\nto make any difference if we're<br />\nnot around to enjoy it. . . I sapto you today that there is no<br />\nman in the world who has had<br />\nmore experience and who has<br />\nshown more ability to deal with<br />\nthe Communist leaders across<br />\nthe conference table than the<br />\nman I trust will be the next<br />\nVice-President, Henry Cabot<br />\nLodge, our representative at the<br />\nU.N. .. .\" (White, p. 323-4) Republican leaders should dust off<br />\nthose 1960 Nixon speeches about<br />\nPeace without Surrender and<br />\nthen ask for the people's vote in<br />\n1966 and 1968.<br />\nAuthorized Jeweler For<br />\n<br />\nLungines Wiiinauer<br />\nBulova and<br />\nWyler Watches<br />\n<br />\nROETH'S<br />\nJewelers and Opticians<br />\nEstablished 1910<br />\n<br />\n3120 Greenmonnt Avenue<br />\nBalti,,,,,re 18, Marylen41<br />\nBEhnont 5-9561<br />\nWATCH REPAIRING<br />\n<br />\nMOM Si<br />\nOf course you can<br />\nget a cash loan!<br />\n•Our 'flew LOANS TO<br />\nSTUDENTS SERVICE is.<br />\ndesigned especially for you.<br />\n•Monthly repayments will<br />\nbe arranged to suit yout<br />\nparticular circumstances.<br />\n•Stop in or 'phone.<br />\n<br />\nbe glad to serve you.<br />\n<br />\nRitterlinance4<br />\n313 N. HOWARD ST.<br />\n<br />\nARMY ROTC<br />\n<br />\nBALTIMORE<br />\n<br />\nPhone SA 7-7880<br />\nHours: Hoes., Tues., Weds. 948<br />\nThurs. 11-8: Fria. 94<br />\n<br />\n\fNEWS-LETTER<br />\n<br />\nPKNEWOOD, BALTIMORE, APRIL 29, 1966<br />\n<br />\n•<br />\n<br />\nPAGE SEVEN<br />\n<br />\nYesterday, you may have had a reason<br />\nfor missing a good,nourishingbreakfast.<br />\nToday, you don't<br />\n<br />\n;<br />\n<br />\nNow you can have<br />\nnew Carnation<br />\ninstant breakfast<br />\n-makes milk a meal<br />\nthat's too good to miss.<br />\n<br />\nEach glass delivers as much protein as two eggs,cXJ as much mineral nourishment as two strips of<br />\nand even Vitamin C—the<br />\ncrisp bacon, ei<ZW more energy than two ekes of buttered toast,<br />\norange juice vitamin.<br />\n<br />\nit comes in a lot of great flavors, too. Look for them In your cereal section,<br />\n<br />\n\fPAGE EIGH1<br />\n<br />\nNEWS-LETTER<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 29, 1966<br />\n<br />\nFrosh Nine Seeks<br />\nTo Shake Slump<br />\n<br />\n'<br />\n<br />\nBy JIM SLOAN<br />\n<br />\nHarford Junior College and were<br />\nWinless in three attempts, the bested, 1-6. Again their effort<br />\nhapless freshman baseball team was plagued by poor hitting and<br />\ncontinues to be plagued by poor fielding errors.<br />\nhitting and fielding.<br />\nBoth teams were scoreless durThe inability to capitalize on ing the first three innings, but<br />\nscoring opportunities led to their Harford managed to pick up one<br />\ndemise when they met Frederick run on a lone double in the<br />\nfourth. The Hop nine threatened<br />\nHigh School on April 21.<br />\nIn<br />\nthe fifth and at several other<br />\nFrederick sported a fine pitcher and also looked strong both times in the game, but they were<br />\nin the field and at the plate. unable to combine their hits into<br />\nWith respect to his squad's ef- any scoring rally.<br />\nfort, frosh mentor Dave Blizzard<br />\ncommented that the nine's fielding has improved although the<br />\nhitting is still poor.<br />\nLast Tuesday the nine hosted<br />\n<br />\nHopeful of combining good<br />\npitching with improved hitting<br />\nand fielding, the frosh journey<br />\nto Glen Burnie High School for<br />\nan away game this afternoon.<br />\n<br />\neaVieipaacience<br />\n(Continued from Page 5)<br />\nthose Germans who tolerated the<br />\nNazis' inhuman crimes, was<br />\naimed specifically at the demonstrators' convictions. It was immaterial to the specific charge<br />\nunder which the students were<br />\nconvicted.<br />\nThe bench should be a place<br />\nfrom which justice is administered according to the law, not<br />\nas plice from which a particular judge by virtue of his privileged position may attempt to<br />\npreach and popularize his own<br />\nparticular beliefs at the expense<br />\nof the beliefs of others.<br />\nDennis M. Sweeney<br />\nEditors Note: Mr. Sweeney's<br />\nletter also appeared in the April<br />\n27th issue of the Baltimore Sun.<br />\n<br />\nNo Joke<br />\n<br />\nNothing<br />\ncan take the press out of Lee-Prest slacks<br />\nNot that it's on his mind right now. And it needn't be. Those LeeIPrest Leesures can't help but stay crisp and neat. No matter what you<br />\nPut them through. They have a new permanent press.So the crease stays<br />\nin. The wrinkles stay out. Permanently. And that's without ironing. No<br />\ntouch-ups,either. They're made from Lee's special blend of 50% polyester.<br />\nAnd 50% combed cotton. For wash and wear...with conviction.<br />\nIncidentally, that permanent press is the only change we've made<br />\nin Leesures. They still have that lean, honest look...smart, tailored fit.<br />\nNew Lee-Prest Leesures. Test their permanent press yourself. It isn't<br />\nmecessary, but it's great way to spend an evening. From $6.00 to $8.00.<br />\n-<br />\n<br />\n;<br />\n<br />\n•<br />\n<br />\nLee-PResrLeesurese<br />\n14. D. Lee Company, Inc., Kansas City, Mo. 64141. ALSO AVAILABLE IN CANADA.<br />\n<br />\nTo the Editors:<br />\nThe Kline article (April 1,<br />\n1965) shot through with half<br />\ntruths, generalizations, and typical Radio Moscow phrasing, suggests little more that the frustrating mewlings of a small boy<br />\nwhose father has forced him to<br />\nstop using crayons on the walls.<br />\nEither as a statement of SDS<br />\npolicy or as a factual account of<br />\nthe Waverly incident it fails<br />\nmiserably.<br />\nMr. Kline, the breadth of your<br />\nknowledge is truly astounding.<br />\nYou seem to be an expert on the<br />\ninner workings of the modern<br />\nAmerican corporation; you have,<br />\nno doubt, worked in top management positions for a number<br />\nof years. You profess to have<br />\nfirst hand information on our<br />\nforeign policy; undoubtedly Dean<br />\nRusk calls you in regularly for<br />\nprivate briefings. And your firsthand account of what really goes<br />\non in Vietnam is truly remarkable, particularly for one who<br />\nobjects violently (oops, sorry,<br />\nnon-violently) to being sent<br />\n<br />\nthere; how many months have<br />\nyou spent in Vietnam as an onthe-spot observer? Lawyer, economist, foreign affairs expert,<br />\npolitical scientist, management<br />\nconsultant, war correspondent:<br />\nhow wonderful to have all this<br />\nin one so young!<br />\nAh, but there is a fly in the<br />\nointment; the true hoppie liberalarts-well-rounded-etc.<br />\noutlook<br />\nseems to be missing! Have you<br />\nvisited the ghetto that is East<br />\nBerlin, Mr. Klein? Have you<br />\ntalked with the refugees from<br />\nthe Hungarian massacre of 1956?<br />\nHave you been corresponding<br />\nregularly with any of our men<br />\nin Vietnam? Or is this to be considered just a typical Wall Streetcapitalist-inperialist - aggressor propaganda, something that just<br />\nisn't done by Loyal SDS members? How is it that we never<br />\nsee SDS protest any wars but<br />\nthose in which SDS member!.<br />\nmay have to fight?<br />\nLet's be serious, Mr. Klein. TI-w<br />\nguys over there are fighting<br />\nnot to preserve our \"economic<br />\nspheres of interest\" (I presume<br />\nyou mean by that that our corporations have huge holdings in<br />\nrice paddies?) — but to keep<br />\nthe boat from rockIng while you<br />\nget on your soap box and<br />\nsquawk about what they're doing. They're fighting to preserve<br />\nthe rich American system which<br />\nnow feeds, clothes, teaches,<br />\nhouses, and pleasures you-the<br />\nsame system you are castigating.<br />\nBluntly, you're living as a leech<br />\non their labors—which is pretty<br />\ndisguisting in itself — but to<br />\nhave you protest their labors<br />\nwould be ridiculous were it not<br />\nso revolting.<br />\nRichard Oles<br />\nEditors note: Mr. Oles is<br />\ncoach of the Fencing team.<br />\n<br />\nK4DRAT\"<br />\nMIFF<br />\n<br />\nLEE-PREST LEENS AVAILABLE AT:<br />\n<br />\nADLER'S<br />\n<br />\nWANTED - LEFT HANDERS<br />\n<br />\n(Greenmount & 33rd St.)<br />\n<br />\nIf you're left handed and<br />\ninterested in why dials and<br />\nmachine controls move the<br />\nway they do—we'd like to pay you to test how<br />\nsouthpaws set dials compared to right handers.<br />\n<br />\nYOUR SPRING SHOPPING HEADQUARTERS<br />\n<br />\nJust sign up at AMES 242 for a convenient fime. It will<br />\ntake about an hour and you'll be paid $1.50 for your time.<br />\n<br />\n3240 GREENMOUNT<br />\n<br />\nCOMPLETE SELECTION<br />\n<br />\nProfessor A. Chapanis<br />\n<br />\n\fPAGE NINE<br />\n<br />\nNEWS -LETTER<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 29, 1966<br />\n<br />\nNetrnen Upend Loyola<br />\nTo Score Triple Play<br />\n<br />\nTHE<br />\n<br />\nBy JOSH TREEM<br />\n<br />\nAy JED LUCHOW<br />\nSports Editor<br />\na<br />\nin<br />\nsports,<br />\nIntramural<br />\nrather peculiar way, got a tremendous boost on Tuesday<br />\nafternoon, The Tau Epsilon<br />\nPhi fraternity, that's right the<br />\nTEP's here at Hopkins, defeated the blond jocks of Beta<br />\nTheta Pi in lacrosse by a score<br />\nof 7-6.<br />\nTEP, a nationally known<br />\njock house, though otherwise<br />\nregarded on this campus, went<br />\nwinless in football and was<br />\nonly able to eke out a victory<br />\nin their last basketball game,<br />\nha.s put together a remarkable<br />\nlacrosse squad. Only last week<br />\nthe TEP's put together another<br />\nfine effort against a strong<br />\nteam from Phi Sig, losing by<br />\none goal in overtime.<br />\nA New TEP<br />\nSitting at dinner on Tuesday.<br />\nI sensed something in the air<br />\nas a small motorcade of returning TEP's came roaring down<br />\nCanterbury Road making rather<br />\ncrude gestures as they pasted<br />\nthe Beta house. It seems that<br />\nthe TEP's finally decided to<br />\nshow us all what they're able<br />\nto do. \"It was really a team<br />\neffort\"; this was about the only<br />\nintelligible remark I could get<br />\n<br />\nOrientation<br />\nMembers of the freshman,<br />\nsophomore and junior classes<br />\nwho wish to serve on the 1966<br />\nOrientation Committee should<br />\npick up applications at the<br />\nAdmissions Office. Completed<br />\napplications must be in by<br />\n4:00 on May 6.<br />\n<br />\nfrom their over-joyed athletic<br />\nmanager.<br />\nAlthough it was perhaps a<br />\nteam effort, certain individuals<br />\nshould be cited for their efforts.<br />\nThese are: goalie Jerry Leveck.<br />\nattackman George Alapas, Midfielder Ham Easter, and John<br />\nSarney who plays both defense<br />\nand mid-field. The TEP's have<br />\nbeen practicing almost every<br />\nday for these tough games en<br />\ntheir schedule and it paid off.<br />\nWhy a Boost?<br />\nEarly in the season the B.I.A.<br />\nwas troubled with the problem<br />\nof very unbalanced leagues. It is<br />\nobvious that some houses have<br />\nteams than<br />\nstronger<br />\nmuch<br />\nothers. But, this was not the<br />\nproblem. When a team saw itself<br />\ndefeated 65-16, in basketball for<br />\nInstance, it was difficult for<br />\nthem to get a team out the next<br />\nweek. Fortunately, throughout<br />\nthe season there were only a<br />\nminimum number of games forfeited but this, I think, can only<br />\nbe written off as lucky.<br />\nNow, perhaps, we owe a<br />\nthanks to the brothers of TEP<br />\nfor showing us that interest,<br />\nabove and beyond athletic abilities, can win games too.<br />\n<br />\n111111111111111•••<br />\nGOOD THINGS COME<br />\nAND GOOD TIIINGS GO<br />\nBecause the good food at the<br />\nHarry Little Carry-Out Shops<br />\nMake it so!<br />\n<br />\nAfter<br />\nupending Gettysburg<br />\nCollege 5-4 on April 20, the varsity netmen picked off defending<br />\nMason-Dixon champs Loyola,<br />\n1 2.<br />\n5/<br />\n2-3/<br />\n1<br />\nThe victory, Hopkins' third in<br />\na row and third in three days,<br />\nboosted their season record, 3-3,<br />\nand their conference record to<br />\n2-1.<br />\nThe Loyola victory, the first<br />\nover the Greyhounds in four<br />\nyears, was highlighted by a four<br />\nset sweep of the two completed<br />\ndoubles matches and the overpowering singles play of Bob<br />\nChilders. The first doubles team,<br />\nSorrow and Childers, dumped<br />\nthe Loyola duo of Tontz and<br />\nMeyer, 6-1, 6-4, rallying in the<br />\nsecond set after being down 2-4.<br />\nTie for First<br />\nThe victory lifted Hopkins into<br />\na first place tie with the Greyhounds, who had been previously<br />\nunbeaten. Still not prophesiz-<br />\n<br />\nsoundly<br />\nBaltimore<br />\ntrounced<br />\nPoly 8-1, on April 19. The foh<br />\nlowing day, they suffered their<br />\nfirst loss, 6-2, at the hands of<br />\nGilman. However, they rebounded strongly and polished<br />\noff Forest Park 9-0. First sinBronstein, and<br />\ngles, Nabby<br />\nsecond singles, Mike Marcus,<br />\nBaby Netmen<br />\nMeanwhile, the Baby Jays were cited for their fine play<br />\nfinally opened their season and in all three matches.<br />\n<br />\ning a potential conference title.<br />\nCoach McDermott did state<br />\nnext<br />\nof<br />\nthe<br />\nwinner<br />\nthat<br />\nmatch<br />\nreturn<br />\nWednesday's<br />\nagainst Loyola will most likely<br />\nMasonyear's<br />\nbecome this<br />\nDixon Northern College Division champions.<br />\n<br />\nTHE SERENDIPITY SINGERS<br />\nSaturday, May 21, 8:30<br />\nAt DAR CONSTITUTION HALL<br />\n18th mod C Sts., N.W., Washington, D. C.<br />\n<br />\nTickeis: $1.80, 2.50, 3.50, 4.25, 4.75<br />\nTalbert Ticket Agency, Willard Hotel, Washington, D. C.<br />\nMail orders accepted, send self-addressed stamped envelope.<br />\nPhone NA 8-5575, NA 8-4420.<br />\n•••••<br />\n<br />\nge,<br />\n<br />\n..<br />\n..0$44341<br />\n1<br />\nHeading for the beach this vacation? Don't bring losable cash. Bring First National City travelers checks. You<br />\ncan cash them all over the U.S. and abroad. But their big advantage is a taster refund system.<br />\n<br />\nHARRY LITTLE<br />\nCorry-Out SHOPS<br />\n407 East 32nd Street<br />\n111 111111<br />\n<br />\n11111•<br />\n<br />\nGEORGE WEIN presents<br />\n<br />\nThe Newport Festivals<br />\nThe Newport Jazz Festival<br />\nJuly 1,2, 3,4, 1966<br />\nFour evening concerts; Friday, Saturday, Sunday, Monday. Three afternoon<br />\nMonday. Featuring: Count Basic, Ruby Brett,<br />\nSunday,<br />\nconcerts; Saturday,<br />\nDave Brubeck, John Coltrane, Miles Davis, Duke Ellington, Ella Fitzgerald,<br />\nDizzy<br />\nGillespie, Woody Herman, Herbie Mann,<br />\nGetz,<br />\nBud Freeman, Stan<br />\nThelonious Monk, Jimmy Smith, Joe Williams, and many others.<br />\nEvenings: $3.50, 4.50, 5.50 Afternoons; $3.00<br />\n<br />\nOther travelers checks<br />\nare every bit as good as<br />\nFirst National City Bank's<br />\n<br />\nThe Newport Opera Festival<br />\n<br />\n.<br />\n<br />\nJuly 12, 13, 14, 15, 16, 1966<br />\nPresenting the Metropolitan Opera Company of New York. Major stars,<br />\nChorus, and Orchestra in four operas in concert performance and five<br />\nafternoons of musical workshops, panels, and lectures.<br />\nWednesday, CARMEN<br />\nThursday,(rain date)<br />\nTuesday, LA BOHEME<br />\nSaturday, AIDA (Sunday, rain date)<br />\nFriday, LUCIA DI LAMMERMOOR<br />\nEvenings: $3.50, 5.50, 7.50 Afternoons: $2.00<br />\n<br />\nFIRST NATIONAL CITY BANK<br />\n<br />\nFor Information, write Newport Jazz, Opera, or Folk Festival. For tickets<br />\nspecify dates and Festival. Make checks payable to the specific leslival you<br />\nplan to attend.<br />\nFor accommodations, write the Newport Chamber of Commerce, Newport,<br />\nRhode Island 02840.<br />\nIf you're age 12 through 21, you can fly to the Newport Festivals for half<br />\ntare on American Airlines, creator of the American Youth Plan, via<br />\nProvidence, R. I. To become eligible, Just send $3.00 with the coupon below<br />\nand receive your Youth Plan ID, plus a free copy of AA's Go Go American<br />\nwith $50 worth of discount coupons.<br />\nAmerican Airlines Youth Plan<br />\n633 Third Avenue<br />\nNew York, N. Y. 10011<br />\n<br />\nSIM DATE<br />\n<br />\nCOLOR OF<br />\n<br />\nCOLOR OF HAIR<br />\n<br />\nEYES<br />\n<br />\n•••4<br />\n<br />\nSIGNATURE<br />\n<br />\n20<br />\n<br />\nv.*<br />\n. .<br />\n<br />\nyttx,re,<br />\n<br />\nTTIO<br />\n<br />\nNTY_JICIVP4L.AIRS \"K4-4-<br />\n<br />\nSPECIAL DISCOUNT: deduct 20% from the list price of tickets for all<br />\nconcerts if purchased by mail before May 15th.<br />\n<br />\nSTATE<br />\n<br />\n,<br />\n<br />\nwimp a-roavs cuovitracY<br />\n<br />\n.<br />\nJuly 21, 22, 23, 24, 1966<br />\nFour evening Concerts; Thursday, Friday, Saturday, Sunday, Three All-Day<br />\nWorkshops; Friday, Saturday, Sunday.<br />\nFeaturing: Theo Bikel, Oscar Brand, Brownie McGee and Sonny Terry, Judy<br />\nCollins, Bob Dylan, Jack Elliott, Mimi and Dick Farina, Platt and Scruggs,<br />\nCarolyn Hester, Bessie Jones, Phil Ochs, The Pennywhistlers, Jean Ritchie,<br />\nGrant Rogers, Burly Sainte-Marie, Howling Wolf, and others.<br />\nEvenings: $3.50, 4.50, 5.50 All Day Workshops: $2.00<br />\nnedeaki.<br />\n<br />\nADDRESS<br />\n<br />\nmiiar.ia<br />\n<br />\n123-456-789<br />\ntmk,<br />\n<br />\nThe Newport Folk Festival<br />\n<br />\nNAME<br />\n<br />\n,.<br />\n<br />\nIYMOICIIMpuilleMINONORP•sho...44<br />\n.11.1.0•11.11.411V1.4101,11.401.4.....111<br />\n1<br />\n101.0.00.141.00411110....10.0%waroa.1111.0111.Paw.<br />\n.4<br />\nW<br />\n<br />\nC.<br />\n<br />\n'WOW<br />\n<br />\n4:8000.03008.: I. 31.567890<br />\n<br />\n...until you lose them!<br />\nOther leading travelers checks, like First<br />\nNational City travelers checks, can be cashed<br />\nall over the world.<br />\nBut if you think all travelers checks are alike,<br />\nyou may be in for a rude shock if you should<br />\nlose your checks.<br />\nWith other leading travelers checks,elaborate<br />\nand time-consuming inquiries often have to be<br />\nmade. It may be days—even weeks—before you<br />\nget your money back. Who wants to wait?<br />\nBut, if you lose First National City travelers<br />\n<br />\nchecks,you don't have to worry.There are more<br />\nthan 20,000 places around the world authorized<br />\nto give you a fast refund—right on the spot!<br />\nFirst National City travelers checks come from<br />\nthe leader in world-wide banking, and have<br />\nbeen in use over 60 years. They are known and<br />\naccepted in more than a million shops, hotels,<br />\nrestaurants, air terminals, etc., the world ovest<br />\nNext time you travel, insist on First National<br />\nCity travelers checks.<br />\nThey cost just one cent per dollar.<br />\n<br />\nZIP<br />\n<br />\nFirst National City BankTravelers Checks<br />\n<br />\nsold by banks everywhere<br />\n11411411re<br />\n<br />\nrrontm. DEPOSIT INSURANCE coney...on<br />\n<br />\n\fNEWS<br />\n<br />\nsp<br />\n<br />\nPAGE TEN<br />\n<br />\nRTS<br />\nNEWS -LETTER<br />\n<br />\nRelay Mark<br />\nAlmost Falls<br />\nBy GARY SMITH<br />\n<br />\nBy JOHN M. BRICKMAN<br />\n<br />\nteam,<br />\ntrophy-winning<br />\nThe<br />\ndoomposed of Jack Loomis, John<br />\nflopka, Forrest Chumley, and<br />\nKevin Murphy, won in a time of<br />\n18.51, only 5.6 seconds off the HOPKINS' varsity<br />\neindermen cheer on anchorman Kevin Murphy<br />\nrecord. If Hopkins had been after victory in Mason-Dixon Relays.<br />\npressed during the race, the mooed would most likely have toppled, but the Hopkins runners<br />\nwere not even pushed to their<br />\nVictory.<br />\n<br />\nDiamonders Out To<br />\n<br />\nCostello Wins<br />\nGeorge Costello notched the<br />\nonly win for Hopkins — a first<br />\nUn the 440 in a very respectable<br />\n52.2. Pete Rowny took second in<br />\nthe high jump with a career<br />\nhigh of six feet. He would have<br />\nwon the event except for the fact<br />\nthat he had more misses than<br />\nhis opponent, who also jumped<br />\nsix feet. Bo Walker and Cliff<br />\nCyr also piled up points for the<br />\nJays, each placing in two events.<br />\n<br />\nA<br />\nBy MIKE PHILLIPS<br />\nA surprise winner last Saturday, the varsity baseball team<br />\ngets a chance to show home fans<br />\nthis was no fluke when it hosts<br />\nWashington at noon tomorrow.<br />\nSlated to pitch for the Jays<br />\nIs the recently-resurgent Amy<br />\nMichelson, while Jim Elder, a<br />\nstandout in last week's upset,<br />\nwill be held in reserve. The only<br />\nother home game remaining is<br />\na makeup contest with Franklin<br />\nand Marshall on May 12.<br />\nA form reversal of major proportions occurred a week ago,<br />\nas Ursinus, 3-0 in Southern<br />\nDivision M.A.C. play, fell victim<br />\nto a then winless Hopkins club<br />\nby a 5-4 score.<br />\nEarly Lead<br />\nThe Homewood squad took a<br />\nfirst inning lead when Gene Lin-<br />\n<br />\nPlebe Tangle On Tap<br />\nFor Frosh Stickers<br />\nBy JED LUCHOW<br />\nWith four straight victories to<br />\ntheir credit, the freshman laorosaers meet the Plebes at the<br />\nNaval Academy this afternoon at<br />\n3:30 P.M.<br />\nFollowing a 9-1 win over St.<br />\nPaul's this past Tuesday, the<br />\nBaby Jays went out to scrimmage the varsity stickers for another sixty minutes of exercise.<br />\nIn the St. Paul's game John<br />\nGorczyk made four goals, Charlie<br />\nGoodell two, Cliff Barton one,<br />\nWill Scroggs one, Jim Feely one,<br />\nand Phil Buck three assists.<br />\nAdds to Middies<br />\nThe starting line-up was the<br />\nsame but coach Fewster made a<br />\nfew changes on the second midfield. Barton, who had seen<br />\nlimited action in the Bainbridge<br />\nand Severn games, scored first<br />\nIn this game. Artie Guerin, the<br />\nother addition, showed tremendous speed and great improvement in his stick handling.<br />\n<br />\nKAWASAKI<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 29, 1966<br />\n<br />\nTen Angles In<br />\nOn Army Upset<br />\n<br />\nA team composed of four Hopkins varsity distance runners<br />\nwon the four mile relay in near<br />\nrecord time at last Saturday's<br />\nMason-Dixon Relays, held at<br />\nGallaudet College in Washington.<br />\n<br />\nWhile these four stars were<br />\ncompeting in the relays, the rest<br />\nof the varsity trackmen were<br />\nlosing a triangle meet to Dickinson and Ursinus. The weekend<br />\n1 2 points comJan piled up 25 /<br />\npared with 80 and 561<br />\n/<br />\n2 for Dickinson and Ursinus. respectively.<br />\nThis showing with a depleted<br />\nteam, however, was a lot better<br />\nthan the Jays did last year with<br />\n• full squad.<br />\n<br />\nLETTER<br />\n<br />\nGoalie John Kelly looked great<br />\ndespite a cold in the back. All<br />\nseason long he has given the defense enough added confidence<br />\nfor them to turn in equally fine<br />\nperformances. Mike Clark showed<br />\ngreat hustle against the city's<br />\ntop scorer by not only holding<br />\nhim scoreleg but allowing him<br />\nonly five shots.<br />\nNew Goalie?<br />\nKelly had seven saves in the<br />\ngame but he was taken out in<br />\nthe last three minutes to ease<br />\nhis back. Mid-fielder Scroogs<br />\nthen went into the net and came<br />\nup with a save himself.<br />\nPsych for Two<br />\nWith only two games left, the<br />\nability of the Baby Jays will<br />\nreally be tested. They face a<br />\nwell-conditioned but less skilled<br />\nPlebe team today and then face<br />\neven tougher competition from<br />\nthe Maryland frosh in one week.<br />\nThat game will be played in College Park at 3:30 P.M.<br />\n<br />\n9<br />\n<br />\nfors swatted a 430 foot double<br />\nto left and was singled home bY<br />\nSoph third baseman Mike Shaw.<br />\nThis state of affairs lasted until<br />\nthe fourth, in which a double by<br />\nJim Celli and singles off the<br />\nbats of Ray Wier, Shaw, and<br />\nJerry Moore produced three<br />\nmore tallies.<br />\nTransplanted outfielder - firstbaseman Elder, meanwhile,<br />\ncruised along with a no-hitter<br />\nfor the first seven innings, the<br />\nonly Ursinus score coming on ct<br />\nmisfired pickoff play with runners on first and third in the<br />\nfourth.<br />\nShowers in Eighth<br />\nWith one out in the eighth,<br />\nthe Bear bats finally got going.<br />\nA double and two successive<br />\ntriples sent Elder to the showers, and the tying run scored on<br />\na miraculous over-the-head bunt<br />\nof a high pitch by reliever Michelson on a suicide squeeze play.<br />\nNot about to let their chance<br />\nget away, the Jays soon set<br />\nthings right in the ninth. Michelson led off with a walk, Calli<br />\ngot a bunt single, and Lindfors'<br />\nattempted sacrifice resulted in a<br />\nforce at third. Then Shaw, who<br />\nwent four for five, delivered a<br />\nsingle to left that scored Celli<br />\nin a close play at the plate.<br />\n<br />\nlacrosse game ever played in the<br />\nThe varsity lacrosse team tries Yale Bowl.<br />\nto make it two lasses in a row<br />\nNavy Tops Temps<br />\nfor Army at 2:30 P.M. tomorrow,<br />\nThe Jays were idle last Satbefore a Big Weekend crowd on urday, and many Hopkins fans<br />\nHomewood Field.<br />\ntraveled to College Park, where<br />\nThe Black Knights, who lost Navy defeated Maryland, 11-9.<br />\nto Yale 12-8 last weekend, come Both teams showed weaknesses<br />\nin with a 3-1 record previously at midfield and defense, but Jim<br />\nhaving defeated Hofstra, Prince- Lewis' play at attack, along with<br />\nton and Rutgers. Coach Jim a strong game from Owen Mc\"Ace\" Adams' all-junior starting Fadden, put the Middies on top.<br />\nattack lists 6' 2\", 185 lb. Chris Maryland scored six times on exPettit; Ray Enners; and prob- traman offense, and Terp atable creaseman, 6' 2\", 200 lb. tackmen Jack Heim and Alan<br />\nLowe each finished with three<br />\nWarren Dempsey. On the first midfield are cap- goals and an assist.<br />\nIn last Saturday's other key<br />\ntain Frank Kobes, letterman<br />\nGlynn Hale, and either Dave college game, Brown beat PrinJones or Gordon Rankin. Run- ceton, 11-3, and now needs only<br />\nning on the second midfield will a win over Cornell to take the<br />\nbe Larry Izzo, John Mayer, and Ivy League crown.<br />\neither Don Dietz or Dan Ryan.<br />\nLast year at West Point, HopThe third unit consists of Loyola kins beat, 6-3, now the Jays are<br />\ngrad Ed Sullivan, Ed Beck, and 4-3, and looking for 5.<br />\nSevern graduate Bob Kesmodel.<br />\nSchwartz on Defense<br />\nFootball end Tom Schwartz, at<br />\n6' 3\", 220 lbs.: 6' 2\", 210 lb. Dan<br />\nGooding; and 6' 2\", 190 lb.<br />\nBrian Utermahlen, an All-Maryland pick at Poly; comprise the<br />\nMoadawnsia Mali<br />\ndefense. Don Workman is a<br />\nLA 3-8080<br />\nprobable starter in goal. He is<br />\nbacked by Towson High grad<br />\nOpen iivelf mi911<br />\n.<br />\nFred Thomas.<br />\nSome 2,000 fans — a huge<br />\n\"YOUR WILSON STORE<br />\nrowd for lacrosse in New<br />\nIN BALTIMORE\"<br />\nHaven — watched Yale beat<br />\nArmy last weekend, in the third<br />\n<br />\nCHARLEY RUDO<br />\nSPORTING GOODS<br />\n<br />\nHopkins students, new and old, try:<br />\n<br />\nPecora's Restaurant<br />\nfor the finest Italian food in town<br />\n3320 Greenmount Ave.<br />\nSPAM!ETTI ME A LS<br />\n<br />\nCARRY OUT SERVICE<br />\n<br />\nPIZZA PIE A SPECIALTY<br />\n<br />\nCALL 889-3831<br />\n<br />\n•Coce-Cole\" end \"Coke\"ore righted Irods-markt which Identity only the product of The Coca-Cola Company<br />\n<br />\nNow<br />\nthere's a<br />\ndouble-date.<br />\nEt*s<br />\n<br />\nI.<br />\n<br />\nSport Cycles<br />\nSALES - PARTS - SERVICE<br />\n85 CC 125 CC I50 CC 17500<br />\nSTREET AND TRAIL MODELS<br />\n650 CC — 59 H.P.<br />\n260 cc — 38 H.P.<br />\n<br />\nSCH WING<br />\nMOTOR CO.<br />\n<br />\n86 CC — 4 SPEED — 8,2<br />\nLuggage rack, Set up, Shopipialt,<br />\nTool Kit, Turn Signals<br />\n<br />\n3326 KESWICK RD. CH 3-1304<br />\n<br />\nPrices Start at $379 Total<br />\n<br />\n4 Blocks West of Carnpus<br />\n<br />\n8 TO 17 HP MODELS<br />\nCOMING SOON<br />\n<br />\nCoca-Cola adds extra fun to dating—single or double. That's because Coke has<br />\nthe taste you never get tired of<br />\nalways refreshing. That's why things go better<br />\nwith Coke...after Coke...after Coke,<br />\nltotord under the outho4fy of The Coca-Cola Company by,<br />\n<br />\nTHE COCA-COLA BOTTLING CO.. BALTIMORE, MD.<br />\n<br />\n\f", "format": "basic_html", "processed": "1141<br />\nVOL. LXX, NO. 25<br /><br />\nNam ;Irma ***<br /><br />\n70TH YEAR<br /><br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND, APRIL 29, 1966<br /><br />\nShriver Sets<br />\nJazz, Ballet<br />\nTwo cultural events, running the gamut of musical<br />\nOxperience from jazz to ballet, will take place this<br />\nWeekend in the person of Dave Brubeck and the Balt/it/lore City Ballet Company.<br />\nThe Dave Brubeck Quartet will play their gig tonight at 8:30 in Shriver under the sponsorship of the<br />\n1/ICA and the Junior Class. Brubeck, to many the<br />\nMainstay of progressive jazz, has garnered international acclaim in recognition for his contribution to<br />\nlaze.<br />\nThe Baltimore City Ballet will present their program<br />\nat classical and modern dance Sunday night at 8:30'<br />\nP.M. also at Shrivel.. The five-year old company congists of 25 dancers and is Baltimore's only dance organization.<br />\nThe Ballet group appearing Sunday will include<br />\nvisiting artists from the Metropolitan Opera and Manhattan Festival Ballet Companies. The production will<br />\nbe under the direction of Danny Diamond.<br />\nJazz buffs tonight will be treated to improvisation<br />\nend polyrhythms. Brubeck believes that improvisation<br />\nIs the heart of jazz. Brubeck thinks that jazz can be<br />\nWritten, and that ultimately the dividing line between<br />\nClassical music and jazz will disappear.<br />\nThe Brubeck Quartet is well known for its successes<br />\nIn the Time series of albums, \"Time Out,\" \"Time<br />\nPurther Out,\" and \"Count Down Time in Outer<br />\nSpace.\" It IS in these recordings in which the jazz<br />\nstsartet experiences polyrhythms.<br />\nAlong with Brubeck will appear Paul Desmond on<br />\nidto sax, Joe Morello as percussionist, and Gene<br />\nWright on bass. Brubeck pounds on the piano. Each<br />\nitl( the other members of the Brubeck Quartet are famous in their own right.<br />\nThe program to be presented to ballet lovers Sunday<br />\nWill include several Brahms waltzes, described by Diamond as \"romantic in style and feeling, and classicai<br />\nIn technique.\"<br />\nAlso presented will be Children's Corner by Claude<br />\nDebussey, seen as \"classical ballet with some modern.<br />\nOne is stylized and contrasted against a more modern<br />\none,\" explains Diamond. The Jazz Suite done to the<br />\nmusic of Robert Prince and a period piece by Mozart<br />\nWill round out the program.<br />\nDiamond describes romanticism as a form in ballet<br />\nma characterized by toe dancing and white filmy<br />\ndrosses. \"Poses and forms are important in this kind<br />\nOf dance.\" Naturalism is described by Diamond as<br />\n4'people doing as they really do. It is a rebirth of expression, but for a whole group rather than one<br />\ndancer.\"<br />\nModern dance is seen by the director of the Baltimore City Ballet Company as a \"reaction to the impulse of the music. The different eras of the dance is<br />\nsimply a philosophical difference. Modem dance is a<br />\nresult of meaning inside the dancer rather than Victorian representation of the romantic.\"<br />\nTickets for the ballet are available at the YMCA<br />\noffice and Fred Walker's Music Store for $1, $1.50,<br />\nand $2.<br /><br />\n\"B. Fenster\"<br />\nDated for May<br />\nTheatre Hopkins will close its season on May 12<br />\nWith William Snyder's The Days and Nights of Beebee<br />\nFenstermaker to be presented in the Barn.<br />\nThe play, which ran off-Broadway for one year<br />\nduring the 1962-63 season, received wide acclaim as<br />\none of the best contemporary American plays. Richard<br />\nGilman, writing in Commonweal. states that it is<br />\n\"informed by an acute sense of what it means to be<br />\nalive at this moment in this place; that is to say now.<br />\nIn America, where the meaning of existence is fuzzier<br />\nDOW than almost anywhere else.\"<br />\nThe role of Beebee will be portrayed by Jane Singer.<br />\na member of the new professional company at the<br />\nWashington Theatre Club. Miss Singer has appeared<br />\nthis year in John Dos Passos' U.S.A.. Anouilh's Romeo<br />\nand Jeanette and in the musical Ernest in Love.<br />\nAlso appearing will be Elsa Rowel, the wife of a<br />\nstudent at Hopkins and herself a graduate of the Yale<br />\nDrama School.<br />\nIrvin Turner will follow up his Theatre Hopkins<br />\nroles in The Killer and Do You Know the Milky Way,<br />\nas the Iruterviewer in the Snyder play.<br />\nThe play will be directed by Ed Golden, Jr., with<br />\nsets by James Edmund Brady. The production will run<br />\nMay 12-15 and May 19-22. Tickets cost $2 and are<br />\navailable at the Public Relations Office in Shrivel',<br /><br />\ndThyd<br />\nz%Vgingir liovxntO<br /><br />\nBig Weekend<br />\nRun Down<br />\nBy GERALD BRECHER<br /><br />\nTonight the Big Weekend begins. That's right Hop.<br />\npies, THE BIG WEEKEND!! Four this afternoon, at<br />\nLevering, the prelims are scheduled. Up and coming<br />\nyoung musicologist Dave Brubeck leads what promises<br />\nto be a most exciting discussion of that peculiarly<br />\nAmerican folk music idiom known as Jazz. This extravaganza, sponsored by the junior class, will be<br />\nfollowed later this evening with the Y.M.C.A. sponsoring Brubeck in concert; putting his fingers where<br />\n• his mouth was.<br />\nEveryone will probably be at the Homewood Field<br />\nat 2:30 Saturday to watch the Varsity Lacrosse team<br />\nbeat on the Black Knights of the Hudson—known to<br />\nthe uninitiates as Army. Though the grim visage of<br />\nprohibition still rears its ugly head in the stands, the<br />\nnatural excitement and interest generated by the fast<br />\nmoving sport will keep the fans at a fever's (if only<br />\na dry fever) pitch.<br />\nLater that evening though, the crowd can indulge<br />\nits yearnings for nectar and ambrosia at , the Big<br />\ndra.•<br />\nWeekend Dance, sponsored graciously for us by the<br />\nStudent Council. This, the social event of the year,<br />\nwill be held in the Gym from nine in the evening until<br />\none in the Morning. Tommy Vann and the Echoes, and<br />\nWilly and the Hand Jives will let loose the smoothly<br />\nIn celebration of the 1966 Spring Weekend the<br />\nstrum strains of their melodic music for the diversion<br />\nNews-Letter thoughtfully provides a camouflage<br />\nand excitement to vibration of the expected large<br />\nlabel to cut out and paste on bottles of Pikescrowd. Set-ups will be available. O.K. Hoppies? Sound<br />\nvine Rye. The glue will be included in next weeks<br />\nIssue.<br />\nfine to you guys? Real swinging, huh? It sure Is.<br />\nYes sir, here at Hopkins High they certainly have<br />\n=M1<br />\nWPM=<br />\noutdone themselves this time. This must be the most<br />\nexciting, new and different and wonderfully imaginative weekend in memory. We should really all vote one<br />\ngreat and large cheer (Bronx style) to those magnificent men in their flying machines, the Student Council; and also to the gifted hierarchy (whoever that<br />\nmay be this week) of the junior class for treating us<br />\nwith what is, surely the most pitifully inadequate,<br />\nsorry excuse for a weekend in the whole realm of dull<br />\nweekends.<br />\nBy JOE WEINBERG<br />\nNot that we don't appreciate the effort boys. We<br />\nknow how you all are just dying to bring back the<br />\n\"The Difference\" committee closed its fund raising<br />\ndrive today with the comiletion of the solicitation of<br />\nthe undergraduate body. As of last Tuesday, a total of<br />\n$6,000 had been raised. Further donations will be accepted by the Financial Aid Office in Maryland Hall.<br /><br />\n!<br /><br />\nL<br /><br />\nDifference<br />\nHits $6,000<br /><br />\nThe reported figure includes an anonymous $1,000<br />\ndonation received this week, a $1,000 contribution from<br />\nthe Biophysics Department, and approximately $1,500<br />\nin proceeds from The Boys from Syracuse. The figure<br />\ndoes not include pledges. Final figures will be published<br />\nIn next week's News-Letter.<br />\nThe committee, under the co-chairmanship of Barbara Ellis, a graduate student in Chemistry, Thomas<br />\nCarpenter, and Dr. Philip Hartman of Biology, expects the final total to be higher than the original<br />\ngoal of $8,000. Dr. Hartman sent a letter to his faculty<br />\nsolicitors indicating that the committee hoped to be<br />\nable to raise $12,000, and thus send three underprivileged students to Hopkins rather than two.<br />\nStudent Contributions Low<br />\nThis opthnism is due to the fact that the bulk of<br />\nthe contributions so far have come from relatively few<br />\nsources. Only five departments in the faculty have<br />\ncontributed on an organized basis, Biology, Romance<br />\nLanguages, Biophysics, Chemistry, and Philosophy.<br />\nThe Humanities and Social Sciences have not as yet<br />\nresponded to the solicitations. Students themselves<br />\nhave contributed very little, with only $1,000 coming<br />\nfrom students, and most of these contributors have<br />\nbeen graduate students.<br />\nThe lack of undergraduate participation is partly<br />\nattributed to the fact that the undergraduate solicitation was delayed until this week.<br />\nThe letters that were to be distributed to the offcampus students could not be given out. The Post<br />\nOffice has recently refused to allow the stuffing of the<br />\nmail boxes in Gilman Hall. All mail must have a name<br />\nand box number on it, and the committee did not have<br />\nthe manpower necessary to perform this task.<br />\nSandy Cohn, who recently took charge of undergraduate solicitation, is expected to take action in the<br />\nnear future to increase the student participation on<br />\nthe drive.<br />\n\"Syracuse\" Contributes<br />\nLast weekend's performance of The Boys from Syracuse aided the drive. In addition to donating the proceeds of the show to \"The Difference\" fund, the show<br />\nalso entertained .ft hundred inner-city high school<br />\nstudents Friday night.<br /><br />\nThe Dave Brubeck Quartet rests after recording<br />\ntheir most recent hit record; Take Five.<br />\nglory days from High School, and that a great deal of<br />\nG.0.-like effort has been spent recreating just the<br />\nproper atmosphere and spirit here at what some people<br />\nthought was a University. I guess we were wrong.<br />\nHonest Injun, guys, can't you do any better? Just<br />\nhow many yews is Dave Brubeok going to have to<br />\nplay the same saccharine music at Hopkins weekends<br />\nbefore anyone gets tired of it? It would be too much<br />\nto ask for someone who has something significant to<br />\nsay—like Ornettet Coleman, maybe? Or John Lewis?<br />\nOr Milt Jackson? Or Miles Davis? But no: this, I<br />\nimagine, would require a modicum of imagination,<br />\nvision even; and this, one can bet any ranch on, is<br />\none thing of which we can be sure the talented organizers of this weekend have not even the -slightest<br />\nconception. No, we must have Brubeck. It's like an<br />\nunwritten law, a gospel from the mount. Brubeck, they<br />\nsay, is cool. Ergo, here he comes to Hopkins. Home of<br />\ncool. (Suggestion Student Council: rent yourselves out<br />\nas air-conditioners for the summer.)<br />\nBut that dance. Grrr! If that isn't the most<br />\nludicrous collection of no-talent, no-name, no-nothing<br />\nperformers I have ever heard of—come to think of it,<br />\nhas anyone ever heard of these people? Or are they<br />\nanother of these Baltimore wonder bands from Hollywood Park? As usual, the dance can be expected to<br />\nbe the already worn out cliche Johnny horror show<br />\nwith more drunks (and unseemly drunks to boot) to<br />\nthe square inch than any place outside the Central<br />\nJail.<br />\nI don't know; is this really fun? Someone must<br />\nthink so. Does anyone think so?<br /><br />\nPAGE TWO<br /><br />\nNEWS -LETTER<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 29, 1966<br /><br />\nAnalysis<br />\nEarp Presidency Ends<br />\nEn Election Controversy Run-Off S.C. Election<br />\nCalled Unnecessary<br /><br />\nThe Student Council substituted National Bohemian at<br />\n3230 Abell Avenue for the usual<br />\ncoffee in the \"J\" Room to commemorate the end of the Earp<br />\nregime last Monday evening.<br />\nMore than anything else, perhaps, the outgoing and incoming<br />\ncandidates will remember the<br />\nElection Committee's unexpected<br />\nannouncement that the election<br />\nreturns were not valid, as a result of a tie that had been discovered for the positions of<br />\nsophomore class representative<br />\nam. sophomore class president.<br /><br />\nmission has recently been busy<br />\nfitting its 98 applicant's into 8<br />\navailable positions, and President Milton S. Eisenhower has<br />\ntaken an active role in investigating fraternity hazing and the<br />\nastounding<br />\nfees<br />\nthe<br />\nplant<br />\nmanager charges groups using<br />\nHopkins facilities. The Council<br />\nannounced that it is awarding<br />\nthe Gilman Trophy to Mr. John<br />\nSynodinos, of the Committee of<br />\nSpecial Events, for the contributions his work has made to undergraduate life.<br /><br />\nWoe Tail<br />\nThe Elections Committee then<br />\nrevealed a tale of woe. Until<br />\nthis moment, everyone on the<br />\nCouncil and the few students<br />\nwho cared thought that Mark<br />\nSteinberg had won the class<br />\npresidency from Jack Kirk by<br />\none vote last week, and likewise that Bruce Resnick had dispossessed Bud Bozarth from his<br />\nMeanwhile the Honor Com- position as class representative<br />\nfrom the class of 1968 by one<br />\nI We need your head in our<br />\nvote. But alas, Clements' Committee uncovered one \"ballot\"<br />\nbusfness<br />\nwhich had not been counted previously because of an irregularity.<br />\n3120 St. Paul St.<br />\nA fate would have it, the elecAcross from Eddies<br />\ntor cast one ballot for Jack Kirk<br />\nOutgoing President Shelley<br />\nEarp, commenting on the Council's achievements during the<br />\npast year, remarked that this<br />\nwas the first time anyone could<br />\nremember that the Council had<br />\nnot only spent all its money but<br />\nwiped out the contingency fund<br />\nas well.<br /><br />\nSt. Paul Barber Shop<br /><br />\nand one for Bud Bozarth. The<br />\nElections Committee unanimously recommended that the Council hold run-off elections for<br />\nBy PETER HAAS<br />\narrived and ruled the Alapas<br />\nboth offices. All the candidates<br />\nLast Monday evening the out- ballot invalid because it was not<br />\nconcerned felt this was fair ex- going Student Council met to<br />\nan official ballot cast at a proper<br />\ncept Resnick, who exclaimed, turn control over to the Council\"What! You can't expect me to elect. The Elections Committee, time. The remaining ballots were<br />\ngo through a whole week more however, surprised everyone by counted that evening, and Resof campaigning! This is unfair\" recommending that run-off elec- nick and Steinberg were declared<br />\nEarp explained that the can- tions be scheduled next Monday winners, each by one vote.<br />\ndidates do not officially a.ssume and Tuesday for the position of<br />\nSubsequently<br />\nan<br />\nunknown<br />\noffice until the report of the junior class president and for<br />\nElection Committee has been one of the positions of junior person informed Alapas that his<br />\nclass representative, because ties ballot had been defenestrated,<br />\nadopted by the Council.<br />\nRegarding this arrangement, existed for each position between so to speak, and called Jack Kirk,<br />\nJack Kirk and Mark Steinberg,<br />\nwho referred the matter to Doyle<br />\nEarp opined: \"This is justice.\"<br />\nand between Bruce Resnick and<br />\nSmith, a member of the Elections<br />\nDoyle Smith recommended that<br />\nBud Bozarth respectively.<br />\nCommittee. Over the weekend<br />\nnext year's Committee make the<br />\nAll four candidates acquiesced Smith asked Clements to call a<br />\nvoting procedure more explicit.<br />\nto the Council's decision to ac- meeting of the Committee to deBozarth approached Resnick to<br />\ncept the Committee's recommen- cide the matter. The Committee<br />\nask him if they could speak about dation, although Resnick<br />\nsaw fit<br />\nthe matter. Resnick retorted, to call on Dennis Clements, held a privy meeting in Clements'<br />\nbedroom during the first few<br />\n\"I'd rather not.\"<br />\nchairman of the Committee, at minutes of the regular Council<br />\nAbove the din senior class pres- 1:30 a.m. Tuesday morning to<br />\nmeeting and voted 4-0 to count<br />\nident-elect Jim Mongiarclo an- Inquire about Clements' personal the Alapas<br />\nballot on the grounds<br />\nnounced that the Junior Class Interests in the matter.<br />\nthat an official Council member<br />\nPicnic will not be held because<br />\nFollowing are the facts behind had assured him that his vote<br />\nthe proprietor of Beaver Dam the fiasco.<br />\nwould be counted. His ballot<br />\nwill not allow Negroes. The<br />\nOn Tuesday, April 19, George created the two ties which now<br />\nCouncil unanimously voted to Alapas approached Ken Bond, a necessitate the run-off election.<br />\nsend a letter of protest.<br />\nCouncil member, in the dormiIt is unfortunate that the<br />\nBill Fteinsch was installed as tory cafeteria about 5:00, and candidates had<br />\nto learn of the<br />\nthe new president. Sandy Cohn informed Bond that he had an mess so long after the<br />\nelection<br />\nwas elected vice-president by ac- engagement at 5:15. The polls and without any warning. It<br />\nofficially<br />\n5:15.)<br />\nopen<br />\nwere<br />\nto<br />\nat<br />\nclamation. The new secretary is<br />\nwould be easy to accu.se Ken<br />\nDave Wirtz, and Jan Mongiardo Bond expressed his inaccurate Bond of incompetence and the<br />\nwill chair the Social Committee. belief that the polls probably Elections Committee of twoshould have been opened at 5:00, facedness, but it would probably<br />\nand directed Alapas to write be more accurate to blame the<br />\nA Favorite Render Wu<br />\ndown the names of those candi- confusion on the inadequate pubfor Hopkins Men<br />\ndates for whom he wished to licity given the election. The<br />\nJIMMY WU'S vote and to sign it, whereupon Elections Committee's posters<br />\nBond countersigned and assured announcing the election were<br />\nNEW<br />\nAlapas: \"As a member of the often difficult to read, and the<br />\nCHINA INN<br />\nElections Committee, I'll see that committee failed to be sure<br />\nthat<br />\nCharles Street below 25th<br />\nyour vote will be counted.\" the News-Letter was adequately<br />\nAlapas voted for Jack Kirk and informed of the election parJIMMY WU'S<br />\nBud Bozarth. This all transpired ticulars. Recognition must also be<br />\nCARRY OUT SHOP<br />\nbefore 5:10.<br />\n1411 E. Cold Spring Lane<br />\ngiven to the perverted individuals<br />\nA few minutes later Clements who removed the election<br />\nannouncements from the dormitories and to the 52% of the<br />\nsophomores class which couldn't<br />\nbe bothered to vote.<br />\nAt DAR Constitution Hall<br />\nAnd still, it's not too late.<br /><br />\nThe amazing NINA SIMONE<br />\n18th and C St., N.W. Washington, D.C.<br /><br />\nSAC<br /><br />\nFriday, May 6 - 8:30 P.M.<br /><br />\nAll Sophomores Interested<br />\nIn applying to the Student Activities Commission should<br />\nsubmit their names, box numbers, and class schedules to<br />\nBox 907 by Friday, May 6.<br /><br />\nTickets: $1.80, 2.50, 3.50, 4.25. 4.75<br />\nTalbert Ticket Agency, Willard Hotel, Washington. D.C.<br />\nMail orders accepted, send self addressed stamped envelope.<br />\nPhone NA 8-5575, NA 8-4420.<br />\n••••••-••-•••••-••••• •• • • •• •••••••••••••••••••••••••.•••••••••••••• •<br />\n• ••••<br />\n•<br /><br />\nBooster Club<br />\nThe Booster Club has six<br />\npositions for freshman and<br />\ntwo at-large positions open.<br />\nApplications for interviews<br />\nare due in Box 789 by May 2.<br /><br />\nSUMMER JOBS<br />\nUNDER AMERICAN FORESIGHT'S UNIQUE<br />\nGUARANTEED INCOME PROGRAM<br />\nYOU CAN EARN<br /><br />\nRx Rx Rx Rx Rx Rx Rx Rx ltx Rx<br /><br />\nDON'T FORGET<br />\nMOTHER'S DAY<br />\nMAY 8<br /><br />\n$1,000 To $2,500<br />\nWITH NO PREVIOUS EXPERIENCE<br />\nQUALIFICATIONS:<br />\n1. You must have a car.<br />\n2. You must live within these areas:<br /><br />\nmasculine<br />\n...that's the kind of aroma she likes being close to. The aroma of Old Spice.<br />\nCrisp, tangy, persuasive. Old Spice ...<br />\nunmistakably the after shave lotion for<br />\nthe untamed male. Try it soon ...she's<br />\nwaiting.<br />\n1.25 &amp; 2.00<br /><br />\nOr Within 50 Miles of:<br />\nSpringfield, Massachusetts<br />\nBoston, Massachusetts<br />\nProvidence, Rhode Island<br />\nNewark, New Jersey<br />\nPhiladelphia, Pennsylvania<br />\nBaltimore, Maryland<br /><br />\nCome and Learn About This Terrific<br />\nSummer Job Opportunity<br /><br />\n...that's the way it is<br />\nwith Old Spice<br /><br />\nTHURSDAY, MAY 5<br />\nOtelcOice<br /><br />\nSHULTON<br /><br />\nMassachusetts<br />\nRhode Island<br />\nWestern Connecticut<br />\nNew Jersey<br />\nEastern Pennsylvania<br />\nDelaware<br />\nMaryland<br /><br />\n2:00 P.M.—Placement Office, '100 Whitehead Hall<br />\n4:00 P.M.—Placement Office, 100 Whitehead Hall<br /><br />\n04<br />\n14<br />\n•<br /><br />\n4<br /><br />\n—we hare a<br />\ncomplete assortment<br />\nof Mother's Day Cards 0<br />\nand Gifts<br /><br />\nH<br />\nH<br />\n• Greenway Pharmacy .1<br />\ng<br /><br />\nr<br /><br />\nCharles and 34th Sts.<br />\nRx Rx Rx Rx Rx Rx Rx Rx Ex Ra<br /><br />\nSeats still available on special Johns Hopkins flight to<br />\nGermany. Leaves on June 15<br />\nfrom NYC, returns on Sept.<br />\n6. Open to all students, faculty, and employees. $360.<br />\nCall Mrs. Haynes, Jenkins<br />\nHall, HO 7-3300, Ext. 429.<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 29, 1966<br /><br />\nTwo Concert Series Campus Parking<br />\nAt J.H.U. Next Year Prob. Examined<br />\nBy TIM OLIVER<br />\nHalf the subscriptions to the<br />\n1966-67 Hopkins concert series<br />\nhave been sold to students, faculty and alumni, and sales will<br />\nsoon be opened to the public.<br />\nConcert lovers will be offered an<br />\nadditional treat by the annual<br />\nBaltimore Chamber Music Society series.<br />\nThe University series, of six<br />\nconcerts supported by the Elizabeth Sprague Coolidge Foundation, will run, except for one<br />\nconcert, Sundays in Shriver Hall.<br />\nThe Chamber Music Society<br />\nseries, featuring, as in seasons<br />\npast, artists of international<br />\nfame in programs of both standard and contemporary works,<br />\nwill be held Sundays at 3:30 in<br />\nthe auditorium of the Baltimore<br />\nMuseum of Art.<br />\nUniversity Series<br />\nThe Shriver series will open<br />\non November 13 with the Julhard String Quartet, called by<br /><br />\nBrody to Give<br />\nLabor Speech<br /><br />\nthe Times \"the very model of<br />\nmodern string quartet playing at<br />\nits best.\"<br />\nJean-Pierre Rampal and Robert Veyron-Lacroix, the French<br />\nflute and harpsichord duo who<br />\nreceived ten curtain calls and a<br />\nstanding ovation from a capacity audience last year, will return<br />\non December 18.<br />\nMieczyslaw Horszowski, acclaimed by Newsweek as \"the<br />\nleast known of the world's great<br />\nPianists,\" and who has accompanied many great musicians, including his old friend Pablo<br />\nCasals, will appear in concert on<br />\nFebruary 26.<br />\nQuartetto Italiano<br />\nThe Quartetto Italiano, to<br />\nwhich the Times attributes \"intensity and beauty of sounds so<br />\ngreat as to seem larger than life<br />\nand fill the auditorium easily,\"<br />\nwill come on March 12.<br />\nThe fifth concert will feature<br />\nthe great Russian cellist Mstislav<br />\nRostropovich at the Lyric Theatre on Wednesday, April 19.<br />\nSubscribers will return to<br />\nShriver for the, final concert,<br />\nfeaturing the Virtuosi di Roma<br />\nand directed by Renato Fasano,<br />\non April 30. According to the<br />\nChicago<br />\nTribune, \"The<br />\nmen play for Fasano as if their<br />\nlives hung in the balance . . .<br />\nVirtuosi is no idle word picked<br />\nto look well on a poster.\"<br /><br />\nDr. David Brody, associate<br />\nprofessor of history at Ohio<br />\nState University, will deliver . a<br />\nlecture on the rise of American<br />\nlabor today at 4:00.<br />\nThe lecture, scheduled for delivery in the new classroom<br />\nChamber Series<br />\nbuilding, is entitled 'The Growth<br />\nThe opening concert of the<br />\nof the Labor Movement: Sources<br />\nArt Museum series on October<br />\nof Restraint and Expansion.\"<br />\nDr. Brody is one of four speak- 23 will present the Trio Flauto<br />\ners on the evolution of American Dolce (recorder, bassoon and<br />\npolitical parties, corporations, harPsichord) with Jean Hakes,<br />\nlabor movements, and the mili- soprano, in a program of Barotary establishment in a lecture que music.<br />\nseries here.<br />\nStockholm Quartet<br />\n- Under the auspices of The<br />\n19 will bring the<br />\nFebruary<br />\nthe<br />\nJohns Hopkins Center for<br />\nStudy of Recent American His- Stockholm Kyndel String Quartory, the James Schouler lec- tet with the great Swedish<br />\ntures will interpret 'The Chang- guitarist Per-Olaf Johnson. The<br />\ning Nature of American Institu- program will include Bartok's<br />\ntions in the Twentieth Century.\" fourth string quartet with reDr. David Brody, the Schouler marks by Sandor Veress of the<br />\nlecturer on the American labor Peabody Faculty.<br />\nmovement, earned his doctorate<br />\nSubscriptions for the five<br />\nat Harvard University in 1958 Museum concerts may be oband subsequently has written tained from the Music Centre<br />\nthree books about labor, Steek Concert Bureau (LE 9-3100).<br />\nworkers in America, The ButchSubscriptions for the six Shriver<br />\ner Workmen, and Labor in Crisis:<br />\nconcerts may be obtained from<br />\nHe is currently writing a history<br />\nRelations Office (467of labor during the New Deal. the Public<br />\nThe lecture is open to the public. 6382) for six dollars.<br /><br />\nPAGE THREE<br /><br />\nNEWS-LETTER<br /><br />\nThe campus parking problem<br />\nremains a perplexing one which<br />\nhas yet to be solved. There are<br />\napproximately eight thousand<br />\ncampus authorized vehicles for<br />\nsome one thousand parking<br />\nspaces.<br /><br />\nThis situation is alleviated<br />\nsomewhat by the fact that 5800<br />\nof the parking permits are issued to night students, but the<br />\npermits issued to day students,<br />\nfaculty, employees, and guests<br />\ntax the present parking facilities.<br /><br />\nCampus Notes<br />\nSpring Glee<br />\nThe annual Spring concert of<br />\nthe Hopkins Glee Club and the<br />\nHopkins Orchestra will feature<br />\nparts two and three of Handel's<br />\n\"Messiah\". The concert will also<br />\nfeature the voices of the Mary<br />\nWashington College Choir and<br />\nthe solo voices of Laurie Kopec,<br />\nsoprano; Ralph Marquis, Tenor;<br />\nand Frank Whitmore, bass.<br /><br />\nTau Tutors<br /><br />\nIn an effort to provide interThe University created the ested students with majors in the<br />\nCampus Traffic and Parking<br />\nCommittee several years ago to<br />\nstudy the situation.<br />\nBesides issuing permits, the<br />\ncommittee must maintain the<br />\nparking lots and enforce its regulations. The committee makes<br />\nregulations it feels are necessary<br />\nfor the safety of the campus<br />\ncommunity. The blocking of<br />\nroads creates a fire hazard, prevents the passage of emergency<br />\nvehicles and hinders delivery of<br />\nnecessary supplies.<br />\nThe committee does not have<br />\nthe funds to investigate the<br />\nproblem of increasing the parking facilities. The university<br />\nauthorized the hiring of a professional planning service to investigate this problem. The report of this group is expected in<br />\nthe near future.<br /><br />\nPART-TIME<br />\nIIELP WANTED<br /><br />\nengineering sciences an opportunity to become more intimately acquainted with the courses<br />\noffered in engineering, the members of Tau Beta Pi will offer a<br />\nspring advising service.<br /><br />\nPublic Events<br />\nAll organizations planning<br />\nto sponsor public events during the 1966-67 year should<br />\nsend representatives to the<br />\nmeeting of the Social Committee of the Student Council<br />\non Thursday, May 5 at 4:00.<br /><br />\nHARLEY'S<br />\nFAMOUS SANDWICH CREATIONS<br />\nGREENMOUNT AT 32nd<br /><br />\nNo. 1 for 18 Years<br />\nALSO<br /><br />\nTHE CHILI BOWL<br />\n32nd &amp; OLD YORK ROAD<br /><br />\nCustom Sound installation work.<br />\nContract bards through Hummer. Egperience necessary. SA 7-2077.<br /><br />\nDRAFT DEFERMENT<br />\nTESTS<br />\nThese books will help you prepare 'for the<br />\nSelective Service Qualification Tests. You<br />\nmay take'this test only once. Be prepared!<br />\nBarron's How to Prepare for Student<br />\n$2.95<br />\nDraft Deferment Test<br />\nScore High on Selective Service College Qualification Test<br /><br />\nThe Johns Hopkins Bookstore<br />\nGILMAN HALL 11<br /><br />\nHow to look good on any golf course: play it bold with Arrow's Mr. Golf, the Decton wash(<br />\nand wear knit that stays fresh and crisp to the eighteenth and beyond. Stays tucked-in,)<br />\ntoo. An extra-long back tail keeps down while you swing. Many<br />\nrrfo,<br />\nstandout colors, $5. Pick out a few at your Arrow retailers.<br /><br />\n,„,ARRo<br /><br />\n\"PAGE FOUR<br /><br />\nNEWS-LETTER<br /><br />\nallg Mins Wopktits News-EMIT<br />\nEditors-in-Chief<br />\nMelvin R. Shuster<br /><br />\nHenry J. Korn<br />\nBusiness Managers<br />\nAllan &amp;rile11<br /><br />\nWilliam Schenck<br /><br />\nExecutive Editor<br />\nGarth Mackenzie<br /><br />\nManaging Editor<br />\nMarshall Paul<br />\nAssociate Editors<br />\nRoger Toil<br /><br />\nGregory Altshuh<br /><br />\nNews Editor<br />\nPeter Koper<br /><br />\nArts Editor<br />\nChris Molloy<br /><br />\nFeatures Editor<br />\nHenry M. Hocherman<br /><br />\nPhotography Editor<br />\nJoel Crawford<br /><br />\nSports Editor<br />\nJed Ludlow<br /><br />\nCopy Editors<br />\nSteve Levinson<br />\nJos Weinberg<br /><br />\nContributing Editors<br />\nShe Katz<br />\nMike Phillips<br />\nNeil Grauer<br />\nPete Hass<br />\nRichard Hammond<br />\nRobert Blitzer<br />\n.Jim Sloan<br /><br />\nAssociate Staff<br />\n-----<br /><br />\nGraphics Editor<br />\n. News Editor<br />\n__...Asst<br />\n.<br />\nAsst. Photography Editor<br />\n-Advertising Manager<br />\n----Asst. Sports Editor<br /><br />\nReporters<br />\nNews: Mary Berg, Peter HilfUl, Colin Alcott, Dennis Massey, Sam Francis:<br />\nFeatures: Evan Wilson, Gerry Brecher: Sports: Iver Minded. Otis Seidel,<br />\nJosh Treern. Gary Smith, Jeff Lauren; Copy: Tim Oliver; Business: John<br />\nThornton, Merrill Egorin, Don Bierly, Ronald Ginsberg, Paul Smith,<br />\n•<br /><br />\nCurriculum Committee<br />\nThe current plight of undergraduate education at<br />\nHopkins is a well-established fact. Poor graduate instruction, insufficient course offerings in most departments, the small size of the teaching faculty, and incompetent advising have been lamented before. In the<br />\nrecently compiled Report of the Undergraduate Committee for Curriculum Studies, its authors have successfully laid bare the relationship between these problems<br />\nand the general Hopkins approach to education, also providing concrete suggestions for improving the situation.<br />\nBecause the departments are extremely graduatebriented, and due to the demands of the \"publish or<br />\nperish\" doctrine, the attention of the faculty is diverted,<br />\nnot unwillingly, from the undergraduate student body.<br />\nFurthermore, the Report states, \"proposals that the administration act to alter this imbalance involves a transgression of the traditional departmental autonomy. Most<br />\nfaculty members feel that such autonomy should remain<br />\nbecause it preserves the freedom of the scholar.\" Many<br />\nadministrators, we might add, go along with this philosophy.<br />\nWhile this approach embodies the \"uniqueness\"<br />\nof Hopkins, some modification is presently called for.<br />\nThe administration will he characteristicly slow to react, although the combination of the Schools of Philosophy and Engineering Science into one School of Arts<br />\nand Sciences suggests that interdepartmental communication could improve, facilitating changes in basic academic requirements and scheduling, and encouraging<br />\nthe establishment of more interdepartmental courses.<br />\nMore importantly, the administration could encourage<br />\nprofessors to teach more courses by awarding promotions to good teachers as well as by increasing their<br />\naalaries.<br />\nFor any real improvement to take place, however,<br />\nthe faculty in the various departments will have to<br />\nmodify their views in favor of increased teaching responsibilities. Only in this way can qualified and interested graduate students receive the opportunity to teach<br />\nspecialized courses in their particular fields, as has been<br />\nsuggested, thus helping to alleviate the shortage of<br />\ncourses. More thorough supervision and coordination<br />\nof graduate instructors also requires the belief by professors that the effort is worth it. There is no reason why<br />\nthe departments on their own cannot effect the necessary<br />\nchanges, if they are but willing to employ the current<br />\ndepartmental system more flexibly.<br />\nDealing with departments individually and directly<br />\nproved a successful approach to the Undergraduate<br />\nCommittee on Curriculum Studies in writing its report.<br />\nProfessors were both frank and at least open to ideas.<br />\nIn continuing to follow this approach, the Committee<br />\nmay find the departments more responsive to the suggestions proposed in its Report.<br />\nThe Committee itself currently hold ad hoe status,<br />\nview of its accomplishments to date, there seems<br />\nin<br />\nand<br />\nto he no reason to change it. Its greatest asset is the fact<br />\nthat it is composed of concerned and informed individuals. It would be a mistake to destroy its influence by<br />\nmaking it a political plum for either the Student Council<br />\nor the administration.<br /><br />\nI<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 29,<br /><br />\nMe<br /><br />\nlite alkonewaaci Scene<br />\nWEEKEND WEAKENED<br /><br />\nBy HENRY M. HOCHERMAN<br />\nIn h recent cover story, Time.<br />\nthe Weekly Newsmr gazine, proclaimed that London is the socalled \"city of the decade.\"<br />\nNothing could be further from<br />\nthe truth. Anyone who has been<br />\nto the Monumental City, the<br />\ngem of of the Chesapeake Bay,<br />\nscenic Baltimore, knows that she<br />\nand only she is the city of the<br />\ndecade.<br />\nToday marks the beginning of<br />\nthe Spring Weekend, and to<br />\nthose Hoppies who have brought<br />\ngirls to this wondrous city for<br />\nthe occasion, this reporter humbly offers a plan of things to see<br />\nand do in Baltimore.<br />\nFriday, April 29<br />\n6:00 P.M. Your date arrives at<br />\nPenn Station.<br />\n6:01 P.M. You go to the parking lot to find that your car is<br />\nsurrounded by fourteen other<br />\ncars.<br />\nmemorate the birthday of Oscar for exhibition of Nouvelle Vague<br />\n6:45 P.M. You get out.<br />\n7:00 P.M. Dinner,<br />\nMary's \"Flash\" Flashmayer, a friend of Jailhouse Art. Key on Plaster.<br />\nGrotto. (A small restaurant lo- John Birch.<br />\n10:30 P.M. Baltimore Civie<br />\n1:30 P.M. Calvert Street, to see Center for<br />\ncated off University Parkway,<br />\nInternational Trivia<br />\nhundred<br />\nfour<br />\nmembers<br />\nthe<br />\nof<br />\nreferred to by regulars as the<br />\nOpen. \"Trivs\" Brickman takes<br />\nUniversity Heights Improvement on fifteen world<br />\n\"Snack Bar\").<br />\ngrand masters.<br />\n8:00 P.M. Brubeck (go early Association sneer in silent con11:00<br />\nP.M.<br />\nFollowing<br />\ncondolfraternity<br />\ntempt<br />\nat<br />\nhouses.<br />\nfor seats).<br />\nence party for \"Trivs\" Brickman,<br />\n11:00 P.M. Leave Brubeck, just<br />\n1:31 P.M. Calvert Street to see<br />\nin time to see the changing of four fraternity men who ca.'e dramatic reading of Where the<br />\nBoys Are by Sally Fields in<br />\nthe guard in front of Polnitzky's enough to sneer back.<br />\nWyman Park.<br />\nJewelry Store, Baltimore Street.<br />\n2:00 P.M. Lacrosse, Army at<br />\n12:00 midnight.<br />\n12 midnight. Ceremony honor- Home.<br />\nSubmarine<br />\ning the twelfth anniversary of<br />\n4:30 P.M. Bluejay Victory Par- races in Loch Raven.<br />\nthe mugging of Lucifer Sforts on ade.<br />\n1:00 A.M. Tour of the Gait?.<br />\nGay Street, followed by a re5:00 P.M. Six minutes of sil- Only building in the world built<br />\nenactment of the scene by the ence in front of Recrutiing Sta- for the purpose of Burlesque and<br />\nGay Players.<br />\ntion at Greenrnount Avenue to never used for anything else.<br />\n1:00 A.M. Late Snack at Nate's honor Six who sat. (A mixer fol- George Washington slept there.<br />\nand Leons.<br />\nlows.)<br />\n3:00 A.M. Baltimore Harbor<br />\n2:00 A.M. Fort McHenry to<br />\n6:00 P.M. Dinner, the B and for the 16th annual whaleboat<br />\nsee three masked men attempt- M sub shop, Guilford. Horatio regatta and bagel roll.<br />\ning to lower flag over Ft. Mc- Niblet once ate tl.ere. No Mich4:00 A.M. Sleep.<br />\nHenry. One can be overheard elin rating.<br />\nSunday, May 1<br />\nsaying, \"We'll get it this year.\"<br />\n7:00 P.M. South Broadway to<br />\n12:00 Noon. Brunch, AchmudIP<br />\n3:00 A.M. Sleep.<br />\nsee the home of Fifi \"Chuckles\" Cave.<br />\nSaturday, April 30<br />\nLarue. George Washington slept.<br />\n1:00 P.M. Poetry reading in<br />\n12 noon. Rise. Brunch at the there.<br />\nfront of court house.<br />\nOpen Sewer, a little known diner<br />\n8:00 P.M. Dance.<br />\n1:30 P.M. Poetry reading In.<br />\non Twenty-Ninth Street. Mich9:00 P.M.<br />\nNorth<br />\nCharles side the courthouse.<br />\nelin gives it four stars.<br />\nStreet. Baltimore Department of<br />\n2:00 P.M. Penn Station and<br />\n1:00 P.M. Blackstone Phar- Public Works holding snow re- home.<br />\nmacy for a meeting of the Bal- moval drill.<br />\n2:01 P.M. You go to the parktimore Junior League to com9:30 P.M. Baltimore City Jail ing lot ...<br /><br />\nTHEATRE<br /><br />\n'Syracuse'Funny Despite Faults<br />\nThe Boys from Syracuse was a<br />\nfunny play. It was not great<br />\ntheater, it was not meant to be<br />\ngreat theater, but it was funny.<br />\nIt was an attempt on the part<br />\nof one group of people to cause<br />\nanother group of people to forget themselves for a moment and<br />\nlaugh out loud. It succeeded admirably. One can not ask more<br />\nof a musical comedy.<br />\nThe play can be criticized at<br />\nmany points. It was amateurish,<br />\nmany of the lines were trite,<br />\nslapstick cliches. Some of the<br />\nsongs were badly written, badly<br />\nsung. But the production made<br />\nno pretense of being professional, and the trite lines were those<br />\nof George Abbott, not Theatre<br />\nHopkins. The tone of the production was light, and it may be<br />\nsaid that those involved in producing the play viewed the task<br />\nof production and presentation<br />\nwith just the right degree of seriousness. Never does the play become 80 heavy handed, the actors<br />\nso engrossed in themselves that<br />\nthe primary object of the play,<br />\nhumor, is forgotten.<br />\nNone of the music can be described as great, but \"Falling in<br />\nLove With Love\" and \"This<br />\nCan't be Love\", come quite close,<br />\nand over the years have achieved<br />\n\"standard\" stature. \"The Shortest Day of the Year\" is one<br />\neverybody would rather forget.<br />\nIt can be said that the music<br /><br />\nis the weakest point of the proBonnie Kahn as Luce did itet<br />\nduction, there being little out- the joke, and so did everyone<br />\nstanding singing and little out- else. She was the classical<br />\nstanding to sing. The orchestra, shrew, a screaming, scolding<br />\na slightly overzealous drummer Xanthippe who sang well<br />\nand<br />\nnotwithstanding, made quite a screamed well, and who even<br />\ngood showing.<br />\nmanaged to elicit a little passion<br />\nThe acting varied in quality (but just a little) for her plight.<br />\nfrom very good to very mediocre, She caused everyone to<br />\nfeel<br />\neach character running the sorry for Dromio, who had<br />\nnot<br />\ngamut during his performance. the strength to feel sorry for<br />\nThe two Dromios, Conner and himself.<br />\nKahn can only be described as<br />\nRenay Lois was lovely, but in.<br />\ndelightful, while the sorcerer, convincing.<br />\nHer voice was good,<br />\nRick Wessler, can only be de- her<br />\npresentation excellent, but<br />\nscribed as magnificent. He com- she didn't<br />\nstrike one as the jealbined the charlatanry and humor ous wife<br />\nwhose husband is out<br />\nof sorcerers from Merlin to with<br />\nthe local courtesan. Not so<br />\nMandrake and appeared to float for her<br />\nsister who appeared for<br />\nthrough his part as if he firmly a moment,<br />\nif only for a moment,<br />\nbelieved that at any moment he to be in love.<br />\ncould turn himself into a basketBruce Fag in as the Merchant<br />\nball and go bouncing off the<br />\nwas good, but Bruce Fagin as<br />\nstage. He seemed the favorite of<br />\nthe gong ringer in the final<br />\naudience and company alike, and<br />\nhis appearance on stage Caused' scene was great. Without saying<br />\na smile to form in a little corner a word he managed to perform<br />\none of the funniest bits of bustof one's face and spread as he<br />\nness in the play.<br />\nmagically unfolded his bag of<br />\nThe scenery was well contricks. It was Wessler laughing<br />\nat the sorcerer and the soi•cerer* ceived and well executed. It VMS<br />\nlaughing at Wessler, and every- simple but not so simple that<br />\nthe viewer was in doubt as to<br />\none else was caught in fray.<br />\nThe Wex brothers as Anti- where a given scene was taking<br />\npholus (or is it Antipholae) place.<br />\nwere good, but not great. They<br />\nSyracuse claimed only to be a<br />\nsang well, but there was little funny play. This reporter hasn't<br />\nfeeling in their performances. laughed so much ;since Nixon<br />\nOne got the idea that they didn't ran for president.<br />\nget the joke.<br />\nH.M.H.<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 29, 1966<br /><br />\nNEWS.LETTER<br /><br />\nPAGE FIVE<br />\n-<br /><br />\neaue<br />\nJustice may be blind but she's<br />\nnot deaf.<br />\nRobert H. Hinton, Jr.<br />\nEditors note: Mr. Hinton's letter also appeared in the April 26<br />\nissue of The Baltimore Sun.<br /><br />\nLamdin Criticized<br /><br />\n4;4144.4.S.'<br /><br />\n1 Have 10 howls of<br /><br />\nce<br /><br />\nappeared in your story and edi- thavior at all times except durtorial.<br />\ning his discussion with the arIn your article, you state that resting officer.<br />\nWilson stated to Caleb DaRchI cannot say the game about<br />\nanel, also a Hopkins student, your editorial, which calls Judge<br />\nthat the arresting officer was Lamdin an idiot and implies he<br />\nan idiot. The testimony is dis- is illegitimately born. You can<br />\nputed whether the remark, which do no service to the Hopkins<br />\nundoubtedly was made was di- students whose \"town-gown\" afrected at the officer or Deschanel. fairs result in arrests, nor to<br />\nYou also state that Judge I. your newspaper, if you resort to<br />\nSewell Lamdin refused to hear diatribe in place of calm reason.<br />\ndiscussion on the details of the<br />\nSincerely yours.<br />\narrest and of Wilson's conduct.<br />\nH. Rutherford Turnbull, BA '59<br />\nThis is incorrect and Judge<br />\n(Formerly Editor-in-Chief,<br />\nLamdin heard the testimony of<br />\nNews-Letter)<br />\nthe arresting officer and the defendant and argument from<br />\nLamdin Benched<br />\ncounsel. I cannot remember the<br />\nTo the Editors:<br />\nJudge's exact words concerning<br />\nIn the conviction of the six<br />\nWilson's conduct, but I do reantiwar demonstrators I feel<br />\ncall his statement that, when he that an<br />\ninjustice was done in<br />\nwas a Hopkins student, he was that the demonstrators<br />\nwere<br />\ntaught to behave like a gentle- convicted of one charge while<br />\nin<br />\nman.<br />\nreality they were tried not on<br />\nConcerning your editorial, the any charge but on the validity<br />\noriginal sentence of $25.00 and of the belief which they held. It<br />\ncosts was never reversed nor was is likely that they are guilty<br />\nan appeal ever taken. After the under the provisions of the staNEW<br />\nhearing, I spoke with Judge tute concerning disorderly conLamdin in chambers and obtain- duct, but the fact that the judge<br />\nused the occasion to try to refute<br />\ned his assurance that he would<br />\ntheir beliefs to which he was<br />\nsuspend the imposition of senstrongly opposed throws doubt<br />\ntence and grant Wilson proba- on<br />\nthe validity of the reasons for<br />\ntion before verdict, so that Wil- convicting<br />\nthe students.<br />\nson's record can remain \"clean\"<br />\nThe poem praising soldiers re— he has never, in the eyes of cited by Judge Lanidin<br />\nAROMATIC SMOKING TOBACCO<br />\nhad<br />\nthe law, been convicted. I would nothing to do with the specific<br />\nlike to repeat that there is no charge at hand. It was • aimed<br />\nEnjoy a free full-size pouch of<br />\ndoubt but that Wilson stated rather at the convictions of the<br />\nBurgundy. An aromatic blend of<br />\nthat the policeman was an idiot; students. The quote used by<br />\nvintage tobaccos,fine taste and<br />\nhe also stated the situation was Judge Lamdin about \"my counpleasant wine aroma, for the<br />\ntry<br />\nright<br />\nor wrong\", besides<br />\nidiotic.<br />\nsounding<br />\nsmoothest<br />\nsmoke ever to come<br />\nlike<br />\nthe<br />\nrationale<br />\nof<br />\nIt is my opinion however, that<br />\nout ot a pipe. Clip the coupoR<br />\n(Continued on Page 8)<br />\nhe was not guilty of disorderly<br />\nnow. Cheers,<br />\nconduct, as charged.<br />\nIt seems to me that Judge<br />\nMI SO MN MI MI UN<br />\n1118 NS1<br />\nLamdin did budge; he granted<br />\nmy request for a revision of the<br />\nsentence. Wilson is to be commented for his conduct before<br />\nDOWN<br />\nthe Judge and for his good be-<br /><br />\nTo the Editors:<br />\nThe circumstances surrounding<br />\nthe recent trial of six students<br />\nfor protesting the war in Viet<br />\nNam led me to believe that Baltimore's judicial system is in need<br />\nLamdin Lambasted<br />\nof close scrutiny similar to that<br />\ndone recently for our police de- To the Editors:<br />\nOne wonders just what we are<br />\npartment.<br />\nfighting for in Vietnam if six colI found it most disturbing that lege students can be sentenced to<br />\nIn order to have benefit of the 60 days in jail for lying on the<br />\nnew bail-releaSe system one has pavement in front of a recruiting<br />\nto appeal to the prejudices of an office after<br />\nattempting to disassistant State's attorney who tribute anti-Vietnam-war literacan arbitrarily say no for no ture inside.<br />\nreason other than that he \"deVietnam is a serious and contests and dislikes the ideas\" that troversial problem and<br />\nthere is<br />\nthe defendant might \"stand for.\" certainly<br />\na need for some people<br />\nThe young men In question to protest and demonstrate. Dewere supposed to be on trial for monstration against Government<br />\ndisorderly conduct but Judge I. policies implies some civil disSewell Lamdin made it quite obedience; however, six students<br />\nClear, in his reported remarks, lying on a pavement does not<br />\nthat he convicted them because seem to be too much in excess of<br />\nof their views on the Vietnam \"the right of the people peacewar. I would like to hear how ably to assemble, and to petition<br />\nJudge Lamdin explains the re- the Government for a redress of<br />\nlevance of \"God and the soldier\" grievances.\"<br />\nto a charge of disorderly conduct.<br />\nThe court should have simply<br />\nJudge Lamdin used a quote concerned itself with six young<br />\nfrom Stephen Decatur that is of- college students lying on a paveten used to justify the suppres- ment, but it attempted to prosion of dissent about foreign poli- mulgate them a general condemcy when he said \"Our country! nation of anyone who attempts<br />\nIn her intercourse with foreign to demonstrate against our counnations, may she always be in the try's policies. This does not seem<br />\nright: but our country, right or to be the job of a Baltimore<br />\nWrong.\" It may be irrelevant, but Municipal Court of of any court.<br />\ninteresting, that Decatur was<br />\nPhilip Littman<br />\nEditor's Note: Mr. Littman's<br />\ndrinking at the time he made that<br />\nletter appeared in the April 27th<br />\ntoast.<br />\nissue of the Baltimore Sun.<br />\nA more relevant quote and one<br />\nthat says the anti-war movement<br />\nLaw and Lamdin<br />\nIs all about is a paraphrase of<br />\nTo The Editors:<br />\nDecatur's toast spoken by Carl<br />\nAs counsel for Evan Wilson, a<br />\nShurz, Senator from Missouri, in<br />\nHopkins student about whom<br />\na speech before the United States<br />\nSenate in 1872 when he said \"My you wrote in your columns on<br />\nMarch 25 and in your editorial,<br />\ncountry right or wrong! When<br />\n\"Budge,<br />\nJudge\" on April 22, I<br />\nright to be kept right. When<br />\nwould like to correct some of<br />\nWrong to be put right.\"<br />\nthe misstatements of fact which<br />\nIf the principles of personal<br />\nl'esnonsibility outlined at Nuremberg are truly a part of international law and morality and not<br />\nsimply justification for self-righteous vengeance, then the Schurz<br />\nconcept of patriotism<br />\nmust<br />\nDaily 8 A.M. to 6 P.M.<br />\nsuPnlant that of Decatur.<br />\nMon., Thurs., Fri. Till 8 P.M.<br />\nIf judges and assistant State's<br />\nattorneys are going to base their<br />\n\"WE WASH, DRY &amp;<br />\ndecisions on their reactions to a<br />\nSAME DAY SERVICE<br />\ndefendant's beliefs, then they<br />\nshould make a more open-minded<br />\nattempt to find out• just what<br />\nthese beliefs are and to underin by 9 a.m.... out by 3 p.m.<br />\nstand the person's motivation.<br /><br />\nWAVERLY LAUNDROMAT<br />\n3330 GREENMOUNT AVENUE<br /><br />\nFOLD\"<br /><br />\nSHIRTS—DRY CLEANING<br /><br />\nvintage Duluth<br />\n...on us!<br /><br />\nndy<br /><br />\nWelcome Parents<br /><br />\nTOWN<br /><br />\nHARVEY<br />\nHOUSE<br /><br />\nBaltimore's<br />\nFashionable Restaurant<br />\nCOCKTAILS - PIANO BAR<br />\nALL CREDIT CARDS HONORED<br /><br />\nLE. 9-3110<br />\n920 N. CHARLES<br /><br />\nI<br /><br />\nMN IMO NS ENI MK UN 111.1<br /><br />\nhen's<br />\nMEN'S WEAR<br />\n516 S. Broadway<br />\nNEW AND WE HAVE IT!<br />\nVAN HEUSEN \"417\" BUTTON-DOWN<br />\nIN PERMANENT PRESS<br />\nA PERMANENT PRESS sm<br />\nwrni POW...<br />\n',fur<br /><br />\n1,'Li I<br /><br />\ncloy it<br /><br />\nI I<br /><br />\n0'<br />\n4<br /><br />\n,<br /><br />\nor VLititpiity h!ik. No<br />\niTii) Pro inotii.,y orr<br /><br />\n. 1':<br /><br />\nVA.<br /><br />\nF-I E.<br /><br />\nS 1E<br /><br />\n,417\"<br /><br />\nCan you believe it? The same<br />\ngreat authentic buttondown has arrived in new<br />\nPermanent Press — complete with smooth \"V-Taper\" fit and the softest<br />\n'collar roll going. It was<br />\npressed the day it was made<br />\n' and it will never need pressing again. Come in and try<br />\nseveral from our new Van°.<br />\npress spring collection,<br />\n$6.00<br /><br />\nVAN HEUGEIt<br />\n,109impic p 11,61.11<br /><br />\n'<br /><br />\nPAGE SIX<br /><br />\nNEWS -LETTER<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 29, 1966<br /><br />\nREPUBLICAN BIAS<br /><br />\nThe Nixon Legacy: Circa 1966<br />\nBy GEOFFREY LEBAR<br />\nIt is clear now that the 1966<br />\nelections will in some way be a<br />\nreferendum on the Viet Nam<br />\nWar. Withdrawal or escalation<br />\nwill not be the main issue,<br />\nthough. Since all the Republican<br />\ncandidates will be patriotic<br />\nAmericans, their strategy will<br />\nnot be to undermine the war<br />\neffort. The issue will center<br />\naround what Ambass:sador Goldberg confusingly calls the \"credi-<br /><br />\nbility gap.\" In simple terms this<br />\nmeans one's confidence or lack<br />\nof confidence in the government's<br />\ndetermination to carry out a<br />\npolicy which it talks about.<br />\nThe limited war in South Viet<br />\nNam has lost much of its limited<br />\ncharacter. The supply of career<br />\nsoldiers, high school drop-outs,<br />\nand voluntary enlistees has been<br />\nused up. The tentacles of the<br />\ndraft have now extended to<br /><br />\nLOOKING FOR A GOOD<br />\nPLACE TO EAT?<br /><br />\nOPEN HOUSE<br />\nCOFFEE SHOPPE<br />\n227 W. 29th St.<br />\n3 blocks off campus<br />\nNear Howard<br /><br />\nNEVER CLOSED<br /><br />\nmany college seniors who were<br />\non their rightful way to graduate school. We have many such<br />\npeople at Hopkins. Thousands of<br />\nother students will be taking<br />\narmy scholastic tests to maintain<br />\ntheir IIS status. As more men<br />\nare touched by the war, a higher<br />\ninterest in our Viet Nam policy<br />\nwill develop.<br />\nRepublicans must be very<br />\ncareful and avoid reckless statements on this most serious international problem. Republicans<br />\nshould look back to the legacy<br />\nof the Eisenhower and Nixon<br />\nyears for advise on the war issue.<br />\nIn those 8 years, not only was<br />\npeace maintained, but where<br />\nlimited troop action was needed<br />\nIt was carried out with dispatch<br />\nand success (Lebanon). In situations where long term stalemate<br />\nwars or unbearable political<br />\ntensions would result, Eisenhower and Nixon restrained<br />\nthemselves (Hungary). John<br />\nFoster Dulles preached \"brinkmanship\" everywhere, but used<br /><br />\nnuclear weapons and bombs nowhere.<br />\nGeography and logistics are<br />\nworking against the U.S. in Viet<br />\nNam as well as internal political<br />\ntrouble. But these difficulties<br />\nshould have been assessed before<br />\nthe first U.S. adviser was killed<br />\nthere in December, 1961. Obviously many mistakes were<br />\nmade, especially concerning the<br />\nDiem government. As the Republicans fielded a candidate in<br />\n1952 who was able to end conflict in Korea in an honorable<br />\nfashion, so they may again in<br />\n1968.<br />\nIronically in the Presidential<br />\ncampaign of 1960, Richard Nixon<br />\nchose to stand and fight on the<br />\nforeign policy issue. Unfortunately, Quemoy and Matsu. Cuba,<br />\nHungary, and Lebanon did not<br />\nstimulate the people. The nonexistent missile gap held the<br />\nstage as the defense issue.<br />\nThe Nixon legacy on foreign<br />\naffairs is strikingly related by<br />\nTheodore White in his book,<br /><br />\nDO YOU HAVE<br />\nWHAT IT<br />\nTAKES TO BE<br />\nA LEADER?*<br />\n*If you do, don't settle for less.'<br /><br />\ncollege this spring'<br />\nIf you will complete your first two years of<br />\nand have not had ROTC training, you now have a special<br />\nopportunity to earn an Army officer's commission in the next<br />\ntwo years. You can qualify to fulfill your military obligation as<br />\nan officer while you study for a college degree in a field of<br />\nyour choice. ,<br />\nThrough a new two-VeiF Army ROTC program—you- will<br />\nreceive leadership training and experience that will be valuable assets for the rest of your life, in either a military or a<br />\ncivilian career. You will receive an allowance of $40 each<br />\nEcontn during your Junior and Senior years. If you desire, yoke<br /><br />\nmay request postponement of yout military service while yoti<br />\ncomplete your studies for a graduate degree.<br />\nMost large business and industrial firms prefer the college<br />\ngraduate who has been trained and commissioned as an<br />\nofficer—who has the ability to organize, motivate and lead<br />\nothers—and who has had experience in accer,iting responsk<br />\nbilities beyond his years.<br />\nYou owe it to yourself to investigate this irinportant op'<br />\nportunity.<br />\nFor complete information on the new two-year Army RO'T'<br />\nprogram see the Professor ot Military Science on carripu<br /><br />\nThe Making of the President<br /><br />\n1960. In the meeting by which a<br />\nVice-Presidential candidate was<br />\nchosen, there was a disagreement<br />\nas to whether the candidate<br />\nshould be knowledgeable in<br />\ndomestic or foreign policy. Governor Stratton of Illinois said:<br />\n\"You can say all you want to<br />\nabout foreign affairs, but what's<br />\nreally important is the price of<br />\nhogs in Chicago and St. Louis.'<br />\nNixon declared, \"If you ever let<br />\nthem the Democrats) campaign<br />\nonly on domestic issues, they'll<br />\nbeat us—our only hope is to<br />\nkeep it on foreign policy.\"<br />\nTheodore White relates a<br />\nmemorable speech of Nixon's at<br />\nPeachtree Street and Hurt Park<br />\nin Atlanta, Georgia on August<br />\n26, 1960. Nixon said, \". . May<br />\nI turn now to what I believe is<br />\nthe overriding issue confronting<br />\nu.s in this election campaign..<br />\nYou know what it is. Look at<br />\nthose boys sitting around that<br />\npool. We want those boys to<br />\ngrow up in a world of Peace<br />\nwithout Surrender. (Applause)<br />\nBecause we can have the best<br />\nsocial security program and the<br />\nbest health program and the<br />\nbest job that anybody can possibly imagine and it Isn't going<br />\nto make any difference if we're<br />\nnot around to enjoy it. . . I sapto you today that there is no<br />\nman in the world who has had<br />\nmore experience and who has<br />\nshown more ability to deal with<br />\nthe Communist leaders across<br />\nthe conference table than the<br />\nman I trust will be the next<br />\nVice-President, Henry Cabot<br />\nLodge, our representative at the<br />\nU.N. .. .\" (White, p. 323-4) Republican leaders should dust off<br />\nthose 1960 Nixon speeches about<br />\nPeace without Surrender and<br />\nthen ask for the people's vote in<br />\n1966 and 1968.<br />\nAuthorized Jeweler For<br /><br />\nLungines Wiiinauer<br />\nBulova and<br />\nWyler Watches<br /><br />\nROETH'S<br />\nJewelers and Opticians<br />\nEstablished 1910<br /><br />\n3120 Greenmonnt Avenue<br />\nBalti,,,,,re 18, Marylen41<br />\nBEhnont 5-9561<br />\nWATCH REPAIRING<br /><br />\nMOM Si<br />\nOf course you can<br />\nget a cash loan!<br />\n•Our 'flew LOANS TO<br />\nSTUDENTS SERVICE is.<br />\ndesigned especially for you.<br />\n•Monthly repayments will<br />\nbe arranged to suit yout<br />\nparticular circumstances.<br />\n•Stop in or 'phone.<br /><br />\nbe glad to serve you.<br /><br />\nRitterlinance4<br />\n313 N. HOWARD ST.<br /><br />\nARMY ROTC<br /><br />\nBALTIMORE<br /><br />\nPhone SA 7-7880<br />\nHours: Hoes., Tues., Weds. 948<br />\nThurs. 11-8: Fria. 94<br /><br />\nNEWS-LETTER<br /><br />\nPKNEWOOD, BALTIMORE, APRIL 29, 1966<br /><br />\n•<br /><br />\nPAGE SEVEN<br /><br />\nYesterday, you may have had a reason<br />\nfor missing a good,nourishingbreakfast.<br />\nToday, you don't<br /><br />\n;<br /><br />\nNow you can have<br />\nnew Carnation<br />\ninstant breakfast<br />\n-makes milk a meal<br />\nthat's too good to miss.<br /><br />\nEach glass delivers as much protein as two eggs,cXJ as much mineral nourishment as two strips of<br />\nand even Vitamin C—the<br />\ncrisp bacon, ei\norange juice vitamin.<br /><br />\nit comes in a lot of great flavors, too. Look for them In your cereal section,<br /><br />\nPAGE EIGH1<br /><br />\nNEWS-LETTER<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 29, 1966<br /><br />\nFrosh Nine Seeks<br />\nTo Shake Slump<br /><br />\n'<br /><br />\nBy JIM SLOAN<br /><br />\nHarford Junior College and were<br />\nWinless in three attempts, the bested, 1-6. Again their effort<br />\nhapless freshman baseball team was plagued by poor hitting and<br />\ncontinues to be plagued by poor fielding errors.<br />\nhitting and fielding.<br />\nBoth teams were scoreless durThe inability to capitalize on ing the first three innings, but<br />\nscoring opportunities led to their Harford managed to pick up one<br />\ndemise when they met Frederick run on a lone double in the<br />\nfourth. The Hop nine threatened<br />\nHigh School on April 21.<br />\nIn<br />\nthe fifth and at several other<br />\nFrederick sported a fine pitcher and also looked strong both times in the game, but they were<br />\nin the field and at the plate. unable to combine their hits into<br />\nWith respect to his squad's ef- any scoring rally.<br />\nfort, frosh mentor Dave Blizzard<br />\ncommented that the nine's fielding has improved although the<br />\nhitting is still poor.<br />\nLast Tuesday the nine hosted<br /><br />\nHopeful of combining good<br />\npitching with improved hitting<br />\nand fielding, the frosh journey<br />\nto Glen Burnie High School for<br />\nan away game this afternoon.<br /><br />\neaVieipaacience<br />\n(Continued from Page 5)<br />\nthose Germans who tolerated the<br />\nNazis' inhuman crimes, was<br />\naimed specifically at the demonstrators' convictions. It was immaterial to the specific charge<br />\nunder which the students were<br />\nconvicted.<br />\nThe bench should be a place<br />\nfrom which justice is administered according to the law, not<br />\nas plice from which a particular judge by virtue of his privileged position may attempt to<br />\npreach and popularize his own<br />\nparticular beliefs at the expense<br />\nof the beliefs of others.<br />\nDennis M. Sweeney<br />\nEditors Note: Mr. Sweeney's<br />\nletter also appeared in the April<br />\n27th issue of the Baltimore Sun.<br /><br />\nNo Joke<br /><br />\nNothing<br />\ncan take the press out of Lee-Prest slacks<br />\nNot that it's on his mind right now. And it needn't be. Those LeeIPrest Leesures can't help but stay crisp and neat. No matter what you<br />\nPut them through. They have a new permanent press.So the crease stays<br />\nin. The wrinkles stay out. Permanently. And that's without ironing. No<br />\ntouch-ups,either. They're made from Lee's special blend of 50% polyester.<br />\nAnd 50% combed cotton. For wash and wear...with conviction.<br />\nIncidentally, that permanent press is the only change we've made<br />\nin Leesures. They still have that lean, honest look...smart, tailored fit.<br />\nNew Lee-Prest Leesures. Test their permanent press yourself. It isn't<br />\nmecessary, but it's great way to spend an evening. From $6.00 to $8.00.<br />\n-<br /><br />\n;<br /><br />\n•<br /><br />\nLee-PResrLeesurese<br />\n14. D. Lee Company, Inc., Kansas City, Mo. 64141. ALSO AVAILABLE IN CANADA.<br /><br />\nTo the Editors:<br />\nThe Kline article (April 1,<br />\n1965) shot through with half<br />\ntruths, generalizations, and typical Radio Moscow phrasing, suggests little more that the frustrating mewlings of a small boy<br />\nwhose father has forced him to<br />\nstop using crayons on the walls.<br />\nEither as a statement of SDS<br />\npolicy or as a factual account of<br />\nthe Waverly incident it fails<br />\nmiserably.<br />\nMr. Kline, the breadth of your<br />\nknowledge is truly astounding.<br />\nYou seem to be an expert on the<br />\ninner workings of the modern<br />\nAmerican corporation; you have,<br />\nno doubt, worked in top management positions for a number<br />\nof years. You profess to have<br />\nfirst hand information on our<br />\nforeign policy; undoubtedly Dean<br />\nRusk calls you in regularly for<br />\nprivate briefings. And your firsthand account of what really goes<br />\non in Vietnam is truly remarkable, particularly for one who<br />\nobjects violently (oops, sorry,<br />\nnon-violently) to being sent<br /><br />\nthere; how many months have<br />\nyou spent in Vietnam as an onthe-spot observer? Lawyer, economist, foreign affairs expert,<br />\npolitical scientist, management<br />\nconsultant, war correspondent:<br />\nhow wonderful to have all this<br />\nin one so young!<br />\nAh, but there is a fly in the<br />\nointment; the true hoppie liberalarts-well-rounded-etc.<br />\noutlook<br />\nseems to be missing! Have you<br />\nvisited the ghetto that is East<br />\nBerlin, Mr. Klein? Have you<br />\ntalked with the refugees from<br />\nthe Hungarian massacre of 1956?<br />\nHave you been corresponding<br />\nregularly with any of our men<br />\nin Vietnam? Or is this to be considered just a typical Wall Streetcapitalist-inperialist - aggressor propaganda, something that just<br />\nisn't done by Loyal SDS members? How is it that we never<br />\nsee SDS protest any wars but<br />\nthose in which SDS member!.<br />\nmay have to fight?<br />\nLet's be serious, Mr. Klein. TI-w<br />\nguys over there are fighting<br />\nnot to preserve our \"economic<br />\nspheres of interest\" (I presume<br />\nyou mean by that that our corporations have huge holdings in<br />\nrice paddies?) — but to keep<br />\nthe boat from rockIng while you<br />\nget on your soap box and<br />\nsquawk about what they're doing. They're fighting to preserve<br />\nthe rich American system which<br />\nnow feeds, clothes, teaches,<br />\nhouses, and pleasures you-the<br />\nsame system you are castigating.<br />\nBluntly, you're living as a leech<br />\non their labors—which is pretty<br />\ndisguisting in itself — but to<br />\nhave you protest their labors<br />\nwould be ridiculous were it not<br />\nso revolting.<br />\nRichard Oles<br />\nEditors note: Mr. Oles is<br />\ncoach of the Fencing team.<br /><br />\nK4DRAT\"<br />\nMIFF<br /><br />\nLEE-PREST LEENS AVAILABLE AT:<br /><br />\nADLER'S<br /><br />\nWANTED - LEFT HANDERS<br /><br />\n(Greenmount &amp; 33rd St.)<br /><br />\nIf you're left handed and<br />\ninterested in why dials and<br />\nmachine controls move the<br />\nway they do—we'd like to pay you to test how<br />\nsouthpaws set dials compared to right handers.<br /><br />\nYOUR SPRING SHOPPING HEADQUARTERS<br /><br />\nJust sign up at AMES 242 for a convenient fime. It will<br />\ntake about an hour and you'll be paid $1.50 for your time.<br /><br />\n3240 GREENMOUNT<br /><br />\nCOMPLETE SELECTION<br /><br />\nProfessor A. Chapanis<br /><br />\nPAGE NINE<br /><br />\nNEWS -LETTER<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 29, 1966<br /><br />\nNetrnen Upend Loyola<br />\nTo Score Triple Play<br /><br />\nTHE<br /><br />\nBy JOSH TREEM<br /><br />\nAy JED LUCHOW<br />\nSports Editor<br />\na<br />\nin<br />\nsports,<br />\nIntramural<br />\nrather peculiar way, got a tremendous boost on Tuesday<br />\nafternoon, The Tau Epsilon<br />\nPhi fraternity, that's right the<br />\nTEP's here at Hopkins, defeated the blond jocks of Beta<br />\nTheta Pi in lacrosse by a score<br />\nof 7-6.<br />\nTEP, a nationally known<br />\njock house, though otherwise<br />\nregarded on this campus, went<br />\nwinless in football and was<br />\nonly able to eke out a victory<br />\nin their last basketball game,<br />\nha.s put together a remarkable<br />\nlacrosse squad. Only last week<br />\nthe TEP's put together another<br />\nfine effort against a strong<br />\nteam from Phi Sig, losing by<br />\none goal in overtime.<br />\nA New TEP<br />\nSitting at dinner on Tuesday.<br />\nI sensed something in the air<br />\nas a small motorcade of returning TEP's came roaring down<br />\nCanterbury Road making rather<br />\ncrude gestures as they pasted<br />\nthe Beta house. It seems that<br />\nthe TEP's finally decided to<br />\nshow us all what they're able<br />\nto do. \"It was really a team<br />\neffort\"; this was about the only<br />\nintelligible remark I could get<br /><br />\nOrientation<br />\nMembers of the freshman,<br />\nsophomore and junior classes<br />\nwho wish to serve on the 1966<br />\nOrientation Committee should<br />\npick up applications at the<br />\nAdmissions Office. Completed<br />\napplications must be in by<br />\n4:00 on May 6.<br /><br />\nfrom their over-joyed athletic<br />\nmanager.<br />\nAlthough it was perhaps a<br />\nteam effort, certain individuals<br />\nshould be cited for their efforts.<br />\nThese are: goalie Jerry Leveck.<br />\nattackman George Alapas, Midfielder Ham Easter, and John<br />\nSarney who plays both defense<br />\nand mid-field. The TEP's have<br />\nbeen practicing almost every<br />\nday for these tough games en<br />\ntheir schedule and it paid off.<br />\nWhy a Boost?<br />\nEarly in the season the B.I.A.<br />\nwas troubled with the problem<br />\nof very unbalanced leagues. It is<br />\nobvious that some houses have<br />\nteams than<br />\nstronger<br />\nmuch<br />\nothers. But, this was not the<br />\nproblem. When a team saw itself<br />\ndefeated 65-16, in basketball for<br />\nInstance, it was difficult for<br />\nthem to get a team out the next<br />\nweek. Fortunately, throughout<br />\nthe season there were only a<br />\nminimum number of games forfeited but this, I think, can only<br />\nbe written off as lucky.<br />\nNow, perhaps, we owe a<br />\nthanks to the brothers of TEP<br />\nfor showing us that interest,<br />\nabove and beyond athletic abilities, can win games too.<br /><br />\n111111111111111•••<br />\nGOOD THINGS COME<br />\nAND GOOD TIIINGS GO<br />\nBecause the good food at the<br />\nHarry Little Carry-Out Shops<br />\nMake it so!<br /><br />\nAfter<br />\nupending Gettysburg<br />\nCollege 5-4 on April 20, the varsity netmen picked off defending<br />\nMason-Dixon champs Loyola,<br />\n1 2.<br />\n5/<br />\n2-3/<br />\n1<br />\nThe victory, Hopkins' third in<br />\na row and third in three days,<br />\nboosted their season record, 3-3,<br />\nand their conference record to<br />\n2-1.<br />\nThe Loyola victory, the first<br />\nover the Greyhounds in four<br />\nyears, was highlighted by a four<br />\nset sweep of the two completed<br />\ndoubles matches and the overpowering singles play of Bob<br />\nChilders. The first doubles team,<br />\nSorrow and Childers, dumped<br />\nthe Loyola duo of Tontz and<br />\nMeyer, 6-1, 6-4, rallying in the<br />\nsecond set after being down 2-4.<br />\nTie for First<br />\nThe victory lifted Hopkins into<br />\na first place tie with the Greyhounds, who had been previously<br />\nunbeaten. Still not prophesiz-<br /><br />\nsoundly<br />\nBaltimore<br />\ntrounced<br />\nPoly 8-1, on April 19. The foh<br />\nlowing day, they suffered their<br />\nfirst loss, 6-2, at the hands of<br />\nGilman. However, they rebounded strongly and polished<br />\noff Forest Park 9-0. First sinBronstein, and<br />\ngles, Nabby<br />\nsecond singles, Mike Marcus,<br />\nBaby Netmen<br />\nMeanwhile, the Baby Jays were cited for their fine play<br />\nfinally opened their season and in all three matches.<br /><br />\ning a potential conference title.<br />\nCoach McDermott did state<br />\nnext<br />\nof<br />\nthe<br />\nwinner<br />\nthat<br />\nmatch<br />\nreturn<br />\nWednesday's<br />\nagainst Loyola will most likely<br />\nMasonyear's<br />\nbecome this<br />\nDixon Northern College Division champions.<br /><br />\nTHE SERENDIPITY SINGERS<br />\nSaturday, May 21, 8:30<br />\nAt DAR CONSTITUTION HALL<br />\n18th mod C Sts., N.W., Washington, D. C.<br /><br />\nTickeis: $1.80, 2.50, 3.50, 4.25, 4.75<br />\nTalbert Ticket Agency, Willard Hotel, Washington, D. C.<br />\nMail orders accepted, send self-addressed stamped envelope.<br />\nPhone NA 8-5575, NA 8-4420.<br />\n•••••<br /><br />\nge,<br /><br />\n..<br />\n..0$44341<br />\n1<br />\nHeading for the beach this vacation? Don't bring losable cash. Bring First National City travelers checks. You<br />\ncan cash them all over the U.S. and abroad. But their big advantage is a taster refund system.<br /><br />\nHARRY LITTLE<br />\nCorry-Out SHOPS<br />\n407 East 32nd Street<br />\n111 111111<br /><br />\n11111•<br /><br />\nGEORGE WEIN presents<br /><br />\nThe Newport Festivals<br />\nThe Newport Jazz Festival<br />\nJuly 1,2, 3,4, 1966<br />\nFour evening concerts; Friday, Saturday, Sunday, Monday. Three afternoon<br />\nMonday. Featuring: Count Basic, Ruby Brett,<br />\nSunday,<br />\nconcerts; Saturday,<br />\nDave Brubeck, John Coltrane, Miles Davis, Duke Ellington, Ella Fitzgerald,<br />\nDizzy<br />\nGillespie, Woody Herman, Herbie Mann,<br />\nGetz,<br />\nBud Freeman, Stan<br />\nThelonious Monk, Jimmy Smith, Joe Williams, and many others.<br />\nEvenings: $3.50, 4.50, 5.50 Afternoons; $3.00<br /><br />\nOther travelers checks<br />\nare every bit as good as<br />\nFirst National City Bank's<br /><br />\nThe Newport Opera Festival<br /><br />\n.<br /><br />\nJuly 12, 13, 14, 15, 16, 1966<br />\nPresenting the Metropolitan Opera Company of New York. Major stars,<br />\nChorus, and Orchestra in four operas in concert performance and five<br />\nafternoons of musical workshops, panels, and lectures.<br />\nWednesday, CARMEN<br />\nThursday,(rain date)<br />\nTuesday, LA BOHEME<br />\nSaturday, AIDA (Sunday, rain date)<br />\nFriday, LUCIA DI LAMMERMOOR<br />\nEvenings: $3.50, 5.50, 7.50 Afternoons: $2.00<br /><br />\nFIRST NATIONAL CITY BANK<br /><br />\nFor Information, write Newport Jazz, Opera, or Folk Festival. For tickets<br />\nspecify dates and Festival. Make checks payable to the specific leslival you<br />\nplan to attend.<br />\nFor accommodations, write the Newport Chamber of Commerce, Newport,<br />\nRhode Island 02840.<br />\nIf you're age 12 through 21, you can fly to the Newport Festivals for half<br />\ntare on American Airlines, creator of the American Youth Plan, via<br />\nProvidence, R. I. To become eligible, Just send $3.00 with the coupon below<br />\nand receive your Youth Plan ID, plus a free copy of AA's Go Go American<br />\nwith $50 worth of discount coupons.<br />\nAmerican Airlines Youth Plan<br />\n633 Third Avenue<br />\nNew York, N. Y. 10011<br /><br />\nSIM DATE<br /><br />\nCOLOR OF<br /><br />\nCOLOR OF HAIR<br /><br />\nEYES<br /><br />\n•••4<br /><br />\nSIGNATURE<br /><br />\n20<br /><br />\nv.*<br />\n. .<br /><br />\nyttx,re,<br /><br />\nTTIO<br /><br />\nNTY_JICIVP4L.AIRS \"K4-4-<br /><br />\nSPECIAL DISCOUNT: deduct 20% from the list price of tickets for all<br />\nconcerts if purchased by mail before May 15th.<br /><br />\nSTATE<br /><br />\n,<br /><br />\nwimp a-roavs cuovitracY<br /><br />\n.<br />\nJuly 21, 22, 23, 24, 1966<br />\nFour evening Concerts; Thursday, Friday, Saturday, Sunday, Three All-Day<br />\nWorkshops; Friday, Saturday, Sunday.<br />\nFeaturing: Theo Bikel, Oscar Brand, Brownie McGee and Sonny Terry, Judy<br />\nCollins, Bob Dylan, Jack Elliott, Mimi and Dick Farina, Platt and Scruggs,<br />\nCarolyn Hester, Bessie Jones, Phil Ochs, The Pennywhistlers, Jean Ritchie,<br />\nGrant Rogers, Burly Sainte-Marie, Howling Wolf, and others.<br />\nEvenings: $3.50, 4.50, 5.50 All Day Workshops: $2.00<br />\nnedeaki.<br /><br />\nADDRESS<br /><br />\nmiiar.ia<br /><br />\n123-456-789<br />\ntmk,<br /><br />\nThe Newport Folk Festival<br /><br />\nNAME<br /><br />\n,.<br /><br />\nIYMOICIIMpuilleMINONORP•sho...44<br />\n.11.1.0•11.11.411V1.4101,11.401.4.....111<br />\n1<br />\n101.0.00.141.00411110....10.0%waroa.1111.0111.Paw.<br />\n.4<br />\nW<br /><br />\nC.<br /><br />\n'WOW<br /><br />\n4:8000.03008.: I. 31.567890<br /><br />\n...until you lose them!<br />\nOther leading travelers checks, like First<br />\nNational City travelers checks, can be cashed<br />\nall over the world.<br />\nBut if you think all travelers checks are alike,<br />\nyou may be in for a rude shock if you should<br />\nlose your checks.<br />\nWith other leading travelers checks,elaborate<br />\nand time-consuming inquiries often have to be<br />\nmade. It may be days—even weeks—before you<br />\nget your money back. Who wants to wait?<br />\nBut, if you lose First National City travelers<br /><br />\nchecks,you don't have to worry.There are more<br />\nthan 20,000 places around the world authorized<br />\nto give you a fast refund—right on the spot!<br />\nFirst National City travelers checks come from<br />\nthe leader in world-wide banking, and have<br />\nbeen in use over 60 years. They are known and<br />\naccepted in more than a million shops, hotels,<br />\nrestaurants, air terminals, etc., the world ovest<br />\nNext time you travel, insist on First National<br />\nCity travelers checks.<br />\nThey cost just one cent per dollar.<br /><br />\nZIP<br /><br />\nFirst National City BankTravelers Checks<br /><br />\nsold by banks everywhere<br />\n11411411re<br /><br />\nrrontm. DEPOSIT INSURANCE coney...on<br /><br />\nNEWS<br /><br />\nsp<br /><br />\nPAGE TEN<br /><br />\nRTS<br />\nNEWS -LETTER<br /><br />\nRelay Mark<br />\nAlmost Falls<br />\nBy GARY SMITH<br /><br />\nBy JOHN M. BRICKMAN<br /><br />\nteam,<br />\ntrophy-winning<br />\nThe<br />\ndoomposed of Jack Loomis, John<br />\nflopka, Forrest Chumley, and<br />\nKevin Murphy, won in a time of<br />\n18.51, only 5.6 seconds off the HOPKINS' varsity<br />\neindermen cheer on anchorman Kevin Murphy<br />\nrecord. If Hopkins had been after victory in Mason-Dixon Relays.<br />\npressed during the race, the mooed would most likely have toppled, but the Hopkins runners<br />\nwere not even pushed to their<br />\nVictory.<br /><br />\nDiamonders Out To<br /><br />\nCostello Wins<br />\nGeorge Costello notched the<br />\nonly win for Hopkins — a first<br />\nUn the 440 in a very respectable<br />\n52.2. Pete Rowny took second in<br />\nthe high jump with a career<br />\nhigh of six feet. He would have<br />\nwon the event except for the fact<br />\nthat he had more misses than<br />\nhis opponent, who also jumped<br />\nsix feet. Bo Walker and Cliff<br />\nCyr also piled up points for the<br />\nJays, each placing in two events.<br /><br />\nA<br />\nBy MIKE PHILLIPS<br />\nA surprise winner last Saturday, the varsity baseball team<br />\ngets a chance to show home fans<br />\nthis was no fluke when it hosts<br />\nWashington at noon tomorrow.<br />\nSlated to pitch for the Jays<br />\nIs the recently-resurgent Amy<br />\nMichelson, while Jim Elder, a<br />\nstandout in last week's upset,<br />\nwill be held in reserve. The only<br />\nother home game remaining is<br />\na makeup contest with Franklin<br />\nand Marshall on May 12.<br />\nA form reversal of major proportions occurred a week ago,<br />\nas Ursinus, 3-0 in Southern<br />\nDivision M.A.C. play, fell victim<br />\nto a then winless Hopkins club<br />\nby a 5-4 score.<br />\nEarly Lead<br />\nThe Homewood squad took a<br />\nfirst inning lead when Gene Lin-<br /><br />\nPlebe Tangle On Tap<br />\nFor Frosh Stickers<br />\nBy JED LUCHOW<br />\nWith four straight victories to<br />\ntheir credit, the freshman laorosaers meet the Plebes at the<br />\nNaval Academy this afternoon at<br />\n3:30 P.M.<br />\nFollowing a 9-1 win over St.<br />\nPaul's this past Tuesday, the<br />\nBaby Jays went out to scrimmage the varsity stickers for another sixty minutes of exercise.<br />\nIn the St. Paul's game John<br />\nGorczyk made four goals, Charlie<br />\nGoodell two, Cliff Barton one,<br />\nWill Scroggs one, Jim Feely one,<br />\nand Phil Buck three assists.<br />\nAdds to Middies<br />\nThe starting line-up was the<br />\nsame but coach Fewster made a<br />\nfew changes on the second midfield. Barton, who had seen<br />\nlimited action in the Bainbridge<br />\nand Severn games, scored first<br />\nIn this game. Artie Guerin, the<br />\nother addition, showed tremendous speed and great improvement in his stick handling.<br /><br />\nKAWASAKI<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 29, 1966<br /><br />\nTen Angles In<br />\nOn Army Upset<br /><br />\nA team composed of four Hopkins varsity distance runners<br />\nwon the four mile relay in near<br />\nrecord time at last Saturday's<br />\nMason-Dixon Relays, held at<br />\nGallaudet College in Washington.<br /><br />\nWhile these four stars were<br />\ncompeting in the relays, the rest<br />\nof the varsity trackmen were<br />\nlosing a triangle meet to Dickinson and Ursinus. The weekend<br />\n1 2 points comJan piled up 25 /<br />\npared with 80 and 561<br />\n/<br />\n2 for Dickinson and Ursinus. respectively.<br />\nThis showing with a depleted<br />\nteam, however, was a lot better<br />\nthan the Jays did last year with<br />\n• full squad.<br /><br />\nLETTER<br /><br />\nGoalie John Kelly looked great<br />\ndespite a cold in the back. All<br />\nseason long he has given the defense enough added confidence<br />\nfor them to turn in equally fine<br />\nperformances. Mike Clark showed<br />\ngreat hustle against the city's<br />\ntop scorer by not only holding<br />\nhim scoreleg but allowing him<br />\nonly five shots.<br />\nNew Goalie?<br />\nKelly had seven saves in the<br />\ngame but he was taken out in<br />\nthe last three minutes to ease<br />\nhis back. Mid-fielder Scroogs<br />\nthen went into the net and came<br />\nup with a save himself.<br />\nPsych for Two<br />\nWith only two games left, the<br />\nability of the Baby Jays will<br />\nreally be tested. They face a<br />\nwell-conditioned but less skilled<br />\nPlebe team today and then face<br />\neven tougher competition from<br />\nthe Maryland frosh in one week.<br />\nThat game will be played in College Park at 3:30 P.M.<br /><br />\n9<br /><br />\nfors swatted a 430 foot double<br />\nto left and was singled home bY<br />\nSoph third baseman Mike Shaw.<br />\nThis state of affairs lasted until<br />\nthe fourth, in which a double by<br />\nJim Celli and singles off the<br />\nbats of Ray Wier, Shaw, and<br />\nJerry Moore produced three<br />\nmore tallies.<br />\nTransplanted outfielder - firstbaseman Elder, meanwhile,<br />\ncruised along with a no-hitter<br />\nfor the first seven innings, the<br />\nonly Ursinus score coming on ct<br />\nmisfired pickoff play with runners on first and third in the<br />\nfourth.<br />\nShowers in Eighth<br />\nWith one out in the eighth,<br />\nthe Bear bats finally got going.<br />\nA double and two successive<br />\ntriples sent Elder to the showers, and the tying run scored on<br />\na miraculous over-the-head bunt<br />\nof a high pitch by reliever Michelson on a suicide squeeze play.<br />\nNot about to let their chance<br />\nget away, the Jays soon set<br />\nthings right in the ninth. Michelson led off with a walk, Calli<br />\ngot a bunt single, and Lindfors'<br />\nattempted sacrifice resulted in a<br />\nforce at third. Then Shaw, who<br />\nwent four for five, delivered a<br />\nsingle to left that scored Celli<br />\nin a close play at the plate.<br /><br />\nlacrosse game ever played in the<br />\nThe varsity lacrosse team tries Yale Bowl.<br />\nto make it two lasses in a row<br />\nNavy Tops Temps<br />\nfor Army at 2:30 P.M. tomorrow,<br />\nThe Jays were idle last Satbefore a Big Weekend crowd on urday, and many Hopkins fans<br />\nHomewood Field.<br />\ntraveled to College Park, where<br />\nThe Black Knights, who lost Navy defeated Maryland, 11-9.<br />\nto Yale 12-8 last weekend, come Both teams showed weaknesses<br />\nin with a 3-1 record previously at midfield and defense, but Jim<br />\nhaving defeated Hofstra, Prince- Lewis' play at attack, along with<br />\nton and Rutgers. Coach Jim a strong game from Owen Mc\"Ace\" Adams' all-junior starting Fadden, put the Middies on top.<br />\nattack lists 6' 2\", 185 lb. Chris Maryland scored six times on exPettit; Ray Enners; and prob- traman offense, and Terp atable creaseman, 6' 2\", 200 lb. tackmen Jack Heim and Alan<br />\nLowe each finished with three<br />\nWarren Dempsey. On the first midfield are cap- goals and an assist.<br />\nIn last Saturday's other key<br />\ntain Frank Kobes, letterman<br />\nGlynn Hale, and either Dave college game, Brown beat PrinJones or Gordon Rankin. Run- ceton, 11-3, and now needs only<br />\nning on the second midfield will a win over Cornell to take the<br />\nbe Larry Izzo, John Mayer, and Ivy League crown.<br />\neither Don Dietz or Dan Ryan.<br />\nLast year at West Point, HopThe third unit consists of Loyola kins beat, 6-3, now the Jays are<br />\ngrad Ed Sullivan, Ed Beck, and 4-3, and looking for 5.<br />\nSevern graduate Bob Kesmodel.<br />\nSchwartz on Defense<br />\nFootball end Tom Schwartz, at<br />\n6' 3\", 220 lbs.: 6' 2\", 210 lb. Dan<br />\nGooding; and 6' 2\", 190 lb.<br />\nBrian Utermahlen, an All-Maryland pick at Poly; comprise the<br />\nMoadawnsia Mali<br />\ndefense. Don Workman is a<br />\nLA 3-8080<br />\nprobable starter in goal. He is<br />\nbacked by Towson High grad<br />\nOpen iivelf mi911<br />\n.<br />\nFred Thomas.<br />\nSome 2,000 fans — a huge<br />\n\"YOUR WILSON STORE<br />\nrowd for lacrosse in New<br />\nIN BALTIMORE\"<br />\nHaven — watched Yale beat<br />\nArmy last weekend, in the third<br /><br />\nCHARLEY RUDO<br />\nSPORTING GOODS<br /><br />\nHopkins students, new and old, try:<br /><br />\nPecora's Restaurant<br />\nfor the finest Italian food in town<br />\n3320 Greenmount Ave.<br />\nSPAM!ETTI ME A LS<br /><br />\nCARRY OUT SERVICE<br /><br />\nPIZZA PIE A SPECIALTY<br /><br />\nCALL 889-3831<br /><br />\n•Coce-Cole\" end \"Coke\"ore righted Irods-markt which Identity only the product of The Coca-Cola Company<br /><br />\nNow<br />\nthere's a<br />\ndouble-date.<br />\nEt*s<br /><br />\nI.<br /><br />\nSport Cycles<br />\nSALES - PARTS - SERVICE<br />\n85 CC 125 CC I50 CC 17500<br />\nSTREET AND TRAIL MODELS<br />\n650 CC — 59 H.P.<br />\n260 cc — 38 H.P.<br /><br />\nSCH WING<br />\nMOTOR CO.<br /><br />\n86 CC — 4 SPEED — 8,2<br />\nLuggage rack, Set up, Shopipialt,<br />\nTool Kit, Turn Signals<br /><br />\n3326 KESWICK RD. CH 3-1304<br /><br />\nPrices Start at $379 Total<br /><br />\n4 Blocks West of Carnpus<br /><br />\n8 TO 17 HP MODELS<br />\nCOMING SOON<br /><br />\nCoca-Cola adds extra fun to dating—single or double. That's because Coke has<br />\nthe taste you never get tired of<br />\nalways refreshing. That's why things go better<br />\nwith Coke...after Coke...after Coke,<br />\nltotord under the outho4fy of The Coca-Cola Company by,<br /><br />\nTHE COCA-COLA BOTTLING CO.. BALTIMORE, MD.<br /><br />"}], "field_media_file": [{"target_id": 40176, "display": null, "description": null, "target_type": "file", "target_uuid": "9381a839-13e6-447e-a644-1e5dc1cfc66f", "url": "http://digital.library.jhu.edu/system/files/2022-03/13902-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13902, "target_type": "node", "target_uuid": "d746551a-05d5-4126-a4c4-5ddb8365cd26", "url": "/node/13902"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "c75b44b2-94bc-450e-8eb7-2f6f5034b398"}]}