{"mid": [{"value": 36647}], "uuid": [{"value": "50be1c14-f116-4957-a52f-24100710b03a"}], "vid": [{"value": 36647}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:51:02+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12958-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:51:02+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:51:02+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVI. No.#<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nBALTIMORE, MD., OCTOBER 14, 1921<br />\n<br />\nA. A. BOARD HOLDS FIRST<br />\nMEETING OF YEAR<br />\n<br />\nDRAMATIC CLUB TO PRESENT PLAYLET IN DECEMBER<br />\n<br />\nSeveral Elections and Appointments Many Candidates Needed. Major Production Will Probably Be Given<br />\nMade. Special Meeting Called<br />\nin March.<br />\nfor October 24.<br />\n<br />\nHOPKINS TO<br />\n<br />\nMEET<br />\n<br />\nDICKINSON<br />\nBLACK AND BLUE TO BE PUT<br />\nTO REAL TEST TOMORROW<br />\n<br />\nAt the meeting- ef the A. A. The Johns Hopkins Dramatic<br />\nDickinson Expected to Present Strong<br />\nBoard Monday, Bartow Griffiss Club will make its first public apLineup.<br />\nwas elected graduate delegate to pearance of the scholastic year on<br />\nthe board in place of Eric Calkins, or about December first when two<br />\nJohns Hopkins will be put to a<br />\nHOPKINS.<br />\nPosition<br />\nDICKINSON<br />\nreal test tomorrow when Dickinwho was made ineligible for the short plays will be presented. The<br />\nL E<br />\n1 Middleton<br />\nRich 12 or Goeltz 1<br />\nPosition to which he was elected actual plays which will be given<br />\nson College's eleven visits BaltiL T Shields 13 or Blumenthal 2<br />\n21 Westerman<br />\nmore. The gridders from Carlisle<br />\nwhen he entered the Medical have not yet been definitely dehave<br />\nShahodi<br />\n3<br />\nexhibited a great deal of<br />\nSchool.<br />\nall<br />\nin<br />\nupon,<br />\nbut<br />\nL<br />\nG<br />\ncided<br />\nprobability<br />\n13 Magill or 22 Council.<br />\nstrength<br />\nin their two starts thus<br />\nEli Frank, Jr., was elected they will be selected from the fol0 Totterdale or<br />\nfar<br />\nthis<br />\nyear.<br />\nJuniata College,<br />\ntreasurer of the association. Gil- lowing: A Roadhouse in Arden,<br />\n. Smith 4<br />\n31 Cromwell<br />\nson Engel and Joseph Thompson, by Philip Moeller; Medicine Show<br />\nwhich<br />\nthey<br />\nmet<br />\ntwo weeks ago<br />\nCook 5<br />\nR G<br />\n3 Landy<br />\nwas<br />\ncheering<br />\neasily<br />\ndefeated<br />\nwho did so well with the<br />\n45-0. Last Satby Stuart Walker and a wild westSharp 6<br />\nR T<br />\n4 Knecht<br />\nurday they held Lafayette to four<br />\nSaturday, were made official cheer ern play by Susan Smith. These<br />\nHall 14 or Crawley 7<br />\n• .R.E<br />\n11 Rich<br />\ntouchdowns. This latter feat wa<br />\nplays are intended primarily for<br />\nleaders.<br />\n. Pipa (c) 8<br />\nWilson<br />\n6<br />\nDarley<br />\nor<br />\nthe more remarkable of the two,<br />\nNo action was taken on the rec- freshmen and other inexperienced<br />\nQ B<br />\nLafayette possessing a team<br />\nTemplin 9<br />\nommendation of Football Man- men and will enable the members<br />\n7 Spinney or 9 Coady. L H B<br />\nwhich<br />\nhas been declared by many<br />\nager Brawner .fOr the position of of the club to get a line on prosDailey<br />\n10<br />\nR H B<br />\n29 Willis<br />\nexperts<br />\nas one of the strongest of<br />\nfirst assistant manager. The mat- pects for the big production to be<br />\nWortacnik 11<br />\n14 Calkins or 19 Markell F B<br />\nthe year. The victory over Pitt<br />\nter was tabled until Dr. Van Or- presented early in the spring. Both<br />\nfulfilled the predictions of Coach<br />\nman could be consulted. Joseph of these playlets will be coached<br />\nVan Orman, who expected LafayLeopold was, however, appointed by the Altimni Council of the club<br />\nSI JBSTITUTIONS<br />\nette to produce a super-machine.<br />\ncomposed of Harry Morriss,<br />\nmanager of Freshman football.<br />\n15 Sayes<br />\n5 Barton<br />\nDickinson was outclassed in the<br />\nThe cases of several men who chairman; Terry Burger, Donald<br />\n16 Hess<br />\n10<br />\nHarwood<br />\ncontest with Lafayette even more<br />\nlast year earned letters, but were Mossom and Frank Smith and<br />\n17 Satterlie<br />\n12 Bonner<br />\nthan was Hopkins against Georgenot awarded them forTone reason the officers of the club: Gilson<br />\ntown last year, but offered a stiff<br />\nor another were discussed on the Engel, president; Eli Frank, sec18 C. Davis<br />\n16 Rones<br />\nretary<br />\n,and<br />\nPierce<br />\nopposition to the victors.<br />\nBrawner,<br />\ntreasbut<br />\nfinal<br />\nfavorably,<br />\nwhole rather<br />\n19 Beighle<br />\n18 Ellsworth<br />\nThe Carlisle team is reported to<br />\nurer.<br />\ndecision on them was deferred<br />\n25 Rowland<br />\nespecially strong in the aerial<br />\nbe<br />\nIf any man expects to make the<br />\nuntil special meeting which has<br />\n37 Turnbull<br />\nattack.<br />\nThe team has been<br />\nbeen called for October 24 when club this year it will be absolutely<br />\ntrained<br />\non<br />\nboth long and short<br />\nit is hoped Dr. Abercrombie and necessary to come out for these<br />\npasses and has used both very<br />\nDr. Van Orman will be present. plays. There is practically no<br />\nsuccessfully.<br />\nEvery man in the<br />\nCommittees were -appointed by chance of a man making the cast<br />\nMUSICAL CLUBS HOLD ORLACROSSE PRACTICE TO<br />\nbackfield<br />\nis<br />\nexpert<br />\nin heaving the<br />\nPresident Knecht to investigate in the main production if he does<br />\nGANIZATION MEETING<br />\nSTART MONDAY<br />\nball and several of the wing men<br />\nthe coaching problem for the four not gain some experience by actMany More Candidates Needed. AtNumber of Veterans Return<br />\nare declared excellent receivers.<br />\nteams now without coaches. Bar- ing in these minor plays. No extractive Schedule Provided.<br />\nlacrosse<br />\nHopkins defense against the passThe fall practice of the<br />\ntow Griffiss is chairman of the la- )erience of any kind is really needThe combined musical clubs ing game was top-notch last week<br />\ncross committee and is assisted by ed by men who want to try out for quad will start Monday afternoon<br />\nheld their organization meeting in and if Darley and Spinney are up<br />\n\"Mike\" Bowers; baseball, Shar- these playlets and the Dramatic at 4.30, according to Manager<br />\nthe<br />\nBarn Wednesday evening. to standard tomorrow, a spectacetts, chairman, a.fid Knecht;swim- Club urges everyone who possibly Hensel. Practice will be held regPresident<br />\nHambleton and \"Doug\" ular game should result.<br />\nchairman,<br />\nand<br />\nMiddleton,<br />\nming,<br />\ncan to compete. A great many ularly thereafter each Monday,<br />\nCoulter,<br />\n'21,<br />\nLandy,<br />\nwho is directing the<br />\nbasketball,<br />\nEdwards;<br />\nDickinson's only problem this<br />\nmembers of the club graduated Wednesday and Friday until DeGlee<br />\nClub<br />\nand<br />\njazz band this year has been to produce a backchairman, and Totterdale.<br />\nlast June and their places must be cember.<br />\nJohn Knipp, coach of last year's year, made short addresses in field that will include a good kickfilled.<br />\nThe big annual production of squad, will again handle the men. which they explained that the er. Hopkins showed an improveN. D. U. DRAMATISTS ADOPT<br />\nthe<br />\nDramatic Club will, be given and will probably be assisted, as clubs are undertaking this year ment in this department last SatINSIGNIA<br />\nsome<br />\ntime early in Lent, about n previous years, by \"Father Bill\" the most ambitious and attractive urday and should have nothing to<br />\nThe Playmakers of the Universchedule ever attempted at Hop- worry about in that line.<br />\nMarch<br />\n10. Although it is too early Schmeisser.<br />\nsity of North Dakota, a dramatic<br />\nkins. Membership in the clubs is<br />\nturn<br />\nurged<br />\nto<br />\nare<br />\ncandidates<br />\nIn the game with Delaware,<br />\nAll<br />\norganization, has adopted as its in- at present to decide definitely on<br />\nto<br />\nbe<br />\nentirely<br />\ncompetitive,<br />\nand<br />\nfine<br />\nopa<br />\npractice,<br />\nfall<br />\nomitting the first quarter, a wonsignia a replica of the buffalo mask the play to be given the club al- out for the<br />\nfor this reason a larger number of derful improvement was noticed<br />\nand<br />\nwork<br />\nready<br />\nseveral<br />\nstick<br />\nhas<br />\nplays<br />\nlearn<br />\nunder<br />\nconportunity<br />\nto<br />\nused by the Dakotah Indians in<br />\nsideration. Foremost among these the fundamentals of the game be- candidates from which to choose at all positions. Although there<br />\nhunting buffaloes. It represents<br />\nis absolutely necessary. Good was no individual star, every man<br />\nthe head of a buffalo, this head be- are The Scarecrow, by Percy ing afforded.<br />\nby St. John Hankin ; Captain<br />\nSticks will be issued to all can- men are needed in order that the played his position well. Both<br />\ning made from a pelt and decorated<br />\nrequested to concerts planned may be ren- Darley and Wilson ran the team<br />\nin such a manner as to insure the, MacKaye ; The Prodigal's Return, didates, but they are<br />\nJenks, by Clyde Fitch, and Seven bring old shirts, trousers and dered in a manner which shall be ell. Willis and Calkins proved rehunter coming in close range of his<br />\nworthy of a Hopkins organization, liable, consistent ground gainers.<br />\n'Keys to Baldpate, by George M. shoes for the initial practice.<br />\nprey.<br />\nCohan. Miss Walters, who has<br />\nWhile a few of last year's team: While there is need of many more The former, no longer handiA movement is contemplated by<br />\ncoached the club for the last few Stuart, Reed, Kennady and Wood candidates of all types of voice, capped by a wrenched ankle,<br />\nmeans of which it is hoped that all<br />\ngraduation, enough the most urgent need is for first looks 100 per cent, better than<br />\nthe dramatic societies of the North years, will probably act in that —were lost by<br />\ncapacity this year. However, the old men have returned to form a tenors. At present there are only last week. Spinney also showed a<br />\nDakota high schools can be organattention of the club will not be nucleus for the coming season. two in the Glee Club. Although vast .improvement, his ability at<br />\nized into a state society to be called<br />\nsaid to be, however, many of last year's men are back, receiving forward passes eliciting<br />\n\"The Junior Playmakers.\" This centered on the main production There are<br />\npositions<br />\nopen for those I-1 ambleton said that he hoped to much applause. Middleton and<br />\nof<br />\nafter<br />\nthe<br />\ntwo<br />\nplenty<br />\nuntil<br />\npreliminary<br />\nwill, no doubt, be a great service to<br />\nhave at least five times as many Rich looked good on the wings.<br />\nand work.<br />\nout<br />\ncome<br />\nto<br />\nsuccessful<br />\nwilling<br />\nplays are<br />\npresented.<br />\nthese clubs which now exist under<br />\nmen out for the clubs at the next Westerman was another who<br />\nthe<br />\nerected<br />\nwall<br />\nconcrete<br />\nThe<br />\nvarious names, as it will raise their<br />\nmeeting.<br />\nshould<br />\nbe<br />\nearly part of this year<br />\nshowed a 100 per cent, improvestandard in every respect. Annual INTERFRATERNITY BOARD RULING<br />\nThe season opens soon after ment over last week. He and MaConsidin<br />\npractice.<br />\naid<br />\nvaluable<br />\na<br />\ncompetition can be easily made posFreshmen who were prominent ering the number of veterans re- Thanksgiving with a concert at gill presented an airtight<br />\ndefense.<br />\nsible in the drama in much the same in prep school and who expect to<br />\nEvergreen, to be followed later by Totterdale marked his return to<br />\nplenty<br />\nof<br />\nfor<br />\nprospect<br />\nmaining<br />\nthe<br />\nway as the athletic teams represent- be feted, dined and wined by the<br />\nmaterial and the availability similar entertainments at Gou- the game by a number of vicious<br />\ning the various high schools com- local frats in order to attract them raw<br />\nthe expert services of Coach cher, Western High, State Nor- tackles, several of them for conpete in the interscholastic meet now into the fraternity might as well of<br />\nKnipp and \"Father Bill\", it seems mal, Eastern High, Tome, Annap- siderable losses. Landy and<br />\nheld by the university.<br />\ngive up hope, according to a ruling<br />\nas if the future of this year's la- olis, Millersville and Washington. Knecht deserve all the credit givmade Tuesday by the Interfrater- crosse team should be a bright A concert will be given in Balti- en them by the<br />\nlocal press for<br />\nnity Board, freshmen may not be one.<br />\nmore at Lehmann's Hall in the their wonderful offensive work.<br />\nentertained by fraternity men in<br />\nSENIOR PICTURES<br />\nspring. During the Easter holi- Time after time the pair tore enorHulany way previous to October 31.<br />\nthe<br />\nSeniors are urged by<br />\ndays it is planned to take the club mous gaps through Delaware's<br />\nATTENTION, HULLABALOO<br />\nThe ruling reads as follows:<br />\nlabaloo Board to have their individon a tour through Western Mary- left side of the line for the runs<br />\nCANDIDATES<br />\nual photographs taken as soon as \"No fraternity man shall spend<br />\nThere will be a meeting Tues- land, visiting Cumberland, Fred- of Willis and Calkins.<br />\nPossible. It has been pointed out money on a freshman or entertain day, October 18, of candidates for erick, Hagerstown and WestminTwo new men, Rowland and<br />\nthat the best time for this to be done a freshman in his home at meals<br />\nster.<br />\nCouncil, were substituted on the<br />\nthe editorial, art and business<br />\n1., sometime in October, for if it is or over night.\"<br />\nWhile no attempt was made at inc during the course of the game.<br />\nstaffs of the Hullabaloo in the<br />\nLast spring the Intercraternity<br />\nleft till later the photographer will<br />\nthe meeting to classify the mem- The former went in at tackle for<br />\nHullabaloo office at 12.30.<br />\nbe hampered by the Christmas rush Board passed a ruling which specibers of the Instrumental Club, the Knecht, who received a muscle<br />\nand after that will be busy with the fied that the \"rushing\" season for<br />\nfollowing shows the composition bruise on his upper left arm. CounNOTICE<br />\ngroup pictures. A card authoriz- fraternities shall not begin until<br />\nof the Glee Club as it now stands: cil, who substituted at guard,<br />\ning a photograph may be obtained me-half hour before the beginning<br />\nPresident, Waldo Hambleton. weighs 220 pounds and is a freshA meeting of Sigma Chi Beta<br />\nat any time from E. G. Huey, the of instruction of the first class on will be held this evening at 7:30<br />\nTreasurer, Bernard Kuder.<br />\nman. He was a teammate of Wilbusiness manager.<br />\nat the K. A. House.<br />\nContinued on page 4, col. 3<br />\nContinued on page 4, col. 1<br />\nContinued on page 2, col. 1<br />\n<br />\nLineup For Tomorrow's Game<br />\n<br />\n404<br />\n<br />\n\fT HE JOHNS HOPKINS NEWS-LETTER, OCTOBER 14, 1921<br />\n<br />\n2<br />\n<br />\nIS TRUE THAT THE UPPER S. I. N. A. ADOPTS PLAN FOR<br />\nDISTRIBUTION OF NEWS<br />\nCLASSMEN SHOULD HELP THE<br />\nSOPHS ENFORCE THE REGTo Establish Two News Centers. Will<br />\nFOUNDED 1897.<br />\nA Column in Which the Correspondents<br />\nULATIONS<br />\nFacilitate Exchange Between<br />\nAre Allowed Latitude, But ShoulMember Colleges.<br />\n-LETTER.<br />\nNEWS<br />\nthe<br />\nof<br />\nEditor<br />\nResponsibility.<br />\n$2.50<br />\nthe<br />\nder<br />\nSubscription<br />\npublication<br />\nfor<br />\nAll letters intended<br />\nDEAR SIR: It seems to me as<br />\nThe Southern Intercollegiate<br />\nmust be concise.<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nattention will be paid to anony- though Freshmen regulations at Newspaper Association, which was<br />\nNo<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nmous letters, but n'ames signed as an<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\n<br />\nIT<br />\n<br />\nHopkins are looked upon in the organized last spring at a meetwrong light by most of the upper ing of representatives from the<br />\nclassmen. They seem to look upon leading college newspapers of the<br />\nthem as something imposed upon South, held at Richmond, has dethe Freshies by the Sophomores. vised a plan that will facilitate the<br />\nHomewood 100<br />\nTelephone<br />\nThis is really not the case; the idea distribution of • news among its<br />\nAN IDEA THAT WILL BEAR<br />\nbeing, not to stir up fights between members and enable them to pubBusiness Manager:<br />\nEditor-in-Chief:<br />\nINVESTIGATION<br />\nthe two lower classes, as so many lish news from other colleges at the<br />\nH. DOUGLAS COTTON,'22,<br />\nFREDERICK W. LIPPS, '22.<br />\n1921.<br />\n10,<br />\nOctober<br />\nseem to think, but to give to the new ;ame time as the home paper.<br />\nActing Managing Editor:<br />\nCirculation Manager:<br />\nWILLIAM H. MOORE, JR.<br />\nmen the true college spirit. This<br />\nThis plan provides for the diEditor-in-Chief,<br />\nGLOVER P. FALLON, '23.<br />\nby the co-opera- vision of the Association's members<br />\ndone<br />\nbe<br />\nAssociate Editors:<br />\nonly<br />\ncan<br />\nJohns Hopkins NEWS-LETTER.<br />\nEDWARD G. HUEY, '22.<br />\nAdvertising Manager:<br />\ntion of the three upper classes in into a northern and southern exELI FRANK, JR., '22.<br />\nDONALD K. VANNEMAN, '23.<br />\nDEAR SIR:<br />\nThe :hange system. One paper of each<br />\nenforcing the regulations.<br />\nJunior Editors:<br />\nIt is a commonly known fact main burden of the talk has natur- system is to serve as an exchange<br />\nAssistant Business Managers:<br />\nCHARLES C. MARBURY, '22.<br />\nBERNARD C. HEARN, '23.<br />\naround the University that the many alv been placed upon the shoulders center. The Richmond Collegian<br />\nLAWRENCE B. FENNEMAN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nJ. BRENTNALL POWELL, '23.<br />\nactivities, both athletic and non-ath- of the Sophs, who are still aware of has offered its services as the cenFITZGERALD DUNNING, '24.<br />\nCRAIG E. TAYLOR, '24.<br />\nletic, are in need of funds. This -he great benefits received from this ter for the more northern colleges,<br />\ntraining; moreover, the and it is probable that Atlanta or<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nbeing the case, it hardly seems Freshman<br />\nJuniors and Seniors are too busy some point in that vicinity will<br />\nlargest revthe<br />\nof<br />\none<br />\nthat<br />\nright<br />\nMd.<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore,<br />\nwith other college work to give serve as the southern center. Acenue-producing stores on the cam- proper attention to this work.<br />\n-ording to the plan, each paper will<br />\npus should be in the hands of an<br />\nIt is my earnest hope and plea nail to each of these centers a copy<br />\nBALTIMORE, MD., OCTOBER 14, 1921<br />\n\"outsider.\" I mean the soda foun- that the. upper classmen will realize of its intercollegiate.news, and the<br />\ntain and lunchroom in the Barn. the facts and do their part towards centers will forward to each paper<br />\nWHERE WERE THE UPPER CLASSMEN?<br />\ncollege spirit, or in their territory the combined<br />\nthese privileges are held making better<br />\nThe cheering last Saturday was a disgrace to the University. Of course,<br />\nit would be better to do news of all the schools. Under this<br />\notherwise<br />\nThe Freshmen did their best, but where were the upper classmen? for a certain length of time by a away with the regulations entirely, system each publication will write<br />\nCertainly not in the rooting section. As an outsider said, \"No one is contract, but at the expiration of the for under the present method they but two letters containing the<br />\ncheering but the Freshmen and they only cheer because they have contract the Trustees should give do more harm than good.<br />\nnews, whereas, if each mailed its<br />\nto.\" That's an awful impression for a visitor to carry away with him, the concession to the students<br />\nown news, it would have to write<br />\nYours very truly,<br />\nisn't it?<br />\nBETTER COLLEGE SPIRIT. forty or more. The costs of the exthemselves, so that it may be operAnd yet there was certainly sufficient foundation to create such<br />\nchange system are to be borne by<br />\nated to support their activities.<br />\nan impression. Not more than fifty upper classtnen and hardly half<br />\nthe Association.<br />\nATHLETIC GOSSIP<br />\nAt the present time the rights are<br />\nthe Freshman class backed up the team in organized cheering. A<br />\nThe Association is now composed<br />\nSyracuse, 42; Maryland, 0! You<br />\nheld for a nominal sum, and the inpitiful showing, indeed.<br />\nsee, Curley, \"You can fool all of f the following members:<br />\nHow do you upper classmen expect the Freshmen to learn the come is exceedingly large. I claim<br />\nthe people some of the time, and 1. The Yellow Jacket, Randolphcheers, to back up the team whole-heartedly unless you help them? that this income should apply to- some of the people all of the time,<br />\nMacon College, Ashland, Va.<br />\nDo you think that you are demeaning yourself if you are seen in the wards the support of student activbut-\" well you know the rest by 2. Johns Hopkins News-Letter,<br />\ncheering section? or are you just lacking in college spirit In plain<br />\nities. The contract holding these now. Even Untz Brewer's toe<br />\nJohns Hopkins University,<br />\nwords, what the h-l's the matter with you?<br />\nits<br />\nof<br />\nout<br />\nplaying<br />\nteam<br />\na<br />\nsave<br />\ncan't<br />\nduraBaltimore, Md.<br />\nThe team needs support. The fellows who are on the squad are rights is only of one year's<br />\nclass.<br />\nof<br />\nfirst<br />\nThe<br />\nBlue & Gray, Hood Colthe<br />\n3.<br />\non<br />\nout<br />\nruns<br />\ndeto<br />\nand<br />\nyou<br />\ntion,<br />\nmuch<br />\nto<br />\nexpect<br />\ntoo<br />\nit<br />\nIs<br />\nspare<br />\nmoment.<br />\ngiving up every<br />\n,<br />\nactivities<br />\nthe<br />\nFrede'rick, Md.<br />\ncan't<br />\nWhy<br />\nJanuary.<br />\nthem?<br />\nhelping<br />\n-buddies,\"<br />\nto<br />\nvote two hours a week<br />\nFfoin his Delaware<br />\nexpendiTopics, University of<br />\nCollege<br />\n4.<br />\nstudent<br />\nof<br />\nfizzle.<br />\nbenefit<br />\nSaturday's<br />\nlast<br />\nup<br />\nthe<br />\nfor<br />\nmake<br />\nreap<br />\nand<br />\nSnap into it tomorrow<br />\nwe learn that Booth, the long-disVirginia,<br />\nCharlottesville, Va.<br />\ntures from then on?<br />\ntance speed king, is nicknamed \"the<br />\nMore detailed plans can be test-tube.\" Wonder what Delaware 5. Ring-turn Phi, Washington &<br />\nworked out, but the tentative plan would dub McLane?<br />\nLee University, Lexington,<br />\nISN'T IT TRUE?<br />\nwould be to have the Student CounVa.<br />\n(Exchange Editorial)<br />\nMt. St. Mary's played Susque- 6.<br />\ncil or the Homewood Company take<br />\nThe Cadet, Virginia Military<br />\nA great hue and cry frequently.is raised decrying the value of charge. They. could hire a man- hanna to a 0-0 tie last Sattirday.<br />\nInstitute, Lexington, Va.<br />\ncollege activities. Men come to college to acquire knowledge and ager and several assistants, who, Thus, the Mounts have not won a 7. The Brackety-Ack, Roanoke<br />\nlearn how to think, it is said, and the only way in which they may do with the possible exception of the game so far this year, yet they<br />\nCollege, Salem, Va.<br />\nthis is to apply themselves diligently to their lessons and as far as manager, would be students trying have had a total of but three points<br />\n8. The Virginia Tech, Virginia<br />\npossible remain oblivious of every other person on the campus. Such to work their way through college. piled against them. Rather a pePolytechnic Institute, Blackspeople delight in characterizing college activities as the \"side shows\" The net profits would be divided, culiar record for football!<br />\nburg, Va.<br />\nin some fair ratio, between the Athof the campus.<br />\nCashell, member of Hopkins' 9. The Orange & White, UniverEd<br />\nIt must be granted that there is danger that a student will become letic Association and the Varsity<br />\ngridiron squad for the last few<br />\nsity of Tennessee, Knoxville,<br />\nso interested in activities other than study that he will lose sight of Seal Voting Council, to apply to<br />\nJohn's ColSt.<br />\nentered<br />\nhas<br />\nyears,<br />\nthings academic. It is possible he will place the chief emphasis on athletic and non-athletic activities.<br />\nlege and is playing football there. 10. The Burr, Louisiana College,<br />\nThe advantages of this plan are:<br />\ncampus life, and in doing so wrongly stress things less of value than<br />\nPineville, La.<br />\n1. It would give some deserving<br />\nothers he might choose. But there is also a danger, just as grave, that<br />\nThe Princeton-Navy game will<br />\ntermed<br />\npure<br />\ntheir<br />\nis<br />\nwhat<br />\nand<br />\nearn<br />\nmen an opportunity to<br />\na man will become so engrossed in books<br />\nnot cause a drop in paid attendance 11. The Emory Wheel, Emory University, Georgia.<br />\nstudy that he will 'leave college narrow of vision and clear out of education.<br />\nat Homewood Field tomorrow, as<br />\n2. It would supply the Athletic was at first feared. Announcement 2. The Gamecock, University of<br />\ntouch with his fellows.<br />\nThe fortunate man is he who realizes that slighting academic Association and Varsity Seal Vot- has been made that only those holdSouth Carolina, Greenville,<br />\nwork is only slighting himself, but who also identifies himself with ing Council with much needed ing passes will be admitted to FarS. C.<br />\nsome college activity, and, working on it, aids not only the school, funds.<br />\nragut Field.<br />\n13. The Davidsonian, Davidson<br />\n3. It would help us to keep the<br />\nbut broadens his own experience in dealing with them.<br />\nCollege, Davidson, N. C.<br />\n\"Hello, old dear, where have you<br />\nCollege activities are not the \"side shows\" of college. They are minor sports going.<br />\n14. The Salemite, Salem College,<br />\nthe laboratories of all the other departments. They are practical 4. It would make it unnecessary been?\"<br />\nWinston-Salem, N. C.<br />\nto ask men who go out and work \"Traveling. By the way, old top,<br />\ntraining courses of life.<br />\nThe<br />\nCritiograph, Lynchburg<br />\nfor the football to pay part of the passed your town the other day.\" 15.<br />\nCollege,<br />\nLynchburg, Va.<br />\nWhat<br />\nit?\"<br />\n?<br />\nof<br />\ndidja<br />\nthink<br />\n\"Didja<br />\ntable.<br />\ntraining<br />\nthe<br />\nof<br />\nside<br />\nexpenses<br />\nshort<br />\nthe<br />\n'<br />\nmation and through<br />\nBLACK'AND BLUE TO BE PUT<br />\nThe<br />\nSun<br />\n16.<br />\nThere<br />\nDial, Randolph-Mait,<br />\nthe<br />\nreally.<br />\nsee<br />\nmake<br />\n\"Couldn't<br />\nshort,<br />\nin<br />\nwould,<br />\nTO REAL TEST TOMORROW<br />\nline<br />\nIt<br />\n5.<br />\nside<br />\nof the line on several<br />\ncon<br />\nold<br />\nsiding,<br />\nHopCollege, LynchWoman's<br />\ncar<br />\nby<br />\non<br />\nbox<br />\na<br />\nwas<br />\nthe<br />\nspent<br />\nfrom<br />\nmoney<br />\nprofit<br />\nContinued from page 1, col. 5<br />\nplays.<br />\nburg,<br />\nVa.<br />\n-Goblin.<br />\nboost<br />\nHopkins<br />\nchap.\"<br />\nhelp<br />\nThe open spectacular type of kins students<br />\nus and Jones at prep school and<br />\n17. The Rotunda, Farmville Norbrought many expressions of activities.<br />\nplay<br />\ndemonstrated by his performance<br />\n?\"<br />\nDiogenes<br />\nmake<br />\nthe<br />\nwould<br />\nit<br />\nsad,<br />\nso<br />\n\"Why<br />\nlast,<br />\nAnd<br />\n6.<br />\nmal School, Farmville, Va.<br />\nsecreserved<br />\nthe<br />\nfrom<br />\nsatisfaction<br />\nSaturday that he hasn't forgotten<br />\nHarvard<br />\nthrough<br />\nactivity<br />\nwas<br />\ngoing<br />\n\"I<br />\nstudents'<br />\nreal<br />\na<br />\nBarn<br />\nscatthe<br />\nIf<br />\ngrandstand.<br />\n18. The Hampden-Sidney Tiger,<br />\ntion of.the<br />\nthe game.<br />\nHampden - Sidney College,<br />\ntered remarks of the fans might be building, run by Hopkins men, for Square looking for an honest man,<br />\nand alas, some one stole my lanFor Delaware, Magaw at end taken as general opinion the Hopkins men.<br />\nHampden-Sidney, Va.<br />\nThis has received the indorse- tern.\"-Voo Doo.<br />\nand Jackson in the backfield, were adoption by Hopkins of the open<br />\n19. The Flat Hat, William &<br />\nof the facMary College, Williamsburg,<br />\nthe only two outstanding stars. play would serve to increase the ment of some members<br />\nIn order to have a perfect figure,<br />\nSeal<br />\nVarsity<br />\nBoard,<br />\nAthletic<br />\nulty,<br />\nthe<br />\nVa.<br />\nCapt. Holton seemed helpless at interest of the local fans. To<br />\nmen prominent Mary Garden recommends \"ten<br />\nleft tackle and the entire center of average rooter one successful Voting Council, and<br />\nminutes of deep breathing in front 20. The Richmond Collegian, Unithe line looked weak. In receiving pass in four for a gain of ten yards in activities.<br />\nversity of Richmond, Richsome concerted action of an open window on rising in the<br />\nthe kickoff the visitors used a for- is much more exciting than a simi- Let's get<br />\nmond, Va.<br />\non this plan. Other universities morning, and on retiring at night.\"<br />\nmation learned at Penn, but the lar gain from line bucks.<br />\nThe team from Dickinson will run their stores to help their activ- All I can say is, if it's to be done<br />\nWaiter-Has your order been<br />\nformation, designed to give a solid<br />\nCAN'T HOPKINS? in front of an open window, one<br />\nthree-man interference to the run- be accompanied by a number of ities, WHY<br />\ntaken?<br />\nreally should have a perfect figure<br />\nner, proved more of a stumbling students and townspeople who<br />\nVery truly yours,<br />\nWaitee-Yes, and so has Bunker<br />\nto begin with-in order to give the<br />\nblock than a help. Delaware's only are confident of victory for the<br />\nHill.-Shownte.<br />\nH. PEIRCE BRAWNER. neighbors a treat.-Tatler.<br />\ngains were made from a trick for- Red and White.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\n<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby \"The News-Letter, which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 14, 1921<br />\n<br />\nWe are establishing a new standard in<br />\nYoung Men's Suits at $29.50<br />\n<br />\nill<br />\n<br />\n3<br />\n<br />\nEXCHANGES<br />\n<br />\nStyles for every taste.<br />\n<br />\nte<br />\nas<br />\na<br />\nFie<br />\nehe<br />\nits<br />\nhbe-<br />\n<br />\nLirs<br />\nx:h<br />\n;*e<br />\nin<br />\nn!s,<br />\nDr<br />\nill<br />\nill<br />\n<br />\n)3/<br />\nle<br />\ner<br />\n<br />\nis<br />\nte<br />\nle<br />\nts<br />\nte<br />\n<br />\nThe centennial celebration plans<br />\nare ready at McGill's. Lectures<br />\nwill be suspended from Tuesday to<br />\nBaltimore's Best Store<br />\nMonday. All faculties will be represented in big Fete de Nuit. A<br />\ngarden party will be given by the<br />\nMcGill Women's Union, at_which<br />\nwill be given a pageant symbolic<br />\nof McGill past history. The plans<br />\nfor the \"Fete de Nuit\" are extensive.<br />\nThe various faculties are putting<br />\nOF MARYLAND<br />\non separate displays. The law students will appear with the inim1890<br />\n1920<br />\nitable Si Whiffletree display that<br />\namused students of the University<br />\nFIDELITY BONDS & BURGLARY INSURANCE<br />\nfor several years past. Unusual<br />\nContract, Judicial—BONDS—Public Official, Depository preparation has been made for the<br />\nbig events.<br />\nCHARLES ST. at LEXINGTON<br />\nBaltimore, Md.<br />\nUniversity of Colorado has record start; 2,279 now registered.<br />\nTotal enrollment expected to be<br />\nEstablished 1863<br />\n2,700. The enrollment already<br />\nshows an increase of 10.9 per cent.<br />\n•When you want the<br />\nover that of last year. The mediHENRY SEIM & CO.<br />\nreal thing in Sport<br />\ncal school was forced to turn away<br />\nEquipment you think Manufacturers, Importers & Dealers many students, due to lack of adequate facilities. It was necessary<br />\ninstinctively of<br />\nto increase the accommodations at<br />\n\"SPALDING\"<br />\nthe Bursar's office and change the<br />\nPAINTS, OILS and VARNISHES routine of registration.<br />\n41141-.\"'<br />\n<br />\nHOCHSCHILD-KOHN 8c Co.<br />\n<br />\nFidelity & Deposit Company<br />\n<br />\nAutomobile Glass a Specialty<br />\n<br />\nSPALDING & BROS.<br />\n<br />\n110 EAST BALTIMORE ST.<br />\n<br />\nDomestic and Ecclesiastic Leaded<br />\nStained Glass<br />\nHOWARD & FAYETTE STS.<br />\n<br />\nCandy, Soda and<br />\nPipes and Fountain Pens<br />\nAt the Barn<br />\nE. E. Adams<br />\n<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br />\n<br />\nJAS. H. DOWNS<br />\n<br />\nre,<br />\n<br />\ne,<br />\n<br />\nENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br />\n<br />\nThe SUPREME in Typewriters<br />\n<br />\nT $8.00, made<br />\nof grain leather,<br />\nin tan or black,<br />\nwith square toe and<br />\nheavy perforations,<br />\nthis is an oxford<br />\nany college man<br />\ncan be proud of.<br />\nIn high shoe the<br />\nsame style is $8.50.<br />\n<br />\nThe NEW<br />\n<br />\nHammond Multiplex<br />\n<br />\nCharles Street,:210 North<br />\n<br />\nSHIRTS<br />\n<br />\n)f<br />\ne,<br />\n<br />\nNECKWEAR<br />\n<br />\nLefranc & Ault<br />\n421 N. HOWARD ST.<br />\n<br />\nHOSIERY<br />\nPORTABLE<br />\nALUMINUM<br />\nThere is special provision for<br />\nENGINEERING, CHEMISTRY,<br />\nMEDICIN E, LANGUAGES.<br />\nLITERATURE, Professors and<br />\nStudents requirements.<br />\nExclusive Features<br />\nInterchangeable type-sets<br />\nTwo complete alphabets on<br />\neach machire.<br />\nAutomatic type impression<br />\nUnlimited width f paper<br />\nIndex cards written flat<br />\n<br />\nr,<br />\n<br />\ne,<br />\n<br />\n1-<br />\n<br />\nCOMMERCIAL ACCOUNTS—Liberal Terms<br />\nSAVINGS ACCOUNTS-4% payable semi-annually<br />\nDepository for State of Maryland and City of Baltimore<br />\nDEPO SITS<br />\n$428,399.57<br />\nApril 28, 1921<br />\nNovember 22, 1920<br />\n549,051.33<br />\n$112,418.77 May 18, 1921<br />\nDecember 29, 1920<br />\n657,092.61<br />\nFebruary 21, 1921<br />\n248,234.01 June 30, 1921<br />\n$1,013,167.87<br />\nTOTAL ASSETS AUGUST 31, 1921<br />\n<br />\nMaryland Glass Corporation<br />\nBaltimore<br />\nManufacturers<br />\nManufacturers of Automatic Machine-made<br />\n<br />\nSPECIAL TERMS to Collegians<br />\nEarn while you learn. Apply for<br />\nodd-time sales work in your college.<br />\nMACHINES RENTED<br />\nSend for FREE literature<br />\nThe<br />\nHAMMOND TYPEWRITER CO.<br />\n545 E. 69th St., New York, N.Y.<br />\n<br />\nBONDS<br />\n<br />\nBlue and Light Green Glass Bottles.<br />\nCHINESE VS. GREEK<br />\n<br />\nPossibly the first time that the<br />\nEnglish language served as a medium between Chinese students and<br />\na Greek letter fraternity occurred<br />\nsome time ago when a band of the<br />\nformer consulted the offices of Burr,<br />\nPatterson & Co., manufacturing fraternity jewelers of Detroit, and<br />\nasked that their club name, \"Chinese Students' Club,\" be duly transBaltimore, Maryland<br />\n310 N. Charles St.<br />\nlated into Greek and the letters C.<br />\nS.- C. used on an. official fraternity.<br />\nbadge.<br />\nIt was expkained to the committee that such a title would have little meaning and that it was customary to use the initials of specific Greek words in forming a Greek<br />\nname. How to translate \"Chinese<br />\nStudents' Club\" in Greek, however,<br />\n13 SOUTH ST.<br />\nwas a problem not easily solved.<br />\nThe word \"student\" and \"club\"<br />\nOrganized 1864<br />\nwere easily changed to the Greek<br />\nequivalents, but not so the \"ChiJohn J. Nelligan, President<br />\nnese.\"<br />\nSearch was made in the public library for the Greek word for \"Chinese\" but without success. In desperation, Gus, the restaurant man<br />\nAnd Medicines and Dressings are required or other Real<br />\ndown the street, was consulted but<br />\nPharmaceutical Service is Needed<br />\nhis modern Greek could not rise to<br />\nthe occasion, and he admitted reTHINK OF<br />\nluctantly that he knew no suitable<br />\nequivalent for \"Chinese\" in his native tongue.<br />\nA final appeal was made to the<br />\nTWO STORES:<br />\nlanguage department of a Detroit Charles and Franklin Sts.<br />\nEutaw Place and North Ave.<br />\nGreek<br />\ndeof<br />\nthe<br />\nhead<br />\nThe<br />\ncollege.<br />\nMadison 405<br />\nMt. Vernon 890<br />\npartment was pressed into service<br />\nand asked to help in finding - the<br />\nSt. Paul 7855-7856<br />\nmissing word for the new Greek letter fraternity. He declared at the<br />\nHomes Sold on Easy Terms<br />\noutset that there apparently was no<br />\nword for \"Chinese\" in classic Greek<br />\nsince the ancient Hellenes apparently had no definite knowledge of<br />\nChina. However, it was found, reference was made in their literature<br />\nROBERT SEFF<br />\nto \"the people of the far East,\"<br />\nReal Estate—Investments<br />\nand for this group, the professor<br />\ncould furnish a Greek name.<br />\nOf course, the word was immediately adopted and shortly after the<br />\nAmerican college world became acSOLD BY ALL GROCERS 231 Courtland Street Baltimore, Md.<br />\nquainted with a new American Chinese Greek letter fraternity.<br />\n<br />\nThe James R. Armiger CO.<br />\n<br />\nSafe Deposit & Trust Co.<br />\nof Baltimore<br />\n<br />\nGLOVES<br />\n<br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\nDress Shirts<br />\n$3.00, $3.50 and $4.00<br />\nNegligee<br />\n$3.25 and $4.25<br />\nImported Madras<br />\n$5.25 and $6.25<br />\nTerms Cash, Less 10% 30 Days on<br />\nShirts<br />\nAlso a Full Line of Men's<br />\nFurnishings<br />\n<br />\nSTRATTON<br />\n<br />\nOn account of the paper shortage, there is hardly a collar worn<br />\nin the state of Nebraska.<br />\nLawyer—Was the deceased in the<br />\nhabit of talking to himself?<br />\nPatrick—I can't tell you, sor ; I<br />\nnever was wid him when he was<br />\nalone.—Tar Baby.<br />\n<br />\nENVELOPES<br />\n<br />\nLEDGERS<br />\n<br />\nHynson, Westcott and Dunning<br />\n<br />\nHE-NO<br />\nTEA<br />\n<br />\nEstablished 1873<br />\n11<br />\n<br />\nEDWIN W. ADAMS,Vice-Pres. & Cashier<br />\n<br />\nIf an Accident Occurs<br />\n<br />\nFolding<br />\nrc--Zff<br />\n<br />\ne,<br />\n<br />\nN. E. COR. CALVERT AND LEXINGTON STREETS<br />\nJ. SHORB NEALE,President<br />\n<br />\nJewelers and Silversmiths<br />\n<br />\nLunches, Cigars<br />\nCigarettes<br />\n<br />\nia<br />\n5-<br />\n<br />\nLafayette Bank<br />\n<br />\nof Every Description<br />\n<br />\nBaltimore, Md.<br />\n<br />\n73T<br />\n<br />\nEnglish Clothes Tailored in America<br />\nFOR SPORT, DRESS, SOCIETY<br />\nHABERDASHERY<br />\n<br />\nGLASS<br />\n<br />\nA.<br />\n<br />\n>y<br />\n<br />\nClotites of Cusion,Qualit<br />\n14 N._CharlesSfreet<br />\n<br />\nW. H. Moore, Jr., Paper Co.<br />\n205 W.CAMDEN STREET<br />\n<br />\nLIBERTY<br />\n<br />\nJames—Did you ever pull the old A.H.Fetting Man'fg Jewelry Co.<br />\nExpert Cleaners and Dyers<br />\nManufacturers<br />\nman's leg?<br />\nSpecial Rates to Hopkins Men<br />\nGreek Letter Fraternity Jewelry<br />\nTim—Yes, off and on; it's a<br />\n211<br />\nE. 25th St.<br />\nHomewood 5205-W<br />\nST.,<br />\nLIBERTY<br />\n213<br />\nN.<br />\nBaltimore,<br />\nMd.<br />\none.—Octopus.<br />\nwooden<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 14, 1921<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\nImporters and Dealers in Fine Books<br />\n301 N. CHARLES ST.<br />\nBaltimore, Md.<br />\n<br />\nadf<br />\nv<br />\ne<br />\nAbeXatteri<br />\n4T<br />\n`1- -M ES H.6, OSCAR<br />\noWN E<br />\n*4?11/10e6la\" .e14 WI°<br />\n29 Baltimore St., East<br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\nThe Chas. Willms Surgical<br />\nInstrument Co.<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br />\n<br />\nJ. H. Furst & Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n<br />\nATTENTION ALUMNI<br />\n_<br />\nTHE NEWS-LETTER NEEDS YOUR SUPPORT<br />\nThe News-Letter, as you know, is edited and published by<br />\nthe students it gives the University news, and it gives all of it.<br />\nDuring the last few years in which the University has been<br />\nsteadily growing it has been very loyally supported by the student body. We have reached the time now, where the Board<br />\nfeels it is desirable to issue the NEWS-LETTER each Tuesday<br />\nand Friday during the collegiate year. And so, for the first time, it<br />\nis being done this year, at a cost of about $4,800.<br />\nAppearing twice a week will enable the editors to giye advance notice of all games, meetings, lectures and other interesting gatherings, as well as an immediate and complete account<br />\ninfor the benefit of those unable to attend. We know you are<br />\nin<br />\nterested in Hopkins' activities, in the progress of the dorms,<br />\nClub,<br />\nthe football team, lacrosse team, debating team, Dramatic<br />\nship<br />\nchampion<br />\nour<br />\nof<br />\none<br />\nof<br />\nmember<br />\na<br />\nwere<br />\netc. Perhaps you<br />\nyour<br />\nof<br />\nmemories<br />\nfond<br />\ncherish<br />\nyou<br />\nrate,<br />\nlacrosse teams—at any<br />\ntoday<br />\nof<br />\nactivities<br />\nthe<br />\nin<br />\ninterest<br />\nan<br />\nhave<br />\ncollege days, and you<br />\nat Homewood; for that reason we have taken the liberty of<br />\nplacing you on our subscription list, and your name will continue<br />\nthere unless you send in the coupon below.<br />\nSubscription price is $2.50 per year, payable on or before<br />\nJanuary 1, 1922. Won't you back us up and help make the new<br />\nsemi-weekly a tremendous success?<br />\nG. P. Fallon,<br />\nCirculation Manager,<br />\nHomewood.<br />\nPlease remove my name from the subscription list of the<br />\nNews-Letter.<br />\n<br />\nBuck Glass Company<br />\nManufacturers of<br />\n<br />\nGLASS 1OTTLES<br />\nMaryland<br />\n<br />\nBaltimore<br />\nIole Assorted Chocolates<br />\nAND<br />\n<br />\nLady Helen Chocolate Cherries in Cordial<br />\n<br />\nAre standards in their respective class of delicious confections<br />\nat popular prices.<br />\n<br />\nName<br />\nAddress<br />\nAsk Your Dealer for Them<br />\n<br />\nSCHOLARSHIPS FOR THIS YEAR<br />\n<br />\nChocolate Products Company<br />\n<br />\nlas Fooks.<br />\nCarroll: H. L. Holsopple (SenaMr. T. R. Ball, the registrar, has<br />\nBaltimore, Md.<br />\nC. R. Stouch, T. R. Gaither,<br />\nannounced the names of those who torial),<br />\nBrown (one year only).<br />\nwill receive scholarships for this C. R.<br />\nCecil: W. W. Aldrich (Senayear. The following members of<br />\ntorial), E. W. Jackson, W. T. Althe Class of 1925 won out in the reCall Calvert 1718<br />\nNorman James, President<br />\nderson.<br />\nFOR KEEN CUTTER HARDWARE<br />\ncent competitive examination:<br />\nGeo. H. Hunting, Vice-President<br />\nWills (Senator- Walter B. Wessels, Secretary-Treas.<br />\nW.<br />\nJ.<br />\nCharles:<br />\nLUCAS<br />\n17 E. Baltimore St.<br />\nAlbert S. Asendorf.<br />\nF. A. Ascherfeld, General Manager<br />\nMarine, Industrial, House<br />\n.<br />\nial)<br />\nGeorge A. Conner.<br />\nPAINTS<br />\nDorchester: H. M. Seitz (SenaHopkins scholarships have also<br />\nPrinters of the<br />\ntorial), Henry Leonard.<br />\nbeen awarded to<br />\nBUILDING LUMBER<br />\nJohns Hopkins News-Letter<br />\nFrederick: 0. M. Shipley (SenAlbert G. Langluttig, 1922.<br />\nand Yardsatorial), T. C. Routson, C. R. Ken- Office ALICEANNA ST., cor. Exeter<br />\nHarry Eagle, 1924.<br />\n921<br />\nnedy (one year only), M. L. R.<br />\n609 W. LEXINGTON ST.<br />\nBaltimore, Md.<br />\nTheir names were inadvertently<br />\nManahan.<br />\nT.<br />\nW.<br />\ner,<br />\nRanneberg<br />\nomitted when the undergraduate<br />\nGarrett: A. C. Michael (Sena- Chas. L. Cunningham & Co.<br />\nhonors were announced at comtorial).<br />\nStewart Taxi Service Co.<br />\n(Licensees)<br />\nmencement.<br />\nHanford: W. H. Somerville<br />\nN<br />\nLANE<br />\nGARRISO<br />\nCollege<br />\n20-30<br />\nCity<br />\nThe Baltimore<br />\nNear Baltimore St.<br />\n(Senatorial), C. C. Davis, A. L.<br />\nCall Mt. Vernon 1 1<br />\nAlumni Scholarship has been<br />\nTipton.<br />\nSTRIPS<br />\nR<br />\nWEATHE<br />\nMETAL<br />\n'25.<br />\nawarded to J. Wilson Hunter,<br />\nfor<br />\nTaxi Cabs and Touring Cars<br />\nHoward: Noble Watkins (SenThe Z. Morton Katz Memorial<br />\nWINDOWS and DOORS<br />\natorial).<br />\nScholarship has been awarded to<br />\nPhones—C. & P., Long Distance<br />\nMontgomery: W. W. Stabler<br />\nWilliam T. Hart, '25.<br />\n(Senatorial), J. M. Mount, T. A.<br />\nThe A. Z. Hartman Memorial<br />\nWilson, Lloyd W. Hyatt (one year<br />\nScholarship went to Lawrence B.<br />\nUse MORGAN'S CARBOLATED<br />\nCollege Literature<br />\nonly).<br />\nAn Unusual Beauty Shop<br />\nFenneman, '23.<br />\nBABY POWDER for Chafing<br />\nPrince George's: H. E. Smith<br />\nLOMBARD and SOUTH STREETS<br />\nOur Exclusive Tailored Sport<br />\nThe Scholarship for 1921-22, in<br />\nl), Ralph McLane, R.<br />\n(Senatoria<br />\nand Itching for Adults and<br />\nBlouses a Specialty<br />\nthe Johns Hopkins University,<br />\nSHOES<br />\nFontz, Jerome Pollock.<br />\nnt<br />\nfolMeasureme<br />\nas<br />\nor<br />\nng,<br />\nYour<br />\nMade to<br />\nSchool of Engineeri<br />\nChildren.<br />\nfor<br />\nQueen Anne's: G. J. Hill,<br />\nlows:<br />\nN. CHARLES ST.<br />\n517<br />\n(Senatorial), W. E. Hopkins.<br />\nBaltimore, Maryland<br />\nUNIVERSITY MEN<br />\nBALTIMORE CITY<br />\nSomerset: Laban Saltz (SenaCarFirst Legislative District:<br />\nFor Sport Wear<br />\nFor Dress<br />\ntorial), H. E. Cannon.<br />\nHensen (Senatorial), Samuel<br />\nLeathers<br />\nvel<br />\nest<br />\nStyles—B<br />\nSmart<br />\nSt. Mary's: F. J. Rich (SenaDoes the C. P. A. degree, a caBernstein, L. J. Gould, Samuel<br />\nModerate Prices<br />\ntorial).<br />\nreer<br />\nas a public accountant or tax<br />\nSteinberg, Allan See, C. W. SieTalbot: L. B. Kinnamon (Senspecialist, an executive position<br />\ngrist.<br />\natorial), J. N. Murphy, 0. S. Mulas Controller, Treasurer, Auditor<br />\nSecond Legislative District: J.<br />\nor Office Manager appeal to you?<br />\nMENTS<br />\nlikin.<br />\nCOMPLI<br />\nF. Sollers (Senatorial), B. Kurrel19 W. LEXINGTON ST.<br />\nPace courses, standardized and<br />\n(SenWolf<br />\non:<br />\nE. F.<br />\nWashingt<br />\naccredited, available in evening<br />\nmeyer, A. Freeman, J. B. Powell,<br />\natorial), A. A. S. S. Simon.<br />\nclasses, have for years afforded<br />\n'E. J. Schafer, R. W. Lutz.<br />\nWicomico: W. H. Rawson (SenMUSICAL CLUBS HOLD ORpreparation for professional AcA.<br />\nJ.<br />\nDistrict:<br />\ne<br />\nLegislativ<br />\nThird<br />\nGANIZATION MEETING<br />\natorial).<br />\ny practice and for execcountanc<br />\ne<br />\nDemocratic Candidat<br />\nNaviasky (Senatorial), D. K. Vanutive<br />\nin business.<br />\npositions<br />\n(Sen:<br />\nJ.<br />\nWigton<br />\nR.<br />\nWorcester<br />\n4<br />\ncol.<br />\nContiuued from page 1,<br />\nneman, L. F. Mathews, Jos. Kapof Wills<br />\nW. P. Taylor, W. H.<br />\nRegister<br />\natorial),<br />\nManager, Hugh M. Smallwood. lan, J. T. Dixon, F. L. Moehle.<br />\nHouston, Jr.<br />\nFirst Tenors—Gould, Harwood. Fourth Legislative District: A.<br />\nCOLLEGES<br />\nSecond Tenors—Hopkins, Kap- H. Senner (Senatorial), R. C. DanSt. John's: W. B. Tucker.<br />\nFALL CLASSES NOW FORMING<br />\nlan, Torsch, Houston, Hall, Belt, nettel, J. F. Strot, Michael Cohn,<br />\nCall or Write for Bulletin<br />\nSCHOLARSHIPS \"AT LARGE\"<br />\nSt. Paul 1469<br />\nCharles Morrison.<br />\nRussell, Rich, Norwood.<br />\nFrank Wilen, M. R. Gilpin, Jr..<br />\n201-208<br />\nEQUITABLE BLDG.<br />\nCOUNTIES<br />\nFirst Basses—P. Parsons, J. W.<br />\nD. C. Turnbull, Jr., H. W. Grace,<br />\nParsons, Barrett, Kinneman, Mor- Allegany: W. J. Oglebay (Sena- R. C. Tilghman, H. H. Botchelor<br />\nrell, Kirkley, Council.<br />\ntorial), J. F. Porter, J. T. Martin. (one year only).<br />\nger,<br />\nichelber<br />\nBasses—E<br />\nSecond<br />\nAnne Arundel: F. B. Crider<br />\nGross,<br />\nElgert,<br />\n,<br />\nSherwood<br />\nCroker,<br />\n(Senatorial), S. H. Pratt, W. H. INTERFRATERNITY BOARD RULING<br />\n4-6 WEST FAYETTE ST., BALTIMORE<br />\nContinued from page 1, col. 2<br />\nLeonard.<br />\nKing, Crider,<br />\nCooper.<br />\n31. The ruling<br />\nBaltimore: Donald Reese (Sen- Monday, October<br />\ndesigned to<br />\nis<br />\nTuesday<br />\npassed<br />\nP. I. HeyART GOODS<br />\n\"You know, I told Maybelle last atorial), G. M. Ruoff,<br />\nand makes<br />\nrule<br />\nthis<br />\nnt<br />\nsuppleme<br />\nWorthing<br />\nL.<br />\nE.<br />\nDavis,<br />\nF.<br />\nH.<br />\nman,<br />\nher.\"<br />\nnight that I loved<br />\nit virtually hopeless for a freshton, E. H. Salter.<br />\nCutlery, Kitchen Utensils<br />\n\"You don't mean it!\"<br />\nChina and Table Glassware<br />\nSlaughter (Sen- man to expect any overtures from<br />\n\"No, I don't; but she thinks so.\" Caroline: J. D.<br />\nmen until October 31.<br />\n—Scalper. atorial), Kennard Finder, L. Doug- fraternity<br />\n<br />\nThe James Lumber Co.<br />\n<br />\nLexington Paint ear<br />\nHardware Co.<br />\n<br />\nKALLOTHENEION<br />\n<br />\nAccountancy<br />\n<br />\nWYMAN<br />\n<br />\nHoward W.Jackson<br />\n<br />\nBaltimore<br />\nPace Institute<br />\n<br />\nJ. Seth Hopkins-Mansfield Co.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVI. No.#<br /><br />\nPRICE 5 CENTS<br /><br />\nBALTIMORE, MD., OCTOBER 14, 1921<br /><br />\nA. A. BOARD HOLDS FIRST<br />\nMEETING OF YEAR<br /><br />\nDRAMATIC CLUB TO PRESENT PLAYLET IN DECEMBER<br /><br />\nSeveral Elections and Appointments Many Candidates Needed. Major Production Will Probably Be Given<br />\nMade. Special Meeting Called<br />\nin March.<br />\nfor October 24.<br /><br />\nHOPKINS TO<br /><br />\nMEET<br /><br />\nDICKINSON<br />\nBLACK AND BLUE TO BE PUT<br />\nTO REAL TEST TOMORROW<br /><br />\nAt the meeting- ef the A. A. The Johns Hopkins Dramatic<br />\nDickinson Expected to Present Strong<br />\nBoard Monday, Bartow Griffiss Club will make its first public apLineup.<br />\nwas elected graduate delegate to pearance of the scholastic year on<br />\nthe board in place of Eric Calkins, or about December first when two<br />\nJohns Hopkins will be put to a<br />\nHOPKINS.<br />\nPosition<br />\nDICKINSON<br />\nreal test tomorrow when Dickinwho was made ineligible for the short plays will be presented. The<br />\nL E<br />\n1 Middleton<br />\nRich 12 or Goeltz 1<br />\nPosition to which he was elected actual plays which will be given<br />\nson College's eleven visits BaltiL T Shields 13 or Blumenthal 2<br />\n21 Westerman<br />\nmore. The gridders from Carlisle<br />\nwhen he entered the Medical have not yet been definitely dehave<br />\nShahodi<br />\n3<br />\nexhibited a great deal of<br />\nSchool.<br />\nall<br />\nin<br />\nupon,<br />\nbut<br />\nL<br />\nG<br />\ncided<br />\nprobability<br />\n13 Magill or 22 Council.<br />\nstrength<br />\nin their two starts thus<br />\nEli Frank, Jr., was elected they will be selected from the fol0 Totterdale or<br />\nfar<br />\nthis<br />\nyear.<br />\nJuniata College,<br />\ntreasurer of the association. Gil- lowing: A Roadhouse in Arden,<br />\n. Smith 4<br />\n31 Cromwell<br />\nson Engel and Joseph Thompson, by Philip Moeller; Medicine Show<br />\nwhich<br />\nthey<br />\nmet<br />\ntwo weeks ago<br />\nCook 5<br />\nR G<br />\n3 Landy<br />\nwas<br />\ncheering<br />\neasily<br />\ndefeated<br />\nwho did so well with the<br />\n45-0. Last Satby Stuart Walker and a wild westSharp 6<br />\nR T<br />\n4 Knecht<br />\nurday they held Lafayette to four<br />\nSaturday, were made official cheer ern play by Susan Smith. These<br />\nHall 14 or Crawley 7<br />\n• .R.E<br />\n11 Rich<br />\ntouchdowns. This latter feat wa<br />\nplays are intended primarily for<br />\nleaders.<br />\n. Pipa (c) 8<br />\nWilson<br />\n6<br />\nDarley<br />\nor<br />\nthe more remarkable of the two,<br />\nNo action was taken on the rec- freshmen and other inexperienced<br />\nQ B<br />\nLafayette possessing a team<br />\nTemplin 9<br />\nommendation of Football Man- men and will enable the members<br />\n7 Spinney or 9 Coady. L H B<br />\nwhich<br />\nhas been declared by many<br />\nager Brawner .fOr the position of of the club to get a line on prosDailey<br />\n10<br />\nR H B<br />\n29 Willis<br />\nexperts<br />\nas one of the strongest of<br />\nfirst assistant manager. The mat- pects for the big production to be<br />\nWortacnik 11<br />\n14 Calkins or 19 Markell F B<br />\nthe year. The victory over Pitt<br />\nter was tabled until Dr. Van Or- presented early in the spring. Both<br />\nfulfilled the predictions of Coach<br />\nman could be consulted. Joseph of these playlets will be coached<br />\nVan Orman, who expected LafayLeopold was, however, appointed by the Altimni Council of the club<br />\nSI JBSTITUTIONS<br />\nette to produce a super-machine.<br />\ncomposed of Harry Morriss,<br />\nmanager of Freshman football.<br />\n15 Sayes<br />\n5 Barton<br />\nDickinson was outclassed in the<br />\nThe cases of several men who chairman; Terry Burger, Donald<br />\n16 Hess<br />\n10<br />\nHarwood<br />\ncontest with Lafayette even more<br />\nlast year earned letters, but were Mossom and Frank Smith and<br />\n17 Satterlie<br />\n12 Bonner<br />\nthan was Hopkins against Georgenot awarded them forTone reason the officers of the club: Gilson<br />\ntown last year, but offered a stiff<br />\nor another were discussed on the Engel, president; Eli Frank, sec18 C. Davis<br />\n16 Rones<br />\nretary<br />\n,and<br />\nPierce<br />\nopposition to the victors.<br />\nBrawner,<br />\ntreasbut<br />\nfinal<br />\nfavorably,<br />\nwhole rather<br />\n19 Beighle<br />\n18 Ellsworth<br />\nThe Carlisle team is reported to<br />\nurer.<br />\ndecision on them was deferred<br />\n25 Rowland<br />\nespecially strong in the aerial<br />\nbe<br />\nIf any man expects to make the<br />\nuntil special meeting which has<br />\n37 Turnbull<br />\nattack.<br />\nThe team has been<br />\nbeen called for October 24 when club this year it will be absolutely<br />\ntrained<br />\non<br />\nboth long and short<br />\nit is hoped Dr. Abercrombie and necessary to come out for these<br />\npasses and has used both very<br />\nDr. Van Orman will be present. plays. There is practically no<br />\nsuccessfully.<br />\nEvery man in the<br />\nCommittees were -appointed by chance of a man making the cast<br />\nMUSICAL CLUBS HOLD ORLACROSSE PRACTICE TO<br />\nbackfield<br />\nis<br />\nexpert<br />\nin heaving the<br />\nPresident Knecht to investigate in the main production if he does<br />\nGANIZATION MEETING<br />\nSTART MONDAY<br />\nball and several of the wing men<br />\nthe coaching problem for the four not gain some experience by actMany More Candidates Needed. AtNumber of Veterans Return<br />\nare declared excellent receivers.<br />\nteams now without coaches. Bar- ing in these minor plays. No extractive Schedule Provided.<br />\nlacrosse<br />\nHopkins defense against the passThe fall practice of the<br />\ntow Griffiss is chairman of the la- )erience of any kind is really needThe combined musical clubs ing game was top-notch last week<br />\ncross committee and is assisted by ed by men who want to try out for quad will start Monday afternoon<br />\nheld their organization meeting in and if Darley and Spinney are up<br />\n\"Mike\" Bowers; baseball, Shar- these playlets and the Dramatic at 4.30, according to Manager<br />\nthe<br />\nBarn Wednesday evening. to standard tomorrow, a spectacetts, chairman, a.fid Knecht;swim- Club urges everyone who possibly Hensel. Practice will be held regPresident<br />\nHambleton and \"Doug\" ular game should result.<br />\nchairman,<br />\nand<br />\nMiddleton,<br />\nming,<br />\ncan to compete. A great many ularly thereafter each Monday,<br />\nCoulter,<br />\n'21,<br />\nLandy,<br />\nwho is directing the<br />\nbasketball,<br />\nEdwards;<br />\nDickinson's only problem this<br />\nmembers of the club graduated Wednesday and Friday until DeGlee<br />\nClub<br />\nand<br />\njazz band this year has been to produce a backchairman, and Totterdale.<br />\nlast June and their places must be cember.<br />\nJohn Knipp, coach of last year's year, made short addresses in field that will include a good kickfilled.<br />\nThe big annual production of squad, will again handle the men. which they explained that the er. Hopkins showed an improveN. D. U. DRAMATISTS ADOPT<br />\nthe<br />\nDramatic Club will, be given and will probably be assisted, as clubs are undertaking this year ment in this department last SatINSIGNIA<br />\nsome<br />\ntime early in Lent, about n previous years, by \"Father Bill\" the most ambitious and attractive urday and should have nothing to<br />\nThe Playmakers of the Universchedule ever attempted at Hop- worry about in that line.<br />\nMarch<br />\n10. Although it is too early Schmeisser.<br />\nsity of North Dakota, a dramatic<br />\nkins. Membership in the clubs is<br />\nturn<br />\nurged<br />\nto<br />\nare<br />\ncandidates<br />\nIn the game with Delaware,<br />\nAll<br />\norganization, has adopted as its in- at present to decide definitely on<br />\nto<br />\nbe<br />\nentirely<br />\ncompetitive,<br />\nand<br />\nfine<br />\nopa<br />\npractice,<br />\nfall<br />\nomitting the first quarter, a wonsignia a replica of the buffalo mask the play to be given the club al- out for the<br />\nfor this reason a larger number of derful improvement was noticed<br />\nand<br />\nwork<br />\nready<br />\nseveral<br />\nstick<br />\nhas<br />\nplays<br />\nlearn<br />\nunder<br />\nconportunity<br />\nto<br />\nused by the Dakotah Indians in<br />\nsideration. Foremost among these the fundamentals of the game be- candidates from which to choose at all positions. Although there<br />\nhunting buffaloes. It represents<br />\nis absolutely necessary. Good was no individual star, every man<br />\nthe head of a buffalo, this head be- are The Scarecrow, by Percy ing afforded.<br />\nby St. John Hankin ; Captain<br />\nSticks will be issued to all can- men are needed in order that the played his position well. Both<br />\ning made from a pelt and decorated<br />\nrequested to concerts planned may be ren- Darley and Wilson ran the team<br />\nin such a manner as to insure the, MacKaye ; The Prodigal's Return, didates, but they are<br />\nJenks, by Clyde Fitch, and Seven bring old shirts, trousers and dered in a manner which shall be ell. Willis and Calkins proved rehunter coming in close range of his<br />\nworthy of a Hopkins organization, liable, consistent ground gainers.<br />\n'Keys to Baldpate, by George M. shoes for the initial practice.<br />\nprey.<br />\nCohan. Miss Walters, who has<br />\nWhile a few of last year's team: While there is need of many more The former, no longer handiA movement is contemplated by<br />\ncoached the club for the last few Stuart, Reed, Kennady and Wood candidates of all types of voice, capped by a wrenched ankle,<br />\nmeans of which it is hoped that all<br />\ngraduation, enough the most urgent need is for first looks 100 per cent, better than<br />\nthe dramatic societies of the North years, will probably act in that —were lost by<br />\ncapacity this year. However, the old men have returned to form a tenors. At present there are only last week. Spinney also showed a<br />\nDakota high schools can be organattention of the club will not be nucleus for the coming season. two in the Glee Club. Although vast .improvement, his ability at<br />\nized into a state society to be called<br />\nsaid to be, however, many of last year's men are back, receiving forward passes eliciting<br />\n\"The Junior Playmakers.\" This centered on the main production There are<br />\npositions<br />\nopen for those I-1 ambleton said that he hoped to much applause. Middleton and<br />\nof<br />\nafter<br />\nthe<br />\ntwo<br />\nplenty<br />\nuntil<br />\npreliminary<br />\nwill, no doubt, be a great service to<br />\nhave at least five times as many Rich looked good on the wings.<br />\nand work.<br />\nout<br />\ncome<br />\nto<br />\nsuccessful<br />\nwilling<br />\nplays are<br />\npresented.<br />\nthese clubs which now exist under<br />\nmen out for the clubs at the next Westerman was another who<br />\nthe<br />\nerected<br />\nwall<br />\nconcrete<br />\nThe<br />\nvarious names, as it will raise their<br />\nmeeting.<br />\nshould<br />\nbe<br />\nearly part of this year<br />\nshowed a 100 per cent, improvestandard in every respect. Annual INTERFRATERNITY BOARD RULING<br />\nThe season opens soon after ment over last week. He and MaConsidin<br />\npractice.<br />\naid<br />\nvaluable<br />\na<br />\ncompetition can be easily made posFreshmen who were prominent ering the number of veterans re- Thanksgiving with a concert at gill presented an airtight<br />\ndefense.<br />\nsible in the drama in much the same in prep school and who expect to<br />\nEvergreen, to be followed later by Totterdale marked his return to<br />\nplenty<br />\nof<br />\nfor<br />\nprospect<br />\nmaining<br />\nthe<br />\nway as the athletic teams represent- be feted, dined and wined by the<br />\nmaterial and the availability similar entertainments at Gou- the game by a number of vicious<br />\ning the various high schools com- local frats in order to attract them raw<br />\nthe expert services of Coach cher, Western High, State Nor- tackles, several of them for conpete in the interscholastic meet now into the fraternity might as well of<br />\nKnipp and \"Father Bill\", it seems mal, Eastern High, Tome, Annap- siderable losses. Landy and<br />\nheld by the university.<br />\ngive up hope, according to a ruling<br />\nas if the future of this year's la- olis, Millersville and Washington. Knecht deserve all the credit givmade Tuesday by the Interfrater- crosse team should be a bright A concert will be given in Balti- en them by the<br />\nlocal press for<br />\nnity Board, freshmen may not be one.<br />\nmore at Lehmann's Hall in the their wonderful offensive work.<br />\nentertained by fraternity men in<br />\nSENIOR PICTURES<br />\nspring. During the Easter holi- Time after time the pair tore enorHulany way previous to October 31.<br />\nthe<br />\nSeniors are urged by<br />\ndays it is planned to take the club mous gaps through Delaware's<br />\nATTENTION, HULLABALOO<br />\nThe ruling reads as follows:<br />\nlabaloo Board to have their individon a tour through Western Mary- left side of the line for the runs<br />\nCANDIDATES<br />\nual photographs taken as soon as \"No fraternity man shall spend<br />\nThere will be a meeting Tues- land, visiting Cumberland, Fred- of Willis and Calkins.<br />\nPossible. It has been pointed out money on a freshman or entertain day, October 18, of candidates for erick, Hagerstown and WestminTwo new men, Rowland and<br />\nthat the best time for this to be done a freshman in his home at meals<br />\nster.<br />\nCouncil, were substituted on the<br />\nthe editorial, art and business<br />\n1., sometime in October, for if it is or over night.\"<br />\nWhile no attempt was made at inc during the course of the game.<br />\nstaffs of the Hullabaloo in the<br />\nLast spring the Intercraternity<br />\nleft till later the photographer will<br />\nthe meeting to classify the mem- The former went in at tackle for<br />\nHullabaloo office at 12.30.<br />\nbe hampered by the Christmas rush Board passed a ruling which specibers of the Instrumental Club, the Knecht, who received a muscle<br />\nand after that will be busy with the fied that the \"rushing\" season for<br />\nfollowing shows the composition bruise on his upper left arm. CounNOTICE<br />\ngroup pictures. A card authoriz- fraternities shall not begin until<br />\nof the Glee Club as it now stands: cil, who substituted at guard,<br />\ning a photograph may be obtained me-half hour before the beginning<br />\nPresident, Waldo Hambleton. weighs 220 pounds and is a freshA meeting of Sigma Chi Beta<br />\nat any time from E. G. Huey, the of instruction of the first class on will be held this evening at 7:30<br />\nTreasurer, Bernard Kuder.<br />\nman. He was a teammate of Wilbusiness manager.<br />\nat the K. A. House.<br />\nContinued on page 4, col. 3<br />\nContinued on page 4, col. 1<br />\nContinued on page 2, col. 1<br /><br />\nLineup For Tomorrow's Game<br /><br />\n404<br /><br />\nT HE JOHNS HOPKINS NEWS-LETTER, OCTOBER 14, 1921<br /><br />\n2<br /><br />\nIS TRUE THAT THE UPPER S. I. N. A. ADOPTS PLAN FOR<br />\nDISTRIBUTION OF NEWS<br />\nCLASSMEN SHOULD HELP THE<br />\nSOPHS ENFORCE THE REGTo Establish Two News Centers. Will<br />\nFOUNDED 1897.<br />\nA Column in Which the Correspondents<br />\nULATIONS<br />\nFacilitate Exchange Between<br />\nAre Allowed Latitude, But ShoulMember Colleges.<br />\n-LETTER.<br />\nNEWS<br />\nthe<br />\nof<br />\nEditor<br />\nResponsibility.<br />\n$2.50<br />\nthe<br />\nder<br />\nSubscription<br />\npublication<br />\nfor<br />\nAll letters intended<br />\nDEAR SIR: It seems to me as<br />\nThe Southern Intercollegiate<br />\nmust be concise.<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nattention will be paid to anony- though Freshmen regulations at Newspaper Association, which was<br />\nNo<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nmous letters, but n'ames signed as an<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br /><br />\nIT<br /><br />\nHopkins are looked upon in the organized last spring at a meetwrong light by most of the upper ing of representatives from the<br />\nclassmen. They seem to look upon leading college newspapers of the<br />\nthem as something imposed upon South, held at Richmond, has dethe Freshies by the Sophomores. vised a plan that will facilitate the<br />\nHomewood 100<br />\nTelephone<br />\nThis is really not the case; the idea distribution of • news among its<br />\nAN IDEA THAT WILL BEAR<br />\nbeing, not to stir up fights between members and enable them to pubBusiness Manager:<br />\nEditor-in-Chief:<br />\nINVESTIGATION<br />\nthe two lower classes, as so many lish news from other colleges at the<br />\nH. DOUGLAS COTTON,'22,<br />\nFREDERICK W. LIPPS, '22.<br />\n1921.<br />\n10,<br />\nOctober<br />\nseem to think, but to give to the new ;ame time as the home paper.<br />\nActing Managing Editor:<br />\nCirculation Manager:<br />\nWILLIAM H. MOORE, JR.<br />\nmen the true college spirit. This<br />\nThis plan provides for the diEditor-in-Chief,<br />\nGLOVER P. FALLON, '23.<br />\nby the co-opera- vision of the Association's members<br />\ndone<br />\nbe<br />\nAssociate Editors:<br />\nonly<br />\ncan<br />\nJohns Hopkins NEWS-LETTER.<br />\nEDWARD G. HUEY, '22.<br />\nAdvertising Manager:<br />\ntion of the three upper classes in into a northern and southern exELI FRANK, JR., '22.<br />\nDONALD K. VANNEMAN, '23.<br />\nDEAR SIR:<br />\nThe :hange system. One paper of each<br />\nenforcing the regulations.<br />\nJunior Editors:<br />\nIt is a commonly known fact main burden of the talk has natur- system is to serve as an exchange<br />\nAssistant Business Managers:<br />\nCHARLES C. MARBURY, '22.<br />\nBERNARD C. HEARN, '23.<br />\naround the University that the many alv been placed upon the shoulders center. The Richmond Collegian<br />\nLAWRENCE B. FENNEMAN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nJ. BRENTNALL POWELL, '23.<br />\nactivities, both athletic and non-ath- of the Sophs, who are still aware of has offered its services as the cenFITZGERALD DUNNING, '24.<br />\nCRAIG E. TAYLOR, '24.<br />\nletic, are in need of funds. This -he great benefits received from this ter for the more northern colleges,<br />\ntraining; moreover, the and it is probable that Atlanta or<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nbeing the case, it hardly seems Freshman<br />\nJuniors and Seniors are too busy some point in that vicinity will<br />\nlargest revthe<br />\nof<br />\none<br />\nthat<br />\nright<br />\nMd.<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore,<br />\nwith other college work to give serve as the southern center. Acenue-producing stores on the cam- proper attention to this work.<br />\n-ording to the plan, each paper will<br />\npus should be in the hands of an<br />\nIt is my earnest hope and plea nail to each of these centers a copy<br />\nBALTIMORE, MD., OCTOBER 14, 1921<br />\n\"outsider.\" I mean the soda foun- that the. upper classmen will realize of its intercollegiate.news, and the<br />\ntain and lunchroom in the Barn. the facts and do their part towards centers will forward to each paper<br />\nWHERE WERE THE UPPER CLASSMEN?<br />\ncollege spirit, or in their territory the combined<br />\nthese privileges are held making better<br />\nThe cheering last Saturday was a disgrace to the University. Of course,<br />\nit would be better to do news of all the schools. Under this<br />\notherwise<br />\nThe Freshmen did their best, but where were the upper classmen? for a certain length of time by a away with the regulations entirely, system each publication will write<br />\nCertainly not in the rooting section. As an outsider said, \"No one is contract, but at the expiration of the for under the present method they but two letters containing the<br />\ncheering but the Freshmen and they only cheer because they have contract the Trustees should give do more harm than good.<br />\nnews, whereas, if each mailed its<br />\nto.\" That's an awful impression for a visitor to carry away with him, the concession to the students<br />\nown news, it would have to write<br />\nYours very truly,<br />\nisn't it?<br />\nBETTER COLLEGE SPIRIT. forty or more. The costs of the exthemselves, so that it may be operAnd yet there was certainly sufficient foundation to create such<br />\nchange system are to be borne by<br />\nated to support their activities.<br />\nan impression. Not more than fifty upper classtnen and hardly half<br />\nthe Association.<br />\nATHLETIC GOSSIP<br />\nAt the present time the rights are<br />\nthe Freshman class backed up the team in organized cheering. A<br />\nThe Association is now composed<br />\nSyracuse, 42; Maryland, 0! You<br />\nheld for a nominal sum, and the inpitiful showing, indeed.<br />\nsee, Curley, \"You can fool all of f the following members:<br />\nHow do you upper classmen expect the Freshmen to learn the come is exceedingly large. I claim<br />\nthe people some of the time, and 1. The Yellow Jacket, Randolphcheers, to back up the team whole-heartedly unless you help them? that this income should apply to- some of the people all of the time,<br />\nMacon College, Ashland, Va.<br />\nDo you think that you are demeaning yourself if you are seen in the wards the support of student activbut-\" well you know the rest by 2. Johns Hopkins News-Letter,<br />\ncheering section? or are you just lacking in college spirit In plain<br />\nities. The contract holding these now. Even Untz Brewer's toe<br />\nJohns Hopkins University,<br />\nwords, what the h-l's the matter with you?<br />\nits<br />\nof<br />\nout<br />\nplaying<br />\nteam<br />\na<br />\nsave<br />\ncan't<br />\nduraBaltimore, Md.<br />\nThe team needs support. The fellows who are on the squad are rights is only of one year's<br />\nclass.<br />\nof<br />\nfirst<br />\nThe<br />\nBlue &amp; Gray, Hood Colthe<br />\n3.<br />\non<br />\nout<br />\nruns<br />\ndeto<br />\nand<br />\nyou<br />\ntion,<br />\nmuch<br />\nto<br />\nexpect<br />\ntoo<br />\nit<br />\nIs<br />\nspare<br />\nmoment.<br />\ngiving up every<br />\n,<br />\nactivities<br />\nthe<br />\nFrede'rick, Md.<br />\ncan't<br />\nWhy<br />\nJanuary.<br />\nthem?<br />\nhelping<br />\n-buddies,\"<br />\nto<br />\nvote two hours a week<br />\nFfoin his Delaware<br />\nexpendiTopics, University of<br />\nCollege<br />\n4.<br />\nstudent<br />\nof<br />\nfizzle.<br />\nbenefit<br />\nSaturday's<br />\nlast<br />\nup<br />\nthe<br />\nfor<br />\nmake<br />\nreap<br />\nand<br />\nSnap into it tomorrow<br />\nwe learn that Booth, the long-disVirginia,<br />\nCharlottesville, Va.<br />\ntures from then on?<br />\ntance speed king, is nicknamed \"the<br />\nMore detailed plans can be test-tube.\" Wonder what Delaware 5. Ring-turn Phi, Washington &amp;<br />\nworked out, but the tentative plan would dub McLane?<br />\nLee University, Lexington,<br />\nISN'T IT TRUE?<br />\nwould be to have the Student CounVa.<br />\n(Exchange Editorial)<br />\nMt. St. Mary's played Susque- 6.<br />\ncil or the Homewood Company take<br />\nThe Cadet, Virginia Military<br />\nA great hue and cry frequently.is raised decrying the value of charge. They. could hire a man- hanna to a 0-0 tie last Sattirday.<br />\nInstitute, Lexington, Va.<br />\ncollege activities. Men come to college to acquire knowledge and ager and several assistants, who, Thus, the Mounts have not won a 7. The Brackety-Ack, Roanoke<br />\nlearn how to think, it is said, and the only way in which they may do with the possible exception of the game so far this year, yet they<br />\nCollege, Salem, Va.<br />\nthis is to apply themselves diligently to their lessons and as far as manager, would be students trying have had a total of but three points<br />\n8. The Virginia Tech, Virginia<br />\npossible remain oblivious of every other person on the campus. Such to work their way through college. piled against them. Rather a pePolytechnic Institute, Blackspeople delight in characterizing college activities as the \"side shows\" The net profits would be divided, culiar record for football!<br />\nburg, Va.<br />\nin some fair ratio, between the Athof the campus.<br />\nCashell, member of Hopkins' 9. The Orange &amp; White, UniverEd<br />\nIt must be granted that there is danger that a student will become letic Association and the Varsity<br />\ngridiron squad for the last few<br />\nsity of Tennessee, Knoxville,<br />\nso interested in activities other than study that he will lose sight of Seal Voting Council, to apply to<br />\nJohn's ColSt.<br />\nentered<br />\nhas<br />\nyears,<br />\nthings academic. It is possible he will place the chief emphasis on athletic and non-athletic activities.<br />\nlege and is playing football there. 10. The Burr, Louisiana College,<br />\nThe advantages of this plan are:<br />\ncampus life, and in doing so wrongly stress things less of value than<br />\nPineville, La.<br />\n1. It would give some deserving<br />\nothers he might choose. But there is also a danger, just as grave, that<br />\nThe Princeton-Navy game will<br />\ntermed<br />\npure<br />\ntheir<br />\nis<br />\nwhat<br />\nand<br />\nearn<br />\nmen an opportunity to<br />\na man will become so engrossed in books<br />\nnot cause a drop in paid attendance 11. The Emory Wheel, Emory University, Georgia.<br />\nstudy that he will 'leave college narrow of vision and clear out of education.<br />\nat Homewood Field tomorrow, as<br />\n2. It would supply the Athletic was at first feared. Announcement 2. The Gamecock, University of<br />\ntouch with his fellows.<br />\nThe fortunate man is he who realizes that slighting academic Association and Varsity Seal Vot- has been made that only those holdSouth Carolina, Greenville,<br />\nwork is only slighting himself, but who also identifies himself with ing Council with much needed ing passes will be admitted to FarS. C.<br />\nsome college activity, and, working on it, aids not only the school, funds.<br />\nragut Field.<br />\n13. The Davidsonian, Davidson<br />\n3. It would help us to keep the<br />\nbut broadens his own experience in dealing with them.<br />\nCollege, Davidson, N. C.<br />\n\"Hello, old dear, where have you<br />\nCollege activities are not the \"side shows\" of college. They are minor sports going.<br />\n14. The Salemite, Salem College,<br />\nthe laboratories of all the other departments. They are practical 4. It would make it unnecessary been?\"<br />\nWinston-Salem, N. C.<br />\nto ask men who go out and work \"Traveling. By the way, old top,<br />\ntraining courses of life.<br />\nThe<br />\nCritiograph, Lynchburg<br />\nfor the football to pay part of the passed your town the other day.\" 15.<br />\nCollege,<br />\nLynchburg, Va.<br />\nWhat<br />\nit?\"<br />\n?<br />\nof<br />\ndidja<br />\nthink<br />\n\"Didja<br />\ntable.<br />\ntraining<br />\nthe<br />\nof<br />\nside<br />\nexpenses<br />\nshort<br />\nthe<br />\n'<br />\nmation and through<br />\nBLACK'AND BLUE TO BE PUT<br />\nThe<br />\nSun<br />\n16.<br />\nThere<br />\nDial, Randolph-Mait,<br />\nthe<br />\nreally.<br />\nsee<br />\nmake<br />\n\"Couldn't<br />\nshort,<br />\nin<br />\nwould,<br />\nTO REAL TEST TOMORROW<br />\nline<br />\nIt<br />\n5.<br />\nside<br />\nof the line on several<br />\ncon<br />\nold<br />\nsiding,<br />\nHopCollege, LynchWoman's<br />\ncar<br />\nby<br />\non<br />\nbox<br />\na<br />\nwas<br />\nthe<br />\nspent<br />\nfrom<br />\nmoney<br />\nprofit<br />\nContinued from page 1, col. 5<br />\nplays.<br />\nburg,<br />\nVa.<br />\n-Goblin.<br />\nboost<br />\nHopkins<br />\nchap.\"<br />\nhelp<br />\nThe open spectacular type of kins students<br />\nus and Jones at prep school and<br />\n17. The Rotunda, Farmville Norbrought many expressions of activities.<br />\nplay<br />\ndemonstrated by his performance<br />\n?\"<br />\nDiogenes<br />\nmake<br />\nthe<br />\nwould<br />\nit<br />\nsad,<br />\nso<br />\n\"Why<br />\nlast,<br />\nAnd<br />\n6.<br />\nmal School, Farmville, Va.<br />\nsecreserved<br />\nthe<br />\nfrom<br />\nsatisfaction<br />\nSaturday that he hasn't forgotten<br />\nHarvard<br />\nthrough<br />\nactivity<br />\nwas<br />\ngoing<br />\n\"I<br />\nstudents'<br />\nreal<br />\na<br />\nBarn<br />\nscatthe<br />\nIf<br />\ngrandstand.<br />\n18. The Hampden-Sidney Tiger,<br />\ntion of.the<br />\nthe game.<br />\nHampden - Sidney College,<br />\ntered remarks of the fans might be building, run by Hopkins men, for Square looking for an honest man,<br />\nand alas, some one stole my lanFor Delaware, Magaw at end taken as general opinion the Hopkins men.<br />\nHampden-Sidney, Va.<br />\nThis has received the indorse- tern.\"-Voo Doo.<br />\nand Jackson in the backfield, were adoption by Hopkins of the open<br />\n19. The Flat Hat, William &amp;<br />\nof the facMary College, Williamsburg,<br />\nthe only two outstanding stars. play would serve to increase the ment of some members<br />\nIn order to have a perfect figure,<br />\nSeal<br />\nVarsity<br />\nBoard,<br />\nAthletic<br />\nulty,<br />\nthe<br />\nVa.<br />\nCapt. Holton seemed helpless at interest of the local fans. To<br />\nmen prominent Mary Garden recommends \"ten<br />\nleft tackle and the entire center of average rooter one successful Voting Council, and<br />\nminutes of deep breathing in front 20. The Richmond Collegian, Unithe line looked weak. In receiving pass in four for a gain of ten yards in activities.<br />\nversity of Richmond, Richsome concerted action of an open window on rising in the<br />\nthe kickoff the visitors used a for- is much more exciting than a simi- Let's get<br />\nmond, Va.<br />\non this plan. Other universities morning, and on retiring at night.\"<br />\nmation learned at Penn, but the lar gain from line bucks.<br />\nThe team from Dickinson will run their stores to help their activ- All I can say is, if it's to be done<br />\nWaiter-Has your order been<br />\nformation, designed to give a solid<br />\nCAN'T HOPKINS? in front of an open window, one<br />\nthree-man interference to the run- be accompanied by a number of ities, WHY<br />\ntaken?<br />\nreally should have a perfect figure<br />\nner, proved more of a stumbling students and townspeople who<br />\nVery truly yours,<br />\nWaitee-Yes, and so has Bunker<br />\nto begin with-in order to give the<br />\nblock than a help. Delaware's only are confident of victory for the<br />\nHill.-Shownte.<br />\nH. PEIRCE BRAWNER. neighbors a treat.-Tatler.<br />\ngains were made from a trick for- Red and White.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br /><br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby \"The News-Letter, which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 14, 1921<br /><br />\nWe are establishing a new standard in<br />\nYoung Men's Suits at $29.50<br /><br />\nill<br /><br />\n3<br /><br />\nEXCHANGES<br /><br />\nStyles for every taste.<br /><br />\nte<br />\nas<br />\na<br />\nFie<br />\nehe<br />\nits<br />\nhbe-<br /><br />\nLirs<br />\nx:h<br />\n;*e<br />\nin<br />\nn!s,<br />\nDr<br />\nill<br />\nill<br /><br />\n)3/<br />\nle<br />\ner<br /><br />\nis<br />\nte<br />\nle<br />\nts<br />\nte<br /><br />\nThe centennial celebration plans<br />\nare ready at McGill's. Lectures<br />\nwill be suspended from Tuesday to<br />\nBaltimore's Best Store<br />\nMonday. All faculties will be represented in big Fete de Nuit. A<br />\ngarden party will be given by the<br />\nMcGill Women's Union, at_which<br />\nwill be given a pageant symbolic<br />\nof McGill past history. The plans<br />\nfor the \"Fete de Nuit\" are extensive.<br />\nThe various faculties are putting<br />\nOF MARYLAND<br />\non separate displays. The law students will appear with the inim1890<br />\n1920<br />\nitable Si Whiffletree display that<br />\namused students of the University<br />\nFIDELITY BONDS &amp; BURGLARY INSURANCE<br />\nfor several years past. Unusual<br />\nContract, Judicial—BONDS—Public Official, Depository preparation has been made for the<br />\nbig events.<br />\nCHARLES ST. at LEXINGTON<br />\nBaltimore, Md.<br />\nUniversity of Colorado has record start; 2,279 now registered.<br />\nTotal enrollment expected to be<br />\nEstablished 1863<br />\n2,700. The enrollment already<br />\nshows an increase of 10.9 per cent.<br />\n•When you want the<br />\nover that of last year. The mediHENRY SEIM &amp; CO.<br />\nreal thing in Sport<br />\ncal school was forced to turn away<br />\nEquipment you think Manufacturers, Importers &amp; Dealers many students, due to lack of adequate facilities. It was necessary<br />\ninstinctively of<br />\nto increase the accommodations at<br />\n\"SPALDING\"<br />\nthe Bursar's office and change the<br />\nPAINTS, OILS and VARNISHES routine of registration.<br />\n41141-.\"'<br /><br />\nHOCHSCHILD-KOHN 8c Co.<br /><br />\nFidelity &amp; Deposit Company<br /><br />\nAutomobile Glass a Specialty<br /><br />\nSPALDING &amp; BROS.<br /><br />\n110 EAST BALTIMORE ST.<br /><br />\nDomestic and Ecclesiastic Leaded<br />\nStained Glass<br />\nHOWARD &amp; FAYETTE STS.<br /><br />\nCandy, Soda and<br />\nPipes and Fountain Pens<br />\nAt the Barn<br />\nE. E. Adams<br /><br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br /><br />\nJAS. H. DOWNS<br /><br />\nre,<br /><br />\ne,<br /><br />\nENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br /><br />\nThe SUPREME in Typewriters<br /><br />\nT $8.00, made<br />\nof grain leather,<br />\nin tan or black,<br />\nwith square toe and<br />\nheavy perforations,<br />\nthis is an oxford<br />\nany college man<br />\ncan be proud of.<br />\nIn high shoe the<br />\nsame style is $8.50.<br /><br />\nThe NEW<br /><br />\nHammond Multiplex<br /><br />\nCharles Street,:210 North<br /><br />\nSHIRTS<br /><br />\n)f<br />\ne,<br /><br />\nNECKWEAR<br /><br />\nLefranc &amp; Ault<br />\n421 N. HOWARD ST.<br /><br />\nHOSIERY<br />\nPORTABLE<br />\nALUMINUM<br />\nThere is special provision for<br />\nENGINEERING, CHEMISTRY,<br />\nMEDICIN E, LANGUAGES.<br />\nLITERATURE, Professors and<br />\nStudents requirements.<br />\nExclusive Features<br />\nInterchangeable type-sets<br />\nTwo complete alphabets on<br />\neach machire.<br />\nAutomatic type impression<br />\nUnlimited width f paper<br />\nIndex cards written flat<br /><br />\nr,<br /><br />\ne,<br /><br />\n1-<br /><br />\nCOMMERCIAL ACCOUNTS—Liberal Terms<br />\nSAVINGS ACCOUNTS-4% payable semi-annually<br />\nDepository for State of Maryland and City of Baltimore<br />\nDEPO SITS<br />\n$428,399.57<br />\nApril 28, 1921<br />\nNovember 22, 1920<br />\n549,051.33<br />\n$112,418.77 May 18, 1921<br />\nDecember 29, 1920<br />\n657,092.61<br />\nFebruary 21, 1921<br />\n248,234.01 June 30, 1921<br />\n$1,013,167.87<br />\nTOTAL ASSETS AUGUST 31, 1921<br /><br />\nMaryland Glass Corporation<br />\nBaltimore<br />\nManufacturers<br />\nManufacturers of Automatic Machine-made<br /><br />\nSPECIAL TERMS to Collegians<br />\nEarn while you learn. Apply for<br />\nodd-time sales work in your college.<br />\nMACHINES RENTED<br />\nSend for FREE literature<br />\nThe<br />\nHAMMOND TYPEWRITER CO.<br />\n545 E. 69th St., New York, N.Y.<br /><br />\nBONDS<br /><br />\nBlue and Light Green Glass Bottles.<br />\nCHINESE VS. GREEK<br /><br />\nPossibly the first time that the<br />\nEnglish language served as a medium between Chinese students and<br />\na Greek letter fraternity occurred<br />\nsome time ago when a band of the<br />\nformer consulted the offices of Burr,<br />\nPatterson &amp; Co., manufacturing fraternity jewelers of Detroit, and<br />\nasked that their club name, \"Chinese Students' Club,\" be duly transBaltimore, Maryland<br />\n310 N. Charles St.<br />\nlated into Greek and the letters C.<br />\nS.- C. used on an. official fraternity.<br />\nbadge.<br />\nIt was expkained to the committee that such a title would have little meaning and that it was customary to use the initials of specific Greek words in forming a Greek<br />\nname. How to translate \"Chinese<br />\nStudents' Club\" in Greek, however,<br />\n13 SOUTH ST.<br />\nwas a problem not easily solved.<br />\nThe word \"student\" and \"club\"<br />\nOrganized 1864<br />\nwere easily changed to the Greek<br />\nequivalents, but not so the \"ChiJohn J. Nelligan, President<br />\nnese.\"<br />\nSearch was made in the public library for the Greek word for \"Chinese\" but without success. In desperation, Gus, the restaurant man<br />\nAnd Medicines and Dressings are required or other Real<br />\ndown the street, was consulted but<br />\nPharmaceutical Service is Needed<br />\nhis modern Greek could not rise to<br />\nthe occasion, and he admitted reTHINK OF<br />\nluctantly that he knew no suitable<br />\nequivalent for \"Chinese\" in his native tongue.<br />\nA final appeal was made to the<br />\nTWO STORES:<br />\nlanguage department of a Detroit Charles and Franklin Sts.<br />\nEutaw Place and North Ave.<br />\nGreek<br />\ndeof<br />\nthe<br />\nhead<br />\nThe<br />\ncollege.<br />\nMadison 405<br />\nMt. Vernon 890<br />\npartment was pressed into service<br />\nand asked to help in finding - the<br />\nSt. Paul 7855-7856<br />\nmissing word for the new Greek letter fraternity. He declared at the<br />\nHomes Sold on Easy Terms<br />\noutset that there apparently was no<br />\nword for \"Chinese\" in classic Greek<br />\nsince the ancient Hellenes apparently had no definite knowledge of<br />\nChina. However, it was found, reference was made in their literature<br />\nROBERT SEFF<br />\nto \"the people of the far East,\"<br />\nReal Estate—Investments<br />\nand for this group, the professor<br />\ncould furnish a Greek name.<br />\nOf course, the word was immediately adopted and shortly after the<br />\nAmerican college world became acSOLD BY ALL GROCERS 231 Courtland Street Baltimore, Md.<br />\nquainted with a new American Chinese Greek letter fraternity.<br /><br />\nThe James R. Armiger CO.<br /><br />\nSafe Deposit &amp; Trust Co.<br />\nof Baltimore<br /><br />\nGLOVES<br /><br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\nDress Shirts<br />\n$3.00, $3.50 and $4.00<br />\nNegligee<br />\n$3.25 and $4.25<br />\nImported Madras<br />\n$5.25 and $6.25<br />\nTerms Cash, Less 10% 30 Days on<br />\nShirts<br />\nAlso a Full Line of Men's<br />\nFurnishings<br /><br />\nSTRATTON<br /><br />\nOn account of the paper shortage, there is hardly a collar worn<br />\nin the state of Nebraska.<br />\nLawyer—Was the deceased in the<br />\nhabit of talking to himself?<br />\nPatrick—I can't tell you, sor ; I<br />\nnever was wid him when he was<br />\nalone.—Tar Baby.<br /><br />\nENVELOPES<br /><br />\nLEDGERS<br /><br />\nHynson, Westcott and Dunning<br /><br />\nHE-NO<br />\nTEA<br /><br />\nEstablished 1873<br />\n11<br /><br />\nEDWIN W. ADAMS,Vice-Pres. &amp; Cashier<br /><br />\nIf an Accident Occurs<br /><br />\nFolding<br />\nrc--Zff<br /><br />\ne,<br /><br />\nN. E. COR. CALVERT AND LEXINGTON STREETS<br />\nJ. SHORB NEALE,President<br /><br />\nJewelers and Silversmiths<br /><br />\nLunches, Cigars<br />\nCigarettes<br /><br />\nia<br />\n5-<br /><br />\nLafayette Bank<br /><br />\nof Every Description<br /><br />\nBaltimore, Md.<br /><br />\n73T<br /><br />\nEnglish Clothes Tailored in America<br />\nFOR SPORT, DRESS, SOCIETY<br />\nHABERDASHERY<br /><br />\nGLASS<br /><br />\nA.<br /><br />\n&gt;y<br /><br />\nClotites of Cusion,Qualit<br />\n14 N._CharlesSfreet<br /><br />\nW. H. Moore, Jr., Paper Co.<br />\n205 W.CAMDEN STREET<br /><br />\nLIBERTY<br /><br />\nJames—Did you ever pull the old A.H.Fetting Man'fg Jewelry Co.<br />\nExpert Cleaners and Dyers<br />\nManufacturers<br />\nman's leg?<br />\nSpecial Rates to Hopkins Men<br />\nGreek Letter Fraternity Jewelry<br />\nTim—Yes, off and on; it's a<br />\n211<br />\nE. 25th St.<br />\nHomewood 5205-W<br />\nST.,<br />\nLIBERTY<br />\n213<br />\nN.<br />\nBaltimore,<br />\nMd.<br />\none.—Octopus.<br />\nwooden<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 14, 1921<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\nImporters and Dealers in Fine Books<br />\n301 N. CHARLES ST.<br />\nBaltimore, Md.<br /><br />\nadf<br />\nv<br />\ne<br />\nAbeXatteri<br />\n4T<br />\n`1- -M ES H.6, OSCAR<br />\noWN E<br />\n*4?11/10e6la\" .e14 WI°<br />\n29 Baltimore St., East<br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\nThe Chas. Willms Surgical<br />\nInstrument Co.<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br /><br />\nJ. H. Furst &amp; Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br /><br />\nATTENTION ALUMNI<br />\n_<br />\nTHE NEWS-LETTER NEEDS YOUR SUPPORT<br />\nThe News-Letter, as you know, is edited and published by<br />\nthe students it gives the University news, and it gives all of it.<br />\nDuring the last few years in which the University has been<br />\nsteadily growing it has been very loyally supported by the student body. We have reached the time now, where the Board<br />\nfeels it is desirable to issue the NEWS-LETTER each Tuesday<br />\nand Friday during the collegiate year. And so, for the first time, it<br />\nis being done this year, at a cost of about $4,800.<br />\nAppearing twice a week will enable the editors to giye advance notice of all games, meetings, lectures and other interesting gatherings, as well as an immediate and complete account<br />\ninfor the benefit of those unable to attend. We know you are<br />\nin<br />\nterested in Hopkins' activities, in the progress of the dorms,<br />\nClub,<br />\nthe football team, lacrosse team, debating team, Dramatic<br />\nship<br />\nchampion<br />\nour<br />\nof<br />\none<br />\nof<br />\nmember<br />\na<br />\nwere<br />\netc. Perhaps you<br />\nyour<br />\nof<br />\nmemories<br />\nfond<br />\ncherish<br />\nyou<br />\nrate,<br />\nlacrosse teams—at any<br />\ntoday<br />\nof<br />\nactivities<br />\nthe<br />\nin<br />\ninterest<br />\nan<br />\nhave<br />\ncollege days, and you<br />\nat Homewood; for that reason we have taken the liberty of<br />\nplacing you on our subscription list, and your name will continue<br />\nthere unless you send in the coupon below.<br />\nSubscription price is $2.50 per year, payable on or before<br />\nJanuary 1, 1922. Won't you back us up and help make the new<br />\nsemi-weekly a tremendous success?<br />\nG. P. Fallon,<br />\nCirculation Manager,<br />\nHomewood.<br />\nPlease remove my name from the subscription list of the<br />\nNews-Letter.<br /><br />\nBuck Glass Company<br />\nManufacturers of<br /><br />\nGLASS 1OTTLES<br />\nMaryland<br /><br />\nBaltimore<br />\nIole Assorted Chocolates<br />\nAND<br /><br />\nLady Helen Chocolate Cherries in Cordial<br /><br />\nAre standards in their respective class of delicious confections<br />\nat popular prices.<br /><br />\nName<br />\nAddress<br />\nAsk Your Dealer for Them<br /><br />\nSCHOLARSHIPS FOR THIS YEAR<br /><br />\nChocolate Products Company<br /><br />\nlas Fooks.<br />\nCarroll: H. L. Holsopple (SenaMr. T. R. Ball, the registrar, has<br />\nBaltimore, Md.<br />\nC. R. Stouch, T. R. Gaither,<br />\nannounced the names of those who torial),<br />\nBrown (one year only).<br />\nwill receive scholarships for this C. R.<br />\nCecil: W. W. Aldrich (Senayear. The following members of<br />\ntorial), E. W. Jackson, W. T. Althe Class of 1925 won out in the reCall Calvert 1718<br />\nNorman James, President<br />\nderson.<br />\nFOR KEEN CUTTER HARDWARE<br />\ncent competitive examination:<br />\nGeo. H. Hunting, Vice-President<br />\nWills (Senator- Walter B. Wessels, Secretary-Treas.<br />\nW.<br />\nJ.<br />\nCharles:<br />\nLUCAS<br />\n17 E. Baltimore St.<br />\nAlbert S. Asendorf.<br />\nF. A. Ascherfeld, General Manager<br />\nMarine, Industrial, House<br />\n.<br />\nial)<br />\nGeorge A. Conner.<br />\nPAINTS<br />\nDorchester: H. M. Seitz (SenaHopkins scholarships have also<br />\nPrinters of the<br />\ntorial), Henry Leonard.<br />\nbeen awarded to<br />\nBUILDING LUMBER<br />\nJohns Hopkins News-Letter<br />\nFrederick: 0. M. Shipley (SenAlbert G. Langluttig, 1922.<br />\nand Yardsatorial), T. C. Routson, C. R. Ken- Office ALICEANNA ST., cor. Exeter<br />\nHarry Eagle, 1924.<br />\n921<br />\nnedy (one year only), M. L. R.<br />\n609 W. LEXINGTON ST.<br />\nBaltimore, Md.<br />\nTheir names were inadvertently<br />\nManahan.<br />\nT.<br />\nW.<br />\ner,<br />\nRanneberg<br />\nomitted when the undergraduate<br />\nGarrett: A. C. Michael (Sena- Chas. L. Cunningham &amp; Co.<br />\nhonors were announced at comtorial).<br />\nStewart Taxi Service Co.<br />\n(Licensees)<br />\nmencement.<br />\nHanford: W. H. Somerville<br />\nN<br />\nLANE<br />\nGARRISO<br />\nCollege<br />\n20-30<br />\nCity<br />\nThe Baltimore<br />\nNear Baltimore St.<br />\n(Senatorial), C. C. Davis, A. L.<br />\nCall Mt. Vernon 1 1<br />\nAlumni Scholarship has been<br />\nTipton.<br />\nSTRIPS<br />\nR<br />\nWEATHE<br />\nMETAL<br />\n'25.<br />\nawarded to J. Wilson Hunter,<br />\nfor<br />\nTaxi Cabs and Touring Cars<br />\nHoward: Noble Watkins (SenThe Z. Morton Katz Memorial<br />\nWINDOWS and DOORS<br />\natorial).<br />\nScholarship has been awarded to<br />\nPhones—C. &amp; P., Long Distance<br />\nMontgomery: W. W. Stabler<br />\nWilliam T. Hart, '25.<br />\n(Senatorial), J. M. Mount, T. A.<br />\nThe A. Z. Hartman Memorial<br />\nWilson, Lloyd W. Hyatt (one year<br />\nScholarship went to Lawrence B.<br />\nUse MORGAN'S CARBOLATED<br />\nCollege Literature<br />\nonly).<br />\nAn Unusual Beauty Shop<br />\nFenneman, '23.<br />\nBABY POWDER for Chafing<br />\nPrince George's: H. E. Smith<br />\nLOMBARD and SOUTH STREETS<br />\nOur Exclusive Tailored Sport<br />\nThe Scholarship for 1921-22, in<br />\nl), Ralph McLane, R.<br />\n(Senatoria<br />\nand Itching for Adults and<br />\nBlouses a Specialty<br />\nthe Johns Hopkins University,<br />\nSHOES<br />\nFontz, Jerome Pollock.<br />\nnt<br />\nfolMeasureme<br />\nas<br />\nor<br />\nng,<br />\nYour<br />\nMade to<br />\nSchool of Engineeri<br />\nChildren.<br />\nfor<br />\nQueen Anne's: G. J. Hill,<br />\nlows:<br />\nN. CHARLES ST.<br />\n517<br />\n(Senatorial), W. E. Hopkins.<br />\nBaltimore, Maryland<br />\nUNIVERSITY MEN<br />\nBALTIMORE CITY<br />\nSomerset: Laban Saltz (SenaCarFirst Legislative District:<br />\nFor Sport Wear<br />\nFor Dress<br />\ntorial), H. E. Cannon.<br />\nHensen (Senatorial), Samuel<br />\nLeathers<br />\nvel<br />\nest<br />\nStyles—B<br />\nSmart<br />\nSt. Mary's: F. J. Rich (SenaDoes the C. P. A. degree, a caBernstein, L. J. Gould, Samuel<br />\nModerate Prices<br />\ntorial).<br />\nreer<br />\nas a public accountant or tax<br />\nSteinberg, Allan See, C. W. SieTalbot: L. B. Kinnamon (Senspecialist, an executive position<br />\ngrist.<br />\natorial), J. N. Murphy, 0. S. Mulas Controller, Treasurer, Auditor<br />\nSecond Legislative District: J.<br />\nor Office Manager appeal to you?<br />\nMENTS<br />\nlikin.<br />\nCOMPLI<br />\nF. Sollers (Senatorial), B. Kurrel19 W. LEXINGTON ST.<br />\nPace courses, standardized and<br />\n(SenWolf<br />\non:<br />\nE. F.<br />\nWashingt<br />\naccredited, available in evening<br />\nmeyer, A. Freeman, J. B. Powell,<br />\natorial), A. A. S. S. Simon.<br />\nclasses, have for years afforded<br />\n'E. J. Schafer, R. W. Lutz.<br />\nWicomico: W. H. Rawson (SenMUSICAL CLUBS HOLD ORpreparation for professional AcA.<br />\nJ.<br />\nDistrict:<br />\ne<br />\nLegislativ<br />\nThird<br />\nGANIZATION MEETING<br />\natorial).<br />\ny practice and for execcountanc<br />\ne<br />\nDemocratic Candidat<br />\nNaviasky (Senatorial), D. K. Vanutive<br />\nin business.<br />\npositions<br />\n(Sen:<br />\nJ.<br />\nWigton<br />\nR.<br />\nWorcester<br />\n4<br />\ncol.<br />\nContiuued from page 1,<br />\nneman, L. F. Mathews, Jos. Kapof Wills<br />\nW. P. Taylor, W. H.<br />\nRegister<br />\natorial),<br />\nManager, Hugh M. Smallwood. lan, J. T. Dixon, F. L. Moehle.<br />\nHouston, Jr.<br />\nFirst Tenors—Gould, Harwood. Fourth Legislative District: A.<br />\nCOLLEGES<br />\nSecond Tenors—Hopkins, Kap- H. Senner (Senatorial), R. C. DanSt. John's: W. B. Tucker.<br />\nFALL CLASSES NOW FORMING<br />\nlan, Torsch, Houston, Hall, Belt, nettel, J. F. Strot, Michael Cohn,<br />\nCall or Write for Bulletin<br />\nSCHOLARSHIPS \"AT LARGE\"<br />\nSt. Paul 1469<br />\nCharles Morrison.<br />\nRussell, Rich, Norwood.<br />\nFrank Wilen, M. R. Gilpin, Jr..<br />\n201-208<br />\nEQUITABLE BLDG.<br />\nCOUNTIES<br />\nFirst Basses—P. Parsons, J. W.<br />\nD. C. Turnbull, Jr., H. W. Grace,<br />\nParsons, Barrett, Kinneman, Mor- Allegany: W. J. Oglebay (Sena- R. C. Tilghman, H. H. Botchelor<br />\nrell, Kirkley, Council.<br />\ntorial), J. F. Porter, J. T. Martin. (one year only).<br />\nger,<br />\nichelber<br />\nBasses—E<br />\nSecond<br />\nAnne Arundel: F. B. Crider<br />\nGross,<br />\nElgert,<br />\n,<br />\nSherwood<br />\nCroker,<br />\n(Senatorial), S. H. Pratt, W. H. INTERFRATERNITY BOARD RULING<br />\n4-6 WEST FAYETTE ST., BALTIMORE<br />\nContinued from page 1, col. 2<br />\nLeonard.<br />\nKing, Crider,<br />\nCooper.<br />\n31. The ruling<br />\nBaltimore: Donald Reese (Sen- Monday, October<br />\ndesigned to<br />\nis<br />\nTuesday<br />\npassed<br />\nP. I. HeyART GOODS<br />\n\"You know, I told Maybelle last atorial), G. M. Ruoff,<br />\nand makes<br />\nrule<br />\nthis<br />\nnt<br />\nsuppleme<br />\nWorthing<br />\nL.<br />\nE.<br />\nDavis,<br />\nF.<br />\nH.<br />\nman,<br />\nher.\"<br />\nnight that I loved<br />\nit virtually hopeless for a freshton, E. H. Salter.<br />\nCutlery, Kitchen Utensils<br />\n\"You don't mean it!\"<br />\nChina and Table Glassware<br />\nSlaughter (Sen- man to expect any overtures from<br />\n\"No, I don't; but she thinks so.\" Caroline: J. D.<br />\nmen until October 31.<br />\n—Scalper. atorial), Kennard Finder, L. Doug- fraternity<br /><br />\nThe James Lumber Co.<br /><br />\nLexington Paint ear<br />\nHardware Co.<br /><br />\nKALLOTHENEION<br /><br />\nAccountancy<br /><br />\nWYMAN<br /><br />\nHoward W.Jackson<br /><br />\nBaltimore<br />\nPace Institute<br /><br />\nJ. Seth Hopkins-Mansfield Co.<br /><br />"}], "field_media_file": [{"target_id": 37537, "display": null, "description": null, "target_type": "file", "target_uuid": "e24b8799-1c1c-4018-bd03-04115d5a718b", "url": "http://digital.library.jhu.edu/system/files/2022-03/12958-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12958, "target_type": "node", "target_uuid": "36845a2c-8209-47e6-86ee-270dbb5ee78a", "url": "/node/12958"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "3e9a2b9e-1e57-4771-8671-375e9b9386f0"}]}