{"mid": [{"value": 38261}], "uuid": [{"value": "fae9b91f-635c-4baa-a317-4638722b7c2c"}], "vid": [{"value": 38261}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:51:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12828-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:51:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:51:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": ",<br />\n<br />\nLOYOLA TONIGHT<br />\nAT HOMEWOOD<br />\n<br />\n&IItth.1011pk1tts<br />\n<br />\nNrius-siirttet<br />\n<br />\nZ 275<br />\nVOL. XLII, No. 21<br />\n<br />\nREAD<br />\nFINKEL'S FAREWELL<br />\nEDITORIAL<br />\n<br />\nHOMEWOOD, BALTIMORE, TUESDAY, FEBRUARY 15, 1938<br />\nPRICE 5 CEN'T.<br />\n<br />\nCOMMISSION REFORMS HONOR SYSTEM<br />\nQUINTET SMARTS 'The Threat To Democracy' PHI ALPHAS SEVER<br />\nAWAITS LOYOLA MCDonald's Subject Tonight'TIE TO NATIONAL.<br />\nINVASION TONIGHT<br />\nLOCAL NAMED ETA<br />\n*Supper Club To<br />\nHear Refugee Commissioner On<br />\nFar East Situation<br />\n<br />\nHopkins Out To Prove Close<br />\nFirst Victory On<br />\nHome Floor<br />\n<br />\nNewly Formed Constitutio<br />\n<br />\nHonorCon*ssion<br />\nDefines Fu ctions<br />\nAt the Hopkins,<br />\nrally known<br />\nfor its lack of<br />\nthings, there<br />\nis one splendid tr<br />\nn: the Honor System. It is<br />\nthe type of<br />\nthing to evoke any of the usual<br />\n'college spirit\"<br />\niated with<br />\nfootball teams. Rat r, it appeals<br />\nto that sense of ho sty and decency inherent in<br />\nry man. It<br />\nis true that some i<br />\nviduals, because of environme<br />\nand experience, have constantly repressed<br />\ntheir innate sense de virtue until<br />\nthey have arrived at the point of<br />\nbelieving that \"The Only sin is in<br />\nbeing caught.\" It is With correcting this kind of immiture philoso—<br />\nphy that the Student Honor Commission is concerned)<br />\nThe implications of such a pun<br />\npose are obvious. The Commission is not concerned with being<br />\npolice or spies. W do not hold<br />\n•<br />\n(Continued on age 2)<br />\n<br />\nWARNINGS SENT<br />\nBY SLIP METHOD<br />\nUNDER NEW PLAN<br />\n<br />\nn<br />\nChange Is First Step In Rem...Tames G. McDonald, authority on<br />\nCalls The Fraternity<br />\nforeign affairs and internationally<br />\nedying Faults Of<br />\nknown for his work as League of NaEpsilon Tau Alpha<br />\nSystem<br />\nticins High Commissioner for German<br />\nRefugees, will speak tonight at the<br />\nKELLEY KEYSTONE<br />\nDISCARD<br />\nS<br />\nPeN<br />\n,<br />\nI4S<br />\nAS-University- .2::\"Aser<br />\nVIOLATION WARNING<br />\n-topic<br />\nIN LOYOLA ATTACK<br />\nwill be \"The Threat to Democracy\".<br />\nNOW OUT-MODED<br />\nTO BE ANONYMOUS<br />\nAfter a private dinner of the memVictory Chances For Mallobers of the Supper Club, the lecture<br />\nAlumni Support Secession;<br />\nSlips Available To All Stuwill be given at the University Bapnee Men Lie In<br />\nForm ETA Associations<br />\ntist Church at 8:15 p. m. Admission<br />\ndents At The<br />\nTeam Play<br />\nis thirty five cents.<br />\nIn Principal Cities<br />\nPostoffice<br />\nMr. McDonald's address, it is beStill winching at the thought of<br />\nlieved, will stress the dangers of the<br />\nAt a special meeting of the Phi<br />\nThe Student Honor Commission of<br />\ntheir last-minute, single-point defeat<br />\nrising tide of totalitarianism, and Alpha Fraternity,<br />\nheld last Wednesthe College of Arts and Science and<br />\nat the hands of St. Johns, the Blue<br />\nmethods of combating it. According<br />\nday at the Hopkins Chapter house,<br />\nthe Business School made public toto William Hammaker, Y. M. C. A.<br />\nJay ba.sketeers will be out for blood<br />\na resolution was introduced and unsecretary, Mr. McDonald Is well<br />\nday the plan which it has evolved<br />\ntonight when they meet Loyola Colanimously<br />\npassed<br />\nwhereby<br />\nqualified<br />\nthe<br />\nby<br />\nhis<br />\nextensive<br />\nlocal<br />\nwork in the<br />\nas its first step in the remedying of<br />\nlege's Greyhounds. This, the second<br />\nfield of international relations. At chapter should resign from the Nathe difficulties which at present atfray. with Loyola, will pit the two<br />\npresent, he is a member of the editor- tional Phi Alpha Fraternity.<br />\nJames G. McDonald<br />\nA new<br />\ntach to a smooth functioning of the<br />\nfives against each other at Homeial staff of the \"New York Times\".<br />\nconstitution was immediately set up,<br />\nHonor System at the Hopkins.<br />\nwood where the Jays will have the<br />\nHeld League Post<br />\nand the name chosen for the new orslight advantage of being at home.<br />\nScheduled to go into effect this<br />\nAs ccatorganizer of the Foreign<br />\nganization was Epsilon Tau Alpha.<br />\nPolicy Association in 1919 and chairweek, the plan enables any student<br />\nFrom all appearances at present<br />\nA quotation from the statement by<br />\nman of that organization for 14<br />\nthis advantage will be needed. After<br />\non the campus to warn any other<br />\nyears, he strove to widen popular in- the members of the newly organized<br />\na bruising battle about a month ago,<br />\nstudent whom he sees committing a<br />\nterest in foreign affairs. Mr. Mac- fraternity to the Editor of the<br />\nAspirants<br />\nTo<br />\nt<br />\nVacated<br />\nNEwSthe Hopkins quintet returned from Destination<br />\nviolation, while remaining anonyIndefinite For Donald is best known for his work as LerrEa contains the item of resignaBy Hutch<br />\nFile<br />\nEvergreen on the long end of a 31-30<br />\nmous. It is hoped that the fact that<br />\nHopkins Grad; Professor High Commissioner for German Re- tion: \"We, former members of the<br />\nTomo<br />\nscore. The one point margin was<br />\nfugees. He directed the work of this<br />\nthe warner may remain in anonymity<br />\nEmeritus In Archaelogy<br />\nagency of the League of Nations Eta Chapter of the Phi Alpha Fragained in the final play of the game<br />\nwill encourage all students who have<br />\nPrimaries<br />\nfor<br />\nelec<br />\nof<br />\nthe<br />\nfrom<br />\nsophoOctober<br />\n1933 until the close of ternity, do herby, under our own will<br />\nWilliam Gates,'authority on Mayan<br />\nwhen Carl Basin's eagle-eye was<br />\nheretofore hesitated to warn people<br />\nmore representative<br />\nthe Student<br />\n1935. During this time about three- and volition,<br />\nseverally and jointly, Council to<br />\nsharp enough to drop one through the literature and research associate<br />\nfill the v<br />\ncaused by because of having their names<br />\nemeritus in Mayan archeology and fourths of the 80,000 refugees from sever<br />\nall our relationships with the the resignation of<br />\nhoop. Tonight's fray should be a repeHutchcraft known, to now consider this last obliterature at the Hopkins, will leave Germany were placed in new homes,<br />\nPhi Alpha Fraternity; and from this will be held next<br />\ntition of the last meeting of the two<br />\nay. Final stacle to their complete abidance by<br />\nthe faculty in the Spring. He will and a fund of ten million dollars for<br />\nFriday after the Honor<br />\nsquads. With possible grudges the re- take his Mayan library, the most the relief and rehabilitation of these date shall be known as the Epsilon elections will follow'<br />\nSystem removed.<br />\nthe<br />\ndetermination 0<br />\ne results of<br />\nTau Fraternity.\"<br />\nsults of the rough-and-tumble play valuable in the world, with him when refugees was raised.<br />\nMehling Explains Plan<br />\nthe primary.<br />\nMr. McDonald holds the positioraNational Ji:nsternities Obsolete<br />\nIn the first game, the breaks will be leaves. Dr. Gates stated as a reaThe—election forlhdfreplacement of . The new plan, as explained by J.<br />\nReasons for this sudden action cenhold the victory ,cards and the win- son for leaving that he did not have of vice-president of the National<br />\nenough room for his collection at the Council for the Prevention of War, tered mainly about the belief that Hutchcraft, who resigned last Thurs- Judge Mehling, '38, is:<br />\nner will once again be forced to bow<br />\nday because of a heavy schedule,<br />\nThe Commission has drawn up a<br />\nHopkins.<br />\nmember of the Commission on In- national fraternity<br />\nsystems have be- brings<br />\ndown before Lady Luck.<br />\nmany prominent Student form of note, which has blank<br />\nDr. Gates has no definite plans for ternational Justice and Good Will,<br />\nspace<br />\ncome out-moded and purposeless. Council Issues<br />\nto the fore. The for<br />\nputting the library in any institution, honorary chairman of the Foreign<br />\nFirst Victory Close<br />\nthe filling In of the name of the<br />\n\"The<br />\nbonding<br />\nYoung<br />\ntogether<br />\nCommunist<br />\nof<br />\nincongruLeague<br />\nassembly<br />\nAgain hoping to put their greater but he will keep it somewhere in the Policy Association, and trustee of<br />\nous groups of men into a false fra- issue probably holds the spotlight, person seen or suspected of committhe Twentieth Century Fund.<br />\nheight to advantage, the Jays Will nottheastern United States.<br />\nternalism by a national organization closely seconded by the consideration ting- the violation, and the class in<br />\nBowman<br />\nTo<br />\nIntroduce<br />\nHopkins Grad<br />\nuse the same attack that netted them<br />\nis both hypocritical and meaningless; of the whole. assembly question. On which it took place. The particular<br />\nAfter graduating from the HopHe will be introduced at the lecture<br />\ntheir first past victory. Set shots<br />\nthe actions of numerous Eastern Uni- this election hinges the ultimate de- person is warned<br />\nthat he has been<br />\nkins in 1886, Dr. Gates studied law by President Isaiah Bowman. At the<br />\nversities have proved the national cisions.<br />\nwith quick-follow-ups by the six foot at the University<br />\nobserved cheating, and he is cautionof Maryland, and Y. M. C. A. Supper Club's dinner<br />\nFollowing are the election requireplus men of the Jay five are hoped to then entered into business in Cleve- which precedes the lecture, he will fraternity system to be both . obed not to repeat the offense.<br />\nsolete and antiquated.\"<br />\nments. Ten signatures must appear<br />\nmount the digits in the Jay scoring land. He began the collection of May- give a short talk on the far-eastern<br />\nThese slips, left with Mr. Myers in<br />\nThe new constitution called for a on the petition for nomination before<br />\ncolumn. Past experience has shown an literature twenty-five years ago; crisis. At the supper he will be in, candidate will be accepted. The the post-office and available there to<br />\nit is now valued, at about $150,000. troduced by Dr. Elizabeth, Stewart, purge upon all the mystic and secret any'<br />\nthat the attack of the Hopkins five<br />\nThe Mayan Society, of which Dr. Hopkins' fellow and world's first traditions that have been contained signers must all be certified members all, need 'not' be signed by their re.<br />\ncannot function well unless the Jays' Gates is<br />\npresident, is probably the Doctor of Philosophy in the Mayan in the rituals of various national of the sophomore class. All nomina- spective senders.<br />\nfraternities. The members of Epsilon tions mint be placed in Box 1248 by<br />\nscoring eyes are in good shape. How- the only literary society in the United languages.<br />\nThe slip, filled out,, is then returnTau Alpha stated that they wished Wednesday afternoon at four, adever, the height of the Blue men States that has its own press. DurStudent chairman for the evening<br />\ned to Mr. Myers, who distributes<br />\n\"to<br />\nstreamline<br />\ntheir<br />\ngroup\",<br />\ndressed<br />\nand<br />\nto<br />\nto<br />\nWilliam<br />\nB.<br />\nKempton, Preshelps• to offset any such deficiency ing the past seven years twenty at the lecture will be. Charles D.<br />\nform a group of men \"who, living to- ident of the Student Council, in order them to their respective destinations.<br />\nand is a great .factor in the whole books have been published on the Flagle. At the supper Henry Blucher<br />\ngether for four years, will enrich to be valid. At least four candidates The Commission keeps track of all<br />\npress; the first volume published was will preside.<br />\nteam's play. The mainstay of the<br />\nthemselves academically, socially, are 'expected.<br />\nslips, merely to stop any practical<br />\na Mayan dictionary written by Dr.<br />\nHopkins attack, which was seen to<br />\nand cultUrally\".<br />\nThe ballot box in the post office will jokers, and to note whom the regular,<br />\nGates.<br />\nThe fraternity has received full be open all day Thursday for pri- repeating-offenders are.<br />\nbe both present and absent in the<br />\nBesides the number of Mayan<br />\nsupport from the Hopkins Alumni of mary votes, and again all day Friday<br />\nSlips Remove Former Difficultiee<br />\nSt. Johns encounter, is teamwork. If volumes and imprints which the<br />\ntheir fraternity. Plans have been set for the final. At least 50 percent of<br />\nAccording to Mehling, \"The slips<br />\nthe Blue Jays can once regain the library contains. Dr. Gates has colin motion for the formation of the class must vote before the elec- will remove one of the foremost hindteamwork they had against Loyola lected photographs or photostatic<br />\nAlumni Clubs in various cities of the tion can be confirmed, although well rances to the proper functioning of<br />\nDr.<br />\nGeorge<br />\nBoas,<br />\nChairman<br />\nof<br />\nthe<br />\npreviously, victory will be much clos- copies of almost all of the existing<br />\nPhilosophy Department at the Hop- United States. These clubs will have over that number are predicted. The the Honor System. Under the Syser, for in the first meeting, it was Mayan literature.<br />\ntheir center of action focused upon newlynsibatethofficer will be riss5)o tem, 411111C-1<br />\n•<br />\nkins will be the leadei• at the first<br />\nHop4ins teamplay against Loyola inthe Epsilon Tau Alpha Fraternity by the Student Council on the follow- the Honor System should report him.<br />\nDiscussionGroup, sponsored by the at Hopkins. Last Saturday the first<br />\ndividuality that decided the verdict.<br />\nUp till now, men have felt qualms<br />\ning Friday. '<br />\nY. M. C. A. to be held tomorrow Freshman class was initiated into<br />\nKelley.Loyola Threat<br />\nKeep up with the primary and elec- about reporting offenders, for fear of<br />\nafternoon at 4 in the Sherwood Room the new fraternity.<br />\nFor Hopkins it will be Norm Meleither facing the man they have retion results in the NEWS-LETTER.<br />\nCould you find a straw in a hay<br />\n__<br />\n=<br />\nvin and Dimmy Traggis in there at<br />\nported, or because they have not<br />\nof Levening Pall. The subject to be<br />\nthe forward positions, cutting in un- stack of needles? We can, we will discussed<br />\nwished to have the offender severely<br />\nwill be \"The Case for The<br />\nder the basket. Moore will squai. even attempt to sell red uniforms to<br />\npunished.<br />\nNow IIQWAyer, any man<br />\nconomic Results of Armament<br />\noff once more at the pivot Post. Cap- Mrs. Mb& Mai Hollbwity and her<br />\nmay warn another man that he has'<br />\nThis meeting will be the first in a<br />\ntain Carl- Basin and Joe -MacLain sister Daughters of the American<br />\nviolated the system, having neither<br />\nwill carry the ball down the field in Revolution if you put it in the new series of weekly meetings, in which<br />\nof these fears.<br />\nclassified ad section of the NEWSthe guard slots.<br />\n\"The plan has been approved by<br />\nthe students are to be given oppor4<br />\nLoyola's fast-passing, fast-cutting LETTER.<br />\ntunity to meet with various teachers Armaments Compared To Public Works As Business Stiff]. the Student Council, and both the<br />\nWhat<br />\nchance<br />\nhave<br />\nwould<br />\nit<br />\nthe<br />\non<br />\nattack will again feature Kelley,<br />\nI Council and Commission now believe<br />\nand discas different points concernulant; Economist Says \"Bridges Before Battlewhose individual play can be well re- bulletin board?<br />\nthat all men on the campus will feel<br />\nWe will make your business our ing the University and other more<br />\nmembered, at the center post. Bareships\" For Recovery<br />\n. themselves personally responsible for<br />\npersonal<br />\nconcern.<br />\nTrack<br />\ndown<br />\nthe<br />\ngeneral topics. The meetings are<br />\nzak and Stakem will await the tapthe healthy maintenance of the<br />\n\"I am not qualified to pass an opin- way of stimulating recovery, all I; Honor System.\"<br />\noff at the forward positions while thel things you've lost, find that hidden open to any student of the University.<br />\nbuyer, or turn up the man who has<br />\nIon as to the desirability of armament can say is that it is no more effective!<br />\nguards will be Captain Wayson and<br />\nWork Of The Commission<br />\nsomething to sell through the classiexpansion from the point of view of than other forms of public works! Mehling went on to disclose that<br />\nBremer.<br />\nfied column. This new feature will<br />\nnational defense, inasmuch as that and further that the latter may be the Commission has dealt with severappear for the first time next issue<br />\nIs a military question. The effects more desirable, as they may add al<br />\nsince the last examination<br />\nin the space demonstrated on the last<br />\nwhether good or bad will doubtless something to the real wealth of the I period. He said, \"In every case we<br />\npage.<br />\nBeer—a keg of beer to the winner, have to be subordinate requirements nation—bridges before battleships.<br />\nhave had a frank, man-to-man disAs a special consideration, articles the Cotillion Board announced today. of adequate national defense.\"<br />\nThe third point of the economist's cussion with the student. Never have<br />\nThe first fresman class meeting<br />\nThis is the first point Dr. William argument .was that public expend- we -acted as a 'police force', but have<br />\nr,f the year will be called to order found will be advertised free in an A Candidate for Cotillion Board will<br />\nowners.<br />\neffort<br />\nOther<br />\nto<br />\ntheir<br />\nlocate<br />\nWeyfoith,<br />\n0.<br />\nassociate<br />\nprofessor<br />\ntines<br />\nof<br />\nfor either arrnanents or pub-'found that every student who has<br />\nby President John Milligan at<br />\nrates will be a penny a word with be chosen for each dorm entry to political economy tried to make lic works \"do have a certain stimula- had a discussion with us, has left<br />\n11:30 Thursday morning<br />\nLeversell,<br />\nCotillion<br />\ntickets<br />\nto<br />\n.hear<br />\nGlen<br />\nclear to a reporter seeking an econo- tive effect on business--a shot in thanking us. We are satifled that we<br />\ning hall, it was announced today. fifteen cent minimum. Ads with the<br />\nAttendance is urged for the con- exact wording will be received with Gray. Next .Februruy 28 at noon, the mic interpretation of the latest New. the arm. There is no reason to be- are succeeding in our purpose, rethrough<br />\nenclosed<br />\nthe<br />\nthe<br />\ncharge<br />\nDeal<br />\ndevice to 'prime the pump', the lieve: however, that they can provide awakening interest in the Honor<br />\ndorm having bought the most will be<br />\nsideration of pressing business<br />\nNews-LETTER Box 1230 or the NEWSSystem.\"<br />\nFirst on the docket is discussion<br />\nthe beneficiary (we hope) of enough $800,000,000 armanent proposal, a cure for the depression.<br />\n\"After seven years of the most exThe Student Council has appointed<br />\nof plans for the annual Freshman- LETTER office. They must be received beer to tide them well over the Cotil- which President Roosevelt recently<br />\nfour<br />\ndays<br />\nbe<br />\nto<br />\nthey<br />\nare<br />\ndisbefore<br />\nplaced before Congress.<br />\ntravagent public spending, the pres- ,Robert Fleagle and Carrington WitSophomore prom to be held this<br />\nlion festivities....<br />\nplayed.<br />\n\"As<br />\nassertion<br />\nthe<br />\noften<br />\nto<br />\nmade<br />\nrecession<br />\nent<br />\nis<br />\nindicative<br />\nis<br />\nof the in- hams' to fill the two vacancies in the<br />\nspring.<br />\n12,4SEE PAGE FOUR<br />\nJ. judge Mehling that armanent expansion is a good adequacy of that method as a cure\".!sophomore representation.<br />\n<br />\nPICK COUNOILMAN<br />\nFOR SOPHS PURSDAY<br />\n<br />\nGATES TO RESIGN<br />\nMOVE MAYA LIBRARY<br />\n<br />\nDISCUSSION CROUP OPENS<br />\nTOMORROW WITH OR, BOAS<br />\n<br />\nClassified Service<br />\nBecomes New Feature<br />\n<br />\nE<br />\nExamined in Weyforth s Interview,<br />\n<br />\nKeg Of Beer Prize<br />\nOffered By Mehling<br />\n<br />\nFreshmen Meeting<br />\n<br />\n,<br />\n<br />\n\fHOMEWOOD, BALTIMORE, TUESDAY, FEBRUARY 15, 1938<br />\n_s<br />\n<br />\nXbe jobncs jOopkin5<br />\n<br />\npresent opinions and conclusions from \"lively, eager,<br />\ninquiring\" minds, based upon all the facts and phases<br />\nobtainable of the situation or problem. We will not<br />\nbe dictated to or dominated by any small group or<br />\nindividual interest . . . Our decisions will be aimed at<br />\nintelligently and logically. When we take a stand it<br />\nshall be firm and determined; but we will not fear to<br />\nthe discovery of new facts<br />\nalter or modify our views<br />\n'or viewpoints forces such a change.\"<br />\n<br />\n(\"The strike . is a malifestation<br />\nof the broadest sentiment against<br />\nwar\") and later THURSDAY'S STUDENT STRIKE, A LITTLE HISTORY, THE STRIKE AND THE<br />\nFUTURE, THE STRIKE: AN APPRAISAL, (\"We think having a<br />\nnegro clergyman, Goucher student,<br />\nR.O.T.C., faculty, and student representatives on the program presented<br />\nan opportunity for us students<br />\nwhich can unite divergent views<br />\naround this, common danger\"), and<br />\nON THE DARK SIDE.<br />\nOR the new athletic plan, continued opinion and support were<br />\ngiven:<br />\n<br />\nLETTERS TO THE EDITOR<br />\n<br />\nthe position of legal acivispr is<br />\nTo The Editor of the Neves-LETTER: that<br />\nan earned one. Of course Miilton's<br />\nDear Sir:<br />\nappointment to this position was<br />\nDashing out of Shakespeare with<br />\ngreatly dependent on the fact that<br />\na flash to make Milton with a smash,<br />\nthe choice of the New Jersey<br />\nand4011 over a he was<br />\ntoe<br />\nmy<br />\nstubbed<br />\nI<br />\nFounded 1897<br />\nDemocrats, the party he thought best<br />\nI<br />\nBefore<br />\nreporter.<br />\nPLACE OF THE HOPKINS EDITOR<br />\nNEWS-LETTER<br />\n. 11E00<br />\nSubscription per yearto campaign for in political battles.<br />\nSO<br />\ncould say \"I beg YOUR pardon,\" 14<br />\nBy Mail<br />\nE recognize the opportunities of our position—<br />\nis our Editorial writer so naive<br />\nBut<br />\none<br />\nis<br />\nwhat<br />\nsaid, \"Pardon me, but<br />\nof realized friends, of acquiring knowledge, of<br />\nRemit subscription feee to Treasurer, Student Activities Council,<br />\nas to expect the Democratic governRemsen Hall, Postoffice, _Nina Hopkins University.<br />\nwidening our character. We also know the temptations<br />\ngood reason why the Barnstormers<br />\nor to appoint a Republican to such<br />\nEntered as second class WEE, December 3, 1909, at the poitoffice to do the diametric opposite—of kissing everyone, of<br />\nwon't give another show if they don't<br />\nin BlItilitOre Md., under the Act of Congress, November 3, 187f<br />\ntalking about the weather, of yielding to the pressure<br />\nan office? (If he or anybody else is,<br />\none?\"<br />\ngive<br />\nPublished semi-meekly from October to June, except during examine. of certain groups, of selfishly working for personal<br />\nI suggest they dismiss a few points<br />\na<br />\nhave<br />\ndon't<br />\nHopkins<br />\nBarnstormers<br />\nthe<br />\nof<br />\nJohns<br />\nundergraduates<br />\nperiodiuby<br />\n4<br />\nWE LEAD (\"We have re\"If the<br />\nbon and college holiday<br />\ngain.\"<br />\nin political science and politics with<br />\nUniversity.<br />\nmoved the last vestige of com- second show, and who says they are<br />\nour Mr. Leon Sachs).<br />\n/ HAVE tried during my administration to live up to mercialized athletics. We have definMEMBER<br />\nbe<br />\nwill<br />\nmoney<br />\nnot going to have one,<br />\n9IITIN<br />\nR AS10C<br />\n1:<br />\nIN1120:LICIATZWSPAr<br />\nthe ideals and goals I set up as I took office.<br />\nIt is plain to me that the NEWSitely asserted our sincerity in mainthe reason\" I said.<br />\nEDITORIAL STAFP<br />\ntaining a reasonable emphasis on<br />\nLETTER has accepted the opinions of<br />\na<br />\ngot<br />\nEditor-in-Chief WOKING out some of the highlights:<br />\n\"I've<br />\nyelled,<br />\nhe<br />\nJ. Murray Kempton<br />\non,\"<br />\n\"You're<br />\nto<br />\nwide<br />\nparticiview<br />\nwith<br />\na<br />\nsports<br />\nCo-Editor<br />\nthe Philadelphia Record as unerring.<br />\nWethered ilsr,11, Jr<br />\nEXPLANATION NEEDED (about the disrespect pation among students . . . \") and<br />\nFeature Editor<br />\n...<br />\nSeymour Sacks .<br />\nstory!\"<br />\nIt would have been better for the<br />\nI C. Handelsman, litiyr M. VietorZ..... A.1tina.t Managing Editor: of both students and University officials for the OUR ATHLETIC POLICY, A NEW<br />\n.<br />\nEditor<br />\nSport,<br />\nZheutlin<br />\neyed<br />\nHarold<br />\nFriday, January 21, I casually<br />\nclearNews-LETTER to wait for the Records<br />\n_Acting Sports Editors Honor system) . . . ABOUT THE DORMS f<br />\nArnold Glantz, Nathaniel FinkelsteinANGLE, ALL FTPOH INS A<br />\nAssistant Sports Editors ing up and appraisal of this incident) . . . WHEN<br />\nCharks Diggs. Milton Alperstein<br />\npage of my NEWS-LETTER, charges to be answered, for the NEWSGUEST EDITORIAL, WATCH OUR the front<br />\nBrehoript Editor<br />\nMal Boahriack,<br />\napNews-LETTER<br />\nof<br />\ncame<br />\nDO WE APPEAR (Irregularity<br />\nREPORTRIS<br />\nAMATEURS PLAY, ALL THE and finally looked down until I<br />\nLETTER has no special reporters covMel Taymor, '40; Morris Wessel,.39; Leonard Quitt, '40;<br />\npearance due to financial causes) . . . DOUBLE BEN- WORLD, CHANGE OF A PPITUDE<br />\n-the feature article on the 'Storm- ering such political assignments and<br />\nDaniel Stone, '39; Zeana Baum; '38; Carl Resin, '38;<br />\nEFIT and HELP ADS TO HELP US (pleas for correc- besides the successful TOMORROW'S<br />\nLester Rosenthal, '38; Leonard IV:Olinger, '38; Thomas<br />\nars. \"Interesting,\" -1 - said to myself, no first hand information. This being<br />\nMcElhiney, 41'; Seymour Rtildn, '40; Kennth Maxey, Jr.,<br />\ntion) . . . CRUCIAL ELECTION (most important POLL.<br />\ntmo,<br />\nMillvirg, '39; Herbert Xleinfeld, '41; John<br />\nnot,<br />\n\"Very interesting indeed.\" The little the case, the News-LETTER can<br />\nHigham, '41; Sheldon Fuchs, '38.<br />\noffice presidency of student council) . . . CONCERNand should not write of the political<br />\nBUSINESS STAFF<br />\nING THE ELECTION (\"For an enlightened, conscien- PERHAPS one of the most persist- note about filling the house through<br />\nJersey<br />\nNew<br />\nof<br />\nState<br />\nthe<br />\nin<br />\nsituations<br />\n. Busing. Mower tious, and thinking Student Council President, we urge<br />\nMelville Locker<br />\nent and worthwhile campaigns of • mck\" was particularly interesting.<br />\nor of any other State, unless such<br />\nt 938<br />\nMEMBER<br />\n1 937<br />\nthe election of William B. Kempton\") . . and CON- the past NEwseLETTER year was:<br />\nWorking two months of days and articles are backed by substantial<br />\nASSocIATIO COLLEGIATE Feiss;'Distribtours, COLLEGIATE MOUT<br />\nGRATULATIONS, BILL.<br />\nTHE PHI BETE CASE (. . , Phi nights with almost fifty men and to primary evidence. Lack of such primRepresented for National AdvertNing.by<br />\nBeta Kappa has a weighty and<br />\nwas filled merely by ary, evidence can be dismissed if the<br />\nNATIONAL ADVERTISINO SERVICE, Inc.<br />\nE did not hesitate to critize, nor were we reluctant vital influence on serious student un- say the house<br />\nto matters<br />\n420 'Madison A vrtme, New York City, NeW York<br />\nluck was high praise for a man to editorial is in reference<br />\nto praise:<br />\nwho<br />\nto<br />\nlook<br />\nforward<br />\ndeigradautes<br />\nalready fully discussed and closed;<br />\nTUESDAY, FEBRUARY 15, 1938<br />\nmembership . . . Students, like us, give his organization. Consequently but in this case the NEWS-LETThR<br />\nYEAR OF ODK AND THEORY AND PRACTICE are unable to understand the rejec- this is the first point I want to make<br />\nfinds itself taking sides in a live<br />\nThe editorial column this week is given to a former<br />\n(\"for the most part, we cannot help but feel tion when we consider the qualifica- clear. Full houses are not built by<br />\ndiscussion and immediately forming<br />\neditor for his farewell editorial.<br />\nthat O.D.K. did not live up to the standards it has set tions necessary and the qualifications<br />\nluck. Moreover it was hard work of \"editorial\" opinions, though having<br />\nMISS IT!<br />\nHarvard University up.\") . . . WHITHER Pi D.E.? . . . DON'T<br />\npossessed by this undergraduate .. .<br />\nthe Barnstormers alone and all those only a small part of the significant<br />\nTURN (bouFebruary 10, 1938 and THE PLAYSHOP TAKES A NEW<br />\nlet us say that this case demands rethat filled the facts as a basis.<br />\nquets for Hopkins' Little Theater) . . . PRAISE FOR consideration . .. action can be taken working with the club<br />\nDear Murray:<br />\nhouse. I would greatly appreciate<br />\nanarI hope it is clear to you, Mr. EdiAllow me ex-otticially to THE MUSICIANS . . . WE ARE AGIN' IT (the<br />\nexIf the chapter meets again and<br />\nyour making a correction of this tor, that this letter is not an opinion<br />\nJOB WELL<br />\ncongratulate you and wish chistic method of releasing marks) . . . A<br />\namines carefully all possibilities)<br />\nI<br />\nmust<br />\nnext<br />\nin<br />\neditorial.<br />\nyour<br />\npoint<br />\nTheVare,M,<br />\nand<br />\nthe substance of your editorial,<br />\nof<br />\nJr.,<br />\nNE (\"To Harold A. Ricards,<br />\nyou high success in your<br />\na-aa EVERYONE SHOULD ATrefute' having said anything about nor does it take one side .against the<br />\nthe<br />\nSchad,'the editors. of the'T' Handbook, must<br />\nnew position.<br />\n. the protest meeting<br />\nTEND (\".<br />\nluck entering into our success.<br />\nother. I do nOt express myself as<br />\nYou should feel deeply thanks of every Hopkins student\").<br />\nThere is no doubt<br />\nthis afternoon .<br />\nAnother very interesting statement eithei. pro- or anti-Hague; but I<br />\nhonored and realize in propthat in order to get something done<br />\nfrom<br />\nSense<br />\nany<br />\nin<br />\nworld<br />\nstrongly condemn the type of edithe<br />\nO barrier separates<br />\ner measure the responsibilities and potentialities of<br />\nwe have to crystallize our senti- in the same article was that of Swyer<br />\naffecting us students. The NEWS-LETTER has re- ment), LEST WE FORGET, LET complaining about the support of torial presented and the method and<br />\nyour office. Particularly on this campus, where there<br />\nprocedure in presenting it. •<br />\ncriticism) for its<br />\nis not a trace of censorship, is the post of editor a ceived high praise (as well as bitter<br />\nJUSTICE BE DONE (\". . . special the student body. Why he should is<br />\na provincial think- meeting of Phi Beta\"), A FULL beyond me. The students gave more<br />\nYours truly,<br />\nsignificant and powerful one. The degree to which you stands on subjects which go beyond<br />\nCLEARING NEEDED (\"This eve- support to Boy Meets Girl than any<br />\nand the manner in which you use the available op‘ior- er's mind. For example:<br />\nA.H.<br />\nfour<br />\nthe<br />\nin<br />\nlast<br />\nning the Hopkins chapter of Phi Bete play given at Hopkins<br />\ntunities and privileges will be a yardstick of your<br />\nLIP-SERVANT TO LIBERALISM?. .. Kappa meets . . .\") and then finally years. Twelve hundred of the some<br />\nLIPPMA.NN,<br />\nachievements.<br />\n. ENGLISH<br />\nFASCISTS TO THE RESCUE .<br />\nthe NEWS head—\"SHILS ELECTED fourteen hundred seats were conou will find your new job fertile with chances to OVER EUROPE ... ARMAMENTS LEAN TO WAR . . . to Phi Bete, ELECTION AMEND- sumed by the students alone. Even<br />\naccomplish great benefit for the campus and for IMPORTANT MEDICAL PROBLEM • . . SIGNS OF MENT OAFtRIED.\"<br />\nthe dance after the play showed the<br />\nyourself; you should understand the possibility of the DEMOCRACY (\"We can see that the students and<br />\nany Barnstormer<br />\nthe rejected greatest support of<br />\non<br />\nrecently,<br />\nmost<br />\nND<br />\nWhereas we believe that true frat<br />\nupon<br />\nopposite's being true also. Unless this is impressed<br />\ndance. Thus, I must rebate this statepeople of the constitutional republic of Spain are Rillapplication of the<br />\nassembly<br />\nernalisin lies only within the scope<br />\nduties<br />\nyour<br />\nof<br />\nview<br />\nof<br />\nclear<br />\na<br />\nprinciples<br />\nhave<br />\nyou<br />\nyou, unless<br />\nment too. In fact I wish to thank the<br />\ncere in maintaining and spreading the<br />\nmy<br />\nwas<br />\nYoung Communist League<br />\nof a personal and not an abstract<br />\nand opportunities, your new outlook will not receive democracy) . . . STAMP OUT SYPHILIS and START<br />\nmembers of the student body for<br />\nlast regular editorial:<br />\nrelationship; that the benefits of<br />\nthe required adjustment.<br />\nhaving given the best support I have<br />\nON DRIVE . . . TOO MANY DOCTORS?<br />\n\"WE think the relevant point is the ever seen given to any Hopkins or- fraternalism can be fully enjoyed<br />\nrealize<br />\nmust<br />\nERHA.PS, most important of all, you<br />\ntradition long associated with ganization. The publicity of the without the superfluities of a nationUT the campus was not neglected thereby; every<br />\nthat the responsibility for every single item, every<br />\nthe Hoplehis of rememberance for NEWS-LETTER was admirable; the al organization; that the bonding<br />\naspect received stielly and comment as:<br />\nNEWSthe<br />\nto<br />\nregard<br />\nin<br />\ndecision<br />\nevery<br />\nmove,<br />\nindividual<br />\ntruth, respect for liberty, and above Blue Jay proved itself a worthy cam- together of incongruous groups of<br />\nLETTER goes ultimately (and very quickly) to you. This LOVEJOY'S RETIREMENT . . LACK OF PARK- all, a faith in the free exchange of<br />\ninto a false fraternalism by this<br />\npus magazine; the students were en- men<br />\nnaturally necessitates polished sense of judgment, fact,<br />\nnational organization is both hypo- '<br />\nING SPACE . . MEET YOUR GIRL, ANOTHER ideas and opinions.<br />\nthusiastic—all,this not like the picwill<br />\nyou<br />\nfirst<br />\nAt<br />\npatience, and organization ability.<br />\nPLAY, COME ON 'STORMEFtS . . . LET'S MAKE'IT \"THE matter of an assembly for tures painted in the articles in the critical and meaningless; that the acpersonally have a great deal of work to do. You have PERMANENT (\"need for this sex lecture instructions of numerous Eastern Univerthe Y.C.L. is but a particular NEWS-LETTER.<br />\nno idea of the diamond-shaped angles which your new tion\") . . . A STIMULATING SPEAKER (\"Hays'<br />\nsities have proved the national fratto the generality of academic freeThe only circumstance that I ern ernity system to be obsolete and antiposition splits into.<br />\ntalks . . . full of color, fire, wit—and information\") dom.\"<br />\nsee the organization failed in .was quatestr<br />\nSYSTEM (\"We will have to investigate<br />\nN the campus you will find that you are the News- . . . HONOR<br />\nTHE highest compliment that has the - -publicity in outside papers. I<br />\nthe reasons behind the present defeats and<br />\ncarefully<br />\nconcomplaint<br />\nof<br />\nAnd whereas it is our earnest wish<br />\nkind<br />\nEvery<br />\nLEITER personified.<br />\nbeen paid to me was on the last agree with the editor in the editorcorrect these; or weshould be courageous 'enough to<br />\nmem- ial Tuesday that you have to, fight and desire to inculcate in our memceivable (and even some that are inconceivable) will<br />\nof the Honor day of my _editorship when a<br />\nfailure<br />\ncomplete<br />\nor<br />\npartial<br />\nthe<br />\nadmit<br />\nreach your ear. Each activity leader, each department<br />\nber of the administration called me with 'every columnist to get any- bers the principles of true manhood;<br />\nSystem Eit the Hopkins\") . .<br />\nhead will think that, his particular' interest in puba \"bum editor\" after expressing dis- thing printed. I know, but does he? top romote the moral welfare of all<br />\nBe<br />\nabout.<br />\nworry<br />\nto<br />\nhave<br />\nour members;, to stimulate and enyou<br />\nlicity is the only thing<br />\nI THINK that the NEWS-LETTER has been of some help agreernent over a fundamental edi- The publicity of the Barnstormer's<br />\nindicates was entrusted to the careful hands of courage scholarship; to encourage<br />\nsure that you have him continue to think that.<br />\nin adjusting freshmen (the chronological as well as torial policy. This incident<br />\nto me that I was not a following \"Ye Editor\" himself. (Stan Finkel). loyalty to and active interest in The<br />\nET a generous share of appreciated praise is yours intellectual kind) as:<br />\nJohns Hopkins niversity; to foster<br />\neditor, but sought to be thinkingly<br />\nthe<br />\nEnough said about the past articles a<br />\nat times. Be able to separate the pearls from<br />\nfind<br />\nyou<br />\n(\"When<br />\n.<br />\ndemocratic and friendly spiirt beFRESHMEN, PLEASE NOTE . .<br />\nindependent.<br />\nin the NEWS-LETTER, The important<br />\nempty, oyster shells. Ask for honest criticisms; keep<br />\nuncomfortable,<br />\nmentally<br />\nthat you are becoming<br />\nthere has existed vary- question at hand is whether there tween our members and all others<br />\nALTHOUGH<br />\nwould<br />\nit<br />\nPerhaps<br />\nimprovement.<br />\nfor<br />\nseeking suggestions<br />\nwith whom we may be associated;<br />\nyours—then you may be<br />\ning degrees of divergence in the will be another show this year or<br />\nfrom the when a healthy skepticism is<br />\nbe it good idea when praise comes, to look<br />\nto furtheur any esteem in which we<br />\nHopkins educafrom sure that a college education, and a<br />\nvimes of the faculty, administration not.<br />\nstaff up; when adverse criticism is raised, to look<br />\n.<br />\n.<br />\n.<br />\nmay be held, and to inspire amoung<br />\ntions, is yours\") . • . ABOUT YOUR SCHEDULE<br />\nand the NEWS-LETTER, I can truthyourself down.<br />\nIf the club can see its way through, our members a true, loyal, and lastABOUT ACTIVITIES . . ABOUT FRATERNITIES fully state that there has never been<br />\ncampus<br />\nof<br />\nREA<br />\nbe<br />\nBarnshow.<br />\nFOR<br />\nthere<br />\nanother<br />\nphases<br />\nwill<br />\nPLEA<br />\ning<br />\nmany<br />\nfriendship.<br />\nin<br />\ncampus—'A<br />\nthe<br />\nactive<br />\nof<br />\ncare<br />\nstudent<br />\ntaking<br />\n.<br />\n. .<br />\nEING a<br />\nthe slightest suggestion of censorunhealthy spEar, UTILE HELP, PLEASE.<br />\nstormer meeting next week will delife, you, will be subjected to many<br />\nWe former members of the Eta<br />\nship. I hope that this healthy and<br />\ncide the question.<br />\nconflicting' intemptations. You will be ,the center of<br />\nChapter of the Phi Alpha Fraternity<br />\nto bring out problems which desirable situation continues.<br />\ncharacter. It's IN the past we have tried<br />\nYours,<br />\nterests. Here is the real test of your'<br />\n- Aeisys-uncler our own will and<br />\nCAN say honestly and sincerely<br />\naffect and which we share with our fellow-students<br />\nLewis<br />\nSwyer<br />\neverybody.<br />\nto<br />\n\"yes\"<br />\nsay<br />\nvolition, seveeally and jointly, severe<br />\nso easy, you know, to<br />\nthat I value no other single ex•<br />\neverywhere:<br />\nall our relationships with the Phi<br />\nou should never forget, although the campus never THE TRUTIT MAKES WHO FREE? -.(\"However, perience more than my association Editor, Johns Hopkins NEWS-LE IN, Alpha<br />\nFraternity; and from this<br />\nextrawith the News-LETTER. I can think Sir:<br />\nremembers, that the NEWS-LETTER is but an<br />\neven though true, is<br />\nhurts,<br />\nthat.<br />\nspeech<br />\nof<br />\ndate shall be known as the Epsilon<br />\nfreedom<br />\nthe<br />\nwith<br />\nput<br />\nis<br />\ncompares<br />\nthat<br />\nof nothing<br />\ncurricular activity. This means that our paper<br />\nlike<br />\nI<br />\nto<br />\nPRESS<br />\nAlthough<br />\nsee<br />\nthe NEWS- Tau Alpha Fraternity.<br />\nA GAGGED<br />\nschedules, in their too much for the Pitt faculty) . . .<br />\nenjoyment, the instruction, the pleasout by students, with full scholastic<br />\nLETTER play at writing editorials, I<br />\nour symETA<br />\nenthusi- I\". . our fellow-editors from Temple have<br />\nant memories that go with this exspare time. You know, of course, that in our<br />\nan<br />\nthat.in<br />\nthem<br />\nmust<br />\npoint<br />\nout<br />\noffer<br />\nthe-Jenuary<br />\nto<br />\nattempts<br />\ninstitution<br />\nTheir<br />\nperience.<br />\nFebruary 9, 1938<br />\nthis fact. But, pathies.<br />\nasm we have sometimes lost sight of<br />\n21st issue, you allowed a particuef ..the consequences.—<br />\nafraid<br />\nis<br />\nthen<br />\nand<br />\neducation<br />\nidea<br />\nthis<br />\nhave<br />\nyou who carry on I say: Re- larly<br />\nby and, large, you ought constantly to<br />\nand childish bit of<br />\nridiculo<br />\nopinions on the part of'the students\") . . ACTING<br />\nmember your high ideals and re- slander to be printed. I refer to the<br />\nin mind.<br />\nCOLLEGE (\"Down with Joe College\") . . NEEDED<br />\nof<br />\nchange<br />\nnew<br />\na<br />\nEven<br />\neditorial \"Jersey City's Mayor,\" in<br />\na summary AID (. . . \"cutting down of N.YA\") . . . AN IMPOR- sponsibility.<br />\nTWO fold purpose would be served by<br />\ndoes not alter your which Senator John Milton<br />\nwas rewere taken TANT STRUGGLE (\"We students should be concerned administration<br />\nof the main issues and stands which<br />\nof<br />\nand<br />\ninheritance<br />\nwith<br />\nconnection<br />\nourselves<br />\nfor<br />\nferred to as \"the lowest sort of<br />\nwould be<br />\n(Continued from Page 1)<br />\nwith what is going on in Spain. Students like<br />\nduring my administration. The campus<br />\nthe NEWS-LETTER'S past policy and petty-fogging hack\" whose record<br />\nplace<br />\nof<br />\nto<br />\ndecent<br />\npolicies<br />\na<br />\nhomes<br />\nthe<br />\ntrials; we do not attempt to conare fighting to make their<br />\nevaluation given in concentrated form<br />\nreputation.<br />\nbe<br />\nhim<br />\nnfit<br />\nu<br />\nfor<br />\nmakes.<br />\nnosy<br />\npublic<br />\nyou<br />\noffice,<br />\nperhaps<br />\nwe do not think of ourselves<br />\nvict;<br />\nand<br />\nin.\")<br />\nLETTER<br />\nlive<br />\nthe past year's NEWS/ HAVE confidence that you will be and in which it is grandiloquently as the sole owners and proprietors<br />\nfuture attitudes.<br />\noffered a preliminary basis for your<br />\noutand<br />\nconsistent<br />\npolicy<br />\nour<br />\nrepsonsikeep<br />\nand<br />\nhonor<br />\nto<br />\nthe<br />\ntried<br />\nof<br />\nworthy<br />\nconcluded that \"no representative of of the Honor System. Our purpose<br />\nI HAVE<br />\nLooking over my very first paper:<br />\nbility attached to your new position. New Jersey . . . deserves a seat in is an educational one.<br />\nspoken. Among the outstanding issues:<br />\nPLACE OF A COLLEGE PAPER<br />\nNOW that I realize that I'm writ- Congress.\"<br />\nThe Honor System is the personal<br />\nMORATORIUM ON TRUTH?<br />\nparticular way, a coling my last words in any offiBy what right, and I ask this with property of every student of the Hop\"TO a particular audience in a<br />\n. \"We want to make sure that nothing interferes cial capacity, my feelings aren't ex- great<br />\nAnd<br />\n.<br />\n.<br />\n..<br />\nfunction<br />\nreal<br />\ndoes<br />\nour<br />\nconcern,<br />\nits<br />\nfulfills<br />\nNews-LETkins. The majority of the student<br />\nlege newspaper<br />\ntraditional academic freedom and liberal atti- actly of the pleasantest kind . .<br />\nexamination of editorials with the<br />\nTER dare to present lawyer John Mil- body cherish it as such. But the<br />\nmost important of all, an<br />\nassociated with our University since its founding After three and a half years of connot only the campus, tonic<br />\nton as \"the lowest sort of petty- jump from an ideal to a practical<br />\nchange<br />\nor<br />\nwill show•that problems involving<br />\nundermine<br />\nto<br />\n. And if we do anything<br />\nstant association with an activity, fogging hack?\" I do not know Sen- issue is a broad one. When it comes<br />\nstudents are directly<br />\nbut the world, in so far as the<br />\nthose long-standing traditions during this financial it starts to \"get under your skin.\"<br />\n\"and—<br />\nator Milton personally, but I am to reporting a violatiOn of the Honor<br />\nor indirectly affected, are treated<br />\ncampaign, we will obtaining money under false pre- Yet because I_ feel that I've gotten<br />\nsure that Congress can examine his System, most of us are reluctant<br />\ntenses.\") . . ..and OUR PLACE ON THE CAMPUS<br />\nPLACE OF THE HOPKINS' PAPER<br />\nmy<br />\nfrom<br />\npermanent<br />\nsomething<br />\nrecord as the NEWS-LETTER suggests, in the matter. But an ideal is worth<br />\nwe \"(fE believe the NEWS-LETTER has the right and duty \"News-LETTER work, the importance with \"microscopic thoroughness.\" fighting for, if it be a true 'One. Ills<br />\nWe are a newspaper of that University;<br />\n\". .<br />\nfade.<br />\nstarts<br />\nto<br />\nseperation<br />\nphysical<br />\nof<br />\ntraditions<br />\nthe<br />\nfull<br />\nin<br />\nCongress will find that he was legal for this purpose—to supply a mebelieve<br />\nto take a stand on all ,student issues. We<br />\nare a publication that accepts<br />\n..<br />\nin presenting facts in news stories, but opinions in MAY I say officially and personally council to three New Jersey govern- chanism whereby the student body<br />\nand ideals of the Hopkins as its own<br />\nto all Hopkins' goodby and ors, which the News-LETTER does not can better maintain its Honor Systo present student<br />\nimpartial, and uncolored editorial . . . crux of our function:<br />\nE desire to present fair,<br />\nconsider an edifying achievement al- tem—that the Student Honor Com. . . SUPPORT thanks.<br />\npages. But attitudes towards student questions.\")<br />\nnews accounts on the allotted three<br />\nTANLEY MORTON FINKEL' though our Statesmen will all admit imission exists.<br />\nSTRIKE and TWO ANNIVERSARIES<br />\nsanctum sanctorum—we will THE PEACE<br />\non the editorial page- -our<br />\n<br />\nt tu 5<br />\n<br />\n'letter<br />\n<br />\nW<br />\n<br />\nF<br />\n<br />\nii<br />\n<br />\nFl<br />\n\"S<br />\n<br />\nAGAIN<br />\n<br />\nafte<br />\nfou<br />\nwin<br />\nthe<br />\nheld<br />\nmos.<br />\nBlue<br />\n<br />\nA<br />\n<br />\nEpsilon Tau Alpha<br />\nStatement<br />\n<br />\ny<br />\n<br />\nA<br />\n<br />\nB<br />\n<br />\nO<br />\n<br />\ny<br />\n<br />\nB<br />\n<br />\nI<br />\n<br />\ny<br />\n<br />\n\"W<br />\n<br />\npla<br />\nJoh<br />\n<br />\ntory<br />\nnot<br />\n<br />\nN<br />\n<br />\nA<br />\n<br />\ntea<br />\n<br />\nW<br />\n<br />\nFinkel Reviews<br />\nNews-Letter<br />\nPolicy<br />\n<br />\np<br />\n<br />\nA<br />\nthe<br />\n<br />\nCommission Functions<br />\nDefined<br />\n<br />\nIt<br />\ned t<br />\nthat<br />\nag)•<br />\nLam<br />\nafte<br />\nNext<br />\nmar<br />\nSi<br />\ncept:<br />\nLam<br />\na se<br />\nto<br />\nutes<br />\nIn<br />\nteam<br />\ntie. '<br />\ntemp<br />\nin, M<br />\ned a<br />\nthe .<br />\nHopk<br />\nOn<br />\na sit)<br />\nsera<br />\ngrab.<br />\nwho<br />\n\"Sho<br />\nwent<br />\nleft.<br />\nSh.<br />\nRoss<br />\nhalf<br />\nMoor:.<br />\nLain;<br />\nbound<br />\nAg:<br />\nthis ti<br />\nwith<br />\nand C<br />\nPointe<br />\nfouled<br />\nThe<br />\none o<br />\ntoed t<br />\ntors on<br />\nfirst,<br />\ngym.<br />\nmark,<br />\ncords,<br />\nand t<br />\nwere<br />\nthis hi<br />\nHow<br />\ncheeri<br />\ntook<br />\nclesper:<br />\nshot a<br />\nthe co<br />\n26. A<br />\nHopki<br />\nfifteen<br />\nwere a<br />\nwas 11).<br />\n26.<br />\nAfte<br />\nthe loc<br />\ngame.<br />\nWhen<br />\nabout t<br />\nthe bi:<br />\nbaskets<br />\nThe<br />\nand w•<br />\n<br />\nthe co<br />\nthe Ja<br />\nThroug ,<br />\nthe Jo<br />\nHopkin•<br />\n14-13,<br />\nthe lea<br />\nuntil th<br />\nthe sco<br />\n<br />\n\fHOMEWOOD, BALTIMORE, TUESDAY, FEBRUARY 15, 1938<br />\n<br />\n3<br />\n<br />\nBattling Blue Jays Bow To St. John's Five 27-26<br />\nGAME WON BY<br />\nJOHNNIES IN LAST<br />\nFIFTEEN SECONDS<br />\n\"Shorty\" Cross Sends Hopkins Ahead 26-25 In<br />\nClosing Minute<br />\nJohnny Lambros Big Gun<br />\nFor Annapolis Lads With<br />\n12 Points<br />\nA 27-26 count tells the story of<br />\nclash between the basketball<br />\n<br />\nthe<br />\n<br />\nteams of Hopkins, and St. Johns<br />\nplayed Saturday at Homewood. St.<br />\nJohns emerged victorious, but only<br />\nafter a battle that was rough, hard<br />\nfought, and exciting throughout. The<br />\nwinning shot was made by Shawn in<br />\nthe last fifteen seconds of play.<br />\nWith<br />\n<br />\nten<br />\n<br />\nminutes left, Hopkins<br />\nheld its largest edge at 23-18. Then,<br />\nmost spectators believed that the<br />\n<br />\nLine-up<br />\nSt. Johns<br />\nLambros, f.<br />\nTarantino, f.<br />\nRoss, f.<br />\nRowe, c.<br />\nDe Lisio, g.<br />\nShawn, g.<br />\n<br />\nHopkins<br />\nMelvin, f.<br />\nTraggis, f.<br />\nMoore, c.<br />\nCross, c.<br />\nRasin, g.<br />\nMacLain, g.<br />\n<br />\nGls.<br />\n5<br />\n1<br />\n1<br />\n1<br />\n1<br />\n1<br />\n<br />\nFin.<br />\n2- 5<br />\n0- 1<br />\n2- 2<br />\n1- 2<br />\n1- 2<br />\n1- 1<br />\n<br />\nPts.<br />\n12<br />\n2<br />\n4<br />\n3<br />\n3<br />\n3<br />\n<br />\n10<br />\n<br />\n7-13<br />\n<br />\n27<br />\n<br />\nGls.<br />\n3<br />\n2<br />\n1<br />\n1<br />\n.1<br />\n.2<br />\n<br />\nFin. Pts.<br />\n0- 1<br />\n6<br />\n1- 3<br />\n5<br />\n0- 1<br />\n2<br />\n2- 4<br />\n2- 5<br />\n4<br />\n1- 1<br />\n5<br />\n<br />\n10<br />\n<br />\n6-15<br />\n<br />\n26<br />\n<br />\nFRATERNITY FIVES<br />\nCOMING INTO FINAL<br />\nLAP OF YEAR'S PLAY<br />\n-Pi Epsilon, Phi Gamma, Tau<br />\n<br />\nTWO RELAYS DECIDE FIRST HOME<br />\nSWIMMING MEET AS JAYS LOSE<br />\n<br />\nIntercollegiate Schedule<br />\n-<br />\n<br />\nTuesday—Hopkins vs. Loyola at<br />\nSeeking their third win, the Blue last lap over a fast tiring rival. This<br />\nJay swimmers met Swarthmore Sat- last victory brought the score to<br />\nhome.<br />\nurday. However, the Pennsylvania Hopkins 32, Swarthmore 36, with<br />\nThursday -Hopkins vs. Western<br />\nlads nosed out a 43-32 win over but one event remaining, the 320<br />\nMaryland, Away.<br />\nHopkins in the City College pool. The yard free style relay with its seven<br />\n43-32 score does not tell the real point value. However, the Jays steady<br />\nWrestling—<br />\nstory of the meet, for the Jays were gain in the scoring column turned<br />\nFriday—Hopkins vs. Gallaudet,<br />\nfirst in five of the seven individual out to be in vain. The visitors got<br />\naway.<br />\nevents, but lost out in both relay away to a flying start and held their<br />\nraces.<br />\nlead throughout, to win the relay by Swimming—<br />\nThe Pennsylvanians immediately ten yards and the meet by eleven<br />\nTuesday—Hopkins vs. Univergained a lead when they were vic- points.<br />\nsity of Delaware, away.<br />\ntorious by a wide margin in the 240 240 yard medley<br />\nrelay- -Won by<br />\nyard medley relay. Captain Alan Hill<br />\nSwarthmore (Brown, Mawhiney,<br />\nSaturday—Hopkins vs. Lehigh,<br />\nthen came in first in the 220 yard<br />\nStone) 2:47.<br />\naway.<br />\nfree style race to score the first Blue<br />\n220 yard free style--Won by Hill,<br />\nJay points. However, Carroll, and<br />\nFraternity Schedule<br />\nHopkins; second, Carroll, SwarthW. Mifflin of Swarthmore took secmore; third, W. Mifflin, Swarth- Saturday—<br />\nond and third places. C. Mifflin of<br />\nmore. Time-2:41.7.<br />\nKappa Sigma vs. Pi Lambda Phi.<br />\nSwarthmore upset Radner in the 40<br />\nEpsilon Tau Alpha<br />\nyard free style event to win the first 40 yard dash—Won by C. Mifflin,<br />\nSwarthmore; second, Radner, HopPhi Gamma Delta vs. Phi Alpha.<br />\nof the two individual races taken<br />\nkins; third—Simmer, Swarthmore.<br />\nPhi Epsilon Pi vs. Tau Alpha<br />\nby the visitors.<br />\nTime-20.6.<br />\nOmega.<br />\nJacobs Wins<br />\nDelta Upsilon vs. Sigma Phi<br />\nHal Jacobs was victorious in the Fancy Dive—Won by Jacobs, Hopkins; second, Angell, Swarthmore;<br />\nfancy dive with 71.8 points, Angell<br />\nEpsilon.<br />\nthird,<br />\nClevinger,<br />\nand Clevinger of Swarthmore reSwarthmore.<br />\nAlpha Delta Phi vs. Delta Phi.<br />\nspectively took second and third. Winner's point-71.8.<br />\nKappa Alpha vs. Deta Theat Pi.<br />\nAlan Hill won his second event, the 100 yard free style—Won by Hill,<br />\nAlpha Epsilon Pi vs. Alpha Tau<br />\n100 yard free style in what was<br />\nHopkins; second, Stone, SwarthOmega.<br />\nprobably the most thrilling match<br />\nmore; third, Clevinger, Swarthof the day. Leading by inches until<br />\nmore. Time-1:1.3.<br />\nthe last turn, Hill fell behind as 150 yard backstroke--Won by Weinthe mermen headed for the last<br />\ner, Hopkins; second, Stone, Swarthtwenty yards. However, a last minmore, third, Dunlop, Hopkins.<br />\nute spurt brought the victory to<br />\nTime-2 m.<br />\nHopkins as Hill emerged first by 200 yard breastroke—Won by Mathose same inches. In the 150-yard<br />\nwhiney,<br />\nSwarthmore;<br />\nsecond,<br />\nbackstroke Weiner of Hopkins finAdams, Hopkins; third, Zinner,<br />\nished first and Dunlop of the Jays<br />\nSwarthmore, Time-2:37.4.<br />\ntook a third place.<br />\n440 yard free style—Won by Radner,<br />\nMawhiney of Swarthmore was<br />\nHopkins; second, Carroll, Swarthvictorious in that long pull that commore; Bennett, Swarthmore. Time<br />\nprises the 200 yard breaststroke race,<br />\n-Z 58.4.<br />\nAdams took second for Hopkins. An- 320 yard free style relay—Won by<br />\nother event won in the final few yards<br />\nSwarthmore (C. Mifflin, N. Smith,<br />\nwas the 440 yard free style.<br />\nStone, Simmer).<br />\nRadner steadily gained a lead in the<br />\n<br />\nAlpha Omega, And EpBlue Jays were on the road to victory, but the fighting Johnnies were<br />\nsilon Tau Alpha Win<br />\nnot to be denied.<br />\nEpsilon Tau Alpha, the former Phi<br />\nLambros Starts<br />\nIt was Johnny Lambros who start- Alpha fraternity, and one of the leaded the Annapolis- lads on the rally ing undefeated contenders for the<br />\nthat knotted the count at 23-23 and inter-fraternity basketball trophy,<br />\nagain at 25-25. With the score 23-18 continued its winning streak with a<br />\nLambros tallied on a- dribbled in shot crushing 30-2 victory over the hapafter he had faked life way clear. less A.E. Pi quintet.<br />\nNext, Lambros added a charity<br />\nRossett led the scoring for the<br />\nmarker to bring the score to 23-21.<br />\nETA's with eight points while<br />\nBill Ross of the Johnnies inter- Locker ran a close second with<br />\nsix<br />\ncepted a Hopkins pass, and he and points. It was the fourth straight vicLambros went down the floor. After tory for the ETA's.<br />\na series of passes, Lambros tallied<br />\nFreshman Stars<br />\nto knot the score 23-23. Seven minPhi Epsilon Pi won its first game<br />\nutes left.<br />\nof<br />\nthe<br />\nseason<br />\nin defeating Phi Sigma<br />\nIn the next few minutes both<br />\nteams tried desperately to break the Delta 24-16. Due to the sharpshoottie. Ross fired two longs, Melvin at- ing freshman, Ellenbogen, who scortempted a long, Lambros dribbled ed 14 points, they easily topped the<br />\nin, Moore passed to Rasin, who miss- Phi Sigs.<br />\ned a long, and with St. Johns having<br />\nIn one of the best games of the ,<br />\nthe ball on a out of bounds play day TAO. led by little Marty SrebHopkins called time-out.<br />\nnik defeated the Phi Psi contingent,<br />\n11-8. Both teams were undefeated,<br />\nHopkins Ahead<br />\nOn the next play Tarantino missed and it was a contest which probably<br />\nUnable to hold a early lead, the finished with a draw.<br />\na short for St. Johns. There was a decided the league \"C\" championHopkins wrestlers also dropped a 118-Pound Class--Longcou<br />\npe, Haverscramble for the leather with Cross ship.<br />\nthrilled to Haverford last Saturday<br />\ngrabbing it. Cross tossed to Rasin<br />\nford threw Whelam in extra period.<br />\nPhi Psi At Half<br />\nwho missed, but one the rebound<br />\nThe game was fast and furious 20'—i5½. Coach Baer's cohorts got 126 Pound Class—Vernon, Hopkins<br />\n\"Shorty\" tapped it in and Hopkins with little scoring by either team. away to a good start, but Haverford<br />\nthrew Simons in 1 min. 15 sec.<br />\nwent ahead at 25-23. Two minutes Psi, however, led by the score of drew up to knot the<br />\ncount at 151<br />\n/<br />\n2- 135 Pound<br />\nClass—Bolster, Haverford<br />\nleft.<br />\n5-2 at the half. The second half, 15I/2 with one match<br />\nremaining.<br />\nthrew Nicholson, Hopkins in 3 min.<br />\nShots by Lambros, Melvin, and however, told a different story. With<br />\nAt<br />\nthis stage, Pollock, Hopkins,<br />\nRoss missed by inches. One and one- Srebnik leading, the T.A.O.'s ate up<br />\n38 sec.<br />\nhalf minutes left. McLain tossed to the early Phi Psi lead and went on and Ashbrook, Haverford, met in the 145 Pound<br />\nClass--King, Hopkins deMoore, Moore to Resin, Rasin to Mc- to win, 11-8.<br />\nheavy-weight bout. After two minfeated Hague, decision.<br />\nLain; but a pass that went out-of- Tolson led the -Phi Psi's with six utes and 65 seconds, Asbrook threw 155 Pound Ciass—Clautice, Hopkins<br />\nbounds stopped Hopkins advance.<br />\npoints while Srebnik scored five for Pollock to add five more points to the<br />\nthrew Baum in 8 min. 20 sec.<br />\nRoss Ties It<br />\nTAO.<br />\nPennsylvania lads total. This enabled 165 Pound Class—Edwards<br />\nAgain, Ross shot a long one, but<br />\n, Hopkins<br />\nPhi Gain defeated D.U. by the the home team to top Hopkins.<br />\nthis time the ball settled in the cords<br />\n•<br />\nand Everts drew.<br />\nwith the score 25 all. Basin, Moore score of 2343 in the other important<br />\nIn all, Haverford matmen won four 175 Pound Class—Winslow, Haverand Cross tried desperately for a two game of the day. Led by the sharpclashes to the Blue Jays three, with<br />\nford, defeated Buc, decision.<br />\nPointer. In this attempt Cross was shooting Johnny Royster the outcome of the game was never in one draw. Vernon, King, and Clautice Heavyweight<br />\nAshbrook, Haverford<br />\nfouled.'Thirty seconds left.<br />\ncopped<br />\ntheir<br />\nbouts while Edwards<br />\nthrew Pollock in 2 min. 55 sec.<br />\nThe climax was reached. Cross, doubt as the Phi Gams grabbed an<br />\nearly<br />\nlead<br />\nand built it up as the<br />\none of Hopkins best foul shooters,<br />\ntoed the charity mark. The specta- game proceeded.<br />\n<br />\nHaverford Pins Grapplers When<br />\nHeavyweight Bout Decides Match<br />\n<br />\ntors were tense. \"Shorty\" missed the<br />\nfirst. Groans were heard over the<br />\ngym. Again, \"Shorty\" Cross toed the<br />\nmark, but this time the ball cut the<br />\ncords. With the score 26-25, Hopkins,<br />\nSeeking their second win of the<br />\nand twenty seconds left most people<br />\nwere hailing Cross as the hero of season, the Blue Jays fencing team<br />\nwill<br />\ntravel to College Park Wednesthis hectic battle.<br />\nday to combat the Maryland foilsSt. Johns Again<br />\nwas men. This will mark Hopkins only<br />\nHowever, as the<br />\ncrowd<br />\nmeet against<br />\ncheering, the Annapolis lads quickly start since their<br />\ntook the ball down the floor. In a Loyola. Although victorious in this<br />\ndesperate attempt to score. Shawn match, Maryland will be given a<br />\nslight edge over Hopkins.<br />\nshot a long which dropped through<br />\nthe cords to put St. Johns ahead 27- ' The Blue Jays will present the<br />\nsame<br />\nteam as in the past. Captain<br />\n26. A climax, an anti-climax, could<br />\nHopkins again forge to the front in Reed will enter the two foils matches,<br />\nfifteen seconds? Several long shots and from past showing is expected to<br />\nwere attempted, but as the final gun cop both.<br />\n<br />\nJAY VEE FRAY WON BY<br />\nVISITING QUINT 26-20<br />\n<br />\nIntercollegiate Schedule<br />\n<br />\nii<br />\n<br />\nAn exciting preliminary to a thrilling main event was the Jayvee basketball game which pitted the Blue<br />\nJays Junior Varsity against St.<br />\nJohns'. A close fray all the way, the<br />\nJohnnies pulled away toward the end<br />\nto come out on top by a 26-20 score.<br />\nGetting off to an even start, both<br />\npiled<br />\nup an early total<br />\n<br />\nfives<br />\n<br />\nof six points. At half time the<br />\nscore showed the visitors on top by<br />\nvirtue of one free throw with a 13-12<br />\ncount. However,,,ihe half-time rest did<br />\nthe Johnnies good, and they gained<br />\na five-point lead, as Weisheit and<br />\nHill came through with fieldgoals to<br />\nmake the score 19-14. The Johnnies<br />\ncontinued on the offense and'ran their<br />\nlead up to ten points.<br />\nHowever, the Blue Jays put on a<br />\nbelated attack and closed up the gap.<br />\nBitsack and Butt led the offense and<br />\nquickly scored three goals between<br />\nthem. However, before the Jays had<br />\ntime to get set for another onslaught,<br />\nthe final gun went off and closed the<br />\ngame at 26-20.<br />\n<br />\nantient<br />\neetv<br />\n<br />\nin a MODERN SETTING<br />\nOn sale at<br />\nLug Cabin-3107 St. Paul St.<br />\nLittle Tavern-32nd & Greenmount<br />\nHolly's-3333 Greenmount Ave.<br />\nDoc's-1817 N. Charles St.<br />\nCampus Inn-2501 N. Charles St.<br />\nGreen & Fairbanks-26th & St. Paul<br />\n<br />\nNATIONAt remium<br />\nA PALE DRY BEER<br />\nBrewed by<br />\n<br />\nTHE NATIONAL BREWING CO.<br />\nBALTIMORE, MD.<br />\n<br />\nFencing Team Faces<br />\nMaryland Wednesday<br />\n<br />\nwas heard Hopkins was trailing 27Harris, the only other undefeated<br />\nman, will enter the saber event. After<br />\n26.<br />\nhis surprise 5-1 win over Loyola's<br />\n\"Dutch\" Talks<br />\nAfter the game \"Dutch\" Lentz in star fencer, Harris is expected to add<br />\nthe locker room said, \"It was a great to Hopkins points. Phil Small, Peegame. Both teams played good ball.\" ples, and Agrin will complete the<br />\nWhen the St. Johns' coach was asked team.<br />\nabout the players, he said, \"Frankly,<br />\nthe big boys of Hopkins under the<br />\nDr. Schaffer Addresses<br />\nbaskets had me worried.\"<br />\nThe Blue Jays in defeat look good,<br />\nSpiked Shoe Meeting<br />\nand was the aggressor throughout<br />\nthe contest At the epening tip-451! --Dr. -Lawrence Schaffer spoke bethe Jays got away to a 4-0 lead. fore a 'meeting of Spiked Shoe in<br />\nThroughout the rest of the first half Levering hall last night. His subthe Johnnies were in the front, but ject was \"The Spiked Shoe on the<br />\nHopkins gained the edge at the half Campus in Stirring University In14-13. The Mallonee coached five held terest in Track\". Referring to the<br />\nthe lead during the entire second half past season, he pointed to the need<br />\nuntil the final fifteen seconds. In all for promoting track enthusiasm on<br />\nthe score was tied seven times.<br />\nthe Campus. His talk began at 8 p. m.<br />\n<br />\nCasa Limerick Contest<br />\n<br />\n•<br />\n<br />\nDo You Want Ten Bucks?<br />\ndo. But this is your baby. The Cotillion Board will give to the winner<br />\nof each contest $10. All you have to do is finish the limerick started<br />\nfor you.<br />\nBetween now and March 1, there will be a new contest each week, and<br />\nthe winner will receive $10 at the Cotillion. The winner must be present to<br />\nreceive his<br />\naward. The Judges in the contest are the members of the Cotillion Board.<br />\nOf<br />\ncourse no one connected with the board may participate.<br />\nWe<br />\n<br />\nThis Week's Limerick is:<br />\n\"The Cotillion board hunted around<br />\nTill a swing band they finally found<br />\nIt's the tops, so they say<br />\nAnd it's led by Glen Gray.\"<br />\n<br />\n•<br />\nSee You al the Cotillion'<br />\n<br />\nis<br />\n<br />\n\fHOMEWOOD, BALTIMORE, TUESDAY, FEBRUARY 15, 1938<br />\n<br />\nFRANK MORLEY SPEAKS<br />\nTOMORROW IN REMSEN<br />\n<br />\nNOTESTEIN TALKS<br />\nON 17TH CENTURY<br />\nCOUNTRY SQUIRE<br />\n<br />\n_<br />\nA special lecture will be given at<br />\nthat the Individual enters society and the Hopkins on Wednesday, Februbegins his larger preparation for ary 16, when Frank V. Morley delivers a talk on \"The Importance of<br />\ncitizenship.\"<br />\n<br />\nNicholas Assheton Described<br />\nAs A Hunting, Fishing,<br />\nShooting Squire<br />\n<br />\nHe pointed out the tendency to<br />\nIdentify education with organized<br />\nschooling. A child spends a comparatively small portion of his life in<br />\n<br />\nthe music of the Southerners, began<br />\nTeaching Mathematics\" in Room 1, at eight o'clock.<br />\nRemsen Hall at 4 o'clock. Frank<br />\nA dance in honor of the Kapa AlMorley, English publisher, with the<br />\nheld at Levering<br />\nHouse of Faber & Faber in London, pha pledges will be<br />\ndeceased Dr. Hall February 18th at 9 o'clock, Jack<br />\nschool, he declared.' His real living, is a son of the recently<br />\nemeritus of Quinn and his orchestra providing<br />\nhowever, is done at home, where in Frank Morley, professor<br />\ndepartment at the the rhythm.<br />\nMathematics<br />\nthe<br />\nhe<br />\nexperience,<br />\nactual<br />\nof<br />\nmidst<br />\nthe<br />\n1,<br />\nachieves the ideas, attitudes, and Hopkins.<br />\nThe Alpha Chi Rio 4eld its annual<br />\nMr. Morley and brothers held<br />\nhabits that make up his nature<br />\nPike Lecture at the Y. M. C. A. Last<br />\nare<br />\nHis<br />\nbrothers<br />\nscholarships.<br />\nRhodes<br />\ncharacter.,,<br />\nSaturday night, capping the evening<br />\nD. Morley, American<br />\n\"No nation,\" he declared, \"can long Christopher<br />\nauthor, and Felix M. Morley, editor of with a radio dance at their house besurvive a disintegration of the famginning at ten-thirty.<br />\nthe \"Washington Post.\"<br />\nily. Citizenship is in the last analysis<br />\n<br />\nTYPICAL CHARACTER<br />\nHAS HUMOROUS NOTE<br />\n<br />\n\"He rode placidly behind his hounds<br />\nbetween the opposing armies at the<br />\nbattle of Edgehill, as If the issue between the King and parliament were<br />\na light matter beside the pursuit of<br />\nhis Majesty, Reynard the Fox.\"<br />\nThus Dr. Wallace Notestein, Sterling professor of history at Yale,<br />\n<br />\nA radio dance was also held at the<br />\nEpsilon Tau Alpha, formerly Phi<br />\nAlpha, had a very gala evening last Alpha Tau Omega house last SaturSaturday night at the Southern day night.<br />\nHotel. The event, a dinner featuring<br />\nKappa Sigma dedicates a novelty<br />\n\"old clothes\" dance to its pledges. It<br />\nwill begin at nine at the house on<br />\nFebruary 19th. The orchestra has not<br />\nyet been selected.<br />\n<br />\nThe<br />\n<br />\nBaltimore<br />\n<br />\nChapter<br />\n<br />\nof<br />\n<br />\nthe<br />\n<br />\nJewish University Club will hold its<br />\nregular monthly meeting on Sunday,<br />\nFebruary 20th, at the Phi Sigma<br />\nDelta fraternity house. Hopkins students are invited to attend.<br />\n<br />\nthe virtues that enable an individual<br />\nto live unselfishly and cooperatively<br />\nwith his fellow man. The home is the<br />\nnursery of these virtues.\"<br />\n<br />\nProfessor Of Education At<br />\nCatholic U. Opens Series<br />\nOn Religion<br />\n<br />\nHome Keystone In Education<br />\nThe importance of the home is<br />\nfostering love, sacrifice,' and cooperation was emphaized. To discharge<br />\nits educational responsibilities, the<br />\nhome must be dominated by a conscious purpose.\" The home must provide facilities for the maximum development of the physical, mental,<br />\nand moral capacities of the individ-<br />\n<br />\ncharacterized Nicholas Assheton, a<br />\nseventeenth century English sportThe Rev. Dr. George Johnson, in<br />\ning squire, from whose diary he drew<br />\nfor material in a Schouler lecture at the first of three4talks on \"Religion's<br />\nLatrobe yesterday. His portrait of a Approach to Current Problems\" in<br />\ncountry gentleman was entitled \"A Latrobe Hall yesterslay, stressed the<br />\nHunting, Fishing, Shooting Squire importance of the fa ily in educa- ual.\"<br />\ntion.<br />\nUnder James I.\"<br />\nDr. Johnson, received his doctorate<br />\nNo Pink Coats<br />\nAttacking the issue from the point in philosohy, at the Catholic. Uniof America, where he, became<br />\nversity<br />\nIn discussing the habits of the gen- of view of the state and religion, Dr.<br />\neducation in<br />\ntry he said that most were interested Johnson, professor of education at associate professor of<br />\n1921. He has been secretary of the<br />\nin politics and religion, and that the the Catholic University, stressed the<br />\nNational Catholic Association since<br />\nfew sportsmen hunted foxes, stags, social importance of the family in 1909 and of the American Council of<br />\nand badgers, but had nochampagne teaching children.<br />\nEducation since 1934. One of the<br />\nlunches, and very thisty did not wear<br />\n\"The home,\" he said, \"is the funda- editors of \"The Catholic Education<br />\npink coats. They drank heavily, withmental educational agency. It is Review\", Dr. Johnson is the author of<br />\n-out apologies or regrets, and ate<br />\nthrough the family and family living, many articles on education.<br />\nman-sized meals.<br />\nThe lecturer described a banquet<br />\ngiven for James 1, at which meat<br />\ndishes were served. They had few<br />\nsalads because \"the plain country fellow did not eat grass, and he loved<br />\nno salads.\" A good churchman, the<br />\nsquire lived in a home hardly adequate for a modern farmer.<br />\nAssheton Alias John Bull<br />\n\"The active, hard-riding life kept<br />\nthe Nicholas Assheton's wholesome<br />\nand sane and civilized and preserved them as fairly sensible leaders<br />\nof their community. The government<br />\nthey stood behind only more continues the type they represented. For<br />\nNicholas Assheton was an earlier<br />\nname for John Bull.\"<br />\nTomorrow night, Dr. Notestein wil:<br />\nspeak on \"A Lady of the Manor in<br />\nthe Civil War\" in Latrobe hall at<br />\nfive. This talk will also be published<br />\nthis spring in the volume of sketches<br />\nportraying seventeeth century social<br />\nlife that he is preparing.<br />\nNow Sterling Professor<br />\nNow a Stetling professor of history at Yale, Dr. Notestein was active in the state department during<br />\nthe world war, serving on the American Committee to negotiate peace in<br />\nParis in 1919. He was appointed to<br />\nthe British Commission on the House<br />\nof Commons Records ih 1929, and has<br />\nbeen professor of history at three<br />\nuniversities. Dr. Notestein is the<br />\nauthor and co-author of many books<br />\non seventeenth century social and<br />\npoliticaVlife in England.<br />\nBy searching out and publishing<br />\nthe diaries of prominent commoners<br />\nof Stuart reign in England, Dr. Notestein has illuminated some of the<br />\nsecret stormy sessions of the House<br />\nof Commons of that period. This is<br />\noutstanding<br />\nhia- most<br />\nperhaps<br />\nachievement as a specialist in seventeenth century England.<br />\n<br />\ntill<br />\nade<br />\n<br />\nMaryland Casualty Bldg. : FEBRUARY 25<br />\n<br />\natte<br />\nEdv,<br />\nCas<br />\nand<br />\nceed<br />\nthe<br />\nLim<br />\n<br />\nTo<br />\n<br />\nwrite<br />\nas th<br />\nick,<br />\nMu rp<br />\nBoar<br />\ncont<br />\nbasis<br />\niginal<br />\nple o<br />\nrhyth<br />\nWCA<br />\nConsu<br />\nthe 1<br />\nTha<br />\ndorm<br />\nthe G1<br />\nFrida<br />\nlucky<br />\nthat<br />\nthe<br />\nrando<br />\nthe s<br />\ncandid<br />\n<br />\nChesterfields give you a different kind of smoking pleasure...<br />\nmildness that's more refreshing<br />\ntaste that's more satisfying<br />\naroma that's more appetizing<br />\n<br />\nDr. L<br />\nprofeso<br />\nMaryla<br />\n<br />\nMild ripe tobaccos and pure cigarette paper, these Chesterfield ingredients are the best a cigarette<br />\ncan have. Chesterfields SATISFY<br />\n<br />\nin the<br />\ntures<br />\nby the<br />\nJews a<br />\n\\<br />\nversity<br />\nning at<br />\nCatholic<br />\nof the i<br />\nUntil<br />\n<br />\n..youllfind MORE PLEASURE<br />\n<br />\naesterneldi mikkrhetter taste<br />\n<br />\n-fessor of<br />\nfUniversi<br />\ncial field<br />\nstudied<br />\nEngland.<br />\nive in St<br />\ncance o<br />\nalso vani<br />\nindustry<br />\nnomic an<br />\n<br />\n\f", "format": "basic_html", "processed": ",<br /><br />\nLOYOLA TONIGHT<br />\nAT HOMEWOOD<br /><br />\n&amp;IItth.1011pk1tts<br /><br />\nNrius-siirttet<br /><br />\nZ 275<br />\nVOL. XLII, No. 21<br /><br />\nREAD<br />\nFINKEL'S FAREWELL<br />\nEDITORIAL<br /><br />\nHOMEWOOD, BALTIMORE, TUESDAY, FEBRUARY 15, 1938<br />\nPRICE 5 CEN'T.<br /><br />\nCOMMISSION REFORMS HONOR SYSTEM<br />\nQUINTET SMARTS 'The Threat To Democracy' PHI ALPHAS SEVER<br />\nAWAITS LOYOLA MCDonald's Subject Tonight'TIE TO NATIONAL.<br />\nINVASION TONIGHT<br />\nLOCAL NAMED ETA<br />\n*Supper Club To<br />\nHear Refugee Commissioner On<br />\nFar East Situation<br /><br />\nHopkins Out To Prove Close<br />\nFirst Victory On<br />\nHome Floor<br /><br />\nNewly Formed Constitutio<br /><br />\nHonorCon*ssion<br />\nDefines Fu ctions<br />\nAt the Hopkins,<br />\nrally known<br />\nfor its lack of<br />\nthings, there<br />\nis one splendid tr<br />\nn: the Honor System. It is<br />\nthe type of<br />\nthing to evoke any of the usual<br />\n'college spirit\"<br />\niated with<br />\nfootball teams. Rat r, it appeals<br />\nto that sense of ho sty and decency inherent in<br />\nry man. It<br />\nis true that some i<br />\nviduals, because of environme<br />\nand experience, have constantly repressed<br />\ntheir innate sense de virtue until<br />\nthey have arrived at the point of<br />\nbelieving that \"The Only sin is in<br />\nbeing caught.\" It is With correcting this kind of immiture philoso—<br />\nphy that the Student Honor Commission is concerned)<br />\nThe implications of such a pun<br />\npose are obvious. The Commission is not concerned with being<br />\npolice or spies. W do not hold<br />\n•<br />\n(Continued on age 2)<br /><br />\nWARNINGS SENT<br />\nBY SLIP METHOD<br />\nUNDER NEW PLAN<br /><br />\nn<br />\nChange Is First Step In Rem...Tames G. McDonald, authority on<br />\nCalls The Fraternity<br />\nforeign affairs and internationally<br />\nedying Faults Of<br />\nknown for his work as League of NaEpsilon Tau Alpha<br />\nSystem<br />\nticins High Commissioner for German<br />\nRefugees, will speak tonight at the<br />\nKELLEY KEYSTONE<br />\nDISCARD<br />\nS<br />\nPeN<br />\n,<br />\nI4S<br />\nAS-University- .2::\"Aser<br />\nVIOLATION WARNING<br />\n-topic<br />\nIN LOYOLA ATTACK<br />\nwill be \"The Threat to Democracy\".<br />\nNOW OUT-MODED<br />\nTO BE ANONYMOUS<br />\nAfter a private dinner of the memVictory Chances For Mallobers of the Supper Club, the lecture<br />\nAlumni Support Secession;<br />\nSlips Available To All Stuwill be given at the University Bapnee Men Lie In<br />\nForm ETA Associations<br />\ntist Church at 8:15 p. m. Admission<br />\ndents At The<br />\nTeam Play<br />\nis thirty five cents.<br />\nIn Principal Cities<br />\nPostoffice<br />\nMr. McDonald's address, it is beStill winching at the thought of<br />\nlieved, will stress the dangers of the<br />\nAt a special meeting of the Phi<br />\nThe Student Honor Commission of<br />\ntheir last-minute, single-point defeat<br />\nrising tide of totalitarianism, and Alpha Fraternity,<br />\nheld last Wednesthe College of Arts and Science and<br />\nat the hands of St. Johns, the Blue<br />\nmethods of combating it. According<br />\nday at the Hopkins Chapter house,<br />\nthe Business School made public toto William Hammaker, Y. M. C. A.<br />\nJay ba.sketeers will be out for blood<br />\na resolution was introduced and unsecretary, Mr. McDonald Is well<br />\nday the plan which it has evolved<br />\ntonight when they meet Loyola Colanimously<br />\npassed<br />\nwhereby<br />\nqualified<br />\nthe<br />\nby<br />\nhis<br />\nextensive<br />\nlocal<br />\nwork in the<br />\nas its first step in the remedying of<br />\nlege's Greyhounds. This, the second<br />\nfield of international relations. At chapter should resign from the Nathe difficulties which at present atfray. with Loyola, will pit the two<br />\npresent, he is a member of the editor- tional Phi Alpha Fraternity.<br />\nJames G. McDonald<br />\nA new<br />\ntach to a smooth functioning of the<br />\nfives against each other at Homeial staff of the \"New York Times\".<br />\nconstitution was immediately set up,<br />\nHonor System at the Hopkins.<br />\nwood where the Jays will have the<br />\nHeld League Post<br />\nand the name chosen for the new orslight advantage of being at home.<br />\nScheduled to go into effect this<br />\nAs ccatorganizer of the Foreign<br />\nganization was Epsilon Tau Alpha.<br />\nPolicy Association in 1919 and chairweek, the plan enables any student<br />\nFrom all appearances at present<br />\nA quotation from the statement by<br />\nman of that organization for 14<br />\nthis advantage will be needed. After<br />\non the campus to warn any other<br />\nyears, he strove to widen popular in- the members of the newly organized<br />\na bruising battle about a month ago,<br />\nstudent whom he sees committing a<br />\nterest in foreign affairs. Mr. Mac- fraternity to the Editor of the<br />\nAspirants<br />\nTo<br />\nt<br />\nVacated<br />\nNEwSthe Hopkins quintet returned from Destination<br />\nviolation, while remaining anonyIndefinite For Donald is best known for his work as LerrEa contains the item of resignaBy Hutch<br />\nFile<br />\nEvergreen on the long end of a 31-30<br />\nmous. It is hoped that the fact that<br />\nHopkins Grad; Professor High Commissioner for German Re- tion: \"We, former members of the<br />\nTomo<br />\nscore. The one point margin was<br />\nfugees. He directed the work of this<br />\nthe warner may remain in anonymity<br />\nEmeritus In Archaelogy<br />\nagency of the League of Nations Eta Chapter of the Phi Alpha Fragained in the final play of the game<br />\nwill encourage all students who have<br />\nPrimaries<br />\nfor<br />\nelec<br />\nof<br />\nthe<br />\nfrom<br />\nsophoOctober<br />\n1933 until the close of ternity, do herby, under our own will<br />\nWilliam Gates,'authority on Mayan<br />\nwhen Carl Basin's eagle-eye was<br />\nheretofore hesitated to warn people<br />\nmore representative<br />\nthe Student<br />\n1935. During this time about three- and volition,<br />\nseverally and jointly, Council to<br />\nsharp enough to drop one through the literature and research associate<br />\nfill the v<br />\ncaused by because of having their names<br />\nemeritus in Mayan archeology and fourths of the 80,000 refugees from sever<br />\nall our relationships with the the resignation of<br />\nhoop. Tonight's fray should be a repeHutchcraft known, to now consider this last obliterature at the Hopkins, will leave Germany were placed in new homes,<br />\nPhi Alpha Fraternity; and from this will be held next<br />\ntition of the last meeting of the two<br />\nay. Final stacle to their complete abidance by<br />\nthe faculty in the Spring. He will and a fund of ten million dollars for<br />\nFriday after the Honor<br />\nsquads. With possible grudges the re- take his Mayan library, the most the relief and rehabilitation of these date shall be known as the Epsilon elections will follow'<br />\nSystem removed.<br />\nthe<br />\ndetermination 0<br />\ne results of<br />\nTau Fraternity.\"<br />\nsults of the rough-and-tumble play valuable in the world, with him when refugees was raised.<br />\nMehling Explains Plan<br />\nthe primary.<br />\nMr. McDonald holds the positioraNational Ji:nsternities Obsolete<br />\nIn the first game, the breaks will be leaves. Dr. Gates stated as a reaThe—election forlhdfreplacement of . The new plan, as explained by J.<br />\nReasons for this sudden action cenhold the victory ,cards and the win- son for leaving that he did not have of vice-president of the National<br />\nenough room for his collection at the Council for the Prevention of War, tered mainly about the belief that Hutchcraft, who resigned last Thurs- Judge Mehling, '38, is:<br />\nner will once again be forced to bow<br />\nday because of a heavy schedule,<br />\nThe Commission has drawn up a<br />\nHopkins.<br />\nmember of the Commission on In- national fraternity<br />\nsystems have be- brings<br />\ndown before Lady Luck.<br />\nmany prominent Student form of note, which has blank<br />\nDr. Gates has no definite plans for ternational Justice and Good Will,<br />\nspace<br />\ncome out-moded and purposeless. Council Issues<br />\nto the fore. The for<br />\nputting the library in any institution, honorary chairman of the Foreign<br />\nFirst Victory Close<br />\nthe filling In of the name of the<br />\n\"The<br />\nbonding<br />\nYoung<br />\ntogether<br />\nCommunist<br />\nof<br />\nincongruLeague<br />\nassembly<br />\nAgain hoping to put their greater but he will keep it somewhere in the Policy Association, and trustee of<br />\nous groups of men into a false fra- issue probably holds the spotlight, person seen or suspected of committhe Twentieth Century Fund.<br />\nheight to advantage, the Jays Will nottheastern United States.<br />\nternalism by a national organization closely seconded by the consideration ting- the violation, and the class in<br />\nBowman<br />\nTo<br />\nIntroduce<br />\nHopkins Grad<br />\nuse the same attack that netted them<br />\nis both hypocritical and meaningless; of the whole. assembly question. On which it took place. The particular<br />\nAfter graduating from the HopHe will be introduced at the lecture<br />\ntheir first past victory. Set shots<br />\nthe actions of numerous Eastern Uni- this election hinges the ultimate de- person is warned<br />\nthat he has been<br />\nkins in 1886, Dr. Gates studied law by President Isaiah Bowman. At the<br />\nversities have proved the national cisions.<br />\nwith quick-follow-ups by the six foot at the University<br />\nobserved cheating, and he is cautionof Maryland, and Y. M. C. A. Supper Club's dinner<br />\nFollowing are the election requireplus men of the Jay five are hoped to then entered into business in Cleve- which precedes the lecture, he will fraternity system to be both . obed not to repeat the offense.<br />\nsolete and antiquated.\"<br />\nments. Ten signatures must appear<br />\nmount the digits in the Jay scoring land. He began the collection of May- give a short talk on the far-eastern<br />\nThese slips, left with Mr. Myers in<br />\nThe new constitution called for a on the petition for nomination before<br />\ncolumn. Past experience has shown an literature twenty-five years ago; crisis. At the supper he will be in, candidate will be accepted. The the post-office and available there to<br />\nit is now valued, at about $150,000. troduced by Dr. Elizabeth, Stewart, purge upon all the mystic and secret any'<br />\nthat the attack of the Hopkins five<br />\nThe Mayan Society, of which Dr. Hopkins' fellow and world's first traditions that have been contained signers must all be certified members all, need 'not' be signed by their re.<br />\ncannot function well unless the Jays' Gates is<br />\npresident, is probably the Doctor of Philosophy in the Mayan in the rituals of various national of the sophomore class. All nomina- spective senders.<br />\nfraternities. The members of Epsilon tions mint be placed in Box 1248 by<br />\nscoring eyes are in good shape. How- the only literary society in the United languages.<br />\nThe slip, filled out,, is then returnTau Alpha stated that they wished Wednesday afternoon at four, adever, the height of the Blue men States that has its own press. DurStudent chairman for the evening<br />\ned to Mr. Myers, who distributes<br />\n\"to<br />\nstreamline<br />\ntheir<br />\ngroup\",<br />\ndressed<br />\nand<br />\nto<br />\nto<br />\nWilliam<br />\nB.<br />\nKempton, Preshelps• to offset any such deficiency ing the past seven years twenty at the lecture will be. Charles D.<br />\nform a group of men \"who, living to- ident of the Student Council, in order them to their respective destinations.<br />\nand is a great .factor in the whole books have been published on the Flagle. At the supper Henry Blucher<br />\ngether for four years, will enrich to be valid. At least four candidates The Commission keeps track of all<br />\npress; the first volume published was will preside.<br />\nteam's play. The mainstay of the<br />\nthemselves academically, socially, are 'expected.<br />\nslips, merely to stop any practical<br />\na Mayan dictionary written by Dr.<br />\nHopkins attack, which was seen to<br />\nand cultUrally\".<br />\nThe ballot box in the post office will jokers, and to note whom the regular,<br />\nGates.<br />\nThe fraternity has received full be open all day Thursday for pri- repeating-offenders are.<br />\nbe both present and absent in the<br />\nBesides the number of Mayan<br />\nsupport from the Hopkins Alumni of mary votes, and again all day Friday<br />\nSlips Remove Former Difficultiee<br />\nSt. Johns encounter, is teamwork. If volumes and imprints which the<br />\ntheir fraternity. Plans have been set for the final. At least 50 percent of<br />\nAccording to Mehling, \"The slips<br />\nthe Blue Jays can once regain the library contains. Dr. Gates has colin motion for the formation of the class must vote before the elec- will remove one of the foremost hindteamwork they had against Loyola lected photographs or photostatic<br />\nAlumni Clubs in various cities of the tion can be confirmed, although well rances to the proper functioning of<br />\nDr.<br />\nGeorge<br />\nBoas,<br />\nChairman<br />\nof<br />\nthe<br />\npreviously, victory will be much clos- copies of almost all of the existing<br />\nPhilosophy Department at the Hop- United States. These clubs will have over that number are predicted. The the Honor System. Under the Syser, for in the first meeting, it was Mayan literature.<br />\ntheir center of action focused upon newlynsibatethofficer will be riss5)o tem, 411111C-1<br />\n•<br />\nkins will be the leadei• at the first<br />\nHop4ins teamplay against Loyola inthe Epsilon Tau Alpha Fraternity by the Student Council on the follow- the Honor System should report him.<br />\nDiscussionGroup, sponsored by the at Hopkins. Last Saturday the first<br />\ndividuality that decided the verdict.<br />\nUp till now, men have felt qualms<br />\ning Friday. '<br />\nY. M. C. A. to be held tomorrow Freshman class was initiated into<br />\nKelley.Loyola Threat<br />\nKeep up with the primary and elec- about reporting offenders, for fear of<br />\nafternoon at 4 in the Sherwood Room the new fraternity.<br />\nFor Hopkins it will be Norm Meleither facing the man they have retion results in the NEWS-LETTER.<br />\nCould you find a straw in a hay<br />\n__<br />\n=<br />\nvin and Dimmy Traggis in there at<br />\nported, or because they have not<br />\nof Levening Pall. The subject to be<br />\nthe forward positions, cutting in un- stack of needles? We can, we will discussed<br />\nwished to have the offender severely<br />\nwill be \"The Case for The<br />\nder the basket. Moore will squai. even attempt to sell red uniforms to<br />\npunished.<br />\nNow IIQWAyer, any man<br />\nconomic Results of Armament<br />\noff once more at the pivot Post. Cap- Mrs. Mb&amp; Mai Hollbwity and her<br />\nmay warn another man that he has'<br />\nThis meeting will be the first in a<br />\ntain Carl- Basin and Joe -MacLain sister Daughters of the American<br />\nviolated the system, having neither<br />\nwill carry the ball down the field in Revolution if you put it in the new series of weekly meetings, in which<br />\nof these fears.<br />\nclassified ad section of the NEWSthe guard slots.<br />\n\"The plan has been approved by<br />\nthe students are to be given oppor4<br />\nLoyola's fast-passing, fast-cutting LETTER.<br />\ntunity to meet with various teachers Armaments Compared To Public Works As Business Stiff]. the Student Council, and both the<br />\nWhat<br />\nchance<br />\nhave<br />\nwould<br />\nit<br />\nthe<br />\non<br />\nattack will again feature Kelley,<br />\nI Council and Commission now believe<br />\nand discas different points concernulant; Economist Says \"Bridges Before Battlewhose individual play can be well re- bulletin board?<br />\nthat all men on the campus will feel<br />\nWe will make your business our ing the University and other more<br />\nmembered, at the center post. Bareships\" For Recovery<br />\n. themselves personally responsible for<br />\npersonal<br />\nconcern.<br />\nTrack<br />\ndown<br />\nthe<br />\ngeneral topics. The meetings are<br />\nzak and Stakem will await the tapthe healthy maintenance of the<br />\n\"I am not qualified to pass an opin- way of stimulating recovery, all I; Honor System.\"<br />\noff at the forward positions while thel things you've lost, find that hidden open to any student of the University.<br />\nbuyer, or turn up the man who has<br />\nIon as to the desirability of armament can say is that it is no more effective!<br />\nguards will be Captain Wayson and<br />\nWork Of The Commission<br />\nsomething to sell through the classiexpansion from the point of view of than other forms of public works! Mehling went on to disclose that<br />\nBremer.<br />\nfied column. This new feature will<br />\nnational defense, inasmuch as that and further that the latter may be the Commission has dealt with severappear for the first time next issue<br />\nIs a military question. The effects more desirable, as they may add al<br />\nsince the last examination<br />\nin the space demonstrated on the last<br />\nwhether good or bad will doubtless something to the real wealth of the I period. He said, \"In every case we<br />\npage.<br />\nBeer—a keg of beer to the winner, have to be subordinate requirements nation—bridges before battleships.<br />\nhave had a frank, man-to-man disAs a special consideration, articles the Cotillion Board announced today. of adequate national defense.\"<br />\nThe third point of the economist's cussion with the student. Never have<br />\nThe first fresman class meeting<br />\nThis is the first point Dr. William argument .was that public expend- we -acted as a 'police force', but have<br />\nr,f the year will be called to order found will be advertised free in an A Candidate for Cotillion Board will<br />\nowners.<br />\neffort<br />\nOther<br />\nto<br />\ntheir<br />\nlocate<br />\nWeyfoith,<br />\n0.<br />\nassociate<br />\nprofessor<br />\ntines<br />\nof<br />\nfor either arrnanents or pub-'found that every student who has<br />\nby President John Milligan at<br />\nrates will be a penny a word with be chosen for each dorm entry to political economy tried to make lic works \"do have a certain stimula- had a discussion with us, has left<br />\n11:30 Thursday morning<br />\nLeversell,<br />\nCotillion<br />\ntickets<br />\nto<br />\n.hear<br />\nGlen<br />\nclear to a reporter seeking an econo- tive effect on business--a shot in thanking us. We are satifled that we<br />\ning hall, it was announced today. fifteen cent minimum. Ads with the<br />\nAttendance is urged for the con- exact wording will be received with Gray. Next .Februruy 28 at noon, the mic interpretation of the latest New. the arm. There is no reason to be- are succeeding in our purpose, rethrough<br />\nenclosed<br />\nthe<br />\nthe<br />\ncharge<br />\nDeal<br />\ndevice to 'prime the pump', the lieve: however, that they can provide awakening interest in the Honor<br />\ndorm having bought the most will be<br />\nsideration of pressing business<br />\nNews-LETTER Box 1230 or the NEWSSystem.\"<br />\nFirst on the docket is discussion<br />\nthe beneficiary (we hope) of enough $800,000,000 armanent proposal, a cure for the depression.<br />\n\"After seven years of the most exThe Student Council has appointed<br />\nof plans for the annual Freshman- LETTER office. They must be received beer to tide them well over the Cotil- which President Roosevelt recently<br />\nfour<br />\ndays<br />\nbe<br />\nto<br />\nthey<br />\nare<br />\ndisbefore<br />\nplaced before Congress.<br />\ntravagent public spending, the pres- ,Robert Fleagle and Carrington WitSophomore prom to be held this<br />\nlion festivities....<br />\nplayed.<br />\n\"As<br />\nassertion<br />\nthe<br />\noften<br />\nto<br />\nmade<br />\nrecession<br />\nent<br />\nis<br />\nindicative<br />\nis<br />\nof the in- hams' to fill the two vacancies in the<br />\nspring.<br />\n12,4SEE PAGE FOUR<br />\nJ. judge Mehling that armanent expansion is a good adequacy of that method as a cure\".!sophomore representation.<br /><br />\nPICK COUNOILMAN<br />\nFOR SOPHS PURSDAY<br /><br />\nGATES TO RESIGN<br />\nMOVE MAYA LIBRARY<br /><br />\nDISCUSSION CROUP OPENS<br />\nTOMORROW WITH OR, BOAS<br /><br />\nClassified Service<br />\nBecomes New Feature<br /><br />\nE<br />\nExamined in Weyforth s Interview,<br /><br />\nKeg Of Beer Prize<br />\nOffered By Mehling<br /><br />\nFreshmen Meeting<br /><br />\n,<br /><br />\nHOMEWOOD, BALTIMORE, TUESDAY, FEBRUARY 15, 1938<br />\n_s<br /><br />\nXbe jobncs jOopkin5<br /><br />\npresent opinions and conclusions from \"lively, eager,<br />\ninquiring\" minds, based upon all the facts and phases<br />\nobtainable of the situation or problem. We will not<br />\nbe dictated to or dominated by any small group or<br />\nindividual interest . . . Our decisions will be aimed at<br />\nintelligently and logically. When we take a stand it<br />\nshall be firm and determined; but we will not fear to<br />\nthe discovery of new facts<br />\nalter or modify our views<br />\n'or viewpoints forces such a change.\"<br /><br />\n(\"The strike . is a malifestation<br />\nof the broadest sentiment against<br />\nwar\") and later THURSDAY'S STUDENT STRIKE, A LITTLE HISTORY, THE STRIKE AND THE<br />\nFUTURE, THE STRIKE: AN APPRAISAL, (\"We think having a<br />\nnegro clergyman, Goucher student,<br />\nR.O.T.C., faculty, and student representatives on the program presented<br />\nan opportunity for us students<br />\nwhich can unite divergent views<br />\naround this, common danger\"), and<br />\nON THE DARK SIDE.<br />\nOR the new athletic plan, continued opinion and support were<br />\ngiven:<br /><br />\nLETTERS TO THE EDITOR<br /><br />\nthe position of legal acivispr is<br />\nTo The Editor of the Neves-LETTER: that<br />\nan earned one. Of course Miilton's<br />\nDear Sir:<br />\nappointment to this position was<br />\nDashing out of Shakespeare with<br />\ngreatly dependent on the fact that<br />\na flash to make Milton with a smash,<br />\nthe choice of the New Jersey<br />\nand4011 over a he was<br />\ntoe<br />\nmy<br />\nstubbed<br />\nI<br />\nFounded 1897<br />\nDemocrats, the party he thought best<br />\nI<br />\nBefore<br />\nreporter.<br />\nPLACE OF THE HOPKINS EDITOR<br />\nNEWS-LETTER<br />\n. 11E00<br />\nSubscription per yearto campaign for in political battles.<br />\nSO<br />\ncould say \"I beg YOUR pardon,\" 14<br />\nBy Mail<br />\nE recognize the opportunities of our position—<br />\nis our Editorial writer so naive<br />\nBut<br />\none<br />\nis<br />\nwhat<br />\nsaid, \"Pardon me, but<br />\nof realized friends, of acquiring knowledge, of<br />\nRemit subscription feee to Treasurer, Student Activities Council,<br />\nas to expect the Democratic governRemsen Hall, Postoffice, _Nina Hopkins University.<br />\nwidening our character. We also know the temptations<br />\ngood reason why the Barnstormers<br />\nor to appoint a Republican to such<br />\nEntered as second class WEE, December 3, 1909, at the poitoffice to do the diametric opposite—of kissing everyone, of<br />\nwon't give another show if they don't<br />\nin BlItilitOre Md., under the Act of Congress, November 3, 187f<br />\ntalking about the weather, of yielding to the pressure<br />\nan office? (If he or anybody else is,<br />\none?\"<br />\ngive<br />\nPublished semi-meekly from October to June, except during examine. of certain groups, of selfishly working for personal<br />\nI suggest they dismiss a few points<br />\na<br />\nhave<br />\ndon't<br />\nHopkins<br />\nBarnstormers<br />\nthe<br />\nof<br />\nJohns<br />\nundergraduates<br />\nperiodiuby<br />\n4<br />\nWE LEAD (\"We have re\"If the<br />\nbon and college holiday<br />\ngain.\"<br />\nin political science and politics with<br />\nUniversity.<br />\nmoved the last vestige of com- second show, and who says they are<br />\nour Mr. Leon Sachs).<br />\n/ HAVE tried during my administration to live up to mercialized athletics. We have definMEMBER<br />\nbe<br />\nwill<br />\nmoney<br />\nnot going to have one,<br />\n9IITIN<br />\nR AS10C<br />\n1:<br />\nIN1120:LICIATZWSPAr<br />\nthe ideals and goals I set up as I took office.<br />\nIt is plain to me that the NEWSitely asserted our sincerity in mainthe reason\" I said.<br />\nEDITORIAL STAFP<br />\ntaining a reasonable emphasis on<br />\nLETTER has accepted the opinions of<br />\na<br />\ngot<br />\nEditor-in-Chief WOKING out some of the highlights:<br />\n\"I've<br />\nyelled,<br />\nhe<br />\nJ. Murray Kempton<br />\non,\"<br />\n\"You're<br />\nto<br />\nwide<br />\nparticiview<br />\nwith<br />\na<br />\nsports<br />\nCo-Editor<br />\nthe Philadelphia Record as unerring.<br />\nWethered ilsr,11, Jr<br />\nEXPLANATION NEEDED (about the disrespect pation among students . . . \") and<br />\nFeature Editor<br />\n...<br />\nSeymour Sacks .<br />\nstory!\"<br />\nIt would have been better for the<br />\nI C. Handelsman, litiyr M. VietorZ..... A.1tina.t Managing Editor: of both students and University officials for the OUR ATHLETIC POLICY, A NEW<br />\n.<br />\nEditor<br />\nSport,<br />\nZheutlin<br />\neyed<br />\nHarold<br />\nFriday, January 21, I casually<br />\nclearNews-LETTER to wait for the Records<br />\n_Acting Sports Editors Honor system) . . . ABOUT THE DORMS f<br />\nArnold Glantz, Nathaniel FinkelsteinANGLE, ALL FTPOH INS A<br />\nAssistant Sports Editors ing up and appraisal of this incident) . . . WHEN<br />\nCharks Diggs. Milton Alperstein<br />\npage of my NEWS-LETTER, charges to be answered, for the NEWSGUEST EDITORIAL, WATCH OUR the front<br />\nBrehoript Editor<br />\nMal Boahriack,<br />\napNews-LETTER<br />\nof<br />\ncame<br />\nDO WE APPEAR (Irregularity<br />\nREPORTRIS<br />\nAMATEURS PLAY, ALL THE and finally looked down until I<br />\nLETTER has no special reporters covMel Taymor, '40; Morris Wessel,.39; Leonard Quitt, '40;<br />\npearance due to financial causes) . . . DOUBLE BEN- WORLD, CHANGE OF A PPITUDE<br />\n-the feature article on the 'Storm- ering such political assignments and<br />\nDaniel Stone, '39; Zeana Baum; '38; Carl Resin, '38;<br />\nEFIT and HELP ADS TO HELP US (pleas for correc- besides the successful TOMORROW'S<br />\nLester Rosenthal, '38; Leonard IV:Olinger, '38; Thomas<br />\nars. \"Interesting,\" -1 - said to myself, no first hand information. This being<br />\nMcElhiney, 41'; Seymour Rtildn, '40; Kennth Maxey, Jr.,<br />\ntion) . . . CRUCIAL ELECTION (most important POLL.<br />\ntmo,<br />\nMillvirg, '39; Herbert Xleinfeld, '41; John<br />\nnot,<br />\n\"Very interesting indeed.\" The little the case, the News-LETTER can<br />\nHigham, '41; Sheldon Fuchs, '38.<br />\noffice presidency of student council) . . . CONCERNand should not write of the political<br />\nBUSINESS STAFF<br />\nING THE ELECTION (\"For an enlightened, conscien- PERHAPS one of the most persist- note about filling the house through<br />\nJersey<br />\nNew<br />\nof<br />\nState<br />\nthe<br />\nin<br />\nsituations<br />\n. Busing. Mower tious, and thinking Student Council President, we urge<br />\nMelville Locker<br />\nent and worthwhile campaigns of • mck\" was particularly interesting.<br />\nor of any other State, unless such<br />\nt 938<br />\nMEMBER<br />\n1 937<br />\nthe election of William B. Kempton\") . . and CON- the past NEwseLETTER year was:<br />\nWorking two months of days and articles are backed by substantial<br />\nASSocIATIO COLLEGIATE Feiss;'Distribtours, COLLEGIATE MOUT<br />\nGRATULATIONS, BILL.<br />\nTHE PHI BETE CASE (. . , Phi nights with almost fifty men and to primary evidence. Lack of such primRepresented for National AdvertNing.by<br />\nBeta Kappa has a weighty and<br />\nwas filled merely by ary, evidence can be dismissed if the<br />\nNATIONAL ADVERTISINO SERVICE, Inc.<br />\nE did not hesitate to critize, nor were we reluctant vital influence on serious student un- say the house<br />\nto matters<br />\n420 'Madison A vrtme, New York City, NeW York<br />\nluck was high praise for a man to editorial is in reference<br />\nto praise:<br />\nwho<br />\nto<br />\nlook<br />\nforward<br />\ndeigradautes<br />\nalready fully discussed and closed;<br />\nTUESDAY, FEBRUARY 15, 1938<br />\nmembership . . . Students, like us, give his organization. Consequently but in this case the NEWS-LETThR<br />\nYEAR OF ODK AND THEORY AND PRACTICE are unable to understand the rejec- this is the first point I want to make<br />\nfinds itself taking sides in a live<br />\nThe editorial column this week is given to a former<br />\n(\"for the most part, we cannot help but feel tion when we consider the qualifica- clear. Full houses are not built by<br />\ndiscussion and immediately forming<br />\neditor for his farewell editorial.<br />\nthat O.D.K. did not live up to the standards it has set tions necessary and the qualifications<br />\nluck. Moreover it was hard work of \"editorial\" opinions, though having<br />\nMISS IT!<br />\nHarvard University up.\") . . . WHITHER Pi D.E.? . . . DON'T<br />\npossessed by this undergraduate .. .<br />\nthe Barnstormers alone and all those only a small part of the significant<br />\nTURN (bouFebruary 10, 1938 and THE PLAYSHOP TAKES A NEW<br />\nlet us say that this case demands rethat filled the facts as a basis.<br />\nquets for Hopkins' Little Theater) . . . PRAISE FOR consideration . .. action can be taken working with the club<br />\nDear Murray:<br />\nhouse. I would greatly appreciate<br />\nanarI hope it is clear to you, Mr. EdiAllow me ex-otticially to THE MUSICIANS . . . WE ARE AGIN' IT (the<br />\nexIf the chapter meets again and<br />\nyour making a correction of this tor, that this letter is not an opinion<br />\nJOB WELL<br />\ncongratulate you and wish chistic method of releasing marks) . . . A<br />\namines carefully all possibilities)<br />\nI<br />\nmust<br />\nnext<br />\nin<br />\neditorial.<br />\nyour<br />\npoint<br />\nTheVare,M,<br />\nand<br />\nthe substance of your editorial,<br />\nof<br />\nJr.,<br />\nNE (\"To Harold A. Ricards,<br />\nyou high success in your<br />\na-aa EVERYONE SHOULD ATrefute' having said anything about nor does it take one side .against the<br />\nthe<br />\nSchad,'the editors. of the'T' Handbook, must<br />\nnew position.<br />\n. the protest meeting<br />\nTEND (\".<br />\nluck entering into our success.<br />\nother. I do nOt express myself as<br />\nYou should feel deeply thanks of every Hopkins student\").<br />\nThere is no doubt<br />\nthis afternoon .<br />\nAnother very interesting statement eithei. pro- or anti-Hague; but I<br />\nhonored and realize in propthat in order to get something done<br />\nfrom<br />\nSense<br />\nany<br />\nin<br />\nworld<br />\nstrongly condemn the type of edithe<br />\nO barrier separates<br />\ner measure the responsibilities and potentialities of<br />\nwe have to crystallize our senti- in the same article was that of Swyer<br />\naffecting us students. The NEWS-LETTER has re- ment), LEST WE FORGET, LET complaining about the support of torial presented and the method and<br />\nyour office. Particularly on this campus, where there<br />\nprocedure in presenting it. •<br />\ncriticism) for its<br />\nis not a trace of censorship, is the post of editor a ceived high praise (as well as bitter<br />\nJUSTICE BE DONE (\". . . special the student body. Why he should is<br />\na provincial think- meeting of Phi Beta\"), A FULL beyond me. The students gave more<br />\nYours truly,<br />\nsignificant and powerful one. The degree to which you stands on subjects which go beyond<br />\nCLEARING NEEDED (\"This eve- support to Boy Meets Girl than any<br />\nand the manner in which you use the available op‘ior- er's mind. For example:<br />\nA.H.<br />\nfour<br />\nthe<br />\nin<br />\nlast<br />\nning the Hopkins chapter of Phi Bete play given at Hopkins<br />\ntunities and privileges will be a yardstick of your<br />\nLIP-SERVANT TO LIBERALISM?. .. Kappa meets . . .\") and then finally years. Twelve hundred of the some<br />\nLIPPMA.NN,<br />\nachievements.<br />\n. ENGLISH<br />\nFASCISTS TO THE RESCUE .<br />\nthe NEWS head—\"SHILS ELECTED fourteen hundred seats were conou will find your new job fertile with chances to OVER EUROPE ... ARMAMENTS LEAN TO WAR . . . to Phi Bete, ELECTION AMEND- sumed by the students alone. Even<br />\naccomplish great benefit for the campus and for IMPORTANT MEDICAL PROBLEM • . . SIGNS OF MENT OAFtRIED.\"<br />\nthe dance after the play showed the<br />\nyourself; you should understand the possibility of the DEMOCRACY (\"We can see that the students and<br />\nany Barnstormer<br />\nthe rejected greatest support of<br />\non<br />\nrecently,<br />\nmost<br />\nND<br />\nWhereas we believe that true frat<br />\nupon<br />\nopposite's being true also. Unless this is impressed<br />\ndance. Thus, I must rebate this statepeople of the constitutional republic of Spain are Rillapplication of the<br />\nassembly<br />\nernalisin lies only within the scope<br />\nduties<br />\nyour<br />\nof<br />\nview<br />\nof<br />\nclear<br />\na<br />\nprinciples<br />\nhave<br />\nyou<br />\nyou, unless<br />\nment too. In fact I wish to thank the<br />\ncere in maintaining and spreading the<br />\nmy<br />\nwas<br />\nYoung Communist League<br />\nof a personal and not an abstract<br />\nand opportunities, your new outlook will not receive democracy) . . . STAMP OUT SYPHILIS and START<br />\nmembers of the student body for<br />\nlast regular editorial:<br />\nrelationship; that the benefits of<br />\nthe required adjustment.<br />\nhaving given the best support I have<br />\nON DRIVE . . . TOO MANY DOCTORS?<br />\n\"WE think the relevant point is the ever seen given to any Hopkins or- fraternalism can be fully enjoyed<br />\nrealize<br />\nmust<br />\nERHA.PS, most important of all, you<br />\ntradition long associated with ganization. The publicity of the without the superfluities of a nationUT the campus was not neglected thereby; every<br />\nthat the responsibility for every single item, every<br />\nthe Hoplehis of rememberance for NEWS-LETTER was admirable; the al organization; that the bonding<br />\naspect received stielly and comment as:<br />\nNEWSthe<br />\nto<br />\nregard<br />\nin<br />\ndecision<br />\nevery<br />\nmove,<br />\nindividual<br />\ntruth, respect for liberty, and above Blue Jay proved itself a worthy cam- together of incongruous groups of<br />\nLETTER goes ultimately (and very quickly) to you. This LOVEJOY'S RETIREMENT . . LACK OF PARK- all, a faith in the free exchange of<br />\ninto a false fraternalism by this<br />\npus magazine; the students were en- men<br />\nnaturally necessitates polished sense of judgment, fact,<br />\nnational organization is both hypo- '<br />\nING SPACE . . MEET YOUR GIRL, ANOTHER ideas and opinions.<br />\nthusiastic—all,this not like the picwill<br />\nyou<br />\nfirst<br />\nAt<br />\npatience, and organization ability.<br />\nPLAY, COME ON 'STORMEFtS . . . LET'S MAKE'IT \"THE matter of an assembly for tures painted in the articles in the critical and meaningless; that the acpersonally have a great deal of work to do. You have PERMANENT (\"need for this sex lecture instructions of numerous Eastern Univerthe Y.C.L. is but a particular NEWS-LETTER.<br />\nno idea of the diamond-shaped angles which your new tion\") . . . A STIMULATING SPEAKER (\"Hays'<br />\nsities have proved the national fratto the generality of academic freeThe only circumstance that I ern ernity system to be obsolete and antiposition splits into.<br />\ntalks . . . full of color, fire, wit—and information\") dom.\"<br />\nsee the organization failed in .was quatestr<br />\nSYSTEM (\"We will have to investigate<br />\nN the campus you will find that you are the News- . . . HONOR<br />\nTHE highest compliment that has the - -publicity in outside papers. I<br />\nthe reasons behind the present defeats and<br />\ncarefully<br />\nconcomplaint<br />\nof<br />\nAnd whereas it is our earnest wish<br />\nkind<br />\nEvery<br />\nLEITER personified.<br />\nbeen paid to me was on the last agree with the editor in the editorcorrect these; or weshould be courageous 'enough to<br />\nmem- ial Tuesday that you have to, fight and desire to inculcate in our memceivable (and even some that are inconceivable) will<br />\nof the Honor day of my _editorship when a<br />\nfailure<br />\ncomplete<br />\nor<br />\npartial<br />\nthe<br />\nadmit<br />\nreach your ear. Each activity leader, each department<br />\nber of the administration called me with 'every columnist to get any- bers the principles of true manhood;<br />\nSystem Eit the Hopkins\") . .<br />\nhead will think that, his particular' interest in puba \"bum editor\" after expressing dis- thing printed. I know, but does he? top romote the moral welfare of all<br />\nBe<br />\nabout.<br />\nworry<br />\nto<br />\nhave<br />\nour members;, to stimulate and enyou<br />\nlicity is the only thing<br />\nI THINK that the NEWS-LETTER has been of some help agreernent over a fundamental edi- The publicity of the Barnstormer's<br />\nindicates was entrusted to the careful hands of courage scholarship; to encourage<br />\nsure that you have him continue to think that.<br />\nin adjusting freshmen (the chronological as well as torial policy. This incident<br />\nto me that I was not a following \"Ye Editor\" himself. (Stan Finkel). loyalty to and active interest in The<br />\nET a generous share of appreciated praise is yours intellectual kind) as:<br />\nJohns Hopkins niversity; to foster<br />\neditor, but sought to be thinkingly<br />\nthe<br />\nEnough said about the past articles a<br />\nat times. Be able to separate the pearls from<br />\nfind<br />\nyou<br />\n(\"When<br />\n.<br />\ndemocratic and friendly spiirt beFRESHMEN, PLEASE NOTE . .<br />\nindependent.<br />\nin the NEWS-LETTER, The important<br />\nempty, oyster shells. Ask for honest criticisms; keep<br />\nuncomfortable,<br />\nmentally<br />\nthat you are becoming<br />\nthere has existed vary- question at hand is whether there tween our members and all others<br />\nALTHOUGH<br />\nwould<br />\nit<br />\nPerhaps<br />\nimprovement.<br />\nfor<br />\nseeking suggestions<br />\nwith whom we may be associated;<br />\nyours—then you may be<br />\ning degrees of divergence in the will be another show this year or<br />\nfrom the when a healthy skepticism is<br />\nbe it good idea when praise comes, to look<br />\nto furtheur any esteem in which we<br />\nHopkins educafrom sure that a college education, and a<br />\nvimes of the faculty, administration not.<br />\nstaff up; when adverse criticism is raised, to look<br />\n.<br />\n.<br />\n.<br />\nmay be held, and to inspire amoung<br />\ntions, is yours\") . • . ABOUT YOUR SCHEDULE<br />\nand the NEWS-LETTER, I can truthyourself down.<br />\nIf the club can see its way through, our members a true, loyal, and lastABOUT ACTIVITIES . . ABOUT FRATERNITIES fully state that there has never been<br />\ncampus<br />\nof<br />\nREA<br />\nbe<br />\nBarnshow.<br />\nFOR<br />\nthere<br />\nanother<br />\nphases<br />\nwill<br />\nPLEA<br />\ning<br />\nmany<br />\nfriendship.<br />\nin<br />\ncampus—'A<br />\nthe<br />\nactive<br />\nof<br />\ncare<br />\nstudent<br />\ntaking<br />\n.<br />\n. .<br />\nEING a<br />\nthe slightest suggestion of censorunhealthy spEar, UTILE HELP, PLEASE.<br />\nstormer meeting next week will delife, you, will be subjected to many<br />\nWe former members of the Eta<br />\nship. I hope that this healthy and<br />\ncide the question.<br />\nconflicting' intemptations. You will be ,the center of<br />\nChapter of the Phi Alpha Fraternity<br />\nto bring out problems which desirable situation continues.<br />\ncharacter. It's IN the past we have tried<br />\nYours,<br />\nterests. Here is the real test of your'<br />\n- Aeisys-uncler our own will and<br />\nCAN say honestly and sincerely<br />\naffect and which we share with our fellow-students<br />\nLewis<br />\nSwyer<br />\neverybody.<br />\nto<br />\n\"yes\"<br />\nsay<br />\nvolition, seveeally and jointly, severe<br />\nso easy, you know, to<br />\nthat I value no other single ex•<br />\neverywhere:<br />\nall our relationships with the Phi<br />\nou should never forget, although the campus never THE TRUTIT MAKES WHO FREE? -.(\"However, perience more than my association Editor, Johns Hopkins NEWS-LE IN, Alpha<br />\nFraternity; and from this<br />\nextrawith the News-LETTER. I can think Sir:<br />\nremembers, that the NEWS-LETTER is but an<br />\neven though true, is<br />\nhurts,<br />\nthat.<br />\nspeech<br />\nof<br />\ndate shall be known as the Epsilon<br />\nfreedom<br />\nthe<br />\nwith<br />\nput<br />\nis<br />\ncompares<br />\nthat<br />\nof nothing<br />\ncurricular activity. This means that our paper<br />\nlike<br />\nI<br />\nto<br />\nPRESS<br />\nAlthough<br />\nsee<br />\nthe NEWS- Tau Alpha Fraternity.<br />\nA GAGGED<br />\nschedules, in their too much for the Pitt faculty) . . .<br />\nenjoyment, the instruction, the pleasout by students, with full scholastic<br />\nLETTER play at writing editorials, I<br />\nour symETA<br />\nenthusi- I\". . our fellow-editors from Temple have<br />\nant memories that go with this exspare time. You know, of course, that in our<br />\nan<br />\nthat.in<br />\nthem<br />\nmust<br />\npoint<br />\nout<br />\noffer<br />\nthe-Jenuary<br />\nto<br />\nattempts<br />\ninstitution<br />\nTheir<br />\nperience.<br />\nFebruary 9, 1938<br />\nthis fact. But, pathies.<br />\nasm we have sometimes lost sight of<br />\n21st issue, you allowed a particuef ..the consequences.—<br />\nafraid<br />\nis<br />\nthen<br />\nand<br />\neducation<br />\nidea<br />\nthis<br />\nhave<br />\nyou who carry on I say: Re- larly<br />\nby and, large, you ought constantly to<br />\nand childish bit of<br />\nridiculo<br />\nopinions on the part of'the students\") . . ACTING<br />\nmember your high ideals and re- slander to be printed. I refer to the<br />\nin mind.<br />\nCOLLEGE (\"Down with Joe College\") . . NEEDED<br />\nof<br />\nchange<br />\nnew<br />\na<br />\nEven<br />\neditorial \"Jersey City's Mayor,\" in<br />\na summary AID (. . . \"cutting down of N.YA\") . . . AN IMPOR- sponsibility.<br />\nTWO fold purpose would be served by<br />\ndoes not alter your which Senator John Milton<br />\nwas rewere taken TANT STRUGGLE (\"We students should be concerned administration<br />\nof the main issues and stands which<br />\nof<br />\nand<br />\ninheritance<br />\nwith<br />\nconnection<br />\nourselves<br />\nfor<br />\nferred to as \"the lowest sort of<br />\nwould be<br />\n(Continued from Page 1)<br />\nwith what is going on in Spain. Students like<br />\nduring my administration. The campus<br />\nthe NEWS-LETTER'S past policy and petty-fogging hack\" whose record<br />\nplace<br />\nof<br />\nto<br />\ndecent<br />\npolicies<br />\na<br />\nhomes<br />\nthe<br />\ntrials; we do not attempt to conare fighting to make their<br />\nevaluation given in concentrated form<br />\nreputation.<br />\nbe<br />\nhim<br />\nnfit<br />\nu<br />\nfor<br />\nmakes.<br />\nnosy<br />\npublic<br />\nyou<br />\noffice,<br />\nperhaps<br />\nwe do not think of ourselves<br />\nvict;<br />\nand<br />\nin.\")<br />\nLETTER<br />\nlive<br />\nthe past year's NEWS/ HAVE confidence that you will be and in which it is grandiloquently as the sole owners and proprietors<br />\nfuture attitudes.<br />\noffered a preliminary basis for your<br />\noutand<br />\nconsistent<br />\npolicy<br />\nour<br />\nrepsonsikeep<br />\nand<br />\nhonor<br />\nto<br />\nthe<br />\ntried<br />\nof<br />\nworthy<br />\nconcluded that \"no representative of of the Honor System. Our purpose<br />\nI HAVE<br />\nLooking over my very first paper:<br />\nbility attached to your new position. New Jersey . . . deserves a seat in is an educational one.<br />\nspoken. Among the outstanding issues:<br />\nPLACE OF A COLLEGE PAPER<br />\nNOW that I realize that I'm writ- Congress.\"<br />\nThe Honor System is the personal<br />\nMORATORIUM ON TRUTH?<br />\nparticular way, a coling my last words in any offiBy what right, and I ask this with property of every student of the Hop\"TO a particular audience in a<br />\n. \"We want to make sure that nothing interferes cial capacity, my feelings aren't ex- great<br />\nAnd<br />\n.<br />\n.<br />\n..<br />\nfunction<br />\nreal<br />\ndoes<br />\nour<br />\nconcern,<br />\nits<br />\nfulfills<br />\nNews-LETkins. The majority of the student<br />\nlege newspaper<br />\ntraditional academic freedom and liberal atti- actly of the pleasantest kind . .<br />\nexamination of editorials with the<br />\nTER dare to present lawyer John Mil- body cherish it as such. But the<br />\nmost important of all, an<br />\nassociated with our University since its founding After three and a half years of connot only the campus, tonic<br />\nton as \"the lowest sort of petty- jump from an ideal to a practical<br />\nchange<br />\nor<br />\nwill show•that problems involving<br />\nundermine<br />\nto<br />\n. And if we do anything<br />\nstant association with an activity, fogging hack?\" I do not know Sen- issue is a broad one. When it comes<br />\nstudents are directly<br />\nbut the world, in so far as the<br />\nthose long-standing traditions during this financial it starts to \"get under your skin.\"<br />\n\"and—<br />\nator Milton personally, but I am to reporting a violatiOn of the Honor<br />\nor indirectly affected, are treated<br />\ncampaign, we will obtaining money under false pre- Yet because I_ feel that I've gotten<br />\nsure that Congress can examine his System, most of us are reluctant<br />\ntenses.\") . . ..and OUR PLACE ON THE CAMPUS<br />\nPLACE OF THE HOPKINS' PAPER<br />\nmy<br />\nfrom<br />\npermanent<br />\nsomething<br />\nrecord as the NEWS-LETTER suggests, in the matter. But an ideal is worth<br />\nwe \"(fE believe the NEWS-LETTER has the right and duty \"News-LETTER work, the importance with \"microscopic thoroughness.\" fighting for, if it be a true 'One. Ills<br />\nWe are a newspaper of that University;<br />\n\". .<br />\nfade.<br />\nstarts<br />\nto<br />\nseperation<br />\nphysical<br />\nof<br />\ntraditions<br />\nthe<br />\nfull<br />\nin<br />\nCongress will find that he was legal for this purpose—to supply a mebelieve<br />\nto take a stand on all ,student issues. We<br />\nare a publication that accepts<br />\n..<br />\nin presenting facts in news stories, but opinions in MAY I say officially and personally council to three New Jersey govern- chanism whereby the student body<br />\nand ideals of the Hopkins as its own<br />\nto all Hopkins' goodby and ors, which the News-LETTER does not can better maintain its Honor Systo present student<br />\nimpartial, and uncolored editorial . . . crux of our function:<br />\nE desire to present fair,<br />\nconsider an edifying achievement al- tem—that the Student Honor Com. . . SUPPORT thanks.<br />\npages. But attitudes towards student questions.\")<br />\nnews accounts on the allotted three<br />\nTANLEY MORTON FINKEL' though our Statesmen will all admit imission exists.<br />\nSTRIKE and TWO ANNIVERSARIES<br />\nsanctum sanctorum—we will THE PEACE<br />\non the editorial page- -our<br /><br />\nt tu 5<br /><br />\n'letter<br /><br />\nW<br /><br />\nF<br /><br />\nii<br /><br />\nFl<br />\n\"S<br /><br />\nAGAIN<br /><br />\nafte<br />\nfou<br />\nwin<br />\nthe<br />\nheld<br />\nmos.<br />\nBlue<br /><br />\nA<br /><br />\nEpsilon Tau Alpha<br />\nStatement<br /><br />\ny<br /><br />\nA<br /><br />\nB<br /><br />\nO<br /><br />\ny<br /><br />\nB<br /><br />\nI<br /><br />\ny<br /><br />\n\"W<br /><br />\npla<br />\nJoh<br /><br />\ntory<br />\nnot<br /><br />\nN<br /><br />\nA<br /><br />\ntea<br /><br />\nW<br /><br />\nFinkel Reviews<br />\nNews-Letter<br />\nPolicy<br /><br />\np<br /><br />\nA<br />\nthe<br /><br />\nCommission Functions<br />\nDefined<br /><br />\nIt<br />\ned t<br />\nthat<br />\nag)•<br />\nLam<br />\nafte<br />\nNext<br />\nmar<br />\nSi<br />\ncept:<br />\nLam<br />\na se<br />\nto<br />\nutes<br />\nIn<br />\nteam<br />\ntie. '<br />\ntemp<br />\nin, M<br />\ned a<br />\nthe .<br />\nHopk<br />\nOn<br />\na sit)<br />\nsera<br />\ngrab.<br />\nwho<br />\n\"Sho<br />\nwent<br />\nleft.<br />\nSh.<br />\nRoss<br />\nhalf<br />\nMoor:.<br />\nLain;<br />\nbound<br />\nAg:<br />\nthis ti<br />\nwith<br />\nand C<br />\nPointe<br />\nfouled<br />\nThe<br />\none o<br />\ntoed t<br />\ntors on<br />\nfirst,<br />\ngym.<br />\nmark,<br />\ncords,<br />\nand t<br />\nwere<br />\nthis hi<br />\nHow<br />\ncheeri<br />\ntook<br />\nclesper:<br />\nshot a<br />\nthe co<br />\n26. A<br />\nHopki<br />\nfifteen<br />\nwere a<br />\nwas 11).<br />\n26.<br />\nAfte<br />\nthe loc<br />\ngame.<br />\nWhen<br />\nabout t<br />\nthe bi:<br />\nbaskets<br />\nThe<br />\nand w•<br /><br />\nthe co<br />\nthe Ja<br />\nThroug ,<br />\nthe Jo<br />\nHopkin•<br />\n14-13,<br />\nthe lea<br />\nuntil th<br />\nthe sco<br /><br />\nHOMEWOOD, BALTIMORE, TUESDAY, FEBRUARY 15, 1938<br /><br />\n3<br /><br />\nBattling Blue Jays Bow To St. John's Five 27-26<br />\nGAME WON BY<br />\nJOHNNIES IN LAST<br />\nFIFTEEN SECONDS<br />\n\"Shorty\" Cross Sends Hopkins Ahead 26-25 In<br />\nClosing Minute<br />\nJohnny Lambros Big Gun<br />\nFor Annapolis Lads With<br />\n12 Points<br />\nA 27-26 count tells the story of<br />\nclash between the basketball<br /><br />\nthe<br /><br />\nteams of Hopkins, and St. Johns<br />\nplayed Saturday at Homewood. St.<br />\nJohns emerged victorious, but only<br />\nafter a battle that was rough, hard<br />\nfought, and exciting throughout. The<br />\nwinning shot was made by Shawn in<br />\nthe last fifteen seconds of play.<br />\nWith<br /><br />\nten<br /><br />\nminutes left, Hopkins<br />\nheld its largest edge at 23-18. Then,<br />\nmost spectators believed that the<br /><br />\nLine-up<br />\nSt. Johns<br />\nLambros, f.<br />\nTarantino, f.<br />\nRoss, f.<br />\nRowe, c.<br />\nDe Lisio, g.<br />\nShawn, g.<br /><br />\nHopkins<br />\nMelvin, f.<br />\nTraggis, f.<br />\nMoore, c.<br />\nCross, c.<br />\nRasin, g.<br />\nMacLain, g.<br /><br />\nGls.<br />\n5<br />\n1<br />\n1<br />\n1<br />\n1<br />\n1<br /><br />\nFin.<br />\n2- 5<br />\n0- 1<br />\n2- 2<br />\n1- 2<br />\n1- 2<br />\n1- 1<br /><br />\nPts.<br />\n12<br />\n2<br />\n4<br />\n3<br />\n3<br />\n3<br /><br />\n10<br /><br />\n7-13<br /><br />\n27<br /><br />\nGls.<br />\n3<br />\n2<br />\n1<br />\n1<br />\n.1<br />\n.2<br /><br />\nFin. Pts.<br />\n0- 1<br />\n6<br />\n1- 3<br />\n5<br />\n0- 1<br />\n2<br />\n2- 4<br />\n2- 5<br />\n4<br />\n1- 1<br />\n5<br /><br />\n10<br /><br />\n6-15<br /><br />\n26<br /><br />\nFRATERNITY FIVES<br />\nCOMING INTO FINAL<br />\nLAP OF YEAR'S PLAY<br />\n-Pi Epsilon, Phi Gamma, Tau<br /><br />\nTWO RELAYS DECIDE FIRST HOME<br />\nSWIMMING MEET AS JAYS LOSE<br /><br />\nIntercollegiate Schedule<br />\n-<br /><br />\nTuesday—Hopkins vs. Loyola at<br />\nSeeking their third win, the Blue last lap over a fast tiring rival. This<br />\nJay swimmers met Swarthmore Sat- last victory brought the score to<br />\nhome.<br />\nurday. However, the Pennsylvania Hopkins 32, Swarthmore 36, with<br />\nThursday -Hopkins vs. Western<br />\nlads nosed out a 43-32 win over but one event remaining, the 320<br />\nMaryland, Away.<br />\nHopkins in the City College pool. The yard free style relay with its seven<br />\n43-32 score does not tell the real point value. However, the Jays steady<br />\nWrestling—<br />\nstory of the meet, for the Jays were gain in the scoring column turned<br />\nFriday—Hopkins vs. Gallaudet,<br />\nfirst in five of the seven individual out to be in vain. The visitors got<br />\naway.<br />\nevents, but lost out in both relay away to a flying start and held their<br />\nraces.<br />\nlead throughout, to win the relay by Swimming—<br />\nThe Pennsylvanians immediately ten yards and the meet by eleven<br />\nTuesday—Hopkins vs. Univergained a lead when they were vic- points.<br />\nsity of Delaware, away.<br />\ntorious by a wide margin in the 240 240 yard medley<br />\nrelay- -Won by<br />\nyard medley relay. Captain Alan Hill<br />\nSwarthmore (Brown, Mawhiney,<br />\nSaturday—Hopkins vs. Lehigh,<br />\nthen came in first in the 220 yard<br />\nStone) 2:47.<br />\naway.<br />\nfree style race to score the first Blue<br />\n220 yard free style--Won by Hill,<br />\nJay points. However, Carroll, and<br />\nFraternity Schedule<br />\nHopkins; second, Carroll, SwarthW. Mifflin of Swarthmore took secmore; third, W. Mifflin, Swarth- Saturday—<br />\nond and third places. C. Mifflin of<br />\nmore. Time-2:41.7.<br />\nKappa Sigma vs. Pi Lambda Phi.<br />\nSwarthmore upset Radner in the 40<br />\nEpsilon Tau Alpha<br />\nyard free style event to win the first 40 yard dash—Won by C. Mifflin,<br />\nSwarthmore; second, Radner, HopPhi Gamma Delta vs. Phi Alpha.<br />\nof the two individual races taken<br />\nkins; third—Simmer, Swarthmore.<br />\nPhi Epsilon Pi vs. Tau Alpha<br />\nby the visitors.<br />\nTime-20.6.<br />\nOmega.<br />\nJacobs Wins<br />\nDelta Upsilon vs. Sigma Phi<br />\nHal Jacobs was victorious in the Fancy Dive—Won by Jacobs, Hopkins; second, Angell, Swarthmore;<br />\nfancy dive with 71.8 points, Angell<br />\nEpsilon.<br />\nthird,<br />\nClevinger,<br />\nand Clevinger of Swarthmore reSwarthmore.<br />\nAlpha Delta Phi vs. Delta Phi.<br />\nspectively took second and third. Winner's point-71.8.<br />\nKappa Alpha vs. Deta Theat Pi.<br />\nAlan Hill won his second event, the 100 yard free style—Won by Hill,<br />\nAlpha Epsilon Pi vs. Alpha Tau<br />\n100 yard free style in what was<br />\nHopkins; second, Stone, SwarthOmega.<br />\nprobably the most thrilling match<br />\nmore; third, Clevinger, Swarthof the day. Leading by inches until<br />\nmore. Time-1:1.3.<br />\nthe last turn, Hill fell behind as 150 yard backstroke--Won by Weinthe mermen headed for the last<br />\ner, Hopkins; second, Stone, Swarthtwenty yards. However, a last minmore, third, Dunlop, Hopkins.<br />\nute spurt brought the victory to<br />\nTime-2 m.<br />\nHopkins as Hill emerged first by 200 yard breastroke—Won by Mathose same inches. In the 150-yard<br />\nwhiney,<br />\nSwarthmore;<br />\nsecond,<br />\nbackstroke Weiner of Hopkins finAdams, Hopkins; third, Zinner,<br />\nished first and Dunlop of the Jays<br />\nSwarthmore, Time-2:37.4.<br />\ntook a third place.<br />\n440 yard free style—Won by Radner,<br />\nMawhiney of Swarthmore was<br />\nHopkins; second, Carroll, Swarthvictorious in that long pull that commore; Bennett, Swarthmore. Time<br />\nprises the 200 yard breaststroke race,<br />\n-Z 58.4.<br />\nAdams took second for Hopkins. An- 320 yard free style relay—Won by<br />\nother event won in the final few yards<br />\nSwarthmore (C. Mifflin, N. Smith,<br />\nwas the 440 yard free style.<br />\nStone, Simmer).<br />\nRadner steadily gained a lead in the<br /><br />\nAlpha Omega, And EpBlue Jays were on the road to victory, but the fighting Johnnies were<br />\nsilon Tau Alpha Win<br />\nnot to be denied.<br />\nEpsilon Tau Alpha, the former Phi<br />\nLambros Starts<br />\nIt was Johnny Lambros who start- Alpha fraternity, and one of the leaded the Annapolis- lads on the rally ing undefeated contenders for the<br />\nthat knotted the count at 23-23 and inter-fraternity basketball trophy,<br />\nagain at 25-25. With the score 23-18 continued its winning streak with a<br />\nLambros tallied on a- dribbled in shot crushing 30-2 victory over the hapafter he had faked life way clear. less A.E. Pi quintet.<br />\nNext, Lambros added a charity<br />\nRossett led the scoring for the<br />\nmarker to bring the score to 23-21.<br />\nETA's with eight points while<br />\nBill Ross of the Johnnies inter- Locker ran a close second with<br />\nsix<br />\ncepted a Hopkins pass, and he and points. It was the fourth straight vicLambros went down the floor. After tory for the ETA's.<br />\na series of passes, Lambros tallied<br />\nFreshman Stars<br />\nto knot the score 23-23. Seven minPhi Epsilon Pi won its first game<br />\nutes left.<br />\nof<br />\nthe<br />\nseason<br />\nin defeating Phi Sigma<br />\nIn the next few minutes both<br />\nteams tried desperately to break the Delta 24-16. Due to the sharpshoottie. Ross fired two longs, Melvin at- ing freshman, Ellenbogen, who scortempted a long, Lambros dribbled ed 14 points, they easily topped the<br />\nin, Moore passed to Rasin, who miss- Phi Sigs.<br />\ned a long, and with St. Johns having<br />\nIn one of the best games of the ,<br />\nthe ball on a out of bounds play day TAO. led by little Marty SrebHopkins called time-out.<br />\nnik defeated the Phi Psi contingent,<br />\n11-8. Both teams were undefeated,<br />\nHopkins Ahead<br />\nOn the next play Tarantino missed and it was a contest which probably<br />\nUnable to hold a early lead, the finished with a draw.<br />\na short for St. Johns. There was a decided the league \"C\" championHopkins wrestlers also dropped a 118-Pound Class--Longcou<br />\npe, Haverscramble for the leather with Cross ship.<br />\nthrilled to Haverford last Saturday<br />\ngrabbing it. Cross tossed to Rasin<br />\nford threw Whelam in extra period.<br />\nPhi Psi At Half<br />\nwho missed, but one the rebound<br />\nThe game was fast and furious 20'—i5½. Coach Baer's cohorts got 126 Pound Class—Vernon, Hopkins<br />\n\"Shorty\" tapped it in and Hopkins with little scoring by either team. away to a good start, but Haverford<br />\nthrew Simons in 1 min. 15 sec.<br />\nwent ahead at 25-23. Two minutes Psi, however, led by the score of drew up to knot the<br />\ncount at 151<br />\n/<br />\n2- 135 Pound<br />\nClass—Bolster, Haverford<br />\nleft.<br />\n5-2 at the half. The second half, 15I/2 with one match<br />\nremaining.<br />\nthrew Nicholson, Hopkins in 3 min.<br />\nShots by Lambros, Melvin, and however, told a different story. With<br />\nAt<br />\nthis stage, Pollock, Hopkins,<br />\nRoss missed by inches. One and one- Srebnik leading, the T.A.O.'s ate up<br />\n38 sec.<br />\nhalf minutes left. McLain tossed to the early Phi Psi lead and went on and Ashbrook, Haverford, met in the 145 Pound<br />\nClass--King, Hopkins deMoore, Moore to Resin, Rasin to Mc- to win, 11-8.<br />\nheavy-weight bout. After two minfeated Hague, decision.<br />\nLain; but a pass that went out-of- Tolson led the -Phi Psi's with six utes and 65 seconds, Asbrook threw 155 Pound Ciass—Clautice, Hopkins<br />\nbounds stopped Hopkins advance.<br />\npoints while Srebnik scored five for Pollock to add five more points to the<br />\nthrew Baum in 8 min. 20 sec.<br />\nRoss Ties It<br />\nTAO.<br />\nPennsylvania lads total. This enabled 165 Pound Class—Edwards<br />\nAgain, Ross shot a long one, but<br />\n, Hopkins<br />\nPhi Gain defeated D.U. by the the home team to top Hopkins.<br />\nthis time the ball settled in the cords<br />\n•<br />\nand Everts drew.<br />\nwith the score 25 all. Basin, Moore score of 2343 in the other important<br />\nIn all, Haverford matmen won four 175 Pound Class—Winslow, Haverand Cross tried desperately for a two game of the day. Led by the sharpclashes to the Blue Jays three, with<br />\nford, defeated Buc, decision.<br />\nPointer. In this attempt Cross was shooting Johnny Royster the outcome of the game was never in one draw. Vernon, King, and Clautice Heavyweight<br />\nAshbrook, Haverford<br />\nfouled.'Thirty seconds left.<br />\ncopped<br />\ntheir<br />\nbouts while Edwards<br />\nthrew Pollock in 2 min. 55 sec.<br />\nThe climax was reached. Cross, doubt as the Phi Gams grabbed an<br />\nearly<br />\nlead<br />\nand built it up as the<br />\none of Hopkins best foul shooters,<br />\ntoed the charity mark. The specta- game proceeded.<br /><br />\nHaverford Pins Grapplers When<br />\nHeavyweight Bout Decides Match<br /><br />\ntors were tense. \"Shorty\" missed the<br />\nfirst. Groans were heard over the<br />\ngym. Again, \"Shorty\" Cross toed the<br />\nmark, but this time the ball cut the<br />\ncords. With the score 26-25, Hopkins,<br />\nSeeking their second win of the<br />\nand twenty seconds left most people<br />\nwere hailing Cross as the hero of season, the Blue Jays fencing team<br />\nwill<br />\ntravel to College Park Wednesthis hectic battle.<br />\nday to combat the Maryland foilsSt. Johns Again<br />\nwas men. This will mark Hopkins only<br />\nHowever, as the<br />\ncrowd<br />\nmeet against<br />\ncheering, the Annapolis lads quickly start since their<br />\ntook the ball down the floor. In a Loyola. Although victorious in this<br />\ndesperate attempt to score. Shawn match, Maryland will be given a<br />\nslight edge over Hopkins.<br />\nshot a long which dropped through<br />\nthe cords to put St. Johns ahead 27- ' The Blue Jays will present the<br />\nsame<br />\nteam as in the past. Captain<br />\n26. A climax, an anti-climax, could<br />\nHopkins again forge to the front in Reed will enter the two foils matches,<br />\nfifteen seconds? Several long shots and from past showing is expected to<br />\nwere attempted, but as the final gun cop both.<br /><br />\nJAY VEE FRAY WON BY<br />\nVISITING QUINT 26-20<br /><br />\nIntercollegiate Schedule<br /><br />\nii<br /><br />\nAn exciting preliminary to a thrilling main event was the Jayvee basketball game which pitted the Blue<br />\nJays Junior Varsity against St.<br />\nJohns'. A close fray all the way, the<br />\nJohnnies pulled away toward the end<br />\nto come out on top by a 26-20 score.<br />\nGetting off to an even start, both<br />\npiled<br />\nup an early total<br /><br />\nfives<br /><br />\nof six points. At half time the<br />\nscore showed the visitors on top by<br />\nvirtue of one free throw with a 13-12<br />\ncount. However,,,ihe half-time rest did<br />\nthe Johnnies good, and they gained<br />\na five-point lead, as Weisheit and<br />\nHill came through with fieldgoals to<br />\nmake the score 19-14. The Johnnies<br />\ncontinued on the offense and'ran their<br />\nlead up to ten points.<br />\nHowever, the Blue Jays put on a<br />\nbelated attack and closed up the gap.<br />\nBitsack and Butt led the offense and<br />\nquickly scored three goals between<br />\nthem. However, before the Jays had<br />\ntime to get set for another onslaught,<br />\nthe final gun went off and closed the<br />\ngame at 26-20.<br /><br />\nantient<br />\neetv<br /><br />\nin a MODERN SETTING<br />\nOn sale at<br />\nLug Cabin-3107 St. Paul St.<br />\nLittle Tavern-32nd &amp; Greenmount<br />\nHolly's-3333 Greenmount Ave.<br />\nDoc's-1817 N. Charles St.<br />\nCampus Inn-2501 N. Charles St.<br />\nGreen &amp; Fairbanks-26th &amp; St. Paul<br /><br />\nNATIONAt remium<br />\nA PALE DRY BEER<br />\nBrewed by<br /><br />\nTHE NATIONAL BREWING CO.<br />\nBALTIMORE, MD.<br /><br />\nFencing Team Faces<br />\nMaryland Wednesday<br /><br />\nwas heard Hopkins was trailing 27Harris, the only other undefeated<br />\nman, will enter the saber event. After<br />\n26.<br />\nhis surprise 5-1 win over Loyola's<br />\n\"Dutch\" Talks<br />\nAfter the game \"Dutch\" Lentz in star fencer, Harris is expected to add<br />\nthe locker room said, \"It was a great to Hopkins points. Phil Small, Peegame. Both teams played good ball.\" ples, and Agrin will complete the<br />\nWhen the St. Johns' coach was asked team.<br />\nabout the players, he said, \"Frankly,<br />\nthe big boys of Hopkins under the<br />\nDr. Schaffer Addresses<br />\nbaskets had me worried.\"<br />\nThe Blue Jays in defeat look good,<br />\nSpiked Shoe Meeting<br />\nand was the aggressor throughout<br />\nthe contest At the epening tip-451! --Dr. -Lawrence Schaffer spoke bethe Jays got away to a 4-0 lead. fore a 'meeting of Spiked Shoe in<br />\nThroughout the rest of the first half Levering hall last night. His subthe Johnnies were in the front, but ject was \"The Spiked Shoe on the<br />\nHopkins gained the edge at the half Campus in Stirring University In14-13. The Mallonee coached five held terest in Track\". Referring to the<br />\nthe lead during the entire second half past season, he pointed to the need<br />\nuntil the final fifteen seconds. In all for promoting track enthusiasm on<br />\nthe score was tied seven times.<br />\nthe Campus. His talk began at 8 p. m.<br /><br />\nCasa Limerick Contest<br /><br />\n•<br /><br />\nDo You Want Ten Bucks?<br />\ndo. But this is your baby. The Cotillion Board will give to the winner<br />\nof each contest $10. All you have to do is finish the limerick started<br />\nfor you.<br />\nBetween now and March 1, there will be a new contest each week, and<br />\nthe winner will receive $10 at the Cotillion. The winner must be present to<br />\nreceive his<br />\naward. The Judges in the contest are the members of the Cotillion Board.<br />\nOf<br />\ncourse no one connected with the board may participate.<br />\nWe<br /><br />\nThis Week's Limerick is:<br />\n\"The Cotillion board hunted around<br />\nTill a swing band they finally found<br />\nIt's the tops, so they say<br />\nAnd it's led by Glen Gray.\"<br /><br />\n•<br />\nSee You al the Cotillion'<br /><br />\nis<br /><br />\nHOMEWOOD, BALTIMORE, TUESDAY, FEBRUARY 15, 1938<br /><br />\nFRANK MORLEY SPEAKS<br />\nTOMORROW IN REMSEN<br /><br />\nNOTESTEIN TALKS<br />\nON 17TH CENTURY<br />\nCOUNTRY SQUIRE<br /><br />\n_<br />\nA special lecture will be given at<br />\nthat the Individual enters society and the Hopkins on Wednesday, Februbegins his larger preparation for ary 16, when Frank V. Morley delivers a talk on \"The Importance of<br />\ncitizenship.\"<br /><br />\nNicholas Assheton Described<br />\nAs A Hunting, Fishing,<br />\nShooting Squire<br /><br />\nHe pointed out the tendency to<br />\nIdentify education with organized<br />\nschooling. A child spends a comparatively small portion of his life in<br /><br />\nthe music of the Southerners, began<br />\nTeaching Mathematics\" in Room 1, at eight o'clock.<br />\nRemsen Hall at 4 o'clock. Frank<br />\nA dance in honor of the Kapa AlMorley, English publisher, with the<br />\nheld at Levering<br />\nHouse of Faber &amp; Faber in London, pha pledges will be<br />\ndeceased Dr. Hall February 18th at 9 o'clock, Jack<br />\nschool, he declared.' His real living, is a son of the recently<br />\nemeritus of Quinn and his orchestra providing<br />\nhowever, is done at home, where in Frank Morley, professor<br />\ndepartment at the the rhythm.<br />\nMathematics<br />\nthe<br />\nhe<br />\nexperience,<br />\nactual<br />\nof<br />\nmidst<br />\nthe<br />\n1,<br />\nachieves the ideas, attitudes, and Hopkins.<br />\nThe Alpha Chi Rio 4eld its annual<br />\nMr. Morley and brothers held<br />\nhabits that make up his nature<br />\nPike Lecture at the Y. M. C. A. Last<br />\nare<br />\nHis<br />\nbrothers<br />\nscholarships.<br />\nRhodes<br />\ncharacter.,,<br />\nSaturday night, capping the evening<br />\nD. Morley, American<br />\n\"No nation,\" he declared, \"can long Christopher<br />\nauthor, and Felix M. Morley, editor of with a radio dance at their house besurvive a disintegration of the famginning at ten-thirty.<br />\nthe \"Washington Post.\"<br />\nily. Citizenship is in the last analysis<br /><br />\nTYPICAL CHARACTER<br />\nHAS HUMOROUS NOTE<br /><br />\n\"He rode placidly behind his hounds<br />\nbetween the opposing armies at the<br />\nbattle of Edgehill, as If the issue between the King and parliament were<br />\na light matter beside the pursuit of<br />\nhis Majesty, Reynard the Fox.\"<br />\nThus Dr. Wallace Notestein, Sterling professor of history at Yale,<br /><br />\nA radio dance was also held at the<br />\nEpsilon Tau Alpha, formerly Phi<br />\nAlpha, had a very gala evening last Alpha Tau Omega house last SaturSaturday night at the Southern day night.<br />\nHotel. The event, a dinner featuring<br />\nKappa Sigma dedicates a novelty<br />\n\"old clothes\" dance to its pledges. It<br />\nwill begin at nine at the house on<br />\nFebruary 19th. The orchestra has not<br />\nyet been selected.<br /><br />\nThe<br /><br />\nBaltimore<br /><br />\nChapter<br /><br />\nof<br /><br />\nthe<br /><br />\nJewish University Club will hold its<br />\nregular monthly meeting on Sunday,<br />\nFebruary 20th, at the Phi Sigma<br />\nDelta fraternity house. Hopkins students are invited to attend.<br /><br />\nthe virtues that enable an individual<br />\nto live unselfishly and cooperatively<br />\nwith his fellow man. The home is the<br />\nnursery of these virtues.\"<br /><br />\nProfessor Of Education At<br />\nCatholic U. Opens Series<br />\nOn Religion<br /><br />\nHome Keystone In Education<br />\nThe importance of the home is<br />\nfostering love, sacrifice,' and cooperation was emphaized. To discharge<br />\nits educational responsibilities, the<br />\nhome must be dominated by a conscious purpose.\" The home must provide facilities for the maximum development of the physical, mental,<br />\nand moral capacities of the individ-<br /><br />\ncharacterized Nicholas Assheton, a<br />\nseventeenth century English sportThe Rev. Dr. George Johnson, in<br />\ning squire, from whose diary he drew<br />\nfor material in a Schouler lecture at the first of three4talks on \"Religion's<br />\nLatrobe yesterday. His portrait of a Approach to Current Problems\" in<br />\ncountry gentleman was entitled \"A Latrobe Hall yesterslay, stressed the<br />\nHunting, Fishing, Shooting Squire importance of the fa ily in educa- ual.\"<br />\ntion.<br />\nUnder James I.\"<br />\nDr. Johnson, received his doctorate<br />\nNo Pink Coats<br />\nAttacking the issue from the point in philosohy, at the Catholic. Uniof America, where he, became<br />\nversity<br />\nIn discussing the habits of the gen- of view of the state and religion, Dr.<br />\neducation in<br />\ntry he said that most were interested Johnson, professor of education at associate professor of<br />\n1921. He has been secretary of the<br />\nin politics and religion, and that the the Catholic University, stressed the<br />\nNational Catholic Association since<br />\nfew sportsmen hunted foxes, stags, social importance of the family in 1909 and of the American Council of<br />\nand badgers, but had nochampagne teaching children.<br />\nEducation since 1934. One of the<br />\nlunches, and very thisty did not wear<br />\n\"The home,\" he said, \"is the funda- editors of \"The Catholic Education<br />\npink coats. They drank heavily, withmental educational agency. It is Review\", Dr. Johnson is the author of<br />\n-out apologies or regrets, and ate<br />\nthrough the family and family living, many articles on education.<br />\nman-sized meals.<br />\nThe lecturer described a banquet<br />\ngiven for James 1, at which meat<br />\ndishes were served. They had few<br />\nsalads because \"the plain country fellow did not eat grass, and he loved<br />\nno salads.\" A good churchman, the<br />\nsquire lived in a home hardly adequate for a modern farmer.<br />\nAssheton Alias John Bull<br />\n\"The active, hard-riding life kept<br />\nthe Nicholas Assheton's wholesome<br />\nand sane and civilized and preserved them as fairly sensible leaders<br />\nof their community. The government<br />\nthey stood behind only more continues the type they represented. For<br />\nNicholas Assheton was an earlier<br />\nname for John Bull.\"<br />\nTomorrow night, Dr. Notestein wil:<br />\nspeak on \"A Lady of the Manor in<br />\nthe Civil War\" in Latrobe hall at<br />\nfive. This talk will also be published<br />\nthis spring in the volume of sketches<br />\nportraying seventeeth century social<br />\nlife that he is preparing.<br />\nNow Sterling Professor<br />\nNow a Stetling professor of history at Yale, Dr. Notestein was active in the state department during<br />\nthe world war, serving on the American Committee to negotiate peace in<br />\nParis in 1919. He was appointed to<br />\nthe British Commission on the House<br />\nof Commons Records ih 1929, and has<br />\nbeen professor of history at three<br />\nuniversities. Dr. Notestein is the<br />\nauthor and co-author of many books<br />\non seventeenth century social and<br />\npoliticaVlife in England.<br />\nBy searching out and publishing<br />\nthe diaries of prominent commoners<br />\nof Stuart reign in England, Dr. Notestein has illuminated some of the<br />\nsecret stormy sessions of the House<br />\nof Commons of that period. This is<br />\noutstanding<br />\nhia- most<br />\nperhaps<br />\nachievement as a specialist in seventeenth century England.<br /><br />\ntill<br />\nade<br /><br />\nMaryland Casualty Bldg. : FEBRUARY 25<br /><br />\natte<br />\nEdv,<br />\nCas<br />\nand<br />\nceed<br />\nthe<br />\nLim<br /><br />\nTo<br /><br />\nwrite<br />\nas th<br />\nick,<br />\nMu rp<br />\nBoar<br />\ncont<br />\nbasis<br />\niginal<br />\nple o<br />\nrhyth<br />\nWCA<br />\nConsu<br />\nthe 1<br />\nTha<br />\ndorm<br />\nthe G1<br />\nFrida<br />\nlucky<br />\nthat<br />\nthe<br />\nrando<br />\nthe s<br />\ncandid<br /><br />\nChesterfields give you a different kind of smoking pleasure...<br />\nmildness that's more refreshing<br />\ntaste that's more satisfying<br />\naroma that's more appetizing<br /><br />\nDr. L<br />\nprofeso<br />\nMaryla<br /><br />\nMild ripe tobaccos and pure cigarette paper, these Chesterfield ingredients are the best a cigarette<br />\ncan have. Chesterfields SATISFY<br /><br />\nin the<br />\ntures<br />\nby the<br />\nJews a<br />\n\\<br />\nversity<br />\nning at<br />\nCatholic<br />\nof the i<br />\nUntil<br /><br />\n..youllfind MORE PLEASURE<br /><br />\naesterneldi mikkrhetter taste<br /><br />\n-fessor of<br />\nfUniversi<br />\ncial field<br />\nstudied<br />\nEngland.<br />\nive in St<br />\ncance o<br />\nalso vani<br />\nindustry<br />\nnomic an<br /><br />"}], "field_media_file": [{"target_id": 39152, "display": null, "description": null, "target_type": "file", "target_uuid": "dc089f8c-5509-46f0-8d34-5ddb27f6b336", "url": "http://digital.library.jhu.edu/system/files/2022-03/12828-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12828, "target_type": "node", "target_uuid": "03794d6b-4b1e-46f3-b785-4772cdc6a984", "url": "/node/12828"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "cce606c4-efd6-4ab4-8c36-b5e1d4701ae1"}]}