{"mid": [{"value": 36943}], "uuid": [{"value": "ed40885d-0816-4111-8a66-c5329a2bca28"}], "vid": [{"value": 36943}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:56:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13106-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:56:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:56:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVIII, No 34<br />\n<br />\nHOMEWOOD, BALTIMORE. MD., FEBRUARY 19, 1924<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nMANY COLLEGE ATHLETES BARNSTORMERS HOLD FIRST<br />\nMUSICAL CLUB CONDR. PAUL HARRISON TELLS SENIORS<br />\nDEFEAT JUNIOR<br />\nTO RUN IN HOPKINS<br />\nREHEARSAL FOR ANCERT THURSDAY<br />\nABOUT EXPERIENCES<br />\nTEAM<br />\nIN ANNUAL<br />\nTRACK MEET<br />\nNUAL PRODUCTION<br />\nEVENING<br />\nIN ARABIA<br />\nADAMS<br />\nDEBATE<br />\nJimm y Patterson, One-time Champion, Thirty Men Out. The Galloper to Be<br />\nThe annual home concert<br />\nMedical School Graduate Gives Assem- World Court Upheld by<br />\nto Run in Sprints. Prep Schools<br />\nPresented at the Lyric on March 28<br />\nUpperclassmen<br />\nbly Rare Treat With Stories of<br />\nof the Musical Club will be<br />\nin Spirited Debate<br />\nAlso to Be Rep:esented<br />\nand 29. Only Six Weeks of ReNative Life<br />\npresented Thursday evening,<br />\nhearsal<br />\nBruno Hills, Princeton chamat 8.30 P. M. in the AudiAt the assembly last Thursday, The Class of '24 emerged vicThirty<br />\ntorium<br />\nmen turned out last Friof the Maryland CasDr. Paul Harrison, a graduate of torious in the twenty-seventh anpion weight man of the United<br />\nualty<br />\nClub<br />\nHouse.<br />\nconThis<br />\nday night for the first rehearsal of<br />\nthe Hopkins Medical School, gave naul Adams Interclass Debate,<br />\nStates, will lead a large delegation<br />\ncert<br />\nthe<br />\nis<br />\nsingle<br />\nappearan<br />\nce<br />\nThe Galloper, a three-act farce by<br />\nextracts from a modernized \"Ara- when her debating team defeated<br />\nof the Musical Club in Baltiof Princeton track stars in the Richard Harding<br />\nDavis, to be prebian Nights,\" to the great delight the representatives of '25. The<br />\nmore during the season. The<br />\nHopkins Fifth Regiment Games sented by the Barnstormers on<br />\nconcert will be followed by a<br />\nof an enthusiastic audience. Long subject of the debate, which was<br />\non Saturday night, according to a March 28 and 29. The play was<br />\ndance in the Ball Room.<br />\nservice as a missionary has earned held last Saturday night in the<br />\nrecent report from the Athletic outlined to the men and the first<br />\nEvery student is entitled to<br />\nfor Dr. Harrison the title \"The Civil Engineering Hall, was,\"Reone ticket on his non-athletic<br />\nOffice at Homewood. Princeton's act read through and rehearsed,<br />\nProphet of Arabia\"; and his nu- solved, That the United States<br />\ncard. Extra tickets may be<br />\nentrants will compete in a large temporary parts being given to<br />\nmerous anecdotes show that he is should enter the World Court.\"<br />\npurchased for $1.50.<br />\nnumber of race and field events. members of the club to enable a<br />\njustly credited with familiarity The question is one of timely inOther late entries include- large first reading.<br />\nterest and proved of absorbing inFREDERICK<br />\nENTERTAINED with Arabian life.<br />\neelegations from Penn State and<br />\nBY BLUE JAY MUSICIANS<br />\nAccording to President Hugh M.<br />\nThe globe-trotter's first impres- terest to the fairly large audience.<br />\nWest Virginia.<br />\nJ. Edward Mount, president of<br />\nAT HOOD COLLEGE<br />\nSmallwood, of the Barnstormers,<br />\nsion is that Arabs are extremely<br />\nAmong the West Virginia en- The Galloper is the best<br />\nsuited play Large Audience Hears Hopkins Per- dirty. This first impression is, en- the Debating Council, started the<br />\nformance. Dance Follows Extries is D'Anita, a sprint man for the needs of the club that<br />\ntirely justified by conditions in the program by explaining the essenhas<br />\ncellent Program<br />\nWho ran the 100-yard race at the ever been presented.<br />\ntial features of the mechanics of<br />\nIt is the<br />\nOne of the most successful con- eastern country. Sailboats used<br />\nPenn carnival last year in ten sec- choice of over fifty<br />\nthe<br />\ndebate. Following this he explays read by certs ever given by the Musical in coastal travel are infested with<br />\n°Yids. D'Anita has been placed in the play-reading committee<br />\nplained<br />\nthat the Junior team was<br />\n. The Club was presented Saturday eve- a healthy breed of roaches; and<br />\na special race against Louis Galloper is a three-act farce.<br />\nentering<br />\nthe debate without the<br />\nThe ning at Winchester Hall, a down- the inhabitants thernselves are in<br />\nClarke of Hopkins.<br />\nservices of one of its members,<br />\nscene is laid in Greece during one<br />\nturn<br />\nwell<br />\ninhabited<br />\n.<br />\ntown building of Hood College,<br />\nBooth to Meet Lemonde<br />\nSydney M. Cone, who had been<br />\nof the Graeco-Turkish wars. The<br />\nFirst Impressions Inaccurate<br />\nFrederick. The trip to Frederick<br />\nAnother Hopkins man to be dramatis personae contains twentyThe globe-trotter, however, taken ill Friday afternoon, too<br />\nis one of the longest, if not the<br />\nPitted against a particular oppo- three characters, four of which are<br />\nmakes the mistake of stopping late to notify his alternative. The<br />\nlongest, trip ever attempted by the<br />\nnent in a special race is Verne females, and fifteen extras. There<br />\nwith his first impression. Further address of Mr. Cone was read by<br />\nMusical Club. The concert was a<br />\nBooth, who is scheduled to cola- are a large number of good parts.<br />\nacquaintance with the people John W.Parsons. The first speakgreat success both musically and<br />\nPete with Lemonde of Boston The whole play is light and conbrings out qualities that present er for the Seniors, who upheld the<br />\nfinancially. For a time the club's<br />\nCollege, in a 5000-meter run. This 'ains no serious love scenes to handthem in a more favorable light. affirmative, William B. Gross, was<br />\nmanagement was doubtful as to<br />\nTruly, they don't know as much as then introduced. He explained the<br />\nrace is expected to have a direct icap the use of males in female<br />\nthe financial outcome of the coninfluence in the picking of the parts. The scenery offers great<br />\nthey should ; but, on the, other distinction between entering the<br />\ncert in view of the fact that no<br />\nUnited States Olympic team.<br />\nhand, they know a great deal that League of Nations and the World<br />\npossibilities and Hamburger and<br />\nmoney guarantee was given by<br />\nJimmy Patterson, former Penn Gump are already making elabowe don't know. They are excellent Court. The advantages of setany Frederick organization.<br />\nstar and winner of the sprints in rate plans for this feature of the<br />\ntrackers; a few marks in the des- tling disputes by arbitration,<br />\nProminent Patronesses<br />\nthe 1912 Olympic Games, is prac- production.<br />\nFrederick's most prominent peo- ert sands provide them with a rather than war, were given.\"The<br />\ntising at present in hopes of stagple<br />\npatronized the concert. Those newspaper in which they can read only way to remove war,\" he said,<br />\nNew System of Understudies<br />\nwhole stories of current events. \"is to remove the causes of war.\"<br />\ning a comeback at the Hopkins<br />\nMr. Swindell, coach of the play, serving as patronesses were:<br />\nmeet. Patterson is entered in the announced that the club this year<br />\nMesdames George R. Dennis, Their seilse of directioii and of A statement of Secretary Hughes<br />\nMeet as a member of the Balti- will pick two casts so that compe- Jr., William C. McSherry, Samuel distance makes thiir judgment at was read, in which the opinion is<br />\nmore Athletic Club under whose tition will take place throughout the G. Duvall, J. Alleine Williamson, times more reliable than mathe- handed down that the League of<br />\nauspices he expects to compete period of rehearsals. The two casts D. Charles Winebrener, F. W. matical computations, made with Nations does not influence the<br />\nfor a place on the American Olym- will provide understudies in case Harnwell, Ethel M. McNutt, Otho the aid of excellent instruments. World Court in any way.<br />\nPic squad. Athletic circles are sickness or other reasons prevent a J. Keller, Frank H. Hedges, They will allow nothing to stand<br />\nIsolation Advocated<br />\nmuch interested in Patterson's at- man from appearing in the play at Charles H.'Conley, Reno S. Harp, in the way of satisfying their curiElmer L. Mylander,for the negtempt to regain his old ability as the last minute. The rehearsal Richard S. J. Dutrow, Richard P. osity. To the dictates of religion ative, argued for a direct policy of<br />\nhe was at one time co-holder of work will count just as much to-- Ross, Thomas B. Hayward and J. alone they subordinate their own isolation. Quoting Thomas Jefth e world's record for the 100- wards ultimate membership in<br />\nspirited wills. Even the little chil- ferson, he said: \"We desire peace<br />\nthe 0. Hendrix.<br />\nMeter dash.<br />\nSpecial permission from the au- dren would fearlessly shout a verse and friendship with all foreign naclub as the actual part in the protions, entangling alliances with<br />\nthorities of Hood College was ob- that goes something like this:<br />\nduction.<br />\nPenn State Hurdler Entered<br />\n\"The<br />\nEnglish,<br />\nthe<br />\nnone.\" He declared that \"entrance<br />\nEnglish,<br />\ndelegatio<br />\nthey<br />\ntained<br />\nn<br />\nPenn State's large<br />\nto allow the Hood students<br />\nDelay in starting the rehearsals<br />\ndon't pray!<br />\ninto the World Court and the conWill include Al Moore, who sur- is due mostly to misunderstanding to attend the affair.<br />\nEven the chickens are better than tinuance of the Monroe Doctrine,<br />\nDance Follows Concert<br />\nprised Baltimore track fans last of Charles Scribner's Sons in not<br />\nFollowin<br />\nthe<br />\ng<br />\nconcert<br />\nan<br />\ninthey !\"<br />\nwould be incompatible.\"<br />\nYear by winning the 100 low hur- answering the letters Of the club in<br />\nformal<br />\ndance<br />\nwas<br />\nheld.<br />\nThe<br />\nproThese<br />\nArabs are self-respecting,<br />\nFor the affirmative, John H.<br />\ndle race. Moore is listed in the reference to obtaining copies of The<br />\ngram was well planned and diver- independent and daring. They Croker declared<br />\nsame event for next Saturday Galloper. The copies have come<br />\nthat the policy of<br />\nsified. The Glee Club's numbers have great liking for fiery, fearless the United<br />\nnight. Another star who is ex- and the rights have been secured<br />\nStates has always been<br />\nwere sung extraordinarily well, in preaching. Raiding neighboring to employ<br />\nPected to attract attention is to present the play. Barely six<br />\narbitration in the disspite of the absence of Mr. Bochati. tribes is their national sport. With putes with<br />\nPlavehive, a high jumper. Flave- weeks remain in which to put the<br />\nother powers. Varithe director. The Banjo Club was it all, they are loyal and hospitable, ous<br />\nhistorical<br />\npreviousl<br />\njumped<br />\nfeet,<br />\n6<br />\ny<br />\nhive has<br />\nexamples were cited<br />\nplay across. A great many men<br />\nat its best and the Blue Jay Six —somtimes, to foreigners, uncom- to prove<br />\nthis. He said that to now<br />\n41/2 inches, a performance which are needed and the Barnstormers<br />\nheld its audience spellbound. The fortably hospitable.<br />\nrefuse to co-operate in the estabranks him among the best in the urge the entire undergraduate supprogram was:<br />\nDr.<br />\nHarrison<br />\nRelates Anecdotes<br />\nlishment of a world court would<br />\ncountry. A list of strong competi- port. Rehearsals will take place six<br />\n1. GLEE CLUB<br />\nDr. Harrison told story after be inconsistent with the past practors is provided to make Flave- times a week, on Monday, Tuesday,<br />\nThe University Ode...Devries story to bring out common traits tices<br />\nof this country.<br />\nhive do well to win.<br />\nThursday and Friday nights, and<br />\n2. BANJO CLUB<br />\nof Arabian character. His sympaPolly Carter of the Baltimore on Saturday and Sunday afterAbility of Court Denied<br />\nNews sports department, has ar- noons. Mr. Swindell said, \"Thirty- Enchantment Waltz....Alberti thetic humor made his talk un- John W.Parsons of the Juniors<br />\n3. PIANO Solo<br />\nMr. Sauer usually entertaining, as well as ex- reading the<br />\nspeech of Sydney<br />\nranged a series of races for girls. six rehearsals are all that we have<br />\nNocturne in F# Major..Chopin tremely interesting. He summed Cone,<br />\nsaid<br />\nbeen<br />\nentered<br />\nthat<br />\nAbout 20 girls have<br />\nto produce The Galloper. I urge<br />\nnations will not<br />\n4. GLEE CLUB<br />\nup his impressions of his experi- be kept from doing what their<br />\nIn the events set aside for them. everyone connected with the pro(a) All Through the Night,<br />\nence in Arabia by saying that mis- economic interests or honor reduction in any way to co-operate<br />\nMany Special Races<br />\nBochau sionary work does not consist of quire by purely<br />\nTh e Y. M. H. A. has definitely with us in putting on the best peridealistic con(Mr. Clinton White, Soloist)<br />\nreaching down to the poor heathen cepts. He claimed that the World<br />\nScheduled a mile relay race be- formance that the Barnstormers<br />\n(b) John Anderson, My Jo,<br />\nand condescendingly pulling him Court is not backed by sufficient<br />\ntween its representatives in Bal- have ever produced.\"<br />\nTurnbull out of the mire. The best defini- physical<br />\nforce to quell uprisings<br />\ntimore, Washington, Richmond,<br />\n5. VIOLIN SOLO<br />\nMr. Light tion of missionary work,\" said Dr. or disorder,<br />\nand hence the judicial<br />\nINladelphia and New York. Be- DR. HOLLANDER TO BE THE<br />\nOn Wings of Song,<br />\nHarrison, \"is given in 'Revela- body is legally incompetent.<br />\nsides this race the Y. M. H. A. GUEST OF VIRGINIA ALUM6. THE BLUE JAY SIX<br />\ntions'; namely, bring the glory and<br />\nCapable speeches were presenthas entered many contestants in<br />\nNI OF HOPKINS<br />\n(a) Popular Selections<br />\nhonor of a nation into the king- ed on the rebuttal by Frederick L.<br />\n°ther events.<br />\nProfessor Jacob H. Hollander<br />\n(b) Xylophone Solo.. Mr. Boyd<br />\nContinued on page 4 col. 4<br />\nMoehle for the affirmative, and<br />\nAmong the large number of will be the guest of the Virginia<br />\n(c) Banjo Solo..Mr. McCauley<br />\nDavid Schapiro, for the negative.<br />\nPrep school events scheduled is a Alumni of Johns Hopkins Uni- 7. BANJO CLUB<br />\nThe<br />\nformer cited actual cases<br />\nNOTICE<br />\nTO<br />\n11111e.relay between Baltimore City versity at the annual dinner to be<br />\nFavorite Selections<br />\nbrought<br />\nbefore the court, which<br />\nFRATERN<br />\nITIES<br />\n°11.ege and the Polytechnic Insti- held at the Westmoreland Club, 8. SAXOPHONE SOLO,<br />\nproved that it is competent to<br />\n.11te• Other prep schools entered Richmond, Saturday<br />\nevening,<br />\nAll fraternity data for the<br />\nMr. Scherr<br />\nhandle most of the cases brought<br />\nin the events are Woodberry For- February 23. The subject of'Pro- 9. GLEE CLUB<br />\nHullabaloo must be turned in<br />\nbefore<br />\nit. He called attention to<br />\nto Leopold by Monday, Febest,-Lawrenceville, ..Fork Union, fessor Hollander's address will<br />\n(a) Deep in the Heart of Me,<br />\nthe<br />\nfact<br />\nruary<br />\nthat a candidate for judge<br />\n25. P. 0. Box 326.<br />\nand Washington High Schools.<br />\n\"Economic Liberalism.\"<br />\n(b) Hunter's Farewell.<br />\nContinued on page 4, col. 4.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS - LETTER, FEBRUARY 19, 1924<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nMaybe<br />\n<br />\n§<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\n<br />\nTelephone<br />\n<br />\nEditor-in-Chief<br />\nJOSEPH LEOPOLD, '24<br />\nManaging Editor<br />\nWILLIAM G. DEAN, JR., '24<br />\nAssistant Managing Editor<br />\nT. REESE MARSH, '24<br />\nAssociate Editors<br />\nRICHARD C. TILGHMAN, '25<br />\nJOHN W. PARSONS,'25<br />\nBENJAMIN T. ROME, '25<br />\nCHARLES G. HUTZLER, '24<br />\nJunior Editors<br />\nARTHUR L. NELSON, '26<br />\nERNEST A. STRATHMAN, '26<br />\nALGER G. HISS, '26<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nHAROLD S. GOODWIN, '26<br />\n<br />\nHomewood 100<br />\n<br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Mana ger<br />\nA. J. McKAY, '26<br />\nCirculation Manager<br />\nJOHN C. LEWIS, JR., '24<br />\nAssistant Business Managers<br />\nD. MILES MARRIAN,'25<br />\nG. DONALD GIESKE,'25<br />\nJOHN T. DIXON, '24<br />\nC. EUGENE TOVELL,'24<br />\nOTH0 J. KELLER, III, '26<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\n<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nBox 729 is still as glaringly<br />\nempty as a dormitory room between 10 P. M. and 3 A. M. We<br />\nhave considered the feasibility of<br />\nchanging the title to a more provocative, luring caption that<br />\nmight easily lend itself to a successful slogan of the Keep Shootin'<br />\n'Em to Shootin' 'Em type. For<br />\nexample: The Lighthouse would<br />\nsuggest Keep the Sacred Flame<br />\nAlight; The Lookout in its turn<br />\nmight Connote Be on the Lookout<br />\nfor News for The Lookout. Or we<br />\nmight approach the attack from another angle, cajoling \"with concord<br />\nof sweet sounds,\" thus:<br />\nWe here received each piece rejected<br />\nBy Dunning and his Jay.<br />\nYe authors so forlorn, dejected,<br />\nIf thrice our work in worth<br />\nThen yours will surely be selected.<br />\n*<br />\n<br />\n\"This is a degenerate age. All<br />\nour comforts have either gone or<br />\nare fast going. • • • But now,<br />\nas Mr. Micawber said when he<br />\nwas released from prison, everything is gone from us.\"<br />\n<br />\nHOMEWOOD PLAYSHOP PRENEWS FROM OTHER<br />\nSENTS THREE PLAYS<br />\nCOLLEGES<br />\nextremely<br />\nThe<br />\nHomewood Playshop preUniversity<br />\nis<br />\nMcGill<br />\nactive in winter sports. Swim- sented two comedies, \"For Disming, hockey, basketball and snow tinguished Service\" and \"Atmossports are occupying the McGill phere\", and a more serious play,<br />\nathletes. The swimming team re- \"The Rising of the Moon\", last<br />\ncently won the Collegiate Cham- Thursday, Friday and Saturday<br />\npionship of Canada by defeating nights in their little theatre on<br />\nthe University of Toronto. Great the Hopkins campus. The plays<br />\ninterest is likewise being shown in were an excellent example of the<br />\na series of debates between Law work that the Playshop has been<br />\nand Theological students on the doing and they continued their<br />\nquestion whether the law or the<br />\nmany dramatic successes.<br />\nministry offer more service to the<br />\nSince the fall of the Cushing recommunity. The ministers have<br />\ngime, the Homewood Playshop<br />\na temporary lead.<br />\nhas 'taken an aspect truly representative<br />\nof Hopkins. Everyone<br />\nThe University of Vermont is<br />\ntrying to find a suitable method of who took part in the production<br />\nhandling a Frosh-Soph Rush.<br />\nThey are inquiring among various<br />\ncolleges and the \"Vermont Cynic\"<br />\nis printing the various types of<br />\nrushes. They all seem to resemble the Hopkins football rush, as<br />\nheld in 1922.<br />\n* * *<br />\n<br />\nwas directly connected with the<br />\nUniversity. Those who deserve<br />\nparticular mention in their resective 'parts in last week's productions are: Dr. F. A. Litz, Ruth E.<br />\nBrandau, Gertrude Schanze and<br />\nEleanor A. Whiting.<br />\n<br />\nRichmond University is running a winter basketball league SHIRTS<br />\nNECKWEAR<br />\namong the various fraternities.<br />\nLeFranc & Ault<br />\nKappa Sigma is in the lead at<br />\n421 N. HOWARD ST.<br />\npresent. The \"Richmond Collegian\" is interested in the number HOSIERY<br />\nGLOVES<br />\nof Hopkins students who are participating in fall athletics; it<br />\nseems to regard thirty-three per<br />\ncent. as a pretty high rate.<br />\n*<br />\n<br />\nThe death of President Wilson<br />\nSo laments Arthur Machen in<br />\nhas<br />\nbrought a large number of<br />\nhis prologue and epilogue to<br />\nncidents<br />\nin his college life to light.<br />\nWhere are the Fogs of Yesteryear,<br />\nA<br />\nnumber<br />\nof papers commented<br />\none of several delightful essays reA BIG WEEK<br />\non<br />\nthe<br />\ncoincidence of his death,<br />\ncently published by Knopf under<br />\nVaried attractions are offered to followers of Hopkins' activities the title Dog and Duck, the name of with the announcement that his<br />\nthis week. The Musical Club's Home Concert on Thursday. The the firSt of the group. Alas, it is classmate at Hopkins, Dr. Levermore, had just won the Bok Peace<br />\nBowery Ball on Friday, and the annual Hopkins Fifth Regiment all too true and the latest remnant<br />\nof olden times to go from us is Prize. The \"Black and White\"<br />\nGames on Saturday should prove tempting to even the most discrimthe familiar Just Sixer. Many have records that he coached the footinating.<br />\nsung of the glories of the Phi ball team at Weslyian during the<br />\nNeatly combed, well- ept hair is a<br />\nbusiness and social asset.<br />\nThe teams<br />\nThose who have witnessed a Musical Club's performance during Beta Kappa men; but few have period of 1889-91.<br />\nSTACOMB makes the hair stay combed<br />\nin any style you like even after it has<br />\nskill and daring of there during Mr. Wilson's period<br />\nthe present season or have attended a Home Concert in other years appreciated the<br />\njust been washed.<br />\nthe student who always managed to of coaching were uniformly sucSTACOMB—the original—has been<br />\nwill vouch for the variety and quality of this program. The Junior<br />\nused for years by stars of stage and<br />\nget \"just six.\" \"All, all are gone, cessful. One incident is rememscreen—leaders of style. Write today<br />\nClass has unearthed a novel and interesting substitute for the Junior the old familiar faces\"; the Just bered. Weslyan was being defor free trial tube.<br />\nTubes-35c Jars-75c<br />\nProm in the Bowery Ball and it is reported that the quota of tickets Sixer has succumbed to the ever- feated by Lafayette. The cheerInsist on STACOMB—in the black,<br />\nfor this affair has already been disposed of. A large number of na- increasing austerity of life. The ing was becoming disorganized.<br />\nyellow and gold package.<br />\nFor sale at your druggist or wherever<br />\nSuddenly<br />\na<br />\nfigure<br />\nin<br />\na<br />\nblack<br />\noveredict<br />\nwhich<br />\nprevents<br />\ngraduation<br />\nof<br />\ntionally known track stars will be seen at the Fifth Regiment Armory<br />\ntoilet goods are sold.<br />\nthe \"scholar\" with more than a pair coat sprang in front of the stands,<br />\nStandard Laboratories, Inc.<br />\non Saturday and the Johns Hopkins squad will be forced to extend<br />\n750 Stanford Avenue Los Angeles, California<br />\nof sixes in his hand has destroyed and beating time with an umbrelSend coupon for Free Trial Tube.<br />\nitself in order to maintain the reputation that it has gained.<br />\nthis picturesque figure of a former la, he led the cheers in a clear<br />\nSTANDARD LABORATORIES,Inc.<br />\n750 Stanford Ave.. Lou Angeles, California, Dept. 1<br />\nProfessors no longer tenor voice, inspiring the team to<br />\nHopkins men will not be able to complain of boredom this week- period.<br />\nPlease send me free trial tube.<br />\ncrown the courageous individual tie the score. He was -Woodrow<br />\nName<br />\nend.<br />\nAddress<br />\nwith a six; the student with a bit Wilson.<br />\nof fire in his blood no longer accepts the challenge embodied in<br />\n\"THE GALLOPER\" ENTERS<br />\nstriving for a six. Mourn, oh ye<br />\nThe Barnstormers have at last succeeded in obtaining copies of unromantic, Just Sixer is dead.<br />\n\"The Galloper\" by Richard Harding Davis and weekly rehearsals for<br />\n* * *<br />\nthe annual production in March have begun. Before much progress<br />\n\"Surely it would not be too much<br />\ncan be made, however, it is necessary that more men enter into comto<br />\nexpect the faculty of Johns Hoppetition for places in the cast. \"The Galloper\" requires twenty-three<br />\nkins<br />\nto allow the undergraduates<br />\ncharacters and, as the Clubs uses at least one understudy for each role,<br />\nan intermission of such a short peran enrollment of approximately fifty men is essential before even a<br />\niod as one day.\"—From the letter<br />\nbeginning can be made.<br />\nof an Engineering Junior, which<br />\nThe Barnstormers are handicapped this year by lack of time ;n requested an \"intermission\" after<br />\nHE constant'<br />\nexams.<br />\nwhich to prepare. Temporary selections for the cast will be made in<br />\nsmoker finds<br />\nAs much as four months holiday,<br />\na few days. It is probable that many a histrionic gem of purest ray<br />\nin Melachrino<br />\nserene is concealed on the campus, unconscious of his inherent ability. observes T. Whiteley, have been<br />\nCigarettes a deliAnd the Barnstormers need candidates badly. An opportunity is granted some students.<br />\ncacy of flavor of<br />\nopen for would-be actors to demonstrate their ability and to gain<br />\n* * *<br />\nwhich he never<br />\nmembership in the Club, the latter being one of the most sought-for<br />\n\"Teachers should have a missiontires.<br />\nhonors on the campus.<br />\nary spirit and to insure this they<br />\nDramatic Club productions in past years have been of the highest must be paid less than they are<br />\ntype of amateur productions. It is essential that the Barnstormers worth.\"—From Dr. Richmond's<br />\nORIGINAL<br />\nmaintain this prestige. Co-operation from the student body is, how- speech against the raising of college instructors' salaries, as quoted<br />\never, essential.<br />\nin last Friday's NEWS-LETTER.<br />\nE. Strathman suggests that, in ac\"The One Cigarette Sold the World Cover\"<br />\nThe News-Letter will appear on Thursday this week instead of cordance with this plan, said salaries be paid in German marks.<br />\nFriday. Copy for next Tuesday's issue to be turned in Thursday.<br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 19, 1924<br />\n<br />\nFor<br />\n<br />\nunruly iair<br />\n<br />\nT<br />\n<br />\nMELACHRINO<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 19, 1924<br />\nMOCK TRIALS OF MILITARY BLACK AND BLUE TRACK FRESHMAN SMOKER CALLED<br />\nLAW INTEREST STUDENTS<br />\nMEN TO COMPETE IN<br />\nOFF AT LATE HOUR<br />\nGEORGETOWN GAMES<br />\nTwo mock trials now being<br />\nLack of support on the part of<br />\nTwelve men will represent the class caused the Freshman<br />\nconducted by students of Military<br />\nJohns<br />\nHopkins in the twenty-sec- Smoker Committee to postpone inScience are arousing consideraond Annual Indoor GameS of the definitely the smoker, which was<br />\nble interest on the campus. They<br />\nGeorgetown University Athletic to have been held last Friday<br />\nare held under the supervision of Association<br />\nat Convention Hall, night at the Southern Hotel. Acthe Military Department as a part Washington, on Thursday night. cording to Schwinn, the chairman<br />\nof the course of instruction in mil- Manager Geib has entered the of the committee, only 26 tickets<br />\nitary law. The course is given squad in nine events. The meet had been sold.<br />\nElaborate arrangementas for the<br />\nannually to Juniors for six weeks. precedes the Johns Hopkins-Fifth<br />\nRegiment Indoor Games by two smoker had been made, and a<br />\nThis year, however, is the first<br />\nnights and will provide a good number of musical renditions and<br />\ntime that the trials have been<br />\nwork-out for the team.<br />\nspeeches had been prepared. Tbe<br />\nbased upon actual occurrences.<br />\nHopkins entries will compete in members of the Freshman football<br />\nThe change in the system was nethe 16-pound shotput, 50-yard team, and their coach, \"Tom\"<br />\ncessitated by the fact that imagdash, 50-yard hurdles, 600-yard Landy, were to have been guests<br />\ninary cases caused conflicting tesnovice run, 880-yard run, mile run, of honor. Landy was to have pretimony and a troublesome free440-yard dash, two-mile run, and sented the class numerals, and<br />\ndom in the play of the imaginabroad jump. Other events will Schwinn was to have been toasttion.<br />\ninclude a relay between Navy, Le- master. In conclusion, there was<br />\nThe circumstances of the first<br />\nhigh and Pensylvania and a 4n0- to have been a fitting ceremony in<br />\ncase are as follows: \"On or about<br />\nmeter dash between Fitch of the memory of the departed members<br />\nJanuary 10, 1924, at about 3.00<br />\nUniversity of Illinois, National who had succumbed to the late<br />\nP. M., on the target range in GilSenior A. A. U. 440-yard cham- examinations. The cost of the<br />\nman Hall, Cpl. J. Tasche, Band,<br />\npion, and Ascher, of Georgetown. tickets, which will be refunded to<br />\nHdqrs. Co., 1st Regiment, InfantProbably the feature event of the the patriotic few, was $1.25.<br />\nry, aimed a loaded air rifle at Cpl.<br />\nevening will be the 1500-meter<br />\nAccording to ,some members of<br />\nMarx S. Kaufman, Band, Hdqrs.<br />\nrun. Entries in this event include<br />\nthe '27, the smoker was not<br />\nCo., 1st Regiment, Infantry, and<br />\nJoey Ray, Illinois A. C.; Jim Con- sufficiently<br />\nadvertised, in that<br />\ndischarged the same, the bullet<br />\nnelly, Newark A. C.; Mike Deva- many<br />\nof the members did not seem<br />\nstriking Cpl. Kaufman, thereby<br />\nney, Millrose A. C., and Brooks,<br />\nto know the date set for it. This<br />\ninflicting a slight injury.<br />\nof Georgetown.<br />\nfact<br />\nis generally held to account<br />\nShot Fired Intentionally<br />\nThe Hopkins entries follow:<br />\nfor the amazing lack of support.<br />\nThe \"trial\" was, held in the<br />\n16-pound Shot-put—Gilpin and<br />\nAccording to the committee, the<br />\nSouth Loft, Gilman Hall, on the Kaplan.<br />\nsmoker<br />\nproject has not been abanafternoons of February 11 and 12. 50-Yard Dash—Clarke, Balls,<br />\ndoned,<br />\nbut<br />\nwill be taken up again<br />\nAfter a hard fight the plaintiff Brown, C., Block and Heyn.<br />\nsucceeded in proving that Corpo50-Yard Hurdles—Brown, C. at a later date. They believe that<br />\nit will be an invaluable \"get toral Tasche had fired the shot and Block, Gilliece.<br />\ngether\"<br />\ninfluence for the class of<br />\nhad fired i intentionally.<br />\nIt<br />\n600-Yard Novice—Meredith.<br />\n'27.<br />\ncould not be proved, however, that<br />\n880-Yard Run—Wasson and<br />\nthe accused had used a weapon ca- Norwood.<br />\npable of inflicting a dangerous<br />\n1 Mile—Booth (captain) and NEWLY ORGANIZED TEAM<br />\nwound. The Court called upon Wasson.<br />\nTO MEET HOPKINS IN<br />\nsix witnesses in the process of the<br />\nLACROSSE.GAME<br />\n440-Yard Dash—Heyn, Nortrial.<br />\nL'Hirondelle Club to Play at Homewood<br />\nwood and Clarke.<br />\non April 12. Black List<br />\nColorfel-C-. G. Post, 1st -Infant2-Mile ,Run—Pooth (captain).<br />\nAffects Team<br />\nry, acted as president of the<br />\nBroad jump—Gilliece.<br />\nA<br />\nnew<br />\nin the firmament of<br />\nstar<br />\nCourt.<br />\nlacrosse has appeared on the schedThe circumstances of the secINTELLIGENCE TESTS<br />\nule of the J. H. U. team as was anond \"trial\" are as follows: \"SerI have just seen the announcenounced ill the News-Letter sevgeant T. S. Summers, Co. A, 1st ment of the result of<br />\nthe applicaeral weeks ago. This is the L'HiInf., refused to stop smoking tion of the intelligence<br />\ntests used<br />\nrondelle Lacrosse Club of Ruxton,<br />\nwhen ordered to do so by his su- by the Army to a number<br />\nof sucwhich was organized during the<br />\nperior officer, Lieutenant C. G. cessful business men.<br />\nrecent Christmas vacation by a<br />\nPost. Sergeant Summers left the<br />\nThe result showed that 80 per<br />\ngroup of former Hopkins stickclass room against a direct order<br />\ncent. of them passed the test, but<br />\nwielders. The new club has seof Lieutenant Post not to do so.<br />\nsome of the most successful were<br />\ncured<br />\non its roster a number of<br />\nSergeant Summers was disrespectamong the 20 per cent. that failed.<br />\nformer<br />\nplayers of other colleges<br />\nful and insubordinate to LieutenWhether this result condemns<br />\nand a large quota of unattached<br />\nant Post in calling Lieutenant<br />\nthe 20 per cent, of business men<br />\nlacrosse players, besides the exPost a damn fool, or using words<br />\nor the tests used, I will not diswearers of the Black and Blue.<br />\nto that effect.\"<br />\ncuss.<br />\nAccording to J. Wistar Huey, J.<br />\nThree Sittings Required<br />\nHowever, the conclusion may H. U., '23, one of the organizers<br />\nThe quantity of defense offered be drawn from this<br />\ntest that in- of the Ruxton team, the new club<br />\nby the accused ca:used this trial to telligence is not as necessary<br />\nto is intended to spread the enthusirequire three separate sittings of success in life as some<br />\nother qual- asm for lacrosse which has grown<br />\nthe Court. It was held on the aft- ities going to make<br />\nup a man's so rapidly in the last few years.<br />\nernoons of February 13, 14 and 20. personality. It<br />\nis also well known<br />\nThis newly founded lacrosse<br />\nColonel F. T. Bates was president that<br />\na college education is not club will be seen<br />\nill action on<br />\nof the Court, which required the necessary<br />\nto success, on the con- Homewood Field on<br />\nthe 12th of<br />\ntestimony of seven witnesses. The trary<br />\nwith some individuals it is April, when they cross<br />\nsticks with<br />\ndefense offered strong proof to a handicap.<br />\nthe<br />\nJohns<br />\nHopkins<br />\nteam,<br />\njust -one<br />\nshow that Sergeant Summers did<br />\nIt is presumed that you college week after the latter's game with<br />\nnot consider the instructions of<br />\nmen will have intelligence and the Alumni.<br />\nLieutenant Post an order.<br />\neducation, but since it is not inThe second trial was based upon<br />\ntelligence and not education that<br />\na secretly pre-arranged occurrence<br />\nis the absolute quality that is necin a class in Military Science.<br />\nessary, it is not of the most urThe histrionic abilities of the<br />\ngent importance that you should<br />\nprinciples were so pronounced<br />\nassiduously cultivate the other<br />\nthat the witnesses believed that<br />\nqualities that enter into the makthey were testifying as to an actuing of a successful personality.<br />\nDamon—<br />\nal happening.<br />\n\"What's the matter?<br />\nSome of these are good manIn both cases the entire Courts<br />\nCan't you read your<br />\nners, a pleasant and kindly disponotes of the lecture?\"<br />\nwere composed of students.<br />\nsition, and a neat and well kept<br />\nPythias—<br />\nappearance. Well kept appear\"No—doggone it. I<br />\nskipped over to class<br />\nance is not the least of these qualthis morning without<br />\nities and is one that may be acmy Dixon's Eldorado!\"<br />\nNOTICE<br />\nquired by all who will take the<br />\n17 leads—all dealers<br />\nSwimming Meet, Hopkins<br />\ntrouble.<br />\nvs. Lehigh, B. A. C., FebruDIXON<br />\n'<br />\nS<br />\nTo have a well kept appearary 29, 8.00 P. M. Dancing<br />\nance you must wear a starched<br />\nEthORADO<br />\nafter the meet.<br />\ncollar, and should patronize the<br />\n?he masterdrawingpenal\"<br />\nYale Laundry.-Advertisement.<br />\n<br />\n3<br />\n<br />\nYou won't fumble this cap!<br />\nProfessional jugglers could handle the oldstyle shaving cream caps and never once drop<br />\none down the drain or under the bath tub.<br />\nBut for most of us, this new Williams HingeCap puts an end to an ancient nuisance.<br />\nWilliams Shaving Cream is just as much<br />\npleasanter to use as is the Hinge-Cap. It<br />\nsoftens the beard with uncanny speed. The<br />\nthicker lather holds the moisture in against<br />\nthe skin where it is needed. This lather lubricates the skin, too, so that painful razor<br />\nfriction is eliminated. And when your shave<br />\nis done, that famous ingredient in Williams<br />\nwhich helps the skin, leaves your face cool,<br />\nsoothed and refreshed. No coloring matter<br />\nis used in Williams — it is a pure, naturalwhite shaving cream.<br />\n<br />\nWilliams<br />\nShaving Cream<br />\n<br />\nALWAYS USE A<br />\n<br />\nYELLOW CAB<br />\n<br />\nROBBIN'S STYLE BUILT HATS<br />\n<br />\nOR PHONE<br />\n<br />\nFOR YOUNG MEN<br />\n<br />\nVERNON 1212<br />\n<br />\n122 W. BALTIMORE ST.<br />\n<br />\nHAIL THEM ANYWHERE<br />\n<br />\n:77V<br />\n<br />\nII<br />\n<br />\nPAA1<br />\n<br />\nThe Best<br />\nBusiness Career<br />\n<br />\n‘<br />\nIf4<br />\n<br />\nS what every ambitious senior is<br />\nthinking about at the present<br />\ntime. Life insurance is one of the<br />\nbest, one of the most desirable, and<br />\none of the most satisfactory as a<br />\npermanent calling.<br />\nIn assets and volume of business,<br />\nlife insurance is one of the three<br />\nleading businesses of this country,<br />\nyet the field is comparatively underdeveloped. Only 7 per cent of the<br />\neconomic value of human life in the<br />\nUnited States is covered by insurance.This gives an idea ofthe big field<br />\nstill to be worked,especially business<br />\ninsurance for firms and corporations.<br />\nAs to remuneration: Reports of<br />\ncollege graduates who have entered<br />\nbusiness indicate that life insurance is<br />\nat the very top as a source of income.<br />\nNow is the time for you to consider<br />\nwhat you are going to do after graduation. If you are ambitious and willing to work hard and are interested to<br />\nknow about life insurance, address<br />\n<br />\nkfi4<br />\n<br />\nrot<br />\n<br />\nI<br />\n<br />\nkr1<br />\n'l;:1<br />\nC1:' r:11<br />\n<br />\nrtp9.1<br />\nrftl<br />\n<br />\n4.9.1<br />\n,44;(<br />\nrt,9i<br />\n<br />\n:<br />\n::<br />\n114*14<br />\nrecif<br />\ntY14<br />\n<br />\ntOA!<br />\n<br />\nPOI<br />\n<br />\n?IA<br />\nrfi•Z<br />\n411<br />\nPAf<br />\n<br />\n1.441<br />\n<br />\nr/1-4j<br />\n<br />\nAgency Department<br />\ntkt4<br />\n<br />\nrA-N<br />\n<br />\n01<br />\nFA<br />\n9<br />\n1<br />\n<br />\nteim<br />\n<br />\nAL.<br />\n<br />\nEt1<br />\nYa,<br />\n<br />\nLIFE INSURANCE COMPANY<br />\nOF BOSTON. MASSACHUSETTS<br />\n<br />\nSixty-one years in business. Now insuring One Billion Seven<br />\nHundred Million Dollars in policies on 3,250,000 lives<br />\n<br />\nkf<br />\nfii<br />\nfkrd<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 19, 1924<br />\n<br />\n4<br />\n<br />\nWALES ELECTED PRESIDENT ELECTION AND ANNOUNCE- DR. PAUL HARRISSON ADDRESSES<br />\nASSEMBLY<br />\nMENT OF SHOW FEAOF CAMPUS CLUB FOR<br />\nContinued from page 1<br />\nTURE ELECTRICAL<br />\nNEXT YEAR<br />\ndom of God.\" Dr. Harrison was<br />\nCLUB MEETING<br />\non<br />\nDormitory<br />\nSmoker to Be Held in<br />\nnot allowed to stop here; but was<br />\nMarch 17th<br />\nAt the Electrical Club meeting<br />\nback by his audience for one<br />\ncalled<br />\nRalph G. Wales was elected pres- held last Friday afternoon at 4:30<br />\nstory.<br />\nmore<br />\nident of the Johns Hopkins Campus<br />\nP. M.in the Mechanical EngineerH. M. Smallwood, President of<br />\nClub for the year 1924-25, at a<br />\nthe<br />\nBarnstormers, announced that<br />\nBuilding, J. V. Alfrend, chairmeeting held for the election of of- ing<br />\nOf course you know that<br />\nthe club has selected \"The Galficers last Friday in Gilman Hall. man of the Engineering Show<br />\nThe Barn is handling orders<br />\nRichloper,\" a three-act farce by<br />\nWales entered on his duties at once, Committee, announced the final<br />\nour clothes again this<br />\nfor<br />\nard Harding Davis, for presentasucceeding Ben Thomas, whose plans and the dates for the show.<br />\nyear.<br />\ntion this year. He urged that acterm expired at that time. The It will be held in the Mechanical<br />\ntive support be given the BarnThe plan worked to<br />\nother officers elected were ,vice-pres- and Electrical Engineering Buildstormers, for they have only six<br />\nmutual advantage last seaident, Shipley; secretary, Parsons;<br />\n\"The<br />\nApril 4th, from 3 weeks in which to prepare for the<br />\ning<br />\non<br />\nFriday,<br />\nand we're mighty glad<br />\nson,<br />\ntreasurer, Wienefeld ; sergeant-atcasts<br />\nwill<br />\nbe<br />\nproduction.<br />\nTwo<br />\nINK<br />\ncontinue<br />\nthe relationto<br />\nto 5:30 in the afterndon and then<br />\ninns, Gilliece.<br />\ncandidates<br />\nfor<br />\nthe<br />\npicked,<br />\nand<br />\nship.<br />\nfrom 8 to 10:30 at night. From 3<br />\nThat Made the Fountain Pen POSSIBLE\"<br />\nClub to Hold Smoker<br />\nparts are wanted.<br />\nSuits<br />\n$30 up<br />\nReady-to-wear<br />\nJim Alfriend, reporting for the to 5:30 the next day, the show<br />\nThe February number of the<br />\nReady-to-wear O'Coats . $35 up<br />\nsmoker committee, stated that he will be repeated. That night a<br />\nBlack and Blue Jay has gone to<br />\nhad secured the use of the Com- dance will be held in the audito211-213 E. Baltimore St.<br />\npress and will be out for distrimons Room of the Alumni dormi- rium of the Civil<br />\nEngineeriii bution at the end of the month.<br />\ntory for a smoker. The club apBuilding. Among the stunts to The copy and sketches are very<br />\nproved of the date, March 17th,<br />\nEINEIHEIDIREWEINEINN E44444144<br />\nbe included in the engineering unique and the magazine will 44 4444014<br />\nwhich Alfriend proposed. He also<br />\nprove very interesting. Further<br />\nshow<br />\nwill<br />\nbe<br />\na<br />\nHuman<br />\nDynamo,<br />\nstated that the charge would be limRevolving Electrons, Jumping interest is being added by an atited to one dollar.<br />\nCoils, Wireless Lights, X-Ray tractive cover in striking colors.<br />\nCilb<br />\nm eXatterie)<br />\nThe smoker is to be the first so'<br />\n34 ES H.& OSCAR G.1011r<br />\nmachines, Submarine Magnets, The March issue will be very ,<br />\n\\BCfn<br />\nD<br />\ncial gathering that the ,Campus Club<br />\noriginal. Title of the issue is \"The<br />\nOWNERS<br />\nhigh<br />\ntension<br />\nsparksand<br />\nvarious<br />\nwill have held. Alfriend stated<br />\nIDTOM<br />\n• .44114<br />\n(<br />\n7'4'11bE*\"1+<br />\nother engineering phenomena. Caveman Number.\" A number of<br />\nthat he had arranged for a light<br />\n29 E. BALTIMORE ST.<br />\npertaining<br />\nto<br />\nthe<br />\ntitle<br />\nare<br />\nThere will also be displays of sketches<br />\n\"The King of Lubricants\"<br />\nAgents for JOHN B. STETSON HATS buffet supper to be served during standard engineering<br />\napparatus, already under way and with the<br />\nand FRATERNITY BANDS<br />\nthe evening. He also declared that<br />\nsuch as thermocouples, Wheat- \"caveman stuff\" of the Editorial<br />\nSHERWOOD BROTHERS, INC.<br />\nthe committee had decided to restone<br />\nbridges, constant current Staff should make a magazine of<br />\nquest certain members of the club<br />\ntransformers, motor generator intense interest and amusement to gRNININgHCINNEtHHHEMENNIKIKENIZEI<br />\nBoys, the place to get your<br />\nto provide entertainment.<br />\nsets, and others. An electrical re- all.<br />\nmeals—and they are honA motion was passed to have a<br />\nproduction of Hell will be prepicture of the Campus Club put in<br />\nest-to-goodness meals, well<br />\nSENIORS WIN ADAMS DEBATE<br />\nsented to warn the erring engiis<br />\nto<br />\nbe<br />\nThe<br />\npicture<br />\nHullabaloo.<br />\nthe<br />\nContinued from page I<br />\ns erve d, and reasonably<br />\ncause them to mend<br />\ntype used by various other neers and<br />\nof<br />\nthe<br />\nmust receive a majority vote from<br />\npriced—is at<br />\nWe want a live wire salesman<br />\norganizations, with the list of mem- their ways.<br />\nall<br />\nnations.<br />\nA<br />\nclause<br />\nfrom<br />\nthe<br />\nto<br />\nrepresent us on the campus.<br />\nThe men in charge of the show<br />\nbers to be placed below the picture.<br />\nOne who wishes to make some<br />\nCourt<br />\nagreement<br />\nof<br />\nthe<br />\nWorld<br />\nhave obtained liberal support on<br />\neasy money putting in a few<br />\nall hands. The faculty have was read, which said that nothing hours of spare time—interviewing<br />\ngranted permission to all the men in its proceedings would be con- profs- and students—to sell<br />\nFor<br />\nFor<br />\nparticipating in • the show to be trary to the Monroe Doctrine. Mr. Ford Cars. To the right man we<br />\nGENERAL absent from laboratories on Fri- Schapiro said that we have always have a regular position when colFOUNTAIN<br />\n1817 N. Charles St.<br />\nlege closes. Call immediately at<br />\nUSE<br />\nPENS<br />\nday and Saturday, and have also had political isolation, and we can<br />\n325 Park Avenue. Ask for Mr.<br />\nwi<br />\nAl<br />\nother<br />\nnations<br />\nmore<br />\narbitrate<br />\n(Half Block below North Ave.)<br />\nallowed the use of all engineering<br />\nManufactured by<br />\nLong or Mr. Watson.<br />\nsuccessfully<br />\nwithout<br />\nthe<br />\nWorld<br />\nWIGHT & HUMPHRIES<br />\napparatus belonging to the UniNicholas Brown, Mgr.<br />\nirersity. The Physics Depart- Court. He asked the pertinent<br />\nquestion that if the court has the<br />\nPR1RTERS •—• 13111DERS ment and the Military DepartED.GRAVERS<br />\nment are loaning certain special power to settle disputes, why does<br />\n325 PARK AVENUE<br />\napparatus required in the displays. it not solve some of present grave<br />\nBesides the members of the problems of Europe.<br />\nCollecle Literature<br />\nThe judges, 1Mr. Henry C. EvElectrical Engineering DepartLIBERTY ST.<br />\nans,<br />\n'18; Mr. Morton K. Rothment, some members of the Civil<br />\nAT SARATOGA<br />\nand Mechanical Engineering De- schild, '18, and Dr. L. S. Hulburt,<br />\nCollegiate<br />\nProfessor<br />\nof<br />\nMathematpartments are participating in thc<br />\nLUNCHEON<br />\nics, decided in favor of the Senior<br />\nstunts.<br />\nTEA<br />\nFollowing the discussion of the team by a 2-1 vote.<br />\nDINNER<br />\nSelections were given by the<br />\nEngineering Show, an election of<br />\nofficers from the Junior Class to undergraduate orchestra during<br />\nSPECIAL PARTIES<br />\n11.30 A. M.<br />\nrun the society for the rest of this the course of the debate, and at<br />\nuntil<br />\nyear and next year, was held. its close music was furnished for 7.30 P. M<br />\nPLAZA 6987<br />\nThose elected are as follows: an informal dance.<br />\nPresident, J. Albert Pledge; viceCSomething new in portable<br />\nBE A NEWSPAPER CORRESPONDENT<br />\npresident, Martin J. Urner ; sectypewriters.<br />\nwith the Heacock Plan and earn a good income while learning;<br />\nBartholomaeus ;<br />\nretary, John<br />\n(Lit writes nearly all lanwe show you how; begin actual work at once; all or spare time;<br />\ntreasurer, C. Robert Brown;<br />\nguages.<br />\nexperience unnecessary; no canvassing; send for particulars.<br />\nChairman program committee.<br />\nNEWSWRITERS TRAINING BUREAU<br />\n41,Has 90 characters.<br />\nFrank B. Crider; Chairman pub•<br />\nPrinters of<br />\nBuffalo, N. Y.<br />\nlicity committee, Harry TylotY<br />\nSee Fred Rich, College<br />\ncrhe Johns Hopkins<br />\nChairman membershib commitRepresentative<br />\ntee, Sigmund K. Waldorf.<br />\nNE1DS,LETTER<br />\n118 W. FAYETTE ST.<br />\nThe retiring president, J. TilBALTIMORE, MD.<br />\nDixon, was given .a rising<br />\nlotson<br />\nLOMI3ARD and SOUTH STREETS<br />\nand individuality is offered here at prices that are not<br />\nvote of thanks for his services to<br />\nand cannot be underquoted by any house at any time.<br />\nthe club during the past year.<br />\n(,Besides the reputation of an old-established firm<br />\nThe rest of the meeting was deThe Greetings of a Fine Store<br />\nis back of each sale with a guarantee.<br />\nvoted to the reading of papers<br />\nTo the Students of a Fine University<br />\nengia<br />\nprominent<br />\npublished by<br />\nneering concern dealing with matters of great interest to engineer- FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\ning graduates.<br />\n343 NORTH CHARLES STREET<br />\nThe first paper, \"Application<br />\nEngineering\", dealt with a new<br />\nphase of engineering, the selecRENT A CAR<br />\ntion of certain kinds of apparatus<br />\nfor particular demands. Another<br />\npaper,\"Artistry in Salesmanship,\"<br />\nexplained the problems which<br />\nDODGES, 18c PER MILE<br />\nmust be faced by the salesman of FORDS, 12c PER MILE<br />\nengineering apparatus. The third<br />\n13 SOUTH ST.<br />\nSpecial Reduced Rates for 50 Miles or More<br />\npaper, \"The Designer of Electrical Machinery,\" explained the<br />\nDRIVE IT YOURSELF CO.<br />\nJohn J. Nelligan, President requisites for a 'good designer of<br />\nOrganized 1864<br />\nVERNON 4049<br />\n1725 NORTH CHARLES ST.<br />\nelectrical machinery.<br />\n<br />\nRef 1 With<br />\nORD'S<br />\n<br />\nCLOTHES<br />\n<br />\n011112<br />\n<br />\nSALESMAN:<br />\n<br />\nThe St. REGIS<br />\n<br />\nI. I.<br />\n<br />\nRESTAURANT<br />\n<br />\nVO<br />\n<br />\nCi<br />\n<br />\nDr<br />\n<br />\nA.<br />\nth(<br />\non<br />\nbe,<br />\nno<br />\nye<br />\nth<br />\nlo\\<br />\n13a<br />\nPri<br />\ner(<br />\nth<br />\nin;<br />\nGo<br />\ncis<br />\nMt<br />\nan:<br />\nHc<br />\n<br />\niii(<br />\nlie<br />\n<br />\nasi<br />\nat<br />\nocc<br />\nsit:<br />\n<br />\nPoi<br />\n<br />\nre<br />\nfal<br />\nTIT<br />\ntic<br />\n<br />\n11,1(<br />\n<br />\ntill<br />\n<br />\nOn<br />\n<br />\nwi<br />\n<br />\nC. A. GOODWIN<br />\n<br />\nCORONA<br />\nHave you<br />\nseen it?<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nHOCHSCHILD.KOHN 8c Co.<br />\n<br />\nSafe Deposit & Trust Co.<br />\nOF BALTIMORE<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nDRIVE IT YOURSELF<br />\n<br />\nWi<br />\n<br />\nPa<br />\nas<br />\nTi<br />\nPr<br />\nwl<br />\nlg<br />\n<br />\nSO<br />\nAi<br />\nSit<br />\nLi<br />\n<br />\nSo<br />\n<br />\nch<br />\nPc<br />\ntic<br />\nea<br />\n<br />\nCl<br />\n<br />\nSp<br />\n<br />\n18<br />\ngr<br />\n<br />\nsa<br />\nN<br />\nam<br />\ntic<br />\nw,<br />\n1C<br />\n<br />\nty<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVIII, No 34<br /><br />\nHOMEWOOD, BALTIMORE. MD., FEBRUARY 19, 1924<br /><br />\nPRICE 5 CENTS<br /><br />\nMANY COLLEGE ATHLETES BARNSTORMERS HOLD FIRST<br />\nMUSICAL CLUB CONDR. PAUL HARRISON TELLS SENIORS<br />\nDEFEAT JUNIOR<br />\nTO RUN IN HOPKINS<br />\nREHEARSAL FOR ANCERT THURSDAY<br />\nABOUT EXPERIENCES<br />\nTEAM<br />\nIN ANNUAL<br />\nTRACK MEET<br />\nNUAL PRODUCTION<br />\nEVENING<br />\nIN ARABIA<br />\nADAMS<br />\nDEBATE<br />\nJimm y Patterson, One-time Champion, Thirty Men Out. The Galloper to Be<br />\nThe annual home concert<br />\nMedical School Graduate Gives Assem- World Court Upheld by<br />\nto Run in Sprints. Prep Schools<br />\nPresented at the Lyric on March 28<br />\nUpperclassmen<br />\nbly Rare Treat With Stories of<br />\nof the Musical Club will be<br />\nin Spirited Debate<br />\nAlso to Be Rep:esented<br />\nand 29. Only Six Weeks of ReNative Life<br />\npresented Thursday evening,<br />\nhearsal<br />\nBruno Hills, Princeton chamat 8.30 P. M. in the AudiAt the assembly last Thursday, The Class of '24 emerged vicThirty<br />\ntorium<br />\nmen turned out last Friof the Maryland CasDr. Paul Harrison, a graduate of torious in the twenty-seventh anpion weight man of the United<br />\nualty<br />\nClub<br />\nHouse.<br />\nconThis<br />\nday night for the first rehearsal of<br />\nthe Hopkins Medical School, gave naul Adams Interclass Debate,<br />\nStates, will lead a large delegation<br />\ncert<br />\nthe<br />\nis<br />\nsingle<br />\nappearan<br />\nce<br />\nThe Galloper, a three-act farce by<br />\nextracts from a modernized \"Ara- when her debating team defeated<br />\nof the Musical Club in Baltiof Princeton track stars in the Richard Harding<br />\nDavis, to be prebian Nights,\" to the great delight the representatives of '25. The<br />\nmore during the season. The<br />\nHopkins Fifth Regiment Games sented by the Barnstormers on<br />\nconcert will be followed by a<br />\nof an enthusiastic audience. Long subject of the debate, which was<br />\non Saturday night, according to a March 28 and 29. The play was<br />\ndance in the Ball Room.<br />\nservice as a missionary has earned held last Saturday night in the<br />\nrecent report from the Athletic outlined to the men and the first<br />\nEvery student is entitled to<br />\nfor Dr. Harrison the title \"The Civil Engineering Hall, was,\"Reone ticket on his non-athletic<br />\nOffice at Homewood. Princeton's act read through and rehearsed,<br />\nProphet of Arabia\"; and his nu- solved, That the United States<br />\ncard. Extra tickets may be<br />\nentrants will compete in a large temporary parts being given to<br />\nmerous anecdotes show that he is should enter the World Court.\"<br />\npurchased for $1.50.<br />\nnumber of race and field events. members of the club to enable a<br />\njustly credited with familiarity The question is one of timely inOther late entries include- large first reading.<br />\nterest and proved of absorbing inFREDERICK<br />\nENTERTAINED with Arabian life.<br />\neelegations from Penn State and<br />\nBY BLUE JAY MUSICIANS<br />\nAccording to President Hugh M.<br />\nThe globe-trotter's first impres- terest to the fairly large audience.<br />\nWest Virginia.<br />\nJ. Edward Mount, president of<br />\nAT HOOD COLLEGE<br />\nSmallwood, of the Barnstormers,<br />\nsion is that Arabs are extremely<br />\nAmong the West Virginia en- The Galloper is the best<br />\nsuited play Large Audience Hears Hopkins Per- dirty. This first impression is, en- the Debating Council, started the<br />\nformance. Dance Follows Extries is D'Anita, a sprint man for the needs of the club that<br />\ntirely justified by conditions in the program by explaining the essenhas<br />\ncellent Program<br />\nWho ran the 100-yard race at the ever been presented.<br />\ntial features of the mechanics of<br />\nIt is the<br />\nOne of the most successful con- eastern country. Sailboats used<br />\nPenn carnival last year in ten sec- choice of over fifty<br />\nthe<br />\ndebate. Following this he explays read by certs ever given by the Musical in coastal travel are infested with<br />\n°Yids. D'Anita has been placed in the play-reading committee<br />\nplained<br />\nthat the Junior team was<br />\n. The Club was presented Saturday eve- a healthy breed of roaches; and<br />\na special race against Louis Galloper is a three-act farce.<br />\nentering<br />\nthe debate without the<br />\nThe ning at Winchester Hall, a down- the inhabitants thernselves are in<br />\nClarke of Hopkins.<br />\nservices of one of its members,<br />\nscene is laid in Greece during one<br />\nturn<br />\nwell<br />\ninhabited<br />\n.<br />\ntown building of Hood College,<br />\nBooth to Meet Lemonde<br />\nSydney M. Cone, who had been<br />\nof the Graeco-Turkish wars. The<br />\nFirst Impressions Inaccurate<br />\nFrederick. The trip to Frederick<br />\nAnother Hopkins man to be dramatis personae contains twentyThe globe-trotter, however, taken ill Friday afternoon, too<br />\nis one of the longest, if not the<br />\nPitted against a particular oppo- three characters, four of which are<br />\nmakes the mistake of stopping late to notify his alternative. The<br />\nlongest, trip ever attempted by the<br />\nnent in a special race is Verne females, and fifteen extras. There<br />\nwith his first impression. Further address of Mr. Cone was read by<br />\nMusical Club. The concert was a<br />\nBooth, who is scheduled to cola- are a large number of good parts.<br />\nacquaintance with the people John W.Parsons. The first speakgreat success both musically and<br />\nPete with Lemonde of Boston The whole play is light and conbrings out qualities that present er for the Seniors, who upheld the<br />\nfinancially. For a time the club's<br />\nCollege, in a 5000-meter run. This 'ains no serious love scenes to handthem in a more favorable light. affirmative, William B. Gross, was<br />\nmanagement was doubtful as to<br />\nTruly, they don't know as much as then introduced. He explained the<br />\nrace is expected to have a direct icap the use of males in female<br />\nthe financial outcome of the coninfluence in the picking of the parts. The scenery offers great<br />\nthey should ; but, on the, other distinction between entering the<br />\ncert in view of the fact that no<br />\nUnited States Olympic team.<br />\nhand, they know a great deal that League of Nations and the World<br />\npossibilities and Hamburger and<br />\nmoney guarantee was given by<br />\nJimmy Patterson, former Penn Gump are already making elabowe don't know. They are excellent Court. The advantages of setany Frederick organization.<br />\nstar and winner of the sprints in rate plans for this feature of the<br />\ntrackers; a few marks in the des- tling disputes by arbitration,<br />\nProminent Patronesses<br />\nthe 1912 Olympic Games, is prac- production.<br />\nFrederick's most prominent peo- ert sands provide them with a rather than war, were given.\"The<br />\ntising at present in hopes of stagple<br />\npatronized the concert. Those newspaper in which they can read only way to remove war,\" he said,<br />\nNew System of Understudies<br />\nwhole stories of current events. \"is to remove the causes of war.\"<br />\ning a comeback at the Hopkins<br />\nMr. Swindell, coach of the play, serving as patronesses were:<br />\nmeet. Patterson is entered in the announced that the club this year<br />\nMesdames George R. Dennis, Their seilse of directioii and of A statement of Secretary Hughes<br />\nMeet as a member of the Balti- will pick two casts so that compe- Jr., William C. McSherry, Samuel distance makes thiir judgment at was read, in which the opinion is<br />\nmore Athletic Club under whose tition will take place throughout the G. Duvall, J. Alleine Williamson, times more reliable than mathe- handed down that the League of<br />\nauspices he expects to compete period of rehearsals. The two casts D. Charles Winebrener, F. W. matical computations, made with Nations does not influence the<br />\nfor a place on the American Olym- will provide understudies in case Harnwell, Ethel M. McNutt, Otho the aid of excellent instruments. World Court in any way.<br />\nPic squad. Athletic circles are sickness or other reasons prevent a J. Keller, Frank H. Hedges, They will allow nothing to stand<br />\nIsolation Advocated<br />\nmuch interested in Patterson's at- man from appearing in the play at Charles H.'Conley, Reno S. Harp, in the way of satisfying their curiElmer L. Mylander,for the negtempt to regain his old ability as the last minute. The rehearsal Richard S. J. Dutrow, Richard P. osity. To the dictates of religion ative, argued for a direct policy of<br />\nhe was at one time co-holder of work will count just as much to-- Ross, Thomas B. Hayward and J. alone they subordinate their own isolation. Quoting Thomas Jefth e world's record for the 100- wards ultimate membership in<br />\nspirited wills. Even the little chil- ferson, he said: \"We desire peace<br />\nthe 0. Hendrix.<br />\nMeter dash.<br />\nSpecial permission from the au- dren would fearlessly shout a verse and friendship with all foreign naclub as the actual part in the protions, entangling alliances with<br />\nthorities of Hood College was ob- that goes something like this:<br />\nduction.<br />\nPenn State Hurdler Entered<br />\n\"The<br />\nEnglish,<br />\nthe<br />\nnone.\" He declared that \"entrance<br />\nEnglish,<br />\ndelegatio<br />\nthey<br />\ntained<br />\nn<br />\nPenn State's large<br />\nto allow the Hood students<br />\nDelay in starting the rehearsals<br />\ndon't pray!<br />\ninto the World Court and the conWill include Al Moore, who sur- is due mostly to misunderstanding to attend the affair.<br />\nEven the chickens are better than tinuance of the Monroe Doctrine,<br />\nDance Follows Concert<br />\nprised Baltimore track fans last of Charles Scribner's Sons in not<br />\nFollowin<br />\nthe<br />\ng<br />\nconcert<br />\nan<br />\ninthey !\"<br />\nwould be incompatible.\"<br />\nYear by winning the 100 low hur- answering the letters Of the club in<br />\nformal<br />\ndance<br />\nwas<br />\nheld.<br />\nThe<br />\nproThese<br />\nArabs are self-respecting,<br />\nFor the affirmative, John H.<br />\ndle race. Moore is listed in the reference to obtaining copies of The<br />\ngram was well planned and diver- independent and daring. They Croker declared<br />\nsame event for next Saturday Galloper. The copies have come<br />\nthat the policy of<br />\nsified. The Glee Club's numbers have great liking for fiery, fearless the United<br />\nnight. Another star who is ex- and the rights have been secured<br />\nStates has always been<br />\nwere sung extraordinarily well, in preaching. Raiding neighboring to employ<br />\nPected to attract attention is to present the play. Barely six<br />\narbitration in the disspite of the absence of Mr. Bochati. tribes is their national sport. With putes with<br />\nPlavehive, a high jumper. Flave- weeks remain in which to put the<br />\nother powers. Varithe director. The Banjo Club was it all, they are loyal and hospitable, ous<br />\nhistorical<br />\npreviousl<br />\njumped<br />\nfeet,<br />\n6<br />\ny<br />\nhive has<br />\nexamples were cited<br />\nplay across. A great many men<br />\nat its best and the Blue Jay Six —somtimes, to foreigners, uncom- to prove<br />\nthis. He said that to now<br />\n41/2 inches, a performance which are needed and the Barnstormers<br />\nheld its audience spellbound. The fortably hospitable.<br />\nrefuse to co-operate in the estabranks him among the best in the urge the entire undergraduate supprogram was:<br />\nDr.<br />\nHarrison<br />\nRelates Anecdotes<br />\nlishment of a world court would<br />\ncountry. A list of strong competi- port. Rehearsals will take place six<br />\n1. GLEE CLUB<br />\nDr. Harrison told story after be inconsistent with the past practors is provided to make Flave- times a week, on Monday, Tuesday,<br />\nThe University Ode...Devries story to bring out common traits tices<br />\nof this country.<br />\nhive do well to win.<br />\nThursday and Friday nights, and<br />\n2. BANJO CLUB<br />\nof Arabian character. His sympaPolly Carter of the Baltimore on Saturday and Sunday afterAbility of Court Denied<br />\nNews sports department, has ar- noons. Mr. Swindell said, \"Thirty- Enchantment Waltz....Alberti thetic humor made his talk un- John W.Parsons of the Juniors<br />\n3. PIANO Solo<br />\nMr. Sauer usually entertaining, as well as ex- reading the<br />\nspeech of Sydney<br />\nranged a series of races for girls. six rehearsals are all that we have<br />\nNocturne in F# Major..Chopin tremely interesting. He summed Cone,<br />\nsaid<br />\nbeen<br />\nentered<br />\nthat<br />\nAbout 20 girls have<br />\nto produce The Galloper. I urge<br />\nnations will not<br />\n4. GLEE CLUB<br />\nup his impressions of his experi- be kept from doing what their<br />\nIn the events set aside for them. everyone connected with the pro(a) All Through the Night,<br />\nence in Arabia by saying that mis- economic interests or honor reduction in any way to co-operate<br />\nMany Special Races<br />\nBochau sionary work does not consist of quire by purely<br />\nTh e Y. M. H. A. has definitely with us in putting on the best peridealistic con(Mr. Clinton White, Soloist)<br />\nreaching down to the poor heathen cepts. He claimed that the World<br />\nScheduled a mile relay race be- formance that the Barnstormers<br />\n(b) John Anderson, My Jo,<br />\nand condescendingly pulling him Court is not backed by sufficient<br />\ntween its representatives in Bal- have ever produced.\"<br />\nTurnbull out of the mire. The best defini- physical<br />\nforce to quell uprisings<br />\ntimore, Washington, Richmond,<br />\n5. VIOLIN SOLO<br />\nMr. Light tion of missionary work,\" said Dr. or disorder,<br />\nand hence the judicial<br />\nINladelphia and New York. Be- DR. HOLLANDER TO BE THE<br />\nOn Wings of Song,<br />\nHarrison, \"is given in 'Revela- body is legally incompetent.<br />\nsides this race the Y. M. H. A. GUEST OF VIRGINIA ALUM6. THE BLUE JAY SIX<br />\ntions'; namely, bring the glory and<br />\nCapable speeches were presenthas entered many contestants in<br />\nNI OF HOPKINS<br />\n(a) Popular Selections<br />\nhonor of a nation into the king- ed on the rebuttal by Frederick L.<br />\n°ther events.<br />\nProfessor Jacob H. Hollander<br />\n(b) Xylophone Solo.. Mr. Boyd<br />\nContinued on page 4 col. 4<br />\nMoehle for the affirmative, and<br />\nAmong the large number of will be the guest of the Virginia<br />\n(c) Banjo Solo..Mr. McCauley<br />\nDavid Schapiro, for the negative.<br />\nPrep school events scheduled is a Alumni of Johns Hopkins Uni- 7. BANJO CLUB<br />\nThe<br />\nformer cited actual cases<br />\nNOTICE<br />\nTO<br />\n11111e.relay between Baltimore City versity at the annual dinner to be<br />\nFavorite Selections<br />\nbrought<br />\nbefore the court, which<br />\nFRATERN<br />\nITIES<br />\n°11.ege and the Polytechnic Insti- held at the Westmoreland Club, 8. SAXOPHONE SOLO,<br />\nproved that it is competent to<br />\n.11te• Other prep schools entered Richmond, Saturday<br />\nevening,<br />\nAll fraternity data for the<br />\nMr. Scherr<br />\nhandle most of the cases brought<br />\nin the events are Woodberry For- February 23. The subject of'Pro- 9. GLEE CLUB<br />\nHullabaloo must be turned in<br />\nbefore<br />\nit. He called attention to<br />\nto Leopold by Monday, Febest,-Lawrenceville, ..Fork Union, fessor Hollander's address will<br />\n(a) Deep in the Heart of Me,<br />\nthe<br />\nfact<br />\nruary<br />\nthat a candidate for judge<br />\n25. P. 0. Box 326.<br />\nand Washington High Schools.<br />\n\"Economic Liberalism.\"<br />\n(b) Hunter's Farewell.<br />\nContinued on page 4, col. 4.<br /><br />\nTHE JOHNS HOPKINS NEWS - LETTER, FEBRUARY 19, 1924<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nMaybe<br /><br />\n§<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br /><br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br /><br />\nTelephone<br /><br />\nEditor-in-Chief<br />\nJOSEPH LEOPOLD, '24<br />\nManaging Editor<br />\nWILLIAM G. DEAN, JR., '24<br />\nAssistant Managing Editor<br />\nT. REESE MARSH, '24<br />\nAssociate Editors<br />\nRICHARD C. TILGHMAN, '25<br />\nJOHN W. PARSONS,'25<br />\nBENJAMIN T. ROME, '25<br />\nCHARLES G. HUTZLER, '24<br />\nJunior Editors<br />\nARTHUR L. NELSON, '26<br />\nERNEST A. STRATHMAN, '26<br />\nALGER G. HISS, '26<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nHAROLD S. GOODWIN, '26<br /><br />\nHomewood 100<br /><br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Mana ger<br />\nA. J. McKAY, '26<br />\nCirculation Manager<br />\nJOHN C. LEWIS, JR., '24<br />\nAssistant Business Managers<br />\nD. MILES MARRIAN,'25<br />\nG. DONALD GIESKE,'25<br />\nJOHN T. DIXON, '24<br />\nC. EUGENE TOVELL,'24<br />\nOTH0 J. KELLER, III, '26<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br /><br />\nMember Southern Intercollegiate Newspaper Association<br /><br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nBox 729 is still as glaringly<br />\nempty as a dormitory room between 10 P. M. and 3 A. M. We<br />\nhave considered the feasibility of<br />\nchanging the title to a more provocative, luring caption that<br />\nmight easily lend itself to a successful slogan of the Keep Shootin'<br />\n'Em to Shootin' 'Em type. For<br />\nexample: The Lighthouse would<br />\nsuggest Keep the Sacred Flame<br />\nAlight; The Lookout in its turn<br />\nmight Connote Be on the Lookout<br />\nfor News for The Lookout. Or we<br />\nmight approach the attack from another angle, cajoling \"with concord<br />\nof sweet sounds,\" thus:<br />\nWe here received each piece rejected<br />\nBy Dunning and his Jay.<br />\nYe authors so forlorn, dejected,<br />\nIf thrice our work in worth<br />\nThen yours will surely be selected.<br />\n*<br /><br />\n\"This is a degenerate age. All<br />\nour comforts have either gone or<br />\nare fast going. • • • But now,<br />\nas Mr. Micawber said when he<br />\nwas released from prison, everything is gone from us.\"<br /><br />\nHOMEWOOD PLAYSHOP PRENEWS FROM OTHER<br />\nSENTS THREE PLAYS<br />\nCOLLEGES<br />\nextremely<br />\nThe<br />\nHomewood Playshop preUniversity<br />\nis<br />\nMcGill<br />\nactive in winter sports. Swim- sented two comedies, \"For Disming, hockey, basketball and snow tinguished Service\" and \"Atmossports are occupying the McGill phere\", and a more serious play,<br />\nathletes. The swimming team re- \"The Rising of the Moon\", last<br />\ncently won the Collegiate Cham- Thursday, Friday and Saturday<br />\npionship of Canada by defeating nights in their little theatre on<br />\nthe University of Toronto. Great the Hopkins campus. The plays<br />\ninterest is likewise being shown in were an excellent example of the<br />\na series of debates between Law work that the Playshop has been<br />\nand Theological students on the doing and they continued their<br />\nquestion whether the law or the<br />\nmany dramatic successes.<br />\nministry offer more service to the<br />\nSince the fall of the Cushing recommunity. The ministers have<br />\ngime, the Homewood Playshop<br />\na temporary lead.<br />\nhas 'taken an aspect truly representative<br />\nof Hopkins. Everyone<br />\nThe University of Vermont is<br />\ntrying to find a suitable method of who took part in the production<br />\nhandling a Frosh-Soph Rush.<br />\nThey are inquiring among various<br />\ncolleges and the \"Vermont Cynic\"<br />\nis printing the various types of<br />\nrushes. They all seem to resemble the Hopkins football rush, as<br />\nheld in 1922.<br />\n* * *<br /><br />\nwas directly connected with the<br />\nUniversity. Those who deserve<br />\nparticular mention in their resective 'parts in last week's productions are: Dr. F. A. Litz, Ruth E.<br />\nBrandau, Gertrude Schanze and<br />\nEleanor A. Whiting.<br /><br />\nRichmond University is running a winter basketball league SHIRTS<br />\nNECKWEAR<br />\namong the various fraternities.<br />\nLeFranc &amp; Ault<br />\nKappa Sigma is in the lead at<br />\n421 N. HOWARD ST.<br />\npresent. The \"Richmond Collegian\" is interested in the number HOSIERY<br />\nGLOVES<br />\nof Hopkins students who are participating in fall athletics; it<br />\nseems to regard thirty-three per<br />\ncent. as a pretty high rate.<br />\n*<br /><br />\nThe death of President Wilson<br />\nSo laments Arthur Machen in<br />\nhas<br />\nbrought a large number of<br />\nhis prologue and epilogue to<br />\nncidents<br />\nin his college life to light.<br />\nWhere are the Fogs of Yesteryear,<br />\nA<br />\nnumber<br />\nof papers commented<br />\none of several delightful essays reA BIG WEEK<br />\non<br />\nthe<br />\ncoincidence of his death,<br />\ncently published by Knopf under<br />\nVaried attractions are offered to followers of Hopkins' activities the title Dog and Duck, the name of with the announcement that his<br />\nthis week. The Musical Club's Home Concert on Thursday. The the firSt of the group. Alas, it is classmate at Hopkins, Dr. Levermore, had just won the Bok Peace<br />\nBowery Ball on Friday, and the annual Hopkins Fifth Regiment all too true and the latest remnant<br />\nof olden times to go from us is Prize. The \"Black and White\"<br />\nGames on Saturday should prove tempting to even the most discrimthe familiar Just Sixer. Many have records that he coached the footinating.<br />\nsung of the glories of the Phi ball team at Weslyian during the<br />\nNeatly combed, well- ept hair is a<br />\nbusiness and social asset.<br />\nThe teams<br />\nThose who have witnessed a Musical Club's performance during Beta Kappa men; but few have period of 1889-91.<br />\nSTACOMB makes the hair stay combed<br />\nin any style you like even after it has<br />\nskill and daring of there during Mr. Wilson's period<br />\nthe present season or have attended a Home Concert in other years appreciated the<br />\njust been washed.<br />\nthe student who always managed to of coaching were uniformly sucSTACOMB—the original—has been<br />\nwill vouch for the variety and quality of this program. The Junior<br />\nused for years by stars of stage and<br />\nget \"just six.\" \"All, all are gone, cessful. One incident is rememscreen—leaders of style. Write today<br />\nClass has unearthed a novel and interesting substitute for the Junior the old familiar faces\"; the Just bered. Weslyan was being defor free trial tube.<br />\nTubes-35c Jars-75c<br />\nProm in the Bowery Ball and it is reported that the quota of tickets Sixer has succumbed to the ever- feated by Lafayette. The cheerInsist on STACOMB—in the black,<br />\nfor this affair has already been disposed of. A large number of na- increasing austerity of life. The ing was becoming disorganized.<br />\nyellow and gold package.<br />\nFor sale at your druggist or wherever<br />\nSuddenly<br />\na<br />\nfigure<br />\nin<br />\na<br />\nblack<br />\noveredict<br />\nwhich<br />\nprevents<br />\ngraduation<br />\nof<br />\ntionally known track stars will be seen at the Fifth Regiment Armory<br />\ntoilet goods are sold.<br />\nthe \"scholar\" with more than a pair coat sprang in front of the stands,<br />\nStandard Laboratories, Inc.<br />\non Saturday and the Johns Hopkins squad will be forced to extend<br />\n750 Stanford Avenue Los Angeles, California<br />\nof sixes in his hand has destroyed and beating time with an umbrelSend coupon for Free Trial Tube.<br />\nitself in order to maintain the reputation that it has gained.<br />\nthis picturesque figure of a former la, he led the cheers in a clear<br />\nSTANDARD LABORATORIES,Inc.<br />\n750 Stanford Ave.. Lou Angeles, California, Dept. 1<br />\nProfessors no longer tenor voice, inspiring the team to<br />\nHopkins men will not be able to complain of boredom this week- period.<br />\nPlease send me free trial tube.<br />\ncrown the courageous individual tie the score. He was -Woodrow<br />\nName<br />\nend.<br />\nAddress<br />\nwith a six; the student with a bit Wilson.<br />\nof fire in his blood no longer accepts the challenge embodied in<br />\n\"THE GALLOPER\" ENTERS<br />\nstriving for a six. Mourn, oh ye<br />\nThe Barnstormers have at last succeeded in obtaining copies of unromantic, Just Sixer is dead.<br />\n\"The Galloper\" by Richard Harding Davis and weekly rehearsals for<br />\n* * *<br />\nthe annual production in March have begun. Before much progress<br />\n\"Surely it would not be too much<br />\ncan be made, however, it is necessary that more men enter into comto<br />\nexpect the faculty of Johns Hoppetition for places in the cast. \"The Galloper\" requires twenty-three<br />\nkins<br />\nto allow the undergraduates<br />\ncharacters and, as the Clubs uses at least one understudy for each role,<br />\nan intermission of such a short peran enrollment of approximately fifty men is essential before even a<br />\niod as one day.\"—From the letter<br />\nbeginning can be made.<br />\nof an Engineering Junior, which<br />\nThe Barnstormers are handicapped this year by lack of time ;n requested an \"intermission\" after<br />\nHE constant'<br />\nexams.<br />\nwhich to prepare. Temporary selections for the cast will be made in<br />\nsmoker finds<br />\nAs much as four months holiday,<br />\na few days. It is probable that many a histrionic gem of purest ray<br />\nin Melachrino<br />\nserene is concealed on the campus, unconscious of his inherent ability. observes T. Whiteley, have been<br />\nCigarettes a deliAnd the Barnstormers need candidates badly. An opportunity is granted some students.<br />\ncacy of flavor of<br />\nopen for would-be actors to demonstrate their ability and to gain<br />\n* * *<br />\nwhich he never<br />\nmembership in the Club, the latter being one of the most sought-for<br />\n\"Teachers should have a missiontires.<br />\nhonors on the campus.<br />\nary spirit and to insure this they<br />\nDramatic Club productions in past years have been of the highest must be paid less than they are<br />\ntype of amateur productions. It is essential that the Barnstormers worth.\"—From Dr. Richmond's<br />\nORIGINAL<br />\nmaintain this prestige. Co-operation from the student body is, how- speech against the raising of college instructors' salaries, as quoted<br />\never, essential.<br />\nin last Friday's NEWS-LETTER.<br />\nE. Strathman suggests that, in ac\"The One Cigarette Sold the World Cover\"<br />\nThe News-Letter will appear on Thursday this week instead of cordance with this plan, said salaries be paid in German marks.<br />\nFriday. Copy for next Tuesday's issue to be turned in Thursday.<br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 19, 1924<br /><br />\nFor<br /><br />\nunruly iair<br /><br />\nT<br /><br />\nMELACHRINO<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 19, 1924<br />\nMOCK TRIALS OF MILITARY BLACK AND BLUE TRACK FRESHMAN SMOKER CALLED<br />\nLAW INTEREST STUDENTS<br />\nMEN TO COMPETE IN<br />\nOFF AT LATE HOUR<br />\nGEORGETOWN GAMES<br />\nTwo mock trials now being<br />\nLack of support on the part of<br />\nTwelve men will represent the class caused the Freshman<br />\nconducted by students of Military<br />\nJohns<br />\nHopkins in the twenty-sec- Smoker Committee to postpone inScience are arousing consideraond Annual Indoor GameS of the definitely the smoker, which was<br />\nble interest on the campus. They<br />\nGeorgetown University Athletic to have been held last Friday<br />\nare held under the supervision of Association<br />\nat Convention Hall, night at the Southern Hotel. Acthe Military Department as a part Washington, on Thursday night. cording to Schwinn, the chairman<br />\nof the course of instruction in mil- Manager Geib has entered the of the committee, only 26 tickets<br />\nitary law. The course is given squad in nine events. The meet had been sold.<br />\nElaborate arrangementas for the<br />\nannually to Juniors for six weeks. precedes the Johns Hopkins-Fifth<br />\nRegiment Indoor Games by two smoker had been made, and a<br />\nThis year, however, is the first<br />\nnights and will provide a good number of musical renditions and<br />\ntime that the trials have been<br />\nwork-out for the team.<br />\nspeeches had been prepared. Tbe<br />\nbased upon actual occurrences.<br />\nHopkins entries will compete in members of the Freshman football<br />\nThe change in the system was nethe 16-pound shotput, 50-yard team, and their coach, \"Tom\"<br />\ncessitated by the fact that imagdash, 50-yard hurdles, 600-yard Landy, were to have been guests<br />\ninary cases caused conflicting tesnovice run, 880-yard run, mile run, of honor. Landy was to have pretimony and a troublesome free440-yard dash, two-mile run, and sented the class numerals, and<br />\ndom in the play of the imaginabroad jump. Other events will Schwinn was to have been toasttion.<br />\ninclude a relay between Navy, Le- master. In conclusion, there was<br />\nThe circumstances of the first<br />\nhigh and Pensylvania and a 4n0- to have been a fitting ceremony in<br />\ncase are as follows: \"On or about<br />\nmeter dash between Fitch of the memory of the departed members<br />\nJanuary 10, 1924, at about 3.00<br />\nUniversity of Illinois, National who had succumbed to the late<br />\nP. M., on the target range in GilSenior A. A. U. 440-yard cham- examinations. The cost of the<br />\nman Hall, Cpl. J. Tasche, Band,<br />\npion, and Ascher, of Georgetown. tickets, which will be refunded to<br />\nHdqrs. Co., 1st Regiment, InfantProbably the feature event of the the patriotic few, was $1.25.<br />\nry, aimed a loaded air rifle at Cpl.<br />\nevening will be the 1500-meter<br />\nAccording to ,some members of<br />\nMarx S. Kaufman, Band, Hdqrs.<br />\nrun. Entries in this event include<br />\nthe '27, the smoker was not<br />\nCo., 1st Regiment, Infantry, and<br />\nJoey Ray, Illinois A. C.; Jim Con- sufficiently<br />\nadvertised, in that<br />\ndischarged the same, the bullet<br />\nnelly, Newark A. C.; Mike Deva- many<br />\nof the members did not seem<br />\nstriking Cpl. Kaufman, thereby<br />\nney, Millrose A. C., and Brooks,<br />\nto know the date set for it. This<br />\ninflicting a slight injury.<br />\nof Georgetown.<br />\nfact<br />\nis generally held to account<br />\nShot Fired Intentionally<br />\nThe Hopkins entries follow:<br />\nfor the amazing lack of support.<br />\nThe \"trial\" was, held in the<br />\n16-pound Shot-put—Gilpin and<br />\nAccording to the committee, the<br />\nSouth Loft, Gilman Hall, on the Kaplan.<br />\nsmoker<br />\nproject has not been abanafternoons of February 11 and 12. 50-Yard Dash—Clarke, Balls,<br />\ndoned,<br />\nbut<br />\nwill be taken up again<br />\nAfter a hard fight the plaintiff Brown, C., Block and Heyn.<br />\nsucceeded in proving that Corpo50-Yard Hurdles—Brown, C. at a later date. They believe that<br />\nit will be an invaluable \"get toral Tasche had fired the shot and Block, Gilliece.<br />\ngether\"<br />\ninfluence for the class of<br />\nhad fired i intentionally.<br />\nIt<br />\n600-Yard Novice—Meredith.<br />\n'27.<br />\ncould not be proved, however, that<br />\n880-Yard Run—Wasson and<br />\nthe accused had used a weapon ca- Norwood.<br />\npable of inflicting a dangerous<br />\n1 Mile—Booth (captain) and NEWLY ORGANIZED TEAM<br />\nwound. The Court called upon Wasson.<br />\nTO MEET HOPKINS IN<br />\nsix witnesses in the process of the<br />\nLACROSSE.GAME<br />\n440-Yard Dash—Heyn, Nortrial.<br />\nL'Hirondelle Club to Play at Homewood<br />\nwood and Clarke.<br />\non April 12. Black List<br />\nColorfel-C-. G. Post, 1st -Infant2-Mile ,Run—Pooth (captain).<br />\nAffects Team<br />\nry, acted as president of the<br />\nBroad jump—Gilliece.<br />\nA<br />\nnew<br />\nin the firmament of<br />\nstar<br />\nCourt.<br />\nlacrosse has appeared on the schedThe circumstances of the secINTELLIGENCE TESTS<br />\nule of the J. H. U. team as was anond \"trial\" are as follows: \"SerI have just seen the announcenounced ill the News-Letter sevgeant T. S. Summers, Co. A, 1st ment of the result of<br />\nthe applicaeral weeks ago. This is the L'HiInf., refused to stop smoking tion of the intelligence<br />\ntests used<br />\nrondelle Lacrosse Club of Ruxton,<br />\nwhen ordered to do so by his su- by the Army to a number<br />\nof sucwhich was organized during the<br />\nperior officer, Lieutenant C. G. cessful business men.<br />\nrecent Christmas vacation by a<br />\nPost. Sergeant Summers left the<br />\nThe result showed that 80 per<br />\ngroup of former Hopkins stickclass room against a direct order<br />\ncent. of them passed the test, but<br />\nwielders. The new club has seof Lieutenant Post not to do so.<br />\nsome of the most successful were<br />\ncured<br />\non its roster a number of<br />\nSergeant Summers was disrespectamong the 20 per cent. that failed.<br />\nformer<br />\nplayers of other colleges<br />\nful and insubordinate to LieutenWhether this result condemns<br />\nand a large quota of unattached<br />\nant Post in calling Lieutenant<br />\nthe 20 per cent, of business men<br />\nlacrosse players, besides the exPost a damn fool, or using words<br />\nor the tests used, I will not diswearers of the Black and Blue.<br />\nto that effect.\"<br />\ncuss.<br />\nAccording to J. Wistar Huey, J.<br />\nThree Sittings Required<br />\nHowever, the conclusion may H. U., '23, one of the organizers<br />\nThe quantity of defense offered be drawn from this<br />\ntest that in- of the Ruxton team, the new club<br />\nby the accused ca:used this trial to telligence is not as necessary<br />\nto is intended to spread the enthusirequire three separate sittings of success in life as some<br />\nother qual- asm for lacrosse which has grown<br />\nthe Court. It was held on the aft- ities going to make<br />\nup a man's so rapidly in the last few years.<br />\nernoons of February 13, 14 and 20. personality. It<br />\nis also well known<br />\nThis newly founded lacrosse<br />\nColonel F. T. Bates was president that<br />\na college education is not club will be seen<br />\nill action on<br />\nof the Court, which required the necessary<br />\nto success, on the con- Homewood Field on<br />\nthe 12th of<br />\ntestimony of seven witnesses. The trary<br />\nwith some individuals it is April, when they cross<br />\nsticks with<br />\ndefense offered strong proof to a handicap.<br />\nthe<br />\nJohns<br />\nHopkins<br />\nteam,<br />\njust -one<br />\nshow that Sergeant Summers did<br />\nIt is presumed that you college week after the latter's game with<br />\nnot consider the instructions of<br />\nmen will have intelligence and the Alumni.<br />\nLieutenant Post an order.<br />\neducation, but since it is not inThe second trial was based upon<br />\ntelligence and not education that<br />\na secretly pre-arranged occurrence<br />\nis the absolute quality that is necin a class in Military Science.<br />\nessary, it is not of the most urThe histrionic abilities of the<br />\ngent importance that you should<br />\nprinciples were so pronounced<br />\nassiduously cultivate the other<br />\nthat the witnesses believed that<br />\nqualities that enter into the makthey were testifying as to an actuing of a successful personality.<br />\nDamon—<br />\nal happening.<br />\n\"What's the matter?<br />\nSome of these are good manIn both cases the entire Courts<br />\nCan't you read your<br />\nners, a pleasant and kindly disponotes of the lecture?\"<br />\nwere composed of students.<br />\nsition, and a neat and well kept<br />\nPythias—<br />\nappearance. Well kept appear\"No—doggone it. I<br />\nskipped over to class<br />\nance is not the least of these qualthis morning without<br />\nities and is one that may be acmy Dixon's Eldorado!\"<br />\nNOTICE<br />\nquired by all who will take the<br />\n17 leads—all dealers<br />\nSwimming Meet, Hopkins<br />\ntrouble.<br />\nvs. Lehigh, B. A. C., FebruDIXON<br />\n'<br />\nS<br />\nTo have a well kept appearary 29, 8.00 P. M. Dancing<br />\nance you must wear a starched<br />\nEthORADO<br />\nafter the meet.<br />\ncollar, and should patronize the<br />\n?he masterdrawingpenal\"<br />\nYale Laundry.-Advertisement.<br /><br />\n3<br /><br />\nYou won't fumble this cap!<br />\nProfessional jugglers could handle the oldstyle shaving cream caps and never once drop<br />\none down the drain or under the bath tub.<br />\nBut for most of us, this new Williams HingeCap puts an end to an ancient nuisance.<br />\nWilliams Shaving Cream is just as much<br />\npleasanter to use as is the Hinge-Cap. It<br />\nsoftens the beard with uncanny speed. The<br />\nthicker lather holds the moisture in against<br />\nthe skin where it is needed. This lather lubricates the skin, too, so that painful razor<br />\nfriction is eliminated. And when your shave<br />\nis done, that famous ingredient in Williams<br />\nwhich helps the skin, leaves your face cool,<br />\nsoothed and refreshed. No coloring matter<br />\nis used in Williams — it is a pure, naturalwhite shaving cream.<br /><br />\nWilliams<br />\nShaving Cream<br /><br />\nALWAYS USE A<br /><br />\nYELLOW CAB<br /><br />\nROBBIN'S STYLE BUILT HATS<br /><br />\nOR PHONE<br /><br />\nFOR YOUNG MEN<br /><br />\nVERNON 1212<br /><br />\n122 W. BALTIMORE ST.<br /><br />\nHAIL THEM ANYWHERE<br /><br />\n:77V<br /><br />\nII<br /><br />\nPAA1<br /><br />\nThe Best<br />\nBusiness Career<br /><br />\n‘<br />\nIf4<br /><br />\nS what every ambitious senior is<br />\nthinking about at the present<br />\ntime. Life insurance is one of the<br />\nbest, one of the most desirable, and<br />\none of the most satisfactory as a<br />\npermanent calling.<br />\nIn assets and volume of business,<br />\nlife insurance is one of the three<br />\nleading businesses of this country,<br />\nyet the field is comparatively underdeveloped. Only 7 per cent of the<br />\neconomic value of human life in the<br />\nUnited States is covered by insurance.This gives an idea ofthe big field<br />\nstill to be worked,especially business<br />\ninsurance for firms and corporations.<br />\nAs to remuneration: Reports of<br />\ncollege graduates who have entered<br />\nbusiness indicate that life insurance is<br />\nat the very top as a source of income.<br />\nNow is the time for you to consider<br />\nwhat you are going to do after graduation. If you are ambitious and willing to work hard and are interested to<br />\nknow about life insurance, address<br /><br />\nkfi4<br /><br />\nrot<br /><br />\nI<br /><br />\nkr1<br />\n'l;:1<br />\nC1:' r:11<br /><br />\nrtp9.1<br />\nrftl<br /><br />\n4.9.1<br />\n,44;(<br />\nrt,9i<br /><br />\n:<br />\n::<br />\n114*14<br />\nrecif<br />\ntY14<br /><br />\ntOA!<br /><br />\nPOI<br /><br />\n?IA<br />\nrfi•Z<br />\n411<br />\nPAf<br /><br />\n1.441<br /><br />\nr/1-4j<br /><br />\nAgency Department<br />\ntkt4<br /><br />\nrA-N<br /><br />\n01<br />\nFA<br />\n9<br />\n1<br /><br />\nteim<br /><br />\nAL.<br /><br />\nEt1<br />\nYa,<br /><br />\nLIFE INSURANCE COMPANY<br />\nOF BOSTON. MASSACHUSETTS<br /><br />\nSixty-one years in business. Now insuring One Billion Seven<br />\nHundred Million Dollars in policies on 3,250,000 lives<br /><br />\nkf<br />\nfii<br />\nfkrd<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 19, 1924<br /><br />\n4<br /><br />\nWALES ELECTED PRESIDENT ELECTION AND ANNOUNCE- DR. PAUL HARRISSON ADDRESSES<br />\nASSEMBLY<br />\nMENT OF SHOW FEAOF CAMPUS CLUB FOR<br />\nContinued from page 1<br />\nTURE ELECTRICAL<br />\nNEXT YEAR<br />\ndom of God.\" Dr. Harrison was<br />\nCLUB MEETING<br />\non<br />\nDormitory<br />\nSmoker to Be Held in<br />\nnot allowed to stop here; but was<br />\nMarch 17th<br />\nAt the Electrical Club meeting<br />\nback by his audience for one<br />\ncalled<br />\nRalph G. Wales was elected pres- held last Friday afternoon at 4:30<br />\nstory.<br />\nmore<br />\nident of the Johns Hopkins Campus<br />\nP. M.in the Mechanical EngineerH. M. Smallwood, President of<br />\nClub for the year 1924-25, at a<br />\nthe<br />\nBarnstormers, announced that<br />\nBuilding, J. V. Alfrend, chairmeeting held for the election of of- ing<br />\nOf course you know that<br />\nthe club has selected \"The Galficers last Friday in Gilman Hall. man of the Engineering Show<br />\nThe Barn is handling orders<br />\nRichloper,\" a three-act farce by<br />\nWales entered on his duties at once, Committee, announced the final<br />\nour clothes again this<br />\nfor<br />\nard Harding Davis, for presentasucceeding Ben Thomas, whose plans and the dates for the show.<br />\nyear.<br />\ntion this year. He urged that acterm expired at that time. The It will be held in the Mechanical<br />\ntive support be given the BarnThe plan worked to<br />\nother officers elected were ,vice-pres- and Electrical Engineering Buildstormers, for they have only six<br />\nmutual advantage last seaident, Shipley; secretary, Parsons;<br />\n\"The<br />\nApril 4th, from 3 weeks in which to prepare for the<br />\ning<br />\non<br />\nFriday,<br />\nand we're mighty glad<br />\nson,<br />\ntreasurer, Wienefeld ; sergeant-atcasts<br />\nwill<br />\nbe<br />\nproduction.<br />\nTwo<br />\nINK<br />\ncontinue<br />\nthe relationto<br />\nto 5:30 in the afterndon and then<br />\ninns, Gilliece.<br />\ncandidates<br />\nfor<br />\nthe<br />\npicked,<br />\nand<br />\nship.<br />\nfrom 8 to 10:30 at night. From 3<br />\nThat Made the Fountain Pen POSSIBLE\"<br />\nClub to Hold Smoker<br />\nparts are wanted.<br />\nSuits<br />\n$30 up<br />\nReady-to-wear<br />\nJim Alfriend, reporting for the to 5:30 the next day, the show<br />\nThe February number of the<br />\nReady-to-wear O'Coats . $35 up<br />\nsmoker committee, stated that he will be repeated. That night a<br />\nBlack and Blue Jay has gone to<br />\nhad secured the use of the Com- dance will be held in the audito211-213 E. Baltimore St.<br />\npress and will be out for distrimons Room of the Alumni dormi- rium of the Civil<br />\nEngineeriii bution at the end of the month.<br />\ntory for a smoker. The club apBuilding. Among the stunts to The copy and sketches are very<br />\nproved of the date, March 17th,<br />\nEINEIHEIDIREWEINEINN E44444144<br />\nbe included in the engineering unique and the magazine will 44 4444014<br />\nwhich Alfriend proposed. He also<br />\nprove very interesting. Further<br />\nshow<br />\nwill<br />\nbe<br />\na<br />\nHuman<br />\nDynamo,<br />\nstated that the charge would be limRevolving Electrons, Jumping interest is being added by an atited to one dollar.<br />\nCoils, Wireless Lights, X-Ray tractive cover in striking colors.<br />\nCilb<br />\nm eXatterie)<br />\nThe smoker is to be the first so'<br />\n34 ES H.&amp; OSCAR G.1011r<br />\nmachines, Submarine Magnets, The March issue will be very ,<br />\n\\BCfn<br />\nD<br />\ncial gathering that the ,Campus Club<br />\noriginal. Title of the issue is \"The<br />\nOWNERS<br />\nhigh<br />\ntension<br />\nsparksand<br />\nvarious<br />\nwill have held. Alfriend stated<br />\nIDTOM<br />\n• .44114<br />\n(<br />\n7'4'11bE*\"1+<br />\nother engineering phenomena. Caveman Number.\" A number of<br />\nthat he had arranged for a light<br />\n29 E. BALTIMORE ST.<br />\npertaining<br />\nto<br />\nthe<br />\ntitle<br />\nare<br />\nThere will also be displays of sketches<br />\n\"The King of Lubricants\"<br />\nAgents for JOHN B. STETSON HATS buffet supper to be served during standard engineering<br />\napparatus, already under way and with the<br />\nand FRATERNITY BANDS<br />\nthe evening. He also declared that<br />\nsuch as thermocouples, Wheat- \"caveman stuff\" of the Editorial<br />\nSHERWOOD BROTHERS, INC.<br />\nthe committee had decided to restone<br />\nbridges, constant current Staff should make a magazine of<br />\nquest certain members of the club<br />\ntransformers, motor generator intense interest and amusement to gRNININgHCINNEtHHHEMENNIKIKENIZEI<br />\nBoys, the place to get your<br />\nto provide entertainment.<br />\nsets, and others. An electrical re- all.<br />\nmeals—and they are honA motion was passed to have a<br />\nproduction of Hell will be prepicture of the Campus Club put in<br />\nest-to-goodness meals, well<br />\nSENIORS WIN ADAMS DEBATE<br />\nsented to warn the erring engiis<br />\nto<br />\nbe<br />\nThe<br />\npicture<br />\nHullabaloo.<br />\nthe<br />\nContinued from page I<br />\ns erve d, and reasonably<br />\ncause them to mend<br />\ntype used by various other neers and<br />\nof<br />\nthe<br />\nmust receive a majority vote from<br />\npriced—is at<br />\nWe want a live wire salesman<br />\norganizations, with the list of mem- their ways.<br />\nall<br />\nnations.<br />\nA<br />\nclause<br />\nfrom<br />\nthe<br />\nto<br />\nrepresent us on the campus.<br />\nThe men in charge of the show<br />\nbers to be placed below the picture.<br />\nOne who wishes to make some<br />\nCourt<br />\nagreement<br />\nof<br />\nthe<br />\nWorld<br />\nhave obtained liberal support on<br />\neasy money putting in a few<br />\nall hands. The faculty have was read, which said that nothing hours of spare time—interviewing<br />\ngranted permission to all the men in its proceedings would be con- profs- and students—to sell<br />\nFor<br />\nFor<br />\nparticipating in • the show to be trary to the Monroe Doctrine. Mr. Ford Cars. To the right man we<br />\nGENERAL absent from laboratories on Fri- Schapiro said that we have always have a regular position when colFOUNTAIN<br />\n1817 N. Charles St.<br />\nlege closes. Call immediately at<br />\nUSE<br />\nPENS<br />\nday and Saturday, and have also had political isolation, and we can<br />\n325 Park Avenue. Ask for Mr.<br />\nwi<br />\nAl<br />\nother<br />\nnations<br />\nmore<br />\narbitrate<br />\n(Half Block below North Ave.)<br />\nallowed the use of all engineering<br />\nManufactured by<br />\nLong or Mr. Watson.<br />\nsuccessfully<br />\nwithout<br />\nthe<br />\nWorld<br />\nWIGHT &amp; HUMPHRIES<br />\napparatus belonging to the UniNicholas Brown, Mgr.<br />\nirersity. The Physics Depart- Court. He asked the pertinent<br />\nquestion that if the court has the<br />\nPR1RTERS •—• 13111DERS ment and the Military DepartED.GRAVERS<br />\nment are loaning certain special power to settle disputes, why does<br />\n325 PARK AVENUE<br />\napparatus required in the displays. it not solve some of present grave<br />\nBesides the members of the problems of Europe.<br />\nCollecle Literature<br />\nThe judges, 1Mr. Henry C. EvElectrical Engineering DepartLIBERTY ST.<br />\nans,<br />\n'18; Mr. Morton K. Rothment, some members of the Civil<br />\nAT SARATOGA<br />\nand Mechanical Engineering De- schild, '18, and Dr. L. S. Hulburt,<br />\nCollegiate<br />\nProfessor<br />\nof<br />\nMathematpartments are participating in thc<br />\nLUNCHEON<br />\nics, decided in favor of the Senior<br />\nstunts.<br />\nTEA<br />\nFollowing the discussion of the team by a 2-1 vote.<br />\nDINNER<br />\nSelections were given by the<br />\nEngineering Show, an election of<br />\nofficers from the Junior Class to undergraduate orchestra during<br />\nSPECIAL PARTIES<br />\n11.30 A. M.<br />\nrun the society for the rest of this the course of the debate, and at<br />\nuntil<br />\nyear and next year, was held. its close music was furnished for 7.30 P. M<br />\nPLAZA 6987<br />\nThose elected are as follows: an informal dance.<br />\nPresident, J. Albert Pledge; viceCSomething new in portable<br />\nBE A NEWSPAPER CORRESPONDENT<br />\npresident, Martin J. Urner ; sectypewriters.<br />\nwith the Heacock Plan and earn a good income while learning;<br />\nBartholomaeus ;<br />\nretary, John<br />\n(Lit writes nearly all lanwe show you how; begin actual work at once; all or spare time;<br />\ntreasurer, C. Robert Brown;<br />\nguages.<br />\nexperience unnecessary; no canvassing; send for particulars.<br />\nChairman program committee.<br />\nNEWSWRITERS TRAINING BUREAU<br />\n41,Has 90 characters.<br />\nFrank B. Crider; Chairman pub•<br />\nPrinters of<br />\nBuffalo, N. Y.<br />\nlicity committee, Harry TylotY<br />\nSee Fred Rich, College<br />\ncrhe Johns Hopkins<br />\nChairman membershib commitRepresentative<br />\ntee, Sigmund K. Waldorf.<br />\nNE1DS,LETTER<br />\n118 W. FAYETTE ST.<br />\nThe retiring president, J. TilBALTIMORE, MD.<br />\nDixon, was given .a rising<br />\nlotson<br />\nLOMI3ARD and SOUTH STREETS<br />\nand individuality is offered here at prices that are not<br />\nvote of thanks for his services to<br />\nand cannot be underquoted by any house at any time.<br />\nthe club during the past year.<br />\n(,Besides the reputation of an old-established firm<br />\nThe rest of the meeting was deThe Greetings of a Fine Store<br />\nis back of each sale with a guarantee.<br />\nvoted to the reading of papers<br />\nTo the Students of a Fine University<br />\nengia<br />\nprominent<br />\npublished by<br />\nneering concern dealing with matters of great interest to engineer- FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\ning graduates.<br />\n343 NORTH CHARLES STREET<br />\nThe first paper, \"Application<br />\nEngineering\", dealt with a new<br />\nphase of engineering, the selecRENT A CAR<br />\ntion of certain kinds of apparatus<br />\nfor particular demands. Another<br />\npaper,\"Artistry in Salesmanship,\"<br />\nexplained the problems which<br />\nDODGES, 18c PER MILE<br />\nmust be faced by the salesman of FORDS, 12c PER MILE<br />\nengineering apparatus. The third<br />\n13 SOUTH ST.<br />\nSpecial Reduced Rates for 50 Miles or More<br />\npaper, \"The Designer of Electrical Machinery,\" explained the<br />\nDRIVE IT YOURSELF CO.<br />\nJohn J. Nelligan, President requisites for a 'good designer of<br />\nOrganized 1864<br />\nVERNON 4049<br />\n1725 NORTH CHARLES ST.<br />\nelectrical machinery.<br /><br />\nRef 1 With<br />\nORD'S<br /><br />\nCLOTHES<br /><br />\n011112<br /><br />\nSALESMAN:<br /><br />\nThe St. REGIS<br /><br />\nI. I.<br /><br />\nRESTAURANT<br /><br />\nVO<br /><br />\nCi<br /><br />\nDr<br /><br />\nA.<br />\nth(<br />\non<br />\nbe,<br />\nno<br />\nye<br />\nth<br />\nlo\\<br />\n13a<br />\nPri<br />\ner(<br />\nth<br />\nin;<br />\nGo<br />\ncis<br />\nMt<br />\nan:<br />\nHc<br /><br />\niii(<br />\nlie<br /><br />\nasi<br />\nat<br />\nocc<br />\nsit:<br /><br />\nPoi<br /><br />\nre<br />\nfal<br />\nTIT<br />\ntic<br /><br />\n11,1(<br /><br />\ntill<br /><br />\nOn<br /><br />\nwi<br /><br />\nC. A. GOODWIN<br /><br />\nCORONA<br />\nHave you<br />\nseen it?<br /><br />\nFURNITURE OF QUALITY<br /><br />\nHOCHSCHILD.KOHN 8c Co.<br /><br />\nSafe Deposit &amp; Trust Co.<br />\nOF BALTIMORE<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nDRIVE IT YOURSELF<br /><br />\nWi<br /><br />\nPa<br />\nas<br />\nTi<br />\nPr<br />\nwl<br />\nlg<br /><br />\nSO<br />\nAi<br />\nSit<br />\nLi<br /><br />\nSo<br /><br />\nch<br />\nPc<br />\ntic<br />\nea<br /><br />\nCl<br /><br />\nSp<br /><br />\n18<br />\ngr<br /><br />\nsa<br />\nN<br />\nam<br />\ntic<br />\nw,<br />\n1C<br /><br />\nty<br /><br />"}], "field_media_file": [{"target_id": 37833, "display": null, "description": null, "target_type": "file", "target_uuid": "79cd79d3-579d-4c33-a858-292086ef136d", "url": "http://digital.library.jhu.edu/system/files/2022-03/13106-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13106, "target_type": "node", "target_uuid": "2affe64d-c505-4270-a07b-874403eea06d", "url": "/node/13106"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "cb29e48b-6dd0-4708-8d17-43ea56e6992d"}]}