{"mid": [{"value": 35668}], "uuid": [{"value": "09e006ef-d328-4615-a810-a04e51675f2d"}], "vid": [{"value": 35668}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:10:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12208-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:10:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:10:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "\fJOHNS HOPKINS UNIVERSITY.<br />\nSIALTISIONE,<br />\n<br />\nThe Johns Hopkins Preis.<br />\n<br />\nO.<br />\n<br />\n••••11/01/1111<br />\n<br />\nL<br />\n<br />\nTorsatirlEsth Wear.<br />\n<br />\nBeal/ails' Chamber let, 1901.<br />\n<br />\nPres4dr4st.<br />\n.<br />\n•<br />\nDean of the Medical School,<br />\nDean of the College.<br />\n.<br />\n.<br />\n<br />\nIRA REMSEN.<br />\nWM.H. HOWELL.<br />\nEDW.IL RIFFIN.<br />\n<br />\nINSTRUCTION<br />\nFor Braduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medieine. (Courses for candidates for the degree of M. D.; coura.s for physicians.)<br />\nFor Undergraduates:<br />\n(c) A s candidates for the degree of B. A.<br />\n(d) As special students.<br />\nLibraries of Baltimore.<br />\n(Yiniversity<br />\nPeabody institute<br />\nPratt Lihr.a)<br />\n<br />\n••.<br />\n<br />\nLabora tories.<br />\nChemistry,<br />\nPhysics,<br />\n(4eolog7 and Mineralogy,<br />\nZoology,<br />\nA nu torny,<br />\nPit y Kil)logy<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic.<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nistory,7<br />\nEcimornies,<br />\nMathematics,<br />\n.PhysleS.<br />\n<br />\n100,000 volumes.<br />\nl'15.0e0 volumes.<br />\n•..,,O.000 volumes.<br />\nDirectors.<br />\nIra Bowler.<br />\nJoseph S. Ames.<br />\nWinieist E. Clark.<br />\nWilliam K. Brooks.<br />\nFiranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\neJ, .1. Abel.<br />\nJohn J. Abel.<br />\nitill la m 061er.<br />\n.<br />\nDirectors.<br />\nVeil L. Gildersleeve.<br />\nKirby P. Smith.<br />\nMaurice Bloomfield<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJ. M. Vincent.<br />\n.T. H. Hollander.<br />\nPrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nUndergraduates Courses (lead! lg to B. A.)<br />\n<br />\nAmorieers Journal of Illatkeesetles.<br />\nF. MORLIIT,\"Alter. Quarterly. Ste. Volume XXII<br />\nin progress. *per volume.<br />\nU. American Chouslleal everuaL<br />\nI. REMSEN, Editor. Monthly. Oro. Volume XXVII<br />\nin progress. $5 per volume.<br />\nIII. Americas Journal of Philology.<br />\nB. L. GILDERSLEEVE, Edithr. Quarterly.<br />\nVolume XXII in progress. $4 per volume.<br />\nTV. Studies from the Biological Laboratory.<br />\nVolume V complete. $5 per volume.<br />\nV. Studios In Historical and Political Science.<br />\nMonthly. Svo. Series XIX in progress. $8 PO<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary w014<br />\nIn progress in Fialthnore. 4to. Vol. XX in Pnr<br />\ngri•ms. Si per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly.<br />\n40<br />\n'<br />\nVolume XII in progress. $1 per year.<br />\nVIII. Johns Hopkinm Hospital Reports. 4to. Volume<br />\nIn progress. $5 per volume.<br />\nIX. Contributions to Asmyriology and Comparativl<br />\nSemitic Philology,(Beitrage zur Assyriologie,etc<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.CO<br />\nper volume.<br />\nT. Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. Ito. Volar140<br />\nXVI in progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. II. WELCH, Editor. Ili-monthly. Syn. Voltage<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insmnit y.<br />\nII ENB Y M. Wilt 0, Editor. Quarterly. Ito.,$5 Per<br />\nve hum..<br />\nXII'. Reports of Mary thud Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\nXV. Terre.: vial Magnetism and Atmospheric Fier\"<br />\nI Hefty.<br />\nI. A. 11.-117 ER, Editor. Quarterlf.<br />\n8\\0. Volume VI in progress. $2.50 per volatile'<br />\nXVI. Annual Report.<br />\nPresented by tire President of the Board of Trot'<br />\ntees, reviewing the operations of the Vuiversig<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of offieers end student f4, and stating<br />\nthe regulations, etc., of to University. Pute<br />\nli,./ted it the close of the academie year.<br />\n<br />\nGroups.<br />\nchissien1 (the \"Old College Course.\")<br />\nI. Mathematielil Physleiti,<br />\n(leading up to Engineering.)<br />\na. 4:lhemieal-ltiological.<br />\n(leading up to Medielneh<br />\n4. (eolopleol-iliological.<br />\n5. Latin Mathematical.<br />\nis. Historical-Political.<br />\nflooding up to Law.)<br />\nI. Modern Languages.<br />\naerial Publications.<br />\nEditors.<br />\nMathematics(,Vol. X X IV.)<br />\nFrank Morley.<br />\nChemistry (vol. X X VI).<br />\nIra Bentsen.<br />\nPhilo anr(vol. XXII.)<br />\nBasil L. Gildersleeve.<br />\nhistory (vol. X I X.)<br />\nJ.<br />\nVincent<br />\nModern ,stormwes(v01. XVI.) A. Marshall Klliott.<br />\nBiology (vol. IV.)<br />\nWilliam K. Brooks.<br />\nAss riologv (vol. TV.)<br />\nPaul Haupt.<br />\nExperimental Medicine(vol. VI.) W. H. Welch.<br />\n<br />\nProgrammes of the Courses offered to graduate studentsia Philosophy and the Arts, and in the School of<br />\nIledicdue, and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br />\n<br />\nIn addition to the serials above named, copies maY<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the<br />\nTestament. Edited by Prof. Paul Haupt. Pros<br />\ntug on application.<br />\nItowlan(Pm Photograph of the Normal Solar Spot:Arian'<br />\n'Opiates. $.10.00<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 110 pp. 4th. (A plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simile ed,i;<br />\nlion. Edited by J. Bendel Harris. 110 pp. 4to.<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac, MSS. with Antile<br />\ngomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographia Hopkinsiensim. Part I. Philology<br />\n. pr<br />\npat<br />\n11-111. Chemistry, Mineralogy and Geology.<br />\nIV-V- Vi.Physics, Astronomy and Mat hematica,<br />\n8 vo. 00 cents per part.<br />\na full list of publications will be sent on application.<br />\nCommunIcations in respect to exchanges and remIttennol<br />\nmag he sent to Johns Soutane Press, Baltimore. Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VI.<br />\n<br />\nAPRIL 9, 1902.<br />\n<br />\nNo, 13.<br />\n<br />\nTHE HONOR SYSTEM.<br />\nNUMBER of colleges in various parts of the country pride themselves on<br />\nthe fact that they, like the seven cities of Greece which claimed Homer<br />\nas a citizen by birth, have given rise to the Honor system. Wherever<br />\nand when the custom began need not occupy our attention. Throughout the<br />\ncollege world of America it has become a fixed institution from which great<br />\nbenefit, both to the faculties and students, has resulted in many directions. By<br />\nmeans of this adjustment of the conditions peculiar to a college examination,<br />\nresponsibility has changed hands, so to speak, and the student body is its own<br />\n<br />\n4<br />\n<br />\narbiter.<br />\n.<br />\nNow, the word \"system\" generally employed when referring to this method<br />\nis the condition upon which the larger part of its success rests; there may be a<br />\ncollege sentiment ruling amongst the majority of its students which stands for<br />\nthese in lieu of a prescribed agreement, but something more solid is needed.<br />\nrule spirit requires to be embodied, without which there is no tangibleness. At<br />\nth2 University of Virginia a pledge is signed by the student at each examination, the purport of which is a vow of honor not to have given, nor to have<br />\nreceived, any assistance at the examination in question. This custom dates<br />\nfrom the time when Jefferson founded the University, and is a time-honored<br />\ntradition. That it is still operative is seen from the report made by the newsPapers just recently of a case involving a breach of the law there and acted upon<br />\nby the students themselves. The Honor system at Princeton is not yet ten<br />\nYears old; in that institution the mode of procedure resembles the system at<br />\nVirginia and has gained a place in the college life from which there is amplest<br />\nreason to believe it will never be removed. The pledge runs as follows: \"I<br />\nPledge my honor as a gentleman that, during this examination, I have neither<br />\ngiven nor received assistance;\" for every student these words imply the strictest<br />\nadherence to the letter of the vow and not only for himself is this agreement<br />\nbinding, but it also makes each man a guardian of the sanctity of the pledge<br />\nWhereby any violation on the part of any member of the college would be instantly reported and the charge placed in the hands of the student committee to<br />\nPass judgment upon. Of course, owing to a lack, generally, in preparatory<br />\nschools of an honor system, the Freshmen are not conscious of the obligation<br />\nInvolved, and are, therefore, watched in the first semester examinations, but<br />\nafter that they are wholly responsible.<br />\n. From a few investigations among the undergraduates at Hopkins, the<br />\nwriter found very little of a definite character concerning the Honor system;<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nsome said there was a tacit understanding, among the undergraduates at least,<br />\nin regard to honor in examinations, and that an instructor could feel entirely<br />\nsafe in absenting himself from a room where an examination was being field.<br />\nOthers showed how, in refusing to give assistance at an examination, they had<br />\nbeen taken to task by those seeking it. Again, others were inclined to distrust<br />\nmen of their acquaintance when it came to the question of honor in examination.<br />\nThere is not the slightest doubt that Hopkins stands for the Honor system and<br />\npoints with just pride to the fact; however, from the vagueness -.which exists<br />\nand the varying views—or no views at all—it seems unfortunate that the establishment of a concrete system has not taken place ere this in the University.<br />\nThe undergraduate department is the most directly concerned in this matter,<br />\nand it devolves upon them to develop a working plan. Inasmuch as this<br />\ndepartment gives promise of increase above the other departments under the<br />\nnew conditions later on, nothing would be more satisfactory than to be able to<br />\npoint to a fixed Honor system, regulated and maintained by the students<br />\naccording to a definite plan. Such a scheme would early grow into a college<br />\ncustom and, in time, become a tradition distinctive and characteristic of the<br />\nUniversity.<br />\nIn the first place, a student council would be necessary; one member from<br />\neach of the three classes—the presidents of the classes could serve very acceptably—upon whom would fall the fulfilment of any duties incident to the operation of the plan. In the second place, a suitably worded pledge could be<br />\nsecured and adopted and any minor details attended to as occasion required.<br />\nIf there are men in the University who do not hold definite scruples with reference to examinations, some such method, as above described, would appeal to<br />\nthem and set them in line with the large majority of students who make the<br />\nmatter a point of conscience, and for these latter, the fixture, in tangible shape,<br />\nof a principle that already obtains in their midst would be a desirable good.<br />\n<br />\nHOPKINS IN FICTION.<br />\n<br />\neHE<br />\n<br />\nHOPKINS, being young in years, has not had the exploitation in fiction<br />\nwhich has fallen to the lot of older and larger universities. At last we<br />\nhave representation in the realms of fiction through a book written by<br />\nThomas Dixon, Jr., entitled \"The Leopard Spots.\" It is a tale of North Carolina during the period of reconstruction. Charles Gaston, the hero, is introduced at the close of the Civil War as a boy eight years old. He is carried<br />\nunscathed through a series of troubles and adventures which fall only to the<br />\nlot of heros in novels. The last-chapter lands him in the gubernatorial chair.<br />\nHis Hopkins experience is touched on lightly. There is a gap between the<br />\nintroduction of the hero at the close of the war and his return to North Carolina<br />\nafter all the honors won at Hopkins. Just the period which is most important<br />\nto us is skimmed over in the most exasperating manner. The heroine is Miss<br />\nWorth, a maiden who gains culture and refinement at Miss Carey's School in<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n3<br />\n<br />\nthis city. The writer deals with the continuous clash of whites and blacks in<br />\nthe South.<br />\nSome day we would like to see a volume from the same pen describing the<br />\ntrials and triumphs of Charles Gaston at Hopkins. While the material is not<br />\nas strenuous as the race question, it would be interesting and instructive to<br />\nknow how the hero arranged his clandestine interviews with the heroine immured in the boarding school.<br />\n<br />\nTHE A. B. DEGREE FOR MEDICAL STUDENTS.<br />\nELL deserved praise is always gratifying, but never more so than when<br />\nit is the unsolicited commendation of a rival. The current issue of the<br />\nColumbia Literary Monthly, in an article dealing with its medical<br />\nschool, takes occasion to refer to the splendid showing of the Johns Hopkins<br />\nMedical School. The article is an editorial appearing in the leading undergraduate paper of Columbia University, and takes up the question of a Bachelor of Arts degree for admission to their medical school.<br />\nreIt can be safely said that the Hopkins was the pioneer university for<br />\nquiring an A. B. degree of all desirious of taking up the study of medicine.<br />\nOther universities are deciding on the same requirements for admission, and<br />\nsoon a college or university of standing not requiring a degree will be a rarity,<br />\n<br />\neV<br />\n<br />\nindeed.<br />\nThe editorial does not hesitate to declare that the medical students at their<br />\ninstitution are not only uncultured, but often even uncouth. They lack the<br />\nPolish and refinement which are the results of university training.<br />\nIt is a regretable fact that many worthy men would be barred from the<br />\nstriving<br />\nprofession by the universal requirement of a degree, but what we are<br />\nfor is the greatest good for the greatest number. If the standard of the entire<br />\nthe Johns<br />\nmedical profession can be raised by this means, the medical school of<br />\non a deHopkins University will regard the fact that it was the first to insist<br />\ngree as one of its greatest triumphs.<br />\n<br />\nTHE PERCY TURNBULL MEMORIAL LECTURESHIP.<br />\nnow being<br />\nHR tenth course of the Percy Turnbull Memorial Lectures are<br />\nD.<br />\nHirsch,<br />\nG.<br />\nEmil<br />\nReverend<br />\ndelivered in McCoy Hall. The lecturer is<br />\nChiof<br />\ny<br />\nUniversit<br />\nthe<br />\nin<br />\nD., LL. D., Professor of Rabbinical Literature<br />\nvarious monocago, editor of \"The Reform Advocate,\" Chicago, and author of<br />\n\"Mediaeval<br />\nis<br />\nsubject<br />\ngraphs on Biblical and religious subjects. Rev. Hirsch's<br />\nwhich was<br />\nof<br />\nfirst<br />\nthe<br />\nJewish Poetry.\" The course consists of eight lectures,<br />\nby large<br />\nattended<br />\nbeing<br />\ndelivered on Tuesday, April 8th. The lectures are<br />\nin an<br />\nthem<br />\nto<br />\npresented<br />\naudiences, who are having the subject of Jewish poetry<br />\nentertaining, as well as in an instructive way.<br />\n<br />\nZ<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nTHE EASTER TRIP OF THE MUSICAL CLUBS.<br />\nHE Easter trip of the 'Varsity Glee, Banjo and Mandolin Clubs, proved<br />\none of the most successful ever made by the organization. The Clubs<br />\ncame out all right financially, and the concerts, especially the one given<br />\nat Richmond, were of a high order. The men, too,thoroughly enjoyed the trip.<br />\nThe Clubs, nearly forty strong, left Baltimore, by steamer, Good Friday at<br />\n6.30 P. M., and arrived at Old Point Comfort early the next morning. The<br />\npleasures of the first day consisted chiefly in playing ping-pong and the slotmachines, alternately. Most of the men were more successful at the former,<br />\ndespite many tales of how the \"Dewey\" was hit by them almost every time.<br />\nThe writer knows whereof he speaks, having tried to his sorrow, both games<br />\nrepeatedly. The men were invited to the base-ball game in the afternoon<br />\nbetween Yale and the Fort Monroe artillerymen.<br />\nIn the evening, the concert was given in the ball-room of the \"Hygeia.\"<br />\nThere were over three hundred people present, and all seemed to enjoy the concert very much. The Glee Club was the best, for the instruments of the other<br />\ntwo were affected by the dampness. The vocal solos of Mr. Gilman and Mr.<br />\nAtkinson, and the banjo solo of Mr. Edgeworth Smith were encored two or<br />\nthree times. After the concert, most of the men attended the large dance given<br />\nby the management of the \"Chamberlin.\" There were many pretty girls present from the Fort and from the nearby towns of Norfolk, Hampton, and Newport News, as well as the guests of the hotel.<br />\nSunday was spent in church going, sight-seeing, visiting, yachting, and<br />\nloafing. At night, there was considerable excitement caused by the incorporation of a new grand-trunk railway to cover districts not covered by the Northern<br />\nSecurities Company. The incorporators and chief stockholders of the road are<br />\na well-known New York capitalist of Wall street, and his friend, a wealthy<br />\nphysician, and a few members of the Clubs, who modestly request that their<br />\nnames be not published. The floating stock of the new road consists of a handsome combination baggage and passenger truck, with all the advantages of the<br />\nmodern observation-car. It is furnished with finely upholstered chairs loaned<br />\nby the management of the \"Sherwood.\" The power employed is negro handback, and leg-power. The termini of the road are the Old Point pier and the<br />\n\"Sherwood\" hotel. Owing to labor troubles, a corporal's guard had to be<br />\ncalled out Sunday night to protect property and to preserve order.<br />\nAfter pictures of the Clubs were taken by Mr. Carver, Monday morning,<br />\nManager Hill hurried the men off to Richmond. Here the more fortunate of<br />\nthe men stayed with private families, while the rest suffered the agonies of the<br />\nboarding house. After spending the afternoon in golfing with the fair ones of<br />\nRichmond, and in other ways, the men assembled at the Woman's Club for the<br />\nconcert, which was given for the benefit of the King's Daughters. The hall<br />\nwas crowded to the doors, and the \"Standing Room Only\" sign had to be hung<br />\nout. The feature of the concert was Mr. Atkinson's solos. \"Good bye Booze,\"<br />\nparticularly, seemed to strike the fancy of the maidens, who said it just seemed<br />\nto suit the singer. The instrumental clubs got in some snappy work in this<br />\nconcert. The evening concluded with a small, young dance, a Welsh rabbit<br />\npatty, and other festivities.<br />\nThe next morning the men were invited to a luncheon at the Lakeside<br />\nCountry Club. This was most enjoyable. The charms of the Richmond belles<br />\nproved too much for some of the men, who missed the train for Old Point.<br />\nThose who took the regular train had much fun at the conductor's expense reversing the \"Jim Crow\" sign.<br />\nAbout fifteen of the men stayed over at Old Point an extra day at their<br />\nown expense, but the bulk of the men returned by boat Tuesday night, arriving<br />\nat Baltimore Wednesday morning.<br />\n<br />\ne<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n5<br />\n<br />\nAMONG THE COLLFGES.<br />\n<br />\nA<br />\n<br />\nOMETIME this month the performance of a Greek tragedy, Sophocles'<br />\nAntigone, accompanied by Mendelssohn's music for the lyrical songs, will<br />\nhe given by the students and Faculty of Leland Stanford University.<br />\n<br />\nThe lacrosse squad at the University of Toronto is out for practice. A team<br />\neven stronger than last year's is counted on, as nine of the old men are back.<br />\nManager Slemons, of the Lacrosse Team, has received several letters from<br />\nnorthern colleges asking for games. As yet nothing definite has been decided<br />\nUpon, as Manager Slemons has not been able to arrange the dates.<br />\nLehigh defeated the Moravian Theological Seminary in debate, although<br />\ntheir opponents were older and more experienced talkers. Lehigh had the<br />\nResolved, That Congress should establish a sysaffirmative of the question:<br />\ntem of ship-subsidy.\"<br />\nJune 26 has been decided upon for the date of the Yale Harvard boat races.<br />\nThere will be three races: the four-oar, Freshman, and eight-oar contests.<br />\nMiss Julia Marlowe contributes to a recent number of \"The Inlander\" an<br />\narticle on \"The Duty of the University Man to the Theatre.\" It is a plea for<br />\nthe study of modern dramatic literature by the college man, and a plea for his<br />\naid in elevating the stage. Miss Marlowe feels sure that if the University Man,<br />\nby an intelligent interest in matters theatrical, would speed the day when we<br />\nwould have the endowed theatre, that last flower of dramatic development.<br />\nGoethe's \"Iphigenie auf Tauris\" was presented by the stock company of<br />\nthe Irving Place Theatre for the benefit of Yale students at New Haven to a<br />\ncrowded house. Mr. Conreid, the manager, has given several college performances in order to arouse interest in the best German literature, and at the same<br />\ntime to elevate the standard of dramatic performances in this country.<br />\nOne of the most interesting events in the Eastern college world is the<br />\nannual dramatic production of the \"Mask and Wig Club\" of the University of<br />\nPennsylvania. Each year around Easter time a play is given, first at the University and then in Atlantic City. Very often one of the large theatres of<br />\nPhiladelphia is secured, and the play has the regular weekly run of the legitimate. It is always original, and so far every play has been written by a Pennsy<br />\nman. Sometimes the music is original, but generally the songs are adaptations<br />\nof well-known airs. The productions always are received with great enthuaiasm<br />\nnot only by people connected with the University, but by the residents of Atlantic City and Philadelphia as well. This year's play is entitled \"King Cole,\" a<br />\nmusical comedy, said to be very entertaining and excellently acted.<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nTHE NEWSLETTER.<br />\nPublished Fortnightly during the University Year by the Students of Tim JOHNS<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nAPRIL 9, 1902.<br />\nSubscription $1 50 per year.<br />\nEditor in Chief<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n.<br />\n<br />\n10 Cents a single copy.<br />\n•<br />\n<br />\nROBERT S. LANIER, 1903.<br />\n. HARRY K. TOOTLE, 1903.<br />\nSOLOMON BLUM, 1903'<br />\n•<br />\nGEORGE A. FOSTER, 1904.<br />\nREGINALD S OPIE, 1904.<br />\n<br />\nAssistant News Editors,<br />\n<br />\nW.S. BIRD, 1903.<br />\n<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\nAUBREY PEARRE, JR., 1902.<br />\n. I-TARRY BAETJER, 1903.<br />\n<br />\nAddress all articles, communications, etc, to ROBERT S. LANIER, box 374, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483,<br />\n<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\nt<br />\n<br />\nHE NEWS-LETTER in this issue prints a timely article on the honor system.<br />\n<br />\nAs the Johns Hopkins University has been regarded as one of the strongest of the advocates of the honor system, this article may cause some comment because of its reference to the attitude of the undergraduates. All we desire is a crystallization of the opinion of the student body into some well defined<br />\nexpression on the subject. The writer is one who can well speak with authority, being in a position to appreciate the sentiments both of the instructor and<br />\nthe undergraduate. We regard the suggestion of an undergraduate council with<br />\nfavor. Not that there exists any glaring violation of the honor system; but<br />\nthat it would serve as a check on any downward tendency, and would serve as<br />\na board which would at all times jealously guard the honor of our university.<br />\nExpressions of opinion on this subject are invited from readers of the Nims-<br />\n<br />\nLETTER.<br />\n<br />\nT took some time for the jewelers and flag-makers to realize that Hopkins<br />\nspirit was high enough to warrant the making of J. H. U. flags and pins,<br />\nbut last year the Homewood announcement seemed to flood the market<br />\nwith Black and Blue. At present one can go into any store in Baltimore and<br />\n<br />\n3<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n7<br />\n<br />\nget whatever he wants in black and blue, but the jewelers seemed to be afraid<br />\nto make the University Seal. At last, however, the seal is being shown, and<br />\nseveral merchants have submitted to the students samples of the seal engraved<br />\nin gold. This indicates that stock in the University is higher now than ever<br />\nbefore. If the merchants are willing to trust in enthusiasm of the students, the<br />\nstudents themselves must have good hopes for the future. There can be no<br />\ndoubt that the seal will be popular, and there can also be no doubt that this<br />\nrise in Hopkins stock is due to the announcements made at the Commemoration<br />\nDay exercises. We anxiously await another announcement, and even more<br />\nevidences of faith in Hopkins.<br />\nITH this issue the representatives of the Junior and Freshman Classes<br />\ntake upon themselves the management of the NEWS-LETTER. We desire to congratulate the retiring members of the board, Messrs. Strouse,<br />\nSlemons, and Murphy, upon their untiring efforts in making the NEws-LiirriiR<br />\nthe success it has been during the past year. As editor-in-chief Mr. Strouse has<br />\nalways devoted his entire time and attention to making the NEws-Lri:TTER a<br />\nrepresentative college publication. Under his management the paper has come<br />\ninto closer touch with the student body and has assumed a more distinctive undergraduate tone. It is the intention of the present board of editors to pursue<br />\nthis policy, and to aid us in this endeavor we earnestly solicit the co operation<br />\nof every Hopkins man, and particularly the undergraduates. A vacancy now<br />\nexists on the editorial staff of the NEWS-LETTER, and an opportunity is thereby<br />\nafforded for a display of ability among the men aspiring for a place on the staff<br />\nas an athletic editor. A position upon the NEWS-LRTTER gives a man good,<br />\npractical experience in literary training, which will prove valuable to him in<br />\nafter years, and we strongly urge those who are desirous of obtaining this position to hand in at once articles relating to athletic events at Hopkins.<br />\n<br />\nTo<br />\n<br />\nPrai.HE lacrosse team has opened its season by a victory. But with Hopkins<br />\nplaying the University of Pennsylvania a victory is expected, and though<br />\nour team did all that was to be expected .of them for the first game, it<br />\nhas hard work before it to get in championship form. The lacrosse team always<br />\nPlays the best teams it can arrange a schedule with, and the students are always<br />\nloyal in their support whether we win or lose. This is somewhat of a contrast<br />\nto the support given by the undergraduates to the meet last Saturday night.<br />\nIf there is any complaint about the attendance of the students at these games,<br />\nit can be directly traced in most instances to one cause: Our opponents were<br />\nnot in a class high enough for its. The students would rather have the athletic<br />\nteams defeated by a good college than will such an empty honor as the relay<br />\nrace last Saturday night.<br />\nTo the Editor of the NEWS-LETTER:<br />\nThe writer passed his Easter vacation with college men from Harvard,<br />\nPrinceton, Yale, Cornell, and Lafayette, and among many other things connected with their college life which he was led to admire, was their familiarity<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nwith their college songs and the great enthusiasm with which they were sung.<br />\nEach one of these colleges has a book of its songs—words and music. This<br />\nfact is the cause of this letter.<br />\nWhy has not Hopkins a book of songs? It is not because we lack the<br />\nsongs themselves. The Black and Blue compares favorably with any other<br />\ncollege anthem. \"Alma Mater in Dixie Land\" is a splendid march. The \"Ver<br />\nitas Vos Leberabit\" (known to so few of us) is excellent both in music and in<br />\nwords. Our Dummyline Song has a good dash and swing. Surely these and<br />\na few others that we have could form a nucleus for a very creditable book. It<br />\nis almost a waste of your valuable space to speak of the benefits to be derived<br />\nfrom such a book. There is no more natural way for a man to give expression<br />\nto his college enthusiasm than by singing his college songs. There is nothing<br />\n(and this is more important) that spreads college spirit so much as the wide<br />\ndissemination of these songs. It may be urged that we are a small college,<br />\nand that published songs are not as necessary for Hopkins as for a larger college. Hopkins, with its one hundred and sixty undergraduates, must make<br />\nuse of each one of them. We can't afford to have one laggard in our midst.<br />\nEvery Hopkins man must be to some extent a propagandist to spread the Hopkins idea. The best way to do this is to popularize those things that best represent our college spirit. Nothing does this better than our songs.<br />\nThe writer has been informed that the musical clubs contemplate publishing<br />\na book of songs. If this is so, why not hurry it up? The sooner we get it the<br />\nbetter. Without presuming a knowledge of the financial condition of our musical clubs, it seems that they could well afford to bring out a book like this. If<br />\nthe musical clubs are unable to bear the burden alone, would it not be possible<br />\nfor the NEWS-LETTER to help them out? We wouldn't need an \"Edition-deLuxe,\" or anything magnificent What we need is a start—a humble start,<br />\npossibly; hut, at any rate, a movement. The club or institution that will aid<br />\nHopkins men to spread the Hopkins spirit, will have justified its right to exist.<br />\n1903.<br />\n<br />\nThe NEWS-LETTER has received the following letter from Mr. George M.<br />\nClarke, '98. We are glad of the opportunity to correct the statement published<br />\nrecently in a local paper:<br />\nEditor in Chief of the NEWS-LETTER,<br />\nJohns Hopkins University.<br />\n<br />\nDEAR SIR:—A friend has sent me a clipping from the Baltimore News of<br />\nlast week in which I, under the name of Roy Clark, am supposed to have signed<br />\na National League contract with the New York Base Ball team. This is clearly<br />\nan error, as I have long since given up base ball and begun the practice of law.<br />\nTruly yours,<br />\n<br />\nGEORGE M. CLARKE.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n9<br />\n<br />\nItiminlimilimiminammumilumininutiliiiimiumiummilimmtiloniiimilinuoilimilluninuohfifillimolloollthiuk •<br />\nC..;<br />\n<br />\ns<br />\n<br />\n1<br />\n<br />\n1111101011.<br />\nt<br />\n•<br />\n<br />\n.<br />\n<br />\nMeetem glk,liftOP'MI<br />\n<br />\n1<br />\n<br />\ng<br />\ne.\"001,<br />\n<br />\nNI\"<br />\n<br />\n1111111111111111111111111011111111111111111R1111011111111111101111111111011111111111111111131111111101i11111111111111f111111i1111111111111111111111111111111M1111/1111gUlti,7!;,4;qil,iil,T,Iiii<br />\n<br />\nMr W. S. Weedon has been apppointed research chemist of the General<br />\nElectric Co., of Schenectady, N. Y. Mr. Weedon received the degree of S. B.<br />\nat the Maryland Agricultural College in 1897, and for several years has been a<br />\ngraduate student in chemistry. In June he will receive the degree of doctor of<br />\nphilosophy, and shortly afterwards will enter upon his new duties.<br />\nThe American Philosophical Society held its first annual meeting at Philadelphia on April 4. Dr. Wm. K. Brooks read a paper on scientific research.<br />\nAt the banquet held the same night President Remsen spoke on \"Our Universities,\" and Dr. Wm. Osler on \"The Future of Science.\"<br />\nDr. I,. A. Bauer, Chief of Division of Terrestial Magnetism, United States<br />\nCoast and Geodetic Survey, will deliver a course of four lectures beginning on<br />\nApril 28, on \"Terrestial Magnetism.\" The lectures will be illustrated by<br />\ncharts, diagrams and lantern slides.<br />\nSeveral weeks ago the Field Foray Club made an excursion, in which two<br />\nhundred and fifty of its members participated, for the purpose of collecting<br />\nfrog's eggs for future hatching. Dr. Caswell Grave, with a dozen assistants,<br />\nhad charge of the crowd.<br />\nDr. Geo. B. Shattuck, of the Geological Department, has been in the Everglades of Florida for the past few weeks. After leaving the great swamp he<br />\nWill cross to the Bahama Islands for a study of the geological phenomena there.<br />\nDr. Shattuck expects to be absent until the first of next month.<br />\nPresident Remsen was the guest of honor at the banquet of the New York<br />\nAlumni Association of the University, held at the University Club, New York,<br />\non the night of April 5.<br />\nThe memorial volume to the late Prof. Herbert B. Adams, the preparation<br />\nof which has been going on for several months, is now ready for distribution.<br />\nIt is divided into two parts. The first parts consists of tributes to the historian<br />\nfrom his friends and the learned societies in which he held membership. The<br />\nsecond part is a complete bibliography of the writings of all the graduates of<br />\nhis department of history, economics and politics.<br />\nThe success of \"senior week\" last year was so pronounced that the practice<br />\nwill probably be continued this year. Though nothing official has yet been<br />\ndone about the matter, many individual expressions of opinion have been heard<br />\nfrom members of the class of 1902 in favor of the custom. As senior week is<br />\nthe last revival before departure and separation, it seems that the week should<br />\nbe made tradition.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\nY. M. C. A. NOTES.<br />\n<br />\nt<br />\n<br />\nHE annual Spring Reception, to which the members of Y. W. C. A. of the<br />\nWoman's College were invited, occurred on March 14th, and was greatly<br />\nenjoyed by the large number present. Messrs. Addison, Grove and<br />\nGraff spoke on the recent Student Volunteer Convention in Toronto, and<br />\nmusical numbers were rendered by Messrs. Miller, Haughton, Willis, and<br />\nTaneyhill.<br />\nThe annual Spring Conference of Presidents of the Eastern College Associations, was held at Schenectady, N. Y., April 3-6. Hopkins, as usual, was<br />\nrepresented.<br />\nSome forty new accessions have been made to the Association Library<br />\nduring the year. A few by purchase, some as the gift of Dr. Howard Kelly,<br />\nand the twenty-one volumes of \"The Gospel in All Lands,\" as a present from<br />\nthe editor, Rev. a R. Smith.<br />\nThe Executive Council will hold its regular monthly meeting Thursday,<br />\nApril 10, at 5 P. M.<br />\nThe annual election of the officers of the Association will take place on<br />\nTuesday, April 15, at 5 P. M. All members are strongly urged to be present.<br />\nThe 1902 Handbook is just going to press and promises to be even more<br />\nattractive than ever.<br />\n• The Committee on Northfield met on Friday, April 4th, at 5 P. M., and<br />\nadopted progressive measures looking to a canvass of the members of the University. The matter will be presented to the student body in an attractive form<br />\nby means of stereopticon illustrations on Friday, May 2, at 7.30 P. M. The<br />\nnext meeting of the committee will be held Saturday, April 12th, at 11 A. M.<br />\nH. W. Plaggemeyer is chairman, and the other members are J. G. Machen, J.<br />\nA. Addison, R. C. Pagon and F. C. Blanck. Ten delegates from Hopkins were<br />\nat Northfield last summer and at least twenty are expected to be in the Hopkins<br />\nCamp this year. Talk with the committee.<br />\n<br />\n\"HULLABALOO CLUB.\"<br />\nLTHOUGH \"Senior Club\" will be the official title next year, the Class of<br />\n1903 has temporarily adopted for their social organization, the name<br />\n\"Hullabaloo Club.\" This certainly has a Hopkins' ring to it, and is<br />\nnot ambiguous, as \"Senior Club\" would be at present. The Board of Governors have been actively at work, and have accomplished much toward definite<br />\norganization. The constitution is now before the class for acceptance, and the<br />\nclub's activity will be manifest: Rooms will probably not be secured before<br />\nnext fall, but interest will not be lacking in the meantime.<br />\nThe first social event under the auspices of the Club will be a \"smoker,\"<br />\nwhich will take place Saturday evening, April 19. The committee of arrangements consists of Messrs. Plaggemeyer, Tootle, Riley, Hildt, and Hoffman.<br />\nThe Board hopes to arrange a second Smoker before the term closes.<br />\n<br />\n4<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n11<br />\n<br />\nLACROSSE.<br />\nSchedule Season of 1902.<br />\nAPRIL 12, Hobart College at Baltimore.<br />\nAPRIL 19, Harvard at Baltimore.<br />\nAPRIL 25, Lehigh at South Bethlehem.<br />\nMAY, 3, Columbia University at Baltimore.<br />\nMAY 10, Swarthmore at Baltimore.<br />\nPlace of playing home games will be announced later.<br />\n<br />\nHOPKINS, 5; PENNSYLVANIA, 1.<br />\nHE lacrosse team played its first out of-town game last Saturday<br />\n<br />\nt<br />\n<br />\nat Philadelphia against the University of Pennsylvania. Although<br />\nthe result was a 5 to I victory for Hopkins, yet the general work of the<br />\nteam was by no means up to the usual standard. At times even the older men<br />\nWere guilty of poor stick work and good team play was exceedingly scarce.<br />\nSome excuse is to be found, however, in the fact the contest was the first of<br />\nthe season, and that the usual disadvantages of a foreign field, and a hostile<br />\ncrowd were encountered.<br />\nCaptain Schmeisser agreed that the work was somewhat off color, but said<br />\nthat such is generally the case in the opening game.<br />\nIn the first half Hopkins went in on the jump, but \"Pennsy\" seemed prepared, and not until after ten minutes play did B. Bernheim score the<br />\nstart matters, and before the half<br />\nfirst goal. This seemed to<br />\nlast being<br />\nmore in the net, the<br />\ntwo<br />\nplaced<br />\nended Putts had<br />\nPennsylhalf,<br />\nsecond<br />\nthe<br />\nIn<br />\nBernheim.<br />\nB.<br />\nfrom<br />\nmade on a clever pass<br />\na long<br />\nmade<br />\nSmith<br />\nplay.<br />\nminutes<br />\nten<br />\nafter<br />\nvania made her only score<br />\nAs it<br />\nposts.<br />\nthe<br />\none<br />\nof<br />\nstrike<br />\nto<br />\nenough<br />\nnear<br />\ncame<br />\nshot for goal which<br />\nscooped<br />\nquickly<br />\nand<br />\nspot<br />\nright<br />\nthe<br />\nat<br />\nbe<br />\nto<br />\nhappened<br />\nbounced out Deschweintz<br />\nit in the net. Excepting this time, Briscoe had very little work to do before<br />\nthe net. The last two goals were made by Sayler and Putts. The new men,<br />\nBird, Custis and Blanck—were probably a little nervous on their first appearance as lacrosse players. On the whole, however, their work deserves favorable comment. Abercrombie was, as usual, very fast, but he and P. Bernheim<br />\nwere unable to do the usual tricky \"stunts\" which marked their work in the<br />\nmidfield last season. The team lined up against Pennsylvania as follows:<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nPutts, inhome; B. Bernheim, outhome; Sayler, first attack; Bird, second attack,<br />\nP. Bernheim, third attack; Abercrombie, centre; Custis, third defense; Blanck,<br />\nsecond defense; H. Straus, first defense; E. Schmeisser point; W. Schmeisser,<br />\ncover point; Briscoe, goal.<br />\nThe practice this week has been very effective in developing team work,<br />\nand a much stronger game is expected with Hobart College on Saturday afternoon. It is the first home game, and every man should turn out to give the<br />\nteam a rousing reception. It will take all kinds of hard work to land this<br />\nseason's championship, and too much encouragement cannot be given the<br />\nplayers.<br />\nThe daily appearance of a full scrub team during the season is worthy of<br />\nmention. They have it in their power to greatly aid the regulars in gaining<br />\nstrength. Several of the most promising scrubs will have a good chance to<br />\nfigure in some of the games before the end of the season. Let every one come<br />\nout faithfully!<br />\nTough was unable to play last Saturday on account of a sprained knee.<br />\nHe is greatly improved and will probably fill his old position at third defeme<br />\nagainst Hobart College on Saturday.<br />\nHOPKINS VS. ALL-BALTIMORE.<br />\n<br />\nt<br />\n<br />\nHE lacrosse team opened its local season at Electric Park on Wednesday of<br />\nlast week in a very creditable game with All-Baltimore. In the first half<br />\nthe 'Varsity attack ran All Baltimore off its feet and scored seven goals<br />\nbefore the whistle blew. In the second half Captain Sehmeisser reversed the<br />\ndefense, thus placing one half of Hopkins against the other. This, of course,<br />\ngave All-Baltimore a decided advantage, and five goals were scored to one by<br />\nthe 'Varsity.<br />\nAltogether the work of the team was very creditable for the beginning of<br />\nthe season. The continued bad weather has kept the men from practicing out<br />\nof doors a great deal, but the team play was fairly good and the men seemed to<br />\nhave plenty of endurance. Abercrombie was of course all over the field, and<br />\nkept the mid-field men busy holding his pace. Sayler and Bird on the attack<br />\nboth show improvement, and Blanck and Custis on the defense played a strong<br />\ngame.<br />\nThe weight of all the new men is decidedly above that of the players lost<br />\nsince last season. This is a decided advantage, for the lack of weight and endurance was mainly accountable for the loss of the Swarthmore game last year.<br />\nAltogether our championship prospects are reasonably bright. Next Saturday<br />\nwe play Hobart College at the.American League Park. Let every rooter show<br />\nhis loyalty to the 'Varsity.<br />\nThe lacrosse management has been having some trouble in finding a place<br />\nto play, as through a misunderstanding with the American League officials,<br />\nsome of the dates conflict. Place of games will be announced later.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\nTRACK AND FIELD.<br />\nTHE CAGE GAMES.<br />\n<br />\nZ<br />\n<br />\nHE first invitation games ever given by the Johns Hopkins Athletic Asso-dation in the cage took place last Saturday night. The gallery and the<br />\nwindows of the gymnasium were packed and a good sized crowd found<br />\nseats inside the track. There was not a hitch to mar the performance, everything going off on schedule time. As these games were the first ever attempted<br />\nin the cage, great praise and credit are due the games committee and Mr.<br />\nMackdermott, for bringing them to a successful issue.<br />\nGeorge B. Scholl, after the conclusion of the high jump, went after the<br />\nHopkins record, and cleared the bar at 5 feet 11% inches, thus making a new<br />\nrecord. No other records were in danger.<br />\nThe contest which aroused the most enthusiasm was a relay race of youngsters from the Boys' Latin School. It was anyone's race up to the finish, when<br />\nthe Tadpoles won from the Shrimps by a narrow margin.<br />\nThree men were entered by the Naval Academy at Annapolis, and McNair,<br />\nSO n of Admiral McNair, crossed the line first in the 880 yard run. The presence<br />\nof the middies was especially gratifying to Hopkins men, since this was the<br />\nfirst time that the men have ever contested away from their home grounds.<br />\nThe 30 yard dash for preparatory schools was won by H. R. Coppage (6<br />\nft.), Delcher second; and W. S. Bayless, third. In the 30 yard dash, open,<br />\nWeedon, Pessagno, Herzog, and Riggs qualified for the finals, and finished in<br />\nthe order named.<br />\nIn the quarter mile run R. C. Hoffman, Jr., showed splendid form, and was<br />\nnever headed after he took the lead. LeCron, second; and Requard, third.<br />\nTime, 1:20.<br />\nThe mile run brought together a number of good men. England's long,<br />\nsprin g y stride carried him across the tape an easy winner. M. Price, second;<br />\nand Porter, third. Time, 5:12 3-5.<br />\nIn the quarter mile run, scratch, for preparatory schools, Robinson was the<br />\nwinner, with W. S. Bayless, second, and McClure, third. All the place winners were from the Boys' Latin School. The time, 1:03, was some seconds<br />\nfaster than the time in the open event.<br />\nThe 880 yard run was one of the most hotly contested events of the meet.<br />\nMcNair, U. S N. A., won, with Mullen second, and R. C. Price third. Time,<br />\n2:13.<br />\nThe running high jump was won by Randall (234 inches); Scholl, second,<br />\nand Lawson, third. Randall's actual jump, 5 ft. 834 inches. Scholl's jump,<br />\nscratch, 5 ft. 1034 inches.<br />\n.<br />\nThe sixteen pound shot put was won by Nelson; actual put 38 feet 7%<br />\ninches. Lawson was second, and Curran third.<br />\nIn the relay races the Central Y. M. C. A. defeated St. Leo's Gymnasium,<br />\nand the Washington Y. M. C. A.<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nThe Boys' Latin School defeated Deichmann's in a three lap relay. The<br />\nBaltimore City College won with ease from the Park Athletic Club. Marston's<br />\nSchool finished ahead of the Friends School in an exciting race.<br />\nThe Hopkins team forged ahead of the men from Columbian University,<br />\nand could never be caught. Time, 3:43 3-5.<br />\nAs usual, Hopkins scored the greatest number of points; 32 being placed<br />\nto the credit of the Black and Blue. The Boys' Latin School was second with<br />\n18, and Deichmann's third with 8.<br />\n<br />\nHOPKINS IN SATURDAY NIGHT'S GAMES.<br />\nEEDON'S running in the 30 yard dash, open, was of the first-class. His<br />\nstride was tremendous, and his pace was of the real \"steam roller\"<br />\nkind. Passagno, who ran from a mark back, of \"lanky Bill,\" was<br />\nclose to his running mate at the finish. He got a beautiful start and ran well.<br />\nIn the 440 yards, Curzon Hoffman ran a grand race, showing great nerve<br />\nand endurance, which was to be especially admired from the fact that he ran an<br />\nextra lap, due to an error by the judges, at the finish. The fact that another<br />\nlap was run may be shown thus: Hoffman, from scratch in the cage in practice, has run under watch a quarter in 60 seconds. He was running much<br />\nfaster than that Saturday night, manifestly by 2 or 3 seconds, and had besides,<br />\na handicap of 25 yards. His time was 1:20, just about the time required to run<br />\nan extra lap when a man is slightly groggy after hard work. Le Cron should<br />\nhave kept on instead of stopping at the real end of the race; but his work was<br />\nvery creditable.<br />\nPorter's work in the mile was good. He must learn, however, to take<br />\nadvantage of a handicap, and adapt his pace accordingly. We congratulate<br />\nhim heartily on his work. He has been faithful in his training all the year,<br />\nand now, with finishing touches, will be a winner.<br />\nScholl this year is expected to do over 6 feet in the high jump. Lawson,<br />\nin the shot and high, did nice work.<br />\nAltogether, the meet was successful and encouraging to the captains of the<br />\nteams. We are glad to have had our friends from the Naval Academy with us;<br />\nthey are sportsmen of the true gentlemen type, and made many friends by their<br />\ndignified behavior on the athletic field. Such a spirit is needed more in our<br />\ncity. Many times in the mad rush for prizes, others are forgotten, A small<br />\npiece of gold or bronze is nothing in comparison with the sense of having competed cleanly and honorably; and, if beaten, taking the defeat in the right<br />\nspirit.<br />\n<br />\nV<br />\n<br />\nThe suggestion that has been made for Hopkins to hold the games for the<br />\nDaily News Cup, seems to be meeting with universal approval. As the University will bear the entire expense of the undertaking, all ,the other teams will<br />\nhave to do will be to enter their men. The seventeenth of May has been decided<br />\nupon for the date of the contest, which will take place at Electric Park.<br />\n<br />\n\fTHU NEWS-LETTER.<br />\n<br />\nSHARPS AND FLATS.<br />\nA COMPLAINT.<br />\nIn the tropic seas a sailor<br />\nFor the iceberg cold is yearning.<br />\nMad he lies there with the fever,<br />\nAnd the sun upon him burning.<br />\nBut the iceberg in the Northland<br />\nHas not seen his mad endeavor,<br />\nCan not know his futile longing,a<br />\nAnd his pain which lasts forever.<br />\nSo does she, proud and disdainful,<br />\nNever know that I am sighing,<br />\nCan not see I madly love her,<br />\nCan not see that I am dying.<br />\n'03.<br />\n<br />\nA LAMENT.<br />\nIn the highest Cs a singer<br />\nFor his top note shrill is yearning,<br />\nAnd he tries for it with vigor,<br />\nWhile his audience is squirming.<br />\nBut that high note in the high Cs<br />\nIs beyond his mad endeavor,<br />\nAnd his longing is most futile—<br />\n'T is beyond his reach forever.<br />\nSo we flee, proud and disdainful,<br />\nWill not listen to his sighing,<br />\nWill not hoar him madly try it,<br />\nIf this once we escape dying.<br />\n'04.<br />\n<br />\nA REGRET.<br />\nShe has left me, and no longer<br />\nShall I see her as of yore,<br />\nFor a better man has won her,<br />\nShe will never see me more.<br />\nI can't blame her, and there's only<br />\nOne regret my being thrills,<br />\nThat the plunks which went for roses<br />\nDid not go to pay old bills.<br />\n'05.<br />\n<br />\nA.TRAGEDY IN ONE ACT,<br />\nAdmiration, queer sensation,<br />\nTrepidation, then elation.<br />\nHe's in love above his station.<br />\nMamma says it's a flirtation;<br />\nPapa views with perturbation;<br />\nSends her off to a relation.<br />\n(THE END.)<br />\n<br />\n15<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nORIGIN Olt COLLEGE SPEECH.<br />\nTobacco cutting machines he'd fed<br />\nTill heat his brain had jarred,<br />\nC'ercome, he fainted, and then they said:<br />\n\"Poor fellow! he plugged too hard.\"<br />\nTwo frightened horses ran away,<br />\nA policeman hearing a scream,<br />\nDashed in pursuit—I heard one say:<br />\n\"Do you think he will make the team?\"<br />\n—Notre Dame Scholastic.<br />\n<br />\n'04—Doing anything in athletics?<br />\n'05—Yep, putting the shot.<br />\n'04—What, you?<br />\n'05—Sure! joined the Gun Club.—Harvard Lampoon.<br />\nThe sun shone lividly upon the scene. With one stroke of the axe the<br />\nLord High Executioner severed the head of the prisoner from his body. With<br />\nsteady hand and firm voice he held up the dripping head and cried: \"Lo, this<br />\nis the end of all traitors.\" And amid the thrilling silence a small boy inquired:<br />\n\"Which end?\"—Princeton Tiger.<br />\n\"You are a brick\" I did aver<br />\nTo Daphne, by my side,<br />\n\"A sort of pressed brick, as it were,\"<br />\nShe roguishly replied.<br />\n—Ex.<br />\n<br />\nUNCLE WHALE—\"I hear you're in a school now Willie, what do you learn<br />\nthere?\"<br />\nWILLIE WHALE—'`Nothin' much 'cept to spout.\"—Przncelon Tiger.<br />\n<br />\nCrowded car, straining strap,<br />\nSudden curve, lady's lap.<br />\n—The Batchelor.<br />\n<br />\n\fThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\n14- E. Cor. Charles and Fayette Sts.,<br />\n<br />\n'Phone. C. & P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br />\n<br />\nOSTEOPATHY<br />\nti a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nW.D. BOWEN,M.D., D.0.,<br />\nFrost. & Mgr.<br />\nESTABLISHED 1879.<br />\n<br />\nWed<br />\n<br />\nholiday<br />\nSilver Wits<br />\nIN GREAT VARIETY.<br />\n<br />\n44ke.CIEll elk<br />\n<br />\nJEiNKINS'<br />\nBIS N.<br />\nCHARLES ST.<br />\n<br />\nSilversmiths.<br />\n<br />\nlienderson's<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nMadison & Howard Sts.<br />\n<br />\nText et<br />\n—00ka Note Books,<br />\n—t'Supplies.<br />\n<br />\nMARIA BUIE, 1) 0.,<br />\nV.-Prest. & Asst. lticeiy.<br />\n<br />\nTHEO. WAANKR.<br />\nJACKS R. PAINS.,<br />\nNNT<br />\nFR<br />\n142 8c QQ.<br />\nuNIBRELLAS, HATTERS, CANES, ETC.<br />\nA; et for I ineoln & Bennett and<br />\nWalter Barnard'a London Hats.<br />\n824 WEST 13A LaTINUM P.1 STREET.<br />\n<br />\nger<br />\nCUSHZ & COMPANY,<br />\n<br />\nManufacturers of<br />\nSilk and Cassiinere Hats.<br />\n<br />\nSsono<br />\nKeeps constantly on hand the Text Books used in Johns<br />\n<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nR. ElSENBRANDT SONS,<br />\nMUSICAL INSTRUMENTS.<br />\n<br />\nfor<br />\n<br />\nSpices—no adulteration, all strictly pure.<br />\n<br />\nMUSIC, PIANOS, ORGANS.<br />\n201-203 N.CHARLES ST.<br />\nBALTIMORE, MD.<br />\nCharles T. Crane,<br />\nPresident.<br />\n<br />\nOtto H. Williams,<br />\n<br />\nCarter G.Osburn,Cashier.<br />\n\"it A<br />\nDVERTISING SPACE IN THIS PAPER<br />\n<br />\nAPPLY TO<br />\nPEARRE E GROWL COMPANY.<br />\nPUBLISH ERS•<br />\nLIGHT AND LOMBARD STREETS<br />\nBALTIMORE, MD.<br />\n<br />\nVice-President.<br />\nJ. F. Marshall, As,Cashier.<br />\n<br />\nFARMERS & MERCHANTS NAT'L. BANK,<br />\nSouth and Lombard Sts., Baltimore.<br />\nCapital. $650,000<br />\n<br />\nSurplus and Profits $450,000.<br />\nAccounts of Banks, Corporations, I. irms and Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br />\nCOLLECTIONS A SPECIALTY.<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\n14'Or Particulars apply to<br />\n<br />\n11<br />\n\"\"eller8<br />\nStationers.<br />\n<br />\n34 W. BALTIMORE ST.<br />\n<br />\n4011DRN STIIBLEft GO.<br />\n<br />\n8Iz Ground<br />\n<br />\nHOPKINS CAPS<br />\n<br />\nSCHOOL, LAID MEDICAL CLASSICAL AND MIIICALLAIMEOU•<br />\n<br />\nCertificate of Analysis from<br />\nProfs. G. W. Lehman & Son,<br />\n701 to 705<br />\nMADISON AVM.<br />\nPrnuohReads as follows: Samples submitted of<br />\nBrandy—no adulterants, no coloring,fine quality.<br />\nPorto Port—absolutely<br />\npure, of superior quality.<br />\nitirtrY—no coloring or adulterants, absolutely pure wine.<br />\n111\"1,0Y-00 Fusel oil, no caramel, strictly pure<br />\n014<br />\n(cid ° Oil—all tests show pure olive oil.<br />\nairo,r Vinegar—hatural cider vinegar, strictly pure and<br />\n<br />\nINS. D.0.,<br />\nSeuly. & Tread.<br />\n<br />\n11. MOM<br />\n<br />\nA. SCHUMACHER & CO.,<br />\nGeneral Agents.<br />\n<br />\nCORRESPONDENCE INVITED<br />\n<br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS,GIBRALTER.<br />\nNAPLES. GENOA. ETC.<br />\nBALTIMORE TO BRCMEN<br />\nDIRECT.<br />\n<br />\n\fMANDOLIN. GUITAR AND BANJO 41 .0<br />\n<br />\nJ.<br />\n<br />\nTAUGHT CV<br />\n<br />\nC. J. LEVIN<br />\nwho has made a life study of these Instruments. Mandolin Soloist of National reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br />\n<br />\nStudio, 331 N. Gimeles St.<br />\n<br />\nZbe Itran3oSmith<br />\npiano Co.<br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br />\n<br />\nflgeniraz Studio<br />\n<br />\nCbtcherino, i3ra0burp ant' toZlebster<br />\n<br />\nSuccessor to Cummins<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\nSpecial Discount to Students<br />\n<br />\nTHE BLAKE CO<br />\n<br />\nBaltimore<br />\n<br />\nHABERDASHERS.<br />\nShirts, Neckwear,<br />\nUnderwear, Hosiery,<br />\nEtc.<br />\n<br />\nON SALE THE J. H. U. PENNANTS,<br />\nand all other College Pennants<br />\n<br />\n203W. BALTIMORE ST. & 2 S. LIBERTY ST.<br />\n<br />\n.os<br />\n<br />\nost<br />\n<br />\nIPtail09.<br />\n<br />\nFactory Prices.<br />\n<br />\n0.& P.'Phone 2322-2.<br />\n<br />\nSMITH'S soH,2 2TT&B<br />\nOLD<br />\nBOOK<br />\n805 N. HOWARD STREET,<br />\n3rd door from Madison.<br />\n<br />\ng<br />\n<br />\nG<br />\n<br />\nSTORE•<br />\n<br />\nBALTIMORE, MD.<br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange;<br />\nChicago Board of Trade,<br />\n<br />\nClinton P. Paine<br />\nGordon P. Paine<br />\n<br />\nCLINTON P. PAINE & CO.,<br />\nBANKERS & BROKERS<br />\nPrivate Wires to<br />\nNew York and Chicago<br />\n<br />\n217 E. German Street<br />\nBALTIMORE, MD.<br />\n<br />\nThe Chas.'Nibs Surgical Instrument Company<br />\nBENJ, A<br />\n<br />\nNELSON, OEN'L MANAGER<br />\n<br />\nPhysicians,' Burgeons,' Hospital and Invalid Supplies.<br />\nFlue Microscopes and Aocessories.<br />\nBaltimore, Md.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\nDrovers and Mechanics National Dank,<br />\nOF BALTIMORE, MD.<br />\n<br />\nCapital Stock,$300,000.<br />\n<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br />\n<br />\nYOUR EIT,,S<br />\n<br />\nARE YOUR LIVING<br />\n<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br />\nTHINK IT OVER.<br />\n<br />\nSAYRE OPTICAL COMPANY,<br />\n18S1 North Charles Street. (Masonic Temple.)<br />\n<br />\nK,XFMINING<br />\n<br />\nOLD AND NEW<br />\n<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\n<br />\nBooks Bought, Sold and Exchanged,.. ..<br />\nWM. V.PIPPEN,<br />\nJ. Wm. Middendorf,<br />\nA.J. Robblos.<br />\n<br />\n605 N. Eutaw Street.<br />\nA. II Rutherfoord.<br />\nF. Lentz.<br />\n<br />\nJ. WM, MIDDENDORF & CO.<br />\nVanhers & trohers.<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nMembers<br />\nBaltimore, Md.<br />\nBaltimore Stock Exchange.<br />\n<br />\nB. G. EICHELBERGER,<br />\nBOOKS AND STATIONERY'<br />\nENGRAVING AND STAMPING.<br />\n1-x em.x-IL ops<br />\n1•4c\". 308 I\\r-t.1-x<br />\n<br />\nv<br />\n<br />\nV. M. C. A. BUILDING,<br />\nC.& P. and Md.'Phones.<br />\nBALTIMORE, AlM<br />\n<br />\nCAll ON<br />\n<br />\nciftS. it. DOWNS,<br />\n229 N. Charles St.,<br />\nMASONIC TEMPLE.<br />\n<br />\n--11 FOR Class, Fraternity and College StationerY,<br />\nBanquet Cards, Invitations, Diplomat!,<br />\nPrograms, Visiting Cards, etc. ..... •<br />\n<br />\nOur 50o J. B. U. Bine and Black Hag Paper—now reathi•<br />\n<br />\nTHE NEWS LETTER<br />\nis from the Press of<br />\n<br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATION ERS<br />\nLight and Lombard Streets,<br />\n<br />\nBOOKS<br />\n<br />\nBALTIMORE<br />\n<br />\nWe carry a lull line of Students' Note Books and Stationery<br />\nBoth 'Phones.<br />\n<br />\nFT<br />\n5TIE<br />\nplANos<br />\n<br />\nThere is !darn little entertainment at home without a Plano<br />\n<br />\nAre The Best.<br />\n<br />\n9 N. Menu St<br />\n<br />\n(<br />\n<br />\n\f", "format": "basic_html", "processed": "JOHNS HOPKINS UNIVERSITY.<br />\nSIALTISIONE,<br /><br />\nThe Johns Hopkins Preis.<br /><br />\nO.<br /><br />\n••••11/01/1111<br /><br />\nL<br /><br />\nTorsatirlEsth Wear.<br /><br />\nBeal/ails' Chamber let, 1901.<br /><br />\nPres4dr4st.<br />\n.<br />\n•<br />\nDean of the Medical School,<br />\nDean of the College.<br />\n.<br />\n.<br /><br />\nIRA REMSEN.<br />\nWM.H. HOWELL.<br />\nEDW.IL RIFFIN.<br /><br />\nINSTRUCTION<br />\nFor Braduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medieine. (Courses for candidates for the degree of M. D.; coura.s for physicians.)<br />\nFor Undergraduates:<br />\n(c) A s candidates for the degree of B. A.<br />\n(d) As special students.<br />\nLibraries of Baltimore.<br />\n(Yiniversity<br />\nPeabody institute<br />\nPratt Lihr.a)<br /><br />\n••.<br /><br />\nLabora tories.<br />\nChemistry,<br />\nPhysics,<br />\n(4eolog7 and Mineralogy,<br />\nZoology,<br />\nA nu torny,<br />\nPit y Kil)logy<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic.<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nistory,7<br />\nEcimornies,<br />\nMathematics,<br />\n.PhysleS.<br /><br />\n100,000 volumes.<br />\nl'15.0e0 volumes.<br />\n•..,,O.000 volumes.<br />\nDirectors.<br />\nIra Bowler.<br />\nJoseph S. Ames.<br />\nWinieist E. Clark.<br />\nWilliam K. Brooks.<br />\nFiranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\neJ, .1. Abel.<br />\nJohn J. Abel.<br />\nitill la m 061er.<br />\n.<br />\nDirectors.<br />\nVeil L. Gildersleeve.<br />\nKirby P. Smith.<br />\nMaurice Bloomfield<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJ. M. Vincent.<br />\n.T. H. Hollander.<br />\nPrank Morley.<br />\nJoseph S. Ames.<br /><br />\nUndergraduates Courses (lead! lg to B. A.)<br /><br />\nAmorieers Journal of Illatkeesetles.<br />\nF. MORLIIT,\"Alter. Quarterly. Ste. Volume XXII<br />\nin progress. *per volume.<br />\nU. American Chouslleal everuaL<br />\nI. REMSEN, Editor. Monthly. Oro. Volume XXVII<br />\nin progress. $5 per volume.<br />\nIII. Americas Journal of Philology.<br />\nB. L. GILDERSLEEVE, Edithr. Quarterly.<br />\nVolume XXII in progress. $4 per volume.<br />\nTV. Studies from the Biological Laboratory.<br />\nVolume V complete. $5 per volume.<br />\nV. Studios In Historical and Political Science.<br />\nMonthly. Svo. Series XIX in progress. $8 PO<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary w014<br />\nIn progress in Fialthnore. 4to. Vol. XX in Pnr<br />\ngri•ms. Si per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly.<br />\n40<br />\n'<br />\nVolume XII in progress. $1 per year.<br />\nVIII. Johns Hopkinm Hospital Reports. 4to. Volume<br />\nIn progress. $5 per volume.<br />\nIX. Contributions to Asmyriology and Comparativl<br />\nSemitic Philology,(Beitrage zur Assyriologie,etc<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.CO<br />\nper volume.<br />\nT. Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. Ito. Volar140<br />\nXVI in progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. II. WELCH, Editor. Ili-monthly. Syn. Voltage<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insmnit y.<br />\nII ENB Y M. Wilt 0, Editor. Quarterly. Ito.,$5 Per<br />\nve hum..<br />\nXII'. Reports of Mary thud Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\nXV. Terre.: vial Magnetism and Atmospheric Fier\"<br />\nI Hefty.<br />\nI. A. 11.-117 ER, Editor. Quarterlf.<br />\n8\\0. Volume VI in progress. $2.50 per volatile'<br />\nXVI. Annual Report.<br />\nPresented by tire President of the Board of Trot'<br />\ntees, reviewing the operations of the Vuiversig<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of offieers end student f4, and stating<br />\nthe regulations, etc., of to University. Pute<br />\nli,./ted it the close of the academie year.<br /><br />\nGroups.<br />\nchissien1 (the \"Old College Course.\")<br />\nI. Mathematielil Physleiti,<br />\n(leading up to Engineering.)<br />\na. 4:lhemieal-ltiological.<br />\n(leading up to Medielneh<br />\n4. (eolopleol-iliological.<br />\n5. Latin Mathematical.<br />\nis. Historical-Political.<br />\nflooding up to Law.)<br />\nI. Modern Languages.<br />\naerial Publications.<br />\nEditors.<br />\nMathematics(,Vol. X X IV.)<br />\nFrank Morley.<br />\nChemistry (vol. X X VI).<br />\nIra Bentsen.<br />\nPhilo anr(vol. XXII.)<br />\nBasil L. Gildersleeve.<br />\nhistory (vol. X I X.)<br />\nJ.<br />\nVincent<br />\nModern ,stormwes(v01. XVI.) A. Marshall Klliott.<br />\nBiology (vol. IV.)<br />\nWilliam K. Brooks.<br />\nAss riologv (vol. TV.)<br />\nPaul Haupt.<br />\nExperimental Medicine(vol. VI.) W. H. Welch.<br /><br />\nProgrammes of the Courses offered to graduate studentsia Philosophy and the Arts, and in the School of<br />\nIledicdue, and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br /><br />\nIn addition to the serials above named, copies maY<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the<br />\nTestament. Edited by Prof. Paul Haupt. Pros<br />\ntug on application.<br />\nItowlan(Pm Photograph of the Normal Solar Spot:Arian'<br />\n'Opiates. $.10.00<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 110 pp. 4th. (A plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simile ed,i;<br />\nlion. Edited by J. Bendel Harris. 110 pp. 4to.<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac, MSS. with Antile<br />\ngomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographia Hopkinsiensim. Part I. Philology<br />\n. pr<br />\npat<br />\n11-111. Chemistry, Mineralogy and Geology.<br />\nIV-V- Vi.Physics, Astronomy and Mat hematica,<br />\n8 vo. 00 cents per part.<br />\na full list of publications will be sent on application.<br />\nCommunIcations in respect to exchanges and remIttennol<br />\nmag he sent to Johns Soutane Press, Baltimore. Md.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br /><br />\nAPRIL 9, 1902.<br /><br />\nNo, 13.<br /><br />\nTHE HONOR SYSTEM.<br />\nNUMBER of colleges in various parts of the country pride themselves on<br />\nthe fact that they, like the seven cities of Greece which claimed Homer<br />\nas a citizen by birth, have given rise to the Honor system. Wherever<br />\nand when the custom began need not occupy our attention. Throughout the<br />\ncollege world of America it has become a fixed institution from which great<br />\nbenefit, both to the faculties and students, has resulted in many directions. By<br />\nmeans of this adjustment of the conditions peculiar to a college examination,<br />\nresponsibility has changed hands, so to speak, and the student body is its own<br /><br />\n4<br /><br />\narbiter.<br />\n.<br />\nNow, the word \"system\" generally employed when referring to this method<br />\nis the condition upon which the larger part of its success rests; there may be a<br />\ncollege sentiment ruling amongst the majority of its students which stands for<br />\nthese in lieu of a prescribed agreement, but something more solid is needed.<br />\nrule spirit requires to be embodied, without which there is no tangibleness. At<br />\nth2 University of Virginia a pledge is signed by the student at each examination, the purport of which is a vow of honor not to have given, nor to have<br />\nreceived, any assistance at the examination in question. This custom dates<br />\nfrom the time when Jefferson founded the University, and is a time-honored<br />\ntradition. That it is still operative is seen from the report made by the newsPapers just recently of a case involving a breach of the law there and acted upon<br />\nby the students themselves. The Honor system at Princeton is not yet ten<br />\nYears old; in that institution the mode of procedure resembles the system at<br />\nVirginia and has gained a place in the college life from which there is amplest<br />\nreason to believe it will never be removed. The pledge runs as follows: \"I<br />\nPledge my honor as a gentleman that, during this examination, I have neither<br />\ngiven nor received assistance;\" for every student these words imply the strictest<br />\nadherence to the letter of the vow and not only for himself is this agreement<br />\nbinding, but it also makes each man a guardian of the sanctity of the pledge<br />\nWhereby any violation on the part of any member of the college would be instantly reported and the charge placed in the hands of the student committee to<br />\nPass judgment upon. Of course, owing to a lack, generally, in preparatory<br />\nschools of an honor system, the Freshmen are not conscious of the obligation<br />\nInvolved, and are, therefore, watched in the first semester examinations, but<br />\nafter that they are wholly responsible.<br />\n. From a few investigations among the undergraduates at Hopkins, the<br />\nwriter found very little of a definite character concerning the Honor system;<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nsome said there was a tacit understanding, among the undergraduates at least,<br />\nin regard to honor in examinations, and that an instructor could feel entirely<br />\nsafe in absenting himself from a room where an examination was being field.<br />\nOthers showed how, in refusing to give assistance at an examination, they had<br />\nbeen taken to task by those seeking it. Again, others were inclined to distrust<br />\nmen of their acquaintance when it came to the question of honor in examination.<br />\nThere is not the slightest doubt that Hopkins stands for the Honor system and<br />\npoints with just pride to the fact; however, from the vagueness -.which exists<br />\nand the varying views—or no views at all—it seems unfortunate that the establishment of a concrete system has not taken place ere this in the University.<br />\nThe undergraduate department is the most directly concerned in this matter,<br />\nand it devolves upon them to develop a working plan. Inasmuch as this<br />\ndepartment gives promise of increase above the other departments under the<br />\nnew conditions later on, nothing would be more satisfactory than to be able to<br />\npoint to a fixed Honor system, regulated and maintained by the students<br />\naccording to a definite plan. Such a scheme would early grow into a college<br />\ncustom and, in time, become a tradition distinctive and characteristic of the<br />\nUniversity.<br />\nIn the first place, a student council would be necessary; one member from<br />\neach of the three classes—the presidents of the classes could serve very acceptably—upon whom would fall the fulfilment of any duties incident to the operation of the plan. In the second place, a suitably worded pledge could be<br />\nsecured and adopted and any minor details attended to as occasion required.<br />\nIf there are men in the University who do not hold definite scruples with reference to examinations, some such method, as above described, would appeal to<br />\nthem and set them in line with the large majority of students who make the<br />\nmatter a point of conscience, and for these latter, the fixture, in tangible shape,<br />\nof a principle that already obtains in their midst would be a desirable good.<br /><br />\nHOPKINS IN FICTION.<br /><br />\neHE<br /><br />\nHOPKINS, being young in years, has not had the exploitation in fiction<br />\nwhich has fallen to the lot of older and larger universities. At last we<br />\nhave representation in the realms of fiction through a book written by<br />\nThomas Dixon, Jr., entitled \"The Leopard Spots.\" It is a tale of North Carolina during the period of reconstruction. Charles Gaston, the hero, is introduced at the close of the Civil War as a boy eight years old. He is carried<br />\nunscathed through a series of troubles and adventures which fall only to the<br />\nlot of heros in novels. The last-chapter lands him in the gubernatorial chair.<br />\nHis Hopkins experience is touched on lightly. There is a gap between the<br />\nintroduction of the hero at the close of the war and his return to North Carolina<br />\nafter all the honors won at Hopkins. Just the period which is most important<br />\nto us is skimmed over in the most exasperating manner. The heroine is Miss<br />\nWorth, a maiden who gains culture and refinement at Miss Carey's School in<br /><br />\nTHE NEWS—LETTER.<br /><br />\n3<br /><br />\nthis city. The writer deals with the continuous clash of whites and blacks in<br />\nthe South.<br />\nSome day we would like to see a volume from the same pen describing the<br />\ntrials and triumphs of Charles Gaston at Hopkins. While the material is not<br />\nas strenuous as the race question, it would be interesting and instructive to<br />\nknow how the hero arranged his clandestine interviews with the heroine immured in the boarding school.<br /><br />\nTHE A. B. DEGREE FOR MEDICAL STUDENTS.<br />\nELL deserved praise is always gratifying, but never more so than when<br />\nit is the unsolicited commendation of a rival. The current issue of the<br />\nColumbia Literary Monthly, in an article dealing with its medical<br />\nschool, takes occasion to refer to the splendid showing of the Johns Hopkins<br />\nMedical School. The article is an editorial appearing in the leading undergraduate paper of Columbia University, and takes up the question of a Bachelor of Arts degree for admission to their medical school.<br />\nreIt can be safely said that the Hopkins was the pioneer university for<br />\nquiring an A. B. degree of all desirious of taking up the study of medicine.<br />\nOther universities are deciding on the same requirements for admission, and<br />\nsoon a college or university of standing not requiring a degree will be a rarity,<br /><br />\neV<br /><br />\nindeed.<br />\nThe editorial does not hesitate to declare that the medical students at their<br />\ninstitution are not only uncultured, but often even uncouth. They lack the<br />\nPolish and refinement which are the results of university training.<br />\nIt is a regretable fact that many worthy men would be barred from the<br />\nstriving<br />\nprofession by the universal requirement of a degree, but what we are<br />\nfor is the greatest good for the greatest number. If the standard of the entire<br />\nthe Johns<br />\nmedical profession can be raised by this means, the medical school of<br />\non a deHopkins University will regard the fact that it was the first to insist<br />\ngree as one of its greatest triumphs.<br /><br />\nTHE PERCY TURNBULL MEMORIAL LECTURESHIP.<br />\nnow being<br />\nHR tenth course of the Percy Turnbull Memorial Lectures are<br />\nD.<br />\nHirsch,<br />\nG.<br />\nEmil<br />\nReverend<br />\ndelivered in McCoy Hall. The lecturer is<br />\nChiof<br />\ny<br />\nUniversit<br />\nthe<br />\nin<br />\nD., LL. D., Professor of Rabbinical Literature<br />\nvarious monocago, editor of \"The Reform Advocate,\" Chicago, and author of<br />\n\"Mediaeval<br />\nis<br />\nsubject<br />\ngraphs on Biblical and religious subjects. Rev. Hirsch's<br />\nwhich was<br />\nof<br />\nfirst<br />\nthe<br />\nJewish Poetry.\" The course consists of eight lectures,<br />\nby large<br />\nattended<br />\nbeing<br />\ndelivered on Tuesday, April 8th. The lectures are<br />\nin an<br />\nthem<br />\nto<br />\npresented<br />\naudiences, who are having the subject of Jewish poetry<br />\nentertaining, as well as in an instructive way.<br /><br />\nZ<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br /><br />\nTHE EASTER TRIP OF THE MUSICAL CLUBS.<br />\nHE Easter trip of the 'Varsity Glee, Banjo and Mandolin Clubs, proved<br />\none of the most successful ever made by the organization. The Clubs<br />\ncame out all right financially, and the concerts, especially the one given<br />\nat Richmond, were of a high order. The men, too,thoroughly enjoyed the trip.<br />\nThe Clubs, nearly forty strong, left Baltimore, by steamer, Good Friday at<br />\n6.30 P. M., and arrived at Old Point Comfort early the next morning. The<br />\npleasures of the first day consisted chiefly in playing ping-pong and the slotmachines, alternately. Most of the men were more successful at the former,<br />\ndespite many tales of how the \"Dewey\" was hit by them almost every time.<br />\nThe writer knows whereof he speaks, having tried to his sorrow, both games<br />\nrepeatedly. The men were invited to the base-ball game in the afternoon<br />\nbetween Yale and the Fort Monroe artillerymen.<br />\nIn the evening, the concert was given in the ball-room of the \"Hygeia.\"<br />\nThere were over three hundred people present, and all seemed to enjoy the concert very much. The Glee Club was the best, for the instruments of the other<br />\ntwo were affected by the dampness. The vocal solos of Mr. Gilman and Mr.<br />\nAtkinson, and the banjo solo of Mr. Edgeworth Smith were encored two or<br />\nthree times. After the concert, most of the men attended the large dance given<br />\nby the management of the \"Chamberlin.\" There were many pretty girls present from the Fort and from the nearby towns of Norfolk, Hampton, and Newport News, as well as the guests of the hotel.<br />\nSunday was spent in church going, sight-seeing, visiting, yachting, and<br />\nloafing. At night, there was considerable excitement caused by the incorporation of a new grand-trunk railway to cover districts not covered by the Northern<br />\nSecurities Company. The incorporators and chief stockholders of the road are<br />\na well-known New York capitalist of Wall street, and his friend, a wealthy<br />\nphysician, and a few members of the Clubs, who modestly request that their<br />\nnames be not published. The floating stock of the new road consists of a handsome combination baggage and passenger truck, with all the advantages of the<br />\nmodern observation-car. It is furnished with finely upholstered chairs loaned<br />\nby the management of the \"Sherwood.\" The power employed is negro handback, and leg-power. The termini of the road are the Old Point pier and the<br />\n\"Sherwood\" hotel. Owing to labor troubles, a corporal's guard had to be<br />\ncalled out Sunday night to protect property and to preserve order.<br />\nAfter pictures of the Clubs were taken by Mr. Carver, Monday morning,<br />\nManager Hill hurried the men off to Richmond. Here the more fortunate of<br />\nthe men stayed with private families, while the rest suffered the agonies of the<br />\nboarding house. After spending the afternoon in golfing with the fair ones of<br />\nRichmond, and in other ways, the men assembled at the Woman's Club for the<br />\nconcert, which was given for the benefit of the King's Daughters. The hall<br />\nwas crowded to the doors, and the \"Standing Room Only\" sign had to be hung<br />\nout. The feature of the concert was Mr. Atkinson's solos. \"Good bye Booze,\"<br />\nparticularly, seemed to strike the fancy of the maidens, who said it just seemed<br />\nto suit the singer. The instrumental clubs got in some snappy work in this<br />\nconcert. The evening concluded with a small, young dance, a Welsh rabbit<br />\npatty, and other festivities.<br />\nThe next morning the men were invited to a luncheon at the Lakeside<br />\nCountry Club. This was most enjoyable. The charms of the Richmond belles<br />\nproved too much for some of the men, who missed the train for Old Point.<br />\nThose who took the regular train had much fun at the conductor's expense reversing the \"Jim Crow\" sign.<br />\nAbout fifteen of the men stayed over at Old Point an extra day at their<br />\nown expense, but the bulk of the men returned by boat Tuesday night, arriving<br />\nat Baltimore Wednesday morning.<br /><br />\ne<br /><br />\nTHE NEWS—LETTER.<br /><br />\n5<br /><br />\nAMONG THE COLLFGES.<br /><br />\nA<br /><br />\nOMETIME this month the performance of a Greek tragedy, Sophocles'<br />\nAntigone, accompanied by Mendelssohn's music for the lyrical songs, will<br />\nhe given by the students and Faculty of Leland Stanford University.<br /><br />\nThe lacrosse squad at the University of Toronto is out for practice. A team<br />\neven stronger than last year's is counted on, as nine of the old men are back.<br />\nManager Slemons, of the Lacrosse Team, has received several letters from<br />\nnorthern colleges asking for games. As yet nothing definite has been decided<br />\nUpon, as Manager Slemons has not been able to arrange the dates.<br />\nLehigh defeated the Moravian Theological Seminary in debate, although<br />\ntheir opponents were older and more experienced talkers. Lehigh had the<br />\nResolved, That Congress should establish a sysaffirmative of the question:<br />\ntem of ship-subsidy.\"<br />\nJune 26 has been decided upon for the date of the Yale Harvard boat races.<br />\nThere will be three races: the four-oar, Freshman, and eight-oar contests.<br />\nMiss Julia Marlowe contributes to a recent number of \"The Inlander\" an<br />\narticle on \"The Duty of the University Man to the Theatre.\" It is a plea for<br />\nthe study of modern dramatic literature by the college man, and a plea for his<br />\naid in elevating the stage. Miss Marlowe feels sure that if the University Man,<br />\nby an intelligent interest in matters theatrical, would speed the day when we<br />\nwould have the endowed theatre, that last flower of dramatic development.<br />\nGoethe's \"Iphigenie auf Tauris\" was presented by the stock company of<br />\nthe Irving Place Theatre for the benefit of Yale students at New Haven to a<br />\ncrowded house. Mr. Conreid, the manager, has given several college performances in order to arouse interest in the best German literature, and at the same<br />\ntime to elevate the standard of dramatic performances in this country.<br />\nOne of the most interesting events in the Eastern college world is the<br />\nannual dramatic production of the \"Mask and Wig Club\" of the University of<br />\nPennsylvania. Each year around Easter time a play is given, first at the University and then in Atlantic City. Very often one of the large theatres of<br />\nPhiladelphia is secured, and the play has the regular weekly run of the legitimate. It is always original, and so far every play has been written by a Pennsy<br />\nman. Sometimes the music is original, but generally the songs are adaptations<br />\nof well-known airs. The productions always are received with great enthuaiasm<br />\nnot only by people connected with the University, but by the residents of Atlantic City and Philadelphia as well. This year's play is entitled \"King Cole,\" a<br />\nmusical comedy, said to be very entertaining and excellently acted.<br /><br />\n6<br /><br />\nTHE NEWS—LETTER.<br /><br />\nTHE NEWSLETTER.<br />\nPublished Fortnightly during the University Year by the Students of Tim JOHNS<br />\nHOPKINS UNIVERSITY.<br /><br />\nAPRIL 9, 1902.<br />\nSubscription $1 50 per year.<br />\nEditor in Chief<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n.<br /><br />\n10 Cents a single copy.<br />\n•<br /><br />\nROBERT S. LANIER, 1903.<br />\n. HARRY K. TOOTLE, 1903.<br />\nSOLOMON BLUM, 1903'<br />\n•<br />\nGEORGE A. FOSTER, 1904.<br />\nREGINALD S OPIE, 1904.<br /><br />\nAssistant News Editors,<br /><br />\nW.S. BIRD, 1903.<br /><br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\nAUBREY PEARRE, JR., 1902.<br />\n. I-TARRY BAETJER, 1903.<br /><br />\nAddress all articles, communications, etc, to ROBERT S. LANIER, box 374, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483,<br /><br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\nt<br /><br />\nHE NEWS-LETTER in this issue prints a timely article on the honor system.<br /><br />\nAs the Johns Hopkins University has been regarded as one of the strongest of the advocates of the honor system, this article may cause some comment because of its reference to the attitude of the undergraduates. All we desire is a crystallization of the opinion of the student body into some well defined<br />\nexpression on the subject. The writer is one who can well speak with authority, being in a position to appreciate the sentiments both of the instructor and<br />\nthe undergraduate. We regard the suggestion of an undergraduate council with<br />\nfavor. Not that there exists any glaring violation of the honor system; but<br />\nthat it would serve as a check on any downward tendency, and would serve as<br />\na board which would at all times jealously guard the honor of our university.<br />\nExpressions of opinion on this subject are invited from readers of the Nims-<br /><br />\nLETTER.<br /><br />\nT took some time for the jewelers and flag-makers to realize that Hopkins<br />\nspirit was high enough to warrant the making of J. H. U. flags and pins,<br />\nbut last year the Homewood announcement seemed to flood the market<br />\nwith Black and Blue. At present one can go into any store in Baltimore and<br /><br />\n3<br /><br />\nTHE NEWS-LETTER.<br /><br />\n7<br /><br />\nget whatever he wants in black and blue, but the jewelers seemed to be afraid<br />\nto make the University Seal. At last, however, the seal is being shown, and<br />\nseveral merchants have submitted to the students samples of the seal engraved<br />\nin gold. This indicates that stock in the University is higher now than ever<br />\nbefore. If the merchants are willing to trust in enthusiasm of the students, the<br />\nstudents themselves must have good hopes for the future. There can be no<br />\ndoubt that the seal will be popular, and there can also be no doubt that this<br />\nrise in Hopkins stock is due to the announcements made at the Commemoration<br />\nDay exercises. We anxiously await another announcement, and even more<br />\nevidences of faith in Hopkins.<br />\nITH this issue the representatives of the Junior and Freshman Classes<br />\ntake upon themselves the management of the NEWS-LETTER. We desire to congratulate the retiring members of the board, Messrs. Strouse,<br />\nSlemons, and Murphy, upon their untiring efforts in making the NEws-LiirriiR<br />\nthe success it has been during the past year. As editor-in-chief Mr. Strouse has<br />\nalways devoted his entire time and attention to making the NEws-Lri:TTER a<br />\nrepresentative college publication. Under his management the paper has come<br />\ninto closer touch with the student body and has assumed a more distinctive undergraduate tone. It is the intention of the present board of editors to pursue<br />\nthis policy, and to aid us in this endeavor we earnestly solicit the co operation<br />\nof every Hopkins man, and particularly the undergraduates. A vacancy now<br />\nexists on the editorial staff of the NEWS-LETTER, and an opportunity is thereby<br />\nafforded for a display of ability among the men aspiring for a place on the staff<br />\nas an athletic editor. A position upon the NEWS-LRTTER gives a man good,<br />\npractical experience in literary training, which will prove valuable to him in<br />\nafter years, and we strongly urge those who are desirous of obtaining this position to hand in at once articles relating to athletic events at Hopkins.<br /><br />\nTo<br /><br />\nPrai.HE lacrosse team has opened its season by a victory. But with Hopkins<br />\nplaying the University of Pennsylvania a victory is expected, and though<br />\nour team did all that was to be expected .of them for the first game, it<br />\nhas hard work before it to get in championship form. The lacrosse team always<br />\nPlays the best teams it can arrange a schedule with, and the students are always<br />\nloyal in their support whether we win or lose. This is somewhat of a contrast<br />\nto the support given by the undergraduates to the meet last Saturday night.<br />\nIf there is any complaint about the attendance of the students at these games,<br />\nit can be directly traced in most instances to one cause: Our opponents were<br />\nnot in a class high enough for its. The students would rather have the athletic<br />\nteams defeated by a good college than will such an empty honor as the relay<br />\nrace last Saturday night.<br />\nTo the Editor of the NEWS-LETTER:<br />\nThe writer passed his Easter vacation with college men from Harvard,<br />\nPrinceton, Yale, Cornell, and Lafayette, and among many other things connected with their college life which he was led to admire, was their familiarity<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nwith their college songs and the great enthusiasm with which they were sung.<br />\nEach one of these colleges has a book of its songs—words and music. This<br />\nfact is the cause of this letter.<br />\nWhy has not Hopkins a book of songs? It is not because we lack the<br />\nsongs themselves. The Black and Blue compares favorably with any other<br />\ncollege anthem. \"Alma Mater in Dixie Land\" is a splendid march. The \"Ver<br />\nitas Vos Leberabit\" (known to so few of us) is excellent both in music and in<br />\nwords. Our Dummyline Song has a good dash and swing. Surely these and<br />\na few others that we have could form a nucleus for a very creditable book. It<br />\nis almost a waste of your valuable space to speak of the benefits to be derived<br />\nfrom such a book. There is no more natural way for a man to give expression<br />\nto his college enthusiasm than by singing his college songs. There is nothing<br />\n(and this is more important) that spreads college spirit so much as the wide<br />\ndissemination of these songs. It may be urged that we are a small college,<br />\nand that published songs are not as necessary for Hopkins as for a larger college. Hopkins, with its one hundred and sixty undergraduates, must make<br />\nuse of each one of them. We can't afford to have one laggard in our midst.<br />\nEvery Hopkins man must be to some extent a propagandist to spread the Hopkins idea. The best way to do this is to popularize those things that best represent our college spirit. Nothing does this better than our songs.<br />\nThe writer has been informed that the musical clubs contemplate publishing<br />\na book of songs. If this is so, why not hurry it up? The sooner we get it the<br />\nbetter. Without presuming a knowledge of the financial condition of our musical clubs, it seems that they could well afford to bring out a book like this. If<br />\nthe musical clubs are unable to bear the burden alone, would it not be possible<br />\nfor the NEWS-LETTER to help them out? We wouldn't need an \"Edition-deLuxe,\" or anything magnificent What we need is a start—a humble start,<br />\npossibly; hut, at any rate, a movement. The club or institution that will aid<br />\nHopkins men to spread the Hopkins spirit, will have justified its right to exist.<br />\n1903.<br /><br />\nThe NEWS-LETTER has received the following letter from Mr. George M.<br />\nClarke, '98. We are glad of the opportunity to correct the statement published<br />\nrecently in a local paper:<br />\nEditor in Chief of the NEWS-LETTER,<br />\nJohns Hopkins University.<br /><br />\nDEAR SIR:—A friend has sent me a clipping from the Baltimore News of<br />\nlast week in which I, under the name of Roy Clark, am supposed to have signed<br />\na National League contract with the New York Base Ball team. This is clearly<br />\nan error, as I have long since given up base ball and begun the practice of law.<br />\nTruly yours,<br /><br />\nGEORGE M. CLARKE.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n9<br /><br />\nItiminlimilimiminammumilumininutiliiiimiumiummilimmtiloniiimilinuoilimilluninuohfifillimolloollthiuk •<br />\nC..;<br /><br />\ns<br /><br />\n1<br /><br />\n1111101011.<br />\nt<br />\n•<br /><br />\n.<br /><br />\nMeetem glk,liftOP'MI<br /><br />\n1<br /><br />\ng<br />\ne.\"001,<br /><br />\nNI\"<br /><br />\n1111111111111111111111111011111111111111111R1111011111111111101111111111011111111111111111131111111101i11111111111111f111111i1111111111111111111111111111111M1111/1111gUlti,7!;,4;qil,iil,T,Iiii<br /><br />\nMr W. S. Weedon has been apppointed research chemist of the General<br />\nElectric Co., of Schenectady, N. Y. Mr. Weedon received the degree of S. B.<br />\nat the Maryland Agricultural College in 1897, and for several years has been a<br />\ngraduate student in chemistry. In June he will receive the degree of doctor of<br />\nphilosophy, and shortly afterwards will enter upon his new duties.<br />\nThe American Philosophical Society held its first annual meeting at Philadelphia on April 4. Dr. Wm. K. Brooks read a paper on scientific research.<br />\nAt the banquet held the same night President Remsen spoke on \"Our Universities,\" and Dr. Wm. Osler on \"The Future of Science.\"<br />\nDr. I,. A. Bauer, Chief of Division of Terrestial Magnetism, United States<br />\nCoast and Geodetic Survey, will deliver a course of four lectures beginning on<br />\nApril 28, on \"Terrestial Magnetism.\" The lectures will be illustrated by<br />\ncharts, diagrams and lantern slides.<br />\nSeveral weeks ago the Field Foray Club made an excursion, in which two<br />\nhundred and fifty of its members participated, for the purpose of collecting<br />\nfrog's eggs for future hatching. Dr. Caswell Grave, with a dozen assistants,<br />\nhad charge of the crowd.<br />\nDr. Geo. B. Shattuck, of the Geological Department, has been in the Everglades of Florida for the past few weeks. After leaving the great swamp he<br />\nWill cross to the Bahama Islands for a study of the geological phenomena there.<br />\nDr. Shattuck expects to be absent until the first of next month.<br />\nPresident Remsen was the guest of honor at the banquet of the New York<br />\nAlumni Association of the University, held at the University Club, New York,<br />\non the night of April 5.<br />\nThe memorial volume to the late Prof. Herbert B. Adams, the preparation<br />\nof which has been going on for several months, is now ready for distribution.<br />\nIt is divided into two parts. The first parts consists of tributes to the historian<br />\nfrom his friends and the learned societies in which he held membership. The<br />\nsecond part is a complete bibliography of the writings of all the graduates of<br />\nhis department of history, economics and politics.<br />\nThe success of \"senior week\" last year was so pronounced that the practice<br />\nwill probably be continued this year. Though nothing official has yet been<br />\ndone about the matter, many individual expressions of opinion have been heard<br />\nfrom members of the class of 1902 in favor of the custom. As senior week is<br />\nthe last revival before departure and separation, it seems that the week should<br />\nbe made tradition.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br />\nY. M. C. A. NOTES.<br /><br />\nt<br /><br />\nHE annual Spring Reception, to which the members of Y. W. C. A. of the<br />\nWoman's College were invited, occurred on March 14th, and was greatly<br />\nenjoyed by the large number present. Messrs. Addison, Grove and<br />\nGraff spoke on the recent Student Volunteer Convention in Toronto, and<br />\nmusical numbers were rendered by Messrs. Miller, Haughton, Willis, and<br />\nTaneyhill.<br />\nThe annual Spring Conference of Presidents of the Eastern College Associations, was held at Schenectady, N. Y., April 3-6. Hopkins, as usual, was<br />\nrepresented.<br />\nSome forty new accessions have been made to the Association Library<br />\nduring the year. A few by purchase, some as the gift of Dr. Howard Kelly,<br />\nand the twenty-one volumes of \"The Gospel in All Lands,\" as a present from<br />\nthe editor, Rev. a R. Smith.<br />\nThe Executive Council will hold its regular monthly meeting Thursday,<br />\nApril 10, at 5 P. M.<br />\nThe annual election of the officers of the Association will take place on<br />\nTuesday, April 15, at 5 P. M. All members are strongly urged to be present.<br />\nThe 1902 Handbook is just going to press and promises to be even more<br />\nattractive than ever.<br />\n• The Committee on Northfield met on Friday, April 4th, at 5 P. M., and<br />\nadopted progressive measures looking to a canvass of the members of the University. The matter will be presented to the student body in an attractive form<br />\nby means of stereopticon illustrations on Friday, May 2, at 7.30 P. M. The<br />\nnext meeting of the committee will be held Saturday, April 12th, at 11 A. M.<br />\nH. W. Plaggemeyer is chairman, and the other members are J. G. Machen, J.<br />\nA. Addison, R. C. Pagon and F. C. Blanck. Ten delegates from Hopkins were<br />\nat Northfield last summer and at least twenty are expected to be in the Hopkins<br />\nCamp this year. Talk with the committee.<br /><br />\n\"HULLABALOO CLUB.\"<br />\nLTHOUGH \"Senior Club\" will be the official title next year, the Class of<br />\n1903 has temporarily adopted for their social organization, the name<br />\n\"Hullabaloo Club.\" This certainly has a Hopkins' ring to it, and is<br />\nnot ambiguous, as \"Senior Club\" would be at present. The Board of Governors have been actively at work, and have accomplished much toward definite<br />\norganization. The constitution is now before the class for acceptance, and the<br />\nclub's activity will be manifest: Rooms will probably not be secured before<br />\nnext fall, but interest will not be lacking in the meantime.<br />\nThe first social event under the auspices of the Club will be a \"smoker,\"<br />\nwhich will take place Saturday evening, April 19. The committee of arrangements consists of Messrs. Plaggemeyer, Tootle, Riley, Hildt, and Hoffman.<br />\nThe Board hopes to arrange a second Smoker before the term closes.<br /><br />\n4<br /><br />\nTHE NEWS—LETTER.<br /><br />\n11<br /><br />\nLACROSSE.<br />\nSchedule Season of 1902.<br />\nAPRIL 12, Hobart College at Baltimore.<br />\nAPRIL 19, Harvard at Baltimore.<br />\nAPRIL 25, Lehigh at South Bethlehem.<br />\nMAY, 3, Columbia University at Baltimore.<br />\nMAY 10, Swarthmore at Baltimore.<br />\nPlace of playing home games will be announced later.<br /><br />\nHOPKINS, 5; PENNSYLVANIA, 1.<br />\nHE lacrosse team played its first out of-town game last Saturday<br /><br />\nt<br /><br />\nat Philadelphia against the University of Pennsylvania. Although<br />\nthe result was a 5 to I victory for Hopkins, yet the general work of the<br />\nteam was by no means up to the usual standard. At times even the older men<br />\nWere guilty of poor stick work and good team play was exceedingly scarce.<br />\nSome excuse is to be found, however, in the fact the contest was the first of<br />\nthe season, and that the usual disadvantages of a foreign field, and a hostile<br />\ncrowd were encountered.<br />\nCaptain Schmeisser agreed that the work was somewhat off color, but said<br />\nthat such is generally the case in the opening game.<br />\nIn the first half Hopkins went in on the jump, but \"Pennsy\" seemed prepared, and not until after ten minutes play did B. Bernheim score the<br />\nstart matters, and before the half<br />\nfirst goal. This seemed to<br />\nlast being<br />\nmore in the net, the<br />\ntwo<br />\nplaced<br />\nended Putts had<br />\nPennsylhalf,<br />\nsecond<br />\nthe<br />\nIn<br />\nBernheim.<br />\nB.<br />\nfrom<br />\nmade on a clever pass<br />\na long<br />\nmade<br />\nSmith<br />\nplay.<br />\nminutes<br />\nten<br />\nafter<br />\nvania made her only score<br />\nAs it<br />\nposts.<br />\nthe<br />\none<br />\nof<br />\nstrike<br />\nto<br />\nenough<br />\nnear<br />\ncame<br />\nshot for goal which<br />\nscooped<br />\nquickly<br />\nand<br />\nspot<br />\nright<br />\nthe<br />\nat<br />\nbe<br />\nto<br />\nhappened<br />\nbounced out Deschweintz<br />\nit in the net. Excepting this time, Briscoe had very little work to do before<br />\nthe net. The last two goals were made by Sayler and Putts. The new men,<br />\nBird, Custis and Blanck—were probably a little nervous on their first appearance as lacrosse players. On the whole, however, their work deserves favorable comment. Abercrombie was, as usual, very fast, but he and P. Bernheim<br />\nwere unable to do the usual tricky \"stunts\" which marked their work in the<br />\nmidfield last season. The team lined up against Pennsylvania as follows:<br /><br />\n12<br /><br />\nTHE NEWS—LETTER.<br /><br />\nPutts, inhome; B. Bernheim, outhome; Sayler, first attack; Bird, second attack,<br />\nP. Bernheim, third attack; Abercrombie, centre; Custis, third defense; Blanck,<br />\nsecond defense; H. Straus, first defense; E. Schmeisser point; W. Schmeisser,<br />\ncover point; Briscoe, goal.<br />\nThe practice this week has been very effective in developing team work,<br />\nand a much stronger game is expected with Hobart College on Saturday afternoon. It is the first home game, and every man should turn out to give the<br />\nteam a rousing reception. It will take all kinds of hard work to land this<br />\nseason's championship, and too much encouragement cannot be given the<br />\nplayers.<br />\nThe daily appearance of a full scrub team during the season is worthy of<br />\nmention. They have it in their power to greatly aid the regulars in gaining<br />\nstrength. Several of the most promising scrubs will have a good chance to<br />\nfigure in some of the games before the end of the season. Let every one come<br />\nout faithfully!<br />\nTough was unable to play last Saturday on account of a sprained knee.<br />\nHe is greatly improved and will probably fill his old position at third defeme<br />\nagainst Hobart College on Saturday.<br />\nHOPKINS VS. ALL-BALTIMORE.<br /><br />\nt<br /><br />\nHE lacrosse team opened its local season at Electric Park on Wednesday of<br />\nlast week in a very creditable game with All-Baltimore. In the first half<br />\nthe 'Varsity attack ran All Baltimore off its feet and scored seven goals<br />\nbefore the whistle blew. In the second half Captain Sehmeisser reversed the<br />\ndefense, thus placing one half of Hopkins against the other. This, of course,<br />\ngave All-Baltimore a decided advantage, and five goals were scored to one by<br />\nthe 'Varsity.<br />\nAltogether the work of the team was very creditable for the beginning of<br />\nthe season. The continued bad weather has kept the men from practicing out<br />\nof doors a great deal, but the team play was fairly good and the men seemed to<br />\nhave plenty of endurance. Abercrombie was of course all over the field, and<br />\nkept the mid-field men busy holding his pace. Sayler and Bird on the attack<br />\nboth show improvement, and Blanck and Custis on the defense played a strong<br />\ngame.<br />\nThe weight of all the new men is decidedly above that of the players lost<br />\nsince last season. This is a decided advantage, for the lack of weight and endurance was mainly accountable for the loss of the Swarthmore game last year.<br />\nAltogether our championship prospects are reasonably bright. Next Saturday<br />\nwe play Hobart College at the.American League Park. Let every rooter show<br />\nhis loyalty to the 'Varsity.<br />\nThe lacrosse management has been having some trouble in finding a place<br />\nto play, as through a misunderstanding with the American League officials,<br />\nsome of the dates conflict. Place of games will be announced later.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\nTRACK AND FIELD.<br />\nTHE CAGE GAMES.<br /><br />\nZ<br /><br />\nHE first invitation games ever given by the Johns Hopkins Athletic Asso-dation in the cage took place last Saturday night. The gallery and the<br />\nwindows of the gymnasium were packed and a good sized crowd found<br />\nseats inside the track. There was not a hitch to mar the performance, everything going off on schedule time. As these games were the first ever attempted<br />\nin the cage, great praise and credit are due the games committee and Mr.<br />\nMackdermott, for bringing them to a successful issue.<br />\nGeorge B. Scholl, after the conclusion of the high jump, went after the<br />\nHopkins record, and cleared the bar at 5 feet 11% inches, thus making a new<br />\nrecord. No other records were in danger.<br />\nThe contest which aroused the most enthusiasm was a relay race of youngsters from the Boys' Latin School. It was anyone's race up to the finish, when<br />\nthe Tadpoles won from the Shrimps by a narrow margin.<br />\nThree men were entered by the Naval Academy at Annapolis, and McNair,<br />\nSO n of Admiral McNair, crossed the line first in the 880 yard run. The presence<br />\nof the middies was especially gratifying to Hopkins men, since this was the<br />\nfirst time that the men have ever contested away from their home grounds.<br />\nThe 30 yard dash for preparatory schools was won by H. R. Coppage (6<br />\nft.), Delcher second; and W. S. Bayless, third. In the 30 yard dash, open,<br />\nWeedon, Pessagno, Herzog, and Riggs qualified for the finals, and finished in<br />\nthe order named.<br />\nIn the quarter mile run R. C. Hoffman, Jr., showed splendid form, and was<br />\nnever headed after he took the lead. LeCron, second; and Requard, third.<br />\nTime, 1:20.<br />\nThe mile run brought together a number of good men. England's long,<br />\nsprin g y stride carried him across the tape an easy winner. M. Price, second;<br />\nand Porter, third. Time, 5:12 3-5.<br />\nIn the quarter mile run, scratch, for preparatory schools, Robinson was the<br />\nwinner, with W. S. Bayless, second, and McClure, third. All the place winners were from the Boys' Latin School. The time, 1:03, was some seconds<br />\nfaster than the time in the open event.<br />\nThe 880 yard run was one of the most hotly contested events of the meet.<br />\nMcNair, U. S N. A., won, with Mullen second, and R. C. Price third. Time,<br />\n2:13.<br />\nThe running high jump was won by Randall (234 inches); Scholl, second,<br />\nand Lawson, third. Randall's actual jump, 5 ft. 834 inches. Scholl's jump,<br />\nscratch, 5 ft. 1034 inches.<br />\n.<br />\nThe sixteen pound shot put was won by Nelson; actual put 38 feet 7%<br />\ninches. Lawson was second, and Curran third.<br />\nIn the relay races the Central Y. M. C. A. defeated St. Leo's Gymnasium,<br />\nand the Washington Y. M. C. A.<br /><br />\n14<br /><br />\nTHE NEWS—LETTER.<br /><br />\nThe Boys' Latin School defeated Deichmann's in a three lap relay. The<br />\nBaltimore City College won with ease from the Park Athletic Club. Marston's<br />\nSchool finished ahead of the Friends School in an exciting race.<br />\nThe Hopkins team forged ahead of the men from Columbian University,<br />\nand could never be caught. Time, 3:43 3-5.<br />\nAs usual, Hopkins scored the greatest number of points; 32 being placed<br />\nto the credit of the Black and Blue. The Boys' Latin School was second with<br />\n18, and Deichmann's third with 8.<br /><br />\nHOPKINS IN SATURDAY NIGHT'S GAMES.<br />\nEEDON'S running in the 30 yard dash, open, was of the first-class. His<br />\nstride was tremendous, and his pace was of the real \"steam roller\"<br />\nkind. Passagno, who ran from a mark back, of \"lanky Bill,\" was<br />\nclose to his running mate at the finish. He got a beautiful start and ran well.<br />\nIn the 440 yards, Curzon Hoffman ran a grand race, showing great nerve<br />\nand endurance, which was to be especially admired from the fact that he ran an<br />\nextra lap, due to an error by the judges, at the finish. The fact that another<br />\nlap was run may be shown thus: Hoffman, from scratch in the cage in practice, has run under watch a quarter in 60 seconds. He was running much<br />\nfaster than that Saturday night, manifestly by 2 or 3 seconds, and had besides,<br />\na handicap of 25 yards. His time was 1:20, just about the time required to run<br />\nan extra lap when a man is slightly groggy after hard work. Le Cron should<br />\nhave kept on instead of stopping at the real end of the race; but his work was<br />\nvery creditable.<br />\nPorter's work in the mile was good. He must learn, however, to take<br />\nadvantage of a handicap, and adapt his pace accordingly. We congratulate<br />\nhim heartily on his work. He has been faithful in his training all the year,<br />\nand now, with finishing touches, will be a winner.<br />\nScholl this year is expected to do over 6 feet in the high jump. Lawson,<br />\nin the shot and high, did nice work.<br />\nAltogether, the meet was successful and encouraging to the captains of the<br />\nteams. We are glad to have had our friends from the Naval Academy with us;<br />\nthey are sportsmen of the true gentlemen type, and made many friends by their<br />\ndignified behavior on the athletic field. Such a spirit is needed more in our<br />\ncity. Many times in the mad rush for prizes, others are forgotten, A small<br />\npiece of gold or bronze is nothing in comparison with the sense of having competed cleanly and honorably; and, if beaten, taking the defeat in the right<br />\nspirit.<br /><br />\nV<br /><br />\nThe suggestion that has been made for Hopkins to hold the games for the<br />\nDaily News Cup, seems to be meeting with universal approval. As the University will bear the entire expense of the undertaking, all ,the other teams will<br />\nhave to do will be to enter their men. The seventeenth of May has been decided<br />\nupon for the date of the contest, which will take place at Electric Park.<br /><br />\nTHU NEWS-LETTER.<br /><br />\nSHARPS AND FLATS.<br />\nA COMPLAINT.<br />\nIn the tropic seas a sailor<br />\nFor the iceberg cold is yearning.<br />\nMad he lies there with the fever,<br />\nAnd the sun upon him burning.<br />\nBut the iceberg in the Northland<br />\nHas not seen his mad endeavor,<br />\nCan not know his futile longing,a<br />\nAnd his pain which lasts forever.<br />\nSo does she, proud and disdainful,<br />\nNever know that I am sighing,<br />\nCan not see I madly love her,<br />\nCan not see that I am dying.<br />\n'03.<br /><br />\nA LAMENT.<br />\nIn the highest Cs a singer<br />\nFor his top note shrill is yearning,<br />\nAnd he tries for it with vigor,<br />\nWhile his audience is squirming.<br />\nBut that high note in the high Cs<br />\nIs beyond his mad endeavor,<br />\nAnd his longing is most futile—<br />\n'T is beyond his reach forever.<br />\nSo we flee, proud and disdainful,<br />\nWill not listen to his sighing,<br />\nWill not hoar him madly try it,<br />\nIf this once we escape dying.<br />\n'04.<br /><br />\nA REGRET.<br />\nShe has left me, and no longer<br />\nShall I see her as of yore,<br />\nFor a better man has won her,<br />\nShe will never see me more.<br />\nI can't blame her, and there's only<br />\nOne regret my being thrills,<br />\nThat the plunks which went for roses<br />\nDid not go to pay old bills.<br />\n'05.<br /><br />\nA.TRAGEDY IN ONE ACT,<br />\nAdmiration, queer sensation,<br />\nTrepidation, then elation.<br />\nHe's in love above his station.<br />\nMamma says it's a flirtation;<br />\nPapa views with perturbation;<br />\nSends her off to a relation.<br />\n(THE END.)<br /><br />\n15<br /><br />\nTHE NEWS-LETTER.<br /><br />\nORIGIN Olt COLLEGE SPEECH.<br />\nTobacco cutting machines he'd fed<br />\nTill heat his brain had jarred,<br />\nC'ercome, he fainted, and then they said:<br />\n\"Poor fellow! he plugged too hard.\"<br />\nTwo frightened horses ran away,<br />\nA policeman hearing a scream,<br />\nDashed in pursuit—I heard one say:<br />\n\"Do you think he will make the team?\"<br />\n—Notre Dame Scholastic.<br /><br />\n'04—Doing anything in athletics?<br />\n'05—Yep, putting the shot.<br />\n'04—What, you?<br />\n'05—Sure! joined the Gun Club.—Harvard Lampoon.<br />\nThe sun shone lividly upon the scene. With one stroke of the axe the<br />\nLord High Executioner severed the head of the prisoner from his body. With<br />\nsteady hand and firm voice he held up the dripping head and cried: \"Lo, this<br />\nis the end of all traitors.\" And amid the thrilling silence a small boy inquired:<br />\n\"Which end?\"—Princeton Tiger.<br />\n\"You are a brick\" I did aver<br />\nTo Daphne, by my side,<br />\n\"A sort of pressed brick, as it were,\"<br />\nShe roguishly replied.<br />\n—Ex.<br /><br />\nUNCLE WHALE—\"I hear you're in a school now Willie, what do you learn<br />\nthere?\"<br />\nWILLIE WHALE—'`Nothin' much 'cept to spout.\"—Przncelon Tiger.<br /><br />\nCrowded car, straining strap,<br />\nSudden curve, lady's lap.<br />\n—The Batchelor.<br /><br />\nThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\n14- E. Cor. Charles and Fayette Sts.,<br /><br />\n'Phone. C. &amp; P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br /><br />\nOSTEOPATHY<br />\nti a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nW.D. BOWEN,M.D., D.0.,<br />\nFrost. &amp; Mgr.<br />\nESTABLISHED 1879.<br /><br />\nWed<br /><br />\nholiday<br />\nSilver Wits<br />\nIN GREAT VARIETY.<br /><br />\n44ke.CIEll elk<br /><br />\nJEiNKINS'<br />\nBIS N.<br />\nCHARLES ST.<br /><br />\nSilversmiths.<br /><br />\nlienderson's<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nMadison &amp; Howard Sts.<br /><br />\nText et<br />\n—00ka Note Books,<br />\n—t'Supplies.<br /><br />\nMARIA BUIE, 1) 0.,<br />\nV.-Prest. &amp; Asst. lticeiy.<br /><br />\nTHEO. WAANKR.<br />\nJACKS R. PAINS.,<br />\nNNT<br />\nFR<br />\n142 8c QQ.<br />\nuNIBRELLAS, HATTERS, CANES, ETC.<br />\nA; et for I ineoln &amp; Bennett and<br />\nWalter Barnard'a London Hats.<br />\n824 WEST 13A LaTINUM P.1 STREET.<br /><br />\nger<br />\nCUSHZ &amp; COMPANY,<br /><br />\nManufacturers of<br />\nSilk and Cassiinere Hats.<br /><br />\nSsono<br />\nKeeps constantly on hand the Text Books used in Johns<br /><br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nR. ElSENBRANDT SONS,<br />\nMUSICAL INSTRUMENTS.<br /><br />\nfor<br /><br />\nSpices—no adulteration, all strictly pure.<br /><br />\nMUSIC, PIANOS, ORGANS.<br />\n201-203 N.CHARLES ST.<br />\nBALTIMORE, MD.<br />\nCharles T. Crane,<br />\nPresident.<br /><br />\nOtto H. Williams,<br /><br />\nCarter G.Osburn,Cashier.<br />\n\"it A<br />\nDVERTISING SPACE IN THIS PAPER<br /><br />\nAPPLY TO<br />\nPEARRE E GROWL COMPANY.<br />\nPUBLISH ERS•<br />\nLIGHT AND LOMBARD STREETS<br />\nBALTIMORE, MD.<br /><br />\nVice-President.<br />\nJ. F. Marshall, As,Cashier.<br /><br />\nFARMERS &amp; MERCHANTS NAT'L. BANK,<br />\nSouth and Lombard Sts., Baltimore.<br />\nCapital. $650,000<br /><br />\nSurplus and Profits $450,000.<br />\nAccounts of Banks, Corporations, I. irms and Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br />\nCOLLECTIONS A SPECIALTY.<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\n14'Or Particulars apply to<br /><br />\n11<br />\n\"\"eller8<br />\nStationers.<br /><br />\n34 W. BALTIMORE ST.<br /><br />\n4011DRN STIIBLEft GO.<br /><br />\n8Iz Ground<br /><br />\nHOPKINS CAPS<br /><br />\nSCHOOL, LAID MEDICAL CLASSICAL AND MIIICALLAIMEOU•<br /><br />\nCertificate of Analysis from<br />\nProfs. G. W. Lehman &amp; Son,<br />\n701 to 705<br />\nMADISON AVM.<br />\nPrnuohReads as follows: Samples submitted of<br />\nBrandy—no adulterants, no coloring,fine quality.<br />\nPorto Port—absolutely<br />\npure, of superior quality.<br />\nitirtrY—no coloring or adulterants, absolutely pure wine.<br />\n111\"1,0Y-00 Fusel oil, no caramel, strictly pure<br />\n014<br />\n(cid ° Oil—all tests show pure olive oil.<br />\nairo,r Vinegar—hatural cider vinegar, strictly pure and<br /><br />\nINS. D.0.,<br />\nSeuly. &amp; Tread.<br /><br />\n11. MOM<br /><br />\nA. SCHUMACHER &amp; CO.,<br />\nGeneral Agents.<br /><br />\nCORRESPONDENCE INVITED<br /><br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS,GIBRALTER.<br />\nNAPLES. GENOA. ETC.<br />\nBALTIMORE TO BRCMEN<br />\nDIRECT.<br /><br />\nMANDOLIN. GUITAR AND BANJO 41 .0<br /><br />\nJ.<br /><br />\nTAUGHT CV<br /><br />\nC. J. LEVIN<br />\nwho has made a life study of these Instruments. Mandolin Soloist of National reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br /><br />\nStudio, 331 N. Gimeles St.<br /><br />\nZbe Itran3oSmith<br />\npiano Co.<br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br /><br />\nflgeniraz Studio<br /><br />\nCbtcherino, i3ra0burp ant' toZlebster<br /><br />\nSuccessor to Cummins<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\nSpecial Discount to Students<br /><br />\nTHE BLAKE CO<br /><br />\nBaltimore<br /><br />\nHABERDASHERS.<br />\nShirts, Neckwear,<br />\nUnderwear, Hosiery,<br />\nEtc.<br /><br />\nON SALE THE J. H. U. PENNANTS,<br />\nand all other College Pennants<br /><br />\n203W. BALTIMORE ST. &amp; 2 S. LIBERTY ST.<br /><br />\n.os<br /><br />\nost<br /><br />\nIPtail09.<br /><br />\nFactory Prices.<br /><br />\n0.&amp; P.'Phone 2322-2.<br /><br />\nSMITH'S soH,2 2TT&amp;B<br />\nOLD<br />\nBOOK<br />\n805 N. HOWARD STREET,<br />\n3rd door from Madison.<br /><br />\ng<br /><br />\nG<br /><br />\nSTORE•<br /><br />\nBALTIMORE, MD.<br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange;<br />\nChicago Board of Trade,<br /><br />\nClinton P. Paine<br />\nGordon P. Paine<br /><br />\nCLINTON P. PAINE &amp; CO.,<br />\nBANKERS &amp; BROKERS<br />\nPrivate Wires to<br />\nNew York and Chicago<br /><br />\n217 E. German Street<br />\nBALTIMORE, MD.<br /><br />\nThe Chas.'Nibs Surgical Instrument Company<br />\nBENJ, A<br /><br />\nNELSON, OEN'L MANAGER<br /><br />\nPhysicians,' Burgeons,' Hospital and Invalid Supplies.<br />\nFlue Microscopes and Aocessories.<br />\nBaltimore, Md.<br /><br />\n300 N. Howard St.,<br /><br />\nDrovers and Mechanics National Dank,<br />\nOF BALTIMORE, MD.<br /><br />\nCapital Stock,$300,000.<br /><br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br /><br />\nYOUR EIT,,S<br /><br />\nARE YOUR LIVING<br /><br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br />\nTHINK IT OVER.<br /><br />\nSAYRE OPTICAL COMPANY,<br />\n18S1 North Charles Street. (Masonic Temple.)<br /><br />\nK,XFMINING<br /><br />\nOLD AND NEW<br /><br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br /><br />\nBooks Bought, Sold and Exchanged,.. ..<br />\nWM. V.PIPPEN,<br />\nJ. Wm. Middendorf,<br />\nA.J. Robblos.<br /><br />\n605 N. Eutaw Street.<br />\nA. II Rutherfoord.<br />\nF. Lentz.<br /><br />\nJ. WM, MIDDENDORF &amp; CO.<br />\nVanhers &amp; trohers.<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nMembers<br />\nBaltimore, Md.<br />\nBaltimore Stock Exchange.<br /><br />\nB. G. EICHELBERGER,<br />\nBOOKS AND STATIONERY'<br />\nENGRAVING AND STAMPING.<br />\n1-x em.x-IL ops<br />\n1•4c\". 308 I\\r-t.1-x<br /><br />\nv<br /><br />\nV. M. C. A. BUILDING,<br />\nC.&amp; P. and Md.'Phones.<br />\nBALTIMORE, AlM<br /><br />\nCAll ON<br /><br />\nciftS. it. DOWNS,<br />\n229 N. Charles St.,<br />\nMASONIC TEMPLE.<br /><br />\n--11 FOR Class, Fraternity and College StationerY,<br />\nBanquet Cards, Invitations, Diplomat!,<br />\nPrograms, Visiting Cards, etc. ..... •<br /><br />\nOur 50o J. B. U. Bine and Black Hag Paper—now reathi•<br /><br />\nTHE NEWS LETTER<br />\nis from the Press of<br /><br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATION ERS<br />\nLight and Lombard Streets,<br /><br />\nBOOKS<br /><br />\nBALTIMORE<br /><br />\nWe carry a lull line of Students' Note Books and Stationery<br />\nBoth 'Phones.<br /><br />\nFT<br />\n5TIE<br />\nplANos<br /><br />\nThere is !darn little entertainment at home without a Plano<br /><br />\nAre The Best.<br /><br />\n9 N. Menu St<br /><br />\n(<br /><br />"}], "field_media_file": [{"target_id": 36226, "display": null, "description": null, "target_type": "file", "target_uuid": "4fea2b17-952b-4ee7-8841-b3bdb7801af8", "url": "http://digital.library.jhu.edu/system/files/2022-03/12208-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12208, "target_type": "node", "target_uuid": "84ff9459-c8dc-49b1-a930-60ecbb4444e0", "url": "/node/12208"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "efaa987e-8c24-44f4-a81b-3918c41f7daa"}]}