{"mid": [{"value": 54361}], "uuid": [{"value": "c98dbe7a-1812-4e4a-9c47-7b69a3955afa"}], "vid": [{"value": 54361}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-24T23:12:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "17481-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-24T23:12:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-24T23:12:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "%<br />\n<br />\n <br />\n<br />\n  <br />\n<br />\n/<br />\n<br />\n; e £ e e o e A et St i s gt<br />\n3 et e e e R e e 2 e B R R N P R P WA .<br />\n<br />\n44 |<br />\n<br />\n <br />\n<br />\ne e e e e iteibtbena e it e At b<br />\n> AN i<br />\nR ¥<br />\no _<br />\nS N<br />\n<br />\n  <br />\n<br />\n27 jclty gave a grant to George Loxd Balti-<br />\n' more for the poflelling and planting the<br />\n- Southern part of NemNetberlmd,'now<br />\nNew-York-fhire, lying toward Virginia s,<br />\n<br />\nFhlland they declared by publick wri-<br />\nting their diffent to what-ever had been<br />\n<br />\n. aced by any of their {ibjeéts in preju-<br />\ndice of his Majefties Right and Title in thofe parts, as hath<br />\nbeen already mentioned. Crefc’entia.wgs the name f}{f’t‘m.de-<br />\nfignation for this Countreys but it being left to his Majefty<br />\nat the time of his figning of the Bill, to give it what d@ng-<br />\nmination he judged fitteft : the was plca'feq in honour of his<br />\nRoyal Confort Queen Mary, toeredt it intoa Province by<br />\nthe name of Mary-Land : which Patent, upon the death of<br />\n<br />\nhis Lordfhip, before the final ratification thereof, was not long |<br />\n<br />\nafter confirmed under .the Broad-Seal of E.ngla;zd? bearing<br />\n{ date Fune 20, Ann. 1632, to his Son and Heir Cecilius the<br />\n<br />\nnow Loxd -Baltimores invefting him, his heirs and fucceffors |4<br />\n<br />\nwith the Sovereignty, attended with all Royal Prerogatives<br />\nboth Milicary and Civil, as abfolute Lords and Proprictors<br />\n1of the faid Province, faving only the Allegiance and Sove-<br />\nreign homage due to his Majetty, his Heirs .anc_i Succeffors 3<br />\nof whom they were to hold it, as of his M:i)ei‘ues honour of<br />\nWindfor's for” the yearly payment at the Cafile of the faid<br />\nhonout of Windfor on cvery Eafter Tuefday,of two Indian Ax-<br />\nrows of thofe parts; and the fifth part of all the Gold and<br />\nSilver Oar which fhould happen to be found there.<br />\nThe next year after this Patent had paft, viz. in the year<br />\n<br />\n(whereof fome perfons of quality) _was {ent‘over by the Lord<br />\nProprietor,under the conduct of ‘his Lordfhips two Brothers,<br />\nMr. Leonard, and Mr. George Calvert : the firft of whomi was<br />\nmade Governor of the Province for his Lordfhip, and from<br />\nthence forward this Plantation hath prefpered, and by the<br />\n| feveral fupplies fince fent, very much increafed ; to which<br />\ngood fuccefs, the good Government of the faid Mr., Leonard,<br />\nand his ftri¢t obfervance of his Lordfhip’s prudent inftru-<br />\n¢ions, very much conduced.  The firft place they pitch’d<br />\nupon ' to plant themfelves in, was Taocomv«zco,' now St. Maries,<br />\nwhich the Governor purchafed ~of the natives 5 (for neveg<br />\nhath ahy forcible or violent inv.ahon'of any mans right been<br />\nmade here by any of his Lordfhips Minifters) with fuch com-<br />\nmodities as they brought from ’ﬁngl?nd, d‘lough. at {o much<br />\nthe more cafy rate, in regard of - their pre-intentions to leave<br />\nthis place, as thinking it their {afeft courfe to remove farther<br />\noff from their too potent and valiant Neighbours the Sefgue-<br />\nSfhanocks. ¢ 4 : :<br />\n| After the happpy reftauration of his prefent Majefty, viz.<br />\nin the year 1661, the Lord Proprietors only Son, Mr. Charles<br />\nCalvers wrent over into thefe parts, his Eathcx§ Licutenant<br />\nin which charge he hath continued ever {ince in great tran-<br />\nquility and profperity, and with general contentment and<br />\n<br />\nGovernment,; or have any interefts or concerns in the Pro-<br />\nVullc\"ilis‘ Provinces according as it is bounded and fet out by<br />\n| the forementioned Patent, extends one way from the mott<br />\nNortheruly. part which bounds it to the South, & from which<br />\nit is parted by the Southernly bank of the River Pqtowmeck’<br />\nto New-York, or the moft Southernly part of New-England<br />\nwhich bounds it Northward 5 and from the 4¢launtick chn<br />\nand Delaware-Bay Eaftward to the true Meridian of the firft<br />\nFountain of the River Patowmeck Weltward. ‘<br />\n<br />\nThe Climate here in Summer time inclines to an extraox-<br />\n<br />\n| dinary heat, and in Winter is very colds but both the heat of<br />\n<br />\n‘the Summer is very much allayed by cool Breefes, and the<br />\ncold of the Winter is of fhort continuance  fo that the Coun-<br />\ntrey is accounted fufficiently healthful, and of late agrees<br />\nwell enough with Englifh bodies, fince the abatement and al-<br />\nmoft extin@ion, through the regulation of dict, felling of<br />\nthe woods,@c. of that diftemper called the Seafoning, which<br />\n| ufed to be very fatal to the Englith at their firft landing.<br />\n<br />\n\" The Countrey is for the moft part champain, the Soil fruit-<br />\nful. and abounding with many {orts of fruits and other com-<br />\nmodities which arc common in our parts.of the World : and<br />\nfor thofe:that are peculiar, it cannot be imagined that in {o<br />\nfmall @ diftanee, and even in the fame Countrey as 1t hath<br />\nbeen formerly accounted, they fhould differ rauch from thofe<br />\nof Virginia. Yet there is afort of fruit called a Perfimon<br />\nmentioned as moft efpecially belonging to Mary:Dfm{: and<br />\namong Birds, one named the Mock-bird, from its imitation<br />\n<br />\n    <br />\n<br />\n“of all other Singing-birds, which differing among, themf{clves<br />\n<br />\ns<br />\n<br />\n2T was in the year 1631 that his late Ma- ‘ :<br />\n<br />\n¥ when upon his Embaffy to the States of | -<br />\n<br />\n1633, a Colony of about20c0in all, Servants and Planters, |+<br />\n<br />\n <br />\n<br />\n <br />\n<br />\nfatisfaGion by his obliging carriage to all that live under his |<br />\n<br />\n <br />\n<br />\n <br />\n<br />\nThe DESCRIPTION of MARY-LAND,<br />\n<br />\nL<br />\no<br />\n<br />\n <br />\n<br />\ni<br />\ne e<br />\n<br />\n| in the mixture of their colours’s that which is black and yel-<br />\n<br />\n|<br />\n<br />\n <br />\n<br />\ne S e S e ettt et et et bttt<br />\ne :<br />\n<br />\n <br />\n <br />\n<br />\ntank, Nantecoke, Pocomoke, befides others of lefs note: of |<br />\n<br />\nlowis'called the Baltemare-hird, from the colours of his Lord-<br />\nfhips Coat of Arms; which are Or and Sable, cxcelling in<br />\nbeauty all the other forts. -<br />\n<br />\n‘The fame isto be faid of the complexions, cuftoms, difpo-<br />\nfitions, government, @, of the Natives of this Province<br />\nas of thofe of Virginiz and other adjacent parts 5 that is<br />\nin brief, that they are fomewhat tawny, their hair long,<br />\nblack and uneurl’d, but cut into fantaftical forms 5 more in-<br />\ngenious and docile than induftriots 5 each Town a diftiné<br />\nNation,and govern’d by its {everal Weroance or King, only<br />\nthe Safquabanocks are a Republick,<br />\n<br />\nAs the Province is-now: inhabited by the Englifh, it is dj-<br />\n<br />\n| vided into-ten Diftrits or Counties, five on the Eaftern-fhore<br />\n<br />\nof the Bay of Chefapeack, namely Dorchefter, Somerfer, Kent,<br />\n<br />\nCecil, and Talbot 3 and five on the Weft Lide of the Bay, |-<br />\n<br />\nSt, Maries , (where the Provincial Court, or chief Coure of<br />\nJudicature confitting of Governor and Counfiliar Judges, is<br />\nheld every quarterof a year) Aunsne Arundel,Baltemore,Charles<br />\nand Calvert, * :<br />\nThe chief Rivers of this Countrey are Patowmec, Pa-<br />\ntuxenty, Ann Arundel alias Severn, Safque(abanough, Chop- |<br />\n<br />\nthofe mentioned, the firft four on the Wefk fide, the other<br />\nthree to the Eaft fall into Chefapeack Bay, which is navigable<br />\nfor 200 miles, and which between two CapessCape Charles to<br />\nthe North, and Cape Henry to the South, being feven or cight |<br />\nleagucs diftant, receivesall the Ships that come for Virginia<br />\nor Mary-Land, and paffeth Noxthernly through the midft of |<br />\nMary-Land, *On the Eattetn thore of this Bayare divers con- |<br />\nvenient Harbours, Creeks and Iflands; and Northward there- |<br />\nof is the entrance of Delaware Bay. |<br />\n<br />\n- The original Seat, and principal City of this Province |<br />\nwhere the Provincial Courts, the general Aflembly, the Se- |<br />\ncretaries Office, and other publick Offices are held : and where<br />\nthe feat of Trade is fixt, is St. Maries, fituate in St. Maries |<br />\nCounty, on the Eaft-fide of St. Georges River. Here formetly<br />\nat the Palace of St. Fobns, the Governor Mr. Charles Calvers |<br />\nufed to refides but he hath now a very pleafant and com- |<br />\nmodious habitation at a place called Mattapany upon the |<br />\nRiver Patuxent, about eight miles from St. Maries : here is |<br />\nal{o another fair houfe where the Chancellor ufually refides. |<br />\n<br />\nThere were alfo fome years fince in all the reft of the’|<br />\nCounties the'foundations of Towns laid,” which no doubt |<br />\nby this timeare very .near, if not altogether compleated, par-<br />\nticularly in Calvert County near the River Patuxent ; 1, Cal-<br />\nverton in Battel-cretR: 2, Harvy Town over again{t Point Pa<br />\ntience: 3, Herington upon the Cliffs. -<br />\n<br />\nAs for the prefent Government of Mary-Land by the Eng-<br />\nlifh, the Lord Proprietor in the firft place is invefted, as hath |<br />\nbeen mentioned, with an abfolute power and dominion 3 by<br />\nwhofe fole command all things relating to Peace or War are<br />\nordered 5 and in whof¢ name iffue forth all publick Inftru-<br />\nments, Pateats, Warrants, Writs, @c. In the ena&ing of<br />\nLaws he hath the confent and advice of the general Afiem-:<br />\nbly, which is made up of two Eftates 5 the firft confifting of<br />\nhis Loxd(hips Privy Council, (of which the Chancellor and<br />\nSecretary alwaies are) and fuch Lords of Manors as are called<br />\nby his Lord(hips fpecial Writ, the other of the Deputies of<br />\ncach Province, elected by ‘the free voice of the Free-<br />\nholders of the refpective Province for which each Deputy is<br />\nchofen. : L<br />\n<br />\nThe names of the prefent Governor, the prime Officers of<br />\nState, and thereft of his Lordthips Privy Council are as fol-<br />\nloweth: the Governor Mr. Charles Calvert, his Lord(hips<br />\nSon and Heir: the Chancellotr Mr. Philip Calvert, his Lord-<br />\nthips Brother : the Secretary Sir #'illiam Talbot: the Mufter-<br />\nMalter General Mr. William Calvert : Mr. Baker Brook., all<br />\nthree his Lordfhips Nephews : the Surveyor General Mr.- Fe-<br />\nrome White, Mr. Edw, Lloyd, Mx. Henry Courly, Mr. Thomas<br />\nTrueman,Major Edward Fitz-Herbert, Mr. S avinel Chew,<br />\n<br />\nValt quantities of Tobacco, the grand Trade of this Pro-1<br />\nvince ot Mary-Land are yearly vended from hence, not only |<br />\nin England, but likewife in {everal of the other Englifh Plan-<br />\n<br />\nditics, to the great improvement of his Majefties Revenue by<br />\nCultom and Excife. The common way of traffick here is by<br />\nbartcr or trucking of commodities one for anothers though<br />\nmoncy is not altogether wanting,as well of the coin of Eng-<br />\nland and other parts, as of his Lordfhips own coin, being<br />\n{tampt on the one fide with his Lordthips Coat of Arms,with<br />\nthis circurnfcription, Crefeite 2 Multiplicamini 3 and on the<br />\nother fide with his Efhigies, and this circumfcription, Cecilins<br />\n<br />\nDominus Lerre Marie, &c. |<br />\n<br />\n <br />\n<br />\ntations: befides the importation alfo of fome other ccnnnoml<br />\n<br />\ni<br />\ni<br />\n<br />\n <br />\n<br />\n|<br />\n|<br />\n|<br />\ni<br />\n|<br />\n<br />\nI and<br />\ntile) of producing all things that naturally gtow in thefe<br />\n<br />\n- A SR R R e £ S I e e e e e e e et e e b<br />\n: 2 ol R gt e Re s e e e o - : - <<br />\net e e e T v : > ”<br />\n<br />\nTHE DESCRIPTION<br />\n<br />\nIR GINTA; now properly fo called s<br />\n<br />\nferibed, is the moft Southern part of<br />\nthat tralt of Land, which at its firft<br />\ndifcovery (namely by the two Cabots,<br />\nandafter them Fobit Verazzanoa Flo-<br />\n<br />\n <br />\n<br />\nfiin¢tly by others) was all comprehen-<br />\n<br />\nded by this'name : whether from Vignina an ancient King<br />\n<br />\nthereof, or from our Virgin Queen Elizabeths the other |<br />\n<br />\nparts being fince dittinguifhied by the names of New-England,<br />\nNew-York ; and Mary-Land. After the more perfect difco-<br />\nvery of thefe parts (which is faid to have been firft encouraged<br />\n<br />\nand promoted by Sir Walter Raleigh) by feveral worthy Ad-<br />\n<br />\nventurers 5 as firft Captain ‘Pl;z'lz’p\\Amz’aﬁzf, and Capt. /57;!/];;7‘,<br />\nBarlow; Anno 1584, Six Richard Greenvil, 1585. Mr. ‘j(}/).}’l<br />\nWhite, 1587, and 1589. Capt. Gofinol, 1602. Capt. Martin<br />\nPring, 1603, fet out by the City of Briftsl. Capt. George Wei-<br />\nmonth, 1605, (et out by the Lord Arundel of Warder s at laft<br />\nin the year 1606, fome footing being got, for. all ‘the fore-<br />\nmentioned voyages had prov’d fucceilefs, thofe’ that went<br />\nover with Capt. Newport, carrying -with them a commiﬁlorll<br />\nfrom King Fezmes fo the eftablifhing a Counfel to direct<br />\nthofe new difcoveries, landed on the 19th. of December ata<br />\nplace afterwards called Cape Henry, at the-mouth of Chefa-<br />\npeac-Bay, and immediately opened their Orders, by which<br />\neight of the Counfel were declared, with power to_.g\\hoofg a<br />\nPrefident to. govern for a year. together with the ’Counfcll,<br />\nThe next year Letters Patents ‘bﬁaripg datg A[J;\"zl‘.tucw}o:x,n<br />\nwere granted by the King to Sir Thomas Gates, Sir George<br />\nSummers, and the reft of the Undertakers, who were divers<br />\nKnights,; Gentlgmen. and Merchants of Loidon, Briftol, Exe-<br />\nter, Plymouth, and other parts, to make a doul;lcw Cﬂolony for |<br />\nthe more fpeedy planting of the place 5 the firft Colonyto<br />\nbe undertaken by thofe of London, the other by thofe of<br />\nBriftol, Exeter, Plymounth,&c. However, it was not till in fome !<br />\n<br />\n|<br />\n<br />\nyearsafter that this Plantation came to be confiderably peo-<br />\npled : and that principally by the great care, md_uﬁry‘, and<br />\nativity in this affair of the Valiant Captain Fobu Smith,<br />\nwho in the year 1615, in the 12¢h. of King Fames his Reign,<br />\nprocured by his'intereft at Court his Ma;gltlcs_ rccomnaenda«_<br />\ntory Letters for the encouragement of a ftanding Lottery for<br />\nthe benefit of the Plantation s which accordingly fucceeded :<br />\nand'in two or three years time turn’d to 1o bad account. And<br />\nperhaps the cancelling and making void of the Patent granted<br />\nto the'Corporation of the firft Colony Of_V‘zrgmza, and all<br />\nother Patents by which the faid Corporation or Company<br />\nof Adventurers of Virginia held any interelt there which was<br />\ndone in Trinity Term 1623, by reafon of feveral mifdemea-<br />\nnors and mifcarriages objected againft the faid Corporation, |<br />\nwas an inlet of a tar greater conflux into ‘thefe parts than<br />\notherwife would have been, by reafon that this Corporation<br />\nbeing diffolved, and the Plantation governed b] perfons im- |<br />\nmediately appointed by commitfion from theKing, a greater |<br />\nfreedom of Trade was opencd to all his.Majefties Subjeéts<br />\nthat would adventure into thofe parts. The greateft diftur- E<br />\nbance the Englifh received from the naﬁves was in the year i<br />\n1622, when by a general infurrection cf -the Barbarians 300<br />\nof our men were maffacred. : ;<br />\nIn the year of our Lord 1631, being the 7¢h. of the Rejgn<br />\nof King Charles the Firft, the moft Northernly part of th;sl<br />\n<br />\n <br />\n<br />\n <br />\n<br />\ni<br />\n<br />\n <br />\n<br />\nCountrey was parcell’d out into a particular Province, and by<br />\nPatent granted to the Lord Baltemore by the name of Mary-<br />\nland. And inlike tanner in the 15th. year of his prefent<br />\nMajefty, being the year of our Lord 1663, that part of Flo-<br />\nride which lics South of Virginia, to Edw. Earl of Glarendon,<br />\nthen Lord High Chaneellor of England 5 George Duke of<br />\nAlbemarls William Earl of Cravens Fobn Lord Berkley;<br />\nAnthony Lord Aply, now Eail of Shaftsbury 5 Sir. George<br />\nCarteret 5 Sir William Berkley, and Sir Fobn Colleton, by the<br />\nname of Carolinay as is fpecified more at large in the parti-<br />\ncular difcoutfes of thefe two Countreys.. . Sl<br />\nSo that Virginis, as it now ftands, with thefe two Provin-<br />\nceslopt from it 3, for in Carolina alfo is included {ome part of<br />\nthe Land which belonged formerly to the diffolved Com-~<br />\npany of Virginias extends it felf only between 36 and 37 |<br />\ndegreess and 50 minutes of Northern latitude, 4bcing, boun-<br />\nded to the Eait by the Ocean, to the North by Mary-land, to<br />\nthe Weft by-the South=Seas, and to the South by Caroling; |<br />\nThe Air of Virginis is accounted of a temperature very<br />\nwholfome and agreeable to Englith conftitutions; (efpeeially |<br />\nfince by the cutting down of the woods, and the regulation |<br />\nof diet, the {eafonings have been abated) only within the pre- |<br />\nfent limits of Virginia it is fomewhat Hottet in Summer than |<br />\nin that part called Mary-Lénd 3 and the feafoning was for- |<br />\nmerly more violent and dangerous hete .to the Englith at |<br />\ntheir firft landing; R S j<br />\nThe Soil which s gerefally plaii; but {ométitnes ditreifi- ‘2<br />\n<br />\ndale; is capable i(Geing very fers<br />\n<br />\nfiedwith variety of hill an<br />\n<br />\n <br />\n<br />\nrentine, though afterwards .more di- .<br />\n<br />\n1<br />\n<br />\nl e et ettt<br />\n<br />\n <br />\n<br />\n/<br />\n<br />\nparts: befides which, there are of the proper growth of this}<br />\n‘and which is here peculiarly tobe de= | ,Countrgiy, a fort of Plantcalled Silk-grafs, of “which is made<br />\n.a very fine Stuff of a filky glofs, and cordage more ftrongand -<br />\nlalting than any of hemp or flax. For fruits, the Metraque- |-<br />\n[unanks, fomething refembling the Indian Figs the Chechin-<br />\n<br />\n‘I-quaming; which come neareft ‘to the Chefnut; the Puicha-<br />\n<br />\nmines, a fruit fomewhat like a Damfin; Meffamine r, a fort of.<br />\n<br />\nGrape in thew 5 Rawcomens, the refemblance of a Goofe-<br />\n<br />\n{ bereys Morococks , not much unlike a Strawberry 5 Maco-:<br />\n- fqrer,a Kind of Apples -Ocoughtanamnis, a berry much like|<br />\n<br />\nCapers.. For roots, Mufguafpen,with the juice whereof, being<br />\n<br />\na rich fort of paint, ‘they colour their Matts and Targets |<br />\n<br />\nWichfacan,yiclding a molt excellent healing juice for wounds;<br />\nPocones, an emulgent of much efficacy for fwellings and aches;<br />\nTockawangh, frequently eatens theresis alfo a Plane called<br />\nMattonna, of which they make bread s and Affament, 3\" fore<br />\n<br />\nof Pulfe, eftecmed a great delicacy among the natives,<br />\n<br />\nl The Beafts peculiar to this Countrey are the Opafluin, 2|<br />\n<br />\ncertain beaft which carricth and fuckletl her youngin a bag<br />\nwhich fhe hath under her bellysthe Affzpanic or flying Squir-<br />\ntels the Muflafcis, a musk-fented beatt, having the fhape of 2<br />\nWater-rats the Aroughena, a fort of Badger; the Utchunguois,<br />\nfomewhat like'a wild Cats alfo a (it of bealt called Rofcones.<br />\nOf Fith, the moft peculiar is the Stingraife, which is alfo<br />\ncommon to this Countrey with New England. _<br />\n. So many feveral Towns as were anciently among the na-<br />\ncxcept that of the Sefguabanocky, all fomething differing in<br />\ndifpofition,-cuftoms,. and religious ceremonies, and i oft of |<br />\nof a tawny complexion, with black, flaggy, and long hair:<br />\ncrafty,and treacherous,{ufficiently laborious in the art of War,<br />\nwhich-they ufed frequently to exercife among each other ; |<br />\nand wonderfal lovers of huntings in other things moft {can- |<br />\ndaloufly lazy and indulgent to their eafe 5 mean in théir ap- |<br />\nparel, homely in their diet, and fluttith in their houfes. !<br />\nAll Ships that come to Virginia and Mary-Land enter<br />\n‘through the Bay of Chefupeacs at whofe opening to the]<br />\nSouth, Virginia begins between thofe famous Capes, Cape<br />\nHenry and Cape Charles. Into this Bay which runs up 75<br />\nleagues Northward into the Countrey, and is in fome places<br />\n<br />\n  <br />\n   <br />\n   <br />\n  <br />\n<br />\nwhereof are Fames River, formerly called Powhatan, the de-<br />\nnomination of a very Potent King of this Countrey, at the<br />\ntime of the Englith firly adventuring thither : this River is<br />\nfound navigable 50 leagues, or thereabout. 2, York River, |<br />\notherwife Pamaunke in the language of the natives; which |<br />\nlies abour 14 miles Northward from the other, and is naviga- |<br />\n‘ble 26 leagues. 3, Rapabanock,, or Topahanock , the laft River|<br />\nof Virginia Northward, and navigable 40 leagues. 4, Pa- |<br />\ntowmec River, mentioned in the defcription of Mary-Eand, |<br />\nto which part of the Countrey this River alfo belongs. - Be- |<br />\nfides thefe greater Rivers, there are fome others of lefs note<br />\nwhich fall into them, as into Powbatan, or James River,}<br />\nSouthward Apamerucks Eaftward Quiyonycobanuc, Nanfa-|<br />\nmund and Chefopeacs Northward Chickamabania, into Po- |<br />\nmaunkee Payankarank, |<br />\n<br />\nThe Englith Plantation here is divided into 22 Counties ;<br />\n| on the Eaftern (hore Northampton County in Acomac 5 on.the |<br />\n| Weftern thore Carotuce, fames, Henrico, Charles, Tork , Glo-<br />\n| cefter, Surry, Hartford, Warwick , Lancafter, New Kent, 8 urrey,<br />\n| Middlefex s Nanfemund , Lower Norfolk, orthumberland,<br />\n| Wetmorland | Northampron , Warwick , e of Wight, and |<br />\n{ Rappabanoc s in each of which are monthly held' thofe in-<br />\nj ferior County Courts; where matters not of higheft concern- |<br />\n| ment, or relating to life, are tried 5 and from whence appeals |<br />\n| ar¢ made to the Quarter Court at Fames-Town, where all}<br />\n| criminal and civil Caufesate determined, and where the Go-<br />\n{ vernor and Counfel fit as Judges. »<br />\n<br />\nThe Metropolis, or chief Seat of the Englifh here is Fames-|<br />\nTown, or rather James-City fo denominated in honour of |<br />\nKing Fénes, where the Quarter Courts, General Aflemblies|<br />\n<br />\nand Sccretaries Office are kept. This Town adorned with |<br />\n; ‘many fair Brick-houfes, and other handfome Edifices, is fitu- |<br />\nI ated in a Peninfula on the North-fide of Fames River.: The<br />\nother Towns and Places of chief note are Elizabeth City,<br />\n<br />\nfeated nearer the mouth of the River on the faime fide S Medr<br />\n<br />\n <br />\n<br />\nwhich, at a place nam’d Green-(pring, Sir William Berkley the<br />\n<br />\nprefent Governor, hath a very pleafant Manlion-houfe built|<br />\nof bricks Feuricopolis, or Henry’s Town, fo denominated<br />\nfrom Prince Hexry, living when it was fitft buile, feated ina<br />\ncominodious place about 8o .iles from Fames City: Dale’s<br />\ngift; fo named from Sir Thomas Dale, Deputy Govetnor of<br />\nthe Place in the year 1610, at whofe charge it was built, dnd<br />\na Colony here planted 5 befides others of lefs note, fome|<br />\nwhercof ftill tetain the Indian names; as Wicocomocs, Ber-<br />\nmiide, s which doubtlefs are by this time increafed to a very<br />\nconfiderdble nuimber, in regard of the amplitude and gran-<br />\ndeuf to.which, by the continual accefs of people, this Planta-<br />\n<br />\ntiori'is of late arriveds :<br />\n<br />\n <br />\n<br />\n <br />\n<br />\nY. el o e<br />\n<br />\n| 43<br />\n<br />\n <br />\n<br />\ntives, fo many diftin¢ Nations there were, all Monarchical |<br />\n<br />\n <br />\n<br />\nall m'language 5 but all of them in gencral valiant, well-fet. |<br />\n<br />\nfeven leagues broad, there fall feveral noted Rivers, the chief]<br />\n<br />\ne msa e<br />\n<br />\n <br />\n<br />\n <br />\n<br />\nS<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n\f", "format": "basic_html", "processed": "%<br /><br /><br /><br /><br /><br />\n/<br /><br />\n; e £ e e o e A et St i s gt<br />\n3 et e e e R e e 2 e B R R N P R P WA .<br /><br />\n44 |<br /><br /><br /><br />\ne e e e e iteibtbena e it e At b<br />\n&gt; AN i<br />\nR ¥<br />\no _<br />\nS N<br /><br /><br /><br />\n27 jclty gave a grant to George Loxd Balti-<br />\n' more for the poflelling and planting the<br />\n- Southern part of NemNetberlmd,'now<br />\nNew-York-fhire, lying toward Virginia s,<br /><br />\nFhlland they declared by publick wri-<br />\nting their diffent to what-ever had been<br /><br />\n. aced by any of their {ibjeéts in preju-<br />\ndice of his Majefties Right and Title in thofe parts, as hath<br />\nbeen already mentioned. Crefc’entia.wgs the name f}{f’t‘m.de-<br />\nfignation for this Countreys but it being left to his Majefty<br />\nat the time of his figning of the Bill, to give it what d@ng-<br />\nmination he judged fitteft : the was plca'feq in honour of his<br />\nRoyal Confort Queen Mary, toeredt it intoa Province by<br />\nthe name of Mary-Land : which Patent, upon the death of<br /><br />\nhis Lordfhip, before the final ratification thereof, was not long |<br /><br />\nafter confirmed under .the Broad-Seal of E.ngla;zd? bearing<br />\n{ date Fune 20, Ann. 1632, to his Son and Heir Cecilius the<br /><br />\nnow Loxd -Baltimores invefting him, his heirs and fucceffors |4<br /><br />\nwith the Sovereignty, attended with all Royal Prerogatives<br />\nboth Milicary and Civil, as abfolute Lords and Proprictors<br />\n1of the faid Province, faving only the Allegiance and Sove-<br />\nreign homage due to his Majetty, his Heirs .anc_i Succeffors 3<br />\nof whom they were to hold it, as of his M:i)ei‘ues honour of<br />\nWindfor's for” the yearly payment at the Cafile of the faid<br />\nhonout of Windfor on cvery Eafter Tuefday,of two Indian Ax-<br />\nrows of thofe parts; and the fifth part of all the Gold and<br />\nSilver Oar which fhould happen to be found there.<br />\nThe next year after this Patent had paft, viz. in the year<br /><br />\n(whereof fome perfons of quality) _was {ent‘over by the Lord<br />\nProprietor,under the conduct of ‘his Lordfhips two Brothers,<br />\nMr. Leonard, and Mr. George Calvert : the firft of whomi was<br />\nmade Governor of the Province for his Lordfhip, and from<br />\nthence forward this Plantation hath prefpered, and by the<br />\n| feveral fupplies fince fent, very much increafed ; to which<br />\ngood fuccefs, the good Government of the faid Mr., Leonard,<br />\nand his ftri¢t obfervance of his Lordfhip’s prudent inftru-<br />\n¢ions, very much conduced.  The firft place they pitch’d<br />\nupon ' to plant themfelves in, was Taocomv«zco,' now St. Maries,<br />\nwhich the Governor purchafed ~of the natives 5 (for neveg<br />\nhath ahy forcible or violent inv.ahon'of any mans right been<br />\nmade here by any of his Lordfhips Minifters) with fuch com-<br />\nmodities as they brought from ’ﬁngl?nd, d‘lough. at {o much<br />\nthe more cafy rate, in regard of - their pre-intentions to leave<br />\nthis place, as thinking it their {afeft courfe to remove farther<br />\noff from their too potent and valiant Neighbours the Sefgue-<br />\nSfhanocks. ¢ 4 : :<br />\n| After the happpy reftauration of his prefent Majefty, viz.<br />\nin the year 1661, the Lord Proprietors only Son, Mr. Charles<br />\nCalvers wrent over into thefe parts, his Eathcx§ Licutenant<br />\nin which charge he hath continued ever {ince in great tran-<br />\nquility and profperity, and with general contentment and<br /><br />\nGovernment,; or have any interefts or concerns in the Pro-<br />\nVullc\"ilis‘ Provinces according as it is bounded and fet out by<br />\n| the forementioned Patent, extends one way from the mott<br />\nNortheruly. part which bounds it to the South, &amp; from which<br />\nit is parted by the Southernly bank of the River Pqtowmeck’<br />\nto New-York, or the moft Southernly part of New-England<br />\nwhich bounds it Northward 5 and from the 4¢launtick chn<br />\nand Delaware-Bay Eaftward to the true Meridian of the firft<br />\nFountain of the River Patowmeck Weltward. ‘<br /><br />\nThe Climate here in Summer time inclines to an extraox-<br /><br />\n| dinary heat, and in Winter is very colds but both the heat of<br /><br />\n‘the Summer is very much allayed by cool Breefes, and the<br />\ncold of the Winter is of fhort continuance  fo that the Coun-<br />\ntrey is accounted fufficiently healthful, and of late agrees<br />\nwell enough with Englifh bodies, fince the abatement and al-<br />\nmoft extin@ion, through the regulation of dict, felling of<br />\nthe woods,@c. of that diftemper called the Seafoning, which<br />\n| ufed to be very fatal to the Englith at their firft landing.<br /><br />\n\" The Countrey is for the moft part champain, the Soil fruit-<br />\nful. and abounding with many {orts of fruits and other com-<br />\nmodities which arc common in our parts.of the World : and<br />\nfor thofe:that are peculiar, it cannot be imagined that in {o<br />\nfmall @ diftanee, and even in the fame Countrey as 1t hath<br />\nbeen formerly accounted, they fhould differ rauch from thofe<br />\nof Virginia. Yet there is afort of fruit called a Perfimon<br />\nmentioned as moft efpecially belonging to Mary:Dfm{: and<br />\namong Birds, one named the Mock-bird, from its imitation<br /><br /><br /><br />\n“of all other Singing-birds, which differing among, themf{clves<br /><br />\ns<br /><br />\n2T was in the year 1631 that his late Ma- ‘ :<br /><br />\n¥ when upon his Embaffy to the States of | -<br /><br />\n1633, a Colony of about20c0in all, Servants and Planters, |+<br /><br /><br /><br /><br /><br />\nfatisfaGion by his obliging carriage to all that live under his |<br /><br /><br /><br /><br /><br />\nThe DESCRIPTION of MARY-LAND,<br /><br />\nL<br />\no<br /><br /><br /><br />\ni<br />\ne e<br /><br />\n| in the mixture of their colours’s that which is black and yel-<br /><br />\n|<br /><br /><br /><br />\ne S e S e ettt et et et bttt<br />\ne :<br /><br /><br /><br /><br />\ntank, Nantecoke, Pocomoke, befides others of lefs note: of |<br /><br />\nlowis'called the Baltemare-hird, from the colours of his Lord-<br />\nfhips Coat of Arms; which are Or and Sable, cxcelling in<br />\nbeauty all the other forts. -<br /><br />\n‘The fame isto be faid of the complexions, cuftoms, difpo-<br />\nfitions, government, @, of the Natives of this Province<br />\nas of thofe of Virginiz and other adjacent parts 5 that is<br />\nin brief, that they are fomewhat tawny, their hair long,<br />\nblack and uneurl’d, but cut into fantaftical forms 5 more in-<br />\ngenious and docile than induftriots 5 each Town a diftiné<br />\nNation,and govern’d by its {everal Weroance or King, only<br />\nthe Safquabanocks are a Republick,<br /><br />\nAs the Province is-now: inhabited by the Englifh, it is dj-<br /><br />\n| vided into-ten Diftrits or Counties, five on the Eaftern-fhore<br /><br />\nof the Bay of Chefapeack, namely Dorchefter, Somerfer, Kent,<br /><br />\nCecil, and Talbot 3 and five on the Weft Lide of the Bay, |-<br /><br />\nSt, Maries , (where the Provincial Court, or chief Coure of<br />\nJudicature confitting of Governor and Counfiliar Judges, is<br />\nheld every quarterof a year) Aunsne Arundel,Baltemore,Charles<br />\nand Calvert, * :<br />\nThe chief Rivers of this Countrey are Patowmec, Pa-<br />\ntuxenty, Ann Arundel alias Severn, Safque(abanough, Chop- |<br /><br />\nthofe mentioned, the firft four on the Wefk fide, the other<br />\nthree to the Eaft fall into Chefapeack Bay, which is navigable<br />\nfor 200 miles, and which between two CapessCape Charles to<br />\nthe North, and Cape Henry to the South, being feven or cight |<br />\nleagucs diftant, receivesall the Ships that come for Virginia<br />\nor Mary-Land, and paffeth Noxthernly through the midft of |<br />\nMary-Land, *On the Eattetn thore of this Bayare divers con- |<br />\nvenient Harbours, Creeks and Iflands; and Northward there- |<br />\nof is the entrance of Delaware Bay. |<br /><br />\n- The original Seat, and principal City of this Province |<br />\nwhere the Provincial Courts, the general Aflembly, the Se- |<br />\ncretaries Office, and other publick Offices are held : and where<br />\nthe feat of Trade is fixt, is St. Maries, fituate in St. Maries |<br />\nCounty, on the Eaft-fide of St. Georges River. Here formetly<br />\nat the Palace of St. Fobns, the Governor Mr. Charles Calvers |<br />\nufed to refides but he hath now a very pleafant and com- |<br />\nmodious habitation at a place called Mattapany upon the |<br />\nRiver Patuxent, about eight miles from St. Maries : here is |<br />\nal{o another fair houfe where the Chancellor ufually refides. |<br /><br />\nThere were alfo fome years fince in all the reft of the’|<br />\nCounties the'foundations of Towns laid,” which no doubt |<br />\nby this timeare very .near, if not altogether compleated, par-<br />\nticularly in Calvert County near the River Patuxent ; 1, Cal-<br />\nverton in Battel-cretR: 2, Harvy Town over again{t Point Pa<br />\ntience: 3, Herington upon the Cliffs. -<br /><br />\nAs for the prefent Government of Mary-Land by the Eng-<br />\nlifh, the Lord Proprietor in the firft place is invefted, as hath |<br />\nbeen mentioned, with an abfolute power and dominion 3 by<br />\nwhofe fole command all things relating to Peace or War are<br />\nordered 5 and in whof¢ name iffue forth all publick Inftru-<br />\nments, Pateats, Warrants, Writs, @c. In the ena&amp;ing of<br />\nLaws he hath the confent and advice of the general Afiem-:<br />\nbly, which is made up of two Eftates 5 the firft confifting of<br />\nhis Loxd(hips Privy Council, (of which the Chancellor and<br />\nSecretary alwaies are) and fuch Lords of Manors as are called<br />\nby his Lord(hips fpecial Writ, the other of the Deputies of<br />\ncach Province, elected by ‘the free voice of the Free-<br />\nholders of the refpective Province for which each Deputy is<br />\nchofen. : L<br /><br />\nThe names of the prefent Governor, the prime Officers of<br />\nState, and thereft of his Lordthips Privy Council are as fol-<br />\nloweth: the Governor Mr. Charles Calvert, his Lord(hips<br />\nSon and Heir: the Chancellotr Mr. Philip Calvert, his Lord-<br />\nthips Brother : the Secretary Sir #'illiam Talbot: the Mufter-<br />\nMalter General Mr. William Calvert : Mr. Baker Brook., all<br />\nthree his Lordfhips Nephews : the Surveyor General Mr.- Fe-<br />\nrome White, Mr. Edw, Lloyd, Mx. Henry Courly, Mr. Thomas<br />\nTrueman,Major Edward Fitz-Herbert, Mr. S avinel Chew,<br /><br />\nValt quantities of Tobacco, the grand Trade of this Pro-1<br />\nvince ot Mary-Land are yearly vended from hence, not only |<br />\nin England, but likewife in {everal of the other Englifh Plan-<br /><br />\nditics, to the great improvement of his Majefties Revenue by<br />\nCultom and Excife. The common way of traffick here is by<br />\nbartcr or trucking of commodities one for anothers though<br />\nmoncy is not altogether wanting,as well of the coin of Eng-<br />\nland and other parts, as of his Lordfhips own coin, being<br />\n{tampt on the one fide with his Lordthips Coat of Arms,with<br />\nthis circurnfcription, Crefeite 2 Multiplicamini 3 and on the<br />\nother fide with his Efhigies, and this circumfcription, Cecilins<br /><br />\nDominus Lerre Marie, &amp;c. |<br /><br /><br /><br />\ntations: befides the importation alfo of fome other ccnnnoml<br /><br />\ni<br />\ni<br /><br /><br /><br />\n|<br />\n|<br />\n|<br />\ni<br />\n|<br /><br />\nI and<br />\ntile) of producing all things that naturally gtow in thefe<br /><br />\n- A SR R R e £ S I e e e e e e e et e e b<br />\n: 2 ol R gt e Re s e e e o - : - &lt;<br />\net e e e T v : &gt; ”<br /><br />\nTHE DESCRIPTION<br /><br />\nIR GINTA; now properly fo called s<br /><br />\nferibed, is the moft Southern part of<br />\nthat tralt of Land, which at its firft<br />\ndifcovery (namely by the two Cabots,<br />\nandafter them Fobit Verazzanoa Flo-<br /><br /><br /><br />\nfiin¢tly by others) was all comprehen-<br /><br />\nded by this'name : whether from Vignina an ancient King<br /><br />\nthereof, or from our Virgin Queen Elizabeths the other |<br /><br />\nparts being fince dittinguifhied by the names of New-England,<br />\nNew-York ; and Mary-Land. After the more perfect difco-<br />\nvery of thefe parts (which is faid to have been firft encouraged<br /><br />\nand promoted by Sir Walter Raleigh) by feveral worthy Ad-<br /><br />\nventurers 5 as firft Captain ‘Pl;z'lz’p\\Amz’aﬁzf, and Capt. /57;!/];;7‘,<br />\nBarlow; Anno 1584, Six Richard Greenvil, 1585. Mr. ‘j(}/).}’l<br />\nWhite, 1587, and 1589. Capt. Gofinol, 1602. Capt. Martin<br />\nPring, 1603, fet out by the City of Briftsl. Capt. George Wei-<br />\nmonth, 1605, (et out by the Lord Arundel of Warder s at laft<br />\nin the year 1606, fome footing being got, for. all ‘the fore-<br />\nmentioned voyages had prov’d fucceilefs, thofe’ that went<br />\nover with Capt. Newport, carrying -with them a commiﬁlorll<br />\nfrom King Fezmes fo the eftablifhing a Counfel to direct<br />\nthofe new difcoveries, landed on the 19th. of December ata<br />\nplace afterwards called Cape Henry, at the-mouth of Chefa-<br />\npeac-Bay, and immediately opened their Orders, by which<br />\neight of the Counfel were declared, with power to_.g\\hoofg a<br />\nPrefident to. govern for a year. together with the ’Counfcll,<br />\nThe next year Letters Patents ‘bﬁaripg datg A[J;\"zl‘.tucw}o:x,n<br />\nwere granted by the King to Sir Thomas Gates, Sir George<br />\nSummers, and the reft of the Undertakers, who were divers<br />\nKnights,; Gentlgmen. and Merchants of Loidon, Briftol, Exe-<br />\nter, Plymouth, and other parts, to make a doul;lcw Cﬂolony for |<br />\nthe more fpeedy planting of the place 5 the firft Colonyto<br />\nbe undertaken by thofe of London, the other by thofe of<br />\nBriftol, Exeter, Plymounth,&amp;c. However, it was not till in fome !<br /><br />\n|<br /><br />\nyearsafter that this Plantation came to be confiderably peo-<br />\npled : and that principally by the great care, md_uﬁry‘, and<br />\nativity in this affair of the Valiant Captain Fobu Smith,<br />\nwho in the year 1615, in the 12¢h. of King Fames his Reign,<br />\nprocured by his'intereft at Court his Ma;gltlcs_ rccomnaenda«_<br />\ntory Letters for the encouragement of a ftanding Lottery for<br />\nthe benefit of the Plantation s which accordingly fucceeded :<br />\nand'in two or three years time turn’d to 1o bad account. And<br />\nperhaps the cancelling and making void of the Patent granted<br />\nto the'Corporation of the firft Colony Of_V‘zrgmza, and all<br />\nother Patents by which the faid Corporation or Company<br />\nof Adventurers of Virginia held any interelt there which was<br />\ndone in Trinity Term 1623, by reafon of feveral mifdemea-<br />\nnors and mifcarriages objected againft the faid Corporation, |<br />\nwas an inlet of a tar greater conflux into ‘thefe parts than<br />\notherwife would have been, by reafon that this Corporation<br />\nbeing diffolved, and the Plantation governed b] perfons im- |<br />\nmediately appointed by commitfion from theKing, a greater |<br />\nfreedom of Trade was opencd to all his.Majefties Subjeéts<br />\nthat would adventure into thofe parts. The greateft diftur- E<br />\nbance the Englifh received from the naﬁves was in the year i<br />\n1622, when by a general infurrection cf -the Barbarians 300<br />\nof our men were maffacred. : ;<br />\nIn the year of our Lord 1631, being the 7¢h. of the Rejgn<br />\nof King Charles the Firft, the moft Northernly part of th;sl<br /><br /><br /><br /><br /><br />\ni<br /><br /><br /><br />\nCountrey was parcell’d out into a particular Province, and by<br />\nPatent granted to the Lord Baltemore by the name of Mary-<br />\nland. And inlike tanner in the 15th. year of his prefent<br />\nMajefty, being the year of our Lord 1663, that part of Flo-<br />\nride which lics South of Virginia, to Edw. Earl of Glarendon,<br />\nthen Lord High Chaneellor of England 5 George Duke of<br />\nAlbemarls William Earl of Cravens Fobn Lord Berkley;<br />\nAnthony Lord Aply, now Eail of Shaftsbury 5 Sir. George<br />\nCarteret 5 Sir William Berkley, and Sir Fobn Colleton, by the<br />\nname of Carolinay as is fpecified more at large in the parti-<br />\ncular difcoutfes of thefe two Countreys.. . Sl<br />\nSo that Virginis, as it now ftands, with thefe two Provin-<br />\nceslopt from it 3, for in Carolina alfo is included {ome part of<br />\nthe Land which belonged formerly to the diffolved Com-~<br />\npany of Virginias extends it felf only between 36 and 37 |<br />\ndegreess and 50 minutes of Northern latitude, 4bcing, boun-<br />\nded to the Eait by the Ocean, to the North by Mary-land, to<br />\nthe Weft by-the South=Seas, and to the South by Caroling; |<br />\nThe Air of Virginis is accounted of a temperature very<br />\nwholfome and agreeable to Englith conftitutions; (efpeeially |<br />\nfince by the cutting down of the woods, and the regulation |<br />\nof diet, the {eafonings have been abated) only within the pre- |<br />\nfent limits of Virginia it is fomewhat Hottet in Summer than |<br />\nin that part called Mary-Lénd 3 and the feafoning was for- |<br />\nmerly more violent and dangerous hete .to the Englith at |<br />\ntheir firft landing; R S j<br />\nThe Soil which s gerefally plaii; but {ométitnes ditreifi- ‘2<br /><br />\ndale; is capable i(Geing very fers<br /><br />\nfiedwith variety of hill an<br /><br /><br /><br />\nrentine, though afterwards .more di- .<br /><br />\n1<br /><br />\nl e et ettt<br /><br /><br /><br />\n/<br /><br />\nparts: befides which, there are of the proper growth of this}<br />\n‘and which is here peculiarly tobe de= | ,Countrgiy, a fort of Plantcalled Silk-grafs, of “which is made<br />\n.a very fine Stuff of a filky glofs, and cordage more ftrongand -<br />\nlalting than any of hemp or flax. For fruits, the Metraque- |-<br />\n[unanks, fomething refembling the Indian Figs the Chechin-<br /><br />\n‘I-quaming; which come neareft ‘to the Chefnut; the Puicha-<br /><br />\nmines, a fruit fomewhat like a Damfin; Meffamine r, a fort of.<br /><br />\nGrape in thew 5 Rawcomens, the refemblance of a Goofe-<br /><br />\n{ bereys Morococks , not much unlike a Strawberry 5 Maco-:<br />\n- fqrer,a Kind of Apples -Ocoughtanamnis, a berry much like|<br /><br />\nCapers.. For roots, Mufguafpen,with the juice whereof, being<br /><br />\na rich fort of paint, ‘they colour their Matts and Targets |<br /><br />\nWichfacan,yiclding a molt excellent healing juice for wounds;<br />\nPocones, an emulgent of much efficacy for fwellings and aches;<br />\nTockawangh, frequently eatens theresis alfo a Plane called<br />\nMattonna, of which they make bread s and Affament, 3\" fore<br /><br />\nof Pulfe, eftecmed a great delicacy among the natives,<br /><br />\nl The Beafts peculiar to this Countrey are the Opafluin, 2|<br /><br />\ncertain beaft which carricth and fuckletl her youngin a bag<br />\nwhich fhe hath under her bellysthe Affzpanic or flying Squir-<br />\ntels the Muflafcis, a musk-fented beatt, having the fhape of 2<br />\nWater-rats the Aroughena, a fort of Badger; the Utchunguois,<br />\nfomewhat like'a wild Cats alfo a (it of bealt called Rofcones.<br />\nOf Fith, the moft peculiar is the Stingraife, which is alfo<br />\ncommon to this Countrey with New England. _<br />\n. So many feveral Towns as were anciently among the na-<br />\ncxcept that of the Sefguabanocky, all fomething differing in<br />\ndifpofition,-cuftoms,. and religious ceremonies, and i oft of |<br />\nof a tawny complexion, with black, flaggy, and long hair:<br />\ncrafty,and treacherous,{ufficiently laborious in the art of War,<br />\nwhich-they ufed frequently to exercife among each other ; |<br />\nand wonderfal lovers of huntings in other things moft {can- |<br />\ndaloufly lazy and indulgent to their eafe 5 mean in théir ap- |<br />\nparel, homely in their diet, and fluttith in their houfes. !<br />\nAll Ships that come to Virginia and Mary-Land enter<br />\n‘through the Bay of Chefupeacs at whofe opening to the]<br />\nSouth, Virginia begins between thofe famous Capes, Cape<br />\nHenry and Cape Charles. Into this Bay which runs up 75<br />\nleagues Northward into the Countrey, and is in fome places<br /><br /><br /><br /><br /><br /><br />\nwhereof are Fames River, formerly called Powhatan, the de-<br />\nnomination of a very Potent King of this Countrey, at the<br />\ntime of the Englith firly adventuring thither : this River is<br />\nfound navigable 50 leagues, or thereabout. 2, York River, |<br />\notherwife Pamaunke in the language of the natives; which |<br />\nlies abour 14 miles Northward from the other, and is naviga- |<br />\n‘ble 26 leagues. 3, Rapabanock,, or Topahanock , the laft River|<br />\nof Virginia Northward, and navigable 40 leagues. 4, Pa- |<br />\ntowmec River, mentioned in the defcription of Mary-Eand, |<br />\nto which part of the Countrey this River alfo belongs. - Be- |<br />\nfides thefe greater Rivers, there are fome others of lefs note<br />\nwhich fall into them, as into Powbatan, or James River,}<br />\nSouthward Apamerucks Eaftward Quiyonycobanuc, Nanfa-|<br />\nmund and Chefopeacs Northward Chickamabania, into Po- |<br />\nmaunkee Payankarank, |<br /><br />\nThe Englith Plantation here is divided into 22 Counties ;<br />\n| on the Eaftern (hore Northampton County in Acomac 5 on.the |<br />\n| Weftern thore Carotuce, fames, Henrico, Charles, Tork , Glo-<br />\n| cefter, Surry, Hartford, Warwick , Lancafter, New Kent, 8 urrey,<br />\n| Middlefex s Nanfemund , Lower Norfolk, orthumberland,<br />\n| Wetmorland | Northampron , Warwick , e of Wight, and |<br />\n{ Rappabanoc s in each of which are monthly held' thofe in-<br />\nj ferior County Courts; where matters not of higheft concern- |<br />\n| ment, or relating to life, are tried 5 and from whence appeals |<br />\n| ar¢ made to the Quarter Court at Fames-Town, where all}<br />\n| criminal and civil Caufesate determined, and where the Go-<br />\n{ vernor and Counfel fit as Judges. »<br /><br />\nThe Metropolis, or chief Seat of the Englifh here is Fames-|<br />\nTown, or rather James-City fo denominated in honour of |<br />\nKing Fénes, where the Quarter Courts, General Aflemblies|<br /><br />\nand Sccretaries Office are kept. This Town adorned with |<br />\n; ‘many fair Brick-houfes, and other handfome Edifices, is fitu- |<br />\nI ated in a Peninfula on the North-fide of Fames River.: The<br />\nother Towns and Places of chief note are Elizabeth City,<br /><br />\nfeated nearer the mouth of the River on the faime fide S Medr<br /><br /><br /><br />\nwhich, at a place nam’d Green-(pring, Sir William Berkley the<br /><br />\nprefent Governor, hath a very pleafant Manlion-houfe built|<br />\nof bricks Feuricopolis, or Henry’s Town, fo denominated<br />\nfrom Prince Hexry, living when it was fitft buile, feated ina<br />\ncominodious place about 8o .iles from Fames City: Dale’s<br />\ngift; fo named from Sir Thomas Dale, Deputy Govetnor of<br />\nthe Place in the year 1610, at whofe charge it was built, dnd<br />\na Colony here planted 5 befides others of lefs note, fome|<br />\nwhercof ftill tetain the Indian names; as Wicocomocs, Ber-<br />\nmiide, s which doubtlefs are by this time increafed to a very<br />\nconfiderdble nuimber, in regard of the amplitude and gran-<br />\ndeuf to.which, by the continual accefs of people, this Planta-<br /><br />\ntiori'is of late arriveds :<br /><br /><br /><br /><br /><br />\nY. el o e<br /><br />\n| 43<br /><br /><br /><br />\ntives, fo many diftin¢ Nations there were, all Monarchical |<br /><br /><br /><br />\nall m'language 5 but all of them in gencral valiant, well-fet. |<br /><br />\nfeven leagues broad, there fall feveral noted Rivers, the chief]<br /><br />\ne msa e<br /><br /><br /><br /><br /><br />\nS<br /><br /><br /><br /><br /><br /><br />"}], "field_media_file": [{"target_id": 56400, "display": null, "description": null, "target_type": "file", "target_uuid": "f52c1cfe-8627-4d7e-b5b7-91293ab60fbf", "url": "http://digital.library.jhu.edu/system/files/2022-03/17481-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 17481, "target_type": "node", "target_uuid": "d01b805a-e204-409e-8bb3-78d62dd7c5ee", "url": "/node/17481"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "23c5b2aa-5eda-4178-84fd-4ec228b06371"}]}