{"mid": [{"value": 37411}], "uuid": [{"value": "9866f66e-e836-4847-82f3-843838d2097b"}], "vid": [{"value": 37411}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:31:53+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13340-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:31:53+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:31:53+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Z17,3sT27<br />\nVol. XXXIII No. 12<br />\n<br />\nEIGHT GAMES ON<br />\nLACROSSE CARD<br />\n<br />\nDANCE IN C. E HALL<br />\nTOMORROW EVENING<br />\nA dance will be held in C.<br />\nhall tuiiiuiuw at 9 P. M. A<br />\n- special effort will be made to<br />\nhave those attending the NavyMichigan game come to the<br />\ndance. There will be no tea<br />\n,dance as Hopkins' team plays<br />\naway. ,Admission will be one<br />\ndollar for both stags and couples. Osmar Steinwald's orchestra will render the music.<br />\nThe annual dance following.<br />\nthe Maryland gaol will be<br />\nheld at the new Pythian Hall<br />\non Charles and Preston Streets<br />\nfrom nine until'one.<br />\n<br />\nis<br />\n<br />\nBRIDGE PLAYERS HOLD FORTH<br />\nON SECOND FLOOR OF BARN<br />\n<br />\nYEARLINGS MUST WEAR<br />\nFRESHMEN BUTTONS<br />\nDonald Hiss, pre,dent of<br />\nthe Student _Council, wishes It<br />\nMade clear that freshman buttons must be worn by fres'11men as well as any pledge pin<br />\nthe freshmen may be wearing.<br />\nFreshmen are warned that if<br />\ncomplete regulations: green<br />\ntie, black socks and button, are<br />\nnot worn, the Student Council<br />\nwill take action. Also, if game<br />\ntags are not worn the Mondays and Tuesdays after the<br />\ngames, freShmen are liable to<br />\nbe requested tot come before<br />\nthe Council to—give reasons for<br />\nnot being at the game.<br />\n<br />\nCOLUMBIA TO BE MET<br />\nBY JAYS TOMORROW<br />\n<br />\nAnd after all, why should they be<br />\nThey're back! Carrying kings<br />\nWill Give Coaching Staff Chance _<br />\ngood<br />\nRutgers Substituted for<br />\nand queens in their train<br />\nto Discover Flaws<br />\nNavy Game<br />\nplayers have again invaded the Barn. time, they offend no one, they play<br />\nCAPT. STRADER TO PLAY<br />\nare<br />\nand<br />\nthey<br />\nsmall<br />\nstakes,<br />\nMARYLAND GAME AWAY<br />\nvery<br />\nfor<br />\nCanfamous<br />\nthat<br />\nthe<br />\nIt is rumored<br />\nJays Played New Yorkers to<br />\nOlympic All-Stars Meet Jays<br />\nfield is turning over in his grave as quiet. What more could one want?<br />\n6-6 Tie in 1927<br />\nin Opener<br />\n,<br />\nalone,<br />\nsay<br />\nwe.<br />\nthem<br />\nhe realizes that what he considered Let<br />\nThe Black and Blue journeys toLacrosse devotees who were una perfect gambling eita-filishment has<br />\nAs for the games that are most<br />\nmorrow to the Metropolitan area to<br />\nable to follow the famous '28 Hoppaled into insignificance beside the popular, bridge takes first place.<br />\nplay its last out-of-town game, with<br />\nkins lacrosse twelve to Amsterdam<br />\nsecond .floor' of the HoPkiriS stable. There are about five bridge games<br />\nthe Lions of Columbia University.<br />\nWill have another opportunity this<br />\nNot that the stakes arrhigh, but the to one of every other sort combined<br />\nThis marks the beginning of the<br />\n' April to see the world famous<br />\nquality of play is superb, and as which is at least encouraging in reJays' three hardest tests, since the<br />\n- American Olympic representatives<br />\nfor rivalry, the Spartans received spect to the intellect of the average<br />\nSt. John's game is to be played a<br />\nin action. They will meet the Hopnot half as much pleasure in sinking Hopkins man. Next to bridge comes<br />\nweek from Saturday, and the anBarn<br />\nkins lacrosse twelve on April 6 at<br />\none<br />\n''as<br />\nfleet<br />\ngame<br />\nis<br />\nAthenian<br />\nThis<br />\nthe<br />\nhearts, or \"shiboby.\"<br />\nnual Turkey Day fracas with MaryHomewood in the opening game of<br />\nadverfinessira,4is<br />\nhound does in<br />\nplayed-usually by those who cannot<br />\nland at the Stadium occurs ten days<br />\nthe 1929 lacrosse Season.<br />\nsary's king.<br />\nfind a fourth for bridge or because<br />\nafter.<br />\n•Olyinpic<br />\nof<br />\nthe<br />\nUnder the title<br />\nAnd bold?' The card players be- there are too' many for the ancient<br />\nUpset Last Year<br />\nLiebens\"Lefty\"<br />\nAll-Stars, Captain<br />\nLast year the game with the New<br />\nlieve that they own the place. Just and honorable game of whist. Pitch<br />\n'<br />\n'<br />\n, Bid- ,<br />\nperger, \"Bill\" Logan, \"Tom;<br />\nYorkers proved a decided tipset.<br />\na few, days ago one called up to the ranks third in the affections of the<br />\ndisOn, and a galaxy of Other famous<br />\nsince it ended in- a tie, and Hopkins<br />\nNEWS-LETTER office to ask the staff players. Pitch may be better known<br />\nstars of the crease wilt meet The<br />\noutplayed their Opponents from start<br />\nto keep. more quiet so they could to our readers as set-back, seven up,<br />\nraw tfopkins tWelve. \"tirring and<br />\n• Kelly and Schiebel to Lead<br />\nto finish. This year the outlook,<br />\nhave their game in peace!, The un- go back, or any of a half dozen<br />\nHopkins Men<br />\nmitigated. gall, of them is extraor- other names. As for c - - -, well Football Game and Rush After however, is none too good, since the<br />\n„ interesting battle is promised.<br />\nThanksgiving<br />\nCOACH EXPECTS WIN<br />\nt'Penn Comes Second<br />\ndinary.<br />\ninexperienced Blue Jays are w•eaker<br />\nthey don't play that in the Barn anyFollowing_ the opener with the Course at Union College Is Six<br />\nthan last year, while Columbia has<br />\nLast -year a movement was<br />\nway;<br />\nRUSH TO BE DIFFERENT<br />\nMiles Long<br />\n. All-Stars, the University of Pennbolstered its outfit considerably, The<br />\ntoted to stop card-playing at the<br />\nUnder<br />\nRushes<br />\nTypes<br />\nof<br />\nVarious<br />\nsureign<br />\nfinesse<br />\nWell:<br />\nmay<br />\n-the<br />\nsylvania twelve will meet the, Black<br />\nUnder the leadership of Captain Barn, hut after a brief interdict by<br />\nLions have played a difficult schedComideration<br />\nand Blue stickmen, also at home- Robert Kelly, the Cross •Country the Dean, the gamesters returned in preme and the elusive queen of<br />\nule, losing only to Dartmouth, and<br />\nwood. Last year Hopkins made the Team will engage in the second meet full force. So far, this year nothing spades flit back and forth in the<br />\nThe frosh-soph lacrosse game beating Wesleyan and Williams by<br />\nlargest lacrosse score .::!gainst the of the season. The team will meet has been done to stop them.. ' - Barn for the.rest of the year.<br />\nwill be played either Thursday or decisive scores, while last week they<br />\nRed and Blue twelve ever ...Scored, Union College at Schenectady. toFriday of next week. The track held Cornell to a scoreless tie. Their<br />\nBut Penn has a numbes..of veterans morrow in this contest. Having demeet will take place the week after biggest offensive threat, Hank<br />\nHullabaloo<br />\nTake<br />\nTo<br />\nPledges Must Be<br />\nback this year and Hopkins can feated Lehigh here last week, the Cage<br />\nPictures Next Week and the football game will be played Kumpf, was injured so badly in the<br />\nIn By Tonight<br />\nboast of Mily three.<br />\nteam has good prospects of captoron the dfternoon of the Saturday Dartmouth game, that he will be out<br />\nPictures for the 192§ Hallabaloo following Thanksgiving.- During the<br />\nOn April 20, the Hopkins stick- Mg tomorrow's run. \"I' think we<br />\nfor the remainder of the season, but<br />\nof<br />\nthe<br />\nFrisch.<br />\nChairman<br />\nPaul<br />\nMonfrom<br />\nwill be taken next week<br />\nMen will journey to West-Point to have a good Chance,\" said Kelly.<br />\nhalves of the football game-the class they have been very fortunate in unthat<br />\nrequests<br />\nCommittee,<br />\nFund<br />\nCage<br />\nGeorge<br />\nday to Thursday. Mr,<br />\nmeet.the strong .\\rmv twelve. Army Though Union's team is unusually<br />\nrush will beheld.<br />\ncovering in Phil Lifiander, sophoall students who have not as yet Ebeneck frorn White Studio, New<br />\nt beat Hopkins 5-3 during the sched- powerful it is 11,4 its strong as it<br />\nEddie Lockard, president of the more quarterback, a fast, shifty runto<br />\npledges<br />\nFund<br />\ntheir<br />\nCage<br />\nsigned<br />\nYork, will take individual pictures<br />\nuled season last year, lan -the Cadets was last Year -while the Hopkins<br />\ndo so before 4 :P. M. today. Mr. of the seniors from 9 to 12:20 Slphomore Class, and Ned Duke- ner whose specialty seems to be in<br />\n:bowed to the Blue Jay twelve at team is compokd of many veterans<br />\nMyers will have the blanks -at the o'clock each day while the group hart,, president of, the Freshman getting away for long runs through<br />\nWashington in the Olvtttpic playoff from last yeas's strong team.<br />\nPostoffice and students should sign pictures will be takert-between 12 30-I Oass, decided upota. the dates for a broken field. He, together with<br />\nconbrilliantly<br />\nmost<br />\nin•-one_of the.<br />\nThe team will leave Baltiniote on<br />\nmeeting. held<br />\nJoe Stanczwyk, veteran fullback and<br />\npledges there and: turn them- in nu-, and 1 o'Clock and at night.<br />\n- the games at a<br />\ntested lacrosse games played during Friday morning reaching Schenec-‘<br />\nline plunger extraordinary, make a<br />\nTuesday afternoon.<br />\nmediately._<br />\nMr.<br />\nsee<br />\nto<br />\nurged<br />\nSeniors<br />\nare<br />\nstrained<br />\nthe seas a. Because of the<br />\ntady in the CVOling. They will probIt is imperative to have $10,000 in Elieneck in the C. E. Hall for sitSo far it is not known what kind hard pair to stop on any man's gridrelations with Navy, the ;\\ rim. game' ably spend Saturday night also in<br />\nbefore the<br />\npat<br />\npledges<br />\nto<br />\nstudent<br />\nof<br />\nrush will be held this year. Last iron. Columbia's head coach, Charles<br />\nthe<br />\n.<br />\ntintinents<br />\ntings or app'<br />\nlooms as one of the tw o big games Schenectady, leaving- early Sunday<br />\nNew York Alumni toinorrow night. first part if the week as this is the year there was a \"paint rush,\" in- Crowley, was assistant to the late<br />\nof the coming. season.<br />\nfor home.<br />\n,<br />\nOnly a tittle over $6,000 has been only • opportunity they will have if which the sophomore's tried fo paint Percy Houghton,.famed for his<br />\nRandolph-Macon<br />\nUnion College Good<br />\npledged to date. The committee is they- want their pictures. before the a pole red, while the freshmen tried Harvard teams of some years back.<br />\nna<br />\nist<br />\n1<br />\nthe<br />\none<br />\nact<br />\nin,<br />\nRand,Oph- NI<br />\nCross country running is given<br />\nAt the time when Columbia ,decided<br />\npowerful of the southern teams, much prominence at Union College making great plans for the banquet Cliristmas.tholidaVs.<br />\nBy being pho- to paint it green. This rush was of to<br />\nresume football about five years<br />\nwill meet the Jays in I Iiiniewood whose teams have been unusually._in New York Saturday night anti ,togi:afttec.<br />\nthis time the Hullabu- interest, not only to thOse participatago, Houghton was prevailed to acon April 27. 5111 May 5 Rutgers successful. In the past few ,years the whole movement will lie greatly /aV/IS-fziff'W 1 i'Vmaterially aided in ing, but- to the bystanders. l'aint,<br />\ncept the helm, which position he ocwill, journey to I Ii tritestthe they have won thirty-seven consectt- jeopardized if the students do not 'their attempt<br />\n'The book pub- rotten eggs, tear bombs,. and a gencupied until his death, after which<br />\nfirst time since Rutgers has taken tive meets, and only recently -did do their part. •<br />\nt of :June. • eral roughness featured.<br />\nshed...laifisre<br />\nCrowley succeeded him. HandiThe Band is- being sent by the<br />\nup - the stick game. The Scarlet they suffer their first .defeat at the<br />\nGroup pictures will be taken durFor some years before this there<br />\ntwelve was one of the big )1yinpic hands of New York University. The Athletic Assticiation for the Colum- ing lunch-time, after four o'clock was a greased pole for the two capped by rather poor material, he<br />\nhas nevertheless turned out some<br />\nthreats last seasiin anti the coming meet this year will be the first in bia game and will play tonight-at the and at night. Sehedules will be classes to try to climb. This rush<br />\ngood teams, and has had such stars<br />\ngame with the Jays pn,mises in a five or six years between the har- fotel Commodore.<br />\nposted. at the Barn and the Post- featured everything 'that the paint<br />\nas Pease, Koppisch, and others.<br />\nlarge measure to offer all the fight riers of l'ition College zuld Hopoffice. Members of the various or- rush did except the paint.<br />\nFull Strength<br />\nof the -missing Navy game.<br />\nganizations are -requested to be.puncTo Break Ground For<br />\nkins.<br />\nHopkins will present its full<br />\nFootball Rush<br />\nFerris Th(inison, former Friends<br />\nfacilitate<br />\npictures<br />\nto<br />\ntheir<br />\nfor<br />\ntual<br />\nLonger Course<br />\nbecame<br />\nthe<br />\ngreased<br />\npole<br />\nBefore<br />\nstrength<br />\nfor<br />\nSoon<br />\nthe first time since the<br />\nLevering. Hall<br />\nThe; course. at I'Ilion College .is<br />\nSchiiol star, and his fighting Garnet<br />\n.lioth the photographer and the Hul- the \"knit of contention\" between opening game with Richmond, and<br />\nIlomewooditt<br />\nfour<br />\nAccording. to E. A. Schaal ground labaloo Staff in keeping to their<br />\nconsiderably longer than the<br />\nstickmen will invade<br />\nthe classes there used to be --a foot- with such stars as Lyons, Caplan<br />\nkiv 12. The more devout, of the and a half mile course here. It is f,n- the new Levering- Hall will be schedule.<br />\nball rich inAvhich three footballs and Strader in the-fray, they should<br />\nfall,: will reltlenil WI- (Oft ViV- six iidles and is reputed to he glint. hr ,ken the latter part 01 this Wiisik cmo<br />\nPage 3 (\"its, sill! 4<br />\nis Pla'<br />\n'<br />\n‘<br />\nt the ftehl, and the two put tip- a stiff fight, although on the<br />\n,.etPrn<br />\nJr titeshitit- diffiettft7 lila Uantain Kelly dile,: lint or the early part of next. Ni r..Nelidly and With<br />\nelass'es trail ti take two or.all three face of it, Columbia looks good<br />\ntiittd thirty ing contest of two think it will prove as difficult as the son. the treasurer of the university.<br />\nballsis far into the other class's enough to' win.<br />\nIli-hied the hottie ctituse which will, ti1 ii itirse, his izeaten definite wonl from the Scabbard and Blade<br />\nyears ag,, when I It Ilk<br />\nerrittaa as possible before the whisThe game which starts at 2.30<br />\nM. A. Long Contracting :Co. *hat<br />\nMonday<br />\nInitiate<br />\nreputation it I. an All-Arneriran goal he atr advantage 1,ir the<br />\nTo<br />\n.<br />\ntle sounded the end of the rush.<br />\nP. M. will be played at Baker Field,<br />\nin<br />\nstart<br />\nwork<br />\nprepared<br />\nto<br />\nthey<br />\nare<br />\nhonorary<br />\nteam,.<br />\nBlade,<br />\nand<br />\nScabbard<br />\nkeeper.<br />\nIn other colleges the class rush and it is expected andhoped that<br />\ncourse is largely ovet the taiXt few days. It has definitely military society, will, hold-its formal<br />\nJohnnies Come to Town<br />\nThe<br />\nFights after th, tile is welt .as hard surfaces while the Ilonae course been decided that there will be no initiation on Monday, November 12. takes the form of. a tug-of-war, many Hopkins rooters Will attend.<br />\nCoaches Busy<br />\neither on dry land or: through a<br />\nduring it. are iironiiscrl the more is over fields. In order to accustom cerenit my in conoection with, the<br />\nThe new men to be inducted into<br />\nCoach Van Orman and his assistball<br />\nstream.<br />\nSome<br />\ncolleges<br />\nhave<br />\na<br />\nblood-thirsty itt May Pl. 1)esiiite the team to the course over: which I reaking of ground.<br />\nants, George Darley and Dave Kauf• the society are Captain Melvin Em•<br />\nthe good sportsmanship of the John- it will run tomorrow. Kelly has been<br />\ntanagers if the bury, unit adjutant, Lieutenant Wil- pushing rush, in which the two man, will have'ample opportunity<br />\nTIIC lii aid<br />\nclasses<br />\ntry<br />\nto<br />\npush<br />\na<br />\nbig<br />\nball,<br />\nsome<br />\nMesa no Hopkins-St. John's game giving his men daily work-,,ots<br />\nare meeting at the t-11'er H. Driver ; Lieutenant Robert<br />\nY. M.<br />\nto observe - the weak points in the<br />\nof any sorCis complete without a the hard roitcls of Wyman Park,<br />\nlopkins Club this week. and -addi- Bortner. Lieutenant ,James Moore, en or twelve feet in diameter, across Hopkins attack and defense when<br />\ncolleges<br />\ntry to the Blue Jay club<br />\nfree-for-all after it.<br />\ntional plans for the future work Lieutenant George Hill and Captain a goal line. Other<br />\nHambledon Expects Win<br />\nbumps up against<br />\nThe Min-yland game will be playAfter its showing in the Lehigh 'connected with the new building will Hent'y Gibbs., At the public initia- shove sand bags up and down's field. Columbia University's eleven. When<br />\nAred at College- Park this year.<br />\nmatch last Saturday. Coach Ham- be discussed. This Board of Mana- tion, which will take place immedi- • It is the consensus of opinion, ac- one 'considers the dearth of materangements were made with \"Curly\" bledon looks for a Victory in tomor- gers consists of several well known ately after drill- on Monday after- cording to Lockard, that the rush rial which faced the Jay coaches at<br />\nByrd; Maryland footliall and la- row's contest at Schenectady. Schie-- professors at the university and<br />\nnoon, Major' Carl McKinney, new should be changed from last year's the beginning of the season the<br />\ncrosse mentor, last year to have the bel, who came in first in -the Lehigh number of outstanding members of Professor of Military Science and type.. The Student Council has not progress which has been made by<br />\nJayLltWelve come to College Park meet, is expected to make a good the student bogy.<br />\nTactics, will be admitted as honor- yet decided to what kind of rush a comparatively green team is inthis year for the opening of The new showing against Union, though an<br />\ndeed remarkable. On paper the<br />\nary member of Company I,'Second it will be changed.<br />\nathletic field there. Although Hop- injured ankle has prevented him<br />\nJay team does not show up so well<br />\nRegiment, at Johns Hopkins UniMay Annul Regulations<br />\nHopkins Band To Play<br />\nkins-won both games last- year. the from using his full power.<br />\nIn the freshman \"bible require- but on the field it has impressed<br />\nversity. Bars will be presented to<br />\nfinal Olympic play-off with MaryAt Century Monday the newly accepted members at the ment\" it states: \"Freshman regula- everyone with its latent powers.<br />\nEight -men will make the trip inwas<br />\nJuly<br />\nlast<br />\nland at the Stadium<br />\ncluding Captain Kelly, Schiebel, The Johns Hopkins Blue Jay first battalkin review, which will tions will be annulled by victories<br />\nLine-up:<br />\nthe finest exhibition of lacrosse skill Emerson, Onerats, Miller, Waters.<br />\nHopkins<br />\nColumbia<br />\nOrchestra will give two concerts tin take place some time in 'early De-* over the sophomores in any two of<br />\ngiven during the 1928 season.<br />\nRosser, and Loiseaux.<br />\nthe following: football, basketball, Houston<br />\nL.E<br />\nCostigan<br />\ncember.<br />\nTheaCentury<br />\nnight<br />\nat<br />\nthe<br />\nMonday<br />\nJays Strong<br />\nThe 1929 schedule during the<br />\nLT<br />\nTys<br />\nA banquet will follow 'the initia- track, or class rush. Otherwise, the Love<br />\nThe showing which the Jay har- tre, under the auspices of the Cen1928 season is as follows:<br />\nL.G<br />\n(C.) Adler<br />\nperfor- tion. The repast will be served at above regulations: will be in effect Tobin<br />\nOpponent - riers made against Lehigh last week tury management. These<br />\nDate<br />\nNome<br />\nCampbell<br />\ngiven at seven Miller Brothers, where the guests until the beginning of the Christmas Strader<br />\nOlympic A.-S. indicates that Johns Hopkins will mances will be<br />\nApril 6—Home<br />\nR.G<br />\nMakser<br />\no'clock and at nine o'clock. Monday will attend in full regalia. It is ex/ vacation.\" The basketball game is Kegan<br />\nU. of Penn. again have a good cross country<br />\nApril 13—Home<br />\nBleeker<br />\npected that the dinner will be at- wrong. Last year lacrosse was sub- Bialoskorsky ....R.T<br />\nArmy team. The graduation of Captain night will be \"Hopkins Night\" at the<br />\nApril 207-Away<br />\nR.E<br />\nDavenport<br />\nbe in fitting tended by a number of Professors stituted for baseball since baseball Zimmerman<br />\nRan.-Macon ,Gwinn and the injury to Schiebel Century, which will<br />\nApril 27-Nome<br />\nLiflander<br />\nQ<br />\npicture, Varsity, of military science and tactics. was being played no longer as a col- Lyons<br />\n- Rutgers has hurt the Jay teat*: but the pol- with the collegiate<br />\nMay 5—Home<br />\nF.B<br />\nHamilton<br />\nshown there next week. Var- Charles Wyatt, commander of the lege sport and the lacrosse game Caplan<br />\nbeing<br />\nfresh-developing<br />\nin<br />\nteam<br />\nthe<br />\nof<br />\nicy<br />\nSwarthmore<br />\nMay 12—Home<br />\nL.H<br />\nH Scott<br />\nRogers, was unit and president of Scabbard and will be played again this year in- Mills<br />\nSt. John's man and sophomore runners has sity, featuring Buddy<br />\nMay 19—Home<br />\nR.H<br />\nBesore<br />\nBuser<br />\nstead of basketball or baseball.<br />\nBlade, will officiate at the affair.<br />\ncampus,<br />\nPrinceton<br />\nthe<br />\nfilmed<br />\non<br />\nyear.<br />\nthis<br />\nfruit<br />\nborne<br />\nMaryland<br />\n•May 25—Away<br />\n<br />\nJAY HARRIERS MEET<br />\n, UNION TOMORROW<br />\n<br />\nnd<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHOMEWOOD,.BALTIMORE, MD., NOVEMBER 9, 1928<br />\n<br />\nCLASS LACROSSE GAME<br />\nTO BE HELD THURSDAY<br />\n<br />\n\f9, 1928<br />\nTHE JOHNS HIOPICkiS NEWS-LETTER, NOVEMBER<br />\n<br />\nMS:LITTER<br />\nFouNmen 1897<br />\n$2.00<br />\n<br />\nElsoseription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Poatoffice in<br />\nBaltimore, Md., under Act of Congress November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\n<br />\nUntverstty.Business communications should be addressed to the BUSINESS MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING<br />\nEDITOR; other communications to the EDITOR-IN-CHIEF.<br />\nUniversity 0100<br />\n<br />\nTelephone<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\nGEORGE E. BANRs, JR., '29<br />\nManaging Editor<br />\n<br />\nPHILIP W. Mats, '2<br />\n<br />\nAssistant Managing Editor<br />\nGEORGE GUM?,'30<br />\nAssociate Editors •<br />\n<br />\nWILMER H. DRIVER, '29<br />\nROBERT S. BAIRD, '30<br />\n<br />\nRICHARD H. WOOD,'29<br />\n<br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager<br />\n, HARRY 0. SCHLOSS, JR., '29<br />\nAdvertising Manager<br />\nGEORGE M. GLAZIER, '29<br />\n<br />\nCirculation Massager<br />\nT. ROBERT MYERS, '29-<br />\n<br />\nPrinted by The Read-Tayler,Company, Lombard and South Streets,<br />\nBaltimore, Md.<br />\n<br />\nEDITORIAL COMMENT<br />\nNOBLE IN PURPOSE<br />\n<br />\nFROM GILMAN TOWR<br />\nBy SumNER L. SlocicroN -----,<br />\nThe street which runs by the campus—familiarly known as Charles<br />\nStreet—holds more interest for me<br />\nthan any other in the city. I think<br />\nit ,might easily and- deservedly be<br />\ncalled the. most important of all.<br />\nSurely no other runs so nonchalantly past poverty and riches, and from<br />\nwaterfront to open country.. Along<br />\nits path of approximately ,fifteen<br />\nmiles lie representatives and vestiges<br />\nof almost every type of life—along<br />\nits patjt from the harbor to the<br />\nJoppa Road. Strangely enough it is<br />\ncut MT abruptly at both ends—a.few<br />\nfeet too far at the southern extremity means a plunge into the head<br />\nwaters of the harbor; a few feet too<br />\nfar at the 'opposite end means a<br />\nplunge down a very steep hillside. A<br />\nday's walk along its entire length<br />\nwould be, to my mind, more of an<br />\nintroduction to--would give a deeper insight into—the great drama of<br />\nlife than any other possible one-day<br />\nactivity. And I should suggest, also,<br />\nthat the southern extremity makes<br />\nthe best starting point, for it leaves<br />\nyou later in the solitudes of nature,<br />\nwhere the previous sights may best<br />\nbe thought oyer.<br />\nThus the typical waterfront scenes<br />\nare encountered first; then the numerous pseudo-suburban homes of<br />\nthe laborers, surrounded by railroad<br />\nyards and factorieS; next through a<br />\nsecond-rate (as some people call it)<br />\nshopping district; past warehouses<br />\nand a few offices; past a market<br />\nwith its varied produce; still farther<br />\non comes Baltimore Street, where<br />\nThe business district centers. From<br />\nhere on Charles Street begins to<br />\nsavor of wealth, with its stores, exclusive shop*, and tearooms—it -is<br />\napproaching sophistication. It runs<br />\npast old and charming city 'residences, hotels, libraries and music<br />\nhalls, town clubs, -and then again<br />\nruns through a series of shops and<br />\noffices. Still farther on are city residences, educational institutions, and<br />\napartment houses. Then Charles<br />\nStreet becomes lined with fine suburban homes, beautiful gardens, and<br />\nfinally ends up amidst country estates.<br />\nThere are men on this street from<br />\nall types. Beggars, millionaires,<br />\nfools, sages—and the common people. As I think of Charles Street<br />\nwith its all--inclusive view of life, I<br />\nwish that‘it could talk. I know that<br />\nall these:different men are seeking<br />\nhappiness in their 1;rarious environments,/ but I cannot tell which—unless it is the fool—comes closest to<br />\nfinding,it.<br />\n<br />\nThe Only Place to<br />\nDINE and DANCE<br />\n<br />\neAT<br />\n<br />\nG•<br />\n0<br />\nL P<br />\nD H<br />\nE<br />\nN A<br />\nA<br />\n<br />\nMusic Excellent'<br />\nFood Delicious<br />\nPrice Reasonable<br />\n<br />\nA sturdy new shoe for young men with a<br />\ngenerous measure of style . . . and priced to<br />\nfit a Scotchman's purse.<br />\n<br />\nAN<br />\n<br />\n19 Lexington<br />\n<br />\n111 E. Baltimore<br />\n<br />\nOpen 11 A. M. to 1.30 A. M.<br />\naseraf;safraseagarglmeonlinPlararalill<br />\n'<br />\n<br />\n110 N. LIBERTY ST.<br />\n(thru to Park Avenue)<br />\n<br />\nMan<br />\nifyou isfantio rea//<br />\n- —<br />\n<br />\nNEW OXFORD GRAYS<br />\n<br />\nBETHOUN<br />\n<br />\nSuits Topcoats Overcoats<br />\n<br />\now THAT a month of the collegiate year 1;as slipped by, it is not<br />\n$28.75 - $38.75<br />\nan inappropriate time to look about the campus and seriously<br />\nconsider this much-discussed question of freshman regulations. At<br />\nthe beginning of the semester, the incoming students were instructed<br />\nWe just received a new<br />\nto wear black socks, green neckties and enamel buttons. They were<br />\nassortment of Oxford Grays<br />\nclasses;<br />\nii<br />\ngoing<br />\nto<br />\nand<br />\nfrom<br />\ntold to use the Gilman Hall tunnel<br />\nin shadow striped, slightly<br />\n, they were ordered to learn the Univ,e4iiiy.29rcgs and yells; they were<br />\nadmonished to speak to upper classidenAraculty members, whom visible overplaids and<br />\nare were numerous other<br />\nthey might encounter on the campuk'<br />\nherringbone<br />\neffects.<br />\nrequirements and rules, all 'set forth quitn:,Ably and lucidly by the<br />\neditor of the Y. M. C.,-.2V-Handbook. The language used was simple;<br />\nDo not fail to see them<br />\nthe ideas were clearly expressed. There was no chance for misunderstanding.<br />\ncaution Money voucher. accepted<br />\nGazing casually about the campus, what do we see? Some freshmen wear green ties, black socks and buttons—others don't. Some<br />\nuse the Gilman tunnel—quite a few don't. Some know the songs<br />\nand yells—many of the others don't. Some speak to fellow students<br />\nWILLARD<br />\nand faculty members—most of them don't. Some obey the regulations<br />\nbut most of the others go their .way rejoicing. There is no. one apTAILORING CORP.<br />\nparently delegated authority to enforce the rules, so \\thy bother?<br />\nFAYETTE ST. AT HANOVER<br />\nIn past years, the transgressing freshman was kept in the path<br />\nFIRST PLOOR.<br />\nof righteousness by the firm hand of the sophomores. If he failed to<br />\nappear at the football game on a preceding Saturday and ventured<br />\non the campus the next Monday, without a t4g, there was a flurry of<br />\nClgarettes<br />\nClub Lounge<br />\npaddles awaiting his arrival. If he failed to speak. to an upper class'<br />\nFree Phone<br />\nwork<br />\nman, there were more paddles. If he failed to get into activities<br />\nand earn his button there were still. more paddles. This constant<br />\nthreat -qf corporal punishment at the hands of diligent and conscien-'<br />\ntious soPfiqmore \"pep committees\" did much to keep the freshman a<br />\nlaw abiding student.<br />\nBut this continual harassing by the sophs had a much more important and far reaching effect. Among the persecuted freshmen,<br />\nthere slowly developed a fraternal feeling' as they suffered together.<br />\nThey fought together in -the frenzied !Attics around the Barn at lunch<br />\nhour; they plotted together for the overthrow of the soph dynasty;<br />\nthey played hard on the lacrosse, football and baseball WI to win<br />\ntheir freedom and, in the spectacular class rushestohey made a last<br />\ndesperate effort to shake off ,the fetters of neckties trtfogiAkS. In this<br />\nsharing together of the trials and hardships of tittAr'froati existence,<br />\nI have looked, during the . past<br />\nMinneapolis, Minn.<br />\n.there grew up among the members a sense of horhogel&y. Their<br />\nfew rains, for some signs of the old Larus & I3ro. Co. April 30, 1928<br />\nclass became a closely knit and compact organization.<br />\nslicker, but -I have looked in , vain. Richmond, Va.<br />\nLast year, however, there dawned a great era of -idealism. HopSomething new has come-to take its Dear Sirs:.<br />\nkins, we were told; would become-the great collegiate Utopia. There<br />\nTwo years ago last Winter I went<br />\nwould be freshman regulations, to be sure, gut there would be no<br />\nplace—something handsomer, no into the Red Lake gold fields in<br />\nCanada. It Was a tough trail from<br />\nenforcement of these rules by the sophomores. - Instead of soph paddoubt, but something without the Hudson,<br />\nover 140 miles of snow and<br />\nwhole<br />\nThe<br />\nfrosh<br />\nconsciences.<br />\npower<br />\nwould<br />\nbe<br />\nenforcing<br />\ndles, the<br />\ncharm of traditibn. The old slitker ice. There were fourteen of us on the<br />\nscheme was indirectly motivated by the Honor System. A freshman<br />\ntrail going in, and frequently at night<br />\npopulartremendous<br />\na<br />\nenjoyed<br />\nsuch<br />\nwould not wear lavender socks because, if he did, he would violate<br />\nwhen seated around a big camp fire,<br />\nity, and was accepted as— such a some one would ask me for a pipeful<br />\nthe spirit of the Honor System. He would not wear a blue and orange<br />\nof<br />\nF,kigeworth. These Canadian boys<br />\nvery<br />\nthe<br />\ncode.<br />\nA<br />\ninfraction<br />\nof<br />\nnecktie because that too would be an<br />\nbosom friend, thatt it no doubt fOls state<br />\nlike our Edgeworth.<br />\n-pretty notion, but did it work?<br />\ndeeply the fickleness of human -1*<br />\nIn four weel,s' time I ran out of<br />\nEdgewbrth.<br />\nI was glad to get 'most<br />\nAt the time of its introduction, the whole scheme seemed ,to upings. Suddenly, without warning, it<br />\nany ohl tobacco.<br />\nper classmen to be rather vague and hazy. Here -was an attempt to<br />\nwas thrust aside—c, make room for<br />\nOne dar,- however, I dropped in to<br />\nenforce a system of freshman regulations by employing the same code<br />\na new and untried acquaintance. But Dad Brown's'tent, a 72-year-old proswhich is applied to so moral and vital a question as honesty on an<br />\npeetor, and seeing a can of Edgeworth<br />\nfeelings—<br />\nsympathetic<br />\nbeyond<br />\nmy<br />\non an improvised table, back there 150<br />\nexamination. A preposterous notion, to say the least. How could<br />\nbeyond my admiration for tradition- miles from the \"steel,\" I perked up at<br />\nthe freshmen, inexperienced in Hopkins customs, be expected to re-once, saying, \"Dad, I'm plum out of<br />\nspect the sacredness of the Honor System when the'samecode was<br />\nregreater<br />\nhave<br />\nstill<br />\na<br />\nal things—I<br />\ntobacco—how's chances for a pipe..<br />\napplied both to examination work and the trifling matters of walking<br />\nfull\"<br />\n\"Help yourself,\" he said. So<br />\ngret for the passing of the slicker: I<br />\npulling my heavy duty pipe from my<br />\non the grass and wearing green neckties?<br />\ncannot afford to buy a new rain gar- pocket, I loaded it with Edgeworth,<br />\nThis year, we are informed by those who should know, freshpacking it in so tightly that I couldn't<br />\nment!<br />\nman regulations are no longer being administered under the Honor<br />\nget the least bit of a draw.<br />\nSystem. There have been reports of the formation of a \"secret vcomI excused myself for a moment, and<br />\noutside to remove about three<br />\nmittee\" for the purpose of searching out offenders. Their methods,<br />\nThere are very few people who stepped<br />\npipefuls<br />\nto put in my pouch. Dad<br />\nno doubt, are those of a squad of secret service detectives or prohisight—and stepped out, saying, \"You're worse<br />\nat<br />\nthe<br />\nnot<br />\nshudder<br />\ndo<br />\nbition agents. This whole scheme smacks of treachery and deceit.<br />\nthan any Scotchman I ever saw.\"<br />\neven the mention-of a snake. Some- Then I confessed. I told him what<br />\n'Idealistic as the present system of enforcing freshman regulations<br />\ntimes I think the Bible story has happened to my Edgeworth—that I<br />\n'may be, it must be classed as a dismal failure. The rules are being<br />\nwas just dying for a smoke, and he<br />\ncreated a traditional, although often understood<br />\nconstan0 broken, many times each day. Many of the frosh seem<br />\nright away. He .said,<br />\nto illtend only a vague idea of the Hopkins songs and yells. They are<br />\nunrecognized dread of the reptile. \"Boy, Edgeworth is mighty scarce.in<br />\nthese<br />\nbut I reckon I can spare<br />\ngiving the various campus activities very mediocre support. Even<br />\nOr perhaps our dread dates farther what'sparts,<br />\nleft of that can. Help yourself.\"<br />\ntheir own clasli meetings, we are informed by freshmen, are poorly<br />\nback, and supports the weird fasciYou can just bet your last nickel<br />\nattended. 'The Class-of 432 seems an extremely listless group, entirethat I guarded this Edgeworth with<br />\nnation<br />\nwhich<br />\nthe<br />\nreptile<br />\nsupposedly<br />\nly lacking in \"pep\" and college spirit. Its members have not as yet<br />\nextreme care until I got back to the<br />\nheld for Eve. But at any rate, 1 \"steel.\"<br />\ncaught the real spirit and significance of University life. They are<br />\nYours very truly,<br />\nstill tangled up in the swaddling clothes of high school'days and still<br />\nwish somebody would eliminate<br />\nC. M. Bahr<br />\nthink in terms of a crowd of preparatory school boys.<br />\nsnakes from the Botanical Gardens.<br />\nThe success of the freshman regulations depends on.ahile, strict<br />\nThe other day I was enjoying a<br />\nenforcement. Such enforcement is not being obtained under the preswalk in the autumn air, surrounded<br />\nent loose system, which the Student Council has seen fit to adopt.<br />\nby the beautiful autumn foliage, unWe stand squarely on this platform—adopt a definite, clear-cut<br />\nExtra High Grade<br />\ntil I came across one of the damn<br />\nmethod of enforcing freshman regulations or else abolish them altogether.<br />\nSmoking<br />\nthings.<br />\n<br />\nN<br />\n<br />\nBrown Zug-Grain<br />\n<br />\nTHE<br />\n<br />\nThe B. F. Bond Paper Company<br />\n33,55 SOUTH HANOVER STREET<br />\n<br />\nPRINTING PAPERS -- ANNOUNCEMENTS -- PAPER CUPS<br />\nPAPER CONTAINERS-- SOUTHERN SILK TOILET<br />\nThe House of Standard Lines<br />\nPlaza 8170<br />\n<br />\nRIDE THE STREET CARS<br />\nTHE MOST ECONOMICAL<br />\nMEANS OF TRANSPORTATION<br />\n<br />\nUNITED RAILWAYS & ELECTRIC CO.<br />\nOF BALTIMORE<br />\n<br />\nQUALITATIVE BASE TABLESQUALITATIVE ACID TABLES<br />\nCHEMICAL EQUATIONS<br />\n<br />\nTobacco<br />\n<br />\nAll for<br />\n<br />\n$1.50<br />\n<br />\nHall fi Twilley Analytic Chemistry<br />\n<br />\nHow Gold<br />\nProspector<br />\n\"Went Scotch\"<br />\n<br />\nEdgeworth<br />\n<br />\nWONDER MOTOR FUEL<br />\n<br />\nasessamilliammallbemememansamiele<br />\n<br />\nSold Only<br />\n<br />\nat<br />\n<br />\nVv'EANT PRESS, 35 S. Gay St.<br />\n<br />\nTHE SILVERNIAN<br />\n\"Bigger<br />\nand Better<br />\nThis Year\"<br />\nThe<br />\nPLACE<br />\n<br />\nDANCE and EAT<br />\n(Open 10.30 A. M.'until Bedtime)<br />\nNO COUVERT CHARGE<br />\n<br />\n-GUS wants<br />\n823 N. Charles St.<br />\n<br />\nto see you\"<br />\n<br />\n(formerly the Silver Slipper)<br />\n<br />\nCA (Reliable Tip<br />\nConcernirzA<br />\nYOUNG MEN'S FALL SUITS<br />\nIn the daily race of business and pleasure, a suit from the<br />\nHutzler Young Men's Shop will give you a substantial lead<br />\nright at the start.<br />\n<br />\n$29.50 to $59.50<br />\nTHIRD FLOOR, NORTH BUILDING<br />\n<br />\nHUTZI.FR. POTHEIt<br />\nHoward, Saratoga and Clay Streets<br />\nTelephone CAlvert 1234<br />\n<br />\n7,<br />\n<br />\n\fTHE JOHNS HOPKINS NEWSLETTER, NOVEMBER 9, 1928<br />\n<br />\nTHE SOUTHERN<br />\nHOTEL<br />\n<br />\neMANNIE BERG<br />\n<br />\nBaltimore's Npwest<br />\n: a9c1<br />\n<br />\nThe Old Boy Himself\"<br />\n<br />\n\"A Hotel of<br />\nand mitt.<br />\n<br />\nTrade Mark Reg.<br />\n<br />\nCollegiate Furnishings<br />\n<br />\nEi<br />\n<br />\nPhone, VErnon,..I<br />\n\"What ts-tmpo,oigie to Others IS<br />\nPose/bre. o Us\"<br />\n<br />\nTHE RELIABLE WEAVING CO.<br />\n<br />\nNORTH AVE. MARKET<br />\nNORTH<br />\n<br />\n.<br />\n<br />\nMARYLAND AYES.<br />\n<br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nALSO REPAIR SILK DRESSES<br />\nsee WEST SARATOGA STIIr.:r.A.<br />\nBetween HardSt. and Park Ave.<br />\nBaltimore,Md.<br />\n<br />\nWE<br />\n<br />\nHULLABALOO PICTURE<br />\nSCHEDULE<br />\nContinued from Page 1, Cot. 4<br />\n<br />\nMONDAY<br />\n. A. M.Individual<br />\nto\"<br />\n{ Seniors<br />\n12:20Tr. g.<br />\nC. E. Hail'<br />\nC. E. Hall<br />\n12:20--Inter-Fraternity Board<br />\n12:30—Hullabaloo Staff<br />\n12:40 NEWS-LETTER<br />\n12:50—Black and Blue Jay Staff<br />\n-Gilman Steps<br />\nand Quadrangle<br />\n4:15 P. M.—<br />\nR. 0. T. C. Unit<br />\nArmy Officers<br />\nCadet Officers<br />\nScabbard and Blade<br />\nRifle Team<br />\n_C. E. Hall<br />\n7:15 P. M.—A..A. Board<br />\n{Beta Theta Pi<br />\n7:30<br />\nPhi Kappa Psi<br />\nDelta Phi<br />\n7:45<br />\nAlpha Delta Phi<br />\nPhi Gamma Delta<br />\n8:00<br />\n'Kappa Alpha<br />\nKappa Sigma<br />\n8:15<br />\n-,1A1pha -Tau Omega<br />\n(Delta Upsilon<br />\n8-30<br />\n1Alpha Kappa Phi<br />\n(Omicron Kappa Omicron<br />\n8-45<br />\nDelta Gamma Theta<br />\nTUESDAY<br />\n9:00 A. .<br />\nIndividual<br />\n2<br />\n,<br />\nSeniors<br />\n12:20 P. M.<br />\nC. E. Hall<br />\n<br />\nGilman Steps<br />\n12:30—Senior Class<br />\n12:45—Junior Class<br />\nHomewood<br />\n4:15 P. M.<br />\nFootball Team<br />\nCross Country Team<br />\nC. E. Hall<br />\n, Sigma Tau Delta<br />\n7:30<br />\n<br />\nAll ready for the whistle<br />\nor the wind<br />\nV<br />\n<br />\n13,<br />\n<br />\nYou know the big thrill<br />\njust before the whistle<br />\nblows. Be prepared to en.<br />\njoy all the big games this<br />\nyear in a smart.lookink<br />\nAlligator. Warnithiand<br />\nstyle for the brisk,windy<br />\n10<br />\ndays,and absolute protection,no matter how hard it rains. Every<br />\nAlligator is correctly modeled in the<br />\nMLA advanced style and all Alligator<br />\nfabrics are a revelation in softness,<br />\nlight weight and durability. Try one<br />\non. Get the feel of it and you'll appreciate the big difference. Alligators are<br />\nsold only at the best stores and retail<br />\nfrom $7.50 to $25.00. See the new<br />\nAlligator Aviation model at $10.00.<br />\nThe Alligator Company, St. Louis, Mo.<br />\n<br />\n•<br />\n<br />\nfAlpha Nu Tau<br />\n7:45•<br />\n'1Charles Carroll Club<br />\n(Phi Alpha<br />\n,<br />\nPeabody Book Shop<br />\nNewspapers<br />\n8:00<br />\nCommercial<br />\n1Phi_.Epsilon Pi<br />\nBooks<br />\nWork<br />\n13'N. Charles<br />\n• Established 1850<br />\nfTäti-Aa Omega<br />\n815<br />\nIota Larfibda Phi<br />\nThomas e..? Evans.<br />\nALL NPV.1<br />\n830•(Phi Sigma Delta<br />\nOpen<br />\n.<br />\nPublications<br />\n1Pi Lambda Pi<br />\nPrinting Company<br />\nEvenings<br />\nLess 10%<br />\n1506-1508 Guilford Avenue<br />\nWEDNESDAY<br />\n9:00 A. M.<br />\nIndividual<br />\nBaltimore, Md.<br />\nto<br />\nSeniors<br />\n.Drinkwater, John: Program of Eternity., Byron ($5.00), $2.50.<br />\nPhone VErnon 5691<br />\n12:20 F'. M.<br />\nC. E. Hall<br />\nShelley: His Life and Works by Wal. Gilman Steps<br />\nter Edwin 'Peek. ($12.50), $6.25.<br />\n12:30—Sophomore Class<br />\nYELLOW CAB STANDS<br />\n12:45—Freshman Class<br />\nAlligator Agents<br />\n•<br />\nAT<br />\nC. E. Hall<br />\nALBERT<br />\nW.<br />\nRHINE,<br />\nINC.<br />\nTHE<br />\nHomewood Field<br />\n4:00 P. M.—A. S. M. E.<br />\n35th Es' St. Paul Sts.<br />\nClothiers and Haberdashers<br />\n4:10 P.M—A. S. CE.<br />\n538 N. Calvert St.<br />\n31st fi St. Paul Sts.<br />\n4:15 P. M.—Electrical Club<br />\n17 E. BALTIMORE ST,<br />\nSafe and Efficient Service<br />\n4:30 P. M,,—Tudor and Stuart<br />\nNo Charge for Extra Passengers<br />\nTHURSDAY<br />\n'PHONE<br />\n9:00 A. M.<br />\nIndividual<br />\nVERNON 1 2 1 2<br />\nto,<br />\nSeniors<br />\n12:20 P. M.<br />\nPAINTS and VARNISHES<br />\nFOR A<br />\nC. E. Hall<br />\nC. E. Hall<br />\nYELLOW •CAB<br />\n12:20—Cotillon Club<br />\n12:30—Barnstormers'<br />\n12:40—Y. M. C. A. Council<br />\n12:50—Debating Council<br />\nTHE PIAVT<br />\nNEW LIFE<br />\n2 P. M.<br />\nIndividual<br />\nPOWER FUEL '<br />\nFOR MOTORS<br />\nSPEAKING OF SPORTS<br />\nis working its *ay through college<br />\nto<br />\nSeniors<br />\nMen in every class seem to favor it. Warmth without weight—<br />\nC. E. Hall<br />\nChemically pure and technically 5 P. M.<br />\n\"STANDARD\" MOTOR OIL<br />\nin-between topcoat and overcoat<br />\nperfect football probably will not be<br />\nJ. H. FURST CO.<br />\nseen in the Stadium tomorrow. But<br />\nPRINTERS OF<br />\nThe Measure of Oil Value<br />\nthe boys who.are risking their lives,<br />\nPhilological and Scientific<br />\nif not their fortunes or their sacred<br />\nPublications<br />\nhonor, for Navy and Michigan on<br />\nSTANDARD OILJCOMPANY OP N. J.<br />\n211,213 EAST BALTIMORE ST.<br />\nthe municipal turf will know they 23 S. HANOVER ST. BALTIMORE<br />\nhave been in a fight.<br />\nThat is to say, the Midshipmen<br />\nand Wolverines tomorrow will be<br />\nrepresented by sophomore teams of.<br />\nbright young boys just trying very<br />\nTHE TRENCH COAT, $12.50<br />\nhard to get along. They *ill make<br />\nA lightweight, putty-colored, Watetproofed coat that has plenty of<br />\n'<br />\nsome mistakes, and they will ,be<br />\ndash and swagger. Trimmed with leather buttons and buckles.<br />\ncriticised quite .justly for their iack<br />\nThe newest thing out.<br />\nof football acumen, but they are not<br />\nSecond Floor •<br />\nunlikely to put on a good show.<br />\nLa,st V week, MOigan came<br />\nthrough with an inspiring victory<br />\nover Illinois. This, it is true, was<br />\nthe first triumph of the Yost outfit,<br />\nbut the team indicated it may have<br />\nlatent intelligence, and some ability'.<br />\nNavy made a stmilar showinFIWo<br />\nweeks ago when it surprised the ex.perts by defeating Penn,<br />\n•<br />\n• With the theatfes running well,<br />\nChristmas not so far off, and lost<br />\nelection bets to pay, we hesitate to<br />\nadvise our readers to invest six dollars in two tickets and'another in a<br />\npint of new gin. But if you have<br />\n4e)<br />\nit,<br />\nafternoon may be pleasantly<br />\nspent-at the Stadium.<br />\n<br />\nALLIGATOR.<br />\n<br />\n•<br />\n<br />\nTRADE.,AARK REG. U. S. PAT. OFF.<br />\n<br />\n{<br />\n<br />\nogre<br />\n<br />\nIIE IR if co.<br />\n<br />\nCLOTHES<br />\neNIIDWATE<br />\n<br />\nESSO<br />\n<br />\n$40 to $60<br />\n<br />\nSmart Collegians Are .Weanng<br />\n<br />\nSTEWARTEIGD.<br />\nAfter the Dance<br />\n<br />\n:II:44,<br />\n<br />\n•<br />\n<br />\n,4<br />\n<br />\n• T91. EDIEGIS<br />\n<br />\n1815-17 .North Charles St.<br />\n<br />\nitia<br />\n<br />\n41.<br />\n<br />\ncDe)<br />\n<br />\nVANDERBILT HOTEL<br />\n•<br />\n<br />\n.07VE W TOR.K.<br />\n<br />\nc7hily Jour/it c5treet oast at O'arit Avenue)<br />\n<br />\nC21Anounco_9<br />\nunday 6vening eoncerti...)<br />\nACM<br />\nin,the DWA<br />\nDISTINGUISHED ARTISTS<br />\nD1NER-DE-LUXE—$3.00 PER PERSON<br />\n<br />\nIn Addition<br />\non Tuesday, Wednesday,Thursday,<br />\nFriday and Saturday Evenings We<br />\nare having<br />\n<br />\nDinner Dances<br />\nin the Della Robbia Room. Dancing from 7 oo to 12:00 including<br />\nDinner at $3.50 percover.<br />\nMusic by the Della Robbia Orchestra. vening<br />\nA1'1' Dress required.<br />\nWsx.rots H. MuuntAt-t.<br />\nMamma<br />\n<br />\n• Tomorrow .the University. of<br />\nMaryland Ravens make their apinial<br />\nexcursion to New Haven. The team<br />\nenjoys the ride thoroughly every<br />\nyear, and the Yale boys enjoy the<br />\nrecreation.<br />\nAlthough \"veritaa vos liberabit,\" a<br />\nsense of loyalty to this University<br />\nprohibits any, comment on the Blue<br />\nJays' visit to Columbia's ball park<br />\ntomorrow, except to wish the local<br />\nteam a pleasant journey.<br />\nYou may say that it is impossible<br />\nfor an American to understand a<br />\nFrenchman anyhow, and that all<br />\nFrenchmen are therefore a bit unbalanced, and somebody will always<br />\nbe broadminded enough to disagree.<br />\nBut it is difficult to follow the latest<br />\nreasoning of the French Tennis<br />\nAssociation.<br />\nThe French government has recently levied a 22 2 per cent tax on<br />\nthe gross receipts of tennis matches,<br />\nlooking forward to collecting a very<br />\nconsiderable sum at the covered<br />\ncourt championships. The French<br />\nTennis Association was very much<br />\nannoyed at this, and its leaders put<br />\ntheir heads together with the following result:<br />\nThe championships must be held.<br />\ni<br />\nlNt<br />\n,<br />\nif there are no spectators, there<br />\nContinued on Page' 4, col. 4<br />\n<br />\nLife has its cheering sections, too...<br />\nEntire industries are ready to rise in<br />\nhomage to men who will lead the way<br />\nthrough the riddles of physical and<br />\nfinancial phenomena, of chemical and<br />\ncommercial mysteries. The world and its<br />\nworkers need,notjust one captain to<br />\ninspire victories, but a whole host.<br />\nThere is no limitto the size of the<br />\nteams a man can command; no<br />\n<br />\nlimit to the importance of the position he<br />\nplays; no limit to his eligibility save his<br />\nown desire to make and retain a place<br />\nfor himself.<br />\nWho will do for the telephone making of the 1950's what its leaders<br />\nare doing today—if not the men of<br />\nthe 1930's who are just now ,entering the field?<br />\n<br />\nark<br />\nSINCE 1882 MANUFACTURERS. FOR THE BELL<br />\nSYSTEM<br />\n<br />\n\f9, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER<br />\n<br />\nSECRETARIES AND LIBRARIANS<br />\nACTIVE IN PAST CAMPAIGN<br />\n<br />\nLADIES' HOSE, UNDIES, HANDKERCHIEFS<br />\nMEN'S<br />\n<br />\nHOSE,<br />\n<br />\nCANDIES<br />\n<br />\nTIES,: HANDKERCHIEFS<br />\n. COOKILLS<br />\n<br />\n, JELLIES<br />\n<br />\nWhy Buy Elsewhcre When You Can Buy Here for Less<br />\n<br />\n, Christmas is Near<br />\n<br />\nTHE COLLEGIATE SHOP<br />\nAnnounces its Opening on November th<br />\n2446 N. CHARLES ST.<br />\nHOtneWood $Mil)<br />\n<br />\nOpen Every Evening<br />\n<br />\nHelp the ',rim (Goucher) and the boys (Hopkins) tohelp fheinselves.<br />\nStop in to see their display of hand-made novelties and Anme-made dainties<br />\n<br />\nHERE IS THE PLAN<br />\n• Christmas is almost here, why _riot make some extra pin money<br />\nfor a new coat, hat, etc, by bringing some homemade article to be sold<br />\nat the Goucher-Hopkins Exchange at 10% commission. Probably your<br />\nMothers and Sisters are helping you through College, therefore, why<br />\nnot have them make some candy, cakes, or, in fact, anything. All helps<br />\nand everybody will be out to help Goucher and Hopkins students to<br />\nhelp themselves. Bring your articles now and remetnber the articles<br />\nthat are least expensive sell the hest.<br />\n<br />\nHOmewood 5040-8041<br />\nYour elothee will always have that neat appearance if you will let us do your<br />\nCLEANING, DYEING, PRESSING AND REPAIRING<br />\n\"One Trial Will Convince You\"<br />\n<br />\nPARISIAN TAILORING CO.<br />\n346 E. 33RD STREET<br />\nCorner University l'arkWAY,<br />\n<br />\nThe MAY Co.<br />\nA Modern., Store.,<br />\nFor Modern,<br />\nYoung Men.,<br />\n<br />\nTYPEWRITERS, ALL MAKES<br />\n<br />\nCORONA<br />\n<br />\nROYAL<br />\n<br />\nher<br />\nPolitical strife of the campaign porter attempted .to put to music<br />\nHoohas not been confined to the \"Barn\" composition hilt tai sooner did<br />\nwhen<br />\nand the male element On the campus/ ver's friends hear the words<br />\nto the<br />\nUp. in Gilman, Dr. French's office they jetaliated with a gem<br />\nname<br />\nforce of the fairer sex has been same. tune calling Al every<br />\nconducting a heated campaign of.its within the limits of respectability.<br />\ntwo<br />\nown Daily political debates have— The carlools' depicting the<br />\naccompauied the tapping of type-' candidates were worthy of Edmund<br />\ncountenance<br />\nwriter keys imul high-pitched femi- Duffey. Herh's round<br />\nnine voices have extolled the virtues was on one side of the p.aper White<br />\nof \"Al\" or boasted of Herbert's si- on the other a Hoover artist caricatured Al with his brown derby<br />\nlent virtues.<br />\nTheir campaign, however, also perched above his grinning faye and<br />\nhad its more popular phase. 'Cam- a caustic \"Hec! Ha!\" written alongpaign cartoons and campaign songs side:<br />\nhave been exchanged between the ,Chairmen Work and Raskob<br />\nwarring fac'tions, in addition-to Vari- have evidently overlooked these poous uncomplimentary slurs regard- tential campaigners. Perhaps a Mabel Walker Wihlebrandt is in the I<br />\ning each candidate. .<br />\nUnfortunately, -an aversion to making under —Dr. French's very<br />\nbursting into print on the part ,if eyes.<br />\nthese feminine rabble-rousers pre'SPEAKING OF SPORTS<br />\nvents us from printing the masterContinned from Page- 3, Col: 3<br />\npieces composed to further both the will be no receipts. If there are no<br />\ncauses of Herb's and Al's 'cam- receipts, there will be no tax. Therepaigns. Reaching feverish excite- fore, we bold the championships but<br />\nment on the day before eleotion, we wilt keep.the spectators out.<br />\nSmith's partisans produced a gant!- The logic, pf cottise, lfliettect<br />\npaign song extolling their candi- and imainiviierable. The only diffidate's virtues and- not in the least cultY is that the French Tennis As- 1<br />\ncomplimentary to \"Lord Hoffer.\" sociation lost 77,<br />\n4 per cent of the<br />\nSidewalks receipts which would have been re,<br />\nTo the tune of<br />\nof New York,\" a valiant Smith sup- ceiVed, and Messieurs Cochet, BorOtra, .and Brugnon refusOd to consPete, ostensibly, because,they had no<br />\ndesire iefo play before empty seats,<br />\nCOSMOPOLITAN CLUB<br />\nbut really, according to the whisperDANCE NEXT FRIDAY<br />\ners, because the Association had no<br />\nThe Intercollegiate COstm•fund to pay Their \"expenses.\"<br />\npolitan Club will give a ma:•<br />\n•<br />\nquerade dance in the C. E.<br />\nIf is not often that d hole in one<br />\nI fall on Friday, November 16,<br />\nmeans anything. Or rather it means<br />\nfrom 9 to 12 P. M.•<br />\nso much just in itself, that no one<br />\nReal cosmopolitan atmosbothers to look at the total score<br />\nsphere will be created by cosof the player who has made an ace..<br />\ntomes, dances,,,decorations, and<br />\nThe freak shots seldom occur in.<br />\ntournament golf, and when they do<br />\n. crancing by the represenia..solo<br />\ntives• of many- counties.'Prizes<br />\nthey usnally have ni)--result.will be awarded for the best<br />\nThis week, however, a young bus<br />\nand worst costumes:<br />\nMess man named Horton Smith<br />\nTickets may be secured at<br />\n(:‘,Un $ipay by Wing out in (me at•<br />\n• the door or .from any members<br />\nOklahoma City in an open tournaof the Cosmottlitan<br />\nment. I lc finished just (al(' stroke<br />\n1•,(1 Dudley, 'II 1.1))4(4)(1,<br />\nahead<br />\nCLASS lactosse 'game etc ....<br />\nanother pro.<br />\n<br />\nOvl. W. LUCY & CO.<br />\n<br />\nSELL CHEVROLETS<br />\nfound it quite profitable<br />\nCollege Students have frequently<br />\nto employ their spare time<br />\nfinancial problems of many ambitious<br />\nSelling Chevrolets has solved the<br />\nappeal to you—See Us at once.<br />\nsuggestion<br />\nthis<br />\nShould<br />\nCollege Men.<br />\n<br />\nf(r<br />\n<br />\nOldest and Largest Corona Dealers in State<br />\nHAMMOND<br />\n<br />\nUNDERWOOD<br />\n<br />\nFre<br />\n<br />\nCOrSA<br />\n. SALES.<br />\nCorner<br />\nSoutheast<br />\n<br />\nDeve<br />\nthe Cal<br />\nfavoral<br />\nmeeting<br />\nsembly<br />\nditional<br />\nsecured<br />\ntotal su<br />\ngradual<br />\nnificant<br />\nfacts.<br />\n- plies t<br />\ngained<br />\n<br />\n43rd Street West of Broadway<br />\nNEW YORK CITY<br />\n<br />\nIn<br />\n<br />\n1000 OUTSIDE ROOMS<br />\nand Other Activities<br />\nthe Center of Theatre District<br />\nIIIGHER<br />\nDAISY RATES—NONE<br />\n<br />\n(For One-52.00<br />\nFor Two— 3.00<br />\nRooms with Running Water . .<br />\nOne— 2.50<br />\nRooms with Connecting Shower.( For<br />\nRooms with Private Shower. .<br />\n<br />\n:\"<br />\n4<br />\nF:-Twe— 3<br />\n<br />\n•<br />\n<br />\nMy father said—<br />\n\"John Hancock is a great name;<br />\nLife insurance is practically indispensable.\"<br />\n<br />\nThat time, at least, he was right.<br />\n<br />\nLIFE INSURANCE COMPANY<br />\nor BosTom. MASSACNUS1,15<br />\n<br />\nProducers of<br />\n<br />\nGTHE IIEWSHLETTER<br />\nThe., READ-TAYLOR co.<br />\n.Lombard & South Sts<br />\n<br />\nFor Sweaters, Trench Coats, Slickers, Sporting Goods,<br />\nArmy Uniforms and Supplies, also Aviation Outfits, head<br />\nyour airship and land at thq<br />\nOUTING SUPPLY CORPORATION<br />\n21 North Liberty Street<br />\n<br />\n_<br />\n<br />\n-<br />\n<br />\nThe season's styles in neckwear are the key to a. man's<br />\ndress .. . they give that touch of persond effectiveness.<br />\n\"The Store of Standard Values\"<br />\n<br />\n. M.c iPHERSON'S<br />\nEstablished 1862<br />\n• .<br />\nEast Baltimore Street<br />\n<br />\nOVER—FIRST DOWN<br />\nWith AMOCO•GAS in the tank,<br />\nyou're assured of that determined<br />\npower and drive that carries you over<br />\n—in high.<br />\n<br />\nfail to babble of the marvelous echoes that reverberate so obligingly from peak to peak.<br />\nBut no such phenomenon matches a certain<br />\necho that keeps circling this whole mundane<br />\nsphere. It is the best-known cigarette slogan<br />\never coined — the Chesterfield phrase \"They<br />\nSatisfy.\"<br />\nOriginated to describe a unique coupling of<br />\n<br />\nFigur<br />\n<br />\nHotel Times Square<br />\n<br />\naAn.echo that circles<br />\nthe glob6<br />\n<br />\nSightseer's returning from the Alps never<br />\n<br />\n$10,<br />\n<br />\nMOUNT ROYAL AVE. at McMECHEN ST.<br />\nTelephone: MAdison $355<br />\n<br />\nCA thought of today--<br />\n<br />\n11<br />\n<br />\nCAGE<br />\nGOOE<br />\n<br />\nONES CHEVROLET<br />\n<br />\n104 WEST FAYETTE STREET<br />\nTelephone CAlvert 5902<br />\n<br />\nVOL.<br />\n<br />\nqualities seemingly opposed-7\"ti? 're mild,and<br />\nyet, they satisfy\"—its desciirive accuracy was<br />\ninstantly perceived. Today it echoes and reechoes wherever cigarettes are smoked:<br />\n\"Satisfacen —Bssatisfont...THEY SAT/SFY!\"<br />\nAnd rightly enough,for Chesterfields are mild<br />\n—and they DO satisfy ... and what more can<br />\nany cigarette offer?<br />\n<br />\nEST1EVIFI EILID<br />\n<br />\nMILD enough for anybody.<br />\n.. and yet.. THEY SATISFY<br />\n<br />\nLIGGITT• WIWI TOBACCO CO.<br />\n<br />\nas yet<br />\npressed<br />\nrealize<br />\nwithhel<br />\nting th<br />\nthe •cag<br />\n_ ized.<br />\ncently s<br />\nof the<br />\nwhich,<br />\nthe stu<br />\nnally, t<br />\nit dem(<br />\n• for the<br />\nas the<br />\ncerned,<br />\nalone a<br />\nceied<br />\nfrOm ti<br />\nfar the<br />\nfying a<br />\nimpres:<br />\nto the l<br />\npresent<br />\n.of the<br />\nlumbia<br />\n<br />\nC.<br />\nDesp<br />\nprogres<br />\nnation<br />\nTITe pr<br />\nTruste(<br />\nsignifie<br />\nginning<br />\nplans<br />\nare -in<br />\non the<br />\nof offic<br />\nalso th<br />\nunanim<br />\n• ineetn4<br />\ndiscuss,<br />\napprovi<br />\nThe<br />\nWill cc<br />\nFxecut<br />\nanswer<br />\nly, lett(<br />\ndent to<br />\ns•-•<br />\ngiving<br />\nSo far,<br />\nin very<br />\nas yet<br />\nso at c<br />\nis desir<br />\nter by t<br />\n<br />\nt th<br />\ner;capt<br />\ndressed<br />\nthe cag<br />\ngive hi<br />\nthat (hi<br />\npositior<br />\nit. Ha<br />\nto shoi,<br />\ntangiblt<br />\nsupport<br />\ner told<br />\nHopkin<br />\ned and<br />\nbeen c<br />\nsupport<br />\nwould<br />\n<br />\n\f", "format": "basic_html", "processed": "Z17,3sT27<br />\nVol. XXXIII No. 12<br /><br />\nEIGHT GAMES ON<br />\nLACROSSE CARD<br /><br />\nDANCE IN C. E HALL<br />\nTOMORROW EVENING<br />\nA dance will be held in C.<br />\nhall tuiiiuiuw at 9 P. M. A<br />\n- special effort will be made to<br />\nhave those attending the NavyMichigan game come to the<br />\ndance. There will be no tea<br />\n,dance as Hopkins' team plays<br />\naway. ,Admission will be one<br />\ndollar for both stags and couples. Osmar Steinwald's orchestra will render the music.<br />\nThe annual dance following.<br />\nthe Maryland gaol will be<br />\nheld at the new Pythian Hall<br />\non Charles and Preston Streets<br />\nfrom nine until'one.<br /><br />\nis<br /><br />\nBRIDGE PLAYERS HOLD FORTH<br />\nON SECOND FLOOR OF BARN<br /><br />\nYEARLINGS MUST WEAR<br />\nFRESHMEN BUTTONS<br />\nDonald Hiss, pre,dent of<br />\nthe Student _Council, wishes It<br />\nMade clear that freshman buttons must be worn by fres'11men as well as any pledge pin<br />\nthe freshmen may be wearing.<br />\nFreshmen are warned that if<br />\ncomplete regulations: green<br />\ntie, black socks and button, are<br />\nnot worn, the Student Council<br />\nwill take action. Also, if game<br />\ntags are not worn the Mondays and Tuesdays after the<br />\ngames, freShmen are liable to<br />\nbe requested tot come before<br />\nthe Council to—give reasons for<br />\nnot being at the game.<br /><br />\nCOLUMBIA TO BE MET<br />\nBY JAYS TOMORROW<br /><br />\nAnd after all, why should they be<br />\nThey're back! Carrying kings<br />\nWill Give Coaching Staff Chance _<br />\ngood<br />\nRutgers Substituted for<br />\nand queens in their train<br />\nto Discover Flaws<br />\nNavy Game<br />\nplayers have again invaded the Barn. time, they offend no one, they play<br />\nCAPT. STRADER TO PLAY<br />\nare<br />\nand<br />\nthey<br />\nsmall<br />\nstakes,<br />\nMARYLAND GAME AWAY<br />\nvery<br />\nfor<br />\nCanfamous<br />\nthat<br />\nthe<br />\nIt is rumored<br />\nJays Played New Yorkers to<br />\nOlympic All-Stars Meet Jays<br />\nfield is turning over in his grave as quiet. What more could one want?<br />\n6-6 Tie in 1927<br />\nin Opener<br />\n,<br />\nalone,<br />\nsay<br />\nwe.<br />\nthem<br />\nhe realizes that what he considered Let<br />\nThe Black and Blue journeys toLacrosse devotees who were una perfect gambling eita-filishment has<br />\nAs for the games that are most<br />\nmorrow to the Metropolitan area to<br />\nable to follow the famous '28 Hoppaled into insignificance beside the popular, bridge takes first place.<br />\nplay its last out-of-town game, with<br />\nkins lacrosse twelve to Amsterdam<br />\nsecond .floor' of the HoPkiriS stable. There are about five bridge games<br />\nthe Lions of Columbia University.<br />\nWill have another opportunity this<br />\nNot that the stakes arrhigh, but the to one of every other sort combined<br />\nThis marks the beginning of the<br />\n' April to see the world famous<br />\nquality of play is superb, and as which is at least encouraging in reJays' three hardest tests, since the<br />\n- American Olympic representatives<br />\nfor rivalry, the Spartans received spect to the intellect of the average<br />\nSt. John's game is to be played a<br />\nin action. They will meet the Hopnot half as much pleasure in sinking Hopkins man. Next to bridge comes<br />\nweek from Saturday, and the anBarn<br />\nkins lacrosse twelve on April 6 at<br />\none<br />\n''as<br />\nfleet<br />\ngame<br />\nis<br />\nAthenian<br />\nThis<br />\nthe<br />\nhearts, or \"shiboby.\"<br />\nnual Turkey Day fracas with MaryHomewood in the opening game of<br />\nadverfinessira,4is<br />\nhound does in<br />\nplayed-usually by those who cannot<br />\nland at the Stadium occurs ten days<br />\nthe 1929 lacrosse Season.<br />\nsary's king.<br />\nfind a fourth for bridge or because<br />\nafter.<br />\n•Olyinpic<br />\nof<br />\nthe<br />\nUnder the title<br />\nAnd bold?' The card players be- there are too' many for the ancient<br />\nUpset Last Year<br />\nLiebens\"Lefty\"<br />\nAll-Stars, Captain<br />\nLast year the game with the New<br />\nlieve that they own the place. Just and honorable game of whist. Pitch<br />\n'<br />\n'<br />\n, Bid- ,<br />\nperger, \"Bill\" Logan, \"Tom;<br />\nYorkers proved a decided tipset.<br />\na few, days ago one called up to the ranks third in the affections of the<br />\ndisOn, and a galaxy of Other famous<br />\nsince it ended in- a tie, and Hopkins<br />\nNEWS-LETTER office to ask the staff players. Pitch may be better known<br />\nstars of the crease wilt meet The<br />\noutplayed their Opponents from start<br />\nto keep. more quiet so they could to our readers as set-back, seven up,<br />\nraw tfopkins tWelve. \"tirring and<br />\n• Kelly and Schiebel to Lead<br />\nto finish. This year the outlook,<br />\nhave their game in peace!, The un- go back, or any of a half dozen<br />\nHopkins Men<br />\nmitigated. gall, of them is extraor- other names. As for c - - -, well Football Game and Rush After however, is none too good, since the<br />\n„ interesting battle is promised.<br />\nThanksgiving<br />\nCOACH EXPECTS WIN<br />\nt'Penn Comes Second<br />\ndinary.<br />\ninexperienced Blue Jays are w•eaker<br />\nthey don't play that in the Barn anyFollowing_ the opener with the Course at Union College Is Six<br />\nthan last year, while Columbia has<br />\nLast -year a movement was<br />\nway;<br />\nRUSH TO BE DIFFERENT<br />\nMiles Long<br />\n. All-Stars, the University of Pennbolstered its outfit considerably, The<br />\ntoted to stop card-playing at the<br />\nUnder<br />\nRushes<br />\nTypes<br />\nof<br />\nVarious<br />\nsureign<br />\nfinesse<br />\nWell:<br />\nmay<br />\n-the<br />\nsylvania twelve will meet the, Black<br />\nUnder the leadership of Captain Barn, hut after a brief interdict by<br />\nLions have played a difficult schedComideration<br />\nand Blue stickmen, also at home- Robert Kelly, the Cross •Country the Dean, the gamesters returned in preme and the elusive queen of<br />\nule, losing only to Dartmouth, and<br />\nwood. Last year Hopkins made the Team will engage in the second meet full force. So far, this year nothing spades flit back and forth in the<br />\nThe frosh-soph lacrosse game beating Wesleyan and Williams by<br />\nlargest lacrosse score .::!gainst the of the season. The team will meet has been done to stop them.. ' - Barn for the.rest of the year.<br />\nwill be played either Thursday or decisive scores, while last week they<br />\nRed and Blue twelve ever ...Scored, Union College at Schenectady. toFriday of next week. The track held Cornell to a scoreless tie. Their<br />\nBut Penn has a numbes..of veterans morrow in this contest. Having demeet will take place the week after biggest offensive threat, Hank<br />\nHullabaloo<br />\nTake<br />\nTo<br />\nPledges Must Be<br />\nback this year and Hopkins can feated Lehigh here last week, the Cage<br />\nPictures Next Week and the football game will be played Kumpf, was injured so badly in the<br />\nIn By Tonight<br />\nboast of Mily three.<br />\nteam has good prospects of captoron the dfternoon of the Saturday Dartmouth game, that he will be out<br />\nPictures for the 192§ Hallabaloo following Thanksgiving.- During the<br />\nOn April 20, the Hopkins stick- Mg tomorrow's run. \"I' think we<br />\nfor the remainder of the season, but<br />\nof<br />\nthe<br />\nFrisch.<br />\nChairman<br />\nPaul<br />\nMonfrom<br />\nwill be taken next week<br />\nMen will journey to West-Point to have a good Chance,\" said Kelly.<br />\nhalves of the football game-the class they have been very fortunate in unthat<br />\nrequests<br />\nCommittee,<br />\nFund<br />\nCage<br />\nGeorge<br />\nday to Thursday. Mr,<br />\nmeet.the strong .\\rmv twelve. Army Though Union's team is unusually<br />\nrush will beheld.<br />\ncovering in Phil Lifiander, sophoall students who have not as yet Ebeneck frorn White Studio, New<br />\nt beat Hopkins 5-3 during the sched- powerful it is 11,4 its strong as it<br />\nEddie Lockard, president of the more quarterback, a fast, shifty runto<br />\npledges<br />\nFund<br />\ntheir<br />\nCage<br />\nsigned<br />\nYork, will take individual pictures<br />\nuled season last year, lan -the Cadets was last Year -while the Hopkins<br />\ndo so before 4 :P. M. today. Mr. of the seniors from 9 to 12:20 Slphomore Class, and Ned Duke- ner whose specialty seems to be in<br />\n:bowed to the Blue Jay twelve at team is compokd of many veterans<br />\nMyers will have the blanks -at the o'clock each day while the group hart,, president of, the Freshman getting away for long runs through<br />\nWashington in the Olvtttpic playoff from last yeas's strong team.<br />\nPostoffice and students should sign pictures will be takert-between 12 30-I Oass, decided upota. the dates for a broken field. He, together with<br />\nconbrilliantly<br />\nmost<br />\nin•-one_of the.<br />\nThe team will leave Baltiniote on<br />\nmeeting. held<br />\nJoe Stanczwyk, veteran fullback and<br />\npledges there and: turn them- in nu-, and 1 o'Clock and at night.<br />\n- the games at a<br />\ntested lacrosse games played during Friday morning reaching Schenec-‘<br />\nline plunger extraordinary, make a<br />\nTuesday afternoon.<br />\nmediately._<br />\nMr.<br />\nsee<br />\nto<br />\nurged<br />\nSeniors<br />\nare<br />\nstrained<br />\nthe seas a. Because of the<br />\ntady in the CVOling. They will probIt is imperative to have $10,000 in Elieneck in the C. E. Hall for sitSo far it is not known what kind hard pair to stop on any man's gridrelations with Navy, the ;\\ rim. game' ably spend Saturday night also in<br />\nbefore the<br />\npat<br />\npledges<br />\nto<br />\nstudent<br />\nof<br />\nrush will be held this year. Last iron. Columbia's head coach, Charles<br />\nthe<br />\n.<br />\ntintinents<br />\ntings or app'<br />\nlooms as one of the tw o big games Schenectady, leaving- early Sunday<br />\nNew York Alumni toinorrow night. first part if the week as this is the year there was a \"paint rush,\" in- Crowley, was assistant to the late<br />\nof the coming. season.<br />\nfor home.<br />\n,<br />\nOnly a tittle over $6,000 has been only • opportunity they will have if which the sophomore's tried fo paint Percy Houghton,.famed for his<br />\nRandolph-Macon<br />\nUnion College Good<br />\npledged to date. The committee is they- want their pictures. before the a pole red, while the freshmen tried Harvard teams of some years back.<br />\nna<br />\nist<br />\n1<br />\nthe<br />\none<br />\nact<br />\nin,<br />\nRand,Oph- NI<br />\nCross country running is given<br />\nAt the time when Columbia ,decided<br />\npowerful of the southern teams, much prominence at Union College making great plans for the banquet Cliristmas.tholidaVs.<br />\nBy being pho- to paint it green. This rush was of to<br />\nresume football about five years<br />\nwill meet the Jays in I Iiiniewood whose teams have been unusually._in New York Saturday night anti ,togi:afttec.<br />\nthis time the Hullabu- interest, not only to thOse participatago, Houghton was prevailed to acon April 27. 5111 May 5 Rutgers successful. In the past few ,years the whole movement will lie greatly /aV/IS-fziff'W 1 i'Vmaterially aided in ing, but- to the bystanders. l'aint,<br />\ncept the helm, which position he ocwill, journey to I Ii tritestthe they have won thirty-seven consectt- jeopardized if the students do not 'their attempt<br />\n'The book pub- rotten eggs, tear bombs,. and a gencupied until his death, after which<br />\nfirst time since Rutgers has taken tive meets, and only recently -did do their part. •<br />\nt of :June. • eral roughness featured.<br />\nshed...laifisre<br />\nCrowley succeeded him. HandiThe Band is- being sent by the<br />\nup - the stick game. The Scarlet they suffer their first .defeat at the<br />\nGroup pictures will be taken durFor some years before this there<br />\ntwelve was one of the big )1yinpic hands of New York University. The Athletic Assticiation for the Colum- ing lunch-time, after four o'clock was a greased pole for the two capped by rather poor material, he<br />\nhas nevertheless turned out some<br />\nthreats last seasiin anti the coming meet this year will be the first in bia game and will play tonight-at the and at night. Sehedules will be classes to try to climb. This rush<br />\ngood teams, and has had such stars<br />\ngame with the Jays pn,mises in a five or six years between the har- fotel Commodore.<br />\nposted. at the Barn and the Post- featured everything 'that the paint<br />\nas Pease, Koppisch, and others.<br />\nlarge measure to offer all the fight riers of l'ition College zuld Hopoffice. Members of the various or- rush did except the paint.<br />\nFull Strength<br />\nof the -missing Navy game.<br />\nganizations are -requested to be.puncTo Break Ground For<br />\nkins.<br />\nHopkins will present its full<br />\nFootball Rush<br />\nFerris Th(inison, former Friends<br />\nfacilitate<br />\npictures<br />\nto<br />\ntheir<br />\nfor<br />\ntual<br />\nLonger Course<br />\nbecame<br />\nthe<br />\ngreased<br />\npole<br />\nBefore<br />\nstrength<br />\nfor<br />\nSoon<br />\nthe first time since the<br />\nLevering. Hall<br />\nThe; course. at I'Ilion College .is<br />\nSchiiol star, and his fighting Garnet<br />\n.lioth the photographer and the Hul- the \"knit of contention\" between opening game with Richmond, and<br />\nIlomewooditt<br />\nfour<br />\nAccording. to E. A. Schaal ground labaloo Staff in keeping to their<br />\nconsiderably longer than the<br />\nstickmen will invade<br />\nthe classes there used to be --a foot- with such stars as Lyons, Caplan<br />\nkiv 12. The more devout, of the and a half mile course here. It is f,n- the new Levering- Hall will be schedule.<br />\nball rich inAvhich three footballs and Strader in the-fray, they should<br />\nfall,: will reltlenil WI- (Oft ViV- six iidles and is reputed to he glint. hr ,ken the latter part 01 this Wiisik cmo<br />\nPage 3 (\"its, sill! 4<br />\nis Pla'<br />\n'<br />\n‘<br />\nt the ftehl, and the two put tip- a stiff fight, although on the<br />\n,.etPrn<br />\nJr titeshitit- diffiettft7 lila Uantain Kelly dile,: lint or the early part of next. Ni r..Nelidly and With<br />\nelass'es trail ti take two or.all three face of it, Columbia looks good<br />\ntiittd thirty ing contest of two think it will prove as difficult as the son. the treasurer of the university.<br />\nballsis far into the other class's enough to' win.<br />\nIli-hied the hottie ctituse which will, ti1 ii itirse, his izeaten definite wonl from the Scabbard and Blade<br />\nyears ag,, when I It Ilk<br />\nerrittaa as possible before the whisThe game which starts at 2.30<br />\nM. A. Long Contracting :Co. *hat<br />\nMonday<br />\nInitiate<br />\nreputation it I. an All-Arneriran goal he atr advantage 1,ir the<br />\nTo<br />\n.<br />\ntle sounded the end of the rush.<br />\nP. M. will be played at Baker Field,<br />\nin<br />\nstart<br />\nwork<br />\nprepared<br />\nto<br />\nthey<br />\nare<br />\nhonorary<br />\nteam,.<br />\nBlade,<br />\nand<br />\nScabbard<br />\nkeeper.<br />\nIn other colleges the class rush and it is expected andhoped that<br />\ncourse is largely ovet the taiXt few days. It has definitely military society, will, hold-its formal<br />\nJohnnies Come to Town<br />\nThe<br />\nFights after th, tile is welt .as hard surfaces while the Ilonae course been decided that there will be no initiation on Monday, November 12. takes the form of. a tug-of-war, many Hopkins rooters Will attend.<br />\nCoaches Busy<br />\neither on dry land or: through a<br />\nduring it. are iironiiscrl the more is over fields. In order to accustom cerenit my in conoection with, the<br />\nThe new men to be inducted into<br />\nCoach Van Orman and his assistball<br />\nstream.<br />\nSome<br />\ncolleges<br />\nhave<br />\na<br />\nblood-thirsty itt May Pl. 1)esiiite the team to the course over: which I reaking of ground.<br />\nants, George Darley and Dave Kauf• the society are Captain Melvin Em•<br />\nthe good sportsmanship of the John- it will run tomorrow. Kelly has been<br />\ntanagers if the bury, unit adjutant, Lieutenant Wil- pushing rush, in which the two man, will have'ample opportunity<br />\nTIIC lii aid<br />\nclasses<br />\ntry<br />\nto<br />\npush<br />\na<br />\nbig<br />\nball,<br />\nsome<br />\nMesa no Hopkins-St. John's game giving his men daily work-,,ots<br />\nare meeting at the t-11'er H. Driver ; Lieutenant Robert<br />\nY. M.<br />\nto observe - the weak points in the<br />\nof any sorCis complete without a the hard roitcls of Wyman Park,<br />\nlopkins Club this week. and -addi- Bortner. Lieutenant ,James Moore, en or twelve feet in diameter, across Hopkins attack and defense when<br />\ncolleges<br />\ntry to the Blue Jay club<br />\nfree-for-all after it.<br />\ntional plans for the future work Lieutenant George Hill and Captain a goal line. Other<br />\nHambledon Expects Win<br />\nbumps up against<br />\nThe Min-yland game will be playAfter its showing in the Lehigh 'connected with the new building will Hent'y Gibbs., At the public initia- shove sand bags up and down's field. Columbia University's eleven. When<br />\nAred at College- Park this year.<br />\nmatch last Saturday. Coach Ham- be discussed. This Board of Mana- tion, which will take place immedi- • It is the consensus of opinion, ac- one 'considers the dearth of materangements were made with \"Curly\" bledon looks for a Victory in tomor- gers consists of several well known ately after drill- on Monday after- cording to Lockard, that the rush rial which faced the Jay coaches at<br />\nByrd; Maryland footliall and la- row's contest at Schenectady. Schie-- professors at the university and<br />\nnoon, Major' Carl McKinney, new should be changed from last year's the beginning of the season the<br />\ncrosse mentor, last year to have the bel, who came in first in -the Lehigh number of outstanding members of Professor of Military Science and type.. The Student Council has not progress which has been made by<br />\nJayLltWelve come to College Park meet, is expected to make a good the student bogy.<br />\nTactics, will be admitted as honor- yet decided to what kind of rush a comparatively green team is inthis year for the opening of The new showing against Union, though an<br />\ndeed remarkable. On paper the<br />\nary member of Company I,'Second it will be changed.<br />\nathletic field there. Although Hop- injured ankle has prevented him<br />\nJay team does not show up so well<br />\nRegiment, at Johns Hopkins UniMay Annul Regulations<br />\nHopkins Band To Play<br />\nkins-won both games last- year. the from using his full power.<br />\nIn the freshman \"bible require- but on the field it has impressed<br />\nversity. Bars will be presented to<br />\nfinal Olympic play-off with MaryAt Century Monday the newly accepted members at the ment\" it states: \"Freshman regula- everyone with its latent powers.<br />\nEight -men will make the trip inwas<br />\nJuly<br />\nlast<br />\nland at the Stadium<br />\ncluding Captain Kelly, Schiebel, The Johns Hopkins Blue Jay first battalkin review, which will tions will be annulled by victories<br />\nLine-up:<br />\nthe finest exhibition of lacrosse skill Emerson, Onerats, Miller, Waters.<br />\nHopkins<br />\nColumbia<br />\nOrchestra will give two concerts tin take place some time in 'early De-* over the sophomores in any two of<br />\ngiven during the 1928 season.<br />\nRosser, and Loiseaux.<br />\nthe following: football, basketball, Houston<br />\nL.E<br />\nCostigan<br />\ncember.<br />\nTheaCentury<br />\nnight<br />\nat<br />\nthe<br />\nMonday<br />\nJays Strong<br />\nThe 1929 schedule during the<br />\nLT<br />\nTys<br />\nA banquet will follow 'the initia- track, or class rush. Otherwise, the Love<br />\nThe showing which the Jay har- tre, under the auspices of the Cen1928 season is as follows:<br />\nL.G<br />\n(C.) Adler<br />\nperfor- tion. The repast will be served at above regulations: will be in effect Tobin<br />\nOpponent - riers made against Lehigh last week tury management. These<br />\nDate<br />\nNome<br />\nCampbell<br />\ngiven at seven Miller Brothers, where the guests until the beginning of the Christmas Strader<br />\nOlympic A.-S. indicates that Johns Hopkins will mances will be<br />\nApril 6—Home<br />\nR.G<br />\nMakser<br />\no'clock and at nine o'clock. Monday will attend in full regalia. It is ex/ vacation.\" The basketball game is Kegan<br />\nU. of Penn. again have a good cross country<br />\nApril 13—Home<br />\nBleeker<br />\npected that the dinner will be at- wrong. Last year lacrosse was sub- Bialoskorsky ....R.T<br />\nArmy team. The graduation of Captain night will be \"Hopkins Night\" at the<br />\nApril 207-Away<br />\nR.E<br />\nDavenport<br />\nbe in fitting tended by a number of Professors stituted for baseball since baseball Zimmerman<br />\nRan.-Macon ,Gwinn and the injury to Schiebel Century, which will<br />\nApril 27-Nome<br />\nLiflander<br />\nQ<br />\npicture, Varsity, of military science and tactics. was being played no longer as a col- Lyons<br />\n- Rutgers has hurt the Jay teat*: but the pol- with the collegiate<br />\nMay 5—Home<br />\nF.B<br />\nHamilton<br />\nshown there next week. Var- Charles Wyatt, commander of the lege sport and the lacrosse game Caplan<br />\nbeing<br />\nfresh-developing<br />\nin<br />\nteam<br />\nthe<br />\nof<br />\nicy<br />\nSwarthmore<br />\nMay 12—Home<br />\nL.H<br />\nH Scott<br />\nRogers, was unit and president of Scabbard and will be played again this year in- Mills<br />\nSt. John's man and sophomore runners has sity, featuring Buddy<br />\nMay 19—Home<br />\nR.H<br />\nBesore<br />\nBuser<br />\nstead of basketball or baseball.<br />\nBlade, will officiate at the affair.<br />\ncampus,<br />\nPrinceton<br />\nthe<br />\nfilmed<br />\non<br />\nyear.<br />\nthis<br />\nfruit<br />\nborne<br />\nMaryland<br />\n•May 25—Away<br /><br />\nJAY HARRIERS MEET<br />\n, UNION TOMORROW<br /><br />\nnd<br /><br />\nPRICE 5 CENTS<br /><br />\nHOMEWOOD,.BALTIMORE, MD., NOVEMBER 9, 1928<br /><br />\nCLASS LACROSSE GAME<br />\nTO BE HELD THURSDAY<br /><br />\n9, 1928<br />\nTHE JOHNS HIOPICkiS NEWS-LETTER, NOVEMBER<br /><br />\nMS:LITTER<br />\nFouNmen 1897<br />\n$2.00<br /><br />\nElsoseription<br /><br />\nEntered as second-class matter December 3, 1909, at the Poatoffice in<br />\nBaltimore, Md., under Act of Congress November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br /><br />\nUntverstty.Business communications should be addressed to the BUSINESS MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING<br />\nEDITOR; other communications to the EDITOR-IN-CHIEF.<br />\nUniversity 0100<br /><br />\nTelephone<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\nGEORGE E. BANRs, JR., '29<br />\nManaging Editor<br /><br />\nPHILIP W. Mats, '2<br /><br />\nAssistant Managing Editor<br />\nGEORGE GUM?,'30<br />\nAssociate Editors •<br /><br />\nWILMER H. DRIVER, '29<br />\nROBERT S. BAIRD, '30<br /><br />\nRICHARD H. WOOD,'29<br /><br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager<br />\n, HARRY 0. SCHLOSS, JR., '29<br />\nAdvertising Manager<br />\nGEORGE M. GLAZIER, '29<br /><br />\nCirculation Massager<br />\nT. ROBERT MYERS, '29-<br /><br />\nPrinted by The Read-Tayler,Company, Lombard and South Streets,<br />\nBaltimore, Md.<br /><br />\nEDITORIAL COMMENT<br />\nNOBLE IN PURPOSE<br /><br />\nFROM GILMAN TOWR<br />\nBy SumNER L. SlocicroN -----,<br />\nThe street which runs by the campus—familiarly known as Charles<br />\nStreet—holds more interest for me<br />\nthan any other in the city. I think<br />\nit ,might easily and- deservedly be<br />\ncalled the. most important of all.<br />\nSurely no other runs so nonchalantly past poverty and riches, and from<br />\nwaterfront to open country.. Along<br />\nits path of approximately ,fifteen<br />\nmiles lie representatives and vestiges<br />\nof almost every type of life—along<br />\nits patjt from the harbor to the<br />\nJoppa Road. Strangely enough it is<br />\ncut MT abruptly at both ends—a.few<br />\nfeet too far at the southern extremity means a plunge into the head<br />\nwaters of the harbor; a few feet too<br />\nfar at the 'opposite end means a<br />\nplunge down a very steep hillside. A<br />\nday's walk along its entire length<br />\nwould be, to my mind, more of an<br />\nintroduction to--would give a deeper insight into—the great drama of<br />\nlife than any other possible one-day<br />\nactivity. And I should suggest, also,<br />\nthat the southern extremity makes<br />\nthe best starting point, for it leaves<br />\nyou later in the solitudes of nature,<br />\nwhere the previous sights may best<br />\nbe thought oyer.<br />\nThus the typical waterfront scenes<br />\nare encountered first; then the numerous pseudo-suburban homes of<br />\nthe laborers, surrounded by railroad<br />\nyards and factorieS; next through a<br />\nsecond-rate (as some people call it)<br />\nshopping district; past warehouses<br />\nand a few offices; past a market<br />\nwith its varied produce; still farther<br />\non comes Baltimore Street, where<br />\nThe business district centers. From<br />\nhere on Charles Street begins to<br />\nsavor of wealth, with its stores, exclusive shop*, and tearooms—it -is<br />\napproaching sophistication. It runs<br />\npast old and charming city 'residences, hotels, libraries and music<br />\nhalls, town clubs, -and then again<br />\nruns through a series of shops and<br />\noffices. Still farther on are city residences, educational institutions, and<br />\napartment houses. Then Charles<br />\nStreet becomes lined with fine suburban homes, beautiful gardens, and<br />\nfinally ends up amidst country estates.<br />\nThere are men on this street from<br />\nall types. Beggars, millionaires,<br />\nfools, sages—and the common people. As I think of Charles Street<br />\nwith its all--inclusive view of life, I<br />\nwish that‘it could talk. I know that<br />\nall these:different men are seeking<br />\nhappiness in their 1;rarious environments,/ but I cannot tell which—unless it is the fool—comes closest to<br />\nfinding,it.<br /><br />\nThe Only Place to<br />\nDINE and DANCE<br /><br />\neAT<br /><br />\nG•<br />\n0<br />\nL P<br />\nD H<br />\nE<br />\nN A<br />\nA<br /><br />\nMusic Excellent'<br />\nFood Delicious<br />\nPrice Reasonable<br /><br />\nA sturdy new shoe for young men with a<br />\ngenerous measure of style . . . and priced to<br />\nfit a Scotchman's purse.<br /><br />\nAN<br /><br />\n19 Lexington<br /><br />\n111 E. Baltimore<br /><br />\nOpen 11 A. M. to 1.30 A. M.<br />\naseraf;safraseagarglmeonlinPlararalill<br />\n'<br /><br />\n110 N. LIBERTY ST.<br />\n(thru to Park Avenue)<br /><br />\nMan<br />\nifyou isfantio rea//<br />\n- —<br /><br />\nNEW OXFORD GRAYS<br /><br />\nBETHOUN<br /><br />\nSuits Topcoats Overcoats<br /><br />\now THAT a month of the collegiate year 1;as slipped by, it is not<br />\n$28.75 - $38.75<br />\nan inappropriate time to look about the campus and seriously<br />\nconsider this much-discussed question of freshman regulations. At<br />\nthe beginning of the semester, the incoming students were instructed<br />\nWe just received a new<br />\nto wear black socks, green neckties and enamel buttons. They were<br />\nassortment of Oxford Grays<br />\nclasses;<br />\nii<br />\ngoing<br />\nto<br />\nand<br />\nfrom<br />\ntold to use the Gilman Hall tunnel<br />\nin shadow striped, slightly<br />\n, they were ordered to learn the Univ,e4iiiy.29rcgs and yells; they were<br />\nadmonished to speak to upper classidenAraculty members, whom visible overplaids and<br />\nare were numerous other<br />\nthey might encounter on the campuk'<br />\nherringbone<br />\neffects.<br />\nrequirements and rules, all 'set forth quitn:,Ably and lucidly by the<br />\neditor of the Y. M. C.,-.2V-Handbook. The language used was simple;<br />\nDo not fail to see them<br />\nthe ideas were clearly expressed. There was no chance for misunderstanding.<br />\ncaution Money voucher. accepted<br />\nGazing casually about the campus, what do we see? Some freshmen wear green ties, black socks and buttons—others don't. Some<br />\nuse the Gilman tunnel—quite a few don't. Some know the songs<br />\nand yells—many of the others don't. Some speak to fellow students<br />\nWILLARD<br />\nand faculty members—most of them don't. Some obey the regulations<br />\nbut most of the others go their .way rejoicing. There is no. one apTAILORING CORP.<br />\nparently delegated authority to enforce the rules, so \\thy bother?<br />\nFAYETTE ST. AT HANOVER<br />\nIn past years, the transgressing freshman was kept in the path<br />\nFIRST PLOOR.<br />\nof righteousness by the firm hand of the sophomores. If he failed to<br />\nappear at the football game on a preceding Saturday and ventured<br />\non the campus the next Monday, without a t4g, there was a flurry of<br />\nClgarettes<br />\nClub Lounge<br />\npaddles awaiting his arrival. If he failed to speak. to an upper class'<br />\nFree Phone<br />\nwork<br />\nman, there were more paddles. If he failed to get into activities<br />\nand earn his button there were still. more paddles. This constant<br />\nthreat -qf corporal punishment at the hands of diligent and conscien-'<br />\ntious soPfiqmore \"pep committees\" did much to keep the freshman a<br />\nlaw abiding student.<br />\nBut this continual harassing by the sophs had a much more important and far reaching effect. Among the persecuted freshmen,<br />\nthere slowly developed a fraternal feeling' as they suffered together.<br />\nThey fought together in -the frenzied !Attics around the Barn at lunch<br />\nhour; they plotted together for the overthrow of the soph dynasty;<br />\nthey played hard on the lacrosse, football and baseball WI to win<br />\ntheir freedom and, in the spectacular class rushestohey made a last<br />\ndesperate effort to shake off ,the fetters of neckties trtfogiAkS. In this<br />\nsharing together of the trials and hardships of tittAr'froati existence,<br />\nI have looked, during the . past<br />\nMinneapolis, Minn.<br />\n.there grew up among the members a sense of horhogel&amp;y. Their<br />\nfew rains, for some signs of the old Larus &amp; I3ro. Co. April 30, 1928<br />\nclass became a closely knit and compact organization.<br />\nslicker, but -I have looked in , vain. Richmond, Va.<br />\nLast year, however, there dawned a great era of -idealism. HopSomething new has come-to take its Dear Sirs:.<br />\nkins, we were told; would become-the great collegiate Utopia. There<br />\nTwo years ago last Winter I went<br />\nwould be freshman regulations, to be sure, gut there would be no<br />\nplace—something handsomer, no into the Red Lake gold fields in<br />\nCanada. It Was a tough trail from<br />\nenforcement of these rules by the sophomores. - Instead of soph paddoubt, but something without the Hudson,<br />\nover 140 miles of snow and<br />\nwhole<br />\nThe<br />\nfrosh<br />\nconsciences.<br />\npower<br />\nwould<br />\nbe<br />\nenforcing<br />\ndles, the<br />\ncharm of traditibn. The old slitker ice. There were fourteen of us on the<br />\nscheme was indirectly motivated by the Honor System. A freshman<br />\ntrail going in, and frequently at night<br />\npopulartremendous<br />\na<br />\nenjoyed<br />\nsuch<br />\nwould not wear lavender socks because, if he did, he would violate<br />\nwhen seated around a big camp fire,<br />\nity, and was accepted as— such a some one would ask me for a pipeful<br />\nthe spirit of the Honor System. He would not wear a blue and orange<br />\nof<br />\nF,kigeworth. These Canadian boys<br />\nvery<br />\nthe<br />\ncode.<br />\nA<br />\ninfraction<br />\nof<br />\nnecktie because that too would be an<br />\nbosom friend, thatt it no doubt fOls state<br />\nlike our Edgeworth.<br />\n-pretty notion, but did it work?<br />\ndeeply the fickleness of human -1*<br />\nIn four weel,s' time I ran out of<br />\nEdgewbrth.<br />\nI was glad to get 'most<br />\nAt the time of its introduction, the whole scheme seemed ,to upings. Suddenly, without warning, it<br />\nany ohl tobacco.<br />\nper classmen to be rather vague and hazy. Here -was an attempt to<br />\nwas thrust aside—c, make room for<br />\nOne dar,- however, I dropped in to<br />\nenforce a system of freshman regulations by employing the same code<br />\na new and untried acquaintance. But Dad Brown's'tent, a 72-year-old proswhich is applied to so moral and vital a question as honesty on an<br />\npeetor, and seeing a can of Edgeworth<br />\nfeelings—<br />\nsympathetic<br />\nbeyond<br />\nmy<br />\non an improvised table, back there 150<br />\nexamination. A preposterous notion, to say the least. How could<br />\nbeyond my admiration for tradition- miles from the \"steel,\" I perked up at<br />\nthe freshmen, inexperienced in Hopkins customs, be expected to re-once, saying, \"Dad, I'm plum out of<br />\nspect the sacredness of the Honor System when the'samecode was<br />\nregreater<br />\nhave<br />\nstill<br />\na<br />\nal things—I<br />\ntobacco—how's chances for a pipe..<br />\napplied both to examination work and the trifling matters of walking<br />\nfull\"<br />\n\"Help yourself,\" he said. So<br />\ngret for the passing of the slicker: I<br />\npulling my heavy duty pipe from my<br />\non the grass and wearing green neckties?<br />\ncannot afford to buy a new rain gar- pocket, I loaded it with Edgeworth,<br />\nThis year, we are informed by those who should know, freshpacking it in so tightly that I couldn't<br />\nment!<br />\nman regulations are no longer being administered under the Honor<br />\nget the least bit of a draw.<br />\nSystem. There have been reports of the formation of a \"secret vcomI excused myself for a moment, and<br />\noutside to remove about three<br />\nmittee\" for the purpose of searching out offenders. Their methods,<br />\nThere are very few people who stepped<br />\npipefuls<br />\nto put in my pouch. Dad<br />\nno doubt, are those of a squad of secret service detectives or prohisight—and stepped out, saying, \"You're worse<br />\nat<br />\nthe<br />\nnot<br />\nshudder<br />\ndo<br />\nbition agents. This whole scheme smacks of treachery and deceit.<br />\nthan any Scotchman I ever saw.\"<br />\neven the mention-of a snake. Some- Then I confessed. I told him what<br />\n'Idealistic as the present system of enforcing freshman regulations<br />\ntimes I think the Bible story has happened to my Edgeworth—that I<br />\n'may be, it must be classed as a dismal failure. The rules are being<br />\nwas just dying for a smoke, and he<br />\ncreated a traditional, although often understood<br />\nconstan0 broken, many times each day. Many of the frosh seem<br />\nright away. He .said,<br />\nto illtend only a vague idea of the Hopkins songs and yells. They are<br />\nunrecognized dread of the reptile. \"Boy, Edgeworth is mighty scarce.in<br />\nthese<br />\nbut I reckon I can spare<br />\ngiving the various campus activities very mediocre support. Even<br />\nOr perhaps our dread dates farther what'sparts,<br />\nleft of that can. Help yourself.\"<br />\ntheir own clasli meetings, we are informed by freshmen, are poorly<br />\nback, and supports the weird fasciYou can just bet your last nickel<br />\nattended. 'The Class-of 432 seems an extremely listless group, entirethat I guarded this Edgeworth with<br />\nnation<br />\nwhich<br />\nthe<br />\nreptile<br />\nsupposedly<br />\nly lacking in \"pep\" and college spirit. Its members have not as yet<br />\nextreme care until I got back to the<br />\nheld for Eve. But at any rate, 1 \"steel.\"<br />\ncaught the real spirit and significance of University life. They are<br />\nYours very truly,<br />\nstill tangled up in the swaddling clothes of high school'days and still<br />\nwish somebody would eliminate<br />\nC. M. Bahr<br />\nthink in terms of a crowd of preparatory school boys.<br />\nsnakes from the Botanical Gardens.<br />\nThe success of the freshman regulations depends on.ahile, strict<br />\nThe other day I was enjoying a<br />\nenforcement. Such enforcement is not being obtained under the preswalk in the autumn air, surrounded<br />\nent loose system, which the Student Council has seen fit to adopt.<br />\nby the beautiful autumn foliage, unWe stand squarely on this platform—adopt a definite, clear-cut<br />\nExtra High Grade<br />\ntil I came across one of the damn<br />\nmethod of enforcing freshman regulations or else abolish them altogether.<br />\nSmoking<br />\nthings.<br /><br />\nN<br /><br />\nBrown Zug-Grain<br /><br />\nTHE<br /><br />\nThe B. F. Bond Paper Company<br />\n33,55 SOUTH HANOVER STREET<br /><br />\nPRINTING PAPERS -- ANNOUNCEMENTS -- PAPER CUPS<br />\nPAPER CONTAINERS-- SOUTHERN SILK TOILET<br />\nThe House of Standard Lines<br />\nPlaza 8170<br /><br />\nRIDE THE STREET CARS<br />\nTHE MOST ECONOMICAL<br />\nMEANS OF TRANSPORTATION<br /><br />\nUNITED RAILWAYS &amp; ELECTRIC CO.<br />\nOF BALTIMORE<br /><br />\nQUALITATIVE BASE TABLESQUALITATIVE ACID TABLES<br />\nCHEMICAL EQUATIONS<br /><br />\nTobacco<br /><br />\nAll for<br /><br />\n$1.50<br /><br />\nHall fi Twilley Analytic Chemistry<br /><br />\nHow Gold<br />\nProspector<br />\n\"Went Scotch\"<br /><br />\nEdgeworth<br /><br />\nWONDER MOTOR FUEL<br /><br />\nasessamilliammallbemememansamiele<br /><br />\nSold Only<br /><br />\nat<br /><br />\nVv'EANT PRESS, 35 S. Gay St.<br /><br />\nTHE SILVERNIAN<br />\n\"Bigger<br />\nand Better<br />\nThis Year\"<br />\nThe<br />\nPLACE<br /><br />\nDANCE and EAT<br />\n(Open 10.30 A. M.'until Bedtime)<br />\nNO COUVERT CHARGE<br /><br />\n-GUS wants<br />\n823 N. Charles St.<br /><br />\nto see you\"<br /><br />\n(formerly the Silver Slipper)<br /><br />\nCA (Reliable Tip<br />\nConcernirzA<br />\nYOUNG MEN'S FALL SUITS<br />\nIn the daily race of business and pleasure, a suit from the<br />\nHutzler Young Men's Shop will give you a substantial lead<br />\nright at the start.<br /><br />\n$29.50 to $59.50<br />\nTHIRD FLOOR, NORTH BUILDING<br /><br />\nHUTZI.FR. POTHEIt<br />\nHoward, Saratoga and Clay Streets<br />\nTelephone CAlvert 1234<br /><br />\n7,<br /><br />\nTHE JOHNS HOPKINS NEWSLETTER, NOVEMBER 9, 1928<br /><br />\nTHE SOUTHERN<br />\nHOTEL<br /><br />\neMANNIE BERG<br /><br />\nBaltimore's Npwest<br />\n: a9c1<br /><br />\nThe Old Boy Himself\"<br /><br />\n\"A Hotel of<br />\nand mitt.<br /><br />\nTrade Mark Reg.<br /><br />\nCollegiate Furnishings<br /><br />\nEi<br /><br />\nPhone, VErnon,..I<br />\n\"What ts-tmpo,oigie to Others IS<br />\nPose/bre. o Us\"<br /><br />\nTHE RELIABLE WEAVING CO.<br /><br />\nNORTH AVE. MARKET<br />\nNORTH<br /><br />\n.<br /><br />\nMARYLAND AYES.<br /><br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nALSO REPAIR SILK DRESSES<br />\nsee WEST SARATOGA STIIr.:r.A.<br />\nBetween HardSt. and Park Ave.<br />\nBaltimore,Md.<br /><br />\nWE<br /><br />\nHULLABALOO PICTURE<br />\nSCHEDULE<br />\nContinued from Page 1, Cot. 4<br /><br />\nMONDAY<br />\n. A. M.Individual<br />\nto\"<br />\n{ Seniors<br />\n12:20Tr. g.<br />\nC. E. Hail'<br />\nC. E. Hall<br />\n12:20--Inter-Fraternity Board<br />\n12:30—Hullabaloo Staff<br />\n12:40 NEWS-LETTER<br />\n12:50—Black and Blue Jay Staff<br />\n-Gilman Steps<br />\nand Quadrangle<br />\n4:15 P. M.—<br />\nR. 0. T. C. Unit<br />\nArmy Officers<br />\nCadet Officers<br />\nScabbard and Blade<br />\nRifle Team<br />\n_C. E. Hall<br />\n7:15 P. M.—A..A. Board<br />\n{Beta Theta Pi<br />\n7:30<br />\nPhi Kappa Psi<br />\nDelta Phi<br />\n7:45<br />\nAlpha Delta Phi<br />\nPhi Gamma Delta<br />\n8:00<br />\n'Kappa Alpha<br />\nKappa Sigma<br />\n8:15<br />\n-,1A1pha -Tau Omega<br />\n(Delta Upsilon<br />\n8-30<br />\n1Alpha Kappa Phi<br />\n(Omicron Kappa Omicron<br />\n8-45<br />\nDelta Gamma Theta<br />\nTUESDAY<br />\n9:00 A. .<br />\nIndividual<br />\n2<br />\n,<br />\nSeniors<br />\n12:20 P. M.<br />\nC. E. Hall<br /><br />\nGilman Steps<br />\n12:30—Senior Class<br />\n12:45—Junior Class<br />\nHomewood<br />\n4:15 P. M.<br />\nFootball Team<br />\nCross Country Team<br />\nC. E. Hall<br />\n, Sigma Tau Delta<br />\n7:30<br /><br />\nAll ready for the whistle<br />\nor the wind<br />\nV<br /><br />\n13,<br /><br />\nYou know the big thrill<br />\njust before the whistle<br />\nblows. Be prepared to en.<br />\njoy all the big games this<br />\nyear in a smart.lookink<br />\nAlligator. Warnithiand<br />\nstyle for the brisk,windy<br />\n10<br />\ndays,and absolute protection,no matter how hard it rains. Every<br />\nAlligator is correctly modeled in the<br />\nMLA advanced style and all Alligator<br />\nfabrics are a revelation in softness,<br />\nlight weight and durability. Try one<br />\non. Get the feel of it and you'll appreciate the big difference. Alligators are<br />\nsold only at the best stores and retail<br />\nfrom $7.50 to $25.00. See the new<br />\nAlligator Aviation model at $10.00.<br />\nThe Alligator Company, St. Louis, Mo.<br /><br />\n•<br /><br />\nfAlpha Nu Tau<br />\n7:45•<br />\n'1Charles Carroll Club<br />\n(Phi Alpha<br />\n,<br />\nPeabody Book Shop<br />\nNewspapers<br />\n8:00<br />\nCommercial<br />\n1Phi_.Epsilon Pi<br />\nBooks<br />\nWork<br />\n13'N. Charles<br />\n• Established 1850<br />\nfTäti-Aa Omega<br />\n815<br />\nIota Larfibda Phi<br />\nThomas e..? Evans.<br />\nALL NPV.1<br />\n830•(Phi Sigma Delta<br />\nOpen<br />\n.<br />\nPublications<br />\n1Pi Lambda Pi<br />\nPrinting Company<br />\nEvenings<br />\nLess 10%<br />\n1506-1508 Guilford Avenue<br />\nWEDNESDAY<br />\n9:00 A. M.<br />\nIndividual<br />\nBaltimore, Md.<br />\nto<br />\nSeniors<br />\n.Drinkwater, John: Program of Eternity., Byron ($5.00), $2.50.<br />\nPhone VErnon 5691<br />\n12:20 F'. M.<br />\nC. E. Hall<br />\nShelley: His Life and Works by Wal. Gilman Steps<br />\nter Edwin 'Peek. ($12.50), $6.25.<br />\n12:30—Sophomore Class<br />\nYELLOW CAB STANDS<br />\n12:45—Freshman Class<br />\nAlligator Agents<br />\n•<br />\nAT<br />\nC. E. Hall<br />\nALBERT<br />\nW.<br />\nRHINE,<br />\nINC.<br />\nTHE<br />\nHomewood Field<br />\n4:00 P. M.—A. S. M. E.<br />\n35th Es' St. Paul Sts.<br />\nClothiers and Haberdashers<br />\n4:10 P.M—A. S. CE.<br />\n538 N. Calvert St.<br />\n31st fi St. Paul Sts.<br />\n4:15 P. M.—Electrical Club<br />\n17 E. BALTIMORE ST,<br />\nSafe and Efficient Service<br />\n4:30 P. M,,—Tudor and Stuart<br />\nNo Charge for Extra Passengers<br />\nTHURSDAY<br />\n'PHONE<br />\n9:00 A. M.<br />\nIndividual<br />\nVERNON 1 2 1 2<br />\nto,<br />\nSeniors<br />\n12:20 P. M.<br />\nPAINTS and VARNISHES<br />\nFOR A<br />\nC. E. Hall<br />\nC. E. Hall<br />\nYELLOW •CAB<br />\n12:20—Cotillon Club<br />\n12:30—Barnstormers'<br />\n12:40—Y. M. C. A. Council<br />\n12:50—Debating Council<br />\nTHE PIAVT<br />\nNEW LIFE<br />\n2 P. M.<br />\nIndividual<br />\nPOWER FUEL '<br />\nFOR MOTORS<br />\nSPEAKING OF SPORTS<br />\nis working its *ay through college<br />\nto<br />\nSeniors<br />\nMen in every class seem to favor it. Warmth without weight—<br />\nC. E. Hall<br />\nChemically pure and technically 5 P. M.<br />\n\"STANDARD\" MOTOR OIL<br />\nin-between topcoat and overcoat<br />\nperfect football probably will not be<br />\nJ. H. FURST CO.<br />\nseen in the Stadium tomorrow. But<br />\nPRINTERS OF<br />\nThe Measure of Oil Value<br />\nthe boys who.are risking their lives,<br />\nPhilological and Scientific<br />\nif not their fortunes or their sacred<br />\nPublications<br />\nhonor, for Navy and Michigan on<br />\nSTANDARD OILJCOMPANY OP N. J.<br />\n211,213 EAST BALTIMORE ST.<br />\nthe municipal turf will know they 23 S. HANOVER ST. BALTIMORE<br />\nhave been in a fight.<br />\nThat is to say, the Midshipmen<br />\nand Wolverines tomorrow will be<br />\nrepresented by sophomore teams of.<br />\nbright young boys just trying very<br />\nTHE TRENCH COAT, $12.50<br />\nhard to get along. They *ill make<br />\nA lightweight, putty-colored, Watetproofed coat that has plenty of<br />\n'<br />\nsome mistakes, and they will ,be<br />\ndash and swagger. Trimmed with leather buttons and buckles.<br />\ncriticised quite .justly for their iack<br />\nThe newest thing out.<br />\nof football acumen, but they are not<br />\nSecond Floor •<br />\nunlikely to put on a good show.<br />\nLa,st V week, MOigan came<br />\nthrough with an inspiring victory<br />\nover Illinois. This, it is true, was<br />\nthe first triumph of the Yost outfit,<br />\nbut the team indicated it may have<br />\nlatent intelligence, and some ability'.<br />\nNavy made a stmilar showinFIWo<br />\nweeks ago when it surprised the ex.perts by defeating Penn,<br />\n•<br />\n• With the theatfes running well,<br />\nChristmas not so far off, and lost<br />\nelection bets to pay, we hesitate to<br />\nadvise our readers to invest six dollars in two tickets and'another in a<br />\npint of new gin. But if you have<br />\n4e)<br />\nit,<br />\nafternoon may be pleasantly<br />\nspent-at the Stadium.<br /><br />\nALLIGATOR.<br /><br />\n•<br /><br />\nTRADE.,AARK REG. U. S. PAT. OFF.<br /><br />\n{<br /><br />\nogre<br /><br />\nIIE IR if co.<br /><br />\nCLOTHES<br />\neNIIDWATE<br /><br />\nESSO<br /><br />\n$40 to $60<br /><br />\nSmart Collegians Are .Weanng<br /><br />\nSTEWARTEIGD.<br />\nAfter the Dance<br /><br />\n:II:44,<br /><br />\n•<br /><br />\n,4<br /><br />\n• T91. EDIEGIS<br /><br />\n1815-17 .North Charles St.<br /><br />\nitia<br /><br />\n41.<br /><br />\ncDe)<br /><br />\nVANDERBILT HOTEL<br />\n•<br /><br />\n.07VE W TOR.K.<br /><br />\nc7hily Jour/it c5treet oast at O'arit Avenue)<br /><br />\nC21Anounco_9<br />\nunday 6vening eoncerti...)<br />\nACM<br />\nin,the DWA<br />\nDISTINGUISHED ARTISTS<br />\nD1NER-DE-LUXE—$3.00 PER PERSON<br /><br />\nIn Addition<br />\non Tuesday, Wednesday,Thursday,<br />\nFriday and Saturday Evenings We<br />\nare having<br /><br />\nDinner Dances<br />\nin the Della Robbia Room. Dancing from 7 oo to 12:00 including<br />\nDinner at $3.50 percover.<br />\nMusic by the Della Robbia Orchestra. vening<br />\nA1'1' Dress required.<br />\nWsx.rots H. MuuntAt-t.<br />\nMamma<br /><br />\n• Tomorrow .the University. of<br />\nMaryland Ravens make their apinial<br />\nexcursion to New Haven. The team<br />\nenjoys the ride thoroughly every<br />\nyear, and the Yale boys enjoy the<br />\nrecreation.<br />\nAlthough \"veritaa vos liberabit,\" a<br />\nsense of loyalty to this University<br />\nprohibits any, comment on the Blue<br />\nJays' visit to Columbia's ball park<br />\ntomorrow, except to wish the local<br />\nteam a pleasant journey.<br />\nYou may say that it is impossible<br />\nfor an American to understand a<br />\nFrenchman anyhow, and that all<br />\nFrenchmen are therefore a bit unbalanced, and somebody will always<br />\nbe broadminded enough to disagree.<br />\nBut it is difficult to follow the latest<br />\nreasoning of the French Tennis<br />\nAssociation.<br />\nThe French government has recently levied a 22 2 per cent tax on<br />\nthe gross receipts of tennis matches,<br />\nlooking forward to collecting a very<br />\nconsiderable sum at the covered<br />\ncourt championships. The French<br />\nTennis Association was very much<br />\nannoyed at this, and its leaders put<br />\ntheir heads together with the following result:<br />\nThe championships must be held.<br />\ni<br />\nlNt<br />\n,<br />\nif there are no spectators, there<br />\nContinued on Page' 4, col. 4<br /><br />\nLife has its cheering sections, too...<br />\nEntire industries are ready to rise in<br />\nhomage to men who will lead the way<br />\nthrough the riddles of physical and<br />\nfinancial phenomena, of chemical and<br />\ncommercial mysteries. The world and its<br />\nworkers need,notjust one captain to<br />\ninspire victories, but a whole host.<br />\nThere is no limitto the size of the<br />\nteams a man can command; no<br /><br />\nlimit to the importance of the position he<br />\nplays; no limit to his eligibility save his<br />\nown desire to make and retain a place<br />\nfor himself.<br />\nWho will do for the telephone making of the 1950's what its leaders<br />\nare doing today—if not the men of<br />\nthe 1930's who are just now ,entering the field?<br /><br />\nark<br />\nSINCE 1882 MANUFACTURERS. FOR THE BELL<br />\nSYSTEM<br /><br />\n9, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER<br /><br />\nSECRETARIES AND LIBRARIANS<br />\nACTIVE IN PAST CAMPAIGN<br /><br />\nLADIES' HOSE, UNDIES, HANDKERCHIEFS<br />\nMEN'S<br /><br />\nHOSE,<br /><br />\nCANDIES<br /><br />\nTIES,: HANDKERCHIEFS<br />\n. COOKILLS<br /><br />\n, JELLIES<br /><br />\nWhy Buy Elsewhcre When You Can Buy Here for Less<br /><br />\n, Christmas is Near<br /><br />\nTHE COLLEGIATE SHOP<br />\nAnnounces its Opening on November th<br />\n2446 N. CHARLES ST.<br />\nHOtneWood $Mil)<br /><br />\nOpen Every Evening<br /><br />\nHelp the ',rim (Goucher) and the boys (Hopkins) tohelp fheinselves.<br />\nStop in to see their display of hand-made novelties and Anme-made dainties<br /><br />\nHERE IS THE PLAN<br />\n• Christmas is almost here, why _riot make some extra pin money<br />\nfor a new coat, hat, etc, by bringing some homemade article to be sold<br />\nat the Goucher-Hopkins Exchange at 10% commission. Probably your<br />\nMothers and Sisters are helping you through College, therefore, why<br />\nnot have them make some candy, cakes, or, in fact, anything. All helps<br />\nand everybody will be out to help Goucher and Hopkins students to<br />\nhelp themselves. Bring your articles now and remetnber the articles<br />\nthat are least expensive sell the hest.<br /><br />\nHOmewood 5040-8041<br />\nYour elothee will always have that neat appearance if you will let us do your<br />\nCLEANING, DYEING, PRESSING AND REPAIRING<br />\n\"One Trial Will Convince You\"<br /><br />\nPARISIAN TAILORING CO.<br />\n346 E. 33RD STREET<br />\nCorner University l'arkWAY,<br /><br />\nThe MAY Co.<br />\nA Modern., Store.,<br />\nFor Modern,<br />\nYoung Men.,<br /><br />\nTYPEWRITERS, ALL MAKES<br /><br />\nCORONA<br /><br />\nROYAL<br /><br />\nher<br />\nPolitical strife of the campaign porter attempted .to put to music<br />\nHoohas not been confined to the \"Barn\" composition hilt tai sooner did<br />\nwhen<br />\nand the male element On the campus/ ver's friends hear the words<br />\nto the<br />\nUp. in Gilman, Dr. French's office they jetaliated with a gem<br />\nname<br />\nforce of the fairer sex has been same. tune calling Al every<br />\nconducting a heated campaign of.its within the limits of respectability.<br />\ntwo<br />\nown Daily political debates have— The carlools' depicting the<br />\naccompauied the tapping of type-' candidates were worthy of Edmund<br />\ncountenance<br />\nwriter keys imul high-pitched femi- Duffey. Herh's round<br />\nnine voices have extolled the virtues was on one side of the p.aper White<br />\nof \"Al\" or boasted of Herbert's si- on the other a Hoover artist caricatured Al with his brown derby<br />\nlent virtues.<br />\nTheir campaign, however, also perched above his grinning faye and<br />\nhad its more popular phase. 'Cam- a caustic \"Hec! Ha!\" written alongpaign cartoons and campaign songs side:<br />\nhave been exchanged between the ,Chairmen Work and Raskob<br />\nwarring fac'tions, in addition-to Vari- have evidently overlooked these poous uncomplimentary slurs regard- tential campaigners. Perhaps a Mabel Walker Wihlebrandt is in the I<br />\ning each candidate. .<br />\nUnfortunately, -an aversion to making under —Dr. French's very<br />\nbursting into print on the part ,if eyes.<br />\nthese feminine rabble-rousers pre'SPEAKING OF SPORTS<br />\nvents us from printing the masterContinned from Page- 3, Col: 3<br />\npieces composed to further both the will be no receipts. If there are no<br />\ncauses of Herb's and Al's 'cam- receipts, there will be no tax. Therepaigns. Reaching feverish excite- fore, we bold the championships but<br />\nment on the day before eleotion, we wilt keep.the spectators out.<br />\nSmith's partisans produced a gant!- The logic, pf cottise, lfliettect<br />\npaign song extolling their candi- and imainiviierable. The only diffidate's virtues and- not in the least cultY is that the French Tennis As- 1<br />\ncomplimentary to \"Lord Hoffer.\" sociation lost 77,<br />\n4 per cent of the<br />\nSidewalks receipts which would have been re,<br />\nTo the tune of<br />\nof New York,\" a valiant Smith sup- ceiVed, and Messieurs Cochet, BorOtra, .and Brugnon refusOd to consPete, ostensibly, because,they had no<br />\ndesire iefo play before empty seats,<br />\nCOSMOPOLITAN CLUB<br />\nbut really, according to the whisperDANCE NEXT FRIDAY<br />\ners, because the Association had no<br />\nThe Intercollegiate COstm•fund to pay Their \"expenses.\"<br />\npolitan Club will give a ma:•<br />\n•<br />\nquerade dance in the C. E.<br />\nIf is not often that d hole in one<br />\nI fall on Friday, November 16,<br />\nmeans anything. Or rather it means<br />\nfrom 9 to 12 P. M.•<br />\nso much just in itself, that no one<br />\nReal cosmopolitan atmosbothers to look at the total score<br />\nsphere will be created by cosof the player who has made an ace..<br />\ntomes, dances,,,decorations, and<br />\nThe freak shots seldom occur in.<br />\ntournament golf, and when they do<br />\n. crancing by the represenia..solo<br />\ntives• of many- counties.'Prizes<br />\nthey usnally have ni)--result.will be awarded for the best<br />\nThis week, however, a young bus<br />\nand worst costumes:<br />\nMess man named Horton Smith<br />\nTickets may be secured at<br />\n(:‘,Un $ipay by Wing out in (me at•<br />\n• the door or .from any members<br />\nOklahoma City in an open tournaof the Cosmottlitan<br />\nment. I lc finished just (al(' stroke<br />\n1•,(1 Dudley, 'II 1.1))4(4)(1,<br />\nahead<br />\nCLASS lactosse 'game etc ....<br />\nanother pro.<br /><br />\nOvl. W. LUCY &amp; CO.<br /><br />\nSELL CHEVROLETS<br />\nfound it quite profitable<br />\nCollege Students have frequently<br />\nto employ their spare time<br />\nfinancial problems of many ambitious<br />\nSelling Chevrolets has solved the<br />\nappeal to you—See Us at once.<br />\nsuggestion<br />\nthis<br />\nShould<br />\nCollege Men.<br /><br />\nf(r<br /><br />\nOldest and Largest Corona Dealers in State<br />\nHAMMOND<br /><br />\nUNDERWOOD<br /><br />\nFre<br /><br />\nCOrSA<br />\n. SALES.<br />\nCorner<br />\nSoutheast<br /><br />\nDeve<br />\nthe Cal<br />\nfavoral<br />\nmeeting<br />\nsembly<br />\nditional<br />\nsecured<br />\ntotal su<br />\ngradual<br />\nnificant<br />\nfacts.<br />\n- plies t<br />\ngained<br /><br />\n43rd Street West of Broadway<br />\nNEW YORK CITY<br /><br />\nIn<br /><br />\n1000 OUTSIDE ROOMS<br />\nand Other Activities<br />\nthe Center of Theatre District<br />\nIIIGHER<br />\nDAISY RATES—NONE<br /><br />\n(For One-52.00<br />\nFor Two— 3.00<br />\nRooms with Running Water . .<br />\nOne— 2.50<br />\nRooms with Connecting Shower.( For<br />\nRooms with Private Shower. .<br /><br />\n:\"<br />\n4<br />\nF:-Twe— 3<br /><br />\n•<br /><br />\nMy father said—<br />\n\"John Hancock is a great name;<br />\nLife insurance is practically indispensable.\"<br /><br />\nThat time, at least, he was right.<br /><br />\nLIFE INSURANCE COMPANY<br />\nor BosTom. MASSACNUS1,15<br /><br />\nProducers of<br /><br />\nGTHE IIEWSHLETTER<br />\nThe., READ-TAYLOR co.<br />\n.Lombard &amp; South Sts<br /><br />\nFor Sweaters, Trench Coats, Slickers, Sporting Goods,<br />\nArmy Uniforms and Supplies, also Aviation Outfits, head<br />\nyour airship and land at thq<br />\nOUTING SUPPLY CORPORATION<br />\n21 North Liberty Street<br /><br />\n_<br /><br />\n-<br /><br />\nThe season's styles in neckwear are the key to a. man's<br />\ndress .. . they give that touch of persond effectiveness.<br />\n\"The Store of Standard Values\"<br /><br />\n. M.c iPHERSON'S<br />\nEstablished 1862<br />\n• .<br />\nEast Baltimore Street<br /><br />\nOVER—FIRST DOWN<br />\nWith AMOCO•GAS in the tank,<br />\nyou're assured of that determined<br />\npower and drive that carries you over<br />\n—in high.<br /><br />\nfail to babble of the marvelous echoes that reverberate so obligingly from peak to peak.<br />\nBut no such phenomenon matches a certain<br />\necho that keeps circling this whole mundane<br />\nsphere. It is the best-known cigarette slogan<br />\never coined — the Chesterfield phrase \"They<br />\nSatisfy.\"<br />\nOriginated to describe a unique coupling of<br /><br />\nFigur<br /><br />\nHotel Times Square<br /><br />\naAn.echo that circles<br />\nthe glob6<br /><br />\nSightseer's returning from the Alps never<br /><br />\n$10,<br /><br />\nMOUNT ROYAL AVE. at McMECHEN ST.<br />\nTelephone: MAdison $355<br /><br />\nCA thought of today--<br /><br />\n11<br /><br />\nCAGE<br />\nGOOE<br /><br />\nONES CHEVROLET<br /><br />\n104 WEST FAYETTE STREET<br />\nTelephone CAlvert 5902<br /><br />\nVOL.<br /><br />\nqualities seemingly opposed-7\"ti? 're mild,and<br />\nyet, they satisfy\"—its desciirive accuracy was<br />\ninstantly perceived. Today it echoes and reechoes wherever cigarettes are smoked:<br />\n\"Satisfacen —Bssatisfont...THEY SAT/SFY!\"<br />\nAnd rightly enough,for Chesterfields are mild<br />\n—and they DO satisfy ... and what more can<br />\nany cigarette offer?<br /><br />\nEST1EVIFI EILID<br /><br />\nMILD enough for anybody.<br />\n.. and yet.. THEY SATISFY<br /><br />\nLIGGITT• WIWI TOBACCO CO.<br /><br />\nas yet<br />\npressed<br />\nrealize<br />\nwithhel<br />\nting th<br />\nthe •cag<br />\n_ ized.<br />\ncently s<br />\nof the<br />\nwhich,<br />\nthe stu<br />\nnally, t<br />\nit dem(<br />\n• for the<br />\nas the<br />\ncerned,<br />\nalone a<br />\nceied<br />\nfrOm ti<br />\nfar the<br />\nfying a<br />\nimpres:<br />\nto the l<br />\npresent<br />\n.of the<br />\nlumbia<br /><br />\nC.<br />\nDesp<br />\nprogres<br />\nnation<br />\nTITe pr<br />\nTruste(<br />\nsignifie<br />\nginning<br />\nplans<br />\nare -in<br />\non the<br />\nof offic<br />\nalso th<br />\nunanim<br />\n• ineetn4<br />\ndiscuss,<br />\napprovi<br />\nThe<br />\nWill cc<br />\nFxecut<br />\nanswer<br />\nly, lett(<br />\ndent to<br />\ns•-•<br />\ngiving<br />\nSo far,<br />\nin very<br />\nas yet<br />\nso at c<br />\nis desir<br />\nter by t<br /><br />\nt th<br />\ner;capt<br />\ndressed<br />\nthe cag<br />\ngive hi<br />\nthat (hi<br />\npositior<br />\nit. Ha<br />\nto shoi,<br />\ntangiblt<br />\nsupport<br />\ner told<br />\nHopkin<br />\ned and<br />\nbeen c<br />\nsupport<br />\nwould<br /><br />"}], "field_media_file": [{"target_id": 38302, "display": null, "description": null, "target_type": "file", "target_uuid": "4c22418b-e430-44d5-9abc-d4c770b71571", "url": "http://digital.library.jhu.edu/system/files/2022-03/13340-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13340, "target_type": "node", "target_uuid": "023ab884-e12d-424d-920f-91280302c25f", "url": "/node/13340"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "dca2f42f-5197-4a55-87e4-157b0f18b730"}]}