{"mid": [{"value": 40821}], "uuid": [{"value": "d69a78bd-83c4-4efa-9f0b-ec3577c24494"}], "vid": [{"value": 40821}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T20:25:48+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "14554-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T20:25:48+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T20:25:48+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "LAcRosise 185<br />\nVOLUME .89 NUMBER 20LAX<br />\n<br />\nA Special Supplement to The Hopkins News-Letter<br />\n<br />\nisaiNNINr•<br />\n<br />\nMARCH 8, 1985<br />\n<br />\n,7NIMMIk<br />\n<br />\n\f2LAX/MARCH 8, 1985<br />\n<br />\nLACROSSE 185<br />\n<br />\nTo Our Readers:<br />\n<br />\nTABLE OF CONTENTS<br />\nContents, Table of<br />\nBlue Jay Team Report<br />\n<br />\nPage 2<br />\n<br />\nThe 1985 Blue Jays<br />\nBlue Jay Schedule Analysis<br />\n<br />\nPage 4<br />\nPage 6<br />\n<br />\nNational Schedule Analysis<br />\n<br />\nPage 9<br />\n<br />\nPage 3<br />\n<br />\nTomorrow's Game<br />\n<br />\nPage 10<br />\n<br />\nFreshmen<br />\n<br />\nPage 12<br />\n<br />\nAn Interview with Coach Roy Simmons, Jr. . . . .Page 13<br />\nPage 14<br />\nPenn Lacrosse Report<br />\nPage 15<br />\nSyracuse Lacrosse Report<br />\nThe Championship Teams of '50 and '84<br />\n<br />\nPage 16<br />\n<br />\nA Freshman's Guide<br />\n<br />\nPage 19<br />\n<br />\nThe idea of a special lacrosse insert was born in<br />\nthe fall when it was decided that the national champion Blue Jays should receive some of the coverage<br />\nthey deserve. The result is this special issue, which<br />\nis, to our knowledge, the most extensive of its kind<br />\nin News-Letter history. \"Lacrosse '85\" would not<br />\nexist, however, were it not for the assistance of<br />\nmany people.<br />\nWe thank Coaches Don Zimmerman and Roy<br />\nSimmons, Jr., for their help in our coverage of each<br />\nof their teams. Jerry Shifflett of \"In the Crease\"<br />\nprovided scores of photographs for our use. We<br />\nespecially thank Mr. Don Fritz for his gracious efforts in recalling a bygone era.<br />\nWe are most indebted, however, to the members<br />\nof the News-Letter staff for their tireless assistance.<br />\nEditor Eileen Fitzgerald and Managing Editor<br />\nKathrin Engisch were supportive throughout. We<br />\nthank Maria Mitchell, Sharon Fischman, and Brad<br />\nHandler for their technichal assistance. Larry Volz<br />\nand Jess Bunshaft donated valuable time for the<br />\nphotography.<br />\nWe are grateful to our contributors Craig Caplan<br />\nand Adam Warner for their skill and punctuality,<br />\nto Skip Collins for his sleepless hours, and to<br />\nGregory King and Mary Ginder for their constant<br />\nenthusiasm.<br />\nFinally, we would like to thank Chuck Maute,<br />\nBusiness Manager, Tammy Huck, Production<br />\nManager, and David Epstein, reporter extraordinaire. Without their time, effort, and dedication,<br />\nthis issue would be a shell of what it is.<br />\n<br />\nHoward Bregman<br />\n<br />\nDavid Brengel<br />\n<br />\nSports Editors<br />\nLacrosse '85 is a special supplement to The Hopkins News-Letter which is published by the students<br />\nof The Johns Hopkins University. Editorial and business corespondence should be directed to Box 1230,<br />\nThe Johns Hopkins University, Baltimore, MD. 21218. Telephone (301) 338-7647. Business hours are<br />\nTuesday and Wednesday, 1-5 p.m. Circulation: The Hopkins News-Letter 6000; Lacrosse '85 15000.<br />\n<br />\nCover Photo: Jerry Trout Lacrosse Magazine<br />\n<br />\nP.J.'S PUB<br />\n<br />\nHOME OF BLUE JAY LACROSSE<br />\nSEE YOU BEFORE & AFTER<br />\nTHE GAME<br />\nALL GAMES SHOWN<br />\nLIVE ON HOME TEAM SPORTS<br />\n<br />\n1984 NCAA CHAMPS<br />\n<br />\nA<br />\n<br />\n\fLACROSSE.'85/3LAX<br />\n<br />\nThe Blue Jays<br />\n<br />\nJays' Quest For A Sixth Title Begins Tomorrow<br />\ntogether. They pose a tremendous threat to our opponents because if you shut one off the other can still<br />\nWith a convincing 13-10 victory over Syracuse in the put you away.\" Krumenacker and Dressel totalled 37<br />\n1984 Division I Championship Game, Head Coach goals and-31 assists between them in 1984.<br />\nJuniors Steve Mutscheller and Chris Schreiber will<br />\nDon Zimmerman and his Blue Jays capped a perfect<br />\nstay together and comprise the second line along<br />\nalso<br />\nchampionship<br />\nfirst<br />\nits<br />\nwon<br />\nHopkins<br />\n14-0 season as<br />\nwith<br />\njunior Dave Castle. Both Mutshceller and<br />\ntitle<br />\nthree<br />\nprevious<br />\nthe<br />\nlost<br />\nhad<br />\nJays<br />\nThe<br />\nsince 1980.<br />\nof<br />\npossess the potential to have excellent<br />\ndanger<br />\nSchreiber<br />\nin<br />\nwere<br />\nand<br />\ngoals<br />\nfour<br />\nof<br />\ntotal<br />\na<br />\ngames by<br />\ngraduating a senior class which had not been part of seasons, but Castle's abilities are rather unknown, as<br />\na championship squad, for the first time in decades. he played little during the second half of the 1984<br />\nIn addition, Zimmerman became the first rookie coach campaign.<br />\nStarting on the third midfield line will be sophomore<br />\nto lead his team to an NCAA crown.<br />\nSurprisingly, Hopkins will face Syracuse again, Jack Crawford and freshmen John Dressel and Joe<br />\ntomorrow, as the Blue Jays open the 1985 lacrosse Rzempoluch. All three have looked promising during<br />\nseason. The game, scheduled to start at 2:00 p.m. on the preseason and it is possible that one of them may<br />\nHomewood Field, will be the third meeting of these join either the first or second unit. Still this unit will<br />\ntwo teams since the 1983 Championship Game which have only limited playing time. \"They won't play as<br />\nmuch as the first and second lines, and will only spell<br />\nthe Orangemen won, 17-16.<br />\nthan<br />\nwhen necessary,\" Zimmerman said.<br />\nstronger<br />\nthem<br />\nbe<br />\nto<br />\nappear<br />\nJays<br />\nBlue<br />\nOverall, the<br />\nsignificant<br />\ndepth at midfield will be a definite advanHopkins<br />\nsuffering<br />\nattack<br />\nthe<br />\nonly<br />\nwith<br />\nyear,<br />\nlast<br />\nlosses. Hopkins returns three first team All-Americans, tage as the season wears on and especially against the<br />\nincluding a Division I Most Valuable Player at mid-, Blue Jays' tougher opponents. With the current emphasis on running a transition game, three good midfield and in the goal, and two second teamers. In<br />\nlines is almost a must; ask Syracuse Head<br />\nfield<br />\nl<br />\nlose<br />\nand<br />\nstarters,<br />\nsix<br />\nthe Jays retain 26 lettermen and<br />\nCoach Roy Simmons, Jr. about the imporLacrosse<br />\nsquad.<br />\nyear's<br />\nbut nine members of last<br />\nHopkins' having three lines to the<br />\nof<br />\ntance<br />\nCraig<br />\nsophomores<br />\nstart<br />\nwill<br />\nOn attack, Zimmerman<br />\nBubier and second team All-America Brian Wood and Orangemen's one and a half during the 1984 Chamjunior Bill Single. Freshman Mike Morrill and junior pionship Game. Said Coach Zimmerman,\"I believe<br />\nClarke Thielemann may also start during the course games are won and lost at midfield. Depth at midfield<br />\nis always the key. Having three lines allows you to rest<br />\nof the season.<br />\nWith the graduation of starters Peter Scott and cap- your players so they can be fresh at the end of the<br />\ntain Willy Odenthal, the attack unit will lack game ex- game, when its most important.\"<br />\nAlso crucial to the Blue Jays' success this year will<br />\nperience. Scott's role as the feeder will be a difficult<br />\nthe play of senior faceoff specialists Greg Matthews,<br />\nbe<br />\nmay<br />\noffense<br />\nquick-cutting<br />\nJays'<br />\nthe<br />\nand<br />\nfill,<br />\nto<br />\none<br />\nLee Davidson, and Glenn Fidje. Together and insuffer somewhat during the first several games.<br />\nRegardless, Zimmerman is confident that there will dividually they won greater than 60% of their faceoffs<br />\nbe no problems. \"I'm a firm believer in giving the last season and were instrumental in Hopkins' ability<br />\ncrease a good look,\" he said. \"If Wood can put the to control the tempo of its games. Their control of the<br />\nball on the money, it makes sense to go inside to the ball will be one of the keys to shutting down fastbreaking Blue Jay opponents such as Syracuse and<br />\ncrease.\"<br />\nWhether the attack will again produce three of the North Carolina.<br />\nTwo starters return for the defense, but as Coach<br />\nteam's top four scorers, as in 1984, is difficult to determine, as the scoring balance will be affected greatly Zimmerman has indicated, the remainder of the unit<br />\nby the team's style of play. \"It's hard to say,\" stated lacks game experience. Much of the responsibility for<br />\nZimmerman.\"When you push the ball like we did last stopping the opposition rests with first team Allyear, you get a lot of goals from the attack. That's America John DeTommaso. Only a junior, DeTomtypical of a transition game. We hope to be as suc- maso can reduce almost any attackman in the nation<br />\nto a mere observer. Unfortunately, that is not enough,<br />\ncessful moving the ball this year as last.\"<br />\nLosses from the midfield, the most talent-deep unit, and the Blue Jays will be counting on senior tri-captain<br />\nwere minimal, although honorable mention All- Guy Matricciani to keep the crease clear. A starter last<br />\nAmerica John Tucker will be sorely missed. Tucker's season, Matricciani will have to even out his erratic<br />\nall-out play and punishing checks often inspired the play, as Hopkins has too many powerful opponents<br />\nJays and Zimmerman is \"hoping that somebody rises to allow for defensive lapses. The third spot will be<br />\nto the surface and gives us that play.\" He pointed to filled by junior Dan Pallace, who looked impressive<br />\nsophomore Jack Crawford and junior Chris Schreiber on the rope last season and is a steady, reliable<br />\nperformer.<br />\nas potential candidates.<br />\nDel<br />\nMidfielder<br />\nComprising the rope unit will be junior Brad<br />\nOutstanding<br />\nThe first line will return<br />\nJohn<br />\nMcLam<br />\nand sophomores Steve Mitchell and Chris<br />\nAll-America<br />\nteam<br />\nsecond<br />\nDressel and<br />\nKrumenacker. Sophomore Bruce Chanenchuk will Wickwire. Zimmerman made good use of this line last<br />\nyear, and with a very good stickhandler in McLam,<br />\ngain the third position.<br />\nWhile both Dressel and Krumenacker are capable he will be able to use the rope often and still be able<br />\nof leading their own lines, Zimmerman feels that by to push the ball upfield quickly. This line's game time<br />\nteaming them, they can be even more dangerous. \"By may be limited, however, by Zimmerman's desire to<br />\nthe end of last year, they were playing very well keep his middies in if they can handle the job.<br />\n<br />\nby David Brengel<br />\n<br />\nReturning in the goal is All-Everything Larry Quinn.<br />\nThe spectactular play of this senior tri-captain last<br />\nseason is generally regarded as the reason Hopkins won<br />\nthe national championship. Another strong year by<br />\nQuinn could be all the edge the Blue Jays need to<br />\nrepeat.<br />\nIt is interesting to note that the last four times<br />\nHopkins has had a first team All-American in the goal<br />\n(Mike Federico - 1978-80; Quinn - 1984) it has won<br />\nthe national title. It is also interesting that the previous<br />\ntwo recipients of first team All-America in the goal<br />\nSears, North Carolina - 1982; George Slabowski, Army-1983) were juniors and were unable to repeat<br />\nthe tollowing year.<br />\nWilliam Tierney will join the Blue Jay coaching staff<br />\nfor the first time after spending the last several years<br />\nat the helm of the Rochester Institute of Technology<br />\nlacrosse team. Tierney won the 1984 Division III<br />\nCoach of the Year award as RIT made the playoffs<br />\nfor the first time. Tierney will work with the goalies,<br />\nmidfielders and the man-down defense.<br />\nReturning assistant coaches Jerry Pfeifer and Fred<br />\nSmith will guide the defense and Joe Devlin, the offense. Dennis Townsend works with the attackmen and<br />\ndefensemen individually, and Joe Cowan instructs the<br />\nextra-man offensive unit.<br />\nWith their most difficult schedule in decades, the<br />\nBlue Jays must concentrate on consistent play and not<br />\ntake any opponent lightly. \"Every team on our<br />\nschedule has the potential to beat us,\" says Zimmerman,\"if we're not mentally and physically prepared.<br />\nWe looked at the practice schedule and targeted areas<br />\nto work on early this year to avoid inconsistent play.<br />\nIf we have a good attitude, work hard and stay<br />\nphysically sound, I'm confident of our chances.\"<br />\n<br />\nATTACK<br />\n<br />\nAll-America attackman Brian Wood<br />\n<br />\nThe Blue Jay attack unit appears to be solid this year<br />\ndespite the loss to graduation of starters Peter Scott<br />\n(first team All-America) and Captain Willy Odenthal<br />\n(third team All-America), Brent Ciccarone, and Eric<br />\nDressel. The team returns second team All-America<br />\nBrian Wood and fourth man Craig Bubier, as well as<br />\nClark Thielemann and Bill Single. In addition, Coach<br />\nZimmerman has added Geoff Nordberg and two<br />\nhighly talented freshman recruits, Mike Morrill and<br />\nJohn Ciccarone.<br />\nWood was the third leading scorer for Hopkins last<br />\nyear, both in goals and total points, and should be the<br />\nhub of this year's attack. As the attackman with the<br />\nmost game experience, Wood is expected by Zimmerman to be the \"quarterback on the attack,\" with the<br />\nteam looking to him \"to anchor the unit.\" Wood<br />\nneeds to become a more reliable scorer, though, and<br />\nhis ability or inability to play consistently will have major ramifications for the team.<br />\nOutside of the added responsibility of leading the<br />\nattack, this sophomore's role should change little. He<br />\nwill be positioned primarily to one side of the goal,<br />\nusually about ten yards out, looking either to drive<br />\n<br />\ntowards the goal or to quickly release a shot. Either<br />\nway, fans can expect Wood to have the ball often and<br />\nto score 25-30 goals this season.<br />\nBubier will join Wood as a definite starter. Zimmerman describes Bubier as \"a power attackman who'll<br />\ngo one-on-one a lot.\" Additionally, he'll probably<br />\nemerge as the unit's primary feeder, although his exact role may depend on who Zimmerman plays at the<br />\nthird attack position. Tall and agile, Bubier seems a<br />\nnatural to play behind the goal, but he has added<br />\nenough muscle to also hold his own in the crease area.<br />\nLast year, Bubier tallied six goals and five assists<br />\ndespite limited playing time. With his ability to cut<br />\nquickly to the net and a hard turn-around shot, this<br />\nsophomore's ,mbers should more than double this<br />\nyear.<br />\nRounding out the starting unit at the crease position should be Single, who has the notable distinction<br />\nof having scored on 80 percent of his shots over the<br />\nlast two years. While he has tallied only four times,<br />\nincluding three last year, the figure is an indication of<br />\nContinued on Page 18<br />\n<br />\n\f41-vViaaZEICa<br />\n<br />\nI9R5<br />\n<br />\nClark Thielemann<br />\n# 11 Attack<br />\nJunior<br />\nEllicott City, Maryland<br />\nCentennial<br />\n165 lbs.<br />\n511\"<br />\n<br />\nJohn Dressel<br />\n# 2 Midfield<br />\nFreshman<br />\nBaltimore, Maryland<br />\nLawrenceville<br />\n5'11\"<br />\n180 lbs.<br />\n<br />\nThe 1985<br />\n<br />\nopivatis<br />\n<br />\nPhotos by Larry Volz<br />\n<br />\nDel Dressel<br />\n# 4 Midfield<br />\nJunior<br />\nBaltimore, Maryland<br />\nGilman<br />\n180 lbs.<br />\n6'2\"<br />\n<br />\nGreg Matthews<br />\n# 12 Midfield<br />\nSenior<br />\nFranklin Square, NY<br />\nChaminade<br />\n175 lbs.<br />\n5'9\"<br />\n<br />\nGuy Matricciani<br />\n# 7 Defense<br />\nSenior<br />\nBaltimore, Maryland<br />\nBoy's Latin<br />\n170 lbs.<br />\n5'10\"<br />\n<br />\nBruce Chanenchuck<br />\n# 13 Midfield<br />\nSophomore<br />\nMassapequa, New York<br />\nFarmingdale<br />\n160 lbs.<br />\n5'9\"<br />\n<br />\nJohn Ciccarone<br />\n# 8 Attack<br />\nFreshman<br />\nBaltimore, Maryland<br />\nBoy's Latin<br />\n160 lbs.<br />\n5'10\"<br />\n<br />\nJoe Rzempoluch<br />\n# 14 Midfield<br />\nFreshman<br />\nFarmingdale, New York<br />\nFarmingdale<br />\n190 lbs.<br />\n6'0\"<br />\n<br />\nCraig Bubier<br />\n# 9 Attack<br />\nSophomore<br />\nAnnapolis, Maryland<br />\nSt. Mary's<br />\n195 lbs.<br />\n6'3\"<br />\n<br />\nBrian Wood<br />\n# 15 Attack<br />\nSophomore<br />\nSherwood Forest, MD<br />\nSt. Mary's<br />\n170 lbs.<br />\n6'0\"<br />\n<br />\nGeoff Nordberg<br />\n# 10 Attack<br />\nJunior<br />\nTowson, Maryland<br />\nDulaney<br />\n170 lbs.<br />\n6'1\"<br />\n<br />\n14013KIN<br />\n<br />\nGlenn Fidje<br />\n# 16 Midfield<br />\nSenior<br />\nSt. James, New York<br />\nSmithtown East<br />\n170 lbs.<br />\n5'8\"<br />\n<br />\nIVPKIto<br />\n<br />\nLee Davidson<br />\n17 Midfield<br />\nSenior<br />\nAnnapolis, Maryland<br />\nSt. Mary's<br />\n175 lbs.<br />\n510\"<br />\n<br />\n#<br />\n<br />\n441tikt<br />\n<br />\n-4 •<br />\n<br />\nStuart Jones<br />\n# 18 Goal<br />\nSophomore<br />\nGlen Arm, Maryland<br />\nLoch Raven<br />\n155 lbs.<br />\n5'7\"<br />\n<br />\nDavid Castle<br />\n# 19 Midfield<br />\nJunior<br />\nAbington, Pennsylvania<br />\nLawrenceville<br />\n170 lbs.<br />\n511'<br />\n<br />\ntetalik.<br />\n<br />\nSteve Mutscheller<br />\n# 20 Midfield<br />\nSenior<br />\nBaltimore, Maryland<br />\nLoyola<br />\n170 lbs.<br />\n6'0\"<br />\n<br />\nLarry Quinn<br />\n# 21 Goal<br />\nSenior<br />\nLevittown, New York<br />\nLevittown Memorial<br />\n175 lbs.<br />\n6'2\"<br />\n<br />\n's4t<br />\n<br />\n\f0<br />\n<br />\n•<br />\n<br />\nJon Krome<br />\n# 38 Defense<br />\nJunior<br />\nBaltimore, Maryland<br />\nFriends<br />\n180 lbs.<br />\n6'0\"<br />\n<br />\nBlue Jays<br />\nDrawings by Evan Krakovitz<br />\n<br />\nDoug Oursler<br />\n# 39 Defense<br />\nSophomore<br />\nBaltimore, Maryland<br />\nGilman<br />\n5'10\"<br />\n175 lbs.<br />\n<br />\nJeff Kramer<br />\n#22 Goal<br />\nFreshman<br />\nWorthington, Ohio<br />\nWorthington<br />\n510\"<br />\n160 lbs.<br />\n<br />\nJohn DeTommaso<br />\n# 41 Defense<br />\nJunior<br />\nFarmingdale, New York<br />\nFarmingdale<br />\n185 lbs.<br />\n6'0\"<br />\n<br />\nJoe DiOrio<br />\n#* 23 Midfield<br />\nSophomore<br />\nNew Hyde Park, New York<br />\nSewanhaka<br />\n175 lbs.<br />\n5'9\"<br />\n<br />\nBrad McLam<br />\n# 27 Defense<br />\nJunior<br />\nDix Hills, New York<br />\nHalf Hollow Hills West<br />\n195 lbs.<br />\n6'2\"<br />\n<br />\nChris Schreiber<br />\n# 24 Midfield<br />\nJunior<br />\nHolbrook, New York<br />\nSt. Anthony's<br />\n190 lbs.<br />\n6'0\"<br />\n<br />\nChris Wickwire<br />\n# 29 Defense<br />\nSophomore<br />\nConcord, Massachusetts<br />\nConcord Carlisle<br />\n185 lbs.<br />\n6'2\"<br />\n<br />\nMike Morrill<br />\n# 25 Attack<br />\nFreshman<br />\nTimonium, Maryland<br />\nSt. Paul's<br />\n185 lbs.<br />\n6'0\"<br />\n<br />\nDan Pa!lace<br />\n# 26 Defense<br />\nJunior<br />\nBaltimore, Maryland<br />\nCalvert Hall<br />\n185 lbs.<br />\n6'1\"<br />\n<br />\nJack Crawford<br />\n# 30 Midfield<br />\nSophomore<br />\nRockville, Maryland<br />\nMercersburg<br />\n175 lbs.<br />\n5'11'<br />\n<br />\nOKItt<br />\nJohn Krumenacker<br />\n# 32 Midfield<br />\nSenior<br />\nFarmingdale, New York<br />\nFarmingdale<br />\n175 lbs.<br />\n6'3\"<br />\n<br />\nSteve Mitchell<br />\n# 44 Defense<br />\nSophomore<br />\nBrooklandville, Maryland<br />\nSt. Paul's<br />\n6'5\"<br />\n200 lbs.<br />\n<br />\nBill Single<br />\n# 33 Attack<br />\nJunior<br />\nBaltimore, Maryland<br />\nOverlea<br />\n6'0\"<br />\n160 lbs.<br />\n<br />\nEric Shaw<br />\n# 45 Defense<br />\nFreshman<br />\nDenver, Colorado<br />\nSouth Denver<br />\n180 lbs.<br />\n6'1\"<br />\n<br />\nDamon Stewart<br />\n# 35 Attack<br />\nSophomore<br />\nHuntingdon, New York<br />\nCold Spring Harbor<br />\n165 lbs.<br />\n5'9\"<br />\n<br />\nMike Webster<br />\n# 46 Midfield<br />\nSophomore<br />\nTimonium, Maryland<br />\nLaLumiere<br />\n5'11\"<br />\n170 lbs.<br />\n<br />\n\f6LAX/MARCH 8, 1985<br />\n<br />\nThe Road to Providence: From Start to Finish, A<br />\nSyracuse and North Carolina highlight a schedule that<br />\nby David Epstein<br />\n<br />\nyear's loss; Hopkins wants to defend its title. But when<br />\nthe Blue Jays play with intensity, they are the best team<br />\nin the country, and are virtually unbeatable at<br />\nHomewood.<br />\n<br />\nThe Johns Hopkins Blue Jays enter the 1985 season<br />\nas defending champions and the pre-season favorites,<br />\nand each game will be a true test of their ability. From<br />\nstart to finish, the Jays must face the top teams in Prediction: Hopkins 13, Syracuse 11<br />\nlacrosse in their quest to retain the title. The following is a game-by-game analysis of this year's Blue Jay<br />\nManhasset, N.Y.<br />\nschedule and a look at some other top teams' HOBART<br />\n2:00 p.m.<br />\nschedules, including an analysis of key games, as well Saturday, March 10<br />\nHistorical Series: Blue Jays lead, 2-0<br />\nas a few predictions along the way.<br />\nA reminder that all Blue Jay games can be heard on<br />\nWJHU, 88.1 FM.<br />\n<br />\nEach year, lacrosse fans talk about why Hobart is<br />\nnot a Division I team, and how they would fare if they<br />\nwere. And each year, the Statesmen receive a chance<br />\nto prove themselves when they face the Division I<br />\nchamps in the now traditional Day of Champions<br />\ngame on Long Island.<br />\nHobart has dominated Division III lacrosse, winning the NCAA championship the last five years. They<br />\nhave not always done well against Division I schools,<br />\nhowever, losing to such non-notables as C.W. Post.<br />\nStill, the Statesmen can play among the best, as<br />\nevidenced by their 1983 victory over North Carolina,<br />\nwhich ended the Tar Heels' 26-game winning streak.<br />\nThe Statesmen are led by attackmen Mark Van<br />\nArsdale (32 goals, 28 assists in 1984) and Tom<br />\nGrimaldi(26 goals, 19 assists). Grimaldi was voted the<br />\noutstanding attackman in Division III in 1984 while<br />\nVan Arsdale was named Hobart's offensive player of<br />\nthe year. In the midfield, losses to graduation will leave<br />\nthe Statesmen weakened substantially. First team AllAmericans Jim Holihan (13 goals, 10 assists) and Pat<br />\nO'Hara (14 goals, 4 assists) are both gone from the<br />\ndefending champions' roster.<br />\nDefensively, the Statesmen feature second team AllAmerica Dan Whelan on the close defense and junior<br />\ngoalie Chuck Warren, the MVP of the 1984 championship game against Washington College. The defense,<br />\nhowever, was only able to hold opponents to 122 goals<br />\nover 13 games in 1984.<br />\nClearly Hobart has less to lose in this game, and this<br />\nmakes for a dangerous opponent for Hopkins. The<br />\nBlue Jays have to be prepared to play all out.<br />\nPrediction: Hopkins 12, Hobart 9<br />\n<br />\nHomewood Field<br />\nSYRACUSE<br />\n2:00 p.m.<br />\nSaturday, March 9<br />\nHistorical Series: Blue Jays lead, 9-2<br />\nMost sports rivalries take time to develop and then<br />\nbuild over many years. This rivalry formed after all<br />\nof one game. The intensity of the 1983 comeback victory by Syracuse in the championship game was only<br />\nequalled by last year's rematch at Delaware, where the<br />\nBlue Jays captured the title. Many lacrosse enthusiasts<br />\nare viewing this contest as the rubber game of this<br />\nmatch-up, although it is likely that the two teams will<br />\nmeet again in the NCAA tournament.<br />\nThe Orangemen's losses to graduation were<br />\nminimal, and their young defense has gained valuable<br />\nexperience. (For more detail, see the Syracuse team<br />\nreport.) For those fans who have been asleep for the<br />\npast two years, Syracuse relies on an explosive offense<br />\nwhich can strike at any time, usually in bunches. In<br />\nthis way, the Orangemen are never really out of a game<br />\nuntil time becomes a factor.<br />\nThe Syracuse defense is not overly strong, and<br />\nHopkins has had little difficulty in scoring against it,<br />\nwith 29 goals in the '83 and '84 finals. However, the<br />\nJays must limit Syracuse's offensive opportunities by<br />\nusing ball control and taking the Orangemen out of<br />\ntheir game. Syracuse. has too much firepower to only<br />\nconcentrate on stopping a Tim Nelson or a Brad Kotz.<br />\nThere are numerous elements involved in this game,<br />\nand any one of them could be the deciding factor. Will<br />\nthere be a key injury, as there has been in the previous<br />\ntwo years? What about playing conditions? Cold<br />\nweather will likely translate into less scoring, which<br />\nwould tend to favor Hopkins.<br />\nThe Blue Jays need solid defense, a lot of which<br />\ndepends upon Larry Quinn's performance. An<br />\noutstanding game by Quinn, which is more than a<br />\ncommon occurrence, could tilt the balance. Also, the<br />\nattitude of Syracuse coming in will depend a great deal<br />\nupon their previous game against North Carolina.<br />\nIn truth, with two such excellent teams, the deciding<br />\nfactor is usually desire. Syracuse wants to avenge last<br />\n<br />\nattackmen. On top of this, head coach Terry Corcoran<br />\nhad an outstanding recruiting year.<br />\nThe Blue Jays must avoid any complacency. This<br />\ngame is being played within ten days of the Syracuse<br />\nand Hobart contest, and Hopkins may be a little tired.<br />\nA lack of intensity could lead to some unpleasant<br />\nresults. However, Don Zimmerman is too good a head<br />\ncoach to allow this to happen.<br />\nPrediction: Hopkins 10, Washington College 6<br />\n<br />\nHomewood Field<br />\nPRINCETON<br />\n2:00 p.m.<br />\nSaturday, March 23<br />\nHistorical Series: Blue Jays lead, 39-12<br />\nPrinceton is usually a solid all-around team, and<br />\nthey are always well-prepared by head coach Jerry<br />\nSchmidt. This year, the Tigers are looking to rebound<br />\nfrom a 2-12 season in 1984.<br />\nDefensively, the Tigers return their starting goalie,<br />\nChris Corcoran, but they have lost their entire close<br />\ndefense, with the exception of All-American Jerry Rizzieri. On offense, the outlook is brighter, with four<br />\nmidfielders and the entire attack returning. The offensive threats for the tigers include senior attackmen Jon<br />\nLurie(18 goals, 5 assists) and Charlie Stillwell(5 goals,<br />\n16 assists.)<br />\nPrinceton is a good enough team that the Blue Jays<br />\ncannot afford to look past them toward Virginia and<br />\nthe \"heart\" of the schedule. Still, the Blue Jays'<br />\nsuperior talent should be evident in the final score.<br />\nPrediction: Hopkins 14, Princeton 7<br />\n<br />\nHomewood Field<br />\nWASHINGTON COLLEGE<br />\n3:00 p.m.<br />\nTuesday, March 19<br />\nHistorical Series: Blue Jays lead, 24-1<br />\nWashington College was the runner-up in the 1984<br />\nDivision III championship game. But, as with Hobart,<br />\ndon't be fooled by the Division III aspect.<br />\nThe Shoremen lost their All-American goalie, Greg<br />\nBaker, but they return their entire close defense and<br />\nfirst two midfield units, as well as three out of four<br />\n<br />\n\fLACROSSE '85/7LAX<br />\n<br />\nChallenge to the Blue Jays' Championship Hopes<br />\nstarts tough and stays that way through the long season<br />\nHomewood Field<br />\nVIRGINIA<br />\n2:00 p.m.<br />\nSaturday, March 30<br />\n40-8-1<br />\nlead,<br />\nJays<br />\nSeries:<br />\nBlue<br />\nHistorical<br />\nLast year's game was a turning point for Hopkins,<br />\nas the Jays put it all together to rout the Cavaliers.<br />\nThis year's game could be more of the same.<br />\nVirginia lost standout goalie J.B. Meyer and half<br />\nof their starting defense, although recruiting was<br />\nstrong in this area. Four out of six attackmen return,<br />\nincluding Roddy Marino and Jeff Nicklas.<br />\nThe key, however, lies in the midfield, where<br />\nVirginia suffered significant losses. Highly regarded<br />\nmidfielder Larry LeDoyen transferred to Hopkins (ineligible in 1985) and workhorse Scott Gerham finished his career with the Wahoos. Both teams can run,<br />\nbut the Hopkins midfield will be able to dominate and<br />\ntherefore control the game. In the past few years,<br />\nHopkins has had Virginia's number, and the trend<br />\nshould continue.<br />\n<br />\nMac Ford and Gary Seivold. As always, the Tar Heels<br />\nwill have a fine incoming class, and the entire team<br />\nis made up of outstanding athletes.<br />\nAny skill advantage that the Blue Jays have will be<br />\ncountered by the intensity of this game and a significant Carolina home field advantage. This, combined<br />\nwith warm Carolina weather, should lead to an exciting, high scoring game, and possibly the Blue Jays'<br />\ntoughest challenge all season.<br />\nPrediction: Hopkins 12, North Carolina 11<br />\n<br />\nPrediction: Hopkins 16, Virginia 10<br />\n<br />\nMARYLAND<br />\nCollege Park<br />\nSaturday, April 20<br />\n2:00 p.m.<br />\nHistorical series: Blue Jays lead, 42-29-1<br />\nMaryland, once a dominant force in lacrosse, has<br />\nbeen on a downslide the last few years. Head Coach<br />\nDick Edell, in his second year, is looking to revitalize<br />\nthe Terrapins, and his efforts should begin to show<br />\nin this year's performance.<br />\nWhile it's always difficult to coach players who were<br />\nrecruited by someone else, Edell has the good fortune<br />\nof returning five of six close defensemen, including<br />\nseniors Kevin Hart and Joe Janssens, eight of nine top<br />\nmidfielders, and the entire attack. And although they<br />\nlose starting goalie Kevin O'Leary, the Terps should<br />\nhave a solid backup in Bobby Virden to take his place.<br />\nThe sum total is that Maryland will be a much improved team over last year, when it failed to make the<br />\nplayoffs for the first time in four years, and that<br />\nshould make for a closer contest than in recent years.<br />\nLook for the Blue Jays to pull away after a close first<br />\nhalf.<br />\nPrediction: Hopkins 15, Maryland 12<br />\n<br />\nJohn Duvall - In the Crease<br />\n<br />\nARMY<br />\nHomewood Field<br />\nSaturday, April 13<br />\n1:45 p.m.<br />\nHistorical Series: Blue Jays lead, 40-13<br />\n<br />\nDOD<br />\n<br />\nNORTH CAROLINA<br />\nSaturday, April 6<br />\nHistorical Series: 4-4<br />\n<br />\nmein - in the unldbe<br />\n<br />\nChapel Hill<br />\n2:00 p.m.<br />\n<br />\nWest Point has always prided itself on playing a<br />\ntough, physical game, with emphasis on a tenacious<br />\ndefense. The loss of All-America goalie George<br />\nSlabowski and two starting defensemen, therefore, will<br />\ntake its toll.<br />\nOn offense, the Cadets rely more on individual<br />\nquickness than on teamwork, using one-on-one isolations and few passing plays. One of the reasons they<br />\nare able to do so is midfielder P.J. O'Sullivan, voted<br />\nthe Blue Jays' outstanding opponent last year.<br />\nOverall, the contest should be the usual, hard-hitting<br />\ngame that Army plays. If Hopkins can control the ball<br />\nwithout worrying about the contact, they should be<br />\nable to dominate.<br />\nPrediction: Hopkins 9, Army 6<br />\n<br />\nThis game will be a dogfight. Hopkins and North<br />\nCarolina have met six times in the last three years, each<br />\nteam winning three times. In the playoffs, the Tar<br />\nHeels beat the Blue Jays in the 1982 championship<br />\ngame, while the Jays came back to win two consecutive<br />\nsemi-final matchups in 1983 and 1984.<br />\nThe most exciting contests, though, have come during the regular season. Each of these games has been<br />\ndecided by one goal, including two overtime games.<br />\n(Carolina won 13-12 in OT in 1982 and 14-13 in double OT in 1983; Hopkins won 4-3 last year.)<br />\nIn fact, if this game is anything like the last one in<br />\nChapel Hill, then it's a must game to see. That contest was tied eleven different times until the Tar Heels<br />\nwon with three seconds remaining in the second overtime, and only after a Hopkins goal with just seconds<br />\nleft in regulation was disallowed under a good deal of<br />\ncontroversy.<br />\nThis year's game shapes up a little differently than<br />\nin the past. The Tar Heels have lost their two top<br />\ndefensemen in second team All-American Randy Cox<br />\nand the 1984 Defenseman of the Year, Tom Haus(the<br />\nformer to graduation, the latter to academic difficulties), as well as four of their six top midfielders.<br />\nWhile they return goalie Tim Mealey, their losses will<br />\nnot allow them to play much zone defense, which was<br />\nalways a Carolina strength. Head Coach Willie Scroggs<br />\nwill have to adapt accordingly.<br />\nCarolina still has offensive strength, including midfielders Joey Seivold and Steve Martel, and attackmen<br />\n<br />\nJay mamcciant - In me urease<br />\nNAVY<br />\nHomewood Field<br />\nSaturday, April 27<br />\n2:00 p.m.<br />\nHistorical Series: Blue Jays lead, 30-25-1<br />\nA large crowd should be on hand for this year's<br />\nHomecoming game against the Midshipmen. Navy,<br />\nlike Maryland, has fallen from the ranks of the true<br />\nplayoff contenders for the last couple of years. This<br />\nyear, they hope to turn things around.<br />\nThe Middies' biggest weakness this year should be<br />\nthe attack, which lost all three of last year's starters,<br />\nincluding Tom Calabrese(26 goals, 10 assists). Coach<br />\nBryan Matthews' offense is not dominated by the attack, but last year's unit scored 48 of the team's 112<br />\ngoals. To try to combat the weakness, All-America<br />\nmidfielder Glen Miles(12 goals, 13 assist) will be moved to attack this year.<br />\nThis midfield should be strong, with the first unit<br />\nbeing led by Jeff Bellistri (11 goals, 7 assists) and captain Chris Adams. The defensive unit is led by third<br />\nteam All-America Joe Papetti and goalie Steve Nims.<br />\nThe Navy team could be described as a more wellrounded Army team. It plays good defense and a<br />\nphysical game, but the Midshipmen also use team<br />\nquickness and generally have some good scoring<br />\npotential.<br />\nNavy will certainly have to be more than prepared<br />\nto face Hopkins on Homecoming Day. It is not likely<br />\nthat Blue Jays will let their fans and alumni down.<br />\nPrediction: Hopkins 14, Navy 8<br />\nContinued on Page 8<br />\n<br />\nJay Matricciani - In the Crease<br />\n<br />\n\f8LAX/MARCH 8, 1985<br />\n<br />\nOrangemen, Tar Heels Highlight Jay Schedule<br />\nHomewood Field<br />\nRUTGERS<br />\n7:30 p.m.<br />\nWednesday, May 1<br />\nHistorical Series: Blue Jays lead, 19-3<br />\nIf you attended last year's meeting between these<br />\ntwo teams, it's hard not to laugh when you think about<br />\nit. The Blue Jays played one of the best quarters of<br />\nlacrosse ever witnessed at Homewood in building an<br />\namazing 15-0 lead on their way to coasting to a 21-10<br />\nembarrassment of the Scarlet Knights.<br />\nThat's what makes this year's contest so intruiging.<br />\nThe 1984 game was a result of several factors. Rutgers<br />\nhad played Syracuse to a close 15-12 decision only a<br />\nfew days prior to that game, and actually arrived at<br />\nHomewood only an hour and a half before the starting time. They were understandably a little flat.<br />\nHopkins, on the other hand, was well-prepared and<br />\ncame out on fire, which led to the one-sidedness of<br />\nthe scoring.<br />\nWhat happens in 1985 depends more on Rutgers<br />\nthan it does on Hopkins. Despite what you may<br />\nbelieve, Rutgers is for real. The Scarlet Knights suffered some losses, most notably of their top attackman<br />\nBill Naslonski. But they return standout goalie John<br />\nNaslonski and most of their defense and midfield.<br />\nWhat may be most important is that Rutgers returns<br />\nwith an extra year's experience. To witness the results,<br />\none need go no further than looking at the Knights'<br />\n9-3 defeat of Syracuse in the fall. And while it was only<br />\nfall ball, it has certainly boosted Rutger's confidence.<br />\nRutgers fields a young but very talented team.<br />\nAgainst Hopkins last year, they employed three different longstick units, and they returned eight of the<br />\nnine members. Throughout the lineup they have quality players; the Scarlet Knights may soon be ready to<br />\nbreak into the upper echelon of college lacrosse.<br />\nAn important factor in this year's game is that once<br />\nagain, Rutgers will face Syracuse and Hopkins consecutively on the road. The outcome of the Hopkins<br />\ngame, therefore, will depend upon the results of the<br />\nSyracuse contest.<br />\nThe real reason that this game depends so much<br />\n<br />\nupon Rutgers, though, is last year's game. The<br />\nmemory of that crushing defeat will be ever present.<br />\nThis will lead to one of two results. Rutgers can use<br />\nthat defeat in a positive way, to fire themelves up for<br />\na revenge match, or they could be haunted by it, and<br />\nexpect the same to happen again this year. The former<br />\nwill lead to a good game, the latter to another blowout.<br />\nRutgers has a fine coaching staff, so they will undoubtedly be more prepared this year. Still, as long<br />\nas the Blue Jays are also prepared, they should come<br />\naway with a win.<br />\nJay Matricciani - In the Crease<br />\n<br />\nContinued from Page 7<br />\n<br />\nPrediction: Hopkins 16, Rutgers 12<br />\n<br />\nTOWSON STATE<br />\nSaturday, May 4<br />\nHistorical Series: Blue Jays lead, 9-0<br />\n<br />\nThis is a crosstown rivalry where the public school<br />\nboys take on the private school boys. When Towson<br />\nplays well, this can be an extremely close game, as it<br />\nwas two years ago.<br />\nHowever, the Tigers will have to have made big<br />\nstrides during the season to be on a par with the Blue<br />\nJays. Of last year's 13 starting players (counting 2 midfields) for Towson, only 4 will return in '85. This<br />\n3 would make for a tough road to travel for any team,<br />\n2 and Towson doesn't have the recruiting power of a<br />\nc Hopkins or a Carolina.<br />\nIf Towson is in playoff contention, this game could<br />\nmean a great deal to them. However, the Blue Jays<br />\n2 will also be looking to gain some momentum going<br />\ncp into the playoffs.<br />\nPrediction: Hopkins 15, Towson State 10<br />\n<br />\nDegenerates<br />\nDrink<br />\n<br />\nHARD CIDER<br />\n<br />\ndo,<br />\n.•41116<br />\n<br />\n0<br />\n<br />\n3<br />\n<br />\nse<br />\n<br />\nSt<br />\n<br />\n61<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\nJoin the<br />\nChessie<br />\nDEgeneration<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\nTowson<br />\n7:30 p.m.<br />\n<br />\nSold in liquor stores near campus<br />\n<br />\n\fLACROSSE '85/9LAX<br />\n<br />\nStrengthened Schedules, More Competition in '85<br />\nby David Epstein<br />\nMany teams will by vying for the eight NCAA tournament berths. The schedules this year are well balanced, with most teams having to face several top playoff<br />\ncontenders. The following is an overview of the<br />\nschedules of the top teams, as well as a look at the<br />\none key contest of the season for each not involving<br />\nthe Blue Jays.(Teams are listed in order of predicted<br />\nplayoff seeding.)<br />\n1. Johns Hopkins<br />\nRutgers<br />\n<br />\nSyracuse<br />\nMarch 5<br />\n<br />\nNorth Carolina<br />\n<br />\n(H)<br />\n<br />\nMarch 9<br />\n<br />\nUMBC<br />\n<br />\n(A)<br />\n<br />\nMarch 9<br />\n<br />\nJohns Hopkins<br />\n<br />\n(A)<br />\n<br />\nStarch 17<br />\n<br />\nPennsylvania<br />\n<br />\n(A)<br />\n<br />\nMarch 13<br />\n<br />\nDelaware<br />\n<br />\n(A)<br />\n<br />\nMarch 20<br />\n<br />\nNorth Carolina<br />\n<br />\n(A)<br />\n<br />\nMarch 17<br />\n<br />\nArmy<br />\n<br />\n(A)<br />\n<br />\nMarch 30<br />\n<br />\nC. W. Post<br />\n<br />\n(A)<br />\n<br />\nMarch 20<br />\n<br />\nCortland State<br />\n<br />\n(HI<br />\n<br />\nApril 3<br />\n<br />\nBucknell<br />\n<br />\n(H)<br />\n<br />\nMarch 23<br />\n<br />\nPenn State<br />\n<br />\n(H)<br />\n<br />\nApril 6<br />\n<br />\nMassachusetts<br />\n<br />\n(A)<br />\n<br />\nMarch 30<br />\n<br />\nAdelphi<br />\n<br />\n(A)<br />\n<br />\nApril 10<br />\n<br />\nSt. John's<br />\n<br />\n(A)<br />\n<br />\nApril 6<br />\n<br />\nHarvard<br />\n<br />\n(A)<br />\n<br />\nApril 13<br />\n<br />\nPenn State<br />\n<br />\n(H)<br />\n<br />\nApril 11<br />\n<br />\nCornell<br />\n<br />\n(H)<br />\n<br />\nApril 17<br />\n<br />\nDrexel<br />\n<br />\n(HI<br />\n<br />\nArmy<br />\n<br />\n(HI<br />\n<br />\nApril 20<br />\n<br />\nHobart<br />\n<br />\n(H)<br />\n<br />\nApril 20<br />\n<br />\nApril 23<br />\n<br />\nColgate<br />\n<br />\n(A)<br />\n<br />\nApril 24<br />\n<br />\nPrinceton<br />\n<br />\n(A)<br />\n<br />\nApril 27<br />\n<br />\nRutgers<br />\n<br />\n(H)<br />\n<br />\nApril 27<br />\n<br />\nSyracuse<br />\n<br />\n(A)<br />\n<br />\nMay 4<br />\n<br />\nPennsylvania<br />\n<br />\n(HI<br />\n<br />\nMay I<br />\n<br />\nJohns Hopkins<br />\n<br />\n(A)<br />\n<br />\nMay 10<br />\n<br />\nMassachusetts<br />\n<br />\n(A)<br />\n<br />\n2. Syracuse<br />\nThe Orangemen play a rough schedule this year, but<br />\na note of explanation. Most of Syracuse's<br />\nrequires<br />\nit<br />\nbig games will be at home; they face \"lesser\" teams<br />\nsuch as Harvard and Colgate on the road. Aside from<br />\nHopkins, the toughest road game for Syracuse will be<br />\nat West Point, where the Cadets can give the Orange<br />\na difficult time with their tenacious defense.<br />\nAn important section of the Syracuse schedule<br />\ncomes when they face Rutgers and Penn back to back<br />\nnear the end of the season. Both teams should give the<br />\nOrange a run for their money, although again, both<br />\ngames will be played at Syracuse.<br />\nThe key game for Syracuse, though, is at the very<br />\nstart of the season.<br />\nSYRACUSE vs. NORTH CAROLINA<br />\nTuesday, March 5 •<br />\n<br />\nchance in another big game against the Blue Jays just<br />\na few days later. Clearly, this game will carry significant meaning for the playoffs.<br />\nNorth Carolina<br />\n<br />\nPennsylvania<br />\n<br />\nMarch 5<br />\n<br />\nSyracuse<br />\n<br />\n(A)<br />\n<br />\nMarch 17<br />\n<br />\nRutgers<br />\n<br />\n(H)<br />\n<br />\nMarch 9<br />\n<br />\nWashington & Lee<br />\n<br />\n(HI<br />\n<br />\nMarch 20<br />\n<br />\nLoyola<br />\n<br />\n(H)<br />\n<br />\nMarch 16<br />\n<br />\nTowson State<br />\n<br />\n(H)<br />\n<br />\nMarch 23<br />\n<br />\nYale<br />\n<br />\n(H)<br />\n<br />\nMarch 23<br />\n<br />\nNavy<br />\n<br />\n(A)<br />\n<br />\nMarch 27<br />\n<br />\nNavy<br />\n<br />\n(H)<br />\n<br />\nMarch 31<br />\n<br />\nMaryland<br />\n<br />\n(A)<br />\n<br />\nMarch 30<br />\n<br />\nHarvard<br />\n<br />\n(A)<br />\n<br />\nApril 6<br />\n<br />\nJohns Hopkins<br />\n<br />\n(H)<br />\n<br />\nApril 6<br />\n<br />\nCornell<br />\n<br />\n(A)<br />\n<br />\nApril 10<br />\n<br />\nDuke<br />\n<br />\n(A)<br />\n<br />\nApril 10<br />\n<br />\nPrinceton<br />\n<br />\n(H)<br />\n<br />\nApril 13<br />\n<br />\nUMW<br />\n<br />\n(H)<br />\n<br />\nApril 13<br />\n<br />\nDartmouth<br />\n<br />\n(H)<br />\n<br />\nApril 17<br />\n<br />\nRoanoke<br />\n<br />\n(H)<br />\n<br />\nApril 17<br />\n<br />\nUMBC<br />\n<br />\n(Al<br />\n<br />\nApril 20<br />\n<br />\n1.oyola<br />\n<br />\n(H)<br />\n<br />\nApril 20<br />\n<br />\nBrown<br />\n<br />\n(A)<br />\n<br />\nApril 27<br />\n<br />\nVirginia<br />\n<br />\n(A)<br />\n<br />\nApril 24<br />\n<br />\nDelaware<br />\n<br />\n(H)<br />\n<br />\nApril 27<br />\n<br />\nHofsara<br />\n<br />\n(A)<br />\n<br />\nMay 4<br />\n<br />\nSyracuse<br />\n<br />\n(A)<br />\n<br />\n4. North Carolina<br />\nThe Tar Heels generally play a difficult schedule,<br />\nand this year is apparently no different. After opening against Syracuse, they eventually move on to a<br />\nstretch against Navy, Maryland, and Hopkins. Of<br />\ncourse, games against teams such as Washington & Lee<br />\nand Duke should be no problem for Carolina. A key<br />\ngame for the Tar Heels, though, comes late in the<br />\nseason.<br />\n<br />\nN. CAROLINA vs. VIRGINIA<br />\nSaturday,,April 27<br />\n<br />\nCharlottesville<br />\n7:00 p.m<br />\n<br />\n7. Maryland<br />\nThe Terrapins face their usually strong schedule, including ACC rivals North Carolina and Virginia. With<br />\na team looking to reemerge in the upper ranks,<br />\nMaryland's key game becomes . . .<br />\nCollege Park<br />\n2:00 p.m.<br />\n<br />\nMARYLAND vs. HOFSTRA<br />\nSaturday, March 23<br />\n<br />\nThis is an important game for Maryland, not so<br />\nmuch as a specific contest, but for its implications. The<br />\nTerrapins face several solid but not overly spectacular<br />\nteams, such as Hofstra, Adelphi, and Delaware.<br />\nIn order to gain a playoff berth, Maryland must be<br />\nable to consistently beat these teams. The Hofstra<br />\ngame will provide a good indication of whether they<br />\nwill be able to do so.<br />\nArmy<br />\n<br />\nLast year, Virginia stunned the Tar Heels in Chapel<br />\nHill to win the ACC title. However, that same<br />\nCarolina squad came back and crushed the Cavaliers<br />\nin the first round of the NCAA playoffs.<br />\nIn 1985, this game should once again have a direct<br />\nbearing on the ACC championship. More importantly, this game will weigh heavily on the minds of the<br />\nNCAA tournament selection committee.<br />\nIf the Tar Heels lose to both Syracuse and Hopkins,<br />\nthey will need this game to achieve a good seeding in<br />\nthe playoffs. Furthermore, both teams will be looking for momentum going into the post-season.<br />\n<br />\nSyracuse<br />\n7:30 p.m.<br />\n<br />\n5. Penn<br />\nPenn is a good team, and they gained a playoff spot<br />\nlast<br />\nyear by virtue of the fact that they played the weaker<br />\nopener,<br />\nseason<br />\nyear's<br />\nlast<br />\nThis game is a repeat of<br />\nin which the Orangemen defeated the Tar Heels, 10-9, Ivy League teams. While the Quakers end their<br />\nwith a Tom Nelson goal with one second remaining. schedule at Hofstra and Syracuse, the key game is their<br />\nThis year, Syracuse has the home field advantage, as first one of the season.<br />\nopposed to last year's neutral site.<br />\nThese two teams match up very well. Both are very<br />\nPhiladelphia<br />\nquick, have excellent scoring punch, and can work well PENN vs. RUTGERS<br />\n17<br />\nMarch<br />\nSunday,<br />\n1:00 p.m.<br />\nWhile<br />\nsituations.<br />\nunsettled<br />\nor<br />\noff either settled<br />\nplace<br />\nHeels<br />\nTar<br />\nthe<br />\ntalent,<br />\noffensive<br />\nmore<br />\nSyracuse has<br />\nThese two teams are similar in that both are top<br />\ngreater emphasis on defense.<br />\nIn a fall contest last year, Syracuse rallied from a eight teams, but neither are considered to have a very<br />\n6-1 deficit to defeat Carolina 9-7. In scheduling this good chance of winning it all. This is an important<br />\nseason's game, Carolina Head Coach Willie Scroggs game for Penn, because next to the Syracuse contest,<br />\nmay be hoping to catch Syracuse looking past the Tar it is their toughest game.<br />\nIt is also important to both teams, because as the<br />\nHeels toward Hopkins. Nonetheless, this game should<br />\nbe very exciting, and should have strong playoff first game of the season, each of these teams knows<br />\nthat they must be able to defeat the other to be able<br />\nimplications.<br />\nto win against a Hopkins or a Syracuse. Rutgers will<br />\nhave other chances to prove itself, though, whereas<br />\n3. Rutgers<br />\nPenn<br />\nwill not receive such a challenge until the end<br />\nunusual<br />\nan<br />\nleast,<br />\nthe<br />\nsay<br />\nto<br />\nis,<br />\nThe Rutgers schedule<br />\none of their fourteen scheduled games, only four will of the season.<br />\nbe played at home. Granted, the Scarlet Knights may<br />\nMaryland<br />\nVirginia<br />\nfeel that this is a year in which they must prove<br />\nMarch 8<br />\n(A)<br />\nDuke<br />\n(H)<br />\nMarch 10 Brown<br />\nMarch 16 Washington & Lee<br />\n(H)<br />\n(Al<br />\nthemselves, and a strong schedule is one way of doing<br />\nMarch 16 UMBC<br />\nMarch 19 New Hampshire<br />\n(H)<br />\n(H)<br />\nMarch 20 Roanoke<br />\nso.<br />\nMarch 23 Horstra<br />\n(HI<br />\n(A)<br />\nMarch 23 Washington & Lee<br />\nSeveral of the Scarlet Knights' opponents should<br />\nMarch 31<br />\nNorth Carolina<br />\n(H)<br />\n(A)<br />\nMarch 30 Johns Hopkins<br />\nApril 6<br />\n(H)<br />\nVirginia<br />\n(A)<br />\nMaryland<br />\nApril 6<br />\npresent little difficulty. However, the schedule includes<br />\nNavy<br />\nApril 13<br />\n(A)<br />\n(H)<br />\nVirgina Tech<br />\nApril 8<br />\nand<br />\nHopkins,<br />\nCarolina,<br />\naway games against Penn,<br />\nApril 20<br />\nJohns Hopkins<br />\n(H)<br />\n(H)<br />\nRadford Univ.<br />\nApril 10<br />\nApril 27<br />\nAdelphi<br />\n(A)<br />\nHofstra. Penn and Carolina will be back to back, just<br />\nDuke<br />\n(Al<br />\nApril 13<br />\nMay I<br />\nDelaware<br />\n(H)<br />\n(A)<br />\nNavy<br />\nApril 20<br />\n.three days apart, presenting a critical section of the<br />\nUM BC<br />\nMay 4<br />\n(H)<br />\n(H)<br />\nNorth Carolina<br />\nApril 27<br />\nschedule. Still, it is another away game which is the<br />\n(Al<br />\nMay 9<br />\nTowson State<br />\n(H)<br />\nLoyola<br />\nMay 1<br />\nkey game for Rutgers.<br />\nSyracuse<br />\n,<br />\nRUTGERS vs. SYRACUSE<br />\nSaturday, April 27<br />\nThis is Rutgers' big chance to move into the top of<br />\ncollege lacrosse. They'll have had a previous chance<br />\nagainst Carolina, but this game is bigger in several<br />\nways.<br />\nRutgers matches up well against the Orangemen,<br />\nand this game gives them the chance to show that their<br />\nfall victory over Syracuse was no fluke. In fact, if<br />\nRutgers has done well going into this game, a victory<br />\nhere could vault them into the number two seeding.<br />\nOf course, a lot of that depends upon what several<br />\nother teams do.<br />\nRutgers must also do well in order to have any real<br />\n<br />\nthe season, and its placement is very important.<br />\nVirginia will be coming off the Hopkins game, and<br />\nwill most likely be in need of a victory.<br />\nOn top of this, Virginia is a team that, because of<br />\nits player losses, needs a confidence boost from a major game. Maryland, a team looking to turn things<br />\naround, would like nothing more than to beat the<br />\nCavaliers at Virginia, which would help them ensure<br />\na playoff berth. Both teams could use the midseason<br />\nwin to enter the second half in a positive way.<br />\n<br />\n6. Virginia<br />\nThe Virginia schedule this year is one of the weaker<br />\nschedules among the top rated teams. Opponents like<br />\nBrown, Roanoke, and Virginia Tech should provide<br />\nlittle competition for the Cavaliers.<br />\nVirginia is also fortunate to have most of their more<br />\ndifficult games, such as Navy and North Carolina, at<br />\nhome. It is another home game that is the key game<br />\nfor Virginia this year.<br />\nVIRGINIA vs. MARYLAND<br />\nSaturday, April 6<br />\n<br />\nCharlottesville<br />\n<br />\nThis ACC contest comes virtually in the middle of<br />\n<br />\nMarch 9<br />\n<br />\nCortland State<br />\n<br />\n(H)<br />\n<br />\nMarch 17<br />\n<br />\nSyracuse<br />\n<br />\n(H)<br />\n<br />\nMarch 20<br />\n<br />\nCW Post<br />\n<br />\n(H)<br />\n<br />\nMarch 23<br />\n<br />\nBrown<br />\n<br />\n(A)<br />\n<br />\nMarch 27<br />\n<br />\nSt. John's<br />\n<br />\n(H)<br />\n<br />\nMarch 10<br />\n<br />\nHofstra<br />\n<br />\n(HI<br />\n<br />\nApril 6<br />\n<br />\nNits)<br />\n<br />\n(Al<br />\n<br />\nApril 13<br />\n<br />\nJohns Hopkins<br />\n<br />\n(Al<br />\n<br />\nApril 17<br />\n<br />\nYale<br />\n<br />\n(H)<br />\n<br />\nApril 20<br />\n<br />\nRutgers<br />\n<br />\n(Al<br />\n<br />\nApril 23<br />\n<br />\nBucknell<br />\n<br />\n(H)<br />\n<br />\nApril 27<br />\n<br />\nMassachusetts<br />\n<br />\n(H)<br />\n<br />\nMay 4<br />\n<br />\nNew Hampshire<br />\n<br />\n(H)<br />\n<br />\n8. Army<br />\nOver the past few years. Army has maintained a<br />\nreputation for being the playoff team with the weakest<br />\nschedule. This year, their schedule has become slightly more difficult, mainly due to the increased strength<br />\nof other teams. Still, teams like C.W. Post, St. John's,<br />\nand Bucknell can hardly mount a challenge.<br />\nOn the opposite side, Army faces Syracuse early,<br />\nand then a consecutive streak of Hofstra, Navy, and<br />\nHopkins. But for Army, the key game arrives two<br />\nweeks later.<br />\nNew Brunswick<br />\n7:30 p.m.<br />\n<br />\nARMY vs. RUTGERS<br />\nSaturday, April 20<br />\n<br />\nThis game has quickly become a minor rivalry. Army is not likely to defeat Syracuse or Hopkins (although<br />\nthey are the last team to have beaten the Orange in<br />\nthe regular season), so a win against Rutgers becomes<br />\nessential.<br />\nArmy has hovered for many years as a very good<br />\nteam, while Rutgers is trying to break into the top of<br />\nthe pack for the first time. This game may turn out<br />\nto be a crossroads for both teams.<br />\n<br />\nCornell<br />\n<br />\nNavy<br />\nMarch 9<br />\n<br />\nLIMB(<br />\n<br />\n(H)<br />\n<br />\nMarch 16<br />\n<br />\nAdelphi<br />\n<br />\n(H)<br />\n<br />\nMarch 13<br />\n<br />\nWashington College<br />\n<br />\n(H)<br />\n<br />\nStarch 23<br />\n<br />\nHarvard<br />\n<br />\n(H)<br />\n<br />\nMarch 16<br />\n<br />\nDuke<br />\n<br />\n(A)<br />\n<br />\nStarch 30<br />\n<br />\nUMBC<br />\n<br />\n(H)<br />\n<br />\nMarch 23<br />\n<br />\nNorth Carolina<br />\n<br />\n(H)<br />\n<br />\nApril 3<br />\n<br />\nMassachusetts<br />\n<br />\n(Al<br />\n<br />\nMarch 27<br />\n<br />\nPennsylvania<br />\n<br />\n(Al<br />\n<br />\nApril 6<br />\n<br />\nPennsylvania<br />\n<br />\n(H)<br />\n<br />\nStarch 30<br />\n<br />\nPrinceton<br />\n<br />\n(Al<br />\n<br />\nApril 10<br />\n<br />\nYale<br />\n<br />\n(A)<br />\n<br />\nApril 6<br />\n<br />\nArmy<br />\n<br />\n(H)<br />\n<br />\nApril 13<br />\n<br />\nSyracuse<br />\n<br />\n(A)<br />\n<br />\nApril 13<br />\n<br />\nMaryland<br />\n<br />\n(H)<br />\n<br />\nApril 17<br />\n<br />\nWashington & Lee<br />\n<br />\n(HI<br />\n<br />\nApril 20<br />\n<br />\nVirginia<br />\n<br />\n(A)<br />\n<br />\nApril 20<br />\n<br />\nDartmouth<br />\n<br />\n(Al<br />\n<br />\nApril. 27<br />\n<br />\nJohns Hopkins<br />\n<br />\n(A)<br />\n<br />\nApril 24<br />\n<br />\nHobart<br />\n<br />\n(Al<br />\n<br />\nMay II<br />\n<br />\nHolstra<br />\n<br />\n(A)<br />\n<br />\nApril 27<br />\n<br />\nPrinceton<br />\n<br />\n(HI<br />\n<br />\nStay 4<br />\n<br />\nBrow n<br />\n<br />\n(A)<br />\n<br />\nWashington College<br />\n<br />\nHobart<br />\nMarch 9<br />\n<br />\nAir Force<br />\n<br />\n(A)<br />\n<br />\n(A)<br />\n<br />\nMarch 13<br />\n<br />\nNavy<br />\n<br />\n(A)<br />\n<br />\nLoyola<br />\n<br />\n(A)<br />\n<br />\nStarch 16<br />\n<br />\nSt. Mary's<br />\n<br />\n(H)<br />\n<br />\nGeneseo State<br />\n<br />\n(A)<br />\n<br />\nMarch 19<br />\n<br />\nJohns Hopkins<br />\n<br />\n(A)<br />\n<br />\nRIT<br />\n<br />\n(A)<br />\n<br />\nMarch 24<br />\n<br />\nHobart<br />\n<br />\n(HI<br />\n<br />\nApril 6<br />\n<br />\nIthaca College<br />\n<br />\n(H)<br />\n<br />\nMarch 27<br />\n<br />\nGettysburg<br />\n<br />\n(H)<br />\n<br />\nApril (3<br />\n<br />\nCortland State<br />\n<br />\n(H)<br />\n<br />\nMarch 30<br />\n<br />\nDenison<br />\n<br />\n(H)<br />\n<br />\nApril 20<br />\n<br />\nSyracuse<br />\n<br />\n(A)<br />\n<br />\nApril 6<br />\n<br />\nLoyola<br />\n<br />\n(H)<br />\n<br />\nApril 24<br />\n<br />\nCornell<br />\n<br />\n(H)<br />\n<br />\nApril 10<br />\n<br />\nFranklin &<br />\n<br />\nApril 27<br />\n<br />\nPenn State<br />\n<br />\n(H)<br />\n<br />\nMay 2<br />\n<br />\nSt. Lawrence<br />\n<br />\n(H)<br />\n<br />\nApril 13<br />\n<br />\nRoanoke<br />\n<br />\n(A)<br />\n<br />\nMay 4<br />\n<br />\nMassachusetts<br />\n<br />\n(H)<br />\n<br />\nApril 17<br />\n<br />\nWestern Maryland<br />\n<br />\n(H)<br />\n<br />\nApril 20<br />\n<br />\nWashington & Lee<br />\n<br />\n(H)<br />\n<br />\nipril 27<br />\n<br />\nSalisbury<br />\n<br />\n(A)<br />\n<br />\nMarch 16<br />\n<br />\nJohns Hopkins<br />\n<br />\nMarch 24<br />\n<br />\nWashington College<br />\n<br />\nMarch 31<br />\nApril 2<br />\nApril 4<br />\n<br />\nMarshall<br />\n<br />\n(H)<br />\n<br />\n\fIOLAX/MARCH 8, 1985<br />\n****************************************************1<br />\n<br />\nabo.<br />\n<br />\n4-<br />\n<br />\n...-..<br />\nirk;<br />\n1.06.1111,<br />\n• 4:,*-,,,<br />\n,<br />\n<br />\n1%.;,:41.11*Z431411,,Itiollt-10<br />\nIlk _46.101,40111„.<br />\n,<br />\n''<br />\nvm,<br />\n*,,,,X*4710..74101114.0<br />\n<br />\natilr<br />\n<br />\n4<br />\n:ft<br />\n<br />\n.,„);,,,,„,<br />\n,. k .<br />\n'Pla<br />\nfillit.0,<br />\n<br />\n..,,,,,,<br />\n<br />\n,„,........,•,,••,...* '<br />\n*<br />\n0.0, •,,74.,<br />\n<br />\nlialliiiiii0444 tS14,,,IN'‘ZrAst:<br />\n<br />\nito,<br />\n<br />\nJohns Hopkins<br />\n<br />\nJay Matricciani - In the Crease<br />\n<br />\nHomeWoc<br />\nSaturdaY,<br />\n2:00 1<br />\n<br />\nThe Johns Hopkins Blue Jays<br />\n<br />\nProbable Starting Lineup<br />\nNo. Player<br />\n9 Craig Bubier<br />\n<br />\nPosition<br />\nA<br />\n<br />\n15 Brian Wood<br />\n<br />\nA<br />\n<br />\n33 Bill Single<br />\n<br />\nA<br />\n<br />\n4 Del Dressel<br />\n13 Bruce Chanenchuk<br />\n32 John Krumenacker<br />\n7 Guy Matricciani<br />\n26 Dan Pallace<br />\n41 John DeTommaso<br />\n21<br />\n<br />\nLarry Quinn<br />\n<br />\nJay Matricciani - In the Crease<br />\n<br />\n****************************************************<br />\n<br />\n\fLACROSSE '85/ 1 1 LAX<br />\n<br />\n****************************************************<br />\n<br />\nClifton York - Lacrosse Magazine<br />\n<br />\nLarry Volz<br />\n<br />\nins vs. Syracuse<br />\n<br />\nwood Field<br />\naY, March 9<br />\n)0 P.M.<br />\n<br />\n5<br />\n<br />\nThe Syracuse Orangemen<br />\n<br />\nProbable Starting Lineup<br />\nNo. Player<br />\n1 Tim Nelson<br />\n<br />\nPosition<br />\nA<br />\n<br />\n5 Tom Nelson<br />\n<br />\nA<br />\n<br />\n42 Tom Korrie<br />\n<br />\nA<br />\n<br />\n12 Frank Lanuto<br />\n16 Todd Curry<br />\n30 Brad Kotz<br />\n27 Jeff Desko<br />\n28 Kevin Sheehan<br />\n31<br />\n<br />\nMike O'Donnell<br />\n<br />\n10 Tom Nims<br />\nJay Matricciani - In the Crease *<br />\n<br />\n********************<br />\n<br />\n********************************<br />\n<br />\n\f12LAX/MARCH 8, 1985<br />\n<br />\nA small but skillful class<br />\n<br />\nFive Freshman Give '85 Jays A Dose of Talent<br />\nby Adam Warner<br />\nThe 1985 season marks the first year that players<br />\nrecruited by Don Zimmerman as head coach will put<br />\non the Blue Jay uniform. Only five freshmen join the<br />\nsquad from the class of '88, but all five were high<br />\nschool consensus • All-Americans in their senior<br />\nseasons. Though it is unlikely that any will make as<br />\nbig an impact this year as Brian Wood did as a frosh<br />\nin '84, before they graduate they should prove to be<br />\nas good as any other class of recent memory. If<br />\nnothing else, three of the five have names and family<br />\nties quite familiar to Blue Jay loyalists: Ciccarone,<br />\nMorrill, and Dressel.<br />\nThe first is John Ciccarone, son of Henry Ciccarone, Sr., who preceded Zimmerman as Hopkins'<br />\nhead coach, and brother of former Blue Jay stars Brent<br />\nand Henry, Jr. Like Brent, John plays attack, and in<br />\n•high school he was truly exceptional. He was a four<br />\nyear varsity player at Boys Latin in Baltimore, and in<br />\nthe words of his former coach Bobby Shriver,\"he just<br />\ngot better and better every year. Last year, he had what<br />\nI'd call a truly outstanding season.\"<br />\nThe team had a fine year as well, as they made it<br />\nto the area finals, where they lost 8-6 to a Loyola team<br />\nthat they had beaten six days earlier. According to<br />\nShriver, \"If we had won that game, Ciccarone would<br />\nhave been named Metro Player of the Year.\"<br />\nShriver is also quick to praise Ciccarone's intensity<br />\ntoward the game. \"He'll work as hard as anyone you'll<br />\nsee. He's been lifting weights in order to bulk up for<br />\nhis college career. He has all the tools to be an excellent<br />\nplayer.\"<br />\nIt seems as if the only problem that Ciccarone may<br />\nhave is his size. At 5'10\" and 160 lbs., he is by no<br />\nmeans tiny, but in major college ball he will be facing<br />\nbig defensemen every game, and that may get tough.<br />\nAlso joining the attack is Mike Morrill, a third<br />\ngeneration Blue Jay. His grandfather, Kelso, played<br />\nfor Hopkins in the 1920's, while his father, Bill, was<br />\na star in the early 1960's.<br />\n<br />\nIf any frosh is to play a big role in Hopkins' national championship defense, it will likely be Morrill.<br />\nHe has the size at 6'0\", 185 lbs., excellent skills and<br />\nof course, the genes. In the scrimmage against Penn,<br />\nhe led Hopkins with three goals.<br />\nMorrill played his high school ball at St. Paul's in<br />\nBrooklandville for George Mitchell, himself a former<br />\nBlue Jay as well as the father of defenseman Steve<br />\nMitchell.<br />\nThe new Dressel is John Dressel, brother of the better known Del. John will also play midfield, although<br />\nthe two will not team on the same line.<br />\nA Baltimore native, John starred for Lawrenceville<br />\nPrep in New .,:rsey. Though he only played there for<br />\none season, his coach Marshall Chambers ranks him<br />\namong the best players he's had; one who helped his<br />\nprogram immensely. Particularly impressive were his<br />\nstick skills, which Chambers called \"the very best I've<br />\nseen it this level of play.\"<br />\nAt Lawrenceville, Dressel played on attack, \"mainly<br />\nbecause we had.some fast midfielders,\" says<br />\nChambers. \"Besides,\" he adds, \"it was better having<br />\nhim on the field more often.\"<br />\nIn analyzing •Dressel's future as a Blue Jay,<br />\nChambers sees no problems down the road. \"Here,<br />\nwe lacked a whole team to surround him, but at<br />\nHopkins he'll be playing with nine other excellent<br />\nplayers.\"<br />\nHopkins' other midfield recruit is Joe Rzempoluch.<br />\nHe hails from Farmingdale High School on Long<br />\nIsland, a virtual factory that has also produced current Hopkins stars John Krumenacker, John DeTommaso and Bruce Chanenchuk.<br />\nRight now, Rzempoluch may be the best prepared<br />\nof his class to move into a key position. At 6'0\", 190<br />\nlbs., he has the size, and coming from Farmingdale<br />\nhe was brought up in a style of play similar to that<br />\nof Hopkins. Harntranft, his high school coach,<br />\nbelieves that Joe will \"fit in very well to Coach Zimmerman's system. Here, like at Hopkins, midfielders<br />\nbring the ball up very quickly on offense, while they<br />\n<br />\nHOW<br />\nCAN YOU<br />\nLOSE WITH GUYS<br />\nLIKE THIS ON<br />\nYOUR TEAM?<br />\n<br />\nare all required to play excellent defense.\" Rzempoluch<br />\nparticularly excelled at the defensive phase of the<br />\nposition.<br />\nAside from being named All-America, Rzempoluch<br />\nwon the Jim Brown Award as the area's best midfielder. Yes, it's THE Jim Brown. As for Farmingdale,<br />\nthey finished their year at 17-2, the number one seed<br />\nin their region before being upset in the playoffs.<br />\nLast, but not least, Hopkins brought in Jeff Kramer,<br />\na goalie. Kramer attended Worthington High School<br />\nin Ohio, as he is the only player on the squad this year<br />\nnot to come from an Atlantic state.<br />\nThough highly talented, Kramer will not see much<br />\naction at all this year in the nets. All three goalies from<br />\n1984 return, including NCAA tournament MVP Larry<br />\nQuinn, who is unquestionably the best goalie in the<br />\ncountry. The 5'10\", 160 lb. freshman will get his big<br />\nchance next year, when he will battle sophomore Stuart<br />\nJones and any other newcomers for the starting slot.<br />\n<br />\nThe Sieve Story<br />\nIf you've been wondering what those strange people with kitchen utensils have been doing at lacrosse<br />\ngames, you need not wonder any more. They're sieves.<br />\nNo, not the people, the utensils. The tradition actually began at Cornell hockey games. The chant of<br />\n\"sieve\" is directed at the opposition's goalie, hoping<br />\nthat he will let pucks(or in our case lacrosse balls) pass<br />\nthrough, as a sieve allows objects to pass through.<br />\nWhen done effectively, it has been known to rattle<br />\nmany a goaltender.<br />\nThe tradition was brought to Hopkins by two<br />\nstudents, Mark Lazarus and David Epstein, for the<br />\n1983 playoff game between Hopkins and Cornell.<br />\nSieves can be purchased at any food store for a small<br />\nprice. Colanders and other sorts of strainers are acceptable, but they're not the genuine article. So, get<br />\nyourself a sieve, head out to the game, and abuse the<br />\nother team's goalie.<br />\n<br />\nTHE JOHNS HOPKINS UNIVERSITY ALUMNI ASSOCIATION<br />\ncordially invites you and your family on a<br />\n\"BUS TRIP TO MANHASSET\"<br />\nfor the<br />\n\"DAY OF CHAMPIONS LACROSSE CLASSIC\"<br />\nJOHNS HOPKINS vs. HOBART<br />\nand a post-game cocktail & buffet reception<br />\nwith the team at the<br />\nSTRATHMORE-VANDERBILT COUNTRY CLUB<br />\nManhasset, Long Island<br />\non<br />\nSATURDAY, MARCH 16, 1985<br />\n7:00 a.m. till 11:00 p.m.<br />\nCost: $45.00 per person<br />\n<br />\nBRINGING YOU A BETTER<br />\nGAME IN THE BEST WAY<br />\nFor Your Subscription:<br />\n107 East 25th Street<br />\nBaltimore, MD 21218<br />\nor call.(301)235-2104<br />\n<br />\nPrice includes round-trip luxury bus transportation, post-game team<br />\nreception, game ticket and on-board refreshments(pack a picnic lunch).<br />\nFirst Come - First Served!<br />\nFor additional information, please call Doug Warren at the Alumni<br />\nOffice: (301) 338-7963.<br />\n<br />\n\fLACROSSE '85/13LAX<br />\n<br />\nAn Interview with Coach Roy Simmons, Jr.<br />\nThe coach of the Orange discusses his teams, Hopkins, and the future.<br />\nEditor's Note: Roy Simmons, Jr., the head coach of the<br />\nSyracuse lacrosse team, spoke with Howard Bregman and<br />\nDavid Epstein of the News-Letter on February 21st. We thank<br />\nCoach Simmonsfor his time and his help with our coverage<br />\nof the Orangemen.<br />\n<br />\nN-L: Could you sum up the team's attitude going into the game with Hopkins? Is the outlook different<br />\nafter having been in the finals for two years?<br />\nSimmons: Well, we don't play Hopkins normally in<br />\nthe regular season. We've played in the playoffs, and<br />\nstubbed their toe. It's important to get a shot at<br />\nHopkins and not have to wait until May, if that's a<br />\npossibility at all. ..Of course, we start off up here with<br />\nNorth Carolina on the fifth of March, so I think that<br />\nthat puts the Blue Jays second; we're thinking more<br />\nabout the Tar Heels right now, we know that that game<br />\nwill be very important.<br />\nN-L: So you'll be travelling right after the Carolina<br />\ngame by bus?<br />\nSimmons: Yes, we're going to come down the night<br />\nof the seventh, so we'll be there for two nights. We'll<br />\nhave a workout on the eighth; but we'll arrive in<br />\nBaltimore on the night of the seventh. That's two days<br />\nafter our Carolina game.<br />\nN-L: Everybody knows that Kotz and Nelson are now<br />\nseniors. Tom Nims is back in the goal, and you have<br />\na lot of good young players, several of whom really<br />\nshone in the 1984 championship game. Do you think<br />\nthat this is the strongest team you've fielded in the past<br />\nfour years?<br />\nSimmons: Well, I think it's as strong as last year, and<br />\nas strong as the year before. In '83, we had a lot of<br />\nsophomores. Now much of the team this year are<br />\nseniors. We're returning our entire defense; the unit<br />\nwas really young last year.. . Our midfield lost David<br />\nDesko to graduation, who had three goals in the title<br />\ngame. It's a big loss, but it will be filled in...Our close<br />\nattack is intact. We'll feel the absence of Randy Lundblad, who had a great career here, and a great season<br />\nlast year. Tommy Nelson, who filled in for his brother<br />\nin the finals, will be back. We also have Tom Korrie.<br />\nSo we look very good on paper.<br />\n<br />\n... when our big gun got<br />\nhurt... we had to adjust, so we've<br />\nlearned the hard way that you can't depend on any one person.\"<br />\n<br />\nN-L: Let's talk about the attack. The unit is probably<br />\nthe strongest in the nation. Will it dominate your game<br />\nplan this year?<br />\nSimmons: By no means. We realize from experience<br />\nin 1983 that a lot of opponents we play will put in<br />\nwacky defenses—a lot of zone, a lot of shutting off<br />\nof personalities. They gear a lot of their practices to<br />\ndisrupting our attack, so we have to be ready for that<br />\nand not rely on our attack exclusively. We realize that<br />\nthey can be tied up pretty tight. We don't have any<br />\npreconceived plan to play an attack-oriented offense.<br />\nYou know, the bad thing last year when our big gun<br />\ngot hurt, that phase of our game was wiped out, and<br />\nwe had to adjust, so we've learned the hard way that<br />\nyou can't depend on any one person. God forbid<br />\nanother bad injury, but he may be healthy but shut<br />\noff by a good defenseman. We can't predict these<br />\nthings, so we certainly don't look for our offense to<br />\ndominated by one unit.<br />\nN-L: As an aside, how is Tim Nelson's condition?<br />\nSimmons: Well, he's 100 percent. I say he's 100<br />\npercent—he'll be wearing a large Lenox Hill brace on<br />\none knee, but that's not unusual in this day and age<br />\nto see a lot of players wearing them. We have a couple of other players wearing them for support. Timmy was in a cast all summer after the Delaware game<br />\nuntil late August. He did not play fall ball as a result<br />\nof the injury. Then, around December, he started to<br />\nwork out, wearing the brace. He's worked harder than<br />\n<br />\nNelson, who got three goals, and also Dave Desko.<br />\nWe came back to within one, and we could've maybe<br />\ntied the ball game up, and gotten a fresh start. .. but<br />\nI think with Timmy on the sidelines, and we were told<br />\nat that time that he would be out for the entire game,<br />\nand we had a six goal deficit to make up...You know,<br />\nwe had a seven goal deficit the year before, so we knew<br />\nit was certainly possible, but we knew that the Hopkins<br />\nkids could really taste it badly, that they wouldn't let<br />\nit get away again, and they didn't. We took some<br />\nchances at the end of the ball game—we had a chance<br />\nof tying it but it backfired on us; the thirteenth goal<br />\nwas scored on an open cage, and those things had to<br />\nhappen. For us, we were behind, and to get back in<br />\nthe ball game we had to take chances, and they didn't<br />\nwork, they backfired.<br />\nSo it was a three goal difference, but, I think, to<br />\nbe down by six, and to come back within one in the<br />\nchampionship game, I think that you—for those young<br />\nkids—I have a lot of faith in them. We probably peaked a little bit too early, and, it's funny. . . Hopkins had<br />\na struggle with UMBC and we had a cakewalk.<br />\nHopkins absolutely devastated Rutgers in their last<br />\ngame, and I forget how many goals they got in the first<br />\nhalf—it was no contest. We had to struggle against<br />\nRutgers twice, so it's hard to say, the chemistry<br />\nSyracuse head coach Roy Simmons, Jr.<br />\nchanges during the season. You're as good as the day<br />\nyou play, and you have to hope that you'll play your<br />\nhe's ever worked. You'd never know that a ming was best game that day. The problem was that that was<br />\nwrong with him right now.<br />\nHopkins' best game of the year, that's when they<br />\nwanted it, that's when it definitely counts. We had our<br />\nN-L: We don't want to dwell on last year's champion- best game of the year in '83, the last game. We're just<br />\nship, but just one question:<br />\ngoing to have to hope that on the ninth our chemistry's<br />\nWere the playoffs a bad streak for you? Obvious- correct and we're ready to play.<br />\nly, you had problems with Rutgers, who took you into overtime, and Army didn't seem to be a convincing victory after all those you had in the beginning of<br />\n\"We hope to maintain good lacrosse<br />\nthe season. Then there was the championship game. here. Whether we can maintain chamSimmons: Well, I think our best game last year was<br />\nagainst UMBC in the regular season. We played our<br />\nkind of lacrosse. . . We really peaked in the UMBC<br />\ngame. We beat them 22-6 and didn't rub it in. I know<br />\nthat the score sounds like we did, but we didn't. I think<br />\nthat we probably peaked there. Then we accomplished an undefeated season. We went into the playoffs,<br />\nand we lost sight of the fact that Rutgers was aching<br />\nfrom their loss to us earlier in the year. They were<br />\nfighting to get into the playoffs and they made it. After<br />\nbeating them earlier in the year, we didn't expect the<br />\ncontest it turned out to be... We were a little complacent, and I felt that we got that bad game out of the<br />\nway.<br />\nThe Army game was a very physical game—we beat<br />\nthem by two goals. They were behind, and they were<br />\nthreatening, and we held them off, and I felt the boys<br />\nhad had the scare—we were still undefeated, and we<br />\nhad a chance to prove ourselves again at<br />\nDelaware—we came out flat. I mean we had a great<br />\nteam, but the day you play.. .1 don't know. The<br />\nchemistry wasn't quite right. We lost the opening<br />\nfaceoff, we got burned early with the first goal—that<br />\nmade a lot of difference in the game. Freshmen like<br />\nWood had a lot of confidence, and it took a little steam<br />\nout of my freshmen watching them. You know,\"Now<br />\nit's the big time, we were playing for the national<br />\nchampionship, and he's a freshman, too.\" He put one<br />\nimmeimmmm•mm••mmi<br />\n\"You know, we had a seven goal<br />\ndeficit the year before... but we knew<br />\nthat the Hopkins kids could really taste<br />\nit badly, that they wouldn't let it get<br />\naway again, and they didn't.\"<br />\nin, and my boy was the goat—it took the wind out of<br />\nus, and the first thing you know, we had ourselves dug<br />\nin pretty deep.<br />\nThen, when we lost our number one attackman, the<br />\nTurnbull award winner for two years in a row, the bottom really could have fallen out, and it didn't. We<br />\ncame back within a goal, and we did it with the boys<br />\nwho were not expected to do it. Tommy Nelson, a<br />\nfreshman, got three goals, and one of our reserve attackman did the same.<br />\nI give Brian Wood a lot of credit for getting three<br />\ngoals, they were well-deserved. He got it when they<br />\nneeded it, right off the bat. That set the tempo for the<br />\nday, but you know, we had a little freshman, Tommy<br />\n<br />\npionship lacrosse year to year remains<br />\nto be seen.\"<br />\nN-L: About the future: Next year Kotz and Nelson are<br />\ngone. How different will it be? Are you starting a<br />\nchampionship tradition that you are going to be able<br />\nto maintain?<br />\nSimmons: Well, lacrosse at Syracuse is looked at differently than at Hopkins. It is the sport there, and<br />\nrightly so, there's a long tradition. It's just that you<br />\ndon't put a lot of effort into football and basketball.<br />\nAnd you know that our basketball team is in the<br />\nlimelight now—they have a lot of TV contracts—<br />\nfootball has a good number of TV contracts, and,<br />\nthat's the fall sport here.<br />\nSo to keep this level up, it will depend a lot on<br />\nrecruiting, obviously, on how the athletic department<br />\nperceives non-revenue sports—and I mean nonrevenue compared to football—though we do have,<br />\nin my estimation, one of the largest lacrosse turnouts,<br />\nsomewhere around five or six thousand per game,<br />\naverage. But it's still not on the priority list. We hope<br />\nto maintain good lacrosse here. Whether we can maintain championship lacrosse year to year remains to be<br />\nseen.<br />\nAs a coach, you finally have to say goodbye and<br />\ncongratulations to those seniors; you think that you'll<br />\nnever replace them, you'll never have another Tim<br />\nNelson, you'll never have another Brad Kotz. I know<br />\nthat's not so. ..You know, when Joe Cowan left<br />\nHopkins it was a sad day. But then others came<br />\nalong—Thomas, O'Neill, and now Wood, there's<br />\nalways somebody to fill in. I'm a full-time coach of<br />\nlacrosse here, I have two assistants, and we don't even<br />\nhave an office. You know, we just don't get out to<br />\nlook. We travel to the Baltimore. area, and to Annapolis, although we rarely play in these areas. I have<br />\na boy from Dulaney High School in Baltimore, a high<br />\nschool All-American last year, and we're very, very<br />\nhappy with him. We have a back-up goalie, Jim<br />\nGygory from Annapolis, and we're very happy with<br />\nhim. So I think we're going to have to go take a look<br />\ndown there at schools like St. Paul's, Boys Latin,<br />\nGilman, all of the great lacrosse schools down there,<br />\nand maybe take a look at those boys to \"share the<br />\nwealth.\" There's a lot of great schoolboy lacrosse<br />\ndown there.<br />\nContinued on Page 14<br />\n<br />\n\f14LAX/MARCH 8, 1985<br />\n<br />\nPenn Comes on Strong After 2 Years in Playoffs<br />\nBlue Jays' first intercollegiate scrimmage of the year.<br />\nSeaman's squad put on an impressive offensive show,<br />\nPennsylvania<br />\nthe<br />\nchampions,<br />\nLeague<br />\nLast year's Ivy<br />\nlosing the game in the final quarter by an 11-10 score.<br />\ncoming<br />\n\"We came here to play well, and I am very pleased<br />\nand<br />\nup<br />\nthe<br />\nbeen<br />\nyears<br />\nfor<br />\ntwo<br />\nhave<br />\nQuakers<br />\nteam in college lacrosse. An average program was turn- with how the team performed,\" said Seaman after the<br />\ned around in 1983 by first-year coach Tony Seaman, game...\"I don't even know what the score was, but<br />\nas the Red & Blue went 10-3, were co-champions of I'm glad we played well—it shows we can play with<br />\nthe Ivy League, and received a bid to the NCAA an<br />\nThe 1985 season will test the staying power of Penn's<br />\ntournament.<br />\nthe<br />\nin<br />\ncoming<br />\nlosses<br />\nthe<br />\n12-2,<br />\nto the top. Last year's team had a solid returning<br />\nrise<br />\nwas<br />\nLast year, Penn<br />\nopening game with Rutgers and in the first round of corps of defenders who held their opponents to an<br />\nthe tournament against Army. Seaman was named the average of only a 4.7 goals per game. From this unit<br />\nDivision I Coach of the Year by the Intercollegiate only two players return for 1985, most notably AllLacrosse Association in both 1983 and 1984.<br />\nAmerica goalkeeper and team co-captain Jim<br />\nDellaRocca. Senior Tim Bianco returns on defense and<br />\nHold Jays to 10 Goals<br />\nwill be joined by two inexperienced juniors, Pat<br />\nPrendergast and Johns Hopkins transfer Brian<br />\nThe Quakers faced Hopkins on February 22 in.the Fraidin.<br />\nby Craig Caplan<br />\n<br />\nDefensively, Penn plays a match-up zone. \"I stole<br />\nit from the Villanova basketball program,\" said<br />\nSeaman. This defense is susceptible to quick passes for<br />\nopen shots from the outside, but Seaman has confidence in DellaRocca and prefers to keep the opponent's offense from being able to work the crease. This<br />\ndefense was very effective against Hopkins; as it was,<br />\nthe Blue Jays ability to convert unsettled opportunities<br />\nmade the difference.<br />\nMidfield lacks depth<br />\n<br />\nAt the midfield, Penn has one of the fastest there<br />\nis. Gone from the 1984 squad is first team All-America<br />\nand Ivy League player of the year Josh Hall(15 goals,<br />\n14 assists in 1984), now an assistant coach. A solid<br />\ngroup remains, however, led by senior Leo Paytas(20<br />\ngoals, 10 assists) returns. Depth is a problem, as Penn<br />\ndoes not have enough players to run three strong<br />\nmidfields.<br />\nOffensively, Seaman uses a ball-movement offense,<br />\nsimilar to that used by the Jays, and he counts on<br />\nbalanced scoring from midfield and attack. The attack<br />\nfreeing up of dates. We look forward to it. I think it's is led by senior Bill Morrill (21 goals, 19 assists in<br />\nonly natural to play there. If you want to go back to 1984), a two-time All-America. The rest of the attack<br />\nlast year, to the top eight, we're playing six of the seven is young, with a junior and two sophomores set to see<br />\nthat are possible to play, and Virginia's the only one regular action.<br />\nThe Red & Blue opens the season on March 17<br />\nthat we're not playing, and that's just a matter of cost.<br />\nWe're going back to Chapel Hill next year. We played against Rutgers, the seventh ranked team in the nathem on a neutral site last year in Baltimore, and they're tion in 1984. On March 20th they play Loyola, a top<br />\nchoice for the \"Cinderella\" team of 1985. The regoing to fly to Syracuse this year.<br />\nSo, next year we're going to bus down to Chapel mainder of Penn's schedule is weak relative to other<br />\nHill on our spring break to play Carolina and Hopkins top schools due to Ivy League commitments, but the<br />\non our spring trip, which is a lot to ask from a team. game to wait for is Saturday, May 4, at Syracuse, one<br />\nI think it's important for top teams to play one week before the NCAA tournament.<br />\nLast year, Penn was one dominant player away from<br />\nanother, so that there's no doubt in anyone's mind.<br />\nI think this year we have the toughest schedule in the giving Hopkins and Syracuse a third contender for the<br />\nnation. We play six of the top seven and other tough title. The '85 squad is a strong favorite to win the Ivy<br />\nteams. Hobart—a very tough traditional opponent— League title, but it is still a hair's breadth away from<br />\nand Cornell on the road, Cortland State on the road, the very top. The success Coach Seaman has with his<br />\nCarolina, Hopkins, Army, Delaware. I think we have youngest team to date will tell it' the Quakers are at<br />\na great schedule. We have a good team, and we're go- the top to date.<br />\ning to keep on playing the big boys and see how we do.<br />\n<br />\nSimmons: Competition is Key<br />\nContinued from Page 13<br />\n<br />\nN-L: Will this game be a yearly thing now? I know<br />\nthat you're scheduled for the next three years to play<br />\nHopkins.<br />\nSimmons: Right. We'll be playing there again early<br />\nnext year, and then we go back home and Hopkins<br />\nin '87 will come and play us up here. We've been trying to set something up for a couple of years. Right<br />\nnow we have a three-year contract.<br />\nWe have more mobility then they do, as far as the<br />\n<br />\n\"I think it's important for the top<br />\nteams to play one another, so that<br />\nthere's no doubt in anyone's mind.\"<br />\n<br />\nIF YOU'RE NOT<br />\nIN THE CREASE,<br />\nYOU'RE OUT<br />\nOF BOUNDS<br />\n•<br />\n<br />\n10<br />\nEXCITING<br />\nISSUES!<br />\nGiving you all<br />\nthe news while it's<br />\nstill news.<br />\nIn depth reporting and<br />\nphotos of the big games.<br />\nPlus the only national<br />\nlacrosse comic strip.<br />\n<br />\nIMMO MO<br />\n<br />\n11=•<br />\n<br />\nIMMO 11=1 MIMI NMI MI<br />\n<br />\nIlan ONO<br />\n<br />\nSubscribe now! Choose your terms below. Enclose a check or<br />\nmoney order for the amount. Mail to: In The Crease. P 0. Box<br />\n281, Riderwood. MD 21139<br />\n__<br />\nCheck enclosed for S._ _ _ _<br />\nOne Year $ 1 1.00(10 issues) $19.50 iirst Class<br />\nCanadian Rate: 6 issues. 511.00 in U.S. Funds<br />\nName:<br />\nAddress:<br />\nLip:<br />\n<br />\n1<br />\n<br />\n1111=1111MINNO MN =III MID =NI MINI<br />\nlkr.PIIIIIIMIMNIUM--IMMO---MIMI<br />\n<br />\n0<br />\n<br />\n0<br />\n<br />\n27<br />\n141<br />\nIII 0<br />\n111,91k<br />\nIIPNI AIM<br />\nMI NM INN atm<br />\nEll\\ •<br />\n<br />\nDU ill<br />\nMEI 111111ft.<br />\nAv<br />\n\\NM<br />\nIEENIEl.\" Barmy<br />\nas \\MII<br />\nIM 1=1 NM I\" a.<br />\nN NEMI EL<br />\nENE MIR<br />\ngm<br />\nNE/11111//11<br />\n<br />\nMIEN\\<br />\n<br />\nTHE LACROSSE NEWS MAGAZINE<br />\n<br />\n\fLACROSSE '85/15LAX<br />\n<br />\nOrangeman Lacrosse:<br />\n<br />\nSteve Parker: Syracuse SI<br />\n<br />\nby David Epstein<br />\nIn order to build a top college lacrosse program, a<br />\nschool must have a strong high school recruiting base.<br />\nLogic would therefore dictate that the wider the<br />\nrecruiting area, the more talent that would be available<br />\nand therefore the more successful the program. Under<br />\nthis assumption, the Syracuse lacrosse team has<br />\nmanaged to defy logic.<br />\nFor the past half decade, two teams have dominated<br />\nNew York state high school lacrosse. Downstate,<br />\nYorktown High School (Westchester County) has<br />\nreached the state final in five consecutive years, capturing the title in 1984. In doing so, each year<br />\nYorktown has had to defeat the top team on Long<br />\nIsland.<br />\nUpstate, West Genesee High has been so dominant,<br />\nthat it borders on the unbelievable. The Wildcats have<br />\nbeen to the state finals the last four years, winning<br />\nthree times. Along the way, they tied a state record<br />\nby winning an astounding 91 consecutive games, a<br />\nstreak which was broken in last year's state finals by<br />\nYorktown.<br />\nNot surprisingly, these two schools have consistently<br />\nturned out top players and more than their share of<br />\nAll-Americans. What is surprising is that Syracuse has<br />\nbeen able to build a championship program basically<br />\naround players from these two high schools. Syracuse<br />\nHead Coach Roy Simmons, Jr. is quick to deny this<br />\nidea, and he points out that his team has players from<br />\nMaryland and Massachusetts. However, the<br />\nundeniable evidence is that eight of the Orangemen's<br />\nten starters, and over one third of the team, are from<br />\neither West Genesee or Yorktown. Of course, this<br />\nmeans that there are also many Syracuse players from<br />\nother areas; many top players from both West Genny<br />\nand Yorktown have opted to attend other colleges.<br />\nStill, Simmons has used the emergence of lacrosse in<br />\nWestchester and Central New York to his advantage<br />\nas no other coach has been able to do.<br />\nFor Syracuse, this has translated into two consecutive championship caliber teams. The 1983 team<br />\nwas victorious in the finals, the 1984 team was the<br />\nrunner-up, and both times they faced Hopkins. Unfortunately for the rest of lacrosse, the 1985 Syracuse<br />\nsquad may be their strongest ever.<br />\nThe Syracuse style of play is to use a highly potent<br />\noffense and an unspectacular defense to outscore their<br />\nOpponents. They often have trouble in tight defensive<br />\ngames, but almost always win a shutout. The<br />\nOrangemen's ability to score is almost uncanny, and<br />\nWhen they score a goal, there are usually two or three<br />\nmore to follow. It is this type of streak scoring that<br />\nhas characterized the Syracuse team, and, not surpris-<br />\n<br />\nSyracuse at a Glance<br />\n<br />\ningly, it is a trademark<br />\nof the West Genesee<br />\nHigh team also.<br />\nThe main force behind<br />\nSyracuse's scoring ability<br />\nis their attackmen, who<br />\nlast year accounted for<br />\n149 (or 55%) of the<br />\nteam's 262 goals. This<br />\nyear's unit is already being considered the most potent attack in the country. It<br />\nconsists, not surprisingly, of one<br />\nplayer from West Genesee and two from<br />\nYorktown.<br />\nThe leading attackman for Syracuse is senior<br />\nTim Nelson (Yorktown). All Nelson has done in<br />\nhis two years at Syracuse (his freshman year was<br />\nspent at N.C. State) is amass 186 points, being<br />\nnamed to the first team All-America squad and winning the Turnbull Trophy as outstanding Division I attackman both years. Nelson plays behind the goal and<br />\nliterally runs the offense, using his accurate passing<br />\nability to pile up assists at an incredible pace. He was<br />\ninjured in the championship game last year, and is<br />\nreported to be one hundred percent after surgery and<br />\nrehabilitation. Although he will be wearing a brace<br />\nduring the season, it is not likely that it will affect his<br />\nplay.<br />\nWith a Tim Nelson behind the goal, one might think<br />\nthat all the other attackman need do is be the recipient<br />\nof Tim's passes, simply pumping in the goals. And in<br />\none case, this is not far from the truth. Junior Tom<br />\nKorrie, out of West Genesee, piled up 51 goals last<br />\nseason on his way to earning third team All-America<br />\nhonors. A fine player in his own right, Korrie thrived<br />\non Nelson's passing ability in his becoming Syracuse's<br />\nleading scorer last year. In light of this, what perhaps<br />\ncould be considered less than all-around play on Korrie's part makes him no less dangerous.<br />\nThe third attackman, sophomore Tom Nelson, may<br />\nbest be known as Tim's younger brother, although he<br />\ncame into prominence last year in the championship<br />\ngame by scoring 3 goals after replacing brother Tim.<br />\nThis year, Tom will be filling the spot vacated by the<br />\ngraduation of Randy Lundblad. What people may<br />\nsoon observe, though, is that Tom Nelson may be the<br />\nbest all-around attackman on the team. He may not<br />\npile up the statistics that others will(though he did have<br />\n21 goals and 16 assists in limited duty last season), but<br />\nhe can play the crease, scoop up ground balls, hit, feed<br />\nand score. In sum, he is a dedicated, total player. Tom<br />\nbecomes all the more dangerous teamed with Tim, who<br />\nhe has practiced and played with for most of his life.<br />\nIf that were not enough depth at attack, junior Emmett Printup is available in case of injury or just to<br />\ngive someone a rest. Printup had a hat-trick in last<br />\nyear's finals and received recognition for his play in<br />\nthe World Lacrosse Competition held at Los Angeles.<br />\nClearly, in order to stop Syracuse, one must stop their<br />\nattack—all of their attack.<br />\n<br />\nTurning to the midfield, Syracuse may actually be<br />\nslightly weaker than in the past two years. Key losses<br />\nfor the Orange include second team All-America Dave<br />\nDesko and face-off man Mark Burnam. Still, the first<br />\nmidfield unit should be among the best in lacrosse.<br />\nLeading the top line is two-time first team AllAmerica and 1983 Player of the Year Brad Kotz(West<br />\nGenesee). Kotz faces off for that line with mixed<br />\nresults, but more importantly, he can ignite the team<br />\nat any moment, as evidenced by his 31 goals and 30<br />\nassists last season. Kotz is clearly the line's leader as<br />\nwell as being its best player.<br />\nThe second member of the first line, Todd Curry,<br />\nis also from West Genesee. Curry, a sophomore,<br />\nbecame a member of the first midfield as a freshman.<br />\nWhile he is not as prolific a scorer as a Kotz, his outside shot is among the best around. Last season he had<br />\n11 goals, but you can rest assured that most of them<br />\nwere bullets.<br />\nThe second midfield will be led by sophomore Pat<br />\nDonahue, that line's face-off man. He will most likely be joined by John Schimoler, a senior who had a<br />\nsolid season in 1984. The third spot will be filled by<br />\na player yet to be determined, depending upon early<br />\nplay against Carolina and Hopkins. Coach Simmons<br />\nwill use these games to establish a definite line for the<br />\nrest of the year.<br />\n<br />\nSyracuse Orangemen<br />\n1984 Scoring Leaders<br />\nPlayer<br />\nTim Nelson<br />\nTom Korrie<br />\nBrad Kotz<br />\nRandy Lunblad<br />\nTom Nelson<br />\nDave Desko<br />\nTodd Curry<br />\nMark Burnam<br />\nEric Jeschke<br />\nJohn Schimoler<br />\nEmmett Printup<br />\n<br />\nGoals Assists Points<br />\n36<br />\n51<br />\n31<br />\n32<br />\n21<br />\n29<br />\n11<br />\n11<br />\n8<br />\n7<br />\n9<br />\n<br />\n67<br />\n13<br />\n30<br />\n24<br />\n16<br />\n7<br />\n9<br />\n7<br />\n3<br />\n3<br />\n1<br />\n<br />\n103<br />\n64<br />\n61<br />\n56<br />\n37<br />\n26<br />\n20<br />\n18<br />\n11<br />\n10<br />\n10<br />\n<br />\nIn any case, there will likely be a great disparity between the first and second midfield lines. While the first<br />\nmidfield accounted for 47 goals and 39 assists last<br />\nseason, the second midfield (depending upon its third<br />\nmember) will have tallied last year, no more than 19<br />\ngoals with just 6 assists. Because of this, the second<br />\nline becomes more of a supplement to the high<br />\npowered attack than a dangerous unit of its own.<br />\nSyracuse returns their close defense intact, and the<br />\nadded year of experience should be a big plus. Junior<br />\nKevin Sheehan was a third team All-America last<br />\nseason, and this year he will lead the defense as a team<br />\nco-captain. Joining Sheehan will be another junior and<br />\nhonorable mention All-America, Jeff Desko (West<br />\nGenesee),as well as sophomore Mike O'Donnell<br />\n(Yorktown). The three play well as a unit, but still cannot compare with other top defenses. It remains to be<br />\nseen how well they will have progressed from last year.<br />\nExperience on defense can mean a lot, and the difference could be significant. The rope defense of Dan<br />\nPratt, Fred Opie and Chris Burt should see some action, although Simmons does not plan to overly rely<br />\non the unit.<br />\nThe Syracuse goalie will once again be Tom Nims.<br />\nNims, a senior from West Genesee, was named<br />\nhonorable mention All-America in 1984. He is not a<br />\nspectacular goalie, but plays solidly throughout the<br />\nseason. Like most goalies, though, if he becomes hot,<br />\nhe can be tough to penetrate. Syracuse is also fortunate<br />\nto have a top backup goalie in Tom Gygory, a junior<br />\nout of Annapolis. Simmons will probably not hesitate<br />\nto use him should the situation call for it.<br />\nIn sum, the Syracuse team is much like those of the<br />\nrecent past. They will rely heavily on the attack and<br />\nfirst midfield for some high scoring, while hoping that<br />\nthe second midfield and defense can hold their own.<br />\nBut the key to this year's team could be experience.<br />\nThe defense has played together for a full year, and<br />\nthe only real newcomer to the first string is Frank<br />\nLanuto, and he is a senior. Also, players such as Tim<br />\nNelson, Brad Kotz and Tom Nims are seniors, and will<br />\nbe hungry for a championship in their final year. This<br />\ndesire may be Syracuse's most potent weapon of all.<br />\n<br />\n\f16LAX/MARCH 8, 1985<br />\n<br />\nThe Championship Teams of '50 and '84: A<br />\nSeparated by 34 years, the two squads represent<br />\nWhen making such a comparison, a complete<br />\nperspective is required. One must examine all four<br />\nyears of each team's existence: 1981-1984 and<br />\n1947-1950.<br />\nA comparison of teams or, for that matter, players<br />\nof different eras is a delicate undertaking. In the case<br />\nof these two magnificent squads, fortunately, most of<br />\nthe participants are still with us. The author is one of<br />\nthose people who feel that lacrosse is a sport that<br />\nmakes an enthusiast's liver curl with enjoyment. I am<br />\nof the opinion that the nuances and intricacies of the<br />\ngame demand more knowledge than most other sports;<br />\nI am privileged to have witnessed the majority .of<br />\ngames each team played. Therefore, I shall state facts,<br />\ncite quotations, and let the reader form his own<br />\nopinion.<br />\nBill Tanton, sports editor of the Evening Sun, stated<br />\nin a recent article, \"Actually, the 1950 team, as<br />\neveryone calls it, was four teams, from 1947-1950.<br />\nMany argue they were the best four teams in the<br />\nuniversity's history, and if they were, the 1948 squad<br />\nprobably would have to rank immediately behind the<br />\n1950 team on the all-time list. That was the final year<br />\nfor Brooke Tunstall and Ray Greene, two of the best<br />\never to play for the Jays.\"<br />\nDue to conditions created by wartime, both Tunstall<br />\nand Greene earned first team All-America lacrosse .<br />\nhonors at two different universities, the former at Cornell and Hopkins, the latter at Drexel and Hopkins.<br />\nMany knowledgeable lacrosse personalities familiar<br />\nwith Hopkins teams over 60 years were interviewed by<br />\nTanton concerning their choice of JHU's greatest<br />\nteams. These were analyzed and finally released a few<br />\nyears ago by the one-time News-Letter sports editor<br />\nand Hopkins varsity player. He continues to rate the<br />\nsquad of 1950 as his top team in Johns Hopkins<br />\nhistory.<br />\n<br />\n\"The 1984 team is much stronger<br />\nand quicker. They work with weights<br />\nand can probably bench-press 75 or 100<br />\npounds more than we could.\"<br />\n-Wilson Fewster<br />\nThe success of the two teams is self-evident. The<br />\n1950 team members felt good about themselves and<br />\nin turn produced brilliant results. They played and won<br />\n31 consecutive intercollegiate games over four years,<br />\nlosing only 4 games to club teams. The 1984 squad won<br />\n14 intercollegiate games, or almost half that amount,<br />\nin one year. No play-off system existed in 1950, nor<br />\nwere mid-week games played.<br />\nThe game itself has changed much in the 34 years<br />\nthat separate these teams. A momentous disparity exists in the physical equipment used. Besides basic<br />\nathletic shoes, padding, and jerseys, each 1950 player<br />\ncarried a wooden stick with a gut wall and a leather<br />\nand gut strung net. These sticks were usually made by<br />\nIndians in Canada. Since then, a quantum leap forward in the technology of lacrosse sticks has been<br />\nmade. All male players today use a hollow aluminumhandled stick with a synthetic plastic double-walled<br />\nhead strung with nylon cord netting. These modern<br />\nfactory-manufactured sticks are perfectly balanced.<br />\nThe old wooden ones seldom were. Experts claim the<br />\nball tends to settle in the modern-type nets more readily<br />\nthan in the old gut and leather type.<br />\nThe late, legendary Frenchy Julien, closely<br />\nassociated with lacrosse for 60 years, commented, \"I<br />\ncannot understand how a player can miss catching a<br />\nball with today's equipment.\"<br />\nIn 1950 all games were played on natural grass. Today, most games are played on astroturf. A bouncing<br />\nball becomes predictable. Many old-timers recall<br />\nscooping a net full of mud to retrieve a ball.<br />\nAn obvious dissimilarity relates to substitutions. The<br />\n1950 squad ran midfields as units into games, replacing one unit for another to catch its breath. Coaching<br />\nphilosophy in 1984 has changed in sophistication.<br />\nThere are more specialists today. For example, a<br />\ncenter, once he gains possession after a face-off, will<br />\nEditor's Note: Donald T. Fritz was a manager on the<br />\nfour-time national champion 1950 team. He is a<br />\nlifelong lacrosse enthusiast and is currently an associate<br />\neditor of Lacrosse Magazine.<br />\n<br />\nCourtesy of Don Fritz<br />\n<br />\nby Donald T. Fritz '50<br />\n<br />\nThe 1950 national champion Johns Hopkins Lacrosse Team. Front: Billy Morrill. First row, from left: Byron Forbush,<br />\nSollers, Mort Kalus,<br />\nBob Sandell, Fred Smith, Wilson Fewster, Corky Shepard, Jim \"Ace\" Adams, Tom Gough, Joe<br />\nErnest Hansen<br />\nKaestner,<br />\nJohn<br />\nKeller,<br />\nGeorge<br />\nWenzell,<br />\nGeorge<br />\nLloyd Bunting. Second row, from left: Coach Kelso Morrill,<br />\nMitchell,<br />\nGeorge<br />\nleft:<br />\nfrom<br />\nrow,<br />\nThird<br />\nBenson.<br />\nJimmy<br />\ntrainer<br />\nMacauley,<br />\nRoss<br />\nKidd,<br />\nJack<br />\nBishop,<br />\nHamilton \"Ham\"<br />\nBaker.<br />\nRobinson<br />\nVach,<br />\nNeil Pohlhaus, Bill Carroll, Bobby Scott, Don Tate, Mike Dix, Dick<br />\n<br />\nfrequently be individually replaced. Also, as a defensive strategy, long-handled midfield sticks are used.<br />\nGlancing at programs of the two periods, major differences in personnel are obvious. All of the participants but one on the 1950 team were from the<br />\nBaltimore metropolitan area. In 1984, the majority of<br />\nplayers hailed from outside Baltimore. The secondary<br />\nschool graduates of the three major hot-beds of<br />\nlacrosse, Baltimore, upper New York state, and Long<br />\nIsland, presently have a larger selection of lacrosseplaying colleges to attend.<br />\nThe vast majority of the lacrosse team in 1950, with<br />\nlittle or no inducement, voluntarily attended Johns<br />\nHopkins. In 1984, recruiting high school lacrosse talent<br />\nis the norm for most colleges and universities that are<br />\nserious about the sport. In 1950, exactly half of the<br />\nplayers were service veterans and they received monthly subsistence checks. Most native Baltimoreans lived<br />\nat home.<br />\nKarl Levy, captain of the 1926 team, who continues<br />\nto attend Hopkins games, once stated, \"The 1950 team<br />\nwas the best I have seen. Those fellows in 1950 had<br />\na certain maturity because their college had been<br />\ndelayed by the war. They were men, not boys. The<br />\n1984 team was a surprisingly great team. They were<br />\nclever and showed much finesse. The game today is<br />\nmuch smoother and more graceful.\"<br />\n\"Karl Levy might well make a case for his own 1926<br />\nteam which was 9-0 and gave up only 11 goals,\" wrote<br />\nBill Tanton. \"But the 1950 squad was so deep in talent<br />\nstockpiled after World War II that we shall never again<br />\nsee anything like it.\"<br />\nIn 1984, the G.I. Bill, as we knew it is no more.<br />\n<br />\n\"I believe the 1950squad contained<br />\nbetter all-around athletes because most<br />\nof us played other sports. We had a<br />\nsuperior close defense.\"<br />\n-Tom Gough<br />\nTuition, room, and board are now major factors when<br />\na talented lacrosse player considers college. Hopkins,<br />\nin order to compete with universities granting hill<br />\nscholarships, found it necessary some years ago to adjust its athletic philosophy. The university's commitment to pure amateurism in intercollegiate sports continues largely unchanged. Full athletic scholarships are<br />\nnot awarded to Hopkins students. All athletes must<br />\nmeet the University's admission requirements. Limited<br />\nfinancial aid is available; if there is a need, Johns<br />\nHopkins will listen.<br />\nFurthermore, an athlete at Hopkins is presently<br />\npenalized due to NCAA regulations pertaining to<br />\n<br />\nfinancial aid. An athlete receiving scholarship aid in<br />\nlacrosse, a Division I sport at Hopkins, cannot participate in a Division III sport such as football. Only<br />\ntwo members of the 1984 lacrosse team, due to the arrangement of their aid, were able to play another sport.<br />\nAlmost half of the 1950 team participated in two or<br />\n<br />\n\"I cannot understand how a player<br />\ncan miss catching a ball with today's<br />\nequipment.\"<br />\n-Frenchy Julien<br />\nThere are lacrosse players today with the necessary<br />\nacademic credentials attending Hopkins because that<br />\nis where they wish to go. The same situation existed<br />\nin 1950. Because there are considerably more secondary schools playing lacrosse today in many areas of<br />\nthe country than there were in 1950, there exists a<br />\ngreater quantity of good quality lacrosse talent.<br />\nThe convenience of modern athletics also separates<br />\nthese two teams. When Hopkins played Princeton in<br />\n1950, for example, the team bus would leave early<br />\nSaturday morning to travel to Princeton. After their<br />\narrival, players would get dressed, warm up, play the<br />\ngame, and then return to Baltimore the same day. In<br />\n1984, the team left on a Friday, arriving in time to<br />\npractice. The squad ate lunch, dinner, and a Saturday morning meal together. This schedule helps to settle a team down and makes for a better organized and<br />\ncooperative effort.<br />\nThe 1950 team played four years without an intercollegiate loss, winning four straight national championships. In its senior year, it conveyed an impression of invulnerability. The 1984 team, prior to their<br />\nundefeated national championship season, suffered an<br />\noccasional loss, including heartbreaking defeats in<br />\nthree preceding championship finals.<br />\nA clear cut comparison indicates the 1950 team produced two first team All-Americans, one second team,<br />\nand two third team selections. Over its four years, including honorable mentions, the 1950 team generated<br />\na total of 41 All-Americans. The entire 1950 first team<br />\nearned All-America recognition some time during its<br />\nfour years. Interestingly, over their four years, eleven<br />\n1950 players were named to the All-Time J HU Team,<br />\nnine in the year 1950 alone, which is more than any<br />\nteam in the university's history, before or since.<br />\nThe 1984 squad produced four first team AllAmericans, two second team and one third team selection. Over its four years, including honorable mention,<br />\nthe team generated a total of 28 All-Americans. During the four year span from 1981 to 1984, two players<br />\nwere named to the All-Time JHU Team.<br />\nThe supreme honor lacrosse can bestow is election<br />\n<br />\ngi<br />\n<br />\n\fLACROSSE '85/17LAX<br />\n<br />\nComparison of Two of the Best in JHU History<br />\ngreatness in their respective eras.<br />\nto the Lacrosse Hall of Fame. The 1950 team, over<br />\nits four years, proudly boasts of seven members receiving this distinction, including its entire senior year starting midfield. Three other men associated with the<br />\nteam, Kelso Morrill, Howdy Myers, and Bob Scott<br />\nhave also been elected to the Lacrosse Hall of Fame<br />\nin recognition of their skills in playing, coaching, or<br />\nin a combination of the two. Some excellent players<br />\nfrom the 1984 era squad are ultimately destined to be<br />\nselected in future decades.<br />\nAssuming the majority of today's Hopkins students<br />\nare familiar with the 1984 team, some revealing<br />\nhighlights about the 1950 squad include:<br />\n*Its coach in 1950, Dr. Kelso Morrill, professor of<br />\nmathematics, played and starred on Hopkins teams of<br />\nthe mid 1920's, and served as head coach from 1935<br />\nto 1946.<br />\n*Jim 'Ace' Adams, four year standout at midfield,<br />\nthree-time All-America and member of the Hall of<br />\nFame, is presently the head lacrosse coach at the<br />\nUniversity of Virginia. Jim, during his four years on<br />\nSt. Paul's School varsity and the following four years<br />\nat Hopkins, never played on a team that lost an interscholastic or intercollegiate lacrosse game. He also<br />\ncoached at West Point and the University of Pennsylvania, winning a national championship for Army.<br />\n*Bob Sandell, outstanding four year midfielder and<br />\nthree-time All-America, is the most recent member of<br />\nthe team elected to the Lacrosse Hall of Fame.<br />\n*Joe Sollers, the team's phenomenal goalie, threetime All-America, is one of the top executives of STX,<br />\npioneer developers and manufacturers of the present<br />\nday lacrosse stick.<br />\n<br />\n*Fred Smith, Hall of Fame member and fourtime All-America, is presently an assistant coach. Fred<br />\ncoached the JHU varsity in 1951 and 1954.<br />\n*Bill Morrill, mascot, waterboy, and son of the<br />\ncoach, won first team All-America honors at JHU in<br />\n1957, 1958, and 1959. He was elected to the Hall of<br />\nFame and named to the All-Time JHU team.<br />\n*Jack Kidd, second-string defenseman, is the highest<br />\nscoring defensemen in JHU history.<br />\n*Bob Scott, midfielder and author of Lacrosse,<br />\nTechnique and Tradition (JHU Press), coached<br />\nHopkins from 1955 to 1974, winning seven national<br />\nchampionships. He was elected to the Lacrosse Hall<br />\nof Fame, and now serves as the JHU athletic director.<br />\n*Robinson Baker, second-string attackmen, is<br />\n<br />\n\"The 1984 team would have blown<br />\nus off the field. They are faster, bigger, stronger, and overall, more<br />\ntalented.\"<br />\n-Neil Pohlhaus<br />\n<br />\nIt was obvious because he both understood and<br />\ncherished the game. To the memory of this stalwart<br />\nand beloved supporter, the team, at each of its annual<br />\nreunions, continues to drink a toast to his memory<br />\nfrom a pewter mug that he gave them. He had won<br />\nit as an athlete 50 years earlier. \"Uncle John\" called<br />\nthe team of 1950 an \"elegant group of men.\"<br />\nWhat else can anyone add to that?<br />\nSlipping momentarily into the realm of some particularly fascinating trivia: Don Zimmerman, who was<br />\nin his first year as head coach of the 1984 team, played<br />\nhis high school lacrosse under coaches George Mitchell<br />\nand Neil Pohlhaus at St. Paul's School. Both George<br />\nand Neil were four year members of the 1950 team.<br />\nMitchell and Pohlhaus played their high school<br />\nlacrosse at St. Paul's under Howdy Myers. Myers, in<br />\n1947, spent his first three years as a college head<br />\nlacrosse coach at Johns Hopkins. Many of his<br />\nfreshmen varsity players that year starred on the 1950<br />\nteam. Coach Mitchell's son Steve played on the 1984<br />\nJHU team.<br />\nAn indisputable similarity between the teams concerns strong student support. In the 1947-50 era, JHU<br />\nstudents in their zeal, shortly before the big game, borrowed the 650 pound bronze turtle from the University of Maryland campus. The next evening hundreds<br />\nof University of Maryland students \"visited\" the JHU<br />\ncampus seeking their terrapin. A major fracas broke<br />\nout between the twastudent bodies; the pandemonium<br />\nwas eventually quelled by the Baltimore city police riot<br />\nsquad.<br />\n<br />\nSeFry Shifflett - In the Crease<br />\n<br />\npresently a distinguished surgeon at the Johns Hopkins<br />\nHospital.<br />\n*Ernest Hansen, second-string attackman from<br />\nManhasset, Long Island, was the only player not from<br />\nthe Baltimore area.<br />\n*Corky Shepard, diminutive attackman, a fantastically tenacious competitor, is on the all-time JHU<br />\nteam and was a three-time All-America. He repeatedThanks go to Fred Smith and Bill Tanton for all<br />\nly dodged defensemen twice his size to score.<br />\n*Neil Pohlhaus, midfielder, received special atten- their help.<br />\ntion in two of the most exciting games of the 1950<br />\nseason, scoring two goals in the 8-7 victory over<br />\nPrinceton and then having an exchange of words, then<br />\nfists, in the Navy game, which led to mayhem on the<br />\nfield. Hopkins students, led by the charge of their<br />\nband's fiery director, Conrad Geblein, and Neil's<br />\nmother, waving her umbrella, spilled out of the stands<br />\nto do battle with the Midshipmen. Only when the Navy<br />\nBand played the Star Spangled Banner was the crowd<br />\nfinally, brought under control.<br />\nNeil, usually a paragon of virtue, said, \"The 1984<br />\nteam would have blown us off the field. They are<br />\nfaster, bigger, stronger, and overall, more talented.<br />\nThe only way we would have a chance is if they used<br />\nwooden sticks or we used the modern equipment.\"<br />\n*Another distinctive characteristic of the 1950 team<br />\nwas its collective affection and admiration for a<br />\ngentleman respectfully called \"Uncle John\" Richardson. This man was considered the team's good luck<br />\ncharm. It could have been the other way around, for<br />\n\"Uncle John\" also loved the 1950 team. Well-bred,<br />\nThe 1950 team celebrates after its final win.<br />\nretired, and in his golden years, this remarkable man<br />\nthe fortunes of the 1950 team both during<br />\n-time<br />\nfollowed<br />\nthree<br />\nattackman,<br />\nbrilliant<br />\n*Byron Forbush,<br />\nAll-America, is headmaster of Friends School in and after its playing days.<br />\n\"Uncle John\" had been a lacrosse fan since 1890.<br />\nBaltimore. Friends, under Byron's father, Bliss Forbush, generated some of Johns Hopkins' best lacrosse<br />\ntalent.<br />\n*Three defensemen, Tom Gough, Mort Kalus, and<br />\nLloyd Bunting, plus fourth defenseman Ham Bishop,<br />\nplayed as a unit for four years. They each made the<br />\nAll-Time JHU team. Four-time All-America Bunting<br />\nNCAA tournament play came in 1974, three years<br />\nBregman<br />\nwon first team All-American honors three times. by Howard<br />\nafter the organization assumed administration of the<br />\nGough, Kalus, and Bishop each made All-America.<br />\na<br />\nchampionship<br />\nchampionship.<br />\nnational<br />\nof<br />\nThe pressures defending<br />\n\"The 1984 team would probably win in a<br />\nof<br />\nScott admits that while repeating as champion is a<br />\non<br />\ntoo<br />\nthe<br />\nheavily<br />\nshoulders<br />\nweigh<br />\nnot<br />\nhypothetical game because of today's lacrosse sticks,\" should<br />\nfeat, it is certainly possible. \"The pattern in<br />\ndifficult<br />\nand<br />\nthe<br />\nBlue<br />\nJays,<br />\naccording<br />\nZimmerman<br />\nDon<br />\nCoach<br />\nsaid Gough. \"I believe the 1950 squad contained betto maybe win it a couple of years in a row.<br />\nis<br />\nlacrosse<br />\nwho<br />\nBob<br />\nAthletic<br />\nScott,<br />\nScott.<br />\nDirector<br />\nHopkins<br />\nto<br />\nter all-around athletes because most of us played other<br />\nCornell did it in 1976-77, and North Carolina in<br />\nSports. We had a superior close defense. Of the recent coached the varsity squad from 1954 to 1974, should<br />\nduring his twenty year tenure, the lacrosse team 1981-82. To win three in a row, as we did in 1978-80,<br />\nHopkins teams, Mark Greenberg is one of the finest know;<br />\nis very unlikely.\" Scott's own teams won or shared<br />\ncaptured seven national titles.<br />\ndefenseman I have ever seen.\"<br />\nthe title for the four years between 1967 and 1970.<br />\n(Zim\"It should not be especially difficult for him<br />\nMort Kalus, in a burst of candor, admitted, \"I am<br />\nAs for the fact that Zimmerman has yet to lose a<br />\nto<br />\nare<br />\nalways<br />\ngunning<br />\n\"Teams<br />\nScott.<br />\nso biased toward the 1950 team, I could not realistical- merman),\" said<br />\nScott feels that that is an unimportant factor.<br />\ngame,<br />\nreally<br />\ndoesn't<br />\nchampionship<br />\nnational<br />\nA<br />\nHopkins.<br />\nbeat<br />\nly evaluate the two squads.\"<br />\nproblem for Zim to forget what happened last<br />\nno<br />\n\"It's<br />\naspect.\"<br />\nthat<br />\nthe<br />\nchange<br />\nof<br />\nWilson Fewster, midfielder, a member<br />\nZimmerman, who won the title with an undefeated year,\" he said. \"That's the way he'll approach it, and<br />\nLacrosse Hall of Fame, the All-Time JHU team, and<br />\nhow he will prepare his players. He knows that<br />\nSOn of New York Yankee infielder Chick Fewster, season last year, his maiden coaching season, will face<br />\ngunning for Hopkins.<br />\neveryone's<br />\nin<br />\nof<br />\nopponents<br />\nchallenging schedule<br />\nPlayed varsity baseball his junior year, but made the a consistently<br />\nThe<br />\ntoo, should have no difficulty dealing<br />\nplayers,<br />\nplayoff<br />\ncontenders.<br />\nbe<br />\nwill<br />\nwhich<br />\nAll-America team the other three years. He coached 1985, many of<br />\nwith<br />\n\"They have all experienced loswinning.<br />\nconstant<br />\nnational<br />\nown<br />\nhis<br />\nfor<br />\nlonger<br />\nbit<br />\na<br />\nwait<br />\nto<br />\nScott had<br />\nthe JHU squad in 1952 and 1953.<br />\nthen<br />\nin high school. A loss is not<br />\nnot<br />\ning,<br />\nlast<br />\nif<br />\nyear<br />\nhe<br />\n1954,<br />\nin<br />\nhelm<br />\nthe<br />\nat<br />\nStarting<br />\nteam.<br />\nchampionship<br />\n\"You could argue all day and night comparing these<br />\nto<br />\na<br />\nmature.\"<br />\nteam<br />\nfor<br />\nneeded<br />\nHopkins<br />\nas<br />\n1957,<br />\nin<br />\nchampionship<br />\nthe<br />\nto<br />\nJays<br />\nthe<br />\nled<br />\ntwo teams,\" said 'Aillse'. \"The 1984 team is stronger<br />\n\"The real test is to go undefeated in the last three<br />\nand quicker. They work with weights and can probably was voted the number one team over an also<br />\nat the end of the season,\" said Scott.\"We may<br />\ngames<br />\nsquad.<br />\nbench-press 75 or 100 pounds more than we could. undefeated Syracuse<br />\nknocked off at any time during the season,<br />\nget<br />\nwell<br />\nvote<br />\na<br />\nby<br />\nselected<br />\nIn those days, the champion was<br />\nThey play in summer leagues and participate in fall<br />\ntournament games that count.\"<br />\nthe<br />\nit's<br />\nbut<br />\nPractice. We played other sports. Things are very dif- of an executive committee of the United States Interin<br />\ntitle<br />\nonly<br />\nScott's<br />\nAssociation.<br />\ncollegiate Lacrosse<br />\nferent today.\"<br />\n<br />\nScott:Zim Can Take the Pressure<br />\n<br />\n\f18LAX/MARCH 8, 1985<br />\n<br />\nMidfield, Goal Are Strengths of Talented Jays<br />\nContinued from Page 3<br />\n<br />\nSingle's ability to put the ball on goal and to get open<br />\nfor high-percentage shots. In spite of his limited experience, Zimmerman is very high on Single's talents<br />\nand expects him to be a major part of the attack unit.<br />\n\"Bill does the things a creaseman needs to do,\" said<br />\nZimmerman.\"He also hangs in there on the screens.\"<br />\nThielemann improved greatly last year and peaked<br />\nwith a three-goal Performance against Rutgers. This<br />\npre-season he has played well, scoring mostly from the<br />\ncrease area, although Zimmerman has indicated he<br />\nwould not use Thielemann as the creaseman. It is<br />\n<br />\npossible Thielemann will start some games this season,<br />\nthough he should see abundant playing time regardless<br />\nof his role. \"A versatile, steady player,\" is Zimmerman's description,\"who is capable of spelling any of<br />\nthe three starters.\" If his progess continues, this<br />\nCentennial product should emerge as a big contributor.<br />\nMorrill, an All-American at St. Paul's High School<br />\nlast year, has already shown he has the talent to<br />\nchallenge both Single and Thielemann for the third<br />\nstarting position. Zimmerman sees Morrill as a strong,<br />\nheady player who can do well either in the crease or<br />\nbehind the goal. Chances are that Morrill will not start<br />\nversus Syracuse, but Zimmerman probably will not<br />\n<br />\nhesitate to use him should the offense sputter.<br />\nCiccarone is another Baltimore product and the<br />\nthird brother to play for Hopkins, following Henry<br />\nand Brent. An All-American at Boy's Latin prep<br />\nschool, Ciccarone should see limited action this<br />\nyear as Zimmerman has indicated he'll be used<br />\nprimarily as a left-handed back-up.<br />\n,Nordberg transferred from Maryland two years ago,<br />\nbut has yet to play on the squad. He has played fairly<br />\nwell throughout pre-season, though it is doubtful he<br />\nwill see much action this year unless there is a rash of<br />\ninjuries or Hopkins is routing an opponent.<br />\n_<br />\n<br />\nLeading Hopkins' second midfield unit will be<br />\nMutscheller. A quick cutter to the crease, Mutscheller<br />\nhas become a good, smart inside player, according to<br />\nZimmerman, and should have his best games versus<br />\nopponents playing a zone defense. As the seventh<br />\nleading scorer for the Jays last year, Mutscheller will<br />\nbe expected to carry a large part of the scoring load<br />\nand to fill the void left by Tucker, his former linemate.<br />\nWhile his performance will depend to some extent on<br />\nwhoever is feeding from behind the net, Mutscheller<br />\nshould be one of the midfield's top five contributors.<br />\nSchreiber will team with Mutscheller and give the<br />\nsecond line diversity with his ability to drive to the goal<br />\nfrom the outside. Big and strong, Schreiber has shown<br />\nthat he can muscle over defenders, which should open<br />\nthings up inside fol- his linemates. The junior scored<br />\n11 goals last year, including three in the semifinal<br />\nplayoff game versus Carolina, but had only one assist\"<br />\nall season. He will need to pass more if this line is to<br />\nbe successful against Hopkins' stronger opponents.<br />\nChanenchuk will be breaking into the top two midfields after playing infrequently on the third line and<br />\nfor many clears last season. Said Zimmerman,<br />\n\"Chanenchuk is one of the niftiest players, but is<br />\nrelatively new to playing midfield. He needs to continue to improve on defense.\" A Farmingdale, New<br />\nYork product, Chanenchuk will probably play on the<br />\nsame line with former high school teammate<br />\nKrumenacker, which should help him all around. To<br />\nbe successful, however, he will need to improve on his<br />\nshot, which is somewhat weak.<br />\nWhile Castle did not play much during the second<br />\nhalf of the 1984 season, he will also be on one of the<br />\ntop two lines. A quick and extremely fast middie with<br />\na very hard outside shot, Castle will pose a threat to<br />\nany defense. He should be especially helpful against<br />\nzones, where his shot will keep the Jays' opponents<br />\nhonest.<br />\nCrawford continues in much the same capacity as<br />\nlast year, when he impressed many Hopkins fans with<br />\nhis all-out play on the third midfield line. This<br />\nsophomore had only one goal and assist, but netted<br />\n12 groundballs. \"Jack gives 100 percent all the time,\"<br />\nsaid Zimmerman. \"He's relentless and does the things<br />\nyou need him to do. He's going to play.\"<br />\nJohn Dressel, a two-time high school All-America,<br />\n<br />\nis the second third line member.The Lawrenceville product has had an average pre-season, but \"possesses<br />\na wealth of ability,\" according to Zimmerman. He<br />\nmay see extra action on clears.<br />\nRzempoluch is the newest member of the Farmingdale Connection. He will team with Crawford and<br />\nDressel on the third line and may face-off occasionally.<br />\nStewart will play occasionally and may also faceoff. He had a good fall, according to Zimmerman,and<br />\nhas worked hard preparing for the season.<br />\nDiorio will also play infrequently, though his role<br />\nmay change as the season progresses. When he does<br />\nsee action it will probably be on clears.<br />\nWebster is a walk-on and this will be his first season<br />\nwith the team.<br />\nOne of the biggest factors in Hopkins' last two<br />\nchampionship games was ball control off the faceoffs.<br />\nIn 1983, Syracuse dominated late in the game and was<br />\nable to launch its tremendous comeback. Last year, Hopkins jumped out to an early lead as it won nearly<br />\nevery faceoff in the first quarter, and held off Syracuse<br />\nlater on as the faceoff unit retained control of the ball.<br />\nThis season, the Blue Jays will be even stronger as<br />\nthey return all three of their specialists, Greg Matthews, Lee Davidson and Glenn Fidje, and add potential depth with middies Joe Rzempoluch and Damon<br />\nStewart.<br />\nMatthews took the majority of faceoffs last season<br />\n(64 percent) and dominated in almost every game, winning just over three-fifths of them. He also had 84<br />\ngroundballs and won the Ciccarone Ground Ball<br />\nAward for his efforts. This was a vast improvement<br />\nover the 1983 season when he had a modest 55. The<br />\nsenior can only improve this year, and if his progress<br />\nis as dramatic as last year, he may dominate totally.<br />\nDavidson saw considerable action as well, taking a<br />\nquarter of the faceoffs and winning over 64 percent,<br />\nbest on the team. He also scored four goals and added an assist while scooping up 35 groundballs. Davidson will most likely be Matthews' main challenger for<br />\nthe number one position.<br />\nFidge didn't see much action, facing-off only 30<br />\ntimes, but he did win 63 percent and grabbed-up 14<br />\ngroundballs. He will have to work hard to beat out<br />\nhis teammates.<br />\n<br />\nMIDFIELD<br />\nIf you subscribe to the theory that games are won<br />\nat midfield, you'll be happy to know that the middies<br />\ncomprise Hopkins' strongest unit and are probably-the<br />\nbest midfields in the nation. This is largely the result<br />\nof the Jays' small losses and their typically strong<br />\nrecruiting effort. Hopkins lost only three players from<br />\nthis unit as honorable mention All-America John<br />\nTucker and Rich Glancy were graduated, and<br />\nfreshman Tom Engelke transferred to Nassau County Junior College.<br />\nReturning for the Blue Jays are first team AllAmerica and Division I Midfielder of the Year Del<br />\nDressel and second team All-America John<br />\nKrumenacker from the starting line, and juniors Steve<br />\nMutscheller and Chris Schreiber from the second line.<br />\nThe Jays also return seniors Glenn Fidje, Lee Davidson, and Greg Matthews, junior Dave Castle, and<br />\nsophomores Bruce Chanenchuk, Jack Crawford,<br />\nDamon Stewart, and Joe Diorio. New players include<br />\nsophomore Mike Webster and freshman recruits Joe<br />\nRzempoluch and John Dressel.<br />\nDel Dressel is generally regarded as the best midfielder on the squad, having been, by far, the highest<br />\nscoring middie for the last two years. He has also been<br />\nvery consistent, netting 27 goals each year with an<br />\naverage of 18 assists. Additionally, Dressel has been<br />\na veritable ball hog, scooping up 59 groundballs last<br />\nseason while taking well over 100 shots. Perhaps his<br />\ngreatest asset, though, is his ability to lead the transition fast breaks and to score when the team needs<br />\na goal. This season, Dressel should continue to<br />\ndominate at midfield, as he takes one step closer<br />\ntoward becoming only the third four-time first team<br />\nAll-American in collegiate lacrosse history.<br />\nThe second big gun in this unit is tri-captain<br />\nKrumenacker. Despite having a somewhat disappointing season offensively in 1984, Zimmerman is confident in this senior's talents and his ability to bounce<br />\nback to peak form. \"John does a great job defensively and is very good at setting up the other players,\"<br />\nsaid Zimmerman. \"He just needs to concentrate at<br />\nputting the ball on net.\" In addition, nobody on the<br />\nteam executes the clear as well as Krumenacker,<br />\nespecially against the tough riders such as North<br />\nCarolina. Should \"Boomer\" regain his accuracy, he<br />\nwill undoubtedly fill opponents' nets this season.<br />\n<br />\nDEFENSE<br />\npend to a large extent on Matricciani's ability to keep<br />\nthe crease clear.<br />\nPallace will fill Steve Dubin's spot among the<br />\nstarters after spending last year on the rope unit. Termed \"A Gamer\" by Zimmerman, this Calvert Hall product scooped up 15 groundballs last season, while committing but one penalty. According to the coach,<br />\nPallace \"has been practicing and playing extremely<br />\nwell,\" and his continually improving, consistent play<br />\nshould help solidify the defensive unit.<br />\nMcLam is the leader on the rope unit and a potential starter should any of them be injured. A high<br />\nschool midfielder, McLam has the speed and ability<br />\nto lead a fast break upfield as he dished out two assists<br />\nlast season. He also raked in 17 groundballs. \"McLam<br />\ndid an outstanding job last year on the rope,\" said ,<br />\nZimmerman,\"and he has the potential of shutting off<br />\nany midfielder in the country.\"<br />\nA three-sport letterman, Mitchell will again be on<br />\nthe rope unit, although Zimmerman feels this<br />\n\"talented athlete\" has the ability to play crease as well.<br />\nMitchell collected 16 groundballs last year, and with<br />\nhis strengths of speed and size, this sophomore should<br />\ncontribute greatly towards the defense's success.<br />\nA high school All-American two years ago,<br />\nWickwire has not developed as quickly as was expected. Though talented, this Concord Carlisle proContinued on Page 19<br />\n<br />\nJay Matricciani - In the Crease<br />\n<br />\nAnother unit with minimal losses, the Blue Jay<br />\ndefense should be strong again this year. The Jays lost<br />\nonly two players to graduation, starter Steve Dubin<br />\nand Frank DeVita, and return eight lettermen, starters<br />\nfirst team All-America John DeTommaso and cocaptain Guy Matricciani, juniors Dan Pallace, Brad<br />\nMcLam, and Jon Krome, and sophomores Chris<br />\nWickwire, Steve Mitchell and Doug Oursler. The unit<br />\nalso adds freshman walk-on Eric Shaw.<br />\nDeTommaso, a two-year starter, is the anchor of<br />\nthe defense. Big and strong with tremendous endurance, DeTommaso plays extremely aggresively and<br />\nhas the ability to shut down almost every attackman<br />\nin the nation. Last year, this junior had 47 groundballs, tops among defenders, and committed only three<br />\npenalties, the least among starters by far . This year,<br />\nDeTommaso should dominate opposing attackmen<br />\neven more, as he gains greater experience. His importance to this unit, though, is much deeper than his<br />\nplay. As the spiritual leader, DeTommaso's presence<br />\nwill be critical in helping the defense to mature and<br />\nalways play its best.<br />\nTr -captain Matricciani will return to the crease this<br />\nyear and possesses the talent to have an outstanding<br />\nseason. \"Matro\" has very good stickwork and is excellent at leading the charge upfield. He also had 44<br />\ngroundballs, second at his position. This senior will<br />\nhave to continue working hard, though, as the success of Hopkins' man-to-man defensive play will de-<br />\n<br />\nCo-captain Guy Matricciani<br />\n<br />\n\fLACROSSE '85/19LAX<br />\n<br />\nA Freshman's Guide: The Joy ofSpring at the Hop<br />\n0000000000000<br />\n<br />\nc<br />\n<br />\nby Howard Bregman<br />\n<br />\n00000000000<br />\n<br />\n00000000000<br />\n<br />\nA Glossary of Hopkins Lacrosse 0<br />\n0<br />\nSieves: A small but growing band of revolutionaries<br />\nBananas: The traditional Hopkins Lacrosse<br />\nwho gain pleasure from harassing the opposing<br />\ngroupies. They always stand for \"To Win.\" A<br />\nis<br />\ngoalie. Often seen holding ordinary kitchen 0<br />\nbanana<br />\nawarded by the group to the selected<br />\n0<br />\nbrief<br />\n<br />\nIf you are new to Hopkins, the game of lacrosse may<br />\nseem to you to be an interesting bit of trivia. It is played<br />\nreligiously in only a few areas of the globe, and it seems<br />\nto be a rather unorganized mass of activity, anyway.<br />\nplayer of the game.<br />\nWelcome to spring at Homewood. At Hopkins, Boomer: John Krumenacker, Midfield<br />\nwhere complaints about social life and activities are<br />\nChic: Any one of the members of the Ciccarone<br />\never present, lacrosse is an outlet which is almost<br />\nThe patriarch, Henry A. Ciccarone, Sr., was<br />\nclan.<br />\nuniversally enjoyed. Sadly, perhaps, Hopkins is usually<br />\nHopkins' head coach from 1975 to 1983.<br />\nassociated with two institutions: the medical school<br />\nand the lacrosse team. Fortunately, both live up to 0 Deto: John DeTommaso, Defense<br />\n\"Johnny Hopkins\": The fight song played before<br />\ntheir reputation.<br />\nIf you have yet to be exposed to the game, read on. and after each game, as the team enters and leaves<br />\nIf you plan to be at Homewood Field tomorrow, it r, the field.<br />\nLarry: Lawrence J. Quinn, Goalie<br />\nhelps to know what is going on. If you expect to be<br />\nyour<br />\nWille Scroggs, head coach of the UniverScroggs:<br />\nchange<br />\nto<br />\nsomewhere else, this may convince you<br />\nof<br />\nNorth<br />\nsity<br />\nCarolina. The epitome of the oppos0<br />\nplans.<br />\n0 ing coach, someone everyone loves to hate. Hopkins<br />\n0 class of '69.<br />\nThe Game of Lacrosse<br />\nU<br />\n<br />\nLacrosse, in its original form, was widely played by<br />\nNorth American Indians as early as the 1600's. It was<br />\ndescribed in accounts by European settlers, who<br />\nobserved unruly competitions among hundreds of<br />\ncompetitors which lasted from many hours to many<br />\ndays. The game was to the Indians a source of recreation and a means of preparation of warriors.<br />\nLacrosse today has incorporated the essentials of a<br />\ngood spectator sport. Its principles are basic: Two<br />\nteams of ten players each compete on an open field<br />\n110 yards long, with the object of shooting a hard rubber ball into the opposing net. The restrictions which<br />\nmake the game unique are that a player may only control the ball by maneuvering it with a large stick capped by a small net(although the ball may also be kicked). Armed with this weapon, the player can pass,<br />\nbounce, and shoot the ball with remarkable accuracy.<br />\nThe game itself lasts 60 minutes on the college level,<br />\nwith stoppage of play for goals, penalties, and outof-bounds. Penalties include the following: offsides,<br />\nviolated when a team has fewer than three men on the<br />\noffensive side of the field or fewer than four on the<br />\ndefensive side; crease violations; unsportsmanlike conduct; and rough play violations, including pushing,<br />\nslashing, and illegal checking.<br />\nAmong the ten men on the field, three attackmen<br />\nremain on the offensive half of the field, three<br />\ndefensemen occupy the defensive half, and three midfielders traverse the entire field. The goalie directly<br />\nguards the goal and is provided with a circular crease<br />\nwhich the opposing team may not enter.<br />\nStrict restrictions are placed on the sticks, which are<br />\nlimited in material and dimensions. Illegal sticks draw<br />\nsevere penalties.<br />\nRules concerning possession in lacrosse are different<br />\n'than many other sports. Turnovers occur when a ball<br />\nin one team's possession is lost out of bounds or when<br />\na penalty occurs. Another rule unique to lacrosse states<br />\nthat a shot on goal which goes out of bounds is given<br />\nto the player that was closest to the ball when it left<br />\nthe field.<br />\nLacrosse is a game which is constantly in motion.,<br />\nThe officials attempt to keep the game moving as<br />\nquickly as possible by starting the clock as soon as the<br />\nball is ready. A game will last two hours or more<br />\nWithout a boring moment.<br />\nLacrosse at Johns Hopkins<br />\nMost of us have heard this before. It appears in<br />\nevery lacrosse program. Despite the incessant repitition, the statistics are rather awesome:<br />\nSince receiving official recognition from the university in 1888, the Johns Hopkins Blue Jays have. . .<br />\n°won or shared 40 national championships<br />\n*compiled 73 winning seasons, only 13 losing ones, and<br />\n11 even, for a seasonal victory mark of 80 percent..<br />\n'produced 131 first team All-America selections since<br />\nthe first team was chosen in 1922.<br />\n*placed 40 members in the present 147-member<br />\nLacrosse Hall of Fame.<br />\n*twice represented the United States in the Olympic<br />\nGames.<br />\n'won 5 NCAA championships since the tournament<br />\nbegan in 1971.<br />\nMost Hopkins students enter the school knowing little about the game and leave as trained experts. Games<br />\nare very well attended and attract a wide variety of people from the community and the lacrosse world in<br />\ngeneral. Tickets this year cost three dollars, but don't<br />\nworry: admission is free with a student ID.<br />\n<br />\noeceo0000000000e000000000e®<br />\n<br />\n00000000000<br />\n<br />\n0000000000000<br />\n<br />\nstrainers. For more information, see the<br />\narticle on page 12.<br />\nSimmons: Roy Simmons, Jr., head coach of<br />\nSyracuse University. Quickly becoming the new<br />\nepitome of the opposing coach.<br />\n\"To Win\": The fight song with the silly lyrics<br />\nplayed after each Hopkins goal. Few people actual')<br />\nknow the words. Mark Margolin, Hopkins band<br />\ndirector, knows them.<br />\n\"We Want More\": Come to a game. You'll find<br />\nout.<br />\nZim: Johns Hopkins Head Coach Don Zimmerman. Noted for being Homewood's most eligible<br />\nbachelor.<br />\n<br />\n000<br />\n<br />\n000000000000000000000000000000000000000000000000040C>04>0®<br />\n<br />\nQuinn to Quarterback Defense<br />\nContinued from Page 18<br />\n<br />\nQuinn had 188 saves and surrendered only 76 goals<br />\nduct seems to lack concentration and aggressiveness in 1984 for a .712 save percentage. He also led the team<br />\non the field. Zimmerman has indicated that he will with 87 groundballs, a high total for a goalie, and inallow Wickwire more playing time as he developes dicative of his prowness outside the crease. Often,<br />\nphysically and improves his one-on-one play. Wickwire Quinn will leave the goal mouth to intercept a pass or<br />\nwill play on the rope unit.<br />\nstick check an unsuspecting attackman.<br />\nKrome, though he did not play much last season,<br />\nBesides being the final line of defense, Quinn is like<br />\nhas improved greatly and will battle Wickwire for a a captain at the helm of his ship, letting the defensemen<br />\nrope position.<br />\nknow where the ball is at all times and keeping conShaw will probably not play much this season. A trol. \"He's not only a tremendous stopper,\" said Zimwalk-on from Denver, Colorado, he simply has too merman, \"he's a tremendous leader.\" In addition,<br />\nmany talented teammates to contend with.<br />\nQuinn's ability to make a save and quickly fire an<br />\nOursler is another victim of his teammates. He may outlet pass upfield is one of the keys to Hopkins'<br />\nget playing time against Princeton and Towson State. highly successful transition game.<br />\nJones, a Loch Raven graduate, will be fulfilling a<br />\nvery important role this year. As the number two<br />\nThe goal is definitely the Blue Jays' strongest posi- goalie, he must be ready to fill in for Quinn at any<br />\ntion, though it lacks the depth of he midfield. The time. Unfortunately, Coach Zimmerman has indicated<br />\nmain reason for its strength is the return of first team that he will only play Jones should Quinn be injured<br />\nAll-America, Division I MVP, and Championship or if Hopkins has a very comfortable lead.<br />\nGame MVP Larry Quinn. Hopkins also returns<br />\nDespite Jones' limited exposure his freshman year<br />\nsophomore Stuart Jones and has recruited freshman (he had eight saves while allowing five goals), he has<br />\nJeff Kramer. John Madden, the number two goalie looked poised in the goal and lacks only experience,<br />\nlast season, has decided to retire.<br />\nparticularly on clears. Said Zimmerman,\"I have total,<br />\nTr -captain Quinn is probably the most important • confidence in Stuart's abilities.\"<br />\nAs the number three goalie, Kramer's playing time,<br />\ncontributor to the team. His steady, often spectacular<br />\nplay last season was one of the main reasons Hopkins will be very limited. That is, unless Quinn and/or<br />\nwas able to claim the national championship. \"He's Jones cannot play. A high school All-American from<br />\nthe key,\" say Zimmerman. \"Whenever you have a Ohio, Kramer needs to gain collegiate experience and<br />\ngoalie of Larry's ability, you're going to cover a lot a feel for the Homewood turf; he looked weak on the<br />\nof mistakes.\"<br />\nhigh astro-bouncers during fall scrimmages.<br />\n<br />\nGOAL<br />\n<br />\nUSED CONTAINERS<br />\n20 OR 40 FOOT<br />\nFOR SALE<br />\n686-4430 ME 8 am-4 pm<br />\n!;rir7777<br />\nit<br />\n( ,<br />\n<br />\n.,_<br />\n<br />\nGREAT FOR STORAGE SHED<br />\nCall<br />\nHANK THIELEMANN<br />\n<br />\n-<br />\n<br />\n\fHAVE AN<br />\nALL LACROSSE SPRING!!<br />\n!MOM ST QUART..<br />\n<br />\nRAIN SHEET<br />\n<br />\nOT<br />\n<br />\nOT<br />\n<br />\n01<br />\n<br />\nTOT.<br />\n<br />\nMOTO<br />\n<br />\nMOW 1.401<br />\n<br />\n3.0331 1133.<br />\nVein.<br />\n<br />\n__.,2.<br />\n13<br />\n,1•06 T(331<br />\n<br />\nMONO<br />\n031.C.31.3<br />\n<br />\nECC - LACROSS<br />\n1111.1111<br />\n<br />\nCOAC11111<br />\n<br />\nALL NEW<br />\n<br />\n1.0311 OUTS<br />\n<br />\n1306011 TWO<br />\nHOOK TWA<br />\nOOTINO<br />\n<br />\nMILO 31/13311<br />\n<br />\n0.3<br />\n<br />\n1111.1.1<br />\nOW.111111<br />\n<br />\n0.0.11113<br />\n1<br />\n<br />\n3<br />\n<br />\n•<br />\n<br />\no3C1334<br />\n<br />\n1<br />\n<br />\n3<br />\n<br />\nAll Lacrosse<br />\nThe \"Rain Sheet\"<br />\nLaminated sheet allows you to keep game<br />\nstats in any weather. Transfer them to your<br />\npermanent records...wipe clean and use<br />\nagain!<br />\n<br />\nAll Lacrosse<br />\n<br />\nSHOOTING<br />\nNETS!<br />\n<br />\nBIGGER<br />\nTHAN EVER<br />\nfor<br />\nThe Official<br />\n<br />\n1985<br />\nALL LACROSSE<br />\n<br />\nEquipment Catalog<br />\n<br />\n• Any Color<br />\n• Great for<br />\nPractice<br />\n<br />\n19851!<br />\n• New Sticks<br />\n• New Pads<br />\n• New Helmets<br />\n• Shirts & Shimmels<br />\n• Posters & Novelties<br />\n• Components/Accessories<br />\n• Much, Much More!<br />\n<br />\n$25°<br />\n<br />\nThe Original<br />\nAll Lacrosse<br />\nTM<br />\n<br />\nGoal Net<br />\n100% Guaranteed<br />\n<br />\nALL LACROSSE<br />\nIF IT HAS ANYTHING<br />\nAT ALL TO DO WITH<br />\nLACROSSE...<br />\n<br />\n18 So. Fullerton Ave.<br />\nMontclair, N.J. 07042<br />\n(201) 746-3222<br />\n<br />\n800-LACROSS<br />\nFor Orders Only<br />\n<br />\n\f", "format": "basic_html", "processed": "LAcRosise 185<br />\nVOLUME .89 NUMBER 20LAX<br /><br />\nA Special Supplement to The Hopkins News-Letter<br /><br />\nisaiNNINr•<br /><br />\nMARCH 8, 1985<br /><br />\n,7NIMMIk<br /><br />\n2LAX/MARCH 8, 1985<br /><br />\nLACROSSE 185<br /><br />\nTo Our Readers:<br /><br />\nTABLE OF CONTENTS<br />\nContents, Table of<br />\nBlue Jay Team Report<br /><br />\nPage 2<br /><br />\nThe 1985 Blue Jays<br />\nBlue Jay Schedule Analysis<br /><br />\nPage 4<br />\nPage 6<br /><br />\nNational Schedule Analysis<br /><br />\nPage 9<br /><br />\nPage 3<br /><br />\nTomorrow's Game<br /><br />\nPage 10<br /><br />\nFreshmen<br /><br />\nPage 12<br /><br />\nAn Interview with Coach Roy Simmons, Jr. . . . .Page 13<br />\nPage 14<br />\nPenn Lacrosse Report<br />\nPage 15<br />\nSyracuse Lacrosse Report<br />\nThe Championship Teams of '50 and '84<br /><br />\nPage 16<br /><br />\nA Freshman's Guide<br /><br />\nPage 19<br /><br />\nThe idea of a special lacrosse insert was born in<br />\nthe fall when it was decided that the national champion Blue Jays should receive some of the coverage<br />\nthey deserve. The result is this special issue, which<br />\nis, to our knowledge, the most extensive of its kind<br />\nin News-Letter history. \"Lacrosse '85\" would not<br />\nexist, however, were it not for the assistance of<br />\nmany people.<br />\nWe thank Coaches Don Zimmerman and Roy<br />\nSimmons, Jr., for their help in our coverage of each<br />\nof their teams. Jerry Shifflett of \"In the Crease\"<br />\nprovided scores of photographs for our use. We<br />\nespecially thank Mr. Don Fritz for his gracious efforts in recalling a bygone era.<br />\nWe are most indebted, however, to the members<br />\nof the News-Letter staff for their tireless assistance.<br />\nEditor Eileen Fitzgerald and Managing Editor<br />\nKathrin Engisch were supportive throughout. We<br />\nthank Maria Mitchell, Sharon Fischman, and Brad<br />\nHandler for their technichal assistance. Larry Volz<br />\nand Jess Bunshaft donated valuable time for the<br />\nphotography.<br />\nWe are grateful to our contributors Craig Caplan<br />\nand Adam Warner for their skill and punctuality,<br />\nto Skip Collins for his sleepless hours, and to<br />\nGregory King and Mary Ginder for their constant<br />\nenthusiasm.<br />\nFinally, we would like to thank Chuck Maute,<br />\nBusiness Manager, Tammy Huck, Production<br />\nManager, and David Epstein, reporter extraordinaire. Without their time, effort, and dedication,<br />\nthis issue would be a shell of what it is.<br /><br />\nHoward Bregman<br /><br />\nDavid Brengel<br /><br />\nSports Editors<br />\nLacrosse '85 is a special supplement to The Hopkins News-Letter which is published by the students<br />\nof The Johns Hopkins University. Editorial and business corespondence should be directed to Box 1230,<br />\nThe Johns Hopkins University, Baltimore, MD. 21218. Telephone (301) 338-7647. Business hours are<br />\nTuesday and Wednesday, 1-5 p.m. Circulation: The Hopkins News-Letter 6000; Lacrosse '85 15000.<br /><br />\nCover Photo: Jerry Trout Lacrosse Magazine<br /><br />\nP.J.'S PUB<br /><br />\nHOME OF BLUE JAY LACROSSE<br />\nSEE YOU BEFORE &amp; AFTER<br />\nTHE GAME<br />\nALL GAMES SHOWN<br />\nLIVE ON HOME TEAM SPORTS<br /><br />\n1984 NCAA CHAMPS<br /><br />\nA<br /><br />\nLACROSSE.'85/3LAX<br /><br />\nThe Blue Jays<br /><br />\nJays' Quest For A Sixth Title Begins Tomorrow<br />\ntogether. They pose a tremendous threat to our opponents because if you shut one off the other can still<br />\nWith a convincing 13-10 victory over Syracuse in the put you away.\" Krumenacker and Dressel totalled 37<br />\n1984 Division I Championship Game, Head Coach goals and-31 assists between them in 1984.<br />\nJuniors Steve Mutscheller and Chris Schreiber will<br />\nDon Zimmerman and his Blue Jays capped a perfect<br />\nstay together and comprise the second line along<br />\nalso<br />\nchampionship<br />\nfirst<br />\nits<br />\nwon<br />\nHopkins<br />\n14-0 season as<br />\nwith<br />\njunior Dave Castle. Both Mutshceller and<br />\ntitle<br />\nthree<br />\nprevious<br />\nthe<br />\nlost<br />\nhad<br />\nJays<br />\nThe<br />\nsince 1980.<br />\nof<br />\npossess the potential to have excellent<br />\ndanger<br />\nSchreiber<br />\nin<br />\nwere<br />\nand<br />\ngoals<br />\nfour<br />\nof<br />\ntotal<br />\na<br />\ngames by<br />\ngraduating a senior class which had not been part of seasons, but Castle's abilities are rather unknown, as<br />\na championship squad, for the first time in decades. he played little during the second half of the 1984<br />\nIn addition, Zimmerman became the first rookie coach campaign.<br />\nStarting on the third midfield line will be sophomore<br />\nto lead his team to an NCAA crown.<br />\nSurprisingly, Hopkins will face Syracuse again, Jack Crawford and freshmen John Dressel and Joe<br />\ntomorrow, as the Blue Jays open the 1985 lacrosse Rzempoluch. All three have looked promising during<br />\nseason. The game, scheduled to start at 2:00 p.m. on the preseason and it is possible that one of them may<br />\nHomewood Field, will be the third meeting of these join either the first or second unit. Still this unit will<br />\ntwo teams since the 1983 Championship Game which have only limited playing time. \"They won't play as<br />\nmuch as the first and second lines, and will only spell<br />\nthe Orangemen won, 17-16.<br />\nthan<br />\nwhen necessary,\" Zimmerman said.<br />\nstronger<br />\nthem<br />\nbe<br />\nto<br />\nappear<br />\nJays<br />\nBlue<br />\nOverall, the<br />\nsignificant<br />\ndepth at midfield will be a definite advanHopkins<br />\nsuffering<br />\nattack<br />\nthe<br />\nonly<br />\nwith<br />\nyear,<br />\nlast<br />\nlosses. Hopkins returns three first team All-Americans, tage as the season wears on and especially against the<br />\nincluding a Division I Most Valuable Player at mid-, Blue Jays' tougher opponents. With the current emphasis on running a transition game, three good midfield and in the goal, and two second teamers. In<br />\nlines is almost a must; ask Syracuse Head<br />\nfield<br />\nl<br />\nlose<br />\nand<br />\nstarters,<br />\nsix<br />\nthe Jays retain 26 lettermen and<br />\nCoach Roy Simmons, Jr. about the imporLacrosse<br />\nsquad.<br />\nyear's<br />\nbut nine members of last<br />\nHopkins' having three lines to the<br />\nof<br />\ntance<br />\nCraig<br />\nsophomores<br />\nstart<br />\nwill<br />\nOn attack, Zimmerman<br />\nBubier and second team All-America Brian Wood and Orangemen's one and a half during the 1984 Chamjunior Bill Single. Freshman Mike Morrill and junior pionship Game. Said Coach Zimmerman,\"I believe<br />\nClarke Thielemann may also start during the course games are won and lost at midfield. Depth at midfield<br />\nis always the key. Having three lines allows you to rest<br />\nof the season.<br />\nWith the graduation of starters Peter Scott and cap- your players so they can be fresh at the end of the<br />\ntain Willy Odenthal, the attack unit will lack game ex- game, when its most important.\"<br />\nAlso crucial to the Blue Jays' success this year will<br />\nperience. Scott's role as the feeder will be a difficult<br />\nthe play of senior faceoff specialists Greg Matthews,<br />\nbe<br />\nmay<br />\noffense<br />\nquick-cutting<br />\nJays'<br />\nthe<br />\nand<br />\nfill,<br />\nto<br />\none<br />\nLee Davidson, and Glenn Fidje. Together and insuffer somewhat during the first several games.<br />\nRegardless, Zimmerman is confident that there will dividually they won greater than 60% of their faceoffs<br />\nbe no problems. \"I'm a firm believer in giving the last season and were instrumental in Hopkins' ability<br />\ncrease a good look,\" he said. \"If Wood can put the to control the tempo of its games. Their control of the<br />\nball on the money, it makes sense to go inside to the ball will be one of the keys to shutting down fastbreaking Blue Jay opponents such as Syracuse and<br />\ncrease.\"<br />\nWhether the attack will again produce three of the North Carolina.<br />\nTwo starters return for the defense, but as Coach<br />\nteam's top four scorers, as in 1984, is difficult to determine, as the scoring balance will be affected greatly Zimmerman has indicated, the remainder of the unit<br />\nby the team's style of play. \"It's hard to say,\" stated lacks game experience. Much of the responsibility for<br />\nZimmerman.\"When you push the ball like we did last stopping the opposition rests with first team Allyear, you get a lot of goals from the attack. That's America John DeTommaso. Only a junior, DeTomtypical of a transition game. We hope to be as suc- maso can reduce almost any attackman in the nation<br />\nto a mere observer. Unfortunately, that is not enough,<br />\ncessful moving the ball this year as last.\"<br />\nLosses from the midfield, the most talent-deep unit, and the Blue Jays will be counting on senior tri-captain<br />\nwere minimal, although honorable mention All- Guy Matricciani to keep the crease clear. A starter last<br />\nAmerica John Tucker will be sorely missed. Tucker's season, Matricciani will have to even out his erratic<br />\nall-out play and punishing checks often inspired the play, as Hopkins has too many powerful opponents<br />\nJays and Zimmerman is \"hoping that somebody rises to allow for defensive lapses. The third spot will be<br />\nto the surface and gives us that play.\" He pointed to filled by junior Dan Pallace, who looked impressive<br />\nsophomore Jack Crawford and junior Chris Schreiber on the rope last season and is a steady, reliable<br />\nperformer.<br />\nas potential candidates.<br />\nDel<br />\nMidfielder<br />\nComprising the rope unit will be junior Brad<br />\nOutstanding<br />\nThe first line will return<br />\nJohn<br />\nMcLam<br />\nand sophomores Steve Mitchell and Chris<br />\nAll-America<br />\nteam<br />\nsecond<br />\nDressel and<br />\nKrumenacker. Sophomore Bruce Chanenchuk will Wickwire. Zimmerman made good use of this line last<br />\nyear, and with a very good stickhandler in McLam,<br />\ngain the third position.<br />\nWhile both Dressel and Krumenacker are capable he will be able to use the rope often and still be able<br />\nof leading their own lines, Zimmerman feels that by to push the ball upfield quickly. This line's game time<br />\nteaming them, they can be even more dangerous. \"By may be limited, however, by Zimmerman's desire to<br />\nthe end of last year, they were playing very well keep his middies in if they can handle the job.<br /><br />\nby David Brengel<br /><br />\nReturning in the goal is All-Everything Larry Quinn.<br />\nThe spectactular play of this senior tri-captain last<br />\nseason is generally regarded as the reason Hopkins won<br />\nthe national championship. Another strong year by<br />\nQuinn could be all the edge the Blue Jays need to<br />\nrepeat.<br />\nIt is interesting to note that the last four times<br />\nHopkins has had a first team All-American in the goal<br />\n(Mike Federico - 1978-80; Quinn - 1984) it has won<br />\nthe national title. It is also interesting that the previous<br />\ntwo recipients of first team All-America in the goal<br />\nSears, North Carolina - 1982; George Slabowski, Army-1983) were juniors and were unable to repeat<br />\nthe tollowing year.<br />\nWilliam Tierney will join the Blue Jay coaching staff<br />\nfor the first time after spending the last several years<br />\nat the helm of the Rochester Institute of Technology<br />\nlacrosse team. Tierney won the 1984 Division III<br />\nCoach of the Year award as RIT made the playoffs<br />\nfor the first time. Tierney will work with the goalies,<br />\nmidfielders and the man-down defense.<br />\nReturning assistant coaches Jerry Pfeifer and Fred<br />\nSmith will guide the defense and Joe Devlin, the offense. Dennis Townsend works with the attackmen and<br />\ndefensemen individually, and Joe Cowan instructs the<br />\nextra-man offensive unit.<br />\nWith their most difficult schedule in decades, the<br />\nBlue Jays must concentrate on consistent play and not<br />\ntake any opponent lightly. \"Every team on our<br />\nschedule has the potential to beat us,\" says Zimmerman,\"if we're not mentally and physically prepared.<br />\nWe looked at the practice schedule and targeted areas<br />\nto work on early this year to avoid inconsistent play.<br />\nIf we have a good attitude, work hard and stay<br />\nphysically sound, I'm confident of our chances.\"<br /><br />\nATTACK<br /><br />\nAll-America attackman Brian Wood<br /><br />\nThe Blue Jay attack unit appears to be solid this year<br />\ndespite the loss to graduation of starters Peter Scott<br />\n(first team All-America) and Captain Willy Odenthal<br />\n(third team All-America), Brent Ciccarone, and Eric<br />\nDressel. The team returns second team All-America<br />\nBrian Wood and fourth man Craig Bubier, as well as<br />\nClark Thielemann and Bill Single. In addition, Coach<br />\nZimmerman has added Geoff Nordberg and two<br />\nhighly talented freshman recruits, Mike Morrill and<br />\nJohn Ciccarone.<br />\nWood was the third leading scorer for Hopkins last<br />\nyear, both in goals and total points, and should be the<br />\nhub of this year's attack. As the attackman with the<br />\nmost game experience, Wood is expected by Zimmerman to be the \"quarterback on the attack,\" with the<br />\nteam looking to him \"to anchor the unit.\" Wood<br />\nneeds to become a more reliable scorer, though, and<br />\nhis ability or inability to play consistently will have major ramifications for the team.<br />\nOutside of the added responsibility of leading the<br />\nattack, this sophomore's role should change little. He<br />\nwill be positioned primarily to one side of the goal,<br />\nusually about ten yards out, looking either to drive<br /><br />\ntowards the goal or to quickly release a shot. Either<br />\nway, fans can expect Wood to have the ball often and<br />\nto score 25-30 goals this season.<br />\nBubier will join Wood as a definite starter. Zimmerman describes Bubier as \"a power attackman who'll<br />\ngo one-on-one a lot.\" Additionally, he'll probably<br />\nemerge as the unit's primary feeder, although his exact role may depend on who Zimmerman plays at the<br />\nthird attack position. Tall and agile, Bubier seems a<br />\nnatural to play behind the goal, but he has added<br />\nenough muscle to also hold his own in the crease area.<br />\nLast year, Bubier tallied six goals and five assists<br />\ndespite limited playing time. With his ability to cut<br />\nquickly to the net and a hard turn-around shot, this<br />\nsophomore's ,mbers should more than double this<br />\nyear.<br />\nRounding out the starting unit at the crease position should be Single, who has the notable distinction<br />\nof having scored on 80 percent of his shots over the<br />\nlast two years. While he has tallied only four times,<br />\nincluding three last year, the figure is an indication of<br />\nContinued on Page 18<br /><br />\n41-vViaaZEICa<br /><br />\nI9R5<br /><br />\nClark Thielemann<br />\n# 11 Attack<br />\nJunior<br />\nEllicott City, Maryland<br />\nCentennial<br />\n165 lbs.<br />\n511\"<br /><br />\nJohn Dressel<br />\n# 2 Midfield<br />\nFreshman<br />\nBaltimore, Maryland<br />\nLawrenceville<br />\n5'11\"<br />\n180 lbs.<br /><br />\nThe 1985<br /><br />\nopivatis<br /><br />\nPhotos by Larry Volz<br /><br />\nDel Dressel<br />\n# 4 Midfield<br />\nJunior<br />\nBaltimore, Maryland<br />\nGilman<br />\n180 lbs.<br />\n6'2\"<br /><br />\nGreg Matthews<br />\n# 12 Midfield<br />\nSenior<br />\nFranklin Square, NY<br />\nChaminade<br />\n175 lbs.<br />\n5'9\"<br /><br />\nGuy Matricciani<br />\n# 7 Defense<br />\nSenior<br />\nBaltimore, Maryland<br />\nBoy's Latin<br />\n170 lbs.<br />\n5'10\"<br /><br />\nBruce Chanenchuck<br />\n# 13 Midfield<br />\nSophomore<br />\nMassapequa, New York<br />\nFarmingdale<br />\n160 lbs.<br />\n5'9\"<br /><br />\nJohn Ciccarone<br />\n# 8 Attack<br />\nFreshman<br />\nBaltimore, Maryland<br />\nBoy's Latin<br />\n160 lbs.<br />\n5'10\"<br /><br />\nJoe Rzempoluch<br />\n# 14 Midfield<br />\nFreshman<br />\nFarmingdale, New York<br />\nFarmingdale<br />\n190 lbs.<br />\n6'0\"<br /><br />\nCraig Bubier<br />\n# 9 Attack<br />\nSophomore<br />\nAnnapolis, Maryland<br />\nSt. Mary's<br />\n195 lbs.<br />\n6'3\"<br /><br />\nBrian Wood<br />\n# 15 Attack<br />\nSophomore<br />\nSherwood Forest, MD<br />\nSt. Mary's<br />\n170 lbs.<br />\n6'0\"<br /><br />\nGeoff Nordberg<br />\n# 10 Attack<br />\nJunior<br />\nTowson, Maryland<br />\nDulaney<br />\n170 lbs.<br />\n6'1\"<br /><br />\n14013KIN<br /><br />\nGlenn Fidje<br />\n# 16 Midfield<br />\nSenior<br />\nSt. James, New York<br />\nSmithtown East<br />\n170 lbs.<br />\n5'8\"<br /><br />\nIVPKIto<br /><br />\nLee Davidson<br />\n17 Midfield<br />\nSenior<br />\nAnnapolis, Maryland<br />\nSt. Mary's<br />\n175 lbs.<br />\n510\"<br /><br />\n#<br /><br />\n441tikt<br /><br />\n-4 •<br /><br />\nStuart Jones<br />\n# 18 Goal<br />\nSophomore<br />\nGlen Arm, Maryland<br />\nLoch Raven<br />\n155 lbs.<br />\n5'7\"<br /><br />\nDavid Castle<br />\n# 19 Midfield<br />\nJunior<br />\nAbington, Pennsylvania<br />\nLawrenceville<br />\n170 lbs.<br />\n511'<br /><br />\ntetalik.<br /><br />\nSteve Mutscheller<br />\n# 20 Midfield<br />\nSenior<br />\nBaltimore, Maryland<br />\nLoyola<br />\n170 lbs.<br />\n6'0\"<br /><br />\nLarry Quinn<br />\n# 21 Goal<br />\nSenior<br />\nLevittown, New York<br />\nLevittown Memorial<br />\n175 lbs.<br />\n6'2\"<br /><br />\n's4t<br /><br />\n0<br /><br />\n•<br /><br />\nJon Krome<br />\n# 38 Defense<br />\nJunior<br />\nBaltimore, Maryland<br />\nFriends<br />\n180 lbs.<br />\n6'0\"<br /><br />\nBlue Jays<br />\nDrawings by Evan Krakovitz<br /><br />\nDoug Oursler<br />\n# 39 Defense<br />\nSophomore<br />\nBaltimore, Maryland<br />\nGilman<br />\n5'10\"<br />\n175 lbs.<br /><br />\nJeff Kramer<br />\n#22 Goal<br />\nFreshman<br />\nWorthington, Ohio<br />\nWorthington<br />\n510\"<br />\n160 lbs.<br /><br />\nJohn DeTommaso<br />\n# 41 Defense<br />\nJunior<br />\nFarmingdale, New York<br />\nFarmingdale<br />\n185 lbs.<br />\n6'0\"<br /><br />\nJoe DiOrio<br />\n#* 23 Midfield<br />\nSophomore<br />\nNew Hyde Park, New York<br />\nSewanhaka<br />\n175 lbs.<br />\n5'9\"<br /><br />\nBrad McLam<br />\n# 27 Defense<br />\nJunior<br />\nDix Hills, New York<br />\nHalf Hollow Hills West<br />\n195 lbs.<br />\n6'2\"<br /><br />\nChris Schreiber<br />\n# 24 Midfield<br />\nJunior<br />\nHolbrook, New York<br />\nSt. Anthony's<br />\n190 lbs.<br />\n6'0\"<br /><br />\nChris Wickwire<br />\n# 29 Defense<br />\nSophomore<br />\nConcord, Massachusetts<br />\nConcord Carlisle<br />\n185 lbs.<br />\n6'2\"<br /><br />\nMike Morrill<br />\n# 25 Attack<br />\nFreshman<br />\nTimonium, Maryland<br />\nSt. Paul's<br />\n185 lbs.<br />\n6'0\"<br /><br />\nDan Pa!lace<br />\n# 26 Defense<br />\nJunior<br />\nBaltimore, Maryland<br />\nCalvert Hall<br />\n185 lbs.<br />\n6'1\"<br /><br />\nJack Crawford<br />\n# 30 Midfield<br />\nSophomore<br />\nRockville, Maryland<br />\nMercersburg<br />\n175 lbs.<br />\n5'11'<br /><br />\nOKItt<br />\nJohn Krumenacker<br />\n# 32 Midfield<br />\nSenior<br />\nFarmingdale, New York<br />\nFarmingdale<br />\n175 lbs.<br />\n6'3\"<br /><br />\nSteve Mitchell<br />\n# 44 Defense<br />\nSophomore<br />\nBrooklandville, Maryland<br />\nSt. Paul's<br />\n6'5\"<br />\n200 lbs.<br /><br />\nBill Single<br />\n# 33 Attack<br />\nJunior<br />\nBaltimore, Maryland<br />\nOverlea<br />\n6'0\"<br />\n160 lbs.<br /><br />\nEric Shaw<br />\n# 45 Defense<br />\nFreshman<br />\nDenver, Colorado<br />\nSouth Denver<br />\n180 lbs.<br />\n6'1\"<br /><br />\nDamon Stewart<br />\n# 35 Attack<br />\nSophomore<br />\nHuntingdon, New York<br />\nCold Spring Harbor<br />\n165 lbs.<br />\n5'9\"<br /><br />\nMike Webster<br />\n# 46 Midfield<br />\nSophomore<br />\nTimonium, Maryland<br />\nLaLumiere<br />\n5'11\"<br />\n170 lbs.<br /><br />\n6LAX/MARCH 8, 1985<br /><br />\nThe Road to Providence: From Start to Finish, A<br />\nSyracuse and North Carolina highlight a schedule that<br />\nby David Epstein<br /><br />\nyear's loss; Hopkins wants to defend its title. But when<br />\nthe Blue Jays play with intensity, they are the best team<br />\nin the country, and are virtually unbeatable at<br />\nHomewood.<br /><br />\nThe Johns Hopkins Blue Jays enter the 1985 season<br />\nas defending champions and the pre-season favorites,<br />\nand each game will be a true test of their ability. From<br />\nstart to finish, the Jays must face the top teams in Prediction: Hopkins 13, Syracuse 11<br />\nlacrosse in their quest to retain the title. The following is a game-by-game analysis of this year's Blue Jay<br />\nManhasset, N.Y.<br />\nschedule and a look at some other top teams' HOBART<br />\n2:00 p.m.<br />\nschedules, including an analysis of key games, as well Saturday, March 10<br />\nHistorical Series: Blue Jays lead, 2-0<br />\nas a few predictions along the way.<br />\nA reminder that all Blue Jay games can be heard on<br />\nWJHU, 88.1 FM.<br /><br />\nEach year, lacrosse fans talk about why Hobart is<br />\nnot a Division I team, and how they would fare if they<br />\nwere. And each year, the Statesmen receive a chance<br />\nto prove themselves when they face the Division I<br />\nchamps in the now traditional Day of Champions<br />\ngame on Long Island.<br />\nHobart has dominated Division III lacrosse, winning the NCAA championship the last five years. They<br />\nhave not always done well against Division I schools,<br />\nhowever, losing to such non-notables as C.W. Post.<br />\nStill, the Statesmen can play among the best, as<br />\nevidenced by their 1983 victory over North Carolina,<br />\nwhich ended the Tar Heels' 26-game winning streak.<br />\nThe Statesmen are led by attackmen Mark Van<br />\nArsdale (32 goals, 28 assists in 1984) and Tom<br />\nGrimaldi(26 goals, 19 assists). Grimaldi was voted the<br />\noutstanding attackman in Division III in 1984 while<br />\nVan Arsdale was named Hobart's offensive player of<br />\nthe year. In the midfield, losses to graduation will leave<br />\nthe Statesmen weakened substantially. First team AllAmericans Jim Holihan (13 goals, 10 assists) and Pat<br />\nO'Hara (14 goals, 4 assists) are both gone from the<br />\ndefending champions' roster.<br />\nDefensively, the Statesmen feature second team AllAmerica Dan Whelan on the close defense and junior<br />\ngoalie Chuck Warren, the MVP of the 1984 championship game against Washington College. The defense,<br />\nhowever, was only able to hold opponents to 122 goals<br />\nover 13 games in 1984.<br />\nClearly Hobart has less to lose in this game, and this<br />\nmakes for a dangerous opponent for Hopkins. The<br />\nBlue Jays have to be prepared to play all out.<br />\nPrediction: Hopkins 12, Hobart 9<br /><br />\nHomewood Field<br />\nSYRACUSE<br />\n2:00 p.m.<br />\nSaturday, March 9<br />\nHistorical Series: Blue Jays lead, 9-2<br />\nMost sports rivalries take time to develop and then<br />\nbuild over many years. This rivalry formed after all<br />\nof one game. The intensity of the 1983 comeback victory by Syracuse in the championship game was only<br />\nequalled by last year's rematch at Delaware, where the<br />\nBlue Jays captured the title. Many lacrosse enthusiasts<br />\nare viewing this contest as the rubber game of this<br />\nmatch-up, although it is likely that the two teams will<br />\nmeet again in the NCAA tournament.<br />\nThe Orangemen's losses to graduation were<br />\nminimal, and their young defense has gained valuable<br />\nexperience. (For more detail, see the Syracuse team<br />\nreport.) For those fans who have been asleep for the<br />\npast two years, Syracuse relies on an explosive offense<br />\nwhich can strike at any time, usually in bunches. In<br />\nthis way, the Orangemen are never really out of a game<br />\nuntil time becomes a factor.<br />\nThe Syracuse defense is not overly strong, and<br />\nHopkins has had little difficulty in scoring against it,<br />\nwith 29 goals in the '83 and '84 finals. However, the<br />\nJays must limit Syracuse's offensive opportunities by<br />\nusing ball control and taking the Orangemen out of<br />\ntheir game. Syracuse. has too much firepower to only<br />\nconcentrate on stopping a Tim Nelson or a Brad Kotz.<br />\nThere are numerous elements involved in this game,<br />\nand any one of them could be the deciding factor. Will<br />\nthere be a key injury, as there has been in the previous<br />\ntwo years? What about playing conditions? Cold<br />\nweather will likely translate into less scoring, which<br />\nwould tend to favor Hopkins.<br />\nThe Blue Jays need solid defense, a lot of which<br />\ndepends upon Larry Quinn's performance. An<br />\noutstanding game by Quinn, which is more than a<br />\ncommon occurrence, could tilt the balance. Also, the<br />\nattitude of Syracuse coming in will depend a great deal<br />\nupon their previous game against North Carolina.<br />\nIn truth, with two such excellent teams, the deciding<br />\nfactor is usually desire. Syracuse wants to avenge last<br /><br />\nattackmen. On top of this, head coach Terry Corcoran<br />\nhad an outstanding recruiting year.<br />\nThe Blue Jays must avoid any complacency. This<br />\ngame is being played within ten days of the Syracuse<br />\nand Hobart contest, and Hopkins may be a little tired.<br />\nA lack of intensity could lead to some unpleasant<br />\nresults. However, Don Zimmerman is too good a head<br />\ncoach to allow this to happen.<br />\nPrediction: Hopkins 10, Washington College 6<br /><br />\nHomewood Field<br />\nPRINCETON<br />\n2:00 p.m.<br />\nSaturday, March 23<br />\nHistorical Series: Blue Jays lead, 39-12<br />\nPrinceton is usually a solid all-around team, and<br />\nthey are always well-prepared by head coach Jerry<br />\nSchmidt. This year, the Tigers are looking to rebound<br />\nfrom a 2-12 season in 1984.<br />\nDefensively, the Tigers return their starting goalie,<br />\nChris Corcoran, but they have lost their entire close<br />\ndefense, with the exception of All-American Jerry Rizzieri. On offense, the outlook is brighter, with four<br />\nmidfielders and the entire attack returning. The offensive threats for the tigers include senior attackmen Jon<br />\nLurie(18 goals, 5 assists) and Charlie Stillwell(5 goals,<br />\n16 assists.)<br />\nPrinceton is a good enough team that the Blue Jays<br />\ncannot afford to look past them toward Virginia and<br />\nthe \"heart\" of the schedule. Still, the Blue Jays'<br />\nsuperior talent should be evident in the final score.<br />\nPrediction: Hopkins 14, Princeton 7<br /><br />\nHomewood Field<br />\nWASHINGTON COLLEGE<br />\n3:00 p.m.<br />\nTuesday, March 19<br />\nHistorical Series: Blue Jays lead, 24-1<br />\nWashington College was the runner-up in the 1984<br />\nDivision III championship game. But, as with Hobart,<br />\ndon't be fooled by the Division III aspect.<br />\nThe Shoremen lost their All-American goalie, Greg<br />\nBaker, but they return their entire close defense and<br />\nfirst two midfield units, as well as three out of four<br /><br />\nLACROSSE '85/7LAX<br /><br />\nChallenge to the Blue Jays' Championship Hopes<br />\nstarts tough and stays that way through the long season<br />\nHomewood Field<br />\nVIRGINIA<br />\n2:00 p.m.<br />\nSaturday, March 30<br />\n40-8-1<br />\nlead,<br />\nJays<br />\nSeries:<br />\nBlue<br />\nHistorical<br />\nLast year's game was a turning point for Hopkins,<br />\nas the Jays put it all together to rout the Cavaliers.<br />\nThis year's game could be more of the same.<br />\nVirginia lost standout goalie J.B. Meyer and half<br />\nof their starting defense, although recruiting was<br />\nstrong in this area. Four out of six attackmen return,<br />\nincluding Roddy Marino and Jeff Nicklas.<br />\nThe key, however, lies in the midfield, where<br />\nVirginia suffered significant losses. Highly regarded<br />\nmidfielder Larry LeDoyen transferred to Hopkins (ineligible in 1985) and workhorse Scott Gerham finished his career with the Wahoos. Both teams can run,<br />\nbut the Hopkins midfield will be able to dominate and<br />\ntherefore control the game. In the past few years,<br />\nHopkins has had Virginia's number, and the trend<br />\nshould continue.<br /><br />\nMac Ford and Gary Seivold. As always, the Tar Heels<br />\nwill have a fine incoming class, and the entire team<br />\nis made up of outstanding athletes.<br />\nAny skill advantage that the Blue Jays have will be<br />\ncountered by the intensity of this game and a significant Carolina home field advantage. This, combined<br />\nwith warm Carolina weather, should lead to an exciting, high scoring game, and possibly the Blue Jays'<br />\ntoughest challenge all season.<br />\nPrediction: Hopkins 12, North Carolina 11<br /><br />\nPrediction: Hopkins 16, Virginia 10<br /><br />\nMARYLAND<br />\nCollege Park<br />\nSaturday, April 20<br />\n2:00 p.m.<br />\nHistorical series: Blue Jays lead, 42-29-1<br />\nMaryland, once a dominant force in lacrosse, has<br />\nbeen on a downslide the last few years. Head Coach<br />\nDick Edell, in his second year, is looking to revitalize<br />\nthe Terrapins, and his efforts should begin to show<br />\nin this year's performance.<br />\nWhile it's always difficult to coach players who were<br />\nrecruited by someone else, Edell has the good fortune<br />\nof returning five of six close defensemen, including<br />\nseniors Kevin Hart and Joe Janssens, eight of nine top<br />\nmidfielders, and the entire attack. And although they<br />\nlose starting goalie Kevin O'Leary, the Terps should<br />\nhave a solid backup in Bobby Virden to take his place.<br />\nThe sum total is that Maryland will be a much improved team over last year, when it failed to make the<br />\nplayoffs for the first time in four years, and that<br />\nshould make for a closer contest than in recent years.<br />\nLook for the Blue Jays to pull away after a close first<br />\nhalf.<br />\nPrediction: Hopkins 15, Maryland 12<br /><br />\nJohn Duvall - In the Crease<br /><br />\nARMY<br />\nHomewood Field<br />\nSaturday, April 13<br />\n1:45 p.m.<br />\nHistorical Series: Blue Jays lead, 40-13<br /><br />\nDOD<br /><br />\nNORTH CAROLINA<br />\nSaturday, April 6<br />\nHistorical Series: 4-4<br /><br />\nmein - in the unldbe<br /><br />\nChapel Hill<br />\n2:00 p.m.<br /><br />\nWest Point has always prided itself on playing a<br />\ntough, physical game, with emphasis on a tenacious<br />\ndefense. The loss of All-America goalie George<br />\nSlabowski and two starting defensemen, therefore, will<br />\ntake its toll.<br />\nOn offense, the Cadets rely more on individual<br />\nquickness than on teamwork, using one-on-one isolations and few passing plays. One of the reasons they<br />\nare able to do so is midfielder P.J. O'Sullivan, voted<br />\nthe Blue Jays' outstanding opponent last year.<br />\nOverall, the contest should be the usual, hard-hitting<br />\ngame that Army plays. If Hopkins can control the ball<br />\nwithout worrying about the contact, they should be<br />\nable to dominate.<br />\nPrediction: Hopkins 9, Army 6<br /><br />\nThis game will be a dogfight. Hopkins and North<br />\nCarolina have met six times in the last three years, each<br />\nteam winning three times. In the playoffs, the Tar<br />\nHeels beat the Blue Jays in the 1982 championship<br />\ngame, while the Jays came back to win two consecutive<br />\nsemi-final matchups in 1983 and 1984.<br />\nThe most exciting contests, though, have come during the regular season. Each of these games has been<br />\ndecided by one goal, including two overtime games.<br />\n(Carolina won 13-12 in OT in 1982 and 14-13 in double OT in 1983; Hopkins won 4-3 last year.)<br />\nIn fact, if this game is anything like the last one in<br />\nChapel Hill, then it's a must game to see. That contest was tied eleven different times until the Tar Heels<br />\nwon with three seconds remaining in the second overtime, and only after a Hopkins goal with just seconds<br />\nleft in regulation was disallowed under a good deal of<br />\ncontroversy.<br />\nThis year's game shapes up a little differently than<br />\nin the past. The Tar Heels have lost their two top<br />\ndefensemen in second team All-American Randy Cox<br />\nand the 1984 Defenseman of the Year, Tom Haus(the<br />\nformer to graduation, the latter to academic difficulties), as well as four of their six top midfielders.<br />\nWhile they return goalie Tim Mealey, their losses will<br />\nnot allow them to play much zone defense, which was<br />\nalways a Carolina strength. Head Coach Willie Scroggs<br />\nwill have to adapt accordingly.<br />\nCarolina still has offensive strength, including midfielders Joey Seivold and Steve Martel, and attackmen<br /><br />\nJay mamcciant - In me urease<br />\nNAVY<br />\nHomewood Field<br />\nSaturday, April 27<br />\n2:00 p.m.<br />\nHistorical Series: Blue Jays lead, 30-25-1<br />\nA large crowd should be on hand for this year's<br />\nHomecoming game against the Midshipmen. Navy,<br />\nlike Maryland, has fallen from the ranks of the true<br />\nplayoff contenders for the last couple of years. This<br />\nyear, they hope to turn things around.<br />\nThe Middies' biggest weakness this year should be<br />\nthe attack, which lost all three of last year's starters,<br />\nincluding Tom Calabrese(26 goals, 10 assists). Coach<br />\nBryan Matthews' offense is not dominated by the attack, but last year's unit scored 48 of the team's 112<br />\ngoals. To try to combat the weakness, All-America<br />\nmidfielder Glen Miles(12 goals, 13 assist) will be moved to attack this year.<br />\nThis midfield should be strong, with the first unit<br />\nbeing led by Jeff Bellistri (11 goals, 7 assists) and captain Chris Adams. The defensive unit is led by third<br />\nteam All-America Joe Papetti and goalie Steve Nims.<br />\nThe Navy team could be described as a more wellrounded Army team. It plays good defense and a<br />\nphysical game, but the Midshipmen also use team<br />\nquickness and generally have some good scoring<br />\npotential.<br />\nNavy will certainly have to be more than prepared<br />\nto face Hopkins on Homecoming Day. It is not likely<br />\nthat Blue Jays will let their fans and alumni down.<br />\nPrediction: Hopkins 14, Navy 8<br />\nContinued on Page 8<br /><br />\nJay Matricciani - In the Crease<br /><br />\n8LAX/MARCH 8, 1985<br /><br />\nOrangemen, Tar Heels Highlight Jay Schedule<br />\nHomewood Field<br />\nRUTGERS<br />\n7:30 p.m.<br />\nWednesday, May 1<br />\nHistorical Series: Blue Jays lead, 19-3<br />\nIf you attended last year's meeting between these<br />\ntwo teams, it's hard not to laugh when you think about<br />\nit. The Blue Jays played one of the best quarters of<br />\nlacrosse ever witnessed at Homewood in building an<br />\namazing 15-0 lead on their way to coasting to a 21-10<br />\nembarrassment of the Scarlet Knights.<br />\nThat's what makes this year's contest so intruiging.<br />\nThe 1984 game was a result of several factors. Rutgers<br />\nhad played Syracuse to a close 15-12 decision only a<br />\nfew days prior to that game, and actually arrived at<br />\nHomewood only an hour and a half before the starting time. They were understandably a little flat.<br />\nHopkins, on the other hand, was well-prepared and<br />\ncame out on fire, which led to the one-sidedness of<br />\nthe scoring.<br />\nWhat happens in 1985 depends more on Rutgers<br />\nthan it does on Hopkins. Despite what you may<br />\nbelieve, Rutgers is for real. The Scarlet Knights suffered some losses, most notably of their top attackman<br />\nBill Naslonski. But they return standout goalie John<br />\nNaslonski and most of their defense and midfield.<br />\nWhat may be most important is that Rutgers returns<br />\nwith an extra year's experience. To witness the results,<br />\none need go no further than looking at the Knights'<br />\n9-3 defeat of Syracuse in the fall. And while it was only<br />\nfall ball, it has certainly boosted Rutger's confidence.<br />\nRutgers fields a young but very talented team.<br />\nAgainst Hopkins last year, they employed three different longstick units, and they returned eight of the<br />\nnine members. Throughout the lineup they have quality players; the Scarlet Knights may soon be ready to<br />\nbreak into the upper echelon of college lacrosse.<br />\nAn important factor in this year's game is that once<br />\nagain, Rutgers will face Syracuse and Hopkins consecutively on the road. The outcome of the Hopkins<br />\ngame, therefore, will depend upon the results of the<br />\nSyracuse contest.<br />\nThe real reason that this game depends so much<br /><br />\nupon Rutgers, though, is last year's game. The<br />\nmemory of that crushing defeat will be ever present.<br />\nThis will lead to one of two results. Rutgers can use<br />\nthat defeat in a positive way, to fire themelves up for<br />\na revenge match, or they could be haunted by it, and<br />\nexpect the same to happen again this year. The former<br />\nwill lead to a good game, the latter to another blowout.<br />\nRutgers has a fine coaching staff, so they will undoubtedly be more prepared this year. Still, as long<br />\nas the Blue Jays are also prepared, they should come<br />\naway with a win.<br />\nJay Matricciani - In the Crease<br /><br />\nContinued from Page 7<br /><br />\nPrediction: Hopkins 16, Rutgers 12<br /><br />\nTOWSON STATE<br />\nSaturday, May 4<br />\nHistorical Series: Blue Jays lead, 9-0<br /><br />\nThis is a crosstown rivalry where the public school<br />\nboys take on the private school boys. When Towson<br />\nplays well, this can be an extremely close game, as it<br />\nwas two years ago.<br />\nHowever, the Tigers will have to have made big<br />\nstrides during the season to be on a par with the Blue<br />\nJays. Of last year's 13 starting players (counting 2 midfields) for Towson, only 4 will return in '85. This<br />\n3 would make for a tough road to travel for any team,<br />\n2 and Towson doesn't have the recruiting power of a<br />\nc Hopkins or a Carolina.<br />\nIf Towson is in playoff contention, this game could<br />\nmean a great deal to them. However, the Blue Jays<br />\n2 will also be looking to gain some momentum going<br />\ncp into the playoffs.<br />\nPrediction: Hopkins 15, Towson State 10<br /><br />\nDegenerates<br />\nDrink<br /><br />\nHARD CIDER<br /><br />\ndo,<br />\n.•41116<br /><br />\n0<br /><br />\n3<br /><br />\nse<br /><br />\nSt<br /><br />\n61<br /><br />\n•<br /><br />\n•<br /><br />\n•<br /><br />\nJoin the<br />\nChessie<br />\nDEgeneration<br /><br />\n•<br /><br />\n•<br /><br />\nTowson<br />\n7:30 p.m.<br /><br />\nSold in liquor stores near campus<br /><br />\nLACROSSE '85/9LAX<br /><br />\nStrengthened Schedules, More Competition in '85<br />\nby David Epstein<br />\nMany teams will by vying for the eight NCAA tournament berths. The schedules this year are well balanced, with most teams having to face several top playoff<br />\ncontenders. The following is an overview of the<br />\nschedules of the top teams, as well as a look at the<br />\none key contest of the season for each not involving<br />\nthe Blue Jays.(Teams are listed in order of predicted<br />\nplayoff seeding.)<br />\n1. Johns Hopkins<br />\nRutgers<br /><br />\nSyracuse<br />\nMarch 5<br /><br />\nNorth Carolina<br /><br />\n(H)<br /><br />\nMarch 9<br /><br />\nUMBC<br /><br />\n(A)<br /><br />\nMarch 9<br /><br />\nJohns Hopkins<br /><br />\n(A)<br /><br />\nStarch 17<br /><br />\nPennsylvania<br /><br />\n(A)<br /><br />\nMarch 13<br /><br />\nDelaware<br /><br />\n(A)<br /><br />\nMarch 20<br /><br />\nNorth Carolina<br /><br />\n(A)<br /><br />\nMarch 17<br /><br />\nArmy<br /><br />\n(A)<br /><br />\nMarch 30<br /><br />\nC. W. Post<br /><br />\n(A)<br /><br />\nMarch 20<br /><br />\nCortland State<br /><br />\n(HI<br /><br />\nApril 3<br /><br />\nBucknell<br /><br />\n(H)<br /><br />\nMarch 23<br /><br />\nPenn State<br /><br />\n(H)<br /><br />\nApril 6<br /><br />\nMassachusetts<br /><br />\n(A)<br /><br />\nMarch 30<br /><br />\nAdelphi<br /><br />\n(A)<br /><br />\nApril 10<br /><br />\nSt. John's<br /><br />\n(A)<br /><br />\nApril 6<br /><br />\nHarvard<br /><br />\n(A)<br /><br />\nApril 13<br /><br />\nPenn State<br /><br />\n(H)<br /><br />\nApril 11<br /><br />\nCornell<br /><br />\n(H)<br /><br />\nApril 17<br /><br />\nDrexel<br /><br />\n(HI<br /><br />\nArmy<br /><br />\n(HI<br /><br />\nApril 20<br /><br />\nHobart<br /><br />\n(H)<br /><br />\nApril 20<br /><br />\nApril 23<br /><br />\nColgate<br /><br />\n(A)<br /><br />\nApril 24<br /><br />\nPrinceton<br /><br />\n(A)<br /><br />\nApril 27<br /><br />\nRutgers<br /><br />\n(H)<br /><br />\nApril 27<br /><br />\nSyracuse<br /><br />\n(A)<br /><br />\nMay 4<br /><br />\nPennsylvania<br /><br />\n(HI<br /><br />\nMay I<br /><br />\nJohns Hopkins<br /><br />\n(A)<br /><br />\nMay 10<br /><br />\nMassachusetts<br /><br />\n(A)<br /><br />\n2. Syracuse<br />\nThe Orangemen play a rough schedule this year, but<br />\na note of explanation. Most of Syracuse's<br />\nrequires<br />\nit<br />\nbig games will be at home; they face \"lesser\" teams<br />\nsuch as Harvard and Colgate on the road. Aside from<br />\nHopkins, the toughest road game for Syracuse will be<br />\nat West Point, where the Cadets can give the Orange<br />\na difficult time with their tenacious defense.<br />\nAn important section of the Syracuse schedule<br />\ncomes when they face Rutgers and Penn back to back<br />\nnear the end of the season. Both teams should give the<br />\nOrange a run for their money, although again, both<br />\ngames will be played at Syracuse.<br />\nThe key game for Syracuse, though, is at the very<br />\nstart of the season.<br />\nSYRACUSE vs. NORTH CAROLINA<br />\nTuesday, March 5 •<br /><br />\nchance in another big game against the Blue Jays just<br />\na few days later. Clearly, this game will carry significant meaning for the playoffs.<br />\nNorth Carolina<br /><br />\nPennsylvania<br /><br />\nMarch 5<br /><br />\nSyracuse<br /><br />\n(A)<br /><br />\nMarch 17<br /><br />\nRutgers<br /><br />\n(H)<br /><br />\nMarch 9<br /><br />\nWashington &amp; Lee<br /><br />\n(HI<br /><br />\nMarch 20<br /><br />\nLoyola<br /><br />\n(H)<br /><br />\nMarch 16<br /><br />\nTowson State<br /><br />\n(H)<br /><br />\nMarch 23<br /><br />\nYale<br /><br />\n(H)<br /><br />\nMarch 23<br /><br />\nNavy<br /><br />\n(A)<br /><br />\nMarch 27<br /><br />\nNavy<br /><br />\n(H)<br /><br />\nMarch 31<br /><br />\nMaryland<br /><br />\n(A)<br /><br />\nMarch 30<br /><br />\nHarvard<br /><br />\n(A)<br /><br />\nApril 6<br /><br />\nJohns Hopkins<br /><br />\n(H)<br /><br />\nApril 6<br /><br />\nCornell<br /><br />\n(A)<br /><br />\nApril 10<br /><br />\nDuke<br /><br />\n(A)<br /><br />\nApril 10<br /><br />\nPrinceton<br /><br />\n(H)<br /><br />\nApril 13<br /><br />\nUMW<br /><br />\n(H)<br /><br />\nApril 13<br /><br />\nDartmouth<br /><br />\n(H)<br /><br />\nApril 17<br /><br />\nRoanoke<br /><br />\n(H)<br /><br />\nApril 17<br /><br />\nUMBC<br /><br />\n(Al<br /><br />\nApril 20<br /><br />\n1.oyola<br /><br />\n(H)<br /><br />\nApril 20<br /><br />\nBrown<br /><br />\n(A)<br /><br />\nApril 27<br /><br />\nVirginia<br /><br />\n(A)<br /><br />\nApril 24<br /><br />\nDelaware<br /><br />\n(H)<br /><br />\nApril 27<br /><br />\nHofsara<br /><br />\n(A)<br /><br />\nMay 4<br /><br />\nSyracuse<br /><br />\n(A)<br /><br />\n4. North Carolina<br />\nThe Tar Heels generally play a difficult schedule,<br />\nand this year is apparently no different. After opening against Syracuse, they eventually move on to a<br />\nstretch against Navy, Maryland, and Hopkins. Of<br />\ncourse, games against teams such as Washington &amp; Lee<br />\nand Duke should be no problem for Carolina. A key<br />\ngame for the Tar Heels, though, comes late in the<br />\nseason.<br /><br />\nN. CAROLINA vs. VIRGINIA<br />\nSaturday,,April 27<br /><br />\nCharlottesville<br />\n7:00 p.m<br /><br />\n7. Maryland<br />\nThe Terrapins face their usually strong schedule, including ACC rivals North Carolina and Virginia. With<br />\na team looking to reemerge in the upper ranks,<br />\nMaryland's key game becomes . . .<br />\nCollege Park<br />\n2:00 p.m.<br /><br />\nMARYLAND vs. HOFSTRA<br />\nSaturday, March 23<br /><br />\nThis is an important game for Maryland, not so<br />\nmuch as a specific contest, but for its implications. The<br />\nTerrapins face several solid but not overly spectacular<br />\nteams, such as Hofstra, Adelphi, and Delaware.<br />\nIn order to gain a playoff berth, Maryland must be<br />\nable to consistently beat these teams. The Hofstra<br />\ngame will provide a good indication of whether they<br />\nwill be able to do so.<br />\nArmy<br /><br />\nLast year, Virginia stunned the Tar Heels in Chapel<br />\nHill to win the ACC title. However, that same<br />\nCarolina squad came back and crushed the Cavaliers<br />\nin the first round of the NCAA playoffs.<br />\nIn 1985, this game should once again have a direct<br />\nbearing on the ACC championship. More importantly, this game will weigh heavily on the minds of the<br />\nNCAA tournament selection committee.<br />\nIf the Tar Heels lose to both Syracuse and Hopkins,<br />\nthey will need this game to achieve a good seeding in<br />\nthe playoffs. Furthermore, both teams will be looking for momentum going into the post-season.<br /><br />\nSyracuse<br />\n7:30 p.m.<br /><br />\n5. Penn<br />\nPenn is a good team, and they gained a playoff spot<br />\nlast<br />\nyear by virtue of the fact that they played the weaker<br />\nopener,<br />\nseason<br />\nyear's<br />\nlast<br />\nThis game is a repeat of<br />\nin which the Orangemen defeated the Tar Heels, 10-9, Ivy League teams. While the Quakers end their<br />\nwith a Tom Nelson goal with one second remaining. schedule at Hofstra and Syracuse, the key game is their<br />\nThis year, Syracuse has the home field advantage, as first one of the season.<br />\nopposed to last year's neutral site.<br />\nThese two teams match up very well. Both are very<br />\nPhiladelphia<br />\nquick, have excellent scoring punch, and can work well PENN vs. RUTGERS<br />\n17<br />\nMarch<br />\nSunday,<br />\n1:00 p.m.<br />\nWhile<br />\nsituations.<br />\nunsettled<br />\nor<br />\noff either settled<br />\nplace<br />\nHeels<br />\nTar<br />\nthe<br />\ntalent,<br />\noffensive<br />\nmore<br />\nSyracuse has<br />\nThese two teams are similar in that both are top<br />\ngreater emphasis on defense.<br />\nIn a fall contest last year, Syracuse rallied from a eight teams, but neither are considered to have a very<br />\n6-1 deficit to defeat Carolina 9-7. In scheduling this good chance of winning it all. This is an important<br />\nseason's game, Carolina Head Coach Willie Scroggs game for Penn, because next to the Syracuse contest,<br />\nmay be hoping to catch Syracuse looking past the Tar it is their toughest game.<br />\nIt is also important to both teams, because as the<br />\nHeels toward Hopkins. Nonetheless, this game should<br />\nbe very exciting, and should have strong playoff first game of the season, each of these teams knows<br />\nthat they must be able to defeat the other to be able<br />\nimplications.<br />\nto win against a Hopkins or a Syracuse. Rutgers will<br />\nhave other chances to prove itself, though, whereas<br />\n3. Rutgers<br />\nPenn<br />\nwill not receive such a challenge until the end<br />\nunusual<br />\nan<br />\nleast,<br />\nthe<br />\nsay<br />\nto<br />\nis,<br />\nThe Rutgers schedule<br />\none of their fourteen scheduled games, only four will of the season.<br />\nbe played at home. Granted, the Scarlet Knights may<br />\nMaryland<br />\nVirginia<br />\nfeel that this is a year in which they must prove<br />\nMarch 8<br />\n(A)<br />\nDuke<br />\n(H)<br />\nMarch 10 Brown<br />\nMarch 16 Washington &amp; Lee<br />\n(H)<br />\n(Al<br />\nthemselves, and a strong schedule is one way of doing<br />\nMarch 16 UMBC<br />\nMarch 19 New Hampshire<br />\n(H)<br />\n(H)<br />\nMarch 20 Roanoke<br />\nso.<br />\nMarch 23 Horstra<br />\n(HI<br />\n(A)<br />\nMarch 23 Washington &amp; Lee<br />\nSeveral of the Scarlet Knights' opponents should<br />\nMarch 31<br />\nNorth Carolina<br />\n(H)<br />\n(A)<br />\nMarch 30 Johns Hopkins<br />\nApril 6<br />\n(H)<br />\nVirginia<br />\n(A)<br />\nMaryland<br />\nApril 6<br />\npresent little difficulty. However, the schedule includes<br />\nNavy<br />\nApril 13<br />\n(A)<br />\n(H)<br />\nVirgina Tech<br />\nApril 8<br />\nand<br />\nHopkins,<br />\nCarolina,<br />\naway games against Penn,<br />\nApril 20<br />\nJohns Hopkins<br />\n(H)<br />\n(H)<br />\nRadford Univ.<br />\nApril 10<br />\nApril 27<br />\nAdelphi<br />\n(A)<br />\nHofstra. Penn and Carolina will be back to back, just<br />\nDuke<br />\n(Al<br />\nApril 13<br />\nMay I<br />\nDelaware<br />\n(H)<br />\n(A)<br />\nNavy<br />\nApril 20<br />\n.three days apart, presenting a critical section of the<br />\nUM BC<br />\nMay 4<br />\n(H)<br />\n(H)<br />\nNorth Carolina<br />\nApril 27<br />\nschedule. Still, it is another away game which is the<br />\n(Al<br />\nMay 9<br />\nTowson State<br />\n(H)<br />\nLoyola<br />\nMay 1<br />\nkey game for Rutgers.<br />\nSyracuse<br />\n,<br />\nRUTGERS vs. SYRACUSE<br />\nSaturday, April 27<br />\nThis is Rutgers' big chance to move into the top of<br />\ncollege lacrosse. They'll have had a previous chance<br />\nagainst Carolina, but this game is bigger in several<br />\nways.<br />\nRutgers matches up well against the Orangemen,<br />\nand this game gives them the chance to show that their<br />\nfall victory over Syracuse was no fluke. In fact, if<br />\nRutgers has done well going into this game, a victory<br />\nhere could vault them into the number two seeding.<br />\nOf course, a lot of that depends upon what several<br />\nother teams do.<br />\nRutgers must also do well in order to have any real<br /><br />\nthe season, and its placement is very important.<br />\nVirginia will be coming off the Hopkins game, and<br />\nwill most likely be in need of a victory.<br />\nOn top of this, Virginia is a team that, because of<br />\nits player losses, needs a confidence boost from a major game. Maryland, a team looking to turn things<br />\naround, would like nothing more than to beat the<br />\nCavaliers at Virginia, which would help them ensure<br />\na playoff berth. Both teams could use the midseason<br />\nwin to enter the second half in a positive way.<br /><br />\n6. Virginia<br />\nThe Virginia schedule this year is one of the weaker<br />\nschedules among the top rated teams. Opponents like<br />\nBrown, Roanoke, and Virginia Tech should provide<br />\nlittle competition for the Cavaliers.<br />\nVirginia is also fortunate to have most of their more<br />\ndifficult games, such as Navy and North Carolina, at<br />\nhome. It is another home game that is the key game<br />\nfor Virginia this year.<br />\nVIRGINIA vs. MARYLAND<br />\nSaturday, April 6<br /><br />\nCharlottesville<br /><br />\nThis ACC contest comes virtually in the middle of<br /><br />\nMarch 9<br /><br />\nCortland State<br /><br />\n(H)<br /><br />\nMarch 17<br /><br />\nSyracuse<br /><br />\n(H)<br /><br />\nMarch 20<br /><br />\nCW Post<br /><br />\n(H)<br /><br />\nMarch 23<br /><br />\nBrown<br /><br />\n(A)<br /><br />\nMarch 27<br /><br />\nSt. John's<br /><br />\n(H)<br /><br />\nMarch 10<br /><br />\nHofstra<br /><br />\n(HI<br /><br />\nApril 6<br /><br />\nNits)<br /><br />\n(Al<br /><br />\nApril 13<br /><br />\nJohns Hopkins<br /><br />\n(Al<br /><br />\nApril 17<br /><br />\nYale<br /><br />\n(H)<br /><br />\nApril 20<br /><br />\nRutgers<br /><br />\n(Al<br /><br />\nApril 23<br /><br />\nBucknell<br /><br />\n(H)<br /><br />\nApril 27<br /><br />\nMassachusetts<br /><br />\n(H)<br /><br />\nMay 4<br /><br />\nNew Hampshire<br /><br />\n(H)<br /><br />\n8. Army<br />\nOver the past few years. Army has maintained a<br />\nreputation for being the playoff team with the weakest<br />\nschedule. This year, their schedule has become slightly more difficult, mainly due to the increased strength<br />\nof other teams. Still, teams like C.W. Post, St. John's,<br />\nand Bucknell can hardly mount a challenge.<br />\nOn the opposite side, Army faces Syracuse early,<br />\nand then a consecutive streak of Hofstra, Navy, and<br />\nHopkins. But for Army, the key game arrives two<br />\nweeks later.<br />\nNew Brunswick<br />\n7:30 p.m.<br /><br />\nARMY vs. RUTGERS<br />\nSaturday, April 20<br /><br />\nThis game has quickly become a minor rivalry. Army is not likely to defeat Syracuse or Hopkins (although<br />\nthey are the last team to have beaten the Orange in<br />\nthe regular season), so a win against Rutgers becomes<br />\nessential.<br />\nArmy has hovered for many years as a very good<br />\nteam, while Rutgers is trying to break into the top of<br />\nthe pack for the first time. This game may turn out<br />\nto be a crossroads for both teams.<br /><br />\nCornell<br /><br />\nNavy<br />\nMarch 9<br /><br />\nLIMB(<br /><br />\n(H)<br /><br />\nMarch 16<br /><br />\nAdelphi<br /><br />\n(H)<br /><br />\nMarch 13<br /><br />\nWashington College<br /><br />\n(H)<br /><br />\nStarch 23<br /><br />\nHarvard<br /><br />\n(H)<br /><br />\nMarch 16<br /><br />\nDuke<br /><br />\n(A)<br /><br />\nStarch 30<br /><br />\nUMBC<br /><br />\n(H)<br /><br />\nMarch 23<br /><br />\nNorth Carolina<br /><br />\n(H)<br /><br />\nApril 3<br /><br />\nMassachusetts<br /><br />\n(Al<br /><br />\nMarch 27<br /><br />\nPennsylvania<br /><br />\n(Al<br /><br />\nApril 6<br /><br />\nPennsylvania<br /><br />\n(H)<br /><br />\nStarch 30<br /><br />\nPrinceton<br /><br />\n(Al<br /><br />\nApril 10<br /><br />\nYale<br /><br />\n(A)<br /><br />\nApril 6<br /><br />\nArmy<br /><br />\n(H)<br /><br />\nApril 13<br /><br />\nSyracuse<br /><br />\n(A)<br /><br />\nApril 13<br /><br />\nMaryland<br /><br />\n(H)<br /><br />\nApril 17<br /><br />\nWashington &amp; Lee<br /><br />\n(HI<br /><br />\nApril 20<br /><br />\nVirginia<br /><br />\n(A)<br /><br />\nApril 20<br /><br />\nDartmouth<br /><br />\n(Al<br /><br />\nApril. 27<br /><br />\nJohns Hopkins<br /><br />\n(A)<br /><br />\nApril 24<br /><br />\nHobart<br /><br />\n(Al<br /><br />\nMay II<br /><br />\nHolstra<br /><br />\n(A)<br /><br />\nApril 27<br /><br />\nPrinceton<br /><br />\n(HI<br /><br />\nStay 4<br /><br />\nBrow n<br /><br />\n(A)<br /><br />\nWashington College<br /><br />\nHobart<br />\nMarch 9<br /><br />\nAir Force<br /><br />\n(A)<br /><br />\n(A)<br /><br />\nMarch 13<br /><br />\nNavy<br /><br />\n(A)<br /><br />\nLoyola<br /><br />\n(A)<br /><br />\nStarch 16<br /><br />\nSt. Mary's<br /><br />\n(H)<br /><br />\nGeneseo State<br /><br />\n(A)<br /><br />\nMarch 19<br /><br />\nJohns Hopkins<br /><br />\n(A)<br /><br />\nRIT<br /><br />\n(A)<br /><br />\nMarch 24<br /><br />\nHobart<br /><br />\n(HI<br /><br />\nApril 6<br /><br />\nIthaca College<br /><br />\n(H)<br /><br />\nMarch 27<br /><br />\nGettysburg<br /><br />\n(H)<br /><br />\nApril (3<br /><br />\nCortland State<br /><br />\n(H)<br /><br />\nMarch 30<br /><br />\nDenison<br /><br />\n(H)<br /><br />\nApril 20<br /><br />\nSyracuse<br /><br />\n(A)<br /><br />\nApril 6<br /><br />\nLoyola<br /><br />\n(H)<br /><br />\nApril 24<br /><br />\nCornell<br /><br />\n(H)<br /><br />\nApril 10<br /><br />\nFranklin &amp;<br /><br />\nApril 27<br /><br />\nPenn State<br /><br />\n(H)<br /><br />\nMay 2<br /><br />\nSt. Lawrence<br /><br />\n(H)<br /><br />\nApril 13<br /><br />\nRoanoke<br /><br />\n(A)<br /><br />\nMay 4<br /><br />\nMassachusetts<br /><br />\n(H)<br /><br />\nApril 17<br /><br />\nWestern Maryland<br /><br />\n(H)<br /><br />\nApril 20<br /><br />\nWashington &amp; Lee<br /><br />\n(H)<br /><br />\nipril 27<br /><br />\nSalisbury<br /><br />\n(A)<br /><br />\nMarch 16<br /><br />\nJohns Hopkins<br /><br />\nMarch 24<br /><br />\nWashington College<br /><br />\nMarch 31<br />\nApril 2<br />\nApril 4<br /><br />\nMarshall<br /><br />\n(H)<br /><br />\nIOLAX/MARCH 8, 1985<br />\n****************************************************1<br /><br />\nabo.<br /><br />\n4-<br /><br />\n...-..<br />\nirk;<br />\n1.06.1111,<br />\n• 4:,*-,,,<br />\n,<br /><br />\n1%.;,:41.11*Z431411,,Itiollt-10<br />\nIlk _46.101,40111„.<br />\n,<br />\n''<br />\nvm,<br />\n*,,,,X*4710..74101114.0<br /><br />\natilr<br /><br />\n4<br />\n:ft<br /><br />\n.,„);,,,,„,<br />\n,. k .<br />\n'Pla<br />\nfillit.0,<br /><br />\n..,,,,,,<br /><br />\n,„,........,•,,••,...* '<br />\n*<br />\n0.0, •,,74.,<br /><br />\nlialliiiiii0444 tS14,,,IN'‘ZrAst:<br /><br />\nito,<br /><br />\nJohns Hopkins<br /><br />\nJay Matricciani - In the Crease<br /><br />\nHomeWoc<br />\nSaturdaY,<br />\n2:00 1<br /><br />\nThe Johns Hopkins Blue Jays<br /><br />\nProbable Starting Lineup<br />\nNo. Player<br />\n9 Craig Bubier<br /><br />\nPosition<br />\nA<br /><br />\n15 Brian Wood<br /><br />\nA<br /><br />\n33 Bill Single<br /><br />\nA<br /><br />\n4 Del Dressel<br />\n13 Bruce Chanenchuk<br />\n32 John Krumenacker<br />\n7 Guy Matricciani<br />\n26 Dan Pallace<br />\n41 John DeTommaso<br />\n21<br /><br />\nLarry Quinn<br /><br />\nJay Matricciani - In the Crease<br /><br />\n****************************************************<br /><br />\nLACROSSE '85/ 1 1 LAX<br /><br />\n****************************************************<br /><br />\nClifton York - Lacrosse Magazine<br /><br />\nLarry Volz<br /><br />\nins vs. Syracuse<br /><br />\nwood Field<br />\naY, March 9<br />\n)0 P.M.<br /><br />\n5<br /><br />\nThe Syracuse Orangemen<br /><br />\nProbable Starting Lineup<br />\nNo. Player<br />\n1 Tim Nelson<br /><br />\nPosition<br />\nA<br /><br />\n5 Tom Nelson<br /><br />\nA<br /><br />\n42 Tom Korrie<br /><br />\nA<br /><br />\n12 Frank Lanuto<br />\n16 Todd Curry<br />\n30 Brad Kotz<br />\n27 Jeff Desko<br />\n28 Kevin Sheehan<br />\n31<br /><br />\nMike O'Donnell<br /><br />\n10 Tom Nims<br />\nJay Matricciani - In the Crease *<br /><br />\n********************<br /><br />\n********************************<br /><br />\n12LAX/MARCH 8, 1985<br /><br />\nA small but skillful class<br /><br />\nFive Freshman Give '85 Jays A Dose of Talent<br />\nby Adam Warner<br />\nThe 1985 season marks the first year that players<br />\nrecruited by Don Zimmerman as head coach will put<br />\non the Blue Jay uniform. Only five freshmen join the<br />\nsquad from the class of '88, but all five were high<br />\nschool consensus • All-Americans in their senior<br />\nseasons. Though it is unlikely that any will make as<br />\nbig an impact this year as Brian Wood did as a frosh<br />\nin '84, before they graduate they should prove to be<br />\nas good as any other class of recent memory. If<br />\nnothing else, three of the five have names and family<br />\nties quite familiar to Blue Jay loyalists: Ciccarone,<br />\nMorrill, and Dressel.<br />\nThe first is John Ciccarone, son of Henry Ciccarone, Sr., who preceded Zimmerman as Hopkins'<br />\nhead coach, and brother of former Blue Jay stars Brent<br />\nand Henry, Jr. Like Brent, John plays attack, and in<br />\n•high school he was truly exceptional. He was a four<br />\nyear varsity player at Boys Latin in Baltimore, and in<br />\nthe words of his former coach Bobby Shriver,\"he just<br />\ngot better and better every year. Last year, he had what<br />\nI'd call a truly outstanding season.\"<br />\nThe team had a fine year as well, as they made it<br />\nto the area finals, where they lost 8-6 to a Loyola team<br />\nthat they had beaten six days earlier. According to<br />\nShriver, \"If we had won that game, Ciccarone would<br />\nhave been named Metro Player of the Year.\"<br />\nShriver is also quick to praise Ciccarone's intensity<br />\ntoward the game. \"He'll work as hard as anyone you'll<br />\nsee. He's been lifting weights in order to bulk up for<br />\nhis college career. He has all the tools to be an excellent<br />\nplayer.\"<br />\nIt seems as if the only problem that Ciccarone may<br />\nhave is his size. At 5'10\" and 160 lbs., he is by no<br />\nmeans tiny, but in major college ball he will be facing<br />\nbig defensemen every game, and that may get tough.<br />\nAlso joining the attack is Mike Morrill, a third<br />\ngeneration Blue Jay. His grandfather, Kelso, played<br />\nfor Hopkins in the 1920's, while his father, Bill, was<br />\na star in the early 1960's.<br /><br />\nIf any frosh is to play a big role in Hopkins' national championship defense, it will likely be Morrill.<br />\nHe has the size at 6'0\", 185 lbs., excellent skills and<br />\nof course, the genes. In the scrimmage against Penn,<br />\nhe led Hopkins with three goals.<br />\nMorrill played his high school ball at St. Paul's in<br />\nBrooklandville for George Mitchell, himself a former<br />\nBlue Jay as well as the father of defenseman Steve<br />\nMitchell.<br />\nThe new Dressel is John Dressel, brother of the better known Del. John will also play midfield, although<br />\nthe two will not team on the same line.<br />\nA Baltimore native, John starred for Lawrenceville<br />\nPrep in New .,:rsey. Though he only played there for<br />\none season, his coach Marshall Chambers ranks him<br />\namong the best players he's had; one who helped his<br />\nprogram immensely. Particularly impressive were his<br />\nstick skills, which Chambers called \"the very best I've<br />\nseen it this level of play.\"<br />\nAt Lawrenceville, Dressel played on attack, \"mainly<br />\nbecause we had.some fast midfielders,\" says<br />\nChambers. \"Besides,\" he adds, \"it was better having<br />\nhim on the field more often.\"<br />\nIn analyzing •Dressel's future as a Blue Jay,<br />\nChambers sees no problems down the road. \"Here,<br />\nwe lacked a whole team to surround him, but at<br />\nHopkins he'll be playing with nine other excellent<br />\nplayers.\"<br />\nHopkins' other midfield recruit is Joe Rzempoluch.<br />\nHe hails from Farmingdale High School on Long<br />\nIsland, a virtual factory that has also produced current Hopkins stars John Krumenacker, John DeTommaso and Bruce Chanenchuk.<br />\nRight now, Rzempoluch may be the best prepared<br />\nof his class to move into a key position. At 6'0\", 190<br />\nlbs., he has the size, and coming from Farmingdale<br />\nhe was brought up in a style of play similar to that<br />\nof Hopkins. Harntranft, his high school coach,<br />\nbelieves that Joe will \"fit in very well to Coach Zimmerman's system. Here, like at Hopkins, midfielders<br />\nbring the ball up very quickly on offense, while they<br /><br />\nHOW<br />\nCAN YOU<br />\nLOSE WITH GUYS<br />\nLIKE THIS ON<br />\nYOUR TEAM?<br /><br />\nare all required to play excellent defense.\" Rzempoluch<br />\nparticularly excelled at the defensive phase of the<br />\nposition.<br />\nAside from being named All-America, Rzempoluch<br />\nwon the Jim Brown Award as the area's best midfielder. Yes, it's THE Jim Brown. As for Farmingdale,<br />\nthey finished their year at 17-2, the number one seed<br />\nin their region before being upset in the playoffs.<br />\nLast, but not least, Hopkins brought in Jeff Kramer,<br />\na goalie. Kramer attended Worthington High School<br />\nin Ohio, as he is the only player on the squad this year<br />\nnot to come from an Atlantic state.<br />\nThough highly talented, Kramer will not see much<br />\naction at all this year in the nets. All three goalies from<br />\n1984 return, including NCAA tournament MVP Larry<br />\nQuinn, who is unquestionably the best goalie in the<br />\ncountry. The 5'10\", 160 lb. freshman will get his big<br />\nchance next year, when he will battle sophomore Stuart<br />\nJones and any other newcomers for the starting slot.<br /><br />\nThe Sieve Story<br />\nIf you've been wondering what those strange people with kitchen utensils have been doing at lacrosse<br />\ngames, you need not wonder any more. They're sieves.<br />\nNo, not the people, the utensils. The tradition actually began at Cornell hockey games. The chant of<br />\n\"sieve\" is directed at the opposition's goalie, hoping<br />\nthat he will let pucks(or in our case lacrosse balls) pass<br />\nthrough, as a sieve allows objects to pass through.<br />\nWhen done effectively, it has been known to rattle<br />\nmany a goaltender.<br />\nThe tradition was brought to Hopkins by two<br />\nstudents, Mark Lazarus and David Epstein, for the<br />\n1983 playoff game between Hopkins and Cornell.<br />\nSieves can be purchased at any food store for a small<br />\nprice. Colanders and other sorts of strainers are acceptable, but they're not the genuine article. So, get<br />\nyourself a sieve, head out to the game, and abuse the<br />\nother team's goalie.<br /><br />\nTHE JOHNS HOPKINS UNIVERSITY ALUMNI ASSOCIATION<br />\ncordially invites you and your family on a<br />\n\"BUS TRIP TO MANHASSET\"<br />\nfor the<br />\n\"DAY OF CHAMPIONS LACROSSE CLASSIC\"<br />\nJOHNS HOPKINS vs. HOBART<br />\nand a post-game cocktail &amp; buffet reception<br />\nwith the team at the<br />\nSTRATHMORE-VANDERBILT COUNTRY CLUB<br />\nManhasset, Long Island<br />\non<br />\nSATURDAY, MARCH 16, 1985<br />\n7:00 a.m. till 11:00 p.m.<br />\nCost: $45.00 per person<br /><br />\nBRINGING YOU A BETTER<br />\nGAME IN THE BEST WAY<br />\nFor Your Subscription:<br />\n107 East 25th Street<br />\nBaltimore, MD 21218<br />\nor call.(301)235-2104<br /><br />\nPrice includes round-trip luxury bus transportation, post-game team<br />\nreception, game ticket and on-board refreshments(pack a picnic lunch).<br />\nFirst Come - First Served!<br />\nFor additional information, please call Doug Warren at the Alumni<br />\nOffice: (301) 338-7963.<br /><br />\nLACROSSE '85/13LAX<br /><br />\nAn Interview with Coach Roy Simmons, Jr.<br />\nThe coach of the Orange discusses his teams, Hopkins, and the future.<br />\nEditor's Note: Roy Simmons, Jr., the head coach of the<br />\nSyracuse lacrosse team, spoke with Howard Bregman and<br />\nDavid Epstein of the News-Letter on February 21st. We thank<br />\nCoach Simmonsfor his time and his help with our coverage<br />\nof the Orangemen.<br /><br />\nN-L: Could you sum up the team's attitude going into the game with Hopkins? Is the outlook different<br />\nafter having been in the finals for two years?<br />\nSimmons: Well, we don't play Hopkins normally in<br />\nthe regular season. We've played in the playoffs, and<br />\nstubbed their toe. It's important to get a shot at<br />\nHopkins and not have to wait until May, if that's a<br />\npossibility at all. ..Of course, we start off up here with<br />\nNorth Carolina on the fifth of March, so I think that<br />\nthat puts the Blue Jays second; we're thinking more<br />\nabout the Tar Heels right now, we know that that game<br />\nwill be very important.<br />\nN-L: So you'll be travelling right after the Carolina<br />\ngame by bus?<br />\nSimmons: Yes, we're going to come down the night<br />\nof the seventh, so we'll be there for two nights. We'll<br />\nhave a workout on the eighth; but we'll arrive in<br />\nBaltimore on the night of the seventh. That's two days<br />\nafter our Carolina game.<br />\nN-L: Everybody knows that Kotz and Nelson are now<br />\nseniors. Tom Nims is back in the goal, and you have<br />\na lot of good young players, several of whom really<br />\nshone in the 1984 championship game. Do you think<br />\nthat this is the strongest team you've fielded in the past<br />\nfour years?<br />\nSimmons: Well, I think it's as strong as last year, and<br />\nas strong as the year before. In '83, we had a lot of<br />\nsophomores. Now much of the team this year are<br />\nseniors. We're returning our entire defense; the unit<br />\nwas really young last year.. . Our midfield lost David<br />\nDesko to graduation, who had three goals in the title<br />\ngame. It's a big loss, but it will be filled in...Our close<br />\nattack is intact. We'll feel the absence of Randy Lundblad, who had a great career here, and a great season<br />\nlast year. Tommy Nelson, who filled in for his brother<br />\nin the finals, will be back. We also have Tom Korrie.<br />\nSo we look very good on paper.<br /><br />\n... when our big gun got<br />\nhurt... we had to adjust, so we've<br />\nlearned the hard way that you can't depend on any one person.\"<br /><br />\nN-L: Let's talk about the attack. The unit is probably<br />\nthe strongest in the nation. Will it dominate your game<br />\nplan this year?<br />\nSimmons: By no means. We realize from experience<br />\nin 1983 that a lot of opponents we play will put in<br />\nwacky defenses—a lot of zone, a lot of shutting off<br />\nof personalities. They gear a lot of their practices to<br />\ndisrupting our attack, so we have to be ready for that<br />\nand not rely on our attack exclusively. We realize that<br />\nthey can be tied up pretty tight. We don't have any<br />\npreconceived plan to play an attack-oriented offense.<br />\nYou know, the bad thing last year when our big gun<br />\ngot hurt, that phase of our game was wiped out, and<br />\nwe had to adjust, so we've learned the hard way that<br />\nyou can't depend on any one person. God forbid<br />\nanother bad injury, but he may be healthy but shut<br />\noff by a good defenseman. We can't predict these<br />\nthings, so we certainly don't look for our offense to<br />\ndominated by one unit.<br />\nN-L: As an aside, how is Tim Nelson's condition?<br />\nSimmons: Well, he's 100 percent. I say he's 100<br />\npercent—he'll be wearing a large Lenox Hill brace on<br />\none knee, but that's not unusual in this day and age<br />\nto see a lot of players wearing them. We have a couple of other players wearing them for support. Timmy was in a cast all summer after the Delaware game<br />\nuntil late August. He did not play fall ball as a result<br />\nof the injury. Then, around December, he started to<br />\nwork out, wearing the brace. He's worked harder than<br /><br />\nNelson, who got three goals, and also Dave Desko.<br />\nWe came back to within one, and we could've maybe<br />\ntied the ball game up, and gotten a fresh start. .. but<br />\nI think with Timmy on the sidelines, and we were told<br />\nat that time that he would be out for the entire game,<br />\nand we had a six goal deficit to make up...You know,<br />\nwe had a seven goal deficit the year before, so we knew<br />\nit was certainly possible, but we knew that the Hopkins<br />\nkids could really taste it badly, that they wouldn't let<br />\nit get away again, and they didn't. We took some<br />\nchances at the end of the ball game—we had a chance<br />\nof tying it but it backfired on us; the thirteenth goal<br />\nwas scored on an open cage, and those things had to<br />\nhappen. For us, we were behind, and to get back in<br />\nthe ball game we had to take chances, and they didn't<br />\nwork, they backfired.<br />\nSo it was a three goal difference, but, I think, to<br />\nbe down by six, and to come back within one in the<br />\nchampionship game, I think that you—for those young<br />\nkids—I have a lot of faith in them. We probably peaked a little bit too early, and, it's funny. . . Hopkins had<br />\na struggle with UMBC and we had a cakewalk.<br />\nHopkins absolutely devastated Rutgers in their last<br />\ngame, and I forget how many goals they got in the first<br />\nhalf—it was no contest. We had to struggle against<br />\nRutgers twice, so it's hard to say, the chemistry<br />\nSyracuse head coach Roy Simmons, Jr.<br />\nchanges during the season. You're as good as the day<br />\nyou play, and you have to hope that you'll play your<br />\nhe's ever worked. You'd never know that a ming was best game that day. The problem was that that was<br />\nwrong with him right now.<br />\nHopkins' best game of the year, that's when they<br />\nwanted it, that's when it definitely counts. We had our<br />\nN-L: We don't want to dwell on last year's champion- best game of the year in '83, the last game. We're just<br />\nship, but just one question:<br />\ngoing to have to hope that on the ninth our chemistry's<br />\nWere the playoffs a bad streak for you? Obvious- correct and we're ready to play.<br />\nly, you had problems with Rutgers, who took you into overtime, and Army didn't seem to be a convincing victory after all those you had in the beginning of<br />\n\"We hope to maintain good lacrosse<br />\nthe season. Then there was the championship game. here. Whether we can maintain chamSimmons: Well, I think our best game last year was<br />\nagainst UMBC in the regular season. We played our<br />\nkind of lacrosse. . . We really peaked in the UMBC<br />\ngame. We beat them 22-6 and didn't rub it in. I know<br />\nthat the score sounds like we did, but we didn't. I think<br />\nthat we probably peaked there. Then we accomplished an undefeated season. We went into the playoffs,<br />\nand we lost sight of the fact that Rutgers was aching<br />\nfrom their loss to us earlier in the year. They were<br />\nfighting to get into the playoffs and they made it. After<br />\nbeating them earlier in the year, we didn't expect the<br />\ncontest it turned out to be... We were a little complacent, and I felt that we got that bad game out of the<br />\nway.<br />\nThe Army game was a very physical game—we beat<br />\nthem by two goals. They were behind, and they were<br />\nthreatening, and we held them off, and I felt the boys<br />\nhad had the scare—we were still undefeated, and we<br />\nhad a chance to prove ourselves again at<br />\nDelaware—we came out flat. I mean we had a great<br />\nteam, but the day you play.. .1 don't know. The<br />\nchemistry wasn't quite right. We lost the opening<br />\nfaceoff, we got burned early with the first goal—that<br />\nmade a lot of difference in the game. Freshmen like<br />\nWood had a lot of confidence, and it took a little steam<br />\nout of my freshmen watching them. You know,\"Now<br />\nit's the big time, we were playing for the national<br />\nchampionship, and he's a freshman, too.\" He put one<br />\nimmeimmmm•mm••mmi<br />\n\"You know, we had a seven goal<br />\ndeficit the year before... but we knew<br />\nthat the Hopkins kids could really taste<br />\nit badly, that they wouldn't let it get<br />\naway again, and they didn't.\"<br />\nin, and my boy was the goat—it took the wind out of<br />\nus, and the first thing you know, we had ourselves dug<br />\nin pretty deep.<br />\nThen, when we lost our number one attackman, the<br />\nTurnbull award winner for two years in a row, the bottom really could have fallen out, and it didn't. We<br />\ncame back within a goal, and we did it with the boys<br />\nwho were not expected to do it. Tommy Nelson, a<br />\nfreshman, got three goals, and one of our reserve attackman did the same.<br />\nI give Brian Wood a lot of credit for getting three<br />\ngoals, they were well-deserved. He got it when they<br />\nneeded it, right off the bat. That set the tempo for the<br />\nday, but you know, we had a little freshman, Tommy<br /><br />\npionship lacrosse year to year remains<br />\nto be seen.\"<br />\nN-L: About the future: Next year Kotz and Nelson are<br />\ngone. How different will it be? Are you starting a<br />\nchampionship tradition that you are going to be able<br />\nto maintain?<br />\nSimmons: Well, lacrosse at Syracuse is looked at differently than at Hopkins. It is the sport there, and<br />\nrightly so, there's a long tradition. It's just that you<br />\ndon't put a lot of effort into football and basketball.<br />\nAnd you know that our basketball team is in the<br />\nlimelight now—they have a lot of TV contracts—<br />\nfootball has a good number of TV contracts, and,<br />\nthat's the fall sport here.<br />\nSo to keep this level up, it will depend a lot on<br />\nrecruiting, obviously, on how the athletic department<br />\nperceives non-revenue sports—and I mean nonrevenue compared to football—though we do have,<br />\nin my estimation, one of the largest lacrosse turnouts,<br />\nsomewhere around five or six thousand per game,<br />\naverage. But it's still not on the priority list. We hope<br />\nto maintain good lacrosse here. Whether we can maintain championship lacrosse year to year remains to be<br />\nseen.<br />\nAs a coach, you finally have to say goodbye and<br />\ncongratulations to those seniors; you think that you'll<br />\nnever replace them, you'll never have another Tim<br />\nNelson, you'll never have another Brad Kotz. I know<br />\nthat's not so. ..You know, when Joe Cowan left<br />\nHopkins it was a sad day. But then others came<br />\nalong—Thomas, O'Neill, and now Wood, there's<br />\nalways somebody to fill in. I'm a full-time coach of<br />\nlacrosse here, I have two assistants, and we don't even<br />\nhave an office. You know, we just don't get out to<br />\nlook. We travel to the Baltimore. area, and to Annapolis, although we rarely play in these areas. I have<br />\na boy from Dulaney High School in Baltimore, a high<br />\nschool All-American last year, and we're very, very<br />\nhappy with him. We have a back-up goalie, Jim<br />\nGygory from Annapolis, and we're very happy with<br />\nhim. So I think we're going to have to go take a look<br />\ndown there at schools like St. Paul's, Boys Latin,<br />\nGilman, all of the great lacrosse schools down there,<br />\nand maybe take a look at those boys to \"share the<br />\nwealth.\" There's a lot of great schoolboy lacrosse<br />\ndown there.<br />\nContinued on Page 14<br /><br />\n14LAX/MARCH 8, 1985<br /><br />\nPenn Comes on Strong After 2 Years in Playoffs<br />\nBlue Jays' first intercollegiate scrimmage of the year.<br />\nSeaman's squad put on an impressive offensive show,<br />\nPennsylvania<br />\nthe<br />\nchampions,<br />\nLeague<br />\nLast year's Ivy<br />\nlosing the game in the final quarter by an 11-10 score.<br />\ncoming<br />\n\"We came here to play well, and I am very pleased<br />\nand<br />\nup<br />\nthe<br />\nbeen<br />\nyears<br />\nfor<br />\ntwo<br />\nhave<br />\nQuakers<br />\nteam in college lacrosse. An average program was turn- with how the team performed,\" said Seaman after the<br />\ned around in 1983 by first-year coach Tony Seaman, game...\"I don't even know what the score was, but<br />\nas the Red &amp; Blue went 10-3, were co-champions of I'm glad we played well—it shows we can play with<br />\nthe Ivy League, and received a bid to the NCAA an<br />\nThe 1985 season will test the staying power of Penn's<br />\ntournament.<br />\nthe<br />\nin<br />\ncoming<br />\nlosses<br />\nthe<br />\n12-2,<br />\nto the top. Last year's team had a solid returning<br />\nrise<br />\nwas<br />\nLast year, Penn<br />\nopening game with Rutgers and in the first round of corps of defenders who held their opponents to an<br />\nthe tournament against Army. Seaman was named the average of only a 4.7 goals per game. From this unit<br />\nDivision I Coach of the Year by the Intercollegiate only two players return for 1985, most notably AllLacrosse Association in both 1983 and 1984.<br />\nAmerica goalkeeper and team co-captain Jim<br />\nDellaRocca. Senior Tim Bianco returns on defense and<br />\nHold Jays to 10 Goals<br />\nwill be joined by two inexperienced juniors, Pat<br />\nPrendergast and Johns Hopkins transfer Brian<br />\nThe Quakers faced Hopkins on February 22 in.the Fraidin.<br />\nby Craig Caplan<br /><br />\nDefensively, Penn plays a match-up zone. \"I stole<br />\nit from the Villanova basketball program,\" said<br />\nSeaman. This defense is susceptible to quick passes for<br />\nopen shots from the outside, but Seaman has confidence in DellaRocca and prefers to keep the opponent's offense from being able to work the crease. This<br />\ndefense was very effective against Hopkins; as it was,<br />\nthe Blue Jays ability to convert unsettled opportunities<br />\nmade the difference.<br />\nMidfield lacks depth<br /><br />\nAt the midfield, Penn has one of the fastest there<br />\nis. Gone from the 1984 squad is first team All-America<br />\nand Ivy League player of the year Josh Hall(15 goals,<br />\n14 assists in 1984), now an assistant coach. A solid<br />\ngroup remains, however, led by senior Leo Paytas(20<br />\ngoals, 10 assists) returns. Depth is a problem, as Penn<br />\ndoes not have enough players to run three strong<br />\nmidfields.<br />\nOffensively, Seaman uses a ball-movement offense,<br />\nsimilar to that used by the Jays, and he counts on<br />\nbalanced scoring from midfield and attack. The attack<br />\nfreeing up of dates. We look forward to it. I think it's is led by senior Bill Morrill (21 goals, 19 assists in<br />\nonly natural to play there. If you want to go back to 1984), a two-time All-America. The rest of the attack<br />\nlast year, to the top eight, we're playing six of the seven is young, with a junior and two sophomores set to see<br />\nthat are possible to play, and Virginia's the only one regular action.<br />\nThe Red &amp; Blue opens the season on March 17<br />\nthat we're not playing, and that's just a matter of cost.<br />\nWe're going back to Chapel Hill next year. We played against Rutgers, the seventh ranked team in the nathem on a neutral site last year in Baltimore, and they're tion in 1984. On March 20th they play Loyola, a top<br />\nchoice for the \"Cinderella\" team of 1985. The regoing to fly to Syracuse this year.<br />\nSo, next year we're going to bus down to Chapel mainder of Penn's schedule is weak relative to other<br />\nHill on our spring break to play Carolina and Hopkins top schools due to Ivy League commitments, but the<br />\non our spring trip, which is a lot to ask from a team. game to wait for is Saturday, May 4, at Syracuse, one<br />\nI think it's important for top teams to play one week before the NCAA tournament.<br />\nLast year, Penn was one dominant player away from<br />\nanother, so that there's no doubt in anyone's mind.<br />\nI think this year we have the toughest schedule in the giving Hopkins and Syracuse a third contender for the<br />\nnation. We play six of the top seven and other tough title. The '85 squad is a strong favorite to win the Ivy<br />\nteams. Hobart—a very tough traditional opponent— League title, but it is still a hair's breadth away from<br />\nand Cornell on the road, Cortland State on the road, the very top. The success Coach Seaman has with his<br />\nCarolina, Hopkins, Army, Delaware. I think we have youngest team to date will tell it' the Quakers are at<br />\na great schedule. We have a good team, and we're go- the top to date.<br />\ning to keep on playing the big boys and see how we do.<br /><br />\nSimmons: Competition is Key<br />\nContinued from Page 13<br /><br />\nN-L: Will this game be a yearly thing now? I know<br />\nthat you're scheduled for the next three years to play<br />\nHopkins.<br />\nSimmons: Right. We'll be playing there again early<br />\nnext year, and then we go back home and Hopkins<br />\nin '87 will come and play us up here. We've been trying to set something up for a couple of years. Right<br />\nnow we have a three-year contract.<br />\nWe have more mobility then they do, as far as the<br /><br />\n\"I think it's important for the top<br />\nteams to play one another, so that<br />\nthere's no doubt in anyone's mind.\"<br /><br />\nIF YOU'RE NOT<br />\nIN THE CREASE,<br />\nYOU'RE OUT<br />\nOF BOUNDS<br />\n•<br /><br />\n10<br />\nEXCITING<br />\nISSUES!<br />\nGiving you all<br />\nthe news while it's<br />\nstill news.<br />\nIn depth reporting and<br />\nphotos of the big games.<br />\nPlus the only national<br />\nlacrosse comic strip.<br /><br />\nIMMO MO<br /><br />\n11=•<br /><br />\nIMMO 11=1 MIMI NMI MI<br /><br />\nIlan ONO<br /><br />\nSubscribe now! Choose your terms below. Enclose a check or<br />\nmoney order for the amount. Mail to: In The Crease. P 0. Box<br />\n281, Riderwood. MD 21139<br />\n__<br />\nCheck enclosed for S._ _ _ _<br />\nOne Year $ 1 1.00(10 issues) $19.50 iirst Class<br />\nCanadian Rate: 6 issues. 511.00 in U.S. Funds<br />\nName:<br />\nAddress:<br />\nLip:<br /><br />\n1<br /><br />\n1111=1111MINNO MN =III MID =NI MINI<br />\nlkr.PIIIIIIMIMNIUM--IMMO---MIMI<br /><br />\n0<br /><br />\n0<br /><br />\n27<br />\n141<br />\nIII 0<br />\n111,91k<br />\nIIPNI AIM<br />\nMI NM INN atm<br />\nEll\\ •<br /><br />\nDU ill<br />\nMEI 111111ft.<br />\nAv<br />\n\\NM<br />\nIEENIEl.\" Barmy<br />\nas \\MII<br />\nIM 1=1 NM I\" a.<br />\nN NEMI EL<br />\nENE MIR<br />\ngm<br />\nNE/11111//11<br /><br />\nMIEN\\<br /><br />\nTHE LACROSSE NEWS MAGAZINE<br /><br />\nLACROSSE '85/15LAX<br /><br />\nOrangeman Lacrosse:<br /><br />\nSteve Parker: Syracuse SI<br /><br />\nby David Epstein<br />\nIn order to build a top college lacrosse program, a<br />\nschool must have a strong high school recruiting base.<br />\nLogic would therefore dictate that the wider the<br />\nrecruiting area, the more talent that would be available<br />\nand therefore the more successful the program. Under<br />\nthis assumption, the Syracuse lacrosse team has<br />\nmanaged to defy logic.<br />\nFor the past half decade, two teams have dominated<br />\nNew York state high school lacrosse. Downstate,<br />\nYorktown High School (Westchester County) has<br />\nreached the state final in five consecutive years, capturing the title in 1984. In doing so, each year<br />\nYorktown has had to defeat the top team on Long<br />\nIsland.<br />\nUpstate, West Genesee High has been so dominant,<br />\nthat it borders on the unbelievable. The Wildcats have<br />\nbeen to the state finals the last four years, winning<br />\nthree times. Along the way, they tied a state record<br />\nby winning an astounding 91 consecutive games, a<br />\nstreak which was broken in last year's state finals by<br />\nYorktown.<br />\nNot surprisingly, these two schools have consistently<br />\nturned out top players and more than their share of<br />\nAll-Americans. What is surprising is that Syracuse has<br />\nbeen able to build a championship program basically<br />\naround players from these two high schools. Syracuse<br />\nHead Coach Roy Simmons, Jr. is quick to deny this<br />\nidea, and he points out that his team has players from<br />\nMaryland and Massachusetts. However, the<br />\nundeniable evidence is that eight of the Orangemen's<br />\nten starters, and over one third of the team, are from<br />\neither West Genesee or Yorktown. Of course, this<br />\nmeans that there are also many Syracuse players from<br />\nother areas; many top players from both West Genny<br />\nand Yorktown have opted to attend other colleges.<br />\nStill, Simmons has used the emergence of lacrosse in<br />\nWestchester and Central New York to his advantage<br />\nas no other coach has been able to do.<br />\nFor Syracuse, this has translated into two consecutive championship caliber teams. The 1983 team<br />\nwas victorious in the finals, the 1984 team was the<br />\nrunner-up, and both times they faced Hopkins. Unfortunately for the rest of lacrosse, the 1985 Syracuse<br />\nsquad may be their strongest ever.<br />\nThe Syracuse style of play is to use a highly potent<br />\noffense and an unspectacular defense to outscore their<br />\nOpponents. They often have trouble in tight defensive<br />\ngames, but almost always win a shutout. The<br />\nOrangemen's ability to score is almost uncanny, and<br />\nWhen they score a goal, there are usually two or three<br />\nmore to follow. It is this type of streak scoring that<br />\nhas characterized the Syracuse team, and, not surpris-<br /><br />\nSyracuse at a Glance<br /><br />\ningly, it is a trademark<br />\nof the West Genesee<br />\nHigh team also.<br />\nThe main force behind<br />\nSyracuse's scoring ability<br />\nis their attackmen, who<br />\nlast year accounted for<br />\n149 (or 55%) of the<br />\nteam's 262 goals. This<br />\nyear's unit is already being considered the most potent attack in the country. It<br />\nconsists, not surprisingly, of one<br />\nplayer from West Genesee and two from<br />\nYorktown.<br />\nThe leading attackman for Syracuse is senior<br />\nTim Nelson (Yorktown). All Nelson has done in<br />\nhis two years at Syracuse (his freshman year was<br />\nspent at N.C. State) is amass 186 points, being<br />\nnamed to the first team All-America squad and winning the Turnbull Trophy as outstanding Division I attackman both years. Nelson plays behind the goal and<br />\nliterally runs the offense, using his accurate passing<br />\nability to pile up assists at an incredible pace. He was<br />\ninjured in the championship game last year, and is<br />\nreported to be one hundred percent after surgery and<br />\nrehabilitation. Although he will be wearing a brace<br />\nduring the season, it is not likely that it will affect his<br />\nplay.<br />\nWith a Tim Nelson behind the goal, one might think<br />\nthat all the other attackman need do is be the recipient<br />\nof Tim's passes, simply pumping in the goals. And in<br />\none case, this is not far from the truth. Junior Tom<br />\nKorrie, out of West Genesee, piled up 51 goals last<br />\nseason on his way to earning third team All-America<br />\nhonors. A fine player in his own right, Korrie thrived<br />\non Nelson's passing ability in his becoming Syracuse's<br />\nleading scorer last year. In light of this, what perhaps<br />\ncould be considered less than all-around play on Korrie's part makes him no less dangerous.<br />\nThe third attackman, sophomore Tom Nelson, may<br />\nbest be known as Tim's younger brother, although he<br />\ncame into prominence last year in the championship<br />\ngame by scoring 3 goals after replacing brother Tim.<br />\nThis year, Tom will be filling the spot vacated by the<br />\ngraduation of Randy Lundblad. What people may<br />\nsoon observe, though, is that Tom Nelson may be the<br />\nbest all-around attackman on the team. He may not<br />\npile up the statistics that others will(though he did have<br />\n21 goals and 16 assists in limited duty last season), but<br />\nhe can play the crease, scoop up ground balls, hit, feed<br />\nand score. In sum, he is a dedicated, total player. Tom<br />\nbecomes all the more dangerous teamed with Tim, who<br />\nhe has practiced and played with for most of his life.<br />\nIf that were not enough depth at attack, junior Emmett Printup is available in case of injury or just to<br />\ngive someone a rest. Printup had a hat-trick in last<br />\nyear's finals and received recognition for his play in<br />\nthe World Lacrosse Competition held at Los Angeles.<br />\nClearly, in order to stop Syracuse, one must stop their<br />\nattack—all of their attack.<br /><br />\nTurning to the midfield, Syracuse may actually be<br />\nslightly weaker than in the past two years. Key losses<br />\nfor the Orange include second team All-America Dave<br />\nDesko and face-off man Mark Burnam. Still, the first<br />\nmidfield unit should be among the best in lacrosse.<br />\nLeading the top line is two-time first team AllAmerica and 1983 Player of the Year Brad Kotz(West<br />\nGenesee). Kotz faces off for that line with mixed<br />\nresults, but more importantly, he can ignite the team<br />\nat any moment, as evidenced by his 31 goals and 30<br />\nassists last season. Kotz is clearly the line's leader as<br />\nwell as being its best player.<br />\nThe second member of the first line, Todd Curry,<br />\nis also from West Genesee. Curry, a sophomore,<br />\nbecame a member of the first midfield as a freshman.<br />\nWhile he is not as prolific a scorer as a Kotz, his outside shot is among the best around. Last season he had<br />\n11 goals, but you can rest assured that most of them<br />\nwere bullets.<br />\nThe second midfield will be led by sophomore Pat<br />\nDonahue, that line's face-off man. He will most likely be joined by John Schimoler, a senior who had a<br />\nsolid season in 1984. The third spot will be filled by<br />\na player yet to be determined, depending upon early<br />\nplay against Carolina and Hopkins. Coach Simmons<br />\nwill use these games to establish a definite line for the<br />\nrest of the year.<br /><br />\nSyracuse Orangemen<br />\n1984 Scoring Leaders<br />\nPlayer<br />\nTim Nelson<br />\nTom Korrie<br />\nBrad Kotz<br />\nRandy Lunblad<br />\nTom Nelson<br />\nDave Desko<br />\nTodd Curry<br />\nMark Burnam<br />\nEric Jeschke<br />\nJohn Schimoler<br />\nEmmett Printup<br /><br />\nGoals Assists Points<br />\n36<br />\n51<br />\n31<br />\n32<br />\n21<br />\n29<br />\n11<br />\n11<br />\n8<br />\n7<br />\n9<br /><br />\n67<br />\n13<br />\n30<br />\n24<br />\n16<br />\n7<br />\n9<br />\n7<br />\n3<br />\n3<br />\n1<br /><br />\n103<br />\n64<br />\n61<br />\n56<br />\n37<br />\n26<br />\n20<br />\n18<br />\n11<br />\n10<br />\n10<br /><br />\nIn any case, there will likely be a great disparity between the first and second midfield lines. While the first<br />\nmidfield accounted for 47 goals and 39 assists last<br />\nseason, the second midfield (depending upon its third<br />\nmember) will have tallied last year, no more than 19<br />\ngoals with just 6 assists. Because of this, the second<br />\nline becomes more of a supplement to the high<br />\npowered attack than a dangerous unit of its own.<br />\nSyracuse returns their close defense intact, and the<br />\nadded year of experience should be a big plus. Junior<br />\nKevin Sheehan was a third team All-America last<br />\nseason, and this year he will lead the defense as a team<br />\nco-captain. Joining Sheehan will be another junior and<br />\nhonorable mention All-America, Jeff Desko (West<br />\nGenesee),as well as sophomore Mike O'Donnell<br />\n(Yorktown). The three play well as a unit, but still cannot compare with other top defenses. It remains to be<br />\nseen how well they will have progressed from last year.<br />\nExperience on defense can mean a lot, and the difference could be significant. The rope defense of Dan<br />\nPratt, Fred Opie and Chris Burt should see some action, although Simmons does not plan to overly rely<br />\non the unit.<br />\nThe Syracuse goalie will once again be Tom Nims.<br />\nNims, a senior from West Genesee, was named<br />\nhonorable mention All-America in 1984. He is not a<br />\nspectacular goalie, but plays solidly throughout the<br />\nseason. Like most goalies, though, if he becomes hot,<br />\nhe can be tough to penetrate. Syracuse is also fortunate<br />\nto have a top backup goalie in Tom Gygory, a junior<br />\nout of Annapolis. Simmons will probably not hesitate<br />\nto use him should the situation call for it.<br />\nIn sum, the Syracuse team is much like those of the<br />\nrecent past. They will rely heavily on the attack and<br />\nfirst midfield for some high scoring, while hoping that<br />\nthe second midfield and defense can hold their own.<br />\nBut the key to this year's team could be experience.<br />\nThe defense has played together for a full year, and<br />\nthe only real newcomer to the first string is Frank<br />\nLanuto, and he is a senior. Also, players such as Tim<br />\nNelson, Brad Kotz and Tom Nims are seniors, and will<br />\nbe hungry for a championship in their final year. This<br />\ndesire may be Syracuse's most potent weapon of all.<br /><br />\n16LAX/MARCH 8, 1985<br /><br />\nThe Championship Teams of '50 and '84: A<br />\nSeparated by 34 years, the two squads represent<br />\nWhen making such a comparison, a complete<br />\nperspective is required. One must examine all four<br />\nyears of each team's existence: 1981-1984 and<br />\n1947-1950.<br />\nA comparison of teams or, for that matter, players<br />\nof different eras is a delicate undertaking. In the case<br />\nof these two magnificent squads, fortunately, most of<br />\nthe participants are still with us. The author is one of<br />\nthose people who feel that lacrosse is a sport that<br />\nmakes an enthusiast's liver curl with enjoyment. I am<br />\nof the opinion that the nuances and intricacies of the<br />\ngame demand more knowledge than most other sports;<br />\nI am privileged to have witnessed the majority .of<br />\ngames each team played. Therefore, I shall state facts,<br />\ncite quotations, and let the reader form his own<br />\nopinion.<br />\nBill Tanton, sports editor of the Evening Sun, stated<br />\nin a recent article, \"Actually, the 1950 team, as<br />\neveryone calls it, was four teams, from 1947-1950.<br />\nMany argue they were the best four teams in the<br />\nuniversity's history, and if they were, the 1948 squad<br />\nprobably would have to rank immediately behind the<br />\n1950 team on the all-time list. That was the final year<br />\nfor Brooke Tunstall and Ray Greene, two of the best<br />\never to play for the Jays.\"<br />\nDue to conditions created by wartime, both Tunstall<br />\nand Greene earned first team All-America lacrosse .<br />\nhonors at two different universities, the former at Cornell and Hopkins, the latter at Drexel and Hopkins.<br />\nMany knowledgeable lacrosse personalities familiar<br />\nwith Hopkins teams over 60 years were interviewed by<br />\nTanton concerning their choice of JHU's greatest<br />\nteams. These were analyzed and finally released a few<br />\nyears ago by the one-time News-Letter sports editor<br />\nand Hopkins varsity player. He continues to rate the<br />\nsquad of 1950 as his top team in Johns Hopkins<br />\nhistory.<br /><br />\n\"The 1984 team is much stronger<br />\nand quicker. They work with weights<br />\nand can probably bench-press 75 or 100<br />\npounds more than we could.\"<br />\n-Wilson Fewster<br />\nThe success of the two teams is self-evident. The<br />\n1950 team members felt good about themselves and<br />\nin turn produced brilliant results. They played and won<br />\n31 consecutive intercollegiate games over four years,<br />\nlosing only 4 games to club teams. The 1984 squad won<br />\n14 intercollegiate games, or almost half that amount,<br />\nin one year. No play-off system existed in 1950, nor<br />\nwere mid-week games played.<br />\nThe game itself has changed much in the 34 years<br />\nthat separate these teams. A momentous disparity exists in the physical equipment used. Besides basic<br />\nathletic shoes, padding, and jerseys, each 1950 player<br />\ncarried a wooden stick with a gut wall and a leather<br />\nand gut strung net. These sticks were usually made by<br />\nIndians in Canada. Since then, a quantum leap forward in the technology of lacrosse sticks has been<br />\nmade. All male players today use a hollow aluminumhandled stick with a synthetic plastic double-walled<br />\nhead strung with nylon cord netting. These modern<br />\nfactory-manufactured sticks are perfectly balanced.<br />\nThe old wooden ones seldom were. Experts claim the<br />\nball tends to settle in the modern-type nets more readily<br />\nthan in the old gut and leather type.<br />\nThe late, legendary Frenchy Julien, closely<br />\nassociated with lacrosse for 60 years, commented, \"I<br />\ncannot understand how a player can miss catching a<br />\nball with today's equipment.\"<br />\nIn 1950 all games were played on natural grass. Today, most games are played on astroturf. A bouncing<br />\nball becomes predictable. Many old-timers recall<br />\nscooping a net full of mud to retrieve a ball.<br />\nAn obvious dissimilarity relates to substitutions. The<br />\n1950 squad ran midfields as units into games, replacing one unit for another to catch its breath. Coaching<br />\nphilosophy in 1984 has changed in sophistication.<br />\nThere are more specialists today. For example, a<br />\ncenter, once he gains possession after a face-off, will<br />\nEditor's Note: Donald T. Fritz was a manager on the<br />\nfour-time national champion 1950 team. He is a<br />\nlifelong lacrosse enthusiast and is currently an associate<br />\neditor of Lacrosse Magazine.<br /><br />\nCourtesy of Don Fritz<br /><br />\nby Donald T. Fritz '50<br /><br />\nThe 1950 national champion Johns Hopkins Lacrosse Team. Front: Billy Morrill. First row, from left: Byron Forbush,<br />\nSollers, Mort Kalus,<br />\nBob Sandell, Fred Smith, Wilson Fewster, Corky Shepard, Jim \"Ace\" Adams, Tom Gough, Joe<br />\nErnest Hansen<br />\nKaestner,<br />\nJohn<br />\nKeller,<br />\nGeorge<br />\nWenzell,<br />\nGeorge<br />\nLloyd Bunting. Second row, from left: Coach Kelso Morrill,<br />\nMitchell,<br />\nGeorge<br />\nleft:<br />\nfrom<br />\nrow,<br />\nThird<br />\nBenson.<br />\nJimmy<br />\ntrainer<br />\nMacauley,<br />\nRoss<br />\nKidd,<br />\nJack<br />\nBishop,<br />\nHamilton \"Ham\"<br />\nBaker.<br />\nRobinson<br />\nVach,<br />\nNeil Pohlhaus, Bill Carroll, Bobby Scott, Don Tate, Mike Dix, Dick<br /><br />\nfrequently be individually replaced. Also, as a defensive strategy, long-handled midfield sticks are used.<br />\nGlancing at programs of the two periods, major differences in personnel are obvious. All of the participants but one on the 1950 team were from the<br />\nBaltimore metropolitan area. In 1984, the majority of<br />\nplayers hailed from outside Baltimore. The secondary<br />\nschool graduates of the three major hot-beds of<br />\nlacrosse, Baltimore, upper New York state, and Long<br />\nIsland, presently have a larger selection of lacrosseplaying colleges to attend.<br />\nThe vast majority of the lacrosse team in 1950, with<br />\nlittle or no inducement, voluntarily attended Johns<br />\nHopkins. In 1984, recruiting high school lacrosse talent<br />\nis the norm for most colleges and universities that are<br />\nserious about the sport. In 1950, exactly half of the<br />\nplayers were service veterans and they received monthly subsistence checks. Most native Baltimoreans lived<br />\nat home.<br />\nKarl Levy, captain of the 1926 team, who continues<br />\nto attend Hopkins games, once stated, \"The 1950 team<br />\nwas the best I have seen. Those fellows in 1950 had<br />\na certain maturity because their college had been<br />\ndelayed by the war. They were men, not boys. The<br />\n1984 team was a surprisingly great team. They were<br />\nclever and showed much finesse. The game today is<br />\nmuch smoother and more graceful.\"<br />\n\"Karl Levy might well make a case for his own 1926<br />\nteam which was 9-0 and gave up only 11 goals,\" wrote<br />\nBill Tanton. \"But the 1950 squad was so deep in talent<br />\nstockpiled after World War II that we shall never again<br />\nsee anything like it.\"<br />\nIn 1984, the G.I. Bill, as we knew it is no more.<br /><br />\n\"I believe the 1950squad contained<br />\nbetter all-around athletes because most<br />\nof us played other sports. We had a<br />\nsuperior close defense.\"<br />\n-Tom Gough<br />\nTuition, room, and board are now major factors when<br />\na talented lacrosse player considers college. Hopkins,<br />\nin order to compete with universities granting hill<br />\nscholarships, found it necessary some years ago to adjust its athletic philosophy. The university's commitment to pure amateurism in intercollegiate sports continues largely unchanged. Full athletic scholarships are<br />\nnot awarded to Hopkins students. All athletes must<br />\nmeet the University's admission requirements. Limited<br />\nfinancial aid is available; if there is a need, Johns<br />\nHopkins will listen.<br />\nFurthermore, an athlete at Hopkins is presently<br />\npenalized due to NCAA regulations pertaining to<br /><br />\nfinancial aid. An athlete receiving scholarship aid in<br />\nlacrosse, a Division I sport at Hopkins, cannot participate in a Division III sport such as football. Only<br />\ntwo members of the 1984 lacrosse team, due to the arrangement of their aid, were able to play another sport.<br />\nAlmost half of the 1950 team participated in two or<br /><br />\n\"I cannot understand how a player<br />\ncan miss catching a ball with today's<br />\nequipment.\"<br />\n-Frenchy Julien<br />\nThere are lacrosse players today with the necessary<br />\nacademic credentials attending Hopkins because that<br />\nis where they wish to go. The same situation existed<br />\nin 1950. Because there are considerably more secondary schools playing lacrosse today in many areas of<br />\nthe country than there were in 1950, there exists a<br />\ngreater quantity of good quality lacrosse talent.<br />\nThe convenience of modern athletics also separates<br />\nthese two teams. When Hopkins played Princeton in<br />\n1950, for example, the team bus would leave early<br />\nSaturday morning to travel to Princeton. After their<br />\narrival, players would get dressed, warm up, play the<br />\ngame, and then return to Baltimore the same day. In<br />\n1984, the team left on a Friday, arriving in time to<br />\npractice. The squad ate lunch, dinner, and a Saturday morning meal together. This schedule helps to settle a team down and makes for a better organized and<br />\ncooperative effort.<br />\nThe 1950 team played four years without an intercollegiate loss, winning four straight national championships. In its senior year, it conveyed an impression of invulnerability. The 1984 team, prior to their<br />\nundefeated national championship season, suffered an<br />\noccasional loss, including heartbreaking defeats in<br />\nthree preceding championship finals.<br />\nA clear cut comparison indicates the 1950 team produced two first team All-Americans, one second team,<br />\nand two third team selections. Over its four years, including honorable mentions, the 1950 team generated<br />\na total of 41 All-Americans. The entire 1950 first team<br />\nearned All-America recognition some time during its<br />\nfour years. Interestingly, over their four years, eleven<br />\n1950 players were named to the All-Time J HU Team,<br />\nnine in the year 1950 alone, which is more than any<br />\nteam in the university's history, before or since.<br />\nThe 1984 squad produced four first team AllAmericans, two second team and one third team selection. Over its four years, including honorable mention,<br />\nthe team generated a total of 28 All-Americans. During the four year span from 1981 to 1984, two players<br />\nwere named to the All-Time JHU Team.<br />\nThe supreme honor lacrosse can bestow is election<br /><br />\ngi<br /><br />\nLACROSSE '85/17LAX<br /><br />\nComparison of Two of the Best in JHU History<br />\ngreatness in their respective eras.<br />\nto the Lacrosse Hall of Fame. The 1950 team, over<br />\nits four years, proudly boasts of seven members receiving this distinction, including its entire senior year starting midfield. Three other men associated with the<br />\nteam, Kelso Morrill, Howdy Myers, and Bob Scott<br />\nhave also been elected to the Lacrosse Hall of Fame<br />\nin recognition of their skills in playing, coaching, or<br />\nin a combination of the two. Some excellent players<br />\nfrom the 1984 era squad are ultimately destined to be<br />\nselected in future decades.<br />\nAssuming the majority of today's Hopkins students<br />\nare familiar with the 1984 team, some revealing<br />\nhighlights about the 1950 squad include:<br />\n*Its coach in 1950, Dr. Kelso Morrill, professor of<br />\nmathematics, played and starred on Hopkins teams of<br />\nthe mid 1920's, and served as head coach from 1935<br />\nto 1946.<br />\n*Jim 'Ace' Adams, four year standout at midfield,<br />\nthree-time All-America and member of the Hall of<br />\nFame, is presently the head lacrosse coach at the<br />\nUniversity of Virginia. Jim, during his four years on<br />\nSt. Paul's School varsity and the following four years<br />\nat Hopkins, never played on a team that lost an interscholastic or intercollegiate lacrosse game. He also<br />\ncoached at West Point and the University of Pennsylvania, winning a national championship for Army.<br />\n*Bob Sandell, outstanding four year midfielder and<br />\nthree-time All-America, is the most recent member of<br />\nthe team elected to the Lacrosse Hall of Fame.<br />\n*Joe Sollers, the team's phenomenal goalie, threetime All-America, is one of the top executives of STX,<br />\npioneer developers and manufacturers of the present<br />\nday lacrosse stick.<br /><br />\n*Fred Smith, Hall of Fame member and fourtime All-America, is presently an assistant coach. Fred<br />\ncoached the JHU varsity in 1951 and 1954.<br />\n*Bill Morrill, mascot, waterboy, and son of the<br />\ncoach, won first team All-America honors at JHU in<br />\n1957, 1958, and 1959. He was elected to the Hall of<br />\nFame and named to the All-Time JHU team.<br />\n*Jack Kidd, second-string defenseman, is the highest<br />\nscoring defensemen in JHU history.<br />\n*Bob Scott, midfielder and author of Lacrosse,<br />\nTechnique and Tradition (JHU Press), coached<br />\nHopkins from 1955 to 1974, winning seven national<br />\nchampionships. He was elected to the Lacrosse Hall<br />\nof Fame, and now serves as the JHU athletic director.<br />\n*Robinson Baker, second-string attackmen, is<br /><br />\n\"The 1984 team would have blown<br />\nus off the field. They are faster, bigger, stronger, and overall, more<br />\ntalented.\"<br />\n-Neil Pohlhaus<br /><br />\nIt was obvious because he both understood and<br />\ncherished the game. To the memory of this stalwart<br />\nand beloved supporter, the team, at each of its annual<br />\nreunions, continues to drink a toast to his memory<br />\nfrom a pewter mug that he gave them. He had won<br />\nit as an athlete 50 years earlier. \"Uncle John\" called<br />\nthe team of 1950 an \"elegant group of men.\"<br />\nWhat else can anyone add to that?<br />\nSlipping momentarily into the realm of some particularly fascinating trivia: Don Zimmerman, who was<br />\nin his first year as head coach of the 1984 team, played<br />\nhis high school lacrosse under coaches George Mitchell<br />\nand Neil Pohlhaus at St. Paul's School. Both George<br />\nand Neil were four year members of the 1950 team.<br />\nMitchell and Pohlhaus played their high school<br />\nlacrosse at St. Paul's under Howdy Myers. Myers, in<br />\n1947, spent his first three years as a college head<br />\nlacrosse coach at Johns Hopkins. Many of his<br />\nfreshmen varsity players that year starred on the 1950<br />\nteam. Coach Mitchell's son Steve played on the 1984<br />\nJHU team.<br />\nAn indisputable similarity between the teams concerns strong student support. In the 1947-50 era, JHU<br />\nstudents in their zeal, shortly before the big game, borrowed the 650 pound bronze turtle from the University of Maryland campus. The next evening hundreds<br />\nof University of Maryland students \"visited\" the JHU<br />\ncampus seeking their terrapin. A major fracas broke<br />\nout between the twastudent bodies; the pandemonium<br />\nwas eventually quelled by the Baltimore city police riot<br />\nsquad.<br /><br />\nSeFry Shifflett - In the Crease<br /><br />\npresently a distinguished surgeon at the Johns Hopkins<br />\nHospital.<br />\n*Ernest Hansen, second-string attackman from<br />\nManhasset, Long Island, was the only player not from<br />\nthe Baltimore area.<br />\n*Corky Shepard, diminutive attackman, a fantastically tenacious competitor, is on the all-time JHU<br />\nteam and was a three-time All-America. He repeatedThanks go to Fred Smith and Bill Tanton for all<br />\nly dodged defensemen twice his size to score.<br />\n*Neil Pohlhaus, midfielder, received special atten- their help.<br />\ntion in two of the most exciting games of the 1950<br />\nseason, scoring two goals in the 8-7 victory over<br />\nPrinceton and then having an exchange of words, then<br />\nfists, in the Navy game, which led to mayhem on the<br />\nfield. Hopkins students, led by the charge of their<br />\nband's fiery director, Conrad Geblein, and Neil's<br />\nmother, waving her umbrella, spilled out of the stands<br />\nto do battle with the Midshipmen. Only when the Navy<br />\nBand played the Star Spangled Banner was the crowd<br />\nfinally, brought under control.<br />\nNeil, usually a paragon of virtue, said, \"The 1984<br />\nteam would have blown us off the field. They are<br />\nfaster, bigger, stronger, and overall, more talented.<br />\nThe only way we would have a chance is if they used<br />\nwooden sticks or we used the modern equipment.\"<br />\n*Another distinctive characteristic of the 1950 team<br />\nwas its collective affection and admiration for a<br />\ngentleman respectfully called \"Uncle John\" Richardson. This man was considered the team's good luck<br />\ncharm. It could have been the other way around, for<br />\n\"Uncle John\" also loved the 1950 team. Well-bred,<br />\nThe 1950 team celebrates after its final win.<br />\nretired, and in his golden years, this remarkable man<br />\nthe fortunes of the 1950 team both during<br />\n-time<br />\nfollowed<br />\nthree<br />\nattackman,<br />\nbrilliant<br />\n*Byron Forbush,<br />\nAll-America, is headmaster of Friends School in and after its playing days.<br />\n\"Uncle John\" had been a lacrosse fan since 1890.<br />\nBaltimore. Friends, under Byron's father, Bliss Forbush, generated some of Johns Hopkins' best lacrosse<br />\ntalent.<br />\n*Three defensemen, Tom Gough, Mort Kalus, and<br />\nLloyd Bunting, plus fourth defenseman Ham Bishop,<br />\nplayed as a unit for four years. They each made the<br />\nAll-Time JHU team. Four-time All-America Bunting<br />\nNCAA tournament play came in 1974, three years<br />\nBregman<br />\nwon first team All-American honors three times. by Howard<br />\nafter the organization assumed administration of the<br />\nGough, Kalus, and Bishop each made All-America.<br />\na<br />\nchampionship<br />\nchampionship.<br />\nnational<br />\nof<br />\nThe pressures defending<br />\n\"The 1984 team would probably win in a<br />\nof<br />\nScott admits that while repeating as champion is a<br />\non<br />\ntoo<br />\nthe<br />\nheavily<br />\nshoulders<br />\nweigh<br />\nnot<br />\nhypothetical game because of today's lacrosse sticks,\" should<br />\nfeat, it is certainly possible. \"The pattern in<br />\ndifficult<br />\nand<br />\nthe<br />\nBlue<br />\nJays,<br />\naccording<br />\nZimmerman<br />\nDon<br />\nCoach<br />\nsaid Gough. \"I believe the 1950 squad contained betto maybe win it a couple of years in a row.<br />\nis<br />\nlacrosse<br />\nwho<br />\nBob<br />\nAthletic<br />\nScott,<br />\nScott.<br />\nDirector<br />\nHopkins<br />\nto<br />\nter all-around athletes because most of us played other<br />\nCornell did it in 1976-77, and North Carolina in<br />\nSports. We had a superior close defense. Of the recent coached the varsity squad from 1954 to 1974, should<br />\nduring his twenty year tenure, the lacrosse team 1981-82. To win three in a row, as we did in 1978-80,<br />\nHopkins teams, Mark Greenberg is one of the finest know;<br />\nis very unlikely.\" Scott's own teams won or shared<br />\ncaptured seven national titles.<br />\ndefenseman I have ever seen.\"<br />\nthe title for the four years between 1967 and 1970.<br />\n(Zim\"It should not be especially difficult for him<br />\nMort Kalus, in a burst of candor, admitted, \"I am<br />\nAs for the fact that Zimmerman has yet to lose a<br />\nto<br />\nare<br />\nalways<br />\ngunning<br />\n\"Teams<br />\nScott.<br />\nso biased toward the 1950 team, I could not realistical- merman),\" said<br />\nScott feels that that is an unimportant factor.<br />\ngame,<br />\nreally<br />\ndoesn't<br />\nchampionship<br />\nnational<br />\nA<br />\nHopkins.<br />\nbeat<br />\nly evaluate the two squads.\"<br />\nproblem for Zim to forget what happened last<br />\nno<br />\n\"It's<br />\naspect.\"<br />\nthat<br />\nthe<br />\nchange<br />\nof<br />\nWilson Fewster, midfielder, a member<br />\nZimmerman, who won the title with an undefeated year,\" he said. \"That's the way he'll approach it, and<br />\nLacrosse Hall of Fame, the All-Time JHU team, and<br />\nhow he will prepare his players. He knows that<br />\nSOn of New York Yankee infielder Chick Fewster, season last year, his maiden coaching season, will face<br />\ngunning for Hopkins.<br />\neveryone's<br />\nin<br />\nof<br />\nopponents<br />\nchallenging schedule<br />\nPlayed varsity baseball his junior year, but made the a consistently<br />\nThe<br />\ntoo, should have no difficulty dealing<br />\nplayers,<br />\nplayoff<br />\ncontenders.<br />\nbe<br />\nwill<br />\nwhich<br />\nAll-America team the other three years. He coached 1985, many of<br />\nwith<br />\n\"They have all experienced loswinning.<br />\nconstant<br />\nnational<br />\nown<br />\nhis<br />\nfor<br />\nlonger<br />\nbit<br />\na<br />\nwait<br />\nto<br />\nScott had<br />\nthe JHU squad in 1952 and 1953.<br />\nthen<br />\nin high school. A loss is not<br />\nnot<br />\ning,<br />\nlast<br />\nif<br />\nyear<br />\nhe<br />\n1954,<br />\nin<br />\nhelm<br />\nthe<br />\nat<br />\nStarting<br />\nteam.<br />\nchampionship<br />\n\"You could argue all day and night comparing these<br />\nto<br />\na<br />\nmature.\"<br />\nteam<br />\nfor<br />\nneeded<br />\nHopkins<br />\nas<br />\n1957,<br />\nin<br />\nchampionship<br />\nthe<br />\nto<br />\nJays<br />\nthe<br />\nled<br />\ntwo teams,\" said 'Aillse'. \"The 1984 team is stronger<br />\n\"The real test is to go undefeated in the last three<br />\nand quicker. They work with weights and can probably was voted the number one team over an also<br />\nat the end of the season,\" said Scott.\"We may<br />\ngames<br />\nsquad.<br />\nbench-press 75 or 100 pounds more than we could. undefeated Syracuse<br />\nknocked off at any time during the season,<br />\nget<br />\nwell<br />\nvote<br />\na<br />\nby<br />\nselected<br />\nIn those days, the champion was<br />\nThey play in summer leagues and participate in fall<br />\ntournament games that count.\"<br />\nthe<br />\nit's<br />\nbut<br />\nPractice. We played other sports. Things are very dif- of an executive committee of the United States Interin<br />\ntitle<br />\nonly<br />\nScott's<br />\nAssociation.<br />\ncollegiate Lacrosse<br />\nferent today.\"<br /><br />\nScott:Zim Can Take the Pressure<br /><br />\n18LAX/MARCH 8, 1985<br /><br />\nMidfield, Goal Are Strengths of Talented Jays<br />\nContinued from Page 3<br /><br />\nSingle's ability to put the ball on goal and to get open<br />\nfor high-percentage shots. In spite of his limited experience, Zimmerman is very high on Single's talents<br />\nand expects him to be a major part of the attack unit.<br />\n\"Bill does the things a creaseman needs to do,\" said<br />\nZimmerman.\"He also hangs in there on the screens.\"<br />\nThielemann improved greatly last year and peaked<br />\nwith a three-goal Performance against Rutgers. This<br />\npre-season he has played well, scoring mostly from the<br />\ncrease area, although Zimmerman has indicated he<br />\nwould not use Thielemann as the creaseman. It is<br /><br />\npossible Thielemann will start some games this season,<br />\nthough he should see abundant playing time regardless<br />\nof his role. \"A versatile, steady player,\" is Zimmerman's description,\"who is capable of spelling any of<br />\nthe three starters.\" If his progess continues, this<br />\nCentennial product should emerge as a big contributor.<br />\nMorrill, an All-American at St. Paul's High School<br />\nlast year, has already shown he has the talent to<br />\nchallenge both Single and Thielemann for the third<br />\nstarting position. Zimmerman sees Morrill as a strong,<br />\nheady player who can do well either in the crease or<br />\nbehind the goal. Chances are that Morrill will not start<br />\nversus Syracuse, but Zimmerman probably will not<br /><br />\nhesitate to use him should the offense sputter.<br />\nCiccarone is another Baltimore product and the<br />\nthird brother to play for Hopkins, following Henry<br />\nand Brent. An All-American at Boy's Latin prep<br />\nschool, Ciccarone should see limited action this<br />\nyear as Zimmerman has indicated he'll be used<br />\nprimarily as a left-handed back-up.<br />\n,Nordberg transferred from Maryland two years ago,<br />\nbut has yet to play on the squad. He has played fairly<br />\nwell throughout pre-season, though it is doubtful he<br />\nwill see much action this year unless there is a rash of<br />\ninjuries or Hopkins is routing an opponent.<br />\n_<br /><br />\nLeading Hopkins' second midfield unit will be<br />\nMutscheller. A quick cutter to the crease, Mutscheller<br />\nhas become a good, smart inside player, according to<br />\nZimmerman, and should have his best games versus<br />\nopponents playing a zone defense. As the seventh<br />\nleading scorer for the Jays last year, Mutscheller will<br />\nbe expected to carry a large part of the scoring load<br />\nand to fill the void left by Tucker, his former linemate.<br />\nWhile his performance will depend to some extent on<br />\nwhoever is feeding from behind the net, Mutscheller<br />\nshould be one of the midfield's top five contributors.<br />\nSchreiber will team with Mutscheller and give the<br />\nsecond line diversity with his ability to drive to the goal<br />\nfrom the outside. Big and strong, Schreiber has shown<br />\nthat he can muscle over defenders, which should open<br />\nthings up inside fol- his linemates. The junior scored<br />\n11 goals last year, including three in the semifinal<br />\nplayoff game versus Carolina, but had only one assist\"<br />\nall season. He will need to pass more if this line is to<br />\nbe successful against Hopkins' stronger opponents.<br />\nChanenchuk will be breaking into the top two midfields after playing infrequently on the third line and<br />\nfor many clears last season. Said Zimmerman,<br />\n\"Chanenchuk is one of the niftiest players, but is<br />\nrelatively new to playing midfield. He needs to continue to improve on defense.\" A Farmingdale, New<br />\nYork product, Chanenchuk will probably play on the<br />\nsame line with former high school teammate<br />\nKrumenacker, which should help him all around. To<br />\nbe successful, however, he will need to improve on his<br />\nshot, which is somewhat weak.<br />\nWhile Castle did not play much during the second<br />\nhalf of the 1984 season, he will also be on one of the<br />\ntop two lines. A quick and extremely fast middie with<br />\na very hard outside shot, Castle will pose a threat to<br />\nany defense. He should be especially helpful against<br />\nzones, where his shot will keep the Jays' opponents<br />\nhonest.<br />\nCrawford continues in much the same capacity as<br />\nlast year, when he impressed many Hopkins fans with<br />\nhis all-out play on the third midfield line. This<br />\nsophomore had only one goal and assist, but netted<br />\n12 groundballs. \"Jack gives 100 percent all the time,\"<br />\nsaid Zimmerman. \"He's relentless and does the things<br />\nyou need him to do. He's going to play.\"<br />\nJohn Dressel, a two-time high school All-America,<br /><br />\nis the second third line member.The Lawrenceville product has had an average pre-season, but \"possesses<br />\na wealth of ability,\" according to Zimmerman. He<br />\nmay see extra action on clears.<br />\nRzempoluch is the newest member of the Farmingdale Connection. He will team with Crawford and<br />\nDressel on the third line and may face-off occasionally.<br />\nStewart will play occasionally and may also faceoff. He had a good fall, according to Zimmerman,and<br />\nhas worked hard preparing for the season.<br />\nDiorio will also play infrequently, though his role<br />\nmay change as the season progresses. When he does<br />\nsee action it will probably be on clears.<br />\nWebster is a walk-on and this will be his first season<br />\nwith the team.<br />\nOne of the biggest factors in Hopkins' last two<br />\nchampionship games was ball control off the faceoffs.<br />\nIn 1983, Syracuse dominated late in the game and was<br />\nable to launch its tremendous comeback. Last year, Hopkins jumped out to an early lead as it won nearly<br />\nevery faceoff in the first quarter, and held off Syracuse<br />\nlater on as the faceoff unit retained control of the ball.<br />\nThis season, the Blue Jays will be even stronger as<br />\nthey return all three of their specialists, Greg Matthews, Lee Davidson and Glenn Fidje, and add potential depth with middies Joe Rzempoluch and Damon<br />\nStewart.<br />\nMatthews took the majority of faceoffs last season<br />\n(64 percent) and dominated in almost every game, winning just over three-fifths of them. He also had 84<br />\ngroundballs and won the Ciccarone Ground Ball<br />\nAward for his efforts. This was a vast improvement<br />\nover the 1983 season when he had a modest 55. The<br />\nsenior can only improve this year, and if his progress<br />\nis as dramatic as last year, he may dominate totally.<br />\nDavidson saw considerable action as well, taking a<br />\nquarter of the faceoffs and winning over 64 percent,<br />\nbest on the team. He also scored four goals and added an assist while scooping up 35 groundballs. Davidson will most likely be Matthews' main challenger for<br />\nthe number one position.<br />\nFidge didn't see much action, facing-off only 30<br />\ntimes, but he did win 63 percent and grabbed-up 14<br />\ngroundballs. He will have to work hard to beat out<br />\nhis teammates.<br /><br />\nMIDFIELD<br />\nIf you subscribe to the theory that games are won<br />\nat midfield, you'll be happy to know that the middies<br />\ncomprise Hopkins' strongest unit and are probably-the<br />\nbest midfields in the nation. This is largely the result<br />\nof the Jays' small losses and their typically strong<br />\nrecruiting effort. Hopkins lost only three players from<br />\nthis unit as honorable mention All-America John<br />\nTucker and Rich Glancy were graduated, and<br />\nfreshman Tom Engelke transferred to Nassau County Junior College.<br />\nReturning for the Blue Jays are first team AllAmerica and Division I Midfielder of the Year Del<br />\nDressel and second team All-America John<br />\nKrumenacker from the starting line, and juniors Steve<br />\nMutscheller and Chris Schreiber from the second line.<br />\nThe Jays also return seniors Glenn Fidje, Lee Davidson, and Greg Matthews, junior Dave Castle, and<br />\nsophomores Bruce Chanenchuk, Jack Crawford,<br />\nDamon Stewart, and Joe Diorio. New players include<br />\nsophomore Mike Webster and freshman recruits Joe<br />\nRzempoluch and John Dressel.<br />\nDel Dressel is generally regarded as the best midfielder on the squad, having been, by far, the highest<br />\nscoring middie for the last two years. He has also been<br />\nvery consistent, netting 27 goals each year with an<br />\naverage of 18 assists. Additionally, Dressel has been<br />\na veritable ball hog, scooping up 59 groundballs last<br />\nseason while taking well over 100 shots. Perhaps his<br />\ngreatest asset, though, is his ability to lead the transition fast breaks and to score when the team needs<br />\na goal. This season, Dressel should continue to<br />\ndominate at midfield, as he takes one step closer<br />\ntoward becoming only the third four-time first team<br />\nAll-American in collegiate lacrosse history.<br />\nThe second big gun in this unit is tri-captain<br />\nKrumenacker. Despite having a somewhat disappointing season offensively in 1984, Zimmerman is confident in this senior's talents and his ability to bounce<br />\nback to peak form. \"John does a great job defensively and is very good at setting up the other players,\"<br />\nsaid Zimmerman. \"He just needs to concentrate at<br />\nputting the ball on net.\" In addition, nobody on the<br />\nteam executes the clear as well as Krumenacker,<br />\nespecially against the tough riders such as North<br />\nCarolina. Should \"Boomer\" regain his accuracy, he<br />\nwill undoubtedly fill opponents' nets this season.<br /><br />\nDEFENSE<br />\npend to a large extent on Matricciani's ability to keep<br />\nthe crease clear.<br />\nPallace will fill Steve Dubin's spot among the<br />\nstarters after spending last year on the rope unit. Termed \"A Gamer\" by Zimmerman, this Calvert Hall product scooped up 15 groundballs last season, while committing but one penalty. According to the coach,<br />\nPallace \"has been practicing and playing extremely<br />\nwell,\" and his continually improving, consistent play<br />\nshould help solidify the defensive unit.<br />\nMcLam is the leader on the rope unit and a potential starter should any of them be injured. A high<br />\nschool midfielder, McLam has the speed and ability<br />\nto lead a fast break upfield as he dished out two assists<br />\nlast season. He also raked in 17 groundballs. \"McLam<br />\ndid an outstanding job last year on the rope,\" said ,<br />\nZimmerman,\"and he has the potential of shutting off<br />\nany midfielder in the country.\"<br />\nA three-sport letterman, Mitchell will again be on<br />\nthe rope unit, although Zimmerman feels this<br />\n\"talented athlete\" has the ability to play crease as well.<br />\nMitchell collected 16 groundballs last year, and with<br />\nhis strengths of speed and size, this sophomore should<br />\ncontribute greatly towards the defense's success.<br />\nA high school All-American two years ago,<br />\nWickwire has not developed as quickly as was expected. Though talented, this Concord Carlisle proContinued on Page 19<br /><br />\nJay Matricciani - In the Crease<br /><br />\nAnother unit with minimal losses, the Blue Jay<br />\ndefense should be strong again this year. The Jays lost<br />\nonly two players to graduation, starter Steve Dubin<br />\nand Frank DeVita, and return eight lettermen, starters<br />\nfirst team All-America John DeTommaso and cocaptain Guy Matricciani, juniors Dan Pallace, Brad<br />\nMcLam, and Jon Krome, and sophomores Chris<br />\nWickwire, Steve Mitchell and Doug Oursler. The unit<br />\nalso adds freshman walk-on Eric Shaw.<br />\nDeTommaso, a two-year starter, is the anchor of<br />\nthe defense. Big and strong with tremendous endurance, DeTommaso plays extremely aggresively and<br />\nhas the ability to shut down almost every attackman<br />\nin the nation. Last year, this junior had 47 groundballs, tops among defenders, and committed only three<br />\npenalties, the least among starters by far . This year,<br />\nDeTommaso should dominate opposing attackmen<br />\neven more, as he gains greater experience. His importance to this unit, though, is much deeper than his<br />\nplay. As the spiritual leader, DeTommaso's presence<br />\nwill be critical in helping the defense to mature and<br />\nalways play its best.<br />\nTr -captain Matricciani will return to the crease this<br />\nyear and possesses the talent to have an outstanding<br />\nseason. \"Matro\" has very good stickwork and is excellent at leading the charge upfield. He also had 44<br />\ngroundballs, second at his position. This senior will<br />\nhave to continue working hard, though, as the success of Hopkins' man-to-man defensive play will de-<br /><br />\nCo-captain Guy Matricciani<br /><br />\nLACROSSE '85/19LAX<br /><br />\nA Freshman's Guide: The Joy ofSpring at the Hop<br />\n0000000000000<br /><br />\nc<br /><br />\nby Howard Bregman<br /><br />\n00000000000<br /><br />\n00000000000<br /><br />\nA Glossary of Hopkins Lacrosse 0<br />\n0<br />\nSieves: A small but growing band of revolutionaries<br />\nBananas: The traditional Hopkins Lacrosse<br />\nwho gain pleasure from harassing the opposing<br />\ngroupies. They always stand for \"To Win.\" A<br />\nis<br />\ngoalie. Often seen holding ordinary kitchen 0<br />\nbanana<br />\nawarded by the group to the selected<br />\n0<br />\nbrief<br /><br />\nIf you are new to Hopkins, the game of lacrosse may<br />\nseem to you to be an interesting bit of trivia. It is played<br />\nreligiously in only a few areas of the globe, and it seems<br />\nto be a rather unorganized mass of activity, anyway.<br />\nplayer of the game.<br />\nWelcome to spring at Homewood. At Hopkins, Boomer: John Krumenacker, Midfield<br />\nwhere complaints about social life and activities are<br />\nChic: Any one of the members of the Ciccarone<br />\never present, lacrosse is an outlet which is almost<br />\nThe patriarch, Henry A. Ciccarone, Sr., was<br />\nclan.<br />\nuniversally enjoyed. Sadly, perhaps, Hopkins is usually<br />\nHopkins' head coach from 1975 to 1983.<br />\nassociated with two institutions: the medical school<br />\nand the lacrosse team. Fortunately, both live up to 0 Deto: John DeTommaso, Defense<br />\n\"Johnny Hopkins\": The fight song played before<br />\ntheir reputation.<br />\nIf you have yet to be exposed to the game, read on. and after each game, as the team enters and leaves<br />\nIf you plan to be at Homewood Field tomorrow, it r, the field.<br />\nLarry: Lawrence J. Quinn, Goalie<br />\nhelps to know what is going on. If you expect to be<br />\nyour<br />\nWille Scroggs, head coach of the UniverScroggs:<br />\nchange<br />\nto<br />\nsomewhere else, this may convince you<br />\nof<br />\nNorth<br />\nsity<br />\nCarolina. The epitome of the oppos0<br />\nplans.<br />\n0 ing coach, someone everyone loves to hate. Hopkins<br />\n0 class of '69.<br />\nThe Game of Lacrosse<br />\nU<br /><br />\nLacrosse, in its original form, was widely played by<br />\nNorth American Indians as early as the 1600's. It was<br />\ndescribed in accounts by European settlers, who<br />\nobserved unruly competitions among hundreds of<br />\ncompetitors which lasted from many hours to many<br />\ndays. The game was to the Indians a source of recreation and a means of preparation of warriors.<br />\nLacrosse today has incorporated the essentials of a<br />\ngood spectator sport. Its principles are basic: Two<br />\nteams of ten players each compete on an open field<br />\n110 yards long, with the object of shooting a hard rubber ball into the opposing net. The restrictions which<br />\nmake the game unique are that a player may only control the ball by maneuvering it with a large stick capped by a small net(although the ball may also be kicked). Armed with this weapon, the player can pass,<br />\nbounce, and shoot the ball with remarkable accuracy.<br />\nThe game itself lasts 60 minutes on the college level,<br />\nwith stoppage of play for goals, penalties, and outof-bounds. Penalties include the following: offsides,<br />\nviolated when a team has fewer than three men on the<br />\noffensive side of the field or fewer than four on the<br />\ndefensive side; crease violations; unsportsmanlike conduct; and rough play violations, including pushing,<br />\nslashing, and illegal checking.<br />\nAmong the ten men on the field, three attackmen<br />\nremain on the offensive half of the field, three<br />\ndefensemen occupy the defensive half, and three midfielders traverse the entire field. The goalie directly<br />\nguards the goal and is provided with a circular crease<br />\nwhich the opposing team may not enter.<br />\nStrict restrictions are placed on the sticks, which are<br />\nlimited in material and dimensions. Illegal sticks draw<br />\nsevere penalties.<br />\nRules concerning possession in lacrosse are different<br />\n'than many other sports. Turnovers occur when a ball<br />\nin one team's possession is lost out of bounds or when<br />\na penalty occurs. Another rule unique to lacrosse states<br />\nthat a shot on goal which goes out of bounds is given<br />\nto the player that was closest to the ball when it left<br />\nthe field.<br />\nLacrosse is a game which is constantly in motion.,<br />\nThe officials attempt to keep the game moving as<br />\nquickly as possible by starting the clock as soon as the<br />\nball is ready. A game will last two hours or more<br />\nWithout a boring moment.<br />\nLacrosse at Johns Hopkins<br />\nMost of us have heard this before. It appears in<br />\nevery lacrosse program. Despite the incessant repitition, the statistics are rather awesome:<br />\nSince receiving official recognition from the university in 1888, the Johns Hopkins Blue Jays have. . .<br />\n°won or shared 40 national championships<br />\n*compiled 73 winning seasons, only 13 losing ones, and<br />\n11 even, for a seasonal victory mark of 80 percent..<br />\n'produced 131 first team All-America selections since<br />\nthe first team was chosen in 1922.<br />\n*placed 40 members in the present 147-member<br />\nLacrosse Hall of Fame.<br />\n*twice represented the United States in the Olympic<br />\nGames.<br />\n'won 5 NCAA championships since the tournament<br />\nbegan in 1971.<br />\nMost Hopkins students enter the school knowing little about the game and leave as trained experts. Games<br />\nare very well attended and attract a wide variety of people from the community and the lacrosse world in<br />\ngeneral. Tickets this year cost three dollars, but don't<br />\nworry: admission is free with a student ID.<br /><br />\noeceo0000000000e000000000e®<br /><br />\n00000000000<br /><br />\n0000000000000<br /><br />\nstrainers. For more information, see the<br />\narticle on page 12.<br />\nSimmons: Roy Simmons, Jr., head coach of<br />\nSyracuse University. Quickly becoming the new<br />\nepitome of the opposing coach.<br />\n\"To Win\": The fight song with the silly lyrics<br />\nplayed after each Hopkins goal. Few people actual')<br />\nknow the words. Mark Margolin, Hopkins band<br />\ndirector, knows them.<br />\n\"We Want More\": Come to a game. You'll find<br />\nout.<br />\nZim: Johns Hopkins Head Coach Don Zimmerman. Noted for being Homewood's most eligible<br />\nbachelor.<br /><br />\n000<br /><br />\n000000000000000000000000000000000000000000000000040C&gt;04&gt;0®<br /><br />\nQuinn to Quarterback Defense<br />\nContinued from Page 18<br /><br />\nQuinn had 188 saves and surrendered only 76 goals<br />\nduct seems to lack concentration and aggressiveness in 1984 for a .712 save percentage. He also led the team<br />\non the field. Zimmerman has indicated that he will with 87 groundballs, a high total for a goalie, and inallow Wickwire more playing time as he developes dicative of his prowness outside the crease. Often,<br />\nphysically and improves his one-on-one play. Wickwire Quinn will leave the goal mouth to intercept a pass or<br />\nwill play on the rope unit.<br />\nstick check an unsuspecting attackman.<br />\nKrome, though he did not play much last season,<br />\nBesides being the final line of defense, Quinn is like<br />\nhas improved greatly and will battle Wickwire for a a captain at the helm of his ship, letting the defensemen<br />\nrope position.<br />\nknow where the ball is at all times and keeping conShaw will probably not play much this season. A trol. \"He's not only a tremendous stopper,\" said Zimwalk-on from Denver, Colorado, he simply has too merman, \"he's a tremendous leader.\" In addition,<br />\nmany talented teammates to contend with.<br />\nQuinn's ability to make a save and quickly fire an<br />\nOursler is another victim of his teammates. He may outlet pass upfield is one of the keys to Hopkins'<br />\nget playing time against Princeton and Towson State. highly successful transition game.<br />\nJones, a Loch Raven graduate, will be fulfilling a<br />\nvery important role this year. As the number two<br />\nThe goal is definitely the Blue Jays' strongest posi- goalie, he must be ready to fill in for Quinn at any<br />\ntion, though it lacks the depth of he midfield. The time. Unfortunately, Coach Zimmerman has indicated<br />\nmain reason for its strength is the return of first team that he will only play Jones should Quinn be injured<br />\nAll-America, Division I MVP, and Championship or if Hopkins has a very comfortable lead.<br />\nGame MVP Larry Quinn. Hopkins also returns<br />\nDespite Jones' limited exposure his freshman year<br />\nsophomore Stuart Jones and has recruited freshman (he had eight saves while allowing five goals), he has<br />\nJeff Kramer. John Madden, the number two goalie looked poised in the goal and lacks only experience,<br />\nlast season, has decided to retire.<br />\nparticularly on clears. Said Zimmerman,\"I have total,<br />\nTr -captain Quinn is probably the most important • confidence in Stuart's abilities.\"<br />\nAs the number three goalie, Kramer's playing time,<br />\ncontributor to the team. His steady, often spectacular<br />\nplay last season was one of the main reasons Hopkins will be very limited. That is, unless Quinn and/or<br />\nwas able to claim the national championship. \"He's Jones cannot play. A high school All-American from<br />\nthe key,\" say Zimmerman. \"Whenever you have a Ohio, Kramer needs to gain collegiate experience and<br />\ngoalie of Larry's ability, you're going to cover a lot a feel for the Homewood turf; he looked weak on the<br />\nof mistakes.\"<br />\nhigh astro-bouncers during fall scrimmages.<br /><br />\nGOAL<br /><br />\nUSED CONTAINERS<br />\n20 OR 40 FOOT<br />\nFOR SALE<br />\n686-4430 ME 8 am-4 pm<br />\n!;rir7777<br />\nit<br />\n( ,<br /><br />\n.,_<br /><br />\nGREAT FOR STORAGE SHED<br />\nCall<br />\nHANK THIELEMANN<br /><br />\n-<br /><br />\nHAVE AN<br />\nALL LACROSSE SPRING!!<br />\n!MOM ST QUART..<br /><br />\nRAIN SHEET<br /><br />\nOT<br /><br />\nOT<br /><br />\n01<br /><br />\nTOT.<br /><br />\nMOTO<br /><br />\nMOW 1.401<br /><br />\n3.0331 1133.<br />\nVein.<br /><br />\n__.,2.<br />\n13<br />\n,1•06 T(331<br /><br />\nMONO<br />\n031.C.31.3<br /><br />\nECC - LACROSS<br />\n1111.1111<br /><br />\nCOAC11111<br /><br />\nALL NEW<br /><br />\n1.0311 OUTS<br /><br />\n1306011 TWO<br />\nHOOK TWA<br />\nOOTINO<br /><br />\nMILO 31/13311<br /><br />\n0.3<br /><br />\n1111.1.1<br />\nOW.111111<br /><br />\n0.0.11113<br />\n1<br /><br />\n3<br /><br />\n•<br /><br />\no3C1334<br /><br />\n1<br /><br />\n3<br /><br />\nAll Lacrosse<br />\nThe \"Rain Sheet\"<br />\nLaminated sheet allows you to keep game<br />\nstats in any weather. Transfer them to your<br />\npermanent records...wipe clean and use<br />\nagain!<br /><br />\nAll Lacrosse<br /><br />\nSHOOTING<br />\nNETS!<br /><br />\nBIGGER<br />\nTHAN EVER<br />\nfor<br />\nThe Official<br /><br />\n1985<br />\nALL LACROSSE<br /><br />\nEquipment Catalog<br /><br />\n• Any Color<br />\n• Great for<br />\nPractice<br /><br />\n19851!<br />\n• New Sticks<br />\n• New Pads<br />\n• New Helmets<br />\n• Shirts &amp; Shimmels<br />\n• Posters &amp; Novelties<br />\n• Components/Accessories<br />\n• Much, Much More!<br /><br />\n$25°<br /><br />\nThe Original<br />\nAll Lacrosse<br />\nTM<br /><br />\nGoal Net<br />\n100% Guaranteed<br /><br />\nALL LACROSSE<br />\nIF IT HAS ANYTHING<br />\nAT ALL TO DO WITH<br />\nLACROSSE...<br /><br />\n18 So. Fullerton Ave.<br />\nMontclair, N.J. 07042<br />\n(201) 746-3222<br /><br />\n800-LACROSS<br />\nFor Orders Only<br /><br />"}], "field_media_file": [{"target_id": 41716, "display": null, "description": null, "target_type": "file", "target_uuid": "354b923a-6d17-48a6-b8d4-592daba4b7fd", "url": "http://digital.library.jhu.edu/system/files/2022-03/14554-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 14554, "target_type": "node", "target_uuid": "9c55ad0b-2c90-4d35-9ded-dc56060e4f44", "url": "/node/14554"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "34e1be52-3ceb-4ed3-a949-8b8e4321d762"}]}