{"mid": [{"value": 35542}], "uuid": [{"value": "b3478a1d-d76c-4a93-8836-2f7b5890412a"}], "vid": [{"value": 35542}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:08:19+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12098-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:08:19+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:08:19+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol. II.<br />\n<br />\nt<br />\n<br />\nt 1 t<br />\n<br />\nDECEMBER 10th, 1897.<br />\n<br />\ntbe<br />\n<br />\nPublished by Students of<br />\nPress of<br />\nGuggenheimer, Well & Co. 41<br />\n<br />\naft• THE JOHNS HOPKINS<br />\nit UNIVERSITY<br />\n<br />\n4... ISSUED<br />\n<br />\n11'14'1 BALTIMORE<br />\n<br />\net I 1'<br />\n<br />\nFORTNIGHTLY<br />\n<br />\n\fTHE UNIVERSITY SCHOOL 122R BOYS<br />\nW. S. MARSTON, A.13 anti C. R.<br />\nPrincipal.<br />\n<br />\n710 and<br />\n<br />\n712 Madison<br />\n<br />\nAve.<br />\n<br />\n51e018 SCIROOL prepare. boys for admitteloo to the Johns Hopkins or any University or<br />\nScientific School. It has fitted more the,. one hundred for the Johns Hopkins alone,<br />\nI so many for Harvard, Tate, Princotoo. the Mamotrhuaette Institute of Technology, the<br />\nTroy Polytechnic end other Collegea out Schoole, In October. 18W-95, two of the five<br />\nenholarshIps given at the Johns Ildipknin lotow tostrioulAtes, were awarded to Its pupil.. It<br />\nhes good lehoratory nod a well equipped EVelnest oil., which le ender the ch.rge of e<br />\ntont instructor. re, thru,,i1110rIllottion or for catalognee, wltlreaa the Principal, at No. lOil<br />\nN. Calvert Street..<br />\n<br />\nOakimore<br />\n<br />\nB. G. EICHELBERGER,<br />\nBOOKS fIND FINE STATIONBRY,<br />\n(1111•UED<br />\n<br />\nEVERY<br />\n<br />\n308 N. CHARLES ST.<br />\nV. A. O. A. ntniattsto.<br />\n<br />\nFRIDAY.)<br />\n<br />\nBaltimore, Md.<br />\n<br />\nThe Society Paper of Baltimore.<br />\n<br />\nThe professors and students of the Johns Hopkins<br />\nUniversity will find it to their advantage to examine<br />\nstock and make purchases from the following old<br />\nestablished house, Jordan Stabler, importer, jobber<br />\nand retailer of staple and fancy groceries, 701, 703 and<br />\n705 Madison avenue, cor. Eutaw St. Telephone 817.<br />\n<br />\nBRIGHT AND BREEZY.<br />\n<br />\nJUST<br />\nTWO THOUGHTS<br />\n<br />\nCushing g Company, 11<br />\n<br />\nBOOKSELLERS<br />\nSTATIONERS<br />\n34 WEST BALTIMORE STREET.<br />\n<br />\nINTERESTING TO GOOD DRESSERS.<br />\n<br />\nOur OVERCOATS<br />\n<br />\nThe TUXEDO<br />\n<br />\nSUIT<br />\n<br />\nare their own argument<br />\nfor warmth, wear and<br />\nstyle. Off-and-On easy<br />\nis our idea that helps<br />\nmake them popular.<br />\n<br />\nis comfort, style and service in cloth. We studied<br />\nto make them beautiful<br />\nand have succeeded.<br />\n<br />\nSCHOOL, LAW, MEDICAL, AND CLASSICAL AM> miHORI.I.ANI,:tais HOOKS<br />\n:<br />\nKeep oonstantly on hand the Text Books need lo Johns Hopkins University, Johns Hopkina<br />\nHospital, And The Woman's College of Baltimore.<br />\nSTATIONEEY.—For School, Family, Oftlee Ind Bank.<br />\n<br />\nJohns Hopkins University.<br />\n<br />\nJOHN R. LEMMERT,<br />\n14 E. FAYETTE ST.<br />\nPHOTO plikP<br />\n<br />\nTAILOR<br />\n<br />\nEs<br />\niCs pp L.1<br />\n<br />\nAND<br />\n<br />\nAND<br />\n<br />\n/<br />\n<br />\nPROGRAMMES FOR 1897-98.<br />\n<br />\nDRAPER.<br />\n<br />\nCanaeras &. Sueplies..<br />\n<br />\nTh_johns Hopkins_tTniversity_Circular containing announcements<br />\n. . of the Collegiate and Graduate courses offered for the aca. . demi( year beginning October ist, 1897, may be had on appli. . cation to the Registrar of the Johns Hopkins University.<br />\n<br />\nDeveloping<br />\nOe<br />\n<br />\nand<br />\n<br />\nec<br />\nte<br />\n<br />\nPrinting.<br />\n<br />\nTHE JOHNS HOPKINS MEDICAL SCHOOL.<br />\nof the johns Hopkins Medical School may also<br />\nhad on application to the Registrars._<br />\n<br />\nThe announcements<br />\n<br />\nTHE CUMMINS<br />\nPHOTO-STOCK CO,<br />\n<br />\n. . he<br />\n<br />\n106 N. Charles St.<br />\n<br />\nMAN DO L.I NS Are used exclusively by all the leading amateurs,<br />\nprofessionals and College Clubs, from Maine to<br />\nGU ITAIRS<br />\nCalifornia. ilAtr Only one grade, the BEST.<br />\nThe celebrated Griffith Blue End Strings for the Banjo, Mandolin and Guitar seldom snap.<br />\nSpecial discount to Students.<br />\nBuy direct from the manufacturers and save the middleman's profit.<br />\n<br />\nQRIFF1111<br />\n<br />\nMANUFACTURED SY<br />\n<br />\nTAILOR AND SHIRT MAKER,<br />\nN. E. oor. Lexington and. Liberty Ste.<br />\nr-r-N<br />\n<br />\nGents Underwear made to Order; also Dyeing, Scouring<br />\n<br />\nand<br />\n<br />\n'3UOIS 911110 HAD<br />\n<br />\nOVER DRUG STORE.<br />\n<br />\nD. E. WILLIAMS,<br />\n<br />\nFR ca<br />\n<br />\nF. H. GRIFFITH du CO.,<br />\n<br />\nFactory and Salesroom,<br />\n<br />\nMention this paper when you call or write.<br />\n<br />\n871 N. Howard St., Baltimore, Md.<br />\n<br />\nHENDERSON'S<br />\nUNIVERSITY<br />\nBOOK STORE<br />\n<br />\n. Text Books<br />\n. Note Books .<br />\nStudents' Supplies<br />\n<br />\nMadison & Howard Sts.<br />\n<br />\nRepairing.<br />\n<br />\nYou Fairly Fly on-<br />\n<br />\na\"<br />\nSMPINPUIPUINIMM11<br />\n.<br />\n.<br />\n1 11<br />\n<br />\neating<br />\n<br />\nGrand\"<br />\n<br />\nIt's the Wheel of Wheels, with its<br />\nDouble Roller Chain-\"that curve\"<br />\nand many other \"365 days ahead<br />\nof all others \"--advantages.<br />\nDIAMOND WHEEL CO,, in N. Charles St.<br />\n<br />\nBaltimore Hardware Co., Baltimore & Greene Sts.-Branch.<br />\n<br />\n\fthe lRewe /Letter.<br />\nVol. II.<br />\n<br />\nFortnightly<br />\n<br />\nTHE ACADEMIC POINT OF VIEW.<br />\nPractical men object to what they call \"the<br />\nacademic point of view,\" and object with so<br />\nmuch emphasis and persistency that there<br />\nmust be something more than a mere ignorant dislike at the bottom of their feeling in<br />\nthe matter. Indeed, I think that academic<br />\nmen once and again catch themselves entertaining the same feeling for a brief interval, if<br />\nthey stir much abroad in the world. An uneasy consciousness creeps in upon them that<br />\ntheir ordinary way of looking at things in the<br />\nlecture hall and in class-room discussions is a<br />\nvery much specialized way and seems always<br />\na little narrow and impractical when used in<br />\nthe midst of affairs. It may be, in its place, a<br />\nnecessary and useful way of looking at things,<br />\nand better suited than most to clarified reasoning ; but it involves standing at a peculiar<br />\npoint of view, hardly practicable for men outside the University; and, though we may<br />\nChoose to retain it, it is best that we should<br />\nunderstand just what it is and know how, by<br />\nkeeping it, we differ from the man of affairs.<br />\nIf a man of affairs were asked what it was<br />\nthat made him feel out of sympathy with university teachers and with the pupils who had<br />\nbeen most recently under their influence, he<br />\nwould probably say that practical men look at<br />\nthings as they are, but that university men prefer to look at things as they ought to be; and<br />\nthat, since things are not as they ought to be,<br />\nuniversity men usually fail to get practicable<br />\nopinions, for all their thinking. Some of this<br />\nthe university man must admit. He studies<br />\nfacts to get at principles, and when he has arrived at his principles he perceives that some<br />\nof the facts he has recorded and examined are<br />\nessential, while the rest are subsidiary and in<br />\na sense accidental — aside from the point.<br />\nThese latter he forthwith puts on one side and<br />\nproceeds to neglect, and builds his reasoning<br />\non the significant<br />\nand essential matters which<br />\nhe has sifted out.<br />\nHe has reached his \"aca-<br />\n<br />\nNo. 5<br />\n<br />\ndemic point of view,\" and has set his reasoning free from encumbrance. He has discovered how things would be if principles operated<br />\nsingly, simply, without mixture or confusion<br />\nof irrelevant things. However concrete his<br />\n.facts, they are selected facts, and he is reasoning in the abstract, looking at the gross world<br />\nin analysis, and not in combination.<br />\nThat is why the practical man regards him<br />\nwith uneasiness and charges him with dealing<br />\nin unrealities. The practical man knows that<br />\nin affairs things cannot be treated as simples :<br />\nfacts cannot be selected. Logically irrelevant<br />\ncircumstances may in actual life have as much<br />\nimportance as circumstances which are of the<br />\nessence of the business in hand, and, however<br />\nmuch you may wish to sift the pertinent from<br />\nthe impertinent, you cannot do it. They are,<br />\nin fact, inseparable, and you must deal with<br />\nthem in the bulk, not according to their quality, but according to their gross weight and<br />\nquantity. You are apt to be rendered incapable of dealing with actual life, the practical man<br />\nbelieves, by dealing so much with your own<br />\nabstract and partial analysis of it. You may<br />\nhave a perfectly developed logical faculty, and<br />\nyet no practical sagacity whatever : your practice in abstract reasoning may even tend to destroy your native sense of what is wise and<br />\npracticable, for it may render you impatient<br />\nwith makeshift and management, your only<br />\nmeans of success. The new-fledged college<br />\ngraduate always wants to \"turn the world upside down,\" older men complain, and that very<br />\ndesire proves his unwise training.<br />\nThere is something in these objections that<br />\ncollege men ought to heed. We should not<br />\ngive up abstract reasoning or stop subjecting<br />\nfacts to a careful differentiation and sifting.<br />\nWe must continue to separate facts and to<br />\nclassify them, to purge away their accidental<br />\nelements, and to come at their secrets of abstract principle and intrinsic law. We could<br />\nhave no science, otherwise, and no adequate<br />\nknowledge of the world in its elements; and<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nunless'we knew it in its elements we could not<br />\nknow it in its action as a whole, complex and<br />\nfruitful of power. But we should have the<br />\nother side of knowledge, too — that feeling for<br />\naffairs which is synthetic and which shall enable us to deal with rough life as we find it.<br />\nWe must not fall out of sympathy with life because it is not like what we make of it in our<br />\nlaboratories and in our seminaries. We must<br />\nbe proper men of the world, as well as trained<br />\nacademic reasoners must know when and<br />\nwhere \"the academic point of view\" is to be<br />\ntaken and when and where it is entirely out of<br />\nplace, and pedantic.<br />\nNo doubt the best way to reach this balance<br />\nand readiness at adjustment is to give our<br />\nminds a various diet and a liberal view of the<br />\nworld, by reading books that are full of the<br />\ncommon life of the world, as well as books<br />\nupon our own special topics of academic<br />\nstudy — the better sort of novels, with real<br />\npeople in them, such as masters like Fielding<br />\nand Sienkiewicz can create; such poetry as<br />\nruns hot with the motives that send men to action and to self-sacrifice; such histories as contain the real rush and variety of life; and travels that meant something more for the traveler<br />\nthan mere sight-seeing or mere pleasure. University men seldom have time during their<br />\nterm of study for real contact with affairs; but<br />\nthey can put their minds every day for a little<br />\nwhile into the air of the world that moves outside laboratories and lecture halls, in streets<br />\nand markets, on prairie and ocean, on frontiers<br />\nand battle-fields, in households and in the lobbies of parliaments — and so not forget that<br />\nother side of things which the practical man<br />\nfears he may forget. He should not for a moment despise his \"academic point of view\"<br />\n(for the advancement of exact knowledge and,<br />\nin the end, the progress of the world depend<br />\nupon its assiduous cultivation) ; but he should<br />\nbe ready to abandon it, and should instinctively<br />\nabandon it, the moment it becomes unsuitable<br />\nfor the practical business of life. He must not<br />\nbe a pedant : he must be a trained thinker who<br />\nis also a man of the world.<br />\nWOODROW WILSON.<br />\n<br />\nDR. VINCENT ON \"GENEVA.\"<br />\nProfessor Vincent delivered a very entertaining address upon \"Geneva\" before the<br />\nHistorical and Political Science Association<br />\non Friday evening. His talk was based upon<br />\npersonal reminiscences of his visit to the city<br />\nlast summer. The worthy professor was considerably shocked at the rather loose observance of the Sabbath. Every Sunday morning<br />\nhe was awakened by target practice under his<br />\nwindow ; and, after enjoying a very pious sermon, was accustomed to see the worthy<br />\npreacher regaling himself with a game of ten<br />\npins and other kindred amusements. Elections are always held on that day; and in consideration of municipal politics, it is worthy to<br />\nnote that the Genevese do not apparently care<br />\nfor the luxury of a mayor, and consequently<br />\nentrust the duties of that office to a council.<br />\nThe Church and State are very closely connected, ministers being elected by popular vote<br />\nof the people, and have their salaries paid by<br />\nthe Government. The laboring classes are<br />\npoor, but not subdued; and nowhere in Europe, says Professor Vincent, did he find that<br />\ncharacteristically American broadness of<br />\nviews and democratic instincts so prevalent as<br />\nin Geneva. The beauties of the place are seldom exaggerated. The effect of the gorgeous<br />\ngrandeur of its surrounding rivers and mountains make a picture almost too glorious for<br />\ndescription.<br />\nIn accordance with Professor Adams' custom of making the library and lecture-rooms<br />\nas attractive as possible, quite a number of new<br />\npictures and paintings have been added to the<br />\nlarge number which now hang upon the walls.<br />\n\"Boswell,\" said Dr. Johnson, meeting the<br />\nbiographer on the street, \"I have been reading some of your manuscripts. There is a<br />\ngreat deal about yourself in them. They seem<br />\nto me to be Youmoirs rather than Memoirs.\"—<br />\nPuck.<br />\nProfessor: How dare you swear before me?<br />\nFreshman: How did I know you wanted to<br />\nswear first.—Exchange.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nNEWS OF A FORTNIGHT.<br />\n<br />\n.3!<br />\n<br />\nTHE MUSICAL ASSOCIATION.<br />\nIt is proposed to form a musical association<br />\nat the Johns Hopkins University. Only persons enrolled in the register of the University<br />\nand their wives are eligible to membership.<br />\nThe annual dues will be $1. The association<br />\nwill give four evening musicales, under the direction of Mr. W.Edward Heimendahl, in McCoy Hall, during the months of December,<br />\nJanuary, February and March. The number<br />\nof persons present at the musicales is limited<br />\nto 250. Membership tickets may be obtained at the office of the Registrar of the University. The arrangements are made by the<br />\nfollowing persons:<br />\nPresident and Mrs. Gilman,<br />\nProf. P. Haupt,<br />\nMrs. E. H. Griffin,<br />\nMrs. M.Bloomfield, Dr.T.S. Baker,<br />\nDr. Philip Ogden,<br />\nMrs. Paul Haupt,<br />\nMrs. H.E. Greene,<br />\nMr. C. C. Schenck,<br />\nMrs. William Bullock Clark.<br />\nThe first meeting of the association will be<br />\nheld on Friday, December 17, at 8:15 P. M.,<br />\nwith the following programme:<br />\nI. Joseph Haydn (1732-1809):<br />\nString quartet in D major.<br />\n(a) Allegro moderato.<br />\n(b) Adagio cantabile.<br />\n(c) Menuetto : Allegretto.<br />\n(d) Finale: Vivace.<br />\nMessrs. Heimendahl, Moses, Saunders,<br />\nFurth meyer.<br />\n2. Franz Liszt (1811-1886):<br />\n(a) Etude in D fiat major.<br />\n(b) Liebestraum Nocturne.<br />\nMiss Hermine Liiders.<br />\n3. Max Bruch (1838):<br />\nViolin concerto in G minor.<br />\nSecond movement: Adagio.<br />\nMr. W. Edward Heimendahl.<br />\n4. Robert Schumann (1810-1856):<br />\nDichterliebe.<br />\nFive songs : Nos. I, 2, 3, 4 and 7.<br />\nMr. T. S. Baker.<br />\n5. Anton Rubinstein (1830-1894):<br />\nPiano concerto in D minor.<br />\nFirst movement :<br />\nMiss Hermine Luders.<br />\n<br />\n3<br />\n<br />\n\"PREPARATION FOR PUBLIC LIFE.\"<br />\nThe joint session of the Congress on November 8 was held for the purpose of listening<br />\nto an address by President Gilman. Speaker<br />\nFrench, of the House, called the meeting to<br />\norder, and after welcoming the Senate to the<br />\njoint session, gave up the chair to President<br />\nDieffenbach, of the Senate. The Censor announced that the President desired to address<br />\nthe meeting, and Messrs. Straus and Grimes<br />\nwere appointed to escort him to the room.<br />\nIn his speech Dr. Gilman dwelt upon the<br />\nvalue of presence to a speaker, and advised the<br />\nmembers of the Congress, when speaking, to<br />\ntalk to the most remote of his audience, and<br />\nto catch their attention individually. He also<br />\nbrought forward the obligation which lies<br />\nupon every young man to take active interest<br />\nin public affairs, and pointed out the many<br />\nchances open to them to enter the public service. Dr. Gilman was suffering from a severe<br />\ncold and made his address only by great effort. He was listened to with great interest,<br />\nand heartily applauded. Messrs. Fitzgerald<br />\nand Knapp were appointed to escort him to<br />\nhis office. The meeting then adjourned.<br />\nTHE CUBAN QUESTION.<br />\nEach meeting of the Senate is an improvement on the previous one. Last Wednesday<br />\nthe presence of President Gilman and Dean<br />\nGriffin lent a dignity to the session, which did<br />\nnot result in stage fright among the speakers,<br />\nbut, on the contrary, seemed to inspire them to<br />\ndebate more forcibly and fluently. Indeed, so<br />\nwell was the subject handled that Senator Ballard, when called upon in the open debate,<br />\nfound he could add nothing to what had already been said, which was somewhat surprising. The subject was: \"Should the United<br />\nStates intervene in behalf of Cuba?\" Senators<br />\nClarke, Seth and Fender made good arguments for Cuba, and Senators Stearns and<br />\nHammond defended the negative side of the<br />\nquestion. Senator Ulman was absent. Senator Clarke's speech was the feature of the de(Continued on Page 8.)<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n4<br />\n<br />\nZhe petugiattter.<br />\nPublished Portnightly_during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br />\n<br />\nDECEMBER 10, 1897.<br />\nSubscription Si.so per year.<br />\nEditor in Chief,<br />\nAssistant Editor in Chiet,<br />\nConsulting Editors, -<br />\n<br />\nstudent alone could afford. This plan is peculiarly applicable to the Medical School, where<br />\nthe course is the same for all.<br />\nMUSICAL ASSOCIATION.<br />\n<br />\n15 cents a single copy.<br />\n<br />\nEDGEWORTH SMITH,'98.<br />\n- ALBERT C. DIEFFENBACH,'98.<br />\nProf. KIRBY P. SMITH.<br />\nGO.C. MORRISON,'90•<br />\n<br />\nDEPARTMENT EDITORS.<br />\nG. L. P. RADCLIFFE, 1.<br />\nGraduates.<br />\nC. K. EDMUNDS,<br />\nW.T. LONGCOPE, Medical School.<br />\nY. A. RENOUF,'98.<br />\nR. D. MILLER,'98.<br />\nJ. C. FRENCH,'99.<br />\nJ. H. KING, '9q.<br />\nB. A. SPILMAN, 99.<br />\nBusiness Manager,<br />\nR. H.GRIMES,'99.<br />\nAddress all articles, communications, etc. to EDGEWORTH<br />\nSMITH. box 707, Johns Hopkins University. Baltimore. Md.<br />\nSubscriptions and business communications must be sent<br />\nto R. H.GRIMES, box 23', .H. U•; or box 398, Medical School<br />\nof Johns Hopkins Hospital.<br />\n<br />\nThe new Musical Association which is being started for members of the University and<br />\nfor their wives promises to be very successful<br />\nand to occupy a much-needed place in the University. There is an unusual number of music<br />\nlovers and musicians at the University, but<br />\nthey have never before been gathered into<br />\nany organization. The Association, besides<br />\nencouraging music at the University, will, to<br />\na great degree, serve as a social organization.<br />\nRefreshments will be served after each meeting, and the members of the University will be<br />\ngiven an opportunity to become better acquainted. The dues of the Association are<br />\nonly nominal and the membership, which is<br />\nlimited in number to 250, will be composed of<br />\nmembers of the University and their wives.<br />\n<br />\nThe plan, as suggested by THE NEWS-LET.<br />\nFUN WITH FRESHMEN.<br />\nTER, of having common college halls through<br />\nthe cooperation of the students, seems to have<br />\nA pad of scribbling paper, having intermebeen already in vogue on a small scale at the<br />\ndiate report blanks on the reverse side, was<br />\nMedical School. To have one's own house<br />\nput on the desk in McCoy Hall basement a few<br />\nand to live in the immediate neighborhood of<br />\ndays ago. These blanks suggested great posthe Medical School is a privilege granted to sibilities<br />\nto sundry mirth-loving students.<br />\nfew of its members. But four of its students—<br />\nThey at once put their ideas into effect, and the<br />\nMiss Simmers and Miss Long of the first year,<br />\nnext morning a number of freshmen received<br />\nand Miss Reed and Miss Austin of the second<br />\nreports announcing that they had failed in<br />\nyear—have accomplished this in a manner at<br />\nsome course and insisting on an improvement<br />\nonce both comfortable and practical, and the<br />\nin their future work. All the recipients of<br />\nplan, as adopted by them, of having common<br />\n-these notifications were greatly alarmed ;<br />\nlodgings and personal management, ought to<br />\nsome of them carried their troubles to the<br />\nfind many imitators. The advantages are<br />\nRegistrar, and only then learned that they had<br />\nobvious. Apart from the reduction in expense,<br />\nfallen victims to a hoax.<br />\nthere is the absence of interruption, annoyance and uncongenial associations incident to<br />\nlife in even the best of \"boarding\" houses,<br />\nRAH FOR BLACK AND BLUE..<br />\nand the added zest which those engaged in a<br />\nIt was all started by a couple of fair Medical<br />\ncommon purpose must always impart to each<br />\nSchool \"co-eds,\" dressed one in black, the<br />\nother. It is also possible to form a library of other in blue, who were going to Dr.<br />\nBrooks'<br />\nthe books needed in the course, thus greatly lecture last Wednesday. They<br />\ninquired the<br />\ndecreasing the individual expense and increas- way of \"Billy\" Stewart, and \"Billy<br />\n\" galing the number of books far above what each lantly undertook to escort them<br />\nto their desti-<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nnation. The Black and Blue caught the eyes<br />\nof a group of students, who at once raised a<br />\ncheer for the 'Varsity colors. Then followed a<br />\n\"Te-hee, Te-ha\" for \"Billy\" Stewart ; then<br />\nanother for the \"Meds.\" By this time quite<br />\na crowd of students had gathered. Someone<br />\nstruck up : \"Here's to J. H. U.\" All joined<br />\nin, and the cheering and singing continued for<br />\nsome time and was renewed several times during the day.<br />\nPROFESSORS PATTON AND SCHrlIDT.<br />\n<br />\nThe authorities of the University are fortunate enough to be able to announce that Professor Erich Schmidt, of the University of<br />\nBerlin, has consented to deliver the Percy<br />\nTurnbull memorial lectures in the session of<br />\n1898-99. The lectures will be given in German, and the subject will be \"Goethe.\" Professor Schmidt is one of the most distinguished scholars in Germany, and as a lecturer he is said to be quite as remarkable as M.<br />\nBrunetiere, who gave the last course of Turnbull lectures.<br />\nPresident Patton, of Princeton University,<br />\nhas accepted an invitation to deliver the Levering lectures for the current year. The lectures<br />\nwill be three in number and will be given about<br />\nthe first of February. The subject will be announced later.<br />\nY. M. C. A. AFFAIRS.<br />\n<br />\n5<br />\n<br />\nment of the work, and in a measure take the<br />\nplace of a college secretary in States, like<br />\nMaryland, not large enough to support one.<br />\nThe party consisted of Morris L. Barr, the<br />\ngeneral secretary ; C. W. Ottley, of the Medical School, and S. S. Kingsbury, of the<br />\ngraduate classical department.<br />\nNEWS NOTES.<br />\n<br />\nCandidates for the Glee Club are being tried<br />\nthis week at the Alpha Delta Phi Fraternity<br />\nhouse. Only a few of the new candidates have<br />\nbeen taken so far, but nearly all the members<br />\nof last year's club are trying again this year.<br />\nThe Banjo and Mandolin Clubs have begun<br />\nregular practice ; the latter club is larger than<br />\never before, while nearly all the members of<br />\nthe Banjo Club having played together for<br />\nthree years, it is expected that that organization will be better this year than since the<br />\nsplendid club of '94-95. J. G. Peters, '98, is<br />\nagain leader of both clubs.<br />\nA meeting of the class of 1900 was held<br />\nWednesday, December 1. The awards of the<br />\noffices of class historian, poet and artist were<br />\nmade. Herbert Kaufman was successful for<br />\nthe offices of historian and artist, and Edward<br />\nP. Hyde for poet. The offices were awarded<br />\nby competition. Roland T. Abercrombie was<br />\nelected delegate to the new Athletic Association.<br />\n<br />\nThe fourth regular meeting of the class of<br />\nAt the regular meeting of the Y. M. C. A.<br />\nTuesday, November 30, Mr. Rokuro Naka- '99 was held Wednesday, December 1. Deleseko spoke of the difficulties presented by gates to the new Athletic Association were<br />\nJapan to missionary effort. One of these is elected, G. Canby Robinson and George<br />\nthe natural prejudice of the Japanese against Knapp. Eddy B. Fosnocht was elected class<br />\nforeigners, increased by the fact that Russia historian. The meeting was very well athas attempted to use the influence of mission- tended.<br />\naries for political purposes. Another is the<br />\nA feature of the annual banquet of the<br />\nfact that Christian nations forced the opium<br />\ntraffic upon the unwilling Chinese, a matter Chamber of Commerce in New York, November 23, was the response to the toast, \"Comwhich the Japanese have not forgotten.<br />\nA deputation from the Hopkins Associa- merce, the Child of Science and Its Filial Suption recently made a trip to St. John's College porter,\" by President Gilman. Science of Deto visit the Y. M. C. A. there. These visits are cember 3 devoted more than a page and a half<br />\nmade for the exchange of ideas and encourage- to President Gilman's address.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n6<br />\n<br />\nATHLETICS.<br />\nBASEBALL<br />\n<br />\nCaptain Clarke, in an interview, has the following to say on 'varsity baseball:<br />\nNow that the football season is nearly over,<br />\nHopkins men are beginning to ask what are<br />\nour prospects of having a good baseball team.<br />\nWhat chance have we of winning the championship of the State? In previous years this<br />\nquestion has invariably been asked and has as<br />\noften received the answer : \"Fine,\" only to<br />\nbe made ridiculous later on by a long string of<br />\ndefeats. Therefore, with these experiences in<br />\nmind, we prefer to waive a direct answer to<br />\nyour question, and trust that time and the<br />\ncourse of events will give you ample compensation for your waiting.<br />\nAlthough we are not predicting success, we<br />\nare, nevertheless, not without strong hopes<br />\nthat, by hard work and consistent training, we<br />\nmay bring the 1898 championship to adorn the<br />\nwalls of our new gymnasium. This brings up<br />\nthe question : Will the baseball team really<br />\ntrain ? If so, what method will be pursued?<br />\nWe answer : Yes, they must train.<br />\nWhy<br />\nshouldn't they ? Other college teams feel the<br />\nnecessity of training, and Hopkins men,<br />\nsurely, can't afford to neglect it. This statement hardly needs further explanation, for all<br />\nof us know that a team, no matter how good<br />\nits players may be individually, cannot hope to<br />\ncompete successfully with its opponents, unless it has acquired that perfection of team<br />\nplay which comes only by hard and constant<br />\npractice.<br />\nLet no man imagine that the team has already been \"picked,\" for positively no \"sifting\" of material will take place before we<br />\nshall have had outdoor practice. Let every<br />\nstudent who plays ball hand in his name to<br />\nManager Haulenbeek, for even if he shouldn't<br />\n\"make the 'Varsity,\" he may \"make the<br />\nscrub\" which will be organized to give the<br />\nfirst team at least one practice game a week.<br />\nSeveral promising candidates have already<br />\nappeared, among whom are: Haulenbeek,<br />\nWight, Joyner, Hitzrot, Rogers, Foster,<br />\n<br />\nFletcher, Wirt, Rickey, Grimes, Talty, Everett, Swaine, Warren and others. Now that<br />\nwe are to have our cage, and consequently<br />\ncan arrange an hour and place suitable to the<br />\nMedical men for practice, we expect to get out<br />\nsome of the fine material always to be found<br />\nat the Medical School.<br />\nBut the success of any team depends on the<br />\nencouragement and support given it by the<br />\nstudents, and, realizing this, we ask only for<br />\nan honest trial before condemnation.<br />\nATHLETIC ASSOCIATION.<br />\n<br />\nThe Athletic Association held its first meeting yesterday afternoon in Hopkins Hall. Officers were elected as follows:<br />\nPresident—Professor Edward A. Renouf.<br />\nVice-President—Wm. H. Maddren (Medical School).<br />\nSecretary—Frank J. Clunet ('98).<br />\nTreasurer—Dr. J. Bascom Crenshaw.<br />\nThe other delegates are : Robert Garrett,<br />\nG. Canby Robinson and George W.Knapp,Jr.<br />\nA 'Varsity handball team,consisting of Wm.<br />\nH. Maddren and Ward Simmons, was recognized by the Athletic Association. During the<br />\nholidays these men will represent Hopkins in<br />\na contest with the Polytechnic team of Brooklyn. It is Hopkins' first move in this sport,<br />\nand the start is a very auspicious one.<br />\nThe proposed formation of a new lacrosse<br />\nassociation by Harvard, Yale, Pennsylvania<br />\nand Cornell, in the face of a strongly organized<br />\nassociation in existence at present, was also<br />\nsettled. The Hopkins will prevent this by<br />\njoining the Inter-collegiate Athletic Association, thereby completing, with Lehigh and<br />\nStevens, a deal for full and official recognition<br />\nas the only lacrosse association.<br />\nIt was decided that a house committee<br />\nwould have charge of the new gymnasium<br />\nwhen completed. One graduate, two seniors,<br />\none junior and one freshman will compose the<br />\ncommittee, with the consent of the faculty.<br />\nHOCKEY.<br />\n<br />\nThe Hockey League is at present in a state<br />\nof uncertainty. At the last meeting of the<br />\nBoard of Delegates a dispute arose in regard<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nto the admission of the Maryland Hockey<br />\nTeam into the League, and the percentage of<br />\ngate receipts to be allowed the team. All the<br />\nteams represented voted against admitting the<br />\nMarylands, and against lowering the percentage from ten to five per cent. Manager Towers, of the rink, took the other side, however,<br />\nand the meeting ended in a disagreement.<br />\nUntil there is a mutual agreement between the<br />\nrink management and the various teams and<br />\nplayers, there will hardly be any city championship games. The rink is making arrangements for outside teams to play the Maryland<br />\nHockey Team,but, as these teams are brought<br />\non at a great expense in most instances, there<br />\nwill be very little profit by such action. Unless there are well-contested local games, it is<br />\nalmost safe to say that there will be very little<br />\ninterest taken in visiting teams.<br />\nIt is hoped that an early solution to the<br />\nproblem will be brought forward and amicable relations cemented among the contending<br />\nparties.<br />\nLACROSSE.<br />\n<br />\nA dispatch from Cambridge, stating that the<br />\nmanager of the Harvard lacrosse team has<br />\nopened negotiations with the lacrosse authorities at Yale, Columbia, Cornell and the University of Pennsylvania, informs us of the revival of lacrosse among the Northern colleges.<br />\nTwo years ago Harvard played Hopkins to<br />\na tie. There was a time when Cornell and<br />\nPrinceton had first-class tennis, but during the<br />\npast few years little or no interest has been<br />\ntaken in lacrosse at these institutions.<br />\nIt would be of great advantage to all if these<br />\ncolleges, which contemplate reviving lacrosse, would apply for membership to the<br />\nInter-Collegiate Lacrosse Association, which<br />\nis composed of Hopkins, Lehigh and Stevens.<br />\nAmple provision is to be made in the new<br />\ncage for the track team. Next the walls a cinder track is to be laid out, and banked at all the<br />\ncurves. It will be an eighteen-lap track. Here<br />\nthe team can train at all times and in all weath-<br />\n<br />\n7<br />\n<br />\ners. Dr. Shattuck, assistant in geology, has<br />\noffered to coach the men, and Mr. MacDermott will probably be with us as well.<br />\nThe records recently made by Robert Garrett under J. H. U. colors in outdoor broad<br />\njump and throwing the discus and indoor 16pound-shot-put have been adopted by the<br />\nMaryland Board of Records.<br />\nA WORD OF WIT.<br />\nWHO KNOWS?<br />\n<br />\n\"No, gentlemen,\" said the professor,\"I insist that nosology is not the study of noses.\"<br />\nHAD COMPANY.<br />\n<br />\nVisitor: Who is the gentleman sitting near<br />\nthe professor ?<br />\nMr. Bretzelesser (student): Ach I dot is his—<br />\nhis—accomplice.<br />\nWhen lips are cherry-red,<br />\nWhen eyes are blue—<br />\n\"Visions of loveliness,\"<br />\nI think, don't you?<br />\nWhen eyes are cherry-red,<br />\nAnd lips are blue—<br />\n\"Someone's been on a bat,\"<br />\nI think, don't you?<br />\n—Columbia Morningside.<br />\n1. He who knows not, and knows not he<br />\nknows not—he is a Freshman. Shun him.<br />\n2. He who knows not, and knows be knows<br />\nnot—he is a Sophomore. Honor him.<br />\n3. He who knows and knows not he knows<br />\n—he is a Junior. Pity him.<br />\n4. He who knows and knows he knows—<br />\nhe is a Senior. Reverence him.—Exchange.<br />\nFirst Farmer: How's your boy doing in<br />\ncollege?<br />\nSecond Farmer: Splendid ! Getting high<br />\nmarks I First time he came home he had a<br />\npin with '99 on it.—College Index.<br />\nThese college men are very slow,<br />\nThey seem to take their ease ;<br />\nFor even when they graduate,<br />\nThey do so by degrees.<br />\n—University Herald.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n(Continued from Page 3.)<br />\n<br />\nbate. He spoke very rapidly, yet distinctly and<br />\nprecisely, and was heartily applauded. Senators Stearns and Hammond also did well. In<br />\nthe open debate Senators R. D. Miller and<br />\nYoung took part.<br />\nPresident Gilman, in a two-minute talk recommended that the members attend a session<br />\nof the National Congress in Washington to<br />\ngain points in parliamentary practice and debating. He also congratulated the Senators<br />\nupon their work, and promised to have a clock<br />\non the wall of the Senate Chamber in time for<br />\nthe next meeting.<br />\nSenator Bestor read several reports from<br />\nother colleges where forensic oratory has been<br />\ntried. Their tone, on the whole, was not encouraging. The Congress at Johns Hopkins<br />\nis now a successful reality. It has been suggested that the reason of this is that the conduct of the Congress is happily in charge of<br />\nfaculty and students. In this respect it differs<br />\nfrom the ordinary course, and gives the advantages of a debating society, combined with the<br />\nvalued advice of an experienced instructor.<br />\nThe subject for debate for the next session<br />\nis : \"Resolved, That capital punishment be<br />\nabolished.\" Senators Dohme, C. Hodges and<br />\nHubner, affirmative, and Senators Robinson,<br />\nF. W. Smith and Gordon, negative.<br />\nThe fourth regular meeting of the House of<br />\nRepresentatives was held Wednesday, November 24. The debate, \"Resolved, That the<br />\nUnited States should intervene in the case of<br />\nCuba,\" was very spirited, and showed careful<br />\npreparation on the part of the debaters. That<br />\nthe debaters spoke with hardly any reference<br />\nto their notes was very gratifying, and added<br />\nmuch to the interest of the debate. The negative side, which consisted of Congressmen<br />\nGuggenheimer, Ross and Fischer, won the debate. The Censor, in his criticism, complimented the negative side on their earnest work<br />\nin preparation for the dabate. Congressman<br />\nFischer, he said, was very witty and effective<br />\nin his arguments. The affirmative side was<br />\nsomewhat handicapped by the absence of one<br />\nof their regular debaters. Congressman Lev-<br />\n<br />\nering was asked to fill the vacancy. The subject for debate at the next regular meeting of<br />\nthe House will be : \"Resolved, That capital<br />\npunishment should be abolished.\" The debaters will be : Affirmative — Congressmen<br />\nRemsen, Keidel and Welber. Negative—Congressmen Murkland, Davidson and Krager.<br />\nThe House was favored with the presence of<br />\nDr. Greene and Dr. Vincent.<br />\n11EDICAL SCHOOL NEWS.<br />\n<br />\nDr. L. F. Barke held his first quiz in histology on Friday, December 3, which will be followed by one on each succeeding Friday<br />\nthroughout the course. These quizzes are so<br />\noriginal and interesting that the students look<br />\nforward to them with more pleasure than fear.<br />\nThe quizzes in anatomy will be conducted this<br />\nyear by Drs. Mall, Lord and Harrison.<br />\nIt is to be hoped that the smoker which the<br />\nfirst-year class had prepared to have some<br />\nweeks ago, has not been permanently postponed. By this informal means the studeatt<br />\nwould meet and know each other, which, otherwise, may not be accomplished for some<br />\ntime, owing to the unusual size of the class.<br />\nArrangements for smokers should be made<br />\nas soon as possible, for before long everyone<br />\nwill be so busy that the interest for its success<br />\nwill be subordinate.<br />\nCLASS rIEETINOS.<br />\n<br />\nThe class of '98 met on Wednesday and<br />\nelected Messrs. Clunet and F. W.Smith members of the Board of Directors of the Athletic<br />\nAssociation. President Fitzgerald also announced the executive committee, which consists of the President, ex-officio, and Messrs.<br />\nSeth, Clunet, Dieffenbach, Hodges, Harwood<br />\nand Scholl.<br />\nThe class of i9oo met on Wednesday to<br />\ndiscuss class pins. They also voted an appropriation of $2o for representation in The Hullabaloo.<br />\n<br />\n\fThe Bo'Latin SGhool,<br />\n<br />\nTelephone Call 18:2,<br />\n<br />\nEstablished 1880.<br />\n<br />\nARTHUR F. LAWRENCE & CO.<br />\n<br />\n870 LINDEN AVENUE,<br />\n<br />\nLeading Dealers in<br />\n<br />\nJ. A. DUNHAM, A. H., Henri Mnster.<br />\n<br />\nThis school has a continuous history of over fifty years .<br />\nIt was reorganized under its present management<br />\nm 1894. •<br />\n<br />\nCOAL and WOOD<br />\nCENTRAL OFFICE,<br />\n<br />\n6 W. SARATOGA STREET,<br />\nY. M. C<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nA. BUILDING,<br />\n<br />\nSAVINGS DEPARTMENT<br />\n<br />\nCAPITAL, $100.000.<br />\n<br />\nWarpland CDle Insurance and Crust Co.<br />\nEQUITABLE BUILDING, BALTIMORE.<br />\nTELEPHONE 1376.<br />\nT. K. WORTHINGTON, JESSE HILLES,<br />\nL. M. DUVALL,<br />\nSec'y-Treas.<br />\nVice-President.<br />\nPresident.<br />\n<br />\nEXAMINES AND INSURES TITLES TO REAL AND<br />\nLEASEHOLD PROPERTY.<br />\nMoney to Loan on Mortgage (no commissions). Mortgages<br />\nand Ground Rents for Sale. Conveyancing.<br />\nDIRECTORS:<br />\nJohn A. Whitridge,<br />\nEdgar G. Miller,<br />\nAlexander Brown,<br />\nThomas Hill,<br />\nJesse IliIles,<br />\nGeorge Whitelock,<br />\nE. II. Perkins,<br />\nC. C. Shrivei,<br />\nJacob I. Cohen,<br />\nM. Goldenberg,<br />\nT. K. Worthington.<br />\nRates for Title Insurance furnished on application.<br />\nThe President's message has gone its way,<br />\nBut we have a message for you to-day<br />\nThat means a saving of dollars galore,<br />\nProsperity's message to Baltimore. —Y. M. 11. 0. D.<br />\nA Christmas Present for all the Citizens of Baltimore.<br />\nNotice is hereby given that, beginning with to-day, we will<br />\ngive the citizens of Baltimore an exceptional chance to treat<br />\nthemselves to a Winter Suit of Clothes—such a chance as has<br />\nnot been afforded the public in many and many a day.<br />\nCommencing to-day we will sell all our Fancy Cheviot Suits which<br />\nwere manufactured and marked to sell at$15 and $18,forel 1<br />\n4<br />\nh ish<br />\nT<br />\nmeans a great deal to the suit-wanting public. It RI i•L<br />\nmeans an absolute, positive bargain, such as is seldom offered in<br />\nthis or any other city. It means a saving to you of several dollars,<br />\nwhich you'll find so much use for these days, and it means a Suit of<br />\nClothes of superior quality and splendid workmanship.<br />\nDescription.—These suits are of Cheviot, manufactured In the<br />\nbest American mills. They are made up in Single and DoubleBreasted Sacks, as suits your fancy. The linings are of Italian Serge<br />\nand some of Cassimere, with Satin Yokes. The qutton holes are<br />\nhand-fade, and the utmost attention has been paid to every detail.<br />\nThe patterns are plaids of the very latest designs—mixed goods,<br />\nhandsome looking effects—and cheeks of the ultra-fashionable kind.<br />\nEvery suit in the entire lot was made to sell at nothing less than $15,<br />\nand many of them were never intended to sell for less than $18.<br />\nOur price for your choice is<br />\n<br />\n$11.75.<br />\nIt<br />\nis the Merry Christmas Time. Makeyourself happy by taking<br />\nadvantage of<br />\nstilts are guarantee()<br />\nthis exceptional bargain. These<br />\ngoods. Ifyou aren't satisfied you get your money back. The sale<br />\nbegins to-day.<br />\n<br />\nHAMBURGERS',<br />\nBaltimore and Howard Sta.<br />\nGeo. L. Harrison,<br />\nPresident.<br />\n<br />\nGeo. P. Mordecai,<br />\nVice-President.<br />\n<br />\nCOMMONWEALTH BANK,<br />\nEUTAW ST., FACING MADISON.<br />\nJOHN It. HOOPER<br />\nGEO. YAKEL,<br />\nJAS. It. WHEELER,<br />\nVice-Prest.<br />\nCashier.<br />\nPresident.<br />\n-DIRECTORS.<br />\nLouis Yakel,<br />\nJefferson J. Walsh ,<br />\nJohn N. Matthews,<br />\nJordan Stabler,<br />\nDr. T. A. Ashby, George A. Blake.<br />\nJames It. Wheeler,<br />\nRobert Biggs,<br />\nJesse F. Ely.<br />\nJames If. Preston,<br />\nMurray Vandiver,<br />\nJ. K. Ober,<br />\nYakel.<br />\nGeorge<br />\nValiant,<br />\n0.<br />\nJos;<br />\nOuld,<br />\nH.<br />\nM.<br />\nLarge or small sums, for long or short periods, received on favorable<br />\nterms. Call at the Bank for information.<br />\n<br />\nGIFFORD de JERSEY MESNY,<br />\nArtist Photographer,<br />\n226 NORTH CHARLES STREET.<br />\n<br />\nBuy your<br />\n<br />\nCIGARS, CIGARETTES AND SMOKING TOBACCO from<br />\n<br />\n..1-15FILD &<br />\n639 NORTH EUTAW ST., NEXT Doe R TO HOPKINS<br />\nWe carry a full line of Stationery,<br />\n<br />\nUNIVERSITY<br />\n<br />\nalso New York and Baltimore Daily and Sunday Papers.<br />\nGivii US A CALI..<br />\nGENT'S<br />\nFINE FURNISHINGS.<br />\n<br />\nas<br />\n<br />\nhe Eutaw<br />\nA. WAGNER,<br />\n<br />\nLADIES'<br />\nFINE FURNISHINGS.<br />\nReduced Prices to suit the times<br />\nAT L. LAr1BLIRU'S<br />\n511 N. HOWARD STREET.<br />\nBALTIMORE, MD.<br />\n<br />\nflerchant Tailor.<br />\nSuits made to Order as Cheap as<br />\nReady-made Clothing.<br />\n<br />\nRepairing of any description at<br />\nReduced Prices,<br />\nSuits Pressed While You Wait.<br />\n15c.<br />\nPants Pressed.<br />\n50c.<br />\nSuits Pressed<br />\nSuits Cleaned<br />\nWork called for and delivered.<br />\n<br />\nArthur H. Hall,<br />\nSec'y and Tree.<br />\n<br />\nSISCO BROS<br />\n<br />\nThe A.G. Alford Sporting Goods Co.<br />\n<br />\n13411111C1'S $ 218 N. Charles Street,<br />\nFOOT-BALL AND HOCKEY SUPPLIES.<br />\n120 E. BALTIMORE STREET.<br />\n<br />\nBALTIMORE,Dim<br />\n<br />\nTelephone 2573.<br />\n<br />\n1%0.9es<br />\nsAmuu.HuNfs SONS<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nReduction in Prices.<br />\n<br />\n2.6E.BA1TIM01lE 51.<br />\n<br />\nNew i•<br />\nMUsic<br />\nStore 4'<br />\n<br />\nDISCOUNTS to<br />\nmen lion ing th is advertisement.<br />\n<br />\nISIPECIAL<br />\n<br />\nFIOrisi<br />\n<br />\nStudents<br />\n<br />\n95<br />\n<br />\nI. SON COHEN,<br />\n521 N. EUTAW ST.<br />\n<br />\n•<br />\n<br />\nArtistic Floral Arrangements.<br />\nChoice Cut Flowers,<br />\n<br />\nES<br />\nLOrowVnorms<br />\n<br />\n322 WEST SARATOGA ST.,<br />\n<br />\nNEAR EUTAW.<br />\n<br />\nNEAR EUTAW.<br />\n<br />\nMerchant Tailors,<br />\n<br />\nNo. 205 E. FAYETTE STREET.<br />\nTHE<br />\n<br />\nNEW<br />\n<br />\nPOST OFFICE-<br />\n<br />\nBALTIMORE.<br />\n<br />\nWe will insure the finest workmanship and styles in Tailoring as<br />\n<br />\nalso well-fitting garments.<br />\nThe latest varieties of goods always on hand.<br />\n<br />\n•<br />\n•<br />\n•<br />\n<br />\nPOOL PARLOR,<br />\n<br />\nRepairing. Sundries. Bicycles For Hire 25 cents per hour.<br />\n<br />\nSpecial rates to Students.<br />\nNicely furnished rooms for Students.<br />\n<br />\nBALTIMORE.<br />\n<br />\nLucke & Sons,<br />\n<br />\n81.25 London Tan Gloves<br />\nreduced to 95 eta.<br />\nSee if you can match them<br />\nfor 511.25.<br />\n<br />\nMadison Cycle<br />\n3i5 Madison St.<br />\n<br />\nMRS, OTTO SCHULER,<br />\n<br />\noPPosuTr<br />\n<br />\nThe only ho us- e keeping<br />\nGloves in re pair, for two<br />\nmonths free of charge, and<br />\nif not satisfactory at expiration of this time it new<br />\npair given in exchange.<br />\n<br />\nA few doors !South of Johns Hopkins University. •<br />\n<br />\nFine Goods at<br />\nMBROSE 8:PERRY,<br />\nPopular Prices.<br />\n... Merchant Tailors ...<br />\n224<br />\n<br />\nW. Fayette Street, near Howard,<br />\nBALTIrlORE, MD.<br />\n<br />\n\fBARTHOLOMAY BREWERY Co.<br />\n<br />\nJNO. HEINZERLING.<br />\n<br />\nW. J. WICKHAM<br />\n<br />\nH EINZER LI NG<br />\n<br />\nMai ROCHESTER, N. Y.<br />\n<br />\n& co.<br />\nOffice &Factory,<br />\n<br />\nBohemian<br />\nBavarian<br />\nMaerzen<br />\nApollo ot<br />\n<br />\neat<br />\ntat<br />\n<br />\nOur<br />\nSpecialties:<br />\n<br />\neat<br />\n<br />\n2I8-zzz W. Conway St.<br />\n<br />\nCHALLENGE GINGER ALE<br />\nCLUB GINGER ALE<br />\nCHAMPAGNE CIDER (ExtraDry)<br />\nSPARKLING KOLAFRA .<br />\n<br />\n'pHONE • • •<br />\netersomrtme........-204<br />\n<br />\n1060—Telephone-2060<br />\n<br />\nBALTIMORE BRANCH:<br />\n<br />\nOffice and Depot, - 227-239 S. Central Ave.<br />\nGEO. C. SUCRO, MANAGER.<br />\n<br />\nMandolins<br />\nGuitars • •<br />\nBanjos • • •<br />\n<br />\nir Washburn<br />\n<br />\nare recommended<br />\nby the highest musical authorities<br />\nall over the world.<br />\n<br />\nH. R. EISENBRANDT SONS,<br />\n<br />\niwgCaZ'si.7..1C-XN=XYlantra(EiracHsamt<br />\n<br />\nSOLE. AGENTS.<br />\n<br />\na Month.<br />\nPianos $5 Low<br />\nPrices<br />\nEasiest Terms.<br />\n<br />\nN. E. Corner<br />\n<br />\nCHARLES AND LEXINGTON STS.<br />\n<br />\nTHEO. WARNER.<br />\n<br />\nSEND 60P IN STAMPS ACTUAL COST OF MAILING AND GET ONE<br />\nTHE CHLORIDE oFSILVER DRY CELL BATTERYCO.<br />\nBALT! MORE, MD. U.S.A.<br />\n<br />\nJAMES R. PAIN1.<br />\n<br />\nwrARNER &<br />\nCO.<br />\n<br />\nY.A.IMUMM,71,1,:ilEVEV,1:<br />\n<br />\nMANIU:AOTURERS OF<br />\n<br />\nCANES,&e. • •<br />\n<br />\nbeinerSt<br />\n<br />\n2-1 W.<br />\n<br />\n.21.2:..11:2•11v1'.2.)M.=<br />\n<br />\nAgents for Walter Barnard London Hats.<br />\n<br />\nSilk and<br />\n<br />\nnere Hats.<br />\n<br />\nBALTIMORE, MO.<br />\n<br />\nWe Sell or Rent all makes of Typewriters<br />\nat Lowest Prices.<br />\nTypewriter Supplies and 4<br />\n1- Standard Machines<br />\nMimeograph Work.<br />\nrented at $1 per VV,.7.0IC<br />\n<br />\nTYPEWRITER INSPECTION & SUPPLY CO,<br />\nPrice<br />\n<br />\n15 NORTH STREET.<br />\n<br />\nInnovation 1 Cash Consideration<br />\n<br />\n25 per cent. off each sale from this date. Our<br />\nimmense stock of Imported Woolens must<br />\nbe closed out by December 31st to accomplish important changes for our spring purchases.<br />\nIN°. M. KEELER,<br />\nM.,ker of Men's Garments.<br />\n<br />\n6 N. CALVERT ST.. Opp. P. 0.<br />\n<br />\nThe Chas. Willms Surgical Instrument Co.<br />\nrime .SURGIC.AL INSTINMENTS,<br />\nBENJ. A. NKLSON,<br />\n<br />\nMaintio.r.<br />\n<br />\nManufacturers<br />\nand Importers of<br />\nPhysicians', Surgeons', Hospital and Invalid Supplies,<br />\nManic Hosiery, Trusses, Rubber Goods,cte.<br />\n<br />\n300 N. HOWARD ST., - BALTIMORE, MD.<br />\nTELEPHONE<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO<br />\nCABIN PASSAGE AT LOW RATES.<br />\nA. SCHUMACHER & CO,<br />\nFor particulars apply to<br />\nGeneral Agents.<br />\n<br />\n771.<br />\n<br />\n4<br />\n'<br />\n4 NEW YORK TO BREMEN,<br />\nLONDON, PARIS, GIBRALTAR,<br />\nIr NAPLES, GENOA, ETC.<br />\n46 BALTIMORE TO BREMEN ....<br />\nDIRECT.<br />\n<br />\nevery description.. .<br />\nBuildiug Ilardwire ofWood<br />\nMantels and<br />\n<br />\ning. Rolling Partitions, for dividing Sunday-School<br />\nrooms. Corbin's Door Check and Spring, to prevent<br />\ndoors from slamming. Electric Bells, Locksmithing,<br />\nKeys Fitted.<br />\n<br />\nF. 11. DAVIDSON & C2.<br />\n<br />\n509 W. Franklin Stmet,<br />\n<br />\nBaltimore, Md.<br />\n<br />\nTelephone 2095.<br />\n<br />\nATLANTIC TRiocNSPOU LINE.<br />\nExcellent accommodations for at limited<br />\nnumber of First-Class Passengers from<br />\nNew York to London at reasonable rates.<br />\n<br />\nBaltimore Storage & Lighterage Co.,<br />\n403-409 WATER STREET,<br />\nBALTIMORE.<br />\n<br />\nPEABODY FIRE INSURANCE CO.<br />\n(Mice 415 Water Street,[Second St.]<br />\nAdjoining Custom Houseoic the West<br />\n<br />\nShort Insurance for a Day<br />\n. . or Longer Period.<br />\n<br />\nTHOMAS I. CAREY, Pres.<br />\n<br />\nBOARD OF DIRECTORS:<br />\n<br />\nJesse Tyson,<br />\nFrancis White,<br />\nRichard Cromwell,<br />\nRICHIRD B. P087,8ec'ty.<br />\n<br />\nA. J. Ulman,<br />\nFord. C. Latrobe,<br />\nJoshua 0. Harvey,<br />\nWilliam Harvey<br />\nHenry James,<br />\nJames W. Hates<br />\nAndrew D. Jones. GRIFFITH FEELEMBYER, 1st.<br />\n<br />\nNew York Shipping Co.,<br />\nBROADWAY,<br />\nNEW YORK.<br />\n<br />\nJOHN V. RUPPERT,<br />\nMEM CHANT TAILOR,<br />\n<br />\nNo. 617 N. EUTAW STREET, BALTIMORE, MD.<br />\nSuits to Order for $10.00 and upwards.<br />\nScouring, Altering and Repairing a Specialty,<br />\n<br />\nGUGGENIIEIMER, WEIL & Co.<br />\n<br />\nStudents'...<br />\nRequisites.<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol. II.<br /><br />\nt<br /><br />\nt 1 t<br /><br />\nDECEMBER 10th, 1897.<br /><br />\ntbe<br /><br />\nPublished by Students of<br />\nPress of<br />\nGuggenheimer, Well &amp; Co. 41<br /><br />\naft• THE JOHNS HOPKINS<br />\nit UNIVERSITY<br /><br />\n4... ISSUED<br /><br />\n11'14'1 BALTIMORE<br /><br />\net I 1'<br /><br />\nFORTNIGHTLY<br /><br />\nTHE UNIVERSITY SCHOOL 122R BOYS<br />\nW. S. MARSTON, A.13 anti C. R.<br />\nPrincipal.<br /><br />\n710 and<br /><br />\n712 Madison<br /><br />\nAve.<br /><br />\n51e018 SCIROOL prepare. boys for admitteloo to the Johns Hopkins or any University or<br />\nScientific School. It has fitted more the,. one hundred for the Johns Hopkins alone,<br />\nI so many for Harvard, Tate, Princotoo. the Mamotrhuaette Institute of Technology, the<br />\nTroy Polytechnic end other Collegea out Schoole, In October. 18W-95, two of the five<br />\nenholarshIps given at the Johns Ildipknin lotow tostrioulAtes, were awarded to Its pupil.. It<br />\nhes good lehoratory nod a well equipped EVelnest oil., which le ender the ch.rge of e<br />\ntont instructor. re, thru,,i1110rIllottion or for catalognee, wltlreaa the Principal, at No. lOil<br />\nN. Calvert Street..<br /><br />\nOakimore<br /><br />\nB. G. EICHELBERGER,<br />\nBOOKS fIND FINE STATIONBRY,<br />\n(1111•UED<br /><br />\nEVERY<br /><br />\n308 N. CHARLES ST.<br />\nV. A. O. A. ntniattsto.<br /><br />\nFRIDAY.)<br /><br />\nBaltimore, Md.<br /><br />\nThe Society Paper of Baltimore.<br /><br />\nThe professors and students of the Johns Hopkins<br />\nUniversity will find it to their advantage to examine<br />\nstock and make purchases from the following old<br />\nestablished house, Jordan Stabler, importer, jobber<br />\nand retailer of staple and fancy groceries, 701, 703 and<br />\n705 Madison avenue, cor. Eutaw St. Telephone 817.<br /><br />\nBRIGHT AND BREEZY.<br /><br />\nJUST<br />\nTWO THOUGHTS<br /><br />\nCushing g Company, 11<br /><br />\nBOOKSELLERS<br />\nSTATIONERS<br />\n34 WEST BALTIMORE STREET.<br /><br />\nINTERESTING TO GOOD DRESSERS.<br /><br />\nOur OVERCOATS<br /><br />\nThe TUXEDO<br /><br />\nSUIT<br /><br />\nare their own argument<br />\nfor warmth, wear and<br />\nstyle. Off-and-On easy<br />\nis our idea that helps<br />\nmake them popular.<br /><br />\nis comfort, style and service in cloth. We studied<br />\nto make them beautiful<br />\nand have succeeded.<br /><br />\nSCHOOL, LAW, MEDICAL, AND CLASSICAL AM&gt; miHORI.I.ANI,:tais HOOKS<br />\n:<br />\nKeep oonstantly on hand the Text Books need lo Johns Hopkins University, Johns Hopkina<br />\nHospital, And The Woman's College of Baltimore.<br />\nSTATIONEEY.—For School, Family, Oftlee Ind Bank.<br /><br />\nJohns Hopkins University.<br /><br />\nJOHN R. LEMMERT,<br />\n14 E. FAYETTE ST.<br />\nPHOTO plikP<br /><br />\nTAILOR<br /><br />\nEs<br />\niCs pp L.1<br /><br />\nAND<br /><br />\nAND<br /><br />\n/<br /><br />\nPROGRAMMES FOR 1897-98.<br /><br />\nDRAPER.<br /><br />\nCanaeras &amp;. Sueplies..<br /><br />\nTh_johns Hopkins_tTniversity_Circular containing announcements<br />\n. . of the Collegiate and Graduate courses offered for the aca. . demi( year beginning October ist, 1897, may be had on appli. . cation to the Registrar of the Johns Hopkins University.<br /><br />\nDeveloping<br />\nOe<br /><br />\nand<br /><br />\nec<br />\nte<br /><br />\nPrinting.<br /><br />\nTHE JOHNS HOPKINS MEDICAL SCHOOL.<br />\nof the johns Hopkins Medical School may also<br />\nhad on application to the Registrars._<br /><br />\nThe announcements<br /><br />\nTHE CUMMINS<br />\nPHOTO-STOCK CO,<br /><br />\n. . he<br /><br />\n106 N. Charles St.<br /><br />\nMAN DO L.I NS Are used exclusively by all the leading amateurs,<br />\nprofessionals and College Clubs, from Maine to<br />\nGU ITAIRS<br />\nCalifornia. ilAtr Only one grade, the BEST.<br />\nThe celebrated Griffith Blue End Strings for the Banjo, Mandolin and Guitar seldom snap.<br />\nSpecial discount to Students.<br />\nBuy direct from the manufacturers and save the middleman's profit.<br /><br />\nQRIFF1111<br /><br />\nMANUFACTURED SY<br /><br />\nTAILOR AND SHIRT MAKER,<br />\nN. E. oor. Lexington and. Liberty Ste.<br />\nr-r-N<br /><br />\nGents Underwear made to Order; also Dyeing, Scouring<br /><br />\nand<br /><br />\n'3UOIS 911110 HAD<br /><br />\nOVER DRUG STORE.<br /><br />\nD. E. WILLIAMS,<br /><br />\nFR ca<br /><br />\nF. H. GRIFFITH du CO.,<br /><br />\nFactory and Salesroom,<br /><br />\nMention this paper when you call or write.<br /><br />\n871 N. Howard St., Baltimore, Md.<br /><br />\nHENDERSON'S<br />\nUNIVERSITY<br />\nBOOK STORE<br /><br />\n. Text Books<br />\n. Note Books .<br />\nStudents' Supplies<br /><br />\nMadison &amp; Howard Sts.<br /><br />\nRepairing.<br /><br />\nYou Fairly Fly on-<br /><br />\na\"<br />\nSMPINPUIPUINIMM11<br />\n.<br />\n.<br />\n1 11<br /><br />\neating<br /><br />\nGrand\"<br /><br />\nIt's the Wheel of Wheels, with its<br />\nDouble Roller Chain-\"that curve\"<br />\nand many other \"365 days ahead<br />\nof all others \"--advantages.<br />\nDIAMOND WHEEL CO,, in N. Charles St.<br /><br />\nBaltimore Hardware Co., Baltimore &amp; Greene Sts.-Branch.<br /><br />\nthe lRewe /Letter.<br />\nVol. II.<br /><br />\nFortnightly<br /><br />\nTHE ACADEMIC POINT OF VIEW.<br />\nPractical men object to what they call \"the<br />\nacademic point of view,\" and object with so<br />\nmuch emphasis and persistency that there<br />\nmust be something more than a mere ignorant dislike at the bottom of their feeling in<br />\nthe matter. Indeed, I think that academic<br />\nmen once and again catch themselves entertaining the same feeling for a brief interval, if<br />\nthey stir much abroad in the world. An uneasy consciousness creeps in upon them that<br />\ntheir ordinary way of looking at things in the<br />\nlecture hall and in class-room discussions is a<br />\nvery much specialized way and seems always<br />\na little narrow and impractical when used in<br />\nthe midst of affairs. It may be, in its place, a<br />\nnecessary and useful way of looking at things,<br />\nand better suited than most to clarified reasoning ; but it involves standing at a peculiar<br />\npoint of view, hardly practicable for men outside the University; and, though we may<br />\nChoose to retain it, it is best that we should<br />\nunderstand just what it is and know how, by<br />\nkeeping it, we differ from the man of affairs.<br />\nIf a man of affairs were asked what it was<br />\nthat made him feel out of sympathy with university teachers and with the pupils who had<br />\nbeen most recently under their influence, he<br />\nwould probably say that practical men look at<br />\nthings as they are, but that university men prefer to look at things as they ought to be; and<br />\nthat, since things are not as they ought to be,<br />\nuniversity men usually fail to get practicable<br />\nopinions, for all their thinking. Some of this<br />\nthe university man must admit. He studies<br />\nfacts to get at principles, and when he has arrived at his principles he perceives that some<br />\nof the facts he has recorded and examined are<br />\nessential, while the rest are subsidiary and in<br />\na sense accidental — aside from the point.<br />\nThese latter he forthwith puts on one side and<br />\nproceeds to neglect, and builds his reasoning<br />\non the significant<br />\nand essential matters which<br />\nhe has sifted out.<br />\nHe has reached his \"aca-<br /><br />\nNo. 5<br /><br />\ndemic point of view,\" and has set his reasoning free from encumbrance. He has discovered how things would be if principles operated<br />\nsingly, simply, without mixture or confusion<br />\nof irrelevant things. However concrete his<br />\n.facts, they are selected facts, and he is reasoning in the abstract, looking at the gross world<br />\nin analysis, and not in combination.<br />\nThat is why the practical man regards him<br />\nwith uneasiness and charges him with dealing<br />\nin unrealities. The practical man knows that<br />\nin affairs things cannot be treated as simples :<br />\nfacts cannot be selected. Logically irrelevant<br />\ncircumstances may in actual life have as much<br />\nimportance as circumstances which are of the<br />\nessence of the business in hand, and, however<br />\nmuch you may wish to sift the pertinent from<br />\nthe impertinent, you cannot do it. They are,<br />\nin fact, inseparable, and you must deal with<br />\nthem in the bulk, not according to their quality, but according to their gross weight and<br />\nquantity. You are apt to be rendered incapable of dealing with actual life, the practical man<br />\nbelieves, by dealing so much with your own<br />\nabstract and partial analysis of it. You may<br />\nhave a perfectly developed logical faculty, and<br />\nyet no practical sagacity whatever : your practice in abstract reasoning may even tend to destroy your native sense of what is wise and<br />\npracticable, for it may render you impatient<br />\nwith makeshift and management, your only<br />\nmeans of success. The new-fledged college<br />\ngraduate always wants to \"turn the world upside down,\" older men complain, and that very<br />\ndesire proves his unwise training.<br />\nThere is something in these objections that<br />\ncollege men ought to heed. We should not<br />\ngive up abstract reasoning or stop subjecting<br />\nfacts to a careful differentiation and sifting.<br />\nWe must continue to separate facts and to<br />\nclassify them, to purge away their accidental<br />\nelements, and to come at their secrets of abstract principle and intrinsic law. We could<br />\nhave no science, otherwise, and no adequate<br />\nknowledge of the world in its elements; and<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nunless'we knew it in its elements we could not<br />\nknow it in its action as a whole, complex and<br />\nfruitful of power. But we should have the<br />\nother side of knowledge, too — that feeling for<br />\naffairs which is synthetic and which shall enable us to deal with rough life as we find it.<br />\nWe must not fall out of sympathy with life because it is not like what we make of it in our<br />\nlaboratories and in our seminaries. We must<br />\nbe proper men of the world, as well as trained<br />\nacademic reasoners must know when and<br />\nwhere \"the academic point of view\" is to be<br />\ntaken and when and where it is entirely out of<br />\nplace, and pedantic.<br />\nNo doubt the best way to reach this balance<br />\nand readiness at adjustment is to give our<br />\nminds a various diet and a liberal view of the<br />\nworld, by reading books that are full of the<br />\ncommon life of the world, as well as books<br />\nupon our own special topics of academic<br />\nstudy — the better sort of novels, with real<br />\npeople in them, such as masters like Fielding<br />\nand Sienkiewicz can create; such poetry as<br />\nruns hot with the motives that send men to action and to self-sacrifice; such histories as contain the real rush and variety of life; and travels that meant something more for the traveler<br />\nthan mere sight-seeing or mere pleasure. University men seldom have time during their<br />\nterm of study for real contact with affairs; but<br />\nthey can put their minds every day for a little<br />\nwhile into the air of the world that moves outside laboratories and lecture halls, in streets<br />\nand markets, on prairie and ocean, on frontiers<br />\nand battle-fields, in households and in the lobbies of parliaments — and so not forget that<br />\nother side of things which the practical man<br />\nfears he may forget. He should not for a moment despise his \"academic point of view\"<br />\n(for the advancement of exact knowledge and,<br />\nin the end, the progress of the world depend<br />\nupon its assiduous cultivation) ; but he should<br />\nbe ready to abandon it, and should instinctively<br />\nabandon it, the moment it becomes unsuitable<br />\nfor the practical business of life. He must not<br />\nbe a pedant : he must be a trained thinker who<br />\nis also a man of the world.<br />\nWOODROW WILSON.<br /><br />\nDR. VINCENT ON \"GENEVA.\"<br />\nProfessor Vincent delivered a very entertaining address upon \"Geneva\" before the<br />\nHistorical and Political Science Association<br />\non Friday evening. His talk was based upon<br />\npersonal reminiscences of his visit to the city<br />\nlast summer. The worthy professor was considerably shocked at the rather loose observance of the Sabbath. Every Sunday morning<br />\nhe was awakened by target practice under his<br />\nwindow ; and, after enjoying a very pious sermon, was accustomed to see the worthy<br />\npreacher regaling himself with a game of ten<br />\npins and other kindred amusements. Elections are always held on that day; and in consideration of municipal politics, it is worthy to<br />\nnote that the Genevese do not apparently care<br />\nfor the luxury of a mayor, and consequently<br />\nentrust the duties of that office to a council.<br />\nThe Church and State are very closely connected, ministers being elected by popular vote<br />\nof the people, and have their salaries paid by<br />\nthe Government. The laboring classes are<br />\npoor, but not subdued; and nowhere in Europe, says Professor Vincent, did he find that<br />\ncharacteristically American broadness of<br />\nviews and democratic instincts so prevalent as<br />\nin Geneva. The beauties of the place are seldom exaggerated. The effect of the gorgeous<br />\ngrandeur of its surrounding rivers and mountains make a picture almost too glorious for<br />\ndescription.<br />\nIn accordance with Professor Adams' custom of making the library and lecture-rooms<br />\nas attractive as possible, quite a number of new<br />\npictures and paintings have been added to the<br />\nlarge number which now hang upon the walls.<br />\n\"Boswell,\" said Dr. Johnson, meeting the<br />\nbiographer on the street, \"I have been reading some of your manuscripts. There is a<br />\ngreat deal about yourself in them. They seem<br />\nto me to be Youmoirs rather than Memoirs.\"—<br />\nPuck.<br />\nProfessor: How dare you swear before me?<br />\nFreshman: How did I know you wanted to<br />\nswear first.—Exchange.<br /><br />\nTHE NEWS-LETTER.<br />\nNEWS OF A FORTNIGHT.<br /><br />\n.3!<br /><br />\nTHE MUSICAL ASSOCIATION.<br />\nIt is proposed to form a musical association<br />\nat the Johns Hopkins University. Only persons enrolled in the register of the University<br />\nand their wives are eligible to membership.<br />\nThe annual dues will be $1. The association<br />\nwill give four evening musicales, under the direction of Mr. W.Edward Heimendahl, in McCoy Hall, during the months of December,<br />\nJanuary, February and March. The number<br />\nof persons present at the musicales is limited<br />\nto 250. Membership tickets may be obtained at the office of the Registrar of the University. The arrangements are made by the<br />\nfollowing persons:<br />\nPresident and Mrs. Gilman,<br />\nProf. P. Haupt,<br />\nMrs. E. H. Griffin,<br />\nMrs. M.Bloomfield, Dr.T.S. Baker,<br />\nDr. Philip Ogden,<br />\nMrs. Paul Haupt,<br />\nMrs. H.E. Greene,<br />\nMr. C. C. Schenck,<br />\nMrs. William Bullock Clark.<br />\nThe first meeting of the association will be<br />\nheld on Friday, December 17, at 8:15 P. M.,<br />\nwith the following programme:<br />\nI. Joseph Haydn (1732-1809):<br />\nString quartet in D major.<br />\n(a) Allegro moderato.<br />\n(b) Adagio cantabile.<br />\n(c) Menuetto : Allegretto.<br />\n(d) Finale: Vivace.<br />\nMessrs. Heimendahl, Moses, Saunders,<br />\nFurth meyer.<br />\n2. Franz Liszt (1811-1886):<br />\n(a) Etude in D fiat major.<br />\n(b) Liebestraum Nocturne.<br />\nMiss Hermine Liiders.<br />\n3. Max Bruch (1838):<br />\nViolin concerto in G minor.<br />\nSecond movement: Adagio.<br />\nMr. W. Edward Heimendahl.<br />\n4. Robert Schumann (1810-1856):<br />\nDichterliebe.<br />\nFive songs : Nos. I, 2, 3, 4 and 7.<br />\nMr. T. S. Baker.<br />\n5. Anton Rubinstein (1830-1894):<br />\nPiano concerto in D minor.<br />\nFirst movement :<br />\nMiss Hermine Luders.<br /><br />\n3<br /><br />\n\"PREPARATION FOR PUBLIC LIFE.\"<br />\nThe joint session of the Congress on November 8 was held for the purpose of listening<br />\nto an address by President Gilman. Speaker<br />\nFrench, of the House, called the meeting to<br />\norder, and after welcoming the Senate to the<br />\njoint session, gave up the chair to President<br />\nDieffenbach, of the Senate. The Censor announced that the President desired to address<br />\nthe meeting, and Messrs. Straus and Grimes<br />\nwere appointed to escort him to the room.<br />\nIn his speech Dr. Gilman dwelt upon the<br />\nvalue of presence to a speaker, and advised the<br />\nmembers of the Congress, when speaking, to<br />\ntalk to the most remote of his audience, and<br />\nto catch their attention individually. He also<br />\nbrought forward the obligation which lies<br />\nupon every young man to take active interest<br />\nin public affairs, and pointed out the many<br />\nchances open to them to enter the public service. Dr. Gilman was suffering from a severe<br />\ncold and made his address only by great effort. He was listened to with great interest,<br />\nand heartily applauded. Messrs. Fitzgerald<br />\nand Knapp were appointed to escort him to<br />\nhis office. The meeting then adjourned.<br />\nTHE CUBAN QUESTION.<br />\nEach meeting of the Senate is an improvement on the previous one. Last Wednesday<br />\nthe presence of President Gilman and Dean<br />\nGriffin lent a dignity to the session, which did<br />\nnot result in stage fright among the speakers,<br />\nbut, on the contrary, seemed to inspire them to<br />\ndebate more forcibly and fluently. Indeed, so<br />\nwell was the subject handled that Senator Ballard, when called upon in the open debate,<br />\nfound he could add nothing to what had already been said, which was somewhat surprising. The subject was: \"Should the United<br />\nStates intervene in behalf of Cuba?\" Senators<br />\nClarke, Seth and Fender made good arguments for Cuba, and Senators Stearns and<br />\nHammond defended the negative side of the<br />\nquestion. Senator Ulman was absent. Senator Clarke's speech was the feature of the de(Continued on Page 8.)<br /><br />\nTHE NEWS-LETTER.<br /><br />\n4<br /><br />\nZhe petugiattter.<br />\nPublished Portnightly_during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br /><br />\nDECEMBER 10, 1897.<br />\nSubscription Si.so per year.<br />\nEditor in Chief,<br />\nAssistant Editor in Chiet,<br />\nConsulting Editors, -<br /><br />\nstudent alone could afford. This plan is peculiarly applicable to the Medical School, where<br />\nthe course is the same for all.<br />\nMUSICAL ASSOCIATION.<br /><br />\n15 cents a single copy.<br /><br />\nEDGEWORTH SMITH,'98.<br />\n- ALBERT C. DIEFFENBACH,'98.<br />\nProf. KIRBY P. SMITH.<br />\nGO.C. MORRISON,'90•<br /><br />\nDEPARTMENT EDITORS.<br />\nG. L. P. RADCLIFFE, 1.<br />\nGraduates.<br />\nC. K. EDMUNDS,<br />\nW.T. LONGCOPE, Medical School.<br />\nY. A. RENOUF,'98.<br />\nR. D. MILLER,'98.<br />\nJ. C. FRENCH,'99.<br />\nJ. H. KING, '9q.<br />\nB. A. SPILMAN, 99.<br />\nBusiness Manager,<br />\nR. H.GRIMES,'99.<br />\nAddress all articles, communications, etc. to EDGEWORTH<br />\nSMITH. box 707, Johns Hopkins University. Baltimore. Md.<br />\nSubscriptions and business communications must be sent<br />\nto R. H.GRIMES, box 23', .H. U•; or box 398, Medical School<br />\nof Johns Hopkins Hospital.<br /><br />\nThe new Musical Association which is being started for members of the University and<br />\nfor their wives promises to be very successful<br />\nand to occupy a much-needed place in the University. There is an unusual number of music<br />\nlovers and musicians at the University, but<br />\nthey have never before been gathered into<br />\nany organization. The Association, besides<br />\nencouraging music at the University, will, to<br />\na great degree, serve as a social organization.<br />\nRefreshments will be served after each meeting, and the members of the University will be<br />\ngiven an opportunity to become better acquainted. The dues of the Association are<br />\nonly nominal and the membership, which is<br />\nlimited in number to 250, will be composed of<br />\nmembers of the University and their wives.<br /><br />\nThe plan, as suggested by THE NEWS-LET.<br />\nFUN WITH FRESHMEN.<br />\nTER, of having common college halls through<br />\nthe cooperation of the students, seems to have<br />\nA pad of scribbling paper, having intermebeen already in vogue on a small scale at the<br />\ndiate report blanks on the reverse side, was<br />\nMedical School. To have one's own house<br />\nput on the desk in McCoy Hall basement a few<br />\nand to live in the immediate neighborhood of<br />\ndays ago. These blanks suggested great posthe Medical School is a privilege granted to sibilities<br />\nto sundry mirth-loving students.<br />\nfew of its members. But four of its students—<br />\nThey at once put their ideas into effect, and the<br />\nMiss Simmers and Miss Long of the first year,<br />\nnext morning a number of freshmen received<br />\nand Miss Reed and Miss Austin of the second<br />\nreports announcing that they had failed in<br />\nyear—have accomplished this in a manner at<br />\nsome course and insisting on an improvement<br />\nonce both comfortable and practical, and the<br />\nin their future work. All the recipients of<br />\nplan, as adopted by them, of having common<br />\n-these notifications were greatly alarmed ;<br />\nlodgings and personal management, ought to<br />\nsome of them carried their troubles to the<br />\nfind many imitators. The advantages are<br />\nRegistrar, and only then learned that they had<br />\nobvious. Apart from the reduction in expense,<br />\nfallen victims to a hoax.<br />\nthere is the absence of interruption, annoyance and uncongenial associations incident to<br />\nlife in even the best of \"boarding\" houses,<br />\nRAH FOR BLACK AND BLUE..<br />\nand the added zest which those engaged in a<br />\nIt was all started by a couple of fair Medical<br />\ncommon purpose must always impart to each<br />\nSchool \"co-eds,\" dressed one in black, the<br />\nother. It is also possible to form a library of other in blue, who were going to Dr.<br />\nBrooks'<br />\nthe books needed in the course, thus greatly lecture last Wednesday. They<br />\ninquired the<br />\ndecreasing the individual expense and increas- way of \"Billy\" Stewart, and \"Billy<br />\n\" galing the number of books far above what each lantly undertook to escort them<br />\nto their desti-<br /><br />\nTHE NEWS-LETTER.<br />\nnation. The Black and Blue caught the eyes<br />\nof a group of students, who at once raised a<br />\ncheer for the 'Varsity colors. Then followed a<br />\n\"Te-hee, Te-ha\" for \"Billy\" Stewart ; then<br />\nanother for the \"Meds.\" By this time quite<br />\na crowd of students had gathered. Someone<br />\nstruck up : \"Here's to J. H. U.\" All joined<br />\nin, and the cheering and singing continued for<br />\nsome time and was renewed several times during the day.<br />\nPROFESSORS PATTON AND SCHrlIDT.<br /><br />\nThe authorities of the University are fortunate enough to be able to announce that Professor Erich Schmidt, of the University of<br />\nBerlin, has consented to deliver the Percy<br />\nTurnbull memorial lectures in the session of<br />\n1898-99. The lectures will be given in German, and the subject will be \"Goethe.\" Professor Schmidt is one of the most distinguished scholars in Germany, and as a lecturer he is said to be quite as remarkable as M.<br />\nBrunetiere, who gave the last course of Turnbull lectures.<br />\nPresident Patton, of Princeton University,<br />\nhas accepted an invitation to deliver the Levering lectures for the current year. The lectures<br />\nwill be three in number and will be given about<br />\nthe first of February. The subject will be announced later.<br />\nY. M. C. A. AFFAIRS.<br /><br />\n5<br /><br />\nment of the work, and in a measure take the<br />\nplace of a college secretary in States, like<br />\nMaryland, not large enough to support one.<br />\nThe party consisted of Morris L. Barr, the<br />\ngeneral secretary ; C. W. Ottley, of the Medical School, and S. S. Kingsbury, of the<br />\ngraduate classical department.<br />\nNEWS NOTES.<br /><br />\nCandidates for the Glee Club are being tried<br />\nthis week at the Alpha Delta Phi Fraternity<br />\nhouse. Only a few of the new candidates have<br />\nbeen taken so far, but nearly all the members<br />\nof last year's club are trying again this year.<br />\nThe Banjo and Mandolin Clubs have begun<br />\nregular practice ; the latter club is larger than<br />\never before, while nearly all the members of<br />\nthe Banjo Club having played together for<br />\nthree years, it is expected that that organization will be better this year than since the<br />\nsplendid club of '94-95. J. G. Peters, '98, is<br />\nagain leader of both clubs.<br />\nA meeting of the class of 1900 was held<br />\nWednesday, December 1. The awards of the<br />\noffices of class historian, poet and artist were<br />\nmade. Herbert Kaufman was successful for<br />\nthe offices of historian and artist, and Edward<br />\nP. Hyde for poet. The offices were awarded<br />\nby competition. Roland T. Abercrombie was<br />\nelected delegate to the new Athletic Association.<br /><br />\nThe fourth regular meeting of the class of<br />\nAt the regular meeting of the Y. M. C. A.<br />\nTuesday, November 30, Mr. Rokuro Naka- '99 was held Wednesday, December 1. Deleseko spoke of the difficulties presented by gates to the new Athletic Association were<br />\nJapan to missionary effort. One of these is elected, G. Canby Robinson and George<br />\nthe natural prejudice of the Japanese against Knapp. Eddy B. Fosnocht was elected class<br />\nforeigners, increased by the fact that Russia historian. The meeting was very well athas attempted to use the influence of mission- tended.<br />\naries for political purposes. Another is the<br />\nA feature of the annual banquet of the<br />\nfact that Christian nations forced the opium<br />\ntraffic upon the unwilling Chinese, a matter Chamber of Commerce in New York, November 23, was the response to the toast, \"Comwhich the Japanese have not forgotten.<br />\nA deputation from the Hopkins Associa- merce, the Child of Science and Its Filial Suption recently made a trip to St. John's College porter,\" by President Gilman. Science of Deto visit the Y. M. C. A. there. These visits are cember 3 devoted more than a page and a half<br />\nmade for the exchange of ideas and encourage- to President Gilman's address.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n6<br /><br />\nATHLETICS.<br />\nBASEBALL<br /><br />\nCaptain Clarke, in an interview, has the following to say on 'varsity baseball:<br />\nNow that the football season is nearly over,<br />\nHopkins men are beginning to ask what are<br />\nour prospects of having a good baseball team.<br />\nWhat chance have we of winning the championship of the State? In previous years this<br />\nquestion has invariably been asked and has as<br />\noften received the answer : \"Fine,\" only to<br />\nbe made ridiculous later on by a long string of<br />\ndefeats. Therefore, with these experiences in<br />\nmind, we prefer to waive a direct answer to<br />\nyour question, and trust that time and the<br />\ncourse of events will give you ample compensation for your waiting.<br />\nAlthough we are not predicting success, we<br />\nare, nevertheless, not without strong hopes<br />\nthat, by hard work and consistent training, we<br />\nmay bring the 1898 championship to adorn the<br />\nwalls of our new gymnasium. This brings up<br />\nthe question : Will the baseball team really<br />\ntrain ? If so, what method will be pursued?<br />\nWe answer : Yes, they must train.<br />\nWhy<br />\nshouldn't they ? Other college teams feel the<br />\nnecessity of training, and Hopkins men,<br />\nsurely, can't afford to neglect it. This statement hardly needs further explanation, for all<br />\nof us know that a team, no matter how good<br />\nits players may be individually, cannot hope to<br />\ncompete successfully with its opponents, unless it has acquired that perfection of team<br />\nplay which comes only by hard and constant<br />\npractice.<br />\nLet no man imagine that the team has already been \"picked,\" for positively no \"sifting\" of material will take place before we<br />\nshall have had outdoor practice. Let every<br />\nstudent who plays ball hand in his name to<br />\nManager Haulenbeek, for even if he shouldn't<br />\n\"make the 'Varsity,\" he may \"make the<br />\nscrub\" which will be organized to give the<br />\nfirst team at least one practice game a week.<br />\nSeveral promising candidates have already<br />\nappeared, among whom are: Haulenbeek,<br />\nWight, Joyner, Hitzrot, Rogers, Foster,<br /><br />\nFletcher, Wirt, Rickey, Grimes, Talty, Everett, Swaine, Warren and others. Now that<br />\nwe are to have our cage, and consequently<br />\ncan arrange an hour and place suitable to the<br />\nMedical men for practice, we expect to get out<br />\nsome of the fine material always to be found<br />\nat the Medical School.<br />\nBut the success of any team depends on the<br />\nencouragement and support given it by the<br />\nstudents, and, realizing this, we ask only for<br />\nan honest trial before condemnation.<br />\nATHLETIC ASSOCIATION.<br /><br />\nThe Athletic Association held its first meeting yesterday afternoon in Hopkins Hall. Officers were elected as follows:<br />\nPresident—Professor Edward A. Renouf.<br />\nVice-President—Wm. H. Maddren (Medical School).<br />\nSecretary—Frank J. Clunet ('98).<br />\nTreasurer—Dr. J. Bascom Crenshaw.<br />\nThe other delegates are : Robert Garrett,<br />\nG. Canby Robinson and George W.Knapp,Jr.<br />\nA 'Varsity handball team,consisting of Wm.<br />\nH. Maddren and Ward Simmons, was recognized by the Athletic Association. During the<br />\nholidays these men will represent Hopkins in<br />\na contest with the Polytechnic team of Brooklyn. It is Hopkins' first move in this sport,<br />\nand the start is a very auspicious one.<br />\nThe proposed formation of a new lacrosse<br />\nassociation by Harvard, Yale, Pennsylvania<br />\nand Cornell, in the face of a strongly organized<br />\nassociation in existence at present, was also<br />\nsettled. The Hopkins will prevent this by<br />\njoining the Inter-collegiate Athletic Association, thereby completing, with Lehigh and<br />\nStevens, a deal for full and official recognition<br />\nas the only lacrosse association.<br />\nIt was decided that a house committee<br />\nwould have charge of the new gymnasium<br />\nwhen completed. One graduate, two seniors,<br />\none junior and one freshman will compose the<br />\ncommittee, with the consent of the faculty.<br />\nHOCKEY.<br /><br />\nThe Hockey League is at present in a state<br />\nof uncertainty. At the last meeting of the<br />\nBoard of Delegates a dispute arose in regard<br /><br />\nTHE NEWS-LETTER.<br />\nto the admission of the Maryland Hockey<br />\nTeam into the League, and the percentage of<br />\ngate receipts to be allowed the team. All the<br />\nteams represented voted against admitting the<br />\nMarylands, and against lowering the percentage from ten to five per cent. Manager Towers, of the rink, took the other side, however,<br />\nand the meeting ended in a disagreement.<br />\nUntil there is a mutual agreement between the<br />\nrink management and the various teams and<br />\nplayers, there will hardly be any city championship games. The rink is making arrangements for outside teams to play the Maryland<br />\nHockey Team,but, as these teams are brought<br />\non at a great expense in most instances, there<br />\nwill be very little profit by such action. Unless there are well-contested local games, it is<br />\nalmost safe to say that there will be very little<br />\ninterest taken in visiting teams.<br />\nIt is hoped that an early solution to the<br />\nproblem will be brought forward and amicable relations cemented among the contending<br />\nparties.<br />\nLACROSSE.<br /><br />\nA dispatch from Cambridge, stating that the<br />\nmanager of the Harvard lacrosse team has<br />\nopened negotiations with the lacrosse authorities at Yale, Columbia, Cornell and the University of Pennsylvania, informs us of the revival of lacrosse among the Northern colleges.<br />\nTwo years ago Harvard played Hopkins to<br />\na tie. There was a time when Cornell and<br />\nPrinceton had first-class tennis, but during the<br />\npast few years little or no interest has been<br />\ntaken in lacrosse at these institutions.<br />\nIt would be of great advantage to all if these<br />\ncolleges, which contemplate reviving lacrosse, would apply for membership to the<br />\nInter-Collegiate Lacrosse Association, which<br />\nis composed of Hopkins, Lehigh and Stevens.<br />\nAmple provision is to be made in the new<br />\ncage for the track team. Next the walls a cinder track is to be laid out, and banked at all the<br />\ncurves. It will be an eighteen-lap track. Here<br />\nthe team can train at all times and in all weath-<br /><br />\n7<br /><br />\ners. Dr. Shattuck, assistant in geology, has<br />\noffered to coach the men, and Mr. MacDermott will probably be with us as well.<br />\nThe records recently made by Robert Garrett under J. H. U. colors in outdoor broad<br />\njump and throwing the discus and indoor 16pound-shot-put have been adopted by the<br />\nMaryland Board of Records.<br />\nA WORD OF WIT.<br />\nWHO KNOWS?<br /><br />\n\"No, gentlemen,\" said the professor,\"I insist that nosology is not the study of noses.\"<br />\nHAD COMPANY.<br /><br />\nVisitor: Who is the gentleman sitting near<br />\nthe professor ?<br />\nMr. Bretzelesser (student): Ach I dot is his—<br />\nhis—accomplice.<br />\nWhen lips are cherry-red,<br />\nWhen eyes are blue—<br />\n\"Visions of loveliness,\"<br />\nI think, don't you?<br />\nWhen eyes are cherry-red,<br />\nAnd lips are blue—<br />\n\"Someone's been on a bat,\"<br />\nI think, don't you?<br />\n—Columbia Morningside.<br />\n1. He who knows not, and knows not he<br />\nknows not—he is a Freshman. Shun him.<br />\n2. He who knows not, and knows be knows<br />\nnot—he is a Sophomore. Honor him.<br />\n3. He who knows and knows not he knows<br />\n—he is a Junior. Pity him.<br />\n4. He who knows and knows he knows—<br />\nhe is a Senior. Reverence him.—Exchange.<br />\nFirst Farmer: How's your boy doing in<br />\ncollege?<br />\nSecond Farmer: Splendid ! Getting high<br />\nmarks I First time he came home he had a<br />\npin with '99 on it.—College Index.<br />\nThese college men are very slow,<br />\nThey seem to take their ease ;<br />\nFor even when they graduate,<br />\nThey do so by degrees.<br />\n—University Herald.<br /><br />\nTHE NEWS-LETTER.<br />\n(Continued from Page 3.)<br /><br />\nbate. He spoke very rapidly, yet distinctly and<br />\nprecisely, and was heartily applauded. Senators Stearns and Hammond also did well. In<br />\nthe open debate Senators R. D. Miller and<br />\nYoung took part.<br />\nPresident Gilman, in a two-minute talk recommended that the members attend a session<br />\nof the National Congress in Washington to<br />\ngain points in parliamentary practice and debating. He also congratulated the Senators<br />\nupon their work, and promised to have a clock<br />\non the wall of the Senate Chamber in time for<br />\nthe next meeting.<br />\nSenator Bestor read several reports from<br />\nother colleges where forensic oratory has been<br />\ntried. Their tone, on the whole, was not encouraging. The Congress at Johns Hopkins<br />\nis now a successful reality. It has been suggested that the reason of this is that the conduct of the Congress is happily in charge of<br />\nfaculty and students. In this respect it differs<br />\nfrom the ordinary course, and gives the advantages of a debating society, combined with the<br />\nvalued advice of an experienced instructor.<br />\nThe subject for debate for the next session<br />\nis : \"Resolved, That capital punishment be<br />\nabolished.\" Senators Dohme, C. Hodges and<br />\nHubner, affirmative, and Senators Robinson,<br />\nF. W. Smith and Gordon, negative.<br />\nThe fourth regular meeting of the House of<br />\nRepresentatives was held Wednesday, November 24. The debate, \"Resolved, That the<br />\nUnited States should intervene in the case of<br />\nCuba,\" was very spirited, and showed careful<br />\npreparation on the part of the debaters. That<br />\nthe debaters spoke with hardly any reference<br />\nto their notes was very gratifying, and added<br />\nmuch to the interest of the debate. The negative side, which consisted of Congressmen<br />\nGuggenheimer, Ross and Fischer, won the debate. The Censor, in his criticism, complimented the negative side on their earnest work<br />\nin preparation for the dabate. Congressman<br />\nFischer, he said, was very witty and effective<br />\nin his arguments. The affirmative side was<br />\nsomewhat handicapped by the absence of one<br />\nof their regular debaters. Congressman Lev-<br /><br />\nering was asked to fill the vacancy. The subject for debate at the next regular meeting of<br />\nthe House will be : \"Resolved, That capital<br />\npunishment should be abolished.\" The debaters will be : Affirmative — Congressmen<br />\nRemsen, Keidel and Welber. Negative—Congressmen Murkland, Davidson and Krager.<br />\nThe House was favored with the presence of<br />\nDr. Greene and Dr. Vincent.<br />\n11EDICAL SCHOOL NEWS.<br /><br />\nDr. L. F. Barke held his first quiz in histology on Friday, December 3, which will be followed by one on each succeeding Friday<br />\nthroughout the course. These quizzes are so<br />\noriginal and interesting that the students look<br />\nforward to them with more pleasure than fear.<br />\nThe quizzes in anatomy will be conducted this<br />\nyear by Drs. Mall, Lord and Harrison.<br />\nIt is to be hoped that the smoker which the<br />\nfirst-year class had prepared to have some<br />\nweeks ago, has not been permanently postponed. By this informal means the studeatt<br />\nwould meet and know each other, which, otherwise, may not be accomplished for some<br />\ntime, owing to the unusual size of the class.<br />\nArrangements for smokers should be made<br />\nas soon as possible, for before long everyone<br />\nwill be so busy that the interest for its success<br />\nwill be subordinate.<br />\nCLASS rIEETINOS.<br /><br />\nThe class of '98 met on Wednesday and<br />\nelected Messrs. Clunet and F. W.Smith members of the Board of Directors of the Athletic<br />\nAssociation. President Fitzgerald also announced the executive committee, which consists of the President, ex-officio, and Messrs.<br />\nSeth, Clunet, Dieffenbach, Hodges, Harwood<br />\nand Scholl.<br />\nThe class of i9oo met on Wednesday to<br />\ndiscuss class pins. They also voted an appropriation of $2o for representation in The Hullabaloo.<br /><br />\nThe Bo'Latin SGhool,<br /><br />\nTelephone Call 18:2,<br /><br />\nEstablished 1880.<br /><br />\nARTHUR F. LAWRENCE &amp; CO.<br /><br />\n870 LINDEN AVENUE,<br /><br />\nLeading Dealers in<br /><br />\nJ. A. DUNHAM, A. H., Henri Mnster.<br /><br />\nThis school has a continuous history of over fifty years .<br />\nIt was reorganized under its present management<br />\nm 1894. •<br /><br />\nCOAL and WOOD<br />\nCENTRAL OFFICE,<br /><br />\n6 W. SARATOGA STREET,<br />\nY. M. C<br /><br />\nBALTIMORE, MD.<br /><br />\nA. BUILDING,<br /><br />\nSAVINGS DEPARTMENT<br /><br />\nCAPITAL, $100.000.<br /><br />\nWarpland CDle Insurance and Crust Co.<br />\nEQUITABLE BUILDING, BALTIMORE.<br />\nTELEPHONE 1376.<br />\nT. K. WORTHINGTON, JESSE HILLES,<br />\nL. M. DUVALL,<br />\nSec'y-Treas.<br />\nVice-President.<br />\nPresident.<br /><br />\nEXAMINES AND INSURES TITLES TO REAL AND<br />\nLEASEHOLD PROPERTY.<br />\nMoney to Loan on Mortgage (no commissions). Mortgages<br />\nand Ground Rents for Sale. Conveyancing.<br />\nDIRECTORS:<br />\nJohn A. Whitridge,<br />\nEdgar G. Miller,<br />\nAlexander Brown,<br />\nThomas Hill,<br />\nJesse IliIles,<br />\nGeorge Whitelock,<br />\nE. II. Perkins,<br />\nC. C. Shrivei,<br />\nJacob I. Cohen,<br />\nM. Goldenberg,<br />\nT. K. Worthington.<br />\nRates for Title Insurance furnished on application.<br />\nThe President's message has gone its way,<br />\nBut we have a message for you to-day<br />\nThat means a saving of dollars galore,<br />\nProsperity's message to Baltimore. —Y. M. 11. 0. D.<br />\nA Christmas Present for all the Citizens of Baltimore.<br />\nNotice is hereby given that, beginning with to-day, we will<br />\ngive the citizens of Baltimore an exceptional chance to treat<br />\nthemselves to a Winter Suit of Clothes—such a chance as has<br />\nnot been afforded the public in many and many a day.<br />\nCommencing to-day we will sell all our Fancy Cheviot Suits which<br />\nwere manufactured and marked to sell at$15 and $18,forel 1<br />\n4<br />\nh ish<br />\nT<br />\nmeans a great deal to the suit-wanting public. It RI i•L<br />\nmeans an absolute, positive bargain, such as is seldom offered in<br />\nthis or any other city. It means a saving to you of several dollars,<br />\nwhich you'll find so much use for these days, and it means a Suit of<br />\nClothes of superior quality and splendid workmanship.<br />\nDescription.—These suits are of Cheviot, manufactured In the<br />\nbest American mills. They are made up in Single and DoubleBreasted Sacks, as suits your fancy. The linings are of Italian Serge<br />\nand some of Cassimere, with Satin Yokes. The qutton holes are<br />\nhand-fade, and the utmost attention has been paid to every detail.<br />\nThe patterns are plaids of the very latest designs—mixed goods,<br />\nhandsome looking effects—and cheeks of the ultra-fashionable kind.<br />\nEvery suit in the entire lot was made to sell at nothing less than $15,<br />\nand many of them were never intended to sell for less than $18.<br />\nOur price for your choice is<br /><br />\n$11.75.<br />\nIt<br />\nis the Merry Christmas Time. Makeyourself happy by taking<br />\nadvantage of<br />\nstilts are guarantee()<br />\nthis exceptional bargain. These<br />\ngoods. Ifyou aren't satisfied you get your money back. The sale<br />\nbegins to-day.<br /><br />\nHAMBURGERS',<br />\nBaltimore and Howard Sta.<br />\nGeo. L. Harrison,<br />\nPresident.<br /><br />\nGeo. P. Mordecai,<br />\nVice-President.<br /><br />\nCOMMONWEALTH BANK,<br />\nEUTAW ST., FACING MADISON.<br />\nJOHN It. HOOPER<br />\nGEO. YAKEL,<br />\nJAS. It. WHEELER,<br />\nVice-Prest.<br />\nCashier.<br />\nPresident.<br />\n-DIRECTORS.<br />\nLouis Yakel,<br />\nJefferson J. Walsh ,<br />\nJohn N. Matthews,<br />\nJordan Stabler,<br />\nDr. T. A. Ashby, George A. Blake.<br />\nJames It. Wheeler,<br />\nRobert Biggs,<br />\nJesse F. Ely.<br />\nJames If. Preston,<br />\nMurray Vandiver,<br />\nJ. K. Ober,<br />\nYakel.<br />\nGeorge<br />\nValiant,<br />\n0.<br />\nJos;<br />\nOuld,<br />\nH.<br />\nM.<br />\nLarge or small sums, for long or short periods, received on favorable<br />\nterms. Call at the Bank for information.<br /><br />\nGIFFORD de JERSEY MESNY,<br />\nArtist Photographer,<br />\n226 NORTH CHARLES STREET.<br /><br />\nBuy your<br /><br />\nCIGARS, CIGARETTES AND SMOKING TOBACCO from<br /><br />\n..1-15FILD &amp;<br />\n639 NORTH EUTAW ST., NEXT Doe R TO HOPKINS<br />\nWe carry a full line of Stationery,<br /><br />\nUNIVERSITY<br /><br />\nalso New York and Baltimore Daily and Sunday Papers.<br />\nGivii US A CALI..<br />\nGENT'S<br />\nFINE FURNISHINGS.<br /><br />\nas<br /><br />\nhe Eutaw<br />\nA. WAGNER,<br /><br />\nLADIES'<br />\nFINE FURNISHINGS.<br />\nReduced Prices to suit the times<br />\nAT L. LAr1BLIRU'S<br />\n511 N. HOWARD STREET.<br />\nBALTIMORE, MD.<br /><br />\nflerchant Tailor.<br />\nSuits made to Order as Cheap as<br />\nReady-made Clothing.<br /><br />\nRepairing of any description at<br />\nReduced Prices,<br />\nSuits Pressed While You Wait.<br />\n15c.<br />\nPants Pressed.<br />\n50c.<br />\nSuits Pressed<br />\nSuits Cleaned<br />\nWork called for and delivered.<br /><br />\nArthur H. Hall,<br />\nSec'y and Tree.<br /><br />\nSISCO BROS<br /><br />\nThe A.G. Alford Sporting Goods Co.<br /><br />\n13411111C1'S $ 218 N. Charles Street,<br />\nFOOT-BALL AND HOCKEY SUPPLIES.<br />\n120 E. BALTIMORE STREET.<br /><br />\nBALTIMORE,Dim<br /><br />\nTelephone 2573.<br /><br />\n1%0.9es<br />\nsAmuu.HuNfs SONS<br /><br />\nBALTIMORE, MD.<br /><br />\nReduction in Prices.<br /><br />\n2.6E.BA1TIM01lE 51.<br /><br />\nNew i•<br />\nMUsic<br />\nStore 4'<br /><br />\nDISCOUNTS to<br />\nmen lion ing th is advertisement.<br /><br />\nISIPECIAL<br /><br />\nFIOrisi<br /><br />\nStudents<br /><br />\n95<br /><br />\nI. SON COHEN,<br />\n521 N. EUTAW ST.<br /><br />\n•<br /><br />\nArtistic Floral Arrangements.<br />\nChoice Cut Flowers,<br /><br />\nES<br />\nLOrowVnorms<br /><br />\n322 WEST SARATOGA ST.,<br /><br />\nNEAR EUTAW.<br /><br />\nNEAR EUTAW.<br /><br />\nMerchant Tailors,<br /><br />\nNo. 205 E. FAYETTE STREET.<br />\nTHE<br /><br />\nNEW<br /><br />\nPOST OFFICE-<br /><br />\nBALTIMORE.<br /><br />\nWe will insure the finest workmanship and styles in Tailoring as<br /><br />\nalso well-fitting garments.<br />\nThe latest varieties of goods always on hand.<br /><br />\n•<br />\n•<br />\n•<br /><br />\nPOOL PARLOR,<br /><br />\nRepairing. Sundries. Bicycles For Hire 25 cents per hour.<br /><br />\nSpecial rates to Students.<br />\nNicely furnished rooms for Students.<br /><br />\nBALTIMORE.<br /><br />\nLucke &amp; Sons,<br /><br />\n81.25 London Tan Gloves<br />\nreduced to 95 eta.<br />\nSee if you can match them<br />\nfor 511.25.<br /><br />\nMadison Cycle<br />\n3i5 Madison St.<br /><br />\nMRS, OTTO SCHULER,<br /><br />\noPPosuTr<br /><br />\nThe only ho us- e keeping<br />\nGloves in re pair, for two<br />\nmonths free of charge, and<br />\nif not satisfactory at expiration of this time it new<br />\npair given in exchange.<br /><br />\nA few doors !South of Johns Hopkins University. •<br /><br />\nFine Goods at<br />\nMBROSE 8:PERRY,<br />\nPopular Prices.<br />\n... Merchant Tailors ...<br />\n224<br /><br />\nW. Fayette Street, near Howard,<br />\nBALTIrlORE, MD.<br /><br />\nBARTHOLOMAY BREWERY Co.<br /><br />\nJNO. HEINZERLING.<br /><br />\nW. J. WICKHAM<br /><br />\nH EINZER LI NG<br /><br />\nMai ROCHESTER, N. Y.<br /><br />\n&amp; co.<br />\nOffice &amp;Factory,<br /><br />\nBohemian<br />\nBavarian<br />\nMaerzen<br />\nApollo ot<br /><br />\neat<br />\ntat<br /><br />\nOur<br />\nSpecialties:<br /><br />\neat<br /><br />\n2I8-zzz W. Conway St.<br /><br />\nCHALLENGE GINGER ALE<br />\nCLUB GINGER ALE<br />\nCHAMPAGNE CIDER (ExtraDry)<br />\nSPARKLING KOLAFRA .<br /><br />\n'pHONE • • •<br />\netersomrtme........-204<br /><br />\n1060—Telephone-2060<br /><br />\nBALTIMORE BRANCH:<br /><br />\nOffice and Depot, - 227-239 S. Central Ave.<br />\nGEO. C. SUCRO, MANAGER.<br /><br />\nMandolins<br />\nGuitars • •<br />\nBanjos • • •<br /><br />\nir Washburn<br /><br />\nare recommended<br />\nby the highest musical authorities<br />\nall over the world.<br /><br />\nH. R. EISENBRANDT SONS,<br /><br />\niwgCaZ'si.7..1C-XN=XYlantra(EiracHsamt<br /><br />\nSOLE. AGENTS.<br /><br />\na Month.<br />\nPianos $5 Low<br />\nPrices<br />\nEasiest Terms.<br /><br />\nN. E. Corner<br /><br />\nCHARLES AND LEXINGTON STS.<br /><br />\nTHEO. WARNER.<br /><br />\nSEND 60P IN STAMPS ACTUAL COST OF MAILING AND GET ONE<br />\nTHE CHLORIDE oFSILVER DRY CELL BATTERYCO.<br />\nBALT! MORE, MD. U.S.A.<br /><br />\nJAMES R. PAIN1.<br /><br />\nwrARNER &amp;<br />\nCO.<br /><br />\nY.A.IMUMM,71,1,:ilEVEV,1:<br /><br />\nMANIU:AOTURERS OF<br /><br />\nCANES,&amp;e. • •<br /><br />\nbeinerSt<br /><br />\n2-1 W.<br /><br />\n.21.2:..11:2•11v1'.2.)M.=<br /><br />\nAgents for Walter Barnard London Hats.<br /><br />\nSilk and<br /><br />\nnere Hats.<br /><br />\nBALTIMORE, MO.<br /><br />\nWe Sell or Rent all makes of Typewriters<br />\nat Lowest Prices.<br />\nTypewriter Supplies and 4<br />\n1- Standard Machines<br />\nMimeograph Work.<br />\nrented at $1 per VV,.7.0IC<br /><br />\nTYPEWRITER INSPECTION &amp; SUPPLY CO,<br />\nPrice<br /><br />\n15 NORTH STREET.<br /><br />\nInnovation 1 Cash Consideration<br /><br />\n25 per cent. off each sale from this date. Our<br />\nimmense stock of Imported Woolens must<br />\nbe closed out by December 31st to accomplish important changes for our spring purchases.<br />\nIN°. M. KEELER,<br />\nM.,ker of Men's Garments.<br /><br />\n6 N. CALVERT ST.. Opp. P. 0.<br /><br />\nThe Chas. Willms Surgical Instrument Co.<br />\nrime .SURGIC.AL INSTINMENTS,<br />\nBENJ. A. NKLSON,<br /><br />\nMaintio.r.<br /><br />\nManufacturers<br />\nand Importers of<br />\nPhysicians', Surgeons', Hospital and Invalid Supplies,<br />\nManic Hosiery, Trusses, Rubber Goods,cte.<br /><br />\n300 N. HOWARD ST., - BALTIMORE, MD.<br />\nTELEPHONE<br /><br />\nNORTH GERMAN LLOYD S. S. CO<br />\nCABIN PASSAGE AT LOW RATES.<br />\nA. SCHUMACHER &amp; CO,<br />\nFor particulars apply to<br />\nGeneral Agents.<br /><br />\n771.<br /><br />\n4<br />\n'<br />\n4 NEW YORK TO BREMEN,<br />\nLONDON, PARIS, GIBRALTAR,<br />\nIr NAPLES, GENOA, ETC.<br />\n46 BALTIMORE TO BREMEN ....<br />\nDIRECT.<br /><br />\nevery description.. .<br />\nBuildiug Ilardwire ofWood<br />\nMantels and<br /><br />\ning. Rolling Partitions, for dividing Sunday-School<br />\nrooms. Corbin's Door Check and Spring, to prevent<br />\ndoors from slamming. Electric Bells, Locksmithing,<br />\nKeys Fitted.<br /><br />\nF. 11. DAVIDSON &amp; C2.<br /><br />\n509 W. Franklin Stmet,<br /><br />\nBaltimore, Md.<br /><br />\nTelephone 2095.<br /><br />\nATLANTIC TRiocNSPOU LINE.<br />\nExcellent accommodations for at limited<br />\nnumber of First-Class Passengers from<br />\nNew York to London at reasonable rates.<br /><br />\nBaltimore Storage &amp; Lighterage Co.,<br />\n403-409 WATER STREET,<br />\nBALTIMORE.<br /><br />\nPEABODY FIRE INSURANCE CO.<br />\n(Mice 415 Water Street,[Second St.]<br />\nAdjoining Custom Houseoic the West<br /><br />\nShort Insurance for a Day<br />\n. . or Longer Period.<br /><br />\nTHOMAS I. CAREY, Pres.<br /><br />\nBOARD OF DIRECTORS:<br /><br />\nJesse Tyson,<br />\nFrancis White,<br />\nRichard Cromwell,<br />\nRICHIRD B. P087,8ec'ty.<br /><br />\nA. J. Ulman,<br />\nFord. C. Latrobe,<br />\nJoshua 0. Harvey,<br />\nWilliam Harvey<br />\nHenry James,<br />\nJames W. Hates<br />\nAndrew D. Jones. GRIFFITH FEELEMBYER, 1st.<br /><br />\nNew York Shipping Co.,<br />\nBROADWAY,<br />\nNEW YORK.<br /><br />\nJOHN V. RUPPERT,<br />\nMEM CHANT TAILOR,<br /><br />\nNo. 617 N. EUTAW STREET, BALTIMORE, MD.<br />\nSuits to Order for $10.00 and upwards.<br />\nScouring, Altering and Repairing a Specialty,<br /><br />\nGUGGENIIEIMER, WEIL &amp; Co.<br /><br />\nStudents'...<br />\nRequisites.<br /><br />"}], "field_media_file": [{"target_id": 36100, "display": null, "description": null, "target_type": "file", "target_uuid": "fd282c2c-c675-4cf5-b44e-944538e588d6", "url": "http://digital.library.jhu.edu/system/files/2022-03/12098-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12098, "target_type": "node", "target_uuid": "1c9ab428-be45-4075-b6cf-529089f1c9c0", "url": "/node/12098"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "d9ab8f87-a406-4e66-a87e-2bb92d90db7e"}]}