{"mid": [{"value": 51053}], "uuid": [{"value": "56c77b6a-7ef6-4bf4-a4d9-b670f1e1d2cf"}], "vid": [{"value": 51053}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-19T16:01:06+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "15667-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-19T16:01:06+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-19T16:01:06+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": " <br />\n<br />\nZOOLOGY.<br />\n<br />\n17<br />\n<br />\n <br />\n<br />\nally in those of the Susquehanna. The Anura<br />\nincludes the frogs, toads, ete. There are 5 species<br />\nof the former, 1 of the latter, and 4 of tree-toads.<br />\nThe Scaphiopus is subterranean, excavating its bur-<br />\nrows backward with the shovel-bearing hind-feet. It<br />\nonly comes to the surface to breed, after thunder-<br />\nshowers in April, and then in the evening, and is<br />\nrecognized by its loud, discordant notes.<br />\n<br />\nThe coast furnishes an inexhaustible supply of<br />\nedible fishes, and many forms interesting to the nat-<br />\nuralist occur. Nowhere is the large “sheep’s-head”<br />\nmore abundant and palatable (Archosarqus probato-<br />\ncephalus), and the mackerel (Scomber sp.) are not infe-<br />\nrior in flavor. Sea-eels are much eaten, and various<br />\nspecies of Scienide (‘ Weak-fish, spots”), ete., make<br />\nup the bulk of marketable fishes. The toad-fish<br />\n(Batrachus), goose-fish (Lophius), with its huge<br />\nmouth, and the slender pipe-fishes and sea-horses<br />\n(Lyngnathus and Hippocampus), attract the visitor by<br />\ntheir strange appearance. The largest of the perch-<br />\nlike fishes is the drum (Pogonias fasciatus), which has<br />\npowerful grinding pharyngeal teeth, and is very de-<br />\nstructive to the oysters.<br />\n<br />\nThere are at least 140 species of fresh-water fishes<br />\nin the waters of Maryland, of which 80 species are<br />\nimportant as food.<br />\nmac and Susquehanna, while there are 41 inhabiting<br />\nthe Youghiogheny and its branches. When we re-<br />\nflect that each female of these species spawns several<br />\nthousands or hundreds of thousands of eggs in a<br />\nseason, we can readily estimate the great importance<br />\nthis crop might be to us as a source of cheap animal<br />\nfood, were it cultivated to the extent of the capacity<br />\nof our streams. That capacity in Maryland is very<br />\ngreat, for it depends chiefly on the supply of food<br />\nfor fishes furnished by nature. This is ultimately<br />\nderived from a strong vegetation, either directly or<br />\nthrough the insects which feed upon it, or the fishes<br />\nthus nourished as food for the carnivorous species.<br />\nUltimately, then, a productive soil is as much the<br />\ncondition of fish production as of any other, and<br />\nthus our State possesses, evidently, extensive ad-<br />\nvantages in this respect.<br />\n<br />\nSome of these species migrate to salt water in<br />\nautumn, and remain there during the winter; others<br />\ndescend the creeks to the rivers, and the rivers to<br />\ntheir deeper waters, and congregate in them in cold<br />\nweather; others remain all winter in their usual<br />\nhaunts, burying themselves in mud, and undergoing<br />\na kind of hibernation: while some —for example,<br />\ncertain catfish—do not take even this precaution.<br />\nWith a few exceptions, on the advent of spring and<br />\nthe breaking up of the ice, they ascend to the upper<br />\nand clear waters, or to the gravelly bottoms, to de-<br />\nposit their spawn. The exceptions are the eels and<br />\ntrout. The former descend the rivers in autumn,<br />\nand deposit their eggs in salt water; the latter spawn<br />\nin the upper waters in late autumn, prior to their<br />\nriverward migration. Of course, no fishing is per-<br />\nmitted by law during the months of spawning and<br />\nthe pericd of migration. Where the fishes avoid<br />\ndams and other obstructions by fish-ways or canal-<br />\nlocks, these should be especially guarded by the<br />\nFish Commissioners’ deputics or wardens, to prevent<br />\nthe wholesale destruction that can be inflicted on<br />\nthem at such times.<br />\n<br />\nThe most valuable food-fishes in the State are<br />\nmembers of the herring family (Clupcide). The shad<br />\n(Alosa tyrannus) is well known to the inhabitants of<br />\nour eastern cities as the best of table-fishes. It had<br />\nbeen almost exterminated from the Susquehanna, but<br />\nlegislation has restored it. In the Potomac itis still<br />\n<br />\nabundant, but reduced, and further legislation is |<br />\n<br />\nneeded to protect it. The herring (Pomolobus pseudo-<br />\nharengus), or, properly, ale-wife, is immensely numer-<br />\nous, and is caught in the Potomac and Susquehanna.<br />\nThe fisheries at the mouth of the latter river supply<br />\nan extensive region. An anchovy (Engraulis vittatus)<br />\nvisits Chesapeake Bay in immense numbers every<br />\nspring, and might furnish quite as large a supply of<br />\nfood as the European species of the same name.<br />\n<br />\n81 species exist in the Poto-,<br />\n<br />\n <br />\n<br />\nOf the salmon family, the brook-trout (Salmo fon-<br />\ntinalis) is our best-known species. This fish, if prop-<br />\nerly protected, will always be important to the<br />\ninhabitants of the mountainous portions of our State,<br />\nwhere other species are less abundant. It cannot<br />\nfail to be valued, if allowed to increase sufficiently,<br />\nby that class of our people who, in those countries,<br />\nmay find beef and mutton more or less expensive, or<br />\notherwise beyond their reach. The sea salmon (S.<br />\nsalar) will perhaps never be an important feature of<br />\nour fisheries. The Hudson is its southern limit of<br />\nmigration, and it has been extremely rare there fora<br />\nvery long period. The Delaware has rarely furnished<br />\na specimen; and though the experiment of cultiva-<br />\ntion in our waters is certainly worth trying, the<br />\ntransplanting to the Susquehanna would most likely<br />\nfail. -<br />\nThe Salmonide furnish the species which are most<br />\nuseful to the pisciculturist. The brook-trout (Salmo<br />\nJSontinalis) is selected as the most hardy, and its prop-<br />\nagation is already an important branch of industry.<br />\nWe will, however, not speak of pisciculture. The<br />\ntributaries of the Ohio are entirely without any resi-<br />\ndent species of trout, except in a few of its highest<br />\nmountain streams.<br />\n<br />\nMany of our most important fishes belong to the<br />\nperch family (Percide). The finest fishes among<br />\nthese are the pike-perch (Stizostedium). The S. Ameri-<br />\ncanum, or jack, sometimes called jack-salmon, or even<br />\nsalmon, for flavor and general character of flesh, and<br />\nfor large size, is only exceeded in value by the shad,<br />\nyet it is almost unknown to our markets, except as<br />\nan imported article from the lakes. It exists in the<br />\nSusquehanna, and ought to be so protected as to be<br />\nvery abundant there. It is common in the Alle-<br />\nghany and tributaries, and is associated with another<br />\nfine species of smaller size, the S. salmoneum, Raf.<br />\nBoth these fishes ought to be cultivated. The jack<br />\nreaches, occasionally, forty pounds, and, like the<br />\ntrout, seeks the highest and coolest waters that will<br />\nfloat him. Ie possesses great activity and strength,<br />\nand is a ravenous destroyer of perch and other spe-<br />\ncies. Were he not so superior in every way to all<br />\nothers, this habit might condemn him; as it is, we<br />\nregard it as one of the best species we possess. In<br />\nthe South, it is eagerly bought, and forms the prin-<br />\ncipal table-fish for the various places of resort,<br />\nsprings, etc., where it can be obtained. It is sup-<br />\nplied with means of defence in its powerful teeth,<br />\nwith which it will inflict wounds. Yet this large<br />\nspecies is almost unknown in many parts of our<br />\nState, and as a source of food is comparatively insig-<br />\nnificant. As its mode of life combine those of the<br />\nbrook-trout and bass, there is no reason why some<br />\nenterprising person should not make it an object of<br />\nculture on the Susquehanna or westward. Proper<br />\nprotection would also have as much effect in increas-<br />\ning its numbers as in the case of any other species<br />\nwe have.<br />\n<br />\nThe brackish water lovers, the yellow perch and<br />\nwhite and striped bass, are well known. They have<br />\nsuffered great diminution of numbers from improper<br />\nspring fishing, and fishing through the ice at the<br />\nmouths of streams in winter. Both these practices<br />\nshould be put a stop to, in accordance with the<br />\nlaw.<br />\n<br />\nThe black bass (Micropterus fasciatus)is only native<br />\nof our State in the tributaries of the Youghiogheny.<br />\nThe public scarcely remembers its introduction into<br />\nthe Potomac. The James River is the most north-<br />\nern of the eastern rivers which contains species of<br />\nthe same group (the green bass), but the introduction<br />\n<br />\nof both that species and the present into the Poto- |<br />\n<br />\nmac has been a success. It is a valuable acquisition,<br />\nand, though carnivorous, will not interfere mate-<br />\nrially with the spawn and fry of the ale-wives (her-<br />\nring of our fishermen) and shad, if the latter are<br />\nprotected against improper fishing. It attains a<br />\nweight of from eight to twelve pounds, and is a<br />\ngood table-fish. - The “white perch,” or *“moon-<br />\nperch,” of the Potomac (Pomoxys hexacanthus), is not<br />\n<br />\n <br />\n<br />\nless valuable than the black or green bass. An oc-<br />\ncasional straggler is taken in the Delaware, and it<br />\noccurs in the Susquehanna. It is an excellent table-<br />\nfish, and ought to be protected and cultivated. Its<br />\nweight is from one to five pounds; in form it is flat<br />\nand round, like the sunfish.<br />\n<br />\nThe smaller sunfishes also have considerable mar-<br />\nket value. The common species (Pomotis vulgaris)<br />\nappears, as is known, in large numbers in winter on<br />\nour stalls. The Lipomis appendix is equally abun-<br />\ndant, and would, if protected, increase to an almost<br />\nincredible extent. In the same way, the mud sun-<br />\nfish (Ambloplites pomotis, Baird), which grows to the<br />\nsize of the white bass in the sluggish streams of the<br />\ntide-water region, will become at some future day a<br />\nsource of food to a considerable population. In fact,<br />\nall these fishes could be easily rendered so abundant<br />\nin a few years as to sell for a cent apiece, instead of<br />\nfive and ten cents per pound.<br />\n<br />\nThere is much difference of opinion as to the merits<br />\nof the pike, and its fitness to receive State protection.<br />\nTwo species occur in the Potomac (Esox reticulatus<br />\nand . porosus), and three in the Susquehanna, (the<br />\nsame with E. umbrosus.) [Those of the Youghiogheny<br />\n<br />\nare scarcely worth considering, as they are few in<br />\n<br />\n~number.] The K. reficulatus of the east is, on the<br />\n<br />\nother hand, an abundant fish, which sells well and is<br />\ngenerally esteemed.  For ourselves, we do not join<br />\nin the condemnation visited on the pike by some,<br />\nand have a liking for its flesh. If its increase can<br />\nbe restrained, instead of favored, in waters which<br />\nproduce the best species, it will cease to inflict much<br />\ninjury by its voracious habits, for it naturally haunts<br />\nstill or grassy waters, where it devours fishes inferior<br />\nto itself, as eels and catfish and frogs. On the whole,<br />\nwe do not think the pike needs any protection, as<br />\nhe has many natural advantages in the struggle<br />\nfor life; but he should not be destroyed except for<br />\nthe table.<br />\n<br />\nEels need no protection, as they pass around ob-<br />\nstructions by land, and breed in the ocean. Their<br />\nnumbers have not diminished in our waters to the<br />\nsame extent as other species, and their capture and<br />\nbarreling has long beenrr an important industry on<br />\nthe Susquehanna. When our State is more densely<br />\npopulated they will be more constantly sought, and<br />\nwill require protection, as other fishes. The catfishes<br />\nof our eastern streams, now subordinate, will then<br />\nbecome very valuable also. : :<br />\n<br />\nThe fishes of the carp, sucker, and chub family<br />\nare not valued at present, though in Europe they<br />\nform a very important part of the food of the inland<br />\npopulation. We have already alluded to their pros-<br />\npective importance here, and on that ground alone<br />\nthey should share in the protection afforded to our<br />\nmore valued species. They form, in fact, the bulk<br />\nof the piscine population of the United States, and<br />\nbesides furnishing food for man and bird, form the<br />\nsustenance of the perch, bass, jack, pike, and other<br />\ncarnivorous species. The American carp (Carpiodes<br />\ncyprinus), a 2-5-pound fish, is eaten along the Chesa-<br />\npeake. The other species are numerous; two come<br />\noccasionally to the Baltimore market, and others<br />\noccur all over the State. Of the whole group, nine<br />\nspecies are valuable as food-fishes, *but rather on<br />\naccount of quantity than quality. None suffer more<br />\nfrom the want of protection than these fishes. They<br />\ninhabit the upper waters of all our streams, and are<br />\ncut off in thousands by every mill-dam on the many<br />\nsmaller and larger creeks in the country. Their<br />\nenormous productiveness (some deposit at one time<br />\n500,000 eggs) does not make up for this in the case<br />\nof any particular stream from which they may have<br />\nbeen finally driven. The fish-ways, which preserve<br />\nthe shad and ale-wives, will also protect these.<br />\n<br />\nSECTION II. —INVERTEBRATES.<br />\n<br />\nIn Maryland, as elsewhere, the articulated animals<br />\nexhibit a great preponderance in number of species.<br />\nThese belong in a great part to insects proper. The<br />\nCrustacea being mostly marine, have many represen-<br />\n<br />\n <br />\n<br />\nLD<br />\nsk<br />\n<br />\nR st i o i<br />\n<br />\n.<br />\n<br />\n <br />\n\f", "format": "basic_html", "processed": "<br /><br />\nZOOLOGY.<br /><br />\n17<br /><br /><br /><br />\nally in those of the Susquehanna. The Anura<br />\nincludes the frogs, toads, ete. There are 5 species<br />\nof the former, 1 of the latter, and 4 of tree-toads.<br />\nThe Scaphiopus is subterranean, excavating its bur-<br />\nrows backward with the shovel-bearing hind-feet. It<br />\nonly comes to the surface to breed, after thunder-<br />\nshowers in April, and then in the evening, and is<br />\nrecognized by its loud, discordant notes.<br /><br />\nThe coast furnishes an inexhaustible supply of<br />\nedible fishes, and many forms interesting to the nat-<br />\nuralist occur. Nowhere is the large “sheep’s-head”<br />\nmore abundant and palatable (Archosarqus probato-<br />\ncephalus), and the mackerel (Scomber sp.) are not infe-<br />\nrior in flavor. Sea-eels are much eaten, and various<br />\nspecies of Scienide (‘ Weak-fish, spots”), ete., make<br />\nup the bulk of marketable fishes. The toad-fish<br />\n(Batrachus), goose-fish (Lophius), with its huge<br />\nmouth, and the slender pipe-fishes and sea-horses<br />\n(Lyngnathus and Hippocampus), attract the visitor by<br />\ntheir strange appearance. The largest of the perch-<br />\nlike fishes is the drum (Pogonias fasciatus), which has<br />\npowerful grinding pharyngeal teeth, and is very de-<br />\nstructive to the oysters.<br /><br />\nThere are at least 140 species of fresh-water fishes<br />\nin the waters of Maryland, of which 80 species are<br />\nimportant as food.<br />\nmac and Susquehanna, while there are 41 inhabiting<br />\nthe Youghiogheny and its branches. When we re-<br />\nflect that each female of these species spawns several<br />\nthousands or hundreds of thousands of eggs in a<br />\nseason, we can readily estimate the great importance<br />\nthis crop might be to us as a source of cheap animal<br />\nfood, were it cultivated to the extent of the capacity<br />\nof our streams. That capacity in Maryland is very<br />\ngreat, for it depends chiefly on the supply of food<br />\nfor fishes furnished by nature. This is ultimately<br />\nderived from a strong vegetation, either directly or<br />\nthrough the insects which feed upon it, or the fishes<br />\nthus nourished as food for the carnivorous species.<br />\nUltimately, then, a productive soil is as much the<br />\ncondition of fish production as of any other, and<br />\nthus our State possesses, evidently, extensive ad-<br />\nvantages in this respect.<br /><br />\nSome of these species migrate to salt water in<br />\nautumn, and remain there during the winter; others<br />\ndescend the creeks to the rivers, and the rivers to<br />\ntheir deeper waters, and congregate in them in cold<br />\nweather; others remain all winter in their usual<br />\nhaunts, burying themselves in mud, and undergoing<br />\na kind of hibernation: while some —for example,<br />\ncertain catfish—do not take even this precaution.<br />\nWith a few exceptions, on the advent of spring and<br />\nthe breaking up of the ice, they ascend to the upper<br />\nand clear waters, or to the gravelly bottoms, to de-<br />\nposit their spawn. The exceptions are the eels and<br />\ntrout. The former descend the rivers in autumn,<br />\nand deposit their eggs in salt water; the latter spawn<br />\nin the upper waters in late autumn, prior to their<br />\nriverward migration. Of course, no fishing is per-<br />\nmitted by law during the months of spawning and<br />\nthe pericd of migration. Where the fishes avoid<br />\ndams and other obstructions by fish-ways or canal-<br />\nlocks, these should be especially guarded by the<br />\nFish Commissioners’ deputics or wardens, to prevent<br />\nthe wholesale destruction that can be inflicted on<br />\nthem at such times.<br /><br />\nThe most valuable food-fishes in the State are<br />\nmembers of the herring family (Clupcide). The shad<br />\n(Alosa tyrannus) is well known to the inhabitants of<br />\nour eastern cities as the best of table-fishes. It had<br />\nbeen almost exterminated from the Susquehanna, but<br />\nlegislation has restored it. In the Potomac itis still<br /><br />\nabundant, but reduced, and further legislation is |<br /><br />\nneeded to protect it. The herring (Pomolobus pseudo-<br />\nharengus), or, properly, ale-wife, is immensely numer-<br />\nous, and is caught in the Potomac and Susquehanna.<br />\nThe fisheries at the mouth of the latter river supply<br />\nan extensive region. An anchovy (Engraulis vittatus)<br />\nvisits Chesapeake Bay in immense numbers every<br />\nspring, and might furnish quite as large a supply of<br />\nfood as the European species of the same name.<br /><br />\n81 species exist in the Poto-,<br /><br /><br /><br />\nOf the salmon family, the brook-trout (Salmo fon-<br />\ntinalis) is our best-known species. This fish, if prop-<br />\nerly protected, will always be important to the<br />\ninhabitants of the mountainous portions of our State,<br />\nwhere other species are less abundant. It cannot<br />\nfail to be valued, if allowed to increase sufficiently,<br />\nby that class of our people who, in those countries,<br />\nmay find beef and mutton more or less expensive, or<br />\notherwise beyond their reach. The sea salmon (S.<br />\nsalar) will perhaps never be an important feature of<br />\nour fisheries. The Hudson is its southern limit of<br />\nmigration, and it has been extremely rare there fora<br />\nvery long period. The Delaware has rarely furnished<br />\na specimen; and though the experiment of cultiva-<br />\ntion in our waters is certainly worth trying, the<br />\ntransplanting to the Susquehanna would most likely<br />\nfail. -<br />\nThe Salmonide furnish the species which are most<br />\nuseful to the pisciculturist. The brook-trout (Salmo<br />\nJSontinalis) is selected as the most hardy, and its prop-<br />\nagation is already an important branch of industry.<br />\nWe will, however, not speak of pisciculture. The<br />\ntributaries of the Ohio are entirely without any resi-<br />\ndent species of trout, except in a few of its highest<br />\nmountain streams.<br /><br />\nMany of our most important fishes belong to the<br />\nperch family (Percide). The finest fishes among<br />\nthese are the pike-perch (Stizostedium). The S. Ameri-<br />\ncanum, or jack, sometimes called jack-salmon, or even<br />\nsalmon, for flavor and general character of flesh, and<br />\nfor large size, is only exceeded in value by the shad,<br />\nyet it is almost unknown to our markets, except as<br />\nan imported article from the lakes. It exists in the<br />\nSusquehanna, and ought to be so protected as to be<br />\nvery abundant there. It is common in the Alle-<br />\nghany and tributaries, and is associated with another<br />\nfine species of smaller size, the S. salmoneum, Raf.<br />\nBoth these fishes ought to be cultivated. The jack<br />\nreaches, occasionally, forty pounds, and, like the<br />\ntrout, seeks the highest and coolest waters that will<br />\nfloat him. Ie possesses great activity and strength,<br />\nand is a ravenous destroyer of perch and other spe-<br />\ncies. Were he not so superior in every way to all<br />\nothers, this habit might condemn him; as it is, we<br />\nregard it as one of the best species we possess. In<br />\nthe South, it is eagerly bought, and forms the prin-<br />\ncipal table-fish for the various places of resort,<br />\nsprings, etc., where it can be obtained. It is sup-<br />\nplied with means of defence in its powerful teeth,<br />\nwith which it will inflict wounds. Yet this large<br />\nspecies is almost unknown in many parts of our<br />\nState, and as a source of food is comparatively insig-<br />\nnificant. As its mode of life combine those of the<br />\nbrook-trout and bass, there is no reason why some<br />\nenterprising person should not make it an object of<br />\nculture on the Susquehanna or westward. Proper<br />\nprotection would also have as much effect in increas-<br />\ning its numbers as in the case of any other species<br />\nwe have.<br /><br />\nThe brackish water lovers, the yellow perch and<br />\nwhite and striped bass, are well known. They have<br />\nsuffered great diminution of numbers from improper<br />\nspring fishing, and fishing through the ice at the<br />\nmouths of streams in winter. Both these practices<br />\nshould be put a stop to, in accordance with the<br />\nlaw.<br /><br />\nThe black bass (Micropterus fasciatus)is only native<br />\nof our State in the tributaries of the Youghiogheny.<br />\nThe public scarcely remembers its introduction into<br />\nthe Potomac. The James River is the most north-<br />\nern of the eastern rivers which contains species of<br />\nthe same group (the green bass), but the introduction<br /><br />\nof both that species and the present into the Poto- |<br /><br />\nmac has been a success. It is a valuable acquisition,<br />\nand, though carnivorous, will not interfere mate-<br />\nrially with the spawn and fry of the ale-wives (her-<br />\nring of our fishermen) and shad, if the latter are<br />\nprotected against improper fishing. It attains a<br />\nweight of from eight to twelve pounds, and is a<br />\ngood table-fish. - The “white perch,” or *“moon-<br />\nperch,” of the Potomac (Pomoxys hexacanthus), is not<br /><br /><br /><br />\nless valuable than the black or green bass. An oc-<br />\ncasional straggler is taken in the Delaware, and it<br />\noccurs in the Susquehanna. It is an excellent table-<br />\nfish, and ought to be protected and cultivated. Its<br />\nweight is from one to five pounds; in form it is flat<br />\nand round, like the sunfish.<br /><br />\nThe smaller sunfishes also have considerable mar-<br />\nket value. The common species (Pomotis vulgaris)<br />\nappears, as is known, in large numbers in winter on<br />\nour stalls. The Lipomis appendix is equally abun-<br />\ndant, and would, if protected, increase to an almost<br />\nincredible extent. In the same way, the mud sun-<br />\nfish (Ambloplites pomotis, Baird), which grows to the<br />\nsize of the white bass in the sluggish streams of the<br />\ntide-water region, will become at some future day a<br />\nsource of food to a considerable population. In fact,<br />\nall these fishes could be easily rendered so abundant<br />\nin a few years as to sell for a cent apiece, instead of<br />\nfive and ten cents per pound.<br /><br />\nThere is much difference of opinion as to the merits<br />\nof the pike, and its fitness to receive State protection.<br />\nTwo species occur in the Potomac (Esox reticulatus<br />\nand . porosus), and three in the Susquehanna, (the<br />\nsame with E. umbrosus.) [Those of the Youghiogheny<br /><br />\nare scarcely worth considering, as they are few in<br /><br />\n~number.] The K. reficulatus of the east is, on the<br /><br />\nother hand, an abundant fish, which sells well and is<br />\ngenerally esteemed.  For ourselves, we do not join<br />\nin the condemnation visited on the pike by some,<br />\nand have a liking for its flesh. If its increase can<br />\nbe restrained, instead of favored, in waters which<br />\nproduce the best species, it will cease to inflict much<br />\ninjury by its voracious habits, for it naturally haunts<br />\nstill or grassy waters, where it devours fishes inferior<br />\nto itself, as eels and catfish and frogs. On the whole,<br />\nwe do not think the pike needs any protection, as<br />\nhe has many natural advantages in the struggle<br />\nfor life; but he should not be destroyed except for<br />\nthe table.<br /><br />\nEels need no protection, as they pass around ob-<br />\nstructions by land, and breed in the ocean. Their<br />\nnumbers have not diminished in our waters to the<br />\nsame extent as other species, and their capture and<br />\nbarreling has long beenrr an important industry on<br />\nthe Susquehanna. When our State is more densely<br />\npopulated they will be more constantly sought, and<br />\nwill require protection, as other fishes. The catfishes<br />\nof our eastern streams, now subordinate, will then<br />\nbecome very valuable also. : :<br /><br />\nThe fishes of the carp, sucker, and chub family<br />\nare not valued at present, though in Europe they<br />\nform a very important part of the food of the inland<br />\npopulation. We have already alluded to their pros-<br />\npective importance here, and on that ground alone<br />\nthey should share in the protection afforded to our<br />\nmore valued species. They form, in fact, the bulk<br />\nof the piscine population of the United States, and<br />\nbesides furnishing food for man and bird, form the<br />\nsustenance of the perch, bass, jack, pike, and other<br />\ncarnivorous species. The American carp (Carpiodes<br />\ncyprinus), a 2-5-pound fish, is eaten along the Chesa-<br />\npeake. The other species are numerous; two come<br />\noccasionally to the Baltimore market, and others<br />\noccur all over the State. Of the whole group, nine<br />\nspecies are valuable as food-fishes, *but rather on<br />\naccount of quantity than quality. None suffer more<br />\nfrom the want of protection than these fishes. They<br />\ninhabit the upper waters of all our streams, and are<br />\ncut off in thousands by every mill-dam on the many<br />\nsmaller and larger creeks in the country. Their<br />\nenormous productiveness (some deposit at one time<br />\n500,000 eggs) does not make up for this in the case<br />\nof any particular stream from which they may have<br />\nbeen finally driven. The fish-ways, which preserve<br />\nthe shad and ale-wives, will also protect these.<br /><br />\nSECTION II. —INVERTEBRATES.<br /><br />\nIn Maryland, as elsewhere, the articulated animals<br />\nexhibit a great preponderance in number of species.<br />\nThese belong in a great part to insects proper. The<br />\nCrustacea being mostly marine, have many represen-<br /><br /><br /><br />\nLD<br />\nsk<br /><br />\nR st i o i<br /><br />\n.<br /><br /><br />"}], "field_media_file": [{"target_id": 51976, "display": null, "description": null, "target_type": "file", "target_uuid": "ef9b41a9-d9cc-4dca-803b-73414d2ddf51", "url": "http://digital.library.jhu.edu/system/files/2022-03/15667-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 15667, "target_type": "node", "target_uuid": "b91591f9-4348-445d-a2b0-c27cb0689f40", "url": "/node/15667"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "bbd9594f-7ec3-4189-81ad-282f28588602"}]}