{"mid": [{"value": 35711}], "uuid": [{"value": "d61e360f-b4a8-4800-97da-1ce0c57ee7e5"}], "vid": [{"value": 35711}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:48+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12244-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:48+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:48+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol. VII, No. 14<br />\n<br />\nMay 7, Igo<br />\n<br />\nTHE<br />\n<br />\nNEWS Ars LETTER<br />\n<br />\nPUBLISHED BY STUDENTS<br />\nOF<br />\n<br />\nTHE<br />\n<br />\nJOHNS HOPKINS UNIVERSITY<br />\n<br />\n\fThc Johns Hopkins Presb.<br />\n<br />\nThe Johns Wadi's Universitu<br />\nBALTIMORE, MARYLAND.<br />\n1.<br />\n<br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October i, 1902.<br />\nPresident: litA ItEmsEN. Dean of the Medical Faculty:<br />\nWILLIAM H. HowELL. Dean of the College Faculty:<br />\nBowAnn H. GRIFFIN.<br />\n<br />\nFOR GRADUATE STUDENTS:<br />\n<br />\n'American Cbanical aournal.<br />\nI. RENSEN, Editor. Monthly, 8vo. Volume<br />\nXXIX in progress. $5 per volume.<br />\n111. 'American journal of ipbilology.<br />\nB. L. G I LDERSLEE V H, Editor. Quarterly. 8vo.<br />\nVolume XXIII in progress. $3 per volume.<br />\n1111.<br />\n<br />\nID1.<br />\n<br />\n(a) In l'hilosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br />\n<br />\nFOR UNDERGRADUATES:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLaboratories.<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nl'harmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br />\n<br />\nSeminaries.<br />\nGreek.<br />\nLitton<br />\nSanmkrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEng]ish.<br />\nHistory,<br />\nEconomies.<br />\nMathematics.<br />\n<br />\nDirectors.<br />\nIra liemsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam n K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Osier.<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall MOLL.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. IL Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nUndergraduate Courses (leading to B. A).<br />\nGroups.<br />\nI. claasical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. chemical-Biological<br />\n(leading up to medicine).<br />\n4. Geological-Biological.<br />\n5. Latin-Mathematical.<br />\n6. Historicai-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br />\n<br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol. XXV).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nAmerican Journal of Philology (vol. XXIII).<br />\nStudies in Historical and.Political Science (vol. XXI).<br />\nModern Language Notes(vol. XVIII).<br />\n, Memoirs from the Biological Laboratory (vol. V).<br />\nContributions to Asayriolo9rcvol. IV).<br />\nTerrestrial Magnetism (vol.<br />\nI).<br />\nUniversity Circulars(vol. XXII).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the A rts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br />\n<br />\nStubies from tbc 'Biological 'Laboratory.<br />\nVolume V complete. $5 per volume.:<br />\n<br />\nBro.<br />\n<br />\nStinnes in 'historical sub 'political Science.<br />\nMonthly. 8vo. Series XXI in progress. $3 per<br />\nvolume.<br />\n3obne lbophins Inniversity Circulars,<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. X XII in<br />\nprogress. $1 per year.<br />\n<br />\n1111. Johns lbopkin6 bospital Salient'. Monthly. 4to.<br />\nVolume XIV in progress $1 per year.<br />\n11111. Johns 1bophins 130epttal Reports. 4to. Volume X1<br />\nin progress. $5 per volume.<br />\nIX.<br />\n<br />\nContributions to Essyriology ant, Comparative<br />\nSemitic ipbtIology, (Heitrage %Ur A ssyriologie, etc.)<br />\nVol. IV complete.<br />\n<br />\nX.<br />\n<br />\nIlDemOirs from (be Saloalcal 'Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br />\n<br />\nLibraries.<br />\n105,000 volumes.<br />\nUniversity,<br />\nPeabody Institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br />\n<br />\nYolasm<br />\n<br />\n111.<br />\n<br />\nIL<br />\n<br />\nInstruction.<br />\n<br />\n'American Journal of lleathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nX X V in progress. $5 per volume.<br />\n<br />\nabobern 'Language Votes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVIII in progress. $1.50 per volume.<br />\nX11. journal of 'Experimental fibebicine.<br />\nW. H. WELCH, Editor. Hi-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\n301.<br />\n<br />\nX111.'American Journal of Insanity.<br />\n11,1,N Ity M. HURD, Editor. Quarterly.4to. $5 per<br />\nvolume.<br />\nX111. ',Reports of flbarylanb (Ideological Survey.<br />\nWILLIAM It. CLARK, Editor.<br />\nU.<br />\n<br />\nterrestrial IMaanctism sob litmospberic Elecs<br />\ntricity. L. A. BAUER, Editor. Quarterly. Bvo.<br />\nVolume VII in progress. $2.50 per volume.<br />\n<br />\nV1:111. 'Annual 'Report.<br />\nPresented by the President of the Board of Trueteem, reviewing the operations of the University<br />\nduring the past academic year.<br />\nf11111. 'Annual'Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academia year.<br />\n<br />\nIn addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simile edition. Edited by J. Bendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS. with A ntilegomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographia Hopkinsiensis. Part I. Philology. Parts<br />\nI-111. Chemistry, Mineralogy and Geology. Parts<br />\nV-V-VI. Physics.Astronoray and Mathematics.<br />\nvo. 30 cents per part.<br />\nS full list of publications will he sent on application.<br />\n<br />\nCommunications in respect to exchanues and remittanses<br />\nmau he bent to Johns Hopkins rrObb, Baltimore, Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVOL. VII.<br />\n<br />\nMAY 7, 1903.<br />\n<br />\nNo. 14.<br />\n<br />\nTHE GULF BIOLOGICAL STATION.<br />\n<br />\nt<br />\n<br />\nHE want of a biological station on the Gulf of Mexico has long been felt<br />\nby American biologists. Until recently no laboratory for the study of<br />\nmarine biology existed south of Beaufort, North Carolina, although<br />\nour southern waters are extremely rich in animal and plant life. So attractive<br />\nhave been the reports of visitors to the Gulf coast, that a strong desire for a<br />\npermanent station has been created, and the United States Fish Commission<br />\nhas for several years been contemplating the advisableness of gratifying it by<br />\nerecting a laboratory on the Florida coast. At present also, the naturalists of<br />\nthe country are interested in an independent project to establish a station on<br />\nthe Tortugas. Both of these enterprises have been anticipated by the inauguration of the \"Gulf Biologic Station,\" by the State of Louisiana.<br />\nThe Louisiana station is located in the south-western extremity of Cameron<br />\nParish, on a point where the Calcasieu River opens into the Gulf. It is about<br />\na day's sail from Galveston, Texas, and 280 miles from New Orleans. The<br />\ntown of Cameron, two miles inland from the laboratory, is a small settlement<br />\nof 150 people. The isolation which is thus secured is one of the summer needs<br />\nof the biologist, who, during this period, must be freed from the conventions of<br />\ncivilized life.<br />\nThe environment of Cameron is conducive to work—apparently there is<br />\nnothing else to do. Northward, east and west, extend the alluvial plains, in<br />\nregions thickly wooded, but often bounded only by the horizon. The local<br />\n'mango' gives these stretches of shere flatness, somewhat of a roughened edge,<br />\nwhile here and there a decided nick is produced in the sky by a clump of larger<br />\ntrees. The vastness of these plains gives one the feeling of being alone in a<br />\ngreat solitude. Surely this is the place where that strange desire which many<br />\nmen feel at sometime of their lives—to shout and not be heard—can be gratified.<br />\nEven here disappointment lies in wait. A shout would startle the cattle<br />\ncropping peacefully the miles of pasture; they would cock their ears and look<br />\nwith surprise in the direction of the noise. Some of the more inquisitive ones<br />\nwould start off at a lively canter, kicking up their hind legs and prancing as<br />\nonly cows with glad hearts can. In those regions they do not hear a noise<br />\nevery day of their lives.<br />\nSouth-east, south and south-west, lie the chief interests of the station.<br />\nThere are the problems in the solution of which Louisiana makes the first state<br />\ncontribution to research in marine biology.<br />\nThe campaign begins this summer. The work to be undertaken will include<br />\na study of the best way to develop scientific methods of oyster culture, and a<br />\ngeneral biological survey of the Gulf of Mexico. The prevailing South-east<br />\n•<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS LETTER.<br />\n<br />\nwinds bring to shore many of the pelagic forms with which the Gulf stream is<br />\nalive, but the whole mountain does not come to Mahomet.<br />\nTo meet this difficulty a launch and a sharpy are to be provided. With<br />\nthese boats extensive dredgings will be made on the flat extending outward from<br />\nthe coast, and localities will be plotted and marked. Such animals as do not<br />\nfloat ashore or which are too small to be picked up, will be gathered by means<br />\nof the surface net which is towed through the water behind a slowly moving<br />\nboat. This method of collecting is particularly successful on quiet nights at<br />\nhigh tide. Then the larvx and other small pelagic animals rise to the surface<br />\nand can easily be scooped up in large quantities. Their presence in the net is<br />\nbetrayed by a dim glow. At Beaufort, on very dark still nights, the water is so<br />\ncrowded with living things, that the course of a boat is marked by flashes of<br />\nblinding brilliancy, and in rowing, showers of living sparks drip from the oars.<br />\n<br />\nBesides the Fauna and Flora of the Gulf itself, the student finds much to<br />\ninterest him on land. Lining the rivers and bayous, are large pecan trees and<br />\nlive oaks, black and rugged, hut with a tinge of sadness, for the pendant<br />\nstreamers of the gray Spanish moss lend them the appearance of weeping willows.<br />\nThe 'mango' grows everywhere, and from its joints spring forth the golden tufts<br />\nof the parasitic dodder.<br />\nTropical fruits abound throughout the parish.<br />\nOranges grow in every garden, and lemons, olives, figs and bananas attract no<br />\nmore attention than our apples and pears,<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\na<br />\n<br />\nMost attractive of all the land animals are the birds. Wild ducks and<br />\ngees live in the marshes whefe they probably feed on the eggs and young of<br />\nthe diamond back terrapin. Cranes and herons patrol the shores, and the rice<br />\nbird hovers about the bushes preparatory to its disastrous flight to the north.<br />\nAlong the Gulf shore, the jack snipe struts about with nervous jerk, and the<br />\negret, blinding with whiteness, can be seen for miles. As if to set off the beauty<br />\nof this bird, the black ominous water-turkey, clumsy of flight, wobbles by, low<br />\non the water. Most conspicuous of all however are the flocks of brown pelican.<br />\nThese use for a roosting place the great stone jetties that project out to sea<br />\nfor two miles from the mouth of the Calcasieu. River. Here they sit in straight<br />\ndignified rows as though taking a lesson. Suddenly however, they become restless, and in a moment, with legs stretched out stiffly behind, they are off to sea<br />\nin an irregular squad, which at last is visible only as a group of small, uncertain<br />\nspecks. When they are on the verge of disappearing, these specks, momentarily<br />\nat rest, suddenly grow larger again, and the return flight begins, this time not in<br />\na squad, but spread out like a thin line of heroes,' until they reach the jetty,<br />\nwhere after considerable disorder, they once more sit motionless in a very<br />\ncorrect row.<br />\nThe life at a marine laboratory, however remote, is far from dull and anything but conventional. It is too full of activity to be the one and too unusual<br />\nto be the other. For the men who spend their vacations at a sea-side station,<br />\nwork is a source of endless pleasure, and they who can experience the delight of<br />\nfinding out something new, are amply repaid for all sacrifices. While it sometimes happens that a whole night is 'spent in watching a series of developing<br />\neggs, and that meals are brought to the work table, more often the days pass<br />\nwith a healthy mixture of indoor and outdoor work. The latter nearly always<br />\nmeans a few hours' run on the launch, a sail—time of return is never mentioned--a walk on the beach, and probably a dip in the surf.<br />\nThese collecting trips, even when resulting in no particular find, are never<br />\nwithout good effect, for the exertion, the excitement and sometimes the risk call<br />\ninto play all the powers of body and .mind, and bring about the tingle that<br />\nalways. accompanies the healthful expenditure of superfluous energy.<br />\nThen<br />\ntoo, the community of interests makes good cheer and the air is blue with songs,<br />\nstories and puns. Even university professors, tight-laced with dignity, learning<br />\nand fame, do not hesitate to smoke a corn-cob pipe and to take off their shoes<br />\nand stockings when necessary.. A crowd of biologists coming back from a<br />\nmoonlight towing would, in a city, be arrested for disturbing the peace.<br />\nTHE DEBATE WITH NORTH CAROLINA.<br />\nGAIN the Universii y of North Carolina has defeated us in debate ; but<br />\nthe contest was even closer than last year, and the decision of the judges<br />\nwas not unanimous. Then, too, Hopkins won a partial victory in that<br />\nthe judges unanimously decided Plaggemeyer the best debater who took part<br />\nin the contest. Hopkins lost the debate because the North Carolina team excelled<br />\n•<br />\n<br />\n4<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS LETTER.<br />\n<br />\nin logical development and the completeness of their line of argument. In delivery the Hopkins men equalled or excelled their opponents.<br />\nThe debate was held in Gerrard Hall in the presence of an audience composed largely of university professors and students. Governor Aycock, who<br />\npresided, announced the question, read the instructions to the judges, and then<br />\ncalled upon the secretary to announce the first speaker upon the affirmative side.<br />\nMr. Solomon Blum, who opened the debate for Hopkins, was well received, and succeeded in making his points stand out clearly. Mr. S. S. Robins,<br />\na junior at North Carolina, followed with a speech such as one hears upon the<br />\nfloor of the United States Senate. The speech, which dealt largely with the development of governmental functions and the history of our merchant marine, was<br />\ndelivered in a masterful manner. When Mr. Plaggemeyer had finished the<br />\nnext speech for Hopkins, the advantage that Carolina had gained in her first<br />\nspeech was largely overcome. Mr. R. 0. Everett, a senior, then delivered a<br />\ntwenty-minute speech in which he still further developed the line of argument laid<br />\ndown in Carolina's first speech. In the rejoinders the extemporaneous speeches<br />\nof Messrs. Blum, Robins and Everett demonstrated the ability of those men to<br />\nthink quickly and to present their arguments clearly without previous preparation. But Plaggemeyer's rebuttal was by far the most effective speech of the<br />\nevening. Plag. was at his best and he carried his audience with him in a way that<br />\nsurprised even those who have heard him in former debates. When he finished<br />\nspeaking, it was any one's victory. As it was, the decision proved to be a victory<br />\nfor Plaggemeyer as well as for the University of North Carolina.<br />\nWhile the judges were deliberating, Governor Aycock responded to the repeated demonstrations of the Carolina students. He said that, in his opinion, the<br />\njudges had to decide the old question:—\"What happens when an irresistable force<br />\nmeets an immovable body.\" During the debate, the Governor said his convictions had been reinforced and his faith destroyed four times that he awaited the<br />\ndecision of the judges in order that he might know whether he must forsake the<br />\ntraditions of his childhood, or be permitted to die in the faith.<br />\nAfter the Governor had ceased speaking, the Carolina students in the gallery called for Strayer, the alternate of the Hopkins team, who expressed, on<br />\nbehalf of the team, their appreciation of the hospitality which they had enjoyed.<br />\nWhen the decision had been announced and congratulations had been exchanged,<br />\na carriage conveyed the Hopkins men to the residence of Professor Gore, where<br />\nthey were introduced to Governor Aycock, President Venable, the judges of the<br />\ndebate, the professors and their wives, and many of the Carolina students who<br />\nare interested in debating. After they had enjoyed the collation provided, the<br />\nteam returned to the hotel to get a few hours sleep before starting home. ,<br />\nThe members of the Johns Hopkins party unite to express high appreciation<br />\nof their reception and entertainment at Chapel Hill. They all declare that their<br />\npersonal acquaintance with the traditional cordiality and hospitality of Dixie<br />\nfarther South has been most pleasantly enlarged.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\na<br />\n<br />\nTRUSTEES VISIT OTHER UNIVERSITIES.<br />\nwill be remembered that at the Commemoration Day exercises, Preside<br />\nnt<br />\nRemsen, in speaking of Homewood, said that as many of the trustees as<br />\ncould leave would go this Spring upon a tour of investigation to learn<br />\nwhat<br />\nother universities could teach them for the development<br />\nof the Homewood land.<br />\nAccordingly a party of the trustees, consisting of Dr. Remsen, Messrs.<br />\nR. Brent<br />\nKeyser, John Gill, Blanchard Randall, Lewis N. Hopkins, and<br />\nEugene<br />\nLevering, visited the University of Virginia several weeks ago. They<br />\nwere<br />\ncordially received and brought back many pleasant impressions of the<br />\ntrip.<br />\nThe University lands and buildings were inspected by them, and<br />\nthey secured<br />\nmany suggestions which will be helpful in the development of<br />\nHomewood.<br />\nIn a few days, perhaps early next week, the trustees will visit<br />\nColumbia,<br />\nPrinceton, University of Penna., Haverford and Bryn Mawr, with the<br />\nsame<br />\nPurpose in view. Still later, at a time not yet determined upon, Harvar<br />\nd, Yale<br />\nand other Northern universitites will be made fields of further<br />\nstudy.<br />\nSt.<br />\nLouis, too, may be visited, though the trustees are doubtful of this trip.<br />\nWashington University, the St. Louis institution now attracting the general<br />\nnotice of<br />\nadvanced educators in the United States, has now to deal with practically the<br />\nsame problem that confronts Johns Hopkins. The university<br />\nhas lately been<br />\ngiven a large plot of land, and the conditions of the gift are quite<br />\nsimilar to<br />\nthose under which Homewood recently came into the possession of<br />\nJohns Hopkins. Washington, however, is more fortunate than Hopkins, since several<br />\nof<br />\ntheir buildings are erecting for the use of the approaching Louisia<br />\nna Purchase<br />\nExposition, and at the close of the Exposition they will be turned over to the<br />\nUniversity.<br />\nPresident Randall, of Washington, has written to Dr. Remsen<br />\ninviting the trustees to visit his University, and learn how their mutual proble<br />\nm<br />\nis met out there. The only thing that prevents the trustee<br />\ns from accepting the<br />\ninvitation is the length of the trip to St. Louis, which would consume more<br />\ntime than they feel able at present to give to it.<br />\n- The trouble to which the trustees are putting themselves to in order to have<br />\nthe benefit of expert counsel is a guarantee that the final result will<br />\nbe the best<br />\nthat the most careful thought can devise. President Remsen, in speakin<br />\ng of<br />\none of the most urgent needs of the University, an athletic field, gives<br />\nfurther<br />\nemphasis to this same purpose on the part of the University trustees.<br />\nHe<br />\nseems to recognize quite fully the general desire on the part of undergraduates<br />\n,<br />\nand many of the graduate students and alumni, for an athletic field<br />\nthat will be<br />\nHopkins's own. The unsatisfactory and unprofitable shifts which the University<br />\nathletic teams are now obliged to make between Electric Park, Maryland Oval,<br />\nDruid Hill, and the city base ball park are probable quite as well understood<br />\nby<br />\nDr. Remsen as by the managers of the teams themselves. The trustees,<br />\nindeed,<br />\nhave even sought preliminary plans for an athletic field in advance of the other<br />\ndevelopments of Homewood. With these plans in hand, however, it has seemed<br />\nwiser to them to stay the work, lest anything that might be done before the<br />\ngeneral scheme of extension into \"The Promised Land,\" has been decided by<br />\nmature judgment would have to be undone.<br />\n<br />\n'r<br />\n<br />\n5<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n6<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\n<br />\nHOPKINS UNIVERSITY.<br />\nMAY 7, 1903.<br />\n<br />\nSubscription $1.50 per year.<br />\n<br />\nGEORGE A. FOSTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br />\n<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br />\n<br />\nH. V. MORSE, 1905.<br />\n<br />\nAssistant News Editors,<br />\n<br />\nc J. NEWMAN NUMSEN, 1904.<br />\n<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\n10 Cents a single copy.<br />\n<br />\n.<br />\n<br />\nHARRY BAETJER, 1908.<br />\n. Ricium BUCKLER, 1904.<br />\n<br />\nAddress all articles, communications, etc., to GEORGE A. FOSTER, box 195, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETJER,<br />\nU.; or box 398. Medical Department of the Johns Hopkins University.<br />\nH.<br />\nJ.<br />\n<br />\no<br />\nl g V its victory over Swarthmore on last Saturday, the University lacrosse<br />\nteam is once more entitled to the proud distinction of being The Intercollegiate Champions of the United States.\" Winner of the championship<br />\nfive times in six years is a record that would be hard to surpass. This year the<br />\nhonor was not won without the hardest kind of work, and for this reason every<br />\nman connected with the team deserves all the more credit. At the beginning<br />\nof the season the chances for another championship team seemed slight indeed.<br />\nThe loss of such lacrosse players as Abercrombie, Briscoe, Bernheim, Sayler, and<br />\nCaptain Schmeisser seemed too great to be overcome, and predictions were made<br />\nthat with the material on hand the University could not develop a first class<br />\nteam for 1903. Nothing daunted, however, .Captain Straus and Coach Abercrombie set to work to develop a team that would stand comparison with those<br />\nof former • years. From the beginning the men were impressed with the fact<br />\nthat steady, consistent work was absolutely necessary. The 1903 championship<br />\nbanner that will soon be hung in the trophy room bears witness of their success.<br />\nThough the Intercollegiate lacrosse season is ended, there are some more<br />\nhonors that the team is trying for, . On Saturday, the Crescents, the - Athletic<br />\n<br />\n\fTHE NEWS LETTER.<br />\nChampions of the United States, will play the University, and without question<br />\nthe game will be one of the best seen in Baltimore for some time. The Crescents have not forgot their defeat two years ago, and according to report, are<br />\ngoing to bring to Baltimore some of the best lacrosse players in the country. The<br />\nUniversity team is just as determined to win, and make the year an unbroken<br />\nline of victories.<br />\n<br />\nHE joint concert of the Woman's College and the University Musical<br />\nClubs to be given on Saturday night for the benefit of the Lawrence<br />\nHouse Mission, deserves the support of every Hopkins man. In another<br />\ncolumn is given an account of how the mission carries on its work. Clearly an<br />\nobject more worthy of the united assistance of all cannot be found. Since the<br />\nwork done by the mission is very great, the opportunity for assisting in this work,<br />\nand at the same time being agreeably entertained, should be taken advantage of.<br />\nA number of students give practical aid to the mission by taking charge of classes.<br />\nHowever, this is not all that is needed; financial help is absolutely necessary to<br />\ncontinue the work. For this reason, the management hopes to have even a<br />\nlarger attendance at the concert than last year, when a considerable sum was<br />\nturned over.<br />\n<br />\ne<br />\n<br />\n'l' length, after many months of hard work, the long-suffering editors of the<br />\n1903 Hullabaloo are ready to announce what will be the special feature.,<br />\nof their book. From their description, this \"Hullabaloo\" bids fair to be<br />\none of the best and most interesting ever brought out by the students of the<br />\nuniversity.<br />\nIn the first place, the cover will be black and blue, divided diagonally,<br />\nwith the class flag showing the class colors, olive and white, in one corner.<br />\nAnother of Brook Levering's allegorical color-pieces is promised. The leader:<br />\nwill be two in number, a departure from former \"Hullabaloos\"—the first by W.<br />\nW. Willoughby, Ph. D., Associate Professor of Political Science, the second by<br />\nDr. E. L. R. Gould, Chamberlain of New York •City. The peculiarly interesting feature of these leaders is that they are articles in which specialists aro<br />\nspeaking of their specialty—\"talking shop,\" as it were.<br />\nThe order of the classes is reversed, the Sub-freshmen coming first and the<br />\nSeniors last. In connection with the class lists, there are some amusing drawings<br />\nshowing the progress from the innocence of the Sub-freshman to the dignity of the<br />\nSenior. The fraternity drawing is a striking one by McKee Barclay. The<br />\nmembers of the fraternities not having chapters at the University have been carefully and thoroughly worked up. An excellent idea in connection with Athletics<br />\nis that on the page opposite each team picture are the description and personnel<br />\nof the team. A complete and detailed list of all the \"H's\" and \"H. A. A.'s\"<br />\nof<br />\nin the university, has for the first time been compiled. As for the \"stunts,\"<br />\n<br />\nZ.<br />\n<br />\n\fS<br />\n<br />\nTHE NEWS LETTER.<br />\n<br />\n--several pages are devoted to the opinions of the members of the class on things<br />\nin general (including \"girls\") and to the votes of the class on the various qualifications of certain of the members. These begin the \"stunts\" proper which<br />\ncover about sixty-seven pages.<br />\nHowever, the features of the book on which the board has worked hardest<br />\nand put forth its best efforts are the drawings of girls and the music. The<br />\nboard has been fortunate in obtaining from several prominent New York artists<br />\n—C. Alan Gilbert, W. Granville-Smith, and others—drawings in which are<br />\nshown \"Hopkins Girls,\" more charming and beautiful than their avowed worshipers could imagine. The best thing about these pictures is that they are distinctly not amateurish.<br />\nThe Song Book, comprising eight songs with music, will make the \"Hullabaloo\" of especial interest to alumni,since the songs given are those which are and<br />\nhave been most sung by University students. This Song Book is the first that<br />\nhas'ever been published at the Hopkins, and it is hoped that this small beginning<br />\nmay lead to better things in this line.<br />\nIt is hoped by the editors that the \"Hullabaloo\" will be out by the 15th of<br />\nMay, but this depends on Providence and the printers. In bringing out the<br />\n\"Hullabaloo\" the board has had a trouble with which former boards have not<br />\nbeen afflicted—they have had to solicit their advertisements, instead of the publisher taking charge of this side of the book. However, by the remarkable<br />\npush and ability of \"Billy\" Bird, this financially important feature has been excellently handled. In conclusion it is only necessary to say that the 1903 \"Hullabaloo\" will undoubtedly be a credit to Lanier, Tootle and the other members<br />\nof the editorial staff.<br />\n<br />\nHULLABALOO ELECTIONS.<br />\nFTER long delay and extensive electioneering, the Junior class held a<br />\nmeeting last Thursday to elect editors for the 1904 \"Hullabaloo.\" It took<br />\nsome time to elect the editor-in-chief and his assistnant, as the election of<br />\nthese officers was fraught with much heat. The fitness of each nominee was proclaimed by his supporters with loud, plausible, and unconvincing arguments.<br />\nFinally, after considerable spirited .discussion, Reginald S. Opie was chosen<br />\nOf the<br />\neditor-in-chief, and Ralph 0. Fucrbringer, associate editor-in-chief.<br />\nten candidates for the associate literary editors, the following were elected: G. A.<br />\nFoster, J. C. L. Hawkins, W. L. LeCron, H. S. Lloyd, C. H. Saylor, and Frank<br />\nStollerwerck. Henry Evans was unanimously elected art editor. The Business Manager is J. L. Bennett; the assistant Business Managers are R. Gordon<br />\nDulaney and Sydney C. Erlanger.<br />\n. It is to be hoped that the interest which the class has shown in these elections<br />\nis an earnest of the help which they will give the board next year in bringing<br />\nout a \"Hullabaloo\" which will be up to the standard set by the best of<br />\nits predecessors.<br />\n<br />\n4<br />\n<br />\n\fTHE NEWS LETTER.<br />\nBALTIMORE'S NEXT MAYOR.<br />\n<br />\nOHNS HOPKINS has developed her first mayor. She has entertained a<br />\ngood many mayors at her publiic gatherings in the past, but never one of<br />\nher own. When the Hon. Robert M. McLane makes his bow at the<br />\nnext commencement exercises, the distinguished assembly will be receiving the<br />\nsalute of the member of the class of 1887. His salute will doubtless be returned<br />\nin the proper spirit.<br />\nBaltimore's mayor-elect prepared at Mr. Marston's School, entering the University in the Fall of 1884. He took the classical course, and during his entire<br />\nundergraduate career was a leader in his classes. From his Freshman year until<br />\nhis graduation, Mr. McLane held honorary scholarships, and graduated with high<br />\nhonors. He was, however, no \"grind,\" but had the happy faculty of getting at<br />\nthe gist of his studies without much work. In the eighties there were not so<br />\nmany athletic teams as there are to-day, and Baltimore's mayor went for nothing<br />\nmore strenuous than tennis, at which game he was a player of more than ordinary<br />\nability. A gentleman who was at the University with Mr. McLane, says that he<br />\nenjoyed a good joke, and always had a ready line of stories, which he told in a<br />\nmost entertaining manner. He was always one of the best dressed men about the<br />\nUniversity. By many, Mayor McLane is remembered as a 'clean cut, faultlessly<br />\ndressed chap, who always had a pleasant smile, and a cheerful word for his companions, but who did not mingle much with them. In those days he cared little<br />\nfor the society of women, a habit which seems never to have left him.<br />\nAfter leaving the University Mr. McLane followed the usual course of<br />\nstudies suscribed by the Maryland University's faculty, and became a member of<br />\nthe Baltimore bar. About four years ago he was elected State's Attorney on the<br />\nDemocratic ticket. He now leaves the Criminal Court for the City Hall.<br />\n<br />\n3<br />\n<br />\nTURIN BULL LECTURES 1903 04.<br />\n<br />\nThe lectures on the Percy Turnbull Memorial Foundation for the academic<br />\nyear 1903-04 will be given by Count Angelo de Gubernatis, Professor of Italian<br />\nLiterature in the University of Rome.<br />\nThe lectures will be eight or nine in number, and the subject will be the<br />\n\"Poetry of the Italian Renaissance.\" The lecturer will speak in French.<br />\nCount de Gubernatis is Professor of Italian Literature in the University of<br />\nRome; General Secretary of the Italian Oriental Academy; the author of numerous literary, historical, and dramatic works; Italian correspondent of the<br />\nAthenaeum and the Contemporary Review, London, the International Review,<br />\nVermont, and other papers.<br />\n<br />\n\f10<br />\n<br />\nTI1E NEWS LETTER.<br />\nUNIVERSITY NOTES.<br />\n<br />\nDr. L. S. Hulbert, who has bccn ill with typhoid fever, is convalescing.<br />\nDr. A. Marshall Elliott will sail in :June for the other, side, and will spend<br />\nthe summer abroad.<br />\nDr. Bower, of Washington, delivered a lecture in the Physical Laboratory,<br />\nMonday, April 27th, on \"Terrestial Magnetism.\"<br />\nDr. Bower also gave the<br />\nstudents interested in the subject a chance to pursue the actual experiments at<br />\nFort McHenry.<br />\nSaturday, May 9th, Dr. Paul Haupt will sail from New York for England,<br />\nwhere he will visit Oxford and Cambridge, after which he will travel in Germany.<br />\nAt the meeting of the National Academy of Sciences held in Washington,<br />\nApril 22nd, President Remsen was elected vice-president of the Academy. Prof.<br />\nSimon Newcomb was elected foreign secretary to succeed President Remsen.<br />\nProf. W. H. Welch was elected a member of the Academy council.<br />\nDr. Norman MacLeod Harris, associate in bacteriology, has resigned from<br />\nthe Medical School and has accepted a position as assistant to Dr. Jordan, professor of bacteriology at the University of Chicago.<br />\nAt the meeting of the Eastern Teachers' Art Association, held in McCoy<br />\nHall, an address of welcome was delivered by Dr. Geo. B. Shaddock. An attractive exhibit of tie work of the school children in several towns and cities<br />\nthroughout the country was arranged in the main hall. The drawings called<br />\nforth much favorable comment from visitors.<br />\nDr. Florence R. Sabin, an assistant in anatomy at the Medical School, has<br />\nwon the prize of $1,000. offered two years ago by the Association for the Promotion of Scientific Research by Women. Dr. Sabin's paper is on the \"Origin<br />\nof the Lymphatic System.\" Dr. Sabin received her M. D. at the Hopkins in 1900.<br />\nDuring her course she held the fellowship in anatomy, and after her graduation<br />\nshe was appointed instructor. Recently, she was offered the professorship of<br />\nanatomy at the Woman's Medical College in London, but she declined, preferring<br />\nher present work at the Hopkins.<br />\nAt a recent meeting of the American Institute. of Social Service, Mr. Robert<br />\nGarrett, Dr. Albert Shaw, and Dr. E. R. L. Gould were appointed members of<br />\nthe American committee which is to co-operate with the sociological workers of<br />\nthe other countries in the International Housing Congress, to be held in Paris,<br />\nfrom July to November next. The congress is to be under the patronage of the<br />\nFrench government. It will discuss the importance of inaugurating preventive<br />\nmeasures against the spread of tuberculosis and alcoholism..<br />\nAt the meeting of the .M edical and Chirurgical Faculty, papers were read<br />\nby Drs. William H. Welch and Henry B. Jacobs. Dr. Welch spoke chiefly about<br />\nthe methods employed in New York for the prevention of tuberculosis. Dr.<br />\nJacobs read a paper on \"Our Need of a Mountain Sanitarium for Indigent<br />\nConsumptives.\" Other papers were read by the following Hopkins men: Drs.<br />\nW. S. Baer, T. R. Brown, H. O. Reik and S. R. Hirshberg. Professor R. W.<br />\nWood also delivered a lecture on \"Colored Photography.\"<br />\n•<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n11<br />\n<br />\nDr. Harry C. Jones has recently begun a series of weekly lectures on advanced inorganic chemistry from the physical standpoint.<br />\nThe lectures are<br />\nalong the line laid down in his \"Principles of Inorganic Chemistry,\" published<br />\nseveral months ago.<br />\nDr. Norman MacD. Harris, associate in bacteriology, has revised and edited<br />\nan American edition of the \"Manual of Bacteriology,\" by Doctors Muir and<br />\nRitchie. The book is published by the Macmillian Co.<br />\nDr. Gamgee, the distinguished professor of physiology at Owens College,<br />\nLondon, and Dr. Walter Jones of the Medical School, are to carry out a joint<br />\nresearch on the relation between the nucleins and nucleo-proteids.<br />\nThe two<br />\nscientists expect to make valuable discoveries in this new field by means of the<br />\npolariscope.<br />\nThe Lawrence Memorial Association held a meeting in McCoy Hall on Al ay<br />\n4th. An illustrated lecture on \"Settlements\" was delivered by Dr. William H.<br />\nTolman, director of the American Institute of Social Service, and an address<br />\nwas made by Mrs. Vladimir G. Sinikhovitch, director of the Greenwich House,<br />\nNew York.<br />\n<br />\nTHE PHI BETA KAPPA ELECTIONS AND BANQUET.<br />\nT the annual meeting of the Maryland Alpha Chapter of the Phi Beta<br />\n<br />\n4<br />\n<br />\nKappa Fraternity, held on April 22nd, the following men were elected to<br />\nmembership in the Society:—<br />\nGraduate Students: G. 0. Berg, T. C. Foote, F. H. Getman, L. G. Horton,<br />\nA. Johannsen, R. D. Miller, W. T. Pierce, J. E. Routh, Jr., A. W. Smith.<br />\nCandidates for A. B.: James Wallace Bryan, John Coffey Hildt, Robert<br />\nSampson Lanier, William Urwick Murkland, Joseph Tate Smith, G. Drayton<br />\nStrayer.<br />\nThe following officers were elected: President, Prof. A. Marshall Elliott:<br />\nVice-president, Prof. Paul Haupt; Treasurer, Dr. C. Carroll Marden ; Secretary, Dr. J. Elliott Gilpin.<br />\nThe annual banquet was held on the 1st of May, in the Donovan Room,<br />\nMcCoy Hall. The speeches were excellent, that of President Remsen being of<br />\nespecial interest to, the members of the University. He responded to the toast,<br />\n\"Our University.\" After a few words about the million-dollar fund, Dr. Remsen said that the University expects to put up at Homewood, not \"palaces,\" but<br />\nbuildings plain, imposing and of good architectural style ; that the University will<br />\nmove out to Homewood as a whole, not in parts; that the project of having an<br />\nathletic 'field at Homewood before the University is built up there is impracticable, as no part of the estate is accessible for exhibition purposes.<br />\nProfessor Perrin, of Yale, spoke of the importance of Phi Beta Kappa in<br />\nPhilosophical life ; Mr. 'Bonaparte spoke of the good influence of Phi Beta Kappa<br />\nin political life.<br />\n\"Goo! goo!\" said the baby as he stuck his finger in his father's old pipe.<br />\n—Widow.<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS LETTER.<br />\nTHE LAWRENCE HOUSE CONCERT.<br />\n<br />\nt<br />\n<br />\nli E, second annual joint concert by the Woman's College and Johns Hopkins University Musical Clubs will be given in McCoy Hall, on Saturday, May 9th. The performance is for the benefit of the Lawrence House<br />\nSocial Settlement, and it is hoped that the student body will be sufficiently interested in this work to aid in the success of the concert.<br />\nThis sort of work in the lower sections of the city is from its very nature<br />\nsuch as to gain but little publicity, and it may be of interest to note briefly a few<br />\nof the salient facts in regard to the methods employed in uplifting and bettering the conditions of the poorer classes.<br />\nIn order to be in touch with the people among whom the work is to be acThis<br />\ncomplished, a house has been purchased on West Lombard Street.<br />\nhouse has been made as attractive and home-like as is possible under such conditions. Classes have been organized, which meet regularly. Many of these<br />\nclasses have formed themselves into clubs with officers and definite exercises for<br />\neach night. As far as possible, the growing boys are given some knowledge of<br />\nparliamentary law and by contact with men of training and culture are gradually<br />\nled to form standards of conduct, which in many cases have changed the drift of<br />\ntheir lives. The girls are taught needlework and practical housekeeping, and<br />\nevery helpful influence is thrown around them.<br />\nThe classes are under the supervision of Miss Alice E. Robbins, who has<br />\nlearned through practical experience in the slums of New York and London,<br />\nhow to grapple with the many problems that are being continually presented.<br />\nThe management of the settlement is vested in a board of managers, of which<br />\nM r. Robert Garrett, a former student of this university, is president. Associated<br />\nwith him are representatives from the various colleges of the city and others interested in the welfare of the poorer classes.<br />\nThis is a summary of the general idea of the settlement and it must be seen<br />\nhow vital the work is. The expenses are met through voluntary subscriptions,<br />\nand the success of the concert means that one of the chief sources of revenue will<br />\nnot be curtailed. This statement should be a sufficient appeal to those of philanthropic mind, while a mention of the attractiveness of the programme should<br />\ninsure the presence of all others. There need be no comment made concerning<br />\nthe members of the Woman's College Glee and Mandolin Club, for they are<br />\nknown to all. The quartet from the Medical School will have some new songs,<br />\nwhich should cheer even the most melancholy. Arrangements to hold an informal reception at the close of the concert are under consideration by the committee in charge.<br />\nA pious young person is Evelyn,<br />\nBut eggs she is constantly devillin,<br />\n'Twould make me feel sad<br />\nTo send eggs to the bad,<br />\nBut I revel in evil in Evelyn !—Tiger.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n13<br />\n<br />\nATHLETICS.<br />\nLACROSSE.<br />\nHopkins 17—Lehigh 4.<br />\nIn a game that abounded in all sorts of playing- gi )0(1, bad and indifferent—<br />\nthe University twelve defeated the Lehigh team on April 26th, in a contest which<br />\nwas more interesting than the one-sided score-17 to 4—would indicate.<br />\nBoth teams started off with a rush, and at an early stage it looked as if the<br />\nvisitors were going to make the 'Varsity team play hard in order to win. They<br />\nshot two goals in rapid succession, but their joy was short lived, for after ten<br />\nminutes of play the superior skill and endurance of Hopkins became evident,<br />\nand the \"rooters\" were kept busy counting up the score.<br />\nLehigh played a<br />\nPlucky game throughout, but they were clearly outclassed by the superior playing<br />\nof the University men.<br />\nCaptain I,attig and George R. Bailey were the star players for the visitors.<br />\nLattig did as fine individual playing as anyone on either side, and to the manner<br />\nin which he handled his men is largely due the fact that Lehigh scored her goals,<br />\ntwo of which he himself shot.<br />\nBailey is a Baltimore boy, and for several<br />\nyears was prominent in athletics in this city. IIis work at point spoiled many<br />\ngood plays of Hopkins, which might have resulted in more goals.<br />\nFor Hopkins, Captain Straus, Putts, Bernheim, Matthai and Schmeisser did<br />\nespecially fine work, although every man on the team deserves credit for so decisive a victory.<br />\nOne of the prettiest plays that has been seen this season occurred in the first<br />\nhalf. The ball was near Hopkins goal when Schmeisser made a pretty catch and<br />\nthrew the ball far down the field to Tough. The ball was then rapidly passed<br />\nto Matthai, Bird, Dill, Bernheim and Putts, who threw goal. The ball had come<br />\nall the way from point to goal without Lehigh being able to break the play.<br />\n<br />\nHopkins 6—Swarthmore 4.<br />\nY defeating the Swarthmore lacrosse team, 6 to 4, on their home grounds<br />\nlast Saturday, the Johns Hopkins twelve remains champions of the Intercollegiate League for another year. The game was one of the hardest<br />\nfought that has ever been witnessed upon a lacrosse field, and Hopkins did not<br />\nclinch it until within the last two minutes of the second half.<br />\nA very gratifying feature of the game was the presence of so many Hopkins rooters on the field, and the yelling of friendly voices greatly encouraged<br />\nthe University men to victory. While not all of the rooters were Baltimoreans,<br />\na large number did go from this city, and the character of the game was a sufficient reward. Many sympathizers went over from Philadelphia and Wilmington,<br />\nand waved the black and blue flags as proudly as if Baltimore was their home.<br />\n<br />\n§<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS LETTER.<br />\n<br />\nEvery man on the team did his best and covered himself with glory, so that<br />\nit is hard to say who deserves the most credit. Foster was probably the most<br />\nprominent man on the field. He appeared to be everywhere at once. Whenever a man was blocked or a ball passed, \"Fred\"was right on hand to do the work.<br />\nDuring most of the game he was on the attack, but owing to the dropping out<br />\nof a Swarthmore man, who was slightly injured, and the consequent dropping<br />\nof a Hopkins player, he was moved down to the defense.<br />\nP. Straus at goal made some remarkable stops. Time and again the ball<br />\ncame flying toward him, and time and again did he succeed in keeping it from<br />\ngoing between the posts. In the early part of the game he had chances enough to<br />\nshake any goal-keeper's nerve. Four stops, three of which were quite difficult,<br />\nwas what Straus was called upon to do within less than three minutes.<br />\n\"Billy\" Bird was once more among the foremost of the players. His beautiful catching and accurate throwing, especially in the second half, when he let<br />\nhimself out, did much in keeping the ball in the enemy's territory. The body<br />\nchecking and heady playing of Matthai and Tough were very effective in breaking up the plays of Swarthmore.<br />\nCaptain Henry Straus, Schmeisser and Blanck, were the bulwark, as usual,<br />\nfor the defense, and Custis also did well. Of the attack men, Rosenheim did<br />\nsplendid work. He played his position like an old hand, and it was due to his<br />\nheadiness that the last goal was scored. When Bernheim was so well covered<br />\nby his opponent that he could not take the ball when passed to him by Bird,<br />\nRosenheim backed him up beautifully and threw goal, thus clinching the victory<br />\nfor Hopkins.<br />\nPutts again distinguished himself by throwing four of the<br />\nsix goals.<br />\nFor Swarthmore, the defense put up the best game. In fact, if their attack<br />\nhad been as strong as their defense, the story might have been different. It is<br />\na significant fact that all of Hopkins's points were made in the east goal, where<br />\nthe sun was in the face of the defense men. Whenever they changed, the team<br />\ncould do absolutely nothing in the way of scoring.<br />\nCaptain Beans, who played in-home, is probably the best player Swarthmore<br />\nhas had in years. His passing and body checking were excellent, and his throwing was faultless. His record was almost equal to that of Putts, as he scored<br />\nthree of the four goals made by his team.<br />\nAt no time during the game wm Swarthmore in the lead. Hopkins threw<br />\nthe first goal, but her opponents scored shortly afterwards. The 'Varsity succeeded in making two more goals before Swarthmore made one, but before long<br />\nthe score was again tied. Just after Hopkins made her fourth goal, Swarthmore<br />\nrepeated the performance. At last, just before the end of the first half, the<br />\nUniversity team drew away from its rivals, and the half ended 5 to 4.<br />\nNot<br />\nanother goal was scored by either side until within the last two minutes of the<br />\ngame, when Rosenheim clinched the victory.<br />\n\"The Senator is a self-made man.\"<br />\n\"And a machine-made Senator.\"—Tiger.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n.15<br />\n<br />\nTRACK TEAM.<br />\n<br />\nt<br />\n<br />\nHE Relay Team returned home from the University of Pennsylvania games.<br />\nof April 25th, without the customary banner, it is true, but with a feeling<br />\nof satisfaction at having made a very Creditable showing in the race for<br />\nthe \"Middle States Championship.- A victory was scarcely to be expected, although hoped for ; but the general opinion prevailed that second place in first<br />\nclass company is more desirable than first place in second class company.<br />\nOwing to a heavy track, caused by improvements that are being made, the time<br />\nfor all events was somewhat slow, but Hopkins was especially handicapt)ed by<br />\nthe fact that the race was run in a different direction from that which our runners had been accustomed to, the men thus being compelled to make the turns to<br />\nthe right, instead of to the left.<br />\nThe Middle States championship relay race was the nineteenth event. Freese<br />\nstarted for Hopkins, and finished third. Hoffman was the next man, and by good<br />\nrunning pulled up to second place, with Bucknell a good distance in the lead.<br />\nEngland ran third, and made the distance between Bucknell and Hopkins' still<br />\nsmaller. Tootle was the last man. He ran a beautiful race, closing up the<br />\ngap splendidly and finished a close second. Dickinson came in third. BUcknell's<br />\ntime was 3 minutes, :37 2-5 seconds.<br />\nIn the high jump, Dr. Geo. B. Scholl tied with a Syracuse man for second<br />\nplace at 5 feet, 10 inches, and won the toss of the coin.<br />\n<br />\nIt is scarcely necessary to account for the absence of news in this issue concerning the Dual Meet with Virginia. As THE NMS-LETTER goes to press<br />\nsome days before the meet, it is impossible to give an account of the games, and<br />\nat the same time it is inadvisable to forecast any events, as all the results will be<br />\nknown when this issue appears.<br />\n<br />\nALUMNI NOTES.<br />\nJames Alfred Kennard, '9S, will he married to Miss Margaret Ridgeley, on<br />\nJune 3rd.<br />\nW. S. Weedon, Ph. D., '02, visited the university on Monday.<br />\nDr. Florence Bascom, '93, who has been associate professor of geology at<br />\nBryn Mawr, has been appointed professor. Her assistant will he Dr. Benjamin<br />\nL. Miller, who received his degree at the university last February.<br />\nDr. Councilman, who was assistant professor of pathology at the university<br />\nfor several years, and who is now professor of pathology at the Harvard Medical<br />\nSchool, has announced his discovery of the small-pox germ.<br />\n<br />\n\fTHE NEWS LETTER.<br />\nGeorge S. Brown, '93, was elected to the Second Branch of the City Council<br />\nfor the Fourth District, on Tuesday. Though Mr. Brown was not backed by<br />\nthe Democratic organization, he received a larger majority than any of the other<br />\nsuccessful candidates.<br />\nAlfred W. Bruton, one of the best known and most popular members of<br />\nthe class of 1901, met death by drowning in the Charles River, Massachusetts,<br />\non last Friday afternoon. Along with a companion, he was canoeing, when a<br />\ngust of wind struck the canoe, overturning it, and Bruton was drowned before<br />\nhelp could reach him. Bruton was a student at Boston Tech., and would have<br />\nreceived his degree in Engineering in June. During his three years at the University he played on the football and lacrosse teams,and was one of the best players<br />\nat Hopkins. Almost all the members of the athletic teams from 1898 to 1901,<br />\nas well as many students, were present at the funeral services, which took place<br />\non Monday afternoon.<br />\nAt a meeting of the Athletic Association, held on Monday morning, the following resolutions were adopted:<br />\nWhereas, It has pleased an all-wise Providence to remove from our midst<br />\nour friend and fellow-student, ALFRED WILLIAM BRUTON., and<br />\nWhereas, He was a prominent member of the Johns Hopkins Athletic Association, and had endeared himself to all of us by his manly qualities and friend'ship, therefore,<br />\nBE rr RE;soLvED, That we, the members of the Johns Hopkins Athletic Association, mourn his loss and extend our deepest sympathy to his bereaved family,<br />\nand be it<br />\nRESOLVED, That a copy of these resolutions be spread upon the minutes of<br />\nthe Athletic. Board of the Johns Hopkins Athletic Association, published in<br />\nTHE NEws-I,ErrER, and a copy be sent to the family.<br />\nEDWARD RENO UF,<br />\nHENRY A. CONVERSE,<br />\nR. CURZON HOFFMAN, JR.<br />\nFor the Athletic Association.<br />\nBehold the way the Freshman works;<br />\nNo task there is 'he ever 'shirks:<br />\nWith dictionary, text and trot,<br />\nFew are the things Which he knows not.<br />\nThe Sophomore drops the first of these;<br />\nThe trot alone's enough to please<br />\nWheneler it with the, text agrees.<br />\nThe Junior drops the text,<br />\nAnd reads the trot when called on next.<br />\nThe Senior bluffs.<br />\n<br />\n—Record.<br />\n<br />\n\fOPEN ALL NIGHT.<br />\n<br />\nWILLIAXSON 0 WATTS,<br />\nr,33)rt13 $tores,-,<br />\nHoward and Franklin Streets.<br />\n<br />\n'Baltimore and Eutaw, Streets.<br />\n<br />\n1Druch3, fancy Goobs. Perftunsy, Collet Erticles, Cioaro,<br />\n<br />\nTHE CHEAPEST<br />\n<br />\nPLACE<br />\nIN BALTIMORE FOR<br />\n<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br />\n<br />\nH. S. WRIGHT & CO•<br />\n704 MADISON AVE.<br />\n'<br />\n/<br />\n1<br />\n47V it<br />\n<br />\nC. & P.'Phone 3350- 1'..4-1<br />\n<br />\nHENRY N. BRUNS,<br />\nDrawing Materials.<br />\nMathematical and Surveying Instruments,<br />\nDraughtsmen's and Engineers' Supplies<br />\nN. W. Corner<br />\nLexington and Liberty Sts.<br />\n<br />\nISALTIMORE,PAD.<br />\n<br />\nAgent for Eeuffel 4- Esser Co., of New York.<br />\n<br />\nf...4 I<br />\n<br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br />\n<br />\nIT<br />\n<br />\ns<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\n<br />\nText Books, Note Books, —<br />\nMadison<br />\nStudents' Supplies.<br />\n<br />\n& Howard Sls.<br />\n<br />\nincorporated 187M.<br />\n<br />\n\"nes Strongt as the Stfohaest.\"<br />\n<br />\nTRE FIDELITY MUTUAL LIFE INSURIINGE GO.,<br />\nOF PH.ILEVDEL,PI-HA..<br />\nAN EXCELLENT OPPORTUNITY is offered Students and Teachers to write Insurance for THE<br />\nFIDELITY, either during vacation or permanently.<br />\nFor Agency in Maryland or West Virginia,<br />\n<br />\nAddress,<br />\nC. CRAIIAM, Manager<br />\n806 8 Merchants Bank Bldg., Baltimore, Md.<br />\n<br />\nFor Advertising Space in this Paper<br />\nAPPLA\"r0<br />\n<br />\n1<br />\nLIGHT & LOMBAR<br />\n<br />\nST..,<br />\n<br />\nPUBLISHERS.<br />\n<br />\n\"Ti7<br />\n! N<br />\n<br />\n1,1,1'rN W.:1411<br />\n<br />\nUNION<br />\nTHEOLOGICAL<br />\nSEMINARY<br />\n700 Park Ave<br />\nNew York<br />\n<br />\nI. I.<br />\nEquipped for<br />\nScholarly and Practical<br />\nwork, in the midst of the<br />\nChristian enterprises of a<br />\ngreat, city, in close academic<br />\nrelations with Columbia and New York Universities, offers opportunities for the<br />\ndegrees of M. D., A. M. and<br />\nPh. D.<br />\nOpen on equal terms to<br />\nstudents of all Christian<br />\nbodies.<br />\n<br />\nFF<br />\n<br />\nSIXTY-BIGfiTti YERR<br />\nbegins September 23, 1903.<br />\nAddress the President of<br />\nthe Faculty, the<br />\n<br />\nRey, Charles 0. Ball, D. D.<br />\n<br />\n\fGOP1101$300,000. SUMS 0116 undiviged PI0111 S400,000<br />\n<br />\nSTIEFF PIANOS<br />\n<br />\nDrovers sc<br />\n<br />\nMADE or min ufrasr MATERIAL\" MONEY<br />\nAP41/1 INXII.14IRIVINC)113 ('AN<br />\n<br />\nJUL<br />\nWAHNHoommi 9 N. LIBERTY ST.<br />\n<br />\nBooksellers and<br />\nStationers.<br />\n34 W. BRLTIMORE STREET.<br />\n<br />\nSchool, Law, Medical, Glassical and Miscellaneous Books.<br />\nKvp constantly on hand the Text Books used<br />\noi Johns Hopkins University and the Woman's<br />\nCollege of Baltimore.<br />\n5t,<br />\n!k<br />\nilk<br />\nSTfITIONBRY —For School, Pamily, Office and Bank.<br />\n<br />\nHaberdashers,<br />\nShirts, Nea1 wear,Underwear<br />\nMOOMMINEIMMINI Hosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\nOn Bale TheI H. Pennants,and ail other College<br />\n<br />\nTHOS.BLAKE C<br />\nPennants.<br />\n<br />\n219 EAST BALTIMORE ST.<br />\n<br />\nit General Banking Business Transacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom $3 per year and upward.<br />\n<br />\nFOR<br />\n<br />\nJOKDRN STfIBIDER GO.<br />\n<br />\nMA71718'4'1<br />\n:<br />\n0A<br />\n5VE.<br />\nReads as follows:<br />\nSamples submitted of<br />\nFrench Brandy—no adulterants,no coloring, tine quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong,<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br />\n<br />\nIlgenfritz Studio<br />\nSuccessor to Cummins.<br />\n<br />\nOF<br />\n<br />\nOren Letter fraternitv Jewelrv,<br />\nAND 16<br />\n<br />\nST. PAUL<br />\n<br />\nBALTIMORE,<br />\n<br />\nRecounts Solicited.<br />\n<br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LEHMAN & SON.<br />\n<br />\nA.H. FETTING,<br />\n14<br />\n<br />\nNat'l Bank,<br />\n<br />\nL. Strouse, Vice-PrrNt<br />\nEdw. P. Hayden. Ass't, Cashier.<br />\n<br />\nClark, Prest<br />\n<br />\nChas. S. Miller, Cashier.<br />\n<br />\nGusfuNG sc GomrfiNy<br />\n<br />\nMANUFACTURER<br />\n<br />\nMOGilalliGS<br />\nOf BALTIMORE.<br />\n<br />\n1.)1.7Y.<br />\n<br />\nSTREET,<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n'BALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial Discount to Students.<br />\n<br />\nMD.<br />\n<br />\nPlease Call ant) lExamine our 'Line \"More Purchasing.<br />\nC. & P. telephone 445g.<br />\n<br />\nLibraries arranged and put in<br />\nsr<br />\norder without removal.<br />\n<br />\nJENNINGS & HORSEY.<br />\n<br />\need RUZICKA<br />\n<br />\nPFIRECIIIANr TAILORS,<br />\n<br />\n21 W. PAY<br />\n<br />\nr. :-4er<br />\n<br />\nv:<br />\n<br />\n4<br />\n<br />\nBOOKS ! I<br />\nSECOND=HAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nExchanged.<br />\nBought, Sold and<br />\n<br />\nJ. H. U. Binder.<br />\n<br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE<br />\n<br />\nTHEO. WARNER-<br />\n<br />\nWARNER & CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\n<br />\nPIPPEN'S 1300t1 STORE,<br />\n605 N. EUTFVW ST.<br />\n.<br />\n<br />\nWear the University.<br />\n<br />\nBookbinder,<br />\n<br />\nBaltimore's Largest Old Book Store.<br />\n<br />\nAgents for Lincoln & llennett and<br />\nWalter Barnard's London Huts.<br />\n324 WEST BALTIMORE<br />\nManufacturers of-<br />\n<br />\nand Cassimore Hats. so-<br />\n<br />\nSTREET.<br />\n<br />\nhop k<br />\n<br />\ns Caps<br />\n<br />\nNORM GERMAN LLOYD S. S. GO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\n<br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBRLTIMORE TO BREMEN DIRECT.<br />\n<br />\nfl. SCHUhlfiGfIER Sc GO., General Agents.<br />\n<br />\nFor particulars apply to<br />\n<br />\nJAS. MEIKLE, VICE<br />\nISAAC H. DIXON, PRIEST.<br />\nJAS. R. RICHARDS, TREA•.<br />\n<br />\nTHE<br />\n<br />\nChas. Willms Surgical Instrument Co.<br />\n<br />\nSmith, Dixon Co.<br />\n<br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\n'Baltimore, Md.<br />\n<br />\n29 - 31 S. Charles Sired.<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol. VII, No. 14<br /><br />\nMay 7, Igo<br /><br />\nTHE<br /><br />\nNEWS Ars LETTER<br /><br />\nPUBLISHED BY STUDENTS<br />\nOF<br /><br />\nTHE<br /><br />\nJOHNS HOPKINS UNIVERSITY<br /><br />\nThc Johns Hopkins Presb.<br /><br />\nThe Johns Wadi's Universitu<br />\nBALTIMORE, MARYLAND.<br />\n1.<br /><br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October i, 1902.<br />\nPresident: litA ItEmsEN. Dean of the Medical Faculty:<br />\nWILLIAM H. HowELL. Dean of the College Faculty:<br />\nBowAnn H. GRIFFIN.<br /><br />\nFOR GRADUATE STUDENTS:<br /><br />\n'American Cbanical aournal.<br />\nI. RENSEN, Editor. Monthly, 8vo. Volume<br />\nXXIX in progress. $5 per volume.<br />\n111. 'American journal of ipbilology.<br />\nB. L. G I LDERSLEE V H, Editor. Quarterly. 8vo.<br />\nVolume XXIII in progress. $3 per volume.<br />\n1111.<br /><br />\nID1.<br /><br />\n(a) In l'hilosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br /><br />\nFOR UNDERGRADUATES:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLaboratories.<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nl'harmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br /><br />\nSeminaries.<br />\nGreek.<br />\nLitton<br />\nSanmkrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEng]ish.<br />\nHistory,<br />\nEconomies.<br />\nMathematics.<br /><br />\nDirectors.<br />\nIra liemsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam n K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Osier.<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall MOLL.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. IL Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nUndergraduate Courses (leading to B. A).<br />\nGroups.<br />\nI. claasical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. chemical-Biological<br />\n(leading up to medicine).<br />\n4. Geological-Biological.<br />\n5. Latin-Mathematical.<br />\n6. Historicai-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br /><br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol. XXV).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nAmerican Journal of Philology (vol. XXIII).<br />\nStudies in Historical and.Political Science (vol. XXI).<br />\nModern Language Notes(vol. XVIII).<br />\n, Memoirs from the Biological Laboratory (vol. V).<br />\nContributions to Asayriolo9rcvol. IV).<br />\nTerrestrial Magnetism (vol.<br />\nI).<br />\nUniversity Circulars(vol. XXII).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the A rts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br /><br />\nStubies from tbc 'Biological 'Laboratory.<br />\nVolume V complete. $5 per volume.:<br /><br />\nBro.<br /><br />\nStinnes in 'historical sub 'political Science.<br />\nMonthly. 8vo. Series XXI in progress. $3 per<br />\nvolume.<br />\n3obne lbophins Inniversity Circulars,<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. X XII in<br />\nprogress. $1 per year.<br /><br />\n1111. Johns lbopkin6 bospital Salient'. Monthly. 4to.<br />\nVolume XIV in progress $1 per year.<br />\n11111. Johns 1bophins 130epttal Reports. 4to. Volume X1<br />\nin progress. $5 per volume.<br />\nIX.<br /><br />\nContributions to Essyriology ant, Comparative<br />\nSemitic ipbtIology, (Heitrage %Ur A ssyriologie, etc.)<br />\nVol. IV complete.<br /><br />\nX.<br /><br />\nIlDemOirs from (be Saloalcal 'Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br /><br />\nLibraries.<br />\n105,000 volumes.<br />\nUniversity,<br />\nPeabody Institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br /><br />\nYolasm<br /><br />\n111.<br /><br />\nIL<br /><br />\nInstruction.<br /><br />\n'American Journal of lleathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nX X V in progress. $5 per volume.<br /><br />\nabobern 'Language Votes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVIII in progress. $1.50 per volume.<br />\nX11. journal of 'Experimental fibebicine.<br />\nW. H. WELCH, Editor. Hi-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\n301.<br /><br />\nX111.'American Journal of Insanity.<br />\n11,1,N Ity M. HURD, Editor. Quarterly.4to. $5 per<br />\nvolume.<br />\nX111. ',Reports of flbarylanb (Ideological Survey.<br />\nWILLIAM It. CLARK, Editor.<br />\nU.<br /><br />\nterrestrial IMaanctism sob litmospberic Elecs<br />\ntricity. L. A. BAUER, Editor. Quarterly. Bvo.<br />\nVolume VII in progress. $2.50 per volume.<br /><br />\nV1:111. 'Annual 'Report.<br />\nPresented by the President of the Board of Trueteem, reviewing the operations of the University<br />\nduring the past academic year.<br />\nf11111. 'Annual'Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academia year.<br /><br />\nIn addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simile edition. Edited by J. Bendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS. with A ntilegomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographia Hopkinsiensis. Part I. Philology. Parts<br />\nI-111. Chemistry, Mineralogy and Geology. Parts<br />\nV-V-VI. Physics.Astronoray and Mathematics.<br />\nvo. 30 cents per part.<br />\nS full list of publications will he sent on application.<br /><br />\nCommunications in respect to exchanues and remittanses<br />\nmau he bent to Johns Hopkins rrObb, Baltimore, Md.<br /><br />\nTHE NEWS-LETTER.<br />\nVOL. VII.<br /><br />\nMAY 7, 1903.<br /><br />\nNo. 14.<br /><br />\nTHE GULF BIOLOGICAL STATION.<br /><br />\nt<br /><br />\nHE want of a biological station on the Gulf of Mexico has long been felt<br />\nby American biologists. Until recently no laboratory for the study of<br />\nmarine biology existed south of Beaufort, North Carolina, although<br />\nour southern waters are extremely rich in animal and plant life. So attractive<br />\nhave been the reports of visitors to the Gulf coast, that a strong desire for a<br />\npermanent station has been created, and the United States Fish Commission<br />\nhas for several years been contemplating the advisableness of gratifying it by<br />\nerecting a laboratory on the Florida coast. At present also, the naturalists of<br />\nthe country are interested in an independent project to establish a station on<br />\nthe Tortugas. Both of these enterprises have been anticipated by the inauguration of the \"Gulf Biologic Station,\" by the State of Louisiana.<br />\nThe Louisiana station is located in the south-western extremity of Cameron<br />\nParish, on a point where the Calcasieu River opens into the Gulf. It is about<br />\na day's sail from Galveston, Texas, and 280 miles from New Orleans. The<br />\ntown of Cameron, two miles inland from the laboratory, is a small settlement<br />\nof 150 people. The isolation which is thus secured is one of the summer needs<br />\nof the biologist, who, during this period, must be freed from the conventions of<br />\ncivilized life.<br />\nThe environment of Cameron is conducive to work—apparently there is<br />\nnothing else to do. Northward, east and west, extend the alluvial plains, in<br />\nregions thickly wooded, but often bounded only by the horizon. The local<br />\n'mango' gives these stretches of shere flatness, somewhat of a roughened edge,<br />\nwhile here and there a decided nick is produced in the sky by a clump of larger<br />\ntrees. The vastness of these plains gives one the feeling of being alone in a<br />\ngreat solitude. Surely this is the place where that strange desire which many<br />\nmen feel at sometime of their lives—to shout and not be heard—can be gratified.<br />\nEven here disappointment lies in wait. A shout would startle the cattle<br />\ncropping peacefully the miles of pasture; they would cock their ears and look<br />\nwith surprise in the direction of the noise. Some of the more inquisitive ones<br />\nwould start off at a lively canter, kicking up their hind legs and prancing as<br />\nonly cows with glad hearts can. In those regions they do not hear a noise<br />\nevery day of their lives.<br />\nSouth-east, south and south-west, lie the chief interests of the station.<br />\nThere are the problems in the solution of which Louisiana makes the first state<br />\ncontribution to research in marine biology.<br />\nThe campaign begins this summer. The work to be undertaken will include<br />\na study of the best way to develop scientific methods of oyster culture, and a<br />\ngeneral biological survey of the Gulf of Mexico. The prevailing South-east<br />\n•<br /><br />\n2<br /><br />\nTHE NEWS LETTER.<br /><br />\nwinds bring to shore many of the pelagic forms with which the Gulf stream is<br />\nalive, but the whole mountain does not come to Mahomet.<br />\nTo meet this difficulty a launch and a sharpy are to be provided. With<br />\nthese boats extensive dredgings will be made on the flat extending outward from<br />\nthe coast, and localities will be plotted and marked. Such animals as do not<br />\nfloat ashore or which are too small to be picked up, will be gathered by means<br />\nof the surface net which is towed through the water behind a slowly moving<br />\nboat. This method of collecting is particularly successful on quiet nights at<br />\nhigh tide. Then the larvx and other small pelagic animals rise to the surface<br />\nand can easily be scooped up in large quantities. Their presence in the net is<br />\nbetrayed by a dim glow. At Beaufort, on very dark still nights, the water is so<br />\ncrowded with living things, that the course of a boat is marked by flashes of<br />\nblinding brilliancy, and in rowing, showers of living sparks drip from the oars.<br /><br />\nBesides the Fauna and Flora of the Gulf itself, the student finds much to<br />\ninterest him on land. Lining the rivers and bayous, are large pecan trees and<br />\nlive oaks, black and rugged, hut with a tinge of sadness, for the pendant<br />\nstreamers of the gray Spanish moss lend them the appearance of weeping willows.<br />\nThe 'mango' grows everywhere, and from its joints spring forth the golden tufts<br />\nof the parasitic dodder.<br />\nTropical fruits abound throughout the parish.<br />\nOranges grow in every garden, and lemons, olives, figs and bananas attract no<br />\nmore attention than our apples and pears,<br /><br />\nTHE NEWS LETTER.<br /><br />\na<br /><br />\nMost attractive of all the land animals are the birds. Wild ducks and<br />\ngees live in the marshes whefe they probably feed on the eggs and young of<br />\nthe diamond back terrapin. Cranes and herons patrol the shores, and the rice<br />\nbird hovers about the bushes preparatory to its disastrous flight to the north.<br />\nAlong the Gulf shore, the jack snipe struts about with nervous jerk, and the<br />\negret, blinding with whiteness, can be seen for miles. As if to set off the beauty<br />\nof this bird, the black ominous water-turkey, clumsy of flight, wobbles by, low<br />\non the water. Most conspicuous of all however are the flocks of brown pelican.<br />\nThese use for a roosting place the great stone jetties that project out to sea<br />\nfor two miles from the mouth of the Calcasieu. River. Here they sit in straight<br />\ndignified rows as though taking a lesson. Suddenly however, they become restless, and in a moment, with legs stretched out stiffly behind, they are off to sea<br />\nin an irregular squad, which at last is visible only as a group of small, uncertain<br />\nspecks. When they are on the verge of disappearing, these specks, momentarily<br />\nat rest, suddenly grow larger again, and the return flight begins, this time not in<br />\na squad, but spread out like a thin line of heroes,' until they reach the jetty,<br />\nwhere after considerable disorder, they once more sit motionless in a very<br />\ncorrect row.<br />\nThe life at a marine laboratory, however remote, is far from dull and anything but conventional. It is too full of activity to be the one and too unusual<br />\nto be the other. For the men who spend their vacations at a sea-side station,<br />\nwork is a source of endless pleasure, and they who can experience the delight of<br />\nfinding out something new, are amply repaid for all sacrifices. While it sometimes happens that a whole night is 'spent in watching a series of developing<br />\neggs, and that meals are brought to the work table, more often the days pass<br />\nwith a healthy mixture of indoor and outdoor work. The latter nearly always<br />\nmeans a few hours' run on the launch, a sail—time of return is never mentioned--a walk on the beach, and probably a dip in the surf.<br />\nThese collecting trips, even when resulting in no particular find, are never<br />\nwithout good effect, for the exertion, the excitement and sometimes the risk call<br />\ninto play all the powers of body and .mind, and bring about the tingle that<br />\nalways. accompanies the healthful expenditure of superfluous energy.<br />\nThen<br />\ntoo, the community of interests makes good cheer and the air is blue with songs,<br />\nstories and puns. Even university professors, tight-laced with dignity, learning<br />\nand fame, do not hesitate to smoke a corn-cob pipe and to take off their shoes<br />\nand stockings when necessary.. A crowd of biologists coming back from a<br />\nmoonlight towing would, in a city, be arrested for disturbing the peace.<br />\nTHE DEBATE WITH NORTH CAROLINA.<br />\nGAIN the Universii y of North Carolina has defeated us in debate ; but<br />\nthe contest was even closer than last year, and the decision of the judges<br />\nwas not unanimous. Then, too, Hopkins won a partial victory in that<br />\nthe judges unanimously decided Plaggemeyer the best debater who took part<br />\nin the contest. Hopkins lost the debate because the North Carolina team excelled<br />\n•<br /><br />\n4<br /><br />\n4<br /><br />\nTHE NEWS LETTER.<br /><br />\nin logical development and the completeness of their line of argument. In delivery the Hopkins men equalled or excelled their opponents.<br />\nThe debate was held in Gerrard Hall in the presence of an audience composed largely of university professors and students. Governor Aycock, who<br />\npresided, announced the question, read the instructions to the judges, and then<br />\ncalled upon the secretary to announce the first speaker upon the affirmative side.<br />\nMr. Solomon Blum, who opened the debate for Hopkins, was well received, and succeeded in making his points stand out clearly. Mr. S. S. Robins,<br />\na junior at North Carolina, followed with a speech such as one hears upon the<br />\nfloor of the United States Senate. The speech, which dealt largely with the development of governmental functions and the history of our merchant marine, was<br />\ndelivered in a masterful manner. When Mr. Plaggemeyer had finished the<br />\nnext speech for Hopkins, the advantage that Carolina had gained in her first<br />\nspeech was largely overcome. Mr. R. 0. Everett, a senior, then delivered a<br />\ntwenty-minute speech in which he still further developed the line of argument laid<br />\ndown in Carolina's first speech. In the rejoinders the extemporaneous speeches<br />\nof Messrs. Blum, Robins and Everett demonstrated the ability of those men to<br />\nthink quickly and to present their arguments clearly without previous preparation. But Plaggemeyer's rebuttal was by far the most effective speech of the<br />\nevening. Plag. was at his best and he carried his audience with him in a way that<br />\nsurprised even those who have heard him in former debates. When he finished<br />\nspeaking, it was any one's victory. As it was, the decision proved to be a victory<br />\nfor Plaggemeyer as well as for the University of North Carolina.<br />\nWhile the judges were deliberating, Governor Aycock responded to the repeated demonstrations of the Carolina students. He said that, in his opinion, the<br />\njudges had to decide the old question:—\"What happens when an irresistable force<br />\nmeets an immovable body.\" During the debate, the Governor said his convictions had been reinforced and his faith destroyed four times that he awaited the<br />\ndecision of the judges in order that he might know whether he must forsake the<br />\ntraditions of his childhood, or be permitted to die in the faith.<br />\nAfter the Governor had ceased speaking, the Carolina students in the gallery called for Strayer, the alternate of the Hopkins team, who expressed, on<br />\nbehalf of the team, their appreciation of the hospitality which they had enjoyed.<br />\nWhen the decision had been announced and congratulations had been exchanged,<br />\na carriage conveyed the Hopkins men to the residence of Professor Gore, where<br />\nthey were introduced to Governor Aycock, President Venable, the judges of the<br />\ndebate, the professors and their wives, and many of the Carolina students who<br />\nare interested in debating. After they had enjoyed the collation provided, the<br />\nteam returned to the hotel to get a few hours sleep before starting home. ,<br />\nThe members of the Johns Hopkins party unite to express high appreciation<br />\nof their reception and entertainment at Chapel Hill. They all declare that their<br />\npersonal acquaintance with the traditional cordiality and hospitality of Dixie<br />\nfarther South has been most pleasantly enlarged.<br /><br />\nTHE NEWS LETTER.<br /><br />\na<br /><br />\nTRUSTEES VISIT OTHER UNIVERSITIES.<br />\nwill be remembered that at the Commemoration Day exercises, Preside<br />\nnt<br />\nRemsen, in speaking of Homewood, said that as many of the trustees as<br />\ncould leave would go this Spring upon a tour of investigation to learn<br />\nwhat<br />\nother universities could teach them for the development<br />\nof the Homewood land.<br />\nAccordingly a party of the trustees, consisting of Dr. Remsen, Messrs.<br />\nR. Brent<br />\nKeyser, John Gill, Blanchard Randall, Lewis N. Hopkins, and<br />\nEugene<br />\nLevering, visited the University of Virginia several weeks ago. They<br />\nwere<br />\ncordially received and brought back many pleasant impressions of the<br />\ntrip.<br />\nThe University lands and buildings were inspected by them, and<br />\nthey secured<br />\nmany suggestions which will be helpful in the development of<br />\nHomewood.<br />\nIn a few days, perhaps early next week, the trustees will visit<br />\nColumbia,<br />\nPrinceton, University of Penna., Haverford and Bryn Mawr, with the<br />\nsame<br />\nPurpose in view. Still later, at a time not yet determined upon, Harvar<br />\nd, Yale<br />\nand other Northern universitites will be made fields of further<br />\nstudy.<br />\nSt.<br />\nLouis, too, may be visited, though the trustees are doubtful of this trip.<br />\nWashington University, the St. Louis institution now attracting the general<br />\nnotice of<br />\nadvanced educators in the United States, has now to deal with practically the<br />\nsame problem that confronts Johns Hopkins. The university<br />\nhas lately been<br />\ngiven a large plot of land, and the conditions of the gift are quite<br />\nsimilar to<br />\nthose under which Homewood recently came into the possession of<br />\nJohns Hopkins. Washington, however, is more fortunate than Hopkins, since several<br />\nof<br />\ntheir buildings are erecting for the use of the approaching Louisia<br />\nna Purchase<br />\nExposition, and at the close of the Exposition they will be turned over to the<br />\nUniversity.<br />\nPresident Randall, of Washington, has written to Dr. Remsen<br />\ninviting the trustees to visit his University, and learn how their mutual proble<br />\nm<br />\nis met out there. The only thing that prevents the trustee<br />\ns from accepting the<br />\ninvitation is the length of the trip to St. Louis, which would consume more<br />\ntime than they feel able at present to give to it.<br />\n- The trouble to which the trustees are putting themselves to in order to have<br />\nthe benefit of expert counsel is a guarantee that the final result will<br />\nbe the best<br />\nthat the most careful thought can devise. President Remsen, in speakin<br />\ng of<br />\none of the most urgent needs of the University, an athletic field, gives<br />\nfurther<br />\nemphasis to this same purpose on the part of the University trustees.<br />\nHe<br />\nseems to recognize quite fully the general desire on the part of undergraduates<br />\n,<br />\nand many of the graduate students and alumni, for an athletic field<br />\nthat will be<br />\nHopkins's own. The unsatisfactory and unprofitable shifts which the University<br />\nathletic teams are now obliged to make between Electric Park, Maryland Oval,<br />\nDruid Hill, and the city base ball park are probable quite as well understood<br />\nby<br />\nDr. Remsen as by the managers of the teams themselves. The trustees,<br />\nindeed,<br />\nhave even sought preliminary plans for an athletic field in advance of the other<br />\ndevelopments of Homewood. With these plans in hand, however, it has seemed<br />\nwiser to them to stay the work, lest anything that might be done before the<br />\ngeneral scheme of extension into \"The Promised Land,\" has been decided by<br />\nmature judgment would have to be undone.<br /><br />\n'r<br /><br />\n5<br /><br />\nTHE NEWS LETTER.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br /><br />\nHOPKINS UNIVERSITY.<br />\nMAY 7, 1903.<br /><br />\nSubscription $1.50 per year.<br /><br />\nGEORGE A. FOSTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br /><br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br /><br />\nH. V. MORSE, 1905.<br /><br />\nAssistant News Editors,<br /><br />\nc J. NEWMAN NUMSEN, 1904.<br /><br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\n10 Cents a single copy.<br /><br />\n.<br /><br />\nHARRY BAETJER, 1908.<br />\n. Ricium BUCKLER, 1904.<br /><br />\nAddress all articles, communications, etc., to GEORGE A. FOSTER, box 195, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETJER,<br />\nU.; or box 398. Medical Department of the Johns Hopkins University.<br />\nH.<br />\nJ.<br /><br />\no<br />\nl g V its victory over Swarthmore on last Saturday, the University lacrosse<br />\nteam is once more entitled to the proud distinction of being The Intercollegiate Champions of the United States.\" Winner of the championship<br />\nfive times in six years is a record that would be hard to surpass. This year the<br />\nhonor was not won without the hardest kind of work, and for this reason every<br />\nman connected with the team deserves all the more credit. At the beginning<br />\nof the season the chances for another championship team seemed slight indeed.<br />\nThe loss of such lacrosse players as Abercrombie, Briscoe, Bernheim, Sayler, and<br />\nCaptain Schmeisser seemed too great to be overcome, and predictions were made<br />\nthat with the material on hand the University could not develop a first class<br />\nteam for 1903. Nothing daunted, however, .Captain Straus and Coach Abercrombie set to work to develop a team that would stand comparison with those<br />\nof former • years. From the beginning the men were impressed with the fact<br />\nthat steady, consistent work was absolutely necessary. The 1903 championship<br />\nbanner that will soon be hung in the trophy room bears witness of their success.<br />\nThough the Intercollegiate lacrosse season is ended, there are some more<br />\nhonors that the team is trying for, . On Saturday, the Crescents, the - Athletic<br /><br />\nTHE NEWS LETTER.<br />\nChampions of the United States, will play the University, and without question<br />\nthe game will be one of the best seen in Baltimore for some time. The Crescents have not forgot their defeat two years ago, and according to report, are<br />\ngoing to bring to Baltimore some of the best lacrosse players in the country. The<br />\nUniversity team is just as determined to win, and make the year an unbroken<br />\nline of victories.<br /><br />\nHE joint concert of the Woman's College and the University Musical<br />\nClubs to be given on Saturday night for the benefit of the Lawrence<br />\nHouse Mission, deserves the support of every Hopkins man. In another<br />\ncolumn is given an account of how the mission carries on its work. Clearly an<br />\nobject more worthy of the united assistance of all cannot be found. Since the<br />\nwork done by the mission is very great, the opportunity for assisting in this work,<br />\nand at the same time being agreeably entertained, should be taken advantage of.<br />\nA number of students give practical aid to the mission by taking charge of classes.<br />\nHowever, this is not all that is needed; financial help is absolutely necessary to<br />\ncontinue the work. For this reason, the management hopes to have even a<br />\nlarger attendance at the concert than last year, when a considerable sum was<br />\nturned over.<br /><br />\ne<br /><br />\n'l' length, after many months of hard work, the long-suffering editors of the<br />\n1903 Hullabaloo are ready to announce what will be the special feature.,<br />\nof their book. From their description, this \"Hullabaloo\" bids fair to be<br />\none of the best and most interesting ever brought out by the students of the<br />\nuniversity.<br />\nIn the first place, the cover will be black and blue, divided diagonally,<br />\nwith the class flag showing the class colors, olive and white, in one corner.<br />\nAnother of Brook Levering's allegorical color-pieces is promised. The leader:<br />\nwill be two in number, a departure from former \"Hullabaloos\"—the first by W.<br />\nW. Willoughby, Ph. D., Associate Professor of Political Science, the second by<br />\nDr. E. L. R. Gould, Chamberlain of New York •City. The peculiarly interesting feature of these leaders is that they are articles in which specialists aro<br />\nspeaking of their specialty—\"talking shop,\" as it were.<br />\nThe order of the classes is reversed, the Sub-freshmen coming first and the<br />\nSeniors last. In connection with the class lists, there are some amusing drawings<br />\nshowing the progress from the innocence of the Sub-freshman to the dignity of the<br />\nSenior. The fraternity drawing is a striking one by McKee Barclay. The<br />\nmembers of the fraternities not having chapters at the University have been carefully and thoroughly worked up. An excellent idea in connection with Athletics<br />\nis that on the page opposite each team picture are the description and personnel<br />\nof the team. A complete and detailed list of all the \"H's\" and \"H. A. A.'s\"<br />\nof<br />\nin the university, has for the first time been compiled. As for the \"stunts,\"<br /><br />\nZ.<br /><br />\nS<br /><br />\nTHE NEWS LETTER.<br /><br />\n--several pages are devoted to the opinions of the members of the class on things<br />\nin general (including \"girls\") and to the votes of the class on the various qualifications of certain of the members. These begin the \"stunts\" proper which<br />\ncover about sixty-seven pages.<br />\nHowever, the features of the book on which the board has worked hardest<br />\nand put forth its best efforts are the drawings of girls and the music. The<br />\nboard has been fortunate in obtaining from several prominent New York artists<br />\n—C. Alan Gilbert, W. Granville-Smith, and others—drawings in which are<br />\nshown \"Hopkins Girls,\" more charming and beautiful than their avowed worshipers could imagine. The best thing about these pictures is that they are distinctly not amateurish.<br />\nThe Song Book, comprising eight songs with music, will make the \"Hullabaloo\" of especial interest to alumni,since the songs given are those which are and<br />\nhave been most sung by University students. This Song Book is the first that<br />\nhas'ever been published at the Hopkins, and it is hoped that this small beginning<br />\nmay lead to better things in this line.<br />\nIt is hoped by the editors that the \"Hullabaloo\" will be out by the 15th of<br />\nMay, but this depends on Providence and the printers. In bringing out the<br />\n\"Hullabaloo\" the board has had a trouble with which former boards have not<br />\nbeen afflicted—they have had to solicit their advertisements, instead of the publisher taking charge of this side of the book. However, by the remarkable<br />\npush and ability of \"Billy\" Bird, this financially important feature has been excellently handled. In conclusion it is only necessary to say that the 1903 \"Hullabaloo\" will undoubtedly be a credit to Lanier, Tootle and the other members<br />\nof the editorial staff.<br /><br />\nHULLABALOO ELECTIONS.<br />\nFTER long delay and extensive electioneering, the Junior class held a<br />\nmeeting last Thursday to elect editors for the 1904 \"Hullabaloo.\" It took<br />\nsome time to elect the editor-in-chief and his assistnant, as the election of<br />\nthese officers was fraught with much heat. The fitness of each nominee was proclaimed by his supporters with loud, plausible, and unconvincing arguments.<br />\nFinally, after considerable spirited .discussion, Reginald S. Opie was chosen<br />\nOf the<br />\neditor-in-chief, and Ralph 0. Fucrbringer, associate editor-in-chief.<br />\nten candidates for the associate literary editors, the following were elected: G. A.<br />\nFoster, J. C. L. Hawkins, W. L. LeCron, H. S. Lloyd, C. H. Saylor, and Frank<br />\nStollerwerck. Henry Evans was unanimously elected art editor. The Business Manager is J. L. Bennett; the assistant Business Managers are R. Gordon<br />\nDulaney and Sydney C. Erlanger.<br />\n. It is to be hoped that the interest which the class has shown in these elections<br />\nis an earnest of the help which they will give the board next year in bringing<br />\nout a \"Hullabaloo\" which will be up to the standard set by the best of<br />\nits predecessors.<br /><br />\n4<br /><br />\nTHE NEWS LETTER.<br />\nBALTIMORE'S NEXT MAYOR.<br /><br />\nOHNS HOPKINS has developed her first mayor. She has entertained a<br />\ngood many mayors at her publiic gatherings in the past, but never one of<br />\nher own. When the Hon. Robert M. McLane makes his bow at the<br />\nnext commencement exercises, the distinguished assembly will be receiving the<br />\nsalute of the member of the class of 1887. His salute will doubtless be returned<br />\nin the proper spirit.<br />\nBaltimore's mayor-elect prepared at Mr. Marston's School, entering the University in the Fall of 1884. He took the classical course, and during his entire<br />\nundergraduate career was a leader in his classes. From his Freshman year until<br />\nhis graduation, Mr. McLane held honorary scholarships, and graduated with high<br />\nhonors. He was, however, no \"grind,\" but had the happy faculty of getting at<br />\nthe gist of his studies without much work. In the eighties there were not so<br />\nmany athletic teams as there are to-day, and Baltimore's mayor went for nothing<br />\nmore strenuous than tennis, at which game he was a player of more than ordinary<br />\nability. A gentleman who was at the University with Mr. McLane, says that he<br />\nenjoyed a good joke, and always had a ready line of stories, which he told in a<br />\nmost entertaining manner. He was always one of the best dressed men about the<br />\nUniversity. By many, Mayor McLane is remembered as a 'clean cut, faultlessly<br />\ndressed chap, who always had a pleasant smile, and a cheerful word for his companions, but who did not mingle much with them. In those days he cared little<br />\nfor the society of women, a habit which seems never to have left him.<br />\nAfter leaving the University Mr. McLane followed the usual course of<br />\nstudies suscribed by the Maryland University's faculty, and became a member of<br />\nthe Baltimore bar. About four years ago he was elected State's Attorney on the<br />\nDemocratic ticket. He now leaves the Criminal Court for the City Hall.<br /><br />\n3<br /><br />\nTURIN BULL LECTURES 1903 04.<br /><br />\nThe lectures on the Percy Turnbull Memorial Foundation for the academic<br />\nyear 1903-04 will be given by Count Angelo de Gubernatis, Professor of Italian<br />\nLiterature in the University of Rome.<br />\nThe lectures will be eight or nine in number, and the subject will be the<br />\n\"Poetry of the Italian Renaissance.\" The lecturer will speak in French.<br />\nCount de Gubernatis is Professor of Italian Literature in the University of<br />\nRome; General Secretary of the Italian Oriental Academy; the author of numerous literary, historical, and dramatic works; Italian correspondent of the<br />\nAthenaeum and the Contemporary Review, London, the International Review,<br />\nVermont, and other papers.<br /><br />\n10<br /><br />\nTI1E NEWS LETTER.<br />\nUNIVERSITY NOTES.<br /><br />\nDr. L. S. Hulbert, who has bccn ill with typhoid fever, is convalescing.<br />\nDr. A. Marshall Elliott will sail in :June for the other, side, and will spend<br />\nthe summer abroad.<br />\nDr. Bower, of Washington, delivered a lecture in the Physical Laboratory,<br />\nMonday, April 27th, on \"Terrestial Magnetism.\"<br />\nDr. Bower also gave the<br />\nstudents interested in the subject a chance to pursue the actual experiments at<br />\nFort McHenry.<br />\nSaturday, May 9th, Dr. Paul Haupt will sail from New York for England,<br />\nwhere he will visit Oxford and Cambridge, after which he will travel in Germany.<br />\nAt the meeting of the National Academy of Sciences held in Washington,<br />\nApril 22nd, President Remsen was elected vice-president of the Academy. Prof.<br />\nSimon Newcomb was elected foreign secretary to succeed President Remsen.<br />\nProf. W. H. Welch was elected a member of the Academy council.<br />\nDr. Norman MacLeod Harris, associate in bacteriology, has resigned from<br />\nthe Medical School and has accepted a position as assistant to Dr. Jordan, professor of bacteriology at the University of Chicago.<br />\nAt the meeting of the Eastern Teachers' Art Association, held in McCoy<br />\nHall, an address of welcome was delivered by Dr. Geo. B. Shaddock. An attractive exhibit of tie work of the school children in several towns and cities<br />\nthroughout the country was arranged in the main hall. The drawings called<br />\nforth much favorable comment from visitors.<br />\nDr. Florence R. Sabin, an assistant in anatomy at the Medical School, has<br />\nwon the prize of $1,000. offered two years ago by the Association for the Promotion of Scientific Research by Women. Dr. Sabin's paper is on the \"Origin<br />\nof the Lymphatic System.\" Dr. Sabin received her M. D. at the Hopkins in 1900.<br />\nDuring her course she held the fellowship in anatomy, and after her graduation<br />\nshe was appointed instructor. Recently, she was offered the professorship of<br />\nanatomy at the Woman's Medical College in London, but she declined, preferring<br />\nher present work at the Hopkins.<br />\nAt a recent meeting of the American Institute. of Social Service, Mr. Robert<br />\nGarrett, Dr. Albert Shaw, and Dr. E. R. L. Gould were appointed members of<br />\nthe American committee which is to co-operate with the sociological workers of<br />\nthe other countries in the International Housing Congress, to be held in Paris,<br />\nfrom July to November next. The congress is to be under the patronage of the<br />\nFrench government. It will discuss the importance of inaugurating preventive<br />\nmeasures against the spread of tuberculosis and alcoholism..<br />\nAt the meeting of the .M edical and Chirurgical Faculty, papers were read<br />\nby Drs. William H. Welch and Henry B. Jacobs. Dr. Welch spoke chiefly about<br />\nthe methods employed in New York for the prevention of tuberculosis. Dr.<br />\nJacobs read a paper on \"Our Need of a Mountain Sanitarium for Indigent<br />\nConsumptives.\" Other papers were read by the following Hopkins men: Drs.<br />\nW. S. Baer, T. R. Brown, H. O. Reik and S. R. Hirshberg. Professor R. W.<br />\nWood also delivered a lecture on \"Colored Photography.\"<br />\n•<br /><br />\nTHE NEWS LETTER.<br /><br />\n11<br /><br />\nDr. Harry C. Jones has recently begun a series of weekly lectures on advanced inorganic chemistry from the physical standpoint.<br />\nThe lectures are<br />\nalong the line laid down in his \"Principles of Inorganic Chemistry,\" published<br />\nseveral months ago.<br />\nDr. Norman MacD. Harris, associate in bacteriology, has revised and edited<br />\nan American edition of the \"Manual of Bacteriology,\" by Doctors Muir and<br />\nRitchie. The book is published by the Macmillian Co.<br />\nDr. Gamgee, the distinguished professor of physiology at Owens College,<br />\nLondon, and Dr. Walter Jones of the Medical School, are to carry out a joint<br />\nresearch on the relation between the nucleins and nucleo-proteids.<br />\nThe two<br />\nscientists expect to make valuable discoveries in this new field by means of the<br />\npolariscope.<br />\nThe Lawrence Memorial Association held a meeting in McCoy Hall on Al ay<br />\n4th. An illustrated lecture on \"Settlements\" was delivered by Dr. William H.<br />\nTolman, director of the American Institute of Social Service, and an address<br />\nwas made by Mrs. Vladimir G. Sinikhovitch, director of the Greenwich House,<br />\nNew York.<br /><br />\nTHE PHI BETA KAPPA ELECTIONS AND BANQUET.<br />\nT the annual meeting of the Maryland Alpha Chapter of the Phi Beta<br /><br />\n4<br /><br />\nKappa Fraternity, held on April 22nd, the following men were elected to<br />\nmembership in the Society:—<br />\nGraduate Students: G. 0. Berg, T. C. Foote, F. H. Getman, L. G. Horton,<br />\nA. Johannsen, R. D. Miller, W. T. Pierce, J. E. Routh, Jr., A. W. Smith.<br />\nCandidates for A. B.: James Wallace Bryan, John Coffey Hildt, Robert<br />\nSampson Lanier, William Urwick Murkland, Joseph Tate Smith, G. Drayton<br />\nStrayer.<br />\nThe following officers were elected: President, Prof. A. Marshall Elliott:<br />\nVice-president, Prof. Paul Haupt; Treasurer, Dr. C. Carroll Marden ; Secretary, Dr. J. Elliott Gilpin.<br />\nThe annual banquet was held on the 1st of May, in the Donovan Room,<br />\nMcCoy Hall. The speeches were excellent, that of President Remsen being of<br />\nespecial interest to, the members of the University. He responded to the toast,<br />\n\"Our University.\" After a few words about the million-dollar fund, Dr. Remsen said that the University expects to put up at Homewood, not \"palaces,\" but<br />\nbuildings plain, imposing and of good architectural style ; that the University will<br />\nmove out to Homewood as a whole, not in parts; that the project of having an<br />\nathletic 'field at Homewood before the University is built up there is impracticable, as no part of the estate is accessible for exhibition purposes.<br />\nProfessor Perrin, of Yale, spoke of the importance of Phi Beta Kappa in<br />\nPhilosophical life ; Mr. 'Bonaparte spoke of the good influence of Phi Beta Kappa<br />\nin political life.<br />\n\"Goo! goo!\" said the baby as he stuck his finger in his father's old pipe.<br />\n—Widow.<br /><br />\n12<br /><br />\nTHE NEWS LETTER.<br />\nTHE LAWRENCE HOUSE CONCERT.<br /><br />\nt<br /><br />\nli E, second annual joint concert by the Woman's College and Johns Hopkins University Musical Clubs will be given in McCoy Hall, on Saturday, May 9th. The performance is for the benefit of the Lawrence House<br />\nSocial Settlement, and it is hoped that the student body will be sufficiently interested in this work to aid in the success of the concert.<br />\nThis sort of work in the lower sections of the city is from its very nature<br />\nsuch as to gain but little publicity, and it may be of interest to note briefly a few<br />\nof the salient facts in regard to the methods employed in uplifting and bettering the conditions of the poorer classes.<br />\nIn order to be in touch with the people among whom the work is to be acThis<br />\ncomplished, a house has been purchased on West Lombard Street.<br />\nhouse has been made as attractive and home-like as is possible under such conditions. Classes have been organized, which meet regularly. Many of these<br />\nclasses have formed themselves into clubs with officers and definite exercises for<br />\neach night. As far as possible, the growing boys are given some knowledge of<br />\nparliamentary law and by contact with men of training and culture are gradually<br />\nled to form standards of conduct, which in many cases have changed the drift of<br />\ntheir lives. The girls are taught needlework and practical housekeeping, and<br />\nevery helpful influence is thrown around them.<br />\nThe classes are under the supervision of Miss Alice E. Robbins, who has<br />\nlearned through practical experience in the slums of New York and London,<br />\nhow to grapple with the many problems that are being continually presented.<br />\nThe management of the settlement is vested in a board of managers, of which<br />\nM r. Robert Garrett, a former student of this university, is president. Associated<br />\nwith him are representatives from the various colleges of the city and others interested in the welfare of the poorer classes.<br />\nThis is a summary of the general idea of the settlement and it must be seen<br />\nhow vital the work is. The expenses are met through voluntary subscriptions,<br />\nand the success of the concert means that one of the chief sources of revenue will<br />\nnot be curtailed. This statement should be a sufficient appeal to those of philanthropic mind, while a mention of the attractiveness of the programme should<br />\ninsure the presence of all others. There need be no comment made concerning<br />\nthe members of the Woman's College Glee and Mandolin Club, for they are<br />\nknown to all. The quartet from the Medical School will have some new songs,<br />\nwhich should cheer even the most melancholy. Arrangements to hold an informal reception at the close of the concert are under consideration by the committee in charge.<br />\nA pious young person is Evelyn,<br />\nBut eggs she is constantly devillin,<br />\n'Twould make me feel sad<br />\nTo send eggs to the bad,<br />\nBut I revel in evil in Evelyn !—Tiger.<br /><br />\nTHE NEWS LETTER.<br /><br />\n13<br /><br />\nATHLETICS.<br />\nLACROSSE.<br />\nHopkins 17—Lehigh 4.<br />\nIn a game that abounded in all sorts of playing- gi )0(1, bad and indifferent—<br />\nthe University twelve defeated the Lehigh team on April 26th, in a contest which<br />\nwas more interesting than the one-sided score-17 to 4—would indicate.<br />\nBoth teams started off with a rush, and at an early stage it looked as if the<br />\nvisitors were going to make the 'Varsity team play hard in order to win. They<br />\nshot two goals in rapid succession, but their joy was short lived, for after ten<br />\nminutes of play the superior skill and endurance of Hopkins became evident,<br />\nand the \"rooters\" were kept busy counting up the score.<br />\nLehigh played a<br />\nPlucky game throughout, but they were clearly outclassed by the superior playing<br />\nof the University men.<br />\nCaptain I,attig and George R. Bailey were the star players for the visitors.<br />\nLattig did as fine individual playing as anyone on either side, and to the manner<br />\nin which he handled his men is largely due the fact that Lehigh scored her goals,<br />\ntwo of which he himself shot.<br />\nBailey is a Baltimore boy, and for several<br />\nyears was prominent in athletics in this city. IIis work at point spoiled many<br />\ngood plays of Hopkins, which might have resulted in more goals.<br />\nFor Hopkins, Captain Straus, Putts, Bernheim, Matthai and Schmeisser did<br />\nespecially fine work, although every man on the team deserves credit for so decisive a victory.<br />\nOne of the prettiest plays that has been seen this season occurred in the first<br />\nhalf. The ball was near Hopkins goal when Schmeisser made a pretty catch and<br />\nthrew the ball far down the field to Tough. The ball was then rapidly passed<br />\nto Matthai, Bird, Dill, Bernheim and Putts, who threw goal. The ball had come<br />\nall the way from point to goal without Lehigh being able to break the play.<br /><br />\nHopkins 6—Swarthmore 4.<br />\nY defeating the Swarthmore lacrosse team, 6 to 4, on their home grounds<br />\nlast Saturday, the Johns Hopkins twelve remains champions of the Intercollegiate League for another year. The game was one of the hardest<br />\nfought that has ever been witnessed upon a lacrosse field, and Hopkins did not<br />\nclinch it until within the last two minutes of the second half.<br />\nA very gratifying feature of the game was the presence of so many Hopkins rooters on the field, and the yelling of friendly voices greatly encouraged<br />\nthe University men to victory. While not all of the rooters were Baltimoreans,<br />\na large number did go from this city, and the character of the game was a sufficient reward. Many sympathizers went over from Philadelphia and Wilmington,<br />\nand waved the black and blue flags as proudly as if Baltimore was their home.<br /><br />\n§<br /><br />\n14<br /><br />\nTHE NEWS LETTER.<br /><br />\nEvery man on the team did his best and covered himself with glory, so that<br />\nit is hard to say who deserves the most credit. Foster was probably the most<br />\nprominent man on the field. He appeared to be everywhere at once. Whenever a man was blocked or a ball passed, \"Fred\"was right on hand to do the work.<br />\nDuring most of the game he was on the attack, but owing to the dropping out<br />\nof a Swarthmore man, who was slightly injured, and the consequent dropping<br />\nof a Hopkins player, he was moved down to the defense.<br />\nP. Straus at goal made some remarkable stops. Time and again the ball<br />\ncame flying toward him, and time and again did he succeed in keeping it from<br />\ngoing between the posts. In the early part of the game he had chances enough to<br />\nshake any goal-keeper's nerve. Four stops, three of which were quite difficult,<br />\nwas what Straus was called upon to do within less than three minutes.<br />\n\"Billy\" Bird was once more among the foremost of the players. His beautiful catching and accurate throwing, especially in the second half, when he let<br />\nhimself out, did much in keeping the ball in the enemy's territory. The body<br />\nchecking and heady playing of Matthai and Tough were very effective in breaking up the plays of Swarthmore.<br />\nCaptain Henry Straus, Schmeisser and Blanck, were the bulwark, as usual,<br />\nfor the defense, and Custis also did well. Of the attack men, Rosenheim did<br />\nsplendid work. He played his position like an old hand, and it was due to his<br />\nheadiness that the last goal was scored. When Bernheim was so well covered<br />\nby his opponent that he could not take the ball when passed to him by Bird,<br />\nRosenheim backed him up beautifully and threw goal, thus clinching the victory<br />\nfor Hopkins.<br />\nPutts again distinguished himself by throwing four of the<br />\nsix goals.<br />\nFor Swarthmore, the defense put up the best game. In fact, if their attack<br />\nhad been as strong as their defense, the story might have been different. It is<br />\na significant fact that all of Hopkins's points were made in the east goal, where<br />\nthe sun was in the face of the defense men. Whenever they changed, the team<br />\ncould do absolutely nothing in the way of scoring.<br />\nCaptain Beans, who played in-home, is probably the best player Swarthmore<br />\nhas had in years. His passing and body checking were excellent, and his throwing was faultless. His record was almost equal to that of Putts, as he scored<br />\nthree of the four goals made by his team.<br />\nAt no time during the game wm Swarthmore in the lead. Hopkins threw<br />\nthe first goal, but her opponents scored shortly afterwards. The 'Varsity succeeded in making two more goals before Swarthmore made one, but before long<br />\nthe score was again tied. Just after Hopkins made her fourth goal, Swarthmore<br />\nrepeated the performance. At last, just before the end of the first half, the<br />\nUniversity team drew away from its rivals, and the half ended 5 to 4.<br />\nNot<br />\nanother goal was scored by either side until within the last two minutes of the<br />\ngame, when Rosenheim clinched the victory.<br />\n\"The Senator is a self-made man.\"<br />\n\"And a machine-made Senator.\"—Tiger.<br /><br />\nTHE NEWS LETTER.<br /><br />\n.15<br /><br />\nTRACK TEAM.<br /><br />\nt<br /><br />\nHE Relay Team returned home from the University of Pennsylvania games.<br />\nof April 25th, without the customary banner, it is true, but with a feeling<br />\nof satisfaction at having made a very Creditable showing in the race for<br />\nthe \"Middle States Championship.- A victory was scarcely to be expected, although hoped for ; but the general opinion prevailed that second place in first<br />\nclass company is more desirable than first place in second class company.<br />\nOwing to a heavy track, caused by improvements that are being made, the time<br />\nfor all events was somewhat slow, but Hopkins was especially handicapt)ed by<br />\nthe fact that the race was run in a different direction from that which our runners had been accustomed to, the men thus being compelled to make the turns to<br />\nthe right, instead of to the left.<br />\nThe Middle States championship relay race was the nineteenth event. Freese<br />\nstarted for Hopkins, and finished third. Hoffman was the next man, and by good<br />\nrunning pulled up to second place, with Bucknell a good distance in the lead.<br />\nEngland ran third, and made the distance between Bucknell and Hopkins' still<br />\nsmaller. Tootle was the last man. He ran a beautiful race, closing up the<br />\ngap splendidly and finished a close second. Dickinson came in third. BUcknell's<br />\ntime was 3 minutes, :37 2-5 seconds.<br />\nIn the high jump, Dr. Geo. B. Scholl tied with a Syracuse man for second<br />\nplace at 5 feet, 10 inches, and won the toss of the coin.<br /><br />\nIt is scarcely necessary to account for the absence of news in this issue concerning the Dual Meet with Virginia. As THE NMS-LETTER goes to press<br />\nsome days before the meet, it is impossible to give an account of the games, and<br />\nat the same time it is inadvisable to forecast any events, as all the results will be<br />\nknown when this issue appears.<br /><br />\nALUMNI NOTES.<br />\nJames Alfred Kennard, '9S, will he married to Miss Margaret Ridgeley, on<br />\nJune 3rd.<br />\nW. S. Weedon, Ph. D., '02, visited the university on Monday.<br />\nDr. Florence Bascom, '93, who has been associate professor of geology at<br />\nBryn Mawr, has been appointed professor. Her assistant will he Dr. Benjamin<br />\nL. Miller, who received his degree at the university last February.<br />\nDr. Councilman, who was assistant professor of pathology at the university<br />\nfor several years, and who is now professor of pathology at the Harvard Medical<br />\nSchool, has announced his discovery of the small-pox germ.<br /><br />\nTHE NEWS LETTER.<br />\nGeorge S. Brown, '93, was elected to the Second Branch of the City Council<br />\nfor the Fourth District, on Tuesday. Though Mr. Brown was not backed by<br />\nthe Democratic organization, he received a larger majority than any of the other<br />\nsuccessful candidates.<br />\nAlfred W. Bruton, one of the best known and most popular members of<br />\nthe class of 1901, met death by drowning in the Charles River, Massachusetts,<br />\non last Friday afternoon. Along with a companion, he was canoeing, when a<br />\ngust of wind struck the canoe, overturning it, and Bruton was drowned before<br />\nhelp could reach him. Bruton was a student at Boston Tech., and would have<br />\nreceived his degree in Engineering in June. During his three years at the University he played on the football and lacrosse teams,and was one of the best players<br />\nat Hopkins. Almost all the members of the athletic teams from 1898 to 1901,<br />\nas well as many students, were present at the funeral services, which took place<br />\non Monday afternoon.<br />\nAt a meeting of the Athletic Association, held on Monday morning, the following resolutions were adopted:<br />\nWhereas, It has pleased an all-wise Providence to remove from our midst<br />\nour friend and fellow-student, ALFRED WILLIAM BRUTON., and<br />\nWhereas, He was a prominent member of the Johns Hopkins Athletic Association, and had endeared himself to all of us by his manly qualities and friend'ship, therefore,<br />\nBE rr RE;soLvED, That we, the members of the Johns Hopkins Athletic Association, mourn his loss and extend our deepest sympathy to his bereaved family,<br />\nand be it<br />\nRESOLVED, That a copy of these resolutions be spread upon the minutes of<br />\nthe Athletic. Board of the Johns Hopkins Athletic Association, published in<br />\nTHE NEws-I,ErrER, and a copy be sent to the family.<br />\nEDWARD RENO UF,<br />\nHENRY A. CONVERSE,<br />\nR. CURZON HOFFMAN, JR.<br />\nFor the Athletic Association.<br />\nBehold the way the Freshman works;<br />\nNo task there is 'he ever 'shirks:<br />\nWith dictionary, text and trot,<br />\nFew are the things Which he knows not.<br />\nThe Sophomore drops the first of these;<br />\nThe trot alone's enough to please<br />\nWheneler it with the, text agrees.<br />\nThe Junior drops the text,<br />\nAnd reads the trot when called on next.<br />\nThe Senior bluffs.<br /><br />\n—Record.<br /><br />\nOPEN ALL NIGHT.<br /><br />\nWILLIAXSON 0 WATTS,<br />\nr,33)rt13 $tores,-,<br />\nHoward and Franklin Streets.<br /><br />\n'Baltimore and Eutaw, Streets.<br /><br />\n1Druch3, fancy Goobs. Perftunsy, Collet Erticles, Cioaro,<br /><br />\nTHE CHEAPEST<br /><br />\nPLACE<br />\nIN BALTIMORE FOR<br /><br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br /><br />\nH. S. WRIGHT &amp; CO•<br />\n704 MADISON AVE.<br />\n'<br />\n/<br />\n1<br />\n47V it<br /><br />\nC. &amp; P.'Phone 3350- 1'..4-1<br /><br />\nHENRY N. BRUNS,<br />\nDrawing Materials.<br />\nMathematical and Surveying Instruments,<br />\nDraughtsmen's and Engineers' Supplies<br />\nN. W. Corner<br />\nLexington and Liberty Sts.<br /><br />\nISALTIMORE,PAD.<br /><br />\nAgent for Eeuffel 4- Esser Co., of New York.<br /><br />\nf...4 I<br /><br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br /><br />\nIT<br /><br />\ns<br />\nUNIVERSITY<br />\nBOOK STORE.<br /><br />\nText Books, Note Books, —<br />\nMadison<br />\nStudents' Supplies.<br /><br />\n&amp; Howard Sls.<br /><br />\nincorporated 187M.<br /><br />\n\"nes Strongt as the Stfohaest.\"<br /><br />\nTRE FIDELITY MUTUAL LIFE INSURIINGE GO.,<br />\nOF PH.ILEVDEL,PI-HA..<br />\nAN EXCELLENT OPPORTUNITY is offered Students and Teachers to write Insurance for THE<br />\nFIDELITY, either during vacation or permanently.<br />\nFor Agency in Maryland or West Virginia,<br /><br />\nAddress,<br />\nC. CRAIIAM, Manager<br />\n806 8 Merchants Bank Bldg., Baltimore, Md.<br /><br />\nFor Advertising Space in this Paper<br />\nAPPLA\"r0<br /><br />\n1<br />\nLIGHT &amp; LOMBAR<br /><br />\nST..,<br /><br />\nPUBLISHERS.<br /><br />\n\"Ti7<br />\n! N<br /><br />\n1,1,1'rN W.:1411<br /><br />\nUNION<br />\nTHEOLOGICAL<br />\nSEMINARY<br />\n700 Park Ave<br />\nNew York<br /><br />\nI. I.<br />\nEquipped for<br />\nScholarly and Practical<br />\nwork, in the midst of the<br />\nChristian enterprises of a<br />\ngreat, city, in close academic<br />\nrelations with Columbia and New York Universities, offers opportunities for the<br />\ndegrees of M. D., A. M. and<br />\nPh. D.<br />\nOpen on equal terms to<br />\nstudents of all Christian<br />\nbodies.<br /><br />\nFF<br /><br />\nSIXTY-BIGfiTti YERR<br />\nbegins September 23, 1903.<br />\nAddress the President of<br />\nthe Faculty, the<br /><br />\nRey, Charles 0. Ball, D. D.<br /><br />\nGOP1101$300,000. SUMS 0116 undiviged PI0111 S400,000<br /><br />\nSTIEFF PIANOS<br /><br />\nDrovers sc<br /><br />\nMADE or min ufrasr MATERIAL\" MONEY<br />\nAP41/1 INXII.14IRIVINC)113 ('AN<br /><br />\nJUL<br />\nWAHNHoommi 9 N. LIBERTY ST.<br /><br />\nBooksellers and<br />\nStationers.<br />\n34 W. BRLTIMORE STREET.<br /><br />\nSchool, Law, Medical, Glassical and Miscellaneous Books.<br />\nKvp constantly on hand the Text Books used<br />\noi Johns Hopkins University and the Woman's<br />\nCollege of Baltimore.<br />\n5t,<br />\n!k<br />\nilk<br />\nSTfITIONBRY —For School, Pamily, Office and Bank.<br /><br />\nHaberdashers,<br />\nShirts, Nea1 wear,Underwear<br />\nMOOMMINEIMMINI Hosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\nOn Bale TheI H. Pennants,and ail other College<br /><br />\nTHOS.BLAKE C<br />\nPennants.<br /><br />\n219 EAST BALTIMORE ST.<br /><br />\nit General Banking Business Transacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom $3 per year and upward.<br /><br />\nFOR<br /><br />\nJOKDRN STfIBIDER GO.<br /><br />\nMA71718'4'1<br />\n:<br />\n0A<br />\n5VE.<br />\nReads as follows:<br />\nSamples submitted of<br />\nFrench Brandy—no adulterants,no coloring, tine quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong,<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br /><br />\nIlgenfritz Studio<br />\nSuccessor to Cummins.<br /><br />\nOF<br /><br />\nOren Letter fraternitv Jewelrv,<br />\nAND 16<br /><br />\nST. PAUL<br /><br />\nBALTIMORE,<br /><br />\nRecounts Solicited.<br /><br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LEHMAN &amp; SON.<br /><br />\nA.H. FETTING,<br />\n14<br /><br />\nNat'l Bank,<br /><br />\nL. Strouse, Vice-PrrNt<br />\nEdw. P. Hayden. Ass't, Cashier.<br /><br />\nClark, Prest<br /><br />\nChas. S. Miller, Cashier.<br /><br />\nGusfuNG sc GomrfiNy<br /><br />\nMANUFACTURER<br /><br />\nMOGilalliGS<br />\nOf BALTIMORE.<br /><br />\n1.)1.7Y.<br /><br />\nSTREET,<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n'BALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial Discount to Students.<br /><br />\nMD.<br /><br />\nPlease Call ant) lExamine our 'Line \"More Purchasing.<br />\nC. &amp; P. telephone 445g.<br /><br />\nLibraries arranged and put in<br />\nsr<br />\norder without removal.<br /><br />\nJENNINGS &amp; HORSEY.<br /><br />\need RUZICKA<br /><br />\nPFIRECIIIANr TAILORS,<br /><br />\n21 W. PAY<br /><br />\nr. :-4er<br /><br />\nv:<br /><br />\n4<br /><br />\nBOOKS ! I<br />\nSECOND=HAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nExchanged.<br />\nBought, Sold and<br /><br />\nJ. H. U. Binder.<br /><br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE<br /><br />\nTHEO. WARNER-<br /><br />\nWARNER &amp; CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br /><br />\nPIPPEN'S 1300t1 STORE,<br />\n605 N. EUTFVW ST.<br />\n.<br /><br />\nWear the University.<br /><br />\nBookbinder,<br /><br />\nBaltimore's Largest Old Book Store.<br /><br />\nAgents for Lincoln &amp; llennett and<br />\nWalter Barnard's London Huts.<br />\n324 WEST BALTIMORE<br />\nManufacturers of-<br /><br />\nand Cassimore Hats. so-<br /><br />\nSTREET.<br /><br />\nhop k<br /><br />\ns Caps<br /><br />\nNORM GERMAN LLOYD S. S. GO.<br />\nCABIN PASSAGE AT LOW RATES.<br /><br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBRLTIMORE TO BREMEN DIRECT.<br /><br />\nfl. SCHUhlfiGfIER Sc GO., General Agents.<br /><br />\nFor particulars apply to<br /><br />\nJAS. MEIKLE, VICE<br />\nISAAC H. DIXON, PRIEST.<br />\nJAS. R. RICHARDS, TREA•.<br /><br />\nTHE<br /><br />\nChas. Willms Surgical Instrument Co.<br /><br />\nSmith, Dixon Co.<br /><br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br /><br />\n300 N. Howard St.,<br /><br />\n'Baltimore, Md.<br /><br />\n29 - 31 S. Charles Sired.<br /><br />"}], "field_media_file": [{"target_id": 36270, "display": null, "description": null, "target_type": "file", "target_uuid": "93447783-008b-4d3f-ad8f-6981ccb1aa7f", "url": "http://digital.library.jhu.edu/system/files/2022-03/12244-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12244, "target_type": "node", "target_uuid": "fbaadcb8-c872-42c0-ab65-f29d7db6dcb0", "url": "/node/12244"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "fa2d11f3-b49c-4b4d-b2d5-dbf85771d2fc"}]}