{"mid": [{"value": 38009}], "uuid": [{"value": "c523ffb7-cc4e-419e-858f-6660fdb5abce"}], "vid": [{"value": 38009}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:45:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12577-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:45:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:45:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Member Of The<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nys<br />\n<br />\n3Joillts .1$13431titts Nrwri-Erttrr<br />\nHOMEWOOD, BALTIMORE, MD., TUESDAY, JANUARY 22, 1935.<br />\n<br />\nVol. XXXIX—No. 24.<br />\n01<br />\nIF;<br />\n<br />\net<br />\n<br />\n'1e4<br />\nre<br />\nre<br />\nJurlers<br />\n<br />\ndue<br />\n<br />\ntorJ<br />\n<br />\nProf. J. Franck<br />\nAppointed To<br />\nHead Physics<br />\n<br />\nDissects Doctors<br />\n<br />\nTwo Open Letters<br />\nStudent Council<br />\n<br />\nPrice, 5 Cents<br />\n<br />\nHis \"Pennies\" To Inflate<br />\n<br />\nNat. Student League<br />\n<br />\nMO<br />\n<br />\nY<br />\n<br />\nRed Nichols At<br />\nSecond Cotillion<br />\nSet For Feb. 8<br />\n<br />\n•<br />\nFrom the J. H. U. Chapter of the Na- To the Editor, the NEWS-Lm rat.<br />\nWith the approach of examinations<br />\ntional Student League<br />\nTo Daniel Willard, president of the the Student Council wishes to remind<br />\nBoard of Trustees, and Newton each student of his duty to uphold<br />\nPopular Dance Maestro And<br />\nWorld-Famous Physicist And<br />\nD. Baker, chairman of the com- and execute the principles of the<br />\n\"Pennies\" Band Secured<br />\nmittee to select new president of Honor System. The success and enNobel Prize Winner Gets<br />\nforcement of the Honor System is in<br />\nthe University:<br />\nFor Affair At Alcazar<br />\nAppointment As Professor<br />\nThe increasing acuteness of eco- the hands of the individual student.<br />\nnomic conditions during the past few It depends upon the supervision of<br />\nyears has, among other things, been each man over his own conduct. The<br />\nresponsible for arousing students from slightest suspicion that another is not<br />\ntheir lethargy to organize for the fulfilling his part of the contract<br />\nTentative Plans Being Made<br />\nExpected To Continue His<br />\nprotection of their rights and for the causes distrust and a collapse of the<br />\nconditions. mutual confidence which is the basis<br />\ncampus<br />\nimprovement<br />\nof<br />\nFor Musical Club PerformExperiments With MolecuThis movement has been met by many of the System, and it is expected of<br />\nance After Grand March<br />\nlar Phenomena And Light<br />\npresidents of universities and col- every Hopkins man to report to the<br />\nleges in a spirit of enlightenment typ- Student Council any violation, of the<br />\n\"Red\" Nichols and his nationallyDr. James Franck, world-famous<br />\nical of the Middle Ages. Universities System.<br />\n\"RED\" NICHOLS<br />\nknown<br />\n\"Pennies\" orchestra have been<br />\nphysicist and winner of the 1927 Nowhich were ostensibly devoted to freeThe individual is responsible for<br />\nengaged— for the Second Cotillion,<br />\nbel Prize in physics, has accepted an<br />\ndom of thought and speech became the success of the Honor System and<br />\nwhich will be held Friday, February 8,<br />\nappointment as professor of physics<br />\nthe scene of suppression and censor- therefore also responsible for the inat<br />\nthe Alcazar, it was announced yesUniversity,<br />\nand<br />\nHopkins<br />\nat the Johns<br />\nship.<br />\ndependence and freedom among the<br />\nterday by T. Rodgers Bartlett, chairDR. RICHARD C. CABOT<br />\nwill take up his duties at the beginCollege,<br />\nCity<br />\nof<br />\nRobinson<br />\nPresident<br />\nstudents which the Honor System<br />\nman of the Cotillion Board.<br />\n—Courtesy Sunpapers<br />\nning of the next scholastic year.<br />\nNew York, has especially distinguish- alone makes possible. However, stuTickets for the dance are on sale<br />\nfor<br />\nThe newly appointed professor of<br />\ned himself by expelling students<br />\ndents are expected not to leave an<br />\nnow by members and candidates of the<br />\nholding anti-war and anti-fascist examination room unless it is absophysics has done most of his work<br />\nBoard and in Levering Hall. Subscripmeetings and has violated a univer- lutely necessary. Also the signing of<br />\nin the development of the atomic<br />\ntion is $3 per couple and $2.50 stag<br />\ntheory in the line of light and molecusity tradition by inviting the police the examination book signifies that<br />\nif purchased before the affair.<br />\nlar phenomena. He is \"recognized in<br />\nonto the campus to break up student the student has neither given nor re- Local Quint To Journey To<br />\nA regularly featured dance orchesEurope and in this country as being<br />\nmass meetings. The school newspa- ceived any information.<br />\nCollege Park Tomorrow; tra on the Columbia chain, the enthe leading investigator in this exper, as well as several student orIn the past, students guilty of inganizations, has been abolished, and<br />\ntremely important field of physics,\"<br />\nEntertain W. Md. Friday semble is especially well known befringement of the Honor System have<br />\ncause of its unique opening signaaccording to Dr. Joseph S. Ames,<br />\nat least one instructor has been dis- been allowed to resign from the Uniture,<br />\n\"A Torrid Trumpet Wailing to<br />\nMedical<br />\nAssociation<br />\nRapped charged.<br />\nTwo major opponents will confront<br />\npresident Of the Johns Hopkins University without. standing trial. This<br />\nthe Four Winds,\" interpolated with<br />\nPresLouisiana<br />\nState<br />\nUniversity<br />\nAt<br />\nthe<br />\nbasketball<br />\nteam<br />\nJohns<br />\nHopkins<br />\nversity.<br />\nBy Principal Speaker At ident Smith has expelled several stu- action has resulted in considerable when the Jays encounter Maryland the theme song, \"The Wail of the<br />\nWhile at the Hopkins, Dr. Franck<br />\nupon application elsewhere<br />\nWind.\" It has since become one of<br />\nUniversity Supper Club dents for refusing to accept a cen- confusion<br />\nwill take the place which was preand therefore the Council insists that and Western Maryland this week. The radio's best-known musical labels.<br />\nsorship emanating from the Hon. a record be made of each trial and Darleymen will battle the Terrapins<br />\nviously held by Dr. Ames in the physReceived Nation-Wide Acclaim<br />\nDr. Richard C. Cabot, professor of Huey Long. Prevost Moore of Uni- construes Section 6, C 2, of the Con- at College Park on Wednesday. The<br />\nics department. He is expected to<br />\nAngeles<br />\nethics<br />\nat<br />\nHarvard<br />\nLos<br />\nUniversity,<br />\nCalifornia<br />\nat<br />\nsocial<br />\nversity<br />\nof<br />\nWestern<br />\nMaryland<br />\ntiff,<br />\na<br />\nleague<br />\nconNichols<br />\nand his original \"Pennies\"<br />\nand<br />\nmoleclight<br />\ncontinue his work in<br />\nstitution to indicate that the clause<br />\nand author of numerous volumes of suspended several students for insist- \"provided he considers defense use- test, will be staged in the new Hop- first won renown almost a decade ago<br />\nular phenomena.<br />\nthrough their recordings. Discs made<br />\nIt is reported that the place which medical literature, was the principal ing on their Constitutional right to less\" as indicative of his guilt and a kins gymnasium Friday night.<br />\nTraditional rivalry attracts much by the ensemble are still being used<br />\nwas previously held by Dr. Ames in speaker at the meeting of the Uni- hold an open forum.<br />\nrecord thereby shall be made with the<br />\ninterest to the Maryland game. For extensively in Europe, and in this<br />\nThis listing could be continued al- Registrar.<br />\nthe physics department has been va- versity Supper Club, held last TuesLevering<br />\nHall.<br />\nat<br />\nevening<br />\nday<br />\nyears this contest has been featured country, a current revival of phonoof<br />\npresident<br />\nJohns<br />\nat<br />\nthe<br />\n,was<br />\nmade<br />\nindefinitely.<br />\nHere<br />\nhe<br />\nmost<br />\ncant since<br />\nWM. C. MCCLEAN.<br />\non the Hopkins court schedule. The graph records is bringing back into<br />\nIntroduced by Dr. Howard A. Kelly Hopkins University, however, we<br />\nthe UniversitY%<br />\nTerrapins have this year, one of the popular favor a number of the orof the Johns Hopkins Medical School, have been fortunate in having an adServed In German Army<br />\nAMES<br />\nTO<br />\nADDRESS<br />\nstrongest teams in the State. Their chestra's recordings made about eight<br />\ninteresting<br />\ngranted<br />\nus<br />\na<br />\ntalk,<br />\nvehas<br />\nministration<br />\nwhich<br />\nDr.<br />\nan<br />\nCabot,<br />\nin<br />\nProfessor Franck served in the<br />\nseason has been most successful thus years ago.<br />\nfront lines of the German army dur- hemently denounced the present-day large measure of academic freedom; THURSDAY ASSEMBLY<br />\nfar. However, Blue Jay quints always<br />\nmind<br />\n\"absurdly<br />\nexto<br />\ncalls<br />\none<br />\nimmediately<br />\nas<br />\none<br />\nmedical<br />\nsystem<br />\nyet<br />\nAt present, the orchestra is on a<br />\ning the World War,and was decorated<br />\nplay inspired ball against Maryland tour of colleges throughout the cbunnot<br />\ninefficient<br />\nand<br />\na<br />\nspirit<br />\none<br />\nmanifestations<br />\nof<br />\nabsurdly<br />\ncertain<br />\npensive,<br />\nDr.<br />\npresident<br />\nof<br />\nJoseph<br />\nS.<br />\nAmes,<br />\nreceiving<br />\nfor his conduct there. After<br />\nof un- at all in keeping with this liberal at- Johns Hopkins University, will ad- and the game should be an intensely try. It is scheduled to play at the Balhis commission as lieutenant, Dr. in which an enormous number<br />\noperations<br />\nare titude: the presence of an R. 0. T. C. dress the student assembly this exciting one.<br />\nnecessary<br />\nsurgical<br />\ntimore Automobile Show on January<br />\nFranck returned to the University of<br />\nThe Terps have an excellent for- 25. Among the many places which<br />\nof dis- Thursday, January 24. The topic of<br />\nBerlin, where he received his doctor- performed.\" He also attacked the unit on the campus, the policy<br />\nan crimination against Negroes or, in the his speech has not been announced. ward combination in Waters and An- have featured the \"Pennies\" are the<br />\nate degree. After finishing a book on American Medical Association as<br />\npolitics.\"<br />\n\"dominated<br />\nby<br />\npast, the conversion of our University<br />\ninstitution<br />\nThere was no assembly last week dorka. Among the leading scorers in Hotels New Yorker and Park Central,<br />\nthe<br />\nwith<br />\nassociated<br />\nX-rays, he was<br />\nDepartment<br />\nWar<br />\nthe<br />\ninto<br />\na<br />\nunit<br />\nof<br />\ndue to the fact that Dick Harlow, the State, Waters has displayed splen- New York; the Ritz-Carlton, Atlantic<br />\nCondemns Cost Of Medical Care<br />\nUniversity of Goettingen in 1920 as<br />\nthe<br />\nand<br />\nsince<br />\nWar,<br />\nWorld<br />\nduring<br />\nthe<br />\nhead<br />\nfootball coach at Harvard, who did form all season, even when play- City; and the Lowry, St. Paul.<br />\nhead of the physics department.<br />\nThe Harvard savant condemned the<br />\n2)<br />\n3,<br />\nCol.<br />\nPage<br />\non<br />\n(Continued<br />\nwas scheduled to speak, sent word ing against the strongest teams in<br />\nNichols conducted the orchestraIn December, 1933, Dr. Franck cost of medical care. It wa,,,s this, he<br />\nTuesday<br />\nthat he would be unable to the country. His running-mate, An- tions of George Gershwin's Broadway<br />\ncame to the Hopkins to spend three felt, that made proper treatment an<br />\ndorka, plays a hard, rugged style of<br />\nappear.<br />\nproductions, \"Strike Up the Band,\"<br />\nmonths as guest professor of physics, imposkbility to the average individbasketball, and is capable of breakand \"Girl Crazy.\" He also appeared in<br />\nduring which time his lectures were ual. The average family spends from<br />\ning through for scores.<br />\nJoe Cook's \"Rain or Shine,\" in the<br />\nattended by members of the depart- $90 to $300 a year for sickness.<br />\nTwo Veterans On Team<br />\n\"Vanities,\" and in John Murray Anments of physics, chemistry, and elecHe gave the evolution of medical<br />\nWillis, an able center, will probderson's \"Almanac.\"<br />\ntrical engineering. In 1934; after leav- science as one reason for the increased Honorary Educational Fraternities<br />\nably start at the pivot post. The vetTender Dinner,- Mayor Jackson<br />\ning the Hopkins, he associated himself costs. In order to make a dependable<br />\nUnique Features Planned<br />\nerans, Butscher and Guckeyson, will<br />\nPresent At Function<br />\nwith Professor Bohr, another Nobel diagnosis of a case, a group of physiA special feature of the Hopkins somanage the defense. Both are excepPrize winner, at the University of Co- cians is required, the result of which<br />\ntionally dangerous because they are cial event will be the playing of two<br />\npenhagen.<br />\ndance numbers especially for seniors<br />\nis a greater expense on the part of Dr. Joseph S. Ames, president of the President<br />\nOf The Brookings high-scoring men as well as efficient and<br />\nJohns Hopkins University, was honthe patient.<br />\nmembers of the Cotilion Board.<br />\nExperimented With Light<br />\nguards. The reserves include Scheele,<br />\nInstitution<br />\nWill<br />\na dinner given by the Alpha<br />\nBe<br />\nat<br />\nored<br />\nSpeaker<br />\nThis<br />\nis a continuation of the custom<br />\nIncluded in the brilliant research<br />\nKeller,<br />\nand<br />\nDaly.<br />\nMedicine<br />\nAdvocates Socialized<br />\nRho Chapter of Phi Delta Kappa and<br />\ninaugurated at the Thanksgiving Coand discovery work which Dr. Franck<br />\nDespite<br />\nthis<br />\nformidable<br />\narray,<br />\nthe<br />\nAt<br />\nFounders<br />\nDay<br />\nFete<br />\norganized<br />\nDr. Cabot's proposal that<br />\nthe Chi chapter of Phi Lambda Theta,<br />\nhas done is the working out of the<br />\nBlue Jays are hopeful of putting an- tillion. Tentative plans are being comgroups of people should retain phy- honorary education fraternities, at the<br />\npleted for a rendition of songs by<br />\nchemical actions of light, which has<br />\nother notch in their victory belt.<br />\nDr.<br />\nHarold<br />\npresiGlenn<br />\nMoulton,<br />\nsicians on a year-round basis at a pre- Hotel Emerson last Saturday night.<br />\nthe<br />\nHopkins Musical Club following<br />\nbeen of priceless aid to photography.<br />\nThe Western Maryland contest will<br />\narranged payment, was enthusiastic- ,Dr. David E. Weglein, superinten- dent of the Brookings Institution in<br />\nthe grand march at midnight.<br />\nThe knowledge of the energy which<br />\nlast<br />\nHopkins<br />\nbasketball<br />\ngame<br />\nbe<br />\nthe<br />\nally received by the audience. In this dent of the Baltimore public school Washington, will be the principal<br />\nThe entire Alcazar, including the<br />\nis sometimes given off by atoms in the<br />\n'<br />\nlast year<br />\nmanner, he claimed that medical at- system, acted as toastmaster at the speaker at the Commemoration Day until after examinations.<br />\nmain ballroom, the Blue Room, and<br />\n(Continued on Page 3, Col. 1)<br />\nMaryland<br />\ncopped<br />\nthe<br />\nthe<br />\nWesterners<br />\ntention would be received at a much affair, which was attended by 200 exercises, February 22, in the audiCollege League title, and the Dar- the gymnasium, has been engaged for<br />\nreduced cost. It was Dr. Cabot's opin- persons.<br />\ntorium of the Peabody Conservatory. leymen came in second. The sole the affair. Refreshments will be<br />\nion that his system would raise the<br />\nThis celebration will mark the league loss which the Western Mary- served in the gymnasium during the<br />\nThe principal speech of the evenstandards of medical attention to new<br />\n•<br />\ning was presented by Dr. Isaac L. fifty-ninth anniversary of the found- land quintet had last year was a de- ball.<br />\nheights.<br />\ninauguUniversity<br />\nand<br />\nthe<br />\ning<br />\nof<br />\nthe<br />\nThe invited patrons and patronesses<br />\nKandel, professor of comparative edfeat at the hands of the Hopkins<br />\ninclude Dr. Joseph S. Ames, Dean and<br />\nucation at the Teacher's College of ration of its first president, Daniel cagers.<br />\nDramatic Critic Of Baltimore NewsCoit Gilman. The entire program has<br />\nthe Columbia University.<br />\nWith few veterans in their ranks, Mrs. E. W. Berry, Dr. and Mrs. R. P.<br />\nPost To Discuss \"The Baltibeen completed.<br />\nnot<br />\nMany Celebrities Present<br />\nthe Westerners are not exceptionally Cowles, and Dr. and Mrs. Broadus<br />\nmore Theatre, Tonight<br />\nThe noted lecturer on economic is- strong this season. However, they are Mitchell.<br />\nAmong those present to do honor<br />\nsues was born in LeRoy, Mich., and a fighting, spirited aggregation and<br />\nfamed<br />\nMayor<br />\nthe<br />\neducator<br />\nwere<br />\nto<br />\nLouis Azrael, dramatic critic of<br />\nHoward W. Jackson, Dr. Florence E. received his education at Albion Col- should provide the Jays with plenty<br />\nthe Baltimore News-Post, will speak Managing Editor Of 'Afro-American'<br />\nBamberger,<br />\nWendell E. Dunn, and lege. He was awarded the degree of of opposition.<br />\non \"The Baltimore Theatre\" tonight at<br />\nAddresses Interracial CommisSiegal, Siverd, and Rasin are the<br />\nMisses<br />\nMary<br />\nF. Sulzer, Marga- Ph.B by the University of Chicago in<br />\nthe<br />\n8:30 in the Playshop. Admission will<br />\nsion Last Monday<br />\nretta Collins, Emily Eversfield, Louis 1907, and seven years later the same Hopkins regular forwards. ChancelDr. Joseph S. Ames, president of<br />\nbe twenty-five cents.<br />\ninstitution gave him a doctorate de- lor will probably start at the pivot<br />\nH. Levin, and Howard W. Ford.<br />\nthe University, has been awarded the<br />\nMr. Azrael's lecture is the third of<br />\n\"The Negro Press\" was the subTwo scheduled speakers, Dr. John gree. Since then the Universities of post, while defense duties will no Langley gold medal by the regents<br />\na series offered by the Johns Hopkins ject on which William Gibson, manand J. W. Studebaker, were New York and Washington have hon- doubt be handled by Woodrow and of-the Smithsonian Institute for reRuhrah<br />\nPlayshop for the current season. Fol- aging editor of the Afro-American,<br />\nReynolds.<br />\nored him with LL.Ds.<br />\nattend.<br />\nto<br />\nunable<br />\nsearch in aviation.<br />\nlowing the talk, Adolf Colm's one- Baltimore's Negro weekly, addressed<br />\nChicago<br />\nAt<br />\nProfessor<br />\nDr. Ames since 1917 has been a<br />\nact play, \"The Fall of Massada,\" will<br />\nthe Interracial Commission, last<br />\nAfter instructing at the Evanston<br />\nmember<br />\nof the National Advisory<br />\nbe presented.<br />\nPage School Instructor<br />\nMonday evening at Levering Hall.<br />\nAcademy, he became a fellow in poCommittee on Aeronautics, and from<br />\nThe cast for this production inof<br />\njournals<br />\nthat<br />\n150<br />\nNegro<br />\nsaid<br />\nHe<br />\nAccepts Post In Chicago litical economy, finally obtaining the<br />\n1927 has served as chairman of that<br />\ncludes Harold M. Kropman, Myer Site, all over the United States, most of<br />\nposition of professor of economics at<br />\nbody. It was largely due to his reWalter Levy, Jenny Hoffman, Robert them are weeklies. This condition is<br />\nsearch on this committee that Dr.<br />\nOsborne, Henry Finck, and Elijah caused by the fact that the large na- Dr. Ernest B. Price Will Head Inter- the University of Chicago in 1922.<br />\nThe comprehensive examinanational House At The UniThe same year, Dr. Moulton was apAmes was awarded the medal, which<br />\ntions for the natural science<br />\nAdams. The play has been directed tion-wide press associations exclude<br />\nChicago<br />\nOf<br />\nversity<br />\npointed<br />\ndirector of the Institution of<br />\nhas been received by the greatest<br />\nFinestein.<br />\ngroup of the College of Arts and<br />\nby Jacob<br />\nNegro papers from membership.<br />\nEconomics in Washington, D. C., and<br />\nnames in aviation.<br />\nSciences have been scheduled for<br />\nTo Give Play In March<br />\nHe added that in order to remedy<br />\n1928, he was given his present poin<br />\nDr. Charles G. Abbott, secretary<br />\nPrice,<br />\nassociate<br />\nmemB.<br />\nThe essay for this<br />\nErnest<br />\n5<br />\nand<br />\n6.<br />\nApril<br />\nDr.<br />\nassociapress<br />\nVanya\",<br />\nNegro<br />\n\"Uncle<br />\ndifficulty,<br />\na<br />\nthis<br />\nIn early March,<br />\nsition as president of the Brookings<br />\nthe Smithsonian Institute, added,<br />\nHines<br />\nof<br />\nPage<br />\nSchool<br />\nWalter<br />\nthe<br />\n11,<br />\nand<br />\ndue<br />\nMarch<br />\ngroup<br />\nis<br />\nthe<br />\nber<br />\nof<br />\nAnton Chekov's great play, will be tion was formed, but although it has<br />\nInstitution.<br />\n\"The regents of the Institute feel that<br />\nRelations<br />\nat<br />\nthe<br />\nUse<br />\nis<br />\n\"The<br />\nInternational<br />\ntreated<br />\nsubject<br />\nto<br />\nbe<br />\nof<br />\nnot<br />\nyet<br />\nhas<br />\nPresented by the Playshop. The in- proved quite useful, it<br />\nthis country has made great strides<br />\nof Radioactivity in the Various<br />\nJohns Hopkins University, has acAs an author or joint author, he has<br />\ncomplete cast so far includes Patty reached a degree of efficiency high<br />\nin<br />\nthe field of aviation in recent years,<br />\nas<br />\ndirector<br />\nappointment<br />\nbe<br />\nare<br />\nto<br />\n\"The<br />\nessays<br />\nbooks<br />\nas<br />\nPrinciples<br />\nSciences.\"<br />\nThe<br />\nsuch<br />\ncepted<br />\nhis<br />\nwritten<br />\nSingerwald, Mary Alvey, Cyril Kader, enough to make daily publication a<br />\nin the matter of speed and safety,<br />\nfrom three to five thousand words<br />\nof the International House at the Uni- of Money and Banking\", \"The AmerDavid Kurland, S. Vannort Chapman, possibility.<br />\nand that we are ahead of other counit was announced ican Transportation Problem,\" and<br />\nin length.<br />\nThe next meeting of this group, to versity of Chicago,<br />\n)3en Rosenberg, and Helen Ascherfeld.<br />\nother<br />\ntries in this respect. We feel this is<br />\nschedules<br />\nfor<br />\nthe<br />\nWorld<br />\nProsperity.\"<br />\nThe<br />\nand<br />\nTuesday.<br />\nDebts<br />\n\"War<br />\na<br />\nfeature<br />\nwill<br />\n11,<br />\nAt the regular monthly meeting of be held February<br />\ndue to the work of the commade<br />\nlargely<br />\nbeen<br />\nnot<br />\nyet<br />\nhave<br />\ncontributed<br />\nmany<br />\nargroups<br />\nhas<br />\nMoulton<br />\nDr.<br />\nFormerly the American Consul to<br />\nthe dramatic group held last Tues- talk on \"Civilization in Ancient Afand<br />\nto Dr. Ames' guidance of<br />\nsomemittee<br />\nexpected<br />\nbut<br />\nthey<br />\nare<br />\ncurrent<br />\nmagazines,<br />\ndiscussing<br />\nup,<br />\nto<br />\nticles<br />\naswill<br />\nPrice<br />\nDr.<br />\nChina,<br />\nFoochow,<br />\nday night, 'two one-act plays were rica,\" given by Dr. William Lee<br />\nthe work of the body as its chairtime after the mid-year examinconditions, and is a promeconomic<br />\nInternational<br />\nthe<br />\nat<br />\nduties<br />\nhis<br />\nsume<br />\nanthropology<br />\nof<br />\nprofessor<br />\nmemHansbury,<br />\nthe<br />\ncriticized<br />\nby<br />\nPresented and<br />\nman.\"<br />\nations.<br />\ninent lecturer on the subject.<br />\nHouse February 1.<br />\nat the Howard University.<br />\nbers.<br />\n<br />\nTickets $3.00,$2.50<br />\n<br />\nTo Replace Dr.Ames<br />\n<br />\n7<br />\n<br />\nBASKETBALL:<br />\nTOMORROW NIGHT—<br />\nHopkins vs. Maryland<br />\nFRIDAY—<br />\nHopkins vs. Western Maryland<br />\n<br />\nJays Face Terps,<br />\nTerrors In Court<br />\nTests This Week<br />\n<br />\nDr. Richard Cabot<br />\nAttacks Medical<br />\nSystem As Absurd<br />\n<br />\nAmes Honored At<br />\nFraternity Dinner Dr. Harold Moulton<br />\nTo Deliver Speech<br />\nAt Commemoration<br />\n<br />\nLouis Azrael Will<br />\nAddress Playshop<br />\n<br />\nGibson Discusses<br />\nNegro Journalism<br />\n<br />\nAmes Wins Langley<br />\nAeronautical Medal<br />\n<br />\nNatural Science<br />\nExamination Apr.5<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MD., JANUARY 22, 1935.<br />\n<br />\n2<br />\n<br />\nUbelRews-1Lietterl<br />\n<br />\nLETTERS<br />\n<br />\nFOUNDED 1897<br />\n<br />\nTO Til E<br />\n<br />\nVilla Of<br />\n<br />\nDEAF, DUMB<br />\n<br />\nGood Fortune<br />\n<br />\nThe editor of the NEWS-LETTER<br />\nhas been requested by columnist<br />\nKropman to apologize for the use<br />\nof Herb Degen's name as author<br />\nof the column appearing in last<br />\nTuesday's issue. Ever ready to<br />\noblige, the editor hereby extends<br />\nhis most humble apology—to Mr.<br />\nDegen.<br />\n<br />\nand BLIND<br />\n<br />\nSo dainty and so neat,<br />\nImagine my surprise and anger last<br />\nmy heart would nurst,<br />\nthought<br />\nI<br />\npubwas<br />\ncolumn<br />\nmy<br />\nwhen<br />\nTuesday<br />\nBy JACK STEIN<br />\nSo wildly did it beat.<br />\nlished signed by someone else. It all<br />\nTo the Editor, the NEWS-LETTER:<br />\nNo other hand ne'er held so tight,<br />\nthe last button off my<br />\nRemit subscription fees to TreasurThe recent Olynthus expedition, but knocked<br />\nI have heard disquieting rumors to<br />\nCould greater gladness bring,<br />\ncollar.<br />\nmy<br />\noff<br />\nbutton<br />\nthe<br />\nand<br />\nvest<br />\ner, Student Activities Council, Remheaded by Dr. David Moore Robinson<br />\npast<br />\nthe<br />\nconsider<br />\nyou<br />\nthat<br />\neffect<br />\nthe<br />\nthe one I held last night—<br />\nThan<br />\nHopkins<br />\nJohns<br />\nhad<br />\nPostoffice,<br />\nerror<br />\nsen Hall,<br />\neminently more suc- To think that such a grave<br />\nOmicron Delta Kappa selections not was considered<br />\nWhich was,<br />\nUniversity.<br />\nby<br />\ned<br />\nundiscover<br />\ngo<br />\nto<br />\nallowed<br />\nbeen<br />\nprevious one, on the<br />\nBy HAROLD M. KROPMAN<br />\nall they might have been in regard to cessful than the<br />\n• Four aces and a king.<br />\nproof-reading0<br />\nEntered as second-class matter De- both specie and number. Why look at basis of the discovery of that archae- the very competent<br />\ntochewing<br />\nto<br />\nme<br />\n(All those who like the above poem,<br />\nin<br />\ndrove<br />\nalmost<br />\nPostoffice<br />\nstaff,<br />\nthe<br />\ncember 3, 1909, at<br />\nological gem, the Villa of Good Forpected, and all because their beds are but are not in sympathy with the auBaltimore, Md., under the Act of Con- things on their blackest side? Has<br />\nbacco.<br />\nor country club.<br />\nit occurred to you that they might tune, a casino<br />\ngress, November 3, 1879.<br />\ntoo short.<br />\nthor are requested to sign the folI sought the persons who had alThe villa is fifty-five feet wide and<br />\nhave been worse? If it hasn't, you are<br />\nconsuch<br />\ntime<br />\nlowing personal pledge: \"No Monopis<br />\nabout<br />\nit<br />\nthink<br />\nI<br />\ncommitted<br />\nbe<br />\nto<br />\ndeed<br />\na<br />\nsuch<br />\nPublished semi-weekly from Octo- simply nearsighted.<br />\neighty-four and one-half feet long. It lowed<br />\nditions were stopped being treated oly, Part-Time Service, All-Time<br />\ndemanded<br />\nand<br />\neyes,<br />\nvery<br />\ntheir<br />\nunder<br />\nber to June, except during examinaPersonally, I am well satisfied with consisted of two stories, contained<br />\nvery lightly. Let the school get several ex- Trust and Loyalty, and a Big Thrill.\"<br />\ntion and college holiday periods by<br />\npossessed an explanation. They were<br />\nundergraduates of the Johns Hopkins the men inducted by our omniscient upwards of ten rooms, and<br />\nwas tra-length beds and I will personally<br />\nthat<br />\nthat—but<br />\nall<br />\nand<br />\napologetic<br />\n0-0<br />\nUniversity.<br />\nOmicrons, who have, I believe, done broad galleries. The villa had been<br />\nWhat about assure the authorities that there will<br />\nconditions.<br />\nalleviating<br />\nnot<br />\nfragthat you haven't as<br />\nevent<br />\na monstrous job in the way of fer- burned by a fire, and numerous<br />\nthe<br />\nIn<br />\nthe person whose name had been used be a demand for them each year. If<br />\nEDITORIAL DEPARTMENT<br />\nfrom the<br />\nhand-bill<br />\na<br />\nreting out hidden talent. I shudder ments of charred wood, and halfreceived<br />\nyet<br />\nof<br />\nElisize<br />\nthe<br />\npeople<br />\ntwo<br />\nThink of the mortifica- necessary,<br />\nStanley E. Blumberg....Editor-in-Chief at the thought of those three indi- baked mud bricks were found. Shat- so unjustly?<br />\nHolliday<br />\nNorth<br />\n225<br />\nMuseum,<br />\nPeale<br />\nManaging Editor<br />\ntion and shame he must have suf- jah Adams will be assigned to each<br />\nMelvin Goldberg<br />\nyour<br />\nfrom<br />\noff<br />\ntime<br />\nsome<br />\ntake<br />\nviduals, thrice blessed with scholar- tered roof tiles were discovered all<br />\nStreet,<br />\nbeds.<br />\nlong<br />\nfered because of their little slip. Some of these extra<br />\nJesse Borden, Neal Potter,<br />\nship, character and leadership, pass- about the house.<br />\nexams and see the current exhibit.<br />\nhad<br />\nhe<br />\nthink<br />\n0-0<br />\npeople would actually<br />\nAssistant Managing Editors ing down into the oblivion towards<br />\nThere are attractions from Lincoln,<br />\nThe villa was evidently a gambling<br />\nwritten that column.<br />\nFrom the economics department Washington, Booth, Buffalo Bill, etc.<br />\ns,<br />\nevias<br />\nUnomicron<br />\ncent<br />\nper<br />\none,<br />\n97<br />\nwhich we,<br />\nhouse, and a very popular<br />\n0-0<br />\nBUSINESS DEPARTMENT<br />\ncomes the story that one of its pro- It is an extremely interesting exhibit<br />\nare swiftly headed. I am glad I didn't denced by the amount of gaming<br />\nBusiness Manager<br />\nRay Goldberg<br />\ncomplaint<br />\na<br />\ncomes<br />\ndorms<br />\nhad inspected a war-time of- and worth your while. Admission free.<br />\nthe<br />\nI<br />\nnever<br />\nfessors<br />\nfor<br />\nFrom<br />\nhave the task of choosing,<br />\nspace and facilities provided. In order<br />\nAdvertising Manager<br />\nBert Gordon<br />\nthe war. Several days<br />\nduring<br />\nall<br />\nin<br />\nfice,<br />\nI<br />\nindeed,<br />\nthe<br />\nthem,<br />\nof<br />\nand<br />\nfound<br />\nhave<br />\nlayout<br />\nthere,<br />\nthe<br />\nwould<br />\nairing<br />\nbeen<br />\nunderstand<br />\nhas<br />\nto<br />\nbetter<br />\nwhich<br />\nOffice Manager<br />\nCharles Hastings<br />\n0-0<br />\nCirculation Manager of two years at this University, I had villa, let us imagine ourselves in a think needs a public airing. Sid Mil- later, while talking with some friends<br />\nDavid Levy<br />\nI wonder if the Hi-Hat will honor<br />\nwho also had made the inspection,<br />\nnever even heard of them.<br />\nhuge open court with various rooms<br />\nand Lou Kramer, erstwhile inwas asked why he Hopkins' cards now that it is in the<br />\nK. along three sides. The court is beau- ler<br />\nD.<br />\nprofessor<br />\n0.<br />\nthe<br />\non<br />\nhard<br />\ntoo<br />\nbe<br />\nnot<br />\nLet's<br />\n1935.<br />\n22,<br />\nJanuary<br />\nTuesday,<br />\nMemorial Hall, have thought the officers in the offices wore hands of receivers?<br />\nAfter all, they only bother us once tiful, having huge pillars, and marble mates of Alumni<br />\na year. The best way to cope with the benches where those weary of gaming been forced to sleep these many cold spurs. He replied, \"It seems—to keep<br />\nMEMBER<br />\n0-0<br />\nsituation is to be kind and patient, may rest while gazing at the famed nights with their feet extended, air- their feet from sliding off the desk.\"<br />\nTo the story about Mitchell and<br />\nThanks, Doc.<br />\nan occasional slap on the back and sunny skies of Greece. The first room ing, through the bottom of their beds.<br />\nGlitoWeDigessi 1935<br />\nprinted in my column last week<br />\nHenry<br />\nWI5CON5iN.<br />\nMANSON<br />\nutter a few simple jollities and 0. D. on the left is large and well guarded.<br />\n0-0<br />\nadd this last line omitted by mistake-Now don't get the wrong idea. NothK. will soon be purring its way back For here is the wine cellar from which<br />\nFrom the U. S. S. Chicago Big Shot \"You have a flashlight mind alright,<br />\nwrong with their feet; in fact,<br />\ninto the woodwork. Then, too, one come spirits to satiate the unending ing is<br />\nbut your bulb is burned out.\"<br />\nLast night I held a little hand,<br />\nADD 0. D. K. controversy: Word re- should keep in mind that if one must thirst of Greek youth. The next room they get very cold, as would be exceived from a reliable source enables have one's heroes, it is certainly far along the line is evidently a corridor<br />\nus to pass on the information that more efficient and cheaper to allow facing the entrance.<br />\nWashington and Lee University, them to decorate themselves.<br />\nIt is in this corridor that a long<br />\nTill the day when I can sigh with a pebble mosaic is located. The mosaic<br />\nwhere the honorary fraternity was<br />\noriginally conceived and incepted, sad smile, \"This quiet dust was 0. D. is nineteen and a half feet long, and<br />\npursues a policy in electing its mem- K.,\" I should like to institute an hon- nine and three-quarters feet wide.<br />\nbers strikingly similar to that advo- orary fraternity whose only requisite' There are three wide borders around<br />\ncated in these columns for the past would be a non-membership in Omi- the panel. The main scene is that of<br />\ntwo weeks. W. and L. seeks neither cron Delta Kappa. What we lacked Achilles seated on a rock, and being<br />\nsupermen nor activity hounds; sur- in the three cardinal virtues, we approached by Thetis. Thetis is folprisingly enough, it satisfies itself should more than compensate for in lowed by two Nereids or sea serpents,<br />\nwith inducting deserving leaders of number and vices.<br />\nthe first having a shield of red pebRespectfully,<br />\nrepresentative campus organizations.<br />\nbles and the second carrying a spear<br />\nM. V. D.<br />\nThis, remember, in the institution<br />\nof red pebbles with black dots.<br />\nwhich first housed an Omicron Delta<br />\nThere is a great noise coming from<br />\nKappa chapter.<br />\na nearby room, and when we investiIn accordance with the decidedly<br />\ngate the cause for the sound, we<br />\npetulant request of a member of the<br />\ndiscover the room to be the gentleHopkins circle, we have determined<br />\nmen's rest room. In this room John<br />\nStudent football players at Beckley Smith (I can't say it in Greek) is<br />\nto make further comment on the local<br />\nsituation short and as sweet as pos- Business College have filed a suit for sitting with his group of friends and<br />\nsible. We presume that he will ap- back wages at Cumberland County telling about the dates they had last<br />\npreciate the import of the above re: Court. They announced that the sal- night. Jack Dalton (no savvy in this<br />\nmarks in their composite form. Even ary for playing football was two hun- case either) is gazing moodily at the<br />\ngall and wormwood comes in small dred and seventy-five dollars a year. beautiful mosaic floor. Jack lost a lot<br />\n• * *<br />\npackages.<br />\nof money today on the dice and is<br />\nPresident Angell of Yale says that wondering how he will be able to get<br />\na historical novel is like a bustle—it's along until his next allowance is<br />\na fictitious tale based on stern reality. given him. But our attention is<br />\n*<br />\n*<br />\nT.<br />\nRonald<br />\nDr.<br />\nby<br />\nCEMENT<br />\nANNOUN<br />\nquickly drawn down to the mosaic,<br />\nobscure to us,<br />\nlittle<br />\na<br />\nis<br />\nreason<br />\nThe<br />\nAbercrombie that the 1934-35 athletic<br />\nand we notice carefully the details.<br />\na<br />\nbudget will not permit the purchasing but students at Akron University at<br />\nThe mosaic contains some fifty<br />\nof sweaters for recipients of the var- recent poll voted in favor of retaining thousand pebbles, mostly black and<br />\nsity \"H\" is not to be passed off too their 8 o'clock classes instead of com- white. In the central panel is a youthlightly. It is a definite indication that ing half an hour later, as they could ful Dionysus driving his biga drawn<br />\nthe athletic association was entirely have done.<br />\nby two panthers. The box and reins<br />\n* * *<br />\ncognizant of the fact that it would be<br />\nof the car are in red pebbles. A tall<br />\nIt's a common belief (among junior<br />\nunable to provide the traditional \"H\"<br />\nnude figure heralds the approach of<br />\nsweater when it was in the process and senior) that the average univer- the biga and its occupant by running<br />\nthan<br />\nof drafting the budget. In other words, sity student has acquired more<br />\nconveyance. Around the<br />\nfor ahead of the<br />\nknowledge<br />\nof<br />\namount<br />\naverage<br />\nthe<br />\nn<br />\noccathe surprise and indignatio<br />\nis a border of dancing<br />\npanel<br />\nthis to central<br />\nsioned by Dr. Abercrombie's report a person his age. They hold<br />\nsatyrs, and a Pan.<br />\nmaenads,<br />\nfigures,<br />\nand<br />\nwas limited to the ranks of prospec- be particularly true of juniors<br />\nAs we leave to visit the dice room,<br />\ntive undergraduate recipients. The seniors,<br />\n• * *<br />\nwe notice beneath our feet the mosaic<br />\nassociation had long since mastered<br />\nway. Evidently we<br />\nP. Lorillard Co.,Inc.<br />\nHamilton College is offering a in the entrance<br />\nwhatever original feeling of regret<br />\na hurry to notice<br />\nof<br />\nmuch<br />\ntoo<br />\nin<br />\nwere<br />\nonly<br />\nopen<br />\n$500,<br />\nof<br />\np<br />\nand dismay it may have experienced. unique scholarshi<br />\nand it is well worth<br />\nto men by the name of Leavenworth. it on the way in,<br />\nAnyone who has paid the least atis done in about<br />\nmosaic<br />\nThe<br />\nnoticing.<br />\nare<br />\nname<br />\nthat<br />\nby<br />\nAll men in America<br />\ntention to the athletic revolution now<br />\npebbles and dethousand<br />\neight or ten<br />\neligible.<br />\nin effect at the University should have<br />\n* * *<br />\npicts two Pans standing with horns,<br />\nlittle difficulty in resolving this situand body, and goat's<br />\nThe whole population of the State bared breasts<br />\nation to its fundamental premises.<br />\non tiptoe, leaning<br />\nstand<br />\nThey<br />\nlegs.<br />\nof Nevada could be seated in the staObviously, the newly installed intrahands thrown<br />\ntheir<br />\nwith<br />\nforward<br />\n.<br />\nUniversity<br />\nStanford<br />\ndium of<br />\nmural program, with its attendant<br />\n* * *<br />\nback.<br />\noutlay for instructors, equipment, etc.,<br />\nAs we approach the dice room, we<br />\nTime, the game of<br />\nto<br />\nAccording<br />\nhas been the recipient of the lion's<br />\nthe cubes against<br />\nbasketball with the possible exception hear the click of<br />\nshare of funds this year. That the<br />\nthey are rolled.<br />\nwhich<br />\non<br />\nmosaic<br />\nthe<br />\nfurof the New York Stock Exchange<br />\nassociation displayed commendable<br />\nwheel<br />\ns with most statis- Below and to the right of the<br />\nnewspaper<br />\nnishes<br />\njudgment in this particular is not to<br />\nof St. George.<br />\ncross<br />\nthe<br />\nout<br />\nworked<br />\nis<br />\ntics.<br />\nbe questioned, much less denied; the<br />\n*<br />\n*<br />\nIt is simple, but beautifully executed.<br />\nstudent<br />\nenthusiasm with which the<br />\nthe time for the<br />\nStudents at the University of Chi- Wait! Here comes<br />\nbody has taken to the program, and,<br />\nwinner of this<br />\nThe<br />\nthrow.<br />\nVenus<br />\nreal<br />\nexcept<br />\nexams,<br />\ncago are not graded on<br />\nmore important, its apparent tendency<br />\nsum<br />\nives, since they serve throw not only collects a large<br />\ncomprehens<br />\nthe<br />\nto serve as a genesis for a well-ordbenificence<br />\nthe<br />\nenjoys<br />\nbut<br />\nmoney<br />\nof<br />\nonly to acquaint them with unfamiliar<br />\nered and sadly-needed school spirit,<br />\n* * *<br />\nof the Goddess Venus. There's Jack<br />\nmaterial.<br />\nN. CHARLES STREET<br />\nthe<br />\nto<br />\nevidence<br />\nfurnish irrefutable<br />\nthe corner. We wonder whether he<br />\nin<br />\nMost recent statistics from an inGreeting Cards - Sending Library<br />\ncontrary.<br />\nmoney to pay<br />\nvestigation at U. of Iowa inform us will even have enough<br />\nOpen Evenings<br />\nBut the Charybdis which beset the that out of eleven campus engage- the entrance fee. Yes, he evidently<br />\nassociation at the very outset of its ments one results in marriage.<br />\nhas, because he is walking to the desk<br />\ndeliberations and which seems to have<br />\nof the scribe. We watch the rolls with •<br />\n* * *<br />\nPhone Belmont 7908<br />\nexacted its inevitable toll resided in<br />\nexcitement, and cheer loudly each<br />\nIt took a group of students of highthe<br />\nupon<br />\nemphasis<br />\nhis<br />\nof<br />\nmakes<br />\nJack,<br />\nminimizing<br />\nthe<br />\ntime our favorite,<br />\ner studies to come to the conclusion<br />\nsignificance traditionally attached to<br />\nThe popularity of the new<br />\nroll. Finally Jack wins, and now when<br />\nconverthe<br />\nof<br />\nSt. Paul at 33rd Street<br />\nproportion<br />\ngood<br />\na<br />\nthat<br />\nhome, his father<br />\nmembership on a varsity team as -exFlex is spreading like<br />\nhis<br />\nto<br />\nSwank<br />\nreturns<br />\nhe<br />\nndy<br />\nSupplies-Ca<br />\nhool<br />\nPrescriptions-Sc<br />\nsation among members of one sex is<br />\narms.<br />\nopen<br />\nemplified by the \"H\" sweater. Along<br />\nwith<br />\nhim<br />\nwelcome<br />\nwill<br />\nwildfire — because smartly<br />\nCigars - Unexcelled<br />\nabout members of the other sex.<br />\nService<br />\nFountain<br />\nwith the present democratizing intramen appreciate its<br />\nconcludes<br />\ndressed<br />\nabout<br />\njust<br />\n*<br />\n* *<br />\nThis attraction<br />\nmural policy there should be this<br />\n—<br />\nfeature<br />\nrewe<br />\nso<br />\nmain<br />\nday,<br />\nthe<br />\nfor<br />\nexcitement<br />\nthe<br />\ngrid<br />\nfamed<br />\nFred Borries, Navy's<br />\nhigher goal which to enterprising athThis feature permits adjustof the largest turn to our homes and await expectis<br />\nthe<br />\nholder<br />\nstar,<br />\nletes might attain; certainly the two<br />\nbe old<br />\nment at any desired style annumber of \"N stars\" ever won' by a antly the day when we will<br />\nare compatible. For the association to<br />\nperwill<br />\ngle and allows both collar<br />\nfathers<br />\nour<br />\nthat<br />\nso<br />\nenough<br />\npreis<br />\ninsignia<br />\nstar<br />\nn.<br />\nThe<br />\nmidshipma<br />\nremove this Olympian summus maxtie to fall in natural lines.<br />\nand<br />\ngamble.<br />\nsented to athletes who take part in mit us to<br />\nimus smacks of a mistaken sense of<br />\nto attach.<br />\nEasy<br />\nand<br />\nmorning<br />\nwhich<br />\nArmy<br />\nnext<br />\nthe<br />\nathletic contests against<br />\nWe wake up<br />\neconomy or of value—possibly both.<br />\nhave been won by the Navy.—Asso- find ourselves at Johns Hopkins!<br />\n(only a week from exams.).<br />\nciated Collegiate Press.<br />\n* * *<br />\nSTONE'S THROW FROM THE!<br />\nSome of the subject matter of the<br />\nin f<br />\n4<br />\narticle<br />\nan<br />\nfrom<br />\ntaken<br />\nwas<br />\nin<br />\nabove<br />\nstudents<br />\ncollege<br />\nof<br />\nCAMPUS<br />\nnumber<br />\nThe<br />\nJewelry, First Floor and<br />\nTHE PARENT of another of our unissue of the \"American<br />\nJanuary<br />\nthe<br />\napincreased<br />\nhas<br />\nStates<br />\nUnited<br />\nthe<br />\nlast<br />\naway<br />\nMan's Shop, First Mezzanine<br />\npassed<br />\ndegraduate students<br />\nCuisine<br />\nExcellent<br />\nJournal of Archaeology\". The article<br />\nFriday in the person of Dr. James M. proximately 900 per cent since 1900,<br />\nis on \"The /Villa of Good Fortune at<br />\ncontry<br />\nthe<br />\nof<br />\npopulation<br />\nthe<br />\nwhile<br />\ntogether<br />\nDelevett. The NEWS-LETTER,<br />\nOlynthus,\" and was written by Dr.<br />\ncent.<br />\nwith the entire University, extends has increased only 63 per<br />\nM. Robinson.<br />\nDavid<br />\n41.111.10.0.•••••••••••••••••••••.••••••••••••••••••••••••••••••••••••••••<br />\nprove<br />\nto<br />\ngoes<br />\nall<br />\nheartfelt sympathy to his son, Allen. Which<br />\nSubscription per year<br />\nBy Mail<br />\n<br />\n$2.00<br />\n$2.50<br />\n<br />\nEDITOR<br />\n<br />\nA4<br />\n0]<br />\n<br />\nAssotiatrd goilesita? Vress<br />\nIt Rains Evidence<br />\n<br />\neciried by a Windbag<br />\n<br />\n..<br />\n<br />\nazH 0/61goki<br />\n<br />\nIntercollegiates<br />\n<br />\nGiving The Assn.\"H\"<br />\n<br />\ntkett‘<br />\n<br />\nIf you're<br />\n<br />\ncornered at a fancydress ball by a tedious \"ME-Man,\" don't let the<br />\npest spoil your party. Count ten and light a<br />\nsunny-smooth Old Gold. Every puff of a mellow,<br />\nmild 0. G. is like a friendly pat on the back.<br />\n<br />\n‘trir TRYING TIMES .... TRY A Smooth, OLD GOLD<br />\n<br />\n1<br />\n<br />\nNooney Book Shop<br />\n1902<br />\n<br />\nBirely's Pharmacy<br />\n<br />\nFirst in Baltimore!<br />\n<br />\nA NEW IDEA<br />\nIN COLLAR<br />\nHOLDERS<br />\n<br />\nEAT AT THE<br />\n<br />\nIn Memoriam<br />\n<br />\nt<br />\n<br />\nBoulevard<br />\nnt<br />\nRestaura<br />\n4<br />\nA<br />\n<br />\nt<br />\n<br />\n3226 Greenmount Ave.<br />\n<br />\n:10e and $411<br />\n<br />\nswnmi<br />\n<br />\nHOCHSCHILD,K0111N&CO.I<br />\n<br />\nSay,<br />\n<br />\n1Vit<br />\nAcc<br />\n<br />\nsoeia<br />\naeCLE<br />\n<br />\nof in<br />\nberg<br />\n<br />\nJohn<br />\ndress<br />\nLeap<br />\ntion<br />\nout<br />\nthe i<br />\ntrig(<br />\nfour<br />\nimp(<br />\n<br />\nempl<br />\nPirs1<br />\nenv]<br />\nsem<br />\nUlm(<br />\nOf lc<br />\nadm:<br />\nat 11<br />\nWonl<br />\ninus1<br />\nPloy<br />\nthe<br />\nci<br />\n<br />\nproo<br />\nof t<br />\nSlur<br />\nColn<br />\nOr c<br />\nhew<br />\n<br />\nbill<br />\n<br />\nof ti<br />\n<br />\n'fit<br />\n<br />\nfor<br />\nthe<br />\nane(<br />\n<br />\nErn<br />\nlast<br />\nrflor<br />\nbill<br />\nof 1<br />\nof 1<br />\n<br />\nTier<br />\n<br />\ngov<br />\nact<br />\nhe<br />\n<br />\nby<br />\nof 1<br />\nfay<br />\ntry<br />\n<br />\ngrE<br />\nder<br />\nea'<br />\nan<br />\n<br />\nen<br />\n<br />\n\fHOME WOOD, BALTIMORE, MD., JANUARY 22, 1935.<br />\n<br />\n1)11. Blumberg<br />\nAddressesN.S.L.<br />\nOn Insurance<br />\nSays Continuity Of Income Is<br />\nFundamental Objective To<br />\nBe Sought By Employees<br />\n<br />\nMust Insure Income<br />\nAccuses Administration Of<br />\nAttempting To Enact Bill<br />\nDevoid Of This Main Ideal<br />\n<br />\n3.<br />\nit<br />\n<br />\n\"The fundamental objective of any<br />\nsocial insurance program must be to<br />\nsecure for all employees a continuity<br />\nof income,\" said Dr. Albert E. Blumberg, instructor in philosophy at the<br />\nJohns Hopkins University, in his address before the National Student<br />\n<br />\nMeier Katz Memorial<br />\nGii?en To Page School<br />\nMrs. Jacob Blaustein, of Baltimore, has offered the Walter Hines<br />\nPage School of International Relations at the Johns Hopkins University a lectureship in honor of<br />\nher father, Meier Katz, it was announced by Dr. Frederick Sherwood Dunn, associate member of<br />\nthe Page School and Creswell Lecturer on International Law.<br />\nThe Meier Katz Memorial Lectureship provides for two or three<br />\nlectures each year on international<br />\nproblems. Speakers have not yet<br />\nbeen selected, and the lectures will<br />\nnot begin until next year.<br />\n<br />\nN.S.L. Open Letter<br />\nDemands Liberality<br />\nIn New President<br />\n(Continued from Page 1, Col. 3)<br />\nWar we have had nothing to assure<br />\nus that the same course will not again<br />\nbe followed. The University has not<br />\ndevoted itself openly and avowedly to<br />\nthe real problems which are confront-<br />\n<br />\nHopkins Undergrads Attack<br />\nA.C.E. Peace Poll Questions<br />\n<br />\nTelegram To The Editor<br />\nLDB 17 DH-BALTIMORE MD 15<br />\nJohns Hopkins News-Letter<br />\nBalto<br />\nShipmun B. Wilcox, Superintendent of Western Union, announced<br />\ntoday that his company has placed<br />\nits nation-wide system of telegraph<br />\noffices at the disposal of President<br />\nRoosevelt's Birthday Ball Committee for receiving 25 cents from each<br />\nperson who places his signature on<br />\na multiple signature birthday<br />\ngreetings telegram addressed to<br />\nthe President. Signatures from every city, town and hamlet in the<br />\nState of Maryland, as well as other<br />\nStates in the Union, will be mailed<br />\nto New York City, where they will<br />\nbe bound into what probably will<br />\nbe the greatest 'birthday greeting<br />\nin history. One hundred per cent<br />\nof the money received from signatures will be turned over to the<br />\nNational Birthday Ball Committee<br />\nand the committee will arrange<br />\nfor proper credit for each commu-<br />\n<br />\n\"Literary Digest\" Questions On Peace Problem Also Defended And Ridiculed In Interviews Given By<br />\nInquiring Reporter<br />\nOpie Chancellor, a senior, who<br />\nThe prevailing opinion of Johns•by<br />\n\"If the questions were clearer,<br />\nsaid,<br />\nin<br />\nHopkins University undergraduates<br />\nwould be an excellent way<br />\npoll<br />\nthis<br />\nCollege<br />\nof<br />\ntion<br />\nAssocia<br />\nthe<br />\nregard to<br />\nning the opinion of the coldetermi<br />\nof<br />\nEditors' peace poll, which is being<br />\nAs they stand, they are not<br />\nman.<br />\nlege<br />\nin<br />\nDigest<br />\ny<br />\nconducted by the Literar<br />\ncan not be answered by<br />\nand<br />\nexplicit<br />\n120 colleges throughout the country,<br />\nno.\"<br />\nor<br />\nyes<br />\nof<br />\npoll<br />\na<br />\nis that the idea of having<br />\nPoll Defended<br />\nthis kind is good, but that the quesrg, editor-in-chief<br />\nBlumbe<br />\nStanley<br />\nthey<br />\ntions of the poll are such that<br />\nETTER, in defending the<br />\nof<br />\nNEWS-L<br />\nthe<br />\nacno,<br />\nor<br />\nyes<br />\nby<br />\nd<br />\nanswere<br />\ncan not be<br />\nC. E. poll, said, \"It's true that sevcording to answers given the inquir- A.<br />\nof these questions, perhaps all<br />\neral<br />\ning reporter.<br />\nof them, might be more satisfactorily<br />\nThe poll was attacked by Bernard<br />\nanswered in terms of pro and con disBreiter, a sophomore in the College<br />\ncussion rather than the yes or no<br />\nof Arts and Sciences, who said, \"This<br />\nmethod. However, the latter was the<br />\nparticular poll is a very ineffectual<br />\nexpedient means of obtaining a<br />\nonly<br />\nmethod of arriving at any satisfactory<br />\nful total. Furthermore, I bemeaning<br />\nconclusion. The questions are sterelieve that a great majority of the<br />\notyped ones that you can't get much<br />\nstudents understand the basic nature<br />\nout of.\"<br />\nof each question.\"<br />\nAttack Continued<br />\nDavid Levy, a junior, also defendthe ballot by replying, \"I think it<br />\ned<br />\nconn,<br />\na<br />\nfreshma<br />\nd,<br />\nDiamon<br />\nWilliam<br />\ncontinued the attack when he replied, is a very good idea to get the<br />\non<br />\nmen<br />\ncollege<br />\nof<br />\nopinion<br />\nof<br />\ndevil<br />\nsensus<br />\nthe<br />\nbetween<br />\nus<br />\n\"The ballot puts<br />\nand the deep blue sea. We must either a question as important as the peace<br />\n<br />\nDandy Selected<br />\nOne Of Highest<br />\nIn '34 Medicine<br />\n<br />\nnity.<br />\nE. L. SOLLERS,<br />\nNight Manager, Western<br />\nUnion Telegraph Co.<br />\n<br />\nFamed Hopkins Brain Surgeon Set Among 25 Highest In Year's Contributions<br />\n<br />\nCures Meniere Ill<br />\nOperates On Hearing Nerve;<br />\nModern Medicine Periodical Also Picks Dr. Dafoe<br />\nDr. Walter Edward Dandy, brain<br />\nsurgeon of the Johns Hopkins Hospital, was one of the twenty-five men<br />\nregarded as having made the greatest<br />\ncontributions to medical science during the year 1934.<br />\nThe selection, which included the<br />\nnames of such renowned doctors as<br />\nDr. Allan Roy Dafoe and Dr. Harold<br />\nC. Urey, was made by the periodical<br />\n<br />\nLeague last Friday.<br />\nAccusing the Roosevelt administration of attempting to enact a social<br />\n\"Modern Medicine.\"<br />\ninsurance bill which does not carry<br />\nTreats Meniere's Disease<br />\nout this ideal and which would mean<br />\nof Dr. Dandy's work in<br />\nBecause<br />\nthe further exploitation of the workact the nationalistic militarist or go problem.\"<br />\ntreatment for Meniere's<br />\ntoday.<br />\na<br />\ning<br />\nsociety<br />\ning<br />\ndevelop<br />\nHumor In Answers<br />\ning class, Dr. Blumberg laid down the<br />\nto the opposite extreme. The ballot<br />\nMeniere's disease<br />\npseudowe<br />\nand<br />\ntances<br />\ndisease<br />\nUnder these circums<br />\nHumor was to be found in several of<br />\nfour principles which are of prime<br />\nwas poorly organized since it leaves<br />\nauditory nerve,<br />\nthe<br />\nof<br />\nalong<br />\nnt<br />\nions<br />\ntreatme<br />\nsuggest<br />\nby<br />\nmake<br />\nto<br />\nlike<br />\nfreshiMportance in the enactment of un- should<br />\nopen no middle patch and does not the answers. Aaron Zheutlin, a<br />\nd in the list.<br />\ninclude<br />\nof<br />\nwas<br />\nhis name<br />\nin regard to the choice<br />\nemployment insurance legislation. two lines<br />\ntake into consideration the main man, answered, \"If war comes, I'll<br />\nbrain malady<br />\na<br />\nis<br />\ndisease<br />\nfirst<br />\nnt<br />\n's<br />\nAmes,<br />\nPreside<br />\nMeniere<br />\nto<br />\nor<br />\nPirst, the law must apply to all un- a success<br />\nns that arise in the minds of hide in the cellar.\" Jewett Goldsmith,<br />\nDr. Roger Adams, president of the that brings on spells of dizziness.<br />\nbe made questio<br />\nshould<br />\nchoice<br />\nthe<br />\nhow<br />\nto<br />\nas<br />\nswell<br />\na<br />\n\"It's<br />\nsaid,<br />\nons;<br />\nemployed without any excepti<br />\nmost students—What is the cause of another freshman,<br />\nAmerican Chemical Society, spoke on<br />\nIn tests that took many years, it<br />\nsecondly to qualifications for the<br />\nsecond, the system must insure a con- and,<br />\nand what are we to do about it?\" advertising stunt. I'd recommend it \"Recent Trends in Applied Organic<br />\nwar,<br />\nshown that the nerve impulses<br />\nn the<br />\nregards<br />\nwas<br />\nselectio<br />\nAs<br />\nnt.<br />\nPreside<br />\ncolumn<br />\ntinuous income throughout the period<br />\nThat the idea of having a poll it- to any journal that has extra<br />\nry\" last Saturday night in<br />\nChemist<br />\ncaused the vertigo, accompanshould<br />\nbody<br />\nwhich<br />\nstudent<br />\nOf loss of ordinary income; third, the faculty and the<br />\nself was a good one was backed up space to fill.\"<br />\nRemsen Hall before a large audience. ied by total loss of balance, were<br />\nbecause<br />\nfirst<br />\nfaculty<br />\nThe<br />\nd.<br />\nconsulte<br />\nbe<br />\nadministration of all funds must be<br />\nDr. Adams was born in Boston, transmitted by a nerve in the brain<br />\nthe Pres• at least partly in the hands of the they must cooperate with<br />\nHe was graduated from HarMass.<br />\nwhich also has control over a person's<br />\nif the institution is to succeed,<br />\nWorkers themselves; and fourth, there ident<br />\nUniversity with a Ph.D. degree,<br />\nvard<br />\nand<br />\nhearing.<br />\ntheir lives' work<br />\nMust be no contributions from em- and because<br />\n1912. He taught for several years at<br />\nCuts Nerve Partially<br />\nreputations are inextricably<br />\ntheir<br />\nof<br />\nexpense<br />\nthe<br />\nwas<br />\nhe<br />\nfor<br />\nWar<br />\nthe<br />\npay<br />\nPloyees to<br />\nHarvard, and during<br />\nwith the University.<br />\nup<br />\nyears it was common<br />\nbound<br />\nformer<br />\nIn<br />\nthe system.<br />\na major in the Chemical Warfare<br />\nthe nerve, curing<br />\nsever<br />\nto<br />\nsome<br />\ngiven<br />\nbe<br />\npractice<br />\ns<br />\nshould<br />\nstudent<br />\nThe<br />\nto<br />\nwent<br />\nService. From Harvard he<br />\nWages Have Decreased<br />\nbut leaving<br />\nvertigo<br />\nthe<br />\nat<br />\nof<br />\nis,<br />\npatient<br />\nity<br />\nthe<br />\nbecause the Univers<br />\ntire University of Illinois.<br />\nCiting the records of the NRA as voice<br />\ndeaf. In his experiments<br />\ncona<br />\ntotally<br />\npay<br />\nthey<br />\nhim<br />\ntheirs;<br />\npartly,<br />\nleast<br />\nIn Many Groups<br />\nProof of the fact that the real wages<br />\n\"Theory, Reality, Realism In Since 1926<br />\nshowed that by cutting<br />\ne share of the maintenance<br />\nhe has been professor of Dr. Dandy<br />\nof the country have decreased, Dr. siderabl<br />\n3<br />\ny, the disease would<br />\n,<br />\nGive<br />\npartiall<br />\nmuch<br />\nas<br />\ne<br />\nnerve<br />\ntime,<br />\nrombi<br />\none<br />\nthe<br />\nAberc<br />\nany<br />\nat<br />\nare<br />\nle<br />\nand<br />\nLascel<br />\national Politics\" Sub- organic chemistry at the University<br />\nIntern<br />\nlalumberg declared that \"funds must<br />\nbe cured without any effect on the<br />\nUniversity as any other one eleof Illinois and head of the Departe Turnbull<br />\ncome from the employer and the state, the<br />\nGraem<br />\nPercy<br />\nTalk<br />\nday<br />\nThurs<br />\nOf<br />\nject<br />\nly<br />\nhearing.<br />\nnatural<br />\nfollow<br />\nperson's<br />\nto<br />\nseems<br />\nOr else the bill would be in effect a ment. It<br />\nment of Chemistry there.<br />\nApril<br />\nr, Dr. Dandy is known the<br />\nIn<br />\nHoweve<br />\nSeries<br />\nso vitally interested as<br />\ne<br />\ngroups<br />\nLectur<br />\nthat<br />\nAmerthe<br />\nnew wage cut.<br />\nDr. Adams is a Fellow of<br />\n, assistant liMattern<br />\ns<br />\nJohanne<br />\nDr.<br />\nas an outstanding authorbody<br />\nover<br />\nstudent<br />\nthe<br />\nand<br />\nworld<br />\nare the faculty<br />\nSciences<br />\nsci- ican Academy of Arts and<br />\n\"The only unemployment insurance<br />\nsurgery. Patients whom<br />\nbrain<br />\nAbercrombie has been brarian and lecturer in political<br />\non<br />\nity<br />\ngiven a voice in the choice<br />\nbe<br />\nLascelle<br />\nshould<br />\nDr.<br />\nCounh<br />\nbill ever introduced in the Congress<br />\non \"The- and of the National Researc<br />\naddress<br />\nan<br />\nd<br />\ndelivere<br />\nence,<br />\nhave come to him unPercy<br />\nthe<br />\ntreated<br />\nfor<br />\nchosen as the lecturer<br />\nof the President.<br />\nhe is a member of he has<br />\nOf the United States which has been<br />\nand Realism in Inter- cil. Among others<br />\nReality,<br />\nory,<br />\ntances, like the<br />\ncircums<br />\nseries<br />\nship<br />\nmany<br />\nLecture<br />\nl<br />\nder<br />\nTurnbul<br />\ngradwe,<br />\nhaft.<br />\nof - the Deutsche Chemische Gesellsc<br />\nin accord with all the requirements In line with this attitude students, Graeme<br />\ns<br />\nmember<br />\nbefore<br />\n\"<br />\nl<br />\nPolitics<br />\nflown from the<br />\nnationa<br />\nwas<br />\ngiven<br />\nthat<br />\nare<br />\nthis year. The six lectures<br />\nundergraduate<br />\nassociate editor of small child<br />\nfor an effective social legislation is uate and<br />\nRelations Club at a He also was an<br />\nional<br />\nthe care of<br />\nInternat<br />\nthe<br />\nwider<br />\nthe<br />\nput<br />\nby<br />\nbe<br />\nchosen<br />\nto<br />\nlecturer<br />\nSouth<br />\na<br />\nby<br />\nfor<br />\nannually<br />\nof our specifications<br />\n\"The Journal of the American ChemJanthe Workers' Unemployment Insur- present some<br />\ny,<br />\nThursda<br />\non<br />\nn<br />\nmeeting<br />\nluncheo<br />\n.<br />\nsurgeon<br />\nity from<br />\nthe eminent<br />\nPresident of the Johns Hopkins Uni- President of the Univers<br />\nical Society.\"<br />\nance Bill presented by Representaive a<br />\nawake among \"properly qualified authors, uary 17.<br />\nman<br />\na<br />\nbe<br />\nshould<br />\nHe<br />\nversity.<br />\nErnest Lundeen of Minnesota at the<br />\nDr. Mattern defined theory, reality,<br />\nand economic implica- writers or professors of America or<br />\n. last session and again during the past to the social<br />\nrealism and drew a sharp line of<br />\nand<br />\nof modern thought, science, and Europe.\"<br />\nMonth. The main objection to this tions<br />\ndistinction between the three. He<br />\nNative Of England<br />\nshould be liberal to<br />\nbill is that it would mean the recovery technology. He<br />\nsaid that theory is the conception that<br />\nEngvoicing of<br />\nDr. Abercrombie is a native of<br />\nOf the working class at the expense the extent of allowing the<br />\nthere is a binding international legal<br />\ndeM.A.<br />\nhis<br />\nd<br />\nreceive<br />\ncampus<br />\nland, having<br />\nall types of opinion on the<br />\nOf the capitalistic class.\"<br />\nand<br />\nhe has order as the League of Nations<br />\nexcept those which support move- gree from Liverpool. Since 1929<br />\nReality is the fact<br />\nCourt.<br />\nWorld<br />\nthe<br />\nAttacks Bill<br />\nre<br />\nliteratu<br />\nsciEnglish<br />\nof<br />\nto<br />\nbeen professor<br />\nments such as fascism, hostile<br />\nthat nations act on the basis that is<br />\nDr. Blumberg attacked the Wagculture—movements which at the University of London.<br />\nand<br />\nence<br />\nin international relations only the law<br />\nner-Lewis Bill as an attempt of the<br />\nleca<br />\nEvening Wear and Raincoats Excepted<br />\nwas<br />\nFrom 1919 to 1922 he<br />\nreact ultimately to the detriment of<br />\nis<br />\nradical<br />\nRealism<br />\non.<br />\nmore<br />\nexpansi<br />\nand<br />\ngrowth<br />\nof<br />\nprevent<br />\ngovernment to<br />\nity of<br />\nthe students, workers, and the -middle turer of poetry at the Univers<br />\nthe harmonizing of theory and realaction. \"The present administration,\"<br />\nshould be opposed to war Liverpool. Until 1929 he was a proHe<br />\nclass.<br />\nity. He added, \"Every nation today<br />\nhe continued, \"has been characterized<br />\nthe<br />\nat<br />\nure<br />\nLiterat<br />\nfathe<br />\nEnglish<br />\nfessor of<br />\nand should be determined that<br />\nfavor<br />\nin<br />\nion<br />\nlegislat<br />\nof<br />\ns<br />\nbelieves it must reorganize to live<br />\npromise<br />\nits<br />\ntime<br />\nby<br />\ncilities of the Johns Hopkins Uni- University of Leeds. During that<br />\ndently from other nations,<br />\nindepen<br />\nOf the working class and its action in<br />\nand<br />\nhips,<br />\nlectures<br />\nmany<br />\naid<br />\nhe also held<br />\nversity shall never be utilized to<br />\ncounthe<br />\nof<br />\nalists<br />\nof course, a fallacy.\"<br />\nis,<br />\nindustri<br />\nwhich<br />\nthe<br />\nfavor of<br />\nalso holds honorary degrees from<br />\nthe conduct of an imperialistic war.<br />\nCites Example<br />\ntry. The result of the Roosevelt proties.<br />\nUniversi<br />\nBelfast<br />\nand<br />\nHe should be aware of the mental Cambridge<br />\nDr. Mattern then gave specific exgram will be the shifting of the burWorks<br />\nPublished Many<br />\nwhite and Negro races<br />\nden to the state governments which equality of the<br />\namples, one of three differentiating<br />\nDr. Abercrombie has published<br />\nUniversity and should<br />\nthe<br />\nin<br />\ntaught<br />\nas<br />\nbetween the, which was in respect to<br />\ncannot succeed.<br />\nre.<br />\n211-213 E. Baltimore St.<br />\nto open the doors of the Uni- many works on poetry and literatu<br />\nresources. \"According to thenatural<br />\n\"Satisfactory unemployment insur- intend<br />\na<br />\nHardy,<br />\ns<br />\n\"Thoma<br />\nare<br />\nmany capable Negro Among them<br />\nory, natural resources are merely a<br />\nance must come from the federal gov- versity to the<br />\ndesire admission. He Critical Study,\" \"Four Short Plays,\"<br />\nwho<br />\ns<br />\nstudent<br />\nfor the country in which they<br />\nernment.\"<br />\n\"Theory of boon<br />\nshould be broadminded enough not to \"Deborah,\" \"The Epic,\"<br />\nfound.<br />\nare<br />\ng and<br />\ndiscriminate against any student or Art,\" and \"Poetry, its Meanin<br />\n\"Reality says that a nation withJames Franck Named faculty member in any way because Music.\"<br />\nout these resources can get them by<br />\nTo Physics Department of race, creed, or political affiliation. He has been the lecturer in fine arts conquest of the nations that possess<br />\nHe should be opposed to such eco- at the Queen's University of Belfast. them. Realism argues that the naWorld-Famous Scientist Appointed nomies as the present administration In 1923 he was the Clark Lecturer at tion possessing these natural rehas effected in the form of cutting Trinity College, Cambridge. He re- sources should act as the guardian and<br />\nTo Replace Dr. Ames; Winner<br />\nthe salaries of the janitors and the ceived his early education at Malvern custodian of them, but should share<br />\nOf Nobel Prize<br />\ncampus workers to a subsistence lev- College and Victoria University.<br />\nthem with the other nations.\" Dr.<br />\n1)<br />\nCol.<br />\n1,<br />\nPage<br />\nel. Understanding that the public is<br />\n(Continued from<br />\nTHE HOME OF<br />\nMattern proved this point by pointing<br />\nthat<br />\nreform of light has been developed by responsible for education and<br />\ntheir<br />\npooled<br />\nAllies<br />\nout that the<br />\ntr. Franck to a point where the mod- ability and not wealth is the imporsources with great success during the<br />\nhe<br />\nof a student,<br />\nWar and that today nations have gone<br />\nern system of neon sign lighting has tant qualification<br />\nHART SHAFFNER e? MARX,<br />\nd to ask for federal<br />\nbe<br />\nprepare<br />\nshould<br />\nimfar as to share canals and rivers.<br />\nthe<br />\nso<br />\nbeen made possible. Recently<br />\nor state aid for the University in orThe senior section of the Hullabaloo •<br />\nPortant subject of the nucleus of the der to provide opportunity for adSOCIETY BRAND and WAKELY CLOTHES<br />\nFree Manicuring<br />\nAfter<br />\n20.<br />\nMarch<br />\non<br />\npress<br />\nto<br />\nn.<br />\ngo<br />\nwill<br />\nattentio<br />\natom has claimed his<br />\nvanced education for a greater numTheodore's Barber Shop<br />\nthat day, all seniors desiring their<br />\ns<br />\nX.nowledge of the transmutation of ber of competent student:<br />\nFormerly with EMIL CAYE<br />\nJohn<br />\nsee<br />\nmust<br />\nannual<br />\nthe<br />\nin<br />\npictures<br />\nCAlvert 4444<br />\nelements and artificial radiocativity<br />\nBaltimore, Charles and Fayette<br />\nS. W. C,or. St. Paul and 33rd Streets<br />\nDeHoff, editor-in-chief, or Roland<br />\nto<br />\nNext<br />\nBirely's<br />\nhas come to light through research<br />\nMerson, president of the Senior Class. 8 A. M. to 8 P. M.<br />\nWork on the Hullabaloo has pro- •<br />\nin this field.<br />\n•<br />\ngressed very rapidly, and already<br />\nCHARLIE DER<br />\nmany of the engravings have been<br />\nIlurnor Issue Of \"Blue Jay\" The Hopkins Band will give a con- sent to the contractor.<br />\nFIRST CLASS LAUNDRY<br />\n3224 GREENMOUNT AVE.<br />\nIssued During Exam Week cert for the Maryland National Guard Editorial writing will begin immeButtons Sewed On, Stockings<br />\ntions, while<br />\nexamina<br />\nthe<br />\nafter<br />\ndiately<br />\nat Broadway, Sunday, March 3, it<br />\nMended, and all Needed Repairs<br />\nthe activity pictures not yet photoJokes And Clippings To Be Feature<br />\nwald,<br />\nHenry<br />\nFenster<br />\nAt No Extra Charge<br />\nby<br />\ned<br />\nannounc<br />\nwas<br />\ngraphed will be taken on February 10.<br />\nOf Fourth Issue, Editor<br />\nthis<br />\nearly<br />\nBand,<br />\nthe<br />\nof<br />\nleader<br />\nstudent<br />\nAnnounces<br />\nweek.<br />\nFollowing the above engagement,<br />\nThe fourth issue of the Blue Jay,<br />\nCALVERT and 30TH STS.<br />\nFOR CLEANING, DYEING and<br />\nit is probable that<br />\nSo we'd like you to file for future reference that our whole<br />\nsaid,<br />\nwald<br />\nFenster<br />\nschedis<br />\nFirst in Quality — First in<br />\ne,<br />\nPRESSING—Reasonable Rates<br />\nmagazin<br />\nformer campus<br />\nWe Call For and Deliver<br />\nService<br />\nstore is at your service — though we call your attention<br />\nUled to come out during the week of the Band will play at all the lacrosse<br />\n5318<br />\nBel.<br />\ntoo<br />\nsmall.<br />\ndelivery<br />\nCH. 9849<br />\nNo<br />\n21st St.<br />\nE.<br />\n'101<br />\nour<br />\nbasthe remaining<br />\nespecially to our Men's Shop on the first floor, and<br />\nJanuary 28, at the time of the exam- games and some of<br />\nate<br />\nnecessit<br />\nwill<br />\nThis<br />\n.<br />\ninations, it was announced Saturday ketball contests<br />\nYoung Men's Shop on the third. Perhaps you won't even<br />\nas complete an attendance as possible<br />\nby John Reddick, editor.<br />\nhave to come in; try writing or phoning us!<br />\nJ. H. FLTRST CO.<br />\nat rehearsals and for the next several<br />\nThis issue is to be a humor numpresent.<br />\nbe<br />\nmust<br />\nmen<br />\nall<br />\nPrinters of<br />\nweeks<br />\nber, with a wide selection of clips<br />\nsnare<br />\na<br />\nAL and SCIENTIFIC<br />\nfor<br />\nLOGIC<br />\nopen<br />\nPHILO<br />\nvacancy<br />\na<br />\nis<br />\nThere<br />\nPUBLICATIONS<br />\nand jokes, he said. A feature of note drummer, and anyone who is interTS<br />\nSTREE<br />\n25TH<br />\nand<br />\nES<br />\nCHARL<br />\n12-20 HOPKINS PLACE, BALTIMOEI<br />\nwill be book reviews, by Sea Jay, ested should report at the Barn on<br />\nServing Maryland's Finest Food<br />\nProminent New York critic.<br />\nMonday afternoon.<br />\n<br />\nDr.Adams Discusses<br />\nTrends Taken By<br />\nOrganic Chemistry<br />\n<br />\nProminent Author Mattern Talks To<br />\nAnd English Prof. Relations Club At<br />\nWill Speak Here Luncheon Meeting<br />\n<br />\n.<br />\nSuits, Topcoats 1<br />\nand Overcoats<br />\n<br />\nwik<br />\n<br />\n4<br />\n<br />\nCalvert Room Suits<br />\nand Topcoats,$17.50<br />\n<br />\nNo Chargefor Alterations<br />\n<br />\n0F F<br />\n<br />\nKATZ CLOTHES<br />\n<br />\nDr.<br />\n<br />\nHub<br />\n<br />\nSenior Section To<br />\nBe Complete Mar.20<br />\n<br />\nBand Plans Concert<br />\nTo Be Held March 3<br />\n<br />\nPeabody Pharmacy<br />\n<br />\nEVEN A BUSY COLLEGE MAN<br />\nNEEDS TO GO SHOPPING<br />\nONCE IN A WHILE<br />\n<br />\nFRIED'S<br />\n<br />\n,••••<br />\n<br />\nL<br />\n<br />\nTHE<br />\nCAMPUS INN<br />\n<br />\nHUTZLER BFCfftlEM<br />\n<br />\n..-••••••••••••M<br />\n<br />\nt<br />\n<br />\nNog<br />\n<br />\n\f4<br />\n<br />\nHOME WOOD, BALTIMORE, MD., JANUARY 22, 19.55.<br />\n<br />\nLoyola College Greek Games 1Jay Tanktnen Lose To F. ofM. Emmert Chosen<br />\nFive Trips Jays Phi Sig, Sig Ep, And Kappa Swimmers By Score Of 40-28 To Presidency<br />\nSig Lead Divisions In Frat Mermen Succumb To Strong Garnet Aggregation, DropByPoint Margin. Volleyball And Basketball ping Second Meet In Succession; Lou Adler Scores Of Spiked Shoe<br />\nLast-Minute Double-Decker<br />\nClinches Tilt For Jesuits<br />\nIn See-Saw Cage Thriller<br />\n<br />\nOn the basis of fifteen points for a<br />\nwin and five points for a game played<br />\nand lost, Phi Sigma Delta and Sigma<br />\nPhi Epsilon are leading their respective divisions in the fraternity bas-<br />\n<br />\nBluejays Stage Rally<br />\nRasin's Three Field Goals<br />\nSend Hopkins Ahead, But<br />\nWayson's Shot Wins Tilt<br />\n<br />\nketball league and Kappa Sigma is in<br />\nfirst place in its division in the fraternity volleyball league. No volleyball games have been played as yet<br />\nin the other diision.<br />\nEdwin Lotz and Frank Dotterweich,<br />\n<br />\nwho are conducting the basketball<br />\nIn their first encounter of the curtournament, and Ronald Levy, who is<br />\nrent season, the Loyola and Hopkins<br />\nin charge of the volleyball league,<br />\nquintets kept true to tradition and<br />\nstaged another thrilling tussle. After have announced that any team that<br />\na nip-and-tuck affair, in which the fails to appear on the time scheduled<br />\nlead constantly alternated from one will forfeit the game to its opponent<br />\nteam to the other, Loyola finally won<br />\nunless it has notified Lotz or Dotterout, 35 to 34.<br />\nweich or Levy at least 24 hours ahead<br />\nFrom the very beginning, the contest was packed with thrills and ex- of time.<br />\ncitement, and victory was in doubt,<br />\neven in the final seconds of the game. BASKETBALL TEAM STANDING<br />\nA field goal by Wayson clinched the<br />\nIncluding Games Played Jan. 19<br />\ngame for Loyola, after Hopkins had a<br />\nSection A<br />\nASne-point lead.<br />\nW. L. Pts.<br />\nLoyola Takes Lead<br />\nImmediately at the outset of the Sigma Phi Epsilon<br />\n2<br />\n1<br />\n35<br />\ncontest, the Greyhounds assumed a Kappa Sigma<br />\n2<br />\n0<br />\n30<br />\nfour-point lead. The Blue Jays then Kappa Alpha<br />\n1<br />\n1<br />\n20<br />\nbegan to click. They tied the score<br />\nDelta Upsilon<br />\n1<br />\n15<br />\n0<br />\nat 11-all and then slowly forged<br />\n0<br />\n2<br />\n10<br />\nahead. Chancellor played fine ball Alpha Tau Omega<br />\n5<br />\n0<br />\n1<br />\nduring this period and accounted for Phi Alpha<br />\nseven markers. The Darleymen ex- Tau Alpha Omega<br />\n0<br />\n1<br />\n5<br />\ntended their advantage to six points,<br />\nSection B<br />\nbut the Loyola boys came up fast.<br />\nW. L. Pts.<br />\nThe half ended 20 to 18, in favor of<br />\n50<br />\nDelta<br />\n3<br />\n1<br />\nPhi<br />\nSigma<br />\nthe Jays.<br />\n45<br />\n3<br />\n0<br />\nAs the second canto opened, the Phi Gamma Delta<br />\nGreyhounds, led by Carney, regained Pi Lambda Phi<br />\n2<br />\n2<br />\n40<br />\nthe lead. They played conservative Tau Alpha Phi<br />\n20<br />\n1<br />\n1<br />\nand steady ball. With but four min1<br />\n20<br />\nDelta Theta Pi<br />\nutes left to play, the Loyola quint en20<br />\n1<br />\n2<br />\nPhi<br />\nKappa<br />\nPsi<br />\njoyed a six-point advantage.<br />\n10<br />\n0<br />\n2<br />\nPhi<br />\nDelta<br />\nBasin Sinks Three<br />\nRasin was injected into the game Alpha Delta Phi<br />\n5<br />\n0<br />\n2<br />\nat this stage. Siegel, fleet Hopkins<br />\nVOLLEYBALL TEAM STANDING<br />\nforward, converted a foul. In rapid<br />\nSection A<br />\nsuccession, Rasin sank three long,<br />\nW. L. Pts.<br />\nmore<br />\nto<br />\nonce<br />\nspectacular hawkers<br />\nplace Hopkins ahead.<br />\n2<br />\n0<br />\n30<br />\nKappa Sigma<br />\nOn a well-executed play, Wayson Alpha Tau Omega<br />\n1<br />\n1<br />\n20<br />\ntallied his eventful score. With sec- Sigma Phi Epsilon<br />\n0<br />\n1<br />\n15<br />\nonds to play, the Jays futilely at- Phi Alpha<br />\n1<br />\n5<br />\ntempted to score.<br />\n1<br />\n0<br />\n5<br />\nKappa Alpha<br />\nSiegel High Scorer<br />\n1<br />\n0<br />\n5<br />\nTau Alpha Omega<br />\nCarney topped the Loyola scorers Delta Upsilon<br />\n0<br />\nwith 11 points. Colvin, flashy forward, accounted for nine markers.<br />\nSiegel led the Hopkins with 10; he<br />\nalso played a brilliant floor game.<br />\nCaptain Cliff Siverd played bang-up<br />\nball throughout.<br />\n• • •<br />\nThe court was very slippery. Reynolds and Siegel received severe floor<br />\nburns.<br />\n• • •<br />\nIn the last two games Captain Siverd has converted seven fouls out<br />\nof eight attempts.<br />\n• • •<br />\nJimmy Benson, Blue Jay trainer,<br />\nappears to be the most enthusiastic<br />\nof the Hopkins rooters. His antics on<br />\nthe bench were sincere demonstrations of his loyalty.<br />\n• • •<br />\nRasin attempted only three shots.<br />\nHe made them all good.<br />\n• • •<br />\nCarney was badly shaken up when<br />\nhe took a spill midway in the second<br />\nhalf.<br />\nI • •<br />\nThe game was a Maryland Intercollegiate Basketball League contest.<br />\nThe line-up:<br />\nLOYOLA<br />\nHOPKINS<br />\nG. F. T.<br />\nG. F. T.<br />\nSiegal, L._ 4 2 10 Fer'ini,f 3 1 7<br />\n0 0 0<br />\nSiverd, f.._ 2 2 6 Kelly,f<br />\nChan'r, c. 3 1 7 Colvin, L 3 3 9<br />\nRasin, g... 3 0 6 Tan'hill, c. 2 0 4<br />\nRey'ds, g. 0 1 1 Carney, g. 5 1 11<br />\nW'd'w, g. 2 0 4 Wayson, g. 2 0 4<br />\n<br />\n1<br />\n<br />\nv./.<br />\nT1<br />\n<br />\nOnly First Place For Blue Jays In Century Swim<br />\n<br />\nCapturing only one of the eight<br />\nevents, the Johns Hopkins swimmers<br />\nwere handed their second defeat of the<br />\nseason last Saturday, losing to the<br />\nstrong Franklin and Marshall natators, 40-28, at the latter's pool. Although the Jays were only able to secure one first, the meet was closely<br />\ncontested throughout, and it was not<br />\nuntil the last four races that the Garnet representatives asserted their supremacy.<br />\nAgain the Black and Blue did not<br />\npresent a full aggregation, with Capt.<br />\nWoody White and Frank Levi not<br />\ncompeting. It is believed White has<br />\nleft the school, and thus will not be<br />\navailable for the rest of the season.<br />\nLevi, however, expects to swim in all<br />\nfuture encounters.<br />\nHopkins' only winner was Lou Adler, who led home Jones, a team-mate,<br />\nin the 100, triumphing in the time of<br />\n60.4 seconds. Adler also captured second in the 50, to lead the Jay tankmen in scoring with 8 points.<br />\nOutstanding for the F. and M.<br />\nswimmers was Gordon (Slim) Chalmers, Olympic competitor, who is captain and coach of his team. Chalmers<br />\nwas a double winner, obtaining victories in his specialty, the 150-yard<br />\nbreaststroke, and the 220-yard free<br />\n<br />\nAt a meeting of the Spiked Shoe<br />\nstyle. To prove his versatility, he sucSociety<br />\nlast week in Levering Hall,<br />\nceeded in lowering the pool mark in<br />\nthe latter swim by covering the dis- Leonard Emmert was elected presitance in 2 minutes, 27 seconds. Roe, dent for the year. He succeeds BerF. and M., was second, while Noonan nard Merson. Other officers elected<br />\nof Hopkins finished third. Dan Weiner are Irving Leberfeld, vice-president;<br />\nand John MacGill, both Jay natators, Frank Sarlin, secretary; and Henry<br />\nfollowed Chalmers in the dorsal swim. Severn, treasurer.<br />\nMoving pictures of the cross-counIn addition to his second in the furlong, Roe also won the 440 race to try campaign just completed were<br />\nplay an instrumental part in the Gar- shown by Coach Waldo Hambleton<br />\nnets' victory. Streaking through to during the course of the meeting.<br />\nwin in the excellent time of 5 minutes<br />\nThe new president of the Hopkins<br />\n28.2 seconds, he defeated Bud Adler chapter of the Spiked Shoe is also<br />\nof Hopkins, who just nosed out Foose, captain-elect of the cross-country<br />\nthe other Franklin and Marshall team, a member of the track team,<br />\nswimmer, in final spurt to gain sec- and sergeant-at-arms of the Junior<br />\nond place.<br />\nClass. ,<br />\nThe fancy dive was won by BruLeberfeld and Sarlin are both footbaker, F. and M. ace, who is one of ball and<br />\ntrack men. Severn was manthe best plungers in the East. Bill ager of the<br />\ncross-country team and<br />\nKoenig of Hopkins secured the run- is manager of<br />\nthe track team.<br />\nner-up position, while Bill McConnell,<br />\nMembership to the Spiked Shoe is<br />\nanother wearer of the Black and Blue, restricted to<br />\nthose men who have<br />\nwas third.<br />\nbeen associated with the track or<br />\nThe Jays also captured second and<br />\ncross-country teams for two years<br />\nthird in the 200-yard breaststroke,<br />\nwhich was won by Wetzel, a Garnet and who have demonstrated an active<br />\nswimmer, who last week set a new interest in track.<br />\ncollege record for his event. Hazlett<br />\nof Hopkins swam a strong race to<br />\nfinish second, and was trailed by<br />\nBishop of the Blue Jays.<br />\n<br />\nFifty Register For<br />\nCounselor Course<br />\n<br />\nSwordsmen Defeat<br />\nHandball Tournament<br />\nCatholic University<br />\nTo Close February 12<br />\nBlumberg, Burton, Prager And Kos- Jay Fencers, Led By Herman, Reed,<br />\ntant Lead Ladders; ElimiAnd Sherman, Prevail By<br />\nnation Tourney Planned<br />\nMargin Of 6 To 3<br />\nThe fencing team defeated Cath-<br />\n<br />\nThe handball ladder tournament will<br />\n<br />\nolic University at Washington , Sat- come to a close on February 21, at 6<br />\nurday by a score of 6 to 3 in what p. m., it was announced by Reuben<br />\nwas claimed to be the first intercol- Baer, director of the tournament.<br />\nlegiate fencing match held in that<br />\n<br />\nAt this date, the first four names<br />\n<br />\ncity. Only foils were used.<br />\nSeymour Herman again topped all<br />\nperformers with wins over all three<br />\nof his opponents. His Catholic U. victims were Suite, Goenner, and Rozycki.<br />\nReed beat two opponents and Sherman one to give Hopkins a total of<br />\nsix points. Each of the three Catholic<br />\nU. men won one match.<br />\nNo matches were held in either the<br />\nsaber or the epee.<br />\n<br />\nin each of the five ladders will be entered in an elimination contest to determine the college champions. The<br />\nfirst three winners will, receive intramural awards. The first eight will<br />\nform a varsity handball team that<br />\nwill have intercollegiate competition.<br />\nUp to last week, the leaders in<br />\neach of the five ladders were Stanley<br />\nBlumberg, J. A. Burton, B. Prager,<br />\nand George Kostant.<br />\n<br />\nAbout fifty men registered in the<br />\ntraining class for counselors last<br />\nweek in Remsen 101. Because of the<br />\nsize of the class, Reuben Baer, instructor of the group, has decided to<br />\ndivide it into two sections, one to meet<br />\non Wednesday afternoons at 4:15, the<br />\nother to meet one evening a week—<br />\nprobably Wednesday at 7 o'clock.<br />\nThe first regular meeting of the<br />\nsections will be Wednesday, February 13, Mr. Baer announced. He has<br />\ndesigned the class to cover all phases<br />\nof camp duty, including theory as<br />\nwell as actual practice.<br />\n<br />\nHE HIGH STANDARDS OF<br />\nAPPAREL MAINTAINED AT<br />\nHARVARD ARE A TRIBUTE TO<br />\nTHE GOOD TASTE OF HARVARD<br />\nMEN ... AN EVIDENCE OF THE<br />\nSTYLE-SENSE AND CRAFTSMANSHIP OF CAMBRIDGE TAILORS.<br />\n<br />\nT<br />\n<br />\nIt is significant that outstanding<br />\n<br />\neaty<br />\nfamous tailors of Cambridge, Neu.) Navels<br />\nand New York, say —\"More and more<br />\nmen are demanding the slide-fastened<br />\nfly with its smooth flat effect. As the<br />\nuncovered zipper reveals a strip of<br />\nmetal, I prefer to use Kover-Zip, a<br />\nfinished product that serves its purpose well.\"<br />\n<br />\n\"Best-dressed\" seniors at leading American colleges, men<br />\nwhose choice of things to wear<br />\nhas a national influence, prefer<br />\nand commend Kover-Zip:<br />\nWARREN GRACE<br />\nBrown, 1935<br />\n\"Kover-Zip merits attention from all styleconscious college<br />\nmen ... it achieved<br />\nperfection in a closure<br />\nby eliminating the exposed strip of metal.\"<br />\n<br />\nLYLE FISHER<br />\nNorthwestern, 1935<br />\n\"Kover-Zip embodies<br />\nthe best features of<br />\nall other ifypes of fly<br />\nfasteners, and also<br />\npossesses a unique<br />\nfeature, covering the<br />\nugly raw metal.\"<br />\n<br />\nMI<br />\n<br />\nMr,<br />\n<br />\nthe<br />\ntend<br />\nIdris<br />\nwill<br />\nof r<br />\nof t<br />\nJoh]<br />\nFeb<br />\ntori<br />\nden1<br />\n<br />\nver!<br />\nupo<br />\nher<br />\nin :<br />\nwas<br />\nSch<br />\ntha:<br />\nA<br />\nJen<br />\npre<br />\nDr.<br />\nphi]<br />\nby<br />\nGet<br />\n<br />\nden<br />\nWa<br />\neco<br />\n<br />\nViti<br />\n<br />\nthe<br />\nwil<br />\nWALDES KOH-I-NOOR, INC.<br />\nLONG ISLAND CITY, NEW YORK<br />\n<br />\ncents.<br />\n<br />\ntra<br />\npit<br />\nun<br />\ntic<br />\npit<br />\nan<br />\npit<br />\n<br />\nto<br />\npr(<br />\nI\\Tt<br />\ntn<br />\nNi<br />\n<br />\nBel<br />\n<br />\nCO]<br />\n<br />\nAl<br />\n<br />\nyou're telling /<br />\nthey satis<br />\n<br />\nTotals 14 6 341<br />\n<br />\nNu<br />\n<br />\ncollege tailors, arbiters of style,<br />\nendorse Kover-Zip as the only<br />\nslide fastener fit for fine clothes.<br />\n<br />\nAll the large camps are being communicated with and it is expected<br />\nthat a number of those taking the<br />\ncourse will be placed in jobs this summer. To defray the cost of his communications, Mr. Baer has found it<br />\nnecessary to charge each member of<br />\nthe class a small sum not yet determined, but in all probability it will<br />\nbe between twenty-five and fifty<br />\n<br />\nJ.<br />\n<br />\nthi<br />\n<br />\nSt<br />\nna<br />\nin<br />\nle/<br />\n<br />\nPE<br />\n<br />\ntic<br />\n<br />\nlit<br />\n<br />\nfo<br />\n<br />\nth<br />\nC!<br />\n<br />\n1<br />\n<br />\nr<br />\n<br />\nTotals 15 5 35<br />\n<br />\nRifle Club Gains First Win<br />\n<br />\n•<br />\n<br />\nIi:<br />\n1,<br />\n<br />\nThe University Rifle Club won its<br />\nfirst victory of the season over the<br />\nBrooklyn Polytechnic Institute in a<br />\ntelegraphic match held last week, by<br />\na score of 1335 to 1297. Members of<br />\nthe team firing were Caplan, Miller,<br />\nFredericks, Guild, and Collenberg.<br />\nOther matches will take place, according to Phil Guild, manager of<br />\nthe team.<br />\n<br />\nNews-Letter Elects Six Men<br />\nSix new members were elected to<br />\nthe business staff of,the NEws-Lm ik2{<br />\nat a meeting of the control board last<br />\nTuesday afternoon. The six additions<br />\nto the masthead are Arthur Fink,<br />\nDavid Gordon, Robert Levi, Stanley<br />\nPrager, Nat Soifer, and Robert Watkins.<br />\nC)1935. LIGGETT & MYERS TOBACCO CO.<br />\n<br />\n\f", "format": "basic_html", "processed": "Member Of The<br /><br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nys<br /><br />\n3Joillts .1$13431titts Nrwri-Erttrr<br />\nHOMEWOOD, BALTIMORE, MD., TUESDAY, JANUARY 22, 1935.<br /><br />\nVol. XXXIX—No. 24.<br />\n01<br />\nIF;<br /><br />\net<br /><br />\n'1e4<br />\nre<br />\nre<br />\nJurlers<br /><br />\ndue<br /><br />\ntorJ<br /><br />\nProf. J. Franck<br />\nAppointed To<br />\nHead Physics<br /><br />\nDissects Doctors<br /><br />\nTwo Open Letters<br />\nStudent Council<br /><br />\nPrice, 5 Cents<br /><br />\nHis \"Pennies\" To Inflate<br /><br />\nNat. Student League<br /><br />\nMO<br /><br />\nY<br /><br />\nRed Nichols At<br />\nSecond Cotillion<br />\nSet For Feb. 8<br /><br />\n•<br />\nFrom the J. H. U. Chapter of the Na- To the Editor, the NEWS-Lm rat.<br />\nWith the approach of examinations<br />\ntional Student League<br />\nTo Daniel Willard, president of the the Student Council wishes to remind<br />\nBoard of Trustees, and Newton each student of his duty to uphold<br />\nPopular Dance Maestro And<br />\nWorld-Famous Physicist And<br />\nD. Baker, chairman of the com- and execute the principles of the<br />\n\"Pennies\" Band Secured<br />\nmittee to select new president of Honor System. The success and enNobel Prize Winner Gets<br />\nforcement of the Honor System is in<br />\nthe University:<br />\nFor Affair At Alcazar<br />\nAppointment As Professor<br />\nThe increasing acuteness of eco- the hands of the individual student.<br />\nnomic conditions during the past few It depends upon the supervision of<br />\nyears has, among other things, been each man over his own conduct. The<br />\nresponsible for arousing students from slightest suspicion that another is not<br />\ntheir lethargy to organize for the fulfilling his part of the contract<br />\nTentative Plans Being Made<br />\nExpected To Continue His<br />\nprotection of their rights and for the causes distrust and a collapse of the<br />\nconditions. mutual confidence which is the basis<br />\ncampus<br />\nimprovement<br />\nof<br />\nFor Musical Club PerformExperiments With MolecuThis movement has been met by many of the System, and it is expected of<br />\nance After Grand March<br />\nlar Phenomena And Light<br />\npresidents of universities and col- every Hopkins man to report to the<br />\nleges in a spirit of enlightenment typ- Student Council any violation, of the<br />\n\"Red\" Nichols and his nationallyDr. James Franck, world-famous<br />\nical of the Middle Ages. Universities System.<br />\n\"RED\" NICHOLS<br />\nknown<br />\n\"Pennies\" orchestra have been<br />\nphysicist and winner of the 1927 Nowhich were ostensibly devoted to freeThe individual is responsible for<br />\nengaged— for the Second Cotillion,<br />\nbel Prize in physics, has accepted an<br />\ndom of thought and speech became the success of the Honor System and<br />\nwhich will be held Friday, February 8,<br />\nappointment as professor of physics<br />\nthe scene of suppression and censor- therefore also responsible for the inat<br />\nthe Alcazar, it was announced yesUniversity,<br />\nand<br />\nHopkins<br />\nat the Johns<br />\nship.<br />\ndependence and freedom among the<br />\nterday by T. Rodgers Bartlett, chairDR. RICHARD C. CABOT<br />\nwill take up his duties at the beginCollege,<br />\nCity<br />\nof<br />\nRobinson<br />\nPresident<br />\nstudents which the Honor System<br />\nman of the Cotillion Board.<br />\n—Courtesy Sunpapers<br />\nning of the next scholastic year.<br />\nNew York, has especially distinguish- alone makes possible. However, stuTickets for the dance are on sale<br />\nfor<br />\nThe newly appointed professor of<br />\ned himself by expelling students<br />\ndents are expected not to leave an<br />\nnow by members and candidates of the<br />\nholding anti-war and anti-fascist examination room unless it is absophysics has done most of his work<br />\nBoard and in Levering Hall. Subscripmeetings and has violated a univer- lutely necessary. Also the signing of<br />\nin the development of the atomic<br />\ntion is $3 per couple and $2.50 stag<br />\ntheory in the line of light and molecusity tradition by inviting the police the examination book signifies that<br />\nif purchased before the affair.<br />\nlar phenomena. He is \"recognized in<br />\nonto the campus to break up student the student has neither given nor re- Local Quint To Journey To<br />\nA regularly featured dance orchesEurope and in this country as being<br />\nmass meetings. The school newspa- ceived any information.<br />\nCollege Park Tomorrow; tra on the Columbia chain, the enthe leading investigator in this exper, as well as several student orIn the past, students guilty of inganizations, has been abolished, and<br />\ntremely important field of physics,\"<br />\nEntertain W. Md. Friday semble is especially well known befringement of the Honor System have<br />\ncause of its unique opening signaaccording to Dr. Joseph S. Ames,<br />\nat least one instructor has been dis- been allowed to resign from the Uniture,<br />\n\"A Torrid Trumpet Wailing to<br />\nMedical<br />\nAssociation<br />\nRapped charged.<br />\nTwo major opponents will confront<br />\npresident Of the Johns Hopkins University without. standing trial. This<br />\nthe Four Winds,\" interpolated with<br />\nPresLouisiana<br />\nState<br />\nUniversity<br />\nAt<br />\nthe<br />\nbasketball<br />\nteam<br />\nJohns<br />\nHopkins<br />\nversity.<br />\nBy Principal Speaker At ident Smith has expelled several stu- action has resulted in considerable when the Jays encounter Maryland the theme song, \"The Wail of the<br />\nWhile at the Hopkins, Dr. Franck<br />\nupon application elsewhere<br />\nWind.\" It has since become one of<br />\nUniversity Supper Club dents for refusing to accept a cen- confusion<br />\nwill take the place which was preand therefore the Council insists that and Western Maryland this week. The radio's best-known musical labels.<br />\nsorship emanating from the Hon. a record be made of each trial and Darleymen will battle the Terrapins<br />\nviously held by Dr. Ames in the physReceived Nation-Wide Acclaim<br />\nDr. Richard C. Cabot, professor of Huey Long. Prevost Moore of Uni- construes Section 6, C 2, of the Con- at College Park on Wednesday. The<br />\nics department. He is expected to<br />\nAngeles<br />\nethics<br />\nat<br />\nHarvard<br />\nLos<br />\nUniversity,<br />\nCalifornia<br />\nat<br />\nsocial<br />\nversity<br />\nof<br />\nWestern<br />\nMaryland<br />\ntiff,<br />\na<br />\nleague<br />\nconNichols<br />\nand his original \"Pennies\"<br />\nand<br />\nmoleclight<br />\ncontinue his work in<br />\nstitution to indicate that the clause<br />\nand author of numerous volumes of suspended several students for insist- \"provided he considers defense use- test, will be staged in the new Hop- first won renown almost a decade ago<br />\nular phenomena.<br />\nthrough their recordings. Discs made<br />\nIt is reported that the place which medical literature, was the principal ing on their Constitutional right to less\" as indicative of his guilt and a kins gymnasium Friday night.<br />\nTraditional rivalry attracts much by the ensemble are still being used<br />\nwas previously held by Dr. Ames in speaker at the meeting of the Uni- hold an open forum.<br />\nrecord thereby shall be made with the<br />\ninterest to the Maryland game. For extensively in Europe, and in this<br />\nThis listing could be continued al- Registrar.<br />\nthe physics department has been va- versity Supper Club, held last TuesLevering<br />\nHall.<br />\nat<br />\nevening<br />\nday<br />\nyears this contest has been featured country, a current revival of phonoof<br />\npresident<br />\nJohns<br />\nat<br />\nthe<br />\n,was<br />\nmade<br />\nindefinitely.<br />\nHere<br />\nhe<br />\nmost<br />\ncant since<br />\nWM. C. MCCLEAN.<br />\non the Hopkins court schedule. The graph records is bringing back into<br />\nIntroduced by Dr. Howard A. Kelly Hopkins University, however, we<br />\nthe UniversitY%<br />\nTerrapins have this year, one of the popular favor a number of the orof the Johns Hopkins Medical School, have been fortunate in having an adServed In German Army<br />\nAMES<br />\nTO<br />\nADDRESS<br />\nstrongest teams in the State. Their chestra's recordings made about eight<br />\ninteresting<br />\ngranted<br />\nus<br />\na<br />\ntalk,<br />\nvehas<br />\nministration<br />\nwhich<br />\nDr.<br />\nan<br />\nCabot,<br />\nin<br />\nProfessor Franck served in the<br />\nseason has been most successful thus years ago.<br />\nfront lines of the German army dur- hemently denounced the present-day large measure of academic freedom; THURSDAY ASSEMBLY<br />\nfar. However, Blue Jay quints always<br />\nmind<br />\n\"absurdly<br />\nexto<br />\ncalls<br />\none<br />\nimmediately<br />\nas<br />\none<br />\nmedical<br />\nsystem<br />\nyet<br />\nAt present, the orchestra is on a<br />\ning the World War,and was decorated<br />\nplay inspired ball against Maryland tour of colleges throughout the cbunnot<br />\ninefficient<br />\nand<br />\na<br />\nspirit<br />\none<br />\nmanifestations<br />\nof<br />\nabsurdly<br />\ncertain<br />\npensive,<br />\nDr.<br />\npresident<br />\nof<br />\nJoseph<br />\nS.<br />\nAmes,<br />\nreceiving<br />\nfor his conduct there. After<br />\nof un- at all in keeping with this liberal at- Johns Hopkins University, will ad- and the game should be an intensely try. It is scheduled to play at the Balhis commission as lieutenant, Dr. in which an enormous number<br />\noperations<br />\nare titude: the presence of an R. 0. T. C. dress the student assembly this exciting one.<br />\nnecessary<br />\nsurgical<br />\ntimore Automobile Show on January<br />\nFranck returned to the University of<br />\nThe Terps have an excellent for- 25. Among the many places which<br />\nof dis- Thursday, January 24. The topic of<br />\nBerlin, where he received his doctor- performed.\" He also attacked the unit on the campus, the policy<br />\nan crimination against Negroes or, in the his speech has not been announced. ward combination in Waters and An- have featured the \"Pennies\" are the<br />\nate degree. After finishing a book on American Medical Association as<br />\npolitics.\"<br />\n\"dominated<br />\nby<br />\npast, the conversion of our University<br />\ninstitution<br />\nThere was no assembly last week dorka. Among the leading scorers in Hotels New Yorker and Park Central,<br />\nthe<br />\nwith<br />\nassociated<br />\nX-rays, he was<br />\nDepartment<br />\nWar<br />\nthe<br />\ninto<br />\na<br />\nunit<br />\nof<br />\ndue to the fact that Dick Harlow, the State, Waters has displayed splen- New York; the Ritz-Carlton, Atlantic<br />\nCondemns Cost Of Medical Care<br />\nUniversity of Goettingen in 1920 as<br />\nthe<br />\nand<br />\nsince<br />\nWar,<br />\nWorld<br />\nduring<br />\nthe<br />\nhead<br />\nfootball coach at Harvard, who did form all season, even when play- City; and the Lowry, St. Paul.<br />\nhead of the physics department.<br />\nThe Harvard savant condemned the<br />\n2)<br />\n3,<br />\nCol.<br />\nPage<br />\non<br />\n(Continued<br />\nwas scheduled to speak, sent word ing against the strongest teams in<br />\nNichols conducted the orchestraIn December, 1933, Dr. Franck cost of medical care. It wa,,,s this, he<br />\nTuesday<br />\nthat he would be unable to the country. His running-mate, An- tions of George Gershwin's Broadway<br />\ncame to the Hopkins to spend three felt, that made proper treatment an<br />\ndorka, plays a hard, rugged style of<br />\nappear.<br />\nproductions, \"Strike Up the Band,\"<br />\nmonths as guest professor of physics, imposkbility to the average individbasketball, and is capable of breakand \"Girl Crazy.\" He also appeared in<br />\nduring which time his lectures were ual. The average family spends from<br />\ning through for scores.<br />\nJoe Cook's \"Rain or Shine,\" in the<br />\nattended by members of the depart- $90 to $300 a year for sickness.<br />\nTwo Veterans On Team<br />\n\"Vanities,\" and in John Murray Anments of physics, chemistry, and elecHe gave the evolution of medical<br />\nWillis, an able center, will probderson's \"Almanac.\"<br />\ntrical engineering. In 1934; after leav- science as one reason for the increased Honorary Educational Fraternities<br />\nably start at the pivot post. The vetTender Dinner,- Mayor Jackson<br />\ning the Hopkins, he associated himself costs. In order to make a dependable<br />\nUnique Features Planned<br />\nerans, Butscher and Guckeyson, will<br />\nPresent At Function<br />\nwith Professor Bohr, another Nobel diagnosis of a case, a group of physiA special feature of the Hopkins somanage the defense. Both are excepPrize winner, at the University of Co- cians is required, the result of which<br />\ntionally dangerous because they are cial event will be the playing of two<br />\npenhagen.<br />\ndance numbers especially for seniors<br />\nis a greater expense on the part of Dr. Joseph S. Ames, president of the President<br />\nOf The Brookings high-scoring men as well as efficient and<br />\nJohns Hopkins University, was honthe patient.<br />\nmembers of the Cotilion Board.<br />\nExperimented With Light<br />\nguards. The reserves include Scheele,<br />\nInstitution<br />\nWill<br />\na dinner given by the Alpha<br />\nBe<br />\nat<br />\nored<br />\nSpeaker<br />\nThis<br />\nis a continuation of the custom<br />\nIncluded in the brilliant research<br />\nKeller,<br />\nand<br />\nDaly.<br />\nMedicine<br />\nAdvocates Socialized<br />\nRho Chapter of Phi Delta Kappa and<br />\ninaugurated at the Thanksgiving Coand discovery work which Dr. Franck<br />\nDespite<br />\nthis<br />\nformidable<br />\narray,<br />\nthe<br />\nAt<br />\nFounders<br />\nDay<br />\nFete<br />\norganized<br />\nDr. Cabot's proposal that<br />\nthe Chi chapter of Phi Lambda Theta,<br />\nhas done is the working out of the<br />\nBlue Jays are hopeful of putting an- tillion. Tentative plans are being comgroups of people should retain phy- honorary education fraternities, at the<br />\npleted for a rendition of songs by<br />\nchemical actions of light, which has<br />\nother notch in their victory belt.<br />\nDr.<br />\nHarold<br />\npresiGlenn<br />\nMoulton,<br />\nsicians on a year-round basis at a pre- Hotel Emerson last Saturday night.<br />\nthe<br />\nHopkins Musical Club following<br />\nbeen of priceless aid to photography.<br />\nThe Western Maryland contest will<br />\narranged payment, was enthusiastic- ,Dr. David E. Weglein, superinten- dent of the Brookings Institution in<br />\nthe grand march at midnight.<br />\nThe knowledge of the energy which<br />\nlast<br />\nHopkins<br />\nbasketball<br />\ngame<br />\nbe<br />\nthe<br />\nally received by the audience. In this dent of the Baltimore public school Washington, will be the principal<br />\nThe entire Alcazar, including the<br />\nis sometimes given off by atoms in the<br />\n'<br />\nlast year<br />\nmanner, he claimed that medical at- system, acted as toastmaster at the speaker at the Commemoration Day until after examinations.<br />\nmain ballroom, the Blue Room, and<br />\n(Continued on Page 3, Col. 1)<br />\nMaryland<br />\ncopped<br />\nthe<br />\nthe<br />\nWesterners<br />\ntention would be received at a much affair, which was attended by 200 exercises, February 22, in the audiCollege League title, and the Dar- the gymnasium, has been engaged for<br />\nreduced cost. It was Dr. Cabot's opin- persons.<br />\ntorium of the Peabody Conservatory. leymen came in second. The sole the affair. Refreshments will be<br />\nion that his system would raise the<br />\nThis celebration will mark the league loss which the Western Mary- served in the gymnasium during the<br />\nThe principal speech of the evenstandards of medical attention to new<br />\n•<br />\ning was presented by Dr. Isaac L. fifty-ninth anniversary of the found- land quintet had last year was a de- ball.<br />\nheights.<br />\ninauguUniversity<br />\nand<br />\nthe<br />\ning<br />\nof<br />\nthe<br />\nThe invited patrons and patronesses<br />\nKandel, professor of comparative edfeat at the hands of the Hopkins<br />\ninclude Dr. Joseph S. Ames, Dean and<br />\nucation at the Teacher's College of ration of its first president, Daniel cagers.<br />\nDramatic Critic Of Baltimore NewsCoit Gilman. The entire program has<br />\nthe Columbia University.<br />\nWith few veterans in their ranks, Mrs. E. W. Berry, Dr. and Mrs. R. P.<br />\nPost To Discuss \"The Baltibeen completed.<br />\nnot<br />\nMany Celebrities Present<br />\nthe Westerners are not exceptionally Cowles, and Dr. and Mrs. Broadus<br />\nmore Theatre, Tonight<br />\nThe noted lecturer on economic is- strong this season. However, they are Mitchell.<br />\nAmong those present to do honor<br />\nsues was born in LeRoy, Mich., and a fighting, spirited aggregation and<br />\nfamed<br />\nMayor<br />\nthe<br />\neducator<br />\nwere<br />\nto<br />\nLouis Azrael, dramatic critic of<br />\nHoward W. Jackson, Dr. Florence E. received his education at Albion Col- should provide the Jays with plenty<br />\nthe Baltimore News-Post, will speak Managing Editor Of 'Afro-American'<br />\nBamberger,<br />\nWendell E. Dunn, and lege. He was awarded the degree of of opposition.<br />\non \"The Baltimore Theatre\" tonight at<br />\nAddresses Interracial CommisSiegal, Siverd, and Rasin are the<br />\nMisses<br />\nMary<br />\nF. Sulzer, Marga- Ph.B by the University of Chicago in<br />\nthe<br />\n8:30 in the Playshop. Admission will<br />\nsion Last Monday<br />\nretta Collins, Emily Eversfield, Louis 1907, and seven years later the same Hopkins regular forwards. ChancelDr. Joseph S. Ames, president of<br />\nbe twenty-five cents.<br />\ninstitution gave him a doctorate de- lor will probably start at the pivot<br />\nH. Levin, and Howard W. Ford.<br />\nthe University, has been awarded the<br />\nMr. Azrael's lecture is the third of<br />\n\"The Negro Press\" was the subTwo scheduled speakers, Dr. John gree. Since then the Universities of post, while defense duties will no Langley gold medal by the regents<br />\na series offered by the Johns Hopkins ject on which William Gibson, manand J. W. Studebaker, were New York and Washington have hon- doubt be handled by Woodrow and of-the Smithsonian Institute for reRuhrah<br />\nPlayshop for the current season. Fol- aging editor of the Afro-American,<br />\nReynolds.<br />\nored him with LL.Ds.<br />\nattend.<br />\nto<br />\nunable<br />\nsearch in aviation.<br />\nlowing the talk, Adolf Colm's one- Baltimore's Negro weekly, addressed<br />\nChicago<br />\nAt<br />\nProfessor<br />\nDr. Ames since 1917 has been a<br />\nact play, \"The Fall of Massada,\" will<br />\nthe Interracial Commission, last<br />\nAfter instructing at the Evanston<br />\nmember<br />\nof the National Advisory<br />\nbe presented.<br />\nPage School Instructor<br />\nMonday evening at Levering Hall.<br />\nAcademy, he became a fellow in poCommittee on Aeronautics, and from<br />\nThe cast for this production inof<br />\njournals<br />\nthat<br />\n150<br />\nNegro<br />\nsaid<br />\nHe<br />\nAccepts Post In Chicago litical economy, finally obtaining the<br />\n1927 has served as chairman of that<br />\ncludes Harold M. Kropman, Myer Site, all over the United States, most of<br />\nposition of professor of economics at<br />\nbody. It was largely due to his reWalter Levy, Jenny Hoffman, Robert them are weeklies. This condition is<br />\nsearch on this committee that Dr.<br />\nOsborne, Henry Finck, and Elijah caused by the fact that the large na- Dr. Ernest B. Price Will Head Inter- the University of Chicago in 1922.<br />\nThe comprehensive examinanational House At The UniThe same year, Dr. Moulton was apAmes was awarded the medal, which<br />\ntions for the natural science<br />\nAdams. The play has been directed tion-wide press associations exclude<br />\nChicago<br />\nOf<br />\nversity<br />\npointed<br />\ndirector of the Institution of<br />\nhas been received by the greatest<br />\nFinestein.<br />\ngroup of the College of Arts and<br />\nby Jacob<br />\nNegro papers from membership.<br />\nEconomics in Washington, D. C., and<br />\nnames in aviation.<br />\nSciences have been scheduled for<br />\nTo Give Play In March<br />\nHe added that in order to remedy<br />\n1928, he was given his present poin<br />\nDr. Charles G. Abbott, secretary<br />\nPrice,<br />\nassociate<br />\nmemB.<br />\nThe essay for this<br />\nErnest<br />\n5<br />\nand<br />\n6.<br />\nApril<br />\nDr.<br />\nassociapress<br />\nVanya\",<br />\nNegro<br />\n\"Uncle<br />\ndifficulty,<br />\na<br />\nthis<br />\nIn early March,<br />\nsition as president of the Brookings<br />\nthe Smithsonian Institute, added,<br />\nHines<br />\nof<br />\nPage<br />\nSchool<br />\nWalter<br />\nthe<br />\n11,<br />\nand<br />\ndue<br />\nMarch<br />\ngroup<br />\nis<br />\nthe<br />\nber<br />\nof<br />\nAnton Chekov's great play, will be tion was formed, but although it has<br />\nInstitution.<br />\n\"The regents of the Institute feel that<br />\nRelations<br />\nat<br />\nthe<br />\nUse<br />\nis<br />\n\"The<br />\nInternational<br />\ntreated<br />\nsubject<br />\nto<br />\nbe<br />\nof<br />\nnot<br />\nyet<br />\nhas<br />\nPresented by the Playshop. The in- proved quite useful, it<br />\nthis country has made great strides<br />\nof Radioactivity in the Various<br />\nJohns Hopkins University, has acAs an author or joint author, he has<br />\ncomplete cast so far includes Patty reached a degree of efficiency high<br />\nin<br />\nthe field of aviation in recent years,<br />\nas<br />\ndirector<br />\nappointment<br />\nbe<br />\nare<br />\nto<br />\n\"The<br />\nessays<br />\nbooks<br />\nas<br />\nPrinciples<br />\nSciences.\"<br />\nThe<br />\nsuch<br />\ncepted<br />\nhis<br />\nwritten<br />\nSingerwald, Mary Alvey, Cyril Kader, enough to make daily publication a<br />\nin the matter of speed and safety,<br />\nfrom three to five thousand words<br />\nof the International House at the Uni- of Money and Banking\", \"The AmerDavid Kurland, S. Vannort Chapman, possibility.<br />\nand that we are ahead of other counit was announced ican Transportation Problem,\" and<br />\nin length.<br />\nThe next meeting of this group, to versity of Chicago,<br />\n)3en Rosenberg, and Helen Ascherfeld.<br />\nother<br />\ntries in this respect. We feel this is<br />\nschedules<br />\nfor<br />\nthe<br />\nWorld<br />\nProsperity.\"<br />\nThe<br />\nand<br />\nTuesday.<br />\nDebts<br />\n\"War<br />\na<br />\nfeature<br />\nwill<br />\n11,<br />\nAt the regular monthly meeting of be held February<br />\ndue to the work of the commade<br />\nlargely<br />\nbeen<br />\nnot<br />\nyet<br />\nhave<br />\ncontributed<br />\nmany<br />\nargroups<br />\nhas<br />\nMoulton<br />\nDr.<br />\nFormerly the American Consul to<br />\nthe dramatic group held last Tues- talk on \"Civilization in Ancient Afand<br />\nto Dr. Ames' guidance of<br />\nsomemittee<br />\nexpected<br />\nbut<br />\nthey<br />\nare<br />\ncurrent<br />\nmagazines,<br />\ndiscussing<br />\nup,<br />\nto<br />\nticles<br />\naswill<br />\nPrice<br />\nDr.<br />\nChina,<br />\nFoochow,<br />\nday night, 'two one-act plays were rica,\" given by Dr. William Lee<br />\nthe work of the body as its chairtime after the mid-year examinconditions, and is a promeconomic<br />\nInternational<br />\nthe<br />\nat<br />\nduties<br />\nhis<br />\nsume<br />\nanthropology<br />\nof<br />\nprofessor<br />\nmemHansbury,<br />\nthe<br />\ncriticized<br />\nby<br />\nPresented and<br />\nman.\"<br />\nations.<br />\ninent lecturer on the subject.<br />\nHouse February 1.<br />\nat the Howard University.<br />\nbers.<br /><br />\nTickets $3.00,$2.50<br /><br />\nTo Replace Dr.Ames<br /><br />\n7<br /><br />\nBASKETBALL:<br />\nTOMORROW NIGHT—<br />\nHopkins vs. Maryland<br />\nFRIDAY—<br />\nHopkins vs. Western Maryland<br /><br />\nJays Face Terps,<br />\nTerrors In Court<br />\nTests This Week<br /><br />\nDr. Richard Cabot<br />\nAttacks Medical<br />\nSystem As Absurd<br /><br />\nAmes Honored At<br />\nFraternity Dinner Dr. Harold Moulton<br />\nTo Deliver Speech<br />\nAt Commemoration<br /><br />\nLouis Azrael Will<br />\nAddress Playshop<br /><br />\nGibson Discusses<br />\nNegro Journalism<br /><br />\nAmes Wins Langley<br />\nAeronautical Medal<br /><br />\nNatural Science<br />\nExamination Apr.5<br /><br />\nHOMEWOOD, BALTIMORE, MD., JANUARY 22, 1935.<br /><br />\n2<br /><br />\nUbelRews-1Lietterl<br /><br />\nLETTERS<br /><br />\nFOUNDED 1897<br /><br />\nTO Til E<br /><br />\nVilla Of<br /><br />\nDEAF, DUMB<br /><br />\nGood Fortune<br /><br />\nThe editor of the NEWS-LETTER<br />\nhas been requested by columnist<br />\nKropman to apologize for the use<br />\nof Herb Degen's name as author<br />\nof the column appearing in last<br />\nTuesday's issue. Ever ready to<br />\noblige, the editor hereby extends<br />\nhis most humble apology—to Mr.<br />\nDegen.<br /><br />\nand BLIND<br /><br />\nSo dainty and so neat,<br />\nImagine my surprise and anger last<br />\nmy heart would nurst,<br />\nthought<br />\nI<br />\npubwas<br />\ncolumn<br />\nmy<br />\nwhen<br />\nTuesday<br />\nBy JACK STEIN<br />\nSo wildly did it beat.<br />\nlished signed by someone else. It all<br />\nTo the Editor, the NEWS-LETTER:<br />\nNo other hand ne'er held so tight,<br />\nthe last button off my<br />\nRemit subscription fees to TreasurThe recent Olynthus expedition, but knocked<br />\nI have heard disquieting rumors to<br />\nCould greater gladness bring,<br />\ncollar.<br />\nmy<br />\noff<br />\nbutton<br />\nthe<br />\nand<br />\nvest<br />\ner, Student Activities Council, Remheaded by Dr. David Moore Robinson<br />\npast<br />\nthe<br />\nconsider<br />\nyou<br />\nthat<br />\neffect<br />\nthe<br />\nthe one I held last night—<br />\nThan<br />\nHopkins<br />\nJohns<br />\nhad<br />\nPostoffice,<br />\nerror<br />\nsen Hall,<br />\neminently more suc- To think that such a grave<br />\nOmicron Delta Kappa selections not was considered<br />\nWhich was,<br />\nUniversity.<br />\nby<br />\ned<br />\nundiscover<br />\ngo<br />\nto<br />\nallowed<br />\nbeen<br />\nprevious one, on the<br />\nBy HAROLD M. KROPMAN<br />\nall they might have been in regard to cessful than the<br />\n• Four aces and a king.<br />\nproof-reading0<br />\nEntered as second-class matter De- both specie and number. Why look at basis of the discovery of that archae- the very competent<br />\ntochewing<br />\nto<br />\nme<br />\n(All those who like the above poem,<br />\nin<br />\ndrove<br />\nalmost<br />\nPostoffice<br />\nstaff,<br />\nthe<br />\ncember 3, 1909, at<br />\nological gem, the Villa of Good Forpected, and all because their beds are but are not in sympathy with the auBaltimore, Md., under the Act of Con- things on their blackest side? Has<br />\nbacco.<br />\nor country club.<br />\nit occurred to you that they might tune, a casino<br />\ngress, November 3, 1879.<br />\ntoo short.<br />\nthor are requested to sign the folI sought the persons who had alThe villa is fifty-five feet wide and<br />\nhave been worse? If it hasn't, you are<br />\nconsuch<br />\ntime<br />\nlowing personal pledge: \"No Monopis<br />\nabout<br />\nit<br />\nthink<br />\nI<br />\ncommitted<br />\nbe<br />\nto<br />\ndeed<br />\na<br />\nsuch<br />\nPublished semi-weekly from Octo- simply nearsighted.<br />\neighty-four and one-half feet long. It lowed<br />\nditions were stopped being treated oly, Part-Time Service, All-Time<br />\ndemanded<br />\nand<br />\neyes,<br />\nvery<br />\ntheir<br />\nunder<br />\nber to June, except during examinaPersonally, I am well satisfied with consisted of two stories, contained<br />\nvery lightly. Let the school get several ex- Trust and Loyalty, and a Big Thrill.\"<br />\ntion and college holiday periods by<br />\npossessed an explanation. They were<br />\nundergraduates of the Johns Hopkins the men inducted by our omniscient upwards of ten rooms, and<br />\nwas tra-length beds and I will personally<br />\nthat<br />\nthat—but<br />\nall<br />\nand<br />\napologetic<br />\n0-0<br />\nUniversity.<br />\nOmicrons, who have, I believe, done broad galleries. The villa had been<br />\nWhat about assure the authorities that there will<br />\nconditions.<br />\nalleviating<br />\nnot<br />\nfragthat you haven't as<br />\nevent<br />\na monstrous job in the way of fer- burned by a fire, and numerous<br />\nthe<br />\nIn<br />\nthe person whose name had been used be a demand for them each year. If<br />\nEDITORIAL DEPARTMENT<br />\nfrom the<br />\nhand-bill<br />\na<br />\nreting out hidden talent. I shudder ments of charred wood, and halfreceived<br />\nyet<br />\nof<br />\nElisize<br />\nthe<br />\npeople<br />\ntwo<br />\nThink of the mortifica- necessary,<br />\nStanley E. Blumberg....Editor-in-Chief at the thought of those three indi- baked mud bricks were found. Shat- so unjustly?<br />\nHolliday<br />\nNorth<br />\n225<br />\nMuseum,<br />\nPeale<br />\nManaging Editor<br />\ntion and shame he must have suf- jah Adams will be assigned to each<br />\nMelvin Goldberg<br />\nyour<br />\nfrom<br />\noff<br />\ntime<br />\nsome<br />\ntake<br />\nviduals, thrice blessed with scholar- tered roof tiles were discovered all<br />\nStreet,<br />\nbeds.<br />\nlong<br />\nfered because of their little slip. Some of these extra<br />\nJesse Borden, Neal Potter,<br />\nship, character and leadership, pass- about the house.<br />\nexams and see the current exhibit.<br />\nhad<br />\nhe<br />\nthink<br />\n0-0<br />\npeople would actually<br />\nAssistant Managing Editors ing down into the oblivion towards<br />\nThere are attractions from Lincoln,<br />\nThe villa was evidently a gambling<br />\nwritten that column.<br />\nFrom the economics department Washington, Booth, Buffalo Bill, etc.<br />\ns,<br />\nevias<br />\nUnomicron<br />\ncent<br />\nper<br />\none,<br />\n97<br />\nwhich we,<br />\nhouse, and a very popular<br />\n0-0<br />\nBUSINESS DEPARTMENT<br />\ncomes the story that one of its pro- It is an extremely interesting exhibit<br />\nare swiftly headed. I am glad I didn't denced by the amount of gaming<br />\nBusiness Manager<br />\nRay Goldberg<br />\ncomplaint<br />\na<br />\ncomes<br />\ndorms<br />\nhad inspected a war-time of- and worth your while. Admission free.<br />\nthe<br />\nI<br />\nnever<br />\nfessors<br />\nfor<br />\nFrom<br />\nhave the task of choosing,<br />\nspace and facilities provided. In order<br />\nAdvertising Manager<br />\nBert Gordon<br />\nthe war. Several days<br />\nduring<br />\nall<br />\nin<br />\nfice,<br />\nI<br />\nindeed,<br />\nthe<br />\nthem,<br />\nof<br />\nand<br />\nfound<br />\nhave<br />\nlayout<br />\nthere,<br />\nthe<br />\nwould<br />\nairing<br />\nbeen<br />\nunderstand<br />\nhas<br />\nto<br />\nbetter<br />\nwhich<br />\nOffice Manager<br />\nCharles Hastings<br />\n0-0<br />\nCirculation Manager of two years at this University, I had villa, let us imagine ourselves in a think needs a public airing. Sid Mil- later, while talking with some friends<br />\nDavid Levy<br />\nI wonder if the Hi-Hat will honor<br />\nwho also had made the inspection,<br />\nnever even heard of them.<br />\nhuge open court with various rooms<br />\nand Lou Kramer, erstwhile inwas asked why he Hopkins' cards now that it is in the<br />\nK. along three sides. The court is beau- ler<br />\nD.<br />\nprofessor<br />\n0.<br />\nthe<br />\non<br />\nhard<br />\ntoo<br />\nbe<br />\nnot<br />\nLet's<br />\n1935.<br />\n22,<br />\nJanuary<br />\nTuesday,<br />\nMemorial Hall, have thought the officers in the offices wore hands of receivers?<br />\nAfter all, they only bother us once tiful, having huge pillars, and marble mates of Alumni<br />\na year. The best way to cope with the benches where those weary of gaming been forced to sleep these many cold spurs. He replied, \"It seems—to keep<br />\nMEMBER<br />\n0-0<br />\nsituation is to be kind and patient, may rest while gazing at the famed nights with their feet extended, air- their feet from sliding off the desk.\"<br />\nTo the story about Mitchell and<br />\nThanks, Doc.<br />\nan occasional slap on the back and sunny skies of Greece. The first room ing, through the bottom of their beds.<br />\nGlitoWeDigessi 1935<br />\nprinted in my column last week<br />\nHenry<br />\nWI5CON5iN.<br />\nMANSON<br />\nutter a few simple jollities and 0. D. on the left is large and well guarded.<br />\n0-0<br />\nadd this last line omitted by mistake-Now don't get the wrong idea. NothK. will soon be purring its way back For here is the wine cellar from which<br />\nFrom the U. S. S. Chicago Big Shot \"You have a flashlight mind alright,<br />\nwrong with their feet; in fact,<br />\ninto the woodwork. Then, too, one come spirits to satiate the unending ing is<br />\nbut your bulb is burned out.\"<br />\nLast night I held a little hand,<br />\nADD 0. D. K. controversy: Word re- should keep in mind that if one must thirst of Greek youth. The next room they get very cold, as would be exceived from a reliable source enables have one's heroes, it is certainly far along the line is evidently a corridor<br />\nus to pass on the information that more efficient and cheaper to allow facing the entrance.<br />\nWashington and Lee University, them to decorate themselves.<br />\nIt is in this corridor that a long<br />\nTill the day when I can sigh with a pebble mosaic is located. The mosaic<br />\nwhere the honorary fraternity was<br />\noriginally conceived and incepted, sad smile, \"This quiet dust was 0. D. is nineteen and a half feet long, and<br />\npursues a policy in electing its mem- K.,\" I should like to institute an hon- nine and three-quarters feet wide.<br />\nbers strikingly similar to that advo- orary fraternity whose only requisite' There are three wide borders around<br />\ncated in these columns for the past would be a non-membership in Omi- the panel. The main scene is that of<br />\ntwo weeks. W. and L. seeks neither cron Delta Kappa. What we lacked Achilles seated on a rock, and being<br />\nsupermen nor activity hounds; sur- in the three cardinal virtues, we approached by Thetis. Thetis is folprisingly enough, it satisfies itself should more than compensate for in lowed by two Nereids or sea serpents,<br />\nwith inducting deserving leaders of number and vices.<br />\nthe first having a shield of red pebRespectfully,<br />\nrepresentative campus organizations.<br />\nbles and the second carrying a spear<br />\nM. V. D.<br />\nThis, remember, in the institution<br />\nof red pebbles with black dots.<br />\nwhich first housed an Omicron Delta<br />\nThere is a great noise coming from<br />\nKappa chapter.<br />\na nearby room, and when we investiIn accordance with the decidedly<br />\ngate the cause for the sound, we<br />\npetulant request of a member of the<br />\ndiscover the room to be the gentleHopkins circle, we have determined<br />\nmen's rest room. In this room John<br />\nStudent football players at Beckley Smith (I can't say it in Greek) is<br />\nto make further comment on the local<br />\nsituation short and as sweet as pos- Business College have filed a suit for sitting with his group of friends and<br />\nsible. We presume that he will ap- back wages at Cumberland County telling about the dates they had last<br />\npreciate the import of the above re: Court. They announced that the sal- night. Jack Dalton (no savvy in this<br />\nmarks in their composite form. Even ary for playing football was two hun- case either) is gazing moodily at the<br />\ngall and wormwood comes in small dred and seventy-five dollars a year. beautiful mosaic floor. Jack lost a lot<br />\n• * *<br />\npackages.<br />\nof money today on the dice and is<br />\nPresident Angell of Yale says that wondering how he will be able to get<br />\na historical novel is like a bustle—it's along until his next allowance is<br />\na fictitious tale based on stern reality. given him. But our attention is<br />\n*<br />\n*<br />\nT.<br />\nRonald<br />\nDr.<br />\nby<br />\nCEMENT<br />\nANNOUN<br />\nquickly drawn down to the mosaic,<br />\nobscure to us,<br />\nlittle<br />\na<br />\nis<br />\nreason<br />\nThe<br />\nAbercrombie that the 1934-35 athletic<br />\nand we notice carefully the details.<br />\na<br />\nbudget will not permit the purchasing but students at Akron University at<br />\nThe mosaic contains some fifty<br />\nof sweaters for recipients of the var- recent poll voted in favor of retaining thousand pebbles, mostly black and<br />\nsity \"H\" is not to be passed off too their 8 o'clock classes instead of com- white. In the central panel is a youthlightly. It is a definite indication that ing half an hour later, as they could ful Dionysus driving his biga drawn<br />\nthe athletic association was entirely have done.<br />\nby two panthers. The box and reins<br />\n* * *<br />\ncognizant of the fact that it would be<br />\nof the car are in red pebbles. A tall<br />\nIt's a common belief (among junior<br />\nunable to provide the traditional \"H\"<br />\nnude figure heralds the approach of<br />\nsweater when it was in the process and senior) that the average univer- the biga and its occupant by running<br />\nthan<br />\nof drafting the budget. In other words, sity student has acquired more<br />\nconveyance. Around the<br />\nfor ahead of the<br />\nknowledge<br />\nof<br />\namount<br />\naverage<br />\nthe<br />\nn<br />\noccathe surprise and indignatio<br />\nis a border of dancing<br />\npanel<br />\nthis to central<br />\nsioned by Dr. Abercrombie's report a person his age. They hold<br />\nsatyrs, and a Pan.<br />\nmaenads,<br />\nfigures,<br />\nand<br />\nwas limited to the ranks of prospec- be particularly true of juniors<br />\nAs we leave to visit the dice room,<br />\ntive undergraduate recipients. The seniors,<br />\n• * *<br />\nwe notice beneath our feet the mosaic<br />\nassociation had long since mastered<br />\nway. Evidently we<br />\nP. Lorillard Co.,Inc.<br />\nHamilton College is offering a in the entrance<br />\nwhatever original feeling of regret<br />\na hurry to notice<br />\nof<br />\nmuch<br />\ntoo<br />\nin<br />\nwere<br />\nonly<br />\nopen<br />\n$500,<br />\nof<br />\np<br />\nand dismay it may have experienced. unique scholarshi<br />\nand it is well worth<br />\nto men by the name of Leavenworth. it on the way in,<br />\nAnyone who has paid the least atis done in about<br />\nmosaic<br />\nThe<br />\nnoticing.<br />\nare<br />\nname<br />\nthat<br />\nby<br />\nAll men in America<br />\ntention to the athletic revolution now<br />\npebbles and dethousand<br />\neight or ten<br />\neligible.<br />\nin effect at the University should have<br />\n* * *<br />\npicts two Pans standing with horns,<br />\nlittle difficulty in resolving this situand body, and goat's<br />\nThe whole population of the State bared breasts<br />\nation to its fundamental premises.<br />\non tiptoe, leaning<br />\nstand<br />\nThey<br />\nlegs.<br />\nof Nevada could be seated in the staObviously, the newly installed intrahands thrown<br />\ntheir<br />\nwith<br />\nforward<br />\n.<br />\nUniversity<br />\nStanford<br />\ndium of<br />\nmural program, with its attendant<br />\n* * *<br />\nback.<br />\noutlay for instructors, equipment, etc.,<br />\nAs we approach the dice room, we<br />\nTime, the game of<br />\nto<br />\nAccording<br />\nhas been the recipient of the lion's<br />\nthe cubes against<br />\nbasketball with the possible exception hear the click of<br />\nshare of funds this year. That the<br />\nthey are rolled.<br />\nwhich<br />\non<br />\nmosaic<br />\nthe<br />\nfurof the New York Stock Exchange<br />\nassociation displayed commendable<br />\nwheel<br />\ns with most statis- Below and to the right of the<br />\nnewspaper<br />\nnishes<br />\njudgment in this particular is not to<br />\nof St. George.<br />\ncross<br />\nthe<br />\nout<br />\nworked<br />\nis<br />\ntics.<br />\nbe questioned, much less denied; the<br />\n*<br />\n*<br />\nIt is simple, but beautifully executed.<br />\nstudent<br />\nenthusiasm with which the<br />\nthe time for the<br />\nStudents at the University of Chi- Wait! Here comes<br />\nbody has taken to the program, and,<br />\nwinner of this<br />\nThe<br />\nthrow.<br />\nVenus<br />\nreal<br />\nexcept<br />\nexams,<br />\ncago are not graded on<br />\nmore important, its apparent tendency<br />\nsum<br />\nives, since they serve throw not only collects a large<br />\ncomprehens<br />\nthe<br />\nto serve as a genesis for a well-ordbenificence<br />\nthe<br />\nenjoys<br />\nbut<br />\nmoney<br />\nof<br />\nonly to acquaint them with unfamiliar<br />\nered and sadly-needed school spirit,<br />\n* * *<br />\nof the Goddess Venus. There's Jack<br />\nmaterial.<br />\nN. CHARLES STREET<br />\nthe<br />\nto<br />\nevidence<br />\nfurnish irrefutable<br />\nthe corner. We wonder whether he<br />\nin<br />\nMost recent statistics from an inGreeting Cards - Sending Library<br />\ncontrary.<br />\nmoney to pay<br />\nvestigation at U. of Iowa inform us will even have enough<br />\nOpen Evenings<br />\nBut the Charybdis which beset the that out of eleven campus engage- the entrance fee. Yes, he evidently<br />\nassociation at the very outset of its ments one results in marriage.<br />\nhas, because he is walking to the desk<br />\ndeliberations and which seems to have<br />\nof the scribe. We watch the rolls with •<br />\n* * *<br />\nPhone Belmont 7908<br />\nexacted its inevitable toll resided in<br />\nexcitement, and cheer loudly each<br />\nIt took a group of students of highthe<br />\nupon<br />\nemphasis<br />\nhis<br />\nof<br />\nmakes<br />\nJack,<br />\nminimizing<br />\nthe<br />\ntime our favorite,<br />\ner studies to come to the conclusion<br />\nsignificance traditionally attached to<br />\nThe popularity of the new<br />\nroll. Finally Jack wins, and now when<br />\nconverthe<br />\nof<br />\nSt. Paul at 33rd Street<br />\nproportion<br />\ngood<br />\na<br />\nthat<br />\nhome, his father<br />\nmembership on a varsity team as -exFlex is spreading like<br />\nhis<br />\nto<br />\nSwank<br />\nreturns<br />\nhe<br />\nndy<br />\nSupplies-Ca<br />\nhool<br />\nPrescriptions-Sc<br />\nsation among members of one sex is<br />\narms.<br />\nopen<br />\nemplified by the \"H\" sweater. Along<br />\nwith<br />\nhim<br />\nwelcome<br />\nwill<br />\nwildfire — because smartly<br />\nCigars - Unexcelled<br />\nabout members of the other sex.<br />\nService<br />\nFountain<br />\nwith the present democratizing intramen appreciate its<br />\nconcludes<br />\ndressed<br />\nabout<br />\njust<br />\n*<br />\n* *<br />\nThis attraction<br />\nmural policy there should be this<br />\n—<br />\nfeature<br />\nrewe<br />\nso<br />\nmain<br />\nday,<br />\nthe<br />\nfor<br />\nexcitement<br />\nthe<br />\ngrid<br />\nfamed<br />\nFred Borries, Navy's<br />\nhigher goal which to enterprising athThis feature permits adjustof the largest turn to our homes and await expectis<br />\nthe<br />\nholder<br />\nstar,<br />\nletes might attain; certainly the two<br />\nbe old<br />\nment at any desired style annumber of \"N stars\" ever won' by a antly the day when we will<br />\nare compatible. For the association to<br />\nperwill<br />\ngle and allows both collar<br />\nfathers<br />\nour<br />\nthat<br />\nso<br />\nenough<br />\npreis<br />\ninsignia<br />\nstar<br />\nn.<br />\nThe<br />\nmidshipma<br />\nremove this Olympian summus maxtie to fall in natural lines.<br />\nand<br />\ngamble.<br />\nsented to athletes who take part in mit us to<br />\nimus smacks of a mistaken sense of<br />\nto attach.<br />\nEasy<br />\nand<br />\nmorning<br />\nwhich<br />\nArmy<br />\nnext<br />\nthe<br />\nathletic contests against<br />\nWe wake up<br />\neconomy or of value—possibly both.<br />\nhave been won by the Navy.—Asso- find ourselves at Johns Hopkins!<br />\n(only a week from exams.).<br />\nciated Collegiate Press.<br />\n* * *<br />\nSTONE'S THROW FROM THE!<br />\nSome of the subject matter of the<br />\nin f<br />\n4<br />\narticle<br />\nan<br />\nfrom<br />\ntaken<br />\nwas<br />\nin<br />\nabove<br />\nstudents<br />\ncollege<br />\nof<br />\nCAMPUS<br />\nnumber<br />\nThe<br />\nJewelry, First Floor and<br />\nTHE PARENT of another of our unissue of the \"American<br />\nJanuary<br />\nthe<br />\napincreased<br />\nhas<br />\nStates<br />\nUnited<br />\nthe<br />\nlast<br />\naway<br />\nMan's Shop, First Mezzanine<br />\npassed<br />\ndegraduate students<br />\nCuisine<br />\nExcellent<br />\nJournal of Archaeology\". The article<br />\nFriday in the person of Dr. James M. proximately 900 per cent since 1900,<br />\nis on \"The /Villa of Good Fortune at<br />\ncontry<br />\nthe<br />\nof<br />\npopulation<br />\nthe<br />\nwhile<br />\ntogether<br />\nDelevett. The NEWS-LETTER,<br />\nOlynthus,\" and was written by Dr.<br />\ncent.<br />\nwith the entire University, extends has increased only 63 per<br />\nM. Robinson.<br />\nDavid<br />\n41.111.10.0.•••••••••••••••••••••.••••••••••••••••••••••••••••••••••••••••<br />\nprove<br />\nto<br />\ngoes<br />\nall<br />\nheartfelt sympathy to his son, Allen. Which<br />\nSubscription per year<br />\nBy Mail<br /><br />\n$2.00<br />\n$2.50<br /><br />\nEDITOR<br /><br />\nA4<br />\n0]<br /><br />\nAssotiatrd goilesita? Vress<br />\nIt Rains Evidence<br /><br />\neciried by a Windbag<br /><br />\n..<br /><br />\nazH 0/61goki<br /><br />\nIntercollegiates<br /><br />\nGiving The Assn.\"H\"<br /><br />\ntkett‘<br /><br />\nIf you're<br /><br />\ncornered at a fancydress ball by a tedious \"ME-Man,\" don't let the<br />\npest spoil your party. Count ten and light a<br />\nsunny-smooth Old Gold. Every puff of a mellow,<br />\nmild 0. G. is like a friendly pat on the back.<br /><br />\n‘trir TRYING TIMES .... TRY A Smooth, OLD GOLD<br /><br />\n1<br /><br />\nNooney Book Shop<br />\n1902<br /><br />\nBirely's Pharmacy<br /><br />\nFirst in Baltimore!<br /><br />\nA NEW IDEA<br />\nIN COLLAR<br />\nHOLDERS<br /><br />\nEAT AT THE<br /><br />\nIn Memoriam<br /><br />\nt<br /><br />\nBoulevard<br />\nnt<br />\nRestaura<br />\n4<br />\nA<br /><br />\nt<br /><br />\n3226 Greenmount Ave.<br /><br />\n:10e and $411<br /><br />\nswnmi<br /><br />\nHOCHSCHILD,K0111N&amp;CO.I<br /><br />\nSay,<br /><br />\n1Vit<br />\nAcc<br /><br />\nsoeia<br />\naeCLE<br /><br />\nof in<br />\nberg<br /><br />\nJohn<br />\ndress<br />\nLeap<br />\ntion<br />\nout<br />\nthe i<br />\ntrig(<br />\nfour<br />\nimp(<br /><br />\nempl<br />\nPirs1<br />\nenv]<br />\nsem<br />\nUlm(<br />\nOf lc<br />\nadm:<br />\nat 11<br />\nWonl<br />\ninus1<br />\nPloy<br />\nthe<br />\nci<br /><br />\nproo<br />\nof t<br />\nSlur<br />\nColn<br />\nOr c<br />\nhew<br /><br />\nbill<br /><br />\nof ti<br /><br />\n'fit<br /><br />\nfor<br />\nthe<br />\nane(<br /><br />\nErn<br />\nlast<br />\nrflor<br />\nbill<br />\nof 1<br />\nof 1<br /><br />\nTier<br /><br />\ngov<br />\nact<br />\nhe<br /><br />\nby<br />\nof 1<br />\nfay<br />\ntry<br /><br />\ngrE<br />\nder<br />\nea'<br />\nan<br /><br />\nen<br /><br />\nHOME WOOD, BALTIMORE, MD., JANUARY 22, 1935.<br /><br />\n1)11. Blumberg<br />\nAddressesN.S.L.<br />\nOn Insurance<br />\nSays Continuity Of Income Is<br />\nFundamental Objective To<br />\nBe Sought By Employees<br /><br />\nMust Insure Income<br />\nAccuses Administration Of<br />\nAttempting To Enact Bill<br />\nDevoid Of This Main Ideal<br /><br />\n3.<br />\nit<br /><br />\n\"The fundamental objective of any<br />\nsocial insurance program must be to<br />\nsecure for all employees a continuity<br />\nof income,\" said Dr. Albert E. Blumberg, instructor in philosophy at the<br />\nJohns Hopkins University, in his address before the National Student<br /><br />\nMeier Katz Memorial<br />\nGii?en To Page School<br />\nMrs. Jacob Blaustein, of Baltimore, has offered the Walter Hines<br />\nPage School of International Relations at the Johns Hopkins University a lectureship in honor of<br />\nher father, Meier Katz, it was announced by Dr. Frederick Sherwood Dunn, associate member of<br />\nthe Page School and Creswell Lecturer on International Law.<br />\nThe Meier Katz Memorial Lectureship provides for two or three<br />\nlectures each year on international<br />\nproblems. Speakers have not yet<br />\nbeen selected, and the lectures will<br />\nnot begin until next year.<br /><br />\nN.S.L. Open Letter<br />\nDemands Liberality<br />\nIn New President<br />\n(Continued from Page 1, Col. 3)<br />\nWar we have had nothing to assure<br />\nus that the same course will not again<br />\nbe followed. The University has not<br />\ndevoted itself openly and avowedly to<br />\nthe real problems which are confront-<br /><br />\nHopkins Undergrads Attack<br />\nA.C.E. Peace Poll Questions<br /><br />\nTelegram To The Editor<br />\nLDB 17 DH-BALTIMORE MD 15<br />\nJohns Hopkins News-Letter<br />\nBalto<br />\nShipmun B. Wilcox, Superintendent of Western Union, announced<br />\ntoday that his company has placed<br />\nits nation-wide system of telegraph<br />\noffices at the disposal of President<br />\nRoosevelt's Birthday Ball Committee for receiving 25 cents from each<br />\nperson who places his signature on<br />\na multiple signature birthday<br />\ngreetings telegram addressed to<br />\nthe President. Signatures from every city, town and hamlet in the<br />\nState of Maryland, as well as other<br />\nStates in the Union, will be mailed<br />\nto New York City, where they will<br />\nbe bound into what probably will<br />\nbe the greatest 'birthday greeting<br />\nin history. One hundred per cent<br />\nof the money received from signatures will be turned over to the<br />\nNational Birthday Ball Committee<br />\nand the committee will arrange<br />\nfor proper credit for each commu-<br /><br />\n\"Literary Digest\" Questions On Peace Problem Also Defended And Ridiculed In Interviews Given By<br />\nInquiring Reporter<br />\nOpie Chancellor, a senior, who<br />\nThe prevailing opinion of Johns•by<br />\n\"If the questions were clearer,<br />\nsaid,<br />\nin<br />\nHopkins University undergraduates<br />\nwould be an excellent way<br />\npoll<br />\nthis<br />\nCollege<br />\nof<br />\ntion<br />\nAssocia<br />\nthe<br />\nregard to<br />\nning the opinion of the coldetermi<br />\nof<br />\nEditors' peace poll, which is being<br />\nAs they stand, they are not<br />\nman.<br />\nlege<br />\nin<br />\nDigest<br />\ny<br />\nconducted by the Literar<br />\ncan not be answered by<br />\nand<br />\nexplicit<br />\n120 colleges throughout the country,<br />\nno.\"<br />\nor<br />\nyes<br />\nof<br />\npoll<br />\na<br />\nis that the idea of having<br />\nPoll Defended<br />\nthis kind is good, but that the quesrg, editor-in-chief<br />\nBlumbe<br />\nStanley<br />\nthey<br />\ntions of the poll are such that<br />\nETTER, in defending the<br />\nof<br />\nNEWS-L<br />\nthe<br />\nacno,<br />\nor<br />\nyes<br />\nby<br />\nd<br />\nanswere<br />\ncan not be<br />\nC. E. poll, said, \"It's true that sevcording to answers given the inquir- A.<br />\nof these questions, perhaps all<br />\neral<br />\ning reporter.<br />\nof them, might be more satisfactorily<br />\nThe poll was attacked by Bernard<br />\nanswered in terms of pro and con disBreiter, a sophomore in the College<br />\ncussion rather than the yes or no<br />\nof Arts and Sciences, who said, \"This<br />\nmethod. However, the latter was the<br />\nparticular poll is a very ineffectual<br />\nexpedient means of obtaining a<br />\nonly<br />\nmethod of arriving at any satisfactory<br />\nful total. Furthermore, I bemeaning<br />\nconclusion. The questions are sterelieve that a great majority of the<br />\notyped ones that you can't get much<br />\nstudents understand the basic nature<br />\nout of.\"<br />\nof each question.\"<br />\nAttack Continued<br />\nDavid Levy, a junior, also defendthe ballot by replying, \"I think it<br />\ned<br />\nconn,<br />\na<br />\nfreshma<br />\nd,<br />\nDiamon<br />\nWilliam<br />\ncontinued the attack when he replied, is a very good idea to get the<br />\non<br />\nmen<br />\ncollege<br />\nof<br />\nopinion<br />\nof<br />\ndevil<br />\nsensus<br />\nthe<br />\nbetween<br />\nus<br />\n\"The ballot puts<br />\nand the deep blue sea. We must either a question as important as the peace<br /><br />\nDandy Selected<br />\nOne Of Highest<br />\nIn '34 Medicine<br /><br />\nnity.<br />\nE. L. SOLLERS,<br />\nNight Manager, Western<br />\nUnion Telegraph Co.<br /><br />\nFamed Hopkins Brain Surgeon Set Among 25 Highest In Year's Contributions<br /><br />\nCures Meniere Ill<br />\nOperates On Hearing Nerve;<br />\nModern Medicine Periodical Also Picks Dr. Dafoe<br />\nDr. Walter Edward Dandy, brain<br />\nsurgeon of the Johns Hopkins Hospital, was one of the twenty-five men<br />\nregarded as having made the greatest<br />\ncontributions to medical science during the year 1934.<br />\nThe selection, which included the<br />\nnames of such renowned doctors as<br />\nDr. Allan Roy Dafoe and Dr. Harold<br />\nC. Urey, was made by the periodical<br /><br />\nLeague last Friday.<br />\nAccusing the Roosevelt administration of attempting to enact a social<br />\n\"Modern Medicine.\"<br />\ninsurance bill which does not carry<br />\nTreats Meniere's Disease<br />\nout this ideal and which would mean<br />\nof Dr. Dandy's work in<br />\nBecause<br />\nthe further exploitation of the workact the nationalistic militarist or go problem.\"<br />\ntreatment for Meniere's<br />\ntoday.<br />\na<br />\ning<br />\nsociety<br />\ning<br />\ndevelop<br />\nHumor In Answers<br />\ning class, Dr. Blumberg laid down the<br />\nto the opposite extreme. The ballot<br />\nMeniere's disease<br />\npseudowe<br />\nand<br />\ntances<br />\ndisease<br />\nUnder these circums<br />\nHumor was to be found in several of<br />\nfour principles which are of prime<br />\nwas poorly organized since it leaves<br />\nauditory nerve,<br />\nthe<br />\nof<br />\nalong<br />\nnt<br />\nions<br />\ntreatme<br />\nsuggest<br />\nby<br />\nmake<br />\nto<br />\nlike<br />\nfreshiMportance in the enactment of un- should<br />\nopen no middle patch and does not the answers. Aaron Zheutlin, a<br />\nd in the list.<br />\ninclude<br />\nof<br />\nwas<br />\nhis name<br />\nin regard to the choice<br />\nemployment insurance legislation. two lines<br />\ntake into consideration the main man, answered, \"If war comes, I'll<br />\nbrain malady<br />\na<br />\nis<br />\ndisease<br />\nfirst<br />\nnt<br />\n's<br />\nAmes,<br />\nPreside<br />\nMeniere<br />\nto<br />\nor<br />\nPirst, the law must apply to all un- a success<br />\nns that arise in the minds of hide in the cellar.\" Jewett Goldsmith,<br />\nDr. Roger Adams, president of the that brings on spells of dizziness.<br />\nbe made questio<br />\nshould<br />\nchoice<br />\nthe<br />\nhow<br />\nto<br />\nas<br />\nswell<br />\na<br />\n\"It's<br />\nsaid,<br />\nons;<br />\nemployed without any excepti<br />\nmost students—What is the cause of another freshman,<br />\nAmerican Chemical Society, spoke on<br />\nIn tests that took many years, it<br />\nsecondly to qualifications for the<br />\nsecond, the system must insure a con- and,<br />\nand what are we to do about it?\" advertising stunt. I'd recommend it \"Recent Trends in Applied Organic<br />\nwar,<br />\nshown that the nerve impulses<br />\nn the<br />\nregards<br />\nwas<br />\nselectio<br />\nAs<br />\nnt.<br />\nPreside<br />\ncolumn<br />\ntinuous income throughout the period<br />\nThat the idea of having a poll it- to any journal that has extra<br />\nry\" last Saturday night in<br />\nChemist<br />\ncaused the vertigo, accompanshould<br />\nbody<br />\nwhich<br />\nstudent<br />\nOf loss of ordinary income; third, the faculty and the<br />\nself was a good one was backed up space to fill.\"<br />\nRemsen Hall before a large audience. ied by total loss of balance, were<br />\nbecause<br />\nfirst<br />\nfaculty<br />\nThe<br />\nd.<br />\nconsulte<br />\nbe<br />\nadministration of all funds must be<br />\nDr. Adams was born in Boston, transmitted by a nerve in the brain<br />\nthe Pres• at least partly in the hands of the they must cooperate with<br />\nHe was graduated from HarMass.<br />\nwhich also has control over a person's<br />\nif the institution is to succeed,<br />\nWorkers themselves; and fourth, there ident<br />\nUniversity with a Ph.D. degree,<br />\nvard<br />\nand<br />\nhearing.<br />\ntheir lives' work<br />\nMust be no contributions from em- and because<br />\n1912. He taught for several years at<br />\nCuts Nerve Partially<br />\nreputations are inextricably<br />\ntheir<br />\nof<br />\nexpense<br />\nthe<br />\nwas<br />\nhe<br />\nfor<br />\nWar<br />\nthe<br />\npay<br />\nPloyees to<br />\nHarvard, and during<br />\nwith the University.<br />\nup<br />\nyears it was common<br />\nbound<br />\nformer<br />\nIn<br />\nthe system.<br />\na major in the Chemical Warfare<br />\nthe nerve, curing<br />\nsever<br />\nto<br />\nsome<br />\ngiven<br />\nbe<br />\npractice<br />\ns<br />\nshould<br />\nstudent<br />\nThe<br />\nto<br />\nwent<br />\nService. From Harvard he<br />\nWages Have Decreased<br />\nbut leaving<br />\nvertigo<br />\nthe<br />\nat<br />\nof<br />\nis,<br />\npatient<br />\nity<br />\nthe<br />\nbecause the Univers<br />\ntire University of Illinois.<br />\nCiting the records of the NRA as voice<br />\ndeaf. In his experiments<br />\ncona<br />\ntotally<br />\npay<br />\nthey<br />\nhim<br />\ntheirs;<br />\npartly,<br />\nleast<br />\nIn Many Groups<br />\nProof of the fact that the real wages<br />\n\"Theory, Reality, Realism In Since 1926<br />\nshowed that by cutting<br />\ne share of the maintenance<br />\nhe has been professor of Dr. Dandy<br />\nof the country have decreased, Dr. siderabl<br />\n3<br />\ny, the disease would<br />\n,<br />\nGive<br />\npartiall<br />\nmuch<br />\nas<br />\ne<br />\nnerve<br />\ntime,<br />\nrombi<br />\none<br />\nthe<br />\nAberc<br />\nany<br />\nat<br />\nare<br />\nle<br />\nand<br />\nLascel<br />\national Politics\" Sub- organic chemistry at the University<br />\nIntern<br />\nlalumberg declared that \"funds must<br />\nbe cured without any effect on the<br />\nUniversity as any other one eleof Illinois and head of the Departe Turnbull<br />\ncome from the employer and the state, the<br />\nGraem<br />\nPercy<br />\nTalk<br />\nday<br />\nThurs<br />\nOf<br />\nject<br />\nly<br />\nhearing.<br />\nnatural<br />\nfollow<br />\nperson's<br />\nto<br />\nseems<br />\nOr else the bill would be in effect a ment. It<br />\nment of Chemistry there.<br />\nApril<br />\nr, Dr. Dandy is known the<br />\nIn<br />\nHoweve<br />\nSeries<br />\nso vitally interested as<br />\ne<br />\ngroups<br />\nLectur<br />\nthat<br />\nAmerthe<br />\nnew wage cut.<br />\nDr. Adams is a Fellow of<br />\n, assistant liMattern<br />\ns<br />\nJohanne<br />\nDr.<br />\nas an outstanding authorbody<br />\nover<br />\nstudent<br />\nthe<br />\nand<br />\nworld<br />\nare the faculty<br />\nSciences<br />\nsci- ican Academy of Arts and<br />\n\"The only unemployment insurance<br />\nsurgery. Patients whom<br />\nbrain<br />\nAbercrombie has been brarian and lecturer in political<br />\non<br />\nity<br />\ngiven a voice in the choice<br />\nbe<br />\nLascelle<br />\nshould<br />\nDr.<br />\nCounh<br />\nbill ever introduced in the Congress<br />\non \"The- and of the National Researc<br />\naddress<br />\nan<br />\nd<br />\ndelivere<br />\nence,<br />\nhave come to him unPercy<br />\nthe<br />\ntreated<br />\nfor<br />\nchosen as the lecturer<br />\nof the President.<br />\nhe is a member of he has<br />\nOf the United States which has been<br />\nand Realism in Inter- cil. Among others<br />\nReality,<br />\nory,<br />\ntances, like the<br />\ncircums<br />\nseries<br />\nship<br />\nmany<br />\nLecture<br />\nl<br />\nder<br />\nTurnbul<br />\ngradwe,<br />\nhaft.<br />\nof - the Deutsche Chemische Gesellsc<br />\nin accord with all the requirements In line with this attitude students, Graeme<br />\ns<br />\nmember<br />\nbefore<br />\n\"<br />\nl<br />\nPolitics<br />\nflown from the<br />\nnationa<br />\nwas<br />\ngiven<br />\nthat<br />\nare<br />\nthis year. The six lectures<br />\nundergraduate<br />\nassociate editor of small child<br />\nfor an effective social legislation is uate and<br />\nRelations Club at a He also was an<br />\nional<br />\nthe care of<br />\nInternat<br />\nthe<br />\nwider<br />\nthe<br />\nput<br />\nby<br />\nbe<br />\nchosen<br />\nto<br />\nlecturer<br />\nSouth<br />\na<br />\nby<br />\nfor<br />\nannually<br />\nof our specifications<br />\n\"The Journal of the American ChemJanthe Workers' Unemployment Insur- present some<br />\ny,<br />\nThursda<br />\non<br />\nn<br />\nmeeting<br />\nluncheo<br />\n.<br />\nsurgeon<br />\nity from<br />\nthe eminent<br />\nPresident of the Johns Hopkins Uni- President of the Univers<br />\nical Society.\"<br />\nance Bill presented by Representaive a<br />\nawake among \"properly qualified authors, uary 17.<br />\nman<br />\na<br />\nbe<br />\nshould<br />\nHe<br />\nversity.<br />\nErnest Lundeen of Minnesota at the<br />\nDr. Mattern defined theory, reality,<br />\nand economic implica- writers or professors of America or<br />\n. last session and again during the past to the social<br />\nrealism and drew a sharp line of<br />\nand<br />\nof modern thought, science, and Europe.\"<br />\nMonth. The main objection to this tions<br />\ndistinction between the three. He<br />\nNative Of England<br />\nshould be liberal to<br />\nbill is that it would mean the recovery technology. He<br />\nsaid that theory is the conception that<br />\nEngvoicing of<br />\nDr. Abercrombie is a native of<br />\nOf the working class at the expense the extent of allowing the<br />\nthere is a binding international legal<br />\ndeM.A.<br />\nhis<br />\nd<br />\nreceive<br />\ncampus<br />\nland, having<br />\nall types of opinion on the<br />\nOf the capitalistic class.\"<br />\nand<br />\nhe has order as the League of Nations<br />\nexcept those which support move- gree from Liverpool. Since 1929<br />\nReality is the fact<br />\nCourt.<br />\nWorld<br />\nthe<br />\nAttacks Bill<br />\nre<br />\nliteratu<br />\nsciEnglish<br />\nof<br />\nto<br />\nbeen professor<br />\nments such as fascism, hostile<br />\nthat nations act on the basis that is<br />\nDr. Blumberg attacked the Wagculture—movements which at the University of London.<br />\nand<br />\nence<br />\nin international relations only the law<br />\nner-Lewis Bill as an attempt of the<br />\nleca<br />\nEvening Wear and Raincoats Excepted<br />\nwas<br />\nFrom 1919 to 1922 he<br />\nreact ultimately to the detriment of<br />\nis<br />\nradical<br />\nRealism<br />\non.<br />\nmore<br />\nexpansi<br />\nand<br />\ngrowth<br />\nof<br />\nprevent<br />\ngovernment to<br />\nity of<br />\nthe students, workers, and the -middle turer of poetry at the Univers<br />\nthe harmonizing of theory and realaction. \"The present administration,\"<br />\nshould be opposed to war Liverpool. Until 1929 he was a proHe<br />\nclass.<br />\nity. He added, \"Every nation today<br />\nhe continued, \"has been characterized<br />\nthe<br />\nat<br />\nure<br />\nLiterat<br />\nfathe<br />\nEnglish<br />\nfessor of<br />\nand should be determined that<br />\nfavor<br />\nin<br />\nion<br />\nlegislat<br />\nof<br />\ns<br />\nbelieves it must reorganize to live<br />\npromise<br />\nits<br />\ntime<br />\nby<br />\ncilities of the Johns Hopkins Uni- University of Leeds. During that<br />\ndently from other nations,<br />\nindepen<br />\nOf the working class and its action in<br />\nand<br />\nhips,<br />\nlectures<br />\nmany<br />\naid<br />\nhe also held<br />\nversity shall never be utilized to<br />\ncounthe<br />\nof<br />\nalists<br />\nof course, a fallacy.\"<br />\nis,<br />\nindustri<br />\nwhich<br />\nthe<br />\nfavor of<br />\nalso holds honorary degrees from<br />\nthe conduct of an imperialistic war.<br />\nCites Example<br />\ntry. The result of the Roosevelt proties.<br />\nUniversi<br />\nBelfast<br />\nand<br />\nHe should be aware of the mental Cambridge<br />\nDr. Mattern then gave specific exgram will be the shifting of the burWorks<br />\nPublished Many<br />\nwhite and Negro races<br />\nden to the state governments which equality of the<br />\namples, one of three differentiating<br />\nDr. Abercrombie has published<br />\nUniversity and should<br />\nthe<br />\nin<br />\ntaught<br />\nas<br />\nbetween the, which was in respect to<br />\ncannot succeed.<br />\nre.<br />\n211-213 E. Baltimore St.<br />\nto open the doors of the Uni- many works on poetry and literatu<br />\nresources. \"According to thenatural<br />\n\"Satisfactory unemployment insur- intend<br />\na<br />\nHardy,<br />\ns<br />\n\"Thoma<br />\nare<br />\nmany capable Negro Among them<br />\nory, natural resources are merely a<br />\nance must come from the federal gov- versity to the<br />\ndesire admission. He Critical Study,\" \"Four Short Plays,\"<br />\nwho<br />\ns<br />\nstudent<br />\nfor the country in which they<br />\nernment.\"<br />\n\"Theory of boon<br />\nshould be broadminded enough not to \"Deborah,\" \"The Epic,\"<br />\nfound.<br />\nare<br />\ng and<br />\ndiscriminate against any student or Art,\" and \"Poetry, its Meanin<br />\n\"Reality says that a nation withJames Franck Named faculty member in any way because Music.\"<br />\nout these resources can get them by<br />\nTo Physics Department of race, creed, or political affiliation. He has been the lecturer in fine arts conquest of the nations that possess<br />\nHe should be opposed to such eco- at the Queen's University of Belfast. them. Realism argues that the naWorld-Famous Scientist Appointed nomies as the present administration In 1923 he was the Clark Lecturer at tion possessing these natural rehas effected in the form of cutting Trinity College, Cambridge. He re- sources should act as the guardian and<br />\nTo Replace Dr. Ames; Winner<br />\nthe salaries of the janitors and the ceived his early education at Malvern custodian of them, but should share<br />\nOf Nobel Prize<br />\ncampus workers to a subsistence lev- College and Victoria University.<br />\nthem with the other nations.\" Dr.<br />\n1)<br />\nCol.<br />\n1,<br />\nPage<br />\nel. Understanding that the public is<br />\n(Continued from<br />\nTHE HOME OF<br />\nMattern proved this point by pointing<br />\nthat<br />\nreform of light has been developed by responsible for education and<br />\ntheir<br />\npooled<br />\nAllies<br />\nout that the<br />\ntr. Franck to a point where the mod- ability and not wealth is the imporsources with great success during the<br />\nhe<br />\nof a student,<br />\nWar and that today nations have gone<br />\nern system of neon sign lighting has tant qualification<br />\nHART SHAFFNER e? MARX,<br />\nd to ask for federal<br />\nbe<br />\nprepare<br />\nshould<br />\nimfar as to share canals and rivers.<br />\nthe<br />\nso<br />\nbeen made possible. Recently<br />\nor state aid for the University in orThe senior section of the Hullabaloo •<br />\nPortant subject of the nucleus of the der to provide opportunity for adSOCIETY BRAND and WAKELY CLOTHES<br />\nFree Manicuring<br />\nAfter<br />\n20.<br />\nMarch<br />\non<br />\npress<br />\nto<br />\nn.<br />\ngo<br />\nwill<br />\nattentio<br />\natom has claimed his<br />\nvanced education for a greater numTheodore's Barber Shop<br />\nthat day, all seniors desiring their<br />\ns<br />\nX.nowledge of the transmutation of ber of competent student:<br />\nFormerly with EMIL CAYE<br />\nJohn<br />\nsee<br />\nmust<br />\nannual<br />\nthe<br />\nin<br />\npictures<br />\nCAlvert 4444<br />\nelements and artificial radiocativity<br />\nBaltimore, Charles and Fayette<br />\nS. W. C,or. St. Paul and 33rd Streets<br />\nDeHoff, editor-in-chief, or Roland<br />\nto<br />\nNext<br />\nBirely's<br />\nhas come to light through research<br />\nMerson, president of the Senior Class. 8 A. M. to 8 P. M.<br />\nWork on the Hullabaloo has pro- •<br />\nin this field.<br />\n•<br />\ngressed very rapidly, and already<br />\nCHARLIE DER<br />\nmany of the engravings have been<br />\nIlurnor Issue Of \"Blue Jay\" The Hopkins Band will give a con- sent to the contractor.<br />\nFIRST CLASS LAUNDRY<br />\n3224 GREENMOUNT AVE.<br />\nIssued During Exam Week cert for the Maryland National Guard Editorial writing will begin immeButtons Sewed On, Stockings<br />\ntions, while<br />\nexamina<br />\nthe<br />\nafter<br />\ndiately<br />\nat Broadway, Sunday, March 3, it<br />\nMended, and all Needed Repairs<br />\nthe activity pictures not yet photoJokes And Clippings To Be Feature<br />\nwald,<br />\nHenry<br />\nFenster<br />\nAt No Extra Charge<br />\nby<br />\ned<br />\nannounc<br />\nwas<br />\ngraphed will be taken on February 10.<br />\nOf Fourth Issue, Editor<br />\nthis<br />\nearly<br />\nBand,<br />\nthe<br />\nof<br />\nleader<br />\nstudent<br />\nAnnounces<br />\nweek.<br />\nFollowing the above engagement,<br />\nThe fourth issue of the Blue Jay,<br />\nCALVERT and 30TH STS.<br />\nFOR CLEANING, DYEING and<br />\nit is probable that<br />\nSo we'd like you to file for future reference that our whole<br />\nsaid,<br />\nwald<br />\nFenster<br />\nschedis<br />\nFirst in Quality — First in<br />\ne,<br />\nPRESSING—Reasonable Rates<br />\nmagazin<br />\nformer campus<br />\nWe Call For and Deliver<br />\nService<br />\nstore is at your service — though we call your attention<br />\nUled to come out during the week of the Band will play at all the lacrosse<br />\n5318<br />\nBel.<br />\ntoo<br />\nsmall.<br />\ndelivery<br />\nCH. 9849<br />\nNo<br />\n21st St.<br />\nE.<br />\n'101<br />\nour<br />\nbasthe remaining<br />\nespecially to our Men's Shop on the first floor, and<br />\nJanuary 28, at the time of the exam- games and some of<br />\nate<br />\nnecessit<br />\nwill<br />\nThis<br />\n.<br />\ninations, it was announced Saturday ketball contests<br />\nYoung Men's Shop on the third. Perhaps you won't even<br />\nas complete an attendance as possible<br />\nby John Reddick, editor.<br />\nhave to come in; try writing or phoning us!<br />\nJ. H. FLTRST CO.<br />\nat rehearsals and for the next several<br />\nThis issue is to be a humor numpresent.<br />\nbe<br />\nmust<br />\nmen<br />\nall<br />\nPrinters of<br />\nweeks<br />\nber, with a wide selection of clips<br />\nsnare<br />\na<br />\nAL and SCIENTIFIC<br />\nfor<br />\nLOGIC<br />\nopen<br />\nPHILO<br />\nvacancy<br />\na<br />\nis<br />\nThere<br />\nPUBLICATIONS<br />\nand jokes, he said. A feature of note drummer, and anyone who is interTS<br />\nSTREE<br />\n25TH<br />\nand<br />\nES<br />\nCHARL<br />\n12-20 HOPKINS PLACE, BALTIMOEI<br />\nwill be book reviews, by Sea Jay, ested should report at the Barn on<br />\nServing Maryland's Finest Food<br />\nProminent New York critic.<br />\nMonday afternoon.<br /><br />\nDr.Adams Discusses<br />\nTrends Taken By<br />\nOrganic Chemistry<br /><br />\nProminent Author Mattern Talks To<br />\nAnd English Prof. Relations Club At<br />\nWill Speak Here Luncheon Meeting<br /><br />\n.<br />\nSuits, Topcoats 1<br />\nand Overcoats<br /><br />\nwik<br /><br />\n4<br /><br />\nCalvert Room Suits<br />\nand Topcoats,$17.50<br /><br />\nNo Chargefor Alterations<br /><br />\n0F F<br /><br />\nKATZ CLOTHES<br /><br />\nDr.<br /><br />\nHub<br /><br />\nSenior Section To<br />\nBe Complete Mar.20<br /><br />\nBand Plans Concert<br />\nTo Be Held March 3<br /><br />\nPeabody Pharmacy<br /><br />\nEVEN A BUSY COLLEGE MAN<br />\nNEEDS TO GO SHOPPING<br />\nONCE IN A WHILE<br /><br />\nFRIED'S<br /><br />\n,••••<br /><br />\nL<br /><br />\nTHE<br />\nCAMPUS INN<br /><br />\nHUTZLER BFCfftlEM<br /><br />\n..-••••••••••••M<br /><br />\nt<br /><br />\nNog<br /><br />\n4<br /><br />\nHOME WOOD, BALTIMORE, MD., JANUARY 22, 19.55.<br /><br />\nLoyola College Greek Games 1Jay Tanktnen Lose To F. ofM. Emmert Chosen<br />\nFive Trips Jays Phi Sig, Sig Ep, And Kappa Swimmers By Score Of 40-28 To Presidency<br />\nSig Lead Divisions In Frat Mermen Succumb To Strong Garnet Aggregation, DropByPoint Margin. Volleyball And Basketball ping Second Meet In Succession; Lou Adler Scores Of Spiked Shoe<br />\nLast-Minute Double-Decker<br />\nClinches Tilt For Jesuits<br />\nIn See-Saw Cage Thriller<br /><br />\nOn the basis of fifteen points for a<br />\nwin and five points for a game played<br />\nand lost, Phi Sigma Delta and Sigma<br />\nPhi Epsilon are leading their respective divisions in the fraternity bas-<br /><br />\nBluejays Stage Rally<br />\nRasin's Three Field Goals<br />\nSend Hopkins Ahead, But<br />\nWayson's Shot Wins Tilt<br /><br />\nketball league and Kappa Sigma is in<br />\nfirst place in its division in the fraternity volleyball league. No volleyball games have been played as yet<br />\nin the other diision.<br />\nEdwin Lotz and Frank Dotterweich,<br /><br />\nwho are conducting the basketball<br />\nIn their first encounter of the curtournament, and Ronald Levy, who is<br />\nrent season, the Loyola and Hopkins<br />\nin charge of the volleyball league,<br />\nquintets kept true to tradition and<br />\nstaged another thrilling tussle. After have announced that any team that<br />\na nip-and-tuck affair, in which the fails to appear on the time scheduled<br />\nlead constantly alternated from one will forfeit the game to its opponent<br />\nteam to the other, Loyola finally won<br />\nunless it has notified Lotz or Dotterout, 35 to 34.<br />\nweich or Levy at least 24 hours ahead<br />\nFrom the very beginning, the contest was packed with thrills and ex- of time.<br />\ncitement, and victory was in doubt,<br />\neven in the final seconds of the game. BASKETBALL TEAM STANDING<br />\nA field goal by Wayson clinched the<br />\nIncluding Games Played Jan. 19<br />\ngame for Loyola, after Hopkins had a<br />\nSection A<br />\nASne-point lead.<br />\nW. L. Pts.<br />\nLoyola Takes Lead<br />\nImmediately at the outset of the Sigma Phi Epsilon<br />\n2<br />\n1<br />\n35<br />\ncontest, the Greyhounds assumed a Kappa Sigma<br />\n2<br />\n0<br />\n30<br />\nfour-point lead. The Blue Jays then Kappa Alpha<br />\n1<br />\n1<br />\n20<br />\nbegan to click. They tied the score<br />\nDelta Upsilon<br />\n1<br />\n15<br />\n0<br />\nat 11-all and then slowly forged<br />\n0<br />\n2<br />\n10<br />\nahead. Chancellor played fine ball Alpha Tau Omega<br />\n5<br />\n0<br />\n1<br />\nduring this period and accounted for Phi Alpha<br />\nseven markers. The Darleymen ex- Tau Alpha Omega<br />\n0<br />\n1<br />\n5<br />\ntended their advantage to six points,<br />\nSection B<br />\nbut the Loyola boys came up fast.<br />\nW. L. Pts.<br />\nThe half ended 20 to 18, in favor of<br />\n50<br />\nDelta<br />\n3<br />\n1<br />\nPhi<br />\nSigma<br />\nthe Jays.<br />\n45<br />\n3<br />\n0<br />\nAs the second canto opened, the Phi Gamma Delta<br />\nGreyhounds, led by Carney, regained Pi Lambda Phi<br />\n2<br />\n2<br />\n40<br />\nthe lead. They played conservative Tau Alpha Phi<br />\n20<br />\n1<br />\n1<br />\nand steady ball. With but four min1<br />\n20<br />\nDelta Theta Pi<br />\nutes left to play, the Loyola quint en20<br />\n1<br />\n2<br />\nPhi<br />\nKappa<br />\nPsi<br />\njoyed a six-point advantage.<br />\n10<br />\n0<br />\n2<br />\nPhi<br />\nDelta<br />\nBasin Sinks Three<br />\nRasin was injected into the game Alpha Delta Phi<br />\n5<br />\n0<br />\n2<br />\nat this stage. Siegel, fleet Hopkins<br />\nVOLLEYBALL TEAM STANDING<br />\nforward, converted a foul. In rapid<br />\nSection A<br />\nsuccession, Rasin sank three long,<br />\nW. L. Pts.<br />\nmore<br />\nto<br />\nonce<br />\nspectacular hawkers<br />\nplace Hopkins ahead.<br />\n2<br />\n0<br />\n30<br />\nKappa Sigma<br />\nOn a well-executed play, Wayson Alpha Tau Omega<br />\n1<br />\n1<br />\n20<br />\ntallied his eventful score. With sec- Sigma Phi Epsilon<br />\n0<br />\n1<br />\n15<br />\nonds to play, the Jays futilely at- Phi Alpha<br />\n1<br />\n5<br />\ntempted to score.<br />\n1<br />\n0<br />\n5<br />\nKappa Alpha<br />\nSiegel High Scorer<br />\n1<br />\n0<br />\n5<br />\nTau Alpha Omega<br />\nCarney topped the Loyola scorers Delta Upsilon<br />\n0<br />\nwith 11 points. Colvin, flashy forward, accounted for nine markers.<br />\nSiegel led the Hopkins with 10; he<br />\nalso played a brilliant floor game.<br />\nCaptain Cliff Siverd played bang-up<br />\nball throughout.<br />\n• • •<br />\nThe court was very slippery. Reynolds and Siegel received severe floor<br />\nburns.<br />\n• • •<br />\nIn the last two games Captain Siverd has converted seven fouls out<br />\nof eight attempts.<br />\n• • •<br />\nJimmy Benson, Blue Jay trainer,<br />\nappears to be the most enthusiastic<br />\nof the Hopkins rooters. His antics on<br />\nthe bench were sincere demonstrations of his loyalty.<br />\n• • •<br />\nRasin attempted only three shots.<br />\nHe made them all good.<br />\n• • •<br />\nCarney was badly shaken up when<br />\nhe took a spill midway in the second<br />\nhalf.<br />\nI • •<br />\nThe game was a Maryland Intercollegiate Basketball League contest.<br />\nThe line-up:<br />\nLOYOLA<br />\nHOPKINS<br />\nG. F. T.<br />\nG. F. T.<br />\nSiegal, L._ 4 2 10 Fer'ini,f 3 1 7<br />\n0 0 0<br />\nSiverd, f.._ 2 2 6 Kelly,f<br />\nChan'r, c. 3 1 7 Colvin, L 3 3 9<br />\nRasin, g... 3 0 6 Tan'hill, c. 2 0 4<br />\nRey'ds, g. 0 1 1 Carney, g. 5 1 11<br />\nW'd'w, g. 2 0 4 Wayson, g. 2 0 4<br /><br />\n1<br /><br />\nv./.<br />\nT1<br /><br />\nOnly First Place For Blue Jays In Century Swim<br /><br />\nCapturing only one of the eight<br />\nevents, the Johns Hopkins swimmers<br />\nwere handed their second defeat of the<br />\nseason last Saturday, losing to the<br />\nstrong Franklin and Marshall natators, 40-28, at the latter's pool. Although the Jays were only able to secure one first, the meet was closely<br />\ncontested throughout, and it was not<br />\nuntil the last four races that the Garnet representatives asserted their supremacy.<br />\nAgain the Black and Blue did not<br />\npresent a full aggregation, with Capt.<br />\nWoody White and Frank Levi not<br />\ncompeting. It is believed White has<br />\nleft the school, and thus will not be<br />\navailable for the rest of the season.<br />\nLevi, however, expects to swim in all<br />\nfuture encounters.<br />\nHopkins' only winner was Lou Adler, who led home Jones, a team-mate,<br />\nin the 100, triumphing in the time of<br />\n60.4 seconds. Adler also captured second in the 50, to lead the Jay tankmen in scoring with 8 points.<br />\nOutstanding for the F. and M.<br />\nswimmers was Gordon (Slim) Chalmers, Olympic competitor, who is captain and coach of his team. Chalmers<br />\nwas a double winner, obtaining victories in his specialty, the 150-yard<br />\nbreaststroke, and the 220-yard free<br /><br />\nAt a meeting of the Spiked Shoe<br />\nstyle. To prove his versatility, he sucSociety<br />\nlast week in Levering Hall,<br />\nceeded in lowering the pool mark in<br />\nthe latter swim by covering the dis- Leonard Emmert was elected presitance in 2 minutes, 27 seconds. Roe, dent for the year. He succeeds BerF. and M., was second, while Noonan nard Merson. Other officers elected<br />\nof Hopkins finished third. Dan Weiner are Irving Leberfeld, vice-president;<br />\nand John MacGill, both Jay natators, Frank Sarlin, secretary; and Henry<br />\nfollowed Chalmers in the dorsal swim. Severn, treasurer.<br />\nMoving pictures of the cross-counIn addition to his second in the furlong, Roe also won the 440 race to try campaign just completed were<br />\nplay an instrumental part in the Gar- shown by Coach Waldo Hambleton<br />\nnets' victory. Streaking through to during the course of the meeting.<br />\nwin in the excellent time of 5 minutes<br />\nThe new president of the Hopkins<br />\n28.2 seconds, he defeated Bud Adler chapter of the Spiked Shoe is also<br />\nof Hopkins, who just nosed out Foose, captain-elect of the cross-country<br />\nthe other Franklin and Marshall team, a member of the track team,<br />\nswimmer, in final spurt to gain sec- and sergeant-at-arms of the Junior<br />\nond place.<br />\nClass. ,<br />\nThe fancy dive was won by BruLeberfeld and Sarlin are both footbaker, F. and M. ace, who is one of ball and<br />\ntrack men. Severn was manthe best plungers in the East. Bill ager of the<br />\ncross-country team and<br />\nKoenig of Hopkins secured the run- is manager of<br />\nthe track team.<br />\nner-up position, while Bill McConnell,<br />\nMembership to the Spiked Shoe is<br />\nanother wearer of the Black and Blue, restricted to<br />\nthose men who have<br />\nwas third.<br />\nbeen associated with the track or<br />\nThe Jays also captured second and<br />\ncross-country teams for two years<br />\nthird in the 200-yard breaststroke,<br />\nwhich was won by Wetzel, a Garnet and who have demonstrated an active<br />\nswimmer, who last week set a new interest in track.<br />\ncollege record for his event. Hazlett<br />\nof Hopkins swam a strong race to<br />\nfinish second, and was trailed by<br />\nBishop of the Blue Jays.<br /><br />\nFifty Register For<br />\nCounselor Course<br /><br />\nSwordsmen Defeat<br />\nHandball Tournament<br />\nCatholic University<br />\nTo Close February 12<br />\nBlumberg, Burton, Prager And Kos- Jay Fencers, Led By Herman, Reed,<br />\ntant Lead Ladders; ElimiAnd Sherman, Prevail By<br />\nnation Tourney Planned<br />\nMargin Of 6 To 3<br />\nThe fencing team defeated Cath-<br /><br />\nThe handball ladder tournament will<br /><br />\nolic University at Washington , Sat- come to a close on February 21, at 6<br />\nurday by a score of 6 to 3 in what p. m., it was announced by Reuben<br />\nwas claimed to be the first intercol- Baer, director of the tournament.<br />\nlegiate fencing match held in that<br /><br />\nAt this date, the first four names<br /><br />\ncity. Only foils were used.<br />\nSeymour Herman again topped all<br />\nperformers with wins over all three<br />\nof his opponents. His Catholic U. victims were Suite, Goenner, and Rozycki.<br />\nReed beat two opponents and Sherman one to give Hopkins a total of<br />\nsix points. Each of the three Catholic<br />\nU. men won one match.<br />\nNo matches were held in either the<br />\nsaber or the epee.<br /><br />\nin each of the five ladders will be entered in an elimination contest to determine the college champions. The<br />\nfirst three winners will, receive intramural awards. The first eight will<br />\nform a varsity handball team that<br />\nwill have intercollegiate competition.<br />\nUp to last week, the leaders in<br />\neach of the five ladders were Stanley<br />\nBlumberg, J. A. Burton, B. Prager,<br />\nand George Kostant.<br /><br />\nAbout fifty men registered in the<br />\ntraining class for counselors last<br />\nweek in Remsen 101. Because of the<br />\nsize of the class, Reuben Baer, instructor of the group, has decided to<br />\ndivide it into two sections, one to meet<br />\non Wednesday afternoons at 4:15, the<br />\nother to meet one evening a week—<br />\nprobably Wednesday at 7 o'clock.<br />\nThe first regular meeting of the<br />\nsections will be Wednesday, February 13, Mr. Baer announced. He has<br />\ndesigned the class to cover all phases<br />\nof camp duty, including theory as<br />\nwell as actual practice.<br /><br />\nHE HIGH STANDARDS OF<br />\nAPPAREL MAINTAINED AT<br />\nHARVARD ARE A TRIBUTE TO<br />\nTHE GOOD TASTE OF HARVARD<br />\nMEN ... AN EVIDENCE OF THE<br />\nSTYLE-SENSE AND CRAFTSMANSHIP OF CAMBRIDGE TAILORS.<br /><br />\nT<br /><br />\nIt is significant that outstanding<br /><br />\neaty<br />\nfamous tailors of Cambridge, Neu.) Navels<br />\nand New York, say —\"More and more<br />\nmen are demanding the slide-fastened<br />\nfly with its smooth flat effect. As the<br />\nuncovered zipper reveals a strip of<br />\nmetal, I prefer to use Kover-Zip, a<br />\nfinished product that serves its purpose well.\"<br /><br />\n\"Best-dressed\" seniors at leading American colleges, men<br />\nwhose choice of things to wear<br />\nhas a national influence, prefer<br />\nand commend Kover-Zip:<br />\nWARREN GRACE<br />\nBrown, 1935<br />\n\"Kover-Zip merits attention from all styleconscious college<br />\nmen ... it achieved<br />\nperfection in a closure<br />\nby eliminating the exposed strip of metal.\"<br /><br />\nLYLE FISHER<br />\nNorthwestern, 1935<br />\n\"Kover-Zip embodies<br />\nthe best features of<br />\nall other ifypes of fly<br />\nfasteners, and also<br />\npossesses a unique<br />\nfeature, covering the<br />\nugly raw metal.\"<br /><br />\nMI<br /><br />\nMr,<br /><br />\nthe<br />\ntend<br />\nIdris<br />\nwill<br />\nof r<br />\nof t<br />\nJoh]<br />\nFeb<br />\ntori<br />\nden1<br /><br />\nver!<br />\nupo<br />\nher<br />\nin :<br />\nwas<br />\nSch<br />\ntha:<br />\nA<br />\nJen<br />\npre<br />\nDr.<br />\nphi]<br />\nby<br />\nGet<br /><br />\nden<br />\nWa<br />\neco<br /><br />\nViti<br /><br />\nthe<br />\nwil<br />\nWALDES KOH-I-NOOR, INC.<br />\nLONG ISLAND CITY, NEW YORK<br /><br />\ncents.<br /><br />\ntra<br />\npit<br />\nun<br />\ntic<br />\npit<br />\nan<br />\npit<br /><br />\nto<br />\npr(<br />\nI\\Tt<br />\ntn<br />\nNi<br /><br />\nBel<br /><br />\nCO]<br /><br />\nAl<br /><br />\nyou're telling /<br />\nthey satis<br /><br />\nTotals 14 6 341<br /><br />\nNu<br /><br />\ncollege tailors, arbiters of style,<br />\nendorse Kover-Zip as the only<br />\nslide fastener fit for fine clothes.<br /><br />\nAll the large camps are being communicated with and it is expected<br />\nthat a number of those taking the<br />\ncourse will be placed in jobs this summer. To defray the cost of his communications, Mr. Baer has found it<br />\nnecessary to charge each member of<br />\nthe class a small sum not yet determined, but in all probability it will<br />\nbe between twenty-five and fifty<br /><br />\nJ.<br /><br />\nthi<br /><br />\nSt<br />\nna<br />\nin<br />\nle/<br /><br />\nPE<br /><br />\ntic<br /><br />\nlit<br /><br />\nfo<br /><br />\nth<br />\nC!<br /><br />\n1<br /><br />\nr<br /><br />\nTotals 15 5 35<br /><br />\nRifle Club Gains First Win<br /><br />\n•<br /><br />\nIi:<br />\n1,<br /><br />\nThe University Rifle Club won its<br />\nfirst victory of the season over the<br />\nBrooklyn Polytechnic Institute in a<br />\ntelegraphic match held last week, by<br />\na score of 1335 to 1297. Members of<br />\nthe team firing were Caplan, Miller,<br />\nFredericks, Guild, and Collenberg.<br />\nOther matches will take place, according to Phil Guild, manager of<br />\nthe team.<br /><br />\nNews-Letter Elects Six Men<br />\nSix new members were elected to<br />\nthe business staff of,the NEws-Lm ik2{<br />\nat a meeting of the control board last<br />\nTuesday afternoon. The six additions<br />\nto the masthead are Arthur Fink,<br />\nDavid Gordon, Robert Levi, Stanley<br />\nPrager, Nat Soifer, and Robert Watkins.<br />\nC)1935. LIGGETT &amp; MYERS TOBACCO CO.<br /><br />"}], "field_media_file": [{"target_id": 38900, "display": null, "description": null, "target_type": "file", "target_uuid": "8cdf6e00-31c2-45da-8fa3-c335305b037b", "url": "http://digital.library.jhu.edu/system/files/2022-03/12577-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12577, "target_type": "node", "target_uuid": "e9f17488-6ce0-4abb-bf5f-5779dfb58251", "url": "/node/12577"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "e99c13f6-db60-4410-a740-d93032f617f7"}]}