{"mid": [{"value": 36889}], "uuid": [{"value": "d5be464c-2104-4d69-a652-cf512383af47"}], "vid": [{"value": 36889}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:55:36+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13079-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:55:36+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:55:36+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVIII, No. 7<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 26, 1923<br />\n<br />\nGEOLOGY CLASS COMBINES C. & P. ENGINEER TELLS A. I. MAJOR GAREY INSTALLED<br />\nE. E. OF NEW SWITCHAS PRESIDENT OF ST.<br />\nSCIENCE WITH ATHLETICS<br />\nING SYSTEM Trip to Lansdowne Affords Students<br />\nJOHN'S COLLEGE<br />\nBoth Mental and Physical Development<br />\n<br />\nThe course in Geology I is not<br />\nonly of scientific and cultural value, but also of great value for<br />\nPhysical development. This latter fact was very evident last week<br />\nwhen the class took a trip to Lansdowne, a small village outside of<br />\nBaltimore, for the purpose of<br />\nstudying the various geological<br />\nformations. In order to observe<br />\nall the phenomena of a young<br />\nstream it was necessary to clamber through what Dr. Schwartz<br />\ncharacterized as \"a p-erfect reproduction of the Grand Canyon of<br />\nthe Colorado on a smaller scale.\"<br />\nThe entire class came out puffing<br />\nlike veritable steam engines. \"It<br />\nwas also necessary to _run for a<br />\nlong distance back to the railroad<br />\nstation in order to make- the 4:30<br />\ntrain to Baltimore. This unaccustomed exertion caused the weary<br />\nParty to sink gratefully into the<br />\nsoft cushions of the parlor car as<br />\nthe train sped homeward.<br />\nThe trip was of great interest<br />\nto the party, especially in that<br />\nthey were fortunate enough to discover a small deposit of iron ore,<br />\nof a grade known as \"hematite.\"<br />\nand also a bed of lignite, a form<br />\nof coal which has not yet completely hardened. Dr. Schwartz<br />\nwas helped in conducting the<br />\nParty by Dr. Hall, an assistant<br />\ninstructor in Geology.<br />\n<br />\nLiberty Exchange Discussed as Exam- Formally Takes Over Reins of Annapple. Visited by Members of Instiolis Institution. Indicates Marked<br />\ntute on Saturday<br />\nChanges in Policy<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHOPKINS MEETS HAVERFORD TOMORROW<br />\nIN MORNING CONTEST AT HOMEWOOD<br />\nBlack and Blue<br />\n<br />\nDefense Must Watch Wilbur, Quaker<br />\nC. A. Robinson, chief engineer<br />\nDr. Enoch Barton Garey was<br />\nCaptain.<br />\nForenoon Game an Innovation Here. Navy<br />\nof the Chesapeake and Potomac _inaugurated president of St.<br />\nTelephone Company, addressed John's College at Annapolis yesCrowd Expected to Visit Homewood First<br />\nthe members of the Baltimore secterday afternoon. He succeeds<br />\ntion of the American Institute of<br />\nDr. Thomas Fell who retired this<br />\nPROBABLE LINE-LP<br />\nElectrical Engineers on Friday,<br />\nfall<br />\nafter serving St. John's for 37<br />\nOctober 19. He discussed the<br />\nHOPKINS<br />\nHAVERFORD<br />\nmany and varied advantages en- years. The inaugural exercises<br />\nBerndt<br />\nL E<br />\nRhoads<br />\nMagill<br />\nCauffiel<br />\nL T<br />\nsuing from the automatic machine were held in the college gymnaWolbert<br />\nAlbert<br />\nL G<br />\nswitching of telephone equipment. sium at 3 P. M. At 7 P. M. dinDay<br />\nM. Miller<br />\nMr. Robinson was the principal ner was served in the college dinBarton<br />\nR G<br />\nSumwalt<br />\nspeaker at the regular October<br />\nR T<br />\nCarter<br />\nW. Miller<br />\ning hall, which was 'followed at 9<br />\nmeeting of the society, held at the<br />\nRich<br />\nR E<br />\nMontgomery<br />\nP. M. by a reception.<br />\nTaylor<br />\nGarrett<br />\nQ B<br />\nEngineers Club, Redwood street<br />\nBonner<br />\nL<br />\nH<br />\nNolan<br />\nDr.<br />\nGarey,<br />\nin<br />\nhis<br />\ninaugural<br />\nadat Light. The engineer had as his<br />\nR H<br />\nTurnbull<br />\nTomberti<br />\nsubject \"Machine Switching\" and dress, spoke as follows:<br />\nF B<br />\nMaxwell<br />\nWilbur<br />\nThis is one of the oldest instifor purposes of illustration he took<br />\nthe specific case of the Liberty Ex- tutions in the land. It is old-fashThe comparison of each team's<br />\nioned, it is conservative, it has<br />\nchange, of this city.<br />\n0. D. K. TO INVESTIGATE scores and the calibre of the teams<br />\nThe C. & P. engineer humorous- reverence for traditions.<br />\nPUBLICITY BOARD WORK<br />\nthey have played this year gives<br />\nWe feel very much privileged to<br />\nly recounted the fact that patrons<br />\nActivities of Board May Be Extended.<br />\nof the Liberty Exchange who be located in America's foremost Reunion Committee of '23 Plans<br />\nHopkins somewhat of an advanwere enraged at supposedly poor city of colonial architecture—such<br />\nfor St. John's Game<br />\ntage over Haverford College in<br />\nservice and mistakes of the, tele- old and beloved homes as the<br />\nAt a meeting of Omicron Delta their annual tilt at Homewood tophone operators could no longer Chase House, the Brice House and Kappa Honorary Fraternity held morrow morning.<br />\nThe Black and<br />\ngive such free vent of their feel- the Ridout House mean to our<br />\nMonday<br />\nnight<br />\nBlue<br />\na<br />\ncommittee<br />\neleven<br />\nis<br />\nwas<br />\ngenerally<br />\nacknowlings to the poor \"hello girl.\" From students that they are a part of a<br />\nappointed<br />\nto<br />\nsee<br />\nDr.<br />\nVan<br />\nOrman<br />\nedged<br />\nto<br />\nbe<br />\nstronger<br />\ncity<br />\nthan<br />\nusual<br />\nthat<br />\nhas<br />\nhad<br />\ngreat<br />\nmen<br />\nfor<br />\na<br />\nnow on they will have only themlong<br />\ntime.<br />\nThe<br />\nivy<br />\non<br />\nSt.<br />\nin<br />\nyear,<br />\na<br />\nAnne's<br />\nregards .to extending the ac- this<br />\nfact which has been<br />\nselves to blame for wrong numbers as the telephone users on the should influence us to serenity. tivity of the Publicity Board. It proved by the scores' made in the<br />\nLiberty Exchange are now to all Over two hundred years ago our was agreed that, although, the last three weeks. Haverford has<br />\nintents and purposes their own op- institution was founded here, and Board is functioning as well as met a series of reverses this year<br />\ntoday our students commingle<br />\nat the hands of three small colerators.<br />\npossible under its limited allow- leges, their one victory being reIn connection with the regular with th.e descendants of such men<br />\nmonthly meeting, an inspection as 'William Pinkney, Roger ance, there are greater possibili- corded against Temple College.<br />\nBrooke Taney, and Reverdy John- ties in the field than are now beHopkins' close score at Princetrip to the Liberty Exchange was<br />\nson.<br />\nIn<br />\nour<br />\nbeautiful<br />\nState<br />\nton<br />\nand their recent defeats of Mt.<br />\nHouse<br />\ning<br />\nheld the following day, Saturday,<br />\ntaken advantage of.<br />\nBuilding, under the dome of<br />\nSt.<br />\nMary's and Albright were inOctober 20, at 2.30 P. M.<br />\nThe Reunion Committee of the<br />\nE. WILGIS ELECTED PRESIwhich Washington surrendered<br />\ndications<br />\nthat the local machine<br />\nThe members of the section,<br />\nDENT OF RIFLE ASSOhis military commission in 1783, 1923 Class asked the Circle for is a dangerous quantity. In the<br />\nwith their guests, met at Kate and<br />\nCIATION<br />\nsuggestions as to its reunion after game against Albright last week<br />\nLarge Number of Candidates Out for Garrison Avenues and proceeded our students have gone since it<br />\nwas<br />\nbuilt, to hear the questions of the St. Johns' game. The Circle the J. H. U. squad showed that<br />\nTeam. Captain Paul to Succeed<br />\nto the exchange. Here a short exCapt. McMurray as Coach<br />\nstate debated and to receive first suggested a dance to be given by they understand football. The<br />\nAn organization of the Johns planation of the operation of the hand information of<br />\nparliamen- the class in honor of the football line worked well both in defen40pkins Rifle Association was ef- automatic switching machines was tary procedure. A college<br />\ncam- team.<br />\nsive and offensive playing, crushfected last Friday at a meeting in given. The method of installation pus ought to have dignity. It<br />\ning<br />\nthe opponents' defense to<br />\nThe Circle recommended to the<br />\nGilman Hall. About forty men of the new machines, with particu- comes naturally on this campus<br />\nmake<br />\nway for the local backs and<br />\nSenior Class that the 1924 June<br />\nWere present; and from these the lar stress on their electrical con- through the charm of Annapolis<br />\nholding<br />\ntight when Albright had<br />\nWeek Committee begin functionfollowing officers were elected: H. nections and principles, was also in<br />\nthe<br />\nball.<br />\nCoach Van Orman's<br />\ning immediately.<br />\n* * *<br />\nE. Wilgis, president; W.Rowland discussed.<br />\nbackfield<br />\nhas<br />\nreached a high point<br />\nThe Committee on Backward<br />\nMeetings are held monthly by<br />\nVice-president; R. Parks, secreIn thus speaking of the old, I<br />\nas<br />\na<br />\nscoring<br />\nfactor.<br />\nThe Black and<br />\ntary, and T. W. Martin, treasurer. the Baltimore section; usually at am showing my reverence for the Athletes made a report in which Blue mentor has a supply of backThe membership fee in the As- the Engineers Club. Mr, W. B. old. But at the same time, we it said that the grades of all foot- field men that is larger than usual.<br />\nball men are being investigated<br />\nsociation will be one dollar. Am- Kouwenhoven, associate professor know that change is the keynote<br />\nVirtually the same backfield as<br />\nand the men who are standing<br />\nmunition will be supplied to mem- of electrical engineering at Johns of progress. I want to discuss<br />\nlast year has been increased this<br />\nbers at the price it costs the Gov- Hopkins, is chairman of the sec- with you some of :the changes we low are being warned. Investiga- fall by the entrance of half a dozhave made in the policy of this tion of the standing of spring ath- en large, fast players.<br />\nernment, 19 cents for 50 rounds. tion.<br />\nletes will be started in the near<br />\nThe range in the loft of Gilman<br />\ncollege.<br />\nHaverford's team appeared to<br />\nfuture.<br />\nHOISINGTON<br />\nNOW<br />\nMAJOR<br />\nHall is now open, and practice will<br />\nDaily chapel, which has existed<br />\nbe green in those games which it<br />\nEXPECTED IN NObegin shortly. Schedules for the<br />\nthroughout the history of this inhas played this year. Wilbur, the<br />\nVEMBER<br />\nstitution, I have dared to change. PUBLICITY BOARD OUTLINES Quaker captain and fullback, is<br />\nvarious sections are being arrangWORK FOR YEAR<br />\ned by the Military Office in order Major Garey's Successor on Way East. The cause of the change comes as<br />\nprobably the strongest ground<br />\nLeft Philippines on SeptemWork<br />\nAssigned<br />\nto Members. Distribu- gainer on the Pennsylvania squad.<br />\na<br />\nresult<br />\nof<br />\nmy<br />\nto avoid congestion on the range.<br />\nown<br />\nexperience.<br />\nber 24<br />\nGreatThe prospects for a winning<br />\nWord has been received that Every day while I was at college tion of Football News Given<br />\nHis work against Hopkins last<br />\nest Attention<br />\nteam this year are very bright. Major Hoisington, successor to I was required to go to chapel. I<br />\nyear was very creditable and it<br />\nA meeting of the Publicity was he who made the field goal<br />\nOnly one regular was lost by Major E. B. Garey as command- grew heartily sick of it. Being<br />\nBoard was held last week, at which saved his team from being<br />\ngraduation, and besides the veter- ant of the Johns Hopkins R.0. T. just an average American, I rewhich<br />\nthe work for the coming blanked by the J. H. U. machine.<br />\nsented<br />\ngoing<br />\nbecause<br />\nI was made<br />\nans, there is a wealth of new ma- C. unit, left the Philippine<br />\noutlined, and duties as- Wilbur was responsible for the<br />\nwas<br />\nyear<br />\nto<br />\ngo.<br />\nit<br />\nis<br />\neasy for such a daily<br />\nterial. Several crack shots have Islands on September 24. As it is<br />\nits several members. field goal which sent Temple Colsigned<br />\nto<br />\nfunction<br />\nto<br />\nbecome monotonous<br />\nentered with the class of '27. As usually a thirty-day trip, the Maof write-ups will be lege to defeat three weeks ago. It<br />\nTwo<br />\nkinds<br />\nand<br />\nmeaningless. Unless apCaptain McMurray, the former jor was expected to reach Baltivarious newspapers: remains to be seen whether the<br />\nto<br />\nsent<br />\nout<br />\nCoach, is now on duty in Panama, more this week. However, latest proached with reverence it loses<br />\nto certain dailies, Quaker line will afford him<br />\nspecial<br />\nfeatures<br />\nits<br />\ndignity and becomes a sham.<br />\nCaptain Paul will take the respon- reports from the Military Departpublicity, Which enough support against Hopkins<br />\nregular<br />\nand<br />\nthe'<br />\nment state that the new command- We are replacing the daily chapel<br />\nsibility of coaching the team.<br />\ndistributed<br />\nover all East- this year to practice his art of<br />\nbe<br />\nThe schedule this year has not ant is not expected until next with a weekly convocation of such will<br />\nbeen completed as yet, but the cal- month, as his trip across the coun- importance and character as to in- ern cities. Kennedy will handle drop-kicking.<br />\niber of the opposing teams will be try has necessitated stops at vari- spire both Faculty and student the former, Perkins the latter, Playing in the morning is an<br />\nFonda will manage the business innovation at Homewood, so it is<br />\nhigher than ever. Only the best ous military posts. Among other body.<br />\nAgain,<br />\nI<br />\nfind<br />\nend<br />\nof the work, and Shriver will hard to predict how large an aumyself<br />\nin<br />\nconflict<br />\ntrip<br />\nEast<br />\nare<br />\nhigh<br />\npoints<br />\nin<br />\nhis<br />\nteams in the country will shoot<br />\nwith tradition. Should a college have The editor's task. At the dience will be On hand to view<br />\nPresidio,<br />\nCalifornia,<br />\nand<br />\nFort<br />\nthe<br />\nagainst Hopkins this year.<br />\nLeavenworth, Kansas. The whole make its students study at pre- present time the chief item of,in- the game. There will be a great<br />\ndepartment and unit await Major scribed hours? We should not terest is football, but later in the many people in town tomorrow<br />\nNOTICE<br />\nHoisington's arrival with great forget that most of us are in year, when other activities, both to see the Navy-Princeton match<br />\nThere will not be a dance<br />\nexpectation as he has achieved a America because our forefathers athletic and non-athletic, get and the authorities at Hopkins<br />\nafter the Haverford game.<br />\nfine reputation for getting the best were dissatisfied with the artificial started in their work, the Public- are expecting a good portion of<br />\nMeeting of Editorial Staff,<br />\nresults in any group of which he restraints of arbitrary power in ity Board will send out material them to come to Homewood first<br />\nNews-Letter, today 12.20.<br />\nto see the J. H. U. team in action.<br />\ntakes command.<br />\non each.<br />\nContinued on page 4 col. 3<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 26, 1923<br />\n<br />\n2<br />\n<br />\nINTERCOLLEGIATES<br />\nFRESHMEN JOYOUS OVER<br />\nSTUDENT COUNCIL ANThe youngest football captain in<br />\nCI<br />\nEIMMOKEM=ECIEIMMIKEtHECIM<br />\n,NOUNCEMENT<br />\nthe country is probably that of<br />\nFreshmen Will Lift Regulations If They<br />\nFOUNDED 1897.<br />\nCornell, who has just turned 20.<br />\nWin Over Sophs in Baseball and<br />\nFootball<br />\nOn October 20, 500 Syracuse<br />\nBaseball will count! That is<br />\n$2.00 El<br />\nSubscription<br />\nstudents made the trip to New<br />\nthe decision of the Student Council which in a recent meeting cre- York in a special train to see the<br />\nEntered as second-class matter December 3, 1909, at the Postoffice a<br />\nated another opportunity for the contest between the Orange eleven<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nHopkins and Washington Col- freshman class to throw off its and Pittsburgh.<br />\nPublished semi-weekly from October to June by the students of Johns lege were the only Maryland uni- yoke of regulations. Coming at<br />\nCollege papers throughout the<br />\nHopkins University.<br />\nversities to finish last Saturday's this time when the freshman base- country have been commenting on<br />\nBusiness communications should be addressed to the BUSINESS MAN- games in front of their rivals. ball team has already proved it- Professor Van Dyke's new book<br />\nAGER,JOHNS HOPKINS UNIVERSITY; all articles and other communications While Hopkins swamped Al- self superior to the junior and senon Rembrandt.<br />\nJhould be sent to the MANAGING EDITOR.<br />\nbright and Washington drop- ior aggregations, the decision is<br />\nA new magazine at the Univerenough to install hope in every sity of Florida has been<br />\nkicked<br />\na<br />\nvictory<br />\nover<br />\nP.<br />\nM.<br />\nA.,<br />\nHomewood<br />\n100<br />\nnamed the<br />\nTelephone<br />\nMaryland met defeat at the hands member of the Class of '27. Few \"Swamp Angel.\"<br />\nof V. P. I., St..John's succumbed previous freshman clases have had<br />\nHighland College in Kentucky<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nan outlook.<br />\noptimistic<br />\nso<br />\nto<br />\nWashington<br />\nWestern<br />\nand<br />\nLee,<br />\nhad<br />\nthe lowest enrollment of any<br />\nJOSEPH LEOPOLD, '24.<br />\nPHILIP W. HOWARD, '25.<br />\nThe sophomores accept the ac- in the country during<br />\nMaryland hit a .snag in Davis and<br />\n1923-24,<br />\nManaging Editor<br />\nElkins, and Mt. St. Mary's bit the tion of the Student Council light- with a total of 20 students. The<br />\nAdvertising Manager<br />\nWILLIAM G. DEAN, JR., '24.<br />\ndust at Catholic U. None of these ly. They, too, according to re- University of California had the<br />\nFITZGERALD DUNNING, '24.<br />\nAssistant Managing Editor<br />\ncontests had any bearing on the ports, have a team of superior highest with 14,367.<br />\nT. REESE MARSH, '24.<br />\nquality and have no fear of being<br />\nState title.<br />\nCirculation Manager<br />\nSeveral Chinese students at Co* * *<br />\nAssociate Editors<br />\nto relinquish their superi- lumbia have been making theii- exforced<br />\nJOHN C. LEWIS, JR., '24.<br />\nRICHARD C. TILGHMAN,'25.<br />\nIt is interesting to note that of ority over the \"frosh.\"<br />\npenses by teaching Mah Jong, the<br />\nJOHN W. PARSONS, '25.<br />\nAt the same meeting of the Stu- new Chinese game.<br />\n180<br />\nleading college football teams<br />\nAssistant Business Managers<br />\nBENJAMIN T. ROME, '25.<br />\nin 1922, only eight went through dent Council it was announced<br />\nThe freshman class at Princeton<br />\nJunior Editors<br />\nD. MILES. MARRIAN, '25.<br />\nthe season without a defeat and that student activity buttons numbers 631, 67 of whom are the<br />\nV. EDWARD THOMSEN, JR, '26.<br />\nG. DONALD GIESKE, '25.<br />\nARTHUR L. NELSON, '26.<br />\nonly five out of the eight won would be given out next week.<br />\nJOHN T. DIXON,'24.<br />\nsons of Princeton alumni. The ay.-.<br />\nERNEST A. STRATHMAN, '26.<br />\nMCKAY,<br />\n'26.<br />\nA.<br />\nJ.<br />\nevery game. Army played tie<br />\nLEO C. MUTH, '24.<br />\nerage age is 18 years and 5<br />\nALGER G. Hiss, '26<br />\nC. EUGENE TOVELL, '24.<br />\nFOOTBALL GAMES ATTRAC- months.<br />\ngames<br />\nwith<br />\nNotre<br />\nDame<br />\nand<br />\nYale.<br />\nEDWARD 0. MICHEL, '26.<br />\nOM° J. KELLER, III, '25<br />\nVanderbilt and Michigan played a TING MORE ENTHUSIASTS<br />\nCHARLES G. HUTZLER, '24.<br />\nJ. JACKSON KIDD, '26<br />\nOn the Saturdays of the W.and<br />\nTHAN EVER<br />\nscoreless tie. Army, Vanderbilt<br />\nThe football season may be J. and the Pennsylvania football<br />\nand Michigan won all of their<br />\nearly, but the interest in the great games the Lafayette faculty has<br />\nMember Southern Intercollegiate Newspaper Association<br />\nother games. Princeton, Cornell,<br />\ncollege sport has suffered no re- decided to suspend classes in orIowa, California and West Virlapse. Crowds now are turning der to permit the student body to<br />\nginia were victorious in every<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nout for the mid-season games, like make the trip.<br />\ngame.<br />\nAt N. Y. U. a 14-year-old prodthey did only for the big contests<br />\nOf these eight undefeated teams,<br />\nigy<br />\nhas been discovered. The avin the past. Five of the many<br />\nfour have lost games this year.<br />\nBALTIMORE, MD., OCTOBER 26, 1923<br />\nerage<br />\nage of the freshman class,<br />\ngames played last Saturday atNotre Dame broke the winning<br />\nhowever,<br />\nis 19.<br />\ntracted 186,000 persons. The Harstreaks of both Army and PrinceFour<br />\nfreshmen<br />\nat Penn State<br />\nvard-Holy Cross game at Camton. Vanderbilt has lost to both<br />\nhave<br />\nbeen excused from frosh<br />\nbridge led with a total of 50,000,<br />\nTHE MAILBAG<br />\nMichigan and Texas, and Iowa's<br />\nthe Michigan-Ohio State game at rules because they are married.<br />\nMembers of the upper classes will recall arguments that have unbroken string came to an end<br />\nAnn Arbor drew 45,000, Pennsyl- The sixth Intercollegiate Ball<br />\noccurred in past years through the medium of the News-Letter Mail- when Britton kicked a 50-yard vania and Columbia played before wil be held at the Ritz-Carlton on<br />\nbag. They remember how many questions, ranging from religion field goal to win a 9-6 victory for 38,000 on Franklin Field, 28,000 November 29, following the DartIllinois.<br />\nto love, have been discussed and debated in this column.<br />\nsaw Notre Dame play Princeton mouth-Columbia game. Music will<br />\n*<br />\n*<br />\nat Princeton and 25,000 made the be furnished by the famous<br />\nDuring the present collegiate year the Mailbag has been taken<br />\nLast Saturday brought many<br />\ntrip to the Yankee Stadium to see \"Sleepy\" Hall of Yale and his oradvantage of but little. The limited staff of the News-Letter finds it upsets. Although Notre Dame<br />\nPittsburgh and Syracuse. Many chestra.<br />\nimpossible to cover all sides of University life, to bring before the was the favorite over Princeton, it other games also drew attendances<br />\n—Tarquin.<br />\neyes of the students all activities or all ideas of interest. There are was hardly thought that four far .above normal for this tune of<br />\ntouchdowns would be scored by<br />\nBASKETBALL ORGANIZAthe year.—Exchange.<br />\nbound to be omissions. There is no reason, however, foe any person,<br />\nTION MFETING IN DERockne's disciples. Coach Roany group, any idea or theory to be excluded. We are not only will- per's<br />\nCEMBER •<br />\nmen could score only a safe-. DR. CHARLES K. EDMONDS<br />\ning but eager to publish any signed communication from any faculty ty, the result of a blocked kick.<br />\nRobert<br />\nJ.<br />\nAshton, manager of<br />\nVISITS HOPKINS<br />\none<br />\nconany<br />\nthe<br />\nundergraduate<br />\nor<br />\nstudent,<br />\nbasketball<br />\nteam, has announmember, alumnus, graduate<br />\nDr. Charles K. Edmonds, a<br />\nHarvard with its veteran line was<br />\nced<br />\nthat a basketball organization<br />\nnot impressive in its 6 0 victory graduate of Hopkins and for a<br />\nnected in any way with Johns Hopkins.<br />\nover Holy Cross. The score came number of years president of the meeting will be held on December<br />\nThe Mailbag is for your use. We ask that you take advantage<br />\nwhen a Holy Cross back fumbled Canton Christian College in the 3. All candidates for positions on<br />\nof it.<br />\na punt and Harvard recovered. A South of China, paid a visit to the team or for assistant manaforward pass and two line bucks President Goodnow last Tuesday gers are asked to attend.<br />\ntook the ball over. Yale paid a morning. Dr. John C. French, a<br />\nTRACK<br />\nbig price in defeating Bucknell, Hopkins undergraduate at the<br />\nMAJOR GAREY TAKES COMMAND<br />\nRegular<br />\nEdmonds,<br />\nesDr.<br />\ntraining<br />\nsame<br />\ntime<br />\nas<br />\n29-14, when O'Hearn, Eli toe exof the track<br />\nteam for the coming indoor season<br />\nMajor Garey's inauguration as president of St. John's College pert, had his leg broken. He will corted him about the campus.<br />\nDr. Edmonds, who took his A. will begin about the middle of Nomarks the beginning of a new era at the Annapolis institution. Al- be out for the rest of the season<br />\nPh. D. in Phys- vember. Thus far the practice on<br />\nready the former Professor of Military Science at Johns Hopkins has and Dr. Bull, Yale kicking expert, B. in 1897 and<br />\nis spending this week to develop a ics in 1903, is well known for the Tuesdays and Fridays has been<br />\ndecided upon and put into effect some marked changes in policy. He<br />\npunter and drop-kicker to take magnetic survey of China which that of limbering up, taking out<br />\nhas altered St. John's from a military school to an academic institu- O'Hearn's place. Cornell surprised he conducted for the Carnegie In- the kinks caused by lack of<br />\npraction. He has installed the honor system. He has abolished com- the fans when she trimmed Col- stitute.<br />\ntice.<br />\npulsory chapel. He has ruled that a man's scholastic average must gate by a 34=7 score. Gil Dobie<br />\nHowever, the cross country<br />\nNotre<br />\nDame<br />\na<br />\nup<br />\npicked<br />\nfumble<br />\nintercollegiate<br />\nsquad<br />\nin<br />\nis training in earnest. Their<br />\nengage<br />\nmay<br />\nbe<br />\nhe<br />\nto<br />\nchanged<br />\nof<br />\nplay<br />\nbefore<br />\nallowed<br />\nthe<br />\nCornell<br />\n'style<br />\nsatisfactory<br />\nhe<br />\nyards<br />\n70<br />\nbefore<br />\nran<br />\nhe<br />\nand<br />\nwas<br />\nseason<br />\nfrom<br />\noffbegins earlier and almost<br />\nthe<br />\nusual<br />\nline<br />\nand<br />\nbucks<br />\ncompetition. In short, Dr. Garey, or Major Garey, as he will aldowned.<br />\nevery<br />\nstyle<br />\nand<br />\nday<br />\nthey stretch their legs<br />\ntackle<br />\naerial<br />\nplays<br />\nto<br />\nthe<br />\nways be known at Hopkins, is endeavoring to place St. John's among<br />\ndifficult Homewood<br />\nthe<br />\nover<br />\nalmost<br />\nevery<br />\nwas<br />\nthe<br />\ntouchdown<br />\nthe foremost of the smaller institutions of learning in the East.<br />\nthe<br />\nBig<br />\nAll<br />\nof<br />\nThree<br />\nhave<br />\nNavy<br />\nhard<br />\nresult of a forward pass.<br />\ncourse.<br />\nMajor Garey-'s idea .of the object of a college education, although surely hit something when they games tomorrow. The PrincetonThe prospects for both teams<br />\nnot novel, is one seldom expressed. He says that the ideal at which met Penn State. Harry Wilson, Navy game at the Baltimore Sta- this year are excellent, according<br />\ncollege should aim is the turning out of gentlemen, of men endowed a Penn State back, crossed the dium is arousing much interest. to athletic authorities, and it is exwith a certain amount of culture, men who will be able to enjoy the Navy goal line three times and Both teams have been defeated pected that Hopkins will again<br />\neach time Palm kicked goal. this year and a loss to either team turn out a championship track<br />\nfiner things of life. According to the new president of St. John's,<br />\nNavy's score was made by Bal- will spoil the possibility of a suc- team.<br />\nthe value of a college education cannot be reckoned in terms of<br />\nlinger, sub-half, on a field goal. cessful season. Yale encounters<br />\ndollars and cents.<br />\nON SECOND THOUGHT<br />\nPennsylvania beat Columbia 19-7 Brown, whom she trimmed to the<br />\ntune of 20-0 in 1922. Dartmouth<br />\nHumble judges though we are, we believe that Major Garey will and Syracuse beat Pitt 3-0.<br />\nPatient—Doctor, I've known<br />\n* * *<br />\nis sporting a strong eleven as evi- you so long now that it would be<br />\nsucceed in his object and that, in the near future, St. John's will take<br />\nLong runs featured some of the denced by their 24-0 score over an insult for me to pay your bill,<br />\nits place beside leading institutions of the East. The News-Letter<br />\nbig games of last week. Wilson of Boston University and should give so I've arranged a handsome legwishes the college and its new president the best of success.<br />\nPenn State ran back a kick-off 95 the Harvard gridmen another bat- acy for you in my will..<br />\nDoctor—You don't mean it—I<br />\nyards for a touchdown through the tle.<br />\n* * *<br />\nam overwhelmed—By the way,<br />\nwhole Navy team. He also made<br />\nWest Virginia, undefeated in just let me take a look at that preruns of 70 and 35 yards. Smythe<br />\nMeeting of All News-Letter Candidates Monday at 12.20.<br />\n1922, meets Penn State at the Yan- scription again.—Boston Tranand<br />\nof<br />\n75<br />\nmade<br />\nruns<br />\nthe<br />\nArmy<br />\nof<br />\nImportant!<br />\nscript.<br />\n91 yards. Crum of Princeton kee Stadium tomorrow.<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\nGRIDIRON<br />\n<br />\nGOSSIP<br />\n<br />\nV\\<br />\n<br />\nA<br />\n<br />\nV<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 26, 1923<br />\nek-et<br />\n<br />\n.ir<br />\nse)<br />\nCibeXatteri<br />\n`)111%1S H.& OSCAR G•L Nrir<br />\nOWNERS,<br />\nT4,<br />\n4Z)<br />\nt*-1•C'<br />\nAgents for<br />\nJOHN B. STETSON HATS<br />\nand FRATERNITY BANDS<br />\n<br />\nNEW SONGS<br />\nFor Practice at Assembly<br />\nOLD JOHNS HOPKINS<br />\n(Tune: \"Barney Google\")<br />\nVerse:<br />\nWhat is the football team,<br />\nThat leads in every way?<br />\nWhat is the team that's coached<br />\nwell in very kind of play?<br />\nNow there aren't any like them,<br />\nAnd they're on the top to stay.<br />\nSo listen very closely and I'll give<br />\ntheir name away—<br />\nWhy it's—<br />\nChorus:<br />\nOld Johns Hopkins with a damn<br />\ngood football team,<br />\nOld Johns Hopkins, to me it surely seems<br />\nThat when our team lines up for<br />\nplay<br />\nOpponents seem to fade away,<br />\nfrom<br />\nOld Johns Hopkins, with its damn<br />\ngood football team.<br />\nHoo Ray, Hoo Ray,<br />\nGee Hee, Gee Ha,<br />\nHopkins Rah<br />\nTeam, TEAM, T-E-A-M !<br />\n(Rising inflection)<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nWE'RE NEAT, HA! HA!<br />\nFor we're neat, ha, ha! Sweet ha,<br />\nha!<br />\nDainty and gay. .<br />\nHere comes Johns Hopkins the<br />\ngirls they all say,<br />\nHigh rolling laddies as well,<br />\nHere comes Johns Hopkins,<br />\nSay! don't they look swell.<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nENGINEERING INSTRUCTOR MRS. POST, STUDENT AT<br />\nHOPKINS, RECEIVES HONSPENDS TIME BREAKING<br />\nORABLE MENTION IN<br />\nMILK BOTTLES<br />\nSCENARIO CONTEST<br />\nAnyone who wanders into the<br />\nMrs. Ethel McCaw Post, a canMaterials Testing Laboratory in didate for the Bachelor of Science<br />\nMachinery Hall any afternoon is degree at this University, has been<br />\nsurprised to hear the continual given honorable mention in a scenario contest given by the Universmashing of milk bottles. Upon<br />\nsal Pictures. Corporation.<br />\ncloser investigation, one finds not<br />\nThe Universal Pictures Corpoa number of children playing, but<br />\nration a short time ago announced<br />\na grown man dressed in overalls,<br />\na scenario contest, open to stubreaking bottles with a hammer.<br />\ndents of American Universities.<br />\nThis • man is Mr. Frank W. KouA prize of one thousand dollars<br />\nwenhouven, an instructor in Mewas offered to the student subchanical Engineering, who is enmitting the best scenario, and to<br />\ngaged in what is perhaps the most<br />\nthe University in which the stuunique series of tests ever condent was enrolled a like sum was<br />\nducted in the Hopkins laboratory.<br />\noffered.<br />\nMr. Kouwenhouven was engagA student at the University of<br />\ned over a year ago by a promiCalifornia received first prize in<br />\nnent milk bottle manufacturer to<br />\nthe contest. The sum of five hundevise a test for determining the<br />\ndred dollars was paid to each of<br />\nstrength of milk bottle necks. He<br />\ntwo students residing at the Unihas been experimenting with<br />\nversity of Denver and Temple<br />\nthousands of bottles and now has<br />\nUniversity of Philadelphia for the<br />\nseveral barrels full of bits of glass use<br />\nof the plays they had submitto testify to his efforts. The main<br />\nted.<br />\ntests conducted by Mr. Kouwenhouven consist of driving a wedge BARNSTORMERS' TRYOUTS<br />\nTO BE HELD SOON<br />\ninto the mouth of a bottle or of<br />\nThe try-outs for the Barnstormcrushing the neck by a contracting ring. One great difficulty ex- ers' forthcoming musical producperienced in these tests has been tion will be held in a short time,<br />\nthe lack of uniformity even in bot- it was announced Tuesday. The<br />\ntry-outs will take the form of vautles of the same batch.<br />\nThe results arrived at by Mr. deville acts. Art and business<br />\nKouwenhouven have met with staffs, members and candidates,<br />\ngeneral commendation in the bot- will be started to work in the near<br />\ntle industry. In fact, during the future.<br />\nThe production is rounding into<br />\nPast summer, he was, engaged by<br />\nshape,<br />\naccording to the managethe Borden Milk Company of<br />\nment.<br />\nThe books and lyrics will<br />\nNew York to act in an advisory<br />\nsoon<br />\nhave<br />\ntheir finishing touches<br />\ncapacity in their bottle factories.<br />\nadded, and then will be ready for<br />\nrehearsals. The music is likewise<br />\nDR. LATANE TO ADDRESS<br />\nnearly completed.<br />\nFIELD CLUB<br />\nThe first Field Night of the DR. LOVEJOY ADDRESSES<br />\nENGINEERS' CLUB<br />\nseason will be held at the Club<br />\nDr.<br />\nArthur<br />\n0. Lovejoy, ProfesHouse on Saturday evening, Deof<br />\nsor<br />\nPhilosophy,<br />\naddressed the<br />\ncember 27, at 8:30.<br />\nEngineers<br />\nWednesday<br />\nClub<br />\non<br />\non<br />\nDean Latane has consented to<br />\nthe<br />\nsubject<br />\nof<br />\n\"The<br />\nLeague<br />\nof<br />\nNatalk to the Club on \"The Corfu<br />\ntions.\" Professor Lovejoy was seIncident and the League of Nacured<br />\nthrough the courtesy of the<br />\ntions.\" At the present time, Dr.<br />\nLeague of Nations Non-Partisan<br />\nLatane is in great demand by a<br />\nAssociation. A large sized crowd,<br />\nnumber of local organizations for<br />\nincluding<br />\nmany prominent Baltiaddresses, especially on the Corfu<br />\nmore<br />\nbusiness<br />\nmen, were on hand.<br />\nincident.<br />\n<br />\nHOO-WAH-HOO FQR J. H. U.<br />\nTune: \"Hinky, Dinky, Parley<br />\nVoo.\")<br />\nFIGHT FOR JOHNNY<br />\nWe'll tell the world we've got a<br />\ngood line. Hoo-wha-hoo.<br />\nHOPKINS<br />\nWe'll 'tell the world we have a (Tune:\"Our Director,\"<br />\nby Sousa)<br />\ngood line. Hoo-wah-hoo.<br />\nFight for Johnny Hopkins,<br />\nWe'll tell the world we've got a<br />\nFight for J. H. U.,<br />\ngood line<br />\nThen we will conquer<br />\nAnd the whole damn backfield's<br />\nAnd raise the Black and Blue, rah,<br />\njust as fine,<br />\nrah!<br />\nHoo-wah-hoo for J. H. U.<br />\nRah, rah, rah, rah, rah, rah, rah!<br />\nFight for dear old Hopkins,<br />\nWhen our team comes out it fights<br />\nFight for Black and Blue;<br />\nto win. Hoo-wha-hoo.<br />\nWe'll always cheer our Alma<br />\nWhen our team comes out it fights<br />\nMater,<br />\nto win. Hoo-wha-hoo.<br />\nAnd fight for J. H. V.<br />\nWhen our team comes out it fights<br />\nBring this News-Letter to next<br />\nto win.<br />\nAssembly.<br />\nAnd win it does 'mid an awful din.<br />\nHoo-wah-hoo for J. H. U.<br />\nSt. John's has a team we're going<br />\nta trim. Hoo-wha-hoo.<br />\n•St. John's has a team we're going<br />\nto trim. Hoo-wha-hoo.<br />\nSt. John's has a team we're going<br />\nto trim.<br />\nAnd over their body we'll sing a<br />\nhymn.<br />\nHoo-wah-hoo for J. H. U.<br />\n*<br />\n<br />\n* *<br />\n<br />\nST.'JOHN'S, GOOD DAY<br />\nSt. John's, good day.<br />\nSt. John's, they say,<br />\nThat you can play right well.<br />\nBut if you come out alive,<br />\nThank the gods you stirvive,<br />\nFor old Hopkins will give you<br />\nBell! Hell! Hell! Hell!<br />\n<br />\n3<br />\n<br />\nSTETSOIN0cP<br />\n-<br />\n<br />\nBats<br />\nStyle and .Quality are the two essentials of<br />\na good hat, but it does not pay to buy one<br />\nwithout the other. All Stetsons have both.<br />\nSTYLED FOR. YOUNG MEN.<br />\n<br />\nThe Johns Hopkins University<br />\nFORTY-EIGHTH YEAR OF INSTRUCTION 1923-1924<br />\n<br />\nINSTRUCTION<br />\nGRADUATE SCHOOL OF ARTS AND SCIENCES.<br />\nArts; Doctor of Philosophy.<br />\n<br />\nDegrees: Master of<br />\n<br />\nMEDICAL SCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nCOLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nSCHOOL<br />\nOF<br />\nENGINEERING. Degrees: Doctor of Engineering; Master of Engineering; Bachelor of Engineering; Bachelor of Science in<br />\nChemistry.<br />\nSCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Public Health; Doctor of Science and Bachelor of Science in Hygiene; Certificate in Public Health.<br />\nSCHOOL OF BUSINESS ECONOMICS.<br />\n<br />\nDamon—<br />\n\"What did Professor Smith mean<br />\nthis morning when he told you<br />\nthat no man could ever make a<br />\nsilk purse out of a sow's ear?\"<br />\n<br />\nPythias—<br />\n<br />\nBachelor's Degree.<br />\n<br />\nCOLLEGE COURSES FOR TEACHERS. Degree: Bachelor of Science.<br />\nSUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of<br />\nArts or of Science.<br />\nCOURSES IN SOCIAL ECONOMICS.<br />\nEVENING COURSES in Business Economics and for Technical Workers.<br />\n<br />\n\"He meant that I'd never be able<br />\nto do good work with a poor pencil.<br />\nGuess I'll have to get a Dixon's<br />\nEldorado. Old Smity says it's the<br />\nbest drawing pencil made.\"<br />\n<br />\nvi paws 0<br />\nELDORAD<br />\n<br />\nJOHNS HOPKINS PRESS PUBLICAL ONS.<br />\n<br />\n\"The7nastiv•dratthrgpencir<br />\n17 leads—all dealers<br />\n11M1111111.111111•11111111111111<br />\n<br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br />\n<br />\nHOCHSCHILD.KOHN &a CO.<br />\n<br />\nBUILDINGS<br />\nGILMAN HALL—General library, class rooms, biology, administration.<br />\nMECHANICAL AND ELECTRICAL ENGINEERING—Housing also Physics<br />\nand College Chemistry.<br />\nC_VIL ENGINEERING—Housing also Geology.<br />\nPOWER HOUSE.<br />\nBOTANY AND PLANT PHYSIOLOGY—With Greenhouses and Botanical<br />\nGarden.<br />\nCHEMICAL LABORATORY—For graduate work.<br />\nPHYSIOLOGICAL BUILDING.<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL :IANK,<br />\n<br />\nXL<br />\n<br />\nrCorner C-<br />\n<br />\nyelie<br />\n<br />\nand Sulaw 815.<br />\n<br />\n-Where Wholesale and Retail Districts Meet-<br />\n<br />\nANATOMICAL LABORATORY.<br />\nHUNTERIAN LABORATORIES.<br />\nPATHOLOG _CAL LABORATORY.<br />\nSCHOOL OF HYGIENE.<br />\nCARROLL MANSION—Johns Hopkins Club.<br />\nSTUDENT ACTIVITIES BUILDING.<br />\nALUMNI MEMORIAL DORM•_TORY.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 26, 1923<br />\n<br />\n4<br />\n<br />\nSHIRT MAKER<br />\nBOK PEACE AWARD COMPE226 N. Liberty St.<br />\nTITION CLOSES NOV. 15<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\nAT MIDNIGHT<br />\n$3.25 and $4.25<br />\nNegligee.<br />\n$5.25 and $6.25 Popular Referendum Will Show FeelImported Madras<br />\ning of Nation. Public Opinion in<br />\nTerms Cash, Less 10% 30 Days on Shirts.<br />\nFavor of Movement<br />\nAlso a Full Line of Men's<br />\nFurnishings.<br />\nAfter being before the public<br />\n<br />\nSTRATTON<br />\n<br />\nMAJOR GAREY INSTALLED AS preciative power; to have both<br />\nDORMITORY<br />\n•<br />\n. PRESIDENT OF ST. JOHN'S<br />\nPlans for the general get-toteacher and student teeI comCOLLEGE<br />\nradeship in the enterprise of un- gether of the Dorm-men on FriContinued from page 1<br />\n<br />\nday night are rapidly reaching<br />\nEurope. Naturally, this old insti- derstanding human experience.<br />\ncompletion. Mount, who has<br />\n*<br />\n•<br />\n*<br />\ntution is very much concerned<br />\ncharge<br />\nof the program, reports<br />\nWhat moderate resources we<br />\nwith the good habits and proper<br />\nmany<br />\nthat<br />\nmen are signing up for<br />\ndecorum of its students, but we possess we are not expending just<br />\nindividual<br />\nstunts. A solo dance<br />\nfor over three months the compe- are equally concerned with their now in constructing buildings.<br />\nby—name<br />\nwithheld because of artNECKWEAR tition for the American Peace development in personal responsi- We are using our means to engage<br />\n• SHIRTS<br />\nist's modesty—several musical<br />\nhighest<br />\ngrade<br />\nFaculty<br />\nthe<br />\nfor<br />\nour<br />\nIn<br />\na<br />\nword,<br />\nwe<br />\nbility.<br />\n*<br />\n*<br />\n*<br />\nAward, created by Edward W.<br />\nendeavor- of men that we can find to in- bits, a short humorous talk, and<br />\nBok, will close at midnight, No- of this Faculty are not<br />\ning to apply the rules of a kin- struct our students, not only in one or more stunts of acrobatic<br />\n421 N. HOWARD ST.<br />\nvember 15th. Powerful public<br />\ndergarten in the administration of classes and laboratories, but in turns will constitute the evening's<br />\nGLOVES sentiment is backing the moveHOSIERY<br />\nthe students' private affairs, but their rooms and in our homes. In program.<br />\nment and from the interest evi- we are endeavoring to find the se- a college as elsewhere, the man's<br />\nHONOR SYSTEM INAUGUdenced by inquiries, editorials, crets of right living and the great the thing.<br />\nRATED AT PRINCETON<br />\n* * *<br />\nspeakers and Articles an over- principles of human conduct, and<br />\nEvery examinee now is required<br />\nwhelming majority of people in to give life to them on this camTo Dr. Thomas Fell, my distin- to sign pledge: \"On my honor as<br />\nthe United States favor it.<br />\nguished predecessor who has a gentleman that during this expus.<br />\nColleges, universities and smallSome years ago, the experiment given so many years of his life to amination I have neither given<br />\ner institutions have shown great was tried of making this institu- faithful and useful service to the nor received<br />\nassistance\" is the<br />\ninterest and in many cases stu- tion a military college. It was not college, to the people of Annap- pledge<br />\nsigned by all students of<br />\n—<br />\ndents and faculty are preparing altogether successful, for the sim- olis who are taking such a deep Princeton<br />\nUniversity after they<br />\nLimited<br />\nto vote for the winning plan for ple reason that unless designed interest in our plans, to the for- have<br />\nwritten an examination. For<br />\n\"international co-operation look- for a special purpose, such as the mer members of our Board of Vissome time the Honor System as<br />\nBARN CAFETERIA ing toward the prevention of Naval Academy or West Point, or itors and Governors for their this is called has been proposed<br />\nat<br />\nwar.\"<br />\ninfluenced by tradition or commu- years of service to the college, to Princeton and now<br />\nthe constituPlans for the ,awarding by the nity pride, a military college is an our Governor for his interest in<br />\ntion of the system is complete. .<br />\nORDERS RECEIVED FOR<br />\nJury of Award and the \"popular un-American institution<br />\nand, our progress, to our alumni• for<br />\nViolation of the Honor System<br />\nreferendum\" are announced in a while we hold that it is the duty their sacrifices, and to the people<br />\nCOGGINS'<br />\nconsists of any attempt to receive<br />\nrecent publication by the Policy of every institution and good citi- of Maryland for their awakened<br />\nTransfer & Baggage Express<br />\nassistance whether the person givCommittee.<br />\nzen to play a constructive part in support, may I express my appreAUTOMOBILE SERVICE<br />\n\"As soon as the Jury of Award the national defense, we find that ciation. Should there be some- ing the assistance, has completed<br />\nPHONE, HOMEWOOD 6886<br />\nhas made its selection, the plan in applying all the rigid and mon- thing in the history and traditions his paper or not. The rule is in<br />\nchosen will be at once submitted otonous rules of military disci- of this venerable institution that force during the whole period of<br />\nThe Flag, Banner & Pennant Shop to the people of the country pline to the average college boy, touches your heart, should our as- examination, both within and<br />\nthrough this informal referendum much of his originality, person- pirations for broader usefulness without the examination room.<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands, conducted through the daily and<br />\nality and spirit of aggressiveness commend themselves to you, may Persons obtaining beforehand,<br />\nEmblems, Silk Banners for Schools,<br />\nweekly press, so far as their co- is destroyed.<br />\nwe have your good wishes and any information as to the nature<br />\nSocieties and Fraternities<br />\n*•<br />\n*<br />\n*<br />\n302 PARK AVE., BALTIMORE, MD. operation is available; through<br />\nGod speed in the consummation of of the questions contained in the<br />\nR. H. Taylor<br />\nVernon 2355<br />\nexamination paper shall be reReplacing<br />\na<br />\nbook<br />\nof<br />\nmany rules, our plans?<br />\nthese 81 national organizations,<br />\ngarded<br />\nas having violated the<br />\nand through a large number of lo- characteristic of our temporary<br />\nMr. Noble, chairman of our<br />\ncode.<br />\n—The McGill Daily.<br />\ncal and state organizations which, military regime, we have dared to Board of Visitors and<br />\nGovernors,<br />\nwhile not always formally con- have only two rules for the guidI accept the commission which<br />\nnected with the national organiza- ance of our student body, first, the you tendered me. Aware of my<br />\n20% DISCOUNT<br />\ntions forming the council, are in- rule Of honor; second, the rule of<br />\nfulfilling<br />\nUnworthiness<br />\nin<br />\nthe<br />\nduTO ALL HOPKINS MEN<br />\nterested in the award and desire hard work. Because we, too, of<br />\nties<br />\nof<br />\nmy<br />\noffice,<br />\nbut<br />\nasking<br />\nfor<br />\nMEN'S SHOES<br />\nto take a referendum of their the Faculty are human, we forgive<br />\nin advance the minor frailties of Divine guidance and the help of<br />\nmembers.<br />\nOf the Better Class<br />\nmy fellow citizens, I have started<br />\n\"Very definite plans for the the, students. Being treated as my work with the determination<br />\nmethod of taking the referendum men and gentlemen, our students to make this institution a continURNER BROTHERS<br />\nof<br />\ntheir members have been laid have been quick to sense our at- ued vital factor in the further EVERYTHING IN SPORT<br />\nI I I E. BALTIMORE STREET<br />\nSUPPLIES<br />\nBaltimore<br />\nby most of the organizations, and titude towards them and to re- progress 'of our state and coun221<br />\nWest<br />\nBaltimore<br />\nStreet<br />\nthe meeting of this week was for spond worthily.<br />\ntry.<br />\nNear Howard<br />\nThis institution wants to win<br />\nthe purpose of comparing notes<br />\namong the representatives of the games, too, but we want to win<br />\n1873<br />\nEstablished<br />\norganizations and determining fin- by fair play, and we want furtherally the exact method by which more to evolve a plan wherein<br />\nA. H. FETTING MAN'FG<br />\nJEWELRY CO.<br />\neach organization could best and every student will have an active<br />\nTailors<br />\nManufacturers<br />\nmost promptly reach its complete place in some form of athletics.<br />\nUniforms<br />\nand Liveries<br />\nGreek Letter Fraternity Jewelry<br />\nWe are going to remain a small<br />\nmembership with the winning<br />\nST.,<br />\nBaltimore,<br />\nMd.<br />\nLIBERTY<br />\n213 N.<br />\n128 W. Fayette St., Near Liberty St.<br />\ncollege. We are going to continue<br />\nplan.<br />\nBaltimore, Md.<br />\nbe<br />\na<br />\nsmall<br />\ncommunity<br />\nwhere<br />\n\"The aim of the committee in<br />\nIECIEJEEILIFAIELIIILIIECIEEIDEOKTItEXACIE1<br />\nevery<br />\none<br />\nknows<br />\nevery<br />\none.<br />\nI<br />\ncharge of the award is to give<br />\nevery interested man and woman want my sons to go to that instiin the country an opportunity to tution where the human element<br />\nparticipate in this referendum. It is considered of fundamental imand individuality is offered here at prices that are not<br />\nis the first 'opportunity that the portance, and there is a friendly,<br />\nand cannot be underquoted by any house at any time.<br />\nindividual in this country has had interested relationship between<br />\nBesides the reputation of an old-established firm<br />\n41<br />\nto make effective his opinion as teacher and student.<br />\nof each sale with a guarantee.<br />\nback<br />\nis<br />\n***<br />\n\"The King of Lubricants\" to what part the United. States We have already in Maryland<br />\nshould play in a plan for internainstitutions which serve special<br />\ntional co-operation looking toSHERWOOD BROTHERS, INC.<br />\nneeds. At the Johns Hopkins Uni- FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nward the prei7ention of war.<br />\nversity, the University of MaryElEtigigKrgg./ILIERITEtEtriCEMKI0figNAREICIE1<br />\n343 NORTH CHARLES STREET<br />\n\"Oi-g-anizations whose memberland, and other splendid Maryland<br />\nship totals between forty and fifty<br />\ninstitutions there are departmillion people have already defments with which St. John's would<br />\ninitely agreed to participate in the<br />\nbe presumptuous indeed to comreferendum.\"<br />\npete. We are not, and shall not<br />\nbe, a professional school. Yet, as<br />\nMANDOLIN<br />\nCLUB HOLDS I ponder over the opportunities<br />\nAt the Washington Monument<br />\nFIRST REHEARSAL<br />\nthat lie before us, I find myself<br />\nThe Mandolin Club held its first coming again and again to the<br />\nOscar Thomas Olson, D.D.<br />\nregular meeting of the year Mon- conclusion that there still reMinister<br />\nday, October 22, in the Barn. mains for us another great field<br />\nAbout 25 men were present and —the field of liberal culture. I<br />\nHopkins Students Are Invited to<br />\nMr. McCauley, last year's able di- have.a deep conviction that there<br />\nMake This Their Church Home<br />\nrector, who has been engaged are thousands of youths in the<br />\nagain for this year, says that the land who crave a liberal culture,<br />\nThe purpose and program of this<br />\nmaterial is good. He hopes to put in order that their lives shall be<br />\nChurch will appeal to you. Look in<br />\na great deal more music of the richer in the living. To those who<br />\non the Sunday afternoon -At Hoirieclassical type in the programs for seek us out, we will give it. Our<br />\nfrom five to seven.<br />\nPrinters o<br />\nthis year and to have a generally effort will be to awaken our stuSunday morning worship at 11 o'clock.<br />\nmuch higher kind of performance. dents to the questions common to<br />\nThe johns Hopkins<br />\n-ill<br />\nmen—the<br />\nprobintelligent<br />\nFuture rehearsals of the ManSunday evening service at 8 o'clock.<br />\nNEWS-LETTER<br />\ndolin Club will be held Monday at lems of science, of history, of<br />\nMusic by vested chorus—choir of soloists.<br />\n8 P. M. at the Barn; Glee Club philosophy, of literature; then to<br />\nrehearsals will be held on Thurs- develop an orderly habit of mind,<br />\nALL SEATS FREE<br />\n\"At the heart of the City\"<br />\nan open-minded, analytical, apLOMBARD and SOUTH STREETS day at 7.30 P. M.<br />\n<br />\nLeFranc & Ault<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\n<br />\nURNER'S<br />\n<br />\nCUT - RATE<br />\nSPORT SHOP<br />\n<br />\nA. JACOBS 8z SONS<br />\n<br />\n5311:<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\n'2 ©EEO<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\n<br />\nT3414<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVIII, No. 7<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 26, 1923<br /><br />\nGEOLOGY CLASS COMBINES C. &amp; P. ENGINEER TELLS A. I. MAJOR GAREY INSTALLED<br />\nE. E. OF NEW SWITCHAS PRESIDENT OF ST.<br />\nSCIENCE WITH ATHLETICS<br />\nING SYSTEM Trip to Lansdowne Affords Students<br />\nJOHN'S COLLEGE<br />\nBoth Mental and Physical Development<br /><br />\nThe course in Geology I is not<br />\nonly of scientific and cultural value, but also of great value for<br />\nPhysical development. This latter fact was very evident last week<br />\nwhen the class took a trip to Lansdowne, a small village outside of<br />\nBaltimore, for the purpose of<br />\nstudying the various geological<br />\nformations. In order to observe<br />\nall the phenomena of a young<br />\nstream it was necessary to clamber through what Dr. Schwartz<br />\ncharacterized as \"a p-erfect reproduction of the Grand Canyon of<br />\nthe Colorado on a smaller scale.\"<br />\nThe entire class came out puffing<br />\nlike veritable steam engines. \"It<br />\nwas also necessary to _run for a<br />\nlong distance back to the railroad<br />\nstation in order to make- the 4:30<br />\ntrain to Baltimore. This unaccustomed exertion caused the weary<br />\nParty to sink gratefully into the<br />\nsoft cushions of the parlor car as<br />\nthe train sped homeward.<br />\nThe trip was of great interest<br />\nto the party, especially in that<br />\nthey were fortunate enough to discover a small deposit of iron ore,<br />\nof a grade known as \"hematite.\"<br />\nand also a bed of lignite, a form<br />\nof coal which has not yet completely hardened. Dr. Schwartz<br />\nwas helped in conducting the<br />\nParty by Dr. Hall, an assistant<br />\ninstructor in Geology.<br /><br />\nLiberty Exchange Discussed as Exam- Formally Takes Over Reins of Annapple. Visited by Members of Instiolis Institution. Indicates Marked<br />\ntute on Saturday<br />\nChanges in Policy<br /><br />\nPRICE 5 CENTS<br /><br />\nHOPKINS MEETS HAVERFORD TOMORROW<br />\nIN MORNING CONTEST AT HOMEWOOD<br />\nBlack and Blue<br /><br />\nDefense Must Watch Wilbur, Quaker<br />\nC. A. Robinson, chief engineer<br />\nDr. Enoch Barton Garey was<br />\nCaptain.<br />\nForenoon Game an Innovation Here. Navy<br />\nof the Chesapeake and Potomac _inaugurated president of St.<br />\nTelephone Company, addressed John's College at Annapolis yesCrowd Expected to Visit Homewood First<br />\nthe members of the Baltimore secterday afternoon. He succeeds<br />\ntion of the American Institute of<br />\nDr. Thomas Fell who retired this<br />\nPROBABLE LINE-LP<br />\nElectrical Engineers on Friday,<br />\nfall<br />\nafter serving St. John's for 37<br />\nOctober 19. He discussed the<br />\nHOPKINS<br />\nHAVERFORD<br />\nmany and varied advantages en- years. The inaugural exercises<br />\nBerndt<br />\nL E<br />\nRhoads<br />\nMagill<br />\nCauffiel<br />\nL T<br />\nsuing from the automatic machine were held in the college gymnaWolbert<br />\nAlbert<br />\nL G<br />\nswitching of telephone equipment. sium at 3 P. M. At 7 P. M. dinDay<br />\nM. Miller<br />\nMr. Robinson was the principal ner was served in the college dinBarton<br />\nR G<br />\nSumwalt<br />\nspeaker at the regular October<br />\nR T<br />\nCarter<br />\nW. Miller<br />\ning hall, which was 'followed at 9<br />\nmeeting of the society, held at the<br />\nRich<br />\nR E<br />\nMontgomery<br />\nP. M. by a reception.<br />\nTaylor<br />\nGarrett<br />\nQ B<br />\nEngineers Club, Redwood street<br />\nBonner<br />\nL<br />\nH<br />\nNolan<br />\nDr.<br />\nGarey,<br />\nin<br />\nhis<br />\ninaugural<br />\nadat Light. The engineer had as his<br />\nR H<br />\nTurnbull<br />\nTomberti<br />\nsubject \"Machine Switching\" and dress, spoke as follows:<br />\nF B<br />\nMaxwell<br />\nWilbur<br />\nThis is one of the oldest instifor purposes of illustration he took<br />\nthe specific case of the Liberty Ex- tutions in the land. It is old-fashThe comparison of each team's<br />\nioned, it is conservative, it has<br />\nchange, of this city.<br />\n0. D. K. TO INVESTIGATE scores and the calibre of the teams<br />\nThe C. &amp; P. engineer humorous- reverence for traditions.<br />\nPUBLICITY BOARD WORK<br />\nthey have played this year gives<br />\nWe feel very much privileged to<br />\nly recounted the fact that patrons<br />\nActivities of Board May Be Extended.<br />\nof the Liberty Exchange who be located in America's foremost Reunion Committee of '23 Plans<br />\nHopkins somewhat of an advanwere enraged at supposedly poor city of colonial architecture—such<br />\nfor St. John's Game<br />\ntage over Haverford College in<br />\nservice and mistakes of the, tele- old and beloved homes as the<br />\nAt a meeting of Omicron Delta their annual tilt at Homewood tophone operators could no longer Chase House, the Brice House and Kappa Honorary Fraternity held morrow morning.<br />\nThe Black and<br />\ngive such free vent of their feel- the Ridout House mean to our<br />\nMonday<br />\nnight<br />\nBlue<br />\na<br />\ncommittee<br />\neleven<br />\nis<br />\nwas<br />\ngenerally<br />\nacknowlings to the poor \"hello girl.\" From students that they are a part of a<br />\nappointed<br />\nto<br />\nsee<br />\nDr.<br />\nVan<br />\nOrman<br />\nedged<br />\nto<br />\nbe<br />\nstronger<br />\ncity<br />\nthan<br />\nusual<br />\nthat<br />\nhas<br />\nhad<br />\ngreat<br />\nmen<br />\nfor<br />\na<br />\nnow on they will have only themlong<br />\ntime.<br />\nThe<br />\nivy<br />\non<br />\nSt.<br />\nin<br />\nyear,<br />\na<br />\nAnne's<br />\nregards .to extending the ac- this<br />\nfact which has been<br />\nselves to blame for wrong numbers as the telephone users on the should influence us to serenity. tivity of the Publicity Board. It proved by the scores' made in the<br />\nLiberty Exchange are now to all Over two hundred years ago our was agreed that, although, the last three weeks. Haverford has<br />\nintents and purposes their own op- institution was founded here, and Board is functioning as well as met a series of reverses this year<br />\ntoday our students commingle<br />\nat the hands of three small colerators.<br />\npossible under its limited allow- leges, their one victory being reIn connection with the regular with th.e descendants of such men<br />\nmonthly meeting, an inspection as 'William Pinkney, Roger ance, there are greater possibili- corded against Temple College.<br />\nBrooke Taney, and Reverdy John- ties in the field than are now beHopkins' close score at Princetrip to the Liberty Exchange was<br />\nson.<br />\nIn<br />\nour<br />\nbeautiful<br />\nState<br />\nton<br />\nand their recent defeats of Mt.<br />\nHouse<br />\ning<br />\nheld the following day, Saturday,<br />\ntaken advantage of.<br />\nBuilding, under the dome of<br />\nSt.<br />\nMary's and Albright were inOctober 20, at 2.30 P. M.<br />\nThe Reunion Committee of the<br />\nE. WILGIS ELECTED PRESIwhich Washington surrendered<br />\ndications<br />\nthat the local machine<br />\nThe members of the section,<br />\nDENT OF RIFLE ASSOhis military commission in 1783, 1923 Class asked the Circle for is a dangerous quantity. In the<br />\nwith their guests, met at Kate and<br />\nCIATION<br />\nsuggestions as to its reunion after game against Albright last week<br />\nLarge Number of Candidates Out for Garrison Avenues and proceeded our students have gone since it<br />\nwas<br />\nbuilt, to hear the questions of the St. Johns' game. The Circle the J. H. U. squad showed that<br />\nTeam. Captain Paul to Succeed<br />\nto the exchange. Here a short exCapt. McMurray as Coach<br />\nstate debated and to receive first suggested a dance to be given by they understand football. The<br />\nAn organization of the Johns planation of the operation of the hand information of<br />\nparliamen- the class in honor of the football line worked well both in defen40pkins Rifle Association was ef- automatic switching machines was tary procedure. A college<br />\ncam- team.<br />\nsive and offensive playing, crushfected last Friday at a meeting in given. The method of installation pus ought to have dignity. It<br />\ning<br />\nthe opponents' defense to<br />\nThe Circle recommended to the<br />\nGilman Hall. About forty men of the new machines, with particu- comes naturally on this campus<br />\nmake<br />\nway for the local backs and<br />\nSenior Class that the 1924 June<br />\nWere present; and from these the lar stress on their electrical con- through the charm of Annapolis<br />\nholding<br />\ntight when Albright had<br />\nWeek Committee begin functionfollowing officers were elected: H. nections and principles, was also in<br />\nthe<br />\nball.<br />\nCoach Van Orman's<br />\ning immediately.<br />\n* * *<br />\nE. Wilgis, president; W.Rowland discussed.<br />\nbackfield<br />\nhas<br />\nreached a high point<br />\nThe Committee on Backward<br />\nMeetings are held monthly by<br />\nVice-president; R. Parks, secreIn thus speaking of the old, I<br />\nas<br />\na<br />\nscoring<br />\nfactor.<br />\nThe Black and<br />\ntary, and T. W. Martin, treasurer. the Baltimore section; usually at am showing my reverence for the Athletes made a report in which Blue mentor has a supply of backThe membership fee in the As- the Engineers Club. Mr, W. B. old. But at the same time, we it said that the grades of all foot- field men that is larger than usual.<br />\nball men are being investigated<br />\nsociation will be one dollar. Am- Kouwenhoven, associate professor know that change is the keynote<br />\nVirtually the same backfield as<br />\nand the men who are standing<br />\nmunition will be supplied to mem- of electrical engineering at Johns of progress. I want to discuss<br />\nlast year has been increased this<br />\nbers at the price it costs the Gov- Hopkins, is chairman of the sec- with you some of :the changes we low are being warned. Investiga- fall by the entrance of half a dozhave made in the policy of this tion of the standing of spring ath- en large, fast players.<br />\nernment, 19 cents for 50 rounds. tion.<br />\nletes will be started in the near<br />\nThe range in the loft of Gilman<br />\ncollege.<br />\nHaverford's team appeared to<br />\nfuture.<br />\nHOISINGTON<br />\nNOW<br />\nMAJOR<br />\nHall is now open, and practice will<br />\nDaily chapel, which has existed<br />\nbe green in those games which it<br />\nEXPECTED IN NObegin shortly. Schedules for the<br />\nthroughout the history of this inhas played this year. Wilbur, the<br />\nVEMBER<br />\nstitution, I have dared to change. PUBLICITY BOARD OUTLINES Quaker captain and fullback, is<br />\nvarious sections are being arrangWORK FOR YEAR<br />\ned by the Military Office in order Major Garey's Successor on Way East. The cause of the change comes as<br />\nprobably the strongest ground<br />\nLeft Philippines on SeptemWork<br />\nAssigned<br />\nto Members. Distribu- gainer on the Pennsylvania squad.<br />\na<br />\nresult<br />\nof<br />\nmy<br />\nto avoid congestion on the range.<br />\nown<br />\nexperience.<br />\nber 24<br />\nGreatThe prospects for a winning<br />\nWord has been received that Every day while I was at college tion of Football News Given<br />\nHis work against Hopkins last<br />\nest Attention<br />\nteam this year are very bright. Major Hoisington, successor to I was required to go to chapel. I<br />\nyear was very creditable and it<br />\nA meeting of the Publicity was he who made the field goal<br />\nOnly one regular was lost by Major E. B. Garey as command- grew heartily sick of it. Being<br />\nBoard was held last week, at which saved his team from being<br />\ngraduation, and besides the veter- ant of the Johns Hopkins R.0. T. just an average American, I rewhich<br />\nthe work for the coming blanked by the J. H. U. machine.<br />\nsented<br />\ngoing<br />\nbecause<br />\nI was made<br />\nans, there is a wealth of new ma- C. unit, left the Philippine<br />\noutlined, and duties as- Wilbur was responsible for the<br />\nwas<br />\nyear<br />\nto<br />\ngo.<br />\nit<br />\nis<br />\neasy for such a daily<br />\nterial. Several crack shots have Islands on September 24. As it is<br />\nits several members. field goal which sent Temple Colsigned<br />\nto<br />\nfunction<br />\nto<br />\nbecome monotonous<br />\nentered with the class of '27. As usually a thirty-day trip, the Maof write-ups will be lege to defeat three weeks ago. It<br />\nTwo<br />\nkinds<br />\nand<br />\nmeaningless. Unless apCaptain McMurray, the former jor was expected to reach Baltivarious newspapers: remains to be seen whether the<br />\nto<br />\nsent<br />\nout<br />\nCoach, is now on duty in Panama, more this week. However, latest proached with reverence it loses<br />\nto certain dailies, Quaker line will afford him<br />\nspecial<br />\nfeatures<br />\nits<br />\ndignity and becomes a sham.<br />\nCaptain Paul will take the respon- reports from the Military Departpublicity, Which enough support against Hopkins<br />\nregular<br />\nand<br />\nthe'<br />\nment state that the new command- We are replacing the daily chapel<br />\nsibility of coaching the team.<br />\ndistributed<br />\nover all East- this year to practice his art of<br />\nbe<br />\nThe schedule this year has not ant is not expected until next with a weekly convocation of such will<br />\nbeen completed as yet, but the cal- month, as his trip across the coun- importance and character as to in- ern cities. Kennedy will handle drop-kicking.<br />\niber of the opposing teams will be try has necessitated stops at vari- spire both Faculty and student the former, Perkins the latter, Playing in the morning is an<br />\nFonda will manage the business innovation at Homewood, so it is<br />\nhigher than ever. Only the best ous military posts. Among other body.<br />\nAgain,<br />\nI<br />\nfind<br />\nend<br />\nof the work, and Shriver will hard to predict how large an aumyself<br />\nin<br />\nconflict<br />\ntrip<br />\nEast<br />\nare<br />\nhigh<br />\npoints<br />\nin<br />\nhis<br />\nteams in the country will shoot<br />\nwith tradition. Should a college have The editor's task. At the dience will be On hand to view<br />\nPresidio,<br />\nCalifornia,<br />\nand<br />\nFort<br />\nthe<br />\nagainst Hopkins this year.<br />\nLeavenworth, Kansas. The whole make its students study at pre- present time the chief item of,in- the game. There will be a great<br />\ndepartment and unit await Major scribed hours? We should not terest is football, but later in the many people in town tomorrow<br />\nNOTICE<br />\nHoisington's arrival with great forget that most of us are in year, when other activities, both to see the Navy-Princeton match<br />\nThere will not be a dance<br />\nexpectation as he has achieved a America because our forefathers athletic and non-athletic, get and the authorities at Hopkins<br />\nafter the Haverford game.<br />\nfine reputation for getting the best were dissatisfied with the artificial started in their work, the Public- are expecting a good portion of<br />\nMeeting of Editorial Staff,<br />\nresults in any group of which he restraints of arbitrary power in ity Board will send out material them to come to Homewood first<br />\nNews-Letter, today 12.20.<br />\nto see the J. H. U. team in action.<br />\ntakes command.<br />\non each.<br />\nContinued on page 4 col. 3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 26, 1923<br /><br />\n2<br /><br />\nINTERCOLLEGIATES<br />\nFRESHMEN JOYOUS OVER<br />\nSTUDENT COUNCIL ANThe youngest football captain in<br />\nCI<br />\nEIMMOKEM=ECIEIMMIKEtHECIM<br />\n,NOUNCEMENT<br />\nthe country is probably that of<br />\nFreshmen Will Lift Regulations If They<br />\nFOUNDED 1897.<br />\nCornell, who has just turned 20.<br />\nWin Over Sophs in Baseball and<br />\nFootball<br />\nOn October 20, 500 Syracuse<br />\nBaseball will count! That is<br />\n$2.00 El<br />\nSubscription<br />\nstudents made the trip to New<br />\nthe decision of the Student Council which in a recent meeting cre- York in a special train to see the<br />\nEntered as second-class matter December 3, 1909, at the Postoffice a<br />\nated another opportunity for the contest between the Orange eleven<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nHopkins and Washington Col- freshman class to throw off its and Pittsburgh.<br />\nPublished semi-weekly from October to June by the students of Johns lege were the only Maryland uni- yoke of regulations. Coming at<br />\nCollege papers throughout the<br />\nHopkins University.<br />\nversities to finish last Saturday's this time when the freshman base- country have been commenting on<br />\nBusiness communications should be addressed to the BUSINESS MAN- games in front of their rivals. ball team has already proved it- Professor Van Dyke's new book<br />\nAGER,JOHNS HOPKINS UNIVERSITY; all articles and other communications While Hopkins swamped Al- self superior to the junior and senon Rembrandt.<br />\nJhould be sent to the MANAGING EDITOR.<br />\nbright and Washington drop- ior aggregations, the decision is<br />\nA new magazine at the Univerenough to install hope in every sity of Florida has been<br />\nkicked<br />\na<br />\nvictory<br />\nover<br />\nP.<br />\nM.<br />\nA.,<br />\nHomewood<br />\n100<br />\nnamed the<br />\nTelephone<br />\nMaryland met defeat at the hands member of the Class of '27. Few \"Swamp Angel.\"<br />\nof V. P. I., St..John's succumbed previous freshman clases have had<br />\nHighland College in Kentucky<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nan outlook.<br />\noptimistic<br />\nso<br />\nto<br />\nWashington<br />\nWestern<br />\nand<br />\nLee,<br />\nhad<br />\nthe lowest enrollment of any<br />\nJOSEPH LEOPOLD, '24.<br />\nPHILIP W. HOWARD, '25.<br />\nThe sophomores accept the ac- in the country during<br />\nMaryland hit a .snag in Davis and<br />\n1923-24,<br />\nManaging Editor<br />\nElkins, and Mt. St. Mary's bit the tion of the Student Council light- with a total of 20 students. The<br />\nAdvertising Manager<br />\nWILLIAM G. DEAN, JR., '24.<br />\ndust at Catholic U. None of these ly. They, too, according to re- University of California had the<br />\nFITZGERALD DUNNING, '24.<br />\nAssistant Managing Editor<br />\ncontests had any bearing on the ports, have a team of superior highest with 14,367.<br />\nT. REESE MARSH, '24.<br />\nquality and have no fear of being<br />\nState title.<br />\nCirculation Manager<br />\nSeveral Chinese students at Co* * *<br />\nAssociate Editors<br />\nto relinquish their superi- lumbia have been making theii- exforced<br />\nJOHN C. LEWIS, JR., '24.<br />\nRICHARD C. TILGHMAN,'25.<br />\nIt is interesting to note that of ority over the \"frosh.\"<br />\npenses by teaching Mah Jong, the<br />\nJOHN W. PARSONS, '25.<br />\nAt the same meeting of the Stu- new Chinese game.<br />\n180<br />\nleading college football teams<br />\nAssistant Business Managers<br />\nBENJAMIN T. ROME, '25.<br />\nin 1922, only eight went through dent Council it was announced<br />\nThe freshman class at Princeton<br />\nJunior Editors<br />\nD. MILES. MARRIAN, '25.<br />\nthe season without a defeat and that student activity buttons numbers 631, 67 of whom are the<br />\nV. EDWARD THOMSEN, JR, '26.<br />\nG. DONALD GIESKE, '25.<br />\nARTHUR L. NELSON, '26.<br />\nonly five out of the eight won would be given out next week.<br />\nJOHN T. DIXON,'24.<br />\nsons of Princeton alumni. The ay.-.<br />\nERNEST A. STRATHMAN, '26.<br />\nMCKAY,<br />\n'26.<br />\nA.<br />\nJ.<br />\nevery game. Army played tie<br />\nLEO C. MUTH, '24.<br />\nerage age is 18 years and 5<br />\nALGER G. Hiss, '26<br />\nC. EUGENE TOVELL, '24.<br />\nFOOTBALL GAMES ATTRAC- months.<br />\ngames<br />\nwith<br />\nNotre<br />\nDame<br />\nand<br />\nYale.<br />\nEDWARD 0. MICHEL, '26.<br />\nOM° J. KELLER, III, '25<br />\nVanderbilt and Michigan played a TING MORE ENTHUSIASTS<br />\nCHARLES G. HUTZLER, '24.<br />\nJ. JACKSON KIDD, '26<br />\nOn the Saturdays of the W.and<br />\nTHAN EVER<br />\nscoreless tie. Army, Vanderbilt<br />\nThe football season may be J. and the Pennsylvania football<br />\nand Michigan won all of their<br />\nearly, but the interest in the great games the Lafayette faculty has<br />\nMember Southern Intercollegiate Newspaper Association<br />\nother games. Princeton, Cornell,<br />\ncollege sport has suffered no re- decided to suspend classes in orIowa, California and West Virlapse. Crowds now are turning der to permit the student body to<br />\nginia were victorious in every<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nout for the mid-season games, like make the trip.<br />\ngame.<br />\nAt N. Y. U. a 14-year-old prodthey did only for the big contests<br />\nOf these eight undefeated teams,<br />\nigy<br />\nhas been discovered. The avin the past. Five of the many<br />\nfour have lost games this year.<br />\nBALTIMORE, MD., OCTOBER 26, 1923<br />\nerage<br />\nage of the freshman class,<br />\ngames played last Saturday atNotre Dame broke the winning<br />\nhowever,<br />\nis 19.<br />\ntracted 186,000 persons. The Harstreaks of both Army and PrinceFour<br />\nfreshmen<br />\nat Penn State<br />\nvard-Holy Cross game at Camton. Vanderbilt has lost to both<br />\nhave<br />\nbeen excused from frosh<br />\nbridge led with a total of 50,000,<br />\nTHE MAILBAG<br />\nMichigan and Texas, and Iowa's<br />\nthe Michigan-Ohio State game at rules because they are married.<br />\nMembers of the upper classes will recall arguments that have unbroken string came to an end<br />\nAnn Arbor drew 45,000, Pennsyl- The sixth Intercollegiate Ball<br />\noccurred in past years through the medium of the News-Letter Mail- when Britton kicked a 50-yard vania and Columbia played before wil be held at the Ritz-Carlton on<br />\nbag. They remember how many questions, ranging from religion field goal to win a 9-6 victory for 38,000 on Franklin Field, 28,000 November 29, following the DartIllinois.<br />\nto love, have been discussed and debated in this column.<br />\nsaw Notre Dame play Princeton mouth-Columbia game. Music will<br />\n*<br />\n*<br />\nat Princeton and 25,000 made the be furnished by the famous<br />\nDuring the present collegiate year the Mailbag has been taken<br />\nLast Saturday brought many<br />\ntrip to the Yankee Stadium to see \"Sleepy\" Hall of Yale and his oradvantage of but little. The limited staff of the News-Letter finds it upsets. Although Notre Dame<br />\nPittsburgh and Syracuse. Many chestra.<br />\nimpossible to cover all sides of University life, to bring before the was the favorite over Princeton, it other games also drew attendances<br />\n—Tarquin.<br />\neyes of the students all activities or all ideas of interest. There are was hardly thought that four far .above normal for this tune of<br />\ntouchdowns would be scored by<br />\nBASKETBALL ORGANIZAthe year.—Exchange.<br />\nbound to be omissions. There is no reason, however, foe any person,<br />\nTION MFETING IN DERockne's disciples. Coach Roany group, any idea or theory to be excluded. We are not only will- per's<br />\nCEMBER •<br />\nmen could score only a safe-. DR. CHARLES K. EDMONDS<br />\ning but eager to publish any signed communication from any faculty ty, the result of a blocked kick.<br />\nRobert<br />\nJ.<br />\nAshton, manager of<br />\nVISITS HOPKINS<br />\none<br />\nconany<br />\nthe<br />\nundergraduate<br />\nor<br />\nstudent,<br />\nbasketball<br />\nteam, has announmember, alumnus, graduate<br />\nDr. Charles K. Edmonds, a<br />\nHarvard with its veteran line was<br />\nced<br />\nthat a basketball organization<br />\nnot impressive in its 6 0 victory graduate of Hopkins and for a<br />\nnected in any way with Johns Hopkins.<br />\nover Holy Cross. The score came number of years president of the meeting will be held on December<br />\nThe Mailbag is for your use. We ask that you take advantage<br />\nwhen a Holy Cross back fumbled Canton Christian College in the 3. All candidates for positions on<br />\nof it.<br />\na punt and Harvard recovered. A South of China, paid a visit to the team or for assistant manaforward pass and two line bucks President Goodnow last Tuesday gers are asked to attend.<br />\ntook the ball over. Yale paid a morning. Dr. John C. French, a<br />\nTRACK<br />\nbig price in defeating Bucknell, Hopkins undergraduate at the<br />\nMAJOR GAREY TAKES COMMAND<br />\nRegular<br />\nEdmonds,<br />\nesDr.<br />\ntraining<br />\nsame<br />\ntime<br />\nas<br />\n29-14, when O'Hearn, Eli toe exof the track<br />\nteam for the coming indoor season<br />\nMajor Garey's inauguration as president of St. John's College pert, had his leg broken. He will corted him about the campus.<br />\nDr. Edmonds, who took his A. will begin about the middle of Nomarks the beginning of a new era at the Annapolis institution. Al- be out for the rest of the season<br />\nPh. D. in Phys- vember. Thus far the practice on<br />\nready the former Professor of Military Science at Johns Hopkins has and Dr. Bull, Yale kicking expert, B. in 1897 and<br />\nis spending this week to develop a ics in 1903, is well known for the Tuesdays and Fridays has been<br />\ndecided upon and put into effect some marked changes in policy. He<br />\npunter and drop-kicker to take magnetic survey of China which that of limbering up, taking out<br />\nhas altered St. John's from a military school to an academic institu- O'Hearn's place. Cornell surprised he conducted for the Carnegie In- the kinks caused by lack of<br />\npraction. He has installed the honor system. He has abolished com- the fans when she trimmed Col- stitute.<br />\ntice.<br />\npulsory chapel. He has ruled that a man's scholastic average must gate by a 34=7 score. Gil Dobie<br />\nHowever, the cross country<br />\nNotre<br />\nDame<br />\na<br />\nup<br />\npicked<br />\nfumble<br />\nintercollegiate<br />\nsquad<br />\nin<br />\nis training in earnest. Their<br />\nengage<br />\nmay<br />\nbe<br />\nhe<br />\nto<br />\nchanged<br />\nof<br />\nplay<br />\nbefore<br />\nallowed<br />\nthe<br />\nCornell<br />\n'style<br />\nsatisfactory<br />\nhe<br />\nyards<br />\n70<br />\nbefore<br />\nran<br />\nhe<br />\nand<br />\nwas<br />\nseason<br />\nfrom<br />\noffbegins earlier and almost<br />\nthe<br />\nusual<br />\nline<br />\nand<br />\nbucks<br />\ncompetition. In short, Dr. Garey, or Major Garey, as he will aldowned.<br />\nevery<br />\nstyle<br />\nand<br />\nday<br />\nthey stretch their legs<br />\ntackle<br />\naerial<br />\nplays<br />\nto<br />\nthe<br />\nways be known at Hopkins, is endeavoring to place St. John's among<br />\ndifficult Homewood<br />\nthe<br />\nover<br />\nalmost<br />\nevery<br />\nwas<br />\nthe<br />\ntouchdown<br />\nthe foremost of the smaller institutions of learning in the East.<br />\nthe<br />\nBig<br />\nAll<br />\nof<br />\nThree<br />\nhave<br />\nNavy<br />\nhard<br />\nresult of a forward pass.<br />\ncourse.<br />\nMajor Garey-'s idea .of the object of a college education, although surely hit something when they games tomorrow. The PrincetonThe prospects for both teams<br />\nnot novel, is one seldom expressed. He says that the ideal at which met Penn State. Harry Wilson, Navy game at the Baltimore Sta- this year are excellent, according<br />\ncollege should aim is the turning out of gentlemen, of men endowed a Penn State back, crossed the dium is arousing much interest. to athletic authorities, and it is exwith a certain amount of culture, men who will be able to enjoy the Navy goal line three times and Both teams have been defeated pected that Hopkins will again<br />\neach time Palm kicked goal. this year and a loss to either team turn out a championship track<br />\nfiner things of life. According to the new president of St. John's,<br />\nNavy's score was made by Bal- will spoil the possibility of a suc- team.<br />\nthe value of a college education cannot be reckoned in terms of<br />\nlinger, sub-half, on a field goal. cessful season. Yale encounters<br />\ndollars and cents.<br />\nON SECOND THOUGHT<br />\nPennsylvania beat Columbia 19-7 Brown, whom she trimmed to the<br />\ntune of 20-0 in 1922. Dartmouth<br />\nHumble judges though we are, we believe that Major Garey will and Syracuse beat Pitt 3-0.<br />\nPatient—Doctor, I've known<br />\n* * *<br />\nis sporting a strong eleven as evi- you so long now that it would be<br />\nsucceed in his object and that, in the near future, St. John's will take<br />\nLong runs featured some of the denced by their 24-0 score over an insult for me to pay your bill,<br />\nits place beside leading institutions of the East. The News-Letter<br />\nbig games of last week. Wilson of Boston University and should give so I've arranged a handsome legwishes the college and its new president the best of success.<br />\nPenn State ran back a kick-off 95 the Harvard gridmen another bat- acy for you in my will..<br />\nDoctor—You don't mean it—I<br />\nyards for a touchdown through the tle.<br />\n* * *<br />\nam overwhelmed—By the way,<br />\nwhole Navy team. He also made<br />\nWest Virginia, undefeated in just let me take a look at that preruns of 70 and 35 yards. Smythe<br />\nMeeting of All News-Letter Candidates Monday at 12.20.<br />\n1922, meets Penn State at the Yan- scription again.—Boston Tranand<br />\nof<br />\n75<br />\nmade<br />\nruns<br />\nthe<br />\nArmy<br />\nof<br />\nImportant!<br />\nscript.<br />\n91 yards. Crum of Princeton kee Stadium tomorrow.<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\nGRIDIRON<br /><br />\nGOSSIP<br /><br />\nV\\<br /><br />\nA<br /><br />\nV<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 26, 1923<br />\nek-et<br /><br />\n.ir<br />\nse)<br />\nCibeXatteri<br />\n`)111%1S H.&amp; OSCAR G•L Nrir<br />\nOWNERS,<br />\nT4,<br />\n4Z)<br />\nt*-1•C'<br />\nAgents for<br />\nJOHN B. STETSON HATS<br />\nand FRATERNITY BANDS<br /><br />\nNEW SONGS<br />\nFor Practice at Assembly<br />\nOLD JOHNS HOPKINS<br />\n(Tune: \"Barney Google\")<br />\nVerse:<br />\nWhat is the football team,<br />\nThat leads in every way?<br />\nWhat is the team that's coached<br />\nwell in very kind of play?<br />\nNow there aren't any like them,<br />\nAnd they're on the top to stay.<br />\nSo listen very closely and I'll give<br />\ntheir name away—<br />\nWhy it's—<br />\nChorus:<br />\nOld Johns Hopkins with a damn<br />\ngood football team,<br />\nOld Johns Hopkins, to me it surely seems<br />\nThat when our team lines up for<br />\nplay<br />\nOpponents seem to fade away,<br />\nfrom<br />\nOld Johns Hopkins, with its damn<br />\ngood football team.<br />\nHoo Ray, Hoo Ray,<br />\nGee Hee, Gee Ha,<br />\nHopkins Rah<br />\nTeam, TEAM, T-E-A-M !<br />\n(Rising inflection)<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nWE'RE NEAT, HA! HA!<br />\nFor we're neat, ha, ha! Sweet ha,<br />\nha!<br />\nDainty and gay. .<br />\nHere comes Johns Hopkins the<br />\ngirls they all say,<br />\nHigh rolling laddies as well,<br />\nHere comes Johns Hopkins,<br />\nSay! don't they look swell.<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nENGINEERING INSTRUCTOR MRS. POST, STUDENT AT<br />\nHOPKINS, RECEIVES HONSPENDS TIME BREAKING<br />\nORABLE MENTION IN<br />\nMILK BOTTLES<br />\nSCENARIO CONTEST<br />\nAnyone who wanders into the<br />\nMrs. Ethel McCaw Post, a canMaterials Testing Laboratory in didate for the Bachelor of Science<br />\nMachinery Hall any afternoon is degree at this University, has been<br />\nsurprised to hear the continual given honorable mention in a scenario contest given by the Universmashing of milk bottles. Upon<br />\nsal Pictures. Corporation.<br />\ncloser investigation, one finds not<br />\nThe Universal Pictures Corpoa number of children playing, but<br />\nration a short time ago announced<br />\na grown man dressed in overalls,<br />\na scenario contest, open to stubreaking bottles with a hammer.<br />\ndents of American Universities.<br />\nThis • man is Mr. Frank W. KouA prize of one thousand dollars<br />\nwenhouven, an instructor in Mewas offered to the student subchanical Engineering, who is enmitting the best scenario, and to<br />\ngaged in what is perhaps the most<br />\nthe University in which the stuunique series of tests ever condent was enrolled a like sum was<br />\nducted in the Hopkins laboratory.<br />\noffered.<br />\nMr. Kouwenhouven was engagA student at the University of<br />\ned over a year ago by a promiCalifornia received first prize in<br />\nnent milk bottle manufacturer to<br />\nthe contest. The sum of five hundevise a test for determining the<br />\ndred dollars was paid to each of<br />\nstrength of milk bottle necks. He<br />\ntwo students residing at the Unihas been experimenting with<br />\nversity of Denver and Temple<br />\nthousands of bottles and now has<br />\nUniversity of Philadelphia for the<br />\nseveral barrels full of bits of glass use<br />\nof the plays they had submitto testify to his efforts. The main<br />\nted.<br />\ntests conducted by Mr. Kouwenhouven consist of driving a wedge BARNSTORMERS' TRYOUTS<br />\nTO BE HELD SOON<br />\ninto the mouth of a bottle or of<br />\nThe try-outs for the Barnstormcrushing the neck by a contracting ring. One great difficulty ex- ers' forthcoming musical producperienced in these tests has been tion will be held in a short time,<br />\nthe lack of uniformity even in bot- it was announced Tuesday. The<br />\ntry-outs will take the form of vautles of the same batch.<br />\nThe results arrived at by Mr. deville acts. Art and business<br />\nKouwenhouven have met with staffs, members and candidates,<br />\ngeneral commendation in the bot- will be started to work in the near<br />\ntle industry. In fact, during the future.<br />\nThe production is rounding into<br />\nPast summer, he was, engaged by<br />\nshape,<br />\naccording to the managethe Borden Milk Company of<br />\nment.<br />\nThe books and lyrics will<br />\nNew York to act in an advisory<br />\nsoon<br />\nhave<br />\ntheir finishing touches<br />\ncapacity in their bottle factories.<br />\nadded, and then will be ready for<br />\nrehearsals. The music is likewise<br />\nDR. LATANE TO ADDRESS<br />\nnearly completed.<br />\nFIELD CLUB<br />\nThe first Field Night of the DR. LOVEJOY ADDRESSES<br />\nENGINEERS' CLUB<br />\nseason will be held at the Club<br />\nDr.<br />\nArthur<br />\n0. Lovejoy, ProfesHouse on Saturday evening, Deof<br />\nsor<br />\nPhilosophy,<br />\naddressed the<br />\ncember 27, at 8:30.<br />\nEngineers<br />\nWednesday<br />\nClub<br />\non<br />\non<br />\nDean Latane has consented to<br />\nthe<br />\nsubject<br />\nof<br />\n\"The<br />\nLeague<br />\nof<br />\nNatalk to the Club on \"The Corfu<br />\ntions.\" Professor Lovejoy was seIncident and the League of Nacured<br />\nthrough the courtesy of the<br />\ntions.\" At the present time, Dr.<br />\nLeague of Nations Non-Partisan<br />\nLatane is in great demand by a<br />\nAssociation. A large sized crowd,<br />\nnumber of local organizations for<br />\nincluding<br />\nmany prominent Baltiaddresses, especially on the Corfu<br />\nmore<br />\nbusiness<br />\nmen, were on hand.<br />\nincident.<br /><br />\nHOO-WAH-HOO FQR J. H. U.<br />\nTune: \"Hinky, Dinky, Parley<br />\nVoo.\")<br />\nFIGHT FOR JOHNNY<br />\nWe'll tell the world we've got a<br />\ngood line. Hoo-wha-hoo.<br />\nHOPKINS<br />\nWe'll 'tell the world we have a (Tune:\"Our Director,\"<br />\nby Sousa)<br />\ngood line. Hoo-wah-hoo.<br />\nFight for Johnny Hopkins,<br />\nWe'll tell the world we've got a<br />\nFight for J. H. U.,<br />\ngood line<br />\nThen we will conquer<br />\nAnd the whole damn backfield's<br />\nAnd raise the Black and Blue, rah,<br />\njust as fine,<br />\nrah!<br />\nHoo-wah-hoo for J. H. U.<br />\nRah, rah, rah, rah, rah, rah, rah!<br />\nFight for dear old Hopkins,<br />\nWhen our team comes out it fights<br />\nFight for Black and Blue;<br />\nto win. Hoo-wha-hoo.<br />\nWe'll always cheer our Alma<br />\nWhen our team comes out it fights<br />\nMater,<br />\nto win. Hoo-wha-hoo.<br />\nAnd fight for J. H. V.<br />\nWhen our team comes out it fights<br />\nBring this News-Letter to next<br />\nto win.<br />\nAssembly.<br />\nAnd win it does 'mid an awful din.<br />\nHoo-wah-hoo for J. H. U.<br />\nSt. John's has a team we're going<br />\nta trim. Hoo-wha-hoo.<br />\n•St. John's has a team we're going<br />\nto trim. Hoo-wha-hoo.<br />\nSt. John's has a team we're going<br />\nto trim.<br />\nAnd over their body we'll sing a<br />\nhymn.<br />\nHoo-wah-hoo for J. H. U.<br />\n*<br /><br />\n* *<br /><br />\nST.'JOHN'S, GOOD DAY<br />\nSt. John's, good day.<br />\nSt. John's, they say,<br />\nThat you can play right well.<br />\nBut if you come out alive,<br />\nThank the gods you stirvive,<br />\nFor old Hopkins will give you<br />\nBell! Hell! Hell! Hell!<br /><br />\n3<br /><br />\nSTETSOIN0cP<br />\n-<br /><br />\nBats<br />\nStyle and .Quality are the two essentials of<br />\na good hat, but it does not pay to buy one<br />\nwithout the other. All Stetsons have both.<br />\nSTYLED FOR. YOUNG MEN.<br /><br />\nThe Johns Hopkins University<br />\nFORTY-EIGHTH YEAR OF INSTRUCTION 1923-1924<br /><br />\nINSTRUCTION<br />\nGRADUATE SCHOOL OF ARTS AND SCIENCES.<br />\nArts; Doctor of Philosophy.<br /><br />\nDegrees: Master of<br /><br />\nMEDICAL SCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nCOLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nSCHOOL<br />\nOF<br />\nENGINEERING. Degrees: Doctor of Engineering; Master of Engineering; Bachelor of Engineering; Bachelor of Science in<br />\nChemistry.<br />\nSCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Public Health; Doctor of Science and Bachelor of Science in Hygiene; Certificate in Public Health.<br />\nSCHOOL OF BUSINESS ECONOMICS.<br /><br />\nDamon—<br />\n\"What did Professor Smith mean<br />\nthis morning when he told you<br />\nthat no man could ever make a<br />\nsilk purse out of a sow's ear?\"<br /><br />\nPythias—<br /><br />\nBachelor's Degree.<br /><br />\nCOLLEGE COURSES FOR TEACHERS. Degree: Bachelor of Science.<br />\nSUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of<br />\nArts or of Science.<br />\nCOURSES IN SOCIAL ECONOMICS.<br />\nEVENING COURSES in Business Economics and for Technical Workers.<br /><br />\n\"He meant that I'd never be able<br />\nto do good work with a poor pencil.<br />\nGuess I'll have to get a Dixon's<br />\nEldorado. Old Smity says it's the<br />\nbest drawing pencil made.\"<br /><br />\nvi paws 0<br />\nELDORAD<br /><br />\nJOHNS HOPKINS PRESS PUBLICAL ONS.<br /><br />\n\"The7nastiv•dratthrgpencir<br />\n17 leads—all dealers<br />\n11M1111111.111111•11111111111111<br /><br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br /><br />\nHOCHSCHILD.KOHN &amp;a CO.<br /><br />\nBUILDINGS<br />\nGILMAN HALL—General library, class rooms, biology, administration.<br />\nMECHANICAL AND ELECTRICAL ENGINEERING—Housing also Physics<br />\nand College Chemistry.<br />\nC_VIL ENGINEERING—Housing also Geology.<br />\nPOWER HOUSE.<br />\nBOTANY AND PLANT PHYSIOLOGY—With Greenhouses and Botanical<br />\nGarden.<br />\nCHEMICAL LABORATORY—For graduate work.<br />\nPHYSIOLOGICAL BUILDING.<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL :IANK,<br /><br />\nXL<br /><br />\nrCorner C-<br /><br />\nyelie<br /><br />\nand Sulaw 815.<br /><br />\n-Where Wholesale and Retail Districts Meet-<br /><br />\nANATOMICAL LABORATORY.<br />\nHUNTERIAN LABORATORIES.<br />\nPATHOLOG _CAL LABORATORY.<br />\nSCHOOL OF HYGIENE.<br />\nCARROLL MANSION—Johns Hopkins Club.<br />\nSTUDENT ACTIVITIES BUILDING.<br />\nALUMNI MEMORIAL DORM•_TORY.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 26, 1923<br /><br />\n4<br /><br />\nSHIRT MAKER<br />\nBOK PEACE AWARD COMPE226 N. Liberty St.<br />\nTITION CLOSES NOV. 15<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\nAT MIDNIGHT<br />\n$3.25 and $4.25<br />\nNegligee.<br />\n$5.25 and $6.25 Popular Referendum Will Show FeelImported Madras<br />\ning of Nation. Public Opinion in<br />\nTerms Cash, Less 10% 30 Days on Shirts.<br />\nFavor of Movement<br />\nAlso a Full Line of Men's<br />\nFurnishings.<br />\nAfter being before the public<br /><br />\nSTRATTON<br /><br />\nMAJOR GAREY INSTALLED AS preciative power; to have both<br />\nDORMITORY<br />\n•<br />\n. PRESIDENT OF ST. JOHN'S<br />\nPlans for the general get-toteacher and student teeI comCOLLEGE<br />\nradeship in the enterprise of un- gether of the Dorm-men on FriContinued from page 1<br /><br />\nday night are rapidly reaching<br />\nEurope. Naturally, this old insti- derstanding human experience.<br />\ncompletion. Mount, who has<br />\n*<br />\n•<br />\n*<br />\ntution is very much concerned<br />\ncharge<br />\nof the program, reports<br />\nWhat moderate resources we<br />\nwith the good habits and proper<br />\nmany<br />\nthat<br />\nmen are signing up for<br />\ndecorum of its students, but we possess we are not expending just<br />\nindividual<br />\nstunts. A solo dance<br />\nfor over three months the compe- are equally concerned with their now in constructing buildings.<br />\nby—name<br />\nwithheld because of artNECKWEAR tition for the American Peace development in personal responsi- We are using our means to engage<br />\n• SHIRTS<br />\nist's modesty—several musical<br />\nhighest<br />\ngrade<br />\nFaculty<br />\nthe<br />\nfor<br />\nour<br />\nIn<br />\na<br />\nword,<br />\nwe<br />\nbility.<br />\n*<br />\n*<br />\n*<br />\nAward, created by Edward W.<br />\nendeavor- of men that we can find to in- bits, a short humorous talk, and<br />\nBok, will close at midnight, No- of this Faculty are not<br />\ning to apply the rules of a kin- struct our students, not only in one or more stunts of acrobatic<br />\n421 N. HOWARD ST.<br />\nvember 15th. Powerful public<br />\ndergarten in the administration of classes and laboratories, but in turns will constitute the evening's<br />\nGLOVES sentiment is backing the moveHOSIERY<br />\nthe students' private affairs, but their rooms and in our homes. In program.<br />\nment and from the interest evi- we are endeavoring to find the se- a college as elsewhere, the man's<br />\nHONOR SYSTEM INAUGUdenced by inquiries, editorials, crets of right living and the great the thing.<br />\nRATED AT PRINCETON<br />\n* * *<br />\nspeakers and Articles an over- principles of human conduct, and<br />\nEvery examinee now is required<br />\nwhelming majority of people in to give life to them on this camTo Dr. Thomas Fell, my distin- to sign pledge: \"On my honor as<br />\nthe United States favor it.<br />\nguished predecessor who has a gentleman that during this expus.<br />\nColleges, universities and smallSome years ago, the experiment given so many years of his life to amination I have neither given<br />\ner institutions have shown great was tried of making this institu- faithful and useful service to the nor received<br />\nassistance\" is the<br />\ninterest and in many cases stu- tion a military college. It was not college, to the people of Annap- pledge<br />\nsigned by all students of<br />\n—<br />\ndents and faculty are preparing altogether successful, for the sim- olis who are taking such a deep Princeton<br />\nUniversity after they<br />\nLimited<br />\nto vote for the winning plan for ple reason that unless designed interest in our plans, to the for- have<br />\nwritten an examination. For<br />\n\"international co-operation look- for a special purpose, such as the mer members of our Board of Vissome time the Honor System as<br />\nBARN CAFETERIA ing toward the prevention of Naval Academy or West Point, or itors and Governors for their this is called has been proposed<br />\nat<br />\nwar.\"<br />\ninfluenced by tradition or commu- years of service to the college, to Princeton and now<br />\nthe constituPlans for the ,awarding by the nity pride, a military college is an our Governor for his interest in<br />\ntion of the system is complete. .<br />\nORDERS RECEIVED FOR<br />\nJury of Award and the \"popular un-American institution<br />\nand, our progress, to our alumni• for<br />\nViolation of the Honor System<br />\nreferendum\" are announced in a while we hold that it is the duty their sacrifices, and to the people<br />\nCOGGINS'<br />\nconsists of any attempt to receive<br />\nrecent publication by the Policy of every institution and good citi- of Maryland for their awakened<br />\nTransfer &amp; Baggage Express<br />\nassistance whether the person givCommittee.<br />\nzen to play a constructive part in support, may I express my appreAUTOMOBILE SERVICE<br />\n\"As soon as the Jury of Award the national defense, we find that ciation. Should there be some- ing the assistance, has completed<br />\nPHONE, HOMEWOOD 6886<br />\nhas made its selection, the plan in applying all the rigid and mon- thing in the history and traditions his paper or not. The rule is in<br />\nchosen will be at once submitted otonous rules of military disci- of this venerable institution that force during the whole period of<br />\nThe Flag, Banner &amp; Pennant Shop to the people of the country pline to the average college boy, touches your heart, should our as- examination, both within and<br />\nthrough this informal referendum much of his originality, person- pirations for broader usefulness without the examination room.<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands, conducted through the daily and<br />\nality and spirit of aggressiveness commend themselves to you, may Persons obtaining beforehand,<br />\nEmblems, Silk Banners for Schools,<br />\nweekly press, so far as their co- is destroyed.<br />\nwe have your good wishes and any information as to the nature<br />\nSocieties and Fraternities<br />\n*•<br />\n*<br />\n*<br />\n302 PARK AVE., BALTIMORE, MD. operation is available; through<br />\nGod speed in the consummation of of the questions contained in the<br />\nR. H. Taylor<br />\nVernon 2355<br />\nexamination paper shall be reReplacing<br />\na<br />\nbook<br />\nof<br />\nmany rules, our plans?<br />\nthese 81 national organizations,<br />\ngarded<br />\nas having violated the<br />\nand through a large number of lo- characteristic of our temporary<br />\nMr. Noble, chairman of our<br />\ncode.<br />\n—The McGill Daily.<br />\ncal and state organizations which, military regime, we have dared to Board of Visitors and<br />\nGovernors,<br />\nwhile not always formally con- have only two rules for the guidI accept the commission which<br />\nnected with the national organiza- ance of our student body, first, the you tendered me. Aware of my<br />\n20% DISCOUNT<br />\ntions forming the council, are in- rule Of honor; second, the rule of<br />\nfulfilling<br />\nUnworthiness<br />\nin<br />\nthe<br />\nduTO ALL HOPKINS MEN<br />\nterested in the award and desire hard work. Because we, too, of<br />\nties<br />\nof<br />\nmy<br />\noffice,<br />\nbut<br />\nasking<br />\nfor<br />\nMEN'S SHOES<br />\nto take a referendum of their the Faculty are human, we forgive<br />\nin advance the minor frailties of Divine guidance and the help of<br />\nmembers.<br />\nOf the Better Class<br />\nmy fellow citizens, I have started<br />\n\"Very definite plans for the the, students. Being treated as my work with the determination<br />\nmethod of taking the referendum men and gentlemen, our students to make this institution a continURNER BROTHERS<br />\nof<br />\ntheir members have been laid have been quick to sense our at- ued vital factor in the further EVERYTHING IN SPORT<br />\nI I I E. BALTIMORE STREET<br />\nSUPPLIES<br />\nBaltimore<br />\nby most of the organizations, and titude towards them and to re- progress 'of our state and coun221<br />\nWest<br />\nBaltimore<br />\nStreet<br />\nthe meeting of this week was for spond worthily.<br />\ntry.<br />\nNear Howard<br />\nThis institution wants to win<br />\nthe purpose of comparing notes<br />\namong the representatives of the games, too, but we want to win<br />\n1873<br />\nEstablished<br />\norganizations and determining fin- by fair play, and we want furtherally the exact method by which more to evolve a plan wherein<br />\nA. H. FETTING MAN'FG<br />\nJEWELRY CO.<br />\neach organization could best and every student will have an active<br />\nTailors<br />\nManufacturers<br />\nmost promptly reach its complete place in some form of athletics.<br />\nUniforms<br />\nand Liveries<br />\nGreek Letter Fraternity Jewelry<br />\nWe are going to remain a small<br />\nmembership with the winning<br />\nST.,<br />\nBaltimore,<br />\nMd.<br />\nLIBERTY<br />\n213 N.<br />\n128 W. Fayette St., Near Liberty St.<br />\ncollege. We are going to continue<br />\nplan.<br />\nBaltimore, Md.<br />\nbe<br />\na<br />\nsmall<br />\ncommunity<br />\nwhere<br />\n\"The aim of the committee in<br />\nIECIEJEEILIFAIELIIILIIECIEEIDEOKTItEXACIE1<br />\nevery<br />\none<br />\nknows<br />\nevery<br />\none.<br />\nI<br />\ncharge of the award is to give<br />\nevery interested man and woman want my sons to go to that instiin the country an opportunity to tution where the human element<br />\nparticipate in this referendum. It is considered of fundamental imand individuality is offered here at prices that are not<br />\nis the first 'opportunity that the portance, and there is a friendly,<br />\nand cannot be underquoted by any house at any time.<br />\nindividual in this country has had interested relationship between<br />\nBesides the reputation of an old-established firm<br />\n41<br />\nto make effective his opinion as teacher and student.<br />\nof each sale with a guarantee.<br />\nback<br />\nis<br />\n***<br />\n\"The King of Lubricants\" to what part the United. States We have already in Maryland<br />\nshould play in a plan for internainstitutions which serve special<br />\ntional co-operation looking toSHERWOOD BROTHERS, INC.<br />\nneeds. At the Johns Hopkins Uni- FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nward the prei7ention of war.<br />\nversity, the University of MaryElEtigigKrgg./ILIERITEtEtriCEMKI0figNAREICIE1<br />\n343 NORTH CHARLES STREET<br />\n\"Oi-g-anizations whose memberland, and other splendid Maryland<br />\nship totals between forty and fifty<br />\ninstitutions there are departmillion people have already defments with which St. John's would<br />\ninitely agreed to participate in the<br />\nbe presumptuous indeed to comreferendum.\"<br />\npete. We are not, and shall not<br />\nbe, a professional school. Yet, as<br />\nMANDOLIN<br />\nCLUB HOLDS I ponder over the opportunities<br />\nAt the Washington Monument<br />\nFIRST REHEARSAL<br />\nthat lie before us, I find myself<br />\nThe Mandolin Club held its first coming again and again to the<br />\nOscar Thomas Olson, D.D.<br />\nregular meeting of the year Mon- conclusion that there still reMinister<br />\nday, October 22, in the Barn. mains for us another great field<br />\nAbout 25 men were present and —the field of liberal culture. I<br />\nHopkins Students Are Invited to<br />\nMr. McCauley, last year's able di- have.a deep conviction that there<br />\nMake This Their Church Home<br />\nrector, who has been engaged are thousands of youths in the<br />\nagain for this year, says that the land who crave a liberal culture,<br />\nThe purpose and program of this<br />\nmaterial is good. He hopes to put in order that their lives shall be<br />\nChurch will appeal to you. Look in<br />\na great deal more music of the richer in the living. To those who<br />\non the Sunday afternoon -At Hoirieclassical type in the programs for seek us out, we will give it. Our<br />\nfrom five to seven.<br />\nPrinters o<br />\nthis year and to have a generally effort will be to awaken our stuSunday morning worship at 11 o'clock.<br />\nmuch higher kind of performance. dents to the questions common to<br />\nThe johns Hopkins<br />\n-ill<br />\nmen—the<br />\nprobintelligent<br />\nFuture rehearsals of the ManSunday evening service at 8 o'clock.<br />\nNEWS-LETTER<br />\ndolin Club will be held Monday at lems of science, of history, of<br />\nMusic by vested chorus—choir of soloists.<br />\n8 P. M. at the Barn; Glee Club philosophy, of literature; then to<br />\nrehearsals will be held on Thurs- develop an orderly habit of mind,<br />\nALL SEATS FREE<br />\n\"At the heart of the City\"<br />\nan open-minded, analytical, apLOMBARD and SOUTH STREETS day at 7.30 P. M.<br /><br />\nLeFranc &amp; Ault<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br /><br />\nURNER'S<br /><br />\nCUT - RATE<br />\nSPORT SHOP<br /><br />\nA. JACOBS 8z SONS<br /><br />\n5311:<br /><br />\nFURNITURE OF QUALITY<br /><br />\n'2 ©EEO<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br /><br />\nT3414<br /><br />"}], "field_media_file": [{"target_id": 37779, "display": null, "description": null, "target_type": "file", "target_uuid": "8106ef4d-e68d-4e2e-b763-358bf37ce4c3", "url": "http://digital.library.jhu.edu/system/files/2022-03/13079-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13079, "target_type": "node", "target_uuid": "7d1b2e09-d4c2-4e6f-9aa8-259d8b504657", "url": "/node/13079"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "d70b0215-30af-412c-af74-e02e4b27404a"}]}