{"mid": [{"value": 37455}], "uuid": [{"value": "e466fbe8-3eee-4ab5-bf98-4b3f33ec1cc3"}], "vid": [{"value": 37455}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:32:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13392-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:32:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:32:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "JAY ELEVEN TO<br />\nMEET SWARTHMORE<br />\nVisiting College Has Veteran<br />\nTeam<br />\nJAYS IMPROVE<br />\nTeam Hopes To Make Late<br />\nSeason Spurt<br />\nNext Saturday, November 9, the<br />\nJohns Hopkins University football<br />\nteam meets Swarthmore College.<br />\nThe game will be played on the<br />\nHomewood field. Dr. Van Orman<br />\nboth hopes and expects the team to<br />\ngo through for their second victory<br />\nof the season.<br />\nThe Swarthmore team will be<br />\npractically the same one that defeated Hopkins last year 13 to 9.<br />\nHopkins was ahead until the last<br />\ntwo minutes of play when a long<br />\nforward pass brought victory for<br />\nthe Swarthmore team. This year<br />\nSwarthmore gave Pennsylvania a<br />\nmighty close run, which seems to<br />\nsay that they will be a hard team to<br />\nput down. The Philadelphia team<br />\nwas not so impressive last week<br />\nwhen it defeated the weak-Delaware<br />\neleven 19 to 6. Therefore the improvement shown by the Blue Team<br />\nlast Saturday points to a victory<br />\ntomorrow.<br />\n<br />\nPrice 5 Cents<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 8, 1929<br />\n<br />\nVol. XXXIV, No. 12<br />\n<br />\nWORLD YOUTH IS<br />\nDISCUSSION SUBJECT<br />\nA discussion will be held<br />\nSunday, at the International<br />\nTea, in Levering Hall. Miss<br />\nRuth Outland, of Holland,<br />\nwill speak on the World Youth<br />\nConference which was held at<br />\nErde, Holland. On the basis<br />\nof this talk the group will discuss the World Youth Movement, especially in regard to<br />\nthe United States and Germany. Miss Outland is from<br />\nthe other side and her 'viewpoint should prove of interest.<br />\n<br />\nDEBATING COUNCIL<br />\nPLANS ACTIVITIES<br />\nFreshman-Sophomore Debate<br />\nFirst On Schedule<br />\nORATORY<br />\n<br />\nCUP<br />\n<br />\nOFFERED<br />\n<br />\nDebate With Goucher May Be<br />\nArranged In March<br />\n<br />\nACTIVITY GOES ON IN BIOLOGY<br />\nLAB. IN MIDST OF MOVING<br />\nPerhaps the most interesting<br />\nplace on the campus in regard to<br />\ncuriosities is the Biology Laboratory (apologies to any freshman lectures or other freshman gatherings).<br />\nHere one may see specimens of<br />\nCab pus Aquaticus quaintly labelled<br />\n\"Homewood, 1926.\" There are also<br />\nseveral skeletons of gigantic Felis<br />\nDontestica, otherwise known as common house cats, which were so unfortunate to stray on the University<br />\ncampus.<br />\n<br />\nthem over hill and vale.<br />\nThe laboratory is particularly<br />\nproud of its assortment of salamanders, although they do not rival<br />\nin size, the collection of last year.<br />\n<br />\nDEBATING TRY-OUTS<br />\nTO BE HELD SOON<br />\nDal Ghent, president of the<br />\nDebating Council, wishes to<br />\nannounce that try-outs for the<br />\nUniversity Intercollegiate Debating Teams, will be held<br />\nTuesday, November 19, at<br />\n5.30 P. M., in Room B, second<br />\nfloor, Levering Hall. Every<br />\nmember of the student body,<br />\nwhether or not he has had any<br />\ntraining in intercollegiate debating is invited to the tryouts. The two speakers who<br />\nseem most qualified at this<br />\ntime will be given a trip to<br />\nNew England during the<br />\nChristmas Holidays with all<br />\nexpenses paid to represent the<br />\nUniversity against northern<br />\ncolleges. Other speakers will<br />\nbe assigned places in short,<br />\nout-of-town debates, and home<br />\ndebates with other universities.<br />\n<br />\nIn a case may be seen an exhibit<br />\ntitled \"Skeleton, feathers and skin<br />\nof white silky Japanese cock,\" it<br />\nbeing just that, resembling ve.-ymuch the dinner of a buzzard. In<br />\nanother case, amply covered with<br />\nmoth balls, may be seen a stuffed<br />\nand other furry denizens of the<br />\nseal<br />\nAnother animal from the wilds of<br />\ngreat<br />\nout-doors.<br />\nWyman's Park is the Dedelphis Virginian or Opossum. From the four<br />\nSeveral jawbones of whales are<br />\ncorners of the globe come pygmy<br />\npropped up against the wall, all<br />\nhippopotami and turtles. Turtles<br />\nwith the general appearance of havlarge, small and indifferent, there<br />\ning had small souvenirs.<br />\nbeing a particularly large one reFreshmen can be amused by lookceived from the Frederick Fair last<br />\ning at the little sea shells. There is<br />\nyear. The pygmy hippopotamus is<br />\nalso a case of slightly moth-eaten<br />\nabout the size of a cat and is the<br />\ncrayfish.<br />\npresent of Dr. H. Fox, of the Zoological Society of Philadelphia.<br />\nThe Biology Laboratory is now<br />\nin the process of expansion, taking<br />\nPreserved in closely-guarded alover the old quarters of the Math<br />\ncohol we also find sea horses, fire<br />\nDepartment. Soon, no doubt, taking<br />\ntoads and Ousines of New Zealand,<br />\nadvantage of increased space, they<br />\nwhatever they may be. Butterflys<br />\nwill have the skeleton of a full- Will Convene Monday Noons<br />\nand coral formations are also on<br />\nsized whale hung on exhibition.<br />\nIn Levering Hall<br />\nview, although we have yet to see<br />\nthe Hopkins professors chasing<br />\nH. F.M.<br />\nSEID,MAN SPEAKS<br />\n<br />\nHULLABALOO WILL<br />\nTAKE PHOTOGRAPHS<br />\nSeniors Must Make Appointments For Sittings<br />\nImmediately<br />\nPICTURES<br />\n<br />\nNEXT<br />\n<br />\nWEEK<br />\n<br />\nSchedule For Group Photos<br />\nCompleted<br />\nIndividual senior pictures for<br />\nthe Htdlabaloo will be taken from<br />\n9 to 12 A. M. and from 1 to 4<br />\nP. M. every day next week, beginning on Monday. If seniors have<br />\nnot made appointments to have their<br />\npictures taken they should do so<br />\nimmediately, at the secretary's desk<br />\nef the Y. M. C. A. The seniors are<br />\nurged to be prompt in keeping their<br />\nappointments as any delay will set<br />\nback the entire schedule.<br />\n<br />\nA deposit of one dollar is reLIBERAL CLUB HOLDS<br />\nquired at the time the picture is<br />\nMEETING MONDAY taken. This will be credited to the<br />\n<br />\nMonday, at 12.25, in the Council<br />\nRoom of Levering Hall, the Deindividual when orders for the<br />\nbating Council held a very imporprinted photographs are made.<br />\ntant meeting. M. Dal Ghent, president of the Council opened the<br />\nOther Pictures<br />\nmeeting. Following a short report,<br />\nJunior, sophomore and freshman<br />\nHarold Yudkin gave a report of the<br />\nCosmopolitan Club<br />\nHopkins Harriers to<br />\nWaste Declared Detracting To class officers, as well as members<br />\nsecretary of the Council. His report<br />\nMeet Catholic Univ.<br />\nElects Officers<br />\nIndustries<br />\nfollows:<br />\nof the Student Council, are advised<br />\npresicross-country<br />\nwill<br />\nAlfredo<br />\nelected<br />\nHopkins<br />\nmen<br />\nBafios<br />\nwas<br />\neighteen<br />\nwere<br />\nsent<br />\nto<br />\n\"Letters<br />\nTeam Shows Improvement<br />\nto make appointments for their<br />\nnorthern colleges asking for de- dent of the Cosmopolitan Club at engage in a meet with Catholic \"Waste in Industry\" was the title<br />\nCoach Van Orman says that all<br />\nbates during the Christmas holidays. the last meeting of that association, University tomorrow. The Black of a paper read at the last meeting sittings at the same time the senior<br />\nthe team needs is a bit more exColgate, Villanova, and Boston Col- which was held at 8.30 P. M., last and Blue harriers plan to leave for of the Liberal Club by Joel Seid- individual photographs are taken.<br />\nperience in the backfield, and he<br />\nlege have accepted our invitations. Saturday. Lazer Teper is the new Washington this afternoon. This man. The speaker analyzed the<br />\nThe schedule for pictures of frabelieves that after the number of<br />\nAmherst, Havard, Brown, Provi- vice-president and Miss Roberta is the first match ever held with the modern industrial structure from<br />\nternity,<br />\nactivity, and class groups<br />\ngames played this season, that it is<br />\ndence, Rutgers, Yale and M. I. T. White, secretary to the society. An Capitol City institution.<br />\nthe point of view of social waste,<br />\nnot now lacking. He also stated<br />\nAlthough the cross-country team defining waste as any failure to get during the week is as follows:<br />\nhave declined our offers. A debate interesting program was provided<br />\nthat the team showed great imof<br />\nMorgan College stu- was beaten after a hard struggle the maximum use value of output<br />\nhas been arranged with the Uni- by a group<br />\nprovement last Saturday. Love,<br />\nMonday, November 11<br />\nversity of Maryland to take place dents, who presented a variety of by Columbia, and though not much at the minimum real cost in labor<br />\nwho played tackle earlier in the<br />\nis known of the Washington team, and raw materials.<br />\nat Levering Hall in March. Fol- negro folk songs.<br />\n12.20, A. A. Board; 12.30, Interseason has been out of the line-up lowing the suggestion of Tau Kappa<br />\nthe Hopkins mentor is optimistic<br />\nbecause of a broken hand. He is Alpha the national honorary deThere are four great channels of fraternity Board; 12.40, Varsity<br />\nas to the result of the coming enClub.<br />\nimproving, but it is still very doubt- bating fraternity, a debate with Cotillion Club<br />\ncounter. The Hopkins harriers have waste in modern industrial society,<br />\nful whether he will be able to play Goucher College will probably be<br />\nfirst<br />\nof<br />\nThe<br />\nthe<br />\nspeaker<br />\ndeclared.<br />\nTo Hold Dance been under the disadvantage of<br />\n4.15, Scabbard and Blade, Cadet<br />\nnext Saturday or not. If he does arranged. Mr. Wheeler, who was<br />\nstrange and longer courses in the these is the furnishing of goods and Officers, R. 0. T. C. Unit,<br />\nSwarthmore<br />\nAfter<br />\ngame<br />\nSatthe<br />\nRegular<br />\nnot play his position will be filled recently elected faculty<br />\nadviser to urday, the Cotillion Club will hold last two meets. While it is true that services which are either useless,<br />\nOfficers.<br />\nby Dick Keating again. Keating the Council,<br />\nadvertising,<br />\nor<br />\nsuch as most of<br />\nhas offered a cup to the<br />\nwhich this match will be run over the<br />\nplayed a fine game against Haver- Council, on behalf of a well-known a tea-dance, the admission to<br />\nCatholic<br />\nUniversity grounds, the harmful, such as opium or certain<br />\n7.30, Phi Kappa Psi; 7.45, Delta<br />\nwill be fifty cents. Os Steinwald<br />\nford, blocking four kicks.<br />\nMaryland woman to be awarded will supply the music as usual. length of that course is practically patent medicines. As an illustration Phi; 8.00, Alpha Delta Phi;<br />\n8.15,<br />\nannually to the winner of another That night there will be the usual the same as the one of Homewood. of the latter he cited the case of a<br />\nTraditional Late Season Progress<br />\nPhi<br />\nGamma<br />\nDelta;<br />\nSigma<br />\nPhi<br />\n8.30,<br />\noratorical contest. Teams have been dance with Bob Iula supplying the<br />\nCoach Hambleton plans to leave fat reducer which was found to<br />\nIt always has been a fact that<br />\nconsist of gelatine in which was Epsilon; 8.45, Kappa Sigma; 9.00,<br />\nchosen to represent the freshman music. Admission to this is one with the usual six or seven men.<br />\nthe head of a tape worm. Delta Upsilon.<br />\nHopkins teams have improved and sophomore classes in their foimbedded<br />\nThese selected men are Captain<br />\ndollar. Prizes at the door.<br />\nabout 100 per cent for the last two rensic battle to take place at the end<br />\nFollowing the Maryland game, Kelly, Schiebel, Emerson, Waters, The second great channel of<br />\nTuesday, November 12<br />\nor three games of the season. The of the month. The date for this de- the Cotillion Board has planned a Miller and Packard. It is not known waste was held to be unemploybate,<br />\nas<br />\nwell<br />\nas<br />\nfor<br />\nthe<br />\nrest<br />\nof<br />\nthe<br />\nwhether<br />\nHancock's<br />\nfoot<br />\nis<br />\nas<br />\nyet<br />\nin<br />\nment.<br />\nIn<br />\nthe<br />\nSwarthmore game is the third from<br />\nUnited States, even<br />\nThanksgiving Dance and have elect12.20, Rifle Club; 12.30, Stuthe last and now is the time for the Debating Council's program will be ed a committee to se that it will condition for him to run. If It is in good times, the number unem- dents Activities Council; 12.40,<br />\nannounced as soon as Purnell Hall be interesting. It will take place in he will be the seventh man for Hop- ployed, either because no job could<br />\nteam to come up to this tradition.<br />\nis able to fit them into his assembly eiher the Maryland Casualty or kins. He was missed in the last be found or because of strikes or Varsity Seal Holders;<br />\nCoach Van Orman has been rubbing program. Dr. Lancaster has prommatch where a single early place preventable accidents and sickness, 4.00, Aviation Club; 4.10, Radio<br />\nSouthern Hotel.<br />\nthis in on the team and it is up to ised to state a topic for this year's<br />\nThe prices will be as follows: might have helped to turn a de- is about one million, whereas, in Club; 4.20, Mechanical Engineers;<br />\nthem to show the stuff this week. De Toqueville Medal Contest, as $2.00 a couple and $1.50 stag. Bob feat into a victory for the Jays.<br />\nperiods of depression the number<br />\n4.30, Civil Engineers; 4.40, Elecmay reach five or six millions.<br />\nThe men have been working hard soon as he will be able to confer Iula will lead the orchestra in pertrical Engineers.<br />\nin preparation for springing a sur- with Dr. Siegfried and Dr. Chinard son.<br />\nThe failure to use the best<br />\nMr.<br />\nPaul<br />\nMeng<br />\nabout it. The Adams Declamation<br />\nA. Hull was elected to the Cotilprise victory on the Quakers.<br />\nAddresses U. S. C. technique of production and distri- 7.30, Kappa Alpha; 7.45, Omicontest for members of the sopho- lion Board to fill the vacancy left<br />\nbution was cited as the third great cron Kappa Omicron; 8.00, Alpha<br />\nmore class will be revived this year. by one of last year's seniors.<br />\nCheering Section Nearly Filled<br />\nLast Tuesday evening at 6.30 the<br />\nsource<br />\nof waste. \"Labor is regular- Kappa Psi; 8.15, Sigma Tau Delta;<br />\nsecond meeting of the University<br />\nTwo weeks ago at the Randolph- Four sophomores are willing to enly<br />\nwasted<br />\nthrough employment 8.30, Tau Alpha Phi;<br />\nter the contest at the present time.<br />\n8.45, Alpha<br />\nSupper Club was addressed by Mr.<br />\nMacon game there was quite an imupon<br />\ngoods<br />\nthat<br />\nhave the shortest<br />\nFour colleges have asked for de- Dr. Rice Addresses<br />\nPaul Meng, General Secretary of<br />\nMu Tau; 9.00, Phi Alpha.<br />\nprovement in the attendance in the bates. All letters have been anCarrol Club the Chinese Student Christian As- possible life, in order to secure<br />\nquick turnover and high profits;<br />\ncheering section. Improvement also swered. There is a possibility that<br />\nWednesday, November 13<br />\nThe Carrol Club of Johns Hop- sociation of the United States. Mr. but from a social point of view any<br />\nwas quite evident in the playing of some very important debating teams kins University met last Sunday at Meng spoke on the Migration of<br />\nfailure to make the best product<br />\n12.20, NEWS-LETTER; 12.30, Hulthe team, in that they won their first will visit Homewood this fall.\"<br />\n2.30 P. M. in Room 109 of the M. Chinese to the United States and possible is sheer social waste.\" Frelabaloo; 12.40, Y. M. C. A.<br />\nFollowing the report of the secre- E. Building. An aggregation of the results of the contacts made.<br />\ngame this season. It is sincerely<br />\nquent changes in style and the protary, a letter of resignation from the about sixty including many .students<br />\nThe speaker stated that there are<br />\n7.00, Beta Theta Pi; 7.15, Alpha<br />\nhoped that the unenthusiastic freshCouncil of L. Stanton was read. of Notre Dame, Goucher, and other now over 2800 Chinese students in duction of an excessive number of<br />\nmodels, varieties, and styles of Tau Omega; 7.30, Phi Epsilon Pi.<br />\nmen and the rest of the student body The Council then voted Paul Spear,<br />\nColleges as well as the Hopkins 183 Universities of the United goods were mentioned as other<br />\nwill come out in force to back up of the Class of 1930, to the Counmen. John M. Cooper, professor Mr. Meng emphasized the fact, evidences of wastage in production.<br />\nThursday, November 14<br />\nthe team and help them put over cil. Spear has been chairman of<br />\nof Socialogy at the Cttholic Uni- that, among the Chinese, Johns<br />\n12.20, Barnstormers; 12.30, Black<br />\nThe high cost of salesmanship,<br />\ntheir second victory. The band is his class debating team for three versity at Washington, was schedul- Hopkins ranks among the first of<br />\nnow prepared to play at the game consecutive years. The Council ed to address the group on the \"Ori- American Universities. In closing he cross-hauling, inadequate market- and Blue Jay; 12.40, The Cotillion<br />\nwishes to state that all men who gin and History of Religion\", but expressed a desire for greater ing facilities, and the duplication of Board and the Debating Council.<br />\nand the whole cheering section<br />\nshow a willingness to cooperate with was unable to attend, so Dr. Rice of friendship and good feeling between retail stores were mentioned as the<br />\nshould be filled.<br />\n7.30, Tau Alpha Omega; 7.45,<br />\nthe council in their forensic activ- the Chemistry department of this America and China, through the chief causes of waste in distribuities<br />\nover<br />\nany<br />\nperiod<br />\nof<br />\ntime<br />\nwill<br />\nSigma Delta; 8.00, Pi Lambda<br />\ntion.<br />\nPhi<br />\ncontacts<br />\nmade by the students.<br />\nThe line-up of the team will be<br />\nUniversity took his place and spoke<br />\nbe honored by election to the Coun- to the club on the subject of the<br />\nThe<br />\nmusical program consisted<br />\nthe same as last week unless some<br />\nThe waste of natural resources Phi; 8.15, Charles Carroll Club.<br />\ncil.<br />\nof the singing of Hopkins songs led<br />\n\"Origin<br />\nReligion\".<br />\nof<br />\nthe<br />\nEnglish<br />\nunforseen accident should happen<br />\nThe Sophomore Debating team In a fine talk he brought out the by Carl Lausch at the piano and a was declared to be the fourth great<br />\nFriday, November 15<br />\ncategory of waste. \"Half our coke<br />\nin the meantime. The team is out consists of Chairman Yudkin, Secconttoversy between Pratesea0t- violin duet by the Misses Mary and is still made in the inefficient bee12.20, Junior Class; 12.30, Sophto pull down a victory this week and ond Constructive Orator Back, and ism and Catholicism.<br />\nNellie Bagwell, accompanied by<br />\nomore Class; 1.40, Freshman Class.<br />\n(Continued on page 4 column 4<br />\nMiss Janette Williams.<br />\neveryone should be behind them.<br />\n(Continued on page 3 column 4)<br />\n(Continued on page 4 column 4)<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 8, 1929<br />\n<br />\n2<br />\n<br />\nTIIEJOINSHOPKINSIIEWSIETTER INTERCOLLEGIATE<br />\nA contribution to the Arts and<br />\nFOUNDED 1897<br />\nSciences from the McGill Daily:<br />\n\"The men students of Rochester,<br />\n$2.00 being of the opinion that the socialSubscription<br />\nly-minded students waste much<br />\nEntered as second-class matter Oecember 3, 1909, at the Postoffice in Baltimore,<br />\ntime through \"blind dates,\" have<br />\nMd., under the Act of Congress November 3, 1879.<br />\nevolved a scheme for the interof knowledge concerning cochange<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins<br />\nUniversity.<br />\neds and their ways.<br />\n<br />\nThe carefully thought out code<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING EDITOR ; for this interchange of knowledge<br />\nother communications to the EDITOR-IN-CHIEF.<br />\nconsists of the following one-letter<br />\nUniversity 0100<br />\n<br />\nTelephone<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\nGEORGE GUMP,'30<br />\nManaging Editor<br />\nROBERT S. BAIRD, '30<br />\n<br />\nclassification: A, average; B, beautiful; K, kisses; L, liberal; M, mercenary; P, pippin; R, rough; T,<br />\ntells; V, vivacious; X, expensive;<br />\nwhile the letter Y signifies the unknown quantity.<br />\n<br />\nNEWS<br />\n<br />\nIn a report of his which was read<br />\nat Levering Hall by J. W. Day, Dr.<br />\nDoran criticized the \"halo placed<br />\nabout drinking and wild parties by<br />\nolder men and alumni\" claiming this<br />\nencouraged the younger men to<br />\ndrink and accept it as a part of university life.<br />\n<br />\nDean Berry disapproved of the<br />\nsensational statements made in this<br />\nconference, about drinking in college, as it creates a wrong impression about life in the University. He<br />\nsaid that he would have disapproved<br />\nif there had been a wet conference<br />\nwhich had cited such extreme cases.<br />\nDrinking, according to the dean, has<br />\ndecreased in the last two or three<br />\nyears not only here but at most colleges.<br />\n<br />\nWarner & Company<br />\n•<br />\nHats<br />\nClothing<br />\nand<br />\n<br />\nFurnishings<br />\nfor<br />\n<br />\nGentlemen<br />\n•<br />\n<br />\nWith the telephone directory<br />\nduly annotated in accordance with<br />\nAssistant Managing Editors<br />\nDr. French although agreeing<br />\nRICHARD HUNT,'31 GEM GE DOWELL,'31<br />\nthis arrangement, there is evidently<br />\nDean Berry in his disapproval<br />\nwith<br />\nno reason why any student should<br />\nAssociate Editors<br />\nthe<br />\nof<br />\nsentational statements, thinks<br />\n'30<br />\nSPEAR,<br />\nPAUL<br />\n'30<br />\n18 and 20 E. Baltimore Street<br />\nSIDNEY WOLK,<br />\nspend a dull evening.\"<br />\nthat this convention was fasicly<br />\nJunior Editors<br />\n* * *<br />\ngood. According to him, the purpose<br />\nPURNELL HALL,'30<br />\nSTEWART L. SMITH, '30<br />\nHARWOOD F. MULLIKIN, JR.,'30 ROWLAND McD. NESS, '32<br />\nThe University of Kentucky of the meeting was to crystaliz.e<br />\nNATHAN M. HARRIS, '32<br />\nFRANK CONE,'31<br />\nSYLVAN LEBOW, '32<br />\ncertainly ranks. Cecil B. DeMille is thinking about the prohibition of<br />\nGEORGE TRATTNER, '30<br />\nto select sixteen most beautiful girls drinking, the obedience due it, and<br />\nBUSINESS DEPARTMENT<br />\nUSED<br />\nNEW<br />\nfront forty-five candidates for the its enforcement. He says that disGus BURK, '31<br />\npolitical<br />\nor<br />\non<br />\ncussions<br />\nsociology,<br />\nbeauty section of the Kentuckian.<br />\nCirculation Manager<br />\nAdvertising Manager<br />\na wholesome sign beare<br />\nsubjects<br />\n'30<br />\nGULLEY,<br />\nLYLE<br />\nSADLER ROBERTSON, '31<br />\n* * *<br />\ncause it shows that the students are<br />\nOffice Manager<br />\nof the problems of life<br />\nthinking<br />\nreof<br />\nHealth<br />\nBoard<br />\nThe<br />\nKansas<br />\nALviN BLum,'30<br />\nof<br />\nnot<br />\nhaving a good time.<br />\nand<br />\nrules<br />\n'32<br />\nfollowing<br />\nthe<br />\npassed<br />\nSaunders,<br />\ncently<br />\nHenry V.<br />\nSIDNEY RAFEL, '31<br />\n'31<br />\nFleishman,<br />\nTheodore<br />\ngovern<br />\nshould<br />\nsay<br />\nthey<br />\n'32<br />\nSykes,<br />\nwhich<br />\nDavid S.<br />\nEconomists, according to the<br />\nBaltimore, Md. Kissers:<br />\nHopkins librarian all agree that proProduced by the R. L. Polk Printing Company 1930 Clifton Ave.,<br />\n\"Never kiss in crowded places or<br />\nhibition is benefiting not only the<br />\na poorly ventilated room, but if you<br />\nTHE BACKUS MOTOR COMPANY<br />\ncountry at large but also the colmust kiss, take a hot mustard foot<br />\nleges. The Y. M. C. A. by promotbath and avoid drafts in case you<br />\n10-20 E. North Avenue<br />\ning conferences of this sort is dofeel \"all in\" afterwards. Guard<br />\ning a great deal in assisting the stuVernon 4300<br />\nagainst sudden changes in temperadents to form opinions on matters<br />\na<br />\nin<br />\nKissing<br />\nkissing.<br />\nwhen<br />\nture<br />\nTHE \"Y\" PERFORMS<br />\nof public importance.<br />\n,<br />\ncoat one minute and in<br />\ncoon-skin<br />\nO the more enlightened members of this intellectual guild of ours,<br />\nlighter apparel the next is extremely<br />\nthe spectacle put on last week-end by the Johns Hopkins Y. M.<br />\n1 angerous. Don't kiss any person<br />\nC. A. is an unpardonable and unforgivable performance under the<br />\n,<br />\nwho has chills and fever. At a party<br />\nwouldof<br />\ngroup<br />\na<br />\nProhibition,<br />\nof<br />\nguise of an inquiry into the status<br />\n, here postoffice and similar games<br />\nand<br />\nthemselves<br />\nof<br />\nfools<br />\ncomplete<br />\nmake<br />\nto<br />\nproceeded<br />\nintelligensia<br />\nbe<br />\n; re played, be sure to gargle freto bring censure on the University itself from the liberal, though<br />\nperhaps overly fervent editorial columns of the Sunpapers.<br />\nitiently.\"<br />\n(<br />\nWe hold no brief for the opponents of free speech who would<br />\nWhat optimism !<br />\nprevent the expression of ideas however foolish, but there is a time<br />\nfor<br />\nplace<br />\nno<br />\nis<br />\nbroadmindedness!<br />\nWhat<br />\ncampus<br />\nHopkins<br />\nand place for everything and the<br />\nbelong<br />\nshould<br />\nnow<br />\nthat<br />\nproblem<br />\na<br />\non<br />\ndiscussions<br />\nmoralistic<br />\npseudo<br />\n* * *<br />\nonly to the Tennessee anti-evolutionists and other no less simple folk.<br />\nThree frat houses were robbed of<br />\nThis University has always encouraged the growth of new ideas, and<br />\n$233 and jewelry at the Ohio State<br />\nhere illustrious names have lived furthering the knowledge of mankind. The Y. M. C. A. profanes the institution which gives it a home<br />\nUniversity. Any man that can<br />\nwhen it permits a group of professional reformers to engage in any<br />\nscrape up $233 in only three frat<br />\nsuch farce as was put on last week.<br />\nhouses is a genius and certainly dethe<br />\nwhy<br />\ndiscuss<br />\nto<br />\ntogether<br />\nserves his money.<br />\nThat supposedly serious people can get<br />\ncollege girl drinks gin and other similar philosophical problems is<br />\n* * *<br />\nnothing short of farcical. Yet in the face of this we learn that the \"Y\"<br />\nThe annual Disc Rush of Brookis going to promote other such useful conferences in the future. Dr.<br />\nand<br />\nhelpful<br />\nare<br />\nlyn<br />\nPoly began with a Frosh snakediscussions<br />\nJohn C. French says he believes such<br />\nuplifting<br />\nand<br />\nuseful<br />\nas<br />\nabout<br />\njust<br />\nare<br />\nthey<br />\nYes,<br />\nencouraged.<br />\ndance, the yearlings chanting gleeshould be<br />\nas the most fanatical evangelical meeting ever conducted by Aimee<br />\nfully in anticipation of a desired<br />\nSemple McPherson. Prohibition requires no discussion. No people<br />\nand imagined triumph. The dancever has been or ever will be made moral by law. Of course, Dr.<br />\ners were made to appear ridiculous<br />\nDoran, a professional Prohibitionist, whose job is dependent on<br />\nby being attired in a variety of outProhibition, is interested in converting the young people of the naf-date costumes. After the frenzied<br />\no<br />\ntion to his cause. His job depends on the success of this attempt.<br />\nOF RECENT ARRIVAL<br />\nwhich was held in a steady<br />\ncontest,<br />\nThat the \"Y\" should provide an opportunity for professional retune<br />\nthe<br />\nto<br />\nemerged<br />\nSophs<br />\nrain, the<br />\nformers to spread their gospel detracts from what little respect this<br />\na 55-26 wash-out of their tradiof<br />\nA TAILORED PRODUCT OF CERTIFIED CORRECTorganization still holds in the eyes of outsiders.<br />\ntional enemies. It was then the<br />\nNESS. FOR USAGE L'Y COLLEGE MEN WHO REThe question narrows down to determining the actual place of the<br />\nSophomores' turn to do a snakeY. M. C. A. on this campus. We believe without qualification that<br />\ndance which was performed at their<br />\nSPECT A BRACING STYLE AND FINE EXECUTION.<br />\nthe \"Y\" should have only one function; namely, to provide the<br />\nsmoker.<br />\nannual<br />\nseek<br />\nstudents with a building such as Levering Hall where they may<br />\n***<br />\nrecreation amidst pleasant surroundings. Any other activities which<br />\nSEVEN TO TWENTY<br />\nit has undertaken belong strictly to the Church and have absolutely no<br />\nCommissioner Doran, U. S. Dry<br />\nDOLLARS<br />\nplace on a liberal University campus.<br />\nChief, in his address here, claimed<br />\nWe are no unmoral lot; we do not need to have religion thrust at<br />\nthat 30 years must pass before the<br />\nus. As a part of Hopkins, the \"Y\" must not violate the high<br />\nAGENTS IN THE PRINCIPAL CITIES OF THE UNITED STATES<br />\nbenefifits of prohibition can be<br />\ntraditions of the University. Religious conferences are harmless and<br />\njudged, pointing out that only 10<br />\ninterest a very small percentage of the student body. Such displays<br />\nyears had elapsed since the passing<br />\nas last week's, however, are definitely detrimental, cause only harm,<br />\nof the Volstead Act. His subject<br />\nand reflect discredit on the institution which permits itself to allow<br />\nthem. We trust that the University at large agrees with Dean Berry<br />\nwas \"What Prohibition is Doing<br />\nin deploring the holding of useless discussions on questions which<br />\nto Us.\"<br />\nare purely a matter of individual tastes. If flappers drink because<br />\nathletes do, that should not provide serious people with an opporAccording to Dr. Doran, liquor<br />\ntunity for a \"gab fest.\" Such problems belong in the comic columns<br />\nsmugglers and their bases have been<br />\nof the Jay.<br />\ndestroyed and rum row abolished<br />\nWe have always deplored the fact that the Y. M. C. A. was ever<br />\nand that since ease of access is lesallowed to entrench itself on the Hopkins campus. The national<br />\nsened consumption has decreased.<br />\norganization, in many respects, occupies a similar low level with<br />\nHe claims that a review of the 10<br />\nWILL BE FOUND HERE<br />\nthe Methodist Board of Public Morals. When our local branch peryears' accomplishment will make us<br />\nmits the staging of Prohibition conferences and then reaffirms its<br />\nEXCLUSIVELY<br />\nintention of holding gatherings of similar nature in the future, we<br />\noptimistic in the prediction of our<br />\ncan only utter our hearty disapproval. The group who acted to foreadvance.<br />\nstall the erection of Levering Hall last year was perhaps wise. They<br />\nforesaw the profanation of our campus by paid reformers and moralHe questioned the wisdom of the<br />\nizing, narrow, religious leaders. A wonderful place as is the new buildShepard bill saying that it could be<br />\nBALTIMORE & HANOVER STS.<br />\ning, the organization which made it possible deserves no praise if it is<br />\nbetter decided by the next generato use the building in such a manner.<br />\ntion who will decide the fate of all<br />\nprohibition.<br />\nP. W. S.<br />\n<br />\nFORD<br />\n<br />\nAutomobiles<br />\n<br />\nEDITORIALS<br />\n<br />\n„<br />\n<br />\nT<br />\n<br />\nISAAC HAMBURGER & SONS<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 8, 1929<br />\n<br />\nDORM DOINGS<br />\n<br />\nTHROUGH THE TUNNEL<br />\nIf we can shoot our column<br />\nthrough the tunnel anywhere nearly<br />\nas effectively and interestingly as<br />\nJohn 0' Ren rolls his Down the<br />\nSpillway, we shall be more than<br />\nsatisfied.<br />\n<br />\nDEBATING COUNCIL<br />\n(Continued on page 1 column 2)<br />\n<br />\nOrator of Rebuttal Getting. The<br />\ning meals immediately following<br />\nFreshman Debating team consists<br />\nthe first course of soup. The<br />\nChairman Leo M. Alpert, Second<br />\nof<br />\nof<br />\ndepths<br />\nstroll<br />\ninto<br />\nthe<br />\nwaiters<br />\nOrator Cyrus C.<br />\nConstructive<br />\norganize<br />\nthe kitchen and evidently<br />\nT requires trained experts<br />\nOrator<br />\nof Rebuttal S.<br />\nYoung,<br />\nJr.,<br />\na game of poker or take a nap while<br />\nwith wide experience and specialRaymond Dunn, Alternate Milthe starving inmates are being torn<br />\n* * *<br />\nized knowledge to determine the<br />\nstone, and Secretary Ney.<br />\nby the pangs of hunger. During<br />\nnoticea that when<br />\noften<br />\nhave<br />\nWe<br />\nwill<br />\ndebate<br />\nThe<br />\ntopic<br />\nfor<br />\nthis<br />\nthis torturous process, the diners<br />\nsound value of an investment.<br />\nstudent walks alone, be, Resolved: That Installment<br />\ndeem it necessary to clash silver-(?) a graduate<br />\nparticularly through the library to Buying Is Detrimental to American<br />\nware and make other noises of suffifrom the stables, he usually Business.<br />\nand<br />\ncient volume to warn the kitchen<br />\nwears<br />\nan abstract and distant look.<br />\nthat it is time to deal the last hand<br />\nseeker,<br />\noften the scholastic<br />\nThis<br />\ncm to take a last nap. Several eons<br />\nappears to be<br />\nobserver,<br />\nideal,<br />\nto<br />\nan<br />\nSecurity value—earning power and possibil- THE later the food begins to appear from<br />\nremoved<br />\nfar<br />\nenveloped<br />\nin<br />\nthoughts<br />\nities of enhancement or depreciation in value<br />\nthe depths, it is then that the cheerMAIL BAG<br />\nroutine<br />\nof<br />\nlife.<br />\nordinary<br />\nfrom<br />\nthe<br />\nover a period of years, must all be thoroughly<br />\ning begins. Upon the appearance<br />\nnothing mundane<br />\nthink,<br />\nSurely,<br />\nwe<br />\nanalyzed.<br />\nof the first tray of nourishment, a<br />\nICE CREAM<br />\nrousing \"Locomotive\" is given as characterizes his mental processes.<br />\nSince the house was established, Gillet &<br />\nwhat we<br />\nthe platter is unloaded, followed by And yet, after hearing<br />\nTo the Editor of the<br />\nCompany has always emphasized the impora hearty \"Fight, Team, Fight\" as have from one former well-known<br />\nNEWS-LETTER,<br />\ntance of specific, dependable information and<br />\ngraduate student in foreign lanthe<br />\nbearer<br />\nof<br />\nfood<br />\ndives<br />\ninto<br />\nthe<br />\nhas made it a policy to apply this principle to<br />\nThese gracious acts seemed to<br />\nguages, we no longer maintain this Dear Sir:<br />\nkitchen<br />\nfor<br />\nanother<br />\nround<br />\nof<br />\nraits investment offerings.<br />\nrevive the idea that there might be<br />\nopinion. Now when we see a gradutions.<br />\nIt is my painful duty to call puba Santa Clause after all and several<br />\nate student—say he is one in the<br />\nWe offer to conservative investors a broad<br />\nAfter the expiration of precisely Romance Languages—with a con- lic attention to a regretable inciinmates were hoping that a similar<br />\nof safe, thoroughly investigated securities.<br />\nlist<br />\noccurred.<br />\nThe<br />\nrecently<br />\nhas<br />\ndent<br />\nthat<br />\nreplacement of the furniture would 17 minutes, the \"Graveyard\" tune is templative look, we argue that his<br />\nInvestors<br />\nwho consider safety, marketability,<br />\nCosmopolitan<br />\nof<br />\nthe<br />\nmeeting<br />\nlast<br />\ntake place during the year. How- struck up which usually precipitates thoughts are running in such a<br />\nand a steady income of the first importance,and<br />\never, the explanation of these phi- the entire dining-room force into manner: Shall I stay home and Club was held on the same evening<br />\nprofitably make their selections from our offerCotillion.<br />\nAs<br />\nis<br />\nHallow'een<br />\nthe<br />\nas<br />\nlanthropic moves came with the the hall, and after three long perhaps uncover a few more lice in<br />\nWrite, without obligation, for our latest<br />\nings.<br />\nCosmopolitan<br />\nthe<br />\nwith<br />\ncustomary<br />\ndawn of another day and bills in ‘'yeas,\" all fall to eating the delayed French Literature of the Twelfth<br />\nofferings.<br />\nof<br />\nlist<br />\nfor<br />\nprovided<br />\nwas<br />\nice<br />\ncream<br />\nthe various mail-boxes for \"mate- dinner and silence ensues for the Century or shall I take out that hot Club,<br />\nits members and guests. In the<br />\nrial\" and \"services rendered.\" The remainder of the time. When the date I just heard about?<br />\ncourse of distributing this delicacy,<br />\nmighty air castles of the third floor gastronomical desires have been<br />\n* * *<br />\none of the young men behind the<br />\ndenizens were converted again into fulfilled, the revellers leave the hall<br />\ncounter noticed that four harlequin<br />\nthe form which they originally pos- one by one with sufficient strength<br />\nUp until lately, we never put any<br />\nBANKERS<br />\nblocks had disappeared. Two of<br />\nto<br />\nendure<br />\nuntil<br />\nthe<br />\nmorning<br />\nof<br />\nthe<br />\nsessed, hot air.<br />\ncredence in what appeared to us as<br />\nfollowing day.<br />\nF. R. G. stock comic material, the idea that these blocks were perceived to be<br />\nLIGHT & REDWOOD STS.<br />\nWailings and cries of utter disin the relentless grip of a number of<br />\nBALTIMORE, MD.<br />\npeople engaged in dangerous and<br />\n* * *<br />\ntress, intermixed with outbursts of<br />\nyoung men attending the Cotillion<br />\nimportant tasks voluntarily allowed<br />\nw rath, fill the building and plunge<br />\nTelephone PLaza 9060<br />\nPandemonium reigns supreme<br />\ndance who refused to return the<br />\ntheir<br />\nattentions<br />\nto<br />\nbe<br />\ndiverted.<br />\nFor<br />\nthe inmates into absolute distress.<br />\nseveral times weekly at the Dorms.<br />\nice cream or to pay for it. We reWASHINGTON, D. C. PHILADELPHIA, PA. WILLIAMSPORT, PA.<br />\ninstance, certain well-known humorPerhaps they will eventually disUnder the corroding influence of<br />\nquest the Cotillion Board to give<br />\nBIRMINGHAM, ALA.<br />\nEASTON, MD.<br />\nous magazines will print a cartoon<br />\ncover the necessary finances for the<br />\nthe bad boys of \"B\" entry, the young<br />\nthis matter the consideration it dedepicting an aviator performing<br />\nrepair work, but it is likely to be<br />\ninnocents of the other sectors are,<br />\nserves.<br />\nperilous manoeuvers at the same<br />\nmany moons in the future, as may<br />\nalas! revealing the fatal and unmistime nonchalantly, carrying on a<br />\nCOSA,<br />\n'<br />\n0' POLITAN<br />\nwell be appreciated by anyone who<br />\ntakable signs of degeneration into<br />\ncommonplace conversation with his<br />\nchances to he acquainted with any<br />\na company of brawling disturbers<br />\ncompanion. Or a sketch of a steelof the roomers. Maybe the next<br />\nof the nocturnal tranquility. One<br />\nworker walking along a beam at<br />\ndonation to the University will conwell-wishing pacifist has even been<br />\na height of 40 stories who will call<br />\ntain an item to cover the costs, and<br />\nobliged to suggest a partial remedy<br />\ndown to a fellow laborer below him,<br />\nthus relieve the debtors of their unfor the existing state of affairs ; this<br />\n\"One on rye, and don't fergit de<br />\nfortunate position.<br />\nwould consist of the medieval<br />\nAlong , with the latest choatic method of curbing feudal warfare, mustard\" is often seen.<br />\nevents, came the development of that of banning all fights between<br />\nLately, we have been led to be4<br />\n, f?-moi<br />\ncheering the waiters of the dining Wednesday evenings and Monday lieve that the magazines are not so<br />\nroom into greater activity. For this mornings. Even the mere consider- wrong. A friend at a medical<br />\npurpose, a regular rooters' section ation of such a radical proposal school tells us that one of the docis being formed among the fresh- would, however, meet with de- tors had to perform what undoubt*<br />\nmen. This particular activity is termined opposition on the part of edly seemed to be a very critical<br />\nconfined almost entirely to the even- the belligerent \"B\" boys.<br />\noperation. And from the time that<br />\nthe surgeon made the first incision<br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nOne of the favorite methods of to the end, he carried on a conversaPossible to Us\"<br />\nwarfare is, as is doubtlessly known, tion with the first assistant nurse.<br />\nTHE RELIABLE WEAVING CO.<br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nthe simple expedient of emptying He started off by saying :\"That reDamages Made Perfect<br />\nWE<br />\nALSO<br />\nREPAIR<br />\nSILK<br />\nDRESSES<br />\ncontainers of the dangerous chemi- minds me, have you seen R. U. R.<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\ncal H. 0, upon the capital ex- at Ford's yet?\"<br />\nBaltimore, Md.<br />\ntremities (a term which we heartily<br />\n* * *<br />\nRIDE IN<br />\nrecommend to some ambitious compiler of a dictionary of the future)<br />\nEvery once in a while, it might<br />\nof some unfortunate inhabitant of be noticed, that the newspapers will<br />\nany section of the hall. And, since run an article with a title implying<br />\nSTAND AT HOMEWOOD<br />\nall is fair in love and war, (inci- that there is nothing new under the<br />\nFIELD<br />\ndentally, no love is wasted between sun. And then the article will probNO CHARGE FOR<br />\nthe<br />\nentries) some of the more ably say that rouge was used in the<br />\nEXTRA PASSENGERS<br />\noriginal<br />\nand inventive of the intra- Fourth Century, or that the Eliza(2-3-4 or 5 MAY RIDE FOR<br />\nTHE PRICE OF ONE)<br />\nmural contestants have hit upon the bethans wore sun-back dresses, or<br />\nPHONE:<br />\nquite effective device of filling the<br />\nthat a type of airplane was first disfire extinguishers with hot water covered during the Neolithic age.<br />\nand proceeding to discharge the If we may be allowed to, we should<br />\ncontents on the unfortunate victims like to indulge in one of these \"nothf the mutually fatal fratricidal. ing new, etc.\"<br />\nWERGLEY'S<br />\nstrife.<br />\n2438 Charles St., North<br />\nHere of late we have been reading<br />\nLa Patisserie<br />\n* * *<br />\nof Macaulay's works. Among<br />\nsome<br />\nSANDWICHES PAR EXCELLENCE<br />\nessays, we also perused<br />\nmany<br />\nhis<br />\nAnd, hush! breathe it not to the<br />\nAddison. Macaulay, it<br />\non<br />\none<br />\nthe<br />\nscandal-loving world, but it has<br />\nwas famous for<br />\nremembered,<br />\nbe<br />\nwill<br />\nbeen rumored that Section II of<br />\nPhone HOmewood 7908<br />\nhe lent his<br />\ntinge<br />\nhistorical<br />\nthe<br />\nBirely's Pharmacy the Alumni Memorial Hall Code works and his facility for, and yet,<br />\nhas already been violated. (What<br />\nST. PAUL at 33rd STREET<br />\nis<br />\nthe younger generation coming interesting method of including<br />\nYour Neighborhood Drug Store<br />\nmany minute and personal details.<br />\nto?)<br />\nPRESCRIPTIONS<br />\nAt one point in his discussion of<br />\nIncidentally, as the required four Addison, Maculay remarks that<br />\nSchool Supplies, Candy,<br />\nTrying to pilot a plane without compass progress does not come in that way.<br />\nCigars<br />\nweeks have elapsed since the last Addison had been greatly impressed<br />\nFortunately most men have a natural<br />\nor other instruments is as unsatisfactory<br />\nUnexcelled Fountain<br />\noccasion, it is now time for the by a certain Countess, and that this<br />\nService<br />\nas trying to pilot your course through aptitude for one type of work rather<br />\nimpression was partly evident \"in<br />\nthe<br />\ndrinking<br />\nDorms<br />\nto<br />\nglasses<br />\nof<br />\nthan another—for things mechanical<br />\nMake Our Store Your Store<br />\nlife without a plan.<br />\nsome lively lines written (by Addireceive their periodic washing.<br />\nYou find many a man after college or artistic, factual or imaginative. The<br />\nson) on the glasses of the Kitcat<br />\nsolution of the problem is to<br />\nswitching from job to job —\"I<br />\nClub.\"<br />\n<br />\nSeveral weeks past the residents<br />\nof the upper levels of the Alumni<br />\nDormitory had slight difficulties<br />\nwith their lighting system and petitioned the gods of the power house<br />\nto have compassion on them and<br />\ndraw them forth from the darkness.<br />\nAccordingly this request was fulfilled and with seeming great goodwill. For numerous days electricians were busy entering rooms and<br />\nabsconding with all the wiring that<br />\ncould be taken from all types of<br />\nfixtures. However, they soon returned and replaced the purloined<br />\nwire with another variety in which<br />\nthey were certain there were no defects and proceeded to connect the<br />\nlamps of the entire floor with new<br />\nshiny cord.<br />\n<br />\nI<br />\n<br />\nG ILI—Er & CO.<br />\n<br />\nYELLOW<br />\nCABS<br />\n<br />\n•<br />\n<br />\nVernon 1212<br />\n<br />\n••,;.•<br />\n<br />\nNo compass to guide him<br />\n<br />\nAfter the Dance<br />\nST. IUCCIIS<br />\n8 -17 North Charles Street<br />\n<br />\nAt this point let us add that it<br />\nwas reputed generally that Addison's only fault was his intemperance in drink. We say this to correct the idea that certain collegians<br />\nwho were present at the sophomore<br />\nbanquet last spring at the Kit Kat<br />\nmight have hastily formed.<br />\nBy \"D'ORSAY\"<br />\n<br />\nthink I'll try fiction writing for a<br />\nwhile,\" or \"Selling bonds is what<br />\nappeals to me.\" Aimless! Real<br />\n<br />\nbe found in self analysis, making a decision and then following through.<br />\n<br />\n1ecitric<br />\nIINCE<br />\n<br />\n1882<br />\n<br />\nMANUFACTURERS<br />\n<br />\nFOR<br />\n<br />\nTHE<br />\n<br />\nBELL<br />\n<br />\nSYSTEM<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 8, 1929<br />\n<br />\n4<br />\n<br />\nDR. RICE ADDRESSES<br />\n<br />\nDr. Chesney Named<br />\nMedical School Head<br />\n<br />\nILG ER9S<br />\ncAN DW I CH<br />\ncfliOPS<br />\n<br />\n\"Where we all meet<br />\nafter the big game\"<br />\nUP-TOWN SHOP<br />\n<br />\nDOWN-TOWN SHOP<br />\n<br />\nNorth & Charles<br />\n<br />\nCalvert & Fayette<br />\nOPEN ALL NIGHT<br />\n<br />\n15c First Quarter Mile-5c Each Additional Quarter Mile<br />\n<br />\nCENTURY CAB CO.<br />\n1718 N. CHARLES STREET<br />\n<br />\nVERNON 7002<br />\nWe are promoting the cab business from an expensive luxury<br />\nto an economical necessity<br />\n<br />\nLIGHT<br />\nCOLORFUL<br />\nWA RM<br />\nRY<br />\n<br />\n4-)\"1<br />\n11<br />\n<br />\nIn any event<br />\nwear an<br />\n<br />\nALLmcarircma<br />\nLET rain, wind or chill sweep the field—you're dry and<br />\n<br />\nwarm. Smartly dressed,too! Expertly styled in a wide range<br />\nof distinctive colors. For men and women, $7.50 to $25.<br />\n<br />\nNew:<br />\n<br />\nTHE ALLIGATOR COMPANY, St. Louis<br />\nProtect trouser legs—all colors to match all coats.<br />\nALLIGATOR (Pat.<br />\nAsk to see them.<br />\nSTEPPER S App.for) $2 and $3.50 a pair.<br />\n<br />\nKEEP<br />\n<br />\nDRY<br />\n<br />\nFROM<br />\n<br />\nHEAD<br />\n<br />\nTO<br />\n<br />\nFOOT<br />\n<br />\nDr. Alan M. Chesney was named<br />\ndean of the Johns Hopkins Medical school by the trustees last Monday. He took over his new duties<br />\nHe succeded Dr.<br />\nWednesday.<br />\nLewis H. Weed, who held this position for two successive terms or<br />\nsix years.<br />\n<br />\n(Continued from page 1 column 3)<br />\n<br />\nAfter Dr. Rice's talk a social<br />\nmeeting lasting an hour was held,<br />\nat which important business was<br />\ntransacted. The next meeting of the<br />\nCarrol Club is scheduled for Sunday, Nov. 17.<br />\n<br />\n\"All Over But The Shouting\"<br />\n<br />\nThe former dean will continue<br />\nLIBERAL CLUB<br />\nhis association with the Medical<br />\n(Continued from page 1 column 5)<br />\nSchool, serving as liason officer<br />\nbetween the public and the school. hive oven, which allows the gasses,<br />\nup in<br />\nHe will devote most of his time to the oils, and fertilizers to go<br />\nspeaker<br />\nsaid.<br />\n\"Our<br />\nsmoke,\"<br />\nthe<br />\nhis specialty, which is anatomy.<br />\nwater-power resources are as yet<br />\nThe new dean entered Hopkins largely undeveloped, while ineffiin 1904. He took his Bachelor of cient mining methods leave half our<br />\nArts degree four years later and his coal in the mines. Our forests are<br />\nMedical degree in 1912. He served ruthlessly destroyed, though it is<br />\nas an associate in Medicine at Wash- possible so to cut timber that the<br />\nitVton University St. Louis, for annual growth will equal or about<br />\nfour years. He returned to Hop- equal the annual cut. The waste<br />\nkins in 1921 and served there in in our fisheries has been enormous,<br />\na similar capacity.<br />\nso that our supply of many valuDr. Chesney has been assistant able fish is becoming smaller and<br />\ndean of the Medical School for sev- smaller.\"<br />\neral years. In connection with this<br />\noffice he was associated with the entire faculty of the school. His appointment was therefore regarded<br />\nas the logical and popular one.<br />\nThe period, under the administration of Dr. Weed coincided with<br />\none of the most active periods of<br />\nexpansion that the Medical School<br />\nhas known. Because of his excellent work, the trustees wished him<br />\nto serve as a. consultant.<br />\n<br />\nSays Tubby Powell<br />\nTo The Juniors<br />\nwhen they ask him about footwear—and he straightway leads them to the Barn and shows 'em snappy<br />\nHess shoes that will knock any junior's eye out!<br />\n<br />\n$6.50 up<br />\n<br />\nN. HESS' SONS<br />\n8 E. Baltimore Street<br />\n<br />\nMEMBERS FLORISTS TELEGRAPH DELIVERY<br />\n<br />\nJ. A. RITTER & SON<br />\nFlorist's and Decorators<br />\nBALTIMORE, MD.<br />\n<br />\n1918 NORTH CHARLES ST., Near 20TH<br />\n<br />\nThe speaker also mentioned some<br />\nof the social evils that flow from<br />\nour economic system, such evils as<br />\nlong hours of toil, monotony, worry,<br />\nchild labor, illiteracy, crime, imperialism and war.<br />\n<br />\n\"We eliminated waste and set up<br />\na fairly intelligent control of industry in order to kill Germans and<br />\nwin the war. What we should do is<br />\nto organize industry intelligently in<br />\norder to combat ignorance, poverDuring the time when the select- ty, and disease, and to increase hapion of a successor to Dr. Frank J. piness and raise the standard of<br />\nGoodnow, president the Hopkins living.\"<br />\nThe Liberal Club meets in Room<br />\nUniversity was under discussion, the<br />\nC,<br />\nLevering Hall, every Monday at<br />\nname of Dr. Weed was one of the<br />\nmost prominently mentioned as that 1 P. M. Everyone interested is invited to attend.<br />\nof a possible successor.<br />\n<br />\nASSOCIATION<br />\n<br />\nPhone: VErnon 0573<br />\n<br />\n•<br />\n<br />\nAI<br />\n.IVE I<br />\n<br />\n.<br />\n<br />\nouRsELF<br />\n<br />\nNo Deposit Required of Hopkins Students<br />\nCoupes<br />\n<br />\n,.<br />\n<br />\n:,........<br />\n<br />\nRoadsters<br />\n<br />\n..-•::<br />\n„.....„f<br />\n..:•:: ................„....: ..:-::•<br />\n.<br />\n— \"<br />\n<br />\nSedans<br />\n<br />\nBuicks<br />\nFords<br />\nChryslers<br />\nHupmobiles<br />\nChevrolets<br />\n<br />\n,<br />\n:ni:::i:.:::•::::::<br />\n::!....<br />\n.-\"<br />\n,: jel...,<br />\n<br />\nLIGHT AND LOMBARD STREETS<br />\nPLaza 6000<br />\n2402 Pennsylvania Ave.<br />\nLafayette 2000<br />\n<br />\n1725 N. Charles Street<br />\nVernon 4049<br />\n<br />\nBaltimore Concedes Milestone Supremecy<br />\n_<br />\n<br />\nSUITS—CLEANED and PRESSED—$1.00<br />\nPRESSED-35c<br />\n• •<br />\n<br />\nMASTERS • V<br />\nCLEANERS AND TAILORS<br />\n<br />\n3204 Greenmount Avenue<br />\n<br />\nHomewood 8453<br />\n<br />\nCORONA for College<br />\nCORONA leads the world<br />\non these 8 champion counts<br />\nStrongest frame of any portable typewriter—solid one-piece Aluminum, rigidly braced.<br />\n2. SIMPLICITY: Fewer parts than any other standard-keyboard typewriter.<br />\n3. COMPLETENESS: More big-machine features than any other portable typewriter.<br />\n4. EASY TO LEARN: Corona design is the result of 20 years' study of the needs of<br />\nbeginners.<br />\n5. WAR SERVICE: An unequalled record for duration as the official portable of the<br />\nAllied Armies.<br />\n6. POPULARITY: There are over a million satisfied Corono owners.<br />\n7. DURABILITY: Coronas purchased 20 years ago are still giving satisfactory service.<br />\n8. BEAUTY: Graceful in line; exquisitely finished in every detail.<br />\n1.<br />\n<br />\nSTRENGTH:<br />\n<br />\nM. W. LUCY & COMPANY<br />\nBALTIMORE, MARYLAND<br />\n<br />\n104 West Fayette Street<br />\n<br />\nThe topcoats<br />\nof the season<br />\n<br />\nSTETSON CLOTHES<br />\n<br />\nUR goal is to coat you well. Our line is the Stein-Bloch.<br />\n0<br />\nAnd our prediction for the<br />\n<br />\nfor<br />\n<br />\nseason is, \"You'll win style the<br />\nmoment your back tries a Stein-Bloch!\"<br />\n<br />\nCollege OYCen<br />\n<br />\nStein-Bloch Topcoats<br />\n$45 and upward<br />\n<br />\nIsaac Hamburger<br />\n& Sons<br />\nY. M. B. 0. D.<br />\n<br />\nOutfitters to Men and Boys<br />\n<br />\nNationally<br />\n<br />\nJustly<br />\n<br />\nKnown<br />\n<br />\nFamous<br />\n<br />\nMADE FOR YOU<br />\n<br />\nFOUR NORTH HOWARD STREET<br />\n<br />\n\f", "format": "basic_html", "processed": "JAY ELEVEN TO<br />\nMEET SWARTHMORE<br />\nVisiting College Has Veteran<br />\nTeam<br />\nJAYS IMPROVE<br />\nTeam Hopes To Make Late<br />\nSeason Spurt<br />\nNext Saturday, November 9, the<br />\nJohns Hopkins University football<br />\nteam meets Swarthmore College.<br />\nThe game will be played on the<br />\nHomewood field. Dr. Van Orman<br />\nboth hopes and expects the team to<br />\ngo through for their second victory<br />\nof the season.<br />\nThe Swarthmore team will be<br />\npractically the same one that defeated Hopkins last year 13 to 9.<br />\nHopkins was ahead until the last<br />\ntwo minutes of play when a long<br />\nforward pass brought victory for<br />\nthe Swarthmore team. This year<br />\nSwarthmore gave Pennsylvania a<br />\nmighty close run, which seems to<br />\nsay that they will be a hard team to<br />\nput down. The Philadelphia team<br />\nwas not so impressive last week<br />\nwhen it defeated the weak-Delaware<br />\neleven 19 to 6. Therefore the improvement shown by the Blue Team<br />\nlast Saturday points to a victory<br />\ntomorrow.<br /><br />\nPrice 5 Cents<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 8, 1929<br /><br />\nVol. XXXIV, No. 12<br /><br />\nWORLD YOUTH IS<br />\nDISCUSSION SUBJECT<br />\nA discussion will be held<br />\nSunday, at the International<br />\nTea, in Levering Hall. Miss<br />\nRuth Outland, of Holland,<br />\nwill speak on the World Youth<br />\nConference which was held at<br />\nErde, Holland. On the basis<br />\nof this talk the group will discuss the World Youth Movement, especially in regard to<br />\nthe United States and Germany. Miss Outland is from<br />\nthe other side and her 'viewpoint should prove of interest.<br /><br />\nDEBATING COUNCIL<br />\nPLANS ACTIVITIES<br />\nFreshman-Sophomore Debate<br />\nFirst On Schedule<br />\nORATORY<br /><br />\nCUP<br /><br />\nOFFERED<br /><br />\nDebate With Goucher May Be<br />\nArranged In March<br /><br />\nACTIVITY GOES ON IN BIOLOGY<br />\nLAB. IN MIDST OF MOVING<br />\nPerhaps the most interesting<br />\nplace on the campus in regard to<br />\ncuriosities is the Biology Laboratory (apologies to any freshman lectures or other freshman gatherings).<br />\nHere one may see specimens of<br />\nCab pus Aquaticus quaintly labelled<br />\n\"Homewood, 1926.\" There are also<br />\nseveral skeletons of gigantic Felis<br />\nDontestica, otherwise known as common house cats, which were so unfortunate to stray on the University<br />\ncampus.<br /><br />\nthem over hill and vale.<br />\nThe laboratory is particularly<br />\nproud of its assortment of salamanders, although they do not rival<br />\nin size, the collection of last year.<br /><br />\nDEBATING TRY-OUTS<br />\nTO BE HELD SOON<br />\nDal Ghent, president of the<br />\nDebating Council, wishes to<br />\nannounce that try-outs for the<br />\nUniversity Intercollegiate Debating Teams, will be held<br />\nTuesday, November 19, at<br />\n5.30 P. M., in Room B, second<br />\nfloor, Levering Hall. Every<br />\nmember of the student body,<br />\nwhether or not he has had any<br />\ntraining in intercollegiate debating is invited to the tryouts. The two speakers who<br />\nseem most qualified at this<br />\ntime will be given a trip to<br />\nNew England during the<br />\nChristmas Holidays with all<br />\nexpenses paid to represent the<br />\nUniversity against northern<br />\ncolleges. Other speakers will<br />\nbe assigned places in short,<br />\nout-of-town debates, and home<br />\ndebates with other universities.<br /><br />\nIn a case may be seen an exhibit<br />\ntitled \"Skeleton, feathers and skin<br />\nof white silky Japanese cock,\" it<br />\nbeing just that, resembling ve.-ymuch the dinner of a buzzard. In<br />\nanother case, amply covered with<br />\nmoth balls, may be seen a stuffed<br />\nand other furry denizens of the<br />\nseal<br />\nAnother animal from the wilds of<br />\ngreat<br />\nout-doors.<br />\nWyman's Park is the Dedelphis Virginian or Opossum. From the four<br />\nSeveral jawbones of whales are<br />\ncorners of the globe come pygmy<br />\npropped up against the wall, all<br />\nhippopotami and turtles. Turtles<br />\nwith the general appearance of havlarge, small and indifferent, there<br />\ning had small souvenirs.<br />\nbeing a particularly large one reFreshmen can be amused by lookceived from the Frederick Fair last<br />\ning at the little sea shells. There is<br />\nyear. The pygmy hippopotamus is<br />\nalso a case of slightly moth-eaten<br />\nabout the size of a cat and is the<br />\ncrayfish.<br />\npresent of Dr. H. Fox, of the Zoological Society of Philadelphia.<br />\nThe Biology Laboratory is now<br />\nin the process of expansion, taking<br />\nPreserved in closely-guarded alover the old quarters of the Math<br />\ncohol we also find sea horses, fire<br />\nDepartment. Soon, no doubt, taking<br />\ntoads and Ousines of New Zealand,<br />\nadvantage of increased space, they<br />\nwhatever they may be. Butterflys<br />\nwill have the skeleton of a full- Will Convene Monday Noons<br />\nand coral formations are also on<br />\nsized whale hung on exhibition.<br />\nIn Levering Hall<br />\nview, although we have yet to see<br />\nthe Hopkins professors chasing<br />\nH. F.M.<br />\nSEID,MAN SPEAKS<br /><br />\nHULLABALOO WILL<br />\nTAKE PHOTOGRAPHS<br />\nSeniors Must Make Appointments For Sittings<br />\nImmediately<br />\nPICTURES<br /><br />\nNEXT<br /><br />\nWEEK<br /><br />\nSchedule For Group Photos<br />\nCompleted<br />\nIndividual senior pictures for<br />\nthe Htdlabaloo will be taken from<br />\n9 to 12 A. M. and from 1 to 4<br />\nP. M. every day next week, beginning on Monday. If seniors have<br />\nnot made appointments to have their<br />\npictures taken they should do so<br />\nimmediately, at the secretary's desk<br />\nef the Y. M. C. A. The seniors are<br />\nurged to be prompt in keeping their<br />\nappointments as any delay will set<br />\nback the entire schedule.<br /><br />\nA deposit of one dollar is reLIBERAL CLUB HOLDS<br />\nquired at the time the picture is<br />\nMEETING MONDAY taken. This will be credited to the<br /><br />\nMonday, at 12.25, in the Council<br />\nRoom of Levering Hall, the Deindividual when orders for the<br />\nbating Council held a very imporprinted photographs are made.<br />\ntant meeting. M. Dal Ghent, president of the Council opened the<br />\nOther Pictures<br />\nmeeting. Following a short report,<br />\nJunior, sophomore and freshman<br />\nHarold Yudkin gave a report of the<br />\nCosmopolitan Club<br />\nHopkins Harriers to<br />\nWaste Declared Detracting To class officers, as well as members<br />\nsecretary of the Council. His report<br />\nMeet Catholic Univ.<br />\nElects Officers<br />\nIndustries<br />\nfollows:<br />\nof the Student Council, are advised<br />\npresicross-country<br />\nwill<br />\nAlfredo<br />\nelected<br />\nHopkins<br />\nmen<br />\nBafios<br />\nwas<br />\neighteen<br />\nwere<br />\nsent<br />\nto<br />\n\"Letters<br />\nTeam Shows Improvement<br />\nto make appointments for their<br />\nnorthern colleges asking for de- dent of the Cosmopolitan Club at engage in a meet with Catholic \"Waste in Industry\" was the title<br />\nCoach Van Orman says that all<br />\nbates during the Christmas holidays. the last meeting of that association, University tomorrow. The Black of a paper read at the last meeting sittings at the same time the senior<br />\nthe team needs is a bit more exColgate, Villanova, and Boston Col- which was held at 8.30 P. M., last and Blue harriers plan to leave for of the Liberal Club by Joel Seid- individual photographs are taken.<br />\nperience in the backfield, and he<br />\nlege have accepted our invitations. Saturday. Lazer Teper is the new Washington this afternoon. This man. The speaker analyzed the<br />\nThe schedule for pictures of frabelieves that after the number of<br />\nAmherst, Havard, Brown, Provi- vice-president and Miss Roberta is the first match ever held with the modern industrial structure from<br />\nternity,<br />\nactivity, and class groups<br />\ngames played this season, that it is<br />\ndence, Rutgers, Yale and M. I. T. White, secretary to the society. An Capitol City institution.<br />\nthe point of view of social waste,<br />\nnot now lacking. He also stated<br />\nAlthough the cross-country team defining waste as any failure to get during the week is as follows:<br />\nhave declined our offers. A debate interesting program was provided<br />\nthat the team showed great imof<br />\nMorgan College stu- was beaten after a hard struggle the maximum use value of output<br />\nhas been arranged with the Uni- by a group<br />\nprovement last Saturday. Love,<br />\nMonday, November 11<br />\nversity of Maryland to take place dents, who presented a variety of by Columbia, and though not much at the minimum real cost in labor<br />\nwho played tackle earlier in the<br />\nis known of the Washington team, and raw materials.<br />\nat Levering Hall in March. Fol- negro folk songs.<br />\n12.20, A. A. Board; 12.30, Interseason has been out of the line-up lowing the suggestion of Tau Kappa<br />\nthe Hopkins mentor is optimistic<br />\nbecause of a broken hand. He is Alpha the national honorary deThere are four great channels of fraternity Board; 12.40, Varsity<br />\nas to the result of the coming enClub.<br />\nimproving, but it is still very doubt- bating fraternity, a debate with Cotillion Club<br />\ncounter. The Hopkins harriers have waste in modern industrial society,<br />\nful whether he will be able to play Goucher College will probably be<br />\nfirst<br />\nof<br />\nThe<br />\nthe<br />\nspeaker<br />\ndeclared.<br />\nTo Hold Dance been under the disadvantage of<br />\n4.15, Scabbard and Blade, Cadet<br />\nnext Saturday or not. If he does arranged. Mr. Wheeler, who was<br />\nstrange and longer courses in the these is the furnishing of goods and Officers, R. 0. T. C. Unit,<br />\nSwarthmore<br />\nAfter<br />\ngame<br />\nSatthe<br />\nRegular<br />\nnot play his position will be filled recently elected faculty<br />\nadviser to urday, the Cotillion Club will hold last two meets. While it is true that services which are either useless,<br />\nOfficers.<br />\nby Dick Keating again. Keating the Council,<br />\nadvertising,<br />\nor<br />\nsuch as most of<br />\nhas offered a cup to the<br />\nwhich this match will be run over the<br />\nplayed a fine game against Haver- Council, on behalf of a well-known a tea-dance, the admission to<br />\nCatholic<br />\nUniversity grounds, the harmful, such as opium or certain<br />\n7.30, Phi Kappa Psi; 7.45, Delta<br />\nwill be fifty cents. Os Steinwald<br />\nford, blocking four kicks.<br />\nMaryland woman to be awarded will supply the music as usual. length of that course is practically patent medicines. As an illustration Phi; 8.00, Alpha Delta Phi;<br />\n8.15,<br />\nannually to the winner of another That night there will be the usual the same as the one of Homewood. of the latter he cited the case of a<br />\nTraditional Late Season Progress<br />\nPhi<br />\nGamma<br />\nDelta;<br />\nSigma<br />\nPhi<br />\n8.30,<br />\noratorical contest. Teams have been dance with Bob Iula supplying the<br />\nCoach Hambleton plans to leave fat reducer which was found to<br />\nIt always has been a fact that<br />\nconsist of gelatine in which was Epsilon; 8.45, Kappa Sigma; 9.00,<br />\nchosen to represent the freshman music. Admission to this is one with the usual six or seven men.<br />\nthe head of a tape worm. Delta Upsilon.<br />\nHopkins teams have improved and sophomore classes in their foimbedded<br />\nThese selected men are Captain<br />\ndollar. Prizes at the door.<br />\nabout 100 per cent for the last two rensic battle to take place at the end<br />\nFollowing the Maryland game, Kelly, Schiebel, Emerson, Waters, The second great channel of<br />\nTuesday, November 12<br />\nor three games of the season. The of the month. The date for this de- the Cotillion Board has planned a Miller and Packard. It is not known waste was held to be unemploybate,<br />\nas<br />\nwell<br />\nas<br />\nfor<br />\nthe<br />\nrest<br />\nof<br />\nthe<br />\nwhether<br />\nHancock's<br />\nfoot<br />\nis<br />\nas<br />\nyet<br />\nin<br />\nment.<br />\nIn<br />\nthe<br />\nSwarthmore game is the third from<br />\nUnited States, even<br />\nThanksgiving Dance and have elect12.20, Rifle Club; 12.30, Stuthe last and now is the time for the Debating Council's program will be ed a committee to se that it will condition for him to run. If It is in good times, the number unem- dents Activities Council; 12.40,<br />\nannounced as soon as Purnell Hall be interesting. It will take place in he will be the seventh man for Hop- ployed, either because no job could<br />\nteam to come up to this tradition.<br />\nis able to fit them into his assembly eiher the Maryland Casualty or kins. He was missed in the last be found or because of strikes or Varsity Seal Holders;<br />\nCoach Van Orman has been rubbing program. Dr. Lancaster has prommatch where a single early place preventable accidents and sickness, 4.00, Aviation Club; 4.10, Radio<br />\nSouthern Hotel.<br />\nthis in on the team and it is up to ised to state a topic for this year's<br />\nThe prices will be as follows: might have helped to turn a de- is about one million, whereas, in Club; 4.20, Mechanical Engineers;<br />\nthem to show the stuff this week. De Toqueville Medal Contest, as $2.00 a couple and $1.50 stag. Bob feat into a victory for the Jays.<br />\nperiods of depression the number<br />\n4.30, Civil Engineers; 4.40, Elecmay reach five or six millions.<br />\nThe men have been working hard soon as he will be able to confer Iula will lead the orchestra in pertrical Engineers.<br />\nin preparation for springing a sur- with Dr. Siegfried and Dr. Chinard son.<br />\nThe failure to use the best<br />\nMr.<br />\nPaul<br />\nMeng<br />\nabout it. The Adams Declamation<br />\nA. Hull was elected to the Cotilprise victory on the Quakers.<br />\nAddresses U. S. C. technique of production and distri- 7.30, Kappa Alpha; 7.45, Omicontest for members of the sopho- lion Board to fill the vacancy left<br />\nbution was cited as the third great cron Kappa Omicron; 8.00, Alpha<br />\nmore class will be revived this year. by one of last year's seniors.<br />\nCheering Section Nearly Filled<br />\nLast Tuesday evening at 6.30 the<br />\nsource<br />\nof waste. \"Labor is regular- Kappa Psi; 8.15, Sigma Tau Delta;<br />\nsecond meeting of the University<br />\nTwo weeks ago at the Randolph- Four sophomores are willing to enly<br />\nwasted<br />\nthrough employment 8.30, Tau Alpha Phi;<br />\nter the contest at the present time.<br />\n8.45, Alpha<br />\nSupper Club was addressed by Mr.<br />\nMacon game there was quite an imupon<br />\ngoods<br />\nthat<br />\nhave the shortest<br />\nFour colleges have asked for de- Dr. Rice Addresses<br />\nPaul Meng, General Secretary of<br />\nMu Tau; 9.00, Phi Alpha.<br />\nprovement in the attendance in the bates. All letters have been anCarrol Club the Chinese Student Christian As- possible life, in order to secure<br />\nquick turnover and high profits;<br />\ncheering section. Improvement also swered. There is a possibility that<br />\nWednesday, November 13<br />\nThe Carrol Club of Johns Hop- sociation of the United States. Mr. but from a social point of view any<br />\nwas quite evident in the playing of some very important debating teams kins University met last Sunday at Meng spoke on the Migration of<br />\nfailure to make the best product<br />\n12.20, NEWS-LETTER; 12.30, Hulthe team, in that they won their first will visit Homewood this fall.\"<br />\n2.30 P. M. in Room 109 of the M. Chinese to the United States and possible is sheer social waste.\" Frelabaloo; 12.40, Y. M. C. A.<br />\nFollowing the report of the secre- E. Building. An aggregation of the results of the contacts made.<br />\ngame this season. It is sincerely<br />\nquent changes in style and the protary, a letter of resignation from the about sixty including many .students<br />\nThe speaker stated that there are<br />\n7.00, Beta Theta Pi; 7.15, Alpha<br />\nhoped that the unenthusiastic freshCouncil of L. Stanton was read. of Notre Dame, Goucher, and other now over 2800 Chinese students in duction of an excessive number of<br />\nmodels, varieties, and styles of Tau Omega; 7.30, Phi Epsilon Pi.<br />\nmen and the rest of the student body The Council then voted Paul Spear,<br />\nColleges as well as the Hopkins 183 Universities of the United goods were mentioned as other<br />\nwill come out in force to back up of the Class of 1930, to the Counmen. John M. Cooper, professor Mr. Meng emphasized the fact, evidences of wastage in production.<br />\nThursday, November 14<br />\nthe team and help them put over cil. Spear has been chairman of<br />\nof Socialogy at the Cttholic Uni- that, among the Chinese, Johns<br />\n12.20, Barnstormers; 12.30, Black<br />\nThe high cost of salesmanship,<br />\ntheir second victory. The band is his class debating team for three versity at Washington, was schedul- Hopkins ranks among the first of<br />\nnow prepared to play at the game consecutive years. The Council ed to address the group on the \"Ori- American Universities. In closing he cross-hauling, inadequate market- and Blue Jay; 12.40, The Cotillion<br />\nwishes to state that all men who gin and History of Religion\", but expressed a desire for greater ing facilities, and the duplication of Board and the Debating Council.<br />\nand the whole cheering section<br />\nshow a willingness to cooperate with was unable to attend, so Dr. Rice of friendship and good feeling between retail stores were mentioned as the<br />\nshould be filled.<br />\n7.30, Tau Alpha Omega; 7.45,<br />\nthe council in their forensic activ- the Chemistry department of this America and China, through the chief causes of waste in distribuities<br />\nover<br />\nany<br />\nperiod<br />\nof<br />\ntime<br />\nwill<br />\nSigma Delta; 8.00, Pi Lambda<br />\ntion.<br />\nPhi<br />\ncontacts<br />\nmade by the students.<br />\nThe line-up of the team will be<br />\nUniversity took his place and spoke<br />\nbe honored by election to the Coun- to the club on the subject of the<br />\nThe<br />\nmusical program consisted<br />\nthe same as last week unless some<br />\nThe waste of natural resources Phi; 8.15, Charles Carroll Club.<br />\ncil.<br />\nof the singing of Hopkins songs led<br />\n\"Origin<br />\nReligion\".<br />\nof<br />\nthe<br />\nEnglish<br />\nunforseen accident should happen<br />\nThe Sophomore Debating team In a fine talk he brought out the by Carl Lausch at the piano and a was declared to be the fourth great<br />\nFriday, November 15<br />\ncategory of waste. \"Half our coke<br />\nin the meantime. The team is out consists of Chairman Yudkin, Secconttoversy between Pratesea0t- violin duet by the Misses Mary and is still made in the inefficient bee12.20, Junior Class; 12.30, Sophto pull down a victory this week and ond Constructive Orator Back, and ism and Catholicism.<br />\nNellie Bagwell, accompanied by<br />\nomore Class; 1.40, Freshman Class.<br />\n(Continued on page 4 column 4<br />\nMiss Janette Williams.<br />\neveryone should be behind them.<br />\n(Continued on page 3 column 4)<br />\n(Continued on page 4 column 4)<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 8, 1929<br /><br />\n2<br /><br />\nTIIEJOINSHOPKINSIIEWSIETTER INTERCOLLEGIATE<br />\nA contribution to the Arts and<br />\nFOUNDED 1897<br />\nSciences from the McGill Daily:<br />\n\"The men students of Rochester,<br />\n$2.00 being of the opinion that the socialSubscription<br />\nly-minded students waste much<br />\nEntered as second-class matter Oecember 3, 1909, at the Postoffice in Baltimore,<br />\ntime through \"blind dates,\" have<br />\nMd., under the Act of Congress November 3, 1879.<br />\nevolved a scheme for the interof knowledge concerning cochange<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins<br />\nUniversity.<br />\neds and their ways.<br /><br />\nThe carefully thought out code<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING EDITOR ; for this interchange of knowledge<br />\nother communications to the EDITOR-IN-CHIEF.<br />\nconsists of the following one-letter<br />\nUniversity 0100<br /><br />\nTelephone<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\nGEORGE GUMP,'30<br />\nManaging Editor<br />\nROBERT S. BAIRD, '30<br /><br />\nclassification: A, average; B, beautiful; K, kisses; L, liberal; M, mercenary; P, pippin; R, rough; T,<br />\ntells; V, vivacious; X, expensive;<br />\nwhile the letter Y signifies the unknown quantity.<br /><br />\nNEWS<br /><br />\nIn a report of his which was read<br />\nat Levering Hall by J. W. Day, Dr.<br />\nDoran criticized the \"halo placed<br />\nabout drinking and wild parties by<br />\nolder men and alumni\" claiming this<br />\nencouraged the younger men to<br />\ndrink and accept it as a part of university life.<br /><br />\nDean Berry disapproved of the<br />\nsensational statements made in this<br />\nconference, about drinking in college, as it creates a wrong impression about life in the University. He<br />\nsaid that he would have disapproved<br />\nif there had been a wet conference<br />\nwhich had cited such extreme cases.<br />\nDrinking, according to the dean, has<br />\ndecreased in the last two or three<br />\nyears not only here but at most colleges.<br /><br />\nWarner &amp; Company<br />\n•<br />\nHats<br />\nClothing<br />\nand<br /><br />\nFurnishings<br />\nfor<br /><br />\nGentlemen<br />\n•<br /><br />\nWith the telephone directory<br />\nduly annotated in accordance with<br />\nAssistant Managing Editors<br />\nDr. French although agreeing<br />\nRICHARD HUNT,'31 GEM GE DOWELL,'31<br />\nthis arrangement, there is evidently<br />\nDean Berry in his disapproval<br />\nwith<br />\nno reason why any student should<br />\nAssociate Editors<br />\nthe<br />\nof<br />\nsentational statements, thinks<br />\n'30<br />\nSPEAR,<br />\nPAUL<br />\n'30<br />\n18 and 20 E. Baltimore Street<br />\nSIDNEY WOLK,<br />\nspend a dull evening.\"<br />\nthat this convention was fasicly<br />\nJunior Editors<br />\n* * *<br />\ngood. According to him, the purpose<br />\nPURNELL HALL,'30<br />\nSTEWART L. SMITH, '30<br />\nHARWOOD F. MULLIKIN, JR.,'30 ROWLAND McD. NESS, '32<br />\nThe University of Kentucky of the meeting was to crystaliz.e<br />\nNATHAN M. HARRIS, '32<br />\nFRANK CONE,'31<br />\nSYLVAN LEBOW, '32<br />\ncertainly ranks. Cecil B. DeMille is thinking about the prohibition of<br />\nGEORGE TRATTNER, '30<br />\nto select sixteen most beautiful girls drinking, the obedience due it, and<br />\nBUSINESS DEPARTMENT<br />\nUSED<br />\nNEW<br />\nfront forty-five candidates for the its enforcement. He says that disGus BURK, '31<br />\npolitical<br />\nor<br />\non<br />\ncussions<br />\nsociology,<br />\nbeauty section of the Kentuckian.<br />\nCirculation Manager<br />\nAdvertising Manager<br />\na wholesome sign beare<br />\nsubjects<br />\n'30<br />\nGULLEY,<br />\nLYLE<br />\nSADLER ROBERTSON, '31<br />\n* * *<br />\ncause it shows that the students are<br />\nOffice Manager<br />\nof the problems of life<br />\nthinking<br />\nreof<br />\nHealth<br />\nBoard<br />\nThe<br />\nKansas<br />\nALviN BLum,'30<br />\nof<br />\nnot<br />\nhaving a good time.<br />\nand<br />\nrules<br />\n'32<br />\nfollowing<br />\nthe<br />\npassed<br />\nSaunders,<br />\ncently<br />\nHenry V.<br />\nSIDNEY RAFEL, '31<br />\n'31<br />\nFleishman,<br />\nTheodore<br />\ngovern<br />\nshould<br />\nsay<br />\nthey<br />\n'32<br />\nSykes,<br />\nwhich<br />\nDavid S.<br />\nEconomists, according to the<br />\nBaltimore, Md. Kissers:<br />\nHopkins librarian all agree that proProduced by the R. L. Polk Printing Company 1930 Clifton Ave.,<br />\n\"Never kiss in crowded places or<br />\nhibition is benefiting not only the<br />\na poorly ventilated room, but if you<br />\nTHE BACKUS MOTOR COMPANY<br />\ncountry at large but also the colmust kiss, take a hot mustard foot<br />\nleges. The Y. M. C. A. by promotbath and avoid drafts in case you<br />\n10-20 E. North Avenue<br />\ning conferences of this sort is dofeel \"all in\" afterwards. Guard<br />\ning a great deal in assisting the stuVernon 4300<br />\nagainst sudden changes in temperadents to form opinions on matters<br />\na<br />\nin<br />\nKissing<br />\nkissing.<br />\nwhen<br />\nture<br />\nTHE \"Y\" PERFORMS<br />\nof public importance.<br />\n,<br />\ncoat one minute and in<br />\ncoon-skin<br />\nO the more enlightened members of this intellectual guild of ours,<br />\nlighter apparel the next is extremely<br />\nthe spectacle put on last week-end by the Johns Hopkins Y. M.<br />\n1 angerous. Don't kiss any person<br />\nC. A. is an unpardonable and unforgivable performance under the<br />\n,<br />\nwho has chills and fever. At a party<br />\nwouldof<br />\ngroup<br />\na<br />\nProhibition,<br />\nof<br />\nguise of an inquiry into the status<br />\n, here postoffice and similar games<br />\nand<br />\nthemselves<br />\nof<br />\nfools<br />\ncomplete<br />\nmake<br />\nto<br />\nproceeded<br />\nintelligensia<br />\nbe<br />\n; re played, be sure to gargle freto bring censure on the University itself from the liberal, though<br />\nperhaps overly fervent editorial columns of the Sunpapers.<br />\nitiently.\"<br />\n(<br />\nWe hold no brief for the opponents of free speech who would<br />\nWhat optimism !<br />\nprevent the expression of ideas however foolish, but there is a time<br />\nfor<br />\nplace<br />\nno<br />\nis<br />\nbroadmindedness!<br />\nWhat<br />\ncampus<br />\nHopkins<br />\nand place for everything and the<br />\nbelong<br />\nshould<br />\nnow<br />\nthat<br />\nproblem<br />\na<br />\non<br />\ndiscussions<br />\nmoralistic<br />\npseudo<br />\n* * *<br />\nonly to the Tennessee anti-evolutionists and other no less simple folk.<br />\nThree frat houses were robbed of<br />\nThis University has always encouraged the growth of new ideas, and<br />\n$233 and jewelry at the Ohio State<br />\nhere illustrious names have lived furthering the knowledge of mankind. The Y. M. C. A. profanes the institution which gives it a home<br />\nUniversity. Any man that can<br />\nwhen it permits a group of professional reformers to engage in any<br />\nscrape up $233 in only three frat<br />\nsuch farce as was put on last week.<br />\nhouses is a genius and certainly dethe<br />\nwhy<br />\ndiscuss<br />\nto<br />\ntogether<br />\nserves his money.<br />\nThat supposedly serious people can get<br />\ncollege girl drinks gin and other similar philosophical problems is<br />\n* * *<br />\nnothing short of farcical. Yet in the face of this we learn that the \"Y\"<br />\nThe annual Disc Rush of Brookis going to promote other such useful conferences in the future. Dr.<br />\nand<br />\nhelpful<br />\nare<br />\nlyn<br />\nPoly began with a Frosh snakediscussions<br />\nJohn C. French says he believes such<br />\nuplifting<br />\nand<br />\nuseful<br />\nas<br />\nabout<br />\njust<br />\nare<br />\nthey<br />\nYes,<br />\nencouraged.<br />\ndance, the yearlings chanting gleeshould be<br />\nas the most fanatical evangelical meeting ever conducted by Aimee<br />\nfully in anticipation of a desired<br />\nSemple McPherson. Prohibition requires no discussion. No people<br />\nand imagined triumph. The dancever has been or ever will be made moral by law. Of course, Dr.<br />\ners were made to appear ridiculous<br />\nDoran, a professional Prohibitionist, whose job is dependent on<br />\nby being attired in a variety of outProhibition, is interested in converting the young people of the naf-date costumes. After the frenzied<br />\no<br />\ntion to his cause. His job depends on the success of this attempt.<br />\nOF RECENT ARRIVAL<br />\nwhich was held in a steady<br />\ncontest,<br />\nThat the \"Y\" should provide an opportunity for professional retune<br />\nthe<br />\nto<br />\nemerged<br />\nSophs<br />\nrain, the<br />\nformers to spread their gospel detracts from what little respect this<br />\na 55-26 wash-out of their tradiof<br />\nA TAILORED PRODUCT OF CERTIFIED CORRECTorganization still holds in the eyes of outsiders.<br />\ntional enemies. It was then the<br />\nNESS. FOR USAGE L'Y COLLEGE MEN WHO REThe question narrows down to determining the actual place of the<br />\nSophomores' turn to do a snakeY. M. C. A. on this campus. We believe without qualification that<br />\ndance which was performed at their<br />\nSPECT A BRACING STYLE AND FINE EXECUTION.<br />\nthe \"Y\" should have only one function; namely, to provide the<br />\nsmoker.<br />\nannual<br />\nseek<br />\nstudents with a building such as Levering Hall where they may<br />\n***<br />\nrecreation amidst pleasant surroundings. Any other activities which<br />\nSEVEN TO TWENTY<br />\nit has undertaken belong strictly to the Church and have absolutely no<br />\nCommissioner Doran, U. S. Dry<br />\nDOLLARS<br />\nplace on a liberal University campus.<br />\nChief, in his address here, claimed<br />\nWe are no unmoral lot; we do not need to have religion thrust at<br />\nthat 30 years must pass before the<br />\nus. As a part of Hopkins, the \"Y\" must not violate the high<br />\nAGENTS IN THE PRINCIPAL CITIES OF THE UNITED STATES<br />\nbenefifits of prohibition can be<br />\ntraditions of the University. Religious conferences are harmless and<br />\njudged, pointing out that only 10<br />\ninterest a very small percentage of the student body. Such displays<br />\nyears had elapsed since the passing<br />\nas last week's, however, are definitely detrimental, cause only harm,<br />\nof the Volstead Act. His subject<br />\nand reflect discredit on the institution which permits itself to allow<br />\nthem. We trust that the University at large agrees with Dean Berry<br />\nwas \"What Prohibition is Doing<br />\nin deploring the holding of useless discussions on questions which<br />\nto Us.\"<br />\nare purely a matter of individual tastes. If flappers drink because<br />\nathletes do, that should not provide serious people with an opporAccording to Dr. Doran, liquor<br />\ntunity for a \"gab fest.\" Such problems belong in the comic columns<br />\nsmugglers and their bases have been<br />\nof the Jay.<br />\ndestroyed and rum row abolished<br />\nWe have always deplored the fact that the Y. M. C. A. was ever<br />\nand that since ease of access is lesallowed to entrench itself on the Hopkins campus. The national<br />\nsened consumption has decreased.<br />\norganization, in many respects, occupies a similar low level with<br />\nHe claims that a review of the 10<br />\nWILL BE FOUND HERE<br />\nthe Methodist Board of Public Morals. When our local branch peryears' accomplishment will make us<br />\nmits the staging of Prohibition conferences and then reaffirms its<br />\nEXCLUSIVELY<br />\nintention of holding gatherings of similar nature in the future, we<br />\noptimistic in the prediction of our<br />\ncan only utter our hearty disapproval. The group who acted to foreadvance.<br />\nstall the erection of Levering Hall last year was perhaps wise. They<br />\nforesaw the profanation of our campus by paid reformers and moralHe questioned the wisdom of the<br />\nizing, narrow, religious leaders. A wonderful place as is the new buildShepard bill saying that it could be<br />\nBALTIMORE &amp; HANOVER STS.<br />\ning, the organization which made it possible deserves no praise if it is<br />\nbetter decided by the next generato use the building in such a manner.<br />\ntion who will decide the fate of all<br />\nprohibition.<br />\nP. W. S.<br /><br />\nFORD<br /><br />\nAutomobiles<br /><br />\nEDITORIALS<br /><br />\n„<br /><br />\nT<br /><br />\nISAAC HAMBURGER &amp; SONS<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 8, 1929<br /><br />\nDORM DOINGS<br /><br />\nTHROUGH THE TUNNEL<br />\nIf we can shoot our column<br />\nthrough the tunnel anywhere nearly<br />\nas effectively and interestingly as<br />\nJohn 0' Ren rolls his Down the<br />\nSpillway, we shall be more than<br />\nsatisfied.<br /><br />\nDEBATING COUNCIL<br />\n(Continued on page 1 column 2)<br /><br />\nOrator of Rebuttal Getting. The<br />\ning meals immediately following<br />\nFreshman Debating team consists<br />\nthe first course of soup. The<br />\nChairman Leo M. Alpert, Second<br />\nof<br />\nof<br />\ndepths<br />\nstroll<br />\ninto<br />\nthe<br />\nwaiters<br />\nOrator Cyrus C.<br />\nConstructive<br />\norganize<br />\nthe kitchen and evidently<br />\nT requires trained experts<br />\nOrator<br />\nof Rebuttal S.<br />\nYoung,<br />\nJr.,<br />\na game of poker or take a nap while<br />\nwith wide experience and specialRaymond Dunn, Alternate Milthe starving inmates are being torn<br />\n* * *<br />\nized knowledge to determine the<br />\nstone, and Secretary Ney.<br />\nby the pangs of hunger. During<br />\nnoticea that when<br />\noften<br />\nhave<br />\nWe<br />\nwill<br />\ndebate<br />\nThe<br />\ntopic<br />\nfor<br />\nthis<br />\nthis torturous process, the diners<br />\nsound value of an investment.<br />\nstudent walks alone, be, Resolved: That Installment<br />\ndeem it necessary to clash silver-(?) a graduate<br />\nparticularly through the library to Buying Is Detrimental to American<br />\nware and make other noises of suffifrom the stables, he usually Business.<br />\nand<br />\ncient volume to warn the kitchen<br />\nwears<br />\nan abstract and distant look.<br />\nthat it is time to deal the last hand<br />\nseeker,<br />\noften the scholastic<br />\nThis<br />\ncm to take a last nap. Several eons<br />\nappears to be<br />\nobserver,<br />\nideal,<br />\nto<br />\nan<br />\nSecurity value—earning power and possibil- THE later the food begins to appear from<br />\nremoved<br />\nfar<br />\nenveloped<br />\nin<br />\nthoughts<br />\nities of enhancement or depreciation in value<br />\nthe depths, it is then that the cheerMAIL BAG<br />\nroutine<br />\nof<br />\nlife.<br />\nordinary<br />\nfrom<br />\nthe<br />\nover a period of years, must all be thoroughly<br />\ning begins. Upon the appearance<br />\nnothing mundane<br />\nthink,<br />\nSurely,<br />\nwe<br />\nanalyzed.<br />\nof the first tray of nourishment, a<br />\nICE CREAM<br />\nrousing \"Locomotive\" is given as characterizes his mental processes.<br />\nSince the house was established, Gillet &amp;<br />\nwhat we<br />\nthe platter is unloaded, followed by And yet, after hearing<br />\nTo the Editor of the<br />\nCompany has always emphasized the impora hearty \"Fight, Team, Fight\" as have from one former well-known<br />\nNEWS-LETTER,<br />\ntance of specific, dependable information and<br />\ngraduate student in foreign lanthe<br />\nbearer<br />\nof<br />\nfood<br />\ndives<br />\ninto<br />\nthe<br />\nhas made it a policy to apply this principle to<br />\nThese gracious acts seemed to<br />\nguages, we no longer maintain this Dear Sir:<br />\nkitchen<br />\nfor<br />\nanother<br />\nround<br />\nof<br />\nraits investment offerings.<br />\nrevive the idea that there might be<br />\nopinion. Now when we see a gradutions.<br />\nIt is my painful duty to call puba Santa Clause after all and several<br />\nate student—say he is one in the<br />\nWe offer to conservative investors a broad<br />\nAfter the expiration of precisely Romance Languages—with a con- lic attention to a regretable inciinmates were hoping that a similar<br />\nof safe, thoroughly investigated securities.<br />\nlist<br />\noccurred.<br />\nThe<br />\nrecently<br />\nhas<br />\ndent<br />\nthat<br />\nreplacement of the furniture would 17 minutes, the \"Graveyard\" tune is templative look, we argue that his<br />\nInvestors<br />\nwho consider safety, marketability,<br />\nCosmopolitan<br />\nof<br />\nthe<br />\nmeeting<br />\nlast<br />\ntake place during the year. How- struck up which usually precipitates thoughts are running in such a<br />\nand a steady income of the first importance,and<br />\never, the explanation of these phi- the entire dining-room force into manner: Shall I stay home and Club was held on the same evening<br />\nprofitably make their selections from our offerCotillion.<br />\nAs<br />\nis<br />\nHallow'een<br />\nthe<br />\nas<br />\nlanthropic moves came with the the hall, and after three long perhaps uncover a few more lice in<br />\nWrite, without obligation, for our latest<br />\nings.<br />\nCosmopolitan<br />\nthe<br />\nwith<br />\ncustomary<br />\ndawn of another day and bills in ‘'yeas,\" all fall to eating the delayed French Literature of the Twelfth<br />\nofferings.<br />\nof<br />\nlist<br />\nfor<br />\nprovided<br />\nwas<br />\nice<br />\ncream<br />\nthe various mail-boxes for \"mate- dinner and silence ensues for the Century or shall I take out that hot Club,<br />\nits members and guests. In the<br />\nrial\" and \"services rendered.\" The remainder of the time. When the date I just heard about?<br />\ncourse of distributing this delicacy,<br />\nmighty air castles of the third floor gastronomical desires have been<br />\n* * *<br />\none of the young men behind the<br />\ndenizens were converted again into fulfilled, the revellers leave the hall<br />\ncounter noticed that four harlequin<br />\nthe form which they originally pos- one by one with sufficient strength<br />\nUp until lately, we never put any<br />\nBANKERS<br />\nblocks had disappeared. Two of<br />\nto<br />\nendure<br />\nuntil<br />\nthe<br />\nmorning<br />\nof<br />\nthe<br />\nsessed, hot air.<br />\ncredence in what appeared to us as<br />\nfollowing day.<br />\nF. R. G. stock comic material, the idea that these blocks were perceived to be<br />\nLIGHT &amp; REDWOOD STS.<br />\nWailings and cries of utter disin the relentless grip of a number of<br />\nBALTIMORE, MD.<br />\npeople engaged in dangerous and<br />\n* * *<br />\ntress, intermixed with outbursts of<br />\nyoung men attending the Cotillion<br />\nimportant tasks voluntarily allowed<br />\nw rath, fill the building and plunge<br />\nTelephone PLaza 9060<br />\nPandemonium reigns supreme<br />\ndance who refused to return the<br />\ntheir<br />\nattentions<br />\nto<br />\nbe<br />\ndiverted.<br />\nFor<br />\nthe inmates into absolute distress.<br />\nseveral times weekly at the Dorms.<br />\nice cream or to pay for it. We reWASHINGTON, D. C. PHILADELPHIA, PA. WILLIAMSPORT, PA.<br />\ninstance, certain well-known humorPerhaps they will eventually disUnder the corroding influence of<br />\nquest the Cotillion Board to give<br />\nBIRMINGHAM, ALA.<br />\nEASTON, MD.<br />\nous magazines will print a cartoon<br />\ncover the necessary finances for the<br />\nthe bad boys of \"B\" entry, the young<br />\nthis matter the consideration it dedepicting an aviator performing<br />\nrepair work, but it is likely to be<br />\ninnocents of the other sectors are,<br />\nserves.<br />\nperilous manoeuvers at the same<br />\nmany moons in the future, as may<br />\nalas! revealing the fatal and unmistime nonchalantly, carrying on a<br />\nCOSA,<br />\n'<br />\n0' POLITAN<br />\nwell be appreciated by anyone who<br />\ntakable signs of degeneration into<br />\ncommonplace conversation with his<br />\nchances to he acquainted with any<br />\na company of brawling disturbers<br />\ncompanion. Or a sketch of a steelof the roomers. Maybe the next<br />\nof the nocturnal tranquility. One<br />\nworker walking along a beam at<br />\ndonation to the University will conwell-wishing pacifist has even been<br />\na height of 40 stories who will call<br />\ntain an item to cover the costs, and<br />\nobliged to suggest a partial remedy<br />\ndown to a fellow laborer below him,<br />\nthus relieve the debtors of their unfor the existing state of affairs ; this<br />\n\"One on rye, and don't fergit de<br />\nfortunate position.<br />\nwould consist of the medieval<br />\nAlong , with the latest choatic method of curbing feudal warfare, mustard\" is often seen.<br />\nevents, came the development of that of banning all fights between<br />\nLately, we have been led to be4<br />\n, f?-moi<br />\ncheering the waiters of the dining Wednesday evenings and Monday lieve that the magazines are not so<br />\nroom into greater activity. For this mornings. Even the mere consider- wrong. A friend at a medical<br />\npurpose, a regular rooters' section ation of such a radical proposal school tells us that one of the docis being formed among the fresh- would, however, meet with de- tors had to perform what undoubt*<br />\nmen. This particular activity is termined opposition on the part of edly seemed to be a very critical<br />\nconfined almost entirely to the even- the belligerent \"B\" boys.<br />\noperation. And from the time that<br />\nthe surgeon made the first incision<br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nOne of the favorite methods of to the end, he carried on a conversaPossible to Us\"<br />\nwarfare is, as is doubtlessly known, tion with the first assistant nurse.<br />\nTHE RELIABLE WEAVING CO.<br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nthe simple expedient of emptying He started off by saying :\"That reDamages Made Perfect<br />\nWE<br />\nALSO<br />\nREPAIR<br />\nSILK<br />\nDRESSES<br />\ncontainers of the dangerous chemi- minds me, have you seen R. U. R.<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\ncal H. 0, upon the capital ex- at Ford's yet?\"<br />\nBaltimore, Md.<br />\ntremities (a term which we heartily<br />\n* * *<br />\nRIDE IN<br />\nrecommend to some ambitious compiler of a dictionary of the future)<br />\nEvery once in a while, it might<br />\nof some unfortunate inhabitant of be noticed, that the newspapers will<br />\nany section of the hall. And, since run an article with a title implying<br />\nSTAND AT HOMEWOOD<br />\nall is fair in love and war, (inci- that there is nothing new under the<br />\nFIELD<br />\ndentally, no love is wasted between sun. And then the article will probNO CHARGE FOR<br />\nthe<br />\nentries) some of the more ably say that rouge was used in the<br />\nEXTRA PASSENGERS<br />\noriginal<br />\nand inventive of the intra- Fourth Century, or that the Eliza(2-3-4 or 5 MAY RIDE FOR<br />\nTHE PRICE OF ONE)<br />\nmural contestants have hit upon the bethans wore sun-back dresses, or<br />\nPHONE:<br />\nquite effective device of filling the<br />\nthat a type of airplane was first disfire extinguishers with hot water covered during the Neolithic age.<br />\nand proceeding to discharge the If we may be allowed to, we should<br />\ncontents on the unfortunate victims like to indulge in one of these \"nothf the mutually fatal fratricidal. ing new, etc.\"<br />\nWERGLEY'S<br />\nstrife.<br />\n2438 Charles St., North<br />\nHere of late we have been reading<br />\nLa Patisserie<br />\n* * *<br />\nof Macaulay's works. Among<br />\nsome<br />\nSANDWICHES PAR EXCELLENCE<br />\nessays, we also perused<br />\nmany<br />\nhis<br />\nAnd, hush! breathe it not to the<br />\nAddison. Macaulay, it<br />\non<br />\none<br />\nthe<br />\nscandal-loving world, but it has<br />\nwas famous for<br />\nremembered,<br />\nbe<br />\nwill<br />\nbeen rumored that Section II of<br />\nPhone HOmewood 7908<br />\nhe lent his<br />\ntinge<br />\nhistorical<br />\nthe<br />\nBirely's Pharmacy the Alumni Memorial Hall Code works and his facility for, and yet,<br />\nhas already been violated. (What<br />\nST. PAUL at 33rd STREET<br />\nis<br />\nthe younger generation coming interesting method of including<br />\nYour Neighborhood Drug Store<br />\nmany minute and personal details.<br />\nto?)<br />\nPRESCRIPTIONS<br />\nAt one point in his discussion of<br />\nIncidentally, as the required four Addison, Maculay remarks that<br />\nSchool Supplies, Candy,<br />\nTrying to pilot a plane without compass progress does not come in that way.<br />\nCigars<br />\nweeks have elapsed since the last Addison had been greatly impressed<br />\nFortunately most men have a natural<br />\nor other instruments is as unsatisfactory<br />\nUnexcelled Fountain<br />\noccasion, it is now time for the by a certain Countess, and that this<br />\nService<br />\nas trying to pilot your course through aptitude for one type of work rather<br />\nimpression was partly evident \"in<br />\nthe<br />\ndrinking<br />\nDorms<br />\nto<br />\nglasses<br />\nof<br />\nthan another—for things mechanical<br />\nMake Our Store Your Store<br />\nlife without a plan.<br />\nsome lively lines written (by Addireceive their periodic washing.<br />\nYou find many a man after college or artistic, factual or imaginative. The<br />\nson) on the glasses of the Kitcat<br />\nsolution of the problem is to<br />\nswitching from job to job —\"I<br />\nClub.\"<br /><br />\nSeveral weeks past the residents<br />\nof the upper levels of the Alumni<br />\nDormitory had slight difficulties<br />\nwith their lighting system and petitioned the gods of the power house<br />\nto have compassion on them and<br />\ndraw them forth from the darkness.<br />\nAccordingly this request was fulfilled and with seeming great goodwill. For numerous days electricians were busy entering rooms and<br />\nabsconding with all the wiring that<br />\ncould be taken from all types of<br />\nfixtures. However, they soon returned and replaced the purloined<br />\nwire with another variety in which<br />\nthey were certain there were no defects and proceeded to connect the<br />\nlamps of the entire floor with new<br />\nshiny cord.<br /><br />\nI<br /><br />\nG ILI—Er &amp; CO.<br /><br />\nYELLOW<br />\nCABS<br /><br />\n•<br /><br />\nVernon 1212<br /><br />\n••,;.•<br /><br />\nNo compass to guide him<br /><br />\nAfter the Dance<br />\nST. IUCCIIS<br />\n8 -17 North Charles Street<br /><br />\nAt this point let us add that it<br />\nwas reputed generally that Addison's only fault was his intemperance in drink. We say this to correct the idea that certain collegians<br />\nwho were present at the sophomore<br />\nbanquet last spring at the Kit Kat<br />\nmight have hastily formed.<br />\nBy \"D'ORSAY\"<br /><br />\nthink I'll try fiction writing for a<br />\nwhile,\" or \"Selling bonds is what<br />\nappeals to me.\" Aimless! Real<br /><br />\nbe found in self analysis, making a decision and then following through.<br /><br />\n1ecitric<br />\nIINCE<br /><br />\n1882<br /><br />\nMANUFACTURERS<br /><br />\nFOR<br /><br />\nTHE<br /><br />\nBELL<br /><br />\nSYSTEM<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 8, 1929<br /><br />\n4<br /><br />\nDR. RICE ADDRESSES<br /><br />\nDr. Chesney Named<br />\nMedical School Head<br /><br />\nILG ER9S<br />\ncAN DW I CH<br />\ncfliOPS<br /><br />\n\"Where we all meet<br />\nafter the big game\"<br />\nUP-TOWN SHOP<br /><br />\nDOWN-TOWN SHOP<br /><br />\nNorth &amp; Charles<br /><br />\nCalvert &amp; Fayette<br />\nOPEN ALL NIGHT<br /><br />\n15c First Quarter Mile-5c Each Additional Quarter Mile<br /><br />\nCENTURY CAB CO.<br />\n1718 N. CHARLES STREET<br /><br />\nVERNON 7002<br />\nWe are promoting the cab business from an expensive luxury<br />\nto an economical necessity<br /><br />\nLIGHT<br />\nCOLORFUL<br />\nWA RM<br />\nRY<br /><br />\n4-)\"1<br />\n11<br /><br />\nIn any event<br />\nwear an<br /><br />\nALLmcarircma<br />\nLET rain, wind or chill sweep the field—you're dry and<br /><br />\nwarm. Smartly dressed,too! Expertly styled in a wide range<br />\nof distinctive colors. For men and women, $7.50 to $25.<br /><br />\nNew:<br /><br />\nTHE ALLIGATOR COMPANY, St. Louis<br />\nProtect trouser legs—all colors to match all coats.<br />\nALLIGATOR (Pat.<br />\nAsk to see them.<br />\nSTEPPER S App.for) $2 and $3.50 a pair.<br /><br />\nKEEP<br /><br />\nDRY<br /><br />\nFROM<br /><br />\nHEAD<br /><br />\nTO<br /><br />\nFOOT<br /><br />\nDr. Alan M. Chesney was named<br />\ndean of the Johns Hopkins Medical school by the trustees last Monday. He took over his new duties<br />\nHe succeded Dr.<br />\nWednesday.<br />\nLewis H. Weed, who held this position for two successive terms or<br />\nsix years.<br /><br />\n(Continued from page 1 column 3)<br /><br />\nAfter Dr. Rice's talk a social<br />\nmeeting lasting an hour was held,<br />\nat which important business was<br />\ntransacted. The next meeting of the<br />\nCarrol Club is scheduled for Sunday, Nov. 17.<br /><br />\n\"All Over But The Shouting\"<br /><br />\nThe former dean will continue<br />\nLIBERAL CLUB<br />\nhis association with the Medical<br />\n(Continued from page 1 column 5)<br />\nSchool, serving as liason officer<br />\nbetween the public and the school. hive oven, which allows the gasses,<br />\nup in<br />\nHe will devote most of his time to the oils, and fertilizers to go<br />\nspeaker<br />\nsaid.<br />\n\"Our<br />\nsmoke,\"<br />\nthe<br />\nhis specialty, which is anatomy.<br />\nwater-power resources are as yet<br />\nThe new dean entered Hopkins largely undeveloped, while ineffiin 1904. He took his Bachelor of cient mining methods leave half our<br />\nArts degree four years later and his coal in the mines. Our forests are<br />\nMedical degree in 1912. He served ruthlessly destroyed, though it is<br />\nas an associate in Medicine at Wash- possible so to cut timber that the<br />\nitVton University St. Louis, for annual growth will equal or about<br />\nfour years. He returned to Hop- equal the annual cut. The waste<br />\nkins in 1921 and served there in in our fisheries has been enormous,<br />\na similar capacity.<br />\nso that our supply of many valuDr. Chesney has been assistant able fish is becoming smaller and<br />\ndean of the Medical School for sev- smaller.\"<br />\neral years. In connection with this<br />\noffice he was associated with the entire faculty of the school. His appointment was therefore regarded<br />\nas the logical and popular one.<br />\nThe period, under the administration of Dr. Weed coincided with<br />\none of the most active periods of<br />\nexpansion that the Medical School<br />\nhas known. Because of his excellent work, the trustees wished him<br />\nto serve as a. consultant.<br /><br />\nSays Tubby Powell<br />\nTo The Juniors<br />\nwhen they ask him about footwear—and he straightway leads them to the Barn and shows 'em snappy<br />\nHess shoes that will knock any junior's eye out!<br /><br />\n$6.50 up<br /><br />\nN. HESS' SONS<br />\n8 E. Baltimore Street<br /><br />\nMEMBERS FLORISTS TELEGRAPH DELIVERY<br /><br />\nJ. A. RITTER &amp; SON<br />\nFlorist's and Decorators<br />\nBALTIMORE, MD.<br /><br />\n1918 NORTH CHARLES ST., Near 20TH<br /><br />\nThe speaker also mentioned some<br />\nof the social evils that flow from<br />\nour economic system, such evils as<br />\nlong hours of toil, monotony, worry,<br />\nchild labor, illiteracy, crime, imperialism and war.<br /><br />\n\"We eliminated waste and set up<br />\na fairly intelligent control of industry in order to kill Germans and<br />\nwin the war. What we should do is<br />\nto organize industry intelligently in<br />\norder to combat ignorance, poverDuring the time when the select- ty, and disease, and to increase hapion of a successor to Dr. Frank J. piness and raise the standard of<br />\nGoodnow, president the Hopkins living.\"<br />\nThe Liberal Club meets in Room<br />\nUniversity was under discussion, the<br />\nC,<br />\nLevering Hall, every Monday at<br />\nname of Dr. Weed was one of the<br />\nmost prominently mentioned as that 1 P. M. Everyone interested is invited to attend.<br />\nof a possible successor.<br /><br />\nASSOCIATION<br /><br />\nPhone: VErnon 0573<br /><br />\n•<br /><br />\nAI<br />\n.IVE I<br /><br />\n.<br /><br />\nouRsELF<br /><br />\nNo Deposit Required of Hopkins Students<br />\nCoupes<br /><br />\n,.<br /><br />\n:,........<br /><br />\nRoadsters<br /><br />\n..-•::<br />\n„.....„f<br />\n..:•:: ................„....: ..:-::•<br />\n.<br />\n— \"<br /><br />\nSedans<br /><br />\nBuicks<br />\nFords<br />\nChryslers<br />\nHupmobiles<br />\nChevrolets<br /><br />\n,<br />\n:ni:::i:.:::•::::::<br />\n::!....<br />\n.-\"<br />\n,: jel...,<br /><br />\nLIGHT AND LOMBARD STREETS<br />\nPLaza 6000<br />\n2402 Pennsylvania Ave.<br />\nLafayette 2000<br /><br />\n1725 N. Charles Street<br />\nVernon 4049<br /><br />\nBaltimore Concedes Milestone Supremecy<br />\n_<br /><br />\nSUITS—CLEANED and PRESSED—$1.00<br />\nPRESSED-35c<br />\n• •<br /><br />\nMASTERS • V<br />\nCLEANERS AND TAILORS<br /><br />\n3204 Greenmount Avenue<br /><br />\nHomewood 8453<br /><br />\nCORONA for College<br />\nCORONA leads the world<br />\non these 8 champion counts<br />\nStrongest frame of any portable typewriter—solid one-piece Aluminum, rigidly braced.<br />\n2. SIMPLICITY: Fewer parts than any other standard-keyboard typewriter.<br />\n3. COMPLETENESS: More big-machine features than any other portable typewriter.<br />\n4. EASY TO LEARN: Corona design is the result of 20 years' study of the needs of<br />\nbeginners.<br />\n5. WAR SERVICE: An unequalled record for duration as the official portable of the<br />\nAllied Armies.<br />\n6. POPULARITY: There are over a million satisfied Corono owners.<br />\n7. DURABILITY: Coronas purchased 20 years ago are still giving satisfactory service.<br />\n8. BEAUTY: Graceful in line; exquisitely finished in every detail.<br />\n1.<br /><br />\nSTRENGTH:<br /><br />\nM. W. LUCY &amp; COMPANY<br />\nBALTIMORE, MARYLAND<br /><br />\n104 West Fayette Street<br /><br />\nThe topcoats<br />\nof the season<br /><br />\nSTETSON CLOTHES<br /><br />\nUR goal is to coat you well. Our line is the Stein-Bloch.<br />\n0<br />\nAnd our prediction for the<br /><br />\nfor<br /><br />\nseason is, \"You'll win style the<br />\nmoment your back tries a Stein-Bloch!\"<br /><br />\nCollege OYCen<br /><br />\nStein-Bloch Topcoats<br />\n$45 and upward<br /><br />\nIsaac Hamburger<br />\n&amp; Sons<br />\nY. M. B. 0. D.<br /><br />\nOutfitters to Men and Boys<br /><br />\nNationally<br /><br />\nJustly<br /><br />\nKnown<br /><br />\nFamous<br /><br />\nMADE FOR YOU<br /><br />\nFOUR NORTH HOWARD STREET<br /><br />"}], "field_media_file": [{"target_id": 38346, "display": null, "description": null, "target_type": "file", "target_uuid": "12c27dc8-47ac-411f-b466-e5e7cd657bd0", "url": "http://digital.library.jhu.edu/system/files/2022-03/13392-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13392, "target_type": "node", "target_uuid": "8b15c7a3-267a-4f50-a731-6271b0905b75", "url": "/node/13392"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "38b85dbe-e151-45a6-85ff-d58938d8749a"}]}