{"mid": [{"value": 37167}], "uuid": [{"value": "d60673ce-97e6-4504-a1ff-e6dc139cb35a"}], "vid": [{"value": 37167}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T17:00:49+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13218-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T17:00:49+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T17:00:49+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXX, No. 49<br />\n<br />\n-HOMEWOOD, BALTIMORE, MD., APRIL 30, 1926.<br />\n<br />\nTENNIS TEAM WINS ONE<br />\nMATCH AND DROPS<br />\nANOTHER .<br />\n-St. Johns Is Whitewashed But Jays<br />\nLose To Catholic University<br />\nBy Score of<br />\n<br />\n5-2.<br />\n<br />\nTRUSTEES ELECT<br />\n3 NEW MEMBERS<br />\nJ. Hall\" Pleasants, President of the Alumni Council,<br />\nJudge Eli prank, and Carlyle<br />\nBarton, have recently been<br />\nchosen as permanent members of the University Board<br />\nof Trustees, in accordance<br />\nwith a resolution of the<br />\nBoard to increase its membership from twelve.to eightteen, exclusive of the President of the University.<br />\nThe Alumni Council will<br />\nmeet soon to *select a new<br />\npresident, who, will be exofficio member of the Board<br />\nof Trustees, as Dr. Pleasants<br />\nwas before his 'permanent<br />\nappointment.<br />\n<br />\nHEIDELBERG PROFESSOR<br />\n<br />\nDESCRIBES NEW<br />\nDEMOCRACY<br />\nDr. Carl Brinckmann Traces Course<br />\nOf Democratic Ideas<br />\n<br />\n• Germanic Countries<br />\n<br />\nIn<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nBLACK AND BLUE SQUADS<br />\nINVADE FOREIGN FIELDS<br />\nHomewood Field Deserted As Lacrosse And<br />\nTrack Teams Play Elsewhere Tomorrow<br />\n<br />\nStick -Wenders Clash With<br />\nCinder Stars To Race Against<br />\nThat democracy and national<br />\nSwarthmore Twelve<br />\nLafayette At Easton<br />\nunity based upon the firm foundaJohns Hopkins track men leave , Swarthmore will be hosts to the<br />\ntion of the German people are<br />\ntoday at 3.57 P. M.for Easton, Pa., Johns Hopkins lacrosse team todefinitely joined was the thought where they will engage Lafayette morrow in the fifth game of a<br />\nexpressed by Dr,Carl Brinckmann College in the second dual meet schedule that will find its climax<br />\nof the University of Heidelberg, of the season. Johns Hopkins has in the Hopkins-Maryland game at<br />\nin a public lecture delivered at the never *on a track meet from I lomewood. Earlier in the season<br />\nCivil Engineering Building on Lafayette. Hopkins lost to them Swarthmore held Maryland 4 to 2.<br />\nin 1924 by a narrow margin, in a<br />\nMuch can be said in favor.of the<br />\nApril 26 on \"Germany's Idea of<br />\nmeet that was, close from begin- Pennsylvanians. They not only<br />\nDemocracy.\"<br />\nning to end, the final result being have an experienced team, but a<br />\nBriefly, Dr. Brinckmann outlined in doubt until the last race was team that will give . the Jays a<br />\nthe course of democracy in the over. The Blue Jays will have hard ganie. On the starting lineGermanic lands. Here, he said, the edge in the dash and weight up will appear ten letter men of<br />\nevents. This year the Lafayette the team that held Hopkins to a<br />\nthere was a sort of primitive desquad seem to have concentrated 7-3 score last year. It took some<br />\nmocracy, which grew up about<br />\nin bringing about an evident su-, time for the Blue team -Co strike<br />\nthe tithe of the Roman. Empire. periority in middle and long disits stride in the 1925 game.<br />\nIt was distinguished by a large tance events. _<br />\nSWarthmore Strong<br />\ndegree of individual liberty and a<br />\nIt is difficult to estimate the<br />\nalways expectant of a<br />\nFans<br />\nare<br />\ntotal absence of class privileges. comparative strength of the two<br />\nbattle<br />\nwhen these two teams meet.<br />\nAt the end of the Middle Ages, the •squads because tomorrow's event<br />\ngreat western countries began. to will be the first dual meet that However, when Swarthmore gets<br />\nbe built up, imposing upon the the Pennsylvania College has had Hopkins on its Pennsylvania lot,<br />\ndemocratic systems feudal ones this spring, The only comparison the Quaker lads are harder than<br />\nwhich tended to the more efficient that can be made is by using the ever to take into camp. Even if<br />\nadministration of the nation. For approximate times made at the they lose, they put up a fighting<br />\nframe.<br />\nthe time the primitive democracy Penn Relays.<br />\nwas lost sight of, and greater<br />\nUndoubtedly,, last Saturday,<br />\n\"Bob\" Heyn, who sustained a<br />\nstress laid on national unity. wrenched side and a spiked leg when Hopkins triumphed over<br />\nOnce achieved, however, the prim- in the Navy meet, has partially Army, they compiled a nice paraRegan, Catholic University, defeated<br />\nitive democracy returned,. and as recovered and is expected to an- graph or two of lacrosse history.<br />\nHebner, Hopkins, 2-6; 6-4, 11-9.<br />\nfrequent bursts of nationalism nex both the century and 220. In Lacrosse enthusiasts will recall<br />\nBlock, Hopkins, defeated Kiwaski, Field Club Visits<br />\nshow, it developed hand<br />\nCatholic University, 6-3, 6-4.<br />\nhand the quarter-mile a very close race the skill and daring of individuals<br />\nDisposal Plant with the idea of national in<br />\nHicks, Catholic University, defeated<br />\nis expected since the time of La- and the smoothness of the comunity.<br />\nAccompanied by several stuLevinstein, Hopkins, 6-4, 1-6, 8-6.<br />\nfayette's<br />\nbest man and Hemmeter bined attack which brought the<br />\nGermany Democratic<br />\nGardes, Catholic University, defeat- dents in biology and bacteriology,<br />\nis<br />\nBig Blue team from behind to<br />\nnearly<br />\nthe same.<br />\ned Wasserman, Hopkins, 7-5, 4-6, 6-0. the<br />\nIn Germany, however, pointed<br />\nField Club took a very inDistance Strengthened<br />\nburst into the glorious scoring bee<br />\nDeBuskey, Hopkins, defeated Riorstructive trip through the Balti- out Dr. Brinckmann, this growth<br />\nHopkins has faced a weakness which more than twice turned the<br />\ndan, Catholic University, 8-6, 6-0.<br />\nmore Sewage Disposal Plant at of the nation took a far different in the half-mile all year and with<br />\ntables on Army.<br />\nDOUBLES<br />\nBack River last Saturday morn- course. The administration of the a view of correcting this defect,<br />\nKiwaski and Regani.Catholic UniThe game last week was the first<br />\nHoly Roman Empire was a most<br />\nversily, defeated Block and Wasser- ing.<br />\nCoach Edwards has shifted Scow hard contest of the season. It was<br />\nThe party of fifty were told of democratic system, preserving as to this event. Due to Lafayette's<br />\nman, Hopkins, 3-6, 6-4, 6-4.<br />\nalso the first of a series of games<br />\nHicks and Riordan, Catholic Uni- the operation of the plant and it did, the independence of every<br />\ngreat strength in this distance, it that will tax 'the Jays to pracversity, defeated Levinstein and De- heard<br />\nlectures by the chemist and separate jurisdiction. The growth is hardly expected that a blue.<br />\ntically their fullest resources.<br />\nBuskey, Hopkins, 6-4, 6-4.<br />\nbacteriologist stationed there. The of the German government saw jerseyed man will win the race.<br />\nSwarthmore, while not quite so<br />\nplant consists mainly of settling the wide deliverance of the essen- In the mile and two-mile runs the<br />\nHopkins versus St. Johns<br />\nhard as Army,* will not be easy.<br />\ntanks and a \"sprinkler field out in tials, democracy and unity. In the Easton track men also look like<br />\nSINGLES<br />\nArmy did not play them to a 2-1<br />\nSouth and West the old primitive winners.<br />\nHebner, Hopkins, defeated Snyder, the open with only the laboravictory for the fun of it. A one<br />\ndemocracy<br />\nhad held on and contories<br />\nand<br />\noperating<br />\nSt. Johns, 6-2, 6-2.<br />\nmachinery<br />\nHopkins low-hurdlers will face point lead never has been a comtinued to dominate the political a great difficulty<br />\nGoldstein, Hopkins, defeated Clarke, under a roof.<br />\nin that they will fortable margin.<br />\nSt. Johns, 6-3, 6-2.<br />\naction of the people. In the East not have a<br />\nstraightaway<br />\nto run<br />\nBlock, Hopkins, defeated Von Hartz,<br />\nand North, two *great German this event in, but<br />\nArmy Defensive<br />\nThree<br />\nwill<br />\nFunctions<br />\nhave<br />\nto beSt. Johns, 6-1, 6-3.<br />\nstates,<br />\nAustria<br />\nand<br />\nPrussia,<br />\nStill<br />\ngrew<br />\nit<br />\nhas been noised that the<br />\nLevinste.in, Hopkins, defeated Smith,<br />\nConflict Tonight up, paying more attention to the come accustomed to running the Army coach advised his team to<br />\nSt. Johns, 6-3, 6-1.<br />\nobstacles around a curve, and from<br />\nThree functions are conflicting administrative and bureaucratic<br />\nWasserman,<br />\nHopkins,<br />\nscore one more goal on Hopkins,<br />\ndefeated<br />\na \"stagger start.\"<br />\non the campus tonight. The Jun- side than to the democratic, a fact<br />\nO'Neil, St. Johns, 4-6, 6-1, 6-4.<br />\nIn the field events it looks as and, with the score 3-2, to hold the<br />\niors will hold their annual ban- which may be accounted for when<br />\nDOUBLES<br />\nthough the Blue Jays have a Jays by playing an extra man on<br />\nHebner and Goldstein, Hopkins, de- quet at the Hopkins<br />\nApartments, we consider that their populations slight superiority. Heyn,<br />\nbecause the defense. Not a bad idea if the<br />\nfeated Von Hartz and Clarke, St.<br />\nthe Tudor-Stuart Club will have were German mixed with Slavic.<br />\nof<br />\nhis<br />\nwrenched side, will com- best plans of the finest coaches<br />\nJohns, 6-2, 6-3.<br />\ntheir annual elections in the club In 1813, the German states tried<br />\nBlock and Levinstein, Hopkins, depete in the pole vault only if the were not frequently doomed to defeated Smith and Snyder, St. Johns, rooms, and the Engineers' Club to gain unity, and at the same score is close and he<br />\nstands a good struction.<br />\nwill give a dance in the C. E. Hall. time to keep their democracy.<br />\n7-9, 6-4, 6-2.<br />\nArmy did not realize just exactchance of scoring. - Vivell will<br />\nThis, however, was not done until take care of the jumps,<br />\nand it is ly what it was up against and<br />\n1918, when complete democracy very doubtful if the maroon<br />\nCLASS OF 1928 TAKES EARLY LEAD<br />\nand they received their first defeat. , It<br />\nIN ANNUAL BANQUET WARFARE and national unity were joined. white will be able to produce any would be a calamity for the Jays<br />\nmen that will equal the efforts of to spoil their record tomorrow in<br />\nChanges Come Slowly<br />\nSCORE':<br />\nHills<br />\nand Gilpin in the weight the enemy camp.<br />\n.\"Great changes,\" said Dr.<br />\nSophs 1.<br />\nFrosh 0.<br />\nevents.<br />\nThe team is now in the middle<br />\nBrinckmann, \"do not come about<br />\nof its season with 'a total of 52<br />\novernight; they are the result of<br />\nNo, this isn't a ball game, or a but their rivals can boast much<br />\npoints scored as opposed to the<br />\ndeep causes and must go through Cane Clubbers<br />\nclass rush. It's the banquet sea- valuable experience. The present<br />\nopposition, 4. That is a record<br />\na long transition period. This is<br />\nTap<br />\nEleven<br />\nand the sophomores drew first sophomores, it will be recalled,<br />\nevidenced by the fact that in sevEleven men were tapped for the not exceeded by any Hopkins team.<br />\nblood when they discovered three saw some of their mates spend a<br />\neral democratic countries of Eu- Cane Club last Monday. They But in spite of the fact that the<br />\nPoor little freshmen hiding in the few hours in a cell in the Central<br />\nrope there are many who would were Ashbury, Beale, Boynton, credit balance stands at 48, it is<br />\nProjection room of the C. E. Hall Police Station last year because like<br />\nto see the old- systems back Cushing, Devereaux, Hasbrouck, still possible to make or mar a<br />\ntrying to learn their plans for the they had been too energetic in<br />\nagain. . In France, for instance, Hobbs, Moyer, Schwinn, Wagner, beautiful record.<br />\nannual feast. spoiling the fun of the present .here is<br />\na large party -who would and Warfield. The tapping was . The team will go up to SwarthThe real fun, however, won't be- juniors, then sophs.<br />\nlike to see the return of the mon- done in the usual manner, on the more tomorrow 'with tough propogin until, after tonight, the -date<br />\nThe three freshmen who were 4rchy. In Germany, however, upper quadrangle and then the sition staring it in the face. The<br />\nof the junior banquet. From then captured claim that it was'worth<br />\nfeudalism did not last, and the. procession drove down to \"Gray chances are two to one they will<br />\n°II, -there will be free and unre- the trouble, for they found out 'democratic<br />\nsystem was not laid Goose. Inn\"..fOr lunch. Monday win, but in Swarthmore's *own<br />\n'tricte'd *warfare. The freshmen<br />\n_ that the sophomores had twenty a.gide so long. For &his reason night\"d-inoie- complete celebration backyard they will never win in a<br />\nhay: the advantage of numbers,(Continued, on p.--3, col. 2)<br />\n(Continued on p. 4, col. 1)<br />\nwas held.<br />\nwalk.<br />\nThe Hopkins tennis team dropped one match and won one last<br />\nweek, losing to Catholic University, 5 matches to 2 and beating<br />\nSt. John, 7-0. Both matches were<br />\nplayed at Homewood, the first on<br />\nFriday and the second Saturday.<br />\nThe contest with Catholic University was an impromptu affair,<br />\nnot being scheduled and was arranged only on the spur of the<br />\nmoment. Regan, playing number<br />\none for Catholic University, and<br />\nCaptain Hebner of Hopkins,<br />\nstarred in a hard fought struggle<br />\nwhich ran into the full three sets,<br />\nHebner winning theArst 6-2, losing the second 6-4, and losing out Charles Lord To<br />\nonly after a bitterly contested<br />\nHead Cotillion Club<br />\nfinal set by an 11-9 count.<br />\nCharles G. Lord was elected<br />\nThe Jays will stack up -against<br />\npresident of the Cotillion Club at<br />\nthe Maryland racqueters tomora banquet at the Southern Ilotel<br />\nrow at College Park. This meetSaturdaY., April 24. George Plater<br />\ning is awaited with much interest<br />\nWagner was elected secretary and<br />\nas the old rivals appear to be eventreasurer and George M. Berry<br />\nly matched and should afford any<br />\nnon-fraternity member.<br />\nPlans<br />\nspectators some stirring competiwere made for a dance following<br />\ntion.<br />\nthe lacrosse game with Maryland.<br />\nScore of :Hatches<br />\nThere will not be a tea dance next<br />\nHopkins versus Catholic University<br />\nSaturday due to the game at<br />\nSINGLES<br />\nSwarth more.<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 30, 1926.<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\nSPEAKING<br />\n<br />\nFOUNDED 1897<br />\n<br />\nof<br />\n<br />\nSubscription<br />\n<br />\n, .$2.00<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postofnce at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJOHNS HOPKINS UNIVMSITY; all articles and other communications should be<br />\nBOW to the MANAGING EDITOR.<br />\nTelephone.<br />\n<br />\nHomewood 0100<br />\n<br />\nEditor-in-Chief<br />\nJ. HENRY JARRETT, '27<br />\n<br />\nBusiness Manager<br />\nEUGENE O'DUNNE, JR., '27<br />\n<br />\nManaging Editor<br />\nCHARLES F. REESE, '27<br />\nAssistant Managing Editor<br />\nMORTON HAMBURGER, JR., '28<br />\n<br />\nAdvertising Manager<br />\nTHOMAS F. MCNEAL, '27<br />\n<br />\nColumnist<br />\nHAROLD S. GOODWIN, '26<br />\nAssociate Editors<br />\nRICHARD R. GRIFFITH, '28<br />\nBRINTON H. STONE, '27<br />\nNORMAN B. GARDINER, JR., '28<br />\nJunior Editors<br />\nRALPH KIRKLEY, '28<br />\nDONALD C. NILES, '28<br />\nLAWRENCE P. KATZENSTEIN, '28<br />\nCORNELIUS S. FRANCKLE, JR., '28<br />\nGEORGE E. BANKS, JR., '29<br />\nLEONARD B. NOLLEY, '29<br />\nROBERT S. NYBURG, '29<br />\nCOSMO G. MACKENZIE, '29<br />\nJOHN G. TuaNnuLL, '29<br />\n<br />\nCirculation Manager<br />\nHEYWARD E. BOYCE, JR., '27<br />\n<br />\nA ssistant Business Managers<br />\nLAWRENCE 0.. McCoRmicic, '28<br />\nWILLIAM BORTNER, '27<br />\nIRVING HOFFMAN, '28<br />\nDONALD C. WEILLER, '28.<br />\nSAMUEL M. HECHT, '29<br />\nLouis M. RAWLINS, '28<br />\nI-I. ADD/SON CAMPBELL, '29<br />\n<br />\nSPORTS<br />\n<br />\nPrinters of<br />\n<br />\nPrinted by King Bros., Inc., 208 N. Calvert St., Baltimore, Md.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., APRIL 30, 1926.<br />\n<br />\nOUR OWN QUEENSBURY RULES<br />\n-.<br />\nBy. half past eight this evening, the Juniors w-ill be :issembled at their banquets, and the Freshman-Sophomore banquet season will be in full swing. We have no intention of<br />\nindulging in a long discussion of the value or drawbacks of the<br />\nannual riots, or of delving into the bloody annals of past years<br />\n• a history of the famous spring sport.<br />\nin order to present<br />\nFrom the determined and confident way in which the<br />\nFreshmen have ,begun their campaign, they do not seem to<br />\nneed any information as to what the objects of the game are<br />\nor how they are obtained. All that is left for us is to offer a<br />\nlittle advice. We counsel moderation.<br />\nThe only way in which the Freshmen can learn about the<br />\nthe fine points of the banquet season is from the stories of those<br />\nwho have gone before them and on account of the unfortunate<br />\nlimifations of human nature, these stories cannot always be<br />\nstrictly depended upon. The achievements of the past always<br />\nlook bigger than they really were. For instance a senior, recounting the exploits of his youth to a group of admiring<br />\nlisteners may distinctly remember the time he killed three<br />\nsophomores, when as a matter of fact he only maimed one<br />\n(and a rather small one at that). If his memory has become a<br />\nlittle blurred in the -course of three years it is not his fault<br />\nand besides no one else -can remember- well enough- to -cheek alp •<br />\non him. The season, then is not quite the brutual affair that<br />\nall the stories beginning \"I rem' ember the time when ...\" would<br />\nlead one to believe.<br />\nWe would not have anybody believe that we are trying to<br />\nbelittle the banquet season, or to deny that it is the greatest<br />\nfun in the world, or that it should be entered into whole-heartedly There are only two things that it will be well to bear in<br />\nmind. In t* he first place, the good name of the University<br />\nshould be considered. On account of the location of the campus,<br />\na great part of the warfare *ill be waged in the city. Whenever<br />\nit is not in direct conflict with the vital issues of the campaign,<br />\nencounters in the streets, which might lead some of the uninitiated citizens to believe that Hopkins students are a gang of<br />\nthugs, should be avoided.<br />\nThe second thing to remember is that after all the whole<br />\nbanquet season is only a game after all. In the heat of battle<br />\nit is easy for a man to forget this, and to do something he will<br />\nbe sorry for afterward. Slugging and grudge fights are against<br />\nthe spirit of the thing, and have always been barred.<br />\n1 hat's all there is to it. May the best class win. And<br />\nren.1 mber—absolutely no biting in the - clinches.<br />\n<br />\nPHARMACISTS<br />\n<br />\nPHILOLOGICAL & SCIENTIFIC<br />\nPUBLICATIONS<br />\n23 S. Hanover St., Baltimore.<br />\n<br />\nOne of the great surprises of<br />\nthe Penn Relays held at Philadelphia last week was the defeat<br />\nof Francis Hussey, Boston College star sprinter, who equaled<br />\nthe indoor record for the hundred<br />\nyard dash last winter at the Hopkihs-Fifth Regiment games. Hester of Michigan won the hundred<br />\nin 10 1-10 seconds, while Hussey<br />\nwas only able to place fourth.<br />\nThe winning of the two-mile<br />\nrace by Jimmy Loucks of Syracuse was another complete surprise. Victor Chapman, a sophomore at Wisconsin, who had won<br />\nthe Western Conference indoor<br />\ntwo-mile last month, had been expected to lead the field easily, but<br />\non the last lap he was overhauled<br />\nby the Syracuse runner, who won<br />\nby fully ten yards.<br />\nThe University of Maryland,<br />\nwith the famous quartet of Sheriff, Tkomas, Mathews and Endslow, won their mile relay against<br />\nFordham and New- York University in the fast-time of 3.23 3-5s.<br />\n*<br />\n*<br />\n*<br />\n*<br />\n<br />\nUNIVERSITY PARKWAY<br />\nAt Charles St.<br />\nVernon 4986<br />\n<br />\n'<br />\n<br />\n4'<br />\nis<br />\nis<br />\n<br />\nde<br />\n,,. The4<br />\nete<br />\n,,<br />\n,,<br />\n,<br />\n•<br />\n'<br />\n1p. This Shoe Wins on Points'<br />\n<br />\n•tI.<br />\n<br />\nI.<br />\ni'<br />\n16<br />\n,<br />\ni<br />\nf<br />\nt<br />\n<br />\nF<br />\n<br />\ntif.<br />\n1._<br />\n<br />\n;4.<br />\nt<br />\n1:<br />\n<br />\nThe famous athletic coach. Dr.<br />\net<br />\nsigne the\"Athle.\"<br />\nMeanwell,ded<br />\nWhen put to any test where foot<br />\nwork counts, this remarkable shoe<br />\ngives the greatest comfort and de,<br />\npendability Note carefully the<br />\noutstanding new features of the<br />\n\"Athkte: •<br />\nPrices. Men's$2.75;Women's$2.5o:<br />\nBoy's $2.5o; Youth's $2.5o. Ask<br />\nyour dealer first. If you have to<br />\norder direct, we will deliver shoes<br />\nof your size through the dealer<br />\n.<br />\nwhose name you mention.<br />\n<br />\n,<br />\n<br />\nExclusive Features<br />\n<br />\n-I Pure crepe gum sole. Same<br />\n-L. quality as any higher priced<br />\nMeanwell basketball shoes.<br />\nOrthopaedic heel with arch sup.<br />\nport. Scientific last which sup,<br />\nports instep and foot muscles.<br />\nStub<br />\ntpper toeguarCls (patent ap. plied for) to give utmost protec.<br />\ntion against toe knocks.<br />\nA Specially treated canvas top re,<br />\n.<br />\n\"T sists wear and hard usage.<br />\n<br />\n2<br />\n3<br />\n<br />\nThe Maryland tennis team -has<br />\nan opportunity to win the state<br />\nchampionship next week. Hopkins will be met at College Park<br />\nnext Saturday, and since Maryland has beaten both St. Johns<br />\nand Western Maryland, if they<br />\nare victorions next week, they will<br />\nwith this victory annex the state<br />\nchampionship.<br />\nAs Hopkins lost two of the<br />\nmatches played so far, the prospects of victory seem none too<br />\nbright. The plan of selecting a<br />\nteam from the tennis ladder evidently is not a successful one. In<br />\nthe match against Catholic University last Friday, which was<br />\nlost by the score of 7 to 2, the<br />\nteam showed a distinct lack of<br />\npractice.<br />\n•<br />\n•<br />\nThe combined Oxford-Cambridge<br />\nlacrosse team seems to have gotten<br />\nin the habit of losing, their last<br />\ngame resulting in a 6-4 victory for<br />\nSt. Stephens.<br />\n*<br />\n* •*<br />\n*<br />\n*<br />\nAs was expected The lacrosse<br />\ngame with Army, with the exception of the last fifteen minutes of<br />\nplay, was one of the most closely<br />\ncontested, played at Homewood in<br />\nthe last few years. Superior stickwork and better ability to dodge<br />\nwere the most important factors<br />\nof the success of •Jays, although<br />\nRobinson's speed and -accurate<br />\nshooting were instrumental. The<br />\ndefense, probably the most experienced one in the East, played<br />\nan exceptionally strong game,<br />\nArmy scoring only one earned<br />\ngoal. The work of Gerstmeyer as<br />\nan extra, who not only kept his<br />\nman well covered but also scored<br />\ntwo goals himself, was especially<br />\nnoteworthy..<br />\n<br />\nii4<br />\n..,<br />\n,<br />\n,,<br />\n,<br />\n<br />\n,i<br />\n',<br />\n<br />\n'<br />\n<br />\nFree—Send for Dr. Meanwell's booklet \"The Making of an Athlete\".<br />\n<br />\nERVII<br />\nSPORTSHOES<br />\nWe have an interesting proposition for (<br />\nDealers, Athletic Coaches and Camp<br />\nDirectors. Write for inforrnation.<br />\n<br />\nSEA<br />\n<br />\n,p<br />\n<br />\nATHJ_<br />\n<br />\n•<br />\n<br />\n‘sr/00.6.-,<br />\n<br />\n.<br />\n<br />\nA<br />\n/.;.•<br />\n<br />\ni<br />\n<br />\n*<br />\n0--,,,<br />\n<br />\n1<br />\n<br />\nNo<br />\nolent<br />\ndraw<br />\ntontr<br />\nPus E<br />\neS<br />\n'<br />\nof<br />\nin se<br />\ntuell<br />\nclose.<br />\nColle<br />\nof a<br />\nYear<br />\ntidin<br />\ncond(<br />\noph<br />\nof b(<br />\nPant.<br />\nand (<br />\nLa<br />\nan<br />\nPut t<br />\n• fresh<br />\nand<br />\nalate<br />\n<br />\nTh<br />\nhate<br />\n<br />\n7/.17Z/<br />\n..,•\"/\":///,<br />\ne///:/'<br />\n.4 •<br />\n•.',/,:/.',•':/j<br />\n<br />\n/<br />\n,<br />\n4./6.7<br />\n/4/.<br />\n4.;<br />\n,<br />\n//;,•4\",<br />\nRoland Locke of the University<br />\nz,:,.,•<br />\n<br />\nof Xebraska ran the 100-yard dash<br />\nin 9 5-10 for a new world's record<br />\nin the Drake relay carnival Satur.<br />\nday. but the mark will probably<br />\nnot be allowed, as he was favored<br />\nby a strong wind blowing at his<br />\nback. Last week Locke at the<br />\nKansas relays equaled the record<br />\nof 9 6-10.<br />\n*<br />\n*<br />\n*<br />\n*<br />\n*<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\n<br />\n,• •<br />\n<br />\n& Company<br />\nJ. H. FURST CO. R. G.Loy<br />\n(Robert G. Loy)<br />\n<br />\n•<br />\n.<br />\n<br />\nTHE SERVUS RUBBER COMPANY-ROCK ISLAND,ILLINOIS<br />\nts..s.a.s.suans.a.a.s.a.s.s.s.a..s.a.a.a.s.4.4.4.4.4.4.4.44.4.44.44.1•4•4•4•44++4,444.<br />\n<br />\n.11Pon<br />\nWhicl<br />\nties,<br />\n<br />\ndent.<br />\ngall(<br />\nUlty<br />\n4 ho<br />\nthat<br />\nou<br />\n<br />\nA,<br />\na•rou!<br />\nby t<br />\nEIar<br />\n<br />\nAoill11111111111*<br />\n<br />\nbig<br />\n<br />\n4inal<br />\nThe Training School for Jewish Social Work offers a fifteen months' course of graduate study in Jewish Family<br />\nCase Work, Child Care, Community Centers, Federations<br />\nand Health Centers.<br />\nSeveral tuition scholarships and maintenance fellowships<br />\nare available to especially qualified students.<br />\nFor further information, address the Director,<br />\nSOCIAL WORK<br />\n(Initiated by the National Conference of Jewish Social Service)<br />\nNew York City<br />\n210 West 91st Street<br />\n<br />\nTIRE TRAINING SCHOOL FOR JEWISH<br />\n<br />\ntngl<br />\nlion<br />\n<br />\ntatio<br />\nat<br />\ngum]<br />\nblind<br />\ndorm<br />\nt'ecor<br />\ngreat<br />\nocia<br />\nprow<br />\nTh<br />\n'Wudi<br />\nfavoi<br />\n<br />\n411.na<br />\nrent.<br />\nlirge(<br />\nkitres;<br />\nI Of ut<br />\n'tiler<br />\nTh<br />\n4ve<br />\n<br />\nVisit England and Scotland—see the scenic<br />\nsplendors ofthe lands ofShakespeare and Burns.<br />\nVisitez Paris, la yule de la gaiete, vivacite,<br />\narts.<br />\nBezoekt Holland—het land van tulpen en<br />\nwindmolens, van kanalen en dijken en boeren<br />\nop klompen.<br />\nBezoekt Belgie,en aanschouwt de slagvelden<br />\nwaardoor dit dappere kleine koninkrijk onsterfelijk is geworden.<br />\nVisitate L'Italia—Roma, ii centro della pia<br />\npotente fede religiosa—Il Lago Di Como, possessore orgoglioso del pia glorioso ed incantevole<br />\nscenario del mondo.<br />\nAnd go via<br />\nCUNARD COLLEGE SPECIALS<br />\nMR. DONALD WHITE<br />\n<br />\n$170<br />\n$190<br />\nRound Trip<br />\n<br />\nTOURIST THIRD CABIN<br />\n<br />\nHomewood A.pts., Baltimore, Md.<br />\nCUNARD & ANCHOR LINES<br />\nore<br />\nuzei<br />\n107'E. Baloro<br />\n<br />\nAtntslialtini<br />\n<br />\nrho<br />\n<br />\nhers<br />\nown<br />\nwith<br />\nUri<br />\njust<br />\n<br />\nthe i<br />\n<br />\nottise<br />\n<br />\n'411ao<br />\n<br />\ntlet<br />\n%WI<br />\nthis .<br />\n<br />\nTh<br />\nN to<br />\n)111eitt<br />\n444d,<br />\nto ac<br />\nketio(<br />\n<br />\n\f,<br />\n<br />\n3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 30, 1926.<br />\n<br />\nINTERCOLLEGIATE<br />\n<br />\nNEWS<br />\nNow that the student governInents at various universities are<br />\ndrawing up the rules which will<br />\ncontrol the first part of the camPus existence of the embryo classes'of 1930, it becomes evident that<br />\nin several cases the day of pelllaell class rushes is drawing to a<br />\nclose. The freshmen of Midland<br />\nCollege advocate the substitution<br />\nOf a sports contest early in the<br />\nYear as the best method for detiding class .supremacy. They<br />\ncondemn the traditional FroshSoph battles not on the grounds<br />\nof bodily danger to the particiPants, but as inciters. of personal<br />\nand class enmity.<br />\nLast Saturday, in ihe form of<br />\nau inter-class track meet, Yale<br />\nPut this new plan to the test. The<br />\nfreshmen W011 by a score of 77-49,<br />\nand brought to light • promis:ng,<br />\nInaterial for the varsity..<br />\nThrough the work of the Interfraternity Council, the State of<br />\nMississippi has been prevailed<br />\n.Upon to repeal a law made in 1912<br />\nWhich prohibited college fraternities, says a note in The New Student. Chapters may now be inStalled under the control of a faculty committee, but none may own<br />\na house for five years, in order<br />\nthat all fraternities ma-y be placed<br />\n04 an equal footing.<br />\n*<br />\n<br />\n1<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nA great deal of interest has been<br />\naroused in intercollegiate circles<br />\nby the recommendation of the<br />\ntiarvard Student Council that its<br />\nbig university be divided into six<br />\n4inaller colleges, on the syle of an<br />\ntnglish university. This suggestion was made in a report on edueation, following a similar action<br />\nat Bowdoin and• Dartmouth.<br />\nSmall colleges of about three<br />\nhundred students each housed in<br />\ndormitories by themselves, were<br />\nrecommended as offering the<br />\ngreatest opportunities for greater<br />\nocial development and social<br />\nProgress.<br />\nThe Council, relates the New<br />\ntudent, further declared itself in<br />\nfavor of limitation of freshmen,<br />\n411d keeping down the number of<br />\nUnassimilable\".students to ten per<br />\ntent. of the entire body. It also<br />\nurged that the college lay more<br />\n4ress on the cultural development<br />\n0f undergraduates rather than on<br />\n'<br />\nmere wisdom.\"<br />\nThis report was the . result of<br />\n4ve months study On the part of a<br />\nNinnittee of ten undergraduates<br />\nho conferred with faculty members and students, both of their<br />\n°Wu and other colleges, as well as<br />\nkith prominent educational authorities. Since the report has<br />\nJust been officially presented to<br />\nthe university trustees it may be<br />\noule* time before any decision is<br />\n.4unounced.<br />\n<br />\nSOPHS LEAD FRESHMEN<br />\nIN BANQUET WAR<br />\n(Continued from p. 1, col. 2)<br />\n<br />\nPhone: Homewood 9621<br />\n<br />\nCome to the<br />\n<br />\nBOULEVARD RESTAURANT<br />\nKINS STUDENTS<br />\n<br />\n- - VISIT -<br />\n<br />\nTHE TENT<br />\n<br />\nROfiERS PEET COMPANY<br />\n<br />\nAND<br />\n<br />\nThe Embassy<br />\n<br />\nClub<br />\n<br />\nA few reasons why The Guardian<br />\n• Life Insurance Company of Amer• ica is the ideal Life Insurance<br />\nCompany for you to represent.<br />\n•<br />\nits<br />\n•<br />\njj I. Its great financial strength —<br />\nincome from investments alone be%<br />\ning considerably more than enough<br />\nto pay all death claims.<br />\n•<br />\n2. Its fairness in dealing with policy-<br />\n<br />\nholders.<br />\n•<br />\n• 3. Its history of consistent healthy<br />\n%<br />\ngrowth since its birth, in 1860.<br />\n4. Its willingness to co-operate with<br />\nits representatives in the field.<br />\n•<br />\n5. Its careful selection of only the<br />\nhighest grade representatives.<br />\n•<br />\n6. Its personal instruction and supervision of new personnel.<br />\n%<br />\n• 7. Its automatic guarantee of success<br />\nto the man who properly fits him•<br />\n•<br />\nself for the business.<br />\n8. Its opportunities extended to its<br />\nfield force in advancement.<br />\n<br />\n• G. A. Myer, Mgr. T<br />\n<br />\nM<br />\n<br />\nJACK SCHERR'S ORCHESTRA<br />\n<br />\nSAFE DEPOSIT & TRUST COMPANY<br />\n<br />\nMAILBAG<br />\n<br />\nOF BALTIMORE<br />\n<br />\n13 SOUTH STHEET<br />\n<br />\n\\cws-Lettcr:<br />\n<br />\nDear Sir:<br />\nOrganized 1864<br />\nWhy is it that students are<br />\noccasionally sent to the Student<br />\nCouncil by the Dean for the offense' of talking in the libraries,<br />\nwhen the librarians themselves<br />\ntake the privilege of talking upon<br />\nany and all occasions. -I do not<br />\nrefer to any but the library .on<br />\nthe third floor of Gilman'Hall. It<br />\npossesses the great advantage over<br />\nthe main library of being at most<br />\ntimes well ventilated and at an<br />\nendurable temperature. Yet -the<br />\nyoung lady to whom the enforcement of the SILENCE rule is evidently entrusted seems to have the<br />\ntt<br />\ntime of her life, giggling, laughing, and chatting with her friends<br />\nand talking in a loud tone over<br />\nher \"Hush-a-phone.\"<br />\n<br />\nTHE GUARDIAN LIFE INSURANCE<br />\nCOMPANY OF AMERICA<br />\nFounded 1860<br />\nBaltimore_Md. $<br />\nM 423 Munsey Bldg.<br />\nr:riA%<br />\n<br />\n•<br />\n<br />\nNEWS-LETTER<br />\n<br />\nTo the Editor of t/<br />\n<br />\nJohn J. Nelligan, President.<br />\n<br />\n.<br />\nTourist<br />\nthirdcabin<br />\n<br />\ntoEUROPE<br />\nWith college parties on<br />\nfamous\"0\"steamers of<br />\n<br />\nThe Royal Mail Line<br />\nUniversity Tours with College Credit:<br />\nORM June 19 ORDUNA,June 26<br />\nORBITA, July 3<br />\nWritefor illustrated booklet<br />\nTHE ROYAL MAIL STEAM PACKET CO.<br />\n26 Broadway, New York<br />\n<br />\n$300 in cash Prizes<br />\nto college students only, for the best<br />\ncopy\"advertising'the wonderful new<br />\n<br />\nIts a nice place to sutdy, and a<br />\nlarge number of my friends would<br />\nlike to be able to use it for that<br />\npurpose.<br />\nSincerely,<br />\n'27.<br />\n<br />\nPalm Beach Patterns<br />\nfor young men /<br />\n28 CHANCES TO WIN!<br />\n41 First prize<br />\n<br />\n.<br />\n• • . . $100<br />\nSecond prize<br />\n• • • . . $ 50<br />\nc_Third prize • • •<br />\n. $ 25<br />\n4r,25 prizes of • .<br />\n• • $ 5<br />\n<br />\nBEFRIENDS SERGEANT FRANK<br />\n<br />\nTo the Editor of the News-Letter:<br />\nDear Sir:<br />\n<br />\nWith sunny skies, robins and<br />\nbluebirds, has come an • influx of<br />\nautomobiles on the Hopkins campus. Resurrected from dismal recesses of hibernation, snorting<br />\nlustily in the warmth •of April<br />\nsunshine, a long line of heretofore<br />\nunnoticed specimens of automobiledom daily trail tip - the Barn<br />\ndrive and form in regular lines<br />\nextending around the curve leading to the Civil Engineering<br />\nBuilding. Others crowd into the<br />\nparking spaces provided for the<br />\nChemistry Laboratory and the<br />\nMechanical Engineering Building.<br />\nSergeant \"Frank\" Maher, kept<br />\nbusy directing the Spring—en1\". M. C. A. Men Go To<br />\nlivened flivers is coping with the<br />\nSherwood Forest situation in no uncertain manner.<br />\nSeveral members of the \"Y\" cabi- Although reports from other colnet will attend a Cabinet Training leges indicate trouble over campus<br />\n°ouference at Sherwood Forest automobile disputes, it redounds<br />\ntills week-end.<br />\nto Sergeant Maher's credit that<br />\nThe purpose of the Conference Hopkins thus far has been free<br />\nla to give an opportunity for all from traffic disorders apparently<br />\nItneuthers of the Cabinets.in Mary- so common at other institutions.<br />\n'and, Delaware, and Washington, We doff our hats to Sergeant<br />\nte acquire an understanding of the \"Frank.\"<br />\n4/3Noeiation's work.<br />\nGRATEFUL FLIVERITES.<br />\n• ._<br />\n<br />\n%<br />\n<br />\n%<br />\n<br />\n99 ,...<br />\nFANCY DELICATESSEN<br />\nEngineering<br />\nm<br />\n\"GUARDIAN<br />\n2022 N. Charles St., Ballo., Md.<br />\nDance SPECIAL RATES FOR HOP-<br />\n<br />\nstalwarts ready to kidnap the<br />\nyearlings' president. Two of the<br />\nTONIGHT<br />\naforementioned froSh esca-ped with<br />\na little pummeling and a lecture C. E. HALL<br />\n9:00 P. M.<br />\nupon the inadvisability of inter,<br />\nAll Hopkins Students and<br />\nfering with soph meetings, but the<br />\n•Friends cordially invited<br />\nthird had to suffer the ignominy<br />\nof being relieved of his shoes, $1.50 a Couple<br />\n$1.00 Stag<br />\nsocks, and trousers, and parading<br />\n*up and:down the main corridor of<br />\nthe Civil Engineering Building.<br />\nIt has been rumored that a number of the professors having freshBOSTON<br />\nMen and sophomores in their NEW YORK<br />\nwith<br />\nthe<br />\nclasses are dispensing<br />\nEverything Men Wear!<br />\nroll call next week, and some of<br />\nthe more pessimistic ones have<br />\neven gone so far as to call off their At the Students Activity Building<br />\nlectures; to save themselves the emALL DAY TO-DAY!<br />\nbarrassment of talking to empty<br />\nchairs.<br />\n<br />\nSILENCE!<br />\n<br />\nWhy<br />\n<br />\nIdeas will count More than words.<br />\n100 words is the limit. Cleverness<br />\nwill help, but ads must be true and<br />\nin- keeping with the quality of<br />\nPalm Beach Cloth.(Contest closes<br />\nJune .30, 1926. (Ask your dealer<br />\nto show you the new shades and<br />\npatterns. Then send your suggestion, and your home address to the<br />\n.<br />\nnec<br />\nI<br />\nisdro.o.WVAfgaic1X5.9.4:81tgra o ea.,1<br />\nLook for this label. It is sewn in<br />\nevery genuine Palm Beach Suit.<br />\n<br />\nAD CONTEST COMMITTEE, PALM<br />\nBEACH MILLS, GOODALL WORSTED<br />\nCOMPANY, SANFORD,MAINE.<br />\n<br />\nIn event of tie, the full award will be made in each case<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 30, 1926.<br />\n<br />\n4<br />\nHULLABALOO DEDICATED<br />\nTO DR. REMSEN<br />\n<br />\n12,940 NAMES IN NEW<br />\nHOPKINS DIRECTORY<br />\n<br />\nYear Book Will Include History Of<br />\nUniversity's Progress<br />\n<br />\nHalf-Century Committee Publishes<br />\nList—First Complete Catalogue<br />\n<br />\nThe 1926 Hullabaloo, embracing<br />\nThe Johns Hopkins Half-Cen426 pages of snapshots, drawings tury Directory, containing a cataand write-ups, has been sent to logue of the Trustees, Faculty,<br />\npress. A proof for approval is holders of Honorary Degrees, and<br />\nexpected to be completed by May students, graduates and non-grad10. The annual of the fiftieth an- uates from 1876 to 1926, has reniversary of •the University has cently appeared. This work has<br />\nbeen appropriately dedicated to been, compiled by W. Norman<br />\n<br />\nHome—HO. 2059-J<br />\nspring was, according to Dr. Phone, Cal. 1380<br />\nBrinckmann not so much of a fail- FRANCES T. BANNON<br />\nure as it is generally pointed out Successor to HARBAUGH & BANNON<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\nto be. If a decision had been<br />\n(Room 28)<br />\nStenographic Dictation, Oopying,<br />\nreached at that meeting the result<br />\nMultigraphing, Mimeographing<br />\nwould have been disastrous for<br />\nBaltimore, Md.<br />\neither the German or the French<br />\ngovernment. It is necessary for<br />\nCOLLEGIATE STYLE<br />\nGermany to have a seat in the<br />\ncouncil of the League, and to be<br />\ngiven full privileges for this • ROBBINS' HATS<br />\nalone will show that the League<br />\nof Nations is not an instrument<br />\nA BIRD OF A HAT<br />\nin the hands of the great powers.<br />\nGeneva, the capital of the League,<br />\n32 East Baltimore Street<br />\nshould be the neutral debating<br />\nground for all nations of the<br />\nFormerly LeBrou Co.<br />\nworld.<br />\n<br />\nYoung Men's Furnishings<br />\nWhere The Prices Are Right.<br />\n<br />\nMc PHERSON'S<br />\n11 E. BALTIMORE ST.<br />\n<br />\nrrAJDUCITILS<br />\n<br />\ncatinsore<br />\nDr. Ira Remsen, the sole surviving Brown and is the first complete<br />\nmember of the original faculty. A catalogue of its kind.<br />\n\"Displaying the latest in Spring<br />\ncomplete history of the UniverSuitings and Overcoatings at<br />\nIt includes the names of 12,940<br />\nthe Barn every Thursday.\" .<br />\nsity giving the progress in its fifty individuals, of whom, 1,348 are<br />\nyears of existence is being fea- dead or reported dead. Of the<br />\nSee \"GIRD\" MAUMEE & FRANK MEREDITH at the Barn<br />\ntured with twenty pages of views. living, there are only 330 whose<br />\nDowntown at 407 N. GAY St.<br />\nA humorous resume of the college addresses have not been secured.<br />\nyear is being included. Besides the<br />\nThis is the first directory of the<br />\nregular snapshots of seniors, there<br />\nDeveloping<br />\nwill also be ten pages of snapshots University that has endeavored to<br />\nKodaks<br />\n115-117 L. Baltimore St., Corner Grant<br />\nPrinting<br />\nCameras<br />\nof doings during the year, such as include all students who attended<br />\nHart Schaffner (sz Mar( Clothes<br />\nEnlarging<br />\nSupplies<br />\nthe collegiate cab contest and the and left without receiving degrees.<br />\nKiddies Party.<br />\nThe Directory is divided into<br />\nZepp Photo Supply Co.<br />\nIn all there will be 284 photothree parts, one giving the names<br />\ngraphs and thirty drawings. The<br />\nof all individuals in alphabetical<br />\n3044 Greenmount Ave.<br />\ndrawings will be of a serious nature instead of humorous as has order and information concerning<br />\npreviously been the custom. The them, the second a catalogue of<br />\nLet Us Develop Your Films<br />\ncopy, when sent to the press, in- names in school, departmental<br />\nLeave Them Today—<br />\nN. W. COR. EUTAW & FAYETTE STS.<br />\ncluded 628 typewritten pages and class -lists, and the last, the<br />\nGet Them Tomorrow<br />\nweighing twelve and one-half<br />\ngeographical distribution of the<br />\nWHILE IN COLLEGE HAVE A SAVINGS ACCOUNT.<br />\npounds. The senior questionnaire<br />\nSPECIAL SALE<br />\nindividuals.<br />\nWHEN<br />\nYOU FINISH SCHOOL, GET IN TOUCH WITH A<br />\nhas been completed but the editor<br />\nAll forty-eight states are repre- GOOD NATIONAL BANK FOR HELP AND ADVICE.<br />\nof the Hullabaloo has not released<br />\nSWARTHMORE<br />\nOUR OFFICERS WILL BE GLAD TO TALK WITH YOU.<br />\nthe results. The only answer ob- sented in the latter category, Mary-1<br />\nBRUYERE PIPES<br />\ntainable is that ninety per cent. land leading the list' with over<br />\nHEYWARD E. BOYCE, President<br />\nof the senior class would marry four<br />\nRegular Price, $2.00<br />\nthousand,.and Nevada bringfor money.<br />\nWith this coupon and $1.00<br />\ning up the rear with two of its<br />\nThe advertising of the HullabaLimited Number<br />\nloo has set a new record mark of sons on the list. New York City<br />\n*1,500, a total of $500 more than runs a bad second to Baltimore<br />\nTHE BARN<br />\nany,previous publication.<br />\nin distribution by cities.<br />\nE. E. ADAMS<br />\n<br />\nHenry's<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\n<br />\nHub<br />\n<br />\nHEIDELBERG PROFESSOR<br />\nSPEAKS<br />\n<br />\ngovernment which the League of<br />\nNations is trying to establish.<br />\n(Continued from p. 1, col. 3)<br />\nThis was clearly shown in the<br />\nthere will probably be no restora- constitution which !the German<br />\n<br />\ntion in Germany, for the true de- government adopted after the revmocracy is now united with the olution in 1918. This constitution<br />\nspirit of nationalism.\"<br />\nrecognized the code of internaThe German idea of democracy tional law set forth by the League<br />\nis one in which the individual is of .Nations, and declared the firm<br />\npart of the civic corporation) a intention of the government to upsystem in which a.federal govern- hold these principles in its legislament is truly representative of the tion. The German people were<br />\nentire people. .To help carry out therefore disappointed when shortthis idea the new German govern- ly after the establishment of the<br />\nment has greatly weakened the League, they applied for admispower of the small states and has sion to it and were refused. It<br />\ncreated an economic council to aid was the first -time that a people<br />\nin preparing economic legislation. had ever been held responsible<br />\n<br />\nGave Second Talk<br />\nOn April 28<br />\nThat Germany is receptive to<br />\nthe League of Nations, pursuing<br />\nmiddle course between rash enthusiasm on the one hand and<br />\nan abhorrence on the other was the<br />\nthought expressed by Dr. Carl<br />\nBrinckmann, professor of politic-al science at the University of<br />\nHeidelberg, in a lecture on \"Germany's attitude toward the League<br />\nOf Nations\" given- at the Civil Engineering building on April 27.<br />\nIn this period through which<br />\nthe German government is passing there is wide divergence of<br />\nopinion concerning the League.<br />\nThere is, however, a steady drift<br />\n<br />\ntoard the theory that Germany<br />\nshbuld take her place in the Dem.i<br />\nora tic system ,.of<br />\nS.<br />\n<br />\nfor a war.<br />\nThe League, however, Dr.<br />\nBrinckmann pointed out, shortly<br />\nbegan to develop differently from<br />\nwhat had originally been intended,<br />\nand from the Wilsonian policy<br />\nwhich it had at the start, it<br />\nseemed to become an instrument<br />\nin the hands of a few great Euro<br />\npean powers. When Germany<br />\nsaw this change it began to lose<br />\nhope of ever securing the solution<br />\nof the European affair. During<br />\nthe period of the inflation of the<br />\nGerman currency the work of the<br />\nDawes commission .had much to<br />\ndo with bringing about a change<br />\nin this feeling. France, which before had objected to Germany's<br />\nentrance into the League, now<br />\nchanged her policy, and encouraged this. In a, manner the Wilsonian character returned to the<br />\nLeague, and Germany was glad<br />\nto enter with some reservations.<br />\nThe meeting at Geneva this<br />\n<br />\nDown Charles, to Baltimore St.<br />\nThe clothing store<br />\nthat knows the difference<br />\nbetween real and imitation College style<br />\n<br />\nBETHOLIN<br />\n\"THE WONDER MOTOR FUEL:<br />\n<br />\nSPRING IS HERE,—<br />\nTHE OPEN ROAD<br />\nBECKONS.<br />\n<br />\nPayne & Merrill<br />\n<br />\nSHERWOOD BROS., INC.<br />\n<br />\nCLOTHIERS<br />\nHABERDASHERS<br />\n315 Charles Street North<br />\n<br />\nINVESTMENT SECURITIES<br />\n<br />\nSTEIN BROS. & BOYCE<br />\nEstablished 1853<br />\n<br />\n6 S. Calvert Street<br />\nBALTIMORE, MARYLAND<br />\n<br />\nFURNITURE OF QUALITY<br />\nDeal with a Firm equipped with 57 years' Experience.<br />\nOur Salesmen are Specialists, everyone carefully trained to handle<br />\nyour Problems efficiently.<br />\nYou should get the benefit of our Expert Knowledge and Ability.<br />\n<br />\nYOU NEED A<br />\nTYPEWRITER!<br />\nEvery Student these days must<br />\nhave a typewriter (or borrow one).<br />\nYou'll get along better this term<br />\nif you buy your typewriter now<br />\nand get accustomed to using it<br />\nbefore heavy work sets In.<br />\nWe are agents for CORONA<br />\nFOUR. This new typewriter, illustrated above, is the most complete<br />\nportable made today. It has the<br />\nstandard, four-row keyboard, and<br />\nthe widest carriage of any portable typewriter, the longest ribbon<br />\nof any standard keyboard portable, back spacer and margin release on keyboard, perfect, unobo<br />\nstructed visibility—and it's made<br />\nby the pioneer manufacturers of<br />\nportable typewriters who have<br />\nhad 18 years' experience in building typewriters for college use.<br />\nCome and see this new machine<br />\ntoday. It costs only $60.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\n_DECORATIONS<br />\n<br />\nDRAPERIES<br />\n<br />\n343 NORTH. CHARLES STREET<br />\nAPPROPRIATE APPAREL FOR THOSE OF<br />\nCONSERVATIVE AND COLLEGIATE TASTES.<br />\n<br />\nHOCHSCHILD,KOHN 8c Co.<br />\nLEXINGTON AND HOWARD<br />\n<br />\nHESS TYPEWRITER CO.<br />\nINCORPORATED<br />\n<br />\nPl. 2229<br />\n<br />\n19 W FAYETTE ST.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXX, No. 49<br /><br />\n-HOMEWOOD, BALTIMORE, MD., APRIL 30, 1926.<br /><br />\nTENNIS TEAM WINS ONE<br />\nMATCH AND DROPS<br />\nANOTHER .<br />\n-St. Johns Is Whitewashed But Jays<br />\nLose To Catholic University<br />\nBy Score of<br /><br />\n5-2.<br /><br />\nTRUSTEES ELECT<br />\n3 NEW MEMBERS<br />\nJ. Hall\" Pleasants, President of the Alumni Council,<br />\nJudge Eli prank, and Carlyle<br />\nBarton, have recently been<br />\nchosen as permanent members of the University Board<br />\nof Trustees, in accordance<br />\nwith a resolution of the<br />\nBoard to increase its membership from twelve.to eightteen, exclusive of the President of the University.<br />\nThe Alumni Council will<br />\nmeet soon to *select a new<br />\npresident, who, will be exofficio member of the Board<br />\nof Trustees, as Dr. Pleasants<br />\nwas before his 'permanent<br />\nappointment.<br /><br />\nHEIDELBERG PROFESSOR<br /><br />\nDESCRIBES NEW<br />\nDEMOCRACY<br />\nDr. Carl Brinckmann Traces Course<br />\nOf Democratic Ideas<br /><br />\n• Germanic Countries<br /><br />\nIn<br /><br />\nPRICE 5 CENTS<br /><br />\nBLACK AND BLUE SQUADS<br />\nINVADE FOREIGN FIELDS<br />\nHomewood Field Deserted As Lacrosse And<br />\nTrack Teams Play Elsewhere Tomorrow<br /><br />\nStick -Wenders Clash With<br />\nCinder Stars To Race Against<br />\nThat democracy and national<br />\nSwarthmore Twelve<br />\nLafayette At Easton<br />\nunity based upon the firm foundaJohns Hopkins track men leave , Swarthmore will be hosts to the<br />\ntion of the German people are<br />\ntoday at 3.57 P. M.for Easton, Pa., Johns Hopkins lacrosse team todefinitely joined was the thought where they will engage Lafayette morrow in the fifth game of a<br />\nexpressed by Dr,Carl Brinckmann College in the second dual meet schedule that will find its climax<br />\nof the University of Heidelberg, of the season. Johns Hopkins has in the Hopkins-Maryland game at<br />\nin a public lecture delivered at the never *on a track meet from I lomewood. Earlier in the season<br />\nCivil Engineering Building on Lafayette. Hopkins lost to them Swarthmore held Maryland 4 to 2.<br />\nin 1924 by a narrow margin, in a<br />\nMuch can be said in favor.of the<br />\nApril 26 on \"Germany's Idea of<br />\nmeet that was, close from begin- Pennsylvanians. They not only<br />\nDemocracy.\"<br />\nning to end, the final result being have an experienced team, but a<br />\nBriefly, Dr. Brinckmann outlined in doubt until the last race was team that will give . the Jays a<br />\nthe course of democracy in the over. The Blue Jays will have hard ganie. On the starting lineGermanic lands. Here, he said, the edge in the dash and weight up will appear ten letter men of<br />\nevents. This year the Lafayette the team that held Hopkins to a<br />\nthere was a sort of primitive desquad seem to have concentrated 7-3 score last year. It took some<br />\nmocracy, which grew up about<br />\nin bringing about an evident su-, time for the Blue team -Co strike<br />\nthe tithe of the Roman. Empire. periority in middle and long disits stride in the 1925 game.<br />\nIt was distinguished by a large tance events. _<br />\nSWarthmore Strong<br />\ndegree of individual liberty and a<br />\nIt is difficult to estimate the<br />\nalways expectant of a<br />\nFans<br />\nare<br />\ntotal absence of class privileges. comparative strength of the two<br />\nbattle<br />\nwhen these two teams meet.<br />\nAt the end of the Middle Ages, the •squads because tomorrow's event<br />\ngreat western countries began. to will be the first dual meet that However, when Swarthmore gets<br />\nbe built up, imposing upon the the Pennsylvania College has had Hopkins on its Pennsylvania lot,<br />\ndemocratic systems feudal ones this spring, The only comparison the Quaker lads are harder than<br />\nwhich tended to the more efficient that can be made is by using the ever to take into camp. Even if<br />\nadministration of the nation. For approximate times made at the they lose, they put up a fighting<br />\nframe.<br />\nthe time the primitive democracy Penn Relays.<br />\nwas lost sight of, and greater<br />\nUndoubtedly,, last Saturday,<br />\n\"Bob\" Heyn, who sustained a<br />\nstress laid on national unity. wrenched side and a spiked leg when Hopkins triumphed over<br />\nOnce achieved, however, the prim- in the Navy meet, has partially Army, they compiled a nice paraRegan, Catholic University, defeated<br />\nitive democracy returned,. and as recovered and is expected to an- graph or two of lacrosse history.<br />\nHebner, Hopkins, 2-6; 6-4, 11-9.<br />\nfrequent bursts of nationalism nex both the century and 220. In Lacrosse enthusiasts will recall<br />\nBlock, Hopkins, defeated Kiwaski, Field Club Visits<br />\nshow, it developed hand<br />\nCatholic University, 6-3, 6-4.<br />\nhand the quarter-mile a very close race the skill and daring of individuals<br />\nDisposal Plant with the idea of national in<br />\nHicks, Catholic University, defeated<br />\nis expected since the time of La- and the smoothness of the comunity.<br />\nAccompanied by several stuLevinstein, Hopkins, 6-4, 1-6, 8-6.<br />\nfayette's<br />\nbest man and Hemmeter bined attack which brought the<br />\nGermany Democratic<br />\nGardes, Catholic University, defeat- dents in biology and bacteriology,<br />\nis<br />\nBig Blue team from behind to<br />\nnearly<br />\nthe same.<br />\ned Wasserman, Hopkins, 7-5, 4-6, 6-0. the<br />\nIn Germany, however, pointed<br />\nField Club took a very inDistance Strengthened<br />\nburst into the glorious scoring bee<br />\nDeBuskey, Hopkins, defeated Riorstructive trip through the Balti- out Dr. Brinckmann, this growth<br />\nHopkins has faced a weakness which more than twice turned the<br />\ndan, Catholic University, 8-6, 6-0.<br />\nmore Sewage Disposal Plant at of the nation took a far different in the half-mile all year and with<br />\ntables on Army.<br />\nDOUBLES<br />\nBack River last Saturday morn- course. The administration of the a view of correcting this defect,<br />\nKiwaski and Regani.Catholic UniThe game last week was the first<br />\nHoly Roman Empire was a most<br />\nversily, defeated Block and Wasser- ing.<br />\nCoach Edwards has shifted Scow hard contest of the season. It was<br />\nThe party of fifty were told of democratic system, preserving as to this event. Due to Lafayette's<br />\nman, Hopkins, 3-6, 6-4, 6-4.<br />\nalso the first of a series of games<br />\nHicks and Riordan, Catholic Uni- the operation of the plant and it did, the independence of every<br />\ngreat strength in this distance, it that will tax 'the Jays to pracversity, defeated Levinstein and De- heard<br />\nlectures by the chemist and separate jurisdiction. The growth is hardly expected that a blue.<br />\ntically their fullest resources.<br />\nBuskey, Hopkins, 6-4, 6-4.<br />\nbacteriologist stationed there. The of the German government saw jerseyed man will win the race.<br />\nSwarthmore, while not quite so<br />\nplant consists mainly of settling the wide deliverance of the essen- In the mile and two-mile runs the<br />\nHopkins versus St. Johns<br />\nhard as Army,* will not be easy.<br />\ntanks and a \"sprinkler field out in tials, democracy and unity. In the Easton track men also look like<br />\nSINGLES<br />\nArmy did not play them to a 2-1<br />\nSouth and West the old primitive winners.<br />\nHebner, Hopkins, defeated Snyder, the open with only the laboravictory for the fun of it. A one<br />\ndemocracy<br />\nhad held on and contories<br />\nand<br />\noperating<br />\nSt. Johns, 6-2, 6-2.<br />\nmachinery<br />\nHopkins low-hurdlers will face point lead never has been a comtinued to dominate the political a great difficulty<br />\nGoldstein, Hopkins, defeated Clarke, under a roof.<br />\nin that they will fortable margin.<br />\nSt. Johns, 6-3, 6-2.<br />\naction of the people. In the East not have a<br />\nstraightaway<br />\nto run<br />\nBlock, Hopkins, defeated Von Hartz,<br />\nand North, two *great German this event in, but<br />\nArmy Defensive<br />\nThree<br />\nwill<br />\nFunctions<br />\nhave<br />\nto beSt. Johns, 6-1, 6-3.<br />\nstates,<br />\nAustria<br />\nand<br />\nPrussia,<br />\nStill<br />\ngrew<br />\nit<br />\nhas been noised that the<br />\nLevinste.in, Hopkins, defeated Smith,<br />\nConflict Tonight up, paying more attention to the come accustomed to running the Army coach advised his team to<br />\nSt. Johns, 6-3, 6-1.<br />\nobstacles around a curve, and from<br />\nThree functions are conflicting administrative and bureaucratic<br />\nWasserman,<br />\nHopkins,<br />\nscore one more goal on Hopkins,<br />\ndefeated<br />\na \"stagger start.\"<br />\non the campus tonight. The Jun- side than to the democratic, a fact<br />\nO'Neil, St. Johns, 4-6, 6-1, 6-4.<br />\nIn the field events it looks as and, with the score 3-2, to hold the<br />\niors will hold their annual ban- which may be accounted for when<br />\nDOUBLES<br />\nthough the Blue Jays have a Jays by playing an extra man on<br />\nHebner and Goldstein, Hopkins, de- quet at the Hopkins<br />\nApartments, we consider that their populations slight superiority. Heyn,<br />\nbecause the defense. Not a bad idea if the<br />\nfeated Von Hartz and Clarke, St.<br />\nthe Tudor-Stuart Club will have were German mixed with Slavic.<br />\nof<br />\nhis<br />\nwrenched side, will com- best plans of the finest coaches<br />\nJohns, 6-2, 6-3.<br />\ntheir annual elections in the club In 1813, the German states tried<br />\nBlock and Levinstein, Hopkins, depete in the pole vault only if the were not frequently doomed to defeated Smith and Snyder, St. Johns, rooms, and the Engineers' Club to gain unity, and at the same score is close and he<br />\nstands a good struction.<br />\nwill give a dance in the C. E. Hall. time to keep their democracy.<br />\n7-9, 6-4, 6-2.<br />\nArmy did not realize just exactchance of scoring. - Vivell will<br />\nThis, however, was not done until take care of the jumps,<br />\nand it is ly what it was up against and<br />\n1918, when complete democracy very doubtful if the maroon<br />\nCLASS OF 1928 TAKES EARLY LEAD<br />\nand they received their first defeat. , It<br />\nIN ANNUAL BANQUET WARFARE and national unity were joined. white will be able to produce any would be a calamity for the Jays<br />\nmen that will equal the efforts of to spoil their record tomorrow in<br />\nChanges Come Slowly<br />\nSCORE':<br />\nHills<br />\nand Gilpin in the weight the enemy camp.<br />\n.\"Great changes,\" said Dr.<br />\nSophs 1.<br />\nFrosh 0.<br />\nevents.<br />\nThe team is now in the middle<br />\nBrinckmann, \"do not come about<br />\nof its season with 'a total of 52<br />\novernight; they are the result of<br />\nNo, this isn't a ball game, or a but their rivals can boast much<br />\npoints scored as opposed to the<br />\ndeep causes and must go through Cane Clubbers<br />\nclass rush. It's the banquet sea- valuable experience. The present<br />\nopposition, 4. That is a record<br />\na long transition period. This is<br />\nTap<br />\nEleven<br />\nand the sophomores drew first sophomores, it will be recalled,<br />\nevidenced by the fact that in sevEleven men were tapped for the not exceeded by any Hopkins team.<br />\nblood when they discovered three saw some of their mates spend a<br />\neral democratic countries of Eu- Cane Club last Monday. They But in spite of the fact that the<br />\nPoor little freshmen hiding in the few hours in a cell in the Central<br />\nrope there are many who would were Ashbury, Beale, Boynton, credit balance stands at 48, it is<br />\nProjection room of the C. E. Hall Police Station last year because like<br />\nto see the old- systems back Cushing, Devereaux, Hasbrouck, still possible to make or mar a<br />\ntrying to learn their plans for the they had been too energetic in<br />\nagain. . In France, for instance, Hobbs, Moyer, Schwinn, Wagner, beautiful record.<br />\nannual feast. spoiling the fun of the present .here is<br />\na large party -who would and Warfield. The tapping was . The team will go up to SwarthThe real fun, however, won't be- juniors, then sophs.<br />\nlike to see the return of the mon- done in the usual manner, on the more tomorrow 'with tough propogin until, after tonight, the -date<br />\nThe three freshmen who were 4rchy. In Germany, however, upper quadrangle and then the sition staring it in the face. The<br />\nof the junior banquet. From then captured claim that it was'worth<br />\nfeudalism did not last, and the. procession drove down to \"Gray chances are two to one they will<br />\n°II, -there will be free and unre- the trouble, for they found out 'democratic<br />\nsystem was not laid Goose. Inn\"..fOr lunch. Monday win, but in Swarthmore's *own<br />\n'tricte'd *warfare. The freshmen<br />\n_ that the sophomores had twenty a.gide so long. For &amp;his reason night\"d-inoie- complete celebration backyard they will never win in a<br />\nhay: the advantage of numbers,(Continued, on p.--3, col. 2)<br />\n(Continued on p. 4, col. 1)<br />\nwas held.<br />\nwalk.<br />\nThe Hopkins tennis team dropped one match and won one last<br />\nweek, losing to Catholic University, 5 matches to 2 and beating<br />\nSt. John, 7-0. Both matches were<br />\nplayed at Homewood, the first on<br />\nFriday and the second Saturday.<br />\nThe contest with Catholic University was an impromptu affair,<br />\nnot being scheduled and was arranged only on the spur of the<br />\nmoment. Regan, playing number<br />\none for Catholic University, and<br />\nCaptain Hebner of Hopkins,<br />\nstarred in a hard fought struggle<br />\nwhich ran into the full three sets,<br />\nHebner winning theArst 6-2, losing the second 6-4, and losing out Charles Lord To<br />\nonly after a bitterly contested<br />\nHead Cotillion Club<br />\nfinal set by an 11-9 count.<br />\nCharles G. Lord was elected<br />\nThe Jays will stack up -against<br />\npresident of the Cotillion Club at<br />\nthe Maryland racqueters tomora banquet at the Southern Ilotel<br />\nrow at College Park. This meetSaturdaY., April 24. George Plater<br />\ning is awaited with much interest<br />\nWagner was elected secretary and<br />\nas the old rivals appear to be eventreasurer and George M. Berry<br />\nly matched and should afford any<br />\nnon-fraternity member.<br />\nPlans<br />\nspectators some stirring competiwere made for a dance following<br />\ntion.<br />\nthe lacrosse game with Maryland.<br />\nScore of :Hatches<br />\nThere will not be a tea dance next<br />\nHopkins versus Catholic University<br />\nSaturday due to the game at<br />\nSINGLES<br />\nSwarth more.<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 30, 1926.<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\nSPEAKING<br /><br />\nFOUNDED 1897<br /><br />\nof<br /><br />\nSubscription<br /><br />\n, .$2.00<br /><br />\nEntered as second-class matter December 3, 1909, at the Postofnce at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJOHNS HOPKINS UNIVMSITY; all articles and other communications should be<br />\nBOW to the MANAGING EDITOR.<br />\nTelephone.<br /><br />\nHomewood 0100<br /><br />\nEditor-in-Chief<br />\nJ. HENRY JARRETT, '27<br /><br />\nBusiness Manager<br />\nEUGENE O'DUNNE, JR., '27<br /><br />\nManaging Editor<br />\nCHARLES F. REESE, '27<br />\nAssistant Managing Editor<br />\nMORTON HAMBURGER, JR., '28<br /><br />\nAdvertising Manager<br />\nTHOMAS F. MCNEAL, '27<br /><br />\nColumnist<br />\nHAROLD S. GOODWIN, '26<br />\nAssociate Editors<br />\nRICHARD R. GRIFFITH, '28<br />\nBRINTON H. STONE, '27<br />\nNORMAN B. GARDINER, JR., '28<br />\nJunior Editors<br />\nRALPH KIRKLEY, '28<br />\nDONALD C. NILES, '28<br />\nLAWRENCE P. KATZENSTEIN, '28<br />\nCORNELIUS S. FRANCKLE, JR., '28<br />\nGEORGE E. BANKS, JR., '29<br />\nLEONARD B. NOLLEY, '29<br />\nROBERT S. NYBURG, '29<br />\nCOSMO G. MACKENZIE, '29<br />\nJOHN G. TuaNnuLL, '29<br /><br />\nCirculation Manager<br />\nHEYWARD E. BOYCE, JR., '27<br /><br />\nA ssistant Business Managers<br />\nLAWRENCE 0.. McCoRmicic, '28<br />\nWILLIAM BORTNER, '27<br />\nIRVING HOFFMAN, '28<br />\nDONALD C. WEILLER, '28.<br />\nSAMUEL M. HECHT, '29<br />\nLouis M. RAWLINS, '28<br />\nI-I. ADD/SON CAMPBELL, '29<br /><br />\nSPORTS<br /><br />\nPrinters of<br /><br />\nPrinted by King Bros., Inc., 208 N. Calvert St., Baltimore, Md.<br /><br />\nHOMEWOOD, BALTIMORE, MD., APRIL 30, 1926.<br /><br />\nOUR OWN QUEENSBURY RULES<br />\n-.<br />\nBy. half past eight this evening, the Juniors w-ill be :issembled at their banquets, and the Freshman-Sophomore banquet season will be in full swing. We have no intention of<br />\nindulging in a long discussion of the value or drawbacks of the<br />\nannual riots, or of delving into the bloody annals of past years<br />\n• a history of the famous spring sport.<br />\nin order to present<br />\nFrom the determined and confident way in which the<br />\nFreshmen have ,begun their campaign, they do not seem to<br />\nneed any information as to what the objects of the game are<br />\nor how they are obtained. All that is left for us is to offer a<br />\nlittle advice. We counsel moderation.<br />\nThe only way in which the Freshmen can learn about the<br />\nthe fine points of the banquet season is from the stories of those<br />\nwho have gone before them and on account of the unfortunate<br />\nlimifations of human nature, these stories cannot always be<br />\nstrictly depended upon. The achievements of the past always<br />\nlook bigger than they really were. For instance a senior, recounting the exploits of his youth to a group of admiring<br />\nlisteners may distinctly remember the time he killed three<br />\nsophomores, when as a matter of fact he only maimed one<br />\n(and a rather small one at that). If his memory has become a<br />\nlittle blurred in the -course of three years it is not his fault<br />\nand besides no one else -can remember- well enough- to -cheek alp •<br />\non him. The season, then is not quite the brutual affair that<br />\nall the stories beginning \"I rem' ember the time when ...\" would<br />\nlead one to believe.<br />\nWe would not have anybody believe that we are trying to<br />\nbelittle the banquet season, or to deny that it is the greatest<br />\nfun in the world, or that it should be entered into whole-heartedly There are only two things that it will be well to bear in<br />\nmind. In t* he first place, the good name of the University<br />\nshould be considered. On account of the location of the campus,<br />\na great part of the warfare *ill be waged in the city. Whenever<br />\nit is not in direct conflict with the vital issues of the campaign,<br />\nencounters in the streets, which might lead some of the uninitiated citizens to believe that Hopkins students are a gang of<br />\nthugs, should be avoided.<br />\nThe second thing to remember is that after all the whole<br />\nbanquet season is only a game after all. In the heat of battle<br />\nit is easy for a man to forget this, and to do something he will<br />\nbe sorry for afterward. Slugging and grudge fights are against<br />\nthe spirit of the thing, and have always been barred.<br />\n1 hat's all there is to it. May the best class win. And<br />\nren.1 mber—absolutely no biting in the - clinches.<br /><br />\nPHARMACISTS<br /><br />\nPHILOLOGICAL &amp; SCIENTIFIC<br />\nPUBLICATIONS<br />\n23 S. Hanover St., Baltimore.<br /><br />\nOne of the great surprises of<br />\nthe Penn Relays held at Philadelphia last week was the defeat<br />\nof Francis Hussey, Boston College star sprinter, who equaled<br />\nthe indoor record for the hundred<br />\nyard dash last winter at the Hopkihs-Fifth Regiment games. Hester of Michigan won the hundred<br />\nin 10 1-10 seconds, while Hussey<br />\nwas only able to place fourth.<br />\nThe winning of the two-mile<br />\nrace by Jimmy Loucks of Syracuse was another complete surprise. Victor Chapman, a sophomore at Wisconsin, who had won<br />\nthe Western Conference indoor<br />\ntwo-mile last month, had been expected to lead the field easily, but<br />\non the last lap he was overhauled<br />\nby the Syracuse runner, who won<br />\nby fully ten yards.<br />\nThe University of Maryland,<br />\nwith the famous quartet of Sheriff, Tkomas, Mathews and Endslow, won their mile relay against<br />\nFordham and New- York University in the fast-time of 3.23 3-5s.<br />\n*<br />\n*<br />\n*<br />\n*<br /><br />\nUNIVERSITY PARKWAY<br />\nAt Charles St.<br />\nVernon 4986<br /><br />\n'<br /><br />\n4'<br />\nis<br />\nis<br /><br />\nde<br />\n,,. The4<br />\nete<br />\n,,<br />\n,,<br />\n,<br />\n•<br />\n'<br />\n1p. This Shoe Wins on Points'<br /><br />\n•tI.<br /><br />\nI.<br />\ni'<br />\n16<br />\n,<br />\ni<br />\nf<br />\nt<br /><br />\nF<br /><br />\ntif.<br />\n1._<br /><br />\n;4.<br />\nt<br />\n1:<br /><br />\nThe famous athletic coach. Dr.<br />\net<br />\nsigne the\"Athle.\"<br />\nMeanwell,ded<br />\nWhen put to any test where foot<br />\nwork counts, this remarkable shoe<br />\ngives the greatest comfort and de,<br />\npendability Note carefully the<br />\noutstanding new features of the<br />\n\"Athkte: •<br />\nPrices. Men's$2.75;Women's$2.5o:<br />\nBoy's $2.5o; Youth's $2.5o. Ask<br />\nyour dealer first. If you have to<br />\norder direct, we will deliver shoes<br />\nof your size through the dealer<br />\n.<br />\nwhose name you mention.<br /><br />\n,<br /><br />\nExclusive Features<br /><br />\n-I Pure crepe gum sole. Same<br />\n-L. quality as any higher priced<br />\nMeanwell basketball shoes.<br />\nOrthopaedic heel with arch sup.<br />\nport. Scientific last which sup,<br />\nports instep and foot muscles.<br />\nStub<br />\ntpper toeguarCls (patent ap. plied for) to give utmost protec.<br />\ntion against toe knocks.<br />\nA Specially treated canvas top re,<br />\n.<br />\n\"T sists wear and hard usage.<br /><br />\n2<br />\n3<br /><br />\nThe Maryland tennis team -has<br />\nan opportunity to win the state<br />\nchampionship next week. Hopkins will be met at College Park<br />\nnext Saturday, and since Maryland has beaten both St. Johns<br />\nand Western Maryland, if they<br />\nare victorions next week, they will<br />\nwith this victory annex the state<br />\nchampionship.<br />\nAs Hopkins lost two of the<br />\nmatches played so far, the prospects of victory seem none too<br />\nbright. The plan of selecting a<br />\nteam from the tennis ladder evidently is not a successful one. In<br />\nthe match against Catholic University last Friday, which was<br />\nlost by the score of 7 to 2, the<br />\nteam showed a distinct lack of<br />\npractice.<br />\n•<br />\n•<br />\nThe combined Oxford-Cambridge<br />\nlacrosse team seems to have gotten<br />\nin the habit of losing, their last<br />\ngame resulting in a 6-4 victory for<br />\nSt. Stephens.<br />\n*<br />\n* •*<br />\n*<br />\n*<br />\nAs was expected The lacrosse<br />\ngame with Army, with the exception of the last fifteen minutes of<br />\nplay, was one of the most closely<br />\ncontested, played at Homewood in<br />\nthe last few years. Superior stickwork and better ability to dodge<br />\nwere the most important factors<br />\nof the success of •Jays, although<br />\nRobinson's speed and -accurate<br />\nshooting were instrumental. The<br />\ndefense, probably the most experienced one in the East, played<br />\nan exceptionally strong game,<br />\nArmy scoring only one earned<br />\ngoal. The work of Gerstmeyer as<br />\nan extra, who not only kept his<br />\nman well covered but also scored<br />\ntwo goals himself, was especially<br />\nnoteworthy..<br /><br />\nii4<br />\n..,<br />\n,<br />\n,,<br />\n,<br /><br />\n,i<br />\n',<br /><br />\n'<br /><br />\nFree—Send for Dr. Meanwell's booklet \"The Making of an Athlete\".<br /><br />\nERVII<br />\nSPORTSHOES<br />\nWe have an interesting proposition for (<br />\nDealers, Athletic Coaches and Camp<br />\nDirectors. Write for inforrnation.<br /><br />\nSEA<br /><br />\n,p<br /><br />\nATHJ_<br /><br />\n•<br /><br />\n‘sr/00.6.-,<br /><br />\n.<br /><br />\nA<br />\n/.;.•<br /><br />\ni<br /><br />\n*<br />\n0--,,,<br /><br />\n1<br /><br />\nNo<br />\nolent<br />\ndraw<br />\ntontr<br />\nPus E<br />\neS<br />\n'<br />\nof<br />\nin se<br />\ntuell<br />\nclose.<br />\nColle<br />\nof a<br />\nYear<br />\ntidin<br />\ncond(<br />\noph<br />\nof b(<br />\nPant.<br />\nand (<br />\nLa<br />\nan<br />\nPut t<br />\n• fresh<br />\nand<br />\nalate<br /><br />\nTh<br />\nhate<br /><br />\n7/.17Z/<br />\n..,•\"/\":///,<br />\ne///:/'<br />\n.4 •<br />\n•.',/,:/.',•':/j<br /><br />\n/<br />\n,<br />\n4./6.7<br />\n/4/.<br />\n4.;<br />\n,<br />\n//;,•4\",<br />\nRoland Locke of the University<br />\nz,:,.,•<br /><br />\nof Xebraska ran the 100-yard dash<br />\nin 9 5-10 for a new world's record<br />\nin the Drake relay carnival Satur.<br />\nday. but the mark will probably<br />\nnot be allowed, as he was favored<br />\nby a strong wind blowing at his<br />\nback. Last week Locke at the<br />\nKansas relays equaled the record<br />\nof 9 6-10.<br />\n*<br />\n*<br />\n*<br />\n*<br />\n*<br /><br />\nMember Southern Intercollegiate Newspaper Association<br /><br />\n,• •<br /><br />\n&amp; Company<br />\nJ. H. FURST CO. R. G.Loy<br />\n(Robert G. Loy)<br /><br />\n•<br />\n.<br /><br />\nTHE SERVUS RUBBER COMPANY-ROCK ISLAND,ILLINOIS<br />\nts..s.a.s.suans.a.a.s.a.s.s.s.a..s.a.a.a.s.4.4.4.4.4.4.4.44.4.44.44.1•4•4•4•44++4,444.<br /><br />\n.11Pon<br />\nWhicl<br />\nties,<br /><br />\ndent.<br />\ngall(<br />\nUlty<br />\n4 ho<br />\nthat<br />\nou<br /><br />\nA,<br />\na•rou!<br />\nby t<br />\nEIar<br /><br />\nAoill11111111111*<br /><br />\nbig<br /><br />\n4inal<br />\nThe Training School for Jewish Social Work offers a fifteen months' course of graduate study in Jewish Family<br />\nCase Work, Child Care, Community Centers, Federations<br />\nand Health Centers.<br />\nSeveral tuition scholarships and maintenance fellowships<br />\nare available to especially qualified students.<br />\nFor further information, address the Director,<br />\nSOCIAL WORK<br />\n(Initiated by the National Conference of Jewish Social Service)<br />\nNew York City<br />\n210 West 91st Street<br /><br />\nTIRE TRAINING SCHOOL FOR JEWISH<br /><br />\ntngl<br />\nlion<br /><br />\ntatio<br />\nat<br />\ngum]<br />\nblind<br />\ndorm<br />\nt'ecor<br />\ngreat<br />\nocia<br />\nprow<br />\nTh<br />\n'Wudi<br />\nfavoi<br /><br />\n411.na<br />\nrent.<br />\nlirge(<br />\nkitres;<br />\nI Of ut<br />\n'tiler<br />\nTh<br />\n4ve<br /><br />\nVisit England and Scotland—see the scenic<br />\nsplendors ofthe lands ofShakespeare and Burns.<br />\nVisitez Paris, la yule de la gaiete, vivacite,<br />\narts.<br />\nBezoekt Holland—het land van tulpen en<br />\nwindmolens, van kanalen en dijken en boeren<br />\nop klompen.<br />\nBezoekt Belgie,en aanschouwt de slagvelden<br />\nwaardoor dit dappere kleine koninkrijk onsterfelijk is geworden.<br />\nVisitate L'Italia—Roma, ii centro della pia<br />\npotente fede religiosa—Il Lago Di Como, possessore orgoglioso del pia glorioso ed incantevole<br />\nscenario del mondo.<br />\nAnd go via<br />\nCUNARD COLLEGE SPECIALS<br />\nMR. DONALD WHITE<br /><br />\n$170<br />\n$190<br />\nRound Trip<br /><br />\nTOURIST THIRD CABIN<br /><br />\nHomewood A.pts., Baltimore, Md.<br />\nCUNARD &amp; ANCHOR LINES<br />\nore<br />\nuzei<br />\n107'E. Baloro<br /><br />\nAtntslialtini<br /><br />\nrho<br /><br />\nhers<br />\nown<br />\nwith<br />\nUri<br />\njust<br /><br />\nthe i<br /><br />\nottise<br /><br />\n'411ao<br /><br />\ntlet<br />\n%WI<br />\nthis .<br /><br />\nTh<br />\nN to<br />\n)111eitt<br />\n444d,<br />\nto ac<br />\nketio(<br /><br />\n,<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 30, 1926.<br /><br />\nINTERCOLLEGIATE<br /><br />\nNEWS<br />\nNow that the student governInents at various universities are<br />\ndrawing up the rules which will<br />\ncontrol the first part of the camPus existence of the embryo classes'of 1930, it becomes evident that<br />\nin several cases the day of pelllaell class rushes is drawing to a<br />\nclose. The freshmen of Midland<br />\nCollege advocate the substitution<br />\nOf a sports contest early in the<br />\nYear as the best method for detiding class .supremacy. They<br />\ncondemn the traditional FroshSoph battles not on the grounds<br />\nof bodily danger to the particiPants, but as inciters. of personal<br />\nand class enmity.<br />\nLast Saturday, in ihe form of<br />\nau inter-class track meet, Yale<br />\nPut this new plan to the test. The<br />\nfreshmen W011 by a score of 77-49,<br />\nand brought to light • promis:ng,<br />\nInaterial for the varsity..<br />\nThrough the work of the Interfraternity Council, the State of<br />\nMississippi has been prevailed<br />\n.Upon to repeal a law made in 1912<br />\nWhich prohibited college fraternities, says a note in The New Student. Chapters may now be inStalled under the control of a faculty committee, but none may own<br />\na house for five years, in order<br />\nthat all fraternities ma-y be placed<br />\n04 an equal footing.<br />\n*<br /><br />\n1<br /><br />\n*<br /><br />\n*<br /><br />\nA great deal of interest has been<br />\naroused in intercollegiate circles<br />\nby the recommendation of the<br />\ntiarvard Student Council that its<br />\nbig university be divided into six<br />\n4inaller colleges, on the syle of an<br />\ntnglish university. This suggestion was made in a report on edueation, following a similar action<br />\nat Bowdoin and• Dartmouth.<br />\nSmall colleges of about three<br />\nhundred students each housed in<br />\ndormitories by themselves, were<br />\nrecommended as offering the<br />\ngreatest opportunities for greater<br />\nocial development and social<br />\nProgress.<br />\nThe Council, relates the New<br />\ntudent, further declared itself in<br />\nfavor of limitation of freshmen,<br />\n411d keeping down the number of<br />\nUnassimilable\".students to ten per<br />\ntent. of the entire body. It also<br />\nurged that the college lay more<br />\n4ress on the cultural development<br />\n0f undergraduates rather than on<br />\n'<br />\nmere wisdom.\"<br />\nThis report was the . result of<br />\n4ve months study On the part of a<br />\nNinnittee of ten undergraduates<br />\nho conferred with faculty members and students, both of their<br />\n°Wu and other colleges, as well as<br />\nkith prominent educational authorities. Since the report has<br />\nJust been officially presented to<br />\nthe university trustees it may be<br />\noule* time before any decision is<br />\n.4unounced.<br /><br />\nSOPHS LEAD FRESHMEN<br />\nIN BANQUET WAR<br />\n(Continued from p. 1, col. 2)<br /><br />\nPhone: Homewood 9621<br /><br />\nCome to the<br /><br />\nBOULEVARD RESTAURANT<br />\nKINS STUDENTS<br /><br />\n- - VISIT -<br /><br />\nTHE TENT<br /><br />\nROfiERS PEET COMPANY<br /><br />\nAND<br /><br />\nThe Embassy<br /><br />\nClub<br /><br />\nA few reasons why The Guardian<br />\n• Life Insurance Company of Amer• ica is the ideal Life Insurance<br />\nCompany for you to represent.<br />\n•<br />\nits<br />\n•<br />\njj I. Its great financial strength —<br />\nincome from investments alone be%<br />\ning considerably more than enough<br />\nto pay all death claims.<br />\n•<br />\n2. Its fairness in dealing with policy-<br /><br />\nholders.<br />\n•<br />\n• 3. Its history of consistent healthy<br />\n%<br />\ngrowth since its birth, in 1860.<br />\n4. Its willingness to co-operate with<br />\nits representatives in the field.<br />\n•<br />\n5. Its careful selection of only the<br />\nhighest grade representatives.<br />\n•<br />\n6. Its personal instruction and supervision of new personnel.<br />\n%<br />\n• 7. Its automatic guarantee of success<br />\nto the man who properly fits him•<br />\n•<br />\nself for the business.<br />\n8. Its opportunities extended to its<br />\nfield force in advancement.<br /><br />\n• G. A. Myer, Mgr. T<br /><br />\nM<br /><br />\nJACK SCHERR'S ORCHESTRA<br /><br />\nSAFE DEPOSIT &amp; TRUST COMPANY<br /><br />\nMAILBAG<br /><br />\nOF BALTIMORE<br /><br />\n13 SOUTH STHEET<br /><br />\n\\cws-Lettcr:<br /><br />\nDear Sir:<br />\nOrganized 1864<br />\nWhy is it that students are<br />\noccasionally sent to the Student<br />\nCouncil by the Dean for the offense' of talking in the libraries,<br />\nwhen the librarians themselves<br />\ntake the privilege of talking upon<br />\nany and all occasions. -I do not<br />\nrefer to any but the library .on<br />\nthe third floor of Gilman'Hall. It<br />\npossesses the great advantage over<br />\nthe main library of being at most<br />\ntimes well ventilated and at an<br />\nendurable temperature. Yet -the<br />\nyoung lady to whom the enforcement of the SILENCE rule is evidently entrusted seems to have the<br />\ntt<br />\ntime of her life, giggling, laughing, and chatting with her friends<br />\nand talking in a loud tone over<br />\nher \"Hush-a-phone.\"<br /><br />\nTHE GUARDIAN LIFE INSURANCE<br />\nCOMPANY OF AMERICA<br />\nFounded 1860<br />\nBaltimore_Md. $<br />\nM 423 Munsey Bldg.<br />\nr:riA%<br /><br />\n•<br /><br />\nNEWS-LETTER<br /><br />\nTo the Editor of t/<br /><br />\nJohn J. Nelligan, President.<br /><br />\n.<br />\nTourist<br />\nthirdcabin<br /><br />\ntoEUROPE<br />\nWith college parties on<br />\nfamous\"0\"steamers of<br /><br />\nThe Royal Mail Line<br />\nUniversity Tours with College Credit:<br />\nORM June 19 ORDUNA,June 26<br />\nORBITA, July 3<br />\nWritefor illustrated booklet<br />\nTHE ROYAL MAIL STEAM PACKET CO.<br />\n26 Broadway, New York<br /><br />\n$300 in cash Prizes<br />\nto college students only, for the best<br />\ncopy\"advertising'the wonderful new<br /><br />\nIts a nice place to sutdy, and a<br />\nlarge number of my friends would<br />\nlike to be able to use it for that<br />\npurpose.<br />\nSincerely,<br />\n'27.<br /><br />\nPalm Beach Patterns<br />\nfor young men /<br />\n28 CHANCES TO WIN!<br />\n41 First prize<br /><br />\n.<br />\n• • . . $100<br />\nSecond prize<br />\n• • • . . $ 50<br />\nc_Third prize • • •<br />\n. $ 25<br />\n4r,25 prizes of • .<br />\n• • $ 5<br /><br />\nBEFRIENDS SERGEANT FRANK<br /><br />\nTo the Editor of the News-Letter:<br />\nDear Sir:<br /><br />\nWith sunny skies, robins and<br />\nbluebirds, has come an • influx of<br />\nautomobiles on the Hopkins campus. Resurrected from dismal recesses of hibernation, snorting<br />\nlustily in the warmth •of April<br />\nsunshine, a long line of heretofore<br />\nunnoticed specimens of automobiledom daily trail tip - the Barn<br />\ndrive and form in regular lines<br />\nextending around the curve leading to the Civil Engineering<br />\nBuilding. Others crowd into the<br />\nparking spaces provided for the<br />\nChemistry Laboratory and the<br />\nMechanical Engineering Building.<br />\nSergeant \"Frank\" Maher, kept<br />\nbusy directing the Spring—en1\". M. C. A. Men Go To<br />\nlivened flivers is coping with the<br />\nSherwood Forest situation in no uncertain manner.<br />\nSeveral members of the \"Y\" cabi- Although reports from other colnet will attend a Cabinet Training leges indicate trouble over campus<br />\n°ouference at Sherwood Forest automobile disputes, it redounds<br />\ntills week-end.<br />\nto Sergeant Maher's credit that<br />\nThe purpose of the Conference Hopkins thus far has been free<br />\nla to give an opportunity for all from traffic disorders apparently<br />\nItneuthers of the Cabinets.in Mary- so common at other institutions.<br />\n'and, Delaware, and Washington, We doff our hats to Sergeant<br />\nte acquire an understanding of the \"Frank.\"<br />\n4/3Noeiation's work.<br />\nGRATEFUL FLIVERITES.<br />\n• ._<br /><br />\n%<br /><br />\n%<br /><br />\n99 ,...<br />\nFANCY DELICATESSEN<br />\nEngineering<br />\nm<br />\n\"GUARDIAN<br />\n2022 N. Charles St., Ballo., Md.<br />\nDance SPECIAL RATES FOR HOP-<br /><br />\nstalwarts ready to kidnap the<br />\nyearlings' president. Two of the<br />\nTONIGHT<br />\naforementioned froSh esca-ped with<br />\na little pummeling and a lecture C. E. HALL<br />\n9:00 P. M.<br />\nupon the inadvisability of inter,<br />\nAll Hopkins Students and<br />\nfering with soph meetings, but the<br />\n•Friends cordially invited<br />\nthird had to suffer the ignominy<br />\nof being relieved of his shoes, $1.50 a Couple<br />\n$1.00 Stag<br />\nsocks, and trousers, and parading<br />\n*up and:down the main corridor of<br />\nthe Civil Engineering Building.<br />\nIt has been rumored that a number of the professors having freshBOSTON<br />\nMen and sophomores in their NEW YORK<br />\nwith<br />\nthe<br />\nclasses are dispensing<br />\nEverything Men Wear!<br />\nroll call next week, and some of<br />\nthe more pessimistic ones have<br />\neven gone so far as to call off their At the Students Activity Building<br />\nlectures; to save themselves the emALL DAY TO-DAY!<br />\nbarrassment of talking to empty<br />\nchairs.<br /><br />\nSILENCE!<br /><br />\nWhy<br /><br />\nIdeas will count More than words.<br />\n100 words is the limit. Cleverness<br />\nwill help, but ads must be true and<br />\nin- keeping with the quality of<br />\nPalm Beach Cloth.(Contest closes<br />\nJune .30, 1926. (Ask your dealer<br />\nto show you the new shades and<br />\npatterns. Then send your suggestion, and your home address to the<br />\n.<br />\nnec<br />\nI<br />\nisdro.o.WVAfgaic1X5.9.4:81tgra o ea.,1<br />\nLook for this label. It is sewn in<br />\nevery genuine Palm Beach Suit.<br /><br />\nAD CONTEST COMMITTEE, PALM<br />\nBEACH MILLS, GOODALL WORSTED<br />\nCOMPANY, SANFORD,MAINE.<br /><br />\nIn event of tie, the full award will be made in each case<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 30, 1926.<br /><br />\n4<br />\nHULLABALOO DEDICATED<br />\nTO DR. REMSEN<br /><br />\n12,940 NAMES IN NEW<br />\nHOPKINS DIRECTORY<br /><br />\nYear Book Will Include History Of<br />\nUniversity's Progress<br /><br />\nHalf-Century Committee Publishes<br />\nList—First Complete Catalogue<br /><br />\nThe 1926 Hullabaloo, embracing<br />\nThe Johns Hopkins Half-Cen426 pages of snapshots, drawings tury Directory, containing a cataand write-ups, has been sent to logue of the Trustees, Faculty,<br />\npress. A proof for approval is holders of Honorary Degrees, and<br />\nexpected to be completed by May students, graduates and non-grad10. The annual of the fiftieth an- uates from 1876 to 1926, has reniversary of •the University has cently appeared. This work has<br />\nbeen appropriately dedicated to been, compiled by W. Norman<br /><br />\nHome—HO. 2059-J<br />\nspring was, according to Dr. Phone, Cal. 1380<br />\nBrinckmann not so much of a fail- FRANCES T. BANNON<br />\nure as it is generally pointed out Successor to HARBAUGH &amp; BANNON<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\nto be. If a decision had been<br />\n(Room 28)<br />\nStenographic Dictation, Oopying,<br />\nreached at that meeting the result<br />\nMultigraphing, Mimeographing<br />\nwould have been disastrous for<br />\nBaltimore, Md.<br />\neither the German or the French<br />\ngovernment. It is necessary for<br />\nCOLLEGIATE STYLE<br />\nGermany to have a seat in the<br />\ncouncil of the League, and to be<br />\ngiven full privileges for this • ROBBINS' HATS<br />\nalone will show that the League<br />\nof Nations is not an instrument<br />\nA BIRD OF A HAT<br />\nin the hands of the great powers.<br />\nGeneva, the capital of the League,<br />\n32 East Baltimore Street<br />\nshould be the neutral debating<br />\nground for all nations of the<br />\nFormerly LeBrou Co.<br />\nworld.<br /><br />\nYoung Men's Furnishings<br />\nWhere The Prices Are Right.<br /><br />\nMc PHERSON'S<br />\n11 E. BALTIMORE ST.<br /><br />\nrrAJDUCITILS<br /><br />\ncatinsore<br />\nDr. Ira Remsen, the sole surviving Brown and is the first complete<br />\nmember of the original faculty. A catalogue of its kind.<br />\n\"Displaying the latest in Spring<br />\ncomplete history of the UniverSuitings and Overcoatings at<br />\nIt includes the names of 12,940<br />\nthe Barn every Thursday.\" .<br />\nsity giving the progress in its fifty individuals, of whom, 1,348 are<br />\nyears of existence is being fea- dead or reported dead. Of the<br />\nSee \"GIRD\" MAUMEE &amp; FRANK MEREDITH at the Barn<br />\ntured with twenty pages of views. living, there are only 330 whose<br />\nDowntown at 407 N. GAY St.<br />\nA humorous resume of the college addresses have not been secured.<br />\nyear is being included. Besides the<br />\nThis is the first directory of the<br />\nregular snapshots of seniors, there<br />\nDeveloping<br />\nwill also be ten pages of snapshots University that has endeavored to<br />\nKodaks<br />\n115-117 L. Baltimore St., Corner Grant<br />\nPrinting<br />\nCameras<br />\nof doings during the year, such as include all students who attended<br />\nHart Schaffner (sz Mar( Clothes<br />\nEnlarging<br />\nSupplies<br />\nthe collegiate cab contest and the and left without receiving degrees.<br />\nKiddies Party.<br />\nThe Directory is divided into<br />\nZepp Photo Supply Co.<br />\nIn all there will be 284 photothree parts, one giving the names<br />\ngraphs and thirty drawings. The<br />\nof all individuals in alphabetical<br />\n3044 Greenmount Ave.<br />\ndrawings will be of a serious nature instead of humorous as has order and information concerning<br />\npreviously been the custom. The them, the second a catalogue of<br />\nLet Us Develop Your Films<br />\ncopy, when sent to the press, in- names in school, departmental<br />\nLeave Them Today—<br />\nN. W. COR. EUTAW &amp; FAYETTE STS.<br />\ncluded 628 typewritten pages and class -lists, and the last, the<br />\nGet Them Tomorrow<br />\nweighing twelve and one-half<br />\ngeographical distribution of the<br />\nWHILE IN COLLEGE HAVE A SAVINGS ACCOUNT.<br />\npounds. The senior questionnaire<br />\nSPECIAL SALE<br />\nindividuals.<br />\nWHEN<br />\nYOU FINISH SCHOOL, GET IN TOUCH WITH A<br />\nhas been completed but the editor<br />\nAll forty-eight states are repre- GOOD NATIONAL BANK FOR HELP AND ADVICE.<br />\nof the Hullabaloo has not released<br />\nSWARTHMORE<br />\nOUR OFFICERS WILL BE GLAD TO TALK WITH YOU.<br />\nthe results. The only answer ob- sented in the latter category, Mary-1<br />\nBRUYERE PIPES<br />\ntainable is that ninety per cent. land leading the list' with over<br />\nHEYWARD E. BOYCE, President<br />\nof the senior class would marry four<br />\nRegular Price, $2.00<br />\nthousand,.and Nevada bringfor money.<br />\nWith this coupon and $1.00<br />\ning up the rear with two of its<br />\nThe advertising of the HullabaLimited Number<br />\nloo has set a new record mark of sons on the list. New York City<br />\n*1,500, a total of $500 more than runs a bad second to Baltimore<br />\nTHE BARN<br />\nany,previous publication.<br />\nin distribution by cities.<br />\nE. E. ADAMS<br /><br />\nHenry's<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br /><br />\nHub<br /><br />\nHEIDELBERG PROFESSOR<br />\nSPEAKS<br /><br />\ngovernment which the League of<br />\nNations is trying to establish.<br />\n(Continued from p. 1, col. 3)<br />\nThis was clearly shown in the<br />\nthere will probably be no restora- constitution which !the German<br /><br />\ntion in Germany, for the true de- government adopted after the revmocracy is now united with the olution in 1918. This constitution<br />\nspirit of nationalism.\"<br />\nrecognized the code of internaThe German idea of democracy tional law set forth by the League<br />\nis one in which the individual is of .Nations, and declared the firm<br />\npart of the civic corporation) a intention of the government to upsystem in which a.federal govern- hold these principles in its legislament is truly representative of the tion. The German people were<br />\nentire people. .To help carry out therefore disappointed when shortthis idea the new German govern- ly after the establishment of the<br />\nment has greatly weakened the League, they applied for admispower of the small states and has sion to it and were refused. It<br />\ncreated an economic council to aid was the first -time that a people<br />\nin preparing economic legislation. had ever been held responsible<br /><br />\nGave Second Talk<br />\nOn April 28<br />\nThat Germany is receptive to<br />\nthe League of Nations, pursuing<br />\nmiddle course between rash enthusiasm on the one hand and<br />\nan abhorrence on the other was the<br />\nthought expressed by Dr. Carl<br />\nBrinckmann, professor of politic-al science at the University of<br />\nHeidelberg, in a lecture on \"Germany's attitude toward the League<br />\nOf Nations\" given- at the Civil Engineering building on April 27.<br />\nIn this period through which<br />\nthe German government is passing there is wide divergence of<br />\nopinion concerning the League.<br />\nThere is, however, a steady drift<br /><br />\ntoard the theory that Germany<br />\nshbuld take her place in the Dem.i<br />\nora tic system ,.of<br />\nS.<br /><br />\nfor a war.<br />\nThe League, however, Dr.<br />\nBrinckmann pointed out, shortly<br />\nbegan to develop differently from<br />\nwhat had originally been intended,<br />\nand from the Wilsonian policy<br />\nwhich it had at the start, it<br />\nseemed to become an instrument<br />\nin the hands of a few great Euro<br />\npean powers. When Germany<br />\nsaw this change it began to lose<br />\nhope of ever securing the solution<br />\nof the European affair. During<br />\nthe period of the inflation of the<br />\nGerman currency the work of the<br />\nDawes commission .had much to<br />\ndo with bringing about a change<br />\nin this feeling. France, which before had objected to Germany's<br />\nentrance into the League, now<br />\nchanged her policy, and encouraged this. In a, manner the Wilsonian character returned to the<br />\nLeague, and Germany was glad<br />\nto enter with some reservations.<br />\nThe meeting at Geneva this<br /><br />\nDown Charles, to Baltimore St.<br />\nThe clothing store<br />\nthat knows the difference<br />\nbetween real and imitation College style<br /><br />\nBETHOLIN<br />\n\"THE WONDER MOTOR FUEL:<br /><br />\nSPRING IS HERE,—<br />\nTHE OPEN ROAD<br />\nBECKONS.<br /><br />\nPayne &amp; Merrill<br /><br />\nSHERWOOD BROS., INC.<br /><br />\nCLOTHIERS<br />\nHABERDASHERS<br />\n315 Charles Street North<br /><br />\nINVESTMENT SECURITIES<br /><br />\nSTEIN BROS. &amp; BOYCE<br />\nEstablished 1853<br /><br />\n6 S. Calvert Street<br />\nBALTIMORE, MARYLAND<br /><br />\nFURNITURE OF QUALITY<br />\nDeal with a Firm equipped with 57 years' Experience.<br />\nOur Salesmen are Specialists, everyone carefully trained to handle<br />\nyour Problems efficiently.<br />\nYou should get the benefit of our Expert Knowledge and Ability.<br /><br />\nYOU NEED A<br />\nTYPEWRITER!<br />\nEvery Student these days must<br />\nhave a typewriter (or borrow one).<br />\nYou'll get along better this term<br />\nif you buy your typewriter now<br />\nand get accustomed to using it<br />\nbefore heavy work sets In.<br />\nWe are agents for CORONA<br />\nFOUR. This new typewriter, illustrated above, is the most complete<br />\nportable made today. It has the<br />\nstandard, four-row keyboard, and<br />\nthe widest carriage of any portable typewriter, the longest ribbon<br />\nof any standard keyboard portable, back spacer and margin release on keyboard, perfect, unobo<br />\nstructed visibility—and it's made<br />\nby the pioneer manufacturers of<br />\nportable typewriters who have<br />\nhad 18 years' experience in building typewriters for college use.<br />\nCome and see this new machine<br />\ntoday. It costs only $60.<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\n_DECORATIONS<br /><br />\nDRAPERIES<br /><br />\n343 NORTH. CHARLES STREET<br />\nAPPROPRIATE APPAREL FOR THOSE OF<br />\nCONSERVATIVE AND COLLEGIATE TASTES.<br /><br />\nHOCHSCHILD,KOHN 8c Co.<br />\nLEXINGTON AND HOWARD<br /><br />\nHESS TYPEWRITER CO.<br />\nINCORPORATED<br /><br />\nPl. 2229<br /><br />\n19 W FAYETTE ST.<br /><br />"}], "field_media_file": [{"target_id": 38057, "display": null, "description": null, "target_type": "file", "target_uuid": "8697a338-da8f-4ed1-8df9-f86b1d822eae", "url": "http://digital.library.jhu.edu/system/files/2022-03/13218-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13218, "target_type": "node", "target_uuid": "b4eab16a-fb13-40e4-a5da-a3284d1c9fbf", "url": "/node/13218"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "746d203d-acdc-4de9-a588-d88063e54422"}]}