{"mid": [{"value": 39352}], "uuid": [{"value": "9af64888-ba0d-4ff5-8d02-28574b56cfc8"}], "vid": [{"value": 39352}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T19:28:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13936-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T19:28:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T19:28:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "mit<br />\n<br />\nWeekend Weather<br />\nWatch<br />\nProbably east and west winds,<br />\nvarying northeast or southwest;<br />\nSaturn is behind the Moon.<br />\n<br />\nVOL. LXXII, NO.4<br />\n<br />\nrum1 ilirttrr<br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND,OCTOBER 20, 1967<br />\n<br />\nOn the Inside:<br />\nPaul Krassner exists.<br />\nHe tells all about it.<br />\nSee page 5.<br />\n<br />\n72ND YEAR<br />\n<br />\nBlatant Bigotry Blazes at Bradford<br />\nBook Store Rapped<br />\nAs Slow,Inefficient<br />\n<br />\n0<br />\nBRADFORD<br />\nBEAUTY<br />\n<br />\nBeauty Shop Denies<br />\nService to Negro<br />\n<br />\nBy DICK CRAMER<br />\nBy DENNIS EST1S<br />\nMrs. Geiger informed the two wothing sold at the bookstore. They now<br />\nThe Johns Hopkins Book Center has<br />\nThe wife of a Hopkins Negro gradu- men that they did not have an appointobtain no further benefits than do the<br />\ncome under much criticism lately, from<br />\nate student was twice refused an ap- ment for that time, as there was no inboth students and faculty. Opinions students. Others, students and faculty<br />\npointment for a haircut at the Bradford<br />\nalike,<br />\nare<br />\nangered<br />\nby<br />\nwhat<br />\nthey<br />\nbelieve<br />\ndication of such in her book. Neither<br />\nrange from that of Dr. Richard MackBeauty Salon last week.<br />\nwomen was allowed to see the book for<br />\nsey, Professor of Humanities, who says arc store operators' attempts to label<br />\nBetty Pink, a resident of McCoy<br />\nthemselves.<br />\n\"There has to be an improvement in the everything a1 a textbook, thus cutting<br />\nHall,<br />\ngone<br />\nhad<br />\nto<br />\nshop<br />\nthe<br />\non<br />\noccatwo<br />\ndown<br />\non<br />\nthe<br />\ndiscounts offered.<br />\nMrs. Pink then asked if she could<br />\nservice of the Book Center,\" to that of<br />\nsions. She was refused service outright<br />\nMany people, moreover, think that<br />\nmake an appointment for the next day<br />\nDennis Drew, a Negro member of the<br />\nonce.<br />\nThe second time, she was given a<br />\nor the next week, but she was told that<br />\nfreshman class, who commented, \"It the book store is poorly organized. Caphony appointment by the owner of the<br />\nthey were all filled up. She then asked<br />\nstinks, baby - - the guard is prejudiced.\" taloguing of the books by topic instead<br />\nSalon, Dottie Geiger.<br />\nby<br />\nof<br />\npublisher<br />\nis<br />\ninnovation<br />\nan<br />\nthis<br />\nif she could make an appointment for<br />\nIn response to complaints of ineffiThis incident was the most recent of<br />\nnext month. It was at this time that the..<br />\ncient operation a committee composed year and has been met with both approseveral<br />\nrecent<br />\ncharges<br />\nof<br />\ndiscrimination owner<br />\nof faculty and administration members val and dissatisfaction.<br />\ntold her that Mrs. Pink couldn't<br />\nleveled<br />\nat the shop, located in the baseBrowsers in the store feel that the<br />\nformed early last year. The faculty comment of the University-owned Bradford come at all and she couldn't be taken<br />\nsystem<br />\nis<br />\nimprovement<br />\nan<br />\nas<br />\nthey<br />\n,<br />\ncan<br />\ncare of.<br />\nmittee recommended that the store be<br />\nApartments.<br />\nrun with an eye to the academic aspect see all of the books one subject at a<br />\nMrs. Pink and Miss Williams left the<br />\nof the university instead of the business time, but people looking for specific<br />\nshop, and informed several friends and<br />\nHopkins<br />\nhas<br />\ndiscouraged<br />\nbooks<br />\nthink<br />\nsystem<br />\nthe<br />\nplanned<br />\na<br />\nless<br />\nadvantaend. This marked a major shift in poprotest by a large group of graduate stu- the victim's husband. Mr. Victor Dates,<br />\ngeous. In general, opposition to the calicy for the Book Center.<br />\nDirector of Special Programs, was condents.<br />\nIn this way,the University hoped<br />\ntaloguing is most often found among<br />\nRequests Ignored<br />\ntacted and informed of the incident.<br />\nto avoid any publicity which might<br />\nIn a study by the News-Letter, it be- professors and graduate students.<br />\nMr. Dates told Mrs. Pink on Thursforce it to take immediate action.<br />\nPerhaps the greatest complaint is<br />\ncame evident that many of the requests<br />\nday to go back to the shop. She returnPix by Frank Urrutia<br />\nThis<br />\naction<br />\nwould<br />\nthat<br />\ninefficiency,<br />\nof<br />\nhave<br />\nto<br />\ntake<br />\nwith<br />\nthe<br />\nsome<br />\nspecial<br />\nmade by the committee have been iged to the salon at approximately 1:00<br />\nnored and that others have been initia- orders taking two months to arrive. Any \"A THING OF BEAUTY is a joy for- form of a legal suit, since it is the only p.m. that afternoon and once again<br />\nreted without regard for the purpose be- book in this country can normally be ever,\" but Dottie doesn't think so. Dot- way to remove the present manage- quested an appointment.<br />\nreceived within a week.<br />\nhind the change.<br />\ntie runs Bradford Beauty Salon, where ment. The administration has promised<br />\nThis time Mrs. Geiger informed her<br />\nMrs. Pink and the graduate students<br />\n(Continued on Page 2)<br />\nNegro was refused service.<br />\nThe first recommendation, that the<br />\nthat the only available time was at 8:30<br />\nthat<br />\nGeiger's<br />\nMrs.<br />\nlease<br />\nwould<br />\nnot be reBook Center be moved to larger quarnewed when it expired in December. In a.m. on Monday morning. Mrs. Pink<br />\nters, was intended to allow for more<br />\nagreed to come back Monday at the dethe meantime, the University advised<br />\nbook space and a wider variety of<br />\nsignated hour.<br />\nMrs.<br />\nPink<br />\nnot<br />\nto<br />\nreturn<br />\nto<br />\nthe<br />\nbeauty<br />\nbooks. However, the increase in floor<br />\n(Continued on Page 2)<br />\nsalon.<br />\nand shelf space has not been matched<br />\nby a jump in the number and variety of<br />\nA similar incident occured last year,<br />\nbooks.<br />\nPoor Selection<br />\nwhen a local barber, in the Marylander<br />\nDr. Macksey says that the selection<br />\nMr. Sanford J. Rosen, attorney for time, a three-judge panel ruled against apartment, building refused to serve a<br />\nof books has improved somewhat, but Joseph Whitehill, declared that he was him.<br />\nNegro Hopkins freshman. After a strong<br />\nNow that the judges have the case, campus protest which was led<br />\nthat it still is not adequate. The Stu- \"very optimistic\" about his case before<br />\nby the<br />\nVice-President Hubert Humphrey<br />\ndent opinion was summed up by Paul the Supreme Court. Mr. Whitehill, a Mr. Rosen expects that they will reach a News Letter, the owner was influenced<br />\nwill speak to selected faculty and stuBoddner, who said, \"the selection is Johns Hopkins instructor in the writing decision by the first of the year at the to change his policy.<br />\npretty poor. I'd never go to the book- Seminars, is presently challenging the latest. He qualified his optimism by sayMrs. Geiger declined to comment on dents at Goucher College tomorrow<br />\nstore if I was just looking for something Ober Law, Maryland's employee loyalty ing that one could never really tell in the entire incident, claiming only that according to reliable sources.<br />\nThe Vice-President was invited by<br />\ngood to read.\" the disparity between oath.<br />\nHe cited the fact that the last test \"There had been a mistake, and it is all<br />\nDr. Corrin, head of the Political Science<br />\nincrease in space and stock is evident by<br />\nOn Monday, October 16, Mr. Rosen case on the oath lost by a narrow 5-4 taken care of now.\"<br />\ndepartment at Goucher. The visit has<br />\nthe fact that there is still empty shelf presented the appelate argument for his decision. Since then, one of five judges<br />\nThe incident began last week when<br />\nspaces.<br />\nclient and it then became sub judica (in \"against\" has retired \"However, we Pat Williams, made an appointment for been kept a secret to avoid crowds and<br />\nA ten percent discount on trade the hands of the judges.)This marks the can't be sure of the continuing support herself and Mrs. Pink for 10:30 a.m. demonstrations on the campus.<br />\nHumphrey will have a breakfast<br />\nbooks was also begun, last year, but has climax of more than a year of court- of the other four judges, either.\"<br />\nWednesday, October. 11<br />\nmeeting in the morning, and then will<br />\nmet increasingly with complaints. Many room activity.<br />\nArriving at the Beauty Salon at the<br />\n•<br />\nstudents feel that this small discount is<br />\nInfringement<br />\nproper time, the two women were ap- attend two meetings. The first talk will<br />\nAction<br />\nTaken<br />\nactually of no benefit while the adminMr. Whitehill and Mr. Rosen con- proached by Mrs. Geiger and asked if be with several faculty members and<br />\nistration believes that the book store is<br />\nMr. Whitehill initially took action tended in court that the Ober Law in- they were together. When the women four selected students, the second meetlosing too much money because of the in September of 1966, after being re- fringes upon the rights of free speech, replied that they were, the Beauty Shop ing will be with two professors and two<br />\nadditional students.<br />\ndiscount. But by far, the most dissatis- fused a part-time teaching post at the expression and academic freedom.<br />\nowner proceeded to skim through a<br />\nThe Vice-President is in Baltimore<br />\nfied group is the faculty, which used to University of Maryland when he deHowever, Maryland's Assistant At- book which appeared to contain aptoday to deliver an address to the AFLenjoy a ten percent discount on every- clined to sign the Loyalty Oath. At that<br />\n(Continued on Page 3)<br />\npointments.<br />\nCIO.<br />\n<br />\nWhitehill Hopeful<br />\nFor Loyalty Victory<br />\n<br />\nHHH To Visit<br />\nGoucher College<br />\n<br />\nS.A.:Of Mice And Men<br />\nRat Crackdown Planned<br />\nFor Community Clean-Up<br />\n<br />\nThe Student Association plans to wipe out the infamous Hopkins rat-nest located southeast of campus. The<br />\norganization intends to mount a rat-control campaign in<br />\nthis area utilizing volunteers from Hopkins.<br />\nThe SA's program for attack depends on the participation of the students living in the area to spearhead the<br />\ndrive. The area used in the program will be decided upon<br />\nby the amount of student interest in a given block. The<br />\nmain problem lies between Charles and Guilford, froth<br />\n27th to 33rd Sts.<br />\nSanitation Problem according to SA Co-President Jim<br />\n0<br />\nWinship, the line of attack will involve both destroying<br />\nthe rats and the conditions which breed them.\"We could<br />\neasily kill 90% of the rats in a given block, but if the<br />\nsanitation conditions in that block are not changed, the<br />\nrats will return in very short time. The Bureau of Rodent<br />\nControl of Baltimore has demonstrated this .simple fact<br />\nseveral times in their own control programs.\"<br />\nPix by Tom Hoffman<br />\nWinship outlined the specific steps to be taken. First.<br />\nTHE INCREDIBLE MULTIPLYING RAT will be the victim of a canvas of the block will be made to determine where<br />\ncourageous extermination attempt. The common rodent terror- violations of codes and health dangers exist. Thon the<br />\nresidents of the dwellings involved will be recruited to aid<br />\nizes Hoppies daily. Know Your Enemy.<br />\n(Continued on Page 3)<br />\n<br />\nSA Seeks Direct Action<br />\nPrograms to Better City<br />\nIncreased student participation in social action programs will highlight the Student Associations new drive<br />\nfor inner city involvement. Inner City tutoring program,<br />\nsponsored by the Student Association will be implemented<br />\nwith more direct action projects. The direct action programs are meant to rectify the feeling that the present<br />\ntutoring is \"too passive\" and \"merely a crutch for an<br />\ninadequate school system.\"<br />\nThough many programs have been proposed, SA CoPresidents Joe Weinberg and Jim Winship have pointed<br />\nto the lack of student support as the major stumbling<br />\nblock.<br />\nThe SA is functioning as a clearing house for Inner<br />\nCity needs. The organization, due to the many contacts<br />\nof Dr. Chester Wickwire, has channels in the city to create almost any program where student interest exists.<br />\nOne proposed plan of action is to get students who are<br />\nknowledgeable about housing regulations in Baltimore to<br />\nadvise tenants.<br />\nA student who undertook this project could receive<br />\ncredit for studying the housing court and writing a paper<br />\non this facet of city government.<br />\n(Continued on Page 3)<br />\n<br />\n\fPIN<br />\n<br />\nPAGE TWO<br />\n<br />\nNEWS-LETTER<br />\n<br />\nHOMEWOOD,BALTIMORE,OCTOBER 20, 1967<br />\nleue-VMMINIMMISIVe<br />\n<br />\nCustomers Unhappy<br />\nOver Book Center<br />\nELEPHANTS<br />\nnever forget<br />\n(and you will<br />\nalways rern.ernber)<br />\nthe fabulous<br />\n'<br />\nvalues at<br />\nTHE<br />\n<br />\nI<br />\n<br />\nSAMPLE<br />\nSTORE<br />\nEVERY<br />\nSPORTCOAT<br />\nIN STOCK<br />\nValues to $45.00<br />\n<br />\n$19<br />\nSAMPLE STORE<br />\n<br />\nIINZ<br />\n1<br />\n\"<br />\n.<br />\n<br />\n-Tiv newPlyinouth RoadRimer<br />\nnow at your Plymouth PealeAt<br />\n<br />\n3031 Greenmount Ave.<br />\nIn Waverly<br />\nOPEN EVERY EVENING<br />\n<br />\n• CNARG-1T • NAC • $1000 CLUB<br />\n<br />\nwbete the Zwatgms 0/7.MO<br />\nC1967 Varner BroL —Seven Arts, Ine.<br />\n<br />\nThe Air Force doesn't wantto<br />\nwaste your Bachelor of Science<br />\nDegree any more than you do.<br />\nB. Sc. Those letters have an impressive sound.<br />\nBut they won't be so impressive<br />\nif you get shunted off into some<br />\nobscure corner of industry after<br />\nyou leave college. A forgotten man.<br />\nYou want activity. You want to<br />\nget in there and show your stuff.<br />\nAll right. How do you propose to<br />\n<br />\ndo it?<br />\nIf you join the United States Air<br />\nForce you'll become an expert fast.<br />\n<br />\nThe Air Force is like that. They<br />\nhand you a lot of responsibility fast.<br />\nThrough Officer Training School<br />\nyou get a chance to specialize<br />\nwhere you want... in the forefront<br />\nof modern science and technology.<br />\nSuppose, for example, you<br />\nwanted to become a pilot and serve<br />\nas aircraft commander on airplane<br />\ncrews. You'd plan missions and<br />\ninsure that the aircraft is pre-flighted, inspected, loaded and equip-<br />\n<br />\nContinued from Page 1<br />\npurchase books before coming to<br />\nDr. Macksey said that he.had more school, perhaps for less money. It has<br />\ntrouble getting books for his courses been contended that the book store<br />\nthis year than he had ever had before. will not publish the lists early, so as to<br />\n\"The books simply were not there at insure itself a monopoly on the sale of<br />\nthe beginning of the term.\"<br />\ntext books.<br />\nIn one course, \"War in the Modern<br />\nWorld\" the texts did not arrive until<br />\nSome sources have suggested that<br />\nmore than two weeks after the term be- the faculty committee is giving its most<br />\ngan. Moreover, upon arrival, there were concentrated attention to a complaint<br />\na meagre ten books for the one-hundred advanced by the employees of the Censtudents in the class.<br />\nter.\"The ladies need a place to sit down<br />\nSome students propose that the and relax, out of the flow of traffic,\"<br />\nlists of required books be published in Dr. Macksey says. One female worker<br />\nthe early summer, allowing students to stated, \"There's no place to rest my<br />\nfeet.\"<br />\n<br />\nStudent's Wife<br />\nDenied Haircut<br />\n(Continued from Page 1)<br />\n<br />\nFilm, Panel Set<br />\nFor Rights Talk<br />\n<br />\nReturning to her apartment, Mrs.<br />\nThe film \"Black Natchez\" will highPink discovered from her neighbors that<br />\nthe shop was closed all day on Monday. light the third program in the StrangeShe called up Mrs. Geiger and requested land '67 series concerning \"Black Powto have the day and time of the appoint- er and White Impotence\"set for Sunday<br />\nment changed. The owner refused, night at 7:30 p.m. at Levering.<br />\nA panel discussion will follow involclaiming that she had no openings.<br />\nMrs. Pink called Mr. Dates again,and ving such local civil rights leaders as<br />\na meeting was arranged to explain to Daniel Gant from CORE, and Walter<br />\nhim what had taken place. The Univer- Carter of VISTA. One of the chief prosity received assurances from Mrs. Ge1 blems under consideration will be the<br />\nger that something of this nature would role of the so-called white liberal in the<br />\nnot happen again,; and henceforth, ser- civil rights movement.<br />\nStrangeland endeaver features Philip<br />\nvice would be provided to all on an<br />\nWerdell, noted proponent of student<br />\nequal basis.<br />\nThe University emphasized to the<br />\nOn Oct. 30, Rabbi Richard L. RuSalon's owner that should this policy be benstein, reknowned death of God<br />\ndisregarded in the future Hopkins theologian and author of a book enwould take immediate steps to termi- titled After Auschwitz - Radical Theonate the contract between the school logy and Contemporary Judaism, will<br />\nand the salon. This is in contradiction speak on \"After Auschwitz: The Death<br />\nto what was told Mrs. Pink.<br />\nof God.\"<br />\n<br />\nped for the assigned mission. You'll<br />\nbe trained to fly exciting aircraft.<br />\nJust examples. There are so<br />\nmany more.<br />\nWouldn't it be pretty nice to enjoy officers' pay and privileges?<br />\nAnd serve your country, as well?<br />\nAlso, you get retirement be lefits,<br />\n30 days' paid vacation, medical<br />\nand dental care.<br />\nB. Sc. Very impressive letters.<br />\nNow, do something with them.<br />\n<br />\nf<br />\nASs7<br />\n<br />\ntt1,443<br />\n,<br />\n;<:',\"160440.0<;<br />\n<br />\nk•A::<br />\n<br />\nDRUGS. Peter Laurie. A new and highly readable report covering all the major psychological, medical, and social facts about<br />\nLSD, heroin, marihuana and a variety of other drugs; the extent<br />\nto which these drugs are being used today; and the dangers<br />\ninvolved. S249.<br />\n95c<br />\nTHE PENGUIN BOOK OF MODERN VERSE TRANSLATION.<br />\nEdited by George Steiner. The first book of its kind, containing<br />\nsome 250 poems by major English and American poets from<br />\nSwinburne to Robert Lowell. Each poem is a translation or imitation of a work in a foreign tongue. D94.<br />\n$1.65<br />\nTHE STRUCTURE OF LIFE. Royston C/owes. An introduction to<br />\nthe exciting new science of molecular biology. A850.<br />\n$1.95<br />\n<br />\nTHE MERSEY SOUND. Adrian Henri, Roger McGough, Brian<br />\nPatten. Some of the liveliest ideas and attitudes of mod Britain<br />\nare expressed in this collection of works by three young poets<br />\nof the Beatle generation. D103.<br />\n95c<br />\nYou'll find these and other entertaining, informative Penguins<br />\non sale at your campus bookstore now.<br />\n<br />\nUNITED STATES AIR FORCE<br />\nBox A, Dept.SCP-710<br />\nRandolph Air Force Base, Texas 78148<br />\n<br />\navailable at<br />\n<br />\nTHE JOHNS HOPKINS BOOK CENTER<br />\n<br />\n\fHOMEWOOD,BALTIMORE,OCTOBER 20,1967<br />\n<br />\nFaces Court<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE THREE<br />\n<br />\nSA Pushes Sanitation, Education<br />\n<br />\n(Continued from Page 1)<br />\ntorney-General, Loring Hawes, stated<br />\nthat the certificate applies only to \"engagement in an attempt to overthrow<br />\nthe government by force. It constitutes<br />\nno more infringements on beliefs, expression and rights of association than<br />\nthe oath to support the Constitution.\"<br />\n(Continued from Page I)<br />\ndent lies in improper and uncovered<br />\n\"Broad and Vague\"<br />\nthe students by cleaning up the objec- garbage cans.<br />\nThe average rat only needs<br />\n(Continued from Page 1)<br />\nMr. Rosen argued in court that the tionable conditions. The rats will be<br />\nsolicitation program in transition neigha few ounces of food a day to live. The<br />\nOber Law is \"unconstitutionally broad killed, probably with poisons. Spot<br />\nPolitical education is a wide open borhoods, such as the area southeast of<br />\nSA views the sanitation problem as a<br />\nand vague.\" Hawes noted that Mary- surveillance of the block would be<br />\nfield for student activity. The need for campus, is urgently<br />\nkey one.<br />\nneeded.<br />\nland's law is less restrictive than others continued to prevent the rats return.<br />\nan effective political awareness in the<br />\nSeveral fraternities in the area have<br />\nsuch as the one which existed in WashThe SA has discussed and worked<br />\nghetto is acute. The Community AcPerson to Person<br />\nington. The Washington oath was held out the plan with the Division of Ro- been contacted and, according to Win- tion Agency and<br />\nother groups need<br />\nCommunity person-to-person relato be \"too vague\" in language and was dent Control of the City. The Division, ship, have agreed to cooperate on their<br />\npeople to help in voter registration and tionships, more<br />\ninformal than structurrejected by the Court.<br />\nthrough the office of Senior Sanitarian own properties.<br />\neducation.<br />\ned tutoring, can also be arranged. WeekThe certificate which Mr. Whitehill James R. Woodford, Jr., as agreed to<br />\n\"This is a long range program that<br />\nHousing, perhaps the most emotion- end camping or work<br />\nrefused to sign reads:<br />\naid the control program. They will should not be too time consumi<br />\ntrips have been<br />\nng for al civil rights issue, may also be<br />\nthe suggested as well as programs such as<br />\n\"I hereby certify that I am not a train volunteers in clean-up and killing the individual students<br />\n\" Winship stated. most<br />\ncritical. Code enforcement and the swim program run<br />\nsubversive person as defined by law, techniques, provide literature, posters, \"With a decent<br />\nby the SA last<br />\nshow of support, the<br />\ntenant education to improve existing year.<br />\nnamely that I am not a person who is and poisons, and, if necessary, serve program wouldn't<br />\nrequire more an hour<br />\nengaged in one way or another to over- summons to uncooperative persons.<br />\nper student each week. We hope that housing is an immediate necessity.<br />\nStudents with job skills can help in<br />\nthrow the Government of the United<br />\nMr. Woodford indicated that the de- students living in the<br />\narea will be inter- Training in these areas can be provided job training through existing organizaStates, or the State of Maryland, or any partment would welcome all the help ested in the idea and<br />\nagree to work on for interested people.The need to com- tions in the city. The possibili<br />\nty of<br />\npolitical subdivision of them, by force in controlling rats that it could receive.\" it. Once a body of students<br />\nin the same bat the \"scare solicitation tactics\" of creating a job clearing<br />\nhouse, such as<br />\nor violence.\"<br />\nRats are a great menace in the city,\" block, say the 2900<br />\nblock of Calvert unscrupulous real estate dealers is also<br />\nhas been done by private organizations<br />\nhe stated, \"spreading disease, destroy- Street, have come to<br />\n1111111•11.11•1111111111i<br />\nuse, we will get growing. The exodus of the white midin other -cities, exists provided there<br />\ning property, and ruining food.\"<br />\nthem together and initiate the program dle class only<br />\nrobs a city of its tax base. are people willing<br />\nThe main source of food for the ro- in the block.\"<br />\nto put the time in<br />\nAn effective education and counter- througho<br />\nut the year to run it.<br />\n<br />\nBlock-to-Block Sweep Hopes to Alert<br />\nDwellers, Force Owners into Action<br />\n<br />\nTIME<br />\n<br />\nIf Mexico and Bermuda send you,<br />\n<br />\nThe longest word<br />\nin the language?<br />\n<br />\nwe'll send you posters of Mexico and Bermuda.<br />\n3 for $1.50.<br />\n<br />\nBy letter count, the longest<br />\nword may be pneumonoultramicroscopicsilicovolcanoconiosis,<br />\na rare lung disease. You won't<br />\nfind it in Webster's New World<br />\nDictionary, College Edition. But<br />\nyou will find more useful information about words than in any<br />\nother desk dictionary.<br />\nTake the word time. In addition to its derivation and an<br />\nillustration showing. U.S. time<br />\nzones, you'll find 48 clear definitions of the different meanings of time and 27 idiomatic<br />\nuses, such as time of one's life.<br />\nIn sum, everything you want to<br />\nknow about time.<br />\nThis dictionary is approved<br />\nand used by more than 1000<br />\ncolleges and universities. Isn't<br />\nit time you owned one? Only<br />\n$5.95 for 1760 pages;<br />\n$695<br />\nthumb-indexed.<br />\nAt Your Bookstore<br />\nTHE WORLD PUBLISHING CO.<br />\nCleveland and New York<br />\n<br />\nThe diver of Acapulco. The torero of Mexico.<br />\nThe sleek racing craft of Bermuda.<br />\nAll three 30\" x 40\" posters are beautifully<br />\nreproduced in color. And they're all yours for<br />\nonly $1.50.<br />\nWe think you'll like them so much, you'll<br />\n<br />\nBOOK CENTER<br />\nGilman Hall<br />\n<br />\nCHUNG'S<br />\nCARRY-OUT<br />\nFine Chinese and<br />\nPolynesian Food<br />\nOpen Daily 11 A.M.• 10 P.M.<br />\nFriday & Sat. 11 AM..12 P.M.<br />\nSunday 1 P.M..11 P.M.<br />\n<br />\n508 W. Cold Spring Lane<br />\n<br />\n889-3428<br />\n<br />\nComplete Bachelor<br />\nService<br />\nFLUFF DRY & FOLD<br />\nSHIRTS—DRY CLEANING<br />\n<br />\nWaverly Laundromat<br />\n3330 GREENMOUNT AVE.<br />\n467-2123<br />\n<br />\nwant to go to Mexico and Bermuda some day.<br />\nAnd when you do, we hope you'll go on<br />\nEastern.<br />\nSo don't just sit there staring at four blank<br />\nwalls. Fill in the coupon below and send for<br />\nyour colorful posters now.<br />\n<br />\n,19<br />\nEASTERN<br />\nWe want everyone to fly.<br />\n<br />\nr-<br />\n<br />\nAVAILABLE AT:<br />\nTHE JOHNS HOPKINS<br />\n<br />\nStudent Volunteers to Combat Scare<br />\nTactics of City's Real Estate Dealers<br />\n<br />\nTo: Eastern Airlines, Inc., Poster Offer, Box 4211, Grand Central Station<br />\n, New<br />\n<br />\nYork, N.Y. 10017<br />\nPlease send me the Bermuda, Acapulco, and Mexico posters, for which I<br />\nenclose a $1.50 money<br />\norder or check (payable to Eastern Air Lines, Inc. Poster Offer).<br />\nName<br />\n<br />\nAddress<br />\n<br />\nCity<br />\n<br />\nState<br />\n<br />\nZip Code<br />\n<br />\nCI I would also be interested in receiving a Youth Fare Application.<br />\n<br />\n..<br />\n\"<br />\n<br />\n\fEAGE FOUR<br />\n<br />\nNEWS-LETTER<br />\n<br />\nalp iolins npktnn lienti-Ettirr<br />\nEDITORS-IN-CHIEF<br />\nPeter J. Koper<br />\n<br />\nHOMEWOOD,BALTIMORE,OCTOBER 20, 1967<br />\n<br />\nI Alas,Poor Yorick<br />\n<br />\nRoger C. Toll<br />\nBUSINESS MANAGERS<br />\n<br />\nBy MICHAEL G. MICHAELSON ever rcgiettable, the situation is at least vision sets in the Senate Chamber, one<br />\nbetween every pair of seats. (Or perThere is something (albeit an ever within the range of understanding, and<br />\nhaps the alternate scheme, giving each<br />\nWe<br />\nhave<br />\nexcusable.<br />\nenough<br />\non<br />\nour<br />\neven<br />\ndiminishing something) to be said for<br />\nTHE BOARD OF CONTROL<br />\nFirst Class (or \"Senior\") Senator a set<br />\nCouncil,<br />\nStudent<br />\nkeeping<br />\nthe<br />\nhands<br />\nEDITORIAL CHAIRMAN MANAGING EDITOR EXECUTIVE EDITOR the proposition that a man's undergrad- much less the world, on the up and up. of his own, while requiring every Touruate years should be selfish ones. What<br />\nDavid Schneiderman<br />\nJoseph Weinberg<br />\nHenry Hocherman<br />\nist Class (or \"Junior\") Senator to share<br />\nwill, for an unfortunately large portion But there are people who do have the his set with three others.) Besides its<br />\nASSOCIATE EDITORS<br />\nof students, amount to a lifetime of world in their hands. There are people obvicus recreational value and the posiElia Katz<br />\nJed Luchow<br />\nMike Phillips<br />\nlearning must somehow be compressed that society pays to be involved,just as bilities it opens for renewed displays of<br />\nNEWS EDITOR<br />\nNEWS COORDINATOR<br />\ninto four brief years. The job is, or it \"pays\" students not to be. There are parliamentary etiquette, the plan may<br />\nBruce Drake<br />\nDennis Estis<br />\nshould be, a full time one; and it makes people whose vacations from worldly provide the Senators with a unique eduSPORTS EDITOR<br />\nFEATURES EDITOR<br />\nCOPY EDITOR<br />\nparasites of us all. We suck knowledge obligation should have ended when cational opportunity. They may, for<br />\nJames Sloan<br />\nMurray Rudnick<br />\nPeter Harnik<br />\nfrom books and professors, money from their college days did. The indifference instance, be forced to watch an occaour parents, and, perhaps most impor- of these people, pedalled as involve- sional news bulletin between innings,<br />\nPHOTOGRAPHY EDITOR<br />\nGRAPHICS EDITOR<br />\nment, waxes pernicious; their failures<br />\ntantly, time from the draft board. All<br />\nNeil Graver<br />\nTom Hoffman<br />\nbody counts, perhaps. And with the<br />\nassume tragic proportions.<br />\nthis<br />\nwith<br />\nnot<br />\nmerely<br />\nthe<br />\nsanction,<br />\nbut<br />\nBALANCE EDITOR<br />\nSeries over, a few might catch a docusponcorre<br />\nLast<br />\nWashington<br />\nweek,<br />\na<br />\nthe hearty approval and nostalgic sigh,<br />\nStephen Shriver<br />\nmentary on life in the ghettos, on watch<br />\ndent for the New York Times wrote a<br />\nof society.<br />\nthe video tape replay of an infant's ear<br />\nIt's nice. Real nice. But not real real. tragedy in one paragraph.<br />\nbeing chewed by a pack of neighborThe campus here, for example, with it's<br />\n\"Reading from a prepared speech, hood rats. See what it's like. Living<br />\nperfectly green if not precisely rolling Senator Fulbright spoke to a virtually Colored. ,<br />\nlawns, its redundant red brick resplend- empty Senate Chamber.Only as he conance, its Euclidean symmetry, hardly cluded did the Senators drift on to the<br />\nUntil that day, however, when Conneeds an impressive marble wall on floor from the cloakrooms where they gress is flooded by Sony's and Walter<br />\nCharles Street to emphasize its distinc- had been watching the final innings of Cronkitc is in every legislators ear,<br />\ntion from metropolitan Baltimore. Even<br />\ngame in Boston.\"<br />\nsomeone else will have to tell the boy'<br />\nThe most unique aspect of the American protest of our involve- our rodents are different. A squirrel the World Series<br />\nthat what's happening in Fenway Park<br />\nment in Vietnam is the tie which has brought together so many di- control bill will probably never reach<br />\nThe protagonist here may not have isn't what's happening. As students, we<br />\nbeen addressing Yorick's skull, but his should not have to get<br />\nverse elements and people in this country into a common bond. To- the House.<br />\ninvolved in this<br />\nProponents of academic autism \"audience\" was no less inanimate. Un- stinking world. Not yet. We have a deal.<br />\nmorrow, blacks, whites, mothers, babies, students, drop outs, hipwould counter with the suggestion that, divided (or even fragmentary) attention<br />\npies, veterans, socialists, conservatives and many others, in all num- for purposes of study and learning, real- may be too much to expect of ordi- We have an Ivory Tower that is 99 and<br />\n100% pure. We like it, and we should.<br />\nbering an estimated 200,000 people, will walk together through ity is extraneous. What is important is nary mortals, but their presence would We<br />\nwant to stay there, and we should.<br />\nWashington,D.C., across the 14th Street bridge,and to the Pentagon. \"atmosphere,\" environment, sufficient have been, if nothing else, polite. Faced But there comes a time when everyone's<br />\nfreedom from responsibility, from in- with the choice between- listening to Stay-Press slacks<br />\nand striped shirt and<br />\nBut equally diverse as the group themselves are the objections and volvement with the world, to allow sin- the melancoly Senator's depressing so- herringbone jacket and Weejyn's and<br />\nminded intellectual pursuit. In short, liloquy or the joyful crack of Carl pastel socks<br />\nhave to get dirty. When<br />\ncriticism which these groups are leveling at President Johnson and gle<br />\nan Ivory Tower - - - - warm, comforta- Yastremski's bat, their decision was per- every hippy has to prove he's a<br />\nlover.<br />\nhis advisors. It is sad, though understandable, that an emotional fer- ble, safe, distant. Society gives us an haps understandable. But it would have<br />\nBecause we have been unlucky, our<br />\nvor has swept through many ranks of dissenters, notably among Elevator Pass, and expects us to make been understandable too, if Fulbright time is now. Like the University of<br />\nwives, mothers, hippies, many intellectuals and, in fact, the majority the most of it. A four year vacation pay. had turned to one of the Senate Pages Whittenbcrg's most celebrated dropat the conclusion of his remarks, and out,<br />\nof Americans who oppose the slaughter of what now amounts to Enjoy.<br />\nwe have every right to be pissed As the University's architecture so marvelled sadly at the base uses to off. \"The time is out of joint. Oh curmore than 200,000 lives. It is sad only in that it is the least expedient subtly suggests, we do And have for which we may return.<br />\nsed spite/That ever I was born to set it<br />\nmeans by which to change governmental policy, and that, after all, years. The lack of student \"involveright.\" Or try.<br />\nis the rationale behind every form of war protest. In other words, it ment\" here is, if not complete, tradiOne solution, of course, may be to<br />\nis the William Fulbrights, not the Tuli Kupferberg, who will bring tional and very nearly legendary. How- effect the installation of fifty small teleJames N. Franke<br />\n<br />\nDavid S. cooper<br />\n<br />\nOn The March<br />\n<br />\nabout an eventual American withdrawal from Vietnam.<br />\nAs far as Johnson and his associates are concerned, the whole<br />\nquestion centers on whether Vietnam is or is not in our \"vital national interest,\" as Dean Rusk so impassionately said last week. Indeed,<br />\none can make a strong point that as far as governments operate, such<br />\ncommonplace matters as deaths and costs cannot become a major<br />\nBy SETH FELDMAN<br />\nconsideration. We deplore this fact, but alas, we must contend with<br />\nToday is Friday but as far as Satur\"Sirs: My boy wrote me this from<br />\n\"In the war itself today marines<br />\nit.<br />\nday is concerned it might as well be where he is stationed in DaNang in Viet- continued their cleanup operations<br />\nMonday - - for the monster-country nam.I think some of these peace people south of the DMZ. These films taken<br />\nIn 1964, the large majority of the American people believed that yawns in preparation for another peace might be interested in hearing what a Monday show the marines overrunning<br />\nVietnam was in our national interest, and our Washington legislators march, is pallid. The scene is painted in real man has to say: John was killed on a Vienamese stronghold near Con Thien.<br />\na patrol today. That a living, breathing Ninety two Vietcong, like the one<br />\nsymbolically agreed by signing the Tonkin Gulf Resolution. Today, lousy bland.<br />\nA light bulb is the simplest of med- person is dead, that \"is\" is \"was\" and shown here, were found killed by the<br />\nas a recent poll of senators and representatives showed last week, the<br />\ndia. The weekly news magazine editor in totally so, that \"has\" is \"Lost\" is incre- extensive saturation bombing.\"<br />\nmood has changed and people are beginning to realize that our vital his office turns off the room lights and dible, unthinkable, unknowable-axioms<br />\n\"The bombing is causing them pain.\"<br />\ninterest in Vietnam,even if existing at all, is not worth the thousands puts next week's issue to bed. He types ioms of illogic, not true paradoxes but<br />\n\"and we've already been able to<br />\nof deaths, the billions of dollars and the political lieing and hypo- his last sentences by the illumination of paradoxes of truth. How to understand drop more tons of bombs on North<br />\nthis august blackness that shares reality Vietnam than the Nazis were able to<br />\ncrisy which is so much a reality now. Perhaps if there was hope of his desk light alone.<br />\nis the most valuable if with the plastic trivialities.'\"ect. cct. drop on all of Britian during their air<br />\npeaceful compromise two months away we could justify the cost to notInformation<br />\na Bhuddist nun died effort in World War IL\"<br />\nthe only commodity.The most sucourselves, but there is no such hope, not even within two years.<br />\ncessful man is the man who best adapts from burns after a dramatic cct.<br />\n\"and the Harris polls indicate that<br />\n<br />\nI The Word Is The Media I<br />\n<br />\n,<br />\n<br />\nWith such considerations being brought more and more before the<br />\nAmerican public, and with such respected and tried theoreticians as<br />\nTed Sorenson,William Fulbright and James Reston making clear and<br />\nundeniable refutations of,Rusk's repeated defenses of the war, it becomes clear that our \"vital interest\" is but a pawn, by moving which<br />\nJohnson believes he will find his way into the forefront of some future history book.<br />\nTomorrow's march will enable every Hopkins student and faculty'<br />\nmember to speak out in his own small way against the prolongation<br />\nof the war. It is all that most of us can do, but it is a lot.<br />\n<br />\nUncle Tom's Cabin<br />\nLast time it was Victor the Barber, this time it is Dottie the Hair<br />\nDresser. Dottie refused to dispense her services to the wife of a Hopkins graduate student, a Negro.<br />\nIt will be interesting to watch the behavior of Victor Dates, the<br />\nsole Negro in the administrastion,and Wesley Taylor, the plant Mana<br />\nger who holds the contract of Dottie's Bradford Beauty Salon.<br />\nTo avoid a protest, the administration plans to let things be until<br />\nDottie's contract runs out in December. This kind of arrangement<br />\nwould show everyone's true color - mostly white. We are for beauty<br />\nregardless of race, color, or creed, and right now.<br />\n\"There are two kinds of nigger: my kind of nigger, and a house<br />\nnigger,\" The Reverand James Bevel once said. Let us hope that Hopkins is not full of house niggers.<br />\n<br />\n\"'I didn't say that all of them are the country is disturbed.\"<br />\nhimself processor of information. This<br />\nadaption takes place through the media. subsersives. Just the people who organThen he turned off even his desk<br />\n\"All counted,\" the editor types, ized the thing. The rest are dupes.'\" light and put on his jacket in the dark\"'The press is free but it must live ness to leave.<br />\n\"reliable figures provided by the Washington police indicate approximately, up to its responsibilities. To be frank<br />\n\"One by one the lights go out all<br />\nxx,xxN participated in the march des- with you, I really don't sec the value in over the world.\"<br />\npite claims by the organizers that it this sort of derogatory reporting.'<br />\nThucydides realized 2300 years ago<br />\ndre,w no less than xxx,xxx.\" Return<br />\n\"'Senator, If I had an opinion that (though only monthes later when he<br />\ncarriage. 30-30-30. He shuffles through was detrimental to the well being of my read a scroll carried overland by horsethe copy on his desk.<br />\ncountry, I would surpress it.'\"<br />\nback) - - the fleet has left and it will<br />\nThe speed of electronic media has<br />\nThe Editor answers his phone. The never return.<br />\nshrunken civilization to the point where dark room: \"We've got the pictures<br />\nman lives in tribal society not seen in compiled for the march article. Bernie<br />\nthe West since the time of the ancient went to DC today and got some shots<br />\nGreek city states.<br />\nof Frank and Sandra (you know, our<br />\nHard of Darkness<br />\n\"President Johnson was not avail- staff degenerates) in front of the monuTo The Editors:<br />\nable for direct comment on the march. ment and near the Pentagon. We've dug<br />\nHowever a statement read by Press Se- up some pictures of the crowds that<br />\nAfter reading your hard-hitting edicretary Moyers quoted the President as came down for the civil rights march in torial in the last Newsletter, I thought<br />\nbeing 'proud that we live in a country '63 and when Kennedy was shot. If all my friends might like a few words<br />\nwhere every citizen can express his there's a riot we can always yank them from us heartless war-mongers to mull<br />\nviews about the issues of the times. We and use the pictures from Detroit, New- over on the way down to Washington<br />\nonly hope that through our commit- ark, Cleveland, Watts<br />\ntomorrow.<br />\nment in Southeast Asia we can assure<br />\nHe turns on his radio.<br />\n1) Do you seriously believe that LBJ<br />\nthe peoples of that unfortunate part of<br />\n\"We have to fight them there or is some sort of blood-drinking monster?<br />\nthe world that they too will be able to we'll have to fight them in the streets of If so, arc you so sure he is corrupting<br />\ncontinue to enjoy the liberties that we our cities. And we will fight them there innocent American youth? I might rehold so precious.\"<br />\nand we will win. Americans tend to for- mind you of some of the atrocities<br />\n\"xx students were reported injured, get that word \"win\". This country has fresh-faced American boys have comxx killed in riots apparently touched never lost a war and as long as I'm in mitted long before there was an LBJ or<br />\noff by radical Bhuddist elements and command<br />\nVietnam war-hazing of frat pledges is a<br />\nsupporters of jailed ex-candidate<br />\n\"Were a slight rise from last week. mild example. On the other end of the<br />\nTroung Dinh Dzu.\"<br />\nTotal losses in Vietnam now stand at spectrum lie such folk arts as mugging<br />\n\"I only wish some of them demon- xxx,xxx killed, xxx,xxx wounded and old ladies and mass muffler. Perhpas it<br />\nis some of these customs, picked up in<br />\nstrators could come on over here and xxxx missing in action.\"<br />\ncivilian life, that are producing the atrosee what its like.' Sgt<br />\nand the television<br />\nis the holder of the Distinguished<br />\n\"what more is there to lose before city stories from Vietnam.<br />\nand x Purple Hearts. we win?'<br />\n(Continued to Page 5)<br />\n<br />\nI Correspondence<br />\n<br />\n1<br />\n<br />\n\fHOMEWOOD,BALTIMORE,OCTOBER 20, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE FIVE<br />\n<br />\nRealist Krassner Comes to Town<br />\nEditors' note: the following wisdom<br />\nNewsletter: Do you think that there a festering sore, but the rest of the rash<br />\nwas dispensed by Paul Krassner, editor is going to be an administration crackNewsletter: What's wrong with LBJ? man history when you have to find<br />\nis still there.<br />\nof the Realist underground magazine down as there has been sometimes in<br />\nKrassner: What's wrong with LBJ is other ways to deal with your aggressNewsletter: What about the \"hippy\"<br />\nand frequent contributor to Ramparts, the past?<br />\npeople in the peace movement? Do you just an intensifications of what's wrong ion. sure you have to make decisions<br />\nin a recent conversation.<br />\nKrassner: I don't think there has see some kind of overturning of the es- with anybordy whose actions I consider but I do believe he is using the Vietnam<br />\nbeen a crackdown. There's been criti- tablishment? Will these groups get any- inhumane and that's the capacity to War as a political lever. When you do<br />\nNewsletter: There has been a lot of<br />\ncism of it, but not a crackdown.<br />\nmake abstractions of human beings so that you make non-entities of human<br />\nwhere?<br />\ntalk about violence and a lot of people<br />\nNewsletter: Rusk's recent statements<br />\nKrassner: The most important thing that the body count in Vietnam is just beings, both Americans and Vietnahave been worried about the march this<br />\nabout the hippy subculture is that in a an extension of say, an automobile mese, who are dying in order that he<br />\nSaturday. Do you think that this is in on dessent and its stupidity?<br />\nKrassner: The only way that there democracy, they have the right to do manufacturer who would rather make can use them as a strategic thing to get<br />\naccord with a peace movement, and is<br />\nsales than consider safety. What is speci- elected again.<br />\ncan be a crackdown is if war is legally what they're doing. Nobody will force<br />\nthis necessary for the movement?<br />\nfically wrong with Lyndon Johnson is,<br />\nNewsletter: Is this what you are tryKrassner: I'm very worried about declared, in which case they can trans- them to work if they're not working,<br />\nnobody will force them to get haircuts. to my way of thinking, the exercise of ng to say in the Realist?<br />\nviolence too, and I hope that the Police late dissent as treason.<br />\npower without compassion.<br />\nKrassner: Yes it's one of the things<br />\nand the National Guard will keep themNewsletter: What about the whole They've become so frustrated with the<br />\nNewsletter: Aren't your views miti- hat is talked about.<br />\nselves in check.<br />\nVietnam situation. Do you think that standard forms of protest rebellion that<br />\ngated sometimes when you look at his<br />\nNewsletter: Do you still envision ci- this is just a new quirk in American for- they're trying to live alternative instead<br />\nposition and when ybu look at past<br />\nof<br />\nchanging<br />\nthe<br />\nold<br />\nthing.<br />\nNow<br />\nby<br />\nlivvil disobedience as a non-violent move- eign policy or have we been imperialising an alternative, they are, in effect, presidents? It is a position of power to<br />\ntic?<br />\nment?<br />\nchanging it to that extent that they are run a country without compassion.<br />\nKrassner: Oh sure. I was in Los AnKrassner: I think it's part of the no<br />\nlonger part of it.<br />\nKrassner: There comes a time in hugeles where the fifteen hundred police whole logical evolution or illogical evolrioted, and every demonstration that ution. I was in Cuba in 1959-60 and<br />\nI've been in where there has been vio- there were American anti-aircraft guns<br />\nlence has been instigated by the police. on the roof of the hotel where I was<br />\nI think it has been a tactical measure to and I heard the phrase, \"America is a<br />\nscare people away. Although it seems comic opera\" and I kept saying,\"We're<br />\nlike random violence. I think it is a de- not going to attack you\" and they had<br />\nliberate tactic. Now people are getting to remind me of Gautamala. And then (Continued from Page 4)<br />\nwith your anti-war efforts, Nice Man<br />\nso frustrated that nobody, even the of course there's the Dominican RepubHo may just be glad to hear from you.<br />\nopposition?<br />\nWhat<br />\nabout<br />\n2)<br />\nTwo<br />\nthe<br />\nnon-violent people on the Mobilization lic. I can't even begin to list the num3) If you have any more time, open<br />\nCommittee, can say that we can't pre- ber of countries that we are involved in. wrongs may not make a right, but two your Red<br />\nBook to the part where Chairdict, with all the anger and frustration Vietnam is getting the most publicity rights are surely better than one,so why man<br />\nMao says, \"Political power grows<br />\nabout the war, what people are going to but we are involved in one act after not write a nice litter to Ho,asking him out of the<br />\nbarrel of a gun.\" Perhaps<br />\ndo. But the official policy is absolutely another. It's like a rash and all of a sud- to please stop drafting 14-year-olds,and here<br />\nwe have found a point on which<br />\nhaving his agents throw grenades into<br />\nnon-violent.<br />\nden one bit of the rash breaks out into<br />\ncrowds of those same innocent people both sides can agree, and around which<br />\nwho hate the Americans so much. If negotiations can begin. After all, even<br />\nthat does not work, perhaps you can such neutral observers as Stokeley Carsend a committee of protest to Hanoi, michael would endorse this statement.<br />\nSo have a nice trip tomorrow. But<br />\nGRADUATE SCHOOL INTERVIEWS - SENIORS<br />\nor start corresponding with anti-War<br />\ngroups in North Vietnam. After all, if don't be too upset if LBJ doesn't come<br />\nThursday, October 26 — COLUMBIA LAW SCHOOL<br />\nThursday, October 26 — VANDERBILT LAW SCHOOL<br />\nsuch a monster as LBJ doesn't interfere around.<br />\nWednesday, November 1 — GEORGE WASHINGTON UNIV<br />\nJoseph Brophy<br />\nLAW SCHOOL<br />\nFriday, November 17 — SYRACUSE UNIV LAW SCHOOL<br />\nitic's rugged pair of<br />\nWednesday, November 29 — NORTHWESTERN UNIV S<br />\nstick pens wins again im<br />\nSCHOOL OF LAW<br />\nunending war against<br />\nMonday, December 4 — UNIV OF CHICAGO<br />\nball-point skip, clog and<br />\nBUSINESS SCHOOL<br />\nsmear. Dfspite horrible<br />\nCONTACT PLACEMENT BUREAU, 100 WHITEHEAD HALL TO<br />\nARRANGE FOR INTERVIEWS<br />\npunishment by mad<br />\nscientists, BIC still writes<br />\nfirst time, every time.<br />\nCONTACT PLACEMENT BUREAU, 100 WHITEHEAD HALL TO ARAnd no wonder. BIC<br />\nRANGE FOR INTERVIEWS<br />\n'<br />\nS<br />\n\"Dyamite\" Ball is the<br />\nEXAMINATION DATES (Federal Government, Dept. of State, etc.)<br />\nhardest metal made,<br />\nFor foreign service careers with Dept. of State and USIA file<br />\nencased in a solid brass<br />\napplication by October 21 to take test on December 2, 1967.<br />\nnose cone. Will not skip,<br />\nGraduate students and seniors in non-science fields who are<br />\nclog or smear no matter<br />\ninterested in government careers should take Federal Service<br />\nwhat devilish abuse is<br />\nEntrance Exams early in academic year. Exams are given<br />\nGOOF'<br />\ndevised for them by<br />\nmonthly through May.<br />\nsadistic students. Get<br />\nAPPLICATIONS FOR ABOVE EXAMS ARE AVAILABLE IN PLACEMENT<br />\nWith Eaton's Corrasable Bond Typewriter Paper, you<br />\nthe dynamic inc Duo at<br />\nBUREAU, 100 WHITEHEAD HALL<br />\nyour campus store now.<br />\ncan erase that goof without a trace.<br />\nGraduate students and seniors ( planning to go to grad school) in<br />\nengineering, math, physics and chemistry who are interested in<br />\n•.<br />\nNot a telltale smudge remains. A special surface persummer employment should register at Placement Bureau.<br />\n<br />\nI Correspondence<br />\n<br />\nI<br />\n<br />\nDespite<br />\nfiendish torture<br />\ndynamic BiC Duo<br />\nwrites first time,<br />\nevery time!<br />\n<br />\nPLACEMENT BUREAU ANNOUNCES<br />\n<br />\nAnyone can<br />\n<br />\nSeniors who have not received August letter from Placement Bureau<br />\nand those who have received letter, but have not responded, should<br />\ncontact Placement Bureau as soon as possible.<br />\n<br />\n17e<br />\nhicA/ to catch<br />\n?he RoadRuanetisatyoutP4//notithZa/etc.<br />\n<br />\nmits quick and easy erasing with an ordinary pencil<br />\neraser. For perfect papers every time, get Corrasable.<br />\nIn light, medium, heavy weights and Onion Skin. In<br />\nhandy 100-sheet packets and 500-sheet ream boxes.<br />\nAt Stationer:, Departments.<br />\n<br />\n!EATON'S CORRASABLE<br />\n/TYPEWRITER<br />\nPAPER<br />\n<br />\nOnly Eaton makes Corr5sable:°<br />\nEATON PAPER CORPORATION, PITTSFIELD, MASSACHUSE FTS<br />\n<br />\navailable at<br />\n<br />\nTHE JOHNS HOPKINS BOOK CENTER<br />\n<br />\nAll Types of Subs<br />\nSnacks — Beer<br />\nOPEN TILL '1:00<br />\n7 DAYS A WEEK<br />\n<br />\noew Ryffloath RoadRunner<br />\nnow at you.'Plymouth Pe.Ver:s<br />\nwhere the 4)&7t.96es- 0/7<br />\n<br />\nB & M SUB SHOP<br />\n31st & GUILFORD<br />\n<br />\nWATERMAN-BIC PEN CORP.<br />\nMILFORD, CONN.<br />\n<br />\nBiC Medium Point 19C<br />\n<br />\nV BiC Fine Point 29C<br />\n<br />\nBic Pens On Sale At:<br />\n<br />\nJOHNS HOPKINS<br />\nBOOK CENTER<br />\n\"No Free Marijuana. no: Fa'<br />\ner Groppi, no clashes with police, and of course no national<br />\nheadlines. the occasion, an orderly parade in honor and support of our troops in Vietanm:<br />\nthe place, Cincinnati; the inspirers, an ad hoc Committee<br />\nfor Action by Teens. The<br />\nMayor was on the reviewing<br />\nstand, the Cincinnati Enquirer<br />\nendorsed the event, and a nice<br />\ncrowd of unsponsored teenagers turned<br />\nFor • hoe (fly<br />\nout. The rent-aof the unroof is.1 NATIONAL<br />\ncrowds stayed<br />\nREVIEW, writs to<br />\naway.\"<br />\n<br />\nDept. (P-1, 150 I.<br />\n35 S.... N.Y 11, N Y.<br />\n<br />\n\fI<br />\n<br />\nHOMEWOOD, BALTIMORE,OCTOBER 20, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE SIX<br />\n<br />\nClassified<br />\n<br />\nH<br />\n<br />\nRENT FREE - - Private tenant house<br />\nLUNCH - I hate cooking and dishwash- in Green Spring Valley, 20 minutes<br />\nI<br />\n—<br />\nmeals<br />\nd<br />\ning but, I love home-cooke<br />\nfrom J.H.U. Suitable for two or three<br />\nwill pay reasonably for Dinners and/or graduate students. Five rooms, screened<br />\nLunches. Call 235-9602 or Box 664.<br />\nporch, outstandingly beautiful view. No<br />\nrent to pay - instead work a few hours<br />\nFOR SALE - - Rambler '59, mileage per week on grounds, etc. (For past 6<br />\n25,800, good condition, $125. Con- years, various J.H.U. grad students<br />\ntact Mrs. S. Feinblatt, FL 8-6199, on have lived here on this basis) Call Hu<br />\n6-1430.<br />\nMonday.<br />\n<br />\nCAMPUS NOTES 1<br />\n<br />\nTOBOR RULES THE WORLD<br />\nThe next program in the Seminar in<br />\nComputer Science is scheduled on October 23, at 4:00 p.m. in Room 3 of<br />\nShaffer Hall. Dr. Lawrence Roberts of<br />\nthe Advanced Research Projects Agency<br />\nin Washington will speak on \"Multiple<br />\nAccess Computer Network.\"<br />\nThe speaker for the following lecture was fired and a computer will take<br />\n<br />\ntin G. Larrabec, Chairman of the PreMedical recommendations committee<br />\nRED AND BLUE ARMIES MEET will participate in a program about PreThe Johns Hopkins Vietnam Com- Medical Education at Johns Hopkins.<br />\nThe program is sponsored by Alpha<br />\nmittee will hold a general meeting on<br />\nOctober 25, at 7:30 p.m. in Levering Epsilon Delta, the International PreHall. The purpose will be to acquaint Medical Honorary Society and will constudents with the variety of anti-war sist of short talks by Dean Swanson and<br />\nactivities in Baltimore and to discuss Dr. Larrabee to be followed by a quespossible future programs on campus. tion and answer period.<br />\nMedical students from the Johns<br />\nStudents and faculty are invited.<br />\nHopkins School of Medicine will be<br />\npresent to answer questions. The proINTEGRATED TGIF<br />\ngram will take place Monday, Oct. 23,<br />\nA panel will discuss\"Open Housing\" at 8:30 p.m. in Remsen 101. •<br />\nin a seminar sponsored by the Committee. A film, \"No Hiding Place,\" will<br />\nQUARTETTO AND SRO<br />\nbe shown and discussed. The program<br />\nwill be held on Sunday, October 22, at<br />\nThe Quartetto di Roma will open<br />\n2 p.m., at St. Peter's Lutheran Church, the Shriver Hall Concert Series on SunBlvd.<br />\n4215 Loch Raven<br />\n.day at 8:30 p.m. Due to heavy advance<br />\nsales, the entire concert series has been<br />\nsold out for some time. Scats or standLOST IN SPACE<br />\nDr. Carl P. Swanson, Associate Dean ing room may be availabe at the door<br />\nof Undergraduate Studies and Dr. Mar- by checking with the head usher.<br />\nhis place in the interest of efficiency.<br />\n<br />\nCan you<br />\nmeetthetest?<br />\nHere's everything you need to<br />\nhelp you get a top score in the<br />\ntests you have to pass.<br />\n• Up-to-date test material<br />\n• Best organized study guides<br />\n• Do's and don'ts of test-taking<br />\n• Step-by-step programming<br />\n• Accurate practice tests<br />\n• Correct answers and solutions<br />\n• Self-evaluation profiles<br />\n<br />\nCOWLES SCORE-HIGH EXAM BOOKS<br />\nHow to Pass<br />\nGRADUATE RECORD EXAMINATION APTITUDE TEST<br />\nwith special Test-Yourself Examination bonus. 444 pages<br />\nHow to Pass<br />\nLAW SCHOOL ADMISSION TEST<br />\nMEDICAL COLLEGE ADMISSION TEST<br />\nDENTAL APTITUDE TEST<br />\nMILLER ANALOGIES TEST<br />\nFEDERAL SERVICE ENTRANCE EXAMINATIONS<br />\nGRADUATE BUSINESS SCHOOL ADMISSION TEST<br />\nNATIONAL TEACHER EXAMINATIONS<br />\nEach $3.95 Paper • Over 300 pages<br />\n<br />\nRE Advanced Tests also available<br />\nplus<br />\nCOMPUTER PROGRAMMER APTITUDE TESTS $4.95 Paper<br />\nSHORT-CUT SHORTHAND<br />\nLearn Shorthand in 40 Easy Lessons by S. M. Wesley, Ph.D.<br />\n24<br />\n<br />\nNew<br />\n<br />\n$3.95 Paper<br />\n<br />\nAvailable at your campus bookstore<br />\n<br />\nRapid•Shavelime...<br />\nItsa whole new kid<<br />\nin shavirtg!<br />\n<br />\nrplip4 COWLES EDUCATION CORPORATION<br />\nLOOK Building / 488 Madison Avenue, New York, New York 10022<br />\n<br />\navailable at<br />\n<br />\nTHE JOHNS HOPKINS BOOK CENTER<br />\n<br />\nRAPIDSHAVE<br />\n<br />\nRAPI<br />\nSHA RAPIDSHAVE<br />\n<br />\n\"'S<br />\n<br />\nHopkins students, new and old, try:<br />\n<br />\nIpok for the lime-green can<br />\n8.8 30 NYT. ABC-TV<br />\nC01967, Colgote•Palmolive Company See - The Flying Nun,- Thursday evenings.<br />\n<br />\nLC.LA.<br />\n<br />\n•<br />\nLIME, REGULAR<br />\nAND MENTHOL<br />\n<br />\nAVAILABLE AT THE GREEN WAY PHARMACY<br />\n34th St. and Charles<br />\nAmor<br />\n<br />\nPecora's Restaurant<br />\nfor the finest Italian food in town<br />\n<br />\n3320 Greenmount Ave.<br />\nSPAGHETTI MEALS<br />\nPIZZA PIE A SPECIALTY<br />\n<br />\nCARRY OUT SERVICE<br />\nCALL 889-3831<br />\n<br />\n\fHOMEWOOD,BALTIMORE,OCTOBER 20, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\nGridders Try For Fourth Win<br />\n(Continued from Page 8)<br />\nfor outstanding Hopkins back and line- compliments to the performance of his<br />\nman defensive halfback Charley Coker offensive line-especially end Walt Sien(two interceptions) and linebacker Den- kiewicz, who he noted, was improving<br />\nny Ferrazzano, bear out the extent of rapidly and had contributed several key<br />\nstaff pleasure with this inexperienced blocks on Saturday.<br />\nbut clearly fast-jelling unit.<br />\nCowan, who now has nine touchLIVE A LITTLE<br />\ndowns in three games, ran his scoring<br />\nHey, people! Stop sitting in your<br />\ntotal to 50 points by making five of sweaty little rooms checking<br />\nover your<br />\neight conversion tries (he also averaged roomie's chem homework<br />\nand worrying<br />\n42.1 yards per punt). A Saturday soc- about tomorrow! Come on down<br />\nto the<br />\ncer match kept regular kicker Wes Ba- spacious News-Letter office and join up<br />\nchur away from grid action, and, since with our meagre but stimulating copy<br />\nthe soccer and football schedules con- staff. And help us all worry about<br />\ntoflict in every instance from now on, the morrow. Pay's not too good,<br />\nbut fringe<br />\n5-9, 160 pound senior's future availia- benefits<br />\nare substantial(you get to hear<br />\nbility is in some doubt.<br />\nKoper crack up at midnight) and the<br />\nHead Coach Alex Sotir also paid atmosphere's unbeatable. Hurry, and be<br />\nnext in line for Copy Editor!<br />\n<br />\nADVERTISED ON<br />\nRADIO STATION<br />\n<br />\nRx Rx Rx Rx Rx Rx Rx Rx<br />\n<br />\nWJHU<br />\n<br />\nM<br />\n<br />\nMedico<br />\nALMA MATER<br />\n<br />\nPIPES<br />\n<br />\nLOW RATES FOR<br />\nHOPKINS STUDENTS<br />\n<br />\nWITH JHU LETTERS<br />\n<br />\nFOR FURTHER INFORMATION<br />\n<br />\nCONTACT JOHN ULLMAN<br />\nBUSINESS MGR. WJHU<br />\n235-8619 OR BOX 467<br />\n<br />\n•<br />\n<br />\n14<br />\n<br />\n$<br />\n4<br />\n\"<br />\n<br />\n$5<br />\n\"<br />\n<br />\nGreenway Pharmacy<br />\nCharles and 34th Sts.<br />\n<br />\nRx Rx Rx Rx Rx Rx Rx Rx<br />\n<br />\nPAGE SEVEN<br />\n<br />\nThinclads Face Dips Tomorrow<br />\n<br />\nANCHORS AWEIGH<br />\n<br />\n(Continued'from Page 8)<br />\nThe Johns Hopkins Sailing Club will<br />\nThe frosh cross country team is anbe meeting October 24 at 7 p.m. in the<br />\nAthletic Center. Racing schedules and xiously awaiting the starting gun of<br />\nassignments to boats will be discussed. their 1967 season Wednesday, October<br />\nAll interested persons should attend. 25 at Bainbridge Prep. They will run a<br />\nthree mile course at home and two miles against their high school opponents.<br />\n<br />\nThe top position is a three-way battle between Al Wallace, Jim Archibald<br />\nand Matt Polk. Steve Haines, Norm<br />\nPoulson, John Shavel and Steve Myers<br />\nround out the team.<br />\n<br />\nPREDICTIONS<br />\n<br />\nHopkins 27<br />\nHopkins 3<br />\nColts 7<br />\nBullets 86<br />\nTexas 32<br />\n<br />\nRandolph Macon 14<br />\nF&M 2<br />\nVikings 14<br />\nBoston 104<br />\nArkansls 28<br />\n<br />\nNEW—<br />\n<br />\nFIND<br />\nSCHOLARSHIPS<br />\nBY COMPUTER<br />\n<br />\nLast year $30 million in college scholarships went unclaimed — because no<br />\nqualified persons applied . . . because<br />\nno qualified persons knew of them.<br />\n• Now ECS engineers and educators<br />\nhave programmed a high-speed computer with 700,000 items of scholastic<br />\naid, worth over $500 million, to permit<br />\nstudents to easily and quickly locate<br />\nscholarships for which they qualify.<br />\n• The student fills out a detailed, confidential questionnaire and returns it to<br />\nECS, with a one-time computer-processing fee of $15. In seconds the computer compares his qualifications against<br />\nrequirements of grants set up by foundations, business,- civic, fraternal, religious, and government organizations.<br />\nand prints a personalized report to<br />\nthe student telling him where and when<br />\nto apply for grants for which he qualifies. Thousands of these do not depend<br />\non scholastic standing or financial need.<br />\n<br />\nFREE - - - - - - - - -<br />\n<br />\nINFORMATION AND SAMPLE QUESTIONNAIRE<br />\n<br />\nra<br />\nECS<br />\n<br />\nNORTH AMERICAN EDUCATIONAL ,<br />\nCOMPUTER SERVICES,INC<br />\nP9<br />\n'<br />\nR5<br />\n1:ZE<br />\nS<br />\nT<br />\n'<br />\n,DA<br />\nN,<br />\nME<br />\nER S E Y<br />\n1<br />\n<br />\nSend<br />\n<br />\nQuestionnaires<br />\nqty<br />\n<br />\nname<br />\n(print)<br />\naddress<br />\n<br />\nzip<br />\n<br />\nOn Campus paw.<br />\n(By the author of \"Rally Round the Flag,Boys!\",<br />\n\"Dobie Gillis,\" etc.)<br />\n<br />\nTHERE ARE NO BAD TEACHERS;<br />\nTHERE ARE ONLY BAD STUDENTS<br />\nThe academic year has only just begun and already<br />\none thing is clear: you're not ready for college.<br />\nWhat, then, should you do? Should you throw -up your<br />\nhands and quit? I say no! I say you must attack, grapple,<br />\ncope! I say America did not become the world's leader in<br />\nmotel construction and kidney transplants by running<br />\naway from a fight!<br />\nTo the question then: You say you're not ready for college. You're too green, too naive. You lack maturity.<br />\nOkay, the answer is simple: get mature. How? Well<br />\nsir, to achieve maturity you need two things:<br />\na) a probing mind;<br />\nb) a vest.<br />\nA probing mind will be quickly yours if you'll remember that education consists not of answers but of questions. Blindly accepting information and dumbly<br />\nmemorizing data is high school stuff. In college you don't<br />\njust accept. You dispute, you push, you pry, you challenge. If, for instance, your physics prof says,\"E equals<br />\nmc squared,\" don't just write it down. Say to the prof,<br />\n\"Why?\"<br />\nThis will show him two things:<br />\na) Your mind is a keen, thrusting instrument.<br />\nb) You are in the wrong major.<br />\nAsk questions, questions, and more questions. That is<br />\nthe essence of maturity, the heart and liver of education.<br />\nNothing will more quickly convince the teachers that you<br />\nare of college calibre. And the tougher your questions,<br />\nthe better. Come to class with queries that dart and flash,<br />\nthat make unexpected sallies into uncharted territory.<br />\nAsk things which have never been asked before, like<br />\n\"How tall was Nietzsche?\" and \"Did the Minotaur have<br />\nticks? If so, were they immortal?\" and \"How often did<br />\nPitt the Elder shave?\"<br />\n<br />\nSTAMP IT!<br />\nIT'S THE RAGE<br />\n<br />\nStand up and be counted<br />\nin Bass Weejuns!<br />\n<br />\nREGULAR<br />\nMODEL<br />\nANY $<br />\n<br />\n3 LINE TEXT<br />\nBe a big number on campus ... ask for Bass<br />\nWeejuns® moccasins at your nearby college store<br />\nor shoe shop. Only Bass makes Weejuns.<br />\nG. Fl. Bass & Co.,<br />\nMain St.,<br />\nWilton, Maine 04294.<br />\n<br />\nS4447<br />\n<br />\nThe finest INDESTRUCTIBLE METAL<br />\nPOCKET RUBBER STAMP. /<br />\n1<br />\n2\" x 2\".<br />\nSend check or money order. Be<br />\nsure to include your Zip Code. No<br />\npostage or handling charges. Add<br />\nsales tax.<br />\nPrompt shipment. Satisfaction Guaranteed<br />\nTHN MOPP CO.<br />\nP. 0. Box 16623 Lenox Square Stetter'<br />\nATLANTA, GA., 30326<br />\n<br />\nSAV-IT<br />\nLIQUORS<br />\n<br />\nThe Catholic Community<br />\nOn Campus<br />\n<br />\n329 W.29th St.<br />\nTHE HOUSE OF<br />\nGOOD CHEER<br />\n<br />\n243-3313<br />\n<br />\nMASS SCHEDULE:<br />\nSUNDAYS: 10:30 A.M. in Levering<br />\nGreat Hall<br />\nFRIDAYS:<br />\n12:00 Noon in Levering Hall<br />\nChapel (2nd floor)<br />\nConfessions heard before Mass.<br />\n(Mass is said, Monday thru Thursday, at 4:30 P.M. in<br />\nNewman House, 2941 N. Charles)<br />\n<br />\n* * * * * * * * * * ** * *<br />\nWHERE EVER YOU ARE . . .<br />\nWHERE EVER YOUR GOING<br />\nYOU'VE GOT TO BE GOING<br />\nOUR WAY. WE'RE ALL OVER<br />\nTOWN!<br />\nSubmarines • Pizza<br />\nSpaghetti • Sour Beef<br />\n<br />\nHARRY LITTLE<br />\nCARRY OUT SHOPS<br />\n<br />\nYork Road &<br />\nRegester Avenue<br />\n<br />\nJOHN P. NUGENT, JR. I<br />\nLife & Health<br />\nInsurance<br />\nCompare<br />\n<br />\n243-7961<br />\n<br />\nWe need your head in our<br />\nbusiness<br />\n<br />\nSt Paul Barber Shop<br />\n3120 St. Paul St.<br />\nI<br />\n<br />\nAcross from Eddies<br />\n<br />\n25th Near<br />\nGreenmount<br />\n32nd Near<br />\nGreenmount<br />\n** * * * * * * * * * * * *<br />\n<br />\n(Incidentally, you may never know the complete answer to Pitt the Elder's shaving habits, but of one thing<br />\nyou can be positive: no matter how often he shaved and<br />\nno matter what blades he used, he never enjoyed the<br />\nshaving comfort that you do. I am assuming, of course,<br />\nthat you use Personna Super Stainless Steel Blades, a<br />\nlogical assumption to make when one is addressing college men—which is to say men of perspicacity, discrimination, wit, taste, cognizance, and shrewdness—for<br />\nPersonna is a blade to please the perspicacious, delight<br />\nthe discriminating, win the witty, tickle the tasteful,<br />\ncoddle the cognizer, and shave the shrewd.<br />\n(I bring up Personna Super Stainless Steel Blades because the makers of Personna Super Stainless<br />\nSteel<br />\nBlades pay me to write this column, and they are<br />\ninclined to sulk if I omit to mention their product. I<br />\nwould<br />\nnot like to see them unhappy, the makers of Personn<br />\na,<br />\nfor they are fine ruddy men,fond of morris dancing<br />\nhome brewed root beer, and they make a blade and<br />\nshaves closely and cleanly, nicklessly and hackless that<br />\nis sharp and gleaming and durable and availabl ly, and<br />\ne both in<br />\ndouble-edge style and Injector style.<br />\n(And from these same bounteous blademakers<br />\ncomes<br />\nBurma-Shave, regular or menthol, a lather<br />\nthat<br />\nlathers other lathers, brother. So if you'd rather outbetter, and soak your whiskers wetter, Burma lather<br />\n-Shave's<br />\nyour answer.)<br />\nBut I digress. We have now solved the problem<br />\nof<br />\nmaturity. In subsequent columns we'll take up<br />\nother issues, equally burning. Since 1953 when this column<br />\nfirst<br />\nstarted running in your campus paper,<br />\ntackled<br />\nsuch thorny questions as ,\"Can a student ofwe've<br />\n19 find happiness with an economics professor of 90?\" and<br />\n\"Should<br />\ncapital punishment for pledges be abolished?\" and<br />\n\"Are<br />\nroom-mates sanitary?\" Be assured that in this,<br />\nour 14th<br />\nyear, we will not be less bold.<br />\n* * *<br />\n© 1967, Max Shulman<br />\nThe makers of Personna Super Stainless Steel Blades<br />\n(double-edge or Injector) and Burma-Shave (regula<br />\nr<br />\nor menthol)are pleased(or apprehensive) to bring you<br />\nanother year of Max Shulman's uninhibited, uncensored column.<br />\n<br />\n\fNEWS-LETTER<br />\n<br />\nPAGE EIGHT<br />\n<br />\nNEWS<br />\n<br />\nS<br />\n<br />\nHOMEWOOD,BALTIMORE,OCTOBER 20, 1967<br />\n<br />\nLETTER<br />\n<br />\nHeavy Rains Cramp Jays to Risk Unbeaten Streak<br />\nRooters in 1st Loss At Randolph-Macon Saturday<br />\nBy MIKE PHILLIPS<br />\nNow tied for the Southern Division<br />\nFullback Mark Croft (41 yards on<br />\nConverence lead, the<br />\nAfter an opening game victory, the Diplomats sport an 0-3 record this year, Middle Atlantic<br />\nnine<br />\ncarries), making his first start of<br />\nteam<br />\nfootball<br />\nvarsity<br />\nthe<br />\nunbeaten<br />\nJay soccer contingent dropped a close and the Jays lost to them 1-0 last year.<br />\ngot the fourth Hopkins tally<br />\nthe<br />\nseason,<br />\nfor<br />\nopposition<br />\ncontest to Swarthmore last Saturday by F&M's full offensive back field returnee should get some capable<br />\non a one yard plunge, and FEely again<br />\nin two games tomorrow<br />\ntime<br />\nfirst<br />\nthe<br />\ndetheir<br />\nof<br />\nmost<br />\nlost<br />\nthey<br />\nbut<br />\nyear<br />\nthis<br />\na4-3 tally.<br />\nhit Cowan - this time on a swing pass<br />\ntough Randolph-Macon<br />\nThe rain-soaked Swarthmore field fense. The Jay kickers will perform at when it faces a<br />\nstretched into a 52 yard - to round out<br />\nAshville,<br />\nat<br />\nclash<br />\nnon-league<br />\na<br />\nin<br />\nclub<br />\ncontests<br />\nwas the scene of an exciting, ping-pong home for three consecutive<br />\nthe second period scoring.<br />\ntype game in which the lead changed next week. Gettysburg and Loyola are Virginia.<br />\nAfter Feely made the count 40-0 on<br />\nyear,<br />\nthe<br />\non<br />\n3-1<br />\nJackets,<br />\nYellow<br />\nThe<br />\nThursday<br />\nand<br />\nTuesday<br />\nfor<br />\nscheduled<br />\nfirst<br />\nthe<br />\nin<br />\nEarly<br />\ntimes.<br />\nseveral<br />\nhands<br />\na one yard sneak, Cowan went on the<br />\n20<br />\nyielded<br />\nand<br />\npoints<br />\n101<br />\nscored<br />\nhave<br />\nfor<br />\nslated<br />\nis<br />\nLynchburg<br />\nrespectively.<br />\nbeautiful<br />\nquarter, Art Guerin netted a<br />\nloose twice more, running 43 yards<br />\nin wins over Millersville (Pa.), Millsaps,<br />\nscore in the lower left hand corner of Saturday at 2:00 p.m.<br />\nfrom scrimmage for a third quarter<br />\nWashto<br />\nfalling<br />\nwhile<br />\nBridgewater,<br />\nand<br />\nthe goal. The Jays held onto a 1-0 lead<br />\nscore and coming off the bench to move<br />\nington and Lee by 13-12. Hopkins<br />\nuntil the last ten seconds of the half.<br />\n27 yards to another in the final minscouting reports portray them as solid<br />\nutes. These two runs pushed the 5-10<br />\nin all departments, and put special emSwarthmore Scores<br />\n175 pound junior's game rushing mark<br />\nphasis on the quality of their offensive<br />\n113 yards on seven carries, while<br />\nto<br />\nSwarthmore then took advantage of<br />\nbackfield.<br />\nWeiss provided the largest share of the<br />\nan indirect free kick just outside the<br />\nFollowing tomorrow's encounter team's 34 yard total with 138 on eight<br />\nHopkins: penalty area. On what would<br />\nwhich, unlike the last two, should habitrips.<br />\nhave been the equivalent of a fumble in<br />\ntuate Hopkins to the difficulties of crufootball, Hopkins' Mike Avery and<br />\nHomeThe<br />\ncome.<br />\nto<br />\nclashes<br />\ncial M.A.C.<br />\nDefense Better<br />\nDave Rockwell crashed into Rosenbaum<br />\nwood squad gets a week's layoff before<br />\nof Swarthmore who received credit for<br />\nThe defense - which held Haverford<br />\nBy RICH HOLLANDER<br />\ngets a week's layoff before meeting<br />\nthe goal. The score stood 1-1 at the end<br />\nAfter splitting their first two meets loop foes Swarthmore, Dickinson, and and quarterback Jim Feely - who com- to seven first downs, 123 yards rushing<br />\nof the first half.<br />\nthe varsity cross country team is ready Western Maryland. The former, a 23-30 pleted eight of eleven passes for 21 (49 of these on a long scoring play<br />\nIn the middle of the third quarter to open its home season Saturday winner over Franklin and Marshall(beat- yards and three T.D.'s on the day - hit against Jay reserves), and 22 yards passSwarthmore stayed a fast break and against the Diplomats of Franklin and en 19-14 Hopkins), has lost only to Steve Latson and Cowan on forty and ing on three completions in 24 attempts<br />\nwere fouled at the edge of the penalty Marshall.<br />\nSouthern Division co-leader Delaware thirty yard scoring strikes before the - played what was probably its best<br />\narea. A penalty shot was awarded to<br />\ngame of the year. The coaches' choices<br />\nhas defeated end of the first period.<br />\nThe Hopkins thinclads breezed to a Valley; while Dickinson<br />\nthem, and Rosenbaum scored again<br />\nHaverford 34-14 and fallen to F&M by<br />\n(Continued on Page 7)<br />\nCharles<br />\ntheir<br />\nof<br />\nconquest<br />\n34<br />\nto<br />\n23<br />\nmaking the tally 2-1. Later Avery ran<br />\n22-8 count.<br />\ntook<br />\nLauren<br />\nJeff<br />\nLoyola.<br />\nrivals,<br />\nafter a twenty yard shot from his posi- Street<br />\nAnother Rout<br />\nplace honors completing the four<br />\ntion at goal when John Chisham, failed first<br />\nbehind<br />\nStriding<br />\nJeff,<br />\nJoe Cowan again led the<br />\n23.12.<br />\nin<br />\nWingback<br />\ntour<br />\nmile<br />\nto hear his call to back him up. The<br />\nCliff Cyr placed a way last Saturday, scoring four touchball was accidentally deflected into the senior co-captain<br />\ndowns while Hopkins pushed its season<br />\nstrong second.<br />\ngoal advancing the score to 3-1.<br />\nand league record to 3-0 with a 53-6<br />\nLoyola managed to sandwich in two<br />\nrout of winless Haverford. The contest<br />\nrunners as the Jays took fifth, sixth,<br />\nwas similar in pattern to the previous<br />\nHopkins Rallies<br />\nand seventh place. Coach Don Masken<br />\nweek's 43-0 conquest of Ursinus, as the<br />\n\"It<br />\ncommented<br />\nan<br />\nas<br />\nvictory<br />\nBarrette<br />\nsoaked<br />\nCoach<br />\nviewed this rain<br />\nrushed off to 33-0 halftime lead,<br />\nJ<br />\nJays<br />\nwould have been easy to quit then and \"outstanding team effort,\" since there<br />\nsubs go much of the final<br />\nlet<br />\nand<br />\nthere with three lucky goals for the was less than one minute between the<br />\nthirty minutes.<br />\nopposition, but the team refused to Hopkins quintet,<br />\nHalfback Paul Weiss's forty yard<br />\ngive up.\" With twelve minutes left in<br />\nLast Saturday the harriers ventured touchdown spirit got the team started<br />\nthe fourth quarter, WEs Bachur broke<br />\nup to Philadelphia for a triangular conaway for an unassisted goal. Seven minwith Drexel and Haverford. An<br />\ntest<br />\nutes later, Guerin beat a fullback to a<br />\nHaverford squard swept<br />\noverpowering<br />\nsideline pass, crossed the ball six feet<br />\nthe first four places and crushed HopIn the past weeks, the Newsletter<br />\noff the ground, and Charlie Sarau headkins 17 to 43.<br />\nhas been threatened with near-extinced the ball into the goal for a 3-3 tie.<br />\nCliff Cyr ran a game fifth ahead of tion by the concerted efforts of, not<br />\nWith two and one-half minutes to go<br />\nPeter zeros in on \"A Whiter Shade<br />\nand the ball just outside our penalty any Drexel runner. Yet this did not suf- Administration or angered students,<br />\nPale,\"\"Ding Dong!The Witch Is<br />\nof<br />\nprinters.<br />\nits<br />\nbut<br />\npostarea, Rockwell's leg cramped. Goalie fice as the home town contingent<br />\nDue to the worsening situation, the<br />\nDead,\"\"Up-Up and Away,\"\"Alfie,\"<br />\nAvery tried to rush the Swarthmore ed a 25 to 34 victory over the Jays. Conplayer when he saw that Rockwell had solation, or rather rationalization, may Newsletter was planning to hire scribes<br />\nand \"Somethin'Stupid,\"—and his<br />\nbe attributed to the psychologically de- from local monasteries to do the paper<br />\nfallen but the ball was tipped in.<br />\nbeat and sound are right on target.<br />\nprowas<br />\nhowever,<br />\nCost,<br />\nlonghand.<br />\nin<br />\naband<br />\nthe<br />\nmanding five mile course<br />\nhibitive.<br />\nPeter's also included tunes from hit<br />\nsence of pace setting Jeff Lauren.<br />\nIn a stroke of luck, a new printer<br />\nF&M Next<br />\nBroadway shows and two original<br />\nhas been found. However, readers are<br />\nThe squad faces Franklin and Mar(Continued on Page 7)<br />\nin an album that delivers<br />\nsongs<br />\nunNewsletter<br />\nthe<br />\nwith<br />\nbear<br />\nto<br />\nasked<br />\nshall next Saturday at 2 p.m. away. The<br />\ntil technical difficulties are ironed out.<br />\nsolid entertainment from the first<br />\nBy BOB HYAMS<br />\n<br />\nThinclads Battle<br />\nDips Tomorrow<br />\n<br />\nTragic Story<br />\n<br />\nPETER<br />\nNERO<br />\nINGS<br />\nHITs<br />\n<br />\nnote to the closing chord.<br />\n<br />\nRCA VICTOR<br />\n0<br />\nThe most trusted name in sound<br />\n<br />\not My Eye On The Man._<br />\nVAN' H<br />\n<br />\nLiamr.r<br />\n<br />\n417\" VANOPRESS SHIRT<br />\nOne look and wham! I knew he was for me.<br />\nLean and limber and all man in the terrific<br />\nfit of his Van Heusen \"417\" Vanopress<br />\nshirt. Made with the authentic button-down<br />\ncollar, this shirt was permanently pressed<br />\nthe day it was made and will never need<br />\npressing again. No more laundry bills!<br />\nAs for the great new Van Heusen fabrics,<br />\ncolors and patterns . they make him<br />\nthe guy to keep an eye on!<br />\n<br />\nBuild up your following with Passport 360,<br />\nthe influential line of men's toiletries by Van Heusen<br />\n<br />\nkir<br />\nan<br />\nsci<br />\nnil<br />\nor<br />\nthe<br />\nto<br />\nInc<br />\ngoi<br />\n<br />\ntha<br />\nthe<br />\na pi<br />\nistr<br />\nPor<br />\n<br />\nhea<br />\ned<br />\ndid<br />\nwa5.<br />\n<br />\nhot,<br />\ncon<br />\nbed<br />\ndou<br />\nspe,<br />\n<br />\nday<br />\nfin(<br />\n<br />\nthrt<br />\nity<br />\n<br />\nday<br />\nat ;<br />\ntest<br />\nabo<br />\nare<br />\nbes<br />\nYot,<br />\ndor<br />\n<br />\nthe<br />\nPto<br />\nalot<br />\n<br />\n\f", "format": "basic_html", "processed": "mit<br /><br />\nWeekend Weather<br />\nWatch<br />\nProbably east and west winds,<br />\nvarying northeast or southwest;<br />\nSaturn is behind the Moon.<br /><br />\nVOL. LXXII, NO.4<br /><br />\nrum1 ilirttrr<br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND,OCTOBER 20, 1967<br /><br />\nOn the Inside:<br />\nPaul Krassner exists.<br />\nHe tells all about it.<br />\nSee page 5.<br /><br />\n72ND YEAR<br /><br />\nBlatant Bigotry Blazes at Bradford<br />\nBook Store Rapped<br />\nAs Slow,Inefficient<br /><br />\n0<br />\nBRADFORD<br />\nBEAUTY<br /><br />\nBeauty Shop Denies<br />\nService to Negro<br /><br />\nBy DICK CRAMER<br />\nBy DENNIS EST1S<br />\nMrs. Geiger informed the two wothing sold at the bookstore. They now<br />\nThe Johns Hopkins Book Center has<br />\nThe wife of a Hopkins Negro gradu- men that they did not have an appointobtain no further benefits than do the<br />\ncome under much criticism lately, from<br />\nate student was twice refused an ap- ment for that time, as there was no inboth students and faculty. Opinions students. Others, students and faculty<br />\npointment for a haircut at the Bradford<br />\nalike,<br />\nare<br />\nangered<br />\nby<br />\nwhat<br />\nthey<br />\nbelieve<br />\ndication of such in her book. Neither<br />\nrange from that of Dr. Richard MackBeauty Salon last week.<br />\nwomen was allowed to see the book for<br />\nsey, Professor of Humanities, who says arc store operators' attempts to label<br />\nBetty Pink, a resident of McCoy<br />\nthemselves.<br />\n\"There has to be an improvement in the everything a1 a textbook, thus cutting<br />\nHall,<br />\ngone<br />\nhad<br />\nto<br />\nshop<br />\nthe<br />\non<br />\noccatwo<br />\ndown<br />\non<br />\nthe<br />\ndiscounts offered.<br />\nMrs. Pink then asked if she could<br />\nservice of the Book Center,\" to that of<br />\nsions. She was refused service outright<br />\nMany people, moreover, think that<br />\nmake an appointment for the next day<br />\nDennis Drew, a Negro member of the<br />\nonce.<br />\nThe second time, she was given a<br />\nor the next week, but she was told that<br />\nfreshman class, who commented, \"It the book store is poorly organized. Caphony appointment by the owner of the<br />\nthey were all filled up. She then asked<br />\nstinks, baby - - the guard is prejudiced.\" taloguing of the books by topic instead<br />\nSalon, Dottie Geiger.<br />\nby<br />\nof<br />\npublisher<br />\nis<br />\ninnovation<br />\nan<br />\nthis<br />\nif she could make an appointment for<br />\nIn response to complaints of ineffiThis incident was the most recent of<br />\nnext month. It was at this time that the..<br />\ncient operation a committee composed year and has been met with both approseveral<br />\nrecent<br />\ncharges<br />\nof<br />\ndiscrimination owner<br />\nof faculty and administration members val and dissatisfaction.<br />\ntold her that Mrs. Pink couldn't<br />\nleveled<br />\nat the shop, located in the baseBrowsers in the store feel that the<br />\nformed early last year. The faculty comment of the University-owned Bradford come at all and she couldn't be taken<br />\nsystem<br />\nis<br />\nimprovement<br />\nan<br />\nas<br />\nthey<br />\n,<br />\ncan<br />\ncare of.<br />\nmittee recommended that the store be<br />\nApartments.<br />\nrun with an eye to the academic aspect see all of the books one subject at a<br />\nMrs. Pink and Miss Williams left the<br />\nof the university instead of the business time, but people looking for specific<br />\nshop, and informed several friends and<br />\nHopkins<br />\nhas<br />\ndiscouraged<br />\nbooks<br />\nthink<br />\nsystem<br />\nthe<br />\nplanned<br />\na<br />\nless<br />\nadvantaend. This marked a major shift in poprotest by a large group of graduate stu- the victim's husband. Mr. Victor Dates,<br />\ngeous. In general, opposition to the calicy for the Book Center.<br />\nDirector of Special Programs, was condents.<br />\nIn this way,the University hoped<br />\ntaloguing is most often found among<br />\nRequests Ignored<br />\ntacted and informed of the incident.<br />\nto avoid any publicity which might<br />\nIn a study by the News-Letter, it be- professors and graduate students.<br />\nMr. Dates told Mrs. Pink on Thursforce it to take immediate action.<br />\nPerhaps the greatest complaint is<br />\ncame evident that many of the requests<br />\nday to go back to the shop. She returnPix by Frank Urrutia<br />\nThis<br />\naction<br />\nwould<br />\nthat<br />\ninefficiency,<br />\nof<br />\nhave<br />\nto<br />\ntake<br />\nwith<br />\nthe<br />\nsome<br />\nspecial<br />\nmade by the committee have been iged to the salon at approximately 1:00<br />\nnored and that others have been initia- orders taking two months to arrive. Any \"A THING OF BEAUTY is a joy for- form of a legal suit, since it is the only p.m. that afternoon and once again<br />\nreted without regard for the purpose be- book in this country can normally be ever,\" but Dottie doesn't think so. Dot- way to remove the present manage- quested an appointment.<br />\nreceived within a week.<br />\nhind the change.<br />\ntie runs Bradford Beauty Salon, where ment. The administration has promised<br />\nThis time Mrs. Geiger informed her<br />\nMrs. Pink and the graduate students<br />\n(Continued on Page 2)<br />\nNegro was refused service.<br />\nThe first recommendation, that the<br />\nthat the only available time was at 8:30<br />\nthat<br />\nGeiger's<br />\nMrs.<br />\nlease<br />\nwould<br />\nnot be reBook Center be moved to larger quarnewed when it expired in December. In a.m. on Monday morning. Mrs. Pink<br />\nters, was intended to allow for more<br />\nagreed to come back Monday at the dethe meantime, the University advised<br />\nbook space and a wider variety of<br />\nsignated hour.<br />\nMrs.<br />\nPink<br />\nnot<br />\nto<br />\nreturn<br />\nto<br />\nthe<br />\nbeauty<br />\nbooks. However, the increase in floor<br />\n(Continued on Page 2)<br />\nsalon.<br />\nand shelf space has not been matched<br />\nby a jump in the number and variety of<br />\nA similar incident occured last year,<br />\nbooks.<br />\nPoor Selection<br />\nwhen a local barber, in the Marylander<br />\nDr. Macksey says that the selection<br />\nMr. Sanford J. Rosen, attorney for time, a three-judge panel ruled against apartment, building refused to serve a<br />\nof books has improved somewhat, but Joseph Whitehill, declared that he was him.<br />\nNegro Hopkins freshman. After a strong<br />\nNow that the judges have the case, campus protest which was led<br />\nthat it still is not adequate. The Stu- \"very optimistic\" about his case before<br />\nby the<br />\nVice-President Hubert Humphrey<br />\ndent opinion was summed up by Paul the Supreme Court. Mr. Whitehill, a Mr. Rosen expects that they will reach a News Letter, the owner was influenced<br />\nwill speak to selected faculty and stuBoddner, who said, \"the selection is Johns Hopkins instructor in the writing decision by the first of the year at the to change his policy.<br />\npretty poor. I'd never go to the book- Seminars, is presently challenging the latest. He qualified his optimism by sayMrs. Geiger declined to comment on dents at Goucher College tomorrow<br />\nstore if I was just looking for something Ober Law, Maryland's employee loyalty ing that one could never really tell in the entire incident, claiming only that according to reliable sources.<br />\nThe Vice-President was invited by<br />\ngood to read.\" the disparity between oath.<br />\nHe cited the fact that the last test \"There had been a mistake, and it is all<br />\nDr. Corrin, head of the Political Science<br />\nincrease in space and stock is evident by<br />\nOn Monday, October 16, Mr. Rosen case on the oath lost by a narrow 5-4 taken care of now.\"<br />\ndepartment at Goucher. The visit has<br />\nthe fact that there is still empty shelf presented the appelate argument for his decision. Since then, one of five judges<br />\nThe incident began last week when<br />\nspaces.<br />\nclient and it then became sub judica (in \"against\" has retired \"However, we Pat Williams, made an appointment for been kept a secret to avoid crowds and<br />\nA ten percent discount on trade the hands of the judges.)This marks the can't be sure of the continuing support herself and Mrs. Pink for 10:30 a.m. demonstrations on the campus.<br />\nHumphrey will have a breakfast<br />\nbooks was also begun, last year, but has climax of more than a year of court- of the other four judges, either.\"<br />\nWednesday, October. 11<br />\nmeeting in the morning, and then will<br />\nmet increasingly with complaints. Many room activity.<br />\nArriving at the Beauty Salon at the<br />\n•<br />\nstudents feel that this small discount is<br />\nInfringement<br />\nproper time, the two women were ap- attend two meetings. The first talk will<br />\nAction<br />\nTaken<br />\nactually of no benefit while the adminMr. Whitehill and Mr. Rosen con- proached by Mrs. Geiger and asked if be with several faculty members and<br />\nistration believes that the book store is<br />\nMr. Whitehill initially took action tended in court that the Ober Law in- they were together. When the women four selected students, the second meetlosing too much money because of the in September of 1966, after being re- fringes upon the rights of free speech, replied that they were, the Beauty Shop ing will be with two professors and two<br />\nadditional students.<br />\ndiscount. But by far, the most dissatis- fused a part-time teaching post at the expression and academic freedom.<br />\nowner proceeded to skim through a<br />\nThe Vice-President is in Baltimore<br />\nfied group is the faculty, which used to University of Maryland when he deHowever, Maryland's Assistant At- book which appeared to contain aptoday to deliver an address to the AFLenjoy a ten percent discount on every- clined to sign the Loyalty Oath. At that<br />\n(Continued on Page 3)<br />\npointments.<br />\nCIO.<br /><br />\nWhitehill Hopeful<br />\nFor Loyalty Victory<br /><br />\nHHH To Visit<br />\nGoucher College<br /><br />\nS.A.:Of Mice And Men<br />\nRat Crackdown Planned<br />\nFor Community Clean-Up<br /><br />\nThe Student Association plans to wipe out the infamous Hopkins rat-nest located southeast of campus. The<br />\norganization intends to mount a rat-control campaign in<br />\nthis area utilizing volunteers from Hopkins.<br />\nThe SA's program for attack depends on the participation of the students living in the area to spearhead the<br />\ndrive. The area used in the program will be decided upon<br />\nby the amount of student interest in a given block. The<br />\nmain problem lies between Charles and Guilford, froth<br />\n27th to 33rd Sts.<br />\nSanitation Problem according to SA Co-President Jim<br />\n0<br />\nWinship, the line of attack will involve both destroying<br />\nthe rats and the conditions which breed them.\"We could<br />\neasily kill 90% of the rats in a given block, but if the<br />\nsanitation conditions in that block are not changed, the<br />\nrats will return in very short time. The Bureau of Rodent<br />\nControl of Baltimore has demonstrated this .simple fact<br />\nseveral times in their own control programs.\"<br />\nPix by Tom Hoffman<br />\nWinship outlined the specific steps to be taken. First.<br />\nTHE INCREDIBLE MULTIPLYING RAT will be the victim of a canvas of the block will be made to determine where<br />\ncourageous extermination attempt. The common rodent terror- violations of codes and health dangers exist. Thon the<br />\nresidents of the dwellings involved will be recruited to aid<br />\nizes Hoppies daily. Know Your Enemy.<br />\n(Continued on Page 3)<br /><br />\nSA Seeks Direct Action<br />\nPrograms to Better City<br />\nIncreased student participation in social action programs will highlight the Student Associations new drive<br />\nfor inner city involvement. Inner City tutoring program,<br />\nsponsored by the Student Association will be implemented<br />\nwith more direct action projects. The direct action programs are meant to rectify the feeling that the present<br />\ntutoring is \"too passive\" and \"merely a crutch for an<br />\ninadequate school system.\"<br />\nThough many programs have been proposed, SA CoPresidents Joe Weinberg and Jim Winship have pointed<br />\nto the lack of student support as the major stumbling<br />\nblock.<br />\nThe SA is functioning as a clearing house for Inner<br />\nCity needs. The organization, due to the many contacts<br />\nof Dr. Chester Wickwire, has channels in the city to create almost any program where student interest exists.<br />\nOne proposed plan of action is to get students who are<br />\nknowledgeable about housing regulations in Baltimore to<br />\nadvise tenants.<br />\nA student who undertook this project could receive<br />\ncredit for studying the housing court and writing a paper<br />\non this facet of city government.<br />\n(Continued on Page 3)<br /><br />\nPIN<br /><br />\nPAGE TWO<br /><br />\nNEWS-LETTER<br /><br />\nHOMEWOOD,BALTIMORE,OCTOBER 20, 1967<br />\nleue-VMMINIMMISIVe<br /><br />\nCustomers Unhappy<br />\nOver Book Center<br />\nELEPHANTS<br />\nnever forget<br />\n(and you will<br />\nalways rern.ernber)<br />\nthe fabulous<br />\n'<br />\nvalues at<br />\nTHE<br /><br />\nI<br /><br />\nSAMPLE<br />\nSTORE<br />\nEVERY<br />\nSPORTCOAT<br />\nIN STOCK<br />\nValues to $45.00<br /><br />\n$19<br />\nSAMPLE STORE<br /><br />\nIINZ<br />\n1<br />\n\"<br />\n.<br /><br />\n-Tiv newPlyinouth RoadRimer<br />\nnow at your Plymouth PealeAt<br /><br />\n3031 Greenmount Ave.<br />\nIn Waverly<br />\nOPEN EVERY EVENING<br /><br />\n• CNARG-1T • NAC • $1000 CLUB<br /><br />\nwbete the Zwatgms 0/7.MO<br />\nC1967 Varner BroL —Seven Arts, Ine.<br /><br />\nThe Air Force doesn't wantto<br />\nwaste your Bachelor of Science<br />\nDegree any more than you do.<br />\nB. Sc. Those letters have an impressive sound.<br />\nBut they won't be so impressive<br />\nif you get shunted off into some<br />\nobscure corner of industry after<br />\nyou leave college. A forgotten man.<br />\nYou want activity. You want to<br />\nget in there and show your stuff.<br />\nAll right. How do you propose to<br /><br />\ndo it?<br />\nIf you join the United States Air<br />\nForce you'll become an expert fast.<br /><br />\nThe Air Force is like that. They<br />\nhand you a lot of responsibility fast.<br />\nThrough Officer Training School<br />\nyou get a chance to specialize<br />\nwhere you want... in the forefront<br />\nof modern science and technology.<br />\nSuppose, for example, you<br />\nwanted to become a pilot and serve<br />\nas aircraft commander on airplane<br />\ncrews. You'd plan missions and<br />\ninsure that the aircraft is pre-flighted, inspected, loaded and equip-<br /><br />\nContinued from Page 1<br />\npurchase books before coming to<br />\nDr. Macksey said that he.had more school, perhaps for less money. It has<br />\ntrouble getting books for his courses been contended that the book store<br />\nthis year than he had ever had before. will not publish the lists early, so as to<br />\n\"The books simply were not there at insure itself a monopoly on the sale of<br />\nthe beginning of the term.\"<br />\ntext books.<br />\nIn one course, \"War in the Modern<br />\nWorld\" the texts did not arrive until<br />\nSome sources have suggested that<br />\nmore than two weeks after the term be- the faculty committee is giving its most<br />\ngan. Moreover, upon arrival, there were concentrated attention to a complaint<br />\na meagre ten books for the one-hundred advanced by the employees of the Censtudents in the class.<br />\nter.\"The ladies need a place to sit down<br />\nSome students propose that the and relax, out of the flow of traffic,\"<br />\nlists of required books be published in Dr. Macksey says. One female worker<br />\nthe early summer, allowing students to stated, \"There's no place to rest my<br />\nfeet.\"<br /><br />\nStudent's Wife<br />\nDenied Haircut<br />\n(Continued from Page 1)<br /><br />\nFilm, Panel Set<br />\nFor Rights Talk<br /><br />\nReturning to her apartment, Mrs.<br />\nThe film \"Black Natchez\" will highPink discovered from her neighbors that<br />\nthe shop was closed all day on Monday. light the third program in the StrangeShe called up Mrs. Geiger and requested land '67 series concerning \"Black Powto have the day and time of the appoint- er and White Impotence\"set for Sunday<br />\nment changed. The owner refused, night at 7:30 p.m. at Levering.<br />\nA panel discussion will follow involclaiming that she had no openings.<br />\nMrs. Pink called Mr. Dates again,and ving such local civil rights leaders as<br />\na meeting was arranged to explain to Daniel Gant from CORE, and Walter<br />\nhim what had taken place. The Univer- Carter of VISTA. One of the chief prosity received assurances from Mrs. Ge1 blems under consideration will be the<br />\nger that something of this nature would role of the so-called white liberal in the<br />\nnot happen again,; and henceforth, ser- civil rights movement.<br />\nStrangeland endeaver features Philip<br />\nvice would be provided to all on an<br />\nWerdell, noted proponent of student<br />\nequal basis.<br />\nThe University emphasized to the<br />\nOn Oct. 30, Rabbi Richard L. RuSalon's owner that should this policy be benstein, reknowned death of God<br />\ndisregarded in the future Hopkins theologian and author of a book enwould take immediate steps to termi- titled After Auschwitz - Radical Theonate the contract between the school logy and Contemporary Judaism, will<br />\nand the salon. This is in contradiction speak on \"After Auschwitz: The Death<br />\nto what was told Mrs. Pink.<br />\nof God.\"<br /><br />\nped for the assigned mission. You'll<br />\nbe trained to fly exciting aircraft.<br />\nJust examples. There are so<br />\nmany more.<br />\nWouldn't it be pretty nice to enjoy officers' pay and privileges?<br />\nAnd serve your country, as well?<br />\nAlso, you get retirement be lefits,<br />\n30 days' paid vacation, medical<br />\nand dental care.<br />\nB. Sc. Very impressive letters.<br />\nNow, do something with them.<br /><br />\nf<br />\nASs7<br /><br />\ntt1,443<br />\n,<br />\n;&lt;:',\"160440.0&lt;;<br /><br />\nk•A::<br /><br />\nDRUGS. Peter Laurie. A new and highly readable report covering all the major psychological, medical, and social facts about<br />\nLSD, heroin, marihuana and a variety of other drugs; the extent<br />\nto which these drugs are being used today; and the dangers<br />\ninvolved. S249.<br />\n95c<br />\nTHE PENGUIN BOOK OF MODERN VERSE TRANSLATION.<br />\nEdited by George Steiner. The first book of its kind, containing<br />\nsome 250 poems by major English and American poets from<br />\nSwinburne to Robert Lowell. Each poem is a translation or imitation of a work in a foreign tongue. D94.<br />\n$1.65<br />\nTHE STRUCTURE OF LIFE. Royston C/owes. An introduction to<br />\nthe exciting new science of molecular biology. A850.<br />\n$1.95<br /><br />\nTHE MERSEY SOUND. Adrian Henri, Roger McGough, Brian<br />\nPatten. Some of the liveliest ideas and attitudes of mod Britain<br />\nare expressed in this collection of works by three young poets<br />\nof the Beatle generation. D103.<br />\n95c<br />\nYou'll find these and other entertaining, informative Penguins<br />\non sale at your campus bookstore now.<br /><br />\nUNITED STATES AIR FORCE<br />\nBox A, Dept.SCP-710<br />\nRandolph Air Force Base, Texas 78148<br /><br />\navailable at<br /><br />\nTHE JOHNS HOPKINS BOOK CENTER<br /><br />\nHOMEWOOD,BALTIMORE,OCTOBER 20,1967<br /><br />\nFaces Court<br /><br />\nNEWS-LETTER<br /><br />\nPAGE THREE<br /><br />\nSA Pushes Sanitation, Education<br /><br />\n(Continued from Page 1)<br />\ntorney-General, Loring Hawes, stated<br />\nthat the certificate applies only to \"engagement in an attempt to overthrow<br />\nthe government by force. It constitutes<br />\nno more infringements on beliefs, expression and rights of association than<br />\nthe oath to support the Constitution.\"<br />\n(Continued from Page I)<br />\ndent lies in improper and uncovered<br />\n\"Broad and Vague\"<br />\nthe students by cleaning up the objec- garbage cans.<br />\nThe average rat only needs<br />\n(Continued from Page 1)<br />\nMr. Rosen argued in court that the tionable conditions. The rats will be<br />\nsolicitation program in transition neigha few ounces of food a day to live. The<br />\nOber Law is \"unconstitutionally broad killed, probably with poisons. Spot<br />\nPolitical education is a wide open borhoods, such as the area southeast of<br />\nSA views the sanitation problem as a<br />\nand vague.\" Hawes noted that Mary- surveillance of the block would be<br />\nfield for student activity. The need for campus, is urgently<br />\nkey one.<br />\nneeded.<br />\nland's law is less restrictive than others continued to prevent the rats return.<br />\nan effective political awareness in the<br />\nSeveral fraternities in the area have<br />\nsuch as the one which existed in WashThe SA has discussed and worked<br />\nghetto is acute. The Community AcPerson to Person<br />\nington. The Washington oath was held out the plan with the Division of Ro- been contacted and, according to Win- tion Agency and<br />\nother groups need<br />\nCommunity person-to-person relato be \"too vague\" in language and was dent Control of the City. The Division, ship, have agreed to cooperate on their<br />\npeople to help in voter registration and tionships, more<br />\ninformal than structurrejected by the Court.<br />\nthrough the office of Senior Sanitarian own properties.<br />\neducation.<br />\ned tutoring, can also be arranged. WeekThe certificate which Mr. Whitehill James R. Woodford, Jr., as agreed to<br />\n\"This is a long range program that<br />\nHousing, perhaps the most emotion- end camping or work<br />\nrefused to sign reads:<br />\naid the control program. They will should not be too time consumi<br />\ntrips have been<br />\nng for al civil rights issue, may also be<br />\nthe suggested as well as programs such as<br />\n\"I hereby certify that I am not a train volunteers in clean-up and killing the individual students<br />\n\" Winship stated. most<br />\ncritical. Code enforcement and the swim program run<br />\nsubversive person as defined by law, techniques, provide literature, posters, \"With a decent<br />\nby the SA last<br />\nshow of support, the<br />\ntenant education to improve existing year.<br />\nnamely that I am not a person who is and poisons, and, if necessary, serve program wouldn't<br />\nrequire more an hour<br />\nengaged in one way or another to over- summons to uncooperative persons.<br />\nper student each week. We hope that housing is an immediate necessity.<br />\nStudents with job skills can help in<br />\nthrow the Government of the United<br />\nMr. Woodford indicated that the de- students living in the<br />\narea will be inter- Training in these areas can be provided job training through existing organizaStates, or the State of Maryland, or any partment would welcome all the help ested in the idea and<br />\nagree to work on for interested people.The need to com- tions in the city. The possibili<br />\nty of<br />\npolitical subdivision of them, by force in controlling rats that it could receive.\" it. Once a body of students<br />\nin the same bat the \"scare solicitation tactics\" of creating a job clearing<br />\nhouse, such as<br />\nor violence.\"<br />\nRats are a great menace in the city,\" block, say the 2900<br />\nblock of Calvert unscrupulous real estate dealers is also<br />\nhas been done by private organizations<br />\nhe stated, \"spreading disease, destroy- Street, have come to<br />\n1111111•11.11•1111111111i<br />\nuse, we will get growing. The exodus of the white midin other -cities, exists provided there<br />\ning property, and ruining food.\"<br />\nthem together and initiate the program dle class only<br />\nrobs a city of its tax base. are people willing<br />\nThe main source of food for the ro- in the block.\"<br />\nto put the time in<br />\nAn effective education and counter- througho<br />\nut the year to run it.<br /><br />\nBlock-to-Block Sweep Hopes to Alert<br />\nDwellers, Force Owners into Action<br /><br />\nTIME<br /><br />\nIf Mexico and Bermuda send you,<br /><br />\nThe longest word<br />\nin the language?<br /><br />\nwe'll send you posters of Mexico and Bermuda.<br />\n3 for $1.50.<br /><br />\nBy letter count, the longest<br />\nword may be pneumonoultramicroscopicsilicovolcanoconiosis,<br />\na rare lung disease. You won't<br />\nfind it in Webster's New World<br />\nDictionary, College Edition. But<br />\nyou will find more useful information about words than in any<br />\nother desk dictionary.<br />\nTake the word time. In addition to its derivation and an<br />\nillustration showing. U.S. time<br />\nzones, you'll find 48 clear definitions of the different meanings of time and 27 idiomatic<br />\nuses, such as time of one's life.<br />\nIn sum, everything you want to<br />\nknow about time.<br />\nThis dictionary is approved<br />\nand used by more than 1000<br />\ncolleges and universities. Isn't<br />\nit time you owned one? Only<br />\n$5.95 for 1760 pages;<br />\n$695<br />\nthumb-indexed.<br />\nAt Your Bookstore<br />\nTHE WORLD PUBLISHING CO.<br />\nCleveland and New York<br /><br />\nThe diver of Acapulco. The torero of Mexico.<br />\nThe sleek racing craft of Bermuda.<br />\nAll three 30\" x 40\" posters are beautifully<br />\nreproduced in color. And they're all yours for<br />\nonly $1.50.<br />\nWe think you'll like them so much, you'll<br /><br />\nBOOK CENTER<br />\nGilman Hall<br /><br />\nCHUNG'S<br />\nCARRY-OUT<br />\nFine Chinese and<br />\nPolynesian Food<br />\nOpen Daily 11 A.M.• 10 P.M.<br />\nFriday &amp; Sat. 11 AM..12 P.M.<br />\nSunday 1 P.M..11 P.M.<br /><br />\n508 W. Cold Spring Lane<br /><br />\n889-3428<br /><br />\nComplete Bachelor<br />\nService<br />\nFLUFF DRY &amp; FOLD<br />\nSHIRTS—DRY CLEANING<br /><br />\nWaverly Laundromat<br />\n3330 GREENMOUNT AVE.<br />\n467-2123<br /><br />\nwant to go to Mexico and Bermuda some day.<br />\nAnd when you do, we hope you'll go on<br />\nEastern.<br />\nSo don't just sit there staring at four blank<br />\nwalls. Fill in the coupon below and send for<br />\nyour colorful posters now.<br /><br />\n,19<br />\nEASTERN<br />\nWe want everyone to fly.<br /><br />\nr-<br /><br />\nAVAILABLE AT:<br />\nTHE JOHNS HOPKINS<br /><br />\nStudent Volunteers to Combat Scare<br />\nTactics of City's Real Estate Dealers<br /><br />\nTo: Eastern Airlines, Inc., Poster Offer, Box 4211, Grand Central Station<br />\n, New<br /><br />\nYork, N.Y. 10017<br />\nPlease send me the Bermuda, Acapulco, and Mexico posters, for which I<br />\nenclose a $1.50 money<br />\norder or check (payable to Eastern Air Lines, Inc. Poster Offer).<br />\nName<br /><br />\nAddress<br /><br />\nCity<br /><br />\nState<br /><br />\nZip Code<br /><br />\nCI I would also be interested in receiving a Youth Fare Application.<br /><br />\n..<br />\n\"<br /><br />\nEAGE FOUR<br /><br />\nNEWS-LETTER<br /><br />\nalp iolins npktnn lienti-Ettirr<br />\nEDITORS-IN-CHIEF<br />\nPeter J. Koper<br /><br />\nHOMEWOOD,BALTIMORE,OCTOBER 20, 1967<br /><br />\nI Alas,Poor Yorick<br /><br />\nRoger C. Toll<br />\nBUSINESS MANAGERS<br /><br />\nBy MICHAEL G. MICHAELSON ever rcgiettable, the situation is at least vision sets in the Senate Chamber, one<br />\nbetween every pair of seats. (Or perThere is something (albeit an ever within the range of understanding, and<br />\nhaps the alternate scheme, giving each<br />\nWe<br />\nhave<br />\nexcusable.<br />\nenough<br />\non<br />\nour<br />\neven<br />\ndiminishing something) to be said for<br />\nTHE BOARD OF CONTROL<br />\nFirst Class (or \"Senior\") Senator a set<br />\nCouncil,<br />\nStudent<br />\nkeeping<br />\nthe<br />\nhands<br />\nEDITORIAL CHAIRMAN MANAGING EDITOR EXECUTIVE EDITOR the proposition that a man's undergrad- much less the world, on the up and up. of his own, while requiring every Touruate years should be selfish ones. What<br />\nDavid Schneiderman<br />\nJoseph Weinberg<br />\nHenry Hocherman<br />\nist Class (or \"Junior\") Senator to share<br />\nwill, for an unfortunately large portion But there are people who do have the his set with three others.) Besides its<br />\nASSOCIATE EDITORS<br />\nof students, amount to a lifetime of world in their hands. There are people obvicus recreational value and the posiElia Katz<br />\nJed Luchow<br />\nMike Phillips<br />\nlearning must somehow be compressed that society pays to be involved,just as bilities it opens for renewed displays of<br />\nNEWS EDITOR<br />\nNEWS COORDINATOR<br />\ninto four brief years. The job is, or it \"pays\" students not to be. There are parliamentary etiquette, the plan may<br />\nBruce Drake<br />\nDennis Estis<br />\nshould be, a full time one; and it makes people whose vacations from worldly provide the Senators with a unique eduSPORTS EDITOR<br />\nFEATURES EDITOR<br />\nCOPY EDITOR<br />\nparasites of us all. We suck knowledge obligation should have ended when cational opportunity. They may, for<br />\nJames Sloan<br />\nMurray Rudnick<br />\nPeter Harnik<br />\nfrom books and professors, money from their college days did. The indifference instance, be forced to watch an occaour parents, and, perhaps most impor- of these people, pedalled as involve- sional news bulletin between innings,<br />\nPHOTOGRAPHY EDITOR<br />\nGRAPHICS EDITOR<br />\nment, waxes pernicious; their failures<br />\ntantly, time from the draft board. All<br />\nNeil Graver<br />\nTom Hoffman<br />\nbody counts, perhaps. And with the<br />\nassume tragic proportions.<br />\nthis<br />\nwith<br />\nnot<br />\nmerely<br />\nthe<br />\nsanction,<br />\nbut<br />\nBALANCE EDITOR<br />\nSeries over, a few might catch a docusponcorre<br />\nLast<br />\nWashington<br />\nweek,<br />\na<br />\nthe hearty approval and nostalgic sigh,<br />\nStephen Shriver<br />\nmentary on life in the ghettos, on watch<br />\ndent for the New York Times wrote a<br />\nof society.<br />\nthe video tape replay of an infant's ear<br />\nIt's nice. Real nice. But not real real. tragedy in one paragraph.<br />\nbeing chewed by a pack of neighborThe campus here, for example, with it's<br />\n\"Reading from a prepared speech, hood rats. See what it's like. Living<br />\nperfectly green if not precisely rolling Senator Fulbright spoke to a virtually Colored. ,<br />\nlawns, its redundant red brick resplend- empty Senate Chamber.Only as he conance, its Euclidean symmetry, hardly cluded did the Senators drift on to the<br />\nUntil that day, however, when Conneeds an impressive marble wall on floor from the cloakrooms where they gress is flooded by Sony's and Walter<br />\nCharles Street to emphasize its distinc- had been watching the final innings of Cronkitc is in every legislators ear,<br />\ntion from metropolitan Baltimore. Even<br />\ngame in Boston.\"<br />\nsomeone else will have to tell the boy'<br />\nThe most unique aspect of the American protest of our involve- our rodents are different. A squirrel the World Series<br />\nthat what's happening in Fenway Park<br />\nment in Vietnam is the tie which has brought together so many di- control bill will probably never reach<br />\nThe protagonist here may not have isn't what's happening. As students, we<br />\nbeen addressing Yorick's skull, but his should not have to get<br />\nverse elements and people in this country into a common bond. To- the House.<br />\ninvolved in this<br />\nProponents of academic autism \"audience\" was no less inanimate. Un- stinking world. Not yet. We have a deal.<br />\nmorrow, blacks, whites, mothers, babies, students, drop outs, hipwould counter with the suggestion that, divided (or even fragmentary) attention<br />\npies, veterans, socialists, conservatives and many others, in all num- for purposes of study and learning, real- may be too much to expect of ordi- We have an Ivory Tower that is 99 and<br />\n100% pure. We like it, and we should.<br />\nbering an estimated 200,000 people, will walk together through ity is extraneous. What is important is nary mortals, but their presence would We<br />\nwant to stay there, and we should.<br />\nWashington,D.C., across the 14th Street bridge,and to the Pentagon. \"atmosphere,\" environment, sufficient have been, if nothing else, polite. Faced But there comes a time when everyone's<br />\nfreedom from responsibility, from in- with the choice between- listening to Stay-Press slacks<br />\nand striped shirt and<br />\nBut equally diverse as the group themselves are the objections and volvement with the world, to allow sin- the melancoly Senator's depressing so- herringbone jacket and Weejyn's and<br />\nminded intellectual pursuit. In short, liloquy or the joyful crack of Carl pastel socks<br />\nhave to get dirty. When<br />\ncriticism which these groups are leveling at President Johnson and gle<br />\nan Ivory Tower - - - - warm, comforta- Yastremski's bat, their decision was per- every hippy has to prove he's a<br />\nlover.<br />\nhis advisors. It is sad, though understandable, that an emotional fer- ble, safe, distant. Society gives us an haps understandable. But it would have<br />\nBecause we have been unlucky, our<br />\nvor has swept through many ranks of dissenters, notably among Elevator Pass, and expects us to make been understandable too, if Fulbright time is now. Like the University of<br />\nwives, mothers, hippies, many intellectuals and, in fact, the majority the most of it. A four year vacation pay. had turned to one of the Senate Pages Whittenbcrg's most celebrated dropat the conclusion of his remarks, and out,<br />\nof Americans who oppose the slaughter of what now amounts to Enjoy.<br />\nwe have every right to be pissed As the University's architecture so marvelled sadly at the base uses to off. \"The time is out of joint. Oh curmore than 200,000 lives. It is sad only in that it is the least expedient subtly suggests, we do And have for which we may return.<br />\nsed spite/That ever I was born to set it<br />\nmeans by which to change governmental policy, and that, after all, years. The lack of student \"involveright.\" Or try.<br />\nis the rationale behind every form of war protest. In other words, it ment\" here is, if not complete, tradiOne solution, of course, may be to<br />\nis the William Fulbrights, not the Tuli Kupferberg, who will bring tional and very nearly legendary. How- effect the installation of fifty small teleJames N. Franke<br /><br />\nDavid S. cooper<br /><br />\nOn The March<br /><br />\nabout an eventual American withdrawal from Vietnam.<br />\nAs far as Johnson and his associates are concerned, the whole<br />\nquestion centers on whether Vietnam is or is not in our \"vital national interest,\" as Dean Rusk so impassionately said last week. Indeed,<br />\none can make a strong point that as far as governments operate, such<br />\ncommonplace matters as deaths and costs cannot become a major<br />\nBy SETH FELDMAN<br />\nconsideration. We deplore this fact, but alas, we must contend with<br />\nToday is Friday but as far as Satur\"Sirs: My boy wrote me this from<br />\n\"In the war itself today marines<br />\nit.<br />\nday is concerned it might as well be where he is stationed in DaNang in Viet- continued their cleanup operations<br />\nMonday - - for the monster-country nam.I think some of these peace people south of the DMZ. These films taken<br />\nIn 1964, the large majority of the American people believed that yawns in preparation for another peace might be interested in hearing what a Monday show the marines overrunning<br />\nVietnam was in our national interest, and our Washington legislators march, is pallid. The scene is painted in real man has to say: John was killed on a Vienamese stronghold near Con Thien.<br />\na patrol today. That a living, breathing Ninety two Vietcong, like the one<br />\nsymbolically agreed by signing the Tonkin Gulf Resolution. Today, lousy bland.<br />\nA light bulb is the simplest of med- person is dead, that \"is\" is \"was\" and shown here, were found killed by the<br />\nas a recent poll of senators and representatives showed last week, the<br />\ndia. The weekly news magazine editor in totally so, that \"has\" is \"Lost\" is incre- extensive saturation bombing.\"<br />\nmood has changed and people are beginning to realize that our vital his office turns off the room lights and dible, unthinkable, unknowable-axioms<br />\n\"The bombing is causing them pain.\"<br />\ninterest in Vietnam,even if existing at all, is not worth the thousands puts next week's issue to bed. He types ioms of illogic, not true paradoxes but<br />\n\"and we've already been able to<br />\nof deaths, the billions of dollars and the political lieing and hypo- his last sentences by the illumination of paradoxes of truth. How to understand drop more tons of bombs on North<br />\nthis august blackness that shares reality Vietnam than the Nazis were able to<br />\ncrisy which is so much a reality now. Perhaps if there was hope of his desk light alone.<br />\nis the most valuable if with the plastic trivialities.'\"ect. cct. drop on all of Britian during their air<br />\npeaceful compromise two months away we could justify the cost to notInformation<br />\na Bhuddist nun died effort in World War IL\"<br />\nthe only commodity.The most sucourselves, but there is no such hope, not even within two years.<br />\ncessful man is the man who best adapts from burns after a dramatic cct.<br />\n\"and the Harris polls indicate that<br /><br />\nI The Word Is The Media I<br /><br />\n,<br /><br />\nWith such considerations being brought more and more before the<br />\nAmerican public, and with such respected and tried theoreticians as<br />\nTed Sorenson,William Fulbright and James Reston making clear and<br />\nundeniable refutations of,Rusk's repeated defenses of the war, it becomes clear that our \"vital interest\" is but a pawn, by moving which<br />\nJohnson believes he will find his way into the forefront of some future history book.<br />\nTomorrow's march will enable every Hopkins student and faculty'<br />\nmember to speak out in his own small way against the prolongation<br />\nof the war. It is all that most of us can do, but it is a lot.<br /><br />\nUncle Tom's Cabin<br />\nLast time it was Victor the Barber, this time it is Dottie the Hair<br />\nDresser. Dottie refused to dispense her services to the wife of a Hopkins graduate student, a Negro.<br />\nIt will be interesting to watch the behavior of Victor Dates, the<br />\nsole Negro in the administrastion,and Wesley Taylor, the plant Mana<br />\nger who holds the contract of Dottie's Bradford Beauty Salon.<br />\nTo avoid a protest, the administration plans to let things be until<br />\nDottie's contract runs out in December. This kind of arrangement<br />\nwould show everyone's true color - mostly white. We are for beauty<br />\nregardless of race, color, or creed, and right now.<br />\n\"There are two kinds of nigger: my kind of nigger, and a house<br />\nnigger,\" The Reverand James Bevel once said. Let us hope that Hopkins is not full of house niggers.<br /><br />\n\"'I didn't say that all of them are the country is disturbed.\"<br />\nhimself processor of information. This<br />\nadaption takes place through the media. subsersives. Just the people who organThen he turned off even his desk<br />\n\"All counted,\" the editor types, ized the thing. The rest are dupes.'\" light and put on his jacket in the dark\"'The press is free but it must live ness to leave.<br />\n\"reliable figures provided by the Washington police indicate approximately, up to its responsibilities. To be frank<br />\n\"One by one the lights go out all<br />\nxx,xxN participated in the march des- with you, I really don't sec the value in over the world.\"<br />\npite claims by the organizers that it this sort of derogatory reporting.'<br />\nThucydides realized 2300 years ago<br />\ndre,w no less than xxx,xxx.\" Return<br />\n\"'Senator, If I had an opinion that (though only monthes later when he<br />\ncarriage. 30-30-30. He shuffles through was detrimental to the well being of my read a scroll carried overland by horsethe copy on his desk.<br />\ncountry, I would surpress it.'\"<br />\nback) - - the fleet has left and it will<br />\nThe speed of electronic media has<br />\nThe Editor answers his phone. The never return.<br />\nshrunken civilization to the point where dark room: \"We've got the pictures<br />\nman lives in tribal society not seen in compiled for the march article. Bernie<br />\nthe West since the time of the ancient went to DC today and got some shots<br />\nGreek city states.<br />\nof Frank and Sandra (you know, our<br />\nHard of Darkness<br />\n\"President Johnson was not avail- staff degenerates) in front of the monuTo The Editors:<br />\nable for direct comment on the march. ment and near the Pentagon. We've dug<br />\nHowever a statement read by Press Se- up some pictures of the crowds that<br />\nAfter reading your hard-hitting edicretary Moyers quoted the President as came down for the civil rights march in torial in the last Newsletter, I thought<br />\nbeing 'proud that we live in a country '63 and when Kennedy was shot. If all my friends might like a few words<br />\nwhere every citizen can express his there's a riot we can always yank them from us heartless war-mongers to mull<br />\nviews about the issues of the times. We and use the pictures from Detroit, New- over on the way down to Washington<br />\nonly hope that through our commit- ark, Cleveland, Watts<br />\ntomorrow.<br />\nment in Southeast Asia we can assure<br />\nHe turns on his radio.<br />\n1) Do you seriously believe that LBJ<br />\nthe peoples of that unfortunate part of<br />\n\"We have to fight them there or is some sort of blood-drinking monster?<br />\nthe world that they too will be able to we'll have to fight them in the streets of If so, arc you so sure he is corrupting<br />\ncontinue to enjoy the liberties that we our cities. And we will fight them there innocent American youth? I might rehold so precious.\"<br />\nand we will win. Americans tend to for- mind you of some of the atrocities<br />\n\"xx students were reported injured, get that word \"win\". This country has fresh-faced American boys have comxx killed in riots apparently touched never lost a war and as long as I'm in mitted long before there was an LBJ or<br />\noff by radical Bhuddist elements and command<br />\nVietnam war-hazing of frat pledges is a<br />\nsupporters of jailed ex-candidate<br />\n\"Were a slight rise from last week. mild example. On the other end of the<br />\nTroung Dinh Dzu.\"<br />\nTotal losses in Vietnam now stand at spectrum lie such folk arts as mugging<br />\n\"I only wish some of them demon- xxx,xxx killed, xxx,xxx wounded and old ladies and mass muffler. Perhpas it<br />\nis some of these customs, picked up in<br />\nstrators could come on over here and xxxx missing in action.\"<br />\ncivilian life, that are producing the atrosee what its like.' Sgt<br />\nand the television<br />\nis the holder of the Distinguished<br />\n\"what more is there to lose before city stories from Vietnam.<br />\nand x Purple Hearts. we win?'<br />\n(Continued to Page 5)<br /><br />\nI Correspondence<br /><br />\n1<br /><br />\nHOMEWOOD,BALTIMORE,OCTOBER 20, 1967<br /><br />\nNEWS-LETTER<br /><br />\nPAGE FIVE<br /><br />\nRealist Krassner Comes to Town<br />\nEditors' note: the following wisdom<br />\nNewsletter: Do you think that there a festering sore, but the rest of the rash<br />\nwas dispensed by Paul Krassner, editor is going to be an administration crackNewsletter: What's wrong with LBJ? man history when you have to find<br />\nis still there.<br />\nof the Realist underground magazine down as there has been sometimes in<br />\nKrassner: What's wrong with LBJ is other ways to deal with your aggressNewsletter: What about the \"hippy\"<br />\nand frequent contributor to Ramparts, the past?<br />\npeople in the peace movement? Do you just an intensifications of what's wrong ion. sure you have to make decisions<br />\nin a recent conversation.<br />\nKrassner: I don't think there has see some kind of overturning of the es- with anybordy whose actions I consider but I do believe he is using the Vietnam<br />\nbeen a crackdown. There's been criti- tablishment? Will these groups get any- inhumane and that's the capacity to War as a political lever. When you do<br />\nNewsletter: There has been a lot of<br />\ncism of it, but not a crackdown.<br />\nmake abstractions of human beings so that you make non-entities of human<br />\nwhere?<br />\ntalk about violence and a lot of people<br />\nNewsletter: Rusk's recent statements<br />\nKrassner: The most important thing that the body count in Vietnam is just beings, both Americans and Vietnahave been worried about the march this<br />\nabout the hippy subculture is that in a an extension of say, an automobile mese, who are dying in order that he<br />\nSaturday. Do you think that this is in on dessent and its stupidity?<br />\nKrassner: The only way that there democracy, they have the right to do manufacturer who would rather make can use them as a strategic thing to get<br />\naccord with a peace movement, and is<br />\nsales than consider safety. What is speci- elected again.<br />\ncan be a crackdown is if war is legally what they're doing. Nobody will force<br />\nthis necessary for the movement?<br />\nfically wrong with Lyndon Johnson is,<br />\nNewsletter: Is this what you are tryKrassner: I'm very worried about declared, in which case they can trans- them to work if they're not working,<br />\nnobody will force them to get haircuts. to my way of thinking, the exercise of ng to say in the Realist?<br />\nviolence too, and I hope that the Police late dissent as treason.<br />\npower without compassion.<br />\nKrassner: Yes it's one of the things<br />\nand the National Guard will keep themNewsletter: What about the whole They've become so frustrated with the<br />\nNewsletter: Aren't your views miti- hat is talked about.<br />\nselves in check.<br />\nVietnam situation. Do you think that standard forms of protest rebellion that<br />\ngated sometimes when you look at his<br />\nNewsletter: Do you still envision ci- this is just a new quirk in American for- they're trying to live alternative instead<br />\nposition and when ybu look at past<br />\nof<br />\nchanging<br />\nthe<br />\nold<br />\nthing.<br />\nNow<br />\nby<br />\nlivvil disobedience as a non-violent move- eign policy or have we been imperialising an alternative, they are, in effect, presidents? It is a position of power to<br />\ntic?<br />\nment?<br />\nchanging it to that extent that they are run a country without compassion.<br />\nKrassner: Oh sure. I was in Los AnKrassner: I think it's part of the no<br />\nlonger part of it.<br />\nKrassner: There comes a time in hugeles where the fifteen hundred police whole logical evolution or illogical evolrioted, and every demonstration that ution. I was in Cuba in 1959-60 and<br />\nI've been in where there has been vio- there were American anti-aircraft guns<br />\nlence has been instigated by the police. on the roof of the hotel where I was<br />\nI think it has been a tactical measure to and I heard the phrase, \"America is a<br />\nscare people away. Although it seems comic opera\" and I kept saying,\"We're<br />\nlike random violence. I think it is a de- not going to attack you\" and they had<br />\nliberate tactic. Now people are getting to remind me of Gautamala. And then (Continued from Page 4)<br />\nwith your anti-war efforts, Nice Man<br />\nso frustrated that nobody, even the of course there's the Dominican RepubHo may just be glad to hear from you.<br />\nopposition?<br />\nWhat<br />\nabout<br />\n2)<br />\nTwo<br />\nthe<br />\nnon-violent people on the Mobilization lic. I can't even begin to list the num3) If you have any more time, open<br />\nCommittee, can say that we can't pre- ber of countries that we are involved in. wrongs may not make a right, but two your Red<br />\nBook to the part where Chairdict, with all the anger and frustration Vietnam is getting the most publicity rights are surely better than one,so why man<br />\nMao says, \"Political power grows<br />\nabout the war, what people are going to but we are involved in one act after not write a nice litter to Ho,asking him out of the<br />\nbarrel of a gun.\" Perhaps<br />\ndo. But the official policy is absolutely another. It's like a rash and all of a sud- to please stop drafting 14-year-olds,and here<br />\nwe have found a point on which<br />\nhaving his agents throw grenades into<br />\nnon-violent.<br />\nden one bit of the rash breaks out into<br />\ncrowds of those same innocent people both sides can agree, and around which<br />\nwho hate the Americans so much. If negotiations can begin. After all, even<br />\nthat does not work, perhaps you can such neutral observers as Stokeley Carsend a committee of protest to Hanoi, michael would endorse this statement.<br />\nSo have a nice trip tomorrow. But<br />\nGRADUATE SCHOOL INTERVIEWS - SENIORS<br />\nor start corresponding with anti-War<br />\ngroups in North Vietnam. After all, if don't be too upset if LBJ doesn't come<br />\nThursday, October 26 — COLUMBIA LAW SCHOOL<br />\nThursday, October 26 — VANDERBILT LAW SCHOOL<br />\nsuch a monster as LBJ doesn't interfere around.<br />\nWednesday, November 1 — GEORGE WASHINGTON UNIV<br />\nJoseph Brophy<br />\nLAW SCHOOL<br />\nFriday, November 17 — SYRACUSE UNIV LAW SCHOOL<br />\nitic's rugged pair of<br />\nWednesday, November 29 — NORTHWESTERN UNIV S<br />\nstick pens wins again im<br />\nSCHOOL OF LAW<br />\nunending war against<br />\nMonday, December 4 — UNIV OF CHICAGO<br />\nball-point skip, clog and<br />\nBUSINESS SCHOOL<br />\nsmear. Dfspite horrible<br />\nCONTACT PLACEMENT BUREAU, 100 WHITEHEAD HALL TO<br />\nARRANGE FOR INTERVIEWS<br />\npunishment by mad<br />\nscientists, BIC still writes<br />\nfirst time, every time.<br />\nCONTACT PLACEMENT BUREAU, 100 WHITEHEAD HALL TO ARAnd no wonder. BIC<br />\nRANGE FOR INTERVIEWS<br />\n'<br />\nS<br />\n\"Dyamite\" Ball is the<br />\nEXAMINATION DATES (Federal Government, Dept. of State, etc.)<br />\nhardest metal made,<br />\nFor foreign service careers with Dept. of State and USIA file<br />\nencased in a solid brass<br />\napplication by October 21 to take test on December 2, 1967.<br />\nnose cone. Will not skip,<br />\nGraduate students and seniors in non-science fields who are<br />\nclog or smear no matter<br />\ninterested in government careers should take Federal Service<br />\nwhat devilish abuse is<br />\nEntrance Exams early in academic year. Exams are given<br />\nGOOF'<br />\ndevised for them by<br />\nmonthly through May.<br />\nsadistic students. Get<br />\nAPPLICATIONS FOR ABOVE EXAMS ARE AVAILABLE IN PLACEMENT<br />\nWith Eaton's Corrasable Bond Typewriter Paper, you<br />\nthe dynamic inc Duo at<br />\nBUREAU, 100 WHITEHEAD HALL<br />\nyour campus store now.<br />\ncan erase that goof without a trace.<br />\nGraduate students and seniors ( planning to go to grad school) in<br />\nengineering, math, physics and chemistry who are interested in<br />\n•.<br />\nNot a telltale smudge remains. A special surface persummer employment should register at Placement Bureau.<br /><br />\nI Correspondence<br /><br />\nI<br /><br />\nDespite<br />\nfiendish torture<br />\ndynamic BiC Duo<br />\nwrites first time,<br />\nevery time!<br /><br />\nPLACEMENT BUREAU ANNOUNCES<br /><br />\nAnyone can<br /><br />\nSeniors who have not received August letter from Placement Bureau<br />\nand those who have received letter, but have not responded, should<br />\ncontact Placement Bureau as soon as possible.<br /><br />\n17e<br />\nhicA/ to catch<br />\n?he RoadRuanetisatyoutP4//notithZa/etc.<br /><br />\nmits quick and easy erasing with an ordinary pencil<br />\neraser. For perfect papers every time, get Corrasable.<br />\nIn light, medium, heavy weights and Onion Skin. In<br />\nhandy 100-sheet packets and 500-sheet ream boxes.<br />\nAt Stationer:, Departments.<br /><br />\n!EATON'S CORRASABLE<br />\n/TYPEWRITER<br />\nPAPER<br /><br />\nOnly Eaton makes Corr5sable:°<br />\nEATON PAPER CORPORATION, PITTSFIELD, MASSACHUSE FTS<br /><br />\navailable at<br /><br />\nTHE JOHNS HOPKINS BOOK CENTER<br /><br />\nAll Types of Subs<br />\nSnacks — Beer<br />\nOPEN TILL '1:00<br />\n7 DAYS A WEEK<br /><br />\noew Ryffloath RoadRunner<br />\nnow at you.'Plymouth Pe.Ver:s<br />\nwhere the 4)&amp;7t.96es- 0/7<br /><br />\nB &amp; M SUB SHOP<br />\n31st &amp; GUILFORD<br /><br />\nWATERMAN-BIC PEN CORP.<br />\nMILFORD, CONN.<br /><br />\nBiC Medium Point 19C<br /><br />\nV BiC Fine Point 29C<br /><br />\nBic Pens On Sale At:<br /><br />\nJOHNS HOPKINS<br />\nBOOK CENTER<br />\n\"No Free Marijuana. no: Fa'<br />\ner Groppi, no clashes with police, and of course no national<br />\nheadlines. the occasion, an orderly parade in honor and support of our troops in Vietanm:<br />\nthe place, Cincinnati; the inspirers, an ad hoc Committee<br />\nfor Action by Teens. The<br />\nMayor was on the reviewing<br />\nstand, the Cincinnati Enquirer<br />\nendorsed the event, and a nice<br />\ncrowd of unsponsored teenagers turned<br />\nFor • hoe (fly<br />\nout. The rent-aof the unroof is.1 NATIONAL<br />\ncrowds stayed<br />\nREVIEW, writs to<br />\naway.\"<br /><br />\nDept. (P-1, 150 I.<br />\n35 S.... N.Y 11, N Y.<br /><br />\nI<br /><br />\nHOMEWOOD, BALTIMORE,OCTOBER 20, 1967<br /><br />\nNEWS-LETTER<br /><br />\nPAGE SIX<br /><br />\nClassified<br /><br />\nH<br /><br />\nRENT FREE - - Private tenant house<br />\nLUNCH - I hate cooking and dishwash- in Green Spring Valley, 20 minutes<br />\nI<br />\n—<br />\nmeals<br />\nd<br />\ning but, I love home-cooke<br />\nfrom J.H.U. Suitable for two or three<br />\nwill pay reasonably for Dinners and/or graduate students. Five rooms, screened<br />\nLunches. Call 235-9602 or Box 664.<br />\nporch, outstandingly beautiful view. No<br />\nrent to pay - instead work a few hours<br />\nFOR SALE - - Rambler '59, mileage per week on grounds, etc. (For past 6<br />\n25,800, good condition, $125. Con- years, various J.H.U. grad students<br />\ntact Mrs. S. Feinblatt, FL 8-6199, on have lived here on this basis) Call Hu<br />\n6-1430.<br />\nMonday.<br /><br />\nCAMPUS NOTES 1<br /><br />\nTOBOR RULES THE WORLD<br />\nThe next program in the Seminar in<br />\nComputer Science is scheduled on October 23, at 4:00 p.m. in Room 3 of<br />\nShaffer Hall. Dr. Lawrence Roberts of<br />\nthe Advanced Research Projects Agency<br />\nin Washington will speak on \"Multiple<br />\nAccess Computer Network.\"<br />\nThe speaker for the following lecture was fired and a computer will take<br /><br />\ntin G. Larrabec, Chairman of the PreMedical recommendations committee<br />\nRED AND BLUE ARMIES MEET will participate in a program about PreThe Johns Hopkins Vietnam Com- Medical Education at Johns Hopkins.<br />\nThe program is sponsored by Alpha<br />\nmittee will hold a general meeting on<br />\nOctober 25, at 7:30 p.m. in Levering Epsilon Delta, the International PreHall. The purpose will be to acquaint Medical Honorary Society and will constudents with the variety of anti-war sist of short talks by Dean Swanson and<br />\nactivities in Baltimore and to discuss Dr. Larrabee to be followed by a quespossible future programs on campus. tion and answer period.<br />\nMedical students from the Johns<br />\nStudents and faculty are invited.<br />\nHopkins School of Medicine will be<br />\npresent to answer questions. The proINTEGRATED TGIF<br />\ngram will take place Monday, Oct. 23,<br />\nA panel will discuss\"Open Housing\" at 8:30 p.m. in Remsen 101. •<br />\nin a seminar sponsored by the Committee. A film, \"No Hiding Place,\" will<br />\nQUARTETTO AND SRO<br />\nbe shown and discussed. The program<br />\nwill be held on Sunday, October 22, at<br />\nThe Quartetto di Roma will open<br />\n2 p.m., at St. Peter's Lutheran Church, the Shriver Hall Concert Series on SunBlvd.<br />\n4215 Loch Raven<br />\n.day at 8:30 p.m. Due to heavy advance<br />\nsales, the entire concert series has been<br />\nsold out for some time. Scats or standLOST IN SPACE<br />\nDr. Carl P. Swanson, Associate Dean ing room may be availabe at the door<br />\nof Undergraduate Studies and Dr. Mar- by checking with the head usher.<br />\nhis place in the interest of efficiency.<br /><br />\nCan you<br />\nmeetthetest?<br />\nHere's everything you need to<br />\nhelp you get a top score in the<br />\ntests you have to pass.<br />\n• Up-to-date test material<br />\n• Best organized study guides<br />\n• Do's and don'ts of test-taking<br />\n• Step-by-step programming<br />\n• Accurate practice tests<br />\n• Correct answers and solutions<br />\n• Self-evaluation profiles<br /><br />\nCOWLES SCORE-HIGH EXAM BOOKS<br />\nHow to Pass<br />\nGRADUATE RECORD EXAMINATION APTITUDE TEST<br />\nwith special Test-Yourself Examination bonus. 444 pages<br />\nHow to Pass<br />\nLAW SCHOOL ADMISSION TEST<br />\nMEDICAL COLLEGE ADMISSION TEST<br />\nDENTAL APTITUDE TEST<br />\nMILLER ANALOGIES TEST<br />\nFEDERAL SERVICE ENTRANCE EXAMINATIONS<br />\nGRADUATE BUSINESS SCHOOL ADMISSION TEST<br />\nNATIONAL TEACHER EXAMINATIONS<br />\nEach $3.95 Paper • Over 300 pages<br /><br />\nRE Advanced Tests also available<br />\nplus<br />\nCOMPUTER PROGRAMMER APTITUDE TESTS $4.95 Paper<br />\nSHORT-CUT SHORTHAND<br />\nLearn Shorthand in 40 Easy Lessons by S. M. Wesley, Ph.D.<br />\n24<br /><br />\nNew<br /><br />\n$3.95 Paper<br /><br />\nAvailable at your campus bookstore<br /><br />\nRapid•Shavelime...<br />\nItsa whole new kid&lt;<br />\nin shavirtg!<br /><br />\nrplip4 COWLES EDUCATION CORPORATION<br />\nLOOK Building / 488 Madison Avenue, New York, New York 10022<br /><br />\navailable at<br /><br />\nTHE JOHNS HOPKINS BOOK CENTER<br /><br />\nRAPIDSHAVE<br /><br />\nRAPI<br />\nSHA RAPIDSHAVE<br /><br />\n\"'S<br /><br />\nHopkins students, new and old, try:<br /><br />\nIpok for the lime-green can<br />\n8.8 30 NYT. ABC-TV<br />\nC01967, Colgote•Palmolive Company See - The Flying Nun,- Thursday evenings.<br /><br />\nLC.LA.<br /><br />\n•<br />\nLIME, REGULAR<br />\nAND MENTHOL<br /><br />\nAVAILABLE AT THE GREEN WAY PHARMACY<br />\n34th St. and Charles<br />\nAmor<br /><br />\nPecora's Restaurant<br />\nfor the finest Italian food in town<br /><br />\n3320 Greenmount Ave.<br />\nSPAGHETTI MEALS<br />\nPIZZA PIE A SPECIALTY<br /><br />\nCARRY OUT SERVICE<br />\nCALL 889-3831<br /><br />\nHOMEWOOD,BALTIMORE,OCTOBER 20, 1967<br /><br />\nNEWS-LETTER<br /><br />\nGridders Try For Fourth Win<br />\n(Continued from Page 8)<br />\nfor outstanding Hopkins back and line- compliments to the performance of his<br />\nman defensive halfback Charley Coker offensive line-especially end Walt Sien(two interceptions) and linebacker Den- kiewicz, who he noted, was improving<br />\nny Ferrazzano, bear out the extent of rapidly and had contributed several key<br />\nstaff pleasure with this inexperienced blocks on Saturday.<br />\nbut clearly fast-jelling unit.<br />\nCowan, who now has nine touchLIVE A LITTLE<br />\ndowns in three games, ran his scoring<br />\nHey, people! Stop sitting in your<br />\ntotal to 50 points by making five of sweaty little rooms checking<br />\nover your<br />\neight conversion tries (he also averaged roomie's chem homework<br />\nand worrying<br />\n42.1 yards per punt). A Saturday soc- about tomorrow! Come on down<br />\nto the<br />\ncer match kept regular kicker Wes Ba- spacious News-Letter office and join up<br />\nchur away from grid action, and, since with our meagre but stimulating copy<br />\nthe soccer and football schedules con- staff. And help us all worry about<br />\ntoflict in every instance from now on, the morrow. Pay's not too good,<br />\nbut fringe<br />\n5-9, 160 pound senior's future availia- benefits<br />\nare substantial(you get to hear<br />\nbility is in some doubt.<br />\nKoper crack up at midnight) and the<br />\nHead Coach Alex Sotir also paid atmosphere's unbeatable. Hurry, and be<br />\nnext in line for Copy Editor!<br /><br />\nADVERTISED ON<br />\nRADIO STATION<br /><br />\nRx Rx Rx Rx Rx Rx Rx Rx<br /><br />\nWJHU<br /><br />\nM<br /><br />\nMedico<br />\nALMA MATER<br /><br />\nPIPES<br /><br />\nLOW RATES FOR<br />\nHOPKINS STUDENTS<br /><br />\nWITH JHU LETTERS<br /><br />\nFOR FURTHER INFORMATION<br /><br />\nCONTACT JOHN ULLMAN<br />\nBUSINESS MGR. WJHU<br />\n235-8619 OR BOX 467<br /><br />\n•<br /><br />\n14<br /><br />\n$<br />\n4<br />\n\"<br /><br />\n$5<br />\n\"<br /><br />\nGreenway Pharmacy<br />\nCharles and 34th Sts.<br /><br />\nRx Rx Rx Rx Rx Rx Rx Rx<br /><br />\nPAGE SEVEN<br /><br />\nThinclads Face Dips Tomorrow<br /><br />\nANCHORS AWEIGH<br /><br />\n(Continued'from Page 8)<br />\nThe Johns Hopkins Sailing Club will<br />\nThe frosh cross country team is anbe meeting October 24 at 7 p.m. in the<br />\nAthletic Center. Racing schedules and xiously awaiting the starting gun of<br />\nassignments to boats will be discussed. their 1967 season Wednesday, October<br />\nAll interested persons should attend. 25 at Bainbridge Prep. They will run a<br />\nthree mile course at home and two miles against their high school opponents.<br /><br />\nThe top position is a three-way battle between Al Wallace, Jim Archibald<br />\nand Matt Polk. Steve Haines, Norm<br />\nPoulson, John Shavel and Steve Myers<br />\nround out the team.<br /><br />\nPREDICTIONS<br /><br />\nHopkins 27<br />\nHopkins 3<br />\nColts 7<br />\nBullets 86<br />\nTexas 32<br /><br />\nRandolph Macon 14<br />\nF&amp;M 2<br />\nVikings 14<br />\nBoston 104<br />\nArkansls 28<br /><br />\nNEW—<br /><br />\nFIND<br />\nSCHOLARSHIPS<br />\nBY COMPUTER<br /><br />\nLast year $30 million in college scholarships went unclaimed — because no<br />\nqualified persons applied . . . because<br />\nno qualified persons knew of them.<br />\n• Now ECS engineers and educators<br />\nhave programmed a high-speed computer with 700,000 items of scholastic<br />\naid, worth over $500 million, to permit<br />\nstudents to easily and quickly locate<br />\nscholarships for which they qualify.<br />\n• The student fills out a detailed, confidential questionnaire and returns it to<br />\nECS, with a one-time computer-processing fee of $15. In seconds the computer compares his qualifications against<br />\nrequirements of grants set up by foundations, business,- civic, fraternal, religious, and government organizations.<br />\nand prints a personalized report to<br />\nthe student telling him where and when<br />\nto apply for grants for which he qualifies. Thousands of these do not depend<br />\non scholastic standing or financial need.<br /><br />\nFREE - - - - - - - - -<br /><br />\nINFORMATION AND SAMPLE QUESTIONNAIRE<br /><br />\nra<br />\nECS<br /><br />\nNORTH AMERICAN EDUCATIONAL ,<br />\nCOMPUTER SERVICES,INC<br />\nP9<br />\n'<br />\nR5<br />\n1:ZE<br />\nS<br />\nT<br />\n'<br />\n,DA<br />\nN,<br />\nME<br />\nER S E Y<br />\n1<br /><br />\nSend<br /><br />\nQuestionnaires<br />\nqty<br /><br />\nname<br />\n(print)<br />\naddress<br /><br />\nzip<br /><br />\nOn Campus paw.<br />\n(By the author of \"Rally Round the Flag,Boys!\",<br />\n\"Dobie Gillis,\" etc.)<br /><br />\nTHERE ARE NO BAD TEACHERS;<br />\nTHERE ARE ONLY BAD STUDENTS<br />\nThe academic year has only just begun and already<br />\none thing is clear: you're not ready for college.<br />\nWhat, then, should you do? Should you throw -up your<br />\nhands and quit? I say no! I say you must attack, grapple,<br />\ncope! I say America did not become the world's leader in<br />\nmotel construction and kidney transplants by running<br />\naway from a fight!<br />\nTo the question then: You say you're not ready for college. You're too green, too naive. You lack maturity.<br />\nOkay, the answer is simple: get mature. How? Well<br />\nsir, to achieve maturity you need two things:<br />\na) a probing mind;<br />\nb) a vest.<br />\nA probing mind will be quickly yours if you'll remember that education consists not of answers but of questions. Blindly accepting information and dumbly<br />\nmemorizing data is high school stuff. In college you don't<br />\njust accept. You dispute, you push, you pry, you challenge. If, for instance, your physics prof says,\"E equals<br />\nmc squared,\" don't just write it down. Say to the prof,<br />\n\"Why?\"<br />\nThis will show him two things:<br />\na) Your mind is a keen, thrusting instrument.<br />\nb) You are in the wrong major.<br />\nAsk questions, questions, and more questions. That is<br />\nthe essence of maturity, the heart and liver of education.<br />\nNothing will more quickly convince the teachers that you<br />\nare of college calibre. And the tougher your questions,<br />\nthe better. Come to class with queries that dart and flash,<br />\nthat make unexpected sallies into uncharted territory.<br />\nAsk things which have never been asked before, like<br />\n\"How tall was Nietzsche?\" and \"Did the Minotaur have<br />\nticks? If so, were they immortal?\" and \"How often did<br />\nPitt the Elder shave?\"<br /><br />\nSTAMP IT!<br />\nIT'S THE RAGE<br /><br />\nStand up and be counted<br />\nin Bass Weejuns!<br /><br />\nREGULAR<br />\nMODEL<br />\nANY $<br /><br />\n3 LINE TEXT<br />\nBe a big number on campus ... ask for Bass<br />\nWeejuns® moccasins at your nearby college store<br />\nor shoe shop. Only Bass makes Weejuns.<br />\nG. Fl. Bass &amp; Co.,<br />\nMain St.,<br />\nWilton, Maine 04294.<br /><br />\nS4447<br /><br />\nThe finest INDESTRUCTIBLE METAL<br />\nPOCKET RUBBER STAMP. /<br />\n1<br />\n2\" x 2\".<br />\nSend check or money order. Be<br />\nsure to include your Zip Code. No<br />\npostage or handling charges. Add<br />\nsales tax.<br />\nPrompt shipment. Satisfaction Guaranteed<br />\nTHN MOPP CO.<br />\nP. 0. Box 16623 Lenox Square Stetter'<br />\nATLANTA, GA., 30326<br /><br />\nSAV-IT<br />\nLIQUORS<br /><br />\nThe Catholic Community<br />\nOn Campus<br /><br />\n329 W.29th St.<br />\nTHE HOUSE OF<br />\nGOOD CHEER<br /><br />\n243-3313<br /><br />\nMASS SCHEDULE:<br />\nSUNDAYS: 10:30 A.M. in Levering<br />\nGreat Hall<br />\nFRIDAYS:<br />\n12:00 Noon in Levering Hall<br />\nChapel (2nd floor)<br />\nConfessions heard before Mass.<br />\n(Mass is said, Monday thru Thursday, at 4:30 P.M. in<br />\nNewman House, 2941 N. Charles)<br /><br />\n* * * * * * * * * * ** * *<br />\nWHERE EVER YOU ARE . . .<br />\nWHERE EVER YOUR GOING<br />\nYOU'VE GOT TO BE GOING<br />\nOUR WAY. WE'RE ALL OVER<br />\nTOWN!<br />\nSubmarines • Pizza<br />\nSpaghetti • Sour Beef<br /><br />\nHARRY LITTLE<br />\nCARRY OUT SHOPS<br /><br />\nYork Road &amp;<br />\nRegester Avenue<br /><br />\nJOHN P. NUGENT, JR. I<br />\nLife &amp; Health<br />\nInsurance<br />\nCompare<br /><br />\n243-7961<br /><br />\nWe need your head in our<br />\nbusiness<br /><br />\nSt Paul Barber Shop<br />\n3120 St. Paul St.<br />\nI<br /><br />\nAcross from Eddies<br /><br />\n25th Near<br />\nGreenmount<br />\n32nd Near<br />\nGreenmount<br />\n** * * * * * * * * * * * *<br /><br />\n(Incidentally, you may never know the complete answer to Pitt the Elder's shaving habits, but of one thing<br />\nyou can be positive: no matter how often he shaved and<br />\nno matter what blades he used, he never enjoyed the<br />\nshaving comfort that you do. I am assuming, of course,<br />\nthat you use Personna Super Stainless Steel Blades, a<br />\nlogical assumption to make when one is addressing college men—which is to say men of perspicacity, discrimination, wit, taste, cognizance, and shrewdness—for<br />\nPersonna is a blade to please the perspicacious, delight<br />\nthe discriminating, win the witty, tickle the tasteful,<br />\ncoddle the cognizer, and shave the shrewd.<br />\n(I bring up Personna Super Stainless Steel Blades because the makers of Personna Super Stainless<br />\nSteel<br />\nBlades pay me to write this column, and they are<br />\ninclined to sulk if I omit to mention their product. I<br />\nwould<br />\nnot like to see them unhappy, the makers of Personn<br />\na,<br />\nfor they are fine ruddy men,fond of morris dancing<br />\nhome brewed root beer, and they make a blade and<br />\nshaves closely and cleanly, nicklessly and hackless that<br />\nis sharp and gleaming and durable and availabl ly, and<br />\ne both in<br />\ndouble-edge style and Injector style.<br />\n(And from these same bounteous blademakers<br />\ncomes<br />\nBurma-Shave, regular or menthol, a lather<br />\nthat<br />\nlathers other lathers, brother. So if you'd rather outbetter, and soak your whiskers wetter, Burma lather<br />\n-Shave's<br />\nyour answer.)<br />\nBut I digress. We have now solved the problem<br />\nof<br />\nmaturity. In subsequent columns we'll take up<br />\nother issues, equally burning. Since 1953 when this column<br />\nfirst<br />\nstarted running in your campus paper,<br />\ntackled<br />\nsuch thorny questions as ,\"Can a student ofwe've<br />\n19 find happiness with an economics professor of 90?\" and<br />\n\"Should<br />\ncapital punishment for pledges be abolished?\" and<br />\n\"Are<br />\nroom-mates sanitary?\" Be assured that in this,<br />\nour 14th<br />\nyear, we will not be less bold.<br />\n* * *<br />\n© 1967, Max Shulman<br />\nThe makers of Personna Super Stainless Steel Blades<br />\n(double-edge or Injector) and Burma-Shave (regula<br />\nr<br />\nor menthol)are pleased(or apprehensive) to bring you<br />\nanother year of Max Shulman's uninhibited, uncensored column.<br /><br />\nNEWS-LETTER<br /><br />\nPAGE EIGHT<br /><br />\nNEWS<br /><br />\nS<br /><br />\nHOMEWOOD,BALTIMORE,OCTOBER 20, 1967<br /><br />\nLETTER<br /><br />\nHeavy Rains Cramp Jays to Risk Unbeaten Streak<br />\nRooters in 1st Loss At Randolph-Macon Saturday<br />\nBy MIKE PHILLIPS<br />\nNow tied for the Southern Division<br />\nFullback Mark Croft (41 yards on<br />\nConverence lead, the<br />\nAfter an opening game victory, the Diplomats sport an 0-3 record this year, Middle Atlantic<br />\nnine<br />\ncarries), making his first start of<br />\nteam<br />\nfootball<br />\nvarsity<br />\nthe<br />\nunbeaten<br />\nJay soccer contingent dropped a close and the Jays lost to them 1-0 last year.<br />\ngot the fourth Hopkins tally<br />\nthe<br />\nseason,<br />\nfor<br />\nopposition<br />\ncontest to Swarthmore last Saturday by F&amp;M's full offensive back field returnee should get some capable<br />\non a one yard plunge, and FEely again<br />\nin two games tomorrow<br />\ntime<br />\nfirst<br />\nthe<br />\ndetheir<br />\nof<br />\nmost<br />\nlost<br />\nthey<br />\nbut<br />\nyear<br />\nthis<br />\na4-3 tally.<br />\nhit Cowan - this time on a swing pass<br />\ntough Randolph-Macon<br />\nThe rain-soaked Swarthmore field fense. The Jay kickers will perform at when it faces a<br />\nstretched into a 52 yard - to round out<br />\nAshville,<br />\nat<br />\nclash<br />\nnon-league<br />\na<br />\nin<br />\nclub<br />\ncontests<br />\nwas the scene of an exciting, ping-pong home for three consecutive<br />\nthe second period scoring.<br />\ntype game in which the lead changed next week. Gettysburg and Loyola are Virginia.<br />\nAfter Feely made the count 40-0 on<br />\nyear,<br />\nthe<br />\non<br />\n3-1<br />\nJackets,<br />\nYellow<br />\nThe<br />\nThursday<br />\nand<br />\nTuesday<br />\nfor<br />\nscheduled<br />\nfirst<br />\nthe<br />\nin<br />\nEarly<br />\ntimes.<br />\nseveral<br />\nhands<br />\na one yard sneak, Cowan went on the<br />\n20<br />\nyielded<br />\nand<br />\npoints<br />\n101<br />\nscored<br />\nhave<br />\nfor<br />\nslated<br />\nis<br />\nLynchburg<br />\nrespectively.<br />\nbeautiful<br />\nquarter, Art Guerin netted a<br />\nloose twice more, running 43 yards<br />\nin wins over Millersville (Pa.), Millsaps,<br />\nscore in the lower left hand corner of Saturday at 2:00 p.m.<br />\nfrom scrimmage for a third quarter<br />\nWashto<br />\nfalling<br />\nwhile<br />\nBridgewater,<br />\nand<br />\nthe goal. The Jays held onto a 1-0 lead<br />\nscore and coming off the bench to move<br />\nington and Lee by 13-12. Hopkins<br />\nuntil the last ten seconds of the half.<br />\n27 yards to another in the final minscouting reports portray them as solid<br />\nutes. These two runs pushed the 5-10<br />\nin all departments, and put special emSwarthmore Scores<br />\n175 pound junior's game rushing mark<br />\nphasis on the quality of their offensive<br />\n113 yards on seven carries, while<br />\nto<br />\nSwarthmore then took advantage of<br />\nbackfield.<br />\nWeiss provided the largest share of the<br />\nan indirect free kick just outside the<br />\nFollowing tomorrow's encounter team's 34 yard total with 138 on eight<br />\nHopkins: penalty area. On what would<br />\nwhich, unlike the last two, should habitrips.<br />\nhave been the equivalent of a fumble in<br />\ntuate Hopkins to the difficulties of crufootball, Hopkins' Mike Avery and<br />\nHomeThe<br />\ncome.<br />\nto<br />\nclashes<br />\ncial M.A.C.<br />\nDefense Better<br />\nDave Rockwell crashed into Rosenbaum<br />\nwood squad gets a week's layoff before<br />\nof Swarthmore who received credit for<br />\nThe defense - which held Haverford<br />\nBy RICH HOLLANDER<br />\ngets a week's layoff before meeting<br />\nthe goal. The score stood 1-1 at the end<br />\nAfter splitting their first two meets loop foes Swarthmore, Dickinson, and and quarterback Jim Feely - who com- to seven first downs, 123 yards rushing<br />\nof the first half.<br />\nthe varsity cross country team is ready Western Maryland. The former, a 23-30 pleted eight of eleven passes for 21 (49 of these on a long scoring play<br />\nIn the middle of the third quarter to open its home season Saturday winner over Franklin and Marshall(beat- yards and three T.D.'s on the day - hit against Jay reserves), and 22 yards passSwarthmore stayed a fast break and against the Diplomats of Franklin and en 19-14 Hopkins), has lost only to Steve Latson and Cowan on forty and ing on three completions in 24 attempts<br />\nwere fouled at the edge of the penalty Marshall.<br />\nSouthern Division co-leader Delaware thirty yard scoring strikes before the - played what was probably its best<br />\narea. A penalty shot was awarded to<br />\ngame of the year. The coaches' choices<br />\nhas defeated end of the first period.<br />\nThe Hopkins thinclads breezed to a Valley; while Dickinson<br />\nthem, and Rosenbaum scored again<br />\nHaverford 34-14 and fallen to F&amp;M by<br />\n(Continued on Page 7)<br />\nCharles<br />\ntheir<br />\nof<br />\nconquest<br />\n34<br />\nto<br />\n23<br />\nmaking the tally 2-1. Later Avery ran<br />\n22-8 count.<br />\ntook<br />\nLauren<br />\nJeff<br />\nLoyola.<br />\nrivals,<br />\nafter a twenty yard shot from his posi- Street<br />\nAnother Rout<br />\nplace honors completing the four<br />\ntion at goal when John Chisham, failed first<br />\nbehind<br />\nStriding<br />\nJeff,<br />\nJoe Cowan again led the<br />\n23.12.<br />\nin<br />\nWingback<br />\ntour<br />\nmile<br />\nto hear his call to back him up. The<br />\nCliff Cyr placed a way last Saturday, scoring four touchball was accidentally deflected into the senior co-captain<br />\ndowns while Hopkins pushed its season<br />\nstrong second.<br />\ngoal advancing the score to 3-1.<br />\nand league record to 3-0 with a 53-6<br />\nLoyola managed to sandwich in two<br />\nrout of winless Haverford. The contest<br />\nrunners as the Jays took fifth, sixth,<br />\nwas similar in pattern to the previous<br />\nHopkins Rallies<br />\nand seventh place. Coach Don Masken<br />\nweek's 43-0 conquest of Ursinus, as the<br />\n\"It<br />\ncommented<br />\nan<br />\nas<br />\nvictory<br />\nBarrette<br />\nsoaked<br />\nCoach<br />\nviewed this rain<br />\nrushed off to 33-0 halftime lead,<br />\nJ<br />\nJays<br />\nwould have been easy to quit then and \"outstanding team effort,\" since there<br />\nsubs go much of the final<br />\nlet<br />\nand<br />\nthere with three lucky goals for the was less than one minute between the<br />\nthirty minutes.<br />\nopposition, but the team refused to Hopkins quintet,<br />\nHalfback Paul Weiss's forty yard<br />\ngive up.\" With twelve minutes left in<br />\nLast Saturday the harriers ventured touchdown spirit got the team started<br />\nthe fourth quarter, WEs Bachur broke<br />\nup to Philadelphia for a triangular conaway for an unassisted goal. Seven minwith Drexel and Haverford. An<br />\ntest<br />\nutes later, Guerin beat a fullback to a<br />\nHaverford squard swept<br />\noverpowering<br />\nsideline pass, crossed the ball six feet<br />\nthe first four places and crushed HopIn the past weeks, the Newsletter<br />\noff the ground, and Charlie Sarau headkins 17 to 43.<br />\nhas been threatened with near-extinced the ball into the goal for a 3-3 tie.<br />\nCliff Cyr ran a game fifth ahead of tion by the concerted efforts of, not<br />\nWith two and one-half minutes to go<br />\nPeter zeros in on \"A Whiter Shade<br />\nand the ball just outside our penalty any Drexel runner. Yet this did not suf- Administration or angered students,<br />\nPale,\"\"Ding Dong!The Witch Is<br />\nof<br />\nprinters.<br />\nits<br />\nbut<br />\npostarea, Rockwell's leg cramped. Goalie fice as the home town contingent<br />\nDue to the worsening situation, the<br />\nDead,\"\"Up-Up and Away,\"\"Alfie,\"<br />\nAvery tried to rush the Swarthmore ed a 25 to 34 victory over the Jays. Conplayer when he saw that Rockwell had solation, or rather rationalization, may Newsletter was planning to hire scribes<br />\nand \"Somethin'Stupid,\"—and his<br />\nbe attributed to the psychologically de- from local monasteries to do the paper<br />\nfallen but the ball was tipped in.<br />\nbeat and sound are right on target.<br />\nprowas<br />\nhowever,<br />\nCost,<br />\nlonghand.<br />\nin<br />\naband<br />\nthe<br />\nmanding five mile course<br />\nhibitive.<br />\nPeter's also included tunes from hit<br />\nsence of pace setting Jeff Lauren.<br />\nIn a stroke of luck, a new printer<br />\nF&amp;M Next<br />\nBroadway shows and two original<br />\nhas been found. However, readers are<br />\nThe squad faces Franklin and Mar(Continued on Page 7)<br />\nin an album that delivers<br />\nsongs<br />\nunNewsletter<br />\nthe<br />\nwith<br />\nbear<br />\nto<br />\nasked<br />\nshall next Saturday at 2 p.m. away. The<br />\ntil technical difficulties are ironed out.<br />\nsolid entertainment from the first<br />\nBy BOB HYAMS<br /><br />\nThinclads Battle<br />\nDips Tomorrow<br /><br />\nTragic Story<br /><br />\nPETER<br />\nNERO<br />\nINGS<br />\nHITs<br /><br />\nnote to the closing chord.<br /><br />\nRCA VICTOR<br />\n0<br />\nThe most trusted name in sound<br /><br />\not My Eye On The Man._<br />\nVAN' H<br /><br />\nLiamr.r<br /><br />\n417\" VANOPRESS SHIRT<br />\nOne look and wham! I knew he was for me.<br />\nLean and limber and all man in the terrific<br />\nfit of his Van Heusen \"417\" Vanopress<br />\nshirt. Made with the authentic button-down<br />\ncollar, this shirt was permanently pressed<br />\nthe day it was made and will never need<br />\npressing again. No more laundry bills!<br />\nAs for the great new Van Heusen fabrics,<br />\ncolors and patterns . they make him<br />\nthe guy to keep an eye on!<br /><br />\nBuild up your following with Passport 360,<br />\nthe influential line of men's toiletries by Van Heusen<br /><br />\nkir<br />\nan<br />\nsci<br />\nnil<br />\nor<br />\nthe<br />\nto<br />\nInc<br />\ngoi<br /><br />\ntha<br />\nthe<br />\na pi<br />\nistr<br />\nPor<br /><br />\nhea<br />\ned<br />\ndid<br />\nwa5.<br /><br />\nhot,<br />\ncon<br />\nbed<br />\ndou<br />\nspe,<br /><br />\nday<br />\nfin(<br /><br />\nthrt<br />\nity<br /><br />\nday<br />\nat ;<br />\ntest<br />\nabo<br />\nare<br />\nbes<br />\nYot,<br />\ndor<br /><br />\nthe<br />\nPto<br />\nalot<br /><br />"}], "field_media_file": [{"target_id": 40244, "display": null, "description": null, "target_type": "file", "target_uuid": "9d5fca30-83ee-42e3-b8b9-b2903c46de99", "url": "http://digital.library.jhu.edu/system/files/2022-03/13936-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13936, "target_type": "node", "target_uuid": "10d529e4-e18c-4892-b298-ea7bd9d508d3", "url": "/node/13936"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "bf12f4cc-a5c0-4997-bdc7-f59764bb78fb"}]}