{"mid": [{"value": 35658}], "uuid": [{"value": "24e3b170-289b-4c0a-b0b9-153d6952be77"}], "vid": [{"value": 35658}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:10:44+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12200-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:10:44+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:10:44+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol. VI. No. 9<br />\n<br />\nFEBRUARY 12, 1902.<br />\n<br />\n\fJOHNS HOPKINS UNIVERSITY.<br />\n<br />\nTile J01111$ Hopkins Press.<br />\n<br />\nSIALTIMORI.<br />\n<br />\n.11•1110.11.0<br />\n<br />\nT.<br />\n<br />\nTwenty-410A fear.<br />\n<br />\nBeginning October 1st, 1901.<br />\n<br />\nPresident,<br />\n•<br />\n•<br />\n•<br />\nDean of the Medical School,<br />\n.<br />\nDm» of the OoMug.<br />\n<br />\nIRA fiRMSEN.<br />\nWM.II. HOWELL.<br />\nROW. H. ORIYFIN.<br />\n<br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(11) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.; coureds for physicians.)<br />\nFor Undergraduates:<br />\n(e) As oandidates for the degree of 11. A.<br />\n(d) As special students.<br />\n<br />\nLibraries of Baltimore.<br />\nUniversity<br />\n.<br />\nPeabody institute<br />\nPratt Library<br />\n<br />\n100,000 volumes.<br />\n135,010 volumes.<br />\n..:00.000 volumes.<br />\n<br />\nLaboratories.<br />\nchemistry,<br />\nPhysics,<br />\nfleology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,:<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nDirectors.<br />\nhn Bentsen.<br />\nJoseph S. Ames.<br />\niVWLeens H. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam ester.<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith. Maurice Bloomfield<br />\nPaul Haupt.<br />\nlienry Wood.<br />\nA. Marshall. Elliott.<br />\nJaniem 11'. Bright.<br />\nJ. M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\n<br />\nAsiorlom Jouraal of IllaIlionsatloa.<br />\nP. MORLEY,Editor. Quarterly.Ito. Volume XXIV<br />\nin progress. IS per rolumo.<br />\nII. American Chemical Journal.<br />\nI. REUBEN, Editor. Monthly. lye. Volume XXVI<br />\nin progress. $5 per volume.<br />\nHI. American Journal of Philology.<br />\nB. L. GILDERSLREVR, Editor. Quarterly. live.<br />\nVolume XXII in progress. $3 per volume.<br />\nTV. Studies from the Biological Laboratory. 8vo.<br />\nVolume V complete. $6 per volume.<br />\nV. Studies in historical and Political Science.<br />\nMonthly. 8vo. Series XIX in progress. $8 per<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. lto. Vol. XX in progress. Si per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly. Pe.<br />\nVolume XII in progrem $1 per year.<br />\nVIII.Johns Hopkins Hospital Reports. 4to. Volume X<br />\nin progress. $6 per volume.<br />\nIX. Contributions to Assyrtology and Comparative<br />\nSemitic Philology,(ileitrage zur Asmyriologie,etc.)<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.$7.00<br />\nper volume.<br />\nXI. Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVI in progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Hi-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity,<br />\nHENRY M. HUR D, Editor. Quarterly. Ito.,$5 per<br />\nvolume.<br />\nXTV. Reports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK,Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric, Kleetrleity.<br />\nL. A. BAITER, Editor. Quarterly.<br />\nEivo. Volume VI in progress. $2.60 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Truetees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br />\n<br />\nGroups.<br />\nClassical the \"Old College Course.\")<br />\nit Mathematical(leading up to Engineering.)<br />\nS. (hemical-Ili()Ii gieal.<br />\n(leading up to Medicine.)<br />\n4. Heological-ihological.<br />\n$. Latin Mathematical.<br />\n6. Historical-Political.<br />\n_(leading up to Law.)<br />\nf. Modern Languages.<br />\nSerial Publications.<br />\nEditors.<br />\nMathematics(vol. XXI V.)<br />\nFrank Morley.<br />\nChemistry (vol. X XVI).<br />\nIra Itemsen.<br />\nPhilology (vol. XXII.)<br />\nBasil L. Gildersleeve.<br />\nHistory vol. X X.)<br />\nJ. M. Vincent.<br />\nModern IianguigeS (Vol.. XVI.) 4. Marshall Elliott.<br />\nBiology (vol. IV.)<br />\nWiiiinra K. Brooks.<br />\nA ss3 riology (vol. IV.)<br />\nPaul Haupt.<br />\nExperimental Medicine(vol. VI.) W. H. Welch.<br />\n<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photograph of the Normal Solar Spectrule10 plates. $20.110<br />\nDescription of the Johns Hopkins Hospital. .1. S. Billings, Editor. 116 pp. 4to. t6 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fee-simile edition. Edited by J. Ronde! Harris. 110 pp. 4to. 10<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MBA. with Antilegoinetut Epistles. Edited by I. H. Hall. $8.00.<br />\nBlbliographia Flopkinsiensis. Part I. Philology. Pori<br />\n,<br />\n11-Ill. Chemistry, Mineralogy and Geology. Parts<br />\n1V-V-VI.Physics, Astronomy and Matiaematios.<br />\n8 vo. 80 cents per part.<br />\nR full list of publications will be sent on application.<br />\n<br />\nProgrammes of the Courses offered to graduate students in Philosophy and the Arts, and in the School of<br />\nMedicine,and also of the Undergraduate or Collegiate<br />\nVourses, will be sent on application to the Registrar.<br />\n<br />\nGommunications in respect to exchanges and remittenosS<br />\nmay be sent to Johns Hopkins Press, Baltimore, Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nFEBRUARY 12, 1902.<br />\n<br />\nNo. 9.<br />\n<br />\nBY A DEGREE.<br />\nNE evening, twenty years ago, I was about to close my office and try to<br />\nforget that there was such a thing as medicine, doctors, or sick people.<br />\nThis should have been a very easy matter, for since my graduation from<br />\nthe medical school I had had the usual actual experience with the above-mentioned necessities to a doctor's success. But my day was not to be so uneventful as I had expected. Just as I was locking the cover of my desk, I heard a<br />\ngreat \"Hello!\" sounding through the ball. Then without the ceremony of a<br />\nknock, my old friend, Jim Henderson, stalked into the room. Jim was a very<br />\npleasant chap, what the boys called \"a good fellow.\" We were very fond of<br />\neach other. Playmates in our childhood, four years of college had cemented our<br />\nfriendship; nor could the varying duties of law and medicine lessen it. There<br />\nwas, however, a tacit agreement that Jim was not to visit my office. There was<br />\nno idea of professional dignity about Jim, and suppose a patient should come<br />\nwhile he was in the office? Naturally, I awaited an explgnation. Though he<br />\nseemed to be in no hurry, yet I felt something must have been wrong, for Jim<br />\nhad not given me one \"tip\" on the races or told me of the \"easy thing the<br />\nUnknown would have with the Etheopian.\" I waited. He cogitated. The<br />\nstillness was becoming tragic. Then he deigned to speak. \"I was walking<br />\nabout dreaming, and it seems somehow or other here I am.\" This wasn't<br />\n<br />\nO<br />\n<br />\nJim's usual style.<br />\n\"Tell me what's the matter. You're acting just as you used to at college<br />\nwhen the boarding-house keeper's fair daughter gave you the jilt in favor of the<br />\nmilkman.\"<br />\n\"Something serious has happened to me. I have been foolish enough to<br />\nfall in love with a girl whose fortune is quadruple my own.\"<br />\n\"Not so very unfortunate,\" I murmured, thinking of office-rent falling due.<br />\n\"She seems to reciprocate my feelings. When I told her of my love, it was<br />\nbeautiful to see the blush suffuse her cheeks, to see the furtive tear, the quick,<br />\nexcited breath. Oh! how beaut\"—. I thought it was time to call a halt.<br />\n\"To the point, man. Where's the snag?\"<br />\n\"Coming to it,\" he growled. \"Where did I leave off?\"<br />\n\"Never mind about that,\" said I, \"give me the gist of the story.\"<br />\n\"Well, Emily was well pleased. It was the father. Emily's father is a<br />\nbusiness man, and can view things only through the eyes of the 'street.' When<br />\nI told him of my love for his daughter, he grunted, looked me over as if I were<br />\na consignment of tea, grunted again. Then, in the most cold-blooded way<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nimaginable, he asked me who I was, asked me if I could support a wife. I<br />\nremonstrated, told him that his daughter seemed willing to take all risks; and<br />\nspoke of our reciprocal affection. I did not seem to be making much of an<br />\nimpression. I told him that it was cruel to separate two loving hearts; and<br />\nthat he did not know his duty as a father. That was the straw that broke the<br />\ncamel's hack. I don't know how it came about, hut I was ushered from the<br />\nroom with neatness and dispatch by the shortest route.\"<br />\n\"Really,\" said I, making a vain attempt to he facetious, \"I am not a<br />\nmender of broken hearts. Your case is one for a spiritual adviser. Tell me,<br />\nwho is this irascible Croesus?\"<br />\n\"John Koleman is the 'pater' and I am the humble slave of his daughter,<br />\nEmily.\"<br />\n\"A peculiar coincidence,\" I exclaimed; \"I am family physician to Koleman's household. We are very good friends \"<br />\n\"That doesn't help me very much, does it, old man?\"<br />\nI was obliged to confess that the status quo was as before. But I added<br />\nthat I would think about the matter, and see what I could do to help him. Jim<br />\nleft the office in no pleasant mood. I was thinking harder than I had ever had<br />\ndone before. I turned over many schemes in my mind, but somehow nothing<br />\nseemed feasible. A sudden happy thought struck me. No sooner thought<br />\nthan I was writing a letter which, if it did not mean absolutely certain success,<br />\nconveyed some degree of hope. This is the letter I wrote to Jim:<br />\nDEAR OLD PAL:—<br />\nYou have made me waste more brain-tissue over your little affair than I<br />\nhave wasted since we worked into the small hours over our \"conics.\" I have<br />\ndecided upon a plan which may possibly be instrumental in gaining for you<br />\nyour heart's desire. I do not wish you to put too much confidence in the<br />\nscheme, as I consider it only the straw at which the drowning man grasps. My<br />\nplan is Machiavellian; hut it requires histrionic ability on the part of Emily, a<br />\nfair amount of parental weakness on the part of \"Pater,\" a great deal of deceit<br />\non your part, and a surrender on my side of all the ethics of my profession.<br />\nHere goes for my scheme, and may the gods be propitious. I told you in my<br />\nlast unsatisfactory talk that I stood in the relation of family physician to the<br />\nKoleman family. Then I little thought that this fact would have anything to<br />\ndo with your future—and maybe it won't. In some way or other manage to<br />\nsee Emily. Then tell her that if she wishes to trot the earthly road of marital<br />\nbliss, to feign sickness. Tell her to make it a high fever—a very high fever.<br />\nWhen she reaches that state, instruct her to become delirious. In her<br />\ndelirium tell her to call for you, in fact, to waste away for want<br />\nof you. I will come to the house; look grave. I will tell Mr.<br />\nKoleman that, unless you are allowed to see Emily, her chances for<br />\nimmediate immortality are Al. If my experience with fathers has given<br />\nme any wisdom, I will warrant that this permission will be granted. Although<br />\nhe will probably ask if a change of air would not answer every purpose, I will<br />\ninsist. You will be admitted to the house. When you come to her bed-side,<br />\nlet grief and worry, and the traces of sleepless nights be upon thy brow, 0,<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n3<br />\n<br />\nunhappy one, and let a sigh arise from the depth of thy soul and shake Olympus: Then you will gently caress her forehead, and a smile as if listening to a<br />\nchoir of angels will o'er spread her countenance. Then, 0, heavenly sound,<br />\nshe will whisper in dulcet tones—\"Jim. are you here? Now I can die in peace.<br />\nDo not grieve Jim, I am going to a better world than this.\" If\"Pater\" weeps<br />\nduring this affecting scene, it probably means success. I will prescribe continued applications of yourself for about a week. Then Emily will convalesce.<br />\nDuring the weary hours of convalesence you will be most assiduous in your<br />\nattention. A little attempt to become popular with father would not be out<br />\nof place. I hope that Mr. Koleman will then see what curative powers true<br />\nlove has. Then, possibly,\"Pater\" will give his consent to the match, and all<br />\nwill be happy as in the story-book. But remember, old man—<br />\nHope springs eternal in the human breast,<br />\nMan never is, but always to be blest;\"<br />\nso don't put too much confidence in my scheme. It is a chance worth taking.<br />\nGood luck to the scheme.—JAcK.<br />\nWell, I waited impatiently for the 'Phone to give me a hurry up call to<br />\nthe Koleman household. In about two days it came. Of course I hurried<br />\nup and found Emily in a high state of fever. Father was worried and nervous.<br />\nEmily had been calling for Jim all day. He didn't know what to do. Then I<br />\nput on a highly sensorious air. \"Mr. Koleman,\" I said severely,\"Would<br />\nyou allow the life of your daughter to be jeopardized by the demands of conventionality. If Emily called for Jim in her delirium, Jim must be sent for.\"<br />\nKoleman demurred slightly, but was forced to acquiesce. Then the crisis<br />\napproached. Jim came to the house. How haggard he looked, poor fellow !<br />\nHow gently he touched Emily's fevered brow! How peaceful she looked.<br />\nThen came the pseudo death-bed scene, and \"Pater\" wept. After those<br />\nwelcome tears everything went along smoothly. Marriage, happiness and long<br />\nlife. Jim never told Koleman of our ruse. I noticed that when Jim and<br />\nEmily's daughter reached eighteen and was stricken with fever, another physician prescribed. I think Jim and Emily were right.<br />\nX. 1903.<br />\n<br />\nPICKED UP ON THE MOVE.<br />\n<br />\nP•<br />\n<br />\nA little book called \"Student Life,\" seen on the new book department's<br />\nshelf in the main library of McCoy Hall, contains some interesting statistics<br />\nconcerning the development of student life and the advance of student enterprises at American colleges. The only branch of work done at Hopkins that<br />\nis mentioned in the little volume is the course in public speaking and the pro<br />\ngress of the student debating assemblies which have been so successfully carried oil here. As the Hopkins was one of the first pioneers in the field of allowing the students to organize into self-governing assemblies to practice forensics and the art of public debate, our student Congress has been the model for<br />\nmany others in the country. Allowing for the expected amount of trifling in such<br />\nbodies, the work done every year is good, as is demonstrated by the excellent<br />\narticle of debate put up by both sides in the annual interclass contest. The<br />\nwork is not ideally perfect, but it is carried on by young men—and young men<br />\nare not ideally perfect.<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS—LETTER.<br />\nNOTICE, UPP ER CLASSMEN I<br />\n<br />\nN two weeks, on the night of February 27, the Interclass Debate takes<br />\nplace; subject: \"Trusts.\" You are all interested, and you will all attend.<br />\nBut there is a more active way for you to give the debaters your help, and<br />\nthis help is much needed. On each team a few men are trying for the places of<br />\nadvisers—reading up on the subject of debate, making notes of new ideas for<br />\nargument or refutation, and consulting with the chairmen of their respective<br />\nclass teams. This kind of interest is easily shown ; at the same time, it is<br />\nof great value to all concerned in the contest. Especially is this the case in the<br />\npreparation of the written speeches.<br />\nSo here is a call to each Senior and Junior—Get to work! you would not<br />\nfail to do your best in a class rush, or cane party, or tug-of-war, and this is a<br />\ncontest in which you can aid just as materially. You are interested in Trusts ;<br />\nsome day you might make money out of one. Finally, by raising the quality<br />\nof the work which is to be done on the 27th, you will make it more possible for<br />\nthe Hopkins to down her coming opponent, the University of North Carolina.<br />\nThe chairman of the teams are: Senior, Markell; Junior, Blum.<br />\n<br />\n3<br />\n<br />\nTHE CONCERT ON FRIDAY.<br />\nthe<br />\nhe importance of the concert to be given in Lehman's Hall, on Friday night,<br />\n,February 14, has been already mentioned in the previous issue of the<br />\nNEWS-LETTER. As was then stated, the support that the student body<br />\nand the faculty give this concert will determine its success. The men on the<br />\nclubs have been giving all their spare time to rehearsals, and there is no doubt<br />\nthat the concert from a musical standpoint, will be excellent. The songs are<br />\nwitty, and the harmony would please the most aesthetic ear. The Banjo Club<br />\nhas some snappy music, regular foot-moving \"rag-time.\" Then after the<br />\nexhaustion of keeping up to this music,the Mandolin Club soothes the tired soul<br />\nwith selections from \"Florodora.\" What more can be desired. Surely the<br />\nwhole student body should attend. More than this could not he had at even<br />\nthe theatres, where only standing room can be had for the price of admission to<br />\nthis concert. It might also be mentioned that one hundred and eleven (111)<br />\ncollege girls from the Woman's College will be present, and seats near this<br />\ndelegation will go to Hopkins fellows.<br />\nThe men who will take part in this concert and the organization of the<br />\nClub are as follows:<br />\nPresident, Andrew R. Bird, G. Manager, Eben C. Hill, '02.<br />\nGLEE CLUB—Leader, J. HOWARD EA(IER, G.<br />\nFIRST TENORS—J. A. E. Eyster, W. B. Carver, G. C. D. Cowles, M. H. H. Humriehouse, '04.<br />\nSECOND TENORS—J. M. Wright, G. F..T. Hall, M. T. J. Stubbs, G. E. B. Beasley, '02.<br />\nJ. M. Nelson, Jr., H. A. Converse, G.<br />\nFIRST BASSES.—J. H. Eager, G., R. Z. Thomas, G., F. R. Ford, G., J. N. Myers, '(2,<br />\nE. C. Hill, '02.<br />\nSECOND BASSES.—P. K. Oilman, M., S. T. Mason, '02, C. A. Marshall, '03, A. R.<br />\nDochez, '03, J. A. Sayler, Jr., '01.<br />\n<br />\n\f\f\fTHE NEWS-LETTER.<br />\n<br />\n5<br />\n<br />\nMANDOLIN CLUB—Leader, WILTON SNOWDEN, JR., '03.<br />\nMANDOLINS—H. I. Cross, G. W.B. Moulton, M J. T. England,'02. W. Snowden Jr.,<br />\n'08. R. C. Pagon, '03. W. K. Koppleman,'02. A. Pearre, Jr„ '02. F. H. Hall, M.<br />\nVIOLINS—T. M. Nelson, Jr., '03. R. S. Lanier, '03.<br />\nOLARINETTE—A. R. Dochez, '03.<br />\nBASS BANJO—J. H. Eager.<br />\n'CELLO—E. C. Hill,<br />\nTRAPS.—S. T. Mason, '02.<br />\nBANJO CLUB—Leader, CHARLES A. MASHALL,'03.<br />\nBANJEAURINES.—S. L. Mason,'03, C. A. Marshall, '03, R. S. Lanier, '03, V. E. Smith,<br />\nGT., W. Snowden, Jr., M. W. Hendry, '03, W. 0. Murkland, '03, R. N. Jackson, '05.<br />\nBANJOS.—J. W. Bryan, '03, J. A. Eager, G., H. N. Baetjer, '03.<br />\nGUITARS.—H. A. Converse, G., E. G. Martin, G., T. G. Cook, '02, F. Hazlehurst, Jr.,<br />\n'03, E. C. Hill, '02, L. C. Murphy, '02.<br />\n<br />\nSOME VERSES THAT OMAR KHAYYAM MIGHT HAVE<br />\nWRITTEN--BUT DIDN'T.<br />\nI.<br />\nNo Sage of Oriental lore can tell,<br />\nNor any man who sips at Wisdom's well,<br />\nWhat is the meaning Diabolical<br />\nContain'd in a terrific College yell.<br />\n<br />\nThe Grape that can dispel our deepest care<br />\nWhen we are tired of climbing Learning's stair<br />\nLeaves the same head-ache on the morrow's Dawn<br />\nWhich we would have, had study been our fare.<br />\nWhen you do see the Rathskeller's red light,<br />\nPeep not within, my son, to see the sight,<br />\nBut turn your eyes demurely on the ground.<br />\nWithin, the Undergrads are getting tight.<br />\nIV.<br />\nMy son, let not a Cloud on your brow fall<br />\nWhen you are in examination Hall;<br />\nYour paper's short, but pity the poor Prof.,<br />\nFor he it is who has to read them all.<br />\nV.<br />\nThere are few Things that you can trust, I Ween,<br />\nBut these three least; the elevator mean,<br />\nThe weather bureau's Flag when it cloth fly.<br />\nAnd the strange ways of Christhilf's slot-machine.<br />\nVI.<br />\n'T is not the Man who yells the most, my son,<br />\nWho is crowned Victor when the race is won.<br />\nIn strife beware the strength of Silent men,<br />\nThey are the Masters when the course is run.<br />\nH. K. T.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n6<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nFEBRUARY 12, 1902.<br />\nSubscription $1 50 per year.<br />\n<br />\n.<br />\nEditor in Chief,<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nArt Editor,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\n10 Cents a single copy.<br />\n<br />\n.<br />\n<br />\nSOL STROUSE, 1902.<br />\n. EBEN C. HILL, 1902.<br />\nROBERT S. LANIER, 1903.<br />\nW. S. BIRD, 1903.<br />\nHARRY K. TOOTLE, 1903.<br />\nJOHN A. SLEMONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\nCHARLES F. RANFT, 1902.<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1903.<br />\n.<br />\n<br />\nAddress all articles, communications, etc., to SQL STROUSE, box 567, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\n0 many requests have been made for an occasional sprinkling of fiction on<br />\nthe leaves of the NEWS LETTER that we have complied by publishing the<br />\nshort story written by a member of the University. We do not, however,<br />\nintend to make a violent change in the character of the NEWS-LETTER, except<br />\nperhaps by more or less frequent repetitions of issues similar to this; for we<br />\nthink that the sphere which the Nnws--_,LETTER now covers is the proper one for<br />\nthe only college paper at the University. After an unbiased consideration of<br />\nwhat such a paper ought to be and what the Nnws LETTER is, we think that<br />\nthis statement will be found justifiable. The only paper at a college should<br />\nundertake to reflect college life in all its phases, and to do this it must combine<br />\nin its pages the contents of four or five fields. It must to a certain extent be<br />\nliterary; it must contain athletic accounts and news articles; it must reflect<br />\nstudent thought; and it must be original. The NEWS-LETTER during the past<br />\ntwo years has always striven to completely cover the ground of news review; it<br />\nhas always had a fair sprinkling of original matter; and its editorials have<br />\nattempted to reflect student thought. Perhaps the literary side has been somewhat neglected; which is the re ison for publishing the present issue as it is.<br />\nIf we receive short studies of a high standard, we will probably repeat the<br />\nnatu!e of this issue later; hut short stories and poems are the only \"literature\"<br />\na college paper should handle. We do not want abstract essays or bookreviews,—two kinds of composition too often seen in college magazines.<br />\n<br />\n0<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n7<br />\n<br />\nt<br />\n<br />\nHE revival of interest in base-ball at the Hopkins calls for some very plain<br />\nstatements. For the last two or three years base-ball has been a failure<br />\nat Hopkins, and the cause of the failure has generally been in the baseball men themselves. Before the student body as a whole can be interested in<br />\nthe sport, the players must be interested—a state of affairs which the cage prac..<br />\ntice the, last two years did not demonstrate. This year the state of affairs is<br />\ndifferent. According to the statement of Captain Campbell, the men who have<br />\npledged themselves to support the team are all base-ball enthusiasts of tried<br />\nstandard, and men who are not and would not be interested in track or lacrosse<br />\nwork. The list of names certainly is encouraging to those who love the sport,<br />\nand in Captain Campbell the team has a leader who will permit no irregularities<br />\nin practice, will allow no falling in interest. Thus in view of past failures,<br />\ncontrasted with the present outlook, we think the midway course of the Athletic Association justified. Everything now rests with the supporters of the<br />\nmovement. If they can keep base-ball on the level of our lacrosse and track<br />\nteams, can play the larger colleges, and, above all else, practice regularly, we<br />\nsee no reason why base-ball should not again establish itself at Hopkins. The<br />\nspirit of the base-ball enthusiasts, however, must be better than it has been, or<br />\nthe game will deserve to be only a remembrance here.<br />\nRESIDENT REMSEN'S address to the students at the Feed was noticeable from two standpoints: the condition under which the address was<br />\nmade—and the contents of his remarks. As this was the first time Dr.<br />\nRemsen, as president of the University, had an opportunity to speak before a<br />\nstudent gathering, he took full advantage of his opportunity to show where he<br />\nstands in relation to the undergraduates. Dr. Remsen spoke on subjects which<br />\nwere of intense interest to the students assembled, and which show that the<br />\nPresident will continue to demonstrate the consideration for the welfare of the<br />\nstudents which he first showed by the inauguration of \"family receptions.\"<br />\nThe value of a college club similar to the Houston Club of the University<br />\nPennsylvania<br />\nwas dwelt upon at some length by Dr. Remsen, who stated<br />\nof<br />\nfirst<br />\nopportunity<br />\nthe<br />\nhz! would enter a claim for a similar organization<br />\nthat at<br />\ncourse,<br />\nHopkins.<br />\nOf<br />\nwe<br />\nat<br />\nneed such a club here; and slight as the chances<br />\nundergrads<br />\nnow<br />\nare for the<br />\non the roll ever to enjoy the benefit of a Hopkins<br />\nStudent Club, we can be thankful for the time when our younger brothers—or<br />\nour heirs—will have the pleasure. Speaking thus to a body of men assembled<br />\nto celebrate victories on the athletic field, Dr. Remsen continued: \"Keep everything on a high level, and the Faculty will be with you.\" As the secret of<br />\nHopkins academic success has been the seeking after the ideally high, so has<br />\nour athletic success been won by honest, straight playing, and so must it continue. If we cannot keep everything off the low, mean plane of materialism<br />\nand on the high, clean level of true sportsmanship we do not want, and do not<br />\ndeserve, the support of the Faculty or of anybody else. The High Aim is the<br />\naim of all our athletes, and that is the only aim worth striving for. Hopkins<br />\nstudents always have guarded their athletic reputation with jealous care, and as<br />\nlong as free speech is allowed, the Faculty need not fear any smirch on the<br />\nathletic name of Johns Hopkins.<br />\n<br />\np<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nUTAILS of the celebration on February 21-22 are slowly crystallizing into<br />\ndistinguishable shape, and it is already apparent that the event this year<br />\nwill be the greatest date on the University calendar since 1876. As<br />\nstated in the daily papers of this city, Alumni will pour in Baltimore<br />\nfrom all over the country, and representatives will be present from the<br />\ngreatest American colleges, so that an inspiring association of educated men<br />\nwill give and receive honor at the Hopkins Quarter-Centennial. In comparison<br />\nwith, this assemblage of notables, the undergraduate body will play a small<br />\npart in the celebration; but the NEWS-LITTER wants to insist on the desirability of playing this part, however small or comparatively insignificant it<br />\nmight be, in a manner according to the surroundings. The students have been<br />\npromised proper attention and good seats during the celebration, but the exact<br />\nnature of the role they are to play has not yet been announced. It is hardly<br />\nnecessary to urge attendance at all the functions to which we are invited, for<br />\nanything but a full response by the students on this occasion would be a disgraceful exhibit of disinterestedness.<br />\n<br />\ngD<br />\n<br />\nTHE ADAMS' MEMORIAL MEETING.<br />\nN Wednesday afternoon, February 5, a large audience assembled in the<br />\nDonovan Room, McCoy Hall, to pay tribute to the life and services of<br />\nthe late Herbert Baxter Adams, professor emeritus of the University,<br />\nand for many years the head of the Historical Department. The orator was<br />\nProf. Richard T. Ely of the University of Wisconsin, and at one time a professor<br />\nhere.<br />\nProf. Ely spoke of Dr. Adams' early life, his years at Amherst College, at<br />\nHeidelberg, and at the Johns Hopkins University. He told of the active part<br />\nDr. Adams had taken in the organization of the American Historical Association, and other educational societies. \"Dr. Adams,\" he said, \"sincerely<br />\nbelieved that the education of the people was the first principle of democracy.\"<br />\nProfessor Ely read a number of eulogistic letters sent by friends, former<br />\npupils and associates.<br />\nIt was announced by President Remsen that the compilation of the Adams'<br />\nmemorial volume was well under way. The volume will open with a biographical sketch by Dr. John M. Vincent, acting head of the historical department, and for many years associated with Dr. Adams. This will be followed<br />\nby the address delivered by Professor Ely, and an article on Dr Adams recently<br />\ncontributed by Dr. Gilman to the Outlook. The volume will contain a complete bibliography of the works of Dr. Adams' pupils, an undertaking which<br />\nDr. Adams himself started.<br />\nBy direction of the board of trustees a bronze memorial tablet will be<br />\nerected soon on one of the walls of the room where the Adams Library will be<br />\nplaced.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n111111111111111fini1111111011,1111111111111111111111141111111111111111111$111111111111‘11111111111111111111111111111111111H11111111,11111111111111111111111111111111111111111111111111111111110111111<br />\n<br />\nf.<br />\n4:;11'11111t101111111011111111111111111111,11111r11111i11111111411111111111r111111111111111131111111111111i11111111111111111111111111111111111111111111111111111111/11111111111'11rt 1:;!..<br />\n<br />\nT the St. Johns' Alumni banquet, held February 5, President Remsen<br />\nresponded to the toast \"The Johns Hopkins University.\"<br />\n<br />\ngI<br />\n<br />\nYesterday afternoon Professor Moulton gave the last of his lectures on<br />\nAncient Tragedy. He spoke on \"The Theatre as the Church of Greece.\"<br />\nThe Reverend Walter Lowrie, M. A., late fellow of the American School of<br />\nClassical Studies in Rome, lectured Monday, February 10, in McCoy Hall, on<br />\n\"Sincerity in Religious Art.\" The lecture was given under the auspices of the<br />\nArchaeological Institute of America.<br />\nThe date of the Junior Class banquet has been definitely decided upon;<br />\ngiving way to the wishes of the athletic teams and the Musical Clubs, the<br />\nbanquet will be held on the evening of the twentieth of this month at the<br />\nHotel Marlborough. The committee having the arrangements in charge is<br />\ncomposed of Messrs. Addison, chairman, Smith, and Bird.<br />\nThe members of the Freshman Class relay team have received the class<br />\nnumerals as a reward for their gallant struggles against the Junior team. The<br />\nquestion now arises: Will the Freshman tug-of-war team likewise receive<br />\nnumerals?<br />\nAt a Freshman class meeting, Sifford Pearre was elected vice-president.<br />\nPlans for a class banquet were discussed. It was finally decided to leave the<br />\narrangement to a committee to be appointed by the president.<br />\nThe liquid air, which was to figure in Dr. Wood's lecture of Thursday<br />\nlast, failed to arrive in time; the plant in Washington had broken down,<br />\nthereby delaying shipments for a week at least. As soon as it is found<br />\npossible to have an illustrated lecture on this subject, notice will be posted.<br />\nTo most of the students this will be a valuable opportunity and perhaps the<br />\nonly one, to see this wonderful substance handled. A large crowd should be<br />\npresent.<br />\nThe Georgetown College Journal, reviewing the three prize literary efforts<br />\nby college graduates published in this month's Century, says: \"The prize<br />\nessay entitled \"Huxley as a Literary Man,\" by J. E. Routh, Jr., of Johns<br />\nHopins University, is the best of the three.\"<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n10<br />\n<br />\nHAS THE MILLION BEEN SECURED?<br />\nT IS now being persistently rumored that the long sought million has at last<br />\n<br />\n3<br />\n<br />\nbeen forthcoming. Confidence in the friends of the University has never<br />\nbeen lacking, and it seems now as if the magnificent Homewood estate will<br />\nsoon come into our possession. One of the most gratifying signs pointing<br />\ntoward the desired million is the speech delivered by President Remsen at the<br />\nPrinceton banquet. Alluding to the sympathy expressed for the llopkins<br />\nbecause of its poverty stricken condition, President Remsen said that pity was<br />\nunnecessary, that the Hopkins had always managed to get along, and always<br />\nwould be able to get along. He warned the audience that he would have sonic<br />\ninteresting announcements to make on the twenty second of February. All<br />\nthis augurs well for the future of the Johns Hopkins University.<br />\n<br />\nY. M. C. A. NOTES.<br />\nN Sunday, January 26, Mr. Robert E. Speer delivered a powerful \"Plea<br />\nfor Ignorance\" to the 300 college men of the city, who were present.<br />\nUnfortunately, Hopkins was far outnumbered by the other institutions<br />\nof the city.<br />\n<br />\nO<br />\n<br />\nThe regular monthly meeting of the Executive Council was held on Wednesday, February 5. Tho following five men were appointed delegates to the<br />\nStudent Volunteer Convention at Toronto, February 26 to March 2: Dr. H. L.<br />\nWilson, M. B. Graff, C. C. Grove, C. K. Edmunds, and J. A. Addison.<br />\nSunday, February 9, was the Universal Day of Prayer for Colleges, and<br />\nRev. Mr. H. C. Kirk, the new pastor of the Franklin street Presbyterian<br />\nChurch of this city, delivered a very helpful address.<br />\nDr. Howard A. Kelly, of the Medical School, is conducting morning prayers this week, and speaks briefly each morning in Levering Hall, 8.45-8.55.<br />\n\"God, as revealed by His Names,\" was the topic of the weekly prayermeeting on Tuesday, February 11, led by Mr. C. C. Grove, Mathematics.<br />\n<br />\nAMONG THE COLLEGES.<br />\nCornell has a flourishing Prohibition Club.<br />\nHarvard had a deficit of $321,579 for the year ending July 31st, 1901.<br />\nWisconsin has laid out a course of study in journalism which will be included in the college curriculum.<br />\nAt a recent meeting of men from all classes at Cornell, the custom of undergraduate rushes was done away with.<br />\nHarvard has the largest faculty of all the colleges in America. Her instructors number 337, a body nearly as large as the Lower House of Congress.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n11<br />\n<br />\nThe Senior Class at Harvard has elected a colored man, R. C. Bruce, as<br />\nclass orator. Bruce is the son of B. K. Bruce, formerly senator from Mississippi, and register of the treasury. He is one of the best orators and debaters<br />\nthat Harvard has ever had.<br />\nThe Faculty of Knox College have adopted the following: \"Each college<br />\nstudent is allowed twenty absences from college exercises in each semester.<br />\nSeniors are allowed twenty-five Members of athletic teams, the glee club,<br />\nband, debating teams, etc., also representatives of the various editorial hoards,<br />\nwill be allowed an additional number of absences as recommended by the various committees.\"<br />\nThe trustees of Carnegie Institute have adopted plans for the erection of<br />\nthe largest and most complete school of technology in the world. Mr. Carnegie's proposition was that he be allowed the privilege of endowing and maintaining a technological school of the highest order in the city of Pittsburg, the<br />\ncity to provide the site. The school will be built at a cost of several millions<br />\nof dollars by Mr. Carnegie, and he will also be asked to give a large sum for its<br />\nmaintenance. The city of Pittsburg will be asked to contribute sixty acres of<br />\nground for a site.<br />\nA parallel to Booker T. Washington's undertaking for negro education in<br />\nis found in the work of Dr. Frost, president of Berea College, a little<br />\nSouth<br />\nthe<br />\nheard of but very interesting college which is the seat of the higher education of<br />\nthe \"mountain whites\" of Kentucky and other portions of \"Appalachian<br />\nAmerica.\" The extreme simplicity of these people is illustrated by the statement that \"more than one student has been turned back by his parents after<br />\ngreat preparation and long journeys on foot or on horseback, because the first<br />\nsight of a train of moving cars brought such terror that the father was not willing to trust his son into the keeping of such an engine of destruction.\" Berca<br />\nCollege numbers some eight hundred of these innocent sons and daughters of<br />\nthe South, who depend on it not only for book learning, but for their first introduction to the ways of modern civilization.<br />\nNearly all the catalogues and annual reports that are pouring forth from<br />\nthe college press at this season show an increase in student membership, and in<br />\nendowment. Smith College can accommodate in its dormitories less than half<br />\nof the student body, and the capacity of its assembly hall is altogether inadequate. The report of Treasurer Tyler of Yale shows an increase of permanent<br />\nuniversity funds of $595,027. The Wellesley catalogue states that the entire<br />\nnumber of students is over eight hundred, the largest enrollment in the history<br />\nof the college. Princeton has made rapid strides in growth and evidently<br />\nexpects to continue to do so. Its new gymnasium is planned to surpass any<br />\ncollege gymnasium in the world, both in cost and in size. It is to be made<br />\nlarge enough to accommodate nearly twice the number of students now in the<br />\nuniversity. Syracuse University is organizing a college of applied science in<br />\nwhich mechanical, electrical, and civil engineering will be taught.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nDOINGS OF THE ATHLETIC ASSOCIATION.<br />\nT the regular meeting of the Hopkins Athletic Association last Thursday<br />\nafternoon, the question of a Baseball team was brought up for final<br />\nsettlement Mr. Campbell argued strongly in favor of team, and McKnight from the Medical School warmly seconded his efforts. The matter was<br />\nthen discussed by the Board, and it was decided, in view of the past record of<br />\nBaseball at Hopkins, which for the last few years has never proved a success,<br />\nto grant no appropriation for the team, nor to officially recognize the team.<br />\nIt was stated however, that should the supporters of this movement<br />\ndemonstrate sufficient earnestness to produce a winning team, by showing up<br />\nregularly for practice, and working faithfully, the question will be reconsidered,<br />\nand both financial support and official recognition be given to the team. To<br />\npromote its success, the men will be allowed to use the suits and cage, it then<br />\nremaining to the lovers of Baseball to show whether we shall have a team or not.<br />\nAt the same meeting Murkland,(1903), was elected Ass't Manager of the<br />\ntrack team, and Addison, (1903), Ass't Manager of the Lacrosse team.<br />\n<br />\n4<br />\n<br />\nTHE BASE BALL OUTLOOK.<br />\nLTHOUGH Lacrosse has occupied such a high place in the affections and<br />\ninterest of Hopkins men, and established itself among us as the game of<br />\nall others, it is unfortunate that for several years past there has not been<br />\nan excellent base ball team. Base ball in our country is so universal and<br />\nimportant a sport that we should not neglect it. Nor need we. Of course, the<br />\nrecords of our teams of the last three years have not been gratifying. Even the<br />\nteam of last spring which won the State championship fell away from the<br />\nstandard set for the conduct of our athletic teams. These failure and mistakes,<br />\nhowever, should not discourage us, but arouse us to a great effort, It is our<br />\nduty to retrieve the past, to show ourselves and the people of Baltimore that<br />\nHopkins men still cherish a love for the national game. It happens that this<br />\nyear there is material of an exceptionally high order. Seven or eight men of<br />\nthe graduate department and Medical School have expressed a willingness to<br />\nenter heartily into the undertaking of starting a team. These men are able and<br />\nexperienced, and should make valuable allies of the some half-dozen faithful<br />\nplayers who have vainly labored for the cause for the last three years. Besides<br />\n<br />\n4<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\nthese, many undergraduates manifest a desire to support the new movement.<br />\nSome of the candidates are:<br />\nE. Strouse,<br />\nMoore,<br />\nConstantine,<br />\nSharretts,<br />\nMarine,<br />\nHand,<br />\nMcKnight,<br />\n<br />\nWhipple,<br />\nCarr,<br />\nWright,<br />\nMurphy,<br />\nMathai,<br />\nNelson.<br />\nDodge,<br />\n<br />\nMarshall,<br />\nJ. Strouse,<br />\nRoulston,<br />\nDow nian,<br />\nOgle,<br />\nReynolds,<br />\nStrobbar, and others.<br />\n<br />\nAll these loyal wearers of the Black and Blue will soon be given an opportunity to show their interest and devotion. It is understood that those who<br />\nhave the matter in hand are making plans by which all members of the University can join in a common effort to maintain base ball as one of our recognized<br />\nsports. Pure college athletics will always appeal to the American people. Just<br />\nnow college base ball is at a low ebb in Baltimore, because there are no firstclass teams here. We have a chance to reverse this condition of affairs. It is<br />\nquite possible to produce a base ball team for this year that will satisfy even the<br />\nmost exacting, and that will bring to our University a worthy fame and honor.<br />\nJ. G. CAmPBuLL,'02.<br />\nLet us not shrink from our duty.<br />\nCap J. H. U. Base Ball Team.<br />\n<br />\nLACROSSE.<br />\nACROSSE practice has now been going on for several weeks; but as yet<br />\nnothing definite can be said as to what kind of a team we will have, or<br />\nwhat men will make a place on it.<br />\nLet us take a look at last year's team and see how we stand. We have<br />\nlost five men,and good ones too. These are Captain Tyler, Coach Maddren,<br />\nBandel, Bruton, and Hatch. Tyler played third defense, which is one of the<br />\nmost difficult positions on a team, and filled it admirably. William H. Maddren<br />\nwas the backbone of lacrosse at J. H. U.; of his playing nothing need be said.<br />\nHe is everywhere regarded as the best college lacrosse player, and could make<br />\nany team he tried for. Hopkins lacrosse without \"Billy\" at cover point will be<br />\nsomething new to Baltimore. Bruton played at second defence for the last<br />\nthree years, and his weight and science will be missed when we go up against<br />\nheavy teams. With these three men out we see that there are only two experienced tnen who must form the skeleton of this year's defense. These are<br />\nCaptain Schmeisser at point and Straus at first defense.<br />\nIn the attack we lose Bandel and Hatch, who played first and second attack<br />\nrespectively. Bandel played on the team for three years, and made many goals<br />\nfor Hopkins. His place will be very hard to fill. Although Hatch only played<br />\none year he was always at the right place at the right time. Thus, even with<br />\nAbercrombie at centre, and Palmer Bernheim at third attack, there will be a big<br />\nditch for the ball to pass before it gets to Bert. Bernheim and Putts. In a word<br />\nour attack will probably be weak in the middle. You cannot make a three year<br />\nplayer in a year. Briscoe and Ranft, who played goal last year, are both with<br />\nus again; but the latter will not be able to play because he is under the doctor's<br />\n<br />\nt<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\ncare. Tough, E. Schmeisser, and Sayler, all three of whom played on the<br />\ndefense in some of the big games, ought to help strengthen the team this year.<br />\nOf the other candidates for the team, the best seem to be Bryan (1903), Bird<br />\n(1903), Custus, (1903), Smith, (1902), Iglehart,(1903), Mathai, (1903), Gillespie, (1902), S. Pearre, (1904), Pels, (1902), Riley, (1903), J. Strouse, (1901),<br />\nRosenheim, (1904). Most of these men are not absolutely green material, and<br />\neven those who are should, by plenty of stick work and energy, make a place<br />\nand name for themselves on the team this year. It is well known that five<br />\nFreshmen played on the ninety-nine championship team. How many will be on<br />\nour team this year?<br />\n<br />\nHOPKINS IN THE B. A. C. GAMES.<br />\n<br />\ne<br />\n<br />\nHE results of the B. A. C. games last Saturday night were from a Hopkins<br />\nstandpoint very excellent. Meeting the best men in the city we carried<br />\noff the honors of many events. In the 40-yard dash, three of the six men<br />\nin the final were Abercombie (withdrew), Blanck and Weedon. Blanck got<br />\nthird place. The 440 was won by Lindsay(Grad.); in the 880 yard run, Mullen,<br />\nrunning for B. A. C. beat out Rosenheim (1904) by only half a foot; and in the<br />\nmile relay with University of Pennsylvania, which was one of the most exciting<br />\nraces of the evening, the Hopkins team, composed of Abercrombie, Hoffman,<br />\nRiggs and England, had the gratification of beating the red and blue.<br />\nIn the next to the last lap of the race, the University of Pennsylvania man,<br />\nfollowing England by about two lengths, stumbled. The race had been nipand tuck all through, but it was hardly possible that Pennsylvania could have<br />\novercome England's lead.<br />\nThe high jump was won by Scholl (scratch) with a jump of 5 feet 8 inches.<br />\nWeedon (34 in.) got third. The pole vault has not yet been decided. Altogether<br />\nthings came our way in a satisfying manner.<br />\n<br />\nTHE FEED.<br />\n<br />\nt<br />\n<br />\nHOSE men who did not attend the annual athletic feed, at which it was<br />\nevery loyal Hopkins man's duty to be present, are probably not impressed<br />\nwith the idea that they missed anything particular. With those who<br />\nthink this, it is certainly a case of\"where ignorance is bliss 'tis folly to be<br />\nwise.\" Those who had the spirit to attend will readily agree that the absent<br />\nHopkins enthusiasts (?) missed a roaring good time, but they richly deserved<br />\nit. They are doubtless the very ones who deplore the lack of college spirit and<br />\nof close unity at the University.<br />\nThe committee had gone to no little trouble to provide a varied and interesting entertainment, followed by a feed which produced the climactic effect of<br />\nthe evening.<br />\nChairman Campbell opened the meeting with :a catchy'selection by the<br />\nMandolin Club. Messrs. Whipple and Ward came next with a very interesting<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n15<br />\n<br />\ngymnastic exhibition on the parallel bars and horse. Both men were loudly<br />\napplauded. Willis performed on the piano during the exhibition.<br />\nFollowing came the awarding of honorary\" H's\" and\"H. A. A.'s' by<br />\nPresident Abercrombie of the Athletic Association. Those men who received<br />\nH's\" for the first time were Campbell, Garwood, Sharretts, Houghton, P. S.<br />\nHill and Faris. Messrs. Plaggemeyer, Whipple and Youtz, received<br />\nthe secondary honor\" H. A. A.\" President Abercrombie also formally presented the Association with the championship baseball and track and field banners, which were won during the past season. President Remsen,Dean Griffin,<br />\nand Faculty Delegate Renouf, were then called upon, and each in turn complimented the athletes upon their work of the past season, and wished them the<br />\ngreatest amount of success in the future.<br />\nThe funny stunts in the cage were funny.<br />\nOnly those who were present can appreciate the difficulties and the fun<br />\nwhich the Freshmen had in locating their shoes in the huge pile erected at the<br />\nbeginning of the shoe race. The many drawbacks encountered in the obstacle<br />\nrace also furnished no little amusement. Some of the contestants were nearly<br />\nsuffocated while vainly attempting to crawl under the heavy gymnasium mat,<br />\nothers got a cold bath in their hurry to carry the buckets of water around the<br />\ntrack on their heads, while still others became hopelessly stuck in the barrel<br />\nwhich was suspended three feet from the ground. Strohbar, 1904, demonstrated<br />\nhis ability as a surmounter of various difficulties by winning both races. \"The<br />\nsame old story\" is sufficient to tell how the Junior-Freshman tug-of-war<br />\nresulted. At the finish the Freshmen were about ten feet to the bad. The<br />\nboxing contest between Iglehart, 1903, and H. Williams, Med., resulted in an<br />\neasy victory for Iglehart.<br />\nA plentiful supply of salad, ices, cake and coffee concluded the evening<br />\nentertainment. It was unquestionably a great success, and Committeemen<br />\nCampbell, Bernheim and W. B. Hill, deserve hearty congratulations. They<br />\nwere ably assisted by J. Abner Sayler, Jr., H. W. Plaggmeyer and J. Newman<br />\nNumsen.<br />\n<br />\nVERBICIDE!<br />\nHas the thought ever struck you.<br />\nHAT there are thousands of persons who have never heard the names of<br />\nMilton and Shakespeare .—<br />\n<br />\nt<br />\n<br />\nThat such persons were born deaf;—<br />\nThat the Health Department was not officially notified of the freshman<br />\nshoe-race;<br />\nThat otherwise the race might not have taken place ;—<br />\nThat there are more than 30,000 persons in this city who cannot speak the<br />\nEnglish language;—<br />\n<br />\n\f16<br />\n<br />\nTHE NEWS-LETTER.<br />\nThat they are nearly all infants under the age of four years ;—<br />\nThat there is such a thing as dyspepsia of the brain ;—<br />\n<br />\nThat freshmen particularly suffer from this malady finding much of their<br />\nwork hard to digest;—<br />\nThat benevolent assimilation would be a good thing for juniors to try ;—<br />\nThat a quarter of a century is but little towards the life of the University—<br />\nbut is much longer than the years of the poet Chatterton ;—<br />\nThat there is a walk known as the Johns Hopkins strut ;—<br />\nThat the Women's College girls first discovered it ;—<br />\nThat it cannot be acquired under a year, so the freshmen are still innocent;—<br />\nThat the Panama Canal will come to a full stop;—<br />\nThat it already past Colon.<br />\n?<br />\n<br />\n?<br />\n<br />\n?<br />\nH. L. L. '04.<br />\n<br />\nTO THE TWILIGHT.<br />\nThere is an hour between the night and day,<br />\nAn hour which stillness loves to hold,<br />\nWhen day itself into the night does mould,<br />\nAnd Phoebus gathers in each shining ray.<br />\nThen does the bird begin his evening lay,<br />\nThen shepherds drive their flocks into the fold,<br />\nThen sad, the Angelus is tolled,<br />\nAnd all the earth stops work to pray.<br />\nThat is thy hour,0 Twilight, dear,<br />\nThe hour when all is calm and still,<br />\nThe hour when rest from work's begun.<br />\nThe day lies dead upon the bier;<br />\nFor it is in thy pow'r to kill,<br />\nAnd turn to blood the setting sun.<br />\nL. M P. W.,'03.<br />\n<br />\n\f17<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nDomestic finish—a divorce.—Syracuse bniversity Herald.<br />\n<br />\nThree from the Harvard Lampoon.<br />\n\"Does Showman make much use of Realism?\"<br />\n\"Just a few. In his last play he had real supes in the dinner sceneS\"<br />\n<br />\nI have such funny foolish thoughts,<br />\nThat when I'm with a crowd,<br />\nI guess 'twould make the fellows laugh<br />\nIf I should think aloud.<br />\n<br />\nt?<br />\nBILL—Did you hear that Sporter had become a Christian Scientis<br />\nTom—No, why?<br />\nBILL—So that he can try the Absent Treatment on his courses.<br />\n<br />\nFOR MEN ONLY.<br />\n•puan lan no puns 01 pun ans II<br />\n(monatuos 11 ie 132 p‘ans Atom' a/A<br />\nmaod Stj1 1811I<br />\n'peal XpEa.tiu s Lans<br />\nslnuq2nop 01 sluilop lan ol 2ullitivi aI,am<br />\n•moqs u Jo apuns uant2 ji<br />\n‘motiatuos ino U pug mans laq am. puy<br />\n‘moul 01 ion ;Ono atis q3ppiti turp Limp aallag<br />\ntutitou s‘atatu<br />\nlno pug 01 tu pinom 11<br />\nThe Krishno.<br />\n<br />\nthe Americans during the<br />\nTEACHER-\" What distinguished foreigner aided<br />\nRevolution ?\"<br />\nJOHNNY—(after thinking hard) —\" God.\"<br />\n<br />\n\fApluvia and Cravenette Rain Coats<br />\nAre Suitable and Correct for Wear on all occasions and in all Weathers<br />\nNiC)I<br />\n<br />\nJ<br />\n<br />\ngag<br />\n<br />\nNICD CD=CD,1\"<br />\n<br />\nWILL SHED RAIN PERFECTLY.<br />\nManufactured by<br />\n<br />\nCHESAPEAKE RUBBER COMPANY,<br />\n<br />\n321 W. Baltimore Street.<br />\n<br />\nEE31E<br />\n<br />\n&<br />\n675 West Baltimore Street,<br />\nBetween Arch and Pine Sts. Baltimore, Md.<br />\n<br />\nWEST BALTIMORE LOAN CO.<br />\n<br />\nLiberal Advances on Merchandise of every Description. WATCHES AND DIAMONDS A SPECIALTY.<br />\nFROM T A. M. TO S P. M.<br />\nSATURDAYS UNTIL 10 P<br />\nSIDE ENTRANCE WITH PRIVATE WAITING ROOM.<br />\n<br />\nOPEN<br />\n<br />\nSMITH, DIXON a CO.<br />\n<br />\nir) F'R-PER<br />\n29-31 S. Charles St.<br />\n<br />\nA, H. FETING<br />\n<br />\nPlutures<br />\nppAnn,NDin n<br />\n<br />\nF3altinum'e, Md.<br />\nMANUFACTURER<br />\n<br />\nI Winn.<br />\n<br />\nM<br />\n<br />\nFRANKE &<br />\nPURNELLCO.<br />\n224 N HOWARD Sr.<br />\n<br />\n•r<br />\n<br />\nOreeh %dater<br />\njfraternitp jewelrv.<br />\n<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\n•LEA•IC CALL AND EXAMINE OUR<br />\n<br />\nLINE REFORE<br />\n<br />\nMUPICH••ING.<br />\n<br />\nJ. H. ROBINSON.<br />\nMANUEACTURRE OP<br />\n<br />\n• FINE• CIGARS.*--DMA JLIEK IA<br />\n<br />\nToriw000,<br />\n<br />\nItH AND SMOKERS. ANPIOLIDM,<br />\nSTATIONERY.<br />\n<br />\nFINE<br />\n<br />\nBonbons, GlioGolates,<br />\nCONFECTIONS.<br />\nFRESH EVERY HOUR.<br />\n<br />\nSENT BY MAIL OR EXPRFSS.<br />\n<br />\nLi EAST BALTIMORE STREET,<br />\n<br />\n626 N. ETJTA W ST.<br />\nBALTIMORE. MD.<br />\nBaltimore, New York & Philadelphia Papers.<br />\nC. & I'. Public Telephone, Madison 11.851'.<br />\n<br />\nDesigning and Cutting by E. Michaelson.<br />\n<br />\nMIGIVIELSON,<br />\nMERCHANT TAILOR,<br />\nPOPULAR PRICES.<br />\n<br />\nALTERING AND REPAIRING<br />\n<br />\n821 rladison Avenue,<br />\nSpecial discount to Students.<br />\n<br />\nBUTIMORIE., MD.<br />\n<br />\nA. D. SMITH & SONS,<br />\nFoimerly<br />\nLEVERING & SMITH,<br />\n104 WEST LEXINGTON S1 REET.<br />\nREADY TO WFAR HATS for Ladies, MISSOM<br />\nand Children.<br />\nIn the Latest Designs.<br />\nMEN'S HATS • Derbys end Soft Felts.<br />\n<br />\nUNIVERSITY CAFE.<br />\nCHAS. LINDENME VIM, Prop.<br />\n<br />\nCHOICE WINES, LIQUORS AND CIGARS<br />\nRAW BOX NOW OPEN.<br />\n506 NORTH EUTAW STREET.<br />\nLadies' and Gentlemen's Dinin g Rooms.<br />\nMr,a18 Served at ail Hours.<br />\n<br />\n\fThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\nN. E. Cor. Charles and Fayette Sts.,<br />\n<br />\n'Phone, C. & P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br />\n<br />\nOSTEOPATHY<br />\nIs a scientific, adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic DigOaReS and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nMARTA BUIE, D. 0.,<br />\nV.-Prest. & Asst. Sooty.<br />\n<br />\nW.D. BOW IN, M. D., D. 0.,<br />\nPrest. & Mgr.<br />\nESTABLISHED 1079.<br />\n<br />\nadding Silver holiday<br />\nIN (MCAT VANICTY.<br />\n<br />\n'JACOBI 45k JE4/%1KINS,<br />\n215 N. CHARLES ST.<br />\n<br />\nSilversmiths.<br />\n<br />\nR. MoMAINS, D. O.,<br />\nSec`y. & Treas.<br />\n<br />\nTHU°. WARNER.<br />\nlames it. Pinta.<br />\nNATA..FZINIR 8c(DO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgent for Lincoln& Bennett and<br />\nWalter Barnaro's London Hats.<br />\n824 WEST IIAL/PIMORP3 STREET.<br />\nManufacturers of<br />\nSilk and Cassonere Hats. W. HOPKINS CAPS<br />\n<br />\nCUSIENG & COMPANY,<br />\n<br />\nlienderson's •Ps<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books. Note Books.<br />\nMadison &HowardSts.<br />\nStudent's Supplies.<br />\n<br />\ns. and<br />\n<br />\n34 W. BALTIMORE ST.<br />\nSCHOOL, Law MAI:010AL, CLASSICAL AND MISCELLANEOUS 110/011111<br />\nKeeps constantly on hand the Text Books used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\nwi•••<br />\n<br />\nCertificate of Analysis from<br />\nPeofs. G. W. Lehman & Son,<br />\n<br />\n11. R. EISENBRANDT SONS,<br />\n<br />\nJORDM<br />\nSTRBLER GO. Thi 1)) SO \"Isv,.<br />\nReads as follows: Samples submitted of<br />\n<br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n<br />\nfor<br />\n<br />\nFrench Brandy—no adulterants, no coloring,fine quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive<br />\ntests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\n<br />\nstrong.<br />\n<br />\nNix Ground Spices—no adulteration, all strictly pure.<br />\n<br />\n20I-203 N.CHARLES ST.<br />\n<br />\nBALTIMORE, MD.<br />\nCharles T. Crane,<br />\nPresident.<br />\nCarter G. Osburn,Cashier.<br />\n<br />\nOtto H. Williams,<br />\nVice-PresidtaL<br />\nJ. F. Marshall, Asst, Cashier.<br />\n<br />\nFOR ADVERTISING SPACE IN THIS PAPER<br />\n<br />\nFARMERS & MERCHANTS NAT'L. BANK,<br />\n<br />\nAPPLY TO<br />\nPEARRE E. CRO1A/L COMPANY,<br />\nPUBLISHERS.<br />\n<br />\nSouth and Lombard Ste., Baltimore.<br />\nSurplus and Profits 5450.000.<br />\nCapital, 5650,000<br />\n<br />\nLIGHT AND LOMBARD STREETS<br />\n<br />\nBALTIMORE. MD.<br />\n<br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br />\n<br />\nCOLLECTIONS A SPECIALTY.<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nFor particulars apply to<br />\n<br />\nCORRESPONDENCE INVITED<br />\n<br />\nNEW YORK TO BREMEN.<br />\nLONDON, PARIS,GiBIZALTER.<br />\nNAPLES, GENOA. ETC.<br />\n<br />\nA.SCHUMACHER & CO.,<br />\n<br />\nBALTIMORE TO BREMEN<br />\n<br />\nGeneral Agents.<br />\n<br />\nDIRECT.<br />\n<br />\n\fMANDOLIN. GUITAR AND BANJO<br />\nY AAAAA<br />\n<br />\nthe litrany-Sniftb<br />\npiano CO.<br />\n<br />\nJe Ji<br />\n<br />\nsr<br />\n<br />\nC. J. LEVIN,<br />\nwho has made a life study of these Instruments. Mandolin Soloist of National reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br />\n<br />\nStudio, 331 N. Charles St.<br />\n<br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br />\n<br />\nfisfeniritz Studio<br />\n<br />\nCbtchering, Erabburp ant' illaebster<br />\n<br />\nSuccessor to Cummins<br />\n<br />\nBaltimore<br />\n<br />\n20 West Lexington St.<br />\n<br />\n!pianos.<br />\n<br />\n.st .4<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n<br />\nC.& P.'Phone 2322-2.<br />\n<br />\n%oh<br />\nFactory Prices.<br />\n<br />\nSpecial Discount to Students<br />\n<br />\nTHE BLAKE CO<br />\n<br />\nHABERDASHERS.<br />\n<br />\nShirts, Neckwear,<br />\ns Underwear, Hosiery,<br />\nEtc.<br />\n<br />\nON SALE THE J. H. U. PENNANTS,<br />\nand all other College Pennants<br />\n<br />\n203W.BALTIMORE ST.& 2 S. LIBERTY ST.<br />\nBALTIMORE, MD.<br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange;<br />\nChicago Board of Trade ,<br />\n<br />\nClinton P. Paine<br />\nGordon P. Paine<br />\n<br />\nCLINTON P. PAINE c& CO.,<br />\nBANKERS & BROKERSStreet<br />\n<br />\nPrivate Wires to<br />\nNew York and Chicago<br />\n<br />\n217 E. German<br />\nBALTIMORE, MD.<br />\n<br />\nThe Chas. Willms Surgical Instrument Company<br />\nBENJ. A, NELSON, GEN. MANAGER<br />\n<br />\nPhysicians,' Burgeons,' Hospital and Invalid Supplies,<br />\nPine Microsoopes and Accessories,<br />\nBaltimore, Md.<br />\n<br />\n3043 N. Howard St.,<br />\n<br />\nDrovers and Mechanics National Bank,<br />\nOF BALTIMORE, MD.<br />\n<br />\nCapital Stock,$300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br />\nTRINE IT OVER.<br />\n<br />\nYOUR Elif„S<br />\n<br />\nSAYRE OPTICAL COMPANY,<br />\n221 North Charles Street. (Masonic Temple.)<br />\n<br />\nOPTICIF*NS.<br />\nTHE NEWS LETTER<br />\n<br />\nSMITH'S s\"TAT'BggliirE<br />\nOLD<br />\nBOOK<br />\nN. HOWARD STREET,<br />\nSTORE<br />\n3rd door from Madison.<br />\n805<br />\n<br />\nBOOKS<br />\n<br />\nOLD AND NEW<br />\n<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks Bought, Sold and Exchanged .. ..<br />\n6o5 N. Eutaw Street.<br />\n<br />\nWM. V.PIPPEN,<br />\n<br />\nA. H Rutherfoord.<br />\nF. Lentz.<br />\n<br />\nJ. Wm. Middendorf,<br />\nA.J. Robbins.<br />\n<br />\nJ. WM. MIDDENDORF & CO.<br />\n113anhere & Vrohers.<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nMembers<br />\nBaltimore Stock Exchange.<br />\n<br />\nBaltimore, Md,<br />\n<br />\nB. G. ElCHELBERGER,<br />\nBooms AND STATIONBRY<br />\nENGRAVING AND STAMPING.<br />\n<br />\ne<br />\n<br />\n1441c.k 30E3 INT.:as-Th. Cimr-lete<br />\nY. M. C. A. BUILDING,<br />\nBALTIMORE, MD.<br />\nC. Az P. and Md.'Phones.<br />\n<br />\nCALL ON<br />\n<br />\nJR'S. It. DOWNS,<br />\n229 N. Gharies St.,<br />\nMASONIC TEMPLE.<br />\n<br />\nFOR Class, Fraternity and College Stationery,<br />\nBanquet Cards, Invitations, Diplomat',<br />\nPrograms, Visiting Cards, etc.<br />\nOur 50o J. B. U. Blue and Black Plan Paper—now readu<br />\nThera Is varg little entertainment at home without a Plano<br />\n<br />\nis from the Press of<br />\n<br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nLight and Lombard Streets,<br />\n<br />\nBALTIMORE<br />\n<br />\nWe carry a full line of Students' Note Books and Stationery<br />\nBoth 'Phones.<br />\n<br />\ncTIEFF<br />\nzplANos<br />\n<br />\nfire The Best.<br />\n<br />\n9 N. Libertu St.<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol. VI. No. 9<br /><br />\nFEBRUARY 12, 1902.<br /><br />\nJOHNS HOPKINS UNIVERSITY.<br /><br />\nTile J01111$ Hopkins Press.<br /><br />\nSIALTIMORI.<br /><br />\n.11•1110.11.0<br /><br />\nT.<br /><br />\nTwenty-410A fear.<br /><br />\nBeginning October 1st, 1901.<br /><br />\nPresident,<br />\n•<br />\n•<br />\n•<br />\nDean of the Medical School,<br />\n.<br />\nDm» of the OoMug.<br /><br />\nIRA fiRMSEN.<br />\nWM.II. HOWELL.<br />\nROW. H. ORIYFIN.<br /><br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(11) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.; coureds for physicians.)<br />\nFor Undergraduates:<br />\n(e) As oandidates for the degree of 11. A.<br />\n(d) As special students.<br /><br />\nLibraries of Baltimore.<br />\nUniversity<br />\n.<br />\nPeabody institute<br />\nPratt Library<br /><br />\n100,000 volumes.<br />\n135,010 volumes.<br />\n..:00.000 volumes.<br /><br />\nLaboratories.<br />\nchemistry,<br />\nPhysics,<br />\nfleology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,:<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br /><br />\nDirectors.<br />\nhn Bentsen.<br />\nJoseph S. Ames.<br />\niVWLeens H. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam ester.<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith. Maurice Bloomfield<br />\nPaul Haupt.<br />\nlienry Wood.<br />\nA. Marshall. Elliott.<br />\nJaniem 11'. Bright.<br />\nJ. M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nUndergraduates Courses (leading to B. A.)<br /><br />\nAsiorlom Jouraal of IllaIlionsatloa.<br />\nP. MORLEY,Editor. Quarterly.Ito. Volume XXIV<br />\nin progress. IS per rolumo.<br />\nII. American Chemical Journal.<br />\nI. REUBEN, Editor. Monthly. lye. Volume XXVI<br />\nin progress. $5 per volume.<br />\nHI. American Journal of Philology.<br />\nB. L. GILDERSLREVR, Editor. Quarterly. live.<br />\nVolume XXII in progress. $3 per volume.<br />\nTV. Studies from the Biological Laboratory. 8vo.<br />\nVolume V complete. $6 per volume.<br />\nV. Studies in historical and Political Science.<br />\nMonthly. 8vo. Series XIX in progress. $8 per<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. lto. Vol. XX in progress. Si per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly. Pe.<br />\nVolume XII in progrem $1 per year.<br />\nVIII.Johns Hopkins Hospital Reports. 4to. Volume X<br />\nin progress. $6 per volume.<br />\nIX. Contributions to Assyrtology and Comparative<br />\nSemitic Philology,(ileitrage zur Asmyriologie,etc.)<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.$7.00<br />\nper volume.<br />\nXI. Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVI in progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Hi-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity,<br />\nHENRY M. HUR D, Editor. Quarterly. Ito.,$5 per<br />\nvolume.<br />\nXTV. Reports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK,Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric, Kleetrleity.<br />\nL. A. BAITER, Editor. Quarterly.<br />\nEivo. Volume VI in progress. $2.60 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Truetees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br /><br />\nGroups.<br />\nClassical the \"Old College Course.\")<br />\nit Mathematical(leading up to Engineering.)<br />\nS. (hemical-Ili()Ii gieal.<br />\n(leading up to Medicine.)<br />\n4. Heological-ihological.<br />\n$. Latin Mathematical.<br />\n6. Historical-Political.<br />\n_(leading up to Law.)<br />\nf. Modern Languages.<br />\nSerial Publications.<br />\nEditors.<br />\nMathematics(vol. XXI V.)<br />\nFrank Morley.<br />\nChemistry (vol. X XVI).<br />\nIra Itemsen.<br />\nPhilology (vol. XXII.)<br />\nBasil L. Gildersleeve.<br />\nHistory vol. X X.)<br />\nJ. M. Vincent.<br />\nModern IianguigeS (Vol.. XVI.) 4. Marshall Elliott.<br />\nBiology (vol. IV.)<br />\nWiiiinra K. Brooks.<br />\nA ss3 riology (vol. IV.)<br />\nPaul Haupt.<br />\nExperimental Medicine(vol. VI.) W. H. Welch.<br /><br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photograph of the Normal Solar Spectrule10 plates. $20.110<br />\nDescription of the Johns Hopkins Hospital. .1. S. Billings, Editor. 116 pp. 4to. t6 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fee-simile edition. Edited by J. Ronde! Harris. 110 pp. 4to. 10<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MBA. with Antilegoinetut Epistles. Edited by I. H. Hall. $8.00.<br />\nBlbliographia Flopkinsiensis. Part I. Philology. Pori<br />\n,<br />\n11-Ill. Chemistry, Mineralogy and Geology. Parts<br />\n1V-V-VI.Physics, Astronomy and Matiaematios.<br />\n8 vo. 80 cents per part.<br />\nR full list of publications will be sent on application.<br /><br />\nProgrammes of the Courses offered to graduate students in Philosophy and the Arts, and in the School of<br />\nMedicine,and also of the Undergraduate or Collegiate<br />\nVourses, will be sent on application to the Registrar.<br /><br />\nGommunications in respect to exchanges and remittenosS<br />\nmay be sent to Johns Hopkins Press, Baltimore, Md.<br /><br />\nTHE NEWS-LETTER.<br />\nFEBRUARY 12, 1902.<br /><br />\nNo. 9.<br /><br />\nBY A DEGREE.<br />\nNE evening, twenty years ago, I was about to close my office and try to<br />\nforget that there was such a thing as medicine, doctors, or sick people.<br />\nThis should have been a very easy matter, for since my graduation from<br />\nthe medical school I had had the usual actual experience with the above-mentioned necessities to a doctor's success. But my day was not to be so uneventful as I had expected. Just as I was locking the cover of my desk, I heard a<br />\ngreat \"Hello!\" sounding through the ball. Then without the ceremony of a<br />\nknock, my old friend, Jim Henderson, stalked into the room. Jim was a very<br />\npleasant chap, what the boys called \"a good fellow.\" We were very fond of<br />\neach other. Playmates in our childhood, four years of college had cemented our<br />\nfriendship; nor could the varying duties of law and medicine lessen it. There<br />\nwas, however, a tacit agreement that Jim was not to visit my office. There was<br />\nno idea of professional dignity about Jim, and suppose a patient should come<br />\nwhile he was in the office? Naturally, I awaited an explgnation. Though he<br />\nseemed to be in no hurry, yet I felt something must have been wrong, for Jim<br />\nhad not given me one \"tip\" on the races or told me of the \"easy thing the<br />\nUnknown would have with the Etheopian.\" I waited. He cogitated. The<br />\nstillness was becoming tragic. Then he deigned to speak. \"I was walking<br />\nabout dreaming, and it seems somehow or other here I am.\" This wasn't<br /><br />\nO<br /><br />\nJim's usual style.<br />\n\"Tell me what's the matter. You're acting just as you used to at college<br />\nwhen the boarding-house keeper's fair daughter gave you the jilt in favor of the<br />\nmilkman.\"<br />\n\"Something serious has happened to me. I have been foolish enough to<br />\nfall in love with a girl whose fortune is quadruple my own.\"<br />\n\"Not so very unfortunate,\" I murmured, thinking of office-rent falling due.<br />\n\"She seems to reciprocate my feelings. When I told her of my love, it was<br />\nbeautiful to see the blush suffuse her cheeks, to see the furtive tear, the quick,<br />\nexcited breath. Oh! how beaut\"—. I thought it was time to call a halt.<br />\n\"To the point, man. Where's the snag?\"<br />\n\"Coming to it,\" he growled. \"Where did I leave off?\"<br />\n\"Never mind about that,\" said I, \"give me the gist of the story.\"<br />\n\"Well, Emily was well pleased. It was the father. Emily's father is a<br />\nbusiness man, and can view things only through the eyes of the 'street.' When<br />\nI told him of my love for his daughter, he grunted, looked me over as if I were<br />\na consignment of tea, grunted again. Then, in the most cold-blooded way<br /><br />\nTHE NEWS-LETTER.<br />\nimaginable, he asked me who I was, asked me if I could support a wife. I<br />\nremonstrated, told him that his daughter seemed willing to take all risks; and<br />\nspoke of our reciprocal affection. I did not seem to be making much of an<br />\nimpression. I told him that it was cruel to separate two loving hearts; and<br />\nthat he did not know his duty as a father. That was the straw that broke the<br />\ncamel's hack. I don't know how it came about, hut I was ushered from the<br />\nroom with neatness and dispatch by the shortest route.\"<br />\n\"Really,\" said I, making a vain attempt to he facetious, \"I am not a<br />\nmender of broken hearts. Your case is one for a spiritual adviser. Tell me,<br />\nwho is this irascible Croesus?\"<br />\n\"John Koleman is the 'pater' and I am the humble slave of his daughter,<br />\nEmily.\"<br />\n\"A peculiar coincidence,\" I exclaimed; \"I am family physician to Koleman's household. We are very good friends \"<br />\n\"That doesn't help me very much, does it, old man?\"<br />\nI was obliged to confess that the status quo was as before. But I added<br />\nthat I would think about the matter, and see what I could do to help him. Jim<br />\nleft the office in no pleasant mood. I was thinking harder than I had ever had<br />\ndone before. I turned over many schemes in my mind, but somehow nothing<br />\nseemed feasible. A sudden happy thought struck me. No sooner thought<br />\nthan I was writing a letter which, if it did not mean absolutely certain success,<br />\nconveyed some degree of hope. This is the letter I wrote to Jim:<br />\nDEAR OLD PAL:—<br />\nYou have made me waste more brain-tissue over your little affair than I<br />\nhave wasted since we worked into the small hours over our \"conics.\" I have<br />\ndecided upon a plan which may possibly be instrumental in gaining for you<br />\nyour heart's desire. I do not wish you to put too much confidence in the<br />\nscheme, as I consider it only the straw at which the drowning man grasps. My<br />\nplan is Machiavellian; hut it requires histrionic ability on the part of Emily, a<br />\nfair amount of parental weakness on the part of \"Pater,\" a great deal of deceit<br />\non your part, and a surrender on my side of all the ethics of my profession.<br />\nHere goes for my scheme, and may the gods be propitious. I told you in my<br />\nlast unsatisfactory talk that I stood in the relation of family physician to the<br />\nKoleman family. Then I little thought that this fact would have anything to<br />\ndo with your future—and maybe it won't. In some way or other manage to<br />\nsee Emily. Then tell her that if she wishes to trot the earthly road of marital<br />\nbliss, to feign sickness. Tell her to make it a high fever—a very high fever.<br />\nWhen she reaches that state, instruct her to become delirious. In her<br />\ndelirium tell her to call for you, in fact, to waste away for want<br />\nof you. I will come to the house; look grave. I will tell Mr.<br />\nKoleman that, unless you are allowed to see Emily, her chances for<br />\nimmediate immortality are Al. If my experience with fathers has given<br />\nme any wisdom, I will warrant that this permission will be granted. Although<br />\nhe will probably ask if a change of air would not answer every purpose, I will<br />\ninsist. You will be admitted to the house. When you come to her bed-side,<br />\nlet grief and worry, and the traces of sleepless nights be upon thy brow, 0,<br /><br />\nTHE NEWS—LETTER.<br /><br />\n3<br /><br />\nunhappy one, and let a sigh arise from the depth of thy soul and shake Olympus: Then you will gently caress her forehead, and a smile as if listening to a<br />\nchoir of angels will o'er spread her countenance. Then, 0, heavenly sound,<br />\nshe will whisper in dulcet tones—\"Jim. are you here? Now I can die in peace.<br />\nDo not grieve Jim, I am going to a better world than this.\" If\"Pater\" weeps<br />\nduring this affecting scene, it probably means success. I will prescribe continued applications of yourself for about a week. Then Emily will convalesce.<br />\nDuring the weary hours of convalesence you will be most assiduous in your<br />\nattention. A little attempt to become popular with father would not be out<br />\nof place. I hope that Mr. Koleman will then see what curative powers true<br />\nlove has. Then, possibly,\"Pater\" will give his consent to the match, and all<br />\nwill be happy as in the story-book. But remember, old man—<br />\nHope springs eternal in the human breast,<br />\nMan never is, but always to be blest;\"<br />\nso don't put too much confidence in my scheme. It is a chance worth taking.<br />\nGood luck to the scheme.—JAcK.<br />\nWell, I waited impatiently for the 'Phone to give me a hurry up call to<br />\nthe Koleman household. In about two days it came. Of course I hurried<br />\nup and found Emily in a high state of fever. Father was worried and nervous.<br />\nEmily had been calling for Jim all day. He didn't know what to do. Then I<br />\nput on a highly sensorious air. \"Mr. Koleman,\" I said severely,\"Would<br />\nyou allow the life of your daughter to be jeopardized by the demands of conventionality. If Emily called for Jim in her delirium, Jim must be sent for.\"<br />\nKoleman demurred slightly, but was forced to acquiesce. Then the crisis<br />\napproached. Jim came to the house. How haggard he looked, poor fellow !<br />\nHow gently he touched Emily's fevered brow! How peaceful she looked.<br />\nThen came the pseudo death-bed scene, and \"Pater\" wept. After those<br />\nwelcome tears everything went along smoothly. Marriage, happiness and long<br />\nlife. Jim never told Koleman of our ruse. I noticed that when Jim and<br />\nEmily's daughter reached eighteen and was stricken with fever, another physician prescribed. I think Jim and Emily were right.<br />\nX. 1903.<br /><br />\nPICKED UP ON THE MOVE.<br /><br />\nP•<br /><br />\nA little book called \"Student Life,\" seen on the new book department's<br />\nshelf in the main library of McCoy Hall, contains some interesting statistics<br />\nconcerning the development of student life and the advance of student enterprises at American colleges. The only branch of work done at Hopkins that<br />\nis mentioned in the little volume is the course in public speaking and the pro<br />\ngress of the student debating assemblies which have been so successfully carried oil here. As the Hopkins was one of the first pioneers in the field of allowing the students to organize into self-governing assemblies to practice forensics and the art of public debate, our student Congress has been the model for<br />\nmany others in the country. Allowing for the expected amount of trifling in such<br />\nbodies, the work done every year is good, as is demonstrated by the excellent<br />\narticle of debate put up by both sides in the annual interclass contest. The<br />\nwork is not ideally perfect, but it is carried on by young men—and young men<br />\nare not ideally perfect.<br /><br />\n4<br /><br />\nTHE NEWS—LETTER.<br />\nNOTICE, UPP ER CLASSMEN I<br /><br />\nN two weeks, on the night of February 27, the Interclass Debate takes<br />\nplace; subject: \"Trusts.\" You are all interested, and you will all attend.<br />\nBut there is a more active way for you to give the debaters your help, and<br />\nthis help is much needed. On each team a few men are trying for the places of<br />\nadvisers—reading up on the subject of debate, making notes of new ideas for<br />\nargument or refutation, and consulting with the chairmen of their respective<br />\nclass teams. This kind of interest is easily shown ; at the same time, it is<br />\nof great value to all concerned in the contest. Especially is this the case in the<br />\npreparation of the written speeches.<br />\nSo here is a call to each Senior and Junior—Get to work! you would not<br />\nfail to do your best in a class rush, or cane party, or tug-of-war, and this is a<br />\ncontest in which you can aid just as materially. You are interested in Trusts ;<br />\nsome day you might make money out of one. Finally, by raising the quality<br />\nof the work which is to be done on the 27th, you will make it more possible for<br />\nthe Hopkins to down her coming opponent, the University of North Carolina.<br />\nThe chairman of the teams are: Senior, Markell; Junior, Blum.<br /><br />\n3<br /><br />\nTHE CONCERT ON FRIDAY.<br />\nthe<br />\nhe importance of the concert to be given in Lehman's Hall, on Friday night,<br />\n,February 14, has been already mentioned in the previous issue of the<br />\nNEWS-LETTER. As was then stated, the support that the student body<br />\nand the faculty give this concert will determine its success. The men on the<br />\nclubs have been giving all their spare time to rehearsals, and there is no doubt<br />\nthat the concert from a musical standpoint, will be excellent. The songs are<br />\nwitty, and the harmony would please the most aesthetic ear. The Banjo Club<br />\nhas some snappy music, regular foot-moving \"rag-time.\" Then after the<br />\nexhaustion of keeping up to this music,the Mandolin Club soothes the tired soul<br />\nwith selections from \"Florodora.\" What more can be desired. Surely the<br />\nwhole student body should attend. More than this could not he had at even<br />\nthe theatres, where only standing room can be had for the price of admission to<br />\nthis concert. It might also be mentioned that one hundred and eleven (111)<br />\ncollege girls from the Woman's College will be present, and seats near this<br />\ndelegation will go to Hopkins fellows.<br />\nThe men who will take part in this concert and the organization of the<br />\nClub are as follows:<br />\nPresident, Andrew R. Bird, G. Manager, Eben C. Hill, '02.<br />\nGLEE CLUB—Leader, J. HOWARD EA(IER, G.<br />\nFIRST TENORS—J. A. E. Eyster, W. B. Carver, G. C. D. Cowles, M. H. H. Humriehouse, '04.<br />\nSECOND TENORS—J. M. Wright, G. F..T. Hall, M. T. J. Stubbs, G. E. B. Beasley, '02.<br />\nJ. M. Nelson, Jr., H. A. Converse, G.<br />\nFIRST BASSES.—J. H. Eager, G., R. Z. Thomas, G., F. R. Ford, G., J. N. Myers, '(2,<br />\nE. C. Hill, '02.<br />\nSECOND BASSES.—P. K. Oilman, M., S. T. Mason, '02, C. A. Marshall, '03, A. R.<br />\nDochez, '03, J. A. Sayler, Jr., '01.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n5<br /><br />\nMANDOLIN CLUB—Leader, WILTON SNOWDEN, JR., '03.<br />\nMANDOLINS—H. I. Cross, G. W.B. Moulton, M J. T. England,'02. W. Snowden Jr.,<br />\n'08. R. C. Pagon, '03. W. K. Koppleman,'02. A. Pearre, Jr„ '02. F. H. Hall, M.<br />\nVIOLINS—T. M. Nelson, Jr., '03. R. S. Lanier, '03.<br />\nOLARINETTE—A. R. Dochez, '03.<br />\nBASS BANJO—J. H. Eager.<br />\n'CELLO—E. C. Hill,<br />\nTRAPS.—S. T. Mason, '02.<br />\nBANJO CLUB—Leader, CHARLES A. MASHALL,'03.<br />\nBANJEAURINES.—S. L. Mason,'03, C. A. Marshall, '03, R. S. Lanier, '03, V. E. Smith,<br />\nGT., W. Snowden, Jr., M. W. Hendry, '03, W. 0. Murkland, '03, R. N. Jackson, '05.<br />\nBANJOS.—J. W. Bryan, '03, J. A. Eager, G., H. N. Baetjer, '03.<br />\nGUITARS.—H. A. Converse, G., E. G. Martin, G., T. G. Cook, '02, F. Hazlehurst, Jr.,<br />\n'03, E. C. Hill, '02, L. C. Murphy, '02.<br /><br />\nSOME VERSES THAT OMAR KHAYYAM MIGHT HAVE<br />\nWRITTEN--BUT DIDN'T.<br />\nI.<br />\nNo Sage of Oriental lore can tell,<br />\nNor any man who sips at Wisdom's well,<br />\nWhat is the meaning Diabolical<br />\nContain'd in a terrific College yell.<br /><br />\nThe Grape that can dispel our deepest care<br />\nWhen we are tired of climbing Learning's stair<br />\nLeaves the same head-ache on the morrow's Dawn<br />\nWhich we would have, had study been our fare.<br />\nWhen you do see the Rathskeller's red light,<br />\nPeep not within, my son, to see the sight,<br />\nBut turn your eyes demurely on the ground.<br />\nWithin, the Undergrads are getting tight.<br />\nIV.<br />\nMy son, let not a Cloud on your brow fall<br />\nWhen you are in examination Hall;<br />\nYour paper's short, but pity the poor Prof.,<br />\nFor he it is who has to read them all.<br />\nV.<br />\nThere are few Things that you can trust, I Ween,<br />\nBut these three least; the elevator mean,<br />\nThe weather bureau's Flag when it cloth fly.<br />\nAnd the strange ways of Christhilf's slot-machine.<br />\nVI.<br />\n'T is not the Man who yells the most, my son,<br />\nWho is crowned Victor when the race is won.<br />\nIn strife beware the strength of Silent men,<br />\nThey are the Masters when the course is run.<br />\nH. K. T.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br /><br />\nFEBRUARY 12, 1902.<br />\nSubscription $1 50 per year.<br /><br />\n.<br />\nEditor in Chief,<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nArt Editor,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\n10 Cents a single copy.<br /><br />\n.<br /><br />\nSOL STROUSE, 1902.<br />\n. EBEN C. HILL, 1902.<br />\nROBERT S. LANIER, 1903.<br />\nW. S. BIRD, 1903.<br />\nHARRY K. TOOTLE, 1903.<br />\nJOHN A. SLEMONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\nCHARLES F. RANFT, 1902.<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1903.<br />\n.<br /><br />\nAddress all articles, communications, etc., to SQL STROUSE, box 567, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\n0 many requests have been made for an occasional sprinkling of fiction on<br />\nthe leaves of the NEWS LETTER that we have complied by publishing the<br />\nshort story written by a member of the University. We do not, however,<br />\nintend to make a violent change in the character of the NEWS-LETTER, except<br />\nperhaps by more or less frequent repetitions of issues similar to this; for we<br />\nthink that the sphere which the Nnws--_,LETTER now covers is the proper one for<br />\nthe only college paper at the University. After an unbiased consideration of<br />\nwhat such a paper ought to be and what the Nnws LETTER is, we think that<br />\nthis statement will be found justifiable. The only paper at a college should<br />\nundertake to reflect college life in all its phases, and to do this it must combine<br />\nin its pages the contents of four or five fields. It must to a certain extent be<br />\nliterary; it must contain athletic accounts and news articles; it must reflect<br />\nstudent thought; and it must be original. The NEWS-LETTER during the past<br />\ntwo years has always striven to completely cover the ground of news review; it<br />\nhas always had a fair sprinkling of original matter; and its editorials have<br />\nattempted to reflect student thought. Perhaps the literary side has been somewhat neglected; which is the re ison for publishing the present issue as it is.<br />\nIf we receive short studies of a high standard, we will probably repeat the<br />\nnatu!e of this issue later; hut short stories and poems are the only \"literature\"<br />\na college paper should handle. We do not want abstract essays or bookreviews,—two kinds of composition too often seen in college magazines.<br /><br />\n0<br /><br />\nTHE NEWS-LETTER.<br /><br />\n7<br /><br />\nt<br /><br />\nHE revival of interest in base-ball at the Hopkins calls for some very plain<br />\nstatements. For the last two or three years base-ball has been a failure<br />\nat Hopkins, and the cause of the failure has generally been in the baseball men themselves. Before the student body as a whole can be interested in<br />\nthe sport, the players must be interested—a state of affairs which the cage prac..<br />\ntice the, last two years did not demonstrate. This year the state of affairs is<br />\ndifferent. According to the statement of Captain Campbell, the men who have<br />\npledged themselves to support the team are all base-ball enthusiasts of tried<br />\nstandard, and men who are not and would not be interested in track or lacrosse<br />\nwork. The list of names certainly is encouraging to those who love the sport,<br />\nand in Captain Campbell the team has a leader who will permit no irregularities<br />\nin practice, will allow no falling in interest. Thus in view of past failures,<br />\ncontrasted with the present outlook, we think the midway course of the Athletic Association justified. Everything now rests with the supporters of the<br />\nmovement. If they can keep base-ball on the level of our lacrosse and track<br />\nteams, can play the larger colleges, and, above all else, practice regularly, we<br />\nsee no reason why base-ball should not again establish itself at Hopkins. The<br />\nspirit of the base-ball enthusiasts, however, must be better than it has been, or<br />\nthe game will deserve to be only a remembrance here.<br />\nRESIDENT REMSEN'S address to the students at the Feed was noticeable from two standpoints: the condition under which the address was<br />\nmade—and the contents of his remarks. As this was the first time Dr.<br />\nRemsen, as president of the University, had an opportunity to speak before a<br />\nstudent gathering, he took full advantage of his opportunity to show where he<br />\nstands in relation to the undergraduates. Dr. Remsen spoke on subjects which<br />\nwere of intense interest to the students assembled, and which show that the<br />\nPresident will continue to demonstrate the consideration for the welfare of the<br />\nstudents which he first showed by the inauguration of \"family receptions.\"<br />\nThe value of a college club similar to the Houston Club of the University<br />\nPennsylvania<br />\nwas dwelt upon at some length by Dr. Remsen, who stated<br />\nof<br />\nfirst<br />\nopportunity<br />\nthe<br />\nhz! would enter a claim for a similar organization<br />\nthat at<br />\ncourse,<br />\nHopkins.<br />\nOf<br />\nwe<br />\nat<br />\nneed such a club here; and slight as the chances<br />\nundergrads<br />\nnow<br />\nare for the<br />\non the roll ever to enjoy the benefit of a Hopkins<br />\nStudent Club, we can be thankful for the time when our younger brothers—or<br />\nour heirs—will have the pleasure. Speaking thus to a body of men assembled<br />\nto celebrate victories on the athletic field, Dr. Remsen continued: \"Keep everything on a high level, and the Faculty will be with you.\" As the secret of<br />\nHopkins academic success has been the seeking after the ideally high, so has<br />\nour athletic success been won by honest, straight playing, and so must it continue. If we cannot keep everything off the low, mean plane of materialism<br />\nand on the high, clean level of true sportsmanship we do not want, and do not<br />\ndeserve, the support of the Faculty or of anybody else. The High Aim is the<br />\naim of all our athletes, and that is the only aim worth striving for. Hopkins<br />\nstudents always have guarded their athletic reputation with jealous care, and as<br />\nlong as free speech is allowed, the Faculty need not fear any smirch on the<br />\nathletic name of Johns Hopkins.<br /><br />\np<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nUTAILS of the celebration on February 21-22 are slowly crystallizing into<br />\ndistinguishable shape, and it is already apparent that the event this year<br />\nwill be the greatest date on the University calendar since 1876. As<br />\nstated in the daily papers of this city, Alumni will pour in Baltimore<br />\nfrom all over the country, and representatives will be present from the<br />\ngreatest American colleges, so that an inspiring association of educated men<br />\nwill give and receive honor at the Hopkins Quarter-Centennial. In comparison<br />\nwith, this assemblage of notables, the undergraduate body will play a small<br />\npart in the celebration; but the NEWS-LITTER wants to insist on the desirability of playing this part, however small or comparatively insignificant it<br />\nmight be, in a manner according to the surroundings. The students have been<br />\npromised proper attention and good seats during the celebration, but the exact<br />\nnature of the role they are to play has not yet been announced. It is hardly<br />\nnecessary to urge attendance at all the functions to which we are invited, for<br />\nanything but a full response by the students on this occasion would be a disgraceful exhibit of disinterestedness.<br /><br />\ngD<br /><br />\nTHE ADAMS' MEMORIAL MEETING.<br />\nN Wednesday afternoon, February 5, a large audience assembled in the<br />\nDonovan Room, McCoy Hall, to pay tribute to the life and services of<br />\nthe late Herbert Baxter Adams, professor emeritus of the University,<br />\nand for many years the head of the Historical Department. The orator was<br />\nProf. Richard T. Ely of the University of Wisconsin, and at one time a professor<br />\nhere.<br />\nProf. Ely spoke of Dr. Adams' early life, his years at Amherst College, at<br />\nHeidelberg, and at the Johns Hopkins University. He told of the active part<br />\nDr. Adams had taken in the organization of the American Historical Association, and other educational societies. \"Dr. Adams,\" he said, \"sincerely<br />\nbelieved that the education of the people was the first principle of democracy.\"<br />\nProfessor Ely read a number of eulogistic letters sent by friends, former<br />\npupils and associates.<br />\nIt was announced by President Remsen that the compilation of the Adams'<br />\nmemorial volume was well under way. The volume will open with a biographical sketch by Dr. John M. Vincent, acting head of the historical department, and for many years associated with Dr. Adams. This will be followed<br />\nby the address delivered by Professor Ely, and an article on Dr Adams recently<br />\ncontributed by Dr. Gilman to the Outlook. The volume will contain a complete bibliography of the works of Dr. Adams' pupils, an undertaking which<br />\nDr. Adams himself started.<br />\nBy direction of the board of trustees a bronze memorial tablet will be<br />\nerected soon on one of the walls of the room where the Adams Library will be<br />\nplaced.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n111111111111111fini1111111011,1111111111111111111111141111111111111111111$111111111111‘11111111111111111111111111111111111H11111111,11111111111111111111111111111111111111111111111111111111110111111<br /><br />\nf.<br />\n4:;11'11111t101111111011111111111111111111,11111r11111i11111111411111111111r111111111111111131111111111111i11111111111111111111111111111111111111111111111111111111/11111111111'11rt 1:;!..<br /><br />\nT the St. Johns' Alumni banquet, held February 5, President Remsen<br />\nresponded to the toast \"The Johns Hopkins University.\"<br /><br />\ngI<br /><br />\nYesterday afternoon Professor Moulton gave the last of his lectures on<br />\nAncient Tragedy. He spoke on \"The Theatre as the Church of Greece.\"<br />\nThe Reverend Walter Lowrie, M. A., late fellow of the American School of<br />\nClassical Studies in Rome, lectured Monday, February 10, in McCoy Hall, on<br />\n\"Sincerity in Religious Art.\" The lecture was given under the auspices of the<br />\nArchaeological Institute of America.<br />\nThe date of the Junior Class banquet has been definitely decided upon;<br />\ngiving way to the wishes of the athletic teams and the Musical Clubs, the<br />\nbanquet will be held on the evening of the twentieth of this month at the<br />\nHotel Marlborough. The committee having the arrangements in charge is<br />\ncomposed of Messrs. Addison, chairman, Smith, and Bird.<br />\nThe members of the Freshman Class relay team have received the class<br />\nnumerals as a reward for their gallant struggles against the Junior team. The<br />\nquestion now arises: Will the Freshman tug-of-war team likewise receive<br />\nnumerals?<br />\nAt a Freshman class meeting, Sifford Pearre was elected vice-president.<br />\nPlans for a class banquet were discussed. It was finally decided to leave the<br />\narrangement to a committee to be appointed by the president.<br />\nThe liquid air, which was to figure in Dr. Wood's lecture of Thursday<br />\nlast, failed to arrive in time; the plant in Washington had broken down,<br />\nthereby delaying shipments for a week at least. As soon as it is found<br />\npossible to have an illustrated lecture on this subject, notice will be posted.<br />\nTo most of the students this will be a valuable opportunity and perhaps the<br />\nonly one, to see this wonderful substance handled. A large crowd should be<br />\npresent.<br />\nThe Georgetown College Journal, reviewing the three prize literary efforts<br />\nby college graduates published in this month's Century, says: \"The prize<br />\nessay entitled \"Huxley as a Literary Man,\" by J. E. Routh, Jr., of Johns<br />\nHopins University, is the best of the three.\"<br /><br />\nTHE NEWS—LETTER.<br /><br />\n10<br /><br />\nHAS THE MILLION BEEN SECURED?<br />\nT IS now being persistently rumored that the long sought million has at last<br /><br />\n3<br /><br />\nbeen forthcoming. Confidence in the friends of the University has never<br />\nbeen lacking, and it seems now as if the magnificent Homewood estate will<br />\nsoon come into our possession. One of the most gratifying signs pointing<br />\ntoward the desired million is the speech delivered by President Remsen at the<br />\nPrinceton banquet. Alluding to the sympathy expressed for the llopkins<br />\nbecause of its poverty stricken condition, President Remsen said that pity was<br />\nunnecessary, that the Hopkins had always managed to get along, and always<br />\nwould be able to get along. He warned the audience that he would have sonic<br />\ninteresting announcements to make on the twenty second of February. All<br />\nthis augurs well for the future of the Johns Hopkins University.<br /><br />\nY. M. C. A. NOTES.<br />\nN Sunday, January 26, Mr. Robert E. Speer delivered a powerful \"Plea<br />\nfor Ignorance\" to the 300 college men of the city, who were present.<br />\nUnfortunately, Hopkins was far outnumbered by the other institutions<br />\nof the city.<br /><br />\nO<br /><br />\nThe regular monthly meeting of the Executive Council was held on Wednesday, February 5. Tho following five men were appointed delegates to the<br />\nStudent Volunteer Convention at Toronto, February 26 to March 2: Dr. H. L.<br />\nWilson, M. B. Graff, C. C. Grove, C. K. Edmunds, and J. A. Addison.<br />\nSunday, February 9, was the Universal Day of Prayer for Colleges, and<br />\nRev. Mr. H. C. Kirk, the new pastor of the Franklin street Presbyterian<br />\nChurch of this city, delivered a very helpful address.<br />\nDr. Howard A. Kelly, of the Medical School, is conducting morning prayers this week, and speaks briefly each morning in Levering Hall, 8.45-8.55.<br />\n\"God, as revealed by His Names,\" was the topic of the weekly prayermeeting on Tuesday, February 11, led by Mr. C. C. Grove, Mathematics.<br /><br />\nAMONG THE COLLEGES.<br />\nCornell has a flourishing Prohibition Club.<br />\nHarvard had a deficit of $321,579 for the year ending July 31st, 1901.<br />\nWisconsin has laid out a course of study in journalism which will be included in the college curriculum.<br />\nAt a recent meeting of men from all classes at Cornell, the custom of undergraduate rushes was done away with.<br />\nHarvard has the largest faculty of all the colleges in America. Her instructors number 337, a body nearly as large as the Lower House of Congress.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n11<br /><br />\nThe Senior Class at Harvard has elected a colored man, R. C. Bruce, as<br />\nclass orator. Bruce is the son of B. K. Bruce, formerly senator from Mississippi, and register of the treasury. He is one of the best orators and debaters<br />\nthat Harvard has ever had.<br />\nThe Faculty of Knox College have adopted the following: \"Each college<br />\nstudent is allowed twenty absences from college exercises in each semester.<br />\nSeniors are allowed twenty-five Members of athletic teams, the glee club,<br />\nband, debating teams, etc., also representatives of the various editorial hoards,<br />\nwill be allowed an additional number of absences as recommended by the various committees.\"<br />\nThe trustees of Carnegie Institute have adopted plans for the erection of<br />\nthe largest and most complete school of technology in the world. Mr. Carnegie's proposition was that he be allowed the privilege of endowing and maintaining a technological school of the highest order in the city of Pittsburg, the<br />\ncity to provide the site. The school will be built at a cost of several millions<br />\nof dollars by Mr. Carnegie, and he will also be asked to give a large sum for its<br />\nmaintenance. The city of Pittsburg will be asked to contribute sixty acres of<br />\nground for a site.<br />\nA parallel to Booker T. Washington's undertaking for negro education in<br />\nis found in the work of Dr. Frost, president of Berea College, a little<br />\nSouth<br />\nthe<br />\nheard of but very interesting college which is the seat of the higher education of<br />\nthe \"mountain whites\" of Kentucky and other portions of \"Appalachian<br />\nAmerica.\" The extreme simplicity of these people is illustrated by the statement that \"more than one student has been turned back by his parents after<br />\ngreat preparation and long journeys on foot or on horseback, because the first<br />\nsight of a train of moving cars brought such terror that the father was not willing to trust his son into the keeping of such an engine of destruction.\" Berca<br />\nCollege numbers some eight hundred of these innocent sons and daughters of<br />\nthe South, who depend on it not only for book learning, but for their first introduction to the ways of modern civilization.<br />\nNearly all the catalogues and annual reports that are pouring forth from<br />\nthe college press at this season show an increase in student membership, and in<br />\nendowment. Smith College can accommodate in its dormitories less than half<br />\nof the student body, and the capacity of its assembly hall is altogether inadequate. The report of Treasurer Tyler of Yale shows an increase of permanent<br />\nuniversity funds of $595,027. The Wellesley catalogue states that the entire<br />\nnumber of students is over eight hundred, the largest enrollment in the history<br />\nof the college. Princeton has made rapid strides in growth and evidently<br />\nexpects to continue to do so. Its new gymnasium is planned to surpass any<br />\ncollege gymnasium in the world, both in cost and in size. It is to be made<br />\nlarge enough to accommodate nearly twice the number of students now in the<br />\nuniversity. Syracuse University is organizing a college of applied science in<br />\nwhich mechanical, electrical, and civil engineering will be taught.<br /><br />\nTHE NEWS-LETTER.<br /><br />\nDOINGS OF THE ATHLETIC ASSOCIATION.<br />\nT the regular meeting of the Hopkins Athletic Association last Thursday<br />\nafternoon, the question of a Baseball team was brought up for final<br />\nsettlement Mr. Campbell argued strongly in favor of team, and McKnight from the Medical School warmly seconded his efforts. The matter was<br />\nthen discussed by the Board, and it was decided, in view of the past record of<br />\nBaseball at Hopkins, which for the last few years has never proved a success,<br />\nto grant no appropriation for the team, nor to officially recognize the team.<br />\nIt was stated however, that should the supporters of this movement<br />\ndemonstrate sufficient earnestness to produce a winning team, by showing up<br />\nregularly for practice, and working faithfully, the question will be reconsidered,<br />\nand both financial support and official recognition be given to the team. To<br />\npromote its success, the men will be allowed to use the suits and cage, it then<br />\nremaining to the lovers of Baseball to show whether we shall have a team or not.<br />\nAt the same meeting Murkland,(1903), was elected Ass't Manager of the<br />\ntrack team, and Addison, (1903), Ass't Manager of the Lacrosse team.<br /><br />\n4<br /><br />\nTHE BASE BALL OUTLOOK.<br />\nLTHOUGH Lacrosse has occupied such a high place in the affections and<br />\ninterest of Hopkins men, and established itself among us as the game of<br />\nall others, it is unfortunate that for several years past there has not been<br />\nan excellent base ball team. Base ball in our country is so universal and<br />\nimportant a sport that we should not neglect it. Nor need we. Of course, the<br />\nrecords of our teams of the last three years have not been gratifying. Even the<br />\nteam of last spring which won the State championship fell away from the<br />\nstandard set for the conduct of our athletic teams. These failure and mistakes,<br />\nhowever, should not discourage us, but arouse us to a great effort, It is our<br />\nduty to retrieve the past, to show ourselves and the people of Baltimore that<br />\nHopkins men still cherish a love for the national game. It happens that this<br />\nyear there is material of an exceptionally high order. Seven or eight men of<br />\nthe graduate department and Medical School have expressed a willingness to<br />\nenter heartily into the undertaking of starting a team. These men are able and<br />\nexperienced, and should make valuable allies of the some half-dozen faithful<br />\nplayers who have vainly labored for the cause for the last three years. Besides<br /><br />\n4<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\nthese, many undergraduates manifest a desire to support the new movement.<br />\nSome of the candidates are:<br />\nE. Strouse,<br />\nMoore,<br />\nConstantine,<br />\nSharretts,<br />\nMarine,<br />\nHand,<br />\nMcKnight,<br /><br />\nWhipple,<br />\nCarr,<br />\nWright,<br />\nMurphy,<br />\nMathai,<br />\nNelson.<br />\nDodge,<br /><br />\nMarshall,<br />\nJ. Strouse,<br />\nRoulston,<br />\nDow nian,<br />\nOgle,<br />\nReynolds,<br />\nStrobbar, and others.<br /><br />\nAll these loyal wearers of the Black and Blue will soon be given an opportunity to show their interest and devotion. It is understood that those who<br />\nhave the matter in hand are making plans by which all members of the University can join in a common effort to maintain base ball as one of our recognized<br />\nsports. Pure college athletics will always appeal to the American people. Just<br />\nnow college base ball is at a low ebb in Baltimore, because there are no firstclass teams here. We have a chance to reverse this condition of affairs. It is<br />\nquite possible to produce a base ball team for this year that will satisfy even the<br />\nmost exacting, and that will bring to our University a worthy fame and honor.<br />\nJ. G. CAmPBuLL,'02.<br />\nLet us not shrink from our duty.<br />\nCap J. H. U. Base Ball Team.<br /><br />\nLACROSSE.<br />\nACROSSE practice has now been going on for several weeks; but as yet<br />\nnothing definite can be said as to what kind of a team we will have, or<br />\nwhat men will make a place on it.<br />\nLet us take a look at last year's team and see how we stand. We have<br />\nlost five men,and good ones too. These are Captain Tyler, Coach Maddren,<br />\nBandel, Bruton, and Hatch. Tyler played third defense, which is one of the<br />\nmost difficult positions on a team, and filled it admirably. William H. Maddren<br />\nwas the backbone of lacrosse at J. H. U.; of his playing nothing need be said.<br />\nHe is everywhere regarded as the best college lacrosse player, and could make<br />\nany team he tried for. Hopkins lacrosse without \"Billy\" at cover point will be<br />\nsomething new to Baltimore. Bruton played at second defence for the last<br />\nthree years, and his weight and science will be missed when we go up against<br />\nheavy teams. With these three men out we see that there are only two experienced tnen who must form the skeleton of this year's defense. These are<br />\nCaptain Schmeisser at point and Straus at first defense.<br />\nIn the attack we lose Bandel and Hatch, who played first and second attack<br />\nrespectively. Bandel played on the team for three years, and made many goals<br />\nfor Hopkins. His place will be very hard to fill. Although Hatch only played<br />\none year he was always at the right place at the right time. Thus, even with<br />\nAbercrombie at centre, and Palmer Bernheim at third attack, there will be a big<br />\nditch for the ball to pass before it gets to Bert. Bernheim and Putts. In a word<br />\nour attack will probably be weak in the middle. You cannot make a three year<br />\nplayer in a year. Briscoe and Ranft, who played goal last year, are both with<br />\nus again; but the latter will not be able to play because he is under the doctor's<br /><br />\nt<br /><br />\n14<br /><br />\nTHE NEWS—LETTER.<br /><br />\ncare. Tough, E. Schmeisser, and Sayler, all three of whom played on the<br />\ndefense in some of the big games, ought to help strengthen the team this year.<br />\nOf the other candidates for the team, the best seem to be Bryan (1903), Bird<br />\n(1903), Custus, (1903), Smith, (1902), Iglehart,(1903), Mathai, (1903), Gillespie, (1902), S. Pearre, (1904), Pels, (1902), Riley, (1903), J. Strouse, (1901),<br />\nRosenheim, (1904). Most of these men are not absolutely green material, and<br />\neven those who are should, by plenty of stick work and energy, make a place<br />\nand name for themselves on the team this year. It is well known that five<br />\nFreshmen played on the ninety-nine championship team. How many will be on<br />\nour team this year?<br /><br />\nHOPKINS IN THE B. A. C. GAMES.<br /><br />\ne<br /><br />\nHE results of the B. A. C. games last Saturday night were from a Hopkins<br />\nstandpoint very excellent. Meeting the best men in the city we carried<br />\noff the honors of many events. In the 40-yard dash, three of the six men<br />\nin the final were Abercombie (withdrew), Blanck and Weedon. Blanck got<br />\nthird place. The 440 was won by Lindsay(Grad.); in the 880 yard run, Mullen,<br />\nrunning for B. A. C. beat out Rosenheim (1904) by only half a foot; and in the<br />\nmile relay with University of Pennsylvania, which was one of the most exciting<br />\nraces of the evening, the Hopkins team, composed of Abercrombie, Hoffman,<br />\nRiggs and England, had the gratification of beating the red and blue.<br />\nIn the next to the last lap of the race, the University of Pennsylvania man,<br />\nfollowing England by about two lengths, stumbled. The race had been nipand tuck all through, but it was hardly possible that Pennsylvania could have<br />\novercome England's lead.<br />\nThe high jump was won by Scholl (scratch) with a jump of 5 feet 8 inches.<br />\nWeedon (34 in.) got third. The pole vault has not yet been decided. Altogether<br />\nthings came our way in a satisfying manner.<br /><br />\nTHE FEED.<br /><br />\nt<br /><br />\nHOSE men who did not attend the annual athletic feed, at which it was<br />\nevery loyal Hopkins man's duty to be present, are probably not impressed<br />\nwith the idea that they missed anything particular. With those who<br />\nthink this, it is certainly a case of\"where ignorance is bliss 'tis folly to be<br />\nwise.\" Those who had the spirit to attend will readily agree that the absent<br />\nHopkins enthusiasts (?) missed a roaring good time, but they richly deserved<br />\nit. They are doubtless the very ones who deplore the lack of college spirit and<br />\nof close unity at the University.<br />\nThe committee had gone to no little trouble to provide a varied and interesting entertainment, followed by a feed which produced the climactic effect of<br />\nthe evening.<br />\nChairman Campbell opened the meeting with :a catchy'selection by the<br />\nMandolin Club. Messrs. Whipple and Ward came next with a very interesting<br /><br />\nTHE NEWS—LETTER.<br /><br />\n15<br /><br />\ngymnastic exhibition on the parallel bars and horse. Both men were loudly<br />\napplauded. Willis performed on the piano during the exhibition.<br />\nFollowing came the awarding of honorary\" H's\" and\"H. A. A.'s' by<br />\nPresident Abercrombie of the Athletic Association. Those men who received<br />\nH's\" for the first time were Campbell, Garwood, Sharretts, Houghton, P. S.<br />\nHill and Faris. Messrs. Plaggemeyer, Whipple and Youtz, received<br />\nthe secondary honor\" H. A. A.\" President Abercrombie also formally presented the Association with the championship baseball and track and field banners, which were won during the past season. President Remsen,Dean Griffin,<br />\nand Faculty Delegate Renouf, were then called upon, and each in turn complimented the athletes upon their work of the past season, and wished them the<br />\ngreatest amount of success in the future.<br />\nThe funny stunts in the cage were funny.<br />\nOnly those who were present can appreciate the difficulties and the fun<br />\nwhich the Freshmen had in locating their shoes in the huge pile erected at the<br />\nbeginning of the shoe race. The many drawbacks encountered in the obstacle<br />\nrace also furnished no little amusement. Some of the contestants were nearly<br />\nsuffocated while vainly attempting to crawl under the heavy gymnasium mat,<br />\nothers got a cold bath in their hurry to carry the buckets of water around the<br />\ntrack on their heads, while still others became hopelessly stuck in the barrel<br />\nwhich was suspended three feet from the ground. Strohbar, 1904, demonstrated<br />\nhis ability as a surmounter of various difficulties by winning both races. \"The<br />\nsame old story\" is sufficient to tell how the Junior-Freshman tug-of-war<br />\nresulted. At the finish the Freshmen were about ten feet to the bad. The<br />\nboxing contest between Iglehart, 1903, and H. Williams, Med., resulted in an<br />\neasy victory for Iglehart.<br />\nA plentiful supply of salad, ices, cake and coffee concluded the evening<br />\nentertainment. It was unquestionably a great success, and Committeemen<br />\nCampbell, Bernheim and W. B. Hill, deserve hearty congratulations. They<br />\nwere ably assisted by J. Abner Sayler, Jr., H. W. Plaggmeyer and J. Newman<br />\nNumsen.<br /><br />\nVERBICIDE!<br />\nHas the thought ever struck you.<br />\nHAT there are thousands of persons who have never heard the names of<br />\nMilton and Shakespeare .—<br /><br />\nt<br /><br />\nThat such persons were born deaf;—<br />\nThat the Health Department was not officially notified of the freshman<br />\nshoe-race;<br />\nThat otherwise the race might not have taken place ;—<br />\nThat there are more than 30,000 persons in this city who cannot speak the<br />\nEnglish language;—<br /><br />\n16<br /><br />\nTHE NEWS-LETTER.<br />\nThat they are nearly all infants under the age of four years ;—<br />\nThat there is such a thing as dyspepsia of the brain ;—<br /><br />\nThat freshmen particularly suffer from this malady finding much of their<br />\nwork hard to digest;—<br />\nThat benevolent assimilation would be a good thing for juniors to try ;—<br />\nThat a quarter of a century is but little towards the life of the University—<br />\nbut is much longer than the years of the poet Chatterton ;—<br />\nThat there is a walk known as the Johns Hopkins strut ;—<br />\nThat the Women's College girls first discovered it ;—<br />\nThat it cannot be acquired under a year, so the freshmen are still innocent;—<br />\nThat the Panama Canal will come to a full stop;—<br />\nThat it already past Colon.<br />\n?<br /><br />\n?<br /><br />\n?<br />\nH. L. L. '04.<br /><br />\nTO THE TWILIGHT.<br />\nThere is an hour between the night and day,<br />\nAn hour which stillness loves to hold,<br />\nWhen day itself into the night does mould,<br />\nAnd Phoebus gathers in each shining ray.<br />\nThen does the bird begin his evening lay,<br />\nThen shepherds drive their flocks into the fold,<br />\nThen sad, the Angelus is tolled,<br />\nAnd all the earth stops work to pray.<br />\nThat is thy hour,0 Twilight, dear,<br />\nThe hour when all is calm and still,<br />\nThe hour when rest from work's begun.<br />\nThe day lies dead upon the bier;<br />\nFor it is in thy pow'r to kill,<br />\nAnd turn to blood the setting sun.<br />\nL. M P. W.,'03.<br /><br />\n17<br /><br />\nTHE NEWS—LETTER.<br /><br />\nDomestic finish—a divorce.—Syracuse bniversity Herald.<br /><br />\nThree from the Harvard Lampoon.<br />\n\"Does Showman make much use of Realism?\"<br />\n\"Just a few. In his last play he had real supes in the dinner sceneS\"<br /><br />\nI have such funny foolish thoughts,<br />\nThat when I'm with a crowd,<br />\nI guess 'twould make the fellows laugh<br />\nIf I should think aloud.<br /><br />\nt?<br />\nBILL—Did you hear that Sporter had become a Christian Scientis<br />\nTom—No, why?<br />\nBILL—So that he can try the Absent Treatment on his courses.<br /><br />\nFOR MEN ONLY.<br />\n•puan lan no puns 01 pun ans II<br />\n(monatuos 11 ie 132 p‘ans Atom' a/A<br />\nmaod Stj1 1811I<br />\n'peal XpEa.tiu s Lans<br />\nslnuq2nop 01 sluilop lan ol 2ullitivi aI,am<br />\n•moqs u Jo apuns uant2 ji<br />\n‘motiatuos ino U pug mans laq am. puy<br />\n‘moul 01 ion ;Ono atis q3ppiti turp Limp aallag<br />\ntutitou s‘atatu<br />\nlno pug 01 tu pinom 11<br />\nThe Krishno.<br /><br />\nthe Americans during the<br />\nTEACHER-\" What distinguished foreigner aided<br />\nRevolution ?\"<br />\nJOHNNY—(after thinking hard) —\" God.\"<br /><br />\nApluvia and Cravenette Rain Coats<br />\nAre Suitable and Correct for Wear on all occasions and in all Weathers<br />\nNiC)I<br /><br />\nJ<br /><br />\ngag<br /><br />\nNICD CD=CD,1\"<br /><br />\nWILL SHED RAIN PERFECTLY.<br />\nManufactured by<br /><br />\nCHESAPEAKE RUBBER COMPANY,<br /><br />\n321 W. Baltimore Street.<br /><br />\nEE31E<br /><br />\n&amp;<br />\n675 West Baltimore Street,<br />\nBetween Arch and Pine Sts. Baltimore, Md.<br /><br />\nWEST BALTIMORE LOAN CO.<br /><br />\nLiberal Advances on Merchandise of every Description. WATCHES AND DIAMONDS A SPECIALTY.<br />\nFROM T A. M. TO S P. M.<br />\nSATURDAYS UNTIL 10 P<br />\nSIDE ENTRANCE WITH PRIVATE WAITING ROOM.<br /><br />\nOPEN<br /><br />\nSMITH, DIXON a CO.<br /><br />\nir) F'R-PER<br />\n29-31 S. Charles St.<br /><br />\nA, H. FETING<br /><br />\nPlutures<br />\nppAnn,NDin n<br /><br />\nF3altinum'e, Md.<br />\nMANUFACTURER<br /><br />\nI Winn.<br /><br />\nM<br /><br />\nFRANKE &amp;<br />\nPURNELLCO.<br />\n224 N HOWARD Sr.<br /><br />\n•r<br /><br />\nOreeh %dater<br />\njfraternitp jewelrv.<br /><br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\n•LEA•IC CALL AND EXAMINE OUR<br /><br />\nLINE REFORE<br /><br />\nMUPICH••ING.<br /><br />\nJ. H. ROBINSON.<br />\nMANUEACTURRE OP<br /><br />\n• FINE• CIGARS.*--DMA JLIEK IA<br /><br />\nToriw000,<br /><br />\nItH AND SMOKERS. ANPIOLIDM,<br />\nSTATIONERY.<br /><br />\nFINE<br /><br />\nBonbons, GlioGolates,<br />\nCONFECTIONS.<br />\nFRESH EVERY HOUR.<br /><br />\nSENT BY MAIL OR EXPRFSS.<br /><br />\nLi EAST BALTIMORE STREET,<br /><br />\n626 N. ETJTA W ST.<br />\nBALTIMORE. MD.<br />\nBaltimore, New York &amp; Philadelphia Papers.<br />\nC. &amp; I'. Public Telephone, Madison 11.851'.<br /><br />\nDesigning and Cutting by E. Michaelson.<br /><br />\nMIGIVIELSON,<br />\nMERCHANT TAILOR,<br />\nPOPULAR PRICES.<br /><br />\nALTERING AND REPAIRING<br /><br />\n821 rladison Avenue,<br />\nSpecial discount to Students.<br /><br />\nBUTIMORIE., MD.<br /><br />\nA. D. SMITH &amp; SONS,<br />\nFoimerly<br />\nLEVERING &amp; SMITH,<br />\n104 WEST LEXINGTON S1 REET.<br />\nREADY TO WFAR HATS for Ladies, MISSOM<br />\nand Children.<br />\nIn the Latest Designs.<br />\nMEN'S HATS • Derbys end Soft Felts.<br /><br />\nUNIVERSITY CAFE.<br />\nCHAS. LINDENME VIM, Prop.<br /><br />\nCHOICE WINES, LIQUORS AND CIGARS<br />\nRAW BOX NOW OPEN.<br />\n506 NORTH EUTAW STREET.<br />\nLadies' and Gentlemen's Dinin g Rooms.<br />\nMr,a18 Served at ail Hours.<br /><br />\nThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\nN. E. Cor. Charles and Fayette Sts.,<br /><br />\n'Phone, C. &amp; P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br /><br />\nOSTEOPATHY<br />\nIs a scientific, adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic DigOaReS and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nMARTA BUIE, D. 0.,<br />\nV.-Prest. &amp; Asst. Sooty.<br /><br />\nW.D. BOW IN, M. D., D. 0.,<br />\nPrest. &amp; Mgr.<br />\nESTABLISHED 1079.<br /><br />\nadding Silver holiday<br />\nIN (MCAT VANICTY.<br /><br />\n'JACOBI 45k JE4/%1KINS,<br />\n215 N. CHARLES ST.<br /><br />\nSilversmiths.<br /><br />\nR. MoMAINS, D. O.,<br />\nSec`y. &amp; Treas.<br /><br />\nTHU°. WARNER.<br />\nlames it. Pinta.<br />\nNATA..FZINIR 8c(DO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgent for Lincoln&amp; Bennett and<br />\nWalter Barnaro's London Hats.<br />\n824 WEST IIAL/PIMORP3 STREET.<br />\nManufacturers of<br />\nSilk and Cassonere Hats. W. HOPKINS CAPS<br /><br />\nCUSIENG &amp; COMPANY,<br /><br />\nlienderson's •Ps<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books. Note Books.<br />\nMadison &amp;HowardSts.<br />\nStudent's Supplies.<br /><br />\ns. and<br /><br />\n34 W. BALTIMORE ST.<br />\nSCHOOL, Law MAI:010AL, CLASSICAL AND MISCELLANEOUS 110/011111<br />\nKeeps constantly on hand the Text Books used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\nwi•••<br /><br />\nCertificate of Analysis from<br />\nPeofs. G. W. Lehman &amp; Son,<br /><br />\n11. R. EISENBRANDT SONS,<br /><br />\nJORDM<br />\nSTRBLER GO. Thi 1)) SO \"Isv,.<br />\nReads as follows: Samples submitted of<br /><br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br /><br />\nfor<br /><br />\nFrench Brandy—no adulterants, no coloring,fine quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive<br />\ntests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br /><br />\nstrong.<br /><br />\nNix Ground Spices—no adulteration, all strictly pure.<br /><br />\n20I-203 N.CHARLES ST.<br /><br />\nBALTIMORE, MD.<br />\nCharles T. Crane,<br />\nPresident.<br />\nCarter G. Osburn,Cashier.<br /><br />\nOtto H. Williams,<br />\nVice-PresidtaL<br />\nJ. F. Marshall, Asst, Cashier.<br /><br />\nFOR ADVERTISING SPACE IN THIS PAPER<br /><br />\nFARMERS &amp; MERCHANTS NAT'L. BANK,<br /><br />\nAPPLY TO<br />\nPEARRE E. CRO1A/L COMPANY,<br />\nPUBLISHERS.<br /><br />\nSouth and Lombard Ste., Baltimore.<br />\nSurplus and Profits 5450.000.<br />\nCapital, 5650,000<br /><br />\nLIGHT AND LOMBARD STREETS<br /><br />\nBALTIMORE. MD.<br /><br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br /><br />\nCOLLECTIONS A SPECIALTY.<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nFor particulars apply to<br /><br />\nCORRESPONDENCE INVITED<br /><br />\nNEW YORK TO BREMEN.<br />\nLONDON, PARIS,GiBIZALTER.<br />\nNAPLES, GENOA. ETC.<br /><br />\nA.SCHUMACHER &amp; CO.,<br /><br />\nBALTIMORE TO BREMEN<br /><br />\nGeneral Agents.<br /><br />\nDIRECT.<br /><br />\nMANDOLIN. GUITAR AND BANJO<br />\nY AAAAA<br /><br />\nthe litrany-Sniftb<br />\npiano CO.<br /><br />\nJe Ji<br /><br />\nsr<br /><br />\nC. J. LEVIN,<br />\nwho has made a life study of these Instruments. Mandolin Soloist of National reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br /><br />\nStudio, 331 N. Charles St.<br /><br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br /><br />\nfisfeniritz Studio<br /><br />\nCbtchering, Erabburp ant' illaebster<br /><br />\nSuccessor to Cummins<br /><br />\nBaltimore<br /><br />\n20 West Lexington St.<br /><br />\n!pianos.<br /><br />\n.st .4<br /><br />\nARTISTIC PHOTOGRAPHY<br /><br />\nC.&amp; P.'Phone 2322-2.<br /><br />\n%oh<br />\nFactory Prices.<br /><br />\nSpecial Discount to Students<br /><br />\nTHE BLAKE CO<br /><br />\nHABERDASHERS.<br /><br />\nShirts, Neckwear,<br />\ns Underwear, Hosiery,<br />\nEtc.<br /><br />\nON SALE THE J. H. U. PENNANTS,<br />\nand all other College Pennants<br /><br />\n203W.BALTIMORE ST.&amp; 2 S. LIBERTY ST.<br />\nBALTIMORE, MD.<br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange;<br />\nChicago Board of Trade ,<br /><br />\nClinton P. Paine<br />\nGordon P. Paine<br /><br />\nCLINTON P. PAINE c&amp; CO.,<br />\nBANKERS &amp; BROKERSStreet<br /><br />\nPrivate Wires to<br />\nNew York and Chicago<br /><br />\n217 E. German<br />\nBALTIMORE, MD.<br /><br />\nThe Chas. Willms Surgical Instrument Company<br />\nBENJ. A, NELSON, GEN. MANAGER<br /><br />\nPhysicians,' Burgeons,' Hospital and Invalid Supplies,<br />\nPine Microsoopes and Accessories,<br />\nBaltimore, Md.<br /><br />\n3043 N. Howard St.,<br /><br />\nDrovers and Mechanics National Bank,<br />\nOF BALTIMORE, MD.<br /><br />\nCapital Stock,$300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br />\nTRINE IT OVER.<br /><br />\nYOUR Elif„S<br /><br />\nSAYRE OPTICAL COMPANY,<br />\n221 North Charles Street. (Masonic Temple.)<br /><br />\nOPTICIF*NS.<br />\nTHE NEWS LETTER<br /><br />\nSMITH'S s\"TAT'BggliirE<br />\nOLD<br />\nBOOK<br />\nN. HOWARD STREET,<br />\nSTORE<br />\n3rd door from Madison.<br />\n805<br /><br />\nBOOKS<br /><br />\nOLD AND NEW<br /><br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks Bought, Sold and Exchanged .. ..<br />\n6o5 N. Eutaw Street.<br /><br />\nWM. V.PIPPEN,<br /><br />\nA. H Rutherfoord.<br />\nF. Lentz.<br /><br />\nJ. Wm. Middendorf,<br />\nA.J. Robbins.<br /><br />\nJ. WM. MIDDENDORF &amp; CO.<br />\n113anhere &amp; Vrohers.<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nMembers<br />\nBaltimore Stock Exchange.<br /><br />\nBaltimore, Md,<br /><br />\nB. G. ElCHELBERGER,<br />\nBooms AND STATIONBRY<br />\nENGRAVING AND STAMPING.<br /><br />\ne<br /><br />\n1441c.k 30E3 INT.:as-Th. Cimr-lete<br />\nY. M. C. A. BUILDING,<br />\nBALTIMORE, MD.<br />\nC. Az P. and Md.'Phones.<br /><br />\nCALL ON<br /><br />\nJR'S. It. DOWNS,<br />\n229 N. Gharies St.,<br />\nMASONIC TEMPLE.<br /><br />\nFOR Class, Fraternity and College Stationery,<br />\nBanquet Cards, Invitations, Diplomat',<br />\nPrograms, Visiting Cards, etc.<br />\nOur 50o J. B. U. Blue and Black Plan Paper—now readu<br />\nThera Is varg little entertainment at home without a Plano<br /><br />\nis from the Press of<br /><br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nLight and Lombard Streets,<br /><br />\nBALTIMORE<br /><br />\nWe carry a full line of Students' Note Books and Stationery<br />\nBoth 'Phones.<br /><br />\ncTIEFF<br />\nzplANos<br /><br />\nfire The Best.<br /><br />\n9 N. Libertu St.<br /><br />"}], "field_media_file": [{"target_id": 36216, "display": null, "description": null, "target_type": "file", "target_uuid": "b3cb14c4-f7ab-413b-9d09-39a45775fac9", "url": "http://digital.library.jhu.edu/system/files/2022-03/12200-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12200, "target_type": "node", "target_uuid": "51306a34-0a4a-46fb-87d4-7e7a4a082f47", "url": "/node/12200"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "0fd4e019-b520-4e40-96a3-96d3ba74482b"}]}