{"mid": [{"value": 35688}], "uuid": [{"value": "c09cbf44-9043-4a4e-ac70-909714149463"}], "vid": [{"value": 35688}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:19+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12226-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:19+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:19+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "December ig, 1902<br />\n<br />\nVol. VII, No. 5<br />\n<br />\nTHE<br />\nNEWS 1.1.11)<br />\n<br />\nLETTER<br />\n<br />\nA<br />\nFOOTBALL<br />\nNUMBER.<br />\n<br />\nPUBLISHED BY STUDENTS<br />\n<br />\nJOHNS HOPKINS UNIVERSITY<br />\n<br />\n\fThe Johns tiopKins Universitu<br />\n<br />\nThe Johns tlookins Press.<br />\n<br />\nBALTIMORE, MARYLAND.<br />\n1.<br />\n<br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October 1, 1902.<br />\n<br />\n11.<br />\n<br />\nItmerican 3ournal of fiDatbematics.<br />\nE. MORLEY, Editor. Quarterly. 4to.<br />\nXX V in progress. $5 per volume.<br />\n<br />\nVolume.<br />\n<br />\n%American Chemical 'journal.<br />\nI. REMSEN. Editor. Monthly. Svo.<br />\nX XVIII in progress. $5 per volume.<br />\n<br />\nVolume<br />\n<br />\n111. limerican aournal of Philotogv.<br />\nI. GI LDERSLEEVE, Editor. Quarterly. Svo.<br />\nVolume XX Ill in progress. $3 per volume.<br />\n<br />\nPresident: IRA ItFlamm. Dean of the, Medical Faculty:<br />\nW Ild.tAM H. How KM,. Dean, of the College Faculty:<br />\nBewAtto II. GuirriN.<br />\n<br />\nIL<br />\n<br />\n%Mies from the Viological liaboratorv.<br />\nVolume V complete. $5 per volume.;<br />\n<br />\nInstruction.<br />\n<br />\nW.<br />\n<br />\ntubteein lbistorieta nub {Political 93cience.<br />\nMonthly. Hvo. Series XX in progress.<br />\nvolume.<br />\n<br />\nFOR GRADUATE STUDENTS:<br />\n<br />\n•<br />\n<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLibraries.<br />\n1050)0 volumes.<br />\nUniversity,<br />\nPeabody Institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br />\n<br />\nLaboratories.<br />\nChemistry.<br />\nPhysics.<br />\nIleology and Mineralogy.<br />\nZoology<br />\nA natomy.<br />\nPh ysielogy.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinieal Medicine.<br />\n<br />\nSeminaries.<br />\n(Ireek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nItormince.<br />\nEng!ish.<br />\nII story,<br />\nRetiree:lies.<br />\nMathematics.<br />\n<br />\nDirectors.<br />\nIra Remsen.<br />\nJoseph ,S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Bowen.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oster.<br />\n<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XXII in<br />\nprogress. $1 per year.<br />\n1011. 3ohne lbophins tospital 113a1(etin. Monthly. 4th.<br />\nVolume XIII in progress. $1 per year.<br />\n3ohns lhophins /hospital 'Reports. 4to. Volume X<br />\n•<br />\nin progress. $6 per volume.<br />\nIX.<br />\n<br />\nContributions to Beevriologv sub Comparative<br />\nSemitic Vbilolo(tv, Beitrage zur Assyriologie, etc.)<br />\nVol. IV complete.<br />\n<br />\nX.<br />\n<br />\nMemoirs from the Eloloaical %nboratorv.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br />\n<br />\n•<br />\n<br />\nMobern 1.anguage Votes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to.<br />\nXVII in progress. $1.50 per volume.<br />\n<br />\nVolume<br />\n<br />\nX11. 3ournal of Experimental fieetleine.<br />\nW. 11. WELCH, Editor. Bi-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nX111. Itinerican 3ournal of Insanitv.<br />\n11 EN HY M. HUED, Editor. Quarterly.4to. $5 per<br />\nvolume.<br />\n•<br />\n<br />\n'reports of fiBarvlanb Seological Survev.<br />\nWILLIAM B. CIA UK, Editor.<br />\n<br />\nflP.<br />\n<br />\nterrestrial flhaanetism nub litmaspheric Elec.<br />\ntricitv. L. A. BA I ER, Editor. Quarterly. tivo.<br />\nVolume VII in progress. $2.50 per volume.<br />\nItnnual 'Report.<br />\nPresented by the President of the Board of Trustees reviewing the operations of' the University<br />\nduring the past academie year.<br />\nTinnual'Register.<br />\nGiving the list of officers and students,and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic, year.<br />\n<br />\nDirectors.<br />\nBasil L. G ildersleeve.<br />\nKirby P. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\n.11101(14 11% Bri)/ht.<br />\n.10,11 31. 1.i Cid<br />\n!I. Ifollomier.<br />\n.11,,r1c11.<br />\ns. Awe,.<br />\n<br />\n$3 per<br />\n<br />\n3obne tropkins tiniversitv Circulars.<br />\n<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. Ti.; courses for physicians.)<br />\n<br />\nFOR UNDERGRADUATES:<br />\n<br />\nSvo.<br />\n<br />\nUndergraduate Courses (leading to B. A).<br />\nGroups.<br />\nI. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Biological<br />\n(leading up to medicine).<br />\n4. Geological-Biological.<br />\n6. Latin-Mathematical.<br />\n6. Historical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br />\n<br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol. XXV).<br />\nAmerican Chemical Journal (vol. XXVIII).<br />\nAmerican Journal of Philology (vol. XXIII).<br />\nStudies in Historical and Political Science (vol. XX).<br />\nModern Language Notes(vol. XVII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A smyriology (vol. IV).<br />\nTerrestrial Magnetism (vol VII).<br />\nUniversity Circulars(vol. XX II).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the A rtm and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br />\n<br />\nIn addition to the serials above named, collies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.50.<br />\nThe Critical Edition of -the Hebrew Text of the Old<br />\nTestament. Edited by Prot'. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins Hzumital. .1. S. Billings, Editor. 116 pp. 4to. 66 plates. $7.60 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simile edition. Edited by .1. liendel Harris. 110 pp. 4to. 10.<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS. with A ntilegomena Epistles. Edited by I. H. Hall. $3.00.<br />\nIlibliographia Hopkinsiensis. Part I. Philology. Parts<br />\n1141 I. Chemistry, Mineralogy and Geology. l'arts,<br />\nI V-V-VI. Phys,ics,Astronorny and Mat hernatics.<br />\ns vo. 30 cents per part.<br />\nft lull list of publications will he sent on application.<br />\n<br />\nCommunications In respect to exchanges and remittances<br />\nmat' be sent to Johns 'Hopkins Press, Baltimore, Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VII.<br />\n<br />\nDECEMBER 19, 1902.<br />\n<br />\nNo. 5.<br />\n<br />\nTHE BLACK SATCHEL.<br />\nCCJ M MODATION for Cleveland, Chicago, and the Northwest!\"<br />\nbawled the porter, walking through the main waiting-room of the<br />\ndepot. The few travelers who sat drowsily around roused themselves, and passed out of the warm station and through the grated doors into<br />\nthe snow and cold of a winter night. I had just time to purchase my ticket,<br />\nand tightly clutching my small black satchel to step on the platform, when the<br />\nmidnight train, its dazzling head-light cutting through the darkness, rolled into<br />\nthe depot—ten minutes late.<br />\nCrossing several tracks, I walked quickly down the long line of baggage,<br />\nexpress, and passenger cars, and boarded the last coach. The steam rushed<br />\nand hissed angrily from the dome of the engine as if the mighty creature were<br />\nimpatient at the delay, and wished to be off and once more rush through the<br />\ndarkening clouds of snow, and awaken the sleeping hills and hollows with its<br />\nhoarse shriek. The huge engine quivered and shook, snorted once, twice, and<br />\nthen again and again, moved slowly forward, and in a moment was well under<br />\nway, and tearing through the night with a thousand miles of track before it.<br />\nI settled myself back in my seat, and prepared to pass the long night ride<br />\nas comfortably as I could. The smell of smoke reached me, the door was<br />\nslammed, and the brakeman, carrying a lantern in each hand, passed through<br />\nthe car, leaving me its sole occupant. Solitude, it is said, is most conducive<br />\nto thought, and in a short time the events of the day were passing through my<br />\nmind in rapid review, and in particular, those which had culminated in my<br />\nleaving New York at midnight for the West. I glanced at the small black<br />\nsatchel which lay on the seat beside me, and instinctively felt for my arms.<br />\nMy thought flew back to the first day, not many years ago—for I was still a<br />\nyoung man—that I had entered the service of Thomson & Blank, bankers, one<br />\nof the largest firms in Wall Street. By degrees I had worked my way up,<br />\ngradually gaining the esteem and good-will of the firm, till now I occupied the<br />\nchief place in their large establishment. Frequently before I had been sent on<br />\nerrands similar to the one in which I was at present engaged, but none was<br />\never of such vast importance. Frequently large sums of money had been entrusted to my care, but never before such an amount as the small black satchel<br />\nnow contained. It was in the afternoon of the first day of February, 1871, that<br />\nI had been called into the small private office of Mr. Thomson. It was an<br />\nhour later that I emerged, having received full instructions regarding my mission,—the details of which for certain reasons I will not make known,—but let<br />\nit suffice that I was to act as the firm's confidential agent in consummating one<br />\nof the largest deals in which it had ever been engaged.. The entire affair so far<br />\n44<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nas known to the firm and myself, had been kept a jealously guarded secret; but<br />\nto make certain that they could not be forestalled in the transaction, and for the<br />\nquicker transfer of such a sum, it was decided that I should leave that very<br />\nnight.<br />\nWith a start I came out of my reverie. I had almost dozed off. A little<br />\nfrightened, and now throughly awake, I lit a cigar, and turning to the window<br />\ntried to gaze into the blackness beyond. We dashed through some small town,<br />\nscarcely distinguishable in the darkness and the storm, and in a moment left it<br />\nbehind us. Straining my eyes in the effort to pierce the night, I saw the red<br />\nsparks streaming by, and occasionally caught the dim outline of a house or<br />\ntree We passed through a cut, the light from the car racing and dancing over<br />\nits snow-covered side, and framing in pale streaks the bushes and shrubbery that<br />\nraced by. Once more we emerged upon the open plain, rolling away to the<br />\nwestward and lost in the black blur of the distant foothills. The train rumbled<br />\nover a trestle, the narrow rapid stream flowing far below. A chill passed over<br />\nme when I thought of the possibility of jumping the rail. I turned back to<br />\nthe brightly lighted car, and gave a slight start. So absorbed had I been in<br />\ntrying to pierce the darkness, that I had not heard two men enter, who now<br />\noccupied seats in front of me and on opposite Sides of the aisle. Evidently,<br />\nthey were strangers, and each seemed absorbed with his own thoughts. I fell<br />\nto studying the man on my left; he was well built and of genteel appearance,<br />\ndressed quietly and with taste, his hair was jet black, and he was, at least as<br />\nfar as I could judge from the profile turned toward me, of a dark complexion.<br />\nThe second traveler was of the ordinary type, large, robust, and light-haired.<br />\nMy cigar had gone out; I lit it again, and the dark man turned partly around<br />\nin his seat, then arose, and, approaching me with an easy grace, asked for a<br />\nmatch. I accommodated him, and he bowed slightly. \"Going to Chicago?\"<br />\nhe said.<br />\n\"Yes. Will you sit down?\" And I made room for him on the seat beside<br />\nme. In a short time we were launched deeply in conversation. Time passed<br />\nand the train rushed on, the cars swinging and jarring as we rounded some<br />\ncurve. My companion I soon found to be an educated and well-read man.<br />\nPresently, however, the conversation began to lag, and laying his cigar down<br />\non the arm of his seat, the stranger seemed lost in thought. I glanced at the<br />\nother occupant of the coach. He was to all appearances asleep.<br />\nSomehow I was seized by a terrible presentiment of impending danger, one<br />\nof those inexplicable sensations which sometimes come to a man in battle or in<br />\ntimes of great excitement. I turned to my companion, and uttered a cry. He<br />\nhad risen from his seat, and standing in the aisle, with an indescrible look upon<br />\nhis dark face, was pointing toward the rear of the car. He wheeled about like<br />\na flash. There was a crashing blow on my head, lights innumerable danced<br />\nbefore my eyes, my brain was on fire. I seemed to be sinking, sinking, for<br />\ncountless ages always down, down, and at last was smothered and swallowed<br />\nup in darkness, and then drowsiness came over me. I had no desire to see or to<br />\nhear, only a great longing to forget. It seemed as if the current of my mind<br />\nhad stopped.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nOn opening my eyes I became conscious of a burning pain in my head.<br />\nMy first thought was of the black satchel. I felt beside me. It was gone!<br />\nI was bewildered, semi conscious, and possessed by an awful feeling of<br />\nunreality. My surroundings were not familiar, but by degrees as my mind<br />\ngradually cleared, I became aware that I was lying on a hard, polished floor<br />\nbeside a couch. I put my hand to my head; it was covered with blood. There<br />\nwas blood also upon the floor. I must have had a severe fall.<br />\nThe room was spacious and magnificently furnished. Strange! I did not<br />\nknow where I was. Then I thought of the satchel and my mission and grew<br />\nsick at the thought. I heard a light foot step, and a lady entered the room.<br />\nShe was of middle age and still handsome.<br />\n\"We dine at six, John,\" she said softly.<br />\nTurning to her I replied bluntly, \"Where am I?\"<br />\n\"J—J—Why, really, what is the matter,\" stammered the lady. \"Are you<br />\nfeeling—er—as well as usual, John?\"<br />\n\"In heaven's name—,\" I began, \"where am I, and who are you?\"<br />\n\"I am your wife and you are in your own home in London. Don't you<br />\nknow—\"<br />\n\"How do I know?\" I cried wildly. ti 9,<br />\n\"You have gone mad,'' she said.<br />\nTurning I saw a large mirror at one end of the room. I quickly approached<br />\nit, but fell back aghast. In place of my own,features the mirror reflected theface<br />\nof an old man—a man prematurely aged,—with white locks and a long snowy beard!<br />\nI looked at myself with horror-stricken eyes and jaw half fallen. Then every<br />\nobject danced around me, the room and the lady became lost in a giddy maze,<br />\nand my senses failed<br />\nWhen I regained consciousness, I found myself in bed, with kind though<br />\nunfamiliar faces around me. A violent fever kept me for weeks within the<br />\nshadow -of death, but thanks to the tender care of the lady who had claimed to<br />\nbe my wife, I slowly recovered. During my convalescence I was told the story<br />\nof my second life. It was for the most part ordinary enough. I had turned<br />\nup in London one day, a poor but perfectly rational man, but without the<br />\nslightest remembrances of my life previous to the night adventure in the railway car. I had engaged in business, met with success, and married, and<br />\nwould have died without ever having found out my real name, had not my fall<br />\nfrom a sofa upon the hard floor and the consequent injury to my head restored<br />\nmy reason in a manner most miraculous. All this and much besides my wife<br />\ntold me as I recovered slowly from my long illness.<br />\nThe story of my early life was nearly as much of a relevation to my wife as<br />\nher story was to me. I was now once more a healthy and happy man. And<br />\nthere remains but little more to tell. My first duty was to communicate with<br />\nmy old employers, Thomson & Blank. The result of my inquiry was to find<br />\nout that the partnership had been long since dissolved and that both the old<br />\ngentlemen were dead. They, as I myself, would never learn the fate of the<br />\nblack satchel.<br />\nE. P. SANPRocK, '03.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\nTHE LOOM OF DREAMS.<br />\nWhat shall I weave upon my loom of dreams<br />\nTo give my lady in a dainty rhyme?<br />\nSome sylvan memory of summer time,<br />\nOf silent woods and slow and sleepy streams?<br />\nSome fantasy of fairy-like design,<br />\nWith opal woof and warp of amethyst,<br />\nLike little waves by melting moon-beams kissed<br />\nWhen it cloth seem the stars forget to shine?<br />\nOr shall it be a song in martial strain,<br />\nOr a wild song of the wild, winter sea?<br />\nA dirge for A atunin, a low threnody,<br />\nAs if the wind did to the moon complain?<br />\nNo, none of these; for her my dream-loom weaves<br />\nDream-fancies of a land forever Spring;<br />\nWhere fountains 'neath the wooing willows sing<br />\nOf youth and love, echoed by rustling leaves.<br />\nSuch was the scene those Springs in Arcady<br />\nWhen still the gods inhabited the vales,<br />\nAnd l'an went piping through the grassy dales<br />\nWith dancing nymphs to keep him company.<br />\nJust such a fancy shall my dream-loom weave,<br />\nAll built of airy nothings which are gone<br />\nOn waking, like the yellow stars at dawn;<br />\nAnd yet the mind some impress doth receive,<br />\nSome impress faint, as of a long-lost song<br />\nHeard once in childhood from a crooning nurse.<br />\nI'll charm my lady's ear with such a verse<br />\nAs might be sung at eve by elfin throng.<br />\n'Tis this I'll weave out of the idle air<br />\nTo cast around her in a mystic spell;<br />\n0 may she own she could not think to dwell<br />\nE'en in that dream unles4 I could be there!<br />\nII K. TOOTLE,'M.<br />\n<br />\nALUMNI.<br />\n<br />\n'87<br />\n<br />\nDr. C. H. Haskins has been appointed Professor of History, Harvard<br />\nUniversity.<br />\n<br />\n'90<br />\n<br />\nW. H. Browne, Jr„ is Technical Editor of the \"Electrical Review,''<br />\nNew York.<br />\n<br />\n'92<br />\n<br />\nDr. W. A. Montgomery has been appointed to the post of Classical<br />\nMaster, Sewanee Grammar School, Tennessee<br />\n<br />\nDr. J. H. Latane is Professor of History at Washington and Lee Uni•<br />\nversity.<br />\nDr. Albert M. Reese is Instructor in Biology at Syracuse University.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n5<br />\n<br />\nDr. C. C. Schenck is Instructor in Physics at McGill University, and<br />\nDemonstrator to Senior Classes in Electricity.<br />\n'95<br />\nD. G. 0. James is Instructor in Mathematics and Astronomy, Lehigh<br />\n<br />\n'93<br />\n<br />\nUniversity.<br />\nCharles B. Clark has removed to Baltimore from Georgia, and will hang<br />\nout his shingle as Railroad Constructing Engineer.<br />\n97<br />\nDr. T. R. Clarke has been appointed Instructor in Oriental Languages<br />\nat the University.<br />\nE. L. Bowlus is Instructor in Biology at Monmouth College, Ill.<br />\n<br />\n'98<br />\n<br />\nAlbert G Stidman is Instructor of French at Lehigh University.<br />\nDr. Harold Pender is Instructor in Physics, Syracuse University.<br />\n<br />\nG. D. Davidson is now Professor of Romance Languages, Rawlings<br />\nInstitute, Charlottesville, Va.<br />\nE. B. Fosnocht is Master of Modern Languages at Cheltenham Academy,<br />\nOgontz, Pa.<br />\nAndrew Reid Bird writes from Milan that \"it is indeed an inspiration<br />\n'01<br />\nto view the Iron Crown of Lombardy—with phasing remembrances of the Major<br />\nHistory Class of '99-'00.' He will not return from his European tour until<br />\nthe end of next year.<br />\n<br />\n99<br />\n<br />\nW. S. Weedon, Ph. D., '02, was married to Miss Mary Brown, of this city,<br />\non the 17th. Dr. and Mrs. Weedon will make their home in Schenectady.<br />\n<br />\nY. M. C. A. NOTES.<br />\n. SPLENDID talk was delivered during the meeting at the Medical School<br />\nSunday evening. Mr. Mott spoke very powerfully of the Christian work<br />\nin universities and colleges of North America, Great Britain, Germany,<br />\nScandinavia, France, Australasia, Japan, China, and India. Dr. Mott showed<br />\nthat the wonderful growth in all these lands during the last few years attests, beyond doubt, that the thinking mass of our universities are acknowledging Jesus<br />\nChrist as Lord and Savior.<br />\n<br />\n11(<br />\n<br />\nMr. Tom Jays, who represents the British Student Volunteer movement,<br />\nand is now on leave of absence for one year to travel among American institutions, will be in Baltimore January 10-12. There will be a meeting of all college<br />\nmen of Baltimore on that (Sunday) afternoon. It is hoped that Hopkins men<br />\nwill avail themselves of this opportunity.<br />\nDr. Murray Brush is leading Morning Prayers this week.<br />\nJ. A. Addison, '03, and M. B. Graff, G., reported Tuesday on their trips to<br />\nTrenton and Princeton, which were very interesting.<br />\n<br />\n\f()<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the 'University Year by the Students of THE<br />\nJOHNS<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nDECEMBER 19, 1902.<br />\nSubscription $1.50 per year.<br />\nEditor in Chief, .<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n.<br />\nAssistant News Editors<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAs.iistant Business Manager,<br />\n<br />\n10 Cents a single copy.<br />\n<br />\n.<br />\n<br />\n3<br />\n<br />\nROBERT S. LAMER, 1903.<br />\nHARRY K. TOOTLE, 1903.<br />\nGEORGE A. FOSTER, 1904.<br />\nREGINALD S. °PIE, 1904.<br />\n<br />\nW. S. BIRD 1908.<br />\nI. J. NEWMAN NUMSEN, 1904.<br />\n.<br />\nHARRY BAETJER, 1903,<br />\n. Ricionsr BUCKLER, 1904.<br />\n<br />\nAddress all articles, communications, etc., to ROBERT S. LANIER, box 374, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\nJ. H. U.: or box :395, Medical School of Johns Hopkins Hospital.<br />\n<br />\nHARRY BAETJER,<br />\n<br />\nIMM...••••••••<br />\n<br />\n4 4(rOHEN is all the hazing to be over? When may I wear college colors<br />\nwithout let or hindrance?'' To this recent query of a Freshman<br />\nthe bystanders had no very definite answer to give. He was told to<br />\n''try it and see.\" So it has seemed advisable to say here, for the benefit of<br />\nthose who do not know, that the discipline exerted by the Junior Class in such<br />\nminor matters stops, according to tradition, after the interclass football game.<br />\n\"But there was hazing in the last college year at the end of February,\" some<br />\none says. Very true, but it was for a special case. A group of '04 men attempted to interfere with the '03 banquet, and to prevent the attendance of<br />\nPresident Plaggetneyer. This was resented by the then Juniors, not only because they had declared nn their own part a policy of non-interference with<br />\nclass banquets, but also because the matter occurred on the eve of the quarter<br />\ncentennial celebration of the University, and the spectacle of undergraduates<br />\nengaged in a scuffle on the street would have been a sorry happening at a time<br />\nwhen the University was the center of attention. For these reasons, '03 enforced the regulations concerning college colors and class numerals for a couple<br />\nof weeks. The whole business, of course, is each year at the discretion of the<br />\nJunior Class. But there should be cogent and specific reasons for departing<br />\nfrom the tradition that peace and friendship reign after the class football game.<br />\n<br />\n\fTHE NEWS—LETTER,<br />\n<br />\n7<br />\n<br />\nHE mix up concerning this year's cane-rush is not very creditable to those<br />\nmost actively concerned. Out of so many conflicting explanations for the<br />\nnon-occurrence of the event, it is difficult to draw .a single theory. The<br />\nfacts in the case are that the rush has not come off, that it may not come off<br />\nuntil after the holidays, and that it is poor class policy to let such an institution lapse. Previous classes have entered into the spirit of the rush, have carried it out successfully, and have benefitted by the opportunity to \"let off<br />\nsteam.\" If there is really a prevailing sentiment that the nature of the rush<br />\nincludes au unnecessary amount of brutality, there could be substituted for it<br />\ncane \"sprees,\" such as have been used at Princeton and other colleges. Three<br />\nchampions are chosen from each class—light, middle, and heavy weight—and<br />\nthe three pairs are matched to wrestle for the cane, which the two contestants<br />\nhold as do the class presidents in our plan. At any rate, the '04 and '05 men<br />\nare expected to do something besides accuse each other of backing out. Such<br />\nconduct belongs more to professional pugilism than to class athletics at an<br />\n<br />\nt<br />\n<br />\nAmerican University.<br />\nTHE MUSICAL CLUBS.<br />\n<br />\nC<br />\n<br />\nHE Clubs are now looking eagerly forward to the Christmas excursion,<br />\n<br />\nnow that the Hannah More trip, the last of the four trial concerts, is<br />\nover. From a musical point of view, this was only moderately successful. The Banjo Club i managed to get through its new piece, \"Our Director,\"<br />\nwithout comment froni the audience. The Mandolin Club did not keep up the<br />\ngood start it had made; some portions of the \"Loin du Pays\" were extremely<br />\nragged. A two-hour rehearsal on Saturday, however, did it much good. The<br />\nGlee Club is beginning to show the result of much hard work. Altogether,<br />\nprospects are good for creditable performances on the holiday trip.<br />\nThis will extend from Monday, the 29th, to Friday, January 2. Details<br />\nare not quite settled, as it was only recently that the management found it necessary to abandon the first plan of an appearance at Norfolk. But, so far as<br />\nhas been arranged, the dates will be as followE:<br />\nMonday, December 29—Leave on night boat of Baltimore, Chesapeake<br />\nand Atlantic Company.<br />\nTuesday—Concert. and dance at Cambridge.<br />\nWednesday—A real old \"Easte'n Sho'\" dinner—terrapin, ducks, etc.—at<br />\nSalisbury, followed by concert and dance at night.<br />\nThursday—Concert and dance at Easton.<br />\nFriday—Return to Baltimore.<br />\nThe men will be largely entertained at private houses, and prayers for snow<br />\nand narrow seated sleighs are being made by tho.e whose inclination leads them<br />\nto the society of the fair sex. However, a good time will be on hand in any<br />\nevent for those who make the trip, and many are the anxious faces when three<br />\nor four of the management are seen with their heads together, deciding who<br />\nmay best be spared in cutting down the number to be taken.<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\nFOR THE UNDERGRADUATE.<br />\n<br />\nW. BRYAN,'03, has invited two other prominent Musical Club mein• bers to shoot on Taylor's Island, Dorchester County, on the “Easte'n<br />\nSho',\" a few days before the Christmas trip of the clubs. The fortunate men are C. A. Marshall, '03, and R. C. Pagon, '03.<br />\n<br />\n3<br />\n<br />\nB. F. Cator,'04, has left the University.<br />\nA \"feed\" is to take place at the Hullabaloo Club on the night of Tuesday<br />\nthe 23d, the last day of exams. Turkey and other holiday delicacies are<br />\npromised. It is understood that anyone mentioning the words \"examination,\"<br />\npaper,\" or \"mark,\" will thereby render himself liable to immediate expulsion from the club rooms.<br />\n<br />\n''<br />\n<br />\nThe '04 class flag, first displayed at the interclass football game, is the<br />\nhandsomest seen at the University for sometime. It represents the class pill on<br />\na background of college colors.<br />\nThe failure to hold the cane-rush last week is differently explained by each<br />\nclass concerned. The Juniors say that after the refusal of the Freshmen to<br />\nmeet them on the day of the football game, they really have won by default, but<br />\nthat they still are ready for '05 at any suitable time at American League Park.<br />\nThe Freshmen assert that they held back on the 6th because told to by the<br />\nSeniors who had the affair in charge; that they have been ready to do battle<br />\nin the cage for ten days, but that the '04 men have refused under various pretexts, really bezause they have \"cold feet.\" The only certain point seems to<br />\nbe that there will be nothing done until after the holidays.<br />\nIt is understood that the Goonay Club, an organization hitherto restricted<br />\nin membership to the Musical Clubs, has extended its scope, and now includes<br />\nmembers from the upper classes at large. The existence of some senior society,<br />\nthe honor of membership in which the newly-entered undergraduate may look<br />\nforward to as at once an incentive and a reward for faithful services to his<br />\nAlma Mater, and for good behavior in his college relations, seems a most desirable thing. Attention was called to this in an article by Arthur W. Machen,<br />\nJr., in THH NEWS-Lin-11m of December 6,1899, in which he says:<br />\n\"The fraternities generally select their members during the first few weeks<br />\nof the freshman year; and thus almost the only positions which may be bestowed<br />\nas 'a reward of popularity are the class offices. Therefore, the only popularity<br />\nwhich an ambitious student need cultivate is popularity among his own classmates, and this is rather helped than hindered by a certain amount of freshness<br />\ntowards his academic superiors. The only remedy for this state of affairs would<br />\nbe the establishment of one or more junior or senior societies, to which the freshmen might look as the goal of their ambitions.\"<br />\nSome tangible evidence of the reality of this body might have been gleaned<br />\nby the uninitiated from sundry peculiar actions of grave and reverend seniors,<br />\nnot otherwise easily explicable, during the recent weeks.<br />\n<br />\n\fTIIE NEWS-LETTER.<br />\n<br />\n1<br />\n<br />\n44/ZEEZIX17:4=4=4,1Z,L1143.JZL,<br />\n<br />\nlhIluilaHIItIIrtIIIIIIthIH<br />\n<br />\nC?<br />\n<br />\nNI<br />\n11111111111111111011111111111<br />\n<br />\nR. CHARLES I,. POLLARD, curator of the United States National<br />\nHerbarium, and secretary of the Wild Flower Reservation Society of<br />\nAmerica, will deliver a lecture on ''The Vanishing Wild Flowers\" in<br />\nHopkins Hall, Friday, December 19 The lecture will be delivered under the<br />\ndirection of the Naturalists Field Club.<br />\nProfessor Paul Haupt will represent the University at the fourth annual<br />\nconference of the Association of American Universities, which will meet in New<br />\nYork, December 29, 30 and 31.<br />\nOn Thursday, December 11, Dr. Remsen went to Washington to address<br />\nthe Cosmos Club on Liebig and Wochler, the great German pioneers of Chenistry, with whom Dr. Remsen studied.<br />\nDr. A. M. Elliott, Dr. J. H. Hollander, and Dr. Henry M. Hurd were<br />\nPresent at the twenty-second annual meeting of the National Civil Service Reform League. Ex-president Gilman addressed the meeting on Thursday, the<br />\n11th of December, afterwards being elected President of the League.<br />\nAt the B. C. C. Alumni Banquet on the 9th of this month, Dr. Jacob H.<br />\nHollander responded to the toast,\"The Political Economist and Public Affairs.\"<br />\nEarly in March a course of lectures on Social Economics will be delivered<br />\nin French by Professor Leopold Mabilleau, director of the Musee Social. The<br />\nmoney for these lectures was given to the University by Dr. Elgin R. L. Gould,<br />\nCity Chamberlaili of New York, who delivered a speech at the commencement<br />\nlast June.<br />\nOn December 5th, Mr. Theodore Marburg addressed the Johns Hopkins<br />\nHistorical and Political Science Association on \"The Eight-Hour Labor Law.\"<br />\nProfessor Julius Haber, of the University of Karlsruhe, Germany, recently<br />\nvisited the University. Professor Haber, who is the representative of the German Bunsen Society for Applied Physical Chemistry, was particularly interested<br />\nin Professor Morse's new apparatus for the measurement of osmatic pressure.<br />\nDr. Jeffrey R. Brackett's course on Public Charity for th Economics Department begins on Thursday, the 18th. The course will consist of ten<br />\nconferences, held on the 18th, and the nine succeeding Tuesdays.<br />\nThe University was visited last week by Professor Arthur Gamgee, the<br />\ngreat English physiological chemist. He was shown through the University<br />\nby Dr. Remsen.<br />\n<br />\nTI<br />\n<br />\n\f1()<br />\n<br />\nTHE NEWS-LETTER<br />\nTHE FOOTBALL TEAM OF 1902.<br />\n<br />\nNE is tempted, now that the period of storm and stress is over, to look<br />\nback upon the football season this year and make the comment \"Same<br />\nold story.\" But it has not been the same old story by any means, and<br />\ntherefore it is hardly just, to the college, or to the team, that the efforts made<br />\nand the success achieved should be passed over without a word of praise. To<br />\na certain degree, the story of this year's struggle to place a satisfactory team on<br />\nthe field is like that of former years; but never before have circumstances corn<br />\nlimed so strongly against us, and accordingly the tenacity and pluck that<br />\nfinally beat out a victory are more pronounced this season than in preceding<br />\nyears.<br />\nThe facts of the case are known to every undergraduate and every alumnus<br />\nwho retains an active interest in University affairs, but a brief repetition of the<br />\nconditions that stood out so appallingly at the beginning of the fall term may<br />\nremind Hopkins men of what they have really accomplished. Of lest year's<br />\neleven, two only remained in the college department of the University; one of<br />\nthese men, Yearley, was extremely uncertain as to whether he would be able to<br />\nget into the game again this year. The other, Captain Blanck, in addition to<br />\nthe worry and responsibility of making a team from almost nothing, was him<br />\nself handicapped by a badly torn ligament in his hip, the result of last year's<br />\nwork. The incoming class was very light, the Junior class also had no very<br />\nlarge men; there was no one to replace the players who had graduted in 1902.<br />\nTo make matters worse, the University was later in opening than usual, the<br />\ngrounds that we expected to play on were mixed up in litigation, and there was<br />\ngreat uncertainty as to our securing them. Finally the few men who did turn<br />\nout for practice were many of them entirely unacquainted with the elements of<br />\nthe game. It is no wonder that everyone, from the captain down, was not oversanguine as to results.<br />\nHowever, by dint of constant urging from Captain Blanck, and unceasing<br />\neffort on the part of all who were interested in having a team, a start was at<br />\nlength made. There is no use going into the details; the meds came out, one<br />\nby one, until we had a backfield, men in the undergraduate school developed,<br />\nand some who had never thought of playing football came out at our time of<br />\nneed. The scrub became more and more of a reality, regular practice produced<br />\nvisible results, and finally Hopkins had a team—not what the wildest enthusiast could call a star team, but one that we all felt would do us credit when<br />\nit went on the field—a team that we feared would have to prove its mettle by<br />\ntaking defeat like the sportsmen that we know they were.<br />\nIt was with such a team, that had not played together in its entirety for a<br />\nwhole week, that we met Western Maryland College for our first game. There<br />\nwas one thing that manifested itself before we left Union Station and that<br />\nhelped largely in the practical victory that we won later in the day. The whole<br />\ncollege understood the situation, knew the chances were slim, did not expect a<br />\nparticularly good game, and yet they turned out en masse to accompany the<br />\n<br />\nO<br />\n<br />\n•<br />\n<br />\n\fTHE NEWS—LliTTER.<br />\n<br />\n11<br />\n<br />\nteam on an all-day trip, just to show that<br />\nthey were backing the Black and Blue any<br />\nhow, under any circumstances, because it<br />\nwas our team. While the two captains were<br />\ndiscussing the length of the halves atWestminster, a Western Maryland man said,<br />\nOh, you fellows always say you are weak,<br />\nand then lick us. We can't beat Hopkins;<br />\nYour spirit won't let you lose.\" He was<br />\nhonestly of the opinion that we were insuperable, regardless of apparent lack of strength.<br />\nIt is unnecessary to go into the details of<br />\nthe game. Every man on the team felt that<br />\nWhether he was a crack player or not, his<br />\nbest was the only thing he could give, and<br />\nwhen eleven men work together in that spirit<br />\nthey are not easy victims for anyone. When<br />\neverything that enters into the question of a<br />\ngame is considered, weight, experience, organization, prestige, a record to sustain, an<br />\nold score to wipe out, home grounds, a sympathetic audience—the chances were all with<br />\nW. M. C.<br />\nIn spite of<br />\nthis, Hopkins was<br />\nCOACH GARWOOD.<br />\nthe winner until the last minute of play, and<br />\neven then Western Maryland was rendered<br />\nhysterical with joy at being able to tie the<br />\nscore. Undoubtedly, 6 to 6 this year was as<br />\ndecisive a success for J. H. U. as 12 to 0 was<br />\nlast year.<br />\nThe start made with Western Maryland<br />\nwas followed up by a decisive victory over<br />\nM. A. C., which was, however, more of a<br />\ntry-out for the Thanksgiving Day struggle,<br />\nthan an ultimate object in itself. The chances<br />\non paper for the U. of Md. contest were more<br />\nin our favor than the first game of the season,<br />\nyet the unexpected development of their<br />\nteam, and the introduction of seven old football men in the last week, turned the tables.<br />\nAs it was, the game our fellows put up was<br />\na thing to be proud of. In the end, Maryland was barely able to score once, and in the<br />\nfirst half we gained through them at will.<br />\nThe finest part of the game was when Hopkins held them for six successive downs<br />\nCA1\"fAIN 13L,ANCK.<br />\nwithin our last three yards of territory. That<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nalone was an exhibition worth all the work, and worry, and heart-burn that<br />\nthe up hill fight for the whole season had cost.<br />\nAnd right here let me say that the purpose of this sketch was not to give<br />\ninformation that you all know, but to show as clearly as possible the credit<br />\nearned by our season, and to draw from it a lesson that will help us in the<br />\nfuture. As to the credit, it belongs in the'first place to Fred. C. Blanck. All<br />\nthe work, and worry, and heart burn before mentioned fell first upon him, and<br />\nthe sufferings of others were merely reflected and sympathetic in nature. The<br />\ntask laid upon the captain this year was one that no man would like or willingly seek, and he fulfilled it right well. There is no need to amplify his<br />\npraise; every man who knows football at the University recognizes his deserts.<br />\nAfter the captain every man, 'Varsity or scrub, Med. or undergrad., who<br />\nslaved day after day in the cage for the honors of his college is entitled to and<br />\nreceives the admiration and gratitude of everyone. Finally, the manager, the<br />\ncoach, the trainer, and all who had the welfare of the team at heart, may feel<br />\nthat they have aided a plucky and successful fight against circumstances.<br />\nNow for the moral. After this year, let us never say: \"We cannot have<br />\na team.\" It is never too late, and times are never too hard, to make a try, and<br />\nwhen we make a good, hard, try, that in itself is victory. This year we won<br />\nonly a single game, tied one, and lost one; yet, beyond peradventure, everyone<br />\nis glad we did that instead of letting go, and having no team. Things can<br />\nnever be worse than they have been; if they are we will just have to crowd on a<br />\nlittle more effort and win out anyhow. That is the spirit that Western Maryland never can permanently beat, the good old \"Hopkins spirit.\"<br />\nH. B. S., '02.<br />\n<br />\nTHE JUNIOR-FRESHMAN FOOTBALL GAME.<br />\nHE gridiron at American League Park was covered with hard snow and<br />\nice on Saturday, the sixth, when the Junior and Freshman elevens slid<br />\ninto the field of vision. Upon each man's face was the determination to<br />\nhurdle icebergs if necessary, and to win in any event. This appeared in the<br />\nhard-fought game that followed, a game in which line-bucking was the feature,<br />\nsince the backs had neglected to bring their skates, and end runs were impossible. In these straight plunges, the Juniors were just a little the better, and<br />\nwith eighteen seconds to play in the second half, they scored a touchdown and<br />\ngoal<br />\nThe Juniors kicked off to Hudgins, who advanced the ball to the 40-yard<br />\nline. The slippery condition of the field made it impossible for the Freshmen<br />\nto try end runs, and consequently they pushed their backs through the line.<br />\nStone, Chism and Wroth tore through the Junior line repeatedly. The hurdling of Stone for the Freshmen was excellent, and most of their gains came<br />\nin this way. The ball was pushed steadily down toward the Junior's goal<br />\nuntil it was on their 10-yard line.<br />\n<br />\ne<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\n1904 TRAM AND suBsTrruTD:s.<br />\nHere '04 braced up, and the Freshmen backs were unable to gain<br />\nthrough the line, and were forced to try for a goal from the field. The ball<br />\nwas passed to Hudgins, but his kick went wide of the goal posts.<br />\nThe Juniors kicked, and it was the Freshmen's ball again. They tried the<br />\nsame tactics over, and again steadily advanced the ball to the Juniors 15-yard<br />\nline. Here they were held for downs, and, thereafter, '04's goal was not in the<br />\nleast danger. The rest of the game was spent in punting by both teams, the<br />\nhalf ending with the ball in the possession of the Freshmen in the gjniddle of<br />\nthe field.<br />\n<br />\n1905<br />\n<br />\nTRAM AND SUBSTITUTES.<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nIn the second half, the weight and experience of the Juniors began to<br />\ntell. The ball was in their possession almost the entire half. The Freshmen<br />\nplayed gamely, but they were unable to stop the fierce rushes of their opponents, who were straining every nerve for a touchdown. Tackle plays were<br />\nused again and again, with Pearre and Rosenfeld carrying the ball, and the<br />\nlatter was finally pushed over the line with only eighteen more seconds to<br />\nplay. Emig kicked goal, and the score stood 6 to 0 in favor of the Juniors.<br />\nIn the short time remaining, nothing was done, the game ending with the<br />\nball in mid-field.<br />\nThe game was clean and well-played, notwithstanding the difficulty of<br />\nrunning on the slippery surface. The ice was responsible for several bad<br />\nkicks, it being impossible to get a sure foothold for the kick.<br />\nThe announcement that the cane-rush was off disappointed the spectators,<br />\nespecially the fair but blood-thirsty admirers. The Seniors, however, had received notice from the faculty that they would be held responsible for any accident, and President Tootle accordingly had the rush postponed.<br />\nIt was a case of \"root or freeze,\" and even the feminine spectators<br />\njoined with the classes in cheering their favorites. The Juniors occupied the<br />\ngrand-stand, and their cheering was in charge of Crozier. The Freshmen<br />\ngathered themselves together in the bleachers, and kept themselves warm<br />\nwith their yells. Each class tried to \"out-root\" the other,. but the honors<br />\nwere about even. The Freshmen were led by Kinnane. At the close of the<br />\ngame the classes ended the season of rivalry by cheering each other.<br />\nFor the Juniors, Pearre, Strohbar, Emig and Rosenfeld played the best<br />\ngame, while the Freshman stars were Stone, Chism and Wroth. The ends<br />\nhad very little work to do, most of it falling on the backs of the two teams.<br />\nThe line-up was as follows:<br />\nJUNIORS.<br />\n<br />\nBranham,<br />\nRosenheim,<br />\nRosenfeld,<br />\nMuhly,<br />\nLicking,<br />\nErlanger,<br />\nFoster,<br />\nStrohbar,<br />\n<br />\nPRESHMRN.<br />\n<br />\nR.E<br />\nR T<br />\nR G<br />\nC.<br />\nL. G<br />\nL. T<br />\n<br />\nBaetjer<br />\n<br />\nDill<br />\nMiller<br />\nBanghart<br />\nBowie<br />\n.Campbell<br />\nE.<br />\nBoyce<br />\nL H.<br />\nChism<br />\nPearre (capt.)<br />\nR H<br />\nWroth<br />\nDulany<br />\nQ B<br />\nHudgins<br />\nEvans<br />\nF B.<br />\nStone (capt )<br />\nScore-6 0 in favor of Juniors. Touchdown—Rosenfeld. Goal—Emig.<br />\nUmpire—A. Yearley, '03 Referee—H. Straus, '02. Timers—W• Matthai, '03,<br />\nGittings, B. I,. S. Linemen—H. Stone, '0?, E. Dickey, '04. Time of halves<br />\n—20 minutes.<br />\n<br />\n\fTHE NEWS- L ETTER ,<br />\n<br />\n15<br />\n<br />\nTRACK AND FIELD PROCEEDINGS.<br />\n<br />\n(4)<br />\n<br />\nRP.:PARATIONS are now being made by Physical Director Mackdermott<br />\nfor three large indoor meets to be held in the cage sometime during the<br />\nfirst part of the year. These events will mark the most active winter in<br />\nthe athletic history of Hopkins.<br />\n\"Mack\" is planning to bring off in May the biggest athletic event of the<br />\nyear. He is working hard to arrange an inter-collegiate outdoor meet, in which<br />\ntrack and .field teams from the universities of Pennsylvania, Georgetown, Lehigh, and from several other institutions will compete. It is also intended to<br />\ninvite teams from amateur organizations throughout Maryland and the District<br />\nof Columbia.<br />\nThe first of the indoor meets will be an inter-class affair, and will be held<br />\nin the cage during the latter part of January. Mr. Mackdermott, Captain R.<br />\nC. Hoffman and Manager Dulany, of the track team, have the arrangements in<br />\ncharge. There will be the usual track and field events, and an inter-class relay<br />\nrace, for which a cup will be offered. Suitable prizes will also be given to the<br />\nwinners of the other events. This meet will be followed by two other open<br />\nmeets to he held in the cage sometime during February and March.<br />\nThe relay team this year promises to be one of the best that ever represented the University. So far, there seems to be rather a dearth of weightthrowers, pole-vaulters, and hurdlers, but there will probably be some candidates out for these places after the holidays.<br />\n<br />\nFABLES FOR THE FOOLISH.<br />\n<br />\nIn Words of a Few Syllables.<br />\n<br />\nt<br />\n<br />\nIV.<br />\n<br />\nTHE FABLE'01,\" THE LADY PRINCIPAL AND THE STRIKERS.<br />\n<br />\nHIS is a fable which does not begin \"once upon a time.\"<br />\nIt was a critical moment. On the other side of the green baize curtain<br />\ncould be heard the expectant hum of a hundred eager voices, for the<br />\nyoung ladies of the Annie Moore Seminary were assembled to hear the concert<br />\ngiven by the musical clubs of the Oysterville College. On the stage there was<br />\nno confusion, yet everything was indicative of the greatest excitement. There<br />\nstood the lady principal, faultlessly arrayed in a black silk with a white jabot at<br />\nthe throat. There stood the manager of the clubs with a look of anguish bespread upon his Gibsonesque features. Three men, one from each club, corn<br />\npleted the group. Beyond, in stolid silence, could be seen imperturable rows<br />\nof musical men, standing at parade rest. The situation was strained almost to<br />\nthe breaking point. The musical clubs were on a strike.<br />\n\"Please repeat your demands!\" said the lady principal.<br />\n<br />\n\f16<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\n\"They are as follows,\" said the tall man with the deep voice and the<br />\nsuave manner, \"we are tired of giving concerts at girls' schools and immediately after the performance having to undergo the anguish of seeing the young<br />\nladies trundled off to bed, inside of ten minutes. We are tired of being the<br />\ncenter of a system of espionage conducted by lynx eyed teachers, compared to<br />\nwhich the system of Sherlock Gillette is a three-spot in a dirty deck.\"<br />\n\"Now that you have stated your objections, what are your demands?\"<br />\nThe committee looked at their comrades in the backgronnd and took courage. Again the deep, dulcet tones of the glee club's representative burdened<br />\nthe air.<br />\n\"We demand that the young ladies be permitted to remain up until eleven<br />\no'clock.\" The lady principal turned pale. \"We demand that you call off the<br />\ndogs of war; in plain English, all those females whose duty it is to be Johnnie<br />\non-the-Spot.\" The lady principal fell limply into a chair. \"We demand that<br />\na certain number of cozy corners, one for each man, be provided with soft<br />\ncushions and dim lights.\" The lady principal went into a trance and with<br />\ndifficulty was restored by the prompt application of smelling salts. At last she<br />\nopened her eyes.<br />\n\"Is there anything else?\" she asked with feeble irony.<br />\n\"Nothing.\"<br />\n\"And what if I refuse?\"<br />\n\"There'll be no concert tonight,'' the three responded in concert.<br />\nIt was a moment of supreme portent, Seldom in the life of an individual<br />\ndoes it happen that such momentous questions are to be decided. Like a<br />\ndrowning man grasping at a straw she turned to the genial manager. With<br />\nsupreme resolve she smiled upon him, but guile was in her heart, and she said,''I<br />\nknow that you can manage them. You are a natural leader.\"<br />\n\"I am not the leader, I am the manager.\"<br />\n\"But they will do what you say\"<br />\nNow for three years the manager had been shaved by Walter and he was<br />\nProof against such flattery.<br />\n\"Fellows, is there anything doing?\"<br />\n\"Nothing doing,\" was the solemn reply.<br />\n\"You have heard the ultimatum, madam, do you accede?\"<br />\nOutside the expectant hum of voices was rising to a roar of indignation at<br />\nPerhaps it was that which helped to influence her. Never did she<br />\ndelay.<br />\nthe<br />\nThere was a regal grace in her every moment. Advancing<br />\nqueenly.<br />\nlook so<br />\nwere awaiting their leaders' return she said:<br />\nwho<br />\nmen<br />\nbefore the<br />\nmen; there'll be no strike to-night.\"<br />\nstage,<br />\nthe<br />\nto<br />\n\"Back<br />\nfiled on the stage, and the strike was off. This is<br />\nmen<br />\nthe<br />\ncheer<br />\nWith a<br />\nthey had that tired but happy look the next<br />\nwhy<br />\nof<br />\nthe only true account<br />\ndefeat was going to hand her one anyway,<br />\nthat<br />\nsaw<br />\nprincipal<br />\nday. The lady<br />\nwent off according to agreement.<br />\neverything<br />\nand<br />\nso she accepted it gracefully<br />\nMoRAL—This fable teaches freshmen that the worm has a habit of turning.<br />\n<br />\n\fTHE CHEAPEST PLACE<br />\n<br />\nC.,V P.'Phone J53-V.<br />\n<br />\nIN BALTIMORE FOR<br />\n<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br />\n<br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\nMathematical and Surveying Instruments,<br />\nDraughtsmen's and Engineers' Supplies.<br />\n<br />\nH. S. WRIGHT ek CO.,<br />\n<br />\nN. W. Corner<br />\n<br />\n704 MADISON AVE.<br />\n<br />\nLexington and Liberty Sts.<br />\n<br />\n1/U -11/%1012E, MD.<br />\n<br />\nAgent .for .Kevffel .1'. Esser ,Co., of New<br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\n<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br />\n<br />\nHenderson's<br />\n<br />\n.0<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Hooks, Note Hooks,<br />\nMadison<br />\nStudents' Supplies.<br />\n<br />\nFOR<br />\n<br />\n0Howard<br />\n<br />\nADVERTISING SPACE IN THIS PAPER<br />\nAPPLY TO<br />\n<br />\nt*ET,e.e.eeoziepp<br />\nPUBLISHERS.<br />\nh1,1,1 ,rs<br />\n<br />\n,1.11<br />\n<br />\nEALILMQ111:,IVID<br />\n<br />\nMO 010, :out, A., 71+1<br />\n<br />\nM. MEADE<br />\n<br />\nOF I ONIDoN<br />\n<br />\nEXPERT CLEANER AND DYER.<br />\nST. (2nd and 3rd Iloorsi.<br />\n<br />\n1'26 N. it<br />\n<br />\nThe most, eomplete and modern department for<br />\ncleaning, dyeing mill altering Gents' and Ladies'<br />\ngarments.<br />\nIt's time tour Winter Clothing was put in order.<br />\nDoes it need to be cleaned, dyed, altered or repaired'? Are new linings and veh.et, collars necessary?<br />\nNever mind what's the matter, we will fix It up to<br />\nlook like new, and you won't have to pay very much<br />\neither. The Price List speaks for itself.<br />\n<br />\nM. BERNSTEIN 8z. CO.<br />\nDINDON—AMEKICAN<br />\n<br />\n...TAILORS<br />\n<br />\nAND<br />\n<br />\nIMPORTERS...<br />\n<br />\nLOW PRICES AND FINE WORK.<br />\nWe make clothes that fit well, look well and wear<br />\nwell, that's very important.<br />\nThe most fastidious man can tind nothing to growl<br />\nabout our garments.<br />\nThe same attention is given to the 111Ra that is less<br />\nparticular, it's our way.<br />\nWe are prepared to show you a largo line of Imported woolens, which does not Cost any 1(0 lie then<br />\nthe domestic.<br />\n\"SEE US BEFORE BUYING\"<br />\n126 NORTI I 11 !\"17AW :•;TI•21!1:T.<br />\nCo.)<br />\n(Second door above Joel (<br />\n<br />\nGENTLEMEN'S CLOTHING<br />\nCONTRACT.<br />\n<br />\n$1.50 PER<br />\n<br />\nPRESSED<br />\n<br />\nBY<br />\n<br />\nMONTH.<br />\n<br />\nPRICES FOR OR C LEA N 1 NG AND 1)1. El NU<br />\nGentlemen's Suits cleaned and pressed<br />\n$I<br />\nTrousers,<br />\nCoats,<br />\n5<br />\nVests,<br />\nOvercoats, •<br />\n1<br />\n!toys' S'ults, aecording to size,<br />\n.50, .75 al<br />\nVol vet collars on liverconts,<br />\nRELINING. —A new lining will often make a garment which you have discarded good for another<br />\nseason's wear. All altering and repairing dime here<br />\nby skilled tulle's.<br />\nDYEING.<br />\nGentlemen's Suits dyed arid pressed,<br />\n$2.00<br />\nOvercoats,<br />\n1.50<br />\nBoys' Suits, according to size<br />\n1.00, 1.251111d I.50<br />\n<br />\nCLOTHES MADE TO' ORDER.<br />\nThe Illustrat ions show how the chitties we make fit<br />\n<br />\nand look--tin' wear you'll learn about later.<br />\nThe light overcoat,is an especially snappy garment.<br />\nThe sack suit is cut after the very newest nattern.<br />\nThe winter overcoat is as swagger as the dressiest<br />\nMtn C011id wish.<br />\n%Ye make all other proper styles, of course; dress,<br />\ncutaway, double-breasted, four-button sack and •<br />\nNorfolk suits.<br />\nYou can now have first pick of our first, pick of<br />\ncloths.<br />\nPrices are low—we never learned to charge too<br />\nmuch. We would like to make your clothes.<br />\nLOWEST PRICES EVER KNOWN.<br />\nWe guarantee to give you latest, style nod a tierfeet fit. Workmanship will be the best you oversaw.<br />\nYour money hack if you are dissatisfied.<br />\nBrANSTEIN & CO.<br />\n126 N. Eutaw<br />\nSEE OUR PRICE LIST FOR CLEANING, DYEING AND ALTERING.<br />\n<br />\n\fCOON'$330,000. urIusiiU UNIVIded P101118 $400 000<br />\n<br />\nST1EFF PIANOS<br />\n<br />\nDrovers Sr Mechanics Nat'l Bank,<br />\n<br />\nMADE OF THE HEST MATERIALS MONEY<br />\nAND EXPERIENCE CAN<br />\nWANIONOUMNI<br />\n<br />\nOF BALTIMORE.<br />\n<br />\nBUY.<br />\n<br />\n9 N. 1,11114.1RTY ST.<br />\n<br />\nBooksellers and<br />\nStationers.<br />\n34 W. BRLT1M0RE STREET.<br />\n<br />\nGUSHING &GOMPRNY<br />\n<br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nKeep constantly on hand the Text Books used<br />\nin Julius Ilopkins University and the Woman's<br />\n0<br />\n50<br />\n0<br />\n0<br />\nCollege of Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nHaberdashers,<br />\nShirts, Neckwear,Underwear<br />\nMENISMINMMINMEMMEMI Hosiery, etc.<br />\n<br />\nTHOS.BLAKE CO<br />\n<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\n<br />\nOn Sale The J. H. U. Pennants, and all other College<br />\nPennants.<br />\n<br />\n219 EAST BALTIMORE ST.<br />\nA H. FETTING,<br />\nMANUFACTURER<br />\n<br />\nI.. Strouse, Vice-Prot.<br />\nEdw. P. Hayden. Assl Cashier.<br />\n<br />\nJas. Clark, Prof<br />\nChas. S. Miller, Cashier.<br />\n<br />\nA General Banking Business Transacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom $3 p r year and upward.<br />\n<br />\nficcounts Solicited.<br />\n<br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LFHIVIAN & SON.<br />\nFOR<br />\n<br />\nGO. inAW11S1(4470AVI..<br />\nSTRBIAII<br />\nJORDAN<br />\nSamples submitted of<br />\nReads as follows:<br />\nFrench Brandy—no adulterants, no coloring, tine quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong,<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br />\n<br />\nIlgenfritz Studio<br />\nSuccessor to Cummins.<br />\n<br />\nOr<br />\n<br />\nGreeh letter ifraternitv 3ewetrv,<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\nPlease Call stO Examine our line 3Sefore Purehasina.<br />\n<br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial 'Discount to Students.<br />\ntelephone 443 2.<br />\n<br />\nJENNINGS<br />\n<br />\ntiL<br />\n<br />\nLibraries arranged and put in<br />\norder without removal. 4r if<br />\n<br />\nHORSEY,<br />\n<br />\nR UZICKA<br />\ntto<br />\nw4,60<br />\n<br />\nMERCHANT TA IL/pHs,<br />\n21 W. PAYETTE) STri<br />\n<br />\nBookbinder,<br />\n<br />\nBOOKS!!!<br />\nSECOND=HAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nBought, Sold and Exchanged.<br />\n<br />\nPIPPEN'S BOOK STORE,<br />\n605 N. EILYTR.W ST.<br />\nNear the University.<br />\nBaltimore's Largest Old Book Store.<br />\n<br />\nJ. H. U. Binder.<br />\n<br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE.<br />\n<br />\nTHEO. WARNER.<br />\n<br />\nWARNER et<br />\n<br />\nCO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln & Bennett and<br />\nWalter Barnard's London lints.<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\n01 jar 0/.) X' 71 S Caps<br />\n.<br />\nSilk and Cassimere Hats. 4<br />\n<br />\nGO.<br />\nS.<br />\nS.<br />\nLLOYD<br />\nN<br />\nNORM GERMA<br />\nRATES.<br />\nLOW<br />\nGABIN PASSAGE AT<br />\nNew York to Brun, London, Paris, Gibraltar, Naples,<br />\nBfiLTIMORE TO BREMEN DIRECT.<br />\n<br />\netc.<br />\n<br />\nR. SGRUMRGREII Sc GO., General Auents.<br />\n<br />\nFor particulars apply to<br />\n<br />\nTHE<br />\nInstrument Co.<br />\nSurgical<br />\nChas. Whims<br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\nOCII0d,<br />\n<br />\n'Baltimore, Md.<br />\n<br />\n--MEIKLE,<br />\nISAAC H. DIXON, PRIEST.<br />\nJAS. R. RICHARDS, Tar...<br />\n<br />\nSmith Dixon Co.<br />\n29 - 31 S. Charles Street.<br />\n<br />\n\f", "format": "basic_html", "processed": "December ig, 1902<br /><br />\nVol. VII, No. 5<br /><br />\nTHE<br />\nNEWS 1.1.11)<br /><br />\nLETTER<br /><br />\nA<br />\nFOOTBALL<br />\nNUMBER.<br /><br />\nPUBLISHED BY STUDENTS<br /><br />\nJOHNS HOPKINS UNIVERSITY<br /><br />\nThe Johns tiopKins Universitu<br /><br />\nThe Johns tlookins Press.<br /><br />\nBALTIMORE, MARYLAND.<br />\n1.<br /><br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October 1, 1902.<br /><br />\n11.<br /><br />\nItmerican 3ournal of fiDatbematics.<br />\nE. MORLEY, Editor. Quarterly. 4to.<br />\nXX V in progress. $5 per volume.<br /><br />\nVolume.<br /><br />\n%American Chemical 'journal.<br />\nI. REMSEN. Editor. Monthly. Svo.<br />\nX XVIII in progress. $5 per volume.<br /><br />\nVolume<br /><br />\n111. limerican aournal of Philotogv.<br />\nI. GI LDERSLEEVE, Editor. Quarterly. Svo.<br />\nVolume XX Ill in progress. $3 per volume.<br /><br />\nPresident: IRA ItFlamm. Dean of the, Medical Faculty:<br />\nW Ild.tAM H. How KM,. Dean, of the College Faculty:<br />\nBewAtto II. GuirriN.<br /><br />\nIL<br /><br />\n%Mies from the Viological liaboratorv.<br />\nVolume V complete. $5 per volume.;<br /><br />\nInstruction.<br /><br />\nW.<br /><br />\ntubteein lbistorieta nub {Political 93cience.<br />\nMonthly. Hvo. Series XX in progress.<br />\nvolume.<br /><br />\nFOR GRADUATE STUDENTS:<br /><br />\n•<br /><br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLibraries.<br />\n1050)0 volumes.<br />\nUniversity,<br />\nPeabody Institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br /><br />\nLaboratories.<br />\nChemistry.<br />\nPhysics.<br />\nIleology and Mineralogy.<br />\nZoology<br />\nA natomy.<br />\nPh ysielogy.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinieal Medicine.<br /><br />\nSeminaries.<br />\n(Ireek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nItormince.<br />\nEng!ish.<br />\nII story,<br />\nRetiree:lies.<br />\nMathematics.<br /><br />\nDirectors.<br />\nIra Remsen.<br />\nJoseph ,S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Bowen.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oster.<br /><br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XXII in<br />\nprogress. $1 per year.<br />\n1011. 3ohne lbophins tospital 113a1(etin. Monthly. 4th.<br />\nVolume XIII in progress. $1 per year.<br />\n3ohns lhophins /hospital 'Reports. 4to. Volume X<br />\n•<br />\nin progress. $6 per volume.<br />\nIX.<br /><br />\nContributions to Beevriologv sub Comparative<br />\nSemitic Vbilolo(tv, Beitrage zur Assyriologie, etc.)<br />\nVol. IV complete.<br /><br />\nX.<br /><br />\nMemoirs from the Eloloaical %nboratorv.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br /><br />\n•<br /><br />\nMobern 1.anguage Votes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to.<br />\nXVII in progress. $1.50 per volume.<br /><br />\nVolume<br /><br />\nX11. 3ournal of Experimental fieetleine.<br />\nW. 11. WELCH, Editor. Bi-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nX111. Itinerican 3ournal of Insanitv.<br />\n11 EN HY M. HUED, Editor. Quarterly.4to. $5 per<br />\nvolume.<br />\n•<br /><br />\n'reports of fiBarvlanb Seological Survev.<br />\nWILLIAM B. CIA UK, Editor.<br /><br />\nflP.<br /><br />\nterrestrial flhaanetism nub litmaspheric Elec.<br />\ntricitv. L. A. BA I ER, Editor. Quarterly. tivo.<br />\nVolume VII in progress. $2.50 per volume.<br />\nItnnual 'Report.<br />\nPresented by the President of the Board of Trustees reviewing the operations of' the University<br />\nduring the past academie year.<br />\nTinnual'Register.<br />\nGiving the list of officers and students,and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic, year.<br /><br />\nDirectors.<br />\nBasil L. G ildersleeve.<br />\nKirby P. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\n.11101(14 11% Bri)/ht.<br />\n.10,11 31. 1.i Cid<br />\n!I. Ifollomier.<br />\n.11,,r1c11.<br />\ns. Awe,.<br /><br />\n$3 per<br /><br />\n3obne tropkins tiniversitv Circulars.<br /><br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. Ti.; courses for physicians.)<br /><br />\nFOR UNDERGRADUATES:<br /><br />\nSvo.<br /><br />\nUndergraduate Courses (leading to B. A).<br />\nGroups.<br />\nI. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Biological<br />\n(leading up to medicine).<br />\n4. Geological-Biological.<br />\n6. Latin-Mathematical.<br />\n6. Historical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br /><br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol. XXV).<br />\nAmerican Chemical Journal (vol. XXVIII).<br />\nAmerican Journal of Philology (vol. XXIII).<br />\nStudies in Historical and Political Science (vol. XX).<br />\nModern Language Notes(vol. XVII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A smyriology (vol. IV).<br />\nTerrestrial Magnetism (vol VII).<br />\nUniversity Circulars(vol. XX II).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the A rtm and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br /><br />\nIn addition to the serials above named, collies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.50.<br />\nThe Critical Edition of -the Hebrew Text of the Old<br />\nTestament. Edited by Prot'. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins Hzumital. .1. S. Billings, Editor. 116 pp. 4to. 66 plates. $7.60 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simile edition. Edited by .1. liendel Harris. 110 pp. 4to. 10.<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS. with A ntilegomena Epistles. Edited by I. H. Hall. $3.00.<br />\nIlibliographia Hopkinsiensis. Part I. Philology. Parts<br />\n1141 I. Chemistry, Mineralogy and Geology. l'arts,<br />\nI V-V-VI. Phys,ics,Astronorny and Mat hernatics.<br />\ns vo. 30 cents per part.<br />\nft lull list of publications will he sent on application.<br /><br />\nCommunications In respect to exchanges and remittances<br />\nmat' be sent to Johns 'Hopkins Press, Baltimore, Md.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VII.<br /><br />\nDECEMBER 19, 1902.<br /><br />\nNo. 5.<br /><br />\nTHE BLACK SATCHEL.<br />\nCCJ M MODATION for Cleveland, Chicago, and the Northwest!\"<br />\nbawled the porter, walking through the main waiting-room of the<br />\ndepot. The few travelers who sat drowsily around roused themselves, and passed out of the warm station and through the grated doors into<br />\nthe snow and cold of a winter night. I had just time to purchase my ticket,<br />\nand tightly clutching my small black satchel to step on the platform, when the<br />\nmidnight train, its dazzling head-light cutting through the darkness, rolled into<br />\nthe depot—ten minutes late.<br />\nCrossing several tracks, I walked quickly down the long line of baggage,<br />\nexpress, and passenger cars, and boarded the last coach. The steam rushed<br />\nand hissed angrily from the dome of the engine as if the mighty creature were<br />\nimpatient at the delay, and wished to be off and once more rush through the<br />\ndarkening clouds of snow, and awaken the sleeping hills and hollows with its<br />\nhoarse shriek. The huge engine quivered and shook, snorted once, twice, and<br />\nthen again and again, moved slowly forward, and in a moment was well under<br />\nway, and tearing through the night with a thousand miles of track before it.<br />\nI settled myself back in my seat, and prepared to pass the long night ride<br />\nas comfortably as I could. The smell of smoke reached me, the door was<br />\nslammed, and the brakeman, carrying a lantern in each hand, passed through<br />\nthe car, leaving me its sole occupant. Solitude, it is said, is most conducive<br />\nto thought, and in a short time the events of the day were passing through my<br />\nmind in rapid review, and in particular, those which had culminated in my<br />\nleaving New York at midnight for the West. I glanced at the small black<br />\nsatchel which lay on the seat beside me, and instinctively felt for my arms.<br />\nMy thought flew back to the first day, not many years ago—for I was still a<br />\nyoung man—that I had entered the service of Thomson &amp; Blank, bankers, one<br />\nof the largest firms in Wall Street. By degrees I had worked my way up,<br />\ngradually gaining the esteem and good-will of the firm, till now I occupied the<br />\nchief place in their large establishment. Frequently before I had been sent on<br />\nerrands similar to the one in which I was at present engaged, but none was<br />\never of such vast importance. Frequently large sums of money had been entrusted to my care, but never before such an amount as the small black satchel<br />\nnow contained. It was in the afternoon of the first day of February, 1871, that<br />\nI had been called into the small private office of Mr. Thomson. It was an<br />\nhour later that I emerged, having received full instructions regarding my mission,—the details of which for certain reasons I will not make known,—but let<br />\nit suffice that I was to act as the firm's confidential agent in consummating one<br />\nof the largest deals in which it had ever been engaged.. The entire affair so far<br />\n44<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nas known to the firm and myself, had been kept a jealously guarded secret; but<br />\nto make certain that they could not be forestalled in the transaction, and for the<br />\nquicker transfer of such a sum, it was decided that I should leave that very<br />\nnight.<br />\nWith a start I came out of my reverie. I had almost dozed off. A little<br />\nfrightened, and now throughly awake, I lit a cigar, and turning to the window<br />\ntried to gaze into the blackness beyond. We dashed through some small town,<br />\nscarcely distinguishable in the darkness and the storm, and in a moment left it<br />\nbehind us. Straining my eyes in the effort to pierce the night, I saw the red<br />\nsparks streaming by, and occasionally caught the dim outline of a house or<br />\ntree We passed through a cut, the light from the car racing and dancing over<br />\nits snow-covered side, and framing in pale streaks the bushes and shrubbery that<br />\nraced by. Once more we emerged upon the open plain, rolling away to the<br />\nwestward and lost in the black blur of the distant foothills. The train rumbled<br />\nover a trestle, the narrow rapid stream flowing far below. A chill passed over<br />\nme when I thought of the possibility of jumping the rail. I turned back to<br />\nthe brightly lighted car, and gave a slight start. So absorbed had I been in<br />\ntrying to pierce the darkness, that I had not heard two men enter, who now<br />\noccupied seats in front of me and on opposite Sides of the aisle. Evidently,<br />\nthey were strangers, and each seemed absorbed with his own thoughts. I fell<br />\nto studying the man on my left; he was well built and of genteel appearance,<br />\ndressed quietly and with taste, his hair was jet black, and he was, at least as<br />\nfar as I could judge from the profile turned toward me, of a dark complexion.<br />\nThe second traveler was of the ordinary type, large, robust, and light-haired.<br />\nMy cigar had gone out; I lit it again, and the dark man turned partly around<br />\nin his seat, then arose, and, approaching me with an easy grace, asked for a<br />\nmatch. I accommodated him, and he bowed slightly. \"Going to Chicago?\"<br />\nhe said.<br />\n\"Yes. Will you sit down?\" And I made room for him on the seat beside<br />\nme. In a short time we were launched deeply in conversation. Time passed<br />\nand the train rushed on, the cars swinging and jarring as we rounded some<br />\ncurve. My companion I soon found to be an educated and well-read man.<br />\nPresently, however, the conversation began to lag, and laying his cigar down<br />\non the arm of his seat, the stranger seemed lost in thought. I glanced at the<br />\nother occupant of the coach. He was to all appearances asleep.<br />\nSomehow I was seized by a terrible presentiment of impending danger, one<br />\nof those inexplicable sensations which sometimes come to a man in battle or in<br />\ntimes of great excitement. I turned to my companion, and uttered a cry. He<br />\nhad risen from his seat, and standing in the aisle, with an indescrible look upon<br />\nhis dark face, was pointing toward the rear of the car. He wheeled about like<br />\na flash. There was a crashing blow on my head, lights innumerable danced<br />\nbefore my eyes, my brain was on fire. I seemed to be sinking, sinking, for<br />\ncountless ages always down, down, and at last was smothered and swallowed<br />\nup in darkness, and then drowsiness came over me. I had no desire to see or to<br />\nhear, only a great longing to forget. It seemed as if the current of my mind<br />\nhad stopped.<br /><br />\nTHE NEWS-LETTER.<br />\nOn opening my eyes I became conscious of a burning pain in my head.<br />\nMy first thought was of the black satchel. I felt beside me. It was gone!<br />\nI was bewildered, semi conscious, and possessed by an awful feeling of<br />\nunreality. My surroundings were not familiar, but by degrees as my mind<br />\ngradually cleared, I became aware that I was lying on a hard, polished floor<br />\nbeside a couch. I put my hand to my head; it was covered with blood. There<br />\nwas blood also upon the floor. I must have had a severe fall.<br />\nThe room was spacious and magnificently furnished. Strange! I did not<br />\nknow where I was. Then I thought of the satchel and my mission and grew<br />\nsick at the thought. I heard a light foot step, and a lady entered the room.<br />\nShe was of middle age and still handsome.<br />\n\"We dine at six, John,\" she said softly.<br />\nTurning to her I replied bluntly, \"Where am I?\"<br />\n\"J—J—Why, really, what is the matter,\" stammered the lady. \"Are you<br />\nfeeling—er—as well as usual, John?\"<br />\n\"In heaven's name—,\" I began, \"where am I, and who are you?\"<br />\n\"I am your wife and you are in your own home in London. Don't you<br />\nknow—\"<br />\n\"How do I know?\" I cried wildly. ti 9,<br />\n\"You have gone mad,'' she said.<br />\nTurning I saw a large mirror at one end of the room. I quickly approached<br />\nit, but fell back aghast. In place of my own,features the mirror reflected theface<br />\nof an old man—a man prematurely aged,—with white locks and a long snowy beard!<br />\nI looked at myself with horror-stricken eyes and jaw half fallen. Then every<br />\nobject danced around me, the room and the lady became lost in a giddy maze,<br />\nand my senses failed<br />\nWhen I regained consciousness, I found myself in bed, with kind though<br />\nunfamiliar faces around me. A violent fever kept me for weeks within the<br />\nshadow -of death, but thanks to the tender care of the lady who had claimed to<br />\nbe my wife, I slowly recovered. During my convalescence I was told the story<br />\nof my second life. It was for the most part ordinary enough. I had turned<br />\nup in London one day, a poor but perfectly rational man, but without the<br />\nslightest remembrances of my life previous to the night adventure in the railway car. I had engaged in business, met with success, and married, and<br />\nwould have died without ever having found out my real name, had not my fall<br />\nfrom a sofa upon the hard floor and the consequent injury to my head restored<br />\nmy reason in a manner most miraculous. All this and much besides my wife<br />\ntold me as I recovered slowly from my long illness.<br />\nThe story of my early life was nearly as much of a relevation to my wife as<br />\nher story was to me. I was now once more a healthy and happy man. And<br />\nthere remains but little more to tell. My first duty was to communicate with<br />\nmy old employers, Thomson &amp; Blank. The result of my inquiry was to find<br />\nout that the partnership had been long since dissolved and that both the old<br />\ngentlemen were dead. They, as I myself, would never learn the fate of the<br />\nblack satchel.<br />\nE. P. SANPRocK, '03.<br /><br />\nTHE NEWS—LETTER.<br />\nTHE LOOM OF DREAMS.<br />\nWhat shall I weave upon my loom of dreams<br />\nTo give my lady in a dainty rhyme?<br />\nSome sylvan memory of summer time,<br />\nOf silent woods and slow and sleepy streams?<br />\nSome fantasy of fairy-like design,<br />\nWith opal woof and warp of amethyst,<br />\nLike little waves by melting moon-beams kissed<br />\nWhen it cloth seem the stars forget to shine?<br />\nOr shall it be a song in martial strain,<br />\nOr a wild song of the wild, winter sea?<br />\nA dirge for A atunin, a low threnody,<br />\nAs if the wind did to the moon complain?<br />\nNo, none of these; for her my dream-loom weaves<br />\nDream-fancies of a land forever Spring;<br />\nWhere fountains 'neath the wooing willows sing<br />\nOf youth and love, echoed by rustling leaves.<br />\nSuch was the scene those Springs in Arcady<br />\nWhen still the gods inhabited the vales,<br />\nAnd l'an went piping through the grassy dales<br />\nWith dancing nymphs to keep him company.<br />\nJust such a fancy shall my dream-loom weave,<br />\nAll built of airy nothings which are gone<br />\nOn waking, like the yellow stars at dawn;<br />\nAnd yet the mind some impress doth receive,<br />\nSome impress faint, as of a long-lost song<br />\nHeard once in childhood from a crooning nurse.<br />\nI'll charm my lady's ear with such a verse<br />\nAs might be sung at eve by elfin throng.<br />\n'Tis this I'll weave out of the idle air<br />\nTo cast around her in a mystic spell;<br />\n0 may she own she could not think to dwell<br />\nE'en in that dream unles4 I could be there!<br />\nII K. TOOTLE,'M.<br /><br />\nALUMNI.<br /><br />\n'87<br /><br />\nDr. C. H. Haskins has been appointed Professor of History, Harvard<br />\nUniversity.<br /><br />\n'90<br /><br />\nW. H. Browne, Jr„ is Technical Editor of the \"Electrical Review,''<br />\nNew York.<br /><br />\n'92<br /><br />\nDr. W. A. Montgomery has been appointed to the post of Classical<br />\nMaster, Sewanee Grammar School, Tennessee<br /><br />\nDr. J. H. Latane is Professor of History at Washington and Lee Uni•<br />\nversity.<br />\nDr. Albert M. Reese is Instructor in Biology at Syracuse University.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n5<br /><br />\nDr. C. C. Schenck is Instructor in Physics at McGill University, and<br />\nDemonstrator to Senior Classes in Electricity.<br />\n'95<br />\nD. G. 0. James is Instructor in Mathematics and Astronomy, Lehigh<br /><br />\n'93<br /><br />\nUniversity.<br />\nCharles B. Clark has removed to Baltimore from Georgia, and will hang<br />\nout his shingle as Railroad Constructing Engineer.<br />\n97<br />\nDr. T. R. Clarke has been appointed Instructor in Oriental Languages<br />\nat the University.<br />\nE. L. Bowlus is Instructor in Biology at Monmouth College, Ill.<br /><br />\n'98<br /><br />\nAlbert G Stidman is Instructor of French at Lehigh University.<br />\nDr. Harold Pender is Instructor in Physics, Syracuse University.<br /><br />\nG. D. Davidson is now Professor of Romance Languages, Rawlings<br />\nInstitute, Charlottesville, Va.<br />\nE. B. Fosnocht is Master of Modern Languages at Cheltenham Academy,<br />\nOgontz, Pa.<br />\nAndrew Reid Bird writes from Milan that \"it is indeed an inspiration<br />\n'01<br />\nto view the Iron Crown of Lombardy—with phasing remembrances of the Major<br />\nHistory Class of '99-'00.' He will not return from his European tour until<br />\nthe end of next year.<br /><br />\n99<br /><br />\nW. S. Weedon, Ph. D., '02, was married to Miss Mary Brown, of this city,<br />\non the 17th. Dr. and Mrs. Weedon will make their home in Schenectady.<br /><br />\nY. M. C. A. NOTES.<br />\n. SPLENDID talk was delivered during the meeting at the Medical School<br />\nSunday evening. Mr. Mott spoke very powerfully of the Christian work<br />\nin universities and colleges of North America, Great Britain, Germany,<br />\nScandinavia, France, Australasia, Japan, China, and India. Dr. Mott showed<br />\nthat the wonderful growth in all these lands during the last few years attests, beyond doubt, that the thinking mass of our universities are acknowledging Jesus<br />\nChrist as Lord and Savior.<br /><br />\n11(<br /><br />\nMr. Tom Jays, who represents the British Student Volunteer movement,<br />\nand is now on leave of absence for one year to travel among American institutions, will be in Baltimore January 10-12. There will be a meeting of all college<br />\nmen of Baltimore on that (Sunday) afternoon. It is hoped that Hopkins men<br />\nwill avail themselves of this opportunity.<br />\nDr. Murray Brush is leading Morning Prayers this week.<br />\nJ. A. Addison, '03, and M. B. Graff, G., reported Tuesday on their trips to<br />\nTrenton and Princeton, which were very interesting.<br /><br />\n()<br /><br />\nTHE NEWS-LETTER.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the 'University Year by the Students of THE<br />\nJOHNS<br />\nHOPKINS UNIVERSITY.<br /><br />\nDECEMBER 19, 1902.<br />\nSubscription $1.50 per year.<br />\nEditor in Chief, .<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n.<br />\nAssistant News Editors<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAs.iistant Business Manager,<br /><br />\n10 Cents a single copy.<br /><br />\n.<br /><br />\n3<br /><br />\nROBERT S. LAMER, 1903.<br />\nHARRY K. TOOTLE, 1903.<br />\nGEORGE A. FOSTER, 1904.<br />\nREGINALD S. °PIE, 1904.<br /><br />\nW. S. BIRD 1908.<br />\nI. J. NEWMAN NUMSEN, 1904.<br />\n.<br />\nHARRY BAETJER, 1903,<br />\n. Ricionsr BUCKLER, 1904.<br /><br />\nAddress all articles, communications, etc., to ROBERT S. LANIER, box 374, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\nJ. H. U.: or box :395, Medical School of Johns Hopkins Hospital.<br /><br />\nHARRY BAETJER,<br /><br />\nIMM...••••••••<br /><br />\n4 4(rOHEN is all the hazing to be over? When may I wear college colors<br />\nwithout let or hindrance?'' To this recent query of a Freshman<br />\nthe bystanders had no very definite answer to give. He was told to<br />\n''try it and see.\" So it has seemed advisable to say here, for the benefit of<br />\nthose who do not know, that the discipline exerted by the Junior Class in such<br />\nminor matters stops, according to tradition, after the interclass football game.<br />\n\"But there was hazing in the last college year at the end of February,\" some<br />\none says. Very true, but it was for a special case. A group of '04 men attempted to interfere with the '03 banquet, and to prevent the attendance of<br />\nPresident Plaggetneyer. This was resented by the then Juniors, not only because they had declared nn their own part a policy of non-interference with<br />\nclass banquets, but also because the matter occurred on the eve of the quarter<br />\ncentennial celebration of the University, and the spectacle of undergraduates<br />\nengaged in a scuffle on the street would have been a sorry happening at a time<br />\nwhen the University was the center of attention. For these reasons, '03 enforced the regulations concerning college colors and class numerals for a couple<br />\nof weeks. The whole business, of course, is each year at the discretion of the<br />\nJunior Class. But there should be cogent and specific reasons for departing<br />\nfrom the tradition that peace and friendship reign after the class football game.<br /><br />\nTHE NEWS—LETTER,<br /><br />\n7<br /><br />\nHE mix up concerning this year's cane-rush is not very creditable to those<br />\nmost actively concerned. Out of so many conflicting explanations for the<br />\nnon-occurrence of the event, it is difficult to draw .a single theory. The<br />\nfacts in the case are that the rush has not come off, that it may not come off<br />\nuntil after the holidays, and that it is poor class policy to let such an institution lapse. Previous classes have entered into the spirit of the rush, have carried it out successfully, and have benefitted by the opportunity to \"let off<br />\nsteam.\" If there is really a prevailing sentiment that the nature of the rush<br />\nincludes au unnecessary amount of brutality, there could be substituted for it<br />\ncane \"sprees,\" such as have been used at Princeton and other colleges. Three<br />\nchampions are chosen from each class—light, middle, and heavy weight—and<br />\nthe three pairs are matched to wrestle for the cane, which the two contestants<br />\nhold as do the class presidents in our plan. At any rate, the '04 and '05 men<br />\nare expected to do something besides accuse each other of backing out. Such<br />\nconduct belongs more to professional pugilism than to class athletics at an<br /><br />\nt<br /><br />\nAmerican University.<br />\nTHE MUSICAL CLUBS.<br /><br />\nC<br /><br />\nHE Clubs are now looking eagerly forward to the Christmas excursion,<br /><br />\nnow that the Hannah More trip, the last of the four trial concerts, is<br />\nover. From a musical point of view, this was only moderately successful. The Banjo Club i managed to get through its new piece, \"Our Director,\"<br />\nwithout comment froni the audience. The Mandolin Club did not keep up the<br />\ngood start it had made; some portions of the \"Loin du Pays\" were extremely<br />\nragged. A two-hour rehearsal on Saturday, however, did it much good. The<br />\nGlee Club is beginning to show the result of much hard work. Altogether,<br />\nprospects are good for creditable performances on the holiday trip.<br />\nThis will extend from Monday, the 29th, to Friday, January 2. Details<br />\nare not quite settled, as it was only recently that the management found it necessary to abandon the first plan of an appearance at Norfolk. But, so far as<br />\nhas been arranged, the dates will be as followE:<br />\nMonday, December 29—Leave on night boat of Baltimore, Chesapeake<br />\nand Atlantic Company.<br />\nTuesday—Concert. and dance at Cambridge.<br />\nWednesday—A real old \"Easte'n Sho'\" dinner—terrapin, ducks, etc.—at<br />\nSalisbury, followed by concert and dance at night.<br />\nThursday—Concert and dance at Easton.<br />\nFriday—Return to Baltimore.<br />\nThe men will be largely entertained at private houses, and prayers for snow<br />\nand narrow seated sleighs are being made by tho.e whose inclination leads them<br />\nto the society of the fair sex. However, a good time will be on hand in any<br />\nevent for those who make the trip, and many are the anxious faces when three<br />\nor four of the management are seen with their heads together, deciding who<br />\nmay best be spared in cutting down the number to be taken.<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br />\nFOR THE UNDERGRADUATE.<br /><br />\nW. BRYAN,'03, has invited two other prominent Musical Club mein• bers to shoot on Taylor's Island, Dorchester County, on the “Easte'n<br />\nSho',\" a few days before the Christmas trip of the clubs. The fortunate men are C. A. Marshall, '03, and R. C. Pagon, '03.<br /><br />\n3<br /><br />\nB. F. Cator,'04, has left the University.<br />\nA \"feed\" is to take place at the Hullabaloo Club on the night of Tuesday<br />\nthe 23d, the last day of exams. Turkey and other holiday delicacies are<br />\npromised. It is understood that anyone mentioning the words \"examination,\"<br />\npaper,\" or \"mark,\" will thereby render himself liable to immediate expulsion from the club rooms.<br /><br />\n''<br /><br />\nThe '04 class flag, first displayed at the interclass football game, is the<br />\nhandsomest seen at the University for sometime. It represents the class pill on<br />\na background of college colors.<br />\nThe failure to hold the cane-rush last week is differently explained by each<br />\nclass concerned. The Juniors say that after the refusal of the Freshmen to<br />\nmeet them on the day of the football game, they really have won by default, but<br />\nthat they still are ready for '05 at any suitable time at American League Park.<br />\nThe Freshmen assert that they held back on the 6th because told to by the<br />\nSeniors who had the affair in charge; that they have been ready to do battle<br />\nin the cage for ten days, but that the '04 men have refused under various pretexts, really bezause they have \"cold feet.\" The only certain point seems to<br />\nbe that there will be nothing done until after the holidays.<br />\nIt is understood that the Goonay Club, an organization hitherto restricted<br />\nin membership to the Musical Clubs, has extended its scope, and now includes<br />\nmembers from the upper classes at large. The existence of some senior society,<br />\nthe honor of membership in which the newly-entered undergraduate may look<br />\nforward to as at once an incentive and a reward for faithful services to his<br />\nAlma Mater, and for good behavior in his college relations, seems a most desirable thing. Attention was called to this in an article by Arthur W. Machen,<br />\nJr., in THH NEWS-Lin-11m of December 6,1899, in which he says:<br />\n\"The fraternities generally select their members during the first few weeks<br />\nof the freshman year; and thus almost the only positions which may be bestowed<br />\nas 'a reward of popularity are the class offices. Therefore, the only popularity<br />\nwhich an ambitious student need cultivate is popularity among his own classmates, and this is rather helped than hindered by a certain amount of freshness<br />\ntowards his academic superiors. The only remedy for this state of affairs would<br />\nbe the establishment of one or more junior or senior societies, to which the freshmen might look as the goal of their ambitions.\"<br />\nSome tangible evidence of the reality of this body might have been gleaned<br />\nby the uninitiated from sundry peculiar actions of grave and reverend seniors,<br />\nnot otherwise easily explicable, during the recent weeks.<br /><br />\nTIIE NEWS-LETTER.<br /><br />\n1<br /><br />\n44/ZEEZIX17:4=4=4,1Z,L1143.JZL,<br /><br />\nlhIluilaHIItIIrtIIIIIIthIH<br /><br />\nC?<br /><br />\nNI<br />\n11111111111111111011111111111<br /><br />\nR. CHARLES I,. POLLARD, curator of the United States National<br />\nHerbarium, and secretary of the Wild Flower Reservation Society of<br />\nAmerica, will deliver a lecture on ''The Vanishing Wild Flowers\" in<br />\nHopkins Hall, Friday, December 19 The lecture will be delivered under the<br />\ndirection of the Naturalists Field Club.<br />\nProfessor Paul Haupt will represent the University at the fourth annual<br />\nconference of the Association of American Universities, which will meet in New<br />\nYork, December 29, 30 and 31.<br />\nOn Thursday, December 11, Dr. Remsen went to Washington to address<br />\nthe Cosmos Club on Liebig and Wochler, the great German pioneers of Chenistry, with whom Dr. Remsen studied.<br />\nDr. A. M. Elliott, Dr. J. H. Hollander, and Dr. Henry M. Hurd were<br />\nPresent at the twenty-second annual meeting of the National Civil Service Reform League. Ex-president Gilman addressed the meeting on Thursday, the<br />\n11th of December, afterwards being elected President of the League.<br />\nAt the B. C. C. Alumni Banquet on the 9th of this month, Dr. Jacob H.<br />\nHollander responded to the toast,\"The Political Economist and Public Affairs.\"<br />\nEarly in March a course of lectures on Social Economics will be delivered<br />\nin French by Professor Leopold Mabilleau, director of the Musee Social. The<br />\nmoney for these lectures was given to the University by Dr. Elgin R. L. Gould,<br />\nCity Chamberlaili of New York, who delivered a speech at the commencement<br />\nlast June.<br />\nOn December 5th, Mr. Theodore Marburg addressed the Johns Hopkins<br />\nHistorical and Political Science Association on \"The Eight-Hour Labor Law.\"<br />\nProfessor Julius Haber, of the University of Karlsruhe, Germany, recently<br />\nvisited the University. Professor Haber, who is the representative of the German Bunsen Society for Applied Physical Chemistry, was particularly interested<br />\nin Professor Morse's new apparatus for the measurement of osmatic pressure.<br />\nDr. Jeffrey R. Brackett's course on Public Charity for th Economics Department begins on Thursday, the 18th. The course will consist of ten<br />\nconferences, held on the 18th, and the nine succeeding Tuesdays.<br />\nThe University was visited last week by Professor Arthur Gamgee, the<br />\ngreat English physiological chemist. He was shown through the University<br />\nby Dr. Remsen.<br /><br />\nTI<br /><br />\n1()<br /><br />\nTHE NEWS-LETTER<br />\nTHE FOOTBALL TEAM OF 1902.<br /><br />\nNE is tempted, now that the period of storm and stress is over, to look<br />\nback upon the football season this year and make the comment \"Same<br />\nold story.\" But it has not been the same old story by any means, and<br />\ntherefore it is hardly just, to the college, or to the team, that the efforts made<br />\nand the success achieved should be passed over without a word of praise. To<br />\na certain degree, the story of this year's struggle to place a satisfactory team on<br />\nthe field is like that of former years; but never before have circumstances corn<br />\nlimed so strongly against us, and accordingly the tenacity and pluck that<br />\nfinally beat out a victory are more pronounced this season than in preceding<br />\nyears.<br />\nThe facts of the case are known to every undergraduate and every alumnus<br />\nwho retains an active interest in University affairs, but a brief repetition of the<br />\nconditions that stood out so appallingly at the beginning of the fall term may<br />\nremind Hopkins men of what they have really accomplished. Of lest year's<br />\neleven, two only remained in the college department of the University; one of<br />\nthese men, Yearley, was extremely uncertain as to whether he would be able to<br />\nget into the game again this year. The other, Captain Blanck, in addition to<br />\nthe worry and responsibility of making a team from almost nothing, was him<br />\nself handicapped by a badly torn ligament in his hip, the result of last year's<br />\nwork. The incoming class was very light, the Junior class also had no very<br />\nlarge men; there was no one to replace the players who had graduted in 1902.<br />\nTo make matters worse, the University was later in opening than usual, the<br />\ngrounds that we expected to play on were mixed up in litigation, and there was<br />\ngreat uncertainty as to our securing them. Finally the few men who did turn<br />\nout for practice were many of them entirely unacquainted with the elements of<br />\nthe game. It is no wonder that everyone, from the captain down, was not oversanguine as to results.<br />\nHowever, by dint of constant urging from Captain Blanck, and unceasing<br />\neffort on the part of all who were interested in having a team, a start was at<br />\nlength made. There is no use going into the details; the meds came out, one<br />\nby one, until we had a backfield, men in the undergraduate school developed,<br />\nand some who had never thought of playing football came out at our time of<br />\nneed. The scrub became more and more of a reality, regular practice produced<br />\nvisible results, and finally Hopkins had a team—not what the wildest enthusiast could call a star team, but one that we all felt would do us credit when<br />\nit went on the field—a team that we feared would have to prove its mettle by<br />\ntaking defeat like the sportsmen that we know they were.<br />\nIt was with such a team, that had not played together in its entirety for a<br />\nwhole week, that we met Western Maryland College for our first game. There<br />\nwas one thing that manifested itself before we left Union Station and that<br />\nhelped largely in the practical victory that we won later in the day. The whole<br />\ncollege understood the situation, knew the chances were slim, did not expect a<br />\nparticularly good game, and yet they turned out en masse to accompany the<br /><br />\nO<br /><br />\n•<br /><br />\nTHE NEWS—LliTTER.<br /><br />\n11<br /><br />\nteam on an all-day trip, just to show that<br />\nthey were backing the Black and Blue any<br />\nhow, under any circumstances, because it<br />\nwas our team. While the two captains were<br />\ndiscussing the length of the halves atWestminster, a Western Maryland man said,<br />\nOh, you fellows always say you are weak,<br />\nand then lick us. We can't beat Hopkins;<br />\nYour spirit won't let you lose.\" He was<br />\nhonestly of the opinion that we were insuperable, regardless of apparent lack of strength.<br />\nIt is unnecessary to go into the details of<br />\nthe game. Every man on the team felt that<br />\nWhether he was a crack player or not, his<br />\nbest was the only thing he could give, and<br />\nwhen eleven men work together in that spirit<br />\nthey are not easy victims for anyone. When<br />\neverything that enters into the question of a<br />\ngame is considered, weight, experience, organization, prestige, a record to sustain, an<br />\nold score to wipe out, home grounds, a sympathetic audience—the chances were all with<br />\nW. M. C.<br />\nIn spite of<br />\nthis, Hopkins was<br />\nCOACH GARWOOD.<br />\nthe winner until the last minute of play, and<br />\neven then Western Maryland was rendered<br />\nhysterical with joy at being able to tie the<br />\nscore. Undoubtedly, 6 to 6 this year was as<br />\ndecisive a success for J. H. U. as 12 to 0 was<br />\nlast year.<br />\nThe start made with Western Maryland<br />\nwas followed up by a decisive victory over<br />\nM. A. C., which was, however, more of a<br />\ntry-out for the Thanksgiving Day struggle,<br />\nthan an ultimate object in itself. The chances<br />\non paper for the U. of Md. contest were more<br />\nin our favor than the first game of the season,<br />\nyet the unexpected development of their<br />\nteam, and the introduction of seven old football men in the last week, turned the tables.<br />\nAs it was, the game our fellows put up was<br />\na thing to be proud of. In the end, Maryland was barely able to score once, and in the<br />\nfirst half we gained through them at will.<br />\nThe finest part of the game was when Hopkins held them for six successive downs<br />\nCA1\"fAIN 13L,ANCK.<br />\nwithin our last three yards of territory. That<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br /><br />\nalone was an exhibition worth all the work, and worry, and heart-burn that<br />\nthe up hill fight for the whole season had cost.<br />\nAnd right here let me say that the purpose of this sketch was not to give<br />\ninformation that you all know, but to show as clearly as possible the credit<br />\nearned by our season, and to draw from it a lesson that will help us in the<br />\nfuture. As to the credit, it belongs in the'first place to Fred. C. Blanck. All<br />\nthe work, and worry, and heart burn before mentioned fell first upon him, and<br />\nthe sufferings of others were merely reflected and sympathetic in nature. The<br />\ntask laid upon the captain this year was one that no man would like or willingly seek, and he fulfilled it right well. There is no need to amplify his<br />\npraise; every man who knows football at the University recognizes his deserts.<br />\nAfter the captain every man, 'Varsity or scrub, Med. or undergrad., who<br />\nslaved day after day in the cage for the honors of his college is entitled to and<br />\nreceives the admiration and gratitude of everyone. Finally, the manager, the<br />\ncoach, the trainer, and all who had the welfare of the team at heart, may feel<br />\nthat they have aided a plucky and successful fight against circumstances.<br />\nNow for the moral. After this year, let us never say: \"We cannot have<br />\na team.\" It is never too late, and times are never too hard, to make a try, and<br />\nwhen we make a good, hard, try, that in itself is victory. This year we won<br />\nonly a single game, tied one, and lost one; yet, beyond peradventure, everyone<br />\nis glad we did that instead of letting go, and having no team. Things can<br />\nnever be worse than they have been; if they are we will just have to crowd on a<br />\nlittle more effort and win out anyhow. That is the spirit that Western Maryland never can permanently beat, the good old \"Hopkins spirit.\"<br />\nH. B. S., '02.<br /><br />\nTHE JUNIOR-FRESHMAN FOOTBALL GAME.<br />\nHE gridiron at American League Park was covered with hard snow and<br />\nice on Saturday, the sixth, when the Junior and Freshman elevens slid<br />\ninto the field of vision. Upon each man's face was the determination to<br />\nhurdle icebergs if necessary, and to win in any event. This appeared in the<br />\nhard-fought game that followed, a game in which line-bucking was the feature,<br />\nsince the backs had neglected to bring their skates, and end runs were impossible. In these straight plunges, the Juniors were just a little the better, and<br />\nwith eighteen seconds to play in the second half, they scored a touchdown and<br />\ngoal<br />\nThe Juniors kicked off to Hudgins, who advanced the ball to the 40-yard<br />\nline. The slippery condition of the field made it impossible for the Freshmen<br />\nto try end runs, and consequently they pushed their backs through the line.<br />\nStone, Chism and Wroth tore through the Junior line repeatedly. The hurdling of Stone for the Freshmen was excellent, and most of their gains came<br />\nin this way. The ball was pushed steadily down toward the Junior's goal<br />\nuntil it was on their 10-yard line.<br /><br />\ne<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\n1904 TRAM AND suBsTrruTD:s.<br />\nHere '04 braced up, and the Freshmen backs were unable to gain<br />\nthrough the line, and were forced to try for a goal from the field. The ball<br />\nwas passed to Hudgins, but his kick went wide of the goal posts.<br />\nThe Juniors kicked, and it was the Freshmen's ball again. They tried the<br />\nsame tactics over, and again steadily advanced the ball to the Juniors 15-yard<br />\nline. Here they were held for downs, and, thereafter, '04's goal was not in the<br />\nleast danger. The rest of the game was spent in punting by both teams, the<br />\nhalf ending with the ball in the possession of the Freshmen in the gjniddle of<br />\nthe field.<br /><br />\n1905<br /><br />\nTRAM AND SUBSTITUTES.<br /><br />\n14<br /><br />\nTHE NEWS-LETTER.<br /><br />\nIn the second half, the weight and experience of the Juniors began to<br />\ntell. The ball was in their possession almost the entire half. The Freshmen<br />\nplayed gamely, but they were unable to stop the fierce rushes of their opponents, who were straining every nerve for a touchdown. Tackle plays were<br />\nused again and again, with Pearre and Rosenfeld carrying the ball, and the<br />\nlatter was finally pushed over the line with only eighteen more seconds to<br />\nplay. Emig kicked goal, and the score stood 6 to 0 in favor of the Juniors.<br />\nIn the short time remaining, nothing was done, the game ending with the<br />\nball in mid-field.<br />\nThe game was clean and well-played, notwithstanding the difficulty of<br />\nrunning on the slippery surface. The ice was responsible for several bad<br />\nkicks, it being impossible to get a sure foothold for the kick.<br />\nThe announcement that the cane-rush was off disappointed the spectators,<br />\nespecially the fair but blood-thirsty admirers. The Seniors, however, had received notice from the faculty that they would be held responsible for any accident, and President Tootle accordingly had the rush postponed.<br />\nIt was a case of \"root or freeze,\" and even the feminine spectators<br />\njoined with the classes in cheering their favorites. The Juniors occupied the<br />\ngrand-stand, and their cheering was in charge of Crozier. The Freshmen<br />\ngathered themselves together in the bleachers, and kept themselves warm<br />\nwith their yells. Each class tried to \"out-root\" the other,. but the honors<br />\nwere about even. The Freshmen were led by Kinnane. At the close of the<br />\ngame the classes ended the season of rivalry by cheering each other.<br />\nFor the Juniors, Pearre, Strohbar, Emig and Rosenfeld played the best<br />\ngame, while the Freshman stars were Stone, Chism and Wroth. The ends<br />\nhad very little work to do, most of it falling on the backs of the two teams.<br />\nThe line-up was as follows:<br />\nJUNIORS.<br /><br />\nBranham,<br />\nRosenheim,<br />\nRosenfeld,<br />\nMuhly,<br />\nLicking,<br />\nErlanger,<br />\nFoster,<br />\nStrohbar,<br /><br />\nPRESHMRN.<br /><br />\nR.E<br />\nR T<br />\nR G<br />\nC.<br />\nL. G<br />\nL. T<br /><br />\nBaetjer<br /><br />\nDill<br />\nMiller<br />\nBanghart<br />\nBowie<br />\n.Campbell<br />\nE.<br />\nBoyce<br />\nL H.<br />\nChism<br />\nPearre (capt.)<br />\nR H<br />\nWroth<br />\nDulany<br />\nQ B<br />\nHudgins<br />\nEvans<br />\nF B.<br />\nStone (capt )<br />\nScore-6 0 in favor of Juniors. Touchdown—Rosenfeld. Goal—Emig.<br />\nUmpire—A. Yearley, '03 Referee—H. Straus, '02. Timers—W• Matthai, '03,<br />\nGittings, B. I,. S. Linemen—H. Stone, '0?, E. Dickey, '04. Time of halves<br />\n—20 minutes.<br /><br />\nTHE NEWS- L ETTER ,<br /><br />\n15<br /><br />\nTRACK AND FIELD PROCEEDINGS.<br /><br />\n(4)<br /><br />\nRP.:PARATIONS are now being made by Physical Director Mackdermott<br />\nfor three large indoor meets to be held in the cage sometime during the<br />\nfirst part of the year. These events will mark the most active winter in<br />\nthe athletic history of Hopkins.<br />\n\"Mack\" is planning to bring off in May the biggest athletic event of the<br />\nyear. He is working hard to arrange an inter-collegiate outdoor meet, in which<br />\ntrack and .field teams from the universities of Pennsylvania, Georgetown, Lehigh, and from several other institutions will compete. It is also intended to<br />\ninvite teams from amateur organizations throughout Maryland and the District<br />\nof Columbia.<br />\nThe first of the indoor meets will be an inter-class affair, and will be held<br />\nin the cage during the latter part of January. Mr. Mackdermott, Captain R.<br />\nC. Hoffman and Manager Dulany, of the track team, have the arrangements in<br />\ncharge. There will be the usual track and field events, and an inter-class relay<br />\nrace, for which a cup will be offered. Suitable prizes will also be given to the<br />\nwinners of the other events. This meet will be followed by two other open<br />\nmeets to he held in the cage sometime during February and March.<br />\nThe relay team this year promises to be one of the best that ever represented the University. So far, there seems to be rather a dearth of weightthrowers, pole-vaulters, and hurdlers, but there will probably be some candidates out for these places after the holidays.<br /><br />\nFABLES FOR THE FOOLISH.<br /><br />\nIn Words of a Few Syllables.<br /><br />\nt<br /><br />\nIV.<br /><br />\nTHE FABLE'01,\" THE LADY PRINCIPAL AND THE STRIKERS.<br /><br />\nHIS is a fable which does not begin \"once upon a time.\"<br />\nIt was a critical moment. On the other side of the green baize curtain<br />\ncould be heard the expectant hum of a hundred eager voices, for the<br />\nyoung ladies of the Annie Moore Seminary were assembled to hear the concert<br />\ngiven by the musical clubs of the Oysterville College. On the stage there was<br />\nno confusion, yet everything was indicative of the greatest excitement. There<br />\nstood the lady principal, faultlessly arrayed in a black silk with a white jabot at<br />\nthe throat. There stood the manager of the clubs with a look of anguish bespread upon his Gibsonesque features. Three men, one from each club, corn<br />\npleted the group. Beyond, in stolid silence, could be seen imperturable rows<br />\nof musical men, standing at parade rest. The situation was strained almost to<br />\nthe breaking point. The musical clubs were on a strike.<br />\n\"Please repeat your demands!\" said the lady principal.<br /><br />\n16<br /><br />\nTHE NEWS—LETTER.<br /><br />\n\"They are as follows,\" said the tall man with the deep voice and the<br />\nsuave manner, \"we are tired of giving concerts at girls' schools and immediately after the performance having to undergo the anguish of seeing the young<br />\nladies trundled off to bed, inside of ten minutes. We are tired of being the<br />\ncenter of a system of espionage conducted by lynx eyed teachers, compared to<br />\nwhich the system of Sherlock Gillette is a three-spot in a dirty deck.\"<br />\n\"Now that you have stated your objections, what are your demands?\"<br />\nThe committee looked at their comrades in the backgronnd and took courage. Again the deep, dulcet tones of the glee club's representative burdened<br />\nthe air.<br />\n\"We demand that the young ladies be permitted to remain up until eleven<br />\no'clock.\" The lady principal turned pale. \"We demand that you call off the<br />\ndogs of war; in plain English, all those females whose duty it is to be Johnnie<br />\non-the-Spot.\" The lady principal fell limply into a chair. \"We demand that<br />\na certain number of cozy corners, one for each man, be provided with soft<br />\ncushions and dim lights.\" The lady principal went into a trance and with<br />\ndifficulty was restored by the prompt application of smelling salts. At last she<br />\nopened her eyes.<br />\n\"Is there anything else?\" she asked with feeble irony.<br />\n\"Nothing.\"<br />\n\"And what if I refuse?\"<br />\n\"There'll be no concert tonight,'' the three responded in concert.<br />\nIt was a moment of supreme portent, Seldom in the life of an individual<br />\ndoes it happen that such momentous questions are to be decided. Like a<br />\ndrowning man grasping at a straw she turned to the genial manager. With<br />\nsupreme resolve she smiled upon him, but guile was in her heart, and she said,''I<br />\nknow that you can manage them. You are a natural leader.\"<br />\n\"I am not the leader, I am the manager.\"<br />\n\"But they will do what you say\"<br />\nNow for three years the manager had been shaved by Walter and he was<br />\nProof against such flattery.<br />\n\"Fellows, is there anything doing?\"<br />\n\"Nothing doing,\" was the solemn reply.<br />\n\"You have heard the ultimatum, madam, do you accede?\"<br />\nOutside the expectant hum of voices was rising to a roar of indignation at<br />\nPerhaps it was that which helped to influence her. Never did she<br />\ndelay.<br />\nthe<br />\nThere was a regal grace in her every moment. Advancing<br />\nqueenly.<br />\nlook so<br />\nwere awaiting their leaders' return she said:<br />\nwho<br />\nmen<br />\nbefore the<br />\nmen; there'll be no strike to-night.\"<br />\nstage,<br />\nthe<br />\nto<br />\n\"Back<br />\nfiled on the stage, and the strike was off. This is<br />\nmen<br />\nthe<br />\ncheer<br />\nWith a<br />\nthey had that tired but happy look the next<br />\nwhy<br />\nof<br />\nthe only true account<br />\ndefeat was going to hand her one anyway,<br />\nthat<br />\nsaw<br />\nprincipal<br />\nday. The lady<br />\nwent off according to agreement.<br />\neverything<br />\nand<br />\nso she accepted it gracefully<br />\nMoRAL—This fable teaches freshmen that the worm has a habit of turning.<br /><br />\nTHE CHEAPEST PLACE<br /><br />\nC.,V P.'Phone J53-V.<br /><br />\nIN BALTIMORE FOR<br /><br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br /><br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\nMathematical and Surveying Instruments,<br />\nDraughtsmen's and Engineers' Supplies.<br /><br />\nH. S. WRIGHT ek CO.,<br /><br />\nN. W. Corner<br /><br />\n704 MADISON AVE.<br /><br />\nLexington and Liberty Sts.<br /><br />\n1/U -11/%1012E, MD.<br /><br />\nAgent .for .Kevffel .1'. Esser ,Co., of New<br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br /><br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br /><br />\nHenderson's<br /><br />\n.0<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Hooks, Note Hooks,<br />\nMadison<br />\nStudents' Supplies.<br /><br />\nFOR<br /><br />\n0Howard<br /><br />\nADVERTISING SPACE IN THIS PAPER<br />\nAPPLY TO<br /><br />\nt*ET,e.e.eeoziepp<br />\nPUBLISHERS.<br />\nh1,1,1 ,rs<br /><br />\n,1.11<br /><br />\nEALILMQ111:,IVID<br /><br />\nMO 010, :out, A., 71+1<br /><br />\nM. MEADE<br /><br />\nOF I ONIDoN<br /><br />\nEXPERT CLEANER AND DYER.<br />\nST. (2nd and 3rd Iloorsi.<br /><br />\n1'26 N. it<br /><br />\nThe most, eomplete and modern department for<br />\ncleaning, dyeing mill altering Gents' and Ladies'<br />\ngarments.<br />\nIt's time tour Winter Clothing was put in order.<br />\nDoes it need to be cleaned, dyed, altered or repaired'? Are new linings and veh.et, collars necessary?<br />\nNever mind what's the matter, we will fix It up to<br />\nlook like new, and you won't have to pay very much<br />\neither. The Price List speaks for itself.<br /><br />\nM. BERNSTEIN 8z. CO.<br />\nDINDON—AMEKICAN<br /><br />\n...TAILORS<br /><br />\nAND<br /><br />\nIMPORTERS...<br /><br />\nLOW PRICES AND FINE WORK.<br />\nWe make clothes that fit well, look well and wear<br />\nwell, that's very important.<br />\nThe most fastidious man can tind nothing to growl<br />\nabout our garments.<br />\nThe same attention is given to the 111Ra that is less<br />\nparticular, it's our way.<br />\nWe are prepared to show you a largo line of Imported woolens, which does not Cost any 1(0 lie then<br />\nthe domestic.<br />\n\"SEE US BEFORE BUYING\"<br />\n126 NORTI I 11 !\"17AW :•;TI•21!1:T.<br />\nCo.)<br />\n(Second door above Joel (<br /><br />\nGENTLEMEN'S CLOTHING<br />\nCONTRACT.<br /><br />\n$1.50 PER<br /><br />\nPRESSED<br /><br />\nBY<br /><br />\nMONTH.<br /><br />\nPRICES FOR OR C LEA N 1 NG AND 1)1. El NU<br />\nGentlemen's Suits cleaned and pressed<br />\n$I<br />\nTrousers,<br />\nCoats,<br />\n5<br />\nVests,<br />\nOvercoats, •<br />\n1<br />\n!toys' S'ults, aecording to size,<br />\n.50, .75 al<br />\nVol vet collars on liverconts,<br />\nRELINING. —A new lining will often make a garment which you have discarded good for another<br />\nseason's wear. All altering and repairing dime here<br />\nby skilled tulle's.<br />\nDYEING.<br />\nGentlemen's Suits dyed arid pressed,<br />\n$2.00<br />\nOvercoats,<br />\n1.50<br />\nBoys' Suits, according to size<br />\n1.00, 1.251111d I.50<br /><br />\nCLOTHES MADE TO' ORDER.<br />\nThe Illustrat ions show how the chitties we make fit<br /><br />\nand look--tin' wear you'll learn about later.<br />\nThe light overcoat,is an especially snappy garment.<br />\nThe sack suit is cut after the very newest nattern.<br />\nThe winter overcoat is as swagger as the dressiest<br />\nMtn C011id wish.<br />\n%Ye make all other proper styles, of course; dress,<br />\ncutaway, double-breasted, four-button sack and •<br />\nNorfolk suits.<br />\nYou can now have first pick of our first, pick of<br />\ncloths.<br />\nPrices are low—we never learned to charge too<br />\nmuch. We would like to make your clothes.<br />\nLOWEST PRICES EVER KNOWN.<br />\nWe guarantee to give you latest, style nod a tierfeet fit. Workmanship will be the best you oversaw.<br />\nYour money hack if you are dissatisfied.<br />\nBrANSTEIN &amp; CO.<br />\n126 N. Eutaw<br />\nSEE OUR PRICE LIST FOR CLEANING, DYEING AND ALTERING.<br /><br />\nCOON'$330,000. urIusiiU UNIVIded P101118 $400 000<br /><br />\nST1EFF PIANOS<br /><br />\nDrovers Sr Mechanics Nat'l Bank,<br /><br />\nMADE OF THE HEST MATERIALS MONEY<br />\nAND EXPERIENCE CAN<br />\nWANIONOUMNI<br /><br />\nOF BALTIMORE.<br /><br />\nBUY.<br /><br />\n9 N. 1,11114.1RTY ST.<br /><br />\nBooksellers and<br />\nStationers.<br />\n34 W. BRLT1M0RE STREET.<br /><br />\nGUSHING &amp;GOMPRNY<br /><br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nKeep constantly on hand the Text Books used<br />\nin Julius Ilopkins University and the Woman's<br />\n0<br />\n50<br />\n0<br />\n0<br />\nCollege of Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nHaberdashers,<br />\nShirts, Neckwear,Underwear<br />\nMENISMINMMINMEMMEMI Hosiery, etc.<br /><br />\nTHOS.BLAKE CO<br /><br />\nSHIRTS TO ORDER A SPECIALTY.<br /><br />\nOn Sale The J. H. U. Pennants, and all other College<br />\nPennants.<br /><br />\n219 EAST BALTIMORE ST.<br />\nA H. FETTING,<br />\nMANUFACTURER<br /><br />\nI.. Strouse, Vice-Prot.<br />\nEdw. P. Hayden. Assl Cashier.<br /><br />\nJas. Clark, Prof<br />\nChas. S. Miller, Cashier.<br /><br />\nA General Banking Business Transacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom $3 p r year and upward.<br /><br />\nficcounts Solicited.<br /><br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LFHIVIAN &amp; SON.<br />\nFOR<br /><br />\nGO. inAW11S1(4470AVI..<br />\nSTRBIAII<br />\nJORDAN<br />\nSamples submitted of<br />\nReads as follows:<br />\nFrench Brandy—no adulterants, no coloring, tine quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong,<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br /><br />\nIlgenfritz Studio<br />\nSuccessor to Cummins.<br /><br />\nOr<br /><br />\nGreeh letter ifraternitv 3ewetrv,<br /><br />\nARTISTIC PHOTOGRAPHY<br /><br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\nPlease Call stO Examine our line 3Sefore Purehasina.<br /><br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial 'Discount to Students.<br />\ntelephone 443 2.<br /><br />\nJENNINGS<br /><br />\ntiL<br /><br />\nLibraries arranged and put in<br />\norder without removal. 4r if<br /><br />\nHORSEY,<br /><br />\nR UZICKA<br />\ntto<br />\nw4,60<br /><br />\nMERCHANT TA IL/pHs,<br />\n21 W. PAYETTE) STri<br /><br />\nBookbinder,<br /><br />\nBOOKS!!!<br />\nSECOND=HAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nBought, Sold and Exchanged.<br /><br />\nPIPPEN'S BOOK STORE,<br />\n605 N. EILYTR.W ST.<br />\nNear the University.<br />\nBaltimore's Largest Old Book Store.<br /><br />\nJ. H. U. Binder.<br /><br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE.<br /><br />\nTHEO. WARNER.<br /><br />\nWARNER et<br /><br />\nCO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln &amp; Bennett and<br />\nWalter Barnard's London lints.<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\n01 jar 0/.) X' 71 S Caps<br />\n.<br />\nSilk and Cassimere Hats. 4<br /><br />\nGO.<br />\nS.<br />\nS.<br />\nLLOYD<br />\nN<br />\nNORM GERMA<br />\nRATES.<br />\nLOW<br />\nGABIN PASSAGE AT<br />\nNew York to Brun, London, Paris, Gibraltar, Naples,<br />\nBfiLTIMORE TO BREMEN DIRECT.<br /><br />\netc.<br /><br />\nR. SGRUMRGREII Sc GO., General Auents.<br /><br />\nFor particulars apply to<br /><br />\nTHE<br />\nInstrument Co.<br />\nSurgical<br />\nChas. Whims<br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br /><br />\n300 N. Howard St.,<br /><br />\nOCII0d,<br /><br />\n'Baltimore, Md.<br /><br />\n--MEIKLE,<br />\nISAAC H. DIXON, PRIEST.<br />\nJAS. R. RICHARDS, Tar...<br /><br />\nSmith Dixon Co.<br />\n29 - 31 S. Charles Street.<br /><br />"}], "field_media_file": [{"target_id": 36246, "display": null, "description": null, "target_type": "file", "target_uuid": "78b29602-ab50-43ed-89e9-c4b240243d3e", "url": "http://digital.library.jhu.edu/system/files/2022-03/12226-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12226, "target_type": "node", "target_uuid": "04217b73-cbf3-46d1-b882-fd8e4969b6ad", "url": "/node/12226"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "3b8c1a8f-bdf5-4257-af99-be4acc13b0ad"}]}