{"mid": [{"value": 37449}], "uuid": [{"value": "9835b545-795f-4e49-8f18-cacd4c4e9503"}], "vid": [{"value": 37449}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:32:41+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13389-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:32:41+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:32:41+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol. XXXIV, No. 9<br />\n<br />\n90 MEN PLEDGED<br />\nTO FRATS<br />\nSigma Phi Epsilon Leads List<br />\nWith 12 Men Pledged<br />\nFRATS<br />\n<br />\nFELL<br />\n<br />\nFRESHMEN<br />\n<br />\nOne-Third Of Freshmen Class<br />\nDecorated With Pledge Pins<br />\nThe fruits of the rushing season<br />\nhave at last been plucked. On Monday, October 28, Pledge Day, the<br />\nrushees at last had the final question<br />\nput to them and the following resulted. Pledged by:<br />\nBeta Theta Pi—<br />\nR. A. Baker, R. B. Jewell, Thos.<br />\nHogshead, R. M. Miller, Addison<br />\nClark, Fred Johnston<br />\nPhi Kappa Psi—<br />\nJ. McCabe, Triplett, Davis, Reid,<br />\nEgerton, Turnbull, Tucker, Mattingly McDorman, Kuhl, Shugerman.<br />\nDelta Phi—<br />\nWilloughby.<br />\n<br />\nPrice 5 Cents<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER, 29, 1929<br />\n<br />\nAVIATION NUMBER<br />\nOUT NOVEMBER 9<br />\nThe Aviation Number of<br />\nthe Black and Blue Jay will appear November 9, according<br />\nto its editor, McDorman. The<br />\ncover will be by Quirk, and<br />\nthe editorial and art contributions are forecast to be of the<br />\nhighest type. The Aviation<br />\nNumber will be followed by<br />\none of the best comic numbers in the Jay's history, a<br />\nGirl Number. The only information about this number that<br />\ncan be published at this time<br />\nis that the illustration of the<br />\nmost beautiful girl at Goucher,<br />\nas determined by a popularity<br />\ncontest at that college, will<br />\nadorn the Jay's front page.<br />\nBryan Quirk will draw that<br />\ncover from life.<br />\n<br />\nHOPKINS HARRIERS<br />\nWIN SECOND MEET<br />\n<br />\nBELATED REPORTS ARRIVE FROM<br />\nR. 0. T. C. SUMMER CAMP FRONT<br />\nThe following is an attempt to \"Scotch ale\" for water. There were<br />\nnarrate, in some measure, the more also quite a number of words unor less placid events attending the mentionable in this publication.<br />\nAfter dinner the boys put on<br />\nevents of the summer camp of the<br />\n\"fatigues\" for a little work, then<br />\nJohns Hopkins R. 0. T. C. unit. changed to uniform to receive pay.<br />\nIt seems that about 20 of this Next they changed back to fatigues.<br />\nyear's officers of the engineering Supper necessitated another change<br />\nbranch of the unit attended the to uniform. Then if town was the<br />\ncamp at Fort Humphries, Va., for object for the evening (Alexandria<br />\nsix weeks during the most delight- girls are really not so bad. Phone<br />\nful months of the. year—June and Alex. 4327-J) change to the regular<br />\nJuly. The temperature seldom reach- Hopkins unit uniform was necesed 125 degrees and the woolen shirts sary. All in all, the young officers<br />\nworn by the brave boys were quite became so adept that they could<br />\ncorn fortable.<br />\nchange clothes in approximately<br />\nPerhaps the description of the three minutes and thirty-seven secroutine of a single day will serve to onds.<br />\nshow the initiate the toils, perils,<br />\nEquitation\" simply meant horseand otherwise, that the embryonic mck riding. Some of the horses were<br />\nsoldiers went through in the pur- quite frisky and, although it is not<br />\nsuit of glory. Reveille sounded at recorded that anybody fell off,<br />\n5.45. Promptly at 5.57 everybody horses with riders grimly holding<br />\ngot up or was rolled out of bed. on with both hands around the said<br />\nLeisurely dressing, the soldiers as- horses' necks, frequently were seen<br />\nsembled at 6. Breakfast (Beg par- scampering off to various points of<br />\ndon!) Mess followed and then drill. the compass. The number of bruises<br />\nThen the boys changed to \"fatigues\" due to well-planted hoofs was also<br />\n\"Fatigue,\" let it be known to all and quite large.<br />\nsundry, is the title applied to ordiGuard was held at night. Three<br />\nnary work clothes. Then bridge; men were always on duty. It seems<br />\nwere built, pontoon bridges floated, that one night the inspecting officer<br />\nimaginary enemies stalked through came around to inspect the guard to<br />\nblackberry patches, or poor innocent see if they were performing their<br />\nlittle trees blown into small particles. duties properly. None of the guards<br />\nNext the soldiers dressed for din- could be found (awake). The inner in the regular uniform, which specting officer appropriated all the<br />\nthey duly partook (the dinner). rifles that could be found, and we<br />\nPages might be written of the have the distressing spectacle next<br />\nquaint names applied to the chow. morning, of the guard running<br />\n\"Gruly\" stood for stew, \"grease\" rings around the camp in search of<br />\nfor butter, \"sand\" for sugar and their rifles.<br />\n<br />\nRIFLE SCHEDULE<br />\nALMOST COMPLETE<br />\nNewton Schllinger, manager of the rifle team is arranging matches with colleges<br />\nand universities all over the<br />\ncountry, according to Captain<br />\nBass, coach.<br />\nThe range is now officially<br />\nopened for the members of the<br />\nrifle club. These men could<br />\nuse the range at any time until yesterday when reg liar assignments of hours were given<br />\nout.<br />\nAt present 43 men have enrolled and there are vacancies<br />\nfor others interested in marksmanship. The initial cost of<br />\nmembership is two dollars.<br />\n<br />\nJAYS DEFEAT<br />\nRANDOLPH-MACON<br />\nHopkins Makes 12 First Downs<br />\nRandolph-Macon 2<br />\nGUILD<br />\nThrills<br />\n<br />\nSTARS<br />\n<br />\nOf Game Come<br />\nSecond Half<br />\n<br />\nIn<br />\n<br />\nLast Saturday the Hopkins elevemi turned in its first victory of the<br />\nseason by defeating Randolph-Macon 13 to 0 at Homewood field.<br />\nFirst Half Uninteresting<br />\n<br />\nDuring the first half the struggle<br />\nwas very drab, and the thrilling<br />\nruns, which cause the stands to<br />\njump to their feet and yell, were<br />\nkicking. Hopkins was in possession<br />\nof the ball during most of the half,<br />\nand had the ball in the territory of<br />\nthe visiting Yellow Jackets, but they<br />\nseemed to lack the punch which<br />\nwas necessary to put the ball over<br />\nCarnegie Inquiry Covers Too<br />\nthe<br />\ngoal-line for a touchdown.<br />\nFew Colleges, Is Claim<br />\n<br />\nCOACH CRITICIZES<br />\nFOOTBALL INVESTIGATION<br />\n<br />\nSTATEMENT MADE FRIDAY<br />\n<br />\nAthletic Scholarships Are<br />\nSchiebel And Kelly Both BetAlpha Delta Phi—<br />\nAdvertised By Some<br />\nter Course Record<br />\nRich, Magill, W. Erickson, Chas.<br />\nCoach Van Orman declared FriCarter, W. Neilson, D. Murray, SCORE 31 TO 24<br />\nday<br />\nthat he regarded the issuance<br />\nDavies Storrs.<br />\nMajority Of Field Delayed By<br />\nof the report concerning assertions<br />\nFreight Train<br />\nKappa Sigma—<br />\nof professionalism and commercialMcCorkle, Umberger, O'Keefe,<br />\nSaturday the Johns Hopkins<br />\nism in college athletics by the CarSeaman, Glass, McMullen ShanaCross-Country team won its second<br />\nhan.<br />\nnegie Institute as a move too scant<br />\nmeet of the season when it defeated<br />\nin<br />\nscope to be considered as a<br />\nAlpha Tau Omega—<br />\nLehigh by a score of 31 to 24.<br />\ncriterion in collegiate practice. Mr.<br />\nW. Morris, S. Banks, D. Kelly,<br />\nRecord Broken<br />\nC. Williams, J. Towner, D. Rankin<br />\nVan Orman went on to say that<br />\nRunning over a strange course,<br />\nsome of the facts revealed by the<br />\nDelta Upsilon—<br />\nSchiebel<br />\nKelly<br />\nfield,<br />\nled<br />\nand<br />\nthe<br />\nreport have been for a number of<br />\nJ. Bender, D. Bittinger, R. Cockfinishing<br />\nthe<br />\nfive-and-a-tenth-mile<br />\ney, F. Douty, C. Gilbert, M. Gude,<br />\nyears common knowledge while<br />\nFreshmen Debate<br />\nDr. Siegfried to Give<br />\nC. Hughes, F. Kaltrider, H. Miller, run in record-breaking time. Both<br />\nTryouts Wednesday<br />\nThree Lectures others such as the charge of proM. Smith.<br />\nSchiebel and Kelly finished the run<br />\nfessionalism were essentially false.<br />\nTryouts for the Freshmen DebatThe James Schouler lectureship<br />\nThe lucrative gate receipts, astaken<br />\ntime<br />\nin<br />\nless<br />\nit<br />\nhas<br />\never<br />\nthan<br />\nSigma Phi Epsilon—<br />\ning Team will be held Wednesday at which is given every year will be serted the<br />\nmentor, were direct reR. Jones, J. Arias, M. Clayton, a Lehigh man to go over the course. 12.30 in Room B, second floor, Levpresented by Professor Andre sults of a public demand that is<br />\nP. Cole, R. Donnock, G. Forrest, The former record was thirty min- ering Hall. Three debaters, an al- Siegfried, author<br />\nof \"America yearly reaching huge pooportions.<br />\nE. Lyon, J. Mandrel, H. Neuman, utes, sixteen seconds. Schiebel to-nate, and a secretary will be Comes<br />\nof Age.\" He will lecture on<br />\nAthletic Scholarships<br />\nM. Seitz, J. Sullivan, J. Lookey.<br />\nclipped two minutes, fifty-four sec- cl- osen at the tryouts. The Freshman the French Political Psychology.<br />\n\"The public demand,\" he said,<br />\nPhi Gamma Delta—<br />\nonds off this time, being clocked at Debating Team will meet the Soph- The schedule consists of three lec- \"has been for champions. And not<br />\nStone, Heyn, Fry, Wolf, Mar- twenty-seven minutes, thirty-two more team sometime in November tures. Tomorrow he will lecture on a few institutions have gone to<br />\nexon a subject not yet determined. All \"French national characteristics.\"<br />\nshall, Merriken, Bond, Hobleman,<br />\ntreme lengths to satisfy this demand.<br />\nseconds; and Kelly cut the record members of the Freshman class are<br />\nFriday, November 1, 1929, he will<br />\nC. Kelly.<br />\nby one minute, thirty-six seconds, eligible for the team. All candidates present the \"Political Parties in A number of colleges had no qualms<br />\nabout publicly advertising their<br />\nKappa Alpha—<br />\nhis time being twenty-eight minutes, are requested to prepare a two-min- France.\" This will be followed by<br />\nathletic scholarships. However, the<br />\nL. B. Jones, J. W. Matthews, K.<br />\nute speech on any topic whatever the \"Fundamentals of the Governtheory to the effect that leading<br />\nJ. Quickel, G. F. Packard, A. H. forty seconds.<br />\nto<br />\nbe given at the tryouts.<br />\nment of France\" on Monday, NoAfter Schiebel and Kelly had<br />\nathletes<br />\nand graduate managers rePlitt, Jr., Straung.<br />\nMr. Wheeler of the English De- vember 4.<br />\ntaken the first two places, Lehigh<br />\nceive<br />\na<br />\nportion<br />\nof football receipts is<br />\nOmicron Kappa Omicron—<br />\npartment has very graciously ofThese lectures will be presented<br />\nonly<br />\ntrue<br />\nin<br />\nisolated<br />\ncases.\"<br />\nMacLellan, Belitz, Biggs, Green, placed a man third. Emerson, of fered to aid the Frosh team, so that in the Civil Engineering Hall of<br />\nAthletics in practically every colArmstrong, Keiper, Retaliata, Mu- Hopkins, ran fourth. Lehigh came they may be able to at least let the the Johns Hopkins University at<br />\nin fifth, sixth and seventh, then team representing the Class of 1932 Homewood at 5 p. m. All are wel- lege, according to Van Orman, are<br />\nniz.<br />\nnot sponsored, despite popular<br />\nHopkins' last two counting men know that they have debated with come<br />\nSigma Tau Delta—<br />\ntenet,<br />\nby a small group of alumni,<br />\nplaced eighth and ninth ; they were veterans. One member at least, or<br />\nTitus, Cox, Gore.<br />\ndirectly handled, financially<br />\nbut<br />\nare<br />\nMiller and Packard, respectively. two members if necessary will be<br />\nAau Alpha Phi—<br />\notherwise,<br />\nand<br />\nby the faculty and<br />\nWaters, who had been counting for elected from the Freshman team to Avukah Society<br />\nR. Williams, A. Lahman, Harper. Hopkins in the meets for the last the Debating Council.<br />\nthe<br />\ntreasurer's<br />\noffice.<br />\nAnnounces Program<br />\nHopkins Lack Winning Teams<br />\nseveral years, had trouble with his<br />\nIf victorious ill its first debate,<br />\nAlpha Mu Tau—<br />\nAt a cenference meeting held last<br />\nHopkins, it was learned, has<br />\nthe secretary of the Freshman team Thursday, attended by representaMurphy, J. Loggerman, R. F. leg and came in tenth.<br />\nrarely produced a winning team<br />\nwill arrange debates for the yearAkehurst, C. Fowlus, E. Anstine,<br />\ntives of the classes and Jewish<br />\nDifficult Course<br />\n(Continued on page 3 column 3)<br />\nsimply because it has been the poliT. R. Kuhn, J. Penny.<br />\nfraternities the program of the cy of the<br />\nThe Lehigh course was very<br />\nauthorities to spurn exClasses Unattended<br />\ndifferent from the Hopkins course. Musical Clubs Hold<br />\nHopkins Chapter of the Avukah traneous methods of corraling athPledge Day as usual was marked Instead of starting the run from the<br />\nWeekly Meetings was announced.<br />\nletes. Consequently the gleam of<br />\nbY shrunken class attendance, locker rooms and running \"crossThis<br />\nprogram<br />\nconsists of bi- publicity and recognition has lured<br />\nLast Thursday evening a meetfrantic \"rushing\" about the campus country\" the race started from a<br />\ning of the Musical Club was held monthly student body meetings. the worthier player away from the<br />\nin search of the rushee, etc. So point at the top of a hill, a little<br />\nHopkins to colleges who offer startThese will be held on the campus<br />\nin Levering _Hall.<br />\nmore<br />\nthan<br />\nmiles<br />\nfrom<br />\nfive<br />\nthe<br />\nLeling<br />\nconcessions to athletes.<br />\nfar about 90 men have been pledged<br />\nPrevious to the meeting a picture and will be addressed by nationallyhigh campus, and was along auto<br />\nOther members of the Athletic<br />\nand from the optimism of most of<br />\nroads. The contestants were driven of the group around a Kolster radio known speakers.<br />\nAssociations<br />\nstrongly reiterated<br />\nthe fraternities at least a dozen by bus to this point.<br />\nThe first mile- was taken in the assembly room of<br />\nThe distingushed orator and au- Coach Van Orman's statement. It<br />\nmore will be pledged before night- and-a-quarter of the grind was<br />\nLevering Hall. Elliot lead the club thor, Maurice Samuel, will speak at was pointed out that the Carnegie<br />\nfall. About one-third of the fresh- down hill. At the base of the hill<br />\nusual. The song that was re- such a meeting, on the afternoon of Foundation's report had included a<br />\nman class has been pledged to a the course crossed the main line of as<br />\nmere hundred and sixty-eight colthe Central Railroad of New Jersey, hearsed was \"To Arms.\" The Club November 13.<br />\nleges out of a possible eight hunfraternity or another.<br />\nThe Avukah is at present arrangand then continued along the bank is doing very well on this and Steindred. It was generally believed that<br />\nS. P. E.'s Have Most Men<br />\nof the Lehigh river for a mile and wald is very optimistic on the pros- ing for a public meeting, to be held the investigation would be<br />\nlikely to<br />\nSigma Phi Epsilon leads the three-quarters, and again crossed<br />\npects. At the end of the meeting in the city early in December. This incur more harm than good, since<br />\nranks, with twelve pledged men, the railroad before entering the<br />\nmeeting will be held in honor of the a number of guiltier colleges had<br />\nand Phi Kappa Psi and Delta Up- city for the last two-and-a-tenth the members were given copies of<br />\nmusic, so they might practice national secretary, J. W. Wise, and not been accused, while universities<br />\nsilon being a close second and miles through the town and up a the<br />\ninnocent of indiscretions were likely<br />\nat home. Although the activity of Professsor W. F. Albright of the<br />\nthird, with 11, and 9 men pledged steep hill onto the campus of the<br />\nto<br />\ntend toward the commercialism<br />\nthe club has started, any new voices University. It is also planned to have that other institutions had so<br />\nUniversity.<br />\nsucrespectively.<br />\nMr. Wise speak at an assembly<br />\nAt the second railroad 'crossing are welcome.<br />\ncessfully negotiated.<br />\nIt is expected that by tomorrow<br />\nSchiebel and Kelly managed to beat<br />\nSteinwald led the Jay orchestra meeting before the entire student<br />\nDean Berry said that he was acthe campus will have returned to<br />\nfreight<br />\nat<br />\ntrain<br />\nto<br />\nthe crossing, but<br />\na<br />\n4.30 and Gebelein the Banjo body.<br />\nquainted with instances in which<br />\nits usual status of quiet and dig- the rest of the field lost several min- Club. Both feel that their sections<br />\nA series of study circles are be- athletic associations paid the tuition<br />\nnity.<br />\nutes while the train passed.<br />\nare doing well in the rehearsals.<br />\n(Continued on page 3 column 3)<br />\n(Continued on Page 3, Column 1)<br />\n<br />\nGuild Thrills Crowd<br />\n<br />\nWhen the Jays came on the field<br />\nto resume play ill the second half,<br />\nthey looked like a different crowd.<br />\nThey now seemed to have the pep<br />\nwhich they lacked during the early<br />\nstages of the game. The one outstanding- play which thrilled the<br />\ncrowd of about 1,500 fans and<br />\nbrought them to their feet with<br />\nlusty cheers and applause, came in<br />\nthe third quarter when Loren Guild,<br />\nHopkins quarterback, after making<br />\na spectacular one-handed interception of a long forward pass by Bryant, ran 65 yards through the whole<br />\nRandolph-Macon te* to deposit<br />\nthe ball behind the goal-line for<br />\nHopkins' first score. The run was<br />\na good one, but it was only made<br />\npossible by the combined efforts of<br />\nthe whole Jay team. Every man<br />\nrealized what he must do to make<br />\nthe most of this opportunity and,<br />\ngathering fast they formed beautiful<br />\ninterference for their quarterback<br />\nand cut down the Yellow Jackets<br />\none by one, thus affording Guild a<br />\nnarrow passage down the west side<br />\nof the field. The Jays tried to kick<br />\nthe ball over the goal posts for the<br />\nextra point, but failed.<br />\nThreaten Jay Goal<br />\n<br />\nThis play seemed to arouse the<br />\nfighting spirit in both teams. Randolph-Macon recovered and started.<br />\ndown the field toward the Blue Jay<br />\ngoal. By a series of beautiful overthe-line passes, accompanied by a<br />\nfew line-bucks, the Yellow Jackets<br />\nworked the ball down the field to<br />\nthe Jay 25-yard line. The Jays dug<br />\ntheir cleats deep into the ground<br />\nand forced their opponents to lose<br />\nthe ball on downs.<br />\nJays Score Again<br />\n<br />\nHere Hopkins started a fierce<br />\noffensive that coundn't be stopped.<br />\nJack Turnbull tucked the pig skin<br />\nunder his arm and ran around the<br />\nleft end for a 20-yard gain. A few<br />\ncompleted passes, coupled with a<br />\nseries of off-tackle plays placed the<br />\nball on the Yellow Jackets' 20-yard<br />\nline. A penalty put the ball on the<br />\nfive-yard line and on the second play<br />\nTurnbull went over for a touchdown. Bledsoe drop-kicked for the<br />\nextra point.<br />\nLine-up:<br />\nHopkins.<br />\nPos.<br />\nR.-Macon<br />\nRosenberg . . . L.E.<br />\nParr<br />\nLove . . . .....L.T...<br />\n.Hoskins<br />\nWeilzel . ....L.G. .<br />\n.Fielding<br />\nHelm<br />\nTrader<br />\nTowbin .<br />\nR.G.<br />\nCoffey<br />\nBioloskorsky ..R.T. . ..Woodson<br />\nTriplett .. ..R.E. .<br />\n.Douthat<br />\nGuild<br />\nQ B.<br />\nKing<br />\nTurnbull. ..L.H. . ...Cockrell<br />\nMerriken . ...R.H. . ....Burger<br />\nMills . . ......F.B. . ....Bryant<br />\nScore by quarters:<br />\nHopkins<br />\n0 0 6 7-13<br />\nRandolph-Macon ....0 0 0 0— 0<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER, 29, 1929<br />\n<br />\nBEjamsH .<br />\n<br />\nNgyattLETTE<br />\n<br />\n..‘<br />\n<br />\nYES and NO<br />\nBy PAUL W. SPEAR<br />\n<br />\nFOUNDED 1897<br />\n<br />\nWhatever led the Student Council his fame deserves. As a member<br />\n$2.00 to abolish Freshman Regulations is of that select group of genii who<br />\n<br />\nSubscription<br />\n<br />\nmore than I can see. Back in the were gathered here by Daniel C. Gil-<br />\n<br />\nEntered as second-class matter Oecember 3, 1909, at the Postoffice in Baltimore,<br />\ndays when I was a yearling, I felt man to begin the University estabMd., under the Act of Congress November 3, 1879.<br />\n<br />\nthe childishness of being ordered lished by Johns Hopkins, Rowland<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins around by sophomores rather keen- achieved more than local fame. His<br />\nUniversity.<br />\n<br />\nstimulatingdelightful-are the New Spring Books!<br />\nYou'll find rows and rows of them—brand-new books in bright covers—'<br />\nsmelling pungently of printer's ink and crisp paper—fiction, poetry,<br />\nbiography, science—awaiting your choice at our two stores<br />\n<br />\nTHE NORMAN, REMINGTON CO.<br />\n<br />\nly, but now that I have passed that investigations on the mechanical<br />\nDown-Town:<br />\nUp-Town:<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, stage, the usefulness of regulations equivalent of heat and his perfection<br />\nCharles St. at Mulberry<br />\n1118 North Charles Street<br />\nJohns Hopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nbecomes quite apparent. Whoever of the method for making diffracother communications to the EDITOR-IN-CHIEF.<br />\nwitnessed last Saturday's game must tion gratings are but two of his conUniversity 0100<br />\nTelephone<br />\nhave been impressed with the grow- tributions to his science. Gilman,<br />\ning weakness of the cheering sec- Remsen, and Rowland Halls are fitEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\ntion. Whereas, in former years, a ting companions.<br />\nGEORGE GUMP,'30<br />\nhorde of freshmen crowded into the<br />\nManaging Editor<br />\nstands<br />\nevery Saturday; today no<br />\nThose of you who have not read<br />\nROBERT S. BAIRD, '30<br />\nmore than a mere handful turn out the biography of Johns Hopkins,<br />\nAssistant Managing Editors<br />\nto watch games; and those who do written by his great niece, have<br />\nRICHARD HUNT,'31 GEOF GE DOWELL,'31<br />\nAssociate Editors<br />\ncome, don't even have a fairly good missed a pleasant few hours' readPAUL SPEAR, '30<br />\nSIDNEY WOLK, '30<br />\nknowledge of our songs and yells. ing. The founder of our University<br />\nJunior Editors<br />\nThe freshman cheer leader, him- was a man who made his life a<br />\n'30<br />\nHALL,<br />\nPURNELL<br />\nSTEWART L. SMITH, '30<br />\n•<br />\nHARWOOD F. MLTLLIKIN, JR.,'30 ROWLAND McD. NESS, '32<br />\nself, needs to look a little more care- worthwhile achievement. His biogNATHAN M. HARRIS, '32<br />\nFRANK CONE, '31<br />\nfully at the yells before he makes rapher has portrayed the man's<br />\nSYLVAN LEBOW, '32<br />\nGEORGE TRATTNER, '30<br />\nanother attempt at leading cheers. character in a homely, sympathetic<br />\nBUSINESS DEPARTMENT<br />\nGus BURK, '31<br />\nAround the campus the freshmen fashion and the volume is replete<br />\nCirculation Manager<br />\nAdvertising Manager<br />\nare<br />\neven more unbearable. Half of with numbers of anecdotes about<br />\nLYLE GULLEY, '30<br />\nSADLER ROBERTSON, '31<br />\nthem<br />\nare cheating themselves out the Baltimore merchant prince<br />\nOffice Manager<br />\nwho<br />\nReady-made<br />\nALVIN BLUM,'30<br />\nof a valuable part of their college founded a University<br />\nAnd Cut to Order<br />\nand<br />\na<br />\nHOs'32<br />\nHenry V. Saunders,<br />\nSIDNEY RAFEL, '31<br />\ncareers. They spend as little time pital but never lost his<br />\nESTABLISHED ENGLISH UNIVERSITY STYLES,<br />\nsympathy<br />\nTheodore Fleishman, '31<br />\nDavid S. Sykes, '32<br />\nTAILORED OVER YOUTHFUL CHARTS SOLELY FOR<br />\non the campus as is conveniently with the less<br />\nfortunate of his fellow<br />\nDISTINGUISHED SERVICE IN THE UNITED STATES<br />\nProduced by the R. L. Polk Printing Company 1930 Clifton Ave., Baltimore, Md. Possible mixing with the general men. Here was a man whose wealth<br />\nstudent body in a far less degree was gathered to<br />\naccomplish a defithan former entering men NiTho were nite<br />\npurpose, and in those last years<br />\nrequired to go out for at least one on the great estate,<br />\nClifton, Johns<br />\nextra-curricular activity: Numbers Hopkins<br />\ndreamed of the day when<br />\nof them parade uncodsciously the youth<br />\nof the country would<br />\nSuits $40 s45 s50 Overcoats<br />\nSPORTSMANSHIP FOR CASH<br />\nthrough Gilman Room, supposedly stroll under those<br />\nshady boughs<br />\nreserved for the pleasure of seniors seeking<br />\nOMMERCIALIZATION of football in our leading colleges and<br />\nknowledge, while in the<br />\nonly. Many of them do not attend distant city,<br />\nuniversities as revealed by the report of the Carnegie Foundation<br />\nthe skyline would<br />\nthe Advancement of Teaching is no startling piece of information<br />\nassemblies though that obligation show a rising<br />\ninstitution designed<br />\nhas<br />\nsimply<br />\nIt<br />\nsports.<br />\ncollegiate<br />\nof<br />\nfollowers<br />\nwell-informed<br />\nBY SPECIAL APPOINTMENT<br />\nto<br />\nto me<br />\nstill rests pon them. In short, t9<br />\nrelieve the evils of human sufferserved to bring the topic before the public eye in a sensational fashion<br />\nOUR STORE IS THE<br />\nthey are seriously in need of the dis- ing.<br />\nand has resulted in some very interesting statements from the heads of<br />\nfootcollege<br />\ncipline formerly wielded by the<br />\ninstitutions concerned in the report. The devolopment of<br />\n* * *<br />\nsophomore paddle; and campus senball to its present business-like aspect extends back over a period of<br />\nThe Barnstormers are blossoming<br />\nyears, and is by no means a late introduction into the field of athletics.<br />\ntiment certainly seems strongly in<br />\nportion<br />\nthat<br />\nup<br />\nin<br />\nsummed<br />\nwell<br />\nremarkably<br />\nforth in fine style. Under their<br />\nThe whole matter seems<br />\nfavor of restoring regulations to<br />\nof the Foundation's report which deals with football commercialization<br />\nsupervision<br />\nthe \"Barn\" is to be<br />\nfull force. There is no doubt that<br />\nor rather the absence of it in the colleges of Canada. Says the report:<br />\ntrans<br />\nformed<br />\ninto a second edition<br />\nthey are childish and should be be\"Canadian University sportsmanship is sufficiently strong to prevent<br />\nof<br />\nthe<br />\nTudor<br />\nand Stuart Club<br />\ncrux<br />\nwhole<br />\nthe<br />\nlies<br />\nThe character of the suits and<br />\n\"sportsmanship\"<br />\nrecruiting.\" In that single word<br />\nneath the dignity of college men;<br />\nrooms.<br />\nWe<br />\ntrust<br />\nthat<br />\ntheir<br />\nhistrionic<br />\nof the situation. Instead of playing the game for the pure love of sport,<br />\novercoats tailored by Charter House<br />\nyet when freshmen fail to adapt<br />\ntalents will not be unduly influenced<br />\nwe Americans put the emphasiso on the outcome of the contest. The<br />\nthemselves<br />\nto<br />\nwill earn your most sincere liking.<br />\ntheir<br />\nsurroundings<br />\nwinning assumes so much importance that the value of the sport itself<br />\nby this inheritance which they have<br />\nany<br />\nwithin<br />\nwitness<br />\na<br />\nreasonable<br />\nto<br />\ntime<br />\nit<br />\nis apis completely forgotten. We play to win. One has only<br />\nreceived. Luxury often leads to<br />\nparent that drastic measures are<br />\ncontest, especially football, between two rival colleges to see that<br />\ndegeneration.<br />\nThe Club is watchseeing<br />\nin<br />\nspirit exemplified. Spectators as well as players are interested<br />\nnecessary to produce results.<br />\nby<br />\nmethods<br />\nthe<br />\nabout<br />\nlittle<br />\ning<br />\nvery<br />\nanxiously<br />\ncare<br />\nfor candidates this<br />\nThey<br />\ndefeeated.<br />\nthe rival team<br />\n***<br />\nBaltimore, Charles and Fayette<br />\nwhich the contest is won and are not particularly anxious to see an<br />\nyear for its ranks have been seriThe intelligence of the college<br />\nexhibition of fine playing. The winning is what matters most. The<br />\nously<br />\ndepleted. Opportunity to<br />\nman reveals itself in a curious manEnglish have assumed a much happier attitude toward sports; they<br />\nstare<br />\nfootlights<br />\nin the face is awaitand<br />\nfairly<br />\nplayed<br />\nis<br />\nas<br />\nit<br />\nlong<br />\nas<br />\nand<br />\nplay because they like the game<br />\nner in the class room. No wonder<br />\ning many bashful (?) freshmen.<br />\nhonestly, the actual victory is not nearly so important a consideration<br />\nprofessors grow cynical when they<br />\nto them. As a result of the view that is taken in this country, the<br />\nare<br />\ndealing with collegiate youth.<br />\ntendency is to develop winning teams, which will bring out the crowd<br />\nStupid<br />\nquestions by the hundreds<br />\nthis<br />\nin<br />\neverywhere<br />\nand swell the gate receipts. It is no secret fact that<br />\ntheir<br />\nput<br />\nto<br />\ncollege<br />\nto<br />\nto<br />\ngo<br />\npaid<br />\nbeing<br />\nare<br />\nshot<br />\nat the innocent professor<br />\nare<br />\nability<br />\nof<br />\nathletes<br />\nland,<br />\ntalents to actual use. There is nothing morally wrong in paying a man<br />\nwho is compelled to maintain an<br />\nfor the use of his ability in special lines; the wrong simply lies in<br />\nattitude of patience though, no<br />\npresenting a false front to the outside world in claiming that these<br />\ndoubt, there are many times when<br />\nathletes are actually students of the institution for which they are playhe would like to do physical vioing and are there primarily for purposes of study. There is no objecto<br />\nit,<br />\nbut<br />\nfor<br />\nwilfully<br />\npay<br />\nwho<br />\nthose<br />\nfor<br />\nlence to the so-called student. There<br />\ntion to professional football<br />\ninject this professional element into avowedly amateur contests is<br />\nreally ought to be a law which<br />\nnothing more than thievery.<br />\nwould enable one to gag such quesThe solution to the whole problem, we believe, is to be found in the<br />\ntioners<br />\nafter the third successive<br />\nwhole<br />\nare<br />\na<br />\nColleges<br />\nas<br />\nincreased promotion of intra-mural athletics.<br />\noutburst. Even if the professor reentirely too lax about such matters. Very little of the athletic director's<br />\nDelicious and Refreshin<br />\ntime is occupied with the development of sports within the college.<br />\ntains his calm under such a fire, the<br />\nIf more students were to be encouraged to spend a certain amount of<br />\nclass ought not be required to stiftime in intra-mural sports, the unhealthy vicarious participation in<br />\nfer<br />\nin silence. I am sure the faculty<br />\ncollege athletics which is growing to rather alarming proportions<br />\nwould<br />\nlend its earnest support to<br />\nwould perhaps decrease. With the decrease in the immense crowds of<br />\nin<br />\ninterest<br />\nsections,<br />\nthe<br />\ncheering<br />\nany<br />\nthe<br />\nmeasures<br />\nthat might be taken to<br />\nremain<br />\nin<br />\nsimply<br />\nwho<br />\nstudents<br />\ninter-collegiate contests might diminish to reasonable proportions. With<br />\nsilence such offenders.<br />\nevery student a player himself, the tendency to glorify the super athlete<br />\n***<br />\nwould diminish and there would be a corresponding diminuation in<br />\nThe grass that remains on the<br />\nthe temptation to import stars on a financial basis.<br />\ncampus is gradually being worn<br />\nTo bring the question to a more personal basis, fortunately there is<br />\nvery little fault to be found with the system on our own campus. There<br />\naway by seekers after \"short cuts.\"<br />\n!las never been any question of paying football players at Hopkins.<br />\nThe new turf in front of Levering<br />\nOF COURSE IT'S NO<br />\nOur prowess on the football field may not be great; yet the taint of<br />\nHall<br />\nhas been trampled to unrecogFAIR PLAYING THE<br />\ncommercialization cannot be laid upon us and those who do play, play<br />\nnizable proportions while the barPROCTOR AND SPYING<br />\nbecause they like the game and are anxious to support their alma<br />\nriers lining the road certainly add<br />\nmater. The University authorities adopt a sensible policy of \"handsOUT SUCH A DELICATE<br />\noff\" as far as athletics are concerned, providing the participants mainnothing to the general beauty of the<br />\n66,...sk<br />\nSITUATION AS THIS.<br />\n,tain their scholastic standing. In same rare cases, members of various<br />\nregion. Rusty pipe and rotten ropes<br />\nBUT THEN, WERE<br />\nteams have played after graduation under what was an obvious preunited in slip-shod fashion form a<br />\nNO PROCTOR.<br />\ntense of doing graduate work, but these exceptions are few and far<br />\nline<br />\nAND<br />\ndesigned<br />\nto<br />\nWE CAN<br />\nprevent<br />\nparking.<br />\nbetween. The majority of men who play here after getting their degree<br />\nRESIST<br />\nbecause<br />\nthey<br />\nenjoy<br />\nthe<br />\nANYTHING<br />\nplaying<br />\non<br />\nteams<br />\nPerhaps<br />\nthis<br />\nare perfectly serious students,<br />\narrangement is inBUT TEMPTATION.<br />\nsport.. Any violation of this spirit is certainly not to be encouraged by<br />\ntended to be ornamental, but it fails<br />\nthe student body, even though it may be to the athletic advantage of<br />\nnoticeably short of its purpose. The<br />\nour teams to do so.<br />\nAll of which goes to prove (if<br />\ndetours<br />\nmade necessary by the conIn the past few years, there have been several members of university<br />\nwe may be excused for saying so)<br />\nstruction of the Physics Building<br />\nteams who have been \"black-listed.\" Comments and complaints on<br />\nthat the pause that refreshes is the<br />\nsuch procedure have at such times been made by numbers of students.<br />\nhave made inroads into other porsanest temptation which millions<br />\nThe fact that athletes are required to maintain a scholastic average as<br />\never -uccumbed to. And to these<br />\ntions of the turf. In the not very<br />\nwell as any other members of the University should be a source of<br />\nsame millions the pause that redistant future, we will no doubt<br />\npride rather than an object of criticism. There is no reason why an<br />\nfreshes has come to mean an icehave a desert for a campus instead<br />\nathlete should not be able to do his work as thoroughly as anyone<br />\ncold Coca-Cola. Its tingling,<br />\nof green sward.<br />\nelse. In fact, one would imagine that the athlete who has developed<br />\ndelicious taste and cool after-sense<br />\no'V<br />\n.* * *<br />\nof refreshment have proved that<br />\na perfect physical being would be more likely to possess a sound mind<br />\ncapable of functioning quickly and accurately. The cases of athletes<br />\na little minute is long enough for<br />\nSpeaking of the Physics Builda big rest any time.<br />\nwho, at the same time are accomplished scholars, are, to be sure, not<br />\ning reminds me that the trustees<br />\ntoo .frequent; but, then, all that is expected in the way of scholastic<br />\nThe Coca-Cola Co., Atlanta, Ca.<br />\nwill shortly christen the new struc-7_<br />\nattainments from an athlete is that he shall meet the average standard<br />\n1%1 I I:LION<br />\nset by the entire student body. This, certainly, is no unreasonable<br />\nture. No more worthy name could<br />\nrequest and any man who fails to meet the requirements deserves no<br />\nA DAY<br />\nbe selected than that of the first<br />\nsympathy. The more rigidly such rules are enforced by the University<br />\nYOU CAN'T BEAT THE<br />\ngreat Hopkins physicist, Rowland.<br />\nPAUSE THAT REFRESHES<br />\nthe more respect we will command from others and the less likely we<br />\nTo perpetuate his name in a<br />\nCD-3<br />\nwill be to find our name blazoned across the newspaper pages amid<br />\nIT<br />\nHAD<br />\nTO<br />\nBE<br />\n000 D<br />\nGET<br />\nTO<br />\nWHERE<br />\nIT<br />\nIs<br />\nRowland Hall would be far less than<br />\nsuch company as Western Maryland and some seventy-eight others.<br />\n<br />\nEDITORIALS<br />\n<br />\nMSC<br />\n<br />\nI<br />\n<br />\nhatter house<br />\n- - - of Baltimore<br />\n<br />\n/fie<br />\n<br />\nflub<br />\n<br />\nTALIAJE AtNI<br />\n/<br />\nKEERTITI<br />\n(1<br />\n74)<br />\n)<br />\n<br />\nI111F,<br />\n<br />\n\fTHE•JOHNS HOPKINS NEWS-LETTER, OCTOBER, 29, 1929<br />\n<br />\nCOACH CRITICI7ES<br />\nFOOTBALL INVESTIGATION<br />\nCarnegie Inquiry Covers Too<br />\nFew Colleges, Is Claim<br />\nSTATEMENT MADE FRIDAY<br />\nAthletic Scholarships Are<br />\nAdvertised By Some<br />\n(Continued from page 1 column 5)<br />\n<br />\nof certain promising students<br />\nthrough preparatory school and college. He asserted that a full realization of sport was possible only on a<br />\n\"free admission to games basis,\" as<br />\nin former years. However, he added<br />\nthat this was impractical under the<br />\nesent pecuniary system.<br />\n• Dr. Knight Dunlap, in a phamphlet on \"College Athletics,\" declared that the entire athletic system need reorganization. Professors<br />\nof many colleges, it was indicated,<br />\nwere completely cowed by athletic<br />\nassociations and the fear of empty<br />\nlecture room benches.<br />\nUnder the present mode of athletics, he said, those persons who<br />\nueeded physical training the most<br />\nwere neglected, while those who<br />\nwere naturally endowed with physical prowess were over-trained.<br />\n<br />\nDORM DOINGS<br />\nFood, that absolute necessity<br />\nwhich is such a vital part of our<br />\npresent civilization and nourishment<br />\nfor our bodies as well as our minds<br />\nto some extent, is to be found within restricted limits beneath the roof<br />\nof the Alumni Dormitory, but how!<br />\nThree times a day the helpless inmates are furnished with wholesome meals as is the word applied<br />\nin the lease; but for a more accurate<br />\ndescription of various synonyms for<br />\nthe word \"meal,\" which can not be<br />\n<br />\n$50.00 Weekly<br />\nEasily made. No exaggeration.<br />\nMany making more in spare time,<br />\nselling our attractive $1.00 box<br />\nassortment, containing 21 beautiful Christmas greeting cards.<br />\nEnormous sales. 1005, profit.<br />\n<br />\nBrosmille Pub., 1451 Broadway, New York<br />\n<br />\nBacon's Drug Store<br />\nAgents for<br />\n<br />\nSt. Paul and 31st Streets<br />\nSPECIALIZES<br />\n<br />\nANTON HORVAT<br />\nJeweler<br />\n<br />\nIn Accommodating Hopkins<br />\nStudents<br />\n<br />\nYou will find a large collection of<br />\nunusual semi-precious stone jewelry in our shops<br />\n<br />\nRIDE IN<br />\n<br />\nYELLOW<br />\nCABS<br />\n<br />\nGift Suggestions from $5 up<br />\nWe do jewelry and<br />\nwatch repairing<br />\n<br />\n338 N. CHARLES ST.<br />\n228 N. LIBERTY ST.<br />\n<br />\nSTAND AT HOMEWOOD<br />\nFIELD<br />\n<br />\nNO CHARGE FOR<br />\nEXTRA PASSENGERS<br />\n(2-3-4 or 5 MAY RIDE FOR<br />\nTHE PRICE OF ONE)<br />\nPHONE:<br />\n<br />\nVernon 1212<br />\n<br />\nhere reproduced for this is a university publication, all that one has<br />\nto do is but to be present when<br />\nfried tomatoes and a slice of bacon<br />\nare served at breakfast. For the enlightenment of any curious person,<br />\na list of the similar words employed<br />\nby the denizens will be furnished<br />\nat the NEWS-LETTER office while the<br />\nsubject is seated in a deep chair<br />\nwith an abundant quanity of spirits<br />\nof ammonia.<br />\n<br />\n3<br />\n<br />\nINTERCOLLEGIATE<br />\n<br />\nTHE M-M-T MOTOR CO.<br />\n<br />\n- - NEWS -<br />\n<br />\nDIRECT CHEVROLET DEALERS<br />\nHOmewood 3300-01—Night, HOmewood 6336<br />\n<br />\nA society of the University of<br />\nCalifornia recently held their annual Hi-Jinks, one of their major<br />\nparties of the year. The motif of<br />\nthe affair was taken from folklore, so that memories of favorite<br />\nchildhood characters were recalled<br />\nby those celebrating. In keeping<br />\nwith the theme, animal cookies and<br />\nother delicacies suggestive of childhood were served. Prizes were<br />\nawarded for the most original costumes and also for the best skits<br />\npresented by a sorority. About 25<br />\nsororities presented skits. Co-ed<br />\n\"cops\" were on hand to prevent inquisitive males from gaining entrance•<br />\n* * *<br />\n<br />\nSPECIAL!<br />\nThis week we have a few good low-priced Used<br />\nChevrolet and Ford Cars—Real Bargains—and<br />\nthe terms are so low you need pay only fifty cents<br />\nper day on some models. Communicate with<br />\n<br />\nMr. Richard H. Jandorf—P.0. Box 584<br />\nIs our HOPKINS representative<br />\nOpen Evenings<br />\n<br />\n25th Street and Greenmount Ave.<br />\nA certain resident rises some<br />\nrainy morning enclouded in a bit<br />\nof a fog and attends breakfast<br />\nCENTRAL Y. M. C. A. OFFERS HOPKINS MEN FULL PRIVILEGE<br />\nMEMBERSHIP TO JUNE 15 FOR $10.00<br />\nwhile wondering the day of the<br />\nweek, but when fish greets him at<br />\n_..:40110<br />\nthe table, he immediately remem.f.<br />\n\"semossos<br />\nbers that it must be Wednesday and<br />\n'<br />\nAn alarming situation has developed<br />\nat the University of Indiana.<br />\nthat he has an 8.30 to make. The<br />\n_ •'<br />\niil<br />\nsame process of deduction makes The number of male students has<br />\nsteadily<br />\nincreased,<br />\nand.,<br />\nunfortunatehim, or any other inmate, aware that<br />\nly, the opposite has been the case<br />\n..1<br />\n..<br />\nit is Thursday when he sights chipt t<br />\nwith the co-eds. While this is, no<br />\nped beef at breakfast. Friday is as- doubt, an advantageous<br />\nJ fl<br />\n—..<br />\nstate of af- ....._ certained by the presence of cakes fairs for the latter, the mere males<br />\n------,<br />\n_<br />\nand sausage in the morning, while report that it is becoming exceedingly<br />\nand<br />\nincreasingly<br />\ndifficult<br />\nto<br />\nget<br />\nscrambled eggs of the prehistoric era<br />\n_<br />\n,,<br />\nand uncertain origin designate Mon- dates. It is considered probable that<br />\n..,\"<br />\nI,<br />\nthey will be forced to resort to the<br />\nCall at Central \"Y\", Franklin and Cathedral Streets, or<br />\nday. However, toothpicks are furSee Secretary in Levering Hall<br />\nPurdue system of making \"Prom\"<br />\nnished in the latter case to assist in dates for<br />\nthe following year before<br />\nremoving the feathers from the leaving college the previous spring.<br />\nJ. H. FURST CO.<br />\n* * .*<br />\nteeth if the beast doesn't make his<br />\nBUY BOOKS<br />\nPRINTERS OF<br />\nThe Best Investment<br />\nSpeaking of Purdue, those of<br />\nescape before being devoured. But<br />\nFill your needs at<br />\nPhilological and Scientific<br />\nwith Sunday, the gloom disappears that institution who are historically<br />\nTHE SIGN OF THE MERMAID<br />\nPublications<br />\n918 North Charles Street<br />\nand all are happy for that is the day inclined are to present \"The Old<br />\nVernon 0053<br />\n23 S. HANOVER ST. BALTIMORE<br />\nof seeming great portions of chick- Soak,\" at their Playshop on Friday,<br />\nen (doubtlessly the eggs that took November 1.<br />\n* * *<br />\nadvantage of the kitchen heat)<br />\nOne thousand were present at the<br />\nwhich in reality are only chicken<br />\nNEW<br />\nUSED<br />\npate with an over-amount of dress- University of Vermont to hear Bering. Tuesday classes are indicated trand Russell, the noted English<br />\nby delicious fried apples and after- Philosopher, speak on the causes<br />\nnoon labs are attended because of of war. The various political, sothe presence of \"skinless franks\" cial, and industrial reasons for<br />\nand beans imported from the dis- strife were enumerated. Mr. Russell also stated that in the near futant shores of Boston.<br />\nAnd so the students of the Dormi- ture, the world would have only one<br />\ntory regulate their classes and keep civilization, as nations all over the<br />\ntheir dates straight by the diet to globe are rapidly becoming AmeriTHE BACKUS MOTOR COMPANY<br />\nwhich they are exposed thrice daily, canized.<br />\n*<br />\nif they chance to survive. Various<br />\n1 0-20 E. North Avenue<br />\nVermont's chapter of the Scabmembers escape on Wednesday by<br />\nbeing blessed with fraternity din- bard and Blade is planning to have<br />\nVernon 4300<br />\nners while the less fortunate indi- a military ball, one of the greatest<br />\nviduals attend track perhaps to find social events of the year at the<br />\nsome means of escape as well. Why, northern institution of learning, on<br />\nif anything should ever chance to November 11.<br />\n* **<br />\ngo wrong with the schedule of<br />\nInitiation of the yearlings ai<br />\nmeals, approximately 150 students<br />\nVillanova,<br />\nPa., was performed bewould miss classes and appointments<br />\nfore<br />\nthe<br />\namused<br />\neyes of a gaping<br />\nas long as the error continued.<br />\nmultitude.<br />\n.The<br />\nfestivities<br />\ncontinued<br />\nDoubtless, numerous week-ends<br />\nCLOTHES<br />\nfrom<br />\n7<br />\nin<br />\nthe<br />\nevening<br />\nuntil<br />\nmidwould be forgotten and a general<br />\n211-213 E. Baltimore<br />\nchaotic state would ensue from the night. The men 'of '33 appeared on<br />\noversight on the part of the chef. the scene attired in vari-coloreld paA special selection of<br />\nPerhaps this is a partial explanation jamas. Upon being blindfolded, they<br />\nof the pale and haggard appearance were given a solemn admonition tc<br />\nWoolens---Suits to Ord<br />\nof the inmates, and not late hours abandon all hope of mercy.<br />\nThe<br />\nfirst<br />\nordeal was the. applicaand over-study the entire cause of<br />\ntion of feathers and molasses on<br />\ntheir condition.<br />\nthe manly bosoms of the Frosh.<br />\nThe hands of the unfortunate newcomers were then washed with<br />\nFROSH DEBATE<br />\nsome<br />\nmysterious variety of a well(Continued from page 1 column 3)<br />\nnigh indelible green chemical. Relings with City. College and Forest freshments<br />\nwere then served, the<br />\nPark.<br />\nsophomores generously seeing that<br />\nTryouts for the Sophmore De- all of their guests<br />\npartook of the<br />\nbating Team will be held Thursday pills lavished upon them.<br />\nThe yearat 6 p. m. in Room 301, Remsen lings next had their<br />\ncountenance<br />\nHall. All members of the Sopho- decorated with paint<br />\nin order to<br />\nmore class who wish to try out for beautify them for<br />\nthe climax of the<br />\na place on the team are requested evening, the \"triumphal\"<br />\nmarch to<br />\nto report Thursday evening so that Bryn Mawr.<br />\nMr. Wheeler may choose the team<br />\n***<br />\nby impartial judging.<br />\nExtra! Extra! Studying declared<br />\nby statesmen to be of secondary importance in the collegiate routine!<br />\nAVUKAH PROGRAM<br />\nPremier McDonald warned the stu(Continued from page 1 column 4)<br />\ndents in a thrilling lecture at McGill<br />\ning organized. These will deal with University to be sure not to overvarious phases of Jewish interest, study. For studying crowds out the<br />\nsuch as Jewish history, Jewish prob- faculty of imagination! The Prelems, and Zionism.<br />\nmier advised students never to forThe annual smoker will take get to allow themselves to dream;<br />\nNationally<br />\nf\" - ie.:<br />\nJustly<br />\n6<br />\n.<br />\nplace Sunday evening, November for, after all, no great mental feat<br />\nFamous<br />\n3, at the Emerson Hotel. Judge is ever performed without imaginaKnown'<br />\nEli Frank, of the Supreme Court tion furnishing the inspiration and<br />\nBench of Baltimore has been in- playing the major role in the mental<br />\nMADE FOR YOU<br />\nvited to speak. Rabbi Mitchel S. process.<br />\nFisher, of New York, who was an<br />\nThe main feature of the program<br />\nAmerican representative at Oxford was the convocation of the degree<br />\nFOUR NORTH HOWARD STREET<br />\nat the International Debates, will of Doctor of Laws upon the distinguished Scottish.statesman.<br />\nalso be present.<br />\n<br />\nFORD<br />\n<br />\nAutomobiles<br />\nc-N....,<br />\n<br />\nOpen 8 P. M. Until Closing<br />\n<br />\nOASIS CABARET<br />\nGIRLS—GIRLS—GIRLS<br />\n\"Something Different\"<br />\n<br />\nBIG REVIEW<br />\nEast Baltimore and Frederick Sts.<br />\nTelephone: Calvert 6189<br />\n<br />\nTobacco's<br />\nat its best ...in<br />\na pipe<br />\n<br />\nSULSKY<br />\nSNAPPY<br />\n<br />\nM<br />\n<br />\nEN'S preference for a man's<br />\nsmoke—the pipe—is plenty<br />\npositive. But do you know why?<br />\nWe'll tell you.<br />\nFirst, pipe tobacco's different—<br />\nfor instance, Edgeworth. Second,<br />\ntobacco smolders as it should in a<br />\nPipe. And third, these mean you get<br />\nmore satisfaction—greater relish of<br />\nthe good old savory burley, soothing<br />\nfullness of rich smoke.<br />\nThere's even a fourth reason: you<br />\nlike good company. The pipe-smoking brotherhood is that.<br />\nTobacco's at its best in a pipe. It<br />\ngets a chance to be itself there—to<br />\nloosen up as it comes to life, to expand and take in air and glow. Only<br />\nthe choicest leaves get that chance,<br />\nmoreover, for pipes tell the truth<br />\nabout tobacco. Choice leaves, choice<br />\nblends, and mighty careful handling. Edgeworth comes up through<br />\neleven distinct processes before we're<br />\nWilling to pass it on to you.<br />\nIf you keep on missing all this,<br />\nthat's your fault—for we're waiting<br />\nto send you your first pipefuls of<br />\nEdgeworth. See the coupon? Fill it<br />\nout, get a good pipe and the postman<br />\nwill bring you a neat little glad-tomeet-you packet of good old Edgeworth.<br />\nEdgeworth is a careful blend of good<br />\ntobaccos—selected especially for pipesmoking. Its quality and flavor never<br />\nchange. Buy it anywhere—\"Ready<br />\nRubbed\"and \"Plug Slice\"— 150 pocket<br />\npackage to pound humidor tin.<br />\n<br />\nEDGEWORTH<br />\nLARUS & BRO. CO.,<br />\nRichraond, Va.<br />\nI'll try your Edgeworth. And I'll try<br />\nit in a good pipe.<br />\nName<br />\nStreet<br />\nTown and State<br />\nNow let the Edgeworth come! v<br />\n<br />\nTUXEDOS<br />\nTO<br />\n<br />\nRENT<br />\nVernon 3436<br />\n313 W. FRANKLIN STREET<br />\n<br />\nBosley's<br />\nPHARMACEUTICAL<br />\nSUPPLIES<br />\nFor J. H. U. Men<br />\nCHARLES AT<br />\nTWENTY-FIFTH<br />\n<br />\n$40<br />\n<br />\n.<br />\n<br />\n_<br />\n<br />\nSTETSON CLOTHES<br />\nfor<br />\n<br />\nTHE NEW<br />\n<br />\nlutist<br />\nTHOM<br />\n— Green<br />\n<br />\nIN COLOR<br />\n<br />\nAT<br />\nNO<br />\nEXTRA<br />\nCOST!<br />\n<br />\n.<br />\n<br />\nCollege QMen<br />\n-z-,.<br />\n<br />\nk5 '<br />\n<br />\no<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER, 29, 1929<br />\n<br />\nFEW REPORT FOR<br />\nFALL LACROSSE<br />\n<br />\nZU G<br />\n$8.50<br />\n<br />\nAll Lacrosse Men Must Attend<br />\nFall Practice Van Orman<br />\n<br />\nBrown Zug-Grain<br />\nMORRILL TO COACH<br />\n<br />\nA sturdy new shoe for young men with a generous measure<br />\nof style ... and priced to fit a Scotchman's purse.<br />\n<br />\nNine Letter Men Give Promise<br />\nOf Successful Season<br />\n<br />\nWYMAN<br />\n<br />\n111 E. Baltimore<br />\n<br />\nOnly fifteen men showed up for<br />\nthe first day of fall lacrosse practice<br />\nlast Thursday. This was an unusually poor showing in view of the<br />\nfact that so many members of last<br />\nyear's stick squad are still in the<br />\nUniversity. Such poor attendance,<br />\nhowever, was attributed more to the<br />\nbad weather and late posting of<br />\nnotices rather than any laxity on<br />\nthe part of the Jay stickwielders.<br />\n<br />\n19 E. Lexington<br />\n<br />\nFLY WITH CURTISS<br />\nMECHANICS, PILOTS and BUSINESS COURSES<br />\nWrite for interesting booklet or call at office<br />\n<br />\n1215 N. CHARLES STREET<br />\n<br />\nVernon 4792<br />\n<br />\nInter-Collegiate Lacrosse Association has grown until today it has<br />\ncolleges from every part of the<br />\ncountry east of the Mississippi<br />\nseeking admission into the Association.<br />\nHopkins was one of the pioneers<br />\nplaying and fostering the great Indian game. Always a leader, famous<br />\nBlue Jay stickwielders went to<br />\nmany colleges all over the East organizing and coaching lacrosse. Two<br />\nyears ago Hopkins stickmen were<br />\nthe first team to ever carry American colors to the Olympics. It is<br />\nup to the lacrosse players entering<br />\nHopkins today to keep this inspiring<br />\nrecord unchanged.<br />\n<br />\nIMPMOBILE<br />\nSIXES<br />\nECONOMY. Why be constantly spending on a low-price six when you can buy a 70-horsepower 1930 Hupmobile Six, fully equipped, for $1,195, delivered in Baltimore.<br />\n<br />\nEIGHTS<br />\nWhy pay around $1,500 for the so-called big six when you can buy a 100-horsepower<br />\nHupmobile Eight, fully equipped, for $1,750, delivered in Baltimore.<br />\nSEE—RIDE—DRIVE THEM—GET A REAL THRILL<br />\n<br />\nUSED CARS<br />\nAs fine a selection of reconditioned cars you will find anywhere. Many makes and many<br />\nstyles. Open and closed. Prices range from $35 to $600. Just the car for the college<br />\n<br />\nW. Kelso Morrill, for four years<br />\n.a member of championship Hopkins<br />\nlacrosse teams, will have charge of<br />\nfall practice this year. Practice will<br />\nbe held three days a week, Tuesday,<br />\nWednesday and Thursday, at \"The<br />\nWall\" on Homewood field. Equipment will be issued all lacrosse men<br />\nas soon as they have passed their<br />\nphysical examinations.<br />\n<br />\nHOniewood 8040-8041<br />\nYour clothes will always have that neat appearance if you will let us do your<br />\nCLEANING, DYEING, PRESSING AND REPAIRING<br />\n\"One Trial Will Convince You\"<br />\n<br />\nPARISIAN TAILORING CO.<br />\nCorner University Parkway<br />\n<br />\n346 E. 33rd Street<br />\n<br />\nSIMON ACKERMAN CLOTHES<br />\nReady To Wear<br />\n<br />\nA.JACOBS & SONS<br />\nUNIFORMS AND OUTFITS<br />\n128 W. Fayette Street<br />\n<br />\nTwo Showrooms<br />\nMt. Royal Avenue At McMechen Street<br />\nPhone: Madison 5355<br />\n<br />\nLiberty Heights Avenue At Garrison Avenue<br />\nPhone: Liberty 7038<br />\n<br />\nWERGLEY'S<br />\nCharles St., North<br />\nLa Patisserie<br />\nSANDWICHES PAR EXCELLENCE<br />\n2438<br />\n<br />\nCA.<br />\n<br />\nthought of Today--<br />\n<br />\nThe season's styles in neckwear are the key to a man's dress<br />\ngive that touch of personal effectiveness.<br />\n<br />\nBOOKS<br />\nBought—Sold—Exchanged<br />\nPIPPEN'S BOOK STORE<br />\nBooks on Nearly All Subjects<br />\n605 North Eutaw Street<br />\n<br />\nFall Training!<br />\n\"It is essential that every lacrosse<br />\nman not playing football report for<br />\nfall practice,\" Coach Ray Van Orman declared. \"Foundations for<br />\nHopkins championship ;lacrosse<br />\nteams have been built in the fall.<br />\nThe finishing touches are put on in<br />\nthe spring,\" the veteran Jay coach<br />\nstated yesterday. \"The Hopkins<br />\nstyle of lacrosse is totally different<br />\nfrom any prep school methods and<br />\nit is as important for the prep school<br />\nmen to learn this as it is for Hopkins men to keep improving their<br />\nstickwork, and knowledge of the<br />\ngame.\"<br />\n<br />\nFor A Tasty Bite—Anytime<br />\n<br />\nSandwich Shops<br />\n\"A Meal a Minute\"<br />\n208 EAST BALTIMORE STREET<br />\n(Open till 3 .4. id.)<br />\n<br />\nA. H. FETTING<br />\nMANUFACTURING JEWELRY CO.<br />\nManufacturers<br />\n<br />\nGreek Letter Fraternity Jewelry<br />\n<br />\nMorrill Clever<br />\n<br />\n314 NORTH CHARLES STREET<br />\n<br />\nCoach Morrill is an experienced<br />\nand skillful stick mentor. Green lacrosse candidates are particularly<br />\nfortunate to have the privilege of<br />\nlearning the game from one who is<br />\nnot only able, but willing, to take infinite pains with beginners. Experienced stickwielders can improve<br />\ntheir technique in addition to learning the fine points of the game.<br />\nProspects for next spring are<br />\nparticularly bright. In addition to<br />\nhaving nine letter men back, a number of promising freshmen will wear<br />\nthe blue uniform this spring. Although there will be a number of<br />\nexperienced men competing for<br />\nnearly every position, nothing is<br />\never decided until every man has<br />\nbeen given ample time to prove his<br />\nmettle at his chosen position. Many<br />\ngreen frshmen have put experienced<br />\nseniors on the bench.<br />\n<br />\nHUGO WEISBERGER<br />\n<br />\nPhone: Vernon 6196<br />\n<br />\nPEABODY BOOK SHOP<br />\n913 N. CHARLES STREET, BALTIMORE, MD.<br />\n<br />\nOpen Evenings<br />\nBOOKS, OLD and NEW<br />\nHarris, Frank: Montes the Matador ($2.50)<br />\n$1.00.<br />\nHarris, Frank: Unpathed Waters $2.50)<br />\n$1.00.<br />\nHarris, Frank: Nlan Shakespeare ($2.50)<br />\n$1.50.<br />\nHarris, Frank: Women of Shakespeare<br />\n($2.50) $1.50<br />\n<br />\nHuxley, Aldous: Essays—New and Old<br />\n($2:50) $1.00.<br />\nHuxley, Aldous: On the Margin ($2.00)<br />\n$1.00.<br />\nHuxley, Aldous: Young Archimedes ($2.00)<br />\n$1.00 .<br />\nWashington<br />\nMarshall, John: Life of<br />\n($24.50) $7.50.<br />\n<br />\n\"Friend of the Hopkins Man\"<br />\n<br />\nUnion Trust Company of Maryland<br />\nCHARLES AND FAYETTE STREETS<br />\n<br />\nNine Letter Men<br />\n<br />\n\"On the Route of the Charles Street Bus\"<br />\n<br />\n7<br />\n,<br />\n<br />\nAfter the Dance<br />\nliS<br />\n8 5-17 North Charles Street<br />\nIF YOU \"MAJOR\" IN<br />\nTRANSPORTATION—<br />\nOne thing quickly becomes clear to students of transportation<br />\nproblems.<br />\nIt is the fact that in large cities the electric car lines with<br />\ntheir auxiliary coach and bus routes form the backbone of<br />\ntransportation.<br />\nIn this permanent and necessary public utility the problems<br />\nand principles involved are worth the notice and study of<br />\nevery young man interested in public service.<br />\nTHE UNITED RAILWAYS AND ELECTRIC CO.<br />\nof Baltimore<br />\n<br />\nCorner Brownley and Joe Ferrorini will vie for the position of net<br />\nguardians again this year. Both<br />\nshowed unusual skill last year. Although \"Big Bill\" Kegan graduated,<br />\nJoe Bernard, equally portentious,<br />\nwill probably make it tough for any<br />\ninvaders who get too near the<br />\ncrease. Purnell Hall and Frank<br />\nCone, also letter men, are both out<br />\nto complete the close defense.<br />\nThe wing defense ought not to lack<br />\nability either. There's Bill Nickel,<br />\nDick Keating, Hurney Houston, and<br />\nAddison Campbell to put plenty of<br />\nstrength in the wings—and Jack<br />\nTurnbull, youthful star of Mt.<br />\nWashington and Poly, bids fair to<br />\nmore than uphold the great Turnbull tradition at Hopkins.<br />\nThe attack should also have potent, strong, flying wings. Bobby<br />\nLyons, Lorney Guild and Max<br />\nSauerwein should be back in harness, and Dukehart and Bim Love,<br />\ntough heads for the wings.<br />\nHopkins And Lacrosse<br />\n<br />\nDuring the past ten years lacrosse<br />\nhas increased in popularity more<br />\nthan any other sport in the country.<br />\nFrom a mere handful of members<br />\nin the Middle Atlantic States, the<br />\n<br />\nbody<br />\nman.<br />\n<br />\nJones Automobile Co., Inc.<br />\n<br />\nMorrill Coach<br />\n<br />\n,<br />\n<br />\n1930<br />\n<br />\nghe AMERICAN OIL &COMPANY<br />\nTransport Company<br />\nAfithated .gth Pan American Petroleum<br />\n<br />\nGeneral Offices: Baltimore, Md.<br />\n<br />\n\"The Store of Standard Values\"<br />\n<br />\nMcPHERSON'S<br />\n11 East Baltimore Street<br />\n<br />\nthey<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol. XXXIV, No. 9<br /><br />\n90 MEN PLEDGED<br />\nTO FRATS<br />\nSigma Phi Epsilon Leads List<br />\nWith 12 Men Pledged<br />\nFRATS<br /><br />\nFELL<br /><br />\nFRESHMEN<br /><br />\nOne-Third Of Freshmen Class<br />\nDecorated With Pledge Pins<br />\nThe fruits of the rushing season<br />\nhave at last been plucked. On Monday, October 28, Pledge Day, the<br />\nrushees at last had the final question<br />\nput to them and the following resulted. Pledged by:<br />\nBeta Theta Pi—<br />\nR. A. Baker, R. B. Jewell, Thos.<br />\nHogshead, R. M. Miller, Addison<br />\nClark, Fred Johnston<br />\nPhi Kappa Psi—<br />\nJ. McCabe, Triplett, Davis, Reid,<br />\nEgerton, Turnbull, Tucker, Mattingly McDorman, Kuhl, Shugerman.<br />\nDelta Phi—<br />\nWilloughby.<br /><br />\nPrice 5 Cents<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER, 29, 1929<br /><br />\nAVIATION NUMBER<br />\nOUT NOVEMBER 9<br />\nThe Aviation Number of<br />\nthe Black and Blue Jay will appear November 9, according<br />\nto its editor, McDorman. The<br />\ncover will be by Quirk, and<br />\nthe editorial and art contributions are forecast to be of the<br />\nhighest type. The Aviation<br />\nNumber will be followed by<br />\none of the best comic numbers in the Jay's history, a<br />\nGirl Number. The only information about this number that<br />\ncan be published at this time<br />\nis that the illustration of the<br />\nmost beautiful girl at Goucher,<br />\nas determined by a popularity<br />\ncontest at that college, will<br />\nadorn the Jay's front page.<br />\nBryan Quirk will draw that<br />\ncover from life.<br /><br />\nHOPKINS HARRIERS<br />\nWIN SECOND MEET<br /><br />\nBELATED REPORTS ARRIVE FROM<br />\nR. 0. T. C. SUMMER CAMP FRONT<br />\nThe following is an attempt to \"Scotch ale\" for water. There were<br />\nnarrate, in some measure, the more also quite a number of words unor less placid events attending the mentionable in this publication.<br />\nAfter dinner the boys put on<br />\nevents of the summer camp of the<br />\n\"fatigues\" for a little work, then<br />\nJohns Hopkins R. 0. T. C. unit. changed to uniform to receive pay.<br />\nIt seems that about 20 of this Next they changed back to fatigues.<br />\nyear's officers of the engineering Supper necessitated another change<br />\nbranch of the unit attended the to uniform. Then if town was the<br />\ncamp at Fort Humphries, Va., for object for the evening (Alexandria<br />\nsix weeks during the most delight- girls are really not so bad. Phone<br />\nful months of the. year—June and Alex. 4327-J) change to the regular<br />\nJuly. The temperature seldom reach- Hopkins unit uniform was necesed 125 degrees and the woolen shirts sary. All in all, the young officers<br />\nworn by the brave boys were quite became so adept that they could<br />\ncorn fortable.<br />\nchange clothes in approximately<br />\nPerhaps the description of the three minutes and thirty-seven secroutine of a single day will serve to onds.<br />\nshow the initiate the toils, perils,<br />\nEquitation\" simply meant horseand otherwise, that the embryonic mck riding. Some of the horses were<br />\nsoldiers went through in the pur- quite frisky and, although it is not<br />\nsuit of glory. Reveille sounded at recorded that anybody fell off,<br />\n5.45. Promptly at 5.57 everybody horses with riders grimly holding<br />\ngot up or was rolled out of bed. on with both hands around the said<br />\nLeisurely dressing, the soldiers as- horses' necks, frequently were seen<br />\nsembled at 6. Breakfast (Beg par- scampering off to various points of<br />\ndon!) Mess followed and then drill. the compass. The number of bruises<br />\nThen the boys changed to \"fatigues\" due to well-planted hoofs was also<br />\n\"Fatigue,\" let it be known to all and quite large.<br />\nsundry, is the title applied to ordiGuard was held at night. Three<br />\nnary work clothes. Then bridge; men were always on duty. It seems<br />\nwere built, pontoon bridges floated, that one night the inspecting officer<br />\nimaginary enemies stalked through came around to inspect the guard to<br />\nblackberry patches, or poor innocent see if they were performing their<br />\nlittle trees blown into small particles. duties properly. None of the guards<br />\nNext the soldiers dressed for din- could be found (awake). The inner in the regular uniform, which specting officer appropriated all the<br />\nthey duly partook (the dinner). rifles that could be found, and we<br />\nPages might be written of the have the distressing spectacle next<br />\nquaint names applied to the chow. morning, of the guard running<br />\n\"Gruly\" stood for stew, \"grease\" rings around the camp in search of<br />\nfor butter, \"sand\" for sugar and their rifles.<br /><br />\nRIFLE SCHEDULE<br />\nALMOST COMPLETE<br />\nNewton Schllinger, manager of the rifle team is arranging matches with colleges<br />\nand universities all over the<br />\ncountry, according to Captain<br />\nBass, coach.<br />\nThe range is now officially<br />\nopened for the members of the<br />\nrifle club. These men could<br />\nuse the range at any time until yesterday when reg liar assignments of hours were given<br />\nout.<br />\nAt present 43 men have enrolled and there are vacancies<br />\nfor others interested in marksmanship. The initial cost of<br />\nmembership is two dollars.<br /><br />\nJAYS DEFEAT<br />\nRANDOLPH-MACON<br />\nHopkins Makes 12 First Downs<br />\nRandolph-Macon 2<br />\nGUILD<br />\nThrills<br /><br />\nSTARS<br /><br />\nOf Game Come<br />\nSecond Half<br /><br />\nIn<br /><br />\nLast Saturday the Hopkins elevemi turned in its first victory of the<br />\nseason by defeating Randolph-Macon 13 to 0 at Homewood field.<br />\nFirst Half Uninteresting<br /><br />\nDuring the first half the struggle<br />\nwas very drab, and the thrilling<br />\nruns, which cause the stands to<br />\njump to their feet and yell, were<br />\nkicking. Hopkins was in possession<br />\nof the ball during most of the half,<br />\nand had the ball in the territory of<br />\nthe visiting Yellow Jackets, but they<br />\nseemed to lack the punch which<br />\nwas necessary to put the ball over<br />\nCarnegie Inquiry Covers Too<br />\nthe<br />\ngoal-line for a touchdown.<br />\nFew Colleges, Is Claim<br /><br />\nCOACH CRITICIZES<br />\nFOOTBALL INVESTIGATION<br /><br />\nSTATEMENT MADE FRIDAY<br /><br />\nAthletic Scholarships Are<br />\nSchiebel And Kelly Both BetAlpha Delta Phi—<br />\nAdvertised By Some<br />\nter Course Record<br />\nRich, Magill, W. Erickson, Chas.<br />\nCoach Van Orman declared FriCarter, W. Neilson, D. Murray, SCORE 31 TO 24<br />\nday<br />\nthat he regarded the issuance<br />\nDavies Storrs.<br />\nMajority Of Field Delayed By<br />\nof the report concerning assertions<br />\nFreight Train<br />\nKappa Sigma—<br />\nof professionalism and commercialMcCorkle, Umberger, O'Keefe,<br />\nSaturday the Johns Hopkins<br />\nism in college athletics by the CarSeaman, Glass, McMullen ShanaCross-Country team won its second<br />\nhan.<br />\nnegie Institute as a move too scant<br />\nmeet of the season when it defeated<br />\nin<br />\nscope to be considered as a<br />\nAlpha Tau Omega—<br />\nLehigh by a score of 31 to 24.<br />\ncriterion in collegiate practice. Mr.<br />\nW. Morris, S. Banks, D. Kelly,<br />\nRecord Broken<br />\nC. Williams, J. Towner, D. Rankin<br />\nVan Orman went on to say that<br />\nRunning over a strange course,<br />\nsome of the facts revealed by the<br />\nDelta Upsilon—<br />\nSchiebel<br />\nKelly<br />\nfield,<br />\nled<br />\nand<br />\nthe<br />\nreport have been for a number of<br />\nJ. Bender, D. Bittinger, R. Cockfinishing<br />\nthe<br />\nfive-and-a-tenth-mile<br />\ney, F. Douty, C. Gilbert, M. Gude,<br />\nyears common knowledge while<br />\nFreshmen Debate<br />\nDr. Siegfried to Give<br />\nC. Hughes, F. Kaltrider, H. Miller, run in record-breaking time. Both<br />\nTryouts Wednesday<br />\nThree Lectures others such as the charge of proM. Smith.<br />\nSchiebel and Kelly finished the run<br />\nfessionalism were essentially false.<br />\nTryouts for the Freshmen DebatThe James Schouler lectureship<br />\nThe lucrative gate receipts, astaken<br />\ntime<br />\nin<br />\nless<br />\nit<br />\nhas<br />\never<br />\nthan<br />\nSigma Phi Epsilon—<br />\ning Team will be held Wednesday at which is given every year will be serted the<br />\nmentor, were direct reR. Jones, J. Arias, M. Clayton, a Lehigh man to go over the course. 12.30 in Room B, second floor, Levpresented by Professor Andre sults of a public demand that is<br />\nP. Cole, R. Donnock, G. Forrest, The former record was thirty min- ering Hall. Three debaters, an al- Siegfried, author<br />\nof \"America yearly reaching huge pooportions.<br />\nE. Lyon, J. Mandrel, H. Neuman, utes, sixteen seconds. Schiebel to-nate, and a secretary will be Comes<br />\nof Age.\" He will lecture on<br />\nAthletic Scholarships<br />\nM. Seitz, J. Sullivan, J. Lookey.<br />\nclipped two minutes, fifty-four sec- cl- osen at the tryouts. The Freshman the French Political Psychology.<br />\n\"The public demand,\" he said,<br />\nPhi Gamma Delta—<br />\nonds off this time, being clocked at Debating Team will meet the Soph- The schedule consists of three lec- \"has been for champions. And not<br />\nStone, Heyn, Fry, Wolf, Mar- twenty-seven minutes, thirty-two more team sometime in November tures. Tomorrow he will lecture on a few institutions have gone to<br />\nexon a subject not yet determined. All \"French national characteristics.\"<br />\nshall, Merriken, Bond, Hobleman,<br />\ntreme lengths to satisfy this demand.<br />\nseconds; and Kelly cut the record members of the Freshman class are<br />\nFriday, November 1, 1929, he will<br />\nC. Kelly.<br />\nby one minute, thirty-six seconds, eligible for the team. All candidates present the \"Political Parties in A number of colleges had no qualms<br />\nabout publicly advertising their<br />\nKappa Alpha—<br />\nhis time being twenty-eight minutes, are requested to prepare a two-min- France.\" This will be followed by<br />\nathletic scholarships. However, the<br />\nL. B. Jones, J. W. Matthews, K.<br />\nute speech on any topic whatever the \"Fundamentals of the Governtheory to the effect that leading<br />\nJ. Quickel, G. F. Packard, A. H. forty seconds.<br />\nto<br />\nbe given at the tryouts.<br />\nment of France\" on Monday, NoAfter Schiebel and Kelly had<br />\nathletes<br />\nand graduate managers rePlitt, Jr., Straung.<br />\nMr. Wheeler of the English De- vember 4.<br />\ntaken the first two places, Lehigh<br />\nceive<br />\na<br />\nportion<br />\nof football receipts is<br />\nOmicron Kappa Omicron—<br />\npartment has very graciously ofThese lectures will be presented<br />\nonly<br />\ntrue<br />\nin<br />\nisolated<br />\ncases.\"<br />\nMacLellan, Belitz, Biggs, Green, placed a man third. Emerson, of fered to aid the Frosh team, so that in the Civil Engineering Hall of<br />\nAthletics in practically every colArmstrong, Keiper, Retaliata, Mu- Hopkins, ran fourth. Lehigh came they may be able to at least let the the Johns Hopkins University at<br />\nin fifth, sixth and seventh, then team representing the Class of 1932 Homewood at 5 p. m. All are wel- lege, according to Van Orman, are<br />\nniz.<br />\nnot sponsored, despite popular<br />\nHopkins' last two counting men know that they have debated with come<br />\nSigma Tau Delta—<br />\ntenet,<br />\nby a small group of alumni,<br />\nplaced eighth and ninth ; they were veterans. One member at least, or<br />\nTitus, Cox, Gore.<br />\ndirectly handled, financially<br />\nbut<br />\nare<br />\nMiller and Packard, respectively. two members if necessary will be<br />\nAau Alpha Phi—<br />\notherwise,<br />\nand<br />\nby the faculty and<br />\nWaters, who had been counting for elected from the Freshman team to Avukah Society<br />\nR. Williams, A. Lahman, Harper. Hopkins in the meets for the last the Debating Council.<br />\nthe<br />\ntreasurer's<br />\noffice.<br />\nAnnounces Program<br />\nHopkins Lack Winning Teams<br />\nseveral years, had trouble with his<br />\nIf victorious ill its first debate,<br />\nAlpha Mu Tau—<br />\nAt a cenference meeting held last<br />\nHopkins, it was learned, has<br />\nthe secretary of the Freshman team Thursday, attended by representaMurphy, J. Loggerman, R. F. leg and came in tenth.<br />\nrarely produced a winning team<br />\nwill arrange debates for the yearAkehurst, C. Fowlus, E. Anstine,<br />\ntives of the classes and Jewish<br />\nDifficult Course<br />\n(Continued on page 3 column 3)<br />\nsimply because it has been the poliT. R. Kuhn, J. Penny.<br />\nfraternities the program of the cy of the<br />\nThe Lehigh course was very<br />\nauthorities to spurn exClasses Unattended<br />\ndifferent from the Hopkins course. Musical Clubs Hold<br />\nHopkins Chapter of the Avukah traneous methods of corraling athPledge Day as usual was marked Instead of starting the run from the<br />\nWeekly Meetings was announced.<br />\nletes. Consequently the gleam of<br />\nbY shrunken class attendance, locker rooms and running \"crossThis<br />\nprogram<br />\nconsists of bi- publicity and recognition has lured<br />\nLast Thursday evening a meetfrantic \"rushing\" about the campus country\" the race started from a<br />\ning of the Musical Club was held monthly student body meetings. the worthier player away from the<br />\nin search of the rushee, etc. So point at the top of a hill, a little<br />\nHopkins to colleges who offer startThese will be held on the campus<br />\nin Levering _Hall.<br />\nmore<br />\nthan<br />\nmiles<br />\nfrom<br />\nfive<br />\nthe<br />\nLeling<br />\nconcessions to athletes.<br />\nfar about 90 men have been pledged<br />\nPrevious to the meeting a picture and will be addressed by nationallyhigh campus, and was along auto<br />\nOther members of the Athletic<br />\nand from the optimism of most of<br />\nroads. The contestants were driven of the group around a Kolster radio known speakers.<br />\nAssociations<br />\nstrongly reiterated<br />\nthe fraternities at least a dozen by bus to this point.<br />\nThe first mile- was taken in the assembly room of<br />\nThe distingushed orator and au- Coach Van Orman's statement. It<br />\nmore will be pledged before night- and-a-quarter of the grind was<br />\nLevering Hall. Elliot lead the club thor, Maurice Samuel, will speak at was pointed out that the Carnegie<br />\nfall. About one-third of the fresh- down hill. At the base of the hill<br />\nusual. The song that was re- such a meeting, on the afternoon of Foundation's report had included a<br />\nman class has been pledged to a the course crossed the main line of as<br />\nmere hundred and sixty-eight colthe Central Railroad of New Jersey, hearsed was \"To Arms.\" The Club November 13.<br />\nleges out of a possible eight hunfraternity or another.<br />\nThe Avukah is at present arrangand then continued along the bank is doing very well on this and Steindred. It was generally believed that<br />\nS. P. E.'s Have Most Men<br />\nof the Lehigh river for a mile and wald is very optimistic on the pros- ing for a public meeting, to be held the investigation would be<br />\nlikely to<br />\nSigma Phi Epsilon leads the three-quarters, and again crossed<br />\npects. At the end of the meeting in the city early in December. This incur more harm than good, since<br />\nranks, with twelve pledged men, the railroad before entering the<br />\nmeeting will be held in honor of the a number of guiltier colleges had<br />\nand Phi Kappa Psi and Delta Up- city for the last two-and-a-tenth the members were given copies of<br />\nmusic, so they might practice national secretary, J. W. Wise, and not been accused, while universities<br />\nsilon being a close second and miles through the town and up a the<br />\ninnocent of indiscretions were likely<br />\nat home. Although the activity of Professsor W. F. Albright of the<br />\nthird, with 11, and 9 men pledged steep hill onto the campus of the<br />\nto<br />\ntend toward the commercialism<br />\nthe club has started, any new voices University. It is also planned to have that other institutions had so<br />\nUniversity.<br />\nsucrespectively.<br />\nMr. Wise speak at an assembly<br />\nAt the second railroad 'crossing are welcome.<br />\ncessfully negotiated.<br />\nIt is expected that by tomorrow<br />\nSchiebel and Kelly managed to beat<br />\nSteinwald led the Jay orchestra meeting before the entire student<br />\nDean Berry said that he was acthe campus will have returned to<br />\nfreight<br />\nat<br />\ntrain<br />\nto<br />\nthe crossing, but<br />\na<br />\n4.30 and Gebelein the Banjo body.<br />\nquainted with instances in which<br />\nits usual status of quiet and dig- the rest of the field lost several min- Club. Both feel that their sections<br />\nA series of study circles are be- athletic associations paid the tuition<br />\nnity.<br />\nutes while the train passed.<br />\nare doing well in the rehearsals.<br />\n(Continued on page 3 column 3)<br />\n(Continued on Page 3, Column 1)<br /><br />\nGuild Thrills Crowd<br /><br />\nWhen the Jays came on the field<br />\nto resume play ill the second half,<br />\nthey looked like a different crowd.<br />\nThey now seemed to have the pep<br />\nwhich they lacked during the early<br />\nstages of the game. The one outstanding- play which thrilled the<br />\ncrowd of about 1,500 fans and<br />\nbrought them to their feet with<br />\nlusty cheers and applause, came in<br />\nthe third quarter when Loren Guild,<br />\nHopkins quarterback, after making<br />\na spectacular one-handed interception of a long forward pass by Bryant, ran 65 yards through the whole<br />\nRandolph-Macon te* to deposit<br />\nthe ball behind the goal-line for<br />\nHopkins' first score. The run was<br />\na good one, but it was only made<br />\npossible by the combined efforts of<br />\nthe whole Jay team. Every man<br />\nrealized what he must do to make<br />\nthe most of this opportunity and,<br />\ngathering fast they formed beautiful<br />\ninterference for their quarterback<br />\nand cut down the Yellow Jackets<br />\none by one, thus affording Guild a<br />\nnarrow passage down the west side<br />\nof the field. The Jays tried to kick<br />\nthe ball over the goal posts for the<br />\nextra point, but failed.<br />\nThreaten Jay Goal<br /><br />\nThis play seemed to arouse the<br />\nfighting spirit in both teams. Randolph-Macon recovered and started.<br />\ndown the field toward the Blue Jay<br />\ngoal. By a series of beautiful overthe-line passes, accompanied by a<br />\nfew line-bucks, the Yellow Jackets<br />\nworked the ball down the field to<br />\nthe Jay 25-yard line. The Jays dug<br />\ntheir cleats deep into the ground<br />\nand forced their opponents to lose<br />\nthe ball on downs.<br />\nJays Score Again<br /><br />\nHere Hopkins started a fierce<br />\noffensive that coundn't be stopped.<br />\nJack Turnbull tucked the pig skin<br />\nunder his arm and ran around the<br />\nleft end for a 20-yard gain. A few<br />\ncompleted passes, coupled with a<br />\nseries of off-tackle plays placed the<br />\nball on the Yellow Jackets' 20-yard<br />\nline. A penalty put the ball on the<br />\nfive-yard line and on the second play<br />\nTurnbull went over for a touchdown. Bledsoe drop-kicked for the<br />\nextra point.<br />\nLine-up:<br />\nHopkins.<br />\nPos.<br />\nR.-Macon<br />\nRosenberg . . . L.E.<br />\nParr<br />\nLove . . . .....L.T...<br />\n.Hoskins<br />\nWeilzel . ....L.G. .<br />\n.Fielding<br />\nHelm<br />\nTrader<br />\nTowbin .<br />\nR.G.<br />\nCoffey<br />\nBioloskorsky ..R.T. . ..Woodson<br />\nTriplett .. ..R.E. .<br />\n.Douthat<br />\nGuild<br />\nQ B.<br />\nKing<br />\nTurnbull. ..L.H. . ...Cockrell<br />\nMerriken . ...R.H. . ....Burger<br />\nMills . . ......F.B. . ....Bryant<br />\nScore by quarters:<br />\nHopkins<br />\n0 0 6 7-13<br />\nRandolph-Macon ....0 0 0 0— 0<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER, 29, 1929<br /><br />\nBEjamsH .<br /><br />\nNgyattLETTE<br /><br />\n..‘<br /><br />\nYES and NO<br />\nBy PAUL W. SPEAR<br /><br />\nFOUNDED 1897<br /><br />\nWhatever led the Student Council his fame deserves. As a member<br />\n$2.00 to abolish Freshman Regulations is of that select group of genii who<br /><br />\nSubscription<br /><br />\nmore than I can see. Back in the were gathered here by Daniel C. Gil-<br /><br />\nEntered as second-class matter Oecember 3, 1909, at the Postoffice in Baltimore,<br />\ndays when I was a yearling, I felt man to begin the University estabMd., under the Act of Congress November 3, 1879.<br /><br />\nthe childishness of being ordered lished by Johns Hopkins, Rowland<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins around by sophomores rather keen- achieved more than local fame. His<br />\nUniversity.<br /><br />\nstimulatingdelightful-are the New Spring Books!<br />\nYou'll find rows and rows of them—brand-new books in bright covers—'<br />\nsmelling pungently of printer's ink and crisp paper—fiction, poetry,<br />\nbiography, science—awaiting your choice at our two stores<br /><br />\nTHE NORMAN, REMINGTON CO.<br /><br />\nly, but now that I have passed that investigations on the mechanical<br />\nDown-Town:<br />\nUp-Town:<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, stage, the usefulness of regulations equivalent of heat and his perfection<br />\nCharles St. at Mulberry<br />\n1118 North Charles Street<br />\nJohns Hopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nbecomes quite apparent. Whoever of the method for making diffracother communications to the EDITOR-IN-CHIEF.<br />\nwitnessed last Saturday's game must tion gratings are but two of his conUniversity 0100<br />\nTelephone<br />\nhave been impressed with the grow- tributions to his science. Gilman,<br />\ning weakness of the cheering sec- Remsen, and Rowland Halls are fitEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\ntion. Whereas, in former years, a ting companions.<br />\nGEORGE GUMP,'30<br />\nhorde of freshmen crowded into the<br />\nManaging Editor<br />\nstands<br />\nevery Saturday; today no<br />\nThose of you who have not read<br />\nROBERT S. BAIRD, '30<br />\nmore than a mere handful turn out the biography of Johns Hopkins,<br />\nAssistant Managing Editors<br />\nto watch games; and those who do written by his great niece, have<br />\nRICHARD HUNT,'31 GEOF GE DOWELL,'31<br />\nAssociate Editors<br />\ncome, don't even have a fairly good missed a pleasant few hours' readPAUL SPEAR, '30<br />\nSIDNEY WOLK, '30<br />\nknowledge of our songs and yells. ing. The founder of our University<br />\nJunior Editors<br />\nThe freshman cheer leader, him- was a man who made his life a<br />\n'30<br />\nHALL,<br />\nPURNELL<br />\nSTEWART L. SMITH, '30<br />\n•<br />\nHARWOOD F. MLTLLIKIN, JR.,'30 ROWLAND McD. NESS, '32<br />\nself, needs to look a little more care- worthwhile achievement. His biogNATHAN M. HARRIS, '32<br />\nFRANK CONE, '31<br />\nfully at the yells before he makes rapher has portrayed the man's<br />\nSYLVAN LEBOW, '32<br />\nGEORGE TRATTNER, '30<br />\nanother attempt at leading cheers. character in a homely, sympathetic<br />\nBUSINESS DEPARTMENT<br />\nGus BURK, '31<br />\nAround the campus the freshmen fashion and the volume is replete<br />\nCirculation Manager<br />\nAdvertising Manager<br />\nare<br />\neven more unbearable. Half of with numbers of anecdotes about<br />\nLYLE GULLEY, '30<br />\nSADLER ROBERTSON, '31<br />\nthem<br />\nare cheating themselves out the Baltimore merchant prince<br />\nOffice Manager<br />\nwho<br />\nReady-made<br />\nALVIN BLUM,'30<br />\nof a valuable part of their college founded a University<br />\nAnd Cut to Order<br />\nand<br />\na<br />\nHOs'32<br />\nHenry V. Saunders,<br />\nSIDNEY RAFEL, '31<br />\ncareers. They spend as little time pital but never lost his<br />\nESTABLISHED ENGLISH UNIVERSITY STYLES,<br />\nsympathy<br />\nTheodore Fleishman, '31<br />\nDavid S. Sykes, '32<br />\nTAILORED OVER YOUTHFUL CHARTS SOLELY FOR<br />\non the campus as is conveniently with the less<br />\nfortunate of his fellow<br />\nDISTINGUISHED SERVICE IN THE UNITED STATES<br />\nProduced by the R. L. Polk Printing Company 1930 Clifton Ave., Baltimore, Md. Possible mixing with the general men. Here was a man whose wealth<br />\nstudent body in a far less degree was gathered to<br />\naccomplish a defithan former entering men NiTho were nite<br />\npurpose, and in those last years<br />\nrequired to go out for at least one on the great estate,<br />\nClifton, Johns<br />\nextra-curricular activity: Numbers Hopkins<br />\ndreamed of the day when<br />\nof them parade uncodsciously the youth<br />\nof the country would<br />\nSuits $40 s45 s50 Overcoats<br />\nSPORTSMANSHIP FOR CASH<br />\nthrough Gilman Room, supposedly stroll under those<br />\nshady boughs<br />\nreserved for the pleasure of seniors seeking<br />\nOMMERCIALIZATION of football in our leading colleges and<br />\nknowledge, while in the<br />\nonly. Many of them do not attend distant city,<br />\nuniversities as revealed by the report of the Carnegie Foundation<br />\nthe skyline would<br />\nthe Advancement of Teaching is no startling piece of information<br />\nassemblies though that obligation show a rising<br />\ninstitution designed<br />\nhas<br />\nsimply<br />\nIt<br />\nsports.<br />\ncollegiate<br />\nof<br />\nfollowers<br />\nwell-informed<br />\nBY SPECIAL APPOINTMENT<br />\nto<br />\nto me<br />\nstill rests pon them. In short, t9<br />\nrelieve the evils of human sufferserved to bring the topic before the public eye in a sensational fashion<br />\nOUR STORE IS THE<br />\nthey are seriously in need of the dis- ing.<br />\nand has resulted in some very interesting statements from the heads of<br />\nfootcollege<br />\ncipline formerly wielded by the<br />\ninstitutions concerned in the report. The devolopment of<br />\n* * *<br />\nsophomore paddle; and campus senball to its present business-like aspect extends back over a period of<br />\nThe Barnstormers are blossoming<br />\nyears, and is by no means a late introduction into the field of athletics.<br />\ntiment certainly seems strongly in<br />\nportion<br />\nthat<br />\nup<br />\nin<br />\nsummed<br />\nwell<br />\nremarkably<br />\nforth in fine style. Under their<br />\nThe whole matter seems<br />\nfavor of restoring regulations to<br />\nof the Foundation's report which deals with football commercialization<br />\nsupervision<br />\nthe \"Barn\" is to be<br />\nfull force. There is no doubt that<br />\nor rather the absence of it in the colleges of Canada. Says the report:<br />\ntrans<br />\nformed<br />\ninto a second edition<br />\nthey are childish and should be be\"Canadian University sportsmanship is sufficiently strong to prevent<br />\nof<br />\nthe<br />\nTudor<br />\nand Stuart Club<br />\ncrux<br />\nwhole<br />\nthe<br />\nlies<br />\nThe character of the suits and<br />\n\"sportsmanship\"<br />\nrecruiting.\" In that single word<br />\nneath the dignity of college men;<br />\nrooms.<br />\nWe<br />\ntrust<br />\nthat<br />\ntheir<br />\nhistrionic<br />\nof the situation. Instead of playing the game for the pure love of sport,<br />\novercoats tailored by Charter House<br />\nyet when freshmen fail to adapt<br />\ntalents will not be unduly influenced<br />\nwe Americans put the emphasiso on the outcome of the contest. The<br />\nthemselves<br />\nto<br />\nwill earn your most sincere liking.<br />\ntheir<br />\nsurroundings<br />\nwinning assumes so much importance that the value of the sport itself<br />\nby this inheritance which they have<br />\nany<br />\nwithin<br />\nwitness<br />\na<br />\nreasonable<br />\nto<br />\ntime<br />\nit<br />\nis apis completely forgotten. We play to win. One has only<br />\nreceived. Luxury often leads to<br />\nparent that drastic measures are<br />\ncontest, especially football, between two rival colleges to see that<br />\ndegeneration.<br />\nThe Club is watchseeing<br />\nin<br />\nspirit exemplified. Spectators as well as players are interested<br />\nnecessary to produce results.<br />\nby<br />\nmethods<br />\nthe<br />\nabout<br />\nlittle<br />\ning<br />\nvery<br />\nanxiously<br />\ncare<br />\nfor candidates this<br />\nThey<br />\ndefeeated.<br />\nthe rival team<br />\n***<br />\nBaltimore, Charles and Fayette<br />\nwhich the contest is won and are not particularly anxious to see an<br />\nyear for its ranks have been seriThe intelligence of the college<br />\nexhibition of fine playing. The winning is what matters most. The<br />\nously<br />\ndepleted. Opportunity to<br />\nman reveals itself in a curious manEnglish have assumed a much happier attitude toward sports; they<br />\nstare<br />\nfootlights<br />\nin the face is awaitand<br />\nfairly<br />\nplayed<br />\nis<br />\nas<br />\nit<br />\nlong<br />\nas<br />\nand<br />\nplay because they like the game<br />\nner in the class room. No wonder<br />\ning many bashful (?) freshmen.<br />\nhonestly, the actual victory is not nearly so important a consideration<br />\nprofessors grow cynical when they<br />\nto them. As a result of the view that is taken in this country, the<br />\nare<br />\ndealing with collegiate youth.<br />\ntendency is to develop winning teams, which will bring out the crowd<br />\nStupid<br />\nquestions by the hundreds<br />\nthis<br />\nin<br />\neverywhere<br />\nand swell the gate receipts. It is no secret fact that<br />\ntheir<br />\nput<br />\nto<br />\ncollege<br />\nto<br />\nto<br />\ngo<br />\npaid<br />\nbeing<br />\nare<br />\nshot<br />\nat the innocent professor<br />\nare<br />\nability<br />\nof<br />\nathletes<br />\nland,<br />\ntalents to actual use. There is nothing morally wrong in paying a man<br />\nwho is compelled to maintain an<br />\nfor the use of his ability in special lines; the wrong simply lies in<br />\nattitude of patience though, no<br />\npresenting a false front to the outside world in claiming that these<br />\ndoubt, there are many times when<br />\nathletes are actually students of the institution for which they are playhe would like to do physical vioing and are there primarily for purposes of study. There is no objecto<br />\nit,<br />\nbut<br />\nfor<br />\nwilfully<br />\npay<br />\nwho<br />\nthose<br />\nfor<br />\nlence to the so-called student. There<br />\ntion to professional football<br />\ninject this professional element into avowedly amateur contests is<br />\nreally ought to be a law which<br />\nnothing more than thievery.<br />\nwould enable one to gag such quesThe solution to the whole problem, we believe, is to be found in the<br />\ntioners<br />\nafter the third successive<br />\nwhole<br />\nare<br />\na<br />\nColleges<br />\nas<br />\nincreased promotion of intra-mural athletics.<br />\noutburst. Even if the professor reentirely too lax about such matters. Very little of the athletic director's<br />\nDelicious and Refreshin<br />\ntime is occupied with the development of sports within the college.<br />\ntains his calm under such a fire, the<br />\nIf more students were to be encouraged to spend a certain amount of<br />\nclass ought not be required to stiftime in intra-mural sports, the unhealthy vicarious participation in<br />\nfer<br />\nin silence. I am sure the faculty<br />\ncollege athletics which is growing to rather alarming proportions<br />\nwould<br />\nlend its earnest support to<br />\nwould perhaps decrease. With the decrease in the immense crowds of<br />\nin<br />\ninterest<br />\nsections,<br />\nthe<br />\ncheering<br />\nany<br />\nthe<br />\nmeasures<br />\nthat might be taken to<br />\nremain<br />\nin<br />\nsimply<br />\nwho<br />\nstudents<br />\ninter-collegiate contests might diminish to reasonable proportions. With<br />\nsilence such offenders.<br />\nevery student a player himself, the tendency to glorify the super athlete<br />\n***<br />\nwould diminish and there would be a corresponding diminuation in<br />\nThe grass that remains on the<br />\nthe temptation to import stars on a financial basis.<br />\ncampus is gradually being worn<br />\nTo bring the question to a more personal basis, fortunately there is<br />\nvery little fault to be found with the system on our own campus. There<br />\naway by seekers after \"short cuts.\"<br />\n!las never been any question of paying football players at Hopkins.<br />\nThe new turf in front of Levering<br />\nOF COURSE IT'S NO<br />\nOur prowess on the football field may not be great; yet the taint of<br />\nHall<br />\nhas been trampled to unrecogFAIR PLAYING THE<br />\ncommercialization cannot be laid upon us and those who do play, play<br />\nnizable proportions while the barPROCTOR AND SPYING<br />\nbecause they like the game and are anxious to support their alma<br />\nriers lining the road certainly add<br />\nmater. The University authorities adopt a sensible policy of \"handsOUT SUCH A DELICATE<br />\noff\" as far as athletics are concerned, providing the participants mainnothing to the general beauty of the<br />\n66,...sk<br />\nSITUATION AS THIS.<br />\n,tain their scholastic standing. In same rare cases, members of various<br />\nregion. Rusty pipe and rotten ropes<br />\nBUT THEN, WERE<br />\nteams have played after graduation under what was an obvious preunited in slip-shod fashion form a<br />\nNO PROCTOR.<br />\ntense of doing graduate work, but these exceptions are few and far<br />\nline<br />\nAND<br />\ndesigned<br />\nto<br />\nWE CAN<br />\nprevent<br />\nparking.<br />\nbetween. The majority of men who play here after getting their degree<br />\nRESIST<br />\nbecause<br />\nthey<br />\nenjoy<br />\nthe<br />\nANYTHING<br />\nplaying<br />\non<br />\nteams<br />\nPerhaps<br />\nthis<br />\nare perfectly serious students,<br />\narrangement is inBUT TEMPTATION.<br />\nsport.. Any violation of this spirit is certainly not to be encouraged by<br />\ntended to be ornamental, but it fails<br />\nthe student body, even though it may be to the athletic advantage of<br />\nnoticeably short of its purpose. The<br />\nour teams to do so.<br />\nAll of which goes to prove (if<br />\ndetours<br />\nmade necessary by the conIn the past few years, there have been several members of university<br />\nwe may be excused for saying so)<br />\nstruction of the Physics Building<br />\nteams who have been \"black-listed.\" Comments and complaints on<br />\nthat the pause that refreshes is the<br />\nsuch procedure have at such times been made by numbers of students.<br />\nhave made inroads into other porsanest temptation which millions<br />\nThe fact that athletes are required to maintain a scholastic average as<br />\never -uccumbed to. And to these<br />\ntions of the turf. In the not very<br />\nwell as any other members of the University should be a source of<br />\nsame millions the pause that redistant future, we will no doubt<br />\npride rather than an object of criticism. There is no reason why an<br />\nfreshes has come to mean an icehave a desert for a campus instead<br />\nathlete should not be able to do his work as thoroughly as anyone<br />\ncold Coca-Cola. Its tingling,<br />\nof green sward.<br />\nelse. In fact, one would imagine that the athlete who has developed<br />\ndelicious taste and cool after-sense<br />\no'V<br />\n.* * *<br />\nof refreshment have proved that<br />\na perfect physical being would be more likely to possess a sound mind<br />\ncapable of functioning quickly and accurately. The cases of athletes<br />\na little minute is long enough for<br />\nSpeaking of the Physics Builda big rest any time.<br />\nwho, at the same time are accomplished scholars, are, to be sure, not<br />\ning reminds me that the trustees<br />\ntoo .frequent; but, then, all that is expected in the way of scholastic<br />\nThe Coca-Cola Co., Atlanta, Ca.<br />\nwill shortly christen the new struc-7_<br />\nattainments from an athlete is that he shall meet the average standard<br />\n1%1 I I:LION<br />\nset by the entire student body. This, certainly, is no unreasonable<br />\nture. No more worthy name could<br />\nrequest and any man who fails to meet the requirements deserves no<br />\nA DAY<br />\nbe selected than that of the first<br />\nsympathy. The more rigidly such rules are enforced by the University<br />\nYOU CAN'T BEAT THE<br />\ngreat Hopkins physicist, Rowland.<br />\nPAUSE THAT REFRESHES<br />\nthe more respect we will command from others and the less likely we<br />\nTo perpetuate his name in a<br />\nCD-3<br />\nwill be to find our name blazoned across the newspaper pages amid<br />\nIT<br />\nHAD<br />\nTO<br />\nBE<br />\n000 D<br />\nGET<br />\nTO<br />\nWHERE<br />\nIT<br />\nIs<br />\nRowland Hall would be far less than<br />\nsuch company as Western Maryland and some seventy-eight others.<br /><br />\nEDITORIALS<br /><br />\nMSC<br /><br />\nI<br /><br />\nhatter house<br />\n- - - of Baltimore<br /><br />\n/fie<br /><br />\nflub<br /><br />\nTALIAJE AtNI<br />\n/<br />\nKEERTITI<br />\n(1<br />\n74)<br />\n)<br /><br />\nI111F,<br /><br />\nTHE•JOHNS HOPKINS NEWS-LETTER, OCTOBER, 29, 1929<br /><br />\nCOACH CRITICI7ES<br />\nFOOTBALL INVESTIGATION<br />\nCarnegie Inquiry Covers Too<br />\nFew Colleges, Is Claim<br />\nSTATEMENT MADE FRIDAY<br />\nAthletic Scholarships Are<br />\nAdvertised By Some<br />\n(Continued from page 1 column 5)<br /><br />\nof certain promising students<br />\nthrough preparatory school and college. He asserted that a full realization of sport was possible only on a<br />\n\"free admission to games basis,\" as<br />\nin former years. However, he added<br />\nthat this was impractical under the<br />\nesent pecuniary system.<br />\n• Dr. Knight Dunlap, in a phamphlet on \"College Athletics,\" declared that the entire athletic system need reorganization. Professors<br />\nof many colleges, it was indicated,<br />\nwere completely cowed by athletic<br />\nassociations and the fear of empty<br />\nlecture room benches.<br />\nUnder the present mode of athletics, he said, those persons who<br />\nueeded physical training the most<br />\nwere neglected, while those who<br />\nwere naturally endowed with physical prowess were over-trained.<br /><br />\nDORM DOINGS<br />\nFood, that absolute necessity<br />\nwhich is such a vital part of our<br />\npresent civilization and nourishment<br />\nfor our bodies as well as our minds<br />\nto some extent, is to be found within restricted limits beneath the roof<br />\nof the Alumni Dormitory, but how!<br />\nThree times a day the helpless inmates are furnished with wholesome meals as is the word applied<br />\nin the lease; but for a more accurate<br />\ndescription of various synonyms for<br />\nthe word \"meal,\" which can not be<br /><br />\n$50.00 Weekly<br />\nEasily made. No exaggeration.<br />\nMany making more in spare time,<br />\nselling our attractive $1.00 box<br />\nassortment, containing 21 beautiful Christmas greeting cards.<br />\nEnormous sales. 1005, profit.<br /><br />\nBrosmille Pub., 1451 Broadway, New York<br /><br />\nBacon's Drug Store<br />\nAgents for<br /><br />\nSt. Paul and 31st Streets<br />\nSPECIALIZES<br /><br />\nANTON HORVAT<br />\nJeweler<br /><br />\nIn Accommodating Hopkins<br />\nStudents<br /><br />\nYou will find a large collection of<br />\nunusual semi-precious stone jewelry in our shops<br /><br />\nRIDE IN<br /><br />\nYELLOW<br />\nCABS<br /><br />\nGift Suggestions from $5 up<br />\nWe do jewelry and<br />\nwatch repairing<br /><br />\n338 N. CHARLES ST.<br />\n228 N. LIBERTY ST.<br /><br />\nSTAND AT HOMEWOOD<br />\nFIELD<br /><br />\nNO CHARGE FOR<br />\nEXTRA PASSENGERS<br />\n(2-3-4 or 5 MAY RIDE FOR<br />\nTHE PRICE OF ONE)<br />\nPHONE:<br /><br />\nVernon 1212<br /><br />\nhere reproduced for this is a university publication, all that one has<br />\nto do is but to be present when<br />\nfried tomatoes and a slice of bacon<br />\nare served at breakfast. For the enlightenment of any curious person,<br />\na list of the similar words employed<br />\nby the denizens will be furnished<br />\nat the NEWS-LETTER office while the<br />\nsubject is seated in a deep chair<br />\nwith an abundant quanity of spirits<br />\nof ammonia.<br /><br />\n3<br /><br />\nINTERCOLLEGIATE<br /><br />\nTHE M-M-T MOTOR CO.<br /><br />\n- - NEWS -<br /><br />\nDIRECT CHEVROLET DEALERS<br />\nHOmewood 3300-01—Night, HOmewood 6336<br /><br />\nA society of the University of<br />\nCalifornia recently held their annual Hi-Jinks, one of their major<br />\nparties of the year. The motif of<br />\nthe affair was taken from folklore, so that memories of favorite<br />\nchildhood characters were recalled<br />\nby those celebrating. In keeping<br />\nwith the theme, animal cookies and<br />\nother delicacies suggestive of childhood were served. Prizes were<br />\nawarded for the most original costumes and also for the best skits<br />\npresented by a sorority. About 25<br />\nsororities presented skits. Co-ed<br />\n\"cops\" were on hand to prevent inquisitive males from gaining entrance•<br />\n* * *<br /><br />\nSPECIAL!<br />\nThis week we have a few good low-priced Used<br />\nChevrolet and Ford Cars—Real Bargains—and<br />\nthe terms are so low you need pay only fifty cents<br />\nper day on some models. Communicate with<br /><br />\nMr. Richard H. Jandorf—P.0. Box 584<br />\nIs our HOPKINS representative<br />\nOpen Evenings<br /><br />\n25th Street and Greenmount Ave.<br />\nA certain resident rises some<br />\nrainy morning enclouded in a bit<br />\nof a fog and attends breakfast<br />\nCENTRAL Y. M. C. A. OFFERS HOPKINS MEN FULL PRIVILEGE<br />\nMEMBERSHIP TO JUNE 15 FOR $10.00<br />\nwhile wondering the day of the<br />\nweek, but when fish greets him at<br />\n_..:40110<br />\nthe table, he immediately remem.f.<br />\n\"semossos<br />\nbers that it must be Wednesday and<br />\n'<br />\nAn alarming situation has developed<br />\nat the University of Indiana.<br />\nthat he has an 8.30 to make. The<br />\n_ •'<br />\niil<br />\nsame process of deduction makes The number of male students has<br />\nsteadily<br />\nincreased,<br />\nand.,<br />\nunfortunatehim, or any other inmate, aware that<br />\nly, the opposite has been the case<br />\n..1<br />\n..<br />\nit is Thursday when he sights chipt t<br />\nwith the co-eds. While this is, no<br />\nped beef at breakfast. Friday is as- doubt, an advantageous<br />\nJ fl<br />\n—..<br />\nstate of af- ....._ certained by the presence of cakes fairs for the latter, the mere males<br />\n------,<br />\n_<br />\nand sausage in the morning, while report that it is becoming exceedingly<br />\nand<br />\nincreasingly<br />\ndifficult<br />\nto<br />\nget<br />\nscrambled eggs of the prehistoric era<br />\n_<br />\n,,<br />\nand uncertain origin designate Mon- dates. It is considered probable that<br />\n..,\"<br />\nI,<br />\nthey will be forced to resort to the<br />\nCall at Central \"Y\", Franklin and Cathedral Streets, or<br />\nday. However, toothpicks are furSee Secretary in Levering Hall<br />\nPurdue system of making \"Prom\"<br />\nnished in the latter case to assist in dates for<br />\nthe following year before<br />\nremoving the feathers from the leaving college the previous spring.<br />\nJ. H. FURST CO.<br />\n* * .*<br />\nteeth if the beast doesn't make his<br />\nBUY BOOKS<br />\nPRINTERS OF<br />\nThe Best Investment<br />\nSpeaking of Purdue, those of<br />\nescape before being devoured. But<br />\nFill your needs at<br />\nPhilological and Scientific<br />\nwith Sunday, the gloom disappears that institution who are historically<br />\nTHE SIGN OF THE MERMAID<br />\nPublications<br />\n918 North Charles Street<br />\nand all are happy for that is the day inclined are to present \"The Old<br />\nVernon 0053<br />\n23 S. HANOVER ST. BALTIMORE<br />\nof seeming great portions of chick- Soak,\" at their Playshop on Friday,<br />\nen (doubtlessly the eggs that took November 1.<br />\n* * *<br />\nadvantage of the kitchen heat)<br />\nOne thousand were present at the<br />\nwhich in reality are only chicken<br />\nNEW<br />\nUSED<br />\npate with an over-amount of dress- University of Vermont to hear Bering. Tuesday classes are indicated trand Russell, the noted English<br />\nby delicious fried apples and after- Philosopher, speak on the causes<br />\nnoon labs are attended because of of war. The various political, sothe presence of \"skinless franks\" cial, and industrial reasons for<br />\nand beans imported from the dis- strife were enumerated. Mr. Russell also stated that in the near futant shores of Boston.<br />\nAnd so the students of the Dormi- ture, the world would have only one<br />\ntory regulate their classes and keep civilization, as nations all over the<br />\ntheir dates straight by the diet to globe are rapidly becoming AmeriTHE BACKUS MOTOR COMPANY<br />\nwhich they are exposed thrice daily, canized.<br />\n*<br />\nif they chance to survive. Various<br />\n1 0-20 E. North Avenue<br />\nVermont's chapter of the Scabmembers escape on Wednesday by<br />\nbeing blessed with fraternity din- bard and Blade is planning to have<br />\nVernon 4300<br />\nners while the less fortunate indi- a military ball, one of the greatest<br />\nviduals attend track perhaps to find social events of the year at the<br />\nsome means of escape as well. Why, northern institution of learning, on<br />\nif anything should ever chance to November 11.<br />\n* **<br />\ngo wrong with the schedule of<br />\nInitiation of the yearlings ai<br />\nmeals, approximately 150 students<br />\nVillanova,<br />\nPa., was performed bewould miss classes and appointments<br />\nfore<br />\nthe<br />\namused<br />\neyes of a gaping<br />\nas long as the error continued.<br />\nmultitude.<br />\n.The<br />\nfestivities<br />\ncontinued<br />\nDoubtless, numerous week-ends<br />\nCLOTHES<br />\nfrom<br />\n7<br />\nin<br />\nthe<br />\nevening<br />\nuntil<br />\nmidwould be forgotten and a general<br />\n211-213 E. Baltimore<br />\nchaotic state would ensue from the night. The men 'of '33 appeared on<br />\noversight on the part of the chef. the scene attired in vari-coloreld paA special selection of<br />\nPerhaps this is a partial explanation jamas. Upon being blindfolded, they<br />\nof the pale and haggard appearance were given a solemn admonition tc<br />\nWoolens---Suits to Ord<br />\nof the inmates, and not late hours abandon all hope of mercy.<br />\nThe<br />\nfirst<br />\nordeal was the. applicaand over-study the entire cause of<br />\ntion of feathers and molasses on<br />\ntheir condition.<br />\nthe manly bosoms of the Frosh.<br />\nThe hands of the unfortunate newcomers were then washed with<br />\nFROSH DEBATE<br />\nsome<br />\nmysterious variety of a well(Continued from page 1 column 3)<br />\nnigh indelible green chemical. Relings with City. College and Forest freshments<br />\nwere then served, the<br />\nPark.<br />\nsophomores generously seeing that<br />\nTryouts for the Sophmore De- all of their guests<br />\npartook of the<br />\nbating Team will be held Thursday pills lavished upon them.<br />\nThe yearat 6 p. m. in Room 301, Remsen lings next had their<br />\ncountenance<br />\nHall. All members of the Sopho- decorated with paint<br />\nin order to<br />\nmore class who wish to try out for beautify them for<br />\nthe climax of the<br />\na place on the team are requested evening, the \"triumphal\"<br />\nmarch to<br />\nto report Thursday evening so that Bryn Mawr.<br />\nMr. Wheeler may choose the team<br />\n***<br />\nby impartial judging.<br />\nExtra! Extra! Studying declared<br />\nby statesmen to be of secondary importance in the collegiate routine!<br />\nAVUKAH PROGRAM<br />\nPremier McDonald warned the stu(Continued from page 1 column 4)<br />\ndents in a thrilling lecture at McGill<br />\ning organized. These will deal with University to be sure not to overvarious phases of Jewish interest, study. For studying crowds out the<br />\nsuch as Jewish history, Jewish prob- faculty of imagination! The Prelems, and Zionism.<br />\nmier advised students never to forThe annual smoker will take get to allow themselves to dream;<br />\nNationally<br />\nf\" - ie.:<br />\nJustly<br />\n6<br />\n.<br />\nplace Sunday evening, November for, after all, no great mental feat<br />\nFamous<br />\n3, at the Emerson Hotel. Judge is ever performed without imaginaKnown'<br />\nEli Frank, of the Supreme Court tion furnishing the inspiration and<br />\nBench of Baltimore has been in- playing the major role in the mental<br />\nMADE FOR YOU<br />\nvited to speak. Rabbi Mitchel S. process.<br />\nFisher, of New York, who was an<br />\nThe main feature of the program<br />\nAmerican representative at Oxford was the convocation of the degree<br />\nFOUR NORTH HOWARD STREET<br />\nat the International Debates, will of Doctor of Laws upon the distinguished Scottish.statesman.<br />\nalso be present.<br /><br />\nFORD<br /><br />\nAutomobiles<br />\nc-N....,<br /><br />\nOpen 8 P. M. Until Closing<br /><br />\nOASIS CABARET<br />\nGIRLS—GIRLS—GIRLS<br />\n\"Something Different\"<br /><br />\nBIG REVIEW<br />\nEast Baltimore and Frederick Sts.<br />\nTelephone: Calvert 6189<br /><br />\nTobacco's<br />\nat its best ...in<br />\na pipe<br /><br />\nSULSKY<br />\nSNAPPY<br /><br />\nM<br /><br />\nEN'S preference for a man's<br />\nsmoke—the pipe—is plenty<br />\npositive. But do you know why?<br />\nWe'll tell you.<br />\nFirst, pipe tobacco's different—<br />\nfor instance, Edgeworth. Second,<br />\ntobacco smolders as it should in a<br />\nPipe. And third, these mean you get<br />\nmore satisfaction—greater relish of<br />\nthe good old savory burley, soothing<br />\nfullness of rich smoke.<br />\nThere's even a fourth reason: you<br />\nlike good company. The pipe-smoking brotherhood is that.<br />\nTobacco's at its best in a pipe. It<br />\ngets a chance to be itself there—to<br />\nloosen up as it comes to life, to expand and take in air and glow. Only<br />\nthe choicest leaves get that chance,<br />\nmoreover, for pipes tell the truth<br />\nabout tobacco. Choice leaves, choice<br />\nblends, and mighty careful handling. Edgeworth comes up through<br />\neleven distinct processes before we're<br />\nWilling to pass it on to you.<br />\nIf you keep on missing all this,<br />\nthat's your fault—for we're waiting<br />\nto send you your first pipefuls of<br />\nEdgeworth. See the coupon? Fill it<br />\nout, get a good pipe and the postman<br />\nwill bring you a neat little glad-tomeet-you packet of good old Edgeworth.<br />\nEdgeworth is a careful blend of good<br />\ntobaccos—selected especially for pipesmoking. Its quality and flavor never<br />\nchange. Buy it anywhere—\"Ready<br />\nRubbed\"and \"Plug Slice\"— 150 pocket<br />\npackage to pound humidor tin.<br /><br />\nEDGEWORTH<br />\nLARUS &amp; BRO. CO.,<br />\nRichraond, Va.<br />\nI'll try your Edgeworth. And I'll try<br />\nit in a good pipe.<br />\nName<br />\nStreet<br />\nTown and State<br />\nNow let the Edgeworth come! v<br /><br />\nTUXEDOS<br />\nTO<br /><br />\nRENT<br />\nVernon 3436<br />\n313 W. FRANKLIN STREET<br /><br />\nBosley's<br />\nPHARMACEUTICAL<br />\nSUPPLIES<br />\nFor J. H. U. Men<br />\nCHARLES AT<br />\nTWENTY-FIFTH<br /><br />\n$40<br /><br />\n.<br /><br />\n_<br /><br />\nSTETSON CLOTHES<br />\nfor<br /><br />\nTHE NEW<br /><br />\nlutist<br />\nTHOM<br />\n— Green<br /><br />\nIN COLOR<br /><br />\nAT<br />\nNO<br />\nEXTRA<br />\nCOST!<br /><br />\n.<br /><br />\nCollege QMen<br />\n-z-,.<br /><br />\nk5 '<br /><br />\no<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER, 29, 1929<br /><br />\nFEW REPORT FOR<br />\nFALL LACROSSE<br /><br />\nZU G<br />\n$8.50<br /><br />\nAll Lacrosse Men Must Attend<br />\nFall Practice Van Orman<br /><br />\nBrown Zug-Grain<br />\nMORRILL TO COACH<br /><br />\nA sturdy new shoe for young men with a generous measure<br />\nof style ... and priced to fit a Scotchman's purse.<br /><br />\nNine Letter Men Give Promise<br />\nOf Successful Season<br /><br />\nWYMAN<br /><br />\n111 E. Baltimore<br /><br />\nOnly fifteen men showed up for<br />\nthe first day of fall lacrosse practice<br />\nlast Thursday. This was an unusually poor showing in view of the<br />\nfact that so many members of last<br />\nyear's stick squad are still in the<br />\nUniversity. Such poor attendance,<br />\nhowever, was attributed more to the<br />\nbad weather and late posting of<br />\nnotices rather than any laxity on<br />\nthe part of the Jay stickwielders.<br /><br />\n19 E. Lexington<br /><br />\nFLY WITH CURTISS<br />\nMECHANICS, PILOTS and BUSINESS COURSES<br />\nWrite for interesting booklet or call at office<br /><br />\n1215 N. CHARLES STREET<br /><br />\nVernon 4792<br /><br />\nInter-Collegiate Lacrosse Association has grown until today it has<br />\ncolleges from every part of the<br />\ncountry east of the Mississippi<br />\nseeking admission into the Association.<br />\nHopkins was one of the pioneers<br />\nplaying and fostering the great Indian game. Always a leader, famous<br />\nBlue Jay stickwielders went to<br />\nmany colleges all over the East organizing and coaching lacrosse. Two<br />\nyears ago Hopkins stickmen were<br />\nthe first team to ever carry American colors to the Olympics. It is<br />\nup to the lacrosse players entering<br />\nHopkins today to keep this inspiring<br />\nrecord unchanged.<br /><br />\nIMPMOBILE<br />\nSIXES<br />\nECONOMY. Why be constantly spending on a low-price six when you can buy a 70-horsepower 1930 Hupmobile Six, fully equipped, for $1,195, delivered in Baltimore.<br /><br />\nEIGHTS<br />\nWhy pay around $1,500 for the so-called big six when you can buy a 100-horsepower<br />\nHupmobile Eight, fully equipped, for $1,750, delivered in Baltimore.<br />\nSEE—RIDE—DRIVE THEM—GET A REAL THRILL<br /><br />\nUSED CARS<br />\nAs fine a selection of reconditioned cars you will find anywhere. Many makes and many<br />\nstyles. Open and closed. Prices range from $35 to $600. Just the car for the college<br /><br />\nW. Kelso Morrill, for four years<br />\n.a member of championship Hopkins<br />\nlacrosse teams, will have charge of<br />\nfall practice this year. Practice will<br />\nbe held three days a week, Tuesday,<br />\nWednesday and Thursday, at \"The<br />\nWall\" on Homewood field. Equipment will be issued all lacrosse men<br />\nas soon as they have passed their<br />\nphysical examinations.<br /><br />\nHOniewood 8040-8041<br />\nYour clothes will always have that neat appearance if you will let us do your<br />\nCLEANING, DYEING, PRESSING AND REPAIRING<br />\n\"One Trial Will Convince You\"<br /><br />\nPARISIAN TAILORING CO.<br />\nCorner University Parkway<br /><br />\n346 E. 33rd Street<br /><br />\nSIMON ACKERMAN CLOTHES<br />\nReady To Wear<br /><br />\nA.JACOBS &amp; SONS<br />\nUNIFORMS AND OUTFITS<br />\n128 W. Fayette Street<br /><br />\nTwo Showrooms<br />\nMt. Royal Avenue At McMechen Street<br />\nPhone: Madison 5355<br /><br />\nLiberty Heights Avenue At Garrison Avenue<br />\nPhone: Liberty 7038<br /><br />\nWERGLEY'S<br />\nCharles St., North<br />\nLa Patisserie<br />\nSANDWICHES PAR EXCELLENCE<br />\n2438<br /><br />\nCA.<br /><br />\nthought of Today--<br /><br />\nThe season's styles in neckwear are the key to a man's dress<br />\ngive that touch of personal effectiveness.<br /><br />\nBOOKS<br />\nBought—Sold—Exchanged<br />\nPIPPEN'S BOOK STORE<br />\nBooks on Nearly All Subjects<br />\n605 North Eutaw Street<br /><br />\nFall Training!<br />\n\"It is essential that every lacrosse<br />\nman not playing football report for<br />\nfall practice,\" Coach Ray Van Orman declared. \"Foundations for<br />\nHopkins championship ;lacrosse<br />\nteams have been built in the fall.<br />\nThe finishing touches are put on in<br />\nthe spring,\" the veteran Jay coach<br />\nstated yesterday. \"The Hopkins<br />\nstyle of lacrosse is totally different<br />\nfrom any prep school methods and<br />\nit is as important for the prep school<br />\nmen to learn this as it is for Hopkins men to keep improving their<br />\nstickwork, and knowledge of the<br />\ngame.\"<br /><br />\nFor A Tasty Bite—Anytime<br /><br />\nSandwich Shops<br />\n\"A Meal a Minute\"<br />\n208 EAST BALTIMORE STREET<br />\n(Open till 3 .4. id.)<br /><br />\nA. H. FETTING<br />\nMANUFACTURING JEWELRY CO.<br />\nManufacturers<br /><br />\nGreek Letter Fraternity Jewelry<br /><br />\nMorrill Clever<br /><br />\n314 NORTH CHARLES STREET<br /><br />\nCoach Morrill is an experienced<br />\nand skillful stick mentor. Green lacrosse candidates are particularly<br />\nfortunate to have the privilege of<br />\nlearning the game from one who is<br />\nnot only able, but willing, to take infinite pains with beginners. Experienced stickwielders can improve<br />\ntheir technique in addition to learning the fine points of the game.<br />\nProspects for next spring are<br />\nparticularly bright. In addition to<br />\nhaving nine letter men back, a number of promising freshmen will wear<br />\nthe blue uniform this spring. Although there will be a number of<br />\nexperienced men competing for<br />\nnearly every position, nothing is<br />\never decided until every man has<br />\nbeen given ample time to prove his<br />\nmettle at his chosen position. Many<br />\ngreen frshmen have put experienced<br />\nseniors on the bench.<br /><br />\nHUGO WEISBERGER<br /><br />\nPhone: Vernon 6196<br /><br />\nPEABODY BOOK SHOP<br />\n913 N. CHARLES STREET, BALTIMORE, MD.<br /><br />\nOpen Evenings<br />\nBOOKS, OLD and NEW<br />\nHarris, Frank: Montes the Matador ($2.50)<br />\n$1.00.<br />\nHarris, Frank: Unpathed Waters $2.50)<br />\n$1.00.<br />\nHarris, Frank: Nlan Shakespeare ($2.50)<br />\n$1.50.<br />\nHarris, Frank: Women of Shakespeare<br />\n($2.50) $1.50<br /><br />\nHuxley, Aldous: Essays—New and Old<br />\n($2:50) $1.00.<br />\nHuxley, Aldous: On the Margin ($2.00)<br />\n$1.00.<br />\nHuxley, Aldous: Young Archimedes ($2.00)<br />\n$1.00 .<br />\nWashington<br />\nMarshall, John: Life of<br />\n($24.50) $7.50.<br /><br />\n\"Friend of the Hopkins Man\"<br /><br />\nUnion Trust Company of Maryland<br />\nCHARLES AND FAYETTE STREETS<br /><br />\nNine Letter Men<br /><br />\n\"On the Route of the Charles Street Bus\"<br /><br />\n7<br />\n,<br /><br />\nAfter the Dance<br />\nliS<br />\n8 5-17 North Charles Street<br />\nIF YOU \"MAJOR\" IN<br />\nTRANSPORTATION—<br />\nOne thing quickly becomes clear to students of transportation<br />\nproblems.<br />\nIt is the fact that in large cities the electric car lines with<br />\ntheir auxiliary coach and bus routes form the backbone of<br />\ntransportation.<br />\nIn this permanent and necessary public utility the problems<br />\nand principles involved are worth the notice and study of<br />\nevery young man interested in public service.<br />\nTHE UNITED RAILWAYS AND ELECTRIC CO.<br />\nof Baltimore<br /><br />\nCorner Brownley and Joe Ferrorini will vie for the position of net<br />\nguardians again this year. Both<br />\nshowed unusual skill last year. Although \"Big Bill\" Kegan graduated,<br />\nJoe Bernard, equally portentious,<br />\nwill probably make it tough for any<br />\ninvaders who get too near the<br />\ncrease. Purnell Hall and Frank<br />\nCone, also letter men, are both out<br />\nto complete the close defense.<br />\nThe wing defense ought not to lack<br />\nability either. There's Bill Nickel,<br />\nDick Keating, Hurney Houston, and<br />\nAddison Campbell to put plenty of<br />\nstrength in the wings—and Jack<br />\nTurnbull, youthful star of Mt.<br />\nWashington and Poly, bids fair to<br />\nmore than uphold the great Turnbull tradition at Hopkins.<br />\nThe attack should also have potent, strong, flying wings. Bobby<br />\nLyons, Lorney Guild and Max<br />\nSauerwein should be back in harness, and Dukehart and Bim Love,<br />\ntough heads for the wings.<br />\nHopkins And Lacrosse<br /><br />\nDuring the past ten years lacrosse<br />\nhas increased in popularity more<br />\nthan any other sport in the country.<br />\nFrom a mere handful of members<br />\nin the Middle Atlantic States, the<br /><br />\nbody<br />\nman.<br /><br />\nJones Automobile Co., Inc.<br /><br />\nMorrill Coach<br /><br />\n,<br /><br />\n1930<br /><br />\nghe AMERICAN OIL &amp;COMPANY<br />\nTransport Company<br />\nAfithated .gth Pan American Petroleum<br /><br />\nGeneral Offices: Baltimore, Md.<br /><br />\n\"The Store of Standard Values\"<br /><br />\nMcPHERSON'S<br />\n11 East Baltimore Street<br /><br />\nthey<br /><br />"}], "field_media_file": [{"target_id": 38340, "display": null, "description": null, "target_type": "file", "target_uuid": "f64bcc20-62b0-4603-b327-3f6edc4473d4", "url": "http://digital.library.jhu.edu/system/files/2022-03/13389-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13389, "target_type": "node", "target_uuid": "c04f8429-eae3-4d9b-87ee-a29be406738d", "url": "/node/13389"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "b8d1970b-7131-4ab4-92de-f525d4d05e39"}]}