{"mid": [{"value": 35647}], "uuid": [{"value": "35622009-e1e1-4d4b-ac7d-36cd552c72aa"}], "vid": [{"value": 35647}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:10:29+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12190-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:10:29+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:10:29+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "iovember 20. 1901.<br />\n<br />\n\fJOHNS HOPKINS UNIVERSITY.<br />\n<br />\nThe Johns Hopkins Press.<br />\n<br />\nBALTIMORE. MD<br />\n<br />\nBeginning October 1st, 1901.<br />\n<br />\nPresident,<br />\n.<br />\n.<br />\n.<br />\nDean of the Medical School,<br />\nDean of the College,<br />\n.<br />\n.<br />\n<br />\nIRA BENTSEN.<br />\nWM. H. HOWELL<br />\nEDW. H. GRIFFIN.<br />\n<br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the de<br />\ngree of M. D.;courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLibraries of Baltimore.<br />\n100,000 volumes.<br />\n136,000 volumes.<br />\n200.000 volumes.<br />\n<br />\nUniversity<br />\n•...<br />\nPeabody Institute<br />\nPratt Library<br />\n<br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume XXIV<br />\nin progress. $6 per volume.<br />\nI. American Chemical Journal.<br />\nI. BEMSYIN, Editor. Monthly. 8vo. Volume X XV1<br />\nin progress. $5 per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GI LDERSLEEVE,, Editor. Quarterly. 8vo.<br />\nVolume XXII in progress. $3 per volume.<br />\nIV. Studies from the Biological Laboratory: live.<br />\nVolume V complete. $5 per volume.<br />\nV. Studios in Historical and Political Science.<br />\nMonthly. 8vo. Series XIX in progress. $3 per<br />\n'volume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XX in progress. $1 per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly. 4to.<br />\nVolume XII in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume X<br />\nin progress. $6 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Beitrage zur A sayriologie, etc.)<br />\nVol. TV in progress.<br />\nX. Memoirs from the Biologleal Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nXT. Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVI in progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. IvELcH, Editor. 111-monthly. 8vo. Volume<br />\nVT in progress. $5 per volume.<br />\nXII/. American Journal of Insanity.<br />\n11 EN RV M. HU D, Editor. Quarterly. 4to.,g5 per<br />\nvolume.<br />\nX IV. Reports of Maryland Geological Survey.<br />\nw LIJA M B. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\n8vo. Volume VI in progress. $2.50 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Trimtees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br />\nI.<br />\n<br />\ndoimimplONSIM11<br />\n<br />\nTwenty-Sixth Year.<br />\n<br />\nLaboratories,<br />\nChemistry,<br />\nPhysics,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharinacologY,_<br />\nPhysiological Uhemietry,<br />\nClinical Medicine,<br />\n<br />\nDirectors.<br />\nIra ReMSP11.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn .1. Abel.<br />\nJohn J. Abel.<br />\nWilliam Older.<br />\n<br />\nSeminaries.<br />\nGreek,<br />\n[AWL<br />\nSanskrit,<br />\nSaraitic.<br />\ntlernian,<br />\nRoraance,<br />\nBrattish,<br />\nHistory,<br />\nP1conornies,<br />\nIlia thematies,<br />\nPhysics,<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice, Bloomfield<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJ. M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames,<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\nI. Classical (the \"Old College Course.\")<br />\n2. MatItnmatical-Physical,<br />\n(leading up to Engineering.)<br />\n3. Ckttnioal-itiologica I.<br />\n(leading up to Medicine.)<br />\n4. Oeologissal-Iliological.<br />\n5. Latin Mathematical.<br />\na. Historical-Political.<br />\nAleadin(Up to Law.)<br />\n7. Modern Languages.<br />\nEditors.<br />\nSerial Publications.<br />\nFrank Morley.<br />\nMathematics(vol. XXIV.)<br />\nChemistry (vol. XXVI).<br />\nIra Hemmen.<br />\nBasil L. Gildersleeve.<br />\nPhilology (vol. XXII.)<br />\nJ. M. Vincent.<br />\nHistory vol. XI X.)<br />\nA. Marshall Elliott.<br />\nModern Languages(vol. XVI.)<br />\nWilliam K. Brooks.<br />\nBiology (vol. IV.)<br />\nPaul Haupt.<br />\nAss‘ riologv (vol. TV.)<br />\nExperimental Medicine(vol. VI.) W. If. Welch.<br />\n<br />\nIn addition to the serials above named, copies may he<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul 'Haupt. Prospectus on application.<br />\nRowland's Photograph of the Normal Solar Spectrum.<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 118 pp. 4to. 68 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fee-simile edition. Edited by J. Bendel Harris. 110 pp. 4to. 10<br />\nplates. $6.00<br />\nReproduction in Phototype of Syriac MS with Antilegom.na Epistles. Edited by I. IL Hall. $3.00.<br />\nBibliographia Hopkinsiensia. Part I. Philology. Parts<br />\nChemistry, Mineralogy and Geology. Parts<br />\nIV-V-VI.Physics, Astronomy and Mathematies.<br />\n8 vo. lll cents per part.<br />\nS full list of publications will be sent on application.<br />\n<br />\nProgrammes of the Courses offered to graduate students in Philosophy end the Arts, and in the School of<br />\nMedicine,and also of the Undergraduate or Collegiate<br />\nCourees, will be sent on application to the Registrar.<br />\n<br />\nCommunications In respect to exchanges and remittances<br />\nma u he sent to Johns floph ins Press, Baltimore, MA.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nV01. VI.<br />\n<br />\nNOVEMBER 20, 1901.<br />\n<br />\nNo, 4.<br />\n<br />\nTHOUGHTS FROM THE YALE BI-CENTENNIAL.<br />\nN the noble address made by Mr. Justice Brewer a few weeks ago at the Bicentennial of the Founding of Yale University, he said: \"It may fairly be<br />\n. claimed that Yale was the first educational institution in the world to make<br />\ntraining for service of the public the supreme object of her life and work.\" In<br />\ncomparison with other collegiate institutions the statement is doubtless true, and<br />\nit is a proud one<br />\nto have made for any University, but the idea of an institution<br />\nfor training young men up to service of the State was no new one in New Haven<br />\nColony. The Puritans felt the need of education as never had man before.<br />\nThey placed each man directly before his Maker, with no priestly class to which<br />\nIntercession could be made, and in the hands of the man was an infallible book,<br />\nthe 'only rule of faith and practice.\"<br />\nSo we find that education was early<br />\nsought by the New Englanders. At least, men must be able to read and understand the Scriptures. The chief aim of the Massachusetts men, which aim in<br />\nthe very words of the act was copied by the men of Connecticut, was to prevent<br />\nthat \"one chiefe project of that old deluder, Sathan, to keepe men from the<br />\nKnowledge of the Scriptures.\" That \"learning may not be buried in the grave<br />\nof our forefathers in Church and Commonwealth,\" schools<br />\nwere established,<br />\nand at Newtown, whose name was changed to Cambridge in memory of the<br />\nEnglish alma mater of so many of the clergy, a college was set up. At New<br />\nHaven, where the settlers were fully as strict as those of Massachusetts, and<br />\nmuch more so than the Connecticut men, we might have expected to find even<br />\nmore attention given to the religious need, and that the chief purpose of any<br />\ncollege or school there established would have been the training of ministers.<br />\nOn the contrary, we find that these colonists, under the leadership of Gov.<br />\nTheophilus Eaton and Rev. John Davenport, passed a vote within half a dozen<br />\nYears of the first settlement, and before the tree stumps could have removed from<br />\nthe earliest clearings; \"For the better training up of youth in this town that,<br />\nthrough God's blessing, they may be fitted for public service hereafter, either<br />\nIn church or common weale, it is ordered that a free school be set up.\" This<br />\nschool was called free, not because it was free from cost to its pupils, but<br />\nbecause in it there were taught those studies which tend to liberalize men's<br />\nminds, and free them from ignorance, and it was Davenport's desire that it should<br />\ndevelop into a college. When he removed to Boston some twenty years later,<br />\nhe made a grant to the trustees \"that<br />\nthe Grammar school or College at New<br />\nHaven, already founded and begun, may be provided for, maintained, and continued for the encouragetnent and bringing up of hopeful youths in the lan guages, and other good literature for the public use and service of the country.\"<br />\n<br />\n5<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nAdverse circumstances hindered the establishment of the college for nearly<br />\nsixty years from the time when the Town of New Haven expressed the fine<br />\nsentiment we have quoted above, and yet the thought was never lost. The<br />\ntradition of a college at New Haven lingered, and John Pierpont, Davenport's<br />\nson-in-law and successor in the pastorate of the church, was one of the ten<br />\nCongregational clergymen of Connecticut who met at the parsonage in Branford, and bringing a few volumes from their scanty libraries, gave \"these books<br />\nto found a college in this Colony.\" We are not surprised that the charter of<br />\nthe \"Collegiate School of Connecticut,\" as the first name was, should contain<br />\nthe provision that the institution was established that \"Youth may be instructed<br />\nin the Arts and Sciences, who, through the blessing of Almighty God, may be<br />\nfitted for public employment, both in church and civil State,\" We find the<br />\nsame note here and almost the same words as we hear in that early vote of the<br />\nTown Meeting. In this provision, we see a deep reverence for the Creator, that<br />\nconception of a disinterested life which well fitted the followers of Him who<br />\n\"pleased not himself,\" and a clear idea of that solidarity of mankind and the<br />\nsupreme need of the State to have the best energies of its ablest men which in<br />\nthese latter days are again calling our educated men into public service. Other<br />\ninstitutions might labor for the self culture of their students, but at Yale the<br />\ngraduates should learn from the very outset that \"no man liveth to himself.\"<br />\nDuring the two centuries which have passed since, the ideal has been nobly<br />\nheld before Yale men by a succession of consecrated, able, and zealous presidents and professors. Some have failed to live up to that conception, which<br />\nhas been the basis of the \"Yale spirit,\" but the student life early became<br />\nimbued with the feeling that one must work for others. \"Yale sand\" meant<br />\nnot so much courage shown for one's own advantage, but an undaunted purpose<br />\nto do one's utmost for the College. Nathan Hale's speech has the true ring.<br />\n\"I only regret that I have but one life to give for my country.\" William<br />\nWalter Phelps, refusing to resign arduous public office, though such refusal<br />\nmight have prolonged his life, was a more recent example of the devotion of<br />\nYale men to the service of others. Not alone in the United States and not alone<br />\nin direct public service has this spirit been shown and this purpose been carried<br />\nout. Missionaries in every foreign clime, and professional and business men<br />\neverywhere have displayed that same devotion to public employment.<br />\nLast month, over half the living graduates of Yale assembled on the<br />\nUniversity campus and participated in the finest academic celebration ever<br />\ngiven in any land. It would have been difficult to have matched that Commemoration Day, but the great numbers and the enthusiasm of the alumni,<br />\ntheir devotion to the University, and the seriousness of their purpose were<br />\nunparallelled. From the sermon in the Battell Chapel on Sunday morning to<br />\nthe farewell reception to President Roosevelt on Wednesday evening, a succession of eloquent addresses, of gorgeous processions by night and day, of<br />\nvaried athletic events, and of fine musical concerts presented a diversified programme filling nearly every moment of the time.<br />\nMost impressive of all to many of those who returned, was the great<br />\nassemblage of the alumni, some six thousand in number, in an amphitheatre on<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n3<br />\n<br />\nthe campus on Tuesday evening. For over four hours they sang<br />\ncollege songs<br />\nand saw tableaux of scenes in the past history of Yale, until, with the<br />\nglare of<br />\nrockets and singing of the doxology, they dispersed at midnight. To those of<br />\nus from Baltimore, it was pleasant to find that three<br />\nof the Johns Hopkins<br />\nFaculty: President Rernsen, and Professors Gildersleeve and Osier received<br />\nhonorary degrees and that of the six orations, two were delivered by President<br />\nGilman and. Dr. Welch. It is worthy of note that the Yale influence came to<br />\nBaltimore at the very outset of our University's history; for the two men, we<br />\nhave just named were, respectively, the first President of the University and the<br />\nfirst dean of the Medical<br />\nSchool. President Northrop of the University of<br />\nMinnesota, in his address on Yale's influence on the development of the country, paid a most eloquent tribute to President Gilman's educational<br />\ncareer,<br />\nreferring to him as the originator of the modern system of graduate instruction<br />\nin the United States, and the man who had received<br />\nmore doctorates than any<br />\nother Yale graduate. In fact, the influence of Yale on the education of the<br />\ncountry has been extremely great, and, through graduates who have served as<br />\nPresidents and professors in other institutions, the Yale ideas have been carried<br />\nall over the land. More truly than Virginia, Yale has been a \"Mother of<br />\nPresidents,\" for more colleges have had the leadership of Yale men than of the<br />\ngraduates of any other University, and nearly every prominent University was<br />\norganized by a graduate of Yale. Thus the idea of Davenport has been spread<br />\nover the land and to many a man in many a college has come the purpose to<br />\ndevote his best energies to the \"public use and service of the country.\"<br />\n<br />\nBERNARD C. STEINER.<br />\nDR. JACOB H. HOLLANDER COMMENDED.<br />\n<br />\nZ<br />\n<br />\nHE high estimation at which the Johns Hopkins University and its Faculty<br />\nare held by our country at large is constantly being brought into evidence. This time it is a member of the Faculty, Dr. Jacob H. Hollander,<br />\nWhose services to the Government were of such value that the Secretary of War<br />\nlast week sent the following letter to President Remsen:<br />\n\"In February, 1900, when the Government of Porto Rico was in need of the best<br />\n<br />\nexpert aid attainable for a revision of its system of taxation, I applied to your University<br />\nto permit your associate professor of finance, Dr. J. H. Hollander,<br />\nto lay aside his customary. duties and come to our assistance. I now wish to acknowledge to the University the<br />\nObligation which the Government of the United States is under for the services rendered<br />\nby Dr. Hollander. While his work as special commissioner<br />\nwas still unfinished the<br />\nmilitary government of the island was superseded by civil government under the act of<br />\nCongress, and his performance of his duties had been so satisfactory that he was appointed<br />\ntreasurer of the island by the President. He performed the duties of that office with<br />\nfidelity, while bringing to a successful conclusion the work of framing a comprehensive<br />\nand adequate system of taxation, which was subsequently adopted by the Legislature, and<br />\n15 now in successful operation. Dr. Hollander returns to the performance of his duties in<br />\nthe University with the good wishes, and the grateful appreciation of all the officers who<br />\nhave been engaged in the difficult duty of reorganizing the Government of Porto Rico.<br />\nELIH1J ROOT,<br />\nSecretary of War.\"<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nIn this connection it might be well to remark, that whenever there is any<br />\nimportant Government office to be filled, or any scientific phenomena to be<br />\nstudied, the United States has usually looked to the Johns Hopkins University<br />\nfor support. The successor to Dr. Hollander has already been chosen, and<br />\nonce more the important office of Treasurer of Porto Rico is to be filled by the<br />\nJohns Hopkins. Dr. William F. Willoughby, a former graduate student of<br />\nthe University, will succeed Professor Hollander.<br />\n<br />\nJOHNS HOPKINS MUSICAL CLUBS.<br />\nHE Johns Hopkins Musical Club assembled last week to have the annual<br />\npicture taken. This was done earlier this year than formerly on account<br />\nof the new scheme for poster advertising. Arrangements have been completed whereby a half tone cut, 8x11 inches, will be printed in the middle of<br />\nthe concert posters. It is expected that this will greatly aid in advertising the<br />\nclubs, both in their home concert and on the trips.<br />\nSo far the following concerts have been scheduled: Johns Hopkins Hospital, November 29; Roland Park, December 6; Hannah More, December 13;<br />\nCatonsville, December 20, and Christmas Trip, which will probably include<br />\nCharleston, W. Va., December 26; Winchester, Va., December 27; Martinsburg,<br />\nVa., afternoon of December 27, and Hagerstown, Md., December 28. The<br />\ndates for the Annapolis, Baltimore, Bryan Mawr, Washington and Wilmington<br />\nconcerts have still to be arranged. The Easter trip will be to Old Point Comfort, where the men will lodge in the Hygeia Hotel and dine in the Chamberlin.<br />\nThis is an improvement over former years, for never before was the excellent<br />\ncuisine of the Chamberlin enjoyed for the entire time. It is expected that the<br />\nclubs will leave Fortress Monroe Monday, March 30 and go to Richmond, but<br />\nthis has not been definitely determined upon.<br />\nIn regard to the clubs themselves little can be said as yet, except that there<br />\nare a large number of candidates. The mandolin club still needs a cornet,<br />\n'cello and flute, so if any one in the University is adept or otherwise on any of<br />\nthese instruments there is a vacancy yearning to be filled.<br />\nThe Glee Clubs will be selected from the following men: First tenors,<br />\nMessrs. Eyster, Carver, Humrichouse, Kumane and Cowles; second tenors,<br />\nMessrs. Nelson, Wright, Youtz, Beasley, Hale, Stubbs, Houghton; first basses,<br />\nMessrs. King, Meyers, Eager (leader); Snowden, Thomas, Hill and Ford;<br />\nsecond basses, Messrs. Sayler, P. K. Gilman, Marshall, Branch, Moss and<br />\nLicking. The Banjo Club will be composed of Messrs. Marshall, (leader);<br />\nSnowden, Bryan, Baetjer, Lanier, Hendry, Maynard, Mason, Smith and Murkland, banjeaurines, and Messrs. Converse, Cook, Murphy, Hazelhurst, Hill and<br />\nMartin. The men on the Mandolin Club are Messrs. Snowden, (leader);<br />\nBryan, Pearre, England, Moulton, Hall,Dochez, Glocker and Cross, mandolins;<br />\nMessrs. Converserse, Murphy, Hazelhurst, Martin, Hill, Smith, and Cook,<br />\nguitars, and Messrs. Lanier and Nelson, violins.<br />\n<br />\nt<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n5<br />\n<br />\nOUR NEW SONG<br />\n<br />\nt<br />\n<br />\nHE new song which was used for the first time last Saturday in the Western<br />\nMaryland game, appears to have struck much favor with the ''rooters.''<br />\nThe words are by Mr. Walter B. Carver, to the music of \"Michael Roy.\"<br />\nOur Alma Mater in Dixie Land.<br />\nCome stand together we'll raise a cheer, and wave the black and blue;<br />\nWe pledge our faith as loyal sons, to Hopkins we'll be true.<br />\nWe love our college in Dixie Land, our University,<br />\nWe shout her praise as we march along, so one, two, three!<br />\nCHORUS:<br />\nHurrah! Hurray!<br />\nA rousing Hullabaloo! rah!<br />\nOur Alma Mater in Dixio Laud,<br />\nHurrah for black and blue!<br />\nThe Hopkins men on the foot-boll field have won a great renown;<br />\nThey buck the centre, and run the ends, and pull their opponents down.<br />\nAnd if their bodies are black and blue, they're loyal don't you see,<br />\nThey bear their colors where 'or they go, so one, two, three!<br />\nHurrah! Hurray! Etc.<br />\nWe play lacrosse and we shoot for goal, we shoot and not in vain;<br />\nThe score goes up as our foes go down; we win again and again.<br />\nOur boys are out for the championship, as ev'ry one may see;<br />\nWe cheer the fellows that play lacrosse, so one, two, three!<br />\nHurrah! Hurray! Etc.<br />\n<br />\nUNIVERSITY LECTURES.<br />\n<br />\nt<br />\n<br />\nHE series of six lectures on public speaking, which were concluded last<br />\nMonday night by Mr. S. A. King, of the University of London, proved<br />\nto be a decided success. Mr. King laid particular stress on the technique<br />\nof the art, and his manner of procedure plainly attested his thorough knowledge<br />\nof the subject. A large class of graduate students derived no little benefit from<br />\nthe course. In order to demonstrate the artistic side of his theory, Mr. King<br />\ngave a recital of selections from the plays of Shakespeare, and the large audience left thoroughly convinced that he knows what he is doing.<br />\n<br />\nThe course of lectures which were recently started by Dr. Frederick Lykes<br />\non the general topic, \"Literature of the Victorian Era,\" are progressing finely.<br />\nA large number of local teachers are following the work prescribed.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n6<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nNOVEMBER 20, 1901.<br />\nSubscription $1 50 per year.<br />\n.<br />\n.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\n<br />\n10 Cents a single copy.<br />\nWILLIAM B. HILL, 1902.<br />\n. SOL STROUSE, 1902.<br />\nEBEN C. HILL, 1902.<br />\n.<br />\nROBERT S. LANIER, 1903.<br />\nW. S. BIRD, 1903.<br />\nJOHN A. SLEMONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1903.<br />\n•<br />\n<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\nAddress all articles, communications, etc., to WILLIAM B. HILL, box 239, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\nHE appointment of Dr. William F. Willoughby to succeed Dr. J. H. Hollander as treasurer of Porto Rico, gives evidence of the high opinion held<br />\nof Hopkins by the governmental authorities at Washington. Not only<br />\nwas the chief financial position in the island twice filled by Hopkins men, but<br />\neven two of the important secondary places were administered by our graduates. Three of our professors were honored at the Yale Bi-Centennial Celebration, and almost every week some newspaper notice attests to the great esteem<br />\nfelt for the Hopkins by the general educational world.<br />\nWhy is it that Baltimore responds so conservatively, so slowly to the calls<br />\nof the University; why is it that this city seems to appreciate to such a<br />\nsmall degree the immense benefits the presence of a great educational<br />\ncenter brings a city? Is it because the magnitude of the University's work is<br />\nso extensive that it overtowers the city, and consequently causes an unbalanced<br />\nperspective? At least, the fact remains that the Baltimore public does not seem<br />\nto be able, or does not want to be able, to grasp the full value of our University which a comparative study at a distance never fails to demonstrate.<br />\nWhereas Hopkins is honored by having inside its walls men from all parts of<br />\nthe globe who have come to study in the University, whose fame extends everywhere, our own State does not even think us worthy of enough assistance to<br />\nhelp keep up the reputation so gloriously won. It is said that the million<br />\ndollars required before possession of the Homewood Estate is given the University authorities has almost been raised. \"Almost,\" but after nine months<br />\nanxious waiting, it seems rather dispiriting not to be able to say \"completely\"<br />\nraised. Baltimore and Maryland are certainly living up to their reputation for<br />\n<br />\nt<br />\n<br />\nconservatism.<br />\n<br />\n\fTHE NEWS—LETTER. -<br />\n<br />\n'7<br />\n<br />\nT IS encouraging to note the increased enthusiasm among the undergraduate<br />\nbody, and especially among the freshmen class. This enthusiasm is<br />\nmanifesting itself in the \"rooting,\" for, at last, the \"Hopkins lads\" seem<br />\nto be awakening to a sense of their duty, and are making a \"joyful noise.\" Even<br />\nif we have not an undergraduate department consisting of a thousand or so men,<br />\nit is perfectly possible for the men we have to organize and do some very effective \"rooting<br />\n.\" and we rejoice to see that such is being done. On our Haverford<br />\nand on our Wilmington trip our band of \"rooters\" was very small, indeed, but<br />\nwhat was lacking in numbers was made up by enthusiasm, and the handful of<br />\nmen made as much noise as fifty.<br />\nWe still have St. Johns and University of Maryland to play; \"rooters,\"<br />\ncome out in a body, and \"root\" your very hardest.<br />\nIf every man would buy a small megaphone, at a trifling cost, the effect<br />\nproduced at these two games would be prodigious. Every one present would<br />\nknow that Hopkins was out for business then, and the rooting would be most<br />\nencouraging.<br />\n<br />\n3<br />\n<br />\nAMONG THE COLLEGES.<br />\n<br />\nZ<br />\n<br />\nHE Minstrel Club of Lehigh will probably give a performance in<br />\nWashington on Thanksgiving Day.<br />\n<br />\nShakespeare's \"Romeo and Juliet\" has been selected as the play to be<br />\nPresented by the Smith College Senior Dramatics this year.<br />\nDuring the summer, $8,000 was expended in refitting the Yale gymnasium.<br />\nThe Juniors at the University of California are going to raise $2,000 as a<br />\nloan Fund.<br />\nPrinceton may go to the Pacific Coast during the Christmas holidays to play<br />\nthe University of California.<br />\nA Student Union has been organized at Harvard, with a membership of<br />\n2,500. Its object is social intercourse and recreation.<br />\nThe Princeton base ball association cleared $4,596 last season.<br />\nSix thousand Yale graduates and about 150 college presidents are said to<br />\nhave been in New Haven, for the bi-centennial celebration of Yale.<br />\nThe President of the University of Illinois has issued an address to the<br />\nstudent body on the subject of hazing, which is said to be very severe at Illinois. The president stated that hazing, and certain other college customs,<br />\nsuch as painting the college buildings, and the posting of personal bulletins<br />\nhad to be stopped.<br />\nThe Yale faculty has recently provided that every student shall be allowed<br />\nto take thirty cuts a year without penalty. It also decided that exceptional<br />\nregularity in attendance at recitations may diminish the number of recitation<br />\nhours a year in a course from sixty to fifty-eight. This arrangement will allow<br />\ncandidates for the athletic teams to take a large number of cuts to make up the<br />\ndeficiency after the close of the athletic season.<br />\n<br />\n\f. THE NEWS—LETTER.<br />\n<br />\n8<br />\n<br />\n101010111111111111111111111111111111111111111111011111101filiamoni1M1111011111111111111111111111111M11111,11111111111111111111111111111111111111111111111111111111111<br />\n<br />\nIII<br />\n<br />\ni1*1u<br />\n<br />\nrlIPI<br />\nir<br />\nt<br />\n<br />\n0111111111111111111111111111111111111111111111111111111010111 111 1111111n<br />\n011111111110111111111111111101111110<br />\n<br />\n•<br />\n<br />\n111111111111111111111111111111111111111111,111111111111111MC!;:111i1ii111iN<br />\n<br />\nX-PRESIDNT D. C. OILMAN has under preparation several articles for<br />\nScribner's Magazine on his recollections of the last twenty-five years.<br />\nDr. Gilman will treat of the advance in intellectual, educational, and<br />\nscientific knowledge, as it has come under his observation at Hopkins and<br />\nabroad. No one is more fitted to undertake such a series of recollections, and<br />\ntheir publication is awaited with much interest.<br />\n<br />\ne<br />\n<br />\nAt the monthly meeting of the Trustees for November, the following<br />\nappointments were made: Rev. Theo. C. Foote, of Clinton, 0., to the W. S.<br />\nRayner fellowship in Semitic languages; E. P. Hyde, of Baltimore, to the fellowship in physics; George O. Berg to the fellowship in Greek, succeeding Dr.<br />\nRoscoe Guernsey, who is made instructor in Latin; Dr. W. H. Lewis, of the<br />\nMedical School, to the instructorship in anatomy.<br />\nPresident Remsen reported that Mrs. Lucy J. Woods, of Jamaica Plains,<br />\nMass., mother of Prof. R. W. Woods, had given $1,000 for the purpose of purchasing new and approved apparatus for the physical laboratory.<br />\nThe University has received a notice of the Fifteenth Annual Convention<br />\nof the Association of Colleges and Preparatory Schools of the Middle States and<br />\nMaryland. The meeting will take place on November 29 and 30, at Syracuse<br />\nUniversity, Many important subjects will be discussed, among them such<br />\ntimely topics as the executive system in college courses, and the freedom of<br />\nspeech to educators.<br />\nDr. Harry T. Marshall, of the Medical School, has been selected for the<br />\nforeign fellowship of the Rockefeller Institute for Medical Research. The board<br />\nof directors, of which Dr. Welsh is president, decided at their last meeting in<br />\nNew York that the income of the $200,000 fund was to be expended in maintaining 19 fellows, 18 of whom are to work in various American laboratories<br />\nand one abroad. Dr. Marshall is already at his post, which is Professor Ehrlich's laboratory in Germany. Each fellowship is for one year, during which<br />\ntime the incumbent is to do original work and send his report to the Board,<br />\nwith the view of having it published.<br />\nDr. Richard T. Ely, director of the School of Economics and Political<br />\nScience, University of Wisconsin, who was associate professor of Political<br />\nEconomy at Hopkins, 1887-92, has accepted an invitation to deliver the principal address at a meeting to commemorate the life and services of the late Dr.<br />\nHerbert B. Adams, The date of the meeting is uncertain.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n9<br />\n<br />\nThe Johns Hopkins Hospital Historical Society held its first meeting for<br />\nthe year on Monday night, November 11, in the Assembly Rooms of the<br />\nHospital. Papers were read by Dr. John Turner, Jr., on \"Ancient<br />\nAnatomists,\" and by Dr. E. F. Cordell on \"The Medicine and Doctors of<br />\nJuvenal.\" Dr. Howard A. Kelly is the president of this Society.<br />\nDrs. Thomas McCrea and Guy L. Hunner, of the Hospital Medical Society<br />\nexhibited some interesting cases at a recent meeting at the Hospital.<br />\nThe Major Biology Class had an exciting hunt for \"Medusae,\" otherwise<br />\nknown as jelly fish, last Tuesday. The members of this course heartily endorse this method of studying biology, even though no specimens are found.<br />\nThe whole class, under the paternal care of Dr. Grave, who paid the carfare,<br />\nwent to Fort McHenry, and there spent the afternoon in mild forms of recreation such as rowing heavy scows and grasping at imaginary medusae.<br />\nThe inventory of the late Dr. Herbert B. Adams' personal estate showed<br />\nthe amount to be $45,244.15, about $30.000 of which is in bonds. By his will,<br />\nDr. Adams made the University residuary legatee of his estate. After various<br />\nbequests are made, the University will realize more than $30,000, which, by the<br />\ndonor's request, will become a Herbert B. Adams Fund, the income to be<br />\ndevoted to the advancement of history, political science, and education.<br />\nMr. W. H. Buckler has presented to the University an autograph letter of<br />\nBenjamin Franklin, written from London to a friend in Florence. The letter<br />\nmay be seen beneath the picture of Franklin in second floor of the physical<br />\nlaboratory.<br />\nDr. Geo. Dobbin Brown,Ph.D.in English and Literature last June, has been<br />\nappointed to temporarily fill the position of Dr. Tupper, professor of English<br />\nLiterature in the University of Vermont. Professor Tupper is spending a year<br />\nin study at Berlin and Munich.<br />\nAt the meeting of the Charity Organization Society, Monday of last week.<br />\nDr. D. C. Gilman was elected president of the society. President Remsen and<br />\nDr. Hollander were elected members of the board of governors.<br />\n<br />\nSTUDENT NOTES.<br />\nHE settee given to the trophy room by the class of 1901 has already shown<br />\nits value in bringing comfort to the University \"loafing\" room. Just<br />\nsuch a thing was needed to add some degree of warmth and coziness to<br />\nthe room, which despite the hard seats, has always proved the best drawing<br />\ncard in the University. Thanks are due the senior class for what is easily the<br />\nbest thing so far given to the trophy-room, and on behalf of the class to the<br />\ncommittee which had such hard work selecting the gift. The committee consisted of J. R. Pels, chairman; G. Sisco, R. Sharretts, F. L. Guggenheimer, L.<br />\nC. Murphy.<br />\n<br />\nZ<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nThe Junior class is already considering the nature of their gift. Though<br />\nnothing definite has yet been decided upon, rumors are floating around in profusion. Everything, including leather upholstered arm chairs and a piano, has<br />\nbeen mentioned, with odds in favor of the chairs.<br />\nIn the Senate, the ministry has failed, and Mr. S. Wolman, leader of the<br />\nopposition, is now in control of the government. The following administrative<br />\nofficers have been chosen by Mr. Wolman to represent the opposition on the<br />\nfloor; W. Kirk, Leader pro tem.; H. G. Dew, Secretary; Thomas C. Pinkerton,<br />\nSergeant-at-Arms. Wednesday's debate was on the advisability of expelling all<br />\nanarchists from this country as the best means of eradicating anarchy.<br />\nThe Musical Clubs have had their annual picture taken. As this year the<br />\npicture will be used on 1500 posters, extra care was employed to get a satisfactory group.<br />\n<br />\nY. M. C. A. NOTES.<br />\nHE Week of Prayer for young men was observed last week with daily<br />\nservice in Levering Hall, from 1 to 1.20. Monday, Dr. Vincent spoke<br />\non \"The Reciprocal Relation of Learning to Religion;\" Tuesday, Dr.<br />\nGreene, on \"The Danger of Spiritual Neglect;\" Wednesday, Dr. Henry Wood,<br />\non \"True Christian Realism;\" Thursday, Dr. Brush, on \"Honesty;\" Friday,<br />\nDr. Steiner, on \"Overcoming.\"<br />\nThe week of service was opened on Sunday by an inspiring address from<br />\nRev. Oliver Huckel, on \"Spiritual Realities.\"<br />\nThe average attendance for the week was 25.<br />\nMr. Robert E. Speer is expected to address a mass meeting of students on<br />\nSunday, January 19th. Further notice will be given later.<br />\nThe regular monthly meeting of the Executive Council was held Wednesday, November 13, at 5 P. M. About thirty new members were elected.<br />\nThe State University of Iowa and McGill University are both campaigning<br />\nfor Association buildings.<br />\nSo cold was the night,<br />\nAnd her cheeks wore cold too<br />\nThough it wasn't quite right,<br />\nSo cold was the night<br />\nAnd so sad was her plight;<br />\nThat I—well, wouldn't you?<br />\nSo cold was the night,<br />\nAn her cheeks wore cold too.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n11<br />\n<br />\nFOOT BALL SCHEDULE. .3t<br />\nNOVEMBER 23.—J. H. U. vs. St. John's, at American League Park.<br />\nPark.<br />\nNOVEMBER 28.—(Thanksgiving Day), J. H. U. vs. U. of M., at American League<br />\n<br />\nHOPKINS, 27. DELAWARE, 0.<br />\nATURDAY, November 9th, the Hopkins team covered itself with laurels<br />\nand caused many loyal hearts to beat faster, when she downed the Delaware College eleven in Wilmington by a score of 27 to 0. Too much<br />\ncannot be said in praise of the magnificent work done by the team as a whole<br />\nand by the individual players. And, add to this the fact that IIaverford, which<br />\ndefeated our boys only a week previous in the hottest contest of the season by a<br />\nscore of only 5 to 0, had been defeated by the Delaware lads earlier in the<br />\nseason, every Hopkins \"rooter\" has just cause to be proud of the men who<br />\nwear the Black and Blue.<br />\nTo be sure, Delaware was seriously weakened by the absence of Huxley,<br />\ntheir regular captain, and a few more of their men, but where were Garwood<br />\nand the other Hopkins men who had done so nobly in the Haverford game?<br />\nEverything taken into consideration, the teams were well matched both in<br />\nregard to weight and science, and all that our boys have achieved, they have<br />\ndone on their own merits and to them all the praise is due.<br />\nFor Hopkins, it would be difficult to single out one man who did more than<br />\nanother for the success of the team. The backs played the game, and Gillespie<br />\nand Houghton went around the ends each time for a gain. Only twice during<br />\nthe game was the oval in the possession of their opponents. For Delaware,<br />\nLawton kicked well, and gained much time by the clever placing of the ball in<br />\nthe second half; Cann, at right end, showed remarkable skill; Wilson did<br />\nexcellent work back of the line, and Marshall, a new man, made several<br />\nbeautiful tackles.<br />\nIn the first half, after eight minutes of play, Gillespie circled the right end<br />\nfor a touchdown, and in the remaining ten minutes of play, the 'varsity took a<br />\nbrace, and before the referee's whistle blew, Sayler, Gillespie and Faris went<br />\nover the goal line for three more touchdowns.<br />\nHopkins took the kick-off at the beginning of the game, and Blanck downed<br />\nthe man after a short run. Lawton hit the line without effect, and Cooper went<br />\naround right end for eight yards. No more ground could be gained, and Cann<br />\n<br />\ng<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\npunted. Upon lining up, Sayler hit right tackle for five yards. Faris made a<br />\nplunge through the opposite tackle for 15 yards, and Gillespie and Houghton<br />\nmade large gains on successive end-around-end runs.<br />\nThe ball went steadily down the field, and Gillespie went around the end<br />\nfor the first touchdown. Sayler failed to kick goal. On the second kick-off Bernheim caught the ball and made a pretty run before going down. Gillespie,<br />\nFaris, and Sayler made end runs of 12, 10 and 18 yards, repectively. End plays<br />\nby the backs and ends came off in quick succession, and Faris circled right end<br />\nfor the second touchdown. Sayler did not kick goal.<br />\nOn the next kick-off Blanck downed the ball, and the first play saw Faris<br />\ncircle right end for eighteen yards. Houghton then showed his ability as a<br />\nsprinter. He was given the ball on the end-around-end play, and made a beautiful run of 40 yards. Gillespie again circled right end for 20 yards and a<br />\ntouchdown. Sayler kicked goal.<br />\nOn the line-up after the kick off, Gillespie repeated Houghton's trick by<br />\nrounding the opposite end for 40 yards. Sayler and Faris did not fail in a<br />\nsingle instance to make heavy gains through the line, and Sayler increased the<br />\nscore to 22 points by hitting right tackle for a fourth touchdown. Only a few<br />\nmore minutes of the half remained, but Blanck, Faris and Gillespie managed to<br />\nadvance the ball about 32 yards before time was called.<br />\nIn the second half, Delaware took a decided brace and the Hopkins men<br />\nwere unable to secure more than one more touchdown. Lawton gained much time<br />\nby cleverly kicking the ball out of bounds each time it came into Delaware's possession. The game ended with the ball in Delaware's 35-yard line.<br />\nThe line up was as follows:<br />\nHOPKINS.<br />\n<br />\nGilllespie (captain)<br />\nHill<br />\nJones<br />\nCampbell<br />\nYearley<br />\nYoutz<br />\nHoughton<br />\nBernheim<br />\nFaris<br />\nSayler<br />\n<br />\nDELAWARE.<br />\n<br />\n1 e.<br />\n1. t<br />\n1. g<br />\nc.<br />\nr. g<br />\nr. t<br />\nr. e<br />\nq b<br />\n1. h. b<br />\nr. h<br />\n<br />\nPowell, Kyle<br />\nWhorton, Marshall<br />\nSchab urger<br />\nRoberts<br />\nFerguson<br />\nMcCoy<br />\nCann<br />\nHarrington (c.) Wilson<br />\nFrazer, Wilson<br />\nCooper<br />\nTunnell, Lawton<br />\n<br />\nReferee—Mr. Charles G. Brooke, Maryland Athletic Club. Umpire—Mr.<br />\nGreen, of Delaware College. Timers—J. P. Cann, of Delaware, and J. S.<br />\nGrasty, of Johns Hopkins. Linesmen—W. H. Muley, of Johns Hopkins<br />\nUniversity, and Hessler, of Delaware. Touchdowns—Gillespie (2) Faris, (1),<br />\nSayler (1), and Blanck (1). Goals—Sayler (2). Time—Halves of 18 minutes<br />\n•<br />\n<br />\n\fTHE NEWS—LETTER.<br />\nHOPKINS, 11.<br />\n<br />\n13<br />\n<br />\nWESTERN MARYLAND, 0.<br />\n<br />\nN a bard-fought contest, Saturday afternoon, IIopkins gave the annual<br />\nexhibition of beating Western Maryland. When the game started the<br />\n.<br />\nWestminster lads were confident that victory was theirs, and, indeed, for a<br />\ntime the struggle was so fierce, that it seemed as if one team was as good as the<br />\nother, if not better.<br />\n. Western Maryland kicked off to Houghton, who advanced the ball to Hopkins 30 yard line. The Black and Blue now began to hammer their opponents'<br />\nline, and by fierce plunges through the opposite guards advanced the pigskin<br />\n15 yards. The Farmers now took a brace, and the line held like a stone wall,<br />\nso the ball went over. The Hopkinsonians in turn made a solid stand against<br />\ntheir opponents, and after a trifling gain by Western Maryland, again recovered<br />\nthe oval, but lost it on a fumble.<br />\n.<br />\nThe Westminster lads now tried some end runs, but in almost every<br />\ninstance the runner was nailed in his tracks, so that the ball went over on downs.<br />\nSayler was now sent around end for a gain of 10 yards, and Blanck in a similar<br />\n<br />\n3<br />\n<br />\nmanner added 5 other yards hereto.<br />\nWestern Maryland, still confident, however, allowed the Black and Blue to<br />\nmake no further gains and the pigskins was lost on downs.<br />\nThe Farmers slowly but steadily pushed the oval back over most of the<br />\nground gained by Hopkins, but were interrupted by Sayler and Garwood, who<br />\nby brilliant tackling, caused Western Maryland to lose on downs.<br />\nThe first half ended with the ball on Hopkins' 30 yard line, where Houghton<br />\ncarried it on the kick-off, both teams having seesawed up and down in a space<br />\nof about 20 yards duringthe entire half.<br />\nIn the second half, Sayler kicked off for Hopkins, and Western Maryland<br />\nbrought the oval to her 25 yard line, and then failing to gain the required distance, punted. Hopkins now began to play ball in dead earnest; Blanck hit<br />\nthe line for 7 yards, and Riggs followed with 8 more. Houghton now got<br />\naround the end at a beautiful rate, but strained his ankle, and was replaced by<br />\nSharretts. Sayler again circled the ends for 20 yards, and Sharretts was shoved<br />\nthrough the line for an additional 8. The Black and Blue now had the ball<br />\nWithin 5 yards of a touchdown, but there they stuck, and the oval was lost on<br />\ndowns. Not discouraged by this, however, Hopkins soon forced her opponents<br />\nto kick, and with a beautiful end run of 20 yards by Sayler, the lost territory<br />\nwas well nigh recovered. With two more line plunges, the pigskin rested on<br />\nthe 3 yard line, and Riggs did the mark. Sayler then kicked a goal.<br />\nWestern Maryland now kicked off and Hopkins began to pound the<br />\nFarmer's line a terrible rate, the latter being unable to hold together in any<br />\nShape whatever. So by long gains through the line, and end runs, the Black<br />\nand Blue soon scored on her touchdown, failing to kick goal, however.<br />\nWestern Maryland again kicked off, and Hopkins was well on her way to her<br />\ntouchdown when time was called, with the ball on Western Maryland's 25 yard<br />\nline.<br />\n<br />\n\f1W.<br />\n<br />\n14<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nEveryone is satisfied with the work of the team, and all are confident that<br />\nthe same team can rub it into St. John's next Saturday. Garwood's work is<br />\nwell nigh equal to that of Butler, whose style of play last year was so phenomenal. Sayler should he complimented for his effective work this season, especially in Saturday's game, and what Hill did to Western Maryland's star—<br />\nRoberts—was \"enough.\" Coach Dickson remarked after the game, that the<br />\nfellows helped each other wonderfully. A little more practice in catching<br />\npunts, and we'll have a star team. The rooting, led by Grasty, was the best<br />\nheard this season, and the NEWS-LETTER hopes that all students in the<br />\nUniversity will join the ranks next Saturday to cheer the Black and Blue on to<br />\nvictory.<br />\nThe line up was as follows:<br />\nHOPKINS.<br />\nGillespie<br />\nHill<br />\nGarwood<br />\nCampbell<br />\nYearly<br />\nBacon<br />\nHoughton, Sharretts<br />\nBernheim<br />\nRiggs.<br />\nSayler<br />\nBlanck<br />\n<br />\nWESTERN MARYLAND<br />\n1. e.<br />\n1. t.<br />\n1. g.<br />\n<br />\nBurg<br />\nRobinson<br />\nHenry<br />\nWebster<br />\nr g<br />\nWhite<br />\nr t.<br />\nRoberts<br />\nr. e<br />\nByrd<br />\nChaffinch<br />\n••<br />\n1. h b.<br />\nTarr<br />\nr. h. b.<br />\nMarkey<br />\nf. b<br />\nHurley<br />\nUmpire—Prof. Kain, St. John's. Referee—Casler, J. II, U, Timers—<br />\nHoffman, J. H. U., and Davis, Western Maryland. Linesmen—Weil, J. H.<br />\nU., and Williams, Western Maryland. Time—Two 20 minute halves.<br />\n<br />\nOUR SCRUB TEAM.<br />\n<br />\nC<br />\n<br />\nAPTAIN GILLESPIE, of the 'varsity eleven, is to be congratulated for his<br />\nwisdom in appointing a captain of the scrub team, and Captain Winternitz also deserves a vote of thanks for the hearty manner in which he has<br />\ntaken hold of matters and pushed his eleven forward. While the 'varsity was<br />\nadministering a severe defeat to Delaware College last Saturday one week ago,<br />\nthe scrubs were playing their first game against Dunham's Preparatory School.<br />\nCaptain Winternitz had not yet completely organized the team, and the lack of<br />\nsystematic play and unity lost the game by the score of 6 to 0. In the contest<br />\nagainst Marston's Preparatory School last Friday, however, the benefit of a<br />\nweek's practice was plainly shown. For about five minutes in the first half,<br />\nMarston's held her own, and possibly a little more, but then the scrubs got<br />\ntogether, and from that moment on there was certainly \"somethin' doin'.\"<br />\nDickey, Pearre, and Plaggemeyer hit the line in great fashion, and little IIazlehurst toddled around the end for comfortable gains. Dickey made the star play<br />\nof the game, by catching the ball from the kick-off and running through the<br />\n<br />\nJ<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n15<br />\n<br />\nentire Marston eleven for a touchdown. Toward the end of the game the<br />\nscrubs worked together in great style, and it was this fast, concerted action<br />\nwhich gave them the victory by a score of 16 to 0. The work of several freshmen was conspicuous, and they promise to put up a hard fight when the annual<br />\nclass game with the Juniors comes off. The scrubs usually line up as follows:<br />\nHazlehurst, 1. e.; Riley, 1. t.; Erlanger, 1. g.; Marshall, c.; Ward, r. g.; Custis,<br />\nr. t.; Parsons, r. e.; Winternitz (captain) q. b.; Dickey, Pearre, 1. h. b.; Smith,<br />\nr. h. b.; Plaggerneyer, f. b.<br />\nThe organization of a scrub team is a wise innovation in more ways than<br />\none. In the first place, it adds strength and system to the team which is<br />\ndepended upon to give the 'varsity practice; secondly, it brings out a great<br />\nmany men who would not come out because of their inability to make the<br />\n'varsity; and thirdly, it arouses additional spirit among the freshmen, several<br />\nof whom are on the team. All these results tend to increase our chances of<br />\nwinning the inter collegiate championship in the game with St. John's College<br />\nSaturday afternoon, It is every man's sacred duty to be on hand that day with<br />\na strong pair of lungs in good working order.<br />\n<br />\nHATSOEVER ye sow so shall ye reap\"—but the man who sows<br />\nwild oats generally raises cain.<br />\n\"After you,\" politely remarked the detective as he deftly fastened the<br />\nhandcuffs upon the wrists of his elusive victim.<br />\n<br />\nOrt,<br />\n<br />\nTHOSE SENSIBLE QUESTioNS.<br />\n\"Seasick?\"<br />\n\"Oh no! just casting my bread upon the water to see if it will come back<br />\nbuttered.\"<br />\nMonk—\"Your reverence, our loved brother was broken on the wheel.\"<br />\nBishop—\"Give me the sad details of the torture.\"<br />\nMonk—\"Oh! it wasn't the rack. He just hopped into a roulette game and<br />\nlost a hundred.\"<br />\nI looked into<br />\nHer eyes so blue,<br />\nI loved her well,<br />\nAnd this she knew.<br />\nI tied her shoe,<br />\n(A number two)<br />\nI didn't hurry much,—<br />\nWould you<br />\n<br />\n\f16<br />\n<br />\nTHE NEWS-LETTER.<br />\nWhy doth the Spring Lamb jump about,<br />\nAsked Mary, at a loss;<br />\n\"I think, quoth fond Mama,<br />\n\"It's been dressed with caper sauce.\"<br />\nA green little student in a green little way<br />\nA green little melon ate one day,<br />\nAnd the green little grasses now tenderly wave<br />\nO'er the green little student's green little grave.<br />\nIn April a man hooked a tuna<br />\nWhen asked, \"Shall you land it in June, or<br />\nSome time in July?\"<br />\nHe replied, \"I shall try<br />\nTo land it by then, if not sooner.\"<br />\n\"A rather impetuous Mr.<br />\nCalled on a girl and kr.<br />\nSaid she: .4Go sleau.<br />\nYou're not my beau,<br />\nTo you I am only a sr.\"<br />\n<br />\nSMITH, DIXON Z. CO.<br />\n<br />\nDesigning and Cutting by E. Michaelson.<br />\n<br />\nMIGH1VEL8ON,<br />\n<br />\nPft•PLii. o<br />\n29-31<br />\n<br />\nMERCHANT TAILOR,<br />\nPOPULAR PRICES.<br />\n<br />\nS. Charles St.<br />\n<br />\nF3altirnore, Md.<br />\n<br />\nALTERING AND REPAIRING.<br />\n<br />\n821 rladison Avenue,<br />\n<br />\nA. H. [MING<br />\n<br />\nMANUFACTURER OF<br />\n<br />\nOreeh Ildetter<br />\njfraternitp Jewelry'<br />\n<br />\n14 AN D 16 SIT. PAUL STREET,<br />\nBALTIMORE, MD.<br />\nPLEASE CALL AND EXAMINE OUR LINK<br />\n<br />\nMCFORE<br />\n<br />\nPURCHASING.<br />\n<br />\nJ. H. ROBINSON.<br />\nMANUPAOTURMS OP<br />\n<br />\n•FINE• CIGARS.•<br />\nDINALAIR<br />\n<br />\nIN<br />\n<br />\nTOBACCO, CIGARS AND SMOKERS' ARTICLES,<br />\nSTATIONERY.<br />\n626 N. EUTAW ST.<br />\nBALTIMORE,MD.<br />\nBaltimore, New York & Philadelphia Papers.<br />\nC. & P. Public Telephone, Madison 1185Y.<br />\n<br />\nSpecial discount to Students.<br />\n<br />\nBfILTIMORP., MD.<br />\n<br />\n\fThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\n<br />\nN. E. Cor. Charles and Fayette Sts.,<br />\n<br />\n'Phone, C. & P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br />\n<br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nMARIA BUIE, D.0.,<br />\nV.-Prest. & Asst. Seo'y.<br />\n<br />\nW. D. BOWEN, M. D., D. O.,<br />\nPrest. & Mgr.<br />\n<br />\nhohda<br />\nSilver<br />\ng<br />\nWeddin<br />\nIN GREAT VARIETY<br />\n<br />\nJACOBI &<br />\n2i43 N<br />\nversmiths.<br />\nJIBNKINS.Sil<br />\nCHARLES<br />\nST<br />\n<br />\nbos<br />\n<br />\nJAMES R. PAINV.<br />\nWAFER 8c. CO.<br />\n<br />\nTHVO. WARNIKR.<br />\n<br />\nESTABLISHED 1879.<br />\n<br />\n___<br />\nHenderson's<br />\n<br />\nb's<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note<br />\nBook<br />\n.s,<br />\nStudent's Stipp!ie<br />\n<br />\nMadison&floward Sts.<br />\nCertificate of Analysis from<br />\n<br />\nUMBRELLAS,<br />\n<br />\nC<br />\n<br />\nBookseller's and<br />\nUSHING & COMPANY' Stationets.<br />\n<br />\n34 W. BALTIMORE ST.<br />\nSCHOOL, LAW MEDICAL CLAIISICAL AND M!SCULL AN COUS BOON•<br />\nin Johns<br />\nKeeps constantly on hand the Text Books used<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\n11. R. EISENBRANDT SONS,<br />\n<br />\nfor<br />\n<br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n<br />\nto<br />\n<br />\nJORDfiM STRBLE11 GO. MIZIa4N7CTVE.<br />\nReads as follows: Samples submitted of<br />\nFrench Iitrandy—no<br />\nadulterants, no coloring,fine quality.<br />\n°port() Port—absolutely pure, of superior quality.<br />\ntlhereV—no coloring or adulterants, absolutely pure wine.<br />\nanitd\"olcrh6k\"9—no Fusel oil, no caramel, strictly pure<br />\n<br />\n0111—all tests show pure olive oil.<br />\n.der sr4<br />\nstrong. •.netrar—iiatural cider vinegar, strictly pure and<br />\nNix<br />\nound tiptoes—no adulteration, all strictly pure.<br />\n<br />\n—<br />\n<br />\nADVERTISING SPACE IN THIS PAPER<br />\n<br />\nHATTERS, CANES, ETC.<br />\n<br />\nAgent for Lincoln& Bennett and<br />\nWalter Bernard's London Bats.<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nCAPS<br />\nSilk and Cassimere Hats. tr HOPKINS<br />\n<br />\nProfs. G. W. Lehman & Son,<br />\n<br />\nOR<br />\n<br />\nH. MoMAI NS, 0.0.,<br />\nSoo'y. & Treas.<br />\n<br />\n201-203 N. CHARLES ST.<br />\nBALTIMORE, MD.<br />\nCharles T. Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br />\n<br />\nOtto H. Williams,<br />\nVice-President.<br />\nJ. E. Marshall, Asst, Cashier,<br />\n<br />\nFARMERS & MERCHANTS NAT'L. BANK,<br />\n<br />\nAPPLY TO<br />\n<br />\nSouth and Lombard Sts., Baltimore.<br />\n<br />\nPEARRE E. CROWL COMPANY,<br />\nPUBLISHERS.<br />\n<br />\nSurplus amd Profits $450,001.<br />\nCapital. $650.000<br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended In accordance with<br />\nbalances and business responsibility.<br />\nCORRESPONDENCE INVITED<br />\nCOLLECTIONS A SPECIALTY.<br />\n<br />\nLIGHT AND LOM BARD STREETS,<br />\nBALTIMORE, MD.<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nFor Particulars apply to<br />\n<br />\nA. SCHUMACHER & CO.,<br />\nGeneral Agents.<br />\n<br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS,GIBRALTEF-2,<br />\nNAPLES. GENOA, ETC.<br />\nBALTIMORE TO BRI1MEN<br />\nDIRP.CT.<br />\n<br />\n\fMANDOLIN. GUITAR AND BANJO iJe<br />\n<br />\nthe IRran5i2Sitiftbpiano CO,<br />\n<br />\nTsummv my<br />\n<br />\nC. J. LEVIN•<br />\nwho has made a life study of these nstruments. Mandolin Soloist of National reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br />\n<br />\nStudio, 331 N. Charles St<br />\n<br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br />\n<br />\n9/gen/raiz Studio<br />\n<br />\nCbicherino, Zrabburp anb tlebster<br />\n<br />\nSuccessor to Cummins<br />\n<br />\nBaltimore<br />\n<br />\nSpecial Discount to Students<br />\nHABERDASHERS.<br />\nShirts, Neckwear,<br />\nUnderwear, Hosiery,<br />\nEtc.<br />\nON SALE THE J. H. U. PENNANTS,<br />\n<br />\nTHE BLAKE COI<br />\n<br />\nand all other College Pennants<br />\n<br />\n203 W. BALTIMORE ST. B. 2 S. LIBERTY ST.<br />\nBALTIMORE, MI).<br />\nClinton P. Paine<br />\nGordon P. Paine<br />\n<br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange ,<br />\nChicago Board of Trade<br />\n<br />\nCLINTON P. PAINE dr CO.,<br />\nBANKERS at BROKERS<br />\nPrivate Wires to<br />\nNew York and Chicago<br />\n<br />\n11Stanos.<br />\n<br />\n.0<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\n<br />\n0.& P.'Phone 2322-2.<br />\n<br />\nFactory Prices<br />\n<br />\nSMITH'S SCHMT&BggiAEGE<br />\nOLD<br />\nBOOK<br />\nSTORES.<br />\n3rd<br />\n805 N. HOWARD STREET,<br />\ndoor from Madison.<br />\n<br />\nBOOKS<br />\n<br />\nOLD AND NEW<br />\n<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City<br />\nBooks Bought, Sold and Exchanged<br />\n<br />\n217 E. German Street<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nThe Chas. Willms Surgical Instrument Compaq<br />\nBENJ. A. NirLSON, W[141'1. MAINAOER<br />\n<br />\nWM. V.PIPPEN,<br />\nJ. Wm. Middendorf,<br />\nA.J. RobbIns.<br />\n<br />\nBaltimore, Md.<br />\n<br />\nDrovers and' Mechanics National Dank,<br />\nOF BALTIMORE. MD.<br />\n<br />\nVaniters & Iirohere.<br />\nCONTINENTAL TRUSI CO. BUILDING,<br />\nMembers<br />\nBaltimore Stock Exchange.<br />\n<br />\nYOUR EYLS<br />\n<br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br />\n<br />\nB. G. EICHELBERGER,<br />\nENGRAVING AND STAMPING.<br />\naOtS r**Ic, t<br />\n1-1 est x-1 atm.SSt.,<br />\nY. M. C. A. SUILOING,<br />\nC.& P. and Md.'Phones.<br />\nBALTIMORE, MD.<br />\n<br />\nU ON<br />\n<br />\nTHINK IT OVER.<br />\n<br />\nSAYRE OPTICAL COMPANY,<br />\n921 North Charles Street. (Masonic Temple.)<br />\n<br />\nIVOIMINING OPTIGIFONS.<br />\nTHE NEWS LETTER<br />\nis from the Press of<br />\n<br />\nBaltimore, Md.<br />\n<br />\nBOOKS AND STATIONBRY<br />\n<br />\nCapital Stock, $300,000.<br />\n<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br />\n<br />\nA. H Rutherfoord.<br />\nF. Lentz.<br />\n<br />\nJ. WM, MIDDENDORF & Co.<br />\n<br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Miorosoopes and Accessories.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\n605 N. Eutaw Street.<br />\n<br />\nJftS. Ft. DOWNS,<br />\n229 N. Charles St.,<br />\nMASONIC TEMPLE.<br />\n<br />\n=:=<br />\n<br />\nFOR Class, Fraternity and College Stationery,<br />\nBanquet Cards, Invitation, Diplomas,<br />\n<br />\nPrograms, Visiting Cards, etc<br />\nOur 50o J. Ii. U. Bins and Black Flag Paper—now rsaillg<br />\n<br />\nThere Is very little entertainment at home withoiit a Plana<br />\n<br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nLight and Lombard Streets,<br />\n<br />\nBALTIMORE<br />\n<br />\nWe carry a full line of Students' Note Books and StatIonery<br />\nBoth 'Phones.<br />\n<br />\n5ITIEF<br />\nPIANo9 s<br />\nIre The Best.<br />\nN.<br />\n<br />\nLibertu St.<br />\n<br />\n\f", "format": "basic_html", "processed": "iovember 20. 1901.<br /><br />\nJOHNS HOPKINS UNIVERSITY.<br /><br />\nThe Johns Hopkins Press.<br /><br />\nBALTIMORE. MD<br /><br />\nBeginning October 1st, 1901.<br /><br />\nPresident,<br />\n.<br />\n.<br />\n.<br />\nDean of the Medical School,<br />\nDean of the College,<br />\n.<br />\n.<br /><br />\nIRA BENTSEN.<br />\nWM. H. HOWELL<br />\nEDW. H. GRIFFIN.<br /><br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the de<br />\ngree of M. D.;courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLibraries of Baltimore.<br />\n100,000 volumes.<br />\n136,000 volumes.<br />\n200.000 volumes.<br /><br />\nUniversity<br />\n•...<br />\nPeabody Institute<br />\nPratt Library<br /><br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume XXIV<br />\nin progress. $6 per volume.<br />\nI. American Chemical Journal.<br />\nI. BEMSYIN, Editor. Monthly. 8vo. Volume X XV1<br />\nin progress. $5 per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GI LDERSLEEVE,, Editor. Quarterly. 8vo.<br />\nVolume XXII in progress. $3 per volume.<br />\nIV. Studies from the Biological Laboratory: live.<br />\nVolume V complete. $5 per volume.<br />\nV. Studios in Historical and Political Science.<br />\nMonthly. 8vo. Series XIX in progress. $3 per<br />\n'volume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XX in progress. $1 per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly. 4to.<br />\nVolume XII in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume X<br />\nin progress. $6 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Beitrage zur A sayriologie, etc.)<br />\nVol. TV in progress.<br />\nX. Memoirs from the Biologleal Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nXT. Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVI in progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. IvELcH, Editor. 111-monthly. 8vo. Volume<br />\nVT in progress. $5 per volume.<br />\nXII/. American Journal of Insanity.<br />\n11 EN RV M. HU D, Editor. Quarterly. 4to.,g5 per<br />\nvolume.<br />\nX IV. Reports of Maryland Geological Survey.<br />\nw LIJA M B. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\n8vo. Volume VI in progress. $2.50 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Trimtees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br />\nI.<br /><br />\ndoimimplONSIM11<br /><br />\nTwenty-Sixth Year.<br /><br />\nLaboratories,<br />\nChemistry,<br />\nPhysics,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharinacologY,_<br />\nPhysiological Uhemietry,<br />\nClinical Medicine,<br /><br />\nDirectors.<br />\nIra ReMSP11.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn .1. Abel.<br />\nJohn J. Abel.<br />\nWilliam Older.<br /><br />\nSeminaries.<br />\nGreek,<br />\n[AWL<br />\nSanskrit,<br />\nSaraitic.<br />\ntlernian,<br />\nRoraance,<br />\nBrattish,<br />\nHistory,<br />\nP1conornies,<br />\nIlia thematies,<br />\nPhysics,<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice, Bloomfield<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJ. M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames,<br /><br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\nI. Classical (the \"Old College Course.\")<br />\n2. MatItnmatical-Physical,<br />\n(leading up to Engineering.)<br />\n3. Ckttnioal-itiologica I.<br />\n(leading up to Medicine.)<br />\n4. Oeologissal-Iliological.<br />\n5. Latin Mathematical.<br />\na. Historical-Political.<br />\nAleadin(Up to Law.)<br />\n7. Modern Languages.<br />\nEditors.<br />\nSerial Publications.<br />\nFrank Morley.<br />\nMathematics(vol. XXIV.)<br />\nChemistry (vol. XXVI).<br />\nIra Hemmen.<br />\nBasil L. Gildersleeve.<br />\nPhilology (vol. XXII.)<br />\nJ. M. Vincent.<br />\nHistory vol. XI X.)<br />\nA. Marshall Elliott.<br />\nModern Languages(vol. XVI.)<br />\nWilliam K. Brooks.<br />\nBiology (vol. IV.)<br />\nPaul Haupt.<br />\nAss‘ riologv (vol. TV.)<br />\nExperimental Medicine(vol. VI.) W. If. Welch.<br /><br />\nIn addition to the serials above named, copies may he<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul 'Haupt. Prospectus on application.<br />\nRowland's Photograph of the Normal Solar Spectrum.<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 118 pp. 4to. 68 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fee-simile edition. Edited by J. Bendel Harris. 110 pp. 4to. 10<br />\nplates. $6.00<br />\nReproduction in Phototype of Syriac MS with Antilegom.na Epistles. Edited by I. IL Hall. $3.00.<br />\nBibliographia Hopkinsiensia. Part I. Philology. Parts<br />\nChemistry, Mineralogy and Geology. Parts<br />\nIV-V-VI.Physics, Astronomy and Mathematies.<br />\n8 vo. lll cents per part.<br />\nS full list of publications will be sent on application.<br /><br />\nProgrammes of the Courses offered to graduate students in Philosophy end the Arts, and in the School of<br />\nMedicine,and also of the Undergraduate or Collegiate<br />\nCourees, will be sent on application to the Registrar.<br /><br />\nCommunications In respect to exchanges and remittances<br />\nma u he sent to Johns floph ins Press, Baltimore, MA.<br /><br />\nTHE NEWS-LETTER.<br />\nV01. VI.<br /><br />\nNOVEMBER 20, 1901.<br /><br />\nNo, 4.<br /><br />\nTHOUGHTS FROM THE YALE BI-CENTENNIAL.<br />\nN the noble address made by Mr. Justice Brewer a few weeks ago at the Bicentennial of the Founding of Yale University, he said: \"It may fairly be<br />\n. claimed that Yale was the first educational institution in the world to make<br />\ntraining for service of the public the supreme object of her life and work.\" In<br />\ncomparison with other collegiate institutions the statement is doubtless true, and<br />\nit is a proud one<br />\nto have made for any University, but the idea of an institution<br />\nfor training young men up to service of the State was no new one in New Haven<br />\nColony. The Puritans felt the need of education as never had man before.<br />\nThey placed each man directly before his Maker, with no priestly class to which<br />\nIntercession could be made, and in the hands of the man was an infallible book,<br />\nthe 'only rule of faith and practice.\"<br />\nSo we find that education was early<br />\nsought by the New Englanders. At least, men must be able to read and understand the Scriptures. The chief aim of the Massachusetts men, which aim in<br />\nthe very words of the act was copied by the men of Connecticut, was to prevent<br />\nthat \"one chiefe project of that old deluder, Sathan, to keepe men from the<br />\nKnowledge of the Scriptures.\" That \"learning may not be buried in the grave<br />\nof our forefathers in Church and Commonwealth,\" schools<br />\nwere established,<br />\nand at Newtown, whose name was changed to Cambridge in memory of the<br />\nEnglish alma mater of so many of the clergy, a college was set up. At New<br />\nHaven, where the settlers were fully as strict as those of Massachusetts, and<br />\nmuch more so than the Connecticut men, we might have expected to find even<br />\nmore attention given to the religious need, and that the chief purpose of any<br />\ncollege or school there established would have been the training of ministers.<br />\nOn the contrary, we find that these colonists, under the leadership of Gov.<br />\nTheophilus Eaton and Rev. John Davenport, passed a vote within half a dozen<br />\nYears of the first settlement, and before the tree stumps could have removed from<br />\nthe earliest clearings; \"For the better training up of youth in this town that,<br />\nthrough God's blessing, they may be fitted for public service hereafter, either<br />\nIn church or common weale, it is ordered that a free school be set up.\" This<br />\nschool was called free, not because it was free from cost to its pupils, but<br />\nbecause in it there were taught those studies which tend to liberalize men's<br />\nminds, and free them from ignorance, and it was Davenport's desire that it should<br />\ndevelop into a college. When he removed to Boston some twenty years later,<br />\nhe made a grant to the trustees \"that<br />\nthe Grammar school or College at New<br />\nHaven, already founded and begun, may be provided for, maintained, and continued for the encouragetnent and bringing up of hopeful youths in the lan guages, and other good literature for the public use and service of the country.\"<br /><br />\n5<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nAdverse circumstances hindered the establishment of the college for nearly<br />\nsixty years from the time when the Town of New Haven expressed the fine<br />\nsentiment we have quoted above, and yet the thought was never lost. The<br />\ntradition of a college at New Haven lingered, and John Pierpont, Davenport's<br />\nson-in-law and successor in the pastorate of the church, was one of the ten<br />\nCongregational clergymen of Connecticut who met at the parsonage in Branford, and bringing a few volumes from their scanty libraries, gave \"these books<br />\nto found a college in this Colony.\" We are not surprised that the charter of<br />\nthe \"Collegiate School of Connecticut,\" as the first name was, should contain<br />\nthe provision that the institution was established that \"Youth may be instructed<br />\nin the Arts and Sciences, who, through the blessing of Almighty God, may be<br />\nfitted for public employment, both in church and civil State,\" We find the<br />\nsame note here and almost the same words as we hear in that early vote of the<br />\nTown Meeting. In this provision, we see a deep reverence for the Creator, that<br />\nconception of a disinterested life which well fitted the followers of Him who<br />\n\"pleased not himself,\" and a clear idea of that solidarity of mankind and the<br />\nsupreme need of the State to have the best energies of its ablest men which in<br />\nthese latter days are again calling our educated men into public service. Other<br />\ninstitutions might labor for the self culture of their students, but at Yale the<br />\ngraduates should learn from the very outset that \"no man liveth to himself.\"<br />\nDuring the two centuries which have passed since, the ideal has been nobly<br />\nheld before Yale men by a succession of consecrated, able, and zealous presidents and professors. Some have failed to live up to that conception, which<br />\nhas been the basis of the \"Yale spirit,\" but the student life early became<br />\nimbued with the feeling that one must work for others. \"Yale sand\" meant<br />\nnot so much courage shown for one's own advantage, but an undaunted purpose<br />\nto do one's utmost for the College. Nathan Hale's speech has the true ring.<br />\n\"I only regret that I have but one life to give for my country.\" William<br />\nWalter Phelps, refusing to resign arduous public office, though such refusal<br />\nmight have prolonged his life, was a more recent example of the devotion of<br />\nYale men to the service of others. Not alone in the United States and not alone<br />\nin direct public service has this spirit been shown and this purpose been carried<br />\nout. Missionaries in every foreign clime, and professional and business men<br />\neverywhere have displayed that same devotion to public employment.<br />\nLast month, over half the living graduates of Yale assembled on the<br />\nUniversity campus and participated in the finest academic celebration ever<br />\ngiven in any land. It would have been difficult to have matched that Commemoration Day, but the great numbers and the enthusiasm of the alumni,<br />\ntheir devotion to the University, and the seriousness of their purpose were<br />\nunparallelled. From the sermon in the Battell Chapel on Sunday morning to<br />\nthe farewell reception to President Roosevelt on Wednesday evening, a succession of eloquent addresses, of gorgeous processions by night and day, of<br />\nvaried athletic events, and of fine musical concerts presented a diversified programme filling nearly every moment of the time.<br />\nMost impressive of all to many of those who returned, was the great<br />\nassemblage of the alumni, some six thousand in number, in an amphitheatre on<br /><br />\nTHE NEWS-LETTER.<br /><br />\n3<br /><br />\nthe campus on Tuesday evening. For over four hours they sang<br />\ncollege songs<br />\nand saw tableaux of scenes in the past history of Yale, until, with the<br />\nglare of<br />\nrockets and singing of the doxology, they dispersed at midnight. To those of<br />\nus from Baltimore, it was pleasant to find that three<br />\nof the Johns Hopkins<br />\nFaculty: President Rernsen, and Professors Gildersleeve and Osier received<br />\nhonorary degrees and that of the six orations, two were delivered by President<br />\nGilman and. Dr. Welch. It is worthy of note that the Yale influence came to<br />\nBaltimore at the very outset of our University's history; for the two men, we<br />\nhave just named were, respectively, the first President of the University and the<br />\nfirst dean of the Medical<br />\nSchool. President Northrop of the University of<br />\nMinnesota, in his address on Yale's influence on the development of the country, paid a most eloquent tribute to President Gilman's educational<br />\ncareer,<br />\nreferring to him as the originator of the modern system of graduate instruction<br />\nin the United States, and the man who had received<br />\nmore doctorates than any<br />\nother Yale graduate. In fact, the influence of Yale on the education of the<br />\ncountry has been extremely great, and, through graduates who have served as<br />\nPresidents and professors in other institutions, the Yale ideas have been carried<br />\nall over the land. More truly than Virginia, Yale has been a \"Mother of<br />\nPresidents,\" for more colleges have had the leadership of Yale men than of the<br />\ngraduates of any other University, and nearly every prominent University was<br />\norganized by a graduate of Yale. Thus the idea of Davenport has been spread<br />\nover the land and to many a man in many a college has come the purpose to<br />\ndevote his best energies to the \"public use and service of the country.\"<br /><br />\nBERNARD C. STEINER.<br />\nDR. JACOB H. HOLLANDER COMMENDED.<br /><br />\nZ<br /><br />\nHE high estimation at which the Johns Hopkins University and its Faculty<br />\nare held by our country at large is constantly being brought into evidence. This time it is a member of the Faculty, Dr. Jacob H. Hollander,<br />\nWhose services to the Government were of such value that the Secretary of War<br />\nlast week sent the following letter to President Remsen:<br />\n\"In February, 1900, when the Government of Porto Rico was in need of the best<br /><br />\nexpert aid attainable for a revision of its system of taxation, I applied to your University<br />\nto permit your associate professor of finance, Dr. J. H. Hollander,<br />\nto lay aside his customary. duties and come to our assistance. I now wish to acknowledge to the University the<br />\nObligation which the Government of the United States is under for the services rendered<br />\nby Dr. Hollander. While his work as special commissioner<br />\nwas still unfinished the<br />\nmilitary government of the island was superseded by civil government under the act of<br />\nCongress, and his performance of his duties had been so satisfactory that he was appointed<br />\ntreasurer of the island by the President. He performed the duties of that office with<br />\nfidelity, while bringing to a successful conclusion the work of framing a comprehensive<br />\nand adequate system of taxation, which was subsequently adopted by the Legislature, and<br />\n15 now in successful operation. Dr. Hollander returns to the performance of his duties in<br />\nthe University with the good wishes, and the grateful appreciation of all the officers who<br />\nhave been engaged in the difficult duty of reorganizing the Government of Porto Rico.<br />\nELIH1J ROOT,<br />\nSecretary of War.\"<br /><br />\n4<br /><br />\nTHE NEWS—LETTER.<br /><br />\nIn this connection it might be well to remark, that whenever there is any<br />\nimportant Government office to be filled, or any scientific phenomena to be<br />\nstudied, the United States has usually looked to the Johns Hopkins University<br />\nfor support. The successor to Dr. Hollander has already been chosen, and<br />\nonce more the important office of Treasurer of Porto Rico is to be filled by the<br />\nJohns Hopkins. Dr. William F. Willoughby, a former graduate student of<br />\nthe University, will succeed Professor Hollander.<br /><br />\nJOHNS HOPKINS MUSICAL CLUBS.<br />\nHE Johns Hopkins Musical Club assembled last week to have the annual<br />\npicture taken. This was done earlier this year than formerly on account<br />\nof the new scheme for poster advertising. Arrangements have been completed whereby a half tone cut, 8x11 inches, will be printed in the middle of<br />\nthe concert posters. It is expected that this will greatly aid in advertising the<br />\nclubs, both in their home concert and on the trips.<br />\nSo far the following concerts have been scheduled: Johns Hopkins Hospital, November 29; Roland Park, December 6; Hannah More, December 13;<br />\nCatonsville, December 20, and Christmas Trip, which will probably include<br />\nCharleston, W. Va., December 26; Winchester, Va., December 27; Martinsburg,<br />\nVa., afternoon of December 27, and Hagerstown, Md., December 28. The<br />\ndates for the Annapolis, Baltimore, Bryan Mawr, Washington and Wilmington<br />\nconcerts have still to be arranged. The Easter trip will be to Old Point Comfort, where the men will lodge in the Hygeia Hotel and dine in the Chamberlin.<br />\nThis is an improvement over former years, for never before was the excellent<br />\ncuisine of the Chamberlin enjoyed for the entire time. It is expected that the<br />\nclubs will leave Fortress Monroe Monday, March 30 and go to Richmond, but<br />\nthis has not been definitely determined upon.<br />\nIn regard to the clubs themselves little can be said as yet, except that there<br />\nare a large number of candidates. The mandolin club still needs a cornet,<br />\n'cello and flute, so if any one in the University is adept or otherwise on any of<br />\nthese instruments there is a vacancy yearning to be filled.<br />\nThe Glee Clubs will be selected from the following men: First tenors,<br />\nMessrs. Eyster, Carver, Humrichouse, Kumane and Cowles; second tenors,<br />\nMessrs. Nelson, Wright, Youtz, Beasley, Hale, Stubbs, Houghton; first basses,<br />\nMessrs. King, Meyers, Eager (leader); Snowden, Thomas, Hill and Ford;<br />\nsecond basses, Messrs. Sayler, P. K. Gilman, Marshall, Branch, Moss and<br />\nLicking. The Banjo Club will be composed of Messrs. Marshall, (leader);<br />\nSnowden, Bryan, Baetjer, Lanier, Hendry, Maynard, Mason, Smith and Murkland, banjeaurines, and Messrs. Converse, Cook, Murphy, Hazelhurst, Hill and<br />\nMartin. The men on the Mandolin Club are Messrs. Snowden, (leader);<br />\nBryan, Pearre, England, Moulton, Hall,Dochez, Glocker and Cross, mandolins;<br />\nMessrs. Converserse, Murphy, Hazelhurst, Martin, Hill, Smith, and Cook,<br />\nguitars, and Messrs. Lanier and Nelson, violins.<br /><br />\nt<br /><br />\nTHE NEWS—LETTER.<br /><br />\n5<br /><br />\nOUR NEW SONG<br /><br />\nt<br /><br />\nHE new song which was used for the first time last Saturday in the Western<br />\nMaryland game, appears to have struck much favor with the ''rooters.''<br />\nThe words are by Mr. Walter B. Carver, to the music of \"Michael Roy.\"<br />\nOur Alma Mater in Dixie Land.<br />\nCome stand together we'll raise a cheer, and wave the black and blue;<br />\nWe pledge our faith as loyal sons, to Hopkins we'll be true.<br />\nWe love our college in Dixie Land, our University,<br />\nWe shout her praise as we march along, so one, two, three!<br />\nCHORUS:<br />\nHurrah! Hurray!<br />\nA rousing Hullabaloo! rah!<br />\nOur Alma Mater in Dixio Laud,<br />\nHurrah for black and blue!<br />\nThe Hopkins men on the foot-boll field have won a great renown;<br />\nThey buck the centre, and run the ends, and pull their opponents down.<br />\nAnd if their bodies are black and blue, they're loyal don't you see,<br />\nThey bear their colors where 'or they go, so one, two, three!<br />\nHurrah! Hurray! Etc.<br />\nWe play lacrosse and we shoot for goal, we shoot and not in vain;<br />\nThe score goes up as our foes go down; we win again and again.<br />\nOur boys are out for the championship, as ev'ry one may see;<br />\nWe cheer the fellows that play lacrosse, so one, two, three!<br />\nHurrah! Hurray! Etc.<br /><br />\nUNIVERSITY LECTURES.<br /><br />\nt<br /><br />\nHE series of six lectures on public speaking, which were concluded last<br />\nMonday night by Mr. S. A. King, of the University of London, proved<br />\nto be a decided success. Mr. King laid particular stress on the technique<br />\nof the art, and his manner of procedure plainly attested his thorough knowledge<br />\nof the subject. A large class of graduate students derived no little benefit from<br />\nthe course. In order to demonstrate the artistic side of his theory, Mr. King<br />\ngave a recital of selections from the plays of Shakespeare, and the large audience left thoroughly convinced that he knows what he is doing.<br /><br />\nThe course of lectures which were recently started by Dr. Frederick Lykes<br />\non the general topic, \"Literature of the Victorian Era,\" are progressing finely.<br />\nA large number of local teachers are following the work prescribed.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br /><br />\nNOVEMBER 20, 1901.<br />\nSubscription $1 50 per year.<br />\n.<br />\n.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br /><br />\n10 Cents a single copy.<br />\nWILLIAM B. HILL, 1902.<br />\n. SOL STROUSE, 1902.<br />\nEBEN C. HILL, 1902.<br />\n.<br />\nROBERT S. LANIER, 1903.<br />\nW. S. BIRD, 1903.<br />\nJOHN A. SLEMONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1903.<br />\n•<br /><br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\nAddress all articles, communications, etc., to WILLIAM B. HILL, box 239, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\nHE appointment of Dr. William F. Willoughby to succeed Dr. J. H. Hollander as treasurer of Porto Rico, gives evidence of the high opinion held<br />\nof Hopkins by the governmental authorities at Washington. Not only<br />\nwas the chief financial position in the island twice filled by Hopkins men, but<br />\neven two of the important secondary places were administered by our graduates. Three of our professors were honored at the Yale Bi-Centennial Celebration, and almost every week some newspaper notice attests to the great esteem<br />\nfelt for the Hopkins by the general educational world.<br />\nWhy is it that Baltimore responds so conservatively, so slowly to the calls<br />\nof the University; why is it that this city seems to appreciate to such a<br />\nsmall degree the immense benefits the presence of a great educational<br />\ncenter brings a city? Is it because the magnitude of the University's work is<br />\nso extensive that it overtowers the city, and consequently causes an unbalanced<br />\nperspective? At least, the fact remains that the Baltimore public does not seem<br />\nto be able, or does not want to be able, to grasp the full value of our University which a comparative study at a distance never fails to demonstrate.<br />\nWhereas Hopkins is honored by having inside its walls men from all parts of<br />\nthe globe who have come to study in the University, whose fame extends everywhere, our own State does not even think us worthy of enough assistance to<br />\nhelp keep up the reputation so gloriously won. It is said that the million<br />\ndollars required before possession of the Homewood Estate is given the University authorities has almost been raised. \"Almost,\" but after nine months<br />\nanxious waiting, it seems rather dispiriting not to be able to say \"completely\"<br />\nraised. Baltimore and Maryland are certainly living up to their reputation for<br /><br />\nt<br /><br />\nconservatism.<br /><br />\nTHE NEWS—LETTER. -<br /><br />\n'7<br /><br />\nT IS encouraging to note the increased enthusiasm among the undergraduate<br />\nbody, and especially among the freshmen class. This enthusiasm is<br />\nmanifesting itself in the \"rooting,\" for, at last, the \"Hopkins lads\" seem<br />\nto be awakening to a sense of their duty, and are making a \"joyful noise.\" Even<br />\nif we have not an undergraduate department consisting of a thousand or so men,<br />\nit is perfectly possible for the men we have to organize and do some very effective \"rooting<br />\n.\" and we rejoice to see that such is being done. On our Haverford<br />\nand on our Wilmington trip our band of \"rooters\" was very small, indeed, but<br />\nwhat was lacking in numbers was made up by enthusiasm, and the handful of<br />\nmen made as much noise as fifty.<br />\nWe still have St. Johns and University of Maryland to play; \"rooters,\"<br />\ncome out in a body, and \"root\" your very hardest.<br />\nIf every man would buy a small megaphone, at a trifling cost, the effect<br />\nproduced at these two games would be prodigious. Every one present would<br />\nknow that Hopkins was out for business then, and the rooting would be most<br />\nencouraging.<br /><br />\n3<br /><br />\nAMONG THE COLLEGES.<br /><br />\nZ<br /><br />\nHE Minstrel Club of Lehigh will probably give a performance in<br />\nWashington on Thanksgiving Day.<br /><br />\nShakespeare's \"Romeo and Juliet\" has been selected as the play to be<br />\nPresented by the Smith College Senior Dramatics this year.<br />\nDuring the summer, $8,000 was expended in refitting the Yale gymnasium.<br />\nThe Juniors at the University of California are going to raise $2,000 as a<br />\nloan Fund.<br />\nPrinceton may go to the Pacific Coast during the Christmas holidays to play<br />\nthe University of California.<br />\nA Student Union has been organized at Harvard, with a membership of<br />\n2,500. Its object is social intercourse and recreation.<br />\nThe Princeton base ball association cleared $4,596 last season.<br />\nSix thousand Yale graduates and about 150 college presidents are said to<br />\nhave been in New Haven, for the bi-centennial celebration of Yale.<br />\nThe President of the University of Illinois has issued an address to the<br />\nstudent body on the subject of hazing, which is said to be very severe at Illinois. The president stated that hazing, and certain other college customs,<br />\nsuch as painting the college buildings, and the posting of personal bulletins<br />\nhad to be stopped.<br />\nThe Yale faculty has recently provided that every student shall be allowed<br />\nto take thirty cuts a year without penalty. It also decided that exceptional<br />\nregularity in attendance at recitations may diminish the number of recitation<br />\nhours a year in a course from sixty to fifty-eight. This arrangement will allow<br />\ncandidates for the athletic teams to take a large number of cuts to make up the<br />\ndeficiency after the close of the athletic season.<br /><br />\n. THE NEWS—LETTER.<br /><br />\n8<br /><br />\n101010111111111111111111111111111111111111111111011111101filiamoni1M1111011111111111111111111111111M11111,11111111111111111111111111111111111111111111111111111111111<br /><br />\nIII<br /><br />\ni1*1u<br /><br />\nrlIPI<br />\nir<br />\nt<br /><br />\n0111111111111111111111111111111111111111111111111111111010111 111 1111111n<br />\n011111111110111111111111111101111110<br /><br />\n•<br /><br />\n111111111111111111111111111111111111111111,111111111111111MC!;:111i1ii111iN<br /><br />\nX-PRESIDNT D. C. OILMAN has under preparation several articles for<br />\nScribner's Magazine on his recollections of the last twenty-five years.<br />\nDr. Gilman will treat of the advance in intellectual, educational, and<br />\nscientific knowledge, as it has come under his observation at Hopkins and<br />\nabroad. No one is more fitted to undertake such a series of recollections, and<br />\ntheir publication is awaited with much interest.<br /><br />\ne<br /><br />\nAt the monthly meeting of the Trustees for November, the following<br />\nappointments were made: Rev. Theo. C. Foote, of Clinton, 0., to the W. S.<br />\nRayner fellowship in Semitic languages; E. P. Hyde, of Baltimore, to the fellowship in physics; George O. Berg to the fellowship in Greek, succeeding Dr.<br />\nRoscoe Guernsey, who is made instructor in Latin; Dr. W. H. Lewis, of the<br />\nMedical School, to the instructorship in anatomy.<br />\nPresident Remsen reported that Mrs. Lucy J. Woods, of Jamaica Plains,<br />\nMass., mother of Prof. R. W. Woods, had given $1,000 for the purpose of purchasing new and approved apparatus for the physical laboratory.<br />\nThe University has received a notice of the Fifteenth Annual Convention<br />\nof the Association of Colleges and Preparatory Schools of the Middle States and<br />\nMaryland. The meeting will take place on November 29 and 30, at Syracuse<br />\nUniversity, Many important subjects will be discussed, among them such<br />\ntimely topics as the executive system in college courses, and the freedom of<br />\nspeech to educators.<br />\nDr. Harry T. Marshall, of the Medical School, has been selected for the<br />\nforeign fellowship of the Rockefeller Institute for Medical Research. The board<br />\nof directors, of which Dr. Welsh is president, decided at their last meeting in<br />\nNew York that the income of the $200,000 fund was to be expended in maintaining 19 fellows, 18 of whom are to work in various American laboratories<br />\nand one abroad. Dr. Marshall is already at his post, which is Professor Ehrlich's laboratory in Germany. Each fellowship is for one year, during which<br />\ntime the incumbent is to do original work and send his report to the Board,<br />\nwith the view of having it published.<br />\nDr. Richard T. Ely, director of the School of Economics and Political<br />\nScience, University of Wisconsin, who was associate professor of Political<br />\nEconomy at Hopkins, 1887-92, has accepted an invitation to deliver the principal address at a meeting to commemorate the life and services of the late Dr.<br />\nHerbert B. Adams, The date of the meeting is uncertain.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n9<br /><br />\nThe Johns Hopkins Hospital Historical Society held its first meeting for<br />\nthe year on Monday night, November 11, in the Assembly Rooms of the<br />\nHospital. Papers were read by Dr. John Turner, Jr., on \"Ancient<br />\nAnatomists,\" and by Dr. E. F. Cordell on \"The Medicine and Doctors of<br />\nJuvenal.\" Dr. Howard A. Kelly is the president of this Society.<br />\nDrs. Thomas McCrea and Guy L. Hunner, of the Hospital Medical Society<br />\nexhibited some interesting cases at a recent meeting at the Hospital.<br />\nThe Major Biology Class had an exciting hunt for \"Medusae,\" otherwise<br />\nknown as jelly fish, last Tuesday. The members of this course heartily endorse this method of studying biology, even though no specimens are found.<br />\nThe whole class, under the paternal care of Dr. Grave, who paid the carfare,<br />\nwent to Fort McHenry, and there spent the afternoon in mild forms of recreation such as rowing heavy scows and grasping at imaginary medusae.<br />\nThe inventory of the late Dr. Herbert B. Adams' personal estate showed<br />\nthe amount to be $45,244.15, about $30.000 of which is in bonds. By his will,<br />\nDr. Adams made the University residuary legatee of his estate. After various<br />\nbequests are made, the University will realize more than $30,000, which, by the<br />\ndonor's request, will become a Herbert B. Adams Fund, the income to be<br />\ndevoted to the advancement of history, political science, and education.<br />\nMr. W. H. Buckler has presented to the University an autograph letter of<br />\nBenjamin Franklin, written from London to a friend in Florence. The letter<br />\nmay be seen beneath the picture of Franklin in second floor of the physical<br />\nlaboratory.<br />\nDr. Geo. Dobbin Brown,Ph.D.in English and Literature last June, has been<br />\nappointed to temporarily fill the position of Dr. Tupper, professor of English<br />\nLiterature in the University of Vermont. Professor Tupper is spending a year<br />\nin study at Berlin and Munich.<br />\nAt the meeting of the Charity Organization Society, Monday of last week.<br />\nDr. D. C. Gilman was elected president of the society. President Remsen and<br />\nDr. Hollander were elected members of the board of governors.<br /><br />\nSTUDENT NOTES.<br />\nHE settee given to the trophy room by the class of 1901 has already shown<br />\nits value in bringing comfort to the University \"loafing\" room. Just<br />\nsuch a thing was needed to add some degree of warmth and coziness to<br />\nthe room, which despite the hard seats, has always proved the best drawing<br />\ncard in the University. Thanks are due the senior class for what is easily the<br />\nbest thing so far given to the trophy-room, and on behalf of the class to the<br />\ncommittee which had such hard work selecting the gift. The committee consisted of J. R. Pels, chairman; G. Sisco, R. Sharretts, F. L. Guggenheimer, L.<br />\nC. Murphy.<br /><br />\nZ<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nThe Junior class is already considering the nature of their gift. Though<br />\nnothing definite has yet been decided upon, rumors are floating around in profusion. Everything, including leather upholstered arm chairs and a piano, has<br />\nbeen mentioned, with odds in favor of the chairs.<br />\nIn the Senate, the ministry has failed, and Mr. S. Wolman, leader of the<br />\nopposition, is now in control of the government. The following administrative<br />\nofficers have been chosen by Mr. Wolman to represent the opposition on the<br />\nfloor; W. Kirk, Leader pro tem.; H. G. Dew, Secretary; Thomas C. Pinkerton,<br />\nSergeant-at-Arms. Wednesday's debate was on the advisability of expelling all<br />\nanarchists from this country as the best means of eradicating anarchy.<br />\nThe Musical Clubs have had their annual picture taken. As this year the<br />\npicture will be used on 1500 posters, extra care was employed to get a satisfactory group.<br /><br />\nY. M. C. A. NOTES.<br />\nHE Week of Prayer for young men was observed last week with daily<br />\nservice in Levering Hall, from 1 to 1.20. Monday, Dr. Vincent spoke<br />\non \"The Reciprocal Relation of Learning to Religion;\" Tuesday, Dr.<br />\nGreene, on \"The Danger of Spiritual Neglect;\" Wednesday, Dr. Henry Wood,<br />\non \"True Christian Realism;\" Thursday, Dr. Brush, on \"Honesty;\" Friday,<br />\nDr. Steiner, on \"Overcoming.\"<br />\nThe week of service was opened on Sunday by an inspiring address from<br />\nRev. Oliver Huckel, on \"Spiritual Realities.\"<br />\nThe average attendance for the week was 25.<br />\nMr. Robert E. Speer is expected to address a mass meeting of students on<br />\nSunday, January 19th. Further notice will be given later.<br />\nThe regular monthly meeting of the Executive Council was held Wednesday, November 13, at 5 P. M. About thirty new members were elected.<br />\nThe State University of Iowa and McGill University are both campaigning<br />\nfor Association buildings.<br />\nSo cold was the night,<br />\nAnd her cheeks wore cold too<br />\nThough it wasn't quite right,<br />\nSo cold was the night<br />\nAnd so sad was her plight;<br />\nThat I—well, wouldn't you?<br />\nSo cold was the night,<br />\nAn her cheeks wore cold too.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n11<br /><br />\nFOOT BALL SCHEDULE. .3t<br />\nNOVEMBER 23.—J. H. U. vs. St. John's, at American League Park.<br />\nPark.<br />\nNOVEMBER 28.—(Thanksgiving Day), J. H. U. vs. U. of M., at American League<br /><br />\nHOPKINS, 27. DELAWARE, 0.<br />\nATURDAY, November 9th, the Hopkins team covered itself with laurels<br />\nand caused many loyal hearts to beat faster, when she downed the Delaware College eleven in Wilmington by a score of 27 to 0. Too much<br />\ncannot be said in praise of the magnificent work done by the team as a whole<br />\nand by the individual players. And, add to this the fact that IIaverford, which<br />\ndefeated our boys only a week previous in the hottest contest of the season by a<br />\nscore of only 5 to 0, had been defeated by the Delaware lads earlier in the<br />\nseason, every Hopkins \"rooter\" has just cause to be proud of the men who<br />\nwear the Black and Blue.<br />\nTo be sure, Delaware was seriously weakened by the absence of Huxley,<br />\ntheir regular captain, and a few more of their men, but where were Garwood<br />\nand the other Hopkins men who had done so nobly in the Haverford game?<br />\nEverything taken into consideration, the teams were well matched both in<br />\nregard to weight and science, and all that our boys have achieved, they have<br />\ndone on their own merits and to them all the praise is due.<br />\nFor Hopkins, it would be difficult to single out one man who did more than<br />\nanother for the success of the team. The backs played the game, and Gillespie<br />\nand Houghton went around the ends each time for a gain. Only twice during<br />\nthe game was the oval in the possession of their opponents. For Delaware,<br />\nLawton kicked well, and gained much time by the clever placing of the ball in<br />\nthe second half; Cann, at right end, showed remarkable skill; Wilson did<br />\nexcellent work back of the line, and Marshall, a new man, made several<br />\nbeautiful tackles.<br />\nIn the first half, after eight minutes of play, Gillespie circled the right end<br />\nfor a touchdown, and in the remaining ten minutes of play, the 'varsity took a<br />\nbrace, and before the referee's whistle blew, Sayler, Gillespie and Faris went<br />\nover the goal line for three more touchdowns.<br />\nHopkins took the kick-off at the beginning of the game, and Blanck downed<br />\nthe man after a short run. Lawton hit the line without effect, and Cooper went<br />\naround right end for eight yards. No more ground could be gained, and Cann<br /><br />\ng<br /><br />\n12<br /><br />\nTHE NEWS—LETTER.<br /><br />\npunted. Upon lining up, Sayler hit right tackle for five yards. Faris made a<br />\nplunge through the opposite tackle for 15 yards, and Gillespie and Houghton<br />\nmade large gains on successive end-around-end runs.<br />\nThe ball went steadily down the field, and Gillespie went around the end<br />\nfor the first touchdown. Sayler failed to kick goal. On the second kick-off Bernheim caught the ball and made a pretty run before going down. Gillespie,<br />\nFaris, and Sayler made end runs of 12, 10 and 18 yards, repectively. End plays<br />\nby the backs and ends came off in quick succession, and Faris circled right end<br />\nfor the second touchdown. Sayler did not kick goal.<br />\nOn the next kick-off Blanck downed the ball, and the first play saw Faris<br />\ncircle right end for eighteen yards. Houghton then showed his ability as a<br />\nsprinter. He was given the ball on the end-around-end play, and made a beautiful run of 40 yards. Gillespie again circled right end for 20 yards and a<br />\ntouchdown. Sayler kicked goal.<br />\nOn the line-up after the kick off, Gillespie repeated Houghton's trick by<br />\nrounding the opposite end for 40 yards. Sayler and Faris did not fail in a<br />\nsingle instance to make heavy gains through the line, and Sayler increased the<br />\nscore to 22 points by hitting right tackle for a fourth touchdown. Only a few<br />\nmore minutes of the half remained, but Blanck, Faris and Gillespie managed to<br />\nadvance the ball about 32 yards before time was called.<br />\nIn the second half, Delaware took a decided brace and the Hopkins men<br />\nwere unable to secure more than one more touchdown. Lawton gained much time<br />\nby cleverly kicking the ball out of bounds each time it came into Delaware's possession. The game ended with the ball in Delaware's 35-yard line.<br />\nThe line up was as follows:<br />\nHOPKINS.<br /><br />\nGilllespie (captain)<br />\nHill<br />\nJones<br />\nCampbell<br />\nYearley<br />\nYoutz<br />\nHoughton<br />\nBernheim<br />\nFaris<br />\nSayler<br /><br />\nDELAWARE.<br /><br />\n1 e.<br />\n1. t<br />\n1. g<br />\nc.<br />\nr. g<br />\nr. t<br />\nr. e<br />\nq b<br />\n1. h. b<br />\nr. h<br /><br />\nPowell, Kyle<br />\nWhorton, Marshall<br />\nSchab urger<br />\nRoberts<br />\nFerguson<br />\nMcCoy<br />\nCann<br />\nHarrington (c.) Wilson<br />\nFrazer, Wilson<br />\nCooper<br />\nTunnell, Lawton<br /><br />\nReferee—Mr. Charles G. Brooke, Maryland Athletic Club. Umpire—Mr.<br />\nGreen, of Delaware College. Timers—J. P. Cann, of Delaware, and J. S.<br />\nGrasty, of Johns Hopkins. Linesmen—W. H. Muley, of Johns Hopkins<br />\nUniversity, and Hessler, of Delaware. Touchdowns—Gillespie (2) Faris, (1),<br />\nSayler (1), and Blanck (1). Goals—Sayler (2). Time—Halves of 18 minutes<br />\n•<br /><br />\nTHE NEWS—LETTER.<br />\nHOPKINS, 11.<br /><br />\n13<br /><br />\nWESTERN MARYLAND, 0.<br /><br />\nN a bard-fought contest, Saturday afternoon, IIopkins gave the annual<br />\nexhibition of beating Western Maryland. When the game started the<br />\n.<br />\nWestminster lads were confident that victory was theirs, and, indeed, for a<br />\ntime the struggle was so fierce, that it seemed as if one team was as good as the<br />\nother, if not better.<br />\n. Western Maryland kicked off to Houghton, who advanced the ball to Hopkins 30 yard line. The Black and Blue now began to hammer their opponents'<br />\nline, and by fierce plunges through the opposite guards advanced the pigskin<br />\n15 yards. The Farmers now took a brace, and the line held like a stone wall,<br />\nso the ball went over. The Hopkinsonians in turn made a solid stand against<br />\ntheir opponents, and after a trifling gain by Western Maryland, again recovered<br />\nthe oval, but lost it on a fumble.<br />\n.<br />\nThe Westminster lads now tried some end runs, but in almost every<br />\ninstance the runner was nailed in his tracks, so that the ball went over on downs.<br />\nSayler was now sent around end for a gain of 10 yards, and Blanck in a similar<br /><br />\n3<br /><br />\nmanner added 5 other yards hereto.<br />\nWestern Maryland, still confident, however, allowed the Black and Blue to<br />\nmake no further gains and the pigskins was lost on downs.<br />\nThe Farmers slowly but steadily pushed the oval back over most of the<br />\nground gained by Hopkins, but were interrupted by Sayler and Garwood, who<br />\nby brilliant tackling, caused Western Maryland to lose on downs.<br />\nThe first half ended with the ball on Hopkins' 30 yard line, where Houghton<br />\ncarried it on the kick-off, both teams having seesawed up and down in a space<br />\nof about 20 yards duringthe entire half.<br />\nIn the second half, Sayler kicked off for Hopkins, and Western Maryland<br />\nbrought the oval to her 25 yard line, and then failing to gain the required distance, punted. Hopkins now began to play ball in dead earnest; Blanck hit<br />\nthe line for 7 yards, and Riggs followed with 8 more. Houghton now got<br />\naround the end at a beautiful rate, but strained his ankle, and was replaced by<br />\nSharretts. Sayler again circled the ends for 20 yards, and Sharretts was shoved<br />\nthrough the line for an additional 8. The Black and Blue now had the ball<br />\nWithin 5 yards of a touchdown, but there they stuck, and the oval was lost on<br />\ndowns. Not discouraged by this, however, Hopkins soon forced her opponents<br />\nto kick, and with a beautiful end run of 20 yards by Sayler, the lost territory<br />\nwas well nigh recovered. With two more line plunges, the pigskin rested on<br />\nthe 3 yard line, and Riggs did the mark. Sayler then kicked a goal.<br />\nWestern Maryland now kicked off and Hopkins began to pound the<br />\nFarmer's line a terrible rate, the latter being unable to hold together in any<br />\nShape whatever. So by long gains through the line, and end runs, the Black<br />\nand Blue soon scored on her touchdown, failing to kick goal, however.<br />\nWestern Maryland again kicked off, and Hopkins was well on her way to her<br />\ntouchdown when time was called, with the ball on Western Maryland's 25 yard<br />\nline.<br /><br />\n1W.<br /><br />\n14<br /><br />\nTHE NEWS—LETTER.<br /><br />\nEveryone is satisfied with the work of the team, and all are confident that<br />\nthe same team can rub it into St. John's next Saturday. Garwood's work is<br />\nwell nigh equal to that of Butler, whose style of play last year was so phenomenal. Sayler should he complimented for his effective work this season, especially in Saturday's game, and what Hill did to Western Maryland's star—<br />\nRoberts—was \"enough.\" Coach Dickson remarked after the game, that the<br />\nfellows helped each other wonderfully. A little more practice in catching<br />\npunts, and we'll have a star team. The rooting, led by Grasty, was the best<br />\nheard this season, and the NEWS-LETTER hopes that all students in the<br />\nUniversity will join the ranks next Saturday to cheer the Black and Blue on to<br />\nvictory.<br />\nThe line up was as follows:<br />\nHOPKINS.<br />\nGillespie<br />\nHill<br />\nGarwood<br />\nCampbell<br />\nYearly<br />\nBacon<br />\nHoughton, Sharretts<br />\nBernheim<br />\nRiggs.<br />\nSayler<br />\nBlanck<br /><br />\nWESTERN MARYLAND<br />\n1. e.<br />\n1. t.<br />\n1. g.<br /><br />\nBurg<br />\nRobinson<br />\nHenry<br />\nWebster<br />\nr g<br />\nWhite<br />\nr t.<br />\nRoberts<br />\nr. e<br />\nByrd<br />\nChaffinch<br />\n••<br />\n1. h b.<br />\nTarr<br />\nr. h. b.<br />\nMarkey<br />\nf. b<br />\nHurley<br />\nUmpire—Prof. Kain, St. John's. Referee—Casler, J. II, U, Timers—<br />\nHoffman, J. H. U., and Davis, Western Maryland. Linesmen—Weil, J. H.<br />\nU., and Williams, Western Maryland. Time—Two 20 minute halves.<br /><br />\nOUR SCRUB TEAM.<br /><br />\nC<br /><br />\nAPTAIN GILLESPIE, of the 'varsity eleven, is to be congratulated for his<br />\nwisdom in appointing a captain of the scrub team, and Captain Winternitz also deserves a vote of thanks for the hearty manner in which he has<br />\ntaken hold of matters and pushed his eleven forward. While the 'varsity was<br />\nadministering a severe defeat to Delaware College last Saturday one week ago,<br />\nthe scrubs were playing their first game against Dunham's Preparatory School.<br />\nCaptain Winternitz had not yet completely organized the team, and the lack of<br />\nsystematic play and unity lost the game by the score of 6 to 0. In the contest<br />\nagainst Marston's Preparatory School last Friday, however, the benefit of a<br />\nweek's practice was plainly shown. For about five minutes in the first half,<br />\nMarston's held her own, and possibly a little more, but then the scrubs got<br />\ntogether, and from that moment on there was certainly \"somethin' doin'.\"<br />\nDickey, Pearre, and Plaggemeyer hit the line in great fashion, and little IIazlehurst toddled around the end for comfortable gains. Dickey made the star play<br />\nof the game, by catching the ball from the kick-off and running through the<br /><br />\nJ<br /><br />\nTHE NEWS—LETTER.<br /><br />\n15<br /><br />\nentire Marston eleven for a touchdown. Toward the end of the game the<br />\nscrubs worked together in great style, and it was this fast, concerted action<br />\nwhich gave them the victory by a score of 16 to 0. The work of several freshmen was conspicuous, and they promise to put up a hard fight when the annual<br />\nclass game with the Juniors comes off. The scrubs usually line up as follows:<br />\nHazlehurst, 1. e.; Riley, 1. t.; Erlanger, 1. g.; Marshall, c.; Ward, r. g.; Custis,<br />\nr. t.; Parsons, r. e.; Winternitz (captain) q. b.; Dickey, Pearre, 1. h. b.; Smith,<br />\nr. h. b.; Plaggerneyer, f. b.<br />\nThe organization of a scrub team is a wise innovation in more ways than<br />\none. In the first place, it adds strength and system to the team which is<br />\ndepended upon to give the 'varsity practice; secondly, it brings out a great<br />\nmany men who would not come out because of their inability to make the<br />\n'varsity; and thirdly, it arouses additional spirit among the freshmen, several<br />\nof whom are on the team. All these results tend to increase our chances of<br />\nwinning the inter collegiate championship in the game with St. John's College<br />\nSaturday afternoon, It is every man's sacred duty to be on hand that day with<br />\na strong pair of lungs in good working order.<br /><br />\nHATSOEVER ye sow so shall ye reap\"—but the man who sows<br />\nwild oats generally raises cain.<br />\n\"After you,\" politely remarked the detective as he deftly fastened the<br />\nhandcuffs upon the wrists of his elusive victim.<br /><br />\nOrt,<br /><br />\nTHOSE SENSIBLE QUESTioNS.<br />\n\"Seasick?\"<br />\n\"Oh no! just casting my bread upon the water to see if it will come back<br />\nbuttered.\"<br />\nMonk—\"Your reverence, our loved brother was broken on the wheel.\"<br />\nBishop—\"Give me the sad details of the torture.\"<br />\nMonk—\"Oh! it wasn't the rack. He just hopped into a roulette game and<br />\nlost a hundred.\"<br />\nI looked into<br />\nHer eyes so blue,<br />\nI loved her well,<br />\nAnd this she knew.<br />\nI tied her shoe,<br />\n(A number two)<br />\nI didn't hurry much,—<br />\nWould you<br /><br />\n16<br /><br />\nTHE NEWS-LETTER.<br />\nWhy doth the Spring Lamb jump about,<br />\nAsked Mary, at a loss;<br />\n\"I think, quoth fond Mama,<br />\n\"It's been dressed with caper sauce.\"<br />\nA green little student in a green little way<br />\nA green little melon ate one day,<br />\nAnd the green little grasses now tenderly wave<br />\nO'er the green little student's green little grave.<br />\nIn April a man hooked a tuna<br />\nWhen asked, \"Shall you land it in June, or<br />\nSome time in July?\"<br />\nHe replied, \"I shall try<br />\nTo land it by then, if not sooner.\"<br />\n\"A rather impetuous Mr.<br />\nCalled on a girl and kr.<br />\nSaid she: .4Go sleau.<br />\nYou're not my beau,<br />\nTo you I am only a sr.\"<br /><br />\nSMITH, DIXON Z. CO.<br /><br />\nDesigning and Cutting by E. Michaelson.<br /><br />\nMIGH1VEL8ON,<br /><br />\nPft•PLii. o<br />\n29-31<br /><br />\nMERCHANT TAILOR,<br />\nPOPULAR PRICES.<br /><br />\nS. Charles St.<br /><br />\nF3altirnore, Md.<br /><br />\nALTERING AND REPAIRING.<br /><br />\n821 rladison Avenue,<br /><br />\nA. H. [MING<br /><br />\nMANUFACTURER OF<br /><br />\nOreeh Ildetter<br />\njfraternitp Jewelry'<br /><br />\n14 AN D 16 SIT. PAUL STREET,<br />\nBALTIMORE, MD.<br />\nPLEASE CALL AND EXAMINE OUR LINK<br /><br />\nMCFORE<br /><br />\nPURCHASING.<br /><br />\nJ. H. ROBINSON.<br />\nMANUPAOTURMS OP<br /><br />\n•FINE• CIGARS.•<br />\nDINALAIR<br /><br />\nIN<br /><br />\nTOBACCO, CIGARS AND SMOKERS' ARTICLES,<br />\nSTATIONERY.<br />\n626 N. EUTAW ST.<br />\nBALTIMORE,MD.<br />\nBaltimore, New York &amp; Philadelphia Papers.<br />\nC. &amp; P. Public Telephone, Madison 1185Y.<br /><br />\nSpecial discount to Students.<br /><br />\nBfILTIMORP., MD.<br /><br />\nThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br /><br />\nN. E. Cor. Charles and Fayette Sts.,<br /><br />\n'Phone, C. &amp; P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br /><br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nMARIA BUIE, D.0.,<br />\nV.-Prest. &amp; Asst. Seo'y.<br /><br />\nW. D. BOWEN, M. D., D. O.,<br />\nPrest. &amp; Mgr.<br /><br />\nhohda<br />\nSilver<br />\ng<br />\nWeddin<br />\nIN GREAT VARIETY<br /><br />\nJACOBI &amp;<br />\n2i43 N<br />\nversmiths.<br />\nJIBNKINS.Sil<br />\nCHARLES<br />\nST<br /><br />\nbos<br /><br />\nJAMES R. PAINV.<br />\nWAFER 8c. CO.<br /><br />\nTHVO. WARNIKR.<br /><br />\nESTABLISHED 1879.<br /><br />\n___<br />\nHenderson's<br /><br />\nb's<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note<br />\nBook<br />\n.s,<br />\nStudent's Stipp!ie<br /><br />\nMadison&amp;floward Sts.<br />\nCertificate of Analysis from<br /><br />\nUMBRELLAS,<br /><br />\nC<br /><br />\nBookseller's and<br />\nUSHING &amp; COMPANY' Stationets.<br /><br />\n34 W. BALTIMORE ST.<br />\nSCHOOL, LAW MEDICAL CLAIISICAL AND M!SCULL AN COUS BOON•<br />\nin Johns<br />\nKeeps constantly on hand the Text Books used<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\n11. R. EISENBRANDT SONS,<br /><br />\nfor<br /><br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br /><br />\nto<br /><br />\nJORDfiM STRBLE11 GO. MIZIa4N7CTVE.<br />\nReads as follows: Samples submitted of<br />\nFrench Iitrandy—no<br />\nadulterants, no coloring,fine quality.<br />\n°port() Port—absolutely pure, of superior quality.<br />\ntlhereV—no coloring or adulterants, absolutely pure wine.<br />\nanitd\"olcrh6k\"9—no Fusel oil, no caramel, strictly pure<br /><br />\n0111—all tests show pure olive oil.<br />\n.der sr4<br />\nstrong. •.netrar—iiatural cider vinegar, strictly pure and<br />\nNix<br />\nound tiptoes—no adulteration, all strictly pure.<br /><br />\n—<br /><br />\nADVERTISING SPACE IN THIS PAPER<br /><br />\nHATTERS, CANES, ETC.<br /><br />\nAgent for Lincoln&amp; Bennett and<br />\nWalter Bernard's London Bats.<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nCAPS<br />\nSilk and Cassimere Hats. tr HOPKINS<br /><br />\nProfs. G. W. Lehman &amp; Son,<br /><br />\nOR<br /><br />\nH. MoMAI NS, 0.0.,<br />\nSoo'y. &amp; Treas.<br /><br />\n201-203 N. CHARLES ST.<br />\nBALTIMORE, MD.<br />\nCharles T. Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br /><br />\nOtto H. Williams,<br />\nVice-President.<br />\nJ. E. Marshall, Asst, Cashier,<br /><br />\nFARMERS &amp; MERCHANTS NAT'L. BANK,<br /><br />\nAPPLY TO<br /><br />\nSouth and Lombard Sts., Baltimore.<br /><br />\nPEARRE E. CROWL COMPANY,<br />\nPUBLISHERS.<br /><br />\nSurplus amd Profits $450,001.<br />\nCapital. $650.000<br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended In accordance with<br />\nbalances and business responsibility.<br />\nCORRESPONDENCE INVITED<br />\nCOLLECTIONS A SPECIALTY.<br /><br />\nLIGHT AND LOM BARD STREETS,<br />\nBALTIMORE, MD.<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nFor Particulars apply to<br /><br />\nA. SCHUMACHER &amp; CO.,<br />\nGeneral Agents.<br /><br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS,GIBRALTEF-2,<br />\nNAPLES. GENOA, ETC.<br />\nBALTIMORE TO BRI1MEN<br />\nDIRP.CT.<br /><br />\nMANDOLIN. GUITAR AND BANJO iJe<br /><br />\nthe IRran5i2Sitiftbpiano CO,<br /><br />\nTsummv my<br /><br />\nC. J. LEVIN•<br />\nwho has made a life study of these nstruments. Mandolin Soloist of National reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br /><br />\nStudio, 331 N. Charles St<br /><br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br /><br />\n9/gen/raiz Studio<br /><br />\nCbicherino, Zrabburp anb tlebster<br /><br />\nSuccessor to Cummins<br /><br />\nBaltimore<br /><br />\nSpecial Discount to Students<br />\nHABERDASHERS.<br />\nShirts, Neckwear,<br />\nUnderwear, Hosiery,<br />\nEtc.<br />\nON SALE THE J. H. U. PENNANTS,<br /><br />\nTHE BLAKE COI<br /><br />\nand all other College Pennants<br /><br />\n203 W. BALTIMORE ST. B. 2 S. LIBERTY ST.<br />\nBALTIMORE, MI).<br />\nClinton P. Paine<br />\nGordon P. Paine<br /><br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange ,<br />\nChicago Board of Trade<br /><br />\nCLINTON P. PAINE dr CO.,<br />\nBANKERS at BROKERS<br />\nPrivate Wires to<br />\nNew York and Chicago<br /><br />\n11Stanos.<br /><br />\n.0<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br /><br />\n0.&amp; P.'Phone 2322-2.<br /><br />\nFactory Prices<br /><br />\nSMITH'S SCHMT&amp;BggiAEGE<br />\nOLD<br />\nBOOK<br />\nSTORES.<br />\n3rd<br />\n805 N. HOWARD STREET,<br />\ndoor from Madison.<br /><br />\nBOOKS<br /><br />\nOLD AND NEW<br /><br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City<br />\nBooks Bought, Sold and Exchanged<br /><br />\n217 E. German Street<br /><br />\nBALTIMORE, MD.<br /><br />\nThe Chas. Willms Surgical Instrument Compaq<br />\nBENJ. A. NirLSON, W[141'1. MAINAOER<br /><br />\nWM. V.PIPPEN,<br />\nJ. Wm. Middendorf,<br />\nA.J. RobbIns.<br /><br />\nBaltimore, Md.<br /><br />\nDrovers and' Mechanics National Dank,<br />\nOF BALTIMORE. MD.<br /><br />\nVaniters &amp; Iirohere.<br />\nCONTINENTAL TRUSI CO. BUILDING,<br />\nMembers<br />\nBaltimore Stock Exchange.<br /><br />\nYOUR EYLS<br /><br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br /><br />\nB. G. EICHELBERGER,<br />\nENGRAVING AND STAMPING.<br />\naOtS r**Ic, t<br />\n1-1 est x-1 atm.SSt.,<br />\nY. M. C. A. SUILOING,<br />\nC.&amp; P. and Md.'Phones.<br />\nBALTIMORE, MD.<br /><br />\nU ON<br /><br />\nTHINK IT OVER.<br /><br />\nSAYRE OPTICAL COMPANY,<br />\n921 North Charles Street. (Masonic Temple.)<br /><br />\nIVOIMINING OPTIGIFONS.<br />\nTHE NEWS LETTER<br />\nis from the Press of<br /><br />\nBaltimore, Md.<br /><br />\nBOOKS AND STATIONBRY<br /><br />\nCapital Stock, $300,000.<br /><br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br /><br />\nA. H Rutherfoord.<br />\nF. Lentz.<br /><br />\nJ. WM, MIDDENDORF &amp; Co.<br /><br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Miorosoopes and Accessories.<br /><br />\n300 N. Howard St.,<br /><br />\n605 N. Eutaw Street.<br /><br />\nJftS. Ft. DOWNS,<br />\n229 N. Charles St.,<br />\nMASONIC TEMPLE.<br /><br />\n=:=<br /><br />\nFOR Class, Fraternity and College Stationery,<br />\nBanquet Cards, Invitation, Diplomas,<br /><br />\nPrograms, Visiting Cards, etc<br />\nOur 50o J. Ii. U. Bins and Black Flag Paper—now rsaillg<br /><br />\nThere Is very little entertainment at home withoiit a Plana<br /><br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nLight and Lombard Streets,<br /><br />\nBALTIMORE<br /><br />\nWe carry a full line of Students' Note Books and StatIonery<br />\nBoth 'Phones.<br /><br />\n5ITIEF<br />\nPIANo9 s<br />\nIre The Best.<br />\nN.<br /><br />\nLibertu St.<br /><br />"}], "field_media_file": [{"target_id": 36205, "display": null, "description": null, "target_type": "file", "target_uuid": "31e74e8d-ff14-42e8-a1e0-fc1223229196", "url": "http://digital.library.jhu.edu/system/files/2022-03/12190-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12190, "target_type": "node", "target_uuid": "d8b51984-f77a-4a75-a261-9c8ab853b850", "url": "/node/12190"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "fa0a9b7f-7361-4dab-9b89-739730d8baa5"}]}