{"mid": [{"value": 37511}], "uuid": [{"value": "828b9c25-7874-4ff1-96f2-9929b8e202bc"}], "vid": [{"value": 37511}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:33:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13369-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:33:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:33:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "MBmum<br />\n<br />\nv0l.xXxm, No. 42<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., APRIL 12, 1929<br />\n<br />\nJAY RUNNERS BEAT<br />\nUNIV. OF DELAWARE<br />\n<br />\nCOTILLON CLUB<br />\nURGES ATTENDANCE<br />\nBecause of the fact that<br />\nabout twenty couples arrived<br />\nat the C. E. Hall last Saturday<br />\nnight and left because no one<br />\nwas there, the first twenty couples to arrive before 9.45 will<br />\nbe admitted free tomorrow<br />\nnight. For the late comers the<br />\nprice will be $1.00 stag or couple as usual. The dance will<br />\nbe from 9 to 12 with Os Steinwald furnishing the music.<br />\nJohn -Eldridge, president of<br />\nCotillon Club, announced that<br />\nthere would be some colorful<br />\nentertainment as an added attraction. If the attendance at<br />\nthese Saturday night dances<br />\ndoes not improve they will<br />\nhave to be discontinued.<br />\n<br />\nHOPKINS NETMEN BLANK<br />\nTRUSTEES ARRANGE NEW<br />\nVILLA NOVA RACQUETERS<br />\nSCHOOL OF EDUCATION<br />\n<br />\nPrice 5 Cs<br />\nBARNSTORMER CLUB<br />\nHOLDS ELECTIONS<br />\nThe Barnstormer Club held<br />\nelections at its annual banquet<br />\nlast Saturday night. Those<br />\nelected will go into office at<br />\nthe close of this year and will<br />\nhold the, office for the entire<br />\nfollowing season. As president Bill Banks will be succeeded by Jack Deets while<br />\nthe remainder of the executive<br />\nboard will consist of: Dick<br />\nBerney, secretary; Addison<br />\nCampbell, production manager,<br />\nand Max Sauerwein, business<br />\nmanager.<br />\n<br />\nJAYS MEET PENN<br />\nIN LACROSSE TILT<br />\n<br />\nSecond Shutout for Jays<br />\nSchool to Be for Higher<br />\nin One Week<br />\nStudies in Education<br />\nFormer Hopkins Stars Coaching<br />\nVilla Nova's tennis team was<br />\nDr. Goodnow has announced the<br />\nQuaker Team<br />\nrouted by the Hopkins racqueters establishment at Hopkins of a school<br />\nSchiebel and Morrison Other<br />\nODDS<br />\nFA-Voi-HOPKINS<br />\nlast Tuesday by the score of 7-0. of higher studies in education,<br />\nOutstanding Men<br />\nand<br />\nThe Jays were not extended, only the determination to add two<br />\nPenn<br />\nto<br />\nUse Hopkins Style<br />\ndeOn Tuesday an untried Black and<br />\nof Attack<br />\none match going the limit of three grees to the ones .already bestowed<br />\nBlue track squad journeyed to Newsets. In this encounter, Goldberg, by the universitytr—The new<br />\nTomorrow's game with the Unideark, and decisively defeated theplaying second for Hopkins, lost the grees will be Master of Education<br />\nversity of Pennsylvania lacrosse<br />\ntrack team of the University of Delfirst set to Kelley, 6-3, finally won and Doctor of Education.<br />\nteam should provide Jay fans with<br />\naware by the score of 863/2 to 393/2.<br />\nhe second 7-5, and came back<br />\nample opportunity to judge the<br />\nAs is evident from the titles, these<br />\nThis was the opening meet of the<br />\nstrong to win the third 6-3.<br />\ndegrees will be awarded by the new<br />\nactual strength of the Black and<br />\nseason foi the Jays and marks the<br />\nIn the first match Irons experi- higher school. Arrangements are<br />\nBlue team. Last Saturday's contest<br />\nsixth straight victory of HopkinS<br />\naced-little difficulty in defeating retained by which a student in eduwith the Olympic team showed conrunners in the last six dual meets,<br />\nTowey, breaking the latter'siservice cation may still do his graduate<br />\nclusively that the Jay team has post0-jay Squad having won every one<br />\nin the first game and repeating the work in the Faculty of Philosop<br />\nsibilities far beyond those anticihy,<br />\nof its five dual meets last season.<br />\nfeat several time during the match. for the degree Master of Arts or<br />\npated by even the most rabid HopHelmholtz blanked Lovett, the cap- Doctor of Philosophy, if he prefers<br />\nThe times made in the vatious<br />\nkins fans.<br />\ntain of the Pennsylvanians, in the that to the newly-ordained degrees.<br />\nevents were not startling, for the<br />\nThe Quaker team has an able<br />\nthird set and only allowed him three In that case his work is directed by<br />\nmost part, the marks being rather<br />\nApplicants Must File Petitions coach this year in the person of<br />\ngames in the second. Captain the Board of University Studies.<br />\nmediocre in quality, but:ailowance<br />\nat Early Date<br />\n\"Happy\" Middleton, Hopkins star<br />\nAnnual Junior Affair Takes<br />\nBrockman and Gump completed the The move was voted by the trusmust be made that thisT is the first<br />\nNovel Motif<br />\nHIGHEST AWARD GIVEN of a few years ago. This is Midrout.<br />\ntees Monday. The advisory board<br />\nreal test the team has had this year.<br />\ndleton's first year at coaching and<br />\nThis match marked the second is to consist of Dr. Goodnow, Dr. Larkin Farinholt, Hopkins Man,<br />\nPOSTER CONTEST<br />\nAn analysis of the different events<br />\nif reports from Philadelphia can be<br />\nconsecuti<br />\nElected<br />\nve<br />\nblanking<br />\nLast<br />\nYear<br />\nwhich the Jays Edward T. Buchner, Professors_<br />\nshows that the decisive winning<br />\nParty Takes Place May 4<br />\nrelied upon, he is making quite a<br />\nhave hrded their opponents, the Florence Bamberger, Fowler D. The 1929 election<br />\nat Lehmann's<br />\nmargin was piled up in the races,<br />\nof Rhodes success of hi%dgiitial venture into<br />\nUniversi<br />\nty of Delaware being the Brooks, David Weglein, George Scholars will be held<br />\nthe field men just breaking even in<br />\non December that line of enlireavor. In addition<br />\nThe Junior Dance Committee has<br />\nother whitewash victim. The Uni- Burnett, Neil Gordon, S. Buford 7, and students,<br />\ntheir departments.<br />\nof this college or to Middleton, Norman Robinson<br />\nformulated plans for their annual<br />\n,<br />\nversity of Virginia and Washing- Johnson, H. Carrington Lancaster, university must<br />\nfile their applica- captain of the Jay team three<br />\nmasquerade dance. The affair is<br />\nMorrison Stars<br />\nseaton and Lee have also fallen prey and Kemp Malone. Admission is tions with the<br />\nSecretary of the State sons ago, is aiding in the<br />\nMorrison's performances in the scheduled for Lehmann's Hall, Satcoaching<br />\nto the Jay netmen.<br />\nrestricted to teachers, supervisors, Committee of Selection before Oc- of the<br />\ndashes were distinctly heartening, urday, May 4, from 9:30 to 1:30<br />\nPenn' team. With a former<br />\nSummary: Hopkins 7, Villa and administrators with<br />\nthree years' tober 19, according to a recent an- defare4 star and attack star<br />\nand this frosh should develop into A. M. It has'been decided that the Nova<br />\nas<br />\n0.<br />\napproved experience and, in most nouncement from Frank Aydelotte, coaches it<br />\none of the best dash men Hopkins theme of the ball will portray Irons<br />\nis probable that the Quakdefeated Forvey 6-3, 6-1. cases, a college degree.<br />\nAmerican Secretary to the Rhodes er team is being<br />\nhas possessed.<br />\n\"Hell\" with the appropriate title Goldberg<br />\ntutored in much<br />\ndefeated Kelley 3-6, In accordance with the regula- Trustees and President of Swarththe same way that Hopkins teams<br />\nIn the middle distances, Perry \"Junior Hell Party.\" Fitting cos- 7-5, 6-3.<br />\no<br />\ncn<br />\ni<br />\ni<br />\nt<br />\nu<br />\nn<br />\ni<br />\nsd<br />\n,<br />\ne<br />\nt<br />\nq<br />\nw<br />\ner<br />\nu<br />\noi<br />\nm<br />\nar<br />\nry<br />\ne<br />\nee<br />\ns<br />\nn<br />\n,<br />\nt<br />\ns<br />\no<br />\nh<br />\nfor<br />\nr<br />\ne<br />\nf<br />\neg<br />\nt<br />\ne<br />\neg<br />\nd<br />\nol<br />\nr<br />\ne<br />\ni<br />\nCollege.<br />\ne_<br />\no<br />\n_m<br />\nAre<br />\nd<br />\ne<br />\ns<br />\nare.<br />\nand Yellott were successful in the tumes will represent any personages Helmholtz defeated Lovett 6-0,<br />\nWalkover Last Year<br />\nRhodes Scholarship, the most<br />\nquarter and half mile runs. Their possibly in \"Hell\" from the time of 6-3.<br />\nprepared students and three years<br />\ncoveted of all undergraduate awards, The game last year with the Penn<br />\ntimes will have to improve in both Eve to the present day Venus, so a<br />\nBrockman defeated Dooling 6-2, for others.<br />\nentitles the holder to two years of team was nothing short of a walkof these events if they are to be con- broad choice of dress is permissible. 6-0.<br />\nstudy<br />\nPrevious<br />\ndances,<br />\nat Oxford University, with over for Hopkins. The ball was selclass<br />\nby<br />\nthe<br />\nhave<br />\nsistent winners this year.<br />\nWarfield defeated Boyle 6-1, 6-2.<br />\nBanquet Season to<br />\nan annual stipend of /400 (about dom in the possesion of the Penn<br />\nbeen highly interesting and enjoy- Irons and<br />\nHelmhokz defeated<br />\nCaptain Schiebel had the mile and able and the committee is trying to<br />\nTest Class Spirit $2,000). If, at the end of the sec- attack and when they did get it their<br />\ntwo-mile ruiii 'sewed up\" from the make this one the best ever, even Forvey and Boyle 6-2, 6-2.<br />\nBeginning April 11, with the Jun- ond year the scholar presents an ap- efforts were short-lived. This<br />\nBrockma<br />\nn<br />\nand<br />\nGump<br />\ndefeated<br />\nyear,<br />\nstarting gun. Miller turned in a hoping to eclipse the fame of the<br />\nior banquet, the season of real class proved plan for an additional year however, with<br />\nan attack which is not<br />\ncreditable perforinance in the two- \"Pow-Wow\" of 1928 and the Kelley and Dooling 6-4, 6-1.<br />\nspirit will start. The class battles of study, the Rhodes Trustees will<br />\nas experienced in \"riding\" the demile run to finish in a dead heat \"Pirates' Ball\" of 1927.<br />\nand class kidnaping will be in vogue. then extend his scholarship to cov\"The Contrast\" to Be<br />\nwith Schiebel: Of Particular interThose on Committee<br />\nLast year, even-with the restric- er a third year. Rhodes Scholars fense as was last year's, the situaest in this long race was the work<br />\nThose on the committee are:<br />\nAt Playshop Tonight tions placed upon the classes by the are elected without examination on tion will be materially altered. Then,<br />\nof Hancock, a freshman, sunning Stewart Smith, chairman; John \"The Contrast,\" by Royall Tyler,<br />\nStudent Council, there were several the basis of their records in school too, the Pennsylvania team has<br />\nhis first college race. He sprinted Norris, William Swope, George will be repeated tonight and Mongood fights, some daring kidnaping, and college, and no restriction is showed steady improvement during<br />\nthrough the best part of the last Gump, William Parker, and Sweet- day at the Homewood Playshop. and<br />\nmore than a little blood shed. placed upon their choice of studies. the past few years and with the<br />\nable<br />\nlap to pull up out of the nick, and s& Linthicuni. Arrangements are The play has been running since<br />\nTo be eligible a candidate must coaching mentioned should<br />\nThis year all restrictions are renearly annex third place.<br />\nput a<br />\nnow,being made for decorations, re- Wednesday.<br />\nmoved except the two laid down be an unmarried male citizen of the team on<br />\nthe field which will be on<br />\nfreshments, entertainment, etc., and \"The Contrast\" has been called<br />\nHershey Wins Tisk.<br />\nthat there must be adequate police United States, between the ages ot<br />\nabout even terms with the Jay<br />\nHershey was victorious in both further information concerning the first American comedy since it protection and that the classes,<br />\nnineteen and twenty-five, and must<br />\nand<br />\ntwelve.<br />\nthe hurdle xaces. While neither one these will be announced shortly. Al- is the first written by an American not the college, are<br />\nresponsible for have completed at least his SophoTrick Play<br />\nof them, were especially fast, they though the expenses- will be more and having its premier in this coun- all arrangements,<br />\nmore<br />\nyear<br />\nin<br />\ncollege<br />\nbefore<br />\ndamages<br />\nand<br />\nthe<br />\ntime Pennsylv<br />\nother<br />\nania's specialty this year<br />\nwere distinctly heartening from the than double those of previous occa- try. The play was written in 1787 incidentals; and also the<br />\nhe<br />\ngoes<br />\nto<br />\nOxford.<br />\nHe<br />\nmust then<br />\nunwritten<br />\nis the so-called \"brush off\" play.<br />\nway he refused to be worried at the sions, it is felt that no increase in and the scene is laid in New York rule that no track or<br />\nlacrosseman be one of the men chosen to repreof that period. The action covers can<br />\nslight.early lead gained by his com- price will be necessary.<br />\nbe kidnaped or can take part in sent this institution in the competi- This is the type of play which Jay<br />\nNaar<br />\nPrim<br />\nfive acts and the cast will be cospetitors, continuing on in gdocl style<br />\nthe catching of members Of the oth- tion. Scholars selected on Decem- teams for- the past ten years have<br />\nAn innovation this year will be a tumed in appropriate colonial<br />\nto win.<br />\ndress. er class.<br />\nber 7, 1929, will go to Oxford in been (frilled in<br />\nposter contest open to everyone and The members of<br />\nand a type of play<br />\nEnglish V, an<br />\nOctober. 1930.<br />\nDorman, giant frosh from quite a few of the campus artists<br />\nIn<br />\nthe<br />\nabsence<br />\nof<br />\nStudent<br />\nwhich has been used very effectively<br />\nCounAmerican Drama class in the Coleil restAction, however, the classes<br />\nFriends School, gave distinct evi- are expected to enter. 'pie first<br />\nThese Scholarships were created by them. This type<br />\nlege for Teachers, are producing the<br />\nof play was ordence of ability in annexing the prize will be five dollars, the second<br />\npay under the direction of their in- have, iii new-born caution, resorted by the will of Cecil Rhodes, the fa- iginated by William C. Schmeiss<br />\ner,<br />\nto self-impdited regulations where- mous South African statesman and<br />\nshot-put and getting third in the dis- three dollars and the third two dol- structor,<br />\nN. B. Fagin. Camilla<br />\nalumni coach of the Hopkins team.<br />\ncus. Caldwell, likewise a f rush, tied lars. Each of. the best ten posters<br />\nBoone has the female lead and Rob- by it is agreed that from six till capitalist, who died in 1902. Their<br />\nfor first place in the high jump, bu submitted will be awarded a ticket<br />\ntwelve P. M. of the days of the purpose is expressed in the terms The play works in this manner': an<br />\nert Warfield has the main male part.<br />\nshould do much better in the future<br />\nrespective banquets there shall be of his will:<br />\na9ack man runs across the mouth of<br />\n)to the dance. These posters will be Other prominent members of<br />\nthe 'no kidnapin<br />\nthan this winning mark.<br />\ng or efforts to disturb \"I also<br />\ndisplayed around the campus and in cast include Roberta Malambi<br />\ndesire to encourage and the goal and as his defense man<br />\n, Ber- the banquet<br />\nin progress.<br />\nseveral stores in the vicinity of the nice Legum, Howard Snyder,<br />\nSloan Delaware Star<br />\nfoster an appreciation of the advan- follows hint across the attack man<br />\nand<br />\nFor Delaware, Cortman, in the college. The best poster will prob- S. Vannort Chapman<br />\nPresident Lockard, of the class of tages which I implicitl<br />\n. The scenery<br />\ny believe will who is playing the' crease steps in<br />\ncentury dash, and Sloan, in the high ably be printed in The Black and is being held<br />\nby William Banks and '31, said the reaspn for the agree- ,result from the union of the Eng- his way and blocks him, thus<br />\nleaving<br />\njump, pole vault, and shot-put, were Blue Jay. All contestants must turn Chapman.<br />\nment was the prevention of undue lish-speaking peoples<br />\nthroughout the his team-mate free to receive<br />\na pass<br />\nthet outstanding performers.<br />\nin their entry to Mr. Meyers, J. 14. Tickets for the play are $1.00 and financial losses to the classes, en- world, and to encourage in the stuand to make a shot at the goal.<br />\nU. post office before 4 P. M., Mon- may be obtained from any member tailed by the rampant breakage of dents from the United States<br />\n.. .<br />\nAltogether the meet served well<br />\nday, April 22. The judges will be of English V or from Dr. John,C. a \"rough-house\" banquet, as has oc- an attachment to the country'<br />\n•<br />\nBig Mem<br />\nfrom<br />\nits purpose of giving an untried Jay<br />\nthe committee, Mr. Meyers, Ser- French. The curtain rises at 8:30 cuffed in hardier years.<br />\nwhich they have sprung, without, I<br />\nPennsylvania has three very big<br />\nteam some experience, and of show- geant Frank and Ben Kolb.<br />\nSophomores will feiSt Monday hope, withdrawing them or their men on its attack this year,<br />\nP. M.<br />\nall of<br />\ning the weak spots on the squad.<br />\nDetails of Contest<br />\nnight and freshmen Thursday sympathies from the land of their whom<br />\nare very fast. With the comspecifica<br />\nposter<br />\ntions for the<br />\nThis Saturday the jays will face one The<br />\nnight. Of course, the scenes of the adoption or birth.\"<br />\nLockard to Preside<br />\nbination of speed and weight added<br />\nbanquets, according to one of the<br />\nof the most formidable opponents are as follows: Size 18x14 inches;<br />\nFurther information and applica- to a working knowledg<br />\nwhite or colors, and<br />\nand<br />\nblack<br />\ncolor,<br />\ne of Hopkins<br />\nOver<br />\n\"Y\"<br />\nNext<br />\nfew<br />\n}ear<br />\ntradition<br />\ns<br />\nstill observed, have tion blanks may be<br />\non their entire schedule when they<br />\nobtained from methods the game<br />\ninformatiOln concerning the dance Officers of the Johns Hopkins Y. not been revealed.. There<br />\nis sure to prove<br />\nhad been Dean's Office or from<br />\nrun William and Mary. The VirPresiAent<br />\nto include as much as the individual M. C. A. for the year 1929-30 were a rumor current that the frosh<br />\nFrank Aydelotte, American Secre- more than interesting.<br />\nginians will invade Homewood with deems necessary, i.<br />\n\"Junior Hell chosen last Tuesday night at the would banquet the<br />\nsame night as tary, at Swarthmore,<br />\nLineup:<br />\nPa. Full ina well-balanced squad, and a few Party\"; Lehmann's Hall; May 4, election supper at the Friends Meet- their rivals, but this<br />\nis now discoun- formation about study<br />\nHopkins<br />\nPennsylvania<br />\nand life in<br />\nstar performers in the dashes and 1929; 9;30 to 1:30 A. M.; reLrss ing House. Edwin Lockard was tenanced. The place of the banquet<br />\nBrownley<br />\nG<br />\nDouglas,<br />\nments. Slogan such as \"Go to He the unanimous choice for president. has been kept silent, but the night Oxford is supplied especially for<br />\njavelin throw.<br />\nHall<br />\nP<br />\n.Magal<br />\nwith the,Junior Class,\" \"Be a Dev- George H. Dowell was elected vice- of the affair any soph interested can American students in Oxford of ToCone<br />\nC.1'<br />\nWarren<br />\nil,\" \"A Hellish Party,\" and the like president, William Olsen, secretary, find the place by trailing any officer day, published under the direction<br />\nKegan (Capt.)...1D<br />\nMcGee<br />\nwould be appropriate. Posters may and Roswell Jones, treasurer. Thir- on the Baltimore police force.<br />\nBULLETIN<br />\nof the Association of American<br />\nSilver<br />\nPaul Cordish was elected<br />\nbe as modernistic as desired but will fy men attended the affair.<br />\nThe main drawback to this year's Rhodes Scholars, by the Oxford Caplan<br />\n3D<br />\nHunt<br />\nEditor-in-Chief, and George<br />\nbe judged entirely on their advertis- President Hall presented the an- season is that neither class president<br />\nUniversity Press,<br />\nCampbell<br />\nC<br />\n(Capt.) Ott<br />\nGettemuller, Business Maning mein. For further information nual report. \"Levering Hall will be can be a guest of honor at the other New Ir„k City. 114 Fifth Avenue,<br />\nager of the 1930 Hullabaloo<br />\nDukehart,<br />\n3A<br />\nPendleton<br />\ncontestants should communicate ready for occupancy when college class's banquet. Lockard, sophomo<br />\nat the Junior Class Banquet<br />\nre<br />\nGuild<br />\n2A<br />\nGaNung<br />\n803.<br />\nBox<br />\nNorris,<br />\n0.<br />\nopens<br />\nP.<br />\nnext<br />\nJohn<br />\nfall,\"<br />\nwith<br />\nLast<br />\nannounce<br />\nhe<br />\nyear,<br />\na<br />\nHopkins<br />\npresident<br />\nd.<br />\nThe<br />\nman, Larkin Eagan<br />\n, is guarded by his connecheld last night at the New<br />\nlA<br />\nReiser<br />\nTickets will be $2.50 per couple report gave a full account of this lion with the track team. Dukehar prinholt, was selected for the<br />\nHoward Hotel.<br />\nt<br />\nhon- Love<br />\n0.14<br />\nBernheim<br />\nyear's activities of the \"Y.\"<br />\nor $2.00 stag.<br />\nis protected by lacrosse.<br />\nor and is now working at Oxford. Lyons<br />\nIH<br />\nEdwards<br />\nUntried Black and Blue Squad<br />\nScores 861<br />\n/<br />\n2 Points to Win<br />\nHERSHEY HIGH SCORER<br />\n<br />\nJUNIOR COMMITTEE IS<br />\nARRANGING HELL DANCE<br />\n<br />\nRHODES SCHOLARS<br />\nTO BE ELECTED<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 12, 1929<br />\n<br />\n2<br />\n<br />\nTHE D. A. R.<br />\nBy \"BEN<br />\n<br />\nTIILIS110MSIETISIIITER<br />\n<br />\nCA Reliable Tip<br />\nConcernin<br />\n<br />\nThree rather feeble and emaciated imazely one-half of one per cent.<br />\nsoold women were recently walking We inuA at least compliment the<br />\nFOUNDED 1897<br />\nstreet. A friend ciety upon,its solidity.<br />\ndowntown<br />\na<br />\nalong<br />\n2.00<br />\nSubscription<br />\nAs an illustration of our .statewho was with us at the time made<br />\nthat the D. A. R. -has eXe.well,<br />\n1,I<br />\nin<br />\nment<br />\n'<br />\nPosts:450e<br />\nthe<br />\ncomment<br />\nat<br />\n1909,<br />\n3,<br />\namusing<br />\nDecember<br />\ns<br />\nmatter<br />\nan<br />\nsecond-clas<br />\nEntered as<br />\nte the c-uted a right about face as to their<br />\nBaltimore, Md., under Act of Congress November 3, 1879.<br />\n;t must be the D. A. R,E.<br />\nan<br />\nJohns evident unfairness of the egnark, historical ideals, we quote from<br />\nPublished semi-weekly from October to June by the students of<br />\npleasure, a suit from the Hutzler<br />\ntheir<br />\nIn the daily race of business and<br />\nHopkins University.<br />\nit is not entirely without validity, article in the April number of<br />\nlead right at the start.<br />\nsubstantial<br />\na<br />\nyou<br />\nis<br />\nnaively<br />\ngive<br />\narticle<br />\nwill<br />\nThis<br />\nShop<br />\nlost<br />\njournal.<br />\nseemingly<br />\nMen's<br />\nhas<br />\nYoung<br />\nMANAGER, for the D. A. R.<br />\nBusiness communications should be addressed to the BUSINESS MANAGING<br />\nOrPatriotic<br />\n\"Why<br />\nentitled,<br />\nit.<br />\nenough<br />\nwhich<br />\nthe<br />\nupon<br />\nsight of the ideals<br />\nJohns Hopkins University. All articles should be sent to<br />\nOur<br />\nEurma ; other communication.s to the Eorroit-IN-CatEr.<br />\nwas founded and especially its ma- ganizations Should Protect<br />\n$29.50to $59.50<br />\nfreedom. An American Institutions from the<br />\n0100 jor premise, namely.<br />\nThroughTe/ephone<br />\n.organization conceived in Radical- Menace of Radicalism<br />\nTHIRD FLOOR, NORTH BLILDINCI<br />\nthe<br />\nism, nurtured by the spirit of Equal- out the entirety of this harangue<br />\nterm \"Radical- is never clearly deEDITORIAL DEPARTMENT<br />\nity, and born the offspring<br />\nEctitor-in-Chiel<br />\nopen rebellion, it has degeneratt.:,: fined: however, we gain the impresis<br />\nGEORGE E. riANKS, JR., '29<br />\nthe level of a \"Ladies Sewing (T:- sion that a Radical is one who<br />\nHoward, Saratoga and Clay Streets<br />\nheartily in favor of:<br />\nAssistant 3fanaging Editor<br />\ndc\"<br />\nManaging Editor<br />\n;30<br />\nGt-wr,<br />\nGomm<br />\nhome.<br />\nthe<br />\nn<br />\nof<br />\n1.<br />\nDestructio<br />\n'29<br />\nPHIIIP W. NESS,<br />\n- Telephone CAlvert 1234<br />\nThe society,- a sister organiz<br />\n2—Destruction of religion.<br />\nAssociate Editors<br />\nof the D. A. R., was founded .7.<br />\n'30<br />\nBAIRD,<br />\nS.<br />\npatriotROBERT<br />\nnational<br />\nn<br />\nof<br />\nDestructio<br />\n3.<br />\nWrnstzra H. DRIvER, 214<br />\nWashington. D. C., on October 1 I.<br />\nism.<br />\nHOmewood 8040-8041 If you will 1st us do yoter<br />\nJunior Editors<br />\n1890, and even at that early date had<br />\nneat appearance<br />\nYour cloth. will always have that PRESSING<br />\n'30<br />\nJr<br />\nHall.<br />\nPurnell<br />\nAND REPAIRING<br />\nW.<br />\nunfair<br />\nDYEING,<br />\nto.show signs. Of rather<br />\nStewart I.. Sui.th. '30<br />\nbegun<br />\nLEANING.<br />\nsm.<br />\n5—Sociali<br />\nE Poster Dowell,<br />\nWill Convince You\"<br />\nTrial<br />\nLeonard B. Nolley,<br />\nthis'. stateWitness<br />\ntion.<br />\ndiscrimina<br />\n'31<br />\nG...dFlunt.<br />\nRichard<br />\n'30<br />\nSpear,<br />\nPaul W.<br />\n6—Laxity in • marriage and<br />\nPARISIAN TAILORING CO.<br />\nHarwood P. Mullikin. Jr., '31<br />\nment.:\"Any woman may be eligible<br />\nGeorge H. Dowell, '31<br />\n346 E. 33sn STREET<br />\nVOTCe.<br />\nIrving K. Gordon.<br />\nRobert P. Skutch, '30<br />\nthe age of<br />\nof<br />\nIS<br />\nwho<br />\np<br />\nmembershi<br />\nfor<br />\nCorner University Parkway<br />\n'31<br />\nDanziger.<br />\nLewij<br />\nSidney Walk, '30<br />\n7—Promotion of iiiinforality.<br />\nNathan H. Harris, 'n<br />\nwho is descendand<br />\nyears,<br />\neighteen<br />\nPrank Cone. '31<br />\nS—Disrespectful attitude -on the<br />\nGeorge 0. Trattner, 35<br />\nRowland McD, Ness, '32<br />\ned _from an ancestor Who, with un-f•<br />\nj<br />\nColumnist<br />\nloyalty, rendered material a:<br />\nfailing<br />\n9—Etc., etc., etc.<br />\nSTEPHAN E. FITZGERALD, .31<br />\na<br />\nas<br />\nce<br />\nof<br />\nindependen<br />\ncause<br />\nthe<br />\nto<br />\n, It at once becomes evident that no<br />\nrecognized patriot, as a soldier or a<br />\nBUSINESS DEPARTMENT<br />\ndefinition is: .necessary. -Reading<br />\nof<br />\non<br />\nin<br />\n,<br />\nofficer<br />\nsailor, or as a civil<br />\nBusiness 3fanagcv<br />\n- on in the same .article, we<br />\nproths several colonies or states,<br />\n!LARRY 0. SCHLOSS, JR., '29<br />\ntl-.:s astounding bit of informa-.<br />\nfinc:<br />\nviited that the applicant shall be acCiroulation Manager<br />\nAdvertising Manager<br />\nriot.: \"The great mass of citizens<br />\nJ. Roma? Mrs,<br />\nceptable to the society.\" Notice the<br />\nGroom M. GLAZIER, '29<br />\nof the United States, including all<br />\nAdvert-icing Stun'<br />\nlast clause carefully: it is one which social strata, are loyal to the AmerOfice Staff<br />\nAlvin H. Blum. '30<br />\nTheodore A. Fl‘-ukhrr.an. '31<br />\nimportant<br />\nextremely<br />\nbecomes<br />\noften<br />\nGus Burke. '31<br />\nican Government and institutions.<br />\nRandolbh Bothchill. '31<br />\nGeorge S Robertson. '31<br />\nin the question of qualifications.<br />\nJohn A. Jamieson. '31<br />\nThey have no sympathy with the<br />\nSidnfy Rafted. '31<br />\nLyle Er Galley. '310<br />\nAs prOof of the statement, some- preachments.' of the 'wild-eyed rad<br />\nDavid S. 871.14 '22<br />\nHenry V. Saunders. .n<br />\ntimes denied, that the D. A. R. is the seals who conic here from gory<br />\nSouth Streets,<br />\noffspring of an open rebellion. we scenes of license and ruin abroad<br />\nProduced by The Read-Taylor Company, Lombard and<br />\nBaltimore, 51d.<br />\nRIDE THE STREET CARS<br />\noffer 'the following; \". . member- to spread the doctrine of anarchy.<br />\nare<br />\nwho<br />\nthose<br />\nto<br />\nrestricted<br />\nis<br />\nship<br />\nBut if the loyalists remain passive<br />\nlineal descendants of an ancestor and perversely refuse to recognize<br />\nTHE MOST ECONOMICAL<br />\nesin<br />\nthe<br />\nwho . .. actually assisted<br />\nthe danger. the propagandists will<br />\nMEANS OF TRANSPORTATION<br />\ntablislunent of American independ- gain a foothold here which will -re•-•<br />\nence by service rendered during the quire in the end a much greater efWar of the Revolution. becoming . fort to drive them out. Let every<br />\nUNITED RAILW1VYS4,ELECTRIC CO.<br />\nthereby liable to Conviction of trea-. officer of the law be<br />\nwatch; let<br />\nOF BALTIMORE<br />\nSIGHS<br />\nOF<br />\nE<br />\nTHE BRIDG<br />\nagainst the government of Great all patriotic Americans be alert.\"<br />\nsolemn<br />\nin<br />\nBoard;<br />\nnity<br />\nInterfrater<br />\nthe<br />\nBritain.\"<br />\nnot<br />\nare<br />\nwe<br />\nthat<br />\nafternoon,<br />\n,Please understand<br />\nMONDAY<br />\n1 ::ze 3. C,-! 3<br />\n)<br />\niession assembled, decided to discard the traditional \"baseball\"<br />\nIn. the face of such clearly exduring the<br />\nseries iE favor of a panhellenie bridge tournament. Thus,<br />\nthe D. A. R.<br />\nsentiment<br />\npressed<br />\ntrans.<br />\nbe<br />\nto<br />\nare<br />\nactivities<br />\nverdan4 spring season, fraternity athletic<br />\nletter<br />\ndevotes itself to such paral<br />\nHave you trhosen<br />\nferred from the diamond to tlpe parlors of the xarious Greek<br />\nburlesque<br />\nworks as erecting monument, societiois. Instead of watching and playing the hilarious<br />\ntradition,<br />\nUniversity<br />\na<br />\nformed<br />\nyour life work?<br />\nand<br />\nhave<br />\nhires<br />\nyears,<br />\nnar,<br />\nfor<br />\nRevolUtio<br />\nwhich,<br />\ngames<br />\nbaseball<br />\nGreeks<br />\nTEE teld 'of health service The Harfraternity sports circles will be treated to the sight of four<br />\n\"black-lE<br />\nwill<br />\nDental School--the o:dthey<br />\nvard<br />\nUnisersity<br />\nfumes,<br />\ntobacco<br />\nwith<br />\nat a /bridge table. In a room, reeking<br />\nest dent., school connected with any<br />\nan,.. :e of -the ,fant<br />\nThe<br />\naces.. ,<br />\n..aivses,t>-r. the UnAed Starts,-offers<br />\nsit 'ilentIy finessing ten spots and trumping their partners<br />\ncourses in at<br />\nthorough<br />\nwell-halanced<br />\n.<br />\none of thel'nl.ranches of dent,try. All modern equipment for-vVracticai work under superco<br />\nnfortunately, the editor does not have the privilege of attending<br />\nsociety<br />\nthe<br />\ndisastro-s<br />\n—<br />\nthe<br />\npiofession.<br />\nin<br />\nhigh<br />\nat<br />\nmen<br />\nvision<br />\nstimulate meetings of the board nor does he enjoy the intellectual<br />\n/-Write tor Stints tad admistient requirehave done, f t it has reacted grea::<br />\nthat<br />\notnits to Leroy M. S. Mitre, Dews<br />\non of hearing the discussions of the wise men which comprise to<br />\nto the organization's disadvantage •<br />\nHARVARD UNIVERSITY<br />\norganization. Thus, he did not have the opportunity of ligening<br />\nDEN rAL SCHOOL<br />\ncontinuing<br />\nand has served to center the<br />\nthe various pros and cons regarding the advisability of<br />\nBoston. Mass.<br />\nLongwood Ave.<br />\nas a casual<br />\nmerest of Many upon, the so,ciy,<br />\nthe playing of the annual baseball tournament. However,<br />\nmost<br />\na<br />\nbeing<br />\nmaking the best c<br />\nin<br />\nt<br />\nbystander, the decision of the Greeks impresses him as<br />\nitself.Bu<br />\nof only<br />\nsenseless and ridiculous procedure. A bridge tearn, consisting<br />\nregrettable occurrence the D.<br />\nmembers to<br />\nPeabody Book Shop<br />\ntwo players, certainly permits very few of tge -chapter<br />\nshowed good judgment. The<br />\ncard<br />\natthe<br />\nsession<br />\na<br />\ndoes<br />\nNor<br />\nproclivities.<br />\n913 N. Charles<br />\n\"athletic\"<br />\nexercise their<br />\nfans:<br />\nwho was resvinsible for<br />\ntables provide a very interesting entertainment for the \"sports\"<br />\nL<br />\nMOTOR !AN<br />\ninterfra,<br />\nan<br />\ncampus,<br />\nwas<br />\nlist of taboo individuals<br />\nIf baseball has log its appeal on the Homewood<br />\nwould have<br />\nquently expelled and the question!<br />\nALL NEW<br />\nternity tennis tournament track meet or lacrosse league still relish<br />\nOpen<br />\nbeen a far more appropriate substitute. Or if the -Greeks<br />\ndied a natural death. A striking exPublications<br />\nwith ,a<br />\nEvenings<br />\na taste for the diamond sport but fear the dangers of playing<br />\nthe<br />\nwhich<br />\neffect<br />\nof<br />\nlack<br />\nthe<br />\nof<br />\nample<br />\nLess 10%<br />\n—<br />\nfor<br />\ninstituted<br />\nhard baseball, let a seriei oreplayground ball games .be<br />\nSolve This One and Win a Prize<br />\nBlack-list and the ensuing turmoil i<br />\nthe tiny tots.<br />\nhad upon the membership of the so-.!<br />\n-NR.- RASNEC ANSEN RTF1TH\"<br />\nchapthe<br />\naround<br />\nhowls<br />\nwind<br />\nthe<br />\n, During the winter season, when<br />\nia Britannica. 32 volt in is<br />\nciety is shown by a \"comparative Encyclopaed<br />\nrubber<br />\nHERMAN M: COHN, MGR.,<br />\na<br />\nhearth,<br />\na,<br />\nfor<br />\n045.00.<br />\nnew,<br />\nroom<br />\nedition.<br />\nliving<br />\n13th<br />\nthe<br />\nin<br />\nvols.,<br />\nCrackles<br />\n'fire<br />\na<br />\nter house roof and<br />\nJos, Xi'. Brooks '<br />\nE., Co.,<br />\nregistration table\" as published in!<br />\nwith its<br />\n'<br />\nof bridge is a very pleasant divertissement. But the Spring,<br />\nA.<br />\nD.<br />\nthe<br />\nThe<br />\nof<br />\n'<br />\nLIFE<br />\nNT<br />\nnumber<br />\nactivities.<br />\n213 'St. Paul Place<br />\nDEPARTME<br />\nthe February<br />\ngreen grass, warm sun and balmy air, calls for outdoor<br />\ncards<br />\nplaying<br />\nof<br />\npack<br />\nthe<br />\ntumors<br />\nthe<br />\nand<br />\nR..journal. 'Despite<br />\nTEACHERS WANTED<br />\nbridge table is left folded in the corner<br />\n0<br />\nMen anl wxneti vlfo - `ane plannino<br />\nwholesale withdrawals, we find<br />\ngathers dust-on the mantel.<br />\nto teach in .secondary sehools IVcolleges should write or call.gradsthese facts,<br />\nfrom October 31, 4928,- to Noyen:We suggest that the Interfraternity Board examine •<br />\nhave placed many 'Hopkins<br />\nher 30; 1928, which,--we believe. BT.,<br />\nponder on these thoughts and reconsider their action.<br />\nTHE BALTIMORE TEACHERS'<br />\n•<br />\nthe period of greatest strife, the tc.-AGENCY<br />\n402-3,ItTitle Annex Bldg.<br />\ntal loss in membership was approx-<br />\n<br />\n•-<br />\n<br />\nYOUNG MEN'S SPRING SUITS<br />\n<br />\nHUTZLrK 5FOTHE3<br />\n<br />\nqi-<br />\n<br />\n.<br />\n<br />\n\"One<br />\n<br />\nAfter the Dance<br />\nerr; Ir9EGIS<br />\n<br />\n. 1815-17 North Charles St.<br />\n<br />\nEDITORIAL COMMENT<br />\n<br />\nO<br />\n<br />\nM11—<br />\n<br />\n*011<br />\n<br />\nWantto really<br />\n<br />\n_ .6uy<br />\nBET HEHWON°DER E<br />\n_<br />\n<br />\nSOMETHING OUGHT TO BE DONE<br />\nOME munificent philanthropist, who wishes to win the undying<br />\ngratitude of the University, should establish a fund for the<br />\neducational<br />\nlaunching of a much needed publicity campaign. This<br />\nspelling<br />\ncrusade would endeavor to instruct the public in the correct<br />\nHopkins was<br />\nof Johns Hopkins' Christian name. Even though Mr.<br />\ndubproperly christened Johns, our great American publicinsists on<br />\nUniversity post<br />\nbing him JOHN. Much of the mail received at the<br />\nthe otherday,<br />\noffice is addressed with no regard to the final \"s\". Just<br />\nMemorial<br />\nwhile strolling about the Commons Room of the Alumni<br />\nseveral<br />\nHall, we were greatly distressed and horrified to note that<br />\nJOHN<br />\n.of the magazine covers were imprinted with the inscription,<br />\nHOPKINS.<br />\nHerThis proposed educational campaign will doubtless prove a<br />\nassumed such<br />\nculean task. We fear that the insidious practice has<br />\nand<br />\nmagnitude as to require the expenditure of thousands of dollars<br />\nto rectify this<br />\nthe employment of hundreds of press agents in order<br />\nsome<br />\nuniversal error. Nevertheless, we do not despair, of finding<br />\na cause.<br />\nworthy<br />\nso<br />\nto<br />\ncoVitribute<br />\nwillingly<br />\nwould<br />\nwho<br />\ndonor<br />\ngenerous<br />\ncontinue to<br />\nMeanwhilei_those affiliated with the University inist<br />\nspoken-wince and experience nausea when they hear the blasphemy<br />\n<br />\nSAMUEL KIRK & SON, INC.<br />\n<br />\nYou Shall<br />\nSOT Pass!<br />\n<br />\nFounded 1815<br />\n<br />\n—<br />\n<br />\nBaltimore, Md.<br />\n<br />\n421 North Charles St.<br />\n<br />\nWrist Watches for Men<br />\nGOLD JEWELRY<br />\nDIAMONDS<br />\nSILVERWARE<br />\n<br />\nNo \"Personality\" shall pass this spice without knowing<br />\nthat here he can have his clothes tailored to his personal<br />\nrequirements • • • by nationally famousi college style<br />\nauthorities • • • at a mighty saving, because he buys here<br />\nfrom the Tailor Direct, with no middleman's profits added.<br />\n<br />\nAt Your Service 24 H\\urs a Day<br />\n<br />\ncMayflowet-<br />\n<br />\nCab Co.<br />\n<br />\nINCORPORATED<br />\n<br />\n1718 N. Charles Street<br />\n<br />\nKnown\"<br />\n<br />\n20c FIRST HALF-MILE<br />\n10c each additional Half-Mile,<br />\nor fraction thereof<br />\nThe above rate applies for I to 4<br />\n<br />\nCOMPARE!<br />\nVErnon 4090<br />\n<br />\n-<br />\n<br />\n-Nationally<br />\n<br />\npassengers<br />\n<br />\nSte. et HooitsooJ Fuld<br />\n<br />\nu,tly<br />\nFamous\"<br />\n<br />\nCLOTHES FOR COLLEGE MEN<br />\n-i N. Howard St.<br />\nand\"s'Ird<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 12, 1929<br />\n<br />\ntte<br />\n<br />\nTEAM<br />\n<br />\nTHE NEW<br />\nHOLLYWOOD SHIRT<br />\nHollywood's latest creation! Black,<br />\nOrange and Blue are the colors.<br />\n<br />\nOvIANNIE (BERG<br />\n\"The Old Boy Himself\"<br />\nNORTH & MARYLAND_ AVES.<br />\n<br />\nL. G. BALFOUR CO.<br />\nFraternity Pins<br />\n<br />\nJewelry,<br />\n<br />\nFavors,<br />\n<br />\nNovelties<br />\n<br />\nHOPKINS RINGS.<br />\n1109 Fidelity Bldg.<br />\nPhone CAlvert 1564<br />\n<br />\nALBERT W. RHINE, INC.<br />\n8 N. Calvert St.<br />\n•<br />\n<br />\nPJsers<br />\nPAINTS and VARNISHES<br />\n<br />\nJ. H. FURST CO.<br />\nPRINTERS OF .<br />\n<br />\nPhilological and Scientific<br />\nPublicatipns<br />\n21 S. HANOVER ST.<br />\n<br />\nBALTIMORE<br />\n<br />\nYELLOW CAB STANDS<br />\nAT<br />\n<br />\nHomewood Field<br />\n35th and St. Paul Street;<br />\n31st and St. Paul Streets<br />\nSafe and Efficient Service<br />\nNo Charge for Extra Passengers<br />\n'PHONE<br />\n<br />\nVERNON 1212<br />\n—<br />\n<br />\nFORA<br />\n<br />\nYELLOW CAB<br />\n<br />\nCHAS. CARROLL CLUB<br />\nANNOUNCES PARTY<br />\nIn order to hold a 'social<br />\nmeeting and at the same time<br />\nentertain outsiders, the Charles<br />\nCarroll Club will hold a card<br />\nparty tonight.<br />\nThis function marks the<br />\nfirst of its type on such a large<br />\nscale for the club, and anyone<br />\nis invited. It will be held at<br />\nthe Lord Baltimore Hotel,<br />\nBaltimore and Hanover Sts.<br />\nActivities will begin at 8.30<br />\nP. M. The admission price<br />\nfor a single ticket is 75 cents.<br />\n<br />\nDr. George H. Haynes, professor the victor but the result was that<br />\nof government in the Worcester no decision in favor of either team<br />\n• Is<br />\nPolytechnic Institute, has been se- was<br />\nforthcoming and a draw was<br />\nlected as the lecturer for the Jam@ declared. After entertainment folSchouler Lectureship. Dr. Haynes lowing the debate the team left at<br />\nwill render a series of six lectures 5:30 A. M. the next morning for<br />\nat' the Johns Hopkins University Emory, West Virginia. After a<br />\nate in Prophecy and Fulfillment.\" fourteen-hour trip, they arrived at<br />\nThe six, divisions are as follows: 9:16 P. M.<br />\nI. Wednesday, April 10: \"WritE. sad H. Wins<br />\ning the Specifications for the Sen- Emory and Henry College were<br />\nate.\"<br />\nthe opponents. The Hopkins team<br />\nII. Friday, April 12: \"Setting upheld the negative side of a slightly<br />\nSenate Precedents.\"<br />\naltered question: \"Resolved, That a<br />\nIII. Wednesday, April 17: \"The substitute for the present jury sysand<br />\nMaking<br />\nTreaty<br />\nin<br />\nPart<br />\nSenate's<br />\ntem be instituted.\" The debate was<br />\nNine Initiated<br />\nUnmaking.\"<br />\nheld in the Great Hall and drew an<br />\nApIV. Friday, April 19:\"Who<br />\nInto Cane Club<br />\naudience of, 300.<br />\nMonday. nine undergraduates points Officers of the United<br />\nDebating is quite a prominent acwere tapped in the traditional man- States.\"<br />\nEmory and Henry arid<br />\nner by L. Mosley Walker, president V. Wednesday, April 24: \"Those tivity at<br />\nnearly all the college participates.<br />\nof the Cane C-ltib[, in evidence of Senate Rules!\"<br />\nteams were ushered in to band<br />\ntheir acceptance into that organiza- VI. Friday, April 26: \"The The<br />\nmusic and before the debate a praytion. Afterwards they walked, dis- Changing Senate.\"<br />\ntinguished by their newly-won canes \"The James Schouler Lectureship er was offered.<br />\nand .carnations, down Charles Street was founded by Dr. James Schou- The decision was unanimously opin company with the old tally-ho in ler, of Boston. Dr. Schouler, who posed to the Hopkins team._ Emory<br />\nhich rode the members,of longer had been lecturing at the Hopkins and Henry has won twenty of its<br />\nUniversity since 1891, announced<br />\ntwenty-two debates this season, losThose who were initiated were his intention of founding the lecing only the two contests away from<br />\npenry Redue, Harry Love, William tureship it the university 'in 1908<br />\nSwope, James Willison, Pinckney and endowed $25,000 upon it. The home.<br />\nCraig,- Samuel Howe, Browne Ham first lecture, however, was not pre- The team arrived hc:tne on Friday<br />\nnds, Deely Nice, and Carey Sew- sented until 1909 and has been con- after its three-day trip.<br />\ntinued almost every year until the<br />\nard.<br />\npresent time. The wish was exThe Cane Club is one of the most<br />\npressed by the fOunder that the lec- NOYM5M-aM<br />\npicturesque of student orders at<br />\ntures be given annually if possible<br />\nCOMPLETE<br />\nHopkins, and its seml-annual tapn—<br />\n. . . and that persons of promise or<br />\npings are always affairs of interest<br />\nlecture,<br />\nto<br />\nselected<br />\nbe<br />\nprominence<br />\nA<br />\ntit<br />\nto campus spectators. That its apwho are capable of interesting as<br />\npeal as a spectacle is becoming more<br />\nwell as instructing an audience.\"<br />\ngeneral is attested by the picture of<br />\nthe ceremony published in the Eve- This year's lectures will be given Cs•I<br />\nE<br />\nat 5 P. M. in the Hall of the Civil et.<br />\nning Sun.<br />\nCT[le<br />\nEngineering Building and will be<br />\nR EADopen to the public.<br />\nTAYLOR<br />\nTHE -<br />\n<br />\nDI<br />\n<br />\nMAIL BAG<br />\nPhone, VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to us\"<br />\nTHE RELIABLE WEAVING CO.<br />\nMoth Holes, Burns, Tears, Cuts and Hill<br />\nDamages Made Perfect<br />\n<br />\nDEBATING<br />\nDr. Haynes Speaks<br />\n,<br />\nColumned from Page 4, Col. 3<br />\nfor Lectureship the audience was asked to decide<br />\n<br />\nTHE D. A. R.<br />\n<br />\na<br />\n<br />\nContinued from Page 2, Col. 4<br />\n<br />\nC090<br />\nPlans<br />\nIdeas<br />\n<br />\nArt Vork<br />\nTIParImItivt<br />\nengraving<br />\nembalming<br />\n<br />\nS<br />\n<br />\nMI<br />\n<br />\nirl<br />\n'$100 or $100,000<br />\nHETHER you have $100 or $100,000 to invest,<br />\nwe are interested in helping you to-invest it<br />\nsafely and profitably.,<br />\nGILLET 6' COMPANY has helped,thousands of individuals, banks, insurance companies and Other institutions<br />\nto secure sound investments for their funds and we will<br />\nbe glad to submit definite recommendations most Suitable<br />\nto your own individual requirements.<br />\n<br />\nw<br />\n<br />\nThe executives of GILLET 6' COMPANY are men of<br />\nlong experience in the investment field and are capable of<br />\ngiving sound advice on the important question of investing your money satisfactorily.<br />\n•<br />\nWe cordially invite you to visit our offices and discuss<br />\nyour investment problems with us, or, we shall be glad to<br />\nhave one of our representatives call on you at your convenience.<br />\n<br />\nGILLET 14 Co.<br />\neAlvIKERs<br />\nLIGHT .9 REDWOOD STS.<br />\nBALTIMORE, MD.<br />\n<br />\n.......0<br />\nrre.•1•1 .11,,,D10.•<br />\n<br />\nTelephone Calvert MI<br />\n<br />\nI<br />\n<br />\n`-><br />\nMn Invitation<br />\n,<br />\n<br />\nTo the Johns Hopkins students we extend a cordial invitation to come in and see our beautiful<br />\nhand•wrought Jewelry, our importations of ancient<br />\nand modern gifts. Prices very moderate.<br />\n<br />\nlit<br />\n<br />\nCARL SCHON, INC.<br />\n109 W. SARATOGA ST.<br />\n<br />\nFor Sweaters, Trench Coats, Slickers, Sporting Goods,<br />\nArmy Uniforms and Supphes, also Aviation Outfits, head<br />\nyour airship and land at the<br />\nOUTING SUPPLY CORPORATION<br />\n21 North Liberty Street<br />\n<br />\nWhen Better Used Cars Are Sold<br />\n0('eill Will Sell them<br />\n<br />\nANOTHER OPEN'LETTER TO<br />\ncampaigning for Radicalism; nor do<br />\nHopkins Students have a selection<br />\nM. J. SMULOVITCH<br />\nCALVERT<br />\nof practically all standard<br />\nwe believe that the D. A. R. ought<br />\nisoo•<br />\nDear Mr. Smuluvitch :<br />\n1802.1803<br />\nFolding<br />\nmakes and models<br />\nto support it. We quote the above<br />\n1804• 1805 4794<br />\nbinding<br />\n$100 to $1,000<br />\nMailing<br />\nWE ALSO REPAIR SILK DRESSES<br />\nPlease understand that this reply merely to shpw the very evident<br />\nSTREET<br />\nSARATOGA<br />\n208 WEST<br />\nto your criticism of my article, changes from the organization's rev- :ttof<br />\nBetween Howard St. and Park Ave.<br />\nBUICK COMPANY<br />\nNEILL<br />\n'THE<br />\nBaltimore, Md.<br />\n\"Dreiser,\" is in no way intended. olutionary principals to those of<br />\n'SERVICE<br />\nNew and Used Car Departments<br />\ncoma<br />\nonly<br />\nis<br />\nIt<br />\nSales & Service<br />\nas tin apology.<br />\npresent day Rotarianism.<br />\nMount Royal fs' Maryland Avenues<br />\nStreet<br />\n26th<br />\n500<br />\nWest<br />\nmy<br />\nto<br />\nas<br />\n107 Mount Royal Ave.<br />\nment. Your implications<br />\n•<br />\nPerhaps the moseamuing thing<br />\nNews-Letter\"<br />\n\"The<br />\nof<br />\nquite<br />\nProducers<br />\n\"plagiarism\" are, of course,<br />\nAmerthe<br />\nof<br />\n\"Daughters<br />\nabout the<br />\ntrue. But what of it?' The.only ican Revolution Magazine,\" of<br />\nfault that I can find with' myself which you have already heard, is the<br />\nlies ill the fact that I did,not bring \"D. A. R. Movie Guide.\" This<br />\nout the fact that the article was not short department is.under the guidintended to -be considered as en- ing hand of Mrs. Newton D. Chaptirely my own.. Regardless of your man, who, we are told, is also chairpersonal opinion on the matter, such man of the Better Films Commitwas the case. My neglect was rath- tee. Let us consider a few of these<br />\nDrink<br />\ner regrettable, but that 'is as far as keen reviews; we will find Mrs.<br />\nAlso Dress Shirts, Colldrs,<br />\nI shall go.<br />\nChapman a great humorigt. BenchSilver Studs. Etc<br />\nYou will find accompanying this ley never did anything better than<br />\nSee 'N.-note, another article which, I hope, these:<br />\nDelicious and Refreshing<br />\nwill give your facile pen room for Canary Murder Case, The—ParH. GARLAND HERSHEY<br />\namount. A gripping mystery<br />\ncriticism. Let us hope so.<br />\nYours in expectation,<br />\nsolved by William. Powell as<br />\nAbout Special Price to Hopkins<br />\n,<br />\nthe detective. Children would<br />\nMen<br />\n\"BEN.\"<br />\n•<br />\nprobably not understand it.<br />\nCo.•<br />\nSpit<br />\n`i$ ••-•<br />\nWaldorf Dress<br />\nSUPPORT OF DANCES ASKED Land of the Silver Fox—Warner. A very good Rin-Tin-Tin<br />\nTo the Editor of the Ni.\\\\<br />\nCal. 5344<br />\nA<br />\npicture with Vitaphone effects. .<br />\n•<br />\n.<br />\nDear Sir:—<br />\nfamily.<br />\nwhole<br />\nThe<br />\nby<br />\ndances<br />\n4<br />\nst<br />\nof<br />\nschedule<br />\nsPring<br />\nThe<br />\nLittle Wild rat,' The—Warner.<br />\nthe Cotillon Board. is now in progjudge<br />\nKentucky<br />\na<br />\nabout<br />\nAll<br />\nress. A dance will be held every<br />\nwho hates aviators and his<br />\nONE. SOUL WITH BUT<br />\nSaturday for the students of the \"wildcat\" daughter who fell in<br />\nA SINGLE fliouGHTUniversity, and I would like to use<br />\nsophislove with one. Certain<br />\nTo PAUSE AND<br />\nthis means of making an appeal for<br />\nticated scenes make it unfit for<br />\ntheir support.<br />\nREFRESH HIMSELF<br />\n•<br />\nchildren.<br />\nThe dances can be successful In Old Arizona—Fox. First outAND NOT EVEN A<br />\nBingham, Maine<br />\nstuonly by the attendance of the<br />\ndoor talking picture. ExcelJan. 31, 1928<br />\nGLANCE FROM<br />\nenjoyable<br />\ndents, they can be made<br />\nWhen you've planned a trip for<br />\nlently photographed and acted.<br />\nfishing,<br />\nTHE STAG LINE<br />\nknows<br />\nBecause the bandit is made to<br />\nby the fact that everyone<br />\n,\\<br />\nAnd you've spent a lot of kale,<br />\ngets<br />\n/<br />\nBet the whole of your vacation<br />\neveryone else; so if crowd<br />\nappear 'a hero, this, unfortu-Enough's enough and too<br />\nOn some advertiser's tale<br />\nmuch is not necessary. Work<br />\ntogether and brings those it likes<br />\nnately, cannot be recommended<br />\nAnd you fish a lake of beauty<br />\nthe<br />\nhard enough at anything and<br />\nHidden in a land of dreams,<br />\nthere would be no question of<br />\nfor children.<br />\nsunshine<br />\ngot to stop. That's where<br />\nyou've<br />\nas<br />\nWhere the air is clean<br />\nbeing \"good.\"<br />\nAlias Jimmy Valentine—M. G.<br />\nHaunted by songs of crystal streams. dances<br />\n'<br />\nCoca-Cola comes in. Happily,<br />\ndeyou're<br />\nhas<br />\ninteresting<br />\nM. Intensely<br />\nComes the moment when<br />\nthere's always a cool and cheerful<br />\nAny surplus that the board<br />\ncasting<br />\ndivided<br />\nplace around the corner from anytective story with happy ending<br />\nat the end of the year is<br />\nAnd a smasher hits your line,<br />\nAnd an ice-cold Cocawhere.<br />\ngamester<br />\nthe<br />\n—showing the ennobling influThen you play him like a<br />\nequally between June Week and<br />\nCola, with that delicious taste<br />\nWith the battle going fine,<br />\nis<br />\nover hardened,<br />\ncause<br />\nlove<br />\nof<br />\nence<br />\nthe<br />\nso<br />\nAssociation<br />\nsilence<br />\nand<br />\nAthletic<br />\nand cool after-sense of refreshTill a snag, a yank,<br />\nany<br />\ncriminals. Adults.<br />\nAnd the line is hanging slack,<br />\nment, leaves no argument about<br />\nCertainly worthy enough. And<br />\nWhile you grit your teeth and whistle<br />\n_<br />\nothers,<br />\nto<br />\nquote<br />\ncould<br />\nhas<br />\nwe<br />\ncourse,<br />\nbody<br />\nOf<br />\nwhen,<br />\nwhere—and how—to<br />\nstudent<br />\nthe<br />\nsuggestions<br />\nAnd reel the fishline back.<br />\npause and refresh yourself.<br />\nthe but these, perhaps, will serve. We<br />\nTake the pipe and fill with Edgeworth, offer for the improvement of<br />\ngrin<br />\nV.•<br />\nLight her up and learn to<br />\nhave no fault to find with the D.<br />\nThe Coca-Cola ,Co., Atlanta. ge.<br />\ndances will be gladly considered.<br />\nThen by gum you are elected<br />\ntry A. R., for the society does not inTo the Club of Try Agin!<br />\nare not asking much, only<br />\nWe<br />\nON<br />\nMI LLI<br />\nA. R. M., Jr.<br />\nhow 'bout terest us that much. However, we<br />\nit once. Saturday night,<br />\nDAY<br />\nhave attempted to point out certain<br />\nYOU CAN'T SEA? THE<br />\nit?<br />\nand<br />\ncharacteristic<br />\niftHES<br />\namusing<br />\nPAUSE THA?<br />\nrather<br />\nSincerely,<br />\n,<br />\nmake<br />\ntreason,<br />\nbe<br />\nthis<br />\nIf<br />\nqualifies.<br />\nELDRIDGE,<br />\nGrade<br />\nHigh<br />\nJOHN<br />\nExtra<br />\nTO *HZ<br />\n0 Q 0,P .Lo -0-4T<br />\n. HAD<br />\nthe_most of it.<br />\nPresident, Cotillon Board.<br />\n<br />\nII<br />\n<br />\nLs.)<br />\n<br />\nNEW<br />\n<br />\nTUXEDOS<br />\n<br />\nFOR HIRE<br />\n<br />\n1PA14IE 4A11)<br />\n<br />\nRITRIS-Ift<br />\n<br />\nYIDLIIRAti<br />\n<br />\n1928 Isaac<br />\nWalton Goes<br />\nPoetic Now<br />\n<br />\n\"ea..<br />\n<br />\nEdgeworth<br />\n<br />\nSmoking.Tobacco<br />\n<br />\n\f12, 1929<br />\n1HE JOHNS HOPKINS NEWS-LETTER, APRIL<br />\n<br />\n4<br />\n<br />\n' Collegiate Liberal<br />\nDEBATING TEAM TAKES<br />\nConference to Be Held<br />\nTRIP CURING HOLIDAY V.<br />\nF. Calverton, of this city, ed-<br />\n<br />\nHOPKINS MEN GET<br />\nA BIG KICK OUT<br />\nOF LACROSSE<br />\n<br />\nLoses Two of Three Debates,<br />\nOne Is Draw<br />\n<br />\nIt's one of the traditional games of the college—and<br />\nwin or lose, every game is fought with a spirit that thrills<br />\nthe spectators.<br />\nHIM footwear gives the same \"kick\"—it's built to win<br />\nin any contest—no matter how keen the competition.<br />\n<br />\n$6.50 up<br />\n<br />\neN. HESS' SONS<br />\n8 E. BALTIMORE ST.<br />\n<br />\nThe MAY Co.<br />\nA Mocieri<br />\nFor Modem,<br />\nYoung Men....<br />\n<br />\nCA thouAht of Today—<br />\nThe season's styles in neckwear are the key to a man's<br />\ndress. .. they give that touch of personal effectiveness.<br />\n\"The Store of Standard Values\"<br />\n<br />\ne.McPHERSON'S<br />\nEotaflisheci 1862<br />\n11<br />\n<br />\nEast Baltimore Street<br />\n<br />\n\"Say it with Flowers\"<br />\n<br />\nitor of \"The, Modern Quarterly\"<br />\nand a nationally-known student of<br />\nthe labor movement, will conduct<br />\nTEAM IS ENTERTAINED<br />\nconcluding -dikussiott on the<br />\nthe<br />\nMcDorman, Littlefield<br />\ngiate Lib;<br />\nthe Intercol<br />\nofal<br />\ner<br />\nprogram<br />\nTeam<br />\non<br />\nAre<br />\nConference which ill be held<br />\nWilliam McDorn.an and John<br />\nat the Friends' Meeting House April<br />\nLittlefield, representing the Debat- 19, 20 and 21.<br />\nthree<br />\nin<br />\nd<br />\nparticipate<br />\ning Council.<br />\nThe subject of Mr. Calverton's<br />\ndebates during the Easter vacation<br />\nwill be \"What the Student Can<br />\ntalk<br />\nin the South.<br />\nand the speaker will outline the<br />\nDo,\"<br />\nMeet Raediolpis-Macen<br />\nwhich the student<br />\nOn Tuesday, April 2. the team various ways in<br />\nthe cause of liberalism.<br />\nmet Randolph-Macon at Ashland. can forward<br />\nwhose real name rs<br />\nVirginia. The subject debated was Mr. Calverton,<br />\nis a former student<br />\nthe one which was used in the George Goetz.<br />\nUniversity,<br />\nFreshman-Sophomore and Adams at the Jotms Hopkins<br />\nhis A. B. degree in<br />\ndebates here. \"Resolved, That the having received<br />\nJury System in Criminal Procedure 1921.<br />\nbe Abolished in the United States.\" Other prominent speakers on the<br />\nThere are two literary societies, conference program :include Father<br />\nthe Washington and the Marshall, John A. Ryan. professor of economat Randolph-Macon; the debate was ics at the Catholic University in<br />\nsponsored by. the former of these Washington: Norman Thomas, soand was held in the club rooms of cialist candidate for the presidency<br />\nthe society. About seventy-five in 1928, and Walter Ludwig, dispectators attended. A local min- rector of Pitpneer Youth.<br />\nister and a county superintendent of<br />\nAnswers to the conference invischools were among the judges.<br />\ntation are being received by the comThough the Hopkins team was mittee and -much interest is being<br />\nwell received, the deCision was two manifested by students in neighborto one against the team. After an ing schools and colleges. Large delovernight stay in Ashland, the team egations from a number of institujourneyed to Williamsburg to meet tions are expected to attend.<br />\nWilliam and Mary. They were enNine colleges in Maryland, Penntertained in the afternoon at the<br />\nWashington, D. C., are<br />\nbaseball game between Princeton sylvania and<br />\nexecutive comand William and Mary, and had din- represented on the<br />\np of the comner in the Senior Girls' dining hall. mittee. The membershi<br />\nV. F. Coe,<br />\nfollows:<br />\nas<br />\nis<br />\nmittee<br />\nthe<br />\nwhile<br />\nformal<br />\nwas<br />\nThe debate<br />\n, chairone at Ashland had been informal. Johns Hopkins University<br />\nSkeath, Goucher<br />\nThe subject was the same and the man; Catherine<br />\nman; M. A. PoHoykins team again upheld the af- College, vice-chair<br />\ngorelskin, University of Maryland;<br />\nfirmative side of the question.<br />\nLinda Chandler, ‘varthmore ColNo Judges<br />\nHood ColAn innovation was tried in judg- lege; Bertha Nixdorf,<br />\nMcLaughlin, Howard<br />\ning the debate. There were no lege; E. A.<br />\n; E. L. Heckert, George<br />\njudges and at the conclusion of the University<br />\nUniversity; Anita<br />\nn<br />\nWashingto<br />\nto<br />\nquesopened<br />\nwas<br />\ndebate, the floor<br />\nCollege; Caspar<br />\ntions from the audience. Finally. Short, Morgan<br />\nHart, Western Maryland College.<br />\nContmued on Page 3, Col. 4<br />\n<br />\nMADISON 5355<br />\nSEE<br />\n<br />\nJONES CHEVROLET SALES CO.<br />\nVALUES,<br />\nFOR BIGGER AND BETTER<br />\n<br />\nCabriolet-.$535<br />\n1928 Chevrolet Sport<br />\n525<br />\n1928 Chevrolet Landau<br />\n494<br />\n1728 Chevrolet Sedan<br />\n435<br />\n1928 Chevrolet Coupe<br />\n435<br />\n.,<br />\n1928 Chevrolet Coach<br />\n450<br />\n1927 Chevrolet Cabriolet<br />\n400<br />\n1927 Imperial Landau.<br />\n395<br />\n1927 Chevrolet Sedan<br />\n354)<br />\n1727 Chevrolet Coupe<br />\n350<br />\n1927 Chevrolet Coach<br />\n260<br />\nCoupe<br />\n1926 Chevrolet<br />\n260<br />\n1926 Chevrolet Coach<br />\n210<br />\n1926 Chevrolet Roadster<br />\n75<br />\n1924 Chevrolet Roadster<br />\n125<br />\n1924 Chevrolet Sedan<br />\n<br />\n1927<br />\n1927<br />\n1920<br />\n1920<br />\n1926<br />\n1924<br />\n1925<br />\n1926<br />\n1925<br />\n1926<br />\n1925<br />\n1923<br />\n1924<br />\n1923<br />\n1922<br />\n<br />\nPontiac Landau<br />\nPontiac Sedan<br />\nFord Model A Tudor<br />\nNash Coach<br />\nEssex Coach<br />\nMarmon Touring<br />\nDodge Touring<br />\nFord Roadster<br />\nFord Roadster<br />\nFord Touring<br />\nFord Touring<br />\nFord Roadster..<br />\nChevrolet Touring<br />\nCole Sedan<br />\nHupp Coupe<br />\n<br />\n$483<br />\n4607<br />\n475<br />\n450<br />\n295<br />\n365<br />\n' 163<br />\n145<br />\n125<br />\n130<br />\n150<br />\n50<br />\n50<br />\n55<br />\n<br />\nOPEN EVERY DAY AND NIGHT<br />\nST.<br />\nMT. ROYAL AVE. at McMECHEN<br />\n<br />\nROYAL<br />\n<br />\nTYPEWRITERS, ALL MAKES<br />\n<br />\nCORONA<br />\n<br />\n- OA. W. LUcY & CO.<br />\n104 WEST FAYETTE STREET<br />\nTelephone CAlvert 5902<br />\n<br />\nOldest and Largest Corona Dealers in State<br />\nHAMMOND<br />\n<br />\nUNDERWOOD<br />\n<br />\nArt)MB<br />\n21 1 2 1 3<br />\n<br />\nE BALTIMORE ST.<br />\n<br />\nTAILORING DEPT.<br />\n<br />\nt.A New Feature.)!<br />\nSpring Suit Tailored<br />\nto Your Measure<br />\n<br />\n$4°<br />\n<br />\nGEO. M. PLEINES<br />\nFlorist<br />\n7C—X<br />\nSTALL 69 V 70, NORTH AVE MARKET<br />\nBALTIMORE, MD.<br />\n<br />\nSmart Collegians Are Wearing<br />\nTHE TRENCH COAT, $12.50<br />\n<br />\nWhither away,<br />\nSir 161:9fIii?<br />\n<br />\nA lightweight, puttrcolored, waterproofed coat that has plenty of<br />\ndash and swagger. Trimmed with leather buttons and buckles.<br />\nThe newest thing out<br />\nSecond Floor<br />\n<br />\nSTEWART&GD<br />\nTHE GIANT<br />\nPOWER FUEL<br />\n<br />\nESSO<br />\n<br />\nNEW LIFE<br />\nFOR MOTOR<br />\n<br />\n\"STANDARD\" MOTOR OIL<br />\nThe Measure of al Value<br />\nSTANDARD OIL<br />\n<br />\nCOMPANY OF N. J.<br />\n<br />\nZIJG<br />\nWere's a knightly warrior, immortalized<br />\n<br />\n$8.50<br />\nBrown Zug-Grain<br />\nA sturdy new shoe for young men with a<br />\ngenerous measure of style . . . and priced to<br />\nfit a Scotchman's purse.<br />\n<br />\nby<br />\nStephen Leacocic, who under the stress of<br />\n. nse excitement\"mounted his horse and rode<br />\naway in all directions.\" 'Whether he ever ar- _INkved is not recorded.<br />\n7—<br />\n'To us, this giddy hero is a perfect example<br />\nof how not to make cigarettes. We hold that a<br />\ncigarette is a smoke, and a good smoke is a blessing, so to that end alone have Chesterfields<br />\nbeen ripened, blended and manufactured.<br />\n<br />\nMild as they are, not a jot of the true, rich<br />\ntobacco flavor has,ken lost. When the best<br />\ntobaccos on the nErket are bought you can<br />\nbe certain they'll deliver the taste. Chesterfields<br />\nare as natural as a field of sweet clover;<br />\nand they satisfy the taste superlatively well,<br />\nalways!<br />\nOnce a man has checked up on the above<br />\npleasant news, there'll be no \"riding away in<br />\nall directions\" for him!<br />\n<br />\nCIH ESTERTI ULM<br />\nMILD enough for anybody.. and yet..THEY SATISFY<br />\n<br />\n•MOO TOMO*CO.<br />\n,<br />\nLOGO<br />\n<br />\n'.<br />\n<br />\n2<br />\n<br />\n\f", "format": "basic_html", "processed": "MBmum<br /><br />\nv0l.xXxm, No. 42<br /><br />\nHOMEWOOD, BALTIMORE, MD., APRIL 12, 1929<br /><br />\nJAY RUNNERS BEAT<br />\nUNIV. OF DELAWARE<br /><br />\nCOTILLON CLUB<br />\nURGES ATTENDANCE<br />\nBecause of the fact that<br />\nabout twenty couples arrived<br />\nat the C. E. Hall last Saturday<br />\nnight and left because no one<br />\nwas there, the first twenty couples to arrive before 9.45 will<br />\nbe admitted free tomorrow<br />\nnight. For the late comers the<br />\nprice will be $1.00 stag or couple as usual. The dance will<br />\nbe from 9 to 12 with Os Steinwald furnishing the music.<br />\nJohn -Eldridge, president of<br />\nCotillon Club, announced that<br />\nthere would be some colorful<br />\nentertainment as an added attraction. If the attendance at<br />\nthese Saturday night dances<br />\ndoes not improve they will<br />\nhave to be discontinued.<br /><br />\nHOPKINS NETMEN BLANK<br />\nTRUSTEES ARRANGE NEW<br />\nVILLA NOVA RACQUETERS<br />\nSCHOOL OF EDUCATION<br /><br />\nPrice 5 Cs<br />\nBARNSTORMER CLUB<br />\nHOLDS ELECTIONS<br />\nThe Barnstormer Club held<br />\nelections at its annual banquet<br />\nlast Saturday night. Those<br />\nelected will go into office at<br />\nthe close of this year and will<br />\nhold the, office for the entire<br />\nfollowing season. As president Bill Banks will be succeeded by Jack Deets while<br />\nthe remainder of the executive<br />\nboard will consist of: Dick<br />\nBerney, secretary; Addison<br />\nCampbell, production manager,<br />\nand Max Sauerwein, business<br />\nmanager.<br /><br />\nJAYS MEET PENN<br />\nIN LACROSSE TILT<br /><br />\nSecond Shutout for Jays<br />\nSchool to Be for Higher<br />\nin One Week<br />\nStudies in Education<br />\nFormer Hopkins Stars Coaching<br />\nVilla Nova's tennis team was<br />\nDr. Goodnow has announced the<br />\nQuaker Team<br />\nrouted by the Hopkins racqueters establishment at Hopkins of a school<br />\nSchiebel and Morrison Other<br />\nODDS<br />\nFA-Voi-HOPKINS<br />\nlast Tuesday by the score of 7-0. of higher studies in education,<br />\nOutstanding Men<br />\nand<br />\nThe Jays were not extended, only the determination to add two<br />\nPenn<br />\nto<br />\nUse Hopkins Style<br />\ndeOn Tuesday an untried Black and<br />\nof Attack<br />\none match going the limit of three grees to the ones .already bestowed<br />\nBlue track squad journeyed to Newsets. In this encounter, Goldberg, by the universitytr—The new<br />\nTomorrow's game with the Unideark, and decisively defeated theplaying second for Hopkins, lost the grees will be Master of Education<br />\nversity of Pennsylvania lacrosse<br />\ntrack team of the University of Delfirst set to Kelley, 6-3, finally won and Doctor of Education.<br />\nteam should provide Jay fans with<br />\naware by the score of 863/2 to 393/2.<br />\nhe second 7-5, and came back<br />\nample opportunity to judge the<br />\nAs is evident from the titles, these<br />\nThis was the opening meet of the<br />\nstrong to win the third 6-3.<br />\ndegrees will be awarded by the new<br />\nactual strength of the Black and<br />\nseason foi the Jays and marks the<br />\nIn the first match Irons experi- higher school. Arrangements are<br />\nBlue team. Last Saturday's contest<br />\nsixth straight victory of HopkinS<br />\naced-little difficulty in defeating retained by which a student in eduwith the Olympic team showed conrunners in the last six dual meets,<br />\nTowey, breaking the latter'siservice cation may still do his graduate<br />\nclusively that the Jay team has post0-jay Squad having won every one<br />\nin the first game and repeating the work in the Faculty of Philosop<br />\nsibilities far beyond those anticihy,<br />\nof its five dual meets last season.<br />\nfeat several time during the match. for the degree Master of Arts or<br />\npated by even the most rabid HopHelmholtz blanked Lovett, the cap- Doctor of Philosophy, if he prefers<br />\nThe times made in the vatious<br />\nkins fans.<br />\ntain of the Pennsylvanians, in the that to the newly-ordained degrees.<br />\nevents were not startling, for the<br />\nThe Quaker team has an able<br />\nthird set and only allowed him three In that case his work is directed by<br />\nmost part, the marks being rather<br />\nApplicants Must File Petitions coach this year in the person of<br />\ngames in the second. Captain the Board of University Studies.<br />\nmediocre in quality, but:ailowance<br />\nat Early Date<br />\n\"Happy\" Middleton, Hopkins star<br />\nAnnual Junior Affair Takes<br />\nBrockman and Gump completed the The move was voted by the trusmust be made that thisT is the first<br />\nNovel Motif<br />\nHIGHEST AWARD GIVEN of a few years ago. This is Midrout.<br />\ntees Monday. The advisory board<br />\nreal test the team has had this year.<br />\ndleton's first year at coaching and<br />\nThis match marked the second is to consist of Dr. Goodnow, Dr. Larkin Farinholt, Hopkins Man,<br />\nPOSTER CONTEST<br />\nAn analysis of the different events<br />\nif reports from Philadelphia can be<br />\nconsecuti<br />\nElected<br />\nve<br />\nblanking<br />\nLast<br />\nYear<br />\nwhich the Jays Edward T. Buchner, Professors_<br />\nshows that the decisive winning<br />\nParty Takes Place May 4<br />\nrelied upon, he is making quite a<br />\nhave hrded their opponents, the Florence Bamberger, Fowler D. The 1929 election<br />\nat Lehmann's<br />\nmargin was piled up in the races,<br />\nof Rhodes success of hi%dgiitial venture into<br />\nUniversi<br />\nty of Delaware being the Brooks, David Weglein, George Scholars will be held<br />\nthe field men just breaking even in<br />\non December that line of enlireavor. In addition<br />\nThe Junior Dance Committee has<br />\nother whitewash victim. The Uni- Burnett, Neil Gordon, S. Buford 7, and students,<br />\ntheir departments.<br />\nof this college or to Middleton, Norman Robinson<br />\nformulated plans for their annual<br />\n,<br />\nversity of Virginia and Washing- Johnson, H. Carrington Lancaster, university must<br />\nfile their applica- captain of the Jay team three<br />\nmasquerade dance. The affair is<br />\nMorrison Stars<br />\nseaton and Lee have also fallen prey and Kemp Malone. Admission is tions with the<br />\nSecretary of the State sons ago, is aiding in the<br />\nMorrison's performances in the scheduled for Lehmann's Hall, Satcoaching<br />\nto the Jay netmen.<br />\nrestricted to teachers, supervisors, Committee of Selection before Oc- of the<br />\ndashes were distinctly heartening, urday, May 4, from 9:30 to 1:30<br />\nPenn' team. With a former<br />\nSummary: Hopkins 7, Villa and administrators with<br />\nthree years' tober 19, according to a recent an- defare4 star and attack star<br />\nand this frosh should develop into A. M. It has'been decided that the Nova<br />\nas<br />\n0.<br />\napproved experience and, in most nouncement from Frank Aydelotte, coaches it<br />\none of the best dash men Hopkins theme of the ball will portray Irons<br />\nis probable that the Quakdefeated Forvey 6-3, 6-1. cases, a college degree.<br />\nAmerican Secretary to the Rhodes er team is being<br />\nhas possessed.<br />\n\"Hell\" with the appropriate title Goldberg<br />\ntutored in much<br />\ndefeated Kelley 3-6, In accordance with the regula- Trustees and President of Swarththe same way that Hopkins teams<br />\nIn the middle distances, Perry \"Junior Hell Party.\" Fitting cos- 7-5, 6-3.<br />\no<br />\ncn<br />\ni<br />\ni<br />\nt<br />\nu<br />\nn<br />\ni<br />\nsd<br />\n,<br />\ne<br />\nt<br />\nq<br />\nw<br />\ner<br />\nu<br />\noi<br />\nm<br />\nar<br />\nry<br />\ne<br />\nee<br />\ns<br />\nn<br />\n,<br />\nt<br />\ns<br />\no<br />\nh<br />\nfor<br />\nr<br />\ne<br />\nf<br />\neg<br />\nt<br />\ne<br />\neg<br />\nd<br />\nol<br />\nr<br />\ne<br />\ni<br />\nCollege.<br />\ne_<br />\no<br />\n_m<br />\nAre<br />\nd<br />\ne<br />\ns<br />\nare.<br />\nand Yellott were successful in the tumes will represent any personages Helmholtz defeated Lovett 6-0,<br />\nWalkover Last Year<br />\nRhodes Scholarship, the most<br />\nquarter and half mile runs. Their possibly in \"Hell\" from the time of 6-3.<br />\nprepared students and three years<br />\ncoveted of all undergraduate awards, The game last year with the Penn<br />\ntimes will have to improve in both Eve to the present day Venus, so a<br />\nBrockman defeated Dooling 6-2, for others.<br />\nentitles the holder to two years of team was nothing short of a walkof these events if they are to be con- broad choice of dress is permissible. 6-0.<br />\nstudy<br />\nPrevious<br />\ndances,<br />\nat Oxford University, with over for Hopkins. The ball was selclass<br />\nby<br />\nthe<br />\nhave<br />\nsistent winners this year.<br />\nWarfield defeated Boyle 6-1, 6-2.<br />\nBanquet Season to<br />\nan annual stipend of /400 (about dom in the possesion of the Penn<br />\nbeen highly interesting and enjoy- Irons and<br />\nHelmhokz defeated<br />\nCaptain Schiebel had the mile and able and the committee is trying to<br />\nTest Class Spirit $2,000). If, at the end of the sec- attack and when they did get it their<br />\ntwo-mile ruiii 'sewed up\" from the make this one the best ever, even Forvey and Boyle 6-2, 6-2.<br />\nBeginning April 11, with the Jun- ond year the scholar presents an ap- efforts were short-lived. This<br />\nBrockma<br />\nn<br />\nand<br />\nGump<br />\ndefeated<br />\nyear,<br />\nstarting gun. Miller turned in a hoping to eclipse the fame of the<br />\nior banquet, the season of real class proved plan for an additional year however, with<br />\nan attack which is not<br />\ncreditable perforinance in the two- \"Pow-Wow\" of 1928 and the Kelley and Dooling 6-4, 6-1.<br />\nspirit will start. The class battles of study, the Rhodes Trustees will<br />\nas experienced in \"riding\" the demile run to finish in a dead heat \"Pirates' Ball\" of 1927.<br />\nand class kidnaping will be in vogue. then extend his scholarship to cov\"The Contrast\" to Be<br />\nwith Schiebel: Of Particular interThose on Committee<br />\nLast year, even-with the restric- er a third year. Rhodes Scholars fense as was last year's, the situaest in this long race was the work<br />\nThose on the committee are:<br />\nAt Playshop Tonight tions placed upon the classes by the are elected without examination on tion will be materially altered. Then,<br />\nof Hancock, a freshman, sunning Stewart Smith, chairman; John \"The Contrast,\" by Royall Tyler,<br />\nStudent Council, there were several the basis of their records in school too, the Pennsylvania team has<br />\nhis first college race. He sprinted Norris, William Swope, George will be repeated tonight and Mongood fights, some daring kidnaping, and college, and no restriction is showed steady improvement during<br />\nthrough the best part of the last Gump, William Parker, and Sweet- day at the Homewood Playshop. and<br />\nmore than a little blood shed. placed upon their choice of studies. the past few years and with the<br />\nable<br />\nlap to pull up out of the nick, and s&amp; Linthicuni. Arrangements are The play has been running since<br />\nTo be eligible a candidate must coaching mentioned should<br />\nThis year all restrictions are renearly annex third place.<br />\nput a<br />\nnow,being made for decorations, re- Wednesday.<br />\nmoved except the two laid down be an unmarried male citizen of the team on<br />\nthe field which will be on<br />\nfreshments, entertainment, etc., and \"The Contrast\" has been called<br />\nHershey Wins Tisk.<br />\nthat there must be adequate police United States, between the ages ot<br />\nabout even terms with the Jay<br />\nHershey was victorious in both further information concerning the first American comedy since it protection and that the classes,<br />\nnineteen and twenty-five, and must<br />\nand<br />\ntwelve.<br />\nthe hurdle xaces. While neither one these will be announced shortly. Al- is the first written by an American not the college, are<br />\nresponsible for have completed at least his SophoTrick Play<br />\nof them, were especially fast, they though the expenses- will be more and having its premier in this coun- all arrangements,<br />\nmore<br />\nyear<br />\nin<br />\ncollege<br />\nbefore<br />\ndamages<br />\nand<br />\nthe<br />\ntime Pennsylv<br />\nother<br />\nania's specialty this year<br />\nwere distinctly heartening from the than double those of previous occa- try. The play was written in 1787 incidentals; and also the<br />\nhe<br />\ngoes<br />\nto<br />\nOxford.<br />\nHe<br />\nmust then<br />\nunwritten<br />\nis the so-called \"brush off\" play.<br />\nway he refused to be worried at the sions, it is felt that no increase in and the scene is laid in New York rule that no track or<br />\nlacrosseman be one of the men chosen to repreof that period. The action covers can<br />\nslight.early lead gained by his com- price will be necessary.<br />\nbe kidnaped or can take part in sent this institution in the competi- This is the type of play which Jay<br />\nNaar<br />\nPrim<br />\nfive acts and the cast will be cospetitors, continuing on in gdocl style<br />\nthe catching of members Of the oth- tion. Scholars selected on Decem- teams for- the past ten years have<br />\nAn innovation this year will be a tumed in appropriate colonial<br />\nto win.<br />\ndress. er class.<br />\nber 7, 1929, will go to Oxford in been (frilled in<br />\nposter contest open to everyone and The members of<br />\nand a type of play<br />\nEnglish V, an<br />\nOctober. 1930.<br />\nDorman, giant frosh from quite a few of the campus artists<br />\nIn<br />\nthe<br />\nabsence<br />\nof<br />\nStudent<br />\nwhich has been used very effectively<br />\nCounAmerican Drama class in the Coleil restAction, however, the classes<br />\nFriends School, gave distinct evi- are expected to enter. 'pie first<br />\nThese Scholarships were created by them. This type<br />\nlege for Teachers, are producing the<br />\nof play was ordence of ability in annexing the prize will be five dollars, the second<br />\npay under the direction of their in- have, iii new-born caution, resorted by the will of Cecil Rhodes, the fa- iginated by William C. Schmeiss<br />\ner,<br />\nto self-impdited regulations where- mous South African statesman and<br />\nshot-put and getting third in the dis- three dollars and the third two dol- structor,<br />\nN. B. Fagin. Camilla<br />\nalumni coach of the Hopkins team.<br />\ncus. Caldwell, likewise a f rush, tied lars. Each of. the best ten posters<br />\nBoone has the female lead and Rob- by it is agreed that from six till capitalist, who died in 1902. Their<br />\nfor first place in the high jump, bu submitted will be awarded a ticket<br />\ntwelve P. M. of the days of the purpose is expressed in the terms The play works in this manner': an<br />\nert Warfield has the main male part.<br />\nshould do much better in the future<br />\nrespective banquets there shall be of his will:<br />\na9ack man runs across the mouth of<br />\n)to the dance. These posters will be Other prominent members of<br />\nthe 'no kidnapin<br />\nthan this winning mark.<br />\ng or efforts to disturb \"I also<br />\ndisplayed around the campus and in cast include Roberta Malambi<br />\ndesire to encourage and the goal and as his defense man<br />\n, Ber- the banquet<br />\nin progress.<br />\nseveral stores in the vicinity of the nice Legum, Howard Snyder,<br />\nSloan Delaware Star<br />\nfoster an appreciation of the advan- follows hint across the attack man<br />\nand<br />\nFor Delaware, Cortman, in the college. The best poster will prob- S. Vannort Chapman<br />\nPresident Lockard, of the class of tages which I implicitl<br />\n. The scenery<br />\ny believe will who is playing the' crease steps in<br />\ncentury dash, and Sloan, in the high ably be printed in The Black and is being held<br />\nby William Banks and '31, said the reaspn for the agree- ,result from the union of the Eng- his way and blocks him, thus<br />\nleaving<br />\njump, pole vault, and shot-put, were Blue Jay. All contestants must turn Chapman.<br />\nment was the prevention of undue lish-speaking peoples<br />\nthroughout the his team-mate free to receive<br />\na pass<br />\nthet outstanding performers.<br />\nin their entry to Mr. Meyers, J. 14. Tickets for the play are $1.00 and financial losses to the classes, en- world, and to encourage in the stuand to make a shot at the goal.<br />\nU. post office before 4 P. M., Mon- may be obtained from any member tailed by the rampant breakage of dents from the United States<br />\n.. .<br />\nAltogether the meet served well<br />\nday, April 22. The judges will be of English V or from Dr. John,C. a \"rough-house\" banquet, as has oc- an attachment to the country'<br />\n•<br />\nBig Mem<br />\nfrom<br />\nits purpose of giving an untried Jay<br />\nthe committee, Mr. Meyers, Ser- French. The curtain rises at 8:30 cuffed in hardier years.<br />\nwhich they have sprung, without, I<br />\nPennsylvania has three very big<br />\nteam some experience, and of show- geant Frank and Ben Kolb.<br />\nSophomores will feiSt Monday hope, withdrawing them or their men on its attack this year,<br />\nP. M.<br />\nall of<br />\ning the weak spots on the squad.<br />\nDetails of Contest<br />\nnight and freshmen Thursday sympathies from the land of their whom<br />\nare very fast. With the comspecifica<br />\nposter<br />\ntions for the<br />\nThis Saturday the jays will face one The<br />\nnight. Of course, the scenes of the adoption or birth.\"<br />\nLockard to Preside<br />\nbination of speed and weight added<br />\nbanquets, according to one of the<br />\nof the most formidable opponents are as follows: Size 18x14 inches;<br />\nFurther information and applica- to a working knowledg<br />\nwhite or colors, and<br />\nand<br />\nblack<br />\ncolor,<br />\ne of Hopkins<br />\nOver<br />\n\"Y\"<br />\nNext<br />\nfew<br />\n}ear<br />\ntradition<br />\ns<br />\nstill observed, have tion blanks may be<br />\non their entire schedule when they<br />\nobtained from methods the game<br />\ninformatiOln concerning the dance Officers of the Johns Hopkins Y. not been revealed.. There<br />\nis sure to prove<br />\nhad been Dean's Office or from<br />\nrun William and Mary. The VirPresiAent<br />\nto include as much as the individual M. C. A. for the year 1929-30 were a rumor current that the frosh<br />\nFrank Aydelotte, American Secre- more than interesting.<br />\nginians will invade Homewood with deems necessary, i.<br />\n\"Junior Hell chosen last Tuesday night at the would banquet the<br />\nsame night as tary, at Swarthmore,<br />\nLineup:<br />\nPa. Full ina well-balanced squad, and a few Party\"; Lehmann's Hall; May 4, election supper at the Friends Meet- their rivals, but this<br />\nis now discoun- formation about study<br />\nHopkins<br />\nPennsylvania<br />\nand life in<br />\nstar performers in the dashes and 1929; 9;30 to 1:30 A. M.; reLrss ing House. Edwin Lockard was tenanced. The place of the banquet<br />\nBrownley<br />\nG<br />\nDouglas,<br />\nments. Slogan such as \"Go to He the unanimous choice for president. has been kept silent, but the night Oxford is supplied especially for<br />\njavelin throw.<br />\nHall<br />\nP<br />\n.Magal<br />\nwith the,Junior Class,\" \"Be a Dev- George H. Dowell was elected vice- of the affair any soph interested can American students in Oxford of ToCone<br />\nC.1'<br />\nWarren<br />\nil,\" \"A Hellish Party,\" and the like president, William Olsen, secretary, find the place by trailing any officer day, published under the direction<br />\nKegan (Capt.)...1D<br />\nMcGee<br />\nwould be appropriate. Posters may and Roswell Jones, treasurer. Thir- on the Baltimore police force.<br />\nBULLETIN<br />\nof the Association of American<br />\nSilver<br />\nPaul Cordish was elected<br />\nbe as modernistic as desired but will fy men attended the affair.<br />\nThe main drawback to this year's Rhodes Scholars, by the Oxford Caplan<br />\n3D<br />\nHunt<br />\nEditor-in-Chief, and George<br />\nbe judged entirely on their advertis- President Hall presented the an- season is that neither class president<br />\nUniversity Press,<br />\nCampbell<br />\nC<br />\n(Capt.) Ott<br />\nGettemuller, Business Maning mein. For further information nual report. \"Levering Hall will be can be a guest of honor at the other New Ir„k City. 114 Fifth Avenue,<br />\nager of the 1930 Hullabaloo<br />\nDukehart,<br />\n3A<br />\nPendleton<br />\ncontestants should communicate ready for occupancy when college class's banquet. Lockard, sophomo<br />\nat the Junior Class Banquet<br />\nre<br />\nGuild<br />\n2A<br />\nGaNung<br />\n803.<br />\nBox<br />\nNorris,<br />\n0.<br />\nopens<br />\nP.<br />\nnext<br />\nJohn<br />\nfall,\"<br />\nwith<br />\nLast<br />\nannounce<br />\nhe<br />\nyear,<br />\na<br />\nHopkins<br />\npresident<br />\nd.<br />\nThe<br />\nman, Larkin Eagan<br />\n, is guarded by his connecheld last night at the New<br />\nlA<br />\nReiser<br />\nTickets will be $2.50 per couple report gave a full account of this lion with the track team. Dukehar prinholt, was selected for the<br />\nHoward Hotel.<br />\nt<br />\nhon- Love<br />\n0.14<br />\nBernheim<br />\nyear's activities of the \"Y.\"<br />\nor $2.00 stag.<br />\nis protected by lacrosse.<br />\nor and is now working at Oxford. Lyons<br />\nIH<br />\nEdwards<br />\nUntried Black and Blue Squad<br />\nScores 861<br />\n/<br />\n2 Points to Win<br />\nHERSHEY HIGH SCORER<br /><br />\nJUNIOR COMMITTEE IS<br />\nARRANGING HELL DANCE<br /><br />\nRHODES SCHOLARS<br />\nTO BE ELECTED<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 12, 1929<br /><br />\n2<br /><br />\nTHE D. A. R.<br />\nBy \"BEN<br /><br />\nTIILIS110MSIETISIIITER<br /><br />\nCA Reliable Tip<br />\nConcernin<br /><br />\nThree rather feeble and emaciated imazely one-half of one per cent.<br />\nsoold women were recently walking We inuA at least compliment the<br />\nFOUNDED 1897<br />\nstreet. A friend ciety upon,its solidity.<br />\ndowntown<br />\na<br />\nalong<br />\n2.00<br />\nSubscription<br />\nAs an illustration of our .statewho was with us at the time made<br />\nthat the D. A. R. -has eXe.well,<br />\n1,I<br />\nin<br />\nment<br />\n'<br />\nPosts:450e<br />\nthe<br />\ncomment<br />\nat<br />\n1909,<br />\n3,<br />\namusing<br />\nDecember<br />\ns<br />\nmatter<br />\nan<br />\nsecond-clas<br />\nEntered as<br />\nte the c-uted a right about face as to their<br />\nBaltimore, Md., under Act of Congress November 3, 1879.<br />\n;t must be the D. A. R,E.<br />\nan<br />\nJohns evident unfairness of the egnark, historical ideals, we quote from<br />\nPublished semi-weekly from October to June by the students of<br />\npleasure, a suit from the Hutzler<br />\ntheir<br />\nIn the daily race of business and<br />\nHopkins University.<br />\nit is not entirely without validity, article in the April number of<br />\nlead right at the start.<br />\nsubstantial<br />\na<br />\nyou<br />\nis<br />\nnaively<br />\ngive<br />\narticle<br />\nwill<br />\nThis<br />\nShop<br />\nlost<br />\njournal.<br />\nseemingly<br />\nMen's<br />\nhas<br />\nYoung<br />\nMANAGER, for the D. A. R.<br />\nBusiness communications should be addressed to the BUSINESS MANAGING<br />\nOrPatriotic<br />\n\"Why<br />\nentitled,<br />\nit.<br />\nenough<br />\nwhich<br />\nthe<br />\nupon<br />\nsight of the ideals<br />\nJohns Hopkins University. All articles should be sent to<br />\nOur<br />\nEurma ; other communication.s to the Eorroit-IN-CatEr.<br />\nwas founded and especially its ma- ganizations Should Protect<br />\n$29.50to $59.50<br />\nfreedom. An American Institutions from the<br />\n0100 jor premise, namely.<br />\nThroughTe/ephone<br />\n.organization conceived in Radical- Menace of Radicalism<br />\nTHIRD FLOOR, NORTH BLILDINCI<br />\nthe<br />\nism, nurtured by the spirit of Equal- out the entirety of this harangue<br />\nterm \"Radical- is never clearly deEDITORIAL DEPARTMENT<br />\nity, and born the offspring<br />\nEctitor-in-Chiel<br />\nopen rebellion, it has degeneratt.:,: fined: however, we gain the impresis<br />\nGEORGE E. riANKS, JR., '29<br />\nthe level of a \"Ladies Sewing (T:- sion that a Radical is one who<br />\nHoward, Saratoga and Clay Streets<br />\nheartily in favor of:<br />\nAssistant 3fanaging Editor<br />\ndc\"<br />\nManaging Editor<br />\n;30<br />\nGt-wr,<br />\nGomm<br />\nhome.<br />\nthe<br />\nn<br />\nof<br />\n1.<br />\nDestructio<br />\n'29<br />\nPHIIIP W. NESS,<br />\n- Telephone CAlvert 1234<br />\nThe society,- a sister organiz<br />\n2—Destruction of religion.<br />\nAssociate Editors<br />\nof the D. A. R., was founded .7.<br />\n'30<br />\nBAIRD,<br />\nS.<br />\npatriotROBERT<br />\nnational<br />\nn<br />\nof<br />\nDestructio<br />\n3.<br />\nWrnstzra H. DRIvER, 214<br />\nWashington. D. C., on October 1 I.<br />\nism.<br />\nHOmewood 8040-8041 If you will 1st us do yoter<br />\nJunior Editors<br />\n1890, and even at that early date had<br />\nneat appearance<br />\nYour cloth. will always have that PRESSING<br />\n'30<br />\nJr<br />\nHall.<br />\nPurnell<br />\nAND REPAIRING<br />\nW.<br />\nunfair<br />\nDYEING,<br />\nto.show signs. Of rather<br />\nStewart I.. Sui.th. '30<br />\nbegun<br />\nLEANING.<br />\nsm.<br />\n5—Sociali<br />\nE Poster Dowell,<br />\nWill Convince You\"<br />\nTrial<br />\nLeonard B. Nolley,<br />\nthis'. stateWitness<br />\ntion.<br />\ndiscrimina<br />\n'31<br />\nG...dFlunt.<br />\nRichard<br />\n'30<br />\nSpear,<br />\nPaul W.<br />\n6—Laxity in • marriage and<br />\nPARISIAN TAILORING CO.<br />\nHarwood P. Mullikin. Jr., '31<br />\nment.:\"Any woman may be eligible<br />\nGeorge H. Dowell, '31<br />\n346 E. 33sn STREET<br />\nVOTCe.<br />\nIrving K. Gordon.<br />\nRobert P. Skutch, '30<br />\nthe age of<br />\nof<br />\nIS<br />\nwho<br />\np<br />\nmembershi<br />\nfor<br />\nCorner University Parkway<br />\n'31<br />\nDanziger.<br />\nLewij<br />\nSidney Walk, '30<br />\n7—Promotion of iiiinforality.<br />\nNathan H. Harris, 'n<br />\nwho is descendand<br />\nyears,<br />\neighteen<br />\nPrank Cone. '31<br />\nS—Disrespectful attitude -on the<br />\nGeorge 0. Trattner, 35<br />\nRowland McD, Ness, '32<br />\ned _from an ancestor Who, with un-f•<br />\nj<br />\nColumnist<br />\nloyalty, rendered material a:<br />\nfailing<br />\n9—Etc., etc., etc.<br />\nSTEPHAN E. FITZGERALD, .31<br />\na<br />\nas<br />\nce<br />\nof<br />\nindependen<br />\ncause<br />\nthe<br />\nto<br />\n, It at once becomes evident that no<br />\nrecognized patriot, as a soldier or a<br />\nBUSINESS DEPARTMENT<br />\ndefinition is: .necessary. -Reading<br />\nof<br />\non<br />\nin<br />\n,<br />\nofficer<br />\nsailor, or as a civil<br />\nBusiness 3fanagcv<br />\n- on in the same .article, we<br />\nproths several colonies or states,<br />\n!LARRY 0. SCHLOSS, JR., '29<br />\ntl-.:s astounding bit of informa-.<br />\nfinc:<br />\nviited that the applicant shall be acCiroulation Manager<br />\nAdvertising Manager<br />\nriot.: \"The great mass of citizens<br />\nJ. Roma? Mrs,<br />\nceptable to the society.\" Notice the<br />\nGroom M. GLAZIER, '29<br />\nof the United States, including all<br />\nAdvert-icing Stun'<br />\nlast clause carefully: it is one which social strata, are loyal to the AmerOfice Staff<br />\nAlvin H. Blum. '30<br />\nTheodore A. Fl‘-ukhrr.an. '31<br />\nimportant<br />\nextremely<br />\nbecomes<br />\noften<br />\nGus Burke. '31<br />\nican Government and institutions.<br />\nRandolbh Bothchill. '31<br />\nGeorge S Robertson. '31<br />\nin the question of qualifications.<br />\nJohn A. Jamieson. '31<br />\nThey have no sympathy with the<br />\nSidnfy Rafted. '31<br />\nLyle Er Galley. '310<br />\nAs prOof of the statement, some- preachments.' of the 'wild-eyed rad<br />\nDavid S. 871.14 '22<br />\nHenry V. Saunders. .n<br />\ntimes denied, that the D. A. R. is the seals who conic here from gory<br />\nSouth Streets,<br />\noffspring of an open rebellion. we scenes of license and ruin abroad<br />\nProduced by The Read-Taylor Company, Lombard and<br />\nBaltimore, 51d.<br />\nRIDE THE STREET CARS<br />\noffer 'the following; \". . member- to spread the doctrine of anarchy.<br />\nare<br />\nwho<br />\nthose<br />\nto<br />\nrestricted<br />\nis<br />\nship<br />\nBut if the loyalists remain passive<br />\nlineal descendants of an ancestor and perversely refuse to recognize<br />\nTHE MOST ECONOMICAL<br />\nesin<br />\nthe<br />\nwho . .. actually assisted<br />\nthe danger. the propagandists will<br />\nMEANS OF TRANSPORTATION<br />\ntablislunent of American independ- gain a foothold here which will -re•-•<br />\nence by service rendered during the quire in the end a much greater efWar of the Revolution. becoming . fort to drive them out. Let every<br />\nUNITED RAILW1VYS4,ELECTRIC CO.<br />\nthereby liable to Conviction of trea-. officer of the law be<br />\nwatch; let<br />\nOF BALTIMORE<br />\nSIGHS<br />\nOF<br />\nE<br />\nTHE BRIDG<br />\nagainst the government of Great all patriotic Americans be alert.\"<br />\nsolemn<br />\nin<br />\nBoard;<br />\nnity<br />\nInterfrater<br />\nthe<br />\nBritain.\"<br />\nnot<br />\nare<br />\nwe<br />\nthat<br />\nafternoon,<br />\n,Please understand<br />\nMONDAY<br />\n1 ::ze 3. C,-! 3<br />\n)<br />\niession assembled, decided to discard the traditional \"baseball\"<br />\nIn. the face of such clearly exduring the<br />\nseries iE favor of a panhellenie bridge tournament. Thus,<br />\nthe D. A. R.<br />\nsentiment<br />\npressed<br />\ntrans.<br />\nbe<br />\nto<br />\nare<br />\nactivities<br />\nverdan4 spring season, fraternity athletic<br />\nletter<br />\ndevotes itself to such paral<br />\nHave you trhosen<br />\nferred from the diamond to tlpe parlors of the xarious Greek<br />\nburlesque<br />\nworks as erecting monument, societiois. Instead of watching and playing the hilarious<br />\ntradition,<br />\nUniversity<br />\na<br />\nformed<br />\nyour life work?<br />\nand<br />\nhave<br />\nhires<br />\nyears,<br />\nnar,<br />\nfor<br />\nRevolUtio<br />\nwhich,<br />\ngames<br />\nbaseball<br />\nGreeks<br />\nTEE teld 'of health service The Harfraternity sports circles will be treated to the sight of four<br />\n\"black-lE<br />\nwill<br />\nDental School--the o:dthey<br />\nvard<br />\nUnisersity<br />\nfumes,<br />\ntobacco<br />\nwith<br />\nat a /bridge table. In a room, reeking<br />\nest dent., school connected with any<br />\nan,.. :e of -the ,fant<br />\nThe<br />\naces.. ,<br />\n..aivses,t&gt;-r. the UnAed Starts,-offers<br />\nsit 'ilentIy finessing ten spots and trumping their partners<br />\ncourses in at<br />\nthorough<br />\nwell-halanced<br />\n.<br />\none of thel'nl.ranches of dent,try. All modern equipment for-vVracticai work under superco<br />\nnfortunately, the editor does not have the privilege of attending<br />\nsociety<br />\nthe<br />\ndisastro-s<br />\n—<br />\nthe<br />\npiofession.<br />\nin<br />\nhigh<br />\nat<br />\nmen<br />\nvision<br />\nstimulate meetings of the board nor does he enjoy the intellectual<br />\n/-Write tor Stints tad admistient requirehave done, f t it has reacted grea::<br />\nthat<br />\notnits to Leroy M. S. Mitre, Dews<br />\non of hearing the discussions of the wise men which comprise to<br />\nto the organization's disadvantage •<br />\nHARVARD UNIVERSITY<br />\norganization. Thus, he did not have the opportunity of ligening<br />\nDEN rAL SCHOOL<br />\ncontinuing<br />\nand has served to center the<br />\nthe various pros and cons regarding the advisability of<br />\nBoston. Mass.<br />\nLongwood Ave.<br />\nas a casual<br />\nmerest of Many upon, the so,ciy,<br />\nthe playing of the annual baseball tournament. However,<br />\nmost<br />\na<br />\nbeing<br />\nmaking the best c<br />\nin<br />\nt<br />\nbystander, the decision of the Greeks impresses him as<br />\nitself.Bu<br />\nof only<br />\nsenseless and ridiculous procedure. A bridge tearn, consisting<br />\nregrettable occurrence the D.<br />\nmembers to<br />\nPeabody Book Shop<br />\ntwo players, certainly permits very few of tge -chapter<br />\nshowed good judgment. The<br />\ncard<br />\natthe<br />\nsession<br />\na<br />\ndoes<br />\nNor<br />\nproclivities.<br />\n913 N. Charles<br />\n\"athletic\"<br />\nexercise their<br />\nfans:<br />\nwho was resvinsible for<br />\ntables provide a very interesting entertainment for the \"sports\"<br />\nL<br />\nMOTOR !AN<br />\ninterfra,<br />\nan<br />\ncampus,<br />\nwas<br />\nlist of taboo individuals<br />\nIf baseball has log its appeal on the Homewood<br />\nwould have<br />\nquently expelled and the question!<br />\nALL NEW<br />\nternity tennis tournament track meet or lacrosse league still relish<br />\nOpen<br />\nbeen a far more appropriate substitute. Or if the -Greeks<br />\ndied a natural death. A striking exPublications<br />\nwith ,a<br />\nEvenings<br />\na taste for the diamond sport but fear the dangers of playing<br />\nthe<br />\nwhich<br />\neffect<br />\nof<br />\nlack<br />\nthe<br />\nof<br />\nample<br />\nLess 10%<br />\n—<br />\nfor<br />\ninstituted<br />\nhard baseball, let a seriei oreplayground ball games .be<br />\nSolve This One and Win a Prize<br />\nBlack-list and the ensuing turmoil i<br />\nthe tiny tots.<br />\nhad upon the membership of the so-.!<br />\n-NR.- RASNEC ANSEN RTF1TH\"<br />\nchapthe<br />\naround<br />\nhowls<br />\nwind<br />\nthe<br />\n, During the winter season, when<br />\nia Britannica. 32 volt in is<br />\nciety is shown by a \"comparative Encyclopaed<br />\nrubber<br />\nHERMAN M: COHN, MGR.,<br />\na<br />\nhearth,<br />\na,<br />\nfor<br />\n045.00.<br />\nnew,<br />\nroom<br />\nedition.<br />\nliving<br />\n13th<br />\nthe<br />\nin<br />\nvols.,<br />\nCrackles<br />\n'fire<br />\na<br />\nter house roof and<br />\nJos, Xi'. Brooks '<br />\nE., Co.,<br />\nregistration table\" as published in!<br />\nwith its<br />\n'<br />\nof bridge is a very pleasant divertissement. But the Spring,<br />\nA.<br />\nD.<br />\nthe<br />\nThe<br />\nof<br />\n'<br />\nLIFE<br />\nNT<br />\nnumber<br />\nactivities.<br />\n213 'St. Paul Place<br />\nDEPARTME<br />\nthe February<br />\ngreen grass, warm sun and balmy air, calls for outdoor<br />\ncards<br />\nplaying<br />\nof<br />\npack<br />\nthe<br />\ntumors<br />\nthe<br />\nand<br />\nR..journal. 'Despite<br />\nTEACHERS WANTED<br />\nbridge table is left folded in the corner<br />\n0<br />\nMen anl wxneti vlfo - `ane plannino<br />\nwholesale withdrawals, we find<br />\ngathers dust-on the mantel.<br />\nto teach in .secondary sehools IVcolleges should write or call.gradsthese facts,<br />\nfrom October 31, 4928,- to Noyen:We suggest that the Interfraternity Board examine •<br />\nhave placed many 'Hopkins<br />\nher 30; 1928, which,--we believe. BT.,<br />\nponder on these thoughts and reconsider their action.<br />\nTHE BALTIMORE TEACHERS'<br />\n•<br />\nthe period of greatest strife, the tc.-AGENCY<br />\n402-3,ItTitle Annex Bldg.<br />\ntal loss in membership was approx-<br /><br />\n•-<br /><br />\nYOUNG MEN'S SPRING SUITS<br /><br />\nHUTZLrK 5FOTHE3<br /><br />\nqi-<br /><br />\n.<br /><br />\n\"One<br /><br />\nAfter the Dance<br />\nerr; Ir9EGIS<br /><br />\n. 1815-17 North Charles St.<br /><br />\nEDITORIAL COMMENT<br /><br />\nO<br /><br />\nM11—<br /><br />\n*011<br /><br />\nWantto really<br /><br />\n_ .6uy<br />\nBET HEHWON°DER E<br />\n_<br /><br />\nSOMETHING OUGHT TO BE DONE<br />\nOME munificent philanthropist, who wishes to win the undying<br />\ngratitude of the University, should establish a fund for the<br />\neducational<br />\nlaunching of a much needed publicity campaign. This<br />\nspelling<br />\ncrusade would endeavor to instruct the public in the correct<br />\nHopkins was<br />\nof Johns Hopkins' Christian name. Even though Mr.<br />\ndubproperly christened Johns, our great American publicinsists on<br />\nUniversity post<br />\nbing him JOHN. Much of the mail received at the<br />\nthe otherday,<br />\noffice is addressed with no regard to the final \"s\". Just<br />\nMemorial<br />\nwhile strolling about the Commons Room of the Alumni<br />\nseveral<br />\nHall, we were greatly distressed and horrified to note that<br />\nJOHN<br />\n.of the magazine covers were imprinted with the inscription,<br />\nHOPKINS.<br />\nHerThis proposed educational campaign will doubtless prove a<br />\nassumed such<br />\nculean task. We fear that the insidious practice has<br />\nand<br />\nmagnitude as to require the expenditure of thousands of dollars<br />\nto rectify this<br />\nthe employment of hundreds of press agents in order<br />\nsome<br />\nuniversal error. Nevertheless, we do not despair, of finding<br />\na cause.<br />\nworthy<br />\nso<br />\nto<br />\ncoVitribute<br />\nwillingly<br />\nwould<br />\nwho<br />\ndonor<br />\ngenerous<br />\ncontinue to<br />\nMeanwhilei_those affiliated with the University inist<br />\nspoken-wince and experience nausea when they hear the blasphemy<br /><br />\nSAMUEL KIRK &amp; SON, INC.<br /><br />\nYou Shall<br />\nSOT Pass!<br /><br />\nFounded 1815<br /><br />\n—<br /><br />\nBaltimore, Md.<br /><br />\n421 North Charles St.<br /><br />\nWrist Watches for Men<br />\nGOLD JEWELRY<br />\nDIAMONDS<br />\nSILVERWARE<br /><br />\nNo \"Personality\" shall pass this spice without knowing<br />\nthat here he can have his clothes tailored to his personal<br />\nrequirements • • • by nationally famousi college style<br />\nauthorities • • • at a mighty saving, because he buys here<br />\nfrom the Tailor Direct, with no middleman's profits added.<br /><br />\nAt Your Service 24 H\\urs a Day<br /><br />\ncMayflowet-<br /><br />\nCab Co.<br /><br />\nINCORPORATED<br /><br />\n1718 N. Charles Street<br /><br />\nKnown\"<br /><br />\n20c FIRST HALF-MILE<br />\n10c each additional Half-Mile,<br />\nor fraction thereof<br />\nThe above rate applies for I to 4<br /><br />\nCOMPARE!<br />\nVErnon 4090<br /><br />\n-<br /><br />\n-Nationally<br /><br />\npassengers<br /><br />\nSte. et HooitsooJ Fuld<br /><br />\nu,tly<br />\nFamous\"<br /><br />\nCLOTHES FOR COLLEGE MEN<br />\n-i N. Howard St.<br />\nand\"s'Ird<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 12, 1929<br /><br />\ntte<br /><br />\nTEAM<br /><br />\nTHE NEW<br />\nHOLLYWOOD SHIRT<br />\nHollywood's latest creation! Black,<br />\nOrange and Blue are the colors.<br /><br />\nOvIANNIE (BERG<br />\n\"The Old Boy Himself\"<br />\nNORTH &amp; MARYLAND_ AVES.<br /><br />\nL. G. BALFOUR CO.<br />\nFraternity Pins<br /><br />\nJewelry,<br /><br />\nFavors,<br /><br />\nNovelties<br /><br />\nHOPKINS RINGS.<br />\n1109 Fidelity Bldg.<br />\nPhone CAlvert 1564<br /><br />\nALBERT W. RHINE, INC.<br />\n8 N. Calvert St.<br />\n•<br /><br />\nPJsers<br />\nPAINTS and VARNISHES<br /><br />\nJ. H. FURST CO.<br />\nPRINTERS OF .<br /><br />\nPhilological and Scientific<br />\nPublicatipns<br />\n21 S. HANOVER ST.<br /><br />\nBALTIMORE<br /><br />\nYELLOW CAB STANDS<br />\nAT<br /><br />\nHomewood Field<br />\n35th and St. Paul Street;<br />\n31st and St. Paul Streets<br />\nSafe and Efficient Service<br />\nNo Charge for Extra Passengers<br />\n'PHONE<br /><br />\nVERNON 1212<br />\n—<br /><br />\nFORA<br /><br />\nYELLOW CAB<br /><br />\nCHAS. CARROLL CLUB<br />\nANNOUNCES PARTY<br />\nIn order to hold a 'social<br />\nmeeting and at the same time<br />\nentertain outsiders, the Charles<br />\nCarroll Club will hold a card<br />\nparty tonight.<br />\nThis function marks the<br />\nfirst of its type on such a large<br />\nscale for the club, and anyone<br />\nis invited. It will be held at<br />\nthe Lord Baltimore Hotel,<br />\nBaltimore and Hanover Sts.<br />\nActivities will begin at 8.30<br />\nP. M. The admission price<br />\nfor a single ticket is 75 cents.<br /><br />\nDr. George H. Haynes, professor the victor but the result was that<br />\nof government in the Worcester no decision in favor of either team<br />\n• Is<br />\nPolytechnic Institute, has been se- was<br />\nforthcoming and a draw was<br />\nlected as the lecturer for the Jam@ declared. After entertainment folSchouler Lectureship. Dr. Haynes lowing the debate the team left at<br />\nwill render a series of six lectures 5:30 A. M. the next morning for<br />\nat' the Johns Hopkins University Emory, West Virginia. After a<br />\nate in Prophecy and Fulfillment.\" fourteen-hour trip, they arrived at<br />\nThe six, divisions are as follows: 9:16 P. M.<br />\nI. Wednesday, April 10: \"WritE. sad H. Wins<br />\ning the Specifications for the Sen- Emory and Henry College were<br />\nate.\"<br />\nthe opponents. The Hopkins team<br />\nII. Friday, April 12: \"Setting upheld the negative side of a slightly<br />\nSenate Precedents.\"<br />\naltered question: \"Resolved, That a<br />\nIII. Wednesday, April 17: \"The substitute for the present jury sysand<br />\nMaking<br />\nTreaty<br />\nin<br />\nPart<br />\nSenate's<br />\ntem be instituted.\" The debate was<br />\nNine Initiated<br />\nUnmaking.\"<br />\nheld in the Great Hall and drew an<br />\nApIV. Friday, April 19:\"Who<br />\nInto Cane Club<br />\naudience of, 300.<br />\nMonday. nine undergraduates points Officers of the United<br />\nDebating is quite a prominent acwere tapped in the traditional man- States.\"<br />\nEmory and Henry arid<br />\nner by L. Mosley Walker, president V. Wednesday, April 24: \"Those tivity at<br />\nnearly all the college participates.<br />\nof the Cane C-ltib[, in evidence of Senate Rules!\"<br />\nteams were ushered in to band<br />\ntheir acceptance into that organiza- VI. Friday, April 26: \"The The<br />\nmusic and before the debate a praytion. Afterwards they walked, dis- Changing Senate.\"<br />\ntinguished by their newly-won canes \"The James Schouler Lectureship er was offered.<br />\nand .carnations, down Charles Street was founded by Dr. James Schou- The decision was unanimously opin company with the old tally-ho in ler, of Boston. Dr. Schouler, who posed to the Hopkins team._ Emory<br />\nhich rode the members,of longer had been lecturing at the Hopkins and Henry has won twenty of its<br />\nUniversity since 1891, announced<br />\ntwenty-two debates this season, losThose who were initiated were his intention of founding the lecing only the two contests away from<br />\npenry Redue, Harry Love, William tureship it the university 'in 1908<br />\nSwope, James Willison, Pinckney and endowed $25,000 upon it. The home.<br />\nCraig,- Samuel Howe, Browne Ham first lecture, however, was not pre- The team arrived hc:tne on Friday<br />\nnds, Deely Nice, and Carey Sew- sented until 1909 and has been con- after its three-day trip.<br />\ntinued almost every year until the<br />\nard.<br />\npresent time. The wish was exThe Cane Club is one of the most<br />\npressed by the fOunder that the lec- NOYM5M-aM<br />\npicturesque of student orders at<br />\ntures be given annually if possible<br />\nCOMPLETE<br />\nHopkins, and its seml-annual tapn—<br />\n. . . and that persons of promise or<br />\npings are always affairs of interest<br />\nlecture,<br />\nto<br />\nselected<br />\nbe<br />\nprominence<br />\nA<br />\ntit<br />\nto campus spectators. That its apwho are capable of interesting as<br />\npeal as a spectacle is becoming more<br />\nwell as instructing an audience.\"<br />\ngeneral is attested by the picture of<br />\nthe ceremony published in the Eve- This year's lectures will be given Cs•I<br />\nE<br />\nat 5 P. M. in the Hall of the Civil et.<br />\nning Sun.<br />\nCT[le<br />\nEngineering Building and will be<br />\nR EADopen to the public.<br />\nTAYLOR<br />\nTHE -<br /><br />\nDI<br /><br />\nMAIL BAG<br />\nPhone, VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to us\"<br />\nTHE RELIABLE WEAVING CO.<br />\nMoth Holes, Burns, Tears, Cuts and Hill<br />\nDamages Made Perfect<br /><br />\nDEBATING<br />\nDr. Haynes Speaks<br />\n,<br />\nColumned from Page 4, Col. 3<br />\nfor Lectureship the audience was asked to decide<br /><br />\nTHE D. A. R.<br /><br />\na<br /><br />\nContinued from Page 2, Col. 4<br /><br />\nC090<br />\nPlans<br />\nIdeas<br /><br />\nArt Vork<br />\nTIParImItivt<br />\nengraving<br />\nembalming<br /><br />\nS<br /><br />\nMI<br /><br />\nirl<br />\n'$100 or $100,000<br />\nHETHER you have $100 or $100,000 to invest,<br />\nwe are interested in helping you to-invest it<br />\nsafely and profitably.,<br />\nGILLET 6' COMPANY has helped,thousands of individuals, banks, insurance companies and Other institutions<br />\nto secure sound investments for their funds and we will<br />\nbe glad to submit definite recommendations most Suitable<br />\nto your own individual requirements.<br /><br />\nw<br /><br />\nThe executives of GILLET 6' COMPANY are men of<br />\nlong experience in the investment field and are capable of<br />\ngiving sound advice on the important question of investing your money satisfactorily.<br />\n•<br />\nWe cordially invite you to visit our offices and discuss<br />\nyour investment problems with us, or, we shall be glad to<br />\nhave one of our representatives call on you at your convenience.<br /><br />\nGILLET 14 Co.<br />\neAlvIKERs<br />\nLIGHT .9 REDWOOD STS.<br />\nBALTIMORE, MD.<br /><br />\n.......0<br />\nrre.•1•1 .11,,,D10.•<br /><br />\nTelephone Calvert MI<br /><br />\nI<br /><br />\n`-&gt;<br />\nMn Invitation<br />\n,<br /><br />\nTo the Johns Hopkins students we extend a cordial invitation to come in and see our beautiful<br />\nhand•wrought Jewelry, our importations of ancient<br />\nand modern gifts. Prices very moderate.<br /><br />\nlit<br /><br />\nCARL SCHON, INC.<br />\n109 W. SARATOGA ST.<br /><br />\nFor Sweaters, Trench Coats, Slickers, Sporting Goods,<br />\nArmy Uniforms and Supphes, also Aviation Outfits, head<br />\nyour airship and land at the<br />\nOUTING SUPPLY CORPORATION<br />\n21 North Liberty Street<br /><br />\nWhen Better Used Cars Are Sold<br />\n0('eill Will Sell them<br /><br />\nANOTHER OPEN'LETTER TO<br />\ncampaigning for Radicalism; nor do<br />\nHopkins Students have a selection<br />\nM. J. SMULOVITCH<br />\nCALVERT<br />\nof practically all standard<br />\nwe believe that the D. A. R. ought<br />\nisoo•<br />\nDear Mr. Smuluvitch :<br />\n1802.1803<br />\nFolding<br />\nmakes and models<br />\nto support it. We quote the above<br />\n1804• 1805 4794<br />\nbinding<br />\n$100 to $1,000<br />\nMailing<br />\nWE ALSO REPAIR SILK DRESSES<br />\nPlease understand that this reply merely to shpw the very evident<br />\nSTREET<br />\nSARATOGA<br />\n208 WEST<br />\nto your criticism of my article, changes from the organization's rev- :ttof<br />\nBetween Howard St. and Park Ave.<br />\nBUICK COMPANY<br />\nNEILL<br />\n'THE<br />\nBaltimore, Md.<br />\n\"Dreiser,\" is in no way intended. olutionary principals to those of<br />\n'SERVICE<br />\nNew and Used Car Departments<br />\ncoma<br />\nonly<br />\nis<br />\nIt<br />\nSales &amp; Service<br />\nas tin apology.<br />\npresent day Rotarianism.<br />\nMount Royal fs' Maryland Avenues<br />\nStreet<br />\n26th<br />\n500<br />\nWest<br />\nmy<br />\nto<br />\nas<br />\n107 Mount Royal Ave.<br />\nment. Your implications<br />\n•<br />\nPerhaps the moseamuing thing<br />\nNews-Letter\"<br />\n\"The<br />\nof<br />\nquite<br />\nProducers<br />\n\"plagiarism\" are, of course,<br />\nAmerthe<br />\nof<br />\n\"Daughters<br />\nabout the<br />\ntrue. But what of it?' The.only ican Revolution Magazine,\" of<br />\nfault that I can find with' myself which you have already heard, is the<br />\nlies ill the fact that I did,not bring \"D. A. R. Movie Guide.\" This<br />\nout the fact that the article was not short department is.under the guidintended to -be considered as en- ing hand of Mrs. Newton D. Chaptirely my own.. Regardless of your man, who, we are told, is also chairpersonal opinion on the matter, such man of the Better Films Commitwas the case. My neglect was rath- tee. Let us consider a few of these<br />\nDrink<br />\ner regrettable, but that 'is as far as keen reviews; we will find Mrs.<br />\nAlso Dress Shirts, Colldrs,<br />\nI shall go.<br />\nChapman a great humorigt. BenchSilver Studs. Etc<br />\nYou will find accompanying this ley never did anything better than<br />\nSee 'N.-note, another article which, I hope, these:<br />\nDelicious and Refreshing<br />\nwill give your facile pen room for Canary Murder Case, The—ParH. GARLAND HERSHEY<br />\namount. A gripping mystery<br />\ncriticism. Let us hope so.<br />\nYours in expectation,<br />\nsolved by William. Powell as<br />\nAbout Special Price to Hopkins<br />\n,<br />\nthe detective. Children would<br />\nMen<br />\n\"BEN.\"<br />\n•<br />\nprobably not understand it.<br />\nCo.•<br />\nSpit<br />\n`i$ ••-•<br />\nWaldorf Dress<br />\nSUPPORT OF DANCES ASKED Land of the Silver Fox—Warner. A very good Rin-Tin-Tin<br />\nTo the Editor of the Ni.\\\\<br />\nCal. 5344<br />\nA<br />\npicture with Vitaphone effects. .<br />\n•<br />\n.<br />\nDear Sir:—<br />\nfamily.<br />\nwhole<br />\nThe<br />\nby<br />\ndances<br />\n4<br />\nst<br />\nof<br />\nschedule<br />\nsPring<br />\nThe<br />\nLittle Wild rat,' The—Warner.<br />\nthe Cotillon Board. is now in progjudge<br />\nKentucky<br />\na<br />\nabout<br />\nAll<br />\nress. A dance will be held every<br />\nwho hates aviators and his<br />\nONE. SOUL WITH BUT<br />\nSaturday for the students of the \"wildcat\" daughter who fell in<br />\nA SINGLE fliouGHTUniversity, and I would like to use<br />\nsophislove with one. Certain<br />\nTo PAUSE AND<br />\nthis means of making an appeal for<br />\nticated scenes make it unfit for<br />\ntheir support.<br />\nREFRESH HIMSELF<br />\n•<br />\nchildren.<br />\nThe dances can be successful In Old Arizona—Fox. First outAND NOT EVEN A<br />\nBingham, Maine<br />\nstuonly by the attendance of the<br />\ndoor talking picture. ExcelJan. 31, 1928<br />\nGLANCE FROM<br />\nenjoyable<br />\ndents, they can be made<br />\nWhen you've planned a trip for<br />\nlently photographed and acted.<br />\nfishing,<br />\nTHE STAG LINE<br />\nknows<br />\nBecause the bandit is made to<br />\nby the fact that everyone<br />\n,\\<br />\nAnd you've spent a lot of kale,<br />\ngets<br />\n/<br />\nBet the whole of your vacation<br />\neveryone else; so if crowd<br />\nappear 'a hero, this, unfortu-Enough's enough and too<br />\nOn some advertiser's tale<br />\nmuch is not necessary. Work<br />\ntogether and brings those it likes<br />\nnately, cannot be recommended<br />\nAnd you fish a lake of beauty<br />\nthe<br />\nhard enough at anything and<br />\nHidden in a land of dreams,<br />\nthere would be no question of<br />\nfor children.<br />\nsunshine<br />\ngot to stop. That's where<br />\nyou've<br />\nas<br />\nWhere the air is clean<br />\nbeing \"good.\"<br />\nAlias Jimmy Valentine—M. G.<br />\nHaunted by songs of crystal streams. dances<br />\n'<br />\nCoca-Cola comes in. Happily,<br />\ndeyou're<br />\nhas<br />\ninteresting<br />\nM. Intensely<br />\nComes the moment when<br />\nthere's always a cool and cheerful<br />\nAny surplus that the board<br />\ncasting<br />\ndivided<br />\nplace around the corner from anytective story with happy ending<br />\nat the end of the year is<br />\nAnd a smasher hits your line,<br />\nAnd an ice-cold Cocawhere.<br />\ngamester<br />\nthe<br />\n—showing the ennobling influThen you play him like a<br />\nequally between June Week and<br />\nCola, with that delicious taste<br />\nWith the battle going fine,<br />\nis<br />\nover hardened,<br />\ncause<br />\nlove<br />\nof<br />\nence<br />\nthe<br />\nso<br />\nAssociation<br />\nsilence<br />\nand<br />\nAthletic<br />\nand cool after-sense of refreshTill a snag, a yank,<br />\nany<br />\ncriminals. Adults.<br />\nAnd the line is hanging slack,<br />\nment, leaves no argument about<br />\nCertainly worthy enough. And<br />\nWhile you grit your teeth and whistle<br />\n_<br />\nothers,<br />\nto<br />\nquote<br />\ncould<br />\nhas<br />\nwe<br />\ncourse,<br />\nbody<br />\nOf<br />\nwhen,<br />\nwhere—and how—to<br />\nstudent<br />\nthe<br />\nsuggestions<br />\nAnd reel the fishline back.<br />\npause and refresh yourself.<br />\nthe but these, perhaps, will serve. We<br />\nTake the pipe and fill with Edgeworth, offer for the improvement of<br />\ngrin<br />\nV.•<br />\nLight her up and learn to<br />\nhave no fault to find with the D.<br />\nThe Coca-Cola ,Co., Atlanta. ge.<br />\ndances will be gladly considered.<br />\nThen by gum you are elected<br />\ntry A. R., for the society does not inTo the Club of Try Agin!<br />\nare not asking much, only<br />\nWe<br />\nON<br />\nMI LLI<br />\nA. R. M., Jr.<br />\nhow 'bout terest us that much. However, we<br />\nit once. Saturday night,<br />\nDAY<br />\nhave attempted to point out certain<br />\nYOU CAN'T SEA? THE<br />\nit?<br />\nand<br />\ncharacteristic<br />\niftHES<br />\namusing<br />\nPAUSE THA?<br />\nrather<br />\nSincerely,<br />\n,<br />\nmake<br />\ntreason,<br />\nbe<br />\nthis<br />\nIf<br />\nqualifies.<br />\nELDRIDGE,<br />\nGrade<br />\nHigh<br />\nJOHN<br />\nExtra<br />\nTO *HZ<br />\n0 Q 0,P .Lo -0-4T<br />\n. HAD<br />\nthe_most of it.<br />\nPresident, Cotillon Board.<br /><br />\nII<br /><br />\nLs.)<br /><br />\nNEW<br /><br />\nTUXEDOS<br /><br />\nFOR HIRE<br /><br />\n1PA14IE 4A11)<br /><br />\nRITRIS-Ift<br /><br />\nYIDLIIRAti<br /><br />\n1928 Isaac<br />\nWalton Goes<br />\nPoetic Now<br /><br />\n\"ea..<br /><br />\nEdgeworth<br /><br />\nSmoking.Tobacco<br /><br />\n12, 1929<br />\n1HE JOHNS HOPKINS NEWS-LETTER, APRIL<br /><br />\n4<br /><br />\n' Collegiate Liberal<br />\nDEBATING TEAM TAKES<br />\nConference to Be Held<br />\nTRIP CURING HOLIDAY V.<br />\nF. Calverton, of this city, ed-<br /><br />\nHOPKINS MEN GET<br />\nA BIG KICK OUT<br />\nOF LACROSSE<br /><br />\nLoses Two of Three Debates,<br />\nOne Is Draw<br /><br />\nIt's one of the traditional games of the college—and<br />\nwin or lose, every game is fought with a spirit that thrills<br />\nthe spectators.<br />\nHIM footwear gives the same \"kick\"—it's built to win<br />\nin any contest—no matter how keen the competition.<br /><br />\n$6.50 up<br /><br />\neN. HESS' SONS<br />\n8 E. BALTIMORE ST.<br /><br />\nThe MAY Co.<br />\nA Mocieri<br />\nFor Modem,<br />\nYoung Men....<br /><br />\nCA thouAht of Today—<br />\nThe season's styles in neckwear are the key to a man's<br />\ndress. .. they give that touch of personal effectiveness.<br />\n\"The Store of Standard Values\"<br /><br />\ne.McPHERSON'S<br />\nEotaflisheci 1862<br />\n11<br /><br />\nEast Baltimore Street<br /><br />\n\"Say it with Flowers\"<br /><br />\nitor of \"The, Modern Quarterly\"<br />\nand a nationally-known student of<br />\nthe labor movement, will conduct<br />\nTEAM IS ENTERTAINED<br />\nconcluding -dikussiott on the<br />\nthe<br />\nMcDorman, Littlefield<br />\ngiate Lib;<br />\nthe Intercol<br />\nofal<br />\ner<br />\nprogram<br />\nTeam<br />\non<br />\nAre<br />\nConference which ill be held<br />\nWilliam McDorn.an and John<br />\nat the Friends' Meeting House April<br />\nLittlefield, representing the Debat- 19, 20 and 21.<br />\nthree<br />\nin<br />\nd<br />\nparticipate<br />\ning Council.<br />\nThe subject of Mr. Calverton's<br />\ndebates during the Easter vacation<br />\nwill be \"What the Student Can<br />\ntalk<br />\nin the South.<br />\nand the speaker will outline the<br />\nDo,\"<br />\nMeet Raediolpis-Macen<br />\nwhich the student<br />\nOn Tuesday, April 2. the team various ways in<br />\nthe cause of liberalism.<br />\nmet Randolph-Macon at Ashland. can forward<br />\nwhose real name rs<br />\nVirginia. The subject debated was Mr. Calverton,<br />\nis a former student<br />\nthe one which was used in the George Goetz.<br />\nUniversity,<br />\nFreshman-Sophomore and Adams at the Jotms Hopkins<br />\nhis A. B. degree in<br />\ndebates here. \"Resolved, That the having received<br />\nJury System in Criminal Procedure 1921.<br />\nbe Abolished in the United States.\" Other prominent speakers on the<br />\nThere are two literary societies, conference program :include Father<br />\nthe Washington and the Marshall, John A. Ryan. professor of economat Randolph-Macon; the debate was ics at the Catholic University in<br />\nsponsored by. the former of these Washington: Norman Thomas, soand was held in the club rooms of cialist candidate for the presidency<br />\nthe society. About seventy-five in 1928, and Walter Ludwig, dispectators attended. A local min- rector of Pitpneer Youth.<br />\nister and a county superintendent of<br />\nAnswers to the conference invischools were among the judges.<br />\ntation are being received by the comThough the Hopkins team was mittee and -much interest is being<br />\nwell received, the deCision was two manifested by students in neighborto one against the team. After an ing schools and colleges. Large delovernight stay in Ashland, the team egations from a number of institujourneyed to Williamsburg to meet tions are expected to attend.<br />\nWilliam and Mary. They were enNine colleges in Maryland, Penntertained in the afternoon at the<br />\nWashington, D. C., are<br />\nbaseball game between Princeton sylvania and<br />\nexecutive comand William and Mary, and had din- represented on the<br />\np of the comner in the Senior Girls' dining hall. mittee. The membershi<br />\nV. F. Coe,<br />\nfollows:<br />\nas<br />\nis<br />\nmittee<br />\nthe<br />\nwhile<br />\nformal<br />\nwas<br />\nThe debate<br />\n, chairone at Ashland had been informal. Johns Hopkins University<br />\nSkeath, Goucher<br />\nThe subject was the same and the man; Catherine<br />\nman; M. A. PoHoykins team again upheld the af- College, vice-chair<br />\ngorelskin, University of Maryland;<br />\nfirmative side of the question.<br />\nLinda Chandler, ‘varthmore ColNo Judges<br />\nHood ColAn innovation was tried in judg- lege; Bertha Nixdorf,<br />\nMcLaughlin, Howard<br />\ning the debate. There were no lege; E. A.<br />\n; E. L. Heckert, George<br />\njudges and at the conclusion of the University<br />\nUniversity; Anita<br />\nn<br />\nWashingto<br />\nto<br />\nquesopened<br />\nwas<br />\ndebate, the floor<br />\nCollege; Caspar<br />\ntions from the audience. Finally. Short, Morgan<br />\nHart, Western Maryland College.<br />\nContmued on Page 3, Col. 4<br /><br />\nMADISON 5355<br />\nSEE<br /><br />\nJONES CHEVROLET SALES CO.<br />\nVALUES,<br />\nFOR BIGGER AND BETTER<br /><br />\nCabriolet-.$535<br />\n1928 Chevrolet Sport<br />\n525<br />\n1928 Chevrolet Landau<br />\n494<br />\n1728 Chevrolet Sedan<br />\n435<br />\n1928 Chevrolet Coupe<br />\n435<br />\n.,<br />\n1928 Chevrolet Coach<br />\n450<br />\n1927 Chevrolet Cabriolet<br />\n400<br />\n1927 Imperial Landau.<br />\n395<br />\n1927 Chevrolet Sedan<br />\n354)<br />\n1727 Chevrolet Coupe<br />\n350<br />\n1927 Chevrolet Coach<br />\n260<br />\nCoupe<br />\n1926 Chevrolet<br />\n260<br />\n1926 Chevrolet Coach<br />\n210<br />\n1926 Chevrolet Roadster<br />\n75<br />\n1924 Chevrolet Roadster<br />\n125<br />\n1924 Chevrolet Sedan<br /><br />\n1927<br />\n1927<br />\n1920<br />\n1920<br />\n1926<br />\n1924<br />\n1925<br />\n1926<br />\n1925<br />\n1926<br />\n1925<br />\n1923<br />\n1924<br />\n1923<br />\n1922<br /><br />\nPontiac Landau<br />\nPontiac Sedan<br />\nFord Model A Tudor<br />\nNash Coach<br />\nEssex Coach<br />\nMarmon Touring<br />\nDodge Touring<br />\nFord Roadster<br />\nFord Roadster<br />\nFord Touring<br />\nFord Touring<br />\nFord Roadster..<br />\nChevrolet Touring<br />\nCole Sedan<br />\nHupp Coupe<br /><br />\n$483<br />\n4607<br />\n475<br />\n450<br />\n295<br />\n365<br />\n' 163<br />\n145<br />\n125<br />\n130<br />\n150<br />\n50<br />\n50<br />\n55<br /><br />\nOPEN EVERY DAY AND NIGHT<br />\nST.<br />\nMT. ROYAL AVE. at McMECHEN<br /><br />\nROYAL<br /><br />\nTYPEWRITERS, ALL MAKES<br /><br />\nCORONA<br /><br />\n- OA. W. LUcY &amp; CO.<br />\n104 WEST FAYETTE STREET<br />\nTelephone CAlvert 5902<br /><br />\nOldest and Largest Corona Dealers in State<br />\nHAMMOND<br /><br />\nUNDERWOOD<br /><br />\nArt)MB<br />\n21 1 2 1 3<br /><br />\nE BALTIMORE ST.<br /><br />\nTAILORING DEPT.<br /><br />\nt.A New Feature.)!<br />\nSpring Suit Tailored<br />\nto Your Measure<br /><br />\n$4°<br /><br />\nGEO. M. PLEINES<br />\nFlorist<br />\n7C—X<br />\nSTALL 69 V 70, NORTH AVE MARKET<br />\nBALTIMORE, MD.<br /><br />\nSmart Collegians Are Wearing<br />\nTHE TRENCH COAT, $12.50<br /><br />\nWhither away,<br />\nSir 161:9fIii?<br /><br />\nA lightweight, puttrcolored, waterproofed coat that has plenty of<br />\ndash and swagger. Trimmed with leather buttons and buckles.<br />\nThe newest thing out<br />\nSecond Floor<br /><br />\nSTEWART&amp;GD<br />\nTHE GIANT<br />\nPOWER FUEL<br /><br />\nESSO<br /><br />\nNEW LIFE<br />\nFOR MOTOR<br /><br />\n\"STANDARD\" MOTOR OIL<br />\nThe Measure of al Value<br />\nSTANDARD OIL<br /><br />\nCOMPANY OF N. J.<br /><br />\nZIJG<br />\nWere's a knightly warrior, immortalized<br /><br />\n$8.50<br />\nBrown Zug-Grain<br />\nA sturdy new shoe for young men with a<br />\ngenerous measure of style . . . and priced to<br />\nfit a Scotchman's purse.<br /><br />\nby<br />\nStephen Leacocic, who under the stress of<br />\n. nse excitement\"mounted his horse and rode<br />\naway in all directions.\" 'Whether he ever ar- _INkved is not recorded.<br />\n7—<br />\n'To us, this giddy hero is a perfect example<br />\nof how not to make cigarettes. We hold that a<br />\ncigarette is a smoke, and a good smoke is a blessing, so to that end alone have Chesterfields<br />\nbeen ripened, blended and manufactured.<br /><br />\nMild as they are, not a jot of the true, rich<br />\ntobacco flavor has,ken lost. When the best<br />\ntobaccos on the nErket are bought you can<br />\nbe certain they'll deliver the taste. Chesterfields<br />\nare as natural as a field of sweet clover;<br />\nand they satisfy the taste superlatively well,<br />\nalways!<br />\nOnce a man has checked up on the above<br />\npleasant news, there'll be no \"riding away in<br />\nall directions\" for him!<br /><br />\nCIH ESTERTI ULM<br />\nMILD enough for anybody.. and yet..THEY SATISFY<br /><br />\n•MOO TOMO*CO.<br />\n,<br />\nLOGO<br /><br />\n'.<br /><br />\n2<br /><br />"}], "field_media_file": [{"target_id": 38402, "display": null, "description": null, "target_type": "file", "target_uuid": "32f70c61-cd70-4c92-a404-af5a7e196d8f", "url": "http://digital.library.jhu.edu/system/files/2022-03/13369-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13369, "target_type": "node", "target_uuid": "5e04f8d1-e856-4e7c-819a-b92ea7211bed", "url": "/node/13369"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "971a9e50-a386-4bf2-b463-27df96a1d711"}]}