{"mid": [{"value": 37509}], "uuid": [{"value": "0b20d9d5-68d9-40f8-9018-479b038c4b6e"}], "vid": [{"value": 37509}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:33:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13367-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:33:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:33:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "SEITSSITT<br />\nSPRING TICKET DRIVE<br />\nGETS UNDERWAY TODAY<br />\n<br />\nPrice 5 Cants<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., MARCH 26, 1929<br />\n<br />\nVol. XXXIII, No. 41<br />\n<br />\nTRYOUTS CALLED FOR<br />\nADAMS DEBATE<br />\ngarland Hershey, president<br />\nof the Debating Council, has<br />\nannounced that tryouts for the<br />\nJunior-Senior debate Will be<br />\nheld todily and tomorrow at<br />\n12.20 in G. 112.<br />\nThe Juniors will try out today, while the Seniors will<br />\nmake their appearance tomorrow.<br />\nEach member of the winning team will be awarded fifteen dollars worth of books.<br />\nThis prize is known as the<br />\nAdams award and should<br />\nbring many men, interested in<br />\ndebating, out to show their<br />\nability, in this line.<br />\n<br />\nCOLLEGIATE SERENITY UPSET<br />\nBY VISIT OF FIRE ENGINES<br />\n<br />\nPLUM NAMED EDITOR<br />\nOF 1929 HANDBOOK<br />\nAt the last meeting of the<br />\nY. M. C.'A. Cabinet the staff<br />\nof the 1929-30 ilandbook was<br />\nchosen. This is published by<br />\nthe \"Y\" each year. It is more<br />\ngenerally known to the Campus as the \"Freshman Bible.\"<br />\nThe new staff consists of<br />\nHarold J. 13loom, Editor;<br />\nGeorge H. Dowell, Business<br />\nManager, and A. Pemberton<br />\nJohnson, Associate Editor.<br />\n_<br />\n<br />\nPASAREW IS ELECTED<br />\nPTAIN OF QUINT<br />\n<br />\nSirens piercing the air. . . . The hoses. . • . Fire engines soon reach<br />\nrumble of heavy, fast-rolling truck the spot. ... No less than five vehiForward Chosen to Lead Jay Five<br />\nPrizes to Be Awarded Winning<br />\nwheels through the tunnel of Gil- cles already have come up.<br />\nDuring 1929-30 Season<br />\nTeams and Individual<br />\nman Hall. . The brazen clang of Town-ward bound motorists with<br />\nOF TWO YEARS<br />\nVETERAN<br />\na resounding fire truck gong. . . . screaming brakes bring their cars to<br />\nCOOPERATION IS URGED<br />\nstick<br />\nand<br />\nStreet<br />\nIs Expected to<br />\nCharles<br />\nTeam<br />\nEntire<br />\non<br />\nstop<br />\na<br />\nout<br />\nleading<br />\ndoor<br />\nthe<br />\nSlamming of<br />\nReturn Next Year<br />\nCommission to Be Paid on All<br />\nto the tunnel. The uneven beat of curious heads through windows to<br />\nTickets Sold<br />\nlsador A. Pasarew was elected<br />\nmany hurrying feet. . . . Students view the scene. ... A patrol-wagon<br />\nmoving with unusual speed.... The makes its appearance. . . . Gamy<br />\ncaptain of the 1929-30 varsity basThis week marks the beginning<br />\nseabanquet<br />\nformer<br />\nof<br />\nreminder<br />\nketball team at a banquet held at the<br />\nlethargy and calmness of a spring<br />\nof an intensive spring season ticket<br />\nmorning broken. . . Shouts of sons. ..<br />\nHotel Emersoh on last Friday<br />\ncampaign, conducted by the Athletic<br />\nFire!, where is it? and scoops for<br />\nnight. Pasarew succeeds John Lang,<br />\nAssociation. As in the past, chief<br />\nFire hoses are dragged out. . . .<br />\nthe NEWS-LETTER! all echoing A blue-coated figure plays a steady<br />\nwho has captained the quint during<br />\nreliance is fleing placed on. the<br />\n•<br />\nthrough the tunnel.<br />\nthis, its first major season in many<br />\nternities in spreading these ickets<br />\nstream of water on the burning logs<br />\nStudents rushing through the tun- and underbrush. . . . The chemical<br />\nyears. The captain-elect is a memthroughout Baltimore.<br />\nnel barely missing a long, canvas- hose is pulled out and turned on.<br />\nber of the Class pf '31, while Lang<br />\nTerms of Awards<br />\ncovered fire hose. . . . The red fire- . . . A stream, of chemical rushes<br />\nis a member of tO.,<br />\nIn a letter to the presidents of the<br />\nchief's car I bursting through the skyward from a break in the hose. Team Has Best Group of High<br />\nPaul Menton in his column<br />\nvarious chapters on the campus,<br />\nJumpers at Hopkins in Years<br />\ndampness and dim light of the tun- . . . . This fact is greeted by \"The<br />\n\"Shootin\"Em\" in the Evening Sun,<br />\nHenry Iddins, Business Manager of<br />\nnel. ... Students eagerly following. chemical is busted, chief! . . . The After over two weeks of hard made the comment &ring the seaAthletics, has made known the terms<br />\n. .. The chief's car halts at the ten- streams of water keep playing on preliminary training the track and son that Pasarew was the most imof sale and the awards to be given.<br />\nnis courts near Remsen. . . . The the slow, smoky fire for five min- field squad of some forty candidates proved man playing college basketDuring the past two years there has<br />\nchief goes ahead to reconnoiter. ... utes. . . . Students, panting and is being rounded into shape.. Few ball in this section, when compared<br />\nbeen paid a 5 per cent commission<br />\non all tickets sold. This has spurred Norman Thomas, Late Socialist The hook-and-ladder team calls a warm from their eager run over the of the consistent pointers who made with last year's showing.<br />\nmomthIt's stop. . . . Sergeant Frank campus, stand around and show un- it possible last year for Hopkins to<br />\nCandidate, to Speak<br />\non ,individual effort, but has doir<br />\nSeven Awarded tatters<br />\nrushing across the lawn in front of usual interest in the procedure. Re- win every dual meet have returned<br />\nSeven players were awarded their<br />\nlittle to enlist the aid of groups. Be150 EXPECTED<br />\nNEws-LETTER<br />\nA<br />\nlet's<br />\n.<br />\nAmong<br />\nyear.<br />\nthis<br />\nthe<br />\ndormitory...<br />\nall$lover;<br />\nuniversity<br />\nto<br />\nthe<br />\nit's<br />\n\"Well,<br />\nof<br />\nletters. These were Lang<br />\nmark<br />\nvarsity<br />\nAssociaAthletic<br />\nthe<br />\ncause of this,<br />\nStudents Will Discuss Social<br />\nman eager for views runs eagerly go.\" . .. Students trekking over the those who will help in this direction (captain), Pasarew (captain-elect),<br />\ntion is Offering a prize of $25.00 to<br />\n4 Problems<br />\nis Captain Herman Schiebel, who, Debuskey, Horst, Jung, Bernard,<br />\nahead. . . . Frank, pantingly yells path back to the Barn. . . .<br />\nthe tlain having the highest total<br />\nWilliam and Johnson. In addition to this,<br />\nof sales, a prize of $15.00 to the \"Liberalism in Education\" will be out, it's up in the woods.<br />\noh the end of Straus along with Robert Kelley,<br />\npatch<br />\nA<br />\nman<br />\nMiller, and Yen Onorato, from the John Eldridge '29, manager of the<br />\nteam having the next greatest total the subject of a conference spon- The hardy NEWS-LETTER<br />\nField, soaking with chemicals and<br />\nof sales, and a prize of $10.00 to the sored by the Johns Hopkins Liberal hurries ahead of the fire-fighters. water. . . . A patch 15 feet square cross-country team, Will fit nicely quint, was given his major letter.<br />\nof a<br />\nin the distance run. At the same time, announcement<br />\nindividual having the greatest total Club April 19, 20 and 21. The pur- . . . Braving unknown terrors<br />\nttered with charred embers, giving into the place<br />\nGwinn.<br />\npose of the conference will be to possiby devastating fire, he bol<br />\nwas made of the election of Jack<br />\nof sales.<br />\noff an odor of wet smoke.. . . And, vacated by Richard<br />\nof<br />\nscene<br />\nThe<br />\ndistance men Purcell, '30, to the position of manstimulate interest among college stu- ventures forward. ...<br />\ntomorrow, probably an article by Other promising<br />\nSame Type as Last Season<br />\nreached.<br />\nso- the exciting conflagration is<br />\nare Shaver, Reeder, Gardner, May- ager for 1929-30.<br />\nThe season ticket which is offered dents in economics, political, and<br />\non forest fire precomes to the fire still un- the State Forester<br />\nnard, and Hancock. The last two Of these men, Johnson is the onis the same type as that sold during cial problems, and to encourage the . . . He<br />\nvention.<br />\non marked by the limiting forces of fire<br />\nare freshmen. Schiebel ran close to ly man who is absolutely certain not<br />\nthe past year. It has five major ad- establishment of Liberal Clubs<br />\nTotten of Union College in the two- to return. Debuskey may not play,<br />\ncampuses where none exist.<br />\nvantaieS. These are:<br />\nOACH DECLARES MANY<br />\nTENNIS TEAM TO PLAY<br />\nNoted Speakers<br />\nmile championships at the Middle but there is no certainty that the<br />\n1. It is transferable.<br />\nOPEN<br />\nJOBS<br />\nLACROSSE<br />\nTRIP<br />\nOne of the features of the conTWO MATCHES ON<br />\nstates—one of the fastest college stellar center of the last two years<br />\n2. A coupon can be used for each ference will be the attendance of<br />\nImportance of Second<br />\nraces of the season.<br />\nNew Men Threaten Position<br />\nwill not return to the court. Great<br />\nperson presented at the gate.<br />\nTeam Stressed<br />\nseveral of the most prominent libof Veterans<br />\nMiddle Distances Weak<br />\nhopes are held, because of the re3. It gives the purchaser the right. eral'leaders in the country. Norman<br />\nof<br />\npractice In the sprints, Edwin Lockard turn of all the team, for a chamto use the entire number of cou- Thomas, Socialist candidate, for Tomorrow morning at 11.30 the With just two weeks<br />\ngame and Philip, Ness are back. This pionship five next year.<br />\npons contained in the book at any President in the last campaign and tennis team will leave for Char- remaining before the opening<br />\nof the 1929 lacrosse schedule on will be Ness's last year, but Lock- During the banquet, short talks<br />\none game.<br />\nfor years Executive Director of the lottesville to open the 1929 season April 6, Coach Van Orman said hard, a sophomore, has a relatively<br />\nwere made by George Darley,<br />\n4. Two children will be admitted on League for ,Industrial Democracy, with the University of Virginia. The<br />\none adult's ticket at any of the will speak on \"The College Student team will spend the night there and last week that, \"There are plenty long track- life ahead of him. coach; Dr. Ray Van Orman, athof jobs still wide iopen.\" The Hop- \"Greenie\" Morrison and \"Shorty\" letic director; Henry Iddins, Major<br />\ngames.<br />\nas a Potential Voter.\" Father John practice in the morning. The match<br />\nthat all the Wilson, formerly stars at Forest McKinney, Lang, and Pasarew.<br />\n5. For the\" game with Maryland on A. Ryan, head of the Department will ' begin at 2 P.. M. The rac- kins mentor also stated<br />\nMay 25th at the Stadium, re- of Political ,Economy at Catholic queteers will spend another night at men are being tried out to find just Park, are looking good in the Dave Kaufman, who assisted in the<br />\nis still dashes. Lockard, it will be remem- coaching, acted as toastmaster.<br />\nserved seats may be obtained in University; and one of the foremost the University and leave the follow- who's who, but that there<br />\nthis bered, also built his reputation at Chief emphasis was laid in all the<br />\nexchange for one coupon for one liberal thinkers, will take for his ing morning for Lexington, arriving a long way to go. Of course,<br />\ntvith the same high school. Other prom- talks, upon the problems that conadult seat and one coupon for topic \"The Meaning of Liberalism.\" at that point about noon. That af- situation_yvas to be expected<br />\nfrom ising dash material is found in Wil- fronted the team this year, especialtwo children's seats. Box seats, Either Paul Blancharg or Walter ternoon Captain Brockman will lead only three veterans returning<br />\nteam.<br />\nlison, Johnson, Selsky, Cordi, Fior, ly that of a lack of suitable cage or<br />\ntwo coupons for one adult's seat, Ludwig will lead a;Amnion on his men against W. L. The team last ye'ar's championship<br />\nand Neu. Ashton Devereaux has gymnasium. The loss of time and<br />\none coupon for one child's seat. \"Students in Industry.\"<br />\nwill remain in Lexington that night, Every day the squad goes<br />\na hard scrimmage for over recently come out.<br />\nthe inconvenience which resulted in<br />\n.<br />\nSizes of Books<br />\nA number of other very interest- leaving for Baltimore Saturday through<br />\nan hour with the first attack play- Coach Waldo Hambleton finds using Carlin's as a practice floor was<br />\nThe books of tickets are offered ing meetings are also planned, morning.<br />\ning the first defense and the second the greatest weakness in the middle dwelt upon, and hope was exfor sale in the following sizes:<br />\nNew Men Promising<br />\namong them a series of round table<br />\nattack matched against the second distances. Here \"Spoke\" Wheel- pressed that before next season a<br />\nFor adults:<br />\nwill<br />\ntrip<br />\n,the<br />\npolitimake<br />\nto<br />\nand<br />\nteam<br />\nThe<br />\neconomic<br />\non<br />\ndiscussions<br />\n$10.00<br />\ndefense. The fact that the first at- er's little running mate, John Yel- suitable cage might be erected here<br />\nBook of 12 coupons<br />\nfolthe<br />\nthe<br />\nfrom<br />\nof<br />\nselected<br />\nbe<br />\nmembers<br />\nprobably<br />\nby<br />\ncal problems, led<br />\nlot, should prove valuable, together at Homewood.<br />\n5.00<br />\nBook of 6 coupons<br />\nHelmholtz,<br />\ntack<br />\nand the fire defense never come<br />\nas<br />\nIrons,<br />\nwell<br />\nmen:<br />\nas<br />\nlowing<br />\nHopkins liberal group,<br />\nFor children under 18 years of age: visiting student delegates. The com- Warfield, Goldberg, Salabes, •Shu- up the same two days in succession with Hugh Emerson, Dunning,<br />\nSchedule Is Attractive<br />\nPerry, and Lockard. Loiseaux has<br />\n5.00<br />\nAlthough the schedule for next<br />\nBook of 12 coupons<br />\nmittee in charge of arrangements ,.gar, Gump, and Brockman. Gump is sure proof of the coach's state- been added recently to the list of<br />\n2.50<br />\nnot complete, announcement<br />\nBook of 6 coupons<br />\nexpects the conference to be one of and Brockman are the only veter- ments; This is a Year when every those out for the one-fourth and year is<br />\nwas made that games had been<br />\nA great number of these books of the most unique and important<br />\nat University man 'will have his chance to prove one-half mile events.<br />\nhas'played<br />\nIrons<br />\nans.<br />\nscheduled with Army, Fordham,<br />\ntickets were distributed at chapter events in collegiate circles in recent<br />\nof Delaware and Warfield at Ge- whether he knows enough lacrosse<br />\nField Events L.<br />\nRutgers, Catholic University, Duke,<br />\nmeetings on last Wednesday night. years.',<br />\nAlthough Garland Hershey and Virginia, and Temple, and that a<br />\nAll wishing to obtain these tickets The Liberal Club holds its meet- neva College. The new men have to play a first string position.<br />\non game with William and Mary was<br />\ncan .purchase them at the office of ings every Monday,lat 1 P. M. in shown such good form that the two \"Father Bill\" Schmeisser said at \"Bumps\" Scheidt show, up well<br />\nthe hurdles, they will have to vie pending. These games, of course,<br />\nthe Athletic Association in_Remsen room 315, Gilman Hall. Everyone veterans are expected to play rather<br />\nthe lacrosse organization meeting for honors with Stafford and Cordi.<br />\nare in addition to the fixtures with<br />\nHall.<br />\nfar down on the ladder.<br />\ninterested is invited to attend.<br />\nearly this spring the success of last Scheidt and Quirk are contending Maryland, St. John's, and Loyola.<br />\nVirginia is expected to offer the year's team was primarily due to the for the Hopkins pole vaule record, All attempts to schedule a One<br />\nMany Home Games on<br />\n'stiffer opposition of the two teams fact that the second team could al- and so far it's either's race, with a with Washington College have been<br />\nToday Marks End of<br />\nnamed Donovan in the unavailing, because of conflict in<br />\nLacrosse Schedule<br />\nR. 0. T. C. Inspection to,be played. Alphonse Smith, for- ways give the first team a good fight freshman<br />\nrunning. Garrett, a winner against dates.<br />\nexpectcourse,<br />\nof<br />\nof<br />\nis<br />\nis,<br />\nschedule<br />\nstar,<br />\ninspection<br />\nTome<br />\nmer<br />\nThis year's lacrosse<br />\nToday concludes the<br />\nin the daily scrimmages. Again this Maryland last year; Quirk, Caldschedule shows a much more<br />\none of the most attractive ones that the local infantry and engineering ed to take his match, but the Jays<br />\nyear the ,second team is close on the well, and Shirley, a freshman, con- The<br />\nthan<br />\nis<br />\nseasons<br />\nwhich<br />\nhas been arranged for many<br />\nunits of the R. 0. T. C.,<br />\nhope to open the season with a vic- heels of the first. No man can af- stitute the best group of high jump- comprehensive group of games<br />\nyear. Of particular<br />\nthis<br />\npast. Our two oldest friendly ene- being made by Major Alexander M.<br />\nmade<br />\nthat<br />\nthe<br />\nat<br />\nmatches<br />\ntory by winning the<br />\nford to let up one minute if he ers that a Johns Hopkins track out- note are the contests scheduled<br />\nmies, St. John's and the University Patch, Inf.; Captain Samuel N.<br />\naccording to<br />\nLast year's team<br />\nwishes to keep his job, for no job fit has had in years,<br />\nof Maryland, will again be played Karrick, Eng.; and Captain William end of the line.<br />\nwith Army and Rutgers. No team<br />\nthis spring and the old spirit of Louisell, Inf. These officers re- pulled a surprise by beating the is sure on a Hopkins' lacrosse team. the coach.<br />\nis a keener rival than the soldier<br />\nCordi,<br />\nHershey,<br />\nNeu,<br />\nStafford,<br />\n\"win, or Aie in the attempt,\" does viewed the battalion at 4.15 P. M. Charlottesville outfit and the Blue The interested crowd continues to<br />\nboys from the Point, while the name<br />\nTrattner, Wilson, and Shavitz are<br />\nnot seem lig be lacking in any degree yesterday and have been attending Jays will be out for another victory.<br />\nof Fordham is synonymous with<br />\nthe<br />\nup<br />\nkeep<br />\nto<br />\non<br />\nUnivercan<br />\nwhat<br />\nthey<br />\nafternoon<br />\ndoing<br />\neach<br />\ngather<br />\nto- Unless the W. & L. team shows<br />\namong this triangle of rivals.<br />\nthe best in basketball circles.<br />\nthe classes both yesteMay and<br />\njump<br />\nbroad<br />\nthe<br />\nin<br />\ndone<br />\nwork<br />\nfine<br />\nsity Parkway, where a row of parkthe students<br />\nTwo staing colleges have been day, where they quiz<br />\nconsiderable improvement over last<br />\nA maed cars occupies most of the avail- last year by \"Eggs\" Vivell.<br />\nthe conduct of<br />\nadded to our list of opponents for directly and watch<br />\ntheir<br />\nwin<br />\nshould<br />\nHopkins<br />\nyear,<br />\njor problem on the coach's hands Talks at Banquet<br />\nunthe<br />\nable curb space. Doubtless<br />\nthis spring; namely, Rutgers and the work.<br />\nis to find an adequate successor to<br />\nbasis this match at Lexington.<br />\nRevive Hopes of Cage<br />\ninitiatel find the peculiar physical Paul Walp, holder of the Hopkins<br />\nthe University of Pennsylvania. Rating is on a different<br />\nbeing<br />\nunit<br />\neach<br />\nOrman,<br />\nRutgers was among the teams that year from formerly, satisfactory,<br />\nexercises the squad goes through javelin-throw record. A veteran, The speeches of Dr. Van<br />\nthe basIt will not be necessary<br />\nwere in the Olympic play-off last classified as excellent,<br />\nqualify Mr. Iddins, and others at<br />\nto<br />\nremoved<br />\ntry<br />\nfar<br />\nto<br />\nquite<br />\nwilling<br />\nis<br />\nscrimmage<br />\nbefore<br />\nBurke,<br />\nan<br />\nto<br />\naccording<br />\nfor members of the NEWSketball banquet have revhed hopes<br />\nyear and promises to have a very or unsatisfactory,<br />\nyears,<br />\nfrom the popular conception of a and so are Woods, Shirley, and<br />\nLETTER Editorial Staff to<br />\nabsolute standard. In past<br />\nof having a cage built before next<br />\nstrong twelve this year.<br />\n.Berger,<br />\nJim<br />\nof<br />\nloss<br />\nThe<br />\nNEWSCaldwell.<br />\nthe<br />\nat<br />\npresent<br />\nbe<br />\nin<br />\nunits<br />\nfinished, smoothly functioning Hopseason. Thus far, the cage<br />\nafter the inspection of all<br />\nLETTER office on Tuesday,<br />\nPaul Hill, and Bob Fowler Will be year's<br />\nAs in the past few years, Rankins championship lacrosse team.<br />\ngiven area had been completed,<br />\ncommittee has in hand, in pledges<br />\n2. The next issue of<br />\nApril<br />\ndisand<br />\nthe<br />\nshot-put<br />\nin<br />\nfelt<br />\nkeenly<br />\ndolph-Macon and Swarthmore will a<br />\nexpected that between 100 and 150<br />\nthe NEWS-LETTER will not<br />\nNevertheless these exercises are es- cus-throw. Kutcher, a burly line- and cash, something over $30,000.<br />\nagain be played, and these two<br />\nat<br />\nbe published until Tuesday,<br />\nstudents will attend, and that<br />\nto building up all-important man, and Big Bill Dorman, just en- The original estimated cost of the<br />\nsential<br />\nHomegames will both be played at<br />\nrepreApril 9.<br />\ncage was around $150,000.<br />\nleast thirty colleges will be<br />\nContinued on Page 2, Col 4<br />\nstamina.<br />\nwood.<br />\nsented.<br />\nContinued on Page 3, Col. 4<br />\n<br />\nLIBtRAL CLUB CALLS<br />\nEDUCATION CONFERENCE<br />\n<br />\nPROMISING TRACK SQUAD<br />\nROUNDS INTO SHAPE<br />\n<br />\n\f26, 1929<br />\nTHE Xl04-1.N.S. HOP1UN5 NEWS-LETTER. MARCH<br />\na Day<br />\nAt Your Service 24 Hours<br />\n<br />\n=MS<br />\n<br />\nINTERCOLLEGIATE NEWS --<br />\n<br />\n-<br />\n<br />\nszie<br />\nlahmertrate.<br />\n<br />\nFIRST HALF-MILE<br />\n-Mile<br />\n10c each additional Half<br />\nor fraction thereof<br />\n<br />\n7t<br />\n_<br />\n<br />\n_<br />\n<br />\ntrzerbe. ai reemidi-e.:.ese niettter Deeter:Dcz<br />\nXtt—, auks Act vf.<br />\n<br />\n1718 N. Charles Street<br />\n<br />\ninizad to gint laiighez<br />\n<br />\n_kkhoingh Stchlrariestvis rx-eib<br />\n- aver-hot zo-i.oth<br />\n\"iiont'otgoe<br />\n<br />\nFirrysim<br />\n<br />\n20c<br />\n<br />\noi<br />\n<br />\n-<br />\n<br />\nfor I to 4 pausragers<br />\nThe ',nose rate applies<br />\n<br />\n7:t<br />\n<br />\nCOMPARZI<br />\n<br />\nPvitakiebed senn-greeit-7<br />\n. y<br />\nBarkens Viiikverek<br />\n<br />\n_<br />\nS<br />\n<br />\n,77L ft<br />\nvie<br />\nSS<br />\nSamighege<br />\nSS<br />\nILA.1.46cEseito v3..eds<br />\nOt<br />\narneks<br />\nBinninimp terrerarty_<br />\n-entreiVise IlEnelen-en<br />\nDRAB; her everesnisvstoms<br />\n<br />\n15% (Discount<br />\nOn All New Puh:.,,,r,<br />\nAt tr.,<br />\n<br />\n:<br />\n<br />\nTE 13GDKSHOP<br />\nSIGN OF THE FRIGA<br />\nHOWARD STREET<br />\n<br />\nTellipisse<br />\nEDITORiAL<br />\n<br />\nDEPARTMENT<br />\n<br />\nPEN Ev52(iNCiS<br />\n<br />\nc.A.' H. FETTING<br />\n-...MANUFACTURING JEWELRY CO.<br />\n<br />\n. _<br />\n77-it<br />\n<br />\n7. \"...I&<br />\n<br />\n7<br />\n<br />\n▪<br />\n<br />\nManufacture':<br />\n<br />\nfJf Oregon,<br />\n- -72 r_X7<br />\n<br />\nE.J•14.<br />\n<br />\n.7 ,\"<br />\n<br />\nE P-Artser<br />\nH.<br />\nY V<br />\n..i416. -Z.<br />\n,<br />\nfkle<br />\n<br />\nGreek Letter Fraternity Jewelry<br />\n_n -L▪ LOa<br />\notivered tche so-<br />\n<br />\n.7.et<br />\nrhia<br />\n<br />\n3L. Hs:7u:<br />\n<br />\nt ta<br />\n:<br />\nboa<br />\n<br />\nfeka brocie=<br />\nOrigr3 by tks art r<br />\n<br />\nSTICYHEX E. FTEEXaltALE, 31<br />\nILISMENS DEPA.RTMENT<br />\n<br />\n-<br />\n<br />\n-<br />\n<br />\ncruelty Whm.<br />\n<br />\nYeantrer<br />\n<br />\nThe Res.d-Tay:,r Compalty. 1.4err!<br />\n<br />\nu Bt<br />\naiih<br />\nbtrif<br />\nln\"<br />\nghe cAnkle-gashioned Oxford<br />\n<br />\n_1-11she)<br />\n<br />\n5J-1.<br />\n,<br />\n7,77.7<br />\n<br />\nthe 7.11<br />\n<br />\n•.‘- plane<br />\n, T1:11<br />\n.1*\".5...<br />\nnoii:; to a/high<br />\non,: tratuported<br />\n7ti..t.7.:7. nil a feu- mules from the campus,<br />\n--<br />\n<br />\nH.A.RZY 0. Scrams. JIL, \"21<br />\n<br />\nneetineimit nonteilI1.1a<br />\nJesikiiegia.. 111<br />\nJam<br />\n1411* r_ older, -as<br />\nnewsy T. seemecre.<br />\n<br />\n314 NORTH CHARLES STREET<br />\n<br />\n7 -±ie p,sycl.-_ bsn?ETC-1K on -2..t.st stoolnots in<br />\n<br />\ntire field. raragong f<br />\n<br />\nOtorst<br />\n<br />\nCereaktilit<br />\nRommer<br />\nAirerturtry Stcf<br />\n1.<br />\naa H_<br />\nGas Hart, 11<br />\nI<br />\nr<br />\nRaney<br />\nS. Prim\", 12<br />\n<br />\neat,/<br />\n<br />\n(Opfyi,7i,te<br />\n<br />\nt7<br />\n.<br />\n<br />\nJamie,<br />\n<br />\nAderrafuti Mensiorr<br />\nGams W. Gaasars, '29<br />\nWiles Sty<br />\nTineturv<br />\n<br />\n515 NORTH<br />\n<br />\n_<br />\n<br />\nEstite.t.ireinef<br />\nGakoca E. Bars,<br />\nA.tinetant Msreseting Etliter<br />\nMarratring &diger<br />\nGems Gtrirr.<br />\nPamir W. Nom 29<br />\nA.Seeraitts Eist•Yrs<br />\nRomer & SUM WO<br />\nINuesa EL Darrow '2;/<br />\n<br />\nFaelnurt L Fettl.v_<br />\nLeseart SYrA.Co-r..<br />\nred W. Ifivess,<br />\ncoarse IL Dark& 11<br />\nHobertVSartasen. -at<br />\nwoes wets. 1*<br />\nMalt OW.<br />\nHive.<br />\nlisivied<br />\n<br />\n-<br />\n<br />\n_-<br />\n<br />\n-<br />\n<br />\nPrtoiueed<br />\n<br />\nFicid<br />\n<br />\nSce-A<br />\n<br />\nI/Erna. 4090<br />\n<br />\nJ.<br />\n<br />\n•<br />\n<br />\nI,<br />\n<br />\ntilfay_flower Cab Co.<br />\n<br />\n2.1<br />\n<br />\n-<br />\n<br />\nled_<br />\n▪<br />\n<br />\nThe, s a-toot-I the<br />\n-721-7;i1:17<br />\n<br />\n7<br />\n<br />\n:77 t71... 7:72\"<br />\n<br />\nF:.•uteeta,<br />\n<br />\nMINI1111.<br />\n<br />\nEDITORIAL COMMENT<br />\n<br />\n.f<br />\n<br />\n- ct<br />\n-.<br />\n<br />\nLOST AND FOUND<br />\nons, one<br />\nAST year, about three weeks nitioare xra roiaminati<br />\n= of<br />\nof the mambas of the sonar class suiced the co:adorn<br />\nof this suluabk<br />\nlosing his thsavk Between the leather owers<br />\ntaken durvolume, were all the m,morarida and class room Timings<br />\nthe finals, it was<br />\ning the second half_ In order to satura.-uonly pass<br />\nrotes_<br />\nabsolutely imperative that he recover this set or lecture<br />\n.set out to ex:<br />\n$0o with troubled mood and wrinkled forehead, he<br />\nthe seats in the lecture<br />\nplOre the impala: He seanched beneath<br />\nd the Yahrooms, probed the dark-corners of the hallways, hitervime<br />\ninquired it the<br />\nous janitors called at the -Y.- office at the. Barn,ied, organizetd<br />\nthese measures<br />\npow °Ike in Gilman Hall and, when<br />\nparty. But even<br />\nhia obliging fraternay brothers into a. 4eardn4<br />\nposse, the little black leather<br />\nvoitinteer<br />\nthis<br />\nwith the asustarae of<br />\nState Roads funds.<br />\nnotebook remained as thieve as jack Hart or the<br />\nprospective<br />\nFinally, during the course of his Wanderings; the manipulates<br />\nthe janitors who<br />\ngraduate happened to interview one of<br />\nthis Uno<br />\nwith<br />\nw<br />\nthe mop and box= in Reinfell Hall. Aftercodes:nofrom the bottom<br />\nminty employee, the notebook was finally salvaged . '<br />\nof a pile of old newspapers and the senior graduated<br />\nthe sane<br />\nThis lengthy ane-ukee—presents an unusual use but<br />\nwho lose articles<br />\ndifficulty is being experienced constantly by those property is reon the campus The rOCESE by which misplaced<br />\n, lizt-C.T.-MISS<br />\nturned to its rightful owners has become a haphazard<br />\nwhich are Lost in the Barn or about<br />\nbusiness_ Personal powiessibl3S,'<br />\noffice. Articles,<br />\nthe University grounds, usually turn up at the \"T. in the -custody<br />\nfound on the ground floor of Gilman -Hall, are placed<br />\nm..._.haniu.1 perunls,<br />\nof Mr. Myers at the putt otha. Fountain pens, tly left in lecture<br />\ncoats, hats, texts and notebooks, Which are inadverten<br />\n*lino<br />\nmoms and halls, usually may be recovered from the<br />\nnd is unable<br />\n, Thus, if a student loses an article on the canapuramake a proto remember exactly where it was mislaid,ohe must<br />\nit their business to<br />\nlonged tour of all these ageno.ies which: colic<br />\nsalvage misplaced property.<br />\na cenent<br />\n• Thu difficulty might be overome by the establishm and student<br />\ntralized lost and found bureau. Universtty eripl,yees<br />\nthis central office.<br />\nvould be instructed to surrender all lost articles to<br />\nfurthering such a<br />\nThe NEWS-LETTER Will be gladto co-operate in cc's:if-kite list of<br />\nscheme by, iliublisiting, each Week, in its columns, a ,<br />\nrecovery<br />\narticles •found on the canipas. By such a procure theof a ..:- -.171:risteal<br />\nof missing property would becr.me a straple matter<br />\nplivuited process.<br />\n<br />\nL<br />\n<br />\nSTOP THIEF! .<br />\nand the open seaITH the approach of the Easter vacation<br />\npapers, the University librarians again find<br />\nW roan for term<br />\nof reserve books.<br />\nthemselves face to face with the perplexing problem<br />\nmasterpieces, many<br />\nIn order to assist in the compilation of literary<br />\nof appropriating<br />\nof the more zealous students have formed tibeitabit<br />\nintellectuah quietly<br />\nvolumes fr,sn the reserve shelves. These budding<br />\nly stroll out of<br />\ntuck the necessary tomes under their arms, nonchalant<br />\nand retain the books<br />\nthe reading room without signing a receipt slip,<br />\nfor an indefinite length of time.<br />\nprecipitated into<br />\nThen, the remaining members of the class are<br />\nat the Peabody or Pratt<br />\na state of panic. They must seek recourse find the required mateinstitutions, where they may, or may not,<br />\nation of one man,<br />\nrial. Thus, because of the selfishness and inconsider<br />\nthe entire class is inconvenienced.<br />\nto discover<br />\nTo date, the library authorities have been unable<br />\npetty thievery. The ofa satisfactory method for combating this<br />\nas to require the profesfense is not sufficiently criminal in nature Philo Vance. Neither<br />\nsional services of a Sherlock Holmes or a<br />\nto assume the roles of superdo the ladies at the loan desk wish<br />\nthe library.<br />\nsleuths and search each patron as he leaves<br />\nsense of sportsmanWe can appeal only to the undergraduates'<br />\nship. Play lair with your clam mates!<br />\n<br />\nThe foot neatness produced<br />\nbyINTrTri-BlIgh Ankle-Fash.<br />\njolting will strike the right<br />\nchord with you. No gapping at the ankle, no slipping at the heel . . . .<br />\nCahn's QUALITY SHOP<br />\n<br />\nwhere it *ix.4 Launched by means of.<br />\na tinge raib!)1er .cable. The machine<br />\nmay itIvi 7 a - - tow of theves...Nwplaite type .with. a<br />\nharharoto<br />\nteitta spread of 34 feet, and is noted<br />\nfact<br />\nris.e<br />\nfor<br />\naccount<br />\nThu may<br />\nfor its ...-.tdttiary is- flight.<br />\n:JILT<br />\nt<br />\n00611;<br />\nthat these Waren;<br />\nThis nue-hiss( is not advised for<br />\nThe<br />\n.<br />\nare SO huge and isetinci&e<br />\nuse on week-end trips and making<br />\nare<br />\naria theory has been thed they<br />\n8 o\".-icoi.• ratres on Mondiy mornfed on grace, and de:eloped by c,v- :K2<br />\n'3714g ice!<br />\n.-<br />\n<br />\n7-1.1\"<br />\n<br />\n7<br />\nthe United Stat.,National Stu-den: caleno - - present engaged in making<br />\nf Si-1th Africa by<br />\na<br />\n..7 • _o ••••a the c-Ar.in.<br />\n---- The group v.-hic.b. 6<br />\n<br />\nI<br />\n<br />\nLiN StS ()<br />\nBaltimore &‘f,.....?<br />\nBALTI. ORE<br />\n<br />\nthe<br />\nstuder,.-:s<br />\nr'.1. are emphat_.--...-headed rah-rah<br />\nbeen -described<br />\n::-.<br />\n<br />\na recent<br />\n<br />\na:<br />\n<br />\ngrarlua:t • _a- •<br />\n<br />\n:ore<br />\nAfrican,:<br />\n7ar<br />\n<br />\nThe French<br />\nSTYLE Na-'. I57R<br />\n<br />\nAs the st.<br />\ntheop-:A'ican ,-._:<br />\n<br />\n.<br />\nspe<br />\nsessi-fn_ Ha: _ tht:ess :rue'<br />\n<br />\ni;;E•<br />\n. Sr's-tient!<br />\nd,,:mortstrat;::,.r.<br />\nMadrid,<br />\nthe dictatorship of Premier<br />\n<br />\n.<br />\nPrim;<br />\n<br />\neditc,:tiona/<br />\n:he<br />\nits rtfrodmilt1 is q,:lite<br />\nde 'Rivera, have ca:hei<br />\nMadrid police frepen:::. saris: !he<br />\n,hie?: keep (nit the inzeee r. On ser.<br />\np<br />\nnpellei competent<br />\n,<br />\nMass Chq,<br />\noscasions the c5cers were cc<br />\nI<br />\n.-ii7Terince<br />\nto draw their r..coriis in crier<br />\n.<br />\n,<br />\ndisperse the<br />\n.<br />\nIn<br />\nno f7.7.514.....\"'t 5<br />\n7/:Fre<br />\n'the s.sit;ti r.<br />\nSt:dCnrS<br />\nThe moan: conic o..7<br />\nC.! a :a:,<br />\nthe re,-,.crt<br />\naydd<br />\nto his political views. The snt-<br />\n<br />\n.,adY resented this expulsion<br />\ndent-;<br />\n:;csi-d to atteni dasses<br />\nre7<br />\nplays and parties but daneing. is<br />\n.-1 cut: Tee the chief<br />\n.5:r.-.91:;htcrt,<br />\nenic,vntent.<br />\n_Miss Chang was si:ccked at<br />\na.te of rliec discipline has also<br />\ncaused s rupttrre ,'etz.veen the uni- erressiz.e toe of<br />\nand<br />\n<br />\nthe<br />\n<br />\nN-a(onder that the<br />\nturn out such wonderful<br />\n<br />\n7.<br />\n)<br />\n0144 \".\"-- „7<br />\n,<br />\nESTAtIWRIED EISIGL1S1kWN4VaiRSITY<br />\n774g-ORtla OVA,..t:35UTHFUL<br />\nSTYLES:<br />\nGUISHED<br />\nCHARTS SC*ELT- FekDIS<br />\nSTATES.<br />\n<br />\nSERVICE IA TH.i.--4\"44.gt<br />\n<br />\nC:CS<br />\n97:0n1CrS are<br />\neach or/or. As far<br />\ne their<br />\n:he;<br />\n<br />\nand<br />\n<br />\nversity oficials<br />\nment.<br />\n<br />\n_<br />\n<br />\n-mad.:Arid<br />\n<br />\nnot<br />\nOnSei<br />\n<br />\nth,-<br />\n<br />\ngovern- •„,-(411.1:ry,<br />\n<br />\nSuits 10<br />\n<br />\nTopcoats<br />\n<br />\naftini<br />\n<br />\ndIMPr—<br />\n<br />\nHere we<br />\n<br />\n.„<br />\n<br />\nSpania: !-<br />\n<br />\ners, and politicians--their<br />\nstarts early in hie.<br />\n<br />\nPROMISING TRACK SQUAD<br />\nROUNDS INTO SHAPE<br />\ncage 1.<br />\n<br />\nAn ambiti.5its freshm.an at the<br />\n:ered from ,I,Friends' School, _are<br />\nUniversity of South Dakota is the<br />\ntraining for these places. as .are<br />\nproud possessor of a three passenBurke, Anderson. and Hershey.<br />\nger biplane in which he is alp to<br />\nHambleton<br />\nAltogether, Coach<br />\nevery<br />\nhome<br />\ndistant<br />\nquite<br />\nhis<br />\nfly to<br />\nfinds a weakness in the hurdle and<br />\ninto<br />\nlate<br />\nquite<br />\nthere<br />\ntarry<br />\nweek-end,<br />\njavelin ranks, and a need for tall,<br />\nMonday morning and get back in<br />\nrangy men for the weight events<br />\ntime for his 8 o'clock class on ifonand the high hurdles. Except foe<br />\nday morning.<br />\nthe middle distances, the flat trac<br />\nThe sophomores will have io do<br />\nevents seem well enough tared for,<br />\nsome tall thinking to beat these modand the team otherwise rather even-iced freshmen!<br />\nes<br />\nStudents who are underweight or<br />\nin other ways not physically perfect<br />\n<br />\nfor the Hopkins pole vault record,<br />\ninexperienced and young, it is promising.\"<br />\n<br />\n— 1<br />\nBY SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br />\n<br />\n\"<br />\n:<br />\nse<br />\nIf)<br />\nott<br />\nler<br />\nhai<br />\nCIF EAtt_11/411CUIL<br />\nThe character of the suits and<br />\ntailored by Charter House<br />\nwill earn your most sincere liking.<br />\n<br />\ntopcoats<br />\n<br />\nlile liet Hub<br />\nBaltimore. Cheri.. owl iamb.<br />\n<br />\nmo▪ ro<br />\n41•I•▪ 1<br />\n41M<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER,<br />\nMARCH 26, 1929<br />\n<br />\nDR. McCOMAS TALKS<br />\nON SPIRITUALISM<br />\n<br />\nMANY HOME GAMES<br />\nSTUDENT COUNCIL WILL<br />\nON LACROSSE SCHEDULE<br />\nWATCH RESERVESHELVES<br />\nContinued frtnn Page 1. Col. 1<br />\nDonald Hiss, President of<br />\nOur only gime outside of the<br />\nthe:' Student Council, warns<br />\nPsychology Professor Tells<br />\ncity is the one 'with Army at West<br />\nof<br />\nstudents that books on the reInteresting Seances<br />\nPoint.<br />\nOA ANNIE (BERG<br />\nserve Therv,es are, not to be<br />\nAnother pleasing characteristic of<br />\nLAUGHTER AROUSED<br />\n\"The Old Boy Himself\"<br />\ntaken from the library without<br />\nthis<br />\nyear's schedule is the number<br />\nleavin<br />\ng<br />\nthe<br />\ncard<br />\nwith<br />\nthe liTeacher's Interest Due to<br />\nNORTH Es? MARYLAND Ayes.<br />\nViews<br />\nof games that will be played either<br />\nbrarian. Although the reserve<br />\ni on Immortality<br />\nshelves do not come under the<br />\nat Home4od or at the Baltimore<br />\nDoctor Henry McComas,<br />\nHonor System, violations of<br />\nStadiutirtside of the Army<br />\nof the<br />\nPsychological Department<br />\nthis<br />\nrule are subject to student<br />\nof the<br />\ngame all 'Will be \"home games.\"<br />\nNotable for the excellence of their tailoring, faithfu<br />\nJohns Hopkins University,<br />\naction because its observance<br />\nlly<br />\ngave a<br />\nto La Bitt:41T-BI Dto<br />\nreflect the latest decrees of fashion.<br />\nFor the first time in atnumber of<br />\nvery interesting talk on<br />\nis dependent on the honor of<br />\n\"SpIritualJe<br />\nA<br />\ndiversif<br />\nism\" at the assembly last<br />\nin\"54'...o lt<br />\nied assortment of pleasing patterns permits<br />\nyears, Mt. Washington and Hopthe individual.<br />\nThUrsday.<br />\nan almost unlimited indulgence of your personal<br />\nEstablished 1832<br />\nThe doctor stated that he<br />\nIf the breaking of the rule<br />\nkins have decided- to play a posttaste.<br />\nwas<br />\nPHILADELPHIA<br />\nasked to'report on the mysteri<br />\ndoes not stop drastic action<br />\nes of<br />\nseason game. These post-season<br />\nREADY,TO-WEAR<br />\nwill be taken. Any one disOfficial Makers of the Standard . seances- a0d \"spiritualism, in general.<br />\ngames were played annually until a<br />\nThe institution interested in<br />\ncovered'gtility of such an act<br />\nspiritbreak Came a few years ago. The<br />\nualism wanted him to either<br />\nwill be brought before the Sturefute<br />\nexact.date for this game will be anor acknowledge the truths<br />\ndent Council. As a matter of<br />\nof the<br />\ncommon courtesy to the lispirit -world.<br />\nnounced later.<br />\nOr more<br />\nbraryctaff this rule. should be<br />\nIn his talk, Dr. McComas<br />\nstated<br />\nobserv<br />\ned, for its violation<br />\nthat he had investigated the<br />\nseances<br />\ncauses them a great deal of<br />\nof a young female medium,<br />\nof<br />\nJohns Hopkins ling<br />\ntrouble.<br />\nFive East Lexington Street<br />\nwhom he had had a favorable<br />\natilt FPLAvi4ous,<br />\nletter<br />\nPrices Upon Request<br />\nJust Around Corner from Charles<br />\nendorsed by A. Conan •Doyle.<br />\nILVIT<br />\nILE<br />\nTINI<br />\nENTR<br />\nAt<br />\nIE<br />\nOrders accepted at the<br />\n•KKITH HOWARD AT filwriKlibi<br />\nthe conclusion of his investigation<br />\nUNUSUAL AND ARTISTI<br />\nPost Office in the College<br />\nC I'11..1,S.<br />\nhe found that the seances were<br />\nLETTERS TO THE<br />\nonly<br />\nContinuous Daily Mat 35c, Eve.<br />\ntricks. He stated to the student<br />\n50c<br />\nFrom 1.30 to 11<br />\ns<br />\nPhone, Vcr. 7042<br />\n— EDITOR<br />\nthat A. Conan Doyle had been<br />\na<br />\n\"dumb sucker.\"<br />\nONE WEEK ONLY<br />\nA PLEA FOR BEN<br />\n\"Elsie\"<br />\nTo<br />\nthe Editor of the NEws-LETTER:<br />\nDr. McComas then went on to<br />\nFIRST TIME AT POPULAR<br />\ntell of his other experiences. Many Dear Sir:<br />\nPRICES<br />\nNo Deposit Required<br />\nnotable spirits were discussed,<br />\nIt was with a distinct sense of<br />\namong' whom were mentioned<br />\nof<br />\nJohn<br />\ns<br />\nHopkins University Students<br />\nMARTI<br />\nN<br />\nJOHNS<br />\nON'S AFRICAN<br />\npleasure that I completed reading<br />\n\"Elsie\" and \"Black Bear\", who had M.<br />\nEXPEDITION<br />\nJ, Schmulovitz's article, \"The<br />\nLight and<br />\n\"passed out\" sometime ago. The Commu<br />\nnion of Great Minds,\" which<br />\nLombard Sts.<br />\nBuicks<br />\ndoctor stated that \"Elsie\" was a appear<br />\nPLaza 6000<br />\ned in a recent issue of the<br />\nChevrolets<br />\nvery good spiritl There seemed to Nnws-Ltrrrit<br />\n1723-25 N.<br />\nWith MR. 6? MRS.<br />\n.<br />\nCharles St.<br />\nbe nothing that she didn't know,<br />\nChryslers<br />\nMARTIN JOHNSON<br />\nVErnon 4049<br />\nThis article very cleverly, and at<br />\nand he stated- that the people present<br />\n2402<br />\nPennsyl,<br />\nHupmobiles<br />\ntimes<br />\nmockin<br />\ngly<br />\nand<br />\nironica<br />\nlly,<br />\nat the seances, including himself,<br />\nvania Ave.<br />\nThis Picture Represents Four Tears<br />\nWillys-Knights<br />\nLAfayette 2000<br />\nof Travel and Study of the<br />\nwere very much enchanted by the points out the indisputable plagiarThis little girl shakes<br />\nDarkest Africa<br />\nism<br />\ncommit<br />\nted<br />\nby<br />\none<br />\n\"Ben\"<br />\nin his<br />\nspirit's ,remarkable high` voice. Dr.<br />\nBaltimo<br />\nre<br />\nConced<br />\nes<br />\nMilesto<br />\nne Supremacy<br />\na mean ear-ring.<br />\nMcComas said that he had been article Dreiser. The author of \"The<br />\nThere's really nothing<br />\nvery .much interested in the voice Communion\" leaves no doubt about<br />\nshe doesn't know •<br />\nand was determined to Solve the the faux pas that was made. He<br />\ndisplays a spirit of inquiry and a<br />\neven been to Niagara<br />\nmystery. He related to the student<br />\nwillingness to show the truth that<br />\naudience how he had persuaded the<br />\nFalls which sort of<br />\nshould' be complimented.<br />\nmediu<br />\nm of this particular spirit to<br />\nmakes her education<br />\nI congratulate you, but don't you<br />\nallow him to place a medical instrueven more complete.<br />\nment on the medium's neck. ' This think yOu have been,just a little too<br />\nWouldn't you know<br />\ninstrument was for the purpose of harsh toward \"Ben\"? I admit the<br />\nshe'd be the one to<br />\nhearing every little noise that would plagiarism; but Dreiser, plagiarized<br />\nask \"how handsome<br />\nbetray itself in the medium's vocal though it was, nevertheless was<br />\ndoes a young man<br />\nchords, But the \"little rascal,\" as stimulating. If nothing else, it gave<br />\nthe doctor called him, had practiced us your 'article, which I cosider a<br />\nhave to be before he<br />\nthe art of squeezing the wire of the distinct relief from the trite articles<br />\nwears Braeburn Uniinstrument so that the contact of the on Campus Activities and .Value of<br />\nversity Clothes.\"<br />\nfingers on the wire produced no a College Education. And again it<br />\n835<br />\nsound. Therefore, Dr. McComas gave us Mencken's opinion of Drei$40<br />\ncontinued, all sounds in the ser, which is much preferable to the<br />\n$45<br />\nmedium's throat were cut off as half-formed opinion of the undersoon<br />\nas \"Elsie's.' voice was heard. graduates.<br />\nClothiers and Haberdashers<br />\nAt last, after more investigations, And, then again, remember that<br />\nthe speaker told the audience, how far greater writers than \"Ben\" have<br />\nhe had, by means of his scientific committed the literary sin of plagi17 E. Baltirruire St.<br />\ninstrument discovered that the voice arism. This is no absolute defense<br />\nof \"Elsie\" issued tion, the, of \"Ben's\" misdemeanor, but a plea<br />\nfor some amelioration in condemnamedium's in,mth.<br />\ntion and a suggestion that you conInjects Humor<br />\nDr. NIcC.,In.ls told of other ex- tinue, if possible, your clever attacks<br />\nperiences in the realms of the spirit upon any further literary sins.<br />\nSidney Wolk.<br />\nworld. I lowever,- due to the<br />\nspeaker's somewhat bantering attitude, the audience was not held in, MUSICAL CLUB GIVES<br />\nHAGERSTOWN CONCERT<br />\na state of 's:xpectancy .as might have<br />\nContinued from page 4, col. 3<br />\nbeen expected from the nature of<br />\nthe speaker's topic. Instead the BAR rroNE SoLo—Mr. hlewelyn<br />\n-.<br />\nlisteners were made to feel at ease, Invictus<br />\nHuhn<br />\nSan Francisco, California, and laughter rocked the assembly BANjo CLUB<br />\nAugust 8, 1928<br />\nBelle Nuit<br />\nropm many times before the doctor<br />\nOffenbaCh<br />\nLarus & Bro. Co.,<br />\nPopular Selections<br />\nhad concludeod his • humorous<br />\nRichmond, Va.<br />\nDear Friends:<br />\nBust.: JAY ORCHESTRA<br />\nepisodes.<br />\n'<br />\nI have been a very heavy pipe<br />\nsmoker for the last thirty years, and - At the conclusion of the talk, the GLEE CLua<br />\nhave always used Edgeworth ToRecessional<br />\nDe Koven<br />\nbacco (Plug Slice) and find there is no sReaker said that though his exAutumn Sea<br />\nDericke<br />\nother tobacco like it for a cool and periences in spiritualism seemed<br />\nwell flavored taste.<br />\nHopkin<br />\ns<br />\nMedley<br />\n,<br />\nI E Panama Canal diggers had<br />\nI am in the vaudeville business, and funny to the attilience, on the conarranged by Steinwald<br />\nEffective service to the public is possibl<br />\nhave traveled all over the world with trary they were not. He stated that<br />\ne<br />\nengineering brains and money<br />\nmy brother,and always have had very<br />\nonly when every step from purcha<br />\ninteres<br />\nspiritu<br />\nted<br />\nin<br />\nhe,<br />\nalism<br />\nwas<br />\nfor<br />\n'aplenty. But they were blocked<br />\nse of<br />\ngreat pleasure in recommending your<br />\nby<br />\nthe<br />\nraw material to the operator's\"Numb<br />\ntobacco; and many a time I havetad the sake of the mystery of im- J. H. U. WOMAN'S CLUB<br />\nmalaria and yellow-fever bearing mosqui<br />\ner,<br />\nto pay double the price in different<br />\nplease\" has been cared for.<br />\nGIVES BRIDGE PARTY<br />\nmortality. He also stated that he<br />\ntoes, which killed men by thousa<br />\ncountries for it, but! would sooner<br />\nnds.<br />\nThis<br />\nContinu<br />\nis<br />\nwork<br />\ned<br />\nthat than smoke anything else, asdo<br />\nfrom<br />\nfor<br />\nPage<br />\nmen<br />\n4,<br />\nCol.<br />\n4<br />\nwho<br />\ncan sense<br />\ninterrupt the \"voicer) of the<br />\nI<br />\nThen Gorgas stamped out the<br />\nhave 'tried all different brands. I can<br />\nmosthe relations between seemingly unrequito. The fever was conquered.<br />\ngenerally buy a one-pound tin and spirits and the spirits themselves, and Mrs.\"Dempster, Mr. and Mrs.<br />\nThe<br />\nlated<br />\nfactors<br />\n,<br />\nmen<br />\nFoil it up; and believe me, gentlemen, but that as yet he is somewhat John D. Clark, Dr. and Mrs. Janeet,<br />\nwith<br />\nthe<br />\nvision to see<br />\nCanal was completed.<br />\nit is real tobacco.<br />\na possible mountain-barrier in a<br />\nmoleThe importance of little things is recpuzzled by the directness of their Mt. and Mrs. Broadus Mitchel,<br />\nWilth best wishes from<br />\nhill<br />\n—<br />\nand<br />\nwith<br />\nMiss<br />\nthe<br />\nJacobs<br />\n, Mrs. Miles, Dr. Barresourcefulness<br />\n'<br />\nognized in the telephone industry<br />\n\"messages.\"<br />\nYours sincerely,<br />\ntoo.<br />\nto<br />\nsurmo<br />\nunt<br />\nit.<br />\nrett<br />\nand Dr. and Mrs. Van Holland.<br />\nSam La Mert<br />\n\"I'm one of the people who believe<br />\nof the<br />\nLa hfert Brothers'Piano Novelty Act.<br />\nAs an incentive towards skillful<br />\nthat a man's life is finer for a belief<br />\nand consistent playing and to add<br />\nin immortality, and it is for the sake<br />\nA nation,wide system of inter-connecting telepho<br />\nof any light that spiritualism might zest to the evening's entertainment,<br />\nnes<br />\nthrow on the subject that I'm inter- a prize was awarded to the winner<br />\nExtra High Grade<br />\nat each table, making some twentyWhere<br />\nmuch<br />\nthere<br />\nis so<br />\nested in it.<br />\nfive prizes which were distributed.<br />\nsmoke there must be some fire, but Many of our<br />\nrevered professors are<br />\ngotten<br />\nsmoke<br />\nthe<br />\nonly<br />\nI've<br />\nfar<br />\nso<br />\nnow, no doubt, proudly displaying<br />\ntheir spoils.<br />\nin my eyes.\"<br />\nt,<br />\n\"OUR PIONEERING<br />\nWORK HAS JUS<br />\nT BEGU:<br />\nTHE NEW<br />\n<br />\nHOLLYWOOD SHIRT<br />\nHollywood's latest creation! Black,<br />\nOrange and Blue are the colors.<br />\n<br />\neaster Suits<br />\n<br />\n'45<br />\n<br />\n105. *0E05 8c *on<br />\n<br />\nSIMBA<br />\n<br />\nT..11-111EUI3EUllic.<br />\n<br />\n1<br />\nF<br />\n<br />\nPianist All<br />\n\"Encore\" for<br />\nThis Smoke<br />\n<br />\nbut a mosquito,blocked the way<br />\n<br />\nT<br />\n<br />\nEdgeworth<br />\nSmoking Tobacco<br />\n<br />\nBELL SYSTEM<br />\n<br />\n\f1929<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 26,<br />\nU. Woman's<br />\nMUSICAL CLUB GIVES ,f. H. Gires Bridge Party ,<br />\nJams Hopkins Women's<br />\nHAGERSTOWN CONCERT ClubThepresented<br />\nits first real function<br />\nClub<br />\n<br />\nTEACHERS WANTED<br />\n<br />\nYELLOW CAB STANDS<br />\n<br />\nWes awe Imam srao are planalste<br />\nor<br />\nto toatelt la areaselary ecibgeas W.<br />\nor car,<br />\nceAleges shastate lira*<br />\nkelt gawped away Maims Md.SS.<br />\nTIRE SALTDIOIRIE TICAKWZ/LIF<br />\nAGE.NeT<br />\nMe-3 Title Assaez Mag.<br />\n<br />\nAT<br />\n<br />\nHomewood Fidd<br />\n39th and St. Pad &mew<br />\n31st and a. Pad Streets<br />\nSafe and Eifiarat Service<br />\nNo Charge for Extra Painengers<br />\n<br />\nRENT<br />\n<br />\nSNAPPY<br />\nTUXEDOS<br />\n<br />\nCr.<br />\n<br />\n?RIM<br />\nIn<br />\n<br />\n11.-<br />\n<br />\n•Ifirrjughness<br />\nFta. tezr the CC<br />\n,arrangerner.-.- The public<br />\nh-thed NitL.400 clubs pee:„.....te,i their of their<br />\napparently<br />\nL the efforts of<br />\n'<br />\nVreeiate<br />\n'<br />\nar<br />\nthe Masecond annual cower.<br />\nthe capable committee for the -party<br />\nscent Tent:It 77-. l-lage - --. wn.<br />\nwas marked by a considerable de- -and. above<br />\nYo-u-nzer Set Acts As Spinner<br />\nof •<br />\n.financialll741<br />\n'<br />\nk.C126C<br />\n-i<br />\nt<br />\n'<br />\nGhert,a HOpk'I7,7, 11:1)=1.1.S..,apçsrcx7,-wa.5 regarded by<br />\nmatey twenty girls acted as sp,-..,-. The committee a hundred riff,- ,<br />\nv,: :he presence of over<br />\nsore for the concert, The pi.,<br />\n-.le aznong._-,whom were many promi- 4 i<br />\nt have the girls (fit:entitle tickets:<br />\nfaculty. How'<br />\n77,k H2fv-5-tcmii. ,7,-..._ \"1..t.t menabers of the<br />\n'atzi•.-e the y.. ever. in spite. of the splendid<br />\n. a- -r -E. ,---_ 1,-,, f,eci<br />\n:7<br />\nwas not sup--; ,<br />\nthat body., Jude:-.. ,endarice 7.77..e ilIntili013<br />\n<br />\nA<br />\n<br />\nSULSKY<br />\nFRANKLIN STREET<br />\n<br />\nBOOKS<br />\nBought—Sold—Exchanged<br />\nPIPPEN'S BOOK STORE<br />\n605 N. EUTAW STREET<br />\n<br />\nTwesty Debutantes Simper of the season kiss Friday night at<br />\n• ` the Lord Baltimore Hotel in the<br />\nthe Afair /<br />\n=of a curd parry. This was The<br />\nBANJO CLUB POPULAR<br />\nattempted<br />\naffair cf its kind o'er<br />\nHopkins Abanni and Friends by the<br />\ndeserve to be<br />\n,<br />\ntlte<br />\nand<br />\nclub<br />\nn<br />\nNninbe<br />\nAttend in Large<br />\n<br />\n1<br />\n<br />\n'<br />\nCOMPLETE<br />\n<br />\n-PHOIZ<br />\n<br />\n'VERNON 1212<br />\nPOR A<br />\nYELLOW CAB<br />\n<br />\nCon<br />\nYoe<br />\ntaloa<br />\n'<br />\nT• eenwasat<br />\nreoa.nst<br />\natubaot,<br />\n• earka;<br />\narias<br />\n•DC<br />\n<br />\nV<br />\nE<br />\nR FADTATIAHL<br />\nCo-<br />\n<br />\nI<br />\n<br />\n. ±<br />\n<br />\n6t.<br />\n<br />\natten44-ancr and er4.171:‘ 1-77 :'<br />\nworked perle--...\":<br />\nmclunem wra.she- rehire '=<br />\n1<br />\n•SERVICE• ,0<br />\na: the concer1<br />\n,<br />\n71<br />\nr 6.•<br />\n67number greatly increased duirir.::<br />\nce<br />\n\"<br />\nr<br />\nthe progress of the dance_<br />\nProeineers of \"The Nents-Lettri''<br />\nFrom the club ...,..tiber-ship Ce7tain indiriduals were selected : a:L G 13.AILFOUR CO<br />\nas escc • - :hese girls. tio4h a: flarcrcz, Prna<br />\ntran,-..-.:e• a- I a: the dance.<br />\n; 7.<br />\n<br />\nSIALktf,<br />\n<br />\n,X1<br />\n<br />\nas-N,<br />\n<br />\nEST. 1900<br />\n3044<br />\n<br />\nGREENMOUNT AVENUE<br />\nUniversity 3829<br />\n<br />\nPhotographic Supplies<br />\n<br />\nPiceure Framing<br />\n<br />\n:lergrad-<br />\n<br />\nIre<br />\nthe<br />\n<br />\nJetrelt\", Feron,<br />\n<br />\nhEpp:PHOTO SERVICV-3<br />\n<br />\nl:t<br />\n<br />\ni<br />\n<br />\nAnr7<br />\n<br />\nvas lace<br />\n<br />\nYou do $et Better Kodak Pictures<br />\nfrom<br />\n<br />\n•: 7<br />\n<br />\n.; 7.<br />\n<br />\n--<br />\n<br />\n-:.,:cqous by<br />\n:act is tie be<br />\n. ',vs a regrettable ,<br />\npoliteness i v the<br />\n::7<br />\n.'the intert•:at. Howere7<br />\n<br />\nHENNEGAN-BATES COMPANY<br />\nJewelers and &Item-maks Since 181-7,<br />\n. DRESS'SETS<br />\nfor dinner and evening wear<br />\n<br />\n;- ±,e. faculty sufficientlyand broughti<br />\n'honor for this.1, I<br />\n:'a';'<br />\nsocial affair<br />\ntne<br />\n<br />\nBALTIMORE AT CHARLES STREET<br />\n<br />\nHOPKINS RINGS<br />\n<br />\nBanquet Opens Festivities<br />\nof :he organiza\"-esented<br />\nSoon after th6r arrival in Hathe school<br />\nwith<br />\nconnec:ed<br />\n::<br />\nevethe<br />\ngerstown ithe firs item of<br />\n;4-i well reprewas<br />\nfaculty.<br />\nthe<br />\nwhich<br />\nning's fest.ivitieS' was begun.<br />\nsented. Among the celebrities preswhich the members<br />\nTHE CHARLES E. MYERS CO. banquet. at<br />\nent were: Dr. arid Mrs. Latane. Mr.<br />\nthe club, the spousors and thar.,erIncorporated<br />\nCal<br />\nMansfamarer of<br />\n-one attended. prored a very nOve\"<br />\n'RUBBER STAMPS and colorful affair.<br />\nThe Sennce Shop<br />\nAfter this the busse_s4eft for :hIn sqie anis cpeci) \"Bostonainur<br />\n319 W. Redwood St<br />\ner:sneer', hall where, in a short -a,<br />\nequal the most expensive footwear<br />\nthe natives of Hagerstown<br />\n' produced today.<br />\nPhone 110---etecoall 790$<br />\ning intrpcluced to the abilities<br />\nAnd the awing is a big item.<br />\nANIS<br />\nE. E.<br />\nHopkins Glee Club which apBirely's (PharinacY3 Johns<br />\npeared fIrst on the<br />\nE.'-.RN CAFETERIA<br />\nST PAUL at 33rd STREET<br />\n'Mostly $7 to $10<br />\nConcert Gets Under Way<br />\nL--771.<br />\n•<br />\n7<br />\n7.<br />\n7<br />\nRer.:\".,-:<br />\nYour :';e:ghboritood Drag Store<br />\nE.t.clisatt;)<br />\nthe Glee Club was a- \"Old Man Noah.\" Kpr<br />\nPRESCRIPTIONS<br />\n<br />\nfl t9 Fuld:sty Bldg<br />\nCA- - -.. rf.<br />\n<br />\nFIDELITY AND DEPOSIT CO.1—<br />\nof<br />\n<br />\neJNien!<br />\n<br />\nBOSTONIAN<br />\nSHOE STORE<br />\n112 E. Baltimore Street<br />\n4.<br />\n<br />\nSdacol Supplies, Candy, Cigars<br />\nUnexcenect Fountain Service<br />\nMake Our Score Tour Store<br />\n<br />\nMaryland<br />\n<br />\nFidelity and Surety Bonds<br />\nBurglary and Plate Glass Insurance<br />\nBALTIMORE BRANCH OFFICE<br />\nGROUND FLOOR, FIDELITY BLDG.<br />\n<br />\nPhone Plaza 0800<br />\n<br />\nD. C. HANDY, Manager<br />\n<br />\n(7)4-fr. From<br />\n1.1,<br />\nA. M<br />\n<br />\nCollege Men's<br />\nLuncheon SO cents<br />\n<br />\nsional\" 'nn‘f\"Drak Drurr. 717-1<br />\n<br />\n:he<br />\nlady - received the plaa:<br />\ncrowd.<br />\nHone—HO. 20991.!<br />\nPhone, CAI t357<br />\nConrad Gebelein and his Batici - FRANCES T. BRANNON<br />\nClub came within the range of the Statcuaorto HARBAUGH fi BANNON<br />\n2 E LEXINGTON ST. Cot. Charles<br />\nASSOCIATION<br />\nspotlight and proceeded to thrill the<br />\nilk.c.on 26)<br />\n11211LBER$ FLORISTS TELBGRAPH,DELIVEP.T<br />\nselecpopular<br />\nvery<br />\ntheir<br />\nwith<br />\ncrowd<br />\n'Stenographic DI:tat:on, C..pying,<br />\ng, Mineographing<br />\nPOFt.<br />\non<br />\nMulgrahin<br />\nJ. A. RI 1-11,R & SON<br />\n\"Washingt<br />\nThe<br />\ntions.<br />\nMaryland<br />\nFkrrists and Decorators<br />\nNui:\" bronchi. Ba:tamore<br />\nMare:MD.<br />\nE,<br />\nBALTIMOR<br />\n2PTH<br />\nNear<br />\n,<br />\nST<br />\n\".\"<br />\nCHARLES<br />\nISLIS N.<br />\ndown a -:<br />\nPhut, VErnon can<br />\nnuar 'bariLou:' i,lee.n.<br />\nusual exceltone, performe _<br />\nlent manner. ' S.unrise .and You.'<br />\nINTERIOR WOOD WORK * 4j. his encore nurriVer. -r L-\"ucec!..,,,,-,, ,.4„•<br />\nDECORATIONS<br />\nof approval from<br />\nthe crp-cisite sex.<br />\nSONS<br />\n&<br />\nKNIPP<br />\nJOHN C.<br />\ndid some<br />\nOnce again the<br />\ngood work.. A group- of amusing.<br />\nFURNITURE<br />\n, pleasant numbers contributed great- ti<br />\nBALTIMORE, MD<br />\nly to the success of the program.<br />\nri •<br />\n..f.d<br />\nAn account of the concert wc,<br />\nShow Rooms<br />\n,<br />\n6:i,<br />\n343 N. Charlet Strut<br />\nnot be complete without mention c'<br />\nthe piano solo by Mr, John K.<br />\nMount, Jr., the speditable performance of the Hawaiian Troupe, and I<br />\n\" the popular selections, rendered by<br />\nMartin Elliott and his Blue Ja-.. r<br />\nchestra. They all played a<br />\nluecess of the concert.<br />\n,--are the , New, Spring Books!<br />\nDancing followed the concert and<br />\nbnght<br />\nin<br />\nbooks<br />\nd-new<br />\nthem—bran<br />\nof<br />\nYou'll find rows and rows<br />\non,<br />\nat one o'cisslir-A, M. the club memcovers—sinelling pungently of,printer's ink and crisp paper—ficu<br />\nstores<br />\nbers eithei- went back to their head;smug, biography, science—awaiting your choice at our two<br />\nwhich was the Hotel Hamquarters<br />\nCO.<br />\nGTON<br />\nTHE NORMAN,REMIN<br />\nindul#ted in various parties<br />\nor<br />\nilton,<br />\nn:<br />\nUp-Tow<br />\nDown-Town<br />\n1118 North Charles St.<br />\n‘.! held in their honor. Saturday<br />\nCharles St. at Mulberry<br />\nmorning the return trip to Baltimore<br />\nwas made—the club arriving shortly<br />\nAT<br />\nFRIENDS<br />\nYOUR<br />\nMEET<br />\nafter noon.'<br />\nThe program, in its,entirety, is<br />\n<br />\nA hi<br />\n<br />\nNEW CELESTIAL RESTAURANT<br />\nAmerican • Chinese<br />\n117-1l9-121 N. He-ward Street<br />\nPhone C,..h.fr: 6433<br />\nTheatre<br />\nParties<br />\n<br />\nMusic<br />\n<br />\n:•••<br />\n<br />\nstimulating-<br />\n<br />\ndelightful-<br />\n<br />\nROBIN\"<br />\n\"The(<br />\n<br />\nTht-HOTSY TOTSIE- NIGHT CLUB<br />\nDANCns1G — DINING — ENTERTAINMENT<br />\nChange of<br />\nProgram<br />\nWeekly<br />\n<br />\nVINCENT CARA<br />\nand<br />\n<br />\nHis RBCORD<br />\nVErnon<br />\n<br />\nBOYS<br />\n<br />\nFLOSSY MILLER<br />\n<br />\nMagsr<br />\n<br />\n844 N.Howard St.<br />\n<br />\nESSO<br />\n<br />\nTHE GIANT<br />\nPOWER FUEL<br />\n<br />\nNEW LIFE<br />\nFOR MOTOR<br />\n<br />\n-STANDAR D\" MOTOR OIL<br />\nThe Measure of Oil Value<br />\nSTANDARD<br />\n<br />\nOIL<br />\n<br />\nCOMPANY OF N.<br />\n<br />\nJ<br />\n<br />\ngiven below.<br />\nGLEE CLUB<br />\nDtVries<br />\n'University Ode<br />\nLuders<br />\nHeidelberg<br />\nDrakes Drum Coleridge-Taylor<br />\nBANJO CLUB<br />\ncous.sa<br />\nWashington Post March<br />\nPopular Selections<br />\nQUARTETTE<br />\nSelections arranged by Fishburn<br />\nDear Old Johnny Hopkins.<br />\narranged by Steinwald<br />\nHAWAIIAN TROUPE<br />\n. Herbert<br />\nj<br />\n'Gypsy Love Song<br />\n„ kohola March,<br />\narranged by C. Gebelein<br />\nGLEE CLUB ,<br />\nDeep River......Old Negro Melody<br />\nOld Man Noah—....Bartholomew<br />\nContinued on Page 3, Col 3<br />\n<br />\nRIT1RiNti<br />\nYID11 IILIF<br />\nWHOA •/<br />\nHOLD EVERYTHING.<br />\nHERE'S A LITTLE<br />\nEXTRA - CURRICULAR<br />\nDEMONSTRATION OF<br />\nA PAUSE THAT'S GOING TO NEED PLENTY<br />\nREFRESHMENT.<br />\nBut you don't have to<br />\nfall off a polo pony to demonstrate the pause that refreshes. Every day in the<br />\nyear 8 million people, at<br />\nwork and at play,find it<br />\nin an ice-cold Coca-Cola —<br />\nthe best served drink in<br />\nthe world—the pure drink<br />\nof natural flavors that<br />\nmakes a little minute long<br />\nenough for a big rest.<br />\nThe Coca-Cola Ca, Atlanta, Ca<br />\n<br />\nMIL▪ LION<br />\nA DAY<br />\n<br />\nYOU CAN'T BEAT THE<br />\nPAUSE THAT REFRESHES<br />\nIT<br />\n<br />\nH<br />\n<br />\nAD<br />\n<br />\nT<br />\n<br />\nBE<br />\n<br />\nGOOD<br />\n<br />\nTO<br />\n<br />\nGET<br />\n<br />\nWHERE<br />\n<br />\nIT<br />\n<br />\n13<br />\n<br />\n\f", "format": "basic_html", "processed": "SEITSSITT<br />\nSPRING TICKET DRIVE<br />\nGETS UNDERWAY TODAY<br /><br />\nPrice 5 Cants<br /><br />\nHOMEWOOD, BALTIMORE, MD., MARCH 26, 1929<br /><br />\nVol. XXXIII, No. 41<br /><br />\nTRYOUTS CALLED FOR<br />\nADAMS DEBATE<br />\ngarland Hershey, president<br />\nof the Debating Council, has<br />\nannounced that tryouts for the<br />\nJunior-Senior debate Will be<br />\nheld todily and tomorrow at<br />\n12.20 in G. 112.<br />\nThe Juniors will try out today, while the Seniors will<br />\nmake their appearance tomorrow.<br />\nEach member of the winning team will be awarded fifteen dollars worth of books.<br />\nThis prize is known as the<br />\nAdams award and should<br />\nbring many men, interested in<br />\ndebating, out to show their<br />\nability, in this line.<br /><br />\nCOLLEGIATE SERENITY UPSET<br />\nBY VISIT OF FIRE ENGINES<br /><br />\nPLUM NAMED EDITOR<br />\nOF 1929 HANDBOOK<br />\nAt the last meeting of the<br />\nY. M. C.'A. Cabinet the staff<br />\nof the 1929-30 ilandbook was<br />\nchosen. This is published by<br />\nthe \"Y\" each year. It is more<br />\ngenerally known to the Campus as the \"Freshman Bible.\"<br />\nThe new staff consists of<br />\nHarold J. 13loom, Editor;<br />\nGeorge H. Dowell, Business<br />\nManager, and A. Pemberton<br />\nJohnson, Associate Editor.<br />\n_<br /><br />\nPASAREW IS ELECTED<br />\nPTAIN OF QUINT<br /><br />\nSirens piercing the air. . . . The hoses. . • . Fire engines soon reach<br />\nrumble of heavy, fast-rolling truck the spot. ... No less than five vehiForward Chosen to Lead Jay Five<br />\nPrizes to Be Awarded Winning<br />\nwheels through the tunnel of Gil- cles already have come up.<br />\nDuring 1929-30 Season<br />\nTeams and Individual<br />\nman Hall. . The brazen clang of Town-ward bound motorists with<br />\nOF TWO YEARS<br />\nVETERAN<br />\na resounding fire truck gong. . . . screaming brakes bring their cars to<br />\nCOOPERATION IS URGED<br />\nstick<br />\nand<br />\nStreet<br />\nIs Expected to<br />\nCharles<br />\nTeam<br />\nEntire<br />\non<br />\nstop<br />\na<br />\nout<br />\nleading<br />\ndoor<br />\nthe<br />\nSlamming of<br />\nReturn Next Year<br />\nCommission to Be Paid on All<br />\nto the tunnel. The uneven beat of curious heads through windows to<br />\nTickets Sold<br />\nlsador A. Pasarew was elected<br />\nmany hurrying feet. . . . Students view the scene. ... A patrol-wagon<br />\nmoving with unusual speed.... The makes its appearance. . . . Gamy<br />\ncaptain of the 1929-30 varsity basThis week marks the beginning<br />\nseabanquet<br />\nformer<br />\nof<br />\nreminder<br />\nketball team at a banquet held at the<br />\nlethargy and calmness of a spring<br />\nof an intensive spring season ticket<br />\nmorning broken. . . Shouts of sons. ..<br />\nHotel Emersoh on last Friday<br />\ncampaign, conducted by the Athletic<br />\nFire!, where is it? and scoops for<br />\nnight. Pasarew succeeds John Lang,<br />\nAssociation. As in the past, chief<br />\nFire hoses are dragged out. . . .<br />\nthe NEWS-LETTER! all echoing A blue-coated figure plays a steady<br />\nwho has captained the quint during<br />\nreliance is fleing placed on. the<br />\n•<br />\nthrough the tunnel.<br />\nthis, its first major season in many<br />\nternities in spreading these ickets<br />\nstream of water on the burning logs<br />\nStudents rushing through the tun- and underbrush. . . . The chemical<br />\nyears. The captain-elect is a memthroughout Baltimore.<br />\nnel barely missing a long, canvas- hose is pulled out and turned on.<br />\nber of the Class pf '31, while Lang<br />\nTerms of Awards<br />\ncovered fire hose. . . . The red fire- . . . A stream, of chemical rushes<br />\nis a member of tO.,<br />\nIn a letter to the presidents of the<br />\nchief's car I bursting through the skyward from a break in the hose. Team Has Best Group of High<br />\nPaul Menton in his column<br />\nvarious chapters on the campus,<br />\nJumpers at Hopkins in Years<br />\ndampness and dim light of the tun- . . . . This fact is greeted by \"The<br />\n\"Shootin\"Em\" in the Evening Sun,<br />\nHenry Iddins, Business Manager of<br />\nnel. ... Students eagerly following. chemical is busted, chief! . . . The After over two weeks of hard made the comment &amp;ring the seaAthletics, has made known the terms<br />\n. .. The chief's car halts at the ten- streams of water keep playing on preliminary training the track and son that Pasarew was the most imof sale and the awards to be given.<br />\nnis courts near Remsen. . . . The the slow, smoky fire for five min- field squad of some forty candidates proved man playing college basketDuring the past two years there has<br />\nchief goes ahead to reconnoiter. ... utes. . . . Students, panting and is being rounded into shape.. Few ball in this section, when compared<br />\nbeen paid a 5 per cent commission<br />\non all tickets sold. This has spurred Norman Thomas, Late Socialist The hook-and-ladder team calls a warm from their eager run over the of the consistent pointers who made with last year's showing.<br />\nmomthIt's stop. . . . Sergeant Frank campus, stand around and show un- it possible last year for Hopkins to<br />\nCandidate, to Speak<br />\non ,individual effort, but has doir<br />\nSeven Awarded tatters<br />\nrushing across the lawn in front of usual interest in the procedure. Re- win every dual meet have returned<br />\nSeven players were awarded their<br />\nlittle to enlist the aid of groups. Be150 EXPECTED<br />\nNEws-LETTER<br />\nA<br />\nlet's<br />\n.<br />\nAmong<br />\nyear.<br />\nthis<br />\nthe<br />\ndormitory...<br />\nall$lover;<br />\nuniversity<br />\nto<br />\nthe<br />\nit's<br />\n\"Well,<br />\nof<br />\nletters. These were Lang<br />\nmark<br />\nvarsity<br />\nAssociaAthletic<br />\nthe<br />\ncause of this,<br />\nStudents Will Discuss Social<br />\nman eager for views runs eagerly go.\" . .. Students trekking over the those who will help in this direction (captain), Pasarew (captain-elect),<br />\ntion is Offering a prize of $25.00 to<br />\n4 Problems<br />\nis Captain Herman Schiebel, who, Debuskey, Horst, Jung, Bernard,<br />\nahead. . . . Frank, pantingly yells path back to the Barn. . . .<br />\nthe tlain having the highest total<br />\nWilliam and Johnson. In addition to this,<br />\nof sales, a prize of $15.00 to the \"Liberalism in Education\" will be out, it's up in the woods.<br />\noh the end of Straus along with Robert Kelley,<br />\npatch<br />\nA<br />\nman<br />\nMiller, and Yen Onorato, from the John Eldridge '29, manager of the<br />\nteam having the next greatest total the subject of a conference spon- The hardy NEWS-LETTER<br />\nField, soaking with chemicals and<br />\nof sales, and a prize of $10.00 to the sored by the Johns Hopkins Liberal hurries ahead of the fire-fighters. water. . . . A patch 15 feet square cross-country team, Will fit nicely quint, was given his major letter.<br />\nof a<br />\nin the distance run. At the same time, announcement<br />\nindividual having the greatest total Club April 19, 20 and 21. The pur- . . . Braving unknown terrors<br />\nttered with charred embers, giving into the place<br />\nGwinn.<br />\npose of the conference will be to possiby devastating fire, he bol<br />\nwas made of the election of Jack<br />\nof sales.<br />\noff an odor of wet smoke.. . . And, vacated by Richard<br />\nof<br />\nscene<br />\nThe<br />\ndistance men Purcell, '30, to the position of manstimulate interest among college stu- ventures forward. ...<br />\ntomorrow, probably an article by Other promising<br />\nSame Type as Last Season<br />\nreached.<br />\nso- the exciting conflagration is<br />\nare Shaver, Reeder, Gardner, May- ager for 1929-30.<br />\nThe season ticket which is offered dents in economics, political, and<br />\non forest fire precomes to the fire still un- the State Forester<br />\nnard, and Hancock. The last two Of these men, Johnson is the onis the same type as that sold during cial problems, and to encourage the . . . He<br />\nvention.<br />\non marked by the limiting forces of fire<br />\nare freshmen. Schiebel ran close to ly man who is absolutely certain not<br />\nthe past year. It has five major ad- establishment of Liberal Clubs<br />\nTotten of Union College in the two- to return. Debuskey may not play,<br />\ncampuses where none exist.<br />\nvantaieS. These are:<br />\nOACH DECLARES MANY<br />\nTENNIS TEAM TO PLAY<br />\nNoted Speakers<br />\nmile championships at the Middle but there is no certainty that the<br />\n1. It is transferable.<br />\nOPEN<br />\nJOBS<br />\nLACROSSE<br />\nTRIP<br />\nOne of the features of the conTWO MATCHES ON<br />\nstates—one of the fastest college stellar center of the last two years<br />\n2. A coupon can be used for each ference will be the attendance of<br />\nImportance of Second<br />\nraces of the season.<br />\nNew Men Threaten Position<br />\nwill not return to the court. Great<br />\nperson presented at the gate.<br />\nTeam Stressed<br />\nseveral of the most prominent libof Veterans<br />\nMiddle Distances Weak<br />\nhopes are held, because of the re3. It gives the purchaser the right. eral'leaders in the country. Norman<br />\nof<br />\npractice In the sprints, Edwin Lockard turn of all the team, for a chamto use the entire number of cou- Thomas, Socialist candidate, for Tomorrow morning at 11.30 the With just two weeks<br />\ngame and Philip, Ness are back. This pionship five next year.<br />\npons contained in the book at any President in the last campaign and tennis team will leave for Char- remaining before the opening<br />\nof the 1929 lacrosse schedule on will be Ness's last year, but Lock- During the banquet, short talks<br />\none game.<br />\nfor years Executive Director of the lottesville to open the 1929 season April 6, Coach Van Orman said hard, a sophomore, has a relatively<br />\nwere made by George Darley,<br />\n4. Two children will be admitted on League for ,Industrial Democracy, with the University of Virginia. The<br />\none adult's ticket at any of the will speak on \"The College Student team will spend the night there and last week that, \"There are plenty long track- life ahead of him. coach; Dr. Ray Van Orman, athof jobs still wide iopen.\" The Hop- \"Greenie\" Morrison and \"Shorty\" letic director; Henry Iddins, Major<br />\ngames.<br />\nas a Potential Voter.\" Father John practice in the morning. The match<br />\nthat all the Wilson, formerly stars at Forest McKinney, Lang, and Pasarew.<br />\n5. For the\" game with Maryland on A. Ryan, head of the Department will ' begin at 2 P.. M. The rac- kins mentor also stated<br />\nMay 25th at the Stadium, re- of Political ,Economy at Catholic queteers will spend another night at men are being tried out to find just Park, are looking good in the Dave Kaufman, who assisted in the<br />\nis still dashes. Lockard, it will be remem- coaching, acted as toastmaster.<br />\nserved seats may be obtained in University; and one of the foremost the University and leave the follow- who's who, but that there<br />\nthis bered, also built his reputation at Chief emphasis was laid in all the<br />\nexchange for one coupon for one liberal thinkers, will take for his ing morning for Lexington, arriving a long way to go. Of course,<br />\ntvith the same high school. Other prom- talks, upon the problems that conadult seat and one coupon for topic \"The Meaning of Liberalism.\" at that point about noon. That af- situation_yvas to be expected<br />\nfrom ising dash material is found in Wil- fronted the team this year, especialtwo children's seats. Box seats, Either Paul Blancharg or Walter ternoon Captain Brockman will lead only three veterans returning<br />\nteam.<br />\nlison, Johnson, Selsky, Cordi, Fior, ly that of a lack of suitable cage or<br />\ntwo coupons for one adult's seat, Ludwig will lead a;Amnion on his men against W. L. The team last ye'ar's championship<br />\nand Neu. Ashton Devereaux has gymnasium. The loss of time and<br />\none coupon for one child's seat. \"Students in Industry.\"<br />\nwill remain in Lexington that night, Every day the squad goes<br />\na hard scrimmage for over recently come out.<br />\nthe inconvenience which resulted in<br />\n.<br />\nSizes of Books<br />\nA number of other very interest- leaving for Baltimore Saturday through<br />\nan hour with the first attack play- Coach Waldo Hambleton finds using Carlin's as a practice floor was<br />\nThe books of tickets are offered ing meetings are also planned, morning.<br />\ning the first defense and the second the greatest weakness in the middle dwelt upon, and hope was exfor sale in the following sizes:<br />\nNew Men Promising<br />\namong them a series of round table<br />\nattack matched against the second distances. Here \"Spoke\" Wheel- pressed that before next season a<br />\nFor adults:<br />\nwill<br />\ntrip<br />\n,the<br />\npolitimake<br />\nto<br />\nand<br />\nteam<br />\nThe<br />\neconomic<br />\non<br />\ndiscussions<br />\n$10.00<br />\ndefense. The fact that the first at- er's little running mate, John Yel- suitable cage might be erected here<br />\nBook of 12 coupons<br />\nfolthe<br />\nthe<br />\nfrom<br />\nof<br />\nselected<br />\nbe<br />\nmembers<br />\nprobably<br />\nby<br />\ncal problems, led<br />\nlot, should prove valuable, together at Homewood.<br />\n5.00<br />\nBook of 6 coupons<br />\nHelmholtz,<br />\ntack<br />\nand the fire defense never come<br />\nas<br />\nIrons,<br />\nwell<br />\nmen:<br />\nas<br />\nlowing<br />\nHopkins liberal group,<br />\nFor children under 18 years of age: visiting student delegates. The com- Warfield, Goldberg, Salabes, •Shu- up the same two days in succession with Hugh Emerson, Dunning,<br />\nSchedule Is Attractive<br />\nPerry, and Lockard. Loiseaux has<br />\n5.00<br />\nAlthough the schedule for next<br />\nBook of 12 coupons<br />\nmittee in charge of arrangements ,.gar, Gump, and Brockman. Gump is sure proof of the coach's state- been added recently to the list of<br />\n2.50<br />\nnot complete, announcement<br />\nBook of 6 coupons<br />\nexpects the conference to be one of and Brockman are the only veter- ments; This is a Year when every those out for the one-fourth and year is<br />\nwas made that games had been<br />\nA great number of these books of the most unique and important<br />\nat University man 'will have his chance to prove one-half mile events.<br />\nhas'played<br />\nIrons<br />\nans.<br />\nscheduled with Army, Fordham,<br />\ntickets were distributed at chapter events in collegiate circles in recent<br />\nof Delaware and Warfield at Ge- whether he knows enough lacrosse<br />\nField Events L.<br />\nRutgers, Catholic University, Duke,<br />\nmeetings on last Wednesday night. years.',<br />\nAlthough Garland Hershey and Virginia, and Temple, and that a<br />\nAll wishing to obtain these tickets The Liberal Club holds its meet- neva College. The new men have to play a first string position.<br />\non game with William and Mary was<br />\ncan .purchase them at the office of ings every Monday,lat 1 P. M. in shown such good form that the two \"Father Bill\" Schmeisser said at \"Bumps\" Scheidt show, up well<br />\nthe hurdles, they will have to vie pending. These games, of course,<br />\nthe Athletic Association in_Remsen room 315, Gilman Hall. Everyone veterans are expected to play rather<br />\nthe lacrosse organization meeting for honors with Stafford and Cordi.<br />\nare in addition to the fixtures with<br />\nHall.<br />\nfar down on the ladder.<br />\ninterested is invited to attend.<br />\nearly this spring the success of last Scheidt and Quirk are contending Maryland, St. John's, and Loyola.<br />\nVirginia is expected to offer the year's team was primarily due to the for the Hopkins pole vaule record, All attempts to schedule a One<br />\nMany Home Games on<br />\n'stiffer opposition of the two teams fact that the second team could al- and so far it's either's race, with a with Washington College have been<br />\nToday Marks End of<br />\nnamed Donovan in the unavailing, because of conflict in<br />\nLacrosse Schedule<br />\nR. 0. T. C. Inspection to,be played. Alphonse Smith, for- ways give the first team a good fight freshman<br />\nrunning. Garrett, a winner against dates.<br />\nexpectcourse,<br />\nof<br />\nof<br />\nis<br />\nis,<br />\nschedule<br />\nstar,<br />\ninspection<br />\nTome<br />\nmer<br />\nThis year's lacrosse<br />\nToday concludes the<br />\nin the daily scrimmages. Again this Maryland last year; Quirk, Caldschedule shows a much more<br />\none of the most attractive ones that the local infantry and engineering ed to take his match, but the Jays<br />\nyear the ,second team is close on the well, and Shirley, a freshman, con- The<br />\nthan<br />\nis<br />\nseasons<br />\nwhich<br />\nhas been arranged for many<br />\nunits of the R. 0. T. C.,<br />\nhope to open the season with a vic- heels of the first. No man can af- stitute the best group of high jump- comprehensive group of games<br />\nyear. Of particular<br />\nthis<br />\npast. Our two oldest friendly ene- being made by Major Alexander M.<br />\nmade<br />\nthat<br />\nthe<br />\nat<br />\nmatches<br />\ntory by winning the<br />\nford to let up one minute if he ers that a Johns Hopkins track out- note are the contests scheduled<br />\nmies, St. John's and the University Patch, Inf.; Captain Samuel N.<br />\naccording to<br />\nLast year's team<br />\nwishes to keep his job, for no job fit has had in years,<br />\nof Maryland, will again be played Karrick, Eng.; and Captain William end of the line.<br />\nwith Army and Rutgers. No team<br />\nthis spring and the old spirit of Louisell, Inf. These officers re- pulled a surprise by beating the is sure on a Hopkins' lacrosse team. the coach.<br />\nis a keener rival than the soldier<br />\nCordi,<br />\nHershey,<br />\nNeu,<br />\nStafford,<br />\n\"win, or Aie in the attempt,\" does viewed the battalion at 4.15 P. M. Charlottesville outfit and the Blue The interested crowd continues to<br />\nboys from the Point, while the name<br />\nTrattner, Wilson, and Shavitz are<br />\nnot seem lig be lacking in any degree yesterday and have been attending Jays will be out for another victory.<br />\nof Fordham is synonymous with<br />\nthe<br />\nup<br />\nkeep<br />\nto<br />\non<br />\nUnivercan<br />\nwhat<br />\nthey<br />\nafternoon<br />\ndoing<br />\neach<br />\ngather<br />\nto- Unless the W. &amp; L. team shows<br />\namong this triangle of rivals.<br />\nthe best in basketball circles.<br />\nthe classes both yesteMay and<br />\njump<br />\nbroad<br />\nthe<br />\nin<br />\ndone<br />\nwork<br />\nfine<br />\nsity Parkway, where a row of parkthe students<br />\nTwo staing colleges have been day, where they quiz<br />\nconsiderable improvement over last<br />\nA maed cars occupies most of the avail- last year by \"Eggs\" Vivell.<br />\nthe conduct of<br />\nadded to our list of opponents for directly and watch<br />\ntheir<br />\nwin<br />\nshould<br />\nHopkins<br />\nyear,<br />\njor problem on the coach's hands Talks at Banquet<br />\nunthe<br />\nable curb space. Doubtless<br />\nthis spring; namely, Rutgers and the work.<br />\nis to find an adequate successor to<br />\nbasis this match at Lexington.<br />\nRevive Hopes of Cage<br />\ninitiatel find the peculiar physical Paul Walp, holder of the Hopkins<br />\nthe University of Pennsylvania. Rating is on a different<br />\nbeing<br />\nunit<br />\neach<br />\nOrman,<br />\nRutgers was among the teams that year from formerly, satisfactory,<br />\nexercises the squad goes through javelin-throw record. A veteran, The speeches of Dr. Van<br />\nthe basIt will not be necessary<br />\nwere in the Olympic play-off last classified as excellent,<br />\nqualify Mr. Iddins, and others at<br />\nto<br />\nremoved<br />\ntry<br />\nfar<br />\nto<br />\nquite<br />\nwilling<br />\nis<br />\nscrimmage<br />\nbefore<br />\nBurke,<br />\nan<br />\nto<br />\naccording<br />\nfor members of the NEWSketball banquet have revhed hopes<br />\nyear and promises to have a very or unsatisfactory,<br />\nyears,<br />\nfrom the popular conception of a and so are Woods, Shirley, and<br />\nLETTER Editorial Staff to<br />\nabsolute standard. In past<br />\nof having a cage built before next<br />\nstrong twelve this year.<br />\n.Berger,<br />\nJim<br />\nof<br />\nloss<br />\nThe<br />\nNEWSCaldwell.<br />\nthe<br />\nat<br />\npresent<br />\nbe<br />\nin<br />\nunits<br />\nfinished, smoothly functioning Hopseason. Thus far, the cage<br />\nafter the inspection of all<br />\nLETTER office on Tuesday,<br />\nPaul Hill, and Bob Fowler Will be year's<br />\nAs in the past few years, Rankins championship lacrosse team.<br />\ngiven area had been completed,<br />\ncommittee has in hand, in pledges<br />\n2. The next issue of<br />\nApril<br />\ndisand<br />\nthe<br />\nshot-put<br />\nin<br />\nfelt<br />\nkeenly<br />\ndolph-Macon and Swarthmore will a<br />\nexpected that between 100 and 150<br />\nthe NEWS-LETTER will not<br />\nNevertheless these exercises are es- cus-throw. Kutcher, a burly line- and cash, something over $30,000.<br />\nagain be played, and these two<br />\nat<br />\nbe published until Tuesday,<br />\nstudents will attend, and that<br />\nto building up all-important man, and Big Bill Dorman, just en- The original estimated cost of the<br />\nsential<br />\nHomegames will both be played at<br />\nrepreApril 9.<br />\ncage was around $150,000.<br />\nleast thirty colleges will be<br />\nContinued on Page 2, Col 4<br />\nstamina.<br />\nwood.<br />\nsented.<br />\nContinued on Page 3, Col. 4<br /><br />\nLIBtRAL CLUB CALLS<br />\nEDUCATION CONFERENCE<br /><br />\nPROMISING TRACK SQUAD<br />\nROUNDS INTO SHAPE<br /><br />\n26, 1929<br />\nTHE Xl04-1.N.S. HOP1UN5 NEWS-LETTER. MARCH<br />\na Day<br />\nAt Your Service 24 Hours<br /><br />\n=MS<br /><br />\nINTERCOLLEGIATE NEWS --<br /><br />\n-<br /><br />\nszie<br />\nlahmertrate.<br /><br />\nFIRST HALF-MILE<br />\n-Mile<br />\n10c each additional Half<br />\nor fraction thereof<br /><br />\n7t<br />\n_<br /><br />\n_<br /><br />\ntrzerbe. ai reemidi-e.:.ese niettter Deeter:Dcz<br />\nXtt—, auks Act vf.<br /><br />\n1718 N. Charles Street<br /><br />\ninizad to gint laiighez<br /><br />\n_kkhoingh Stchlrariestvis rx-eib<br />\n- aver-hot zo-i.oth<br />\n\"iiont'otgoe<br /><br />\nFirrysim<br /><br />\n20c<br /><br />\noi<br /><br />\n-<br /><br />\nfor I to 4 pausragers<br />\nThe ',nose rate applies<br /><br />\n7:t<br /><br />\nCOMPARZI<br /><br />\nPvitakiebed senn-greeit-7<br />\n. y<br />\nBarkens Viiikverek<br /><br />\n_<br />\nS<br /><br />\n,77L ft<br />\nvie<br />\nSS<br />\nSamighege<br />\nSS<br />\nILA.1.46cEseito v3..eds<br />\nOt<br />\narneks<br />\nBinninimp terrerarty_<br />\n-entreiVise IlEnelen-en<br />\nDRAB; her everesnisvstoms<br /><br />\n15% (Discount<br />\nOn All New Puh:.,,,r,<br />\nAt tr.,<br /><br />\n:<br /><br />\nTE 13GDKSHOP<br />\nSIGN OF THE FRIGA<br />\nHOWARD STREET<br /><br />\nTellipisse<br />\nEDITORiAL<br /><br />\nDEPARTMENT<br /><br />\nPEN Ev52(iNCiS<br /><br />\nc.A.' H. FETTING<br />\n-...MANUFACTURING JEWELRY CO.<br /><br />\n. _<br />\n77-it<br /><br />\n7. \"...I&amp;<br /><br />\n7<br /><br />\n▪<br /><br />\nManufacture':<br /><br />\nfJf Oregon,<br />\n- -72 r_X7<br /><br />\nE.J•14.<br /><br />\n.7 ,\"<br /><br />\nE P-Artser<br />\nH.<br />\nY V<br />\n..i416. -Z.<br />\n,<br />\nfkle<br /><br />\nGreek Letter Fraternity Jewelry<br />\n_n -L▪ LOa<br />\notivered tche so-<br /><br />\n.7.et<br />\nrhia<br /><br />\n3L. Hs:7u:<br /><br />\nt ta<br />\n:<br />\nboa<br /><br />\nfeka brocie=<br />\nOrigr3 by tks art r<br /><br />\nSTICYHEX E. FTEEXaltALE, 31<br />\nILISMENS DEPA.RTMENT<br /><br />\n-<br /><br />\n-<br /><br />\ncruelty Whm.<br /><br />\nYeantrer<br /><br />\nThe Res.d-Tay:,r Compalty. 1.4err!<br /><br />\nu Bt<br />\naiih<br />\nbtrif<br />\nln\"<br />\nghe cAnkle-gashioned Oxford<br /><br />\n_1-11she)<br /><br />\n5J-1.<br />\n,<br />\n7,77.7<br /><br />\nthe 7.11<br /><br />\n•.‘- plane<br />\n, T1:11<br />\n.1*\".5...<br />\nnoii:; to a/high<br />\non,: tratuported<br />\n7ti..t.7.:7. nil a feu- mules from the campus,<br />\n--<br /><br />\nH.A.RZY 0. Scrams. JIL, \"21<br /><br />\nneetineimit nonteilI1.1a<br />\nJesikiiegia.. 111<br />\nJam<br />\n1411* r_ older, -as<br />\nnewsy T. seemecre.<br /><br />\n314 NORTH CHARLES STREET<br /><br />\n7 -±ie p,sycl.-_ bsn?ETC-1K on -2..t.st stoolnots in<br /><br />\ntire field. raragong f<br /><br />\nOtorst<br /><br />\nCereaktilit<br />\nRommer<br />\nAirerturtry Stcf<br />\n1.<br />\naa H_<br />\nGas Hart, 11<br />\nI<br />\nr<br />\nRaney<br />\nS. Prim\", 12<br /><br />\neat,/<br /><br />\n(Opfyi,7i,te<br /><br />\nt7<br />\n.<br /><br />\nJamie,<br /><br />\nAderrafuti Mensiorr<br />\nGams W. Gaasars, '29<br />\nWiles Sty<br />\nTineturv<br /><br />\n515 NORTH<br /><br />\n_<br /><br />\nEstite.t.ireinef<br />\nGakoca E. Bars,<br />\nA.tinetant Msreseting Etliter<br />\nMarratring &amp;diger<br />\nGems Gtrirr.<br />\nPamir W. Nom 29<br />\nA.Seeraitts Eist•Yrs<br />\nRomer &amp; SUM WO<br />\nINuesa EL Darrow '2;/<br /><br />\nFaelnurt L Fettl.v_<br />\nLeseart SYrA.Co-r..<br />\nred W. Ifivess,<br />\ncoarse IL Dark&amp; 11<br />\nHobertVSartasen. -at<br />\nwoes wets. 1*<br />\nMalt OW.<br />\nHive.<br />\nlisivied<br /><br />\n-<br /><br />\n_-<br /><br />\n-<br /><br />\nPrtoiueed<br /><br />\nFicid<br /><br />\nSce-A<br /><br />\nI/Erna. 4090<br /><br />\nJ.<br /><br />\n•<br /><br />\nI,<br /><br />\ntilfay_flower Cab Co.<br /><br />\n2.1<br /><br />\n-<br /><br />\nled_<br />\n▪<br /><br />\nThe, s a-toot-I the<br />\n-721-7;i1:17<br /><br />\n7<br /><br />\n:77 t71... 7:72\"<br /><br />\nF:.•uteeta,<br /><br />\nMINI1111.<br /><br />\nEDITORIAL COMMENT<br /><br />\n.f<br /><br />\n- ct<br />\n-.<br /><br />\nLOST AND FOUND<br />\nons, one<br />\nAST year, about three weeks nitioare xra roiaminati<br />\n= of<br />\nof the mambas of the sonar class suiced the co:adorn<br />\nof this suluabk<br />\nlosing his thsavk Between the leather owers<br />\ntaken durvolume, were all the m,morarida and class room Timings<br />\nthe finals, it was<br />\ning the second half_ In order to satura.-uonly pass<br />\nrotes_<br />\nabsolutely imperative that he recover this set or lecture<br />\n.set out to ex:<br />\n$0o with troubled mood and wrinkled forehead, he<br />\nthe seats in the lecture<br />\nplOre the impala: He seanched beneath<br />\nd the Yahrooms, probed the dark-corners of the hallways, hitervime<br />\ninquired it the<br />\nous janitors called at the -Y.- office at the. Barn,ied, organizetd<br />\nthese measures<br />\npow °Ike in Gilman Hall and, when<br />\nparty. But even<br />\nhia obliging fraternay brothers into a. 4eardn4<br />\nposse, the little black leather<br />\nvoitinteer<br />\nthis<br />\nwith the asustarae of<br />\nState Roads funds.<br />\nnotebook remained as thieve as jack Hart or the<br />\nprospective<br />\nFinally, during the course of his Wanderings; the manipulates<br />\nthe janitors who<br />\ngraduate happened to interview one of<br />\nthis Uno<br />\nwith<br />\nw<br />\nthe mop and box= in Reinfell Hall. Aftercodes:nofrom the bottom<br />\nminty employee, the notebook was finally salvaged . '<br />\nof a pile of old newspapers and the senior graduated<br />\nthe sane<br />\nThis lengthy ane-ukee—presents an unusual use but<br />\nwho lose articles<br />\ndifficulty is being experienced constantly by those property is reon the campus The rOCESE by which misplaced<br />\n, lizt-C.T.-MISS<br />\nturned to its rightful owners has become a haphazard<br />\nwhich are Lost in the Barn or about<br />\nbusiness_ Personal powiessibl3S,'<br />\noffice. Articles,<br />\nthe University grounds, usually turn up at the \"T. in the -custody<br />\nfound on the ground floor of Gilman -Hall, are placed<br />\nm..._.haniu.1 perunls,<br />\nof Mr. Myers at the putt otha. Fountain pens, tly left in lecture<br />\ncoats, hats, texts and notebooks, Which are inadverten<br />\n*lino<br />\nmoms and halls, usually may be recovered from the<br />\nnd is unable<br />\n, Thus, if a student loses an article on the canapuramake a proto remember exactly where it was mislaid,ohe must<br />\nit their business to<br />\nlonged tour of all these ageno.ies which: colic<br />\nsalvage misplaced property.<br />\na cenent<br />\n• Thu difficulty might be overome by the establishm and student<br />\ntralized lost and found bureau. Universtty eripl,yees<br />\nthis central office.<br />\nvould be instructed to surrender all lost articles to<br />\nfurthering such a<br />\nThe NEWS-LETTER Will be gladto co-operate in cc's:if-kite list of<br />\nscheme by, iliublisiting, each Week, in its columns, a ,<br />\nrecovery<br />\narticles •found on the canipas. By such a procure theof a ..:- -.171:risteal<br />\nof missing property would becr.me a straple matter<br />\nplivuited process.<br /><br />\nL<br /><br />\nSTOP THIEF! .<br />\nand the open seaITH the approach of the Easter vacation<br />\npapers, the University librarians again find<br />\nW roan for term<br />\nof reserve books.<br />\nthemselves face to face with the perplexing problem<br />\nmasterpieces, many<br />\nIn order to assist in the compilation of literary<br />\nof appropriating<br />\nof the more zealous students have formed tibeitabit<br />\nintellectuah quietly<br />\nvolumes fr,sn the reserve shelves. These budding<br />\nly stroll out of<br />\ntuck the necessary tomes under their arms, nonchalant<br />\nand retain the books<br />\nthe reading room without signing a receipt slip,<br />\nfor an indefinite length of time.<br />\nprecipitated into<br />\nThen, the remaining members of the class are<br />\nat the Peabody or Pratt<br />\na state of panic. They must seek recourse find the required mateinstitutions, where they may, or may not,<br />\nation of one man,<br />\nrial. Thus, because of the selfishness and inconsider<br />\nthe entire class is inconvenienced.<br />\nto discover<br />\nTo date, the library authorities have been unable<br />\npetty thievery. The ofa satisfactory method for combating this<br />\nas to require the profesfense is not sufficiently criminal in nature Philo Vance. Neither<br />\nsional services of a Sherlock Holmes or a<br />\nto assume the roles of superdo the ladies at the loan desk wish<br />\nthe library.<br />\nsleuths and search each patron as he leaves<br />\nsense of sportsmanWe can appeal only to the undergraduates'<br />\nship. Play lair with your clam mates!<br /><br />\nThe foot neatness produced<br />\nbyINTrTri-BlIgh Ankle-Fash.<br />\njolting will strike the right<br />\nchord with you. No gapping at the ankle, no slipping at the heel . . . .<br />\nCahn's QUALITY SHOP<br /><br />\nwhere it *ix.4 Launched by means of.<br />\na tinge raib!)1er .cable. The machine<br />\nmay itIvi 7 a - - tow of theves...Nwplaite type .with. a<br />\nharharoto<br />\nteitta spread of 34 feet, and is noted<br />\nfact<br />\nris.e<br />\nfor<br />\naccount<br />\nThu may<br />\nfor its ...-.tdttiary is- flight.<br />\n:JILT<br />\nt<br />\n00611;<br />\nthat these Waren;<br />\nThis nue-hiss( is not advised for<br />\nThe<br />\n.<br />\nare SO huge and isetinci&amp;e<br />\nuse on week-end trips and making<br />\nare<br />\naria theory has been thed they<br />\n8 o\".-icoi.• ratres on Mondiy mornfed on grace, and de:eloped by c,v- :K2<br />\n'3714g ice!<br />\n.-<br /><br />\n7-1.1\"<br /><br />\n7<br />\nthe United Stat.,National Stu-den: caleno - - present engaged in making<br />\nf Si-1th Africa by<br />\na<br />\n..7 • _o ••••a the c-Ar.in.<br />\n---- The group v.-hic.b. 6<br /><br />\nI<br /><br />\nLiN StS ()<br />\nBaltimore &amp;‘f,.....?<br />\nBALTI. ORE<br /><br />\nthe<br />\nstuder,.-:s<br />\nr'.1. are emphat_.--...-headed rah-rah<br />\nbeen -described<br />\n::-.<br /><br />\na recent<br /><br />\na:<br /><br />\ngrarlua:t • _a- •<br /><br />\n:ore<br />\nAfrican,:<br />\n7ar<br /><br />\nThe French<br />\nSTYLE Na-'. I57R<br /><br />\nAs the st.<br />\ntheop-:A'ican ,-._:<br /><br />\n.<br />\nspe<br />\nsessi-fn_ Ha: _ tht:ess :rue'<br /><br />\ni;;E•<br />\n. Sr's-tient!<br />\nd,,:mortstrat;::,.r.<br />\nMadrid,<br />\nthe dictatorship of Premier<br /><br />\n.<br />\nPrim;<br /><br />\neditc,:tiona/<br />\n:he<br />\nits rtfrodmilt1 is q,:lite<br />\nde 'Rivera, have ca:hei<br />\nMadrid police frepen:::. saris: !he<br />\n,hie?: keep (nit the inzeee r. On ser.<br />\np<br />\nnpellei competent<br />\n,<br />\nMass Chq,<br />\noscasions the c5cers were cc<br />\nI<br />\n.-ii7Terince<br />\nto draw their r..coriis in crier<br />\n.<br />\n,<br />\ndisperse the<br />\n.<br />\nIn<br />\nno f7.7.514.....\"'t 5<br />\n7/:Fre<br />\n'the s.sit;ti r.<br />\nSt:dCnrS<br />\nThe moan: conic o..7<br />\nC.! a :a:,<br />\nthe re,-,.crt<br />\naydd<br />\nto his political views. The snt-<br /><br />\n.,adY resented this expulsion<br />\ndent-;<br />\n:;csi-d to atteni dasses<br />\nre7<br />\nplays and parties but daneing. is<br />\n.-1 cut: Tee the chief<br />\n.5:r.-.91:;htcrt,<br />\nenic,vntent.<br />\n_Miss Chang was si:ccked at<br />\na.te of rliec discipline has also<br />\ncaused s rupttrre ,'etz.veen the uni- erressiz.e toe of<br />\nand<br /><br />\nthe<br /><br />\nN-a(onder that the<br />\nturn out such wonderful<br /><br />\n7.<br />\n)<br />\n0144 \".\"-- „7<br />\n,<br />\nESTAtIWRIED EISIGL1S1kWN4VaiRSITY<br />\n774g-ORtla OVA,..t:35UTHFUL<br />\nSTYLES:<br />\nGUISHED<br />\nCHARTS SC*ELT- FekDIS<br />\nSTATES.<br /><br />\nSERVICE IA TH.i.--4\"44.gt<br /><br />\nC:CS<br />\n97:0n1CrS are<br />\neach or/or. As far<br />\ne their<br />\n:he;<br /><br />\nand<br /><br />\nversity oficials<br />\nment.<br /><br />\n_<br /><br />\n-mad.:Arid<br /><br />\nnot<br />\nOnSei<br /><br />\nth,-<br /><br />\ngovern- •„,-(411.1:ry,<br /><br />\nSuits 10<br /><br />\nTopcoats<br /><br />\naftini<br /><br />\ndIMPr—<br /><br />\nHere we<br /><br />\n.„<br /><br />\nSpania: !-<br /><br />\ners, and politicians--their<br />\nstarts early in hie.<br /><br />\nPROMISING TRACK SQUAD<br />\nROUNDS INTO SHAPE<br />\ncage 1.<br /><br />\nAn ambiti.5its freshm.an at the<br />\n:ered from ,I,Friends' School, _are<br />\nUniversity of South Dakota is the<br />\ntraining for these places. as .are<br />\nproud possessor of a three passenBurke, Anderson. and Hershey.<br />\nger biplane in which he is alp to<br />\nHambleton<br />\nAltogether, Coach<br />\nevery<br />\nhome<br />\ndistant<br />\nquite<br />\nhis<br />\nfly to<br />\nfinds a weakness in the hurdle and<br />\ninto<br />\nlate<br />\nquite<br />\nthere<br />\ntarry<br />\nweek-end,<br />\njavelin ranks, and a need for tall,<br />\nMonday morning and get back in<br />\nrangy men for the weight events<br />\ntime for his 8 o'clock class on ifonand the high hurdles. Except foe<br />\nday morning.<br />\nthe middle distances, the flat trac<br />\nThe sophomores will have io do<br />\nevents seem well enough tared for,<br />\nsome tall thinking to beat these modand the team otherwise rather even-iced freshmen!<br />\nes<br />\nStudents who are underweight or<br />\nin other ways not physically perfect<br /><br />\nfor the Hopkins pole vault record,<br />\ninexperienced and young, it is promising.\"<br /><br />\n— 1<br />\nBY SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br /><br />\n\"<br />\n:<br />\nse<br />\nIf)<br />\nott<br />\nler<br />\nhai<br />\nCIF EAtt_11/411CUIL<br />\nThe character of the suits and<br />\ntailored by Charter House<br />\nwill earn your most sincere liking.<br /><br />\ntopcoats<br /><br />\nlile liet Hub<br />\nBaltimore. Cheri.. owl iamb.<br /><br />\nmo▪ ro<br />\n41•I•▪ 1<br />\n41M<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER,<br />\nMARCH 26, 1929<br /><br />\nDR. McCOMAS TALKS<br />\nON SPIRITUALISM<br /><br />\nMANY HOME GAMES<br />\nSTUDENT COUNCIL WILL<br />\nON LACROSSE SCHEDULE<br />\nWATCH RESERVESHELVES<br />\nContinued frtnn Page 1. Col. 1<br />\nDonald Hiss, President of<br />\nOur only gime outside of the<br />\nthe:' Student Council, warns<br />\nPsychology Professor Tells<br />\ncity is the one 'with Army at West<br />\nof<br />\nstudents that books on the reInteresting Seances<br />\nPoint.<br />\nOA ANNIE (BERG<br />\nserve Therv,es are, not to be<br />\nAnother pleasing characteristic of<br />\nLAUGHTER AROUSED<br />\n\"The Old Boy Himself\"<br />\ntaken from the library without<br />\nthis<br />\nyear's schedule is the number<br />\nleavin<br />\ng<br />\nthe<br />\ncard<br />\nwith<br />\nthe liTeacher's Interest Due to<br />\nNORTH Es? MARYLAND Ayes.<br />\nViews<br />\nof games that will be played either<br />\nbrarian. Although the reserve<br />\ni on Immortality<br />\nshelves do not come under the<br />\nat Home4od or at the Baltimore<br />\nDoctor Henry McComas,<br />\nHonor System, violations of<br />\nStadiutirtside of the Army<br />\nof the<br />\nPsychological Department<br />\nthis<br />\nrule are subject to student<br />\nof the<br />\ngame all 'Will be \"home games.\"<br />\nNotable for the excellence of their tailoring, faithfu<br />\nJohns Hopkins University,<br />\naction because its observance<br />\nlly<br />\ngave a<br />\nto La Bitt:41T-BI Dto<br />\nreflect the latest decrees of fashion.<br />\nFor the first time in atnumber of<br />\nvery interesting talk on<br />\nis dependent on the honor of<br />\n\"SpIritualJe<br />\nA<br />\ndiversif<br />\nism\" at the assembly last<br />\nin\"54'...o lt<br />\nied assortment of pleasing patterns permits<br />\nyears, Mt. Washington and Hopthe individual.<br />\nThUrsday.<br />\nan almost unlimited indulgence of your personal<br />\nEstablished 1832<br />\nThe doctor stated that he<br />\nIf the breaking of the rule<br />\nkins have decided- to play a posttaste.<br />\nwas<br />\nPHILADELPHIA<br />\nasked to'report on the mysteri<br />\ndoes not stop drastic action<br />\nes of<br />\nseason game. These post-season<br />\nREADY,TO-WEAR<br />\nwill be taken. Any one disOfficial Makers of the Standard . seances- a0d \"spiritualism, in general.<br />\ngames were played annually until a<br />\nThe institution interested in<br />\ncovered'gtility of such an act<br />\nspiritbreak Came a few years ago. The<br />\nualism wanted him to either<br />\nwill be brought before the Sturefute<br />\nexact.date for this game will be anor acknowledge the truths<br />\ndent Council. As a matter of<br />\nof the<br />\ncommon courtesy to the lispirit -world.<br />\nnounced later.<br />\nOr more<br />\nbraryctaff this rule. should be<br />\nIn his talk, Dr. McComas<br />\nstated<br />\nobserv<br />\ned, for its violation<br />\nthat he had investigated the<br />\nseances<br />\ncauses them a great deal of<br />\nof a young female medium,<br />\nof<br />\nJohns Hopkins ling<br />\ntrouble.<br />\nFive East Lexington Street<br />\nwhom he had had a favorable<br />\natilt FPLAvi4ous,<br />\nletter<br />\nPrices Upon Request<br />\nJust Around Corner from Charles<br />\nendorsed by A. Conan •Doyle.<br />\nILVIT<br />\nILE<br />\nTINI<br />\nENTR<br />\nAt<br />\nIE<br />\nOrders accepted at the<br />\n•KKITH HOWARD AT filwriKlibi<br />\nthe conclusion of his investigation<br />\nUNUSUAL AND ARTISTI<br />\nPost Office in the College<br />\nC I'11..1,S.<br />\nhe found that the seances were<br />\nLETTERS TO THE<br />\nonly<br />\nContinuous Daily Mat 35c, Eve.<br />\ntricks. He stated to the student<br />\n50c<br />\nFrom 1.30 to 11<br />\ns<br />\nPhone, Vcr. 7042<br />\n— EDITOR<br />\nthat A. Conan Doyle had been<br />\na<br />\n\"dumb sucker.\"<br />\nONE WEEK ONLY<br />\nA PLEA FOR BEN<br />\n\"Elsie\"<br />\nTo<br />\nthe Editor of the NEws-LETTER:<br />\nDr. McComas then went on to<br />\nFIRST TIME AT POPULAR<br />\ntell of his other experiences. Many Dear Sir:<br />\nPRICES<br />\nNo Deposit Required<br />\nnotable spirits were discussed,<br />\nIt was with a distinct sense of<br />\namong' whom were mentioned<br />\nof<br />\nJohn<br />\ns<br />\nHopkins University Students<br />\nMARTI<br />\nN<br />\nJOHNS<br />\nON'S AFRICAN<br />\npleasure that I completed reading<br />\n\"Elsie\" and \"Black Bear\", who had M.<br />\nEXPEDITION<br />\nJ, Schmulovitz's article, \"The<br />\nLight and<br />\n\"passed out\" sometime ago. The Commu<br />\nnion of Great Minds,\" which<br />\nLombard Sts.<br />\nBuicks<br />\ndoctor stated that \"Elsie\" was a appear<br />\nPLaza 6000<br />\ned in a recent issue of the<br />\nChevrolets<br />\nvery good spiritl There seemed to Nnws-Ltrrrit<br />\n1723-25 N.<br />\nWith MR. 6? MRS.<br />\n.<br />\nCharles St.<br />\nbe nothing that she didn't know,<br />\nChryslers<br />\nMARTIN JOHNSON<br />\nVErnon 4049<br />\nThis article very cleverly, and at<br />\nand he stated- that the people present<br />\n2402<br />\nPennsyl,<br />\nHupmobiles<br />\ntimes<br />\nmockin<br />\ngly<br />\nand<br />\nironica<br />\nlly,<br />\nat the seances, including himself,<br />\nvania Ave.<br />\nThis Picture Represents Four Tears<br />\nWillys-Knights<br />\nLAfayette 2000<br />\nof Travel and Study of the<br />\nwere very much enchanted by the points out the indisputable plagiarThis little girl shakes<br />\nDarkest Africa<br />\nism<br />\ncommit<br />\nted<br />\nby<br />\none<br />\n\"Ben\"<br />\nin his<br />\nspirit's ,remarkable high` voice. Dr.<br />\nBaltimo<br />\nre<br />\nConced<br />\nes<br />\nMilesto<br />\nne Supremacy<br />\na mean ear-ring.<br />\nMcComas said that he had been article Dreiser. The author of \"The<br />\nThere's really nothing<br />\nvery .much interested in the voice Communion\" leaves no doubt about<br />\nshe doesn't know •<br />\nand was determined to Solve the the faux pas that was made. He<br />\ndisplays a spirit of inquiry and a<br />\neven been to Niagara<br />\nmystery. He related to the student<br />\nwillingness to show the truth that<br />\naudience how he had persuaded the<br />\nFalls which sort of<br />\nshould' be complimented.<br />\nmediu<br />\nm of this particular spirit to<br />\nmakes her education<br />\nI congratulate you, but don't you<br />\nallow him to place a medical instrueven more complete.<br />\nment on the medium's neck. ' This think yOu have been,just a little too<br />\nWouldn't you know<br />\ninstrument was for the purpose of harsh toward \"Ben\"? I admit the<br />\nshe'd be the one to<br />\nhearing every little noise that would plagiarism; but Dreiser, plagiarized<br />\nask \"how handsome<br />\nbetray itself in the medium's vocal though it was, nevertheless was<br />\ndoes a young man<br />\nchords, But the \"little rascal,\" as stimulating. If nothing else, it gave<br />\nthe doctor called him, had practiced us your 'article, which I cosider a<br />\nhave to be before he<br />\nthe art of squeezing the wire of the distinct relief from the trite articles<br />\nwears Braeburn Uniinstrument so that the contact of the on Campus Activities and .Value of<br />\nversity Clothes.\"<br />\nfingers on the wire produced no a College Education. And again it<br />\n835<br />\nsound. Therefore, Dr. McComas gave us Mencken's opinion of Drei$40<br />\ncontinued, all sounds in the ser, which is much preferable to the<br />\n$45<br />\nmedium's throat were cut off as half-formed opinion of the undersoon<br />\nas \"Elsie's.' voice was heard. graduates.<br />\nClothiers and Haberdashers<br />\nAt last, after more investigations, And, then again, remember that<br />\nthe speaker told the audience, how far greater writers than \"Ben\" have<br />\nhe had, by means of his scientific committed the literary sin of plagi17 E. Baltirruire St.<br />\ninstrument discovered that the voice arism. This is no absolute defense<br />\nof \"Elsie\" issued tion, the, of \"Ben's\" misdemeanor, but a plea<br />\nfor some amelioration in condemnamedium's in,mth.<br />\ntion and a suggestion that you conInjects Humor<br />\nDr. NIcC.,In.ls told of other ex- tinue, if possible, your clever attacks<br />\nperiences in the realms of the spirit upon any further literary sins.<br />\nSidney Wolk.<br />\nworld. I lowever,- due to the<br />\nspeaker's somewhat bantering attitude, the audience was not held in, MUSICAL CLUB GIVES<br />\nHAGERSTOWN CONCERT<br />\na state of 's:xpectancy .as might have<br />\nContinued from page 4, col. 3<br />\nbeen expected from the nature of<br />\nthe speaker's topic. Instead the BAR rroNE SoLo—Mr. hlewelyn<br />\n-.<br />\nlisteners were made to feel at ease, Invictus<br />\nHuhn<br />\nSan Francisco, California, and laughter rocked the assembly BANjo CLUB<br />\nAugust 8, 1928<br />\nBelle Nuit<br />\nropm many times before the doctor<br />\nOffenbaCh<br />\nLarus &amp; Bro. Co.,<br />\nPopular Selections<br />\nhad concludeod his • humorous<br />\nRichmond, Va.<br />\nDear Friends:<br />\nBust.: JAY ORCHESTRA<br />\nepisodes.<br />\n'<br />\nI have been a very heavy pipe<br />\nsmoker for the last thirty years, and - At the conclusion of the talk, the GLEE CLua<br />\nhave always used Edgeworth ToRecessional<br />\nDe Koven<br />\nbacco (Plug Slice) and find there is no sReaker said that though his exAutumn Sea<br />\nDericke<br />\nother tobacco like it for a cool and periences in spiritualism seemed<br />\nwell flavored taste.<br />\nHopkin<br />\ns<br />\nMedley<br />\n,<br />\nI E Panama Canal diggers had<br />\nI am in the vaudeville business, and funny to the attilience, on the conarranged by Steinwald<br />\nEffective service to the public is possibl<br />\nhave traveled all over the world with trary they were not. He stated that<br />\ne<br />\nengineering brains and money<br />\nmy brother,and always have had very<br />\nonly when every step from purcha<br />\ninteres<br />\nspiritu<br />\nted<br />\nin<br />\nhe,<br />\nalism<br />\nwas<br />\nfor<br />\n'aplenty. But they were blocked<br />\nse of<br />\ngreat pleasure in recommending your<br />\nby<br />\nthe<br />\nraw material to the operator's\"Numb<br />\ntobacco; and many a time I havetad the sake of the mystery of im- J. H. U. WOMAN'S CLUB<br />\nmalaria and yellow-fever bearing mosqui<br />\ner,<br />\nto pay double the price in different<br />\nplease\" has been cared for.<br />\nGIVES BRIDGE PARTY<br />\nmortality. He also stated that he<br />\ntoes, which killed men by thousa<br />\ncountries for it, but! would sooner<br />\nnds.<br />\nThis<br />\nContinu<br />\nis<br />\nwork<br />\ned<br />\nthat than smoke anything else, asdo<br />\nfrom<br />\nfor<br />\nPage<br />\nmen<br />\n4,<br />\nCol.<br />\n4<br />\nwho<br />\ncan sense<br />\ninterrupt the \"voicer) of the<br />\nI<br />\nThen Gorgas stamped out the<br />\nhave 'tried all different brands. I can<br />\nmosthe relations between seemingly unrequito. The fever was conquered.<br />\ngenerally buy a one-pound tin and spirits and the spirits themselves, and Mrs.\"Dempster, Mr. and Mrs.<br />\nThe<br />\nlated<br />\nfactors<br />\n,<br />\nmen<br />\nFoil it up; and believe me, gentlemen, but that as yet he is somewhat John D. Clark, Dr. and Mrs. Janeet,<br />\nwith<br />\nthe<br />\nvision to see<br />\nCanal was completed.<br />\nit is real tobacco.<br />\na possible mountain-barrier in a<br />\nmoleThe importance of little things is recpuzzled by the directness of their Mt. and Mrs. Broadus Mitchel,<br />\nWilth best wishes from<br />\nhill<br />\n—<br />\nand<br />\nwith<br />\nMiss<br />\nthe<br />\nJacobs<br />\n, Mrs. Miles, Dr. Barresourcefulness<br />\n'<br />\nognized in the telephone industry<br />\n\"messages.\"<br />\nYours sincerely,<br />\ntoo.<br />\nto<br />\nsurmo<br />\nunt<br />\nit.<br />\nrett<br />\nand Dr. and Mrs. Van Holland.<br />\nSam La Mert<br />\n\"I'm one of the people who believe<br />\nof the<br />\nLa hfert Brothers'Piano Novelty Act.<br />\nAs an incentive towards skillful<br />\nthat a man's life is finer for a belief<br />\nand consistent playing and to add<br />\nin immortality, and it is for the sake<br />\nA nation,wide system of inter-connecting telepho<br />\nof any light that spiritualism might zest to the evening's entertainment,<br />\nnes<br />\nthrow on the subject that I'm inter- a prize was awarded to the winner<br />\nExtra High Grade<br />\nat each table, making some twentyWhere<br />\nmuch<br />\nthere<br />\nis so<br />\nested in it.<br />\nfive prizes which were distributed.<br />\nsmoke there must be some fire, but Many of our<br />\nrevered professors are<br />\ngotten<br />\nsmoke<br />\nthe<br />\nonly<br />\nI've<br />\nfar<br />\nso<br />\nnow, no doubt, proudly displaying<br />\ntheir spoils.<br />\nin my eyes.\"<br />\nt,<br />\n\"OUR PIONEERING<br />\nWORK HAS JUS<br />\nT BEGU:<br />\nTHE NEW<br /><br />\nHOLLYWOOD SHIRT<br />\nHollywood's latest creation! Black,<br />\nOrange and Blue are the colors.<br /><br />\neaster Suits<br /><br />\n'45<br /><br />\n105. *0E05 8c *on<br /><br />\nSIMBA<br /><br />\nT..11-111EUI3EUllic.<br /><br />\n1<br />\nF<br /><br />\nPianist All<br />\n\"Encore\" for<br />\nThis Smoke<br /><br />\nbut a mosquito,blocked the way<br /><br />\nT<br /><br />\nEdgeworth<br />\nSmoking Tobacco<br /><br />\nBELL SYSTEM<br /><br />\n1929<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 26,<br />\nU. Woman's<br />\nMUSICAL CLUB GIVES ,f. H. Gires Bridge Party ,<br />\nJams Hopkins Women's<br />\nHAGERSTOWN CONCERT ClubThepresented<br />\nits first real function<br />\nClub<br /><br />\nTEACHERS WANTED<br /><br />\nYELLOW CAB STANDS<br /><br />\nWes awe Imam srao are planalste<br />\nor<br />\nto toatelt la areaselary ecibgeas W.<br />\nor car,<br />\nceAleges shastate lira*<br />\nkelt gawped away Maims Md.SS.<br />\nTIRE SALTDIOIRIE TICAKWZ/LIF<br />\nAGE.NeT<br />\nMe-3 Title Assaez Mag.<br /><br />\nAT<br /><br />\nHomewood Fidd<br />\n39th and St. Pad &amp;mew<br />\n31st and a. Pad Streets<br />\nSafe and Eifiarat Service<br />\nNo Charge for Extra Painengers<br /><br />\nRENT<br /><br />\nSNAPPY<br />\nTUXEDOS<br /><br />\nCr.<br /><br />\n?RIM<br />\nIn<br /><br />\n11.-<br /><br />\n•Ifirrjughness<br />\nFta. tezr the CC<br />\n,arrangerner.-.- The public<br />\nh-thed NitL.400 clubs pee:„.....te,i their of their<br />\napparently<br />\nL the efforts of<br />\n'<br />\nVreeiate<br />\n'<br />\nar<br />\nthe Masecond annual cower.<br />\nthe capable committee for the -party<br />\nscent Tent:It 77-. l-lage - --. wn.<br />\nwas marked by a considerable de- -and. above<br />\nYo-u-nzer Set Acts As Spinner<br />\nof •<br />\n.financialll741<br />\n'<br />\nk.C126C<br />\n-i<br />\nt<br />\n'<br />\nGhert,a HOpk'I7,7, 11:1)=1.1.S..,apçsrcx7,-wa.5 regarded by<br />\nmatey twenty girls acted as sp,-..,-. The committee a hundred riff,- ,<br />\nv,: :he presence of over<br />\nsore for the concert, The pi.,<br />\n-.le aznong._-,whom were many promi- 4 i<br />\nt have the girls (fit:entitle tickets:<br />\nfaculty. How'<br />\n77,k H2fv-5-tcmii. ,7,-..._ \"1..t.t menabers of the<br />\n'atzi•.-e the y.. ever. in spite. of the splendid<br />\n. a- -r -E. ,---_ 1,-,, f,eci<br />\n:7<br />\nwas not sup--; ,<br />\nthat body., Jude:-.. ,endarice 7.77..e ilIntili013<br /><br />\nA<br /><br />\nSULSKY<br />\nFRANKLIN STREET<br /><br />\nBOOKS<br />\nBought—Sold—Exchanged<br />\nPIPPEN'S BOOK STORE<br />\n605 N. EUTAW STREET<br /><br />\nTwesty Debutantes Simper of the season kiss Friday night at<br />\n• ` the Lord Baltimore Hotel in the<br />\nthe Afair /<br />\n=of a curd parry. This was The<br />\nBANJO CLUB POPULAR<br />\nattempted<br />\naffair cf its kind o'er<br />\nHopkins Abanni and Friends by the<br />\ndeserve to be<br />\n,<br />\ntlte<br />\nand<br />\nclub<br />\nn<br />\nNninbe<br />\nAttend in Large<br /><br />\n1<br /><br />\n'<br />\nCOMPLETE<br /><br />\n-PHOIZ<br /><br />\n'VERNON 1212<br />\nPOR A<br />\nYELLOW CAB<br /><br />\nCon<br />\nYoe<br />\ntaloa<br />\n'<br />\nT• eenwasat<br />\nreoa.nst<br />\natubaot,<br />\n• earka;<br />\narias<br />\n•DC<br /><br />\nV<br />\nE<br />\nR FADTATIAHL<br />\nCo-<br /><br />\nI<br /><br />\n. ±<br /><br />\n6t.<br /><br />\natten44-ancr and er4.171:‘ 1-77 :'<br />\nworked perle--...\":<br />\nmclunem wra.she- rehire '=<br />\n1<br />\n•SERVICE• ,0<br />\na: the concer1<br />\n,<br />\n71<br />\nr 6.•<br />\n67number greatly increased duirir.::<br />\nce<br />\n\"<br />\nr<br />\nthe progress of the dance_<br />\nProeineers of \"The Nents-Lettri''<br />\nFrom the club ...,..tiber-ship Ce7tain indiriduals were selected : a:L G 13.AILFOUR CO<br />\nas escc • - :hese girls. tio4h a: flarcrcz, Prna<br />\ntran,-..-.:e• a- I a: the dance.<br />\n; 7.<br /><br />\nSIALktf,<br /><br />\n,X1<br /><br />\nas-N,<br /><br />\nEST. 1900<br />\n3044<br /><br />\nGREENMOUNT AVENUE<br />\nUniversity 3829<br /><br />\nPhotographic Supplies<br /><br />\nPiceure Framing<br /><br />\n:lergrad-<br /><br />\nIre<br />\nthe<br /><br />\nJetrelt\", Feron,<br /><br />\nhEpp:PHOTO SERVICV-3<br /><br />\nl:t<br /><br />\ni<br /><br />\nAnr7<br /><br />\nvas lace<br /><br />\nYou do $et Better Kodak Pictures<br />\nfrom<br /><br />\n•: 7<br /><br />\n.; 7.<br /><br />\n--<br /><br />\n-:.,:cqous by<br />\n:act is tie be<br />\n. ',vs a regrettable ,<br />\npoliteness i v the<br />\n::7<br />\n.'the intert•:at. Howere7<br /><br />\nHENNEGAN-BATES COMPANY<br />\nJewelers and &amp;Item-maks Since 181-7,<br />\n. DRESS'SETS<br />\nfor dinner and evening wear<br /><br />\n;- ±,e. faculty sufficientlyand broughti<br />\n'honor for this.1, I<br />\n:'a';'<br />\nsocial affair<br />\ntne<br /><br />\nBALTIMORE AT CHARLES STREET<br /><br />\nHOPKINS RINGS<br /><br />\nBanquet Opens Festivities<br />\nof :he organiza\"-esented<br />\nSoon after th6r arrival in Hathe school<br />\nwith<br />\nconnec:ed<br />\n::<br />\nevethe<br />\ngerstown ithe firs item of<br />\n;4-i well reprewas<br />\nfaculty.<br />\nthe<br />\nwhich<br />\nning's fest.ivitieS' was begun.<br />\nsented. Among the celebrities preswhich the members<br />\nTHE CHARLES E. MYERS CO. banquet. at<br />\nent were: Dr. arid Mrs. Latane. Mr.<br />\nthe club, the spousors and thar.,erIncorporated<br />\nCal<br />\nMansfamarer of<br />\n-one attended. prored a very nOve\"<br />\n'RUBBER STAMPS and colorful affair.<br />\nThe Sennce Shop<br />\nAfter this the busse_s4eft for :hIn sqie anis cpeci) \"Bostonainur<br />\n319 W. Redwood St<br />\ner:sneer', hall where, in a short -a,<br />\nequal the most expensive footwear<br />\nthe natives of Hagerstown<br />\n' produced today.<br />\nPhone 110---etecoall 790$<br />\ning intrpcluced to the abilities<br />\nAnd the awing is a big item.<br />\nANIS<br />\nE. E.<br />\nHopkins Glee Club which apBirely's (PharinacY3 Johns<br />\npeared fIrst on the<br />\nE.'-.RN CAFETERIA<br />\nST PAUL at 33rd STREET<br />\n'Mostly $7 to $10<br />\nConcert Gets Under Way<br />\nL--771.<br />\n•<br />\n7<br />\n7.<br />\n7<br />\nRer.:\".,-:<br />\nYour :';e:ghboritood Drag Store<br />\nE.t.clisatt;)<br />\nthe Glee Club was a- \"Old Man Noah.\" Kpr<br />\nPRESCRIPTIONS<br /><br />\nfl t9 Fuld:sty Bldg<br />\nCA- - -.. rf.<br /><br />\nFIDELITY AND DEPOSIT CO.1—<br />\nof<br /><br />\neJNien!<br /><br />\nBOSTONIAN<br />\nSHOE STORE<br />\n112 E. Baltimore Street<br />\n4.<br /><br />\nSdacol Supplies, Candy, Cigars<br />\nUnexcenect Fountain Service<br />\nMake Our Score Tour Store<br /><br />\nMaryland<br /><br />\nFidelity and Surety Bonds<br />\nBurglary and Plate Glass Insurance<br />\nBALTIMORE BRANCH OFFICE<br />\nGROUND FLOOR, FIDELITY BLDG.<br /><br />\nPhone Plaza 0800<br /><br />\nD. C. HANDY, Manager<br /><br />\n(7)4-fr. From<br />\n1.1,<br />\nA. M<br /><br />\nCollege Men's<br />\nLuncheon SO cents<br /><br />\nsional\" 'nn‘f\"Drak Drurr. 717-1<br /><br />\n:he<br />\nlady - received the plaa:<br />\ncrowd.<br />\nHone—HO. 20991.!<br />\nPhone, CAI t357<br />\nConrad Gebelein and his Batici - FRANCES T. BRANNON<br />\nClub came within the range of the Statcuaorto HARBAUGH fi BANNON<br />\n2 E LEXINGTON ST. Cot. Charles<br />\nASSOCIATION<br />\nspotlight and proceeded to thrill the<br />\nilk.c.on 26)<br />\n11211LBER$ FLORISTS TELBGRAPH,DELIVEP.T<br />\nselecpopular<br />\nvery<br />\ntheir<br />\nwith<br />\ncrowd<br />\n'Stenographic DI:tat:on, C..pying,<br />\ng, Mineographing<br />\nPOFt.<br />\non<br />\nMulgrahin<br />\nJ. A. RI 1-11,R &amp; SON<br />\n\"Washingt<br />\nThe<br />\ntions.<br />\nMaryland<br />\nFkrrists and Decorators<br />\nNui:\" bronchi. Ba:tamore<br />\nMare:MD.<br />\nE,<br />\nBALTIMOR<br />\n2PTH<br />\nNear<br />\n,<br />\nST<br />\n\".\"<br />\nCHARLES<br />\nISLIS N.<br />\ndown a -:<br />\nPhut, VErnon can<br />\nnuar 'bariLou:' i,lee.n.<br />\nusual exceltone, performe _<br />\nlent manner. ' S.unrise .and You.'<br />\nINTERIOR WOOD WORK * 4j. his encore nurriVer. -r L-\"ucec!..,,,,-,, ,.4„•<br />\nDECORATIONS<br />\nof approval from<br />\nthe crp-cisite sex.<br />\nSONS<br />\n&amp;<br />\nKNIPP<br />\nJOHN C.<br />\ndid some<br />\nOnce again the<br />\ngood work.. A group- of amusing.<br />\nFURNITURE<br />\n, pleasant numbers contributed great- ti<br />\nBALTIMORE, MD<br />\nly to the success of the program.<br />\nri •<br />\n..f.d<br />\nAn account of the concert wc,<br />\nShow Rooms<br />\n,<br />\n6:i,<br />\n343 N. Charlet Strut<br />\nnot be complete without mention c'<br />\nthe piano solo by Mr, John K.<br />\nMount, Jr., the speditable performance of the Hawaiian Troupe, and I<br />\n\" the popular selections, rendered by<br />\nMartin Elliott and his Blue Ja-.. r<br />\nchestra. They all played a<br />\nluecess of the concert.<br />\n,--are the , New, Spring Books!<br />\nDancing followed the concert and<br />\nbnght<br />\nin<br />\nbooks<br />\nd-new<br />\nthem—bran<br />\nof<br />\nYou'll find rows and rows<br />\non,<br />\nat one o'cisslir-A, M. the club memcovers—sinelling pungently of,printer's ink and crisp paper—ficu<br />\nstores<br />\nbers eithei- went back to their head;smug, biography, science—awaiting your choice at our two<br />\nwhich was the Hotel Hamquarters<br />\nCO.<br />\nGTON<br />\nTHE NORMAN,REMIN<br />\nindul#ted in various parties<br />\nor<br />\nilton,<br />\nn:<br />\nUp-Tow<br />\nDown-Town<br />\n1118 North Charles St.<br />\n‘.! held in their honor. Saturday<br />\nCharles St. at Mulberry<br />\nmorning the return trip to Baltimore<br />\nwas made—the club arriving shortly<br />\nAT<br />\nFRIENDS<br />\nYOUR<br />\nMEET<br />\nafter noon.'<br />\nThe program, in its,entirety, is<br /><br />\nA hi<br /><br />\nNEW CELESTIAL RESTAURANT<br />\nAmerican • Chinese<br />\n117-1l9-121 N. He-ward Street<br />\nPhone C,..h.fr: 6433<br />\nTheatre<br />\nParties<br /><br />\nMusic<br /><br />\n:•••<br /><br />\nstimulating-<br /><br />\ndelightful-<br /><br />\nROBIN\"<br />\n\"The(<br /><br />\nTht-HOTSY TOTSIE- NIGHT CLUB<br />\nDANCns1G — DINING — ENTERTAINMENT<br />\nChange of<br />\nProgram<br />\nWeekly<br /><br />\nVINCENT CARA<br />\nand<br /><br />\nHis RBCORD<br />\nVErnon<br /><br />\nBOYS<br /><br />\nFLOSSY MILLER<br /><br />\nMagsr<br /><br />\n844 N.Howard St.<br /><br />\nESSO<br /><br />\nTHE GIANT<br />\nPOWER FUEL<br /><br />\nNEW LIFE<br />\nFOR MOTOR<br /><br />\n-STANDAR D\" MOTOR OIL<br />\nThe Measure of Oil Value<br />\nSTANDARD<br /><br />\nOIL<br /><br />\nCOMPANY OF N.<br /><br />\nJ<br /><br />\ngiven below.<br />\nGLEE CLUB<br />\nDtVries<br />\n'University Ode<br />\nLuders<br />\nHeidelberg<br />\nDrakes Drum Coleridge-Taylor<br />\nBANJO CLUB<br />\ncous.sa<br />\nWashington Post March<br />\nPopular Selections<br />\nQUARTETTE<br />\nSelections arranged by Fishburn<br />\nDear Old Johnny Hopkins.<br />\narranged by Steinwald<br />\nHAWAIIAN TROUPE<br />\n. Herbert<br />\nj<br />\n'Gypsy Love Song<br />\n„ kohola March,<br />\narranged by C. Gebelein<br />\nGLEE CLUB ,<br />\nDeep River......Old Negro Melody<br />\nOld Man Noah—....Bartholomew<br />\nContinued on Page 3, Col 3<br /><br />\nRIT1RiNti<br />\nYID11 IILIF<br />\nWHOA •/<br />\nHOLD EVERYTHING.<br />\nHERE'S A LITTLE<br />\nEXTRA - CURRICULAR<br />\nDEMONSTRATION OF<br />\nA PAUSE THAT'S GOING TO NEED PLENTY<br />\nREFRESHMENT.<br />\nBut you don't have to<br />\nfall off a polo pony to demonstrate the pause that refreshes. Every day in the<br />\nyear 8 million people, at<br />\nwork and at play,find it<br />\nin an ice-cold Coca-Cola —<br />\nthe best served drink in<br />\nthe world—the pure drink<br />\nof natural flavors that<br />\nmakes a little minute long<br />\nenough for a big rest.<br />\nThe Coca-Cola Ca, Atlanta, Ca<br /><br />\nMIL▪ LION<br />\nA DAY<br /><br />\nYOU CAN'T BEAT THE<br />\nPAUSE THAT REFRESHES<br />\nIT<br /><br />\nH<br /><br />\nAD<br /><br />\nT<br /><br />\nBE<br /><br />\nGOOD<br /><br />\nTO<br /><br />\nGET<br /><br />\nWHERE<br /><br />\nIT<br /><br />\n13<br /><br />"}], "field_media_file": [{"target_id": 38400, "display": null, "description": null, "target_type": "file", "target_uuid": "eee052fa-2d67-4930-bea8-3666361e7075", "url": "http://digital.library.jhu.edu/system/files/2022-03/13367-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13367, "target_type": "node", "target_uuid": "86b334df-2d2f-495e-95ad-fee7bf6c4750", "url": "/node/13367"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "df2be482-db42-42d3-8d18-8a09023036b7"}]}