{"mid": [{"value": 40304}], "uuid": [{"value": "33b838d0-de43-4913-8c51-6cc71a23c83b"}], "vid": [{"value": 40304}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T20:02:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "14346-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T20:02:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T20:02:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "I.<br />\n<br />\nGENERAL ASSEMbly FOLLIES:<br />\n<br />\nPOT<br />\n<br />\nIN, Al.001101 ON ThE WAy<br />\n<br />\nBy ERIC GARLAND<br />\nThe Maryland General Assembly is headed this session<br />\n<br />\nfor !a possible trade-off of legal highs, considering<br />\nbills that would heave a direct impact on students' drug<br />\nuse. For the first time in a few years, the Assembly,or the<br />\nSenate, at least, appears ready to seriously consider<br />\nmarijuana decriminalization measures. At the same time,<br />\nstrong sentiment exists to prohibit that other staple -alcohol -- from legal consumption by eighteen to twenty<br />\nYear olds. Both issues tend to evoke very emotional<br />\nactions, from constituents and representatives alike, and<br />\nthus the final Assembly decisions on these matters are<br />\nrather unpredictable. The prevailing mood, though,<br />\nindicates that something will be done.<br />\nFor the drinking age, a number of different proposals<br />\nhave been put forth to change the present system. In<br />\n1974, the Assembly lowered the legal age for beer and<br />\n\\vine to 18, while hard liquor remained at 21. This<br />\nin consistency in types of alcohol allowed for<br />\nconsumption has prompted a number of delegates to push<br />\nfor a uniform drinking age.<br />\nBefore July 1, 1974, Hopkins had, of course, no<br />\nRathskellar. The campus did feature regular parties on the<br />\nWeekends, with a keg of beer usually in front of the<br />\nfreshmen dorms or in the Great Hall, available for<br />\neveryone's use. Fraternities also had their rush parties and<br />\nnormal beer bashes, and there was no great difficulty to<br />\nObtain beer or liquor through older students. Obviously a<br />\nrelaxed situation -- only when one went off-campus to a<br />\nbar or liquor store did the carding and subsequent refusal<br />\nor service occur.<br />\nThat scenario may soon reappear, if twenty-seven<br />\nsenators set the pace for their House colleagues. On<br />\nl'ebruary 15, the Senate passed a bill sponsored by<br />\nJerome Connell (D.31st Anne Arunder) that would<br />\ngradually raise the drinking age back to 21. The legal age<br />\nwould move up one year for three successive July 1st.<br />\nThis plan would create an interesting life for some<br />\neighteen year olds, who would drink for a few months out<br />\n0f the year and then would have to wait for their birthday<br />\nto come around again. Those unfortunate enough to have<br />\nbeen born on. June 30, 1959 would find themselves with<br />\nthree precious \"legal\" drinking days over the next three<br />\nYears.<br />\nDuring the Senate debate, the proponents of the<br />\nConnell bill pointed out that alcohol has filtered down to<br />\nteenagers in junior high and high schools, and the new<br />\ngrotici of drinkers has been responsible for a marked<br />\ni ncrease in traffic accidents. Opponents countered with<br />\nbasically<br />\nthe same arguments that lowered the drinking<br />\nage three years ago -- that 18 year olds deserve full adult<br />\nli,ghts. And Senator Clarence Mitchell termed the bill the<br />\n, wino's windfall,\" as those under 21 would turn to the<br />\n1°eal derelict for buying liquor.<br />\n<br />\nAs the Senate passed Connell's bill 27-17, the House<br />\nprepared for hearings on its own drinking-age legislation.<br />\nFour different bills introduced in the House variously<br />\nproposed to raise the age to 19, 20, and 21, with some of<br />\nthem establishing a standard age for all liquor. The House<br />\nJudiciary Committee will eventually settle on one of the<br />\nbills to send before the full House.<br />\nAt Hopkins, administrators are watching the progress<br />\nof the bills with obvious concern. Unlike the old \"21\"<br />\ndays, the University has an expensive, licensed<br />\nestablishment -- the Rathskellar -- on campus that would<br />\nhave to be radically changed with the adoption of any<br />\ndrinking-age bill.<br />\nIf a bill does pass the Assembly (and Mandel had<br />\npromised to sign any reform of the drinking age), the<br />\nRathskellar faces a couple unpleasant alternatives: no beer<br />\nor (if the age reverts to 21) no students. Both situations<br />\nspell financial trouble- whether a large, deserted bar or a<br />\nsoda parlor without the huge volume of beer sales. As<br />\nBettye Miller, Business Manager of the Dean of Students<br />\nOffice said about a 21-age bill passing, \"the Rathskellar<br />\nwould have to be something else. There are people who<br />\nget together without drinking beer -- we could still have<br />\nthe music and other things. How popular it would be<br />\nwithout beer is up to the students. If they don't patronize<br />\nit, we'll have to think of something to do to bring them<br />\nback again.\"<br />\n<br />\nRAThSkEtEAR FACES<br />\nA COUptE Of UNpLEASAINT<br />\nALTERNATIVES: NO bEER<br />\nOR NO STUdENTS•P<br />\nIf the age doesn't go all the way to 21, that still leaves<br />\nthe Rathskellar with the problem of figuring out who to<br />\nlet in, what to serve them, and under what conditions. At<br />\npresent, the University's lobbyist in Annapolis, Ellergy<br />\nWoodworth, is working with a few students to monitor<br />\nthe legislators' plans for the drinking age bills. Once they<br />\nget a clear idea of the eventual, shape the bill will take -and whether that bill would pass -- they can start to really<br />\nworry about what to do with the Rathskellar.<br />\nMeanwhile, the Senate Judicial Proceedings Committee<br />\nheard testimony yesterday concerning Senate Bill 1054.<br />\nIntroduced by Mitchell, S.B. 1054 proposes to reduce the<br />\npeitalties for simple possession of up to one ounce of<br />\nmarijuana to a maximum fine of $100. Similar<br />\ndecriminalization measures have failed in the past to get<br />\n<br />\n...while hits off mistah b's cousin become decriminalized<br />\n<br />\nbaroara sacox<br />\n<br />\nOUT FOR 1977 dRuggiEs.<br />\n<br />\nea s<br />\n<br />\nyear. ORML (National<br />\nt:<br />\nout of commitBteaer:flothis<br />\nOrganization for the Reform of Marijuana Laws)<br />\nspokesman Lou Curran expects \"a 5-3, maybe even a 6-2<br />\nfavorable report. We received a much warmer reception<br />\ntoday (Thursday) than ever before.\"<br />\nCurrent Maryland laws classify marijuana possession as<br />\na criminal misdemeanor, punishable by up to a year in jail<br />\nand a maximum $1000 fine. Mitchell's bill, partially<br />\nirafted by Maryland NORML and modeled on successful<br />\niminalization laws of other states, would create a<br />\nLion system similar to traffic tickets. A police officer<br />\nesting someone for simple possession would issue a<br />\ncitation to appear in court. The offender would then<br />\neither obey the summons or forfeit collateral (money) -$25 has been the usual amount in decriminalized states-in lieu of court appearance. There would be no actual<br />\n\"arrest,\" and no criminal record for the person cited.<br />\n\"This state spends an estimated six to nine million<br />\ndollars to arrest 6000 marijuana lawbreakers each year,<br />\n93% of whom possess only a small amount for personal<br />\nuse,\" Curran said. States that have decriminalized<br />\nd marijuana show no more increase in usage than<br />\nMaryland, and the courts and police have been freed from<br />\nthe thousands of marijuana arrest cases.<br />\nOnce the Senate Committee votes favorably on the bill<br />\n(around March 11), it will go to the Senate floor for<br />\ndebate and voting. At present, Curran counts about<br />\ntwelve votes committed for the measure and four against<br />\nit: of the 31 other senators, \"most are in favor but<br />\nunsure how to vote since they're unsure about the<br />\npublic's feelings.\" Curran hopes that a flurry of letters to<br />\nlegislators will bring out those privately in favor of<br />\ndecriminalization.<br />\n\"Our main goal is to get as many Senate votes as<br />\npossible,\" he commented. If the bill passes the Senate by<br />\na healthy, margin, it could induce the conservative House<br />\nJudiciary Committee to give serious consideration to the<br />\nproposal. Last year, the committee killed a House<br />\ndecriminalization bill 17-3; Curran expects the same<br />\nreaction (with bills piling up, the committee might not<br />\neven schedule a hearing) this time unless the Senate<br />\ncreates some pressure.<br />\nMandel's desire to raise the drinking age brings with it a<br />\nconcomitant opposition to decriminalization. If S.B. 1054<br />\ndoes roll through the Senate and somehow gets out and<br />\npassed on the House floor, it would still languish on the<br />\nGovernor's desk. Passage by the Senate, though., would<br />\nset up a very promising effort for next year, an election<br />\nyear, both in the House and the Governor's mansion.<br />\nThis year's edition of the General Assembly, then, will<br />\nprobably drink their rounds at the top of the Hilton,<br />\nwearied by the last-minute rush of bills, and perhaps<br />\nwondering at their feat of taking a legal beer can out of<br />\nsomeone's hand, while slipping a decriminalized joint iu<br />\nits place.<br />\n<br />\n\fpage 2/news-letter/march 4, 1977<br />\n<br />\nAuthor Alex Haley speaks at UMBC<br />\nThe Roots industry prospers<br />\nBy MIKE GIULIANO<br />\nAlex Haley, author of The Autobiography of Malcom<br />\nX and Roots, spoke on February 28 before a<br />\nUniversity of Maryland Baltimore County crowd<br />\nestimated at 5,000. Baltimore County Executive Ted<br />\nVenetoulis, never one to avoid public exposure, spoke<br />\nbefore Mr. Haley and declared the day \"Alex Haley Day<br />\nin Baltimore County.\" Venetoulis cited the search for his<br />\nown ethnic roots and the cooperation between Baltimore<br />\nCounty and Baltimore City as the reasons for his<br />\nappearance. The crowd was amused, guffawed a bit. If Mr.<br />\nVenetoulis doesn't win the governorship it won't be<br />\nbecause he hasn't conducted one of the more intense and<br />\nobvious campaigns in Maryland history.<br />\nHaley was struck by the size and warmth of his<br />\naudience. \"It seems unbelievable when one has spent<br />\naround twelve year5 lin hibernation writing a book to see<br />\nso many people turn out. You have to be moved with this<br />\nkind of audience...(The writing of Roots) transcends what<br />\nan individual could do. I feel myself to have been a •<br />\nconduit through which something has come... My<br />\ngrandmother would say, 'The Lord might not come when<br />\nyou expect him to, but he will always be on time,' and<br />\nthat is how I feel about the book.<br />\n\"It began when I was a little i boy\" in Henning, a little<br />\ntown about fifty miles north of Memphis. My<br />\ngrandmother would invite various women members of the<br />\nfamily to come and spend the summer.\" Each evening,<br />\nthese old ladies would sort of filter out onto the porch,<br />\nwhere they would sit in rocking. chairs, talking about<br />\npeople, places, and events, most of which Haley did not<br />\nunderstand. \"I didn't know what a Massa or a plantation<br />\nwas. My first impression was that what they talked about<br />\nwent way back.\" The idea that these women, old and<br />\ngray, were once as young as the boy, \"would blow my<br />\nmind.<br />\n\"The oldest one they talked about was the African,<br />\nbrought to America, to a Virginia plantation...The fourth<br />\ntime he escaped he was caught by professional slave<br />\ncatchers. When these two men cornered the man. they<br />\nwere able to overcome him and bring him back. He was<br />\ngiven a choice of punishment, either being castrated or<br />\nhaving a foot cut off.\" He chose the latter.<br />\nThere was hardly any family continuity among the<br />\nslaves on this and similar plantations, because adult slaves<br />\nwere frequently sold off, their own children did not know<br />\nthem, and slaves as a group had little sense of a heritage.<br />\nThe African was an exception. He was assigned to work in<br />\nthe vegetable garden, hobbled about as best he could,<br />\nfathered a child. The African would point out natural<br />\nobjects- to his child, teach her the names for them in his<br />\nnative tongue. Like most Africans, he was given an<br />\nAnglicized name - Toby. His identity was taken away, but<br />\nhe rebuffed the name, called himself Kunta Kinte.<br />\n\"Every single one of those Africans was from some<br />\nplace where they had spoken a native tongue. They all<br />\nlearned to speak this strange new tongue in idiom, or<br />\ndialect...Kinte began to tell his daughter anecdotes about<br />\nhimself, a sense of his past, how he had been captured<br />\nwhile chopping wood to make a drum.\"<br />\nThe audience, though most of them had already read<br />\nthe book or watched the television series, remained silent<br />\nand attentive as Haley narrated the history of his family<br />\nfrom Kunta Kinte down to his maternal grandmother,<br />\nwho \"pumped that story into me as if it were plasma.\"<br />\nBy his midteens, Haley's father had received a graduate<br />\ndegree and was teaching in Southern colleges. \"When the<br />\n<br />\nComic of the Week<br />\n<br />\nL.oLF \"c041E<br />\n<br />\nU THE-<br />\n<br />\nSecond World War ,came I thought that by joining the<br />\nCoast Guard I could walk the coast, but I found myself<br />\non an ammunition ship in the South Pacific, which is not<br />\nwhat I expected.\" Experiences on the ship led to the<br />\nwriting<br />\nof Roots. \"Our biggest problem was not the<br />\nenemy, but boredom...I'd get my portable typewriter and<br />\nwrite letters to anybody. Mail call came to be an epical<br />\nevent for me. I'd get thirty or forty letters every mail<br />\ncall...Being at sea as long as we were and as far away from<br />\nhome as we were, when we'd finally get onshore in<br />\nAustralia -- I don't have to tell you what our foremost<br />\npriority would be ... Back at sea some of my buddies on<br />\nthe ship asked me if I would help them write letters to<br />\ntheir sweethearts (in Australia.) They were not<br />\nparticularly hot on paper. I'd sit with a deck of 3X5<br />\ncards, and as they came up one by one I'd interview them<br />\nabout the girls. If he said the girl's hair was blond, I'd<br />\nwrite: 'Your hair is like the moonlight rippling on the<br />\nwaves.'<br />\nHis clients would later describe, in quiet graphic detail,<br />\nhow well his letters had worked. \"I became heroic that<br />\nnight on that ship. And I tell you, for the rest of the war I<br />\ndidn't fight a soul. I just wrote love letters.\"<br />\nWhile at sea, Haley read magazines, decided to write<br />\nand submit adventure stories. As for the period of<br />\napprenticeship, he doesn't believe in any sort of<br />\n\"mysterious talent... Anyone who desires to achieve<br />\nsuccess in the creative arts must develop self-discipline. I<br />\nknow for myself, once I began I wrote every day, three<br />\nhours a day, for eight years, before I sold an article.\"<br />\nAfter twenty years service in the Coast Guard, Haley<br />\nretired at the age of 37, sought a career as a free-lance<br />\nwriter, lived in a Greenwich Village basment, and finally<br />\ndid sell articles -- to Reader's Digest.Playboy interviews<br />\nsoon followed.<br />\n\"Doing a Miles Davis story (for Playboy), I discovered<br />\nthat Miles didn't like writers and didn't talk much ... Miles<br />\nwas a good cook, especially chile. One night I got a call,<br />\nheard a voice say, 'Chile,' and hang up, which translated<br />\nmeans,'Come on over, Miles has made chile.'\"<br />\nTwo years were spent working with Malcolm X, the<br />\n.-n-st year in interviewing him, and the second in breaking<br />\nthe discussions up into chapter areas, \"writing vicariously,<br />\nas if I were he, telling his life.\" Sitting in a New York City<br />\nhotel room, Malcolm X, flashing his ball-point pen,<br />\nproofread the book, said: \"Brother, I don't think I'm<br />\ngoing to live to read this again,\" borrowed the book,<br />\nspent three days reading it in a hotel room, and two<br />\nweeks later was shot dead. Immediately after his death,<br />\nHaley wrote the Epilogue in a one week session at the<br />\ntypewriter. The 1965 book sold six million copies and<br />\nwas subsequently translated into seven languages.<br />\n<br />\nTom Murray and Irene, as well as the names of four older<br />\nchildren. He was filled with the \"growing sense that I'd<br />\nheard this before. When I saw the name 'Elizabeth, A,g,e,<br />\n6,' I realized 'That's Aunt Liz, whose knee I sat on.<br />\nAunt Liz was in the same building with the Bill of Rights<br />\nand the Constitution.<br />\nThe old one who was still living was cousin Georgia,<br />\nwhose mouth would run like wildfire when talking about<br />\nthe family. \"I had this great compulsion to see her. After<br />\nall the 'Boy, you done growed up's, she told me about<br />\nKinte in her own individualistic way.\" She spoke of these<br />\nothers who had been on that front porch, not as if they<br />\nwere dead, but as if they had gone behind a curtain or<br />\nsomething.<br />\nBack in New York, he attempted to discover what<br />\nAfrican tongue these words of Kinte's belonged to. Going,<br />\nto the United Nations' lobby at quitting time, he stopPea.<br />\ndozens of African delegates and spoke the words to the°.<br />\n\"me trying to tell them some alleged African sounds ifla<br />\nTennessee accent.\" A scholar finally did identify it as 3<br />\nlanguage spoken near the Gambia River.<br />\n\"I had to get to that place. I didn't know anything,<br />\nreally, about Africans.\" Once there, he encountered the<br />\ngriots, very old men,.living archives, who kept farnilY<br />\nhistories in their heads, and could talk for two daYs<br />\nwithout repeating themselves. Westerners, with the crutch<br />\nof print, have forgotten what the human memory is<br />\ncapable of. A three day mini-safari took him to the griot<br />\nthe memory -- of his people. When he got in the village et<br />\nsome seventy adults, he immediately recognized the gricit'<br />\nwho had \"the aura of somebodyness about him.\" 1.11\",<br />\npeople stared at him, this brown man in a soot blac'<br />\ncrowd. Haley then realized: \"They had never seen a black<br />\nOther assignments followed, one of which took him to<br />\nAmerican.\" When the griot spoke to him, he resolved:,<br />\nWashington, where \"I found myself near the National<br />\n\"I'm going to see these words put into permanent form<br />\nArchives. I'd never been in it.\" He examined the census<br />\nThe griot spoke of America: \"Yes, we have been told thadt<br />\nrecords for 1870, the first time blacks were listed by<br />\nthere are many of us who are in exile in that place calle<br />\nname, and on the microfilm reel he read line after line<br />\nAmerica.\"<br />\nafter line of the names of people long gone. \"As I turned<br />\nHaley regretted only that other black Americans could,<br />\nthe handle fast they seemed to sprint along: when I<br />\nnot share his experience. \"If any black person only collie<br />\ncame<br />\nturned it slower they moved with dignity. How easily I<br />\nknow what were the real African names, where he<br />\nmight have walked out and forgotten it.\" But he<br />\nfrom and when ... a griot who could tell him from whence<br />\nhappened to walk out through a genealogy reading room,<br />\nhe sprang ... I was just openmouthed ... 200 years ar<br />\nnoticed people bent raptly over tables, reading sometimes<br />\nwho married whom, all the way across the line ... I was<br />\nwith magnifying glasses, and a thought came into his' struck by the Biblical way<br />\nthey expressed it: begat<br />\nhead: \"These people are trying to find out who they are.\"<br />\nbegat ... begat ... In the Year of the Water Buffalo...\"<br />\nHaley returned to the Microfilm Room, saw the names<br />\nAs his family history was told, a circle formed arouhu<br />\nhim, women thrust infants at him in one of the oldest<br />\nhuman ceremonies, the laying on of hands. The men took<br />\nthis Methodist to their mosque and prayed: \"Praise be<br />\nAllah for the one lost from us whom God has returned.'<br />\nVillagers mobbed the expedition, and Haley thought:<br />\n\"What a huge caprice it was. The reason they're down<br />\n11;<br />\n... I REMEMBER.<br />\nthere and I'm up here is which of our forefathers .was<br />\nI OLD DAY6<br />\nsnatched<br />\n... They were collectively crying out 'Mister<br />\n5EE1 IT<br />\nKinte,<br />\nMister<br />\nKinte.'\"<br />\nCRY AND SCREAM AgD<br />\n•<br />\nDROVE HER<br />\nWhen he returned to America, Haley went to his<br />\nRAIL ARMO—<br />\nWILD!<br />\n4<br />\npublisher, told him he had to write a book about his .<br />\nevEN FAINTfamily, but in a broader sense about his people, because<br />\n\"every black American goes back to that.\" After nine<br />\nyears of research and three years of writing, the bool<br />\nappeared last August, has sold around 1,500,000 copies ih<br />\nhardback, and was serialized by ABC. Haley is currentlY<br />\nworking on two books: Search, and Henning(named after<br />\nthe Tennessee town of his youth.) A record album,<br />\nrecounting the Roots project, should appear in a month<br />\nor so. The Roots'industry prospers.<br />\n<br />\n\fmarch 4, 1977/news-letter/page 3<br />\n<br />\nMatters of State<br />\n<br />\nJust what does Hopkins want to do with Chile?<br />\n<br />\nRather than providing the necessities, such as adequate<br />\nbelieved. This<br />\nUniversity's decision as had been earlier<br />\ncare, nutrition, and employment opportunities,<br />\nhealth<br />\npoints.<br />\nng<br />\nturn onevents raises a number of interesti<br />\nthat would allow poor families to escape their dilemma,<br />\nRegardless of University statements, it would be<br />\nbirth control programs are implemented. The government<br />\nwrong to totally dismiss the protest actions as a force<br />\nthereby solves the problem by eliminating it. THis<br />\ninfluencing the decision to decline. Although no one can<br />\nis typical of the Chilean junta's approach to<br />\nattitude<br />\nthe<br />\nbe precisely sure of their effect, one has to realize that<br />\nhealth policy. One particularly regressive policy was the<br />\nUniversity would naturally attempt to play down their<br />\njunta's move to reduce government spending by excluding<br />\nimportance in order to maintain the fullest possible<br />\nfrom the list of those eligible for free medical care some<br />\ncontrol over such decisions in the future.<br />\nof the very people who most need it - the unemployed.<br />\nbehind<br />\non<br />\nPerhaps more important is the basic assumpti<br />\nThe junta's health policies have not escaped international<br />\nhave<br />\nwould<br />\nvisits<br />\nthe<br />\nthe statments by Mrs. Norris- that<br />\nattention. Both the American Public Health Association<br />\nindeed taken place if only the scheduling could have been<br />\nand the National Association of Social Workers have<br />\narranged. Political or moral considerations about assisting<br />\ned them.<br />\ncondemn<br />\nits<br />\nfor<br />\nonally<br />\ninternati<br />\na regime which is recognized<br />\nwere<br />\nrights<br />\nhuman<br />\nof<br />\ndisregard<br />\nrepression and flagrant<br />\nmatter of mere<br />\nabsent from the decision. It was a<br />\ng that the<br />\nsurprisin<br />\nlogistics. In view of that fact, it is not<br />\nnot visit<br />\nwill<br />\nChileans,<br />\nUniversity has no assurance that the<br />\nNorris.<br />\nMrs.<br />\nto<br />\ng<br />\nAccordin<br />\nJohn Hopkins in the future.<br />\nby<br />\nmade<br />\nbe<br />\nto<br />\nhave<br />\nwould<br />\ndecision<br />\nsuch a policy<br />\nMuller.<br />\nPresident<br />\nd<br />\nThe Medical Institutions, as one of the most renowne<br />\nadvice<br />\nfor<br />\nsought<br />\noften<br />\nare<br />\nworld,<br />\nmedical centers in the<br />\nMrs. Norris<br />\nby representatives of foreign governments.<br />\nState<br />\nsaid that her office receives \"requests from the<br />\narrange<br />\nto<br />\nus<br />\ng<br />\nDepartment almost every week, requestin<br />\nvisits for representatives of various governments. We also<br />\nreceive requests from groups like the International<br />\nVisitors Service.\" But Hopkins does not make a practice<br />\nof communicating directly with the interested foreign<br />\ngovernments. In fact, Mrs. Norris stressed that,\"We never<br />\nhad any direct contact with the two Chilean doctors or<br />\nwith the Chilean government.\"<br />\nThis Hopkins policy looks innocent enough on the<br />\nsurface, but it contains some disturbing implications. For<br />\nexample, if such requests are received almost every week,<br />\nwhat other kinds of governments have been aided bu the<br />\nJHMI? There is, of course, nothing at all wrong in theory<br />\nwith the University extending its service to other people.<br />\nThat is one of the main functions of a university. But<br />\nsuch assistance must be viewed within the existing social<br />\nrealities. Helping a repressive government such as Chile is<br />\ncertainly quite different than hosting a medical team from<br />\nScandinavia.<br />\nA second cause of concern is the University.s<br />\nrelationship • with the State Department. Mrs. Norris<br />\nthe<br />\nclaimed that there was never any direct contact with<br />\nthe<br />\nwith<br />\nworked<br />\nusually<br />\ny<br />\nChileans, and that. the Universit<br />\nState Department, rather than individual governments, in<br />\nsetting up foregn visitors. But what are the criteria, if any,<br />\nnt. If, as<br />\nfor accepting a request from the State Departme<br />\nby<br />\nrequest<br />\nany<br />\naccepts<br />\nmerely<br />\nit sounds, the University<br />\nnts<br />\ngovernme<br />\nother<br />\nwith<br />\ndeal<br />\nusually<br />\nnot<br />\nState, and does<br />\non an indivual basis, it stands to reason that the<br />\n'University will have relations only with countries that are<br />\nin the good graces of the United States government. This<br />\ntype of complicity produces situations such as the request<br />\nthat the University hosts and advise two representatives of<br />\none of the most repressive regimes in the world-Chile.<br />\nAlthough official explanations for such assistance will<br />\nAs was argued in last week's article, the University can<br />\nassert that any \"technical\" advise given by the university<br />\ndismal record on human<br />\ndoes not connote endorsement of the country's ruling hardly be unaware of Chile's<br />\ndoes it involve itself<br />\nthen,<br />\nWhy,<br />\njustice.<br />\nsocial<br />\ngovernment, the neutrality argument simply does not rights and<br />\nbe speculated that<br />\nleast<br />\nat<br />\nmay<br />\nIt<br />\nregime?<br />\na<br />\nsuch<br />\nwith<br />\nhold. Even if the university is not conscious of any bias<br />\na part in such<br />\nplay<br />\nand prestige<br />\non is part, its actions can be very political. Had the considerations of money<br />\ncan be very<br />\non<br />\nconnecti<br />\nnt<br />\nUniversity decided to aid the Chilean regime(as it still decisions. A State Departme<br />\nlookout for<br />\nthe<br />\non<br />\nalways<br />\nis<br />\nthat<br />\ny<br />\nuniversit<br />\nmight), it would have deliberately discriminated against helpful to a<br />\nntly, the<br />\nConseque<br />\nfunds.<br />\nresearch<br />\nof<br />\nsources<br />\nnew<br />\nthe workers and poor.That is clearly political.<br />\nrequests.<br />\nent<br />\nDepartm<br />\nState<br />\ntoward<br />\nattitude<br />\ny's<br />\nUniversit<br />\nHopkins' past involvement with the Chileans has also<br />\nbe for<br />\nwould<br />\nproblems<br />\nOne possible solution to such<br />\nhad political overtones. In a 1974 grant proposal to the<br />\nforeign<br />\nwith<br />\nties<br />\nits<br />\nof<br />\nall<br />\npublic<br />\nto make<br />\nAgency for International Development (AID), the Medical Johns Hopkins<br />\na move would allow the university<br />\nSuch<br />\nnts.<br />\ngovernme<br />\niary<br />\nas<br />\n\"an<br />\nintermed<br />\nto<br />\nserve<br />\nproposed<br />\nons<br />\nInstituti<br />\ne and criticize Hopkins policies.<br />\nscrutiniz<br />\nto<br />\nty<br />\ncommuni<br />\norganization to further aid objectives by providing\"<br />\nfurther, a committee could be<br />\nstep<br />\na<br />\nidea<br />\nthis<br />\nCarrying<br />\nis<br />\n,<br />\nmedical links \"minimizing government visibility which<br />\nwould not only make public such ties by<br />\nneeded to involve the elite establishment leadership and formed which<br />\nwould also try to determine whether<br />\nto advance the application of fertility management....\" As Hopkins, but<br />\nbe involved at all with certain countries<br />\nshould<br />\nHopkins<br />\nis often the case with such programs in poor countries,<br />\nions.<br />\norganizat<br />\nonal<br />\ninternati<br />\nor<br />\nthe \"target population\" includes the poor and working<br />\nThere is some confusion about the reasons for the<br />\nand the current confusion<br />\nfiasco<br />\nIranian<br />\nyear's<br />\nLast<br />\nby<br />\nwho<br />\nmust<br />\nones<br />\nlimit<br />\ntheir<br />\nfamilies,<br />\nthe<br />\nare<br />\nThey<br />\nUniversity's decision not to host the Chileans. Dr. Ross, classes.<br />\njunta cast doubt on<br />\nthe<br />\nChilean<br />\nwith<br />\nent<br />\nparticipating in programs of fertility management or about involvem<br />\nwho issued the statement to the -protesting groups, has<br />\nshould continue to<br />\nation<br />\ny<br />\nadminist<br />\nUniversit<br />\nthe<br />\nwhether<br />\ninvoluntary sterilization. This is a perfect case of blaming<br />\nnot yet offered any official explanation and since last<br />\nclosed<br />\ndoors. University<br />\nbehind<br />\ndecisions<br />\nsuch<br />\nmake<br />\nare<br />\nrates<br />\nthe victim for the problem. Increased birth<br />\nThursday has remained unavailable for comment. Mrs.<br />\nnts<br />\nnot only casts<br />\ne<br />\ngovernme<br />\nrepressiv<br />\nwith<br />\nent<br />\ninvolvem<br />\nan<br />\nc<br />\nof<br />\nshed<br />\nsocial<br />\nand<br />\neconomi<br />\nfunction<br />\nimpoveri<br />\nlargely a<br />\nNorris, who stated that she made the decision to decline<br />\n, but, more<br />\nty's<br />\nintegrity<br />\nthe<br />\nUniversi<br />\non<br />\ncondition. Among Third World poor populations, infant doubt<br />\nthe State Department's ,request, said that the visit was<br />\nin<br />\ntheir<br />\nnts<br />\nefforts to<br />\naid<br />\nsuch<br />\ngovernme<br />\ncan<br />\ntly,<br />\nimportan<br />\nmortality tends to be high, since there is often a lack of<br />\ncancelled due to scheduling problems. When asked<br />\ncan<br />\nAnd<br />\nthat<br />\nhardly be<br />\ntheir<br />\npeople.<br />\nbrutalize<br />\nand<br />\nexploit<br />\nso<br />\ncare<br />\nfor<br />\nhealth<br />\nthe infant. Because<br />\nproper diet and<br />\nwhether the protests against the visits had influenced the<br />\ny.<br />\nany<br />\nof<br />\nthe<br />\nuniversit<br />\npurpose<br />\ned<br />\nconsider<br />\na<br />\nten<br />\nfor<br />\nso<br />\nyoung,<br />\nplan<br />\ndie<br />\nmay<br />\nfamily<br />\nchildren<br />\nmany<br />\noutcome, she replied, \"I was not aware of any protests<br />\n(Note: There will be a meeting on Monday, March 7, at<br />\non the hope that six of them will grow up so that<br />\nchildren<br />\nsituation<br />\nthe<br />\nwhat<br />\nasking<br />\nme<br />\ncalled<br />\nuntil Dr. Ross' office<br />\npm in Room 2008 of the JHU School ofHygiene to<br />\n5:00<br />\nthey can help earn money for the family. Children also<br />\nwas concerning the visit. Besides, we had by that time<br />\nthe current situation in Chile and the nature of the<br />\ndiscuss<br />\nparents<br />\nserve as the only source of social security for their<br />\nalready determined that no visit was possible.\" It seems,<br />\n•<br />\ny's involvement with the junta.)<br />\nUniversit<br />\nwork.<br />\nto<br />\nold<br />\nwhen they grow too<br />\nthen, that the protests did not have as much effect on the<br />\n<br />\nBy MARK HERTSGAARD<br />\nedical Institutions' administration<br />\nHopkinsM<br />\nThe Johns<br />\nweek that, due to scheduling<br />\ndecided last<br />\nproblems, it would have to decline a State Department<br />\nrequest to host two representatives of the Chilean<br />\ngovernment. Mrs. J.B. Norris, Director of Public Affairs<br />\nfor the Medical Institution, corrected a previous report by<br />\nstating on Wednesday that, \"We did not issue any<br />\ninvitation. The State Department contacted us and<br />\nrequested us to set up a tour for two doctors from the<br />\nChilean government. After we received the request from<br />\nthe State Department, some preliminary inquiries were<br />\nmade (around the University), but no schedule could be<br />\narranged. We then notified the State Department that we<br />\nwould have to decline its request.\"<br />\n_ It was reported last week that the University had<br />\n• originally agreed to host Dr. Sergio Reyes and Christian<br />\nDonoso, two high-level officials of the military<br />\ndictatorship which rules Chile '• This visit was to have<br />\ntaken place sometime in earch March, but, as they<br />\nreported, the University later rescinded its offer. There<br />\nhave been a number of individuals and groups, including<br />\nthe Medical Committee on Human Rights (MCHR) and<br />\nthe Baltimore-Chile Solidarity Group, which had<br />\nprotested the scheduled visits. Word came last Thursday<br />\nthat Dr. Richard Ross, University Vice-President for the<br />\nHealth Divisions, gave the protesters a verbal guarantee<br />\nthat the visits would not occur. This was reinforced on<br />\nlast Friday with a short written memo addressed to the<br />\ngroups. The protesters were not entirely satisfied, since<br />\nthe memo included neither an explanation for the action<br />\nnor any mention about possible future involvement with<br />\nthe Chilean junta.<br />\n<br />\n\fen<br />\n<br />\nAre<br />\nTin<br />\nMe<br />\n<br />\nphotos by bruce iaffe<br />\n<br />\nIt's all right at the Left Bank,in fact it's a<br />\n<br />\nFrom the outside it doesn't look like<br />\nmuch, certainly not famous. A rather<br />\naged looking margue and well-worn set of<br />\ncloors are all that is visible from the<br />\nstreet, and the imposing set of stairs<br />\nwhich the doors reveal do little to<br />\nimprove the atmosphere. The Famous .<br />\nBallroom must have. Seen better days,<br />\nalthough one is inclined to think that it<br />\nhas always been that way.<br />\n.• •<br />\nNo matter; very few patrons cOme for<br />\nthe architecture. What they come for is<br />\njazz, and that's what they get. There<br />\naren't many places around where you can<br />\nsee a name group .for a mere $5.50 cover<br />\ncharge, with rio hassles, noisy bars, or<br />\nundesired' minimums. You just ,pay your<br />\nmoney, and find, someplace ,to sit down,.<br />\nIf you get there early enoagh, you may<br />\nclaim front row seats and be literally<br />\nwithin spitting distance of the band<br />\nstand. But as anyone-who has ever sat ten<br />\nfeet from the front of Stan Kenton's<br />\nband can tell you, sometimes it's better<br />\nto sit off to the side.<br />\nThis is Baltimore's Left Bank Jazz<br />\nSociety. The Left Bank is not a chit); it<br />\nholds concerts Sunday . afternoons .from<br />\n5:00 to 9:00. and its Charles St. location<br />\n(two doors up from the famed<br />\nChesapeake restaurant, and a block north<br />\nof Penn Station) should assuage the<br />\nparanoid fears of those who see muggers<br />\naround every corner. As for the club's<br />\nclientele, one novice last week remarked<br />\nthat. he was uneasy about going down<br />\nthere until his girl (a regular) chided him.<br />\nsaying he was just \"being a bigot.\" To be<br />\nhonest. this reporter has always felt safer<br />\nin the hallowed halls of the Famous<br />\nBallroom than he has ever felt in the<br />\nLyric. The Left Bank crowd may not<br />\nmake as much as the Symphony<br />\nsubscribers. but they, are more likely to<br />\ntalk to you.<br />\nCame in t his past Sunday to the<br />\nrecorded tenor of Sonny Stitt. Wound up<br />\nsitting with a friend and fellow bassist<br />\nfrom Towson State. there to Marvel over<br />\n<br />\nthe fabulous fingers of the New York<br />\nJazz<br />\nQuartet's George Mraz. Was introduced to<br />\n\"the number two bassist at Towson,\" and<br />\ntalked while the fabled Mraz did his<br />\nsound check.<br />\n-<br />\n<br />\nS?95?<br />\n(cc4gas<br />\nAs the lights dimmed across th(<br />\npainted-star sky, we turned our attention<br />\nto the bandstand. Vernon Welsh, Left<br />\nBank's perennial MC, took the mike and<br />\nwelcomed everyone, reminding them of<br />\nthe upcoming concerts, of Sonny Stitt on<br />\nMarch 6, apologizing that Stan Getz had<br />\ncancelled because of a cOncert or<br />\nsomething in New York. With his notes<br />\ntrembling in his hand, you think: Poor<br />\nVernon! God only knows how he does it<br />\neach week, seemingly stricken with a<br />\n<br />\nSometimes Herbert sounds more like<br />\nGene Ammons than Ammons himself did;<br />\nother times he wields a harmonic sense as<br />\nsharp as Coltrane or George Coleman of<br />\nthe old Miles Davis band.<br />\nThe crowd is obviously pleased. This is<br />\ngood time music, attended to by<br />\ncountless tapping feet and punctuated by<br />\nshouts of \"play it!\" and \"right on!\"<br />\nRoland Hanna announces another tune<br />\nassociated with the old Miles band, All<br />\nBlues. George Mraz starts the lazy<br />\nostinato bassline, with Hanna's trilling,<br />\nchords following, carpetting the entrance<br />\nof Herbert's floating tenor lead. Ritchie<br />\nPratt kicks. things along on the drums,<br />\nbuilding the fire under Hanna's<br />\nshimmering piano until it erupts into the<br />\nmeanest three-four boogie-woogie .you<br />\never heard.<br />\n<br />\n77_1=<br />\n<br />\n'watt<br />\n<br />\ncontinuous case of stage fright. But What<br />\nwould Left Bank be withoutVernon?<br />\nWhen the band has mounted the stage,<br />\nRoland Hanna breaks into a familiar<br />\nintroduction, and Gregory Herbert's<br />\ntenor joins the piano in a swinging romp<br />\nthrough Welkin'. Greg Herbert struts and<br />\nstomps, careening around runs and into<br />\nbent-note exclamations, like shouts of<br />\n\"Amen!\" at a Baptist revival meeting.<br />\n<br />\nAt intermission, Charles McPhearsoti<br />\nLive in Japan as the patrons walk around,<br />\ngetting another beer, or something more<br />\nsubstantial from the Famous' kitchen<br />\n(chicken, pork barbeque, and so on).<br />\nTalking to Bert, one of the regulars and<br />\nalso a student at Loyola, who missed the<br />\nfirst set. \"Man, they were really<br />\nsmokin'!\" Bert tells of an Andrew White<br />\nconcert in Washington the night before,<br />\n<br />\ndamn, wish they'd get Andrew Whitehere.<br />\nWander over to get some chips and<br />\nginger ale (sorry, out of orange today).<br />\nand pass Ritchie Pratt talking to some<br />\nfans. Pratt is an amazing man, large and<br />\nBuddha-like, with hands the size of<br />\ncatcher's mitts and a huge smile. Like<br />\nmost musicians who play Left Bank,<br />\nPratt is willing to talk to you, to smile<br />\nmodestly when you say, \"Hey, man, you<br />\nwere great!\" and sign a record jacket.<br />\nWith the second set underway, a blues<br />\nis announced, an original by drummer<br />\nRitchie Pratt. 87th Street, it is called, and<br />\nthe band roars through it. When bassist<br />\nGeorge Mraz begins his solo, the crowd is<br />\nelectrified. Mraz's hands skim across the<br />\nfingerboard with an ease that almost<br />\nmakes the bassists at my table consider<br />\ntaking up something easier, like<br />\ngardening. Shouts of \"play, bassman.<br />\nplay\" punctuate the solo until at its end<br />\nthere is no doubt that Mraz is the best<br />\naround. \"Damn, he makes Stanley Clarke<br />\nlook like a kid,\" murmured one amazed<br />\nbassist.<br />\nFinally, after much hard-boppin' jazz,<br />\nand some lovely vocals by \"our surprise<br />\nguest\" Rikki Bogar, the third and last set<br />\nbegins just before 9:00. When Roland<br />\nHanna announces the last number, there<br />\nis much disappointment, but when the<br />\nband strikes up On the Trail the crowd is<br />\ntoo happy to complain. During George<br />\nMraz's solo someone shouts, \"We gone'<br />\nbe here another hour!\" followed by<br />\nseveral shouts of \"All right!\"<br />\nBut at 9:30, the New York Jazz<br />\nQuartet must break, so they can pack and.<br />\nhead back to the Apple. A few More<br />\nrecord-jackets are signed as the crowd<br />\nfiles out. One photographer, after having<br />\nshot a roll and a half of film looks around<br />\nand says,\"You know,these are<br />\nsome of the nicest people in Baltimore.\"<br />\nYeah, well, that's what the Left Bank is<br />\nall about.<br />\n-- J. D. Considine<br />\n<br />\n\fmarch 4, 1977/news-letter/page 5<br />\n<br />\nCALENDAR *<br />\nARTS CALENDAR * ARTS CALENDAR * ARTS<br />\nFilms<br />\n<br />\nTheater<br />\nCenter Stage 700 N. Calvert ST., 332-0033. Lillian Hellman's \"Toys in the Attic.\" Through March 6.<br />\nNational Theater 1321 E. St. (Washinton) \"Bully,\" with James Whitmore as Teddy Roosevelt.<br />\nTlrough March 12. Call (302) 872-0466 for further information.<br />\n4rella Stage 6th St. and Maine Ave, SW (Washington.) Lillian Hellman's \"The Autumn Garden.'<br />\nThrough March 6. Call (202) 554-7890 for further information.<br />\nAf,echanic Theater Hopkins Plaza, 727-4103. Liv Ullmann in Jose Quintero's production of Eugene<br />\n0 Neill's \"Anna<br />\nChristie.\"<br />\nEisenhower Theater Kennedy Center (Washington.)\"Annie,\" a new musical based on the comic strip<br />\n_Little Orphan Annie.\" The Mike Nichols production stars Andrea McArdle, Reid Shelton and<br />\nDorothy Loudon. March 5-31. Call (202) 254-3600 for ticket information.<br />\n<br />\nHoward Community College Little Patuxent Parkway (Columbia.) William Wyler's 'The Best Years<br />\nof Our Lives,\" tonight at 7 pm in the main building. Admission free. Details: 992-4811.<br />\nHealth, Work and Social Change Film Series Johns Hopkins School of Hygiene, Room 1707, on<br />\nMarch 10 at 5:30 pm: \"Healthcaring From Our End of the Speculum,\" a film in which women speak<br />\nabout their experience with the present health care system. Admission is free.<br />\nJohns Hopkins New Political Caucus Remsen One. \"Hearts and Minds\" on March 10, \"Burn\" on<br />\nMarch 11, and \"Battle of Algiers\" on March 12. Admission to the 4 pm show is $.50 and $1.00 for<br />\nthe 7:30 pm show.<br />\nBread and Roses Greenmount and 31st St. Ken Russel's \"Women in Love,\" starrring Glenda Jackson<br />\nand Alan Bates. 7:30 and 10:00 March 4 and 5; midnight show on March 5, $2.00 admission benefit<br />\nfor Bread and Roses.<br />\n<br />\nNew Political Caucus<br />\n\"Enemies of the People\"<br />\n<br />\n, rd's Theater 511 Tenth St., NW (Washington.) \"The All Night Strut,\" a look at the music and<br />\nC'°<br />\nclance of the 1930's and 1940's, with revue stars Michael Davis and Barbara Neuman. Through March<br />\n27. Call<br />\n(202)638-2368 for further information.<br />\nTheater Project 45 W. Presto n St. \"Oat of Hand:, life-sized puppet theater performed by Axel<br />\nNg-Gros.<br />\n<br />\n\"Enemies of the People,\" a film series, will be presented from March 10<br />\nMarch 12 at the Homewood campus. The series is being sponsored by the Johns<br />\nHopkins New Political Caucus, an alternative political group recently formed at the<br />\nUniversity. The films will be shown twice each day in Room 1 of Remsen Hall.<br />\nAfternoon admission is fifty cents, and one dollar in the eVening.<br />\nHearts and Minds, the Academy Award winning film about American involvement in<br />\nVietnam, will kick off the series on Thursday, March 10. The film examines the effect<br />\nof the war on both the Vietnamese people and the American people by presnting<br />\nextensive interviews with government officials and private citizens. Burn!, a film<br />\nconcerning a nineteenth century slave rebellion in the Carribean starring Marlon Brando,<br />\nwill be shown on Friday, March 11. It has been described by Pauline Kael of The New<br />\nYoker as \"the least condescending film ever made about slavery....one that soards with<br />\nthe imaginative forces of art.\" The series will conclude on Saturday, March 12, with<br />\nPontecorvo's award winning film, Battle of Algiers.<br />\nThe New Political Caucus has planned discussion sessions following each evening film<br />\nat Chester's PLace Coffee House, upstairs in the Student Union. Refreshments will be<br />\navailable. Each discussion will be co-led by a faculty member and a student. The<br />\ntentative schedule lists Professor Katherine Verderey of Anthropology as co-leader for<br />\n\"Hearts and Minds,\" Professor Richard Rubinson and Debbi Kelly for \"Burn!\", and<br />\nProfessor Ric Pfeffer as a co-leader for \"Battle of Algiers.\"<br />\nThe New Political Caucus was formed recently as an alternative to the conventional<br />\npolitical groups found on campus. Although the Caucus is not committed to any<br />\nparticular ideology, it is skeptical of the American two-party system and of the social<br />\nand political conditions it creates. The Caucus is planning activities for the rest of the<br />\nsemester and welcomes members of the Baltimore and Hopkins communities to<br />\nparticipate.<br />\n)<br />\n<br />\nConcerts<br />\nlthnore Symphony Orchestra Lyric Theater, 120 W. Mount Royal Ave., 837-5691. Anthony<br />\ndiBonaventura, pianist, performs Beethoven's \"Emperor\" Concerto tonight at 8:15. Darrold Hunt,<br />\nconductor. Also, Tchaikovsky's Symphony No. 6 and Rossini's \"Thieving Magpie\" overture.<br />\n.<br />\nPh ll<br />\na'etPlna Orchestra Lyric Theater, March 8. The Baltimore premiere of David Amram's \"The<br />\nTrail of<br />\nBeauty.\"<br />\nPea<br />\nthebodY Opera Workshop, Symphony Orchestra and Chorus in Honegger's oratorio, \"Joan of Arc at<br />\nStake.\" Tonight and tomorrow night at 8:30, in the Peabody Concert Hall for the benefit of the<br />\nPeabody Scholarship fund.<br />\nabody's North Hall 1 East Mount Vernon Place. Organ students of Donald Sutherland perform at<br />\ne March 9 noon concert. Free.<br />\nLeft BAnk<br />\nJazz Society 1717 N. Charles St., 945-2266. The Sonny Stitt Quartet on March 6 at 5<br />\nPm. Tickets are $4.50 for members and $5.50 for the general public.<br />\nUnited Methodist Church Charles and Belvedere. Dvorak's \"Stabat Mater,\" at 4:30 pm on<br />\nMarch 6.<br />\n<br />\nGrace<br />\n<br />\nenter Forum Old St. Paul's Church, Charles and Saratoga. The Milhaud Trio at 12:30 pm and Sally<br />\nradleY at noon on March 8. Tim Fields, blues, ballad and ragtime, noon, on March 10.<br />\nKing of France Tavern Maryland Inn, Annapolis, 269-0990 from Baltimore. Ethel Ennis, through<br />\nMarch 20. $2.50 cover, no minimum.<br />\n4R Constitution Hall Georgetown, Tuesday, March 8. Muddy Waters, James Cotton, and Johnny<br />\nWinter. $6.50 and $5.50.<br />\n<br />\nPerhaps you're an wondering why I called you here today. No? Well, I'll<br />\nanyway. This campus is suffering a severe shortage of<br />\ntell you<br />\ngood humor. Do you realize that the second biggest joke on campus<br />\nright now lives in Wilmington?<br />\nBut seriously, folks, those of us concerned about the problem are doing<br />\nsomething about it. What we need is a new source of humor, and there's<br />\none on the way: the HopkinsSatirical Journal!<br />\nThat's right, now you too<br />\ncan write for the magazine<br />\nthe National Lampoon<br />\nlaughed at. This year,<br />\nwe're doing a parody of<br />\nRolling Stone magazine,<br />\nfollowing on the success of<br />\nthe amazingly popular<br />\nDundalk Revue and Out<br />\nTo Lunch. So if you'd like<br />\nto help, or contribute<br />\nsome writing, or just don't<br />\nhave anything to do, drop<br />\na line (or a card- they're<br />\neasier to read) to box<br />\n1069 toda<br />\n<br />\n‘/)<br />\n<br />\nCandidates' Forum<br />\nSunday March 13<br />\nLevering<br />\n<br />\n7:30 pm<br />\n<br />\nGreat Hall<br />\n<br />\nCandidates for S.C. Exec. offices will speak r,<br />\nand answer questions /?r<br />\n<br />\n4<br />\n<br />\nS.C. Exec Elections<br />\nMarch 14,15,16 (;)<br />\n<br />\npolling places:<br />\nlibrary, 10-5, 7-9<br />\ndorm snack bar, 9-4<br />\n<br />\n??/<br />\n<br />\nbasement Gilman, 9-4 p<br />\n<br />\nPetitions and MSE Symp. topics due March 6??),<br />\n<br />\n\fThere is another way to go...<br />\nTHE FRIDAY<br />\n<br />\nNEWS-LETTER<br />\nbills<br />\nDown in Annapolis the General Assembly<br />\nhas been<br />\nputting on quite a show of its renowned clear-thin<br />\nking and<br />\nconsistency. While the House gets ready to pass<br />\nits version<br />\nof a drinking age bill, the Senate appears set to appro<br />\nve the<br />\ndecriminalization of marijuana. The former issue<br />\n-- the<br />\nraising of the drinking age -- threatens to create<br />\na wealth of<br />\nproblems for Hopkins and students, and represents<br />\na relapse<br />\ninto short-sightedness that the legislators overc<br />\name three<br />\nyears ago. As for the marijuana bill (S. B. 1054),<br />\nSenators<br />\nneed a good deal of prompting through letter<br />\ns and phone<br />\ncalls to publicly commit themselves to decriminal<br />\nization.<br />\nSpecifically, students can write to an undec<br />\nided Jack<br />\nLapides, 39th District Senat r, and urge him to<br />\nthink a bit<br />\nclearer than most of the Assembly.<br />\nentrance here as a freshman, two<br />\nBlack students were refused the<br />\nright to participate in the<br />\nthe editor:<br />\nproduction of \"The Lion in<br />\nWhen I left Schenectady for Winter.— Last year<br />\na Black<br />\nthe civilized regions of our nation student protested agains<br />\nt what<br />\nI thought that I had heard the<br />\nwas blatant discrimination with<br />\nlast of the old refrain: \"If you<br />\nthe result that the director was<br />\ndon't like it here, why dontcha fired, the<br />\nBarnstormers again<br />\ngo to Russia (where you came issued their<br />\nnebulous and<br />\nfrom.)- Dick Oles' marvelously<br />\nunconvincing commitment to<br />\nclever letter of last Tuesday<br />\nequality of opportunity, and the<br />\nended that illusion.<br />\nauditions were rescheduled. Even<br />\nI had enough of that shit when in her second<br />\nattempt, however,<br />\nI was a kid and I do not want to the<br />\nstudent was unsuccessful.<br />\nhear it anymore. Dicky boy, why<br />\nI have reason to suspect that it<br />\ndon't you go back to shaving the has happe<br />\nned again in the recent<br />\nheads of fencers and forget about auditions for<br />\nroles in the<br />\npolitics. The next time you production<br />\nof \"Antigone.\"<br />\ninclude me in one of your \"weIn the four years of my tenure<br />\nall- know- 's I'll send a letter, in as a student at<br />\nthis university,<br />\nyour name, to Jimmy Carter- and my partic<br />\nipation in student<br />\nthreatening assassination of him events, no group<br />\nhas struck me as<br />\nand the rape of his little more blatan<br />\ntly exclusionary than<br />\ndaughter.<br />\nthe Barnstormers. It is the<br />\nJames A. Harvey<br />\nstandard assumption in some<br />\nTo the editor:<br />\ncircles, that the roles and who<br />\nIn January of 1974, in the will play them has<br />\nusually been<br />\nsecond semester's first issue of decided long before<br />\nhand, and<br />\nthe News-Letter, a Black student that the auditions<br />\nprocess is a<br />\ncharged that he had been<br />\nmere tactical formality. The level<br />\nwillfully and illegally of Black parti<br />\ncipation in<br />\ndiscriminated against during his Barnstormer<br />\nactivities in<br />\nattempt to audition for a role in proportion to total<br />\nparticipation<br />\nthe Barnstormer production of has been so insubs<br />\ntantial as to be<br />\n\"Hedda Gabler.- Subsequent incalculable.<br />\ninvestigajon and interrogation of<br />\nThe theories behind type<br />\nthe director did, in fact, reveal casting and<br />\n\"traditional role<br />\nthat the director had playing\" no longer<br />\nhold up, as<br />\ndiscriminated against the Black the efforts of James<br />\nEarl Jones in<br />\nstudent on the basis of race. It his present<br />\nand previous<br />\nwas his contention that casting a productions of \"King<br />\nLear- well<br />\nBlack in a traditionally white role attest. The sheer limita<br />\ntions upon<br />\nwas inappropriate and forced tin: the number of<br />\nopportunities for<br />\nplay to make statements which students to<br />\nparticipate in<br />\nits content could not support. dramatic endea<br />\nvors on this<br />\nTensions reached such a height in campus demand<br />\nas open and<br />\nthis incident, that the impartial a judgement<br />\nas possible.<br />\nin-tervention of the Dean of Yet, we, as an<br />\nintellectual<br />\nStudents office was necessitated. community, allow this<br />\nsort of<br />\nIt was only through the barbarity tO contin<br />\nue unabated.<br />\nmoderation of the Black<br />\nThe time has come for those<br />\n., Student Union, and an who are truly commi<br />\ntted to an<br />\nassurance from the Barnstormers open atmosphere to stand<br />\nup and<br />\nthat such incidents would not be counted. We<br />\ncan no longer<br />\noccur in the future, that the tolerate elitist groups<br />\npracticing a<br />\nproduction was allowed to left handed sort of exclus<br />\niveness<br />\ncontinue.<br />\nto deny the mass of students<br />\nThis was not the first time it access to the media<br />\nof creative<br />\nhail happened. Previous protests endeavor. The<br />\ntime has come<br />\nof Black students against- the when the<br />\nBarnstormers. and<br />\ndiscriminatory policies practiced<br />\ngroups<br />\nlike<br />\nthem,<br />\nmust be held<br />\nby the Barnstormers fell upon<br />\naccountable for their activities.<br />\ndeaf ears. In the year prior to my<br />\nJ. Michael Endalkachew<br />\n<br />\nletters<br />\n<br />\nTo<br />\n<br />\nBy R.H. WARREN<br />\nAt Colorado College, in Colorado Spring<br />\ns, classes<br />\nare structured in a very different way.<br />\nThe school is<br />\none of a handful of institutions that<br />\nhas a modular<br />\nacademic calendar. Colorado College uses<br />\nthe<br />\n\"Block Plan\" which consists of 3 /<br />\n1<br />\n2-week blocks,<br />\nfive in the fall and four in the spring. There<br />\nare 4<br />\n/<br />\n1<br />\n2-day<br />\nbreaks between blocks.<br />\nThe \"Block Plan\" was developed in the fall<br />\nof<br />\n1970 as part of a routine review of the educat<br />\nional<br />\nprocess by a faculty-student task force.<br />\n\"At that time,\" remarked Professor Glen Brook<br />\ns<br />\nof the Political Science department, \"we<br />\nwere<br />\noperating with the traditional two semesters. Course<br />\nS<br />\n*<br />\n<br />\n1^<br />\nOf<br />\n:%-*<br />\n.10<br />\n.<br />\ne s.•<br />\n<br />\nIrak elan:<br />\n.<br />\n<br />\nssii!;4-11•1111<br />\n-•<br />\n46:11,•4.<br />\n'VIP<br />\np<br />\n<br />\n•<br />\n<br />\n.7<br />\n<br />\n••••<br />\n<br />\n•<br />\n<br />\nao<br />\n<br />\n•<br />\n.<br />\ne<br />\n<br />\n5MN<br />\nSAT<br />\nFRI<br />\n•<br />\n<br />\njuggling was getting complicated; field trips and<br />\nclass conflicts presented difficulties. We wanted<br />\ngreater control over the system.\"<br />\nA student will normally take one course each<br />\nblock, going to class five days a week for two to<br />\nthree hours each day. Undergraduates are required<br />\nto take eight blocks per year; 34 blocks necessary<br />\nfor graduation.<br />\nSince the original change in 1970, Colorado<br />\nCollege has instituted variations on the plan. These<br />\ninclude, for example, the \"track system\" where one<br />\nor two courses are taken over a two block period,<br />\nmeeting on alternate days. There are also courses<br />\n<br />\nwhich last two or three blocks.<br />\nThe modular calendar provides a great variety in<br />\ncourse offerings. It allows the student to totally<br />\nimmerse him/herself in a subject. The system has<br />\nbeen found to be especially useful for<br />\ninterdisciplinary courses taught by several<br />\nprofessors, and for visiting professors. The 3 /<br />\n1<br />\n2-week<br />\nblocks are excellent for field work, such as an<br />\nanthropological dig.<br />\nStudent work schedules are heavy under the<br />\n•'Block Plan.\" One freshman described a typical day<br />\ntor the history course she is taking: 9:30- noon,<br />\nclass; noon-1, lunch; 1-4, reading in the<br />\nlibrary;<br />\n4-5:30, break for shower and dinner; 5:30-9,<br />\nmore<br />\nreading in the library.<br />\nProfessor Brooks explained that the students<br />\n\"can't afford to goof off.\" Work moves along at a<br />\nfairly breathless pace. There is no limit, however, on<br />\nthe number of P/F courses an undergraduate may<br />\ntake.<br />\nMost of the students admit they feel they should<br />\nbe working hard. They enjoy not having to divide<br />\ntheir time between five or six subjects, even though<br />\nthe \"block system\" is a bit \"like cramming every<br />\nnight for three and a half weeks.\"<br />\nThe \"Block PLan\" also has its negative side.<br />\n<br />\nSchedules for the full academic year must bt<br />\nsubmitted the previous spring. One senior lamented„<br />\nthat if you didn't like your class, \"you're stuck.<br />\nCourse changes are only allowed up to the second ,<br />\nday of class. As the semester wears on, the Werl'',<br />\nbecomes progressively harder, and the student<br />\nbecomes more and more tired. One indication of the<br />\npressure is the almost total exodus every brea<br />\n<br />\nAll of the students spoken to, had a veil<br />\nenthusiastic attitude towards the program'<br />\n\"Intense\" was the word most often used to describe<br />\nthe blocks, and most found it a better method fel<br />\nunderstanding a subject. One student reported that<br />\nthe system even affected her social life and mood'A<br />\nlab in the science building is a different experience<br />\nthan a studio in the art center. Both are available for<br />\nstudent use throughout the day, since no other class<br />\nwill be needing the room.<br />\nColorado Women's College in Denver, and Mount<br />\nVernon College in Washington, D.C. utilize another<br />\nform of the modular calendar, with only five<br />\nmodules per year-- two in the fall, one in wint<br />\ner<br />\n,<br />\nand two in the spring. Each session is six weeks<br />\nlong, and students take two courses per module.<br />\nThe registrars at all these schools agree that a<br />\nmodular calendar is more complicated ru,<br />\nadminister. There are more grade periods an<br />\nregistration problems. However, each registrar was<br />\nadamant that the program was the best for the<br />\nstudents. They noted that the total number of hours<br />\nspent in class equals, or exceeds that ill the<br />\ntraditional two semester system.<br />\nA big question is whether or not the modular<br />\nsystem increases<br />\n<br />\nthe retention of information. Some people argue<br />\nthat if you are doing something for a longer time. It<br />\nsinks in better. Students at Colorado College.<br />\nhowever, claim their \"Block Plan\" makes retention<br />\na \"whole lot easier.There are many types of academic calanders, and<br />\nvariations of each, used in universities and colleges<br />\nthroughout the country. The modular system Is<br />\nprobably the least used, and also die least thought<br />\nabout. (Perhaps other University presidents should<br />\ngive it a thought.)<br />\n<br />\n\fN<br />\n<br />\nrateI<br />\nch.\"<br />\n:ond<br />\nfork<br />\nt(<br />\nthe<br />\n<br />\neiY<br />\nITh<br />\n<br />\n.ibe<br />\nfor<br />\nhat<br />\n.A<br />\nice<br />\nfor<br />\nass<br />\n<br />\n!nt<br />\nter<br />\nire<br />\n!r,<br />\nks<br />\n<br />\non his Commemoration speech, Chris Gray, Mike<br />\not satisfied with our notes<br />\nGiuliano, and I got in line to talk to the great man, hoping for some choice words<br />\nof wisdom. Thanks to his Kentucky connection (and his knowledge of Warren's writing),<br />\nChris engaged Warren in a real convei-sation, not the usual \"I really like your work\"<br />\nreception lines. This, coupled with the honorable Doctor's desire to meet the author ofan<br />\nN-L parody ofJames Dickey, led to an interview at Nichols House the next morning.<br />\nThe interview began with an exchange of autographs -- Dr. Warren got the author's and<br />\nthe author got Dr. Warren's. What follows is Chris Gray's transcription of the great man's<br />\nwords (edited for publication by Gray).<br />\n--Considine<br />\nsaid writing in Greenwich Village. During the summer I'd just listen to people like Edmund Wilson,<br />\nshe<br />\nyear,<br />\nKatharine Anne Porter spoke at Hopkins last<br />\nGiuliano: When<br />\ncannot be taught, but can be learned. As a teacher of many years standing, how does that Miss Porter, and others, just hearing them talk about why so and so's no good.-When I<br />\nwas in graduate school, I'd work like hell when I was there, and then I'd take a weekend<br />\nstatement strike you?<br />\nRPW: I think it's perfectly true. It can be expedited to use a horrible word. There are off now and then, go down to New York and have a little dowsing in real life, in the<br />\nsome short cuts that can be learned. There are some negatives that can be learned. But Village... Something has to give; you just can't study all the time in graduate schoo..<br />\nyou can't make a writer. It's a complex, it's an organic thing, fundamentally. The need is Considine: Does it strike you as an inherent weakness of the university system that they<br />\nthe main thing. The necessity to put things into any art, to make a shape. There's a need. (students) are forced into an academic structure, where they just can't sit around and<br />\nMy son is a sculptor. From the time he was two, he was having tools, or putting things talk, that they have to back everything up?<br />\ntogether with his hands. His hands had to be doing something...But you could see it when RPW: The students have to make it. The students make their lives. They formed informal<br />\nhe was a child, his hands had to be at work on some material. My daughter is a painter. At clubs at Vanderbilt. Vanderbilt; God knows it was not. But the students there would line<br />\nbreakfast, before she went to school, she was drawing or painting colors of some kind on up to buy the first Dial or the first Fugitive (literary publications of the 1920's). It was a<br />\nstudent state of mind. I don't mean every student. But I mean a significant number... You<br />\nthe table top. It was in the hands of both before the time they were two.<br />\ncan't put it off above. It's got to come from within the student s themselves... It's simply<br />\nGray: Before they could consciously decide?<br />\nRPW: There just wasn't any choice. Their hands just couldn't stop. My daughter, when a desire by the student to immerse himself in learning. There's no credit for this, there's<br />\nno degree. It must be a nassion for learning.<br />\nshe was a child, would spend half a day,just trying to draw a picture of her cat.<br />\nSokolow: Did you start writing when you were in<br />\nConsidine: It's really the oldest way of learning.<br />\ngrade school?<br />\nGray: It's the only way.<br />\nRPW: Oh, hell no. I was going to be admiral of the<br />\nRPW: Also, universities are a natural place for it.<br />\nPacific Fleet.<br />\nback to the universities in the sixteenth<br />\nGo<br />\nGray: You were a Kentucky boy who wanted to<br />\nAt Cambridge, the students showed their<br />\ncentury.<br />\nsee the world.<br />\nessays to each other, or to the older heads. It's<br />\nRPW: I wanted to see the world. And I got the<br />\nnatural. You just pass it back and forth and show<br />\nappointment to go to Annapolis when I was<br />\nto older people who have more experience.<br />\nit<br />\nsixteen. And then I had an accident that hurt my<br />\na class, that's a seminar. These writing<br />\nThat's<br />\nsent<br />\nThat<br />\nphysical.<br />\nthe<br />\nvision, and I couldn't pass<br />\nclasses, now, are an honest attempt to try to create<br />\nme to the university.<br />\na natural situation, but they're wrong.<br />\nGray: And then you went down to Vanderbilt (in<br />\nGray: They're contrived from the very start.<br />\nNashville, Tenn.) and met John Crowe Ransom<br />\nRPW: Yes, they.re contrived. In a technological<br />\nand Donald Davidson.<br />\nsociety, you make an effort to create what was<br />\nRPW: Yes, I went there as a chemist. I was<br />\nnatural at one time.<br />\nregistered in chemical engineering. But they taught<br />\nConsidine: The big problem is scaling it all down,<br />\nchemistry by rote...I liked the laboratory. But you<br />\nwhat's uaually a handful of people into<br />\nfrom<br />\ncould never get to the idea; it was all rote.<br />\nthat encompasses hundreds.<br />\nsomething<br />\naccumulating<br />\ninformation.<br />\nGray: It was just<br />\nRPW: Yes...I've resigned from teaching jobs several<br />\nRPW: Accumulating information. And this I found<br />\ntimes for reasons such as over- specialization... but<br />\nboring. And then I happened to have an English<br />\nI've always gone back to it because I missed it so<br />\nteacher, who never tried to be interesting, who<br />\nmuch. Mr. Warren went on to tell us a story about<br />\njust<br />\nanything.<br />\nwas<br />\nHe<br />\nnever persuaded anybody or<br />\nGeneral Lee, which he confirmed from several<br />\na fascinating man. Every day he'd say something<br />\nsources. Lee's rule of conduct, according to<br />\nother<br />\nthat would stick in your mind. Just casually. Well,<br />\nwas:<br />\nWarren<br />\nMr.<br />\nI changed my mind in six weeks. Before I knew it,<br />\nsaid to the little boy: \"Always deny<br />\nLee<br />\nSo<br />\nRPW:<br />\nat seventeen I wanted to be a writer or nothing.<br />\nyourself.\"\\10ne should always deny himself. It's a<br />\nConsidine: Do you think one of the reasons why<br />\ngenerational thing. Just the self-discipline, of a<br />\nso many courses that teach writing are offered is<br />\nDoctor ofLaws R. P. W.<br />\nwhole generation. I heard my father say it. And<br />\njust to keep good writers employed?<br />\nsuch<br />\nagainst<br />\nnot<br />\nI'm<br />\nthing...<br />\ndeny<br />\nI've<br />\nto<br />\nlearned<br />\na<br />\nIt's<br />\nmyself.<br />\nvery<br />\nfunny thing in an age now which is fulfillment...<br />\none<br />\nfor<br />\nit,<br />\nwant<br />\nRPW: I don't .know why. Because students<br />\ncourses. Though it is very new. It didn't happen in my time, you see... It depends on the Be yourself. It's a whole new culture... That difference L so marked.<br />\nteacher. If the teacher has the knack. But most of them don't. There just aren't many Giuliano: You've been described as a regional writer, because all of your novels have a<br />\ngood teachers in the world. There are many incompetent teachers. There are learned men Southern setting. What does the word regional mean to you?<br />\nwho know the material, but not many who have a real vocation, the ones who can make RPW: Well, from the very start I never took the trouble to find out ... You've got to<br />\ncontact with a few or many students. There are not very many of those. I only met four create the regional world, not write from it. If you read Madame Bovary, you know a<br />\nin my whole life. ... Davidson was a great systematic teacher. Ransom, two days out of French village. Now that's a regional novel.<br />\nthe three he'd speak, you might as well\\have been feeding the cows. My, he was just Considine: A lot of people confuse parochialism with regionalism.<br />\nsadistic during those two days. But the third day his mind would catch fire, and you'd see RPW: That's right. The deck of a whaler is a very restricted place. It's a floating region.<br />\na man thinking for forty-five minutes, seeing fresh ideas, and seeing how a mind works. Moby Dick is a regional novel. Hardy is a regional novelist, and deliverately so. I was born<br />\nWell, Willard Farr of California, who I took in a seminar there, had the same quality. And and raised in Kentucky, and that's the region I write about. You've got to point yourself:<br />\nTucker Brooke at Yale, who taught me Shakespeare in graduate school. Well, two \"My God, I can try to make poetry out of the world I know.\" You can see Yeats and<br />\nother poets writing about their own worlds. We are all victims, or beneficiaries, however<br />\nmeetings,he'd be just routine, but the third one he'd catch fire, and you'd see a mind working.<br />\nWhat you said about teaching is so true. Could you tell us why you chose ou chcose to write it, of our earl ima Tes.<br />\nGray:<br />\nto teach, and how it influences your life?<br />\n.<br />\nRPW: Well, I started out teaching just as a way to pay the grocery bill. I knew I couldn't<br />\nmake a living right away, and I knew I had enough self discipline. I love to read, and I<br />\nRobert Penn ,Warren discusses the work of 'James Duckey, as well as the Oxford Book<br />\nlove to talk about what I read. By teaching, you can read a book and talk about it,<br />\nof American Verse.<br />\nwithout being interrupted. I like the human relations very much, and I've always been<br />\n\"Duckey\": What a great ego trip.<br />\nvery fortunate. I've met a number of good students, and peopel I like to be with. But I<br />\nRPW: It made my day.<br />\nproctors<br />\npeople,<br />\nfifty<br />\nand<br />\nhundred<br />\nhate big lecture courses; I had some at Minnesota, a<br />\nwriting<br />\none<br />\ncourse,<br />\nand<br />\nMrs. Warren: Are you still an undergraduate here?<br />\nacademic,<br />\none<br />\ngroups:<br />\nand all, formal lectures. At Yale I had two<br />\nworkshop<br />\nof<br />\nmethod<br />\nthe<br />\nNo, I'm enjoying the endless summer of the eternally unemployed. Former<br />\n\"Duckey\":<br />\nin<br />\nbelieve,<br />\ndon't<br />\nstill<br />\nand<br />\nI<br />\nBut<br />\nbelieved,<br />\nnever<br />\nso called.<br />\nstudent, I got out of here last May.<br />\nstudents reading their papers and then saying: \"Now, Jimmy, what do you think of<br />\nMrs. Warren: Well, it's a marvelous job, a beautiful job.<br />\nthat?\" and \"Suzy, what do you think of that?\" I just don't believe in that. I believe in<br />\nout<br />\nlay<br />\ncan<br />\nyou<br />\nthen<br />\nBecause<br />\n\"Duckey\":<br />\nliterature.<br />\nThank you. I'm glad somebody liked it.(Laughter.)<br />\nusing literature in the classroom. Take a piece of<br />\nthe<br />\nand<br />\non,<br />\ntouch<br />\nto<br />\nwant<br />\nGray:<br />\nyou<br />\nGet<br />\nproblems<br />\nyour<br />\nbook autographed. Inscribe it \"To the author of James Duckey.\"<br />\nthe<br />\non<br />\na program from start to finish, touching<br />\nConsidine: Be sure to write loud and get this all on tape.<br />\nkinds you want to touch on. Spend an hour a week, or two hours a week, talking about<br />\nRPW: To the author of \"James Duckey\"(signing).<br />\nthat one piece. They've all read it so they can discuss it. And then have all the criticism,<br />\n\"Duckey\" Thank you very much.<br />\nface to face. It's a time job, you see. Then the person can talk out his story; you can<br />\nRPW: This is the Oxford Book (of American Verse).<br />\nre-trace the process, you can get inside the story with him.<br />\n\"Duckey\": Old Edition. The New Edition will probably have this much devoted to<br />\nConsidine: So you're dealing more with a reading, than an interpretation.<br />\nyour poetry.<br />\nRPW: No, it's combined. You can criticize, you can say: \"Now look, can't you see the<br />\nRPW: The New Edition is really a bad job. The latest poem of mine that appears there<br />\nway your tracks lie, that that's the wrong perception?\" Or. \"Try it like this. But it's<br />\nwas written in 1963. He (Richard Ellmann, the editor) ignored all my best things;just<br />\npersonal, it's more experimental. You can deal with one person, in a couple of chairs, for<br />\nneglected all the books that were written since '63, and other people feel the same<br />\na period of time, talking about that story. And you know there's no formula for that.<br />\nway. Ultimately, there are some omissions; glaring omissions. He did it with his left<br />\nYou just both try to be intelligent about it. ...Otherwise, you're not covering the main<br />\nhand, got some English assistant of his, teaching at Oxford, to do it for him. I can't<br />\ntopics in a systematic form.<br />\nunderstand it. In the first place, he has no status as a critic at all. He's a first-rate<br />\nGiuliano: What did your friends Katharine Anne Porter and Ford Madox Ford teach you<br />\nscholar, but nobody would think of him as a critic. As a critic he is incompetent. I<br />\nabout prose writing?<br />\nhave no kick; space, you see, and that sort of thing.<br />\nRPW: They weren't teaching classics, they were just sitting around boozing! I didn't meet<br />\nany real fiction writers until 1927, when I was in graduate school. I gave myself a seminar<br />\n<br />\nA conversation with<br />\n<br />\nRobert Penn Warren<br />\n<br />\nAn exthange of plaudits<br />\n<br />\ne-,<br />\n<br />\nr,<br />\n<br />\n\fpage 8/news-letter/march 4, 1977<br />\n<br />\nJohns Hopkins University<br />\n<br />\n•-:<br />\n<br />\nWeekend Wonder Flix<br />\n<br />\nThe Office of Special Events<br />\npresents<br />\n<br />\npresents<br />\nDUSTIN HOFFMAN'S BRILLANT PORTRAYAL OF ONE OF<br />\nTHE GREATEST PHILOSOPHER/SATIRISTS OF OUR TIME<br />\n<br />\nTHE BALTIMORE PERCUSSION ENSEMBLE<br />\n<br />\n•:Charles Memphis, Director<br />\n<br />\n\"Lenny\"<br />\n<br />\n•••<br />\n•:.<br />\n<br />\nSUNDAY, MARCH 6 - 2 PM<br />\n<br />\n•:•<br />\n<br />\n•:-<br />\n<br />\nSHRIVER HALL AUDITORIUM<br />\nFREE ADMISSION<br />\n<br />\n•••<br />\n<br />\n•:.<br />\n<br />\n•.•<br />\n<br />\n***<br />\n<br />\n•••<br />\n••<br />\n<br />\n•••<br />\n<br />\nValerie<br />\nPerrine<br />\n<br />\nThe Office of the Chaplain<br />\n\"The Sunday Experience\"<br />\nPresents<br />\n<br />\nDr. NORMAN PITTENGER<br />\n<br />\nDustin<br />\nHoffman<br />\n\"Lenny\"<br />\n<br />\nFriday,<br />\nSaturday,<br />\n<br />\nDirector: Bob Fosse<br />\nScreenplay: Julian Barry<br />\nBased on: Play by Julian Barry<br />\nPhotography: Bruce Surtees<br />\nMusic: Miles Davis<br />\nCast: Dustin Hoffman, Valerie Perrine,<br />\nJan Miner, Stanley Beck<br />\n<br />\nWrofessor and Process Theologian<br />\nKing's College,Cambridge England<br />\n<br />\nTHEOLOGY AND RELIGION<br />\n<br />\nMarch 4 Shriver Hall<br />\nMarch 5 L/V Room<br />\n<br />\n730 & 10:00 MI<br />\nADMISSION $1.00<br />\n<br />\nSUNDAY,MARCH 6, 11:00 AM<br />\nLISTENING-VIEWING ROOM<br />\n<br />\nHoltman again asserts his claim to being<br />\ntoday's great character leading man. He<br />\ngives a complex and mercurial performance.<br />\nHe alone makes LENNY worth seeing.<br />\n—Richard Sehickel, Time<br />\n<br />\nLEVERING HALL<br />\n/<br />\n<br />\n0<br />\n-<br />\n<br />\nGa9CcluctzS1mpnium 1917<br />\nsetturdatj,March<br />\nGatjHistOry)<br />\nand\\A./1th members ci<br />\n<br />\nF<br />\n<br />\n/<br />\n<br />\n/<br />\n<br />\n/<br />\n<br />\n/<br />\n<br />\nF<br />\n<br />\n/<br />\n<br />\n/<br />\n<br />\niJIiMrg000000<br />\n<br />\n5_00<br />\n<br />\nSenior Class Film Series<br />\npresents<br />\n<br />\n\"A tough-nosed, no-nonsense, gutsy look<br />\nat the underbelly of America as it existed<br />\nback in the 30's. A fine picture.\"<br />\n-JEFFREY LYONS. CBS<br />\n<br />\nti more,&al Alli ance,<br />\n1:1/ Room<br />\n1.14 ort,314•1<br />\nSuftdal,March(cs<br />\nTheiGati Movement with Dr Franklin<br />\nKaniltn1 avvci me\"bers of B.G.A.<br />\nGarrett RoovnASE L brat-113PM<br />\nMew Otieans,1933.<br />\nIn those days words didn't buy much.<br />\n<br />\nMonda Marcie%<br />\n<br />\nklorrn6v1 pi+tip<br />\nKinc&G)11¢4<br />\n<br />\n-bleb<br />\n<br />\nPIMP MOS<br />\n<br />\nbd<br />\n<br />\n&rCtRcvy,MLbrartj,1PM<br />\nsponsomd by<br />\ntif)cj.H LI &a Ca us<br />\n<br />\nCO<br />\n<br />\nJILL iR[LAND .51- a-rim MARTIN<br />\nCodu.••••<br />\n<br />\nFRi. & SAT.<br />\n<br />\nMARcli 4 & 5<br />\n<br />\nShaffer 3<br />\n<br />\n8:00 8 10:00<br />\nAdmissioN $1.00<br />\nSENIORS<br />\n<br />\n5.75<br />\n<br />\n55<br />\n<br />\n\fmarch 4, 1977/news-letter/page nine<br />\n<br />\nSpRiNvimE<br />\n<br />\nAT ThE STACHUM (ILOUNgE)<br />\n<br />\nBaseballs are already being tossed about by major-league arms in Floridian and Arizonan climes, the<br />\nusual signal that another month will bring pennant-hungry legions down 33rd Street. This season, though,<br />\nthe troops will be thinner and the expectations smaller, as most scribes rate the Birds a bare broken-bat<br />\nsingle ahead of the Bluejays (the new Toronto team, not your Hopkins ten.)<br />\n<br />\nBefore<br />\nand after the forthcoming 4-2 and 3-1 losing battles, however, the bars along Greenmount<br />\nAvenue will be full of the usual number of thirsty patrons. Foremost among these watering holes for<br />\nOriole fans is the aptly-named Stadium Lounge, just a five-minute stroll from Memorial's entrance gates.<br />\nDecor inside the Stadium Lounge plays up to the rabid sports beer-guzzler: oil portraits of former and<br />\nfading Baltimore legends, such as Brooksie, Johnny U., and Boog Powell(Reggie blew in and out of town<br />\nso fast the artist didn't have time to choose his brushes); an aerial photo of Memorial Stadium,<br />\npresumably taken by a sober<br />\nDonald Kroner -and autographed ceiling tiles -- one dollar immortalizes<br />\nnames from the diamond greats to the Canonsburg Softball All-Stars. A couple tables have electronic<br />\ngames inset in them, a good way to recoup bets lost at the ballpark. The jukebox, though, doesn't deserve<br />\na quarter to scratch out a pair of dusty 45's.<br />\nThe Stadium Lounge boasts the best-stocked bar on Greenmount, but-the cost of the liquor shows it.<br />\nStick to the forty cent drafts, served in classy highball glasses. As for food, the two staples are stacked<br />\nham and cheese and Reubens<br />\n<br />\nloin<br />\n<br />\nSandwiches<br />\nthat have over the years decreased from a once-incredibie size<br />\nwhile the prices increased. (A big Bird win sometimes inspires the kitchen to return to its former<br />\noverwhelming standards.) Likewise, the Thursday shrimp night.has fallen on hard times parallel to the O's<br />\nfate: a smaller offering,and more expensive. Seems everyone's headed for a bad season along 33rd.<br />\nDon't let these warnings deter the bar-and-ballpark goer, however; nor should the Stadium Lounge's<br />\nannoying practice of carding students halt the serious springtime fan. Baltimoreans have the instinctive<br />\nknowled e that when the Birds come north, it's time to wander east to Greenmount and 34th.<br />\n<br />\nfoREigN campus<br />\nNOTE of ThE WEEk<br />\n<br />\nCHILE:<br />\nThe U.S. Department of State recently requested that Ji-EI sponsor<br />\nthe visit of two high level officials representing the Chilean<br />\ndictatorship.<br />\n<br />\n•••IR WO<br />\n•<br />\n•<br />\n<br />\nIn reaction to the anticipated visit opposition was<br />\n<br />\nLe Department de Langues<br />\nRomanes a le plaisir dc vous inviter<br />\na une conference avec diapositives<br />\ngoing on in Chile, and why this opposition was raised.<br />\nsur la France le mercredi, 8 mars a<br />\n11 heures au L & V Room. (Ste<br />\nRoland Husson! Call \\7228 for a<br />\ngood time!! And don't forget that<br />\nH-Club Beach Blanket Bingo begins<br />\nN1arc1t 7 from 1-3 at the Athletic<br />\n--- a documentary about human rights in Chile, narrate'<br />\nc.'enter: cost $12.00 Check it out!<br />\nby<br />\nprison<br />\ninternational<br />\nby 2 political prisoner's released from<br />\nHey Grandma Levin!!)<br />\npressure.<br />\nvoiced within and outside the Hopkins' community. The visit has now<br />\nbeen cancelled. Come to this meeting to find out more about what's<br />\n<br />\n\".<br />\n<br />\n\"0<br />\n<br />\n000<br />\n<br />\n“.<br />\n<br />\n••••<br />\n<br />\n•<br />\n<br />\n•••.•:•. ••:•:.. •••••• •<br />\n<br />\nInterested in planning<br />\nor learning about<br />\n<br />\nFILM - \"To the People of the World\"<br />\n<br />\nFORUM -<br />\n<br />\nWOMEN'S STUDIES<br />\n<br />\nWith speakers from the International Chile<br />\nSolidarity movement and members of the Hopkins<br />\ncommunity.<br />\n<br />\non campus?<br />\n<br />\nMONDAY<br />\n<br />\nCome to a meeting!<br />\nMonday March 7<br />\n<br />\n3/7<br />\n<br />\n5:00 PM.<br />\n<br />\nSchool of Hygiene, - Room<br />\n<br />\n2008<br />\n<br />\nVERY SINCERE MEDICAL<br />\nSTUDENT, Jewish, age 26, seeks a I<br />\nsincere, well-educated, well-adjusted '<br />\nyoung woman of good character. ,<br />\nObject: friendship andi<br />\ncompanionship possibly leading to<br />\nmarriage. Please reply to Box 5936,<br />\nPikesville, Maryland 21208.<br />\n<br />\nSPANISH by experieseed sabstai<br />\nWhy do U.S. academic institutions advise governments which disreEar<br />\n<br />\ntaacNers -<br />\n<br />\nAS Ionia. ail morn.<br />\n<br />\nthe health and welfare-of their people?<br />\nFEMALE ROOMMATE mutisrrE<br />\nshare unfurnished two bedroo<br />\n<br />\nBring your dinner!<br />\n<br />\nto<br />\n<br />\nWhat is the effect of the Chilean government's move toward a profit<br />\napartment with kitchen, bath an<br />\noriented medical system on the health status of the Chilean people? living room. Located one bloc<br />\n<br />\n6 pm<br />\nLevering Cafeteria<br />\n<br />\nWhy aren't Hopkins' ties with all foreign gov-rnments made public?<br />\n<br />\nfrom Peabody Conservatory<br />\ni $112.50 (electric not included pe<br />\nI month. 685-3091 Late evenings.<br />\nGentleman<br />\n<br />\n..:•:•• .-:•:-..-:-:••<br />\n11<br />\n<br />\n'Bobby .Franks was snotty.<br />\nJOHN GACHBOOKSHOP<br />\nBALTIMORE'S LARGEST<br />\nUSED BOOKSTORES<br />\n<br />\nL.<br />\n<br />\n\"NNW Am..41111. Am..410.<br />\n<br />\nBIERVBES OPPORTUNffY<br />\n<br />\nStuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.339A<br />\n310 Franklin Street<br />\nRoston Mass.<br />\n0<br />\n<br />\nMIAMI<br />\n<br />\nto<br />\n<br />\nNew<br />\n<br />\ncalculators<br />\n20-40% OFF<br />\nSR-51 II<br />\n<br />\n3322 Greenmount Ave.<br />\n467-4344<br />\nUSED AND RARE<br />\nOLD AND OUT-OF-PRINT<br />\n<br />\ndriving<br />\n<br />\nMarch 10 -15th, willtake<br />\nb<br />\nSponsored by: Baltimore-Chile. Solidarity group & Kedical Committee for one passenger Share gas only. Mutual references - 338-1789.<br />\nHuman Rights<br />\nP.O.B0:-, 1194, Bait. 21203<br />\n327-202 or 338-0750<br />\nP.O. Box 4394<br />\nBait. 21223, 467-0940<br />\n.1111110.-olallio alas- .11ii. .111M. ..cmo. .11010. .111/.<br />\nl(.:11 1 thru .MARCii 12<br />\nBruce<br />\n<br />\n•-:<br />\n..<br />\n<br />\n$53.50<br />\n<br />\nU 1LF v4,0'<br />\n<br />\nLIVE! ON STAGE!<br />\nTHE 50's COME TO LIFE!<br />\n<br />\nWW1<br />\n,<br />\n.<br />\n<br />\nneingest<br />\nda- in.towd<br />\nshow<br />\n<br />\nUnique<br />\nYour<br />\nJHU<br />\n<br />\nMIANNA A<br />\n<br />\nCampus<br />\n-<br />\n<br />\nPride!<br />\n<br />\nBus. Anal°<br />\n<br />\n$33.50<br />\nTEXAS INSTRUMENTS<br />\n<br />\nREBATE<br />\nSR-56 S83.50<br />\nPius<br />\n$10.00 Rebate<br />\n<br />\n581-52 $191.95<br />\nPlus Rebate of<br />\n$59.90 in Libraries<br />\n<br />\n$19.95<br />\nSR-51 II $53.50 TI-30<br />\n$31.95 TI-1600 $19.95<br />\nSR-40<br />\nPC 100 $165.50 TI-1650 $23.50<br />\nTI Business Analyst $33.50<br />\n<br />\n10 DAY FREE TRIAL<br />\nAdd $2.00 shopping. Md., res. add 4% tax<br />\nFor immediate C.0.D shipment phone:<br />\n301-428-0099 OR Send payment to.<br />\n<br />\nW<br />\n<br />\nashington Calculators<br />\n5538<br />\nROCKVILLE. MARYLAND 20855<br />\n<br />\nP 0 BOX<br />\n<br />\nSend today. A profile-postcard with<br />\nmany superb views on one card.<br />\n<br />\nCHARGE TICKETS<br />\nBY TELEPHONE WITH<br />\nYOUR CREDIT CARD.<br />\nPhone (301)727-4103<br />\nTickets available at<br />\nall Ticketron outlets.<br />\n<br />\nTHE NEW<br />\nMECHANIC<br />\n<br />\n'think! Think more often of your)<br />\nrelatives and friends; drop them a<br />\nline; they will admire and treasures<br />\nyour pride! Frame one for yourself!<br />\nON SALE AT YOUR<br />\nCAMPUS BOOK-STORE<br />\n<br />\nI<br />\n<br />\nTHE DRAMATIC EVENT<br />\nOF THE SEASON<br />\n<br />\nLIU ULLMANN.<br />\nANNA CHRISTIE<br />\nCHARGE TICKETS BY TELEPHONE<br />\nWITH YOUR CREDIT CARD<br />\nPhone(361)727-4103<br />\n1,<br />\n<br />\niiitli.ts<br />\n<br />\n'FILE NEU'<br />\nMECHANIC<br />\n<br />\nMorris A. Mechanic Theatre<br />\nHopkins Plaza, Baltimore<br />\n<br />\nMorris A Mechanic Theatre<br />\n\"<br />\n4.11M. .1•1111.<br />\n<br />\n\fpage 10/news-letter/march 4, 1977<br />\n.* *<br />\n<br />\n***<br />\n<br />\n* *<br />\n<br />\n* * * *<br />\n<br />\nLIKE TO HUSTLE?<br />\n<br />\nEMPLOYMENT INTERVIEWS AT THE PLACEMENT BUREAU<br />\nThe following organizations will be interviewing interested students at the Placement Bureau, Room 135, Garland<br />\nHall, during the eoming weeks. Students nearing graduation who will be seekin'g full-time, permanent employment<br />\nare encouraged to come to the Placement Bureau to schedule interviews and to obtain information about<br />\nemployment opportunities.<br />\n<br />\nN-L needs more ads<br />\nHeavy cut on the action!<br />\nContact us at 338-7647<br />\n6<br />\naaaaaaaaaaaaaaa<br />\n<br />\naaa******** a* aaa<br />\n<br />\n13111s<br />\nUnivesity Sandwich Shame and Deft<br />\nAll Lump Crab Cakes<br />\nGenuine Kosher Corned Beef<br />\nDelicious Roast Beef<br />\nVirginia Baked Ham<br />\nVarious Co/<br />\n1<br />\n41 Cuts<br />\nCheese (Swiss, Provolone, Muenster)<br />\nKosher Hot Dogs<br />\nCatering<br />\nParty Trays(special order)<br />\nPizza<br />\nHome Made Dessert (Cheese Cake)<br />\nIce Cream<br />\nSelect Grocery Items<br />\nPlants<br />\n<br />\nRESTAURANT & CARRY OUT<br />\nPlississ 4167-6262<br />\nUNIVERSITY PARKWAY<br />\nM - Fri: 9:30- 7:00<br />\nAT ST. PAUL.<br />\nSat: 9:30 - 2:00<br />\n,LOINIY. uNneasonv OM APTS.<br />\nClosed Sundays<br />\nFREE SODA WITH THIS Al) AND<br />\nPURCHASE OF $1.00<br />\n<br />\nRpoieE in THE LAMB<br />\nby Benjamin Britten_<br />\n<br />\nGOD<br />\nCUATED<br />\nby -H. Wctorci Dathes<br />\nSunda_y afternoon—<br />\n<br />\nmcn<br />\n<br />\n6<br />\n<br />\n0<br />\n6<br />\n6<br />\n6<br />\n6<br />\n0<br />\n<br />\nTuesday, March 8<br />\nEquitable Trust Company<br />\nSocial Security Admin.<br />\nWednesday, March 9<br />\nComputer Sciences Corp.-Systems Division<br />\nComputer Sciences Corp.-Systems Sciences Div.<br />\nU.S. Dept. of Commerce-Bureau of the Census<br />\nThursday, March 10<br />\nU.S. Fidelity & Guaranty Co.<br />\nAir Force Recruiting Group<br />\nIIT Research Institute<br />\n<br />\nThe<br />\nIllerig<br />\nThis Is a cryptogram,a form of code language,<br />\nwhere letters of the alphabet stand for other<br />\nletters of the alphabet. For instance,the words<br />\n\"A CAT\" in a cryptogram might be \"Q TQL;'<br />\n<br />\n6th — 4:30<br />\n<br />\na6<br />\n<br />\nTuesday, March 15<br />\nMaryland National Bank<br />\nBurroughs Wellcome Co.<br />\nWednesday, March 16<br />\nMotorola, Inc.<br />\nCapital Area Personnel Services<br />\nOffice-Navy (CAPSON)<br />\nThursday, March 17<br />\nACTION--Peace Corps & VISTA<br />\nFriday, March 18<br />\nACTION--Peace Corps & VISTA<br />\n<br />\nthe \"Q\" always standing for \"A;' the T- for -C.<br />\n:<br />\nand the \"I.: for \"T Your challenge is to break the<br />\ncode of the cryptogram below,and discover its<br />\nhidden message.<br />\n<br />\nU1-11\\)EISITV BaPTIST<br />\n@HUP,CH<br />\n<br />\n3501 11.. OHAR,LES ST.<br />\n<br />\n_Performaci<br />\nC-Ne CHLI1WH S<br />\nI SIXT9 VOICE CHOIR,,<br />\nw LEA. soloists<br />\n<br />\nDiAne LICHTErIBERCER-5.pr,e•ro<br />\nKevin King JECIrthE<br />\nJOSEPH PEARS011-Bordonl<br />\ncle..ecleal by<br />\n911,:nisler<br />\n<br />\nWILL1Fim PCIR,TRIDGC<br />\n<br />\n9ffasic- Organist<br />\n<br />\nPUBLIC COITIALLU II1VITED<br />\n<br />\nPUB<br />\n.h.......ire.Mir.eranaMort.r..:WW\"........ton.M.....:\"..<br />\n<br />\nM BSIZT<br />\nECIO VJWNCJOH<br />\nMZ VWUOISZD CIRF:<br />\n\"KT RISWG LIZ LIK ZMFT<br />\nZJOT EIC ESCZDTC HTMCRD<br />\nIC RILHJGTCMZJIL,ISC<br />\nQJRZSMWH ATJLN OSRD<br />\nFIVTLZ, THVTRJMWWU<br />\n<br />\nc.<br />\n(o) F I LM FESTIVAL<br />\n• INCLUDiNG '1 FIELDS<br />\nE<br />\n<br />\nISC ATTCT\"<br />\n<br />\nTHREE S<br />\n<br />\nWhen there's a challenge,<br />\nquality makes the difference.<br />\n<br />\n,<br />\nGFOUCH°<br />\n<br />\nHARP°<br />\n<br />\nAllgANDW<br />\n<br />\n71-IE 11/113X BRos<br />\n<br />\nAlt<br />\no MARCM<br />\nGLASS<br />\nPAVILLION<br />\n<br />\nt:00<br />\n<br />\nTO<br />\n<br />\n// PM<br />\n<br />\nAMISS ION 5,C4 - CHEAP BEERAgfcEORN<br />\n<br />\nWe hope you have some fun with the challenge.<br />\nThere's another challenge we'd like to offer you, too.<br />\nThe Pabst challenge:<br />\nWe welcome the chance to prove the quality of<br />\nour beer. We challenge you to taste and compare<br />\nPabst Blue Ribbon to any other premium beer. You'll<br />\nlike Pabst better. Blue Ribbon quality means the best<br />\ntasting beer you can get. Since 1844 it always has.<br />\n<br />\nPABST. Since 1844.The quality has always come through.<br />\nC1977 PABST BREWING COMPANY Milwaukee Ws Peorta Hekahts Ill Newark<br />\nNJ Los Angeles Calif f • ,..org,a<br />\n38330 Hno A11VID3dS3 IN3dS HDGIN ON138 sivnioin ano NOI1V11301SNOD II<br />\nF138V3S El3H18nd tiOd 3VVII JAVI MON ION crinoo 3M >100EI<br />\n1-11110INAld 1v SwiLiOlid 0408d 310110 V uounl.S<br />\n<br />\n\fOn the Road:<br />\nBluejay Hoopsters<br />\nBag it again....<br />\nBy DAVID KRAUS<br />\nOn February 18, the Blue Jay Basketball team travelled<br />\nto Washington College to play an important MAC game.<br />\nFor an account of that game, see the News-Letter of<br />\nFebruary 22.<br />\nThree-thirty. Most of the team has gathered in the<br />\nAthletic Center lobby. The bus is scheduled to leave in<br />\nfifteen minutes, but it hasn't arrived yet.<br />\nMike Phipps, the leading scorer, sits on a bench,<br />\ndrinking a soda, talking to assistant coach Al Robinson.<br />\nPhipps didn't play in the most recent game- he was sickand he still doesn't look good.<br />\nCoach Gary Rupert takes out a cigarette and lights it.<br />\nHe takes a few puffs and then walks into the offices and<br />\npicks up a telephone.<br />\nThree-forty. We're scheduled to leave in five minutes,<br />\nbut the bus still hasn't arrived. Rupert walks to the door,<br />\nstares outside for a few minutes, then walks out onto the<br />\nfront steps.<br />\nJV coach Marshall Turner walks to the door that<br />\nRupert just walked through, and stares out for a minute.<br />\nOutside, Lovallo and Dean Uhler talk on the steps.<br />\nLovallo is wearing an off-white sport coat, brown pants,<br />\nand white Adidas track shoes.<br />\nOn a separate part of the steps, Rupert smokes another<br />\ncigarette.<br />\nUhler walks back inside and picks up a copy of the<br />\nNews-Letter and begins to read it.<br />\n.Rupert comes back in. Two of his young sons are<br />\ncoming on the trip and have been running around the<br />\nlobby. One comes up to his father and talks to him; but<br />\nthe Coach doesn't seem to be listening.<br />\nThree fifty-one. The bus arrives. There is a mass exodus<br />\nfrom the lobby.<br />\nMost of the team moves toward the back of the bus. By<br />\nthe time everyone is seated, there are very few places left.<br />\nRupert's sons take the front seat. The coach sits in<br />\nback of them next to Brian Goodman, the team manager.<br />\nRupert looks toward the back and sees Raymond Plack<br />\nstanding up.<br />\n\"Sit down, Ray\" and Plack finds a seat.<br />\nRupert lights up a cigarette.<br />\nBob Babb, the assistant trainer and an assistant coach<br />\nof sorts, is sitting across the aisle from me and see me<br />\nwriting. He reads the last entry and realizes what I'm<br />\ndoing.<br />\n\"If you write down each time the Coach smokes a<br />\ncigarette,\" he says, \"you'll be writing that all night.\"<br />\nFour-ten. We're still in the city. The bus is very quiet.<br />\nMost of the team members are reading.<br />\nMany are reading the News-Letter. Dan Kopcza is<br />\nreading The Evening Sun. Brian Gapsis, sitting next to me,<br />\nis reading a book entitled How to Buy Stocks .<br />\nFour-fifteen. Brian Goodman suggests playing the letter<br />\ngame. There's not that much interest, but he finally<br />\nrounds up Rupert, Robinson and Babb to play. I don't<br />\nknow what it is, so I look over Babb's shoulder.<br />\nIt's not too difficult. Someone says a phrase, \"Johns<br />\nHopkins University\" for example, and on a piece of paper<br />\nyou spell that phrase down the side of the paper, the \"J\".<br />\non the first line, the \"0\" on the second line and so on.<br />\nSomeone then says a second phrase of an equal number of<br />\nletters, \"the bus goes down the trail,\" for example, and<br />\nyou write that on the paper next to the first phrase in a<br />\nsimilar manner.<br />\nWe play several rounds. Each lasts about fifteen<br />\nminutes.<br />\nFive o'clock. We start a fourth round. The players have<br />\nchanged. Babb has fallen asleep and John Finston has now<br />\njoined in.<br />\nFive-twenty-five. We've stopped playing and the bus is<br />\nstill very quiet. Rupert is sitting on the front seat and one<br />\nof his sons is sleeping on his shoulder.<br />\nAl Robinson is in the back of the bus talking to Dean<br />\nUhler and several others.<br />\nBrian Gapsis leans forward and asks Marshall Turner<br />\nhow much farther. Not too far.<br />\nFive-forty. Bob Babb and Dave Emala, who have been<br />\nasleep,_ are woken by Brian Goodman. They aren't happy.<br />\nFive-fifty. We arrive at Washington College. Rupert<br />\n<br />\nsmoke 'em,<br />\nJays!<br />\n<br />\nsmokes a cigarette. Marshall Turner announces that the<br />\nJV game is in half an hour.<br />\nEveryone moves toward the locker room. There's a line<br />\nin the bathroom.<br />\nSix o'clock. A group heads to the sub shop. Where is it?<br />\nUp the block.<br />\n\"I hope around here up the block doesn't mean five<br />\nmiles,\" David Nagelsberg adds.<br />\nI drop back and walk with Mike Phipps and Duey<br />\nLevine. Passing one of the buildings, we hear a scream.<br />\n\"The natives are restless,\" I comment.<br />\nThe talk turns to Washington College and what it's<br />\nprobably like. It's pretty much out in the middle of<br />\nnowhere. Yeah, they probably do nothing but drink. You<br />\ncould probably make a fortune selling drugs.<br />\nWe pass a large gassy area in front of a building.<br />\nSuddenly, someone in a car roars onto the grass and<br />\nproceeds to alternately speed up and gun his brakes in an<br />\nattempt to spin out. He is only partially successful.<br />\nMike Phipps doesn't look or sound good. He is<br />\ncoughing fairly frequently. He says that he had a<br />\ntemperature of 103 on Tuesday, but now he feels alright.<br />\nSix-ten. We get to the sub shop. There's a pizza place<br />\nnext door and the other group has gone in there. Phipps,<br />\nLevine and I decide to get subs and take them back and<br />\neat them at the gym.<br />\nIt doesn't take too long for the subs to be made and we<br />\nbegin to walk back. The conversation of the return trip is<br />\nof fraternities and rush parties.<br />\nSix-thrity. We get back to the gym with our food.<br />\nRupert takes one look at us and tells us to go downstairs<br />\nto eat. We walk downstairs and decide to eat in the locker<br />\nroom, but it's locked.<br />\nSix-fifty. We finish eating and walk upstairs to watch<br />\nthe JV game. The stands are almost empty.<br />\nThe varsity team is spread out through the stands.<br />\nPhipps and Levine are sitting at one end. Al Robinson and<br />\nBrian Gapsis are talking at the opposite end. Somewhere<br />\nin the middle, Dean Uhler, John Finston and Kevin Kabat<br />\nare sitting- still in the same place as they were an hour<br />\nbefore. Kopcza and Lovallo are sitting nearby.<br />\nSix-fifty-five. Halftime for the JV game. Hopkins is<br />\nlosing 44-35. Coach Rupert's sons spend the halftime on<br />\nthe basketball floor shooting baskets.<br />\nSeven-ten. Halftime ends. Kabat and Uhler go<br />\ndownstairs to get ready for the game. The varsity game<br />\nwill begin twenty minutes after the JV game ends- which<br />\nmeans in about an hour.<br />\nSeven-fifteen. Nagelberg and Plack arrive back from<br />\ndinner. The whole team now goes downstairs to change.<br />\nSeven-twenty-five. Rupert is still upstairs. He smokes a<br />\ncigarette.<br />\nSeven-thirty. The team is in the locker room and all the<br />\nplayers have changed. They are getting ready for the<br />\ngame.<br />\nAndy Scheinfeld is doing stretching exercises. Randy<br />\nLovallo is making sure his thigh is alright. Bob Babb, the<br />\ntrainer, is walking around giving heat foam treatments to<br />\nvarious team members. Mike Phipps is sitting in a cornerhe still doesn't look like he's 100%.<br />\nThere is a small blackboard hanging on the back of the<br />\ndoor. In one corner, someone has written JHU=Control<br />\nand Wash=Kaos. Rupert moves to the blackboard and<br />\nbegins his pre-game speech.<br />\nThe coach talks about the offensive strategy. The team<br />\nwill try to get the ball down low to Scheinfeld anytime<br />\nthey can- he'll probably be covered by someone small.<br />\nThe defensive assignments are run through. The coach<br />\nemphasizes that \"we can't let them have second and third<br />\nshots.\"<br />\nRupert then discusses what he thinks the keys to the<br />\ngame will be- intensity and how JHU does on the boards.<br />\nHe then reminds the team that Hopkins was beating<br />\nWashington by seven at halftime earlier in the season and<br />\nlost the game. He finishes by stating that the Jays have<br />\nmore talent than Washington. No one needs to be<br />\nreminded of the game's importance.<br />\nSeven-fifty. The JV game is over- Hopkins has lost. The<br />\nvarsity team heads upstairs.<br />\nRupert stays downstairs in the hallway for a minute<br />\ntalking with Al Robinson. The coach smokes a cigarette.<br />\nEight. Rupert comes upstairs.<br />\nEight-nine. The game starts.<br />\nHalftime. Hopkins is leading 38-35.<br />\n<br />\nIn the hallway outside the locker room,Rupert smokes<br />\na cigarette.<br />\nInside, the team is quiet despite the fact that they are<br />\nin the lead. There's some small talk about the reffing (or<br />\nlack of it). The players give suggestions to each other.<br />\n\"The guy in the high post takes alot of turn-arounds.\"<br />\nRupert comes in and talks to the team. He likes the<br />\nway the offense has been running- \"we're doing what we<br />\nwantThe team has been concentrating, but needs to<br />\nconcentrate more on foul shots- the team is4-12 from the<br />\nline.<br />\nRupert emphasizes that the key to the second half will<br />\nbe defense and how well Hopkins handles the ball.<br />\nEight-fifty-five. The team heads upstairs. The coach<br />\nstays downstairs and smokes a cigarette.<br />\nNine-one. The second half begins.<br />\nNine-fifty-six. The game is over. Hopkins has won<br />\n82-80, in overtime.<br />\nThe locker room, obviously, is a happy place. There is a<br />\ngreat deal of hand-shaking, back-slapping, etc. However,<br />\nbesides that, the scene is rather subdued.<br />\nIn the background someone yells, \"If we keep<br />\nwinning, we keep playing.\" That seems to sum up the<br />\nteam feeling -- despite a tiring, emotionally-draining<br />\nvictory, all the team has gained is a chance to play a<br />\nplay-off game to see whether they'll play in the playoffs.<br />\nAl Robinson is talking about the victory. Overtime<br />\nwins are the best kind, he claims.<br />\nJohn Finston is sitting in a corner talking with Phil<br />\nHersh of The Evening Sun. Finston has an excellent game,<br />\nscoring 22 points. Hersh finishes his interview with<br />\nFinston and walks over to Andy Scheinfeld. Scheinfeld<br />\nwas the team's leading scorer with 25 points. For<br />\nScheinfeld and Finston, the team's co-captains, it was<br />\ntheir final regular season game.<br />\nMike Phipps didn't play. He dresses, without having<br />\nshowered, and is the first player to leave the locker room.<br />\nTen-fifteen. Rupert is upstairs smoking and discussing<br />\narrangements for the playoff game. The team begins to<br />\ncome up. Soon, everyone is in the gym and Rupert<br />\nannounces that it's time to head out to the bus.<br />\nTen-thirty. Everyone is on the bus. Coach Rupert<br />\nannounces that the bus will stop at the nearest beer<br />\ngarden. There is a loud cheer. He praises the team for the<br />\nvictory.<br />\nThere is a great deal of laughing from the back of the<br />\nbus.<br />\nIn comparison, the front of the bus is quiet. Randy<br />\nLovallo, who hadn't played, is reading. Coach Rupert<br />\nstands in the front of the bus and looks out the<br />\nwindshield. He turns and talks to Al Robinson.<br />\nTen-forty. The bus stops at a store to buy beer.<br />\nFinston, Coach Rupert and the bus driver go in to buy the<br />\nbeer.<br />\nThe back of the bus remains noisy. Duey Levine leads<br />\nthe conversation. Robert Kluttz and Ray Plack get a little<br />\nrambunctious. Andy Scheinfeld gets up and quiets them<br />\ndown.<br />\nTen-fifty. The refreshments arrive and are quickly<br />\npassed around. Scheinfeld, a non-beer drinker, has a soda.<br />\nBrian Gapsis tries to sleep.<br />\nEleven. The bus is still very lively- there's singing<br />\ncoming from the back. Ray Plack, looking for a beer,<br />\nheads towards the back. He returns with a bottle and a<br />\nsmile.<br />\nEleven-ten. The beer has run out.<br />\n<br />\n\f-4..% kvp.111/1v• -ou •-‘,1.xxx1<br />\n•<br />\n<br />\n\f", "format": "basic_html", "processed": "I.<br /><br />\nGENERAL ASSEMbly FOLLIES:<br /><br />\nPOT<br /><br />\nIN, Al.001101 ON ThE WAy<br /><br />\nBy ERIC GARLAND<br />\nThe Maryland General Assembly is headed this session<br /><br />\nfor !a possible trade-off of legal highs, considering<br />\nbills that would heave a direct impact on students' drug<br />\nuse. For the first time in a few years, the Assembly,or the<br />\nSenate, at least, appears ready to seriously consider<br />\nmarijuana decriminalization measures. At the same time,<br />\nstrong sentiment exists to prohibit that other staple -alcohol -- from legal consumption by eighteen to twenty<br />\nYear olds. Both issues tend to evoke very emotional<br />\nactions, from constituents and representatives alike, and<br />\nthus the final Assembly decisions on these matters are<br />\nrather unpredictable. The prevailing mood, though,<br />\nindicates that something will be done.<br />\nFor the drinking age, a number of different proposals<br />\nhave been put forth to change the present system. In<br />\n1974, the Assembly lowered the legal age for beer and<br />\n\\vine to 18, while hard liquor remained at 21. This<br />\nin consistency in types of alcohol allowed for<br />\nconsumption has prompted a number of delegates to push<br />\nfor a uniform drinking age.<br />\nBefore July 1, 1974, Hopkins had, of course, no<br />\nRathskellar. The campus did feature regular parties on the<br />\nWeekends, with a keg of beer usually in front of the<br />\nfreshmen dorms or in the Great Hall, available for<br />\neveryone's use. Fraternities also had their rush parties and<br />\nnormal beer bashes, and there was no great difficulty to<br />\nObtain beer or liquor through older students. Obviously a<br />\nrelaxed situation -- only when one went off-campus to a<br />\nbar or liquor store did the carding and subsequent refusal<br />\nor service occur.<br />\nThat scenario may soon reappear, if twenty-seven<br />\nsenators set the pace for their House colleagues. On<br />\nl'ebruary 15, the Senate passed a bill sponsored by<br />\nJerome Connell (D.31st Anne Arunder) that would<br />\ngradually raise the drinking age back to 21. The legal age<br />\nwould move up one year for three successive July 1st.<br />\nThis plan would create an interesting life for some<br />\neighteen year olds, who would drink for a few months out<br />\n0f the year and then would have to wait for their birthday<br />\nto come around again. Those unfortunate enough to have<br />\nbeen born on. June 30, 1959 would find themselves with<br />\nthree precious \"legal\" drinking days over the next three<br />\nYears.<br />\nDuring the Senate debate, the proponents of the<br />\nConnell bill pointed out that alcohol has filtered down to<br />\nteenagers in junior high and high schools, and the new<br />\ngrotici of drinkers has been responsible for a marked<br />\ni ncrease in traffic accidents. Opponents countered with<br />\nbasically<br />\nthe same arguments that lowered the drinking<br />\nage three years ago -- that 18 year olds deserve full adult<br />\nli,ghts. And Senator Clarence Mitchell termed the bill the<br />\n, wino's windfall,\" as those under 21 would turn to the<br />\n1°eal derelict for buying liquor.<br /><br />\nAs the Senate passed Connell's bill 27-17, the House<br />\nprepared for hearings on its own drinking-age legislation.<br />\nFour different bills introduced in the House variously<br />\nproposed to raise the age to 19, 20, and 21, with some of<br />\nthem establishing a standard age for all liquor. The House<br />\nJudiciary Committee will eventually settle on one of the<br />\nbills to send before the full House.<br />\nAt Hopkins, administrators are watching the progress<br />\nof the bills with obvious concern. Unlike the old \"21\"<br />\ndays, the University has an expensive, licensed<br />\nestablishment -- the Rathskellar -- on campus that would<br />\nhave to be radically changed with the adoption of any<br />\ndrinking-age bill.<br />\nIf a bill does pass the Assembly (and Mandel had<br />\npromised to sign any reform of the drinking age), the<br />\nRathskellar faces a couple unpleasant alternatives: no beer<br />\nor (if the age reverts to 21) no students. Both situations<br />\nspell financial trouble- whether a large, deserted bar or a<br />\nsoda parlor without the huge volume of beer sales. As<br />\nBettye Miller, Business Manager of the Dean of Students<br />\nOffice said about a 21-age bill passing, \"the Rathskellar<br />\nwould have to be something else. There are people who<br />\nget together without drinking beer -- we could still have<br />\nthe music and other things. How popular it would be<br />\nwithout beer is up to the students. If they don't patronize<br />\nit, we'll have to think of something to do to bring them<br />\nback again.\"<br /><br />\nRAThSkEtEAR FACES<br />\nA COUptE Of UNpLEASAINT<br />\nALTERNATIVES: NO bEER<br />\nOR NO STUdENTS•P<br />\nIf the age doesn't go all the way to 21, that still leaves<br />\nthe Rathskellar with the problem of figuring out who to<br />\nlet in, what to serve them, and under what conditions. At<br />\npresent, the University's lobbyist in Annapolis, Ellergy<br />\nWoodworth, is working with a few students to monitor<br />\nthe legislators' plans for the drinking age bills. Once they<br />\nget a clear idea of the eventual, shape the bill will take -and whether that bill would pass -- they can start to really<br />\nworry about what to do with the Rathskellar.<br />\nMeanwhile, the Senate Judicial Proceedings Committee<br />\nheard testimony yesterday concerning Senate Bill 1054.<br />\nIntroduced by Mitchell, S.B. 1054 proposes to reduce the<br />\npeitalties for simple possession of up to one ounce of<br />\nmarijuana to a maximum fine of $100. Similar<br />\ndecriminalization measures have failed in the past to get<br /><br />\n...while hits off mistah b's cousin become decriminalized<br /><br />\nbaroara sacox<br /><br />\nOUT FOR 1977 dRuggiEs.<br /><br />\nea s<br /><br />\nyear. ORML (National<br />\nt:<br />\nout of commitBteaer:flothis<br />\nOrganization for the Reform of Marijuana Laws)<br />\nspokesman Lou Curran expects \"a 5-3, maybe even a 6-2<br />\nfavorable report. We received a much warmer reception<br />\ntoday (Thursday) than ever before.\"<br />\nCurrent Maryland laws classify marijuana possession as<br />\na criminal misdemeanor, punishable by up to a year in jail<br />\nand a maximum $1000 fine. Mitchell's bill, partially<br />\nirafted by Maryland NORML and modeled on successful<br />\niminalization laws of other states, would create a<br />\nLion system similar to traffic tickets. A police officer<br />\nesting someone for simple possession would issue a<br />\ncitation to appear in court. The offender would then<br />\neither obey the summons or forfeit collateral (money) -$25 has been the usual amount in decriminalized states-in lieu of court appearance. There would be no actual<br />\n\"arrest,\" and no criminal record for the person cited.<br />\n\"This state spends an estimated six to nine million<br />\ndollars to arrest 6000 marijuana lawbreakers each year,<br />\n93% of whom possess only a small amount for personal<br />\nuse,\" Curran said. States that have decriminalized<br />\nd marijuana show no more increase in usage than<br />\nMaryland, and the courts and police have been freed from<br />\nthe thousands of marijuana arrest cases.<br />\nOnce the Senate Committee votes favorably on the bill<br />\n(around March 11), it will go to the Senate floor for<br />\ndebate and voting. At present, Curran counts about<br />\ntwelve votes committed for the measure and four against<br />\nit: of the 31 other senators, \"most are in favor but<br />\nunsure how to vote since they're unsure about the<br />\npublic's feelings.\" Curran hopes that a flurry of letters to<br />\nlegislators will bring out those privately in favor of<br />\ndecriminalization.<br />\n\"Our main goal is to get as many Senate votes as<br />\npossible,\" he commented. If the bill passes the Senate by<br />\na healthy, margin, it could induce the conservative House<br />\nJudiciary Committee to give serious consideration to the<br />\nproposal. Last year, the committee killed a House<br />\ndecriminalization bill 17-3; Curran expects the same<br />\nreaction (with bills piling up, the committee might not<br />\neven schedule a hearing) this time unless the Senate<br />\ncreates some pressure.<br />\nMandel's desire to raise the drinking age brings with it a<br />\nconcomitant opposition to decriminalization. If S.B. 1054<br />\ndoes roll through the Senate and somehow gets out and<br />\npassed on the House floor, it would still languish on the<br />\nGovernor's desk. Passage by the Senate, though., would<br />\nset up a very promising effort for next year, an election<br />\nyear, both in the House and the Governor's mansion.<br />\nThis year's edition of the General Assembly, then, will<br />\nprobably drink their rounds at the top of the Hilton,<br />\nwearied by the last-minute rush of bills, and perhaps<br />\nwondering at their feat of taking a legal beer can out of<br />\nsomeone's hand, while slipping a decriminalized joint iu<br />\nits place.<br /><br />\npage 2/news-letter/march 4, 1977<br /><br />\nAuthor Alex Haley speaks at UMBC<br />\nThe Roots industry prospers<br />\nBy MIKE GIULIANO<br />\nAlex Haley, author of The Autobiography of Malcom<br />\nX and Roots, spoke on February 28 before a<br />\nUniversity of Maryland Baltimore County crowd<br />\nestimated at 5,000. Baltimore County Executive Ted<br />\nVenetoulis, never one to avoid public exposure, spoke<br />\nbefore Mr. Haley and declared the day \"Alex Haley Day<br />\nin Baltimore County.\" Venetoulis cited the search for his<br />\nown ethnic roots and the cooperation between Baltimore<br />\nCounty and Baltimore City as the reasons for his<br />\nappearance. The crowd was amused, guffawed a bit. If Mr.<br />\nVenetoulis doesn't win the governorship it won't be<br />\nbecause he hasn't conducted one of the more intense and<br />\nobvious campaigns in Maryland history.<br />\nHaley was struck by the size and warmth of his<br />\naudience. \"It seems unbelievable when one has spent<br />\naround twelve year5 lin hibernation writing a book to see<br />\nso many people turn out. You have to be moved with this<br />\nkind of audience...(The writing of Roots) transcends what<br />\nan individual could do. I feel myself to have been a •<br />\nconduit through which something has come... My<br />\ngrandmother would say, 'The Lord might not come when<br />\nyou expect him to, but he will always be on time,' and<br />\nthat is how I feel about the book.<br />\n\"It began when I was a little i boy\" in Henning, a little<br />\ntown about fifty miles north of Memphis. My<br />\ngrandmother would invite various women members of the<br />\nfamily to come and spend the summer.\" Each evening,<br />\nthese old ladies would sort of filter out onto the porch,<br />\nwhere they would sit in rocking. chairs, talking about<br />\npeople, places, and events, most of which Haley did not<br />\nunderstand. \"I didn't know what a Massa or a plantation<br />\nwas. My first impression was that what they talked about<br />\nwent way back.\" The idea that these women, old and<br />\ngray, were once as young as the boy, \"would blow my<br />\nmind.<br />\n\"The oldest one they talked about was the African,<br />\nbrought to America, to a Virginia plantation...The fourth<br />\ntime he escaped he was caught by professional slave<br />\ncatchers. When these two men cornered the man. they<br />\nwere able to overcome him and bring him back. He was<br />\ngiven a choice of punishment, either being castrated or<br />\nhaving a foot cut off.\" He chose the latter.<br />\nThere was hardly any family continuity among the<br />\nslaves on this and similar plantations, because adult slaves<br />\nwere frequently sold off, their own children did not know<br />\nthem, and slaves as a group had little sense of a heritage.<br />\nThe African was an exception. He was assigned to work in<br />\nthe vegetable garden, hobbled about as best he could,<br />\nfathered a child. The African would point out natural<br />\nobjects- to his child, teach her the names for them in his<br />\nnative tongue. Like most Africans, he was given an<br />\nAnglicized name - Toby. His identity was taken away, but<br />\nhe rebuffed the name, called himself Kunta Kinte.<br />\n\"Every single one of those Africans was from some<br />\nplace where they had spoken a native tongue. They all<br />\nlearned to speak this strange new tongue in idiom, or<br />\ndialect...Kinte began to tell his daughter anecdotes about<br />\nhimself, a sense of his past, how he had been captured<br />\nwhile chopping wood to make a drum.\"<br />\nThe audience, though most of them had already read<br />\nthe book or watched the television series, remained silent<br />\nand attentive as Haley narrated the history of his family<br />\nfrom Kunta Kinte down to his maternal grandmother,<br />\nwho \"pumped that story into me as if it were plasma.\"<br />\nBy his midteens, Haley's father had received a graduate<br />\ndegree and was teaching in Southern colleges. \"When the<br /><br />\nComic of the Week<br /><br />\nL.oLF \"c041E<br /><br />\nU THE-<br /><br />\nSecond World War ,came I thought that by joining the<br />\nCoast Guard I could walk the coast, but I found myself<br />\non an ammunition ship in the South Pacific, which is not<br />\nwhat I expected.\" Experiences on the ship led to the<br />\nwriting<br />\nof Roots. \"Our biggest problem was not the<br />\nenemy, but boredom...I'd get my portable typewriter and<br />\nwrite letters to anybody. Mail call came to be an epical<br />\nevent for me. I'd get thirty or forty letters every mail<br />\ncall...Being at sea as long as we were and as far away from<br />\nhome as we were, when we'd finally get onshore in<br />\nAustralia -- I don't have to tell you what our foremost<br />\npriority would be ... Back at sea some of my buddies on<br />\nthe ship asked me if I would help them write letters to<br />\ntheir sweethearts (in Australia.) They were not<br />\nparticularly hot on paper. I'd sit with a deck of 3X5<br />\ncards, and as they came up one by one I'd interview them<br />\nabout the girls. If he said the girl's hair was blond, I'd<br />\nwrite: 'Your hair is like the moonlight rippling on the<br />\nwaves.'<br />\nHis clients would later describe, in quiet graphic detail,<br />\nhow well his letters had worked. \"I became heroic that<br />\nnight on that ship. And I tell you, for the rest of the war I<br />\ndidn't fight a soul. I just wrote love letters.\"<br />\nWhile at sea, Haley read magazines, decided to write<br />\nand submit adventure stories. As for the period of<br />\napprenticeship, he doesn't believe in any sort of<br />\n\"mysterious talent... Anyone who desires to achieve<br />\nsuccess in the creative arts must develop self-discipline. I<br />\nknow for myself, once I began I wrote every day, three<br />\nhours a day, for eight years, before I sold an article.\"<br />\nAfter twenty years service in the Coast Guard, Haley<br />\nretired at the age of 37, sought a career as a free-lance<br />\nwriter, lived in a Greenwich Village basment, and finally<br />\ndid sell articles -- to Reader's Digest.Playboy interviews<br />\nsoon followed.<br />\n\"Doing a Miles Davis story (for Playboy), I discovered<br />\nthat Miles didn't like writers and didn't talk much ... Miles<br />\nwas a good cook, especially chile. One night I got a call,<br />\nheard a voice say, 'Chile,' and hang up, which translated<br />\nmeans,'Come on over, Miles has made chile.'\"<br />\nTwo years were spent working with Malcolm X, the<br />\n.-n-st year in interviewing him, and the second in breaking<br />\nthe discussions up into chapter areas, \"writing vicariously,<br />\nas if I were he, telling his life.\" Sitting in a New York City<br />\nhotel room, Malcolm X, flashing his ball-point pen,<br />\nproofread the book, said: \"Brother, I don't think I'm<br />\ngoing to live to read this again,\" borrowed the book,<br />\nspent three days reading it in a hotel room, and two<br />\nweeks later was shot dead. Immediately after his death,<br />\nHaley wrote the Epilogue in a one week session at the<br />\ntypewriter. The 1965 book sold six million copies and<br />\nwas subsequently translated into seven languages.<br /><br />\nTom Murray and Irene, as well as the names of four older<br />\nchildren. He was filled with the \"growing sense that I'd<br />\nheard this before. When I saw the name 'Elizabeth, A,g,e,<br />\n6,' I realized 'That's Aunt Liz, whose knee I sat on.<br />\nAunt Liz was in the same building with the Bill of Rights<br />\nand the Constitution.<br />\nThe old one who was still living was cousin Georgia,<br />\nwhose mouth would run like wildfire when talking about<br />\nthe family. \"I had this great compulsion to see her. After<br />\nall the 'Boy, you done growed up's, she told me about<br />\nKinte in her own individualistic way.\" She spoke of these<br />\nothers who had been on that front porch, not as if they<br />\nwere dead, but as if they had gone behind a curtain or<br />\nsomething.<br />\nBack in New York, he attempted to discover what<br />\nAfrican tongue these words of Kinte's belonged to. Going,<br />\nto the United Nations' lobby at quitting time, he stopPea.<br />\ndozens of African delegates and spoke the words to the°.<br />\n\"me trying to tell them some alleged African sounds ifla<br />\nTennessee accent.\" A scholar finally did identify it as 3<br />\nlanguage spoken near the Gambia River.<br />\n\"I had to get to that place. I didn't know anything,<br />\nreally, about Africans.\" Once there, he encountered the<br />\ngriots, very old men,.living archives, who kept farnilY<br />\nhistories in their heads, and could talk for two daYs<br />\nwithout repeating themselves. Westerners, with the crutch<br />\nof print, have forgotten what the human memory is<br />\ncapable of. A three day mini-safari took him to the griot<br />\nthe memory -- of his people. When he got in the village et<br />\nsome seventy adults, he immediately recognized the gricit'<br />\nwho had \"the aura of somebodyness about him.\" 1.11\",<br />\npeople stared at him, this brown man in a soot blac'<br />\ncrowd. Haley then realized: \"They had never seen a black<br />\nOther assignments followed, one of which took him to<br />\nAmerican.\" When the griot spoke to him, he resolved:,<br />\nWashington, where \"I found myself near the National<br />\n\"I'm going to see these words put into permanent form<br />\nArchives. I'd never been in it.\" He examined the census<br />\nThe griot spoke of America: \"Yes, we have been told thadt<br />\nrecords for 1870, the first time blacks were listed by<br />\nthere are many of us who are in exile in that place calle<br />\nname, and on the microfilm reel he read line after line<br />\nAmerica.\"<br />\nafter line of the names of people long gone. \"As I turned<br />\nHaley regretted only that other black Americans could,<br />\nthe handle fast they seemed to sprint along: when I<br />\nnot share his experience. \"If any black person only collie<br />\ncame<br />\nturned it slower they moved with dignity. How easily I<br />\nknow what were the real African names, where he<br />\nmight have walked out and forgotten it.\" But he<br />\nfrom and when ... a griot who could tell him from whence<br />\nhappened to walk out through a genealogy reading room,<br />\nhe sprang ... I was just openmouthed ... 200 years ar<br />\nnoticed people bent raptly over tables, reading sometimes<br />\nwho married whom, all the way across the line ... I was<br />\nwith magnifying glasses, and a thought came into his' struck by the Biblical way<br />\nthey expressed it: begat<br />\nhead: \"These people are trying to find out who they are.\"<br />\nbegat ... begat ... In the Year of the Water Buffalo...\"<br />\nHaley returned to the Microfilm Room, saw the names<br />\nAs his family history was told, a circle formed arouhu<br />\nhim, women thrust infants at him in one of the oldest<br />\nhuman ceremonies, the laying on of hands. The men took<br />\nthis Methodist to their mosque and prayed: \"Praise be<br />\nAllah for the one lost from us whom God has returned.'<br />\nVillagers mobbed the expedition, and Haley thought:<br />\n\"What a huge caprice it was. The reason they're down<br />\n11;<br />\n... I REMEMBER.<br />\nthere and I'm up here is which of our forefathers .was<br />\nI OLD DAY6<br />\nsnatched<br />\n... They were collectively crying out 'Mister<br />\n5EE1 IT<br />\nKinte,<br />\nMister<br />\nKinte.'\"<br />\nCRY AND SCREAM AgD<br />\n•<br />\nDROVE HER<br />\nWhen he returned to America, Haley went to his<br />\nRAIL ARMO—<br />\nWILD!<br />\n4<br />\npublisher, told him he had to write a book about his .<br />\nevEN FAINTfamily, but in a broader sense about his people, because<br />\n\"every black American goes back to that.\" After nine<br />\nyears of research and three years of writing, the bool<br />\nappeared last August, has sold around 1,500,000 copies ih<br />\nhardback, and was serialized by ABC. Haley is currentlY<br />\nworking on two books: Search, and Henning(named after<br />\nthe Tennessee town of his youth.) A record album,<br />\nrecounting the Roots project, should appear in a month<br />\nor so. The Roots'industry prospers.<br /><br />\nmarch 4, 1977/news-letter/page 3<br /><br />\nMatters of State<br /><br />\nJust what does Hopkins want to do with Chile?<br /><br />\nRather than providing the necessities, such as adequate<br />\nbelieved. This<br />\nUniversity's decision as had been earlier<br />\ncare, nutrition, and employment opportunities,<br />\nhealth<br />\npoints.<br />\nng<br />\nturn onevents raises a number of interesti<br />\nthat would allow poor families to escape their dilemma,<br />\nRegardless of University statements, it would be<br />\nbirth control programs are implemented. The government<br />\nwrong to totally dismiss the protest actions as a force<br />\nthereby solves the problem by eliminating it. THis<br />\ninfluencing the decision to decline. Although no one can<br />\nis typical of the Chilean junta's approach to<br />\nattitude<br />\nthe<br />\nbe precisely sure of their effect, one has to realize that<br />\nhealth policy. One particularly regressive policy was the<br />\nUniversity would naturally attempt to play down their<br />\njunta's move to reduce government spending by excluding<br />\nimportance in order to maintain the fullest possible<br />\nfrom the list of those eligible for free medical care some<br />\ncontrol over such decisions in the future.<br />\nof the very people who most need it - the unemployed.<br />\nbehind<br />\non<br />\nPerhaps more important is the basic assumpti<br />\nThe junta's health policies have not escaped international<br />\nhave<br />\nwould<br />\nvisits<br />\nthe<br />\nthe statments by Mrs. Norris- that<br />\nattention. Both the American Public Health Association<br />\nindeed taken place if only the scheduling could have been<br />\nand the National Association of Social Workers have<br />\narranged. Political or moral considerations about assisting<br />\ned them.<br />\ncondemn<br />\nits<br />\nfor<br />\nonally<br />\ninternati<br />\na regime which is recognized<br />\nwere<br />\nrights<br />\nhuman<br />\nof<br />\ndisregard<br />\nrepression and flagrant<br />\nmatter of mere<br />\nabsent from the decision. It was a<br />\ng that the<br />\nsurprisin<br />\nlogistics. In view of that fact, it is not<br />\nnot visit<br />\nwill<br />\nChileans,<br />\nUniversity has no assurance that the<br />\nNorris.<br />\nMrs.<br />\nto<br />\ng<br />\nAccordin<br />\nJohn Hopkins in the future.<br />\nby<br />\nmade<br />\nbe<br />\nto<br />\nhave<br />\nwould<br />\ndecision<br />\nsuch a policy<br />\nMuller.<br />\nPresident<br />\nd<br />\nThe Medical Institutions, as one of the most renowne<br />\nadvice<br />\nfor<br />\nsought<br />\noften<br />\nare<br />\nworld,<br />\nmedical centers in the<br />\nMrs. Norris<br />\nby representatives of foreign governments.<br />\nState<br />\nsaid that her office receives \"requests from the<br />\narrange<br />\nto<br />\nus<br />\ng<br />\nDepartment almost every week, requestin<br />\nvisits for representatives of various governments. We also<br />\nreceive requests from groups like the International<br />\nVisitors Service.\" But Hopkins does not make a practice<br />\nof communicating directly with the interested foreign<br />\ngovernments. In fact, Mrs. Norris stressed that,\"We never<br />\nhad any direct contact with the two Chilean doctors or<br />\nwith the Chilean government.\"<br />\nThis Hopkins policy looks innocent enough on the<br />\nsurface, but it contains some disturbing implications. For<br />\nexample, if such requests are received almost every week,<br />\nwhat other kinds of governments have been aided bu the<br />\nJHMI? There is, of course, nothing at all wrong in theory<br />\nwith the University extending its service to other people.<br />\nThat is one of the main functions of a university. But<br />\nsuch assistance must be viewed within the existing social<br />\nrealities. Helping a repressive government such as Chile is<br />\ncertainly quite different than hosting a medical team from<br />\nScandinavia.<br />\nA second cause of concern is the University.s<br />\nrelationship • with the State Department. Mrs. Norris<br />\nthe<br />\nclaimed that there was never any direct contact with<br />\nthe<br />\nwith<br />\nworked<br />\nusually<br />\ny<br />\nChileans, and that. the Universit<br />\nState Department, rather than individual governments, in<br />\nsetting up foregn visitors. But what are the criteria, if any,<br />\nnt. If, as<br />\nfor accepting a request from the State Departme<br />\nby<br />\nrequest<br />\nany<br />\naccepts<br />\nmerely<br />\nit sounds, the University<br />\nnts<br />\ngovernme<br />\nother<br />\nwith<br />\ndeal<br />\nusually<br />\nnot<br />\nState, and does<br />\non an indivual basis, it stands to reason that the<br />\n'University will have relations only with countries that are<br />\nin the good graces of the United States government. This<br />\ntype of complicity produces situations such as the request<br />\nthat the University hosts and advise two representatives of<br />\none of the most repressive regimes in the world-Chile.<br />\nAlthough official explanations for such assistance will<br />\nAs was argued in last week's article, the University can<br />\nassert that any \"technical\" advise given by the university<br />\ndismal record on human<br />\ndoes not connote endorsement of the country's ruling hardly be unaware of Chile's<br />\ndoes it involve itself<br />\nthen,<br />\nWhy,<br />\njustice.<br />\nsocial<br />\ngovernment, the neutrality argument simply does not rights and<br />\nbe speculated that<br />\nleast<br />\nat<br />\nmay<br />\nIt<br />\nregime?<br />\na<br />\nsuch<br />\nwith<br />\nhold. Even if the university is not conscious of any bias<br />\na part in such<br />\nplay<br />\nand prestige<br />\non is part, its actions can be very political. Had the considerations of money<br />\ncan be very<br />\non<br />\nconnecti<br />\nnt<br />\nUniversity decided to aid the Chilean regime(as it still decisions. A State Departme<br />\nlookout for<br />\nthe<br />\non<br />\nalways<br />\nis<br />\nthat<br />\ny<br />\nuniversit<br />\nmight), it would have deliberately discriminated against helpful to a<br />\nntly, the<br />\nConseque<br />\nfunds.<br />\nresearch<br />\nof<br />\nsources<br />\nnew<br />\nthe workers and poor.That is clearly political.<br />\nrequests.<br />\nent<br />\nDepartm<br />\nState<br />\ntoward<br />\nattitude<br />\ny's<br />\nUniversit<br />\nHopkins' past involvement with the Chileans has also<br />\nbe for<br />\nwould<br />\nproblems<br />\nOne possible solution to such<br />\nhad political overtones. In a 1974 grant proposal to the<br />\nforeign<br />\nwith<br />\nties<br />\nits<br />\nof<br />\nall<br />\npublic<br />\nto make<br />\nAgency for International Development (AID), the Medical Johns Hopkins<br />\na move would allow the university<br />\nSuch<br />\nnts.<br />\ngovernme<br />\niary<br />\nas<br />\n\"an<br />\nintermed<br />\nto<br />\nserve<br />\nproposed<br />\nons<br />\nInstituti<br />\ne and criticize Hopkins policies.<br />\nscrutiniz<br />\nto<br />\nty<br />\ncommuni<br />\norganization to further aid objectives by providing\"<br />\nfurther, a committee could be<br />\nstep<br />\na<br />\nidea<br />\nthis<br />\nCarrying<br />\nis<br />\n,<br />\nmedical links \"minimizing government visibility which<br />\nwould not only make public such ties by<br />\nneeded to involve the elite establishment leadership and formed which<br />\nwould also try to determine whether<br />\nto advance the application of fertility management....\" As Hopkins, but<br />\nbe involved at all with certain countries<br />\nshould<br />\nHopkins<br />\nis often the case with such programs in poor countries,<br />\nions.<br />\norganizat<br />\nonal<br />\ninternati<br />\nor<br />\nthe \"target population\" includes the poor and working<br />\nThere is some confusion about the reasons for the<br />\nand the current confusion<br />\nfiasco<br />\nIranian<br />\nyear's<br />\nLast<br />\nby<br />\nwho<br />\nmust<br />\nones<br />\nlimit<br />\ntheir<br />\nfamilies,<br />\nthe<br />\nare<br />\nThey<br />\nUniversity's decision not to host the Chileans. Dr. Ross, classes.<br />\njunta cast doubt on<br />\nthe<br />\nChilean<br />\nwith<br />\nent<br />\nparticipating in programs of fertility management or about involvem<br />\nwho issued the statement to the -protesting groups, has<br />\nshould continue to<br />\nation<br />\ny<br />\nadminist<br />\nUniversit<br />\nthe<br />\nwhether<br />\ninvoluntary sterilization. This is a perfect case of blaming<br />\nnot yet offered any official explanation and since last<br />\nclosed<br />\ndoors. University<br />\nbehind<br />\ndecisions<br />\nsuch<br />\nmake<br />\nare<br />\nrates<br />\nthe victim for the problem. Increased birth<br />\nThursday has remained unavailable for comment. Mrs.<br />\nnts<br />\nnot only casts<br />\ne<br />\ngovernme<br />\nrepressiv<br />\nwith<br />\nent<br />\ninvolvem<br />\nan<br />\nc<br />\nof<br />\nshed<br />\nsocial<br />\nand<br />\neconomi<br />\nfunction<br />\nimpoveri<br />\nlargely a<br />\nNorris, who stated that she made the decision to decline<br />\n, but, more<br />\nty's<br />\nintegrity<br />\nthe<br />\nUniversi<br />\non<br />\ncondition. Among Third World poor populations, infant doubt<br />\nthe State Department's ,request, said that the visit was<br />\nin<br />\ntheir<br />\nnts<br />\nefforts to<br />\naid<br />\nsuch<br />\ngovernme<br />\ncan<br />\ntly,<br />\nimportan<br />\nmortality tends to be high, since there is often a lack of<br />\ncancelled due to scheduling problems. When asked<br />\ncan<br />\nAnd<br />\nthat<br />\nhardly be<br />\ntheir<br />\npeople.<br />\nbrutalize<br />\nand<br />\nexploit<br />\nso<br />\ncare<br />\nfor<br />\nhealth<br />\nthe infant. Because<br />\nproper diet and<br />\nwhether the protests against the visits had influenced the<br />\ny.<br />\nany<br />\nof<br />\nthe<br />\nuniversit<br />\npurpose<br />\ned<br />\nconsider<br />\na<br />\nten<br />\nfor<br />\nso<br />\nyoung,<br />\nplan<br />\ndie<br />\nmay<br />\nfamily<br />\nchildren<br />\nmany<br />\noutcome, she replied, \"I was not aware of any protests<br />\n(Note: There will be a meeting on Monday, March 7, at<br />\non the hope that six of them will grow up so that<br />\nchildren<br />\nsituation<br />\nthe<br />\nwhat<br />\nasking<br />\nme<br />\ncalled<br />\nuntil Dr. Ross' office<br />\npm in Room 2008 of the JHU School ofHygiene to<br />\n5:00<br />\nthey can help earn money for the family. Children also<br />\nwas concerning the visit. Besides, we had by that time<br />\nthe current situation in Chile and the nature of the<br />\ndiscuss<br />\nparents<br />\nserve as the only source of social security for their<br />\nalready determined that no visit was possible.\" It seems,<br />\n•<br />\ny's involvement with the junta.)<br />\nUniversit<br />\nwork.<br />\nto<br />\nold<br />\nwhen they grow too<br />\nthen, that the protests did not have as much effect on the<br /><br />\nBy MARK HERTSGAARD<br />\nedical Institutions' administration<br />\nHopkinsM<br />\nThe Johns<br />\nweek that, due to scheduling<br />\ndecided last<br />\nproblems, it would have to decline a State Department<br />\nrequest to host two representatives of the Chilean<br />\ngovernment. Mrs. J.B. Norris, Director of Public Affairs<br />\nfor the Medical Institution, corrected a previous report by<br />\nstating on Wednesday that, \"We did not issue any<br />\ninvitation. The State Department contacted us and<br />\nrequested us to set up a tour for two doctors from the<br />\nChilean government. After we received the request from<br />\nthe State Department, some preliminary inquiries were<br />\nmade (around the University), but no schedule could be<br />\narranged. We then notified the State Department that we<br />\nwould have to decline its request.\"<br />\n_ It was reported last week that the University had<br />\n• originally agreed to host Dr. Sergio Reyes and Christian<br />\nDonoso, two high-level officials of the military<br />\ndictatorship which rules Chile '• This visit was to have<br />\ntaken place sometime in earch March, but, as they<br />\nreported, the University later rescinded its offer. There<br />\nhave been a number of individuals and groups, including<br />\nthe Medical Committee on Human Rights (MCHR) and<br />\nthe Baltimore-Chile Solidarity Group, which had<br />\nprotested the scheduled visits. Word came last Thursday<br />\nthat Dr. Richard Ross, University Vice-President for the<br />\nHealth Divisions, gave the protesters a verbal guarantee<br />\nthat the visits would not occur. This was reinforced on<br />\nlast Friday with a short written memo addressed to the<br />\ngroups. The protesters were not entirely satisfied, since<br />\nthe memo included neither an explanation for the action<br />\nnor any mention about possible future involvement with<br />\nthe Chilean junta.<br /><br />\nen<br /><br />\nAre<br />\nTin<br />\nMe<br /><br />\nphotos by bruce iaffe<br /><br />\nIt's all right at the Left Bank,in fact it's a<br /><br />\nFrom the outside it doesn't look like<br />\nmuch, certainly not famous. A rather<br />\naged looking margue and well-worn set of<br />\ncloors are all that is visible from the<br />\nstreet, and the imposing set of stairs<br />\nwhich the doors reveal do little to<br />\nimprove the atmosphere. The Famous .<br />\nBallroom must have. Seen better days,<br />\nalthough one is inclined to think that it<br />\nhas always been that way.<br />\n.• •<br />\nNo matter; very few patrons cOme for<br />\nthe architecture. What they come for is<br />\njazz, and that's what they get. There<br />\naren't many places around where you can<br />\nsee a name group .for a mere $5.50 cover<br />\ncharge, with rio hassles, noisy bars, or<br />\nundesired' minimums. You just ,pay your<br />\nmoney, and find, someplace ,to sit down,.<br />\nIf you get there early enoagh, you may<br />\nclaim front row seats and be literally<br />\nwithin spitting distance of the band<br />\nstand. But as anyone-who has ever sat ten<br />\nfeet from the front of Stan Kenton's<br />\nband can tell you, sometimes it's better<br />\nto sit off to the side.<br />\nThis is Baltimore's Left Bank Jazz<br />\nSociety. The Left Bank is not a chit); it<br />\nholds concerts Sunday . afternoons .from<br />\n5:00 to 9:00. and its Charles St. location<br />\n(two doors up from the famed<br />\nChesapeake restaurant, and a block north<br />\nof Penn Station) should assuage the<br />\nparanoid fears of those who see muggers<br />\naround every corner. As for the club's<br />\nclientele, one novice last week remarked<br />\nthat. he was uneasy about going down<br />\nthere until his girl (a regular) chided him.<br />\nsaying he was just \"being a bigot.\" To be<br />\nhonest. this reporter has always felt safer<br />\nin the hallowed halls of the Famous<br />\nBallroom than he has ever felt in the<br />\nLyric. The Left Bank crowd may not<br />\nmake as much as the Symphony<br />\nsubscribers. but they, are more likely to<br />\ntalk to you.<br />\nCame in t his past Sunday to the<br />\nrecorded tenor of Sonny Stitt. Wound up<br />\nsitting with a friend and fellow bassist<br />\nfrom Towson State. there to Marvel over<br /><br />\nthe fabulous fingers of the New York<br />\nJazz<br />\nQuartet's George Mraz. Was introduced to<br />\n\"the number two bassist at Towson,\" and<br />\ntalked while the fabled Mraz did his<br />\nsound check.<br />\n-<br /><br />\nS?95?<br />\n(cc4gas<br />\nAs the lights dimmed across th(<br />\npainted-star sky, we turned our attention<br />\nto the bandstand. Vernon Welsh, Left<br />\nBank's perennial MC, took the mike and<br />\nwelcomed everyone, reminding them of<br />\nthe upcoming concerts, of Sonny Stitt on<br />\nMarch 6, apologizing that Stan Getz had<br />\ncancelled because of a cOncert or<br />\nsomething in New York. With his notes<br />\ntrembling in his hand, you think: Poor<br />\nVernon! God only knows how he does it<br />\neach week, seemingly stricken with a<br /><br />\nSometimes Herbert sounds more like<br />\nGene Ammons than Ammons himself did;<br />\nother times he wields a harmonic sense as<br />\nsharp as Coltrane or George Coleman of<br />\nthe old Miles Davis band.<br />\nThe crowd is obviously pleased. This is<br />\ngood time music, attended to by<br />\ncountless tapping feet and punctuated by<br />\nshouts of \"play it!\" and \"right on!\"<br />\nRoland Hanna announces another tune<br />\nassociated with the old Miles band, All<br />\nBlues. George Mraz starts the lazy<br />\nostinato bassline, with Hanna's trilling,<br />\nchords following, carpetting the entrance<br />\nof Herbert's floating tenor lead. Ritchie<br />\nPratt kicks. things along on the drums,<br />\nbuilding the fire under Hanna's<br />\nshimmering piano until it erupts into the<br />\nmeanest three-four boogie-woogie .you<br />\never heard.<br /><br />\n77_1=<br /><br />\n'watt<br /><br />\ncontinuous case of stage fright. But What<br />\nwould Left Bank be withoutVernon?<br />\nWhen the band has mounted the stage,<br />\nRoland Hanna breaks into a familiar<br />\nintroduction, and Gregory Herbert's<br />\ntenor joins the piano in a swinging romp<br />\nthrough Welkin'. Greg Herbert struts and<br />\nstomps, careening around runs and into<br />\nbent-note exclamations, like shouts of<br />\n\"Amen!\" at a Baptist revival meeting.<br /><br />\nAt intermission, Charles McPhearsoti<br />\nLive in Japan as the patrons walk around,<br />\ngetting another beer, or something more<br />\nsubstantial from the Famous' kitchen<br />\n(chicken, pork barbeque, and so on).<br />\nTalking to Bert, one of the regulars and<br />\nalso a student at Loyola, who missed the<br />\nfirst set. \"Man, they were really<br />\nsmokin'!\" Bert tells of an Andrew White<br />\nconcert in Washington the night before,<br /><br />\ndamn, wish they'd get Andrew Whitehere.<br />\nWander over to get some chips and<br />\nginger ale (sorry, out of orange today).<br />\nand pass Ritchie Pratt talking to some<br />\nfans. Pratt is an amazing man, large and<br />\nBuddha-like, with hands the size of<br />\ncatcher's mitts and a huge smile. Like<br />\nmost musicians who play Left Bank,<br />\nPratt is willing to talk to you, to smile<br />\nmodestly when you say, \"Hey, man, you<br />\nwere great!\" and sign a record jacket.<br />\nWith the second set underway, a blues<br />\nis announced, an original by drummer<br />\nRitchie Pratt. 87th Street, it is called, and<br />\nthe band roars through it. When bassist<br />\nGeorge Mraz begins his solo, the crowd is<br />\nelectrified. Mraz's hands skim across the<br />\nfingerboard with an ease that almost<br />\nmakes the bassists at my table consider<br />\ntaking up something easier, like<br />\ngardening. Shouts of \"play, bassman.<br />\nplay\" punctuate the solo until at its end<br />\nthere is no doubt that Mraz is the best<br />\naround. \"Damn, he makes Stanley Clarke<br />\nlook like a kid,\" murmured one amazed<br />\nbassist.<br />\nFinally, after much hard-boppin' jazz,<br />\nand some lovely vocals by \"our surprise<br />\nguest\" Rikki Bogar, the third and last set<br />\nbegins just before 9:00. When Roland<br />\nHanna announces the last number, there<br />\nis much disappointment, but when the<br />\nband strikes up On the Trail the crowd is<br />\ntoo happy to complain. During George<br />\nMraz's solo someone shouts, \"We gone'<br />\nbe here another hour!\" followed by<br />\nseveral shouts of \"All right!\"<br />\nBut at 9:30, the New York Jazz<br />\nQuartet must break, so they can pack and.<br />\nhead back to the Apple. A few More<br />\nrecord-jackets are signed as the crowd<br />\nfiles out. One photographer, after having<br />\nshot a roll and a half of film looks around<br />\nand says,\"You know,these are<br />\nsome of the nicest people in Baltimore.\"<br />\nYeah, well, that's what the Left Bank is<br />\nall about.<br />\n-- J. D. Considine<br /><br />\nmarch 4, 1977/news-letter/page 5<br /><br />\nCALENDAR *<br />\nARTS CALENDAR * ARTS CALENDAR * ARTS<br />\nFilms<br /><br />\nTheater<br />\nCenter Stage 700 N. Calvert ST., 332-0033. Lillian Hellman's \"Toys in the Attic.\" Through March 6.<br />\nNational Theater 1321 E. St. (Washinton) \"Bully,\" with James Whitmore as Teddy Roosevelt.<br />\nTlrough March 12. Call (302) 872-0466 for further information.<br />\n4rella Stage 6th St. and Maine Ave, SW (Washington.) Lillian Hellman's \"The Autumn Garden.'<br />\nThrough March 6. Call (202) 554-7890 for further information.<br />\nAf,echanic Theater Hopkins Plaza, 727-4103. Liv Ullmann in Jose Quintero's production of Eugene<br />\n0 Neill's \"Anna<br />\nChristie.\"<br />\nEisenhower Theater Kennedy Center (Washington.)\"Annie,\" a new musical based on the comic strip<br />\n_Little Orphan Annie.\" The Mike Nichols production stars Andrea McArdle, Reid Shelton and<br />\nDorothy Loudon. March 5-31. Call (202) 254-3600 for ticket information.<br /><br />\nHoward Community College Little Patuxent Parkway (Columbia.) William Wyler's 'The Best Years<br />\nof Our Lives,\" tonight at 7 pm in the main building. Admission free. Details: 992-4811.<br />\nHealth, Work and Social Change Film Series Johns Hopkins School of Hygiene, Room 1707, on<br />\nMarch 10 at 5:30 pm: \"Healthcaring From Our End of the Speculum,\" a film in which women speak<br />\nabout their experience with the present health care system. Admission is free.<br />\nJohns Hopkins New Political Caucus Remsen One. \"Hearts and Minds\" on March 10, \"Burn\" on<br />\nMarch 11, and \"Battle of Algiers\" on March 12. Admission to the 4 pm show is $.50 and $1.00 for<br />\nthe 7:30 pm show.<br />\nBread and Roses Greenmount and 31st St. Ken Russel's \"Women in Love,\" starrring Glenda Jackson<br />\nand Alan Bates. 7:30 and 10:00 March 4 and 5; midnight show on March 5, $2.00 admission benefit<br />\nfor Bread and Roses.<br /><br />\nNew Political Caucus<br />\n\"Enemies of the People\"<br /><br />\n, rd's Theater 511 Tenth St., NW (Washington.) \"The All Night Strut,\" a look at the music and<br />\nC'°<br />\nclance of the 1930's and 1940's, with revue stars Michael Davis and Barbara Neuman. Through March<br />\n27. Call<br />\n(202)638-2368 for further information.<br />\nTheater Project 45 W. Presto n St. \"Oat of Hand:, life-sized puppet theater performed by Axel<br />\nNg-Gros.<br /><br />\n\"Enemies of the People,\" a film series, will be presented from March 10<br />\nMarch 12 at the Homewood campus. The series is being sponsored by the Johns<br />\nHopkins New Political Caucus, an alternative political group recently formed at the<br />\nUniversity. The films will be shown twice each day in Room 1 of Remsen Hall.<br />\nAfternoon admission is fifty cents, and one dollar in the eVening.<br />\nHearts and Minds, the Academy Award winning film about American involvement in<br />\nVietnam, will kick off the series on Thursday, March 10. The film examines the effect<br />\nof the war on both the Vietnamese people and the American people by presnting<br />\nextensive interviews with government officials and private citizens. Burn!, a film<br />\nconcerning a nineteenth century slave rebellion in the Carribean starring Marlon Brando,<br />\nwill be shown on Friday, March 11. It has been described by Pauline Kael of The New<br />\nYoker as \"the least condescending film ever made about slavery....one that soards with<br />\nthe imaginative forces of art.\" The series will conclude on Saturday, March 12, with<br />\nPontecorvo's award winning film, Battle of Algiers.<br />\nThe New Political Caucus has planned discussion sessions following each evening film<br />\nat Chester's PLace Coffee House, upstairs in the Student Union. Refreshments will be<br />\navailable. Each discussion will be co-led by a faculty member and a student. The<br />\ntentative schedule lists Professor Katherine Verderey of Anthropology as co-leader for<br />\n\"Hearts and Minds,\" Professor Richard Rubinson and Debbi Kelly for \"Burn!\", and<br />\nProfessor Ric Pfeffer as a co-leader for \"Battle of Algiers.\"<br />\nThe New Political Caucus was formed recently as an alternative to the conventional<br />\npolitical groups found on campus. Although the Caucus is not committed to any<br />\nparticular ideology, it is skeptical of the American two-party system and of the social<br />\nand political conditions it creates. The Caucus is planning activities for the rest of the<br />\nsemester and welcomes members of the Baltimore and Hopkins communities to<br />\nparticipate.<br />\n)<br /><br />\nConcerts<br />\nlthnore Symphony Orchestra Lyric Theater, 120 W. Mount Royal Ave., 837-5691. Anthony<br />\ndiBonaventura, pianist, performs Beethoven's \"Emperor\" Concerto tonight at 8:15. Darrold Hunt,<br />\nconductor. Also, Tchaikovsky's Symphony No. 6 and Rossini's \"Thieving Magpie\" overture.<br />\n.<br />\nPh ll<br />\na'etPlna Orchestra Lyric Theater, March 8. The Baltimore premiere of David Amram's \"The<br />\nTrail of<br />\nBeauty.\"<br />\nPea<br />\nthebodY Opera Workshop, Symphony Orchestra and Chorus in Honegger's oratorio, \"Joan of Arc at<br />\nStake.\" Tonight and tomorrow night at 8:30, in the Peabody Concert Hall for the benefit of the<br />\nPeabody Scholarship fund.<br />\nabody's North Hall 1 East Mount Vernon Place. Organ students of Donald Sutherland perform at<br />\ne March 9 noon concert. Free.<br />\nLeft BAnk<br />\nJazz Society 1717 N. Charles St., 945-2266. The Sonny Stitt Quartet on March 6 at 5<br />\nPm. Tickets are $4.50 for members and $5.50 for the general public.<br />\nUnited Methodist Church Charles and Belvedere. Dvorak's \"Stabat Mater,\" at 4:30 pm on<br />\nMarch 6.<br /><br />\nGrace<br /><br />\nenter Forum Old St. Paul's Church, Charles and Saratoga. The Milhaud Trio at 12:30 pm and Sally<br />\nradleY at noon on March 8. Tim Fields, blues, ballad and ragtime, noon, on March 10.<br />\nKing of France Tavern Maryland Inn, Annapolis, 269-0990 from Baltimore. Ethel Ennis, through<br />\nMarch 20. $2.50 cover, no minimum.<br />\n4R Constitution Hall Georgetown, Tuesday, March 8. Muddy Waters, James Cotton, and Johnny<br />\nWinter. $6.50 and $5.50.<br /><br />\nPerhaps you're an wondering why I called you here today. No? Well, I'll<br />\nanyway. This campus is suffering a severe shortage of<br />\ntell you<br />\ngood humor. Do you realize that the second biggest joke on campus<br />\nright now lives in Wilmington?<br />\nBut seriously, folks, those of us concerned about the problem are doing<br />\nsomething about it. What we need is a new source of humor, and there's<br />\none on the way: the HopkinsSatirical Journal!<br />\nThat's right, now you too<br />\ncan write for the magazine<br />\nthe National Lampoon<br />\nlaughed at. This year,<br />\nwe're doing a parody of<br />\nRolling Stone magazine,<br />\nfollowing on the success of<br />\nthe amazingly popular<br />\nDundalk Revue and Out<br />\nTo Lunch. So if you'd like<br />\nto help, or contribute<br />\nsome writing, or just don't<br />\nhave anything to do, drop<br />\na line (or a card- they're<br />\neasier to read) to box<br />\n1069 toda<br /><br />\n‘/)<br /><br />\nCandidates' Forum<br />\nSunday March 13<br />\nLevering<br /><br />\n7:30 pm<br /><br />\nGreat Hall<br /><br />\nCandidates for S.C. Exec. offices will speak r,<br />\nand answer questions /?r<br /><br />\n4<br /><br />\nS.C. Exec Elections<br />\nMarch 14,15,16 (;)<br /><br />\npolling places:<br />\nlibrary, 10-5, 7-9<br />\ndorm snack bar, 9-4<br /><br />\n??/<br /><br />\nbasement Gilman, 9-4 p<br /><br />\nPetitions and MSE Symp. topics due March 6??),<br /><br />\nThere is another way to go...<br />\nTHE FRIDAY<br /><br />\nNEWS-LETTER<br />\nbills<br />\nDown in Annapolis the General Assembly<br />\nhas been<br />\nputting on quite a show of its renowned clear-thin<br />\nking and<br />\nconsistency. While the House gets ready to pass<br />\nits version<br />\nof a drinking age bill, the Senate appears set to appro<br />\nve the<br />\ndecriminalization of marijuana. The former issue<br />\n-- the<br />\nraising of the drinking age -- threatens to create<br />\na wealth of<br />\nproblems for Hopkins and students, and represents<br />\na relapse<br />\ninto short-sightedness that the legislators overc<br />\name three<br />\nyears ago. As for the marijuana bill (S. B. 1054),<br />\nSenators<br />\nneed a good deal of prompting through letter<br />\ns and phone<br />\ncalls to publicly commit themselves to decriminal<br />\nization.<br />\nSpecifically, students can write to an undec<br />\nided Jack<br />\nLapides, 39th District Senat r, and urge him to<br />\nthink a bit<br />\nclearer than most of the Assembly.<br />\nentrance here as a freshman, two<br />\nBlack students were refused the<br />\nright to participate in the<br />\nthe editor:<br />\nproduction of \"The Lion in<br />\nWhen I left Schenectady for Winter.— Last year<br />\na Black<br />\nthe civilized regions of our nation student protested agains<br />\nt what<br />\nI thought that I had heard the<br />\nwas blatant discrimination with<br />\nlast of the old refrain: \"If you<br />\nthe result that the director was<br />\ndon't like it here, why dontcha fired, the<br />\nBarnstormers again<br />\ngo to Russia (where you came issued their<br />\nnebulous and<br />\nfrom.)- Dick Oles' marvelously<br />\nunconvincing commitment to<br />\nclever letter of last Tuesday<br />\nequality of opportunity, and the<br />\nended that illusion.<br />\nauditions were rescheduled. Even<br />\nI had enough of that shit when in her second<br />\nattempt, however,<br />\nI was a kid and I do not want to the<br />\nstudent was unsuccessful.<br />\nhear it anymore. Dicky boy, why<br />\nI have reason to suspect that it<br />\ndon't you go back to shaving the has happe<br />\nned again in the recent<br />\nheads of fencers and forget about auditions for<br />\nroles in the<br />\npolitics. The next time you production<br />\nof \"Antigone.\"<br />\ninclude me in one of your \"weIn the four years of my tenure<br />\nall- know- 's I'll send a letter, in as a student at<br />\nthis university,<br />\nyour name, to Jimmy Carter- and my partic<br />\nipation in student<br />\nthreatening assassination of him events, no group<br />\nhas struck me as<br />\nand the rape of his little more blatan<br />\ntly exclusionary than<br />\ndaughter.<br />\nthe Barnstormers. It is the<br />\nJames A. Harvey<br />\nstandard assumption in some<br />\nTo the editor:<br />\ncircles, that the roles and who<br />\nIn January of 1974, in the will play them has<br />\nusually been<br />\nsecond semester's first issue of decided long before<br />\nhand, and<br />\nthe News-Letter, a Black student that the auditions<br />\nprocess is a<br />\ncharged that he had been<br />\nmere tactical formality. The level<br />\nwillfully and illegally of Black parti<br />\ncipation in<br />\ndiscriminated against during his Barnstormer<br />\nactivities in<br />\nattempt to audition for a role in proportion to total<br />\nparticipation<br />\nthe Barnstormer production of has been so insubs<br />\ntantial as to be<br />\n\"Hedda Gabler.- Subsequent incalculable.<br />\ninvestigajon and interrogation of<br />\nThe theories behind type<br />\nthe director did, in fact, reveal casting and<br />\n\"traditional role<br />\nthat the director had playing\" no longer<br />\nhold up, as<br />\ndiscriminated against the Black the efforts of James<br />\nEarl Jones in<br />\nstudent on the basis of race. It his present<br />\nand previous<br />\nwas his contention that casting a productions of \"King<br />\nLear- well<br />\nBlack in a traditionally white role attest. The sheer limita<br />\ntions upon<br />\nwas inappropriate and forced tin: the number of<br />\nopportunities for<br />\nplay to make statements which students to<br />\nparticipate in<br />\nits content could not support. dramatic endea<br />\nvors on this<br />\nTensions reached such a height in campus demand<br />\nas open and<br />\nthis incident, that the impartial a judgement<br />\nas possible.<br />\nin-tervention of the Dean of Yet, we, as an<br />\nintellectual<br />\nStudents office was necessitated. community, allow this<br />\nsort of<br />\nIt was only through the barbarity tO contin<br />\nue unabated.<br />\nmoderation of the Black<br />\nThe time has come for those<br />\n., Student Union, and an who are truly commi<br />\ntted to an<br />\nassurance from the Barnstormers open atmosphere to stand<br />\nup and<br />\nthat such incidents would not be counted. We<br />\ncan no longer<br />\noccur in the future, that the tolerate elitist groups<br />\npracticing a<br />\nproduction was allowed to left handed sort of exclus<br />\niveness<br />\ncontinue.<br />\nto deny the mass of students<br />\nThis was not the first time it access to the media<br />\nof creative<br />\nhail happened. Previous protests endeavor. The<br />\ntime has come<br />\nof Black students against- the when the<br />\nBarnstormers. and<br />\ndiscriminatory policies practiced<br />\ngroups<br />\nlike<br />\nthem,<br />\nmust be held<br />\nby the Barnstormers fell upon<br />\naccountable for their activities.<br />\ndeaf ears. In the year prior to my<br />\nJ. Michael Endalkachew<br /><br />\nletters<br /><br />\nTo<br /><br />\nBy R.H. WARREN<br />\nAt Colorado College, in Colorado Spring<br />\ns, classes<br />\nare structured in a very different way.<br />\nThe school is<br />\none of a handful of institutions that<br />\nhas a modular<br />\nacademic calendar. Colorado College uses<br />\nthe<br />\n\"Block Plan\" which consists of 3 /<br />\n1<br />\n2-week blocks,<br />\nfive in the fall and four in the spring. There<br />\nare 4<br />\n/<br />\n1<br />\n2-day<br />\nbreaks between blocks.<br />\nThe \"Block Plan\" was developed in the fall<br />\nof<br />\n1970 as part of a routine review of the educat<br />\nional<br />\nprocess by a faculty-student task force.<br />\n\"At that time,\" remarked Professor Glen Brook<br />\ns<br />\nof the Political Science department, \"we<br />\nwere<br />\noperating with the traditional two semesters. Course<br />\nS<br />\n*<br /><br />\n1^<br />\nOf<br />\n:%-*<br />\n.10<br />\n.<br />\ne s.•<br /><br />\nIrak elan:<br />\n.<br /><br />\nssii!;4-11•1111<br />\n-•<br />\n46:11,•4.<br />\n'VIP<br />\np<br /><br />\n•<br /><br />\n.7<br /><br />\n••••<br /><br />\n•<br /><br />\nao<br /><br />\n•<br />\n.<br />\ne<br /><br />\n5MN<br />\nSAT<br />\nFRI<br />\n•<br /><br />\njuggling was getting complicated; field trips and<br />\nclass conflicts presented difficulties. We wanted<br />\ngreater control over the system.\"<br />\nA student will normally take one course each<br />\nblock, going to class five days a week for two to<br />\nthree hours each day. Undergraduates are required<br />\nto take eight blocks per year; 34 blocks necessary<br />\nfor graduation.<br />\nSince the original change in 1970, Colorado<br />\nCollege has instituted variations on the plan. These<br />\ninclude, for example, the \"track system\" where one<br />\nor two courses are taken over a two block period,<br />\nmeeting on alternate days. There are also courses<br /><br />\nwhich last two or three blocks.<br />\nThe modular calendar provides a great variety in<br />\ncourse offerings. It allows the student to totally<br />\nimmerse him/herself in a subject. The system has<br />\nbeen found to be especially useful for<br />\ninterdisciplinary courses taught by several<br />\nprofessors, and for visiting professors. The 3 /<br />\n1<br />\n2-week<br />\nblocks are excellent for field work, such as an<br />\nanthropological dig.<br />\nStudent work schedules are heavy under the<br />\n•'Block Plan.\" One freshman described a typical day<br />\ntor the history course she is taking: 9:30- noon,<br />\nclass; noon-1, lunch; 1-4, reading in the<br />\nlibrary;<br />\n4-5:30, break for shower and dinner; 5:30-9,<br />\nmore<br />\nreading in the library.<br />\nProfessor Brooks explained that the students<br />\n\"can't afford to goof off.\" Work moves along at a<br />\nfairly breathless pace. There is no limit, however, on<br />\nthe number of P/F courses an undergraduate may<br />\ntake.<br />\nMost of the students admit they feel they should<br />\nbe working hard. They enjoy not having to divide<br />\ntheir time between five or six subjects, even though<br />\nthe \"block system\" is a bit \"like cramming every<br />\nnight for three and a half weeks.\"<br />\nThe \"Block PLan\" also has its negative side.<br /><br />\nSchedules for the full academic year must bt<br />\nsubmitted the previous spring. One senior lamented„<br />\nthat if you didn't like your class, \"you're stuck.<br />\nCourse changes are only allowed up to the second ,<br />\nday of class. As the semester wears on, the Werl'',<br />\nbecomes progressively harder, and the student<br />\nbecomes more and more tired. One indication of the<br />\npressure is the almost total exodus every brea<br /><br />\nAll of the students spoken to, had a veil<br />\nenthusiastic attitude towards the program'<br />\n\"Intense\" was the word most often used to describe<br />\nthe blocks, and most found it a better method fel<br />\nunderstanding a subject. One student reported that<br />\nthe system even affected her social life and mood'A<br />\nlab in the science building is a different experience<br />\nthan a studio in the art center. Both are available for<br />\nstudent use throughout the day, since no other class<br />\nwill be needing the room.<br />\nColorado Women's College in Denver, and Mount<br />\nVernon College in Washington, D.C. utilize another<br />\nform of the modular calendar, with only five<br />\nmodules per year-- two in the fall, one in wint<br />\ner<br />\n,<br />\nand two in the spring. Each session is six weeks<br />\nlong, and students take two courses per module.<br />\nThe registrars at all these schools agree that a<br />\nmodular calendar is more complicated ru,<br />\nadminister. There are more grade periods an<br />\nregistration problems. However, each registrar was<br />\nadamant that the program was the best for the<br />\nstudents. They noted that the total number of hours<br />\nspent in class equals, or exceeds that ill the<br />\ntraditional two semester system.<br />\nA big question is whether or not the modular<br />\nsystem increases<br /><br />\nthe retention of information. Some people argue<br />\nthat if you are doing something for a longer time. It<br />\nsinks in better. Students at Colorado College.<br />\nhowever, claim their \"Block Plan\" makes retention<br />\na \"whole lot easier.There are many types of academic calanders, and<br />\nvariations of each, used in universities and colleges<br />\nthroughout the country. The modular system Is<br />\nprobably the least used, and also die least thought<br />\nabout. (Perhaps other University presidents should<br />\ngive it a thought.)<br /><br />\nN<br /><br />\nrateI<br />\nch.\"<br />\n:ond<br />\nfork<br />\nt(<br />\nthe<br /><br />\neiY<br />\nITh<br /><br />\n.ibe<br />\nfor<br />\nhat<br />\n.A<br />\nice<br />\nfor<br />\nass<br /><br />\n!nt<br />\nter<br />\nire<br />\n!r,<br />\nks<br /><br />\non his Commemoration speech, Chris Gray, Mike<br />\not satisfied with our notes<br />\nGiuliano, and I got in line to talk to the great man, hoping for some choice words<br />\nof wisdom. Thanks to his Kentucky connection (and his knowledge of Warren's writing),<br />\nChris engaged Warren in a real convei-sation, not the usual \"I really like your work\"<br />\nreception lines. This, coupled with the honorable Doctor's desire to meet the author ofan<br />\nN-L parody ofJames Dickey, led to an interview at Nichols House the next morning.<br />\nThe interview began with an exchange of autographs -- Dr. Warren got the author's and<br />\nthe author got Dr. Warren's. What follows is Chris Gray's transcription of the great man's<br />\nwords (edited for publication by Gray).<br />\n--Considine<br />\nsaid writing in Greenwich Village. During the summer I'd just listen to people like Edmund Wilson,<br />\nshe<br />\nyear,<br />\nKatharine Anne Porter spoke at Hopkins last<br />\nGiuliano: When<br />\ncannot be taught, but can be learned. As a teacher of many years standing, how does that Miss Porter, and others, just hearing them talk about why so and so's no good.-When I<br />\nwas in graduate school, I'd work like hell when I was there, and then I'd take a weekend<br />\nstatement strike you?<br />\nRPW: I think it's perfectly true. It can be expedited to use a horrible word. There are off now and then, go down to New York and have a little dowsing in real life, in the<br />\nsome short cuts that can be learned. There are some negatives that can be learned. But Village... Something has to give; you just can't study all the time in graduate schoo..<br />\nyou can't make a writer. It's a complex, it's an organic thing, fundamentally. The need is Considine: Does it strike you as an inherent weakness of the university system that they<br />\nthe main thing. The necessity to put things into any art, to make a shape. There's a need. (students) are forced into an academic structure, where they just can't sit around and<br />\nMy son is a sculptor. From the time he was two, he was having tools, or putting things talk, that they have to back everything up?<br />\ntogether with his hands. His hands had to be doing something...But you could see it when RPW: The students have to make it. The students make their lives. They formed informal<br />\nhe was a child, his hands had to be at work on some material. My daughter is a painter. At clubs at Vanderbilt. Vanderbilt; God knows it was not. But the students there would line<br />\nbreakfast, before she went to school, she was drawing or painting colors of some kind on up to buy the first Dial or the first Fugitive (literary publications of the 1920's). It was a<br />\nstudent state of mind. I don't mean every student. But I mean a significant number... You<br />\nthe table top. It was in the hands of both before the time they were two.<br />\ncan't put it off above. It's got to come from within the student s themselves... It's simply<br />\nGray: Before they could consciously decide?<br />\nRPW: There just wasn't any choice. Their hands just couldn't stop. My daughter, when a desire by the student to immerse himself in learning. There's no credit for this, there's<br />\nno degree. It must be a nassion for learning.<br />\nshe was a child, would spend half a day,just trying to draw a picture of her cat.<br />\nSokolow: Did you start writing when you were in<br />\nConsidine: It's really the oldest way of learning.<br />\ngrade school?<br />\nGray: It's the only way.<br />\nRPW: Oh, hell no. I was going to be admiral of the<br />\nRPW: Also, universities are a natural place for it.<br />\nPacific Fleet.<br />\nback to the universities in the sixteenth<br />\nGo<br />\nGray: You were a Kentucky boy who wanted to<br />\nAt Cambridge, the students showed their<br />\ncentury.<br />\nsee the world.<br />\nessays to each other, or to the older heads. It's<br />\nRPW: I wanted to see the world. And I got the<br />\nnatural. You just pass it back and forth and show<br />\nappointment to go to Annapolis when I was<br />\nto older people who have more experience.<br />\nit<br />\nsixteen. And then I had an accident that hurt my<br />\na class, that's a seminar. These writing<br />\nThat's<br />\nsent<br />\nThat<br />\nphysical.<br />\nthe<br />\nvision, and I couldn't pass<br />\nclasses, now, are an honest attempt to try to create<br />\nme to the university.<br />\na natural situation, but they're wrong.<br />\nGray: And then you went down to Vanderbilt (in<br />\nGray: They're contrived from the very start.<br />\nNashville, Tenn.) and met John Crowe Ransom<br />\nRPW: Yes, they.re contrived. In a technological<br />\nand Donald Davidson.<br />\nsociety, you make an effort to create what was<br />\nRPW: Yes, I went there as a chemist. I was<br />\nnatural at one time.<br />\nregistered in chemical engineering. But they taught<br />\nConsidine: The big problem is scaling it all down,<br />\nchemistry by rote...I liked the laboratory. But you<br />\nwhat's uaually a handful of people into<br />\nfrom<br />\ncould never get to the idea; it was all rote.<br />\nthat encompasses hundreds.<br />\nsomething<br />\naccumulating<br />\ninformation.<br />\nGray: It was just<br />\nRPW: Yes...I've resigned from teaching jobs several<br />\nRPW: Accumulating information. And this I found<br />\ntimes for reasons such as over- specialization... but<br />\nboring. And then I happened to have an English<br />\nI've always gone back to it because I missed it so<br />\nteacher, who never tried to be interesting, who<br />\nmuch. Mr. Warren went on to tell us a story about<br />\njust<br />\nanything.<br />\nwas<br />\nHe<br />\nnever persuaded anybody or<br />\nGeneral Lee, which he confirmed from several<br />\na fascinating man. Every day he'd say something<br />\nsources. Lee's rule of conduct, according to<br />\nother<br />\nthat would stick in your mind. Just casually. Well,<br />\nwas:<br />\nWarren<br />\nMr.<br />\nI changed my mind in six weeks. Before I knew it,<br />\nsaid to the little boy: \"Always deny<br />\nLee<br />\nSo<br />\nRPW:<br />\nat seventeen I wanted to be a writer or nothing.<br />\nyourself.\"\\10ne should always deny himself. It's a<br />\nConsidine: Do you think one of the reasons why<br />\ngenerational thing. Just the self-discipline, of a<br />\nso many courses that teach writing are offered is<br />\nDoctor ofLaws R. P. W.<br />\nwhole generation. I heard my father say it. And<br />\njust to keep good writers employed?<br />\nsuch<br />\nagainst<br />\nnot<br />\nI'm<br />\nthing...<br />\ndeny<br />\nI've<br />\nto<br />\nlearned<br />\na<br />\nIt's<br />\nmyself.<br />\nvery<br />\nfunny thing in an age now which is fulfillment...<br />\none<br />\nfor<br />\nit,<br />\nwant<br />\nRPW: I don't .know why. Because students<br />\ncourses. Though it is very new. It didn't happen in my time, you see... It depends on the Be yourself. It's a whole new culture... That difference L so marked.<br />\nteacher. If the teacher has the knack. But most of them don't. There just aren't many Giuliano: You've been described as a regional writer, because all of your novels have a<br />\ngood teachers in the world. There are many incompetent teachers. There are learned men Southern setting. What does the word regional mean to you?<br />\nwho know the material, but not many who have a real vocation, the ones who can make RPW: Well, from the very start I never took the trouble to find out ... You've got to<br />\ncontact with a few or many students. There are not very many of those. I only met four create the regional world, not write from it. If you read Madame Bovary, you know a<br />\nin my whole life. ... Davidson was a great systematic teacher. Ransom, two days out of French village. Now that's a regional novel.<br />\nthe three he'd speak, you might as well\\have been feeding the cows. My, he was just Considine: A lot of people confuse parochialism with regionalism.<br />\nsadistic during those two days. But the third day his mind would catch fire, and you'd see RPW: That's right. The deck of a whaler is a very restricted place. It's a floating region.<br />\na man thinking for forty-five minutes, seeing fresh ideas, and seeing how a mind works. Moby Dick is a regional novel. Hardy is a regional novelist, and deliverately so. I was born<br />\nWell, Willard Farr of California, who I took in a seminar there, had the same quality. And and raised in Kentucky, and that's the region I write about. You've got to point yourself:<br />\nTucker Brooke at Yale, who taught me Shakespeare in graduate school. Well, two \"My God, I can try to make poetry out of the world I know.\" You can see Yeats and<br />\nother poets writing about their own worlds. We are all victims, or beneficiaries, however<br />\nmeetings,he'd be just routine, but the third one he'd catch fire, and you'd see a mind working.<br />\nWhat you said about teaching is so true. Could you tell us why you chose ou chcose to write it, of our earl ima Tes.<br />\nGray:<br />\nto teach, and how it influences your life?<br />\n.<br />\nRPW: Well, I started out teaching just as a way to pay the grocery bill. I knew I couldn't<br />\nmake a living right away, and I knew I had enough self discipline. I love to read, and I<br />\nRobert Penn ,Warren discusses the work of 'James Duckey, as well as the Oxford Book<br />\nlove to talk about what I read. By teaching, you can read a book and talk about it,<br />\nof American Verse.<br />\nwithout being interrupted. I like the human relations very much, and I've always been<br />\n\"Duckey\": What a great ego trip.<br />\nvery fortunate. I've met a number of good students, and peopel I like to be with. But I<br />\nRPW: It made my day.<br />\nproctors<br />\npeople,<br />\nfifty<br />\nand<br />\nhundred<br />\nhate big lecture courses; I had some at Minnesota, a<br />\nwriting<br />\none<br />\ncourse,<br />\nand<br />\nMrs. Warren: Are you still an undergraduate here?<br />\nacademic,<br />\none<br />\ngroups:<br />\nand all, formal lectures. At Yale I had two<br />\nworkshop<br />\nof<br />\nmethod<br />\nthe<br />\nNo, I'm enjoying the endless summer of the eternally unemployed. Former<br />\n\"Duckey\":<br />\nin<br />\nbelieve,<br />\ndon't<br />\nstill<br />\nand<br />\nI<br />\nBut<br />\nbelieved,<br />\nnever<br />\nso called.<br />\nstudent, I got out of here last May.<br />\nstudents reading their papers and then saying: \"Now, Jimmy, what do you think of<br />\nMrs. Warren: Well, it's a marvelous job, a beautiful job.<br />\nthat?\" and \"Suzy, what do you think of that?\" I just don't believe in that. I believe in<br />\nout<br />\nlay<br />\ncan<br />\nyou<br />\nthen<br />\nBecause<br />\n\"Duckey\":<br />\nliterature.<br />\nThank you. I'm glad somebody liked it.(Laughter.)<br />\nusing literature in the classroom. Take a piece of<br />\nthe<br />\nand<br />\non,<br />\ntouch<br />\nto<br />\nwant<br />\nGray:<br />\nyou<br />\nGet<br />\nproblems<br />\nyour<br />\nbook autographed. Inscribe it \"To the author of James Duckey.\"<br />\nthe<br />\non<br />\na program from start to finish, touching<br />\nConsidine: Be sure to write loud and get this all on tape.<br />\nkinds you want to touch on. Spend an hour a week, or two hours a week, talking about<br />\nRPW: To the author of \"James Duckey\"(signing).<br />\nthat one piece. They've all read it so they can discuss it. And then have all the criticism,<br />\n\"Duckey\" Thank you very much.<br />\nface to face. It's a time job, you see. Then the person can talk out his story; you can<br />\nRPW: This is the Oxford Book (of American Verse).<br />\nre-trace the process, you can get inside the story with him.<br />\n\"Duckey\": Old Edition. The New Edition will probably have this much devoted to<br />\nConsidine: So you're dealing more with a reading, than an interpretation.<br />\nyour poetry.<br />\nRPW: No, it's combined. You can criticize, you can say: \"Now look, can't you see the<br />\nRPW: The New Edition is really a bad job. The latest poem of mine that appears there<br />\nway your tracks lie, that that's the wrong perception?\" Or. \"Try it like this. But it's<br />\nwas written in 1963. He (Richard Ellmann, the editor) ignored all my best things;just<br />\npersonal, it's more experimental. You can deal with one person, in a couple of chairs, for<br />\nneglected all the books that were written since '63, and other people feel the same<br />\na period of time, talking about that story. And you know there's no formula for that.<br />\nway. Ultimately, there are some omissions; glaring omissions. He did it with his left<br />\nYou just both try to be intelligent about it. ...Otherwise, you're not covering the main<br />\nhand, got some English assistant of his, teaching at Oxford, to do it for him. I can't<br />\ntopics in a systematic form.<br />\nunderstand it. In the first place, he has no status as a critic at all. He's a first-rate<br />\nGiuliano: What did your friends Katharine Anne Porter and Ford Madox Ford teach you<br />\nscholar, but nobody would think of him as a critic. As a critic he is incompetent. I<br />\nabout prose writing?<br />\nhave no kick; space, you see, and that sort of thing.<br />\nRPW: They weren't teaching classics, they were just sitting around boozing! I didn't meet<br />\nany real fiction writers until 1927, when I was in graduate school. I gave myself a seminar<br /><br />\nA conversation with<br /><br />\nRobert Penn Warren<br /><br />\nAn exthange of plaudits<br /><br />\ne-,<br /><br />\nr,<br /><br />\npage 8/news-letter/march 4, 1977<br /><br />\nJohns Hopkins University<br /><br />\n•-:<br /><br />\nWeekend Wonder Flix<br /><br />\nThe Office of Special Events<br />\npresents<br /><br />\npresents<br />\nDUSTIN HOFFMAN'S BRILLANT PORTRAYAL OF ONE OF<br />\nTHE GREATEST PHILOSOPHER/SATIRISTS OF OUR TIME<br /><br />\nTHE BALTIMORE PERCUSSION ENSEMBLE<br /><br />\n•:Charles Memphis, Director<br /><br />\n\"Lenny\"<br /><br />\n•••<br />\n•:.<br /><br />\nSUNDAY, MARCH 6 - 2 PM<br /><br />\n•:•<br /><br />\n•:-<br /><br />\nSHRIVER HALL AUDITORIUM<br />\nFREE ADMISSION<br /><br />\n•••<br /><br />\n•:.<br /><br />\n•.•<br /><br />\n***<br /><br />\n•••<br />\n••<br /><br />\n•••<br /><br />\nValerie<br />\nPerrine<br /><br />\nThe Office of the Chaplain<br />\n\"The Sunday Experience\"<br />\nPresents<br /><br />\nDr. NORMAN PITTENGER<br /><br />\nDustin<br />\nHoffman<br />\n\"Lenny\"<br /><br />\nFriday,<br />\nSaturday,<br /><br />\nDirector: Bob Fosse<br />\nScreenplay: Julian Barry<br />\nBased on: Play by Julian Barry<br />\nPhotography: Bruce Surtees<br />\nMusic: Miles Davis<br />\nCast: Dustin Hoffman, Valerie Perrine,<br />\nJan Miner, Stanley Beck<br /><br />\nWrofessor and Process Theologian<br />\nKing's College,Cambridge England<br /><br />\nTHEOLOGY AND RELIGION<br /><br />\nMarch 4 Shriver Hall<br />\nMarch 5 L/V Room<br /><br />\n730 &amp; 10:00 MI<br />\nADMISSION $1.00<br /><br />\nSUNDAY,MARCH 6, 11:00 AM<br />\nLISTENING-VIEWING ROOM<br /><br />\nHoltman again asserts his claim to being<br />\ntoday's great character leading man. He<br />\ngives a complex and mercurial performance.<br />\nHe alone makes LENNY worth seeing.<br />\n—Richard Sehickel, Time<br /><br />\nLEVERING HALL<br />\n/<br /><br />\n0<br />\n-<br /><br />\nGa9CcluctzS1mpnium 1917<br />\nsetturdatj,March<br />\nGatjHistOry)<br />\nand\\A./1th members ci<br /><br />\nF<br /><br />\n/<br /><br />\n/<br /><br />\n/<br /><br />\n/<br /><br />\nF<br /><br />\n/<br /><br />\n/<br /><br />\niJIiMrg000000<br /><br />\n5_00<br /><br />\nSenior Class Film Series<br />\npresents<br /><br />\n\"A tough-nosed, no-nonsense, gutsy look<br />\nat the underbelly of America as it existed<br />\nback in the 30's. A fine picture.\"<br />\n-JEFFREY LYONS. CBS<br /><br />\nti more,&amp;al Alli ance,<br />\n1:1/ Room<br />\n1.14 ort,314•1<br />\nSuftdal,March(cs<br />\nTheiGati Movement with Dr Franklin<br />\nKaniltn1 avvci me\"bers of B.G.A.<br />\nGarrett RoovnASE L brat-113PM<br />\nMew Otieans,1933.<br />\nIn those days words didn't buy much.<br /><br />\nMonda Marcie%<br /><br />\nklorrn6v1 pi+tip<br />\nKinc&amp;G)11¢4<br /><br />\n-bleb<br /><br />\nPIMP MOS<br /><br />\nbd<br /><br />\n&amp;rCtRcvy,MLbrartj,1PM<br />\nsponsomd by<br />\ntif)cj.H LI &amp;a Ca us<br /><br />\nCO<br /><br />\nJILL iR[LAND .51- a-rim MARTIN<br />\nCodu.••••<br /><br />\nFRi. &amp; SAT.<br /><br />\nMARcli 4 &amp; 5<br /><br />\nShaffer 3<br /><br />\n8:00 8 10:00<br />\nAdmissioN $1.00<br />\nSENIORS<br /><br />\n5.75<br /><br />\n55<br /><br />\nmarch 4, 1977/news-letter/page nine<br /><br />\nSpRiNvimE<br /><br />\nAT ThE STACHUM (ILOUNgE)<br /><br />\nBaseballs are already being tossed about by major-league arms in Floridian and Arizonan climes, the<br />\nusual signal that another month will bring pennant-hungry legions down 33rd Street. This season, though,<br />\nthe troops will be thinner and the expectations smaller, as most scribes rate the Birds a bare broken-bat<br />\nsingle ahead of the Bluejays (the new Toronto team, not your Hopkins ten.)<br /><br />\nBefore<br />\nand after the forthcoming 4-2 and 3-1 losing battles, however, the bars along Greenmount<br />\nAvenue will be full of the usual number of thirsty patrons. Foremost among these watering holes for<br />\nOriole fans is the aptly-named Stadium Lounge, just a five-minute stroll from Memorial's entrance gates.<br />\nDecor inside the Stadium Lounge plays up to the rabid sports beer-guzzler: oil portraits of former and<br />\nfading Baltimore legends, such as Brooksie, Johnny U., and Boog Powell(Reggie blew in and out of town<br />\nso fast the artist didn't have time to choose his brushes); an aerial photo of Memorial Stadium,<br />\npresumably taken by a sober<br />\nDonald Kroner -and autographed ceiling tiles -- one dollar immortalizes<br />\nnames from the diamond greats to the Canonsburg Softball All-Stars. A couple tables have electronic<br />\ngames inset in them, a good way to recoup bets lost at the ballpark. The jukebox, though, doesn't deserve<br />\na quarter to scratch out a pair of dusty 45's.<br />\nThe Stadium Lounge boasts the best-stocked bar on Greenmount, but-the cost of the liquor shows it.<br />\nStick to the forty cent drafts, served in classy highball glasses. As for food, the two staples are stacked<br />\nham and cheese and Reubens<br /><br />\nloin<br /><br />\nSandwiches<br />\nthat have over the years decreased from a once-incredibie size<br />\nwhile the prices increased. (A big Bird win sometimes inspires the kitchen to return to its former<br />\noverwhelming standards.) Likewise, the Thursday shrimp night.has fallen on hard times parallel to the O's<br />\nfate: a smaller offering,and more expensive. Seems everyone's headed for a bad season along 33rd.<br />\nDon't let these warnings deter the bar-and-ballpark goer, however; nor should the Stadium Lounge's<br />\nannoying practice of carding students halt the serious springtime fan. Baltimoreans have the instinctive<br />\nknowled e that when the Birds come north, it's time to wander east to Greenmount and 34th.<br /><br />\nfoREigN campus<br />\nNOTE of ThE WEEk<br /><br />\nCHILE:<br />\nThe U.S. Department of State recently requested that Ji-EI sponsor<br />\nthe visit of two high level officials representing the Chilean<br />\ndictatorship.<br /><br />\n•••IR WO<br />\n•<br />\n•<br /><br />\nIn reaction to the anticipated visit opposition was<br /><br />\nLe Department de Langues<br />\nRomanes a le plaisir dc vous inviter<br />\na une conference avec diapositives<br />\ngoing on in Chile, and why this opposition was raised.<br />\nsur la France le mercredi, 8 mars a<br />\n11 heures au L &amp; V Room. (Ste<br />\nRoland Husson! Call \\7228 for a<br />\ngood time!! And don't forget that<br />\nH-Club Beach Blanket Bingo begins<br />\nN1arc1t 7 from 1-3 at the Athletic<br />\n--- a documentary about human rights in Chile, narrate'<br />\nc.'enter: cost $12.00 Check it out!<br />\nby<br />\nprison<br />\ninternational<br />\nby 2 political prisoner's released from<br />\nHey Grandma Levin!!)<br />\npressure.<br />\nvoiced within and outside the Hopkins' community. The visit has now<br />\nbeen cancelled. Come to this meeting to find out more about what's<br /><br />\n\".<br /><br />\n\"0<br /><br />\n000<br /><br />\n“.<br /><br />\n••••<br /><br />\n•<br /><br />\n•••.•:•. ••:•:.. •••••• •<br /><br />\nInterested in planning<br />\nor learning about<br /><br />\nFILM - \"To the People of the World\"<br /><br />\nFORUM -<br /><br />\nWOMEN'S STUDIES<br /><br />\nWith speakers from the International Chile<br />\nSolidarity movement and members of the Hopkins<br />\ncommunity.<br /><br />\non campus?<br /><br />\nMONDAY<br /><br />\nCome to a meeting!<br />\nMonday March 7<br /><br />\n3/7<br /><br />\n5:00 PM.<br /><br />\nSchool of Hygiene, - Room<br /><br />\n2008<br /><br />\nVERY SINCERE MEDICAL<br />\nSTUDENT, Jewish, age 26, seeks a I<br />\nsincere, well-educated, well-adjusted '<br />\nyoung woman of good character. ,<br />\nObject: friendship andi<br />\ncompanionship possibly leading to<br />\nmarriage. Please reply to Box 5936,<br />\nPikesville, Maryland 21208.<br /><br />\nSPANISH by experieseed sabstai<br />\nWhy do U.S. academic institutions advise governments which disreEar<br /><br />\ntaacNers -<br /><br />\nAS Ionia. ail morn.<br /><br />\nthe health and welfare-of their people?<br />\nFEMALE ROOMMATE mutisrrE<br />\nshare unfurnished two bedroo<br /><br />\nBring your dinner!<br /><br />\nto<br /><br />\nWhat is the effect of the Chilean government's move toward a profit<br />\napartment with kitchen, bath an<br />\noriented medical system on the health status of the Chilean people? living room. Located one bloc<br /><br />\n6 pm<br />\nLevering Cafeteria<br /><br />\nWhy aren't Hopkins' ties with all foreign gov-rnments made public?<br /><br />\nfrom Peabody Conservatory<br />\ni $112.50 (electric not included pe<br />\nI month. 685-3091 Late evenings.<br />\nGentleman<br /><br />\n..:•:•• .-:•:-..-:-:••<br />\n11<br /><br />\n'Bobby .Franks was snotty.<br />\nJOHN GACHBOOKSHOP<br />\nBALTIMORE'S LARGEST<br />\nUSED BOOKSTORES<br /><br />\nL.<br /><br />\n\"NNW Am..41111. Am..410.<br /><br />\nBIERVBES OPPORTUNffY<br /><br />\nStuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.339A<br />\n310 Franklin Street<br />\nRoston Mass.<br />\n0<br /><br />\nMIAMI<br /><br />\nto<br /><br />\nNew<br /><br />\ncalculators<br />\n20-40% OFF<br />\nSR-51 II<br /><br />\n3322 Greenmount Ave.<br />\n467-4344<br />\nUSED AND RARE<br />\nOLD AND OUT-OF-PRINT<br /><br />\ndriving<br /><br />\nMarch 10 -15th, willtake<br />\nb<br />\nSponsored by: Baltimore-Chile. Solidarity group &amp; Kedical Committee for one passenger Share gas only. Mutual references - 338-1789.<br />\nHuman Rights<br />\nP.O.B0:-, 1194, Bait. 21203<br />\n327-202 or 338-0750<br />\nP.O. Box 4394<br />\nBait. 21223, 467-0940<br />\n.1111110.-olallio alas- .11ii. .111M. ..cmo. .11010. .111/.<br />\nl(.:11 1 thru .MARCii 12<br />\nBruce<br /><br />\n•-:<br />\n..<br /><br />\n$53.50<br /><br />\nU 1LF v4,0'<br /><br />\nLIVE! ON STAGE!<br />\nTHE 50's COME TO LIFE!<br /><br />\nWW1<br />\n,<br />\n.<br /><br />\nneingest<br />\nda- in.towd<br />\nshow<br /><br />\nUnique<br />\nYour<br />\nJHU<br /><br />\nMIANNA A<br /><br />\nCampus<br />\n-<br /><br />\nPride!<br /><br />\nBus. Anal°<br /><br />\n$33.50<br />\nTEXAS INSTRUMENTS<br /><br />\nREBATE<br />\nSR-56 S83.50<br />\nPius<br />\n$10.00 Rebate<br /><br />\n581-52 $191.95<br />\nPlus Rebate of<br />\n$59.90 in Libraries<br /><br />\n$19.95<br />\nSR-51 II $53.50 TI-30<br />\n$31.95 TI-1600 $19.95<br />\nSR-40<br />\nPC 100 $165.50 TI-1650 $23.50<br />\nTI Business Analyst $33.50<br /><br />\n10 DAY FREE TRIAL<br />\nAdd $2.00 shopping. Md., res. add 4% tax<br />\nFor immediate C.0.D shipment phone:<br />\n301-428-0099 OR Send payment to.<br /><br />\nW<br /><br />\nashington Calculators<br />\n5538<br />\nROCKVILLE. MARYLAND 20855<br /><br />\nP 0 BOX<br /><br />\nSend today. A profile-postcard with<br />\nmany superb views on one card.<br /><br />\nCHARGE TICKETS<br />\nBY TELEPHONE WITH<br />\nYOUR CREDIT CARD.<br />\nPhone (301)727-4103<br />\nTickets available at<br />\nall Ticketron outlets.<br /><br />\nTHE NEW<br />\nMECHANIC<br /><br />\n'think! Think more often of your)<br />\nrelatives and friends; drop them a<br />\nline; they will admire and treasures<br />\nyour pride! Frame one for yourself!<br />\nON SALE AT YOUR<br />\nCAMPUS BOOK-STORE<br /><br />\nI<br /><br />\nTHE DRAMATIC EVENT<br />\nOF THE SEASON<br /><br />\nLIU ULLMANN.<br />\nANNA CHRISTIE<br />\nCHARGE TICKETS BY TELEPHONE<br />\nWITH YOUR CREDIT CARD<br />\nPhone(361)727-4103<br />\n1,<br /><br />\niiitli.ts<br /><br />\n'FILE NEU'<br />\nMECHANIC<br /><br />\nMorris A. Mechanic Theatre<br />\nHopkins Plaza, Baltimore<br /><br />\nMorris A Mechanic Theatre<br />\n\"<br />\n4.11M. .1•1111.<br /><br />\npage 10/news-letter/march 4, 1977<br />\n.* *<br /><br />\n***<br /><br />\n* *<br /><br />\n* * * *<br /><br />\nLIKE TO HUSTLE?<br /><br />\nEMPLOYMENT INTERVIEWS AT THE PLACEMENT BUREAU<br />\nThe following organizations will be interviewing interested students at the Placement Bureau, Room 135, Garland<br />\nHall, during the eoming weeks. Students nearing graduation who will be seekin'g full-time, permanent employment<br />\nare encouraged to come to the Placement Bureau to schedule interviews and to obtain information about<br />\nemployment opportunities.<br /><br />\nN-L needs more ads<br />\nHeavy cut on the action!<br />\nContact us at 338-7647<br />\n6<br />\naaaaaaaaaaaaaaa<br /><br />\naaa******** a* aaa<br /><br />\n13111s<br />\nUnivesity Sandwich Shame and Deft<br />\nAll Lump Crab Cakes<br />\nGenuine Kosher Corned Beef<br />\nDelicious Roast Beef<br />\nVirginia Baked Ham<br />\nVarious Co/<br />\n1<br />\n41 Cuts<br />\nCheese (Swiss, Provolone, Muenster)<br />\nKosher Hot Dogs<br />\nCatering<br />\nParty Trays(special order)<br />\nPizza<br />\nHome Made Dessert (Cheese Cake)<br />\nIce Cream<br />\nSelect Grocery Items<br />\nPlants<br /><br />\nRESTAURANT &amp; CARRY OUT<br />\nPlississ 4167-6262<br />\nUNIVERSITY PARKWAY<br />\nM - Fri: 9:30- 7:00<br />\nAT ST. PAUL.<br />\nSat: 9:30 - 2:00<br />\n,LOINIY. uNneasonv OM APTS.<br />\nClosed Sundays<br />\nFREE SODA WITH THIS Al) AND<br />\nPURCHASE OF $1.00<br /><br />\nRpoieE in THE LAMB<br />\nby Benjamin Britten_<br /><br />\nGOD<br />\nCUATED<br />\nby -H. Wctorci Dathes<br />\nSunda_y afternoon—<br /><br />\nmcn<br /><br />\n6<br /><br />\n0<br />\n6<br />\n6<br />\n6<br />\n6<br />\n0<br /><br />\nTuesday, March 8<br />\nEquitable Trust Company<br />\nSocial Security Admin.<br />\nWednesday, March 9<br />\nComputer Sciences Corp.-Systems Division<br />\nComputer Sciences Corp.-Systems Sciences Div.<br />\nU.S. Dept. of Commerce-Bureau of the Census<br />\nThursday, March 10<br />\nU.S. Fidelity &amp; Guaranty Co.<br />\nAir Force Recruiting Group<br />\nIIT Research Institute<br /><br />\nThe<br />\nIllerig<br />\nThis Is a cryptogram,a form of code language,<br />\nwhere letters of the alphabet stand for other<br />\nletters of the alphabet. For instance,the words<br />\n\"A CAT\" in a cryptogram might be \"Q TQL;'<br /><br />\n6th — 4:30<br /><br />\na6<br /><br />\nTuesday, March 15<br />\nMaryland National Bank<br />\nBurroughs Wellcome Co.<br />\nWednesday, March 16<br />\nMotorola, Inc.<br />\nCapital Area Personnel Services<br />\nOffice-Navy (CAPSON)<br />\nThursday, March 17<br />\nACTION--Peace Corps &amp; VISTA<br />\nFriday, March 18<br />\nACTION--Peace Corps &amp; VISTA<br /><br />\nthe \"Q\" always standing for \"A;' the T- for -C.<br />\n:<br />\nand the \"I.: for \"T Your challenge is to break the<br />\ncode of the cryptogram below,and discover its<br />\nhidden message.<br /><br />\nU1-11\\)EISITV BaPTIST<br />\n@HUP,CH<br /><br />\n3501 11.. OHAR,LES ST.<br /><br />\n_Performaci<br />\nC-Ne CHLI1WH S<br />\nI SIXT9 VOICE CHOIR,,<br />\nw LEA. soloists<br /><br />\nDiAne LICHTErIBERCER-5.pr,e•ro<br />\nKevin King JECIrthE<br />\nJOSEPH PEARS011-Bordonl<br />\ncle..ecleal by<br />\n911,:nisler<br /><br />\nWILL1Fim PCIR,TRIDGC<br /><br />\n9ffasic- Organist<br /><br />\nPUBLIC COITIALLU II1VITED<br /><br />\nPUB<br />\n.h.......ire.Mir.eranaMort.r..:WW\"........ton.M.....:\"..<br /><br />\nM BSIZT<br />\nECIO VJWNCJOH<br />\nMZ VWUOISZD CIRF:<br />\n\"KT RISWG LIZ LIK ZMFT<br />\nZJOT EIC ESCZDTC HTMCRD<br />\nIC RILHJGTCMZJIL,ISC<br />\nQJRZSMWH ATJLN OSRD<br />\nFIVTLZ, THVTRJMWWU<br /><br />\nc.<br />\n(o) F I LM FESTIVAL<br />\n• INCLUDiNG '1 FIELDS<br />\nE<br /><br />\nISC ATTCT\"<br /><br />\nTHREE S<br /><br />\nWhen there's a challenge,<br />\nquality makes the difference.<br /><br />\n,<br />\nGFOUCH°<br /><br />\nHARP°<br /><br />\nAllgANDW<br /><br />\n71-IE 11/113X BRos<br /><br />\nAlt<br />\no MARCM<br />\nGLASS<br />\nPAVILLION<br /><br />\nt:00<br /><br />\nTO<br /><br />\n// PM<br /><br />\nAMISS ION 5,C4 - CHEAP BEERAgfcEORN<br /><br />\nWe hope you have some fun with the challenge.<br />\nThere's another challenge we'd like to offer you, too.<br />\nThe Pabst challenge:<br />\nWe welcome the chance to prove the quality of<br />\nour beer. We challenge you to taste and compare<br />\nPabst Blue Ribbon to any other premium beer. You'll<br />\nlike Pabst better. Blue Ribbon quality means the best<br />\ntasting beer you can get. Since 1844 it always has.<br /><br />\nPABST. Since 1844.The quality has always come through.<br />\nC1977 PABST BREWING COMPANY Milwaukee Ws Peorta Hekahts Ill Newark<br />\nNJ Los Angeles Calif f • ,..org,a<br />\n38330 Hno A11VID3dS3 IN3dS HDGIN ON138 sivnioin ano NOI1V11301SNOD II<br />\nF138V3S El3H18nd tiOd 3VVII JAVI MON ION crinoo 3M &gt;100EI<br />\n1-11110INAld 1v SwiLiOlid 0408d 310110 V uounl.S<br /><br />\nOn the Road:<br />\nBluejay Hoopsters<br />\nBag it again....<br />\nBy DAVID KRAUS<br />\nOn February 18, the Blue Jay Basketball team travelled<br />\nto Washington College to play an important MAC game.<br />\nFor an account of that game, see the News-Letter of<br />\nFebruary 22.<br />\nThree-thirty. Most of the team has gathered in the<br />\nAthletic Center lobby. The bus is scheduled to leave in<br />\nfifteen minutes, but it hasn't arrived yet.<br />\nMike Phipps, the leading scorer, sits on a bench,<br />\ndrinking a soda, talking to assistant coach Al Robinson.<br />\nPhipps didn't play in the most recent game- he was sickand he still doesn't look good.<br />\nCoach Gary Rupert takes out a cigarette and lights it.<br />\nHe takes a few puffs and then walks into the offices and<br />\npicks up a telephone.<br />\nThree-forty. We're scheduled to leave in five minutes,<br />\nbut the bus still hasn't arrived. Rupert walks to the door,<br />\nstares outside for a few minutes, then walks out onto the<br />\nfront steps.<br />\nJV coach Marshall Turner walks to the door that<br />\nRupert just walked through, and stares out for a minute.<br />\nOutside, Lovallo and Dean Uhler talk on the steps.<br />\nLovallo is wearing an off-white sport coat, brown pants,<br />\nand white Adidas track shoes.<br />\nOn a separate part of the steps, Rupert smokes another<br />\ncigarette.<br />\nUhler walks back inside and picks up a copy of the<br />\nNews-Letter and begins to read it.<br />\n.Rupert comes back in. Two of his young sons are<br />\ncoming on the trip and have been running around the<br />\nlobby. One comes up to his father and talks to him; but<br />\nthe Coach doesn't seem to be listening.<br />\nThree fifty-one. The bus arrives. There is a mass exodus<br />\nfrom the lobby.<br />\nMost of the team moves toward the back of the bus. By<br />\nthe time everyone is seated, there are very few places left.<br />\nRupert's sons take the front seat. The coach sits in<br />\nback of them next to Brian Goodman, the team manager.<br />\nRupert looks toward the back and sees Raymond Plack<br />\nstanding up.<br />\n\"Sit down, Ray\" and Plack finds a seat.<br />\nRupert lights up a cigarette.<br />\nBob Babb, the assistant trainer and an assistant coach<br />\nof sorts, is sitting across the aisle from me and see me<br />\nwriting. He reads the last entry and realizes what I'm<br />\ndoing.<br />\n\"If you write down each time the Coach smokes a<br />\ncigarette,\" he says, \"you'll be writing that all night.\"<br />\nFour-ten. We're still in the city. The bus is very quiet.<br />\nMost of the team members are reading.<br />\nMany are reading the News-Letter. Dan Kopcza is<br />\nreading The Evening Sun. Brian Gapsis, sitting next to me,<br />\nis reading a book entitled How to Buy Stocks .<br />\nFour-fifteen. Brian Goodman suggests playing the letter<br />\ngame. There's not that much interest, but he finally<br />\nrounds up Rupert, Robinson and Babb to play. I don't<br />\nknow what it is, so I look over Babb's shoulder.<br />\nIt's not too difficult. Someone says a phrase, \"Johns<br />\nHopkins University\" for example, and on a piece of paper<br />\nyou spell that phrase down the side of the paper, the \"J\".<br />\non the first line, the \"0\" on the second line and so on.<br />\nSomeone then says a second phrase of an equal number of<br />\nletters, \"the bus goes down the trail,\" for example, and<br />\nyou write that on the paper next to the first phrase in a<br />\nsimilar manner.<br />\nWe play several rounds. Each lasts about fifteen<br />\nminutes.<br />\nFive o'clock. We start a fourth round. The players have<br />\nchanged. Babb has fallen asleep and John Finston has now<br />\njoined in.<br />\nFive-twenty-five. We've stopped playing and the bus is<br />\nstill very quiet. Rupert is sitting on the front seat and one<br />\nof his sons is sleeping on his shoulder.<br />\nAl Robinson is in the back of the bus talking to Dean<br />\nUhler and several others.<br />\nBrian Gapsis leans forward and asks Marshall Turner<br />\nhow much farther. Not too far.<br />\nFive-forty. Bob Babb and Dave Emala, who have been<br />\nasleep,_ are woken by Brian Goodman. They aren't happy.<br />\nFive-fifty. We arrive at Washington College. Rupert<br /><br />\nsmoke 'em,<br />\nJays!<br /><br />\nsmokes a cigarette. Marshall Turner announces that the<br />\nJV game is in half an hour.<br />\nEveryone moves toward the locker room. There's a line<br />\nin the bathroom.<br />\nSix o'clock. A group heads to the sub shop. Where is it?<br />\nUp the block.<br />\n\"I hope around here up the block doesn't mean five<br />\nmiles,\" David Nagelsberg adds.<br />\nI drop back and walk with Mike Phipps and Duey<br />\nLevine. Passing one of the buildings, we hear a scream.<br />\n\"The natives are restless,\" I comment.<br />\nThe talk turns to Washington College and what it's<br />\nprobably like. It's pretty much out in the middle of<br />\nnowhere. Yeah, they probably do nothing but drink. You<br />\ncould probably make a fortune selling drugs.<br />\nWe pass a large gassy area in front of a building.<br />\nSuddenly, someone in a car roars onto the grass and<br />\nproceeds to alternately speed up and gun his brakes in an<br />\nattempt to spin out. He is only partially successful.<br />\nMike Phipps doesn't look or sound good. He is<br />\ncoughing fairly frequently. He says that he had a<br />\ntemperature of 103 on Tuesday, but now he feels alright.<br />\nSix-ten. We get to the sub shop. There's a pizza place<br />\nnext door and the other group has gone in there. Phipps,<br />\nLevine and I decide to get subs and take them back and<br />\neat them at the gym.<br />\nIt doesn't take too long for the subs to be made and we<br />\nbegin to walk back. The conversation of the return trip is<br />\nof fraternities and rush parties.<br />\nSix-thrity. We get back to the gym with our food.<br />\nRupert takes one look at us and tells us to go downstairs<br />\nto eat. We walk downstairs and decide to eat in the locker<br />\nroom, but it's locked.<br />\nSix-fifty. We finish eating and walk upstairs to watch<br />\nthe JV game. The stands are almost empty.<br />\nThe varsity team is spread out through the stands.<br />\nPhipps and Levine are sitting at one end. Al Robinson and<br />\nBrian Gapsis are talking at the opposite end. Somewhere<br />\nin the middle, Dean Uhler, John Finston and Kevin Kabat<br />\nare sitting- still in the same place as they were an hour<br />\nbefore. Kopcza and Lovallo are sitting nearby.<br />\nSix-fifty-five. Halftime for the JV game. Hopkins is<br />\nlosing 44-35. Coach Rupert's sons spend the halftime on<br />\nthe basketball floor shooting baskets.<br />\nSeven-ten. Halftime ends. Kabat and Uhler go<br />\ndownstairs to get ready for the game. The varsity game<br />\nwill begin twenty minutes after the JV game ends- which<br />\nmeans in about an hour.<br />\nSeven-fifteen. Nagelberg and Plack arrive back from<br />\ndinner. The whole team now goes downstairs to change.<br />\nSeven-twenty-five. Rupert is still upstairs. He smokes a<br />\ncigarette.<br />\nSeven-thirty. The team is in the locker room and all the<br />\nplayers have changed. They are getting ready for the<br />\ngame.<br />\nAndy Scheinfeld is doing stretching exercises. Randy<br />\nLovallo is making sure his thigh is alright. Bob Babb, the<br />\ntrainer, is walking around giving heat foam treatments to<br />\nvarious team members. Mike Phipps is sitting in a cornerhe still doesn't look like he's 100%.<br />\nThere is a small blackboard hanging on the back of the<br />\ndoor. In one corner, someone has written JHU=Control<br />\nand Wash=Kaos. Rupert moves to the blackboard and<br />\nbegins his pre-game speech.<br />\nThe coach talks about the offensive strategy. The team<br />\nwill try to get the ball down low to Scheinfeld anytime<br />\nthey can- he'll probably be covered by someone small.<br />\nThe defensive assignments are run through. The coach<br />\nemphasizes that \"we can't let them have second and third<br />\nshots.\"<br />\nRupert then discusses what he thinks the keys to the<br />\ngame will be- intensity and how JHU does on the boards.<br />\nHe then reminds the team that Hopkins was beating<br />\nWashington by seven at halftime earlier in the season and<br />\nlost the game. He finishes by stating that the Jays have<br />\nmore talent than Washington. No one needs to be<br />\nreminded of the game's importance.<br />\nSeven-fifty. The JV game is over- Hopkins has lost. The<br />\nvarsity team heads upstairs.<br />\nRupert stays downstairs in the hallway for a minute<br />\ntalking with Al Robinson. The coach smokes a cigarette.<br />\nEight. Rupert comes upstairs.<br />\nEight-nine. The game starts.<br />\nHalftime. Hopkins is leading 38-35.<br /><br />\nIn the hallway outside the locker room,Rupert smokes<br />\na cigarette.<br />\nInside, the team is quiet despite the fact that they are<br />\nin the lead. There's some small talk about the reffing (or<br />\nlack of it). The players give suggestions to each other.<br />\n\"The guy in the high post takes alot of turn-arounds.\"<br />\nRupert comes in and talks to the team. He likes the<br />\nway the offense has been running- \"we're doing what we<br />\nwantThe team has been concentrating, but needs to<br />\nconcentrate more on foul shots- the team is4-12 from the<br />\nline.<br />\nRupert emphasizes that the key to the second half will<br />\nbe defense and how well Hopkins handles the ball.<br />\nEight-fifty-five. The team heads upstairs. The coach<br />\nstays downstairs and smokes a cigarette.<br />\nNine-one. The second half begins.<br />\nNine-fifty-six. The game is over. Hopkins has won<br />\n82-80, in overtime.<br />\nThe locker room, obviously, is a happy place. There is a<br />\ngreat deal of hand-shaking, back-slapping, etc. However,<br />\nbesides that, the scene is rather subdued.<br />\nIn the background someone yells, \"If we keep<br />\nwinning, we keep playing.\" That seems to sum up the<br />\nteam feeling -- despite a tiring, emotionally-draining<br />\nvictory, all the team has gained is a chance to play a<br />\nplay-off game to see whether they'll play in the playoffs.<br />\nAl Robinson is talking about the victory. Overtime<br />\nwins are the best kind, he claims.<br />\nJohn Finston is sitting in a corner talking with Phil<br />\nHersh of The Evening Sun. Finston has an excellent game,<br />\nscoring 22 points. Hersh finishes his interview with<br />\nFinston and walks over to Andy Scheinfeld. Scheinfeld<br />\nwas the team's leading scorer with 25 points. For<br />\nScheinfeld and Finston, the team's co-captains, it was<br />\ntheir final regular season game.<br />\nMike Phipps didn't play. He dresses, without having<br />\nshowered, and is the first player to leave the locker room.<br />\nTen-fifteen. Rupert is upstairs smoking and discussing<br />\narrangements for the playoff game. The team begins to<br />\ncome up. Soon, everyone is in the gym and Rupert<br />\nannounces that it's time to head out to the bus.<br />\nTen-thirty. Everyone is on the bus. Coach Rupert<br />\nannounces that the bus will stop at the nearest beer<br />\ngarden. There is a loud cheer. He praises the team for the<br />\nvictory.<br />\nThere is a great deal of laughing from the back of the<br />\nbus.<br />\nIn comparison, the front of the bus is quiet. Randy<br />\nLovallo, who hadn't played, is reading. Coach Rupert<br />\nstands in the front of the bus and looks out the<br />\nwindshield. He turns and talks to Al Robinson.<br />\nTen-forty. The bus stops at a store to buy beer.<br />\nFinston, Coach Rupert and the bus driver go in to buy the<br />\nbeer.<br />\nThe back of the bus remains noisy. Duey Levine leads<br />\nthe conversation. Robert Kluttz and Ray Plack get a little<br />\nrambunctious. Andy Scheinfeld gets up and quiets them<br />\ndown.<br />\nTen-fifty. The refreshments arrive and are quickly<br />\npassed around. Scheinfeld, a non-beer drinker, has a soda.<br />\nBrian Gapsis tries to sleep.<br />\nEleven. The bus is still very lively- there's singing<br />\ncoming from the back. Ray Plack, looking for a beer,<br />\nheads towards the back. He returns with a bottle and a<br />\nsmile.<br />\nEleven-ten. The beer has run out.<br /><br />\n-4..% kvp.111/1v• -ou •-‘,1.xxx1<br />\n•<br /><br />"}], "field_media_file": [{"target_id": 41197, "display": null, "description": null, "target_type": "file", "target_uuid": "f3281348-4f98-443a-83b3-3409ce38eb28", "url": "http://digital.library.jhu.edu/system/files/2022-03/14346-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 14346, "target_type": "node", "target_uuid": "55f324f0-c665-4a00-bbb4-e6df9f9ea5b0", "url": "/node/14346"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "63b38c6b-5617-489e-bc02-20359cbd175b"}]}