{"mid": [{"value": 36671}], "uuid": [{"value": "76e16464-00e3-41d6-85f8-30c5a6318efb"}], "vid": [{"value": 36671}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:51:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12970-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:51:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:51:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "ES<br />\n<br />\nde<br />\n<br />\n81<br />\n<br />\nVOL. XXVI. No. 16<br />\n<br />\nBALTIMORE, MD., NOVEMBER 30, 1921<br />\n<br />\nHOPKINS LOSES LAST GAME<br />\nBY A SINGLE TOUCHDOWN<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nDEAN LATANE ADDRESSES ALL-MARYLAND TEAM IN- PLANS FORMING FOR THE<br />\nFRESHMAN-SOPHOMORE<br />\nSWARTHMORE CONFERENCE CLUDES FOUR J. H .U. MEN<br />\nGAME<br />\nVoices Resentment at Present-day In- Two Backfield and Two Linesmen<br />\ntrusion of Commercial Incentives<br />\ninto the Realm of Education.<br />\n<br />\nShould Gain Places. Totterdale<br />\nShould Lead Mythical Eleven.<br />\nBrewer Probable Best Bet.<br />\n<br />\nDance to Be Held in C. E. Hall After<br />\nContest. Tentative Lineup Announced.<br />\n<br />\nAfter Outplaying Visitors, Successful Pass by Generals Proves On November 26, at the annual<br />\nAt a joint meeting held TuesWith the football season over,<br />\nDownfall of Black and Blue. Contest Played in Sea<br />\n.meeting of the Association of Colday the committees appointed by<br />\nfans have but to speculate on<br />\nof Mud. Wilson Makes Sensational Run<br />\nleges and Preparatory Schools of the<br />\nthe respective presidents of the<br />\nthe all-Maryland football team se-<br />\n<br />\nSophomore and Freshman Classes<br />\nGENERALS FORTUNATE TO J. H. U. FINISHES SECOND IN the Middle States and Maryland<br />\nlections for the year. The mythSCORE VICTORY<br />\nS. A. I. A. A. CLASS CROSS- at Swarthmore, Dr. Latane made ical eleven this year, as in the past, decided upon several important<br />\none of the most striking addresses<br />\nquestions relating to the interCOUNTRY RACE<br />\nUmpire's Decision Questioned. J. H. U.<br />\nchosen by a combeen uttered in recent will probably be<br />\nclass football game and class rush<br />\nProved Superior for Three and<br />\nCaptain Sommerville Suffers Bad Spill. which has<br />\neditors of the loyears. It was a poignant criticism mittee of sporting<br />\na Half Periods.<br />\nBooth Leads the Field.<br />\nto be held on December 10. The<br />\ncal<br />\npress.<br />\nsystem.<br />\neducational<br />\nof<br />\nour<br />\nwhole<br />\nquestion of eligibility arose and it<br />\nHopkins<br />\ncross-country<br />\nJohns<br />\nUnder the most unfavorable<br />\nThe NEWS-LETTER has not atIs the average college graduate<br />\nwas practically decided, on acsecond<br />\nin<br />\nthe<br />\nannual<br />\nfinished<br />\nteam<br />\nweather conditions and with the<br />\ntempted to select such an eleven,<br />\nculture?\"<br />\nasked<br />\nof<br />\ntoday<br />\na<br />\nman<br />\nof<br />\ncount<br />\nof the requests of Coaches<br />\nA.<br />\nI.<br />\nrun<br />\nS.<br />\nof the<br />\nbut the selections of individuals<br />\nmost favorable football breaks cross-country<br />\nall<br />\nwill<br />\nthink<br />\nwe<br />\nLatane.<br />\n\"I<br />\nDr.<br />\nVan<br />\nOrman<br />\nand Armstrong, to alA. A., held on the Homewood<br />\nabout the campus seem to be pretty<br />\nWashington and Lee made<br />\nis<br />\nin<br />\nCulture<br />\nis<br />\nnot.<br />\nagree<br />\nthat<br />\nhe<br />\nlow<br />\nnone<br />\nof<br />\nthe men who have<br />\ncourse on Saturday. In the official<br />\nThanksgiving even more unbear- tabulation, Hopkins was placed its nature more or less aristocrat- much the same. It would perhaps taken part in Varsity contests this<br />\nseem prejudiced to place eight<br />\nable for Hopkins than elements third, but the correct scoring reads, ic, while democracy is the goal of<br />\nyear to play. This excludes a<br />\nHopkins men on the phantom team,<br />\neducation.\"<br />\npresent<br />\nday<br />\nnumber<br />\nof good men on both<br />\nhad done. After outplaying the Washington and Lee, 44; Hopkins,<br />\nbut from the records of claimants<br />\nthat<br />\nculture<br />\nsay<br />\nto<br />\nHe<br />\ngoes<br />\non<br />\nteams,<br />\nbut allows ample opporGenerals in three quarters, only to 47, and Virginia, 55.<br />\nin its old sense is not one of the for each of the positions, such an tunity for the coaches to pick out<br />\nmixup<br />\narose<br />\nout<br />\nof<br />\nthe<br />\nfailThe<br />\nsee gains minimized by the slopeducation, but appointment would be logically fair promising material for next year's<br />\nure of the judges to give unto Som- principal aims of<br />\npy condition of the field and only<br />\nproportion and square.<br />\nteam.<br />\nerville the credit that was Somer- that an overwhelming<br />\nThe most anti-Hopkins grid fan<br />\nto be robbed of a touchdown by<br />\nIt is possible that a nominal adThe Hopkins captain of students are going to college must admit the superiority of four<br />\nville's.<br />\nincompetent refereeing, the Hop- would probably have finished not only- for the money and asset it<br />\nmission will be charged for those<br />\nof our men. At the quarter back<br />\nwho do not hold Hopkins A. A.<br />\nkins forward defense gave ground worse than fitfh or sixth had it not will later be to them. They go to position, two<br />\nnames only can be<br />\ncollege because it pays in the comtickets,<br />\nthe proceeds to be given<br />\nreceived.<br />\nbad<br />\nspill<br />\nhe<br />\nbeen<br />\nfor<br />\na<br />\nmomentarily in the fourth quarmercial sense. There is too much considered: Darley and Fox. Sem- to the Athletic Association which<br />\nhim<br />\nof<br />\nter; but this wavering was long This spill not only robbed<br />\nspecialization. He deplores the in- ler, of State, although a wonderful is sadly in need of funds. The<br />\nmuch time and strength, causing<br />\nenough to allow the astute Lextrusion of commercialism and little pivot man, cannot be classed joint committees in charge of the<br />\nhim to wind up thirteenth, but<br />\nsolimercantilism into the realm of cul- with the first two, who have proved game have decided to hold a dance<br />\ningtonians to slip over the<br />\ntearing off his number was the<br />\ntary and decisive score of the aft- probable cause of the officials fail- ture. Dr. Latane went on to say: superior men from every angle of similar to those given heretofore<br />\n\"We have abandoned culture as the game. Fox, having had pre- by the Cotillon Board in the C. E.<br />\nernoon.<br />\ning to check him at all. As a rethe prime aim of education. We vious experience, both profession- Hall afterward and the usual adAll the thrills imaginable were sult, instead of being credited with<br />\nare selling education to the al and collegiate, and having played mission of fifty cents will be<br />\npacked into the fatal fourth quar- men finishing first, seventh, eighth, masses and make the state pay fewer games than Darley, should<br />\ncharged to help cover expenses.<br />\nter. The first half of the quarter thirteenth and seventeenth, Hop- for it. In doing so we are neces- not be given as much considera- All Hopkins<br />\nmen are expected to<br />\nkins was charged with men finishwas merely a repetition of what<br />\nsarily lowering the standards. It tion. Darley has proven a wonder- attend.<br />\ning first, seventh, eighth, sevenis impossible to lift our entire ful general, mixing his plays and<br />\nhad happened in the three pre- teenth and twenty-third.<br />\nThe usual rush will be held ten<br />\ndemocracy up to the limit of the always holding something in re- minutes between the halves and<br />\nceding quarters with Hopkins<br />\nThe Hopkins team really gave a<br />\nserve. Fox, although a good di- ten minutes after the completion<br />\nold idea of culture.\"<br />\ngaining ground through Calkins very fine exhibition, one that would<br />\nAfter expressing the fear that rector, specializes in carrying thc of the game. The rush has been<br />\nsuperior punting. But suddenly have resulted in bringing the cham- in giving education to the many, ball. As an all-around quarter,<br />\nsomewhat modified; the first half<br />\nWith the period half over and pionship to Homewood had not the we neglect he few who are really Darley should be practically unop- will<br />\nbe run as usual, but in the<br />\njinx overtaken Somerville. Booth<br />\nafter Calkins had missed an atworth it, he scathingly criticises posed for first choice.<br />\nsecond<br />\nhalf the Freshman banner<br />\nran his usual unapproachable race<br />\nSelection of half backs is a more will be suspended from a pole<br />\ntempted drop kick thus making a to finish in 24.49 far ahead of any the product of our universities and<br />\ndifficult problem. Bonner, Kirk- about nine feet from the ground<br />\nscoreless tie seem inevitable, one cempetitor. Somerville showed un- colleges. He continues:<br />\n\"Does the college graduate of patrick, Marken and Brewer are and it will be the object of the<br />\nof Calkins' punts was blocked and usual determination to come<br />\ntoday use correct English and is all likely claimants. Of these, Sophomores to remove it.<br />\nit was the Generals' ball in mid- through eleventh after his bad fall,<br />\nbe able to write effectively? As- \"Kirk\" is the easiest eliminated,<br />\nA strictly tentative lineup, subfield. Then before Hopkins had and the running of Milligan and suredly not. Even graduate stu- having been forced out of the game ject to<br />\nchange on both sides, has<br />\nEdwards, sixth and seventh, rerealized what had happened, Matdents are deficient in the true art for a good part of the season. been announced as follows:<br />\ntox shot two long and cleverly de- spectively, were of the highest cal- of writing.\"<br />\nBrewer, whose toe did the only<br />\nSOPHS.<br />\nFRESHMEN<br />\nceptive forward passes to Arbo- ibre. Fenton, a newcomer in HopIn this address Dr. Latane scoring for his team in three of its<br />\nkins<br />\ncross-country<br />\nranks,<br />\ndid<br />\nwell<br />\nDunning<br />\nL<br />\nE<br />\nTurnbull<br />\ngast who was not downed till he<br />\nsounded a note which has been contests, will undoubtedly be se- Shriver,<br />\nBergin<br />\nJ.S.V.B. L T<br />\ngarner<br />\nto<br />\nseventeenth<br />\nin<br />\nsuch<br />\ncomreached Hopkins 18-yard line.<br />\ngrowing louder and louder during lected one of the half backs. Se- Smallwood<br />\nYoung<br />\nL G<br />\nC<br />\nSummers<br />\nHere Hopkins held for three petition, under such unfavorable the past few years. Men are be- lection between Markell and Bon- Shriver, G. M<br />\nHutzler<br />\nR G<br />\nFargo<br />\nweather<br />\nconditions.<br />\ndowns but on the fourth Matteginning to lose their satisfaction ner forces us to choose the Texas Raleigh<br />\nR T<br />\nBates<br />\nThe corrected order of finishing with the present and with modern speed merchant, for his ground- Meyer<br />\nR E<br />\nGump<br />\nshot another pass to Arbogast carHarwood<br />\nBalsam<br />\nQ B<br />\nrying the ball to Hopkins one- is:<br />\ninstitutions. A spirit of question- gaining ability, if for nothing else. Marchetti<br />\nMerlees<br />\nL H<br />\nFarbman<br />\nR H<br />\nyard line and first down. A plunge 1 Booth, Hopkins, 24.49.<br />\ning and criticism is more and Bonner has in every game played Ellicott<br />\nJones<br />\nLumbach<br />\nF B<br />\nby Mattox completed Hopkins' 2. Smith, Washington and Lee, more insistently demanding to been able to shake off his tacklers<br />\ndownfall.<br />\n25.00.<br />\nbe heard. It is this which is one of and make long runs. His total<br />\nJOHNS HOPKINS SYMPHONY<br />\nHopkins was stunned for a mo- 3. Crook, Maryland, 25.08.<br />\nthe most encouraging signs of a yardage, compared with his fellow<br />\nORCHESTRA<br />\nment but quickly rallied its forces<br />\nfuture intellectual revival.<br />\nbacks, is probably far greater. He<br />\n4. Bohannon, Virginia, 25.10.<br />\nThe Johns Hopkins University<br />\nfor a return blow. After receiving<br />\nand Brewer will be chosen half<br />\nSymphony Orchestra, which last<br />\nthe kick, a line buck and a for- 5. Goward, Virginia, 25.15.<br />\nCONFERENCE backs.<br />\nINTERFRATERNITY<br />\nward pass failed to gain, but on 6. Howard, Washington and Lee,<br />\nAt full, Tickey and Calkins both season consisted of about 90 playTO BE HELD<br />\n25.20.<br />\nthe next play Calkins shot the ball<br />\ners, has begun its rehearsals at the<br />\nNinety-two American colleges have claims. Eric, by virtue of<br />\nto Carl Wilson on a short forward 7. Mulligan, Hopkins, 25.28.<br />\nsuperior punting and toe work in Peabody Institute under the diand universities will be representPass. The elusive quarterback who 8. Edwards, Hopkins.<br />\ngeneral, should be selected. How- rection of its conductor, Mr. Chas.<br />\nhad gone in for Darley when he 9. Swope, Washington and Lee. ed at the thirteenth interfraternity ever, as Brewer has been chosen<br />\nH. Bochau. A splendid opportuniconference to be held at the Hotel punter for the mythical aggregaWas injured then succeeded in<br />\n10. Richards, Maryland.<br />\nty for both members of the Unicarrying the ball over 40 yards<br />\nPennsylvania Friday and Satur- tion, Tickey will probably be seto Washington and Lee's 20-yard 11. A. R. Shands, Virginia.<br />\nversity and also outside musicians<br />\nday. The delegates come from lected full back.<br />\nline. After a line buck that gained 12. Hieskell, Washington and Lee.<br />\nThere is little choice for wing se- of both sexes is offered to study<br />\nevery part of the country as well<br />\nonly a yard or so Calkins again 13. Somerville, Hopkins.<br />\nfrom Yale and Harvard as from lections. There have been no stars best orchestral music under exheaved the ball this time in the 14. Compher, Maryland.<br />\nat this position this season. Bran- perienced instructors.<br />\nRehearsals<br />\nCalifornia, Iowa, Center, Texas,<br />\ndirection of Hap Middleton. It 15. Pass, Washington and Lee.<br />\nner, of State, and Brown, of Mt. are held on<br />\nTuesday<br />\nevenings<br />\nin<br />\nMaine and many other colleges St. Mary's, according to gossip, will<br />\nwas just out of Hap's reach, how16. Stevens, Virginia.<br />\nthe<br />\nConcert<br />\nHall<br />\nof the Peabody.<br />\nhardly familiar in the East. Even be selected for these positions.<br />\never, and as the ball hit the<br />\nVacancies<br />\nexist<br />\nfor<br />\ng<br />\n.round the whistle blew, thus end- 17. McDonald, Maryland.<br />\ngood players<br />\nToronto is represented.<br />\nWesterman, Knecht, Nisbet,<br />\ning Hopkins last desperate chance 18. Fenton, Hopkins.<br />\nof<br />\nviolin,<br />\nviola, cello, bass horn<br />\nColumbia is in the lead in the Ward and Chapman all have fair<br />\nfor victory.<br />\n19. Greene, Virginia.<br />\nand trombone, so any students declaims<br />\ntackle<br />\nto<br />\nthe<br />\npositions.<br />\nBy<br />\nIt had been a wonderful at- 20. Gannaway, Washington & Lee. number of representatives sent to virtue of greater experience and siring<br />\nto join should make applithe conference by the leading fratempt to stave off an undeserved 21. Terry, Maryland.<br />\nconsistent work, however, Nisbet cation immediately to<br />\nF. C. Smith,<br />\nternities of the country, each of<br />\nde<br />\n.feat. But it came too late. Hopand T. Chapman, of Mt. St. Mary's, Box<br />\n22. Cohen, Virginia.<br />\n850.<br />\nThis,<br />\nthe<br />\nfourth<br />\nwhich<br />\ndesignated<br />\nthree<br />\ndelegates<br />\nseason,<br />\nkins had made one other blow at<br />\nwill be the selection of the local<br />\npromises to be a great success.<br />\nthe Generals' goal line. In the sec- 23. Wootten, Maryland.<br />\nColumbia press.<br />\nand two alternates.<br />\n°nd period with the ball in hos- 24. Cronin, Hopkins.<br />\ndelegates number 31.<br />\nChoice between Magill, Landy Announcement of concerts will be<br />\n25. Seitz, Hopkins.<br />\nmade in the near future.<br />\nContinued on page 4, col. 2<br />\nContinued on page 2, col. 1<br />\nContinued on page 3, col. 1<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 30, 1921<br />\n<br />\n2<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\nFOUNDED 1897.<br />\n<br />\n$2.50<br />\n<br />\nSubscription<br />\n<br />\nat<br />\nEntered as second-class matter December 3, 1909, at the Postoffice<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nMANBusiness communications should be addressed to the BUSINESS tions<br />\ncommunica<br />\nother<br />\nand<br />\narticles<br />\nall<br />\nY;<br />\nUNIVERSIT<br />\nHOPKINS<br />\nJOHNS<br />\nAGER,<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\nTelephone<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22,<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\nAssociate Editors:<br />\nEDWARD G. HUEY, '22.<br />\nELI F. ANK, JR., '22.<br />\nJunior Editors:<br />\nCHARLES C. MARBURY, '22.<br />\nJ. BRENTNALL POWELL, '23.<br />\nCRAIG E. TAYLOR, '24.<br />\nJ. HUDSON HUFFARD,'23<br />\nJOSEPH S. LEIPOLD, '24.<br />\nDONALD H. KIRKLEY, '25.<br />\n<br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\n<br />\nfunds, that body can only recommend, not dictate. However, it<br />\ngave the matter much discussion<br />\nand it was unanimously agreed that<br />\nthe members of our team should receive some recognition of their<br />\nprowess. It was suggested that<br />\nthis trophy should take the form of<br />\na football, somewhat similar to<br />\nthose that The Sun gives out to its<br />\nall-Maryland team. These souvenirs should, it was generally felt,<br />\nbe donated by the Varsity Club.<br />\nWhatever the outcome of the<br />\nmatter is, we have the team and<br />\nwe mustn't let anyone forget it.<br />\n<br />\nST. DAVID'S<br />\nProtestant Episcopal Church<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nRoland Park<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\nSUNDAY SERVICES<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\n8 P. M.—Choral Evening Prayer<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n<br />\nDRAPERIES<br />\n<br />\n343 NORTH CHARLES STREET<br />\n<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br />\n<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nSts., Baltimore, Md.<br />\nPrinted by The Read-Taylor Co., Lombard and South<br />\n<br />\nBALTIMORE, MD., NOVEMBER 30, 1921<br />\nTHE SPIRIT AT HOPKINS<br />\na<br />\nSo far this year there has been manifestd here at Hopkins<br />\nunis<br />\nwhich<br />\nloyalty,<br />\noodness<br />\no-g<br />\nhonest-t<br />\nof<br />\nspirit of \"go get it\" and<br />\nand<br />\ndeniably superior to the brand found at most of our colleges<br />\nappears<br />\nThere<br />\nHopkins.<br />\nJohns<br />\nat<br />\nwhich has never been surpassed<br />\nworthwhile ento be a willingness to earnestly co-operate in every<br />\nhope will be<br />\nall<br />\nwe<br />\nwhich<br />\ndeavor which is highly commendable and<br />\nsquarely<br />\nstood<br />\nhas<br />\nbody<br />\nperpetuated and developed. The student<br />\nuphold<br />\nto<br />\nor<br />\nimprove<br />\nbehind every effort that might possibly tend to<br />\nof<br />\nmembers<br />\nThe<br />\nthe traditionally high standards on the campus.<br />\nlot<br />\nfine<br />\na<br />\nbe<br />\nto<br />\nes<br />\nthe incoming class of 1924 have proved themselv<br />\nspirit and a<br />\nof men and they are already showing an admirable<br />\nreadiness to become absorbed in the body of students here at Home-<br />\n<br />\n/Evetything for A<br />\nQUALITY—<br />\nnothing for show<br />\n<br />\nwood.<br />\nThis willingness'to work for everything at Hopkins cannot be<br />\na<br />\npraised too highly—but it must be kept alive. It has rolled up<br />\nBlue<br />\nand<br />\nBlack<br />\nthe<br />\ncarry<br />\nto<br />\nmuch<br />\ndid<br />\nwave of enthusiasm which<br />\nfootball team through a successful season and on to the state gridiron championship. More of the \"Beat St. John's\" spirit will improve<br />\nthe standard of athletics and mean much to the University as a<br />\nwhole. With the possibility of a basketball season near at hand, let<br />\nus see the same enthusiastic spirit so that we may look forward to<br />\ncelebrating the completion of another successful schedule.<br />\n<br />\n0. D. K. SONG BOOK<br />\nThe Hopkins Song Book, which has been compiled by the Omicron Delta Kappa Society, and is now in press, is yet another proof<br />\nof the steady growth of the University. For years the publication of<br />\nsuch a book has been discussed only to be abandoned because deemed<br />\nimpractical.<br />\nThe finished book will be a credit to Hopkins. No time nor<br />\nof<br />\nnecessary expense has been spared. Rather than run the risk<br />\n,<br />\nhaving it appear cheap, an expensive cover has been provided<br />\nmaking it necessary to charge $1.25 a copy. In its final form, however, the book is one of which we may all be proud.<br />\nIt should not be necessary to urge every student to buy one or<br />\nwhich<br />\nmore of these books. The Hopkins Song Book is something<br />\nHard<br />\nHopkins.<br />\nof<br />\nadmirer<br />\nand<br />\nlover<br />\nshould be in the home of every<br />\nnot<br />\ndo<br />\nthings<br />\nof<br />\nbest<br />\nthe<br />\neven<br />\nexperience, however, has proved that<br />\nthereforce,<br />\nsales<br />\na<br />\ninto<br />\ns<br />\nsell themselves. Let us organize ourselve<br />\nfore, and talk the song book up among our friends, the faculty and the<br />\nalumni. In this way only can we make the sale of the book a success, and reward to some extent the efforts of those who compiled it.<br />\nINTER-FRATERNITY CONVENTION<br />\n<br />\nContinued from pagc 1<br />\n<br />\nCornell is second with 19 representatives, among them the president of the conference, Don R.<br />\nAlmy, a lawyer of 46 Cedar street,<br />\nN .Y. U. is third with 11.<br />\nIllinois is the first of the more<br />\ndistant universities with 8, while<br />\nYale and Michigan follow with 7,<br />\nPenn with 6 and Williams with 5.<br />\nMore than 200 college fraternity<br />\nmen in all will be present.<br />\nThe interfraternity Conference,<br />\nthe advisory council of practically<br />\nall of the country's men's college<br />\nfraternities, will discuss a number of problems at American colleges at its tIvo-day convention.<br />\n<br />\nOUR CHAMPIONSHIP TEAM AND<br />\nTHE GOLD FOOTBALLS<br />\n<br />\nFor the first time since nineteen<br />\nfifteen Johns Hopkins has a State's<br />\nchampionship football team, one of<br />\nthe best it has ever had, and one<br />\nwhich should go down in its history. This team. has given us a<br />\ngood chance to attain a real place<br />\nin athletics, and it is certainly up<br />\nto those interested in the University to see that the record of its<br />\nachievement be remembered and<br />\nprofited by.<br />\nThis was the problem that faced<br />\nthe Athletic Board at its last meeting. Hampered by its lack of<br />\n<br />\nHAT'S OUR IDEA in making CAMELS — the<br />\nQuality Cigarette.<br />\n<br />\nT<br />\n<br />\nWhy, just buy Camels and look at the package! It's<br />\nthe best packing science has devised to keep cigarettes<br />\nfresh and full flavored for your taste. Heavy paper outside—secure foil wrapping inside and the revenue stamp<br />\nover the end to seal the package and keep it air-tight.<br />\nAnd note this! There's nothing flashy about the Camel<br />\npackage. No extra wrappings that do not improve the<br />\nsmoke. Not a cent of needless expense that must come<br />\nout of the quality of the tobacco.<br />\nCamels wonderful and exclusive Quality wins on merit<br />\nalone.<br />\nBecause, men smoke Camels who want the taste and<br />\nfragrance of the finest tobaccos, expertly blended. Men<br />\nsmoke Camels for Camels smooth, refreshing mildness<br />\nand their freedom from cigaretty aftertaste.<br />\nCamels are made for men who think for themselves.<br />\n<br />\nR. J. REYNOLDS TOBACCO COMPANY, Winston-Salem, N. C.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 30, 1921<br />\nEVERYTHING READY FOR NOTABLES TO VISIT HOMEWOOD<br />\nContinued from page 4<br />\nBIG ARMY-MARINE GAME<br />\nsun on uniforms, brass buttons and<br />\nThe football eyes of the country<br />\nhigh silk hats, the splotches of<br />\nwill be centered upon Homewood<br />\ncolor presented by gayly dressed<br />\nField next Saturday when the<br />\nwomen; the splendid beefiness of<br />\nArmy-Marine game will take place.<br />\nArmy team, and the alert poise<br />\nthe<br />\nIt has been announced that Presiof the Marine.<br />\ndent Harding will attend and othThe majority favor the Marines<br />\ners prominent in national.nd state<br />\nto win, but their heavy opponents,<br />\ngovernment will take their places<br />\nand root for their favorite teams. spurred by the pressure of the famous visitors, should put up a batThe Army team has been selected<br />\ntle well worth seeing.<br />\nfrom the posts in the Third Corps<br />\narea, including Camp Holabird, The taking and selling of tickets and other arrangements is unCamp Meade, Langley Field, and<br />\nder Hopkins management, and the<br />\nCarlisle Post. The team selected<br />\nhas been practicing steadily for Hopkins ushers will be out in force.<br />\nOrder will be kept by special dethree weeks, devoting the entire<br />\ntachments of police, civil and miliday to football. The team is untary, and marines; and secret serdoubtedly a strong one, many forvice men will guard the noted vismer college stars being included in<br />\nitors.<br />\nthe lineup. Captain Ignico, who is<br />\nThis will be the last game to be<br />\nalso captain of the team, was a forplayed on Homewood Field, except<br />\nmer star at Washington and Lee.<br />\nthe Freshman-Sophomore tilt.<br />\nMabbutt, the 314-pound center, is<br />\na former University of Idaho player and also<br />\n. attended West Point.<br />\nUnderwood, a tackle from Univer- 0. D. K. SONG BOOK IN PRESS<br />\nsity of Minnesota, will start the<br />\nThe work on the Omicron Delta<br />\ngame for the Army. A full-blood- Kappa songbook has gone to press,<br />\ned Indian, weighing 225 pounds, it was announced by Doug. Coulwill start at the other tackle berth. ter, Editor-in-Chief, and it is probMajor Daly, coach of the West able that the long-awaited publicaPoint eleven, has come down from tion will make its appearance beWhite Plains and will assist in pol- fore the Christmas holidays.<br />\nishing off the dopghboys for the<br />\nThe book will have thirty-two<br />\ncontest, and reports that they are pages and will have a four-page<br />\nin first-class shape.<br />\ncover, which will be of heavy maThe Marine team is composed terial. The outside<br />\ncover will be<br />\nmostly of athletes from the Marine colored a distinctive<br />\nblue. A picaviation field, and, although they ture of Gilman Hall, a Hopkins<br />\nProbably have not as many former Seal and the title,<br />\n\"Hopkins Song<br />\ncollege stars in their lineup, they Book,\" will appear on the cover<br />\nhave shown themselves a team to page of the back.<br />\nTwenty-five<br />\nbe reckoned with.<br />\npages will be taken by songs and<br />\nAs the Marines built the extra music; four pages by songs<br />\nand<br />\nstands at Homewood, they have yells. The remainder of the pages<br />\nbeen assigned to the concrete will be utilized for<br />\ntitle pages, dedstands and the Army has been ,del- ications, etc. There will be, in all,<br />\negated to the stands on the other sixteen songs.<br />\nside of the field.<br />\nThe 0. D. K. has succeeded in<br />\nA capacity crowd is expected and setting the very reasonable price<br />\nof<br />\nthe regular ushers will be assisted $1.25<br />\nfor the books. This is rein handling these Army and Ma.markable, considering the high<br />\nrine men.<br />\nquality of the material composing<br />\nThe Fifth Marine Regiment of<br />\nBelleau Wood and Chateau Their- im mesivinvemamonvemm<br />\nrY fame, will act as- an escort to<br />\nthe Marine team.<br />\n<br />\nthe publication and the song book<br />\nEstablished 1873<br />\nLIBERTY<br />\nwill make an ideal Christmas presA.H.Felling ManIg Jewelry Co.<br />\nent. \"Doug\" Cotton announces<br />\nExpert Cleaners and Dyers<br />\nManufacturers<br />\nthat if the book is purchased in Special Rates to Hopkins Men<br />\nFraternity Jewelry<br />\nLetter<br />\nGreek<br />\nquantities of three or more a spe211 E. 25th St.<br />\nHomewood 5205-W 213 N. LIBERTY ST., Baltimore, Md.<br />\ncial and appreciable reduction will<br />\nbe made.<br />\nThe following songs will be inIn Our Men's Section<br />\ncluded: University Ode, University Alma Mater, Black and Blue,<br />\nYou will at all times find the newest<br />\nOur Alma Mater in Dixie Land,<br />\nand most fashionable Neckwear, Shirts,<br />\nCollars and other Furnishings necessary<br />\nJohnny Hopkins, On to Victory,<br />\nto a college man's wardrobe.<br />\nTo Win, Graveyard, Everybody<br />\nBets on Hopkins, On the Line, St.<br />\nJohn's, Gooday, The Toast We<br />\nDrink, The Freshman, Hullabaloo<br />\nBoys, March, Waltz, Song, Ain't<br />\nWe Neat, Ha! Ha!<br />\n<br />\nHUTZLER BRITHEM<br />\n<br />\nWe are establishing a new standard in<br />\nYoung Men's Suits at $29.50<br />\nStyles for every taste.<br />\n<br />\nTeachers!<br />\nIN or rent a Corona<br />\n-1--/ typewriter on easy<br />\npayments. Carry it to<br />\nschool every day in its<br />\nneat case. Make extra<br />\nmoney writing articles or<br />\ndoing typing for others!<br />\nCalltoday at the nearest<br />\nCorona store—or telephone for a demonstration at your home.<br />\n<br />\nBaltimore's Best Store<br />\n<br />\nHOCHSCHILD,KOHN 8c,CO.<br />\nOur \"prep- room on the<br />\n<br />\nM. W. LUCY & CO.<br />\n118 W. Fayette St.<br />\n<br />\nthird floor specializes in<br />\n<br />\nWeighs6%lbs.<br />\nFolds and fits<br />\nin a neat carrying case.<br />\n<br />\nclothes for young men.<br />\n<br />\nSnn with<br />\n<br />\ncase<br />\n<br />\nCOR0NA<br />\n<br />\nHub<br />\n<br />\nThe Persona! Writing Madurze<br />\n<br />\nBaltimore. Charles and Fayette<br />\n<br />\n•<br />\n<br />\nII<br />\nC\\<br />\n<br />\n'<br />\n<br />\n\"\",r<br />\n<br />\n•<br />\n<br />\nMURAD<br />\n<br />\nALL MARYLAND TEAM<br />\nContinued from page 1<br />\n<br />\nTHE TURKISH CIGARETTE<br />\n<br />\nand the 250-pound Keenan, of<br />\nWashington College, is difficult.<br />\nAbove mentioned rumor has it,<br />\nhowever, that Magill and Keenan<br />\nWill be chosen.<br />\nNo one should hesitate in selecting the all-State center. Totterdale stands head and shoulders<br />\nabove the rest in this department.<br />\nHe will be the undisputed selection<br />\nof all.<br />\nThough it is believed that Brewer will be selected, \"Best Bet\" and<br />\nCaptain, our selection is \"Best<br />\nBet\" — Bonner; Captain — Totterdale.<br />\nThe first team selection and<br />\nOur second team selection is as fol10<br />\n<br />\n3<br />\n<br />\nEvery day MURADS are held<br />\nhigher in the estimation of the men<br />\nwho smoke them.<br />\nThey are the standard of Taste.<br />\nThey never disappoint—never<br />\nfail—never change—<br />\n<br />\n‘311.1i3511. GIGARLIT<br />\n<br />\nThey are 100% pure Turkish tobacco—ofthe finest varieties grown.<br />\n<br />\nUI<br />\n-<br />\n<br />\nYou are proud to smoke them<br />\nin any company—on any occasion.<br />\n<br />\nE.SPE.CAM.X..`i FOCI T ti tima<br />\nt<br />\ni<br />\nEXPESt1E14C<br />\nARE'MADE.<br />\n111SCAltglAAVAG MAD<br />\nGRADE,_<br />\nti1GIA<br />\nSMOKER OF CAGARETTES<br />\n<br />\ns<br />\n<br />\nFIRST ALL-MARYLAND.<br />\nBranner (U. of M.)<br />\nE.<br />\nNisbet (U. of M.)<br />\nT.<br />\nMaggill (J. H. U.)<br />\nG.<br />\nTotterdale (J. H. U.)<br />\nC.<br />\nKeenan (WO<br />\nG.<br />\nT. Chapman (M. S. M.)<br />\nT.<br />\nBrown (M. S. M.)<br />\nE.<br />\nbarley (J. H. U.)<br />\nQ B.<br />\nBonner (J. H. U.)<br />\nH. B.<br />\nBrewer (U. of M.)<br />\nH.B.<br />\nTickey (St. J.)<br />\nF.B.<br />\nSECOND TEAM.<br />\nBanfield (St. J.)<br />\nE.<br />\nTHE<br />\nWesterman (J. H. U.)<br />\nT.<br />\nMoore (U. of M.)<br />\nG.<br />\nGable (M. S. M.)<br />\nC.<br />\nCollar Hug Clothes<br />\nan<br />\n(J. H. U.)<br />\nG.<br />\nBaltimore and LibegyStreets<br />\nKnecht (J. H. U.)<br />\nT<br />\nMiddleton (J. H. U.)<br />\nE.<br />\nPox (St. J.)<br />\nQ B<br />\nKirkpatrick (St. J.)<br />\nH B<br />\n••••••••••••<br />\nMarkell (J. H. U.)<br />\nH B ••••••••••••<br />\n•<br />\nCalkins (J. H. U.)<br />\nF B<br />\n<br />\ne-y,catkon._<br />\n<br />\niJ<br />\n<br />\nOutfitters!<br />\n<br />\nhead to foot<br />\nin good style<br />\nat fair prices<br />\n<br />\n-<br />\n<br />\nThey are the largest selling highgrade cigarette in the world.<br />\nThe cigarette smokers ofAmerica<br />\nDO prefer Quality to Quantity.<br />\n\"Judge for Yourself—!\"<br />\n<br />\n1)))))))))))))1111))1111<br />\n<br />\nUALITYOHOP<br />\n<br />\n11<br />\n714/0 Makasitheldi<br />\nafidE9041121161144\"<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 30, 1921<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\n<br />\nDR. GOODNOW THANKS MILITARY PRESIDENT HARDING AND OTHER<br />\nNOTABLES TO BE AT HOMEDEPARTMENT<br />\nWOOD SATURDAY<br />\n<br />\nThe Episcopal Church of<br />\nSt. Michael and All Angels<br />\n<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br />\n<br />\nThe Army-Marine game will beJAS. H. DOWNS<br />\ngin Saturday before an audience<br />\nST. PAUL and TWENTIETH STS.<br />\nENGRAVER PRINTER STATIONER<br />\nexpected to be at once one of the Wyatt Brown, D.D., Litt.D., Rector<br />\n229 N. CHARLES ST.<br />\nlargest and most distinguished that<br />\nHoly Communion at 7.30<br />\nhas ever come to Homewood.<br />\nMen's Bible Class, 9.30<br />\nYoung<br />\nOn the sidelines will be, among<br />\nNECKWEAR<br />\nSHIRTS<br />\nother noted guests, President Morning Service, 11 o'clock<br />\nHarding, General Pershing, Secre- Evening Service, 8 o'clock<br />\ntary of War Denby, Generals But- Special Invitation to Hopkins Students<br />\n421 N. HOWARD ST.<br />\nler and LeJeune, other army offiHOSIERY<br />\nGLOVES<br />\ncers of high rank, and Mayor<br />\nBroening.<br />\nFor several weeks detachments<br />\nSTRATTON SHIRT MAKER<br />\n\"Major E. B. Garey,<br />\n226 N. Liberty St.<br />\nof soldiers and marines have been<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\nJ. H. U.<br />\nsliding about in the mud of Home$3.25 and $4.25<br />\nNegligee<br />\n$5.25 and $6.25<br />\nImported Madras<br />\nCtibeXatterie<br />\nwood Field, engaged in building<br />\nMy Dear Major Garey:<br />\nTerms Cash, Less 10% 30 Days on<br />\n3414Zs H.& OSCAR G.1-51<br />\nbenches<br />\n'<br />\nthe pine-board auxiliary<br />\nShirts<br />\nI wish to express to you and<br />\nAlso a Full Line of Men's<br />\noWNERS<br />\nmarines,<br />\nThe<br />\nand<br />\ngrandstands.<br />\nthrough you to the members of<br />\nFurnishings<br />\niY111,E*4 0e4<br />\nwho were encamped near the laexercises<br />\nour<br />\non<br />\ncommittee<br />\nthe<br />\n29 Baltimore St_., East<br />\ncrosse practice wall, finished their<br />\nOne Door West of Light St.<br />\nyesterday and to the members of<br />\nand left the early part of this<br />\njob<br />\nSOLE AGENTS FOR BALTIMORE the Military Department the apAT $8.00, made<br />\nto appear as rooters Saturweek,<br />\nFor College Fraternity Bands<br />\nthe<br />\nof<br />\nUniversity<br />\nthe<br />\nof<br />\npreciation<br />\nof grain leather,<br />\n(Greek Letter Societies)<br />\nday.<br />\nway in which the exercises were<br />\nin tan or black,<br />\nThe west side of the field will be<br />\nThe Chas. Wilhns Surgical<br />\nmanaged. I have heard nothing<br />\nwith square toe and<br />\nInstrument Co.<br />\ndevoted to Marine fans, while the<br />\noccasion.<br />\nthe<br />\nof<br />\npraise<br />\nbut<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nArmy rooters will occupy the east<br />\nheavy perforations,<br />\nLIBERTY ST. at SARATOGA<br />\nI want also to congratulate you<br />\nSURGICAL INSTRUMENTS<br />\nwill<br />\nHarding<br />\n(Opposite Hotel Rennert)<br />\nPresident<br />\nstands.<br />\noxford<br />\nan<br />\nis<br />\nthis<br />\nwhich<br />\nshowing<br />\nSupplies,<br />\nand<br />\nMicroscopes<br />\non the excellent<br />\nhonof<br />\nbox<br />\nflag-draped<br />\nthe<br />\noccupy<br />\nStethoscopes<br />\nT. C.<br />\nany college man<br />\nLUNCHEON—:—DINNER<br />\nBlood Lancets was made by the R. 0.<br />\nBlood Counters<br />\nfront of the concrete stands,<br />\nin<br />\nor<br />\n11:30 until 7:30<br />\nexhimself<br />\nFoch<br />\nMarshal<br />\ncan be proud of.<br />\nbe<br />\nwill<br />\nPershing<br />\nGeneral<br />\nwhile<br />\nthe<br />\nat<br />\nDANCES<br />\nSMOKERS<br />\nBANQUETS<br />\npressed to me his pleasure<br />\nIn high shoe the<br />\nthe<br />\nof<br />\nside<br />\nat<br />\nthe<br />\nopposite<br />\nseated<br />\nBy<br />\nArrangement<br />\nmarched<br />\nway in which the boys<br />\nPrinters of Philological and<br />\nsame style is $8.50.<br />\nfield. A great crowd is anticipated,<br />\nand praised their conduct genTelephone St. Paul 6987<br />\nScientific Works<br />\nfor fully as many persons will come<br />\nerally.<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\nI am, with thanks to you for to see the President as will come<br />\nto see the game.<br />\nyour co-operation,<br />\nEnthusiasm is running high in<br />\nYours sincerely,<br />\nNorth<br />\nCharles Street,<br />\nboth camps, and both are united<br />\nLunches, Cigars<br />\nskies<br />\nclear<br />\nfor<br />\nin<br />\nfervently<br />\nwishing<br />\nFrank J. Goodnow.\"<br />\nCigarettes<br />\non Saturday. If good weather is<br />\nexan<br />\nmade<br />\nC.<br />\nT.<br />\n0.<br />\nR.<br />\nThe<br />\nhad, Homewood should not fail to<br />\nCandy, Soda and<br />\ntremely creditable showing on the present the \"colorful scene\" so<br />\nElkridge Farms Dairy<br />\nPipes and Fountain Pens<br />\noccasion of the Marshal's visit, dear to the hearts of the sports<br />\nMILK<br />\nFRESH<br />\nSTRICTLY<br />\nbeen<br />\nhas<br />\nespecially as the unit<br />\nwriters.<br />\nAt the Barn<br />\nProduced, Pasteurized and Bottled<br />\ndrilling together for only a very<br />\nThere will be columns in the<br />\nin Howard County<br />\nE. E. Adams<br />\nshort time this year. It is very for- newspapers about the gleam of the<br />\n17 E. Baltimore St.<br />\nEllicott City 231-R<br />\nCLARK BROS.<br />\ntunate that the entire battalion<br />\nContinued on page 3, col. 2<br />\nwas able to appear in new uni<br />\nPrinters of the<br />\nforms and the general appearance<br />\nalone should have been sufficient<br />\nJohns Hopkins News-Letter<br />\nto call forth the Marshal's praise:<br />\nThe extra time entailed in making<br />\nthe necessary preparations was<br />\nnot spent in vain.<br />\n—'<br />\n<br />\nMajor E. B. Garey wishes to<br />\nexpress through the columns of<br />\nComplete Stock of<br />\nMedical Books and College<br />\nthe News-Letter his appreciation<br />\nRequisites<br />\nfor the support given to the University officials by the R. 0. T. C.<br />\nImporters and Dealers in Fine Books<br />\nunit at the recent conferring of a<br />\n301 N. CHARLES ST.<br />\ndegree on Ferdinand Foch, marBaltimore, Md.<br />\nshal of France. That the work of<br />\nthe battalion was of high merit is<br />\nshown by the following letter of<br />\nPresident<br />\nfrom<br />\nappreciation<br />\nGoodnow :<br />\n<br />\nLefranc & Ault<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n<br />\n210<br />\n<br />\ncrimindiow<br />\n<br />\nHOPKINS DROPS LAST GAME<br />\n<br />\nWho can discriminate more<br />\ncarefully than the college<br />\nman? To his natural equipment are added the resources<br />\nof culture and the association with great minds of all<br />\nages. Such discrimination<br />\nleads naturally to the choice<br />\nof Melachrino,the One Cigarette Sold the World Over.<br />\n<br />\nContinued from page 1<br />\n<br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS<br />\n<br />\nSHOES<br />\nfor<br />\nUNIVERSITY MEN<br />\nFor Sport Wear<br />\nFor Dress<br />\nSmart Styles—Best Leathers<br />\nModerate Prices<br />\n<br />\nWYMAN<br />\n19 W. LEXINGTON ST.<br />\n<br />\nDR. ANDREWS TO ADDRESS THE<br />\nSCIENTIFIC SOCIETY<br />\n<br />\nDr. E. A. Andrews, professor of<br />\nzoology, at this university, will deliver a lecture next Tuesday, December the sixth, before the Scientific Society. The subject of Dr.<br />\nAndrews' lecture will be the Bottle Animalcule, a micro-organism<br />\nwhich inhabits the waters of nearly<br />\nall parts of the world, and grows<br />\nin a form similar to that of a bottle. The meeting of the society will<br />\nbe held at 4.15 in the large lecture<br />\nroom No. 110, in the Mechanical Engineering Building. All<br />\nmembers of the faculty and students interested in this subject are<br />\ninvited to attend the lecture.<br />\n<br />\ntile territory Calkins shot the ball<br />\nto \"Hap\" Middleton on the fiveyard line. \"Hap\" caught the ball<br />\nand placed it within a yard of a<br />\ntouchdown, but the officials ruled<br />\nthat the ball had hit the ground<br />\nfirst. Every _spectator knew that<br />\nthe ball had been fairly caught,<br />\nbut Hopkins chance to score was<br />\nruined.<br />\nBoth teams put up a good,<br />\nheady, scrappy game with Hopkins having a distinct edge at<br />\nevery period of the game save for<br />\nthe disastrous three minutes toward end. Markell and Bonner<br />\nmade many good gains and Calkins punting was very good.<br />\nWashington and Lee showed a<br />\nfine line and two sterling backs in<br />\nMattox and Frew.<br />\nThe summary:<br />\nJOHNS HOPKINS.<br />\n<br />\nWASil. & LEE<br />\n<br />\nBemis<br />\nL E<br />\nMiddleton<br />\nWesterman ....L.T...... Moore (c)<br />\nVogel<br />\nL G<br />\nMagill<br />\nCollins<br />\nTotterdale<br />\nLandy<br />\nRangely<br />\nR G<br />\nPotts<br />\nKnecht<br />\nR T<br />\nHerndon<br />\nR E<br />\nRich<br />\nFrew<br />\nDarley<br />\nQ B<br />\nL H B<br />\nTucker<br />\nBonner<br />\nMattox<br />\n.R.H .B<br />\nCalkins<br />\nF B<br />\nMcDonald<br />\nMarkell<br />\nSubstitutions: Hopkins—Wilson for<br />\nDarley, Spinney for Markell, Brumble<br />\nfor Middleton, Cromwell for Totterdale,<br />\nOsborne for Westerman, Council for<br />\nLandy. W. and L.—Arbogast for Herndon, Wingo for Frew. Touchdown—<br />\nMattox.<br />\n<br />\n0'614Z<br />\n<br />\nRemember that Melachrino is a master<br />\nblend of the finest Turkish Tobaccos<br />\nas originated by Miltiades Melachrino.<br />\nEgyptian cigarettes are simply those<br />\nthat originated in Egypt. But the tobacco is what you want to know about<br />\n—and if it's Melachrino — it's right<br />\n<br />\nelachrino<br />\n<br />\n\"The One Cigarette Sold the World Over\"<br />\n<br />\n\f", "format": "basic_html", "processed": "ES<br /><br />\nde<br /><br />\n81<br /><br />\nVOL. XXVI. No. 16<br /><br />\nBALTIMORE, MD., NOVEMBER 30, 1921<br /><br />\nHOPKINS LOSES LAST GAME<br />\nBY A SINGLE TOUCHDOWN<br /><br />\nPRICE 5 CENTS<br /><br />\nDEAN LATANE ADDRESSES ALL-MARYLAND TEAM IN- PLANS FORMING FOR THE<br />\nFRESHMAN-SOPHOMORE<br />\nSWARTHMORE CONFERENCE CLUDES FOUR J. H .U. MEN<br />\nGAME<br />\nVoices Resentment at Present-day In- Two Backfield and Two Linesmen<br />\ntrusion of Commercial Incentives<br />\ninto the Realm of Education.<br /><br />\nShould Gain Places. Totterdale<br />\nShould Lead Mythical Eleven.<br />\nBrewer Probable Best Bet.<br /><br />\nDance to Be Held in C. E. Hall After<br />\nContest. Tentative Lineup Announced.<br /><br />\nAfter Outplaying Visitors, Successful Pass by Generals Proves On November 26, at the annual<br />\nAt a joint meeting held TuesWith the football season over,<br />\nDownfall of Black and Blue. Contest Played in Sea<br />\n.meeting of the Association of Colday the committees appointed by<br />\nfans have but to speculate on<br />\nof Mud. Wilson Makes Sensational Run<br />\nleges and Preparatory Schools of the<br />\nthe respective presidents of the<br />\nthe all-Maryland football team se-<br /><br />\nSophomore and Freshman Classes<br />\nGENERALS FORTUNATE TO J. H. U. FINISHES SECOND IN the Middle States and Maryland<br />\nlections for the year. The mythSCORE VICTORY<br />\nS. A. I. A. A. CLASS CROSS- at Swarthmore, Dr. Latane made ical eleven this year, as in the past, decided upon several important<br />\none of the most striking addresses<br />\nquestions relating to the interCOUNTRY RACE<br />\nUmpire's Decision Questioned. J. H. U.<br />\nchosen by a combeen uttered in recent will probably be<br />\nclass football game and class rush<br />\nProved Superior for Three and<br />\nCaptain Sommerville Suffers Bad Spill. which has<br />\neditors of the loyears. It was a poignant criticism mittee of sporting<br />\na Half Periods.<br />\nBooth Leads the Field.<br />\nto be held on December 10. The<br />\ncal<br />\npress.<br />\nsystem.<br />\neducational<br />\nof<br />\nour<br />\nwhole<br />\nquestion of eligibility arose and it<br />\nHopkins<br />\ncross-country<br />\nJohns<br />\nUnder the most unfavorable<br />\nThe NEWS-LETTER has not atIs the average college graduate<br />\nwas practically decided, on acsecond<br />\nin<br />\nthe<br />\nannual<br />\nfinished<br />\nteam<br />\nweather conditions and with the<br />\ntempted to select such an eleven,<br />\nculture?\"<br />\nasked<br />\nof<br />\ntoday<br />\na<br />\nman<br />\nof<br />\ncount<br />\nof the requests of Coaches<br />\nA.<br />\nI.<br />\nrun<br />\nS.<br />\nof the<br />\nbut the selections of individuals<br />\nmost favorable football breaks cross-country<br />\nall<br />\nwill<br />\nthink<br />\nwe<br />\nLatane.<br />\n\"I<br />\nDr.<br />\nVan<br />\nOrman<br />\nand Armstrong, to alA. A., held on the Homewood<br />\nabout the campus seem to be pretty<br />\nWashington and Lee made<br />\nis<br />\nin<br />\nCulture<br />\nis<br />\nnot.<br />\nagree<br />\nthat<br />\nhe<br />\nlow<br />\nnone<br />\nof<br />\nthe men who have<br />\ncourse on Saturday. In the official<br />\nThanksgiving even more unbear- tabulation, Hopkins was placed its nature more or less aristocrat- much the same. It would perhaps taken part in Varsity contests this<br />\nseem prejudiced to place eight<br />\nable for Hopkins than elements third, but the correct scoring reads, ic, while democracy is the goal of<br />\nyear to play. This excludes a<br />\nHopkins men on the phantom team,<br />\neducation.\"<br />\npresent<br />\nday<br />\nnumber<br />\nof good men on both<br />\nhad done. After outplaying the Washington and Lee, 44; Hopkins,<br />\nbut from the records of claimants<br />\nthat<br />\nculture<br />\nsay<br />\nto<br />\nHe<br />\ngoes<br />\non<br />\nteams,<br />\nbut allows ample opporGenerals in three quarters, only to 47, and Virginia, 55.<br />\nin its old sense is not one of the for each of the positions, such an tunity for the coaches to pick out<br />\nmixup<br />\narose<br />\nout<br />\nof<br />\nthe<br />\nfailThe<br />\nsee gains minimized by the slopeducation, but appointment would be logically fair promising material for next year's<br />\nure of the judges to give unto Som- principal aims of<br />\npy condition of the field and only<br />\nproportion and square.<br />\nteam.<br />\nerville the credit that was Somer- that an overwhelming<br />\nThe most anti-Hopkins grid fan<br />\nto be robbed of a touchdown by<br />\nIt is possible that a nominal adThe Hopkins captain of students are going to college must admit the superiority of four<br />\nville's.<br />\nincompetent refereeing, the Hop- would probably have finished not only- for the money and asset it<br />\nmission will be charged for those<br />\nof our men. At the quarter back<br />\nwho do not hold Hopkins A. A.<br />\nkins forward defense gave ground worse than fitfh or sixth had it not will later be to them. They go to position, two<br />\nnames only can be<br />\ncollege because it pays in the comtickets,<br />\nthe proceeds to be given<br />\nreceived.<br />\nbad<br />\nspill<br />\nhe<br />\nbeen<br />\nfor<br />\na<br />\nmomentarily in the fourth quarmercial sense. There is too much considered: Darley and Fox. Sem- to the Athletic Association which<br />\nhim<br />\nof<br />\nter; but this wavering was long This spill not only robbed<br />\nspecialization. He deplores the in- ler, of State, although a wonderful is sadly in need of funds. The<br />\nmuch time and strength, causing<br />\nenough to allow the astute Lextrusion of commercialism and little pivot man, cannot be classed joint committees in charge of the<br />\nhim to wind up thirteenth, but<br />\nsolimercantilism into the realm of cul- with the first two, who have proved game have decided to hold a dance<br />\ningtonians to slip over the<br />\ntearing off his number was the<br />\ntary and decisive score of the aft- probable cause of the officials fail- ture. Dr. Latane went on to say: superior men from every angle of similar to those given heretofore<br />\n\"We have abandoned culture as the game. Fox, having had pre- by the Cotillon Board in the C. E.<br />\nernoon.<br />\ning to check him at all. As a rethe prime aim of education. We vious experience, both profession- Hall afterward and the usual adAll the thrills imaginable were sult, instead of being credited with<br />\nare selling education to the al and collegiate, and having played mission of fifty cents will be<br />\npacked into the fatal fourth quar- men finishing first, seventh, eighth, masses and make the state pay fewer games than Darley, should<br />\ncharged to help cover expenses.<br />\nter. The first half of the quarter thirteenth and seventeenth, Hop- for it. In doing so we are neces- not be given as much considera- All Hopkins<br />\nmen are expected to<br />\nkins was charged with men finishwas merely a repetition of what<br />\nsarily lowering the standards. It tion. Darley has proven a wonder- attend.<br />\ning first, seventh, eighth, sevenis impossible to lift our entire ful general, mixing his plays and<br />\nhad happened in the three pre- teenth and twenty-third.<br />\nThe usual rush will be held ten<br />\ndemocracy up to the limit of the always holding something in re- minutes between the halves and<br />\nceding quarters with Hopkins<br />\nThe Hopkins team really gave a<br />\nserve. Fox, although a good di- ten minutes after the completion<br />\nold idea of culture.\"<br />\ngaining ground through Calkins very fine exhibition, one that would<br />\nAfter expressing the fear that rector, specializes in carrying thc of the game. The rush has been<br />\nsuperior punting. But suddenly have resulted in bringing the cham- in giving education to the many, ball. As an all-around quarter,<br />\nsomewhat modified; the first half<br />\nWith the period half over and pionship to Homewood had not the we neglect he few who are really Darley should be practically unop- will<br />\nbe run as usual, but in the<br />\njinx overtaken Somerville. Booth<br />\nafter Calkins had missed an atworth it, he scathingly criticises posed for first choice.<br />\nsecond<br />\nhalf the Freshman banner<br />\nran his usual unapproachable race<br />\nSelection of half backs is a more will be suspended from a pole<br />\ntempted drop kick thus making a to finish in 24.49 far ahead of any the product of our universities and<br />\ndifficult problem. Bonner, Kirk- about nine feet from the ground<br />\nscoreless tie seem inevitable, one cempetitor. Somerville showed un- colleges. He continues:<br />\n\"Does the college graduate of patrick, Marken and Brewer are and it will be the object of the<br />\nof Calkins' punts was blocked and usual determination to come<br />\ntoday use correct English and is all likely claimants. Of these, Sophomores to remove it.<br />\nit was the Generals' ball in mid- through eleventh after his bad fall,<br />\nbe able to write effectively? As- \"Kirk\" is the easiest eliminated,<br />\nA strictly tentative lineup, subfield. Then before Hopkins had and the running of Milligan and suredly not. Even graduate stu- having been forced out of the game ject to<br />\nchange on both sides, has<br />\nEdwards, sixth and seventh, rerealized what had happened, Matdents are deficient in the true art for a good part of the season. been announced as follows:<br />\ntox shot two long and cleverly de- spectively, were of the highest cal- of writing.\"<br />\nBrewer, whose toe did the only<br />\nSOPHS.<br />\nFRESHMEN<br />\nceptive forward passes to Arbo- ibre. Fenton, a newcomer in HopIn this address Dr. Latane scoring for his team in three of its<br />\nkins<br />\ncross-country<br />\nranks,<br />\ndid<br />\nwell<br />\nDunning<br />\nL<br />\nE<br />\nTurnbull<br />\ngast who was not downed till he<br />\nsounded a note which has been contests, will undoubtedly be se- Shriver,<br />\nBergin<br />\nJ.S.V.B. L T<br />\ngarner<br />\nto<br />\nseventeenth<br />\nin<br />\nsuch<br />\ncomreached Hopkins 18-yard line.<br />\ngrowing louder and louder during lected one of the half backs. Se- Smallwood<br />\nYoung<br />\nL G<br />\nC<br />\nSummers<br />\nHere Hopkins held for three petition, under such unfavorable the past few years. Men are be- lection between Markell and Bon- Shriver, G. M<br />\nHutzler<br />\nR G<br />\nFargo<br />\nweather<br />\nconditions.<br />\ndowns but on the fourth Matteginning to lose their satisfaction ner forces us to choose the Texas Raleigh<br />\nR T<br />\nBates<br />\nThe corrected order of finishing with the present and with modern speed merchant, for his ground- Meyer<br />\nR E<br />\nGump<br />\nshot another pass to Arbogast carHarwood<br />\nBalsam<br />\nQ B<br />\nrying the ball to Hopkins one- is:<br />\ninstitutions. A spirit of question- gaining ability, if for nothing else. Marchetti<br />\nMerlees<br />\nL H<br />\nFarbman<br />\nR H<br />\nyard line and first down. A plunge 1 Booth, Hopkins, 24.49.<br />\ning and criticism is more and Bonner has in every game played Ellicott<br />\nJones<br />\nLumbach<br />\nF B<br />\nby Mattox completed Hopkins' 2. Smith, Washington and Lee, more insistently demanding to been able to shake off his tacklers<br />\ndownfall.<br />\n25.00.<br />\nbe heard. It is this which is one of and make long runs. His total<br />\nJOHNS HOPKINS SYMPHONY<br />\nHopkins was stunned for a mo- 3. Crook, Maryland, 25.08.<br />\nthe most encouraging signs of a yardage, compared with his fellow<br />\nORCHESTRA<br />\nment but quickly rallied its forces<br />\nfuture intellectual revival.<br />\nbacks, is probably far greater. He<br />\n4. Bohannon, Virginia, 25.10.<br />\nThe Johns Hopkins University<br />\nfor a return blow. After receiving<br />\nand Brewer will be chosen half<br />\nSymphony Orchestra, which last<br />\nthe kick, a line buck and a for- 5. Goward, Virginia, 25.15.<br />\nCONFERENCE backs.<br />\nINTERFRATERNITY<br />\nward pass failed to gain, but on 6. Howard, Washington and Lee,<br />\nAt full, Tickey and Calkins both season consisted of about 90 playTO BE HELD<br />\n25.20.<br />\nthe next play Calkins shot the ball<br />\ners, has begun its rehearsals at the<br />\nNinety-two American colleges have claims. Eric, by virtue of<br />\nto Carl Wilson on a short forward 7. Mulligan, Hopkins, 25.28.<br />\nsuperior punting and toe work in Peabody Institute under the diand universities will be representPass. The elusive quarterback who 8. Edwards, Hopkins.<br />\ngeneral, should be selected. How- rection of its conductor, Mr. Chas.<br />\nhad gone in for Darley when he 9. Swope, Washington and Lee. ed at the thirteenth interfraternity ever, as Brewer has been chosen<br />\nH. Bochau. A splendid opportuniconference to be held at the Hotel punter for the mythical aggregaWas injured then succeeded in<br />\n10. Richards, Maryland.<br />\nty for both members of the Unicarrying the ball over 40 yards<br />\nPennsylvania Friday and Satur- tion, Tickey will probably be seto Washington and Lee's 20-yard 11. A. R. Shands, Virginia.<br />\nversity and also outside musicians<br />\nday. The delegates come from lected full back.<br />\nline. After a line buck that gained 12. Hieskell, Washington and Lee.<br />\nThere is little choice for wing se- of both sexes is offered to study<br />\nevery part of the country as well<br />\nonly a yard or so Calkins again 13. Somerville, Hopkins.<br />\nfrom Yale and Harvard as from lections. There have been no stars best orchestral music under exheaved the ball this time in the 14. Compher, Maryland.<br />\nat this position this season. Bran- perienced instructors.<br />\nRehearsals<br />\nCalifornia, Iowa, Center, Texas,<br />\ndirection of Hap Middleton. It 15. Pass, Washington and Lee.<br />\nner, of State, and Brown, of Mt. are held on<br />\nTuesday<br />\nevenings<br />\nin<br />\nMaine and many other colleges St. Mary's, according to gossip, will<br />\nwas just out of Hap's reach, how16. Stevens, Virginia.<br />\nthe<br />\nConcert<br />\nHall<br />\nof the Peabody.<br />\nhardly familiar in the East. Even be selected for these positions.<br />\never, and as the ball hit the<br />\nVacancies<br />\nexist<br />\nfor<br />\ng<br />\n.round the whistle blew, thus end- 17. McDonald, Maryland.<br />\ngood players<br />\nToronto is represented.<br />\nWesterman, Knecht, Nisbet,<br />\ning Hopkins last desperate chance 18. Fenton, Hopkins.<br />\nof<br />\nviolin,<br />\nviola, cello, bass horn<br />\nColumbia is in the lead in the Ward and Chapman all have fair<br />\nfor victory.<br />\n19. Greene, Virginia.<br />\nand trombone, so any students declaims<br />\ntackle<br />\nto<br />\nthe<br />\npositions.<br />\nBy<br />\nIt had been a wonderful at- 20. Gannaway, Washington &amp; Lee. number of representatives sent to virtue of greater experience and siring<br />\nto join should make applithe conference by the leading fratempt to stave off an undeserved 21. Terry, Maryland.<br />\nconsistent work, however, Nisbet cation immediately to<br />\nF. C. Smith,<br />\nternities of the country, each of<br />\nde<br />\n.feat. But it came too late. Hopand T. Chapman, of Mt. St. Mary's, Box<br />\n22. Cohen, Virginia.<br />\n850.<br />\nThis,<br />\nthe<br />\nfourth<br />\nwhich<br />\ndesignated<br />\nthree<br />\ndelegates<br />\nseason,<br />\nkins had made one other blow at<br />\nwill be the selection of the local<br />\npromises to be a great success.<br />\nthe Generals' goal line. In the sec- 23. Wootten, Maryland.<br />\nColumbia press.<br />\nand two alternates.<br />\n°nd period with the ball in hos- 24. Cronin, Hopkins.<br />\ndelegates number 31.<br />\nChoice between Magill, Landy Announcement of concerts will be<br />\n25. Seitz, Hopkins.<br />\nmade in the near future.<br />\nContinued on page 4, col. 2<br />\nContinued on page 2, col. 1<br />\nContinued on page 3, col. 1<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 30, 1921<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\nFOUNDED 1897.<br /><br />\n$2.50<br /><br />\nSubscription<br /><br />\nat<br />\nEntered as second-class matter December 3, 1909, at the Postoffice<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nMANBusiness communications should be addressed to the BUSINESS tions<br />\ncommunica<br />\nother<br />\nand<br />\narticles<br />\nall<br />\nY;<br />\nUNIVERSIT<br />\nHOPKINS<br />\nJOHNS<br />\nAGER,<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\nTelephone<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22,<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\nAssociate Editors:<br />\nEDWARD G. HUEY, '22.<br />\nELI F. ANK, JR., '22.<br />\nJunior Editors:<br />\nCHARLES C. MARBURY, '22.<br />\nJ. BRENTNALL POWELL, '23.<br />\nCRAIG E. TAYLOR, '24.<br />\nJ. HUDSON HUFFARD,'23<br />\nJOSEPH S. LEIPOLD, '24.<br />\nDONALD H. KIRKLEY, '25.<br /><br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br /><br />\nfunds, that body can only recommend, not dictate. However, it<br />\ngave the matter much discussion<br />\nand it was unanimously agreed that<br />\nthe members of our team should receive some recognition of their<br />\nprowess. It was suggested that<br />\nthis trophy should take the form of<br />\na football, somewhat similar to<br />\nthose that The Sun gives out to its<br />\nall-Maryland team. These souvenirs should, it was generally felt,<br />\nbe donated by the Varsity Club.<br />\nWhatever the outcome of the<br />\nmatter is, we have the team and<br />\nwe mustn't let anyone forget it.<br /><br />\nST. DAVID'S<br />\nProtestant Episcopal Church<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nRoland Park<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\nSUNDAY SERVICES<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\n8 P. M.—Choral Evening Prayer<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br /><br />\nDRAPERIES<br /><br />\n343 NORTH CHARLES STREET<br /><br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br /><br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nSts., Baltimore, Md.<br />\nPrinted by The Read-Taylor Co., Lombard and South<br /><br />\nBALTIMORE, MD., NOVEMBER 30, 1921<br />\nTHE SPIRIT AT HOPKINS<br />\na<br />\nSo far this year there has been manifestd here at Hopkins<br />\nunis<br />\nwhich<br />\nloyalty,<br />\noodness<br />\no-g<br />\nhonest-t<br />\nof<br />\nspirit of \"go get it\" and<br />\nand<br />\ndeniably superior to the brand found at most of our colleges<br />\nappears<br />\nThere<br />\nHopkins.<br />\nJohns<br />\nat<br />\nwhich has never been surpassed<br />\nworthwhile ento be a willingness to earnestly co-operate in every<br />\nhope will be<br />\nall<br />\nwe<br />\nwhich<br />\ndeavor which is highly commendable and<br />\nsquarely<br />\nstood<br />\nhas<br />\nbody<br />\nperpetuated and developed. The student<br />\nuphold<br />\nto<br />\nor<br />\nimprove<br />\nbehind every effort that might possibly tend to<br />\nof<br />\nmembers<br />\nThe<br />\nthe traditionally high standards on the campus.<br />\nlot<br />\nfine<br />\na<br />\nbe<br />\nto<br />\nes<br />\nthe incoming class of 1924 have proved themselv<br />\nspirit and a<br />\nof men and they are already showing an admirable<br />\nreadiness to become absorbed in the body of students here at Home-<br /><br />\n/Evetything for A<br />\nQUALITY—<br />\nnothing for show<br /><br />\nwood.<br />\nThis willingness'to work for everything at Hopkins cannot be<br />\na<br />\npraised too highly—but it must be kept alive. It has rolled up<br />\nBlue<br />\nand<br />\nBlack<br />\nthe<br />\ncarry<br />\nto<br />\nmuch<br />\ndid<br />\nwave of enthusiasm which<br />\nfootball team through a successful season and on to the state gridiron championship. More of the \"Beat St. John's\" spirit will improve<br />\nthe standard of athletics and mean much to the University as a<br />\nwhole. With the possibility of a basketball season near at hand, let<br />\nus see the same enthusiastic spirit so that we may look forward to<br />\ncelebrating the completion of another successful schedule.<br /><br />\n0. D. K. SONG BOOK<br />\nThe Hopkins Song Book, which has been compiled by the Omicron Delta Kappa Society, and is now in press, is yet another proof<br />\nof the steady growth of the University. For years the publication of<br />\nsuch a book has been discussed only to be abandoned because deemed<br />\nimpractical.<br />\nThe finished book will be a credit to Hopkins. No time nor<br />\nof<br />\nnecessary expense has been spared. Rather than run the risk<br />\n,<br />\nhaving it appear cheap, an expensive cover has been provided<br />\nmaking it necessary to charge $1.25 a copy. In its final form, however, the book is one of which we may all be proud.<br />\nIt should not be necessary to urge every student to buy one or<br />\nwhich<br />\nmore of these books. The Hopkins Song Book is something<br />\nHard<br />\nHopkins.<br />\nof<br />\nadmirer<br />\nand<br />\nlover<br />\nshould be in the home of every<br />\nnot<br />\ndo<br />\nthings<br />\nof<br />\nbest<br />\nthe<br />\neven<br />\nexperience, however, has proved that<br />\nthereforce,<br />\nsales<br />\na<br />\ninto<br />\ns<br />\nsell themselves. Let us organize ourselve<br />\nfore, and talk the song book up among our friends, the faculty and the<br />\nalumni. In this way only can we make the sale of the book a success, and reward to some extent the efforts of those who compiled it.<br />\nINTER-FRATERNITY CONVENTION<br /><br />\nContinued from pagc 1<br /><br />\nCornell is second with 19 representatives, among them the president of the conference, Don R.<br />\nAlmy, a lawyer of 46 Cedar street,<br />\nN .Y. U. is third with 11.<br />\nIllinois is the first of the more<br />\ndistant universities with 8, while<br />\nYale and Michigan follow with 7,<br />\nPenn with 6 and Williams with 5.<br />\nMore than 200 college fraternity<br />\nmen in all will be present.<br />\nThe interfraternity Conference,<br />\nthe advisory council of practically<br />\nall of the country's men's college<br />\nfraternities, will discuss a number of problems at American colleges at its tIvo-day convention.<br /><br />\nOUR CHAMPIONSHIP TEAM AND<br />\nTHE GOLD FOOTBALLS<br /><br />\nFor the first time since nineteen<br />\nfifteen Johns Hopkins has a State's<br />\nchampionship football team, one of<br />\nthe best it has ever had, and one<br />\nwhich should go down in its history. This team. has given us a<br />\ngood chance to attain a real place<br />\nin athletics, and it is certainly up<br />\nto those interested in the University to see that the record of its<br />\nachievement be remembered and<br />\nprofited by.<br />\nThis was the problem that faced<br />\nthe Athletic Board at its last meeting. Hampered by its lack of<br /><br />\nHAT'S OUR IDEA in making CAMELS — the<br />\nQuality Cigarette.<br /><br />\nT<br /><br />\nWhy, just buy Camels and look at the package! It's<br />\nthe best packing science has devised to keep cigarettes<br />\nfresh and full flavored for your taste. Heavy paper outside—secure foil wrapping inside and the revenue stamp<br />\nover the end to seal the package and keep it air-tight.<br />\nAnd note this! There's nothing flashy about the Camel<br />\npackage. No extra wrappings that do not improve the<br />\nsmoke. Not a cent of needless expense that must come<br />\nout of the quality of the tobacco.<br />\nCamels wonderful and exclusive Quality wins on merit<br />\nalone.<br />\nBecause, men smoke Camels who want the taste and<br />\nfragrance of the finest tobaccos, expertly blended. Men<br />\nsmoke Camels for Camels smooth, refreshing mildness<br />\nand their freedom from cigaretty aftertaste.<br />\nCamels are made for men who think for themselves.<br /><br />\nR. J. REYNOLDS TOBACCO COMPANY, Winston-Salem, N. C.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 30, 1921<br />\nEVERYTHING READY FOR NOTABLES TO VISIT HOMEWOOD<br />\nContinued from page 4<br />\nBIG ARMY-MARINE GAME<br />\nsun on uniforms, brass buttons and<br />\nThe football eyes of the country<br />\nhigh silk hats, the splotches of<br />\nwill be centered upon Homewood<br />\ncolor presented by gayly dressed<br />\nField next Saturday when the<br />\nwomen; the splendid beefiness of<br />\nArmy-Marine game will take place.<br />\nArmy team, and the alert poise<br />\nthe<br />\nIt has been announced that Presiof the Marine.<br />\ndent Harding will attend and othThe majority favor the Marines<br />\ners prominent in national.nd state<br />\nto win, but their heavy opponents,<br />\ngovernment will take their places<br />\nand root for their favorite teams. spurred by the pressure of the famous visitors, should put up a batThe Army team has been selected<br />\ntle well worth seeing.<br />\nfrom the posts in the Third Corps<br />\narea, including Camp Holabird, The taking and selling of tickets and other arrangements is unCamp Meade, Langley Field, and<br />\nder Hopkins management, and the<br />\nCarlisle Post. The team selected<br />\nhas been practicing steadily for Hopkins ushers will be out in force.<br />\nOrder will be kept by special dethree weeks, devoting the entire<br />\ntachments of police, civil and miliday to football. The team is untary, and marines; and secret serdoubtedly a strong one, many forvice men will guard the noted vismer college stars being included in<br />\nitors.<br />\nthe lineup. Captain Ignico, who is<br />\nThis will be the last game to be<br />\nalso captain of the team, was a forplayed on Homewood Field, except<br />\nmer star at Washington and Lee.<br />\nthe Freshman-Sophomore tilt.<br />\nMabbutt, the 314-pound center, is<br />\na former University of Idaho player and also<br />\n. attended West Point.<br />\nUnderwood, a tackle from Univer- 0. D. K. SONG BOOK IN PRESS<br />\nsity of Minnesota, will start the<br />\nThe work on the Omicron Delta<br />\ngame for the Army. A full-blood- Kappa songbook has gone to press,<br />\ned Indian, weighing 225 pounds, it was announced by Doug. Coulwill start at the other tackle berth. ter, Editor-in-Chief, and it is probMajor Daly, coach of the West able that the long-awaited publicaPoint eleven, has come down from tion will make its appearance beWhite Plains and will assist in pol- fore the Christmas holidays.<br />\nishing off the dopghboys for the<br />\nThe book will have thirty-two<br />\ncontest, and reports that they are pages and will have a four-page<br />\nin first-class shape.<br />\ncover, which will be of heavy maThe Marine team is composed terial. The outside<br />\ncover will be<br />\nmostly of athletes from the Marine colored a distinctive<br />\nblue. A picaviation field, and, although they ture of Gilman Hall, a Hopkins<br />\nProbably have not as many former Seal and the title,<br />\n\"Hopkins Song<br />\ncollege stars in their lineup, they Book,\" will appear on the cover<br />\nhave shown themselves a team to page of the back.<br />\nTwenty-five<br />\nbe reckoned with.<br />\npages will be taken by songs and<br />\nAs the Marines built the extra music; four pages by songs<br />\nand<br />\nstands at Homewood, they have yells. The remainder of the pages<br />\nbeen assigned to the concrete will be utilized for<br />\ntitle pages, dedstands and the Army has been ,del- ications, etc. There will be, in all,<br />\negated to the stands on the other sixteen songs.<br />\nside of the field.<br />\nThe 0. D. K. has succeeded in<br />\nA capacity crowd is expected and setting the very reasonable price<br />\nof<br />\nthe regular ushers will be assisted $1.25<br />\nfor the books. This is rein handling these Army and Ma.markable, considering the high<br />\nrine men.<br />\nquality of the material composing<br />\nThe Fifth Marine Regiment of<br />\nBelleau Wood and Chateau Their- im mesivinvemamonvemm<br />\nrY fame, will act as- an escort to<br />\nthe Marine team.<br /><br />\nthe publication and the song book<br />\nEstablished 1873<br />\nLIBERTY<br />\nwill make an ideal Christmas presA.H.Felling ManIg Jewelry Co.<br />\nent. \"Doug\" Cotton announces<br />\nExpert Cleaners and Dyers<br />\nManufacturers<br />\nthat if the book is purchased in Special Rates to Hopkins Men<br />\nFraternity Jewelry<br />\nLetter<br />\nGreek<br />\nquantities of three or more a spe211 E. 25th St.<br />\nHomewood 5205-W 213 N. LIBERTY ST., Baltimore, Md.<br />\ncial and appreciable reduction will<br />\nbe made.<br />\nThe following songs will be inIn Our Men's Section<br />\ncluded: University Ode, University Alma Mater, Black and Blue,<br />\nYou will at all times find the newest<br />\nOur Alma Mater in Dixie Land,<br />\nand most fashionable Neckwear, Shirts,<br />\nCollars and other Furnishings necessary<br />\nJohnny Hopkins, On to Victory,<br />\nto a college man's wardrobe.<br />\nTo Win, Graveyard, Everybody<br />\nBets on Hopkins, On the Line, St.<br />\nJohn's, Gooday, The Toast We<br />\nDrink, The Freshman, Hullabaloo<br />\nBoys, March, Waltz, Song, Ain't<br />\nWe Neat, Ha! Ha!<br /><br />\nHUTZLER BRITHEM<br /><br />\nWe are establishing a new standard in<br />\nYoung Men's Suits at $29.50<br />\nStyles for every taste.<br /><br />\nTeachers!<br />\nIN or rent a Corona<br />\n-1--/ typewriter on easy<br />\npayments. Carry it to<br />\nschool every day in its<br />\nneat case. Make extra<br />\nmoney writing articles or<br />\ndoing typing for others!<br />\nCalltoday at the nearest<br />\nCorona store—or telephone for a demonstration at your home.<br /><br />\nBaltimore's Best Store<br /><br />\nHOCHSCHILD,KOHN 8c,CO.<br />\nOur \"prep- room on the<br /><br />\nM. W. LUCY &amp; CO.<br />\n118 W. Fayette St.<br /><br />\nthird floor specializes in<br /><br />\nWeighs6%lbs.<br />\nFolds and fits<br />\nin a neat carrying case.<br /><br />\nclothes for young men.<br /><br />\nSnn with<br /><br />\ncase<br /><br />\nCOR0NA<br /><br />\nHub<br /><br />\nThe Persona! Writing Madurze<br /><br />\nBaltimore. Charles and Fayette<br /><br />\n•<br /><br />\nII<br />\nC\\<br /><br />\n'<br /><br />\n\"\",r<br /><br />\n•<br /><br />\nMURAD<br /><br />\nALL MARYLAND TEAM<br />\nContinued from page 1<br /><br />\nTHE TURKISH CIGARETTE<br /><br />\nand the 250-pound Keenan, of<br />\nWashington College, is difficult.<br />\nAbove mentioned rumor has it,<br />\nhowever, that Magill and Keenan<br />\nWill be chosen.<br />\nNo one should hesitate in selecting the all-State center. Totterdale stands head and shoulders<br />\nabove the rest in this department.<br />\nHe will be the undisputed selection<br />\nof all.<br />\nThough it is believed that Brewer will be selected, \"Best Bet\" and<br />\nCaptain, our selection is \"Best<br />\nBet\" — Bonner; Captain — Totterdale.<br />\nThe first team selection and<br />\nOur second team selection is as fol10<br /><br />\n3<br /><br />\nEvery day MURADS are held<br />\nhigher in the estimation of the men<br />\nwho smoke them.<br />\nThey are the standard of Taste.<br />\nThey never disappoint—never<br />\nfail—never change—<br /><br />\n‘311.1i3511. GIGARLIT<br /><br />\nThey are 100% pure Turkish tobacco—ofthe finest varieties grown.<br /><br />\nUI<br />\n-<br /><br />\nYou are proud to smoke them<br />\nin any company—on any occasion.<br /><br />\nE.SPE.CAM.X..`i FOCI T ti tima<br />\nt<br />\ni<br />\nEXPESt1E14C<br />\nARE'MADE.<br />\n111SCAltglAAVAG MAD<br />\nGRADE,_<br />\nti1GIA<br />\nSMOKER OF CAGARETTES<br /><br />\ns<br /><br />\nFIRST ALL-MARYLAND.<br />\nBranner (U. of M.)<br />\nE.<br />\nNisbet (U. of M.)<br />\nT.<br />\nMaggill (J. H. U.)<br />\nG.<br />\nTotterdale (J. H. U.)<br />\nC.<br />\nKeenan (WO<br />\nG.<br />\nT. Chapman (M. S. M.)<br />\nT.<br />\nBrown (M. S. M.)<br />\nE.<br />\nbarley (J. H. U.)<br />\nQ B.<br />\nBonner (J. H. U.)<br />\nH. B.<br />\nBrewer (U. of M.)<br />\nH.B.<br />\nTickey (St. J.)<br />\nF.B.<br />\nSECOND TEAM.<br />\nBanfield (St. J.)<br />\nE.<br />\nTHE<br />\nWesterman (J. H. U.)<br />\nT.<br />\nMoore (U. of M.)<br />\nG.<br />\nGable (M. S. M.)<br />\nC.<br />\nCollar Hug Clothes<br />\nan<br />\n(J. H. U.)<br />\nG.<br />\nBaltimore and LibegyStreets<br />\nKnecht (J. H. U.)<br />\nT<br />\nMiddleton (J. H. U.)<br />\nE.<br />\nPox (St. J.)<br />\nQ B<br />\nKirkpatrick (St. J.)<br />\nH B<br />\n••••••••••••<br />\nMarkell (J. H. U.)<br />\nH B ••••••••••••<br />\n•<br />\nCalkins (J. H. U.)<br />\nF B<br /><br />\ne-y,catkon._<br /><br />\niJ<br /><br />\nOutfitters!<br /><br />\nhead to foot<br />\nin good style<br />\nat fair prices<br /><br />\n-<br /><br />\nThey are the largest selling highgrade cigarette in the world.<br />\nThe cigarette smokers ofAmerica<br />\nDO prefer Quality to Quantity.<br />\n\"Judge for Yourself—!\"<br /><br />\n1)))))))))))))1111))1111<br /><br />\nUALITYOHOP<br /><br />\n11<br />\n714/0 Makasitheldi<br />\nafidE9041121161144\"<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 30, 1921<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br /><br />\nDR. GOODNOW THANKS MILITARY PRESIDENT HARDING AND OTHER<br />\nNOTABLES TO BE AT HOMEDEPARTMENT<br />\nWOOD SATURDAY<br /><br />\nThe Episcopal Church of<br />\nSt. Michael and All Angels<br /><br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br /><br />\nThe Army-Marine game will beJAS. H. DOWNS<br />\ngin Saturday before an audience<br />\nST. PAUL and TWENTIETH STS.<br />\nENGRAVER PRINTER STATIONER<br />\nexpected to be at once one of the Wyatt Brown, D.D., Litt.D., Rector<br />\n229 N. CHARLES ST.<br />\nlargest and most distinguished that<br />\nHoly Communion at 7.30<br />\nhas ever come to Homewood.<br />\nMen's Bible Class, 9.30<br />\nYoung<br />\nOn the sidelines will be, among<br />\nNECKWEAR<br />\nSHIRTS<br />\nother noted guests, President Morning Service, 11 o'clock<br />\nHarding, General Pershing, Secre- Evening Service, 8 o'clock<br />\ntary of War Denby, Generals But- Special Invitation to Hopkins Students<br />\n421 N. HOWARD ST.<br />\nler and LeJeune, other army offiHOSIERY<br />\nGLOVES<br />\ncers of high rank, and Mayor<br />\nBroening.<br />\nFor several weeks detachments<br />\nSTRATTON SHIRT MAKER<br />\n\"Major E. B. Garey,<br />\n226 N. Liberty St.<br />\nof soldiers and marines have been<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\nJ. H. U.<br />\nsliding about in the mud of Home$3.25 and $4.25<br />\nNegligee<br />\n$5.25 and $6.25<br />\nImported Madras<br />\nCtibeXatterie<br />\nwood Field, engaged in building<br />\nMy Dear Major Garey:<br />\nTerms Cash, Less 10% 30 Days on<br />\n3414Zs H.&amp; OSCAR G.1-51<br />\nbenches<br />\n'<br />\nthe pine-board auxiliary<br />\nShirts<br />\nI wish to express to you and<br />\nAlso a Full Line of Men's<br />\noWNERS<br />\nmarines,<br />\nThe<br />\nand<br />\ngrandstands.<br />\nthrough you to the members of<br />\nFurnishings<br />\niY111,E*4 0e4<br />\nwho were encamped near the laexercises<br />\nour<br />\non<br />\ncommittee<br />\nthe<br />\n29 Baltimore St_., East<br />\ncrosse practice wall, finished their<br />\nOne Door West of Light St.<br />\nyesterday and to the members of<br />\nand left the early part of this<br />\njob<br />\nSOLE AGENTS FOR BALTIMORE the Military Department the apAT $8.00, made<br />\nto appear as rooters Saturweek,<br />\nFor College Fraternity Bands<br />\nthe<br />\nof<br />\nUniversity<br />\nthe<br />\nof<br />\npreciation<br />\nof grain leather,<br />\n(Greek Letter Societies)<br />\nday.<br />\nway in which the exercises were<br />\nin tan or black,<br />\nThe west side of the field will be<br />\nThe Chas. Wilhns Surgical<br />\nmanaged. I have heard nothing<br />\nwith square toe and<br />\nInstrument Co.<br />\ndevoted to Marine fans, while the<br />\noccasion.<br />\nthe<br />\nof<br />\npraise<br />\nbut<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nArmy rooters will occupy the east<br />\nheavy perforations,<br />\nLIBERTY ST. at SARATOGA<br />\nI want also to congratulate you<br />\nSURGICAL INSTRUMENTS<br />\nwill<br />\nHarding<br />\n(Opposite Hotel Rennert)<br />\nPresident<br />\nstands.<br />\noxford<br />\nan<br />\nis<br />\nthis<br />\nwhich<br />\nshowing<br />\nSupplies,<br />\nand<br />\nMicroscopes<br />\non the excellent<br />\nhonof<br />\nbox<br />\nflag-draped<br />\nthe<br />\noccupy<br />\nStethoscopes<br />\nT. C.<br />\nany college man<br />\nLUNCHEON—:—DINNER<br />\nBlood Lancets was made by the R. 0.<br />\nBlood Counters<br />\nfront of the concrete stands,<br />\nin<br />\nor<br />\n11:30 until 7:30<br />\nexhimself<br />\nFoch<br />\nMarshal<br />\ncan be proud of.<br />\nbe<br />\nwill<br />\nPershing<br />\nGeneral<br />\nwhile<br />\nthe<br />\nat<br />\nDANCES<br />\nSMOKERS<br />\nBANQUETS<br />\npressed to me his pleasure<br />\nIn high shoe the<br />\nthe<br />\nof<br />\nside<br />\nat<br />\nthe<br />\nopposite<br />\nseated<br />\nBy<br />\nArrangement<br />\nmarched<br />\nway in which the boys<br />\nPrinters of Philological and<br />\nsame style is $8.50.<br />\nfield. A great crowd is anticipated,<br />\nand praised their conduct genTelephone St. Paul 6987<br />\nScientific Works<br />\nfor fully as many persons will come<br />\nerally.<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\nI am, with thanks to you for to see the President as will come<br />\nto see the game.<br />\nyour co-operation,<br />\nEnthusiasm is running high in<br />\nYours sincerely,<br />\nNorth<br />\nCharles Street,<br />\nboth camps, and both are united<br />\nLunches, Cigars<br />\nskies<br />\nclear<br />\nfor<br />\nin<br />\nfervently<br />\nwishing<br />\nFrank J. Goodnow.\"<br />\nCigarettes<br />\non Saturday. If good weather is<br />\nexan<br />\nmade<br />\nC.<br />\nT.<br />\n0.<br />\nR.<br />\nThe<br />\nhad, Homewood should not fail to<br />\nCandy, Soda and<br />\ntremely creditable showing on the present the \"colorful scene\" so<br />\nElkridge Farms Dairy<br />\nPipes and Fountain Pens<br />\noccasion of the Marshal's visit, dear to the hearts of the sports<br />\nMILK<br />\nFRESH<br />\nSTRICTLY<br />\nbeen<br />\nhas<br />\nespecially as the unit<br />\nwriters.<br />\nAt the Barn<br />\nProduced, Pasteurized and Bottled<br />\ndrilling together for only a very<br />\nThere will be columns in the<br />\nin Howard County<br />\nE. E. Adams<br />\nshort time this year. It is very for- newspapers about the gleam of the<br />\n17 E. Baltimore St.<br />\nEllicott City 231-R<br />\nCLARK BROS.<br />\ntunate that the entire battalion<br />\nContinued on page 3, col. 2<br />\nwas able to appear in new uni<br />\nPrinters of the<br />\nforms and the general appearance<br />\nalone should have been sufficient<br />\nJohns Hopkins News-Letter<br />\nto call forth the Marshal's praise:<br />\nThe extra time entailed in making<br />\nthe necessary preparations was<br />\nnot spent in vain.<br />\n—'<br /><br />\nMajor E. B. Garey wishes to<br />\nexpress through the columns of<br />\nComplete Stock of<br />\nMedical Books and College<br />\nthe News-Letter his appreciation<br />\nRequisites<br />\nfor the support given to the University officials by the R. 0. T. C.<br />\nImporters and Dealers in Fine Books<br />\nunit at the recent conferring of a<br />\n301 N. CHARLES ST.<br />\ndegree on Ferdinand Foch, marBaltimore, Md.<br />\nshal of France. That the work of<br />\nthe battalion was of high merit is<br />\nshown by the following letter of<br />\nPresident<br />\nfrom<br />\nappreciation<br />\nGoodnow :<br /><br />\nLefranc &amp; Ault<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br /><br />\n210<br /><br />\ncrimindiow<br /><br />\nHOPKINS DROPS LAST GAME<br /><br />\nWho can discriminate more<br />\ncarefully than the college<br />\nman? To his natural equipment are added the resources<br />\nof culture and the association with great minds of all<br />\nages. Such discrimination<br />\nleads naturally to the choice<br />\nof Melachrino,the One Cigarette Sold the World Over.<br /><br />\nContinued from page 1<br /><br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS<br /><br />\nSHOES<br />\nfor<br />\nUNIVERSITY MEN<br />\nFor Sport Wear<br />\nFor Dress<br />\nSmart Styles—Best Leathers<br />\nModerate Prices<br /><br />\nWYMAN<br />\n19 W. LEXINGTON ST.<br /><br />\nDR. ANDREWS TO ADDRESS THE<br />\nSCIENTIFIC SOCIETY<br /><br />\nDr. E. A. Andrews, professor of<br />\nzoology, at this university, will deliver a lecture next Tuesday, December the sixth, before the Scientific Society. The subject of Dr.<br />\nAndrews' lecture will be the Bottle Animalcule, a micro-organism<br />\nwhich inhabits the waters of nearly<br />\nall parts of the world, and grows<br />\nin a form similar to that of a bottle. The meeting of the society will<br />\nbe held at 4.15 in the large lecture<br />\nroom No. 110, in the Mechanical Engineering Building. All<br />\nmembers of the faculty and students interested in this subject are<br />\ninvited to attend the lecture.<br /><br />\ntile territory Calkins shot the ball<br />\nto \"Hap\" Middleton on the fiveyard line. \"Hap\" caught the ball<br />\nand placed it within a yard of a<br />\ntouchdown, but the officials ruled<br />\nthat the ball had hit the ground<br />\nfirst. Every _spectator knew that<br />\nthe ball had been fairly caught,<br />\nbut Hopkins chance to score was<br />\nruined.<br />\nBoth teams put up a good,<br />\nheady, scrappy game with Hopkins having a distinct edge at<br />\nevery period of the game save for<br />\nthe disastrous three minutes toward end. Markell and Bonner<br />\nmade many good gains and Calkins punting was very good.<br />\nWashington and Lee showed a<br />\nfine line and two sterling backs in<br />\nMattox and Frew.<br />\nThe summary:<br />\nJOHNS HOPKINS.<br /><br />\nWASil. &amp; LEE<br /><br />\nBemis<br />\nL E<br />\nMiddleton<br />\nWesterman ....L.T...... Moore (c)<br />\nVogel<br />\nL G<br />\nMagill<br />\nCollins<br />\nTotterdale<br />\nLandy<br />\nRangely<br />\nR G<br />\nPotts<br />\nKnecht<br />\nR T<br />\nHerndon<br />\nR E<br />\nRich<br />\nFrew<br />\nDarley<br />\nQ B<br />\nL H B<br />\nTucker<br />\nBonner<br />\nMattox<br />\n.R.H .B<br />\nCalkins<br />\nF B<br />\nMcDonald<br />\nMarkell<br />\nSubstitutions: Hopkins—Wilson for<br />\nDarley, Spinney for Markell, Brumble<br />\nfor Middleton, Cromwell for Totterdale,<br />\nOsborne for Westerman, Council for<br />\nLandy. W. and L.—Arbogast for Herndon, Wingo for Frew. Touchdown—<br />\nMattox.<br /><br />\n0'614Z<br /><br />\nRemember that Melachrino is a master<br />\nblend of the finest Turkish Tobaccos<br />\nas originated by Miltiades Melachrino.<br />\nEgyptian cigarettes are simply those<br />\nthat originated in Egypt. But the tobacco is what you want to know about<br />\n—and if it's Melachrino — it's right<br /><br />\nelachrino<br /><br />\n\"The One Cigarette Sold the World Over\"<br /><br />"}], "field_media_file": [{"target_id": 37561, "display": null, "description": null, "target_type": "file", "target_uuid": "a5167431-fc33-404b-9d8a-93b061f5393f", "url": "http://digital.library.jhu.edu/system/files/2022-03/12970-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12970, "target_type": "node", "target_uuid": "33d372f6-9417-4d47-a2fe-2de6a825b04f", "url": "/node/12970"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "cdce074e-73fd-41f9-bcae-7ad84def033b"}]}