{"mid": [{"value": 36687}], "uuid": [{"value": "6c637f04-194d-4b54-80f1-4006ebdd8dd3"}], "vid": [{"value": 36687}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:51:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12978-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:51:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:51:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVI. No. 24<br />\n<br />\nBALTIMORE, MD., JANUARY 16, 1922<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nWOODROW WILSON ISSUE<br />\nRELATIONS WITH MARYLAND STATE RESUMED<br />\n<br />\nFINAL CAST SELECTED FOR WOODROW WILSON FUND TO<br />\nBE LAUNCHED TODAY<br />\n\"CAPTAIN JINKS\"<br />\n<br />\nPresidents of Two Institutions Reach Miss Walters Pleased With Abundance Maryland's Quota in Drive $30,000.<br />\nAmicable Agreement. Game to Be<br />\nDean Latane National Committeeof Talent. Engel to Play Title Role.<br />\nPlayed November 18th.<br />\nman for State.<br />\n<br />\nWOODROW WILSON, GRADUATE<br />\nSTUDENT AND LECTURER IN THE<br />\nJOHNS HOPKINS UNIVERSITY<br />\n<br />\nThe complete cast for the big<br />\nOn Christmas Eve, 1920, a group<br />\nDramatic Club production, \"Capof women met to consider what<br />\ntain Jinks,\" has been finally chosen.<br />\nwas then a nebulous wish to pay<br />\nTwo men have been retained for<br />\nTook Degree of Doctor of Philosophy, At This<br />\nsome sort of a tribute to the man<br />\nthe leading female role, Madame who was<br />\nshortly to leave the White University,in 1886. Was Lecturer from 1887-1898<br />\nTrentoni (Aurelia Johnson). Both<br />\nHouse. There was no doubt in<br />\nof these men, W. C. Roberts and<br />\ntheir minds as to the verdict of hisBY JOHN H. LATANE<br />\nH. S. Taylor White, will be coached<br />\ntory; rather the thought was to esWoodrow Wilson entered the Johns Hopkins University in<br />\nand rehearsed in the part until one<br />\ntablish a precedent, if possible, and<br />\n1883 as a graduate student in the Department of History and Poliis so far advanced as to indicate<br />\nhonor a great American while he<br />\ntics. During his second year of residence he held the University<br />\nclearly a distinct superiority over<br />\nlived. Great men had seldom been<br />\nFellowship in History.<br />\nthe other. Both men have shown<br />\nso honored. Indeed, it was the<br />\nunusual ability as feminine imperPrior to entering the University he had spent one year at Dafairly well-established custom to<br />\nsonators,<br />\nwill<br />\nevery<br />\nthey<br />\nneed<br />\nbut<br />\nvidson<br />\nCollege, North Carolina, and had then gone to Princeton,<br />\nment.<br />\nsadden their lives with abuse and<br />\nwhere he took the A.B. degree in 1879. He then went to the UniPresident Goodnow Was very fa- bit of their skill, as the character of make amends later.<br />\nAurelia is one of the most difficult<br />\nversity of Virginia for the study of law and graduated in 1881. Durvorably impressed with the attiThe thought of a tribute of some<br />\nin the field of light comedy.<br />\ning the next two' years he practiced law in Atlanta, Georgia. His<br />\nsort was discussed among the womtude taken by the Mafyland State<br />\ndeep interest in history and political science led him to the Johns<br />\nIn the title role, Gilson Engel<br />\nand then presented to a group<br />\nen<br />\nauthorities. He states that they finds a character admirably suited<br />\nHopkins University, where Herbert B. Adams had already gathered<br />\nof men, friends of Mr. Wilson and<br />\nwere willing, on every point, to to his type and the parts of Charlie<br />\naround him a brilliant group of students. After two years of graduate<br />\nformer members of his official fammeet him more than half-way. Now and Gussie seem made to order for ily. Finally, within two weeks af- work, Wilson was appointed Associate Professor of History and<br />\nthat relations are in harmony, it is Pierce Brawner and Henry West. ter Mr. -Wilson had become a pri- Political Economy at Bryn Mawr College in 1885. He returned to<br />\nHopkins for his final examinations and was given the degree<br />\nthe desire of the presidents that ''Tom\" Jenifer earned the \"fat\"<br />\nvate citizen, there was a great winof Doctor of Philosophy in 1886. After three.years at Bryn Mawr he<br />\nthe hatchet be buried by both un- part of Mrs. Greenborough, and<br />\nter's day meeting at a New York<br />\nwas made Professor of History and Political Economy at Wesdergraduate bodies. This does not 'Joe\" Moran was selected in the<br />\nhotel, where the wish became a<br />\nleyan<br />\nUniversity, Connecticut, and in 1890 he was made Professor<br />\nmean that they want the old, and contest for the part of the hero's fact, where the nebulous desire to<br />\nof<br />\nJurisprudence<br />\nat Princeton. From 1902-1910 he was President of<br />\ntime-honored rivalry to be any less mother, Mrs. Jinks. \"Dinty\" Moore honor him while he lived became<br />\nPrinceton<br />\nUniversity,<br />\nand in the latter year he resigned to become<br />\nkeen, but that both sides should act and Bosley Hiss promise some real the very real plan to create the<br />\ncandidate<br />\nfor<br />\ngovernor<br />\nof New Jersey.<br />\nlike good sportsmen, and accept humor in the comedy parts of Mrs. Woodrow Wilson Foundation.<br />\nStonington and Miss Merriam.<br />\nvictory or defeat like gentlemen.<br />\nIn 1885 he published as his docThe materialized idea has been<br />\nWILSON A POWER IN WORLD tor's dissertation a<br />\nLittle \"Morty\" Slatkin was seUnder the new contract a game<br />\nbook entitled<br />\ndeveloped far beyond the thought<br />\nPOLITICS<br />\nwill be played with Maryland State lected through natural fitness as<br />\n\"Congressional Government: a<br />\nof a tribute to the former Presieach year for the next five years, Peter, the slangy newsboy, but he dent. It is to be that, of course, The Figure That Was Before the Eyes of Study in American Politics.\" This<br />\nthe World and the Tragedy of a<br />\nat Homewood. Next year the game will not be the smallest or young- but chiefly<br />\nis one of his best-known works, and<br />\nMan Who Lived Before His Time.<br />\ntit is to perpetuate his<br />\n.will probably be played on Novem- est actor in the piece, for \"Chic\" ideals of democracy and human<br />\nEver before men today, there it won for him immediate recogniber 18th, as this is the only date I:ice has a child's part.<br />\nfreedom, and in such form as to are two pictures of Woodrow Wil- tion as a profound student of poliThe role of Belliarti, the Italian be both an inspiration and a reOpen on both schedules. However,<br />\nson. One is of that president of tics. It was the first attempt to deif a four-sided shift can be ar- foster father of Aurelia, will be ward to other men whose ambition<br />\nscribe the actual workings of the<br />\nranged, which will include Wash- taken by Eli Frank. \"Bill\" Totter- it is to \"enable the world to live the United States, who for a few committee system in Congress.<br />\nington and Lee and the University dale, George Hess, Carl Buchheis- more amply, with greater vision, brief moments was not only leader During Wilson's career as a gradof North Carolina, the game may ter, Eric Jacobsen and Hugh Smallwith a finer spirit of hope and of the greatest state in the world, uate student, one of the most interbe played on Thanksgiving Day. wood will have the parts of reportbut was lifted to far giddier esting things that he did was to<br />\nachievement.\"<br />\nheights and became the center of organize \"The Hopkins House of<br />\nIn event of this change Maryland ers. Smallwood will also be the<br />\nThe Foundation is to be, in words<br />\nthe -world's hope. In a time of Commons,\" a debating society comState would play North Carolina on understudy of Gilson Engel as Cap- now widely familiar:<br />\ndarkness and despair, of distrust posed of undergraduates and gradthe 18th, and Hopkins would play tain Jinks.<br />\n\"Created in recognition of the<br />\nand<br />\ndisillusion, the hopes and uates, conducted according to<br />\nWashington and Lee on the same<br />\nThe competition for parts has national and international services<br />\nthe<br />\ndate. To complete the shift, North been so keen that a great many men of Woodrow Wilson, twice Presi- prayers of millions turned to him. general parliamentary procedure of<br />\nCarolina and Washington and Lee v,ho showed a very definite promise dent of the United States, who fur- His position was one terrible in its the British House of Commons.<br />\nwould play on Thanksgiving Day. have not been fitted into parts. It thered the cause of human freedom power and dangerous in its re- he constitution and by-laws of<br />\nA clause in the new tontract was a source of real regret to the and was instrumental in pointing sponsibility.<br />\nthis society were written apparentOvernight from this pinnacle Ile ly by Wilson and printed in the<br />\nstates that Maryland State will not coaches that these men could not out effective methods for the coPlay in Baltimore except at Home- be cast. As there is a real possi- operation of the liberal forces of fell, rejected by his own people. University Circular for January,<br />\nabandoned by all. We then see 1886. This society attracted a<br />\nwood. This will do away with the bility of some of the parts becom- mankind throughout the world.<br />\nvery objectionable situation of last ing vacant through the machina- \"The Award of Awards from him as the white-haired, shattered great deal of attention and was<br />\nYear, when Hopkins was playing at tions of the blacklist and like in- the income of the Foundation will figure, forgotten by most in the given a considerable amount of<br />\nHomewood, and Maryland State struments of torture, there is still be made from time to time by a ever-turning- tide of hustling time publicity in the press of the counat Oriole Park, dividing the atten- a chance that these men may be nationally constituted committee to affairs and events. Alone, looking_ try. A writer in The Nation, Detion of local football fans. In re- needed. In order to recognize the individual or group that has on at the unheeding onrush of cember 3, 1885, objected to the<br />\nciprocation Hopkins agrees to rent these men the club has drawn up rendered within a specific period, world progress, with his dreams adoption by American college stuHomewood Field to Maryland a reserve list of men who will be meritorious service to democracy, blasted, his hopes unrealized and dents of the British House of ComState on those dates that the Black called on in any emergency. They public welfare, liberal thought or his aspirations denied; a seeming mons as a model rather than our<br />\nfailure.<br />\nand Blue is scheduled to play out are Hunter, English, Stephens, peace through justice.\"<br />\nown House of Representatives. He<br />\nThe<br />\nof town, and in future years the Young, Sachs, Stabler, D. P. Cotlofty<br />\nideals<br />\nfor<br />\nwhich<br />\nWil<br />\nsaid, \"The Johns Hopkins UniverIn brief, America is to have its<br />\nson fell were the ideals of a new sity has never, hitherto, been acschedules of both universities will ton, Evans, Croker and F. J. Rich. own Nobel prizes.<br />\nbe arranged so that State's big<br />\nMen taking other parts are: A<br />\nSubscriptions will be received era. He sought a great mora' cused of Anglomania. It is prehome games will occur when Hop- detective, D. S. Kirkley ; a sailor, throughout the United States dur- peace, a new world order rising eminently sui generis—a little Gerkins is away. By this agreement Hoffmeister ; a policeman, Sher- ing the week beginning Monday, visibly on the ruins of the old. But manic in its predilections, if you<br />\nthere will be a good football game wood; Mary's maid, W. C. Gard- January 16. Each state' has a com- it was seldom barren ground. His like, but liberal and catholic withal.<br />\nPlayed at Homewood every Satur- ner; ladies of the ballet, Adams, mittee, and to each state has been high moral idealism did for a mo This broadness, however, should<br />\nday during the season.<br />\nMount, Feldstein, Ben Rich and assigned a quota. Several of the ment dominate the brutal passions not be carried to the extent of deNext year St. John's and Mary- Julian West.<br />\nstates, among them Oregon and Il- which had torn the Old World veloping parliamentarians at the exland State will play at Homewood<br />\nThe first rehearsal was held Sat- linois, have notified the National asunder but it was for only a mo- pense of congressmen.\"<br />\n011i September 30th. On this date urday morning and Miss Walter Committee that their full quotas ment. He was quickly submerged<br />\n,<br />\nIn the next issue, December 10,<br />\nHopkins (Toes to Princeton for the started things going immediately.<br />\nhave already been pledged. Mary- among the lusts for national gain. 1885, The Nation had a letter from<br />\nst game of the season. Those stu- Some of the men showed unusual land's quota is $30,000, and the<br />\nIn the story of Woodrow Wil- \"a member of the Hopkins House<br />\ndents who find it impossible to take conceptions of their parts, and on chairman of the campaign is Mr. son there is a tragedy, the tragedy of Commons,\"<br />\nvindicating the<br />\nthe trip to Princeton, will be able the whole a good start was made. Clarence K. Bowie. The National of the ages. It is that of a man choice of the<br />\nprocedure of the Britto see a good game here, under this Lipps will again manage the prop- Committeeman for Maryland is Dr. who has lived before his time, who ish<br />\nHouse of Commons as better<br />\nnew agreement.<br />\nerty men. While the scenic work- John H. Latane. Contributions is too great for his age. The cyn- adapted to meet the requirements<br />\nAn attempt will be made to ers and costume designers .will all may be handed in to either of these ics scoffed, his friends were si- of a debating society than<br />\nthe lowschedule a baseball and a lacrosse be under the general direction of or to any member of the student lenced and finally his own people er house of Congress. He pointed<br />\ngame with State for this year.<br />\nMariano Badillo.<br />\ncommittee.<br />\nContinued on page 3, col. 2<br />\nContinued on page 4, col. 2<br />\nAt a conference, held in Gilman<br />\nHall, Wednesday, January 11, President Goodnow, of Johns Hopkins,<br />\nand President Wood, of Maryland<br />\nState, signed a five-year contract<br />\nfor annual football games between<br />\nthe two universities. Both were<br />\nvery anxious to repair the break<br />\nwhich occurred several years ago,<br />\nand each was willing to give and<br />\ntake in order to reach an agree-<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 16, 1922<br />\n<br />\n2<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\nFOUNDED 1897.<br />\n<br />\nSubscription<br />\n<br />\nNews-Letter<br />\n<br />\nENGLISH ECONOMIST ADDRESSES ASSEMBLY<br />\n<br />\nMr. Hirst of London Delivers Interesting<br />\nTaik on David Lloyd George. Introduction by Dr. Latane.<br />\n$2.50<br />\n<br />\nALUMNI!<br />\n<br />\nThe speaker at the Assembly<br />\nlast Thursday was Mr. Francis W.<br />\nHirst, of London. Mr. Hirst is an<br />\neconomist of some note and besides being a former editor of<br />\n\"The Economist,\" he has written<br />\nHomewood 100 several authoritative books on<br />\nTelephone<br />\nthat subject. His profession has itor for as much as she owes and • EORGETOWN PLANNING $350,000<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nSPORT STADIUM<br />\nthat the money we lent her is only<br />\n'22,<br />\nCOTTON,<br />\nH. DOUGLAS<br />\nFREDERICK W. LIPPS, '22.<br />\ngiven him the opportunity to bea recompense for our not having Georgetown University is conManaging Editor:<br />\ncome acquainted with some of men in the field.<br />\n'23<br />\ntemplating the construction of a<br />\nWILLIAM H. MOORE, JR.,<br />\nEngland's greatest men, among<br />\nCirculation Manager:<br />\n$350,000 athletic stadium, with<br />\nAssistant Managing Editor:<br />\nGLOVER P. FALLON, '23.<br />\nthem Mr. David Lloyd George,<br />\nPHI GAMMA DELTA WINS<br />\nJ. HUDSON HUFFARD,'23<br />\nseating capacity for 20,000, the<br />\nwhose character and policies were<br />\nSCHOLARSHIP CUP<br />\nAssociate Editors:<br />\nRev. John B. Creedon, S. J., presiAdvertising Manager:<br />\nELI FRANK, JR., '22.<br />\nthe subject of Mr. Hirst's address. The Interfraternity Scholarship<br />\ndent of the university, has anDONALD K. VANNEMAN, '23.<br />\nCHARLES C. MARBURY,'22.<br />\nMr. Hirst began his talk by say- 'alp which for so long has been<br />\ning that Lloyd George has a de- hanging fire was finally awarded nounced. Preliminary drawings<br />\nJunior Editors:<br />\nAssistant Business Managers:<br />\nlightful personality. Unlike Lord to Phi Gamma Delta at the As- prepared by John W.Kearney, loCRAIG E. TAYLOR, '24.<br />\nBERNARD C. HEARN, '23.<br />\nChurchill, he does not make one sembly last Thursday. The aver- cal archetict, will be considered at<br />\nJOSEPH S. LEOPOLD, '24.<br />\nJOHN C. LEWIS, '23.<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nfeel his importance, and altho he is ages of all the nine fraternities the next meeting of the university<br />\nFITZGERALD DUNNING, '24.<br />\nRANDOLPH NORWOOD, '24.<br />\na clever conversationalist, he is as represented on the board were ex- trustees at New York City in JanT. REESE MARSH, '24.<br />\ngood a listener as a talker. Mr. ceptionally close, ranging. from uary.<br />\nThe trustees' meeting will face<br />\nHirst cited some examples of the 77.6 which won the cup, down to<br />\nproblem of how to finance the<br />\nthe<br />\navThe<br />\naverage.<br />\nthe<br />\nlowest<br />\n72.0,<br />\nPremier's good nature and wit<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nKearney has selected a<br />\nproject.<br />\nwere<br />\nthe<br />\nfraternities<br />\nof<br />\nerages<br />\nand added that he is a man who<br />\nwithin<br />\nthe university grounds,<br />\nsite<br />\nthe<br />\nand<br />\ntime<br />\nago<br />\nsome<br />\nin<br />\nturned<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. is pleasant as well as dignified.<br />\nand<br />\non one side by New<br />\nbounded<br />\ncarefully<br />\nwere<br />\nhighest<br />\nthree<br />\nIt has been said that Churchill<br />\nthe western section<br />\nroad,<br />\nin<br />\nCut<br />\nwinthe<br />\ndetermine<br />\nto<br />\nup<br />\nchecked<br />\nhas no prejudices nor principles.<br />\nBALTIMORE, MD., JANUARY 16, 1922<br />\nof<br />\nthe<br />\ncity.<br />\nSingewald,<br />\nMr.<br />\nDempster,<br />\nLloyd George has prejudices. ner.<br />\nAfter the Armistice the little 3mallwood and Vanneman formed<br />\nWOODROW WILSON<br />\nWelshman went to the country the committee and announced the<br />\nand<br />\nwhile ther his Ministers leading fraternities as follows: ages for last June shows that any<br />\nThe News-Letter takes pleasure in dedicating this issue to Woodhim draw up a program in Phi Gamma Delta, 77.6; Pi Kap- one of the nine fraternities can<br />\nhelped<br />\nrow Wilson, former student at Johns Hopkins and ex-president of<br />\nwas planned that Ger- pa Chi, 77.1; Beta Theta Pi, 76.6. easily win the cup and the marks<br />\nit<br />\nwhich<br />\nthe United States.<br />\nThe cup will be awarded twice will probably become even closer<br />\nbear the expense of<br />\nmany<br />\nshould<br />\nEvery American, regardless of partizan politics, should be willyear after the midyear and under the competition that will<br />\nevery<br />\nbe<br />\nshould<br />\nKaiser<br />\nthe<br />\nand<br />\nwar<br />\nthe<br />\ning to pay tribute to his name today. An idealist and statesman, his<br />\nThe chapter take place in the future. The relaJune<br />\nexaminations.<br />\nBrita<br />\nby<br />\ntrial<br />\nfair<br />\na<br />\nafter<br />\nhanged<br />\nname will go down in history as one of the greatest men this country<br />\nwinning the cup has possession of tively high general average of aparra<br />\nlater<br />\nwas<br />\njury.<br />\nIt<br />\nsh<br />\nhas ever produced. During the war he was the leading figure in<br />\nsecret treaty with Holland that it until it is won by another fra- proximately 75.0 attained by the<br />\nworld affairs, the crystalizer of public opinion. It was he who best<br />\nthat country should resist the ex- ternity. The fraternity which first fraternities is very significant.<br />\nvoiced our reasons for entering the conflict and later expressed the tradition of the former emperor wins three times gains permanent This compares very -favorably<br />\ndemands of the peoples of the world at the Versailles Conference. and in return should receive from possession of the cup. It is be- with the general fraternity avWhether he failed in the clash with the Old World diplomats, England the assurance that she lieved, however, that no chapter erages in other colleges and it is<br />\nwhether he sacrificed the material welfare of the world for an obscure should hold the lower reaches of will win the cup finally for many mdoubtedly above the general unupon which Ant- years. The closeness of the aver- dergraduate average.<br />\nideal, whether he lost the battle for permanent peace on account of the Sheldt River<br />\nwerp is located.<br />\npersonal egotism or on account of party politics--no one can doubt<br />\n\"At one time Lloyd George<br />\nthe sincerity of his purpose, the fact that he believed that he was hinted,that it was he who won the<br />\nacting for the benefit of mankind as a whole.<br />\nwar. He is also known to have<br />\nThe past has proved the impossibility of having correct contem- shown a room in his house where<br />\nporary judgment. The greatness of too many men has been appre- the war was won. At present, it is<br />\nGeorge is trying to<br />\nciated only after death. Time is the only just judge. History alone said, Lloyd<br />\nwin the peace,\" said Mr. Hirst.<br />\ncan properly evaluate Woodrow Wilson's place among the leaders<br />\n\"He is not blessed with what<br />\nof men, but today we can at least pay reverence to the ideals for some people call a virtue, namely,<br />\nwhich he stood, and leave the future to care for itself.<br />\npolitical constancy. For nearly all<br />\nhis life he has held the nationality<br />\nFORTY-SIXTH YEAR OF INSTRUCTION, 1921-22<br />\nof Wales above that of Ireland.<br />\nNow he is England's greatest<br />\nTHE MARYLAND STATE GAME<br />\nINSTRUCTION<br />\n\"home ruler.\" Before the war he<br />\nAfter a years interval, athletic relations with Maryland State was an earnest advocate of free GRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master of Arts; Doctor<br />\nof Philosophy.<br />\nhave been resumed and it is now probable that the teams representing trade. Since the war he has adoptMEDICAL<br />\nSCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nthese two institutions will meet on Homewood Field, November 18. ed restrictive measures which covARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nOF<br />\nCOLLEGE<br />\nThe agreement was reached last week by Dr. Woods, president of er nearly a thousand articles. He<br />\nOF ENGINEERING. Degrees: Doctor of Engineering; Master of<br />\nDEPARTMENT<br />\nbe an ardent pacifist, but<br />\nMaryland State, and President Goodnow, of Hopkins, and it is indeed used to<br />\nBachelor of Engineering; Bachelor of Science in Chemistry.<br />\nEngineering;<br />\nin 1911 he gave in somewhat to<br />\nOF<br />\ngratifying that Maryland's two greatest colleges will again contest<br />\nAND PUBLIC HEALTH. Degrees: Doctor of Public Health;<br />\nHYGIENE<br />\nSCHOOL<br />\nthe empirical liberals and when<br />\nDoctor of Science and Bachelor of Science in Hygiene; Certificate in<br />\nfor athletic honors.<br />\nGermany made• her \"colossal<br />\nPublic Health.<br />\nThe previous dispute arose over the question of the interpreta- blunder\" he was the leader of the COLLEGE COURSES FOR TEACHERS. Degree of Bachelor of Science.<br />\ntion of \"college football\" and it is hoped that the \"five year ironclad war spirits.\"<br />\nSUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of Arts<br />\nLloyd George wanted to see the<br />\nor of Science. Also for graduates in Medicine.<br />\nagreement\" which is said to have been adopted will cover all points<br />\nto a bitter end EVENING COURSES in Business Economics and for Technical Workers.<br />\nfought<br />\nWar<br />\nGreat<br />\npossible<br />\nis<br />\nit<br />\nIn<br />\nretrospect,<br />\ndispute.<br />\nfor<br />\ngrounds<br />\nthat may later prove<br />\nand his break with Asquith came<br />\nthat Maryland was doing what she thought right, but it is certain after that gentleman's expression<br />\nthat an agreement such as was recently drawn up would have pre- of hope that the war could be con- JOHNS HOPKINS PRESS PUBLICATIONS.<br />\nvented the drastic steps that were taken in November, 1920.<br />\ncluded peacefully. He also fell STATE BUREAUS: Geological Survey; Weather Service; Forestry.<br />\nit<br />\nand<br />\nseems<br />\nprobout with Lord Lansdowne who<br />\nHowever, this is all now a matter of the past,<br />\nBUILDINGS<br />\nfourteen<br />\nable that Hopkins and Maryland will henceforth meet in an annual was in favor of Wilson's<br />\npoints. At present Lloyd George GILMAN HALL—general library, class rooms, biology, administration. •<br />\nfootball game as well as in other sports. The student bodies and the<br />\nis working along the same lines as MECHANICAL AND ELECTRICAL ENGINEERING--housing also Physics and College Chemistry.<br />\nalumni of both institutions can breathe a sigh of relief now that nego- the United States government, to<br />\nCIVIL ENGINEERING—housing also Geology.<br />\ntiations are concluded.<br />\nbring Europe into a state of peace.<br />\nHOUSE.<br />\nPOWER<br />\nHoptraditional<br />\nthe<br />\nwithout<br />\nNo football season seems complete<br />\nLloyd George's position in the<br />\nAND PLANT PHYSIOLOGY—with Greenhouses and Botanical Garden.<br />\nBOTANY<br />\nkins-Maryland contest and Maryland fans are already looking for- House of Commons will not be as CHEMICAL LABORATORY—for graduate work.<br />\nhas been<br />\nward with keen interest and enthusiasm to next fall's gridiron classic. strong next year as it<br />\nPHYSIOLOGICAL BUILDING.<br />\nand he is trying to settle up his<br />\nANATOMICAL LABORATORY.<br />\npolicies now. He has always been<br />\nHUNTERIAN<br />\nLABORATORIES.<br />\nin favor of having Ireland a<br />\nLABORATORY.<br />\nPATHOLOGICAL<br />\nELECTION<br />\n-LETTER<br />\nNEWS<br />\nfriendly republic instead of an unHYGIENE.<br />\nOF<br />\nSCHOOL<br />\nwith<br />\nNews-Letter announces with pleasure the elections of J. Hudson friendly kingdom and it is<br />\nnow CARROLL MANSION—Johns Hopkins Club.<br />\nis<br />\nhe<br />\nthat<br />\nthat end in view<br />\nMarbury,<br />\nC.<br />\nCharles<br />\nEditor,<br />\nManaging<br />\nAssistant<br />\nBUILDING.<br />\nto<br />\nHuffard, '23,<br />\nworking. His idea that the war STUDENT ACTIVITIES<br />\n'22, to Associate Editor. and Randolph Norwood, '24, and T. Reese debts should be cancelled is based<br />\non the fact that England is credMarsh, '24, to Junior Editors.<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\n<br />\nPay Your News-Letter<br />\nBills<br />\n<br />\nThe Johns Hopkins<br />\nUniversity<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 16, 1922<br />\n<br />\nDo you know how best to provide<br />\n<br />\nWILSON A WORLD POWER<br />\n<br />\nan income for your old age?<br />\nConsult with<br />\n<br />\nContinued from page 1,<br />\n<br />\n3<br />\n<br />\nODE TO BIG BEN<br />\n<br />\nTinkle, tinkle, little bell,<br />\n<br />\ntore him to pieces. But the odium How I wish you were in Hell;<br />\nW. W. WALKER<br />\nwhich was heaped upon him is not<br />\nThere upon a chair you sit,<br />\n909 Calvert Bldg. St. Paul 2581<br />\nso surprising. It has happened to<br />\ngreat men all down through his- Why the devil don't you quit!<br />\nLIBERTY<br />\ntory.<br />\nExpert Cleaners and Dyers<br />\nAt the Paris Peace Conference I hurl at you my army shoe,<br />\nit was not AATilson who failed, but<br />\nit was humanity. It was not so<br />\n211 E. 25th St.<br />\nHomewood 5205-W<br />\nmuch the statesmen then as the<br />\nspirit of the peoples behind them.<br />\nHope, the aspiration for a new<br />\nLunches, Cigars<br />\nworld order of peace and justice,<br />\nwas feeble and ineffective comCigarettes<br />\npared with the dominant national<br />\nCandy, Soda and<br />\npassions. It was beyond the powPipes and Fountain Pens er of any one man, in spite of Herculean labors, to save the situation. But from the Peace ConferAt the Barn<br />\nence emerged through the effort of<br />\nE. E. Adams Wilson, :the Covenant of the<br />\nLeague of Nations. It is that for<br />\nwhich the conference will be reCollege and Fraternity Stationery membered and upon that will rest<br />\nBanquet and Dance Cards, Invitations the fame and success or failure of<br />\nWoodrow Wilson. By it he will<br />\nJAS. H. DOWNS<br />\nstand<br />\nor fall.<br />\nENGRAVER PRINTER STATIONER<br />\nSpecial Rates to Hopkins Men<br />\n<br />\n229 N. CHARLES ST.<br />\n<br />\nNECKWEAR<br />\n<br />\nSHIRTS<br />\n<br />\nLefranc & Ault<br />\n421 N. HOWARD ST.<br />\n<br />\nHOSIERY<br />\n<br />\nGLOVES<br />\n<br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\nDress Shirts<br />\n$3.00, $3.50 and $4.00<br />\n$3.25 and $4.25<br />\nNegligee<br />\nImported Madras<br />\n$5.25 and $6.25<br />\nTerms Cash, Less 10% 30 Days on<br />\nShirts<br />\nAlso a Full Line of Men's<br />\nFurnishings<br />\n<br />\nSTRATTON<br />\n<br />\nClothes if Custom<br />\n14 N.CharlesS reet.<br />\n<br />\nIt merely knocks you to the floor,<br />\nAnd still you drown<br />\nmate's snore.<br />\n<br />\nEnglish Clothes Tailored in America<br />\nFOR SPORT, DRESS, SOCIETY<br />\n<br />\nmy room-<br />\n<br />\nHABERDASHERY<br />\n<br />\nIf you don't stop your clanging<br />\nnoise,<br />\nWhich wakes me from my dreamland joys,<br />\nI'll amputate your active ways,<br />\nAnd terminate your useless days.<br />\n—Octopus.<br />\n<br />\nWe<br />\n<br />\nare establishing a new standard in<br />\nYoung Men's Suits at $29.50<br />\nStyles for every taste.<br />\n<br />\nmethods of the Covenant, I feel<br />\nsure that most of the present critiBaltimore's Best Store<br />\ncism is based on misunderstandings. These misunderstandings<br />\nwill clear away, one by one the<br />\n&<br />\nOn this subject, J. C. Smuts, peoples still outside the Covenant<br />\nprime minister of the South Af- will fall in behind this banner,<br />\nunder which the human race is<br />\nrican Union, wrote:<br />\ngoing to march forward to tri\"The Covenant is Wilson's souumphs of peaceful organization<br />\nvenir to the future of the world.<br />\nand achievement undreamt of by<br />\nNo one will ever deny him that<br />\nus children of an unhappier era.<br />\nhonor.<br />\nAnd the leader who, in spite of ap\"The honor is very great, in- parent failure, succeeded in indeed, for the Covenant is one of scribing his name on that banner<br />\nSend for catalog describing over 400 courses in History, English,<br />\nMathematics,Chemistry,Zoology, Modern Languages,Economics,<br />\nthe great creative documents of has achieved the most enviable<br />\nPhilosophy, Sociology, etc., given by correspondence. Inquire<br />\nhuman history. The Peace Treaty and enduring immortality. Amerihow credits earned may be applied on present college program.<br />\nwill fade into merciful oblivion, cans of the future will yet proudand its provisions will be grad- ly and gratefully rank him with<br />\nif<br />\nHOME STUDY DEPT.<br />\nCHICAGO. ILLINOIS<br />\nually obliterated by the great hu- Washington and Lincoln, and his<br />\nman tides sweeping over the fame will have a more universal<br />\nworld. But the Covenant will significance than theirs.\"<br />\nstand as sure as fate. Forty-two<br />\nnations gathered around it at the<br />\nHOUSANDS of smokers have proved it—and now give the verdict<br />\nfirst meeting of the League at<br />\nto tyou —Of all the other tobaccos NATURE has<br />\nGeneva. And the day is not far off<br />\nproduced—none<br />\ncan<br />\napproach the finest varieties of pure Turkish for<br />\nwhen all the free peoples of the<br />\ncigarettes—<br />\nworld will gather round it. It<br />\nNone has the delicious<br />\nmust succed, because there is no<br />\nFLAVOR of the finestTurkish—<br />\nother way for the future of civilization. It does not realize the<br />\nNone gives the ENJOYgreat hopes born of the war, but<br />\nMENT of the finest Turkish—<br />\nit provides the only method and<br />\ninstrument by which in the<br />\nNone will SATISFY you as<br />\ncourse of time those hopes can be<br />\nwill the finest Turkish—<br />\nrealized. Speaking as one.who has<br />\nsome right to speak on the fundaNone but the highest grade<br />\nmental conceptions, objects and<br />\nand personally<br />\n<br />\nHOCHSCHILD.KOHN<br />\n<br />\nCo.<br />\n<br />\nDo You Need Extra Courses?<br />\n(1flira3tt<br />\n<br />\nat1ts linitursity<br />\n<br />\nT<br />\n<br />\nEstablished 1873<br />\n<br />\nA.H.Fetting Man'fg Jewelry Co.<br />\nManufacturers<br />\nGreek Letter Fraternity Jewelry<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\n<br />\nElkridge Farms .Dairy<br />\nSTRICTLY FRESH MILK<br />\nProduced, Pasteurized and Bottled<br />\nin Howard County<br />\nCLARK BROS.<br />\n<br />\nWhich has a kick like some home<br />\nbrew;<br />\n<br />\nEllicott City 231-R<br />\n<br />\nselected<br />\nTurkish tobaccos is used in<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nMURAD.<br />\n<br />\nTo enjoy 100% pure Turkish<br />\nat its VERY BEST— to reach<br />\nthe PEAK of Cigarette Quality<br />\n—you have but to smoke<br />\n<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n<br />\nMURAD—<br />\n<br />\nDRAPERIES<br />\n<br />\nTry<br />\n<br />\n343 NORTH CE1ARLES STREET<br />\n<br />\nMURAD<br />\n<br />\ntoday and<br />\n\"Judge for<br />\nYourself—!\"<br />\n<br />\nAu><br />\n<br />\nCal So<br />\n<br />\n,e,M. ca. 44.gtidg'ilagiUtli<br />\n<br />\n-<br />\n<br />\nIn Our Men's Section<br />\nYou will at all times find the newest<br />\nand most fashionable Neckwear, Shirts,<br />\nCollars and other Furnishings necessary<br />\nto a college man's wardrobe.<br />\n<br />\n20c<br />\n<br />\nHUTZLER BRMIElt<br />\n.• 1111,0<br />\n<br />\nBONDS<br />\n<br />\nENVELOPES<br />\n<br />\nLEDGERS<br />\nfifabT111,44 ItCeth`1,45.4<br />\nand Egypb.,dywist.ndrileil<br />\n<br />\nThe W. H Moore, Jr. Paper Co.<br />\n205 W.CAMDEN STREET<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 16, 1922<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\n<br />\nWOODROW WILSON AS<br />\nGRADUATE STUDENT AT<br />\n<br />\nINTERCOLLEGIATE NEWS<br />\n<br />\nINTERFRATERNITY BOARD HOLDS<br />\nMEETING<br />\n<br />\nJOHNS HOPKINS<br />\n<br />\nTHE SYRACUSE DAILY ORANGE<br />\n<br />\nContinued from page 1<br />\n<br />\nAt a recent meeting of the Athletic Governing Board, lacrosse<br />\nwas made one of the major sports.<br />\nOxford to play at Syracuse Stadium April 1.<br />\n<br />\nAt the last meeting of the Interfraternity Board many important<br />\nquestions were brought up for discussion.<br />\nIt was decided to wait until after the mid-year exams before<br />\nadopting any \"rushing\" agreement<br />\nfor next year. A committee, composed of McCauley, Cotton and o.<br />\nD. Collins, is to look into this matter and find out what agreement exists between fraternities at other<br />\n<br />\nRIGHT FORMATION<br />\n<br />\nThe football game was over and<br />\nat the parlor grate<br />\nA maid and long-haired youth<br />\nwere lingering rather late.<br />\n<br />\nout first that the House of ComThey talked of goals and touchmons form of organization preImporters and Dealers in Fine Books sented absolutely no check to dedowns, but found it rather tame,<br />\n301 N. CHARLES ST.<br />\nbate, whereas the rules ol the House<br />\nTill Cupid put his nose-guard on<br />\nBaltimore, Md.<br />\nof Representatives threw a good 1<br />\nand butted in the game.<br />\nmany obstructions in the way of deQuoth he, \"It's mighty funny if I<br />\nbate and threw the real decisions of<br />\ndon't arrange a match.\"<br />\nMcGILL DAILY<br />\nimportant questions into the hands<br />\nSo he lined the couple up, and<br />\nof committees. In the second place,<br />\nOver one-half of the $6,400,000<br />\nmade them toe the scratch.\"<br />\nconstitution<br />\nthe<br />\nthat<br />\nout<br />\npointed<br />\nhe<br />\nsubscribed to the McGill CentenCommons<br />\nof<br />\nHouse<br />\nHopkins<br />\nof the<br />\nnial Endowment Fund has been colleges.<br />\noffered continual incentive for deThe youth was growing nervous<br />\ncombined<br />\nbate, because on the defeat of a subscribed and work on<br />\nIt was suggested by Coach Le<br />\n'neath the weight of new-found<br />\nG.L-Yt<br />\nministry a new one had to be ap- gymnasium and dormitories will Cato that each of the.different frabliss,<br />\npointed from the ranks of the op- be started in spring. A new en- ternities have a relay team to run<br />\nOWN ERS<br />\nAnd he kinder thought the scrimposition. The one side was, there- gineering building also to be built.<br />\n4.11D4sirat rilfr:fe6<br />\nthe track<br />\nat<br />\nrace<br />\n880<br />\nyard<br />\nan<br />\nmage ought to end up with a<br />\n29 Baltimore St., East<br />\nfore, always striving to retain the<br />\nkiss.<br />\non<br />\nFebruary<br />\nArmory<br />\nat<br />\nthe<br />\nmeet<br />\nOne Door West of Light St.<br />\nhonors and the other to win them.<br />\nSOLE AGENTS FOR BALTIMORE Whereas, in a mimic House of<br />\n25. It will be necessary for at least He charged upon the center, he<br />\nFor College Fraternity Bands<br />\nTHE PENNSYLVANIAN<br />\ntackled left and right,<br />\nRepresentatives the only honor<br />\nfive fraternities to furnish teams in<br />\n(Greek Letter Societies)<br />\nwould be the speakership, and there<br />\non<br />\nman<br />\nAnd the way they held that chair<br />\nTo make certain that last sea- order to have the race: No<br />\nThe Chas. Willms Surgical<br />\ncould at best be a change in this<br />\nfor downs was simply out of<br />\nto<br />\nallowed<br />\nbe<br />\nteam<br />\nwill<br />\nVarsity<br />\ntile<br />\nseason<br />\nfootball<br />\nson's disastrous<br />\nInstrument Co.<br />\nonly by election every two or three<br />\nsight.<br />\nPennsylvania<br />\nwill not be repeated<br />\nparticipate.<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nmonths.<br />\nINSTRUMENTS<br />\nSURGICAL<br />\nintroduces winter football pracThe three fraternities having the He tried an osculation, just an<br />\nMicroscopes and Supplies,<br />\nIn a long editorial the New York<br />\namateur affair,<br />\naverages standing in line<br />\nhighest<br />\nStethoscopes<br />\nPenntice. Also announced that<br />\nBlood Lancets Evening Post discussed the HopBlood Counters<br />\nPhi<br />\nare<br />\nCup<br />\nScholastic<br />\nthe<br />\nfor<br />\nBut lost it on a fumble and inkins House of Commons and under- sylvania relay team may run at<br />\nPi Kappa Chi and<br />\nDelta,<br />\nGamma<br />\nstead it struck the air.<br />\ntook to defend the form of organi- French race to be held in Paris<br />\nTheta Pi.<br />\nBeta<br />\nzation as better adapted to a de- on April 16 and 17.<br />\nTo help in the sale of season tickand<br />\nPhilological<br />\nbating society than the American<br />\nof<br />\nPrinters<br />\nThen as he landed on his ear, he<br />\nit was announced, for the<br />\nets,<br />\nHouse of Representatives.<br />\nScientific Works<br />\nheard the maiden say,<br />\n(baseball, lacrosse<br />\nIn another University Circular public life. Had he been born in spring sports<br />\n23 S. HANOVER ST.<br />\ntrack), the University has been \"You're penalized for holding,<br />\nwe find printed \"Proceedings of England, he would inevitably have and<br />\nBaltimore, Md.<br />\nJim; likewise for offside play.\"<br />\ninto two sections. One secdivided<br />\nRecent Meetings.\" Some of the entered the House of Commons<br />\nfraternity<br />\nof<br />\ncomposed<br />\nbe<br />\nto<br />\ntion<br />\nis<br />\nWith set teeth he tried another;<br />\nElls introduced and adopted were and become a great parliamentary<br />\nnon-fraternity<br />\nof<br />\nother<br />\nthe<br />\nand<br />\nmen<br />\nleader.<br />\nthis time he succeeded fine,<br />\nInteron the following subjects:<br />\nsections will be divided<br />\nThe<br />\nmen.<br />\nHopkins<br />\nof<br />\ngenerations<br />\nFuture<br />\nNaturalization;<br />\nnational Copyright,<br />\nFor he scored an easy touchdown<br />\ninto teams of about ten men each,<br />\nthe Nationalizing of Railroads, Ed- men will look back upon Woodrow<br />\non the crimson two-inch line.<br />\nteam having a captain. The •<br />\nucational Qualification for Voters, Wilson as the most illustrious man each<br />\nthe greatest number And as they sat there by the grate<br />\nAllotment to Indians of Land in ever connected with the University. team selling<br />\ncommuning soul to soul,.<br />\nbe awarded a<br />\nSeveralty, to Make Voting Com- Why not honor him now by partici- of season tickets will<br />\nand the individual sell- The parlor door swung open and<br />\npulsory, to Change the Date of the pating enthusiastically in the move- loving cup<br />\nwill receive a signet<br />\nmost<br />\nthe<br />\ning<br />\nWilthe<br />\nWoodrow<br />\nendow<br />\nto<br />\nment<br />\nfather kicked the goal.<br />\nPresidential Inauguration, to Cre17 E. Baltimore St.<br />\n.<br />\nring.<br />\nFoundation?<br />\nson<br />\n—Widow.<br />\nate Postal Savings Banks, and the<br />\nKnights of Labor.<br />\nPrinters of the<br />\nAfter various ups and downs the<br />\nJohns Hopkins News-Letter<br />\nHopkins House of Commons finally<br />\ndisappeared in 1894 or 1895. It<br />\nwas still in existence when I was<br />\na ,graduate student, and I remember serving as Foreign Secretary<br />\nin one of the ministeries.<br />\nDuring Woodrow Wilson's residence as a graduate student he was<br />\na member of the Hopkins Glee<br />\nClub, and the University still has<br />\na group photograph of him and the<br />\nother members of the club.<br />\nIn the Seminary of History and<br />\nPolitical Science, conducted by<br />\nHerbert B. Adams, it was his pracCollege Literature<br />\ntice to appoint some member of the<br />\nLOMBARD and SOUTH STREETS Seminary to act as secretary, and<br />\nthe minutes of the meetings with<br />\nEN you come to apply for that<br />\nSHOES<br />\nfull abstracts of the papers presentjob let's hope the chief will say:<br />\nfor<br />\ned were carefully bound and are<br />\nHe's a hard worker—clean cut—well edHisthe<br />\nof<br />\noffice<br />\nrecord<br />\nthe<br />\nucated—with a scientific bent—and he<br />\nin<br />\nnow<br />\nUNIVERSITY MEN<br />\nknows his way'round,because he smokes<br />\ntorical Department. Upon several<br />\nFor Sport Wear<br />\nFor Dress<br />\noccasions Woodrow Wilson acted<br />\nSmart Styles—Best Leathers as secretary, and the record is preModerate Pricesserved in his neat, clear hand and<br />\nsigned \"Woodrow Wilson, Scribe.\"<br />\nAlthough Woodrow Wilson got<br />\nhis Ph. D. in 1886, he was connected<br />\n19 W. LEXINGTON ST.<br />\nwith the University as lecturer<br />\nfrom 1887-1898. He spent a month<br />\nWHOM DO I LIKE?<br />\nhere every year, usually the month<br />\nRemember that Melachrino is a master blend<br />\nJim is very stupid,<br />\nof February, lecturing on political<br />\nof the finest Turkish Tobaccos as originated<br />\nBill is very bright!<br />\nscience to a large group of graduby Miltiades Melachrino. Egyptian cigarettes<br />\nare simply those that originated in Egypt.<br />\nJim always toddles,<br />\nate students. We had a large numBut the tobacco is what you want to know<br />\nBill reads at night!<br />\nber of distinguished outside lecabout—and if it's Melachrino— it's right.<br />\nJim likes Aphrodite,<br />\nturers in those days, but Woodrow<br />\nBill likes Rigoletto!<br />\nWilson was by all odds the most<br />\nJim has a hip-pocket,<br />\npopular. His lectures were treAnd more at home.<br />\nmendously stimulating. He imJim likes to \"Stutz,\"<br />\npressed me in those days as having<br />\nBill likes to walk!<br />\nby far the keenest intellect of any<br />\nBill thinks Haig and Haig<br />\nman I had ever come in contact<br />\nIs the name of a Scottish town with. In discussing him we stuAnd uses a prescription<br />\ndents would often express the beOnly when he is ill!<br />\nlief that he was cut out for a states*<br />\n*<br />\n*<br />\nman, but under our form of governMother likes Bill!<br />\nment there seemed to be no possibility of a man of his type getting into<br />\n—Lehigh Burr.<br />\n<br />\nteri!<br />\nCibeXat<br />\nFL& oscAR<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n<br />\nIn Engineering<br />\n<br />\nWYMAN<br />\n<br />\nelachrino<br />\n<br />\n\"The Cigarette Elect of All Nations\"<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVI. No. 24<br /><br />\nBALTIMORE, MD., JANUARY 16, 1922<br /><br />\nPRICE 5 CENTS<br /><br />\nWOODROW WILSON ISSUE<br />\nRELATIONS WITH MARYLAND STATE RESUMED<br /><br />\nFINAL CAST SELECTED FOR WOODROW WILSON FUND TO<br />\nBE LAUNCHED TODAY<br />\n\"CAPTAIN JINKS\"<br /><br />\nPresidents of Two Institutions Reach Miss Walters Pleased With Abundance Maryland's Quota in Drive $30,000.<br />\nAmicable Agreement. Game to Be<br />\nDean Latane National Committeeof Talent. Engel to Play Title Role.<br />\nPlayed November 18th.<br />\nman for State.<br /><br />\nWOODROW WILSON, GRADUATE<br />\nSTUDENT AND LECTURER IN THE<br />\nJOHNS HOPKINS UNIVERSITY<br /><br />\nThe complete cast for the big<br />\nOn Christmas Eve, 1920, a group<br />\nDramatic Club production, \"Capof women met to consider what<br />\ntain Jinks,\" has been finally chosen.<br />\nwas then a nebulous wish to pay<br />\nTwo men have been retained for<br />\nTook Degree of Doctor of Philosophy, At This<br />\nsome sort of a tribute to the man<br />\nthe leading female role, Madame who was<br />\nshortly to leave the White University,in 1886. Was Lecturer from 1887-1898<br />\nTrentoni (Aurelia Johnson). Both<br />\nHouse. There was no doubt in<br />\nof these men, W. C. Roberts and<br />\ntheir minds as to the verdict of hisBY JOHN H. LATANE<br />\nH. S. Taylor White, will be coached<br />\ntory; rather the thought was to esWoodrow Wilson entered the Johns Hopkins University in<br />\nand rehearsed in the part until one<br />\ntablish a precedent, if possible, and<br />\n1883 as a graduate student in the Department of History and Poliis so far advanced as to indicate<br />\nhonor a great American while he<br />\ntics. During his second year of residence he held the University<br />\nclearly a distinct superiority over<br />\nlived. Great men had seldom been<br />\nFellowship in History.<br />\nthe other. Both men have shown<br />\nso honored. Indeed, it was the<br />\nunusual ability as feminine imperPrior to entering the University he had spent one year at Dafairly well-established custom to<br />\nsonators,<br />\nwill<br />\nevery<br />\nthey<br />\nneed<br />\nbut<br />\nvidson<br />\nCollege, North Carolina, and had then gone to Princeton,<br />\nment.<br />\nsadden their lives with abuse and<br />\nwhere he took the A.B. degree in 1879. He then went to the UniPresident Goodnow Was very fa- bit of their skill, as the character of make amends later.<br />\nAurelia is one of the most difficult<br />\nversity of Virginia for the study of law and graduated in 1881. Durvorably impressed with the attiThe thought of a tribute of some<br />\nin the field of light comedy.<br />\ning the next two' years he practiced law in Atlanta, Georgia. His<br />\nsort was discussed among the womtude taken by the Mafyland State<br />\ndeep interest in history and political science led him to the Johns<br />\nIn the title role, Gilson Engel<br />\nand then presented to a group<br />\nen<br />\nauthorities. He states that they finds a character admirably suited<br />\nHopkins University, where Herbert B. Adams had already gathered<br />\nof men, friends of Mr. Wilson and<br />\nwere willing, on every point, to to his type and the parts of Charlie<br />\naround him a brilliant group of students. After two years of graduate<br />\nformer members of his official fammeet him more than half-way. Now and Gussie seem made to order for ily. Finally, within two weeks af- work, Wilson was appointed Associate Professor of History and<br />\nthat relations are in harmony, it is Pierce Brawner and Henry West. ter Mr. -Wilson had become a pri- Political Economy at Bryn Mawr College in 1885. He returned to<br />\nHopkins for his final examinations and was given the degree<br />\nthe desire of the presidents that ''Tom\" Jenifer earned the \"fat\"<br />\nvate citizen, there was a great winof Doctor of Philosophy in 1886. After three.years at Bryn Mawr he<br />\nthe hatchet be buried by both un- part of Mrs. Greenborough, and<br />\nter's day meeting at a New York<br />\nwas made Professor of History and Political Economy at Wesdergraduate bodies. This does not 'Joe\" Moran was selected in the<br />\nhotel, where the wish became a<br />\nleyan<br />\nUniversity, Connecticut, and in 1890 he was made Professor<br />\nmean that they want the old, and contest for the part of the hero's fact, where the nebulous desire to<br />\nof<br />\nJurisprudence<br />\nat Princeton. From 1902-1910 he was President of<br />\ntime-honored rivalry to be any less mother, Mrs. Jinks. \"Dinty\" Moore honor him while he lived became<br />\nPrinceton<br />\nUniversity,<br />\nand in the latter year he resigned to become<br />\nkeen, but that both sides should act and Bosley Hiss promise some real the very real plan to create the<br />\ncandidate<br />\nfor<br />\ngovernor<br />\nof New Jersey.<br />\nlike good sportsmen, and accept humor in the comedy parts of Mrs. Woodrow Wilson Foundation.<br />\nStonington and Miss Merriam.<br />\nvictory or defeat like gentlemen.<br />\nIn 1885 he published as his docThe materialized idea has been<br />\nWILSON A POWER IN WORLD tor's dissertation a<br />\nLittle \"Morty\" Slatkin was seUnder the new contract a game<br />\nbook entitled<br />\ndeveloped far beyond the thought<br />\nPOLITICS<br />\nwill be played with Maryland State lected through natural fitness as<br />\n\"Congressional Government: a<br />\nof a tribute to the former Presieach year for the next five years, Peter, the slangy newsboy, but he dent. It is to be that, of course, The Figure That Was Before the Eyes of Study in American Politics.\" This<br />\nthe World and the Tragedy of a<br />\nat Homewood. Next year the game will not be the smallest or young- but chiefly<br />\nis one of his best-known works, and<br />\nMan Who Lived Before His Time.<br />\ntit is to perpetuate his<br />\n.will probably be played on Novem- est actor in the piece, for \"Chic\" ideals of democracy and human<br />\nEver before men today, there it won for him immediate recogniber 18th, as this is the only date I:ice has a child's part.<br />\nfreedom, and in such form as to are two pictures of Woodrow Wil- tion as a profound student of poliThe role of Belliarti, the Italian be both an inspiration and a reOpen on both schedules. However,<br />\nson. One is of that president of tics. It was the first attempt to deif a four-sided shift can be ar- foster father of Aurelia, will be ward to other men whose ambition<br />\nscribe the actual workings of the<br />\nranged, which will include Wash- taken by Eli Frank. \"Bill\" Totter- it is to \"enable the world to live the United States, who for a few committee system in Congress.<br />\nington and Lee and the University dale, George Hess, Carl Buchheis- more amply, with greater vision, brief moments was not only leader During Wilson's career as a gradof North Carolina, the game may ter, Eric Jacobsen and Hugh Smallwith a finer spirit of hope and of the greatest state in the world, uate student, one of the most interbe played on Thanksgiving Day. wood will have the parts of reportbut was lifted to far giddier esting things that he did was to<br />\nachievement.\"<br />\nheights and became the center of organize \"The Hopkins House of<br />\nIn event of this change Maryland ers. Smallwood will also be the<br />\nThe Foundation is to be, in words<br />\nthe -world's hope. In a time of Commons,\" a debating society comState would play North Carolina on understudy of Gilson Engel as Cap- now widely familiar:<br />\ndarkness and despair, of distrust posed of undergraduates and gradthe 18th, and Hopkins would play tain Jinks.<br />\n\"Created in recognition of the<br />\nand<br />\ndisillusion, the hopes and uates, conducted according to<br />\nWashington and Lee on the same<br />\nThe competition for parts has national and international services<br />\nthe<br />\ndate. To complete the shift, North been so keen that a great many men of Woodrow Wilson, twice Presi- prayers of millions turned to him. general parliamentary procedure of<br />\nCarolina and Washington and Lee v,ho showed a very definite promise dent of the United States, who fur- His position was one terrible in its the British House of Commons.<br />\nwould play on Thanksgiving Day. have not been fitted into parts. It thered the cause of human freedom power and dangerous in its re- he constitution and by-laws of<br />\nA clause in the new tontract was a source of real regret to the and was instrumental in pointing sponsibility.<br />\nthis society were written apparentOvernight from this pinnacle Ile ly by Wilson and printed in the<br />\nstates that Maryland State will not coaches that these men could not out effective methods for the coPlay in Baltimore except at Home- be cast. As there is a real possi- operation of the liberal forces of fell, rejected by his own people. University Circular for January,<br />\nabandoned by all. We then see 1886. This society attracted a<br />\nwood. This will do away with the bility of some of the parts becom- mankind throughout the world.<br />\nvery objectionable situation of last ing vacant through the machina- \"The Award of Awards from him as the white-haired, shattered great deal of attention and was<br />\nYear, when Hopkins was playing at tions of the blacklist and like in- the income of the Foundation will figure, forgotten by most in the given a considerable amount of<br />\nHomewood, and Maryland State struments of torture, there is still be made from time to time by a ever-turning- tide of hustling time publicity in the press of the counat Oriole Park, dividing the atten- a chance that these men may be nationally constituted committee to affairs and events. Alone, looking_ try. A writer in The Nation, Detion of local football fans. In re- needed. In order to recognize the individual or group that has on at the unheeding onrush of cember 3, 1885, objected to the<br />\nciprocation Hopkins agrees to rent these men the club has drawn up rendered within a specific period, world progress, with his dreams adoption by American college stuHomewood Field to Maryland a reserve list of men who will be meritorious service to democracy, blasted, his hopes unrealized and dents of the British House of ComState on those dates that the Black called on in any emergency. They public welfare, liberal thought or his aspirations denied; a seeming mons as a model rather than our<br />\nfailure.<br />\nand Blue is scheduled to play out are Hunter, English, Stephens, peace through justice.\"<br />\nown House of Representatives. He<br />\nThe<br />\nof town, and in future years the Young, Sachs, Stabler, D. P. Cotlofty<br />\nideals<br />\nfor<br />\nwhich<br />\nWil<br />\nsaid, \"The Johns Hopkins UniverIn brief, America is to have its<br />\nson fell were the ideals of a new sity has never, hitherto, been acschedules of both universities will ton, Evans, Croker and F. J. Rich. own Nobel prizes.<br />\nbe arranged so that State's big<br />\nMen taking other parts are: A<br />\nSubscriptions will be received era. He sought a great mora' cused of Anglomania. It is prehome games will occur when Hop- detective, D. S. Kirkley ; a sailor, throughout the United States dur- peace, a new world order rising eminently sui generis—a little Gerkins is away. By this agreement Hoffmeister ; a policeman, Sher- ing the week beginning Monday, visibly on the ruins of the old. But manic in its predilections, if you<br />\nthere will be a good football game wood; Mary's maid, W. C. Gard- January 16. Each state' has a com- it was seldom barren ground. His like, but liberal and catholic withal.<br />\nPlayed at Homewood every Satur- ner; ladies of the ballet, Adams, mittee, and to each state has been high moral idealism did for a mo This broadness, however, should<br />\nday during the season.<br />\nMount, Feldstein, Ben Rich and assigned a quota. Several of the ment dominate the brutal passions not be carried to the extent of deNext year St. John's and Mary- Julian West.<br />\nstates, among them Oregon and Il- which had torn the Old World veloping parliamentarians at the exland State will play at Homewood<br />\nThe first rehearsal was held Sat- linois, have notified the National asunder but it was for only a mo- pense of congressmen.\"<br />\n011i September 30th. On this date urday morning and Miss Walter Committee that their full quotas ment. He was quickly submerged<br />\n,<br />\nIn the next issue, December 10,<br />\nHopkins (Toes to Princeton for the started things going immediately.<br />\nhave already been pledged. Mary- among the lusts for national gain. 1885, The Nation had a letter from<br />\nst game of the season. Those stu- Some of the men showed unusual land's quota is $30,000, and the<br />\nIn the story of Woodrow Wil- \"a member of the Hopkins House<br />\ndents who find it impossible to take conceptions of their parts, and on chairman of the campaign is Mr. son there is a tragedy, the tragedy of Commons,\"<br />\nvindicating the<br />\nthe trip to Princeton, will be able the whole a good start was made. Clarence K. Bowie. The National of the ages. It is that of a man choice of the<br />\nprocedure of the Britto see a good game here, under this Lipps will again manage the prop- Committeeman for Maryland is Dr. who has lived before his time, who ish<br />\nHouse of Commons as better<br />\nnew agreement.<br />\nerty men. While the scenic work- John H. Latane. Contributions is too great for his age. The cyn- adapted to meet the requirements<br />\nAn attempt will be made to ers and costume designers .will all may be handed in to either of these ics scoffed, his friends were si- of a debating society than<br />\nthe lowschedule a baseball and a lacrosse be under the general direction of or to any member of the student lenced and finally his own people er house of Congress. He pointed<br />\ngame with State for this year.<br />\nMariano Badillo.<br />\ncommittee.<br />\nContinued on page 3, col. 2<br />\nContinued on page 4, col. 2<br />\nAt a conference, held in Gilman<br />\nHall, Wednesday, January 11, President Goodnow, of Johns Hopkins,<br />\nand President Wood, of Maryland<br />\nState, signed a five-year contract<br />\nfor annual football games between<br />\nthe two universities. Both were<br />\nvery anxious to repair the break<br />\nwhich occurred several years ago,<br />\nand each was willing to give and<br />\ntake in order to reach an agree-<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 16, 1922<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nHopkins<br />\nFOUNDED 1897.<br /><br />\nSubscription<br /><br />\nNews-Letter<br /><br />\nENGLISH ECONOMIST ADDRESSES ASSEMBLY<br /><br />\nMr. Hirst of London Delivers Interesting<br />\nTaik on David Lloyd George. Introduction by Dr. Latane.<br />\n$2.50<br /><br />\nALUMNI!<br /><br />\nThe speaker at the Assembly<br />\nlast Thursday was Mr. Francis W.<br />\nHirst, of London. Mr. Hirst is an<br />\neconomist of some note and besides being a former editor of<br />\n\"The Economist,\" he has written<br />\nHomewood 100 several authoritative books on<br />\nTelephone<br />\nthat subject. His profession has itor for as much as she owes and • EORGETOWN PLANNING $350,000<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nSPORT STADIUM<br />\nthat the money we lent her is only<br />\n'22,<br />\nCOTTON,<br />\nH. DOUGLAS<br />\nFREDERICK W. LIPPS, '22.<br />\ngiven him the opportunity to bea recompense for our not having Georgetown University is conManaging Editor:<br />\ncome acquainted with some of men in the field.<br />\n'23<br />\ntemplating the construction of a<br />\nWILLIAM H. MOORE, JR.,<br />\nEngland's greatest men, among<br />\nCirculation Manager:<br />\n$350,000 athletic stadium, with<br />\nAssistant Managing Editor:<br />\nGLOVER P. FALLON, '23.<br />\nthem Mr. David Lloyd George,<br />\nPHI GAMMA DELTA WINS<br />\nJ. HUDSON HUFFARD,'23<br />\nseating capacity for 20,000, the<br />\nwhose character and policies were<br />\nSCHOLARSHIP CUP<br />\nAssociate Editors:<br />\nRev. John B. Creedon, S. J., presiAdvertising Manager:<br />\nELI FRANK, JR., '22.<br />\nthe subject of Mr. Hirst's address. The Interfraternity Scholarship<br />\ndent of the university, has anDONALD K. VANNEMAN, '23.<br />\nCHARLES C. MARBURY,'22.<br />\nMr. Hirst began his talk by say- 'alp which for so long has been<br />\ning that Lloyd George has a de- hanging fire was finally awarded nounced. Preliminary drawings<br />\nJunior Editors:<br />\nAssistant Business Managers:<br />\nlightful personality. Unlike Lord to Phi Gamma Delta at the As- prepared by John W.Kearney, loCRAIG E. TAYLOR, '24.<br />\nBERNARD C. HEARN, '23.<br />\nChurchill, he does not make one sembly last Thursday. The aver- cal archetict, will be considered at<br />\nJOSEPH S. LEOPOLD, '24.<br />\nJOHN C. LEWIS, '23.<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nfeel his importance, and altho he is ages of all the nine fraternities the next meeting of the university<br />\nFITZGERALD DUNNING, '24.<br />\nRANDOLPH NORWOOD, '24.<br />\na clever conversationalist, he is as represented on the board were ex- trustees at New York City in JanT. REESE MARSH, '24.<br />\ngood a listener as a talker. Mr. ceptionally close, ranging. from uary.<br />\nThe trustees' meeting will face<br />\nHirst cited some examples of the 77.6 which won the cup, down to<br />\nproblem of how to finance the<br />\nthe<br />\navThe<br />\naverage.<br />\nthe<br />\nlowest<br />\n72.0,<br />\nPremier's good nature and wit<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nKearney has selected a<br />\nproject.<br />\nwere<br />\nthe<br />\nfraternities<br />\nof<br />\nerages<br />\nand added that he is a man who<br />\nwithin<br />\nthe university grounds,<br />\nsite<br />\nthe<br />\nand<br />\ntime<br />\nago<br />\nsome<br />\nin<br />\nturned<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. is pleasant as well as dignified.<br />\nand<br />\non one side by New<br />\nbounded<br />\ncarefully<br />\nwere<br />\nhighest<br />\nthree<br />\nIt has been said that Churchill<br />\nthe western section<br />\nroad,<br />\nin<br />\nCut<br />\nwinthe<br />\ndetermine<br />\nto<br />\nup<br />\nchecked<br />\nhas no prejudices nor principles.<br />\nBALTIMORE, MD., JANUARY 16, 1922<br />\nof<br />\nthe<br />\ncity.<br />\nSingewald,<br />\nMr.<br />\nDempster,<br />\nLloyd George has prejudices. ner.<br />\nAfter the Armistice the little 3mallwood and Vanneman formed<br />\nWOODROW WILSON<br />\nWelshman went to the country the committee and announced the<br />\nand<br />\nwhile ther his Ministers leading fraternities as follows: ages for last June shows that any<br />\nThe News-Letter takes pleasure in dedicating this issue to Woodhim draw up a program in Phi Gamma Delta, 77.6; Pi Kap- one of the nine fraternities can<br />\nhelped<br />\nrow Wilson, former student at Johns Hopkins and ex-president of<br />\nwas planned that Ger- pa Chi, 77.1; Beta Theta Pi, 76.6. easily win the cup and the marks<br />\nit<br />\nwhich<br />\nthe United States.<br />\nThe cup will be awarded twice will probably become even closer<br />\nbear the expense of<br />\nmany<br />\nshould<br />\nEvery American, regardless of partizan politics, should be willyear after the midyear and under the competition that will<br />\nevery<br />\nbe<br />\nshould<br />\nKaiser<br />\nthe<br />\nand<br />\nwar<br />\nthe<br />\ning to pay tribute to his name today. An idealist and statesman, his<br />\nThe chapter take place in the future. The relaJune<br />\nexaminations.<br />\nBrita<br />\nby<br />\ntrial<br />\nfair<br />\na<br />\nafter<br />\nhanged<br />\nname will go down in history as one of the greatest men this country<br />\nwinning the cup has possession of tively high general average of aparra<br />\nlater<br />\nwas<br />\njury.<br />\nIt<br />\nsh<br />\nhas ever produced. During the war he was the leading figure in<br />\nsecret treaty with Holland that it until it is won by another fra- proximately 75.0 attained by the<br />\nworld affairs, the crystalizer of public opinion. It was he who best<br />\nthat country should resist the ex- ternity. The fraternity which first fraternities is very significant.<br />\nvoiced our reasons for entering the conflict and later expressed the tradition of the former emperor wins three times gains permanent This compares very -favorably<br />\ndemands of the peoples of the world at the Versailles Conference. and in return should receive from possession of the cup. It is be- with the general fraternity avWhether he failed in the clash with the Old World diplomats, England the assurance that she lieved, however, that no chapter erages in other colleges and it is<br />\nwhether he sacrificed the material welfare of the world for an obscure should hold the lower reaches of will win the cup finally for many mdoubtedly above the general unupon which Ant- years. The closeness of the aver- dergraduate average.<br />\nideal, whether he lost the battle for permanent peace on account of the Sheldt River<br />\nwerp is located.<br />\npersonal egotism or on account of party politics--no one can doubt<br />\n\"At one time Lloyd George<br />\nthe sincerity of his purpose, the fact that he believed that he was hinted,that it was he who won the<br />\nacting for the benefit of mankind as a whole.<br />\nwar. He is also known to have<br />\nThe past has proved the impossibility of having correct contem- shown a room in his house where<br />\nporary judgment. The greatness of too many men has been appre- the war was won. At present, it is<br />\nGeorge is trying to<br />\nciated only after death. Time is the only just judge. History alone said, Lloyd<br />\nwin the peace,\" said Mr. Hirst.<br />\ncan properly evaluate Woodrow Wilson's place among the leaders<br />\n\"He is not blessed with what<br />\nof men, but today we can at least pay reverence to the ideals for some people call a virtue, namely,<br />\nwhich he stood, and leave the future to care for itself.<br />\npolitical constancy. For nearly all<br />\nhis life he has held the nationality<br />\nFORTY-SIXTH YEAR OF INSTRUCTION, 1921-22<br />\nof Wales above that of Ireland.<br />\nNow he is England's greatest<br />\nTHE MARYLAND STATE GAME<br />\nINSTRUCTION<br />\n\"home ruler.\" Before the war he<br />\nAfter a years interval, athletic relations with Maryland State was an earnest advocate of free GRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master of Arts; Doctor<br />\nof Philosophy.<br />\nhave been resumed and it is now probable that the teams representing trade. Since the war he has adoptMEDICAL<br />\nSCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nthese two institutions will meet on Homewood Field, November 18. ed restrictive measures which covARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nOF<br />\nCOLLEGE<br />\nThe agreement was reached last week by Dr. Woods, president of er nearly a thousand articles. He<br />\nOF ENGINEERING. Degrees: Doctor of Engineering; Master of<br />\nDEPARTMENT<br />\nbe an ardent pacifist, but<br />\nMaryland State, and President Goodnow, of Hopkins, and it is indeed used to<br />\nBachelor of Engineering; Bachelor of Science in Chemistry.<br />\nEngineering;<br />\nin 1911 he gave in somewhat to<br />\nOF<br />\ngratifying that Maryland's two greatest colleges will again contest<br />\nAND PUBLIC HEALTH. Degrees: Doctor of Public Health;<br />\nHYGIENE<br />\nSCHOOL<br />\nthe empirical liberals and when<br />\nDoctor of Science and Bachelor of Science in Hygiene; Certificate in<br />\nfor athletic honors.<br />\nGermany made• her \"colossal<br />\nPublic Health.<br />\nThe previous dispute arose over the question of the interpreta- blunder\" he was the leader of the COLLEGE COURSES FOR TEACHERS. Degree of Bachelor of Science.<br />\ntion of \"college football\" and it is hoped that the \"five year ironclad war spirits.\"<br />\nSUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of Arts<br />\nLloyd George wanted to see the<br />\nor of Science. Also for graduates in Medicine.<br />\nagreement\" which is said to have been adopted will cover all points<br />\nto a bitter end EVENING COURSES in Business Economics and for Technical Workers.<br />\nfought<br />\nWar<br />\nGreat<br />\npossible<br />\nis<br />\nit<br />\nIn<br />\nretrospect,<br />\ndispute.<br />\nfor<br />\ngrounds<br />\nthat may later prove<br />\nand his break with Asquith came<br />\nthat Maryland was doing what she thought right, but it is certain after that gentleman's expression<br />\nthat an agreement such as was recently drawn up would have pre- of hope that the war could be con- JOHNS HOPKINS PRESS PUBLICATIONS.<br />\nvented the drastic steps that were taken in November, 1920.<br />\ncluded peacefully. He also fell STATE BUREAUS: Geological Survey; Weather Service; Forestry.<br />\nit<br />\nand<br />\nseems<br />\nprobout with Lord Lansdowne who<br />\nHowever, this is all now a matter of the past,<br />\nBUILDINGS<br />\nfourteen<br />\nable that Hopkins and Maryland will henceforth meet in an annual was in favor of Wilson's<br />\npoints. At present Lloyd George GILMAN HALL—general library, class rooms, biology, administration. •<br />\nfootball game as well as in other sports. The student bodies and the<br />\nis working along the same lines as MECHANICAL AND ELECTRICAL ENGINEERING--housing also Physics and College Chemistry.<br />\nalumni of both institutions can breathe a sigh of relief now that nego- the United States government, to<br />\nCIVIL ENGINEERING—housing also Geology.<br />\ntiations are concluded.<br />\nbring Europe into a state of peace.<br />\nHOUSE.<br />\nPOWER<br />\nHoptraditional<br />\nthe<br />\nwithout<br />\nNo football season seems complete<br />\nLloyd George's position in the<br />\nAND PLANT PHYSIOLOGY—with Greenhouses and Botanical Garden.<br />\nBOTANY<br />\nkins-Maryland contest and Maryland fans are already looking for- House of Commons will not be as CHEMICAL LABORATORY—for graduate work.<br />\nhas been<br />\nward with keen interest and enthusiasm to next fall's gridiron classic. strong next year as it<br />\nPHYSIOLOGICAL BUILDING.<br />\nand he is trying to settle up his<br />\nANATOMICAL LABORATORY.<br />\npolicies now. He has always been<br />\nHUNTERIAN<br />\nLABORATORIES.<br />\nin favor of having Ireland a<br />\nLABORATORY.<br />\nPATHOLOGICAL<br />\nELECTION<br />\n-LETTER<br />\nNEWS<br />\nfriendly republic instead of an unHYGIENE.<br />\nOF<br />\nSCHOOL<br />\nwith<br />\nNews-Letter announces with pleasure the elections of J. Hudson friendly kingdom and it is<br />\nnow CARROLL MANSION—Johns Hopkins Club.<br />\nis<br />\nhe<br />\nthat<br />\nthat end in view<br />\nMarbury,<br />\nC.<br />\nCharles<br />\nEditor,<br />\nManaging<br />\nAssistant<br />\nBUILDING.<br />\nto<br />\nHuffard, '23,<br />\nworking. His idea that the war STUDENT ACTIVITIES<br />\n'22, to Associate Editor. and Randolph Norwood, '24, and T. Reese debts should be cancelled is based<br />\non the fact that England is credMarsh, '24, to Junior Editors.<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br /><br />\nPay Your News-Letter<br />\nBills<br /><br />\nThe Johns Hopkins<br />\nUniversity<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 16, 1922<br /><br />\nDo you know how best to provide<br /><br />\nWILSON A WORLD POWER<br /><br />\nan income for your old age?<br />\nConsult with<br /><br />\nContinued from page 1,<br /><br />\n3<br /><br />\nODE TO BIG BEN<br /><br />\nTinkle, tinkle, little bell,<br /><br />\ntore him to pieces. But the odium How I wish you were in Hell;<br />\nW. W. WALKER<br />\nwhich was heaped upon him is not<br />\nThere upon a chair you sit,<br />\n909 Calvert Bldg. St. Paul 2581<br />\nso surprising. It has happened to<br />\ngreat men all down through his- Why the devil don't you quit!<br />\nLIBERTY<br />\ntory.<br />\nExpert Cleaners and Dyers<br />\nAt the Paris Peace Conference I hurl at you my army shoe,<br />\nit was not AATilson who failed, but<br />\nit was humanity. It was not so<br />\n211 E. 25th St.<br />\nHomewood 5205-W<br />\nmuch the statesmen then as the<br />\nspirit of the peoples behind them.<br />\nHope, the aspiration for a new<br />\nLunches, Cigars<br />\nworld order of peace and justice,<br />\nwas feeble and ineffective comCigarettes<br />\npared with the dominant national<br />\nCandy, Soda and<br />\npassions. It was beyond the powPipes and Fountain Pens er of any one man, in spite of Herculean labors, to save the situation. But from the Peace ConferAt the Barn<br />\nence emerged through the effort of<br />\nE. E. Adams Wilson, :the Covenant of the<br />\nLeague of Nations. It is that for<br />\nwhich the conference will be reCollege and Fraternity Stationery membered and upon that will rest<br />\nBanquet and Dance Cards, Invitations the fame and success or failure of<br />\nWoodrow Wilson. By it he will<br />\nJAS. H. DOWNS<br />\nstand<br />\nor fall.<br />\nENGRAVER PRINTER STATIONER<br />\nSpecial Rates to Hopkins Men<br /><br />\n229 N. CHARLES ST.<br /><br />\nNECKWEAR<br /><br />\nSHIRTS<br /><br />\nLefranc &amp; Ault<br />\n421 N. HOWARD ST.<br /><br />\nHOSIERY<br /><br />\nGLOVES<br /><br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\nDress Shirts<br />\n$3.00, $3.50 and $4.00<br />\n$3.25 and $4.25<br />\nNegligee<br />\nImported Madras<br />\n$5.25 and $6.25<br />\nTerms Cash, Less 10% 30 Days on<br />\nShirts<br />\nAlso a Full Line of Men's<br />\nFurnishings<br /><br />\nSTRATTON<br /><br />\nClothes if Custom<br />\n14 N.CharlesS reet.<br /><br />\nIt merely knocks you to the floor,<br />\nAnd still you drown<br />\nmate's snore.<br /><br />\nEnglish Clothes Tailored in America<br />\nFOR SPORT, DRESS, SOCIETY<br /><br />\nmy room-<br /><br />\nHABERDASHERY<br /><br />\nIf you don't stop your clanging<br />\nnoise,<br />\nWhich wakes me from my dreamland joys,<br />\nI'll amputate your active ways,<br />\nAnd terminate your useless days.<br />\n—Octopus.<br /><br />\nWe<br /><br />\nare establishing a new standard in<br />\nYoung Men's Suits at $29.50<br />\nStyles for every taste.<br /><br />\nmethods of the Covenant, I feel<br />\nsure that most of the present critiBaltimore's Best Store<br />\ncism is based on misunderstandings. These misunderstandings<br />\nwill clear away, one by one the<br />\n&amp;<br />\nOn this subject, J. C. Smuts, peoples still outside the Covenant<br />\nprime minister of the South Af- will fall in behind this banner,<br />\nunder which the human race is<br />\nrican Union, wrote:<br />\ngoing to march forward to tri\"The Covenant is Wilson's souumphs of peaceful organization<br />\nvenir to the future of the world.<br />\nand achievement undreamt of by<br />\nNo one will ever deny him that<br />\nus children of an unhappier era.<br />\nhonor.<br />\nAnd the leader who, in spite of ap\"The honor is very great, in- parent failure, succeeded in indeed, for the Covenant is one of scribing his name on that banner<br />\nSend for catalog describing over 400 courses in History, English,<br />\nMathematics,Chemistry,Zoology, Modern Languages,Economics,<br />\nthe great creative documents of has achieved the most enviable<br />\nPhilosophy, Sociology, etc., given by correspondence. Inquire<br />\nhuman history. The Peace Treaty and enduring immortality. Amerihow credits earned may be applied on present college program.<br />\nwill fade into merciful oblivion, cans of the future will yet proudand its provisions will be grad- ly and gratefully rank him with<br />\nif<br />\nHOME STUDY DEPT.<br />\nCHICAGO. ILLINOIS<br />\nually obliterated by the great hu- Washington and Lincoln, and his<br />\nman tides sweeping over the fame will have a more universal<br />\nworld. But the Covenant will significance than theirs.\"<br />\nstand as sure as fate. Forty-two<br />\nnations gathered around it at the<br />\nHOUSANDS of smokers have proved it—and now give the verdict<br />\nfirst meeting of the League at<br />\nto tyou —Of all the other tobaccos NATURE has<br />\nGeneva. And the day is not far off<br />\nproduced—none<br />\ncan<br />\napproach the finest varieties of pure Turkish for<br />\nwhen all the free peoples of the<br />\ncigarettes—<br />\nworld will gather round it. It<br />\nNone has the delicious<br />\nmust succed, because there is no<br />\nFLAVOR of the finestTurkish—<br />\nother way for the future of civilization. It does not realize the<br />\nNone gives the ENJOYgreat hopes born of the war, but<br />\nMENT of the finest Turkish—<br />\nit provides the only method and<br />\ninstrument by which in the<br />\nNone will SATISFY you as<br />\ncourse of time those hopes can be<br />\nwill the finest Turkish—<br />\nrealized. Speaking as one.who has<br />\nsome right to speak on the fundaNone but the highest grade<br />\nmental conceptions, objects and<br />\nand personally<br /><br />\nHOCHSCHILD.KOHN<br /><br />\nCo.<br /><br />\nDo You Need Extra Courses?<br />\n(1flira3tt<br /><br />\nat1ts linitursity<br /><br />\nT<br /><br />\nEstablished 1873<br /><br />\nA.H.Fetting Man'fg Jewelry Co.<br />\nManufacturers<br />\nGreek Letter Fraternity Jewelry<br />\n213 N. LIBERTY ST., Baltimore, Md.<br /><br />\nElkridge Farms .Dairy<br />\nSTRICTLY FRESH MILK<br />\nProduced, Pasteurized and Bottled<br />\nin Howard County<br />\nCLARK BROS.<br /><br />\nWhich has a kick like some home<br />\nbrew;<br /><br />\nEllicott City 231-R<br /><br />\nselected<br />\nTurkish tobaccos is used in<br /><br />\nFURNITURE OF QUALITY<br /><br />\nMURAD.<br /><br />\nTo enjoy 100% pure Turkish<br />\nat its VERY BEST— to reach<br />\nthe PEAK of Cigarette Quality<br />\n—you have but to smoke<br /><br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br /><br />\nMURAD—<br /><br />\nDRAPERIES<br /><br />\nTry<br /><br />\n343 NORTH CE1ARLES STREET<br /><br />\nMURAD<br /><br />\ntoday and<br />\n\"Judge for<br />\nYourself—!\"<br /><br />\nAu&gt;<br /><br />\nCal So<br /><br />\n,e,M. ca. 44.gtidg'ilagiUtli<br /><br />\n-<br /><br />\nIn Our Men's Section<br />\nYou will at all times find the newest<br />\nand most fashionable Neckwear, Shirts,<br />\nCollars and other Furnishings necessary<br />\nto a college man's wardrobe.<br /><br />\n20c<br /><br />\nHUTZLER BRMIElt<br />\n.• 1111,0<br /><br />\nBONDS<br /><br />\nENVELOPES<br /><br />\nLEDGERS<br />\nfifabT111,44 ItCeth`1,45.4<br />\nand Egypb.,dywist.ndrileil<br /><br />\nThe W. H Moore, Jr. Paper Co.<br />\n205 W.CAMDEN STREET<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 16, 1922<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br /><br />\nWOODROW WILSON AS<br />\nGRADUATE STUDENT AT<br /><br />\nINTERCOLLEGIATE NEWS<br /><br />\nINTERFRATERNITY BOARD HOLDS<br />\nMEETING<br /><br />\nJOHNS HOPKINS<br /><br />\nTHE SYRACUSE DAILY ORANGE<br /><br />\nContinued from page 1<br /><br />\nAt a recent meeting of the Athletic Governing Board, lacrosse<br />\nwas made one of the major sports.<br />\nOxford to play at Syracuse Stadium April 1.<br /><br />\nAt the last meeting of the Interfraternity Board many important<br />\nquestions were brought up for discussion.<br />\nIt was decided to wait until after the mid-year exams before<br />\nadopting any \"rushing\" agreement<br />\nfor next year. A committee, composed of McCauley, Cotton and o.<br />\nD. Collins, is to look into this matter and find out what agreement exists between fraternities at other<br /><br />\nRIGHT FORMATION<br /><br />\nThe football game was over and<br />\nat the parlor grate<br />\nA maid and long-haired youth<br />\nwere lingering rather late.<br /><br />\nout first that the House of ComThey talked of goals and touchmons form of organization preImporters and Dealers in Fine Books sented absolutely no check to dedowns, but found it rather tame,<br />\n301 N. CHARLES ST.<br />\nbate, whereas the rules ol the House<br />\nTill Cupid put his nose-guard on<br />\nBaltimore, Md.<br />\nof Representatives threw a good 1<br />\nand butted in the game.<br />\nmany obstructions in the way of deQuoth he, \"It's mighty funny if I<br />\nbate and threw the real decisions of<br />\ndon't arrange a match.\"<br />\nMcGILL DAILY<br />\nimportant questions into the hands<br />\nSo he lined the couple up, and<br />\nof committees. In the second place,<br />\nOver one-half of the $6,400,000<br />\nmade them toe the scratch.\"<br />\nconstitution<br />\nthe<br />\nthat<br />\nout<br />\npointed<br />\nhe<br />\nsubscribed to the McGill CentenCommons<br />\nof<br />\nHouse<br />\nHopkins<br />\nof the<br />\nnial Endowment Fund has been colleges.<br />\noffered continual incentive for deThe youth was growing nervous<br />\ncombined<br />\nbate, because on the defeat of a subscribed and work on<br />\nIt was suggested by Coach Le<br />\n'neath the weight of new-found<br />\nG.L-Yt<br />\nministry a new one had to be ap- gymnasium and dormitories will Cato that each of the.different frabliss,<br />\npointed from the ranks of the op- be started in spring. A new en- ternities have a relay team to run<br />\nOWN ERS<br />\nAnd he kinder thought the scrimposition. The one side was, there- gineering building also to be built.<br />\n4.11D4sirat rilfr:fe6<br />\nthe track<br />\nat<br />\nrace<br />\n880<br />\nyard<br />\nan<br />\nmage ought to end up with a<br />\n29 Baltimore St., East<br />\nfore, always striving to retain the<br />\nkiss.<br />\non<br />\nFebruary<br />\nArmory<br />\nat<br />\nthe<br />\nmeet<br />\nOne Door West of Light St.<br />\nhonors and the other to win them.<br />\nSOLE AGENTS FOR BALTIMORE Whereas, in a mimic House of<br />\n25. It will be necessary for at least He charged upon the center, he<br />\nFor College Fraternity Bands<br />\nTHE PENNSYLVANIAN<br />\ntackled left and right,<br />\nRepresentatives the only honor<br />\nfive fraternities to furnish teams in<br />\n(Greek Letter Societies)<br />\nwould be the speakership, and there<br />\non<br />\nman<br />\nAnd the way they held that chair<br />\nTo make certain that last sea- order to have the race: No<br />\nThe Chas. Willms Surgical<br />\ncould at best be a change in this<br />\nfor downs was simply out of<br />\nto<br />\nallowed<br />\nbe<br />\nteam<br />\nwill<br />\nVarsity<br />\ntile<br />\nseason<br />\nfootball<br />\nson's disastrous<br />\nInstrument Co.<br />\nonly by election every two or three<br />\nsight.<br />\nPennsylvania<br />\nwill not be repeated<br />\nparticipate.<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nmonths.<br />\nINSTRUMENTS<br />\nSURGICAL<br />\nintroduces winter football pracThe three fraternities having the He tried an osculation, just an<br />\nMicroscopes and Supplies,<br />\nIn a long editorial the New York<br />\namateur affair,<br />\naverages standing in line<br />\nhighest<br />\nStethoscopes<br />\nPenntice. Also announced that<br />\nBlood Lancets Evening Post discussed the HopBlood Counters<br />\nPhi<br />\nare<br />\nCup<br />\nScholastic<br />\nthe<br />\nfor<br />\nBut lost it on a fumble and inkins House of Commons and under- sylvania relay team may run at<br />\nPi Kappa Chi and<br />\nDelta,<br />\nGamma<br />\nstead it struck the air.<br />\ntook to defend the form of organi- French race to be held in Paris<br />\nTheta Pi.<br />\nBeta<br />\nzation as better adapted to a de- on April 16 and 17.<br />\nTo help in the sale of season tickand<br />\nPhilological<br />\nbating society than the American<br />\nof<br />\nPrinters<br />\nThen as he landed on his ear, he<br />\nit was announced, for the<br />\nets,<br />\nHouse of Representatives.<br />\nScientific Works<br />\nheard the maiden say,<br />\n(baseball, lacrosse<br />\nIn another University Circular public life. Had he been born in spring sports<br />\n23 S. HANOVER ST.<br />\ntrack), the University has been \"You're penalized for holding,<br />\nwe find printed \"Proceedings of England, he would inevitably have and<br />\nBaltimore, Md.<br />\nJim; likewise for offside play.\"<br />\ninto two sections. One secdivided<br />\nRecent Meetings.\" Some of the entered the House of Commons<br />\nfraternity<br />\nof<br />\ncomposed<br />\nbe<br />\nto<br />\ntion<br />\nis<br />\nWith set teeth he tried another;<br />\nElls introduced and adopted were and become a great parliamentary<br />\nnon-fraternity<br />\nof<br />\nother<br />\nthe<br />\nand<br />\nmen<br />\nleader.<br />\nthis time he succeeded fine,<br />\nInteron the following subjects:<br />\nsections will be divided<br />\nThe<br />\nmen.<br />\nHopkins<br />\nof<br />\ngenerations<br />\nFuture<br />\nNaturalization;<br />\nnational Copyright,<br />\nFor he scored an easy touchdown<br />\ninto teams of about ten men each,<br />\nthe Nationalizing of Railroads, Ed- men will look back upon Woodrow<br />\non the crimson two-inch line.<br />\nteam having a captain. The •<br />\nucational Qualification for Voters, Wilson as the most illustrious man each<br />\nthe greatest number And as they sat there by the grate<br />\nAllotment to Indians of Land in ever connected with the University. team selling<br />\ncommuning soul to soul,.<br />\nbe awarded a<br />\nSeveralty, to Make Voting Com- Why not honor him now by partici- of season tickets will<br />\nand the individual sell- The parlor door swung open and<br />\npulsory, to Change the Date of the pating enthusiastically in the move- loving cup<br />\nwill receive a signet<br />\nmost<br />\nthe<br />\ning<br />\nWilthe<br />\nWoodrow<br />\nendow<br />\nto<br />\nment<br />\nfather kicked the goal.<br />\nPresidential Inauguration, to Cre17 E. Baltimore St.<br />\n.<br />\nring.<br />\nFoundation?<br />\nson<br />\n—Widow.<br />\nate Postal Savings Banks, and the<br />\nKnights of Labor.<br />\nPrinters of the<br />\nAfter various ups and downs the<br />\nJohns Hopkins News-Letter<br />\nHopkins House of Commons finally<br />\ndisappeared in 1894 or 1895. It<br />\nwas still in existence when I was<br />\na ,graduate student, and I remember serving as Foreign Secretary<br />\nin one of the ministeries.<br />\nDuring Woodrow Wilson's residence as a graduate student he was<br />\na member of the Hopkins Glee<br />\nClub, and the University still has<br />\na group photograph of him and the<br />\nother members of the club.<br />\nIn the Seminary of History and<br />\nPolitical Science, conducted by<br />\nHerbert B. Adams, it was his pracCollege Literature<br />\ntice to appoint some member of the<br />\nLOMBARD and SOUTH STREETS Seminary to act as secretary, and<br />\nthe minutes of the meetings with<br />\nEN you come to apply for that<br />\nSHOES<br />\nfull abstracts of the papers presentjob let's hope the chief will say:<br />\nfor<br />\ned were carefully bound and are<br />\nHe's a hard worker—clean cut—well edHisthe<br />\nof<br />\noffice<br />\nrecord<br />\nthe<br />\nucated—with a scientific bent—and he<br />\nin<br />\nnow<br />\nUNIVERSITY MEN<br />\nknows his way'round,because he smokes<br />\ntorical Department. Upon several<br />\nFor Sport Wear<br />\nFor Dress<br />\noccasions Woodrow Wilson acted<br />\nSmart Styles—Best Leathers as secretary, and the record is preModerate Pricesserved in his neat, clear hand and<br />\nsigned \"Woodrow Wilson, Scribe.\"<br />\nAlthough Woodrow Wilson got<br />\nhis Ph. D. in 1886, he was connected<br />\n19 W. LEXINGTON ST.<br />\nwith the University as lecturer<br />\nfrom 1887-1898. He spent a month<br />\nWHOM DO I LIKE?<br />\nhere every year, usually the month<br />\nRemember that Melachrino is a master blend<br />\nJim is very stupid,<br />\nof February, lecturing on political<br />\nof the finest Turkish Tobaccos as originated<br />\nBill is very bright!<br />\nscience to a large group of graduby Miltiades Melachrino. Egyptian cigarettes<br />\nare simply those that originated in Egypt.<br />\nJim always toddles,<br />\nate students. We had a large numBut the tobacco is what you want to know<br />\nBill reads at night!<br />\nber of distinguished outside lecabout—and if it's Melachrino— it's right.<br />\nJim likes Aphrodite,<br />\nturers in those days, but Woodrow<br />\nBill likes Rigoletto!<br />\nWilson was by all odds the most<br />\nJim has a hip-pocket,<br />\npopular. His lectures were treAnd more at home.<br />\nmendously stimulating. He imJim likes to \"Stutz,\"<br />\npressed me in those days as having<br />\nBill likes to walk!<br />\nby far the keenest intellect of any<br />\nBill thinks Haig and Haig<br />\nman I had ever come in contact<br />\nIs the name of a Scottish town with. In discussing him we stuAnd uses a prescription<br />\ndents would often express the beOnly when he is ill!<br />\nlief that he was cut out for a states*<br />\n*<br />\n*<br />\nman, but under our form of governMother likes Bill!<br />\nment there seemed to be no possibility of a man of his type getting into<br />\n—Lehigh Burr.<br /><br />\nteri!<br />\nCibeXat<br />\nFL&amp; oscAR<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br /><br />\nIn Engineering<br /><br />\nWYMAN<br /><br />\nelachrino<br /><br />\n\"The Cigarette Elect of All Nations\"<br /><br />"}], "field_media_file": [{"target_id": 37577, "display": null, "description": null, "target_type": "file", "target_uuid": "a59de7a1-cfb5-4f2b-95e7-417dc5969344", "url": "http://digital.library.jhu.edu/system/files/2022-03/12978-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12978, "target_type": "node", "target_uuid": "c8a8a9e2-e3d0-412d-8167-2c0765961b2e", "url": "/node/12978"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "9ee336f3-5316-4ea2-8f2a-1b780e90b89e"}]}