{"mid": [{"value": 36895}], "uuid": [{"value": "b210756f-f0c5-4305-811e-be3059afa967"}], "vid": [{"value": 36895}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:55:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13082-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:55:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:55:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVIII, No. 10<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 6, 1923<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nMANY HOPKINS PROFESSORS THURSDAY ASSEMBLY DE- CAMPUS CLUB HOLDS ORRECEIVE MENTION IN<br />\nVOTED TO YELL PRACTICE<br />\nGANIZATION MEETING IN<br />\n\"WHO'S WHO\"<br />\nIN PREPARATION FOR<br />\nGILMAN HALL<br />\nLarge Percentage of Prominent BaltiWESTERN MARYLAND<br />\nThomas To Head Society Through Commoreans Connected with J. H. U.<br />\ning Year<br />\nGAME<br />\nA search through \"Who's Who Dean Latane Pleased With Showing of \"Ben\" Thomas was elected presStudents. Dr. Hollander to<br />\nin America\" reveals the fact that<br />\nident of the Campus Club, a new<br />\nSpeak Next Week<br />\nmost of the Hopkins professors<br />\norganization which started early<br />\nPractically the whole of last<br />\nhave earned a place for themselves Thursday's<br />\nassembly was devot- in the spring and which held its<br />\nin that volumne. There are 92 ed to yell practice to arouse<br />\npep first fall meeting October 31 in<br />\nprofessors, assistants and associ- for the Western Maryland game. Gilman Hall. The main purpose Hopkins Severs Diplomatic Relations With Westates in the three undergraduate \"Tom\" Jenifer and several assist- of the club 18 ,to bring fraternity<br />\nminster College for Using Ineligible<br />\n- schools, of these 28, or a little less ants led the cheering, and the en- and non-fraternity men into closer<br />\nPlayers After Protest<br />\ntire collection of songs and yells<br />\nthan one-third of the total, are listrelations; to further all school acwas rehearsed. The students reHopkins sent Western Maryland to defeat last Saturday in one<br />\ned. Of 24 full professors in the<br />\nsponded enthusiastically in the tivities and to boost athletics. This of the most thrilling football games that has been staged at HomeSchool of Arts and Sciences, 22 are first long yell practice of the year. idea is embodied in similar clubs wood this fall. The visitors put up a stiff fight,<br />\naided by their<br />\nlisted, so it may be seen that it is<br />\nBefore yell practice was begun, in many other colleges, numbered superior weight, but the Black and Blue warriors beat them by their<br />\nonly the younger members of the Dean Latane expressed his satis- among which are University of thorough knowledge of the game and an indomitable spirit to win.<br />\nfaction with the state of affairs in Michigan, George Washington The contest is the last in which the two colleges will meet for some<br />\nfaculty who are not included.<br />\nDr. Maurice Bloomfield, Profes- general. The general confusion University of Maryland and a host time, as the J. H. U. authorities found it necessary to break off athof the opening days of the term<br />\nletic relations with Western Maryland.<br />\nsor of Sanskrit, has the. most space<br />\nof other big colleges. It is ashas disappeared and the students<br />\nThe trouble arose from the inof all devoted to him, 51 lines be- have settled down to<br />\nwork. The sumed that in the near/ future FRESHMAN FOOTBALL TEAM sistence of the Westminster oring necessary to record in compact Dean is especially pleased with the clubs will be united by an inganization to play several men<br />\nLOSES TO POLY'S SECform his achievements; he is fol- the showing of the Freshman tercollegiate society for the exwho were ineligible to play against<br />\nOND TEAM<br />\nlowed closely by Drs.-BuChner and Class, which made a better record change of ideas and new proposi- Grinsfelder Plays Snappy Game at Quar- Hopkins. Byhan, the ponderous<br />\nright tackle of the Green and Gold<br />\nter in 6-0 Contest<br />\nRobinson. And then President in the Psychology test than that tions.<br />\nof any previous entering class. Dr. Two committees were elected to<br />\nWith a 6-0 defeat staring them machine, was admitted by the visGoodnow, with 34 lines, follows.<br />\nLatane thinks that making the get the main business of the club in the face in<br />\nthe last five minutes itors to be ineligible. Cuneo, anThe average space devoted to a<br />\nmatriculation requirements more under way as soon as possible.<br />\nother heavy linesman,- transferred<br />\nof play, the Freshman team fought<br />\nProfessor in the undergraduate strict has had<br />\nthis fall from the University of<br />\nthe desired effect, The membership committee, conschool of this University is about in<br />\nthat undesirable students are sisting of Bonner, chairman; Rich- doggedly to gain the coveted Pittsburgh, thus being ineligible<br />\n25 lines. The average professor is<br />\nards and Rector, have already goal. But their efforts were in by the one-year rule for transfers<br />\nkept away.<br />\na Member of five honorary sociThe Dean announced that Dr. made out a list of new men to be vain, for just as Brown had re- among Maryland colleges. Aneties, and has written four books,<br />\nJacob H. Hollander, Professor of taken in. The Pin Committee, ceived a wonderful forward from other ineligible player, Smith, forof sufficient importance to be used<br />\nPolitical Economy, would address composed of Barton, Wales, Shri- Grinsfelder behind<br />\nthe goal, Ref- merly of Mt. St. Mary's, was in<br />\nin his short biography. Included<br />\nthe assembly next Thursday on ver and Rowland, have several deuniform but he did not play in the<br />\neree Goddard called Grinsfelder<br />\nin the number of books is the num\"Business Forecasting.\" The sub- signs for the key which is to be the<br />\ngame. Dean Schofield refused to<br />\nber of publications of which he is<br />\nject is scientific, and is not, as insignia of the club, and are work- off-side. Were it not for Cone's consult with Dr. Abercrombie<br />\neditor.<br />\nmight be supposed, largely specu- ing to get it out without further tackling, extraordinary line-plung- -about these men before the game,<br />\nThe above survey includes only<br />\nlative. The School .of Business delay. The key which will in all ing, however, the Freshmen would thereby adding to the accumulateachers who have direct teaching<br />\nEconomics at Harvard recently probability be selected is one of never have staged the rally they tion of grievances against the<br />\nconections with the undergraduate<br />\nwesterners.<br />\nstarted a Department of Business neat design—very conservative, did. Poly made her score in<br />\nthe<br />\nschools of Arts and Sciences, Enyet<br />\nindicative<br />\nHopkins made all 17 of the<br />\nof the purposes of<br />\nForecasting.<br />\nfirst quarter when Gough threw a<br />\ngineering and Commerce. It does<br />\npoints in the first half of the game.<br />\nRandolph Norwood, president the organization.<br />\nnot take into account the famous<br />\nThe men who started the new misdirected forward right into the The Black and Blue gained at will<br />\nof the Student Council. announced<br />\nProfessors of the graduate departthat activities buttons are being club are as follows: Ben Thomas, hands of O'Connor, of Poly, who against the team which opposed<br />\nments, of the Medical School, and<br />\ndistributed at the Barn, and that president; Eben Perkins, vice- ran 60 yards for the touchdown. them. Western Maryland was<br />\nof the School of Hygiene. It is<br />\nIn the first quarter, the Frosh weak in the first half compared to<br />\nFreshmen must get them. Fresh- president; George Rector, secreinteresting to note, however, that men are<br />\nplayed<br />\nraggedly, and Poly made Coach Van Orman's charges. The<br />\nalso required to print tary; John Shriveri, 'treasurer;<br />\nof the 470 professors,--iassociates their<br />\nHerbert Wilger, sergeant-at-arms; consistent gains by end-running. Blue Jays stole an early lead by<br />\nnames on game tags.<br />\nand instructors of the University;<br />\nBonner, Klinefelter, Wales, Bar- Frank kicke'd off and it was Poly's scoring the first touchdown three<br />\n72 of the full professors, out of<br />\nCLASS OF '23 TO STAGE RE- ton, Alfriend, Peyton, McNutt, ball on their 25-yard line. They minutes after the opening whistle.<br />\n83 'now teaching, are included in<br />\ntook the ball by end runs to mid- This tally was made by Turnbull<br />\nRichards.<br />\nUNION AND DANCE SATthe \"Who's Who,\" and 21 more<br />\nIt may be seen that the member- field for a first down, but then after his teammates had worked<br />\nURDAY AFTER GAME<br />\nare included from teachers of lessFormal Affair to be Staged at Casualty ship is very comprehensive, taking fumbled, and Hopkins recovered. the ball up the field by a series of<br />\ner grade. This total of 93 is slight- Clubhouse. Undergraduates<br />\nin athletic as well as non-athletic The spheroid went back to Poly brilliant forward passes. TurnExpectly more than one-fifth of all teached in Large Numbers<br />\nmen; fraternity men and non-fra- on downs, who took it 20 yards bull also added the point after the<br />\ners in all schools of Johns Hopkins<br />\nWith Fisher's Orchestra already ternity men.<br />\nup field by end running. Here the touchdown. The remainder of the<br />\nUniversity.<br />\nengaged the plans of the Reunion<br />\nFrosh line held tightly and the ball first period saw the ball in WestThere are 300 Baltimoreans in- Committee of the Class of 1923 for STUDENT COUNCIL SANCTIONS went to Hopkins on downs. Gough<br />\nern Maryland's territory most of<br />\ncluded in \"Who's Who.\" Slightly a dance to be held the night of the<br />\nALUMNI TEA IN DORMITORY<br />\nat this point committed his fatal the time; the visitors being unable<br />\nless than one-third of the total St. John's game in the Maryland<br />\nThe Alumni Tea, to be f„.,>.;ven error, for O'Conner of Poly inter- to work it past the middle of the<br />\nnumber of names included from Casualty Clubhouse are rapidly in the<br />\nDormitory for the Alumni cepted his forward and ran for a field. During this quarter Hopthis city are those of Hopkins pro- materializing. The committee, exand their wives on November 10, touchdown. Poly missed the kick kins made two first downs, blocked<br />\nfessors. This is a surprising num- pecting a large number of alumni<br />\nafter goal. The rest of the quar- two kicks, and was forced to punt<br />\nber and proportion with regard to and undergraduates at the dance, was sanctioned by the Student<br />\nter the ball was mostly in midfield, four times; Western Maryland<br />\nthe size of the city, but the number are setting a nominal subscription Council ins a recent meeting. This, and was featured by Cone's plucky<br />\nmade one first down, intercepted<br />\nof professors included could not of $1.00. The Hopkins and St. the day of the St. Johns' game, tackling and Grinsfelder's gain<br />\ntwo passes, and was forced to kick<br />\nPossibly be shortened, so the total John's football team will be in- is \"get-together day\" for the through the line.<br />\nseven times.<br />\nis taken to indicate, in one way, vited to attend the dance as guests Alumni and the tea should make<br />\nThe second quarter was still a<br />\nIn the second period Hopkins<br />\nthe importance of this University of the Class of 1923. A number it even more successful than in ragged affair, being<br />\nfeatured by outplayed the visitors as much as<br />\nto the city and state. If time of surprises have been arranged former years.<br />\nmany fumbles on both sides. Finn, in the first. Schact scored the<br />\nserved to make a list of the men for the occasion.<br />\nOther problems settled by the of Poly, intercepted a forward J. H. U.'s second touchdown,<br />\ntwo<br />\nwho are connected with Hopkins The '23 class will assemble at \"Council are as follows: The dues from Grinsfelder. Then Poly fumminutes after the beginning of the<br />\nas trustees,<br />\nor in other less Homewood Field before the game for the Student Council were bled but recovered. They kicked quarter,<br />\nafter catching a long pass<br />\ndirect manners than teaching, the and will stage an impromptu fixed at $15 a class. The dance to Grinsfelder on Hopkins<br />\n25-yard from Taylor. Western Maryland<br />\nProportion would be considerably march shortly before the opening proposed by the Freshmen Class line. The ball was on Hopkins 40tried a good many passes in this<br />\nhigher.<br />\nwhistle blows. During the contest was refused sanction but it was yard line when Grinsfelder fum- period, completing several of<br />\nthe members of the class will take suggested that a smoker be held bled and Poly recovered. Poly im- them. Hall was responsible for<br />\npart in the rooting and will en- instead which will serve just as mediately made 15 yards by an these passes, his arm being almost<br />\ndeavor to drown out the under- well to arouse freshmen spirit. end run, and they looked threat- as sure as Taylor's. Between Hall<br />\nNOTICE<br />\ngraduate body.<br />\nThat the names of the Freshmen ening. However the Frosh line and Taylor the audience had a.<br />\nJunior Class meeting WedThe committtee in charge of the not actually participated in any held and it went to Hopkins on chance to witness some fine<br />\nfornesday, 12.20, C. E. Hall.<br />\nevents of the day consists of Lan- activity will be published next downs. Grinsfelder kicked to mid- ward pass work. Toward the end<br />\ndy, chairman; Vanneman, Sher- week. Plans for the Freshman- field. Cone intercepted a Poly pass of the second quarter Turnbull<br />\nwood, Fallon and Collins.<br />\nSophomore Rush were begun.<br />\non 40-yard line and it was Hop- added three more points to HopNews-Letter Business Board and<br />\nAnother reunion of the 1923<br />\nD.<br />\nE.<br />\nKline,<br />\n'25,<br />\nwas<br />\nkins' ball. Grinsfelder • made a kins' total by a placement kick<br />\nelected<br />\ncandidates report at office at<br />\nclass will be held during „Tune Secretary and Treasurer of the good offside kick to Poly's 15-yard from the 25-yard line.<br />\n12.20.<br />\nWeek.<br />\nStudent Council at this meeting.<br />\nContinued on page.2. col. 3<br />\nContinued on page 3, col. 3<br />\n<br />\nWESTERN MARYLAND SUFFERS<br />\nBLANKET DEFEAT AT HANDS<br />\nOF BLACK AND BLUE TEAM<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS1LETTER, NOVEMBER 6, 1923<br />\n<br />\n2<br />\n<br />\n.<br />\nBLACK AND BLUE JAY DUEI other, and the ball finally was Sidney. This kind of hair cut is<br />\nto present the cranium absolutely<br />\nplaced on Poly's 40-yard line.<br />\nTO APPEAR THIS WEEK<br />\nThe fourth quarter saw a ray of devoid of any capillary vegetation<br />\nEditors Decide to Abandon Feature Issues This Year<br />\nhope for Hopkins. After kicking or in other words, clip the entire<br />\nFOUNDED 1897.<br />\nThe Black and Blue Jay, whose back and forth, Poly fumbled and head.—The Hampden-Sidney Tiappearance on the campus has Hopkins recOvered. Grinsfelder ger.<br />\n$2.00<br />\nSubscription<br />\nbeen delayed by the failure of the kicked to Poly's 25-yard line, when<br />\nCone went through the line time<br />\nengraver to finish work on time.<br />\nagain, clipping off big chunks<br />\nand<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nwas scheduled to arrive yester- of yardage. It was first down 9n<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nday. It will be the Freshman Poly's 10-yard line with three minJohns<br />\nof<br />\nstudents<br />\nthe<br />\nby<br />\nnumber, the work of the candi- utes to go. The ball, however,<br />\nPublished semi-weekly from October to June<br />\nHopkins University.<br />\ndates and new members of the went to Poly on their 5-yard line.<br />\nThey kicked to Grinsfelder who<br />\nstaff being fully represented.<br />\nBusiness communications should be addressed to the BUSINESS MANran it to their 20-yard line. Here<br />\ncommunications<br />\nAGER,JOHNS HOPKINS UNIVERSITY; all articles and other<br />\nThe next issue is due to come<br />\nhe made that offside pass to<br />\nihould be sent to the MANAGING EDITOR.<br />\nout about December 20, and after Brown, and then made another<br />\nHomewood 100 New Year the regular issues will good pass to Gough on the 12-yard<br />\nCelephone<br />\nappear in rotation. • The Editor line. But Hopkins lost the halt on<br />\nannounces there will be seven downs and Poly kicked out of<br />\nCSomething new in portable<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nWith Cleveland's and<br />\ntypewriters.<br />\nnumbers this year, instead of six trouble.<br />\nJOSEPH LEOPOLD, '24.<br />\nPHILIP W. HOWARD, '25.<br />\nas formerly.<br />\nCone's help the ball was again<br />\n(Lit writes nearly all lanManaging Editor<br />\nA new policy in the editorial brought back to Poly's 10-yard<br />\nguages.<br />\nAdvertising Manager<br />\nWILLIAM G. DEAN, JR., '24.<br />\nwork will be followed, for a time line. It was fourth down and only<br />\nFITZGERALD DUNNING, '24.<br />\nCHas 90 characters.<br />\nat least. In former years each five to go when the whistle blew<br />\nAssistant Managing Editor<br />\nManager<br />\nCirculation<br />\nT. REESE MARSH, '24.<br />\nnumber has been designated by for the end of the game.<br />\nSee Fred Rich, College<br />\nJOHN C. LEWIS, JR., '24.<br />\nas<br />\nthe<br />\nsuch<br />\nname,<br />\nRushspecial<br />\na<br />\nRepresentative<br />\nfirst<br />\nthe<br />\nin<br />\noutplayed<br />\nThough<br />\nAssociate Editors<br />\nSpring<br />\netc.<br />\ning<br />\nNumber,<br />\nFancies,<br />\nthe<br />\nin<br />\nback<br />\ncame<br />\nHopkins<br />\nhalf,<br />\nAssistant Business Managers<br />\nRICHARD C. TILGHMAN, '25.<br />\n118 W. FAYETTE ST.<br />\nInasmuch as the material includ- last two periods and ripped<br />\nJOHN W. PARSONS, '25.<br />\nD. MILES MARRIAN, '25.<br />\nBALTIMORE, MD.<br />\nBENJAMIN T. ROME, '25.<br />\ned usually bore a very faint re- through Poly's line for big gains.<br />\nG. DONALD GIESKE, '25.<br />\nJOHN T. DIXON,'24.<br />\nsemblance to the special title, it The second half was chiefly feaJunior Editors<br />\nA. J. MoKAY, '26.<br />\nV. EDWARD THOMSEN, JR., '26.<br />\nhas been deoided to abandon this tured by Cone's line plunging and<br />\nARTHUR L. NELSON, '26.<br />\nC. EUGENE TOVELL, '24.<br />\nmethod, for -the next issue, at end running, and he undoubtedly<br />\nERNEST A. STRATHMAN, '26.<br />\nOTHO J. KELLER, III, '26<br />\nALGER G. Hiss, '26<br />\nleast,<br />\nand work just straight num- proved to be Hopkins' greatest asJ. JACKSON KIDD, '26<br />\nEDWARD 0. MICHEL, '26.<br />\nbers.<br />\nset.<br />\nT. STRAN SUMMERS, '25<br />\nCHARLES G. HUTZLER, '24.<br />\nThe Editors of the Jay want atThe line-up follows:<br />\ntention called to the fact that<br />\nHopkins (0)<br />\nPoly (6)<br />\nneither their office, nor their<br />\nMember Southern Intercollegiate Newspaper Association<br />\nBlumberg<br />\nL.E.....<br />\nKaffel<br />\ndesks were constructed for speStone<br />\n(capt.)<br />\n.<br />\nL.T.<br />\nAhroon<br />\ncial use as card playing centers,<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nBroening<br />\n..L.G.....<br />\n..<br />\nand ask all parties who feel the O'Connor<br />\nFranck<br />\n....C....<br />\nneed of such entertainment to Atley<br />\nSteinwald<br />\nRG<br />\nseek another spot for their game. Pourie<br />\nBALTIMORE, MD., NOVEMBER 6, 1923<br />\nCovel ........R.T.... Shlossberg<br />\nNicolls<br />\nTEAM Sharatz ......R.E<br />\nFOOTBALL<br />\nFRESHMAN<br />\nGough<br />\nQ B.<br />\nRowe<br />\nLOSES TO POLY'S SECOND<br />\nEXIT THE \"GREEN TERRORS\"<br />\nTEAM<br />\nGrinsfelder<br />\nLH<br />\nNeatly combed, well- ept hair is a<br />\nFader<br />\nbusiness and social asset.<br />\nI<br />\npage<br />\nfrom<br />\nContinued<br />\nCone<br />\nR<br />\nH<br />\nFinn<br />\nSTACOMB makes the hair stay combed<br />\nOne significant feature of the recent misunderstanding with<br />\nin any style you like even after it has<br />\nthe<br />\nif<br />\n'<br />\nBrian<br />\nas<br />\n..<br />\nnow<br />\nlooked<br />\nIt<br />\nline.<br />\n.......F.B........<br />\nPindell<br />\njust been washed.<br />\nWestern Maryland College is the fact that the Westminster instituFreshmen were tightening up, but<br />\nSTACOMB—the original—has been<br />\nSubstitutions—Hopkins, Brown<br />\nused for years by stars of stage and<br />\ntion did not attempt to deny the charge of professionalism lodged the half was too near over for<br />\nscreen—leaders of style. Write today<br />\nfor Blumberg, I. Phillips for Brifor free trial tube.<br />\nagainst several of its players. Although Hopkins was not in a po§i- them to do antyhing.<br />\nTubes-35c Jars-75c<br />\nIn the second half Frank kicked an, Brian for I. Phillips, Blumberg<br />\ntion to prove its charges, Western Maryland neglected to issue any<br />\nInsist on STACOMB—in the black,<br />\nyellow and gold package.<br />\nclean-cut statement saying or inferring that the assertion was false. off to Poly's goal-post and the ball for Nicolls, Cleveland for Brian,<br />\nFor sale at your druggist or wherever<br />\nThey<br />\nyards.<br />\n20<br />\nback<br />\nwas run<br />\ntoilet goods are sold.<br />\nAppleby for Gough. Referee—<br />\nto<br />\nendeavored<br />\nauthorities<br />\nathletic<br />\nHopkins'<br />\nBefore the contest,<br />\nStandard Laboratories,Inc.<br />\nkicked to Hopkins at their 35-yard Goddard, City College.<br />\n750 Stanford Avenue Los Angeles, California<br />\nascertain whether or not Western Maryland intended to play the men line. Then Grinsfelder tried a<br />\nSend coupon for Free Trial Tube.<br />\nunder dispute. The visiting coach refused to divulge his list of drop-kick but it was too long a disSTANDARD LABORATORIES.Inc.<br />\nThe \"Kullegiate kut for a kol750 Stanford Aye., Lou Angeles, California. Dept. 1<br />\nPlease send me free trial tube.<br />\neligible men, saying he had not decided upon his line-up, and would tance. It was Poly's ball on Pcly's<br />\nleg kid\" is the brand Of hair cut<br />\nquarName'<br />\nthe<br />\nof<br />\nrest<br />\nThe<br />\nline.<br />\n12<br />\n-yard<br />\nwould<br />\nAbercrombie<br />\nplay whom he pleased. Upon being told that Dr.<br />\nAddress<br />\nter both team s kicked to each worn by 29 students of Hampdenlike to confer with them, the Westminster coach and Athletic Director declined pointblank to further discuss the matter. In addition to<br />\nrefusing to name the players which were to participate, the visitors<br />\napparently made a public attempt to conceal the identity of the disputed men by juggling the numbers on the jerseys. This ruse only<br />\nsucceeded in corifusing and-displeasing the large crowd of -spectators.<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\n\"XC\"<br />\nCORONA<br />\nHave you<br />\nseen it?<br />\n<br />\nPr<br />\n<br />\nUnruly<br />\n<br />\nWestern Maryland, for the last several years, has not displayed<br />\nwhat is known as clean football. Spectators of the 1922 clash, especially, Will recall the tactics which caused frequent penalties and left<br />\nan unpleasant remembrance in the minds of local sport lovers.<br />\nWestern Maryland has hot defeated Hopkins on the gridiron<br />\nsince the days of \"Holly\" Keller and it is unlikely that the Westminster College will ever 'again be in a position to claim the State<br />\nChampionship. This being the case, there is little to be gained<br />\nfrom keeping them on the schedule. Hopkins' activities need national<br />\nadvertising and the fact that the Homewood team has defeated Western Maryland does not cause sprea'ds to appear in newspapers out of<br />\nthe city.<br />\nThe student body would not have approved of a last moment's<br />\ncancellation of Saturday's game. With Western Maryland's reputed<br />\nprowess it might have appeared as if Hopkins was afraid of the<br />\nconsequences. There are few, however, who will bemoan the fact<br />\nthat the \"Green Terrors\" will not be seen at Homewood Field next<br />\nfall.<br />\n<br />\nSACRILEGE?<br />\nThere is a rumor existing that there will be no parade on Saturday morning preceding the St. John's game. This.parade is a tradition<br />\nwhich has existed since the Black and Blue and the St. Johnnie's<br />\nfirst clashed. Alumni from far back can recall marching through the<br />\nstreets of Baltimore and predicting the fate of St. John's to the<br />\npeople of the Monumental City.<br />\nWe feel that the omission of this parade would be sacrilegious.<br />\n<br />\n\"What a difference<br />\njust a few cents make!\"<br />\n<br />\nFATIMA<br />\n<br />\nir<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 6, 1923<br />\nis<br />\nly<br />\n)11<br />\n<br />\nre<br />\n1-<br />\n<br />\nL.<br />\n<br />\nGEOLOGY CLASS TAKES A<br />\nTRIP TO MT. WASHINGTON AND WOODBERRY<br />\nStudents, in Search of Young Streams,<br />\nTramp Through Suburbs of<br />\nBaltimore<br />\n<br />\nThe students of Geology I, under the guidance of Dr. Hall, instructor in Geology, took a long<br />\ntramp last -Wednesday afternoon<br />\nin search of streams in varying<br />\nstages of development. Starting<br />\nat 1:00 o'clock from the campus,<br />\nthe group progressed westward<br />\nacross Wyman's Park Driveway,<br />\nover the railroad tracks, to the<br />\nMt. Vernon-Woodberry Mills.<br />\n, Here, a stream in infancy, the<br />\nJones' Falls, was observed. Specimens of rock, such as Baltimore<br />\ngneiss and pigmatite, were also<br />\ncollected at this point.<br />\nThe party then proceeded to<br />\nHampden, where they boarded a<br />\nstreet car and the group went to<br />\nBare Hills. Here, a stream in maturity, exhibiting flood plains and<br />\nmeanders, was observed. Lake<br />\nRoland, further up Stream, was<br />\nthen discussed and several stu• dents with cameras took pictures.<br />\nIn order to enable students on<br />\nthe football squad to re-turn to the<br />\ncampus• in time for practice, Dr.<br />\nSchwartz has arranged a plan<br />\nwhereby machines will be sent<br />\nout to bring the men in.<br />\nThe trip described above was<br />\nrepeated last Friday afternoon by<br />\nanother group under the guidance<br />\nof Professor Schwartz.<br />\n<br />\nSUFFERS<br />\nMARYLAND<br />\nWESTERN<br />\nBLANKET DEFEAT BY J. H. U.<br />\nContinued from page 1<br />\n<br />\nfor Carter, Cook for Almy, Aimy<br />\nfor Bonner, Carr for Day; Western Maryland, Peiffer for Kinsey,<br />\nFlanagan for E. Williams, Holt for<br />\nStanley, Kinsey for Peiffer. Touchdowns—Turnbull, Schacht. Goals<br />\nfrom field—Turnbull (by placement, Bonner holding ball). Tries<br />\nfor points—Turnbull, 2 (by placekick, Bonner holding ball). Referee--G. Hoban, Lehigh. Umpire<br />\n<br />\nThe second half of the game was<br />\nmore creditable for Coach Shroyer's charges. During the latter<br />\npart of the game the Methodists<br />\nplayed the ball more and more<br />\noften in Hopkins' territory.<br />\nThroughout the first half the visitors had been unable to play the<br />\nball in dangerous ground, but they<br />\nIn Baltimore alone there must<br />\ngained strength between halves.<br />\nGERHARD & REED CO.<br />\nbe nearly a million definitions and They also learned the Hopkins<br />\nTAILORS<br />\nstandards of that most illusory signals between the halves as the<br />\nmen'<br />\nknew<br />\nexactly<br />\ngreen-clad<br />\nAnother<br />\nthing--a sense of humor.<br />\nI 10 N. EUTAW STREET<br />\nis witty only when his wit agrees where Taylor was calling the<br />\n2nd Floor<br />\nplays. Several times the visitors<br />\nwith yours.<br />\ngot close to the goal line but they<br />\nA widely read New York col- Were not capable of making the<br />\nSARATOGA AT<br />\numnist recently stated that the needed distance past the fighting<br />\nLIBERTY STS.<br />\nthinking, producing, art-loving, Black and Blue eleven.<br />\ndrama-supporting class of the meIn the game'Hopkins made six<br />\nLUNCHEON<br />\ntropolis is composed of stenogra- first downs, blocked two kicks, inTEA<br />\nphers, almost entirely. A hasty tercepted four passes, tried eightDINNER<br />\ncensus of stenographers in Balti- een forward passes and completed<br />\nmore has failed to show any rela- six. Western Maryland made eight<br />\nSPECIAL PARTIES<br />\n11.30 A. M.<br />\ntive dearth here; apparently the first downs,. intercepted five<br />\nuntil<br />\nPLAZA 6987<br />\nfew theatres of which we may passes, tried ten forward passes, 7.30 P. M.<br />\noverboast (but do not) should be<br />\nand complete two. Line-up:<br />\nrun by typists. Yet within the Hopkins (17)<br />\nWest. Md. (0)<br />\nlast week we have been warned Schacht ......L.E.<br />\nClayton<br />\nthat our three legitimate houses Magill ......L.T.<br />\nCu n eo<br />\nmay be closed in the next few Day<br />\nC<br />\nDuncan<br />\nweeks unless attendance increases. Wolbert<br />\nR G.<br />\nMcRobie<br />\nMeanwhile holders of stock in vau- Bartori<br />\nL.G... E. Williams<br />\ndeville and burlesque \"theatres\" Carter<br />\nByham<br />\nR.T..<br />\nsmile with content—the content of Rich<br />\nR.E.<br />\nGroton<br />\nthe prosperous. Mr. Brown's state- Taylor<br />\nStanley<br />\nQB<br />\nment has been called subtle wit, Turnbull .....L.H.<br />\nSillin<br />\npseudo wit, obvious fact, and bald Bonner<br />\nKinsey<br />\nRH<br />\nmisstatement.<br />\nLong<br />\nFB<br />\nAlmy<br />\n0-17<br />\n0<br />\n10<br />\n.......7<br />\nHopkins<br />\nWe can't decide whether his<br />\nbrand of cleverness disagrees with Western Md.... 0 0 0 0— 0<br />\nSubstitutions—Hopkins, Slowik<br />\nour own; or whether New Yorkers<br />\n<br />\nLEHIGH STUDENTS FORM<br />\nUNIVERSITY RADIO CLUB employ a totally different race in<br />\nOne of the organizations that their offices; or what!<br />\nLehigh has lacked for some time<br />\n* * *<br />\nThis<br />\nClub.<br />\nRadio<br />\norganized<br />\nis 'anTypists remind us of typesetters.<br />\nyear, there being a large number<br />\nLast week we learned that the<br />\nof radio amateurs present at the Dormitory Get-together \"broke<br />\nUniversity, a club was organized up\" with the singing of \"Some<br />\nand plans were made to have a Stand Together\"—the break up<br />\nvery thorough and interesting pro- was apparently inevitable. In the<br />\ngram. It will be interesting to same proof George Darley \"narnote that the students taking part rowly missed a 90-yard drop-kick<br />\nin this organization are, many of from a difficult angle.\"<br />\nthem, old friends who, while they<br />\n* * *<br />\nhad never seen each other., have<br />\nmade lasting friendships through<br />\n\"Native German And Dwarf In<br />\ntheir talking to each other over the Stature, But Intellectual Giant\"—<br />\nradio.<br />\nheadline in a Baltimore paper.<br />\nThe club was organized last \"What a world of solemn<br />\nWednesday night at a meeting thought that `but' compels,\" we<br />\nheld by these old amateur radio can hear Poe answering.<br />\n.friends. About thirty radio fans<br />\nTo be a \"native German is, of<br />\nwere present and a large number<br />\na great intellectual handicourse,<br />\nsent word that they were unable<br />\nsomehow Schopenhauer,<br />\ncap;<br />\nyet<br />\nto come because of their studies.<br />\ntwo<br />\nTemporary officers were elected Nietzsche, Kant, and one or<br />\nit<br />\novercome<br />\nto<br />\nothers managed<br />\nwith the following results:<br />\nPresident, Gordon, '24; secre- with a fair degree of success.<br />\n* * *<br />\ntary and treasurer, Tyler, '25.<br />\nWhite.<br />\n—The Lehigh Brown and<br />\nIt seems to us that Lehigh has<br />\na very laudable and desirable inA group of American students, stitution. In spite of the great<br />\nstudying at the National Univer- number of clubs and organizations<br />\nsity at Mexico City, have organ- at Hopkins we feel sure that there<br />\nized a movement to erect a mon- is room for so interesting a society<br />\nument to two national figures of on the J. H. U. campus. Lehigh<br />\nthe United States and Mexico. has a Faculty Dramatic Club.<br />\nThe proposed monument is to rppWithout being personal just<br />\nresent Lincoln and Juarez claspthink of the roaring entertainment<br />\ning hands across the border. It<br />\nour faculty could present.<br />\nwill bear on its base in English<br />\n* * *<br />\nand Spanish -characteristic statements by the two men and the<br />\nThe germ of a natural flare for<br />\nwords of Victor Hugo in a letter<br />\nmusical criticism appears in the<br />\nto Juarez: \"America has prowrite-up turned in by an ,obscure<br />\nduced two heroes, Lincoln and<br />\nfreshman' on a recent entertainthee: Lincoln by whom slavery<br />\nment. Describing the music at the<br />\ndied and thee by whom Liberty<br />\nDormitory enterta'inment the artilives.\" The plan has been enthucle was worded:<br />\nsiastically received by President<br />\n\"A musical selection followed, a<br />\nObregon, the Secretary of Public<br />\nInstruction, and various student saxophone solo, after which Martin gave a violin solo.\"<br />\ngroups.—The New Student.<br />\n<br />\n—Thomas, Lafayette. Field judge<br />\n-7-Sigmund, Lafayette. Linesman<br />\n—Hastings, Cornell. Time of quarters-10 minutes.<br />\n<br />\n,CLOTHES<br />\nOf course you know that<br />\nThe Barn is handling orders<br />\nfor our clothes again this<br />\nyear.<br />\nThe plan worked to<br />\nmutual advantage last season, and we're mighty glad<br />\nto continue the relationship.<br />\n$30 up<br />\nReady-to-wear Suits<br />\nReady-to-wear O'Coats . $35 up<br />\n<br />\n211-213 E. Baltimore St.<br />\n<br />\nHub<br />\n<br />\nBaltimore's Great<br />\nMen's Store<br />\n<br />\n\"I did not think<br />\nI investigated\"<br />\nWILLIAM KONRAD ROENTGEN<br />\n1845-1923<br />\nBorn in Lennep,Prussia. Educated at Zurich. Awarded the<br />\nRumford Medal of the Royal<br />\nSociety in 1896 jointly with<br />\nPhilip Lenard for discovery of<br />\nX-rays. Won the Nobel Prize<br />\nin physics in 1901.<br />\n<br />\nOne day in 1895, Roentgen noticed that a<br />\ncardboard coated with fluorescent material<br />\nglowed while a nearby Pluecker tube was<br />\nin action. \"What did you think?\" an<br />\nEnglish scientist asked him. \"I did not<br />\nthink; I investigated,\" was the reply.<br />\nRoentgen covered the tube with black<br />\npaper. Still the cardboard glowed. He took<br />\nphotographs through a pine door and discovered on them a white band corresponding to the lead beading on the door. His<br />\ninvestigation led to the discovery of X-rays.<br />\n<br />\nThe General Electric<br />\nCompany manufactures<br />\neverything electric—<br />\nfrom fans to powerful<br />\nlocomotives, from tiny<br />\nlamps to mighty power<br />\nplants. Its products are<br />\nused around the world.<br />\n<br />\nRoentgen's rays have proved an inestimable boon to humanity. In the hands of<br />\ndoctor and surgeon they are saving life<br />\nand reducing suffering. In the hands of<br />\nthe scientist they are yielding new knowledge — even of the arrangement and<br />\nstructure of atoms. The Research Laboratories of the General Electric Company<br />\nhave contributed greatly to these ends by<br />\ndeveloping more powerful and efficacious<br />\nX-ray tubes.<br />\n<br />\nGENERAL ELECTRIC<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 6, 1923<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nSANFORDS<br />\n<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n€1 Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nFOUNTAIN PEN INK<br />\nWill Improve the Action<br />\nof Any<br />\nFountain<br />\nPen<br />\n•<br />\n<br />\nJOHN C. KNIPP 8z SONS<br />\nFURNITURE<br />\n<br />\nALL<br />\nCOLORS<br />\n<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\nDRAPERIES<br />\n<br />\nrrHE constant'<br />\nJ... smoker finds<br />\nin Melachrino<br />\nCigarettes a delicacy of flavor of<br />\nwhich he never<br />\ntires.<br />\n<br />\n••••••<br />\n<br />\nALL<br />\nSIZES<br />\n•<br />\n<br />\n\"The Ink That Made<br />\nThe Fountain Pen Possible\"<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\n<br />\nORIGINAL<br />\n<br />\nMELACHRINO<br />\n\"The One Cigarette Sold the World Over\"<br />\n<br />\nLimited<br />\n<br />\nForm the Time-saving Habit Now<br />\n<br />\nBARN CAFETERIA<br />\n<br />\nMARYLAND BIRDS OBSOPHOMORE<br />\nGRIDDERS<br />\nSERVED BY FIELD CLUB<br />\nSTART REGULAR PRACThe use of the typewriter is a tremendous time-saving<br />\nhelp to anyone in any walk of life—business or profession.<br />\nDURING PAST WEEKS<br />\nTICE FOR FRESHMAN<br />\ngla-JELLICLIg.s OCIENEETIFOrtrigIJEMECIEELII<br />\nGAME<br />\nUse the handy Remington Portable for your themes.<br />\nDuring the past summer three<br />\nTypewrite your lecture notes and assignments. See how<br />\nmarble bird baths were presented Eleven Former Players Available for<br />\nAnnual Clash<br />\nquickly it lightens and lessens all your writing tasks.<br />\nto the university through the NatWith the Freshman game just a<br />\nThe Remington Portable is easy to operate; light,<br />\nuralist Field Club by Mr. William<br />\nmonth off, the Sophomores have<br />\ncompact,<br />\nand can be used anywhere. Full, four-row keyH. Buckler, formerly of Eversettled down to regular football<br />\nboard<br />\nlike<br />\nthe big machines, and many other big machine<br />\ngreen, Baltimore, and now of Lonfeatures. Yet it fits in a case only four inches high.<br />\npractice. On Tuesdays, Wednesdon, England. Two of these have<br />\nPrice, complete with case, $60. Easy payment terms if desired<br />\n\"The King of Lubricants\" recently been placed in founda- days and Fridays a squad of 25<br />\nmen report in old clothes to the<br />\ntions made for the purpose at the<br />\nfield adjoining the Engineering<br />\nSHERWOOD BROTHERS, INC.<br />\nnortheast and southeast corners, ot<br />\nbuildings. President To wnsend<br />\nEKE.EtEKLIEECIENCETELIONEEEHECIE3 the Johns Hopkins Botanical Gar- has taken charge at the workouts<br />\nden.- The third, a work of Italian<br />\nand will continue to do so until<br />\nart, has been temporarily placed<br />\nthe end of this week, when a capnorth of Gilman Hall. These addiBoys, the place to get your<br />\ntain will be elected.<br />\ntions give added charm to the garmeals—and they are honEleven men from last year's<br />\nRemington Typewriter Co.<br />\nden spot of the university.<br />\nsquad have reported. They are:<br />\nest-to-goodness meals, well<br />\n25 W. Fayette St.<br />\nOn Saturday, October 27, the ends, Townsend, Baldwin, Kauls er v e d, and reasonably<br />\nBaltimore<br />\nField Club made a trip around holz and Thomsen; line-men,<br />\nAr-priced—is at<br />\nHomewood to determine the dif- miger, Slingluff and<br />\nSchmidt;<br />\nferent species of birds found at backfield, Draper, Chesney<br />\nand<br />\nthis time of year. The following is 'McKay.<br />\n1 list of birds observed.<br />\nThere is a lack of experience<br />\n1. Hermit Thrush.<br />\namong the new men. Those who<br />\nPRESCRIPTION DRUGGISTS<br />\n9. Junco (snowbird).<br />\nt eported last week were: Sauer3. Tree Sparrow.<br />\n1817 N. Charles St.<br />\nTWO STORES:!<br />\n'vein, Sanderson, Middleton, MilCharles<br />\n4.<br />\nGold<br />\nand<br />\nFinch.<br />\nChase<br />\nSts.<br />\nEutaw Place and North Ave.<br />\n(Half Block below North Ave.)<br />\nburn, Crook, Burnett, T\\I ills,<br />\nVernon 08c0<br />\n5. Purple Finch.<br />\nMadison 0405<br />\nPledge, Webster, Burgess, Love,<br />\n6. Winter Wren.<br />\nHomer<br />\nand<br />\nFonda.<br />\nNine or ten<br />\nNicholas Brown, Mgr.<br />\n7. White Breasted Nuthatch. more candidates' are expected this<br />\n8. Ruby Crowned Kinglet.<br />\nweek.<br />\nBetween 4 and 5 P. M. a memThe Sophomores will not be<br />\nber of the club saw the birds indi- able to obtain equipment mail the<br />\ncated in the list below:<br />\nPrinters of Philological and<br />\nerid of the season, when they hope<br />\nScientific Works<br />\n1. Starling (several).<br />\nto become temporary heirs of<br />\nAt the Washington Monument<br />\n23 S. HANOVER ST.<br />\n2. Blue Bird (several).<br />\nenough varsity equipment for their,<br />\nBaltimore, Md.<br />\n3. Robin (several).<br />\nannual struggle with the Frosh.<br />\nOscar Thomas Olson, D.D.<br />\n4. Junco (snowbird).<br />\nWorkouts will necessarily be light,<br />\nMinister<br />\n5. Field Sparrow.<br />\nand without the usual scrimmage,<br />\nSHIRTS<br />\nNECKWEAR<br />\n6. Tree Sparrow.<br />\nthe second year men will probably<br />\nHopkins Students Are Invited to<br />\n7. Song Sparrow.<br />\nresort to the development of the<br />\nMake This Their Church Home<br />\n8. White Throated Sparrow. open style of play.<br />\n421 N. HOWARD ST.<br />\n9. White Breasted Nuthatch.<br />\nThe purpose and program of this<br />\nHOSIERY<br />\nGLOVES<br />\n10. Myrtle Warblers (many).<br />\nChurch will appeal to you. Look in<br />\n11. Crow (1).<br />\non the Sunday afternoon -At Home\"<br />\n12. Mocking Bird (1).<br />\nThe Flag, Banner & Pennant Shop<br />\nfrom five to seven.<br />\n13. Downy Woodpecker (1').<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nSunday morning worship at 1 I o'clock.<br />\n14. Goldfinch (several).<br />\nEmblems, Silk Banners for Schools,<br />\n15.<br />\nCardinal.<br />\nSocieties and Fraternities<br />\nSunday evening service at 8 o'clock.<br />\n<br />\nHM-0112 01115<br />\n<br />\nRemington<br />\nPortable<br />\n<br />\nThe St. REGIS<br />\nRESTAURANT<br />\n<br />\nHYNSON, WESTCOTT and DUNNING<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\n<br />\nLeFranc & Ault<br />\n<br />\n302 PARK AVE., BALTIMORE, MD<br />\nVernon 2355<br />\nR. H. Taylor<br />\n<br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\nURNER BROTHERS<br />\nI I I E. BALTIMORE STREET<br />\nBaltimore<br />\n<br />\nMusic bv vested chorus—choir of soloists.<br />\n<br />\nBeat<br />\nSt John's<br />\n<br />\n\"At the heart of the City\"<br />\n<br />\nALL SEATS FREE<br />\n<br />\nRENT A CAR<br />\nPrinters of<br />\n<br />\nThe Johns Hopkins<br />\nNEWS-LETTER<br />\n<br />\nCollege Literature<br />\n<br />\nDRIVE IT YOURSELF!<br />\nALL NEW, CLEAN CARS<br />\nFORDS, 12c PER MILE—DODGES OR HUPS, 18c PER MILE<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br />\n<br />\nDRIVE IT YOURSELF CO.<br />\n1725 N. CHARLES ST.<br />\n<br />\nLOM BARD<br />\n<br />\nand<br />\n<br />\nSOUTH STREETS<br />\n<br />\nVERNON 4049<br />\n<br />\nONE BLOCK SOUTH OF NORTH AVE.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVIII, No. 10<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 6, 1923<br /><br />\nPRICE 5 CENTS<br /><br />\nMANY HOPKINS PROFESSORS THURSDAY ASSEMBLY DE- CAMPUS CLUB HOLDS ORRECEIVE MENTION IN<br />\nVOTED TO YELL PRACTICE<br />\nGANIZATION MEETING IN<br />\n\"WHO'S WHO\"<br />\nIN PREPARATION FOR<br />\nGILMAN HALL<br />\nLarge Percentage of Prominent BaltiWESTERN MARYLAND<br />\nThomas To Head Society Through Commoreans Connected with J. H. U.<br />\ning Year<br />\nGAME<br />\nA search through \"Who's Who Dean Latane Pleased With Showing of \"Ben\" Thomas was elected presStudents. Dr. Hollander to<br />\nin America\" reveals the fact that<br />\nident of the Campus Club, a new<br />\nSpeak Next Week<br />\nmost of the Hopkins professors<br />\norganization which started early<br />\nPractically the whole of last<br />\nhave earned a place for themselves Thursday's<br />\nassembly was devot- in the spring and which held its<br />\nin that volumne. There are 92 ed to yell practice to arouse<br />\npep first fall meeting October 31 in<br />\nprofessors, assistants and associ- for the Western Maryland game. Gilman Hall. The main purpose Hopkins Severs Diplomatic Relations With Westates in the three undergraduate \"Tom\" Jenifer and several assist- of the club 18 ,to bring fraternity<br />\nminster College for Using Ineligible<br />\n- schools, of these 28, or a little less ants led the cheering, and the en- and non-fraternity men into closer<br />\nPlayers After Protest<br />\ntire collection of songs and yells<br />\nthan one-third of the total, are listrelations; to further all school acwas rehearsed. The students reHopkins sent Western Maryland to defeat last Saturday in one<br />\ned. Of 24 full professors in the<br />\nsponded enthusiastically in the tivities and to boost athletics. This of the most thrilling football games that has been staged at HomeSchool of Arts and Sciences, 22 are first long yell practice of the year. idea is embodied in similar clubs wood this fall. The visitors put up a stiff fight,<br />\naided by their<br />\nlisted, so it may be seen that it is<br />\nBefore yell practice was begun, in many other colleges, numbered superior weight, but the Black and Blue warriors beat them by their<br />\nonly the younger members of the Dean Latane expressed his satis- among which are University of thorough knowledge of the game and an indomitable spirit to win.<br />\nfaction with the state of affairs in Michigan, George Washington The contest is the last in which the two colleges will meet for some<br />\nfaculty who are not included.<br />\nDr. Maurice Bloomfield, Profes- general. The general confusion University of Maryland and a host time, as the J. H. U. authorities found it necessary to break off athof the opening days of the term<br />\nletic relations with Western Maryland.<br />\nsor of Sanskrit, has the. most space<br />\nof other big colleges. It is ashas disappeared and the students<br />\nThe trouble arose from the inof all devoted to him, 51 lines be- have settled down to<br />\nwork. The sumed that in the near/ future FRESHMAN FOOTBALL TEAM sistence of the Westminster oring necessary to record in compact Dean is especially pleased with the clubs will be united by an inganization to play several men<br />\nLOSES TO POLY'S SECform his achievements; he is fol- the showing of the Freshman tercollegiate society for the exwho were ineligible to play against<br />\nOND TEAM<br />\nlowed closely by Drs.-BuChner and Class, which made a better record change of ideas and new proposi- Grinsfelder Plays Snappy Game at Quar- Hopkins. Byhan, the ponderous<br />\nright tackle of the Green and Gold<br />\nter in 6-0 Contest<br />\nRobinson. And then President in the Psychology test than that tions.<br />\nof any previous entering class. Dr. Two committees were elected to<br />\nWith a 6-0 defeat staring them machine, was admitted by the visGoodnow, with 34 lines, follows.<br />\nLatane thinks that making the get the main business of the club in the face in<br />\nthe last five minutes itors to be ineligible. Cuneo, anThe average space devoted to a<br />\nmatriculation requirements more under way as soon as possible.<br />\nother heavy linesman,- transferred<br />\nof play, the Freshman team fought<br />\nProfessor in the undergraduate strict has had<br />\nthis fall from the University of<br />\nthe desired effect, The membership committee, conschool of this University is about in<br />\nthat undesirable students are sisting of Bonner, chairman; Rich- doggedly to gain the coveted Pittsburgh, thus being ineligible<br />\n25 lines. The average professor is<br />\nards and Rector, have already goal. But their efforts were in by the one-year rule for transfers<br />\nkept away.<br />\na Member of five honorary sociThe Dean announced that Dr. made out a list of new men to be vain, for just as Brown had re- among Maryland colleges. Aneties, and has written four books,<br />\nJacob H. Hollander, Professor of taken in. The Pin Committee, ceived a wonderful forward from other ineligible player, Smith, forof sufficient importance to be used<br />\nPolitical Economy, would address composed of Barton, Wales, Shri- Grinsfelder behind<br />\nthe goal, Ref- merly of Mt. St. Mary's, was in<br />\nin his short biography. Included<br />\nthe assembly next Thursday on ver and Rowland, have several deuniform but he did not play in the<br />\neree Goddard called Grinsfelder<br />\nin the number of books is the num\"Business Forecasting.\" The sub- signs for the key which is to be the<br />\ngame. Dean Schofield refused to<br />\nber of publications of which he is<br />\nject is scientific, and is not, as insignia of the club, and are work- off-side. Were it not for Cone's consult with Dr. Abercrombie<br />\neditor.<br />\nmight be supposed, largely specu- ing to get it out without further tackling, extraordinary line-plung- -about these men before the game,<br />\nThe above survey includes only<br />\nlative. The School .of Business delay. The key which will in all ing, however, the Freshmen would thereby adding to the accumulateachers who have direct teaching<br />\nEconomics at Harvard recently probability be selected is one of never have staged the rally they tion of grievances against the<br />\nconections with the undergraduate<br />\nwesterners.<br />\nstarted a Department of Business neat design—very conservative, did. Poly made her score in<br />\nthe<br />\nschools of Arts and Sciences, Enyet<br />\nindicative<br />\nHopkins made all 17 of the<br />\nof the purposes of<br />\nForecasting.<br />\nfirst quarter when Gough threw a<br />\ngineering and Commerce. It does<br />\npoints in the first half of the game.<br />\nRandolph Norwood, president the organization.<br />\nnot take into account the famous<br />\nThe men who started the new misdirected forward right into the The Black and Blue gained at will<br />\nof the Student Council. announced<br />\nProfessors of the graduate departthat activities buttons are being club are as follows: Ben Thomas, hands of O'Connor, of Poly, who against the team which opposed<br />\nments, of the Medical School, and<br />\ndistributed at the Barn, and that president; Eben Perkins, vice- ran 60 yards for the touchdown. them. Western Maryland was<br />\nof the School of Hygiene. It is<br />\nIn the first quarter, the Frosh weak in the first half compared to<br />\nFreshmen must get them. Fresh- president; George Rector, secreinteresting to note, however, that men are<br />\nplayed<br />\nraggedly, and Poly made Coach Van Orman's charges. The<br />\nalso required to print tary; John Shriveri, 'treasurer;<br />\nof the 470 professors,--iassociates their<br />\nHerbert Wilger, sergeant-at-arms; consistent gains by end-running. Blue Jays stole an early lead by<br />\nnames on game tags.<br />\nand instructors of the University;<br />\nBonner, Klinefelter, Wales, Bar- Frank kicke'd off and it was Poly's scoring the first touchdown three<br />\n72 of the full professors, out of<br />\nCLASS OF '23 TO STAGE RE- ton, Alfriend, Peyton, McNutt, ball on their 25-yard line. They minutes after the opening whistle.<br />\n83 'now teaching, are included in<br />\ntook the ball by end runs to mid- This tally was made by Turnbull<br />\nRichards.<br />\nUNION AND DANCE SATthe \"Who's Who,\" and 21 more<br />\nIt may be seen that the member- field for a first down, but then after his teammates had worked<br />\nURDAY AFTER GAME<br />\nare included from teachers of lessFormal Affair to be Staged at Casualty ship is very comprehensive, taking fumbled, and Hopkins recovered. the ball up the field by a series of<br />\ner grade. This total of 93 is slight- Clubhouse. Undergraduates<br />\nin athletic as well as non-athletic The spheroid went back to Poly brilliant forward passes. TurnExpectly more than one-fifth of all teached in Large Numbers<br />\nmen; fraternity men and non-fra- on downs, who took it 20 yards bull also added the point after the<br />\ners in all schools of Johns Hopkins<br />\nWith Fisher's Orchestra already ternity men.<br />\nup field by end running. Here the touchdown. The remainder of the<br />\nUniversity.<br />\nengaged the plans of the Reunion<br />\nFrosh line held tightly and the ball first period saw the ball in WestThere are 300 Baltimoreans in- Committee of the Class of 1923 for STUDENT COUNCIL SANCTIONS went to Hopkins on downs. Gough<br />\nern Maryland's territory most of<br />\ncluded in \"Who's Who.\" Slightly a dance to be held the night of the<br />\nALUMNI TEA IN DORMITORY<br />\nat this point committed his fatal the time; the visitors being unable<br />\nless than one-third of the total St. John's game in the Maryland<br />\nThe Alumni Tea, to be f„.,&gt;.;ven error, for O'Conner of Poly inter- to work it past the middle of the<br />\nnumber of names included from Casualty Clubhouse are rapidly in the<br />\nDormitory for the Alumni cepted his forward and ran for a field. During this quarter Hopthis city are those of Hopkins pro- materializing. The committee, exand their wives on November 10, touchdown. Poly missed the kick kins made two first downs, blocked<br />\nfessors. This is a surprising num- pecting a large number of alumni<br />\nafter goal. The rest of the quar- two kicks, and was forced to punt<br />\nber and proportion with regard to and undergraduates at the dance, was sanctioned by the Student<br />\nter the ball was mostly in midfield, four times; Western Maryland<br />\nthe size of the city, but the number are setting a nominal subscription Council ins a recent meeting. This, and was featured by Cone's plucky<br />\nmade one first down, intercepted<br />\nof professors included could not of $1.00. The Hopkins and St. the day of the St. Johns' game, tackling and Grinsfelder's gain<br />\ntwo passes, and was forced to kick<br />\nPossibly be shortened, so the total John's football team will be in- is \"get-together day\" for the through the line.<br />\nseven times.<br />\nis taken to indicate, in one way, vited to attend the dance as guests Alumni and the tea should make<br />\nThe second quarter was still a<br />\nIn the second period Hopkins<br />\nthe importance of this University of the Class of 1923. A number it even more successful than in ragged affair, being<br />\nfeatured by outplayed the visitors as much as<br />\nto the city and state. If time of surprises have been arranged former years.<br />\nmany fumbles on both sides. Finn, in the first. Schact scored the<br />\nserved to make a list of the men for the occasion.<br />\nOther problems settled by the of Poly, intercepted a forward J. H. U.'s second touchdown,<br />\ntwo<br />\nwho are connected with Hopkins The '23 class will assemble at \"Council are as follows: The dues from Grinsfelder. Then Poly fumminutes after the beginning of the<br />\nas trustees,<br />\nor in other less Homewood Field before the game for the Student Council were bled but recovered. They kicked quarter,<br />\nafter catching a long pass<br />\ndirect manners than teaching, the and will stage an impromptu fixed at $15 a class. The dance to Grinsfelder on Hopkins<br />\n25-yard from Taylor. Western Maryland<br />\nProportion would be considerably march shortly before the opening proposed by the Freshmen Class line. The ball was on Hopkins 40tried a good many passes in this<br />\nhigher.<br />\nwhistle blows. During the contest was refused sanction but it was yard line when Grinsfelder fum- period, completing several of<br />\nthe members of the class will take suggested that a smoker be held bled and Poly recovered. Poly im- them. Hall was responsible for<br />\npart in the rooting and will en- instead which will serve just as mediately made 15 yards by an these passes, his arm being almost<br />\ndeavor to drown out the under- well to arouse freshmen spirit. end run, and they looked threat- as sure as Taylor's. Between Hall<br />\nNOTICE<br />\ngraduate body.<br />\nThat the names of the Freshmen ening. However the Frosh line and Taylor the audience had a.<br />\nJunior Class meeting WedThe committtee in charge of the not actually participated in any held and it went to Hopkins on chance to witness some fine<br />\nfornesday, 12.20, C. E. Hall.<br />\nevents of the day consists of Lan- activity will be published next downs. Grinsfelder kicked to mid- ward pass work. Toward the end<br />\ndy, chairman; Vanneman, Sher- week. Plans for the Freshman- field. Cone intercepted a Poly pass of the second quarter Turnbull<br />\nwood, Fallon and Collins.<br />\nSophomore Rush were begun.<br />\non 40-yard line and it was Hop- added three more points to HopNews-Letter Business Board and<br />\nAnother reunion of the 1923<br />\nD.<br />\nE.<br />\nKline,<br />\n'25,<br />\nwas<br />\nkins' ball. Grinsfelder • made a kins' total by a placement kick<br />\nelected<br />\ncandidates report at office at<br />\nclass will be held during „Tune Secretary and Treasurer of the good offside kick to Poly's 15-yard from the 25-yard line.<br />\n12.20.<br />\nWeek.<br />\nStudent Council at this meeting.<br />\nContinued on page.2. col. 3<br />\nContinued on page 3, col. 3<br /><br />\nWESTERN MARYLAND SUFFERS<br />\nBLANKET DEFEAT AT HANDS<br />\nOF BLACK AND BLUE TEAM<br /><br />\nTHE JOHNS HOPKINS NEWS1LETTER, NOVEMBER 6, 1923<br /><br />\n2<br /><br />\n.<br />\nBLACK AND BLUE JAY DUEI other, and the ball finally was Sidney. This kind of hair cut is<br />\nto present the cranium absolutely<br />\nplaced on Poly's 40-yard line.<br />\nTO APPEAR THIS WEEK<br />\nThe fourth quarter saw a ray of devoid of any capillary vegetation<br />\nEditors Decide to Abandon Feature Issues This Year<br />\nhope for Hopkins. After kicking or in other words, clip the entire<br />\nFOUNDED 1897.<br />\nThe Black and Blue Jay, whose back and forth, Poly fumbled and head.—The Hampden-Sidney Tiappearance on the campus has Hopkins recOvered. Grinsfelder ger.<br />\n$2.00<br />\nSubscription<br />\nbeen delayed by the failure of the kicked to Poly's 25-yard line, when<br />\nCone went through the line time<br />\nengraver to finish work on time.<br />\nagain, clipping off big chunks<br />\nand<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nwas scheduled to arrive yester- of yardage. It was first down 9n<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nday. It will be the Freshman Poly's 10-yard line with three minJohns<br />\nof<br />\nstudents<br />\nthe<br />\nby<br />\nnumber, the work of the candi- utes to go. The ball, however,<br />\nPublished semi-weekly from October to June<br />\nHopkins University.<br />\ndates and new members of the went to Poly on their 5-yard line.<br />\nThey kicked to Grinsfelder who<br />\nstaff being fully represented.<br />\nBusiness communications should be addressed to the BUSINESS MANran it to their 20-yard line. Here<br />\ncommunications<br />\nAGER,JOHNS HOPKINS UNIVERSITY; all articles and other<br />\nThe next issue is due to come<br />\nhe made that offside pass to<br />\nihould be sent to the MANAGING EDITOR.<br />\nout about December 20, and after Brown, and then made another<br />\nHomewood 100 New Year the regular issues will good pass to Gough on the 12-yard<br />\nCelephone<br />\nappear in rotation. • The Editor line. But Hopkins lost the halt on<br />\nannounces there will be seven downs and Poly kicked out of<br />\nCSomething new in portable<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nWith Cleveland's and<br />\ntypewriters.<br />\nnumbers this year, instead of six trouble.<br />\nJOSEPH LEOPOLD, '24.<br />\nPHILIP W. HOWARD, '25.<br />\nas formerly.<br />\nCone's help the ball was again<br />\n(Lit writes nearly all lanManaging Editor<br />\nA new policy in the editorial brought back to Poly's 10-yard<br />\nguages.<br />\nAdvertising Manager<br />\nWILLIAM G. DEAN, JR., '24.<br />\nwork will be followed, for a time line. It was fourth down and only<br />\nFITZGERALD DUNNING, '24.<br />\nCHas 90 characters.<br />\nat least. In former years each five to go when the whistle blew<br />\nAssistant Managing Editor<br />\nManager<br />\nCirculation<br />\nT. REESE MARSH, '24.<br />\nnumber has been designated by for the end of the game.<br />\nSee Fred Rich, College<br />\nJOHN C. LEWIS, JR., '24.<br />\nas<br />\nthe<br />\nsuch<br />\nname,<br />\nRushspecial<br />\na<br />\nRepresentative<br />\nfirst<br />\nthe<br />\nin<br />\noutplayed<br />\nThough<br />\nAssociate Editors<br />\nSpring<br />\netc.<br />\ning<br />\nNumber,<br />\nFancies,<br />\nthe<br />\nin<br />\nback<br />\ncame<br />\nHopkins<br />\nhalf,<br />\nAssistant Business Managers<br />\nRICHARD C. TILGHMAN, '25.<br />\n118 W. FAYETTE ST.<br />\nInasmuch as the material includ- last two periods and ripped<br />\nJOHN W. PARSONS, '25.<br />\nD. MILES MARRIAN, '25.<br />\nBALTIMORE, MD.<br />\nBENJAMIN T. ROME, '25.<br />\ned usually bore a very faint re- through Poly's line for big gains.<br />\nG. DONALD GIESKE, '25.<br />\nJOHN T. DIXON,'24.<br />\nsemblance to the special title, it The second half was chiefly feaJunior Editors<br />\nA. J. MoKAY, '26.<br />\nV. EDWARD THOMSEN, JR., '26.<br />\nhas been deoided to abandon this tured by Cone's line plunging and<br />\nARTHUR L. NELSON, '26.<br />\nC. EUGENE TOVELL, '24.<br />\nmethod, for -the next issue, at end running, and he undoubtedly<br />\nERNEST A. STRATHMAN, '26.<br />\nOTHO J. KELLER, III, '26<br />\nALGER G. Hiss, '26<br />\nleast,<br />\nand work just straight num- proved to be Hopkins' greatest asJ. JACKSON KIDD, '26<br />\nEDWARD 0. MICHEL, '26.<br />\nbers.<br />\nset.<br />\nT. STRAN SUMMERS, '25<br />\nCHARLES G. HUTZLER, '24.<br />\nThe Editors of the Jay want atThe line-up follows:<br />\ntention called to the fact that<br />\nHopkins (0)<br />\nPoly (6)<br />\nneither their office, nor their<br />\nMember Southern Intercollegiate Newspaper Association<br />\nBlumberg<br />\nL.E.....<br />\nKaffel<br />\ndesks were constructed for speStone<br />\n(capt.)<br />\n.<br />\nL.T.<br />\nAhroon<br />\ncial use as card playing centers,<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nBroening<br />\n..L.G.....<br />\n..<br />\nand ask all parties who feel the O'Connor<br />\nFranck<br />\n....C....<br />\nneed of such entertainment to Atley<br />\nSteinwald<br />\nRG<br />\nseek another spot for their game. Pourie<br />\nBALTIMORE, MD., NOVEMBER 6, 1923<br />\nCovel ........R.T.... Shlossberg<br />\nNicolls<br />\nTEAM Sharatz ......R.E<br />\nFOOTBALL<br />\nFRESHMAN<br />\nGough<br />\nQ B.<br />\nRowe<br />\nLOSES TO POLY'S SECOND<br />\nEXIT THE \"GREEN TERRORS\"<br />\nTEAM<br />\nGrinsfelder<br />\nLH<br />\nNeatly combed, well- ept hair is a<br />\nFader<br />\nbusiness and social asset.<br />\nI<br />\npage<br />\nfrom<br />\nContinued<br />\nCone<br />\nR<br />\nH<br />\nFinn<br />\nSTACOMB makes the hair stay combed<br />\nOne significant feature of the recent misunderstanding with<br />\nin any style you like even after it has<br />\nthe<br />\nif<br />\n'<br />\nBrian<br />\nas<br />\n..<br />\nnow<br />\nlooked<br />\nIt<br />\nline.<br />\n.......F.B........<br />\nPindell<br />\njust been washed.<br />\nWestern Maryland College is the fact that the Westminster instituFreshmen were tightening up, but<br />\nSTACOMB—the original—has been<br />\nSubstitutions—Hopkins, Brown<br />\nused for years by stars of stage and<br />\ntion did not attempt to deny the charge of professionalism lodged the half was too near over for<br />\nscreen—leaders of style. Write today<br />\nfor Blumberg, I. Phillips for Brifor free trial tube.<br />\nagainst several of its players. Although Hopkins was not in a po§i- them to do antyhing.<br />\nTubes-35c Jars-75c<br />\nIn the second half Frank kicked an, Brian for I. Phillips, Blumberg<br />\ntion to prove its charges, Western Maryland neglected to issue any<br />\nInsist on STACOMB—in the black,<br />\nyellow and gold package.<br />\nclean-cut statement saying or inferring that the assertion was false. off to Poly's goal-post and the ball for Nicolls, Cleveland for Brian,<br />\nFor sale at your druggist or wherever<br />\nThey<br />\nyards.<br />\n20<br />\nback<br />\nwas run<br />\ntoilet goods are sold.<br />\nAppleby for Gough. Referee—<br />\nto<br />\nendeavored<br />\nauthorities<br />\nathletic<br />\nHopkins'<br />\nBefore the contest,<br />\nStandard Laboratories,Inc.<br />\nkicked to Hopkins at their 35-yard Goddard, City College.<br />\n750 Stanford Avenue Los Angeles, California<br />\nascertain whether or not Western Maryland intended to play the men line. Then Grinsfelder tried a<br />\nSend coupon for Free Trial Tube.<br />\nunder dispute. The visiting coach refused to divulge his list of drop-kick but it was too long a disSTANDARD LABORATORIES.Inc.<br />\nThe \"Kullegiate kut for a kol750 Stanford Aye., Lou Angeles, California. Dept. 1<br />\nPlease send me free trial tube.<br />\neligible men, saying he had not decided upon his line-up, and would tance. It was Poly's ball on Pcly's<br />\nleg kid\" is the brand Of hair cut<br />\nquarName'<br />\nthe<br />\nof<br />\nrest<br />\nThe<br />\nline.<br />\n12<br />\n-yard<br />\nwould<br />\nAbercrombie<br />\nplay whom he pleased. Upon being told that Dr.<br />\nAddress<br />\nter both team s kicked to each worn by 29 students of Hampdenlike to confer with them, the Westminster coach and Athletic Director declined pointblank to further discuss the matter. In addition to<br />\nrefusing to name the players which were to participate, the visitors<br />\napparently made a public attempt to conceal the identity of the disputed men by juggling the numbers on the jerseys. This ruse only<br />\nsucceeded in corifusing and-displeasing the large crowd of -spectators.<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\n\"XC\"<br />\nCORONA<br />\nHave you<br />\nseen it?<br /><br />\nPr<br /><br />\nUnruly<br /><br />\nWestern Maryland, for the last several years, has not displayed<br />\nwhat is known as clean football. Spectators of the 1922 clash, especially, Will recall the tactics which caused frequent penalties and left<br />\nan unpleasant remembrance in the minds of local sport lovers.<br />\nWestern Maryland has hot defeated Hopkins on the gridiron<br />\nsince the days of \"Holly\" Keller and it is unlikely that the Westminster College will ever 'again be in a position to claim the State<br />\nChampionship. This being the case, there is little to be gained<br />\nfrom keeping them on the schedule. Hopkins' activities need national<br />\nadvertising and the fact that the Homewood team has defeated Western Maryland does not cause sprea'ds to appear in newspapers out of<br />\nthe city.<br />\nThe student body would not have approved of a last moment's<br />\ncancellation of Saturday's game. With Western Maryland's reputed<br />\nprowess it might have appeared as if Hopkins was afraid of the<br />\nconsequences. There are few, however, who will bemoan the fact<br />\nthat the \"Green Terrors\" will not be seen at Homewood Field next<br />\nfall.<br /><br />\nSACRILEGE?<br />\nThere is a rumor existing that there will be no parade on Saturday morning preceding the St. John's game. This.parade is a tradition<br />\nwhich has existed since the Black and Blue and the St. Johnnie's<br />\nfirst clashed. Alumni from far back can recall marching through the<br />\nstreets of Baltimore and predicting the fate of St. John's to the<br />\npeople of the Monumental City.<br />\nWe feel that the omission of this parade would be sacrilegious.<br /><br />\n\"What a difference<br />\njust a few cents make!\"<br /><br />\nFATIMA<br /><br />\nir<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 6, 1923<br />\nis<br />\nly<br />\n)11<br /><br />\nre<br />\n1-<br /><br />\nL.<br /><br />\nGEOLOGY CLASS TAKES A<br />\nTRIP TO MT. WASHINGTON AND WOODBERRY<br />\nStudents, in Search of Young Streams,<br />\nTramp Through Suburbs of<br />\nBaltimore<br /><br />\nThe students of Geology I, under the guidance of Dr. Hall, instructor in Geology, took a long<br />\ntramp last -Wednesday afternoon<br />\nin search of streams in varying<br />\nstages of development. Starting<br />\nat 1:00 o'clock from the campus,<br />\nthe group progressed westward<br />\nacross Wyman's Park Driveway,<br />\nover the railroad tracks, to the<br />\nMt. Vernon-Woodberry Mills.<br />\n, Here, a stream in infancy, the<br />\nJones' Falls, was observed. Specimens of rock, such as Baltimore<br />\ngneiss and pigmatite, were also<br />\ncollected at this point.<br />\nThe party then proceeded to<br />\nHampden, where they boarded a<br />\nstreet car and the group went to<br />\nBare Hills. Here, a stream in maturity, exhibiting flood plains and<br />\nmeanders, was observed. Lake<br />\nRoland, further up Stream, was<br />\nthen discussed and several stu• dents with cameras took pictures.<br />\nIn order to enable students on<br />\nthe football squad to re-turn to the<br />\ncampus• in time for practice, Dr.<br />\nSchwartz has arranged a plan<br />\nwhereby machines will be sent<br />\nout to bring the men in.<br />\nThe trip described above was<br />\nrepeated last Friday afternoon by<br />\nanother group under the guidance<br />\nof Professor Schwartz.<br /><br />\nSUFFERS<br />\nMARYLAND<br />\nWESTERN<br />\nBLANKET DEFEAT BY J. H. U.<br />\nContinued from page 1<br /><br />\nfor Carter, Cook for Almy, Aimy<br />\nfor Bonner, Carr for Day; Western Maryland, Peiffer for Kinsey,<br />\nFlanagan for E. Williams, Holt for<br />\nStanley, Kinsey for Peiffer. Touchdowns—Turnbull, Schacht. Goals<br />\nfrom field—Turnbull (by placement, Bonner holding ball). Tries<br />\nfor points—Turnbull, 2 (by placekick, Bonner holding ball). Referee--G. Hoban, Lehigh. Umpire<br /><br />\nThe second half of the game was<br />\nmore creditable for Coach Shroyer's charges. During the latter<br />\npart of the game the Methodists<br />\nplayed the ball more and more<br />\noften in Hopkins' territory.<br />\nThroughout the first half the visitors had been unable to play the<br />\nball in dangerous ground, but they<br />\nIn Baltimore alone there must<br />\ngained strength between halves.<br />\nGERHARD &amp; REED CO.<br />\nbe nearly a million definitions and They also learned the Hopkins<br />\nTAILORS<br />\nstandards of that most illusory signals between the halves as the<br />\nmen'<br />\nknew<br />\nexactly<br />\ngreen-clad<br />\nAnother<br />\nthing--a sense of humor.<br />\nI 10 N. EUTAW STREET<br />\nis witty only when his wit agrees where Taylor was calling the<br />\n2nd Floor<br />\nplays. Several times the visitors<br />\nwith yours.<br />\ngot close to the goal line but they<br />\nA widely read New York col- Were not capable of making the<br />\nSARATOGA AT<br />\numnist recently stated that the needed distance past the fighting<br />\nLIBERTY STS.<br />\nthinking, producing, art-loving, Black and Blue eleven.<br />\ndrama-supporting class of the meIn the game'Hopkins made six<br />\nLUNCHEON<br />\ntropolis is composed of stenogra- first downs, blocked two kicks, inTEA<br />\nphers, almost entirely. A hasty tercepted four passes, tried eightDINNER<br />\ncensus of stenographers in Balti- een forward passes and completed<br />\nmore has failed to show any rela- six. Western Maryland made eight<br />\nSPECIAL PARTIES<br />\n11.30 A. M.<br />\ntive dearth here; apparently the first downs,. intercepted five<br />\nuntil<br />\nPLAZA 6987<br />\nfew theatres of which we may passes, tried ten forward passes, 7.30 P. M.<br />\noverboast (but do not) should be<br />\nand complete two. Line-up:<br />\nrun by typists. Yet within the Hopkins (17)<br />\nWest. Md. (0)<br />\nlast week we have been warned Schacht ......L.E.<br />\nClayton<br />\nthat our three legitimate houses Magill ......L.T.<br />\nCu n eo<br />\nmay be closed in the next few Day<br />\nC<br />\nDuncan<br />\nweeks unless attendance increases. Wolbert<br />\nR G.<br />\nMcRobie<br />\nMeanwhile holders of stock in vau- Bartori<br />\nL.G... E. Williams<br />\ndeville and burlesque \"theatres\" Carter<br />\nByham<br />\nR.T..<br />\nsmile with content—the content of Rich<br />\nR.E.<br />\nGroton<br />\nthe prosperous. Mr. Brown's state- Taylor<br />\nStanley<br />\nQB<br />\nment has been called subtle wit, Turnbull .....L.H.<br />\nSillin<br />\npseudo wit, obvious fact, and bald Bonner<br />\nKinsey<br />\nRH<br />\nmisstatement.<br />\nLong<br />\nFB<br />\nAlmy<br />\n0-17<br />\n0<br />\n10<br />\n.......7<br />\nHopkins<br />\nWe can't decide whether his<br />\nbrand of cleverness disagrees with Western Md.... 0 0 0 0— 0<br />\nSubstitutions—Hopkins, Slowik<br />\nour own; or whether New Yorkers<br /><br />\nLEHIGH STUDENTS FORM<br />\nUNIVERSITY RADIO CLUB employ a totally different race in<br />\nOne of the organizations that their offices; or what!<br />\nLehigh has lacked for some time<br />\n* * *<br />\nThis<br />\nClub.<br />\nRadio<br />\norganized<br />\nis 'anTypists remind us of typesetters.<br />\nyear, there being a large number<br />\nLast week we learned that the<br />\nof radio amateurs present at the Dormitory Get-together \"broke<br />\nUniversity, a club was organized up\" with the singing of \"Some<br />\nand plans were made to have a Stand Together\"—the break up<br />\nvery thorough and interesting pro- was apparently inevitable. In the<br />\ngram. It will be interesting to same proof George Darley \"narnote that the students taking part rowly missed a 90-yard drop-kick<br />\nin this organization are, many of from a difficult angle.\"<br />\nthem, old friends who, while they<br />\n* * *<br />\nhad never seen each other., have<br />\nmade lasting friendships through<br />\n\"Native German And Dwarf In<br />\ntheir talking to each other over the Stature, But Intellectual Giant\"—<br />\nradio.<br />\nheadline in a Baltimore paper.<br />\nThe club was organized last \"What a world of solemn<br />\nWednesday night at a meeting thought that `but' compels,\" we<br />\nheld by these old amateur radio can hear Poe answering.<br />\n.friends. About thirty radio fans<br />\nTo be a \"native German is, of<br />\nwere present and a large number<br />\na great intellectual handicourse,<br />\nsent word that they were unable<br />\nsomehow Schopenhauer,<br />\ncap;<br />\nyet<br />\nto come because of their studies.<br />\ntwo<br />\nTemporary officers were elected Nietzsche, Kant, and one or<br />\nit<br />\novercome<br />\nto<br />\nothers managed<br />\nwith the following results:<br />\nPresident, Gordon, '24; secre- with a fair degree of success.<br />\n* * *<br />\ntary and treasurer, Tyler, '25.<br />\nWhite.<br />\n—The Lehigh Brown and<br />\nIt seems to us that Lehigh has<br />\na very laudable and desirable inA group of American students, stitution. In spite of the great<br />\nstudying at the National Univer- number of clubs and organizations<br />\nsity at Mexico City, have organ- at Hopkins we feel sure that there<br />\nized a movement to erect a mon- is room for so interesting a society<br />\nument to two national figures of on the J. H. U. campus. Lehigh<br />\nthe United States and Mexico. has a Faculty Dramatic Club.<br />\nThe proposed monument is to rppWithout being personal just<br />\nresent Lincoln and Juarez claspthink of the roaring entertainment<br />\ning hands across the border. It<br />\nour faculty could present.<br />\nwill bear on its base in English<br />\n* * *<br />\nand Spanish -characteristic statements by the two men and the<br />\nThe germ of a natural flare for<br />\nwords of Victor Hugo in a letter<br />\nmusical criticism appears in the<br />\nto Juarez: \"America has prowrite-up turned in by an ,obscure<br />\nduced two heroes, Lincoln and<br />\nfreshman' on a recent entertainthee: Lincoln by whom slavery<br />\nment. Describing the music at the<br />\ndied and thee by whom Liberty<br />\nDormitory enterta'inment the artilives.\" The plan has been enthucle was worded:<br />\nsiastically received by President<br />\n\"A musical selection followed, a<br />\nObregon, the Secretary of Public<br />\nInstruction, and various student saxophone solo, after which Martin gave a violin solo.\"<br />\ngroups.—The New Student.<br /><br />\n—Thomas, Lafayette. Field judge<br />\n-7-Sigmund, Lafayette. Linesman<br />\n—Hastings, Cornell. Time of quarters-10 minutes.<br /><br />\n,CLOTHES<br />\nOf course you know that<br />\nThe Barn is handling orders<br />\nfor our clothes again this<br />\nyear.<br />\nThe plan worked to<br />\nmutual advantage last season, and we're mighty glad<br />\nto continue the relationship.<br />\n$30 up<br />\nReady-to-wear Suits<br />\nReady-to-wear O'Coats . $35 up<br /><br />\n211-213 E. Baltimore St.<br /><br />\nHub<br /><br />\nBaltimore's Great<br />\nMen's Store<br /><br />\n\"I did not think<br />\nI investigated\"<br />\nWILLIAM KONRAD ROENTGEN<br />\n1845-1923<br />\nBorn in Lennep,Prussia. Educated at Zurich. Awarded the<br />\nRumford Medal of the Royal<br />\nSociety in 1896 jointly with<br />\nPhilip Lenard for discovery of<br />\nX-rays. Won the Nobel Prize<br />\nin physics in 1901.<br /><br />\nOne day in 1895, Roentgen noticed that a<br />\ncardboard coated with fluorescent material<br />\nglowed while a nearby Pluecker tube was<br />\nin action. \"What did you think?\" an<br />\nEnglish scientist asked him. \"I did not<br />\nthink; I investigated,\" was the reply.<br />\nRoentgen covered the tube with black<br />\npaper. Still the cardboard glowed. He took<br />\nphotographs through a pine door and discovered on them a white band corresponding to the lead beading on the door. His<br />\ninvestigation led to the discovery of X-rays.<br /><br />\nThe General Electric<br />\nCompany manufactures<br />\neverything electric—<br />\nfrom fans to powerful<br />\nlocomotives, from tiny<br />\nlamps to mighty power<br />\nplants. Its products are<br />\nused around the world.<br /><br />\nRoentgen's rays have proved an inestimable boon to humanity. In the hands of<br />\ndoctor and surgeon they are saving life<br />\nand reducing suffering. In the hands of<br />\nthe scientist they are yielding new knowledge — even of the arrangement and<br />\nstructure of atoms. The Research Laboratories of the General Electric Company<br />\nhave contributed greatly to these ends by<br />\ndeveloping more powerful and efficacious<br />\nX-ray tubes.<br /><br />\nGENERAL ELECTRIC<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 6, 1923<br /><br />\nFURNITURE OF QUALITY<br /><br />\nSANFORDS<br /><br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n€1 Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nFOUNTAIN PEN INK<br />\nWill Improve the Action<br />\nof Any<br />\nFountain<br />\nPen<br />\n•<br /><br />\nJOHN C. KNIPP 8z SONS<br />\nFURNITURE<br /><br />\nALL<br />\nCOLORS<br /><br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\nDRAPERIES<br /><br />\nrrHE constant'<br />\nJ... smoker finds<br />\nin Melachrino<br />\nCigarettes a delicacy of flavor of<br />\nwhich he never<br />\ntires.<br /><br />\n••••••<br /><br />\nALL<br />\nSIZES<br />\n•<br /><br />\n\"The Ink That Made<br />\nThe Fountain Pen Possible\"<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br /><br />\nORIGINAL<br /><br />\nMELACHRINO<br />\n\"The One Cigarette Sold the World Over\"<br /><br />\nLimited<br /><br />\nForm the Time-saving Habit Now<br /><br />\nBARN CAFETERIA<br /><br />\nMARYLAND BIRDS OBSOPHOMORE<br />\nGRIDDERS<br />\nSERVED BY FIELD CLUB<br />\nSTART REGULAR PRACThe use of the typewriter is a tremendous time-saving<br />\nhelp to anyone in any walk of life—business or profession.<br />\nDURING PAST WEEKS<br />\nTICE FOR FRESHMAN<br />\ngla-JELLICLIg.s OCIENEETIFOrtrigIJEMECIEELII<br />\nGAME<br />\nUse the handy Remington Portable for your themes.<br />\nDuring the past summer three<br />\nTypewrite your lecture notes and assignments. See how<br />\nmarble bird baths were presented Eleven Former Players Available for<br />\nAnnual Clash<br />\nquickly it lightens and lessens all your writing tasks.<br />\nto the university through the NatWith the Freshman game just a<br />\nThe Remington Portable is easy to operate; light,<br />\nuralist Field Club by Mr. William<br />\nmonth off, the Sophomores have<br />\ncompact,<br />\nand can be used anywhere. Full, four-row keyH. Buckler, formerly of Eversettled down to regular football<br />\nboard<br />\nlike<br />\nthe big machines, and many other big machine<br />\ngreen, Baltimore, and now of Lonfeatures. Yet it fits in a case only four inches high.<br />\npractice. On Tuesdays, Wednesdon, England. Two of these have<br />\nPrice, complete with case, $60. Easy payment terms if desired<br />\n\"The King of Lubricants\" recently been placed in founda- days and Fridays a squad of 25<br />\nmen report in old clothes to the<br />\ntions made for the purpose at the<br />\nfield adjoining the Engineering<br />\nSHERWOOD BROTHERS, INC.<br />\nnortheast and southeast corners, ot<br />\nbuildings. President To wnsend<br />\nEKE.EtEKLIEECIENCETELIONEEEHECIE3 the Johns Hopkins Botanical Gar- has taken charge at the workouts<br />\nden.- The third, a work of Italian<br />\nand will continue to do so until<br />\nart, has been temporarily placed<br />\nthe end of this week, when a capnorth of Gilman Hall. These addiBoys, the place to get your<br />\ntain will be elected.<br />\ntions give added charm to the garmeals—and they are honEleven men from last year's<br />\nRemington Typewriter Co.<br />\nden spot of the university.<br />\nsquad have reported. They are:<br />\nest-to-goodness meals, well<br />\n25 W. Fayette St.<br />\nOn Saturday, October 27, the ends, Townsend, Baldwin, Kauls er v e d, and reasonably<br />\nBaltimore<br />\nField Club made a trip around holz and Thomsen; line-men,<br />\nAr-priced—is at<br />\nHomewood to determine the dif- miger, Slingluff and<br />\nSchmidt;<br />\nferent species of birds found at backfield, Draper, Chesney<br />\nand<br />\nthis time of year. The following is 'McKay.<br />\n1 list of birds observed.<br />\nThere is a lack of experience<br />\n1. Hermit Thrush.<br />\namong the new men. Those who<br />\nPRESCRIPTION DRUGGISTS<br />\n9. Junco (snowbird).<br />\nt eported last week were: Sauer3. Tree Sparrow.<br />\n1817 N. Charles St.<br />\nTWO STORES:!<br />\n'vein, Sanderson, Middleton, MilCharles<br />\n4.<br />\nGold<br />\nand<br />\nFinch.<br />\nChase<br />\nSts.<br />\nEutaw Place and North Ave.<br />\n(Half Block below North Ave.)<br />\nburn, Crook, Burnett, T\\I ills,<br />\nVernon 08c0<br />\n5. Purple Finch.<br />\nMadison 0405<br />\nPledge, Webster, Burgess, Love,<br />\n6. Winter Wren.<br />\nHomer<br />\nand<br />\nFonda.<br />\nNine or ten<br />\nNicholas Brown, Mgr.<br />\n7. White Breasted Nuthatch. more candidates' are expected this<br />\n8. Ruby Crowned Kinglet.<br />\nweek.<br />\nBetween 4 and 5 P. M. a memThe Sophomores will not be<br />\nber of the club saw the birds indi- able to obtain equipment mail the<br />\ncated in the list below:<br />\nPrinters of Philological and<br />\nerid of the season, when they hope<br />\nScientific Works<br />\n1. Starling (several).<br />\nto become temporary heirs of<br />\nAt the Washington Monument<br />\n23 S. HANOVER ST.<br />\n2. Blue Bird (several).<br />\nenough varsity equipment for their,<br />\nBaltimore, Md.<br />\n3. Robin (several).<br />\nannual struggle with the Frosh.<br />\nOscar Thomas Olson, D.D.<br />\n4. Junco (snowbird).<br />\nWorkouts will necessarily be light,<br />\nMinister<br />\n5. Field Sparrow.<br />\nand without the usual scrimmage,<br />\nSHIRTS<br />\nNECKWEAR<br />\n6. Tree Sparrow.<br />\nthe second year men will probably<br />\nHopkins Students Are Invited to<br />\n7. Song Sparrow.<br />\nresort to the development of the<br />\nMake This Their Church Home<br />\n8. White Throated Sparrow. open style of play.<br />\n421 N. HOWARD ST.<br />\n9. White Breasted Nuthatch.<br />\nThe purpose and program of this<br />\nHOSIERY<br />\nGLOVES<br />\n10. Myrtle Warblers (many).<br />\nChurch will appeal to you. Look in<br />\n11. Crow (1).<br />\non the Sunday afternoon -At Home\"<br />\n12. Mocking Bird (1).<br />\nThe Flag, Banner &amp; Pennant Shop<br />\nfrom five to seven.<br />\n13. Downy Woodpecker (1').<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nSunday morning worship at 1 I o'clock.<br />\n14. Goldfinch (several).<br />\nEmblems, Silk Banners for Schools,<br />\n15.<br />\nCardinal.<br />\nSocieties and Fraternities<br />\nSunday evening service at 8 o'clock.<br /><br />\nHM-0112 01115<br /><br />\nRemington<br />\nPortable<br /><br />\nThe St. REGIS<br />\nRESTAURANT<br /><br />\nHYNSON, WESTCOTT and DUNNING<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br /><br />\nLeFranc &amp; Ault<br /><br />\n302 PARK AVE., BALTIMORE, MD<br />\nVernon 2355<br />\nR. H. Taylor<br /><br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\nURNER BROTHERS<br />\nI I I E. BALTIMORE STREET<br />\nBaltimore<br /><br />\nMusic bv vested chorus—choir of soloists.<br /><br />\nBeat<br />\nSt John's<br /><br />\n\"At the heart of the City\"<br /><br />\nALL SEATS FREE<br /><br />\nRENT A CAR<br />\nPrinters of<br /><br />\nThe Johns Hopkins<br />\nNEWS-LETTER<br /><br />\nCollege Literature<br /><br />\nDRIVE IT YOURSELF!<br />\nALL NEW, CLEAN CARS<br />\nFORDS, 12c PER MILE—DODGES OR HUPS, 18c PER MILE<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br /><br />\nDRIVE IT YOURSELF CO.<br />\n1725 N. CHARLES ST.<br /><br />\nLOM BARD<br /><br />\nand<br /><br />\nSOUTH STREETS<br /><br />\nVERNON 4049<br /><br />\nONE BLOCK SOUTH OF NORTH AVE.<br /><br />"}], "field_media_file": [{"target_id": 37785, "display": null, "description": null, "target_type": "file", "target_uuid": "9d3ae6f6-ce93-4eb2-b402-fec0e439f9c6", "url": "http://digital.library.jhu.edu/system/files/2022-03/13082-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13082, "target_type": "node", "target_uuid": "e23f9620-da86-438c-8234-74e35dadcb0b", "url": "/node/13082"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "59758e7e-84a0-4257-a310-375d936deff5"}]}