{"mid": [{"value": 38025}], "uuid": [{"value": "ce0b1a73-5b4a-4705-855b-f88afb8a76d5"}], "vid": [{"value": 38025}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:45:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12593-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:45:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:45:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Member Of The<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nau* iqopititts Nails-Erna<br />\nHOME WOOD, BALTIMORE, MD., TUESDAY, MARCH 5, 1935.<br />\n<br />\nVol. XXXIX—No. 32.<br />\n<br />\nJuniors Secure<br />\nHal Kemp Band<br />\nFor June Dance<br />\nClass Votes Unanimously For<br />\nNationally Known Group<br />\nTo Play At Social Function<br />\n<br />\nTentative Price $4<br />\nJuniors Who Have Paid Class<br />\nDues Will Be Admitted For<br />\n$3.00, Says Brian Murphy<br />\n<br />\n\"Uncle Vanya\" To Be<br />\nGiven Tonight At 8.30<br />\nThe Johns Hopkins University<br />\nPlayshop will present Uncle Vanya, the great Chekhov play which<br />\nis the second major production of<br />\nthe current year, tonight at 8.30<br />\nPerformances<br />\nin the Playshop.<br />\nwill be given every night this week<br />\nincluding Saturday.<br />\nIncluded in the cast are David<br />\nKurland, Meyer Site, S. Vannort<br />\nChapman, Tom Pinkerton, Jr.,<br />\nPatty Singerwood, Mary Alvey,<br />\nand Helen Ascherfeld. The production has been coached by Dr. N.<br />\nBryllion Fagin.<br />\nTickets for the play may be obtained at the reserve desk in the<br />\nmain library. Admission is seventy-five cents.<br />\n<br />\nCincinnati U.<br />\nFirst Foe Of<br />\nDebating Team<br />\nGarfunkel, Grossman, Willen<br />\nWill Represent Hopkins In<br />\nDebate Next Thursday<br />\n<br />\nPlan Southern Trip<br />\nWill Debate Five Teams Beginning March 25; North<br />\nCarolina First Contestant<br />\n<br />\nChairman Names Seven To<br />\nFreshman Banquet Group<br />\nStanley M. Finkel, Henry Gambill, Jackson Kaufman, Howard<br />\nLinkoff, Sanford Rothstein, Seymour Romanofsky, and John Royster have been appointed to the<br />\nFreshman Banquet Committee, it<br />\nwas announced today.<br />\nThe committee will meet tomorrow in Levering Hall at 12.20 to<br />\ndiscuss further plans for the banquet, which will probably be held<br />\nsometime in April. It is necessary<br />\nthat the entire committee be present at the meeting.<br />\nIn the future various sub-committees will be appointed to assist<br />\nin the arrangement of the program, according to William B.<br />\nKempton, chairman of the committee.<br />\n<br />\nSUPPORT SPORT<br />\n\"GYMBOREE\" AT GYM<br />\nTHURSDAY NIGHT<br />\nTwenty-fire Cents<br />\nPrice, 5 Cents<br />\n<br />\nStudents Plan Sports Gymboree<br />\nThursday Evening To Procure<br />\nFund For Football Sweaters<br />\n0. D. K. And A. A. Board<br />\nSponsor Program; Tickets<br />\n$.25 Prior To Affair<br />\n<br />\nCage Tilt Features<br />\nVarsity To Meet B. A. C.<br />\nFive; Card Also Lists Boxing, Wrestling, Tumbling<br />\n<br />\nBy STANLEY E. BLITM13ERG<br />\nProceeding on the theory that the<br />\nbest method of attacking an apparently unsolvable problem is to solicit<br />\nwidespread interest and support,<br />\nrepresentative student groups of the<br />\nUniversity have laid plans for a Hopkins \"gymboree\" to be held this<br />\nThursday evening at the Homewood<br />\ngymnasium.<br />\n•<br />\nThe problem referred to resides in<br />\nNumber Represents 27 Per<br />\nthe failure of the Athletic AssociaAll Additional Tickets For<br />\n—Courtesy Sunpapers<br />\nCent Of Titles In Print;<br />\nAccording to John Murphy, chairDONALDSON KELLY<br />\ntion to provide for varsity \"H\" footClub Concert, March 15, Donaldson Kelly, former stellar ball sweaters in its 1934-35 budget.<br />\nman of the Prom committee, this is<br />\nCatalogue Lists 238 Titles<br />\nthe first time in recent years that the<br />\nTo Cost 75c And $1. athlete of the Johns Hopkins Univer- After considerable verbal and editoJunior Prom has been a purely junsity, will be on the basketball team rial discussion had resulted in much<br />\nIssuing a mimeographed catalogue<br />\nior function. The dance will be held which contained the titles of 238<br />\nStudent activities cards will entitle of the Baltimore Athletic Club when bitter feelings but exactly no progduring June Week, but the plans and books, the Johns Hopkins Press set<br />\nstudents to one-dollar seats at the they clash with the Varsity in the ress, members of Omicron Delta Kapbacking are entirely junior. Murphy forth to the public the total number<br />\nto be held to provide pa and the Athletic Board hit upon<br />\nAnnual Home Concert of the Hop- \"gymboree\"<br />\nsaid:<br />\nsweaters and \"Hs\" for the Varsity the idea of a Hopkins athletic carniof works it had printed during the<br />\nkins Musical Club to be held at the<br />\nval in which students might particiteam members.<br />\n\"We have made elaborate prepara- presidency of Dr. Ames.<br />\nMaryland Casualty Clubhouse, March<br />\npate both as spectators and performThis number represents about 27<br />\nrations for this dance. It is the prop15. Additional seats may be obtained<br />\ners. The entire proceeds would then<br />\nerty of the junior class alone, and we per cent of all titles now in print,<br />\nbe employed in securing the necesfor seventy-five cents and one dolneed the support of every member of and 23 per cent of all works published<br />\nsary awards.<br />\nby the Press, including those now<br />\nthe class.\"<br />\nlar.<br />\nAdmission Charge Is $.25<br />\nKemp's band was chosen after a out of print and some which have<br />\nIt was pointed out by Harry Beck,<br />\nAdmission to the \"gymboree\", which<br />\npublishers.<br />\nbeen<br />\ntransferred<br />\nother<br />\nto<br />\nlively discussion at the meeting. The<br />\nbusiness manager of the organizais to swing into action at 8 p. m., has<br />\nThe catalogue was issued in connames of several other nationally<br />\ntion, that special seats for patrons<br />\nbeen set at twenty-five cents if tickwhich<br />\nnection<br />\nexhibit<br />\nwith<br />\nbook<br />\nthe<br />\nknown orchestras were introduced but<br />\nand patronesses are on sale for $1.50.<br />\nets are procured from the proper auwas presented as part of the Comthey were dismissed.<br />\nPresent plans call for the sale of<br />\nthorities before Thursday evening.<br />\nmemoration Day program. The Press<br />\nAlcazar To Be Scene<br />\ntickets to be opened next Monday in Dr. Walter Jones Succumbs Tickets purchased at the gate will<br />\nregrets that it was unable to keep<br />\nLevering Hall.<br />\nThe committee has announced that this exhibit open to the public.<br />\nAt Union Memorial Hos- cost thirty-five cents.<br />\nthey are renting the whole of the AlIn addition to 0. D. K. and the<br />\nDance Features Al Mason<br />\nVolume Of Essays Printed<br />\nEmeritus<br />\nProfessor<br />\npital;<br />\ncazar for the affair which will conA.<br />\nA. Board, members of the NEWSJohns<br />\nHopDuring February, the<br />\nBeck Announced that Al Mason<br />\ntinue from 10 till 3. The admission kins Press published Essays on the<br />\nLETTER staff and representatives of<br />\nand his orchestra would be featured<br />\nDr. Walter Jones, professor emerprice tentatively, which is subject to Law and Practice of Governmental<br />\nat the dance following the concert. itus of physiological chemistry at the other campus organizations will asdollars,<br />\nbut<br />\nchange, will be four<br />\nthose Administration: A Volume in Honor<br />\nAdmission to the affair, which also Johns Hopkins University since 1927, sist in the selling of tickets.<br />\nmembers of the junior class who have of Frank Johnson Goodnow.<br />\nIn the feature engagement of the<br />\nThe<br />\nwill be held in the Maryland Casual- died last Saturday night at the Unpayed their dues will be admitted nine essays were contributed by his<br />\nevening<br />\nthe Blue Jay quintet will<br />\nty Clubhouse, will be $1 per couple.<br />\nion Memorial Hospital. He had been<br />\nfor three dollars. The dues may still students in \"grateful acknowledgestack up against Dutch Lentz's BalThis year the Musical Club is cele- ill about a week.<br />\nbe paid.<br />\ntimore Athletic Club, now engaged<br />\n(Continued on Page 3, Col. 6)<br />\nbrating its fifty-first year on the HopBorn in Baltimore in 1865, he was<br />\nAfter the general discussion, the<br />\nkins campus. Since its first season, the son of the late Levin and Zeanette in a play-off series for the championdance committee, which includes bewhen Woodrow Wilson, Albert Shaw, Jones. He received his A.B. degree ship of the Baltimore • Basketball<br />\nPhilosophy Class<br />\nsides Murphy, the chairman, Zenas<br />\nCharles H. Levermore, and Arthur from Johns Hopkins in 1888 and a League. The Clubmen's appearance<br />\nshould prove doubly attractive, inasSears, Jerry Bloom, Charles Rostov,<br />\nSponsors Debate Series<br />\nYoger were members of the original Ph.D. degree three years later.<br />\nReuben Pasarew, Vernon Kelly, WilIn conjunction with their work in<br />\nmuch as their roster includes Don<br />\n(Continued on Page 3, Col. 5)<br />\nMarried In 1891<br />\nliam Bourne, and Thomas Callahan,<br />\nKelly and Jack Taylor of Hopkins, in<br />\nlogic and scientific method the philHe married Miss Grace C. Clarke<br />\nDr. Silver Will Speak To Group On<br />\naddition to numerous graduates of<br />\nosophy class of Dr. A. E. Blumberg<br />\nheld a meeting to discuss the plans<br />\nin September, 1891, and is survived<br />\nMarch 18 on Unannounced<br />\nfor the dance more fully..<br />\nother Maryland colleges.<br />\nwill conduct a series of debates durby her and a daughter, Mrs. Gilbert<br />\nSubject<br />\nJay Five Improved<br />\ning the term just begun. Each memA. Jarman, 224 East University<br />\nDr. Abba Hillel Silver, one of AmerThe<br />\nber of the class will take part in the<br />\nlocal<br />\nfive is stepping out of itf<br />\nParkway. Also surviving are a brothica's leading rabbis, will speak on an<br />\nprogram as a debater and also as a<br />\nclass<br />\nsomewhat<br />\nin opposing the B. A<br />\nand<br />\ner, B. B. Jones, of Carrollton, Md.,<br />\nunannounced subject at the next<br />\njudge of the debates. The debates are Wife Of Brazilian Envoy Undergoes<br />\nC., but on the basis of recent per.<br />\nDenmead.<br />\nCarrie<br />\nMrs.<br />\nmeeting of the University Supper to give the members of the class acSerious Operation At Instiformances should render a good ac•<br />\nHe started his educational career<br />\nClub to be held at Levering Hall, tual practice in the application of retution Here<br />\ncount of itself. Against Maryland th(<br />\nat<br />\nprofessor<br />\nof<br />\nchemistry<br />\nin<br />\n1891<br />\nas<br />\nMarch 19, at 6.00 p. m.<br />\nflective thinking to argument.<br />\nJays displayed a polished game an(<br />\nWittenberg College, Springfield, Ohio,<br />\nDr. Silver was born in Schirwidt,<br />\nMrs. Delminda Aranha, wife of Dr.<br />\nIn order that the class may have an<br />\nconvinced the fans that they hav(3<br />\none<br />\nyear.<br />\nhe<br />\nremained<br />\nfor<br />\nwhere<br />\nLithuania, 42 years ago. Coming to idea of debating technique, the varOswaldo Aranha, Ambassador to the From 1892 to 1895, he was professor finally overcome the \"new gym jinx'<br />\nAmerica early in his life, he was ed- sity Debating Council, under the diwhich seems to have stalked thet<br />\nUrge Closer Cooperation ucated at the University of Cincinnati rection of Abner Willen, will appear United States from Brazil, underwent of analytical chemistry at Purdue footsteps<br />\nthis season. Siegel and Ra<br />\nUniversity.<br />\nan<br />\noperation<br />\nat<br />\nJohns Hopkins HosAmong Profession And and the Hebrew Union College, from before the class tomorrow and will<br />\nsin<br />\nproved<br />\nparticularly effectiv(<br />\nReturning to his alma mater in<br />\nwhich he was graduated in 1915. In<br />\nthe question, \"Resolved, That pital last Thursday. Dr. Aranha anagainst the Terps.<br />\n1895, as an assistant professor, he<br />\nDropping Of Prejudices' 1925, he received his D.D. degree from 'debate<br />\nthe nations of the world shall agree nounced that he would remain in<br />\nPrior to the cage encounter there<br />\nbecame professor of physiological<br />\nthe Hebrew Union, and :three years to prohibit the international shipment<br />\nBaltimore for several days while his chemistry in 1908, holding that post will be a series of boxing and wrest<br />\nCloser cooperation among surgeons, later a Litt. D. degree from Western<br />\nof arms and munitions.\" The first de- wife was<br />\nling matches. Casey Kasselbraner and<br />\nrecuperating.<br />\nuntil eight years ago.<br />\nradiologists, and pathologists and Reserve College.<br />\nbate in the series to be presented by<br />\nHarold Glasser will get together in<br />\nListed<br />\nHis Membership<br />\nMrs. Aranha entered the Hopkins<br />\nabandonment of \"professional prejuServed In France<br />\nthe class will be held the following<br />\n(Continued on Page 3, Col. 2)<br />\nHe was a member of the American<br />\ndices\" with a view to conquering canHospital ,Friday morning and reDuring the World War, he served Wednesday.<br />\ncer was urged at a meeting of the in France, and was decorated by the<br />\nmained under observation until the Physiological Society; the National<br />\nradiological section of the Baltimore French Government.<br />\noperation, which was performed Academy of Sciences; American So- Dr. McPhedranTo Deliver<br />\nSpeak<br />\nTo<br />\nIsrael<br />\nLovejoy,<br />\nCity Medical Society and other units<br />\nshortly<br />\nbefore noon by Dr. William ciety of Biological Chemists, of which Fifth Delamar Lecture<br />\nDr. Silver, a member of the ZionOf the organization held last Friday ist Organization of America and the<br />\nDr. Arthur 0. Lovejoy, professor F. Rienhoff, Jr., associate in surgery he was formerly president, and the<br />\nAmerican Association for the Ad- Will Speak March 19<br />\nevening in Osler Hall of the School of Jewish Agency for Palestine, served of philosophy, and Dr. Edward L. Is- at the Hospital.<br />\nOn Tuberculosis<br />\nDr. Aranha, former Minister of Fi- vancement of Science.<br />\nMedicine of the Johns Hopkins Univ- on President Hoover's Unemploy- rael, of the Har Sinai Temple, will<br />\nAnd Public Health<br />\nArticles written by him on subjects<br />\nersity.<br />\nEconomics<br />\nment Commission.<br />\nOther organiza- speak at the first organization meet- nance of Brazil, • succeeded Rinaldo<br />\nphysiological chemistry have apin<br />\nas<br />\nto<br />\nthe<br />\nSilva<br />\nambassador<br />\nLima<br />\nE.<br />\nTwo Read Papers<br />\ntions of which he is a member are ing of a Hopkins branch of the Amerappeared in various American and<br />\nDr. F. Maurice McPhedran, M. D.<br />\nIn the audience were leaders of the the American League for the De- ican League Against War and Fas- United States in March, 1934. Mrs.<br />\nGerman technical publications.<br />\nsince<br />\ncountry<br />\nbeen<br />\nin<br />\nthis<br />\nhas<br />\nassistant professor at the Henry<br />\nnledical profession in Maryland, in- fense of Jewish Rights, the Central cism, in Levering Hall Friday, at 4 Aranha<br />\nHis home in Baltimore was at the<br />\nSeptember.<br />\ncluding internationally famous mem- Conference of American Rabbis and o'clock.<br />\nPhipps Institute of the University of<br />\nHopkins Apartments. Funeral servbers of the Johns Hopkins Medical the National World Court Commis<br />\nPennsylvania will deliver the fifth<br />\nices were held Monday afternoon.<br />\nDelamar Lecture of the year on<br />\neliool faculty, the University of sion.<br />\nMarch 19. The last lecture of the serkaryland Medical School and specialRabbi Silver lives with his wife and<br />\nU. of Chicago Professor ies will be given early in April by Dr<br />\nists in many lines.<br />\nthree children in Cleveland, Ohio,<br />\nThe papers that were discussed lat- where he is in charge of The Temple.<br />\nTo Give Dohme Lecture Richard E. Scammon of the Univer<br />\nsity of Minnesota.<br />\ner were read by Dr. Arthur C. ChristDr. McPhedran will lecture of the<br />\nle, of Washington, the next president Dr. Sigerist Plans To Talk<br />\nDr. Morris S. Kharasch, associate<br />\ndrawer and the desk and it opens<br />\nprofessor of organic chemistry at the pathogenesis of tuberculosis in relac't the International Institute of RadiDr. S. S. Jenkins, who teaches the right up.\"<br />\nTo4FriendsOfTheLibrary' 8.30 Organic chemistry class, is a<br />\nUniversity of Chicago, has been se- tion to its public health economics.<br />\nII<br />\n°logy, and Dr. Frank E. Adair, a<br />\nThe Delmar lectures are supported<br />\nHoward Reizenstein, who is well lected to deliver the Dohme lecture<br />\ngraduate of the Johns Hopkins MedDr. M. H. Siegerist, William H. great believer in the perfectability of<br />\nby<br />\na fund bequeathed to the Johns<br />\nMitchin<br />\nchemistry<br />\nat<br />\nthe<br />\nUniversity,<br />\non<br />\nat<br />\nDr.<br />\nspectators<br />\nteal School in 1915 and now surgeon- Welch professor of history of med- human nature.<br />\nknown to the<br />\nHopkins University School of MediIn-chief at the Memorial Hospital in icine and director of the Institute of<br />\nThe other day he was commenting ell's three-ring circus presented at March 15.<br />\nDr. Kharasch was associate profes- cine by Joseph R. Delamar. They are<br />\n1\\Tew York city. They were introduced the History of Medicine, will address on the disappearance of apparatus 8.30 behind closed doors every Monby Dr. Waters.<br />\nsor<br />\nof organic chemistry at the Uni- a series of lectures in personal and<br />\nTuesday,<br />\nand<br />\nWednesday,<br />\nonce<br />\nday,<br />\nlaboratory,<br />\nand<br />\nanfrom<br />\ndesks<br />\nin<br />\nthe<br />\na meeting of the Friends of the LiTake Part In Discussion<br />\nbrary to be held this Friday at the nounced that the locks would be sup- again stole the show from the jovial versity of Maryland from 1922 to public hygiene with the object of<br />\n1924. He later did work on toxic gas bringing before the public at large<br />\nplied to those students who wanted master of ceremonies.<br />\nThose who took part in the dis- Welch Medical Library.<br />\nLast Wednesday \"Doc\" Reizenstein at the Hopkins and the Edgewood facts and points of view on modern<br />\ncussion were:<br />\nDr. Sigerists's topic will be \"Leon- them.<br />\nhygiene.<br />\nter. J. M. T. Finney, Sr., professor ardo Da Vinci's Notebook.\"<br />\n\"I am sure that this is the best arrived late for the performance, but Arsenal.<br />\nDuring<br />\nCoolidge's<br />\nadministration<br />\nin<br />\nThe Delamar bequest also supports<br />\nhumor<br />\nand<br />\nMitchell<br />\nwas<br />\nin<br />\na<br />\ngood<br />\nDr.<br />\n\"beJenkins<br />\ncontinued,<br />\ncourse,\"<br />\nDr.<br />\nMiss Mary Goodwillie, who was reemeritus of surgery, Johns Hopelected president at the meeting held cause it is so easy to break into the allowed him to enter. After the delin- 1926 Dr. Kharasch was appointed to the \"American Journal of Hygiene'<br />\nkins Medical School.<br />\nbr. Joseph Colt Bloodgood, adjunct at the Walters Art Gallery, will pre- desks. All that you have to do is to quent had seated himself, Dr. Mitch- the Chemical Warfare Service by the published under the auspices of the<br />\nSecretary of War.<br />\nSchool of Hygiene and Public Health.<br />\n(Continued on Page 3, Col. 3)<br />\ninsert a screw-driver between the<br />\n(Continued on Patin<br />\nCol_ 11i side.<br />\n<br />\nAt a meeting held in Latrobe Hall<br />\nat 12.20 yesterday the Junior Class<br />\nvoted unanimously to have Hal<br />\nKemp's orchestra to play for the annual Junior Prom to be held at the<br />\nAlcazar Ballroom on June 4 in conjunction with the June Week festivities . The contracts were ready and<br />\nsigned by the committee after the<br />\nclass voiced its decision.<br />\nJunior Affair, Says Murphy<br />\n<br />\nPress Announces<br />\nWorks Printed In<br />\nRegime0fDr.Ames<br />\n<br />\nThe debating team will debate with<br />\nthe University of Cincinnati next<br />\nThursday in room 205, Gilman Hall,<br />\nit was announced last week by Abner<br />\nWillen, president of the Debating<br />\nCouncil.<br />\nThe Hopkins team will uphold the<br />\naffirmative tide of the question \"Resolved, That the nations of the world<br />\nshall agree to prohibit the international shipment of arms and munitions.\" This question was debated<br />\nseveral weeks ago by members of<br />\nthe Debating Council.<br />\nThose who will argue for the affirmative are Sylvan Garfunkel, Philip<br />\nGrossman and Abner Willen.<br />\nThe annual southern trip taken by<br />\nthe team will begin March 25, the<br />\nfirst debate being with the University<br />\nof North Carolina. The team will<br />\nthen go to Emory College, Oglethorpe<br />\nUniversity, and the University I of<br />\nGeorgia. The trip will end about<br />\nApril 1 with a debate against the<br />\nUniversity of South Carolina.<br />\nThe northern trip will be taken<br />\nabout the same time with two debates<br />\nalmost assured. Temple, University<br />\nand LaSalle University will pit teams<br />\nagainst the Hopkins debaters. Those<br />\nwho will make this trip are James<br />\nMorrow, Phillip Grossman, Neal Potter, and Paul Zucker. Abner Willen<br />\nand Sylvan Garfunkel will represent<br />\nthe Hopkins on the southern trip.<br />\nThe debating team engaged Mt. St.<br />\nMary's last night at Emittsburg.<br />\nThose who debated for the University<br />\nteam were Paul Umbarger, Phillip<br />\nGrossman, Paul Zucker, and James<br />\nMorrow.<br />\n<br />\nS.A.C.CardsProvide<br />\n$1 Seats At Musical<br />\nClub Performance<br />\n<br />\nSchool Of Medicine<br />\nProfessor Dies Here<br />\nAfter Short Illness<br />\n<br />\nRabbiSilverPlansTo<br />\nAddress SupperClub<br />\n<br />\nMedical Savants<br />\nHold Symposium<br />\nOn Cure Of Cancer<br />\n<br />\nAmbassador's Wife<br />\nAt Hopkins Hospital<br />\n<br />\nIn Which Life On The Campus<br />\nBreaks its Measured Tread<br />\n<br />\n\fHOME WOOD, BALTIMORE, MD., MARCH 5, 1935.<br />\n<br />\n2<br />\n<br />\nstick teams have been noted primarthelRevosAztter ily<br />\nfor the smoothness of the attack,<br />\nFOUND= 1897<br />\n<br />\nSubscription per<br />\nBy Mail<br />\n<br />\n-$2.50<br />\n<br />\nmaking it only fitting that the man<br />\nwho has been responsible for much<br />\nof this success should now be placed<br />\nat the helm.<br />\n<br />\nKels finds himself at the start of a<br />\nRemit subscription fees to Treasurer, Student Activities Council, Rem- season faced with the loss of Henny<br />\nsen Hall, Postoffice, Johns Hopkins Beeler, George Packard, Don Kelly,<br />\nUniversity.<br />\nMillard Lang, Church Yearley, and<br />\nDeReynolds. ,Pete, captain-elect of<br />\nmatter<br />\nPete<br />\nsecond-class<br />\nEntered as<br />\ncember 3, 1909, at the Postoffice in the team, withdrew from the UniverBaltimore, Md., under the Act of Con- sity at the end of the first semester.<br />\ngress, November 3, 1879.<br />\nThis was a blow to Kels, who expectPublished semi-weekly from Octo- ed to build the defense around him<br />\nber to June, except during examina- this year.<br />\ntion and college holiday periods by<br />\nThe biggest disappointment, of<br />\nundergraduates of the Johns Hopkins<br />\ncourse, is the exclusive schedule. The<br />\nUniversity.<br />\nnew coach would like to see more<br />\ngames on it. Twelve wouldn't be too<br />\nEDITORIAL DEPARTMENT<br />\nStanley E. Blumberg.....Editor-in-CMS/ many.<br />\nMelvin Goldberg _Managing Editor<br />\nBut Kels is far from crying over<br />\nJesse Borden, Neal Potter,<br />\nhis first term as head coach. \"Team<br />\nAssistant Managing Editors work,\" he says, \"will be what will<br />\nSports Editor carry us through.\" He has prospects<br />\nLeonard Wallenstein<br />\nIrving Leberfe.15.<br />\nof annexing a fourth consecutive colExchange and Filing Editor<br />\nHyman M. Levin_Contributing Editor legiate title to the Jay string. And<br />\nFeature Editor in 1936 there is little doubt but that<br />\nEdgar Kemler<br />\nColumnist the sophomores on this year's team<br />\nHarold M. Kropman.<br />\nReporters<br />\nwill come through with one of the<br />\nJohn C. Brashears, Stanley M. Finkel,<br />\nBenjamin Futernick, Jewett Gold- finest aggregations to represent the<br />\nsmith, Leon Jacobson, William University.<br />\nKempton, Kenneth Zierler, Marvin<br />\nKolker, Hershner Cross, Jacob<br />\nStein, William Snyder, Howard<br />\nReizenstein, Jonas Cohen, Leonard<br />\nSpringtime Blues<br />\nJaffe, Lester H. Caplan, Bernard<br />\nHe<br />\nremarks<br />\nto his friend that spring<br />\nDiaWilliam<br />\nAdler,<br />\nPinck, Julian<br />\ncertainly must be here. Just look at<br />\nmond.<br />\nthe clear sky, and did he see the neat<br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager shoes that that girl who just passed<br />\nRay Goldberg<br />\nAdvertising Manager by was wearing? What class is next<br />\nBert Gordon_<br />\nOffice Manager on their schedule? French? Didn't<br />\nCharles Hastings<br />\nCirculation Manager<br />\nDavid Levy<br />\nhe think that French always was<br />\nboring? And besides he had already<br />\nTuesday, March 5, 1935..<br />\nread the assignment and knew what<br />\nthe lecture was going to be about.<br />\nFrat Failings<br />\nNot only that, it was so hard to doze<br />\nAnnouncement of the Annual In- off in those straight wooden chairs.<br />\nWhat if Dr. Mitchell said that evterfraternity Ball, to be held in April,<br />\nery<br />\nlecture represented a dollar of<br />\nis<br />\nstill<br />\nthere<br />\nthat<br />\nminds<br />\nour<br />\nrecalls to<br />\nan Interfraternity Board, after all. tuition? After all, the value of money<br />\nIts long silence after an apparent has decreased, and any way when<br />\ncollapse in the enforcement of the that guy lectured, you only got a barushing \"agreement\" made us wonder loney dollar's worth. And talking<br />\nif it hadn't died completely. The fra- about money, reminds him that he<br />\nternities certainly left it pretty cold. has to gather some of the _ good old<br />\nReasons given by the frats last year \"jack\" and give himself a boost with<br />\nfor the agreement on second-term the automobile dealer's daughter who<br />\nrushing seemed quite reasonable. No can't be taken for a ride. And he<br />\none could expect a naive freshman to had heard that although that Gouchoose his \"brothers for life\" without 'cher dame lived in Foster Hall, you<br />\na few months with them as well as couldn't play poppas with them.<br />\nthe University at large. The text of What? He had to hurry up or he'd be<br />\nthe agreement, together with the ex- late for French lecture? Oh well,<br />\ncuses given for its violation made it some day he'd be a senior and<br />\nseem More and more ridiculous, how- then . . .<br />\nJ. N. B.<br />\never. A set of rules, long and complex, defining \"rushing\" in all possible phases in a meticulous and rather arbitrary manner made the uninitiated chuckle at elaboratiness and<br />\nThe rights of man: When Presi\"red tape\" carried to the last degree. When this was combined with dent Dougherty refused to allow men<br />\nviolations in which the offenders and women students to sit together<br />\npleaded misunderstanding of the<br />\nat athletic contests of the Appalaagreement, it became evident that the<br />\nfrat organization vas threatened with chian State Teachers' College, Boone,<br />\na breakdown from lack of any inten- N. C., a strike was declared. The<br />\ntion on the part of some groups to strikers also demanded that men be<br />\nstick by the agreement.<br />\nallowed to date co-eds two nights a<br />\nThis year, a setting up of the date week.<br />\nto early November was arranged. Yet<br />\n0-0<br />\nthis concession to the impatience of<br />\nthe fraters brought with it a complete<br />\nUpperclassmen were requested to<br />\ndisregard for most of the rules from<br />\noffer suggestions for an introductory<br />\nnearly all sides. And nothing was<br />\ndone about it. One might have said course in social science to be given<br />\nthat here was the demise of the In- to the freshmen next year at the<br />\nterfraternity Board. But there is still Florida State College for Women.<br />\nthe social side: the fraternities can<br />\n0--0<br />\nstill hold dances, sports tournaments,<br />\nwithout<br />\nanyand smokers together,<br />\nOnly five percent of the students<br />\nbody's doing anything wrong.<br />\nentering college in the United States<br />\nThe fact of the matter seems to be do so by passing entrance examinathat the fraternities are too Machiations. The rest are admitted on cervellian in their interest and policies<br />\nto do anything for the common good, tificates -from high schools.<br />\n<br />\nIntercollegiates<br />\n<br />\neither their own or the University's,<br />\nwhen it conflicts with what the individual fraternity chooses to do, regardless of any agreements. When it<br />\ncomes to getting ahead of the fellows next to them, those of the brotherhood jump at chances as they present themselves, and wink right merrily at government.<br />\nThis failing on the part of the fraternities can not well be laid at the<br />\ndoor of any particular evil influence<br />\nof fraternities as such, we may suppose. Rather does it show itself as<br />\nmerely one manifestation of a more<br />\ndeeply rooted and serious trouble<br />\nwhich seems to have overspread the<br />\nwhole campus—an extreme social and<br />\npolitical apathy. This marked tendency of recent months is undoubtedly the factor in making the campus<br />\nother than what the students think<br />\nN. P.<br />\nit ought to be.<br />\n<br />\nNew Coach<br />\nThe appointment of William Kelso<br />\nMorrill as head lacrosse coach came<br />\nas a surprise to no one. The system<br />\nof co-coaching that was originally announced would undoubtedly have been<br />\na flop. A head coach was needed and<br />\nDr. Morrill was the logical man.<br />\nIt must be admitted that Hopkins<br />\n<br />\nOur Own Pepys<br />\nFebruary 26—<br />\nUp and amused by Mr. Edward<br />\nReilly's remarks at a meeting to<br />\nraise funds for the appeal of the case<br />\nof Bruno Hauptman.<br />\n\"I defy anyone to prove that Hauptman was even in New Jersey the<br />\nnight of the kidnapping,\" said Reilly.<br />\nThis I cannot help but feel to be a<br />\ntrifle anti-climactic, the point in question having been for all practical<br />\npurposes very effectively demonstrated some few weeks back.<br />\nSo away to the University for a<br />\nlittle, where I met with Paul who<br />\ntold me that he was no longer in<br />\nlove, that his ideals had been shattered, that his faith in human nature<br />\nwas now a negative quantity, but<br />\nthat the affair with all had been a<br />\nvery •broadening experience. It was<br />\nwith the greatest of difficulty'that I<br />\nexplained my uncontrolable mirth at<br />\nhis remarks, my own faith in human<br />\nnature, etc., having been at a very<br />\nlow ebb for some time past.<br />\nI to the library for some reading<br />\nin the mechanistic and vitalistic approaches to biological phenomena<br />\n(which topic is obviously introduced<br />\ninto these pages to show the extent<br />\nand magnitude of my learning).<br />\nReading is to serve as the basis for a<br />\ndebate on the subject. I am utterly<br />\ndeficient in biological knowledge, but<br />\nas my fellow debater, W. D., has been<br />\nassured by a most eminent professor<br />\nof the subject, that this is an asset<br />\nand not a debit, I shall not let it<br />\ntrouble me.<br />\nInterrupted by Leon bearing proudly two front pages of the American<br />\nWeekly of some time back which, he<br />\nexplained, were the gift of a learned<br />\narchaeologist. I found the association<br />\nof archaelogy with Mr. Heart's journal somewhat incongrous, but did not<br />\nmention my feeling to Leon for fear<br />\nof offending him.<br />\nSo home, and to bed early to escape the talk of a friend of the family. He is the °illy man of my acquaintance in the State who can carry on<br />\nan involved conversation by himself<br />\nwith ease. His remarks are invariably limited to the war (which he<br />\nfought from a chair in his club), the<br />\n\"Yellow Peril\" (which he sees<br />\nthrough the eyes of the equally yellow journals), and the decay of our<br />\nyouth on which I am inclined to believe he has no information at all,<br />\nhaving been born in his present senility.<br />\n<br />\nNEWSETTES<br />\n<br />\ncDEAF'DUMB AND 'BLIN'D<br />\n<br />\n\"KATIE, THE KITZBUEHEL COQUETTE\"—The return of the Prince<br />\nof Wales to England after a vacation<br />\nabroad was the occasion for the introduction of many new songs<br />\nthroughout Britain. It so happened<br />\nthat the heir to the British throne<br />\nhad spent his holiday in Austria, Germany, Hungary, and France, particularly at Kitzbuehel.<br />\n<br />\nBy HAROLD M. KROPMAN<br />\n<br />\nOne song in particular \"I'm Katie,<br />\nthe Kitzbuehel Coquette\" bids fair to<br />\nbecome one of Britain's most popular<br />\nsongs, though not meant to reflect on<br />\nEngland's fair sex.<br />\nHARVARD vs. YALE—A good sized<br />\nriot was almost started at the NBC<br />\nstudios last Thursday afternoon when<br />\nan announcer stepped into a room in<br />\nwhich the Yale Glee Club was rehearsing for the Rudy Vallee program and naively inquired:<br />\n\"Pardon me, but is this the Harvard Glee Club?\"<br />\n<br />\nAi ound Town-The Penthouse is offering two of<br />\nthe best acts to play in Baltimore<br />\nthis season. Shirley Dall, lately of<br />\nThe Vanities, is more than shaded by<br />\nthe Roddy Twins, and Budd and Eleanor Coll are sensational. If you prefer your pleasure in a cosmopolitan<br />\natmosphere, allow Lou Becker to be<br />\nyour host.<br />\nUp in New York a police order<br />\nprohibits the appearance of Fags (female impersonators).<br />\nThis recent<br />\nruling hit Harry Richman, who had<br />\nand impersonator show and a female<br />\nband.<br />\n<br />\nIf you like room for your dancing,<br />\ncarry your own, and don't require<br />\nmuch musical inspiration, try the<br />\nSubway on West Lexington Street.<br />\nNo cover, minimum, liquor, or crowds.<br />\nPeanut Joe has reopened his attic,<br />\nand Billy Berle, the most beautiful<br />\nimpersonator in town, who incidentally has a wife and child, entertains<br />\nto the music of a three-man band.<br />\nFern and Lorraine, who played<br />\nseven weeks at the Hi-Hat earlier<br />\nthis season, have returned to town.<br />\nDuring their absence they have appeared at the Roosevelt Grill in New<br />\nYork, and on a Bermuda cruise ship.<br />\nThey are now at the Barn.<br />\nFebruary 27—<br />\nThe Variety Club continues its ImBusy with correspondence which personator show. Bert Sherry, forhas, curiously enough, managed to get merly at the Pansy Club, and five<br />\nitself into an elaborate state of dis- others, cavort to the tunes of five<br />\ngentlemen of color.<br />\nrepair.<br />\n<br />\nAt this time, when the Home Concert, and Dance are soon to be presented by the Musical Club, marking<br />\nthe end of a very successful season,<br />\nI think it is only just and proper to<br />\nsee exactly who has been responsible<br />\nfor all the terrible—hard work. There<br />\nis Carson Frailey, president, who<br />\nhates the noise of bombs and dice;<br />\nJohn Murphy, vice-president, who<br />\nthinks the most of wine, women, and<br />\nsong as evidenced by his behavior on<br />\nthe Atlantic City trip; Lou Reuling,<br />\njunior business manager, who leans<br />\ntoward crooning as an art and accomplishment; and Harry Beck, business manager, who always makes the<br />\nannouncements to the NEWS-LETTER.<br />\nPlease leave all decayed vegetable<br />\nmatter and aged eggs at house, when<br />\nyou attend the concert. Their shirt<br />\nfronts have gotten dirty enough after<br />\nabout fifteen concerts.<br />\n<br />\n\"Losht,\" he muttered sorrowfully,<br />\n\"losht in an impen'trable forest!\"<br />\nOhioan.<br />\no—o<br />\nA sweet young thing, whose parents<br />\ndepriving themselves of things so she<br />\ncould get a college education, was<br />\ntelling of some of her experiences.<br />\nS. Y. T.—In the evenings we usually have dates and go to some lonely<br />\nspot and neck. That ain't nice' but I<br />\nlike it.<br />\nDad—A whole year in college and<br />\nyou still say ain't.—Lyre.<br />\n<br />\nTo the tavern in the evening and<br />\nwas merry with friends who brought<br />\nwith them a very comely maid. Talked<br />\nfor a space and was mightily attracted by the maiden who had a pleasing<br />\nmanner which, if it were not that I<br />\nknow better, I would incline to call<br />\ndifferent. Drank overmuch of the<br />\nRhenish wine which is excellent at<br />\nthe inn, and, late, paid my reckoning and took coach for home but not<br />\nbefore asking maiden for permission<br />\nto call, which was granted.<br />\nTo bed late with a pleasant glow<br />\nsurrounding me.<br />\n<br />\nP. S.—I don't have time to shave<br />\nin the morning. What can I do?<br />\nFuzzy Wuzzy.<br />\no<br />\nDear Fuzzy Wuzzy:<br />\nTry some of our new soap wh4ch<br />\nMarriage is a wonderful institution<br />\nso permeates the inner skin that it<br />\n—no family should be without it.<br />\nmakes the whiskers grow inwards<br />\no—o<br />\nand then all you do is bite them offKid—You've got a lot of pep for<br />\n-Awgwan.<br />\nan old geezer. How do you get that<br />\n0-0<br />\nwity<br />\nOld Timer—I ain't decided yet. I'm Little Known Facts About The<br />\ndickering with two or three of them Campus:<br />\npatent medicine concerns.<br />\nSome of the chairs used in the Gilman Hall class-rooms 'rave been there<br />\n0-0<br />\nI see by our most honorable campus since the early nineteen hundreds.<br />\nrag (Editor, please note—raise ex- This fact is substantiated by the carvpected), that Lou Reuling, president ing of the date 1908 on the arm of a<br />\nof the Junior Class, is striving to be chair in the back row, in front of the<br />\nmentioned in my \"Men Of the Week\" window nearest the door, in room<br />\nsection for his untiring efforts for his 313. Most of the chairs are more wire<br />\nclass. His latest venture is his an- than wood, anyway.<br />\nnouncement that Casa Loma's orches- Suggested Improvements:<br />\ntra can be had for the voting for the<br />\nA traffic booth for Bob, the campus<br />\nJunior Prom. I was present at the cop, snooper, plain-clothes man, and<br />\nlong distance call to Glen Gray, and woman lover, in the circle in front of<br />\nI think that John Murphy (it is said Levering Hall. He could play with the<br />\nthat he is a student here) deserves stop and go signs, keep impatient,<br />\ncredit for the efficient manner in speeding students waiting, flirt with<br />\nwhich he prompted Lou during the the women drivers, and play pitch in<br />\nadventurous ordeal of talking to New his spare time.<br />\nYork. Well, juniors, since we are beMen of The Week:<br />\nhind Reuling 100 per cent, let's talk<br />\nThe Blue Jay Fives—Siegel, Siverd,<br />\nit up and make this affair one of the<br />\nmost outstanding, talked-about af- Chancellor, Woodrow, and Ran—<br />\nfairs given by Hopkins—and we won't for their mastery of this game called<br />\nbasketball as evidenced by their perneed scandal.<br />\nformance against Maryland.<br />\no—o<br />\nStaggering down the street in unNEWS FLASH—After much needcertain terms he finally bumped into<br />\na post, fell down, got up and bumped less worrying upon the part of many<br />\ninto it again. Trying a third time he students, from a fairly authoritative<br />\nproduced the same result and again sources comes the report that the<br />\nresumed his horizontal posture. He presidential secretarial force will be<br />\nsat on the curb and shook his head. retained intact.<br />\n<br />\nPlopped by<br />\n<br />\null Pooch?<br />\n<br />\ne741 Old Q0/1<br />\n<br />\nMarch 1—<br />\n<br />\nUneventful day spent almost entirely in bed with a foul taste in my<br />\nmouth and a general shakiness which<br />\nI am quite at a loss to account for,<br />\n0-0<br />\nbut which may perhaps have some<br />\nwith the festivities of the<br />\nassociation<br />\nAd in the Vermont Cynic: \"Would<br />\nevening before.<br />\nthe student who took the wooden<br />\nMarch 2—<br />\ndancing man from the Fleming MuTo the University, where I was preseum auditorium before Christmas<br />\nsented with a copy of Mr. Kemler's<br />\nplease return the same?\" Looks like journalistic debauch by a member of<br />\na case of kidnapping to us.<br />\nThere was<br />\nthe NEWS-LETTER staff.<br />\ndamnation of Mr.<br />\nand<br />\npraise<br />\nloud<br />\n0---0<br />\nKemler's somewhat radical depart\"It was at a luncheon at the Uni- ure from newspaper tradition, but<br />\nversity of Minnesota recently that a both praise and damnation had a<br />\ncertain pedagogue was endeavoring rather insincere ring. In truth, it<br />\nto explain /the differences between a would • appear to an uninitiate that<br />\nuniversity and an insane asylum. The Mr. Kemler had turned the journalprofessor maintained that one had to istic clock back rather than forward.<br />\nshow improvement to get out of an It seems to me that he has sworn a<br />\ninsane asylum.\"—Swarthmore Phoe- very solemn oath to prevent the poor<br />\npublic from finding out both what is<br />\nnix.<br />\ngoing on in his own mind and what<br />\n0-0<br />\nis going on generally.<br />\nAnd so with Edward in the afterAn English examination for freshmen at Loyola was the cause for the noon who lent me a very amusing and<br />\nstartling discovery 'that \"an inciner- slightly bawdy work by Ogden Nash<br />\nator is a person who hints nasty with which I beguiled the time for a<br />\nthings instead of coming right out space.<br />\nand telling you.\"<br />\nHome, where, family being gone, I<br />\nwas obliged to care for young broth0-0<br />\ner for the evening, which I did with<br />\nA poll of women students at Mur- very had grace. And, after stormy<br />\nray State Teachers' College revealed session with young brother on questhe fact that co-eds prefer the cave tion of the bed-hour, myself to bed.<br />\n—J. C. B.<br />\nman variety to any other.<br />\n<br />\nDr<br />\n<br />\nDi<br />\n<br />\n0-0<br />\n<br />\nDear Mrs. Nix:<br />\nMy stenographer yesterday asked<br />\nme if I belonged to the House of David.<br />\n<br />\nFebruary 28—<br />\nGreat joy we have this day, it being the last of the month and money1<br />\nfrom the government being in sight. I<br />\nIn truth I was so cheerful during the<br />\nmorning that many of my friends inquired about the state of my health.<br />\n<br />\n(C<br />\n<br />\n5P. Lorillard Co.. Inc.<br />\n<br />\nWhen the Girl Friend insists<br />\nthat you romp with Rollo before you have your<br />\ntete-a-tete with her... don't let the Bow Wow<br />\nbash your spirits. Brighten up by lightin' up an<br />\nOld Gold. Its sunny-smoothness makes even dogwalking endurable. Darn clever...these 0. Gs!<br />\n<br />\nAT TRYING TIMES ....TRY A STinof:./A, OLD GOLD<br />\n<br />\nCa<br />\nsell°<br />\ntime<br />\nfifty<br />\nhe<br />\nthe<br />\nlern.<br />\n\"I<br />\nsomi<br />\n<br />\nor<br />\n<br />\nhay(<br />\nthis<br />\n<br />\nque<br />\nanaN<br />\n<br />\nhay4<br />\n<br />\nfess<br />\nalso<br />\nhe<br />\ntive<br />\n<br />\nwer<br />\nfro:<br />\nto .<br />\nMs(<br />\nTub<br />\nsecc<br />\neas(<br />\nway<br />\n<br />\n.11<br />\ntub<br />\n<br />\nflirt<br />\nand<br />\nit<br />\n<br />\n\fHOME WOOD, BALTIMORE, MD., MARCH 5, 1935.<br />\n<br />\nOf Congress Has<br />\nMedical Savants Plan 'Gymboree To' Library<br />\nIntercollegiates<br />\nYear<br />\nUnder New Deal<br />\nBuy Team Sweaters Busy<br />\nHold Symposium<br />\nOn Cure Of Cancer<br />\nVarsity Basketball Team Will Meet<br />\nB.A.C. As Part Of Program<br />\nAt Gym<br />\n<br />\nUrge Closer Cooperation<br />\nAmong Profession And<br />\nDropping Of Prejudices'<br />\n(Continued from Page 1, Col. 1)<br />\nprofessor of surgery, Johns Hopkins.<br />\nDr. Harvey B. Stone, associate prolessor of surgery, Johns Hopkins.<br />\nDr. Arthur M. Shipley, professor of<br />\nsurgery at the University of<br />\nMaryland Medical School.<br />\nCalling himself \"a member of the<br />\nschool of the knife\" and \"an oldtimer,\" Dr. Finney referred to \"my<br />\nfifty years of surgery,\" and asserted<br />\nhe does not believe that surgery or<br />\nthe X-ray will solve the cancer problem.<br />\n\"I believe the solution will be in<br />\nsome chemical agent either injected<br />\nor applied,\" Dr. Finney said. \"We<br />\nhave only scratched the surface of<br />\nthis cancer question. There are many<br />\nquestion that have yet to be ananswered.<br />\nChristie Speaks<br />\nDr. Christie's theme was that there<br />\nhave been encouraging signs of an<br />\nimproved attitude of the medical profession toward radiation therapy. He<br />\nalso emphasized his conviction that<br />\nhe was highly doubtful of the effec2<br />\ntiveness of high-voltage machines.<br />\nDi. Adair pointed out that there<br />\nwere 128,475 known deaths last year<br />\nfrom cancer and that it is reasonable<br />\nto believe there are about 260,000<br />\neases of the disease in this country.<br />\nTuberculosis, which formerly held<br />\nsecond place in the list of fatal diseases, has slipped to sixth place, givway to cancer.<br />\nAs the people were educated in<br />\ntuberculosis, he said, they must be<br />\nfurther educated in cancer prevention<br />\nand caution. Such education so far as<br />\nit has progressed, he added, has<br />\n<br />\n(Continued from Page 1, Col. 6)<br />\none of the ring skirmishes, with<br />\nJohnny Stevens and Tommy Dukehart paired in another.<br />\nTwo standout matches are listed on<br />\nthe mat program. The first of these<br />\nfigures to produce grim grappling on<br />\nthe part of Phil Hartman and Capt.<br />\nCrox McDaniels of the Varsity team.<br />\nAlthough McDaniels, a 155-pounder,<br />\nwill outweigh his opponent by 20<br />\npounds, the latter is a finished performer and boasts of an undefeated<br />\nrecord this year.<br />\nA striking contrast will be afforded<br />\nby the following match, which will<br />\nwitness a return performance of the<br />\nEareckson brothers of the Y. M. C.<br />\nA. They are scheduled to repeat their<br />\nhilarious take-off on the professional<br />\ntoe-twisting tribe, which proved so<br />\npopular at the gym inauguration exercises.<br />\n.<br />\nBetween the halves Gardner Hill<br />\nwill entertain with an exhibition of<br />\ngymnastic skill.<br />\nshown effects, and the largest group<br />\nof cancer patients now applying for<br />\ntreatment are still in the operative<br />\nstage. There are concrete evidences of<br />\npatients \"showing up earlier than before.\"<br />\nNeed Definite Diagnosis<br />\nOne must have a definite diagnosis<br />\nbefore starting treatments, he continued, and there is little excuse for<br />\nthe surgeon to proceed without such<br />\na diagnosis, with the modern methods<br />\nhe has at hand.<br />\n\"Surgeons should welcome anything<br />\nthat will aid them in eradicating this<br />\ndisease,\" Dr. Adair emphasized.<br />\nDr. Shipley, while urging cooperation, warned both surgeons and radiologists against their own enthusiasms.<br />\nFollowing the meeting a buffet supper was served.<br />\n<br />\nS.A.C.Cards Provide Press<br />\n$1 Seats For Concert<br />\n<br />\nCongressmen Demanded Books At<br />\nA manual has been published at<br />\nRecord Rate During Year<br />\nMarshall College for the purpose of<br />\nJust Past<br />\ninstructing professors how to act before a class.<br />\nThe New Deal has given the Lio—o<br />\nbrary of Congress its busiest year.<br />\nAccording to the Mercer Cluster,<br />\nThe library's annual report revealed<br />\nWilliam Shakespeare was declared<br />\nthat members of Congress boned up<br />\nineligible for football last- year bein books at a record rate during 1934.<br />\ncause he flunked in English.<br />\nThe report also pointed out that reo—o<br />\nearching officialdom filled every crack<br />\nThe mail at the Florida State Coland cranny of the great library and<br />\nextra chairs and tables were put in lege for Women increased ten-fold on<br />\nSt. Valentine's Day.<br />\nwherever possible.<br />\no—o<br />\n\"Requests relating to President<br />\nThe New York University's BulleRoosevelt and the new powers deletin, in an editorial, asked for the regated to him were so numerous,\" the<br />\nturn of commercialized football at<br />\nlibrary reported, \"that we found it<br />\nthe university.<br />\nnecessary to prepare the following<br />\no—o<br />\nlists, which have been in great deThe staff of the Carnegie Institute<br />\nmand: 'Franklin Delano Roosevelt,<br />\nof Technology sent a valentine to the<br />\nPresident of the United States,' and<br />\nCouncil reading: \"To the guys who<br />\n'Constitution Powers of the President<br />\nsit up front and fuss. From the guys<br />\nof the United States, Including Powwho sit downstairs and cuss.\"<br />\ners Recently Delegated.'\"<br />\no—o<br />\nJapanese Prince Studies Up<br />\nStudents at the University of MisPrince Fumimaro Konoye, presi- souri who were in the hospital<br />\nbut<br />\ndent of the House of Peers of Japan, could write had to take the<br />\nmid-year<br />\nwas reported to have become much exams.<br />\ninterested in the NRA on his recent<br />\n0-0<br />\nvisit to the Washington. The library<br />\nAttendance at the Harvard Univergave him a five-page list of refersity chapel averaged 63 daily durences on the subject.<br />\ning the past year.<br />\nConsumers, cosmetics, crippled chilo—o<br />\ndren, alcoholic beverages and the<br />\nEnrollment at Los Angeles Junior<br />\nchild-labor amendment were among College was so large this year that<br />\nthe hundreds of topics on which the police reserves had to be called. out<br />\nlibrary prepared mimeographed book to keep the students in line during<br />\nlists for researchers.<br />\nregistration.<br />\n<br />\nMusilal Club Show Will Be Held<br />\nAt Maryland Casualty Clubhouse On March 15<br />\n(Continued from Page 1, Col. 4)<br />\nGlee Club, the organization has grown<br />\nuntil now it numbers about 90 members.<br />\n<br />\nAlso included in the .orga.niza-<br />\n<br />\ntipn is the 16-piece Blue Jay Orchestra.<br />\n<br />\nThe directors are Conrad Geb-<br />\n<br />\nellen and Oz Steinwald.,<br />\nPresent Officers Listed<br />\nCarson G. Frailey is president of<br />\nthe group. Other officers include:•<br />\n<br />\nCREDITS ...both<br />\n<br />\nacademic and HUMAN<br />\n<br />\nNooney Book Shop<br />\n1902 N. CHARLES STREET<br />\nGREETING CARDS —<br />\nLENDING LIBRARY<br />\nOpen Evenings<br />\n<br />\nCHARLIE<br />\n<br />\nFIRST CLASS LAUNDRY<br />\n<br />\nTheodore's Barber Shop<br />\n<br />\n(Continued from Page 1, Col. 4)<br />\nell decided to have a little fun with<br />\nDoc.<br />\n<br />\n3224 GREENMOUNT AVE.<br />\nButtons Sewed On, Stockings<br />\nMended, and all Seeded Repairs<br />\nAt No Extra Charge<br />\n<br />\nFormerly with EhilL CATE<br />\nS. W. Cor. St. Paul and 33rd Streets<br />\nNext to Birely's<br />\n8 A. M. to 8 P. M.<br />\n<br />\n\"Mr. Reizenstein,\" he said, \"before<br />\nyou came in we were talking about<br />\nMarc Anthony and Cleopatra. Would<br />\nyou rather hear about them, or about<br />\nthe situation in Detroit?\"<br />\nDoc shrugged his shoulders and inquired in a naive manner,<br />\n\"What's in Detroit?\"<br />\n<br />\nI<br />\n<br />\nPeabody Pharmacy<br />\n<br />\nFOR CLEANING, DYEING and<br />\nPRESSING—Reasonable Rates<br />\nWe Call For and Deliver<br />\n<br />\nCALVERT and 30TH STS.<br />\nFirst in Quality — First in<br />\nService<br />\n<br />\nCH. 9849<br />\n<br />\nNo delivery too small. Bel.<br />\n<br />\n•<br />\n<br />\nLUCKLES<br />\nCENTER LEAVE<br />\n<br />\n744i<br />\n<br />\nexpensive center leaves. That's<br />\nwhy I'm milder. That's why I<br />\ntaste better. Notop leaves,unripe<br />\nand stinging;no bottom leaves,<br />\ncoarse and sandy,are permitted<br />\nto destroy my uniform mildness<br />\nand good taste. I'm your best<br />\nfriend.I am your Lucky Strike.<br />\n<br />\nCENTER LEAVES<br />\nU THE MILDEST SMOKE<br />\n<br />\ng Beth<br />\n<br />\ndo/<br />\n<br />\n5311<br />\n<br />\nstudy in MOSCOW—and PLAY as well.<br />\nA momentous opportunity! Last year students and graduates of 60 universities from<br />\n20 states and 4 foreign lands enrolled in<br />\nthe Anglo-American Section of Moscow<br />\nUniversity . . traveled and lived as<br />\nthey learned!<br />\nRegistration now open 1935 session July<br />\n16-Aug. 25. Instruction in English by Soviet faculty<br />\n12 courses surveying contemporary Soviet life. University credit<br />\nAmerican Advisory Organizapossible.<br />\ntion: Institute of International Education<br />\nWrite for booklet JH-3<br />\n<br />\nEDUCATIONAL DEPT.<br />\nINTOURIST, Inc.<br />\n545 Fifth Ave., New York<br />\n<br />\nWhen strangers meet<br />\nI break the ice<br />\n<br />\nYou like me best because I am<br />\nso mellow, rich, flavorful. She<br />\nchooses me in preference to<br />\nother cigarettes for another<br />\nreason; because I am so mild<br />\nand easy on her throat. But you<br />\nboth prefer me because I am<br />\nmade exclusively from fragrant,<br />\n<br />\nMOSCOW<br />\n<br />\n•<br />\nFree Manicuring<br />\n<br />\nFRIED'S<br />\n'101 E. 21st St.<br />\n<br />\n(Continued from Page 1, Col. 2)<br />\nment of his scholarly inspiration and<br />\ncouncil.\" The volume was edited by<br />\nCharles G. Haines and Marshall E.<br />\nDimock, and the essays were written<br />\nby Frank G. Bates, Marshall E.<br />\nDimock, John A. Fairlie, Charles<br />\nGrove Haines, James Hart, Milo R.<br />\nMaltbie,<br />\nThomas<br />\nReed<br />\nPowell,<br />\nGeorge W. Spicer, and Charles C.<br />\nThach.<br />\n<br />\nAnother publication was An Indiscretion<br />\nin the Life of an Heress,<br />\nEdward Hatfield, Jr., and John L. V.<br />\nthe lost novel of Thomas Hardy, now<br />\nMurphy, vice-presidents; Bert G. Canprinted for the first time in America<br />\nnon and Louis E. Reuling, junior bus- and edited with an introduction and<br />\niness manager; and Henry Fenster- notes by Carl J. Weber. The Juristic<br />\nwald, student director of the Blue :Status of Egypt and the Sudan by<br />\nJays. Besides Beck, the business staff Vernon A. O'Rourrke, and several<br />\nseveral journals were also published<br />\nincludes James Beck, John Canning,<br />\nduring the past month.<br />\nBrian S. Murphy, and Roger Vincent.<br />\nThe entire club performed at the<br />\nPhoenix Club on Eutaw Place, last<br />\nSunday and at the St. Mark's M. E.<br />\nChurch, Garrison Boulevard and<br />\nLiberty Heights Ave., Friday, Mach 1.<br />\n<br />\nLifeOnTheCam pusBreaks<br />\nIts Slow Measured Step<br />\n<br />\nDER<br />\n<br />\nAnnounces<br />\nWorks Printed In<br />\nRegime OfDr.Ames<br />\n<br />\nCopyright 1935.<br />\nThe American Tobacco Company.<br />\n<br />\n\f4<br />\n<br />\nHOME WOOD, BALTIMORE, MD., MARCH 5, 1935.<br />\n<br />\nChamps Picked<br />\nIn Frosh, Soph,<br />\nSenior Classes<br />\n<br />\nTennis Meeting Thursday<br />\nFollowing Thursday's assembly,<br />\nthere will be an organization meeting of the tennis team. All returning players and new candidates for<br />\nthe team are requested to be present.<br />\n<br />\nJays To Meet Jay Matmen<br />\nTerp Quintet Defeated In<br />\nIn Final Game Home Meet<br />\n<br />\nN. J. All Stars, Senior Chemists, Soph Mechanics<br />\nWin In Court Games<br />\n<br />\nGeorge Darley's Dribblers At Blue Grunters Lead Until<br />\nHofmeister To<br />\nCollege Park Tomorrow;<br />\nFinal; Hale Pins BeachOut<br />\nAvenge<br />\nTo<br />\nDefeat<br />\nley To Win Meet<br />\nBecome First<br />\nTo Play Each Other<br />\nTennis Coach<br />\nInter-Class Champion Five Schedule Completed Includes<br />\nTo Vie With Frat Win7 Home Matches, 7 Away;<br />\nner For School Title<br />\nFrosh To Have Team<br />\n<br />\nA winning fall in the heavyweight<br />\nIn their final intercollegiate contest of the current basketball season, class, the last match of the evening,<br />\nGeorge Darley's dribblers hit the gave the Haverford College wrestlers<br />\n<br />\nhighway for College Park tomorrow a 14 to 12 victory over the Jay matmen Saturday at the gym.<br />\nnight.<br />\n<br />\nIntercollegiate<br />\nHandball<br />\n<br />\nJay Natators Bov<br />\nTo Delaware Here<br />\n<br />\n1••••••<br />\n<br />\nAt the conclusion of the playoffs of the handball tournament<br />\nnow in progress, a team will be<br />\nselected to represent the Hopkins<br />\nin intercollegiate competition.<br />\nMatches have been arranged<br />\nwith University of Virginia, St.<br />\nJohn's, Baltimore Athletic Club,<br />\nand the second teams of the Y. M.<br />\nH. A. and Y. M. C. A., according<br />\nto Reuben Baer, head of the handball league. The dates of these<br />\ngames have not been decided definitely as yet.<br />\n<br />\nLose To Blue Chicks In Final Meet<br />\nBy Score Of<br />\n43-32<br />\nOvercome by a superior and better<br />\nbalanced aggregation, the Jay Rata<br />\ntors made a valiant showing but<br />\nbowed to Delaware in the final meet<br />\nof the season last Saturday night<br />\nThe encounter, which took place at<br />\nthe K. of C. pool, was rather clos<br />\nthroughout, although the Blue Chic<br />\ntook the lead from the opening event,<br />\nwinning by the score of 43-32.<br />\n<br />\nHazlett Wins Breaststroke<br />\nThe skill of Al Hale, Haverford by a time advantage. Matters were<br />\nOnly a week ago the Terps met the<br />\nBill Hazlett captured the Black an<br />\nJays here in one of the best played heavyweight, shattered the Hopkins settled by the heavyweight match in<br />\nLast week marked the completion<br />\nBlue's only first place when he led<br />\nAccording to an announcement tilts of the year, Maryland winning lead and won the final match with curred.<br />\nof the series of basketball games to<br />\nthe field home in the 200-yard breastmade by Dr. G. Wilson Shaffer Friwith a driving finish, 41-35. Since Bob Beachley. Hale pulled a Frank<br />\nLotz, Naylor Box<br />\ndetermine the class championship day, Jean Hofmeister, ranking city<br />\nstroke, returning 2:50.5. Bill Bishop,<br />\nMerriwell. Before this match the JayAfter the wrestling matches, Ed another Hopkins swimmer, secured<br />\nfive with the New Jersey All Stars, and state netman, will coach the ten- then the boys on ,the Washington<br />\nmen were on the long end of a 12 to 9<br />\nSophomore Mechanics, and Senior nis team. This is the first year since highway have drcppc,1 a game to<br />\nLotz, coach of the Jay boxers, and the runner-up position. Lou Adler led<br />\nscore. A time advantage would have<br />\nthe Jays in point scoring with six<br />\nChemists emerging victorious at the the origin of a tennis team at the St. John's, 24-17. The wild playing of<br />\nDon<br />\nNaylor, undergraduate, put on a<br />\ntied the score, a fall was necessary<br />\nmarkers as a result of second places<br />\nhead of their respective leagues. The Hopkins that a coach has been em- the Terrapins in this latter fracas has<br />\nto win. The Pennsylvania proceeded two-round boxing exhibition.<br />\nin the 50 and 100-yard dashes.<br />\njunior champs were decided prior to ployed. Hofmeister will work out<br />\ngiven Hopkins high hopes of revenge to the mat and after 6 minutes and<br />\nThe summary of the wrestling<br />\nlast week when the Junior Gas Engi- with the team regularly.<br />\nCarey and Croes were outstanding<br />\n25 seconds of grunting and growling<br />\nin<br />\ntheir second meeting.<br />\nneers made off with the laurels.<br />\nAlthough the Blue racquet wielders<br />\nfor the visitors, as both competitors<br />\nmeet:<br />\nemerged the victor, pinning BeachWaters, Star<br />\ncaptured two events. Carey won the<br />\nTo win the frosh championship, are without Captain Bunny Brooke,<br />\nley's shoulders to the mat with a bar 118-Pound Class—Hoffman, Hopkins,<br />\n100 and 220-yard swims, defeating<br />\nCoach Burton Shipley will probably<br />\nthe New Jersey team defeated Cas- Babe Ladensky, and Mort Palitz this<br />\nand hammerlock.<br />\ndefeated Frysinger. Time advan- L. Adler and<br />\nNoonan in the former<br />\ntelle's Musicians by a score of 27 to year, there are some capable veter- start Al Waters, the best shot on the<br />\ntage, 1th. 5s.<br />\nJays Have Early Lead<br />\nand nosing out Eddie Scheer in the<br />\n17. The Sophomore Mechanics won ans returning from last year's team team, and Bill Andorka<br />\nat the forThe Blue grapplers were off to a 126-Pound Class—Rivers, Haverford, longer race. Croes was victorious in<br />\nthe Soph championship by virtue of and several able newcomers. Captain<br />\nard posts. Vic Willis, younger brother flying start when Joe Hoffman<br />\nSiverd,<br />\nNat<br />\nearned<br />\nGoldberg,<br />\ndefeated Gelber. Time advantage, the 50 and the 150-yard breaststroke.<br />\nCarl<br />\nHartman,<br />\na 19 to 11 victory over the SophoIn the dorsal event he was puab.ed by<br />\n2m. 10s.<br />\nmore Gasmen, while in the senior George Buck, and Henry Kramer form of the Empire State Building, is the first Hopkins points by a time<br />\nDan Weiner and John MacGill, both<br />\nleague, the Senior Chemists defeated the nucleus of this year's team, while slated for the pivot job. Bill Guckey- advantage over Dan Frysinger in the 135-Pound Class—Hartm<br />\nan, Hopkins,<br />\nBlack and Blue natators. Bud Adler<br />\nthe Senior Businessmen to the tune Jerry Branower, Carl Rasin, Tom son and Norwood Sothoron, both 118-pound class. Joe Rivers of Havdefeated Skinners. Time advantage,<br />\nerford put both teams on an even<br />\nobtained a second in the 444)-yard•<br />\nConnor, Lamed, and Jerry Tillman<br />\nof 34 to 17.<br />\nnatural athletes and All-Southern<br />\n4m. 58s.<br />\nfooting by defeating Julie Gelber.<br />\ngrind, while Bill Koenig was runnerloom<br />\nas<br />\nfirst<br />\nclass<br />\nsupporting<br />\nmateQuint To Compete In Series<br />\nbacks, will team up as guards.<br />\nrial.<br />\nPhil Hartman, crack 135-pounder, 145-Pound Class—Blanc-Roos, Haver- up in the diving.<br />\nEach class championship quint will<br />\nThe usual line-up will represent the having removed his shoes and socks,<br />\nford, defeated Waters. Time advanInstead of the customary Jay Vee<br />\ncompete in a series, the winner of<br />\ntage, 8m. 3s.<br />\nteam there will be a freshman team, Blue team. Herbie Siegel, high scorer earned enough time advantage to<br />\nPhone Belmont 7908<br />\nwhich will play the leader of the frawith several matches both home and in the first Jay-Terp tilt, and Captain whip Skinners. In the 145-pound class 155-Pound Class—McDaniels, Hopternity league. Each member of the<br />\naway. Already a match has been arkins, defeated Weitzenkorn. Time<br />\nCliff Siverd, forwards; Opie Chancel- Captain Rene Blanc-Ross had little<br />\ninter-class championship team will be<br />\nranged with Episcopal High at WashSt. Paul at 33rd Street<br />\ntrouble in taking a time advantage<br />\nadvantage,<br />\n5m. 45s.<br />\nawarded a medal.<br />\nlor, center; and Carl Rasin and Harry<br />\nPrescriptions-School Supplies-Candy<br />\nington. Candidates for both teams will<br />\nover Somerset Waters, although Wa165-Pound Class—Clautice, Hopkins,<br />\nAlso, four all-star basketball teams, begin indoor practice in the gym with- Woodrow, guards.<br />\nCigars - Unexcelled<br />\nters did well to avert a fall.<br />\nFountain Service<br />\ndefeated Pensye. Time advantage,<br />\neach representing a class, will meet in the next ten days.<br />\nIn the first game with Maryland<br />\n•<br />\nCaptain McDaniel and Eddie Clau6m.<br />\nin a series to decide the championVarsity manager Wallenstein has no substitutions were made. How- tice encountered little<br />\ntrouble in their<br />\nship of the college. Members of the arranged a well-rounded schedule<br />\nmatches with Joe Weitzenkorn and 175-Pound Class—Hires, Haverford,<br />\nvarsity quint will be eligible to play which includes matches with Navy, ever, George Margolis, Harold ZheutJ. H. FURST CO.<br />\ndefeated Barnett. Time advantage,<br />\nDan Pensye, respectively. Both of<br />\non the stellar fives of their respective Lehigh, Rutgers, Harvard, and Tem- lin, Jerry Branower, and Len Rubin6m. 10s.<br />\nthe Hopkins men winning by a time<br />\nPrinters of<br />\nyears.<br />\nple. In all the team will have four- ger will probably make the trip to see advantage.<br />\nCharley Barnett was Heavyweight Class—Hale, Haver- PHILOLOGICAL and SCIENTIFIC<br />\nThe line-ups:<br />\nteen contests, seven to be played at who can score the most between the successful in keeping<br />\nPUBLICATIONS<br />\nDick Hires<br />\nford, threw Beachley with bar and<br />\nN. J. ALL-STARS<br />\n112-20 HOPKINS PLACE, BALTIMORE<br />\nhome, and seven to be played away. halves.<br />\nMUSICIANS<br />\nfrom gaining a fall; however, he lost<br />\nhammerlock in 6m. 25s.<br />\nPinck<br />\nF<br />\nErlanger<br />\nIsraggis<br />\nF<br />\nGoldman<br />\nGiacinto<br />\nC<br />\nSonneborn<br />\nRosenthal<br />\nG<br />\nLloyd<br />\nRoyster<br />\nG<br />\nDowell<br />\n<br />\nBirely's Pharmacy<br />\n<br />\n1<br />\n<br />\nMECHANICS<br />\n<br />\nBottom<br />\nDickler<br />\nGalloway<br />\nBuck<br />\nLeigh<br />\n<br />\nGASMEN<br />\n<br />\nF<br />\nF<br />\nC<br />\nG<br />\nG<br />\n<br />\nWiseman<br />\nDeitz<br />\nStollberg<br />\nHoffman<br />\nGlasser<br />\n<br />\n•<br />\nBUSINESS<br />\n<br />\nCHEMISTS<br />\n<br />\nHager<br />\nTillman<br />\nClark<br />\nBuck<br />\nGamse<br />\n<br />\nF<br />\nF<br />\nC<br />\nG<br />\nG<br />\n<br />\nMerson<br />\nTurner<br />\nRobinson<br />\nMcGreevy<br />\nColgan<br />\n<br />\nLilly To Address<br />\nCounseling Class<br />\nAthletic Director At Polytechnic Will<br />\nSpeak To Afternoon Group; Night<br />\nClass To Hear Baer<br />\n<br />\n;<br />\n<br />\n:.:e.p.•:;:•:•:•<br />\n<br />\nAt the regular meeting of the class<br />\nin camp counseling to be held tomorrow at 4.15 p. m. in Gilman 312, William S. Lilly III, director of athletics<br />\nat the Baltimore Polytechnic Institute, will be the speaker.<br />\nThe night class will be addressed<br />\nby Reuben Baer, head of the counseling course, who will speak on \"The<br />\nCounselor.\" The class will take place<br />\nat 7 p. in. in Gilman 205. Visitors are<br />\nwelcome.<br />\n<br />\nAviation Club Plans To<br />\nReorganize Completely<br />\nA complete reorganization of club<br />\nprogram and activities will be effected at the next meeting ef the<br />\nAviation Club to be held Wednesday,<br />\nMarch 6, at 4 p. m. in the Student<br />\nActivities office.<br />\nDuring the meeting Grahame Duce,<br />\npresident of the club, will present for<br />\nexamination 150 photos of hereto unphotographed United States military<br />\naircraft. All members are urged to<br />\nattend the meeting.<br />\n<br />\nChessmen Tie Poly<br />\nLast Wednesday the freshman chess<br />\nteam played host to the Poly chessmen in a league match, which rcstulted in a deadlock, 21/<br />\n2 to 23'2•<br />\nSkinner was defeated by Ghent;<br />\nTampico lost to White; Witow won<br />\nover Altoff; Harris checkmated Glushakow, and Levie drew with Shoemaker.<br />\n<br />\nr,<br />\n<br />\nr<br />\n<br />\n. ••<br />\n<br />\n4<br />\n<br />\n\f", "format": "basic_html", "processed": "Member Of The<br /><br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nau* iqopititts Nails-Erna<br />\nHOME WOOD, BALTIMORE, MD., TUESDAY, MARCH 5, 1935.<br /><br />\nVol. XXXIX—No. 32.<br /><br />\nJuniors Secure<br />\nHal Kemp Band<br />\nFor June Dance<br />\nClass Votes Unanimously For<br />\nNationally Known Group<br />\nTo Play At Social Function<br /><br />\nTentative Price $4<br />\nJuniors Who Have Paid Class<br />\nDues Will Be Admitted For<br />\n$3.00, Says Brian Murphy<br /><br />\n\"Uncle Vanya\" To Be<br />\nGiven Tonight At 8.30<br />\nThe Johns Hopkins University<br />\nPlayshop will present Uncle Vanya, the great Chekhov play which<br />\nis the second major production of<br />\nthe current year, tonight at 8.30<br />\nPerformances<br />\nin the Playshop.<br />\nwill be given every night this week<br />\nincluding Saturday.<br />\nIncluded in the cast are David<br />\nKurland, Meyer Site, S. Vannort<br />\nChapman, Tom Pinkerton, Jr.,<br />\nPatty Singerwood, Mary Alvey,<br />\nand Helen Ascherfeld. The production has been coached by Dr. N.<br />\nBryllion Fagin.<br />\nTickets for the play may be obtained at the reserve desk in the<br />\nmain library. Admission is seventy-five cents.<br /><br />\nCincinnati U.<br />\nFirst Foe Of<br />\nDebating Team<br />\nGarfunkel, Grossman, Willen<br />\nWill Represent Hopkins In<br />\nDebate Next Thursday<br /><br />\nPlan Southern Trip<br />\nWill Debate Five Teams Beginning March 25; North<br />\nCarolina First Contestant<br /><br />\nChairman Names Seven To<br />\nFreshman Banquet Group<br />\nStanley M. Finkel, Henry Gambill, Jackson Kaufman, Howard<br />\nLinkoff, Sanford Rothstein, Seymour Romanofsky, and John Royster have been appointed to the<br />\nFreshman Banquet Committee, it<br />\nwas announced today.<br />\nThe committee will meet tomorrow in Levering Hall at 12.20 to<br />\ndiscuss further plans for the banquet, which will probably be held<br />\nsometime in April. It is necessary<br />\nthat the entire committee be present at the meeting.<br />\nIn the future various sub-committees will be appointed to assist<br />\nin the arrangement of the program, according to William B.<br />\nKempton, chairman of the committee.<br /><br />\nSUPPORT SPORT<br />\n\"GYMBOREE\" AT GYM<br />\nTHURSDAY NIGHT<br />\nTwenty-fire Cents<br />\nPrice, 5 Cents<br /><br />\nStudents Plan Sports Gymboree<br />\nThursday Evening To Procure<br />\nFund For Football Sweaters<br />\n0. D. K. And A. A. Board<br />\nSponsor Program; Tickets<br />\n$.25 Prior To Affair<br /><br />\nCage Tilt Features<br />\nVarsity To Meet B. A. C.<br />\nFive; Card Also Lists Boxing, Wrestling, Tumbling<br /><br />\nBy STANLEY E. BLITM13ERG<br />\nProceeding on the theory that the<br />\nbest method of attacking an apparently unsolvable problem is to solicit<br />\nwidespread interest and support,<br />\nrepresentative student groups of the<br />\nUniversity have laid plans for a Hopkins \"gymboree\" to be held this<br />\nThursday evening at the Homewood<br />\ngymnasium.<br />\n•<br />\nThe problem referred to resides in<br />\nNumber Represents 27 Per<br />\nthe failure of the Athletic AssociaAll Additional Tickets For<br />\n—Courtesy Sunpapers<br />\nCent Of Titles In Print;<br />\nAccording to John Murphy, chairDONALDSON KELLY<br />\ntion to provide for varsity \"H\" footClub Concert, March 15, Donaldson Kelly, former stellar ball sweaters in its 1934-35 budget.<br />\nman of the Prom committee, this is<br />\nCatalogue Lists 238 Titles<br />\nthe first time in recent years that the<br />\nTo Cost 75c And $1. athlete of the Johns Hopkins Univer- After considerable verbal and editoJunior Prom has been a purely junsity, will be on the basketball team rial discussion had resulted in much<br />\nIssuing a mimeographed catalogue<br />\nior function. The dance will be held which contained the titles of 238<br />\nStudent activities cards will entitle of the Baltimore Athletic Club when bitter feelings but exactly no progduring June Week, but the plans and books, the Johns Hopkins Press set<br />\nstudents to one-dollar seats at the they clash with the Varsity in the ress, members of Omicron Delta Kapbacking are entirely junior. Murphy forth to the public the total number<br />\nto be held to provide pa and the Athletic Board hit upon<br />\nAnnual Home Concert of the Hop- \"gymboree\"<br />\nsaid:<br />\nsweaters and \"Hs\" for the Varsity the idea of a Hopkins athletic carniof works it had printed during the<br />\nkins Musical Club to be held at the<br />\nval in which students might particiteam members.<br />\n\"We have made elaborate prepara- presidency of Dr. Ames.<br />\nMaryland Casualty Clubhouse, March<br />\npate both as spectators and performThis number represents about 27<br />\nrations for this dance. It is the prop15. Additional seats may be obtained<br />\ners. The entire proceeds would then<br />\nerty of the junior class alone, and we per cent of all titles now in print,<br />\nbe employed in securing the necesfor seventy-five cents and one dolneed the support of every member of and 23 per cent of all works published<br />\nsary awards.<br />\nby the Press, including those now<br />\nthe class.\"<br />\nlar.<br />\nAdmission Charge Is $.25<br />\nKemp's band was chosen after a out of print and some which have<br />\nIt was pointed out by Harry Beck,<br />\nAdmission to the \"gymboree\", which<br />\npublishers.<br />\nbeen<br />\ntransferred<br />\nother<br />\nto<br />\nlively discussion at the meeting. The<br />\nbusiness manager of the organizais to swing into action at 8 p. m., has<br />\nThe catalogue was issued in connames of several other nationally<br />\ntion, that special seats for patrons<br />\nbeen set at twenty-five cents if tickwhich<br />\nnection<br />\nexhibit<br />\nwith<br />\nbook<br />\nthe<br />\nknown orchestras were introduced but<br />\nand patronesses are on sale for $1.50.<br />\nets are procured from the proper auwas presented as part of the Comthey were dismissed.<br />\nPresent plans call for the sale of<br />\nthorities before Thursday evening.<br />\nmemoration Day program. The Press<br />\nAlcazar To Be Scene<br />\ntickets to be opened next Monday in Dr. Walter Jones Succumbs Tickets purchased at the gate will<br />\nregrets that it was unable to keep<br />\nLevering Hall.<br />\nThe committee has announced that this exhibit open to the public.<br />\nAt Union Memorial Hos- cost thirty-five cents.<br />\nthey are renting the whole of the AlIn addition to 0. D. K. and the<br />\nDance Features Al Mason<br />\nVolume Of Essays Printed<br />\nEmeritus<br />\nProfessor<br />\npital;<br />\ncazar for the affair which will conA.<br />\nA. Board, members of the NEWSJohns<br />\nHopDuring February, the<br />\nBeck Announced that Al Mason<br />\ntinue from 10 till 3. The admission kins Press published Essays on the<br />\nLETTER staff and representatives of<br />\nand his orchestra would be featured<br />\nDr. Walter Jones, professor emerprice tentatively, which is subject to Law and Practice of Governmental<br />\nat the dance following the concert. itus of physiological chemistry at the other campus organizations will asdollars,<br />\nbut<br />\nchange, will be four<br />\nthose Administration: A Volume in Honor<br />\nAdmission to the affair, which also Johns Hopkins University since 1927, sist in the selling of tickets.<br />\nmembers of the junior class who have of Frank Johnson Goodnow.<br />\nIn the feature engagement of the<br />\nThe<br />\nwill be held in the Maryland Casual- died last Saturday night at the Unpayed their dues will be admitted nine essays were contributed by his<br />\nevening<br />\nthe Blue Jay quintet will<br />\nty Clubhouse, will be $1 per couple.<br />\nion Memorial Hospital. He had been<br />\nfor three dollars. The dues may still students in \"grateful acknowledgestack up against Dutch Lentz's BalThis year the Musical Club is cele- ill about a week.<br />\nbe paid.<br />\ntimore Athletic Club, now engaged<br />\n(Continued on Page 3, Col. 6)<br />\nbrating its fifty-first year on the HopBorn in Baltimore in 1865, he was<br />\nAfter the general discussion, the<br />\nkins campus. Since its first season, the son of the late Levin and Zeanette in a play-off series for the championdance committee, which includes bewhen Woodrow Wilson, Albert Shaw, Jones. He received his A.B. degree ship of the Baltimore • Basketball<br />\nPhilosophy Class<br />\nsides Murphy, the chairman, Zenas<br />\nCharles H. Levermore, and Arthur from Johns Hopkins in 1888 and a League. The Clubmen's appearance<br />\nshould prove doubly attractive, inasSears, Jerry Bloom, Charles Rostov,<br />\nSponsors Debate Series<br />\nYoger were members of the original Ph.D. degree three years later.<br />\nReuben Pasarew, Vernon Kelly, WilIn conjunction with their work in<br />\nmuch as their roster includes Don<br />\n(Continued on Page 3, Col. 5)<br />\nMarried In 1891<br />\nliam Bourne, and Thomas Callahan,<br />\nKelly and Jack Taylor of Hopkins, in<br />\nlogic and scientific method the philHe married Miss Grace C. Clarke<br />\nDr. Silver Will Speak To Group On<br />\naddition to numerous graduates of<br />\nosophy class of Dr. A. E. Blumberg<br />\nheld a meeting to discuss the plans<br />\nin September, 1891, and is survived<br />\nMarch 18 on Unannounced<br />\nfor the dance more fully..<br />\nother Maryland colleges.<br />\nwill conduct a series of debates durby her and a daughter, Mrs. Gilbert<br />\nSubject<br />\nJay Five Improved<br />\ning the term just begun. Each memA. Jarman, 224 East University<br />\nDr. Abba Hillel Silver, one of AmerThe<br />\nber of the class will take part in the<br />\nlocal<br />\nfive is stepping out of itf<br />\nParkway. Also surviving are a brothica's leading rabbis, will speak on an<br />\nprogram as a debater and also as a<br />\nclass<br />\nsomewhat<br />\nin opposing the B. A<br />\nand<br />\ner, B. B. Jones, of Carrollton, Md.,<br />\nunannounced subject at the next<br />\njudge of the debates. The debates are Wife Of Brazilian Envoy Undergoes<br />\nC., but on the basis of recent per.<br />\nDenmead.<br />\nCarrie<br />\nMrs.<br />\nmeeting of the University Supper to give the members of the class acSerious Operation At Instiformances should render a good ac•<br />\nHe started his educational career<br />\nClub to be held at Levering Hall, tual practice in the application of retution Here<br />\ncount of itself. Against Maryland th(<br />\nat<br />\nprofessor<br />\nof<br />\nchemistry<br />\nin<br />\n1891<br />\nas<br />\nMarch 19, at 6.00 p. m.<br />\nflective thinking to argument.<br />\nJays displayed a polished game an(<br />\nWittenberg College, Springfield, Ohio,<br />\nDr. Silver was born in Schirwidt,<br />\nMrs. Delminda Aranha, wife of Dr.<br />\nIn order that the class may have an<br />\nconvinced the fans that they hav(3<br />\none<br />\nyear.<br />\nhe<br />\nremained<br />\nfor<br />\nwhere<br />\nLithuania, 42 years ago. Coming to idea of debating technique, the varOswaldo Aranha, Ambassador to the From 1892 to 1895, he was professor finally overcome the \"new gym jinx'<br />\nAmerica early in his life, he was ed- sity Debating Council, under the diwhich seems to have stalked thet<br />\nUrge Closer Cooperation ucated at the University of Cincinnati rection of Abner Willen, will appear United States from Brazil, underwent of analytical chemistry at Purdue footsteps<br />\nthis season. Siegel and Ra<br />\nUniversity.<br />\nan<br />\noperation<br />\nat<br />\nJohns Hopkins HosAmong Profession And and the Hebrew Union College, from before the class tomorrow and will<br />\nsin<br />\nproved<br />\nparticularly effectiv(<br />\nReturning to his alma mater in<br />\nwhich he was graduated in 1915. In<br />\nthe question, \"Resolved, That pital last Thursday. Dr. Aranha anagainst the Terps.<br />\n1895, as an assistant professor, he<br />\nDropping Of Prejudices' 1925, he received his D.D. degree from 'debate<br />\nthe nations of the world shall agree nounced that he would remain in<br />\nPrior to the cage encounter there<br />\nbecame professor of physiological<br />\nthe Hebrew Union, and :three years to prohibit the international shipment<br />\nBaltimore for several days while his chemistry in 1908, holding that post will be a series of boxing and wrest<br />\nCloser cooperation among surgeons, later a Litt. D. degree from Western<br />\nof arms and munitions.\" The first de- wife was<br />\nling matches. Casey Kasselbraner and<br />\nrecuperating.<br />\nuntil eight years ago.<br />\nradiologists, and pathologists and Reserve College.<br />\nbate in the series to be presented by<br />\nHarold Glasser will get together in<br />\nListed<br />\nHis Membership<br />\nMrs. Aranha entered the Hopkins<br />\nabandonment of \"professional prejuServed In France<br />\nthe class will be held the following<br />\n(Continued on Page 3, Col. 2)<br />\nHe was a member of the American<br />\ndices\" with a view to conquering canHospital ,Friday morning and reDuring the World War, he served Wednesday.<br />\ncer was urged at a meeting of the in France, and was decorated by the<br />\nmained under observation until the Physiological Society; the National<br />\nradiological section of the Baltimore French Government.<br />\noperation, which was performed Academy of Sciences; American So- Dr. McPhedranTo Deliver<br />\nSpeak<br />\nTo<br />\nIsrael<br />\nLovejoy,<br />\nCity Medical Society and other units<br />\nshortly<br />\nbefore noon by Dr. William ciety of Biological Chemists, of which Fifth Delamar Lecture<br />\nDr. Silver, a member of the ZionOf the organization held last Friday ist Organization of America and the<br />\nDr. Arthur 0. Lovejoy, professor F. Rienhoff, Jr., associate in surgery he was formerly president, and the<br />\nAmerican Association for the Ad- Will Speak March 19<br />\nevening in Osler Hall of the School of Jewish Agency for Palestine, served of philosophy, and Dr. Edward L. Is- at the Hospital.<br />\nOn Tuberculosis<br />\nDr. Aranha, former Minister of Fi- vancement of Science.<br />\nMedicine of the Johns Hopkins Univ- on President Hoover's Unemploy- rael, of the Har Sinai Temple, will<br />\nAnd Public Health<br />\nArticles written by him on subjects<br />\nersity.<br />\nEconomics<br />\nment Commission.<br />\nOther organiza- speak at the first organization meet- nance of Brazil, • succeeded Rinaldo<br />\nphysiological chemistry have apin<br />\nas<br />\nto<br />\nthe<br />\nSilva<br />\nambassador<br />\nLima<br />\nE.<br />\nTwo Read Papers<br />\ntions of which he is a member are ing of a Hopkins branch of the Amerappeared in various American and<br />\nDr. F. Maurice McPhedran, M. D.<br />\nIn the audience were leaders of the the American League for the De- ican League Against War and Fas- United States in March, 1934. Mrs.<br />\nGerman technical publications.<br />\nsince<br />\ncountry<br />\nbeen<br />\nin<br />\nthis<br />\nhas<br />\nassistant professor at the Henry<br />\nnledical profession in Maryland, in- fense of Jewish Rights, the Central cism, in Levering Hall Friday, at 4 Aranha<br />\nHis home in Baltimore was at the<br />\nSeptember.<br />\ncluding internationally famous mem- Conference of American Rabbis and o'clock.<br />\nPhipps Institute of the University of<br />\nHopkins Apartments. Funeral servbers of the Johns Hopkins Medical the National World Court Commis<br />\nPennsylvania will deliver the fifth<br />\nices were held Monday afternoon.<br />\nDelamar Lecture of the year on<br />\neliool faculty, the University of sion.<br />\nMarch 19. The last lecture of the serkaryland Medical School and specialRabbi Silver lives with his wife and<br />\nU. of Chicago Professor ies will be given early in April by Dr<br />\nists in many lines.<br />\nthree children in Cleveland, Ohio,<br />\nThe papers that were discussed lat- where he is in charge of The Temple.<br />\nTo Give Dohme Lecture Richard E. Scammon of the Univer<br />\nsity of Minnesota.<br />\ner were read by Dr. Arthur C. ChristDr. McPhedran will lecture of the<br />\nle, of Washington, the next president Dr. Sigerist Plans To Talk<br />\nDr. Morris S. Kharasch, associate<br />\ndrawer and the desk and it opens<br />\nprofessor of organic chemistry at the pathogenesis of tuberculosis in relac't the International Institute of RadiDr. S. S. Jenkins, who teaches the right up.\"<br />\nTo4FriendsOfTheLibrary' 8.30 Organic chemistry class, is a<br />\nUniversity of Chicago, has been se- tion to its public health economics.<br />\nII<br />\n°logy, and Dr. Frank E. Adair, a<br />\nThe Delmar lectures are supported<br />\nHoward Reizenstein, who is well lected to deliver the Dohme lecture<br />\ngraduate of the Johns Hopkins MedDr. M. H. Siegerist, William H. great believer in the perfectability of<br />\nby<br />\na fund bequeathed to the Johns<br />\nMitchin<br />\nchemistry<br />\nat<br />\nthe<br />\nUniversity,<br />\non<br />\nat<br />\nDr.<br />\nspectators<br />\nteal School in 1915 and now surgeon- Welch professor of history of med- human nature.<br />\nknown to the<br />\nHopkins University School of MediIn-chief at the Memorial Hospital in icine and director of the Institute of<br />\nThe other day he was commenting ell's three-ring circus presented at March 15.<br />\nDr. Kharasch was associate profes- cine by Joseph R. Delamar. They are<br />\n1\\Tew York city. They were introduced the History of Medicine, will address on the disappearance of apparatus 8.30 behind closed doors every Monby Dr. Waters.<br />\nsor<br />\nof organic chemistry at the Uni- a series of lectures in personal and<br />\nTuesday,<br />\nand<br />\nWednesday,<br />\nonce<br />\nday,<br />\nlaboratory,<br />\nand<br />\nanfrom<br />\ndesks<br />\nin<br />\nthe<br />\na meeting of the Friends of the LiTake Part In Discussion<br />\nbrary to be held this Friday at the nounced that the locks would be sup- again stole the show from the jovial versity of Maryland from 1922 to public hygiene with the object of<br />\n1924. He later did work on toxic gas bringing before the public at large<br />\nplied to those students who wanted master of ceremonies.<br />\nThose who took part in the dis- Welch Medical Library.<br />\nLast Wednesday \"Doc\" Reizenstein at the Hopkins and the Edgewood facts and points of view on modern<br />\ncussion were:<br />\nDr. Sigerists's topic will be \"Leon- them.<br />\nhygiene.<br />\nter. J. M. T. Finney, Sr., professor ardo Da Vinci's Notebook.\"<br />\n\"I am sure that this is the best arrived late for the performance, but Arsenal.<br />\nDuring<br />\nCoolidge's<br />\nadministration<br />\nin<br />\nThe Delamar bequest also supports<br />\nhumor<br />\nand<br />\nMitchell<br />\nwas<br />\nin<br />\na<br />\ngood<br />\nDr.<br />\n\"beJenkins<br />\ncontinued,<br />\ncourse,\"<br />\nDr.<br />\nMiss Mary Goodwillie, who was reemeritus of surgery, Johns Hopelected president at the meeting held cause it is so easy to break into the allowed him to enter. After the delin- 1926 Dr. Kharasch was appointed to the \"American Journal of Hygiene'<br />\nkins Medical School.<br />\nbr. Joseph Colt Bloodgood, adjunct at the Walters Art Gallery, will pre- desks. All that you have to do is to quent had seated himself, Dr. Mitch- the Chemical Warfare Service by the published under the auspices of the<br />\nSecretary of War.<br />\nSchool of Hygiene and Public Health.<br />\n(Continued on Page 3, Col. 3)<br />\ninsert a screw-driver between the<br />\n(Continued on Patin<br />\nCol_ 11i side.<br /><br />\nAt a meeting held in Latrobe Hall<br />\nat 12.20 yesterday the Junior Class<br />\nvoted unanimously to have Hal<br />\nKemp's orchestra to play for the annual Junior Prom to be held at the<br />\nAlcazar Ballroom on June 4 in conjunction with the June Week festivities . The contracts were ready and<br />\nsigned by the committee after the<br />\nclass voiced its decision.<br />\nJunior Affair, Says Murphy<br /><br />\nPress Announces<br />\nWorks Printed In<br />\nRegime0fDr.Ames<br /><br />\nThe debating team will debate with<br />\nthe University of Cincinnati next<br />\nThursday in room 205, Gilman Hall,<br />\nit was announced last week by Abner<br />\nWillen, president of the Debating<br />\nCouncil.<br />\nThe Hopkins team will uphold the<br />\naffirmative tide of the question \"Resolved, That the nations of the world<br />\nshall agree to prohibit the international shipment of arms and munitions.\" This question was debated<br />\nseveral weeks ago by members of<br />\nthe Debating Council.<br />\nThose who will argue for the affirmative are Sylvan Garfunkel, Philip<br />\nGrossman and Abner Willen.<br />\nThe annual southern trip taken by<br />\nthe team will begin March 25, the<br />\nfirst debate being with the University<br />\nof North Carolina. The team will<br />\nthen go to Emory College, Oglethorpe<br />\nUniversity, and the University I of<br />\nGeorgia. The trip will end about<br />\nApril 1 with a debate against the<br />\nUniversity of South Carolina.<br />\nThe northern trip will be taken<br />\nabout the same time with two debates<br />\nalmost assured. Temple, University<br />\nand LaSalle University will pit teams<br />\nagainst the Hopkins debaters. Those<br />\nwho will make this trip are James<br />\nMorrow, Phillip Grossman, Neal Potter, and Paul Zucker. Abner Willen<br />\nand Sylvan Garfunkel will represent<br />\nthe Hopkins on the southern trip.<br />\nThe debating team engaged Mt. St.<br />\nMary's last night at Emittsburg.<br />\nThose who debated for the University<br />\nteam were Paul Umbarger, Phillip<br />\nGrossman, Paul Zucker, and James<br />\nMorrow.<br /><br />\nS.A.C.CardsProvide<br />\n$1 Seats At Musical<br />\nClub Performance<br /><br />\nSchool Of Medicine<br />\nProfessor Dies Here<br />\nAfter Short Illness<br /><br />\nRabbiSilverPlansTo<br />\nAddress SupperClub<br /><br />\nMedical Savants<br />\nHold Symposium<br />\nOn Cure Of Cancer<br /><br />\nAmbassador's Wife<br />\nAt Hopkins Hospital<br /><br />\nIn Which Life On The Campus<br />\nBreaks its Measured Tread<br /><br />\nHOME WOOD, BALTIMORE, MD., MARCH 5, 1935.<br /><br />\n2<br /><br />\nstick teams have been noted primarthelRevosAztter ily<br />\nfor the smoothness of the attack,<br />\nFOUND= 1897<br /><br />\nSubscription per<br />\nBy Mail<br /><br />\n-$2.50<br /><br />\nmaking it only fitting that the man<br />\nwho has been responsible for much<br />\nof this success should now be placed<br />\nat the helm.<br /><br />\nKels finds himself at the start of a<br />\nRemit subscription fees to Treasurer, Student Activities Council, Rem- season faced with the loss of Henny<br />\nsen Hall, Postoffice, Johns Hopkins Beeler, George Packard, Don Kelly,<br />\nUniversity.<br />\nMillard Lang, Church Yearley, and<br />\nDeReynolds. ,Pete, captain-elect of<br />\nmatter<br />\nPete<br />\nsecond-class<br />\nEntered as<br />\ncember 3, 1909, at the Postoffice in the team, withdrew from the UniverBaltimore, Md., under the Act of Con- sity at the end of the first semester.<br />\ngress, November 3, 1879.<br />\nThis was a blow to Kels, who expectPublished semi-weekly from Octo- ed to build the defense around him<br />\nber to June, except during examina- this year.<br />\ntion and college holiday periods by<br />\nThe biggest disappointment, of<br />\nundergraduates of the Johns Hopkins<br />\ncourse, is the exclusive schedule. The<br />\nUniversity.<br />\nnew coach would like to see more<br />\ngames on it. Twelve wouldn't be too<br />\nEDITORIAL DEPARTMENT<br />\nStanley E. Blumberg.....Editor-in-CMS/ many.<br />\nMelvin Goldberg _Managing Editor<br />\nBut Kels is far from crying over<br />\nJesse Borden, Neal Potter,<br />\nhis first term as head coach. \"Team<br />\nAssistant Managing Editors work,\" he says, \"will be what will<br />\nSports Editor carry us through.\" He has prospects<br />\nLeonard Wallenstein<br />\nIrving Leberfe.15.<br />\nof annexing a fourth consecutive colExchange and Filing Editor<br />\nHyman M. Levin_Contributing Editor legiate title to the Jay string. And<br />\nFeature Editor in 1936 there is little doubt but that<br />\nEdgar Kemler<br />\nColumnist the sophomores on this year's team<br />\nHarold M. Kropman.<br />\nReporters<br />\nwill come through with one of the<br />\nJohn C. Brashears, Stanley M. Finkel,<br />\nBenjamin Futernick, Jewett Gold- finest aggregations to represent the<br />\nsmith, Leon Jacobson, William University.<br />\nKempton, Kenneth Zierler, Marvin<br />\nKolker, Hershner Cross, Jacob<br />\nStein, William Snyder, Howard<br />\nReizenstein, Jonas Cohen, Leonard<br />\nSpringtime Blues<br />\nJaffe, Lester H. Caplan, Bernard<br />\nHe<br />\nremarks<br />\nto his friend that spring<br />\nDiaWilliam<br />\nAdler,<br />\nPinck, Julian<br />\ncertainly must be here. Just look at<br />\nmond.<br />\nthe clear sky, and did he see the neat<br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager shoes that that girl who just passed<br />\nRay Goldberg<br />\nAdvertising Manager by was wearing? What class is next<br />\nBert Gordon_<br />\nOffice Manager on their schedule? French? Didn't<br />\nCharles Hastings<br />\nCirculation Manager<br />\nDavid Levy<br />\nhe think that French always was<br />\nboring? And besides he had already<br />\nTuesday, March 5, 1935..<br />\nread the assignment and knew what<br />\nthe lecture was going to be about.<br />\nFrat Failings<br />\nNot only that, it was so hard to doze<br />\nAnnouncement of the Annual In- off in those straight wooden chairs.<br />\nWhat if Dr. Mitchell said that evterfraternity Ball, to be held in April,<br />\nery<br />\nlecture represented a dollar of<br />\nis<br />\nstill<br />\nthere<br />\nthat<br />\nminds<br />\nour<br />\nrecalls to<br />\nan Interfraternity Board, after all. tuition? After all, the value of money<br />\nIts long silence after an apparent has decreased, and any way when<br />\ncollapse in the enforcement of the that guy lectured, you only got a barushing \"agreement\" made us wonder loney dollar's worth. And talking<br />\nif it hadn't died completely. The fra- about money, reminds him that he<br />\nternities certainly left it pretty cold. has to gather some of the _ good old<br />\nReasons given by the frats last year \"jack\" and give himself a boost with<br />\nfor the agreement on second-term the automobile dealer's daughter who<br />\nrushing seemed quite reasonable. No can't be taken for a ride. And he<br />\none could expect a naive freshman to had heard that although that Gouchoose his \"brothers for life\" without 'cher dame lived in Foster Hall, you<br />\na few months with them as well as couldn't play poppas with them.<br />\nthe University at large. The text of What? He had to hurry up or he'd be<br />\nthe agreement, together with the ex- late for French lecture? Oh well,<br />\ncuses given for its violation made it some day he'd be a senior and<br />\nseem More and more ridiculous, how- then . . .<br />\nJ. N. B.<br />\never. A set of rules, long and complex, defining \"rushing\" in all possible phases in a meticulous and rather arbitrary manner made the uninitiated chuckle at elaboratiness and<br />\nThe rights of man: When Presi\"red tape\" carried to the last degree. When this was combined with dent Dougherty refused to allow men<br />\nviolations in which the offenders and women students to sit together<br />\npleaded misunderstanding of the<br />\nat athletic contests of the Appalaagreement, it became evident that the<br />\nfrat organization vas threatened with chian State Teachers' College, Boone,<br />\na breakdown from lack of any inten- N. C., a strike was declared. The<br />\ntion on the part of some groups to strikers also demanded that men be<br />\nstick by the agreement.<br />\nallowed to date co-eds two nights a<br />\nThis year, a setting up of the date week.<br />\nto early November was arranged. Yet<br />\n0-0<br />\nthis concession to the impatience of<br />\nthe fraters brought with it a complete<br />\nUpperclassmen were requested to<br />\ndisregard for most of the rules from<br />\noffer suggestions for an introductory<br />\nnearly all sides. And nothing was<br />\ndone about it. One might have said course in social science to be given<br />\nthat here was the demise of the In- to the freshmen next year at the<br />\nterfraternity Board. But there is still Florida State College for Women.<br />\nthe social side: the fraternities can<br />\n0--0<br />\nstill hold dances, sports tournaments,<br />\nwithout<br />\nanyand smokers together,<br />\nOnly five percent of the students<br />\nbody's doing anything wrong.<br />\nentering college in the United States<br />\nThe fact of the matter seems to be do so by passing entrance examinathat the fraternities are too Machiations. The rest are admitted on cervellian in their interest and policies<br />\nto do anything for the common good, tificates -from high schools.<br /><br />\nIntercollegiates<br /><br />\neither their own or the University's,<br />\nwhen it conflicts with what the individual fraternity chooses to do, regardless of any agreements. When it<br />\ncomes to getting ahead of the fellows next to them, those of the brotherhood jump at chances as they present themselves, and wink right merrily at government.<br />\nThis failing on the part of the fraternities can not well be laid at the<br />\ndoor of any particular evil influence<br />\nof fraternities as such, we may suppose. Rather does it show itself as<br />\nmerely one manifestation of a more<br />\ndeeply rooted and serious trouble<br />\nwhich seems to have overspread the<br />\nwhole campus—an extreme social and<br />\npolitical apathy. This marked tendency of recent months is undoubtedly the factor in making the campus<br />\nother than what the students think<br />\nN. P.<br />\nit ought to be.<br /><br />\nNew Coach<br />\nThe appointment of William Kelso<br />\nMorrill as head lacrosse coach came<br />\nas a surprise to no one. The system<br />\nof co-coaching that was originally announced would undoubtedly have been<br />\na flop. A head coach was needed and<br />\nDr. Morrill was the logical man.<br />\nIt must be admitted that Hopkins<br /><br />\nOur Own Pepys<br />\nFebruary 26—<br />\nUp and amused by Mr. Edward<br />\nReilly's remarks at a meeting to<br />\nraise funds for the appeal of the case<br />\nof Bruno Hauptman.<br />\n\"I defy anyone to prove that Hauptman was even in New Jersey the<br />\nnight of the kidnapping,\" said Reilly.<br />\nThis I cannot help but feel to be a<br />\ntrifle anti-climactic, the point in question having been for all practical<br />\npurposes very effectively demonstrated some few weeks back.<br />\nSo away to the University for a<br />\nlittle, where I met with Paul who<br />\ntold me that he was no longer in<br />\nlove, that his ideals had been shattered, that his faith in human nature<br />\nwas now a negative quantity, but<br />\nthat the affair with all had been a<br />\nvery •broadening experience. It was<br />\nwith the greatest of difficulty'that I<br />\nexplained my uncontrolable mirth at<br />\nhis remarks, my own faith in human<br />\nnature, etc., having been at a very<br />\nlow ebb for some time past.<br />\nI to the library for some reading<br />\nin the mechanistic and vitalistic approaches to biological phenomena<br />\n(which topic is obviously introduced<br />\ninto these pages to show the extent<br />\nand magnitude of my learning).<br />\nReading is to serve as the basis for a<br />\ndebate on the subject. I am utterly<br />\ndeficient in biological knowledge, but<br />\nas my fellow debater, W. D., has been<br />\nassured by a most eminent professor<br />\nof the subject, that this is an asset<br />\nand not a debit, I shall not let it<br />\ntrouble me.<br />\nInterrupted by Leon bearing proudly two front pages of the American<br />\nWeekly of some time back which, he<br />\nexplained, were the gift of a learned<br />\narchaeologist. I found the association<br />\nof archaelogy with Mr. Heart's journal somewhat incongrous, but did not<br />\nmention my feeling to Leon for fear<br />\nof offending him.<br />\nSo home, and to bed early to escape the talk of a friend of the family. He is the °illy man of my acquaintance in the State who can carry on<br />\nan involved conversation by himself<br />\nwith ease. His remarks are invariably limited to the war (which he<br />\nfought from a chair in his club), the<br />\n\"Yellow Peril\" (which he sees<br />\nthrough the eyes of the equally yellow journals), and the decay of our<br />\nyouth on which I am inclined to believe he has no information at all,<br />\nhaving been born in his present senility.<br /><br />\nNEWSETTES<br /><br />\ncDEAF'DUMB AND 'BLIN'D<br /><br />\n\"KATIE, THE KITZBUEHEL COQUETTE\"—The return of the Prince<br />\nof Wales to England after a vacation<br />\nabroad was the occasion for the introduction of many new songs<br />\nthroughout Britain. It so happened<br />\nthat the heir to the British throne<br />\nhad spent his holiday in Austria, Germany, Hungary, and France, particularly at Kitzbuehel.<br /><br />\nBy HAROLD M. KROPMAN<br /><br />\nOne song in particular \"I'm Katie,<br />\nthe Kitzbuehel Coquette\" bids fair to<br />\nbecome one of Britain's most popular<br />\nsongs, though not meant to reflect on<br />\nEngland's fair sex.<br />\nHARVARD vs. YALE—A good sized<br />\nriot was almost started at the NBC<br />\nstudios last Thursday afternoon when<br />\nan announcer stepped into a room in<br />\nwhich the Yale Glee Club was rehearsing for the Rudy Vallee program and naively inquired:<br />\n\"Pardon me, but is this the Harvard Glee Club?\"<br /><br />\nAi ound Town-The Penthouse is offering two of<br />\nthe best acts to play in Baltimore<br />\nthis season. Shirley Dall, lately of<br />\nThe Vanities, is more than shaded by<br />\nthe Roddy Twins, and Budd and Eleanor Coll are sensational. If you prefer your pleasure in a cosmopolitan<br />\natmosphere, allow Lou Becker to be<br />\nyour host.<br />\nUp in New York a police order<br />\nprohibits the appearance of Fags (female impersonators).<br />\nThis recent<br />\nruling hit Harry Richman, who had<br />\nand impersonator show and a female<br />\nband.<br /><br />\nIf you like room for your dancing,<br />\ncarry your own, and don't require<br />\nmuch musical inspiration, try the<br />\nSubway on West Lexington Street.<br />\nNo cover, minimum, liquor, or crowds.<br />\nPeanut Joe has reopened his attic,<br />\nand Billy Berle, the most beautiful<br />\nimpersonator in town, who incidentally has a wife and child, entertains<br />\nto the music of a three-man band.<br />\nFern and Lorraine, who played<br />\nseven weeks at the Hi-Hat earlier<br />\nthis season, have returned to town.<br />\nDuring their absence they have appeared at the Roosevelt Grill in New<br />\nYork, and on a Bermuda cruise ship.<br />\nThey are now at the Barn.<br />\nFebruary 27—<br />\nThe Variety Club continues its ImBusy with correspondence which personator show. Bert Sherry, forhas, curiously enough, managed to get merly at the Pansy Club, and five<br />\nitself into an elaborate state of dis- others, cavort to the tunes of five<br />\ngentlemen of color.<br />\nrepair.<br /><br />\nAt this time, when the Home Concert, and Dance are soon to be presented by the Musical Club, marking<br />\nthe end of a very successful season,<br />\nI think it is only just and proper to<br />\nsee exactly who has been responsible<br />\nfor all the terrible—hard work. There<br />\nis Carson Frailey, president, who<br />\nhates the noise of bombs and dice;<br />\nJohn Murphy, vice-president, who<br />\nthinks the most of wine, women, and<br />\nsong as evidenced by his behavior on<br />\nthe Atlantic City trip; Lou Reuling,<br />\njunior business manager, who leans<br />\ntoward crooning as an art and accomplishment; and Harry Beck, business manager, who always makes the<br />\nannouncements to the NEWS-LETTER.<br />\nPlease leave all decayed vegetable<br />\nmatter and aged eggs at house, when<br />\nyou attend the concert. Their shirt<br />\nfronts have gotten dirty enough after<br />\nabout fifteen concerts.<br /><br />\n\"Losht,\" he muttered sorrowfully,<br />\n\"losht in an impen'trable forest!\"<br />\nOhioan.<br />\no—o<br />\nA sweet young thing, whose parents<br />\ndepriving themselves of things so she<br />\ncould get a college education, was<br />\ntelling of some of her experiences.<br />\nS. Y. T.—In the evenings we usually have dates and go to some lonely<br />\nspot and neck. That ain't nice' but I<br />\nlike it.<br />\nDad—A whole year in college and<br />\nyou still say ain't.—Lyre.<br /><br />\nTo the tavern in the evening and<br />\nwas merry with friends who brought<br />\nwith them a very comely maid. Talked<br />\nfor a space and was mightily attracted by the maiden who had a pleasing<br />\nmanner which, if it were not that I<br />\nknow better, I would incline to call<br />\ndifferent. Drank overmuch of the<br />\nRhenish wine which is excellent at<br />\nthe inn, and, late, paid my reckoning and took coach for home but not<br />\nbefore asking maiden for permission<br />\nto call, which was granted.<br />\nTo bed late with a pleasant glow<br />\nsurrounding me.<br /><br />\nP. S.—I don't have time to shave<br />\nin the morning. What can I do?<br />\nFuzzy Wuzzy.<br />\no<br />\nDear Fuzzy Wuzzy:<br />\nTry some of our new soap wh4ch<br />\nMarriage is a wonderful institution<br />\nso permeates the inner skin that it<br />\n—no family should be without it.<br />\nmakes the whiskers grow inwards<br />\no—o<br />\nand then all you do is bite them offKid—You've got a lot of pep for<br />\n-Awgwan.<br />\nan old geezer. How do you get that<br />\n0-0<br />\nwity<br />\nOld Timer—I ain't decided yet. I'm Little Known Facts About The<br />\ndickering with two or three of them Campus:<br />\npatent medicine concerns.<br />\nSome of the chairs used in the Gilman Hall class-rooms 'rave been there<br />\n0-0<br />\nI see by our most honorable campus since the early nineteen hundreds.<br />\nrag (Editor, please note—raise ex- This fact is substantiated by the carvpected), that Lou Reuling, president ing of the date 1908 on the arm of a<br />\nof the Junior Class, is striving to be chair in the back row, in front of the<br />\nmentioned in my \"Men Of the Week\" window nearest the door, in room<br />\nsection for his untiring efforts for his 313. Most of the chairs are more wire<br />\nclass. His latest venture is his an- than wood, anyway.<br />\nnouncement that Casa Loma's orches- Suggested Improvements:<br />\ntra can be had for the voting for the<br />\nA traffic booth for Bob, the campus<br />\nJunior Prom. I was present at the cop, snooper, plain-clothes man, and<br />\nlong distance call to Glen Gray, and woman lover, in the circle in front of<br />\nI think that John Murphy (it is said Levering Hall. He could play with the<br />\nthat he is a student here) deserves stop and go signs, keep impatient,<br />\ncredit for the efficient manner in speeding students waiting, flirt with<br />\nwhich he prompted Lou during the the women drivers, and play pitch in<br />\nadventurous ordeal of talking to New his spare time.<br />\nYork. Well, juniors, since we are beMen of The Week:<br />\nhind Reuling 100 per cent, let's talk<br />\nThe Blue Jay Fives—Siegel, Siverd,<br />\nit up and make this affair one of the<br />\nmost outstanding, talked-about af- Chancellor, Woodrow, and Ran—<br />\nfairs given by Hopkins—and we won't for their mastery of this game called<br />\nbasketball as evidenced by their perneed scandal.<br />\nformance against Maryland.<br />\no—o<br />\nStaggering down the street in unNEWS FLASH—After much needcertain terms he finally bumped into<br />\na post, fell down, got up and bumped less worrying upon the part of many<br />\ninto it again. Trying a third time he students, from a fairly authoritative<br />\nproduced the same result and again sources comes the report that the<br />\nresumed his horizontal posture. He presidential secretarial force will be<br />\nsat on the curb and shook his head. retained intact.<br /><br />\nPlopped by<br /><br />\null Pooch?<br /><br />\ne741 Old Q0/1<br /><br />\nMarch 1—<br /><br />\nUneventful day spent almost entirely in bed with a foul taste in my<br />\nmouth and a general shakiness which<br />\nI am quite at a loss to account for,<br />\n0-0<br />\nbut which may perhaps have some<br />\nwith the festivities of the<br />\nassociation<br />\nAd in the Vermont Cynic: \"Would<br />\nevening before.<br />\nthe student who took the wooden<br />\nMarch 2—<br />\ndancing man from the Fleming MuTo the University, where I was preseum auditorium before Christmas<br />\nsented with a copy of Mr. Kemler's<br />\nplease return the same?\" Looks like journalistic debauch by a member of<br />\na case of kidnapping to us.<br />\nThere was<br />\nthe NEWS-LETTER staff.<br />\ndamnation of Mr.<br />\nand<br />\npraise<br />\nloud<br />\n0---0<br />\nKemler's somewhat radical depart\"It was at a luncheon at the Uni- ure from newspaper tradition, but<br />\nversity of Minnesota recently that a both praise and damnation had a<br />\ncertain pedagogue was endeavoring rather insincere ring. In truth, it<br />\nto explain /the differences between a would • appear to an uninitiate that<br />\nuniversity and an insane asylum. The Mr. Kemler had turned the journalprofessor maintained that one had to istic clock back rather than forward.<br />\nshow improvement to get out of an It seems to me that he has sworn a<br />\ninsane asylum.\"—Swarthmore Phoe- very solemn oath to prevent the poor<br />\npublic from finding out both what is<br />\nnix.<br />\ngoing on in his own mind and what<br />\n0-0<br />\nis going on generally.<br />\nAnd so with Edward in the afterAn English examination for freshmen at Loyola was the cause for the noon who lent me a very amusing and<br />\nstartling discovery 'that \"an inciner- slightly bawdy work by Ogden Nash<br />\nator is a person who hints nasty with which I beguiled the time for a<br />\nthings instead of coming right out space.<br />\nand telling you.\"<br />\nHome, where, family being gone, I<br />\nwas obliged to care for young broth0-0<br />\ner for the evening, which I did with<br />\nA poll of women students at Mur- very had grace. And, after stormy<br />\nray State Teachers' College revealed session with young brother on questhe fact that co-eds prefer the cave tion of the bed-hour, myself to bed.<br />\n—J. C. B.<br />\nman variety to any other.<br /><br />\nDr<br /><br />\nDi<br /><br />\n0-0<br /><br />\nDear Mrs. Nix:<br />\nMy stenographer yesterday asked<br />\nme if I belonged to the House of David.<br /><br />\nFebruary 28—<br />\nGreat joy we have this day, it being the last of the month and money1<br />\nfrom the government being in sight. I<br />\nIn truth I was so cheerful during the<br />\nmorning that many of my friends inquired about the state of my health.<br /><br />\n(C<br /><br />\n5P. Lorillard Co.. Inc.<br /><br />\nWhen the Girl Friend insists<br />\nthat you romp with Rollo before you have your<br />\ntete-a-tete with her... don't let the Bow Wow<br />\nbash your spirits. Brighten up by lightin' up an<br />\nOld Gold. Its sunny-smoothness makes even dogwalking endurable. Darn clever...these 0. Gs!<br /><br />\nAT TRYING TIMES ....TRY A STinof:./A, OLD GOLD<br /><br />\nCa<br />\nsell°<br />\ntime<br />\nfifty<br />\nhe<br />\nthe<br />\nlern.<br />\n\"I<br />\nsomi<br /><br />\nor<br /><br />\nhay(<br />\nthis<br /><br />\nque<br />\nanaN<br /><br />\nhay4<br /><br />\nfess<br />\nalso<br />\nhe<br />\ntive<br /><br />\nwer<br />\nfro:<br />\nto .<br />\nMs(<br />\nTub<br />\nsecc<br />\neas(<br />\nway<br /><br />\n.11<br />\ntub<br /><br />\nflirt<br />\nand<br />\nit<br /><br />\nHOME WOOD, BALTIMORE, MD., MARCH 5, 1935.<br /><br />\nOf Congress Has<br />\nMedical Savants Plan 'Gymboree To' Library<br />\nIntercollegiates<br />\nYear<br />\nUnder New Deal<br />\nBuy Team Sweaters Busy<br />\nHold Symposium<br />\nOn Cure Of Cancer<br />\nVarsity Basketball Team Will Meet<br />\nB.A.C. As Part Of Program<br />\nAt Gym<br /><br />\nUrge Closer Cooperation<br />\nAmong Profession And<br />\nDropping Of Prejudices'<br />\n(Continued from Page 1, Col. 1)<br />\nprofessor of surgery, Johns Hopkins.<br />\nDr. Harvey B. Stone, associate prolessor of surgery, Johns Hopkins.<br />\nDr. Arthur M. Shipley, professor of<br />\nsurgery at the University of<br />\nMaryland Medical School.<br />\nCalling himself \"a member of the<br />\nschool of the knife\" and \"an oldtimer,\" Dr. Finney referred to \"my<br />\nfifty years of surgery,\" and asserted<br />\nhe does not believe that surgery or<br />\nthe X-ray will solve the cancer problem.<br />\n\"I believe the solution will be in<br />\nsome chemical agent either injected<br />\nor applied,\" Dr. Finney said. \"We<br />\nhave only scratched the surface of<br />\nthis cancer question. There are many<br />\nquestion that have yet to be ananswered.<br />\nChristie Speaks<br />\nDr. Christie's theme was that there<br />\nhave been encouraging signs of an<br />\nimproved attitude of the medical profession toward radiation therapy. He<br />\nalso emphasized his conviction that<br />\nhe was highly doubtful of the effec2<br />\ntiveness of high-voltage machines.<br />\nDi. Adair pointed out that there<br />\nwere 128,475 known deaths last year<br />\nfrom cancer and that it is reasonable<br />\nto believe there are about 260,000<br />\neases of the disease in this country.<br />\nTuberculosis, which formerly held<br />\nsecond place in the list of fatal diseases, has slipped to sixth place, givway to cancer.<br />\nAs the people were educated in<br />\ntuberculosis, he said, they must be<br />\nfurther educated in cancer prevention<br />\nand caution. Such education so far as<br />\nit has progressed, he added, has<br /><br />\n(Continued from Page 1, Col. 6)<br />\none of the ring skirmishes, with<br />\nJohnny Stevens and Tommy Dukehart paired in another.<br />\nTwo standout matches are listed on<br />\nthe mat program. The first of these<br />\nfigures to produce grim grappling on<br />\nthe part of Phil Hartman and Capt.<br />\nCrox McDaniels of the Varsity team.<br />\nAlthough McDaniels, a 155-pounder,<br />\nwill outweigh his opponent by 20<br />\npounds, the latter is a finished performer and boasts of an undefeated<br />\nrecord this year.<br />\nA striking contrast will be afforded<br />\nby the following match, which will<br />\nwitness a return performance of the<br />\nEareckson brothers of the Y. M. C.<br />\nA. They are scheduled to repeat their<br />\nhilarious take-off on the professional<br />\ntoe-twisting tribe, which proved so<br />\npopular at the gym inauguration exercises.<br />\n.<br />\nBetween the halves Gardner Hill<br />\nwill entertain with an exhibition of<br />\ngymnastic skill.<br />\nshown effects, and the largest group<br />\nof cancer patients now applying for<br />\ntreatment are still in the operative<br />\nstage. There are concrete evidences of<br />\npatients \"showing up earlier than before.\"<br />\nNeed Definite Diagnosis<br />\nOne must have a definite diagnosis<br />\nbefore starting treatments, he continued, and there is little excuse for<br />\nthe surgeon to proceed without such<br />\na diagnosis, with the modern methods<br />\nhe has at hand.<br />\n\"Surgeons should welcome anything<br />\nthat will aid them in eradicating this<br />\ndisease,\" Dr. Adair emphasized.<br />\nDr. Shipley, while urging cooperation, warned both surgeons and radiologists against their own enthusiasms.<br />\nFollowing the meeting a buffet supper was served.<br /><br />\nS.A.C.Cards Provide Press<br />\n$1 Seats For Concert<br /><br />\nCongressmen Demanded Books At<br />\nA manual has been published at<br />\nRecord Rate During Year<br />\nMarshall College for the purpose of<br />\nJust Past<br />\ninstructing professors how to act before a class.<br />\nThe New Deal has given the Lio—o<br />\nbrary of Congress its busiest year.<br />\nAccording to the Mercer Cluster,<br />\nThe library's annual report revealed<br />\nWilliam Shakespeare was declared<br />\nthat members of Congress boned up<br />\nineligible for football last- year bein books at a record rate during 1934.<br />\ncause he flunked in English.<br />\nThe report also pointed out that reo—o<br />\nearching officialdom filled every crack<br />\nThe mail at the Florida State Coland cranny of the great library and<br />\nextra chairs and tables were put in lege for Women increased ten-fold on<br />\nSt. Valentine's Day.<br />\nwherever possible.<br />\no—o<br />\n\"Requests relating to President<br />\nThe New York University's BulleRoosevelt and the new powers deletin, in an editorial, asked for the regated to him were so numerous,\" the<br />\nturn of commercialized football at<br />\nlibrary reported, \"that we found it<br />\nthe university.<br />\nnecessary to prepare the following<br />\no—o<br />\nlists, which have been in great deThe staff of the Carnegie Institute<br />\nmand: 'Franklin Delano Roosevelt,<br />\nof Technology sent a valentine to the<br />\nPresident of the United States,' and<br />\nCouncil reading: \"To the guys who<br />\n'Constitution Powers of the President<br />\nsit up front and fuss. From the guys<br />\nof the United States, Including Powwho sit downstairs and cuss.\"<br />\ners Recently Delegated.'\"<br />\no—o<br />\nJapanese Prince Studies Up<br />\nStudents at the University of MisPrince Fumimaro Konoye, presi- souri who were in the hospital<br />\nbut<br />\ndent of the House of Peers of Japan, could write had to take the<br />\nmid-year<br />\nwas reported to have become much exams.<br />\ninterested in the NRA on his recent<br />\n0-0<br />\nvisit to the Washington. The library<br />\nAttendance at the Harvard Univergave him a five-page list of refersity chapel averaged 63 daily durences on the subject.<br />\ning the past year.<br />\nConsumers, cosmetics, crippled chilo—o<br />\ndren, alcoholic beverages and the<br />\nEnrollment at Los Angeles Junior<br />\nchild-labor amendment were among College was so large this year that<br />\nthe hundreds of topics on which the police reserves had to be called. out<br />\nlibrary prepared mimeographed book to keep the students in line during<br />\nlists for researchers.<br />\nregistration.<br /><br />\nMusilal Club Show Will Be Held<br />\nAt Maryland Casualty Clubhouse On March 15<br />\n(Continued from Page 1, Col. 4)<br />\nGlee Club, the organization has grown<br />\nuntil now it numbers about 90 members.<br /><br />\nAlso included in the .orga.niza-<br /><br />\ntipn is the 16-piece Blue Jay Orchestra.<br /><br />\nThe directors are Conrad Geb-<br /><br />\nellen and Oz Steinwald.,<br />\nPresent Officers Listed<br />\nCarson G. Frailey is president of<br />\nthe group. Other officers include:•<br /><br />\nCREDITS ...both<br /><br />\nacademic and HUMAN<br /><br />\nNooney Book Shop<br />\n1902 N. CHARLES STREET<br />\nGREETING CARDS —<br />\nLENDING LIBRARY<br />\nOpen Evenings<br /><br />\nCHARLIE<br /><br />\nFIRST CLASS LAUNDRY<br /><br />\nTheodore's Barber Shop<br /><br />\n(Continued from Page 1, Col. 4)<br />\nell decided to have a little fun with<br />\nDoc.<br /><br />\n3224 GREENMOUNT AVE.<br />\nButtons Sewed On, Stockings<br />\nMended, and all Seeded Repairs<br />\nAt No Extra Charge<br /><br />\nFormerly with EhilL CATE<br />\nS. W. Cor. St. Paul and 33rd Streets<br />\nNext to Birely's<br />\n8 A. M. to 8 P. M.<br /><br />\n\"Mr. Reizenstein,\" he said, \"before<br />\nyou came in we were talking about<br />\nMarc Anthony and Cleopatra. Would<br />\nyou rather hear about them, or about<br />\nthe situation in Detroit?\"<br />\nDoc shrugged his shoulders and inquired in a naive manner,<br />\n\"What's in Detroit?\"<br /><br />\nI<br /><br />\nPeabody Pharmacy<br /><br />\nFOR CLEANING, DYEING and<br />\nPRESSING—Reasonable Rates<br />\nWe Call For and Deliver<br /><br />\nCALVERT and 30TH STS.<br />\nFirst in Quality — First in<br />\nService<br /><br />\nCH. 9849<br /><br />\nNo delivery too small. Bel.<br /><br />\n•<br /><br />\nLUCKLES<br />\nCENTER LEAVE<br /><br />\n744i<br /><br />\nexpensive center leaves. That's<br />\nwhy I'm milder. That's why I<br />\ntaste better. Notop leaves,unripe<br />\nand stinging;no bottom leaves,<br />\ncoarse and sandy,are permitted<br />\nto destroy my uniform mildness<br />\nand good taste. I'm your best<br />\nfriend.I am your Lucky Strike.<br /><br />\nCENTER LEAVES<br />\nU THE MILDEST SMOKE<br /><br />\ng Beth<br /><br />\ndo/<br /><br />\n5311<br /><br />\nstudy in MOSCOW—and PLAY as well.<br />\nA momentous opportunity! Last year students and graduates of 60 universities from<br />\n20 states and 4 foreign lands enrolled in<br />\nthe Anglo-American Section of Moscow<br />\nUniversity . . traveled and lived as<br />\nthey learned!<br />\nRegistration now open 1935 session July<br />\n16-Aug. 25. Instruction in English by Soviet faculty<br />\n12 courses surveying contemporary Soviet life. University credit<br />\nAmerican Advisory Organizapossible.<br />\ntion: Institute of International Education<br />\nWrite for booklet JH-3<br /><br />\nEDUCATIONAL DEPT.<br />\nINTOURIST, Inc.<br />\n545 Fifth Ave., New York<br /><br />\nWhen strangers meet<br />\nI break the ice<br /><br />\nYou like me best because I am<br />\nso mellow, rich, flavorful. She<br />\nchooses me in preference to<br />\nother cigarettes for another<br />\nreason; because I am so mild<br />\nand easy on her throat. But you<br />\nboth prefer me because I am<br />\nmade exclusively from fragrant,<br /><br />\nMOSCOW<br /><br />\n•<br />\nFree Manicuring<br /><br />\nFRIED'S<br />\n'101 E. 21st St.<br /><br />\n(Continued from Page 1, Col. 2)<br />\nment of his scholarly inspiration and<br />\ncouncil.\" The volume was edited by<br />\nCharles G. Haines and Marshall E.<br />\nDimock, and the essays were written<br />\nby Frank G. Bates, Marshall E.<br />\nDimock, John A. Fairlie, Charles<br />\nGrove Haines, James Hart, Milo R.<br />\nMaltbie,<br />\nThomas<br />\nReed<br />\nPowell,<br />\nGeorge W. Spicer, and Charles C.<br />\nThach.<br /><br />\nAnother publication was An Indiscretion<br />\nin the Life of an Heress,<br />\nEdward Hatfield, Jr., and John L. V.<br />\nthe lost novel of Thomas Hardy, now<br />\nMurphy, vice-presidents; Bert G. Canprinted for the first time in America<br />\nnon and Louis E. Reuling, junior bus- and edited with an introduction and<br />\niness manager; and Henry Fenster- notes by Carl J. Weber. The Juristic<br />\nwald, student director of the Blue :Status of Egypt and the Sudan by<br />\nJays. Besides Beck, the business staff Vernon A. O'Rourrke, and several<br />\nseveral journals were also published<br />\nincludes James Beck, John Canning,<br />\nduring the past month.<br />\nBrian S. Murphy, and Roger Vincent.<br />\nThe entire club performed at the<br />\nPhoenix Club on Eutaw Place, last<br />\nSunday and at the St. Mark's M. E.<br />\nChurch, Garrison Boulevard and<br />\nLiberty Heights Ave., Friday, Mach 1.<br /><br />\nLifeOnTheCam pusBreaks<br />\nIts Slow Measured Step<br /><br />\nDER<br /><br />\nAnnounces<br />\nWorks Printed In<br />\nRegime OfDr.Ames<br /><br />\nCopyright 1935.<br />\nThe American Tobacco Company.<br /><br />\n4<br /><br />\nHOME WOOD, BALTIMORE, MD., MARCH 5, 1935.<br /><br />\nChamps Picked<br />\nIn Frosh, Soph,<br />\nSenior Classes<br /><br />\nTennis Meeting Thursday<br />\nFollowing Thursday's assembly,<br />\nthere will be an organization meeting of the tennis team. All returning players and new candidates for<br />\nthe team are requested to be present.<br /><br />\nJays To Meet Jay Matmen<br />\nTerp Quintet Defeated In<br />\nIn Final Game Home Meet<br /><br />\nN. J. All Stars, Senior Chemists, Soph Mechanics<br />\nWin In Court Games<br /><br />\nGeorge Darley's Dribblers At Blue Grunters Lead Until<br />\nHofmeister To<br />\nCollege Park Tomorrow;<br />\nFinal; Hale Pins BeachOut<br />\nAvenge<br />\nTo<br />\nDefeat<br />\nley To Win Meet<br />\nBecome First<br />\nTo Play Each Other<br />\nTennis Coach<br />\nInter-Class Champion Five Schedule Completed Includes<br />\nTo Vie With Frat Win7 Home Matches, 7 Away;<br />\nner For School Title<br />\nFrosh To Have Team<br /><br />\nA winning fall in the heavyweight<br />\nIn their final intercollegiate contest of the current basketball season, class, the last match of the evening,<br />\nGeorge Darley's dribblers hit the gave the Haverford College wrestlers<br /><br />\nhighway for College Park tomorrow a 14 to 12 victory over the Jay matmen Saturday at the gym.<br />\nnight.<br /><br />\nIntercollegiate<br />\nHandball<br /><br />\nJay Natators Bov<br />\nTo Delaware Here<br /><br />\n1••••••<br /><br />\nAt the conclusion of the playoffs of the handball tournament<br />\nnow in progress, a team will be<br />\nselected to represent the Hopkins<br />\nin intercollegiate competition.<br />\nMatches have been arranged<br />\nwith University of Virginia, St.<br />\nJohn's, Baltimore Athletic Club,<br />\nand the second teams of the Y. M.<br />\nH. A. and Y. M. C. A., according<br />\nto Reuben Baer, head of the handball league. The dates of these<br />\ngames have not been decided definitely as yet.<br /><br />\nLose To Blue Chicks In Final Meet<br />\nBy Score Of<br />\n43-32<br />\nOvercome by a superior and better<br />\nbalanced aggregation, the Jay Rata<br />\ntors made a valiant showing but<br />\nbowed to Delaware in the final meet<br />\nof the season last Saturday night<br />\nThe encounter, which took place at<br />\nthe K. of C. pool, was rather clos<br />\nthroughout, although the Blue Chic<br />\ntook the lead from the opening event,<br />\nwinning by the score of 43-32.<br /><br />\nHazlett Wins Breaststroke<br />\nThe skill of Al Hale, Haverford by a time advantage. Matters were<br />\nOnly a week ago the Terps met the<br />\nBill Hazlett captured the Black an<br />\nJays here in one of the best played heavyweight, shattered the Hopkins settled by the heavyweight match in<br />\nLast week marked the completion<br />\nBlue's only first place when he led<br />\nAccording to an announcement tilts of the year, Maryland winning lead and won the final match with curred.<br />\nof the series of basketball games to<br />\nthe field home in the 200-yard breastmade by Dr. G. Wilson Shaffer Friwith a driving finish, 41-35. Since Bob Beachley. Hale pulled a Frank<br />\nLotz, Naylor Box<br />\ndetermine the class championship day, Jean Hofmeister, ranking city<br />\nstroke, returning 2:50.5. Bill Bishop,<br />\nMerriwell. Before this match the JayAfter the wrestling matches, Ed another Hopkins swimmer, secured<br />\nfive with the New Jersey All Stars, and state netman, will coach the ten- then the boys on ,the Washington<br />\nmen were on the long end of a 12 to 9<br />\nSophomore Mechanics, and Senior nis team. This is the first year since highway have drcppc,1 a game to<br />\nLotz, coach of the Jay boxers, and the runner-up position. Lou Adler led<br />\nscore. A time advantage would have<br />\nthe Jays in point scoring with six<br />\nChemists emerging victorious at the the origin of a tennis team at the St. John's, 24-17. The wild playing of<br />\nDon<br />\nNaylor, undergraduate, put on a<br />\ntied the score, a fall was necessary<br />\nmarkers as a result of second places<br />\nhead of their respective leagues. The Hopkins that a coach has been em- the Terrapins in this latter fracas has<br />\nto win. The Pennsylvania proceeded two-round boxing exhibition.<br />\nin the 50 and 100-yard dashes.<br />\njunior champs were decided prior to ployed. Hofmeister will work out<br />\ngiven Hopkins high hopes of revenge to the mat and after 6 minutes and<br />\nThe summary of the wrestling<br />\nlast week when the Junior Gas Engi- with the team regularly.<br />\nCarey and Croes were outstanding<br />\n25 seconds of grunting and growling<br />\nin<br />\ntheir second meeting.<br />\nneers made off with the laurels.<br />\nAlthough the Blue racquet wielders<br />\nfor the visitors, as both competitors<br />\nmeet:<br />\nemerged the victor, pinning BeachWaters, Star<br />\ncaptured two events. Carey won the<br />\nTo win the frosh championship, are without Captain Bunny Brooke,<br />\nley's shoulders to the mat with a bar 118-Pound Class—Hoffman, Hopkins,<br />\n100 and 220-yard swims, defeating<br />\nCoach Burton Shipley will probably<br />\nthe New Jersey team defeated Cas- Babe Ladensky, and Mort Palitz this<br />\nand hammerlock.<br />\ndefeated Frysinger. Time advan- L. Adler and<br />\nNoonan in the former<br />\ntelle's Musicians by a score of 27 to year, there are some capable veter- start Al Waters, the best shot on the<br />\ntage, 1th. 5s.<br />\nJays Have Early Lead<br />\nand nosing out Eddie Scheer in the<br />\n17. The Sophomore Mechanics won ans returning from last year's team team, and Bill Andorka<br />\nat the forThe Blue grapplers were off to a 126-Pound Class—Rivers, Haverford, longer race. Croes was victorious in<br />\nthe Soph championship by virtue of and several able newcomers. Captain<br />\nard posts. Vic Willis, younger brother flying start when Joe Hoffman<br />\nSiverd,<br />\nNat<br />\nearned<br />\nGoldberg,<br />\ndefeated Gelber. Time advantage, the 50 and the 150-yard breaststroke.<br />\nCarl<br />\nHartman,<br />\na 19 to 11 victory over the SophoIn the dorsal event he was puab.ed by<br />\n2m. 10s.<br />\nmore Gasmen, while in the senior George Buck, and Henry Kramer form of the Empire State Building, is the first Hopkins points by a time<br />\nDan Weiner and John MacGill, both<br />\nleague, the Senior Chemists defeated the nucleus of this year's team, while slated for the pivot job. Bill Guckey- advantage over Dan Frysinger in the 135-Pound Class—Hartm<br />\nan, Hopkins,<br />\nBlack and Blue natators. Bud Adler<br />\nthe Senior Businessmen to the tune Jerry Branower, Carl Rasin, Tom son and Norwood Sothoron, both 118-pound class. Joe Rivers of Havdefeated Skinners. Time advantage,<br />\nerford put both teams on an even<br />\nobtained a second in the 444)-yard•<br />\nConnor, Lamed, and Jerry Tillman<br />\nof 34 to 17.<br />\nnatural athletes and All-Southern<br />\n4m. 58s.<br />\nfooting by defeating Julie Gelber.<br />\ngrind, while Bill Koenig was runnerloom<br />\nas<br />\nfirst<br />\nclass<br />\nsupporting<br />\nmateQuint To Compete In Series<br />\nbacks, will team up as guards.<br />\nrial.<br />\nPhil Hartman, crack 135-pounder, 145-Pound Class—Blanc-Roos, Haver- up in the diving.<br />\nEach class championship quint will<br />\nThe usual line-up will represent the having removed his shoes and socks,<br />\nford, defeated Waters. Time advanInstead of the customary Jay Vee<br />\ncompete in a series, the winner of<br />\ntage, 8m. 3s.<br />\nteam there will be a freshman team, Blue team. Herbie Siegel, high scorer earned enough time advantage to<br />\nPhone Belmont 7908<br />\nwhich will play the leader of the frawith several matches both home and in the first Jay-Terp tilt, and Captain whip Skinners. In the 145-pound class 155-Pound Class—McDaniels, Hopternity league. Each member of the<br />\naway. Already a match has been arkins, defeated Weitzenkorn. Time<br />\nCliff Siverd, forwards; Opie Chancel- Captain Rene Blanc-Ross had little<br />\ninter-class championship team will be<br />\nranged with Episcopal High at WashSt. Paul at 33rd Street<br />\ntrouble in taking a time advantage<br />\nadvantage,<br />\n5m. 45s.<br />\nawarded a medal.<br />\nlor, center; and Carl Rasin and Harry<br />\nPrescriptions-School Supplies-Candy<br />\nington. Candidates for both teams will<br />\nover Somerset Waters, although Wa165-Pound Class—Clautice, Hopkins,<br />\nAlso, four all-star basketball teams, begin indoor practice in the gym with- Woodrow, guards.<br />\nCigars - Unexcelled<br />\nters did well to avert a fall.<br />\nFountain Service<br />\ndefeated Pensye. Time advantage,<br />\neach representing a class, will meet in the next ten days.<br />\nIn the first game with Maryland<br />\n•<br />\nCaptain McDaniel and Eddie Clau6m.<br />\nin a series to decide the championVarsity manager Wallenstein has no substitutions were made. How- tice encountered little<br />\ntrouble in their<br />\nship of the college. Members of the arranged a well-rounded schedule<br />\nmatches with Joe Weitzenkorn and 175-Pound Class—Hires, Haverford,<br />\nvarsity quint will be eligible to play which includes matches with Navy, ever, George Margolis, Harold ZheutJ. H. FURST CO.<br />\ndefeated Barnett. Time advantage,<br />\nDan Pensye, respectively. Both of<br />\non the stellar fives of their respective Lehigh, Rutgers, Harvard, and Tem- lin, Jerry Branower, and Len Rubin6m. 10s.<br />\nthe Hopkins men winning by a time<br />\nPrinters of<br />\nyears.<br />\nple. In all the team will have four- ger will probably make the trip to see advantage.<br />\nCharley Barnett was Heavyweight Class—Hale, Haver- PHILOLOGICAL and SCIENTIFIC<br />\nThe line-ups:<br />\nteen contests, seven to be played at who can score the most between the successful in keeping<br />\nPUBLICATIONS<br />\nDick Hires<br />\nford, threw Beachley with bar and<br />\nN. J. ALL-STARS<br />\n112-20 HOPKINS PLACE, BALTIMORE<br />\nhome, and seven to be played away. halves.<br />\nMUSICIANS<br />\nfrom gaining a fall; however, he lost<br />\nhammerlock in 6m. 25s.<br />\nPinck<br />\nF<br />\nErlanger<br />\nIsraggis<br />\nF<br />\nGoldman<br />\nGiacinto<br />\nC<br />\nSonneborn<br />\nRosenthal<br />\nG<br />\nLloyd<br />\nRoyster<br />\nG<br />\nDowell<br /><br />\nBirely's Pharmacy<br /><br />\n1<br /><br />\nMECHANICS<br /><br />\nBottom<br />\nDickler<br />\nGalloway<br />\nBuck<br />\nLeigh<br /><br />\nGASMEN<br /><br />\nF<br />\nF<br />\nC<br />\nG<br />\nG<br /><br />\nWiseman<br />\nDeitz<br />\nStollberg<br />\nHoffman<br />\nGlasser<br /><br />\n•<br />\nBUSINESS<br /><br />\nCHEMISTS<br /><br />\nHager<br />\nTillman<br />\nClark<br />\nBuck<br />\nGamse<br /><br />\nF<br />\nF<br />\nC<br />\nG<br />\nG<br /><br />\nMerson<br />\nTurner<br />\nRobinson<br />\nMcGreevy<br />\nColgan<br /><br />\nLilly To Address<br />\nCounseling Class<br />\nAthletic Director At Polytechnic Will<br />\nSpeak To Afternoon Group; Night<br />\nClass To Hear Baer<br /><br />\n;<br /><br />\n:.:e.p.•:;:•:•:•<br /><br />\nAt the regular meeting of the class<br />\nin camp counseling to be held tomorrow at 4.15 p. m. in Gilman 312, William S. Lilly III, director of athletics<br />\nat the Baltimore Polytechnic Institute, will be the speaker.<br />\nThe night class will be addressed<br />\nby Reuben Baer, head of the counseling course, who will speak on \"The<br />\nCounselor.\" The class will take place<br />\nat 7 p. in. in Gilman 205. Visitors are<br />\nwelcome.<br /><br />\nAviation Club Plans To<br />\nReorganize Completely<br />\nA complete reorganization of club<br />\nprogram and activities will be effected at the next meeting ef the<br />\nAviation Club to be held Wednesday,<br />\nMarch 6, at 4 p. m. in the Student<br />\nActivities office.<br />\nDuring the meeting Grahame Duce,<br />\npresident of the club, will present for<br />\nexamination 150 photos of hereto unphotographed United States military<br />\naircraft. All members are urged to<br />\nattend the meeting.<br /><br />\nChessmen Tie Poly<br />\nLast Wednesday the freshman chess<br />\nteam played host to the Poly chessmen in a league match, which rcstulted in a deadlock, 21/<br />\n2 to 23'2•<br />\nSkinner was defeated by Ghent;<br />\nTampico lost to White; Witow won<br />\nover Altoff; Harris checkmated Glushakow, and Levie drew with Shoemaker.<br /><br />\nr,<br /><br />\nr<br /><br />\n. ••<br /><br />\n4<br /><br />"}], "field_media_file": [{"target_id": 38916, "display": null, "description": null, "target_type": "file", "target_uuid": "cbb52098-a5ac-4d7f-8503-dba07a034d59", "url": "http://digital.library.jhu.edu/system/files/2022-03/12593-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12593, "target_type": "node", "target_uuid": "25fed55a-8e8f-4ee9-9e37-94b63ff4d715", "url": "/node/12593"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "a8903b56-668d-4352-be70-78580ac66c2f"}]}