{"mid": [{"value": 39498}], "uuid": [{"value": "5fc784cf-e5bd-490b-815d-07269e62dca0"}], "vid": [{"value": 39498}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T19:35:41+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "14008-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T19:35:41+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T19:35:41+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": ".1.-7te Death of the American<br />\n<br />\npage 4<br />\n<br />\nthe johns hopktns university<br />\nNor<br />\n<br />\nLXXIV, No. 22<br />\n<br />\nTuesday, Feb. 24, 1970, Homewood, Baltimore<br />\n<br />\n74th Year<br />\n<br />\nFinch Highlights 94th Commemoration Day<br />\nBy PETER HARNIK<br />\nA near-capacity crowd filled Shriver Hall<br />\nYesterday afternoon to witness Commemoration<br />\nDay activities celebrating the 94th anniversary<br />\nof the founding of the University.<br />\nHighlighting the activities, in reverse order<br />\nof occurrence, were: a panel discussion among<br />\nSecretary of Health, Education and Welfare,<br />\nRobert Finch, President Andrew Cordier, of<br />\nColumbia and Professor of Psychology Kenneth<br />\nB. Clark, on \"The University in the Nation's<br />\nService\"; the induction of new members in the<br />\nJohns Hopkins Society of Scholars; and a Student Council-sponsored mini-demonstration on<br />\nthe subject of University Governance.<br />\nDespite the presence of Secretary Finch,<br />\nthe tone of the panel discussion was one of concern rather than of politics, and its format stuck<br />\nclosely to the concept of the University's 'service<br />\nPotential.' In his opening remarks, however,<br />\nPresident Gordon did give an indication of how<br />\nHealth, Education and Welfare Secretary, Robert Finch<br />\nclosely the modern university is tied to the<br />\nnation's political directions.<br />\nproblems. \"It is partly a reaction to Viet Nam,\"<br />\nUsed To Contribute<br />\nhe said, although he denied that the answer<br />\n\"The reason that Mr. Finch was not award- lay<br />\nin ignoring everything outside our own bored an honorary degree,\" the President explained,<br />\nders. Our present position is an example, he<br />\n\"is that his department used to contribute large<br />\nsaid, of \"excessive international fatigue, and the<br />\nsums of money to universities, and he felt that<br />\nimmaturity of our nation that we expect gratiit would not be right\" to accept such a degree<br />\ntude from the nations we help.\"<br />\nfrom Hopkins. Few in the audience missed the<br />\nHowever, he claimed, \"universities can<br />\nimplication.<br />\nbring vibrant objectivity to the international<br />\nEarlier in the afternoon, Drs. Cordier and<br />\nscene, and thus give a proper balance to domesClark had received honorary Doctor of Laws detic and foreign commitments. Universities can<br />\ngrees, conferring upon them the distinction of<br />\nplay a vital role in finding solutions to world<br />\nbeing honorary alumni of Johns Hopkins.<br />\nThe panel discussion, which in effect work- problems and act as catalysts in reducing tensed out to be a presentation of three statements ions,\" he concluded.<br />\nDomestic Needs<br />\nfollowed by a brief question-and-answer period,<br />\nAlthough<br />\nnot<br />\nspecifically contradicting<br />\ncentered upon the university's adaptability in a<br />\nhim,<br />\nboth<br />\nClark<br />\nand<br />\nFinch spent their allotted<br />\nrapidly-changing world.<br />\ntimes<br />\non<br />\nthe<br />\ndiscussion<br />\nof domestic needs and<br />\nDr. Cordier, a political scientist, spoke aproblems,<br />\nand<br />\nhow<br />\nthe<br />\nuniversity can help.<br />\nbout the university's potentials in the field of<br />\nClark<br />\nsaying<br />\nbegan<br />\nby<br />\nthat,<br />\nalthough univerforeign affairs. In 1945, he said, the U.S. rapidsities<br />\nhave<br />\ntended<br />\nto<br />\nbe<br />\n\"monastic\"<br />\ninstitutions,<br />\nly and emphatically assumed a new role in world<br />\nthe<br />\nrise<br />\nof<br />\npublic<br />\neducation<br />\nin<br />\nthis<br />\ncountry<br />\nhas<br />\npolitics. \"Now after 25 years, Ave are involved<br />\nbecome<br />\n\"monument<br />\na<br />\nto<br />\nthe<br />\npotential<br />\nand<br />\nactin a re-examination of that role. Both at home<br />\nual greatness of American democracy.\" He exand abroad we are facing major challenges.\"<br />\nplained,<br />\nhowever, that the change from financial<br />\nCordier also spoke of the growing tendency<br />\nselectivity<br />\nto intellectual selectivity did not refor intellectuals to steer away from the interall<br />\nof<br />\nsolve<br />\nthe problems inherent in the educanational scene in favor of this country's internal<br />\ntional community.<br />\n\"The change by dissidents that there is no<br />\n'relevance' today is not true. Colleges have<br />\nmade relevant, pragmatic contributions in all<br />\nfields. The major disadvantage, though, to our<br />\nsystem is that it has still remained isolated.<br />\nLittle regard has been given to fundamental<br />\nLhuman values.\"<br />\n\"Our educators,\" he continued, \"have precipitated an existential crisis in our younger<br />\ngeneration. The meaning of life—in the durable<br />\nsense—has not beeh adequately called into question. We are suffering from the consequences<br />\nof success, though an incomplete success.\"<br />\nClark's closing statement, \"We must find<br />\nsome way to make democracy substantively,<br />\nrather than verbally, desirable,\" drew loud, sustained appluase from the audience.<br />\nDr. Andrew Cordier, President of Columbia<br />\nSecretary Finch opened his talk by compix by hoffmann<br />\n<br />\nmenting that Hopkins has traditionally been an<br />\n\"iconoclastic institution.\"<br />\n\"We must face up to the fact,\" he said,<br />\n\"that 70% of the nation's population is living<br />\non approximately two percent of the land. The<br />\nurban university generally finds itself in the<br />\nmidst of this group, one which is growing and<br />\nwhich has ever-rising expectations.\"<br />\n\"The university is forced to be an employer, a landlord, and a teacher, and is thought of<br />\nby its students as mother, cop, and governmental<br />\nauthority. All this is compounded by the fact<br />\nthat it tends to be white in a non-white neighborhood.\"<br />\n\"New Arrangements\"<br />\nFinch emphasized that \"new institutional<br />\narrangements\" would have to be made soon if<br />\ninternal harmony is to be attained. \"How do we<br />\nget more doctors and more secondary school<br />\nteachers? My department's estimates are that<br />\nwe need 200,000 more doctors to provide the<br />\nnation with non-discriminatory medical services.<br />\nAs it is, 40% of our country's medical profession<br />\nis trained overseas. We should be exporting, not<br />\nimporting, doctors.\"<br />\nFinch summed up by explaining the in-<br />\n<br />\nDr. Kenneth Clark, Professor of psychology at CCNY<br />\n<br />\nherent duality of the university's position. \"We<br />\nask so much of the modern university—that it<br />\nserve government, business, the community, the<br />\nindividual and many others—that there is an unavoidable tension between the necessary degree<br />\nof isolation and the forced amount of participation.\"<br />\nEarlier in the afternoon, eleven new members were inducted into the University's twoyear-old Johns Hopkins Society of Scholars.<br />\nThe society, the only one of its kind in the<br />\nnation, inducts former postdoctoral fellows at<br />\nHopkins who have gained marked distinction in<br />\ntheir fields.<br />\nThe S.C.-sponsored demonstration which<br />\ntook place outside as the proceedings began,<br />\ncentered around a petition- drive which demanded that the General Assembly join with the students in establishing a new representative governing body for the Homewood campus. Approximately 30 students took part without incident.<br />\n<br />\n\fPAGE 2<br />\n<br />\nNEWS—LETTER<br />\n<br />\nFeb. 24, 1970<br />\n<br />\nviewfrom here Dope Politics Long Time<br />\nComin'l<br />\nBy D. TEUFELSDROCKH<br />\nThere has been a lot of shit flying around lately to the<br />\neffect that the Maryland House of Delegates (God Bless<br />\nThem)is all set to legalize dope,or at least really reduce<br />\nthe penalties, or something good anyway. What a fine<br />\ndaydream. Smoking dope with impunity, leering smugly .<br />\nas you blow smoke at the man, etc., etc.<br />\nAnd, unlike most of the wishful-thinking rumors that<br />\ngo around, this one even has a vague foundation in reality.<br />\nPretty vague, though. After a very hot summer (30 and<br />\n40 busts a month), there has been a noticeable decrease<br />\nIn cannabis busts. The logical imputation is correct - Mandel, after making his point, has ordered the Baltimore<br />\nPolice (who are under his direct control,not the Mayor's)<br />\nsuspend grass and hash raiding.(That,by the way, does not<br />\nmean that if you get caught holding by accident you're off<br />\nthe hook. You're busted.) A local political personality<br />\neven asserted that Mandel is surreptitiously backing the<br />\nliberals on the issue in Annapolis.<br />\nAnd here's the scoop-dope actually is an issue in Annapolis. Not much of an issue, to be sure. The opposition<br />\nis just about sure to blast it somewhere up into the<br />\n1990's.<br />\nJust for the record, though, there are three bills prefiled for the 1970 session of the General Assembly. The<br />\nmost tepid of all is the usual deal about how more research<br />\nshould be done on the subject.(sounds like one of those<br />\ncautious editorials in Time, yes?) To this end, Delegate<br />\nJacobson is the sponsor of a bill \"to request that the State<br />\ncooperate with the Federal Government in the funding and<br />\ndevelopment of research programs concerning marijuana<br />\nand hashish.\" Very big deal.<br />\nOne guy, Sen. Stone by name, wants to give methadone<br />\nto smackheads. A more promising bill, filed by Senator<br />\nBishop, provides that under certain circumstances, a<br />\n<br />\nEdward J. Bagley, State Senator from Prince Georges County.<br />\njudge may exercise the option to reduce the charge to a<br />\nmisdemeanor.(Now, it's a felony, with a mandatory sentence).<br />\nThe most radical bill of all, and oddly enough, the one<br />\nwith the best chance of getting passed, was prefiled in<br />\nDecember by one Del. Edward J. Bagley(D.,Prince Geo-<br />\n<br />\nrge's County). Seems Prince George's (a more-thanaverage wealthy suburb of Washington) was getting a little<br />\nuptight about all these nicemiddleclass kids getting shafted. Charity starts in the home.The bill provides that \"the<br />\npossession and use of marihuana shall be a misdemeanor...<br />\n(and) providing penalties therefore.\" The penalties,I was<br />\ninformed, were $250 and/or 6 months for first offenders,<br />\nand double penalties for subsequent offenders.<br />\nOn the whole, not a bad deal. For the time being, anyhow. And the best thing is that Bagley's bill has support<br />\nIn the General Assembly. Maybe, even the Governor's.<br />\nOutasight! Utopia dawning.<br />\nDon't believe it for a minute. That bill is going to get<br />\nstomped, like a cockroach. The atmosphere in the Assembly is about as paranoid as it can get. One Delegate<br />\nGerald J. Curran, reportedly made a speech against a<br />\nbill to lower the age at which one may sell his blood<br />\nwithout parental consent from 21 to 18, asserting that<br />\nyoung people would use the money to buy illegal drugs.<br />\nThe bill to lower the voting age will probably get fewer<br />\nvotes this year than last. A State Senator, who asked to<br />\nremain unnamed, said in an interview, \"The attitude<br />\nof my colleagues in the Legislature is appaling....they're<br />\nIgnorant - they don't know what the kids are trying to tell<br />\nthem. They talk to old people mostly, and old people are<br />\ntired of demonstrations. Some crazy amendments are being tacked on (to other bills) - like hang 'em in public.\"<br />\nDepressing, isn't it? I mean, everyone knows that<br />\nsooner or later, the government is going to have to accept<br />\na few of the realities of the situation. But everyone also<br />\nknows that the government has to be pushed pretty hard<br />\nbefore it gets down to business. So far, nobody seems to<br />\nhave done too much pushing.(Forgive the pun, it wasn't<br />\nintended) The other thing is, of course,that the Assembly<br />\nis populated largely by fossils. Don't worry,though,they'll<br />\nall be gone probably within thirty years or so.<br />\n<br />\nArab, Israeli Diplomats Come<br />\nSeparately to Discuss Middle East<br />\nThe Jordanian and Israeli ambassadors to the United<br />\nStates and a high-ranking State Department official will<br />\ntake part in a lecture series on the Middle East at The<br />\nJohns Hopkins University.<br />\nThe first program will feature Abdul Hamid Sharaf,<br />\nambassador of Jordan to the United States, who will speak<br />\nWednesday at 4 p.m. in Shriver Hall on the University's<br />\nHomewood Campus. The program is open to the public<br />\n-without charge.<br />\nThe Israeli ambassador, Yitzhak Rabin, will speak at<br />\nJohns Hopkins on March 12. Rodger P. Davies, U. S.<br />\nDeputy Assistant Secretary of State for Near Eastern and<br />\nSouth Asian Affairs, will appear April 16.<br />\nDean Wm Rudoy, a junior at Johns Hopkins, explained<br />\nthat the series will provide a forum for the presentation of various policy perspectives concerning the Middle<br />\nEast crisis.<br />\n<br />\n\"We would like the Israeli and Jordanian ambassadors<br />\nto outline their proposals for resolving the conflict, and<br />\nwe hope that the representative of the United States will<br />\nindicate to what extent this country should be involved in<br />\nthe Middle East,\" he said.<br />\nThe lecture series is sponsored by the International<br />\nForum, which was started two years ago by undergraduates to attract speakers on international affairs to Johns<br />\nHopkins.<br />\nAbdul Hamid Sharaf was born in Baghdad, Iraq, and is<br />\n_<br />\n_<br />\nnow a Jordanian citizen. He was educated in schools in<br />\nAmman, Jordan, and then received a bachelor's degree<br />\nfrom the American University in Berirut, Lebanon. He<br />\nholds a master's degree from the same university.<br />\nHe began his career in the Jordanian foreign ministry<br />\nin 1962 as head of Arab and Palestine affairs. Since 1967<br />\nhe has been ambassador to both the United States and<br />\nCanada.<br />\n<br />\nAbdul Ilamid Sharaf, Jordanian Ambassador to Washington,<br />\nwill be featured lecturer in Middle East series on Wednesday.<br />\n<br />\nNP1J6CAULJL<br />\nThis calendar is prepared by the Office of<br />\nPublic Information, Shriver Hall. Copy deadline is Friday noon of the week preceding<br />\npublication.<br />\n* Means open to the public without charge<br />\n(unless admission price is indicated)<br />\n** Means open daily to faculty and students<br />\nofJohns Hopkins<br />\n<br />\nWEDNESDAY/FEBRUARY 25<br />\n*2:00 to 4:00 p.m. THE CHAPLAIN'S<br />\nOFFICE (Board Room Levering Hall)<br />\nDraft counseling by prior appt. in the<br />\noffice of the Chaplain, Levering Hall.<br />\n<br />\nTUESDAY/FEBRUARY 24<br />\n*11:00 a.m. ROMANCE LANGUAGES<br />\n<br />\nTHURSDAY/FEBRUARY 26<br />\n<br />\n- Garrett Room, MSE Library - Jean<br />\nPierre Faye, French Novelist (Prix Renaudot)-\"Le recit et le change des formes\"<br />\n*12:05 p.m. THE CATHOLIC COMMUNITY ON CAMPUS-Chapel, Levering Hall. Weekday Liturgy (Thru Friday)<br />\n*2:00 to 4:00 p.m. THE CHAPLAIN'S<br />\nOFFICE,-Board Room, Levering Hall.<br />\nDraft4aurkse1ing by prior appt. in the<br />\noffice °Nile Chaplain, Levering Hall.<br />\n*3:00 p.m. BIOPHYSICS--Jenkins 1077Prof. Robert B. Loftfield, Univ. of New<br />\nMexico at Albuquerque-\"Physico-chemical aspects of protein synthesis\"<br />\n*4:30 p.m. MATHEMATICS-Rowland<br />\n302--Prof. Leon Ehrenpreis, Math. Dept.<br />\nYeshiva Univ.-\"The Poisson Summation<br />\nFomula\"<br />\n*5:00 p.m. BIOMEDICAL ENGINEERING-Talbot Library, 528 Traylor Research Bldg.-Dr. Shyam M. Khanna, Coll.<br />\nof Physicians & Surgeons of Columbia<br />\nUniv. N.Y.-\"Holographic Study of Tympanic Membrance Vibrations in Cats\"<br />\n<br />\n*10:00 to 5:00 p.m. THE CHAPLAIN'S<br />\nOFFICE (Sherwood Room, Levering<br />\nHall) Ferdinand Roten Galleries Exhibition and sale of prints and graphics.<br />\n*10:30 a.m. ELECTRICAL ENGINEERING DEPARTMENT (Ames 325)<br />\n-Dr. Thammavarapu RN. Rao, Dept of<br />\nEE, Univ. of Md.--\"Single Error Correcting Codes for Computer Arithmetic<br />\nUnits\"<br />\n*4:00 p.m. PHYSICS (Rowland 205)Prof. Donald S. McClure, Princeton\"Optical Properties of Magnetic Insulators.\"<br />\n*4:00 p.m. OPERATIONS RESEARCH<br />\n& INDUSTRIAL ENG'G (Maryland 226)<br />\n-Mr. Maximilian Elschmaier, West Germany<br />\n*5:00 p.m. BIOMEDICAL ENGINEERING (Seminar Room B Turner Auditorium-Samuel Ron, Grad. Student, Biomedical Eng'g JHU-\"Who needs the<br />\ncerebellum? (For eye movement)\"<br />\n*7:30 p.m. THE CATHOLIC COMMUN-<br />\n<br />\nITY ON CAMPUS (Newman House,<br />\n2941 N. Charles)--The \"Awareness<br />\nGroup meets.<br />\n<br />\nCommunity Series---The Role of the Legal Aid Bureau\" Mr. Joseph Matcra,<br />\nExec. Dir., Legal Aid Bureau.<br />\n<br />\nFRIDAY/FEBRUARY 27<br />\n<br />\nMONDAY/MARCH 2<br />\n<br />\n*1:30 p.m. MECHANICS (Latrobe 111112)--Prof. C. A. Truesdell, dept. of<br />\nMechanics JHU-\"Negative Pressures in<br />\nFluids:'<br />\n*2:00 p.m. APL/JHU HOWARD COUNTY LABORATORY (Pearsons Auditorium)-Prof. Robert H. Kargon, JHU\"Science'S Public Malaise\"<br />\n<br />\n*9:45 a.m. to 3:00 p.m. JHU/AMERICAN RED CROSS BLOOD DRIVE<br />\n(Great Hall, Levering Hall) Register at<br />\nDivisional Personnel Office: Whitehead<br />\n101, ext. 1204<br />\n*10:00 a.m. to 5:00 p.m. THE CHAPLAIN'S OFFICE (Sherwood Room Levering Hall) London Grafica Arts Inc.<br />\nExhibition and sale of original graphics.<br />\n*12:05 a.m. THE CATHOLIC COMMUNITY ON CAMPUS (Chapel) Weekday Liturgy (Thru Friday)<br />\n*2:00 to 4:00 p.m. THE CHAPLAIN'S<br />\nOFFICE (Board Room Shriver Hall)--<br />\n<br />\nSUNDAY/MARCH 1<br />\n*10:30 a.m. THE CATHOLIC COMMUNITY ON CAMPUS (Shaffer 3)--The<br />\nSunday Liturgy<br />\n*11:00 a.m. THE CHAPLAIN'S OFFICE (Great Hall Levering Hall)--The<br />\nLevering Hall Sunday Service. Discovering American Series: \"The MexicanAmerican\" Rev. Eugene Boulitier, Migrant Minister and Wash. DC Boycott<br />\nRep., United Farmworkers.<br />\n*5:00 p.m. THE CATHOLIC COMMUNITY ON CAMPUS (Newman House<br />\n2941 N. Charles) The Sunday Liturgy<br />\n*8:00 p.m. THE CHAPLAIN'S OFFICE<br />\n(Great Hall Levering Hall)--Courts and<br />\n<br />\nDraft Counseling by prior appointment<br />\n*4:00 p.m. History Department clipper<br />\nRoom Shriver Hall<br />\nThe James Schouler Lectyre Serues, Dr.<br />\nJacques VErger-\"The University of Paris<br />\nat the End of the Hundred Years War\"<br />\n*5:00 p.m. THAYER LECTURE-SCHOOL OF MEDICINE (Turner Auditorium-Dr. Carl V. Moore, Busch Prof.<br />\nof Medicine Wash. Univ. School of Med.<br />\n& Physician-in-chief, Barnes Hospital,<br />\nSt. Louis--\"Iron Deficiency and Nutrition\"<br />\n<br />\n\fFeb. 24, 1970<br />\n<br />\nNEWS—LETTER<br />\n<br />\nPAGE 3<br />\n<br />\nProgram Participants Applaud Urban Studies<br />\nBy RICHARD B. CRAMER<br />\nThe spring semester has seen Hopkins successfully take its first tentative<br />\nsteps toward establishing a full-fledged<br />\nprogram in urban studies.<br />\nFive Hopkins undergraduates, joined<br />\nby five Morgan State students, and taught<br />\nby four faculty members from Morgan,<br />\nHopkins and Maryland University Law<br />\nSchool, are receiving seven and onehalf credits for the semester in Urban<br />\nStudies.<br />\nThe program features a work-study<br />\narrangement whereby students work for<br />\ntwenty hours per week in a city governmental or service agency, and also attend a seminar for three hours on Tuesday nights.<br />\nThe seminar is held in the home of<br />\nEugene Feinblatt. Co-Director of thp<br />\n<br />\nHopkins Urban Affairs Center, located<br />\nIn the School of Hygiene. Together with<br />\nDr. Sol Levine, the Center's other Director; Dr. Robert Crain, Professor of<br />\nSocial Relations at Homewood; Perrin<br />\nMitchell, a professor at Morgan State;<br />\nand a Professor of Law from the University of Maryland, Feinblatt attempts<br />\nto provide discussion and readings which<br />\nwill complement the students' experiences at their jobs.<br />\n<br />\nAssembly, or \"see how well Baltimore<br />\nhas done for the year.\"<br />\nHis observation consists of attendance<br />\nat meetings, planning sessions and political caucuses. The Mayor's Task Force.<br />\nin Annapolis tries to promote the interests of the Baltimore Metropolitan<br />\narea among members of the General Assembly.<br />\n<br />\n\"High Calibre\"<br />\n<br />\n\"Learned a Lot\"<br />\n<br />\nJim Archibald, who is aiding in a study<br />\nof housing in the Baltimore area, also<br />\nfeels that the program has been rewarding. He, like most of the other participants stated that there was a balance<br />\nin the benefits derived by the students<br />\nand the agences they work for.<br />\nArchibald stated that the city received<br />\n\"fairly high calibre\" work from the students at no cost. The students, he said,<br />\ngained valuable experience which they<br />\nmight not obtain otherwise.<br />\nThe program to which Archibald is<br />\ncontributing is administed by the Neighborhood Development Division of the<br />\nDepartment of Housing and Community<br />\nDevelopment of Baltimore City. Archibald and his co-worker are sampling<br />\nfive to ten percent of the blocks in each<br />\nof the city's forty housing districts. Among the ten questions which the survey<br />\nwill answer are: the materials from<br />\nwhich the houses are constructed, the<br />\nnumber of vacant houses on each block,<br />\nthe size of the lots, etc. If the study is<br />\nsuccessful, city housing inspectors will<br />\nknow which districts require _closer or<br />\nmore frequent inspection.<br />\nSteve Kelsey is working with an agency<br />\nconcerned with coordinating governmental action within the metropolitan area.<br />\nBarry Rosen is engaged in a \"costbenefit\" analysis for the Upton Project<br />\nin the Baltimore Urban renewal project.<br />\n<br />\nThe five Hopkins undergraduates participating in the program are Jim Archibald, Ken Jones, John Blumenthal,Steve<br />\nKelsey and Barry Rosen.<br />\nThe program is entitled the Mayor's.<br />\nFellowship Program. The students receive no salaries for their work with<br />\nthe agencies. Their seven and one-half<br />\ncredits are awarded on a pass-fail basis.<br />\n<br />\nStudent Apathy<br />\nSlows Conduct<br />\nProtest Effort<br />\n<br />\nAll of the students contacted felt that<br />\nthey had learned a great deal from their<br />\nexperiences in the agencies. Ken Jones,<br />\na junior who has been working with the<br />\nMayor's commission for laison to the<br />\nMaryland General Assembly said,\"Certainly I've learned a lot...mostly, I've<br />\nenjoyed it tremendously.\"<br />\nJones spends twenty hours per week<br />\nin Annapolis in what he terms \"a combination of participation and observation.\" His participation, at this point,<br />\ncenters around the files which he keeps,<br />\non every bill in the legislature which is<br />\nof interest to Baltimore City. At the<br />\nend of the session, Jones will try to<br />\ncheck the city's record in the General<br />\n<br />\nStudent apathy is facing the organizers of the anti-Gordon Discipline Code<br />\npetition now in their third week of canvassing.<br />\nJim Cleary, organizer of the undergraduate petition, said that he had \"no<br />\nidea\" if his group can garner enough<br />\nstudent signatures to fulfil the 25% quota<br />\nrequested by President Gordon. So far,<br />\na few hundred students have signed the<br />\nPetition out of the 2,000 undergraduates<br />\non campus. The petition will be sent to<br />\nthe President in the next few weeks.<br />\nCleary stated that their main handicap<br />\nhas been general disinterest in the Discipline Code. \"Guys aren't taking any<br />\nPosition at all,\" Cleary asserted.\"Most<br />\nof them haven't read either Gordon's,<br />\nthe Student Affairs Committees' reports<br />\nor the News-Letter's account of the discipline issue.\"<br />\n<br />\nBlumenthal Pissed<br />\n<br />\n\"Couldn't Care Less\"<br />\nThe President of the Graduate Student<br />\nOrganization, Bob Cotter, said that the<br />\ngraduate anti-Gordon petition is going<br />\nvery slowly. \"We're just getting started,\" Cotter noted, \"but already we have<br />\nfound that a lot of graduates couldn't<br />\ncare less about the subject.\"<br />\nHowever, Cotter observed that the<br />\nGrad Organization is not trying to get<br />\n25% of their constituents to sign. \"We<br />\nare not doing this (petition) for Gordon<br />\nto consider. We are demanding that Gordon remove his document, that it was<br />\nillegitimate from the start for Gordon<br />\nto overrule the Student Affairs discipline report.\"<br />\nTo this Cleary asked, \"Gordon has<br />\nthe power. How can we demand anything?\"<br />\n<br />\nDr. Robert Crain of the Department of<br />\nSocial Relations is one of the instructors<br />\nin the Urban Studies Seminar.<br />\n<br />\nThe only student who seemed less<br />\nthan entirely satisfied with the program was John Blumenthal. His work,<br />\nuntil this week, had consisted of comparing assessments of property with<br />\ntheir actual price when sold on the<br />\nmarket. Blumenthal was going to work<br />\non an area-wide survey of this type for<br />\nthe Housing and Community Development Agency.<br />\nHe opted to change jobs in midstream, however, when he learned that<br />\nthe city planned to make such a survey city-wide. \"My work would have<br />\nbeen redundant,\" he sighed.<br />\nOne other complaint was voiced by<br />\nJones, who stated that the students<br />\ndeserved \"either marks or more credit\" for their work in Urban Affairs.<br />\nJones, who also holds another job, said<br />\nhe finds it difficult to keep the schedule<br />\nwhich his work requires.<br />\n<br />\nEat-in, Carry-out<br />\n<br />\nThis discussion at the Tuesday seminars center mainly on the students' experiences on their jobs. The five students from Morgan State have only attended the seminar once. One student<br />\nreturned a second time, but since then,<br />\nthey have virtually disappeared from that<br />\nphase of the program.<br />\nAll of the students voiced the possibility that the program might be expanded<br />\nfor next year. As yet, there is no organized activity to insure that be the<br />\ncase.<br />\n<br />\nAssault Shakes<br />\nGatehouse Calm;<br />\nN-L Dook Safe<br />\nspecial to the News—Letter<br />\nNews-Letter Editor-in-Chief Richard<br />\nCramer was bodily assaulted and his<br />\nwell-being was threatened,<br />\nphysical<br />\nearly Monday morning by John Blumenthal, a Hopkins Junior.<br />\n, Blumenthal, one of five undergraduates participating in a new Urban Studies<br />\nprogram, accosted Cramer outside the<br />\nGatehouse at approximately 2:30 Monday<br />\nmorning.'Cramer had called him shortly<br />\nbefore to ask about the program and<br />\nBlumenthal's role in the Housing and<br />\nCommunity Development Agency.<br />\nWitnesses on the scene confirmed that<br />\nBlumenthal, alter demanding to see the<br />\narticle, grabbed Cramer at the neck and<br />\nattempted to wrest the notes on the story<br />\nfrom the writer's hand.<br />\nBlumenthal stated that if anything about<br />\nhim appeared in the article, he would<br />\n\"bust your (Cramer's) ass.\" Cramer<br />\nlater told police Officer H. G. Hilnbrand that none of the notes on the article contained anything which would be<br />\npersonally objectionable to Blumenthal.<br />\nWitnesses said that they believed Blumenthal was upset about being called at<br />\nsuch a late hour. During the telephone<br />\nconversation, according to Cramer,Blumenthal gave no indication that he was<br />\nother than mildly annoyed. As he entered the office, Blumenthal insisted that<br />\nhe had thought it was 8:00 a.m. This<br />\nseemed to annoy him most of all.<br />\nGeorge Klopfer, who was present throughout the episode, considered Blumenthal's actions unexplainable. \"It looked<br />\npretty dark for eight o'clock in the morning,\" Klopfer opined. At deadline, Cramer was undecided as to whether he<br />\nwould press charges.<br />\n<br />\njweyiw'<br />\n<br />\n!EN'S<br />\n3121 St. Paul Street<br />\n<br />\nJeep<br />\nFull line of<br />\n4-wheel drive<br />\nwork and play<br />\nvehicles.<br />\n<br />\nIt's about an era ofsin<br />\nand wickedness, when crooks were<br />\nthe good guys and a house was a home...<br />\nand a madam could be<br />\nyour mother!<br />\nre<br />\n<br />\nThink Of All Of Life's Pleasures.<br />\nDouble Them.<br />\nAILY.<br />\nAnd Live... 4<br />\n<br />\nw:GORNvE8ER<br />\n<br />\nGLADIATOR<br />\nA<br />\n4 OR V6<br />\nUNIVERSAL<br />\n,EXCITING lEEPSTER' SERIES!<br />\nTAKE A TEST DRIVE TODAY!<br />\n<br />\nPremiereTomorrow!<br />\n<br />\nSALES•SERVICE•PARTS<br />\n<br />\nWORLD FARE<br />\n<br />\nFINE SELECTION OF USED CARS,<br />\n<br />\nCINEMA I<br />\n<br />\nCINEMA II THE 5 WEST PARAMOUNT PIKES<br />\n<br />\nYalu idge Shopping<br />\nCenter •252 2256<br />\n<br />\nYak r idge Shopping<br />\nCenter•252 2256 I<br />\n<br />\nHERRING JEEP<br />\n889-1719'<br />\n<br />\ni<br />\n<br />\nWORLD F ARE<br />\n<br />\nI<br />\n<br />\nWOR10 F ARE<br />\nNorth at Charles<br />\n837 1956<br />\n<br />\nI<br />\n<br />\n1<br />\n<br />\nWOR1D f ARE<br />\n6650 Belair Road<br />\n426 6875<br />\n<br />\nexhibit).<br />\nI sale of<br />\noriginal<br />\ngraphics<br />\niOr allslors<br />\nby<br />\nChagall,<br />\nBaskin,<br />\nRouault,<br />\nDaumier<br />\n& many<br />\nothers<br />\n<br />\nrye'<br />\n,<br />\n<br />\n310 W.27 St.<br />\n<br />\nThe reading list for the course, in<br />\nthe words of the participants, is \"relevant and interesting.\" It includes<br />\nitems such as the budget for Baltimore<br />\nCity. The idea is that the budget for any<br />\ngovernmental system demonstrates exactly where the priorities of that system<br />\nlie.<br />\n<br />\nif<br />\nPihesville<br />\n486 5848<br />\n<br />\nArranged by<br />\nFeroinand<br />\nRoten Gaileries,<br />\n<br />\nBaltimore, Md.<br />\n<br />\nJohns Hopkins University<br />\nLevering Hall<br />\nSherwood Room<br />\nThursday, February 26<br />\n10 A.M. to 5 P.M.<br />\n<br />\nFR<br />\n<br />\n\fPAGE 4J<br />\n<br />\nFeb. 24, 1970<br />\n<br />\nNEWS—LETTER<br />\n<br />\nNews-Letter<br />\n<br />\nBenzon<br />\n<br />\nthe johns hopkins university]<br />\nRichard B. Cramer, Peter Harnik<br />\nKevin Kresock<br />\n<br />\neditors-in-chief<br />\nbusiness rnanager<br />\nTUESDAY<br />\n<br />\nEmil Pavlovics<br />\nTed Rohrlich<br />\n<br />\nday editor<br />\nmanaging editor<br />\nFRIDAY<br />\nday editor<br />\nmanaging editor<br />\n<br />\nMark Reutter<br />\nStephen Tulloss<br />\n<br />\nresearch editor: Stuart Seidel<br />\nphotography: Thomas Hoffmann<br />\nsports editor: George Kirschbaum<br />\nfeatures editor: John D. Hollis<br />\nreporters:<br />\nMike Hill, Ken Bakalar, Art Levine, Sandra Hammer<br />\nstaff writers:<br />\nHarvey Luksenburg, Marc Krizack, Andy Green<br />\nstaff members:<br />\nPeter Kates, Bill Linder, Steve Gray, Mike Weissman,<br />\nJan DeKenis, Mike MacAdams, Howard Levenson, Larry hammer,<br />\nRalph Moller, Howard Goldstein, Steve Buckingham, Joe Cantor.'<br />\nsports staff.<br />\nJay Rasin, Ed Brethauer, Pete Hughes, Mark Heller,<br />\nRalph Rothwell<br />\n`photography staffTom Lemm,Tom Anderson, Richard Rosenthal<br />\nGeorge Uhl, Oliver Engel, Jim Battis<br />\ncopy staff:<br />\nJay Lenrow, Elliott Treby<br />\nbusiness staffHarry Keyserling, Peter Hughes<br />\ncartoons:<br />\nJed Kirschbaum<br />\n<br />\nWhat Ever Happened to•••<br />\nAlmost one year ago to the day, Maryland public colleges and universities were ordered to desegregate their<br />\nfacilities. Despite much law-and-order bantering on the<br />\npart of concerned local officials, the state has not complied, nor made any concete effort in the direction of<br />\ncompliance.<br />\nThe original order came down from the civil rights<br />\ndivision of HEW, which warned that non-compliance<br />\nwould result in a loss of federal funds. Despite non-compliance, there has been no such loss. At the time of the<br />\norder—until last - week—the civil rights (i.e. enforcement)<br />\ndivision was headed by Mr. Leon Panetta. Last week, the<br />\nWhite House resigned Mr.Panetta, who was regarded as too<br />\nzealous for middle America on civil rights.<br />\nPanetta was reportedly the pawn in the latest of the<br />\nnever-ending series of Nixon-Finch power struggles, which<br />\nNixon invariably wins. This time Agnew had the gripe<br />\nfrom the White House side. It seemed to Agnew that<br />\nPanetta had diabolical plans to destroy white collegiate<br />\nsanctuaries in Agnew's own back yard, and possibly risk<br />\nexacerbating tensions by mixing the races.<br />\n•Despite recent Supreme Court rulings calling for immediate integration wherever segregation or de facto segregation is found, Maryland colleges—for that matter, Maryland<br />\nhigh schools--remain as they were a year ago, predominantly one-race institutions. The University of Maryland at<br />\nCollege Park, for example, was and is 99 per cent white.<br />\nIts Princess Anne County campus is 92 per cent black. And<br />\nso on down the line.<br />\nTo improve racial balance, the state college Board of<br />\nTrustees commissioned a $12,000 study of the problem,<br />\nand asked the administration of each college to submit its<br />\nown recommendations. The oursider can only assume that<br />\nthese reports have been carefully scrutinized—for they<br />\nwere doubtless all in the bureaucratic verbiage that warrants scrutinization without regard to content —and tossed<br />\naway, along with Mr. Panetta.<br />\nThe original deadline for submission of a desegregation<br />\nplan was set for last July. But'the summer, fall, and most<br />\nof the winter have passed without incident, as Maryland<br />\n- has still not submitted a plan and Nixonian officials have<br />\ndeclined to take public notice. Panetta became an exNixonian official precisely because he was no longer<br />\ndeemed trustworthy to remain silent while the law was<br />\nsystematically abused by government officials entrusted<br />\nwith its enforcement.<br />\nIsn't it nice having a Vice-President from Maryland?<br />\n<br />\nBy WILLIAM BENZON<br />\nAs Michael Brenson so astutely pointed out in<br />\nthis Journal awhile back, the myth of America has<br />\nbeen revealed for the lie it is: America is bareassed, not only before the world, but before herself. I would like to add a footnote or two to Mr.<br />\nBrenson's article.<br />\nAs the myth disintegrates the chief characteristic of our methods of decision making will become exposed: the reasons which inform our debate have little to do with the factors which impell the decision. This in part due to the nature<br />\nof institutional decision making; individuals efface<br />\ntheir personal identity, their very being, so that<br />\nthey might take a proper institutional role (example: a high administrative official in a wellknown Baltimore university who has no opinions<br />\nbecause he is a high administrative official.)<br />\nThis leads to total loss of moral responsibility<br />\n(examples: Dachau, the \"Presidio stockade, Song<br />\nMy); in another context the phrase \"psychological<br />\naddiction\" is used. But then,the institutions where<br />\ncreated by men and men have always been avoiding responsibility.<br />\n<br />\nTwo Are One<br />\nMake no mistakes; most of the people in this<br />\ncountry know (they even know it is they who are<br />\nresponsible--but they palm it off on...), who is<br />\nresponsible for this mess and they know it is a<br />\nmess. But then one has to believe in something and,<br />\nin the absence of any but the most senile of gods,<br />\none believes in one's country. The country in<br />\nwhich the patriot believes exists in a different<br />\nuniverse of discourse from the country in which<br />\nhe earns his bread and is nagged to buy buy buy!<br />\nIt hasn't yet occurred to him that the two are in<br />\nfact one.<br />\n-But as the myth dies he will be forced to see<br />\nthat the two are indeed one. Herein lies a great<br />\nhope and a great despair.Whatwill the reaction to<br />\ntruth be?<br />\n<br />\nEternal Dilemna<br />\n<br />\nDifferences Trivial<br />\nA local example of this split can be seen in the<br />\nabove mentioned Baltimore university. A number<br />\nof students, faculty ,and administrators decided<br />\nthat a student disciplinary code was needed.<br />\nThere are now two versions of such a code; one<br />\nversion prepared by an advisory committee and<br />\none prepared by the above mentioned high administrative official. The differences between the<br />\ntwo versions are trivial if one believes that a student discipline code is imperative and so there<br />\nshould be little difficulty involved in adopting one<br />\nversion or the other. But there is much quibbling<br />\nand many reasonings; and the real issue is: who<br />\nruns the university, the high administrative official or the students and faculty?<br />\nBut neither side can openly acknowledge, in<br />\nthis particular context, what the issue is (though<br />\nin private the students and faculty distrust and<br />\nresent this official and this official has complementary feelings), for then both sides would be<br />\nexposed, left naked. And the winter air is cold.<br />\nSo the quibble will continue behind it's schizophrenic screen.<br />\n<br />\nThe dilemma is not new, it is much more than<br />\nvery old. It is eternal. \"And they heard the sound<br />\nof the Lord God walking in the garden in the cool<br />\nof the day, and the man and his wife hid themselves from the presence of the Lord God among the<br />\ntrees of the garden. But the Lord God called to the<br />\nman, and said to him, 'Where are you?' And he<br />\nsaid, 'I heard the sound of thee in the garden,<br />\nand I was afraid, because I was naked; and I hid<br />\nmyself.\" And the man blamed it on the woman,<br />\nthe woman blamed it on the serpent; the serpent<br />\nwas Satan and Satan blamed it on the Lord God.<br />\n(Only in comparison with being is non-being nothing.)<br />\nThe great hope lies in seeing the truth, accepting it and repenting Of past evil (which means to<br />\nacknowledge one's sin, but to do better in the future rather than using guilt for past sins as an<br />\nexcuse for doing nothing, don't look back). Given<br />\nthis, then;<br />\n...much more good thereof shall spring,<br />\nTo God more glory, more good will to Men<br />\nFrom God, and over wrath grace shall abound.<br />\n<br />\nGreedy Watchdog<br />\nComing Apart<br />\nSimilarly, the legal status of marijuana has<br />\nnothing to do with the merits or demerits of the<br />\ndrug; though that is the excuse which informs debate on the subject. The issue is political and social; hedonism vs. a perverted puritanism, young<br />\nvs. old, liberals and radicals vs. silent majority.<br />\nLikewise the ABM. The issue was not whether or<br />\nnot the ABM could possibly work or evenwhether<br />\nor not the arms race is something any sane man<br />\ncould believe in. Rather the issue was: do we throw<br />\nthat obscenely greedy watchdog another fillet or<br />\nmust he content himself with a bone? He was thrown<br />\na fillet, thus establishing that the master is still<br />\nafraid of his watchdog.<br />\nAnd Vietnam is filled with the corpses and<br />\npoisoned land engendered by this mismarriage of<br />\nreason and fear. Why are we there?\"Because they<br />\nasked us there, we gotta keep the world free for<br />\ndemocracy and we gotta save face.\" No! We're<br />\nthere because the makers of our foreign policy<br />\nare bumbling incompetents, because of the flaming xenophobia of the silent majority, because that<br />\nwatchdog likes his fillet and he has lots of friends<br />\nwho like to bury bones for the sake of burying<br />\nbones (they got big piles of them good bones!)<br />\nand because the sun shall never set on the Amurrican empire.<br />\nWe all know this and we have always known it;<br />\nbut we have never beenforced to admit it in public<br />\n(not even in the anonymity of a Gallup poll--who's<br />\nto say everyone really believes what he tells the<br />\nTHE WIZARD OF ID<br />\n<br />\nM it7Ni6HT!<br />\nMUT ARE<br />\nCt2IN&<br />\n<br />\nDOWN<br />\nTHERE<br />\n<br />\n1-13<br />\n<br />\n416%<br />\n<br />\nTo face the truth is to regain some measure of<br />\ncontrol over the consequences of one's decisions<br />\nbecause one is no longer forced to believe a myth<br />\nwhich makes it impossible to affect the real sources of power. To face the truth is to change from a<br />\nsituation where reason exists only to give tangible<br />\nform and substance to a formless and endless need<br />\nfor power and control (eliminate all myths and<br />\nnothing is left but fear of the other and desire to<br />\ncontrol him) to a situation where power serves<br />\nto root abstract reason into the substance of the<br />\nearth so that flowers might bloom and flourish<br />\nrather than wilt and perish.<br />\n<br />\nTo turn from the truth is to invite chaos, and<br />\nthe great despair. For perhaps the truth is too<br />\nmuch to bear. In which case the myth is grasped<br />\neven more greedily; and the more greedily it is<br />\ngrasped, the more the life giving truth is choked<br />\noff; the more greedily the truth is choked off.<br />\nthe more greedily is the myth grasped. The<br />\nparasite destroys the host and thus destroys himself. The systems engineer would call it positive<br />\nfeedback. The logician calls it an infinite regress. For a plain speaking man it is a vacious<br />\ncircle. For the psychiatrist, schizophrenic disintegration. Sartre, the abyss. Milton Moses Ginsberg made a pun and so titled his movie Coming<br />\nApart. Bergman called his movie Shame. And<br />\nmany an alumnus of Hopkins has pronounced it...<br />\nTerminal.<br />\nby Brant parker and Johnny hart<br />\n<br />\n* * *<br />\nHopkins, as the state's most prestigious private university, has quietly undertaken a program to attract more<br />\nqualified black applicants. Despite Administration grief,<br />\nAssistant Admissions Director Ronald Owens has done<br />\nmore than a commendable job. Hopkins may never be<br />\nable to portray anything but a lily-white foreign image to<br />\nits black students, but it's good to know that someone is<br />\npulling in the other direction.<br />\n<br />\npollster?). To not admit something in public is to<br />\nnot admit it as real; what is kept private disappears in sleep; what is before the public, before<br />\nothers, is real.<br />\n<br />\nA TKEATIGE<br />\nON WOMAN'S<br />\n<br />\n(NTomorJ.<br />\n<br />\nWNAr<br />\n1 T140U6,14T<br />\n<br />\n\fNEWS—LETTER<br />\n<br />\nFeb. 24, 1970<br />\n<br />\nPAGE 5<br />\n<br />\nLetters To The Editors<br />\nTo the Editors:<br />\nI would like to take this opportunity to comment on<br />\nyour Story in 'Jay's '`e -;t', February 20, 1970. .<br />\nAs you mention<br />\nyour article I have been at Hopkins<br />\nfor 4 years. I have had the opportunity to hear many<br />\ndifferent people expound on this \"Unique\" University<br />\nof.ours and also had the opportunity to hear the undergraduates complain vociferously about their problems.<br />\nIt seems like one of their biggest complaints is the fact<br />\nthat they (the undergraduates) feel as though they are<br />\ngetting short-changed in our \"Unique\" University. I<br />\nhave always been very empathetic about their criticism<br />\nbecause I, too, felt that the athletic department and<br />\nthe people involved in the programs centered at the<br />\nAthletic Center were also being `short-changed'.<br />\nI am finding, to my dismay, that one of the unique<br />\nqualities of this institution is that the undergraduates,<br />\nas exemplified by your article, are more than willing<br />\nto criticize any effort or attempt by their fellow students to achieve a certain amount of self satisfaction<br />\nand pride out of their involvement in athletics. This<br />\nwillingness to criticize is further reinforced by a strong<br />\ndesire on the part of the undergraduates not to get involved himself.<br />\nThey say, en masse, 'give us control of the University, give us more Professors and less graduate instructors, give us a Student Center, give us everything, but<br />\ndon't ask us to stand up and be counted. Don't ask us to<br />\nget involved, don't ask us to work in the inner city,<br />\nmental hospitals, athletic teams, school papers, or<br />\ncommittees. We don't want to make a constructive effort<br />\ntoward helping to solve the problems of our times, but<br />\ngive me a chance to sit back and criticise the few that<br />\nare.'<br />\n<br />\nSo we run a \"bush\" Fall Sports Banquet for 75 young<br />\nmen that gave something to Hopkins. They sure as Hell<br />\ndidn't play in front of large crowds, and they didn't get<br />\ntheir names in the Baltimore Sun very often and when<br />\nthey did lose games because they aren't 'professionals' they most definitely did get criticized by their<br />\nfellow students both in and out of the News-:Letter.<br />\nMaybe it was 'dull' to you, but I appreciated the fact<br />\nthat George Hayward gave his time to see all of our<br />\nand try to feel as if he were<br />\nlast fall<br />\ngames<br />\nassociated with a fine group of young men. I also<br />\nappreciated the fact that Vince Bagli was willing to<br />\ncome over to Hopkins and say 'Hello' to us for a roast<br />\nbeef dinner and the reason he was late was because<br />\nhe had to do a T.V. show. I also appreciated the fact<br />\nthat President Gordon attended along with Ross Jones,<br />\nDave Kaufman, Oz Steinwald, Bob Hewes. I also appreciated the fact that we can't go 1st class in the Banquet<br />\nbecause Hopkins just doesn't have the funds. Denny Cox<br />\nbrought his wife to the Banquet because he believed in<br />\nthe young men that were being honored that night. Denny<br />\nhad to pay for his wife's dinner just like the rest of the<br />\ncoaches that brought their wives and you know that Denny<br />\ndid for Hopkins last fall? He worked as an integral part<br />\nof our staff and didn't get a penny for his service.<br />\nI also realized, and would have been happy to tell you<br />\nif you asked, that the reason why the banquet was the<br />\nfourth of February is because many finals were given<br />\nduring the early part of December and the Captains requested that we postpone the banquet feeling a need to<br />\nstudy and try to catch upwith their classmates that spend<br />\nSaturday afternoons during the fall in the library. If you<br />\nconsult your calendar you will find that with registration<br />\nand the beginning of classes this is the earliest we could<br />\n<br />\nhave had the banquet. Remember George, your classmates were away for a few weeks on 'independent<br />\nresearch' at Stow, Vermont, Bahamas, and some other<br />\nintellectual resorts.<br />\nI don't think our banquet was 'bush'. I think you and<br />\nthe others that sit on the sidelines of all the games of<br />\nlife criticizing and unwilling to give of themselves are<br />\n'bush'.<br />\nThe true 'uniqueness' of this University is the 'fact<br />\nthat it allows the best and worst to come to the surface.<br />\nThank god we have the Russ Passarellas, Paul Aliens,<br />\nJoe Cowans, Charlie Cokers, Bob Hydes and even<br />\nthough he will never believe this the Rich .Convisers.<br />\nThe people that are willing to get involved, the people<br />\nthat are willing to 'stand up and be counted' the people<br />\nthat are willing to get in the arena of life and either 'put<br />\nup or shut up'.<br />\nWhy don't you start a campaign on campus to be positive - instead of negative. I assure you our football<br />\nprogram will survive your criticisms and complaints,<br />\nbut it would be so nice to think that someone was actually<br />\npulling for us to do well and truthfully care when we<br />\ndidn't. I have tried as a football coach and I know<br />\nour players have tried their best. Why don't you and<br />\nyour other cynics try to make a concerted effort to help<br />\nus build together toward a better University rather than<br />\nsit around criticizing the small measure of success we<br />\nhave achieved.<br />\nI assure you I would look forward to and welcome the<br />\nopportunity to work with you to make this fine University a better one.<br />\n<br />\nAlexander Sour<br />\nHead Football Coach<br />\n<br />\nKingdom and the Bowling Alley<br />\nBy JIMMY OLSENBERG<br />\nI was young then, still a freshman at<br />\ncollege, and I was in New York making<br />\nthe rounds for a newspaper job. I went<br />\nfirst, of course, to the New York Times,<br />\nor, as I had come to call it, My Bible.<br />\nAs I entered the building, I felt like<br />\nan aged, devout Moslem entering the holy<br />\ngates of Mecca.<br />\nInside, everyone seemed to have slightly graying, razor-cut hair that modishly<br />\ncame down over the collars of their<br />\nVan Ileusen shirts. Dressed in expensive, tailor-made pin stripe suits, they<br />\nchatted casually about yachting and polo,<br />\nand their tanned faced glowed with selfassurance. They had all graduated from<br />\nHarvard or the Columbia School of Journalism, or both.<br />\nUnfortunately, I was unable to get a job<br />\nat the Times, and with a shaky conscience, I took the cross-town bus to the<br />\nNews.<br />\n<br />\nLet's Crack Down!<br />\nNow, as a card-carrying Jewish liberal, I had always looked down on the<br />\nDaily News. I even used to cut out their<br />\neditorials and post them on my bulletin<br />\nboard, in order to impress girls with<br />\nmy wildly original,off-beat humor.Their<br />\nanti-dissent editorials usually went like<br />\nthis:<br />\nIt's high time that all these bleedingheart kooks and liberals quit their yapping about \"police brutality.\" These<br />\nCommie dupes will go to no end in their<br />\nKremlin-hatched smear job on the policemen of this nation. Along with the<br />\nsofties on the Supreme Court, these<br />\nlong-haired weirdoes are trying to handcuff the polico, while anarchists and<br />\ncriminals are running wild on the streets.<br />\nWe say let's put an end to all this hot<br />\nair on \"criminal's rights,\" and start<br />\nthinking about the rights of the lawabiding citizens of the nation. The only<br />\nthing a criminal understands is a good<br />\nknock on the head, and pronto!<br />\n<br />\nThe Late Show<br />\nAs I entered the city room of the News,<br />\nI rubbed my eyes in disbelief. The Daily<br />\nNews was actually nothing more than a<br />\nre-creation of all the movies on newspapers that I had watched on the Late<br />\nShow. Everywhere I looked, old men in<br />\nsuspenders, with their ties loosened,and<br />\ngreen, visors shading their eyes, were<br />\nbeneover ancient black typewriters,fur-<br />\n<br />\niously pounding away. Elsewhere, reporters were making phone calls as they<br />\nnervously<br />\nsmoked<br />\ncigarettes. Any<br />\nminute I expected Spencer Tracy or Humphrey Bogart to come in with the latest<br />\nscoop. I had always imagined that the<br />\npeople who turned outthe copy must surely be a group of well-educated practical<br />\njokers, turning out their drivel to mock<br />\nthe sub-literate masses who so eagerly<br />\ngobbled it up.<br />\nThis was not the case. The reporters<br />\nwho told those millions of readers about<br />\nsexpot scandals and mad rapists were<br />\nreally not that much different from their<br />\nreaders.<br />\n<br />\nScrew<br />\nBut what was even more amazing to<br />\nme was the lack of status accorded even<br />\nthe most illustrious editors. As I was<br />\nshown around the city room,occasionally<br />\nstopping to pick up a beer can that blocked my path, the personnel director pointed out various celebrities. \"That's the<br />\ncity editor,\" he said, pointing to a wizened, wrinkled old man in suspenders<br />\nwho sat at the head of a large table ogling<br />\nthe latest copy of Screw magazine.<br />\n\"Hey\", the old man exclaimed, \"take a<br />\nlook at that pussy!\" The others at the<br />\ntable looked up, and one aging man lumbered over to take a look for himself.<br />\nThe city editor spread out the photo of a<br />\nhefty brunette model lifting her skirt.<br />\nWe moved on to the other large desks,<br />\nand as he pointed out each one of the<br />\nvarious prominent people, I realized that<br />\nthere was very little glamour about them.<br />\nIn the Times, men in the same position<br />\nwould have 'the fabulous aura of demigods. Here, however, they were just<br />\nmen doing their jobs. They sat at<br />\ntheir desks like everybody else, and<br />\nthey were not separated behind heavy<br />\noak doors with gold letters on the outside. As I soon realized, although the<br />\nNews may be more strident in its trumpetings against threats to the American<br />\nWay of Life, it was e4remely tolerant<br />\nwithin the bureaucratic structure.<br />\nThe copyboys were almost all longhaired, except the black copyboys, who<br />\nwere decked out in Afros, dashikis,<br />\nbeads, or daz4ling silk shirts. On<br />\nweekends, reporters and copy editors<br />\nwould come in T-shirts, blue jeans,<br />\nand bermuda shorts. The younger reporters were liberals, as were most of<br />\nthe guys on the telegraph desk, and they<br />\nhad a bemused attitude towards the<br />\n<br />\nrantings in the editorial page.<br />\nEditorial policy was not democratically decided, but rather hatched from<br />\ntwo cubicles stuck in the Women's Department. There, forty-year veterans<br />\nlike Reuben Maury typed out their mutterings on pinko faggots. Reuben was<br />\na small, bent-over man, with suspenders, walking cane, and a straw hat.<br />\nWhen I would have to deliver a message to him, I'd enter his little room<br />\nonly to see him cackling over his editorials. He was occasionally seen at<br />\nvarious parts of the city room, hurriedly moving towards some destination<br />\nknown only to him, with a frozen grin<br />\non his face. His movements were quick<br />\nand jerky, like a toy puppet's. Once<br />\n<br />\na day, he would emerge from his office<br />\nin the 19th century, shuffle towards the<br />\ntelegraph desk, deposit his editorial,<br />\nwheel around, and head back to his<br />\nworld of Commies and hippies and rabble-rousers in the Women's Department.<br />\nMeanwhile, the young editor<br />\nwho had just received this latest editorial would glance at the copy, and<br />\nthen shake his head in disbelief. When<br />\nhe'd come into the city room, I would<br />\nalways wonder what must go through<br />\npoor Reuben's mind after he sees the<br />\ncopyboys dressed conspicuously like the<br />\nanarchists and Black Power fanatics he<br />\nhad just decried in his editorial.<br />\n(Part II of this article will appear in the<br />\nnext edition of the News-Letter).<br />\n<br />\nKeen, Torns of Pain<br />\nBy JAMES FEE MARTIN<br />\nOne more step in the increasing attempt to explore the previously overlooked darker side of an allegedly narrow and prudish Victorian morality has<br />\nbeen taken with the publication of LoveLyrics, hitherto surpressed private(and<br />\nrevealing) musings by that much-under*rated stylist James Whitcomb Riley, the<br />\nso-called \"Hoosier Poet.\"<br />\nLong known as the author of many<br />\nvolumes of children's poetry, and such<br />\nfolk.classics as \"When the Frost Is on<br />\nthe Pumpkin,\" Riley now reveals another aspect of his character as a tireless celebrator of the infinite variety<br />\nand sensual exaltation of the act of<br />\nphysical love.<br />\nFrom his precocious introduction to<br />\nthe paths of pleasure described in \"A<br />\nVery Youthful Affair,\" through the sheer<br />\nphysical immediacy of the memories in<br />\nLeonanie and Judith, (\"All forebodings<br />\nthat distressed me/I forgot as Joy caressed me...the soft touch of her hand/<br />\ntakes all breath....\" the author gives<br />\ncontinual insights into the state of Eros<br />\nin this country during the latter part<br />\nof the Nineteenth Century.<br />\nThe sadistic tendencies of the Victorian man have been the subject of<br />\nmany works, but rarely have we been<br />\ngiven the opportunity to view the corresponding trend towards masochism<br />\nwhich Riley approaches in such poems<br />\nas A Variation. Beginning with the invitation to \"Hate me just a little-come!\" he expresses the dual nature of<br />\nthe desire to at once inflict and re-<br />\n<br />\nlines like \"Make your<br />\nceive pain in<br />\nsobbing lips unsheathe/ All the glitter<br />\nof your teeth!\", the wish to destroy,<br />\n\"How I hate the torrid/ Touches of<br />\nyour splendid lips...\" and simultaneously to be overwhelmed - \"Now before me looms Something more than<br />\nhuman...Something to bow down before/<br />\nReverently and adore.\"<br />\nTurning from these deep probings into the dark heart of human desire, Riley<br />\noffers an apologetic for his actions in<br />\nHow It Happened, attempting to spread<br />\nhis hedonistic gospel among his more<br />\nrepressed contemporaries.<br />\nIn his last poems, one senses a certain weariness with the never-ceasing<br />\ndrive of depravity, \"...every briered/<br />\nWith keener thorns of pain....\", until<br />\nfinally, in Blooms of May, he cries<br />\n\"No more for me... \"No more - No<br />\nmore -\"<br />\nBut the joys of the flesh are never<br />\ncompletely lost, and When Age Comes<br />\nOn recalls once more the \"tide of raptures, long withdrawn,\" flowing back<br />\nin \"summer-floods\".<br />\nIn their outstanding edition of these<br />\nworks,<br />\nBobbs-Merrill has combined<br />\nthe poems with another long-hidden work<br />\nof genius from the same pried, the<br />\n\"Life Pictures\" of photographer William<br />\nB. Dyer. Evocative at once of age-old<br />\ndesires and the particular idiosyncracies of the age which produced them,<br />\nthese masterpieces of lecherous imagination run wild are the perfect companions for<br />\nRiley's sinuous inner<br />\nthoughts.<br />\n<br />\n\fPAGE 6<br />\n<br />\nNEWS—LETTER<br />\n<br />\nBlue Jay Swimmers Dunk Franklin - Marshall<br />\nbaturday afternoon, the varsity swim team added a second<br />\nvictory in one week to their credit by beating Franklin and Marshall, 74 to 21. The 400 yard<br />\nmedley relay team, composed<br />\nof Jim Scott, Kirby Weldon,<br />\nRick Ware, and Pete Weiss won<br />\nthe first event, swimming a 4.<br />\n02.8. To round out a successful<br />\n<br />\nmeet, the 400 free relay team,<br />\nof Ware, Brian Turner, Marc<br />\nSolomon, and Pete Weiss, placed first in the last event, beating both the varsity F & M relay team and an unofficial F &<br />\nM exhibition relay. The single<br />\nvarsity diver, Ken Zonies, was<br />\nalso in good form, winning his<br />\nevent by more than 160 points.<br />\nSenior Brian Turner was the<br />\nonly double winner of the day,<br />\n<br />\nTHE<br />\nPHY.ED.MAJOR<br />\nSAID<br />\nJOCULARLY:<br />\n<br />\ntaking firsts in the 50 yard freestyle race with a :23.9, and in<br />\nthe 100 free, with a :52.8. Hopkins swimmers also took seconds<br />\nin both events. Pete Weiss swam<br />\none of his best times, a :54.6,<br />\nin the 100 free to place second,<br />\nand Mike O'Donnell took the second in the fifty.<br />\nThe 200 individual medley was<br />\nwon by senior Bob Fisher with a<br />\n2:17.8, and team captain Rick<br />\nWare followed in with second.<br />\nThe 200-yard butterfly was won,<br />\nin an almost predictable fashion,<br />\nby Marc Solomon and Gene Bonte,<br />\ntaking first and second respectively.<br />\nJunior Marc Solomon<br />\nhas been winning this event all<br />\nseason with astonishing regularity and sophomore Gene Bonte<br />\nhas been almost as dependable<br />\nin second place.<br />\nIn the 200 yard backstroke,<br />\njunior Jim Scott swam a 2.16.6<br />\n<br />\nSPECIAL<br />\nNOTICE<br />\nStudent<br />\nand<br />\nFaculty<br />\nDiscounts<br />\nON<br />\nGoodyear Tires<br />\nGates Tires<br />\nRecapped Tires<br />\nMonarch Tires<br />\nauto repairs<br />\nBrakes<br />\nAlignment<br />\nTune-Up<br />\nGrease & Oil Change<br />\nShock Absorbers<br />\nMufflers<br />\nAnti-Freeze<br />\nVVheels<br />\nhi<br />\n<br />\nMILLER<br />\nMAKES IT RIGHT!<br />\n<br />\n1<br />\n<br />\nSEND US<br />\nYOUR<br />\nAD-VERBIAL<br />\nPUNS ABOUT<br />\nCOLLEGE<br />\nMAJORS. IF<br />\nPUBLISHED,<br />\nWE'LL SEND<br />\nYOU A<br />\nREFRESHING<br />\nREWARD.<br />\nCOLLEGE BOX 482<br />\n© MILLER BREW. CO.<br />\nMILW.,<br />\n, WIS.<br />\n. 53201<br />\n<br />\nCrodil Cards<br />\n<br />\nPaul<br />\nSchnitzer<br />\nTire Co.<br />\n<br />\nto place first and Bob Fisher<br />\ncopped second. The fly, this<br />\nevent, and the breaststroke<br />\nhave been strong events for Hopkins most of the season. Breaststrokers, Mike O'Donnell and<br />\nKirby Weldon substantiated this<br />\nassumption by taking \"one, two\"<br />\nin their race.<br />\nThe varsity was preceded by<br />\na successful freshman meet against F & M, with a final score<br />\nof 58 to 26. During the course<br />\nof the meet, Vince Nigrelli swam<br />\na 50.1 time for the 100 yard<br />\nfree race and set new frosh and<br />\nuniversity records in that event.<br />\nFreshman are now eligible to<br />\nparticipate in national level competition, and Nigrelli missed qualifying in the 100 by less than a<br />\nsecond. Several special qualifying heats were held for the freshman during the two meets, to obtain official times. No one made<br />\nit Saturday, but Nigrelli managed<br />\n<br />\nto set a frosh record in the fifty<br />\nfree with a 23.5, and Richard<br />\nSilver swam an excellent time<br />\nof 4.47.8 in the 400 yard individual medley, short of qualifying<br />\nby about one second.<br />\n<br />\nFrosh Swimming NCAA'S<br />\nThis year's NCAA competition should find some of the frosh<br />\nswimmers involved. They still<br />\nhave time to qualify and it IS<br />\ncertain they will not stop trying.<br />\nOne other record was set in that<br />\nMichae:<br />\nmeet, by<br />\nFreshman<br />\nBoyd, who swam a 5:15.6 in the<br />\n500 free to break his own previous frosh and university record.<br />\nNext week, coach Frank Comfort takes his crew down to Gallaudet College to compete in the<br />\nMason-Dixon Conference Championships. Last year, Hopkins<br />\nfinished a strong second. The<br />\nNews -Letter sports staff hopes<br />\nfor a first place this year.<br />\n<br />\n.q,NYONMCOMWMMM?)YA)(<br />\n1.,.<br />\n<br />\n•<br />\n<br />\nMMMMMMMN.MMWMM{Y,WMM<br />\n<br />\nBy RALPH ROTH WELL<br />\n<br />\nEXTRA<br />\nCURRICULARAND<br />\nEXTRA IMPNITANT• READING<br />\nWM PENGUIN<br />\nTHE PEASANTS OF NORTH VIETNAM. Gerard Chailand.<br />\nThe author, a history professor and strong opponent of American involvement in Vietnam, provides the most complete<br />\naccount available of life in the Democratic Republic of Vietnam. Reporting on his travels through the Red River delta, he<br />\ndescribes the economic and social organization of the village<br />\ncommunes and records the voices of a people victimized by<br />\nwar, and by thirty years of foreign oppression and aggression.<br />\nA Pelican Original.<br />\n$1.65<br />\nTESTAMENTS OF TIME. Leo Deuel. The story of how archaeologists have recovered the lost documents of ages past and<br />\nwhat these texts tell us of\\ancient civilizations. A Pelican Book.<br />\n$3.45<br />\n<br />\nTHE GREEK TRAGEDY. Constantine Tsoucales. A vivid description of the present political crisis in Greece and its historical antecedents. A Penguin Special Original.<br />\n$1.45<br />\nLook for these and other new Penguins—at your campus<br />\nbookstore now.<br />\n<br />\nNGIIIN BOON S INC<br />\nPC:<br />\n<br />\n7110 Ambassador Road<br />\n<br />\nMUST BRING<br />\nTHIS AD<br />\nWITH YOU<br />\n<br />\n11,.><br />\n<br />\nBaltimore, Md. 21207<br />\n<br />\nOC‘•<br />\n<br />\n1027-39<br />\nHillen SL<br />\n539 5390<br />\n<br />\n:..><br />\n<br />\nTHE INNOCENT EYE. Arthur Calder-Marshall. The story of the<br />\nlife and work of one of the most unique film-makers in cinema<br />\nhistory, Robert J. Flaherty. With 70 photographs from \"Nanook<br />\nof the North\" and other Flaherty films. A Pelican Book. $2.25<br />\n<br />\n1-><br />\n:<br />\n<br />\nc't7QQQi.v.)i.)cmimcw)wwwwciKirt1/4t*<br />\nAvailable at:<br />\n<br />\nThe Johns Hopkins Book Center<br />\nGilman Hall<br />\n<br />\n\fFeb. 24, 1970<br />\n<br />\nNEWS—LETTER<br />\n<br />\nJay's Nest<br />\n<br />\nBy GEORGE KIRSCHBAUM<br />\nsports Editor<br />\n<br />\nThe Administration's credibility gap has been of personal concern since last<br />\nspring when Dean Kimball claimed that the University had absolutely no money to<br />\ncontinued the then-dropped five sports and less than 48 hours later came up with<br />\n$45,000.<br />\nEarlier this Fall this editor wrote aneditorial on the absurdities of the admissions charges for some athletic contests at Hopkins. After the editorial went to<br />\npress, but before it appeared, word came from Bilgrave's office through a liaison that he would appreciate it if the News-Letter would cool down its attack on<br />\nthe admissions charges. For this favor assurancewas given that at the end of the<br />\n\"football\" season the entire policy would be reviewed.<br />\nThat was three months ago, and it is doubtful that the university has any intention of reviewing the policy until the end of the lacrosse season. This would be<br />\ntoo late for undergraduates to participate meaningfully in any decision making<br />\nbefore next year. Both the Fall and Winter season are now history except for postseason play. A review of the Admissions Policy is already one season late. Let's<br />\nnot make it two.<br />\n<br />\nAttempts Fail<br />\n. Bilgrave's refusal to allow this reporter to attend a meeting earlier this<br />\nfall<br />\nand the athletic committee's non-cooperation since Decerflber suggest<br />\nthat the<br />\nUniversity is guilty of the same thing they accuse the News-Letter of--hiding the<br />\ntruth.<br />\nCertain individuals in the Athletic Department feel that the News-Letter's<br />\n,sports pages should portray only the good aspects of their<br />\nprogram even though<br />\nthey realize that certain parts of their program are second<br />\nrate. They refuse to<br />\nbelieve that the News-Letter cares and is concerned<br />\nabout improving Hopkins<br />\nathletics. We are not on an ego trip. We criticize out of concern and<br />\nthe hope that<br />\nsomehow we help improve the program's shortcomings. The<br />\ncredibility gap lays<br />\nfar from the Gatehouse doors.<br />\n*****************<br />\n<br />\nHulabaloo Heresy<br />\nPlans are afoot in the Hulabaloo to do away with all team pictures for their<br />\n1970 edition. The News-Letter hopes that a human cry rises and falls blaspheming on the Hullabaloo's doorstep. A team is made up of more than select individuals or superstars. These players deserve to be represented in their yearbook.<br />\nEditor-in-Chief John Adams seems bent on falling into the same trap as past<br />\nyearbook editors. He is too concerned with the \"artistic\" aspects of the yearbook in lieu of a comprehensive- history of the school's yearlong activities.<br />\nAdams'<br />\nintentions of leaving out team pictures short-changes not only the<br />\nplayers of particular sports but also the subscribers who expect more than a<br />\npicture book of the \"editor's friends.\" Students who agree with this philosophy<br />\nare encouraged to voice their opinions.<br />\nHopkins deserves a better yearbookthanithas gotten for the past three years,<br />\nor the yearbook should be abolished.<br />\n<br />\nPAGE 7<br />\n<br />\n'Fencers Down Haverford,<br />\nI Dominate Sabre Matches<br />\nBy ED BRETHAUER<br />\n<br />\n20 out of 28 in this class. Coach Oles<br />\nis planning to send some of these freshmen to the North Atlantic Championships<br />\ntournament the weekend of March 7th<br />\nto gain even more experience for next<br />\nyear's team.<br />\nHopkins' next match will be against<br />\nTemple at home next weekend, and it is<br />\ndefinitely the toughest of the season.<br />\nHopkins will need a victory to maintain<br />\na winning record and some momentum<br />\nfor the MAC championships, which will<br />\nalso be at home the next weekend.<br />\n<br />\nLast Saturday, the Varsity Fencing<br />\nteam extended their record to 6-5, by<br />\nbeating Haverford in a close match, 1512. Hopkins won eight out of nine sabre<br />\nmatches, five out of nine in epee, but<br />\nonly two out of nine in foil matches. Outstanding in the victorywere Captain Keith<br />\nFulling in epee, Rich Hamburg, also in<br />\nepee and Gordie Rode in sabre (all of<br />\nwhom won three matches without losing<br />\nany).<br />\nIn matches previous to this, Hopkins<br />\nbattled to keep a .500 record. After<br />\nlosing to Penn State by the score of198 (only Rich Hamburg was successful in<br />\nthis match), Hopkins bounced back to beat<br />\nMuhlenburg by the score of 16-11. Keith<br />\nFulling, Keith Bucklen and Rich Hamburg<br />\nall won three matches to spur the team<br />\non to victory.<br />\nIn the last two meets before lastweekend, Hopkins won over Drew by the score<br />\nof 18-9, with Keith Fulling (3-0), Rich<br />\nHamburg (2-0), and Jesse Mashbaum<br />\n(2-0) leading the way,and lost to Stevens,<br />\n15-12.<br />\nThe big story this year for fencers has<br />\nbeen the Frosh fencing team, which has<br />\nthe chance to be the only undefeated<br />\nfreshman fencing team in the school's<br />\nhistory. Since winning their first match<br />\nagainst a local fencing club, they have<br />\nbeaten the Jewish Community Center,<br />\n17-10, The Stevens' Frosh, 16-11, the<br />\nJunior Olympic Squad, 14-13, and the<br />\nHaverford Frosh last weekend, 27-0.<br />\nThe Frosh, like the Varsity, have won<br />\nmost of their matches in the sabre<br />\nclass, having won 24 out of 36 there.<br />\nYet, they are best in epee, having won<br />\n<br />\nLEADING FENCERS<br />\nHAMBURG<br />\nFULLING<br />\nSCHWARTZ<br />\nROSENBAUM<br />\nRODE<br />\nBUCKLEN<br />\n<br />\nLEADING FROSH<br />\nFENCERS<br />\nEPEE<br />\nBender<br />\nGreen<br />\nComstock<br />\nAndrews<br />\n<br />\nFOIL<br />\n<br />\nTRADE-MARK<br />\n<br />\n7-3<br />\n7-6<br />\n3-7<br />\n<br />\nSABRE<br />\nCoroneos<br />\nSmith<br />\nSexsmith<br />\n<br />\nBOOK FAIR<br />\n<br />\nShould I<br />\nget the cans<br />\nor should I<br />\nget the bottles<br />\nof Coke<br />\n<br />\n8-2<br />\n9-3<br />\n5-3<br />\n4-3<br />\n<br />\nLittle<br />\nKerkman<br />\nKaminsky<br />\n<br />\n3121 ST. PAUL ST.<br />\nCARDS—BOOKS—GIFTS<br />\nSTATIONERY<br />\nMAGAZINES<br />\n<br />\n0/1<br />\n<br />\n19-7<br />\n22-10<br />\n20-13<br />\n11-9<br />\n10-10<br />\n14-14<br />\n<br />\n6-2<br />\n7-3<br />\n5-4<br />\n<br />\nStudent registration for second<br />\nsemester physical education programs will close Wednesday at 5.<br />\nRegistration is being held in the<br />\ngym office, ext. 791.<br />\n<br />\nIA ONE-DAY EXHIBITION Et SALE<br />\n/I<br />\n<br />\nGraphics<br />\npresented by<br />\n<br />\nLONDON GRAFICA ARTS<br />\nPublishers of contemporary printmakers<br />\n<br />\nII<br />\nMore than 400 lithographs, etchings,<br />\nwoodcuts and screenprints on show,<br />\nincluding works by: PICASSO, DURER,<br />\nGOYA, CHAGALL, DAUMIER, CASSAT,<br />\nGAUGUIN, TOULOUSE-LAUTREC<br />\nAlso MANUSCRIPTS AND MAPS<br />\nITEMS FROM $8 to $3000<br />\n<br />\nJOHN HOPKINS UNIVERSITY<br />\nSherwood Room — Levering<br />\nMonday — March 2, 1970<br />\n10 a.m. — 5 p.m.<br />\n<br />\nBOTTLED UNDER AUTHORITY OF TIME:<br />\n<br />\nCOCA-COLA BOTTLING COMPANY OF BALTIMORE, MARYLAND<br />\n<br />\nWant a Classified???<br />\nUse this easy-to-fill-out form<br />\nHEADING:<br />\n<br />\nHELP WANTED<br />\n<br />\nRIDES<br />\n<br />\nSUBLETS<br />\n<br />\nOTHER<br />\n<br />\nWORDING:<br />\n<br />\nBe Snug in Your Bug<br />\nIf you'd like to get around the high .cost of living,<br />\nwe have a suggestion.<br />\nCut down on the high cost of getting around.<br />\n<br />\nTO FIGURE COSTS: Figure 5i per word. $1 minimum.<br />\nClassifieds must be pre-paid by check or money-order. Send to The News-Letter<br />\nthrough campus mail do Box 1230.<br />\nWe must receive classified three days before the issue you want,(designate Tuesday<br />\n, or Friday).<br />\n<br />\nAnd buy a Volkswagen. lt's only $1839*<br />\n• Suggested reta4 price east coast P.O.E. Local taxes<br />\narid other dealer delivery. charges, if any, additional.<br />\n<br />\nMARYLAND VOLKSWAGEN<br />\n1212 E. 25th St.<br />\n(comilir x3f Harfoni Rd)<br />\n<br />\nPhone 889-7616<br />\n<br />\n1<br />\n<br />\n\fFeb. 24, 197(<br />\n<br />\nNEWS—LETTER<br />\n<br />\nPAGE 8<br />\n<br />\nMilitary Keeps Watch on Civilian Protest Politics<br />\nReprinted from The Washington Monthly<br />\nFor the past four years, the United<br />\nStates Army has been closely watching<br />\ncivilian political activity within the U.S.<br />\nNearly 1000 plainclothes investigators,<br />\nworking out of some 300 offices from<br />\ncoast to coast, keep track of polittcal<br />\nprotests of all kinds - from Klan rallies<br />\nin North Carolina to anti-war speeches<br />\nin Harvard..<br />\nWhen tht program began inthesummer<br />\n1965, its purpose was to provide early<br />\nwarning of civil disorders the<br />\nArmy<br />\nmight be called upon to quiet.<br />\nIn the summer-of 1967, however, its<br />\nscope widened to include the political<br />\nbeliefs and actions of individuals and<br />\norganizations active in the civil rights,<br />\nwhite supremacy, black power, and antiwar movements.<br />\nToday, the Army maintains files on<br />\nthe membership, ideology, programs<br />\nand practices of virtually every activist<br />\npolitical group in the country.<br />\nThese records are kept in the Investigative Records Repository in Washington, D.C. The personality files of the<br />\nactivitist group leaders are open both to<br />\nthe Army and anyone with security clearance.<br />\n<br />\nPolice Files<br />\nThe files include not only such violenceprone organizations as the Minutemen<br />\nand the Revolutionary Action Movement<br />\n(RAM), but such non-violent groups as<br />\nthe Southern Christian Leadership Conference, Clergy and Laymen United Against the War in Vietnam,the American<br />\nCivil Liberties Union, Women Strike For<br />\nPeace and the NAACP.<br />\n<br />\nThe Army obtains most of' its information about protest politics from the files<br />\nof muncipal and state police departments<br />\nand of the FBI,In addition,its agents subscribe to hundreds of local and campus<br />\nnewspapers, monitor police and FBI radio<br />\nbroadcasts and, on occasion, conduct<br />\ntheir own undercover operations.<br />\nMilitary undercover agents hayed posed a press photographers covering antiwar demonstrations, as students on college campuses and as \"residents\" of Resurrection City. They have even recruited civilians into their service - sometimes for pay but more often through appeals to patriotism.<br />\n<br />\nRegistrar Espionage<br />\nFor example, when Columbia University gave its students the option of closing their academic records to routine inspection by government investigators,<br />\nthe 108th Military Intelligence Group in<br />\nManhattan quietly persuaded an employee<br />\nof the Registrar's Office to disclose information from the closed files on the<br />\nsly.<br />\nTypical of the reports filed by Army<br />\nagents each month are the following,<br />\ntaken from the unclassified intelligence<br />\nsummary for the week of March 18,1968:<br />\n\"Chicago, Ill: Approximately 300<br />\nmembers of Veterans for Peace and Women for Peace held a peaceful de monstation at the Museum of Science and<br />\nIndustry protesting an exhibit by the U.S.<br />\nArmy. Several demonstrators entered<br />\nthe bulding in spite of warnings by museum officials and six were arrested on<br />\ncharges of disorderly conduct, resisting<br />\narrest, and criminal trespassing.Five of<br />\nthose arrested were juveniles.\"<br />\n<br />\nTo insure prompt communication of<br />\nthese reports, the Army distributes them<br />\nover a nationwide wire service.Completed in the fall of 1967, this teletype network gives every major troop command<br />\nin the United States daily and weekly reports on virtually all political protests<br />\noccurring anywhere in the nation.<br />\nThe Army also periodically publishes<br />\nan eight-by-ten inch glossy-cover paperback booklet known within intelligence<br />\ncircles as the \"blacklist.\" The \"blacklist\" is an encyclopedia of profiles of<br />\npeople and organizations who, in the opinion of the Intelligence Command officials who compile it, might \"cause trouble<br />\nfor the Army.\"<br />\n<br />\nSometime in the near future the Army<br />\nwill link its teletype reporting system to<br />\na computerized data bank. This computer, to be installed at the Investigative<br />\nRecords Repository at Fort Holabird in<br />\nBaltimore, eventually will be able to produce instant print-outs of information in<br />\n96 separate' categories. The plan is to<br />\nfeed it both \"incident reports\" and \"personality reports.\"<br />\nThe incident reports will relate to the<br />\nArmy's role in domestic disturbances and<br />\nwill describe such occurrences as bombings, mass violence and arms thefts.<br />\nThe personality reports - to be extracted from the incident reports - will be<br />\nused to supplement the Army's seven million individual security-clearance dossiers and to generate new files on the<br />\npolitical activities of civilians wholly unassociated with the military.<br />\nIn this respect, the Army's data bank<br />\npromises to be unique. Unlike similar<br />\n<br />\nWe've never announced a car at this time before.<br />\nBut then nobody's ever announced a car like this before.<br />\n<br />\nIf it were an ordinary sportster, we'd have introduced it at the ordinary time.<br />\nInstead, we took the time to build a whole new<br />\nCamaro.<br />\nWe started with a sleek new shape and a low roadhugging stance.<br />\nAnd added more hood. A faster fastback. Wider<br />\ndoors. And new deeply contoured bucket seats.<br />\nThe instrument panel wraps around you. With<br />\nenough dials to make you think you're piloting a 747.<br />\nThere are four transmissions. And six power plants<br />\nup to the Turbo-Jet 396 V8 that you can order.<br />\n<br />\nGOD<br />\n1POr<br />\n54. UOMMUNIcTs<br />\n,<br />\n4:\\<br />\n<br />\nMass Violence<br />\n<br />\nNew Camaro.<br />\nFeb.26th.<br />\nSuper Hugger<br />\n<br />\n'<br />\nFEAR<br />\n<br />\nPick the one that best suits your driving. Then go<br />\npick on an open road.<br />\nAnd make it one with plenty of twisting turns.<br />\nBecause Camaro has a remarkable new suspension.<br />\nAnd standard front disc brakes for a leech-like grip<br />\non the road.<br />\nNew Camaro. The Super Hugger.<br />\nOther sportsters always feared it might<br />\n. ---S,\"<br />\ncome to this.<br />\n\\<br />\nAnd they were right. Only their timing was wrong.<br />\nPutting you first, keeps us first.<br />\n<br />\nSee it.At your<br />\nChevrolet Sports Dept.<br />\n<br />\nToday, the Army maintains files on the membership, ideology, programs and practicesof<br />\nvirtually every activist political group in the<br />\npic by hoffmann<br />\ncountry.<br />\ncomputers now in use at the FBI's National Crime Information C enter in Wash'<br />\nington and New York State's Identification and Intelligence System in AlbanY,<br />\nit will not be restricted to the storageof<br />\ncase histories of persons arrested for<br />\n(or convicted of) crimes. Rather it will<br />\nspecialize in files devoted evclusively to<br />\ndescriptions of the lawful political activity of civilians.<br />\nThus an IBM card prepared manY<br />\nmonths ago for the future computer file<br />\nof Arlo Tatum, executive secretary of<br />\nthe Central Committee of Conscientious<br />\nObjectors, contains a single notationthat Tatum once delivered a speech at the<br />\nUniversity of Oklahoma on the legal rightS<br />\nof conscientious objectors.<br />\n<br />\nCLASSIFIED<br />\n•<br />\n<br />\nFOR SALE<br />\n<br />\nTHE GREAT White Wonder Dylan - double-album. The basement tapes and Dylan with The<br />\nBand, $9. Contact: KathY<br />\n<br />\nSackett, Goucher.<br />\nJOBS<br />\n<br />\n...<br />\n<br />\nJOBS! JOBS! and more JOBS!<br />\nStudents, Teachers. Stateside<br />\nand International jobs. Recreational jobs; year-round jobs; sap<br />\nmer jobs. All occupations and<br />\ntrades. Enjoy a vacation while<br />\nyou earn. Hurry! The best jobs<br />\nare taken early. Write: JOBS,<br />\nP.O. Box 475, Dept. CP 171-1,<br />\nLodi, Calif. 95420.<br />\nClassifieds run in both Tuesday and<br />\nFriday issues. Rates are 50 per word,<br />\n$1 minimum. Copy must be in our<br />\nhands, pre-paid, three days before<br />\nthe issue you specify. Ads and check<br />\ncan be sent to Box 1230 or brought<br />\nto the Gatehouse.<br />\n-.0<br />\n<br />\nGRADUATE CLUB<br />\nPARTY<br />\nSaturday, Feb. 28, 9 p.m.<br />\nClipper Room, Shriver Hall<br />\n<br />\nMusic by Aux<br />\nBeer by the Can<br />\n.....<br />\nSTUDENTS<br />\nPart-time jobs<br />\nNo fee - Hi $$$<br />\nApply:<br />\nStaff Builders<br />\nTemporary Personnel<br />\nVermont Federal Bldg<br />\n(next to Hamburger's)<br />\n<br />\nGM<br />\nMARK OF EXCELLENCE<br />\n<br />\nCamaro Sport Coupe with RS equipment.<br />\n<br />\n\f", "format": "basic_html", "processed": ".1.-7te Death of the American<br /><br />\npage 4<br /><br />\nthe johns hopktns university<br />\nNor<br /><br />\nLXXIV, No. 22<br /><br />\nTuesday, Feb. 24, 1970, Homewood, Baltimore<br /><br />\n74th Year<br /><br />\nFinch Highlights 94th Commemoration Day<br />\nBy PETER HARNIK<br />\nA near-capacity crowd filled Shriver Hall<br />\nYesterday afternoon to witness Commemoration<br />\nDay activities celebrating the 94th anniversary<br />\nof the founding of the University.<br />\nHighlighting the activities, in reverse order<br />\nof occurrence, were: a panel discussion among<br />\nSecretary of Health, Education and Welfare,<br />\nRobert Finch, President Andrew Cordier, of<br />\nColumbia and Professor of Psychology Kenneth<br />\nB. Clark, on \"The University in the Nation's<br />\nService\"; the induction of new members in the<br />\nJohns Hopkins Society of Scholars; and a Student Council-sponsored mini-demonstration on<br />\nthe subject of University Governance.<br />\nDespite the presence of Secretary Finch,<br />\nthe tone of the panel discussion was one of concern rather than of politics, and its format stuck<br />\nclosely to the concept of the University's 'service<br />\nPotential.' In his opening remarks, however,<br />\nPresident Gordon did give an indication of how<br />\nHealth, Education and Welfare Secretary, Robert Finch<br />\nclosely the modern university is tied to the<br />\nnation's political directions.<br />\nproblems. \"It is partly a reaction to Viet Nam,\"<br />\nUsed To Contribute<br />\nhe said, although he denied that the answer<br />\n\"The reason that Mr. Finch was not award- lay<br />\nin ignoring everything outside our own bored an honorary degree,\" the President explained,<br />\nders. Our present position is an example, he<br />\n\"is that his department used to contribute large<br />\nsaid, of \"excessive international fatigue, and the<br />\nsums of money to universities, and he felt that<br />\nimmaturity of our nation that we expect gratiit would not be right\" to accept such a degree<br />\ntude from the nations we help.\"<br />\nfrom Hopkins. Few in the audience missed the<br />\nHowever, he claimed, \"universities can<br />\nimplication.<br />\nbring vibrant objectivity to the international<br />\nEarlier in the afternoon, Drs. Cordier and<br />\nscene, and thus give a proper balance to domesClark had received honorary Doctor of Laws detic and foreign commitments. Universities can<br />\ngrees, conferring upon them the distinction of<br />\nplay a vital role in finding solutions to world<br />\nbeing honorary alumni of Johns Hopkins.<br />\nThe panel discussion, which in effect work- problems and act as catalysts in reducing tensed out to be a presentation of three statements ions,\" he concluded.<br />\nDomestic Needs<br />\nfollowed by a brief question-and-answer period,<br />\nAlthough<br />\nnot<br />\nspecifically contradicting<br />\ncentered upon the university's adaptability in a<br />\nhim,<br />\nboth<br />\nClark<br />\nand<br />\nFinch spent their allotted<br />\nrapidly-changing world.<br />\ntimes<br />\non<br />\nthe<br />\ndiscussion<br />\nof domestic needs and<br />\nDr. Cordier, a political scientist, spoke aproblems,<br />\nand<br />\nhow<br />\nthe<br />\nuniversity can help.<br />\nbout the university's potentials in the field of<br />\nClark<br />\nsaying<br />\nbegan<br />\nby<br />\nthat,<br />\nalthough univerforeign affairs. In 1945, he said, the U.S. rapidsities<br />\nhave<br />\ntended<br />\nto<br />\nbe<br />\n\"monastic\"<br />\ninstitutions,<br />\nly and emphatically assumed a new role in world<br />\nthe<br />\nrise<br />\nof<br />\npublic<br />\neducation<br />\nin<br />\nthis<br />\ncountry<br />\nhas<br />\npolitics. \"Now after 25 years, Ave are involved<br />\nbecome<br />\n\"monument<br />\na<br />\nto<br />\nthe<br />\npotential<br />\nand<br />\nactin a re-examination of that role. Both at home<br />\nual greatness of American democracy.\" He exand abroad we are facing major challenges.\"<br />\nplained,<br />\nhowever, that the change from financial<br />\nCordier also spoke of the growing tendency<br />\nselectivity<br />\nto intellectual selectivity did not refor intellectuals to steer away from the interall<br />\nof<br />\nsolve<br />\nthe problems inherent in the educanational scene in favor of this country's internal<br />\ntional community.<br />\n\"The change by dissidents that there is no<br />\n'relevance' today is not true. Colleges have<br />\nmade relevant, pragmatic contributions in all<br />\nfields. The major disadvantage, though, to our<br />\nsystem is that it has still remained isolated.<br />\nLittle regard has been given to fundamental<br />\nLhuman values.\"<br />\n\"Our educators,\" he continued, \"have precipitated an existential crisis in our younger<br />\ngeneration. The meaning of life—in the durable<br />\nsense—has not beeh adequately called into question. We are suffering from the consequences<br />\nof success, though an incomplete success.\"<br />\nClark's closing statement, \"We must find<br />\nsome way to make democracy substantively,<br />\nrather than verbally, desirable,\" drew loud, sustained appluase from the audience.<br />\nDr. Andrew Cordier, President of Columbia<br />\nSecretary Finch opened his talk by compix by hoffmann<br /><br />\nmenting that Hopkins has traditionally been an<br />\n\"iconoclastic institution.\"<br />\n\"We must face up to the fact,\" he said,<br />\n\"that 70% of the nation's population is living<br />\non approximately two percent of the land. The<br />\nurban university generally finds itself in the<br />\nmidst of this group, one which is growing and<br />\nwhich has ever-rising expectations.\"<br />\n\"The university is forced to be an employer, a landlord, and a teacher, and is thought of<br />\nby its students as mother, cop, and governmental<br />\nauthority. All this is compounded by the fact<br />\nthat it tends to be white in a non-white neighborhood.\"<br />\n\"New Arrangements\"<br />\nFinch emphasized that \"new institutional<br />\narrangements\" would have to be made soon if<br />\ninternal harmony is to be attained. \"How do we<br />\nget more doctors and more secondary school<br />\nteachers? My department's estimates are that<br />\nwe need 200,000 more doctors to provide the<br />\nnation with non-discriminatory medical services.<br />\nAs it is, 40% of our country's medical profession<br />\nis trained overseas. We should be exporting, not<br />\nimporting, doctors.\"<br />\nFinch summed up by explaining the in-<br /><br />\nDr. Kenneth Clark, Professor of psychology at CCNY<br /><br />\nherent duality of the university's position. \"We<br />\nask so much of the modern university—that it<br />\nserve government, business, the community, the<br />\nindividual and many others—that there is an unavoidable tension between the necessary degree<br />\nof isolation and the forced amount of participation.\"<br />\nEarlier in the afternoon, eleven new members were inducted into the University's twoyear-old Johns Hopkins Society of Scholars.<br />\nThe society, the only one of its kind in the<br />\nnation, inducts former postdoctoral fellows at<br />\nHopkins who have gained marked distinction in<br />\ntheir fields.<br />\nThe S.C.-sponsored demonstration which<br />\ntook place outside as the proceedings began,<br />\ncentered around a petition- drive which demanded that the General Assembly join with the students in establishing a new representative governing body for the Homewood campus. Approximately 30 students took part without incident.<br /><br />\nPAGE 2<br /><br />\nNEWS—LETTER<br /><br />\nFeb. 24, 1970<br /><br />\nviewfrom here Dope Politics Long Time<br />\nComin'l<br />\nBy D. TEUFELSDROCKH<br />\nThere has been a lot of shit flying around lately to the<br />\neffect that the Maryland House of Delegates (God Bless<br />\nThem)is all set to legalize dope,or at least really reduce<br />\nthe penalties, or something good anyway. What a fine<br />\ndaydream. Smoking dope with impunity, leering smugly .<br />\nas you blow smoke at the man, etc., etc.<br />\nAnd, unlike most of the wishful-thinking rumors that<br />\ngo around, this one even has a vague foundation in reality.<br />\nPretty vague, though. After a very hot summer (30 and<br />\n40 busts a month), there has been a noticeable decrease<br />\nIn cannabis busts. The logical imputation is correct - Mandel, after making his point, has ordered the Baltimore<br />\nPolice (who are under his direct control,not the Mayor's)<br />\nsuspend grass and hash raiding.(That,by the way, does not<br />\nmean that if you get caught holding by accident you're off<br />\nthe hook. You're busted.) A local political personality<br />\neven asserted that Mandel is surreptitiously backing the<br />\nliberals on the issue in Annapolis.<br />\nAnd here's the scoop-dope actually is an issue in Annapolis. Not much of an issue, to be sure. The opposition<br />\nis just about sure to blast it somewhere up into the<br />\n1990's.<br />\nJust for the record, though, there are three bills prefiled for the 1970 session of the General Assembly. The<br />\nmost tepid of all is the usual deal about how more research<br />\nshould be done on the subject.(sounds like one of those<br />\ncautious editorials in Time, yes?) To this end, Delegate<br />\nJacobson is the sponsor of a bill \"to request that the State<br />\ncooperate with the Federal Government in the funding and<br />\ndevelopment of research programs concerning marijuana<br />\nand hashish.\" Very big deal.<br />\nOne guy, Sen. Stone by name, wants to give methadone<br />\nto smackheads. A more promising bill, filed by Senator<br />\nBishop, provides that under certain circumstances, a<br /><br />\nEdward J. Bagley, State Senator from Prince Georges County.<br />\njudge may exercise the option to reduce the charge to a<br />\nmisdemeanor.(Now, it's a felony, with a mandatory sentence).<br />\nThe most radical bill of all, and oddly enough, the one<br />\nwith the best chance of getting passed, was prefiled in<br />\nDecember by one Del. Edward J. Bagley(D.,Prince Geo-<br /><br />\nrge's County). Seems Prince George's (a more-thanaverage wealthy suburb of Washington) was getting a little<br />\nuptight about all these nicemiddleclass kids getting shafted. Charity starts in the home.The bill provides that \"the<br />\npossession and use of marihuana shall be a misdemeanor...<br />\n(and) providing penalties therefore.\" The penalties,I was<br />\ninformed, were $250 and/or 6 months for first offenders,<br />\nand double penalties for subsequent offenders.<br />\nOn the whole, not a bad deal. For the time being, anyhow. And the best thing is that Bagley's bill has support<br />\nIn the General Assembly. Maybe, even the Governor's.<br />\nOutasight! Utopia dawning.<br />\nDon't believe it for a minute. That bill is going to get<br />\nstomped, like a cockroach. The atmosphere in the Assembly is about as paranoid as it can get. One Delegate<br />\nGerald J. Curran, reportedly made a speech against a<br />\nbill to lower the age at which one may sell his blood<br />\nwithout parental consent from 21 to 18, asserting that<br />\nyoung people would use the money to buy illegal drugs.<br />\nThe bill to lower the voting age will probably get fewer<br />\nvotes this year than last. A State Senator, who asked to<br />\nremain unnamed, said in an interview, \"The attitude<br />\nof my colleagues in the Legislature is appaling....they're<br />\nIgnorant - they don't know what the kids are trying to tell<br />\nthem. They talk to old people mostly, and old people are<br />\ntired of demonstrations. Some crazy amendments are being tacked on (to other bills) - like hang 'em in public.\"<br />\nDepressing, isn't it? I mean, everyone knows that<br />\nsooner or later, the government is going to have to accept<br />\na few of the realities of the situation. But everyone also<br />\nknows that the government has to be pushed pretty hard<br />\nbefore it gets down to business. So far, nobody seems to<br />\nhave done too much pushing.(Forgive the pun, it wasn't<br />\nintended) The other thing is, of course,that the Assembly<br />\nis populated largely by fossils. Don't worry,though,they'll<br />\nall be gone probably within thirty years or so.<br /><br />\nArab, Israeli Diplomats Come<br />\nSeparately to Discuss Middle East<br />\nThe Jordanian and Israeli ambassadors to the United<br />\nStates and a high-ranking State Department official will<br />\ntake part in a lecture series on the Middle East at The<br />\nJohns Hopkins University.<br />\nThe first program will feature Abdul Hamid Sharaf,<br />\nambassador of Jordan to the United States, who will speak<br />\nWednesday at 4 p.m. in Shriver Hall on the University's<br />\nHomewood Campus. The program is open to the public<br />\n-without charge.<br />\nThe Israeli ambassador, Yitzhak Rabin, will speak at<br />\nJohns Hopkins on March 12. Rodger P. Davies, U. S.<br />\nDeputy Assistant Secretary of State for Near Eastern and<br />\nSouth Asian Affairs, will appear April 16.<br />\nDean Wm Rudoy, a junior at Johns Hopkins, explained<br />\nthat the series will provide a forum for the presentation of various policy perspectives concerning the Middle<br />\nEast crisis.<br /><br />\n\"We would like the Israeli and Jordanian ambassadors<br />\nto outline their proposals for resolving the conflict, and<br />\nwe hope that the representative of the United States will<br />\nindicate to what extent this country should be involved in<br />\nthe Middle East,\" he said.<br />\nThe lecture series is sponsored by the International<br />\nForum, which was started two years ago by undergraduates to attract speakers on international affairs to Johns<br />\nHopkins.<br />\nAbdul Hamid Sharaf was born in Baghdad, Iraq, and is<br />\n_<br />\n_<br />\nnow a Jordanian citizen. He was educated in schools in<br />\nAmman, Jordan, and then received a bachelor's degree<br />\nfrom the American University in Berirut, Lebanon. He<br />\nholds a master's degree from the same university.<br />\nHe began his career in the Jordanian foreign ministry<br />\nin 1962 as head of Arab and Palestine affairs. Since 1967<br />\nhe has been ambassador to both the United States and<br />\nCanada.<br /><br />\nAbdul Ilamid Sharaf, Jordanian Ambassador to Washington,<br />\nwill be featured lecturer in Middle East series on Wednesday.<br /><br />\nNP1J6CAULJL<br />\nThis calendar is prepared by the Office of<br />\nPublic Information, Shriver Hall. Copy deadline is Friday noon of the week preceding<br />\npublication.<br />\n* Means open to the public without charge<br />\n(unless admission price is indicated)<br />\n** Means open daily to faculty and students<br />\nofJohns Hopkins<br /><br />\nWEDNESDAY/FEBRUARY 25<br />\n*2:00 to 4:00 p.m. THE CHAPLAIN'S<br />\nOFFICE (Board Room Levering Hall)<br />\nDraft counseling by prior appt. in the<br />\noffice of the Chaplain, Levering Hall.<br /><br />\nTUESDAY/FEBRUARY 24<br />\n*11:00 a.m. ROMANCE LANGUAGES<br /><br />\nTHURSDAY/FEBRUARY 26<br /><br />\n- Garrett Room, MSE Library - Jean<br />\nPierre Faye, French Novelist (Prix Renaudot)-\"Le recit et le change des formes\"<br />\n*12:05 p.m. THE CATHOLIC COMMUNITY ON CAMPUS-Chapel, Levering Hall. Weekday Liturgy (Thru Friday)<br />\n*2:00 to 4:00 p.m. THE CHAPLAIN'S<br />\nOFFICE,-Board Room, Levering Hall.<br />\nDraft4aurkse1ing by prior appt. in the<br />\noffice °Nile Chaplain, Levering Hall.<br />\n*3:00 p.m. BIOPHYSICS--Jenkins 1077Prof. Robert B. Loftfield, Univ. of New<br />\nMexico at Albuquerque-\"Physico-chemical aspects of protein synthesis\"<br />\n*4:30 p.m. MATHEMATICS-Rowland<br />\n302--Prof. Leon Ehrenpreis, Math. Dept.<br />\nYeshiva Univ.-\"The Poisson Summation<br />\nFomula\"<br />\n*5:00 p.m. BIOMEDICAL ENGINEERING-Talbot Library, 528 Traylor Research Bldg.-Dr. Shyam M. Khanna, Coll.<br />\nof Physicians &amp; Surgeons of Columbia<br />\nUniv. N.Y.-\"Holographic Study of Tympanic Membrance Vibrations in Cats\"<br /><br />\n*10:00 to 5:00 p.m. THE CHAPLAIN'S<br />\nOFFICE (Sherwood Room, Levering<br />\nHall) Ferdinand Roten Galleries Exhibition and sale of prints and graphics.<br />\n*10:30 a.m. ELECTRICAL ENGINEERING DEPARTMENT (Ames 325)<br />\n-Dr. Thammavarapu RN. Rao, Dept of<br />\nEE, Univ. of Md.--\"Single Error Correcting Codes for Computer Arithmetic<br />\nUnits\"<br />\n*4:00 p.m. PHYSICS (Rowland 205)Prof. Donald S. McClure, Princeton\"Optical Properties of Magnetic Insulators.\"<br />\n*4:00 p.m. OPERATIONS RESEARCH<br />\n&amp; INDUSTRIAL ENG'G (Maryland 226)<br />\n-Mr. Maximilian Elschmaier, West Germany<br />\n*5:00 p.m. BIOMEDICAL ENGINEERING (Seminar Room B Turner Auditorium-Samuel Ron, Grad. Student, Biomedical Eng'g JHU-\"Who needs the<br />\ncerebellum? (For eye movement)\"<br />\n*7:30 p.m. THE CATHOLIC COMMUN-<br /><br />\nITY ON CAMPUS (Newman House,<br />\n2941 N. Charles)--The \"Awareness<br />\nGroup meets.<br /><br />\nCommunity Series---The Role of the Legal Aid Bureau\" Mr. Joseph Matcra,<br />\nExec. Dir., Legal Aid Bureau.<br /><br />\nFRIDAY/FEBRUARY 27<br /><br />\nMONDAY/MARCH 2<br /><br />\n*1:30 p.m. MECHANICS (Latrobe 111112)--Prof. C. A. Truesdell, dept. of<br />\nMechanics JHU-\"Negative Pressures in<br />\nFluids:'<br />\n*2:00 p.m. APL/JHU HOWARD COUNTY LABORATORY (Pearsons Auditorium)-Prof. Robert H. Kargon, JHU\"Science'S Public Malaise\"<br /><br />\n*9:45 a.m. to 3:00 p.m. JHU/AMERICAN RED CROSS BLOOD DRIVE<br />\n(Great Hall, Levering Hall) Register at<br />\nDivisional Personnel Office: Whitehead<br />\n101, ext. 1204<br />\n*10:00 a.m. to 5:00 p.m. THE CHAPLAIN'S OFFICE (Sherwood Room Levering Hall) London Grafica Arts Inc.<br />\nExhibition and sale of original graphics.<br />\n*12:05 a.m. THE CATHOLIC COMMUNITY ON CAMPUS (Chapel) Weekday Liturgy (Thru Friday)<br />\n*2:00 to 4:00 p.m. THE CHAPLAIN'S<br />\nOFFICE (Board Room Shriver Hall)--<br /><br />\nSUNDAY/MARCH 1<br />\n*10:30 a.m. THE CATHOLIC COMMUNITY ON CAMPUS (Shaffer 3)--The<br />\nSunday Liturgy<br />\n*11:00 a.m. THE CHAPLAIN'S OFFICE (Great Hall Levering Hall)--The<br />\nLevering Hall Sunday Service. Discovering American Series: \"The MexicanAmerican\" Rev. Eugene Boulitier, Migrant Minister and Wash. DC Boycott<br />\nRep., United Farmworkers.<br />\n*5:00 p.m. THE CATHOLIC COMMUNITY ON CAMPUS (Newman House<br />\n2941 N. Charles) The Sunday Liturgy<br />\n*8:00 p.m. THE CHAPLAIN'S OFFICE<br />\n(Great Hall Levering Hall)--Courts and<br /><br />\nDraft Counseling by prior appointment<br />\n*4:00 p.m. History Department clipper<br />\nRoom Shriver Hall<br />\nThe James Schouler Lectyre Serues, Dr.<br />\nJacques VErger-\"The University of Paris<br />\nat the End of the Hundred Years War\"<br />\n*5:00 p.m. THAYER LECTURE-SCHOOL OF MEDICINE (Turner Auditorium-Dr. Carl V. Moore, Busch Prof.<br />\nof Medicine Wash. Univ. School of Med.<br />\n&amp; Physician-in-chief, Barnes Hospital,<br />\nSt. Louis--\"Iron Deficiency and Nutrition\"<br /><br />\nFeb. 24, 1970<br /><br />\nNEWS—LETTER<br /><br />\nPAGE 3<br /><br />\nProgram Participants Applaud Urban Studies<br />\nBy RICHARD B. CRAMER<br />\nThe spring semester has seen Hopkins successfully take its first tentative<br />\nsteps toward establishing a full-fledged<br />\nprogram in urban studies.<br />\nFive Hopkins undergraduates, joined<br />\nby five Morgan State students, and taught<br />\nby four faculty members from Morgan,<br />\nHopkins and Maryland University Law<br />\nSchool, are receiving seven and onehalf credits for the semester in Urban<br />\nStudies.<br />\nThe program features a work-study<br />\narrangement whereby students work for<br />\ntwenty hours per week in a city governmental or service agency, and also attend a seminar for three hours on Tuesday nights.<br />\nThe seminar is held in the home of<br />\nEugene Feinblatt. Co-Director of thp<br /><br />\nHopkins Urban Affairs Center, located<br />\nIn the School of Hygiene. Together with<br />\nDr. Sol Levine, the Center's other Director; Dr. Robert Crain, Professor of<br />\nSocial Relations at Homewood; Perrin<br />\nMitchell, a professor at Morgan State;<br />\nand a Professor of Law from the University of Maryland, Feinblatt attempts<br />\nto provide discussion and readings which<br />\nwill complement the students' experiences at their jobs.<br /><br />\nAssembly, or \"see how well Baltimore<br />\nhas done for the year.\"<br />\nHis observation consists of attendance<br />\nat meetings, planning sessions and political caucuses. The Mayor's Task Force.<br />\nin Annapolis tries to promote the interests of the Baltimore Metropolitan<br />\narea among members of the General Assembly.<br /><br />\n\"High Calibre\"<br /><br />\n\"Learned a Lot\"<br /><br />\nJim Archibald, who is aiding in a study<br />\nof housing in the Baltimore area, also<br />\nfeels that the program has been rewarding. He, like most of the other participants stated that there was a balance<br />\nin the benefits derived by the students<br />\nand the agences they work for.<br />\nArchibald stated that the city received<br />\n\"fairly high calibre\" work from the students at no cost. The students, he said,<br />\ngained valuable experience which they<br />\nmight not obtain otherwise.<br />\nThe program to which Archibald is<br />\ncontributing is administed by the Neighborhood Development Division of the<br />\nDepartment of Housing and Community<br />\nDevelopment of Baltimore City. Archibald and his co-worker are sampling<br />\nfive to ten percent of the blocks in each<br />\nof the city's forty housing districts. Among the ten questions which the survey<br />\nwill answer are: the materials from<br />\nwhich the houses are constructed, the<br />\nnumber of vacant houses on each block,<br />\nthe size of the lots, etc. If the study is<br />\nsuccessful, city housing inspectors will<br />\nknow which districts require _closer or<br />\nmore frequent inspection.<br />\nSteve Kelsey is working with an agency<br />\nconcerned with coordinating governmental action within the metropolitan area.<br />\nBarry Rosen is engaged in a \"costbenefit\" analysis for the Upton Project<br />\nin the Baltimore Urban renewal project.<br /><br />\nThe five Hopkins undergraduates participating in the program are Jim Archibald, Ken Jones, John Blumenthal,Steve<br />\nKelsey and Barry Rosen.<br />\nThe program is entitled the Mayor's.<br />\nFellowship Program. The students receive no salaries for their work with<br />\nthe agencies. Their seven and one-half<br />\ncredits are awarded on a pass-fail basis.<br /><br />\nStudent Apathy<br />\nSlows Conduct<br />\nProtest Effort<br /><br />\nAll of the students contacted felt that<br />\nthey had learned a great deal from their<br />\nexperiences in the agencies. Ken Jones,<br />\na junior who has been working with the<br />\nMayor's commission for laison to the<br />\nMaryland General Assembly said,\"Certainly I've learned a lot...mostly, I've<br />\nenjoyed it tremendously.\"<br />\nJones spends twenty hours per week<br />\nin Annapolis in what he terms \"a combination of participation and observation.\" His participation, at this point,<br />\ncenters around the files which he keeps,<br />\non every bill in the legislature which is<br />\nof interest to Baltimore City. At the<br />\nend of the session, Jones will try to<br />\ncheck the city's record in the General<br /><br />\nStudent apathy is facing the organizers of the anti-Gordon Discipline Code<br />\npetition now in their third week of canvassing.<br />\nJim Cleary, organizer of the undergraduate petition, said that he had \"no<br />\nidea\" if his group can garner enough<br />\nstudent signatures to fulfil the 25% quota<br />\nrequested by President Gordon. So far,<br />\na few hundred students have signed the<br />\nPetition out of the 2,000 undergraduates<br />\non campus. The petition will be sent to<br />\nthe President in the next few weeks.<br />\nCleary stated that their main handicap<br />\nhas been general disinterest in the Discipline Code. \"Guys aren't taking any<br />\nPosition at all,\" Cleary asserted.\"Most<br />\nof them haven't read either Gordon's,<br />\nthe Student Affairs Committees' reports<br />\nor the News-Letter's account of the discipline issue.\"<br /><br />\nBlumenthal Pissed<br /><br />\n\"Couldn't Care Less\"<br />\nThe President of the Graduate Student<br />\nOrganization, Bob Cotter, said that the<br />\ngraduate anti-Gordon petition is going<br />\nvery slowly. \"We're just getting started,\" Cotter noted, \"but already we have<br />\nfound that a lot of graduates couldn't<br />\ncare less about the subject.\"<br />\nHowever, Cotter observed that the<br />\nGrad Organization is not trying to get<br />\n25% of their constituents to sign. \"We<br />\nare not doing this (petition) for Gordon<br />\nto consider. We are demanding that Gordon remove his document, that it was<br />\nillegitimate from the start for Gordon<br />\nto overrule the Student Affairs discipline report.\"<br />\nTo this Cleary asked, \"Gordon has<br />\nthe power. How can we demand anything?\"<br /><br />\nDr. Robert Crain of the Department of<br />\nSocial Relations is one of the instructors<br />\nin the Urban Studies Seminar.<br /><br />\nThe only student who seemed less<br />\nthan entirely satisfied with the program was John Blumenthal. His work,<br />\nuntil this week, had consisted of comparing assessments of property with<br />\ntheir actual price when sold on the<br />\nmarket. Blumenthal was going to work<br />\non an area-wide survey of this type for<br />\nthe Housing and Community Development Agency.<br />\nHe opted to change jobs in midstream, however, when he learned that<br />\nthe city planned to make such a survey city-wide. \"My work would have<br />\nbeen redundant,\" he sighed.<br />\nOne other complaint was voiced by<br />\nJones, who stated that the students<br />\ndeserved \"either marks or more credit\" for their work in Urban Affairs.<br />\nJones, who also holds another job, said<br />\nhe finds it difficult to keep the schedule<br />\nwhich his work requires.<br /><br />\nEat-in, Carry-out<br /><br />\nThis discussion at the Tuesday seminars center mainly on the students' experiences on their jobs. The five students from Morgan State have only attended the seminar once. One student<br />\nreturned a second time, but since then,<br />\nthey have virtually disappeared from that<br />\nphase of the program.<br />\nAll of the students voiced the possibility that the program might be expanded<br />\nfor next year. As yet, there is no organized activity to insure that be the<br />\ncase.<br /><br />\nAssault Shakes<br />\nGatehouse Calm;<br />\nN-L Dook Safe<br />\nspecial to the News—Letter<br />\nNews-Letter Editor-in-Chief Richard<br />\nCramer was bodily assaulted and his<br />\nwell-being was threatened,<br />\nphysical<br />\nearly Monday morning by John Blumenthal, a Hopkins Junior.<br />\n, Blumenthal, one of five undergraduates participating in a new Urban Studies<br />\nprogram, accosted Cramer outside the<br />\nGatehouse at approximately 2:30 Monday<br />\nmorning.'Cramer had called him shortly<br />\nbefore to ask about the program and<br />\nBlumenthal's role in the Housing and<br />\nCommunity Development Agency.<br />\nWitnesses on the scene confirmed that<br />\nBlumenthal, alter demanding to see the<br />\narticle, grabbed Cramer at the neck and<br />\nattempted to wrest the notes on the story<br />\nfrom the writer's hand.<br />\nBlumenthal stated that if anything about<br />\nhim appeared in the article, he would<br />\n\"bust your (Cramer's) ass.\" Cramer<br />\nlater told police Officer H. G. Hilnbrand that none of the notes on the article contained anything which would be<br />\npersonally objectionable to Blumenthal.<br />\nWitnesses said that they believed Blumenthal was upset about being called at<br />\nsuch a late hour. During the telephone<br />\nconversation, according to Cramer,Blumenthal gave no indication that he was<br />\nother than mildly annoyed. As he entered the office, Blumenthal insisted that<br />\nhe had thought it was 8:00 a.m. This<br />\nseemed to annoy him most of all.<br />\nGeorge Klopfer, who was present throughout the episode, considered Blumenthal's actions unexplainable. \"It looked<br />\npretty dark for eight o'clock in the morning,\" Klopfer opined. At deadline, Cramer was undecided as to whether he<br />\nwould press charges.<br /><br />\njweyiw'<br /><br />\n!EN'S<br />\n3121 St. Paul Street<br /><br />\nJeep<br />\nFull line of<br />\n4-wheel drive<br />\nwork and play<br />\nvehicles.<br /><br />\nIt's about an era ofsin<br />\nand wickedness, when crooks were<br />\nthe good guys and a house was a home...<br />\nand a madam could be<br />\nyour mother!<br />\nre<br /><br />\nThink Of All Of Life's Pleasures.<br />\nDouble Them.<br />\nAILY.<br />\nAnd Live... 4<br /><br />\nw:GORNvE8ER<br /><br />\nGLADIATOR<br />\nA<br />\n4 OR V6<br />\nUNIVERSAL<br />\n,EXCITING lEEPSTER' SERIES!<br />\nTAKE A TEST DRIVE TODAY!<br /><br />\nPremiereTomorrow!<br /><br />\nSALES•SERVICE•PARTS<br /><br />\nWORLD FARE<br /><br />\nFINE SELECTION OF USED CARS,<br /><br />\nCINEMA I<br /><br />\nCINEMA II THE 5 WEST PARAMOUNT PIKES<br /><br />\nYalu idge Shopping<br />\nCenter •252 2256<br /><br />\nYak r idge Shopping<br />\nCenter•252 2256 I<br /><br />\nHERRING JEEP<br />\n889-1719'<br /><br />\ni<br /><br />\nWORLD F ARE<br /><br />\nI<br /><br />\nWOR10 F ARE<br />\nNorth at Charles<br />\n837 1956<br /><br />\nI<br /><br />\n1<br /><br />\nWOR1D f ARE<br />\n6650 Belair Road<br />\n426 6875<br /><br />\nexhibit).<br />\nI sale of<br />\noriginal<br />\ngraphics<br />\niOr allslors<br />\nby<br />\nChagall,<br />\nBaskin,<br />\nRouault,<br />\nDaumier<br />\n&amp; many<br />\nothers<br /><br />\nrye'<br />\n,<br /><br />\n310 W.27 St.<br /><br />\nThe reading list for the course, in<br />\nthe words of the participants, is \"relevant and interesting.\" It includes<br />\nitems such as the budget for Baltimore<br />\nCity. The idea is that the budget for any<br />\ngovernmental system demonstrates exactly where the priorities of that system<br />\nlie.<br /><br />\nif<br />\nPihesville<br />\n486 5848<br /><br />\nArranged by<br />\nFeroinand<br />\nRoten Gaileries,<br /><br />\nBaltimore, Md.<br /><br />\nJohns Hopkins University<br />\nLevering Hall<br />\nSherwood Room<br />\nThursday, February 26<br />\n10 A.M. to 5 P.M.<br /><br />\nFR<br /><br />\nPAGE 4J<br /><br />\nFeb. 24, 1970<br /><br />\nNEWS—LETTER<br /><br />\nNews-Letter<br /><br />\nBenzon<br /><br />\nthe johns hopkins university]<br />\nRichard B. Cramer, Peter Harnik<br />\nKevin Kresock<br /><br />\neditors-in-chief<br />\nbusiness rnanager<br />\nTUESDAY<br /><br />\nEmil Pavlovics<br />\nTed Rohrlich<br /><br />\nday editor<br />\nmanaging editor<br />\nFRIDAY<br />\nday editor<br />\nmanaging editor<br /><br />\nMark Reutter<br />\nStephen Tulloss<br /><br />\nresearch editor: Stuart Seidel<br />\nphotography: Thomas Hoffmann<br />\nsports editor: George Kirschbaum<br />\nfeatures editor: John D. Hollis<br />\nreporters:<br />\nMike Hill, Ken Bakalar, Art Levine, Sandra Hammer<br />\nstaff writers:<br />\nHarvey Luksenburg, Marc Krizack, Andy Green<br />\nstaff members:<br />\nPeter Kates, Bill Linder, Steve Gray, Mike Weissman,<br />\nJan DeKenis, Mike MacAdams, Howard Levenson, Larry hammer,<br />\nRalph Moller, Howard Goldstein, Steve Buckingham, Joe Cantor.'<br />\nsports staff.<br />\nJay Rasin, Ed Brethauer, Pete Hughes, Mark Heller,<br />\nRalph Rothwell<br />\n`photography staffTom Lemm,Tom Anderson, Richard Rosenthal<br />\nGeorge Uhl, Oliver Engel, Jim Battis<br />\ncopy staff:<br />\nJay Lenrow, Elliott Treby<br />\nbusiness staffHarry Keyserling, Peter Hughes<br />\ncartoons:<br />\nJed Kirschbaum<br /><br />\nWhat Ever Happened to•••<br />\nAlmost one year ago to the day, Maryland public colleges and universities were ordered to desegregate their<br />\nfacilities. Despite much law-and-order bantering on the<br />\npart of concerned local officials, the state has not complied, nor made any concete effort in the direction of<br />\ncompliance.<br />\nThe original order came down from the civil rights<br />\ndivision of HEW, which warned that non-compliance<br />\nwould result in a loss of federal funds. Despite non-compliance, there has been no such loss. At the time of the<br />\norder—until last - week—the civil rights (i.e. enforcement)<br />\ndivision was headed by Mr. Leon Panetta. Last week, the<br />\nWhite House resigned Mr.Panetta, who was regarded as too<br />\nzealous for middle America on civil rights.<br />\nPanetta was reportedly the pawn in the latest of the<br />\nnever-ending series of Nixon-Finch power struggles, which<br />\nNixon invariably wins. This time Agnew had the gripe<br />\nfrom the White House side. It seemed to Agnew that<br />\nPanetta had diabolical plans to destroy white collegiate<br />\nsanctuaries in Agnew's own back yard, and possibly risk<br />\nexacerbating tensions by mixing the races.<br />\n•Despite recent Supreme Court rulings calling for immediate integration wherever segregation or de facto segregation is found, Maryland colleges—for that matter, Maryland<br />\nhigh schools--remain as they were a year ago, predominantly one-race institutions. The University of Maryland at<br />\nCollege Park, for example, was and is 99 per cent white.<br />\nIts Princess Anne County campus is 92 per cent black. And<br />\nso on down the line.<br />\nTo improve racial balance, the state college Board of<br />\nTrustees commissioned a $12,000 study of the problem,<br />\nand asked the administration of each college to submit its<br />\nown recommendations. The oursider can only assume that<br />\nthese reports have been carefully scrutinized—for they<br />\nwere doubtless all in the bureaucratic verbiage that warrants scrutinization without regard to content —and tossed<br />\naway, along with Mr. Panetta.<br />\nThe original deadline for submission of a desegregation<br />\nplan was set for last July. But'the summer, fall, and most<br />\nof the winter have passed without incident, as Maryland<br />\n- has still not submitted a plan and Nixonian officials have<br />\ndeclined to take public notice. Panetta became an exNixonian official precisely because he was no longer<br />\ndeemed trustworthy to remain silent while the law was<br />\nsystematically abused by government officials entrusted<br />\nwith its enforcement.<br />\nIsn't it nice having a Vice-President from Maryland?<br /><br />\nBy WILLIAM BENZON<br />\nAs Michael Brenson so astutely pointed out in<br />\nthis Journal awhile back, the myth of America has<br />\nbeen revealed for the lie it is: America is bareassed, not only before the world, but before herself. I would like to add a footnote or two to Mr.<br />\nBrenson's article.<br />\nAs the myth disintegrates the chief characteristic of our methods of decision making will become exposed: the reasons which inform our debate have little to do with the factors which impell the decision. This in part due to the nature<br />\nof institutional decision making; individuals efface<br />\ntheir personal identity, their very being, so that<br />\nthey might take a proper institutional role (example: a high administrative official in a wellknown Baltimore university who has no opinions<br />\nbecause he is a high administrative official.)<br />\nThis leads to total loss of moral responsibility<br />\n(examples: Dachau, the \"Presidio stockade, Song<br />\nMy); in another context the phrase \"psychological<br />\naddiction\" is used. But then,the institutions where<br />\ncreated by men and men have always been avoiding responsibility.<br /><br />\nTwo Are One<br />\nMake no mistakes; most of the people in this<br />\ncountry know (they even know it is they who are<br />\nresponsible--but they palm it off on...), who is<br />\nresponsible for this mess and they know it is a<br />\nmess. But then one has to believe in something and,<br />\nin the absence of any but the most senile of gods,<br />\none believes in one's country. The country in<br />\nwhich the patriot believes exists in a different<br />\nuniverse of discourse from the country in which<br />\nhe earns his bread and is nagged to buy buy buy!<br />\nIt hasn't yet occurred to him that the two are in<br />\nfact one.<br />\n-But as the myth dies he will be forced to see<br />\nthat the two are indeed one. Herein lies a great<br />\nhope and a great despair.Whatwill the reaction to<br />\ntruth be?<br /><br />\nEternal Dilemna<br /><br />\nDifferences Trivial<br />\nA local example of this split can be seen in the<br />\nabove mentioned Baltimore university. A number<br />\nof students, faculty ,and administrators decided<br />\nthat a student disciplinary code was needed.<br />\nThere are now two versions of such a code; one<br />\nversion prepared by an advisory committee and<br />\none prepared by the above mentioned high administrative official. The differences between the<br />\ntwo versions are trivial if one believes that a student discipline code is imperative and so there<br />\nshould be little difficulty involved in adopting one<br />\nversion or the other. But there is much quibbling<br />\nand many reasonings; and the real issue is: who<br />\nruns the university, the high administrative official or the students and faculty?<br />\nBut neither side can openly acknowledge, in<br />\nthis particular context, what the issue is (though<br />\nin private the students and faculty distrust and<br />\nresent this official and this official has complementary feelings), for then both sides would be<br />\nexposed, left naked. And the winter air is cold.<br />\nSo the quibble will continue behind it's schizophrenic screen.<br /><br />\nThe dilemma is not new, it is much more than<br />\nvery old. It is eternal. \"And they heard the sound<br />\nof the Lord God walking in the garden in the cool<br />\nof the day, and the man and his wife hid themselves from the presence of the Lord God among the<br />\ntrees of the garden. But the Lord God called to the<br />\nman, and said to him, 'Where are you?' And he<br />\nsaid, 'I heard the sound of thee in the garden,<br />\nand I was afraid, because I was naked; and I hid<br />\nmyself.\" And the man blamed it on the woman,<br />\nthe woman blamed it on the serpent; the serpent<br />\nwas Satan and Satan blamed it on the Lord God.<br />\n(Only in comparison with being is non-being nothing.)<br />\nThe great hope lies in seeing the truth, accepting it and repenting Of past evil (which means to<br />\nacknowledge one's sin, but to do better in the future rather than using guilt for past sins as an<br />\nexcuse for doing nothing, don't look back). Given<br />\nthis, then;<br />\n...much more good thereof shall spring,<br />\nTo God more glory, more good will to Men<br />\nFrom God, and over wrath grace shall abound.<br /><br />\nGreedy Watchdog<br />\nComing Apart<br />\nSimilarly, the legal status of marijuana has<br />\nnothing to do with the merits or demerits of the<br />\ndrug; though that is the excuse which informs debate on the subject. The issue is political and social; hedonism vs. a perverted puritanism, young<br />\nvs. old, liberals and radicals vs. silent majority.<br />\nLikewise the ABM. The issue was not whether or<br />\nnot the ABM could possibly work or evenwhether<br />\nor not the arms race is something any sane man<br />\ncould believe in. Rather the issue was: do we throw<br />\nthat obscenely greedy watchdog another fillet or<br />\nmust he content himself with a bone? He was thrown<br />\na fillet, thus establishing that the master is still<br />\nafraid of his watchdog.<br />\nAnd Vietnam is filled with the corpses and<br />\npoisoned land engendered by this mismarriage of<br />\nreason and fear. Why are we there?\"Because they<br />\nasked us there, we gotta keep the world free for<br />\ndemocracy and we gotta save face.\" No! We're<br />\nthere because the makers of our foreign policy<br />\nare bumbling incompetents, because of the flaming xenophobia of the silent majority, because that<br />\nwatchdog likes his fillet and he has lots of friends<br />\nwho like to bury bones for the sake of burying<br />\nbones (they got big piles of them good bones!)<br />\nand because the sun shall never set on the Amurrican empire.<br />\nWe all know this and we have always known it;<br />\nbut we have never beenforced to admit it in public<br />\n(not even in the anonymity of a Gallup poll--who's<br />\nto say everyone really believes what he tells the<br />\nTHE WIZARD OF ID<br /><br />\nM it7Ni6HT!<br />\nMUT ARE<br />\nCt2IN&amp;<br /><br />\nDOWN<br />\nTHERE<br /><br />\n1-13<br /><br />\n416%<br /><br />\nTo face the truth is to regain some measure of<br />\ncontrol over the consequences of one's decisions<br />\nbecause one is no longer forced to believe a myth<br />\nwhich makes it impossible to affect the real sources of power. To face the truth is to change from a<br />\nsituation where reason exists only to give tangible<br />\nform and substance to a formless and endless need<br />\nfor power and control (eliminate all myths and<br />\nnothing is left but fear of the other and desire to<br />\ncontrol him) to a situation where power serves<br />\nto root abstract reason into the substance of the<br />\nearth so that flowers might bloom and flourish<br />\nrather than wilt and perish.<br /><br />\nTo turn from the truth is to invite chaos, and<br />\nthe great despair. For perhaps the truth is too<br />\nmuch to bear. In which case the myth is grasped<br />\neven more greedily; and the more greedily it is<br />\ngrasped, the more the life giving truth is choked<br />\noff; the more greedily the truth is choked off.<br />\nthe more greedily is the myth grasped. The<br />\nparasite destroys the host and thus destroys himself. The systems engineer would call it positive<br />\nfeedback. The logician calls it an infinite regress. For a plain speaking man it is a vacious<br />\ncircle. For the psychiatrist, schizophrenic disintegration. Sartre, the abyss. Milton Moses Ginsberg made a pun and so titled his movie Coming<br />\nApart. Bergman called his movie Shame. And<br />\nmany an alumnus of Hopkins has pronounced it...<br />\nTerminal.<br />\nby Brant parker and Johnny hart<br /><br />\n* * *<br />\nHopkins, as the state's most prestigious private university, has quietly undertaken a program to attract more<br />\nqualified black applicants. Despite Administration grief,<br />\nAssistant Admissions Director Ronald Owens has done<br />\nmore than a commendable job. Hopkins may never be<br />\nable to portray anything but a lily-white foreign image to<br />\nits black students, but it's good to know that someone is<br />\npulling in the other direction.<br /><br />\npollster?). To not admit something in public is to<br />\nnot admit it as real; what is kept private disappears in sleep; what is before the public, before<br />\nothers, is real.<br /><br />\nA TKEATIGE<br />\nON WOMAN'S<br /><br />\n(NTomorJ.<br /><br />\nWNAr<br />\n1 T140U6,14T<br /><br />\nNEWS—LETTER<br /><br />\nFeb. 24, 1970<br /><br />\nPAGE 5<br /><br />\nLetters To The Editors<br />\nTo the Editors:<br />\nI would like to take this opportunity to comment on<br />\nyour Story in 'Jay's '`e -;t', February 20, 1970. .<br />\nAs you mention<br />\nyour article I have been at Hopkins<br />\nfor 4 years. I have had the opportunity to hear many<br />\ndifferent people expound on this \"Unique\" University<br />\nof.ours and also had the opportunity to hear the undergraduates complain vociferously about their problems.<br />\nIt seems like one of their biggest complaints is the fact<br />\nthat they (the undergraduates) feel as though they are<br />\ngetting short-changed in our \"Unique\" University. I<br />\nhave always been very empathetic about their criticism<br />\nbecause I, too, felt that the athletic department and<br />\nthe people involved in the programs centered at the<br />\nAthletic Center were also being `short-changed'.<br />\nI am finding, to my dismay, that one of the unique<br />\nqualities of this institution is that the undergraduates,<br />\nas exemplified by your article, are more than willing<br />\nto criticize any effort or attempt by their fellow students to achieve a certain amount of self satisfaction<br />\nand pride out of their involvement in athletics. This<br />\nwillingness to criticize is further reinforced by a strong<br />\ndesire on the part of the undergraduates not to get involved himself.<br />\nThey say, en masse, 'give us control of the University, give us more Professors and less graduate instructors, give us a Student Center, give us everything, but<br />\ndon't ask us to stand up and be counted. Don't ask us to<br />\nget involved, don't ask us to work in the inner city,<br />\nmental hospitals, athletic teams, school papers, or<br />\ncommittees. We don't want to make a constructive effort<br />\ntoward helping to solve the problems of our times, but<br />\ngive me a chance to sit back and criticise the few that<br />\nare.'<br /><br />\nSo we run a \"bush\" Fall Sports Banquet for 75 young<br />\nmen that gave something to Hopkins. They sure as Hell<br />\ndidn't play in front of large crowds, and they didn't get<br />\ntheir names in the Baltimore Sun very often and when<br />\nthey did lose games because they aren't 'professionals' they most definitely did get criticized by their<br />\nfellow students both in and out of the News-:Letter.<br />\nMaybe it was 'dull' to you, but I appreciated the fact<br />\nthat George Hayward gave his time to see all of our<br />\nand try to feel as if he were<br />\nlast fall<br />\ngames<br />\nassociated with a fine group of young men. I also<br />\nappreciated the fact that Vince Bagli was willing to<br />\ncome over to Hopkins and say 'Hello' to us for a roast<br />\nbeef dinner and the reason he was late was because<br />\nhe had to do a T.V. show. I also appreciated the fact<br />\nthat President Gordon attended along with Ross Jones,<br />\nDave Kaufman, Oz Steinwald, Bob Hewes. I also appreciated the fact that we can't go 1st class in the Banquet<br />\nbecause Hopkins just doesn't have the funds. Denny Cox<br />\nbrought his wife to the Banquet because he believed in<br />\nthe young men that were being honored that night. Denny<br />\nhad to pay for his wife's dinner just like the rest of the<br />\ncoaches that brought their wives and you know that Denny<br />\ndid for Hopkins last fall? He worked as an integral part<br />\nof our staff and didn't get a penny for his service.<br />\nI also realized, and would have been happy to tell you<br />\nif you asked, that the reason why the banquet was the<br />\nfourth of February is because many finals were given<br />\nduring the early part of December and the Captains requested that we postpone the banquet feeling a need to<br />\nstudy and try to catch upwith their classmates that spend<br />\nSaturday afternoons during the fall in the library. If you<br />\nconsult your calendar you will find that with registration<br />\nand the beginning of classes this is the earliest we could<br /><br />\nhave had the banquet. Remember George, your classmates were away for a few weeks on 'independent<br />\nresearch' at Stow, Vermont, Bahamas, and some other<br />\nintellectual resorts.<br />\nI don't think our banquet was 'bush'. I think you and<br />\nthe others that sit on the sidelines of all the games of<br />\nlife criticizing and unwilling to give of themselves are<br />\n'bush'.<br />\nThe true 'uniqueness' of this University is the 'fact<br />\nthat it allows the best and worst to come to the surface.<br />\nThank god we have the Russ Passarellas, Paul Aliens,<br />\nJoe Cowans, Charlie Cokers, Bob Hydes and even<br />\nthough he will never believe this the Rich .Convisers.<br />\nThe people that are willing to get involved, the people<br />\nthat are willing to 'stand up and be counted' the people<br />\nthat are willing to get in the arena of life and either 'put<br />\nup or shut up'.<br />\nWhy don't you start a campaign on campus to be positive - instead of negative. I assure you our football<br />\nprogram will survive your criticisms and complaints,<br />\nbut it would be so nice to think that someone was actually<br />\npulling for us to do well and truthfully care when we<br />\ndidn't. I have tried as a football coach and I know<br />\nour players have tried their best. Why don't you and<br />\nyour other cynics try to make a concerted effort to help<br />\nus build together toward a better University rather than<br />\nsit around criticizing the small measure of success we<br />\nhave achieved.<br />\nI assure you I would look forward to and welcome the<br />\nopportunity to work with you to make this fine University a better one.<br /><br />\nAlexander Sour<br />\nHead Football Coach<br /><br />\nKingdom and the Bowling Alley<br />\nBy JIMMY OLSENBERG<br />\nI was young then, still a freshman at<br />\ncollege, and I was in New York making<br />\nthe rounds for a newspaper job. I went<br />\nfirst, of course, to the New York Times,<br />\nor, as I had come to call it, My Bible.<br />\nAs I entered the building, I felt like<br />\nan aged, devout Moslem entering the holy<br />\ngates of Mecca.<br />\nInside, everyone seemed to have slightly graying, razor-cut hair that modishly<br />\ncame down over the collars of their<br />\nVan Ileusen shirts. Dressed in expensive, tailor-made pin stripe suits, they<br />\nchatted casually about yachting and polo,<br />\nand their tanned faced glowed with selfassurance. They had all graduated from<br />\nHarvard or the Columbia School of Journalism, or both.<br />\nUnfortunately, I was unable to get a job<br />\nat the Times, and with a shaky conscience, I took the cross-town bus to the<br />\nNews.<br /><br />\nLet's Crack Down!<br />\nNow, as a card-carrying Jewish liberal, I had always looked down on the<br />\nDaily News. I even used to cut out their<br />\neditorials and post them on my bulletin<br />\nboard, in order to impress girls with<br />\nmy wildly original,off-beat humor.Their<br />\nanti-dissent editorials usually went like<br />\nthis:<br />\nIt's high time that all these bleedingheart kooks and liberals quit their yapping about \"police brutality.\" These<br />\nCommie dupes will go to no end in their<br />\nKremlin-hatched smear job on the policemen of this nation. Along with the<br />\nsofties on the Supreme Court, these<br />\nlong-haired weirdoes are trying to handcuff the polico, while anarchists and<br />\ncriminals are running wild on the streets.<br />\nWe say let's put an end to all this hot<br />\nair on \"criminal's rights,\" and start<br />\nthinking about the rights of the lawabiding citizens of the nation. The only<br />\nthing a criminal understands is a good<br />\nknock on the head, and pronto!<br /><br />\nThe Late Show<br />\nAs I entered the city room of the News,<br />\nI rubbed my eyes in disbelief. The Daily<br />\nNews was actually nothing more than a<br />\nre-creation of all the movies on newspapers that I had watched on the Late<br />\nShow. Everywhere I looked, old men in<br />\nsuspenders, with their ties loosened,and<br />\ngreen, visors shading their eyes, were<br />\nbeneover ancient black typewriters,fur-<br /><br />\niously pounding away. Elsewhere, reporters were making phone calls as they<br />\nnervously<br />\nsmoked<br />\ncigarettes. Any<br />\nminute I expected Spencer Tracy or Humphrey Bogart to come in with the latest<br />\nscoop. I had always imagined that the<br />\npeople who turned outthe copy must surely be a group of well-educated practical<br />\njokers, turning out their drivel to mock<br />\nthe sub-literate masses who so eagerly<br />\ngobbled it up.<br />\nThis was not the case. The reporters<br />\nwho told those millions of readers about<br />\nsexpot scandals and mad rapists were<br />\nreally not that much different from their<br />\nreaders.<br /><br />\nScrew<br />\nBut what was even more amazing to<br />\nme was the lack of status accorded even<br />\nthe most illustrious editors. As I was<br />\nshown around the city room,occasionally<br />\nstopping to pick up a beer can that blocked my path, the personnel director pointed out various celebrities. \"That's the<br />\ncity editor,\" he said, pointing to a wizened, wrinkled old man in suspenders<br />\nwho sat at the head of a large table ogling<br />\nthe latest copy of Screw magazine.<br />\n\"Hey\", the old man exclaimed, \"take a<br />\nlook at that pussy!\" The others at the<br />\ntable looked up, and one aging man lumbered over to take a look for himself.<br />\nThe city editor spread out the photo of a<br />\nhefty brunette model lifting her skirt.<br />\nWe moved on to the other large desks,<br />\nand as he pointed out each one of the<br />\nvarious prominent people, I realized that<br />\nthere was very little glamour about them.<br />\nIn the Times, men in the same position<br />\nwould have 'the fabulous aura of demigods. Here, however, they were just<br />\nmen doing their jobs. They sat at<br />\ntheir desks like everybody else, and<br />\nthey were not separated behind heavy<br />\noak doors with gold letters on the outside. As I soon realized, although the<br />\nNews may be more strident in its trumpetings against threats to the American<br />\nWay of Life, it was e4remely tolerant<br />\nwithin the bureaucratic structure.<br />\nThe copyboys were almost all longhaired, except the black copyboys, who<br />\nwere decked out in Afros, dashikis,<br />\nbeads, or daz4ling silk shirts. On<br />\nweekends, reporters and copy editors<br />\nwould come in T-shirts, blue jeans,<br />\nand bermuda shorts. The younger reporters were liberals, as were most of<br />\nthe guys on the telegraph desk, and they<br />\nhad a bemused attitude towards the<br /><br />\nrantings in the editorial page.<br />\nEditorial policy was not democratically decided, but rather hatched from<br />\ntwo cubicles stuck in the Women's Department. There, forty-year veterans<br />\nlike Reuben Maury typed out their mutterings on pinko faggots. Reuben was<br />\na small, bent-over man, with suspenders, walking cane, and a straw hat.<br />\nWhen I would have to deliver a message to him, I'd enter his little room<br />\nonly to see him cackling over his editorials. He was occasionally seen at<br />\nvarious parts of the city room, hurriedly moving towards some destination<br />\nknown only to him, with a frozen grin<br />\non his face. His movements were quick<br />\nand jerky, like a toy puppet's. Once<br /><br />\na day, he would emerge from his office<br />\nin the 19th century, shuffle towards the<br />\ntelegraph desk, deposit his editorial,<br />\nwheel around, and head back to his<br />\nworld of Commies and hippies and rabble-rousers in the Women's Department.<br />\nMeanwhile, the young editor<br />\nwho had just received this latest editorial would glance at the copy, and<br />\nthen shake his head in disbelief. When<br />\nhe'd come into the city room, I would<br />\nalways wonder what must go through<br />\npoor Reuben's mind after he sees the<br />\ncopyboys dressed conspicuously like the<br />\nanarchists and Black Power fanatics he<br />\nhad just decried in his editorial.<br />\n(Part II of this article will appear in the<br />\nnext edition of the News-Letter).<br /><br />\nKeen, Torns of Pain<br />\nBy JAMES FEE MARTIN<br />\nOne more step in the increasing attempt to explore the previously overlooked darker side of an allegedly narrow and prudish Victorian morality has<br />\nbeen taken with the publication of LoveLyrics, hitherto surpressed private(and<br />\nrevealing) musings by that much-under*rated stylist James Whitcomb Riley, the<br />\nso-called \"Hoosier Poet.\"<br />\nLong known as the author of many<br />\nvolumes of children's poetry, and such<br />\nfolk.classics as \"When the Frost Is on<br />\nthe Pumpkin,\" Riley now reveals another aspect of his character as a tireless celebrator of the infinite variety<br />\nand sensual exaltation of the act of<br />\nphysical love.<br />\nFrom his precocious introduction to<br />\nthe paths of pleasure described in \"A<br />\nVery Youthful Affair,\" through the sheer<br />\nphysical immediacy of the memories in<br />\nLeonanie and Judith, (\"All forebodings<br />\nthat distressed me/I forgot as Joy caressed me...the soft touch of her hand/<br />\ntakes all breath....\" the author gives<br />\ncontinual insights into the state of Eros<br />\nin this country during the latter part<br />\nof the Nineteenth Century.<br />\nThe sadistic tendencies of the Victorian man have been the subject of<br />\nmany works, but rarely have we been<br />\ngiven the opportunity to view the corresponding trend towards masochism<br />\nwhich Riley approaches in such poems<br />\nas A Variation. Beginning with the invitation to \"Hate me just a little-come!\" he expresses the dual nature of<br />\nthe desire to at once inflict and re-<br /><br />\nlines like \"Make your<br />\nceive pain in<br />\nsobbing lips unsheathe/ All the glitter<br />\nof your teeth!\", the wish to destroy,<br />\n\"How I hate the torrid/ Touches of<br />\nyour splendid lips...\" and simultaneously to be overwhelmed - \"Now before me looms Something more than<br />\nhuman...Something to bow down before/<br />\nReverently and adore.\"<br />\nTurning from these deep probings into the dark heart of human desire, Riley<br />\noffers an apologetic for his actions in<br />\nHow It Happened, attempting to spread<br />\nhis hedonistic gospel among his more<br />\nrepressed contemporaries.<br />\nIn his last poems, one senses a certain weariness with the never-ceasing<br />\ndrive of depravity, \"...every briered/<br />\nWith keener thorns of pain....\", until<br />\nfinally, in Blooms of May, he cries<br />\n\"No more for me... \"No more - No<br />\nmore -\"<br />\nBut the joys of the flesh are never<br />\ncompletely lost, and When Age Comes<br />\nOn recalls once more the \"tide of raptures, long withdrawn,\" flowing back<br />\nin \"summer-floods\".<br />\nIn their outstanding edition of these<br />\nworks,<br />\nBobbs-Merrill has combined<br />\nthe poems with another long-hidden work<br />\nof genius from the same pried, the<br />\n\"Life Pictures\" of photographer William<br />\nB. Dyer. Evocative at once of age-old<br />\ndesires and the particular idiosyncracies of the age which produced them,<br />\nthese masterpieces of lecherous imagination run wild are the perfect companions for<br />\nRiley's sinuous inner<br />\nthoughts.<br /><br />\nPAGE 6<br /><br />\nNEWS—LETTER<br /><br />\nBlue Jay Swimmers Dunk Franklin - Marshall<br />\nbaturday afternoon, the varsity swim team added a second<br />\nvictory in one week to their credit by beating Franklin and Marshall, 74 to 21. The 400 yard<br />\nmedley relay team, composed<br />\nof Jim Scott, Kirby Weldon,<br />\nRick Ware, and Pete Weiss won<br />\nthe first event, swimming a 4.<br />\n02.8. To round out a successful<br /><br />\nmeet, the 400 free relay team,<br />\nof Ware, Brian Turner, Marc<br />\nSolomon, and Pete Weiss, placed first in the last event, beating both the varsity F &amp; M relay team and an unofficial F &amp;<br />\nM exhibition relay. The single<br />\nvarsity diver, Ken Zonies, was<br />\nalso in good form, winning his<br />\nevent by more than 160 points.<br />\nSenior Brian Turner was the<br />\nonly double winner of the day,<br /><br />\nTHE<br />\nPHY.ED.MAJOR<br />\nSAID<br />\nJOCULARLY:<br /><br />\ntaking firsts in the 50 yard freestyle race with a :23.9, and in<br />\nthe 100 free, with a :52.8. Hopkins swimmers also took seconds<br />\nin both events. Pete Weiss swam<br />\none of his best times, a :54.6,<br />\nin the 100 free to place second,<br />\nand Mike O'Donnell took the second in the fifty.<br />\nThe 200 individual medley was<br />\nwon by senior Bob Fisher with a<br />\n2:17.8, and team captain Rick<br />\nWare followed in with second.<br />\nThe 200-yard butterfly was won,<br />\nin an almost predictable fashion,<br />\nby Marc Solomon and Gene Bonte,<br />\ntaking first and second respectively.<br />\nJunior Marc Solomon<br />\nhas been winning this event all<br />\nseason with astonishing regularity and sophomore Gene Bonte<br />\nhas been almost as dependable<br />\nin second place.<br />\nIn the 200 yard backstroke,<br />\njunior Jim Scott swam a 2.16.6<br /><br />\nSPECIAL<br />\nNOTICE<br />\nStudent<br />\nand<br />\nFaculty<br />\nDiscounts<br />\nON<br />\nGoodyear Tires<br />\nGates Tires<br />\nRecapped Tires<br />\nMonarch Tires<br />\nauto repairs<br />\nBrakes<br />\nAlignment<br />\nTune-Up<br />\nGrease &amp; Oil Change<br />\nShock Absorbers<br />\nMufflers<br />\nAnti-Freeze<br />\nVVheels<br />\nhi<br /><br />\nMILLER<br />\nMAKES IT RIGHT!<br /><br />\n1<br /><br />\nSEND US<br />\nYOUR<br />\nAD-VERBIAL<br />\nPUNS ABOUT<br />\nCOLLEGE<br />\nMAJORS. IF<br />\nPUBLISHED,<br />\nWE'LL SEND<br />\nYOU A<br />\nREFRESHING<br />\nREWARD.<br />\nCOLLEGE BOX 482<br />\n© MILLER BREW. CO.<br />\nMILW.,<br />\n, WIS.<br />\n. 53201<br /><br />\nCrodil Cards<br /><br />\nPaul<br />\nSchnitzer<br />\nTire Co.<br /><br />\nto place first and Bob Fisher<br />\ncopped second. The fly, this<br />\nevent, and the breaststroke<br />\nhave been strong events for Hopkins most of the season. Breaststrokers, Mike O'Donnell and<br />\nKirby Weldon substantiated this<br />\nassumption by taking \"one, two\"<br />\nin their race.<br />\nThe varsity was preceded by<br />\na successful freshman meet against F &amp; M, with a final score<br />\nof 58 to 26. During the course<br />\nof the meet, Vince Nigrelli swam<br />\na 50.1 time for the 100 yard<br />\nfree race and set new frosh and<br />\nuniversity records in that event.<br />\nFreshman are now eligible to<br />\nparticipate in national level competition, and Nigrelli missed qualifying in the 100 by less than a<br />\nsecond. Several special qualifying heats were held for the freshman during the two meets, to obtain official times. No one made<br />\nit Saturday, but Nigrelli managed<br /><br />\nto set a frosh record in the fifty<br />\nfree with a 23.5, and Richard<br />\nSilver swam an excellent time<br />\nof 4.47.8 in the 400 yard individual medley, short of qualifying<br />\nby about one second.<br /><br />\nFrosh Swimming NCAA'S<br />\nThis year's NCAA competition should find some of the frosh<br />\nswimmers involved. They still<br />\nhave time to qualify and it IS<br />\ncertain they will not stop trying.<br />\nOne other record was set in that<br />\nMichae:<br />\nmeet, by<br />\nFreshman<br />\nBoyd, who swam a 5:15.6 in the<br />\n500 free to break his own previous frosh and university record.<br />\nNext week, coach Frank Comfort takes his crew down to Gallaudet College to compete in the<br />\nMason-Dixon Conference Championships. Last year, Hopkins<br />\nfinished a strong second. The<br />\nNews -Letter sports staff hopes<br />\nfor a first place this year.<br /><br />\n.q,NYONMCOMWMMM?)YA)(<br />\n1.,.<br /><br />\n•<br /><br />\nMMMMMMMN.MMWMM{Y,WMM<br /><br />\nBy RALPH ROTH WELL<br /><br />\nEXTRA<br />\nCURRICULARAND<br />\nEXTRA IMPNITANT• READING<br />\nWM PENGUIN<br />\nTHE PEASANTS OF NORTH VIETNAM. Gerard Chailand.<br />\nThe author, a history professor and strong opponent of American involvement in Vietnam, provides the most complete<br />\naccount available of life in the Democratic Republic of Vietnam. Reporting on his travels through the Red River delta, he<br />\ndescribes the economic and social organization of the village<br />\ncommunes and records the voices of a people victimized by<br />\nwar, and by thirty years of foreign oppression and aggression.<br />\nA Pelican Original.<br />\n$1.65<br />\nTESTAMENTS OF TIME. Leo Deuel. The story of how archaeologists have recovered the lost documents of ages past and<br />\nwhat these texts tell us of\\ancient civilizations. A Pelican Book.<br />\n$3.45<br /><br />\nTHE GREEK TRAGEDY. Constantine Tsoucales. A vivid description of the present political crisis in Greece and its historical antecedents. A Penguin Special Original.<br />\n$1.45<br />\nLook for these and other new Penguins—at your campus<br />\nbookstore now.<br /><br />\nNGIIIN BOON S INC<br />\nPC:<br /><br />\n7110 Ambassador Road<br /><br />\nMUST BRING<br />\nTHIS AD<br />\nWITH YOU<br /><br />\n11,.&gt;<br /><br />\nBaltimore, Md. 21207<br /><br />\nOC‘•<br /><br />\n1027-39<br />\nHillen SL<br />\n539 5390<br /><br />\n:..&gt;<br /><br />\nTHE INNOCENT EYE. Arthur Calder-Marshall. The story of the<br />\nlife and work of one of the most unique film-makers in cinema<br />\nhistory, Robert J. Flaherty. With 70 photographs from \"Nanook<br />\nof the North\" and other Flaherty films. A Pelican Book. $2.25<br /><br />\n1-&gt;<br />\n:<br /><br />\nc't7QQQi.v.)i.)cmimcw)wwwwciKirt1/4t*<br />\nAvailable at:<br /><br />\nThe Johns Hopkins Book Center<br />\nGilman Hall<br /><br />\nFeb. 24, 1970<br /><br />\nNEWS—LETTER<br /><br />\nJay's Nest<br /><br />\nBy GEORGE KIRSCHBAUM<br />\nsports Editor<br /><br />\nThe Administration's credibility gap has been of personal concern since last<br />\nspring when Dean Kimball claimed that the University had absolutely no money to<br />\ncontinued the then-dropped five sports and less than 48 hours later came up with<br />\n$45,000.<br />\nEarlier this Fall this editor wrote aneditorial on the absurdities of the admissions charges for some athletic contests at Hopkins. After the editorial went to<br />\npress, but before it appeared, word came from Bilgrave's office through a liaison that he would appreciate it if the News-Letter would cool down its attack on<br />\nthe admissions charges. For this favor assurancewas given that at the end of the<br />\n\"football\" season the entire policy would be reviewed.<br />\nThat was three months ago, and it is doubtful that the university has any intention of reviewing the policy until the end of the lacrosse season. This would be<br />\ntoo late for undergraduates to participate meaningfully in any decision making<br />\nbefore next year. Both the Fall and Winter season are now history except for postseason play. A review of the Admissions Policy is already one season late. Let's<br />\nnot make it two.<br /><br />\nAttempts Fail<br />\n. Bilgrave's refusal to allow this reporter to attend a meeting earlier this<br />\nfall<br />\nand the athletic committee's non-cooperation since Decerflber suggest<br />\nthat the<br />\nUniversity is guilty of the same thing they accuse the News-Letter of--hiding the<br />\ntruth.<br />\nCertain individuals in the Athletic Department feel that the News-Letter's<br />\n,sports pages should portray only the good aspects of their<br />\nprogram even though<br />\nthey realize that certain parts of their program are second<br />\nrate. They refuse to<br />\nbelieve that the News-Letter cares and is concerned<br />\nabout improving Hopkins<br />\nathletics. We are not on an ego trip. We criticize out of concern and<br />\nthe hope that<br />\nsomehow we help improve the program's shortcomings. The<br />\ncredibility gap lays<br />\nfar from the Gatehouse doors.<br />\n*****************<br /><br />\nHulabaloo Heresy<br />\nPlans are afoot in the Hulabaloo to do away with all team pictures for their<br />\n1970 edition. The News-Letter hopes that a human cry rises and falls blaspheming on the Hullabaloo's doorstep. A team is made up of more than select individuals or superstars. These players deserve to be represented in their yearbook.<br />\nEditor-in-Chief John Adams seems bent on falling into the same trap as past<br />\nyearbook editors. He is too concerned with the \"artistic\" aspects of the yearbook in lieu of a comprehensive- history of the school's yearlong activities.<br />\nAdams'<br />\nintentions of leaving out team pictures short-changes not only the<br />\nplayers of particular sports but also the subscribers who expect more than a<br />\npicture book of the \"editor's friends.\" Students who agree with this philosophy<br />\nare encouraged to voice their opinions.<br />\nHopkins deserves a better yearbookthanithas gotten for the past three years,<br />\nor the yearbook should be abolished.<br /><br />\nPAGE 7<br /><br />\n'Fencers Down Haverford,<br />\nI Dominate Sabre Matches<br />\nBy ED BRETHAUER<br /><br />\n20 out of 28 in this class. Coach Oles<br />\nis planning to send some of these freshmen to the North Atlantic Championships<br />\ntournament the weekend of March 7th<br />\nto gain even more experience for next<br />\nyear's team.<br />\nHopkins' next match will be against<br />\nTemple at home next weekend, and it is<br />\ndefinitely the toughest of the season.<br />\nHopkins will need a victory to maintain<br />\na winning record and some momentum<br />\nfor the MAC championships, which will<br />\nalso be at home the next weekend.<br /><br />\nLast Saturday, the Varsity Fencing<br />\nteam extended their record to 6-5, by<br />\nbeating Haverford in a close match, 1512. Hopkins won eight out of nine sabre<br />\nmatches, five out of nine in epee, but<br />\nonly two out of nine in foil matches. Outstanding in the victorywere Captain Keith<br />\nFulling in epee, Rich Hamburg, also in<br />\nepee and Gordie Rode in sabre (all of<br />\nwhom won three matches without losing<br />\nany).<br />\nIn matches previous to this, Hopkins<br />\nbattled to keep a .500 record. After<br />\nlosing to Penn State by the score of198 (only Rich Hamburg was successful in<br />\nthis match), Hopkins bounced back to beat<br />\nMuhlenburg by the score of 16-11. Keith<br />\nFulling, Keith Bucklen and Rich Hamburg<br />\nall won three matches to spur the team<br />\non to victory.<br />\nIn the last two meets before lastweekend, Hopkins won over Drew by the score<br />\nof 18-9, with Keith Fulling (3-0), Rich<br />\nHamburg (2-0), and Jesse Mashbaum<br />\n(2-0) leading the way,and lost to Stevens,<br />\n15-12.<br />\nThe big story this year for fencers has<br />\nbeen the Frosh fencing team, which has<br />\nthe chance to be the only undefeated<br />\nfreshman fencing team in the school's<br />\nhistory. Since winning their first match<br />\nagainst a local fencing club, they have<br />\nbeaten the Jewish Community Center,<br />\n17-10, The Stevens' Frosh, 16-11, the<br />\nJunior Olympic Squad, 14-13, and the<br />\nHaverford Frosh last weekend, 27-0.<br />\nThe Frosh, like the Varsity, have won<br />\nmost of their matches in the sabre<br />\nclass, having won 24 out of 36 there.<br />\nYet, they are best in epee, having won<br /><br />\nLEADING FENCERS<br />\nHAMBURG<br />\nFULLING<br />\nSCHWARTZ<br />\nROSENBAUM<br />\nRODE<br />\nBUCKLEN<br /><br />\nLEADING FROSH<br />\nFENCERS<br />\nEPEE<br />\nBender<br />\nGreen<br />\nComstock<br />\nAndrews<br /><br />\nFOIL<br /><br />\nTRADE-MARK<br /><br />\n7-3<br />\n7-6<br />\n3-7<br /><br />\nSABRE<br />\nCoroneos<br />\nSmith<br />\nSexsmith<br /><br />\nBOOK FAIR<br /><br />\nShould I<br />\nget the cans<br />\nor should I<br />\nget the bottles<br />\nof Coke<br /><br />\n8-2<br />\n9-3<br />\n5-3<br />\n4-3<br /><br />\nLittle<br />\nKerkman<br />\nKaminsky<br /><br />\n3121 ST. PAUL ST.<br />\nCARDS—BOOKS—GIFTS<br />\nSTATIONERY<br />\nMAGAZINES<br /><br />\n0/1<br /><br />\n19-7<br />\n22-10<br />\n20-13<br />\n11-9<br />\n10-10<br />\n14-14<br /><br />\n6-2<br />\n7-3<br />\n5-4<br /><br />\nStudent registration for second<br />\nsemester physical education programs will close Wednesday at 5.<br />\nRegistration is being held in the<br />\ngym office, ext. 791.<br /><br />\nIA ONE-DAY EXHIBITION Et SALE<br />\n/I<br /><br />\nGraphics<br />\npresented by<br /><br />\nLONDON GRAFICA ARTS<br />\nPublishers of contemporary printmakers<br /><br />\nII<br />\nMore than 400 lithographs, etchings,<br />\nwoodcuts and screenprints on show,<br />\nincluding works by: PICASSO, DURER,<br />\nGOYA, CHAGALL, DAUMIER, CASSAT,<br />\nGAUGUIN, TOULOUSE-LAUTREC<br />\nAlso MANUSCRIPTS AND MAPS<br />\nITEMS FROM $8 to $3000<br /><br />\nJOHN HOPKINS UNIVERSITY<br />\nSherwood Room — Levering<br />\nMonday — March 2, 1970<br />\n10 a.m. — 5 p.m.<br /><br />\nBOTTLED UNDER AUTHORITY OF TIME:<br /><br />\nCOCA-COLA BOTTLING COMPANY OF BALTIMORE, MARYLAND<br /><br />\nWant a Classified???<br />\nUse this easy-to-fill-out form<br />\nHEADING:<br /><br />\nHELP WANTED<br /><br />\nRIDES<br /><br />\nSUBLETS<br /><br />\nOTHER<br /><br />\nWORDING:<br /><br />\nBe Snug in Your Bug<br />\nIf you'd like to get around the high .cost of living,<br />\nwe have a suggestion.<br />\nCut down on the high cost of getting around.<br /><br />\nTO FIGURE COSTS: Figure 5i per word. $1 minimum.<br />\nClassifieds must be pre-paid by check or money-order. Send to The News-Letter<br />\nthrough campus mail do Box 1230.<br />\nWe must receive classified three days before the issue you want,(designate Tuesday<br />\n, or Friday).<br /><br />\nAnd buy a Volkswagen. lt's only $1839*<br />\n• Suggested reta4 price east coast P.O.E. Local taxes<br />\narid other dealer delivery. charges, if any, additional.<br /><br />\nMARYLAND VOLKSWAGEN<br />\n1212 E. 25th St.<br />\n(comilir x3f Harfoni Rd)<br /><br />\nPhone 889-7616<br /><br />\n1<br /><br />\nFeb. 24, 197(<br /><br />\nNEWS—LETTER<br /><br />\nPAGE 8<br /><br />\nMilitary Keeps Watch on Civilian Protest Politics<br />\nReprinted from The Washington Monthly<br />\nFor the past four years, the United<br />\nStates Army has been closely watching<br />\ncivilian political activity within the U.S.<br />\nNearly 1000 plainclothes investigators,<br />\nworking out of some 300 offices from<br />\ncoast to coast, keep track of polittcal<br />\nprotests of all kinds - from Klan rallies<br />\nin North Carolina to anti-war speeches<br />\nin Harvard..<br />\nWhen tht program began inthesummer<br />\n1965, its purpose was to provide early<br />\nwarning of civil disorders the<br />\nArmy<br />\nmight be called upon to quiet.<br />\nIn the summer-of 1967, however, its<br />\nscope widened to include the political<br />\nbeliefs and actions of individuals and<br />\norganizations active in the civil rights,<br />\nwhite supremacy, black power, and antiwar movements.<br />\nToday, the Army maintains files on<br />\nthe membership, ideology, programs<br />\nand practices of virtually every activist<br />\npolitical group in the country.<br />\nThese records are kept in the Investigative Records Repository in Washington, D.C. The personality files of the<br />\nactivitist group leaders are open both to<br />\nthe Army and anyone with security clearance.<br /><br />\nPolice Files<br />\nThe files include not only such violenceprone organizations as the Minutemen<br />\nand the Revolutionary Action Movement<br />\n(RAM), but such non-violent groups as<br />\nthe Southern Christian Leadership Conference, Clergy and Laymen United Against the War in Vietnam,the American<br />\nCivil Liberties Union, Women Strike For<br />\nPeace and the NAACP.<br /><br />\nThe Army obtains most of' its information about protest politics from the files<br />\nof muncipal and state police departments<br />\nand of the FBI,In addition,its agents subscribe to hundreds of local and campus<br />\nnewspapers, monitor police and FBI radio<br />\nbroadcasts and, on occasion, conduct<br />\ntheir own undercover operations.<br />\nMilitary undercover agents hayed posed a press photographers covering antiwar demonstrations, as students on college campuses and as \"residents\" of Resurrection City. They have even recruited civilians into their service - sometimes for pay but more often through appeals to patriotism.<br /><br />\nRegistrar Espionage<br />\nFor example, when Columbia University gave its students the option of closing their academic records to routine inspection by government investigators,<br />\nthe 108th Military Intelligence Group in<br />\nManhattan quietly persuaded an employee<br />\nof the Registrar's Office to disclose information from the closed files on the<br />\nsly.<br />\nTypical of the reports filed by Army<br />\nagents each month are the following,<br />\ntaken from the unclassified intelligence<br />\nsummary for the week of March 18,1968:<br />\n\"Chicago, Ill: Approximately 300<br />\nmembers of Veterans for Peace and Women for Peace held a peaceful de monstation at the Museum of Science and<br />\nIndustry protesting an exhibit by the U.S.<br />\nArmy. Several demonstrators entered<br />\nthe bulding in spite of warnings by museum officials and six were arrested on<br />\ncharges of disorderly conduct, resisting<br />\narrest, and criminal trespassing.Five of<br />\nthose arrested were juveniles.\"<br /><br />\nTo insure prompt communication of<br />\nthese reports, the Army distributes them<br />\nover a nationwide wire service.Completed in the fall of 1967, this teletype network gives every major troop command<br />\nin the United States daily and weekly reports on virtually all political protests<br />\noccurring anywhere in the nation.<br />\nThe Army also periodically publishes<br />\nan eight-by-ten inch glossy-cover paperback booklet known within intelligence<br />\ncircles as the \"blacklist.\" The \"blacklist\" is an encyclopedia of profiles of<br />\npeople and organizations who, in the opinion of the Intelligence Command officials who compile it, might \"cause trouble<br />\nfor the Army.\"<br /><br />\nSometime in the near future the Army<br />\nwill link its teletype reporting system to<br />\na computerized data bank. This computer, to be installed at the Investigative<br />\nRecords Repository at Fort Holabird in<br />\nBaltimore, eventually will be able to produce instant print-outs of information in<br />\n96 separate' categories. The plan is to<br />\nfeed it both \"incident reports\" and \"personality reports.\"<br />\nThe incident reports will relate to the<br />\nArmy's role in domestic disturbances and<br />\nwill describe such occurrences as bombings, mass violence and arms thefts.<br />\nThe personality reports - to be extracted from the incident reports - will be<br />\nused to supplement the Army's seven million individual security-clearance dossiers and to generate new files on the<br />\npolitical activities of civilians wholly unassociated with the military.<br />\nIn this respect, the Army's data bank<br />\npromises to be unique. Unlike similar<br /><br />\nWe've never announced a car at this time before.<br />\nBut then nobody's ever announced a car like this before.<br /><br />\nIf it were an ordinary sportster, we'd have introduced it at the ordinary time.<br />\nInstead, we took the time to build a whole new<br />\nCamaro.<br />\nWe started with a sleek new shape and a low roadhugging stance.<br />\nAnd added more hood. A faster fastback. Wider<br />\ndoors. And new deeply contoured bucket seats.<br />\nThe instrument panel wraps around you. With<br />\nenough dials to make you think you're piloting a 747.<br />\nThere are four transmissions. And six power plants<br />\nup to the Turbo-Jet 396 V8 that you can order.<br /><br />\nGOD<br />\n1POr<br />\n54. UOMMUNIcTs<br />\n,<br />\n4:\\<br /><br />\nMass Violence<br /><br />\nNew Camaro.<br />\nFeb.26th.<br />\nSuper Hugger<br /><br />\n'<br />\nFEAR<br /><br />\nPick the one that best suits your driving. Then go<br />\npick on an open road.<br />\nAnd make it one with plenty of twisting turns.<br />\nBecause Camaro has a remarkable new suspension.<br />\nAnd standard front disc brakes for a leech-like grip<br />\non the road.<br />\nNew Camaro. The Super Hugger.<br />\nOther sportsters always feared it might<br />\n. ---S,\"<br />\ncome to this.<br />\n\\<br />\nAnd they were right. Only their timing was wrong.<br />\nPutting you first, keeps us first.<br /><br />\nSee it.At your<br />\nChevrolet Sports Dept.<br /><br />\nToday, the Army maintains files on the membership, ideology, programs and practicesof<br />\nvirtually every activist political group in the<br />\npic by hoffmann<br />\ncountry.<br />\ncomputers now in use at the FBI's National Crime Information C enter in Wash'<br />\nington and New York State's Identification and Intelligence System in AlbanY,<br />\nit will not be restricted to the storageof<br />\ncase histories of persons arrested for<br />\n(or convicted of) crimes. Rather it will<br />\nspecialize in files devoted evclusively to<br />\ndescriptions of the lawful political activity of civilians.<br />\nThus an IBM card prepared manY<br />\nmonths ago for the future computer file<br />\nof Arlo Tatum, executive secretary of<br />\nthe Central Committee of Conscientious<br />\nObjectors, contains a single notationthat Tatum once delivered a speech at the<br />\nUniversity of Oklahoma on the legal rightS<br />\nof conscientious objectors.<br /><br />\nCLASSIFIED<br />\n•<br /><br />\nFOR SALE<br /><br />\nTHE GREAT White Wonder Dylan - double-album. The basement tapes and Dylan with The<br />\nBand, $9. Contact: KathY<br /><br />\nSackett, Goucher.<br />\nJOBS<br /><br />\n...<br /><br />\nJOBS! JOBS! and more JOBS!<br />\nStudents, Teachers. Stateside<br />\nand International jobs. Recreational jobs; year-round jobs; sap<br />\nmer jobs. All occupations and<br />\ntrades. Enjoy a vacation while<br />\nyou earn. Hurry! The best jobs<br />\nare taken early. Write: JOBS,<br />\nP.O. Box 475, Dept. CP 171-1,<br />\nLodi, Calif. 95420.<br />\nClassifieds run in both Tuesday and<br />\nFriday issues. Rates are 50 per word,<br />\n$1 minimum. Copy must be in our<br />\nhands, pre-paid, three days before<br />\nthe issue you specify. Ads and check<br />\ncan be sent to Box 1230 or brought<br />\nto the Gatehouse.<br />\n-.0<br /><br />\nGRADUATE CLUB<br />\nPARTY<br />\nSaturday, Feb. 28, 9 p.m.<br />\nClipper Room, Shriver Hall<br /><br />\nMusic by Aux<br />\nBeer by the Can<br />\n.....<br />\nSTUDENTS<br />\nPart-time jobs<br />\nNo fee - Hi $$$<br />\nApply:<br />\nStaff Builders<br />\nTemporary Personnel<br />\nVermont Federal Bldg<br />\n(next to Hamburger's)<br /><br />\nGM<br />\nMARK OF EXCELLENCE<br /><br />\nCamaro Sport Coupe with RS equipment.<br /><br />"}], "field_media_file": [{"target_id": 40390, "display": null, "description": null, "target_type": "file", "target_uuid": "de28948e-b753-41ea-9ca7-0c5a657d9511", "url": "http://digital.library.jhu.edu/system/files/2022-03/14008-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 14008, "target_type": "node", "target_uuid": "c4cd52d1-48e5-4b95-b3aa-9ad504214036", "url": "/node/14008"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "2e14542d-c5bf-46f1-874e-a4bf38696a53"}]}