{"mid": [{"value": 36907}], "uuid": [{"value": "7085120f-44ee-488b-87cd-b7d81e38a5e6"}], "vid": [{"value": 36907}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:55:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13088-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:55:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:55:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVIII, No. 16<br />\n<br />\na<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 28, 1923<br />\n<br />\nBEAT MARYLAND<br />\nSIGMA CHI BETA HOLDS HOPKINS-FIFTH REGIMENT MUSIC FOR BARNSTORMERS<br />\nPUBLIC INITIATION AT<br />\nGAMES DATE CHANGED<br />\nCLUB PRODUCTION PREHARVEST BALL<br />\nGeorgetown Awarded February 21.<br />\nSENTED AT MEETING OF<br />\nProspects for Championship Team<br />\nSixteen Men Enter Rank of Membership<br />\nMEMBERS<br />\nof Honorary Society. Initiation<br />\nDance Feature of Evening<br />\n<br />\n5<br />\n<br />\n••<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nBright<br />\n<br />\nRehearsals to Start in Two Weeks. Vau-<br />\n<br />\nHOPKINS-MARYLAND GAME ATSTADIUM<br />\nTOMORROW FOR STATE CHAMPIONSHIP<br />\nBoth Teams Keyed up for Most Important Game of 1923<br />\n<br />\nBecause of a conflict with the<br />\ndeville Stunts for Beginners on<br />\nFootball Season in Maryland<br />\nSixteen upperclassmen were meet that Georgetown is putting<br />\nDecember 3 and 4<br />\nadded to the roster of Sigma Chi on the night of February 21, HopA number of the members of<br />\nBeta, an interfraternity and hon- kins has been forced to shift the the Barnstormers' Club met last<br />\nLINEUP TOMORROW<br />\norary society, at its annual initia- date of the Hopkins-Fifth Regi- Thursday night at the home of<br />\nMARYLAND Wt.<br />\nPosition<br />\nHOPKINS<br />\nWt.<br />\ntion held at the Beta Theta Pi ment meet to February 23. There Walter B. Swindell, who is coach.150. . . .L.E. . .Supplee ▪ 17....171<br />\n24 Schacht<br />\nHouse last Saturday evening. was a discussion as to whether ing the production, to hear the mu.. .160. . . .L.T<br />\n13 Magill .<br />\nT. . .Bromley ▪ 21....191<br />\n181<br />\n14....186<br />\n.L.G. Hall<br />\n5 Wolbert<br />\nThose who received the honor Johns Hopkins or Georgetown sic written for the play by Edward<br />\nPollock<br />\n4 Day<br />\n145<br />\n9....158<br />\nwere John W.Parsons, John S. V. had a prior claim to the date and Spieker, Class of '14. Mr. Spieker,<br />\n181<br />\n24....173<br />\nBrewer<br />\n8 Barton<br />\n.R.G<br />\nB. Shriver, R. Carmichael Tilgh- it was finally settled in favor of who is at present connected with<br />\n.R.T.. Burger<br />\n22....193<br />\n9 Carter<br />\n185<br />\nman, Malcolm R. Gilpin, Jr., Wil- the latter institution. The Hop- the United States. Geological Sur11 Rich<br />\n155. . . .R.E. . .Lanigan<br />\n▪ 10....181<br />\nliam N. Krout, Donald R. Reese, kins' sanction from the South At- vey in Washington,.was on hand<br />\n145<br />\n8....142<br />\n15 Taylor<br />\nBesley<br />\nQ B<br />\n2....171<br />\n1 Bonner . . .. 140. . . .H.B. ..Pugh<br />\nW. Carville Gardner, Edward lantic Amateur Athletic Union to play the songs himself.<br />\n33....175<br />\n6 Turnbull . . . 160. . ..H .B. . .Osborn<br />\nDunning, was revoked by the national body<br />\nWatson, Fitzgerald<br />\nThe rendering of the songs was<br />\n160, . . .F.B. . .McQuade ▪ 11....184<br />\n10 Maxwell<br />\nJohn A. Cochran, Gordon Post, R. in session at Detroit; for it an occasion for great enthusiasm on<br />\nSUBSTITUTES<br />\nPage O'Connor, Douglas Turn- claimed that both schools had been the part of the members present.<br />\nYoung . . 1 Herzog . .<br />\nBerndt ... 7 Gilliece . ..12<br />\nbull, William Harriso-n, Miles ,given the date, but that George- The officers of the Club are unaniLatham . .18 Groves . . 3<br />\nSlowik ... 3 Young . . .18<br />\nMarrian and A. K. Mitchell. Fol- town was given it first. The date mous in declaring that the songs<br />\nBonnet ..23 Branner.. . 5<br />\nMilanausky.16 Jackson .. .20<br />\nlowing the initiation ceremonies of February 23 has finally been far exceeded their expectations.<br />\n. .14<br />\nWaters ..16 Heine .. . 4<br />\nCook .... 2 Asendorf.<br />\nthe newly elected members attend- sanctioned, and the meet will be They declare the music to be unGundry.<br />\n. .12 Parker . . 6<br />\nCarr, J . .23 Almy . . . .21<br />\ned the Harvest Ball, in the Civil held on that night.<br />\nLevy . . . .22<br />\nCarr, S. .<br />\nusually melodious. About half of<br />\nHutzler .. .25<br />\nThis is an unfortunate change, the songs are said to be based on<br />\nEngineering Hall, -given in their<br />\nfor<br />\nseveral of the prominent ath- the native music of Peru. In fact,<br />\nhonor.<br />\nletes<br />\nwho were to enter may de- the production will be more along GEORGE WASHINGTON UNITomorrow is the day that the<br />\nThe Harvest Ball was not, as<br />\ncide<br />\nto<br />\nwithdraw.<br />\nIt<br />\nwould<br />\nkeep<br />\nHopkins<br />\nfootball team reaches the<br />\nthe<br />\nlines<br />\nof<br />\nan<br />\noperetta<br />\nthan a regcustomary in previous years, givVERSITY FALLS BEFORE<br />\nthem<br />\naway<br />\nfrom<br />\ntheir<br />\nuniversities<br />\nclimax<br />\nof<br />\nits 1923 season; the<br />\nular<br />\nmusical<br />\ncomedy.<br />\nIn it, jazz<br />\nen for members of Sigma Chi Beta<br />\nDASHING ATTACK OF<br />\nor<br />\naway<br />\nfrom<br />\nbusiness<br />\ntoo<br />\nlong.<br />\nMaryland<br />\ngame.<br />\nwill<br />\nCoach Van Orgive<br />\nplace<br />\nalmost entirely to<br />\nonly but was open to all UniversiHOPKINS<br />\nBlack and Blue Stars Return<br />\nman<br />\nhas<br />\ncoached<br />\nsquad all fall<br />\nhis<br />\nMr.<br />\nSpieker's melodies.<br />\nty students. This was done for the<br />\nSubstitutes Continuing Adding to the<br />\nHopkins has an excellent opporto<br />\nget<br />\nMaryland<br />\nand eleven deterScore Started by Regulars at<br />\npurpose of furthering its policy of tunity to capture the<br />\nFirst Act Complete<br />\nmeet this<br />\nGame<br />\nBeginning<br />\nof<br />\nmined,<br />\nhard-fighting wearers of<br />\nbettering social relations on the year. Usually an outside<br />\nAccording to the present plans,<br />\nteam<br />\nHopkins proved its offensive the Black and Blue will march out<br />\neach act will be embellished with<br />\ncampus. The C. E. Hall, scene of walks off with the total-points<br />\ntrothe festivities, was decorated with phy. But the team.<br />\nabout five songs. Mr. Spieker has strength on the gridiron last Satur- on the Stadium field tomorrow<br />\nwhich ran over<br />\nall the multi-colored products of opposition last year,<br />\narranged a complete score for a day by piling up a score of 62-6 afternoon to wrest the State chamand which<br />\nmusical comedy and the songs for against the George Washington pionship from the College Park<br />\nautumn: Shocks of corn adorned ranled as one of the ten leaders<br />\nof<br />\nthe<br />\nstreamers<br />\nfirst act are practically perfect- University football team. The warriors.<br />\nblack<br />\nof<br />\nand the country, remains practically<br />\nthe walls;<br />\ned. Although those for the second Black and Blue was far superior<br />\ngold interlaced above the heads of intact this year, and should<br />\nThe followers of Curly Byrd are<br />\nplace<br />\nthe dancers; pumpkins, potatoes, Hopkins, among the<br />\nand third acts are not yet completed to its rivals in every department of confident of victory in the big<br />\nleaders again.<br />\nall of the airs have been decided the game, gaining with ease in every Thanksgiving day battle, but they<br />\nears of corn, and apples were in Captain Booth and Louis<br />\nClark<br />\nabundance, grouped about a rustic are again eligible. Booth is ex- upon- and they await only the fin- period of play except the third, have not yet reckoned with the<br />\nishing touches. A number of the when the visitors were able to hold large squad of grim fighters that<br />\n• barrel of cider at one end of the pected to retain his national<br />\ndislyrics were written on Thursday them without a score. The game is waiting anxiously for a chance<br />\nhall. On the board, at the other tance titles, and Clark is<br />\nalways<br />\nnight under the stimulating inspira- afforded a good workout for to get at the throats of the Maryend, was drawn the insignia of the among the leaders in the<br />\ndash<br />\nsociety, a skull with orle black and events. Other valuable men are tion of Mr. Spieker's harmonies. Coach Van Orman's squad, giving land players. Football and State<br />\na large number of the scrubs a are in the minds of all Hopkins<br />\none blue eye and pearl teeth, bear- left, but the team is weak<br />\nin field Most of the words were written by<br />\ning on its forehead the letters events. While<br />\nD.<br />\nStuart<br />\nMossom, Class of '21, chance to play against a college men. Play football and beat State<br />\nProctor may be<br />\nwho is a member of the Advisory team.<br />\nX B, superimposed on two counted upon to score in<br />\nare two things that Hopkins men<br />\nthe<br />\ncrossed bones, on a sign board jumps, there is no capable<br />\nCouncil of the Club. The lyrics, The local machine started scor- are going to do tomorrow afterweight<br />\nsurmounted on a large factory man, unless one develops from<br />\nwhich are appropriate for the mu- ing within the first two minutes of noon.<br />\nthe<br />\nsic, have a flavor which is distinctly play. After receiving a kick-off,<br />\ncasting its shadow on surrounding unusually abundant freshman<br />\nHopkins Team Ready<br />\nmalow buildings. A harvest moon terial.<br />\nin accord with the rest of the play. which was spoiled by the strong<br />\nCoach Van Orman has been forMany of the songs were written wind which blew across the field tunate with his squad this fall in<br />\nsmiled benignly down upon the<br />\nAside from the Fifth Regiment<br />\ndancers for a moonlight waltz. meet, the schedule, both indoor by Mr. Spieker shortly after his all afternoon, the Black and Blue having every man in condition for<br />\nYoung's orchestra, harmoniously and outdoor, is incomplete.<br />\nThe graduation from Hopkins. They kicked back, recovering the pig- the last and most important game<br />\ndressed in overalls, presented a opponents for next spring, how- were written expressly for Hop- skin fifteen yards from the goal. of the season. The injured list has<br />\nnovel effect in their rural attire ever, will be of a higher<br />\ncalibre kins, although the production of a Maxwell carried it six yards nearer claimed but few of the Hopkins<br />\nand furnished music for the social than<br />\nformerly. It is felt that as musical comedy was then an ex- the zero line and Bonner carried it gridders and those for only a short<br />\nfunction.<br />\nHopkins has a first class track tremely visionary project. Under over after receiving a neat pass time. Recent injuries to several<br />\nThe feature of the evening was team, high-grade meets will re- his leadership in his undergraduate from Maxwell.<br />\nplayers were pronounced cured<br />\nthe Initiation Dance. At this time sult. The usual intercollegiate days, the Hopkins Glee Club prelast week, giving the Black and<br />\nTurnbull Kicks Goal<br />\nthe new members formed a line competitors will be entered, and sented quite a lot of his work. He<br />\nA few minutes after Bonner's Blue its full quota to start the last<br />\nacross the center of the hall with some of the stronger point win- has since been coach of the Glee first touchdown the Hopkins eleven few days of intensive training.<br />\nthe old members directly opposite ners will probably be sent to the Club, and has written songs for the again approached the end of the Since the St. John's game the Blue<br />\nthem at the far end. As the name national championships. Hopkins Paint and Powder Club.<br />\nfield, and, failing to gain through Jays have been preparing for the<br />\nIt was recently announced that the line, the J. H. U. quarterback Thanksgiving day contest and<br />\nof the neophyte was read, he went was third at Philadelphia and secthe first act will be entirely written called on Turnbull to try a place- now the battling gridders are all<br />\nforward to be presented with a ond at Chicago last season.<br />\nand rehearsals will begin on it with- ment kick which passed squarely set for whatever Captain Mcred carnation, the flower of the soin<br />\nthe next two weeks.<br />\nciety, and to be received into its UNIVERSITY TO BE CLOSED<br />\nbetween the bars. From then until Quade and his teammates have in<br />\nLarFe Number of Candidates<br />\nrank of membership. The addition<br />\nthe end of the quarter Hopkins store for them.<br />\nFOR THANKSGIVING<br />\nof these members brings the total<br />\nA meeting of candidates for the scored at will on their opponents<br />\nAll exercises and work at Johns<br />\nThe game with George Washmembership up to thirty now in Hopkins will be suspended Thanks- Barnstormers' Club was held last annexing 29 points before the perington University last Saturday<br />\nth e University.<br />\ngiving Day, November 29, accord- a berth in the cast greatly increased. iod closed.<br />\nwas helpful to the Hopkins team,<br />\nContinued on page .3. col. 1<br />\ning to an official statement from<br />\nThe second quarter was not as as it gave the backfield and ends a<br />\nProgram of Activities Outlined<br />\nAn extensive program of activi- President Goodnow.•<br />\neasy for the Blue Jays due to a chance to perfect their teamwork<br />\nstrengthening of the Washington- against opposition. The scoring<br />\nties has been outlined for the comFluildings on the carhpus will be<br />\nThere will be a dance in<br />\ndefense. The visitors sur- factor of the Homewood eleven<br />\nian's<br />\ning months and preparations are closed for the day, but will be opt-n<br />\nthe C. E. Hall after Thanksgiving Game.<br />\nprised their superior rivals at one had been ragged until that time,<br />\nnow being made. The society will Friday and Saturday, Novembgr 30<br />\nact as host to the representatives and December 1. Only those classes<br />\ntime by making a touchdown after but now they are ready to plow<br />\nand members of athletic teams will meet Friday and Saturday<br />\ncompleting a series of forward through a concrete wall if necesHave you bought your<br />\npasses. Henderson carried the ball sary. The defensive strength of<br />\nfrom other colleges and universi- which are especially notified by inJune Week stamps?<br />\nstructors, the notice concludes.<br />\nContinued on page 4 col. 2<br />\nContinued on page 4, col. 2<br />\nContinued on Page 4, col. 2<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS - LETTER, NOVEMBER 28, 1923<br />\n<br />\n2<br />\n<br />\nments that De Pachman is the<br />\ngreatest living interpreter of Chopin, have brought on his head a<br />\nPrinters of Philological and<br />\nflood of hostile criticism. We are<br />\nScientific Works<br />\n!<br />\ncontrib<br />\na<br />\nlast<br />\nAt<br />\nFOUNDED 1897<br />\ninclined to take his own word—<br />\n23 S. HANOVER ST.<br />\n\"In place of the usual pledge<br />\nand this in all seriousness.<br />\nBaltimore, Md.<br />\n$2.00 that accompanies most papers at<br />\nSubscription<br />\nA glance at his life .shows that<br />\nthe University, I should like to<br />\nused by he has indeed been, in the terms<br />\nbe<br />\nto<br />\nsubstitute<br />\na<br />\nsuggest<br />\nBoys, the place to get your<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at the English Department. Instead of his press agent, \"his own seBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nmeals—and they are honof the customary 'I. have neither verest critic.\" After many early<br />\nsuccessful<br />\nslohelp'<br />\nany<br />\nest-to-goodness meals, well<br />\nmost<br />\na<br />\nand<br />\nnor<br />\nreceived<br />\ntriumphs,<br />\ngiven<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nPachman<br />\nadoptbe<br />\nDe<br />\nmight<br />\nRussia,<br />\nin<br />\nfollowing<br />\ndebut<br />\ngan, the<br />\nserve d, and reasonably<br />\nHopkins University.<br />\nwas not satisfied with, himself.<br />\ned :<br />\npriced—is at<br />\n\"'In this paper I have not al- Before he would again appear in<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications lowed the slightest spark of per- public he spent eight years in<br />\nshould be sent to the MANAGING EDITOR.<br />\nsonality to enter, neither have I study. Most of his critics, in<br />\nused the personal pronoun. The America at least, have berated<br />\nHomewood 100<br />\nTelephone<br />\npunctuation is guaranteed to be of him or his \"lack of modesty\" and<br />\nthe vintage of 1600 (Whether A. not for any deficiencies in his mu1817 N. Charles St.<br />\nD. or B. C. is apparently a matter sical talent. Surely, after having<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nhimwith<br />\nconstrucyears<br />\nlived seventy-five<br />\nof choice), as is also the<br />\nJOSEPH LEOPOLD, '24<br />\n(Half Block below North Ave.)<br />\nPHILIP W. HOWARD, '25<br />\ntion.'<br />\nself, he should be a more compeManaging Editor<br />\nAdvertising Manager<br />\n\"Signed<br />\ntent critic of De Pachman than<br />\nNicholas Brown, Mgr.<br />\nWILLIAM G. DEAN, JR., '24<br />\nFITZGERALD DUNNING, '24<br />\n\"Infernal Machine.- any one else.<br />\n* * *<br />\nAssistant Managing Editor<br />\nCirculation Manager<br />\nT. REESE MARSH, '24<br />\nIn accordance with Fernie's<br />\nJOHN C. LEWIS, JR., '24<br />\nand,with appropriate<br />\nsuggestion,<br />\nAssociate Editors<br />\nAssistant Business Managers<br />\n,Mr. Samuel Pepys,<br />\nto<br />\napologies<br />\nRICHARD C. TILGHMAN, '25<br />\nD. MILES MARRIAN,'25<br />\nthe News-Letter's chronicler of<br />\nJOHN W. PARSONS,'25<br />\nG. DONALD GIESKE,'25<br />\nBENJAMIN T. ROME,'25<br />\nfootball feats, he. of \"Gridiron GosJOHN T. DIXON, '24<br />\nmight write next week:<br />\nsip,\"<br />\nJunior Editors<br />\nA. J. MoKAY,'26<br />\nTo<br />\nHomewood Field to garner<br />\n'24<br />\nTOVELL,<br />\nARTHUR L. NELSON, '26<br />\nC. EUGENE<br />\nERNEST A. STRATHMAN, '26<br />\nof the gridiron. Having<br />\nOTHO J. KELLER, III, '26<br />\ngossip<br />\nALGER G. Hiss, '26<br />\n'26<br />\nKIDD,<br />\nJACKSON<br />\nJ.<br />\nlate that one of the First<br />\nof<br />\nheard<br />\n'26<br />\nEDWARD O. MICHEL,<br />\nT. STRAN SUMMERS,'25<br />\nCHARLES G. HUTZLER, '24<br />\nFoundations of Virginia had,<br />\nthrough a most disastrous holoMember Southern Intercollegiate Newspaper Association<br />\ncaust, lost the fine apparel of its<br />\nfootball contenders, I did feel<br />\nBaltimore, Md.<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts.,<br />\nheartened concerning our own<br />\n\"Dappers and Smarts.\" For Lord,<br />\nBALTIMORE, MD., NOVEMBER 28, 1923<br />\n'tis said this F. F. of V. did practice in pyjamas for nigh a fortnight, Asis my custom I did fare<br />\nWE'LL SHOW THEM<br />\nto the manager for tidings and<br />\nsight. A<br />\na<br />\nThere are many sport fans in the city of Baltimore who will not there beheld wondrous<br />\nbaker's dozen of beardless youths,<br />\nconcede Johns Hopkins a chance to win tomorrow's game. \"Mary- most still in knickerbockers, who<br />\nland has one of the strongest teams in the country,\" they argue. professed to be assistants to the<br />\n\"Hopkins will indeed be fortunate to hold the College Parkers to a manager, did array before my astonished eyes garments of vivid<br />\nlow score.\"<br />\nblue. One quoth: Here is exceedhold<br />\nwho<br />\npeople<br />\nWe will not attempt to estimate the number of<br />\ning<br />\nadroitness, on Thursday eve<br />\nthis opinion. The number is undoubtedly a large one. We will say, these will bewilder—L. But I had<br />\nhowever, that there are some thirty-five men, composing the Johns fled and heard no more. I ponHopkins football squad, who disagree violently with such views. dered in a very panic the millenThe new Stetson line includes a wide range of<br />\nThey realize Maryland's prowess and they realize the task before ium was come. A hopkins team<br />\nLord!<br />\nin<br />\nfinery.<br />\nsince<br />\nsmart<br />\nstyles specially designed for young men<br />\nMat'yland<br />\ntowards<br />\nthem. They have, however; been pointing<br />\n*<br />\n*<br />\n*<br />\n—all with the \"Stetson\" stamp of quality.<br />\nSeptember. They have been holding back, accepting low scores in<br />\n-Vladimir De Pachman, the fatheir victories and allowing strong opponents to roll up the points, mous pianist, has our sincerest<br />\nSTYLED]<br />\nOR.YOUNG MEN<br />\nhas<br />\nEverything<br />\npower.<br />\ntheir<br />\nof<br />\nextent<br />\nrather than reveal the full<br />\nadmiration. De Pachman's statebeen subordinated to the Maryland game. And now, on the eve of<br />\nthe battle, Maryland has shown its all, while Hopkins still has a<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nThe Johns Hopkins News-Letter Mayb© So —<br />\n<br />\nThe St. REGIS<br />\nRESTAURANT<br />\n<br />\nC--(STETSOI•OcP<br />\n<br />\nBats<br />\n<br />\nfew bolts left to spring.<br />\nEleven men with Black and Blue jerseys will line up tomorrow's contest with but one aim in mind. They will not be playing a<br />\ndefensive game and they will not be attempting to hold down the<br />\nscore. They will be giving everything they have every minute with<br />\nbut one sole object: to BEAT MARYLAND.<br />\nThe student body is behind the team to a man. While the<br />\nBlack and Blue jerseys are giving their all on the field, the Black<br />\nand Blue rooters will be giving their all in the stands. Both will<br />\nbe satisfied with but one conclusion: a victory over Maryland.<br />\nBaltimore considers us \"outclassed.\"<br />\nmorrow!<br />\n<br />\nWe'll show them to-<br />\n<br />\nVASSAR WOULDN'T<br />\nThe foundations of Vassar's Honor System recently received a<br />\nsevere _jolt when college authorities unwisely made smoking on the<br />\ncampus, the rolling of stockings and other popular diversions of the<br />\ncollege female breaches of the Honor Code. Students persisted in<br />\nthe practices and the enforcement of the Honor System at the<br />\nNorthern college became a farce.<br />\nThere was much agitation on the Vassar campus for the abolition of an Honor System that could not be enforced. The question<br />\nwas submitted to the student body, which voted for retention of the<br />\nCode with the elimination of the objectionable prohibitions.<br />\nSuch superficialities have no place in an Honor System. Will<br />\nman never learn that universally unpopular laws hold no power of<br />\ncompulsion?<br />\n<br />\nThe News-Letter regrets to announce the temporary withdrawal of W. E. Thomsen from the Editorial Staff.<br />\n<br />\nWhat a difference<br />\njust a few cents make !\"<br />\n<br />\nFATIMA<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS- LETTER, NOVEMBER 28, 1923<br />\n<br />\nHOISINGTON<br />\nRE- Philippine rslands, where he has<br />\nJUNE WEEK COMMITTEE AN- MAJOR<br />\nVIEWS R. O. T. C. UNIT<br />\nNOUNCES \"THRIFT<br />\nbeen stationed with troops made ROBBIN'S STYLE BUILT HATS<br />\nNew Commandant of R. 0. T. C. up of men from the Islands. He<br />\nSTAMP PLAN\"<br />\nArrives from Philippines<br />\nFOR YOUNG MEN<br />\nFinancial Success Depends Much on<br />\nThis Plan. Orchestras Under<br />\nHopkins' R. 0. Ti'. C.. of four spent four years as an Instructor<br />\nConsideration<br />\ncompanies passed in review at West Point Military Academy.<br />\n122 W. BALTIMORE ST.<br />\nPlans for June week are already Thursday afternoon at 4.15 o'clock This is his first assignment to an<br />\nfairly well formulated and the in honor of Major Gregory Hois- R. 6.1'. C. unit,<br />\ncommittee is now starting upon ington, newly appointed<br />\nIn being assigned here to take<br />\ncommanafthe<br />\n\"putting<br />\nof<br />\nwork<br />\nactual<br />\nthe<br />\nGERHARD & REED CO.<br />\ndant of the unit here. Major Hois- the place of Major Garey, now<br />\nfair over.\" The committee is ington, together with Captain president of St. John's College,<br />\nTAILORS<br />\ncomposed of Randolph Norwood, Paul, Captain Davis, Lieutenant Major Hoisington stated that he<br />\nchairman; E. F. Perkins, treas- Atwater and Lieutenant Sherwood hopes to see the military unit in110 N. EUTAW STREET<br />\ncreased with the assistance of the<br />\nurer; B. P. Thomas, R. P. O'Con- reviewed the cadets.<br />\n2nd Floor<br />\nnor, G. M. Shriver., W. C. GardCompany A led the parade with military staff and student cadet<br />\nner and H. M. Smallwood. They the colors, with Major R. E. Pey- officers. He has not had time to<br />\npromise a June Week very much ton in command. The companies survey the local situation but will<br />\nLIBERTY ST.<br />\nlike last year's, but with a few formed in front of the engineering complete plans for the year's work<br />\nAT SARATOGA<br />\nadded features and novelties. It is buildings and marched to the up- at a later date.<br />\nthe aim of the committee to sup- per quadrangle for the review.<br />\nLUNCHEON<br />\nply the best music in the country<br />\nThe band played during the re- The Flag, Banner & Pennant Shop<br />\nTEA<br />\nfor the Senior Ball. Some of the view and was dismissed after the<br />\nDINNER<br />\n(Successors to Sisco Brothers)<br />\norchestras under consideration ceremonies.<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nare: Garber Davis, of Atlanta;<br />\nEmblems, Silk Banners for Schools, 11.30 A. M.<br />\nStationed at Philippines<br />\nSPECIAL PARTIES<br />\nSocieties and Fraternities<br />\nWeidemeyer, of West Virginia;<br />\nuntil<br />\nMajor Hoisington arrived in<br />\nPARK AVE., BALTIMORE, MD. 7.30 P. M.<br />\nPLAZA 6987<br />\nPaul Whiteman, Isham Jones, Baltimore Thursday from •Manila, 302<br />\nVernon 2355<br />\nR. H. Taylor<br />\nPennsylThe Virginians and- the<br />\nvania Serenaders. The committee's one concern is as to the kind<br />\nof financial backing to be received<br />\nfrom the student body.<br />\nLast year the actual ticket returns did not cover the expense.<br />\nThe extra money was- raised by<br />\nhaving \"tag days\" throughout the<br />\nyear preceding the affair. This<br />\nmethod was felt to be somewhat<br />\nunfair, some students who bought<br />\ntags received nothing in return<br />\nbut a feeling that they had done<br />\ntheir duty toward Hopkins. So<br />\nthis year a new plan has been<br />\nadopted.<br />\nStamps on Sale<br />\n<br />\nStamps somewhat on the order<br />\nof the Government Thrift Stamps<br />\nare to be on sale periodically<br />\nthroughout the year, beginning<br />\nthe first of this week. At the end<br />\nof the year when the student buys<br />\nhis ticket the stamps can be redeemable at their face value. Thus<br />\nit is possible to entirely pay for<br />\na ticket before June Week actually comes. The price of the tickets has not been decided yet, but<br />\nit will certainly be affected by the<br />\nresponse of the students in tile<br />\nstamp selling drive.<br />\n\"In conclusion,\" said Chairman<br />\nNorwood, \"underclassmen must<br />\nunderstand that although the<br />\nSenior Class alone is financially<br />\nresponsible for the project, it is<br />\nfor the benefit of all the undergraduates, and they owe us their<br />\nsupport.\"<br />\n<br />\nBARNSTORMERS ADOPT MUSIC FOR PRODUCTION<br />\nContinued from page 1<br />\n<br />\nWednesday at 4:15 in the Studio,<br />\nat which the attendance was larger<br />\nthan had been expected. Besides<br />\nmerely signing up for the production, the candidates were asked a<br />\nnumber of questions regarding previous experience in acting, singing<br />\n'and dancing. The answers revealed<br />\nan unusually encouraging percentage of candidates who had had previous experience in acting.<br />\nWith a view towards obtaining<br />\ninformation about talent for the<br />\ncast, the Club suggested that the<br />\ncandidates work up vaudeville<br />\nstunts of any kind at all, either<br />\nsingly or in groups. These stunts<br />\nare to be given before the Club on<br />\nDecember 3 and 4. Any candidates<br />\nwho are unable to originate their<br />\nown ideas for the acts are requested<br />\nto seek the advice of members of<br />\nthe Club before giving up the idea.<br />\nIt was emphasized at the meeting that candidates for the chorus<br />\nwill not be compelled to do any<br />\nstunts. Those who do, however,<br />\nWill find their chances of obtaining<br />\na berth in the cast greatly increased.<br />\n<br />\n3<br />\n<br />\n,C111THES<br />\nOf course you know that<br />\nThe Barn is handling orders<br />\nfor our clothes again this<br />\nyear.<br />\nThe plan worked to<br />\nmutual advantage last season, and we're mighty glad<br />\nto continue the relationship.<br />\nReady-to-wear Suits<br />\n$30 up<br />\nReady-to-wear O'Coats . $35 up<br />\n<br />\n211-213 E. Baltimore St.<br />\n<br />\nWhat Engineering<br />\nOwes to the Imagination<br />\nFrom An Argument Over<br />\nWatches Came KDKA<br />\nin the days when wireBACK<br />\nless was just beginning to<br />\n<br />\nsummoned to the office of Harry Phillips<br />\nDavis, Vice President of the company.<br />\n<br />\nspread, Frank Conrad (now<br />\nAssistant Chief Engineer of the<br />\nWestinghouse Electric & Manufacturing Company)and another<br />\nofficial, happened to compare<br />\nwatches, to see if it was time to<br />\ngo back to work. Their watches<br />\ndiffered.<br />\n<br />\n\"Frank,\" said Mr. Davis, \"I'm going to<br />\nclose your radio station.\" His attention had<br />\nbeen attracted the night before to a simple<br />\nnote in a full-page advertisement, which read,<br />\n\"Mr. Conrad will send out phonograph music<br />\nthis evening.\"<br />\n<br />\nUnable to convince his friend<br />\nthat his watch was right, Mr.<br />\nConrad suddenly remembered<br />\nthat the naval station at Arlington, Va., had just inaugurated<br />\na system for sending out daily<br />\ntime signals by radio. Just the thing to prove<br />\nhis point!<br />\n<br />\nYou know the rest. In November, 1920,<br />\n\"KDKA\" was formally opened to send out<br />\nelection _returns. It had received the first<br />\nlicense issued by Uncle Sam. Today over 500<br />\nbroadcasting stations entertain and educate<br />\nmillions of people each night, a wonderful<br />\nresult from so insignificant an argument as<br />\none oyer -watches.<br />\n<br />\nSo he built a simple set of receiving apparatus,<br />\nerected an aerial, and—you can imagine what<br />\nhappened! He was badly bitten by the radio bug.<br />\nAfter proving to his satisfaction the accuracy of his<br />\nwatch, he started experimenting with the transmission of music by radio, with good success.<br />\nHe began sending out phonograph music from<br />\nhis home, and attracted the attention of some of<br />\nthe big department stores, that had installed radio<br />\ndepartments. They in turn, started advertising<br />\nMr. Conrad's \"musical evenings.\"<br />\nThen, one day, upon arriving at his desk, he was<br />\n<br />\nBroadcasting Studio at Station KDKA, Westinghouse Electric Jo<br />\n<br />\nManufacturing Co. East Pittsburgh, Pa.<br />\n<br />\nWestinghouse<br />\nACHIEVEMENT<br />\n<br />\nOPPORTUNITY<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 28, 1923<br />\n<br />\n4<br />\n<br />\nIMPORTANT!<br />\n<br />\nSANFORD'S<br />\nFOUNTAIN PEN INK<br />\nWill Improve the Action<br />\nof Any<br />\nFountain<br />\nI<br />\nPen<br />\n•<br />\n1- \"juWiela`<br />\n14<br />\n<br />\nTickets for Maryland game must be bought in advance.<br />\nAbsolutely no Student Tickets will be sold at the gate.<br />\nGAME<br />\nHOPKINS-MARYLAND<br />\nSTADIUM TOMORROW<br />\nContinued from page 1<br />\n<br />\nAT<br />\n<br />\nAND<br />\nBLACK<br />\nBLUE JAY<br />\nADOPTS CONSERVATIVE<br />\nPOLICY<br />\nthe J. H. U. squad was tested in<br />\nEditor-in-Chief Dunning anthe game against Cornell and what nounced at a meeting of the Black<br />\nfew imperfections were observed and Blue Jay staff held on Tues11111<br />\nALL<br />\nin that melee have since been cor- day, that the next issue of the<br />\nCOLORS<br />\nrected.<br />\nBlack and Blue Jay will be very<br />\nfOUYARIPENINK<br />\nFL.50:ING<br />\nEASY<br />\nBoth Teams Had Brilliant Season<br />\nBLACK<br />\nO one ever<br />\nALL<br />\nBLUE<br />\nconservative, both in cuts and copy.<br />\ncto,4 00:,'D<br />\nTomorrow's contest will mark<br />\nSIZES<br />\nA number of criticisms have been<br />\ngets tired of<br />\n•<br />\nthe close of each team's most bril- filed with Dunning and it is his<br />\ni! I II<br />\nMelachrinos—<br />\nliant season in many years. The<br />\n\"The Ink That Made<br />\nearnest desire to comply with stuMaryland machine has played<br />\ntheir unfailing<br />\ndent sentiment and demand.<br />\nThe Fountain Pen Possible\" good<br />\nfootball since it defeated<br />\nquality is a conNominations were made at the<br />\nPennsylvania in the first game.<br />\nmeeting for the election of a new<br />\nstantsatisfaction.<br />\nThe record of the Hopkins team<br />\nart editor of the Jay. The names<br />\nis an enviable one, the Homewood<br />\nof Ralph Wales and Alan Gump<br />\ngridders having lost only to<br />\nwere put up for the nomination and<br />\nPrinceton and Cornell and then in<br />\nwill be voted on at a meeting of the<br />\nORIGINAL<br />\nhard-fought contests. The fact<br />\nwhole staff to be held Tuesday,<br />\nthat only six points have been<br />\nThe position of art editor is one<br />\nscored against the Black and Blue<br />\nof large responsibility—entailing<br />\non Homewood field speaks well<br />\nnot only taste and judgment in sefor the defense of the local stars,<br />\nLimited<br />\n\"The One Cigarette Sold the World Over\"<br />\nlection of cuts used for the magaand the 153 points scored by Hopzine, but also quality in the editor's<br />\nCaptain<br />\nBARN CAFETERIA kins is indicative that can<br />\nindividual work.<br />\nadd<br />\nBonner and teammates<br />\nGeorge B. Hess, '25, was elected<br />\ncounts for their colors.<br />\nCirculation Manager of the Black<br />\nCoach Van Orman's charges are and Blue Jay at a meeting of the<br />\n1:1EIROggEt117gENEEtE11=11:11E1E1E.ENCIEM1=121<br />\noing on the field tomorrow to Business Staff. He takes the place<br />\nwin. This game is the contest for of W. Gardner Packard, recently<br />\nwhich they have been waiting'and resigned. W. Bates Draper, '26,<br />\nthe 'Maryland machine is going to was elected to the Business Staff.<br />\nmeet a bunch of the hardest batEarle A. Nielson was appointed<br />\ntlers that they have met this fall. to the Art Staff by virtue of exHO OM 011110<br />\ncellent and continuous work. He<br />\nWASHINGTON UNIVERSI\"The King of Lubricants\" GEORGE<br />\nhas shown exceptional. talent in the<br />\nTY FALLS BEFORE DASHING<br />\nATTACK OF HOPKINS<br />\nexecution of a number of sketches<br />\nContinued from page 1<br />\nSHERWOOD BROTHERS, INC.<br />\nprinted lately in the Jay and gives<br />\nonly score. This promise- of -delieloping into a firsttbeir<br />\nfor<br />\nover,<br />\nNAIRg NNEIMEMENENEREICENECIEEKEI<br />\nbrought about a stiffening of the class illustrator.<br />\nBlack and Blue squad, resulting in<br />\nThe next issue of the Jay will<br />\nNECKWEAR a touchdown gained by consistent<br />\nSHIRTS<br />\nmake to appearance about Decemline plunging.<br />\nber 15 and all copy will be due the<br />\nThird Quarter Scoreless<br />\nMonday after Thanksgiving. This<br />\n421 N. HOWARD ST.<br />\nand individuality is offered here at prices that are not<br />\nThe Hopkins team, which held issue will end the official competiand cannot be underquoted by any house at any time.<br />\nGLOVES Cornell without scoring during the tion between Freshmen candidates,<br />\nHOSIERY<br />\nBesides the reputation of an old-established firm<br />\nthird period of their game at Ithaca but all candidates who do not make<br />\nof each sale with a guarantee.<br />\nis<br />\nback<br />\nfate<br />\nsame<br />\nthe<br />\nsuffered<br />\nten days ago<br />\nthe staff at the first election are<br />\nWashGeorge<br />\non Saturday when<br />\nurged to continue to work.<br />\nington's eleven checked their rapid<br />\nmarch to victory for fifteen minALL ROADS LEAD TO<br />\nDRAPERIES<br />\nDECORATIONS<br />\nFURNITURE<br />\nSTADIUM<br />\nutes of play. The visitors were not<br />\n343 NORTH CHARLES STREET<br />\nable to hold Coach Van Orman's<br />\nConspicuous orange aid black<br />\nMEN'S SHOES<br />\nraring athletes longer than that, placards will guide football enOf the Better Class<br />\nhowever, as the home team settled thusiasts to the stadium tomordown to football in the last period row to witness the state title tilt<br />\nURNER BROTHERS<br />\nand tallied 26 more points. Even between the University of Mary11 1 E. BALTIMORE STREET<br />\nthe second and third String players land and Johns Hopkins. Many<br />\nBaltimore<br />\nwhich the Hopkins mentor sent in students have already posted the<br />\nduring this quarter were able to conspicuous arrows along the<br />\nAt the Washington Monument<br />\nscore against their weakened op- principal automobile routes leading out of the city so that attenponents.<br />\nOscar Thomas Olson, D.D.<br />\ntion to the great football contest<br />\nMinister<br />\nSIGMA CHI BETA HOLDS PUBLIC will be attracted far and wide.<br />\nHALL<br />\nINITIATION AT HARVEST<br />\nThis advertising enterprise is<br />\nHopkins Students Are Invited to<br />\nContinued from page 1<br />\nunder the direction of the athThis Their Church Home<br />\npart<br />\nMake<br />\nactive<br />\nties. It will take an<br />\nletic office.<br />\nin the June Week activities.<br />\nThe purpose and program of this<br />\nThe work of Sigma Chi Beta is<br />\nFIVE MEN PLEDGED TO<br />\nwill appeal to you. Look in<br />\nChurch<br />\nSCABBARD AND BLADE<br />\nto a large extent supplementary to<br />\nafternoon -At Home\"<br />\nthe<br />\nSunday<br />\non<br />\nthat of the Interfraternity Board. Scabbard and Blade pledged its<br />\nseven.<br />\nto<br />\nfive<br />\nfrom<br />\nIts fundamental purpose is to pro- full quota of men at the review<br />\nmote better understanding and staged Thursdays in honor of<br />\nSunday morning worship at I I o'clock.<br />\nmore cordial relations between the Major Hoisington, the new comSunday evening service at 8 o'clock.<br />\nfiraternities on the campus and in- mandant. President J. E .Mount,<br />\nMusic by vested chorus—choir of soloists.<br />\ncidentally to promote Hopkins in Captain Co. I, Second Regiment,<br />\nyear<br />\neach<br />\nin<br />\ntakes<br />\nthe<br />\nIt<br />\nway.<br />\nand<br />\nconferred<br />\nBlade,<br />\nScabbard<br />\nevery<br />\nNot naturally—but it's getting<br />\na group of socially congenial men red, white and blue ribbon on the<br />\nALL SEATS FREE<br />\nhigher. The first line of hair is<br />\n\"At the heart of the City\"<br />\nin retreat. Bring up the \"Vasin<br />\nand<br />\ncampus<br />\nthe<br />\non<br />\nfew<br />\ncongrata<br />\nwords<br />\nadding<br />\nprominent<br />\nmen,<br />\nTonic!<br />\nHair<br />\neline\"<br />\nAnd how do you think the collar<br />\nulating them on the honor and refraternity life.<br />\nadvertisement men got that way?<br />\nVaseline\"Hair Tonic, of course.<br />\nfalling on their shoulsponsibility<br />\nelecspring<br />\nthe<br />\nof<br />\n,<br />\nthe<br />\ntime<br />\nAt<br />\nIt will lay your rebellious curls in<br />\nthe same sleek and shiny manner.<br />\nders.<br />\nstudent<br />\nentire<br />\nthe<br />\nby<br />\nvote<br />\na<br />\ntions<br />\n\"Vaseline\" Hair Tonic will improve<br />\nthe condition of your hair as well<br />\nThe following men were recipibody is taken to determine the<br />\nas its appearance.<br />\nof the high honor in the mil- DRIVE IT YOURSELF!<br />\nents<br />\nAt all drug stores and student barmost popular man on the campus..<br />\nber shops.<br />\nitary<br />\ncircle of the University: LawHis name is then placed upon the<br />\nALL NEW,CLEAN CARS<br />\nR. Kent, Gordon Post, Thos.<br />\nrason<br />\nSigma Chi Beta award which<br />\nHUPS, 18c PER MILE<br />\nhangs in the Trophy Room of the Jenifer, Robert Ohrenshial, Robert FORDS, 12c PER MILE—DODGES OR<br />\nMILES OR MORE<br />\n50<br />\nFOR<br />\nSPECIAL<br />\nRATES<br />\nREDUCED<br />\nBarn. This is a plastic reproduc- Peyton.<br />\nThe date of the invitation into<br />\ntion of the badge of the society, a<br />\nskull superimposed upon two the order has not yet been decided<br />\nVERNON 4049<br />\n1725 N. CHARLES ST.<br />\nChesebrough Mfg.Coil crossed bones with the Greek let- but will be held in the near future<br />\n(consolidated)<br />\nONE BLOCK SOUTH OF NORTH AVE.<br />\nters E X B across the forehead. if precedent is upheld.<br />\n<br />\nN<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\n<br />\ntE111.-7<br />\n<br />\nLeFranc & Ault<br />\n<br />\nMELACHRINO<br />\n<br />\nBaltimore's Great<br />\nMen's Store<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nURNER'S<br />\n<br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\n<br />\nhigh<br />\nbro*?<br />\n<br />\nRENT A CAR<br />\n<br />\nVaseline<br />\nREG. U.S. PAT. OFF.<br />\n<br />\nHAIR TONIC<br />\n<br />\n11<br />\n<br />\nDRIVE IT YOURSELF CO.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVIII, No. 16<br /><br />\na<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 28, 1923<br /><br />\nBEAT MARYLAND<br />\nSIGMA CHI BETA HOLDS HOPKINS-FIFTH REGIMENT MUSIC FOR BARNSTORMERS<br />\nPUBLIC INITIATION AT<br />\nGAMES DATE CHANGED<br />\nCLUB PRODUCTION PREHARVEST BALL<br />\nGeorgetown Awarded February 21.<br />\nSENTED AT MEETING OF<br />\nProspects for Championship Team<br />\nSixteen Men Enter Rank of Membership<br />\nMEMBERS<br />\nof Honorary Society. Initiation<br />\nDance Feature of Evening<br /><br />\n5<br /><br />\n••<br /><br />\nPRICE 5 CENTS<br /><br />\nBright<br /><br />\nRehearsals to Start in Two Weeks. Vau-<br /><br />\nHOPKINS-MARYLAND GAME ATSTADIUM<br />\nTOMORROW FOR STATE CHAMPIONSHIP<br />\nBoth Teams Keyed up for Most Important Game of 1923<br /><br />\nBecause of a conflict with the<br />\ndeville Stunts for Beginners on<br />\nFootball Season in Maryland<br />\nSixteen upperclassmen were meet that Georgetown is putting<br />\nDecember 3 and 4<br />\nadded to the roster of Sigma Chi on the night of February 21, HopA number of the members of<br />\nBeta, an interfraternity and hon- kins has been forced to shift the the Barnstormers' Club met last<br />\nLINEUP TOMORROW<br />\norary society, at its annual initia- date of the Hopkins-Fifth Regi- Thursday night at the home of<br />\nMARYLAND Wt.<br />\nPosition<br />\nHOPKINS<br />\nWt.<br />\ntion held at the Beta Theta Pi ment meet to February 23. There Walter B. Swindell, who is coach.150. . . .L.E. . .Supplee ▪ 17....171<br />\n24 Schacht<br />\nHouse last Saturday evening. was a discussion as to whether ing the production, to hear the mu.. .160. . . .L.T<br />\n13 Magill .<br />\nT. . .Bromley ▪ 21....191<br />\n181<br />\n14....186<br />\n.L.G. Hall<br />\n5 Wolbert<br />\nThose who received the honor Johns Hopkins or Georgetown sic written for the play by Edward<br />\nPollock<br />\n4 Day<br />\n145<br />\n9....158<br />\nwere John W.Parsons, John S. V. had a prior claim to the date and Spieker, Class of '14. Mr. Spieker,<br />\n181<br />\n24....173<br />\nBrewer<br />\n8 Barton<br />\n.R.G<br />\nB. Shriver, R. Carmichael Tilgh- it was finally settled in favor of who is at present connected with<br />\n.R.T.. Burger<br />\n22....193<br />\n9 Carter<br />\n185<br />\nman, Malcolm R. Gilpin, Jr., Wil- the latter institution. The Hop- the United States. Geological Sur11 Rich<br />\n155. . . .R.E. . .Lanigan<br />\n▪ 10....181<br />\nliam N. Krout, Donald R. Reese, kins' sanction from the South At- vey in Washington,.was on hand<br />\n145<br />\n8....142<br />\n15 Taylor<br />\nBesley<br />\nQ B<br />\n2....171<br />\n1 Bonner . . .. 140. . . .H.B. ..Pugh<br />\nW. Carville Gardner, Edward lantic Amateur Athletic Union to play the songs himself.<br />\n33....175<br />\n6 Turnbull . . . 160. . ..H .B. . .Osborn<br />\nDunning, was revoked by the national body<br />\nWatson, Fitzgerald<br />\nThe rendering of the songs was<br />\n160, . . .F.B. . .McQuade ▪ 11....184<br />\n10 Maxwell<br />\nJohn A. Cochran, Gordon Post, R. in session at Detroit; for it an occasion for great enthusiasm on<br />\nSUBSTITUTES<br />\nPage O'Connor, Douglas Turn- claimed that both schools had been the part of the members present.<br />\nYoung . . 1 Herzog . .<br />\nBerndt ... 7 Gilliece . ..12<br />\nbull, William Harriso-n, Miles ,given the date, but that George- The officers of the Club are unaniLatham . .18 Groves . . 3<br />\nSlowik ... 3 Young . . .18<br />\nMarrian and A. K. Mitchell. Fol- town was given it first. The date mous in declaring that the songs<br />\nBonnet ..23 Branner.. . 5<br />\nMilanausky.16 Jackson .. .20<br />\nlowing the initiation ceremonies of February 23 has finally been far exceeded their expectations.<br />\n. .14<br />\nWaters ..16 Heine .. . 4<br />\nCook .... 2 Asendorf.<br />\nthe newly elected members attend- sanctioned, and the meet will be They declare the music to be unGundry.<br />\n. .12 Parker . . 6<br />\nCarr, J . .23 Almy . . . .21<br />\ned the Harvest Ball, in the Civil held on that night.<br />\nLevy . . . .22<br />\nCarr, S. .<br />\nusually melodious. About half of<br />\nHutzler .. .25<br />\nThis is an unfortunate change, the songs are said to be based on<br />\nEngineering Hall, -given in their<br />\nfor<br />\nseveral of the prominent ath- the native music of Peru. In fact,<br />\nhonor.<br />\nletes<br />\nwho were to enter may de- the production will be more along GEORGE WASHINGTON UNITomorrow is the day that the<br />\nThe Harvest Ball was not, as<br />\ncide<br />\nto<br />\nwithdraw.<br />\nIt<br />\nwould<br />\nkeep<br />\nHopkins<br />\nfootball team reaches the<br />\nthe<br />\nlines<br />\nof<br />\nan<br />\noperetta<br />\nthan a regcustomary in previous years, givVERSITY FALLS BEFORE<br />\nthem<br />\naway<br />\nfrom<br />\ntheir<br />\nuniversities<br />\nclimax<br />\nof<br />\nits 1923 season; the<br />\nular<br />\nmusical<br />\ncomedy.<br />\nIn it, jazz<br />\nen for members of Sigma Chi Beta<br />\nDASHING ATTACK OF<br />\nor<br />\naway<br />\nfrom<br />\nbusiness<br />\ntoo<br />\nlong.<br />\nMaryland<br />\ngame.<br />\nwill<br />\nCoach Van Orgive<br />\nplace<br />\nalmost entirely to<br />\nonly but was open to all UniversiHOPKINS<br />\nBlack and Blue Stars Return<br />\nman<br />\nhas<br />\ncoached<br />\nsquad all fall<br />\nhis<br />\nMr.<br />\nSpieker's melodies.<br />\nty students. This was done for the<br />\nSubstitutes Continuing Adding to the<br />\nHopkins has an excellent opporto<br />\nget<br />\nMaryland<br />\nand eleven deterScore Started by Regulars at<br />\npurpose of furthering its policy of tunity to capture the<br />\nFirst Act Complete<br />\nmeet this<br />\nGame<br />\nBeginning<br />\nof<br />\nmined,<br />\nhard-fighting wearers of<br />\nbettering social relations on the year. Usually an outside<br />\nAccording to the present plans,<br />\nteam<br />\nHopkins proved its offensive the Black and Blue will march out<br />\neach act will be embellished with<br />\ncampus. The C. E. Hall, scene of walks off with the total-points<br />\ntrothe festivities, was decorated with phy. But the team.<br />\nabout five songs. Mr. Spieker has strength on the gridiron last Satur- on the Stadium field tomorrow<br />\nwhich ran over<br />\nall the multi-colored products of opposition last year,<br />\narranged a complete score for a day by piling up a score of 62-6 afternoon to wrest the State chamand which<br />\nmusical comedy and the songs for against the George Washington pionship from the College Park<br />\nautumn: Shocks of corn adorned ranled as one of the ten leaders<br />\nof<br />\nthe<br />\nstreamers<br />\nfirst act are practically perfect- University football team. The warriors.<br />\nblack<br />\nof<br />\nand the country, remains practically<br />\nthe walls;<br />\ned. Although those for the second Black and Blue was far superior<br />\ngold interlaced above the heads of intact this year, and should<br />\nThe followers of Curly Byrd are<br />\nplace<br />\nthe dancers; pumpkins, potatoes, Hopkins, among the<br />\nand third acts are not yet completed to its rivals in every department of confident of victory in the big<br />\nleaders again.<br />\nall of the airs have been decided the game, gaining with ease in every Thanksgiving day battle, but they<br />\nears of corn, and apples were in Captain Booth and Louis<br />\nClark<br />\nabundance, grouped about a rustic are again eligible. Booth is ex- upon- and they await only the fin- period of play except the third, have not yet reckoned with the<br />\nishing touches. A number of the when the visitors were able to hold large squad of grim fighters that<br />\n• barrel of cider at one end of the pected to retain his national<br />\ndislyrics were written on Thursday them without a score. The game is waiting anxiously for a chance<br />\nhall. On the board, at the other tance titles, and Clark is<br />\nalways<br />\nnight under the stimulating inspira- afforded a good workout for to get at the throats of the Maryend, was drawn the insignia of the among the leaders in the<br />\ndash<br />\nsociety, a skull with orle black and events. Other valuable men are tion of Mr. Spieker's harmonies. Coach Van Orman's squad, giving land players. Football and State<br />\na large number of the scrubs a are in the minds of all Hopkins<br />\none blue eye and pearl teeth, bear- left, but the team is weak<br />\nin field Most of the words were written by<br />\ning on its forehead the letters events. While<br />\nD.<br />\nStuart<br />\nMossom, Class of '21, chance to play against a college men. Play football and beat State<br />\nProctor may be<br />\nwho is a member of the Advisory team.<br />\nX B, superimposed on two counted upon to score in<br />\nare two things that Hopkins men<br />\nthe<br />\ncrossed bones, on a sign board jumps, there is no capable<br />\nCouncil of the Club. The lyrics, The local machine started scor- are going to do tomorrow afterweight<br />\nsurmounted on a large factory man, unless one develops from<br />\nwhich are appropriate for the mu- ing within the first two minutes of noon.<br />\nthe<br />\nsic, have a flavor which is distinctly play. After receiving a kick-off,<br />\ncasting its shadow on surrounding unusually abundant freshman<br />\nHopkins Team Ready<br />\nmalow buildings. A harvest moon terial.<br />\nin accord with the rest of the play. which was spoiled by the strong<br />\nCoach Van Orman has been forMany of the songs were written wind which blew across the field tunate with his squad this fall in<br />\nsmiled benignly down upon the<br />\nAside from the Fifth Regiment<br />\ndancers for a moonlight waltz. meet, the schedule, both indoor by Mr. Spieker shortly after his all afternoon, the Black and Blue having every man in condition for<br />\nYoung's orchestra, harmoniously and outdoor, is incomplete.<br />\nThe graduation from Hopkins. They kicked back, recovering the pig- the last and most important game<br />\ndressed in overalls, presented a opponents for next spring, how- were written expressly for Hop- skin fifteen yards from the goal. of the season. The injured list has<br />\nnovel effect in their rural attire ever, will be of a higher<br />\ncalibre kins, although the production of a Maxwell carried it six yards nearer claimed but few of the Hopkins<br />\nand furnished music for the social than<br />\nformerly. It is felt that as musical comedy was then an ex- the zero line and Bonner carried it gridders and those for only a short<br />\nfunction.<br />\nHopkins has a first class track tremely visionary project. Under over after receiving a neat pass time. Recent injuries to several<br />\nThe feature of the evening was team, high-grade meets will re- his leadership in his undergraduate from Maxwell.<br />\nplayers were pronounced cured<br />\nthe Initiation Dance. At this time sult. The usual intercollegiate days, the Hopkins Glee Club prelast week, giving the Black and<br />\nTurnbull Kicks Goal<br />\nthe new members formed a line competitors will be entered, and sented quite a lot of his work. He<br />\nA few minutes after Bonner's Blue its full quota to start the last<br />\nacross the center of the hall with some of the stronger point win- has since been coach of the Glee first touchdown the Hopkins eleven few days of intensive training.<br />\nthe old members directly opposite ners will probably be sent to the Club, and has written songs for the again approached the end of the Since the St. John's game the Blue<br />\nthem at the far end. As the name national championships. Hopkins Paint and Powder Club.<br />\nfield, and, failing to gain through Jays have been preparing for the<br />\nIt was recently announced that the line, the J. H. U. quarterback Thanksgiving day contest and<br />\nof the neophyte was read, he went was third at Philadelphia and secthe first act will be entirely written called on Turnbull to try a place- now the battling gridders are all<br />\nforward to be presented with a ond at Chicago last season.<br />\nand rehearsals will begin on it with- ment kick which passed squarely set for whatever Captain Mcred carnation, the flower of the soin<br />\nthe next two weeks.<br />\nciety, and to be received into its UNIVERSITY TO BE CLOSED<br />\nbetween the bars. From then until Quade and his teammates have in<br />\nLarFe Number of Candidates<br />\nrank of membership. The addition<br />\nthe end of the quarter Hopkins store for them.<br />\nFOR THANKSGIVING<br />\nof these members brings the total<br />\nA meeting of candidates for the scored at will on their opponents<br />\nAll exercises and work at Johns<br />\nThe game with George Washmembership up to thirty now in Hopkins will be suspended Thanks- Barnstormers' Club was held last annexing 29 points before the perington University last Saturday<br />\nth e University.<br />\ngiving Day, November 29, accord- a berth in the cast greatly increased. iod closed.<br />\nwas helpful to the Hopkins team,<br />\nContinued on page .3. col. 1<br />\ning to an official statement from<br />\nThe second quarter was not as as it gave the backfield and ends a<br />\nProgram of Activities Outlined<br />\nAn extensive program of activi- President Goodnow.•<br />\neasy for the Blue Jays due to a chance to perfect their teamwork<br />\nstrengthening of the Washington- against opposition. The scoring<br />\nties has been outlined for the comFluildings on the carhpus will be<br />\nThere will be a dance in<br />\ndefense. The visitors sur- factor of the Homewood eleven<br />\nian's<br />\ning months and preparations are closed for the day, but will be opt-n<br />\nthe C. E. Hall after Thanksgiving Game.<br />\nprised their superior rivals at one had been ragged until that time,<br />\nnow being made. The society will Friday and Saturday, Novembgr 30<br />\nact as host to the representatives and December 1. Only those classes<br />\ntime by making a touchdown after but now they are ready to plow<br />\nand members of athletic teams will meet Friday and Saturday<br />\ncompleting a series of forward through a concrete wall if necesHave you bought your<br />\npasses. Henderson carried the ball sary. The defensive strength of<br />\nfrom other colleges and universi- which are especially notified by inJune Week stamps?<br />\nstructors, the notice concludes.<br />\nContinued on page 4 col. 2<br />\nContinued on page 4, col. 2<br />\nContinued on Page 4, col. 2<br /><br />\nTHE JOHNS HOPKINS NEWS - LETTER, NOVEMBER 28, 1923<br /><br />\n2<br /><br />\nments that De Pachman is the<br />\ngreatest living interpreter of Chopin, have brought on his head a<br />\nPrinters of Philological and<br />\nflood of hostile criticism. We are<br />\nScientific Works<br />\n!<br />\ncontrib<br />\na<br />\nlast<br />\nAt<br />\nFOUNDED 1897<br />\ninclined to take his own word—<br />\n23 S. HANOVER ST.<br />\n\"In place of the usual pledge<br />\nand this in all seriousness.<br />\nBaltimore, Md.<br />\n$2.00 that accompanies most papers at<br />\nSubscription<br />\nA glance at his life .shows that<br />\nthe University, I should like to<br />\nused by he has indeed been, in the terms<br />\nbe<br />\nto<br />\nsubstitute<br />\na<br />\nsuggest<br />\nBoys, the place to get your<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at the English Department. Instead of his press agent, \"his own seBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nmeals—and they are honof the customary 'I. have neither verest critic.\" After many early<br />\nsuccessful<br />\nslohelp'<br />\nany<br />\nest-to-goodness meals, well<br />\nmost<br />\na<br />\nand<br />\nnor<br />\nreceived<br />\ntriumphs,<br />\ngiven<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nPachman<br />\nadoptbe<br />\nDe<br />\nmight<br />\nRussia,<br />\nin<br />\nfollowing<br />\ndebut<br />\ngan, the<br />\nserve d, and reasonably<br />\nHopkins University.<br />\nwas not satisfied with, himself.<br />\ned :<br />\npriced—is at<br />\n\"'In this paper I have not al- Before he would again appear in<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications lowed the slightest spark of per- public he spent eight years in<br />\nshould be sent to the MANAGING EDITOR.<br />\nsonality to enter, neither have I study. Most of his critics, in<br />\nused the personal pronoun. The America at least, have berated<br />\nHomewood 100<br />\nTelephone<br />\npunctuation is guaranteed to be of him or his \"lack of modesty\" and<br />\nthe vintage of 1600 (Whether A. not for any deficiencies in his mu1817 N. Charles St.<br />\nD. or B. C. is apparently a matter sical talent. Surely, after having<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nhimwith<br />\nconstrucyears<br />\nlived seventy-five<br />\nof choice), as is also the<br />\nJOSEPH LEOPOLD, '24<br />\n(Half Block below North Ave.)<br />\nPHILIP W. HOWARD, '25<br />\ntion.'<br />\nself, he should be a more compeManaging Editor<br />\nAdvertising Manager<br />\n\"Signed<br />\ntent critic of De Pachman than<br />\nNicholas Brown, Mgr.<br />\nWILLIAM G. DEAN, JR., '24<br />\nFITZGERALD DUNNING, '24<br />\n\"Infernal Machine.- any one else.<br />\n* * *<br />\nAssistant Managing Editor<br />\nCirculation Manager<br />\nT. REESE MARSH, '24<br />\nIn accordance with Fernie's<br />\nJOHN C. LEWIS, JR., '24<br />\nand,with appropriate<br />\nsuggestion,<br />\nAssociate Editors<br />\nAssistant Business Managers<br />\n,Mr. Samuel Pepys,<br />\nto<br />\napologies<br />\nRICHARD C. TILGHMAN, '25<br />\nD. MILES MARRIAN,'25<br />\nthe News-Letter's chronicler of<br />\nJOHN W. PARSONS,'25<br />\nG. DONALD GIESKE,'25<br />\nBENJAMIN T. ROME,'25<br />\nfootball feats, he. of \"Gridiron GosJOHN T. DIXON, '24<br />\nmight write next week:<br />\nsip,\"<br />\nJunior Editors<br />\nA. J. MoKAY,'26<br />\nTo<br />\nHomewood Field to garner<br />\n'24<br />\nTOVELL,<br />\nARTHUR L. NELSON, '26<br />\nC. EUGENE<br />\nERNEST A. STRATHMAN, '26<br />\nof the gridiron. Having<br />\nOTHO J. KELLER, III, '26<br />\ngossip<br />\nALGER G. Hiss, '26<br />\n'26<br />\nKIDD,<br />\nJACKSON<br />\nJ.<br />\nlate that one of the First<br />\nof<br />\nheard<br />\n'26<br />\nEDWARD O. MICHEL,<br />\nT. STRAN SUMMERS,'25<br />\nCHARLES G. HUTZLER, '24<br />\nFoundations of Virginia had,<br />\nthrough a most disastrous holoMember Southern Intercollegiate Newspaper Association<br />\ncaust, lost the fine apparel of its<br />\nfootball contenders, I did feel<br />\nBaltimore, Md.<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts.,<br />\nheartened concerning our own<br />\n\"Dappers and Smarts.\" For Lord,<br />\nBALTIMORE, MD., NOVEMBER 28, 1923<br />\n'tis said this F. F. of V. did practice in pyjamas for nigh a fortnight, Asis my custom I did fare<br />\nWE'LL SHOW THEM<br />\nto the manager for tidings and<br />\nsight. A<br />\na<br />\nThere are many sport fans in the city of Baltimore who will not there beheld wondrous<br />\nbaker's dozen of beardless youths,<br />\nconcede Johns Hopkins a chance to win tomorrow's game. \"Mary- most still in knickerbockers, who<br />\nland has one of the strongest teams in the country,\" they argue. professed to be assistants to the<br />\n\"Hopkins will indeed be fortunate to hold the College Parkers to a manager, did array before my astonished eyes garments of vivid<br />\nlow score.\"<br />\nblue. One quoth: Here is exceedhold<br />\nwho<br />\npeople<br />\nWe will not attempt to estimate the number of<br />\ning<br />\nadroitness, on Thursday eve<br />\nthis opinion. The number is undoubtedly a large one. We will say, these will bewilder—L. But I had<br />\nhowever, that there are some thirty-five men, composing the Johns fled and heard no more. I ponHopkins football squad, who disagree violently with such views. dered in a very panic the millenThe new Stetson line includes a wide range of<br />\nThey realize Maryland's prowess and they realize the task before ium was come. A hopkins team<br />\nLord!<br />\nin<br />\nfinery.<br />\nsince<br />\nsmart<br />\nstyles specially designed for young men<br />\nMat'yland<br />\ntowards<br />\nthem. They have, however; been pointing<br />\n*<br />\n*<br />\n*<br />\n—all with the \"Stetson\" stamp of quality.<br />\nSeptember. They have been holding back, accepting low scores in<br />\n-Vladimir De Pachman, the fatheir victories and allowing strong opponents to roll up the points, mous pianist, has our sincerest<br />\nSTYLED]<br />\nOR.YOUNG MEN<br />\nhas<br />\nEverything<br />\npower.<br />\ntheir<br />\nof<br />\nextent<br />\nrather than reveal the full<br />\nadmiration. De Pachman's statebeen subordinated to the Maryland game. And now, on the eve of<br />\nthe battle, Maryland has shown its all, while Hopkins still has a<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nThe Johns Hopkins News-Letter Mayb© So —<br /><br />\nThe St. REGIS<br />\nRESTAURANT<br /><br />\nC--(STETSOI•OcP<br /><br />\nBats<br /><br />\nfew bolts left to spring.<br />\nEleven men with Black and Blue jerseys will line up tomorrow's contest with but one aim in mind. They will not be playing a<br />\ndefensive game and they will not be attempting to hold down the<br />\nscore. They will be giving everything they have every minute with<br />\nbut one sole object: to BEAT MARYLAND.<br />\nThe student body is behind the team to a man. While the<br />\nBlack and Blue jerseys are giving their all on the field, the Black<br />\nand Blue rooters will be giving their all in the stands. Both will<br />\nbe satisfied with but one conclusion: a victory over Maryland.<br />\nBaltimore considers us \"outclassed.\"<br />\nmorrow!<br /><br />\nWe'll show them to-<br /><br />\nVASSAR WOULDN'T<br />\nThe foundations of Vassar's Honor System recently received a<br />\nsevere _jolt when college authorities unwisely made smoking on the<br />\ncampus, the rolling of stockings and other popular diversions of the<br />\ncollege female breaches of the Honor Code. Students persisted in<br />\nthe practices and the enforcement of the Honor System at the<br />\nNorthern college became a farce.<br />\nThere was much agitation on the Vassar campus for the abolition of an Honor System that could not be enforced. The question<br />\nwas submitted to the student body, which voted for retention of the<br />\nCode with the elimination of the objectionable prohibitions.<br />\nSuch superficialities have no place in an Honor System. Will<br />\nman never learn that universally unpopular laws hold no power of<br />\ncompulsion?<br /><br />\nThe News-Letter regrets to announce the temporary withdrawal of W. E. Thomsen from the Editorial Staff.<br /><br />\nWhat a difference<br />\njust a few cents make !\"<br /><br />\nFATIMA<br /><br />\nTHE JOHNS HOPKINS NEWS- LETTER, NOVEMBER 28, 1923<br /><br />\nHOISINGTON<br />\nRE- Philippine rslands, where he has<br />\nJUNE WEEK COMMITTEE AN- MAJOR<br />\nVIEWS R. O. T. C. UNIT<br />\nNOUNCES \"THRIFT<br />\nbeen stationed with troops made ROBBIN'S STYLE BUILT HATS<br />\nNew Commandant of R. 0. T. C. up of men from the Islands. He<br />\nSTAMP PLAN\"<br />\nArrives from Philippines<br />\nFOR YOUNG MEN<br />\nFinancial Success Depends Much on<br />\nThis Plan. Orchestras Under<br />\nHopkins' R. 0. Ti'. C.. of four spent four years as an Instructor<br />\nConsideration<br />\ncompanies passed in review at West Point Military Academy.<br />\n122 W. BALTIMORE ST.<br />\nPlans for June week are already Thursday afternoon at 4.15 o'clock This is his first assignment to an<br />\nfairly well formulated and the in honor of Major Gregory Hois- R. 6.1'. C. unit,<br />\ncommittee is now starting upon ington, newly appointed<br />\nIn being assigned here to take<br />\ncommanafthe<br />\n\"putting<br />\nof<br />\nwork<br />\nactual<br />\nthe<br />\nGERHARD &amp; REED CO.<br />\ndant of the unit here. Major Hois- the place of Major Garey, now<br />\nfair over.\" The committee is ington, together with Captain president of St. John's College,<br />\nTAILORS<br />\ncomposed of Randolph Norwood, Paul, Captain Davis, Lieutenant Major Hoisington stated that he<br />\nchairman; E. F. Perkins, treas- Atwater and Lieutenant Sherwood hopes to see the military unit in110 N. EUTAW STREET<br />\ncreased with the assistance of the<br />\nurer; B. P. Thomas, R. P. O'Con- reviewed the cadets.<br />\n2nd Floor<br />\nnor, G. M. Shriver., W. C. GardCompany A led the parade with military staff and student cadet<br />\nner and H. M. Smallwood. They the colors, with Major R. E. Pey- officers. He has not had time to<br />\npromise a June Week very much ton in command. The companies survey the local situation but will<br />\nLIBERTY ST.<br />\nlike last year's, but with a few formed in front of the engineering complete plans for the year's work<br />\nAT SARATOGA<br />\nadded features and novelties. It is buildings and marched to the up- at a later date.<br />\nthe aim of the committee to sup- per quadrangle for the review.<br />\nLUNCHEON<br />\nply the best music in the country<br />\nThe band played during the re- The Flag, Banner &amp; Pennant Shop<br />\nTEA<br />\nfor the Senior Ball. Some of the view and was dismissed after the<br />\nDINNER<br />\n(Successors to Sisco Brothers)<br />\norchestras under consideration ceremonies.<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nare: Garber Davis, of Atlanta;<br />\nEmblems, Silk Banners for Schools, 11.30 A. M.<br />\nStationed at Philippines<br />\nSPECIAL PARTIES<br />\nSocieties and Fraternities<br />\nWeidemeyer, of West Virginia;<br />\nuntil<br />\nMajor Hoisington arrived in<br />\nPARK AVE., BALTIMORE, MD. 7.30 P. M.<br />\nPLAZA 6987<br />\nPaul Whiteman, Isham Jones, Baltimore Thursday from •Manila, 302<br />\nVernon 2355<br />\nR. H. Taylor<br />\nPennsylThe Virginians and- the<br />\nvania Serenaders. The committee's one concern is as to the kind<br />\nof financial backing to be received<br />\nfrom the student body.<br />\nLast year the actual ticket returns did not cover the expense.<br />\nThe extra money was- raised by<br />\nhaving \"tag days\" throughout the<br />\nyear preceding the affair. This<br />\nmethod was felt to be somewhat<br />\nunfair, some students who bought<br />\ntags received nothing in return<br />\nbut a feeling that they had done<br />\ntheir duty toward Hopkins. So<br />\nthis year a new plan has been<br />\nadopted.<br />\nStamps on Sale<br /><br />\nStamps somewhat on the order<br />\nof the Government Thrift Stamps<br />\nare to be on sale periodically<br />\nthroughout the year, beginning<br />\nthe first of this week. At the end<br />\nof the year when the student buys<br />\nhis ticket the stamps can be redeemable at their face value. Thus<br />\nit is possible to entirely pay for<br />\na ticket before June Week actually comes. The price of the tickets has not been decided yet, but<br />\nit will certainly be affected by the<br />\nresponse of the students in tile<br />\nstamp selling drive.<br />\n\"In conclusion,\" said Chairman<br />\nNorwood, \"underclassmen must<br />\nunderstand that although the<br />\nSenior Class alone is financially<br />\nresponsible for the project, it is<br />\nfor the benefit of all the undergraduates, and they owe us their<br />\nsupport.\"<br /><br />\nBARNSTORMERS ADOPT MUSIC FOR PRODUCTION<br />\nContinued from page 1<br /><br />\nWednesday at 4:15 in the Studio,<br />\nat which the attendance was larger<br />\nthan had been expected. Besides<br />\nmerely signing up for the production, the candidates were asked a<br />\nnumber of questions regarding previous experience in acting, singing<br />\n'and dancing. The answers revealed<br />\nan unusually encouraging percentage of candidates who had had previous experience in acting.<br />\nWith a view towards obtaining<br />\ninformation about talent for the<br />\ncast, the Club suggested that the<br />\ncandidates work up vaudeville<br />\nstunts of any kind at all, either<br />\nsingly or in groups. These stunts<br />\nare to be given before the Club on<br />\nDecember 3 and 4. Any candidates<br />\nwho are unable to originate their<br />\nown ideas for the acts are requested<br />\nto seek the advice of members of<br />\nthe Club before giving up the idea.<br />\nIt was emphasized at the meeting that candidates for the chorus<br />\nwill not be compelled to do any<br />\nstunts. Those who do, however,<br />\nWill find their chances of obtaining<br />\na berth in the cast greatly increased.<br /><br />\n3<br /><br />\n,C111THES<br />\nOf course you know that<br />\nThe Barn is handling orders<br />\nfor our clothes again this<br />\nyear.<br />\nThe plan worked to<br />\nmutual advantage last season, and we're mighty glad<br />\nto continue the relationship.<br />\nReady-to-wear Suits<br />\n$30 up<br />\nReady-to-wear O'Coats . $35 up<br /><br />\n211-213 E. Baltimore St.<br /><br />\nWhat Engineering<br />\nOwes to the Imagination<br />\nFrom An Argument Over<br />\nWatches Came KDKA<br />\nin the days when wireBACK<br />\nless was just beginning to<br /><br />\nsummoned to the office of Harry Phillips<br />\nDavis, Vice President of the company.<br /><br />\nspread, Frank Conrad (now<br />\nAssistant Chief Engineer of the<br />\nWestinghouse Electric &amp; Manufacturing Company)and another<br />\nofficial, happened to compare<br />\nwatches, to see if it was time to<br />\ngo back to work. Their watches<br />\ndiffered.<br /><br />\n\"Frank,\" said Mr. Davis, \"I'm going to<br />\nclose your radio station.\" His attention had<br />\nbeen attracted the night before to a simple<br />\nnote in a full-page advertisement, which read,<br />\n\"Mr. Conrad will send out phonograph music<br />\nthis evening.\"<br /><br />\nUnable to convince his friend<br />\nthat his watch was right, Mr.<br />\nConrad suddenly remembered<br />\nthat the naval station at Arlington, Va., had just inaugurated<br />\na system for sending out daily<br />\ntime signals by radio. Just the thing to prove<br />\nhis point!<br /><br />\nYou know the rest. In November, 1920,<br />\n\"KDKA\" was formally opened to send out<br />\nelection _returns. It had received the first<br />\nlicense issued by Uncle Sam. Today over 500<br />\nbroadcasting stations entertain and educate<br />\nmillions of people each night, a wonderful<br />\nresult from so insignificant an argument as<br />\none oyer -watches.<br /><br />\nSo he built a simple set of receiving apparatus,<br />\nerected an aerial, and—you can imagine what<br />\nhappened! He was badly bitten by the radio bug.<br />\nAfter proving to his satisfaction the accuracy of his<br />\nwatch, he started experimenting with the transmission of music by radio, with good success.<br />\nHe began sending out phonograph music from<br />\nhis home, and attracted the attention of some of<br />\nthe big department stores, that had installed radio<br />\ndepartments. They in turn, started advertising<br />\nMr. Conrad's \"musical evenings.\"<br />\nThen, one day, upon arriving at his desk, he was<br /><br />\nBroadcasting Studio at Station KDKA, Westinghouse Electric Jo<br /><br />\nManufacturing Co. East Pittsburgh, Pa.<br /><br />\nWestinghouse<br />\nACHIEVEMENT<br /><br />\nOPPORTUNITY<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 28, 1923<br /><br />\n4<br /><br />\nIMPORTANT!<br /><br />\nSANFORD'S<br />\nFOUNTAIN PEN INK<br />\nWill Improve the Action<br />\nof Any<br />\nFountain<br />\nI<br />\nPen<br />\n•<br />\n1- \"juWiela`<br />\n14<br /><br />\nTickets for Maryland game must be bought in advance.<br />\nAbsolutely no Student Tickets will be sold at the gate.<br />\nGAME<br />\nHOPKINS-MARYLAND<br />\nSTADIUM TOMORROW<br />\nContinued from page 1<br /><br />\nAT<br /><br />\nAND<br />\nBLACK<br />\nBLUE JAY<br />\nADOPTS CONSERVATIVE<br />\nPOLICY<br />\nthe J. H. U. squad was tested in<br />\nEditor-in-Chief Dunning anthe game against Cornell and what nounced at a meeting of the Black<br />\nfew imperfections were observed and Blue Jay staff held on Tues11111<br />\nALL<br />\nin that melee have since been cor- day, that the next issue of the<br />\nCOLORS<br />\nrected.<br />\nBlack and Blue Jay will be very<br />\nfOUYARIPENINK<br />\nFL.50:ING<br />\nEASY<br />\nBoth Teams Had Brilliant Season<br />\nBLACK<br />\nO one ever<br />\nALL<br />\nBLUE<br />\nconservative, both in cuts and copy.<br />\ncto,4 00:,'D<br />\nTomorrow's contest will mark<br />\nSIZES<br />\nA number of criticisms have been<br />\ngets tired of<br />\n•<br />\nthe close of each team's most bril- filed with Dunning and it is his<br />\ni! I II<br />\nMelachrinos—<br />\nliant season in many years. The<br />\n\"The Ink That Made<br />\nearnest desire to comply with stuMaryland machine has played<br />\ntheir unfailing<br />\ndent sentiment and demand.<br />\nThe Fountain Pen Possible\" good<br />\nfootball since it defeated<br />\nquality is a conNominations were made at the<br />\nPennsylvania in the first game.<br />\nmeeting for the election of a new<br />\nstantsatisfaction.<br />\nThe record of the Hopkins team<br />\nart editor of the Jay. The names<br />\nis an enviable one, the Homewood<br />\nof Ralph Wales and Alan Gump<br />\ngridders having lost only to<br />\nwere put up for the nomination and<br />\nPrinceton and Cornell and then in<br />\nwill be voted on at a meeting of the<br />\nORIGINAL<br />\nhard-fought contests. The fact<br />\nwhole staff to be held Tuesday,<br />\nthat only six points have been<br />\nThe position of art editor is one<br />\nscored against the Black and Blue<br />\nof large responsibility—entailing<br />\non Homewood field speaks well<br />\nnot only taste and judgment in sefor the defense of the local stars,<br />\nLimited<br />\n\"The One Cigarette Sold the World Over\"<br />\nlection of cuts used for the magaand the 153 points scored by Hopzine, but also quality in the editor's<br />\nCaptain<br />\nBARN CAFETERIA kins is indicative that can<br />\nindividual work.<br />\nadd<br />\nBonner and teammates<br />\nGeorge B. Hess, '25, was elected<br />\ncounts for their colors.<br />\nCirculation Manager of the Black<br />\nCoach Van Orman's charges are and Blue Jay at a meeting of the<br />\n1:1EIROggEt117gENEEtE11=11:11E1E1E.ENCIEM1=121<br />\noing on the field tomorrow to Business Staff. He takes the place<br />\nwin. This game is the contest for of W. Gardner Packard, recently<br />\nwhich they have been waiting'and resigned. W. Bates Draper, '26,<br />\nthe 'Maryland machine is going to was elected to the Business Staff.<br />\nmeet a bunch of the hardest batEarle A. Nielson was appointed<br />\ntlers that they have met this fall. to the Art Staff by virtue of exHO OM 011110<br />\ncellent and continuous work. He<br />\nWASHINGTON UNIVERSI\"The King of Lubricants\" GEORGE<br />\nhas shown exceptional. talent in the<br />\nTY FALLS BEFORE DASHING<br />\nATTACK OF HOPKINS<br />\nexecution of a number of sketches<br />\nContinued from page 1<br />\nSHERWOOD BROTHERS, INC.<br />\nprinted lately in the Jay and gives<br />\nonly score. This promise- of -delieloping into a firsttbeir<br />\nfor<br />\nover,<br />\nNAIRg NNEIMEMENENEREICENECIEEKEI<br />\nbrought about a stiffening of the class illustrator.<br />\nBlack and Blue squad, resulting in<br />\nThe next issue of the Jay will<br />\nNECKWEAR a touchdown gained by consistent<br />\nSHIRTS<br />\nmake to appearance about Decemline plunging.<br />\nber 15 and all copy will be due the<br />\nThird Quarter Scoreless<br />\nMonday after Thanksgiving. This<br />\n421 N. HOWARD ST.<br />\nand individuality is offered here at prices that are not<br />\nThe Hopkins team, which held issue will end the official competiand cannot be underquoted by any house at any time.<br />\nGLOVES Cornell without scoring during the tion between Freshmen candidates,<br />\nHOSIERY<br />\nBesides the reputation of an old-established firm<br />\nthird period of their game at Ithaca but all candidates who do not make<br />\nof each sale with a guarantee.<br />\nis<br />\nback<br />\nfate<br />\nsame<br />\nthe<br />\nsuffered<br />\nten days ago<br />\nthe staff at the first election are<br />\nWashGeorge<br />\non Saturday when<br />\nurged to continue to work.<br />\nington's eleven checked their rapid<br />\nmarch to victory for fifteen minALL ROADS LEAD TO<br />\nDRAPERIES<br />\nDECORATIONS<br />\nFURNITURE<br />\nSTADIUM<br />\nutes of play. The visitors were not<br />\n343 NORTH CHARLES STREET<br />\nable to hold Coach Van Orman's<br />\nConspicuous orange aid black<br />\nMEN'S SHOES<br />\nraring athletes longer than that, placards will guide football enOf the Better Class<br />\nhowever, as the home team settled thusiasts to the stadium tomordown to football in the last period row to witness the state title tilt<br />\nURNER BROTHERS<br />\nand tallied 26 more points. Even between the University of Mary11 1 E. BALTIMORE STREET<br />\nthe second and third String players land and Johns Hopkins. Many<br />\nBaltimore<br />\nwhich the Hopkins mentor sent in students have already posted the<br />\nduring this quarter were able to conspicuous arrows along the<br />\nAt the Washington Monument<br />\nscore against their weakened op- principal automobile routes leading out of the city so that attenponents.<br />\nOscar Thomas Olson, D.D.<br />\ntion to the great football contest<br />\nMinister<br />\nSIGMA CHI BETA HOLDS PUBLIC will be attracted far and wide.<br />\nHALL<br />\nINITIATION AT HARVEST<br />\nThis advertising enterprise is<br />\nHopkins Students Are Invited to<br />\nContinued from page 1<br />\nunder the direction of the athThis Their Church Home<br />\npart<br />\nMake<br />\nactive<br />\nties. It will take an<br />\nletic office.<br />\nin the June Week activities.<br />\nThe purpose and program of this<br />\nThe work of Sigma Chi Beta is<br />\nFIVE MEN PLEDGED TO<br />\nwill appeal to you. Look in<br />\nChurch<br />\nSCABBARD AND BLADE<br />\nto a large extent supplementary to<br />\nafternoon -At Home\"<br />\nthe<br />\nSunday<br />\non<br />\nthat of the Interfraternity Board. Scabbard and Blade pledged its<br />\nseven.<br />\nto<br />\nfive<br />\nfrom<br />\nIts fundamental purpose is to pro- full quota of men at the review<br />\nmote better understanding and staged Thursdays in honor of<br />\nSunday morning worship at I I o'clock.<br />\nmore cordial relations between the Major Hoisington, the new comSunday evening service at 8 o'clock.<br />\nfiraternities on the campus and in- mandant. President J. E .Mount,<br />\nMusic by vested chorus—choir of soloists.<br />\ncidentally to promote Hopkins in Captain Co. I, Second Regiment,<br />\nyear<br />\neach<br />\nin<br />\ntakes<br />\nthe<br />\nIt<br />\nway.<br />\nand<br />\nconferred<br />\nBlade,<br />\nScabbard<br />\nevery<br />\nNot naturally—but it's getting<br />\na group of socially congenial men red, white and blue ribbon on the<br />\nALL SEATS FREE<br />\nhigher. The first line of hair is<br />\n\"At the heart of the City\"<br />\nin retreat. Bring up the \"Vasin<br />\nand<br />\ncampus<br />\nthe<br />\non<br />\nfew<br />\ncongrata<br />\nwords<br />\nadding<br />\nprominent<br />\nmen,<br />\nTonic!<br />\nHair<br />\neline\"<br />\nAnd how do you think the collar<br />\nulating them on the honor and refraternity life.<br />\nadvertisement men got that way?<br />\nVaseline\"Hair Tonic, of course.<br />\nfalling on their shoulsponsibility<br />\nelecspring<br />\nthe<br />\nof<br />\n,<br />\nthe<br />\ntime<br />\nAt<br />\nIt will lay your rebellious curls in<br />\nthe same sleek and shiny manner.<br />\nders.<br />\nstudent<br />\nentire<br />\nthe<br />\nby<br />\nvote<br />\na<br />\ntions<br />\n\"Vaseline\" Hair Tonic will improve<br />\nthe condition of your hair as well<br />\nThe following men were recipibody is taken to determine the<br />\nas its appearance.<br />\nof the high honor in the mil- DRIVE IT YOURSELF!<br />\nents<br />\nAt all drug stores and student barmost popular man on the campus..<br />\nber shops.<br />\nitary<br />\ncircle of the University: LawHis name is then placed upon the<br />\nALL NEW,CLEAN CARS<br />\nR. Kent, Gordon Post, Thos.<br />\nrason<br />\nSigma Chi Beta award which<br />\nHUPS, 18c PER MILE<br />\nhangs in the Trophy Room of the Jenifer, Robert Ohrenshial, Robert FORDS, 12c PER MILE—DODGES OR<br />\nMILES OR MORE<br />\n50<br />\nFOR<br />\nSPECIAL<br />\nRATES<br />\nREDUCED<br />\nBarn. This is a plastic reproduc- Peyton.<br />\nThe date of the invitation into<br />\ntion of the badge of the society, a<br />\nskull superimposed upon two the order has not yet been decided<br />\nVERNON 4049<br />\n1725 N. CHARLES ST.<br />\nChesebrough Mfg.Coil crossed bones with the Greek let- but will be held in the near future<br />\n(consolidated)<br />\nONE BLOCK SOUTH OF NORTH AVE.<br />\nters E X B across the forehead. if precedent is upheld.<br /><br />\nN<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br /><br />\ntE111.-7<br /><br />\nLeFranc &amp; Ault<br /><br />\nMELACHRINO<br /><br />\nBaltimore's Great<br />\nMen's Store<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nURNER'S<br /><br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br /><br />\nhigh<br />\nbro*?<br /><br />\nRENT A CAR<br /><br />\nVaseline<br />\nREG. U.S. PAT. OFF.<br /><br />\nHAIR TONIC<br /><br />\n11<br /><br />\nDRIVE IT YOURSELF CO.<br /><br />"}], "field_media_file": [{"target_id": 37797, "display": null, "description": null, "target_type": "file", "target_uuid": "05f317e6-8e63-4d9d-add4-6047527cfce3", "url": "http://digital.library.jhu.edu/system/files/2022-03/13088-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13088, "target_type": "node", "target_uuid": "8e25c5e3-276d-4683-b7ca-0c0b73ace746", "url": "/node/13088"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "d19d7a08-8495-4456-80ff-01bb3e2455e7"}]}