{"mid": [{"value": 37739}], "uuid": [{"value": "a5eba4ad-5d1a-4887-844f-d8cfd6028819"}], "vid": [{"value": 37739}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:38:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12267-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:38:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:38:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "A FRESHMAN<br />\nGIVES HIS<br />\nMEDITATION ON FROSH<br />\nPage 2<br />\n<br />\nVol. XXXV, No. 51<br />\n<br />\nJUNE WEEK<br />\nTICKETS ARE NOW<br />\nON SALE HERE<br />\nPrice, $12.50<br />\n<br />\nTHE JOHNS HOPKINS UNIVERSITY, HOMEWOOD, BALTIMORE, MD., MAY 8, 1931<br />\n<br />\nTWO PROFESSORS<br />\nWILL REPRESENT<br />\nJ. H. U. IN FRANCE<br />\nChinard and Lovejoy Named<br />\nAs Delegates to College<br />\nde France Event<br />\nFRENCH COLLEGE TO<br />\nMARK 4th CENTENARY<br />\n<br />\nSupper Club Group<br />\nTo Hear E. A.Schaal<br />\nEvidence Collected Concerning the<br />\nTrend of Student Opinion in Neighboring Colleges Will Be Topic<br />\n<br />\nEvidence collected by E. A.<br />\nSchaal regarding the trend of student opinion in nearby colleges will<br />\nbe presented by him at the final<br />\nmeeting of the University Supper<br />\nClub next Tuesday at 6.30 P. M.<br />\nMr. Schaal will speak in place<br />\nof Rheinhold Niebuhr, who was to<br />\nspeak, but will be unable to do so.<br />\n<br />\nMAGOTHY RESORT HEANEY, FRESHMAN,<br />\nTO BE SCENE OF WINS THOM CUP Q.A. Column<br />\nJUNE WEEK PARTY TEST LAST NIGHT Por The<br />\nMago-Vista Has Been Chos- Judges Declare Him Winner President<br />\nIn Extemporaneous Speaken As Site Of Hopkins<br />\nBeach Party<br />\n<br />\nPrice 5 Cents<br />\n<br />\n7 J. H. U. STUDENTS<br />\nGET ADMITTANCE<br />\nTO MED. COLLEGE<br />\n<br />\nContest Held In Levering<br />\nBy Dr. Joseph S. Ames<br />\nBALTIMORE, 100 YEARS<br />\nHamburger, Myers, MichelFROM<br />\nNOW,<br />\nTOPIC<br />\nWILL HOLD DANCE<br />\nIN RESPONSE to a suggestion son, Ferrigan, Hanselman<br />\nIN THE EVENING Yudkin Victorious In De by one of the editors to express my<br />\nLarkin, Sadusk Students<br />\nTocqueville Test; Alpert opinion concerning so called<br />\nThose Who Like Their Ro- Adjudged Victor In Adam \"Freshman Regulations\", I wish to QUOTA CONSIDERED<br />\nUNUSUALLY LIMITED<br />\nmance Realistic Will Go<br />\nNorman Heaney, a freshman, say positively that, in my judgment,<br />\ntheir<br />\neffect<br />\nis<br />\naltogether<br />\nbad.<br />\nPart<br />\nFor Sail<br />\nwas declared the winner of the anLast Year 15 or 16 Were Renual Thom Cup contest, held last of the system is to put the responsibility<br />\nfor<br />\nthe<br />\nenforcement<br />\nceived; 24 Applied This<br />\nof such<br />\nMago-Vista, overlooking the Ma- night in Levering Hall before a<br />\nBrown University Professor To<br />\nregulations<br />\nupon<br />\nan<br />\nupper class,<br />\nYear, 32 Last<br />\nSpeak Today At Johns Hopkins gothy River will be the scene of the large audience. The topic for this<br />\n<br />\nKRAUS WILL ADDRESS<br />\nAwarded,<br />\nCHEMISTRY STUDENTS<br />\n<br />\nNo Degrees Are<br />\nNo Regular Courses Given<br />\nAt Paris U.<br />\n<br />\nevent was \"Baltimore—One Hun- generally the second year class or<br />\nOut of 24 applications made by<br />\ndred Years from Now.\" In the De \"sophomores\" as they are usually<br />\ncalled,<br />\nfor<br />\nsuch<br />\nenforcement<br />\nobHomewood<br />\nSERIES ENDS MAY 15<br />\nstudents for entrance<br />\nTocqueville lecture contest, held at<br />\nthe assembly in Latrobe Hall yes- viously cannot be the duty of the into the Johns Hopkins Medical<br />\nA. R. L. Dame Lectureship<br />\nterday morning, Harold Yudkin Student Council. This has the ef- School, only 7 were yesterday<br />\nacGroup Culminates Here With<br />\nwas chosen the winner; in the fect of encouraging any bully there<br />\ncepted<br />\nby<br />\nthe<br />\nBoard<br />\nof<br />\nAdmission<br />\nW. D. Bancroft Speech<br />\nAdams declamation test, Leo Al- may be in the class; and, in fact,<br />\nthe whole process has a bad influ- of which Dean Allan Chesney is<br />\npert, a sophomore.<br />\nDr. Charles A. Kraus, of Brown<br />\nence upon everyone in the class. the chairman.<br />\n\"The question of progress is the<br />\nUniversity, today will address stuEach student must know that the<br />\nThe seven students who will enmost logical thing to which to turn<br />\nsystem<br />\nis unfair and unmanly, it ter the<br />\ndents in the department of chemfreshman class next fall are:<br />\nin considering what Baltimore will<br />\nmay even be described as cowardly.<br />\nistry at the Johns Hopkins Univerbe one hundred years from today,\"<br />\nLouis P. Hamburger, Jr.<br />\nsity in the next to the final lecture<br />\nsaid Heaney in his extemporaneElliott<br />\nMichelson<br />\nSO FAR as the \"Freshmen\"<br />\nous address in the Thom Cup comin a series presented under the A.<br />\nJoseph Francis Sadusk<br />\nthemselves are concerned, the effect<br />\npetition. \"I would like to see the<br />\nR. L. Dohme Lectureship.<br />\nis also bad, although not as much<br />\nRussel C. Hanselman<br />\ndifferent modes of travel a century<br />\nSince 1924, Dr. Kraus has been<br />\nso as upon the upper classmen. A<br />\nJohns Alfred Myers<br />\nfrom now. Education, too, I beprofessor of chemistry and director<br />\nHave Long Pier<br />\nstudent comes to college, as a rule,<br />\nJohn Charles Larkin<br />\nBathing is said to be excellent lieve, will have taken tremendous with a real desire to take advanof research in that science at the<br />\nstrides forward.<br />\nJoseph<br />\nP. Ferrigan<br />\nand the beach sloping and sandy—<br />\nBrown University.<br />\ntage of all that the college offers;<br />\nCity Manager May Head City<br />\nConsidered Small Quota<br />\nstretching a good distance along the<br />\nWas Director At Clark<br />\n\"Republicans may still be com- he should become as soon as posThis<br />\nis considered to be an exPrevious to that, from 1914 to river. A pier extending out over bating depressions, yet we may ex- sible a member of the college, with<br />\nParis to Entertain<br />\nceptionally<br />\nsmall quota since that of<br />\n1924, he was the director of the the water affords diving apparatus pect, a century from now, a socia- the same privileges and opportuniThe city of Paris will sponsor a<br />\nchemistry laboratories at the Clark while the river is sufficiently deep listic tendency in politics. A city ties as every other student. Any Previous years has included a largreception to the delegates on the University. For two years he main- to dispense with the worry that any<br />\nmanager may head the city of Bal- act or custom which delays his ab- er number of students. Admission<br />\nsecond day of the three-day centen- tained the position of assistant pro- academic skulls will be cracked.<br />\ntimore. Of course, that apparently sorption into the whole student was granted to 15 or 16 Hopkins<br />\nThere are also floating rafts a is inevitable, if the word of Dr. body simply prolongs and hampers<br />\nfessor at the Massachusetts Instiary event.<br />\nstudents last year. Application was<br />\nConcluding the affair will be a tute of Technology. At the Uni- little way off shore.<br />\nBroadus Mitchell is to be taken into his education. It is most unfair. made by 32.<br />\nThe female members of the serious consideration.\"<br />\n\"College spirit\" is based upon pride<br />\nsight-seeing tour of Paris and other versity of California during the<br />\nEntrance into the first-year class<br />\nyears 1901 to 1904, Dr. Kraus was party have been charged with the<br />\nOther contestants in the feature in one's college and upon the pleascities of interest.<br />\nof the Medical School is limited to<br />\ntask of preparing a dinner—that<br />\nan instructor in physics.<br />\nof the literary contests held on the ure which a student has in his asIn 1531 the King of France,<br />\nHaving received his B.S. degree their escorts might, by some chance Homewood campus<br />\n75<br />\nproperly qualified students comthroughout sociations. It should be the purFrancis I, established the College at the University of Kansas in or other, care to eat. The said fepose<br />\nof<br />\nevery<br />\nstudent<br />\ning<br />\nin<br />\nthe<br />\nfrom colleges throughout the<br />\ncollege<br />\nyesterday were M. Kronsberg, T.<br />\nde France, which next month marks 1898, the chemist entered upon male members will attempt to per- C. Crane,<br />\nto<br />\nhelp<br />\nand<br />\nnot<br />\nhinder.<br />\ncountry.<br />\nA. Seidler, E. R. Wasits four hundredth year of exist- post-graduate work at the same in- suade the said escorts to eat the serman,<br />\nE. M. Lockard, G. HerPrivilege Sought-After<br />\nsaid dinner in a pavillion built over<br />\nence. It is the only institution in stitution for nearly two years.<br />\nWHY SHOULD any student be<br />\nman, E. Bussey, R. F. Powell, S.<br />\nAdmission to the Johns Hopkins<br />\nthe water.<br />\nFrance, explained Dr. Chinard yesGot Physics Fellowship<br />\nobliged to wear a certain costume? Medical School is a much<br />\nDorf man.<br />\nsoughtCoffee, Ice-Cream Free<br />\nAt the Johns Hopkins University<br />\nterday, which greatly differs from<br />\nWhy should he be told that he must after privilege. Numerous<br />\nMust<br />\nConsider<br />\nPresent<br />\ncream<br />\nAlthough<br />\ncoffee<br />\nand<br />\nice<br />\napplicathe French educational system. No he was a fellowship holder in<br />\nwill be served without further as- -That it is vital to consider what do some things and not do others? tions are received from undergradregular courses are given at the physics, 1899-1900. During 1900sessment, the June Week commit- Baltimore is today before any pre- Who has any right to regulate the uates throughout the country.<br />\nCollege de France, except for sev- 01, Dr. Kraus was a research feltee has refused to extend its gen- diction may be made as to the fu- life and conduct of his fellows?<br />\nHamburger, son of a prominent<br />\neral public lectures through the low at Kansas. In 1908 he received<br />\nerosity to sandwiches and candy. ture was pointed out by Kronsberg \"Regtilations\" of all kinds are worse Baltimore physician, has had a<br />\nyear.<br />\nthe doctor of philosophy degree at<br />\nThese will be on hand for non- who extolled the export trade of than objectionable; they are dan- rather unusual career after leaving<br />\nNo Degrees Awarded<br />\nthe M. I. T.<br />\nprofiteering prices for those \"stu- this city and declared that \"Balti- gerous. I wonder often at the type Hopkins without his degree in<br />\nNo degrees are given at the inDr. Kraus was, in 1908, consultmore will thrive because it has lead- of a mind a man must have who<br />\ndents whose girl-friends claim im1926.<br />\nstitution. Anyone can attend the<br />\ning chemist for the United States<br />\ners<br />\nwho have foresight.\"<br />\nthinks he is wise enough to dictate<br />\nReturned To Hopkins<br />\nmunity from \"packing\" lunch on<br />\npublic lectures and work in the Bureau of Mines,<br />\nduring 1918-19,<br />\nAfter spending several years<br />\nCrane assured the audience that to others how they should conduct<br />\nthe ground that they are free ecolaboratories without paying any in the Chemical Warfare<br />\nService.<br />\nthe outskirts of the city will be ex- themselves. It presupposes unlim- away from the University he renomic agents.<br />\nregistration fees.<br />\nSince 1922 he has been active in<br />\ntended<br />\nand pictured Baltimore as ited conceit and other most unpleas- turned to Hopkins to complete his<br />\nThere are adequately furnished<br />\nProfessors, to be appointed to the Fixed Nitrogen Research<br />\nLabthe<br />\ngreatest air terminus. It will be ant qualities. I hope I shall never work in biology under the New<br />\nfaculty, need have no academic de- oratory, conducted by the govern- bath-houses at Mago-Vista to accommodate the party in dressing the largest city of the Atlantic sea- have to associate them with the Plan. He will receive his degree in<br />\ngrees, yet it was explained ,they ment.<br />\ncollege students of Johns Hopkins. June.<br />\n(Continued on page 3, col. 2)<br />\nfor the evening's dance. The dance<br />\nmust be eminent in the field of<br />\nAmong the six major scientific<br />\nHamburger entered the Johns<br />\nstudy in which he is to lead the re- organizations to which he belongs will be held in the Ballroom-ByHopkins<br />\nin 1924, it was learned.<br />\n(Continued<br />\non page 4, col. 1)<br />\nsearch workers at the college. Ir- are the Washington Academy of<br />\nThe erratic course of study of<br />\nrespective of their degrees, or the Sciences and the American ChemiMichelson has frequently been a<br />\nuniversities from which they were<br />\ncal Society.<br />\nsource of amusement to his friends.<br />\ngraduated, men are elected to the<br />\nA member of Phi Lambda Upprofessorships at the College de silon and<br />\nDr. Charles R. Lanman, One Of Gilman's \"First Twenty Setting forth to undertake studies<br />\nSigma Xi, Dr. Kraus is<br />\nthat would qualify him for enPrance.<br />\nFellows\" Reminiscences In Letter To<br />\nalso a fellow in the American Hopkins Singers Will Participate<br />\ntrance<br />\nto a medical school, he deChairs Not Permanent<br />\nAcademy<br />\nof<br />\nArts<br />\nSciences<br />\nand<br />\nand<br />\nJohns<br />\nHopkins<br />\nLibrarian<br />\ncided<br />\nafter<br />\nhis first year at Homemaintained<br />\nThe chairs<br />\nat the inIn Contest Among Colleges<br />\nin<br />\nthe<br />\nNational<br />\nAcademy<br />\nof<br />\nSciwood<br />\nchange<br />\nto<br />\nover to the Arts<br />\nstitution are not permanent, said<br />\nOf Maryland<br />\nOne of the oldest living former<br />\nWilliam Dwight Whitney and<br />\nences.<br />\nSciences<br />\nand<br />\ncurriculum.<br />\nbr. Chinard. No replacement of<br />\ninstructors of the Johns Hopkins Francis James Child were his sponMade Many inventions<br />\nAgain Studied Medicine<br />\nArrangements have been made University,<br />\nchair, vacated by the death of the<br />\nDr. Charles R. Lan- sors, he said, when President Eliot<br />\nTwo more years, however, found<br />\nchemist's<br />\nThe<br />\ninventions<br />\nhave<br />\nGlee<br />\nClub<br />\nJ.<br />\nhave<br />\nthe<br />\nU.<br />\nH.<br />\nto<br />\nProfessor in that particular subject,<br />\nman, now professor of Sanskrit at considered the matter of calling a him again pursuing premedical<br />\nIs made. However, efforts are made been many relating to electrical ap- sing several Hopkins songs at the the Harvard University, and one man to the Cambridge<br />\ninstitution courses until his graduation last<br />\nto substitute a chair by a new paratus, glasses, and chemical proc- Century Theatre's 8.30 .perform- of Daniel Coit Gilman's \"First as professor of Sanskrit.<br />\nJune. This year he did advanced<br />\nesses.<br />\nance tonight, which has been termed Twenty Fellows\",<br />\ncourse.<br />\nhas \"rowed about<br />\nFurnivall Was Oarsman<br />\nwork in biology in order to obtain<br />\nLectures in the Dohme series for by the theatre authorities as \"Hop\"A great deal of leisure for re\"By the way\", Dr. Lanman sufficient credit for entrance<br />\nten thousand miles on the Charles<br />\ninto<br />\nculminate<br />\nnext<br />\nacademic<br />\nthis<br />\nyear<br />\nkins Night\", it was revealed by River\" and<br />\nsearch work is given\", said Dr.<br />\nproposes to keep it up wrote, \"you know that Child's dear the medical school.<br />\nweek<br />\nBanD.<br />\nwhen<br />\nWilder<br />\nDr.<br />\nBruce Peake, president of the Mu- as long as<br />\nChinard, who added that many<br />\nhe can, and that despite friend, Frederick James Furnivall,<br />\nHe is the son of Dr. R. A. Michgreat scientists that the world has croft, of Cornell University, will sical Club recently.<br />\nthe fact he is now almost 81 years was an oarsman and kept it up into elson, a professor in the Hopkins<br />\nFeaturing what is known as old,<br />\nknown have come from the French appear at Homewood.<br />\nhe wrote in a letter to Dr. John the ninth decade of life. Since the medical school.<br />\nGomberg,<br />\nDr.<br />\nMoses<br />\nof<br />\nUnithe<br />\n\"Collegiate<br />\nWeek\", the Century C. French,<br />\ninstitution.<br />\nLibrarian at Home- dam was built here, I have rowed<br />\nSadusk entered Hopkins in<br />\nversity of Michigan and president has invited several Maryland colNet All Invited<br />\nabout ten thousand miles on the 1929 from Loyola College. Since<br />\nwood, last week.<br />\nNot all American universities of the American Chemical Society leges to participate in a contest to<br />\n\"As you hint\", he wrote, \"the Charles River and propose to keep then, he has been engaging in rehave been invited to send represen- lectured at the Hopkins on April 24. secure the \"Mammoth Magaphone\"<br />\nuniversity grows so fast now-a- it up as long as I can. I am almost search in Quantitative Analysis<br />\ntatives to the centenary celebraoffered to the college making the days<br />\nthat the problem of personal 81\".<br />\nunder Dr. William M. Thornton.<br />\ntion of the college, it was said. The<br />\nHomeliest Contest<br />\nbest \"showing\" on the night as- acquaintance<br />\nIn April, Dr. French received a He will publish a paper shortly<br />\nis becoming almost an<br />\nin<br />\nCollege de France officials have seOhio State University, according signed it. A particularly appropriletter from Dr. Lanman in which the American Journal<br />\nlected only a choice group of inter- to the Lehigh Brown and White is ate stage show, \"Let's Go Collegi- insoluble one! Alas!<br />\nof Science<br />\nWhitney and Child His Sponsors<br />\nthe Harvard man commented on on the use of Cromousulphate<br />\nas<br />\nnationally noted research institu- conducting a contest to uncover ate\", is to be presented. \"Tarnish\"It's fifty-one years ago this the requests which have been made<br />\na reducing agent in the volumetric<br />\ntions from which to request dele- the homeliest mechanical engineer- ed Lady\", starring Tallulah Bank- month that I began work here<br />\nfor \"some photographs of my determination of iron.<br />\ngates to the event in Paris.ing student on its campus.<br />\nhead, will be shown on the screen. (Harvard) as a professor\".<br />\nDr. Gilbert Chinard, professor<br />\nof French literature, and Dr. Arthur 0. Lovejoy, professor of philosophy, both of the John Hopkins<br />\nUniversity, were named by the<br />\npresident of the Hopkins to represent the University at the fourth<br />\ncentenary celebration of the founding of the College de France, at<br />\nParis on June 18.<br />\n• At the initial meeting to be held<br />\nin connection with the celebration,<br />\nthe President of the French Republic will welcome the delegates from<br />\nthe various institutions throughout<br />\nthe world. Speeches are to be delivered by many of these delegates,<br />\nit was announced.<br />\n<br />\nUnder Lectureship<br />\n<br />\ninitial festivities of June Week. It<br />\nis just above Gibson Island and has<br />\nbeen chosen as the locale of the<br />\nbeach party. Since the beach is<br />\nabout 18 miles from Baltimore,<br />\nbuses will be provided for those<br />\ncouples who are not able to go out<br />\nby automobile.<br />\nThe party will leave the campus<br />\nabout 2 o'clock on the afternoon of<br />\nWednesday, June 3rd, and will<br />\nspend the afternoon, sponsors assert, either bathing or building<br />\nsand-castles. Those pleasure-seekers who are inclined to be restless,<br />\nit is said, will be furnished with<br />\nseaworthy canoes and row boats.<br />\n<br />\nGilman's Colleague Has Rowed<br />\nGLEE CLUB INCLUDED 'About 10,000 Miles' On River<br />\n<br />\nIN THEATRE PROGRAM<br />\n<br />\n(Continued on Page 3, col. 3)<br />\n<br />\n(Continued on page 2, col. 2)<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MAY 8, 1931<br />\n<br />\n2<br />\n<br />\nDirecting -minds are deemed more important than buildings and endowments, although equipment is necessary and financial support must be duly<br />\n--By A Freshman<br />\nsought.\"<br />\nFounded 1897<br />\nIn closing, Mr. Shaw points out that<br />\nabout the marking system—its merUniversity from its beginning has<br />\nthe<br />\n$2.00<br />\nSubscription<br />\nadobjects—the<br />\nhad in view two main<br />\nits and its fauls; about the attemptINGED. time glides on invancement of learning through insale of the Homewood tract of<br />\ned<br />\nEntered as second-class matter Decem- vestigations conducted by its teachers<br />\nus;<br />\ndeceives<br />\nand<br />\nsensibly,<br />\nBaltiin<br />\nPostoffice<br />\nthe<br />\nat<br />\nber 3, 1909,<br />\nland; about the honor system, about<br />\nmore, Md., under the Act of Congress No- and its properly qualified students and<br />\nand there is nothing more<br />\nvember 3, 1879.<br />\nFreshman regulations, about the<br />\nthe communication of learning<br />\nfleeting than—a year. In other athletic problem and football, and,<br />\nthrough carefuly planned courses of<br />\nfreshman's<br />\nPublished semi-weekly from October to instruction. He further points out that words, the Hopkins<br />\nmost recently, about the assemblies.<br />\nJune by the Students of Johns Hopkins<br />\ngone in a<br />\nhas<br />\ncollege<br />\nat<br />\nyear<br />\nis<br />\nthe<br />\nfirst<br />\nInstitution<br />\nHopkins<br />\nnew<br />\nthis<br />\nUniversity.<br />\nBut our apparently vigorous<br />\nembodiment of both of these sought- flash. And what a year it has been.<br />\ngot us into a lot of trouthinking<br />\nafter views and shows that the facili- \"Things\" have happened so fast,<br />\nBusiness communications should be adthe first time, I think, we<br />\nFor<br />\nble.<br />\ndressed to the Business Manager, Johns ties that it provides and its methods<br />\nsuccession that<br />\nHopkins University. All articles should of administration are intended both and in such quick<br />\nbegin\" the process of<br />\nto<br />\n\"began<br />\nbe sent to the Managing Editor; other<br />\ncommunications to the Editor-in-Chief.<br />\nfor the encouragement of researth, the mind has had little time to grasp changing from the high school boy<br />\nand for the discipline and guidance of the meaning of them.<br />\nto the college man.<br />\nBelmont 8778 those whose chief concern is the acTelephone<br />\nWay last October—it seems just<br />\nquisition of knowledge.<br />\nIII<br />\na fortnight ago—we went through<br />\nAlbert Shaw has had many close<br />\ntrying serious—yet amusing,<br />\nE TOOK it upon ourselves<br />\nconnections with the Johns Hopkins the<br />\nEDITORIAL DEPARTMENT<br />\nbeof<br />\ntask<br />\ng<br />\nembarrassin<br />\noften<br />\nand<br />\nto try to solve these seriUniversity, being at one time a student<br />\nEditor-in-Chief<br />\nexnew<br />\na<br />\nwith<br />\nacquainted<br />\nHe<br />\nwas<br />\ncoming<br />\nin this institution of learning.<br />\nour problems right on the<br />\nRowland McD. Ness, '32<br />\nin residence in 1882-3-4 and received perience in life. And our progress, spot. Of course, in the eyes of the<br />\nManaging Editor<br />\nthe degree of Ph.D. in History in 1884. indeed, was very encouraging at<br />\npublic, faculty, and upper classmen<br />\nSylvan Lebow, '32<br />\nAt a later date, namely 1891-2, he<br />\nweeks be- we did a number of glaringly dawntwo<br />\nhardly<br />\nwas<br />\nIt<br />\nfirst.<br />\na course of lectures at the Uniourselves fool things. I am inclined to agree<br />\nAssistant Managing Editors<br />\nversity on \"Municipal and Social fore we had mastered<br />\nHerbert L. Friedberg, '33<br />\nreally with the said groups of people. The<br />\nto<br />\nable<br />\nsufficiently to be<br />\nHyman Levin, '34<br />\nProblems.\"<br />\neffi- fact that we got no results is added<br />\nvery<br />\nand<br />\n\"loaf\" luxuriously,<br />\nAssociate Editors<br />\nefpossible<br />\nciently (with the least<br />\nHarold B. Yudkin, '32<br />\nevidence. We got the idea—maybe<br />\nNathan M. Harris, '32<br />\ntwo<br />\nBy<br />\nfort) in Levering Hall.<br />\nit's a hang-over from the Chartists'<br />\nexplored<br />\nthoroughly<br />\nhad<br />\nwe<br />\nweeks<br />\nmovements in England—that signJunior Editors<br />\nMarion Grove, '33; Sanford SarneY,<br />\n, the mysterious and puzzling pas- ing petitions would make matters<br />\n'34; Jerome Blum, '34; Raymond Dunn, Hamburger, Myers,<br />\nMichelson, sage-ways—with the dead animals, better. It finally got so bad that<br />\n33; Donald Proctor, '33; Jack Greenfield, '33; Samuel M. Doctofsky, '34; Ferrigan, Hanselman, Larkin, and whales, and butterflies all laid<br />\nthe petitions were worthless—I beSadusk, are Named<br />\nNorman Heaney, '34; Mordecai EdelBiologithe<br />\ncoffins—in<br />\nglass<br />\nout<br />\nin<br />\nlieve they were from the beginning. I'<br />\nman, '34; Marlowe Perry, '32; Bernard<br />\n(Continued from page 1, col. 6)<br />\nVerlin, '33.<br />\ncal Laboratories. It took us less It became a habit for some of the<br />\nHe is a member of the varsity than two weeks to find out why<br />\nfreshmen to get out their pens every<br />\nBUSINESS DEPARTMENT<br />\ntrack team.<br />\nRemsen \"smells bad\", and that the Monday morning and sign the<br />\nBusiness Manager<br />\nWorked for Chemistry<br />\nHopkins buildings are as dark and newest and latest petition. We also<br />\nDavid Sykes,'32<br />\nBringing an A. B. degree from dreary on a rainy day as a tobacco<br />\nAdvertising Manager<br />\nmade fools of ourselves, and injured<br />\nOberland College in Ohio, Hansel- barn in Southern Maryland, and<br />\nIsadore C. Gutman, '32<br />\nthe present reputation of the UniCirculation Manager<br />\nman began research work in the that the Memorial room in Gilman<br />\nversity in the public's eye by getEdgar Blumstein, '34<br />\nDepartment of Chemistry in 1931. is a sacred place, and that the liting ourselves suspended, and by<br />\nOffice Manager<br />\nMyers prepared himself for medi- brary is really available for freshacting like hoodlums at an openMaurice R. Chassin, '33<br />\ncal study after spending some time men. We were, after a few weeks,<br />\nforum assembly.<br />\nCharles Ney, '33; Wm. N. Myers, '33; in graduate work in engineering,<br />\njust becoming used to dormitory<br />\nMorton Rome, '33; George Landau, '34;<br />\nBut this is quite unnatural. I<br />\nWilson Rutherford, '31; Abram Burk, while Larkin has been working in life, to dry lectures, to the drinkshall condemn my fellow freshmen<br />\n'34; Victor Frenkil, '34; David Gutman, advanced physics for several years.<br />\ning fountains, to the sergeant's ges- no longer.<br />\n'34; George Baylin, '31; Leonard Harris„ '34; George Lamont, '32.<br />\ntures, to the Y. M. C. A., to the<br />\nIV<br />\nbotanical gardens, to the cinder<br />\nCo.,<br />\nProduced by the R. L. Polk Printing<br />\nroads, to—well, everything that<br />\nHE POINT I am driving at<br />\n1930 Clifton Ave., Baltimore, Md.<br />\nINTERCOLLEGIATE was new, and that seemed very inis easily summarized in a few<br />\nNEWS<br />\nteresting at first. And I must adsentences. We entered this<br />\nmit that there are some things University as school boys. We beA strange case, baffling to legal which we promising young men came acquainted with the material<br />\nauthorities, came to light on and have not been able to accomplish peculiarities of college life in the<br />\naround the campus of the Univer- yet: we haven't been able to keep first half year. Just think, a whole<br />\nsity of Minnesota. One of the stu- up with the bulletin boards; we half year to get acquainted. FiThe Institute of Law<br />\nhaven't learned to sing the—oh, yes, nally, just after the exams, the allTwo articles of great interest to all dents was arrested for selling penUniversity Ode. But on the important process of becoming colthe<br />\nHopkins men appear in the current nants at a football game without a<br />\nn by and large (as one lege men—had just started. And<br />\nwhole—take<br />\nThe<br />\nReviews.<br />\nof<br />\nReview<br />\nissue of The<br />\nlicense. The case promised to have<br />\nfirst, \"A Challenge to Capitalism,\" numerous interesting ramifications, professor will say)—we made re- when we started changing, we tried<br />\ntaken from an address delivered by the student pleading his own cause. markable progress those first few<br />\nto overdo it—a natural thing to do<br />\nMr. Daniel Willard, the president of<br />\nunder such circumstances. And as<br />\nThe verdict of \"not guilty\" was weeks.<br />\nthe Board of Trustees, on March 27<br />\na result, we not only did not acbefore the Wharton School of Finance finally submitted, whereupon the<br />\nII<br />\nand Commerce, at the University of go-getting young man turned<br />\ncomplish anything, but we got ourPennsylvania, has been discussed in the around and sold one of the penVERYTHING went on selves hopelessly entangled in the<br />\ncolumns of this paper.<br />\nnants to the recorder.<br />\nsmoothly for a while — we task of solving these unsolvable<br />\nThe second article, \"Research in<br />\n*<br />\n*<br />\n*<br />\nfreshmen were thoroughly problems. But the most important<br />\nLaw and Justice,\" by Albert Shaw, the<br />\neditor of The Review of Reviews, is<br />\nCoach Lattig, up at dear old Le- enjoying our college life with its thing is, in my opinion, that we are<br />\na distinct compliment to Hopkins fame high, changed the lacrosse practice occasionl thrills. But along came not yet college men, although we<br />\nfrom a recognized authority.<br />\nfield from Taylor to Steel Field, the Christmas holidays. The nov- think we are. To interprst the deDr. Shaw states that we \"are carrya student in a world- plorable condition in anothN way:<br />\ning the Hopkins tradition and method because the ground was too hard elty of being<br />\nfamous institution soon wore off it has taken us freshmen a year to<br />\nof research into unexplored fields of at the former.<br />\n* * *<br />\nlaw.\" The editor quotes a tribute<br />\naround the home town. And when get well started in the process of<br />\nby<br />\nLaw<br />\nmade of the new Institute of<br />\nEditorial comment on the above it was time to come back to Balti- becoming college men.<br />\nthe famous Dr. William H. Welch,<br />\nDoes this condition have to exappearing in the Brown and White, more, we were quite tired of \"colone ?f. the \"Four Doctors\":<br />\nfunny part is that, ist? Does every freshman class of<br />\n\"As one actively interested for near- the journal of the babes of Beth- lege life\". The<br />\nto go<br />\nly half a century in the preservation lehem, was to the effect that \"steel\" although we thought we were vet- the years to come have<br />\nthat<br />\nexperiences<br />\nsame<br />\nlearned<br />\nthe<br />\nnot<br />\nthrough<br />\nhad<br />\nwe<br />\nand development of those ideals of is harder than mere \"ground\".<br />\neran collegians,<br />\nis<br />\nThere<br />\nthrough?<br />\nscientific research upon which the<br />\nbeen<br />\nhave<br />\nis.<br />\nreally<br />\nlife<br />\nwe<br />\n* * *<br />\nwhat college<br />\nJohns Hopkins University was<br />\ncollege<br />\nour<br />\nwith<br />\nwrong<br />\nrequired<br />\nsomething<br />\nenergy<br />\nThe Purdue Exponent carries a , Of course, the<br />\nfounded, I welcome the establishment<br />\nexams, and try- system somewhere. Isn't there<br />\nof the Institute of Law. In subject sour note stating that according to for worrying about<br />\nto prematter and methods of investigation Dr. Kotchnig, a Swiss lecturer, ing to keep up the social activities something that can be done<br />\nand<br />\ntime<br />\nof<br />\nloss<br />\na<br />\ndizzy<br />\nvent so great<br />\nthere may be little analogy between drinking is muA more prevalent on a favorable level with the<br />\ninstithe<br />\nof<br />\nthe law and the sciences of nature, inexpense<br />\nus energy at the<br />\namong American than European pace we set at Christmas, left<br />\ncluding biology and medicine. But the<br />\nexams,<br />\ntution—just in making college men<br />\nthe<br />\nafter<br />\nBut<br />\nexhausted.<br />\nproblems presented are of the utmost undergraduate students. The worst<br />\ntime to do out of a group of freshmen?<br />\nhuman interest and importance, and of it is that the sour note in ques- we had the ability and<br />\nyet no<br />\nI, as a freshman, am absolutely<br />\nthinking,<br />\npowerful<br />\nscisome<br />\nsame<br />\nthe<br />\nwith<br />\nmay be approached<br />\ntion is not fully appreciated until<br />\nentific spirit, the same unbiased, objec- the morning after.<br />\nexams were available to relieve the helpless ip trying to think of a soto<br />\ndesire<br />\nsame<br />\ntive mental attitude, the<br />\nlution—I am far too undeveloped<br />\npressure.<br />\n* *<br />\nattain the truth, and the same joy in<br />\ninexperienced<br />\nThen it was when we took a de- mentally, far too<br />\nTraffic violations at Ohio State<br />\nthe search for truth.\"<br />\nmy own<br />\nanswer<br />\nto<br />\ntry<br />\nto<br />\nlife<br />\nwith<br />\nIn discussing its formation and the are judged and punished by a stu- cisive turn in college life. We behumand<br />\nrespectfully<br />\nI<br />\nquestions.<br />\nmanner in which it is going about its dent court. Yes, we mean the Uni- gan thinking about various probthe<br />\nto<br />\nover<br />\nproblem<br />\nthe<br />\nhand<br />\nsays:<br />\nbly<br />\nShaw<br />\nMr.<br />\nwork,<br />\nlems which are confronting the<br />\n.<br />\n• \"In a quiet and unostentatious way versity, not the penitentiary<br />\nsolution.<br />\ntheir<br />\nfor<br />\nintellectuals<br />\nUniversity. We began thinking<br />\n* * *<br />\nthe new Institute of Law of Baltimore<br />\nis in touch with the various agencies<br />\nThe College of France, founded<br />\nCo-Eds At Southwesten<br />\nfor judicial reform and improvement by Francois I, will celebrate its College Man Receives<br />\nthroughout the country. Already it beon June 8.<br />\nVarsity Letter Late Drop Gowns At Dance<br />\ngins to act as a clearing house of in- four hundredth birthday<br />\n* * *<br />\nformation. It can bring the experience<br />\nOhio Wesleyan Class of 1885 Base- Yes, They Attend Affairs Wearing<br />\nof one state to the aid of revision and<br />\nAnother liberal dean has been<br />\nPajamas, Shorts, Veils, and the<br />\nball Players Has Just Received<br />\nLike, Reported<br />\nreform in another.\"<br />\nEfforts<br />\nfor<br />\nLetter<br />\nrumor<br />\nso<br />\nanyway,<br />\nor,<br />\ndiscovered—<br />\nHe then goes on and shows the need<br />\nOne of the members of Ohio<br />\nshe?—of HunCo-eds at So'western wear pafor such an institution and the good has it. He—or is it<br />\nrejust<br />\n1885,<br />\nof<br />\nclass<br />\nWesleyan,<br />\nnot<br />\nter College opines that girls do<br />\njamas, shorts, and veils when they<br />\nthat it will be able to bring about.<br />\nIn speaking of the founding of the get enough parties, nor do they go ceived a varsity letter for baseball. attend dances, a Presbyterian minInstitute, he says: r.<br />\nout enough, and, furthermore, He played on the team while he was<br />\n\"In organizing the Institute of Law, they spend too. much time study- a student there. Well, better late ister bemoans. Or is it reminiscdeference has been shown to the tradimg ?<br />\nthan—Hell! How trite.<br />\ntions of the Johns Hopkins University. ing.<br />\n<br />\nMeditations On the Freshman<br />\n<br />\nTHE NEWS—LETTER<br />\n<br />\nESTABLISHED 1818<br />\n<br />\ngfe-e96<br />\nCLOTHING<br />\ns0<br />\nIrii<br />\n<br />\nW<br />\n<br />\nIN0,<br />\n<br />\nMADISON AVENUE COR. FORTY-FOURTH STREET<br />\nNEW YORK<br />\n<br />\nOur Representative will be at the<br />\nSOUTHERN HOTEL<br />\n<br />\nThursday, Friday and Saturday<br />\nMay 7, 8 and 9<br />\nIllustrations of Shoes<br />\nSent on Request<br />\nBRANCHES<br />\nNEW YORK: ONE WALL STREET<br />\nBOSTON: NEWBURY COR. BERKELEY STREET<br />\nPALM BEACH<br />\nNEWPORT<br />\n<br />\ngave<br />\n<br />\n7 J.H.U. STUDENTS<br />\nADMITTED TO MED.SCHOOL<br />\n<br />\nKIN W. LEE<br />\n<br />\nTHE RELIABLE WEAVING CO.<br />\n<br />\nCHINESE HAND LAUNDRY<br />\nFirst Class Work<br />\n2815 Greenmount Ave.<br />\n<br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br />\n<br />\nSpecial Attention Given to Students<br />\n<br />\nOPERATE IT YOURSELF<br />\n<br />\nRENT A CAR<br />\n<br />\nThe Auto Rental Company<br />\n,Cars for Hopkins Students<br />\nDeposit Not Required<br />\n<br />\n111 W NORTH AVE.<br />\n<br />\n2125 HARFORD AVE.<br />\nPhone, Wolfe<br />\n<br />\n1413<br />\n<br />\nTHE NORTH INN<br />\n3 EAST NORTH AVENUE<br />\nev•<br />\n<br />\nThe Meeting Place For College Men<br />\nAfter the Game or the Dance<br />\n<br />\nEDITORIALS<br />\n<br />\nE<br />\n<br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br />\n<br />\nWork Called for and Delivered<br />\n<br />\nY•747Y<br />\n<br />\n\"Food Prepared the Right Way\"<br />\n<br />\nRepairing<br />\n<br />\nKIBLER'S<br />\n<br />\nEngraving<br />\n<br />\nJEWELER and OPTICIAN<br />\n3222 Greenmount Avenue<br />\n5409 Harford Avenue<br />\nNearest Jeweler to the Campus<br />\n<br />\nNEW<br />\n<br />\nFORD<br />\n<br />\nUSED<br />\n<br />\nAutomobiles<br />\nTHE BACKUS MOTOR COMPANY<br />\n10-20 E. North Avenue<br />\nVernon 4300<br />\n<br />\nLet Bill Triplett show<br />\nyou Katz Clothes--with<br />\nstyle that sells itself!<br />\n<br />\n*:OTHES<br />\n<br />\n211-213 E. Baltimore St.<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 8, 1931<br />\n<br />\nHEANEY, FRESHMAN, Gilm,an's Colleague Has Rowed<br />\nWINS THOM CUP 'About 10,000 Miles' On River<br />\nFRIDAY NIGHT TEST LAST NIGHT Dr. Charles R. Lanman, One of Gilman's \"First Twenty<br />\nTo<br />\nis<br />\n<br />\nFellows\" Reminiscence In Letter<br />\nJohns Hopkins Librarian<br />\nWinner<br />\nJudges Declare Him<br />\nIn Extemporaneous SpeakAContinued from page 1, col. 5)<br />\nof the Tech, recognizing that GilContest Held In Levering face\". Accordingly, he remarked, man was the first to start a real<br />\n<br />\nJohns Hopkins<br />\nhe had eighteen \"struck off\" in or- university in our country—you'<br />\nboard and the chief center of cul- der to supply part of the demand. would feel how true it was that the<br />\nNight<br />\nture, he asserted.<br />\n\"I am thinking that you too may<br />\nundertaking<br />\n(Continued from page 1, col. 3)<br />\n<br />\nAT LOEW'S<br />\n<br />\nCENTURY<br />\nTHEATRE<br />\nGALA<br />\n<br />\nCollegiate Week<br />\nShow<br />\n<br />\nSTAGE TREAT<br />\n<br />\nNINA<br />\n<br />\nOLIVETTE<br />\nand CHESTER<br />\nFREDERICKS<br />\nin<br />\n<br />\n\"Let's Go<br />\nCollegiate\"<br />\nWith A Big Cast<br />\nof<br />\nCAMPUS CUT-UPS<br />\n<br />\nON THE SCREEN<br />\n<br />\nTo •Seidler, Baltimore will be a<br />\ncommunity, a century from today,<br />\nof happy homes, with citizens who<br />\nwill have enough income to see<br />\ntheir selves through life adequately. He also hoped for no unemployment in 2031.<br />\nThis age of individualism will be<br />\nfollowed by an age of a derogatory<br />\nnature, said Wasserman.<br />\nVisualizes Bigger Campus<br />\n<br />\nLockard expressed his hope for<br />\nwider streets, vast skyscrapers and<br />\nextenive development of the Johns<br />\nHopkins campus.<br />\nThe only difference that will be<br />\nevident, it was said by Herman,<br />\nwill be in political views. Bussey,<br />\nin his talk, said that Baltimore will<br />\nundoubtedly maintain her old<br />\nquaintness.<br />\nPowell visualized government<br />\ncontrol of almost everything and<br />\nasserted that the greatest social<br />\nproblem with which people in 2031<br />\nwill have to contend is the problef of eugenics. The institution of<br />\nmarriage will have disappeared,<br />\nPowell said.<br />\nBaltimore will be no Utopia, but<br />\nwill remain the same conservative<br />\ncity that it is now, believes Dorfman.<br />\n<br />\n\"IT\" GIRL<br />\nTALLULAH<br />\nBANKHEAD<br />\nin<br />\n<br />\n\"Tarnished<br />\nLady\"<br />\nMeet Your Friends<br />\nat<br />\n<br />\nLOEW'S<br />\n<br />\nCENTURY<br />\nFRIDAY NIGHT<br />\n<br />\nNew Yale Law Building Posters of Co-Ed In<br />\nWill Be Opened Soon Barrel Tabooed at N.W.<br />\nPlant, Block Long, Costing $2,500,000, Dean of Women At Northwestern<br />\nUniversity Orders 200 Portraits<br />\nGiven By Trustees of Sterling<br />\nPrivately Burned<br />\nEstate<br />\n<br />\nMANHATTAN SHIRTS—SCOTCH SPUN<br />\nNECKWEAR—INTERWOVEN HOSE<br />\n<br />\nMcPherson's<br />\n11 East Baltimore Street<br />\n<br />\n\"The Store of Standard Value\"<br />\n<br />\nSeeking a Position?<br />\n<br />\nJ. H. FLJRST CO.<br />\nPRINTERS OF<br />\nPhilological and Scientific<br />\nPublications<br />\n<br />\nWe are receiving inquiries daily for<br />\nteachers<br />\nTHE BALTIMORE TEACHERS<br />\nAGENCY<br />\nWilliam K. Yocum, Manager<br />\nTitle Annex Bldg.<br />\nPlaza 1195<br />\nBaltimore, Md.<br />\n<br />\n12-20 Hopkins Place, Baltimore<br />\n<br />\nMILESTONE SYSTEM<br />\nDRIVE IT YOURSELF<br />\n<br />\nNo Deposit Required of Hopkins Students<br />\nCoupes<br />\nRoadsters<br />\nSedans<br />\n<br />\n.........<br />\n<br />\nBuicks<br />\nFords<br />\nChryslers<br />\nHupmobiles<br />\nChevrolets<br />\n<br />\nOn the campus of the NorthThe Yale Law School is to soon<br />\nNo Hour Charge at any Time<br />\nput into service its new home, to be western University, in Evansville,<br />\nknown as the Sterling Law Build- Illinois, posters which depicted a<br />\nLIGHT AND LOMBARD STREETS<br />\nsmiling co-ed clad only in a barrel<br />\ning.<br />\nPLaza 6000<br />\n2402 Pennsylvania An.<br />\n1725 N. Charles St.<br />\nDiscusses Writers<br />\nThe plant covers a full city block were officially tabooed by the uniLafayette 2000<br />\nVernon<br />\n4049<br />\nIn his De Tocqueville contest<br />\nin New Haven, Connecticut, an I. versity authorities, said an InternaBaltimore Concedes Milestone Supremacy<br />\npresentation, Yudkin discussed the<br />\ntional News Service story.<br />\nN. S. story reported.<br />\nwritings of Alex De Tocqueville<br />\nand their influence on French history.<br />\n\"In his Democratic en Amerique,\" said Yudkin De Tocqueville,<br />\nthe practical idealist, wrote about<br />\nAmerican demoracy but his heart<br />\nwas in France. His book was an<br />\nimportant stepping stone in the<br />\n0 •<br />\npath which finally led to the Napoleonic contests.\"<br />\nLouis Kroll, the second speaker<br />\nA vacation abroad ... and only three weeks (or less) away from home has now<br />\nin the lecture test, declared: \"Although the Franco-Prussian War<br />\nbeen made possible by the two fastest liners afloat and the fastest world cruiser<br />\nappears to be a blot on French history, the terrible year from July,<br />\n1870, to June, 1871, revealed more<br />\nthan any other event the great<br />\ncourage and patriotic spirit of the<br />\nFrench people.\"<br />\n<br />\nshod /rip and a ffierrq one •<br />\n<br />\nFrench Hated War<br />\n<br />\nThe NEW<br />\n<br />\nstart of the Baltimore<br />\nlike to have one of them in your was a real event in the history of<br />\nlibrary file\", he wrote.<br />\nAmerican education.\"<br />\nKnew Murray Personally<br />\nIn thanking Dr. Lanman for his<br />\nIn referring to the \"First TwenDr. French wrote: \"I<br />\nphotograph,<br />\nty Fellows\" of the Johns Hopkins<br />\ninto our records all<br />\nto<br />\nget<br />\nglad<br />\nam<br />\nUniversity in 1876, Dr. Lanman.<br />\nabout the first<br />\ninformation<br />\npossible<br />\ndeclared:<br />\nalong mycame<br />\nI<br />\nfellows.<br />\ntwenty<br />\n\"That 'First Twenty' includes<br />\nnone<br />\nwhen<br />\nnineties,<br />\nthe<br />\nlate<br />\nin<br />\nself<br />\nWalter Hines Page, Josiah Royce,<br />\nheld<br />\ndays<br />\nthe<br />\nspirit<br />\nof<br />\nearly<br />\nof<br />\nthe<br />\nHenry Baxter Adams, Henry Carwas<br />\nUniversity<br />\nand<br />\nwhen<br />\nthe<br />\nover<br />\nter Adams, Ernest Sillier, and so<br />\nopample<br />\nhad<br />\nso<br />\nsmall<br />\nthat<br />\nwe<br />\nstill<br />\non. Of course, your predecessor,<br />\nother.\"<br />\nto<br />\nportunity<br />\nknow<br />\neach<br />\nNicholas Murray, brother of PresiDr. Lanman's philosophy of life<br />\ndent Murray Butler's mother, and<br />\nis,<br />\nDr. French said, to carry on<br />\nher other brother, Thomas Chalnever turn<br />\nmers Murray, I knew well, person- with a stout heart, to<br />\nof life; and<br />\nally. Those were great days, I can backward in the work<br />\nto maintain the three \"sovereign<br />\nanswer you.<br />\nblessings\", faith, study health, and<br />\nJ. II. U. Starts Historical<br />\nstrong and hopeful courage.<br />\na<br />\nthe<br />\nheard<br />\nhave<br />\ncould<br />\nyou<br />\n\"If<br />\nHe was from 1877 to 1880, aslike<br />\nmen<br />\nby<br />\nGilman<br />\ntribute paid to<br />\nin Sanskrit at the Johns<br />\nsociate<br />\npresYale<br />\nthe<br />\nand<br />\nPresident Eliot,<br />\nHopkins.<br />\nWalker<br />\nAmask<br />\nident, and Francis<br />\n<br />\nSpring Showing<br />\n<br />\nSaul Dorfman, the third contestant, pointed out the reasons why<br />\nthe Paris Commune of 1871 was<br />\ncreated.<br />\n\"Although the French hated<br />\nwar and had little aptitude for revolutions,\" he said, \"they willingly<br />\nfought when their liberty was<br />\nthreatened. France has now found<br />\na haven of political rest, however.\"<br />\nLea Alpert, the winner of the<br />\ndeclamation contest yesterday, presented portions of the article written by George Russell in 1914<br />\nwhich revolutionized public opinion<br />\non the strikes.<br />\nGave Roosevelt'Speech<br />\nSamuel Reichel ,the second speaker in. the Adams meet, declaimed<br />\nthe address made by Roosevelt on<br />\nMarch 13, 1905, before the National<br />\nCongregation of Mothers, \"American Motherhood.\"<br />\nThe judges in the Thom Cup<br />\ncontest last night were Mrs. Joseph France, the daughter of the<br />\ndonor of the trophy; Mrs. H. R.<br />\nM. Thom; McKee Barclay, journalist and cartoonist; and Charles J.<br />\nWilson, theatrical man.<br />\nBerry Presents Cup<br />\n<br />\nThe cup was presented to the<br />\nwinner, Heaney, by Dr. Edward W.<br />\nBerry, dean, who was introduced by<br />\nS. J. Egerton. T. R. Tippett, Jr.<br />\npresented the opening remarks at<br />\nthe event in Levering Hall. He<br />\neulogized the late Mr. Thom, a<br />\ngraduate of the Hopkins, and gave<br />\nthe history of the work this year in<br />\nconnection with the contest.<br />\n<br />\nE<br />\nUROP<br />\nWITIB<br />\n<br />\n*EXPRESS VACATION TO<br />\n$295. up • 18-27 days..,with 7-17 days' sightseeing in Europe.<br />\nIn conjunction with American Express Company.<br />\n*THIRD CLASS BECOMES EXCLUSIVE • The<br />\n<br />\nJuly<br />\n$155 and up round trip.<br />\n<br />\nSTUTTGART, sailing<br />\n<br />\n2.<br />\n<br />\nentire 3d Class reserved for students on the<br />\n<br />\nReturning on the DRESDEN, Aug. 6, or STUTTGART, Aug. 20.<br />\n<br />\n*SPECIAL STUDENT SAILINGS • The entire Tourist 3d Cabin reserved for students on the<br />\nEUROPA,June 20 and the BERLIN,June 25. Returning on the BREMEN, Aug. 13.<br />\n*SEND FOR BOOKLETS<br />\n57 Broadway, New York City • Telephone BOwling Green 9-3880 • or your local<br />\n<br />\nagent<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MAY 8, 1931<br />\n<br />\n4<br />\n<br />\nTRACKSTERS<br />\nDunn Wins Scholarship; HOPKINS<br />\nENGAGE SWARTHMORE<br />\nTo Study At University Of Parrs<br />\n<br />\nJAY TWELVE TO BE<br />\nRaymond<br />\nSYRACUSE<br />\nTO<br />\nHOST<br />\n<br />\nVisiting Lacrossemen Are Not ExHopkins Undergraduate Is First Homewood Student To<br />\npected To Put Up Tough<br />\nGet Grant; Is Member of NEWSBattle<br />\n<br />\nLETTER Staff<br />\nORANGE TEAM SLOW<br />\nAfter a brief stay in Paris, the<br />\ngroup will go to Nancy in the province of Lorraine where they will<br />\ntake intensive training in the study<br />\nof the French language, literature,<br />\nhistory and customs. The University of Nancy is considered one of<br />\nthe leading provincial universities<br />\nof France.<br />\n<br />\nS. Raymond Dunn, an underHomewood Squad Conceded To graduate student of Johns Hop!<br />\nHave Most Powerful Group<br />\nkins and at present in his sophoOf Attack Men<br />\nmore year, has been awarded a<br />\n$1,000 scholarship for a year's<br />\nTomorrow the Black and Blue<br />\nstudy at the University of Paris by<br />\ntwelve will play host to Syracuse the Institute of International EduUniversity's lacrosse team. Due to cation.<br />\nthe home teams' renowned power<br />\nThis scholarship is one of eight<br />\nWill Enter In Summer<br />\nthe Orange twelve are not expected given to the students of the United<br />\nAt the close of the summer.<br />\nto put up any sort of tough battle. States, two of the recipients usual- Dunn will enter the University of<br />\nto France. It is the first Paris, where he will take up his<br />\nSyracuse, like most northern ly going<br />\nthis scholarship has been junior year of study.<br />\nthat<br />\ntime<br />\nteams, does not possess men with<br />\ngranted to a student of Hopkins.<br />\nDunn is 18 years of age. He was<br />\nthe experience of those who indulge<br />\nborn<br />\nof<br />\nin Mount Airy, Maryland, and<br />\nGroup<br />\nTo Be Member<br />\nin the Indian pastime down here in<br />\nDunn will be a member of the came to Baltimore at the age of 11.<br />\nour own free state. The Orange<br />\nstudy group of the University of Graduating from Forest Park High<br />\ndoes however, possess a big strong Delaware which will visit France. School in 1929, he entered the<br />\nsquad of players who can put up a He will sail July 17th, this summer Hopkins the following fall. He<br />\non the S.S. Cardonia from New has already received a scholarship<br />\n(rood battle.<br />\nYork City, it is said. The study from Johns Hopkins for 1930-1931<br />\nMaryland<br />\nTo<br />\nLost<br />\nSeveral weeks ago, Maryland en- group is scheduled to arrive at Le for having had one of the three<br />\ncountered the Orange team at Syra- Havre, France, from where the highest averages in the freshman<br />\nwill go to Paris and Ver- class.<br />\ncuse. The result was an over- members<br />\nHe is also a member of the<br />\nsailles in order to be welcomed by<br />\nwhelming 12-1 victory for the Terstaff.<br />\nNEWS-LETTER<br />\nauthorities.<br />\neducational<br />\nFrench<br />\nrapins.<br />\nThe Maryland attack found the<br />\nTries To Disprove That<br />\nSyracuse defense entirely too slow<br />\nStudents Not Farmers<br />\nresistance.<br />\nMuhlenberg College Conducts An Inof<br />\ndegree<br />\nto offer any<br />\nvestigation To Deny Sister ColConsequently, shots were made beleges' Accusations<br />\nWill Act As Adviser To Chinese<br />\nAn<br />\ninto the occuinvestigation<br />\ncould<br />\nmen<br />\ndefense<br />\nfore Syracuse's<br />\nGovernment At International<br />\npations of the parents of students<br />\nOpium Meet<br />\neven get set.<br />\nat Muhlenberg College, showed<br />\nEasy Victory<br />\nonly .05678 per cent engaged<br />\nthat<br />\n27<br />\nNATIONS MEET MAY<br />\nThis slow-moving Orange team<br />\nin agriculture. The investigation is<br />\nshould prove a good practice battle<br />\nHopkins Political Science Profes- an attempt to prove that its stufor Hopkins. Since the Jays are sor Has Served As Adviser To dents are not farmers which is the<br />\nChina Before<br />\naccusation of several of its sister<br />\nconceded to have one of the fastest<br />\ncolleges.<br />\nattack<br />\nof<br />\nand most powerful group<br />\nDr. Westel \\\\T. Willoughby,<br />\nmen of any team this year, SyraDoctor of Atheism Degree<br />\nThomas P. Stran, professor of poNearly one-half the enrollment<br />\ncuse's big defensive men may prelitical .science at the Johns Hop600 students at an anti-religious<br />\nof<br />\naftergala<br />\na<br />\nfor<br />\nthemselves<br />\npare<br />\nkins University, leaves tomorrow university in the West will this<br />\nnoon.<br />\nfor Geneva, Switzerland, to attend June receive degrees as DOctor of<br />\nWith Lorne Guild, Turnbull,<br />\nan international opium conference, Atheism. A great number of these<br />\nKelly and Darrell in form, the Jays<br />\nscheduled for May 27, in the ca- graduates are women.<br />\nmay be expected to score an overpacity of adviser to the Chinese<br />\nwhelming victory.<br />\ngovernment.<br />\nProbable line-up:<br />\nPlan To Regulate Opium<br />\nHOPKINS<br />\nSYRACUSE<br />\nEfforts will be made by the deleStude<br />\nRossman<br />\nBernard gates representing nations throughRomaner<br />\nWe<br />\nCP<br />\nMurphy<br />\nNess out the world to evolve a definite,<br />\nFD<br />\nObstud<br />\nKneip<br />\nSD<br />\nMulcahy<br />\nLang adequate plan by which to regulate<br />\nTD<br />\nBrown<br />\nBeehler<br />\nAikens<br />\nStone the opium traffic. It is the aim of<br />\nTA<br />\nPriddle<br />\nGuild<br />\nSA<br />\nD. Thiel<br />\nD. Kelly the conferees, it was said, to, curFA<br />\nMcChung<br />\nTurnbull<br />\nOH<br />\nPierce<br />\nDarrell tail the use of opium, and similar<br />\nI.H<br />\nMorris<br />\nAND<br />\nnarcotics, for purposes other than<br />\nmedicinal.<br />\nIn 1924-25 Dr. Willoughby was<br />\ncounsellor and adviser to the Chinese delegation to the International<br />\nOpium Conference at Geneva. He<br />\nMigno-Vista Chosen As Site of<br />\nserved as constitutional adviser to<br />\nHopkins June Week Beach<br />\nthe Chinese government in 1916-17.<br />\nParty<br />\nDuring the Washington Conferheld in 1921, he acted as the<br />\nence,<br />\nTO HOLD DANCE<br />\nOPPOSITE<br />\nchief technical adviser to the ChiPENNA.R.R.STATION<br />\nThose Who Like Their Romance nese delegation.<br />\nWill Go For Sail on<br />\nProfessor Since 1897<br />\nCraft<br />\nSince 1897 Dr. Willoughby has<br />\nbeen professor of political science<br />\n(Continued from page 1, col. 3)<br />\nat the Hopkins. He has also been<br />\nThe-Sea. The ballroom is very<br />\na lecturer at the George Washinglarge and will easily accommodate<br />\nton University and at Princeton<br />\nthe 700 couples which the commitUniversity.<br />\ntee believes will be present.<br />\nDr. Willoughby received his<br />\nLighting Effects Planned<br />\ndegree here in 1891 and was<br />\nPh.D.<br />\nThe lighting effects have been<br />\nto the bar in that year.<br />\nadmitted<br />\ncarefully planned and the orchestra<br />\nwill have a boat painted on canvas<br />\nas a setting. Oz Steinwald and his Arrange For Social<br />\norchestra will furnish the music.<br />\nContact At Antioch<br />\nThose couples who enjoy only<br />\nrealistic romance, will be afforded Telephone Wires Connect Men's and<br />\nWomen's Dorms at Antioch<br />\nthe opportunity to slip out for a<br />\nCollege<br />\nnocturnal sail.<br />\nIn order to promote a more intimate social contact between the<br />\nmen and women of Antioch ColColgate U. Professor<br />\nlege, a special arrangement of teleAdvises Night Shirt phone wires between the men's dorm<br />\nA pre-eminent Hotel of 1200<br />\nand women's dorm has been introDr. Laird, Psychologist, Conducts<br />\nRooms, each having Bath,<br />\nduced.<br />\nTests To Show Pajamas Prevent<br />\n<br />\nWILLOUGHBY TO LEAVE<br />\nFOR GENEVA TOMORROW<br />\n<br />\nayneaAi@nrit,11<br />\n<br />\nLittle Is Known of Pennsylvania<br />\nTeam's Strength This<br />\nYear<br />\n<br />\nCtothia&...14alaneLculhvuti.<br />\n315 NORTH CHARLES STREET<br />\nBALTIMORE ... MARYLAND<br />\n<br />\nJAYS BEATEN TWICE<br />\nAddition of Pete Bradley To<br />\nSquad Expected To Boost<br />\nTeam<br />\nTomorrow, the Jay tracksters<br />\njourney to Swarthmore to engage<br />\nthe Pennsylvanians in a meet.<br />\nLittle is known of the strength<br />\nof the Swarthmore team this year.<br />\nLast year they won easily from<br />\nHopkins. It is reported that they<br />\nboast some strength in the hurdles<br />\nand middle distances.<br />\nSmarting under the sting of two<br />\nsuccessive defeats, the Jays are determined to break the jinx that has<br />\nfollowed their competition. The<br />\noutlook on the coming meet is<br />\nsomewhat more favorable toward<br />\nthe Hopkins aggregation than it<br />\nhas been recently. Captain Lockard will again be in shape to compete which will eliminate the necessity of \"doubling-up\" in races. The<br />\nfact that certain men had to run 2<br />\nraces last week accounted for the<br />\nloss of several points.<br />\nEssentially the same line-up will<br />\nbe sent against Swarthmore that<br />\nhas run in all the meets to date.<br />\nThe addition of \"Pete\" Bradley to<br />\nthe squad will doubtless result in<br />\nadditional points in the high jump.<br />\nBradley accounted for Hopkins'<br />\nonly points in that event in the recent meet against Catholic U<br />\n<br />\nST. REGIS<br />\n1815-1817 N. Charles Street<br />\nSTUDENTS MEETING PLACE<br />\nClub Breakfasts<br />\nSpecial Luncheons 50 cents<br />\nDinners 65 cents<br />\nRenowned as \"Just the Place\" for Supper<br />\nAfter the Theatre or Dance<br />\nOPEN UNTIL 3:00 A. M.<br />\n<br />\nSimon Ackerman Clothes<br />\nREADY TO WEAR<br />\n<br />\nA. JACOBS & SONS<br />\n<br />\nWe Sell Drugs and Give Service<br />\nCall us up Belmont 5318, 5846<br />\n<br />\n... Tailors ...<br />\n<br />\nPeabody Pharmacy<br />\n<br />\n128 W. Fayette Street<br />\n<br />\nCalvert and 30th Streets<br />\n<br />\nSTEPPING<br />\n<br />\nINTO<br />\n<br />\nA<br />\n<br />\nMODERN<br />\n<br />\nWORLD<br />\n<br />\nELCOME.<br />\n)TO<br />\n<br />\nNEW YORK<br />\n'THE<br />\n<br />\nMAGOTHY RIVER<br />\nSCENE OF PARTY<br />\n<br />\nMOTEL<br />\nGOVERNOR<br />\ngINTON<br />\n<br />\n31E-sidLyp.7z-\"AVE,<br />\n<br />\nProper Sleep<br />\n<br />\nDr. Laird, a professor of psychology at Colgate University, recently conducted tests to pi-bye that<br />\npajamas prevented one from getting the proper sleep at night. He<br />\nsuggested a return to the night<br />\nshirt.<br />\n<br />\n117 Want 'No Drill'<br />\nCompulsory military training received a slight shock at Creighton<br />\nUniversity, where, out of 202<br />\nvotes cast, only 22 favored compulsory, 43 optional, and 117 \"stood<br />\npat\" for \"no drill\".<br />\n<br />\n\"Test it!\"<br />\nthe watchword of an industry<br />\nThe Bell System—whose plant cost more than<br />\n$4,000,000,000 and is still growing—offers<br />\nwide opportunity to the man of engineering<br />\nbent. Here he has ample scope for testing new<br />\nideas, not only in telephone apparatus development but also in manufacture,construction,<br />\ninstallation, maintenance and operation.<br />\nNo matter what his particular branch of<br />\nengineering—electrical, mechanical, civil, in-<br />\n<br />\nS e rvidor, Circulating Ice<br />\nWater and many other innovations ...featuring a sincere<br />\nspirit of hospitality.<br />\n<br />\ndustrial, chemical—his training stands him<br />\nin good stead. For \"telephone engineering\"<br />\ncalls for the broad engineering point of view<br />\nas well as specialization.<br />\nBasic technical knowledge, an appreciation<br />\nof economic factors and the ability to cooperate are some of things that count in Bell<br />\nSystem engineering. For men of this stamp,<br />\nthe opportunity is there!<br />\n<br />\nBELL SYSTEM<br />\n<br />\n`ROQM AND BATH $3UP<br />\nA<br />\n<br />\nNATION-WIDE<br />\n<br />\nSYSTEM<br />\n<br />\nOF<br />\n<br />\nINTER -CONNECTING<br />\n<br />\nTELEPHONES<br />\n<br />\nA<br />\n<br />\n\f", "format": "basic_html", "processed": "A FRESHMAN<br />\nGIVES HIS<br />\nMEDITATION ON FROSH<br />\nPage 2<br /><br />\nVol. XXXV, No. 51<br /><br />\nJUNE WEEK<br />\nTICKETS ARE NOW<br />\nON SALE HERE<br />\nPrice, $12.50<br /><br />\nTHE JOHNS HOPKINS UNIVERSITY, HOMEWOOD, BALTIMORE, MD., MAY 8, 1931<br /><br />\nTWO PROFESSORS<br />\nWILL REPRESENT<br />\nJ. H. U. IN FRANCE<br />\nChinard and Lovejoy Named<br />\nAs Delegates to College<br />\nde France Event<br />\nFRENCH COLLEGE TO<br />\nMARK 4th CENTENARY<br /><br />\nSupper Club Group<br />\nTo Hear E. A.Schaal<br />\nEvidence Collected Concerning the<br />\nTrend of Student Opinion in Neighboring Colleges Will Be Topic<br /><br />\nEvidence collected by E. A.<br />\nSchaal regarding the trend of student opinion in nearby colleges will<br />\nbe presented by him at the final<br />\nmeeting of the University Supper<br />\nClub next Tuesday at 6.30 P. M.<br />\nMr. Schaal will speak in place<br />\nof Rheinhold Niebuhr, who was to<br />\nspeak, but will be unable to do so.<br /><br />\nMAGOTHY RESORT HEANEY, FRESHMAN,<br />\nTO BE SCENE OF WINS THOM CUP Q.A. Column<br />\nJUNE WEEK PARTY TEST LAST NIGHT Por The<br />\nMago-Vista Has Been Chos- Judges Declare Him Winner President<br />\nIn Extemporaneous Speaken As Site Of Hopkins<br />\nBeach Party<br /><br />\nPrice 5 Cents<br /><br />\n7 J. H. U. STUDENTS<br />\nGET ADMITTANCE<br />\nTO MED. COLLEGE<br /><br />\nContest Held In Levering<br />\nBy Dr. Joseph S. Ames<br />\nBALTIMORE, 100 YEARS<br />\nHamburger, Myers, MichelFROM<br />\nNOW,<br />\nTOPIC<br />\nWILL HOLD DANCE<br />\nIN RESPONSE to a suggestion son, Ferrigan, Hanselman<br />\nIN THE EVENING Yudkin Victorious In De by one of the editors to express my<br />\nLarkin, Sadusk Students<br />\nTocqueville Test; Alpert opinion concerning so called<br />\nThose Who Like Their Ro- Adjudged Victor In Adam \"Freshman Regulations\", I wish to QUOTA CONSIDERED<br />\nUNUSUALLY LIMITED<br />\nmance Realistic Will Go<br />\nNorman Heaney, a freshman, say positively that, in my judgment,<br />\ntheir<br />\neffect<br />\nis<br />\naltogether<br />\nbad.<br />\nPart<br />\nFor Sail<br />\nwas declared the winner of the anLast Year 15 or 16 Were Renual Thom Cup contest, held last of the system is to put the responsibility<br />\nfor<br />\nthe<br />\nenforcement<br />\nceived; 24 Applied This<br />\nof such<br />\nMago-Vista, overlooking the Ma- night in Levering Hall before a<br />\nBrown University Professor To<br />\nregulations<br />\nupon<br />\nan<br />\nupper class,<br />\nYear, 32 Last<br />\nSpeak Today At Johns Hopkins gothy River will be the scene of the large audience. The topic for this<br /><br />\nKRAUS WILL ADDRESS<br />\nAwarded,<br />\nCHEMISTRY STUDENTS<br /><br />\nNo Degrees Are<br />\nNo Regular Courses Given<br />\nAt Paris U.<br /><br />\nevent was \"Baltimore—One Hun- generally the second year class or<br />\nOut of 24 applications made by<br />\ndred Years from Now.\" In the De \"sophomores\" as they are usually<br />\ncalled,<br />\nfor<br />\nsuch<br />\nenforcement<br />\nobHomewood<br />\nSERIES ENDS MAY 15<br />\nstudents for entrance<br />\nTocqueville lecture contest, held at<br />\nthe assembly in Latrobe Hall yes- viously cannot be the duty of the into the Johns Hopkins Medical<br />\nA. R. L. Dame Lectureship<br />\nterday morning, Harold Yudkin Student Council. This has the ef- School, only 7 were yesterday<br />\nacGroup Culminates Here With<br />\nwas chosen the winner; in the fect of encouraging any bully there<br />\ncepted<br />\nby<br />\nthe<br />\nBoard<br />\nof<br />\nAdmission<br />\nW. D. Bancroft Speech<br />\nAdams declamation test, Leo Al- may be in the class; and, in fact,<br />\nthe whole process has a bad influ- of which Dean Allan Chesney is<br />\npert, a sophomore.<br />\nDr. Charles A. Kraus, of Brown<br />\nence upon everyone in the class. the chairman.<br />\n\"The question of progress is the<br />\nUniversity, today will address stuEach student must know that the<br />\nThe seven students who will enmost logical thing to which to turn<br />\nsystem<br />\nis unfair and unmanly, it ter the<br />\ndents in the department of chemfreshman class next fall are:<br />\nin considering what Baltimore will<br />\nmay even be described as cowardly.<br />\nistry at the Johns Hopkins Univerbe one hundred years from today,\"<br />\nLouis P. Hamburger, Jr.<br />\nsity in the next to the final lecture<br />\nsaid Heaney in his extemporaneElliott<br />\nMichelson<br />\nSO FAR as the \"Freshmen\"<br />\nous address in the Thom Cup comin a series presented under the A.<br />\nJoseph Francis Sadusk<br />\nthemselves are concerned, the effect<br />\npetition. \"I would like to see the<br />\nR. L. Dohme Lectureship.<br />\nis also bad, although not as much<br />\nRussel C. Hanselman<br />\ndifferent modes of travel a century<br />\nSince 1924, Dr. Kraus has been<br />\nso as upon the upper classmen. A<br />\nJohns Alfred Myers<br />\nfrom now. Education, too, I beprofessor of chemistry and director<br />\nHave Long Pier<br />\nstudent comes to college, as a rule,<br />\nJohn Charles Larkin<br />\nBathing is said to be excellent lieve, will have taken tremendous with a real desire to take advanof research in that science at the<br />\nstrides forward.<br />\nJoseph<br />\nP. Ferrigan<br />\nand the beach sloping and sandy—<br />\nBrown University.<br />\ntage of all that the college offers;<br />\nCity Manager May Head City<br />\nConsidered Small Quota<br />\nstretching a good distance along the<br />\nWas Director At Clark<br />\n\"Republicans may still be com- he should become as soon as posThis<br />\nis considered to be an exPrevious to that, from 1914 to river. A pier extending out over bating depressions, yet we may ex- sible a member of the college, with<br />\nParis to Entertain<br />\nceptionally<br />\nsmall quota since that of<br />\n1924, he was the director of the the water affords diving apparatus pect, a century from now, a socia- the same privileges and opportuniThe city of Paris will sponsor a<br />\nchemistry laboratories at the Clark while the river is sufficiently deep listic tendency in politics. A city ties as every other student. Any Previous years has included a largreception to the delegates on the University. For two years he main- to dispense with the worry that any<br />\nmanager may head the city of Bal- act or custom which delays his ab- er number of students. Admission<br />\nsecond day of the three-day centen- tained the position of assistant pro- academic skulls will be cracked.<br />\ntimore. Of course, that apparently sorption into the whole student was granted to 15 or 16 Hopkins<br />\nThere are also floating rafts a is inevitable, if the word of Dr. body simply prolongs and hampers<br />\nfessor at the Massachusetts Instiary event.<br />\nstudents last year. Application was<br />\nConcluding the affair will be a tute of Technology. At the Uni- little way off shore.<br />\nBroadus Mitchell is to be taken into his education. It is most unfair. made by 32.<br />\nThe female members of the serious consideration.\"<br />\n\"College spirit\" is based upon pride<br />\nsight-seeing tour of Paris and other versity of California during the<br />\nEntrance into the first-year class<br />\nyears 1901 to 1904, Dr. Kraus was party have been charged with the<br />\nOther contestants in the feature in one's college and upon the pleascities of interest.<br />\nof the Medical School is limited to<br />\ntask of preparing a dinner—that<br />\nan instructor in physics.<br />\nof the literary contests held on the ure which a student has in his asIn 1531 the King of France,<br />\nHaving received his B.S. degree their escorts might, by some chance Homewood campus<br />\n75<br />\nproperly qualified students comthroughout sociations. It should be the purFrancis I, established the College at the University of Kansas in or other, care to eat. The said fepose<br />\nof<br />\nevery<br />\nstudent<br />\ning<br />\nin<br />\nthe<br />\nfrom colleges throughout the<br />\ncollege<br />\nyesterday were M. Kronsberg, T.<br />\nde France, which next month marks 1898, the chemist entered upon male members will attempt to per- C. Crane,<br />\nto<br />\nhelp<br />\nand<br />\nnot<br />\nhinder.<br />\ncountry.<br />\nA. Seidler, E. R. Wasits four hundredth year of exist- post-graduate work at the same in- suade the said escorts to eat the serman,<br />\nE. M. Lockard, G. HerPrivilege Sought-After<br />\nsaid dinner in a pavillion built over<br />\nence. It is the only institution in stitution for nearly two years.<br />\nWHY SHOULD any student be<br />\nman, E. Bussey, R. F. Powell, S.<br />\nAdmission to the Johns Hopkins<br />\nthe water.<br />\nFrance, explained Dr. Chinard yesGot Physics Fellowship<br />\nobliged to wear a certain costume? Medical School is a much<br />\nDorf man.<br />\nsoughtCoffee, Ice-Cream Free<br />\nAt the Johns Hopkins University<br />\nterday, which greatly differs from<br />\nWhy should he be told that he must after privilege. Numerous<br />\nMust<br />\nConsider<br />\nPresent<br />\ncream<br />\nAlthough<br />\ncoffee<br />\nand<br />\nice<br />\napplicathe French educational system. No he was a fellowship holder in<br />\nwill be served without further as- -That it is vital to consider what do some things and not do others? tions are received from undergradregular courses are given at the physics, 1899-1900. During 1900sessment, the June Week commit- Baltimore is today before any pre- Who has any right to regulate the uates throughout the country.<br />\nCollege de France, except for sev- 01, Dr. Kraus was a research feltee has refused to extend its gen- diction may be made as to the fu- life and conduct of his fellows?<br />\nHamburger, son of a prominent<br />\neral public lectures through the low at Kansas. In 1908 he received<br />\nerosity to sandwiches and candy. ture was pointed out by Kronsberg \"Regtilations\" of all kinds are worse Baltimore physician, has had a<br />\nyear.<br />\nthe doctor of philosophy degree at<br />\nThese will be on hand for non- who extolled the export trade of than objectionable; they are dan- rather unusual career after leaving<br />\nNo Degrees Awarded<br />\nthe M. I. T.<br />\nprofiteering prices for those \"stu- this city and declared that \"Balti- gerous. I wonder often at the type Hopkins without his degree in<br />\nNo degrees are given at the inDr. Kraus was, in 1908, consultmore will thrive because it has lead- of a mind a man must have who<br />\ndents whose girl-friends claim im1926.<br />\nstitution. Anyone can attend the<br />\ning chemist for the United States<br />\ners<br />\nwho have foresight.\"<br />\nthinks he is wise enough to dictate<br />\nReturned To Hopkins<br />\nmunity from \"packing\" lunch on<br />\npublic lectures and work in the Bureau of Mines,<br />\nduring 1918-19,<br />\nAfter spending several years<br />\nCrane assured the audience that to others how they should conduct<br />\nthe ground that they are free ecolaboratories without paying any in the Chemical Warfare<br />\nService.<br />\nthe outskirts of the city will be ex- themselves. It presupposes unlim- away from the University he renomic agents.<br />\nregistration fees.<br />\nSince 1922 he has been active in<br />\ntended<br />\nand pictured Baltimore as ited conceit and other most unpleas- turned to Hopkins to complete his<br />\nThere are adequately furnished<br />\nProfessors, to be appointed to the Fixed Nitrogen Research<br />\nLabthe<br />\ngreatest air terminus. It will be ant qualities. I hope I shall never work in biology under the New<br />\nfaculty, need have no academic de- oratory, conducted by the govern- bath-houses at Mago-Vista to accommodate the party in dressing the largest city of the Atlantic sea- have to associate them with the Plan. He will receive his degree in<br />\ngrees, yet it was explained ,they ment.<br />\ncollege students of Johns Hopkins. June.<br />\n(Continued on page 3, col. 2)<br />\nfor the evening's dance. The dance<br />\nmust be eminent in the field of<br />\nAmong the six major scientific<br />\nHamburger entered the Johns<br />\nstudy in which he is to lead the re- organizations to which he belongs will be held in the Ballroom-ByHopkins<br />\nin 1924, it was learned.<br />\n(Continued<br />\non page 4, col. 1)<br />\nsearch workers at the college. Ir- are the Washington Academy of<br />\nThe erratic course of study of<br />\nrespective of their degrees, or the Sciences and the American ChemiMichelson has frequently been a<br />\nuniversities from which they were<br />\ncal Society.<br />\nsource of amusement to his friends.<br />\ngraduated, men are elected to the<br />\nA member of Phi Lambda Upprofessorships at the College de silon and<br />\nDr. Charles R. Lanman, One Of Gilman's \"First Twenty Setting forth to undertake studies<br />\nSigma Xi, Dr. Kraus is<br />\nthat would qualify him for enPrance.<br />\nFellows\" Reminiscences In Letter To<br />\nalso a fellow in the American Hopkins Singers Will Participate<br />\ntrance<br />\nto a medical school, he deChairs Not Permanent<br />\nAcademy<br />\nof<br />\nArts<br />\nSciences<br />\nand<br />\nand<br />\nJohns<br />\nHopkins<br />\nLibrarian<br />\ncided<br />\nafter<br />\nhis first year at Homemaintained<br />\nThe chairs<br />\nat the inIn Contest Among Colleges<br />\nin<br />\nthe<br />\nNational<br />\nAcademy<br />\nof<br />\nSciwood<br />\nchange<br />\nto<br />\nover to the Arts<br />\nstitution are not permanent, said<br />\nOf Maryland<br />\nOne of the oldest living former<br />\nWilliam Dwight Whitney and<br />\nences.<br />\nSciences<br />\nand<br />\ncurriculum.<br />\nbr. Chinard. No replacement of<br />\ninstructors of the Johns Hopkins Francis James Child were his sponMade Many inventions<br />\nAgain Studied Medicine<br />\nArrangements have been made University,<br />\nchair, vacated by the death of the<br />\nDr. Charles R. Lan- sors, he said, when President Eliot<br />\nTwo more years, however, found<br />\nchemist's<br />\nThe<br />\ninventions<br />\nhave<br />\nGlee<br />\nClub<br />\nJ.<br />\nhave<br />\nthe<br />\nU.<br />\nH.<br />\nto<br />\nProfessor in that particular subject,<br />\nman, now professor of Sanskrit at considered the matter of calling a him again pursuing premedical<br />\nIs made. However, efforts are made been many relating to electrical ap- sing several Hopkins songs at the the Harvard University, and one man to the Cambridge<br />\ninstitution courses until his graduation last<br />\nto substitute a chair by a new paratus, glasses, and chemical proc- Century Theatre's 8.30 .perform- of Daniel Coit Gilman's \"First as professor of Sanskrit.<br />\nJune. This year he did advanced<br />\nesses.<br />\nance tonight, which has been termed Twenty Fellows\",<br />\ncourse.<br />\nhas \"rowed about<br />\nFurnivall Was Oarsman<br />\nwork in biology in order to obtain<br />\nLectures in the Dohme series for by the theatre authorities as \"Hop\"A great deal of leisure for re\"By the way\", Dr. Lanman sufficient credit for entrance<br />\nten thousand miles on the Charles<br />\ninto<br />\nculminate<br />\nnext<br />\nacademic<br />\nthis<br />\nyear<br />\nkins Night\", it was revealed by River\" and<br />\nsearch work is given\", said Dr.<br />\nproposes to keep it up wrote, \"you know that Child's dear the medical school.<br />\nweek<br />\nBanD.<br />\nwhen<br />\nWilder<br />\nDr.<br />\nBruce Peake, president of the Mu- as long as<br />\nChinard, who added that many<br />\nhe can, and that despite friend, Frederick James Furnivall,<br />\nHe is the son of Dr. R. A. Michgreat scientists that the world has croft, of Cornell University, will sical Club recently.<br />\nthe fact he is now almost 81 years was an oarsman and kept it up into elson, a professor in the Hopkins<br />\nFeaturing what is known as old,<br />\nknown have come from the French appear at Homewood.<br />\nhe wrote in a letter to Dr. John the ninth decade of life. Since the medical school.<br />\nGomberg,<br />\nDr.<br />\nMoses<br />\nof<br />\nUnithe<br />\n\"Collegiate<br />\nWeek\", the Century C. French,<br />\ninstitution.<br />\nLibrarian at Home- dam was built here, I have rowed<br />\nSadusk entered Hopkins in<br />\nversity of Michigan and president has invited several Maryland colNet All Invited<br />\nabout ten thousand miles on the 1929 from Loyola College. Since<br />\nwood, last week.<br />\nNot all American universities of the American Chemical Society leges to participate in a contest to<br />\n\"As you hint\", he wrote, \"the Charles River and propose to keep then, he has been engaging in rehave been invited to send represen- lectured at the Hopkins on April 24. secure the \"Mammoth Magaphone\"<br />\nuniversity grows so fast now-a- it up as long as I can. I am almost search in Quantitative Analysis<br />\ntatives to the centenary celebraoffered to the college making the days<br />\nthat the problem of personal 81\".<br />\nunder Dr. William M. Thornton.<br />\ntion of the college, it was said. The<br />\nHomeliest Contest<br />\nbest \"showing\" on the night as- acquaintance<br />\nIn April, Dr. French received a He will publish a paper shortly<br />\nis becoming almost an<br />\nin<br />\nCollege de France officials have seOhio State University, according signed it. A particularly appropriletter from Dr. Lanman in which the American Journal<br />\nlected only a choice group of inter- to the Lehigh Brown and White is ate stage show, \"Let's Go Collegi- insoluble one! Alas!<br />\nof Science<br />\nWhitney and Child His Sponsors<br />\nthe Harvard man commented on on the use of Cromousulphate<br />\nas<br />\nnationally noted research institu- conducting a contest to uncover ate\", is to be presented. \"Tarnish\"It's fifty-one years ago this the requests which have been made<br />\na reducing agent in the volumetric<br />\ntions from which to request dele- the homeliest mechanical engineer- ed Lady\", starring Tallulah Bank- month that I began work here<br />\nfor \"some photographs of my determination of iron.<br />\ngates to the event in Paris.ing student on its campus.<br />\nhead, will be shown on the screen. (Harvard) as a professor\".<br />\nDr. Gilbert Chinard, professor<br />\nof French literature, and Dr. Arthur 0. Lovejoy, professor of philosophy, both of the John Hopkins<br />\nUniversity, were named by the<br />\npresident of the Hopkins to represent the University at the fourth<br />\ncentenary celebration of the founding of the College de France, at<br />\nParis on June 18.<br />\n• At the initial meeting to be held<br />\nin connection with the celebration,<br />\nthe President of the French Republic will welcome the delegates from<br />\nthe various institutions throughout<br />\nthe world. Speeches are to be delivered by many of these delegates,<br />\nit was announced.<br /><br />\nUnder Lectureship<br /><br />\ninitial festivities of June Week. It<br />\nis just above Gibson Island and has<br />\nbeen chosen as the locale of the<br />\nbeach party. Since the beach is<br />\nabout 18 miles from Baltimore,<br />\nbuses will be provided for those<br />\ncouples who are not able to go out<br />\nby automobile.<br />\nThe party will leave the campus<br />\nabout 2 o'clock on the afternoon of<br />\nWednesday, June 3rd, and will<br />\nspend the afternoon, sponsors assert, either bathing or building<br />\nsand-castles. Those pleasure-seekers who are inclined to be restless,<br />\nit is said, will be furnished with<br />\nseaworthy canoes and row boats.<br /><br />\nGilman's Colleague Has Rowed<br />\nGLEE CLUB INCLUDED 'About 10,000 Miles' On River<br /><br />\nIN THEATRE PROGRAM<br /><br />\n(Continued on Page 3, col. 3)<br /><br />\n(Continued on page 2, col. 2)<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 8, 1931<br /><br />\n2<br /><br />\nDirecting -minds are deemed more important than buildings and endowments, although equipment is necessary and financial support must be duly<br />\n--By A Freshman<br />\nsought.\"<br />\nFounded 1897<br />\nIn closing, Mr. Shaw points out that<br />\nabout the marking system—its merUniversity from its beginning has<br />\nthe<br />\n$2.00<br />\nSubscription<br />\nadobjects—the<br />\nhad in view two main<br />\nits and its fauls; about the attemptINGED. time glides on invancement of learning through insale of the Homewood tract of<br />\ned<br />\nEntered as second-class matter Decem- vestigations conducted by its teachers<br />\nus;<br />\ndeceives<br />\nand<br />\nsensibly,<br />\nBaltiin<br />\nPostoffice<br />\nthe<br />\nat<br />\nber 3, 1909,<br />\nland; about the honor system, about<br />\nmore, Md., under the Act of Congress No- and its properly qualified students and<br />\nand there is nothing more<br />\nvember 3, 1879.<br />\nFreshman regulations, about the<br />\nthe communication of learning<br />\nfleeting than—a year. In other athletic problem and football, and,<br />\nthrough carefuly planned courses of<br />\nfreshman's<br />\nPublished semi-weekly from October to instruction. He further points out that words, the Hopkins<br />\nmost recently, about the assemblies.<br />\nJune by the Students of Johns Hopkins<br />\ngone in a<br />\nhas<br />\ncollege<br />\nat<br />\nyear<br />\nis<br />\nthe<br />\nfirst<br />\nInstitution<br />\nHopkins<br />\nnew<br />\nthis<br />\nUniversity.<br />\nBut our apparently vigorous<br />\nembodiment of both of these sought- flash. And what a year it has been.<br />\ngot us into a lot of trouthinking<br />\nafter views and shows that the facili- \"Things\" have happened so fast,<br />\nBusiness communications should be adthe first time, I think, we<br />\nFor<br />\nble.<br />\ndressed to the Business Manager, Johns ties that it provides and its methods<br />\nsuccession that<br />\nHopkins University. All articles should of administration are intended both and in such quick<br />\nbegin\" the process of<br />\nto<br />\n\"began<br />\nbe sent to the Managing Editor; other<br />\ncommunications to the Editor-in-Chief.<br />\nfor the encouragement of researth, the mind has had little time to grasp changing from the high school boy<br />\nand for the discipline and guidance of the meaning of them.<br />\nto the college man.<br />\nBelmont 8778 those whose chief concern is the acTelephone<br />\nWay last October—it seems just<br />\nquisition of knowledge.<br />\nIII<br />\na fortnight ago—we went through<br />\nAlbert Shaw has had many close<br />\ntrying serious—yet amusing,<br />\nE TOOK it upon ourselves<br />\nconnections with the Johns Hopkins the<br />\nEDITORIAL DEPARTMENT<br />\nbeof<br />\ntask<br />\ng<br />\nembarrassin<br />\noften<br />\nand<br />\nto try to solve these seriUniversity, being at one time a student<br />\nEditor-in-Chief<br />\nexnew<br />\na<br />\nwith<br />\nacquainted<br />\nHe<br />\nwas<br />\ncoming<br />\nin this institution of learning.<br />\nour problems right on the<br />\nRowland McD. Ness, '32<br />\nin residence in 1882-3-4 and received perience in life. And our progress, spot. Of course, in the eyes of the<br />\nManaging Editor<br />\nthe degree of Ph.D. in History in 1884. indeed, was very encouraging at<br />\npublic, faculty, and upper classmen<br />\nSylvan Lebow, '32<br />\nAt a later date, namely 1891-2, he<br />\nweeks be- we did a number of glaringly dawntwo<br />\nhardly<br />\nwas<br />\nIt<br />\nfirst.<br />\na course of lectures at the Uniourselves fool things. I am inclined to agree<br />\nAssistant Managing Editors<br />\nversity on \"Municipal and Social fore we had mastered<br />\nHerbert L. Friedberg, '33<br />\nreally with the said groups of people. The<br />\nto<br />\nable<br />\nsufficiently to be<br />\nHyman Levin, '34<br />\nProblems.\"<br />\neffi- fact that we got no results is added<br />\nvery<br />\nand<br />\n\"loaf\" luxuriously,<br />\nAssociate Editors<br />\nefpossible<br />\nciently (with the least<br />\nHarold B. Yudkin, '32<br />\nevidence. We got the idea—maybe<br />\nNathan M. Harris, '32<br />\ntwo<br />\nBy<br />\nfort) in Levering Hall.<br />\nit's a hang-over from the Chartists'<br />\nexplored<br />\nthoroughly<br />\nhad<br />\nwe<br />\nweeks<br />\nmovements in England—that signJunior Editors<br />\nMarion Grove, '33; Sanford SarneY,<br />\n, the mysterious and puzzling pas- ing petitions would make matters<br />\n'34; Jerome Blum, '34; Raymond Dunn, Hamburger, Myers,<br />\nMichelson, sage-ways—with the dead animals, better. It finally got so bad that<br />\n33; Donald Proctor, '33; Jack Greenfield, '33; Samuel M. Doctofsky, '34; Ferrigan, Hanselman, Larkin, and whales, and butterflies all laid<br />\nthe petitions were worthless—I beSadusk, are Named<br />\nNorman Heaney, '34; Mordecai EdelBiologithe<br />\ncoffins—in<br />\nglass<br />\nout<br />\nin<br />\nlieve they were from the beginning. I'<br />\nman, '34; Marlowe Perry, '32; Bernard<br />\n(Continued from page 1, col. 6)<br />\nVerlin, '33.<br />\ncal Laboratories. It took us less It became a habit for some of the<br />\nHe is a member of the varsity than two weeks to find out why<br />\nfreshmen to get out their pens every<br />\nBUSINESS DEPARTMENT<br />\ntrack team.<br />\nRemsen \"smells bad\", and that the Monday morning and sign the<br />\nBusiness Manager<br />\nWorked for Chemistry<br />\nHopkins buildings are as dark and newest and latest petition. We also<br />\nDavid Sykes,'32<br />\nBringing an A. B. degree from dreary on a rainy day as a tobacco<br />\nAdvertising Manager<br />\nmade fools of ourselves, and injured<br />\nOberland College in Ohio, Hansel- barn in Southern Maryland, and<br />\nIsadore C. Gutman, '32<br />\nthe present reputation of the UniCirculation Manager<br />\nman began research work in the that the Memorial room in Gilman<br />\nversity in the public's eye by getEdgar Blumstein, '34<br />\nDepartment of Chemistry in 1931. is a sacred place, and that the liting ourselves suspended, and by<br />\nOffice Manager<br />\nMyers prepared himself for medi- brary is really available for freshacting like hoodlums at an openMaurice R. Chassin, '33<br />\ncal study after spending some time men. We were, after a few weeks,<br />\nforum assembly.<br />\nCharles Ney, '33; Wm. N. Myers, '33; in graduate work in engineering,<br />\njust becoming used to dormitory<br />\nMorton Rome, '33; George Landau, '34;<br />\nBut this is quite unnatural. I<br />\nWilson Rutherford, '31; Abram Burk, while Larkin has been working in life, to dry lectures, to the drinkshall condemn my fellow freshmen<br />\n'34; Victor Frenkil, '34; David Gutman, advanced physics for several years.<br />\ning fountains, to the sergeant's ges- no longer.<br />\n'34; George Baylin, '31; Leonard Harris„ '34; George Lamont, '32.<br />\ntures, to the Y. M. C. A., to the<br />\nIV<br />\nbotanical gardens, to the cinder<br />\nCo.,<br />\nProduced by the R. L. Polk Printing<br />\nroads, to—well, everything that<br />\nHE POINT I am driving at<br />\n1930 Clifton Ave., Baltimore, Md.<br />\nINTERCOLLEGIATE was new, and that seemed very inis easily summarized in a few<br />\nNEWS<br />\nteresting at first. And I must adsentences. We entered this<br />\nmit that there are some things University as school boys. We beA strange case, baffling to legal which we promising young men came acquainted with the material<br />\nauthorities, came to light on and have not been able to accomplish peculiarities of college life in the<br />\naround the campus of the Univer- yet: we haven't been able to keep first half year. Just think, a whole<br />\nsity of Minnesota. One of the stu- up with the bulletin boards; we half year to get acquainted. FiThe Institute of Law<br />\nhaven't learned to sing the—oh, yes, nally, just after the exams, the allTwo articles of great interest to all dents was arrested for selling penUniversity Ode. But on the important process of becoming colthe<br />\nHopkins men appear in the current nants at a football game without a<br />\nn by and large (as one lege men—had just started. And<br />\nwhole—take<br />\nThe<br />\nReviews.<br />\nof<br />\nReview<br />\nissue of The<br />\nlicense. The case promised to have<br />\nfirst, \"A Challenge to Capitalism,\" numerous interesting ramifications, professor will say)—we made re- when we started changing, we tried<br />\ntaken from an address delivered by the student pleading his own cause. markable progress those first few<br />\nto overdo it—a natural thing to do<br />\nMr. Daniel Willard, the president of<br />\nunder such circumstances. And as<br />\nThe verdict of \"not guilty\" was weeks.<br />\nthe Board of Trustees, on March 27<br />\na result, we not only did not acbefore the Wharton School of Finance finally submitted, whereupon the<br />\nII<br />\nand Commerce, at the University of go-getting young man turned<br />\ncomplish anything, but we got ourPennsylvania, has been discussed in the around and sold one of the penVERYTHING went on selves hopelessly entangled in the<br />\ncolumns of this paper.<br />\nnants to the recorder.<br />\nsmoothly for a while — we task of solving these unsolvable<br />\nThe second article, \"Research in<br />\n*<br />\n*<br />\n*<br />\nfreshmen were thoroughly problems. But the most important<br />\nLaw and Justice,\" by Albert Shaw, the<br />\neditor of The Review of Reviews, is<br />\nCoach Lattig, up at dear old Le- enjoying our college life with its thing is, in my opinion, that we are<br />\na distinct compliment to Hopkins fame high, changed the lacrosse practice occasionl thrills. But along came not yet college men, although we<br />\nfrom a recognized authority.<br />\nfield from Taylor to Steel Field, the Christmas holidays. The nov- think we are. To interprst the deDr. Shaw states that we \"are carrya student in a world- plorable condition in anothN way:<br />\ning the Hopkins tradition and method because the ground was too hard elty of being<br />\nfamous institution soon wore off it has taken us freshmen a year to<br />\nof research into unexplored fields of at the former.<br />\n* * *<br />\nlaw.\" The editor quotes a tribute<br />\naround the home town. And when get well started in the process of<br />\nby<br />\nLaw<br />\nmade of the new Institute of<br />\nEditorial comment on the above it was time to come back to Balti- becoming college men.<br />\nthe famous Dr. William H. Welch,<br />\nDoes this condition have to exappearing in the Brown and White, more, we were quite tired of \"colone ?f. the \"Four Doctors\":<br />\nfunny part is that, ist? Does every freshman class of<br />\n\"As one actively interested for near- the journal of the babes of Beth- lege life\". The<br />\nto go<br />\nly half a century in the preservation lehem, was to the effect that \"steel\" although we thought we were vet- the years to come have<br />\nthat<br />\nexperiences<br />\nsame<br />\nlearned<br />\nthe<br />\nnot<br />\nthrough<br />\nhad<br />\nwe<br />\nand development of those ideals of is harder than mere \"ground\".<br />\neran collegians,<br />\nis<br />\nThere<br />\nthrough?<br />\nscientific research upon which the<br />\nbeen<br />\nhave<br />\nis.<br />\nreally<br />\nlife<br />\nwe<br />\n* * *<br />\nwhat college<br />\nJohns Hopkins University was<br />\ncollege<br />\nour<br />\nwith<br />\nwrong<br />\nrequired<br />\nsomething<br />\nenergy<br />\nThe Purdue Exponent carries a , Of course, the<br />\nfounded, I welcome the establishment<br />\nexams, and try- system somewhere. Isn't there<br />\nof the Institute of Law. In subject sour note stating that according to for worrying about<br />\nto prematter and methods of investigation Dr. Kotchnig, a Swiss lecturer, ing to keep up the social activities something that can be done<br />\nand<br />\ntime<br />\nof<br />\nloss<br />\na<br />\ndizzy<br />\nvent so great<br />\nthere may be little analogy between drinking is muA more prevalent on a favorable level with the<br />\ninstithe<br />\nof<br />\nthe law and the sciences of nature, inexpense<br />\nus energy at the<br />\namong American than European pace we set at Christmas, left<br />\ncluding biology and medicine. But the<br />\nexams,<br />\ntution—just in making college men<br />\nthe<br />\nafter<br />\nBut<br />\nexhausted.<br />\nproblems presented are of the utmost undergraduate students. The worst<br />\ntime to do out of a group of freshmen?<br />\nhuman interest and importance, and of it is that the sour note in ques- we had the ability and<br />\nyet no<br />\nI, as a freshman, am absolutely<br />\nthinking,<br />\npowerful<br />\nscisome<br />\nsame<br />\nthe<br />\nwith<br />\nmay be approached<br />\ntion is not fully appreciated until<br />\nentific spirit, the same unbiased, objec- the morning after.<br />\nexams were available to relieve the helpless ip trying to think of a soto<br />\ndesire<br />\nsame<br />\ntive mental attitude, the<br />\nlution—I am far too undeveloped<br />\npressure.<br />\n* *<br />\nattain the truth, and the same joy in<br />\ninexperienced<br />\nThen it was when we took a de- mentally, far too<br />\nTraffic violations at Ohio State<br />\nthe search for truth.\"<br />\nmy own<br />\nanswer<br />\nto<br />\ntry<br />\nto<br />\nlife<br />\nwith<br />\nIn discussing its formation and the are judged and punished by a stu- cisive turn in college life. We behumand<br />\nrespectfully<br />\nI<br />\nquestions.<br />\nmanner in which it is going about its dent court. Yes, we mean the Uni- gan thinking about various probthe<br />\nto<br />\nover<br />\nproblem<br />\nthe<br />\nhand<br />\nsays:<br />\nbly<br />\nShaw<br />\nMr.<br />\nwork,<br />\nlems which are confronting the<br />\n.<br />\n• \"In a quiet and unostentatious way versity, not the penitentiary<br />\nsolution.<br />\ntheir<br />\nfor<br />\nintellectuals<br />\nUniversity. We began thinking<br />\n* * *<br />\nthe new Institute of Law of Baltimore<br />\nis in touch with the various agencies<br />\nThe College of France, founded<br />\nCo-Eds At Southwesten<br />\nfor judicial reform and improvement by Francois I, will celebrate its College Man Receives<br />\nthroughout the country. Already it beon June 8.<br />\nVarsity Letter Late Drop Gowns At Dance<br />\ngins to act as a clearing house of in- four hundredth birthday<br />\n* * *<br />\nformation. It can bring the experience<br />\nOhio Wesleyan Class of 1885 Base- Yes, They Attend Affairs Wearing<br />\nof one state to the aid of revision and<br />\nAnother liberal dean has been<br />\nPajamas, Shorts, Veils, and the<br />\nball Players Has Just Received<br />\nLike, Reported<br />\nreform in another.\"<br />\nEfforts<br />\nfor<br />\nLetter<br />\nrumor<br />\nso<br />\nanyway,<br />\nor,<br />\ndiscovered—<br />\nHe then goes on and shows the need<br />\nOne of the members of Ohio<br />\nshe?—of HunCo-eds at So'western wear pafor such an institution and the good has it. He—or is it<br />\nrejust<br />\n1885,<br />\nof<br />\nclass<br />\nWesleyan,<br />\nnot<br />\nter College opines that girls do<br />\njamas, shorts, and veils when they<br />\nthat it will be able to bring about.<br />\nIn speaking of the founding of the get enough parties, nor do they go ceived a varsity letter for baseball. attend dances, a Presbyterian minInstitute, he says: r.<br />\nout enough, and, furthermore, He played on the team while he was<br />\n\"In organizing the Institute of Law, they spend too. much time study- a student there. Well, better late ister bemoans. Or is it reminiscdeference has been shown to the tradimg ?<br />\nthan—Hell! How trite.<br />\ntions of the Johns Hopkins University. ing.<br /><br />\nMeditations On the Freshman<br /><br />\nTHE NEWS—LETTER<br /><br />\nESTABLISHED 1818<br /><br />\ngfe-e96<br />\nCLOTHING<br />\ns0<br />\nIrii<br /><br />\nW<br /><br />\nIN0,<br /><br />\nMADISON AVENUE COR. FORTY-FOURTH STREET<br />\nNEW YORK<br /><br />\nOur Representative will be at the<br />\nSOUTHERN HOTEL<br /><br />\nThursday, Friday and Saturday<br />\nMay 7, 8 and 9<br />\nIllustrations of Shoes<br />\nSent on Request<br />\nBRANCHES<br />\nNEW YORK: ONE WALL STREET<br />\nBOSTON: NEWBURY COR. BERKELEY STREET<br />\nPALM BEACH<br />\nNEWPORT<br /><br />\ngave<br /><br />\n7 J.H.U. STUDENTS<br />\nADMITTED TO MED.SCHOOL<br /><br />\nKIN W. LEE<br /><br />\nTHE RELIABLE WEAVING CO.<br /><br />\nCHINESE HAND LAUNDRY<br />\nFirst Class Work<br />\n2815 Greenmount Ave.<br /><br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br /><br />\nSpecial Attention Given to Students<br /><br />\nOPERATE IT YOURSELF<br /><br />\nRENT A CAR<br /><br />\nThe Auto Rental Company<br />\n,Cars for Hopkins Students<br />\nDeposit Not Required<br /><br />\n111 W NORTH AVE.<br /><br />\n2125 HARFORD AVE.<br />\nPhone, Wolfe<br /><br />\n1413<br /><br />\nTHE NORTH INN<br />\n3 EAST NORTH AVENUE<br />\nev•<br /><br />\nThe Meeting Place For College Men<br />\nAfter the Game or the Dance<br /><br />\nEDITORIALS<br /><br />\nE<br /><br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br /><br />\nWork Called for and Delivered<br /><br />\nY•747Y<br /><br />\n\"Food Prepared the Right Way\"<br /><br />\nRepairing<br /><br />\nKIBLER'S<br /><br />\nEngraving<br /><br />\nJEWELER and OPTICIAN<br />\n3222 Greenmount Avenue<br />\n5409 Harford Avenue<br />\nNearest Jeweler to the Campus<br /><br />\nNEW<br /><br />\nFORD<br /><br />\nUSED<br /><br />\nAutomobiles<br />\nTHE BACKUS MOTOR COMPANY<br />\n10-20 E. North Avenue<br />\nVernon 4300<br /><br />\nLet Bill Triplett show<br />\nyou Katz Clothes--with<br />\nstyle that sells itself!<br /><br />\n*:OTHES<br /><br />\n211-213 E. Baltimore St.<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 8, 1931<br /><br />\nHEANEY, FRESHMAN, Gilm,an's Colleague Has Rowed<br />\nWINS THOM CUP 'About 10,000 Miles' On River<br />\nFRIDAY NIGHT TEST LAST NIGHT Dr. Charles R. Lanman, One of Gilman's \"First Twenty<br />\nTo<br />\nis<br /><br />\nFellows\" Reminiscence In Letter<br />\nJohns Hopkins Librarian<br />\nWinner<br />\nJudges Declare Him<br />\nIn Extemporaneous SpeakAContinued from page 1, col. 5)<br />\nof the Tech, recognizing that GilContest Held In Levering face\". Accordingly, he remarked, man was the first to start a real<br /><br />\nJohns Hopkins<br />\nhe had eighteen \"struck off\" in or- university in our country—you'<br />\nboard and the chief center of cul- der to supply part of the demand. would feel how true it was that the<br />\nNight<br />\nture, he asserted.<br />\n\"I am thinking that you too may<br />\nundertaking<br />\n(Continued from page 1, col. 3)<br /><br />\nAT LOEW'S<br /><br />\nCENTURY<br />\nTHEATRE<br />\nGALA<br /><br />\nCollegiate Week<br />\nShow<br /><br />\nSTAGE TREAT<br /><br />\nNINA<br /><br />\nOLIVETTE<br />\nand CHESTER<br />\nFREDERICKS<br />\nin<br /><br />\n\"Let's Go<br />\nCollegiate\"<br />\nWith A Big Cast<br />\nof<br />\nCAMPUS CUT-UPS<br /><br />\nON THE SCREEN<br /><br />\nTo •Seidler, Baltimore will be a<br />\ncommunity, a century from today,<br />\nof happy homes, with citizens who<br />\nwill have enough income to see<br />\ntheir selves through life adequately. He also hoped for no unemployment in 2031.<br />\nThis age of individualism will be<br />\nfollowed by an age of a derogatory<br />\nnature, said Wasserman.<br />\nVisualizes Bigger Campus<br /><br />\nLockard expressed his hope for<br />\nwider streets, vast skyscrapers and<br />\nextenive development of the Johns<br />\nHopkins campus.<br />\nThe only difference that will be<br />\nevident, it was said by Herman,<br />\nwill be in political views. Bussey,<br />\nin his talk, said that Baltimore will<br />\nundoubtedly maintain her old<br />\nquaintness.<br />\nPowell visualized government<br />\ncontrol of almost everything and<br />\nasserted that the greatest social<br />\nproblem with which people in 2031<br />\nwill have to contend is the problef of eugenics. The institution of<br />\nmarriage will have disappeared,<br />\nPowell said.<br />\nBaltimore will be no Utopia, but<br />\nwill remain the same conservative<br />\ncity that it is now, believes Dorfman.<br /><br />\n\"IT\" GIRL<br />\nTALLULAH<br />\nBANKHEAD<br />\nin<br /><br />\n\"Tarnished<br />\nLady\"<br />\nMeet Your Friends<br />\nat<br /><br />\nLOEW'S<br /><br />\nCENTURY<br />\nFRIDAY NIGHT<br /><br />\nNew Yale Law Building Posters of Co-Ed In<br />\nWill Be Opened Soon Barrel Tabooed at N.W.<br />\nPlant, Block Long, Costing $2,500,000, Dean of Women At Northwestern<br />\nUniversity Orders 200 Portraits<br />\nGiven By Trustees of Sterling<br />\nPrivately Burned<br />\nEstate<br /><br />\nMANHATTAN SHIRTS—SCOTCH SPUN<br />\nNECKWEAR—INTERWOVEN HOSE<br /><br />\nMcPherson's<br />\n11 East Baltimore Street<br /><br />\n\"The Store of Standard Value\"<br /><br />\nSeeking a Position?<br /><br />\nJ. H. FLJRST CO.<br />\nPRINTERS OF<br />\nPhilological and Scientific<br />\nPublications<br /><br />\nWe are receiving inquiries daily for<br />\nteachers<br />\nTHE BALTIMORE TEACHERS<br />\nAGENCY<br />\nWilliam K. Yocum, Manager<br />\nTitle Annex Bldg.<br />\nPlaza 1195<br />\nBaltimore, Md.<br /><br />\n12-20 Hopkins Place, Baltimore<br /><br />\nMILESTONE SYSTEM<br />\nDRIVE IT YOURSELF<br /><br />\nNo Deposit Required of Hopkins Students<br />\nCoupes<br />\nRoadsters<br />\nSedans<br /><br />\n.........<br /><br />\nBuicks<br />\nFords<br />\nChryslers<br />\nHupmobiles<br />\nChevrolets<br /><br />\nOn the campus of the NorthThe Yale Law School is to soon<br />\nNo Hour Charge at any Time<br />\nput into service its new home, to be western University, in Evansville,<br />\nknown as the Sterling Law Build- Illinois, posters which depicted a<br />\nLIGHT AND LOMBARD STREETS<br />\nsmiling co-ed clad only in a barrel<br />\ning.<br />\nPLaza 6000<br />\n2402 Pennsylvania An.<br />\n1725 N. Charles St.<br />\nDiscusses Writers<br />\nThe plant covers a full city block were officially tabooed by the uniLafayette 2000<br />\nVernon<br />\n4049<br />\nIn his De Tocqueville contest<br />\nin New Haven, Connecticut, an I. versity authorities, said an InternaBaltimore Concedes Milestone Supremacy<br />\npresentation, Yudkin discussed the<br />\ntional News Service story.<br />\nN. S. story reported.<br />\nwritings of Alex De Tocqueville<br />\nand their influence on French history.<br />\n\"In his Democratic en Amerique,\" said Yudkin De Tocqueville,<br />\nthe practical idealist, wrote about<br />\nAmerican demoracy but his heart<br />\nwas in France. His book was an<br />\nimportant stepping stone in the<br />\n0 •<br />\npath which finally led to the Napoleonic contests.\"<br />\nLouis Kroll, the second speaker<br />\nA vacation abroad ... and only three weeks (or less) away from home has now<br />\nin the lecture test, declared: \"Although the Franco-Prussian War<br />\nbeen made possible by the two fastest liners afloat and the fastest world cruiser<br />\nappears to be a blot on French history, the terrible year from July,<br />\n1870, to June, 1871, revealed more<br />\nthan any other event the great<br />\ncourage and patriotic spirit of the<br />\nFrench people.\"<br /><br />\nshod /rip and a ffierrq one •<br /><br />\nFrench Hated War<br /><br />\nThe NEW<br /><br />\nstart of the Baltimore<br />\nlike to have one of them in your was a real event in the history of<br />\nlibrary file\", he wrote.<br />\nAmerican education.\"<br />\nKnew Murray Personally<br />\nIn thanking Dr. Lanman for his<br />\nIn referring to the \"First TwenDr. French wrote: \"I<br />\nphotograph,<br />\nty Fellows\" of the Johns Hopkins<br />\ninto our records all<br />\nto<br />\nget<br />\nglad<br />\nam<br />\nUniversity in 1876, Dr. Lanman.<br />\nabout the first<br />\ninformation<br />\npossible<br />\ndeclared:<br />\nalong mycame<br />\nI<br />\nfellows.<br />\ntwenty<br />\n\"That 'First Twenty' includes<br />\nnone<br />\nwhen<br />\nnineties,<br />\nthe<br />\nlate<br />\nin<br />\nself<br />\nWalter Hines Page, Josiah Royce,<br />\nheld<br />\ndays<br />\nthe<br />\nspirit<br />\nof<br />\nearly<br />\nof<br />\nthe<br />\nHenry Baxter Adams, Henry Carwas<br />\nUniversity<br />\nand<br />\nwhen<br />\nthe<br />\nover<br />\nter Adams, Ernest Sillier, and so<br />\nopample<br />\nhad<br />\nso<br />\nsmall<br />\nthat<br />\nwe<br />\nstill<br />\non. Of course, your predecessor,<br />\nother.\"<br />\nto<br />\nportunity<br />\nknow<br />\neach<br />\nNicholas Murray, brother of PresiDr. Lanman's philosophy of life<br />\ndent Murray Butler's mother, and<br />\nis,<br />\nDr. French said, to carry on<br />\nher other brother, Thomas Chalnever turn<br />\nmers Murray, I knew well, person- with a stout heart, to<br />\nof life; and<br />\nally. Those were great days, I can backward in the work<br />\nto maintain the three \"sovereign<br />\nanswer you.<br />\nblessings\", faith, study health, and<br />\nJ. II. U. Starts Historical<br />\nstrong and hopeful courage.<br />\na<br />\nthe<br />\nheard<br />\nhave<br />\ncould<br />\nyou<br />\n\"If<br />\nHe was from 1877 to 1880, aslike<br />\nmen<br />\nby<br />\nGilman<br />\ntribute paid to<br />\nin Sanskrit at the Johns<br />\nsociate<br />\npresYale<br />\nthe<br />\nand<br />\nPresident Eliot,<br />\nHopkins.<br />\nWalker<br />\nAmask<br />\nident, and Francis<br /><br />\nSpring Showing<br /><br />\nSaul Dorfman, the third contestant, pointed out the reasons why<br />\nthe Paris Commune of 1871 was<br />\ncreated.<br />\n\"Although the French hated<br />\nwar and had little aptitude for revolutions,\" he said, \"they willingly<br />\nfought when their liberty was<br />\nthreatened. France has now found<br />\na haven of political rest, however.\"<br />\nLea Alpert, the winner of the<br />\ndeclamation contest yesterday, presented portions of the article written by George Russell in 1914<br />\nwhich revolutionized public opinion<br />\non the strikes.<br />\nGave Roosevelt'Speech<br />\nSamuel Reichel ,the second speaker in. the Adams meet, declaimed<br />\nthe address made by Roosevelt on<br />\nMarch 13, 1905, before the National<br />\nCongregation of Mothers, \"American Motherhood.\"<br />\nThe judges in the Thom Cup<br />\ncontest last night were Mrs. Joseph France, the daughter of the<br />\ndonor of the trophy; Mrs. H. R.<br />\nM. Thom; McKee Barclay, journalist and cartoonist; and Charles J.<br />\nWilson, theatrical man.<br />\nBerry Presents Cup<br /><br />\nThe cup was presented to the<br />\nwinner, Heaney, by Dr. Edward W.<br />\nBerry, dean, who was introduced by<br />\nS. J. Egerton. T. R. Tippett, Jr.<br />\npresented the opening remarks at<br />\nthe event in Levering Hall. He<br />\neulogized the late Mr. Thom, a<br />\ngraduate of the Hopkins, and gave<br />\nthe history of the work this year in<br />\nconnection with the contest.<br /><br />\nE<br />\nUROP<br />\nWITIB<br /><br />\n*EXPRESS VACATION TO<br />\n$295. up • 18-27 days..,with 7-17 days' sightseeing in Europe.<br />\nIn conjunction with American Express Company.<br />\n*THIRD CLASS BECOMES EXCLUSIVE • The<br /><br />\nJuly<br />\n$155 and up round trip.<br /><br />\nSTUTTGART, sailing<br /><br />\n2.<br /><br />\nentire 3d Class reserved for students on the<br /><br />\nReturning on the DRESDEN, Aug. 6, or STUTTGART, Aug. 20.<br /><br />\n*SPECIAL STUDENT SAILINGS • The entire Tourist 3d Cabin reserved for students on the<br />\nEUROPA,June 20 and the BERLIN,June 25. Returning on the BREMEN, Aug. 13.<br />\n*SEND FOR BOOKLETS<br />\n57 Broadway, New York City • Telephone BOwling Green 9-3880 • or your local<br /><br />\nagent<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 8, 1931<br /><br />\n4<br /><br />\nTRACKSTERS<br />\nDunn Wins Scholarship; HOPKINS<br />\nENGAGE SWARTHMORE<br />\nTo Study At University Of Parrs<br /><br />\nJAY TWELVE TO BE<br />\nRaymond<br />\nSYRACUSE<br />\nTO<br />\nHOST<br /><br />\nVisiting Lacrossemen Are Not ExHopkins Undergraduate Is First Homewood Student To<br />\npected To Put Up Tough<br />\nGet Grant; Is Member of NEWSBattle<br /><br />\nLETTER Staff<br />\nORANGE TEAM SLOW<br />\nAfter a brief stay in Paris, the<br />\ngroup will go to Nancy in the province of Lorraine where they will<br />\ntake intensive training in the study<br />\nof the French language, literature,<br />\nhistory and customs. The University of Nancy is considered one of<br />\nthe leading provincial universities<br />\nof France.<br /><br />\nS. Raymond Dunn, an underHomewood Squad Conceded To graduate student of Johns Hop!<br />\nHave Most Powerful Group<br />\nkins and at present in his sophoOf Attack Men<br />\nmore year, has been awarded a<br />\n$1,000 scholarship for a year's<br />\nTomorrow the Black and Blue<br />\nstudy at the University of Paris by<br />\ntwelve will play host to Syracuse the Institute of International EduUniversity's lacrosse team. Due to cation.<br />\nthe home teams' renowned power<br />\nThis scholarship is one of eight<br />\nWill Enter In Summer<br />\nthe Orange twelve are not expected given to the students of the United<br />\nAt the close of the summer.<br />\nto put up any sort of tough battle. States, two of the recipients usual- Dunn will enter the University of<br />\nto France. It is the first Paris, where he will take up his<br />\nSyracuse, like most northern ly going<br />\nthis scholarship has been junior year of study.<br />\nthat<br />\ntime<br />\nteams, does not possess men with<br />\ngranted to a student of Hopkins.<br />\nDunn is 18 years of age. He was<br />\nthe experience of those who indulge<br />\nborn<br />\nof<br />\nin Mount Airy, Maryland, and<br />\nGroup<br />\nTo Be Member<br />\nin the Indian pastime down here in<br />\nDunn will be a member of the came to Baltimore at the age of 11.<br />\nour own free state. The Orange<br />\nstudy group of the University of Graduating from Forest Park High<br />\ndoes however, possess a big strong Delaware which will visit France. School in 1929, he entered the<br />\nsquad of players who can put up a He will sail July 17th, this summer Hopkins the following fall. He<br />\non the S.S. Cardonia from New has already received a scholarship<br />\n(rood battle.<br />\nYork City, it is said. The study from Johns Hopkins for 1930-1931<br />\nMaryland<br />\nTo<br />\nLost<br />\nSeveral weeks ago, Maryland en- group is scheduled to arrive at Le for having had one of the three<br />\ncountered the Orange team at Syra- Havre, France, from where the highest averages in the freshman<br />\nwill go to Paris and Ver- class.<br />\ncuse. The result was an over- members<br />\nHe is also a member of the<br />\nsailles in order to be welcomed by<br />\nwhelming 12-1 victory for the Terstaff.<br />\nNEWS-LETTER<br />\nauthorities.<br />\neducational<br />\nFrench<br />\nrapins.<br />\nThe Maryland attack found the<br />\nTries To Disprove That<br />\nSyracuse defense entirely too slow<br />\nStudents Not Farmers<br />\nresistance.<br />\nMuhlenberg College Conducts An Inof<br />\ndegree<br />\nto offer any<br />\nvestigation To Deny Sister ColConsequently, shots were made beleges' Accusations<br />\nWill Act As Adviser To Chinese<br />\nAn<br />\ninto the occuinvestigation<br />\ncould<br />\nmen<br />\ndefense<br />\nfore Syracuse's<br />\nGovernment At International<br />\npations of the parents of students<br />\nOpium Meet<br />\neven get set.<br />\nat Muhlenberg College, showed<br />\nEasy Victory<br />\nonly .05678 per cent engaged<br />\nthat<br />\n27<br />\nNATIONS MEET MAY<br />\nThis slow-moving Orange team<br />\nin agriculture. The investigation is<br />\nshould prove a good practice battle<br />\nHopkins Political Science Profes- an attempt to prove that its stufor Hopkins. Since the Jays are sor Has Served As Adviser To dents are not farmers which is the<br />\nChina Before<br />\naccusation of several of its sister<br />\nconceded to have one of the fastest<br />\ncolleges.<br />\nattack<br />\nof<br />\nand most powerful group<br />\nDr. Westel \\\\T. Willoughby,<br />\nmen of any team this year, SyraDoctor of Atheism Degree<br />\nThomas P. Stran, professor of poNearly one-half the enrollment<br />\ncuse's big defensive men may prelitical .science at the Johns Hop600 students at an anti-religious<br />\nof<br />\naftergala<br />\na<br />\nfor<br />\nthemselves<br />\npare<br />\nkins University, leaves tomorrow university in the West will this<br />\nnoon.<br />\nfor Geneva, Switzerland, to attend June receive degrees as DOctor of<br />\nWith Lorne Guild, Turnbull,<br />\nan international opium conference, Atheism. A great number of these<br />\nKelly and Darrell in form, the Jays<br />\nscheduled for May 27, in the ca- graduates are women.<br />\nmay be expected to score an overpacity of adviser to the Chinese<br />\nwhelming victory.<br />\ngovernment.<br />\nProbable line-up:<br />\nPlan To Regulate Opium<br />\nHOPKINS<br />\nSYRACUSE<br />\nEfforts will be made by the deleStude<br />\nRossman<br />\nBernard gates representing nations throughRomaner<br />\nWe<br />\nCP<br />\nMurphy<br />\nNess out the world to evolve a definite,<br />\nFD<br />\nObstud<br />\nKneip<br />\nSD<br />\nMulcahy<br />\nLang adequate plan by which to regulate<br />\nTD<br />\nBrown<br />\nBeehler<br />\nAikens<br />\nStone the opium traffic. It is the aim of<br />\nTA<br />\nPriddle<br />\nGuild<br />\nSA<br />\nD. Thiel<br />\nD. Kelly the conferees, it was said, to, curFA<br />\nMcChung<br />\nTurnbull<br />\nOH<br />\nPierce<br />\nDarrell tail the use of opium, and similar<br />\nI.H<br />\nMorris<br />\nAND<br />\nnarcotics, for purposes other than<br />\nmedicinal.<br />\nIn 1924-25 Dr. Willoughby was<br />\ncounsellor and adviser to the Chinese delegation to the International<br />\nOpium Conference at Geneva. He<br />\nMigno-Vista Chosen As Site of<br />\nserved as constitutional adviser to<br />\nHopkins June Week Beach<br />\nthe Chinese government in 1916-17.<br />\nParty<br />\nDuring the Washington Conferheld in 1921, he acted as the<br />\nence,<br />\nTO HOLD DANCE<br />\nOPPOSITE<br />\nchief technical adviser to the ChiPENNA.R.R.STATION<br />\nThose Who Like Their Romance nese delegation.<br />\nWill Go For Sail on<br />\nProfessor Since 1897<br />\nCraft<br />\nSince 1897 Dr. Willoughby has<br />\nbeen professor of political science<br />\n(Continued from page 1, col. 3)<br />\nat the Hopkins. He has also been<br />\nThe-Sea. The ballroom is very<br />\na lecturer at the George Washinglarge and will easily accommodate<br />\nton University and at Princeton<br />\nthe 700 couples which the commitUniversity.<br />\ntee believes will be present.<br />\nDr. Willoughby received his<br />\nLighting Effects Planned<br />\ndegree here in 1891 and was<br />\nPh.D.<br />\nThe lighting effects have been<br />\nto the bar in that year.<br />\nadmitted<br />\ncarefully planned and the orchestra<br />\nwill have a boat painted on canvas<br />\nas a setting. Oz Steinwald and his Arrange For Social<br />\norchestra will furnish the music.<br />\nContact At Antioch<br />\nThose couples who enjoy only<br />\nrealistic romance, will be afforded Telephone Wires Connect Men's and<br />\nWomen's Dorms at Antioch<br />\nthe opportunity to slip out for a<br />\nCollege<br />\nnocturnal sail.<br />\nIn order to promote a more intimate social contact between the<br />\nmen and women of Antioch ColColgate U. Professor<br />\nlege, a special arrangement of teleAdvises Night Shirt phone wires between the men's dorm<br />\nA pre-eminent Hotel of 1200<br />\nand women's dorm has been introDr. Laird, Psychologist, Conducts<br />\nRooms, each having Bath,<br />\nduced.<br />\nTests To Show Pajamas Prevent<br /><br />\nWILLOUGHBY TO LEAVE<br />\nFOR GENEVA TOMORROW<br /><br />\nayneaAi@nrit,11<br /><br />\nLittle Is Known of Pennsylvania<br />\nTeam's Strength This<br />\nYear<br /><br />\nCtothia&amp;...14alaneLculhvuti.<br />\n315 NORTH CHARLES STREET<br />\nBALTIMORE ... MARYLAND<br /><br />\nJAYS BEATEN TWICE<br />\nAddition of Pete Bradley To<br />\nSquad Expected To Boost<br />\nTeam<br />\nTomorrow, the Jay tracksters<br />\njourney to Swarthmore to engage<br />\nthe Pennsylvanians in a meet.<br />\nLittle is known of the strength<br />\nof the Swarthmore team this year.<br />\nLast year they won easily from<br />\nHopkins. It is reported that they<br />\nboast some strength in the hurdles<br />\nand middle distances.<br />\nSmarting under the sting of two<br />\nsuccessive defeats, the Jays are determined to break the jinx that has<br />\nfollowed their competition. The<br />\noutlook on the coming meet is<br />\nsomewhat more favorable toward<br />\nthe Hopkins aggregation than it<br />\nhas been recently. Captain Lockard will again be in shape to compete which will eliminate the necessity of \"doubling-up\" in races. The<br />\nfact that certain men had to run 2<br />\nraces last week accounted for the<br />\nloss of several points.<br />\nEssentially the same line-up will<br />\nbe sent against Swarthmore that<br />\nhas run in all the meets to date.<br />\nThe addition of \"Pete\" Bradley to<br />\nthe squad will doubtless result in<br />\nadditional points in the high jump.<br />\nBradley accounted for Hopkins'<br />\nonly points in that event in the recent meet against Catholic U<br /><br />\nST. REGIS<br />\n1815-1817 N. Charles Street<br />\nSTUDENTS MEETING PLACE<br />\nClub Breakfasts<br />\nSpecial Luncheons 50 cents<br />\nDinners 65 cents<br />\nRenowned as \"Just the Place\" for Supper<br />\nAfter the Theatre or Dance<br />\nOPEN UNTIL 3:00 A. M.<br /><br />\nSimon Ackerman Clothes<br />\nREADY TO WEAR<br /><br />\nA. JACOBS &amp; SONS<br /><br />\nWe Sell Drugs and Give Service<br />\nCall us up Belmont 5318, 5846<br /><br />\n... Tailors ...<br /><br />\nPeabody Pharmacy<br /><br />\n128 W. Fayette Street<br /><br />\nCalvert and 30th Streets<br /><br />\nSTEPPING<br /><br />\nINTO<br /><br />\nA<br /><br />\nMODERN<br /><br />\nWORLD<br /><br />\nELCOME.<br />\n)TO<br /><br />\nNEW YORK<br />\n'THE<br /><br />\nMAGOTHY RIVER<br />\nSCENE OF PARTY<br /><br />\nMOTEL<br />\nGOVERNOR<br />\ngINTON<br /><br />\n31E-sidLyp.7z-\"AVE,<br /><br />\nProper Sleep<br /><br />\nDr. Laird, a professor of psychology at Colgate University, recently conducted tests to pi-bye that<br />\npajamas prevented one from getting the proper sleep at night. He<br />\nsuggested a return to the night<br />\nshirt.<br /><br />\n117 Want 'No Drill'<br />\nCompulsory military training received a slight shock at Creighton<br />\nUniversity, where, out of 202<br />\nvotes cast, only 22 favored compulsory, 43 optional, and 117 \"stood<br />\npat\" for \"no drill\".<br /><br />\n\"Test it!\"<br />\nthe watchword of an industry<br />\nThe Bell System—whose plant cost more than<br />\n$4,000,000,000 and is still growing—offers<br />\nwide opportunity to the man of engineering<br />\nbent. Here he has ample scope for testing new<br />\nideas, not only in telephone apparatus development but also in manufacture,construction,<br />\ninstallation, maintenance and operation.<br />\nNo matter what his particular branch of<br />\nengineering—electrical, mechanical, civil, in-<br /><br />\nS e rvidor, Circulating Ice<br />\nWater and many other innovations ...featuring a sincere<br />\nspirit of hospitality.<br /><br />\ndustrial, chemical—his training stands him<br />\nin good stead. For \"telephone engineering\"<br />\ncalls for the broad engineering point of view<br />\nas well as specialization.<br />\nBasic technical knowledge, an appreciation<br />\nof economic factors and the ability to cooperate are some of things that count in Bell<br />\nSystem engineering. For men of this stamp,<br />\nthe opportunity is there!<br /><br />\nBELL SYSTEM<br /><br />\n`ROQM AND BATH $3UP<br />\nA<br /><br />\nNATION-WIDE<br /><br />\nSYSTEM<br /><br />\nOF<br /><br />\nINTER -CONNECTING<br /><br />\nTELEPHONES<br /><br />\nA<br /><br />"}], "field_media_file": [{"target_id": 38630, "display": null, "description": null, "target_type": "file", "target_uuid": "a7d80fcf-4d86-4a28-bb63-98d07e7e7b6e", "url": "http://digital.library.jhu.edu/system/files/2022-03/12267-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12267, "target_type": "node", "target_uuid": "c5bccfc8-9d1c-42a6-a915-491d3e14e4ed", "url": "/node/12267"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "54978062-74d7-49e1-949d-9f5f43fca53c"}]}