{"mid": [{"value": 38003}], "uuid": [{"value": "985524c8-7cde-4208-973d-956f7d0ede24"}], "vid": [{"value": 38003}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:45:21+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12571-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:45:21+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:45:21+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "MEMBER OF THE<br />\n<br />\nMI<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nVol. XXXIX—No. 21.<br />\n<br />\nr whir<br />\ntast<br />\n-=<br />\n;e<br />\nrdina<br />\nojudge<br />\n3n c<br />\n<br />\nstrip<br />\n<br />\ntal. I<br />\n<br />\nUlman<br />\n1-uest Speaker<br />\nO.D.K.Elects<br />\n<br />\n10.04115 iqopkittu Nrinairattrr<br />\n<br />\nIS THERE A DOCTOR IN<br />\nTHE HOUSE? VISIT<br />\nAn Autopsy On Naples\"<br />\nPage Two<br />\n<br />\nHOME WOOD, BALTIMORE, MD., TUESDAY, JANUARY 8, 1934.<br />\n<br />\nPrke, 5 Cents<br />\n<br />\nAmes, Former Member Of<br />\nTo Preside At 0. D. K. Assembly League,<br />\nTo Give Talk On \"Y\" Membership Drive Begins<br />\nProposed Balkan Entente<br />\nSir Herbert Ames, former Financial Director of the League of Nations Secretariat, will deliver the<br />\nSchouler Lecture next Tuesday in Latrobe Hall at 5 p. m. His topic will<br />\nbe \"The Little Entente and the Proposed Balkan Entente.\"<br />\nSir Herbert was a former member<br />\nof the House of Commons at Montreal (1904-1921) and president of<br />\nthe Volunteer Electoral League. He<br />\nhas travelled through many parts of<br />\nthe world and has made a special<br />\nstudy of social and political conditions.<br />\n<br />\njasiniqS<br />\n<br />\nonorary Activities Society<br />\nTo Initiate New Members<br />\nAt Assembly On Thursday<br />\n<br />\neaders Selected<br />\n<br />\nGroup Sets High Standards<br />\nIn Athletics, Scholarship,<br />\n1935<br />\nle ek<br />\n, keep Publications, And Societies<br />\n<br />\nkkel<br />\n<br />\nFour Seniors, Two<br />\nJuniors Inducted<br />\nInto Tau Beta Pi<br />\n<br />\nWith Levering Hall Banquet;<br />\nWill Last Until Friday Noon<br />\nPlans For Gaining 300 New<br />\nDr. Cook Lectures<br />\nDiscussed; Four<br />\nToday At 50n West Members<br />\nDivisions In Drive Group<br />\nIndian Hurricanes<br />\nPrizes To Be Given<br />\nPlant Pathologist Of Porto<br />\nRican Experiment Station Workers Turning In Highest<br />\nNumber Of Members To<br />\nTo Show Slides In Latrobe<br />\nGet Awards; 48 In Drive<br />\n<br />\nProfessor Mel T. Cook, pathologistin-chief at the Insular Experiment<br />\nLt an)<br />\nA report issued late last night<br />\nStation, Rio Piedras, Porto Rico, will<br />\nyet xi As one of the strongest links in<br />\nby<br />\nDr. E. A. Schaal. executive<br />\ngive an illustrated lecture on \"West<br />\nin<br />\nT. BAYARD WILLIAMS, JR.<br />\ni ptbthe chain of 37 chapters of the naIndian Hurricanes\" today at 5 p. m. secretary of the Hopkins Y. M. C.<br />\nPresident<br />\nA. and generalissimo of the curr troutional honorary activities fraternity,<br />\nin Latrobe Hall.<br />\n/f<br />\nJUDGE JOSEPH N. ULMAN<br />\nrent<br />\nmembership drive, announced<br />\nFeatured<br />\nin<br />\nDr.<br />\nCook's<br />\naddress<br />\nwill<br />\nthe Johns Hopkins chapter of OmiGuest Speaker<br />\n—Courtesy Sunpapers.<br />\nbe slides showing remarkable views that 39 of the undergraduates serv(Right)<br />\ncron Delta Kappa, at Thursday's asof hurricanes in full force. These will ing as campaigners had already<br />\nsembly will introduce those men<br />\npledged $131 to the fund.<br />\nreveal the extent of destruction and<br />\n)35<br />\nan,Whom they have chosen as underhavoc the hurricanes are able to exert<br />\nFour seniors and two juniors were<br />\nEC\"elgraduate leaders and will present as<br />\nProminent In Plant Study<br />\nSplit up into four divisions, each<br />\nmale<br />\nformally initiated into the Johns<br />\nDr. Cook is very prominent as a managed by a prominent campus figfdguest speaker the prominent member<br />\nHopkins chapter of Tau Beta Pi, na- student of plant geography and plant ure, a group of Hopkins<br />\nstudents set<br />\nchrouof the Supreme Bench of Baltimore,<br />\ntional honorary engineering frater- diseases, having served in the Cuban out last night in an effort to gain<br />\nsh(*Judge Joseph N. Ulman, an alumnus<br />\nIan 0<br />\nnity, at the assembly held last Thurs- Experiment Station at Santiago members for the Y. M. C. A. Their<br />\nive.\" of the class of 1898.<br />\nday. Due to illness the scheduled (1904-1907), at the Delaware Exper- goal is set at three hundred new<br />\nWhen the laurel leaf is pinned on<br />\nspeaker, Dr. Alexander Graham iment Station (1907-1911), at the members and six hundred<br />\ndollars for<br />\nthe lapel of each initiate on Thursday<br />\nChristie, professor of mechanical en- New Jersey Experiment Station and the<br />\norganization's treasury.<br />\nMorning by the 0. D. K. president,<br />\ngineering, was unable to deliv'er the in the State Department<br />\n35<br />\n(1911-1923).<br />\nThe four divisions, each composed<br />\nslid,a•ayard Williams, it will symbolize<br />\nillustrated lecture of his trip through<br />\nHe received his degree of doctor of of three teams, are headed by Burfratereach<br />\nby<br />\nthe<br />\nrecognition<br />\nman's<br />\nbetW<br />\nCanada to the new initiates and un- philosophy at Ohio State<br />\nUniversity ton G. Cannon, Jr., Carson G. Franey,<br />\nttopeolity as one who has attained a high<br />\ndergraduates.<br />\nin 1904 after having served as Fellow David H. Levy, and William C. Mcstandard of efficiency in the Hopkins<br />\nIn honor of Dr. Joseph S. Ames,<br />\nJohn Mitchell, president of the from 1901 to 1902.<br />\nDr. James Hart, associate profesDverec<br />\nFrom 1902 to Clean.<br />\nn_zir activities, whose character and work retiring president of<br />\nthe Johns Hop- sor of political science, has been Hopkins chapter, announced the fol- 1903 he was a lecturer at<br />\nIndianapA dinner was held last evening in<br />\ngroups<br />\nand<br />\nundergraduate<br />\nseveral<br />\nrein.<br />\nre,<br />\nkins University, Phi Delta Kappa and appointed to serve on the Federal lowing students as having fulfilled the olis at the Central<br />\nCollege of Physi- Levering Hall for the members of the<br />\nWhose scholarship is of the highest. Pi Lambda Theta, men's and women's<br />\nRegional Labor Relations Board for requirements for election to the group. cians and Surgeons.<br />\ndrive to discuss pans for the camInitiates Recognized Leaders<br />\nnational education fraternities, will the Fifth District, which is composed<br />\nPalmer Hager, a senior in chemical<br />\nHe has written many works of paign, and there will be luncheons<br />\nInitiates are selected from recog- hold a dinner at the Hotel Emerson, of Maryland, the District of Colum- engineering.<br />\nplant life, including a section of a at which reports will be given every<br />\nnized leaders in the following Saturday, at which the noted educa- bia, Virginia and parts of West VirDaniel Stetka, a senior in mechani- natural history survey of Porto<br />\nRico day unti the drive is completed on<br />\nbranches of college activity: athlet- tor, Dr. Isaac L. Kandel, will be the ginia and Delaware.<br />\ncal engineering.<br />\nand the Virgin Islands, published by Friday.<br />\nICS, scholarship, publications; social principal speaker.<br />\nForbes Whisler, a senior in mechan- the New York Academy of<br />\nThe board is comprised of men repSciences.<br />\nReceive Membership<br />\nleadership, including conspicuous<br />\nDr. David E. Weglein, associate resenting the employer, the laborer ical engineering.<br />\nRegular membership tickets, recservice to the Hopkins; non-athletic professor of education at the Hopkins and the public. In accepting the apWilliam Witte, a senior in electrical<br />\nognized as privelege cards in Y. M.<br />\nactivities, exclusive of publications. and superintendent of public instruc- pointment Dr. Hart assumed the lat- engineering.<br />\nC. A. organizations all over the coun7;<br />\n4 It is a recognized fact that the stand- tion in Baltimore City, will be<br />\nJoseph Bullock, a junior in mechantoast- ter obligation. He will listen with<br />\ntry, will be issued to each student doards of scholarship are not as high master at the banquet, which<br />\nical<br />\nengineering.<br />\nwill get other prominent business men and<br />\nnating $2.00. For any contributions<br />\nas Phi Beta Kappa, but the 0. D. under way at 6.30 p. m. and which labor heads to cases pertaining to<br />\nLeonard Emmert, a junior in elecover that amount, a sustaining memchapter here demands a \"respec- will be attended by many teachers, Section 7A of the National Industrial trical engineering.<br />\nbership will be given, according to<br />\ntable general average\" before eligiGives History Of Group<br />\nRecovery Act.<br />\neducators, and public officials.<br />\nDr .E. A. Schaal, executive secretary.<br />\nbility can be considered.<br />\nPreceding the announcement of the<br />\nStudied At Hopkins<br />\nInvitations Mailed<br />\nAny contributions up to $5.00 will<br />\nIORS<br />\nIn his address on the significance<br />\nDr. Hart has been at Hopkins since successful undergraduates, Mitchell<br />\nInvitations were being mailed yesdeducted from the regular membe<br />\n— I Of 0. D. K., given during 1931-32,<br />\n1926 as an associate in political sci- gave a brief history of the founding<br />\nterday from the office of Dr. Florence<br />\nbership<br />\nin the event that the contribof<br />\nTau<br />\nBeta<br />\nPi<br />\nat<br />\nbouglas Cotton, who was graduated<br />\nLehigh University<br />\nence. He is a graduate of the UniE. Bamberger, professor of education<br />\nutor qualifies for any sort of memIn 1922 and who was the originator<br />\nversity of Virginia, having been elect- in 1885. Continuing, he stated that<br />\nhere.<br />\nbership at the Central Y. M. C. A.<br />\nOf the Varsity Seal as well as editor<br />\ned Phi Beta Kappa. The University the honorary fraternity was founded<br />\nDr. Kandel, who lectured at the<br />\nThe teams are as follows:<br />\nOf the NEWS-LETTER, declared the<br />\nconferred a Ph.D. degree on him in mainly because Phi Beta Kappa erTeam No. 1: Feise, captain; Jay,<br />\nhonorary fraternity \"a working or- Johns Hopkins in 1930-31, is himself 1923. He has also taught at the Uni- eluded engineering students at colThe speaker for the annual lecture<br />\na member of Phi Delta Kappa. He is<br />\nganization—the clearing house for<br />\nversity of Michigan and at Harvard. leges and universities. At present of the Tudor and Stuart Club will be Sears, Kemp, Vincenti.<br />\nthe author of the widely used textTeam No. 2: Gilbert, captain; Stecollege problems, the melting pot of<br />\nHe has written several treatises on Tau Beta Pi has a membership of 65 Dr. Elmer E. Stoll, professor of Engbook, History of Secondary Educacollegiate opinion.\"<br />\nsubjects dealing with the Constitu- active chapters with the total mem- lish at the University of Minnesota. vens, Canning, Pinkerton.<br />\ntion, among others. The prominent<br />\nTeam No. 3: Reuling, captain;<br />\ntion and law. At present Dr. Hart is bership of the fraternity being nearly His subject will be \"The Poetical<br />\nOrganized In 1916<br />\neducator has been associated with<br />\nGambrill, Ghinger.<br />\n23,000.<br />\nTreatment<br />\nof<br />\nin<br />\nthe<br />\nof<br />\na<br />\ndifferent<br />\nCharacters<br />\nin<br />\nmidst<br />\nwork<br />\nHomer<br />\nwhich<br />\nThe Hopkins chapter, which was Columbia University's Teachers' ColTeam No. 4: Murphy, captain;<br />\nEach year members of the active and Shakespeare.\" February 16 has<br />\norganized in 1916 when the mother lege since 1914. He joined the fac- he characterizes as \"just my own<br />\n(Continued on Page 3, Col. 1)<br />\nchapter elect students from the sen- been set as the date for the lecture,<br />\nthoughts<br />\non<br />\nthe<br />\npresent<br />\nsituation.\"<br />\nChapter at Washington and Lee Uni- ulty there as a lecturer and in two<br />\niors who have been in the upper which is to be held in Levering Hall.<br />\nversity turned to this University two years was appointed associate. In<br />\nquarter of their class and the juniors<br />\nDr. Stoll received his A.B. degree<br />\nYears after 0. D. K.'s origin for aid 1923 he was promoted to a full pro- GAS ENGINEERS ASSN.<br />\nwho have been in the upper eighth at the College of Wooster in<br />\n1893, and<br />\nestablishing a national society fessorship in the Teachers' College<br />\nTO MEET IN AFTERNOON of<br />\ntheir class. However, the quali- two years later graduated from<br />\nHarWhich would give outstanding dis- and an associate in the Columbia<br />\nThe Gas Engineers Association will ties of manliness, friendliness and the vard<br />\nUniversity with an A.B. degree.<br />\ntinction to deserving members on the University's International Institute.<br />\nhold its regular monthly meeting to- likelihood to succeed are taken very<br />\nFollowing his successful completion<br />\nTwo men out of eight candidates<br />\ncampus, has always served as a<br />\nFor four years he was associate ed- day at 4.15 P. M. in room 110, Mary- strongly into consideration before an of the M.A. degree<br />\nrequirements at were designated as the representaives<br />\nclearing house for University probitor of Monroe's Encyclopedia of Ed- land Hall.<br />\nundergraduate may be elected.<br />\nHarvard, Dr. Stoll entered the Adel- to try for the Rhodes Scholarship by<br />\nlerns. It has gone into innumerable<br />\nucation. Dr. Kandel took his Ph.D.<br />\nphi College at Brooklyn, New York, the committee of this district which<br />\nconferences with the President and<br />\ndegree at Columbia in 1910, after<br />\nas an instructor in English.<br />\nbean here and has pushed many promet Saturday in the office of President<br />\nholding a fellowship there for two<br />\njects aimed at bettering the Hopkins<br />\nJoseph S. Ames.<br />\nStudied In Germany<br />\nyears.<br />\nIn general. During the past two years<br />\nTwo years later he embarked for<br />\nM. Gordon Knox of 211 Wendover<br />\nlt was instrumental in making HonGermany, where he studied at the road and a graduate of Yale UniverOr System, athletics system, and stuUniversity of Berlin. Several years sity in 1934 and Robert L. Burwell,<br />\ndent activities control improvements.<br />\nlater he received a Ph.D. degree at Jr., of Annapolis and a graduate of<br />\nNot only does it elect men in recthe University of Munich. On his re- St. John's College in 1932 were the<br />\n°gnition of leadership and good charturn to America he became an in- two successful candidates. They<br />\nacter, but, according to its aims, the<br />\nstructor in English at Harvard Uni- were judged yesterday at Swarthmore<br />\nMade Vice-President, Lectures Be(Continued on Page 3, Col. 1)<br />\nversity. From here he went to West- by the committee for the Middle Atfore Archaeological Institute<br />\nern Reserve University as a professor lantic District.<br />\nOf America<br />\nNow that Christmas has come and on the last day of college before the<br />\nof English. In 1915 he entered the<br />\nLouis E. Reuling, a junior in the<br />\ngone the attention of the newly- holidays. A good time was had by faculty of<br />\nthe University of Minne- College of Arts and Sciences and<br />\nall,<br />\nincluding<br />\nthe<br />\ntwo<br />\nnewly-initiated<br />\nThe Archaeological Institute of<br />\nformed League for Grammatical Corsota, a position that he has held since John N. Kopper were the two canmembers of the League, Harold<br />\nAmerica elected Dr. David M. Robthat time.<br />\nrectness in Speech, inspired by an<br />\ndidates from Hopkins.<br />\nSampson and John Steeper, the stuinson of the Johns Hopkins depart\"shall\"<br />\nof<br />\nusage<br />\nBesides his various teachings and<br />\nthe<br />\nargument<br />\nover<br />\ndent employees in the department of<br />\nart<br />\nand<br />\nof<br />\nment<br />\narchaeology<br />\nto<br />\nthe<br />\nClub To Discuss Plans For Coming<br />\noffice of first vice-president of the In- and \"will,\" is being directed toward education who brought the member- studies, Dr. Stoll is well known for<br />\nMonth; Young, Doub, Crouch,<br />\nhis many lectures and writings on litstitute. The election took place at another fund to be built from its ship up to six, and Miss Mary Levin,<br />\nAre Officers<br />\nerature,<br />\nespecially those of Shakessecretary<br />\nto<br />\nthe<br />\ndepartment.<br />\nToronto on December 28, and followed penny-per-grammar-error plan. This<br />\npeare. He has edited many Shakesby<br />\nDr.<br />\naddress<br />\nRobinson<br />\non<br />\nhis<br />\nan<br />\nfor<br />\nraised<br />\nenough<br />\nbe<br />\ntime<br />\nmoney<br />\nwill<br />\nIt'was<br />\nannounced at the Christmas<br />\nRecent receipt of a letter from<br />\nThe DeMolay Club will hold its<br />\npearian works and is an acknowlan Easter vacation party.<br />\nparty, the first social event of the<br />\ncentral office of the Associallext meeting this Thursday at 6 p. m. excavations at Olynthus.<br />\nthe<br />\nedged authority on the subject.<br />\nReceipt of a shipment of mosaics<br />\nAnd Grand Treasurer Margaret L. penny-per-grammar-error group, that<br />\ntion of College Editors furnished<br />\nill Levering Hall, and will discuss<br />\nnotice that ballots for the A.C.E.Plans for activities for the coming from Athens just before the Christ- Coard, whose grand idea the League an amendment was made in the<br />\nmas holidays enabled Dr. Robinson to was, is praying fervently that the League constitution which calls for ARCHAEOLOGICAL BOOKS<br />\nLiterary Digest Peace Poll will be<br />\nroonth.<br />\nDONATED TO UNIVERSITY<br />\nmailed this week, Stanley E.<br />\nThe DeMolay Club was founded at show some very interesting slides on members won't get too grammatic- the same one cent fine for poor enunpronunciation.<br />\nciation<br />\nperiod,<br />\nas<br />\nillustrated<br />\nand<br />\nbad<br />\nthe<br />\ncorrect<br />\nin<br />\nin<br />\nand<br />\nart<br />\nof<br />\ntheir<br />\nspeech<br />\nthe<br />\nally<br />\nBlumberg, editor of the NEWS40Pkins in 1931, with the purpose of<br />\nLady Walston of London recently<br />\naround the education conference room<br />\nLETTER,<br />\nannounced<br />\nyesterday.<br />\nPromoting the spirit of fellowship, in these specimens.<br />\nMore Money Needed<br />\nin Gilman Hall. She believes that the<br />\nThey are to be distributed in the<br />\n\"We must have a bigger treasury,\" selected the library of the Johns<br />\nand furthering social relations beparty simply must be held.<br />\npostoffice box of every undergradMiss Coard asserted at the time. Hopkins University as the receiver<br />\ntween the members of the Order of DR. RALPH MAGOFFIN TO<br />\nof a valuable collection of archaelogiuate at the University.<br />\namendment<br />\n\"By<br />\nadding<br />\nthis<br />\nwe'll<br />\nbe<br />\n1)eMolay, and the majority members<br />\nHave<br />\nParty<br />\nSPEAK ON ARCHAEOLOGY<br />\ncal works.<br />\n(lf the Order of DeMolay, who are stu\"Those undergraduates who do<br />\nAccording to rumors, it was she sure of that--unless the members deThe books are from the private<br />\ndents of the Johns Hopkins Univernot have postoffice boxes and who<br />\nDr. Ralph Van Deman Magoffin, who planned on using the Christmas cide it's safer to keep quiet than to<br />\nsity.<br />\nlibrary of Sir Charles Walston, disare desirous of marking a ballot,<br />\nformer associate professor of ancient fund money with which to purchase talk!\"<br />\nshould see me in the NEWSThe Easter vacation party, sched- tinguished British scholar and excaRoy B. Young is president, and is history at the Johns Hopkins Univer- an additional box of tea for the weekassisted by Emmett Doub and Ed- sity, will deliver a public lecture in ly department of education teas. But uled for the week of March 18, with vator, who was at one time director<br />\nLETTER office this week,\" BlumWard Crouch in the offices of vice- Latrobe hall on January 23. The lec- when it was loudly hinted that im- the new amendment in effect, should of the American School of Archaeberg said. \"For their benefit we<br />\nhave ordered an additional numPresident and secretary - treasurer, ture, sponsored by the Baltimore peachment might follow were this be a howling success—with perhaps ological Studies in Athens.<br />\nThe collection contains between<br />\nber of ballots.\"<br />\nrespectively. Thomas F. Hubbard is Archaeological Society, will deal with done, Grand Treasurer Coard ordered four quarts of ice-cream and more<br />\n150 and 200 volumes.<br />\ntile faculty advisor.<br />\ntwo quarts of ice-cream for the party cake!<br />\nrecent discoveries in archaeology.<br />\n<br />\nEducational Groups Dr. Hart Appointed<br />\nTo Give Banquet To fifth District<br />\nIn Honor Of Ames Labor Committee<br />\n<br />\nMembership Qualifications<br />\nOf Engineering Fraternity<br />\nSummarized At Assembly<br />\n<br />\nDr. Kandel, Noted Educator, Associate Political Science<br />\nWill Be Principal Speaker<br />\nProfessor Representative<br />\nAt Dinner Saturday Night<br />\nOf Public In NIRA Tests<br />\n<br />\nTudor And Stuart<br />\nTo Hear Dr. Stoll<br />\nAt Annual Lecture<br />\n<br />\n:rxc<br />\n<br />\nMinnesota Professor Speaks<br />\nFebruary 16 In Levering;<br />\nKnown For Literary Works<br />\n<br />\nRhodes Group Picks<br />\n2 Division Finalists<br />\n<br />\nRobinson Elected<br />\nOfficer By Institute<br />\n<br />\nAiming For Larger Treasury,<br />\nLeague Includes Pronuncation<br />\n<br />\nGrammatical Correctness In Speech Group Passes Amendment As It Holds Christmas Ice Cream Party<br />\nAnd Plans Easter Event<br />\n<br />\nbe Molay Club To<br />\nMeet On Thursday<br />\n<br />\nPeace Poll Ballots<br />\nOn Way Here<br />\n<br />\n\f2<br />\n<br />\nHOME WOOD, BALTIMORE, MD., JANUARY 8, 1934.<br />\n<br />\nobIts lbophins 1Rews1Letter<br />\nFOUNDED 1897<br />\nSubscription per year<br />\n$2.00<br />\nBy Mail<br />\n$2.50<br />\nRemit subscription fees to Treasurer, Student Activities Council, Remsen Hall, Treasurer's Office, Johns<br />\nHopkins University.<br />\n<br />\nHigher Education —III An Autopsy On Naples Deaf,Dumb and<br />\nBlinal<br />\nOn<br />\nMarks<br />\n<br />\nThe Barnstormers Go<br />\nUnder The Knife<br />\n<br />\nOdds and Ends<br />\n<br />\nby EDGAR KEHLER<br />\nby HAROLD M. KROPMAN<br />\nThe following communication is the third of<br />\na series of educational confessions, instituted<br />\nDear Customers,<br />\nEntered as second-class matter December 3, 1909, at<br />\nlast season. The NEWS-LETTER does not everyby STANLEY E. BLUMBERG<br />\nthe Postoffice in Baltimore, Md., under the Act of ConIf for any reason my column reeks of genius or i<br />\nwhere agree with the author and welcomes any<br />\nIf the following reactions to See Naples And Die,<br />\ngress, November 3, 1879.<br />\neven<br />\nextraordinarily well-written this week, I wish yol<br />\nexpression<br />\nof dissent.—THE EDITOR..<br />\nthe Barnstormers' 1934 fall offering, can be tagged with<br />\nPublished semi-weekly from October to June, except<br />\nwould please excuse it as I wrote it New Year's Day ir Hs(<br />\nduring examination and college holiday periods by unI.<br />\nthe dignified label of a \"review\", then the author makes<br />\nNew York after a long, hilarious New Year's Eve whicl<br />\ndergraduates of the Johns Hopkins University.<br />\nIn my first year at the Hopkins, I was revolted all haste to tack on the<br />\nword \"amateur\" in order to concluded<br />\na four-day convention in New York. Th(<br />\nMember of the Intercollegiate Newspaper Association of merely by the terrible chaos of subjects thrust at<br />\nthe maintain 100% purity and accuracy with reference<br />\nbright<br />\nlights<br />\nof Broadway piercing the looming dark<br />\nthe Middle Atlantic States, The National College<br />\nunsuspecting freshman. Hardened to that blemish, I to his standing.<br />\nFor the succeeding sentences are<br />\nness of the subway tunnels; the noise at Times Square<br />\nPress Association and the Association of<br />\nnow in my second year discover one immensely more nothing more than<br />\na somewhat disconnected series of<br />\non the stroke of twelve; New Year's Eve echoing frore<br />\nsubtle and vicious. I am now revolted by a sly, inno- impressions which caught<br />\nCollege Editors.<br />\nthe relatively untrained eye the<br />\nquiet hum atop the Empire State Building; the rust<br />\ncent-looking matter—a hangover in this realm of higher of this Thespian<br />\nEDITORIAL DEPARTMENT<br />\nsuckling and which, surprisingly<br />\nStanley E. Blumberg<br />\nof the tide of humans into the subway cars transposed<br />\n.Editor-in-Chief<br />\nlearning, retained unquestioned from the needs of a enough, have lingered<br />\nthrough a torrid Xmas vacation<br />\nMelvin Goldberg<br />\nManaging Editor<br />\nin the lobby of the Waldorf-Astoria eight-thirty an<br />\ndifferent, a practical instruction—an insidious appendix so that he has been<br />\nable to recapture and transfer them<br />\nJesse N. Borden, Neal Potter,<br />\nSunday morning; all became more and more jumbled and<br />\nin<br />\nthe<br />\nUniversity'<br />\ns<br />\nabdomen.<br />\nI<br />\nrefer<br />\nto<br />\nthe principle of to an alleged interested public.<br />\nAssistant Managing Editors<br />\nrealistic in my imagination and hence the following con.<br />\nteaching<br />\nLeonard Wallenstein<br />\nby marks and credits.<br />\nSports Editor<br />\nOn second thought, perhaps the very fact that this<br />\ncoction.<br />\nIrving Leberfeld.<br />\n_Exchange and Filing Editor<br />\nThese marks—these Honors, Satisfactories, and reviewer (already we<br />\nare reveling in our new-gained<br />\nHyman M. Levin<br />\n1<br />\nContributing Editor<br />\nFailures—what are they? As I see them, they are glory) is a \"neophyte<br />\nof the boards\" will assist in the<br />\nSigned: HAROLD M. KROPMAN,<br />\nHarold M. Kropman<br />\nColumnist<br />\nnothing more than a set of carefully wrought flatteries, presentation of a<br />\nmore or less typical criticism of a more<br />\nWitness: STANLEY E. BLUMBERG.<br />\nEdgar Kemler<br />\nFeature Editor<br />\ncajoleries, and insults, to herd the students through four or less typical play<br />\nl((<br />\nof a more or less typical amateur<br />\nP.<br />\nspent a quiet evening at home with the wife;<br />\nReporters<br />\nyears of guaranteed culture. Indeed, this whole system dramatic group.<br />\nCertainly our juvenile nature should and kids New Year's Eve, but I guess everything he, brin<br />\nJohn C. Brashears, Stanley M. Finkel, Benjamin<br />\nof grading and marking is an avowal of incompete<br />\nncy serve to eliminate dwelling upon minor technical details told me about New York is 0. K. I understand till<br />\nFuternick, Jewett Goldsmith, Leon Jacobson,<br />\na<br />\non the part of the faculty. The professors do not present which are only of<br />\na<br />\nrelevance to those intimately con- Baltimore girls are particularly dangerous up there omt z1I<br />\nWilliam Kempton, Kenneth Zierler,<br />\ntheir material—trusting to the fascination of its content nected with the<br />\nproduction. For what we overlooked during the holiday season.<br />\nBUSINESS DEPARTMENT<br />\nor their own ability at presenting it. No, they must during our two-hour<br />\nbrim<br />\nvisit to Italy via the Auditorium<br />\nSigned: S. E. B.,<br />\nRay Goldberg<br />\nBusiness Maxager<br />\nvulgarly resort to the ego of the learner as the driving Theater belongs to<br />\non E<br />\nthe<br />\ndramatic<br />\ndevotee,<br />\nBert Gordon<br />\nthat<br />\nfascinatWitness:<br />\nH. M. K.<br />\nAdvertising Manager<br />\npower—and sternly insult him into an education. And ing character who<br />\nderl<br />\nCharles Hastings<br />\nleaves the playhouse set in his'opinOffice Manager<br />\nthey<br />\nset<br />\nup<br />\na<br />\nport<br />\nPhi<br />\nBeta<br />\nDavid Levy<br />\nKappa fraternity as the supreme ions but refrains from exposing and expoundin them<br />\n0-0<br />\nCirculation Manager<br />\ng<br />\nbeguilement—the lofty council of those who have intel- until he has obtained<br />\nthe next day's paper and read<br />\nWhile walking through the streets of Chinatown I<br />\nTuesday, January 8, 1934.<br />\nlecutally fought and very often intellectually died<br />\nfor what the best-informed critics have to suggest. Shades happened upon<br />\nthe following most treacherous sign in thai<br />\nthe decoration.<br />\nof the graduate student!<br />\nthe window of a Chinese laundry:<br />\nMEMBER<br />\nThe mere fact, however, that making is a conspirro<br />\n\"Don't send your clothes to be torn by a<br />\ntrolltgiate<br />\nAssociuted wouskieas<br />\nacy of laziness on the part of the faculty is not half<br />\nA:<br />\nso<br />\nThus reinforced, we desert our place in the wings<br />\nlaundry which uses machines. We do it care=31934 (gontaattpipm 1935<br />\nbad as its other implications. My next charge is that<br />\nWISCONSIN .<br />\nMADISON<br />\nand brazenly stride onstage to speak our little piece.<br />\nfully ourselves by hand.<br />\nit greatly distorts or emphasizes the distortion of<br />\nthe First let us give<br />\nvent<br />\nto<br />\n—One Lung Gone.\"<br />\nour<br />\ncritical<br />\nfaculties<br />\nand<br />\nposit<br />\n\"true\" nature of knowledge. All knowledge (other than<br />\nthat which is practical) may be said to be the organized the following consideration:<br />\nan<br />\n0-0<br />\n1. The choice of See Naples And Die was not a<br />\nattempt at answering the question \"Who am I?\". Probloltri<br />\nnofle:<br />\nleg<br />\nAPPARENTLY the craze for selecting All-American<br />\nlems of physics, chemistry, biology, history, sociology particularly brilliant stroke. Although it is obviously<br />\nSeveral weeks back as I sat in Levering Hall per- are<br />\nteams has lifted itself above its somewhat jingoistic<br />\ncan be all reduced to that simple problem of self-con- neither a problem play nor a psychological piece, it nev- 'using the NEWS-LETTER (Page 2, columns 5, 6), I was but<br />\nbirthplace, the sporting page, and is now concentrating<br />\nsciousness. It is that curiosity about yourself—the ertheless represents a tendency on the part of the approached by a keen, slick-looking, wide-awake fresh;<br />\n3<br />\nall its efforts upon permeating the upper crust of sowhere, the what, the why, the how of you—it is that 'Stormers to go slightly highbrow on a trusting student man who asked if he could have my copy of the paper haf.<br />\nciety, that strata which we regarded as absolutely imbody. We want<br />\nwhich makes knowledge one of the greatest pleasures<br />\nas soon as I finished with it. I immediately became very as<br />\nmune to all matters of doubtful or unsavory origin. This<br />\nyou own. But marks? Do they indicate the relative to see life as<br />\nelated and inquired whether he would like to have me car<br />\nobservation is prompted by an article appearing in<br />\njoy you derive from your pursuit of yourself? Do they we, young as<br />\ngib<br />\n'autograph it.<br />\nyesterday morning's Sun, wherein a group of young<br />\nrecord the thrill of discovering that your grandfather we are, know it;<br />\nsociety sportsmen from the Johns Hopkins picked an<br />\nHe replied: \"Not especially. The weight of your<br />\nwas an ape; your great-grandfather a fish; and your we do not ask<br />\nAll-Baltimore Debutante Team from regular attendants great-great-gra<br />\nautograph would be negligible. You see I am saving<br />\nndfather, a heap of carbon, hydrogen, the stage to edat the fortnightly tea dances held in Levering Hall.<br />\nand oxygen in the slime. No, all they record is the<br />\nNEWS-LETTERS so that when I become a senior I will<br />\nrela- ucate us in the<br />\n2<br />\nSeveral pressing considerations obtain here. For tive parrot-like swallowing of facts, returned to light art of living.<br />\nhave several hundred pounds of them which I can sell to<br />\nh:<br />\nfor<br />\nthe examination. Facts which might or might not Last year's The<br />\ninstance, what were the requisites for securing a berth<br />\nhelp defray part of the expenses for June Week.\"<br />\nkr<br />\non the varsity eleven? Are we to assume that every be digested and assimilated. And this knowledge, I Front Page was<br />\nde;<br />\n0-0<br />\ncandidate was examined to test her resistance to pink say, becomes distorted. It becomes quantity, not qual- a more fortuen,<br />\ntoothbrush, Queen Victoria hats, and Clark Gable? Was ity. It becomes cold-cut, pre-paid proprety, crushed into nate selection,<br />\nThe Tufts College publication says: Many a coed<br />\nher intelligence ascertained by asking her to differenti- a harsh pattern. Of course, all the world admires sheer though not a<br />\nbelieves<br />\nthat a mushroom is the vestibule in a girl's<br />\n0.<br />\nate between Venus and Venice, and the Brooklyn and size and bulk—massive wisdom no less than gaudy sky- whit better pordormitory just about midnight after a dance.<br />\nscrapers<br />\nand giant fortunes. Students become miserly<br />\nCulbertson systems of bridge? And were her morality<br />\ntrayed.<br />\nand discretion determined by an inspection of her diary? bankers in their vaults, piling up facts—not for them0-0<br />\n2. Entirely too<br />\nPr<br />\nselves,<br />\nbut from the obligation to save their honor; or, if<br />\nThen again, how are we to look upon the assigning<br />\nmany girls had<br />\nID<br />\nShe was only a real estate agent's daughter but<br />\nsuccessful,<br />\nfrom<br />\ngreed<br />\nfor<br />\nmore honor. There is no mind major roles,<br />\nof the eleven who passed muster to the various positions<br />\nin<br />\nliked<br />\nwe<br />\nher<br />\nlots.—The<br />\npr<br />\nPointer.<br />\non the team? We should not like to conclude that the in this soulless cramming. These facts are no more glaring comparre<br />\nmental<br />\nthan<br />\nso<br />\nmany<br />\nglittering gold pieces. Knowledge, ison<br />\nmore bovine were relegated to the guard and tackle slots,<br />\n0-0<br />\nwith the<br />\nfe<br />\nwhile the quarterback was a conniving madamoiselle now, is carnal—the body's property. And it hurts. For paucity of fat<br />\nID<br />\nBrown got kicked out of school this morning for<br />\nand the fullback a powerful miss with one eye fo- physics and chemistry have been respectively reduced to m a 1 e leads.<br />\nfe<br />\ncheating on an astronomy exam.<br />\ncused on crashing the opposing line (not to mention one-sixteenths of the diploma. It is as soul-cutting as a Here again the<br />\nel<br />\nWhat was he doing copying from the fellow in<br />\nthe newspaper headlines, an idea naturally abhorrent to Cook's tour complete with an examination and a cer- vehicle itself<br />\nis<br />\nec<br />\nfront<br />\nhim?<br />\nof<br />\ntificate<br />\nassuring<br />\nPHIL<br />\nCRIBLET<br />\nwhomever<br />\nit may concern that the at fault<br />\nevery debutante) and the other optic fixed on the Rose<br />\n— it<br />\noi<br />\nNaw, the professor caught him bumping his head<br />\n'Bowl. Similarly, the ends might be justly considered bearer has witnessed every cathedral in Europe. Such fairly exudes<br />\nfeminine flippancy and fragrance. But the against the wall.—The Log.<br />\ngreed—and<br />\nhow<br />\nit<br />\nis admired!<br />\nas the \"fastest\" in the field and ready to throw for a<br />\nBarnstormers are supposed to perform for, at any rate<br />\nei<br />\nloss the first male opponent who came their way.<br />\nto please, a masculine audience which certainly can<br />\n0-0<br />\nfi<br />\nbe<br />\nYet<br />\neven these aspects of the marking system—its<br />\nOne final question, and then we shall be only too<br />\ncreditecierw<br />\n*. Itii sufficient sophistication to appreciate the<br />\nPresented by the seniors in the School of BusinesS<br />\nhappy to let the women bask in the glory of their newly- application as a faculty aid and its crushing of knowl- ngtulant and<br />\npulchritudinous properties of the bearless<br />\nEconomics after much haranguing as to who should go<br />\nacquired pigskin. Where are we to find the set of edge into a quantity-pattern—bad as they are—even sex.<br />\nthese<br />\nmight<br />\npossibly<br />\nthe shame for having been the composer: \"I am every<br />\nbe<br />\njustified<br />\nif they really succeeded<br />\nrules that will enable us to inform ourselves concernIn regard to this same point, however, there is a<br />\ninch a ruler.\"<br />\ning such matters as non-professionalism, length of in spreading the light. But they don't. The marks more serious<br />\nconsequence, one which the organization<br />\nservice, penalties, etc.? Is a debutante of six years' and examinations really defeat their own end. No cannot permit<br />\nitself to dismiss nonchalantly. Not only is<br />\nstanding to be retired on a pension and her name indeli- course can possibly.-include in its compulsion every the failure to<br />\nsee friend J. Finkington Puntworthy in speech. The chances are they'll retreat blushingly, but<br />\nphase<br />\nof the subject. The less conspicuous phases are<br />\nbly inscribed on the Feminine Football Roll of Honor?<br />\naction disappointing to the audience, but it tends to take you'll have done your share; and then there's always<br />\nWill attendance of affairs outside the city limits auto- left to the enthusiasm of the student; they are not sub- the Barnstorm<br />\ners out of circulation as far as Hopkins the possibility that they'll open up and dish out some<br />\nmatically render her ineligible for further competition? ject to marking. But where can this enthusiasm come undergraduates<br />\nare concerned. And experience has of those anecdotes which are such an integral part of<br />\nWe shake our head doubtfully at the prospect of these from? The marking has operated to supply an artificial taught us that<br />\nBarnstormer history. ThOse boys know enough dirt<br />\nsaid undergraduates are not to be trifled<br />\nimpetus which is in conflict with that of genuine ennumerous pitfalls.<br />\nto blackmail every member of the cast without exwith<br />\nby<br />\nany<br />\norganizati<br />\non<br />\n'<br />\nwhich<br />\nis desirous of perpetuthusiasm. The result?<br />\nNine times out of ten the<br />\nception!<br />\nNevertheless, it's an ingenious advertising stunt on<br />\nation.<br />\nA goodly number of them have a pronounced<br />\nstudent will not care a whit about the unrequired mathe part of the \"fortnightly boys\", who diverted the<br />\nterial, considering it as a counterfeit unworthy of his yen to throw themselves into a dramatic role, but they<br />\nthoughts of these girls from the iron to the gridiron.<br />\nare in no wise willing to abandon their primal sex<br />\nPassing on to the positive side of the picture, we<br />\ngreed. The system has mashed the desire for learning<br />\nand<br />\nPerhaps their precedent will inspire our College for<br />\nto a standstill. You can be assured of no more thorough cavort in lipstick and skirt merely to satisfy this crav- are convinced that there was no let-down in the quality<br />\nTeachers females to follow suit. At that, they would<br />\nknowledge than a Pullman porter has of the United ing. The sensible, expedient solution as we see it is to of acting turned in by this year's group. Phil Criblet,<br />\npossess one natural advantage: they would at least have<br />\nStates despite a schedule which carries him through set a certain minimum number of male parts and de- who, as the juvenile lead, drew the most difficult assignsome English on the ball!<br />\nmand that number from any play that is being consid- ment of them all, came through quite neatly after what<br />\nforty-eight states.<br />\nered for production.<br />\nwe considered a somewhat shaky start. He picked up<br />\nNor is that all. These elements of the marking sys3. That feeling of strained formality which ever speed and assurance as the play progressed, and waS<br />\ntem may actually work harm. They may work to circumvent or even prevent knowledge altogether. College plagues Barnstormer shows after the final curtain has really thoroughly at home in Naples when he spoke hiS<br />\nbeen rung down was again in evidence, though to a last line.<br />\nA MATTER which is of vital, indeed ofttimes painful, seems to be anti-intellectualistic. Education becomes a<br />\nmodified degree, last month. This, perhaps, is more a<br />\nThe Misses Evelyn Swann and Elizabeth 'Ullman<br />\nconsequence to Hopkins undergraduates receives verbal menace: the mind becomes definitely unpopular. For the<br />\nfault of the audience than of the players; nevertheles<br />\ns, were \"naturals\" in their respective roles. Miss Swann<br />\ntreatment from one of our staff writers in the adjoining knowledge has the stigma of compulsion on it, not to<br />\nif it is to be remedied, and we hold such a move<br />\nto be displayed her Vagabond experience to excellent advantcolumn. It deals with the system of marking now in mention that of being useless (aside from its inexpressdecidedly advantageous, the healing lotion must be<br />\niveness)<br />\nap- age as she fumed, fretted and fussed about the stage as<br />\nand<br />\ninferior to \"life\"—results of that distorted<br />\neffect at the University, and the author proceeds to tear<br />\nplied by the 'Stormers.<br />\nall gehuine American young ladies apparently should.<br />\nto shreds the present Honor-Satisfactory-Failure scale, theory. It has also the stigma of insult. If you are<br />\nAs a flighty middle-aged character, Miss Ullman seems<br />\nat the same time promising the editor to concoct and failed, your honor is so hurt that you must work against<br />\nyour will to save face—while ever afterwards you resent<br />\nOur theories along this line? One comes to mind to be in her element. She even improved on her work<br />\npresent his patented panacea in a future issue.<br />\nin The Front Page. And her intermittent screeches,<br />\nIt has long been our belief that the existing method the subject as the token of a former disgrace. If you immediately—why not end the presentation on a high,<br />\n'receive<br />\nhonors,<br />\nblack-andyou<br />\nblue<br />\nare<br />\nnote with the singing of the University emitted entirely without warning, reduced Ed Wynn's<br />\nso monstrously flattered that<br />\nis unsatisfactory in that it permits too gaping an area<br />\nafter<br />\nthe<br />\nOde,<br />\nexaminatio<br />\nthus<br />\nn,<br />\nyou<br />\nfollowing<br />\nwill<br />\nhesitate<br />\nthe highly successful procedure of \"So-o-o-o\" to a mere echo by comparison.<br />\nto<br />\nlook<br />\nany<br />\ndeepbetween the three grades. Exemplary of this contenJerry Branower also merits especial commendation<br />\ntion, the mark Satisfactory bears a numerical connota- er in the matter—fearing to find that you may not be the Princeton Triangle Club and numerous other college<br />\nthe Aristotle your instructor indicated you were.<br />\ndramatic groups? Such a practice links together actor for his impersonation of the oh-so-bored and oh-so-broke<br />\ntion ranging from 60 to 89. Honor and Failure are more<br />\nThen, too, we are creatively sterile. Why? That is and audience in an effective measure, and is at the<br />\ndefinitive and exact by their very nature, but with resame Russian prince. His \"why waren't we all drowned at<br />\neasily understood from the workings of this distorted time an advertisement of the spirit of<br />\nthe Hopkins to birt ?\" impressed us as being one of the outstanding<br />\nIspect to Satisfactory we have been staunch advocates<br />\ntheory of knowledge. It is too easy. All the University whatever outside public may be in attendance<br />\nlines of the show. Yet it was no more what he said that<br />\nof a division of this grade into upper S and lower S.<br />\n.<br />\ndoes is to supply the property-facts—and you swallow<br />\nWhat distresses us most, however, is the sheepish made him click than how he said it. His easy manner<br />\nAlthough such a scale would compel members of the<br />\nthem. No searching, thinking, or ferreting. You receive part which Coaches<br />\nBill Banks and Howard Caplan are of delivery and appropriate gestures combined to make<br />\nfaculty to exert a noticeable amount of effort in analyzbit by bit for four years the pieces of a mental chair on compelled to enact<br />\nevery year. In the first place, their him convincing.<br />\ning the work of their students, such a sacrifice of<br />\nwhich the buttocks of your brain might rest forever. post-performance<br />\npresence is not requested by the audiThe remaining lead roles were capably filled by<br />\nacademic indolence would be well worth any discomforts<br />\nThe mind, if it bothers at all, is satisfied—completely ence, but by the<br />\nBarnstormers, their proteges—all of Miss Louise Orchard and Louis Hartman. The imporwhich it might entail.<br />\nfilled and comfortable till it ceases to be. If you ques- which redounds to<br />\nthe former's discredit and forces the tant lesser bits were mastered by the Misses Naon<br />\nWe confronted Dean Berry with such a proposal tion the least part of that slowly<br />\naccumulated furniture later to transform what should be a real pleasure<br />\ninto Craft, Kathryn Forsythe (who, incidentally, carried on<br />\nlast spring, but he returned the generalized verdict that up there, it is like cutting<br />\noff your finger—it has be- an embarrassing, yet necessary, task.<br />\nalthough quite ill) and Page Wickes, and by Zenas<br />\nstudents, just as all other species of human beings, fell come such a part of you.<br />\nIt is almost impossible; it<br />\nPerhaps we're over-sensitive, but we regard this as Sears, Leonard Wallenstein, Robert<br />\nWatkins, Harold<br />\nnaturally into but three classes, and that any attempt requires super-human<br />\neffort. And if you can't question shabby treatment for two fellows<br />\nwho contribute much Kropman, Stanley Prager, William Snyder, Bert Gorto subdivide these classes was artificial and inconse- any part of that Stoic property,<br />\nhow in the world can of their time voluntarily and whose efforts<br />\nhave been don, Horace Leheneis and Daniel Lerner.<br />\nquential. We have assumed this to be the official pro- you possibly think or<br />\ncreate anything new? This atti- regularly attended by marked<br />\nsuccess. So we address<br />\nApril has been tentatively designated as the date<br />\nnouncement of the faculty; if we are in error, we wel- tude towards knowledge<br />\n, associated with the system of this suggestion to the student body,<br />\nthe members of for the next 'Stormer production and will mark<br />\ncome enlightenment.<br />\nonly<br />\nmarks, is sterile—absolutely. If you think in the pres- which we feel are<br />\nnot unappreciative but rather suffer the third season<br />\nthat the organization has presented<br />\nTry as we might, we have never been able to deter- ence of college students—and<br />\nthey perceive that the from erroneous sophisticated beliefs as to how to<br />\ndisport more than one play. The good intentions of this year's<br />\nmine representative undergraduate sentiment with re- thought is in conflict with<br />\ntheir old thought-property themselves at such an affair: Don't give the<br />\nBarnstorm- members cannot be questioned; their ability we believe,<br />\ngard to this problem. We urgently call for it now, for (though they mayn't)—you<br />\nare subject to the most ers an opportunity to drag cut Bill and Howie.<br />\nCall for has ben sufficiently, although not completely, demon- k<br />\nif we are to make an effective case, we must know the savage attacks. You may<br />\nbe egged, watered, or even them yourselves, and when you've obtained<br />\ntheir ap- strated; we wish them \"happy rehearsals\" in their next<br />\ndesires of our clients.<br />\nstoned.<br />\n(To be continued in next issue.)<br />\npearance before the footlights, demand that good<br />\nold venture.<br />\n<br />\nL<br />\n<br />\nVITSS<br />\n<br />\nThree Incisions<br />\n<br />\nMaking Light Of Socialites<br />\n<br />\nFinal Examination<br />\n<br />\nRemarks About Marks<br />\n<br />\nPrescribing The Medicine<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MD., JANUARY 8, 1934.<br />\n<br />\nUlman<br />\nGuest Speaker<br />\nAs O.D.K.Elects<br />\n<br />\nid Judge<br />\n<br />\nor<br />\na yot<br />\nlay it<br />\nwhici<br />\nThi<br />\ndark.<br />\nquart<br />\nfrog<br />\nrus/<br />\nposec<br />\nan<br />\nd and<br />\n' con.<br />\n<br />\nHonorary Activities Society<br />\nTo Initiate New Members<br />\nAt Assembly On Thursday<br />\n<br />\nDr. Gamow To Lecture<br />\nDr. George Gamow, formerly of<br />\nthe University of Leningrad, in Russia, and now visiting professor at the<br />\nGeorge Washington University, is to<br />\ncontinue the series of lectures on nuclear physics which he is delivering<br />\nat the Hopkins until the middle of<br />\n<br />\nActivities Council<br />\nHopkins Press<br />\nS!<br />\nURE<br />\nFIG<br />\nENT<br />\nPROMIN<br />\nForty-Two Varsity Seals<br />\nShows Decline<br />\nAn<br />\nMAE WEST<br />\nIn Publications<br />\nCrashes<br />\n<br />\nFebruary.<br />\nDr. Gamow, world-famous physicist, delivers his lectures in Rowland<br />\nHall between 3 and 5 p. m. Thursday.<br />\n<br />\ners<br />\nLeaders Selected Practice Teach<br />\nGet Assignments<br />\nGroup Sets High Standards<br />\nIn Athletics, Scholarship, In 8 City Schools<br />\nPublications, And Societies<br />\n<br />\n13 Students Here Are To<br />\nTeach Next Month In<br />\nJunior And Senior Highs<br />\n<br />\nAwards<br />\n<br />\nby STANLEY E. BLUMBERG<br />\n<br />\nALGER<br />\n<br />\nXMAS PARTY<br />\nAt<br />\n<br />\nHOPKINS<br />\n<br />\nStory<br />\nMinus The<br />\n<br />\nHISS<br />\n<br />\nBob Abrams, chairman of the Student Activities Council, awarded 42<br />\nVarsity Seals to members of various<br />\nactivities on the campus, Wednesday,<br />\nDecember 19.<br />\nHeads of activities received two<br />\nstars on their seals, and members<br />\nreceived one star for each activity<br />\nto which they have devoted three<br />\nyears.<br />\n<br />\nActivities whose members received<br />\nSeals are the Hullabaloo, NEWS-LETFrom editor of the NEWS-LETTER TER, Cotillion Board, Debating CounBlue Jay, Barnstormto assistant counsel of the Agricul- cil, Black and<br />\nStudents Activities<br />\nClub,<br />\nMusical<br />\ners,<br />\nand<br />\ntural Adjustment Administration<br />\nCouncil, and the Student Council.<br />\nspecial investigator for the Senate<br />\n<br />\nA new angle (or would \"curve\" be<br />\na more appropriate word?) was recently advanced by certain ingenious<br />\nmembers of the University's chemistry department to the current communitions committee, all accommentary that \"chemistry's greatest<br />\nplished within the short space of five<br />\nblondes!\"<br />\ncontribution to the world is<br />\nlike a typical Alger<br />\nThe occasion was the annual years. Reads<br />\n<br />\nHoliday Language<br />\nConclaves Attract<br />\nMany Professors<br />\n<br />\nDuring Past Years Only 34<br />\nStudies Were Published,<br />\nAnnual Summary Reveals<br />\n<br />\nExcludes Journals<br />\nBulletin Shows 57 Issues Of<br />\nScientific And University<br />\nJournals Issued In 1933<br />\nA considerable decline in the number of publications issued by the<br />\nJohns Hopkins Press during 1934 was<br />\nrevealed in the annual report of the<br />\nPress, circulated last week. The bulletin also included announcement of<br />\nthe pending publication of Thomas<br />\nHardy's Indiscretions of an Heiress<br />\nand the first volume of a Documentary History of Primitivism.<br />\n<br />\nChristmas party of the department, story, doesn't it?<br />\n(Continued from Page 1, Col. 1)<br />\nwife<br />\nheld on December 18, and the perpeWell, in this case it is, for it connational honorary society serves to<br />\ng he<br />\ntrators alluded to were those usually cerns one Alger Hiss, graduate of the<br />\nbring together these most represenI the<br />\nnon-hysterical, self-controlled gradtative undergraduate leaders in an<br />\nClass of '26, who overcame the hanthere<br />\nSix junior high and two senior uate students. One of their number,<br />\norganization which in turn acts to<br />\ndicap considered inherent in the edibring together faculty and students high schools will have for practice Carl Vestling, invaded the festivities<br />\nMarch,<br />\nand<br />\nFebruary<br />\nattired to represent some unknown torship of this paper and has won<br />\non a basis of mutual interest and un- teachers, during<br />\nHopkins<br />\nJohns<br />\nthe<br />\nin<br />\nimcampus<br />\nstudents<br />\nnamed Santa Claus, and for himself comparative renown in<br />\nof<br />\n13<br />\nindividual<br />\nderstanding on matters<br />\nUniversity College for Teachers, it proceeded to extract Xmas gifts from legal and political circles at the tenportance.<br />\nThe annual summary of the Press<br />\nwas revealed today by Dr. E. Earle his bag of tricks. All went along in der age of thirty.<br />\nSelect Only Three Per Cent<br />\nthat, excluding journals, only<br />\nshows<br />\nhere.<br />\nstueducation<br />\nwn I<br />\nFaculty members and graduate<br />\nkeeping with the friendly Yuletide<br />\n0. D. K. cannot elect annually more Franklin, associate in<br />\nWhile at the Hopkins, Mr. Hiss furhave appeared during the<br />\nstudies<br />\n34<br />\nnin than three per cent of the total enHistory will be taught by Mrs. spirit until he drew out a large ob- nished copious proof of his versatile dents of the Language and Literature past year. In 1933, there were 45 pubrollment of men in the College of Anne Williams, at the Hamilton Jun- ject and exclaimed thusly:<br />\nnature. Among his accomplishments and Philology departments of the lications; in 1932, 52. Thus there has<br />\n\"Friends, and members of the fac- were: editor, the NEWS-LETTER; presArts and Sciences, School of Engi- ior High School; Bernard J. Stinnett,<br />\nJohns Hopkins University attended been a continued decrease since 1932.<br />\nneering, and School of Business Eco- at Edgar Allan Poe Junior High No. ulty, there is one man in our midst ident, Barnstormers; member of the<br />\nThe publication of the first volume<br />\nconventions of their national organinomics. Not more than 25 per cent 1; Arthur E. Gutman, at Garrison today who has devoted a purposeful track team; member of Omicron Delta<br />\nheld in Pennsylvania during of a Documentary History of Primizations<br />\nof<br />\nstudy<br />\nthe<br />\nto<br />\ncareer<br />\nHoward<br />\nfrom<br />\nsuccessful<br />\n42;<br />\nNo.<br />\nand<br />\nof the members may be selected<br />\nJunior High School<br />\nKappa and Phi Beta Kappa; and most<br />\nvacation. The meet- tivism has been approved by the press<br />\nmelting point curves. In deference to popular man in his class. He claimed the Christmas<br />\nany one of the five branches of col- Fox, at Garrison also.<br />\nLanguage Associa- committee. This series, according to<br />\nModern<br />\nthe<br />\nof<br />\ning<br />\nhis<br />\nin<br />\nhim<br />\naid<br />\nto<br />\neffort<br />\nan<br />\nin<br />\nhim and<br />\nlege activities from which selections<br />\nTeach English<br />\nAlpha Delta Phi as his social fraheld at Swarth- Dr. George Boas, \"will cover Eurowas<br />\nAmerica<br />\nof<br />\ntion<br />\nwork, I desire at this time to present ternity, and we imagine that the<br />\nper- are made. This insures a fair distriHyman M. Levin will teach a class<br />\nia, and pean literature until the seventeenth,<br />\nPhiladelph<br />\nand<br />\nCollege<br />\nmore<br />\nperfect<br />\nthe<br />\nof<br />\nhim with a picture<br />\nwas bution of outstanding leaders.<br />\npresent fraters of that particular<br />\nAmerica<br />\nof<br />\nin English at Hamilton Junior High,<br />\nSociety<br />\nLinguistic<br />\npossibly the nineteenth, century.<br />\nthe<br />\nmelting point curve—Mae West!\"<br />\nMembership in 0. D. K. for years<br />\n•eshGreek group are more than willing to<br />\nwhile Maurice C. Sater will teach<br />\nia for all of Primitivism and related ideas were<br />\nPhiladelph<br />\nin<br />\nconvened<br />\nSufferers Numerous<br />\naper has been regarded by upperclassmen English at Florence Nightingale Junrecognize this claim.<br />\ninfluential in molding men's minds reits sessions.<br />\nDr. E. Emmet Ried was the object<br />\nvery as the highest honor on the Hopkins ior High School No. 40.<br />\nSuccess Rapid<br />\ngarding the course of history, redelivered<br />\nwho<br />\nprofessors<br />\nHopkins<br />\nof this bit of local color. However,<br />\nme campus. Juniors and seniors are eliThree others will teach mathematThe rest of the story is merely a papers at the Modern Language con- garding ethics, and recently, regardin<br />\ncompany<br />\nof<br />\nabundance<br />\nan<br />\ninitiahad<br />\ntwo<br />\nhe<br />\ngible for membership and<br />\nics. They are Miss Dorothy Girdrecord of continuous successes. Grad- clave included:<br />\ning aesthetics and education.\"<br />\nhis momentary misery, for Dr. Frantions each year are held.<br />\nat Hamilton; Miss Bertie Rodwood,<br />\nuation from the Harvard Law School<br />\nthe<br />\nThe manuscript of this first volume<br />\nyour<br />\nincludes<br />\n\"Literary<br />\nfield<br />\nChinard:<br />\nwhose<br />\nDr. Gilbert<br />\ncis 0. Rice,<br />\nFaculty Honorary Members<br />\ngin, at Garrison; and Miss Alice Ekwas followed by immediate recogniving<br />\nis nearly ready for composition.<br />\nand History of Ideas.\"<br />\nfree radicals, was the recipof<br />\nHistory<br />\nstudy<br />\nAmong the faculty here there are<br />\ntion of Mr. Hiss's ability by such<br />\nwill 12 honorary members of the Hopkins lof, at Southern School No. 70.<br />\nHardy Novel Coming<br />\nient of still another picture—this one<br />\nDr. H. Carrington Lancaster:<br />\n91<br />\nSchool<br />\nAt<br />\nGrau<br />\neminent and influential tycoons of the<br />\nMiss<br />\nai to Chapter. They are: Dr. Joseph S.<br />\nof a Communist.<br />\nFrench<br />\nDr. Carl Weber, Hopkins alumnus<br />\n\"Lope's Peregrino and Certain<br />\nas former Supreme Court Justice<br />\nFrench will be taught by only one<br />\nOther victims of this pseudo-Santa bar<br />\nAmes, president; Dr. E. W. Berry,<br />\n.\"<br />\nat present professor at Colby<br />\nand<br />\nDramatists<br />\nthe practice teachers, Miss Regina (chemically speaking) were: Dr. Oliver Wendell Holmes and Prof. Felix<br />\ndean of the College of Arts and Sci- of<br />\nhas written the introduction<br />\nCollege,<br />\nBegin\"The<br />\nFrank:<br />\nTenny<br />\nMrs.<br />\nGrau, who will do her practice work Donald H. Andrews, who was granted Frankfurter, of Harvard, member of<br />\nnovel by Thomas Hardy<br />\nences; Dr. J. B. Whithead, dean of<br />\nearly<br />\nto an<br />\nRooseveltian Brain Trust. After nings of Comedy in France.\"<br />\nFalls Junior High School<br />\ncoed<br />\na bell to hang around his neck; Dr. the<br />\nthe School of Engineering; Dr. W. at Gwynns<br />\npublished in the early<br />\nbe<br />\nto<br />\nis<br />\nwhich<br />\nDr. Raymond D. Havens: \"Wordsbeing associated with law firms in<br />\nNo. 91.<br />\nJ. C. W. Frazer, the heterogeneous<br />\n0. Weyforth, dean of the School of<br />\nof 1935.<br />\npart<br />\nin<br />\nDescribed<br />\ntransas<br />\nHiss<br />\ne<br />\nMr.<br />\nare<br />\nworth's Adolescenc<br />\nBoston and New York,<br />\nTwo will teach science. They<br />\ncombination of bowling pins and peaBusiness Economics; Dr. John C.<br />\nFor many years, this work was<br />\nMiss Kathryne Chambers, who will nuts; Dr. Maurice Huggins, a soap- ferred the family furniture to Wash- Prelude, II, iv.\"<br />\nChristie,<br />\nG.<br />\nA.<br />\nlibrarian;<br />\nhead<br />\nFrench,<br />\nto be entirely lost. Professupposed<br />\nserving<br />\ndo her practice teaching at Western box; and Dr. Walter A. Patrick, a ington, where he is at present<br />\nDr. Hazleton Spencer: \"The Name<br />\nProfessor of mechanical engineering;<br />\nreveals that parts of this<br />\nWeber<br />\nsor<br />\ngenerFrank,<br />\nWhite,<br />\nJerome<br />\nto<br />\nElizabeth<br />\nMiss<br />\nassistant<br />\nas<br />\nSchool;<br />\nand Nature of Drama.\"<br />\nrubber cigar. When last seen, each<br />\nDr. Robert S. Roulston, colilegiate High<br />\nbut<br />\nsubsequently used by the<br />\nwere<br />\nnovel<br />\ncounsel of the AAA, and is also<br />\nat Eastern High School.<br />\nDr. Ernst Feise: \"Goethe's Hexamof these gentlemen, with the possible al<br />\nProfessor of German; R. N. Dempster,<br />\nworks. This will be<br />\nlater<br />\nin<br />\nauthor<br />\nmunithe<br />\nin<br />\nng<br />\nactively<br />\nparticipati<br />\nTo Teach At Western<br />\neter in den Epen.\"<br />\nexception of Dr. Ried, was trying to<br />\nregistrar; Dr. Knight Dunlap, proin America of<br />\npublication<br />\nfirst<br />\nthe<br />\nMiss Catherine Bishop will do prac- palm off his particular gift on the tions probe.<br />\nfessor of experimental psychology;<br />\nMr. Paul M. Spurlin: \"The Problem Hardy's Indiscretions of an Heiress.<br />\nAlthough he professes a great of Montesquieu in America.\"<br />\nDr. L. Wardlaw Miles, collegiate pro- tice work in a commercial subject others.<br />\nfor<br />\nThe Johns Hopkins Press published<br />\nfor the out-of-doors as foremost<br />\nlove<br />\nthe<br />\nof<br />\nHigh.<br />\npresident<br />\nWestern<br />\nat<br />\nBrighton,<br />\nMitchKenneth<br />\nBroadus<br />\nDr.<br />\nEnglish;<br />\nof<br />\nMr. Edward D. Seeber: \"Aphra<br />\nfessor<br />\nfollowing journals during 1934:<br />\nthe<br />\nbesecretly<br />\n13<br />\nwe<br />\nthe<br />\n11,<br />\nhobbies,<br />\nhis<br />\namong<br />\nFebruary<br />\nas<br />\nwith<br />\nserved<br />\nBeginning<br />\nGraduate Activities Couhcil,<br />\nell, associate professor of political<br />\nBehn's Oronoko in France in the 18th<br />\nin<br />\nof<br />\nout<br />\nin chairman of the party. The refresh- lieve that he gets a mean kick<br />\nAmerican Journal of Mathematics<br />\neconomy; Dr. George Boas, professor members of the class in teaching<br />\nCentury.\"<br />\narmtheir<br />\nand<br />\ntheir<br />\nPonts<br />\ndo<br />\ndu<br />\nwill<br />\nthe<br />\ngrilling<br />\nschools<br />\nthe secondary<br />\nAmerican Journal of Philology<br />\nOf philosophy.<br />\nments committee consisted of Edwin<br />\nead<br />\nDelegation Listed<br />\noften.<br />\nso<br />\never<br />\nns<br />\ns<br />\nobservatio<br />\ncompetitor<br />\naments<br />\nindividual<br />\nEsta<br />\nof<br />\nMiss<br />\nweeks<br />\ntwo<br />\nchairman;<br />\n,<br />\nspeakassembly<br />\nRichardson<br />\nJudge Ulman, the<br />\nOthers in attendance included Dr. Biologia Generalis<br />\ner for this week, after his graduation in the classes to which they have VVareheim, Miss Leonora McIntire, Our only fear is that his questions Stefan Einarsson, who acted as sec- Bulletin of the Institute of the Hismay occasion an explosive reaction!<br />\nfrom the Hopkins, took his M.A. at been assigned through the coopera- and Miss Jeannette Parran.<br />\ntory of Medicine<br />\nretary of the Scandinavian Language<br />\nt<br />\nColumbia. He is the author of a tion of the Baltimore City Departmen<br />\nLiterature group; Drs. Kemp Ma- Bulletin of the Johns Hopkins Hosand<br />\n.esS<br />\nPopular book on the panorama of of Education and te principals of the<br />\npital<br />\nlone,'Gustav Gruenbaum, M. L. Rago<br />\na judge sees from the bench various schools. Then, they will do<br />\nhumanity<br />\ndoff, and Emanuel von der Muhl; and Human Biology<br />\nery<br />\nwith<br />\npractice<br />\nteaching<br />\nof<br />\nweeks<br />\ntwo<br />\nin the cases which come before him.<br />\nMessrs. Hyman Shapiro, B. Moris- Johns Hopkins University Circular<br />\nIn his undergraduate days here he the aid of units compiled by them<br />\nsette, R. Uricolo, A. Ferdinand Engel, Modern Language Notes<br />\nWas editor of the 1898 Hullabaloo, and passed by the critic teachers and<br />\nTerrestrial Magnetism and Atmosand L. Walter Rubinstein.<br />\nut<br />\nPresident of the Debating Club in his Dr. Franklin.<br />\nperic Electricity.<br />\nDrs. Frank R. Blake and James W.<br />\nLys<br />\nfreshman year, graduating class poet,<br />\nSachs<br />\nMr.<br />\nAbraham<br />\nand<br />\nPoultney,<br />\nme<br />\nMember of Phi Beta Kappa, and<br />\nparticipated in the Linguistic Society<br />\nof<br />\nscholarship holder for three years.<br />\nmeeting.<br />\nirt<br />\n<br />\nJ. H. U. Contingent Delivers<br />\nNumerous Papers Before<br />\nPhiladelphia Conventions<br />\n<br />\nPresident Ames To Deliver<br />\nFarewell Speech February 22<br />\n<br />\nInaugurates Drive<br />\nTo Increase Membership<br />\n<br />\nwe<br />\nty<br />\nat,<br />\nnat<br />\nas<br />\nis<br />\n<br />\nIntercollegiate<br />\nNews<br />\n<br />\nSuccessor' May Be Announced On Commemoration Day;<br />\nDr. Harold Glenn Moulton, Of Washington, D. C.,<br />\nWill Be The Principal Speaker<br />\n<br />\nDr. Mitchell Speaks<br />\nOn Insurance Bill<br />\n<br />\nDr. Merritt Speaks<br />\nOn Agora Findings<br />\n<br />\nby HYMAN M. LEVIN<br />\nplace in<br />\nDr. Broadus Mitchell, associate<br />\nAccording to the Ursinus Weekly<br />\nWhen President Joseph S. Ames guished as a teacher. His<br />\nprofessor of political economy, adleft-handed ping-pong is being insti- steps down from the rostrum in the science is accredited. His service to<br />\n(Continued from Page 1, Col. 6)<br />\ndressed a massmeeting of 300 people,<br />\ntuted at the University of Michigan Peabody Conservatory auditorium on the country in peace and in war have<br />\nMehling, Ellis, Soifer.<br />\nas a cure for students who stammer. the morning of February 22, follow- been signal . . .\"<br />\nDr. Benjamin D. Merritt, Francis last Thursday night at Lehmann's<br />\n* * *<br />\nTeam No. 5: Wright, captain; Hoyt,<br />\nWhite Professor of Greek at the Johns Hall, on the immediate legislation of<br />\ning his last presidential address on<br />\nWhether the tradition of which Dr.<br />\nRainy, Jones.<br />\nfolbe<br />\nprowill<br />\nthe<br />\nof<br />\nhe<br />\nHopkins University, addressed the an unemployment and social insurThen there's the story<br />\nCommemoration Day,<br />\nTeam No. 6: Blumberg, captain; fessor of international law who sat lowed by Dr. Harold Glenn Moulton, Hollander wrote three years ago will joint conference of the American In- ance bill. He strongly urged the forWiehe, Hannawalt.<br />\nfor an hour waiting for his meal in a president of the Brookings Institute, still remain unbroken when President stitute of Archaeology and the Amer- mation of a lobby to aid in the passTeam No. 7: Watkins, captain; Is- restaurant. Finally his waitress pass- in Washington, who will be the prin- Ames's successor is named remains ican Philological Association in To- age of such a bill by both the nationaacson, Erck, Fertig.<br />\ned and catching her by the arm, he cipal speaker at the marking of the to be seen. Whether or not the five- ronto, Canada, at its session of Fri- al and state governments.<br />\nTeam No. 8: Frey, captain; Bowie, said: \"Change my order to an ulti- fifty-ninth anniversary of the inaug- man committee of the Board of Trus- day, December 28. Dr. Merritt spoke<br />\nDr. Mitchell, who is serving as a<br />\nnierson, Jarman.<br />\nuration of Johns Hopkins Universi- tees will see fit on Commemoration on \"New Inscriptions from the member of the committee to investimatum.\"<br />\nTeam No. 9: Leber, captain; Hur* * *<br />\nDay next month to introduce to the Agora.\" His address was a resume gate unemployment and social insurty's first president.<br />\nWitz, Collins, Skeen.<br />\nIt was at the 1934 commencement friends of the University and to Bal- of a report which will appear in the ance appointed recently by GovernorFrom Thru The Headlines of the<br />\nTeam No. 10: Levi, captain; Alex- St. John's Collegian we learn that exercises last June that President timore the fifth president of the new archaeological periodical The elect Harry W. Nice, told those presander, Bradford, Bealmear.<br />\nent at the meeting to organize pathe Japanese emigrants to Manchu- Ames formally announced his inten- Johns Hopkins also remains to be Hisperia, in the near future.<br />\nTeam No. 11: Kempton, captain; kuo get mail-order wives. That Hit- tion to retire from the presidency of seen. However, it is generally beEarly in February the fifth season rades, to write letters to the newsPrager, Russell, McCarty.<br />\nler proclaims a boycott on a German the institution with which he has lieved that the new president will of the excavation of the Agora will papers, and to generally agitate the<br />\nTeam No. 12: Emmert, captain; hospital in which the staff had the .been associated for 45 years. On the be on the stage of the Peabody au- begin, it was announced. Dr. Merritt, passage of unemployment insurance<br />\nCrouch, Shaw, Coan.<br />\naudicity to vote against him in the fifty-eighth Commemoration Day, ditorium on the morning of February who is a member of the commission bills.<br />\nwhich controls these excavations, surecent referendum. That Mussolini members of the faculty paid tribute 22.<br />\npervises the editing of all epigraphi- •<br />\ndeclares that from now on the Italian to President Ames for the long years<br />\nry<br />\nAnniversa<br />\nFree Manicuring<br />\nFifty-Ninth<br />\nHopthe<br />\nto<br />\ncal texts which are discovered.<br />\ngiven<br />\nhe<br />\nhas<br />\nservice<br />\nletter writer must close his letter of<br />\nlast<br />\nthe<br />\nmarks<br />\nThe 59th anniversary<br />\nmorning, Dr. David<br />\nSaturday<br />\nwith \"Vive il duce\" instead of \"Yours kins as teacher, dean, and president. presidental address on CommemoraFormerly with EMIL CAYE<br />\nprofessor of archaeRobinson,<br />\nMoore<br />\nTribute<br />\nHollander Pays<br />\ntruly.\"<br />\nof the man who began as<br />\nDay<br />\ntion<br />\nCor. St. Paul and 33rd Streets<br />\nW.<br />\nS.<br />\nology and epigraphy, addressed the<br />\n* * *<br />\nThe testimonial on that occasion<br />\nNext to Birely's<br />\nXxhibition To Consist Of Costumes,<br />\nundergraduate at the University and<br />\nCam\"Third<br />\nthe<br />\non<br />\nHollander,<br />\nsame convention<br />\nRecently the War Department has was read by Dr. Jacob H.<br />\n8 A. M. to 8 P. M.<br />\nthat same Univerfrom<br />\nretired<br />\nwho<br />\nPictures, Scripts And Playbills;<br />\nrounding<br />\npaign f Olynthus.\" Dr. Merritt pre•<br />\nannounced that, beginning next sum- renowned economist who is<br />\npresident. It will<br />\nLouis Azrael To Lecture<br />\nSaturday session.<br />\nteaching sity as its fourth<br />\nthe<br />\nof<br />\nyear<br />\nat<br />\nsided<br />\nforty-first<br />\nhis<br />\nout<br />\nwill<br />\nat<br />\nWest<br />\nPoint<br />\ncadet<br />\nevery<br />\nmer,<br />\n•<br />\nmark the retirement of a keen, clearPhone Belmont 7908<br />\n20 hours of flying in- here and who in his 192-page book,<br />\nman who, in anenergetic<br />\nthinking,<br />\nA special exhibition of material receive at least<br />\npublished<br />\nForth,<br />\nHolds<br />\nProfessor<br />\nA<br />\ncourse.<br />\ncollege<br />\nhis<br />\nof<br />\nnouncing his resignation from office<br />\nPertaining to the Baltimore stage struction as part<br />\nearly in 1931, paid his personal tribWill be shown to the Play Production<br />\nat the age of 70, in essence reiterSt. Paul at 33rd Street<br />\nute to Dr. Ames in an editorial \"Hail<br />\nthe words of the man of whom<br />\nOlass of the Johns Hopkins Univer- REGESTER, ENGINEER GRAD,<br />\nns-School Supplies-Candy<br />\nated<br />\nE<br />\nPrescriptio<br />\nMEDICIN<br />\nOF<br />\nSCHOOL<br />\nsaying<br />\nin<br />\nand Farewell.\" He wrote,<br />\nCigars - Unexcelled<br />\nDaniel Coit Gilman,<br />\nprotege,<br />\na<br />\nwas<br />\nsity Playshop at the Municipal Mu- ELECTED A. S. C. E. OFFICER<br />\nhe<br />\nDURHAM, N. C.<br />\nfarewell to Dr. Frank Goodnow and<br />\nFountain Service<br />\nseum. on Friday of this week.<br />\nwho said:<br />\n•<br />\nAmes:<br />\nDr.<br />\nto<br />\nhail<br />\nCivil<br />\nthe<br />\nof<br />\ngiven<br />\nRobert T. Regester,<br />\nare<br />\nweeks<br />\nof<br />\neleven<br />\nterms<br />\nFour<br />\nShowing the history of the Baltchair<br />\nl<br />\n\"I gave up the presidentia<br />\neach year. These may be taken con\"Into so honored a succession comes<br />\nMore stage since the beginning of engineering class of 1905, and a<br />\nsecutively (graduation in three years)<br />\nin the Johns Hopkins University, not<br />\nGilman,<br />\nof<br />\nProtege<br />\nleader.<br />\nnew<br />\nthe<br />\ntheatricals in Maryland, the collection member of the American Society of<br />\nor three terms may be taken each year<br />\nbecause<br />\nnot<br />\nit,<br />\nof<br />\ntired<br />\nwas<br />\nI<br />\nbecause<br />\nGoodof<br />\n(graduation in four years). The enaide<br />\nRemsen,<br />\nof<br />\nassociate<br />\nAmthe<br />\nand<br />\nng<br />\nEngineeri<br />\nl<br />\ncontains pictures, playbills, costumes, Mechanica<br />\ntrance requirements are intelligence,<br />\nHopkins spirit in his I was conscious of bodily infirmity,<br />\ncharacter and at least two years of<br />\n1902 N. CHARLES STREET<br />\nerican Society of Civil Engineering, now, with the<br />\nand scripts.<br />\nwidethe<br />\nto<br />\ndeference<br />\nof<br />\nout<br />\ncollege work, including the subjects<br />\nbut<br />\ntakes<br />\nAmes<br />\nPresident<br />\nmarrow,<br />\nvery<br />\nthe<br />\nat<br />\nA Medical Schools.<br />\nGrade<br />\nfor<br />\nspecified<br />\nOn January 28, the third lecture of while pursuing his studies<br />\nCards - Sending Library<br />\nGreeting<br />\nwhich<br />\nconfidence of spread usage of this country,<br />\nCatalogues and application forms may<br />\na series offered by the Playshop will Hopkins, is now president of the Cen- into office the blanket<br />\nfrom the Dean.<br />\nsenage,<br />\nobtained<br />\nbe<br />\nEvenings<br />\ncertain<br />\na<br />\nOpen<br />\nat<br />\nthat,<br />\nsuggests<br />\nthe<br />\nbe. given by Louis Azrael, dramatic tral Ohio Section of the American all those who love and revere<br />\njuniors.\"<br />\nfor<br />\nway<br />\nmake<br />\nshould<br />\niors<br />\nclistinbeen<br />\nUniversity . . . He has<br />\ncritic of the Baltimore News-Post.<br />\nSociety of Civil Engineering.<br />\n<br />\nPlayshop Class To<br />\nView Stage History<br />\n<br />\nTheodore's Barber Shop<br />\n<br />\nDUKE UNIVERSITY<br />\n<br />\nBirely's Pharmacy<br />\n<br />\nNooney Book Shop<br />\n<br />\n\f4<br />\n<br />\nHOME WOOD, BALTIMORE, MD., JANUARY 8, 1934.<br />\n<br />\nBoxing Squad<br />\nJay Dribblers Jay<br />\nTo Begin Workouts<br />\nSnowed Under Under Coach Lotz<br />\nIn Two Straight<br />\nSquad Of Twenty-Two Men Ready<br />\nFor Instruction In NewlyInstituted Sport<br />\n<br />\nNew York U., West Point<br />\nAggregations Double And<br />\nQuadruple Blue Jay Score<br />\n<br />\nBeginning this week, official boxing practice will be held on every<br />\nTuesday, Wednesday, and Friday<br />\nfrom 4.30 to 5.30, although the equip-<br />\n<br />\nment will be available every day, acSiegel Stands Out cording<br />\nto Ed Lotz, coach of the<br />\nleather-pushers.<br />\n<br />\n• Fleet Hopkins Forward Leads<br />\nTeammates In Scoring As<br />\nThey Lose, 45-12, 45-23<br />\n<br />\nTwenty-two men reported to Lotz<br />\nfor the first boxing practice and have<br />\nbeen working out regularly every<br />\n<br />\nAll-Star Touch Football Team<br />\nSelected By Edwin Lotz And Ronald Levy<br />\nHARTMAN<br />\nCHANCELLOR<br />\nSTEVENSON<br />\nZIERLER<br />\nPOVVELL<br />\nNAYLOR<br />\nFOLLMER<br />\n<br />\nF.B<br />\nHB<br />\nHB<br />\nQ.B<br />\nE<br />\n<br />\nPhi Kappa Psi<br />\nBeta Theta Pi<br />\nOmicron Kappa Omicron<br />\nPhi Sigma Delta<br />\nDelta Upsilon<br />\nPhi Gamma Delta<br />\nE<br />\nPhi Kappa Psi<br />\nHonorable Mention—NEU, A. T. 0.; BILLINGSLEA, D. U.; I-IIMES,<br />\nPhi Kappa Psi; SHIFF, Phi Sigma Delta.<br />\n<br />\nVersatile Group Selected By Football Eleven Chooses<br />\nIntramural Directors Rep- Pasarew As Next Captain<br />\nresent Star Performers<br />\n<br />\nTrophy Points And<br />\nfinal Standings<br />\n<br />\nPhi Kappa Psr-LN1<br />\nTo Get Troph)—<br />\n<br />\nPoints Toward Trophy<br />\n15 points for a game won, 10 points<br />\nfor a tie, 5 points for a game played<br />\nAt Thursday's assembly, Phi KapG1<br />\nand lost.<br />\npa Psi, winner of the fraterni0<br />\nad<br />\ntouchball tournament, will be pre<br />\nPhi Kappa Psi<br />\nj<br />\nfa<br />\n105<br />\nsented a plaque emblematic of it a<br />\nPhi Sigma Delta<br />\n90<br />\nchampionship. This award will re•<br />\nDelta Upsilon<br />\n80<br />\nmain in the permanent possession o<br />\nli<br />\nBeta Theta Pi<br />\n70<br />\nthe fraternity.<br />\nKappa Alpha<br />\n70<br />\nDr. G. Wilson Shaffer, director of<br />\nPhi Gamma Delta<br />\n65<br />\nintramural athletics, announced thac,<br />\nKappa Sigma<br />\n65<br />\nplaques will be awarded during<br />\nAlpha Tau Omega<br />\n65<br />\ncourse of the year to the four &ate''<br />\n, 1<br />\nSigma Phi Epsilon<br />\n65<br />\nnities winning the basketball, volley. T<br />\nOmicron Kappa Omicron<br />\n50<br />\n.1.'<br />\nball, lacrosse, and playground ball<br />\nPhi Alpha<br />\n45<br />\ntournaments.<br />\nThe<br />\nbasketball<br />\nan<br />\nPi Lambda Phi<br />\n30<br />\nvolleyball tournaments are now i W.<br />\nTau Alpha Omega<br />\n25<br />\nprogress.<br />\nDelta Phi<br />\n20<br />\nAt the end of the year the frater-p v<br />\nnity getting the highest total of point a y<br />\nDivision A<br />\nin all sports will be awarded a large<br />\nL<br />\nPhi Kappa Psi<br />\n6<br />\n0 0 12<br />\ntrophy for one year. Should any frai<br />\nBeta Theta Pi<br />\n2<br />\n2<br />\n2 6<br />\nternity win this cup three times it<br />\nKapp Alpha<br />\n2 2 2 6<br />\nwill be given permanent possession Tb<br />\nPhi Gamma Delta<br />\n2<br />\n1<br />\n3<br />\n5<br />\nof it.<br />\nenco<br />\nSigma Phi Epsilon<br />\n2<br />\n1<br />\n5<br />\nPoints toward the trophy are lege<br />\nOmicron Kappa<br />\nawarded on the basis of fifteen for a,eolel<br />\nOmicron____ 2<br />\n4 0 2<br />\nwin, ten'for a tie, and five for a game new<br />\nDelta Phi<br />\n0 6<br />\n0 0<br />\nplayed and lost.<br />\n• the<br />\n<br />\nthendeli<br />\n<br />\nLen Emmert To Lead Cross-Country<br />\nBy EDWIN LOTZ<br />\nTeam In 1935 Campaign;<br />\nJohn Macgill, Manager<br />\nThe abundance of good football<br />\nafternoon. Six of the men have had players in the league made the<br />\nselectAt a meeting held before the holiThe Jay dribblers bowed twice on previous boxing experience and should ing of an all around star team a<br />\ndays, Reuben Pasarew was elected<br />\na disastrous northern jaunt. Friday form a capable nucleus for any team<br />\nproblem of deciding on the All-Star captain and John Macgill,<br />\nmanager of<br />\nnight it was to New York University Hopkins might put out. These<br />\nvet- men who could play any other posi- the varsity football team<br />\nfor the 1935<br />\nby a score of 45 to 12 and Saturday<br />\nerans are Caleb Ewing, Harold Glas- tion on the team equally as<br />\nwell as season. Among the veterans who will<br />\nnight it was to the Kaydets of West<br />\nreturn along with Pasarew are Vinser,<br />\nJohn Stevens, Lopez-Dupre, Ber- the one for which he was<br />\nPoint to the tune of 45 to 23.<br />\nselected.<br />\ncenti, Kelly, Graziano, Ellis and Halnard<br />\nVincenti, and Wiseman.<br />\nFor the first fifteen minutes of<br />\nPhi Kappa Psi, the winners of the<br />\nbert.<br />\nthe Army game the two teams battled<br />\n\"All of the novices are taking to league, was the only<br />\nfraternity to<br />\nThe cross-country team elected<br />\non even terms, the score being 11-10 the sport exceptionally well and<br />\nplace more than one man on the Leonard Emmert captain and Roy<br />\nin favor of the Army at this point. should develop some class with pracThen with but five minutes to go in tice,\" Coach Lotz stated. \"Don Nay- team. Chancellor and Follmer, both Hartman manager for the 1935 seaEmmert,<br />\nperforming<br />\nwell<br />\nDivision 13<br />\nthe first half the Graylegs ran up 12 lor,\" he added, \"especially has de- excellent all around performers for son.<br />\nthroughout the season, finished tenth Phi Sigma Delta<br />\n5<br />\n0<br />\npoints and a 23-10 lead.<br />\nveloped surprisingly fast.\"<br />\nthe champions, were selected. The<br />\nin a large field in the South Atlantics. Delta Upsilon<br />\n3<br />\n1<br />\nIn the second half Wright Hiatt,<br />\nPromising Squad<br />\npassing ability of Chancellor made<br />\nBesides Emmert, the hill-and-dalers' Alpha Tau Omego<br />\n2<br />\nSoldier captain and center, looped in<br />\nBesides Naylor, Lotz picked Charles him invaluabe to<br />\nhis team and also coach, Waldo Hambleton, is expect- Kappa Sigma<br />\n• 2<br />\n1<br />\nfour baskets to make his total points Mewshaw, Jackson Kaufman, R. L.<br />\n4<br />\n1<br />\n18 for the evening. Dewalt, who star- Lowrey, and John Weber as the men his excellent blocking ability gave him ing back next year Brown, Cas- Phi Alpha<br />\n4<br />\n1<br />\nred against Hopkins last year with showing most promise of developing the edge over Billingslea of the Delta telle, Schultz, Weber, Sholtes, and Pi Lambda Phi<br />\nLyman.<br />\nTau Alpha Omega<br />\n0 5<br />\n14 points, shot five field goals in this into first class boxers.<br />\nUpsilon.<br />\nsecond half to run his evening's total<br />\nArrangements are under way to<br />\nPowell, Folmer, Ends<br />\nup to 12.<br />\nhave the men on the squad who develThe two ends, Powell and Follmer,<br />\nSiegel Stars<br />\nop enough skill engage in weekly both played in the<br />\nbackfield at times<br />\nThe brightest spot for the Blue was bouts with the boxers of the differand could have been chosen for those<br />\nthe cavorting of Herbie Siegel who ent clubs around Baltimore.<br />\nThe<br />\nled his teammates with two field Martin A. C. and the Stonewall Dem- positions. They were chosen as ends<br />\nbecause of the lack of any outstandgoals and three fouls for 7 points.<br />\nocratic Club both have weekly conOn Friday night, N.Y.U. gained its tests and if possible the Hopkins ing performers for these positions.<br />\nBoth are excellent pass receivers and<br />\nfifth win of the season and its twen- squad will participate in them.<br />\nare good blockers.<br />\nty-first consecutive triumph by buryBut they tell us they don't mind it half so much<br />\nCoach Lotz urged that all men who<br />\nThe all important position of<br />\ning Hopkins under a 45-12 score.<br />\nare interested in learning the manly<br />\nHutzler's, where—<br />\nTen men figured in the Violet scor- art of self-defense report as soon as quarterback goes to Zierler of the Phi<br />\ning, none of them accounting for possible in order to learn the funda- Sigma Deltas. His devising of plays<br />\nWhat you want is easy to find.<br />\nmore than 8 points. Willie Rubenstein mentals. Practice all next week will and uncanny ability of crossing up<br />\nYou get efficient service.<br />\nand Joe Greenberg, brother of Hank still be on fundamentals, Lotz stated, the defensive teams makes him the<br />\nGreenberg of the Detroit Tigers, each but after that the various punches outstanding performer for that posiPrices are reasonable.<br />\ntion.<br />\nchalked up 8 points to lead the tally- will be taught.<br />\ning.<br />\nIf the squad shows sufficient promThe center position, one which reJays Use Nine Men<br />\nise the coaching staff will make ef- quires good blocking was given to<br />\nAlthough he rang up only 4 points, forts to arrange varsity competition Naylor, because of his general all<br />\nSiegel again led the Jays. No Hop- with outside schools.<br />\naround versatility.<br />\nkins man got more than one field<br />\ngoal. As in the Army game, Coach<br />\nDarley used nine men.<br />\nSince the Hopkins game, N.Y.U.<br />\nhas brought its string of consecutive<br />\nvictories to twenty-two with a 23-22<br />\nedge over the University of Kentucky.<br />\nTonight Darley's Blue Basketeers<br />\njourney to Emmitsburg to lift the lid<br />\nof the 1935 Maryland Intercollegiate<br />\nLeague campaign. Friday they open<br />\nthe Homewood cage to intercollegiate<br />\ncompetition with a league fracas with<br />\nWashington College.<br />\nHopkins<br />\nN.Y.U.<br />\nG. F. T.<br />\nG. F. T.1<br />\nSiegel<br />\n1 2 41Maidman 0 2 2<br />\nWoodrow 0 O 01Machtwitz 3 0 6<br />\nZheutlin 0 O 01Greenb'g 4 08<br />\nReynolds 1 1 31Gross<br />\n4<br />\n2<br />\nSiverd<br />\n1 O 21Weinstein 2<br />\n4<br />\nRaisin<br />\n2<br />\n1 1 31Schulman 1<br />\nChan'llor 0 O 010'Neill<br />\n4<br />\n2<br />\nBranower 0 O 01Rub'stein 4<br />\n8<br />\n4<br />\nRubinger 0 O 01Geffen<br />\n2<br />\n3<br />\n1<br />\n'Strauss<br />\n- —1<br />\n— — —<br />\nTotals<br />\n4 4 121 Totals 4 4 12<br />\nHopkins<br />\nArmy<br />\nG. F. T.<br />\nG. F. T.1<br />\nWoodrow 1 2 41Meyer<br />\n0 1 1<br />\nSiegel<br />\n2 3 71Cummings 0 0 0<br />\nChan'llor 3 O 61Stancook 2 1 5<br />\n6 0 12<br />\nRaisin<br />\n0 O OlDewalt<br />\nReynolds 1 4 61West'land 0 0 0<br />\nZheutlin 0 0 01Hiatt<br />\n8 2 18<br />\nSiverd<br />\n0 O lUn'wood 2 1 5<br />\nMcCarty 0 O 0Hold'man 0 0 0<br />\n1 0 2<br />\nRubinger 0 O 01Clifford<br />\n1 0 2<br />\nI Burke<br />\n— — —<br />\n— —1<br />\nTotals 7 923<br />\n20 545<br />\n<br />\nOf<br />\n<br />\n1 11<br />\n0 10<br />\n1<br />\n7<br />\n3<br />\n7<br />\n1<br />\n3<br />\n0 2<br />\n0 0<br />\n<br />\n101 E. 21st St.<br />\n<br />\nCH. 9849<br />\n<br />\nPeabody Pharmacy<br />\n<br />\nfi.ve<br />\nin t<br />\nLeal<br />\nNo delivery too small. Bel. 5318<br />\nTI<br />\n<br />\nCHARLIE<br />\nat<br />\n<br />\nDER<br />\n<br />\nFIRST CLASS LAUNDRY<br />\n3224 GREENMOUNT AVE.<br />\nButtons Sewed On, Stockings<br />\nMended, and all Needed Repairs<br />\nAt No Extra Charge<br />\n<br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and SCIENTIFIC<br />\nPUBLICATIONS<br />\n12-20 HOPKINS PLACE, BALTIMORE<br />\n<br />\nI do believe<br />\nIll try one<br />\n<br />\nGames This Week<br />\n<br />\n—deyalleo saythy.. THEY'RE MILDER<br />\n-anciikar<br />\nsa3.. THEY TASTE BETTER<br />\n(0 1935, LIGGETT & MYERS TOBACCO CO.<br />\n<br />\na le4<br />\noyez<br />\nexpl<br />\nthe<br />\nvelo<br />\nbar]<br />\n<br />\nnew<br />\ncyst<br />\n<br />\nshot<br />\ntice<br />\n<br />\n•<br />\n<br />\nZavidkrakS/<br />\n<br />\nBASKETBALL<br />\nTHURSDAY, JANUARY 10<br />\nKappa Alpha vs. Kappa Sigma,<br />\n2nd court-2 p. m.<br />\nDelta Upsilon vs. Phi Alpha, 1st<br />\ncourt-1 p. m.<br />\nTau Alpha Omega vs. Alpha Tau<br />\nOmega, 3rd court-2 p. m.<br />\nOmicron Kappa Omicron vs. Sigma<br />\nPhi Epsilon, 2nd court-1 p. m.<br />\nPi Lambda Phi vs. Phi Gamma<br />\nDelta, 1st court-2 p. m.<br />\nAlpha Delta Phi vs. Delta Phi,<br />\n3rd court-1 p. m.<br />\nVOLLEYBALL<br />\nPhi Kappa Psi vs. Phi Gamma Delta, 3rd court.<br />\nBeta Theta Pi vs. Alpha Delta Phi,<br />\n1st court.<br />\nPi Lambda Phi vs. Phi Sigma Delta, 4th court.<br />\nDelta Phi vs. Tau Alpha Phi, 2nd<br />\ncourt,<br />\n<br />\nTI<br />\n<br />\nPron<br />\nHop'<br />\nWas<br />\nthen<br />\n<br />\nCALVERT and 30TH STS.<br />\nFirst in Quality — First in<br />\nService<br />\n<br />\nWE KNOW<br />\nMEN HATE TO SHOP<br />\n<br />\nHUTZLER BFOINElt 0';<br />\n<br />\nFRIED'S<br />\nFOR CLEANING, DYEING and<br />\nPRESSING—Reasonable Rates<br />\nWe Call For and Deliver<br />\n<br />\n/<br />\n<br />\nPast<br />\nthe<br />\nkins<br />\nlege<br />\n<br />\nclevc<br />\nthal<br />\ngayy<br />\ntall<br />\nti<br />\nred<br />\n<br />\nSpi(<br />\n1211E<br />\nexp<br />\nray)<br />\n<br />\nrea<br />\n<br />\ntips<br />\n<br />\nsho<br />\n110]<br />\n<br />\niv<br />\nber<br />\naric<br />\ngu<br />\nan(<br />\n<br />\nwil<br />\nPr(<br />\n<br />\nPro<br />\n<br />\n\f", "format": "basic_html", "processed": "MEMBER OF THE<br /><br />\nMI<br /><br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nVol. XXXIX—No. 21.<br /><br />\nr whir<br />\ntast<br />\n-=<br />\n;e<br />\nrdina<br />\nojudge<br />\n3n c<br /><br />\nstrip<br /><br />\ntal. I<br /><br />\nUlman<br />\n1-uest Speaker<br />\nO.D.K.Elects<br /><br />\n10.04115 iqopkittu Nrinairattrr<br /><br />\nIS THERE A DOCTOR IN<br />\nTHE HOUSE? VISIT<br />\nAn Autopsy On Naples\"<br />\nPage Two<br /><br />\nHOME WOOD, BALTIMORE, MD., TUESDAY, JANUARY 8, 1934.<br /><br />\nPrke, 5 Cents<br /><br />\nAmes, Former Member Of<br />\nTo Preside At 0. D. K. Assembly League,<br />\nTo Give Talk On \"Y\" Membership Drive Begins<br />\nProposed Balkan Entente<br />\nSir Herbert Ames, former Financial Director of the League of Nations Secretariat, will deliver the<br />\nSchouler Lecture next Tuesday in Latrobe Hall at 5 p. m. His topic will<br />\nbe \"The Little Entente and the Proposed Balkan Entente.\"<br />\nSir Herbert was a former member<br />\nof the House of Commons at Montreal (1904-1921) and president of<br />\nthe Volunteer Electoral League. He<br />\nhas travelled through many parts of<br />\nthe world and has made a special<br />\nstudy of social and political conditions.<br /><br />\njasiniqS<br /><br />\nonorary Activities Society<br />\nTo Initiate New Members<br />\nAt Assembly On Thursday<br /><br />\neaders Selected<br /><br />\nGroup Sets High Standards<br />\nIn Athletics, Scholarship,<br />\n1935<br />\nle ek<br />\n, keep Publications, And Societies<br /><br />\nkkel<br /><br />\nFour Seniors, Two<br />\nJuniors Inducted<br />\nInto Tau Beta Pi<br /><br />\nWith Levering Hall Banquet;<br />\nWill Last Until Friday Noon<br />\nPlans For Gaining 300 New<br />\nDr. Cook Lectures<br />\nDiscussed; Four<br />\nToday At 50n West Members<br />\nDivisions In Drive Group<br />\nIndian Hurricanes<br />\nPrizes To Be Given<br />\nPlant Pathologist Of Porto<br />\nRican Experiment Station Workers Turning In Highest<br />\nNumber Of Members To<br />\nTo Show Slides In Latrobe<br />\nGet Awards; 48 In Drive<br /><br />\nProfessor Mel T. Cook, pathologistin-chief at the Insular Experiment<br />\nLt an)<br />\nA report issued late last night<br />\nStation, Rio Piedras, Porto Rico, will<br />\nyet xi As one of the strongest links in<br />\nby<br />\nDr. E. A. Schaal. executive<br />\ngive an illustrated lecture on \"West<br />\nin<br />\nT. BAYARD WILLIAMS, JR.<br />\ni ptbthe chain of 37 chapters of the naIndian Hurricanes\" today at 5 p. m. secretary of the Hopkins Y. M. C.<br />\nPresident<br />\nA. and generalissimo of the curr troutional honorary activities fraternity,<br />\nin Latrobe Hall.<br />\n/f<br />\nJUDGE JOSEPH N. ULMAN<br />\nrent<br />\nmembership drive, announced<br />\nFeatured<br />\nin<br />\nDr.<br />\nCook's<br />\naddress<br />\nwill<br />\nthe Johns Hopkins chapter of OmiGuest Speaker<br />\n—Courtesy Sunpapers.<br />\nbe slides showing remarkable views that 39 of the undergraduates serv(Right)<br />\ncron Delta Kappa, at Thursday's asof hurricanes in full force. These will ing as campaigners had already<br />\nsembly will introduce those men<br />\npledged $131 to the fund.<br />\nreveal the extent of destruction and<br />\n)35<br />\nan,Whom they have chosen as underhavoc the hurricanes are able to exert<br />\nFour seniors and two juniors were<br />\nEC\"elgraduate leaders and will present as<br />\nProminent In Plant Study<br />\nSplit up into four divisions, each<br />\nmale<br />\nformally initiated into the Johns<br />\nDr. Cook is very prominent as a managed by a prominent campus figfdguest speaker the prominent member<br />\nHopkins chapter of Tau Beta Pi, na- student of plant geography and plant ure, a group of Hopkins<br />\nstudents set<br />\nchrouof the Supreme Bench of Baltimore,<br />\ntional honorary engineering frater- diseases, having served in the Cuban out last night in an effort to gain<br />\nsh(*Judge Joseph N. Ulman, an alumnus<br />\nIan 0<br />\nnity, at the assembly held last Thurs- Experiment Station at Santiago members for the Y. M. C. A. Their<br />\nive.\" of the class of 1898.<br />\nday. Due to illness the scheduled (1904-1907), at the Delaware Exper- goal is set at three hundred new<br />\nWhen the laurel leaf is pinned on<br />\nspeaker, Dr. Alexander Graham iment Station (1907-1911), at the members and six hundred<br />\ndollars for<br />\nthe lapel of each initiate on Thursday<br />\nChristie, professor of mechanical en- New Jersey Experiment Station and the<br />\norganization's treasury.<br />\nMorning by the 0. D. K. president,<br />\ngineering, was unable to deliv'er the in the State Department<br />\n35<br />\n(1911-1923).<br />\nThe four divisions, each composed<br />\nslid,a•ayard Williams, it will symbolize<br />\nillustrated lecture of his trip through<br />\nHe received his degree of doctor of of three teams, are headed by Burfratereach<br />\nby<br />\nthe<br />\nrecognition<br />\nman's<br />\nbetW<br />\nCanada to the new initiates and un- philosophy at Ohio State<br />\nUniversity ton G. Cannon, Jr., Carson G. Franey,<br />\nttopeolity as one who has attained a high<br />\ndergraduates.<br />\nin 1904 after having served as Fellow David H. Levy, and William C. Mcstandard of efficiency in the Hopkins<br />\nIn honor of Dr. Joseph S. Ames,<br />\nJohn Mitchell, president of the from 1901 to 1902.<br />\nDr. James Hart, associate profesDverec<br />\nFrom 1902 to Clean.<br />\nn_zir activities, whose character and work retiring president of<br />\nthe Johns Hop- sor of political science, has been Hopkins chapter, announced the fol- 1903 he was a lecturer at<br />\nIndianapA dinner was held last evening in<br />\ngroups<br />\nand<br />\nundergraduate<br />\nseveral<br />\nrein.<br />\nre,<br />\nkins University, Phi Delta Kappa and appointed to serve on the Federal lowing students as having fulfilled the olis at the Central<br />\nCollege of Physi- Levering Hall for the members of the<br />\nWhose scholarship is of the highest. Pi Lambda Theta, men's and women's<br />\nRegional Labor Relations Board for requirements for election to the group. cians and Surgeons.<br />\ndrive to discuss pans for the camInitiates Recognized Leaders<br />\nnational education fraternities, will the Fifth District, which is composed<br />\nPalmer Hager, a senior in chemical<br />\nHe has written many works of paign, and there will be luncheons<br />\nInitiates are selected from recog- hold a dinner at the Hotel Emerson, of Maryland, the District of Colum- engineering.<br />\nplant life, including a section of a at which reports will be given every<br />\nnized leaders in the following Saturday, at which the noted educa- bia, Virginia and parts of West VirDaniel Stetka, a senior in mechani- natural history survey of Porto<br />\nRico day unti the drive is completed on<br />\nbranches of college activity: athlet- tor, Dr. Isaac L. Kandel, will be the ginia and Delaware.<br />\ncal engineering.<br />\nand the Virgin Islands, published by Friday.<br />\nICS, scholarship, publications; social principal speaker.<br />\nForbes Whisler, a senior in mechan- the New York Academy of<br />\nThe board is comprised of men repSciences.<br />\nReceive Membership<br />\nleadership, including conspicuous<br />\nDr. David E. Weglein, associate resenting the employer, the laborer ical engineering.<br />\nRegular membership tickets, recservice to the Hopkins; non-athletic professor of education at the Hopkins and the public. In accepting the apWilliam Witte, a senior in electrical<br />\nognized as privelege cards in Y. M.<br />\nactivities, exclusive of publications. and superintendent of public instruc- pointment Dr. Hart assumed the lat- engineering.<br />\nC. A. organizations all over the coun7;<br />\n4 It is a recognized fact that the stand- tion in Baltimore City, will be<br />\nJoseph Bullock, a junior in mechantoast- ter obligation. He will listen with<br />\ntry, will be issued to each student doards of scholarship are not as high master at the banquet, which<br />\nical<br />\nengineering.<br />\nwill get other prominent business men and<br />\nnating $2.00. For any contributions<br />\nas Phi Beta Kappa, but the 0. D. under way at 6.30 p. m. and which labor heads to cases pertaining to<br />\nLeonard Emmert, a junior in elecover that amount, a sustaining memchapter here demands a \"respec- will be attended by many teachers, Section 7A of the National Industrial trical engineering.<br />\nbership will be given, according to<br />\ntable general average\" before eligiGives History Of Group<br />\nRecovery Act.<br />\neducators, and public officials.<br />\nDr .E. A. Schaal, executive secretary.<br />\nbility can be considered.<br />\nPreceding the announcement of the<br />\nStudied At Hopkins<br />\nInvitations Mailed<br />\nAny contributions up to $5.00 will<br />\nIORS<br />\nIn his address on the significance<br />\nDr. Hart has been at Hopkins since successful undergraduates, Mitchell<br />\nInvitations were being mailed yesdeducted from the regular membe<br />\n— I Of 0. D. K., given during 1931-32,<br />\n1926 as an associate in political sci- gave a brief history of the founding<br />\nterday from the office of Dr. Florence<br />\nbership<br />\nin the event that the contribof<br />\nTau<br />\nBeta<br />\nPi<br />\nat<br />\nbouglas Cotton, who was graduated<br />\nLehigh University<br />\nence. He is a graduate of the UniE. Bamberger, professor of education<br />\nutor qualifies for any sort of memIn 1922 and who was the originator<br />\nversity of Virginia, having been elect- in 1885. Continuing, he stated that<br />\nhere.<br />\nbership at the Central Y. M. C. A.<br />\nOf the Varsity Seal as well as editor<br />\ned Phi Beta Kappa. The University the honorary fraternity was founded<br />\nDr. Kandel, who lectured at the<br />\nThe teams are as follows:<br />\nOf the NEWS-LETTER, declared the<br />\nconferred a Ph.D. degree on him in mainly because Phi Beta Kappa erTeam No. 1: Feise, captain; Jay,<br />\nhonorary fraternity \"a working or- Johns Hopkins in 1930-31, is himself 1923. He has also taught at the Uni- eluded engineering students at colThe speaker for the annual lecture<br />\na member of Phi Delta Kappa. He is<br />\nganization—the clearing house for<br />\nversity of Michigan and at Harvard. leges and universities. At present of the Tudor and Stuart Club will be Sears, Kemp, Vincenti.<br />\nthe author of the widely used textTeam No. 2: Gilbert, captain; Stecollege problems, the melting pot of<br />\nHe has written several treatises on Tau Beta Pi has a membership of 65 Dr. Elmer E. Stoll, professor of Engbook, History of Secondary Educacollegiate opinion.\"<br />\nsubjects dealing with the Constitu- active chapters with the total mem- lish at the University of Minnesota. vens, Canning, Pinkerton.<br />\ntion, among others. The prominent<br />\nTeam No. 3: Reuling, captain;<br />\ntion and law. At present Dr. Hart is bership of the fraternity being nearly His subject will be \"The Poetical<br />\nOrganized In 1916<br />\neducator has been associated with<br />\nGambrill, Ghinger.<br />\n23,000.<br />\nTreatment<br />\nof<br />\nin<br />\nthe<br />\nof<br />\na<br />\ndifferent<br />\nCharacters<br />\nin<br />\nmidst<br />\nwork<br />\nHomer<br />\nwhich<br />\nThe Hopkins chapter, which was Columbia University's Teachers' ColTeam No. 4: Murphy, captain;<br />\nEach year members of the active and Shakespeare.\" February 16 has<br />\norganized in 1916 when the mother lege since 1914. He joined the fac- he characterizes as \"just my own<br />\n(Continued on Page 3, Col. 1)<br />\nchapter elect students from the sen- been set as the date for the lecture,<br />\nthoughts<br />\non<br />\nthe<br />\npresent<br />\nsituation.\"<br />\nChapter at Washington and Lee Uni- ulty there as a lecturer and in two<br />\niors who have been in the upper which is to be held in Levering Hall.<br />\nversity turned to this University two years was appointed associate. In<br />\nquarter of their class and the juniors<br />\nDr. Stoll received his A.B. degree<br />\nYears after 0. D. K.'s origin for aid 1923 he was promoted to a full pro- GAS ENGINEERS ASSN.<br />\nwho have been in the upper eighth at the College of Wooster in<br />\n1893, and<br />\nestablishing a national society fessorship in the Teachers' College<br />\nTO MEET IN AFTERNOON of<br />\ntheir class. However, the quali- two years later graduated from<br />\nHarWhich would give outstanding dis- and an associate in the Columbia<br />\nThe Gas Engineers Association will ties of manliness, friendliness and the vard<br />\nUniversity with an A.B. degree.<br />\ntinction to deserving members on the University's International Institute.<br />\nhold its regular monthly meeting to- likelihood to succeed are taken very<br />\nFollowing his successful completion<br />\nTwo men out of eight candidates<br />\ncampus, has always served as a<br />\nFor four years he was associate ed- day at 4.15 P. M. in room 110, Mary- strongly into consideration before an of the M.A. degree<br />\nrequirements at were designated as the representaives<br />\nclearing house for University probitor of Monroe's Encyclopedia of Ed- land Hall.<br />\nundergraduate may be elected.<br />\nHarvard, Dr. Stoll entered the Adel- to try for the Rhodes Scholarship by<br />\nlerns. It has gone into innumerable<br />\nucation. Dr. Kandel took his Ph.D.<br />\nphi College at Brooklyn, New York, the committee of this district which<br />\nconferences with the President and<br />\ndegree at Columbia in 1910, after<br />\nas an instructor in English.<br />\nbean here and has pushed many promet Saturday in the office of President<br />\nholding a fellowship there for two<br />\njects aimed at bettering the Hopkins<br />\nJoseph S. Ames.<br />\nStudied In Germany<br />\nyears.<br />\nIn general. During the past two years<br />\nTwo years later he embarked for<br />\nM. Gordon Knox of 211 Wendover<br />\nlt was instrumental in making HonGermany, where he studied at the road and a graduate of Yale UniverOr System, athletics system, and stuUniversity of Berlin. Several years sity in 1934 and Robert L. Burwell,<br />\ndent activities control improvements.<br />\nlater he received a Ph.D. degree at Jr., of Annapolis and a graduate of<br />\nNot only does it elect men in recthe University of Munich. On his re- St. John's College in 1932 were the<br />\n°gnition of leadership and good charturn to America he became an in- two successful candidates. They<br />\nacter, but, according to its aims, the<br />\nstructor in English at Harvard Uni- were judged yesterday at Swarthmore<br />\nMade Vice-President, Lectures Be(Continued on Page 3, Col. 1)<br />\nversity. From here he went to West- by the committee for the Middle Atfore Archaeological Institute<br />\nern Reserve University as a professor lantic District.<br />\nOf America<br />\nNow that Christmas has come and on the last day of college before the<br />\nof English. In 1915 he entered the<br />\nLouis E. Reuling, a junior in the<br />\ngone the attention of the newly- holidays. A good time was had by faculty of<br />\nthe University of Minne- College of Arts and Sciences and<br />\nall,<br />\nincluding<br />\nthe<br />\ntwo<br />\nnewly-initiated<br />\nThe Archaeological Institute of<br />\nformed League for Grammatical Corsota, a position that he has held since John N. Kopper were the two canmembers of the League, Harold<br />\nAmerica elected Dr. David M. Robthat time.<br />\nrectness in Speech, inspired by an<br />\ndidates from Hopkins.<br />\nSampson and John Steeper, the stuinson of the Johns Hopkins depart\"shall\"<br />\nof<br />\nusage<br />\nBesides his various teachings and<br />\nthe<br />\nargument<br />\nover<br />\ndent employees in the department of<br />\nart<br />\nand<br />\nof<br />\nment<br />\narchaeology<br />\nto<br />\nthe<br />\nClub To Discuss Plans For Coming<br />\noffice of first vice-president of the In- and \"will,\" is being directed toward education who brought the member- studies, Dr. Stoll is well known for<br />\nMonth; Young, Doub, Crouch,<br />\nhis many lectures and writings on litstitute. The election took place at another fund to be built from its ship up to six, and Miss Mary Levin,<br />\nAre Officers<br />\nerature,<br />\nespecially those of Shakessecretary<br />\nto<br />\nthe<br />\ndepartment.<br />\nToronto on December 28, and followed penny-per-grammar-error plan. This<br />\npeare. He has edited many Shakesby<br />\nDr.<br />\naddress<br />\nRobinson<br />\non<br />\nhis<br />\nan<br />\nfor<br />\nraised<br />\nenough<br />\nbe<br />\ntime<br />\nmoney<br />\nwill<br />\nIt'was<br />\nannounced at the Christmas<br />\nRecent receipt of a letter from<br />\nThe DeMolay Club will hold its<br />\npearian works and is an acknowlan Easter vacation party.<br />\nparty, the first social event of the<br />\ncentral office of the Associallext meeting this Thursday at 6 p. m. excavations at Olynthus.<br />\nthe<br />\nedged authority on the subject.<br />\nReceipt of a shipment of mosaics<br />\nAnd Grand Treasurer Margaret L. penny-per-grammar-error group, that<br />\ntion of College Editors furnished<br />\nill Levering Hall, and will discuss<br />\nnotice that ballots for the A.C.E.Plans for activities for the coming from Athens just before the Christ- Coard, whose grand idea the League an amendment was made in the<br />\nmas holidays enabled Dr. Robinson to was, is praying fervently that the League constitution which calls for ARCHAEOLOGICAL BOOKS<br />\nLiterary Digest Peace Poll will be<br />\nroonth.<br />\nDONATED TO UNIVERSITY<br />\nmailed this week, Stanley E.<br />\nThe DeMolay Club was founded at show some very interesting slides on members won't get too grammatic- the same one cent fine for poor enunpronunciation.<br />\nciation<br />\nperiod,<br />\nas<br />\nillustrated<br />\nand<br />\nbad<br />\nthe<br />\ncorrect<br />\nin<br />\nin<br />\nand<br />\nart<br />\nof<br />\ntheir<br />\nspeech<br />\nthe<br />\nally<br />\nBlumberg, editor of the NEWS40Pkins in 1931, with the purpose of<br />\nLady Walston of London recently<br />\naround the education conference room<br />\nLETTER,<br />\nannounced<br />\nyesterday.<br />\nPromoting the spirit of fellowship, in these specimens.<br />\nMore Money Needed<br />\nin Gilman Hall. She believes that the<br />\nThey are to be distributed in the<br />\n\"We must have a bigger treasury,\" selected the library of the Johns<br />\nand furthering social relations beparty simply must be held.<br />\npostoffice box of every undergradMiss Coard asserted at the time. Hopkins University as the receiver<br />\ntween the members of the Order of DR. RALPH MAGOFFIN TO<br />\nof a valuable collection of archaelogiuate at the University.<br />\namendment<br />\n\"By<br />\nadding<br />\nthis<br />\nwe'll<br />\nbe<br />\n1)eMolay, and the majority members<br />\nHave<br />\nParty<br />\nSPEAK ON ARCHAEOLOGY<br />\ncal works.<br />\n(lf the Order of DeMolay, who are stu\"Those undergraduates who do<br />\nAccording to rumors, it was she sure of that--unless the members deThe books are from the private<br />\ndents of the Johns Hopkins Univernot have postoffice boxes and who<br />\nDr. Ralph Van Deman Magoffin, who planned on using the Christmas cide it's safer to keep quiet than to<br />\nsity.<br />\nlibrary of Sir Charles Walston, disare desirous of marking a ballot,<br />\nformer associate professor of ancient fund money with which to purchase talk!\"<br />\nshould see me in the NEWSThe Easter vacation party, sched- tinguished British scholar and excaRoy B. Young is president, and is history at the Johns Hopkins Univer- an additional box of tea for the weekassisted by Emmett Doub and Ed- sity, will deliver a public lecture in ly department of education teas. But uled for the week of March 18, with vator, who was at one time director<br />\nLETTER office this week,\" BlumWard Crouch in the offices of vice- Latrobe hall on January 23. The lec- when it was loudly hinted that im- the new amendment in effect, should of the American School of Archaeberg said. \"For their benefit we<br />\nhave ordered an additional numPresident and secretary - treasurer, ture, sponsored by the Baltimore peachment might follow were this be a howling success—with perhaps ological Studies in Athens.<br />\nThe collection contains between<br />\nber of ballots.\"<br />\nrespectively. Thomas F. Hubbard is Archaeological Society, will deal with done, Grand Treasurer Coard ordered four quarts of ice-cream and more<br />\n150 and 200 volumes.<br />\ntile faculty advisor.<br />\ntwo quarts of ice-cream for the party cake!<br />\nrecent discoveries in archaeology.<br /><br />\nEducational Groups Dr. Hart Appointed<br />\nTo Give Banquet To fifth District<br />\nIn Honor Of Ames Labor Committee<br /><br />\nMembership Qualifications<br />\nOf Engineering Fraternity<br />\nSummarized At Assembly<br /><br />\nDr. Kandel, Noted Educator, Associate Political Science<br />\nWill Be Principal Speaker<br />\nProfessor Representative<br />\nAt Dinner Saturday Night<br />\nOf Public In NIRA Tests<br /><br />\nTudor And Stuart<br />\nTo Hear Dr. Stoll<br />\nAt Annual Lecture<br /><br />\n:rxc<br /><br />\nMinnesota Professor Speaks<br />\nFebruary 16 In Levering;<br />\nKnown For Literary Works<br /><br />\nRhodes Group Picks<br />\n2 Division Finalists<br /><br />\nRobinson Elected<br />\nOfficer By Institute<br /><br />\nAiming For Larger Treasury,<br />\nLeague Includes Pronuncation<br /><br />\nGrammatical Correctness In Speech Group Passes Amendment As It Holds Christmas Ice Cream Party<br />\nAnd Plans Easter Event<br /><br />\nbe Molay Club To<br />\nMeet On Thursday<br /><br />\nPeace Poll Ballots<br />\nOn Way Here<br /><br />\n2<br /><br />\nHOME WOOD, BALTIMORE, MD., JANUARY 8, 1934.<br /><br />\nobIts lbophins 1Rews1Letter<br />\nFOUNDED 1897<br />\nSubscription per year<br />\n$2.00<br />\nBy Mail<br />\n$2.50<br />\nRemit subscription fees to Treasurer, Student Activities Council, Remsen Hall, Treasurer's Office, Johns<br />\nHopkins University.<br /><br />\nHigher Education —III An Autopsy On Naples Deaf,Dumb and<br />\nBlinal<br />\nOn<br />\nMarks<br /><br />\nThe Barnstormers Go<br />\nUnder The Knife<br /><br />\nOdds and Ends<br /><br />\nby EDGAR KEHLER<br />\nby HAROLD M. KROPMAN<br />\nThe following communication is the third of<br />\na series of educational confessions, instituted<br />\nDear Customers,<br />\nEntered as second-class matter December 3, 1909, at<br />\nlast season. The NEWS-LETTER does not everyby STANLEY E. BLUMBERG<br />\nthe Postoffice in Baltimore, Md., under the Act of ConIf for any reason my column reeks of genius or i<br />\nwhere agree with the author and welcomes any<br />\nIf the following reactions to See Naples And Die,<br />\ngress, November 3, 1879.<br />\neven<br />\nextraordinarily well-written this week, I wish yol<br />\nexpression<br />\nof dissent.—THE EDITOR..<br />\nthe Barnstormers' 1934 fall offering, can be tagged with<br />\nPublished semi-weekly from October to June, except<br />\nwould please excuse it as I wrote it New Year's Day ir Hs(<br />\nduring examination and college holiday periods by unI.<br />\nthe dignified label of a \"review\", then the author makes<br />\nNew York after a long, hilarious New Year's Eve whicl<br />\ndergraduates of the Johns Hopkins University.<br />\nIn my first year at the Hopkins, I was revolted all haste to tack on the<br />\nword \"amateur\" in order to concluded<br />\na four-day convention in New York. Th(<br />\nMember of the Intercollegiate Newspaper Association of merely by the terrible chaos of subjects thrust at<br />\nthe maintain 100% purity and accuracy with reference<br />\nbright<br />\nlights<br />\nof Broadway piercing the looming dark<br />\nthe Middle Atlantic States, The National College<br />\nunsuspecting freshman. Hardened to that blemish, I to his standing.<br />\nFor the succeeding sentences are<br />\nness of the subway tunnels; the noise at Times Square<br />\nPress Association and the Association of<br />\nnow in my second year discover one immensely more nothing more than<br />\na somewhat disconnected series of<br />\non the stroke of twelve; New Year's Eve echoing frore<br />\nsubtle and vicious. I am now revolted by a sly, inno- impressions which caught<br />\nCollege Editors.<br />\nthe relatively untrained eye the<br />\nquiet hum atop the Empire State Building; the rust<br />\ncent-looking matter—a hangover in this realm of higher of this Thespian<br />\nEDITORIAL DEPARTMENT<br />\nsuckling and which, surprisingly<br />\nStanley E. Blumberg<br />\nof the tide of humans into the subway cars transposed<br />\n.Editor-in-Chief<br />\nlearning, retained unquestioned from the needs of a enough, have lingered<br />\nthrough a torrid Xmas vacation<br />\nMelvin Goldberg<br />\nManaging Editor<br />\nin the lobby of the Waldorf-Astoria eight-thirty an<br />\ndifferent, a practical instruction—an insidious appendix so that he has been<br />\nable to recapture and transfer them<br />\nJesse N. Borden, Neal Potter,<br />\nSunday morning; all became more and more jumbled and<br />\nin<br />\nthe<br />\nUniversity'<br />\ns<br />\nabdomen.<br />\nI<br />\nrefer<br />\nto<br />\nthe principle of to an alleged interested public.<br />\nAssistant Managing Editors<br />\nrealistic in my imagination and hence the following con.<br />\nteaching<br />\nLeonard Wallenstein<br />\nby marks and credits.<br />\nSports Editor<br />\nOn second thought, perhaps the very fact that this<br />\ncoction.<br />\nIrving Leberfeld.<br />\n_Exchange and Filing Editor<br />\nThese marks—these Honors, Satisfactories, and reviewer (already we<br />\nare reveling in our new-gained<br />\nHyman M. Levin<br />\n1<br />\nContributing Editor<br />\nFailures—what are they? As I see them, they are glory) is a \"neophyte<br />\nof the boards\" will assist in the<br />\nSigned: HAROLD M. KROPMAN,<br />\nHarold M. Kropman<br />\nColumnist<br />\nnothing more than a set of carefully wrought flatteries, presentation of a<br />\nmore or less typical criticism of a more<br />\nWitness: STANLEY E. BLUMBERG.<br />\nEdgar Kemler<br />\nFeature Editor<br />\ncajoleries, and insults, to herd the students through four or less typical play<br />\nl((<br />\nof a more or less typical amateur<br />\nP.<br />\nspent a quiet evening at home with the wife;<br />\nReporters<br />\nyears of guaranteed culture. Indeed, this whole system dramatic group.<br />\nCertainly our juvenile nature should and kids New Year's Eve, but I guess everything he, brin<br />\nJohn C. Brashears, Stanley M. Finkel, Benjamin<br />\nof grading and marking is an avowal of incompete<br />\nncy serve to eliminate dwelling upon minor technical details told me about New York is 0. K. I understand till<br />\nFuternick, Jewett Goldsmith, Leon Jacobson,<br />\na<br />\non the part of the faculty. The professors do not present which are only of<br />\na<br />\nrelevance to those intimately con- Baltimore girls are particularly dangerous up there omt z1I<br />\nWilliam Kempton, Kenneth Zierler,<br />\ntheir material—trusting to the fascination of its content nected with the<br />\nproduction. For what we overlooked during the holiday season.<br />\nBUSINESS DEPARTMENT<br />\nor their own ability at presenting it. No, they must during our two-hour<br />\nbrim<br />\nvisit to Italy via the Auditorium<br />\nSigned: S. E. B.,<br />\nRay Goldberg<br />\nBusiness Maxager<br />\nvulgarly resort to the ego of the learner as the driving Theater belongs to<br />\non E<br />\nthe<br />\ndramatic<br />\ndevotee,<br />\nBert Gordon<br />\nthat<br />\nfascinatWitness:<br />\nH. M. K.<br />\nAdvertising Manager<br />\npower—and sternly insult him into an education. And ing character who<br />\nderl<br />\nCharles Hastings<br />\nleaves the playhouse set in his'opinOffice Manager<br />\nthey<br />\nset<br />\nup<br />\na<br />\nport<br />\nPhi<br />\nBeta<br />\nDavid Levy<br />\nKappa fraternity as the supreme ions but refrains from exposing and expoundin them<br />\n0-0<br />\nCirculation Manager<br />\ng<br />\nbeguilement—the lofty council of those who have intel- until he has obtained<br />\nthe next day's paper and read<br />\nWhile walking through the streets of Chinatown I<br />\nTuesday, January 8, 1934.<br />\nlecutally fought and very often intellectually died<br />\nfor what the best-informed critics have to suggest. Shades happened upon<br />\nthe following most treacherous sign in thai<br />\nthe decoration.<br />\nof the graduate student!<br />\nthe window of a Chinese laundry:<br />\nMEMBER<br />\nThe mere fact, however, that making is a conspirro<br />\n\"Don't send your clothes to be torn by a<br />\ntrolltgiate<br />\nAssociuted wouskieas<br />\nacy of laziness on the part of the faculty is not half<br />\nA:<br />\nso<br />\nThus reinforced, we desert our place in the wings<br />\nlaundry which uses machines. We do it care=31934 (gontaattpipm 1935<br />\nbad as its other implications. My next charge is that<br />\nWISCONSIN .<br />\nMADISON<br />\nand brazenly stride onstage to speak our little piece.<br />\nfully ourselves by hand.<br />\nit greatly distorts or emphasizes the distortion of<br />\nthe First let us give<br />\nvent<br />\nto<br />\n—One Lung Gone.\"<br />\nour<br />\ncritical<br />\nfaculties<br />\nand<br />\nposit<br />\n\"true\" nature of knowledge. All knowledge (other than<br />\nthat which is practical) may be said to be the organized the following consideration:<br />\nan<br />\n0-0<br />\n1. The choice of See Naples And Die was not a<br />\nattempt at answering the question \"Who am I?\". Probloltri<br />\nnofle:<br />\nleg<br />\nAPPARENTLY the craze for selecting All-American<br />\nlems of physics, chemistry, biology, history, sociology particularly brilliant stroke. Although it is obviously<br />\nSeveral weeks back as I sat in Levering Hall per- are<br />\nteams has lifted itself above its somewhat jingoistic<br />\ncan be all reduced to that simple problem of self-con- neither a problem play nor a psychological piece, it nev- 'using the NEWS-LETTER (Page 2, columns 5, 6), I was but<br />\nbirthplace, the sporting page, and is now concentrating<br />\nsciousness. It is that curiosity about yourself—the ertheless represents a tendency on the part of the approached by a keen, slick-looking, wide-awake fresh;<br />\n3<br />\nall its efforts upon permeating the upper crust of sowhere, the what, the why, the how of you—it is that 'Stormers to go slightly highbrow on a trusting student man who asked if he could have my copy of the paper haf.<br />\nciety, that strata which we regarded as absolutely imbody. We want<br />\nwhich makes knowledge one of the greatest pleasures<br />\nas soon as I finished with it. I immediately became very as<br />\nmune to all matters of doubtful or unsavory origin. This<br />\nyou own. But marks? Do they indicate the relative to see life as<br />\nelated and inquired whether he would like to have me car<br />\nobservation is prompted by an article appearing in<br />\njoy you derive from your pursuit of yourself? Do they we, young as<br />\ngib<br />\n'autograph it.<br />\nyesterday morning's Sun, wherein a group of young<br />\nrecord the thrill of discovering that your grandfather we are, know it;<br />\nsociety sportsmen from the Johns Hopkins picked an<br />\nHe replied: \"Not especially. The weight of your<br />\nwas an ape; your great-grandfather a fish; and your we do not ask<br />\nAll-Baltimore Debutante Team from regular attendants great-great-gra<br />\nautograph would be negligible. You see I am saving<br />\nndfather, a heap of carbon, hydrogen, the stage to edat the fortnightly tea dances held in Levering Hall.<br />\nand oxygen in the slime. No, all they record is the<br />\nNEWS-LETTERS so that when I become a senior I will<br />\nrela- ucate us in the<br />\n2<br />\nSeveral pressing considerations obtain here. For tive parrot-like swallowing of facts, returned to light art of living.<br />\nhave several hundred pounds of them which I can sell to<br />\nh:<br />\nfor<br />\nthe examination. Facts which might or might not Last year's The<br />\ninstance, what were the requisites for securing a berth<br />\nhelp defray part of the expenses for June Week.\"<br />\nkr<br />\non the varsity eleven? Are we to assume that every be digested and assimilated. And this knowledge, I Front Page was<br />\nde;<br />\n0-0<br />\ncandidate was examined to test her resistance to pink say, becomes distorted. It becomes quantity, not qual- a more fortuen,<br />\ntoothbrush, Queen Victoria hats, and Clark Gable? Was ity. It becomes cold-cut, pre-paid proprety, crushed into nate selection,<br />\nThe Tufts College publication says: Many a coed<br />\nher intelligence ascertained by asking her to differenti- a harsh pattern. Of course, all the world admires sheer though not a<br />\nbelieves<br />\nthat a mushroom is the vestibule in a girl's<br />\n0.<br />\nate between Venus and Venice, and the Brooklyn and size and bulk—massive wisdom no less than gaudy sky- whit better pordormitory just about midnight after a dance.<br />\nscrapers<br />\nand giant fortunes. Students become miserly<br />\nCulbertson systems of bridge? And were her morality<br />\ntrayed.<br />\nand discretion determined by an inspection of her diary? bankers in their vaults, piling up facts—not for them0-0<br />\n2. Entirely too<br />\nPr<br />\nselves,<br />\nbut from the obligation to save their honor; or, if<br />\nThen again, how are we to look upon the assigning<br />\nmany girls had<br />\nID<br />\nShe was only a real estate agent's daughter but<br />\nsuccessful,<br />\nfrom<br />\ngreed<br />\nfor<br />\nmore honor. There is no mind major roles,<br />\nof the eleven who passed muster to the various positions<br />\nin<br />\nliked<br />\nwe<br />\nher<br />\nlots.—The<br />\npr<br />\nPointer.<br />\non the team? We should not like to conclude that the in this soulless cramming. These facts are no more glaring comparre<br />\nmental<br />\nthan<br />\nso<br />\nmany<br />\nglittering gold pieces. Knowledge, ison<br />\nmore bovine were relegated to the guard and tackle slots,<br />\n0-0<br />\nwith the<br />\nfe<br />\nwhile the quarterback was a conniving madamoiselle now, is carnal—the body's property. And it hurts. For paucity of fat<br />\nID<br />\nBrown got kicked out of school this morning for<br />\nand the fullback a powerful miss with one eye fo- physics and chemistry have been respectively reduced to m a 1 e leads.<br />\nfe<br />\ncheating on an astronomy exam.<br />\ncused on crashing the opposing line (not to mention one-sixteenths of the diploma. It is as soul-cutting as a Here again the<br />\nel<br />\nWhat was he doing copying from the fellow in<br />\nthe newspaper headlines, an idea naturally abhorrent to Cook's tour complete with an examination and a cer- vehicle itself<br />\nis<br />\nec<br />\nfront<br />\nhim?<br />\nof<br />\ntificate<br />\nassuring<br />\nPHIL<br />\nCRIBLET<br />\nwhomever<br />\nit may concern that the at fault<br />\nevery debutante) and the other optic fixed on the Rose<br />\n— it<br />\noi<br />\nNaw, the professor caught him bumping his head<br />\n'Bowl. Similarly, the ends might be justly considered bearer has witnessed every cathedral in Europe. Such fairly exudes<br />\nfeminine flippancy and fragrance. But the against the wall.—The Log.<br />\ngreed—and<br />\nhow<br />\nit<br />\nis admired!<br />\nas the \"fastest\" in the field and ready to throw for a<br />\nBarnstormers are supposed to perform for, at any rate<br />\nei<br />\nloss the first male opponent who came their way.<br />\nto please, a masculine audience which certainly can<br />\n0-0<br />\nfi<br />\nbe<br />\nYet<br />\neven these aspects of the marking system—its<br />\nOne final question, and then we shall be only too<br />\ncreditecierw<br />\n*. Itii sufficient sophistication to appreciate the<br />\nPresented by the seniors in the School of BusinesS<br />\nhappy to let the women bask in the glory of their newly- application as a faculty aid and its crushing of knowl- ngtulant and<br />\npulchritudinous properties of the bearless<br />\nEconomics after much haranguing as to who should go<br />\nacquired pigskin. Where are we to find the set of edge into a quantity-pattern—bad as they are—even sex.<br />\nthese<br />\nmight<br />\npossibly<br />\nthe shame for having been the composer: \"I am every<br />\nbe<br />\njustified<br />\nif they really succeeded<br />\nrules that will enable us to inform ourselves concernIn regard to this same point, however, there is a<br />\ninch a ruler.\"<br />\ning such matters as non-professionalism, length of in spreading the light. But they don't. The marks more serious<br />\nconsequence, one which the organization<br />\nservice, penalties, etc.? Is a debutante of six years' and examinations really defeat their own end. No cannot permit<br />\nitself to dismiss nonchalantly. Not only is<br />\nstanding to be retired on a pension and her name indeli- course can possibly.-include in its compulsion every the failure to<br />\nsee friend J. Finkington Puntworthy in speech. The chances are they'll retreat blushingly, but<br />\nphase<br />\nof the subject. The less conspicuous phases are<br />\nbly inscribed on the Feminine Football Roll of Honor?<br />\naction disappointing to the audience, but it tends to take you'll have done your share; and then there's always<br />\nWill attendance of affairs outside the city limits auto- left to the enthusiasm of the student; they are not sub- the Barnstorm<br />\ners out of circulation as far as Hopkins the possibility that they'll open up and dish out some<br />\nmatically render her ineligible for further competition? ject to marking. But where can this enthusiasm come undergraduates<br />\nare concerned. And experience has of those anecdotes which are such an integral part of<br />\nWe shake our head doubtfully at the prospect of these from? The marking has operated to supply an artificial taught us that<br />\nBarnstormer history. ThOse boys know enough dirt<br />\nsaid undergraduates are not to be trifled<br />\nimpetus which is in conflict with that of genuine ennumerous pitfalls.<br />\nto blackmail every member of the cast without exwith<br />\nby<br />\nany<br />\norganizati<br />\non<br />\n'<br />\nwhich<br />\nis desirous of perpetuthusiasm. The result?<br />\nNine times out of ten the<br />\nception!<br />\nNevertheless, it's an ingenious advertising stunt on<br />\nation.<br />\nA goodly number of them have a pronounced<br />\nstudent will not care a whit about the unrequired mathe part of the \"fortnightly boys\", who diverted the<br />\nterial, considering it as a counterfeit unworthy of his yen to throw themselves into a dramatic role, but they<br />\nthoughts of these girls from the iron to the gridiron.<br />\nare in no wise willing to abandon their primal sex<br />\nPassing on to the positive side of the picture, we<br />\ngreed. The system has mashed the desire for learning<br />\nand<br />\nPerhaps their precedent will inspire our College for<br />\nto a standstill. You can be assured of no more thorough cavort in lipstick and skirt merely to satisfy this crav- are convinced that there was no let-down in the quality<br />\nTeachers females to follow suit. At that, they would<br />\nknowledge than a Pullman porter has of the United ing. The sensible, expedient solution as we see it is to of acting turned in by this year's group. Phil Criblet,<br />\npossess one natural advantage: they would at least have<br />\nStates despite a schedule which carries him through set a certain minimum number of male parts and de- who, as the juvenile lead, drew the most difficult assignsome English on the ball!<br />\nmand that number from any play that is being consid- ment of them all, came through quite neatly after what<br />\nforty-eight states.<br />\nered for production.<br />\nwe considered a somewhat shaky start. He picked up<br />\nNor is that all. These elements of the marking sys3. That feeling of strained formality which ever speed and assurance as the play progressed, and waS<br />\ntem may actually work harm. They may work to circumvent or even prevent knowledge altogether. College plagues Barnstormer shows after the final curtain has really thoroughly at home in Naples when he spoke hiS<br />\nbeen rung down was again in evidence, though to a last line.<br />\nA MATTER which is of vital, indeed ofttimes painful, seems to be anti-intellectualistic. Education becomes a<br />\nmodified degree, last month. This, perhaps, is more a<br />\nThe Misses Evelyn Swann and Elizabeth 'Ullman<br />\nconsequence to Hopkins undergraduates receives verbal menace: the mind becomes definitely unpopular. For the<br />\nfault of the audience than of the players; nevertheles<br />\ns, were \"naturals\" in their respective roles. Miss Swann<br />\ntreatment from one of our staff writers in the adjoining knowledge has the stigma of compulsion on it, not to<br />\nif it is to be remedied, and we hold such a move<br />\nto be displayed her Vagabond experience to excellent advantcolumn. It deals with the system of marking now in mention that of being useless (aside from its inexpressdecidedly advantageous, the healing lotion must be<br />\niveness)<br />\nap- age as she fumed, fretted and fussed about the stage as<br />\nand<br />\ninferior to \"life\"—results of that distorted<br />\neffect at the University, and the author proceeds to tear<br />\nplied by the 'Stormers.<br />\nall gehuine American young ladies apparently should.<br />\nto shreds the present Honor-Satisfactory-Failure scale, theory. It has also the stigma of insult. If you are<br />\nAs a flighty middle-aged character, Miss Ullman seems<br />\nat the same time promising the editor to concoct and failed, your honor is so hurt that you must work against<br />\nyour will to save face—while ever afterwards you resent<br />\nOur theories along this line? One comes to mind to be in her element. She even improved on her work<br />\npresent his patented panacea in a future issue.<br />\nin The Front Page. And her intermittent screeches,<br />\nIt has long been our belief that the existing method the subject as the token of a former disgrace. If you immediately—why not end the presentation on a high,<br />\n'receive<br />\nhonors,<br />\nblack-andyou<br />\nblue<br />\nare<br />\nnote with the singing of the University emitted entirely without warning, reduced Ed Wynn's<br />\nso monstrously flattered that<br />\nis unsatisfactory in that it permits too gaping an area<br />\nafter<br />\nthe<br />\nOde,<br />\nexaminatio<br />\nthus<br />\nn,<br />\nyou<br />\nfollowing<br />\nwill<br />\nhesitate<br />\nthe highly successful procedure of \"So-o-o-o\" to a mere echo by comparison.<br />\nto<br />\nlook<br />\nany<br />\ndeepbetween the three grades. Exemplary of this contenJerry Branower also merits especial commendation<br />\ntion, the mark Satisfactory bears a numerical connota- er in the matter—fearing to find that you may not be the Princeton Triangle Club and numerous other college<br />\nthe Aristotle your instructor indicated you were.<br />\ndramatic groups? Such a practice links together actor for his impersonation of the oh-so-bored and oh-so-broke<br />\ntion ranging from 60 to 89. Honor and Failure are more<br />\nThen, too, we are creatively sterile. Why? That is and audience in an effective measure, and is at the<br />\ndefinitive and exact by their very nature, but with resame Russian prince. His \"why waren't we all drowned at<br />\neasily understood from the workings of this distorted time an advertisement of the spirit of<br />\nthe Hopkins to birt ?\" impressed us as being one of the outstanding<br />\nIspect to Satisfactory we have been staunch advocates<br />\ntheory of knowledge. It is too easy. All the University whatever outside public may be in attendance<br />\nlines of the show. Yet it was no more what he said that<br />\nof a division of this grade into upper S and lower S.<br />\n.<br />\ndoes is to supply the property-facts—and you swallow<br />\nWhat distresses us most, however, is the sheepish made him click than how he said it. His easy manner<br />\nAlthough such a scale would compel members of the<br />\nthem. No searching, thinking, or ferreting. You receive part which Coaches<br />\nBill Banks and Howard Caplan are of delivery and appropriate gestures combined to make<br />\nfaculty to exert a noticeable amount of effort in analyzbit by bit for four years the pieces of a mental chair on compelled to enact<br />\nevery year. In the first place, their him convincing.<br />\ning the work of their students, such a sacrifice of<br />\nwhich the buttocks of your brain might rest forever. post-performance<br />\npresence is not requested by the audiThe remaining lead roles were capably filled by<br />\nacademic indolence would be well worth any discomforts<br />\nThe mind, if it bothers at all, is satisfied—completely ence, but by the<br />\nBarnstormers, their proteges—all of Miss Louise Orchard and Louis Hartman. The imporwhich it might entail.<br />\nfilled and comfortable till it ceases to be. If you ques- which redounds to<br />\nthe former's discredit and forces the tant lesser bits were mastered by the Misses Naon<br />\nWe confronted Dean Berry with such a proposal tion the least part of that slowly<br />\naccumulated furniture later to transform what should be a real pleasure<br />\ninto Craft, Kathryn Forsythe (who, incidentally, carried on<br />\nlast spring, but he returned the generalized verdict that up there, it is like cutting<br />\noff your finger—it has be- an embarrassing, yet necessary, task.<br />\nalthough quite ill) and Page Wickes, and by Zenas<br />\nstudents, just as all other species of human beings, fell come such a part of you.<br />\nIt is almost impossible; it<br />\nPerhaps we're over-sensitive, but we regard this as Sears, Leonard Wallenstein, Robert<br />\nWatkins, Harold<br />\nnaturally into but three classes, and that any attempt requires super-human<br />\neffort. And if you can't question shabby treatment for two fellows<br />\nwho contribute much Kropman, Stanley Prager, William Snyder, Bert Gorto subdivide these classes was artificial and inconse- any part of that Stoic property,<br />\nhow in the world can of their time voluntarily and whose efforts<br />\nhave been don, Horace Leheneis and Daniel Lerner.<br />\nquential. We have assumed this to be the official pro- you possibly think or<br />\ncreate anything new? This atti- regularly attended by marked<br />\nsuccess. So we address<br />\nApril has been tentatively designated as the date<br />\nnouncement of the faculty; if we are in error, we wel- tude towards knowledge<br />\n, associated with the system of this suggestion to the student body,<br />\nthe members of for the next 'Stormer production and will mark<br />\ncome enlightenment.<br />\nonly<br />\nmarks, is sterile—absolutely. If you think in the pres- which we feel are<br />\nnot unappreciative but rather suffer the third season<br />\nthat the organization has presented<br />\nTry as we might, we have never been able to deter- ence of college students—and<br />\nthey perceive that the from erroneous sophisticated beliefs as to how to<br />\ndisport more than one play. The good intentions of this year's<br />\nmine representative undergraduate sentiment with re- thought is in conflict with<br />\ntheir old thought-property themselves at such an affair: Don't give the<br />\nBarnstorm- members cannot be questioned; their ability we believe,<br />\ngard to this problem. We urgently call for it now, for (though they mayn't)—you<br />\nare subject to the most ers an opportunity to drag cut Bill and Howie.<br />\nCall for has ben sufficiently, although not completely, demon- k<br />\nif we are to make an effective case, we must know the savage attacks. You may<br />\nbe egged, watered, or even them yourselves, and when you've obtained<br />\ntheir ap- strated; we wish them \"happy rehearsals\" in their next<br />\ndesires of our clients.<br />\nstoned.<br />\n(To be continued in next issue.)<br />\npearance before the footlights, demand that good<br />\nold venture.<br /><br />\nL<br /><br />\nVITSS<br /><br />\nThree Incisions<br /><br />\nMaking Light Of Socialites<br /><br />\nFinal Examination<br /><br />\nRemarks About Marks<br /><br />\nPrescribing The Medicine<br /><br />\nHOMEWOOD, BALTIMORE, MD., JANUARY 8, 1934.<br /><br />\nUlman<br />\nGuest Speaker<br />\nAs O.D.K.Elects<br /><br />\nid Judge<br /><br />\nor<br />\na yot<br />\nlay it<br />\nwhici<br />\nThi<br />\ndark.<br />\nquart<br />\nfrog<br />\nrus/<br />\nposec<br />\nan<br />\nd and<br />\n' con.<br /><br />\nHonorary Activities Society<br />\nTo Initiate New Members<br />\nAt Assembly On Thursday<br /><br />\nDr. Gamow To Lecture<br />\nDr. George Gamow, formerly of<br />\nthe University of Leningrad, in Russia, and now visiting professor at the<br />\nGeorge Washington University, is to<br />\ncontinue the series of lectures on nuclear physics which he is delivering<br />\nat the Hopkins until the middle of<br /><br />\nActivities Council<br />\nHopkins Press<br />\nS!<br />\nURE<br />\nFIG<br />\nENT<br />\nPROMIN<br />\nForty-Two Varsity Seals<br />\nShows Decline<br />\nAn<br />\nMAE WEST<br />\nIn Publications<br />\nCrashes<br /><br />\nFebruary.<br />\nDr. Gamow, world-famous physicist, delivers his lectures in Rowland<br />\nHall between 3 and 5 p. m. Thursday.<br /><br />\ners<br />\nLeaders Selected Practice Teach<br />\nGet Assignments<br />\nGroup Sets High Standards<br />\nIn Athletics, Scholarship, In 8 City Schools<br />\nPublications, And Societies<br /><br />\n13 Students Here Are To<br />\nTeach Next Month In<br />\nJunior And Senior Highs<br /><br />\nAwards<br /><br />\nby STANLEY E. BLUMBERG<br /><br />\nALGER<br /><br />\nXMAS PARTY<br />\nAt<br /><br />\nHOPKINS<br /><br />\nStory<br />\nMinus The<br /><br />\nHISS<br /><br />\nBob Abrams, chairman of the Student Activities Council, awarded 42<br />\nVarsity Seals to members of various<br />\nactivities on the campus, Wednesday,<br />\nDecember 19.<br />\nHeads of activities received two<br />\nstars on their seals, and members<br />\nreceived one star for each activity<br />\nto which they have devoted three<br />\nyears.<br /><br />\nActivities whose members received<br />\nSeals are the Hullabaloo, NEWS-LETFrom editor of the NEWS-LETTER TER, Cotillion Board, Debating CounBlue Jay, Barnstormto assistant counsel of the Agricul- cil, Black and<br />\nStudents Activities<br />\nClub,<br />\nMusical<br />\ners,<br />\nand<br />\ntural Adjustment Administration<br />\nCouncil, and the Student Council.<br />\nspecial investigator for the Senate<br /><br />\nA new angle (or would \"curve\" be<br />\na more appropriate word?) was recently advanced by certain ingenious<br />\nmembers of the University's chemistry department to the current communitions committee, all accommentary that \"chemistry's greatest<br />\nplished within the short space of five<br />\nblondes!\"<br />\ncontribution to the world is<br />\nlike a typical Alger<br />\nThe occasion was the annual years. Reads<br /><br />\nHoliday Language<br />\nConclaves Attract<br />\nMany Professors<br /><br />\nDuring Past Years Only 34<br />\nStudies Were Published,<br />\nAnnual Summary Reveals<br /><br />\nExcludes Journals<br />\nBulletin Shows 57 Issues Of<br />\nScientific And University<br />\nJournals Issued In 1933<br />\nA considerable decline in the number of publications issued by the<br />\nJohns Hopkins Press during 1934 was<br />\nrevealed in the annual report of the<br />\nPress, circulated last week. The bulletin also included announcement of<br />\nthe pending publication of Thomas<br />\nHardy's Indiscretions of an Heiress<br />\nand the first volume of a Documentary History of Primitivism.<br /><br />\nChristmas party of the department, story, doesn't it?<br />\n(Continued from Page 1, Col. 1)<br />\nwife<br />\nheld on December 18, and the perpeWell, in this case it is, for it connational honorary society serves to<br />\ng he<br />\ntrators alluded to were those usually cerns one Alger Hiss, graduate of the<br />\nbring together these most represenI the<br />\nnon-hysterical, self-controlled gradtative undergraduate leaders in an<br />\nClass of '26, who overcame the hanthere<br />\nSix junior high and two senior uate students. One of their number,<br />\norganization which in turn acts to<br />\ndicap considered inherent in the edibring together faculty and students high schools will have for practice Carl Vestling, invaded the festivities<br />\nMarch,<br />\nand<br />\nFebruary<br />\nattired to represent some unknown torship of this paper and has won<br />\non a basis of mutual interest and un- teachers, during<br />\nHopkins<br />\nJohns<br />\nthe<br />\nin<br />\nimcampus<br />\nstudents<br />\nnamed Santa Claus, and for himself comparative renown in<br />\nof<br />\n13<br />\nindividual<br />\nderstanding on matters<br />\nUniversity College for Teachers, it proceeded to extract Xmas gifts from legal and political circles at the tenportance.<br />\nThe annual summary of the Press<br />\nwas revealed today by Dr. E. Earle his bag of tricks. All went along in der age of thirty.<br />\nSelect Only Three Per Cent<br />\nthat, excluding journals, only<br />\nshows<br />\nhere.<br />\nstueducation<br />\nwn I<br />\nFaculty members and graduate<br />\nkeeping with the friendly Yuletide<br />\n0. D. K. cannot elect annually more Franklin, associate in<br />\nWhile at the Hopkins, Mr. Hiss furhave appeared during the<br />\nstudies<br />\n34<br />\nnin than three per cent of the total enHistory will be taught by Mrs. spirit until he drew out a large ob- nished copious proof of his versatile dents of the Language and Literature past year. In 1933, there were 45 pubrollment of men in the College of Anne Williams, at the Hamilton Jun- ject and exclaimed thusly:<br />\nnature. Among his accomplishments and Philology departments of the lications; in 1932, 52. Thus there has<br />\n\"Friends, and members of the fac- were: editor, the NEWS-LETTER; presArts and Sciences, School of Engi- ior High School; Bernard J. Stinnett,<br />\nJohns Hopkins University attended been a continued decrease since 1932.<br />\nneering, and School of Business Eco- at Edgar Allan Poe Junior High No. ulty, there is one man in our midst ident, Barnstormers; member of the<br />\nThe publication of the first volume<br />\nconventions of their national organinomics. Not more than 25 per cent 1; Arthur E. Gutman, at Garrison today who has devoted a purposeful track team; member of Omicron Delta<br />\nheld in Pennsylvania during of a Documentary History of Primizations<br />\nof<br />\nstudy<br />\nthe<br />\nto<br />\ncareer<br />\nHoward<br />\nfrom<br />\nsuccessful<br />\n42;<br />\nNo.<br />\nand<br />\nof the members may be selected<br />\nJunior High School<br />\nKappa and Phi Beta Kappa; and most<br />\nvacation. The meet- tivism has been approved by the press<br />\nmelting point curves. In deference to popular man in his class. He claimed the Christmas<br />\nany one of the five branches of col- Fox, at Garrison also.<br />\nLanguage Associa- committee. This series, according to<br />\nModern<br />\nthe<br />\nof<br />\ning<br />\nhis<br />\nin<br />\nhim<br />\naid<br />\nto<br />\neffort<br />\nan<br />\nin<br />\nhim and<br />\nlege activities from which selections<br />\nTeach English<br />\nAlpha Delta Phi as his social fraheld at Swarth- Dr. George Boas, \"will cover Eurowas<br />\nAmerica<br />\nof<br />\ntion<br />\nwork, I desire at this time to present ternity, and we imagine that the<br />\nper- are made. This insures a fair distriHyman M. Levin will teach a class<br />\nia, and pean literature until the seventeenth,<br />\nPhiladelph<br />\nand<br />\nCollege<br />\nmore<br />\nperfect<br />\nthe<br />\nof<br />\nhim with a picture<br />\nwas bution of outstanding leaders.<br />\npresent fraters of that particular<br />\nAmerica<br />\nof<br />\nin English at Hamilton Junior High,<br />\nSociety<br />\nLinguistic<br />\npossibly the nineteenth, century.<br />\nthe<br />\nmelting point curve—Mae West!\"<br />\nMembership in 0. D. K. for years<br />\n•eshGreek group are more than willing to<br />\nwhile Maurice C. Sater will teach<br />\nia for all of Primitivism and related ideas were<br />\nPhiladelph<br />\nin<br />\nconvened<br />\nSufferers Numerous<br />\naper has been regarded by upperclassmen English at Florence Nightingale Junrecognize this claim.<br />\ninfluential in molding men's minds reits sessions.<br />\nDr. E. Emmet Ried was the object<br />\nvery as the highest honor on the Hopkins ior High School No. 40.<br />\nSuccess Rapid<br />\ngarding the course of history, redelivered<br />\nwho<br />\nprofessors<br />\nHopkins<br />\nof this bit of local color. However,<br />\nme campus. Juniors and seniors are eliThree others will teach mathematThe rest of the story is merely a papers at the Modern Language con- garding ethics, and recently, regardin<br />\ncompany<br />\nof<br />\nabundance<br />\nan<br />\ninitiahad<br />\ntwo<br />\nhe<br />\ngible for membership and<br />\nics. They are Miss Dorothy Girdrecord of continuous successes. Grad- clave included:<br />\ning aesthetics and education.\"<br />\nhis momentary misery, for Dr. Frantions each year are held.<br />\nat Hamilton; Miss Bertie Rodwood,<br />\nuation from the Harvard Law School<br />\nthe<br />\nThe manuscript of this first volume<br />\nyour<br />\nincludes<br />\n\"Literary<br />\nfield<br />\nChinard:<br />\nwhose<br />\nDr. Gilbert<br />\ncis 0. Rice,<br />\nFaculty Honorary Members<br />\ngin, at Garrison; and Miss Alice Ekwas followed by immediate recogniving<br />\nis nearly ready for composition.<br />\nand History of Ideas.\"<br />\nfree radicals, was the recipof<br />\nHistory<br />\nstudy<br />\nAmong the faculty here there are<br />\ntion of Mr. Hiss's ability by such<br />\nwill 12 honorary members of the Hopkins lof, at Southern School No. 70.<br />\nHardy Novel Coming<br />\nient of still another picture—this one<br />\nDr. H. Carrington Lancaster:<br />\n91<br />\nSchool<br />\nAt<br />\nGrau<br />\neminent and influential tycoons of the<br />\nMiss<br />\nai to Chapter. They are: Dr. Joseph S.<br />\nof a Communist.<br />\nFrench<br />\nDr. Carl Weber, Hopkins alumnus<br />\n\"Lope's Peregrino and Certain<br />\nas former Supreme Court Justice<br />\nFrench will be taught by only one<br />\nOther victims of this pseudo-Santa bar<br />\nAmes, president; Dr. E. W. Berry,<br />\n.\"<br />\nat present professor at Colby<br />\nand<br />\nDramatists<br />\nthe practice teachers, Miss Regina (chemically speaking) were: Dr. Oliver Wendell Holmes and Prof. Felix<br />\ndean of the College of Arts and Sci- of<br />\nhas written the introduction<br />\nCollege,<br />\nBegin\"The<br />\nFrank:<br />\nTenny<br />\nMrs.<br />\nGrau, who will do her practice work Donald H. Andrews, who was granted Frankfurter, of Harvard, member of<br />\nnovel by Thomas Hardy<br />\nences; Dr. J. B. Whithead, dean of<br />\nearly<br />\nto an<br />\nRooseveltian Brain Trust. After nings of Comedy in France.\"<br />\nFalls Junior High School<br />\ncoed<br />\na bell to hang around his neck; Dr. the<br />\nthe School of Engineering; Dr. W. at Gwynns<br />\npublished in the early<br />\nbe<br />\nto<br />\nis<br />\nwhich<br />\nDr. Raymond D. Havens: \"Wordsbeing associated with law firms in<br />\nNo. 91.<br />\nJ. C. W. Frazer, the heterogeneous<br />\n0. Weyforth, dean of the School of<br />\nof 1935.<br />\npart<br />\nin<br />\nDescribed<br />\ntransas<br />\nHiss<br />\ne<br />\nMr.<br />\nare<br />\nworth's Adolescenc<br />\nBoston and New York,<br />\nTwo will teach science. They<br />\ncombination of bowling pins and peaBusiness Economics; Dr. John C.<br />\nFor many years, this work was<br />\nMiss Kathryne Chambers, who will nuts; Dr. Maurice Huggins, a soap- ferred the family furniture to Wash- Prelude, II, iv.\"<br />\nChristie,<br />\nG.<br />\nA.<br />\nlibrarian;<br />\nhead<br />\nFrench,<br />\nto be entirely lost. Professupposed<br />\nserving<br />\ndo her practice teaching at Western box; and Dr. Walter A. Patrick, a ington, where he is at present<br />\nDr. Hazleton Spencer: \"The Name<br />\nProfessor of mechanical engineering;<br />\nreveals that parts of this<br />\nWeber<br />\nsor<br />\ngenerFrank,<br />\nWhite,<br />\nJerome<br />\nto<br />\nElizabeth<br />\nMiss<br />\nassistant<br />\nas<br />\nSchool;<br />\nand Nature of Drama.\"<br />\nrubber cigar. When last seen, each<br />\nDr. Robert S. Roulston, colilegiate High<br />\nbut<br />\nsubsequently used by the<br />\nwere<br />\nnovel<br />\ncounsel of the AAA, and is also<br />\nat Eastern High School.<br />\nDr. Ernst Feise: \"Goethe's Hexamof these gentlemen, with the possible al<br />\nProfessor of German; R. N. Dempster,<br />\nworks. This will be<br />\nlater<br />\nin<br />\nauthor<br />\nmunithe<br />\nin<br />\nng<br />\nactively<br />\nparticipati<br />\nTo Teach At Western<br />\neter in den Epen.\"<br />\nexception of Dr. Ried, was trying to<br />\nregistrar; Dr. Knight Dunlap, proin America of<br />\npublication<br />\nfirst<br />\nthe<br />\nMiss Catherine Bishop will do prac- palm off his particular gift on the tions probe.<br />\nfessor of experimental psychology;<br />\nMr. Paul M. Spurlin: \"The Problem Hardy's Indiscretions of an Heiress.<br />\nAlthough he professes a great of Montesquieu in America.\"<br />\nDr. L. Wardlaw Miles, collegiate pro- tice work in a commercial subject others.<br />\nfor<br />\nThe Johns Hopkins Press published<br />\nfor the out-of-doors as foremost<br />\nlove<br />\nthe<br />\nof<br />\nHigh.<br />\npresident<br />\nWestern<br />\nat<br />\nBrighton,<br />\nMitchKenneth<br />\nBroadus<br />\nDr.<br />\nEnglish;<br />\nof<br />\nMr. Edward D. Seeber: \"Aphra<br />\nfessor<br />\nfollowing journals during 1934:<br />\nthe<br />\nbesecretly<br />\n13<br />\nwe<br />\nthe<br />\n11,<br />\nhobbies,<br />\nhis<br />\namong<br />\nFebruary<br />\nas<br />\nwith<br />\nserved<br />\nBeginning<br />\nGraduate Activities Couhcil,<br />\nell, associate professor of political<br />\nBehn's Oronoko in France in the 18th<br />\nin<br />\nof<br />\nout<br />\nin chairman of the party. The refresh- lieve that he gets a mean kick<br />\nAmerican Journal of Mathematics<br />\neconomy; Dr. George Boas, professor members of the class in teaching<br />\nCentury.\"<br />\narmtheir<br />\nand<br />\ntheir<br />\nPonts<br />\ndo<br />\ndu<br />\nwill<br />\nthe<br />\ngrilling<br />\nschools<br />\nthe secondary<br />\nAmerican Journal of Philology<br />\nOf philosophy.<br />\nments committee consisted of Edwin<br />\nead<br />\nDelegation Listed<br />\noften.<br />\nso<br />\never<br />\nns<br />\ns<br />\nobservatio<br />\ncompetitor<br />\naments<br />\nindividual<br />\nEsta<br />\nof<br />\nMiss<br />\nweeks<br />\ntwo<br />\nchairman;<br />\n,<br />\nspeakassembly<br />\nRichardson<br />\nJudge Ulman, the<br />\nOthers in attendance included Dr. Biologia Generalis<br />\ner for this week, after his graduation in the classes to which they have VVareheim, Miss Leonora McIntire, Our only fear is that his questions Stefan Einarsson, who acted as sec- Bulletin of the Institute of the Hismay occasion an explosive reaction!<br />\nfrom the Hopkins, took his M.A. at been assigned through the coopera- and Miss Jeannette Parran.<br />\ntory of Medicine<br />\nretary of the Scandinavian Language<br />\nt<br />\nColumbia. He is the author of a tion of the Baltimore City Departmen<br />\nLiterature group; Drs. Kemp Ma- Bulletin of the Johns Hopkins Hosand<br />\n.esS<br />\nPopular book on the panorama of of Education and te principals of the<br />\npital<br />\nlone,'Gustav Gruenbaum, M. L. Rago<br />\na judge sees from the bench various schools. Then, they will do<br />\nhumanity<br />\ndoff, and Emanuel von der Muhl; and Human Biology<br />\nery<br />\nwith<br />\npractice<br />\nteaching<br />\nof<br />\nweeks<br />\ntwo<br />\nin the cases which come before him.<br />\nMessrs. Hyman Shapiro, B. Moris- Johns Hopkins University Circular<br />\nIn his undergraduate days here he the aid of units compiled by them<br />\nsette, R. Uricolo, A. Ferdinand Engel, Modern Language Notes<br />\nWas editor of the 1898 Hullabaloo, and passed by the critic teachers and<br />\nTerrestrial Magnetism and Atmosand L. Walter Rubinstein.<br />\nut<br />\nPresident of the Debating Club in his Dr. Franklin.<br />\nperic Electricity.<br />\nDrs. Frank R. Blake and James W.<br />\nLys<br />\nfreshman year, graduating class poet,<br />\nSachs<br />\nMr.<br />\nAbraham<br />\nand<br />\nPoultney,<br />\nme<br />\nMember of Phi Beta Kappa, and<br />\nparticipated in the Linguistic Society<br />\nof<br />\nscholarship holder for three years.<br />\nmeeting.<br />\nirt<br /><br />\nJ. H. U. Contingent Delivers<br />\nNumerous Papers Before<br />\nPhiladelphia Conventions<br /><br />\nPresident Ames To Deliver<br />\nFarewell Speech February 22<br /><br />\nInaugurates Drive<br />\nTo Increase Membership<br /><br />\nwe<br />\nty<br />\nat,<br />\nnat<br />\nas<br />\nis<br /><br />\nIntercollegiate<br />\nNews<br /><br />\nSuccessor' May Be Announced On Commemoration Day;<br />\nDr. Harold Glenn Moulton, Of Washington, D. C.,<br />\nWill Be The Principal Speaker<br /><br />\nDr. Mitchell Speaks<br />\nOn Insurance Bill<br /><br />\nDr. Merritt Speaks<br />\nOn Agora Findings<br /><br />\nby HYMAN M. LEVIN<br />\nplace in<br />\nDr. Broadus Mitchell, associate<br />\nAccording to the Ursinus Weekly<br />\nWhen President Joseph S. Ames guished as a teacher. His<br />\nprofessor of political economy, adleft-handed ping-pong is being insti- steps down from the rostrum in the science is accredited. His service to<br />\n(Continued from Page 1, Col. 6)<br />\ndressed a massmeeting of 300 people,<br />\ntuted at the University of Michigan Peabody Conservatory auditorium on the country in peace and in war have<br />\nMehling, Ellis, Soifer.<br />\nas a cure for students who stammer. the morning of February 22, follow- been signal . . .\"<br />\nDr. Benjamin D. Merritt, Francis last Thursday night at Lehmann's<br />\n* * *<br />\nTeam No. 5: Wright, captain; Hoyt,<br />\nWhite Professor of Greek at the Johns Hall, on the immediate legislation of<br />\ning his last presidential address on<br />\nWhether the tradition of which Dr.<br />\nRainy, Jones.<br />\nfolbe<br />\nprowill<br />\nthe<br />\nof<br />\nhe<br />\nHopkins University, addressed the an unemployment and social insurThen there's the story<br />\nCommemoration Day,<br />\nTeam No. 6: Blumberg, captain; fessor of international law who sat lowed by Dr. Harold Glenn Moulton, Hollander wrote three years ago will joint conference of the American In- ance bill. He strongly urged the forWiehe, Hannawalt.<br />\nfor an hour waiting for his meal in a president of the Brookings Institute, still remain unbroken when President stitute of Archaeology and the Amer- mation of a lobby to aid in the passTeam No. 7: Watkins, captain; Is- restaurant. Finally his waitress pass- in Washington, who will be the prin- Ames's successor is named remains ican Philological Association in To- age of such a bill by both the nationaacson, Erck, Fertig.<br />\ned and catching her by the arm, he cipal speaker at the marking of the to be seen. Whether or not the five- ronto, Canada, at its session of Fri- al and state governments.<br />\nTeam No. 8: Frey, captain; Bowie, said: \"Change my order to an ulti- fifty-ninth anniversary of the inaug- man committee of the Board of Trus- day, December 28. Dr. Merritt spoke<br />\nDr. Mitchell, who is serving as a<br />\nnierson, Jarman.<br />\nuration of Johns Hopkins Universi- tees will see fit on Commemoration on \"New Inscriptions from the member of the committee to investimatum.\"<br />\nTeam No. 9: Leber, captain; Hur* * *<br />\nDay next month to introduce to the Agora.\" His address was a resume gate unemployment and social insurty's first president.<br />\nWitz, Collins, Skeen.<br />\nIt was at the 1934 commencement friends of the University and to Bal- of a report which will appear in the ance appointed recently by GovernorFrom Thru The Headlines of the<br />\nTeam No. 10: Levi, captain; Alex- St. John's Collegian we learn that exercises last June that President timore the fifth president of the new archaeological periodical The elect Harry W. Nice, told those presander, Bradford, Bealmear.<br />\nent at the meeting to organize pathe Japanese emigrants to Manchu- Ames formally announced his inten- Johns Hopkins also remains to be Hisperia, in the near future.<br />\nTeam No. 11: Kempton, captain; kuo get mail-order wives. That Hit- tion to retire from the presidency of seen. However, it is generally beEarly in February the fifth season rades, to write letters to the newsPrager, Russell, McCarty.<br />\nler proclaims a boycott on a German the institution with which he has lieved that the new president will of the excavation of the Agora will papers, and to generally agitate the<br />\nTeam No. 12: Emmert, captain; hospital in which the staff had the .been associated for 45 years. On the be on the stage of the Peabody au- begin, it was announced. Dr. Merritt, passage of unemployment insurance<br />\nCrouch, Shaw, Coan.<br />\naudicity to vote against him in the fifty-eighth Commemoration Day, ditorium on the morning of February who is a member of the commission bills.<br />\nwhich controls these excavations, surecent referendum. That Mussolini members of the faculty paid tribute 22.<br />\npervises the editing of all epigraphi- •<br />\ndeclares that from now on the Italian to President Ames for the long years<br />\nry<br />\nAnniversa<br />\nFree Manicuring<br />\nFifty-Ninth<br />\nHopthe<br />\nto<br />\ncal texts which are discovered.<br />\ngiven<br />\nhe<br />\nhas<br />\nservice<br />\nletter writer must close his letter of<br />\nlast<br />\nthe<br />\nmarks<br />\nThe 59th anniversary<br />\nmorning, Dr. David<br />\nSaturday<br />\nwith \"Vive il duce\" instead of \"Yours kins as teacher, dean, and president. presidental address on CommemoraFormerly with EMIL CAYE<br />\nprofessor of archaeRobinson,<br />\nMoore<br />\nTribute<br />\nHollander Pays<br />\ntruly.\"<br />\nof the man who began as<br />\nDay<br />\ntion<br />\nCor. St. Paul and 33rd Streets<br />\nW.<br />\nS.<br />\nology and epigraphy, addressed the<br />\n* * *<br />\nThe testimonial on that occasion<br />\nNext to Birely's<br />\nXxhibition To Consist Of Costumes,<br />\nundergraduate at the University and<br />\nCam\"Third<br />\nthe<br />\non<br />\nHollander,<br />\nsame convention<br />\nRecently the War Department has was read by Dr. Jacob H.<br />\n8 A. M. to 8 P. M.<br />\nthat same Univerfrom<br />\nretired<br />\nwho<br />\nPictures, Scripts And Playbills;<br />\nrounding<br />\npaign f Olynthus.\" Dr. Merritt pre•<br />\nannounced that, beginning next sum- renowned economist who is<br />\npresident. It will<br />\nLouis Azrael To Lecture<br />\nSaturday session.<br />\nteaching sity as its fourth<br />\nthe<br />\nof<br />\nyear<br />\nat<br />\nsided<br />\nforty-first<br />\nhis<br />\nout<br />\nwill<br />\nat<br />\nWest<br />\nPoint<br />\ncadet<br />\nevery<br />\nmer,<br />\n•<br />\nmark the retirement of a keen, clearPhone Belmont 7908<br />\n20 hours of flying in- here and who in his 192-page book,<br />\nman who, in anenergetic<br />\nthinking,<br />\nA special exhibition of material receive at least<br />\npublished<br />\nForth,<br />\nHolds<br />\nProfessor<br />\nA<br />\ncourse.<br />\ncollege<br />\nhis<br />\nof<br />\nnouncing his resignation from office<br />\nPertaining to the Baltimore stage struction as part<br />\nearly in 1931, paid his personal tribWill be shown to the Play Production<br />\nat the age of 70, in essence reiterSt. Paul at 33rd Street<br />\nute to Dr. Ames in an editorial \"Hail<br />\nthe words of the man of whom<br />\nOlass of the Johns Hopkins Univer- REGESTER, ENGINEER GRAD,<br />\nns-School Supplies-Candy<br />\nated<br />\nE<br />\nPrescriptio<br />\nMEDICIN<br />\nOF<br />\nSCHOOL<br />\nsaying<br />\nin<br />\nand Farewell.\" He wrote,<br />\nCigars - Unexcelled<br />\nDaniel Coit Gilman,<br />\nprotege,<br />\na<br />\nwas<br />\nsity Playshop at the Municipal Mu- ELECTED A. S. C. E. OFFICER<br />\nhe<br />\nDURHAM, N. C.<br />\nfarewell to Dr. Frank Goodnow and<br />\nFountain Service<br />\nseum. on Friday of this week.<br />\nwho said:<br />\n•<br />\nAmes:<br />\nDr.<br />\nto<br />\nhail<br />\nCivil<br />\nthe<br />\nof<br />\ngiven<br />\nRobert T. Regester,<br />\nare<br />\nweeks<br />\nof<br />\neleven<br />\nterms<br />\nFour<br />\nShowing the history of the Baltchair<br />\nl<br />\n\"I gave up the presidentia<br />\neach year. These may be taken con\"Into so honored a succession comes<br />\nMore stage since the beginning of engineering class of 1905, and a<br />\nsecutively (graduation in three years)<br />\nin the Johns Hopkins University, not<br />\nGilman,<br />\nof<br />\nProtege<br />\nleader.<br />\nnew<br />\nthe<br />\ntheatricals in Maryland, the collection member of the American Society of<br />\nor three terms may be taken each year<br />\nbecause<br />\nnot<br />\nit,<br />\nof<br />\ntired<br />\nwas<br />\nI<br />\nbecause<br />\nGoodof<br />\n(graduation in four years). The enaide<br />\nRemsen,<br />\nof<br />\nassociate<br />\nAmthe<br />\nand<br />\nng<br />\nEngineeri<br />\nl<br />\ncontains pictures, playbills, costumes, Mechanica<br />\ntrance requirements are intelligence,<br />\nHopkins spirit in his I was conscious of bodily infirmity,<br />\ncharacter and at least two years of<br />\n1902 N. CHARLES STREET<br />\nerican Society of Civil Engineering, now, with the<br />\nand scripts.<br />\nwidethe<br />\nto<br />\ndeference<br />\nof<br />\nout<br />\ncollege work, including the subjects<br />\nbut<br />\ntakes<br />\nAmes<br />\nPresident<br />\nmarrow,<br />\nvery<br />\nthe<br />\nat<br />\nA Medical Schools.<br />\nGrade<br />\nfor<br />\nspecified<br />\nOn January 28, the third lecture of while pursuing his studies<br />\nCards - Sending Library<br />\nGreeting<br />\nwhich<br />\nconfidence of spread usage of this country,<br />\nCatalogues and application forms may<br />\na series offered by the Playshop will Hopkins, is now president of the Cen- into office the blanket<br />\nfrom the Dean.<br />\nsenage,<br />\nobtained<br />\nbe<br />\nEvenings<br />\ncertain<br />\na<br />\nOpen<br />\nat<br />\nthat,<br />\nsuggests<br />\nthe<br />\nbe. given by Louis Azrael, dramatic tral Ohio Section of the American all those who love and revere<br />\njuniors.\"<br />\nfor<br />\nway<br />\nmake<br />\nshould<br />\niors<br />\nclistinbeen<br />\nUniversity . . . He has<br />\ncritic of the Baltimore News-Post.<br />\nSociety of Civil Engineering.<br /><br />\nPlayshop Class To<br />\nView Stage History<br /><br />\nTheodore's Barber Shop<br /><br />\nDUKE UNIVERSITY<br /><br />\nBirely's Pharmacy<br /><br />\nNooney Book Shop<br /><br />\n4<br /><br />\nHOME WOOD, BALTIMORE, MD., JANUARY 8, 1934.<br /><br />\nBoxing Squad<br />\nJay Dribblers Jay<br />\nTo Begin Workouts<br />\nSnowed Under Under Coach Lotz<br />\nIn Two Straight<br />\nSquad Of Twenty-Two Men Ready<br />\nFor Instruction In NewlyInstituted Sport<br /><br />\nNew York U., West Point<br />\nAggregations Double And<br />\nQuadruple Blue Jay Score<br /><br />\nBeginning this week, official boxing practice will be held on every<br />\nTuesday, Wednesday, and Friday<br />\nfrom 4.30 to 5.30, although the equip-<br /><br />\nment will be available every day, acSiegel Stands Out cording<br />\nto Ed Lotz, coach of the<br />\nleather-pushers.<br /><br />\n• Fleet Hopkins Forward Leads<br />\nTeammates In Scoring As<br />\nThey Lose, 45-12, 45-23<br /><br />\nTwenty-two men reported to Lotz<br />\nfor the first boxing practice and have<br />\nbeen working out regularly every<br /><br />\nAll-Star Touch Football Team<br />\nSelected By Edwin Lotz And Ronald Levy<br />\nHARTMAN<br />\nCHANCELLOR<br />\nSTEVENSON<br />\nZIERLER<br />\nPOVVELL<br />\nNAYLOR<br />\nFOLLMER<br /><br />\nF.B<br />\nHB<br />\nHB<br />\nQ.B<br />\nE<br /><br />\nPhi Kappa Psi<br />\nBeta Theta Pi<br />\nOmicron Kappa Omicron<br />\nPhi Sigma Delta<br />\nDelta Upsilon<br />\nPhi Gamma Delta<br />\nE<br />\nPhi Kappa Psi<br />\nHonorable Mention—NEU, A. T. 0.; BILLINGSLEA, D. U.; I-IIMES,<br />\nPhi Kappa Psi; SHIFF, Phi Sigma Delta.<br /><br />\nVersatile Group Selected By Football Eleven Chooses<br />\nIntramural Directors Rep- Pasarew As Next Captain<br />\nresent Star Performers<br /><br />\nTrophy Points And<br />\nfinal Standings<br /><br />\nPhi Kappa Psr-LN1<br />\nTo Get Troph)—<br /><br />\nPoints Toward Trophy<br />\n15 points for a game won, 10 points<br />\nfor a tie, 5 points for a game played<br />\nAt Thursday's assembly, Phi KapG1<br />\nand lost.<br />\npa Psi, winner of the fraterni0<br />\nad<br />\ntouchball tournament, will be pre<br />\nPhi Kappa Psi<br />\nj<br />\nfa<br />\n105<br />\nsented a plaque emblematic of it a<br />\nPhi Sigma Delta<br />\n90<br />\nchampionship. This award will re•<br />\nDelta Upsilon<br />\n80<br />\nmain in the permanent possession o<br />\nli<br />\nBeta Theta Pi<br />\n70<br />\nthe fraternity.<br />\nKappa Alpha<br />\n70<br />\nDr. G. Wilson Shaffer, director of<br />\nPhi Gamma Delta<br />\n65<br />\nintramural athletics, announced thac,<br />\nKappa Sigma<br />\n65<br />\nplaques will be awarded during<br />\nAlpha Tau Omega<br />\n65<br />\ncourse of the year to the four &amp;ate''<br />\n, 1<br />\nSigma Phi Epsilon<br />\n65<br />\nnities winning the basketball, volley. T<br />\nOmicron Kappa Omicron<br />\n50<br />\n.1.'<br />\nball, lacrosse, and playground ball<br />\nPhi Alpha<br />\n45<br />\ntournaments.<br />\nThe<br />\nbasketball<br />\nan<br />\nPi Lambda Phi<br />\n30<br />\nvolleyball tournaments are now i W.<br />\nTau Alpha Omega<br />\n25<br />\nprogress.<br />\nDelta Phi<br />\n20<br />\nAt the end of the year the frater-p v<br />\nnity getting the highest total of point a y<br />\nDivision A<br />\nin all sports will be awarded a large<br />\nL<br />\nPhi Kappa Psi<br />\n6<br />\n0 0 12<br />\ntrophy for one year. Should any frai<br />\nBeta Theta Pi<br />\n2<br />\n2<br />\n2 6<br />\nternity win this cup three times it<br />\nKapp Alpha<br />\n2 2 2 6<br />\nwill be given permanent possession Tb<br />\nPhi Gamma Delta<br />\n2<br />\n1<br />\n3<br />\n5<br />\nof it.<br />\nenco<br />\nSigma Phi Epsilon<br />\n2<br />\n1<br />\n5<br />\nPoints toward the trophy are lege<br />\nOmicron Kappa<br />\nawarded on the basis of fifteen for a,eolel<br />\nOmicron____ 2<br />\n4 0 2<br />\nwin, ten'for a tie, and five for a game new<br />\nDelta Phi<br />\n0 6<br />\n0 0<br />\nplayed and lost.<br />\n• the<br /><br />\nthendeli<br /><br />\nLen Emmert To Lead Cross-Country<br />\nBy EDWIN LOTZ<br />\nTeam In 1935 Campaign;<br />\nJohn Macgill, Manager<br />\nThe abundance of good football<br />\nafternoon. Six of the men have had players in the league made the<br />\nselectAt a meeting held before the holiThe Jay dribblers bowed twice on previous boxing experience and should ing of an all around star team a<br />\ndays, Reuben Pasarew was elected<br />\na disastrous northern jaunt. Friday form a capable nucleus for any team<br />\nproblem of deciding on the All-Star captain and John Macgill,<br />\nmanager of<br />\nnight it was to New York University Hopkins might put out. These<br />\nvet- men who could play any other posi- the varsity football team<br />\nfor the 1935<br />\nby a score of 45 to 12 and Saturday<br />\nerans are Caleb Ewing, Harold Glas- tion on the team equally as<br />\nwell as season. Among the veterans who will<br />\nnight it was to the Kaydets of West<br />\nreturn along with Pasarew are Vinser,<br />\nJohn Stevens, Lopez-Dupre, Ber- the one for which he was<br />\nPoint to the tune of 45 to 23.<br />\nselected.<br />\ncenti, Kelly, Graziano, Ellis and Halnard<br />\nVincenti, and Wiseman.<br />\nFor the first fifteen minutes of<br />\nPhi Kappa Psi, the winners of the<br />\nbert.<br />\nthe Army game the two teams battled<br />\n\"All of the novices are taking to league, was the only<br />\nfraternity to<br />\nThe cross-country team elected<br />\non even terms, the score being 11-10 the sport exceptionally well and<br />\nplace more than one man on the Leonard Emmert captain and Roy<br />\nin favor of the Army at this point. should develop some class with pracThen with but five minutes to go in tice,\" Coach Lotz stated. \"Don Nay- team. Chancellor and Follmer, both Hartman manager for the 1935 seaEmmert,<br />\nperforming<br />\nwell<br />\nDivision 13<br />\nthe first half the Graylegs ran up 12 lor,\" he added, \"especially has de- excellent all around performers for son.<br />\nthroughout the season, finished tenth Phi Sigma Delta<br />\n5<br />\n0<br />\npoints and a 23-10 lead.<br />\nveloped surprisingly fast.\"<br />\nthe champions, were selected. The<br />\nin a large field in the South Atlantics. Delta Upsilon<br />\n3<br />\n1<br />\nIn the second half Wright Hiatt,<br />\nPromising Squad<br />\npassing ability of Chancellor made<br />\nBesides Emmert, the hill-and-dalers' Alpha Tau Omego<br />\n2<br />\nSoldier captain and center, looped in<br />\nBesides Naylor, Lotz picked Charles him invaluabe to<br />\nhis team and also coach, Waldo Hambleton, is expect- Kappa Sigma<br />\n• 2<br />\n1<br />\nfour baskets to make his total points Mewshaw, Jackson Kaufman, R. L.<br />\n4<br />\n1<br />\n18 for the evening. Dewalt, who star- Lowrey, and John Weber as the men his excellent blocking ability gave him ing back next year Brown, Cas- Phi Alpha<br />\n4<br />\n1<br />\nred against Hopkins last year with showing most promise of developing the edge over Billingslea of the Delta telle, Schultz, Weber, Sholtes, and Pi Lambda Phi<br />\nLyman.<br />\nTau Alpha Omega<br />\n0 5<br />\n14 points, shot five field goals in this into first class boxers.<br />\nUpsilon.<br />\nsecond half to run his evening's total<br />\nArrangements are under way to<br />\nPowell, Folmer, Ends<br />\nup to 12.<br />\nhave the men on the squad who develThe two ends, Powell and Follmer,<br />\nSiegel Stars<br />\nop enough skill engage in weekly both played in the<br />\nbackfield at times<br />\nThe brightest spot for the Blue was bouts with the boxers of the differand could have been chosen for those<br />\nthe cavorting of Herbie Siegel who ent clubs around Baltimore.<br />\nThe<br />\nled his teammates with two field Martin A. C. and the Stonewall Dem- positions. They were chosen as ends<br />\nbecause of the lack of any outstandgoals and three fouls for 7 points.<br />\nocratic Club both have weekly conOn Friday night, N.Y.U. gained its tests and if possible the Hopkins ing performers for these positions.<br />\nBoth are excellent pass receivers and<br />\nfifth win of the season and its twen- squad will participate in them.<br />\nare good blockers.<br />\nty-first consecutive triumph by buryBut they tell us they don't mind it half so much<br />\nCoach Lotz urged that all men who<br />\nThe all important position of<br />\ning Hopkins under a 45-12 score.<br />\nare interested in learning the manly<br />\nHutzler's, where—<br />\nTen men figured in the Violet scor- art of self-defense report as soon as quarterback goes to Zierler of the Phi<br />\ning, none of them accounting for possible in order to learn the funda- Sigma Deltas. His devising of plays<br />\nWhat you want is easy to find.<br />\nmore than 8 points. Willie Rubenstein mentals. Practice all next week will and uncanny ability of crossing up<br />\nYou get efficient service.<br />\nand Joe Greenberg, brother of Hank still be on fundamentals, Lotz stated, the defensive teams makes him the<br />\nGreenberg of the Detroit Tigers, each but after that the various punches outstanding performer for that posiPrices are reasonable.<br />\ntion.<br />\nchalked up 8 points to lead the tally- will be taught.<br />\ning.<br />\nIf the squad shows sufficient promThe center position, one which reJays Use Nine Men<br />\nise the coaching staff will make ef- quires good blocking was given to<br />\nAlthough he rang up only 4 points, forts to arrange varsity competition Naylor, because of his general all<br />\nSiegel again led the Jays. No Hop- with outside schools.<br />\naround versatility.<br />\nkins man got more than one field<br />\ngoal. As in the Army game, Coach<br />\nDarley used nine men.<br />\nSince the Hopkins game, N.Y.U.<br />\nhas brought its string of consecutive<br />\nvictories to twenty-two with a 23-22<br />\nedge over the University of Kentucky.<br />\nTonight Darley's Blue Basketeers<br />\njourney to Emmitsburg to lift the lid<br />\nof the 1935 Maryland Intercollegiate<br />\nLeague campaign. Friday they open<br />\nthe Homewood cage to intercollegiate<br />\ncompetition with a league fracas with<br />\nWashington College.<br />\nHopkins<br />\nN.Y.U.<br />\nG. F. T.<br />\nG. F. T.1<br />\nSiegel<br />\n1 2 41Maidman 0 2 2<br />\nWoodrow 0 O 01Machtwitz 3 0 6<br />\nZheutlin 0 O 01Greenb'g 4 08<br />\nReynolds 1 1 31Gross<br />\n4<br />\n2<br />\nSiverd<br />\n1 O 21Weinstein 2<br />\n4<br />\nRaisin<br />\n2<br />\n1 1 31Schulman 1<br />\nChan'llor 0 O 010'Neill<br />\n4<br />\n2<br />\nBranower 0 O 01Rub'stein 4<br />\n8<br />\n4<br />\nRubinger 0 O 01Geffen<br />\n2<br />\n3<br />\n1<br />\n'Strauss<br />\n- —1<br />\n— — —<br />\nTotals<br />\n4 4 121 Totals 4 4 12<br />\nHopkins<br />\nArmy<br />\nG. F. T.<br />\nG. F. T.1<br />\nWoodrow 1 2 41Meyer<br />\n0 1 1<br />\nSiegel<br />\n2 3 71Cummings 0 0 0<br />\nChan'llor 3 O 61Stancook 2 1 5<br />\n6 0 12<br />\nRaisin<br />\n0 O OlDewalt<br />\nReynolds 1 4 61West'land 0 0 0<br />\nZheutlin 0 0 01Hiatt<br />\n8 2 18<br />\nSiverd<br />\n0 O lUn'wood 2 1 5<br />\nMcCarty 0 O 0Hold'man 0 0 0<br />\n1 0 2<br />\nRubinger 0 O 01Clifford<br />\n1 0 2<br />\nI Burke<br />\n— — —<br />\n— —1<br />\nTotals 7 923<br />\n20 545<br /><br />\nOf<br /><br />\n1 11<br />\n0 10<br />\n1<br />\n7<br />\n3<br />\n7<br />\n1<br />\n3<br />\n0 2<br />\n0 0<br /><br />\n101 E. 21st St.<br /><br />\nCH. 9849<br /><br />\nPeabody Pharmacy<br /><br />\nfi.ve<br />\nin t<br />\nLeal<br />\nNo delivery too small. Bel. 5318<br />\nTI<br /><br />\nCHARLIE<br />\nat<br /><br />\nDER<br /><br />\nFIRST CLASS LAUNDRY<br />\n3224 GREENMOUNT AVE.<br />\nButtons Sewed On, Stockings<br />\nMended, and all Needed Repairs<br />\nAt No Extra Charge<br /><br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and SCIENTIFIC<br />\nPUBLICATIONS<br />\n12-20 HOPKINS PLACE, BALTIMORE<br /><br />\nI do believe<br />\nIll try one<br /><br />\nGames This Week<br /><br />\n—deyalleo saythy.. THEY'RE MILDER<br />\n-anciikar<br />\nsa3.. THEY TASTE BETTER<br />\n(0 1935, LIGGETT &amp; MYERS TOBACCO CO.<br /><br />\na le4<br />\noyez<br />\nexpl<br />\nthe<br />\nvelo<br />\nbar]<br /><br />\nnew<br />\ncyst<br /><br />\nshot<br />\ntice<br /><br />\n•<br /><br />\nZavidkrakS/<br /><br />\nBASKETBALL<br />\nTHURSDAY, JANUARY 10<br />\nKappa Alpha vs. Kappa Sigma,<br />\n2nd court-2 p. m.<br />\nDelta Upsilon vs. Phi Alpha, 1st<br />\ncourt-1 p. m.<br />\nTau Alpha Omega vs. Alpha Tau<br />\nOmega, 3rd court-2 p. m.<br />\nOmicron Kappa Omicron vs. Sigma<br />\nPhi Epsilon, 2nd court-1 p. m.<br />\nPi Lambda Phi vs. Phi Gamma<br />\nDelta, 1st court-2 p. m.<br />\nAlpha Delta Phi vs. Delta Phi,<br />\n3rd court-1 p. m.<br />\nVOLLEYBALL<br />\nPhi Kappa Psi vs. Phi Gamma Delta, 3rd court.<br />\nBeta Theta Pi vs. Alpha Delta Phi,<br />\n1st court.<br />\nPi Lambda Phi vs. Phi Sigma Delta, 4th court.<br />\nDelta Phi vs. Tau Alpha Phi, 2nd<br />\ncourt,<br /><br />\nTI<br /><br />\nPron<br />\nHop'<br />\nWas<br />\nthen<br /><br />\nCALVERT and 30TH STS.<br />\nFirst in Quality — First in<br />\nService<br /><br />\nWE KNOW<br />\nMEN HATE TO SHOP<br /><br />\nHUTZLER BFOINElt 0';<br /><br />\nFRIED'S<br />\nFOR CLEANING, DYEING and<br />\nPRESSING—Reasonable Rates<br />\nWe Call For and Deliver<br /><br />\n/<br /><br />\nPast<br />\nthe<br />\nkins<br />\nlege<br /><br />\nclevc<br />\nthal<br />\ngayy<br />\ntall<br />\nti<br />\nred<br /><br />\nSpi(<br />\n1211E<br />\nexp<br />\nray)<br /><br />\nrea<br /><br />\ntips<br /><br />\nsho<br />\n110]<br /><br />\niv<br />\nber<br />\naric<br />\ngu<br />\nan(<br /><br />\nwil<br />\nPr(<br /><br />\nPro<br /><br />"}], "field_media_file": [{"target_id": 38894, "display": null, "description": null, "target_type": "file", "target_uuid": "cace33c1-178a-4182-a1fd-5304b32b138a", "url": "http://digital.library.jhu.edu/system/files/2022-03/12571-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12571, "target_type": "node", "target_uuid": "2ca9f215-124c-4036-9613-e6a5e8681b73", "url": "/node/12571"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "b4ac35ae-6755-41ba-8978-0399f63a34df"}]}