{"mid": [{"value": 51091}], "uuid": [{"value": "fa1bfb50-1429-49d2-b132-8494623b6ca4"}], "vid": [{"value": 51091}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-19T17:07:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "15659-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-19T17:07:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-19T17:07:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "8<br />\n<br />\nGENERAL DESCRIPTION.<br />\n<br />\n <br />\n<br />\nand saw-mills for local business. The soil is vari-<br />\nable, and of the same character with most of this<br />\nshore of the Bay, ranging from stiff clay to a light<br />\nsand, with, in many places, a black loam. Shell-<br />\nrmanure affords a good fertilizer. Oak, hickory,<br />\npine, and walnut are the natural timbers, which are<br />\nabundant and largely exported. A good part of the<br />\ncounty is uncultivated, but where well tilled the land<br />\nis generally quite productive. 'Wheat and corn are<br />\nthe staples, with large quantities of vegetables, and<br />\nalso some sorghum is now raised. This county is<br />\nlargely increasing its production of peaches, which<br />\nare being made very profitable crops. Shad and<br />\nherring fisheries are numerous, and generally do<br />\nwell, whilst almost all sections have supplies of fresh<br />\nfish. Opysters are very abundant, and of the finest<br />\nkind, this county taking in some of the upper part<br />\nof the great oyster-beds of Tangier Sound, the most<br />\nfamous oyster-field of Maryland. .<br />\n<br />\nDorchester is almost surrounded by navigabl<br />\nwaters, and is also intersected by the Transquaking,<br />\nChicamacomico, and Blackwater rivers, and Marshy<br />\nIlope Creck, giving facilities for transportation of<br />\nproduce, ete., nearly all points being conveniently<br />\nlocated to the water. The recent completion of a<br />\nrailroad 83.5 miles in length, from Cambridge, to<br />\nconnect with the Delaware Railroad at Seaford, Del.,<br />\nhas greatly increased the commercial facilities of the<br />\ncounty.<br />\n<br />\nCambridge is the county-seat, and is a very pleas-<br />\nant town, well situated on the south bank of the<br />\nChoptank River. Other villages are East New Mar-<br />\nket, Vienna, and Church Creek.<br />\n<br />\nFREDERICK COUNTY ranks with the largest<br />\ncounties, and is bounded on the north by Pennsyl-<br />\nvania, on the east by Carroll County, south-easterly<br />\nby Montgomery County, south by the Potomac River<br />\nand Virginia, and on the west by the Blue Ridge, or<br />\nSouth Mountains, separating it from Washington<br />\nCounty.<br />\n<br />\nThis is one of the richest and most beautiful coun-<br />\nties of the State. The soil is mostly limestone, with<br />\nsome slaty, and considerable “red-lands.” The sur-<br />\nface is undulating — partly mountainous —the Ca-<br />\ntoctin Mountains dividing the county into two broad<br />\nvalleys, that to the westward being known as the<br />\nMiddletown Valley, which is drained by the Catoctin<br />\nRiver and its branches; and that east of the Catoc-<br />\ntin range is the valley of the Monocacy. Both<br />\nrivers flow southward into the Potomac. These two<br />\ngreat valleys are unsurpassed for rural beauty and<br />\nexcellent farming, and produce extraordinary crops<br />\nof the principal grains of this latitude. The eastern<br />\nslope of the Catocti Mountain is a most excellent<br />\ngrape country.<br />\n<br />\nThe county is well watered by innumerable pure<br />\nsprings, which flow into the branches of the rivers<br />\nbefore named, and create abundance of water-powers,<br />\nwhich are improved by large grist- and saw-mills,<br />\nand merchant or flour-mills. There are also a<br />\nnumber of other mills, tanneries, and various do-<br />\nmestic manufactures. An immense water-power<br />\nunimproved, exists on the Potomac River at Wever-<br />\nton. The narrow valley between the Monocacy and<br />\nBuckeystown has a rich deposit of a marl composed<br />\nof lime and earthy substance, which extends to a<br />\nconsiderable depth; this with the limestone yield an<br />\ninexhaustible supply of manure.<br />\n<br />\nCopper mines in the Linganore section have been<br />\nworked since the Revolutionary war. Near Liberty<br />\nand New London are several mines, now extensively<br />\noperated. There are several slate quarries, one of<br />\nwhich near Ijamsville, on the Baltimore and Ohio<br />\nRailroad, produces a large supply of excellent roofing<br />\nmaterial. Along the side of Catoctin Mountain iron<br />\nore abounds, of the brown hematite species. Some<br />\nof these beds, although worked for eighty years, secem<br />\nto be inexhaustible. From Woodsborough to the<br />\nPotomac is a range of limestone marble unusually<br />\npure, varying in color from blue to dove color. It<br />\n<br />\n <br />\n<br />\ntakes a beautiful polish, and is similar to the famed<br />\nItalian marbles of that color. At the foot of Catoc-<br />\ntin Mountain there is a similar bed, and one resem-<br />\nbling verde antique. West of Frederick is another<br />\nkind of variegated shades of light and dark red, and<br />\non the west side of Monocacy is found the variety<br />\nwidely known, from having been used for the col-<br />\numns in the old hall of the House of Representatives<br />\nof the Capitol at Washington. Frederick County<br />\nis now centrally traversed by the Baltimore and<br />\nOhio Railroad, whose company is also now building<br />\na branch from the Point of Rocks, to run through<br />\nMontgomery County direct to Washington, whilst<br />\nalong the southern border, on the Potomac River,<br />\nruns the Chesapeake and Ohio Canal, and the West-<br />\nern Maryland Railroad is extended from Union<br />\nBridge at the eastern border of the county to Hagers-<br />\ntown. These together afford good transportation to<br />\nall portions of the county.<br />\n<br />\nThe county-seat is at Frederick City, a very pleas-<br />\nant city of about 9,000 inhabitants, situated in a very<br />\nfine fertile district. In addition to this city, the<br />\ncounty is dotted with considerable towns, all sus-<br />\ntained by the surrounding country, such as Middle-<br />\ntown, New Market, Jefferson, and others.<br />\n<br />\nHARFORD COUNTY, organized in 1773, is of<br />\n<br />\nmedium size, is the north-eastern corner of the west-<br />\n<br />\nern shore of the State, and is bounded on the east<br />\nand south-east by the Susquehanna River and Ches-<br />\napeake Bay, on the north by Pennsylvania, and on<br />\nthe west and south-west by Baltimore County.<br />\n<br />\nThis county possesses a great variety of soils. The<br />\nlower part being level and composed of some sandy<br />\nand some clay lands, but mostly of a light loam, very<br />\neasily worked and improved. The section called the<br />\nNecks has mostly very fine and large farms, with ex-<br />\ntensive peach orchards. The country above the<br />\nPhiladelphia turnpike is undulating and in some<br />\nparts very hilly, the soil comprising clay, light-loam,<br />\nand considerable limestone, the last-mentioned being<br />\nmostly found in the upper part of the county.<br />\n<br />\nThis county is well watered by branches emptying<br />\ninto the Little Gunpowder River, and Winter’s and<br />\nBinum’s Runs, which flow southward into the Ches-<br />\napeake, and by Deer Creek and its tributaries, which<br />\ndrain the northern part of the county, and flow into<br />\nthe Susquehanna. ¢ The Rocks of Deer Creek” is<br />\none of the most romantic spots in the State, and<br />\nwell worth a visit of the admirers of the great works<br />\nof nature. These rocks form a great promontory<br />\nprojecting over the road, passing along the bank of<br />\nthe creek. :<br />\n<br />\nPerhaps no county in the State has improved more<br />\nin appearance, fertility, and general prosperity during<br />\nthe last twenty years than Harford.<br />\n<br />\nThe productions are wheat, buckwheat, oats, and<br />\ncorn, and recently considerable crops of sorghum<br />\n<br />\nhave been raised, and made into a fine syrup by a -<br />\n<br />\nnumber of mills erected for that purpose.<br />\n<br />\nThis county possesses fine water-powers, improved<br />\nby furnaces, factories, foundries, some flour-mills, and<br />\nnumerous saw- and grist-mills.<br />\n<br />\nIn this county are large quarries of excellent build-<br />\ning-stone of a gneiss or granite character.<br />\n<br />\nThis county possesses large beds of iron ore, and<br />\nsome of the most valuable chrome beds in the world.<br />\nAlso, near the Pennsylvania line, extensive slate<br />\nquarries have been worked, and near Abingdon there<br />\nexists a very large deposit of kaolin or poreelain clay<br />\nof a pure white color, and very good quality, fit for<br />\nmaking fine porcelain ware.<br />\n<br />\nVery large shad and herring fisheries are located<br />\naround the Susquehanna and Bay shore, and innu-<br />\nmerable flocks of’ wild fowl swarm around the tide-<br />\nwaters of the county, and afford, with the fisheries,<br />\na good business for many of the inhabitants of that<br />\nregion.<br />\n<br />\nThe Philadelphia, Wilmington, and Baltimore<br />\nRailroad passes through the county from Havre de<br />\nGrace, and the Tidewater Canal runs aleng the west<br />\n<br />\n <br />\n<br />\nbank of the Susquehanna, having its outlet at Havre -<br />\n<br />\nde Grace.<br />\n<br />\nThe county-seat is Belair, a small but pleasant<br />\ntown of 300 or 400 inhabitants, and is situated in an<br />\nimproved neighborhood.<br />\n<br />\nThe principal town is Havre de Grace, at the mouth<br />\nof the Susquehanna River. It has about 2,500 in-<br />\nhabitants, and does a considerable lumber and coal<br />\nbusiness. It received its name from French officers<br />\nin the Revolutionary army, who were passing through<br />\nat about the time it was laid out, and fancied that<br />\nit resembled the city of the same name in France.<br />\n<br />\nPort Deposit, four miles above Havre de Grace, is<br />\nat the head of tide-water and sloop navigation, and<br />\nhas an extensive lumber trade.<br />\n<br />\nHOWARD COUNTY, formed since 1850 out of<br />\nthe north-west part of Anne Arundel, is one of the<br />\nsmallest counties, having a length of about twenty-<br />\nfive miles, and a width of about twelve miles, and is<br />\ncentrally situated between the head-waters of the<br />\nPatapsco and Patuxent rivers, the west branch of the<br />\nformer stream separating it from Carroll and Balti-<br />\nmore counties, on the north and east, and the main<br />\nbranch of the Patuxent bounding on the south-west<br />\nbetween it and Montgomery and Prince George’s<br />\ncounties, Anne Arundel County bounds it on the<br />\nsouth-east.<br />\n<br />\nThis county is very undulating, and the soil mostly<br />\ngood, though not all improved, with considerable<br />\nfine limestone land in the central and southern parts.<br />\nIt is completely intersected with spring branches<br />\nflowing into the larger streams, and affording a large<br />\namount of excellent water-powers, which are mostly<br />\nimproved by factories, mills, furnaces, etc. Some of<br />\nthe very best water-powers and largest factories in<br />\nthe State are on its two boundary streams. Inex-<br />\nhaustible quarries of granite exist in the county; one<br />\nvariety near the upper end of the county much re-<br />\nsembles the famous Quincy granite. The largest<br />\nquarries, or those most extensively worked, are be-<br />\ntween Sykesville and Baltimore, on the Patapsco,<br />\nfrom which stone the Cathedral and Record Office<br />\nin Baltimore were built. Another variety, called<br />\nporphyritic granite, has reddish crystals of feldspar<br />\ndisseminated through it. There are large iron-ore<br />\nbeds next to Anne Arundel County, and near the<br />\nWashington Railroad. IToward has thirty-one miles<br />\nof the Baltimore and Ohio Railroad on one side, and<br />\ntwelve miles of the Washington Branch Railroad on<br />\nthe south-east, which together give convenient access<br />\nto almost all parts of the county. This accessibility,<br />\nwith the eminent natural advantages of pure air and<br />\nwater, and innumerable beautiful building sites, are<br />\npromoting improvements, and the vicinity of the<br />\nrailroads is being built up with fine country-seats.<br />\nNear the centre of the county is the Doughoregan<br />\nManor of Charles Carroll, of Carrollton, containing<br />\nnearly 14,000 acres of the finest land in the county.<br />\n<br />\nThe county-seat is Ellicott’s Mills, a considerable<br />\ntown on the Patapsco, surrounded with very ro-<br />\nmantic scenery, and many manufactories. Two other<br />\nconsiderable towns in the county are Elkridge Land-<br />\ning and Lisbon.<br />\n<br />\nKENT COUNTY, organized in 1650, is the sec-<br />\nond in the tier of Hastern Shore counties, and is<br />\nbounded on the Kast by Delaware, and is a peninsula<br />\nlying between the Sassafras River on the north, sep-<br />\narating it from Cecil County, the Chesapeake Bay on<br />\nthe west, and the Chester River on the south and<br />\nsoutheast, separating it from Queen Anne’s County.<br />\n<br />\nThe country is level though not very low, and<br />\nsufficiently rolling to be well drained by many<br />\ncreeks flowing into its border rivers and the Bay.<br />\n<br />\nThe soil is mostly a light friable clayey loam, very<br />\neasily improved and productive. \"Wheat, oats, and<br />\ncorn, and every variety of vegetables, grow abun-<br />\ndantly. The farms are very fine where attended<br />\nwith any care, and latterly nearly every farm has its<br />\norchards of hundreds, and in some instances thou-<br />\n<br />\ni s e i e v<br />\n\f", "format": "basic_html", "processed": "8<br /><br />\nGENERAL DESCRIPTION.<br /><br /><br /><br />\nand saw-mills for local business. The soil is vari-<br />\nable, and of the same character with most of this<br />\nshore of the Bay, ranging from stiff clay to a light<br />\nsand, with, in many places, a black loam. Shell-<br />\nrmanure affords a good fertilizer. Oak, hickory,<br />\npine, and walnut are the natural timbers, which are<br />\nabundant and largely exported. A good part of the<br />\ncounty is uncultivated, but where well tilled the land<br />\nis generally quite productive. 'Wheat and corn are<br />\nthe staples, with large quantities of vegetables, and<br />\nalso some sorghum is now raised. This county is<br />\nlargely increasing its production of peaches, which<br />\nare being made very profitable crops. Shad and<br />\nherring fisheries are numerous, and generally do<br />\nwell, whilst almost all sections have supplies of fresh<br />\nfish. Opysters are very abundant, and of the finest<br />\nkind, this county taking in some of the upper part<br />\nof the great oyster-beds of Tangier Sound, the most<br />\nfamous oyster-field of Maryland. .<br /><br />\nDorchester is almost surrounded by navigabl<br />\nwaters, and is also intersected by the Transquaking,<br />\nChicamacomico, and Blackwater rivers, and Marshy<br />\nIlope Creck, giving facilities for transportation of<br />\nproduce, ete., nearly all points being conveniently<br />\nlocated to the water. The recent completion of a<br />\nrailroad 83.5 miles in length, from Cambridge, to<br />\nconnect with the Delaware Railroad at Seaford, Del.,<br />\nhas greatly increased the commercial facilities of the<br />\ncounty.<br /><br />\nCambridge is the county-seat, and is a very pleas-<br />\nant town, well situated on the south bank of the<br />\nChoptank River. Other villages are East New Mar-<br />\nket, Vienna, and Church Creek.<br /><br />\nFREDERICK COUNTY ranks with the largest<br />\ncounties, and is bounded on the north by Pennsyl-<br />\nvania, on the east by Carroll County, south-easterly<br />\nby Montgomery County, south by the Potomac River<br />\nand Virginia, and on the west by the Blue Ridge, or<br />\nSouth Mountains, separating it from Washington<br />\nCounty.<br /><br />\nThis is one of the richest and most beautiful coun-<br />\nties of the State. The soil is mostly limestone, with<br />\nsome slaty, and considerable “red-lands.” The sur-<br />\nface is undulating — partly mountainous —the Ca-<br />\ntoctin Mountains dividing the county into two broad<br />\nvalleys, that to the westward being known as the<br />\nMiddletown Valley, which is drained by the Catoctin<br />\nRiver and its branches; and that east of the Catoc-<br />\ntin range is the valley of the Monocacy. Both<br />\nrivers flow southward into the Potomac. These two<br />\ngreat valleys are unsurpassed for rural beauty and<br />\nexcellent farming, and produce extraordinary crops<br />\nof the principal grains of this latitude. The eastern<br />\nslope of the Catocti Mountain is a most excellent<br />\ngrape country.<br /><br />\nThe county is well watered by innumerable pure<br />\nsprings, which flow into the branches of the rivers<br />\nbefore named, and create abundance of water-powers,<br />\nwhich are improved by large grist- and saw-mills,<br />\nand merchant or flour-mills. There are also a<br />\nnumber of other mills, tanneries, and various do-<br />\nmestic manufactures. An immense water-power<br />\nunimproved, exists on the Potomac River at Wever-<br />\nton. The narrow valley between the Monocacy and<br />\nBuckeystown has a rich deposit of a marl composed<br />\nof lime and earthy substance, which extends to a<br />\nconsiderable depth; this with the limestone yield an<br />\ninexhaustible supply of manure.<br /><br />\nCopper mines in the Linganore section have been<br />\nworked since the Revolutionary war. Near Liberty<br />\nand New London are several mines, now extensively<br />\noperated. There are several slate quarries, one of<br />\nwhich near Ijamsville, on the Baltimore and Ohio<br />\nRailroad, produces a large supply of excellent roofing<br />\nmaterial. Along the side of Catoctin Mountain iron<br />\nore abounds, of the brown hematite species. Some<br />\nof these beds, although worked for eighty years, secem<br />\nto be inexhaustible. From Woodsborough to the<br />\nPotomac is a range of limestone marble unusually<br />\npure, varying in color from blue to dove color. It<br /><br /><br /><br />\ntakes a beautiful polish, and is similar to the famed<br />\nItalian marbles of that color. At the foot of Catoc-<br />\ntin Mountain there is a similar bed, and one resem-<br />\nbling verde antique. West of Frederick is another<br />\nkind of variegated shades of light and dark red, and<br />\non the west side of Monocacy is found the variety<br />\nwidely known, from having been used for the col-<br />\numns in the old hall of the House of Representatives<br />\nof the Capitol at Washington. Frederick County<br />\nis now centrally traversed by the Baltimore and<br />\nOhio Railroad, whose company is also now building<br />\na branch from the Point of Rocks, to run through<br />\nMontgomery County direct to Washington, whilst<br />\nalong the southern border, on the Potomac River,<br />\nruns the Chesapeake and Ohio Canal, and the West-<br />\nern Maryland Railroad is extended from Union<br />\nBridge at the eastern border of the county to Hagers-<br />\ntown. These together afford good transportation to<br />\nall portions of the county.<br /><br />\nThe county-seat is at Frederick City, a very pleas-<br />\nant city of about 9,000 inhabitants, situated in a very<br />\nfine fertile district. In addition to this city, the<br />\ncounty is dotted with considerable towns, all sus-<br />\ntained by the surrounding country, such as Middle-<br />\ntown, New Market, Jefferson, and others.<br /><br />\nHARFORD COUNTY, organized in 1773, is of<br /><br />\nmedium size, is the north-eastern corner of the west-<br /><br />\nern shore of the State, and is bounded on the east<br />\nand south-east by the Susquehanna River and Ches-<br />\napeake Bay, on the north by Pennsylvania, and on<br />\nthe west and south-west by Baltimore County.<br /><br />\nThis county possesses a great variety of soils. The<br />\nlower part being level and composed of some sandy<br />\nand some clay lands, but mostly of a light loam, very<br />\neasily worked and improved. The section called the<br />\nNecks has mostly very fine and large farms, with ex-<br />\ntensive peach orchards. The country above the<br />\nPhiladelphia turnpike is undulating and in some<br />\nparts very hilly, the soil comprising clay, light-loam,<br />\nand considerable limestone, the last-mentioned being<br />\nmostly found in the upper part of the county.<br /><br />\nThis county is well watered by branches emptying<br />\ninto the Little Gunpowder River, and Winter’s and<br />\nBinum’s Runs, which flow southward into the Ches-<br />\napeake, and by Deer Creek and its tributaries, which<br />\ndrain the northern part of the county, and flow into<br />\nthe Susquehanna. ¢ The Rocks of Deer Creek” is<br />\none of the most romantic spots in the State, and<br />\nwell worth a visit of the admirers of the great works<br />\nof nature. These rocks form a great promontory<br />\nprojecting over the road, passing along the bank of<br />\nthe creek. :<br /><br />\nPerhaps no county in the State has improved more<br />\nin appearance, fertility, and general prosperity during<br />\nthe last twenty years than Harford.<br /><br />\nThe productions are wheat, buckwheat, oats, and<br />\ncorn, and recently considerable crops of sorghum<br /><br />\nhave been raised, and made into a fine syrup by a -<br /><br />\nnumber of mills erected for that purpose.<br /><br />\nThis county possesses fine water-powers, improved<br />\nby furnaces, factories, foundries, some flour-mills, and<br />\nnumerous saw- and grist-mills.<br /><br />\nIn this county are large quarries of excellent build-<br />\ning-stone of a gneiss or granite character.<br /><br />\nThis county possesses large beds of iron ore, and<br />\nsome of the most valuable chrome beds in the world.<br />\nAlso, near the Pennsylvania line, extensive slate<br />\nquarries have been worked, and near Abingdon there<br />\nexists a very large deposit of kaolin or poreelain clay<br />\nof a pure white color, and very good quality, fit for<br />\nmaking fine porcelain ware.<br /><br />\nVery large shad and herring fisheries are located<br />\naround the Susquehanna and Bay shore, and innu-<br />\nmerable flocks of’ wild fowl swarm around the tide-<br />\nwaters of the county, and afford, with the fisheries,<br />\na good business for many of the inhabitants of that<br />\nregion.<br /><br />\nThe Philadelphia, Wilmington, and Baltimore<br />\nRailroad passes through the county from Havre de<br />\nGrace, and the Tidewater Canal runs aleng the west<br /><br /><br /><br />\nbank of the Susquehanna, having its outlet at Havre -<br /><br />\nde Grace.<br /><br />\nThe county-seat is Belair, a small but pleasant<br />\ntown of 300 or 400 inhabitants, and is situated in an<br />\nimproved neighborhood.<br /><br />\nThe principal town is Havre de Grace, at the mouth<br />\nof the Susquehanna River. It has about 2,500 in-<br />\nhabitants, and does a considerable lumber and coal<br />\nbusiness. It received its name from French officers<br />\nin the Revolutionary army, who were passing through<br />\nat about the time it was laid out, and fancied that<br />\nit resembled the city of the same name in France.<br /><br />\nPort Deposit, four miles above Havre de Grace, is<br />\nat the head of tide-water and sloop navigation, and<br />\nhas an extensive lumber trade.<br /><br />\nHOWARD COUNTY, formed since 1850 out of<br />\nthe north-west part of Anne Arundel, is one of the<br />\nsmallest counties, having a length of about twenty-<br />\nfive miles, and a width of about twelve miles, and is<br />\ncentrally situated between the head-waters of the<br />\nPatapsco and Patuxent rivers, the west branch of the<br />\nformer stream separating it from Carroll and Balti-<br />\nmore counties, on the north and east, and the main<br />\nbranch of the Patuxent bounding on the south-west<br />\nbetween it and Montgomery and Prince George’s<br />\ncounties, Anne Arundel County bounds it on the<br />\nsouth-east.<br /><br />\nThis county is very undulating, and the soil mostly<br />\ngood, though not all improved, with considerable<br />\nfine limestone land in the central and southern parts.<br />\nIt is completely intersected with spring branches<br />\nflowing into the larger streams, and affording a large<br />\namount of excellent water-powers, which are mostly<br />\nimproved by factories, mills, furnaces, etc. Some of<br />\nthe very best water-powers and largest factories in<br />\nthe State are on its two boundary streams. Inex-<br />\nhaustible quarries of granite exist in the county; one<br />\nvariety near the upper end of the county much re-<br />\nsembles the famous Quincy granite. The largest<br />\nquarries, or those most extensively worked, are be-<br />\ntween Sykesville and Baltimore, on the Patapsco,<br />\nfrom which stone the Cathedral and Record Office<br />\nin Baltimore were built. Another variety, called<br />\nporphyritic granite, has reddish crystals of feldspar<br />\ndisseminated through it. There are large iron-ore<br />\nbeds next to Anne Arundel County, and near the<br />\nWashington Railroad. IToward has thirty-one miles<br />\nof the Baltimore and Ohio Railroad on one side, and<br />\ntwelve miles of the Washington Branch Railroad on<br />\nthe south-east, which together give convenient access<br />\nto almost all parts of the county. This accessibility,<br />\nwith the eminent natural advantages of pure air and<br />\nwater, and innumerable beautiful building sites, are<br />\npromoting improvements, and the vicinity of the<br />\nrailroads is being built up with fine country-seats.<br />\nNear the centre of the county is the Doughoregan<br />\nManor of Charles Carroll, of Carrollton, containing<br />\nnearly 14,000 acres of the finest land in the county.<br /><br />\nThe county-seat is Ellicott’s Mills, a considerable<br />\ntown on the Patapsco, surrounded with very ro-<br />\nmantic scenery, and many manufactories. Two other<br />\nconsiderable towns in the county are Elkridge Land-<br />\ning and Lisbon.<br /><br />\nKENT COUNTY, organized in 1650, is the sec-<br />\nond in the tier of Hastern Shore counties, and is<br />\nbounded on the Kast by Delaware, and is a peninsula<br />\nlying between the Sassafras River on the north, sep-<br />\narating it from Cecil County, the Chesapeake Bay on<br />\nthe west, and the Chester River on the south and<br />\nsoutheast, separating it from Queen Anne’s County.<br /><br />\nThe country is level though not very low, and<br />\nsufficiently rolling to be well drained by many<br />\ncreeks flowing into its border rivers and the Bay.<br /><br />\nThe soil is mostly a light friable clayey loam, very<br />\neasily improved and productive. \"Wheat, oats, and<br />\ncorn, and every variety of vegetables, grow abun-<br />\ndantly. The farms are very fine where attended<br />\nwith any care, and latterly nearly every farm has its<br />\norchards of hundreds, and in some instances thou-<br /><br />\ni s e i e v<br />"}], "field_media_file": [{"target_id": 52014, "display": null, "description": null, "target_type": "file", "target_uuid": "3e250fd3-f8fc-4e4b-b7dd-751042b9f75c", "url": "http://digital.library.jhu.edu/system/files/2022-03/15659-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 15659, "target_type": "node", "target_uuid": "32879e71-b764-4774-ab48-9eb4bbe4c9a5", "url": "/node/15659"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "447df138-7851-4219-b10b-8e3ba81d1813"}]}