{"mid": [{"value": 36641}], "uuid": [{"value": "1498652b-0aa5-4001-b18f-697720056c0f"}], "vid": [{"value": 36641}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:50:56+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12955-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:50:56+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:50:56+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "iii<br />\nVOL. XXVI. No. 1<br />\n<br />\nBALTIMORE, MD., OCTOBER 4, 1921<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nALL FRESHMEN MUST PAR- VARSITY SEAL COUNCIL TO MEET Y. M. C. A. RECEPTION TO BE<br />\nTHURSDAY<br />\nTICIPATE IN SOME<br />\nHELD FRIDAY NIGHT<br />\nAn important meeting of the VarCOLLEGE ACTIVITY<br />\nsity Seal Voting Council will be held Many Interesting Speakers on Program.<br />\nNew Ruling of Student Council to This on Thursday, October 6, at 12:30,<br />\nAll Freshmen Must Be Present.<br />\nEffect. Other Freshmen Regulain Room 112. At this meeting,<br />\ntions Practically Unchanged.<br />\nThe annual Y. M. C. A. recep- Hopkins Wins After Mountaineers Score. Interesting Game<br />\nplans for the accounting and disWith few exceptions, the Fresh- bursement of all moneys collected tion to the Freshman class will be<br />\nThroughout. Student Band Furnished Music During<br />\nmen regulations for 1921-22 are the by the activities represented on the held Friday at. 8 P. M., in the Civil<br />\nand Before Game.<br />\nsame as last year's, the most im- Council will be discussed All rep- Engineering Hall. The purpose of<br />\n.<br />\nportant change being the introduc- resentatives must be present and the reception is to introduce the<br />\nIn a hard-fought and evenly-played game, Saturday, the team from<br />\ntion of a regulation requiring every must be ready to give a complete Freshmen to college life.<br />\nJohnny<br />\nHopkins triumphed over Mt. St. Mary's College, of EmmitsFreshman to take part in some col- account of the financial condition<br />\nThe prOgram, as announced by burg, by the score of 3 to 2. This serves to indicate how interesti<br />\nng the<br />\nlege activity. It is hoped that this of their respective activities.<br />\nDr. the Y. M. C. A., includes several game was from whistle to curtain. The Emmitsburg lads slightly outrule will provide a greater amount John C. French and John T.<br />\nMey- prominent and interesting speakers. weighed their hosts and the locals had a hard time for a while, but finally<br />\nof material for the various activ- ers will also be present.<br />\nDean Latane, Mr. Eugene Lever- got the long end of the score. In the first quarter Hopkins<br />\nbested the<br />\nities and at the same time give the<br />\ning, of the .Board of Trustees Dr. Collegians on every side, but after that both sides failed to gain<br />\nconmen a chance to help the UniverFrench and Mr. Morris, secretary sistently, although Van Orman's men made six first downs<br />\nto<br />\nthe<br />\nvissity and cause them to take an ac- PART OF DOWN-TOWN PROPERTY of the Central<br />\nY. M. C. A., will itors' five. Perhaps the Chapman brothers and McCauley played the<br />\nSOLD<br />\ntive interest in Hopkins affairs.<br />\nspeak on subjects related to their best game for Mt. St. Mary's, while Calkins, Middleton, Spinney<br />\nand<br />\nThe old group of buildings south<br />\nFreshmen who:go out for aCtivrespective offices or positions. Dr. Darley showed up for the locals. Calkins' 65-yard run was<br />\nthe feature<br />\nities or who present to the Student of Druid Hill Avenue, comprising Schwartz<br />\nwill speak on the relation and the only breakaway from straight football, while the J. Chapman<br />\nCouncil a satisfactory excuse for the Hopkins Hall, the Chemical of the<br />\nstudent<br />\nto the church. J. Barrett combination completed several passes for the visitors.<br />\nLaborato<br />\nBiologica<br />\nry,<br />\nthe<br />\nLaboral<br />\nnot doing so will be given distincThompson will represent the OmiToo much praise cannot be given the student band which was present<br />\ntive buttons. Those who do not tory, and the former main build- cron Delta<br />\nhonorary frater- and furnished excellent music, considering their lack of preparation, durKappa,<br />\nhave these buttons at the end of ing, has been sold by the Univer- nity;<br />\nRichard Wood, the Student ing and before the game.<br />\ntwo weeks will be -violating the sity for the sum of $400,000.<br />\nCouncil; Andrew Knechf, the AthGAME, PLAY BY PLAY<br />\nCalkins was forced to drop kick,<br />\nit was stipulated at the time of<br />\nFreshmen regulations and will be<br />\netic Association; Douglas Cotton, Knecht received the kick off and successfuly placing the<br />\npurchase<br />\nball between<br />\nthe<br />\nthat<br />\nthe University<br />\ntreated accordingly.<br />\nhe Varsity Seal Voting Council, an five yards. Hopkins failed to the goal posts for<br />\nwould<br />\nwhat<br />\nbe<br />\nallowed the use of the Biproved to<br />\nThe regulations are as follows:<br />\n.nd Gilson Engel, the Interfraterni- gain a first down and Marken be the winning<br />\npoint.<br />\n1. Within two weeks after the be- ological and Chemical Laboratories y Board.<br />\nThe speeches will be in- kicked. Mt. St. Mary's also failed<br />\nHopkins kicked off and Middleginning of the ,college year every for a period of two years.<br />\ntersperse<br />\ngain<br />\nto<br />\nand<br />\nwith<br />\nd<br />\nmusic<br />\nkicked<br />\nDarley,<br />\nfurnished<br />\nwho<br />\nto<br />\nby<br />\nton<br />\nnailed Lynch just as the quarter<br />\nAt the end of this time it is hoped<br />\nFreshman must be actively particithe University Quartette and Jazz ran 18 yards. Hopkins was again ended.. The fourth<br />\nquarter was<br />\npating in some recognized college that the School of Hygiene will be<br />\nOrchestra. Refreshments will be forced to kick to Lynch, `who was .comparatively<br />\nuninteresting, neither<br />\nactivity or must present to the Stu- installed in its new home—a gift<br />\nserved after the speeches.<br />\nnailed by Middleton, with a pretty side being able to make<br />\nconsistent<br />\ndent Council a reasonable excuse of the Rockefeller Foundation—adLest<br />\ntackle.<br />\nThe visitors failed to gain gains, and few thrills being<br />\nthere<br />\nany<br />\nbe<br />\nmisunder<br />\nstandjoining<br />\nthe<br />\nJohns<br />\nHopkins<br />\ngiven<br />\nHosfor not doing so.<br />\ning, the Student Council wishes to by plunging or end runs, and the the spectators, and the<br />\npital,<br />\nand<br />\ngame<br />\nthat<br />\nended<br />\nthe<br />\nChemical<br />\nnew<br />\n2. Freshmen shall at once learn<br />\nmnounce that the tfaditional Fresh- ball went over on their 32-yard line. just after Calkins intercept<br />\ned a forLe University songs and yells Laboratory will be completed at<br />\nman-Sop<br />\nhomore \"scrap\" will not be Mt. St. Mary's was penalized five ward pass and the ball was<br />\nomewood<br />\n.<br />\non Mt.<br />\n. ound in the<br />\nM. C. A. hand book<br />\ninterfered with, but that it must not yards for offside, Willis' off tackle St. Marrs 20-yard line.<br />\nand shall read the constitution of<br />\nstart until the Council gives the sig- plunge and a pass from Parley- to Lineup:<br />\nthe Student Council. They shall<br />\nJOHNS HOPKINS UNIVERSITY<br />\nial. Every underclassman must re- Brown failed to bring the necesHOPKINS<br />\nMT. ST. MARY'S<br />\nbe familiar with these by the time FOOTBALL TEAM, SEASON 1921<br />\nBrown 1<br />\nmain in the hall until the refresh- sary ten yards. Willis broke through 211 Middleton L E<br />\nWesterman . L.T . .. Lockwood 2<br />\nof the organization- of the class:\\A games pla ecl at I I omewood ments are served<br />\nand downed J. ChaPnian for a loss. 13 Magill<br />\nand<br />\nCouncil<br />\nthe<br />\nL<br />\nG.<br />\n.<br />\n.<br />\n.H<br />\nMorey 3<br />\n3. Freshmen shall not wear hats except where noted.<br />\nC....Gable (c) 4<br />\n;ives the signal. All freshmen are Chapman punted. Markell gained 318 Crc.mwell....0<br />\nLandy......R.G....D. Morey 5<br />\ninside the University buildings.<br />\nOctober 1—Mt. St. AI ctry's Col- !. xpected to be present.<br />\nseven yards and Willis made first 4 Knecht.....R.T..T. Chapman 6<br />\n4. No Freshman shall smoke nor lege.<br />\nR E •<br />\n.Feverall 7<br />\ndown for Hopkins. The visitors 11 Rich<br />\n6 Darley<br />\nhave his hands in his pockets while<br />\nQ B<br />\nLynch 8<br />\nOctober 8—Delaware College.<br />\nagain penalized for being off side. 29 Willis<br />\nY. M. C. A. MEMBERSHIP AND<br />\nR H<br />\nBarrett 9<br />\nin the buildings or on the grounds<br />\n7<br />\nSpinney<br />\nOctober 15—Dickinson College.<br />\nL H<br />\nMcCauley 10<br />\nMarkell failed to drop kick and<br />\nADVANTAGES<br />\n19 Markell.....F.B..J. Chapman 11<br />\nof the University.<br />\nOctober 22—At Virginia, UniLynch<br />\nrecovered<br />\nthe<br />\nball.<br />\nSubstituti<br />\nMcCauons: Mt. St. Mary s—RearSince the Y. M. C. A. is included<br />\n5. Freshmen shall occupy seats versity of Virginia.<br />\nley made three yards through the don for McCauley. Hopkins—Magill for<br />\nin,<br />\nnon-athletic<br />\nthe<br />\nevery<br />\nbudget,<br />\nWesterman<br />\nin the rooters' section at all games<br />\n, Barton for Cromwell, CoaOctober 29—Western Maryland<br />\nstudeni who has paid the student line. Quarter ends with ball be- dy for Spinney, Calkins for Markell.<br />\nit Homewood, unless they are ac- College.<br />\nUmpire—R. W. Hogsett.<br />\nF.<br />\nactivities fee is entitled to member- longing to Mt. St.\" Mary's on her S. Porter. Lineman—B. W.Referee—<br />\nzompanied by guests..<br />\nHoban.<br />\nNovember 5—Haverford College.<br />\n15-yard<br />\nline.<br />\nSCORE BY QUARTERS<br />\nhip in the organization upon reg6. Freshmen shall wear official<br />\nMt. St. Mary's<br />\nNovember 12—At Swarthmore,<br />\n0 2 0 0— 2<br />\nSECOND QUARTER<br />\nistration at the \"Y\" office. In ad<br />\nFreshmen cap and black socks and Swarthmore<br />\n0 0 3 0— 3<br />\nNo changes in either lineup. J. Hopkins<br />\nCollege.<br />\ndition to the many advantages in Chapman went<br />\nneckties while on University propthrough center for NEWS<br />\nNovember 19—St. John's Col-LETTER STARTS ON<br />\nsuch membership are the special six yards and Lynch<br />\nerty.<br />\nlege.<br />\nmade first<br />\n25th<br />\nYEAR OF SERVICE<br />\noffered by the downtown down. J. Chapman gained<br />\n7. No Freshman shall wear, when<br />\nNovember 24— Thanksgiving— rates<br />\nanother<br />\non University property, any letter Washingt<br />\nbranch to out-of-town members of nine yards, byt on the<br />\nnext play Will Appear on Tuesdays and Fridays<br />\non and Lee University.<br />\ninsignia of athletic ability won at<br />\nthe Hopkins' \"Y.\"<br />\nwas thrown for a loss by Markell. in Enlarged Form. Many Positions<br />\na preparatory school.<br />\nThe City Building is excellently The visitors succeede<br />\nOpen to Editorial and Business<br />\nd in gaining<br />\nCandidates.<br />\n8. No Freshman shall walk on \"DOC\" RHODES IS STILL ON JOB equipped and contains' a splendid another first down, but<br />\nwere then<br />\nthe grass on University property: \"Doc\" Rhodes, our iodine-artist ;ymnasium and swimming pool. forced to kick to<br />\nWillis, who ran<br />\nThe NEWS-LETTER starts on its<br />\nnor shall he use the steps leading of the athletic department, attempt- The regular yearly membership is ten yards. Markell<br />\nmade a first<br />\nfrom the upper quadrangle to the ed, during the latter part of<br />\ntwenty-fifth year of uninterrupted<br />\nthe fifteen dollars, which entitles the down for Hopkins, but Spinney<br />\nsouth court.<br />\nsummer to emulate the immortal holder to all the privileges of the fumbled and Brown recovered the publication this fall. The oldest ac9. Freshmen shall 'not precede off - again - on - again - Finnegan \"Y.\" For out-of-town students a ball and ran 35<br />\n.\"<br />\nyards to Hopkins' tivity on the campus, it has ad?per classmen through doors in \"Doc\" was booked as the leading special rate of $7.50 is charged. 201yard line. The<br />\nBlack and Blue vanced in proportion to the growth<br />\nJniversitv buildings and shall en- victim in the \"reduce<br />\n-expenses\" Since the University is still without line held, however, and the ball of the University, and this<br />\nyear will<br />\nter Gilman Hall through the tun- campaign.<br />\nHe was retired in fa- a gymnasium, this offer is espe- changed hands ofter the visitors<br />\nappear<br />\nsemi-wee<br />\nnel. Seniors only may use the, main vor of the<br />\nkly<br />\nin<br />\nthe<br />\npresent<br />\nattractive<br />\n, affording the stu- failed at a drop kick. The locals'<br />\nmethod, unsuccessfully cially<br />\nsize<br />\nentrance of Gilman Hall.<br />\nand<br />\nform,<br />\nthus becoming more<br />\nattempted at other universities, of dent an excellent opportunity to luck changed here and, due to a<br />\n10. These regulations shall con- \"student trainers,\"<br />\nbut, fortunate- exercise during the cold months by bad pass, Darley was tackled for like an ordinary newspaper. This<br />\nflue in force until the end of the ly, was recalled<br />\nfollowing a wail of swimming and gymnastic work. a safety. The ball was brought out. stage was carefuly debated last<br />\nmid-year examinations, unless pre- protest from<br />\nThirty gym classes insure a suit- but Hopkins could not gain and year by<br />\nsuffering athletes.<br />\nthe Board and it was finalviously annulled by victory for the \"Doc- has been<br />\ntime for all who are interested kicked. The half ended shortly<br />\nable<br />\ntrainer at the<br />\nly<br />\ndecided that it was warranted by<br />\nFreshmen in interclass contests s in University for three years<br />\nthereafter with Mt. St. Mary's two<br />\nand - has in this phase of activity.<br />\nlie following sports: •<br />\nthe<br />\ngrowth of Hopkins, which<br />\nMr. John S. Maylott, of the Cen- points in the lead.<br />\nFootball, proved his worth on numerous occrack, basket-ball and swimming. casions. He is a licensed<br />\nshould provide news enough for<br />\nTHIRD QUARTER<br />\nchiroprac- tral Y. M. C. A., is in charge of the<br />\nCalkins kicked off over visitors' two issues a week. Under this<br />\nCopies of the constitution of the tic and has had experience in<br />\nmembersh<br />\nip<br />\nwork<br />\nwill<br />\nand<br />\nbe<br />\nglad<br />\ntrainStudent Council will be distributed ing professional athletes.<br />\nto talk to'any one interested in this goal line. McCauley and Lynch change, the Tuesday issue will be<br />\namong the Freshmen in sufficient<br />\nmade first down, but on .the next largely devoted to the sports<br />\noffer.<br />\nLast year he received several ofand<br />\ntime to permit their complying with<br />\nplay<br />\nSpinney tackled Lynch for a activities of the week-end, while the<br />\nfers from other institutions, but he<br />\nRegulation 2. Lists of the recog- chose to remain at Hopkins.<br />\nCoe—What are you thinking less. A pretty punting battle fol- Friday issue will contain general<br />\nnized actiirities will be posted in<br />\nlowed with the advantage on the information, accounts of meetings,<br />\nabout?<br />\nprominent places about the UniverEd—Just what you're thinking visitors' side, and ended by the ball all weekly happenings, and advance<br />\nSity.<br />\nWe all registered surprise when<br />\ngoing over the Hopkins' goal line. dope on Saturday's events.<br />\nabout.<br />\nwe heard that three of the faculty<br />\nCoe—If you do I'll. scream.— The play see-sawed back and forth, There are many vacancies on the<br />\nhad fallen before the onset of Dan<br />\nneither side being able to gain, when staff and a great number of<br />\nPhoe4ix.<br />\nmen<br />\nEight-o-Clocker (waking room- Cupid. Prof.<br />\nsuddenly Calkins brought the stands will be needed in both business<br />\nMastard was marand<br />\nnate)—It's ten to eight.<br />\nried during the summer io Mrs. \"What would you call a man who to its feet by recovering a fumble editorial departmen<br />\nts.<br />\nA<br />\nmeeting<br />\nSecond Eight-o-Clocker (sleep- Kirby Flower<br />\nof Chapman's and making a 67-yard for candidates will be held on<br />\nSmith, the Widow of hid behind a woman's skirts ?\"<br />\nWedy)—Wait till the odds get better. the late<br />\nProfessor of Latin at our \"I'd call him a magician.—Ban- run before being tackled by Lynch. nesday, October 5th, in the<br />\nNEWS'hen place it all.—Widow.<br />\nUniversity.<br />\nder.<br />\nHopkins was unable to gain and LETTER office, opposite the Barn.<br />\n<br />\nBlack and Blue Has Hard Time<br />\nDefeating Mt. St. Mary's<br />\n<br />\n•0,<br />\n<br />\nPr<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 4, 1921<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\nFOUNDED 1897.<br />\n<br />\nFIRST NUMBER OF BLACK<br />\nAND BLUE JAY TO APPEAR OCTOBER 15_<br />\n<br />\nSix Issues Will Be Published in Coming<br />\nYear. Many vacancies on Staff<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nto Be Filled.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n<br />\nSubscription<br />\n<br />\n$2.50<br />\n<br />\nThe Greenhorns Number of the<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBlack and Blue Jay, the initial ediBusiness communications should be addressed to the BUSINESS MAN- tion of the year, will be distribute<br />\nd<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould ,be sent to the MANAGING EDITOR.<br />\n• at the University on October 15.<br />\nThis number is dedicated to the<br />\nClass<br />\nof '23 and the Freshman will<br />\nEditor-in-Chief:<br />\nBusiness Manager:<br />\nH. DOUGLAS COTTON, '22.<br />\nfurnish the main theme.<br />\nFREDERICK W. LIPPS, '22.<br />\nAssociate Editors:<br />\nThe Greenhorn's Number has<br />\nEDWARD G. HUEY, '22.<br />\nCirculation Manager:<br />\nELI FRANK, JR., '22.<br />\nbeen in the process of preparation<br />\nGLOVER P. FALLON, '23.<br />\nJunior Editors:<br />\nduring the, summer vacation, the<br />\nCHARLES C. MARBURY, '22.<br />\nstaff<br />\npromising an interesting volLAWRENCE B. FENNEMAN, '23.<br />\nAssistant Business Managers:<br />\nROBERT K. GUGGENHEIMER, '23.<br />\nDONALD K. VANNEMAN, '23.<br />\nume. Six numbers instead of five<br />\nRICHARD M. WOOD, '22.<br />\nBERNARD C. HEARN, '23.<br />\nWILLIAM H. MOORE, '23.<br />\nwill appear during the present colJOHN C. LEWIS, '23.<br />\nJ. BRENTNALL POWELL, '23.<br />\nlegiate year.<br />\nCRAIG E. TAYLOR, '24.<br />\nFITZGERALD DUNNING, '24.<br />\nThe Jay will start on the second<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nlap of his career with the appearance of this number. The first year<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nwas a hard one for the Jay, though<br />\nfair measure of success was ata<br />\nBALTIMORE, MD., OCTOBER 4, 1921<br />\ntained. Assured at the beginning<br />\nThe host of new students which are going to get our true place in of the year with the financial reare now entering Hopkins have but athletics, and that is to have the sources, Students' Activity Fee, and<br />\nto stay here awhile and they will whole University behind the team, a respectable advertising clientele,<br />\nbe as one with us. You Freshmen, and the whole city behind the Uni- the Jay has splendid prospects for<br />\nwho are coming daily up the drive versity. The best way to do this is a successful season.<br />\nThe name and reputation of the<br />\nto register will soon catch the drift by the sale of season tickets. CirBlack<br />\nand Blue Jay has been spread<br />\nand become absorbed in the grand culars have been sent out, and it<br />\nwidecast.<br />\nThe Collegiate Adverspirit of this grander old institu- is up to us to follow them up and<br />\ntising<br />\nAgency<br />\nof'New York, which<br />\ntion. Solomon could give no bet- make the sales. A reserved seat<br />\nhandles<br />\nthe<br />\nadvertisin<br />\ng for the mater advice than that you take this ticket for all seven games played<br />\nspirit and turn it to your advantage. at Homewood costs $7.50, and the jority of college magazines in the<br />\nThat which is a benefit to you is au- Athletic Association allows a com- East, has become interested in the<br />\ntomatically helpful to the Univer- mission to those students who need Jay, so advertisements, national in<br />\nsity.<br />\nfinancial support. Let's all get be- character, should be forthcoming<br />\nhind the University, the Athletic from this source.<br />\nPlans are being formed to extend<br />\nThe greater the number of Fresh- Associatio<br />\nn, and the team. Let<br />\nthe Jay's circulation. Arrangements<br />\nmen who turn out for.athletics, the the slogan<br />\nbe \"Every student sell<br />\nwill be made to place the Jay on<br />\nbetter our tea-fits. This applies, in a season<br />\nticket,\" and thus insure<br />\nnewstands throughout -Baltimore.<br />\nlike manner, to non-athletic activ- hearty<br />\nsupport for our team.<br />\nThe alumni are being interested in<br />\nities. The older students of J. H.<br />\nU. will be doubly encouraged in<br />\nUpon returning to college, we are the magazine proposition and it is<br />\nhoped that there will be a large<br />\ntheir efforts if they find a wealth prone to look about, almost<br />\ninvolalumni subscription list.<br />\nof co-operation among the new stu- untarily,<br />\nfor the old, familiar landdents. So if there be any of you<br />\nNumerous vacancies on the edimarks. A glance is enough to show<br />\nFreshmen who can do one thing<br />\ntorial, art and business staffs have<br />\nparticularly well, let him seek out the most casual observer that im- resulted from graduation. Excela channel for this proclivity, that we provements have been effected dur- ent opportunities, then, are affordmay all help him reap the mutual ing the summer. Strolling down ed to men of ability in any of the<br />\nbenefit. You have played football, Charles Street we notice<br />\naforementioned lines. An appeal<br />\nthat the<br />\nis made to all undergraduates,<br />\nperhaps, or served on your preparpavement along the University<br />\nFreshmen in particular, to become<br />\natory school's annuals staff. Or<br />\nproperty is almost complete.<br />\ncandidates for the Jay's staff.<br />\nmaybe you pick a mandolin.<br />\nAnyway, come out for something, Entering the postoffice, we are<br />\nA signal tribute was paid _to Dr<br />\neach and every one, and let us hear almost dazzled with a sense of newFrederick<br />\nH. Baetjer, of Baltimore,<br />\nfrom you. Hopkins will accord ness. Here is the greatest work of<br />\na<br />\ndistinguis<br />\nhed alumnus of this uniyou due appreciation.<br />\nall. We have new postoffice boxes.<br />\nversity, on September 29th by the<br />\nThis is gladdening news to those American Roentgen<br />\nSEASON TICKETS<br />\nRay Society,<br />\nWhat are we doing to make Hop- of us who have had to stand in line which has been in session at the<br />\nkins athletics a success this year? for our mail. These boxes cost $1,- Hotel Washington, Washington,<br />\nThat is a question which every stu- 600, and they<br />\nare worth it, n' est ce D. C.<br />\ndent—Senior, Junior, Sophomore,<br />\nA dinner, attended by more than<br />\npas?<br />\nAnother thing, however,<br />\nand Freshman—should ask him200 prominent physicians, was<br />\nself. The Faculty, Varsity Club. which helps to give the place a given in his honor, to celebrate the<br />\nCoaches Van Orman and O'Rosiake, bright appearance is the paint. Gil- twentieth anniversary of his pracMr. Kistler—all are working to put man Hall has been practically re- tice of Roentgenology.<br />\nHopkins on the map in athletic3. painted in the inside.<br />\nDr. Baetjer is described as one<br />\nof<br />\nWhat are we doing? Out of probthe heroes of science. He was<br />\nIn addition to this, the physical<br />\nably six hundred students there are nd engineering<br />\nborn in Baltimore in 1874. He relibraries have been<br />\nfifty men out for the team this :onsolidated for<br />\nceived his A. B. from the Johns<br />\nthe convenience of<br />\nfall. They are doing all they can the students.<br />\nHopkins University in 1897, and<br />\nto produce a winning team and<br />\nA model of the prospective and was graduated from the Medical<br />\nmake a name for Hopkins. How present<br />\nbuildings at Homewood is School in 1901. He is professor of<br />\nabout the rest of us? We can't all nearing<br />\ncompletion in the loft at Roentgenology in the school. Durplay football; what can we do? The<br />\nGilman Hall and will probably be ing the war he served as a major<br />\nanswer is—sell season tickets. Every exhibited<br />\nin the Gilman Memorial in the Medical Corps of the A. E. F.<br />\nstudent at Hopkins can sell at least Room.<br />\nAt one time he was president of the<br />\none season ticket. Many of us can \"The old<br />\nsociety which\" honored him.<br />\norder changeth.\"<br />\nsell a great many more. If we do<br />\nIn the study and use of the Xnot do it, it is because we have not<br />\nRay, more dangerous in years past<br />\nIMPORTANT<br />\ngot the advancement of Hopkins<br />\nAll students must take post office than now, he has been one of the<br />\nat heart. Is it fair to expect a few<br />\nleaders and is called one of the old<br />\nboxes in order to receive Univermen to do what the whole student<br />\nguard. Many of his earlier assobody should be doing? We all want sity notices and the advantages of ciates have paid with their lives for<br />\nHopkins to rise in athletics; we all the Non-Athletic fee.<br />\ntheir investigations, and Dr. Baetwant her to rank with the other<br />\njer, although still a young man and<br />\nSENIOR CLASS<br />\ncoljeges of her size in the East.<br />\nof unusual vitality, has undergone<br />\nMeeting for election of officers, several operations<br />\nBut are we willing to work to acto correct the<br />\nC. E. Hall, Friday, October 7, at ills suffered in the course of<br />\ncomplish this?<br />\nhis<br />\nThere is only one way that we 12:30.<br />\nwork.<br />\nTelephone<br />\n<br />\nHomewood 100<br />\n<br />\nthe Johns- Hopkins<br />\nUniversity<br />\n<br />\nPre<br />\necre<br />\ners,<br />\n<br />\nnect<br />\n<br />\nForty-Sixth Year of Instruction<br />\n1921-1922<br />\nINSTRUCTION<br />\nGRADUATE SCHOOL OF ARTS AND SCIENCES.<br />\nDegrees: Master of Arts, Doctor of Philosophy.<br />\nMEDICAL SCHOOL DEGREE. Doctor of Medicine;<br />\ncourses for physicians.<br />\nCOLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nSCHOOL OF ENGINEERING. Degrees: Doctor0_<br />\nf<br />\nEngineering; Master of Engineering; Bachelor of<br />\nEngineering; Bachelor of Science in Chemistry.<br />\nSCHOOL OF' HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Public Health; Doctor of Science<br />\nand Bachelor of Science in Hygiene; Certificate in<br />\nPublic Health.<br />\nCOLLEGE COURSES FOR TEACHERS. Degree of<br />\nBachelor of Science.<br />\nSUMMER COURSES. Accepted for degrees of Master<br />\nof Arts, Bachelor of Arts or of Science. Also for<br />\ngraduates in Medicine.<br />\nEVENING COURSES in Business Economics and for<br />\nTechnical Workers.<br />\nJohns Hopkins Press Publications.<br />\nSTATE BUREAUS: Geological Survey; Weather Service; Forestry.<br />\n<br />\nPre<br />\n'ecre<br />\n<br />\nobei<br />\nned<br />\nonai<br />\n<br />\ndwa<br />\n<br />\nPre<br />\necre<br />\n<br />\nVAR<br />\n<br />\nChu<br />\necre<br />\n<br />\nCal<br />\n<br />\n1. Pi<br />\n<br />\nCa)<br />\n<br />\nYana<br />\n<br />\nCal<br />\n<br />\nVana<br />\n<br />\nCa)<br />\n<br />\n• Bi<br />\n<br />\nCa)<br />\n<br />\nhavic<br />\n<br />\nCa)<br />\n<br />\nBUILDINGS<br />\nGILMAN HALL—general library, class rooms, biology, administration.<br />\nMECHANICAL AND ELECTRICAL ENGINEERING=<br />\nhousing, also Physics and College Chemistry.<br />\nCIVIL ENGINEERING—housing also Geology.<br />\nPOWER HOUSE.<br />\nBOTANY AND PLANT PHYSIOLOGY—with Greenhouse<br />\nand Botanical Garden.<br />\nCHEMICAL LABORATORY—for graduate work.<br />\nPHYSIOLOGICAL BUILDING.<br />\nANATOMICAL LABORATORY.<br />\nHUNTERIAN LABORATORIES.<br />\nPATHOLOGICAL LABORATORY.<br />\nSCHOOL OF HYGIENE AND PUBLIC HEALTH.<br />\nCARROLL MANSION—Johns Hopkins Club.<br />\nSTUDENT ACTIVITIES BUILDING.<br />\n<br />\nbuf<br />\n<br />\nCal<br />\n<br />\nEd<br />\nCott°<br />\ncrick<br />\nEd<br />\n<br />\nkins<br />\nG. H<br />\nEd<br />\n<br />\nPenn<br />\npouf<br />\nEa<br />\niness<br />\n<br />\nman.<br />\n<br />\n\"WhoWasJohn Hancock?\"<br />\n<br />\nRusi<br />\n<br />\nasked Thomas A. Edison in his<br />\nEmployment Questionnaire<br />\nSecr<br />\n<br />\nWe will pay One<br />\nHundred Dollars<br />\n($100)forthe best<br />\nanswerto Mr.Edison's question.<br />\nCompetition closes November 15, 1921<br />\nADDRESS<br />\n<br />\nDEPARTMENT OF PUBLICITY<br />\n<br />\nreta<br />\n<br />\nSec'<br />\nSec;<br />\nsistc<br />\nWy<br />\n12<br />\nfror<br />\nabn<br />\ncon,<br />\nV‘Th<br />\nwas<br />\nMa:<br />\nhe<br />\nspe]<br />\nenn<br />\n<br />\nAL<br />\n<br />\nLIFE INSURANCE COMPANY<br />\nOF BOSTON. MASSACHUSETTS<br />\n<br />\nden<br />\n<br />\nfro i<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 4, 1921<br />\n<br />\n3<br />\n<br />\nTwo Hopkins men, Dr. George<br />\nPromotions—Mr. Harry W. WaMt. Vernon 4999<br />\nE. Barnett and Dr. Leo Wolman, terfall, Associate Professor of MeORTMAN'S<br />\nwere honored this summer by be- chanical Engineering. Dr. Francis ''Queen Quality\" Home Made Chocolates<br />\ning selected as members of the ad- D. Murnaghan, Associate Professor<br />\nVISIT OUR ICE CREAM PARLORS<br />\n1921-1922<br />\nvisory council to the Unemployment in Mathematics. Mr. J. Trueman<br />\n518 N. CHARLES STREET<br />\nCommercial Photography<br />\nOMICRON DELTA KAPPA<br />\nConference.<br />\nThompson, Associate Professor in<br />\nPresident, Joseph C. Thompson; Dr. Barnett is a member of the Civil Engineering. .<br />\nCircuit Photography<br />\necretary, Robert C. Hall; Mein- faculty of this University, as ProFlash Lights<br />\nViews<br />\nAdditions—Dr. George Boas, Asers, Douglas Cotton, Andrew fessor of Statistics. Dr. Wolman, sociate in Philosophy. Mr. F. D.<br />\nCharles and 22nd Sts.<br />\nGroups<br />\nEnlargements<br />\nnecht, Davidge Rowland.<br />\nKODAK FINISHING<br />\nwho was formerly associated with Broons, Associate in Education. Dr. Delicious Sodas and Sundaes<br />\nThe Best of Candies<br />\nSTUDENT COUNCIL<br />\nJohns Hopkins, is now Professor in C. A. Nelson, Associate in Mathe325 N. Howard St.<br />\nPrompt & Efficient Service<br />\nPresident, Richard M. Wood; the Department of Social Science matics. Dr.. Ralph C. Williams,<br />\necretary, Gilson Engel; Seniers, at New York University.<br />\nAssociate in Romance Languages.<br />\n,obert Hall, Gilson Engel, Andrew<br />\nThe Advisory Council, which was Mr. Schachone Isaacs, Instructor<br />\nnecht ; Juniors, John Marchant, picked by Secretary of Commerce in Psychology. Mr. J. Earle Uhler,<br />\n1 W. University Parkway<br />\nST. PAUL & 24th STS.<br />\nonald Vanneman ; Sophomores, Herbert C. Hoover, is composed of Instructor in English. Mr. Francis<br />\nOpposite J. H. U. Athletic Field<br />\nC. D. Wolfe, Prop.<br />\ndward Morrison.<br />\ntwenty-five of the leading econo- Ludlow, Student-Assistant in EngDRUG STORE for J. H. U. BOYS<br />\nATHLETIC BOARD<br />\nDELICIOUS SODAS & SUNDAES<br />\nmist of the country. They were se- lish.<br />\nPHONE, HOMEWOOD 2121<br />\nMade With<br />\nPresident, Andrew H. Knecht; lected as specialists to advise the<br />\nSpecial<br />\nCream<br />\nIce<br />\nJersey<br />\nNOTICE<br />\necretary, S. Atherton Middleton. conference in easing the unemploy\"The Velvet Finish\"<br />\nMeeting of candidates for EdiVARSITY SEAL VOTING COUNCIL ment situation in the country.<br />\nBuy an (H) Pipe made special<br />\ntorial and Business Board of NEWS- KODAKS CAMERAS SUPPLIES<br />\nChairman, H. Douglas Cotton;<br />\nfor the Boys<br />\nLETTER, Wednesday, October 5th, Whitman's Chocolates and Bon Bons<br />\necretary, Frederick W. Lipps.<br />\nFOOTBALL PROMOTIONS AND ADDITIONS in NEWS-LETTER office, opposite<br />\nORDERS RECEIVED FOR<br />\nTO FACULTY<br />\nManager,<br />\nAthletic Office in Barn.<br />\nCaptain,<br />\nCOGGINS'<br />\nMeeting of Varsity Seal Voting \"Why do they call that car RegThe followig promotions and ad-1. Pierce Brawner.<br />\nTransfer<br />\nand Baggage Express<br />\nLACROSSE<br />\nditions have been made on the fac- Council, Thursday, October 6, in ulator ?\"<br />\nAUTOMOBILE SERVICE<br />\nRoom 112, G. H.<br />\n\"All other cars go by it.\"—.Frivol. PHONE, HOMEWOOD 2645-W<br />\nCaptain, Joseph Zoller Manager, ulty for the coming year:<br />\noward Hensel.<br />\nBASEBALL<br />\nCaptain, Andrew H. Knecht:<br />\nanager, Edward G. Huey.<br />\nTRACK<br />\nCaptain, Joseph C. Thompson;<br />\nana.ger, William R. Fortney.<br />\nBASKETBALI,<br />\n• Manager,<br />\nCaptain,<br />\n.1- Brentnall Powell.<br />\nSWIMMING<br />\n1<br />\nCaptain, Paul Buhrer ; Manager,<br />\nhavidge Rowland.<br />\nTENNIS,<br />\nCaptain and Manager, Wilson<br />\nDuffy.<br />\nCROSS COUNTRY TEAM<br />\nCaptain, W. H. Somerville.<br />\nNEWS-LETTER<br />\nThe man whose courage and foresight<br />\n' Editor-in-Chief — H. Douglas<br />\ngave alternating current to America,<br />\nCotton; Business Manager, Fredand founded the Westinghouse industries.<br />\nerick W. Lipps.<br />\nHULLABALOO<br />\nEditor-in-Chief, R. Dorsey Watkins; Business Manager, Edward<br />\nG. Huey.<br />\n• Black and Blue Jay<br />\nEditor-in-Chief, Lawrence B.<br />\nrenneman ; Business Manager, H.<br />\nDouglas Cotton.<br />\nThirty years ago the alternating current<br />\ntuned to prevent the use of the \"deadly<br />\nsystem was but an infant, for whose life those<br />\nDAILY BULLETIN<br />\nWestinghouse Current,\" as many extremists<br />\nwho believed in it were fighting daily and<br />\n. Editor, H. Douglas Cotton; Busdescribed it.<br />\nnightly battles; today this same system is a<br />\nlness Manager, Donald K. VanneThat the little 50 horsepower generators of<br />\ngiant of almost inconceivable size, so capable<br />\nMan.<br />\nthose days have grown to sizes two thousand<br />\nof defending itself that no one seeks to attack<br />\ntimes as large; that stations of a few horseDRAMATIC CLUB<br />\nit. For 95% of the electricity that is generpower have been succeeded by stations with<br />\nPresident—Gilson Engel; Secreated and transmitted today is alternating<br />\ncapacity of hundreds of thousands of horsea<br />\ntary, Eli Frank, Jr.<br />\ncurrent.<br />\npower, while at the same time, distribution<br />\nMUSICAL CLUB<br />\nThe story of the development of alternating<br />\nvoltages have grown from 1,000 to 220,000,<br />\nPresidenit, R. Waldo Hambleton ;<br />\ncurrent is a story of courage and vision and<br />\nis due largely to the vision and the courage of<br />\nBusiness Manager, Hugh Smallfaith; of misunderstanding and misrepresenGeorge Westinghouse, and to the qualities<br />\nwood.<br />\ntation; of engineering failures and triumphs;<br />\nof the engineers whom he called, characterof commercial ability and organization. It<br />\nistically, to help him. By no means the least<br />\nBAND<br />\nreads<br />\nlike<br />\nclassic<br />\na<br />\nromance.<br />\nIn<br />\nchapters<br />\nits<br />\nof the achievements of this man was his<br />\nDirector, Emil Smith.<br />\ncredit<br />\nare<br />\nand<br />\nhonor<br />\nfor<br />\nability to organize the greatest aggregation of<br />\nwho<br />\nall<br />\nhave<br />\ndeserved<br />\nDEBATING COUNCIL<br />\nit, but the central figure, the man whose<br />\nengineering intelligence ever known, men of<br />\nPresident, R. Dorsey Watkins;<br />\nmotives and acts furnished the basis of the<br />\nanalytical ability, consummate mathemaSecretary, Lawrence B. Fenneman.<br />\nplot, was George Westinghouse, the founder<br />\nticians, great inventors; and to promote in<br />\nINTERFRATERNITY BOARD<br />\nof the Westinghouse Industries.<br />\nthis great group the most harmonious and<br />\nPresident, Gilson E. Engel; Secintelligent co-operation.<br />\nWhen, in 1886, he brought over from<br />\nretary, Richard M. Wood.<br />\nEurope the crude Gaulard and Gibbs system,<br />\nThe same energy and courage and purpose<br />\nY. M. C. A.<br />\neven he, great as was his foresight, did not<br />\nthat forced the acceptance of the air brake,<br />\nPresident, Leroy Baughman;<br />\ndream of the coming magnitude of the idea<br />\nthe modern systems for the economic and safe<br />\nwhich he was fostering. The development<br />\ndistribution of natural gas, and later of the<br />\nSecretary, Paul Stevens; General<br />\nwork undertaken by the strong engineers<br />\nsteam turbine,led and won the fight for alterSecretary, Charles S. Sydnor ; Aswhom he put to work led at first into many<br />\nnating current, which has grown to be one of<br />\nsistant General Secretary, Vertrees<br />\nserious differences with those who favored<br />\nworld's greatest and most necessary<br />\nthe<br />\nWyckoff.<br />\ndirect current. Legislatures were even imporcommodities.<br />\n<br />\nWho's Who at J. H. U.<br />\n<br />\nW.L. Mann<br />\n<br />\nChelsea Pharmacy<br />\n<br />\nThe College Drug Store R. G. by & Company<br />\n<br />\nGeorge Westinghouse<br />\n<br />\nFACULTY NOTES<br />\n<br />\nDr. Goodnow returned yesterday<br />\nfrom an extensive trip abroad.<br />\nProf. Hollander, who went<br />\nabroad to study social and economic<br />\nconditions, returned some time ago.<br />\nWhile in England Prof. Hollander<br />\nwas established in a house at<br />\nMaidenhead-on-the-Thames.<br />\nLater<br />\nhe went to the continent, where he<br />\nVent some time in Paris and Vienna.<br />\nProfessors Willoughby and Vincent are among those of our faculty who 'have recently returned<br />\nfrom travels abroad.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LET TER, OCTOBER 4, 1921<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n<br />\n0. T. C. UNIT IS<br />\nPLACED ON DISTINGUISHED<br />\nLIST<br />\n<br />\nHOPKINS R.<br />\n<br />\n(THE BOOK MART)<br />\nComplete Stock of •<br />\nMedical Books and College<br />\nRequisites<br />\n<br />\nIt's time for a<br />\nV0<br />\n<br />\nFALL SUIT<br />\n<br />\nWar Dept. Inspector's Report Does<br />\nCredit to Local Unit and Major<br />\nGarey. Comment by Major<br />\nCarey Himself.<br />\n<br />\ns)`<br />\n<br />\nWe're ready<br />\n$30 up<br />\n<br />\nImporters and Dealers in Fine Books<br />\n301 N. CHARLES ST.<br />\n<br />\nBaltimore, Md.<br />\n<br />\ne)<br />\nfieXatteri<br />\nLti<br />\nH.& OSCAR G.1--‘11(<br />\nOWN ER%<br />\n'<br />\n1411)E*1.140e14 OP<br />\n29 Baltimore St., East<br />\n<br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands.<br />\n(Greek Letter Societies)<br />\nThe Chas. Willms Surgical<br />\nInstrument Co.<br />\n<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br />\n<br />\nJ. H. Furst & Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br />\n<br />\nThe Johns Hopkins unit of the<br />\nR. 0. T. C. was highly commended by Major E. H. Metzger<br />\nin his report of an inspection made<br />\nlast May of the local organization.<br />\nThe high standing of the Hopkins<br />\nunit reflects much deserved credit upon Major Garey and his assistants. Major Metzger ended his<br />\ndetailed report by saying:<br />\n\"This unit is considered by me<br />\nto be a model unit. Major Garey<br />\nis deserving of the highest praise<br />\nand commendation of the success<br />\nattained by his unit at this university. I strongly recommend<br />\nthat this college be given the rating of 'Distinguished College.'<br />\nSuch a rating is clearly deserved.\"<br />\nSuch comments as these are fi-equent in the report. They are typical of the enthusiasm expressed<br />\nby Major Metzger. He speaks of<br />\nthe loyalty and the high caliber of<br />\nmen enrolled in the R. 0. T. C.<br />\nAccording to the report, all were<br />\nextremely enthusiastic and full of<br />\npraise for the army personnel on<br />\nduty there. The interest in the R.<br />\n0. T. C. at Johns Hopkins is exceedingly high. The appearance of<br />\nthe unit as a whole could not have<br />\nbeen better.\"<br />\n<br />\nF<br />\nMINA.<br />\n<br />\ninte<br />\n<br />\ngiv<br />\nFri,<br />\nbe<br />\nans<br />\nthe<br />\nC.<br />\ngra<br />\nsic<br />\nStt<br />\nof<br />\nwh<br />\naft<br />\nA.<br />\npr(<br />\nLa<br />\ner<br />\nta<br />\nTI<br />\nci<br />\nC(<br />\nte<br />\nto<br />\nar<br />\nB,<br />\nlyj<br />\nrc<br />\nsr<br />\n<br />\n5he apex<br />\ninfasluonable<br />\nneckzaear<br />\n<br />\nWelcome!<br />\nThe Quality Shop extends a hearty welcome<br />\nto our old friends<br />\namong the upper classmen at Hopkins!<br />\nAnd to the new class,—<br />\nwhom we hope to make<br />\nour friends we extend a<br />\ncordial invitation to<br />\nvisit a real men's store.<br />\nGood clothing, hats,<br />\nshoes. furnishings,—at<br />\nmoderate prices.<br />\nTHE<br />\n<br />\ne,ev<br />\n<br />\nFRi<br />\n<br />\nCLOTHES<br />\n211-213 E. Baltimore St.<br />\nOur -prep\" room on the<br />\n<br />\nthird floor specializes in<br />\nclothes for young men.<br />\n<br />\nS<br />\n<br />\nIlle<br />\n<br />\nUALITY HOP<br />\n<br />\nCollar Hug Clothes<br />\nBaltimore and Liberp,Streets<br />\n<br />\nI •111111111•111111•111M•111<br />\nJ111111111•11•1111111•WIll<br />\n<br />\nHub<br />\n<br />\nBaltimore. Charles and Fayette<br />\n<br />\nURNER'S<br />\n<br />\nYoung Men's Clothing<br />\nand Furnishings<br />\n<br />\nfervid approval last year and imMEN'S SHOES<br />\nAre made a special feature o<br />\nproved the attendance 1,000 per cent<br />\nOf the Better Class<br />\nThe Johns Hopkins Debating will be continued this year. Other<br />\nhere.<br />\nCouncil is negotiating to renew the. means of causing interest in deagreement for the triangular debate bates are being prepared, but as yet<br />\nGive us a call and let us becom<br />\nbetween the Johns Hopkins Uni- are not ready for publication. The<br />\nbetter acquainted for mutual<br />\nURNER BROTHERS<br />\nversity, Washington and Lee, and Debating Council will meet early<br />\nbenefit.<br />\n111 E. BALTIMORE STREET<br />\nthe University of North Carolina, in the year to arrange the proBALTIMORE<br />\nthe<br />\nin<br />\n()Tam.<br />\nwhich is generally staged<br />\nspring of the year.<br />\nOld Maid—Help! Police! Stop \"What is the psychological moPlans are being made fo arouse<br />\nment?\"<br />\na keener interest in debating at him! He tried to flirt with me..<br />\nCop—Calm yourself, lady, there's \"Waking up just as the prof. calls<br />\nHomewood. The jazz feature of<br />\nHoward at Lexington<br />\nyour name.\"—Punch Bowl.<br />\nthe debates which met with such plenty more.—Siren.<br />\nDEBATING COUNCIL TO RENEW<br />\n<br />\nti<br />\nIT<br />\nIi<br />\nti<br />\n<br />\nfi<br />\n<br />\nTEWART&G,<br />\nIS'WI Jam.Ilf.LCrier0 41!<br />\n<br />\nNM Tort<br />\n<br />\nHOPKINS SONGS<br />\nOUR ALMA MATER IN DIXIE LAND For we are the glory and the halo.<br />\n<br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS<br />\n<br />\nHess Shoes<br />\nTeach a Lesson in Style<br />\n<br />\nThey possess the \"dash\" that<br />\nappeals to college men, toned<br />\ndown to distinctiveness. And<br />\nwearing qualities that provoke<br />\nenthusiasm.<br />\nN. HESS' SONS<br />\n<br />\n8 E. BALTIMORE ST.<br />\n<br />\nCome stand together, we'll raise a<br />\ncheer and wave the Black and<br />\nBlue;<br />\nWe pledge our faith as loyal sons,<br />\nto Hopkins we'll be true,<br />\nWe love our college in Dixie Land,<br />\nour university.<br />\nWe shout her praise as we march<br />\nalong, so one, two, three!<br />\nCHORUS<br />\n<br />\nHurrah! Hurray!<br />\nA rousing Hullabaloo! Rah!<br />\nOur Alma Mater in Dixie Land,<br />\nHurrah for Black and Blue!<br />\n<br />\nSHOES<br />\n<br />\nThe Hopkins men on the football<br />\nfield have won a great renown;<br />\nThey buck the center, and buck the<br />\nends, and pull their opponents<br />\ndown.<br />\nAnd if their bodies are black and<br />\nblue, they're loyal, don't you<br />\nsee.<br />\nThey carry their colors where'er<br />\nthey go, so one, two, three!<br />\nCHORUS—Hurrah! Hurray! Etc.<br />\n<br />\nfor<br />\n<br />\nON THE LINE<br />\n<br />\nLEMMERT<br />\nMADE TO ORDER<br />\nAND<br />\nFINISHED CLOTHES<br />\nPLAZA BUILDING<br />\n<br />\n19 and 21 EAST FAYETTE ST.<br />\n<br />\nOn the line, on the line, on the side<br />\nUNIVERSITY MEN<br />\nof the line<br />\nFor Sport Wear<br />\nFor Dress<br />\nWe're yelling for the 'leven in the<br />\nSmart Styles—Best Leathers<br />\nrain and shine<br />\nModerate Prices<br />\nWhen the leven's in the rain, we're<br />\nyelling all the time<br />\nWhen we're out on the side of the<br />\nline.<br />\n8-19 W. LEXINGTON ST.<br />\n<br />\nWYMAN<br />\n<br />\nCOME, SENIORS, WISE AND<br />\n<br />\nGRAVEYARD<br />\n<br />\nLEARNED!<br />\n<br />\nOh where, oh where, are the Sol<br />\ndier boys?<br />\n, Oh where, oh where, can they be?<br />\nThey came up here with their football team,<br />\nOh where, oh where, can they be?<br />\nWhere's old St. John's? (Loud)<br />\nDown in the graveyard,<br />\nHear the mournful sound,<br />\nAll the Soldier boys are weeping,<br />\nTheir team's in the cold, cold,<br />\nground.<br />\nAh—men!<br />\n<br />\ntoo,<br />\nThe pride of the women and the Come, Seniors, wise and learned,<br />\nCome, Juniors, raise a cheer.<br />\nJ. H. U.<br />\nSophies, bold and cruel,<br />\nCome,<br />\nThe pride of the women and the<br />\nFreshmen, have no fear:<br />\nCome,<br />\nJ. H. U.<br />\nye college classes,<br />\nall<br />\nCome<br />\nCombined in one big Hullabaloo.<br />\nCome, join with voices true,<br />\nOn the line, on the line, etc.<br />\nSing praise to dear old Hopkins,<br />\nHurrah for Black and Blue.<br />\nJOHNNY HOPKINS<br />\nCHORUS<br />\nJohnny Hopkins, on to victory,<br />\nRah ! for the Black, boys!<br />\nJohnny Hopkins, play the game,<br />\n- Rah! for the Blue, boys!<br />\nJohnny Hopkins, fight the battle,<br />\nRah! for Johnny Hopkins, rah!<br />\nWinning name and fame.<br />\nJohnny Hopkins, we're all with you, We'll pour forth our praise to dear,<br />\nofd Johns Hopkins.<br />\nFighting, plunging, onward down<br />\nRah, for Johnny Hopkins, rah!<br />\nthe field toward the goal,<br />\nIts the same old line, the same old<br />\nThe four bright years of college,<br />\nteam,<br />\nThe shortest years of life,<br />\nIf we win you'll hear the eagle<br />\nThe years so full of gladness,<br />\nscream,<br />\nThe years with pleasure rife, Cheer and cheer again for Johnny Are<br />\ngliding swiftly by, boys,<br />\nHopkins.<br />\nOur work will soon be through.<br />\nThen oft we will recall, boys,<br />\nSAND IN OUR MAKEUP<br />\nThe years 'neath Black and Blue.<br />\nWe've got sand in our makeup,<br />\nCH0.—Rah! for the Black, boys,<br />\nAnd hair on our chests,<br />\netc.<br />\nIf we don't beat old St. John's,<br />\neat- our coats and vests.<br />\nTO WIN! TO WIN!<br />\nSo! Come out to Homewood,'<br />\nto win,<br />\nwin,<br />\nTo<br />\nAnd see Johns Hopkins play,<br />\nlike Hell to win!<br />\nlike<br />\nWe'll beat them, beat them, beat You'd<br />\nBut you'll have to wait 'till the moon<br />\nthem,<br />\nturns green,<br />\nAny old day. Hurray!<br />\nAnd the brass bands plays \"God<br />\nA chair for one is holding two,<br />\nShave the Dean.'<br />\nHeigh-lo! Heigh-lay!<br />\nIt could not hold another;<br />\nIt's plain as A, B, C,<br />\nBut suddenly it holds but one,<br />\nYou think it broke? No—Mother. If anybody's going to win today,<br />\nIt's We! We! We!<br />\n—Banter.<br />\n<br />\nEverybody bets on Hopkins,<br />\nGee how rich we'll be,<br />\nFounding public libraries,<br />\nLike Andrew Carnegie.<br />\nSo! Whats the use of betting,<br />\nAgainst the Black and Blue.<br />\nThe poor-house it is flooded,<br />\nBut there's room for you.<br />\nYou damned old Bankrupt<br />\n(Loud).<br />\nHoo! Wah! Hoo!<br />\nHoo! Wah! Hoo!<br />\nHoo! Hoo!<br />\nJ. H. U.<br />\n<br />\nFirst Prof.—Well, how were<br />\nyour examinations?<br />\nSecond Prof.—A complete success. Everybody flunked.—Dirge.<br />\nLandylady—What part of the<br />\nchicken do you wish?<br />\nBoarder—Some of the meat,<br />\nplease.—Sun Dial.<br />\n<br />\n1<br />\n<br />\n\f", "format": "basic_html", "processed": "iii<br />\nVOL. XXVI. No. 1<br /><br />\nBALTIMORE, MD., OCTOBER 4, 1921<br /><br />\nPRICE 5 CENTS<br /><br />\nALL FRESHMEN MUST PAR- VARSITY SEAL COUNCIL TO MEET Y. M. C. A. RECEPTION TO BE<br />\nTHURSDAY<br />\nTICIPATE IN SOME<br />\nHELD FRIDAY NIGHT<br />\nAn important meeting of the VarCOLLEGE ACTIVITY<br />\nsity Seal Voting Council will be held Many Interesting Speakers on Program.<br />\nNew Ruling of Student Council to This on Thursday, October 6, at 12:30,<br />\nAll Freshmen Must Be Present.<br />\nEffect. Other Freshmen Regulain Room 112. At this meeting,<br />\ntions Practically Unchanged.<br />\nThe annual Y. M. C. A. recep- Hopkins Wins After Mountaineers Score. Interesting Game<br />\nplans for the accounting and disWith few exceptions, the Fresh- bursement of all moneys collected tion to the Freshman class will be<br />\nThroughout. Student Band Furnished Music During<br />\nmen regulations for 1921-22 are the by the activities represented on the held Friday at. 8 P. M., in the Civil<br />\nand Before Game.<br />\nsame as last year's, the most im- Council will be discussed All rep- Engineering Hall. The purpose of<br />\n.<br />\nportant change being the introduc- resentatives must be present and the reception is to introduce the<br />\nIn a hard-fought and evenly-played game, Saturday, the team from<br />\ntion of a regulation requiring every must be ready to give a complete Freshmen to college life.<br />\nJohnny<br />\nHopkins triumphed over Mt. St. Mary's College, of EmmitsFreshman to take part in some col- account of the financial condition<br />\nThe prOgram, as announced by burg, by the score of 3 to 2. This serves to indicate how interesti<br />\nng the<br />\nlege activity. It is hoped that this of their respective activities.<br />\nDr. the Y. M. C. A., includes several game was from whistle to curtain. The Emmitsburg lads slightly outrule will provide a greater amount John C. French and John T.<br />\nMey- prominent and interesting speakers. weighed their hosts and the locals had a hard time for a while, but finally<br />\nof material for the various activ- ers will also be present.<br />\nDean Latane, Mr. Eugene Lever- got the long end of the score. In the first quarter Hopkins<br />\nbested the<br />\nities and at the same time give the<br />\ning, of the .Board of Trustees Dr. Collegians on every side, but after that both sides failed to gain<br />\nconmen a chance to help the UniverFrench and Mr. Morris, secretary sistently, although Van Orman's men made six first downs<br />\nto<br />\nthe<br />\nvissity and cause them to take an ac- PART OF DOWN-TOWN PROPERTY of the Central<br />\nY. M. C. A., will itors' five. Perhaps the Chapman brothers and McCauley played the<br />\nSOLD<br />\ntive interest in Hopkins affairs.<br />\nspeak on subjects related to their best game for Mt. St. Mary's, while Calkins, Middleton, Spinney<br />\nand<br />\nThe old group of buildings south<br />\nFreshmen who:go out for aCtivrespective offices or positions. Dr. Darley showed up for the locals. Calkins' 65-yard run was<br />\nthe feature<br />\nities or who present to the Student of Druid Hill Avenue, comprising Schwartz<br />\nwill speak on the relation and the only breakaway from straight football, while the J. Chapman<br />\nCouncil a satisfactory excuse for the Hopkins Hall, the Chemical of the<br />\nstudent<br />\nto the church. J. Barrett combination completed several passes for the visitors.<br />\nLaborato<br />\nBiologica<br />\nry,<br />\nthe<br />\nLaboral<br />\nnot doing so will be given distincThompson will represent the OmiToo much praise cannot be given the student band which was present<br />\ntive buttons. Those who do not tory, and the former main build- cron Delta<br />\nhonorary frater- and furnished excellent music, considering their lack of preparation, durKappa,<br />\nhave these buttons at the end of ing, has been sold by the Univer- nity;<br />\nRichard Wood, the Student ing and before the game.<br />\ntwo weeks will be -violating the sity for the sum of $400,000.<br />\nCouncil; Andrew Knechf, the AthGAME, PLAY BY PLAY<br />\nCalkins was forced to drop kick,<br />\nit was stipulated at the time of<br />\nFreshmen regulations and will be<br />\netic Association; Douglas Cotton, Knecht received the kick off and successfuly placing the<br />\npurchase<br />\nball between<br />\nthe<br />\nthat<br />\nthe University<br />\ntreated accordingly.<br />\nhe Varsity Seal Voting Council, an five yards. Hopkins failed to the goal posts for<br />\nwould<br />\nwhat<br />\nbe<br />\nallowed the use of the Biproved to<br />\nThe regulations are as follows:<br />\n.nd Gilson Engel, the Interfraterni- gain a first down and Marken be the winning<br />\npoint.<br />\n1. Within two weeks after the be- ological and Chemical Laboratories y Board.<br />\nThe speeches will be in- kicked. Mt. St. Mary's also failed<br />\nHopkins kicked off and Middleginning of the ,college year every for a period of two years.<br />\ntersperse<br />\ngain<br />\nto<br />\nand<br />\nwith<br />\nd<br />\nmusic<br />\nkicked<br />\nDarley,<br />\nfurnished<br />\nwho<br />\nto<br />\nby<br />\nton<br />\nnailed Lynch just as the quarter<br />\nAt the end of this time it is hoped<br />\nFreshman must be actively particithe University Quartette and Jazz ran 18 yards. Hopkins was again ended.. The fourth<br />\nquarter was<br />\npating in some recognized college that the School of Hygiene will be<br />\nOrchestra. Refreshments will be forced to kick to Lynch, `who was .comparatively<br />\nuninteresting, neither<br />\nactivity or must present to the Stu- installed in its new home—a gift<br />\nserved after the speeches.<br />\nnailed by Middleton, with a pretty side being able to make<br />\nconsistent<br />\ndent Council a reasonable excuse of the Rockefeller Foundation—adLest<br />\ntackle.<br />\nThe visitors failed to gain gains, and few thrills being<br />\nthere<br />\nany<br />\nbe<br />\nmisunder<br />\nstandjoining<br />\nthe<br />\nJohns<br />\nHopkins<br />\ngiven<br />\nHosfor not doing so.<br />\ning, the Student Council wishes to by plunging or end runs, and the the spectators, and the<br />\npital,<br />\nand<br />\ngame<br />\nthat<br />\nended<br />\nthe<br />\nChemical<br />\nnew<br />\n2. Freshmen shall at once learn<br />\nmnounce that the tfaditional Fresh- ball went over on their 32-yard line. just after Calkins intercept<br />\ned a forLe University songs and yells Laboratory will be completed at<br />\nman-Sop<br />\nhomore \"scrap\" will not be Mt. St. Mary's was penalized five ward pass and the ball was<br />\nomewood<br />\n.<br />\non Mt.<br />\n. ound in the<br />\nM. C. A. hand book<br />\ninterfered with, but that it must not yards for offside, Willis' off tackle St. Marrs 20-yard line.<br />\nand shall read the constitution of<br />\nstart until the Council gives the sig- plunge and a pass from Parley- to Lineup:<br />\nthe Student Council. They shall<br />\nJOHNS HOPKINS UNIVERSITY<br />\nial. Every underclassman must re- Brown failed to bring the necesHOPKINS<br />\nMT. ST. MARY'S<br />\nbe familiar with these by the time FOOTBALL TEAM, SEASON 1921<br />\nBrown 1<br />\nmain in the hall until the refresh- sary ten yards. Willis broke through 211 Middleton L E<br />\nWesterman . L.T . .. Lockwood 2<br />\nof the organization- of the class:\\A games pla ecl at I I omewood ments are served<br />\nand downed J. ChaPnian for a loss. 13 Magill<br />\nand<br />\nCouncil<br />\nthe<br />\nL<br />\nG.<br />\n.<br />\n.<br />\n.H<br />\nMorey 3<br />\n3. Freshmen shall not wear hats except where noted.<br />\nC....Gable (c) 4<br />\n;ives the signal. All freshmen are Chapman punted. Markell gained 318 Crc.mwell....0<br />\nLandy......R.G....D. Morey 5<br />\ninside the University buildings.<br />\nOctober 1—Mt. St. AI ctry's Col- !. xpected to be present.<br />\nseven yards and Willis made first 4 Knecht.....R.T..T. Chapman 6<br />\n4. No Freshman shall smoke nor lege.<br />\nR E •<br />\n.Feverall 7<br />\ndown for Hopkins. The visitors 11 Rich<br />\n6 Darley<br />\nhave his hands in his pockets while<br />\nQ B<br />\nLynch 8<br />\nOctober 8—Delaware College.<br />\nagain penalized for being off side. 29 Willis<br />\nY. M. C. A. MEMBERSHIP AND<br />\nR H<br />\nBarrett 9<br />\nin the buildings or on the grounds<br />\n7<br />\nSpinney<br />\nOctober 15—Dickinson College.<br />\nL H<br />\nMcCauley 10<br />\nMarkell failed to drop kick and<br />\nADVANTAGES<br />\n19 Markell.....F.B..J. Chapman 11<br />\nof the University.<br />\nOctober 22—At Virginia, UniLynch<br />\nrecovered<br />\nthe<br />\nball.<br />\nSubstituti<br />\nMcCauons: Mt. St. Mary s—RearSince the Y. M. C. A. is included<br />\n5. Freshmen shall occupy seats versity of Virginia.<br />\nley made three yards through the don for McCauley. Hopkins—Magill for<br />\nin,<br />\nnon-athletic<br />\nthe<br />\nevery<br />\nbudget,<br />\nWesterman<br />\nin the rooters' section at all games<br />\n, Barton for Cromwell, CoaOctober 29—Western Maryland<br />\nstudeni who has paid the student line. Quarter ends with ball be- dy for Spinney, Calkins for Markell.<br />\nit Homewood, unless they are ac- College.<br />\nUmpire—R. W. Hogsett.<br />\nF.<br />\nactivities fee is entitled to member- longing to Mt. St.\" Mary's on her S. Porter. Lineman—B. W.Referee—<br />\nzompanied by guests..<br />\nHoban.<br />\nNovember 5—Haverford College.<br />\n15-yard<br />\nline.<br />\nSCORE BY QUARTERS<br />\nhip in the organization upon reg6. Freshmen shall wear official<br />\nMt. St. Mary's<br />\nNovember 12—At Swarthmore,<br />\n0 2 0 0— 2<br />\nSECOND QUARTER<br />\nistration at the \"Y\" office. In ad<br />\nFreshmen cap and black socks and Swarthmore<br />\n0 0 3 0— 3<br />\nNo changes in either lineup. J. Hopkins<br />\nCollege.<br />\ndition to the many advantages in Chapman went<br />\nneckties while on University propthrough center for NEWS<br />\nNovember 19—St. John's Col-LETTER STARTS ON<br />\nsuch membership are the special six yards and Lynch<br />\nerty.<br />\nlege.<br />\nmade first<br />\n25th<br />\nYEAR OF SERVICE<br />\noffered by the downtown down. J. Chapman gained<br />\n7. No Freshman shall wear, when<br />\nNovember 24— Thanksgiving— rates<br />\nanother<br />\non University property, any letter Washingt<br />\nbranch to out-of-town members of nine yards, byt on the<br />\nnext play Will Appear on Tuesdays and Fridays<br />\non and Lee University.<br />\ninsignia of athletic ability won at<br />\nthe Hopkins' \"Y.\"<br />\nwas thrown for a loss by Markell. in Enlarged Form. Many Positions<br />\na preparatory school.<br />\nThe City Building is excellently The visitors succeede<br />\nOpen to Editorial and Business<br />\nd in gaining<br />\nCandidates.<br />\n8. No Freshman shall walk on \"DOC\" RHODES IS STILL ON JOB equipped and contains' a splendid another first down, but<br />\nwere then<br />\nthe grass on University property: \"Doc\" Rhodes, our iodine-artist ;ymnasium and swimming pool. forced to kick to<br />\nWillis, who ran<br />\nThe NEWS-LETTER starts on its<br />\nnor shall he use the steps leading of the athletic department, attempt- The regular yearly membership is ten yards. Markell<br />\nmade a first<br />\nfrom the upper quadrangle to the ed, during the latter part of<br />\ntwenty-fifth year of uninterrupted<br />\nthe fifteen dollars, which entitles the down for Hopkins, but Spinney<br />\nsouth court.<br />\nsummer to emulate the immortal holder to all the privileges of the fumbled and Brown recovered the publication this fall. The oldest ac9. Freshmen shall 'not precede off - again - on - again - Finnegan \"Y.\" For out-of-town students a ball and ran 35<br />\n.\"<br />\nyards to Hopkins' tivity on the campus, it has ad?per classmen through doors in \"Doc\" was booked as the leading special rate of $7.50 is charged. 201yard line. The<br />\nBlack and Blue vanced in proportion to the growth<br />\nJniversitv buildings and shall en- victim in the \"reduce<br />\n-expenses\" Since the University is still without line held, however, and the ball of the University, and this<br />\nyear will<br />\nter Gilman Hall through the tun- campaign.<br />\nHe was retired in fa- a gymnasium, this offer is espe- changed hands ofter the visitors<br />\nappear<br />\nsemi-wee<br />\nnel. Seniors only may use the, main vor of the<br />\nkly<br />\nin<br />\nthe<br />\npresent<br />\nattractive<br />\n, affording the stu- failed at a drop kick. The locals'<br />\nmethod, unsuccessfully cially<br />\nsize<br />\nentrance of Gilman Hall.<br />\nand<br />\nform,<br />\nthus becoming more<br />\nattempted at other universities, of dent an excellent opportunity to luck changed here and, due to a<br />\n10. These regulations shall con- \"student trainers,\"<br />\nbut, fortunate- exercise during the cold months by bad pass, Darley was tackled for like an ordinary newspaper. This<br />\nflue in force until the end of the ly, was recalled<br />\nfollowing a wail of swimming and gymnastic work. a safety. The ball was brought out. stage was carefuly debated last<br />\nmid-year examinations, unless pre- protest from<br />\nThirty gym classes insure a suit- but Hopkins could not gain and year by<br />\nsuffering athletes.<br />\nthe Board and it was finalviously annulled by victory for the \"Doc- has been<br />\ntime for all who are interested kicked. The half ended shortly<br />\nable<br />\ntrainer at the<br />\nly<br />\ndecided that it was warranted by<br />\nFreshmen in interclass contests s in University for three years<br />\nthereafter with Mt. St. Mary's two<br />\nand - has in this phase of activity.<br />\nlie following sports: •<br />\nthe<br />\ngrowth of Hopkins, which<br />\nMr. John S. Maylott, of the Cen- points in the lead.<br />\nFootball, proved his worth on numerous occrack, basket-ball and swimming. casions. He is a licensed<br />\nshould provide news enough for<br />\nTHIRD QUARTER<br />\nchiroprac- tral Y. M. C. A., is in charge of the<br />\nCalkins kicked off over visitors' two issues a week. Under this<br />\nCopies of the constitution of the tic and has had experience in<br />\nmembersh<br />\nip<br />\nwork<br />\nwill<br />\nand<br />\nbe<br />\nglad<br />\ntrainStudent Council will be distributed ing professional athletes.<br />\nto talk to'any one interested in this goal line. McCauley and Lynch change, the Tuesday issue will be<br />\namong the Freshmen in sufficient<br />\nmade first down, but on .the next largely devoted to the sports<br />\noffer.<br />\nLast year he received several ofand<br />\ntime to permit their complying with<br />\nplay<br />\nSpinney tackled Lynch for a activities of the week-end, while the<br />\nfers from other institutions, but he<br />\nRegulation 2. Lists of the recog- chose to remain at Hopkins.<br />\nCoe—What are you thinking less. A pretty punting battle fol- Friday issue will contain general<br />\nnized actiirities will be posted in<br />\nlowed with the advantage on the information, accounts of meetings,<br />\nabout?<br />\nprominent places about the UniverEd—Just what you're thinking visitors' side, and ended by the ball all weekly happenings, and advance<br />\nSity.<br />\nWe all registered surprise when<br />\ngoing over the Hopkins' goal line. dope on Saturday's events.<br />\nabout.<br />\nwe heard that three of the faculty<br />\nCoe—If you do I'll. scream.— The play see-sawed back and forth, There are many vacancies on the<br />\nhad fallen before the onset of Dan<br />\nneither side being able to gain, when staff and a great number of<br />\nPhoe4ix.<br />\nmen<br />\nEight-o-Clocker (waking room- Cupid. Prof.<br />\nsuddenly Calkins brought the stands will be needed in both business<br />\nMastard was marand<br />\nnate)—It's ten to eight.<br />\nried during the summer io Mrs. \"What would you call a man who to its feet by recovering a fumble editorial departmen<br />\nts.<br />\nA<br />\nmeeting<br />\nSecond Eight-o-Clocker (sleep- Kirby Flower<br />\nof Chapman's and making a 67-yard for candidates will be held on<br />\nSmith, the Widow of hid behind a woman's skirts ?\"<br />\nWedy)—Wait till the odds get better. the late<br />\nProfessor of Latin at our \"I'd call him a magician.—Ban- run before being tackled by Lynch. nesday, October 5th, in the<br />\nNEWS'hen place it all.—Widow.<br />\nUniversity.<br />\nder.<br />\nHopkins was unable to gain and LETTER office, opposite the Barn.<br /><br />\nBlack and Blue Has Hard Time<br />\nDefeating Mt. St. Mary's<br /><br />\n•0,<br /><br />\nPr<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 4, 1921<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\nFOUNDED 1897.<br /><br />\nFIRST NUMBER OF BLACK<br />\nAND BLUE JAY TO APPEAR OCTOBER 15_<br /><br />\nSix Issues Will Be Published in Coming<br />\nYear. Many vacancies on Staff<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nto Be Filled.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br /><br />\nSubscription<br /><br />\n$2.50<br /><br />\nThe Greenhorns Number of the<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBlack and Blue Jay, the initial ediBusiness communications should be addressed to the BUSINESS MAN- tion of the year, will be distribute<br />\nd<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould ,be sent to the MANAGING EDITOR.<br />\n• at the University on October 15.<br />\nThis number is dedicated to the<br />\nClass<br />\nof '23 and the Freshman will<br />\nEditor-in-Chief:<br />\nBusiness Manager:<br />\nH. DOUGLAS COTTON, '22.<br />\nfurnish the main theme.<br />\nFREDERICK W. LIPPS, '22.<br />\nAssociate Editors:<br />\nThe Greenhorn's Number has<br />\nEDWARD G. HUEY, '22.<br />\nCirculation Manager:<br />\nELI FRANK, JR., '22.<br />\nbeen in the process of preparation<br />\nGLOVER P. FALLON, '23.<br />\nJunior Editors:<br />\nduring the, summer vacation, the<br />\nCHARLES C. MARBURY, '22.<br />\nstaff<br />\npromising an interesting volLAWRENCE B. FENNEMAN, '23.<br />\nAssistant Business Managers:<br />\nROBERT K. GUGGENHEIMER, '23.<br />\nDONALD K. VANNEMAN, '23.<br />\nume. Six numbers instead of five<br />\nRICHARD M. WOOD, '22.<br />\nBERNARD C. HEARN, '23.<br />\nWILLIAM H. MOORE, '23.<br />\nwill appear during the present colJOHN C. LEWIS, '23.<br />\nJ. BRENTNALL POWELL, '23.<br />\nlegiate year.<br />\nCRAIG E. TAYLOR, '24.<br />\nFITZGERALD DUNNING, '24.<br />\nThe Jay will start on the second<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nlap of his career with the appearance of this number. The first year<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nwas a hard one for the Jay, though<br />\nfair measure of success was ata<br />\nBALTIMORE, MD., OCTOBER 4, 1921<br />\ntained. Assured at the beginning<br />\nThe host of new students which are going to get our true place in of the year with the financial reare now entering Hopkins have but athletics, and that is to have the sources, Students' Activity Fee, and<br />\nto stay here awhile and they will whole University behind the team, a respectable advertising clientele,<br />\nbe as one with us. You Freshmen, and the whole city behind the Uni- the Jay has splendid prospects for<br />\nwho are coming daily up the drive versity. The best way to do this is a successful season.<br />\nThe name and reputation of the<br />\nto register will soon catch the drift by the sale of season tickets. CirBlack<br />\nand Blue Jay has been spread<br />\nand become absorbed in the grand culars have been sent out, and it<br />\nwidecast.<br />\nThe Collegiate Adverspirit of this grander old institu- is up to us to follow them up and<br />\ntising<br />\nAgency<br />\nof'New York, which<br />\ntion. Solomon could give no bet- make the sales. A reserved seat<br />\nhandles<br />\nthe<br />\nadvertisin<br />\ng for the mater advice than that you take this ticket for all seven games played<br />\nspirit and turn it to your advantage. at Homewood costs $7.50, and the jority of college magazines in the<br />\nThat which is a benefit to you is au- Athletic Association allows a com- East, has become interested in the<br />\ntomatically helpful to the Univer- mission to those students who need Jay, so advertisements, national in<br />\nsity.<br />\nfinancial support. Let's all get be- character, should be forthcoming<br />\nhind the University, the Athletic from this source.<br />\nPlans are being formed to extend<br />\nThe greater the number of Fresh- Associatio<br />\nn, and the team. Let<br />\nthe Jay's circulation. Arrangements<br />\nmen who turn out for.athletics, the the slogan<br />\nbe \"Every student sell<br />\nwill be made to place the Jay on<br />\nbetter our tea-fits. This applies, in a season<br />\nticket,\" and thus insure<br />\nnewstands throughout -Baltimore.<br />\nlike manner, to non-athletic activ- hearty<br />\nsupport for our team.<br />\nThe alumni are being interested in<br />\nities. The older students of J. H.<br />\nU. will be doubly encouraged in<br />\nUpon returning to college, we are the magazine proposition and it is<br />\nhoped that there will be a large<br />\ntheir efforts if they find a wealth prone to look about, almost<br />\ninvolalumni subscription list.<br />\nof co-operation among the new stu- untarily,<br />\nfor the old, familiar landdents. So if there be any of you<br />\nNumerous vacancies on the edimarks. A glance is enough to show<br />\nFreshmen who can do one thing<br />\ntorial, art and business staffs have<br />\nparticularly well, let him seek out the most casual observer that im- resulted from graduation. Excela channel for this proclivity, that we provements have been effected dur- ent opportunities, then, are affordmay all help him reap the mutual ing the summer. Strolling down ed to men of ability in any of the<br />\nbenefit. You have played football, Charles Street we notice<br />\naforementioned lines. An appeal<br />\nthat the<br />\nis made to all undergraduates,<br />\nperhaps, or served on your preparpavement along the University<br />\nFreshmen in particular, to become<br />\natory school's annuals staff. Or<br />\nproperty is almost complete.<br />\ncandidates for the Jay's staff.<br />\nmaybe you pick a mandolin.<br />\nAnyway, come out for something, Entering the postoffice, we are<br />\nA signal tribute was paid _to Dr<br />\neach and every one, and let us hear almost dazzled with a sense of newFrederick<br />\nH. Baetjer, of Baltimore,<br />\nfrom you. Hopkins will accord ness. Here is the greatest work of<br />\na<br />\ndistinguis<br />\nhed alumnus of this uniyou due appreciation.<br />\nall. We have new postoffice boxes.<br />\nversity, on September 29th by the<br />\nThis is gladdening news to those American Roentgen<br />\nSEASON TICKETS<br />\nRay Society,<br />\nWhat are we doing to make Hop- of us who have had to stand in line which has been in session at the<br />\nkins athletics a success this year? for our mail. These boxes cost $1,- Hotel Washington, Washington,<br />\nThat is a question which every stu- 600, and they<br />\nare worth it, n' est ce D. C.<br />\ndent—Senior, Junior, Sophomore,<br />\nA dinner, attended by more than<br />\npas?<br />\nAnother thing, however,<br />\nand Freshman—should ask him200 prominent physicians, was<br />\nself. The Faculty, Varsity Club. which helps to give the place a given in his honor, to celebrate the<br />\nCoaches Van Orman and O'Rosiake, bright appearance is the paint. Gil- twentieth anniversary of his pracMr. Kistler—all are working to put man Hall has been practically re- tice of Roentgenology.<br />\nHopkins on the map in athletic3. painted in the inside.<br />\nDr. Baetjer is described as one<br />\nof<br />\nWhat are we doing? Out of probthe heroes of science. He was<br />\nIn addition to this, the physical<br />\nably six hundred students there are nd engineering<br />\nborn in Baltimore in 1874. He relibraries have been<br />\nfifty men out for the team this :onsolidated for<br />\nceived his A. B. from the Johns<br />\nthe convenience of<br />\nfall. They are doing all they can the students.<br />\nHopkins University in 1897, and<br />\nto produce a winning team and<br />\nA model of the prospective and was graduated from the Medical<br />\nmake a name for Hopkins. How present<br />\nbuildings at Homewood is School in 1901. He is professor of<br />\nabout the rest of us? We can't all nearing<br />\ncompletion in the loft at Roentgenology in the school. Durplay football; what can we do? The<br />\nGilman Hall and will probably be ing the war he served as a major<br />\nanswer is—sell season tickets. Every exhibited<br />\nin the Gilman Memorial in the Medical Corps of the A. E. F.<br />\nstudent at Hopkins can sell at least Room.<br />\nAt one time he was president of the<br />\none season ticket. Many of us can \"The old<br />\nsociety which\" honored him.<br />\norder changeth.\"<br />\nsell a great many more. If we do<br />\nIn the study and use of the Xnot do it, it is because we have not<br />\nRay, more dangerous in years past<br />\nIMPORTANT<br />\ngot the advancement of Hopkins<br />\nAll students must take post office than now, he has been one of the<br />\nat heart. Is it fair to expect a few<br />\nleaders and is called one of the old<br />\nboxes in order to receive Univermen to do what the whole student<br />\nguard. Many of his earlier assobody should be doing? We all want sity notices and the advantages of ciates have paid with their lives for<br />\nHopkins to rise in athletics; we all the Non-Athletic fee.<br />\ntheir investigations, and Dr. Baetwant her to rank with the other<br />\njer, although still a young man and<br />\nSENIOR CLASS<br />\ncoljeges of her size in the East.<br />\nof unusual vitality, has undergone<br />\nMeeting for election of officers, several operations<br />\nBut are we willing to work to acto correct the<br />\nC. E. Hall, Friday, October 7, at ills suffered in the course of<br />\ncomplish this?<br />\nhis<br />\nThere is only one way that we 12:30.<br />\nwork.<br />\nTelephone<br /><br />\nHomewood 100<br /><br />\nthe Johns- Hopkins<br />\nUniversity<br /><br />\nPre<br />\necre<br />\ners,<br /><br />\nnect<br /><br />\nForty-Sixth Year of Instruction<br />\n1921-1922<br />\nINSTRUCTION<br />\nGRADUATE SCHOOL OF ARTS AND SCIENCES.<br />\nDegrees: Master of Arts, Doctor of Philosophy.<br />\nMEDICAL SCHOOL DEGREE. Doctor of Medicine;<br />\ncourses for physicians.<br />\nCOLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nSCHOOL OF ENGINEERING. Degrees: Doctor0_<br />\nf<br />\nEngineering; Master of Engineering; Bachelor of<br />\nEngineering; Bachelor of Science in Chemistry.<br />\nSCHOOL OF' HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Public Health; Doctor of Science<br />\nand Bachelor of Science in Hygiene; Certificate in<br />\nPublic Health.<br />\nCOLLEGE COURSES FOR TEACHERS. Degree of<br />\nBachelor of Science.<br />\nSUMMER COURSES. Accepted for degrees of Master<br />\nof Arts, Bachelor of Arts or of Science. Also for<br />\ngraduates in Medicine.<br />\nEVENING COURSES in Business Economics and for<br />\nTechnical Workers.<br />\nJohns Hopkins Press Publications.<br />\nSTATE BUREAUS: Geological Survey; Weather Service; Forestry.<br /><br />\nPre<br />\n'ecre<br /><br />\nobei<br />\nned<br />\nonai<br /><br />\ndwa<br /><br />\nPre<br />\necre<br /><br />\nVAR<br /><br />\nChu<br />\necre<br /><br />\nCal<br /><br />\n1. Pi<br /><br />\nCa)<br /><br />\nYana<br /><br />\nCal<br /><br />\nVana<br /><br />\nCa)<br /><br />\n• Bi<br /><br />\nCa)<br /><br />\nhavic<br /><br />\nCa)<br /><br />\nBUILDINGS<br />\nGILMAN HALL—general library, class rooms, biology, administration.<br />\nMECHANICAL AND ELECTRICAL ENGINEERING=<br />\nhousing, also Physics and College Chemistry.<br />\nCIVIL ENGINEERING—housing also Geology.<br />\nPOWER HOUSE.<br />\nBOTANY AND PLANT PHYSIOLOGY—with Greenhouse<br />\nand Botanical Garden.<br />\nCHEMICAL LABORATORY—for graduate work.<br />\nPHYSIOLOGICAL BUILDING.<br />\nANATOMICAL LABORATORY.<br />\nHUNTERIAN LABORATORIES.<br />\nPATHOLOGICAL LABORATORY.<br />\nSCHOOL OF HYGIENE AND PUBLIC HEALTH.<br />\nCARROLL MANSION—Johns Hopkins Club.<br />\nSTUDENT ACTIVITIES BUILDING.<br /><br />\nbuf<br /><br />\nCal<br /><br />\nEd<br />\nCott°<br />\ncrick<br />\nEd<br /><br />\nkins<br />\nG. H<br />\nEd<br /><br />\nPenn<br />\npouf<br />\nEa<br />\niness<br /><br />\nman.<br /><br />\n\"WhoWasJohn Hancock?\"<br /><br />\nRusi<br /><br />\nasked Thomas A. Edison in his<br />\nEmployment Questionnaire<br />\nSecr<br /><br />\nWe will pay One<br />\nHundred Dollars<br />\n($100)forthe best<br />\nanswerto Mr.Edison's question.<br />\nCompetition closes November 15, 1921<br />\nADDRESS<br /><br />\nDEPARTMENT OF PUBLICITY<br /><br />\nreta<br /><br />\nSec'<br />\nSec;<br />\nsistc<br />\nWy<br />\n12<br />\nfror<br />\nabn<br />\ncon,<br />\nV‘Th<br />\nwas<br />\nMa:<br />\nhe<br />\nspe]<br />\nenn<br /><br />\nAL<br /><br />\nLIFE INSURANCE COMPANY<br />\nOF BOSTON. MASSACHUSETTS<br /><br />\nden<br /><br />\nfro i<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 4, 1921<br /><br />\n3<br /><br />\nTwo Hopkins men, Dr. George<br />\nPromotions—Mr. Harry W. WaMt. Vernon 4999<br />\nE. Barnett and Dr. Leo Wolman, terfall, Associate Professor of MeORTMAN'S<br />\nwere honored this summer by be- chanical Engineering. Dr. Francis ''Queen Quality\" Home Made Chocolates<br />\ning selected as members of the ad- D. Murnaghan, Associate Professor<br />\nVISIT OUR ICE CREAM PARLORS<br />\n1921-1922<br />\nvisory council to the Unemployment in Mathematics. Mr. J. Trueman<br />\n518 N. CHARLES STREET<br />\nCommercial Photography<br />\nOMICRON DELTA KAPPA<br />\nConference.<br />\nThompson, Associate Professor in<br />\nPresident, Joseph C. Thompson; Dr. Barnett is a member of the Civil Engineering. .<br />\nCircuit Photography<br />\necretary, Robert C. Hall; Mein- faculty of this University, as ProFlash Lights<br />\nViews<br />\nAdditions—Dr. George Boas, Asers, Douglas Cotton, Andrew fessor of Statistics. Dr. Wolman, sociate in Philosophy. Mr. F. D.<br />\nCharles and 22nd Sts.<br />\nGroups<br />\nEnlargements<br />\nnecht, Davidge Rowland.<br />\nKODAK FINISHING<br />\nwho was formerly associated with Broons, Associate in Education. Dr. Delicious Sodas and Sundaes<br />\nThe Best of Candies<br />\nSTUDENT COUNCIL<br />\nJohns Hopkins, is now Professor in C. A. Nelson, Associate in Mathe325 N. Howard St.<br />\nPrompt &amp; Efficient Service<br />\nPresident, Richard M. Wood; the Department of Social Science matics. Dr.. Ralph C. Williams,<br />\necretary, Gilson Engel; Seniers, at New York University.<br />\nAssociate in Romance Languages.<br />\n,obert Hall, Gilson Engel, Andrew<br />\nThe Advisory Council, which was Mr. Schachone Isaacs, Instructor<br />\nnecht ; Juniors, John Marchant, picked by Secretary of Commerce in Psychology. Mr. J. Earle Uhler,<br />\n1 W. University Parkway<br />\nST. PAUL &amp; 24th STS.<br />\nonald Vanneman ; Sophomores, Herbert C. Hoover, is composed of Instructor in English. Mr. Francis<br />\nOpposite J. H. U. Athletic Field<br />\nC. D. Wolfe, Prop.<br />\ndward Morrison.<br />\ntwenty-five of the leading econo- Ludlow, Student-Assistant in EngDRUG STORE for J. H. U. BOYS<br />\nATHLETIC BOARD<br />\nDELICIOUS SODAS &amp; SUNDAES<br />\nmist of the country. They were se- lish.<br />\nPHONE, HOMEWOOD 2121<br />\nMade With<br />\nPresident, Andrew H. Knecht; lected as specialists to advise the<br />\nSpecial<br />\nCream<br />\nIce<br />\nJersey<br />\nNOTICE<br />\necretary, S. Atherton Middleton. conference in easing the unemploy\"The Velvet Finish\"<br />\nMeeting of candidates for EdiVARSITY SEAL VOTING COUNCIL ment situation in the country.<br />\nBuy an (H) Pipe made special<br />\ntorial and Business Board of NEWS- KODAKS CAMERAS SUPPLIES<br />\nChairman, H. Douglas Cotton;<br />\nfor the Boys<br />\nLETTER, Wednesday, October 5th, Whitman's Chocolates and Bon Bons<br />\necretary, Frederick W. Lipps.<br />\nFOOTBALL PROMOTIONS AND ADDITIONS in NEWS-LETTER office, opposite<br />\nORDERS RECEIVED FOR<br />\nTO FACULTY<br />\nManager,<br />\nAthletic Office in Barn.<br />\nCaptain,<br />\nCOGGINS'<br />\nMeeting of Varsity Seal Voting \"Why do they call that car RegThe followig promotions and ad-1. Pierce Brawner.<br />\nTransfer<br />\nand Baggage Express<br />\nLACROSSE<br />\nditions have been made on the fac- Council, Thursday, October 6, in ulator ?\"<br />\nAUTOMOBILE SERVICE<br />\nRoom 112, G. H.<br />\n\"All other cars go by it.\"—.Frivol. PHONE, HOMEWOOD 2645-W<br />\nCaptain, Joseph Zoller Manager, ulty for the coming year:<br />\noward Hensel.<br />\nBASEBALL<br />\nCaptain, Andrew H. Knecht:<br />\nanager, Edward G. Huey.<br />\nTRACK<br />\nCaptain, Joseph C. Thompson;<br />\nana.ger, William R. Fortney.<br />\nBASKETBALI,<br />\n• Manager,<br />\nCaptain,<br />\n.1- Brentnall Powell.<br />\nSWIMMING<br />\n1<br />\nCaptain, Paul Buhrer ; Manager,<br />\nhavidge Rowland.<br />\nTENNIS,<br />\nCaptain and Manager, Wilson<br />\nDuffy.<br />\nCROSS COUNTRY TEAM<br />\nCaptain, W. H. Somerville.<br />\nNEWS-LETTER<br />\nThe man whose courage and foresight<br />\n' Editor-in-Chief — H. Douglas<br />\ngave alternating current to America,<br />\nCotton; Business Manager, Fredand founded the Westinghouse industries.<br />\nerick W. Lipps.<br />\nHULLABALOO<br />\nEditor-in-Chief, R. Dorsey Watkins; Business Manager, Edward<br />\nG. Huey.<br />\n• Black and Blue Jay<br />\nEditor-in-Chief, Lawrence B.<br />\nrenneman ; Business Manager, H.<br />\nDouglas Cotton.<br />\nThirty years ago the alternating current<br />\ntuned to prevent the use of the \"deadly<br />\nsystem was but an infant, for whose life those<br />\nDAILY BULLETIN<br />\nWestinghouse Current,\" as many extremists<br />\nwho believed in it were fighting daily and<br />\n. Editor, H. Douglas Cotton; Busdescribed it.<br />\nnightly battles; today this same system is a<br />\nlness Manager, Donald K. VanneThat the little 50 horsepower generators of<br />\ngiant of almost inconceivable size, so capable<br />\nMan.<br />\nthose days have grown to sizes two thousand<br />\nof defending itself that no one seeks to attack<br />\ntimes as large; that stations of a few horseDRAMATIC CLUB<br />\nit. For 95% of the electricity that is generpower have been succeeded by stations with<br />\nPresident—Gilson Engel; Secreated and transmitted today is alternating<br />\ncapacity of hundreds of thousands of horsea<br />\ntary, Eli Frank, Jr.<br />\ncurrent.<br />\npower, while at the same time, distribution<br />\nMUSICAL CLUB<br />\nThe story of the development of alternating<br />\nvoltages have grown from 1,000 to 220,000,<br />\nPresidenit, R. Waldo Hambleton ;<br />\ncurrent is a story of courage and vision and<br />\nis due largely to the vision and the courage of<br />\nBusiness Manager, Hugh Smallfaith; of misunderstanding and misrepresenGeorge Westinghouse, and to the qualities<br />\nwood.<br />\ntation; of engineering failures and triumphs;<br />\nof the engineers whom he called, characterof commercial ability and organization. It<br />\nistically, to help him. By no means the least<br />\nBAND<br />\nreads<br />\nlike<br />\nclassic<br />\na<br />\nromance.<br />\nIn<br />\nchapters<br />\nits<br />\nof the achievements of this man was his<br />\nDirector, Emil Smith.<br />\ncredit<br />\nare<br />\nand<br />\nhonor<br />\nfor<br />\nability to organize the greatest aggregation of<br />\nwho<br />\nall<br />\nhave<br />\ndeserved<br />\nDEBATING COUNCIL<br />\nit, but the central figure, the man whose<br />\nengineering intelligence ever known, men of<br />\nPresident, R. Dorsey Watkins;<br />\nmotives and acts furnished the basis of the<br />\nanalytical ability, consummate mathemaSecretary, Lawrence B. Fenneman.<br />\nplot, was George Westinghouse, the founder<br />\nticians, great inventors; and to promote in<br />\nINTERFRATERNITY BOARD<br />\nof the Westinghouse Industries.<br />\nthis great group the most harmonious and<br />\nPresident, Gilson E. Engel; Secintelligent co-operation.<br />\nWhen, in 1886, he brought over from<br />\nretary, Richard M. Wood.<br />\nEurope the crude Gaulard and Gibbs system,<br />\nThe same energy and courage and purpose<br />\nY. M. C. A.<br />\neven he, great as was his foresight, did not<br />\nthat forced the acceptance of the air brake,<br />\nPresident, Leroy Baughman;<br />\ndream of the coming magnitude of the idea<br />\nthe modern systems for the economic and safe<br />\nwhich he was fostering. The development<br />\ndistribution of natural gas, and later of the<br />\nSecretary, Paul Stevens; General<br />\nwork undertaken by the strong engineers<br />\nsteam turbine,led and won the fight for alterSecretary, Charles S. Sydnor ; Aswhom he put to work led at first into many<br />\nnating current, which has grown to be one of<br />\nsistant General Secretary, Vertrees<br />\nserious differences with those who favored<br />\nworld's greatest and most necessary<br />\nthe<br />\nWyckoff.<br />\ndirect current. Legislatures were even imporcommodities.<br /><br />\nWho's Who at J. H. U.<br /><br />\nW.L. Mann<br /><br />\nChelsea Pharmacy<br /><br />\nThe College Drug Store R. G. by &amp; Company<br /><br />\nGeorge Westinghouse<br /><br />\nFACULTY NOTES<br /><br />\nDr. Goodnow returned yesterday<br />\nfrom an extensive trip abroad.<br />\nProf. Hollander, who went<br />\nabroad to study social and economic<br />\nconditions, returned some time ago.<br />\nWhile in England Prof. Hollander<br />\nwas established in a house at<br />\nMaidenhead-on-the-Thames.<br />\nLater<br />\nhe went to the continent, where he<br />\nVent some time in Paris and Vienna.<br />\nProfessors Willoughby and Vincent are among those of our faculty who 'have recently returned<br />\nfrom travels abroad.<br /><br />\nTHE JOHNS HOPKINS NEWS-LET TER, OCTOBER 4, 1921<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br /><br />\n0. T. C. UNIT IS<br />\nPLACED ON DISTINGUISHED<br />\nLIST<br /><br />\nHOPKINS R.<br /><br />\n(THE BOOK MART)<br />\nComplete Stock of •<br />\nMedical Books and College<br />\nRequisites<br /><br />\nIt's time for a<br />\nV0<br /><br />\nFALL SUIT<br /><br />\nWar Dept. Inspector's Report Does<br />\nCredit to Local Unit and Major<br />\nGarey. Comment by Major<br />\nCarey Himself.<br /><br />\ns)`<br /><br />\nWe're ready<br />\n$30 up<br /><br />\nImporters and Dealers in Fine Books<br />\n301 N. CHARLES ST.<br /><br />\nBaltimore, Md.<br /><br />\ne)<br />\nfieXatteri<br />\nLti<br />\nH.&amp; OSCAR G.1--‘11(<br />\nOWN ER%<br />\n'<br />\n1411)E*1.140e14 OP<br />\n29 Baltimore St., East<br /><br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands.<br />\n(Greek Letter Societies)<br />\nThe Chas. Willms Surgical<br />\nInstrument Co.<br /><br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br /><br />\nJ. H. Furst &amp; Co.<br />\nPrinters of Philological and<br />\nScientific Works<br /><br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br /><br />\nThe Johns Hopkins unit of the<br />\nR. 0. T. C. was highly commended by Major E. H. Metzger<br />\nin his report of an inspection made<br />\nlast May of the local organization.<br />\nThe high standing of the Hopkins<br />\nunit reflects much deserved credit upon Major Garey and his assistants. Major Metzger ended his<br />\ndetailed report by saying:<br />\n\"This unit is considered by me<br />\nto be a model unit. Major Garey<br />\nis deserving of the highest praise<br />\nand commendation of the success<br />\nattained by his unit at this university. I strongly recommend<br />\nthat this college be given the rating of 'Distinguished College.'<br />\nSuch a rating is clearly deserved.\"<br />\nSuch comments as these are fi-equent in the report. They are typical of the enthusiasm expressed<br />\nby Major Metzger. He speaks of<br />\nthe loyalty and the high caliber of<br />\nmen enrolled in the R. 0. T. C.<br />\nAccording to the report, all were<br />\nextremely enthusiastic and full of<br />\npraise for the army personnel on<br />\nduty there. The interest in the R.<br />\n0. T. C. at Johns Hopkins is exceedingly high. The appearance of<br />\nthe unit as a whole could not have<br />\nbeen better.\"<br /><br />\nF<br />\nMINA.<br /><br />\ninte<br /><br />\ngiv<br />\nFri,<br />\nbe<br />\nans<br />\nthe<br />\nC.<br />\ngra<br />\nsic<br />\nStt<br />\nof<br />\nwh<br />\naft<br />\nA.<br />\npr(<br />\nLa<br />\ner<br />\nta<br />\nTI<br />\nci<br />\nC(<br />\nte<br />\nto<br />\nar<br />\nB,<br />\nlyj<br />\nrc<br />\nsr<br /><br />\n5he apex<br />\ninfasluonable<br />\nneckzaear<br /><br />\nWelcome!<br />\nThe Quality Shop extends a hearty welcome<br />\nto our old friends<br />\namong the upper classmen at Hopkins!<br />\nAnd to the new class,—<br />\nwhom we hope to make<br />\nour friends we extend a<br />\ncordial invitation to<br />\nvisit a real men's store.<br />\nGood clothing, hats,<br />\nshoes. furnishings,—at<br />\nmoderate prices.<br />\nTHE<br /><br />\ne,ev<br /><br />\nFRi<br /><br />\nCLOTHES<br />\n211-213 E. Baltimore St.<br />\nOur -prep\" room on the<br /><br />\nthird floor specializes in<br />\nclothes for young men.<br /><br />\nS<br /><br />\nIlle<br /><br />\nUALITY HOP<br /><br />\nCollar Hug Clothes<br />\nBaltimore and Liberp,Streets<br /><br />\nI •111111111•111111•111M•111<br />\nJ111111111•11•1111111•WIll<br /><br />\nHub<br /><br />\nBaltimore. Charles and Fayette<br /><br />\nURNER'S<br /><br />\nYoung Men's Clothing<br />\nand Furnishings<br /><br />\nfervid approval last year and imMEN'S SHOES<br />\nAre made a special feature o<br />\nproved the attendance 1,000 per cent<br />\nOf the Better Class<br />\nThe Johns Hopkins Debating will be continued this year. Other<br />\nhere.<br />\nCouncil is negotiating to renew the. means of causing interest in deagreement for the triangular debate bates are being prepared, but as yet<br />\nGive us a call and let us becom<br />\nbetween the Johns Hopkins Uni- are not ready for publication. The<br />\nbetter acquainted for mutual<br />\nURNER BROTHERS<br />\nversity, Washington and Lee, and Debating Council will meet early<br />\nbenefit.<br />\n111 E. BALTIMORE STREET<br />\nthe University of North Carolina, in the year to arrange the proBALTIMORE<br />\nthe<br />\nin<br />\n()Tam.<br />\nwhich is generally staged<br />\nspring of the year.<br />\nOld Maid—Help! Police! Stop \"What is the psychological moPlans are being made fo arouse<br />\nment?\"<br />\na keener interest in debating at him! He tried to flirt with me..<br />\nCop—Calm yourself, lady, there's \"Waking up just as the prof. calls<br />\nHomewood. The jazz feature of<br />\nHoward at Lexington<br />\nyour name.\"—Punch Bowl.<br />\nthe debates which met with such plenty more.—Siren.<br />\nDEBATING COUNCIL TO RENEW<br /><br />\nti<br />\nIT<br />\nIi<br />\nti<br /><br />\nfi<br /><br />\nTEWART&amp;G,<br />\nIS'WI Jam.Ilf.LCrier0 41!<br /><br />\nNM Tort<br /><br />\nHOPKINS SONGS<br />\nOUR ALMA MATER IN DIXIE LAND For we are the glory and the halo.<br /><br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS<br /><br />\nHess Shoes<br />\nTeach a Lesson in Style<br /><br />\nThey possess the \"dash\" that<br />\nappeals to college men, toned<br />\ndown to distinctiveness. And<br />\nwearing qualities that provoke<br />\nenthusiasm.<br />\nN. HESS' SONS<br /><br />\n8 E. BALTIMORE ST.<br /><br />\nCome stand together, we'll raise a<br />\ncheer and wave the Black and<br />\nBlue;<br />\nWe pledge our faith as loyal sons,<br />\nto Hopkins we'll be true,<br />\nWe love our college in Dixie Land,<br />\nour university.<br />\nWe shout her praise as we march<br />\nalong, so one, two, three!<br />\nCHORUS<br /><br />\nHurrah! Hurray!<br />\nA rousing Hullabaloo! Rah!<br />\nOur Alma Mater in Dixie Land,<br />\nHurrah for Black and Blue!<br /><br />\nSHOES<br /><br />\nThe Hopkins men on the football<br />\nfield have won a great renown;<br />\nThey buck the center, and buck the<br />\nends, and pull their opponents<br />\ndown.<br />\nAnd if their bodies are black and<br />\nblue, they're loyal, don't you<br />\nsee.<br />\nThey carry their colors where'er<br />\nthey go, so one, two, three!<br />\nCHORUS—Hurrah! Hurray! Etc.<br /><br />\nfor<br /><br />\nON THE LINE<br /><br />\nLEMMERT<br />\nMADE TO ORDER<br />\nAND<br />\nFINISHED CLOTHES<br />\nPLAZA BUILDING<br /><br />\n19 and 21 EAST FAYETTE ST.<br /><br />\nOn the line, on the line, on the side<br />\nUNIVERSITY MEN<br />\nof the line<br />\nFor Sport Wear<br />\nFor Dress<br />\nWe're yelling for the 'leven in the<br />\nSmart Styles—Best Leathers<br />\nrain and shine<br />\nModerate Prices<br />\nWhen the leven's in the rain, we're<br />\nyelling all the time<br />\nWhen we're out on the side of the<br />\nline.<br />\n8-19 W. LEXINGTON ST.<br /><br />\nWYMAN<br /><br />\nCOME, SENIORS, WISE AND<br /><br />\nGRAVEYARD<br /><br />\nLEARNED!<br /><br />\nOh where, oh where, are the Sol<br />\ndier boys?<br />\n, Oh where, oh where, can they be?<br />\nThey came up here with their football team,<br />\nOh where, oh where, can they be?<br />\nWhere's old St. John's? (Loud)<br />\nDown in the graveyard,<br />\nHear the mournful sound,<br />\nAll the Soldier boys are weeping,<br />\nTheir team's in the cold, cold,<br />\nground.<br />\nAh—men!<br /><br />\ntoo,<br />\nThe pride of the women and the Come, Seniors, wise and learned,<br />\nCome, Juniors, raise a cheer.<br />\nJ. H. U.<br />\nSophies, bold and cruel,<br />\nCome,<br />\nThe pride of the women and the<br />\nFreshmen, have no fear:<br />\nCome,<br />\nJ. H. U.<br />\nye college classes,<br />\nall<br />\nCome<br />\nCombined in one big Hullabaloo.<br />\nCome, join with voices true,<br />\nOn the line, on the line, etc.<br />\nSing praise to dear old Hopkins,<br />\nHurrah for Black and Blue.<br />\nJOHNNY HOPKINS<br />\nCHORUS<br />\nJohnny Hopkins, on to victory,<br />\nRah ! for the Black, boys!<br />\nJohnny Hopkins, play the game,<br />\n- Rah! for the Blue, boys!<br />\nJohnny Hopkins, fight the battle,<br />\nRah! for Johnny Hopkins, rah!<br />\nWinning name and fame.<br />\nJohnny Hopkins, we're all with you, We'll pour forth our praise to dear,<br />\nofd Johns Hopkins.<br />\nFighting, plunging, onward down<br />\nRah, for Johnny Hopkins, rah!<br />\nthe field toward the goal,<br />\nIts the same old line, the same old<br />\nThe four bright years of college,<br />\nteam,<br />\nThe shortest years of life,<br />\nIf we win you'll hear the eagle<br />\nThe years so full of gladness,<br />\nscream,<br />\nThe years with pleasure rife, Cheer and cheer again for Johnny Are<br />\ngliding swiftly by, boys,<br />\nHopkins.<br />\nOur work will soon be through.<br />\nThen oft we will recall, boys,<br />\nSAND IN OUR MAKEUP<br />\nThe years 'neath Black and Blue.<br />\nWe've got sand in our makeup,<br />\nCH0.—Rah! for the Black, boys,<br />\nAnd hair on our chests,<br />\netc.<br />\nIf we don't beat old St. John's,<br />\neat- our coats and vests.<br />\nTO WIN! TO WIN!<br />\nSo! Come out to Homewood,'<br />\nto win,<br />\nwin,<br />\nTo<br />\nAnd see Johns Hopkins play,<br />\nlike Hell to win!<br />\nlike<br />\nWe'll beat them, beat them, beat You'd<br />\nBut you'll have to wait 'till the moon<br />\nthem,<br />\nturns green,<br />\nAny old day. Hurray!<br />\nAnd the brass bands plays \"God<br />\nA chair for one is holding two,<br />\nShave the Dean.'<br />\nHeigh-lo! Heigh-lay!<br />\nIt could not hold another;<br />\nIt's plain as A, B, C,<br />\nBut suddenly it holds but one,<br />\nYou think it broke? No—Mother. If anybody's going to win today,<br />\nIt's We! We! We!<br />\n—Banter.<br /><br />\nEverybody bets on Hopkins,<br />\nGee how rich we'll be,<br />\nFounding public libraries,<br />\nLike Andrew Carnegie.<br />\nSo! Whats the use of betting,<br />\nAgainst the Black and Blue.<br />\nThe poor-house it is flooded,<br />\nBut there's room for you.<br />\nYou damned old Bankrupt<br />\n(Loud).<br />\nHoo! Wah! Hoo!<br />\nHoo! Wah! Hoo!<br />\nHoo! Hoo!<br />\nJ. H. U.<br /><br />\nFirst Prof.—Well, how were<br />\nyour examinations?<br />\nSecond Prof.—A complete success. Everybody flunked.—Dirge.<br />\nLandylady—What part of the<br />\nchicken do you wish?<br />\nBoarder—Some of the meat,<br />\nplease.—Sun Dial.<br /><br />\n1<br /><br />"}], "field_media_file": [{"target_id": 37531, "display": null, "description": null, "target_type": "file", "target_uuid": "83396b67-2afc-4c66-b41d-ec8245663f9e", "url": "http://digital.library.jhu.edu/system/files/2022-03/12955-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12955, "target_type": "node", "target_uuid": "059a425b-9075-4473-b554-2a72b4e357f7", "url": "/node/12955"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "cc98377a-aaae-4d57-8113-1b608f2ddb68"}]}