{"mid": [{"value": 51434}], "uuid": [{"value": "153cd57c-1868-45e0-9f98-511f1e17e17e"}], "vid": [{"value": 51434}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-20T03:11:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "16194-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-20T03:11:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-20T03:11:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": " <br />\n<br />\nPURPOSE OF STUDY AND SUMMARY OF FINDINGS<br />\n<br />\ni<br />\n<br />\nThe Statewide Trails Study is an element of Maryland’s 1983 Recreation and<br />\nOpen Space Plan. The primary purpose of the study is to identify existing trails<br />\nand make recommendations for improving trail opportunities. The study achieves<br />\nthe following objectives: ‘<br />\n<br />\n1) provides an inventory of trails and hostels<br />\n<br />\n2) provides an overview of public and private trail pmgram§<br />\n<br />\n3) assesses the need for additional trails by type anﬂ-geégiaphic region<br />\n4) identifies potential trail routes in the State and locations for new hostels<br />\n5) presents information on trail guides and information sources<br />\n<br />\n6) recommends future actions to be taken by trail and hostei providers to<br />\nincrease trail and hostel opportunities<br />\n<br />\nThe major findings of the study are as follows:<br />\n<br />\n1) Maryland has 3,047 miles of trail (see definition), of which 89 percent<br />\n(2,722 miles) is available for public use. State agencies own or provide<br />\n30 percent (928 miles) of the total mileage, more than any other trail pro-<br />\nvider in Maryland. Federal agencies, local jurisdictions and quasi-public<br />\norganizations are also important trail providers. If multi-use trails are<br />\ncounted more than once, there is actually a total of 4,254 miles of trail<br />\navailable for trail activities. There are currently three hostels in Maryland,<br />\nstrategically located to support trail activities.<br />\n<br />\n2) Private trail groups and conservation organizations in Maryland are ac-<br />\ntively involved in trail development and maintenance, land acquisition,<br />\ntrail education programs, publication and sales of maps and guidebooks,<br />\n‘organizing trips and outings, and providing hostels. .<br />\n<br />\n3) There is currently a supply of trails to meet minimum needs for all ac-<br />\ntivities except off-road vehicle and snowmobile use. However, the trail<br />\nmileage is not evenly distributed across the State, resulting in trail deficits<br />\nin some regions. There is also a need for more loop trails suitable for<br />\novernight or weekend backpacking trips. Comrared to nearby states,<br />\nMaryland has a deficiency of National Recreation Trails.<br />\n<br />\n4) Planning organizations and trail groups have identified a number of poten-<br />\ntial trail routes in the State. These range from long-distance trails such<br />\nas the Potomac Heritage Trail to local bikeway systems. There is poten-<br />\ntial for expanding the existing hostel system by developing new hostels<br />\nalong the C&0 Canal Towpath and East Coast Bicycle Trail.<br />\n<br />\n5) Trail guidebooks, brochures and maps are available for the major trails<br />\nand trail areas in the State. However, there are some unmarked or<br />\nundesignated trails which are not described in the available literature.<br />\nTrail opportunities would be improved if information on lesser known trails<br />\nwere available to citizens. ,<br />\n<br />\nSTATE TRAIL AND HOSTEL ACTIVITIES<br />\n<br />\n <br />\n<br />\nTrails<br />\n<br />\nAt the State level, trails are developed and maintained by the Department<br />\nof Natural Resources and the Department of Transportation. In addition, the<br />\nDepartment of State Planning has responsibilities related to trail planning and<br />\ndevelopment.<br />\n<br />\nThe Department of State Planning conducted this Statewide Trails Study to<br />\nassess trail opportunities and needs. The Department also maintains an inven-<br />\ntory of trails in the State as an element of the Statewide Recreation Inventory<br />\nand prepares the Maryland Recreation and Open Space Plan, which establishes<br />\npolicies related to trail development in the State and contains an analysis of<br />\nthe suitability of the State’s land base for trail-oriented recreation.<br />\n<br />\nState trail policy calls for a unified statewide trail system that includes all<br />\ntypes of trails. Specific strategy recommendations include utilization of aban-<br />\ndoned railroad rights-of-way, designation of selected public lands for off-road<br />\nvehicle use, designing specific trails for specific uses, development of more trails<br />\non public lands and links between existing trails, and development of water trails.<br />\nIn addition, the planning objectives in the State Action Programs which relate<br />\nto trails are given high priority. These are: 1) provision of corridors for limited<br />\nrecreation uses such as bicycling, hiking, and others which relate to streams,<br />\nshorelines, and unique resource areas; 2) establishment of an interconnecting<br />\nsystem of walking, hiking, and riding trails along the ocean beach, bays, estuaries,<br />\nrivers and streams, linking activity centers.<br />\n<br />\nThe Department of Natural Resources acquires and manages parks, forests,<br />\nnatural areas, and wildlife management areas in the State. These areas provide<br />\na variety of trail-related recreation opportunities to the public. The Maryland Forest<br />\nand Park Service manages many of the State-owned trails and trail areas. State<br />\nparks contain a variety of trails, including hiking, biking, equestrian, nature,<br />\nand cross-country ski trails. State Natural Environmental Areas protect signifi-<br />\ncant natural resources and provide low intensity recreation opportunities. Some<br />\nof these have trails; others have potential areas for trail development.<br />\n<br />\nState forests are under multiple-use management and provide opportunities<br />\nfor low density dispersed recreation. Hiking, backpacking and cross-country skiing<br />\nare important trail-related activities in State forests. State forests also provide<br />\ntrails for off-road vehicle users and snowmobilers.<br />\n<br />\nState Wildlife Management Areas are managed by the Wildlife Administra-<br />\ntion primarily to protect and manage wildlife populations. Some trail activities<br />\nare permitted in these areas. Trail types and policies vary from area to area.<br />\nMost areas have either trails for foot travel, unpaved roads which are closed<br />\nto vehicles during certain seasons, wood roads which can accommodate foot<br />\ntravel, or a combination of these corridors. Some areas allow horsebacking riding.<br />\n<br />\nNatural Resource Management Areas are lands acquired by the State for a<br />\nvariety of potential natural resource uses. Interim recreational uses are allowed<br />\n~ which do not conflict with the protection of natural resources. Currently, one of<br />\nthese areas, Monocacy, contains trails. Other units should be considered as<br />\npotential areas for new trails.<br />\n<br />\nState use of Program Open Space funds to acquire the Appalachian Trail cor-<br />\nridor on South Mountain has resulted in State protection of about 80 percent<br />\nof the Trail in Maryland. Trail management responsibilities are shared by the<br />\nNational Park Service (NPS), the Department of Natural Resources (DNR), and<br />\nthe Potomac Appalachian Trail Club (PATC). A cooperative agreement between<br />\nDNR and PATC (1981) commits PATC to development and maintenance of the<br />\ntrail in Maryland. Overall management policies presented in the Comprehen-<br />\nsive Management Plan developed by the National Park Service stress the im-<br />\nportance of an unregimented recreational experience in a natural setting and<br />\nencourage self-reliance by trail users.<br />\n<br />\nProgram Open Space funds are also alloted by DNR to local jurisdictions<br />\nfor park acquisition and development. Trails have been developed in county and<br />\nlocal parks with these funds.<br />\n<br />\nThe State Highway Administration, Department of Transportation, is respon-<br />\nsible for bicycle-related planning and development for the State highway system,<br />\ncoordination with local and county bicycle facility development programs, and<br />\nthe coordination of intermodal aspects of bicycle transportation. The Highway<br />\nAdministration has constructed a number of bikeways, replaced storm drain grates<br />\nto improve bicycle safety, and is providing for bicycle use on the State highway<br />\nsystem via smooth surfaced highway shoulders, wide curb lanes, and other im-<br />\nprovements. Bicycle lockers at selected intermodal transfer points, a special bicy-<br />\ncle information telephone line, and a bicycle coordinator position for program<br />\ncontinuity are also included in agency’s efforts.<br />\n<br />\nState Hostel Program<br />\n<br />\nThree Hostels already exist in the State. Recommendations related to hostel<br />\ngevelowent in the State are contained in the Maryland Recreation and Open<br />\npace Plan.<br />\n<br />\nState hostel recommendations encourage the completion of a network of<br />\nprivately developed and maintained hostels. This could be achieved by developing<br />\na series of hostels around the Chesapeake Bay and along the Potomac River,<br />\nand by developing several hostels in Western Maryland, the general area north<br />\nof Baltimore and Washington, and in major cultural areas such as Annapolis and<br />\nBaltimore. New hostels should tie in with existing trail systems and with hostel<br />\nnetworks in adjoining states.<br />\n<br />\nTRAILS IN MARYLAND<br />\n<br />\nFor purposes of this study, a trail is a route, path, road, corridor, or right-of-<br />\nway used for recreation, education, or transportation. Although a road is usu-<br />\nally considered to be different than a trail, a road can serve as a trail in certain<br />\nsituations; for example, bicycle touring routes and historical trails both utilize<br />\nroads.<br />\n<br />\nTrail Types and Definitions<br />\nThe Department has identified twelve trail types, defined as follows:<br />\n<br />\n« Biking trails are signed facilities constructed within separate rights-of-way or<br />\nhighway rights-of-way to encourage bicycle activity, develop bicyclist skills and<br />\nprovide a recreation experience to the user. Because recreational bicycling also<br />\ntakes place to some extent on roads which have been improved for bicycle com-<br />\nmuter use, and on unsigned touring routes in scenic areas, these routes are<br />\nalso listed on the trail charts and shown on the trail map. However, it should<br />\nbe recognized that the purpose of many of the bicycle-related highway im-<br />\nprovements made by the State and local governments is to meet the transporta-<br />\ntion needs of commuter cyclists. The unsigned touring routes listed in the charts<br />\nare “trails” in the sense that they follow clearly defined routes through scenic<br />\nareas of the State and are promoted as recreational and educational trails by<br />\npublic and private groups. See Trail and Hostel Information Section for further<br />\ninformation on other unsigned touring routes identified by maps, atlases or<br />\nguidebooks.<br />\n<br />\ne Cross-Country Ski trails include both trails designated for this activity and other<br />\ntrails which are available and suitable for this activity.<br />\n<br />\ne Equestrian trails include both trails designed or designated primarily for<br />\nhorseback riding and other trails which are available and suitable for this activity.<br />\n<br />\n« Fitness trails include parcours or exercise trails, and jogging paths.<br />\n<br />\n Handicapped trails are trails designed for persons with physical or visual<br />\ndisabilities.<br />\n<br />\n Hiking trails include trails for day hiking and for backpacking.<br />\n<br />\n« Historical trails follow historic routes, go through historic districts, and con-<br />\nnect historic sites. They often use existing roads or sidewalks; interpretive in-<br />\nformation is contained in a guidebook or brochure.<br />\n<br />\no Multi-Purpose trails are trails which accommodate a variety of non-motorized<br />\nuses. This category includes trails which do not fit a specific activity category.<br />\n<br />\ne Nature trails include both interpretive trails, and short trails designed primarily<br />\nfor nature observation.<br />\n<br />\n Off-Road Vehicle trails are designated specifically for off-road vehicle use.<br />\ne Snowmobile trails are designated specifically for snowmobile use.<br />\n<br />\no Water trails are water routes designated as public water trails by organiza-<br />\ntions in the State. The existing water trails are intended primarily for canoe use.<br />\nThere are numerous river and stream segments in the State which are navigable<br />\nby canoe or kayak but not specifically identified as trails. See Trail and Hostel<br />\nInformation Section for further information.<br />\n<br />\nMany trails accommodate several activities; for example, hiking trails are<br />\noften used for horseback riding and cross-country skiing. See the inventory charts<br />\nfor activity information.<br />\n<br />\nAlthough few trails are designed specifically for disabled persons, numerous<br />\ntrails are accessible to persons with disabilities. Contact the trail information<br />\nsources listed in this study for further information.<br />\n<br />\nExisting Trails<br />\n<br />\nThe Department has developed a trail classification system which<br />\ndistinguishes between trails on the basis of length, circularity, and users at-<br />\ntracted. A complete State trail system should provide opportunities for trips of<br />\nvarying time and distance. :<br />\n<br />\nLong-distance trails are linear trails which are suitable for extended journeys<br />\nwithin the State or across other states; for example, the Appalachian Trail. These<br />\ntrails attract persons from all over the State, local users, and persons from other<br />\nstates.<br />\n<br />\n~ FEDERAL TRAIL AND HOSTEL ACTIVITIES<br />\n<br />\nTails<br />\n<br />\nThere are a number of federal departments and agencies which either own<br />\nland and manage trails in Maryland, offer assistance and guidance in the develop-<br />\nment of trails, or have grant programs which are potential sources of financial<br />\nassistance for land acquisition and trail development. The National Park Ser-<br />\nvice (Department of Interior) is a major provider of trails in the State. These<br />\nrange from short nature trails to the 185-mile C&0 Canal Towpath. The National<br />\nPark Service also has other trail-related responsibilities which affect Maryland,<br />\nsuch as development of a management plan for the Appalachian National Scenic<br />\nTrail, studying 'groposed additions to the National Trails System, processing ap-<br />\nplications for National Recreation Trail designation, coordinating the National<br />\nTrails System Planning effort, and providing grants through the Land and Water<br />\nConservation Fund for federal and State park acquisition and development. The<br />\nm of National Park Service trail programs which affect Maryland is as<br />\n<br />\ns: . :<br />\n<br />\nCongress has authorized funds to prdtect threatened portions of the Ap-<br />\n<br />\npalachian Trail which cross private lands. In Maryland, protection responsibility<br />\nfor the Appalachian Trail has been assumed by the State. Program Open Space<br />\nfunds have been used to acquire over 7,700 acres of land on South Mountain (the<br />\nprogram goal is 10,600 acres). The State now owns about 30 miles of the 40<br />\nmiles of the Trail in Maryland. National Park Service ownership is limited to the<br />\n1.5 mile section along the C&0 Canal.<br />\n<br />\n\" The proposed Potomac Heritage Trail, which the National Park Service recom-<br />\nmended for National Scenic Trail designation in 1974, was designated by Con-<br />\n<br />\ness in 1983. In Maryland, this proposed trail would extend from Point Lookout<br />\n: hiogheny River Lake in Western Maryland,<br />\n<br />\nPark in Southern Maryland to Youg<br />\nutilizing as part of its route the existing 185-mile C&0 Canal Towpath owned<br />\nby the National Park Service. : _ :<br />\n<br />\nOver 700 National Recreation Trails had been designated through 1985. These<br />\nprovide for a variety of recreational uses in or near urban areas. Maryland cur-<br />\nrently has one National Recreation Trail, the Touch of Nature Trail in Patapsc<br />\n<br />\nlapsco<br />\nState Park. The Seawall Trail at Fort McHenry is being evaluated for National<br />\n<br />\nRecreation Trail status.<br />\n<br />\nThe National Trails System Planning Effort initiated in September, 1979, has<br />\nbeen completed; a Draft Assessment was released in June 1981. The 1981 Draft<br />\nAssessment identifies two critical needs: additional trail opportunities in or near<br />\nurban areas, and improved information about existing trail opportunities. Trail<br />\ninterest groups in Maryland indicated a need in the State for long distance trails,<br />\naquest'rian t{:i»ls, bike trails, and better utilization of abandoned rights-of-way<br />\nas trail corridors. o<br />\n<br />\nThe Rails-to-Trails Programs administered by NPS was authorized by Con-<br />\ngress in 1976 and reauthorized in 1980. This program provided matching funds<br />\nto convert abandoned rail corridors to trails. Maryland has one project which has<br />\nbeen funded under this program, the North Central rail corridor in Baltimore<br />\n<br />\nCounty. The State acquired this 20-mile corridor for a recreational trail, and<br />\n<br />\ndeveloped a 7.5 mile section in 1984.<br />\n<br />\n‘Army Corps of Engineers arou<br />\n<br />\n~ project. Trails have been developed in<br />\n<br />\nMajor loop trails are those which provide circuits of over five miles for either<br />\nday or overnight use; for example, the Elk Ridge - Applachian Trail circuit. Loop<br />\ntrails eliminate the need for backtracking or car shuttles. They are well-suited<br />\nfor weekend outings and are used by persons from most parts of the State.<br />\n<br />\nNetwork trails are systems of short trails in specific areas which may or may<br />\nnot connect. In many areas, network trails provide opportunities for circuits of<br />\nvarying lengths, and can be explored from a base such as a public campground.<br />\nSavage River State Forest is an example of an area with network trails. These<br />\ntrails are used by persons from most parts of the State, and by persons from<br />\nother states attracted to the area by related facilities such as campgrounds.<br />\n<br />\nLocal trails are those which do not form part of a major loop, network, or<br />\nlong-distance system. A short nature trail or fitness path would be an example<br />\nof local trail. These trails are mainly used by residents of the immediate area.<br />\n<br />\nMaryland currently has 3,047 miles of trail; 89 percent of this is available for<br />\npublic use. The State owns 30 percent of the total mileage, regional agen-<br />\ncies and county and municipal jurisdictions have 27 percent of the total, quasi-<br />\npublic organizations have 20 percent of the total, federal agencies have 11 per-<br />\ncent, private concerns have 11 percent, and the military has 1 percent. The trail<br />\nmap only shows those trails and trail areas which are available for public use.<br />\nMany trails on public lands are partially or fully maintained by trail clubs and<br />\nconservation groups.<br />\n<br />\nA summation of trail miles available for each activity (counting multi-use trails<br />\nmore than once) shows that Maryland has 4,254 miles of trail. Hiking tops the<br />\nlist with 1,463 miles, followed by biking with 981, equestrian with 832, historical<br />\nwith 300, cross-country ski with 257, snowmobile with 103, water trails with<br />\n108, off-road vehicle with 78, nature with 80, multi-purpose with 29, fitness with<br />\n22, and handicapped with 1. See the inventory charts for additional information<br />\non trails for specific activities.<br />\n<br />\nProminent trails in the State include a 40-mile segment of the Appalachian<br />\nTrail, a 16-mile segment of the Tuscarora - Big Blue Trail, the major portion (181<br />\nmiles) of the C&0 Canal Towpath, 231 miles of the East Coast Bicycle Trail, the<br />\n20-mile  Catoctin Trail from Gambrill State Park to Catoctin Mt. Park, the<br />\nGreen Ridge Hiking Trail in Green Ridge State Forest which joins with the C&0<br />\nCanal Towpath to form a 45-mile loop, and the 17-mile Big Savage Hiking Trail<br />\nin Savage River State Forest.<br />\n<br />\nSupport Facilities<br />\n<br />\nSupport facilities such as trail shelters, camping areas, campgrounds, trailhead<br />\nparking areas, information centers and signs facilitate recreational use of many<br />\ntrails. Existing support facilities include a chain of 5 shelters along the Ap-<br />\npalachian Trail, a chain of hiker/biker campsites along the C&0 Canal Towpath,<br />\ncampgrounds and camping areas in federal parks, state parks and other areas<br />\nwith network trails, information centers in federal and State parks, and 3 youth<br />\nhostels in or near trail areas in the State. Availability of trailhead parking varies<br />\naccording to trail area, and season. Access to the long-distance trails is generally<br />\ngood.<br />\n<br />\nAt this time, there is no statewide system for signing and blazing trails. The<br />\nclubs which maintain the Appalachian Trail use a system of white blazes for the<br />\nmain trail, blue blazes for side trails and signs at trail junctions and trailheads.<br />\nThe League of Maryland Horsemen has developed a system of horseshoe mark-<br />\nings for equestrian trails. The Maryland Park Service uses brown posts and col-<br />\nored arrows, although not all of its trails are marked this way at present. The<br />\nNational Park Service uses mileage markers (numbered posts) and occasional<br />\nsigns alotl:gdthe C&0 Canal Towpath. Other agencies and jurisdictions use their<br />\nown methods.<br />\n<br />\nSome of the trails in the State follow paths, wood roads and other corridors<br />\nwhich are not signed or marked in any way. Historical trails are described by<br />\ninterpretive guides and brochures but are usually not marked by signs. Trail users<br />\nwill find it necessary to familiarize themselves with different signing/blazing<br />\nsystems and should not always expect to find trails signed or blazed.<br />\n<br />\nHostels in Maryland<br />\n<br />\nAmerican Youth Hostels, Inc. defines a hostel as “a low cost, supervised,<br />\novernight accommodation for people traveling for health, education, and recrea-<br />\ntion.” Hostels can function as valuable support facilities for major trails or trail<br />\nareas if conveniently located. Maryland currently has 3 hostels operated by<br />\nAmerican Youth Hostels, Inc. located in Knoxville, Cambridge and Baltimore.<br />\nThe hostel in Knoxville is strategically located by the Appalachian Trail and the<br />\nC&0 Towpath. The hostel in Cambridge ties in with bicycle trails and touring<br />\nroutes on the Eastern Shore. The hostel in Baltimore opened in July, 1983, and<br />\nis close to historic sites and cultural attractions in the City.<br />\n<br />\n <br />\n<br />\nMaryland received $1.2 million in Land and Water Conservation funds in FY<br />\n1985. These funds were used for State park acquisition and development, and<br />\nhave been used for trail development in selected parks. However, the program<br />\nwill expire in 1990 unless Congress extends it. -<br />\n<br />\nThe U.S. Fish and Wildlife Service (Department of Interior) also owns land<br />\nand manages trails in Maryland. Trails are provided at two National Wildlife<br />\nRefuges on the Eastern Shore, Blackwater and Eastern Neck. These are short<br />\nnature trails provided to encourage observation of wildlife and wildlife habitat.<br />\n<br />\nThe Department of Defense owns two areas in the State which have poten-<br />\ntial for trail development. Currently, there are trails at Fort Meade (for base<br />\nresidents) and Aberdeen Proving Grounds (for public use). Lands owned % the<br />\n<br />\nYoughiogheny River Lake and the C&D Ca<br />\nare areas which have potential for trail development. |<br />\n<br />\nOther federal departments and agencies which do not manage trails in the<br />\nState but do have programs related to trail funding include the Department of<br />\nTransportation, the Department of Housing and Urban Development, the Depart-<br />\nment of Commerce, and the Environmental Protection Agency. The Department<br />\nof Transportation annually apportions funds to the State for highway construc-<br />\ntion and improvement. These funds may be used to develop bikeways and<br />\npedestrian walkways.<br />\n<br />\nThe Department of Housing and Urban Development has one grant pmgram<br />\nwhich is a potential source of funding for trail development, the Community Block<br />\nGrant Program. Harford County plans to develop a hiking/biking trail in Edgewater<br />\nVillage with funds from this program.<br />\n<br />\nThe Environmental Protection Agency (EPA) awards grants under the 1977<br />\nClean Water Act to assist local governments in building wastewater freatment<br />\nfacilities. Recreation and open space ommﬂunities must be considered in every<br />\n<br />\naryland and other states in conjunction<br />\nwith wastewater collection systems under EPA programs.<br />\n<br />\nHostels<br />\n<br />\nThe National Park Service has had a service-wide hostel policy since 1978<br />\nwhich makes hostels an integral part of park planning and general management<br />\noptions. The Park Service cooperates with American Youth Hostels, Inc., in the<br />\ndevelopment of new hostels in national parks. Legislation to promote a national<br />\nl;g;;el system without the use of federal funds was considered by Congress in<br />\n<br />\n <br />\n<br />\nThe following diseussion of trail use and needs identifies trail needs on a<br />\nm?ional and statewide basis. Demand analysis is based on the 1982 Statewide<br />\nLeisure Survey and trail inventory data collected during 1981-85.<br />\n<br />\nBicyeling<br />\n<br />\nThe State currently has 292 miles of bikeways independent of roads and 392<br />\nmiles of touring routes identified as major trails by trail groups and planners;<br />\nthese are the facilities best suited for recreational cycling. There are also 295<br />\nmiles of bikeways on roads or road shoulders which accommodate both com-<br />\nmuter cycling and recreational cycling. The 1982 Statewide Leisure Survey found<br />\nthat 15 percent of the State’s population participated in bicycle trips (as :tmposed<br />\nto short rides around the neighborhood). Demand methodology shows that be-<br />\ntween 215 and 388 total miles of bicycle trails are needed to meet existing de-<br />\nmand. Because of changes in age in the population, the total mileage needed<br />\nto meet 1990 demand is slightly less, between 212 and 383 miles. Thus, the<br />\ncurrent statewide supply is adequate.<br />\n<br />\nAnalysis on a regional basis shows that there is generally an adequate supply<br />\nof bicycle trails and routes in most regions of the State. The overall system could<br />\nbe improved by developing more trails and touring routes in the rural and scenic<br />\nregions of the State such as the Frederick, Southern Maryland, and Upper<br />\nEastern Shore regions. These regions combined only have 15 percent of the total<br />\nstatewide mileage. There is also a deficit in the Baltimore Region.<br />\n<br />\nThe State Highway Administration points out that bicycle use, particularly<br />\n<br />\nfor beginners, is often restricted by barriers such as road design and auto traffic<br />\nvolume. To encourage recreational bicycling, more bikeways are needed which<br />\nare separated from roads. Abandoned railroad rights-of-way are especially well-<br />\nsuited as locations for bikeway development. i<br />\n<br />\nHiking<br />\n<br />\nThere are currently 1,463 miles of trails available for hiking. Twenty-seven<br />\npercent of the State’s population participates in hiking. Between 1,176 and 2,117<br />\ntotal miles of hiking trails are needed by 1990. While there is a supply of hiking<br />\ntrails statewide to meet minimum needs, additional hiking trails are needed to<br />\nmeet peak hiking demand. In addition, analysis by hic region shows<br />\nthat there are large deficits in both the Baltimore and Suburban Washington<br />\nmgi(;ns. Western Maryland, with over 30 percent of the total mileage, has a large<br />\nsurplus.<br />\n<br />\nHorseback Ridi<br />\nThe State currently has 832 miles of trails available for horseback riding.<br />\n<br />\nNine percent of the State’s population participates in horseback riding. Between<br />\n<br />\n103 and 185 total miles of equestrian trails are needed to meet existing demand;<br />\n<br />\nbetween 97 and 174 total miles are needed by 1990. Thus, there is a surplus of<br />\n<br />\nequestrian trails on a statewide basis. However, equestrian groups desire more<br />\n<br />\nt':“io?;;ato-dhomo opportunities, and are working to increase the mileage in Central<br />\naryland.<br />\n<br />\nFitness Activities<br />\n<br />\nMaryland currently has 22 miles of fitness trails and 1,463 miles of trails<br />\navailable for hiking. Forty-seven percent of the State’s population participates<br />\nin jogging or walking for pleasure (data from 1978 Statewide Leisure Survey).<br />\nA total of 1,360 miles are needed to meet existing demand; 1,450 total miles<br />\n<br />\nare needed by 1990. There would appear to be a slight statewide deficit of trails<br />\n<br />\nfor fitness activities. However, many persons who jog or walk for pleasure utilize<br />\nsidewalks and road shoulders close to home. With the exception of parcours<br />\nexercise trails, there is limited need to provide additional trails specifically for<br />\nfitness activities.<br />\n<br />\nNature Walks<br />\n<br />\nThe State currently has 80 miles of trails designed primarily for nature walks.<br />\nIn addition, many of the trails available for hiking (1,463 miles) are also suitable<br />\nfor nature walks. Twenty-nine percent of the State’s population participates in<br />\nnature walks. Between 680 and 1,224 total miles of nature trails are needed to<br />\nmeet existing demand. The 1990 demand is even higher, between 757 and 1,362<br />\ntotal miles. There does not appear to be a deficit of nature trails statewide;<br />\nhowever, marking of existing trails and provision of nature trails within large<br />\nscale recreation areas such as State Parks would provide useful additions for<br />\nnature trail activities. The Frederick and Lower Eastern Shore regions have<br />\nrelatively few designated nature trails compared to the other regions in the State.<br />\n<br />\nLOCAL AND REGIONAL TRAIL ACTIVITIES<br />\n<br />\nAt the local level, a number of counties have undertaken trail planning or<br />\ncompleted trail plans. Also, many of the Local Recreation Plans prepared by<br />\nthe counties and Baltimore City during 1981-82 discuss trails. In general, the<br />\ncounties most concerned with trails are the heavily populated counties near<br />\nBaltimore and Washington, and the mountainous, rural counties of Western<br />\nMaryland, which have many of the best trail areas in the State. Several<br />\nmunicipalities have developed trails and/or trail plans. In addition, two regional<br />\nplannirf\\fg agencies and a regional tourism council have undertaken trail plan-<br />\nning efforts.<br />\n<br />\nThe status of county trail activities is as follows:<br />\n<br />\nAnne Arundel County has developed bike route system plans and has a ma-<br />\njor trail project planned, a bicycle path along the recently acquired B&A Railroad<br />\ncorridor (a 14-mile route).<br />\n<br />\nBaltimore County adopted a Bikeways Plan in 1977. The County Commission<br />\non I;hvgical Fitness has published brochures on hiking trails and bike routes<br />\nin the County.<br />\n<br />\nCalvert County plans to develop trails in three of its District Parks and to<br />\nlink large recreation areas with a network of land and water trails.<br />\n<br />\nCaroline County has identified three canoe trails and published a canoe trail<br />\nbrochure in cooperation with the Tourism Council of the Upper Chesapeake.<br />\n<br />\nCarroll County has identified existing trails in its Recreation Plan and has<br />\nestablished locational criteria for future trails.<br />\n<br />\nGarrett County has completed a study of snowmobile and cross-country ski<br />\ntrails for its Recreation Plan. The Plan identifies a need for additional trails of<br />\nboth types in the County.<br />\n<br />\nHarford County has planned a bikeway system. Three municipalities in the<br />\nCounty (Aberdeen, Bel Air, Havre de Grace) have planned their own bikeway<br />\nsystems which are coordinated with the County system. The County plans to<br />\nbuild a hiking/biking trail in Edgewater Village with Community Block Grant funds.<br />\n<br />\nHoward County, in its 1980 Recreation Plan, recommends development of<br />\na trail plan as part of its recreation planning efforts.<br />\n<br />\nMontgomery County completed a Bikeway Plan in 1979.<br />\n<br />\nPrince George’s County completed a Comprehensive Trail Plan in 1975 and<br />\nhas identified a potential route for the Potomac Heritage Trail in the County.<br />\nThe County added an equestrian addendum in 1985.<br />\n<br />\nWashington County’s Park and Open Space Plan contains an inventory of trails.<br />\nThe 1977 County Transportation Study identified existing and proposed bike routes.<br />\n<br />\n. Worcester County has identifed a 100-mile scenic bike route through the<br />\nounty.<br />\n<br />\nThe status of municipal trail activities is as follows:<br />\n<br />\nThe City of Annapolis plans to develop a bike path along the abandoned right-<br />\nof-way at Poplar Avenue.<br />\n<br />\nBaltimore City has had a Bikeway Program since 1972 which includes ex-<br />\nisting and planned commuter routes, neighborhood routes and recreational<br />\ncircuits.<br />\n<br />\nThe Town of Columbia has constructed 44 miles of paved pathways for<br />\npedestrians and bicyclists and plans to complete 85 miles by 1990.<br />\n<br />\nThe City of Frederick has an extensive trail system in its watershed which<br />\nis available for day hikes.<br />\n<br />\nThe City of Rockville has constructed bike paths and fitness trails and is<br />\ncurrently developing a Master Plan for Bikeways. City bikeways will be linked<br />\nto the County system.<br />\n<br />\nThe status of regional planning efforts is as follows:<br />\n<br />\nThe Regional Planning Council (RPC) has identified potential trails in the<br />\nBaltimore Area and conducted a study of bikeways. RPC has also published a<br />\nmap of bicycle routes in the Baltimore Area and Central Maryland.<br />\n<br />\nThe Metropolitan Washington Council of Governments has identified existing<br />\nand planned bikeways in the Washington Area.<br />\n<br />\nThe Tourism Council of the Upper Chesapeake has identified four canoe trails<br />\nand published brochures on these trails.<br />\n<br />\nOff-Road Vehicles<br />\n<br />\nThere are currently 78 miles of trails available for off-road vehicles and 103<br />\nmiles available for snowmobiling. Six percent of the State’s population uses off-<br />\nroad vehicles for recreational purposes. Between 523 and 785 total miles of off-<br />\nroad vehicle trails are needed to meet existing demand. Between 425 and 637<br />\ntotal miles are needed by 1990. There is a large deficit of off-road vehicle trails<br />\nstatewide. All the regions in the State except for Western Maryland show large<br />\ndeficits for off-road vehicle trails. The supply in Western Maryland is adequate<br />\nto meet regional needs, however, the supply is not adequate to accommodate<br />\nthe needed demand of persons from other regions of the State and from outside<br />\nthe State. The Maryland Forest and Park Service and Garrett County planners<br />\nrecommend an expanded system, particularly-for snowmobiles, to reduce over-<br />\ncrowding. Most of the existing trails are too short and fragmented to provide<br />\na high quality experience.<br />\n<br />\nCross-Country Skiing<br />\n<br />\nMaryland currently has 257 miles of trails available for cross-country skiing.<br />\nTwo percent of the su¥o% pulation partici in sldiny%elwsugn<br />\n50 and 144 total miles of cross-country ski trails are needed to meet existing<br />\ndemand; between 46 and 134 total miles are needed by 1990.<br />\n<br />\nWhile the overall supply of ski trails is adequate, the distribution is uneven;<br />\nalmost half of the mileage is in the Frederick and Western Maryland regions,<br />\nwhere the climate produces better conditions and a longer season. This area<br />\nm, itself is currently meeting the statewide demand; however, trail groups, the<br />\n<br />\naryland Forest and Park Service, and Garrett County planners would like to<br />\nsee a more extensive and diversified system in Western Maryland, particularly<br />\nmore long-distance trails. A more extensive system would help to reduce over-<br />\ncrowding during times of peak demand. Although the other regions of the State<br />\nare not as well suited climatically as Frederick and Western Maryland for cross-<br />\ncountry skiing, the identification and marking of trails in other regions of the<br />\nState would achieve a more balanced system. The Suburban Washington region<br />\nin particular shows a large deficit.<br />\n<br />\nCanoeing<br />\n<br />\nThere are currently 108 miles of designated canoe trails and numerous water<br />\nroutes navigable by canoe, kaﬁlk, or raft. Ten gercent of the State’s population<br />\nparticipates in canoeing, kayaking, or rafting. Between 120 and 263 total miles<br />\nof water routes are needed to meet existing demand. By 1990, between 104 and<br />\n228 total miles are needed. The supply of marked water trails and water routes<br />\nshould be slightly increased. The demand for water trails and routes is greatest<br />\nin the Baltimore and Suburban Washington regions.<br />\n<br />\n4<br />\n<br />\n <br />\n<br />\nQUASI-PUBLIC/PRIVATE TRAIL AND<br />\nHOSTEL ACTIVITIES<br />\n<br />\nThere are a number of private organizations and clubs in Maryland which<br />\nhave programs related to trail and hostel use. Some of the more prominent trail<br />\nand hostel programs are described below:<br />\n<br />\nAmerican Youth Hostels, Inc. currently operates three hostels in Maryland.<br />\nThe Potomac Area Council organizes weekend and summer trips for biking, hik-<br />\ning, backpacking, and canoeing, offers classes, seminars, and leadership train-<br />\ning, and sells publications, equipment, and trail guides.<br />\n<br />\nThe Audubon Naturalist Society has a Field Trip Program and Environmental<br />\nEducation Program to promote nature study. The Society also maintains nature<br />\ntrails at Woodend Estate in Montgomery County.<br />\n<br />\nThe Mason-Dixon Council of the Boy Scouts has established historic trails,<br />\nprimarily for foot travel, in Western Maryland and publishes trail guides for these<br />\nroutes. The Baltimore Area Council has identified pedestrian routes in Baltimore<br />\nwhich link the City’s historic sites; trail guides are available.<br />\n<br />\nThe C&0 Canal Association works to conserve the natural and historical en-<br />\nvironment of the C&0 Canal. Highlights of its activities include the “Level Walkers”<br />\nprogram to inspect conditions along the Canal and Towpath and the annual Justice<br />\nDouglas Reunion Hikes to commemorate the Douglas hike of 1954 which drama-<br />\ntized the need to preserve the Canal.<br />\n<br />\nThe Center Hiking Club organizes day hikes and camping trips, and works<br />\nwith other clubs on trail maintenance projects.<br />\n<br />\nThe Chesapeake Audubon Society holds field trips, nature walks, and educa-<br />\n<br />\n_ tional programs, and owns a wildlife sanctuary on the Eastern Shore.<br />\n<br />\nThe League of American Wheelmen is a national organization based in<br />\nBaltimore which works to improve bicycling opportunities through legislative<br />\naction and by providing information on affiliated clubs, touring routes and sup-<br />\nport facilities. The League also publishes a map series for the East Coast Bicy-<br />\ncle Trail.<br />\n<br />\nMaryland Historical Trails identifies routes with historical themes which can<br />\nbe traveled by foot or horse.<br />\n<br />\nThe Maryland Ornithological Society maintains seven wildlife refuges in the<br />\nState, organizes field trips to observe wildlife, and offers educational programs<br />\nrelated to conservation of wildlife and natural resources.<br />\n<br />\nThe Mountain Club of Maryland (MCM) maintains the Maryland section of<br />\nthe Tuscarora-Big Blue Trail, 9 miles of the Appalachian Trail in Maryland under<br />\nagreement with PATC, and 20 miles of trails in Gunpowder State Park. MCM also<br />\norganizes trips and outings and has explored a potential route between<br />\nCumberland and Youghiogheny River Lake for the proposed Potomac Heritage<br />\nTrail.<br />\n<br />\nThe Nature Conservancy acquires and protects ecologically significant natural<br />\nareas in the State. Currently, the Conservancy owns 17 nature preserves in<br />\nMaryland (over 6,000 acres). In most cases, these areas are open to the public;<br />\nsome areas contain short trails to encourage nature study and appreciation (for<br />\nexample, Battle Creek Cypress Swamp in Calvert County).<br />\n<br />\nThe Potomac Appalachian Trail Club (PATC) constructs and maintains trails<br />\nin the State, including the Appalachian Trail. This club also has a land acquisi-<br />\ntion program and a trail education program, rents cabins in Maryland, Virginia,<br />\nand Pennsylvania, sells maps and guidebooks, organizes trips and outings, and<br />\nconstructs and maintains trail facilities such as shelters and signs. PATC also<br />\nshares management responsibilities for the Appalachian Trail with the National<br />\nPark Service and the Maryland Department of Natural Resources and has<br />\ndeveloped a management plan for its section of the Trail.<br />\n<br />\nThe Sierra Club — Greater Baltimore Group sponsors hiking and camping<br />\ntrips as well as educational programs related to conservation.<br />\n<br />\nSugarloaf Regional Trails, a planning and historic preservation<br />\ngroup, has developed historic theme trail guides to interpret the historic land-<br />\nscape of western Montgomery County and adjacent parts of Frederick County.<br />\n<br />\nTrail Riders of Today, an equestrian group in Prince George’s and Montgomery<br />\nCounties, organizes trail rides and works to develop new trail opportunities on<br />\npublic and private lands.<br />\n<br />\nHostel Needs<br />\n<br />\nAmerican Youth Hostels (AYH), Inc. has identified the need for additional<br />\nhostels to complete a chain along the C&0 Canal. AYH has plans to open a new<br />\nhostel in Princess Anne, Somerset County, and would like to develop other new<br />\nhostels in Annapolis and the Lower Eastern Shore. The new hostel in Baltimore is<br />\nstrategically located in one of the State’s major cultural centers.<br />\n<br />\nThe Potomac Appalachian Trail Club hopes to develop a hostel or overnight<br />\nfacility for hikers in West Virginia or Virginia, near Harpers Ferry. This proposed<br />\nfacility would support both the Appalachian Trail and the C&0 Canal in Maryland.<br />\n<br />\nSupport Facilities<br />\n<br />\nIn general, trail groups surveyed for this study did not indicate dissatisfac-<br />\ntion with existing support facilities such as camping areas, trailhead parking<br />\nareas, and signs. Garrett County found that cross-country skiers would like the<br />\nState or private sector to provide more cabins near cross-country ski trails to<br />\nserve as a base for outings. The Maryland Forest and Park Service indicated<br />\nthat inadequate marking and lack of trail brochures and maps makes many of<br />\nthe forest roads and trails in Western Maryland relatively unuseable for trail ac-<br />\ntivities. The Potomac Appalachian Trail Club perceives a need for informational<br />\nsigns at trailheads along the Appalachian Trail to present information on trail<br />\netiquette, magal uses, and samr considerations. The Club supported plans by<br />\nthe National Park Service to build a walkway on the railroad bridge between<br />\nHarpers Ferry and the C&0 Canal. The walkway was completed in 1985.<br />\n<br />\nThe need for support facilities will obviously vary according to the type of<br />\ntrail, type of use, and the environment the trail crosses. At a minimum, trails<br />\nwhich are independent of roads should have adequate blazing or marking, ade-<br />\nquate parking at trailheads and access points, and accompanying information<br />\nto be obtained from guidebooks or maps. Frequently used overnight areas should<br />\nhave potable water and a latrine. Camping areas should be designated or in-<br />\ndicated as such in trail guides or maps.<br />\n<br />\nTRAIL AND HOSTEL INFORMATION<br />\n<br />\nThe Department has compiled a list of information sources to assist trail users<br />\nin planning trail outings. Included are addresses of agencies and trail groups,<br />\nand a list of specific trail and hostel guides which can be obtained from trail<br />\ngroups, outfitters, bookstores, and libraries. The numbers on the list correspond<br />\nto the numbers in the “Further Information” column on the trail charts. Find<br />\nthe trail or trail area you are interested in on the trail charts, refer to the numbers<br />\nin the “Further Information” column, and then find the corresponding numbers<br />\non the list of information sources.<br />\n<br />\nTrail users are encouraged to inform the Deraﬂmcm of corrections and addi-<br />\ntions to the trail information. This will make it possible to keep the trail map<br />\nup-to-date. Please send your comments to:<br />\nCoordinator<br />\nMaryland Department of State Planning<br />\n301 West Preston Street<br />\nBaltimore, Maryland 21201<br />\n<br />\nAdditional copies of this map can be obtained by contacting the Department<br />\nat the above address.<br />\n<br />\n1. American Bicycle Atlas 1981 by Dave Gilbert<br />\n2. American Youth Hostels Handbook by American Youth Hostels, Inc.<br />\n<br />\n3. eppalachlan Trail Data Book by Raymond Hunt, Jr., and Appalachian Trail<br />\non<br />\n<br />\nference<br />\n<br />\n4. Appalachian Trail: Susquehanna River to Shenandoah National Park (1979)<br />\nby Appalachian Trail Conference ;<br />\n<br />\n5. Appalachian Waters 3: The Susquehanna and Ifs Tributaries (1975) by Walter<br />\nBurmeister<br />\n<br />\n6. Baltimore Area Bike Map (1985) by Regional Planning Council<br />\n7. The Baltimore Trail Book (1983) by Suzanne M. Mittenhal and Sierra Club<br />\n<br />\n8. Bicyclin%Routas in Lower Montgomery County (map) (1980) by Montgomery<br />\nCounty Department of Transportation<br />\n<br />\n9. Bicycle Routes in the Washington Area (map) (1980) by Metropolitan<br />\nWashington Council of Governments<br />\n<br />\n10. Canoeing Streams of the Potomac and Rappahannock Basins (1969) by<br />\nThomas Gray<br />\n<br />\n11.  Circling Historic Landscapes: Bicycling, Canoeing and Walking Trails near<br />\nSugarloaf Mt., Maryland (1980) by Sugarloaf Regional Trails and Maryland-<br />\nNational Capital Park and Planning Commission<br />\n<br />\n12.  Circuit Hikes in Virginia, West Virginia, Maryland and Pennsylvania (1981)<br />\nby Jean Golightly and Potomac Appalachian Trail Club<br />\n<br />\n13. A Collection of Maps of the C&0 Canal (1977) by William Clague<br />\n14. Country Walks near Baltimore (1981) by Alan Fisher<br />\n15. Greater Washington Area Bicycle Atlas (1974) by Alan Berkowitz<br />\n<br />\n16. A Guide to the East Coast Bicycle Trail (1981) by League of American<br />\nWheelmen<br />\n<br />\n17.  Guide to the North Point Historic Trail (1982) by J. A. Chriest, 27 Township<br />\nRoad, Dundalk, MD 21222<br />\n<br />\n18. Guide to the Tuscarora Trail in Pennsylvania and Maryland (1979) by<br />\nKeystone Trails Association<br />\n<br />\n19.  Hikes in the Washington Region, Part A: Montgomery, Frederick, and Carroll<br />\nCounties in Maryland (1981) by Potomac Appalachian Trail Club<br />\n<br />\nHiking Trails in the Mid-Atlantic States (1976) by Edward Garvey<br />\n<br />\n20.<br />\n21.  Maryland and Delaware Canoe Trails (1983) by Edward Gertler<br />\n22. Maryland Countryside Canoe Trails by Bill Robinson<br />\n<br />\n23<br />\n<br />\nNatural Washington (1980) by Bill and Phyllis Thomas<br />\n24.  Nearby Canoeing Streams (1981) by Ron and Kathy Canter<br />\n<br />\nFUTURE TRAILS AND HOSTELS<br />\n<br />\n <br />\n<br />\nTrail Locational Criteria<br />\n<br />\nDevelopment of future trails should be guided by previously stated planning<br />\nobjectives in the State’s Recreation and Open Space Plan, the analysis of statewide<br />\nand regional trail surpluses and deficits contained in this study, identification<br />\nof trail needs in the Local Recreation Plans prepared by the counties, and iden-<br />\ntification of trail needs by trail groups across the State.<br />\n<br />\nCurrently, there is an adequate supply of trails in the State to meet minimum<br />\nneeds for all activities except off-road vehicle and snowmobile use. However,<br />\nthe distribution of the nonmotorized trail mileage is unbalanced, resulting in<br />\ntrail deficits for some activities in certain regions of the State. The largest deficits<br />\nare for hiking trails in the Baltimore and Suburban Washington regions. There<br />\nis a statewide deficit of trails for off-road vehicles and snowmobiles; Westem<br />\nMaryland is the only region with a supply to meet minimum needs.<br />\n<br />\nExisting corridors such as abandoned rail lines, utility rights-of-way, stream<br />\nvalleys, wood roads, and waterways are potential locations for trail development.<br />\nExisting efforts to acquire or develop these corridors for public trail use should<br />\nbe continued. The continued publication by trail interest groups of information<br />\non unmarked or undesignated trails, bikes touring routes and waterways will<br />\nalso assist in the provision of future opportunities.<br />\n<br />\nProposed Trails<br />\n<br />\nThere are a number of specific actions which should be undertaken to round<br />\nout and unify the existing network of trails in the State. The system of long-<br />\ndistance trails would be enhanced by completing the Potomac Heritage Trail<br />\nin Maryland. This would involve developing a trail or bicycle route from Point<br />\nLookout to the C&0 Canal terminus in Washington and a trail or bicycle route<br />\nfrom Cumberland to Youghiogheny River Lake. Prince George’s County has already<br />\nidentified a route for the Potomac Heritage Trail in the County which utilizes<br />\nexisting bikeways. This proposal could serve as a starting point for future plan-<br />\nning efforts to complete this trail.<br />\n<br />\nDevelopment of other proposed trails in Maryland is important. These in-<br />\nclude plans by the Army Corps of Engineers for a trail system around the Maryland<br />\nportion of Youghiogheny River Lake, Potomac Appalachian Trail Club trails which<br />\nwill link Catoctin Park with the Appalachian Trail, and Sugarloaf Mountain with<br />\nthe C&0 Canal and Little Bennett Regional Park (Montgomery County), the utiliza-<br />\ntion of abandoned railroad lines and utility rights-of-way in the Baltimore area<br />\nas recommended by the Regional Planning Council, Anne Arundel County’s plans<br />\nto develop a 14-mile trail along the abandoned B&A Railroad line, and trail<br />\ndevelopment on the section of the abandoned North Central Railroad line in<br />\nBaltimore County from Monkton north to the Pennsylvania border. Many of the<br />\ncounties and municipalities have developed trail or bikeway plans with proposals<br />\nfor specific trails. Important additions to local trail systems are anticipated as a<br />\nresult of these planning efforts.<br />\n<br />\nThe Coastal Resources Division of the Department of Natural Resources has<br />\nidentified potential trail areas through the Bay Access Park Study. Most of the<br />\npotential areas would have to be acquired by the public sector before being used<br />\nfor trail activities. The Study identified sixteen potential trail areas in six coun-<br />\nties adjacent to the Chesapeake Bay.<br />\n<br />\nThe Maryland Forest and Park Service has long-range plans to expand the<br />\ntrail system in Savage River State Forest and to locate a new trail along Backbone<br />\nMountain in Potomac State Forest.<br />\n<br />\nMaryland’s existing trail system is characterizied by isolated networks of trails<br />\nin recreation activity centers. Connector trails between these networks or to long-<br />\ndistance trails would result in a more unified, accessible trail system. There<br />\nis also a shortage of loop trails suitable for overnight or weekend backpacking<br />\ntrips. Development of additional loop trails with opportunities for primitive camp-<br />\ning will ease some of the use pressures on popular trails such as the Appalachian<br />\nTrail. The new 45-mile loop trail in Green Ridge State Forest is a good example<br />\nof how existing trails can be linked to form a major loop trail.<br />\n<br />\nCompared to nearby states, Maryland has a deficiency of National Recrea-<br />\ntion Trails. Trail providers should identify trails in or near urban areas which<br />\nmeet the criteria for National Recreation Trail status. The State, in particular,<br />\nshould assess existing trails on State lands near Baltimore, Washington, and<br />\nFrederick. National Recreation Trail status does not bring financial assistance,<br />\nbut does publicize the trail and helps to promote the National Trails System.<br />\n<br />\nPlanners and trail groups have also identified other potential trails which<br />\nremain in the conceptual stage and may have limited feasibility. They include<br />\na trail to follow the Patuxent River from its source to the Bay, a bicycle loop<br />\ntrail around the Chesapeake Bay, a trail along the abandoned B&0 Line from<br />\nWeverton to Roxbury in Washington County, a trail in Garrett County from the<br />\nPotomac State Forest southwest to the Monogahela National Forest in West<br />\nVirginia, and two historical trails in Garrett County, Braddock’s Road and<br />\n<br />\n* McCullough’s Pack Horse Path.<br />\n<br />\n25. 184 Miles of Advehture: Hikers Guide to the C&0 Canal. Boy Scouts of<br />\nAmerica, Mason-Dixon Council<br />\n<br />\n26. The Potomac River and the C&0 Canal. Five Strip Maps, Géargelawn to<br />\nAntietam Creek (1978). Interstate Commission on the Potomac River Basin,<br />\n1055 First Street, Rockville, Maryland 20850<br />\n<br />\n21. Potomac Trail Book (1972) by Robert Shosteck<br />\n<br />\n28.  River and Trails: Bicycle Touring, Backpacking and Canoeing in the Mid-<br />\nAtlantic States (1978) by David Gilbert !<br />\n<br />\n29. Towpath Guide to the C&0 Canal (4 volumes) by Thomas Hahn<br />\n<br />\n30. USG.S. Toeonraphic Mggs Distribution Section, 1200 South Eads Street,<br />\nArlington, Virginia 222<br />\n<br />\n31.  American Hiking Society, 1701 18th Street, N.W. Washington, D.C. 20009<br />\n<br />\n32. American Youth Hostels, Inc., Potomac Area Council, 1332 | Street, N.W.,<br />\n<br />\nWashington, D.C. 20005<br />\n12\\ pagachian Trail Conference, P.0. Box 807, Harpers Ferry, West Virginia<br />\n<br />\nAudobon Naturalist Society, 8940 Jones Mill Road, Washington, D.C. 20815<br />\n<br />\nBoy Scouts of America,701 Wyman Park Drive, Baltimore, Maryland 21211<br />\n<br />\n33<br />\n34<br />\n<br />\n- 35.  Baltimore Area Trails Council, 208 Brandon Road, Baltimore, Maryland 21212<br />\n36<br />\n37<br />\n<br />\nBoy Scouts of America, Mason-Dixon Council P.0. Box 2133 Hagerstown,<br />\nMaryland 21740 |<br />\n<br />\n38. C&O0 Canal Association, 104 Valley Road, Brookmont, Maryland 20016<br />\n39. Canoe Cruisers Association, P.O. Box 572, Arlington, Virginia 22216 |<br />\n<br />\n40. Capital Hiking Club, 5108 Boulder Drive, Oxon Hill, Maryland 20021<br />\n<br />\nFuture Hostels<br />\n<br />\nDevelopment of future hostels should be guided by previously stated policies<br />\ncontained in the Maryland Recreation and Open Space Plan.<br />\n<br />\nAt present, the proposed network is only partially complete. Additional hostels<br />\nare needed to tie in with existing long-distance trails such as the C&0 Canal.<br />\n<br />\nPriority should be given to the development of additional hostels to com-<br />\nplete the chain along the C&0 Canal and to support the East Coast Bicycle Trail.<br />\nFor the C&0 Canal, potential locations for new hostels are Seneca, Williamsport,<br />\nand Hancock. The 1976 General Plan for the Canal recommends hostels at 30-mile<br />\nintervals along the towpath.<br />\n<br />\nThe East Coast Bicycle Trail could be supported by one or more hostels. Hostels<br />\nalong this trail should be located so as to be accessible to either Baltimore,<br />\nAnnapolis, or the proposed Potomac Heritage Trail in Southern Maryland.<br />\n<br />\nThe Appalachian Trail has a chain of overnight shelters and campsites, and<br />\npasses the existing hostel at Knoxville. Trail groups feel that development of<br />\nan overnight facility in or near Harpers Ferry would benefit travelers on both<br />\nthe Appalachian Trail and the C&0 Canal. The Tuscarora-Big Blue Trail would<br />\nbenefit from a new hostel along the C&0 Canal Towpath in the vicinity of Han-<br />\ncock. Private organizations such as American Youth Hostels will continue to be<br />\nthe key force behind hostel development in the State.<br />\n<br />\nImplementation<br />\n<br />\nCoordination of federal, State, local and private trail and hostel programs<br />\nis essential to the expansion and unification of Maryland’s trail and hostel systems.<br />\nSpecific actions which should be taken by each sector include:<br />\n<br />\nFederal<br />\n<br />\n1) Federal agencies should continue to provide trails in national parks, bat-<br />\ntiefields, wildlife refuges and military lands with the assistance of trail<br />\ninterest groups.<br />\n<br />\n2) The U.S. Army Corps of Engineers should continue to cooperate with trail<br />\ninterest groups in developing the Potomac Heritage Trail and other trails<br />\nat Youghiogheny River Lake.<br />\n<br />\n3) The National Park Service should continue its management responsibilities<br />\nfor the Appalachian Trail in cooperation with the Department of Natural<br />\nResources and the Potomac Appalachian Trail Club. NPS should continue<br />\nthe National Recreation Trails program and should finalize the 1980-81<br />\nNationwide Trails Assessment to serve as a guide for trail development<br />\nefforts nationwide. ;<br />\n<br />\n4<br />\n<br />\ne<br />\n<br />\nCongress should extend the Land and Water C.F. Program beyond 1990,<br />\nor authorize a new program.<br />\n<br />\n5) Congress should enact hostel legislation to support the acquisition or<br />\ndevelopment of hostel facilities.<br />\n<br />\n6) Congress should continue to fund federal programs which assist bikeway<br />\nconstruction and promote bicycle use.<br />\n<br />\nState<br />\n<br />\n1) The State should continue to utilize Program Open Space funds to ac-<br />\nquire the Appalachian Trail Corridor and side trails on South Mountain,<br />\nand potgntial trail segments to complete existing corridors and link trails<br />\nstatewide.<br />\n<br />\n2) State agencies should continue to provide trails on State lands and con-<br />\ntinue to cooperate with trail interest groups in trail maintenance and<br />\ndevelopment. Trail groups indicated a desire to develop a more exten-<br />\nsive system of cross-country ski trails on State lands in Western Maryland.<br />\n<br />\n3) The State Highway Administration should continue to develop bikeways<br />\nand continue its bicycle information program. Bicycle clubs indicated sup-<br />\nport for giving priority to unsigned improvements to roadways or shoulders.<br />\n<br />\n4) The Department of State Planning should maintain and update a statewide<br />\ninventory of trails and should continue to identify trail needs in the State<br />\nRecreation Plan.<br />\n<br />\n5) The Department of Natural Resources should investigate the feasibility<br />\ngf developing a scenic trail along Backbone Mountain in Potomac State<br />\norest.<br />\n<br />\n41. g?_t,gﬁtin Valley Snowmaobilers, Inc., 101 Park Avenue, Mount Airy, Maryland<br />\n42. ggg;r Hiking Club, 780 Fairview Avenue, #506, Takoma Park, Maryland<br />\n<br />\n43. Citizens Bike Committee, Montgomery County, 2005 Forest Hill Drive, Silver<br />\nSpring, Maryland 20903<br />\n<br />\n44. Cycling East Newspaper (Off Road Vehicles), P0. Box 58, Owings Mills,<br />\nMaryland 21117<br />\n<br />\n45. Deep Creek Lake Snowdrifters, Route 4, Box 104, Oakland, Maryland 21550<br />\n46. East Coast Bicycle Congress, 333 E. 25th Street, Baltimore, Maryland 21218<br />\n<br />\n47. g%r231 ?couts of Central Maryland, 730 W. 40th Street, Baltimore, Maryland<br />\n<br />\n48. Greater Baltimore Canoe Club, P.0. Box 591, Ellicott City, Maryland 21043<br />\n<br />\n49. League of American Wheelman, 6707 Whitestone Road, Baltimore, Mary-<br />\nland 21207.<br />\n<br />\n50. ggs;le of Maryland Horsemen, 3612 Cedar Drive, Baltimore, Maryland<br />\n<br />\n51. Maryland Association of Bicycle Organizations, 516 Cathedral sw,<br />\nBaltimore, Maryland 21202<br />\n<br />\n52. %and Historical Trails, 106 Country Club Drive, Glen Burnie, Maryland<br />\n<br />\n53. Maryland Ornithological Society, 4915 Greenspring Avenue, Baltimore,<br />\nMaryland 21209 ,<br />\n<br />\n54. Mountain Club of Maryland, 14 Solar Circle, Baltimore, Maryland 21234<br />\n<br />\n55. Nature Conservancy, Maryland Chapter, 35 Wisconsin Circle, Suite 304,<br />\nChevy Chase, Maryland 20015<br />\n<br />\n56. Oxon Hill Bicycle and Trail Club, PO. Box 81, Oxon Hill, Maryland 20745<br />\n<br />\n <br />\n<br />\n6) The Department of Natural Resources should complete the North Central<br />\nRailroad Trail in Baltimore County.<br />\n<br />\n7) The Department of Natural Resources should selectively designate some<br />\nadditional trails and areas for off-road vehicle and snowmobile use. Ex-<br />\nisting trails should be lengthened and connected where possible. However,<br />\nthe State simply does not have enough land to make it possible to pro-<br />\nvide many more additional areas and trails without interfering with other<br />\nrecreational uses. Also, the potential for environmental damage associated<br />\nwith off-road vehicle use further restricts the number of areas the State<br />\ncan provide. One way to increase opportunities for off-road vehicle use<br />\nis to improve opportunities on quasi-public and private lands.<br />\n<br />\n8) The Department of Natural Resources should identify potential National<br />\nRecreation Trails on State lands near urban areas.<br />\n<br />\nRegional<br />\n<br />\n1) Regional agencies should continue to identify trail opportunities and<br />\npublish trail information for public use.<br />\n<br />\nLocal<br />\n<br />\n1) Local agencies should continue trail planning and development efforts<br />\nwith particular emphasis on bikeway programs, nature trails and parcours<br />\nexercise trails.<br />\n<br />\n2) Local agencies should consider trails in development plans for new parks<br />\nand acquire potential trail corridors and routes whenever possible.<br />\n<br />\n3) Local agencies should cooperate with trail interest groups in providing<br />\ntrail opportunities on city and county lands.<br />\n<br />\n4) Local agencies should consider designating suitable river and stream<br />\nsegments as water trails.<br />\n<br />\nPrivate in Cooperation with State, Federal and Local<br />\n<br />\n1) Trail groups should continue to build and maintain trails on public and<br />\nprivate lands, particularly in areas where few trails exist.<br />\n<br />\n2) Trail groups should continue to publish and sell to the public informa-<br />\ntion on existing trails which are marked and designated, and informa-<br />\ntion on trail opportunities on corridors and waterways not marked or<br />\ndesignated as trails.<br />\n<br />\n3) Trail groups should explore possible routes for the Potomac Heritage Trail<br />\nin southern and western Maryland.<br />\n<br />\n4) Trail groups should explore ways to create additional loop trails for over-<br />\nnight use.<br />\n<br />\n5) Private groups should continue to provide and develop hostels in or near<br />\ntrail corridors and trail areas.<br />\n<br />\n6) Private groups should continue to promote legislation to stimulate trail<br />\nand hostel development nationwide.<br />\n<br />\n7) Trail groups should continue education programs, trail patrols and other<br />\nprojects designed to minimize conflicts between activities, reduce van-<br />\ndalism and illegal uses, and minimize environmental impacts in trail areas.<br />\n<br />\n8) Off-road vehicle clubs should seek to negotiate use agreements with<br />\nprivate landowners to create additional opportunities for off-road vehicle<br />\nand snowmobile use.<br />\n<br />\n9) Private enterprises such as vacation lodges and recreation farms should<br />\nprovide additional opportunities for snowmobiling and off-road vehicle use.<br />\n<br />\n10) The A.T. Conference and the National Park Service should complete a<br />\nmanagement plan for the Potomac Heritage Trail.<br />\n<br />\n57.  Potomac Appalachian Tail Club, 1718 N Street, N.W., Washington, D.C.<br />\n58. gar;g Club, Baltimore Chapter, P.0. Box 135, Riderwood, Maryland<br />\n<br />\n59. St. Mary’s Trail Club, 108 Elliott Court, California, Maryland 20619<br />\n<br />\n60. Washington Area Bicyclist Association, 1332 | Street, N.W., Room 441,<br />\nWashington, D.C. 20005<br />\n<br />\n61. Bicycle Coordinator, State Highway Administration, 707 N. Calvert Street,<br />\nBaltimore, Maryland 21202<br />\n<br />\n- 62. Capital Programs Administration, Land and Property Management, Depart-<br />\n<br />\nment of Natural Resources, Tawes State Office Building, Annapolis,<br />\nMaryland 21401<br />\n<br />\n63. City or Municipal Recreation Department<br />\n64. County Recreation or Planning Department<br />\n<br />\n65. Maryland Department of State Planning, 301 West Preston Street, Baltimore,<br />\nMaryland 21201<br />\n<br />\n66. Maryland Forest and Park Service, Department of Natural Resources, Tawes<br />\nState Office Building, Annapolis, Maryland 21401<br />\n<br />\nMaryland Wildlife Administration, Department of Natural Resources, Tawes<br />\nState Office Building, Annapqlis, Maryland 21401<br />\n<br />\nMetropolitan Washington Council of Governments, 1875 Eye Street, N.W.,<br />\nWashington, D.C 20006<br />\n<br />\nRefuge Manager, Blackwater National Wildlife Refuge, Route 1, Box 121,<br />\nCambridge, Maryland 21613<br />\n<br />\nRefuge Manager, Eastern Neck National Wildlife Refuge, Route 2, Box 225,<br />\nRock Hall, Maryland 21661<br />\n<br />\n. gfggnal Planning Council, 2225 N. Charles Street, Baltimore, Maryland<br />\n<br />\n4]<br />\n<br />\ns<br />\n<br />\n72. Superintendent, Antietam National Battlefield, Box 158, Sharpsburg,<br />\nMaryland 21782 ,<br />\n<br />\n73. Superintendent, Assateague Island National Seashore, Route 2, Box 294,<br />\nBerlin, Maryland 21811<br />\n<br />\n74.  Superintendent, C&0 Canal National Historic Park, Box 158, Sharpsburg,<br />\nMaryland 21782<br />\n<br />\n75.  Superintendent, Catoctin Mountain Park, Thurmont, Maryland 21788<br />\n<br />\n76. Suﬂerimendent, Fort McHenry National Monument, East Fort Avenue,<br />\nBaltimore, Maryland 21230<br />\n<br />\n77.  Superintendent, Greenbelt Park, Greenbelt, Maryland 20770<br />\n<br />\n78.  Superintendent, Harpers Ferry National Historical Park, Harpers Ferry, West<br />\nVirginia 25425 _<br />\n<br />\n79. Superintendent, National Casbtal Parks — East, 1900 Anacostia Drive, S.E.,<br />\nBox 38104, Washington, D.C. 20020<br />\n<br />\n80. g%:i;m Council of the Upper Chesapeake, PO. Box 66, Centreville, Maryland<br />\n<br />\n81. U.S. Army Corps of Engineers, Pittsburgh District, 1000 Li Avenue,<br />\nPittsb:r‘gm, Pennsylvania 15222 s<br />\n<br />\n82. Washington Suburban Sanitary Commission, 4017 Hamilton Street, Hyatt-<br />\nsville, Maryland 20781<br />\n<br />\n83. County Walks near Washington (1984) by Alan Fisher. 2 Volumes.<br />\n<br />\n84. Guide to the Mason-Dixon Trail System (1985) by Mason-Dixon Trail<br />\nSystem, Inc., 2225 Marietta Avenue, Box 6146, Rohrerstown, Penn-<br />\nsylvania 17603.<br />\n<br />\n85. Hikes in the Washington Region, Part C: D.C. and Prince George’s, Charles<br />\nEr'mb(:alvart Counties in Maryland (1984) by Potomac Appalachian Trail<br />\n<br />\nub.<br />\n<br />\n86. Mason-Dixon Trail System, Inc., 2225 Marietta Avenue, Box 6146,<br />\nRohrerstown, Pennsylvania 17603.<br />\n<br />\n87. Patapsco Valley State Park, Elkridga to lichester (1983) (map) by Friends<br />\n12); uI\"‘aatapstm Valley, 2414 Westchester Avenue, Ellicott City, Maryland<br />\n<br />\n88. Trail Riders of Today, 22508 Griffith Drive, Laytonsville, Maryland 20879.<br />\n<br />\nDéaciditied usin<br />\nNeutrallzi‘<br />\n<br />\n <br />\n<br />\nPRICE $3.00<br />\n<br />\nCover: The Tow Path, C&0<br />\n<br />\nMaryland Department<br />\nof State Planning<br />\n<br />\n301 W. Preston Street<br />\nBaltimore, Maryland 21201<br />\n<br />\nPublished by<br />\n<br />\nCONSTANCE LIEDER, Secretary of Planning<br />\nEDWIN L. THOMAS, Deputy Secretary<br />\n<br />\n <br />\n<br />\nHARRY HUGHES, Governor<br />\n<br />\nSUGGESTIONS FOR USERS<br />\n<br />\n <br />\n<br />\nBicyclists should use proper safety equipment, know how to ride in traffic,<br />\nand know the contents of the State’s Safety Handbook for Bicycle and Moped<br />\nOwners. Contact the Maryland Bicycle Information Telephone Line (659-1663)<br />\nfor information and advice on these and other concerns. Hikers and backpackers<br />\nshould be prepared to deal with insects, poisonous snakes, poison ivy, severe<br />\nweather conditions, and hostile dogs. Hikers may wish to avoid public hunting<br />\nareas during the hunting season. Suggestions for Appalachian Trail Users, publish-<br />\ned by the Appalachian Trail Conference, has helpful information on equipment,<br />\nsafety precautions and trip planning. Off-road vehicle users and snowmobilers<br />\nshould know the State Rules and Regulations concerning off-road vehicles and<br />\nthe areas on State lands designated for off-road vehicle use. Contact the Maryland<br />\nDepartment of Natural Resources for information. Canoeists should be properly<br />\nequipped and know the condition and characteristics of the waterway to be<br />\ntraveled. Maryland boating regulations require personal flotation devices on all<br />\nboats. The Boating Handbook for Maryland Waters contains the State’s boating<br />\nregulations; contact the Department of Natural Resources. All trail users should<br />\nknow emergency first aid techniques, the symptoms and treatment for hypother-<br />\nmia, and the safety precautions associated with each trail activity. If in doubt,<br />\ncontact a trail group or the Red Cross.<br />\n<br />\nTrail users should respect the rights of private property owners and refrain<br />\nfrom activities which could result in the loss of access privileges for the public<br />\nto trails on private lands.<br />\n<br />\nTrail users should be aware that many trails and waterways in the State accom-<br />\nmodate several activities and that conflicts between activities may occur. Uses<br />\nof a trail which are clearly illegal should be reported to the managing agency<br />\nor trail group responsible for the trail.<br />\n<br />\nLitter has been a persistent problem on trails. Trail users should be prepared<br />\nto carry out everything they carry in and willing to clean up litter left by others.<br />\n<br />\nOvernight users in undeveloped areas should practice low impact camping<br />\ntechniques. Group size for overnight trips should be limited to 10 or less. Care<br />\nshould be taken not to pollute water sources, damage vegetation or harm wildlife.<br />\n<br />\nAt present, there is no uniform statewide system for marking and signing<br />\ntrails. Some trails are not marked or signed in any manner. Trail users will find<br />\nit necessary to familiarize themselves with a variety of blazing and signing<br />\nsystems. Many trails are described and depicted in guidebooks and maps; trail<br />\nusers will find these helpful in locating and following trails in the State. U.S.<br />\nGeological Survey topographic maps show contour lines, roads, streams, and<br />\nother features, and can be a useful tool in planning trail outings. See Trail and<br />\nHostel Information for a list of resources.<br />\n<br />\nIf you are interested in working on trail maintenance and development pro-<br />\njects in the State, contact one of the hiking clubs. They are always looking for<br />\n<br />\nT il<br />\n<br />\nJAN 2008<br />\n<br />\nb [AR) - 2<br />\n: PRESERVATION TECHNOLOGIES, L<br />\n111 Thomson Park Drive &<br />\nCranberry Township, PA 16066<br />\n(724) 779-2111<br />\n<br />\n   <br />\n   <br />\n   <br />\n<br />\nCanal National Historic Park<br />\n\f", "format": "basic_html", "processed": "<br /><br />\nPURPOSE OF STUDY AND SUMMARY OF FINDINGS<br /><br />\ni<br /><br />\nThe Statewide Trails Study is an element of Maryland’s 1983 Recreation and<br />\nOpen Space Plan. The primary purpose of the study is to identify existing trails<br />\nand make recommendations for improving trail opportunities. The study achieves<br />\nthe following objectives: ‘<br /><br />\n1) provides an inventory of trails and hostels<br /><br />\n2) provides an overview of public and private trail pmgram§<br /><br />\n3) assesses the need for additional trails by type anﬂ-geégiaphic region<br />\n4) identifies potential trail routes in the State and locations for new hostels<br />\n5) presents information on trail guides and information sources<br /><br />\n6) recommends future actions to be taken by trail and hostei providers to<br />\nincrease trail and hostel opportunities<br /><br />\nThe major findings of the study are as follows:<br /><br />\n1) Maryland has 3,047 miles of trail (see definition), of which 89 percent<br />\n(2,722 miles) is available for public use. State agencies own or provide<br />\n30 percent (928 miles) of the total mileage, more than any other trail pro-<br />\nvider in Maryland. Federal agencies, local jurisdictions and quasi-public<br />\norganizations are also important trail providers. If multi-use trails are<br />\ncounted more than once, there is actually a total of 4,254 miles of trail<br />\navailable for trail activities. There are currently three hostels in Maryland,<br />\nstrategically located to support trail activities.<br /><br />\n2) Private trail groups and conservation organizations in Maryland are ac-<br />\ntively involved in trail development and maintenance, land acquisition,<br />\ntrail education programs, publication and sales of maps and guidebooks,<br />\n‘organizing trips and outings, and providing hostels. .<br /><br />\n3) There is currently a supply of trails to meet minimum needs for all ac-<br />\ntivities except off-road vehicle and snowmobile use. However, the trail<br />\nmileage is not evenly distributed across the State, resulting in trail deficits<br />\nin some regions. There is also a need for more loop trails suitable for<br />\novernight or weekend backpacking trips. Comrared to nearby states,<br />\nMaryland has a deficiency of National Recreation Trails.<br /><br />\n4) Planning organizations and trail groups have identified a number of poten-<br />\ntial trail routes in the State. These range from long-distance trails such<br />\nas the Potomac Heritage Trail to local bikeway systems. There is poten-<br />\ntial for expanding the existing hostel system by developing new hostels<br />\nalong the C&amp;0 Canal Towpath and East Coast Bicycle Trail.<br /><br />\n5) Trail guidebooks, brochures and maps are available for the major trails<br />\nand trail areas in the State. However, there are some unmarked or<br />\nundesignated trails which are not described in the available literature.<br />\nTrail opportunities would be improved if information on lesser known trails<br />\nwere available to citizens. ,<br /><br />\nSTATE TRAIL AND HOSTEL ACTIVITIES<br /><br /><br /><br />\nTrails<br /><br />\nAt the State level, trails are developed and maintained by the Department<br />\nof Natural Resources and the Department of Transportation. In addition, the<br />\nDepartment of State Planning has responsibilities related to trail planning and<br />\ndevelopment.<br /><br />\nThe Department of State Planning conducted this Statewide Trails Study to<br />\nassess trail opportunities and needs. The Department also maintains an inven-<br />\ntory of trails in the State as an element of the Statewide Recreation Inventory<br />\nand prepares the Maryland Recreation and Open Space Plan, which establishes<br />\npolicies related to trail development in the State and contains an analysis of<br />\nthe suitability of the State’s land base for trail-oriented recreation.<br /><br />\nState trail policy calls for a unified statewide trail system that includes all<br />\ntypes of trails. Specific strategy recommendations include utilization of aban-<br />\ndoned railroad rights-of-way, designation of selected public lands for off-road<br />\nvehicle use, designing specific trails for specific uses, development of more trails<br />\non public lands and links between existing trails, and development of water trails.<br />\nIn addition, the planning objectives in the State Action Programs which relate<br />\nto trails are given high priority. These are: 1) provision of corridors for limited<br />\nrecreation uses such as bicycling, hiking, and others which relate to streams,<br />\nshorelines, and unique resource areas; 2) establishment of an interconnecting<br />\nsystem of walking, hiking, and riding trails along the ocean beach, bays, estuaries,<br />\nrivers and streams, linking activity centers.<br /><br />\nThe Department of Natural Resources acquires and manages parks, forests,<br />\nnatural areas, and wildlife management areas in the State. These areas provide<br />\na variety of trail-related recreation opportunities to the public. The Maryland Forest<br />\nand Park Service manages many of the State-owned trails and trail areas. State<br />\nparks contain a variety of trails, including hiking, biking, equestrian, nature,<br />\nand cross-country ski trails. State Natural Environmental Areas protect signifi-<br />\ncant natural resources and provide low intensity recreation opportunities. Some<br />\nof these have trails; others have potential areas for trail development.<br /><br />\nState forests are under multiple-use management and provide opportunities<br />\nfor low density dispersed recreation. Hiking, backpacking and cross-country skiing<br />\nare important trail-related activities in State forests. State forests also provide<br />\ntrails for off-road vehicle users and snowmobilers.<br /><br />\nState Wildlife Management Areas are managed by the Wildlife Administra-<br />\ntion primarily to protect and manage wildlife populations. Some trail activities<br />\nare permitted in these areas. Trail types and policies vary from area to area.<br />\nMost areas have either trails for foot travel, unpaved roads which are closed<br />\nto vehicles during certain seasons, wood roads which can accommodate foot<br />\ntravel, or a combination of these corridors. Some areas allow horsebacking riding.<br /><br />\nNatural Resource Management Areas are lands acquired by the State for a<br />\nvariety of potential natural resource uses. Interim recreational uses are allowed<br />\n~ which do not conflict with the protection of natural resources. Currently, one of<br />\nthese areas, Monocacy, contains trails. Other units should be considered as<br />\npotential areas for new trails.<br /><br />\nState use of Program Open Space funds to acquire the Appalachian Trail cor-<br />\nridor on South Mountain has resulted in State protection of about 80 percent<br />\nof the Trail in Maryland. Trail management responsibilities are shared by the<br />\nNational Park Service (NPS), the Department of Natural Resources (DNR), and<br />\nthe Potomac Appalachian Trail Club (PATC). A cooperative agreement between<br />\nDNR and PATC (1981) commits PATC to development and maintenance of the<br />\ntrail in Maryland. Overall management policies presented in the Comprehen-<br />\nsive Management Plan developed by the National Park Service stress the im-<br />\nportance of an unregimented recreational experience in a natural setting and<br />\nencourage self-reliance by trail users.<br /><br />\nProgram Open Space funds are also alloted by DNR to local jurisdictions<br />\nfor park acquisition and development. Trails have been developed in county and<br />\nlocal parks with these funds.<br /><br />\nThe State Highway Administration, Department of Transportation, is respon-<br />\nsible for bicycle-related planning and development for the State highway system,<br />\ncoordination with local and county bicycle facility development programs, and<br />\nthe coordination of intermodal aspects of bicycle transportation. The Highway<br />\nAdministration has constructed a number of bikeways, replaced storm drain grates<br />\nto improve bicycle safety, and is providing for bicycle use on the State highway<br />\nsystem via smooth surfaced highway shoulders, wide curb lanes, and other im-<br />\nprovements. Bicycle lockers at selected intermodal transfer points, a special bicy-<br />\ncle information telephone line, and a bicycle coordinator position for program<br />\ncontinuity are also included in agency’s efforts.<br /><br />\nState Hostel Program<br /><br />\nThree Hostels already exist in the State. Recommendations related to hostel<br />\ngevelowent in the State are contained in the Maryland Recreation and Open<br />\npace Plan.<br /><br />\nState hostel recommendations encourage the completion of a network of<br />\nprivately developed and maintained hostels. This could be achieved by developing<br />\na series of hostels around the Chesapeake Bay and along the Potomac River,<br />\nand by developing several hostels in Western Maryland, the general area north<br />\nof Baltimore and Washington, and in major cultural areas such as Annapolis and<br />\nBaltimore. New hostels should tie in with existing trail systems and with hostel<br />\nnetworks in adjoining states.<br /><br />\nTRAILS IN MARYLAND<br /><br />\nFor purposes of this study, a trail is a route, path, road, corridor, or right-of-<br />\nway used for recreation, education, or transportation. Although a road is usu-<br />\nally considered to be different than a trail, a road can serve as a trail in certain<br />\nsituations; for example, bicycle touring routes and historical trails both utilize<br />\nroads.<br /><br />\nTrail Types and Definitions<br />\nThe Department has identified twelve trail types, defined as follows:<br /><br />\n« Biking trails are signed facilities constructed within separate rights-of-way or<br />\nhighway rights-of-way to encourage bicycle activity, develop bicyclist skills and<br />\nprovide a recreation experience to the user. Because recreational bicycling also<br />\ntakes place to some extent on roads which have been improved for bicycle com-<br />\nmuter use, and on unsigned touring routes in scenic areas, these routes are<br />\nalso listed on the trail charts and shown on the trail map. However, it should<br />\nbe recognized that the purpose of many of the bicycle-related highway im-<br />\nprovements made by the State and local governments is to meet the transporta-<br />\ntion needs of commuter cyclists. The unsigned touring routes listed in the charts<br />\nare “trails” in the sense that they follow clearly defined routes through scenic<br />\nareas of the State and are promoted as recreational and educational trails by<br />\npublic and private groups. See Trail and Hostel Information Section for further<br />\ninformation on other unsigned touring routes identified by maps, atlases or<br />\nguidebooks.<br /><br />\ne Cross-Country Ski trails include both trails designated for this activity and other<br />\ntrails which are available and suitable for this activity.<br /><br />\ne Equestrian trails include both trails designed or designated primarily for<br />\nhorseback riding and other trails which are available and suitable for this activity.<br /><br />\n« Fitness trails include parcours or exercise trails, and jogging paths.<br /><br />\n Handicapped trails are trails designed for persons with physical or visual<br />\ndisabilities.<br /><br />\n Hiking trails include trails for day hiking and for backpacking.<br /><br />\n« Historical trails follow historic routes, go through historic districts, and con-<br />\nnect historic sites. They often use existing roads or sidewalks; interpretive in-<br />\nformation is contained in a guidebook or brochure.<br /><br />\no Multi-Purpose trails are trails which accommodate a variety of non-motorized<br />\nuses. This category includes trails which do not fit a specific activity category.<br /><br />\ne Nature trails include both interpretive trails, and short trails designed primarily<br />\nfor nature observation.<br /><br />\n Off-Road Vehicle trails are designated specifically for off-road vehicle use.<br />\ne Snowmobile trails are designated specifically for snowmobile use.<br /><br />\no Water trails are water routes designated as public water trails by organiza-<br />\ntions in the State. The existing water trails are intended primarily for canoe use.<br />\nThere are numerous river and stream segments in the State which are navigable<br />\nby canoe or kayak but not specifically identified as trails. See Trail and Hostel<br />\nInformation Section for further information.<br /><br />\nMany trails accommodate several activities; for example, hiking trails are<br />\noften used for horseback riding and cross-country skiing. See the inventory charts<br />\nfor activity information.<br /><br />\nAlthough few trails are designed specifically for disabled persons, numerous<br />\ntrails are accessible to persons with disabilities. Contact the trail information<br />\nsources listed in this study for further information.<br /><br />\nExisting Trails<br /><br />\nThe Department has developed a trail classification system which<br />\ndistinguishes between trails on the basis of length, circularity, and users at-<br />\ntracted. A complete State trail system should provide opportunities for trips of<br />\nvarying time and distance. :<br /><br />\nLong-distance trails are linear trails which are suitable for extended journeys<br />\nwithin the State or across other states; for example, the Appalachian Trail. These<br />\ntrails attract persons from all over the State, local users, and persons from other<br />\nstates.<br /><br />\n~ FEDERAL TRAIL AND HOSTEL ACTIVITIES<br /><br />\nTails<br /><br />\nThere are a number of federal departments and agencies which either own<br />\nland and manage trails in Maryland, offer assistance and guidance in the develop-<br />\nment of trails, or have grant programs which are potential sources of financial<br />\nassistance for land acquisition and trail development. The National Park Ser-<br />\nvice (Department of Interior) is a major provider of trails in the State. These<br />\nrange from short nature trails to the 185-mile C&amp;0 Canal Towpath. The National<br />\nPark Service also has other trail-related responsibilities which affect Maryland,<br />\nsuch as development of a management plan for the Appalachian National Scenic<br />\nTrail, studying 'groposed additions to the National Trails System, processing ap-<br />\nplications for National Recreation Trail designation, coordinating the National<br />\nTrails System Planning effort, and providing grants through the Land and Water<br />\nConservation Fund for federal and State park acquisition and development. The<br />\nm of National Park Service trail programs which affect Maryland is as<br /><br />\ns: . :<br /><br />\nCongress has authorized funds to prdtect threatened portions of the Ap-<br /><br />\npalachian Trail which cross private lands. In Maryland, protection responsibility<br />\nfor the Appalachian Trail has been assumed by the State. Program Open Space<br />\nfunds have been used to acquire over 7,700 acres of land on South Mountain (the<br />\nprogram goal is 10,600 acres). The State now owns about 30 miles of the 40<br />\nmiles of the Trail in Maryland. National Park Service ownership is limited to the<br />\n1.5 mile section along the C&amp;0 Canal.<br /><br />\n\" The proposed Potomac Heritage Trail, which the National Park Service recom-<br />\nmended for National Scenic Trail designation in 1974, was designated by Con-<br /><br />\ness in 1983. In Maryland, this proposed trail would extend from Point Lookout<br />\n: hiogheny River Lake in Western Maryland,<br /><br />\nPark in Southern Maryland to Youg<br />\nutilizing as part of its route the existing 185-mile C&amp;0 Canal Towpath owned<br />\nby the National Park Service. : _ :<br /><br />\nOver 700 National Recreation Trails had been designated through 1985. These<br />\nprovide for a variety of recreational uses in or near urban areas. Maryland cur-<br />\nrently has one National Recreation Trail, the Touch of Nature Trail in Patapsc<br /><br />\nlapsco<br />\nState Park. The Seawall Trail at Fort McHenry is being evaluated for National<br /><br />\nRecreation Trail status.<br /><br />\nThe National Trails System Planning Effort initiated in September, 1979, has<br />\nbeen completed; a Draft Assessment was released in June 1981. The 1981 Draft<br />\nAssessment identifies two critical needs: additional trail opportunities in or near<br />\nurban areas, and improved information about existing trail opportunities. Trail<br />\ninterest groups in Maryland indicated a need in the State for long distance trails,<br />\naquest'rian t{:i»ls, bike trails, and better utilization of abandoned rights-of-way<br />\nas trail corridors. o<br /><br />\nThe Rails-to-Trails Programs administered by NPS was authorized by Con-<br />\ngress in 1976 and reauthorized in 1980. This program provided matching funds<br />\nto convert abandoned rail corridors to trails. Maryland has one project which has<br />\nbeen funded under this program, the North Central rail corridor in Baltimore<br /><br />\nCounty. The State acquired this 20-mile corridor for a recreational trail, and<br /><br />\ndeveloped a 7.5 mile section in 1984.<br /><br />\n‘Army Corps of Engineers arou<br /><br />\n~ project. Trails have been developed in<br /><br />\nMajor loop trails are those which provide circuits of over five miles for either<br />\nday or overnight use; for example, the Elk Ridge - Applachian Trail circuit. Loop<br />\ntrails eliminate the need for backtracking or car shuttles. They are well-suited<br />\nfor weekend outings and are used by persons from most parts of the State.<br /><br />\nNetwork trails are systems of short trails in specific areas which may or may<br />\nnot connect. In many areas, network trails provide opportunities for circuits of<br />\nvarying lengths, and can be explored from a base such as a public campground.<br />\nSavage River State Forest is an example of an area with network trails. These<br />\ntrails are used by persons from most parts of the State, and by persons from<br />\nother states attracted to the area by related facilities such as campgrounds.<br /><br />\nLocal trails are those which do not form part of a major loop, network, or<br />\nlong-distance system. A short nature trail or fitness path would be an example<br />\nof local trail. These trails are mainly used by residents of the immediate area.<br /><br />\nMaryland currently has 3,047 miles of trail; 89 percent of this is available for<br />\npublic use. The State owns 30 percent of the total mileage, regional agen-<br />\ncies and county and municipal jurisdictions have 27 percent of the total, quasi-<br />\npublic organizations have 20 percent of the total, federal agencies have 11 per-<br />\ncent, private concerns have 11 percent, and the military has 1 percent. The trail<br />\nmap only shows those trails and trail areas which are available for public use.<br />\nMany trails on public lands are partially or fully maintained by trail clubs and<br />\nconservation groups.<br /><br />\nA summation of trail miles available for each activity (counting multi-use trails<br />\nmore than once) shows that Maryland has 4,254 miles of trail. Hiking tops the<br />\nlist with 1,463 miles, followed by biking with 981, equestrian with 832, historical<br />\nwith 300, cross-country ski with 257, snowmobile with 103, water trails with<br />\n108, off-road vehicle with 78, nature with 80, multi-purpose with 29, fitness with<br />\n22, and handicapped with 1. See the inventory charts for additional information<br />\non trails for specific activities.<br /><br />\nProminent trails in the State include a 40-mile segment of the Appalachian<br />\nTrail, a 16-mile segment of the Tuscarora - Big Blue Trail, the major portion (181<br />\nmiles) of the C&amp;0 Canal Towpath, 231 miles of the East Coast Bicycle Trail, the<br />\n20-mile  Catoctin Trail from Gambrill State Park to Catoctin Mt. Park, the<br />\nGreen Ridge Hiking Trail in Green Ridge State Forest which joins with the C&amp;0<br />\nCanal Towpath to form a 45-mile loop, and the 17-mile Big Savage Hiking Trail<br />\nin Savage River State Forest.<br /><br />\nSupport Facilities<br /><br />\nSupport facilities such as trail shelters, camping areas, campgrounds, trailhead<br />\nparking areas, information centers and signs facilitate recreational use of many<br />\ntrails. Existing support facilities include a chain of 5 shelters along the Ap-<br />\npalachian Trail, a chain of hiker/biker campsites along the C&amp;0 Canal Towpath,<br />\ncampgrounds and camping areas in federal parks, state parks and other areas<br />\nwith network trails, information centers in federal and State parks, and 3 youth<br />\nhostels in or near trail areas in the State. Availability of trailhead parking varies<br />\naccording to trail area, and season. Access to the long-distance trails is generally<br />\ngood.<br /><br />\nAt this time, there is no statewide system for signing and blazing trails. The<br />\nclubs which maintain the Appalachian Trail use a system of white blazes for the<br />\nmain trail, blue blazes for side trails and signs at trail junctions and trailheads.<br />\nThe League of Maryland Horsemen has developed a system of horseshoe mark-<br />\nings for equestrian trails. The Maryland Park Service uses brown posts and col-<br />\nored arrows, although not all of its trails are marked this way at present. The<br />\nNational Park Service uses mileage markers (numbered posts) and occasional<br />\nsigns alotl:gdthe C&amp;0 Canal Towpath. Other agencies and jurisdictions use their<br />\nown methods.<br /><br />\nSome of the trails in the State follow paths, wood roads and other corridors<br />\nwhich are not signed or marked in any way. Historical trails are described by<br />\ninterpretive guides and brochures but are usually not marked by signs. Trail users<br />\nwill find it necessary to familiarize themselves with different signing/blazing<br />\nsystems and should not always expect to find trails signed or blazed.<br /><br />\nHostels in Maryland<br /><br />\nAmerican Youth Hostels, Inc. defines a hostel as “a low cost, supervised,<br />\novernight accommodation for people traveling for health, education, and recrea-<br />\ntion.” Hostels can function as valuable support facilities for major trails or trail<br />\nareas if conveniently located. Maryland currently has 3 hostels operated by<br />\nAmerican Youth Hostels, Inc. located in Knoxville, Cambridge and Baltimore.<br />\nThe hostel in Knoxville is strategically located by the Appalachian Trail and the<br />\nC&amp;0 Towpath. The hostel in Cambridge ties in with bicycle trails and touring<br />\nroutes on the Eastern Shore. The hostel in Baltimore opened in July, 1983, and<br />\nis close to historic sites and cultural attractions in the City.<br /><br /><br /><br />\nMaryland received $1.2 million in Land and Water Conservation funds in FY<br />\n1985. These funds were used for State park acquisition and development, and<br />\nhave been used for trail development in selected parks. However, the program<br />\nwill expire in 1990 unless Congress extends it. -<br /><br />\nThe U.S. Fish and Wildlife Service (Department of Interior) also owns land<br />\nand manages trails in Maryland. Trails are provided at two National Wildlife<br />\nRefuges on the Eastern Shore, Blackwater and Eastern Neck. These are short<br />\nnature trails provided to encourage observation of wildlife and wildlife habitat.<br /><br />\nThe Department of Defense owns two areas in the State which have poten-<br />\ntial for trail development. Currently, there are trails at Fort Meade (for base<br />\nresidents) and Aberdeen Proving Grounds (for public use). Lands owned % the<br /><br />\nYoughiogheny River Lake and the C&amp;D Ca<br />\nare areas which have potential for trail development. |<br /><br />\nOther federal departments and agencies which do not manage trails in the<br />\nState but do have programs related to trail funding include the Department of<br />\nTransportation, the Department of Housing and Urban Development, the Depart-<br />\nment of Commerce, and the Environmental Protection Agency. The Department<br />\nof Transportation annually apportions funds to the State for highway construc-<br />\ntion and improvement. These funds may be used to develop bikeways and<br />\npedestrian walkways.<br /><br />\nThe Department of Housing and Urban Development has one grant pmgram<br />\nwhich is a potential source of funding for trail development, the Community Block<br />\nGrant Program. Harford County plans to develop a hiking/biking trail in Edgewater<br />\nVillage with funds from this program.<br /><br />\nThe Environmental Protection Agency (EPA) awards grants under the 1977<br />\nClean Water Act to assist local governments in building wastewater freatment<br />\nfacilities. Recreation and open space ommﬂunities must be considered in every<br /><br />\naryland and other states in conjunction<br />\nwith wastewater collection systems under EPA programs.<br /><br />\nHostels<br /><br />\nThe National Park Service has had a service-wide hostel policy since 1978<br />\nwhich makes hostels an integral part of park planning and general management<br />\noptions. The Park Service cooperates with American Youth Hostels, Inc., in the<br />\ndevelopment of new hostels in national parks. Legislation to promote a national<br />\nl;g;;el system without the use of federal funds was considered by Congress in<br /><br /><br /><br />\nThe following diseussion of trail use and needs identifies trail needs on a<br />\nm?ional and statewide basis. Demand analysis is based on the 1982 Statewide<br />\nLeisure Survey and trail inventory data collected during 1981-85.<br /><br />\nBicyeling<br /><br />\nThe State currently has 292 miles of bikeways independent of roads and 392<br />\nmiles of touring routes identified as major trails by trail groups and planners;<br />\nthese are the facilities best suited for recreational cycling. There are also 295<br />\nmiles of bikeways on roads or road shoulders which accommodate both com-<br />\nmuter cycling and recreational cycling. The 1982 Statewide Leisure Survey found<br />\nthat 15 percent of the State’s population participated in bicycle trips (as :tmposed<br />\nto short rides around the neighborhood). Demand methodology shows that be-<br />\ntween 215 and 388 total miles of bicycle trails are needed to meet existing de-<br />\nmand. Because of changes in age in the population, the total mileage needed<br />\nto meet 1990 demand is slightly less, between 212 and 383 miles. Thus, the<br />\ncurrent statewide supply is adequate.<br /><br />\nAnalysis on a regional basis shows that there is generally an adequate supply<br />\nof bicycle trails and routes in most regions of the State. The overall system could<br />\nbe improved by developing more trails and touring routes in the rural and scenic<br />\nregions of the State such as the Frederick, Southern Maryland, and Upper<br />\nEastern Shore regions. These regions combined only have 15 percent of the total<br />\nstatewide mileage. There is also a deficit in the Baltimore Region.<br /><br />\nThe State Highway Administration points out that bicycle use, particularly<br /><br />\nfor beginners, is often restricted by barriers such as road design and auto traffic<br />\nvolume. To encourage recreational bicycling, more bikeways are needed which<br />\nare separated from roads. Abandoned railroad rights-of-way are especially well-<br />\nsuited as locations for bikeway development. i<br /><br />\nHiking<br /><br />\nThere are currently 1,463 miles of trails available for hiking. Twenty-seven<br />\npercent of the State’s population participates in hiking. Between 1,176 and 2,117<br />\ntotal miles of hiking trails are needed by 1990. While there is a supply of hiking<br />\ntrails statewide to meet minimum needs, additional hiking trails are needed to<br />\nmeet peak hiking demand. In addition, analysis by hic region shows<br />\nthat there are large deficits in both the Baltimore and Suburban Washington<br />\nmgi(;ns. Western Maryland, with over 30 percent of the total mileage, has a large<br />\nsurplus.<br /><br />\nHorseback Ridi<br />\nThe State currently has 832 miles of trails available for horseback riding.<br /><br />\nNine percent of the State’s population participates in horseback riding. Between<br /><br />\n103 and 185 total miles of equestrian trails are needed to meet existing demand;<br /><br />\nbetween 97 and 174 total miles are needed by 1990. Thus, there is a surplus of<br /><br />\nequestrian trails on a statewide basis. However, equestrian groups desire more<br /><br />\nt':“io?;;ato-dhomo opportunities, and are working to increase the mileage in Central<br />\naryland.<br /><br />\nFitness Activities<br /><br />\nMaryland currently has 22 miles of fitness trails and 1,463 miles of trails<br />\navailable for hiking. Forty-seven percent of the State’s population participates<br />\nin jogging or walking for pleasure (data from 1978 Statewide Leisure Survey).<br />\nA total of 1,360 miles are needed to meet existing demand; 1,450 total miles<br /><br />\nare needed by 1990. There would appear to be a slight statewide deficit of trails<br /><br />\nfor fitness activities. However, many persons who jog or walk for pleasure utilize<br />\nsidewalks and road shoulders close to home. With the exception of parcours<br />\nexercise trails, there is limited need to provide additional trails specifically for<br />\nfitness activities.<br /><br />\nNature Walks<br /><br />\nThe State currently has 80 miles of trails designed primarily for nature walks.<br />\nIn addition, many of the trails available for hiking (1,463 miles) are also suitable<br />\nfor nature walks. Twenty-nine percent of the State’s population participates in<br />\nnature walks. Between 680 and 1,224 total miles of nature trails are needed to<br />\nmeet existing demand. The 1990 demand is even higher, between 757 and 1,362<br />\ntotal miles. There does not appear to be a deficit of nature trails statewide;<br />\nhowever, marking of existing trails and provision of nature trails within large<br />\nscale recreation areas such as State Parks would provide useful additions for<br />\nnature trail activities. The Frederick and Lower Eastern Shore regions have<br />\nrelatively few designated nature trails compared to the other regions in the State.<br /><br />\nLOCAL AND REGIONAL TRAIL ACTIVITIES<br /><br />\nAt the local level, a number of counties have undertaken trail planning or<br />\ncompleted trail plans. Also, many of the Local Recreation Plans prepared by<br />\nthe counties and Baltimore City during 1981-82 discuss trails. In general, the<br />\ncounties most concerned with trails are the heavily populated counties near<br />\nBaltimore and Washington, and the mountainous, rural counties of Western<br />\nMaryland, which have many of the best trail areas in the State. Several<br />\nmunicipalities have developed trails and/or trail plans. In addition, two regional<br />\nplannirf\\fg agencies and a regional tourism council have undertaken trail plan-<br />\nning efforts.<br /><br />\nThe status of county trail activities is as follows:<br /><br />\nAnne Arundel County has developed bike route system plans and has a ma-<br />\njor trail project planned, a bicycle path along the recently acquired B&amp;A Railroad<br />\ncorridor (a 14-mile route).<br /><br />\nBaltimore County adopted a Bikeways Plan in 1977. The County Commission<br />\non I;hvgical Fitness has published brochures on hiking trails and bike routes<br />\nin the County.<br /><br />\nCalvert County plans to develop trails in three of its District Parks and to<br />\nlink large recreation areas with a network of land and water trails.<br /><br />\nCaroline County has identified three canoe trails and published a canoe trail<br />\nbrochure in cooperation with the Tourism Council of the Upper Chesapeake.<br /><br />\nCarroll County has identified existing trails in its Recreation Plan and has<br />\nestablished locational criteria for future trails.<br /><br />\nGarrett County has completed a study of snowmobile and cross-country ski<br />\ntrails for its Recreation Plan. The Plan identifies a need for additional trails of<br />\nboth types in the County.<br /><br />\nHarford County has planned a bikeway system. Three municipalities in the<br />\nCounty (Aberdeen, Bel Air, Havre de Grace) have planned their own bikeway<br />\nsystems which are coordinated with the County system. The County plans to<br />\nbuild a hiking/biking trail in Edgewater Village with Community Block Grant funds.<br /><br />\nHoward County, in its 1980 Recreation Plan, recommends development of<br />\na trail plan as part of its recreation planning efforts.<br /><br />\nMontgomery County completed a Bikeway Plan in 1979.<br /><br />\nPrince George’s County completed a Comprehensive Trail Plan in 1975 and<br />\nhas identified a potential route for the Potomac Heritage Trail in the County.<br />\nThe County added an equestrian addendum in 1985.<br /><br />\nWashington County’s Park and Open Space Plan contains an inventory of trails.<br />\nThe 1977 County Transportation Study identified existing and proposed bike routes.<br /><br />\n. Worcester County has identifed a 100-mile scenic bike route through the<br />\nounty.<br /><br />\nThe status of municipal trail activities is as follows:<br /><br />\nThe City of Annapolis plans to develop a bike path along the abandoned right-<br />\nof-way at Poplar Avenue.<br /><br />\nBaltimore City has had a Bikeway Program since 1972 which includes ex-<br />\nisting and planned commuter routes, neighborhood routes and recreational<br />\ncircuits.<br /><br />\nThe Town of Columbia has constructed 44 miles of paved pathways for<br />\npedestrians and bicyclists and plans to complete 85 miles by 1990.<br /><br />\nThe City of Frederick has an extensive trail system in its watershed which<br />\nis available for day hikes.<br /><br />\nThe City of Rockville has constructed bike paths and fitness trails and is<br />\ncurrently developing a Master Plan for Bikeways. City bikeways will be linked<br />\nto the County system.<br /><br />\nThe status of regional planning efforts is as follows:<br /><br />\nThe Regional Planning Council (RPC) has identified potential trails in the<br />\nBaltimore Area and conducted a study of bikeways. RPC has also published a<br />\nmap of bicycle routes in the Baltimore Area and Central Maryland.<br /><br />\nThe Metropolitan Washington Council of Governments has identified existing<br />\nand planned bikeways in the Washington Area.<br /><br />\nThe Tourism Council of the Upper Chesapeake has identified four canoe trails<br />\nand published brochures on these trails.<br /><br />\nOff-Road Vehicles<br /><br />\nThere are currently 78 miles of trails available for off-road vehicles and 103<br />\nmiles available for snowmobiling. Six percent of the State’s population uses off-<br />\nroad vehicles for recreational purposes. Between 523 and 785 total miles of off-<br />\nroad vehicle trails are needed to meet existing demand. Between 425 and 637<br />\ntotal miles are needed by 1990. There is a large deficit of off-road vehicle trails<br />\nstatewide. All the regions in the State except for Western Maryland show large<br />\ndeficits for off-road vehicle trails. The supply in Western Maryland is adequate<br />\nto meet regional needs, however, the supply is not adequate to accommodate<br />\nthe needed demand of persons from other regions of the State and from outside<br />\nthe State. The Maryland Forest and Park Service and Garrett County planners<br />\nrecommend an expanded system, particularly-for snowmobiles, to reduce over-<br />\ncrowding. Most of the existing trails are too short and fragmented to provide<br />\na high quality experience.<br /><br />\nCross-Country Skiing<br /><br />\nMaryland currently has 257 miles of trails available for cross-country skiing.<br />\nTwo percent of the su¥o% pulation partici in sldiny%elwsugn<br />\n50 and 144 total miles of cross-country ski trails are needed to meet existing<br />\ndemand; between 46 and 134 total miles are needed by 1990.<br /><br />\nWhile the overall supply of ski trails is adequate, the distribution is uneven;<br />\nalmost half of the mileage is in the Frederick and Western Maryland regions,<br />\nwhere the climate produces better conditions and a longer season. This area<br />\nm, itself is currently meeting the statewide demand; however, trail groups, the<br /><br />\naryland Forest and Park Service, and Garrett County planners would like to<br />\nsee a more extensive and diversified system in Western Maryland, particularly<br />\nmore long-distance trails. A more extensive system would help to reduce over-<br />\ncrowding during times of peak demand. Although the other regions of the State<br />\nare not as well suited climatically as Frederick and Western Maryland for cross-<br />\ncountry skiing, the identification and marking of trails in other regions of the<br />\nState would achieve a more balanced system. The Suburban Washington region<br />\nin particular shows a large deficit.<br /><br />\nCanoeing<br /><br />\nThere are currently 108 miles of designated canoe trails and numerous water<br />\nroutes navigable by canoe, kaﬁlk, or raft. Ten gercent of the State’s population<br />\nparticipates in canoeing, kayaking, or rafting. Between 120 and 263 total miles<br />\nof water routes are needed to meet existing demand. By 1990, between 104 and<br />\n228 total miles are needed. The supply of marked water trails and water routes<br />\nshould be slightly increased. The demand for water trails and routes is greatest<br />\nin the Baltimore and Suburban Washington regions.<br /><br />\n4<br /><br /><br /><br />\nQUASI-PUBLIC/PRIVATE TRAIL AND<br />\nHOSTEL ACTIVITIES<br /><br />\nThere are a number of private organizations and clubs in Maryland which<br />\nhave programs related to trail and hostel use. Some of the more prominent trail<br />\nand hostel programs are described below:<br /><br />\nAmerican Youth Hostels, Inc. currently operates three hostels in Maryland.<br />\nThe Potomac Area Council organizes weekend and summer trips for biking, hik-<br />\ning, backpacking, and canoeing, offers classes, seminars, and leadership train-<br />\ning, and sells publications, equipment, and trail guides.<br /><br />\nThe Audubon Naturalist Society has a Field Trip Program and Environmental<br />\nEducation Program to promote nature study. The Society also maintains nature<br />\ntrails at Woodend Estate in Montgomery County.<br /><br />\nThe Mason-Dixon Council of the Boy Scouts has established historic trails,<br />\nprimarily for foot travel, in Western Maryland and publishes trail guides for these<br />\nroutes. The Baltimore Area Council has identified pedestrian routes in Baltimore<br />\nwhich link the City’s historic sites; trail guides are available.<br /><br />\nThe C&amp;0 Canal Association works to conserve the natural and historical en-<br />\nvironment of the C&amp;0 Canal. Highlights of its activities include the “Level Walkers”<br />\nprogram to inspect conditions along the Canal and Towpath and the annual Justice<br />\nDouglas Reunion Hikes to commemorate the Douglas hike of 1954 which drama-<br />\ntized the need to preserve the Canal.<br /><br />\nThe Center Hiking Club organizes day hikes and camping trips, and works<br />\nwith other clubs on trail maintenance projects.<br /><br />\nThe Chesapeake Audubon Society holds field trips, nature walks, and educa-<br /><br />\n_ tional programs, and owns a wildlife sanctuary on the Eastern Shore.<br /><br />\nThe League of American Wheelmen is a national organization based in<br />\nBaltimore which works to improve bicycling opportunities through legislative<br />\naction and by providing information on affiliated clubs, touring routes and sup-<br />\nport facilities. The League also publishes a map series for the East Coast Bicy-<br />\ncle Trail.<br /><br />\nMaryland Historical Trails identifies routes with historical themes which can<br />\nbe traveled by foot or horse.<br /><br />\nThe Maryland Ornithological Society maintains seven wildlife refuges in the<br />\nState, organizes field trips to observe wildlife, and offers educational programs<br />\nrelated to conservation of wildlife and natural resources.<br /><br />\nThe Mountain Club of Maryland (MCM) maintains the Maryland section of<br />\nthe Tuscarora-Big Blue Trail, 9 miles of the Appalachian Trail in Maryland under<br />\nagreement with PATC, and 20 miles of trails in Gunpowder State Park. MCM also<br />\norganizes trips and outings and has explored a potential route between<br />\nCumberland and Youghiogheny River Lake for the proposed Potomac Heritage<br />\nTrail.<br /><br />\nThe Nature Conservancy acquires and protects ecologically significant natural<br />\nareas in the State. Currently, the Conservancy owns 17 nature preserves in<br />\nMaryland (over 6,000 acres). In most cases, these areas are open to the public;<br />\nsome areas contain short trails to encourage nature study and appreciation (for<br />\nexample, Battle Creek Cypress Swamp in Calvert County).<br /><br />\nThe Potomac Appalachian Trail Club (PATC) constructs and maintains trails<br />\nin the State, including the Appalachian Trail. This club also has a land acquisi-<br />\ntion program and a trail education program, rents cabins in Maryland, Virginia,<br />\nand Pennsylvania, sells maps and guidebooks, organizes trips and outings, and<br />\nconstructs and maintains trail facilities such as shelters and signs. PATC also<br />\nshares management responsibilities for the Appalachian Trail with the National<br />\nPark Service and the Maryland Department of Natural Resources and has<br />\ndeveloped a management plan for its section of the Trail.<br /><br />\nThe Sierra Club — Greater Baltimore Group sponsors hiking and camping<br />\ntrips as well as educational programs related to conservation.<br /><br />\nSugarloaf Regional Trails, a planning and historic preservation<br />\ngroup, has developed historic theme trail guides to interpret the historic land-<br />\nscape of western Montgomery County and adjacent parts of Frederick County.<br /><br />\nTrail Riders of Today, an equestrian group in Prince George’s and Montgomery<br />\nCounties, organizes trail rides and works to develop new trail opportunities on<br />\npublic and private lands.<br /><br />\nHostel Needs<br /><br />\nAmerican Youth Hostels (AYH), Inc. has identified the need for additional<br />\nhostels to complete a chain along the C&amp;0 Canal. AYH has plans to open a new<br />\nhostel in Princess Anne, Somerset County, and would like to develop other new<br />\nhostels in Annapolis and the Lower Eastern Shore. The new hostel in Baltimore is<br />\nstrategically located in one of the State’s major cultural centers.<br /><br />\nThe Potomac Appalachian Trail Club hopes to develop a hostel or overnight<br />\nfacility for hikers in West Virginia or Virginia, near Harpers Ferry. This proposed<br />\nfacility would support both the Appalachian Trail and the C&amp;0 Canal in Maryland.<br /><br />\nSupport Facilities<br /><br />\nIn general, trail groups surveyed for this study did not indicate dissatisfac-<br />\ntion with existing support facilities such as camping areas, trailhead parking<br />\nareas, and signs. Garrett County found that cross-country skiers would like the<br />\nState or private sector to provide more cabins near cross-country ski trails to<br />\nserve as a base for outings. The Maryland Forest and Park Service indicated<br />\nthat inadequate marking and lack of trail brochures and maps makes many of<br />\nthe forest roads and trails in Western Maryland relatively unuseable for trail ac-<br />\ntivities. The Potomac Appalachian Trail Club perceives a need for informational<br />\nsigns at trailheads along the Appalachian Trail to present information on trail<br />\netiquette, magal uses, and samr considerations. The Club supported plans by<br />\nthe National Park Service to build a walkway on the railroad bridge between<br />\nHarpers Ferry and the C&amp;0 Canal. The walkway was completed in 1985.<br /><br />\nThe need for support facilities will obviously vary according to the type of<br />\ntrail, type of use, and the environment the trail crosses. At a minimum, trails<br />\nwhich are independent of roads should have adequate blazing or marking, ade-<br />\nquate parking at trailheads and access points, and accompanying information<br />\nto be obtained from guidebooks or maps. Frequently used overnight areas should<br />\nhave potable water and a latrine. Camping areas should be designated or in-<br />\ndicated as such in trail guides or maps.<br /><br />\nTRAIL AND HOSTEL INFORMATION<br /><br />\nThe Department has compiled a list of information sources to assist trail users<br />\nin planning trail outings. Included are addresses of agencies and trail groups,<br />\nand a list of specific trail and hostel guides which can be obtained from trail<br />\ngroups, outfitters, bookstores, and libraries. The numbers on the list correspond<br />\nto the numbers in the “Further Information” column on the trail charts. Find<br />\nthe trail or trail area you are interested in on the trail charts, refer to the numbers<br />\nin the “Further Information” column, and then find the corresponding numbers<br />\non the list of information sources.<br /><br />\nTrail users are encouraged to inform the Deraﬂmcm of corrections and addi-<br />\ntions to the trail information. This will make it possible to keep the trail map<br />\nup-to-date. Please send your comments to:<br />\nCoordinator<br />\nMaryland Department of State Planning<br />\n301 West Preston Street<br />\nBaltimore, Maryland 21201<br /><br />\nAdditional copies of this map can be obtained by contacting the Department<br />\nat the above address.<br /><br />\n1. American Bicycle Atlas 1981 by Dave Gilbert<br />\n2. American Youth Hostels Handbook by American Youth Hostels, Inc.<br /><br />\n3. eppalachlan Trail Data Book by Raymond Hunt, Jr., and Appalachian Trail<br />\non<br /><br />\nference<br /><br />\n4. Appalachian Trail: Susquehanna River to Shenandoah National Park (1979)<br />\nby Appalachian Trail Conference ;<br /><br />\n5. Appalachian Waters 3: The Susquehanna and Ifs Tributaries (1975) by Walter<br />\nBurmeister<br /><br />\n6. Baltimore Area Bike Map (1985) by Regional Planning Council<br />\n7. The Baltimore Trail Book (1983) by Suzanne M. Mittenhal and Sierra Club<br /><br />\n8. Bicyclin%Routas in Lower Montgomery County (map) (1980) by Montgomery<br />\nCounty Department of Transportation<br /><br />\n9. Bicycle Routes in the Washington Area (map) (1980) by Metropolitan<br />\nWashington Council of Governments<br /><br />\n10. Canoeing Streams of the Potomac and Rappahannock Basins (1969) by<br />\nThomas Gray<br /><br />\n11.  Circling Historic Landscapes: Bicycling, Canoeing and Walking Trails near<br />\nSugarloaf Mt., Maryland (1980) by Sugarloaf Regional Trails and Maryland-<br />\nNational Capital Park and Planning Commission<br /><br />\n12.  Circuit Hikes in Virginia, West Virginia, Maryland and Pennsylvania (1981)<br />\nby Jean Golightly and Potomac Appalachian Trail Club<br /><br />\n13. A Collection of Maps of the C&amp;0 Canal (1977) by William Clague<br />\n14. Country Walks near Baltimore (1981) by Alan Fisher<br />\n15. Greater Washington Area Bicycle Atlas (1974) by Alan Berkowitz<br /><br />\n16. A Guide to the East Coast Bicycle Trail (1981) by League of American<br />\nWheelmen<br /><br />\n17.  Guide to the North Point Historic Trail (1982) by J. A. Chriest, 27 Township<br />\nRoad, Dundalk, MD 21222<br /><br />\n18. Guide to the Tuscarora Trail in Pennsylvania and Maryland (1979) by<br />\nKeystone Trails Association<br /><br />\n19.  Hikes in the Washington Region, Part A: Montgomery, Frederick, and Carroll<br />\nCounties in Maryland (1981) by Potomac Appalachian Trail Club<br /><br />\nHiking Trails in the Mid-Atlantic States (1976) by Edward Garvey<br /><br />\n20.<br />\n21.  Maryland and Delaware Canoe Trails (1983) by Edward Gertler<br />\n22. Maryland Countryside Canoe Trails by Bill Robinson<br /><br />\n23<br /><br />\nNatural Washington (1980) by Bill and Phyllis Thomas<br />\n24.  Nearby Canoeing Streams (1981) by Ron and Kathy Canter<br /><br />\nFUTURE TRAILS AND HOSTELS<br /><br /><br /><br />\nTrail Locational Criteria<br /><br />\nDevelopment of future trails should be guided by previously stated planning<br />\nobjectives in the State’s Recreation and Open Space Plan, the analysis of statewide<br />\nand regional trail surpluses and deficits contained in this study, identification<br />\nof trail needs in the Local Recreation Plans prepared by the counties, and iden-<br />\ntification of trail needs by trail groups across the State.<br /><br />\nCurrently, there is an adequate supply of trails in the State to meet minimum<br />\nneeds for all activities except off-road vehicle and snowmobile use. However,<br />\nthe distribution of the nonmotorized trail mileage is unbalanced, resulting in<br />\ntrail deficits for some activities in certain regions of the State. The largest deficits<br />\nare for hiking trails in the Baltimore and Suburban Washington regions. There<br />\nis a statewide deficit of trails for off-road vehicles and snowmobiles; Westem<br />\nMaryland is the only region with a supply to meet minimum needs.<br /><br />\nExisting corridors such as abandoned rail lines, utility rights-of-way, stream<br />\nvalleys, wood roads, and waterways are potential locations for trail development.<br />\nExisting efforts to acquire or develop these corridors for public trail use should<br />\nbe continued. The continued publication by trail interest groups of information<br />\non unmarked or undesignated trails, bikes touring routes and waterways will<br />\nalso assist in the provision of future opportunities.<br /><br />\nProposed Trails<br /><br />\nThere are a number of specific actions which should be undertaken to round<br />\nout and unify the existing network of trails in the State. The system of long-<br />\ndistance trails would be enhanced by completing the Potomac Heritage Trail<br />\nin Maryland. This would involve developing a trail or bicycle route from Point<br />\nLookout to the C&amp;0 Canal terminus in Washington and a trail or bicycle route<br />\nfrom Cumberland to Youghiogheny River Lake. Prince George’s County has already<br />\nidentified a route for the Potomac Heritage Trail in the County which utilizes<br />\nexisting bikeways. This proposal could serve as a starting point for future plan-<br />\nning efforts to complete this trail.<br /><br />\nDevelopment of other proposed trails in Maryland is important. These in-<br />\nclude plans by the Army Corps of Engineers for a trail system around the Maryland<br />\nportion of Youghiogheny River Lake, Potomac Appalachian Trail Club trails which<br />\nwill link Catoctin Park with the Appalachian Trail, and Sugarloaf Mountain with<br />\nthe C&amp;0 Canal and Little Bennett Regional Park (Montgomery County), the utiliza-<br />\ntion of abandoned railroad lines and utility rights-of-way in the Baltimore area<br />\nas recommended by the Regional Planning Council, Anne Arundel County’s plans<br />\nto develop a 14-mile trail along the abandoned B&amp;A Railroad line, and trail<br />\ndevelopment on the section of the abandoned North Central Railroad line in<br />\nBaltimore County from Monkton north to the Pennsylvania border. Many of the<br />\ncounties and municipalities have developed trail or bikeway plans with proposals<br />\nfor specific trails. Important additions to local trail systems are anticipated as a<br />\nresult of these planning efforts.<br /><br />\nThe Coastal Resources Division of the Department of Natural Resources has<br />\nidentified potential trail areas through the Bay Access Park Study. Most of the<br />\npotential areas would have to be acquired by the public sector before being used<br />\nfor trail activities. The Study identified sixteen potential trail areas in six coun-<br />\nties adjacent to the Chesapeake Bay.<br /><br />\nThe Maryland Forest and Park Service has long-range plans to expand the<br />\ntrail system in Savage River State Forest and to locate a new trail along Backbone<br />\nMountain in Potomac State Forest.<br /><br />\nMaryland’s existing trail system is characterizied by isolated networks of trails<br />\nin recreation activity centers. Connector trails between these networks or to long-<br />\ndistance trails would result in a more unified, accessible trail system. There<br />\nis also a shortage of loop trails suitable for overnight or weekend backpacking<br />\ntrips. Development of additional loop trails with opportunities for primitive camp-<br />\ning will ease some of the use pressures on popular trails such as the Appalachian<br />\nTrail. The new 45-mile loop trail in Green Ridge State Forest is a good example<br />\nof how existing trails can be linked to form a major loop trail.<br /><br />\nCompared to nearby states, Maryland has a deficiency of National Recrea-<br />\ntion Trails. Trail providers should identify trails in or near urban areas which<br />\nmeet the criteria for National Recreation Trail status. The State, in particular,<br />\nshould assess existing trails on State lands near Baltimore, Washington, and<br />\nFrederick. National Recreation Trail status does not bring financial assistance,<br />\nbut does publicize the trail and helps to promote the National Trails System.<br /><br />\nPlanners and trail groups have also identified other potential trails which<br />\nremain in the conceptual stage and may have limited feasibility. They include<br />\na trail to follow the Patuxent River from its source to the Bay, a bicycle loop<br />\ntrail around the Chesapeake Bay, a trail along the abandoned B&amp;0 Line from<br />\nWeverton to Roxbury in Washington County, a trail in Garrett County from the<br />\nPotomac State Forest southwest to the Monogahela National Forest in West<br />\nVirginia, and two historical trails in Garrett County, Braddock’s Road and<br /><br />\n* McCullough’s Pack Horse Path.<br /><br />\n25. 184 Miles of Advehture: Hikers Guide to the C&amp;0 Canal. Boy Scouts of<br />\nAmerica, Mason-Dixon Council<br /><br />\n26. The Potomac River and the C&amp;0 Canal. Five Strip Maps, Géargelawn to<br />\nAntietam Creek (1978). Interstate Commission on the Potomac River Basin,<br />\n1055 First Street, Rockville, Maryland 20850<br /><br />\n21. Potomac Trail Book (1972) by Robert Shosteck<br /><br />\n28.  River and Trails: Bicycle Touring, Backpacking and Canoeing in the Mid-<br />\nAtlantic States (1978) by David Gilbert !<br /><br />\n29. Towpath Guide to the C&amp;0 Canal (4 volumes) by Thomas Hahn<br /><br />\n30. USG.S. Toeonraphic Mggs Distribution Section, 1200 South Eads Street,<br />\nArlington, Virginia 222<br /><br />\n31.  American Hiking Society, 1701 18th Street, N.W. Washington, D.C. 20009<br /><br />\n32. American Youth Hostels, Inc., Potomac Area Council, 1332 | Street, N.W.,<br /><br />\nWashington, D.C. 20005<br />\n12\\ pagachian Trail Conference, P.0. Box 807, Harpers Ferry, West Virginia<br /><br />\nAudobon Naturalist Society, 8940 Jones Mill Road, Washington, D.C. 20815<br /><br />\nBoy Scouts of America,701 Wyman Park Drive, Baltimore, Maryland 21211<br /><br />\n33<br />\n34<br /><br />\n- 35.  Baltimore Area Trails Council, 208 Brandon Road, Baltimore, Maryland 21212<br />\n36<br />\n37<br /><br />\nBoy Scouts of America, Mason-Dixon Council P.0. Box 2133 Hagerstown,<br />\nMaryland 21740 |<br /><br />\n38. C&amp;O0 Canal Association, 104 Valley Road, Brookmont, Maryland 20016<br />\n39. Canoe Cruisers Association, P.O. Box 572, Arlington, Virginia 22216 |<br /><br />\n40. Capital Hiking Club, 5108 Boulder Drive, Oxon Hill, Maryland 20021<br /><br />\nFuture Hostels<br /><br />\nDevelopment of future hostels should be guided by previously stated policies<br />\ncontained in the Maryland Recreation and Open Space Plan.<br /><br />\nAt present, the proposed network is only partially complete. Additional hostels<br />\nare needed to tie in with existing long-distance trails such as the C&amp;0 Canal.<br /><br />\nPriority should be given to the development of additional hostels to com-<br />\nplete the chain along the C&amp;0 Canal and to support the East Coast Bicycle Trail.<br />\nFor the C&amp;0 Canal, potential locations for new hostels are Seneca, Williamsport,<br />\nand Hancock. The 1976 General Plan for the Canal recommends hostels at 30-mile<br />\nintervals along the towpath.<br /><br />\nThe East Coast Bicycle Trail could be supported by one or more hostels. Hostels<br />\nalong this trail should be located so as to be accessible to either Baltimore,<br />\nAnnapolis, or the proposed Potomac Heritage Trail in Southern Maryland.<br /><br />\nThe Appalachian Trail has a chain of overnight shelters and campsites, and<br />\npasses the existing hostel at Knoxville. Trail groups feel that development of<br />\nan overnight facility in or near Harpers Ferry would benefit travelers on both<br />\nthe Appalachian Trail and the C&amp;0 Canal. The Tuscarora-Big Blue Trail would<br />\nbenefit from a new hostel along the C&amp;0 Canal Towpath in the vicinity of Han-<br />\ncock. Private organizations such as American Youth Hostels will continue to be<br />\nthe key force behind hostel development in the State.<br /><br />\nImplementation<br /><br />\nCoordination of federal, State, local and private trail and hostel programs<br />\nis essential to the expansion and unification of Maryland’s trail and hostel systems.<br />\nSpecific actions which should be taken by each sector include:<br /><br />\nFederal<br /><br />\n1) Federal agencies should continue to provide trails in national parks, bat-<br />\ntiefields, wildlife refuges and military lands with the assistance of trail<br />\ninterest groups.<br /><br />\n2) The U.S. Army Corps of Engineers should continue to cooperate with trail<br />\ninterest groups in developing the Potomac Heritage Trail and other trails<br />\nat Youghiogheny River Lake.<br /><br />\n3) The National Park Service should continue its management responsibilities<br />\nfor the Appalachian Trail in cooperation with the Department of Natural<br />\nResources and the Potomac Appalachian Trail Club. NPS should continue<br />\nthe National Recreation Trails program and should finalize the 1980-81<br />\nNationwide Trails Assessment to serve as a guide for trail development<br />\nefforts nationwide. ;<br /><br />\n4<br /><br />\ne<br /><br />\nCongress should extend the Land and Water C.F. Program beyond 1990,<br />\nor authorize a new program.<br /><br />\n5) Congress should enact hostel legislation to support the acquisition or<br />\ndevelopment of hostel facilities.<br /><br />\n6) Congress should continue to fund federal programs which assist bikeway<br />\nconstruction and promote bicycle use.<br /><br />\nState<br /><br />\n1) The State should continue to utilize Program Open Space funds to ac-<br />\nquire the Appalachian Trail Corridor and side trails on South Mountain,<br />\nand potgntial trail segments to complete existing corridors and link trails<br />\nstatewide.<br /><br />\n2) State agencies should continue to provide trails on State lands and con-<br />\ntinue to cooperate with trail interest groups in trail maintenance and<br />\ndevelopment. Trail groups indicated a desire to develop a more exten-<br />\nsive system of cross-country ski trails on State lands in Western Maryland.<br /><br />\n3) The State Highway Administration should continue to develop bikeways<br />\nand continue its bicycle information program. Bicycle clubs indicated sup-<br />\nport for giving priority to unsigned improvements to roadways or shoulders.<br /><br />\n4) The Department of State Planning should maintain and update a statewide<br />\ninventory of trails and should continue to identify trail needs in the State<br />\nRecreation Plan.<br /><br />\n5) The Department of Natural Resources should investigate the feasibility<br />\ngf developing a scenic trail along Backbone Mountain in Potomac State<br />\norest.<br /><br />\n41. g?_t,gﬁtin Valley Snowmaobilers, Inc., 101 Park Avenue, Mount Airy, Maryland<br />\n42. ggg;r Hiking Club, 780 Fairview Avenue, #506, Takoma Park, Maryland<br /><br />\n43. Citizens Bike Committee, Montgomery County, 2005 Forest Hill Drive, Silver<br />\nSpring, Maryland 20903<br /><br />\n44. Cycling East Newspaper (Off Road Vehicles), P0. Box 58, Owings Mills,<br />\nMaryland 21117<br /><br />\n45. Deep Creek Lake Snowdrifters, Route 4, Box 104, Oakland, Maryland 21550<br />\n46. East Coast Bicycle Congress, 333 E. 25th Street, Baltimore, Maryland 21218<br /><br />\n47. g%r231 ?couts of Central Maryland, 730 W. 40th Street, Baltimore, Maryland<br /><br />\n48. Greater Baltimore Canoe Club, P.0. Box 591, Ellicott City, Maryland 21043<br /><br />\n49. League of American Wheelman, 6707 Whitestone Road, Baltimore, Mary-<br />\nland 21207.<br /><br />\n50. ggs;le of Maryland Horsemen, 3612 Cedar Drive, Baltimore, Maryland<br /><br />\n51. Maryland Association of Bicycle Organizations, 516 Cathedral sw,<br />\nBaltimore, Maryland 21202<br /><br />\n52. %and Historical Trails, 106 Country Club Drive, Glen Burnie, Maryland<br /><br />\n53. Maryland Ornithological Society, 4915 Greenspring Avenue, Baltimore,<br />\nMaryland 21209 ,<br /><br />\n54. Mountain Club of Maryland, 14 Solar Circle, Baltimore, Maryland 21234<br /><br />\n55. Nature Conservancy, Maryland Chapter, 35 Wisconsin Circle, Suite 304,<br />\nChevy Chase, Maryland 20015<br /><br />\n56. Oxon Hill Bicycle and Trail Club, PO. Box 81, Oxon Hill, Maryland 20745<br /><br /><br /><br />\n6) The Department of Natural Resources should complete the North Central<br />\nRailroad Trail in Baltimore County.<br /><br />\n7) The Department of Natural Resources should selectively designate some<br />\nadditional trails and areas for off-road vehicle and snowmobile use. Ex-<br />\nisting trails should be lengthened and connected where possible. However,<br />\nthe State simply does not have enough land to make it possible to pro-<br />\nvide many more additional areas and trails without interfering with other<br />\nrecreational uses. Also, the potential for environmental damage associated<br />\nwith off-road vehicle use further restricts the number of areas the State<br />\ncan provide. One way to increase opportunities for off-road vehicle use<br />\nis to improve opportunities on quasi-public and private lands.<br /><br />\n8) The Department of Natural Resources should identify potential National<br />\nRecreation Trails on State lands near urban areas.<br /><br />\nRegional<br /><br />\n1) Regional agencies should continue to identify trail opportunities and<br />\npublish trail information for public use.<br /><br />\nLocal<br /><br />\n1) Local agencies should continue trail planning and development efforts<br />\nwith particular emphasis on bikeway programs, nature trails and parcours<br />\nexercise trails.<br /><br />\n2) Local agencies should consider trails in development plans for new parks<br />\nand acquire potential trail corridors and routes whenever possible.<br /><br />\n3) Local agencies should cooperate with trail interest groups in providing<br />\ntrail opportunities on city and county lands.<br /><br />\n4) Local agencies should consider designating suitable river and stream<br />\nsegments as water trails.<br /><br />\nPrivate in Cooperation with State, Federal and Local<br /><br />\n1) Trail groups should continue to build and maintain trails on public and<br />\nprivate lands, particularly in areas where few trails exist.<br /><br />\n2) Trail groups should continue to publish and sell to the public informa-<br />\ntion on existing trails which are marked and designated, and informa-<br />\ntion on trail opportunities on corridors and waterways not marked or<br />\ndesignated as trails.<br /><br />\n3) Trail groups should explore possible routes for the Potomac Heritage Trail<br />\nin southern and western Maryland.<br /><br />\n4) Trail groups should explore ways to create additional loop trails for over-<br />\nnight use.<br /><br />\n5) Private groups should continue to provide and develop hostels in or near<br />\ntrail corridors and trail areas.<br /><br />\n6) Private groups should continue to promote legislation to stimulate trail<br />\nand hostel development nationwide.<br /><br />\n7) Trail groups should continue education programs, trail patrols and other<br />\nprojects designed to minimize conflicts between activities, reduce van-<br />\ndalism and illegal uses, and minimize environmental impacts in trail areas.<br /><br />\n8) Off-road vehicle clubs should seek to negotiate use agreements with<br />\nprivate landowners to create additional opportunities for off-road vehicle<br />\nand snowmobile use.<br /><br />\n9) Private enterprises such as vacation lodges and recreation farms should<br />\nprovide additional opportunities for snowmobiling and off-road vehicle use.<br /><br />\n10) The A.T. Conference and the National Park Service should complete a<br />\nmanagement plan for the Potomac Heritage Trail.<br /><br />\n57.  Potomac Appalachian Tail Club, 1718 N Street, N.W., Washington, D.C.<br />\n58. gar;g Club, Baltimore Chapter, P.0. Box 135, Riderwood, Maryland<br /><br />\n59. St. Mary’s Trail Club, 108 Elliott Court, California, Maryland 20619<br /><br />\n60. Washington Area Bicyclist Association, 1332 | Street, N.W., Room 441,<br />\nWashington, D.C. 20005<br /><br />\n61. Bicycle Coordinator, State Highway Administration, 707 N. Calvert Street,<br />\nBaltimore, Maryland 21202<br /><br />\n- 62. Capital Programs Administration, Land and Property Management, Depart-<br /><br />\nment of Natural Resources, Tawes State Office Building, Annapolis,<br />\nMaryland 21401<br /><br />\n63. City or Municipal Recreation Department<br />\n64. County Recreation or Planning Department<br /><br />\n65. Maryland Department of State Planning, 301 West Preston Street, Baltimore,<br />\nMaryland 21201<br /><br />\n66. Maryland Forest and Park Service, Department of Natural Resources, Tawes<br />\nState Office Building, Annapolis, Maryland 21401<br /><br />\nMaryland Wildlife Administration, Department of Natural Resources, Tawes<br />\nState Office Building, Annapqlis, Maryland 21401<br /><br />\nMetropolitan Washington Council of Governments, 1875 Eye Street, N.W.,<br />\nWashington, D.C 20006<br /><br />\nRefuge Manager, Blackwater National Wildlife Refuge, Route 1, Box 121,<br />\nCambridge, Maryland 21613<br /><br />\nRefuge Manager, Eastern Neck National Wildlife Refuge, Route 2, Box 225,<br />\nRock Hall, Maryland 21661<br /><br />\n. gfggnal Planning Council, 2225 N. Charles Street, Baltimore, Maryland<br /><br />\n4]<br /><br />\ns<br /><br />\n72. Superintendent, Antietam National Battlefield, Box 158, Sharpsburg,<br />\nMaryland 21782 ,<br /><br />\n73. Superintendent, Assateague Island National Seashore, Route 2, Box 294,<br />\nBerlin, Maryland 21811<br /><br />\n74.  Superintendent, C&amp;0 Canal National Historic Park, Box 158, Sharpsburg,<br />\nMaryland 21782<br /><br />\n75.  Superintendent, Catoctin Mountain Park, Thurmont, Maryland 21788<br /><br />\n76. Suﬂerimendent, Fort McHenry National Monument, East Fort Avenue,<br />\nBaltimore, Maryland 21230<br /><br />\n77.  Superintendent, Greenbelt Park, Greenbelt, Maryland 20770<br /><br />\n78.  Superintendent, Harpers Ferry National Historical Park, Harpers Ferry, West<br />\nVirginia 25425 _<br /><br />\n79. Superintendent, National Casbtal Parks — East, 1900 Anacostia Drive, S.E.,<br />\nBox 38104, Washington, D.C. 20020<br /><br />\n80. g%:i;m Council of the Upper Chesapeake, PO. Box 66, Centreville, Maryland<br /><br />\n81. U.S. Army Corps of Engineers, Pittsburgh District, 1000 Li Avenue,<br />\nPittsb:r‘gm, Pennsylvania 15222 s<br /><br />\n82. Washington Suburban Sanitary Commission, 4017 Hamilton Street, Hyatt-<br />\nsville, Maryland 20781<br /><br />\n83. County Walks near Washington (1984) by Alan Fisher. 2 Volumes.<br /><br />\n84. Guide to the Mason-Dixon Trail System (1985) by Mason-Dixon Trail<br />\nSystem, Inc., 2225 Marietta Avenue, Box 6146, Rohrerstown, Penn-<br />\nsylvania 17603.<br /><br />\n85. Hikes in the Washington Region, Part C: D.C. and Prince George’s, Charles<br />\nEr'mb(:alvart Counties in Maryland (1984) by Potomac Appalachian Trail<br /><br />\nub.<br /><br />\n86. Mason-Dixon Trail System, Inc., 2225 Marietta Avenue, Box 6146,<br />\nRohrerstown, Pennsylvania 17603.<br /><br />\n87. Patapsco Valley State Park, Elkridga to lichester (1983) (map) by Friends<br />\n12); uI\"‘aatapstm Valley, 2414 Westchester Avenue, Ellicott City, Maryland<br /><br />\n88. Trail Riders of Today, 22508 Griffith Drive, Laytonsville, Maryland 20879.<br /><br />\nDéaciditied usin<br />\nNeutrallzi‘<br /><br /><br /><br />\nPRICE $3.00<br /><br />\nCover: The Tow Path, C&amp;0<br /><br />\nMaryland Department<br />\nof State Planning<br /><br />\n301 W. Preston Street<br />\nBaltimore, Maryland 21201<br /><br />\nPublished by<br /><br />\nCONSTANCE LIEDER, Secretary of Planning<br />\nEDWIN L. THOMAS, Deputy Secretary<br /><br /><br /><br />\nHARRY HUGHES, Governor<br /><br />\nSUGGESTIONS FOR USERS<br /><br /><br /><br />\nBicyclists should use proper safety equipment, know how to ride in traffic,<br />\nand know the contents of the State’s Safety Handbook for Bicycle and Moped<br />\nOwners. Contact the Maryland Bicycle Information Telephone Line (659-1663)<br />\nfor information and advice on these and other concerns. Hikers and backpackers<br />\nshould be prepared to deal with insects, poisonous snakes, poison ivy, severe<br />\nweather conditions, and hostile dogs. Hikers may wish to avoid public hunting<br />\nareas during the hunting season. Suggestions for Appalachian Trail Users, publish-<br />\ned by the Appalachian Trail Conference, has helpful information on equipment,<br />\nsafety precautions and trip planning. Off-road vehicle users and snowmobilers<br />\nshould know the State Rules and Regulations concerning off-road vehicles and<br />\nthe areas on State lands designated for off-road vehicle use. Contact the Maryland<br />\nDepartment of Natural Resources for information. Canoeists should be properly<br />\nequipped and know the condition and characteristics of the waterway to be<br />\ntraveled. Maryland boating regulations require personal flotation devices on all<br />\nboats. The Boating Handbook for Maryland Waters contains the State’s boating<br />\nregulations; contact the Department of Natural Resources. All trail users should<br />\nknow emergency first aid techniques, the symptoms and treatment for hypother-<br />\nmia, and the safety precautions associated with each trail activity. If in doubt,<br />\ncontact a trail group or the Red Cross.<br /><br />\nTrail users should respect the rights of private property owners and refrain<br />\nfrom activities which could result in the loss of access privileges for the public<br />\nto trails on private lands.<br /><br />\nTrail users should be aware that many trails and waterways in the State accom-<br />\nmodate several activities and that conflicts between activities may occur. Uses<br />\nof a trail which are clearly illegal should be reported to the managing agency<br />\nor trail group responsible for the trail.<br /><br />\nLitter has been a persistent problem on trails. Trail users should be prepared<br />\nto carry out everything they carry in and willing to clean up litter left by others.<br /><br />\nOvernight users in undeveloped areas should practice low impact camping<br />\ntechniques. Group size for overnight trips should be limited to 10 or less. Care<br />\nshould be taken not to pollute water sources, damage vegetation or harm wildlife.<br /><br />\nAt present, there is no uniform statewide system for marking and signing<br />\ntrails. Some trails are not marked or signed in any manner. Trail users will find<br />\nit necessary to familiarize themselves with a variety of blazing and signing<br />\nsystems. Many trails are described and depicted in guidebooks and maps; trail<br />\nusers will find these helpful in locating and following trails in the State. U.S.<br />\nGeological Survey topographic maps show contour lines, roads, streams, and<br />\nother features, and can be a useful tool in planning trail outings. See Trail and<br />\nHostel Information for a list of resources.<br /><br />\nIf you are interested in working on trail maintenance and development pro-<br />\njects in the State, contact one of the hiking clubs. They are always looking for<br /><br />\nT il<br /><br />\nJAN 2008<br /><br />\nb [AR) - 2<br />\n: PRESERVATION TECHNOLOGIES, L<br />\n111 Thomson Park Drive &amp;<br />\nCranberry Township, PA 16066<br />\n(724) 779-2111<br /><br /><br /><br /><br /><br />\nCanal National Historic Park<br />"}], "field_media_file": [{"target_id": 52357, "display": null, "description": null, "target_type": "file", "target_uuid": "c840629b-7eba-42bd-9e6e-401b94eaa0a8", "url": "http://digital.library.jhu.edu/system/files/2022-03/16194-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 16194, "target_type": "node", "target_uuid": "9ae0f36a-b911-43ca-8e76-6e37b3d14ca1", "url": "/node/16194"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "80849c12-4516-4bee-9a74-a30f57ca4125"}]}