{"mid": [{"value": 35726}], "uuid": [{"value": "a38835f6-e9b2-406a-8632-8fffaa2eff2c"}], "vid": [{"value": 35726}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:12:07+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12260-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:12:07+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:12:07+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "-a morinainmumearsmeminfatona<br />\nTHE4011}60110FKINS UNIVERSITY<br />\nBA.LTIMORE<br />\n<br />\n\fTHE JOHNS HOPKINS<br />\nUNIVERSITY,<br />\nBALTIMORE. MD.<br />\n1110111111111111.14111SINIM<br />\n<br />\nTwenty-Ninth Year. Beginning October 4th, 1904.<br />\nIRA<br />\n<br />\nRioviSP:r3, President.<br />\nDean of the College Faculty.<br />\nDean of the Medical Faculty.<br />\n<br />\nEZWAIW U. GRIVFIN,<br />\nWILLIAM 11. 'HOWELL,<br />\n<br />\nINSTRUCTION.<br />\nFor Graduate Students:<br />\nIn Philosophy and the Arts. (Coursem for<br />\ncandidates for the degree of Ph. D.)<br />\nIn Medicine. (Courses for candidates for the<br />\ndegree of M.I).; courses for physi6arts).<br />\nFor Undergraduates:<br />\nAs candidates for the degree of B. A.<br />\n(.1)<br />\nAs special students.<br />\nLibraries.<br />\nlJni vor:o.ty,<br />\nl'eabody I reititut4, .<br />\nhibrary,<br />\nLaboratories.<br />\nCherniAry.<br />\nPhysO!s,<br />\nGeology and Minerals.<br />\nZoology.,<br />\nAn<br />\nPhysiology.<br />\nPathology s.rul Bacteriology.<br />\nPha.rinacology.,<br />\nPhysiological Chemist ry.<br />\nExperillIO'fi ml<br />\n<br />\nrfly<br />\n<br />\nohologY.<br />\n<br />\nSeminaries.<br />\nGreek.<br />\nLat.in.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\npe lit icii Eeonomy.<br />\nScience.<br />\nties.<br />\nMathematics,<br />\n<br />\n120,000 volumes.<br />\n150,000 volumes.<br />\n225,000 volumes.<br />\nDirectors.<br />\nIra Reonsen.<br />\nJoseph S. ilme.s.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P, Malt<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn 1, Abel.<br />\nJohn .1. Abel<br />\nIV:thorn Oster<br />\ni;eorie 1/. Stratton<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. if. Hollander<br />\nW. W. Willoughby<br />\nFrank Morley.<br />\nJoseph S. Ames,<br />\n1. Mark Baldwin<br />\n<br />\nUndergraduate Courses( leading to B. A.)<br />\n1.<br />\n2<br />\n3.<br />\n4.<br />\n5<br />\n0.<br />\n7.<br />\n<br />\nGroups.<br />\nClassical<br />\n(the \"old college course.\")<br />\nMathematical-Physical<br />\n(leading up to engineering).<br />\nChemical-biological<br />\n(leading up to Medicine).<br />\nGeological-Biolvical.<br />\nLatin-Mathematical.<br />\nHistorieal-Political<br />\n(leading up to law).<br />\nModern Languages.<br />\nSerial Publications.<br />\n<br />\nAmerican Journal of - Mathematics (vol. XXVI).<br />\nAmerican Chemical Journal (vol. XXXII).<br />\nAmerican Journal of Philology (vol. XXV).<br />\nStudies in Historical and Political Science (vol. XXII).<br />\nModern Language Notes (vol. XIX).<br />\nMemoirs from the Biological Laboratory (vol. VI).<br />\nContributions to A sayriology (vol. V).<br />\nTerrestrial Magnetism (vol. TX).<br />\nUniversity Circular (vol. XXIV).<br />\nProgrammes of the courses offered to graduate students<br />\nin Philosophy and the Arts and in the department of Me41ieine, and also of the undergraduate or collegiate courses,<br />\nwill be sent on application to the Registrar.<br />\n<br />\nThe Johns Hopkins Press.<br />\nI.<br />\n<br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor, Quarterly. 4to, Vol<br />\ntime XXVI in progress. $5 per volume.<br />\nAmerican Chemical Journal.<br />\nI. RENISEN, Editor. Monthly. 8vo. Volume<br />\nXXXII in progress. $5 per volume.<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor.<br />\nQuarterly.<br />\n8vo. Volume XXV in progress.<br />\n$3 per<br />\nvolume.<br />\nStudies from the Biological Laboratory. 8vo. Vol.<br />\nurne V complete. $5 per volume.<br />\nStudies in Historical and Political Science.<br />\nMonthly. 8vo. Series XXII in progress.<br />\n$3<br />\nper volume.<br />\nJohns Hopkins University Circular<br />\n8vo. Vol. XXIV in progress. $1 per year.<br />\nJohns Hopkins Hospital Bulletin, Monthly. 4te<br />\nVolume XV in progress. $2 per year.<br />\nJohns Hopkins Hospital Reports. 4to. Volume<br />\nXII in progress. $5 per velum e.<br />\nContributions to Assyriology and Semitic Philology (Beitrage zur Assyriologie, etc.), Volume<br />\nV in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BRO()Ks, Editor. Volume VI in progress.<br />\n$7.50 per voliune.<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume XIX in progress. $1.50 per volume.<br />\nJournal of Experimental Medicine.<br />\nW. IT. WELCH, Editor.<br />\nBi-monthly.<br />\n8vo.<br />\nVolume VI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nHENRY M. ITURD, Editor, Quarterly. 8vo.<br />\n$5 per volume.<br />\nReports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\nTerrestrial Magnetism and Atmospheric Electricity.<br />\ni. A. BAUER, Editor. Quarterly. 8vo. Volume IX in progress. $2.50 per volume.<br />\nReprint of Economic Tracts.<br />\nJ. II, 'HOLLANDER, Editor. First Series, 1903,<br />\n$1.50. Second Series, 1904, $1.<br />\nXVII. Annual Report.<br />\nI'resented by the President of the Board of Trustees, reviewing the operations of the University during the past academic year.<br />\nXVIII. Annual Register.<br />\nGiving the list of officers and students, and stating the regulations, etc., of the University.<br />\n.Poblished at the close of the academic. year.<br />\n<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus<br />\non application.<br />\nRowland 's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings,<br />\nEditor. 1.16 pp. 4to. 50 plates. $10.00 cloth.<br />\nThe Teaching of the Apostles. Complete facsimile edition. Edited by ,I. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS. with Antile•<br />\ngomena Epistles. Edited by T. Ii. Hall. $3.00.<br />\nRibliographia Ilopkinmiensie. Part I, Philology. Parts<br />\nChemistry, Mineralogy and Geology.<br />\nParts<br />\nIV-V-VI, Physics, Agronomy and Mathematics, 8vo.<br />\n30 cents per part.<br />\nA full list of publications will be sent on application.<br />\n<br />\nCommunications in respect to exchanges and remittanoes<br />\nmay be sent to Johns Hopkins Press, Baltimore, Md.<br />\n<br />\n\fThe News-Letter<br />\nVol. IX.<br />\n<br />\nJanuary 20, 1905,<br />\n<br />\nNo. 6<br />\n<br />\nA Hard Lesson.<br />\n\"No, Frank; I do not expect you to admit<br />\nthat all men are selfish. That would be asking too much; and then, you yourself will<br />\nalways shine as a brilliant exception.\"<br />\nThe man passed the reins into his right<br />\nhand and turned to the girl quickly, with<br />\nlips compressed, and an unmistakable frown<br />\non his face. Then his mouth widened into<br />\na smile.<br />\n\"Edith, if you begin any more of your<br />\nsarcasm, I declare I'll turn the buggy into<br />\nthe ditch, and set you in those blackberry<br />\nbushes. Why on earth do you talk such rot<br />\n—pardon me, but it is rot—just when I am<br />\nenjoying myself by airing my pet little<br />\nviews? Moreover, you are scarcely respectful to your future lord and master.\"<br />\nThe girl started. \"Frank,\" she said suddenly, \"how long have we been engaged?<br />\nFour months it has been, has it not? And<br />\nwe are to be married in four weeks more.<br />\nDoes it ever occur to you that we are making rathed rapid work of it? I have sometimes thought that it might be better, after<br />\nall, if—\"<br />\n\"What might be better?\" He watched<br />\nher closely as her eyes fell to her left hand.<br />\n\"Oh, nothing;\" and he knew from the answer and the tone that coaxing would be<br />\nof no use.<br />\n\"Edith, do you see those two men in the<br />\nyellow trap just ahead? Well, the one in<br />\nthe gray clothes is Charlie Hanson, who sold<br />\nme this horse. I heard from a mutual acquaintance that he gave himself grand airs<br />\nafter the deal, because he had got the best<br />\nof the bargain. Now, I think I'm a pretty<br />\ngood judge of horses, and I'm willing to bet<br />\nthat this horse is worth the money I paid<br />\nfor her.\"<br />\n\"Naturally;\" said the girl, \"or you would<br />\nnot have paid it.\"<br />\nThe man did not heed the interruption,<br />\nand went on, \"Let's catch up to them. I<br />\n<br />\nwant to see what sort of a nag he's driving<br />\nto-day.\"<br />\nHe flicked the reins on the horse's back,<br />\nand the carriages came side by side. The<br />\ntwo men greeted each other coldly, and presently—after the three-cornered introduction<br />\nwas over—Frank threw out a feeler.<br />\n\"Charlie, this is a pretty good mare you<br />\nsold me. She's speedy at times. She showed<br />\n2.32 at the track last week. Is that one<br />\nyours?\" pointing to the other horse.<br />\n\"Yes,\" was the answer. \"I got her last<br />\nmonth, and she's rather fast. Suppose we<br />\ntry them together—say to the next milehouse.\"<br />\n\"Done,\" was the reply, and each whipped<br />\nup his horse.<br />\nSelfishness is a trait which manifests itself in a variety of ways. Some men it<br />\nmakes conceited. Others become lazy because of it. Still other men are drawn by<br />\nit to seek an eternal good time. To the third<br />\nclass belonged Frank Doane. He prided<br />\nhimself on his \"sporting instincts,\" which,<br />\nbeing examined, comprised solely a desire<br />\nfor pleasure at the expense of anything else;<br />\nand anything else might include his friends,<br />\nhis money, or, at present, the girl he was to<br />\nmarry. As the light buggy was flying down<br />\nthe road, almost abreast of the other team,<br />\nhe forgot Edith and everything except the<br />\nfact that he had been challenged to a race,<br />\nand must do his best to win it. He did not<br />\nallow the idea of danger to enter his head.<br />\nThe road was clear, he was an experienced<br />\ndriver, and there could be no danger. As<br />\nfor asking Edith's permission, it seemed entirely unnecessary.<br />\nHe laid the whip on heavily, until the<br />\ncarriage rocked like a row boat as it bounded<br />\nover stones and ruts. Yet the other horse<br />\nkept just a few yards ahead. Hanson kept<br />\na firm hold on the reins, and looked back<br />\nover his shoulder with a smile which drove<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nDoane to let his horse have full control of the<br />\nbit. The speed was frightful, and increased<br />\nevery second. The mile-house was passed<br />\nin no time. The slower horse, no longer<br />\nfeeling any curb, took matters entirely into<br />\nher own control, so that when a mounted<br />\npoliceman shouted a caution as the flying<br />\npair flashed by, Doane found it impossible<br />\nto check the mad pace of the mare, who was<br />\nnow almost winded and covered with foam.<br />\nHanson, however, had perfect control of his<br />\nhorse, and slowed down to a walk.<br />\nEdith had not made a sound. With hands<br />\nfast gripped to the seat, and with her face<br />\nset, she was like a statue, expecting every<br />\nmoment to be hurled from the buggy, but<br />\nshowing not a trace of her emotions in her<br />\nfeatures. She saw a speed-sign far down<br />\nthe road come nearer, and disappear in a<br />\nblur. Vehicles were drawn off to both sides<br />\nof the driveway, and she saw the frightened<br />\nfaces of the occupants and realized her danger. But danger did not occupy most of<br />\nher thoughts. She was wondering most at<br />\nthe man by her side. His hat had blown<br />\noff, his eyes were straining, his whole soul<br />\nabsorbed in his mad pleasure.<br />\nShe was<br />\nhaving his whole real self revealed to her.<br />\nIn the parlor, Frank Doane was the smoothest, most self-contained man to be found.<br />\nNow, he would not have heeded a pistol at<br />\nhis head, so entirely had he lost control of<br />\nhimself. This man was not the one she had<br />\nadmired for his steady hold on himself, for<br />\nhis thoughtfulness for women, and for his<br />\nbravery and gentleness. No; the creature<br />\nby her side was little better than one of the<br />\nhowlIng, maddened crowd she had once seen<br />\nat a race. And she was to marry him in<br />\na month. She shuddered at the thought.<br />\nBoth Frank and the horse had by this time<br />\ngotten their fill of racing; and as the horse<br />\nwas nearly run tired,. it slackened its speed.<br />\nThe girl pointed to a large automobile<br />\nabout two hundred yards distant, which was<br />\nrapidly approaching. As the space closed,<br />\nthe horse began to step sideways and to<br />\nshy; and the buggy was slewed around and<br />\nwent upon two wheels. It hung there for<br />\na few awful seconds, and then, as the terrified animal gave a final spring, it turned<br />\nover into the ditch, tearing loose the traces,<br />\n<br />\nand threw the man and woman into the<br />\nhedge beside the road. The horse continued<br />\nits flight. Neither person was much hurt,<br />\nand both rose. Edith with her silk skirt<br />\nin tatters, and Frank with a badly scratched<br />\nface. His apologies were profuse and pitiful. to hear. Miss Lawton received them<br />\nwith a perfectly calm face.<br />\n\"Let us get to the cars,\" was all she said,<br />\nand made her way through the crowd.<br />\nDoane made arrangements with Charlie Hanson, who had by this time overtaken them,<br />\nto bring the carriage home, and to look after<br />\nthe horse, which had been stopped a short<br />\ndistance down the road and was now being<br />\nled back. Frank had a great desire to lay<br />\nviolent hands on Hanson, who, with earnest<br />\ninquiries as to whether Miss Lawton was<br />\nhurt, and sincerest regrets that he had been<br />\nso foolish as to propose the race, was quick<br />\nto offer his services to get the horse and<br />\nbuggy home. Frank felt that -his position<br />\nwas very uncomfortable. He knew that, in<br />\nthe eyes of his fiancee, he had lowered himself irrevocably; and in the eyes of the<br />\ncrowd around him he had let a horse run<br />\naway and upset a woman, so that he was<br />\ndeserving of no pity. Hanson's horse had<br />\nbeaten his, and this was another sting. With<br />\na very full sense of having done a poor day's<br />\nwork, and feeling very small indeed, he accompanied Miss Lawton to the electric cars.<br />\nThe ride home was almost in silence. Both<br />\nhad learned a lesson, and were thinking over<br />\nwhat they had learned. When Miss Lawton's home was reached, she extended him<br />\nher hand, saying with a smile that nettled<br />\nhim, \"You will pardon me if I do not ask<br />\nyou to come in. I suppose I have enjoyed<br />\nthe drive. Good afternoon.\"<br />\nThe door closed in his face.<br />\nDoane called at her house that evening.<br />\nHer brother met him at the door.<br />\n\"Why, Frank, Edith left just a few minutes ago for her aunt's in Washington. No,<br />\nshe didn't seem to be hurt in the least. And,<br />\nby the way, she told me to give you this if<br />\nyou came to-night. She said you would understand.\" He handed him a small pasteboard box. It contained her engagement<br />\nring, and he understood.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n3<br />\n<br />\nThe Conference of The Association of American Universities.<br />\nNE of the most important events that<br />\nhave occurred recently at the University took place when the sixth<br />\nannual session of the Association of<br />\nAmerican Universities was held here.<br />\nduring the latter part of last week.<br />\nMany of the most distinguished figures in<br />\nthe colleges of the United States were present as delegates from their respective Universities. Six of the delegates were presidents of universities, and the others were<br />\nprofessors of wide renown in their own fields<br />\nof research and teaching.<br />\n. Tile conference began on Thursday of last<br />\nweek. The sessions, which were held in the<br />\nDonovan room, were not public, because the<br />\nsubjects under consideration were of great<br />\nimportance, and could be more thoroughly<br />\ndiscussed than if the public had been admitted to the meetings. After the first session the delegates were entertained at lunch<br />\nby the trustees and professors of this University. The tables were placed in McCoy Hall,<br />\nwhich was beautifully banked with palms.<br />\nIn the evening Mr. Theodore Marburg gave<br />\na reception for the delegates at his house on<br />\nMt. Vernon Place.<br />\nOn Friday morning the conference assembled in the Donovan room. Among the subjects discussed was that of the higher technical education and the instruction in graduate schools.<br />\nPresident Remsen believes<br />\nthat the length of time needed to prepare<br />\nfor and complete a modern professional<br />\ncourse is too great. In the first place, the<br />\nage of graduation from the leading colleges<br />\nin this country is becoming so high that students cannot begin their professional training until they are twenty-two or twentythree on the average. Then, too, the length<br />\nof the professional courses themselves is now<br />\nso great that some of the best years of a<br />\nman's life are taken up with preparatory<br />\nwork. President Remsen believes that in so<br />\nfar as it tends to prevent students from beginning their . professional or business life<br />\nuntil they are twenty-two or twenty-three,<br />\nthe present system of college training is seriously defective.<br />\nThe closing session of the conference was<br />\nheld on Saturday morning and at it papers<br />\nwere read on \"Opportunities for Higher Ed-<br />\n<br />\n0<br />\n<br />\nucation\" and \"Research in State Universities.\" President Van use of the University of Wisconsin said that he held that in<br />\nthe future the State Universities would be in<br />\na much stronger position with reference to<br />\nadvanced instructtion. A number of States,<br />\nhe said, are now granting large sums to their<br />\nuniversities for advanced instruction and research, and in the future State funds for such<br />\npurposes are sure to greatly increase in<br />\namount.<br />\nProfessor Page of the University of Virginia, gave an encouraging account of the<br />\nincrease in the resources of the Southern<br />\nState Universities. The people of the South,<br />\nhe said, favor strong support of such institutions.<br />\nA list of the delegates is as follows:<br />\nHarvard University—Dean James Barr<br />\nAmes and Prof. T. N. Carver.<br />\nYale University—President Arthur T.<br />\nHadley.<br />\nUniversity of Pennsylvania—Prof. J. H.<br />\nPenniman, Prof. J. C. Rolfe and Dean Clarence G. Child.<br />\nPrinceton University—Prof. W. M. Daniels, Prof. A. F. West and Prof. H. B. Fine.<br />\nColumbia University—Prof. Munroe Smith,<br />\nProf. W. H. Carpenter, Prof. henry M. Howe<br />\nand Mr. E. P. Keppel.<br />\nUniversity of Virginia—Prof. James Morris Page and President E. A. Alderman.<br />\nUniversity of Michigan—Prof. A. C.<br />\nMcLaughlin.<br />\nUniversity of Wisconsin — President<br />\nCharles R. Van Hise.<br />\nUniversity of California—President Benjamin I. Wheeler, Prof. Stringham and Prof.<br />\nLeuschner.<br />\nCornell University—Prof. Thomas F.<br />\nCrane.<br />\nCatholic University—Dr. Edward A. Pace<br />\nand Dr. Maurice Francis Egan.<br />\nClark University—President G. Stanley<br />\nHall.<br />\nLeland Stanford, Jr., University—Prof. A.<br />\nH. Suzzalo and Prof. Ellwood P. Cubberly.<br />\nUniversity of Chicago—President Harper<br />\nand Prof. Albion W. Small.<br />\nJohns Hopkins University — President<br />\nRemsen, Prof. Gildersleeve and Dr. William<br />\nH. Welch.<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nHeroines, Heroes and Villains in Modern Fiction.<br />\nMore than in price, more than in the manner of publication, more than in any particular connected plot, letter-press, or sale, has<br />\nthe novel of to-day changed from its predecessor of a generation ago, in the character<br />\nof its heroine. Our mothers and fathers<br />\nused to read in their novels of heroines of<br />\nthe fragile, clinging kind, who had \"willowy forms, and great, trustful eyes;\" heroines who could moralize ever so learnedly<br />\non almost any abstract subject, and reinforce<br />\ntheir opinions by numberless quotations from<br />\nclassic authors, yet who were content to be<br />\nguided, in all temporal matters, entirely by<br />\nmembers of the stronger sex; heroines who<br />\nfainted upon almost no provocation, wept<br />\nupon no provocation at all, and, in the last<br />\nchapter, generally accepted the hero's proposal of marriage by bursting into a flood<br />\nof glad tears, and fainting in his arms. The<br />\nhero, as befitted the Romeo of such a Juliet,<br />\nwas usually strong and brave, and \"full of<br />\na quiet dignity' —a veritable oak for such a<br />\ndrooping vine of a heroine to hold fast to.<br />\nThe modern heroine has got bravely over<br />\nall this. No sitting at home embroidering<br />\nsamplers, no poetic hours spent in painting<br />\nlandscapes, or in reading sentimental poetry,<br />\nfor her! She is an \"athletic girl,\" who plays<br />\ngolf and tennis, rides a bicycle, or manages<br />\nher, own automobile, and is, on the whole,<br />\nquite as well able to take care of herself, as<br />\nThe \"Gibson<br />\nany of her male friends.<br />\ngirl,\" the \"Christy girl,\" and half-a-dozen<br />\nother kinds of independent and very muscular girls, now hold the stage, from which<br />\ntheir elder sister, with her hoop-skirts and<br />\nvapors, has fled in dismay.<br />\nA corresponding change has taken place<br />\nin the hero. He must still be strong and<br />\nbrave, but principally in a physical sense.<br />\nHe must be a very paladin for dash and<br />\nvigor—equally ready to rescue a lady, shoot<br />\ndown a villain, or play the part of a king.<br />\nWhen he was at college, he was, of course,<br />\ncaptain of the 'varsity crew, or of the foot-<br />\n<br />\nball team! Of course, also, he had, and still<br />\nhas, an infinite contempt for books! The<br />\nvery first achievement of the hero of Richard<br />\nHarding Davis' latest novel, \"Captain Macklin,\" was to get himself expelled from college.<br />\nNor has the evolution of the villain been<br />\nless rapid or far-reaching than that of the<br />\nother principals in the story. No longer do<br />\nwe meet with the scheming Shylock, or the<br />\nloathsome Uriah Heep, any more than we<br />\nmeet with the womanly Portia, or the gentle<br />\nAgnes Wakefield. The crafty, serpent-like<br />\nkind of villain has given place to a villain<br />\nmoulded from much the same .knock-medown-and-drag-me-out sort of material as<br />\nthe hero is. The up-to-date villain glories<br />\nin making midnight attempts to abduct the<br />\nheroine, in attacking the hero with a band of<br />\ncut-throats, and in comporting himself generally in such a manner that the hero may<br />\nhave plenty of opportunity to show his mettle. Ile is equally as ready as the villain of<br />\nold, to lie, steal, murder, or do anything else<br />\nthat is evil; but he is, in addition, the possessor of a personality of the most dare-devil,<br />\nbrigand-like type—just as a villain should<br />\nbe in these strenuous times. He nearly always has to be killed in the last chapter, by<br />\nthe hero, in order to be gotten rid of.<br />\nIn the matter of personal appearance, heroines, heroes, And villains have all changed<br />\nless than in any other particular. Though now<br />\nstrong and buxom, the heroine is still the<br />\npossessor, in most cases, of a \"face which is<br />\na perfect oval,\" \"rose-bud lips,\" a \"silvery<br />\nvoice,\" and \"rebellious curls.\" The hero<br />\nis tall and broad-sohuldered, usually has<br />\ncurly hair, and, especially with women novelists, has the \"profile of a Greek god.\" Villains still have \"a cast in one eye,\" or are<br />\n\"hatchet-faced;\" but, on the whole, they<br />\nexhibit a far greater variety of types than<br />\neither the hero or heroine.<br />\nA Literary Critic.<br />\n<br />\n\"Oh, Shah!\" said the favorite wife of the<br />\nruler of Persia as he refused to buy her a<br />\nnew automobile.<br />\n<br />\n—Tiger.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nTHE INTER-CLASS DEBATE.<br />\nNE of the many subjects of talk, among<br />\n<br />\nO<br />\n<br />\nthe little groups which gather in the<br />\ncorridors of McCoy Hall, is the coming inter-class debate. This will take place<br />\nduring the second week in March; but before<br />\nspeaking of the approaching debate, I would<br />\nlike to call attention to those that are past.<br />\nThe late Dr. Herbert B. Adams was the<br />\noriginator and first promoter of the interclass debates. Through his influence the<br />\nfirst was held in '98, and as the list of trophies testify, they have been continued yearly ever since. During this series each class<br />\nhas not obtained an equal share of the<br />\nhdnors, as the following table shows<br />\nYear of Debate.<br />\n1898<br />\n1899<br />\n1900<br />\n1901<br />\n1902<br />\n1903<br />\n1904<br />\n<br />\nWinning Class.<br />\n'98<br />\n'99<br />\n'01<br />\n'01<br />\n'03<br />\n'03<br />\n'05<br />\n<br />\nAnd moreover, the rewards have changed.<br />\nIn '98 the victors were presented with medals; in '99, as one of the successful debaters<br />\nsaid: \"There was a table full of books, a<br />\nbig stack for each fellow, more than he could<br />\nlug off at one time.\" From that time the<br />\ncustom of awarding books has been adhered<br />\nto; but the books are not presented until<br />\nsome time after the debate. By this arrangement the members of the winning team are<br />\nallowed to select what books they wish.<br />\nThis year much pleasure will be taken<br />\naway from the work by the absence of a feature of all past inter-class debates, namely,<br />\nDr. Guy Carleton Lee. The students of '05<br />\nand '06 will be the first to hold a debate<br />\nwithout the encouragement of his presence;<br />\nthough the memory of his energy, of his<br />\nstriking personality, and of one or two stinging remarks by which he pointed out our<br />\nmost glaring faults, will serve as a spur to<br />\nmake us put forth our best efforts. I know<br />\nhis absence is deeply regretted by both<br />\nclasses, and I, for one, would go a long way<br />\nto meet once more his kindly smile and<br />\ncheery greeting.<br />\n<br />\nBut despite Dr. Lee's absence, as the debates have always awakened a keen interest<br />\nin the past, there is no doubt that such will<br />\nbe the case in the present instance. Dr.<br />\nFrench has gained the respect and esteem of<br />\nboth classes by the manner in which he has<br />\nconducted the correspondence with Brown;<br />\nand aided by his efforts we will no doubt live<br />\nup to the high standard of excellence set by<br />\npast debates.<br />\nAs was the case last year, the same subject<br />\nhas been chosen which, later on, will be used<br />\nfor the debate with Brown. The subject is:<br />\n\"Resolved, that the economic and political interests of the United States demand the<br />\npermanent retention of the Philippine<br />\nIslands.\"<br />\nThe Seniors won the toss, and took the<br />\neast goal with the wind in their favor—I<br />\nmean they chose the negative side, the side<br />\nwhich the committee, composed of men from<br />\nboth classes, had previously decided upon as<br />\none Hopkins would take against Brown.<br />\nAmong the Senior candidates are Goldman, chairman of '05 class team, also chairman of the inter-collegiate committee;<br />\nCremen, secretary of '05 team; Stern, Bernstein, Zeigler, Straughn and Kohn.<br />\nAmong the Junior candidates are C. Smith,<br />\nchairman of '06 team; Singewald, secretary<br />\nof inter-collegiate committee; Menzel, Hammond, Blondheim, Griffith, Robinson,Brauns,<br />\nEdlavitch, Matthews, Shackelford, Dickey<br />\nand Ruth.<br />\nG. Mitchell Griffith, '06.<br />\n<br />\nJustice—Officer, what's the crime against<br />\nthe prisoner<br />\nPoliceman—He was caught stealing six<br />\nbottles of beer, your honor.<br />\nJustice—Discharged; you can't make a<br />\ncase out of six bottles.<br />\n—Tiger.<br />\nPastor ( to the convert)—Do you believe<br />\nin the laws of the church?<br />\n\"I do.\"<br />\nPastor (to the congregation)—Let us pray<br />\nfor this person.<br />\n—Yale Record.<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nUbe 'Pews:col/Letter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br />\n<br />\nJANUARY 20, 1905.<br />\n<br />\nSubscription $1.50 per year.<br />\n<br />\n10 Cents a single copy.<br />\n<br />\nEditor in Chief,<br />\nTHOMAS OWINGS,<br />\nAssociate Editor in Chief,....-Outorm W. HAMMOND,<br />\nNews Editor,<br />\nH. FINDLAY FRENCH,<br />\n... THOMAS G. MACHEN,<br />\nAssistant News Editors.<br />\n<br />\n1905.<br />\n1906.<br />\n1906.<br />\n1906.<br />\n<br />\nW. R. STRAUGHN,<br />\nAthletic Editors,<br />\n{E. LELAND SHACKELFORD,<br />\nBusiness Manager,<br />\nG. WOLTERECK,<br />\nAssistant Business Manager,<br />\nCARLYLE BARTON,<br />\n<br />\n1905.<br />\n1906.<br />\n1905.<br />\n1906<br />\n<br />\nAddress all articles, communications,. etc., IO THOMAS<br />\nOWINGS, box 467, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\nG. WOLTERECK, box 677, J. H. U.<br />\n<br />\nEDITORIAL.<br />\nThe editorial staff of the \"Hullabaloo\"<br />\nare hard at work on the new book for this<br />\nyear, which promises to be a great success.<br />\nIn one thing especially it will, if the idea is<br />\nproperly supported, be an improvement on<br />\nits predecessors: there will be an attempt<br />\nto include in the book more material of interest to lower classmen, so that the book will<br />\nrepresent the whole University and not the<br />\nSenior Class alone. This result can only be<br />\ngained by the co-operation of the Junior and<br />\nFreshman classes, for of course it is very<br />\nhard for a Board composed wholly of Seniors<br />\nto discover and write up the various things<br />\nthat would most appeal to lower classmen.<br />\nThere has been a good deal of criticism of<br />\nthe \"Hullabaloo\" in recent years by Juniors<br />\nand Freshmen on the ground that it was almost exclusively a chronicle of the adventures, wit and glories of the Senior Class,<br />\nand yet the very men who criticised the book<br />\nwere the ones who might have helped to<br />\nmake it broader in scope. The editors of the<br />\n1905 \"Hullabaloo\" are anxious to receive<br />\ncontributions within the next two weeks—<br />\nsuch things as poems, stunts of various kinds<br />\nand drawings—from men in the Senior,<br />\nJunior and Freshman Classes. Poems may<br />\nbe on any subject, the funnier the better,<br />\nand of any length, although the kind of serialpoem that comes in sections is discouraged.<br />\n<br />\nThe drawings should be done in India ink<br />\non Bristol board about twice the size of<br />\nthe finished reproduction. The \"Hullabaloo\"<br />\nBoard is always glad to receive good<br />\npictures of girls, and also drawings for the<br />\ntitles of various subjects in the book. Even<br />\nif the contributors are not artists themselves,<br />\nalmost everyone knows one or more people<br />\nwho would be glad to do them some drawings for their year book if they were asked,<br />\nand therefore it is not a question of taking<br />\nany very great trouble about getting the<br />\npictures. Nevertheless, drawings are very<br />\nhard to obtain, not on account of the scarcity<br />\nof artists, but simply because the artists'<br />\nfriends are too lazy to ask for pictures. Of<br />\ncourse the \"Hullabaloo\" must of necessity<br />\nremain in large part a compilation of jokes<br />\nand \"stunts\" which are especially of interest<br />\nto the Seniors, but with a little trouble on the<br />\npart of every under-classman, it can be made<br />\nmuch more interesting both to themselves<br />\nand to their friends.<br />\nOn the evening of Saturday, January 21,<br />\nthe day after this issue is expected to come<br />\nfrom the press, the University will make its<br />\ndebut in a new field of athletics. On this<br />\nevening the recently organized basket ball<br />\nteam will begin its season with a game in<br />\nthe cage against the University of Maryland.<br />\nThe general enthusiasm basket ball has already awakened among the student-body<br />\nmakes it unnecessary for the NEWS-LETTER<br />\nto attempt to \"boom\" the new sport. Nevertheless, the paper can not refrain from wishing the team the success it so richly deserves,<br />\nand calling upon the students to give it their<br />\nunited support.<br />\nEvery successful athletic team requires<br />\nthree things: skillful players, money, and<br />\nWith the first requisite, as an<br />\nfriends.<br />\narticle on another page clearly shows, the<br />\nbasket ball team is bountifully supplied. To<br />\nprovide the second and third is at once the<br />\nduty and privilege of the students. Moreover, the first game in a season is always an<br />\noccasion upon which a large attendance of<br />\nfriendly rooters is peculiarly appropriate.<br />\nSuch an attendance shows the player that<br />\nhis hard work and his sacrifices preparatory<br />\nto making the team are appreciated, and that<br />\nhis fellow-students trust in his ability to<br />\n<br />\n\fTHE NEWS-LETTER.<br />\ndefend the good name of the Alma Mater;<br />\nhe is strengthened and plays a better game<br />\nthan he would otherwise be capable of. On<br />\nthe other hand, the memory of a cold reception at the opening game is apt to cling to a<br />\nteam and influence its work during the<br />\nwhole season. An additional and equally,<br />\npotent reason makes a large attendance Saturday night desirable. This is the fact that<br />\nthe management has pending arrangements<br />\nfor a number of games with strong out-oftown teams requiring large guarantees. Until evidence is secured that the attendance<br />\nduring the season will be large enough to<br />\ncover expenses, it would be folly for a team<br />\nwithout the financial backing of the Association to close the dates for these games.<br />\nUnless such evidence is given Saturday night<br />\nthe games will have to be played away from<br />\nhome.<br />\nIt is the object of the basket ball team to<br />\ngive its games social as well as athletic<br />\nstanding. In other colleges basket ball is<br />\na leading sport, and draws fashionable and<br />\ncultured audiences. Every precaution is being taken to put the contests here on the<br />\nhighest possible level. No one, in the opinion of the 1\\14w s-LvrTER, need hesitate to<br />\nbring a lady, and indeed, from present indications, the number present will be large.<br />\n<br />\nINTERSTATE BIBLE STUDY<br />\nINSTITUTE.<br />\nThe second annual Interstate Bible Study<br />\nInstitute, arranged as a means of promoting<br />\nBible study in the colleges of Maryland,<br />\nDelaware and the District of Columbia, was<br />\nsuccessfully held in Levering Hall, January<br />\n13-15. There were thirty-five delegates from<br />\nout-of-town, representing the Christian Associations of six different institutions. The<br />\nAssociations of Hopkins and the several medical schools in the city, furnished entertainment for the visitors.<br />\nThe program provided for inspirational addresses, and for conferences to determine<br />\nthe best methods of promoting Bible study,<br />\nespecially during the remainder of the college year. Friday evening, Dr. G. W. Ward,<br />\nof Western Maryland College, spoke on \"The<br />\nClaims of the Bible Upon College Men,\"<br />\n<br />\nand Saturday morning, Rev. W. F. Sheridan,<br />\npastor of Mt. Vernon Place M. E. Church,<br />\naddressed the delegates on \"The Benefit of<br />\nPersonal Bible Study.\" Sunday morning,<br />\nDr. Thomas Fell, president of St. John's<br />\nCollege, conducted a model Bible class. Mr.<br />\nR. H. Edwards, of New York, for three years<br />\nGeneral Secretary of the Yale Y. M. C. A.,<br />\nwas present Friday and Saturday, and gave<br />\nmany helpful suggestions. Other speakers<br />\nand leaders were: Messrs. W. H. Morriss,<br />\nGeneral Secretary for Baltimore; H. T. Waller, Inter-collegiate Secretary for Baltimore;<br />\nJ. M. Rice, Secretary B. & 0. Y. M. C. A.;<br />\nG. L. Curry, president of the Association at<br />\nWestern Maryland College; and General<br />\nSecretary Addison.<br />\n<br />\nMR. WRIGHT LORIMER'S VISIT.<br />\nMr. Wright Lorimer, who is starring this<br />\nseason in the \"Shepherd King,\" which appeared at the Academy of Music last week,<br />\naddressed a large body of Hopkins students<br />\nin the Donovan Room, January 10th.<br />\nThe speaker was introduced by Dr. French<br />\nof the Dept. of Public Speaking. The subject<br />\nof his address was \"Literature as an Aid to<br />\nPublic Speaking.\" Though rather undersized and of an exceedingly high-strung temperament, Mr. Lorimer's personality is a<br />\nstriking one. His features are strong, and<br />\nhis rich voice, trained to the demands of the<br />\nstage, is supported by an earnestness that<br />\ncommands the attention of his hearers.<br />\nIn his address he tried to confine himself<br />\nto the subject in hand, which, however, was<br />\nan unfortunate one, for time and again his<br />\ntalk wandered off to the more pleasant fields<br />\nof his college life, and to his present task of<br />\nuplifting the stage. He spoke with feeling,<br />\nof the degeneracy which marks the American<br />\ntheatre, and expressed confidence that a reaction would come about. He appealed to<br />\nstudents especially, he said, to use their higher culture to cultivate in others a taste for<br />\na higher form of amusement, than that afforded by the present comic opera.<br />\nAt the close of his address, Mr. Lorimer<br />\nwas given a rousing \"Gee-Hee, Gee-Haa,\"<br />\nand seemed deeply moved by his reception.<br />\nHe is the son of a Methodist minister and is<br />\na graduate of the University of California.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n8<br />\n<br />\nBASKET BALL.<br />\nAlong with the general extension in athletics this year, the 'Varsity is to be represented also by a basket ball team. Captain<br />\nHolmes, who has worked energetically for<br />\nthis sport ever since the University opened,<br />\nhas been rewarded by a large number of<br />\nmen coming out for practice. These men,<br />\ntoo, are not mere amateurs at the game, but<br />\nknow the details thoroughly, and rank among<br />\nthe best athletes in the country.<br />\nCaptain Holmes himself is a noted basket<br />\nball player. Last year he was captain of the<br />\n\"Dixon\" team, of New Orleans, and by his<br />\nskill and persistency made the team one of<br />\nthe strongest in the State. Holmes is well<br />\nknown among the 'varsity boys because of<br />\nhis enthusiasm and his never-say-die spirit.<br />\nIt is this spirit which has made basket ball<br />\na factor in local sports. He canvassed the<br />\nmedical department and succeeded in getting out a number of \"stars,\" who, hitherto,<br />\nhad considered their time too valuable to be<br />\ndevoted to any form of athletics. These men,<br />\nwith Captain Holmes, promise to make the<br />\nnew sport popular at Hopkins.<br />\nProminent among these men are McClure,<br />\nHelmholtz, Houghton, Boyd, Strohbar, Cole,<br />\nWilliams, Taylor, Branham and Nichols.<br />\nMcClure was former captain of Ohio State<br />\nUniversity basket ball team, and is very<br />\nquick and accurate in his goal throwing.<br />\nHelmholtz is well known to the University<br />\nfollowers through his all around work in athletics. He and'Lyons, also a med., hold the<br />\ntennis championship in doubles of Maryland.<br />\nHe was formerly captain of the University of<br />\nWisconsin team. Houghton is a fourth year<br />\nmed. and is an old Hopkins football player.<br />\nHe was formerly captain of Ohio State Uni-<br />\n<br />\nversity basket ball squad. Boyd, of baseball<br />\nand football fame, is a \"star\" man from the<br />\nUniversity of Georgia. Strohbar is also a<br />\nvery good man. His goal throwing at times<br />\nborders on the sensational. Cole, Williams,<br />\nTaylor, Branham and Nichols are good players, but have not had the experience of the<br />\nex-captains.<br />\nThe first game will be this Saturday night<br />\n(January 21) in the cage. The University<br />\nof Maryland boys, who have taken up the<br />\nsport this year, will be our opponents. It is<br />\nhoped that the 'varsity boys will turn out<br />\nand give the team a cheer, for they deserve<br />\nit. If the team is financially successful, the<br />\nmanager promises us some rare treats in the<br />\nway of games with Cornell, Pennsylvania,<br />\nand other big teams.<br />\n<br />\nTHE TRACK TEAM OF 1905.<br />\nWith the fixing of February 11 for the<br />\nannual indoor track and field meet to be<br />\nheld in the \"cage,\" regular work has begun<br />\nin training. Capt. Hill has his men out regularly three and four times a week now in order to have them in proper shape on the night<br />\nof the eleventh of February. This will be<br />\nthe initial indoor meet of the season, and<br />\nin all probability it will be the only indoor<br />\nmeet of any prominence held in the city this<br />\nwinter. It was for a time hoped that the<br />\nspacious floor of the Fifth Regiment Armory<br />\nmight have been secured for the purpose of<br />\nholding this meet, but owing to the fact that<br />\nit is occupied by one of the leading business<br />\nfirms in the city its use was found to be<br />\nimpossible.<br />\nAlthough the \"cage\" does not afford so<br />\nlarge a field as does the armory, it will be<br />\na splendid place for holding the games. One<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nadvantage it has over the armory is that the<br />\ncompetitors may use spikes in the dirt floor.<br />\nThe track ought to be in good condition by<br />\nthe time of the meet, now that the curves are<br />\nbeing fixed up by new cinders being put on<br />\nthe banks. There seems to be only one drawback, and that is that the straightaway<br />\ndashes will be necessarily short. With this<br />\nexception, every other condition is favorable,<br />\nand all things point toward this meet being<br />\nthe most successful in the history of the<br />\nUniversity.<br />\nA special effort will be made to have representatives from many of the larger universities which have the reputation of developing fast teams. Besides the entries that<br />\nare always made by the Georgetown University and the University of Pennsylvania,<br />\nit is hoped that entries will be made by other<br />\ncolleges prominent in the athletic world. In<br />\naddition to these entries there will be the<br />\nusual number from the local clubs, \"prep\"<br />\nschools and colleges.<br />\nOne question which is giving a great deal<br />\nof trouble at present is deciding who the<br />\nrelay team will be that will be pitted against<br />\nHopkins in the coming meet. Several universities are trying for this place, foremost<br />\namong them being Pennsylvania. The last<br />\ntime Pennsylvania and Hopkins ran a relay<br />\nteam against one another Hopkins won. This<br />\nmakes \"Penn\" all the more anxious for such<br />\na race, and there is no doubt of its furnishing<br />\nfine sport. Another candidate in the field<br />\nis Georgetown. Of the two races between<br />\nthe Hopkins and Georgetown teams last season, each institution won one race. This<br />\ngoes to show that the two teams are about<br />\nevenly matched, and it seems that a third<br />\nmeeting is almost absolutely necessary in<br />\norder to decide the supremacy of the two<br />\nteams.<br />\nOther matters now before the track authorities are the considerations of dual track<br />\nmeets with the Haverford College and the<br />\nNaval Academy. Negotiations with the.<br />\nNaval Academy are about off because no<br />\nsuitable date can be fixed upon for holding<br />\nthe meet. It is also probable that the proposed meet with Haverford will not materialize because Haverford wishes it to be held<br />\non her own grounds, and the expenses accruing to such a trip would hardly justify<br />\nit. And so, all things being considered, it<br />\nseems that the dual meet with the University<br />\nof Virginia will be the only one Hopkins will<br />\nfigure in this year.<br />\n<br />\n9<br />\n<br />\nALUMNI NOTES.<br />\n'00—J. S. Moore, who took his bachelor of<br />\narts degree at the University in the class<br />\nof 1900, is studying philosophy in the Harvard Graduate School.<br />\n'02—Sidney Smith of Louisville, Ky., is<br />\nat the Harvard Law School.<br />\n'04—Frank Stollenwork, Jr., who graduated here last year, is now in the first year<br />\nof the Harvard Law School.<br />\n'96—St. George Sioussat is engaged in<br />\nwriting a \"Financial History of Tennessee,\"<br />\nto be a part of the Carnegie Financial History of the United States.<br />\n'81—Col. David T. Day of Washington, has<br />\nbeen appointed mining commissioner for the<br />\nLewis and Clark Fair at Portland, Oregon,<br />\nand will bring to Portland a large collection<br />\nof minerals displayed at St. Louis.<br />\nIra M. Remsen, President Remsen's son,<br />\nhas opened a studio in New York as a portrait painter. He has devoted much study,<br />\nboth at home and abroad, to this branch of<br />\nart.<br />\n'82—Richard Fuller Kimball, Assistant<br />\nStates' Attorney, Baltimore, died in Baltimore, January 1, 1905.<br />\n'96—Robert Lacy is taking a few months'<br />\nholiday in Cuba.<br />\nA LIMERICK.<br />\nSaid a husband you think I'm a St.<br />\nI will fool you a bit, for I a't.<br />\nNow please take a look,<br />\nWatch me wink at the cook.<br />\n* * * I I<br />\nNo, the black round his eye isn't pt.<br />\n—xchange.<br />\nTACT.<br />\nI went to a party with Janet,<br />\nAnd met with an awful mishap;<br />\nFor I awkwardly upset a cupful<br />\nOf chocolate into her lap.<br />\nBut Janet was cool—though it wasn't,<br />\nBut none is so tactful as she;<br />\nAnd smiling with perfect composure,<br />\nSaid sweetly—''The drinks are on me.\"<br />\n—Harvard Lampoon.<br />\nThere was an old lady named (?)<br />\nWho, alas! was most dreadfully leene.<br />\nIf a man was athletic<br />\nHis fate was pathetic,<br />\nAt the hands of this gentle squireene.<br />\nM. M. B.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nMy Rhyming Dictionary.<br />\nI am the proudest person that just ever you did see,<br />\nI wonder if you could but guess what Santa brought to me;<br />\nThough if you scan these verses, it will be unnecessary<br />\nTo tell you 'bout my fine new book—a rhyming dictionary.<br />\nBefore I had this lovely gift from dear old Santa Claus,<br />\nI used to have to pause and think, and think and think and pause;<br />\nBut now I copy down four rhymes from out this dictionary,<br />\nAnd just put anything before—as an auxiliary.<br />\nI do not have to search my brain to get the proper rhyme,<br />\nIt's easier to look it up, and saves a lot of time;<br />\nThe rhyme's the only thing that counts, the sense is secondary,<br />\nWhen I'm the proud possessor of a rhyming dictionary.<br />\nTo prove to you what I can do, I'll show my primal try,<br />\nOf course I get much better as each day goes flitting by;<br />\nBut the starter is the shortest that I ever had in stock,<br />\nThe latter ones are quite too long, they stretch a city block!<br />\nThough my rhyming's not innate,<br />\nYet I will not meditate,<br />\nThat I am a reprobate,<br />\nOf the highest of the arts;<br />\nThough I ought to educate,<br />\nInstigate and innovate,<br />\n(My, but I am doing great,<br />\nRhyming at an awful rate,)<br />\n<br />\nProcrastinate and stipulate,<br />\nCelebrate and calculate—<br />\nBut I'll really have to state,<br />\nThat they're more than ninety-eight<br />\nWhich can rhyme with prate and slate,<br />\nSo I better had abate,<br />\nLest relentless hand of Fate,<br />\nThrow the sharpest of her darts!<br />\n<br />\nOf course the sense is lacking, but that doesn't matter much,<br />\nIt is the rhyme we're after, not the writer's wordy touch;<br />\nThrow' learned logic to the dogs, for it is subsidiary,<br />\nIt doesn't matter 'bout the sense with such a dictionary.<br />\nBill Shakespeare should have had one when he wrote Lord Bacon's plays,<br />\nHe could have rhymed with fine effect in very many ways;<br />\nNow anyone can pass him with a poor extemporary,<br />\nOf course, provided that he has a rhyming dictionary.<br />\nAnd Milton, Pope, and Dryden would have surely made a hit,<br />\nHad they owned the dictionary, and had rightly followed it;<br />\nBut now to like their writings one must be an antiquary,<br />\nThey never had a chance to buy a rhyming dictionary.<br />\nI haven't got the slightest doubt that I can beat them all,<br />\nFor they are way, way out of date, 'tis I that have the call;<br />\nI will out-Shakespeare Milton—do every adversary,<br />\nSince I'm the proud possessor of a rhyming dictionary.<br />\n'06.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n11<br />\n<br />\nCHRISTMAS TRIP OF THE MUSICAL night. The clubs left Frederick on Saturday<br />\nmorning, arriving in Baltimore before noon;<br />\nCLUBS.<br />\nOn Tuesday, December 27, at an early<br />\nhour in the morning, the musical clubs<br />\nboarded the train at Camden Station. The<br />\nBaltimore and Ohio Railroad had provided<br />\na special car to accompany the clubs during.<br />\nthe entire trip, and in this way the inconveniences of travel were much lessened. The<br />\nforty-mile trip to Washington was covered<br />\nwith little incident.<br />\nAt Washington the<br />\ncar was coupled to another train; and in a<br />\nshort while the run was made to Harper's<br />\nFerry, and thence to Charlestown. In this<br />\ntown, the men were boarded at a girls' seminary, and certainly everyone was royally<br />\nentertained. Especial thanks and honor are<br />\ndue from all for the gastronomic treat so<br />\nkindly furnished by one ''inmate'' of the<br />\nseminary.<br />\nThe concert at Charlestown was very successful, and was received in a most appreciative manner. At eleven o'clock Wednesday morning the clubs proceeded on their<br />\njourney. At Weverton, where there was a<br />\nwait of two hours, the men amused themselves by sliding on the ice. The concert<br />\nat Winchester was perhaps not as well received as the one given at Charlestown, but<br />\nthe men had a pleasant time, and enjoyed<br />\na fine \"feed\" after the duties of the evening<br />\nwere over. The next town to be visited<br />\nwas Hagerstown. There some of the fellows<br />\namused themselves by advertising the concert in a way which one of the staid inhabitants said \"lowered the dignity of the University,\" but which, to say the least, was perfectly harmless. The concert, which was<br />\ngiven at the hotel, was probably the best of<br />\nthe trip, from the point of view of musical<br />\nexcellence.<br />\nOn Friday morning the men boarded the<br />\ntrain for Frederick, en route to which a stop<br />\nwas made at Weverton, and a game of hockey<br />\nwas enjoyed. The largest audience of the<br />\nfour attended the concert at Frederick,<br />\nwhere a dance was given to the<br />\nmen after the. entertainmentt. A supper was enjoyed by the clubs, after<br />\nthe dance, through the kindness of Dr.<br />\nWhittle, and the thanks of all are due him<br />\nfor this addition to the pleasures of the trip.<br />\nSome mild \"stunts\" were done by the<br />\nfreshmen before the men adjourned for the<br />\n<br />\nand thus a pleasant Christmas vacation was<br />\ncompleted.<br />\n<br />\nTHE TURNBULL AND HERTER<br />\nLECTURES.<br />\nThe Turnbull Lectures will be given this<br />\nyear by Dr. George E. Woodberry, lately professor of comparative literature at Columbia<br />\nUniversity. There will be eight lectures,<br />\nthe general subject being \"The Poteic Forms<br />\nof Life.\"<br />\nThe lectures will be given in McCoy Hall<br />\nas follows:<br />\nMonday, March 27—\"Illusion.\"<br />\nTuesday, March 28—\"The Poetic Form of<br />\nNature.\"<br />\nThursday, March 30—\"The Poetic Form<br />\nof Intellect.\"<br />\nFriday, March 31—\"The Poetic Form of<br />\nthe Emotions.\"<br />\nMonday, April 3—\"The Poetic Form of<br />\nthe Will.\"<br />\nTuesday, April 4—\"The Affirmation of<br />\nLife.\"<br />\nThursday, April 6—\"The Denial of Life.\"<br />\nFriday, April 7—\"Reality.\"<br />\nDr. Woodberry is a graduate of Harvard,<br />\nand was for three years professor of English<br />\nin the University of Nebraska. He served<br />\non the editorial staff of the \"Nation\" for a<br />\nyear, and from 1891 to 1903 was professor<br />\nof comparative literature at Columbia. He<br />\nis well known as a writer both in poetry and<br />\nprose, and has edited valuable editions of<br />\nthe works of a number of authors.<br />\nDr. Hans H. Meyer, professor of pharmacology in the University of Vienna, has accepted the invitation to deliver the second<br />\ncourse of Herter Lectures next October. The<br />\nfirst course was given last spring by Prof.<br />\nPaul Ehrlich, of Frankfort-on-the-Main.<br />\nProfessor Meyer ranks as one of the first<br />\npharmacologists of the day. About a year<br />\nago, in connection with Dr. Frederick Ransom, he made an important contribution to<br />\nthe theory of the action of the poison of<br />\ntetanus, or lock-jaw.<br />\nAbsent minded Professor—Gentlemen, I<br />\nhave no time to call the roll to-day. Those<br />\nwho are absent may simply hold up their<br />\nhands.<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nNotes From All the Colleges.<br />\nPrinceton offers a new degree, that of<br />\nBachelor of Letters, which is to be given to<br />\nstudents who enter college without Greek,<br />\nand who take no classical work in their<br />\ncourse.<br />\nProfessor Bailey, assistant professor of<br />\neconomics at Yale, is authority for the statement that the average student at Old Eli<br />\nspends $1,100 a year. Some spend only<br />\n$300 while others go as high as $3,000.<br />\n<br />\nPresident Butler and Professor Brander<br />\nMatthews, of Columbia, at a recent banquet<br />\nat the Quill Club, in New York, predicted<br />\nthat the universities of the future would be<br />\nin the largest cities. \"No one to-day,\"<br />\nsaid Brander Matthews, \"would think of<br />\nfounding a university at Ithaca, New Haven<br />\nor Princeton.\"<br />\n<br />\nYale's football receipts for 1904 were<br />\nabout $70,000. The main features of the<br />\ntotal were: Yale-Harvard game, total, about<br />\nYale's share, $31,000. Yale.<br />\n$62,000;<br />\nthat<br />\nbelieve<br />\npresidents<br />\nOnly three college<br />\ntotal, $44,000; Yale's share,<br />\ngame,<br />\nPrinceton<br />\ncollege<br />\nto<br />\nself-support is no hindrance<br />\ngame, total, $22,000;<br />\nYale-Columbia<br />\n$22,000.<br />\nis<br />\nwork<br />\nstudies; fifty report that outside<br />\nmaking a total of<br />\n$11,000,<br />\nshare,<br />\nYale's<br />\nsomewhat hampering, and but two consider<br />\nbig games of the<br />\nthree<br />\nthe<br />\nfor<br />\nabout $64,000<br />\nit seriously detrimental.<br />\nminor games<br />\nthe<br />\nfrom<br />\nyear. The receipts<br />\ntotal for the<br />\nthe<br />\nA three-thousand-mile trip during the were about $7,000, making<br />\nChristmas vacation was taken by the Yale season about $70,000. What the expenses<br />\nbasket ball team, breaking all records for were has not been footed up yet, but there<br />\nwinter sport in inter-collegiate organizations. will be a big surplus.<br />\nTwo hours' college credit is given to Michigan 's representatives in the inter-collegiate<br />\ndebates and oratorical contests. The wonder is, not that Michigan gives credit to her<br />\ndebaters, but that other universities have<br />\nnot long ago adopted the same plan. No<br />\ncourse in a college curriculum requires more<br />\nThe gift of $50,000 by Edward D. Adams, consistent intellectual labor than the debates.<br />\nin memory of his son, Ernest K. Adams, to Why this work should not be credited is<br />\nColumbia University for the foundation of a a puzzle to the average student.<br />\npsychical research fellowship was announced<br />\nOn the evening of December 10 the twelfth<br />\nat the meeting of the university trustees.<br />\nannual debate between Yale and Princeton<br />\neducawas held in Woolsey Hall. The subject for<br />\nRecent statistics show that college<br />\nthan<br />\ndebate was: \"Resolved, That it should be<br />\ntion is far more expensive in the East<br />\nthe policy of the United States not to hold<br />\nin the West.<br />\nterritory permanently unless with the purAndrew Carnegie has just given Prince- pose that it shall ultimately enjoy stateton $385,000 for the construction oS an arti- hood.\" Yale supported the affirmative, and<br />\nwon the debate.<br />\nficial lake to be called \"Princeton Lake.\"<br />\n<br />\nThe class of '84 of Amherst has offered<br />\n$10,000, to be used for the restoration of<br />\nCollege Hall, on condition that the trustees<br />\nThe gift of $10,000 is the<br />\nraise $5,000.<br />\nlargest any class has ever made to the institution.<br />\n<br />\n\f7\\t.<br />\n<br />\n\"A WMAG EQUIPPED ESTABLISHMENT'•<br />\nADDS TO OUR, FACILITIES FOR TAMORING<br />\n<br />\niAlm1?01\\si<br />\n<br />\nWe Have Polite Salesmen.<br />\nWe Have Expert Cutters.<br />\n421<br />\n<br />\nWe Have a Large Assortment of Materials.<br />\n<br />\nN. ik)wiwi.) •-s, I .<br />\nIiR\\,\\'‘',W,<br />\n<br />\nAT POPULAR PRICES.<br />\n<br />\nDOCW.N ttdOW Frorklitt<br />\n<br />\nkv,kyti, V.t( .<br />\n<br />\nk)pillor<br />\n<br />\n1 Ito 1%k%st(jk\\t iih kit $1.0o Per Poll',<br />\nnom..,nowat.offirmupprOmpm....rvoins.winnuawimero.ournrommammos<br />\n<br />\nCOLLEGE AND CLASS STATIONERY,<br />\nMENU AND BANQUET CARDS.<br />\n<br />\nWcyforth Az Sons,<br />\n...Tailors...<br />\n217-219 North PBC& Street,<br />\nJ. U.1.11A)<br />\n<br />\nDOWNS.<br />\nSTATIONER AND ENGRAVER,<br />\n<br />\nBaltimore, WI.<br />\n<br />\nrt aft with C.4.1, ei 111 n<br />\n<br />\nihr ID NUNN<br />\n<br />\n2'29 NORTH ClIARLBS STREET<br />\n<br />\n(11t<br />\n<br />\nN I J NN &<br />\n<br />\nCOM<br />\n<br />\nPA N Y ,<br />\n<br />\n--BOOKSELLERS Fl ND ST IA TiONEN S227<br />\n<br />\nNORTH HOWARD STREET, Between Lexington and Saratoga Streets, BALTIMORE, MD.<br />\nAll Telt Books used at the Johns Hopkins University promptly supplied. Full line of Stationery., Note Books,eta.<br />\nPAPER STAMPED WITH COLLEGE HEADING.<br />\n.1••••••••••••••••••••••a.<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nNew York to Bremen. London, Paris, Gibraltar, Naples., Genoa, etc.<br />\nBALTIMORE TO BREMEN DIRECT.<br />\n<br />\n119 S. Hanover St.<br />\n<br />\npartic. Wars a os)ly to<br />\n<br />\nKlio<br />\n<br />\nllooltritz<br />\n<br />\nA. SCHUMACHER & CO., General Agents<br />\nMICROSCOPIC SUPPLIES.<br />\nDISSECTING CASES,<br />\n<br />\nSuccessor to Cummins.<br />\n<br />\nM1CROSCOPE.S,<br />\nRUBBER GLOVES,<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n<br />\nTHE CHARLES WILLMS SURG. INST. CO.,<br />\n<br />\nBALTIMORE.<br />\n20 Wert Lexington Street,<br />\nSpecial Discount to Students.<br />\n<br />\n300 NORTH HOWARD STREET,<br />\n<br />\n3:[. H. PETTING,<br />\n<br />\nBOOKS! SECOND-'HTENDI<br />\nSchool, Medical and Miscellaneous,<br />\n<br />\nManufacturer of<br />\n<br />\nGreek Letter Fraternity Jewelry,<br />\n213 NORTH LIBERTY STREET,<br />\nBALTIMORE, MD.<br />\nPlasm call and examine our line before purchasing.<br />\n<br />\nBALTIMORE, MARYLAND.<br />\n<br />\nBought, Sold and Exchanged.<br />\n<br />\nPIPPEN'S BOOK STORE<br />\nNEAR THE UNIVERSITY.<br />\n605 N. EUTAW<br />\nBALTIMORE'S LAROEST OLD BOOK STORE.<br />\n<br />\nST.<br />\n<br />\nJ. W. IM03•01.0.1.<br />\n<br />\nENT<br />\n<br />\ntint<br />\nRook Store,<br />\n<br />\nJ. W. BREEDLOVE & CO.<br />\nMERCHANT TAILORS<br />\nSTYLISH GARMENTS FOR GENTLEMEN.<br />\n<br />\nand HOWARD STS,<br />\n<br />\n116 WEST SARATOGA ST. NEAR HOTEL RENNERT<br />\n<br />\nText Books, Note Books, Students' Supplies.<br />\nBOOKS<br />\n<br />\nND STIN T1ONE<br />\nMiscellaneous Books<br />\nand Rare Editions.<br />\n<br />\nY<br />\n<br />\nBALTIMORE, MARYLAND.<br />\n<br />\nSMITH'S BOOK STORE,<br />\n805 N. HOWARD ST.,<br />\n3rd door above Madison St.<br />\n<br />\nWe have dies for the UNIVERSITY and MEDICAL SCHOOL.<br />\n<br />\nTHE EICHELBERGER 1300K CO.<br />\n308 Werth Charles Street.<br />\n<br />\nSCHOOL AND COLLEGE TEXT BOOKS<br />\nBOUGHT,SOLD AND EXCHANGED.<br />\n<br />\n10 West Saratoga Street.<br />\n<br />\nLEdYtiF4I-§<br />\nBetween<br />\n<br />\n6 and 9 P. M.<br />\n<br />\n11111111111•1111111111INIMMOMMI•MIIIMININIMMIIIMININIM<br />\n<br />\nSIM KM<br />\n13 West<br />\n<br />\nLexington St.<br />\nBALTIMORE, MD.<br />\n<br />\nono<br />\n>>r<br />\n0Z Xs'<br />\nZP<br />\nA<br />\nCA xi<br />\nin<br />\n<br />\nJohn S. Kerr<br />\nW. Parvis Rolph<br />\n<br />\nC. & P. Phone<br />\n<br />\nKERR & ROLPH<br />\nRaprosuling Arthur Johnson & Co..<br />\nNew York City.<br />\n<br />\nSporting Goods<br />\nand<br />\n<br />\nAthletic Supplies<br />\n304 PARK AVENUE,<br />\nBALTIMORE, MD.<br />\n<br />\n\fLemmert<br />\nTHE COLLEGE<br />\nMAN'S<br />\nThose who don't<br />\nknow may wear<br />\nW<br />\nx,<br />\n<br />\nFOWNES GLOVES<br />\n<br />\nThere is nothing like or equal to<br />\na LEMMERT Suit for style<br />\nOr comfort.<br />\n<br />\nThose who do<br />\nknow are sure to.<br />\n<br />\nLEMLNIERT<br />\n19 W. SARATOGA STREET.<br />\n<br />\nBOOKBINDING<br />\nWe Bind Tastefully<br />\n<br />\n••••••••••••••••••••••••••••••••••••••<br />\n•<br />\n•<br />\n••<br />\n•<br />\nSpecimens Submitted with Pleasure.<br />\n*<br />\n•<br />\nS<br />\n•<br />\n*<br />\n•<br />\nRk./ZICK<br />\n*<br />\n•<br />\n•<br />\n•<br />\n609 N. EUTAW ST.,<br />\n•<br />\n•<br />\n••<br />\nTelephone. Mt. Vernon 3022.<br />\n•<br />\n•<br />\n•<br />\n•<br />\nJAMES CLARK, President.<br />\nC.HAREES S. MILLER, Cashier.<br />\n•<br />\n•<br />\nADVERTISI<br />\nFOR<br />\nNG<br />\nRATES<br />\nPAUL A, SEEGER. Vice Pte. EDWIN P. HAYDEN, Asst. Cashier.<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\nROUES<br />\necaQics 81101181<br />\n•<br />\n<br />\nBooks, Phamplets, Music, Etc.<br />\n9<br />\n<br />\nYLV<br />\n<br />\nIIINOMMINI11/11.0111.<br />\n<br />\nnot<br />\n<br />\nCapital,<br />\nSurplus and undivided profits, -<br />\n<br />\n$300,000.00<br />\n- $495,000.00<br />\n<br />\n44:<br />\n•<br />\n•<br />\ne<br />\n<br />\nSafe Deposit Vaults.<br />\nBoxes Rented. I•<br />\n•<br />\nCareful Attention to the interests of Depositors.<br />\nI<br />\nWe Invite You to Open an Account with Ifs.<br />\nI •<br />\n<br />\n•<br />\n<br />\nDOES ONE THING WELL<br />\nTHAT THING<br />\n6 tiood Shirts<br />\n$ 6.00<br />\n6 \"Special\" Full Dress<br />\n9.00<br />\n6 Extra<br />\n12.00<br />\nColored<br />\n6<br />\nShirts \"Special\"<br />\n10.50<br />\nFULL LINE MEN'S FURNISHINGS.<br />\nOur Small Store Expenses<br />\n<br />\nSTRATTON<br />\nSaves Von Money.<br />\n<br />\nShirt Making<br />\n<br />\nOPP. RENNERVS.<br />\n<br />\n—ALUMNI TO INSERT THEIR BUSINESS AND PROFESSIONAL CARDS<br />\nIN THE NEWS-LETTER.<br />\n<br />\nADDRESS<br />\n<br />\n•<br />\n0<br />\n•<br />\n•<br />\n<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n<br />\n•<br />\n<br />\n•<br />\n•<br />\n•<br />\n<br />\n•<br />\nTHE<br />\n5<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\nNEWS-LETTER,<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\ne<br />\n•<br />\n•<br />\n•<br />\n•<br />\n<br />\n226 N. LIBERTY<br />\n<br />\nWANTED<br />\n<br />\nIN THIS PAPER,<br />\n<br />\n•<br />\nJohns Hopkins University,<br />\n•<br />\n•<br />\ne<br />\n•<br />\n•<br />\nBALT'MORE.<br />\n*<br />\n•<br />\n••<br />\n<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n<br />\n•<br />\n•<br />\n•<br />\n41<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n••••••••••••••••••••••••••••••••••••••<br />\n<br />\n\f", "format": "basic_html", "processed": "-a morinainmumearsmeminfatona<br />\nTHE4011}60110FKINS UNIVERSITY<br />\nBA.LTIMORE<br /><br />\nTHE JOHNS HOPKINS<br />\nUNIVERSITY,<br />\nBALTIMORE. MD.<br />\n1110111111111111.14111SINIM<br /><br />\nTwenty-Ninth Year. Beginning October 4th, 1904.<br />\nIRA<br /><br />\nRioviSP:r3, President.<br />\nDean of the College Faculty.<br />\nDean of the Medical Faculty.<br /><br />\nEZWAIW U. GRIVFIN,<br />\nWILLIAM 11. 'HOWELL,<br /><br />\nINSTRUCTION.<br />\nFor Graduate Students:<br />\nIn Philosophy and the Arts. (Coursem for<br />\ncandidates for the degree of Ph. D.)<br />\nIn Medicine. (Courses for candidates for the<br />\ndegree of M.I).; courses for physi6arts).<br />\nFor Undergraduates:<br />\nAs candidates for the degree of B. A.<br />\n(.1)<br />\nAs special students.<br />\nLibraries.<br />\nlJni vor:o.ty,<br />\nl'eabody I reititut4, .<br />\nhibrary,<br />\nLaboratories.<br />\nCherniAry.<br />\nPhysO!s,<br />\nGeology and Minerals.<br />\nZoology.,<br />\nAn<br />\nPhysiology.<br />\nPathology s.rul Bacteriology.<br />\nPha.rinacology.,<br />\nPhysiological Chemist ry.<br />\nExperillIO'fi ml<br /><br />\nrfly<br /><br />\nohologY.<br /><br />\nSeminaries.<br />\nGreek.<br />\nLat.in.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\npe lit icii Eeonomy.<br />\nScience.<br />\nties.<br />\nMathematics,<br /><br />\n120,000 volumes.<br />\n150,000 volumes.<br />\n225,000 volumes.<br />\nDirectors.<br />\nIra Reonsen.<br />\nJoseph S. ilme.s.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P, Malt<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn 1, Abel.<br />\nJohn .1. Abel<br />\nIV:thorn Oster<br />\ni;eorie 1/. Stratton<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. if. Hollander<br />\nW. W. Willoughby<br />\nFrank Morley.<br />\nJoseph S. Ames,<br />\n1. Mark Baldwin<br /><br />\nUndergraduate Courses( leading to B. A.)<br />\n1.<br />\n2<br />\n3.<br />\n4.<br />\n5<br />\n0.<br />\n7.<br /><br />\nGroups.<br />\nClassical<br />\n(the \"old college course.\")<br />\nMathematical-Physical<br />\n(leading up to engineering).<br />\nChemical-biological<br />\n(leading up to Medicine).<br />\nGeological-Biolvical.<br />\nLatin-Mathematical.<br />\nHistorieal-Political<br />\n(leading up to law).<br />\nModern Languages.<br />\nSerial Publications.<br /><br />\nAmerican Journal of - Mathematics (vol. XXVI).<br />\nAmerican Chemical Journal (vol. XXXII).<br />\nAmerican Journal of Philology (vol. XXV).<br />\nStudies in Historical and Political Science (vol. XXII).<br />\nModern Language Notes (vol. XIX).<br />\nMemoirs from the Biological Laboratory (vol. VI).<br />\nContributions to A sayriology (vol. V).<br />\nTerrestrial Magnetism (vol. TX).<br />\nUniversity Circular (vol. XXIV).<br />\nProgrammes of the courses offered to graduate students<br />\nin Philosophy and the Arts and in the department of Me41ieine, and also of the undergraduate or collegiate courses,<br />\nwill be sent on application to the Registrar.<br /><br />\nThe Johns Hopkins Press.<br />\nI.<br /><br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor, Quarterly. 4to, Vol<br />\ntime XXVI in progress. $5 per volume.<br />\nAmerican Chemical Journal.<br />\nI. RENISEN, Editor. Monthly. 8vo. Volume<br />\nXXXII in progress. $5 per volume.<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor.<br />\nQuarterly.<br />\n8vo. Volume XXV in progress.<br />\n$3 per<br />\nvolume.<br />\nStudies from the Biological Laboratory. 8vo. Vol.<br />\nurne V complete. $5 per volume.<br />\nStudies in Historical and Political Science.<br />\nMonthly. 8vo. Series XXII in progress.<br />\n$3<br />\nper volume.<br />\nJohns Hopkins University Circular<br />\n8vo. Vol. XXIV in progress. $1 per year.<br />\nJohns Hopkins Hospital Bulletin, Monthly. 4te<br />\nVolume XV in progress. $2 per year.<br />\nJohns Hopkins Hospital Reports. 4to. Volume<br />\nXII in progress. $5 per velum e.<br />\nContributions to Assyriology and Semitic Philology (Beitrage zur Assyriologie, etc.), Volume<br />\nV in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BRO()Ks, Editor. Volume VI in progress.<br />\n$7.50 per voliune.<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume XIX in progress. $1.50 per volume.<br />\nJournal of Experimental Medicine.<br />\nW. IT. WELCH, Editor.<br />\nBi-monthly.<br />\n8vo.<br />\nVolume VI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nHENRY M. ITURD, Editor, Quarterly. 8vo.<br />\n$5 per volume.<br />\nReports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\nTerrestrial Magnetism and Atmospheric Electricity.<br />\ni. A. BAUER, Editor. Quarterly. 8vo. Volume IX in progress. $2.50 per volume.<br />\nReprint of Economic Tracts.<br />\nJ. II, 'HOLLANDER, Editor. First Series, 1903,<br />\n$1.50. Second Series, 1904, $1.<br />\nXVII. Annual Report.<br />\nI'resented by the President of the Board of Trustees, reviewing the operations of the University during the past academic year.<br />\nXVIII. Annual Register.<br />\nGiving the list of officers and students, and stating the regulations, etc., of the University.<br />\n.Poblished at the close of the academic. year.<br /><br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus<br />\non application.<br />\nRowland 's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings,<br />\nEditor. 1.16 pp. 4to. 50 plates. $10.00 cloth.<br />\nThe Teaching of the Apostles. Complete facsimile edition. Edited by ,I. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS. with Antile•<br />\ngomena Epistles. Edited by T. Ii. Hall. $3.00.<br />\nRibliographia Ilopkinmiensie. Part I, Philology. Parts<br />\nChemistry, Mineralogy and Geology.<br />\nParts<br />\nIV-V-VI, Physics, Agronomy and Mathematics, 8vo.<br />\n30 cents per part.<br />\nA full list of publications will be sent on application.<br /><br />\nCommunications in respect to exchanges and remittanoes<br />\nmay be sent to Johns Hopkins Press, Baltimore, Md.<br /><br />\nThe News-Letter<br />\nVol. IX.<br /><br />\nJanuary 20, 1905,<br /><br />\nNo. 6<br /><br />\nA Hard Lesson.<br />\n\"No, Frank; I do not expect you to admit<br />\nthat all men are selfish. That would be asking too much; and then, you yourself will<br />\nalways shine as a brilliant exception.\"<br />\nThe man passed the reins into his right<br />\nhand and turned to the girl quickly, with<br />\nlips compressed, and an unmistakable frown<br />\non his face. Then his mouth widened into<br />\na smile.<br />\n\"Edith, if you begin any more of your<br />\nsarcasm, I declare I'll turn the buggy into<br />\nthe ditch, and set you in those blackberry<br />\nbushes. Why on earth do you talk such rot<br />\n—pardon me, but it is rot—just when I am<br />\nenjoying myself by airing my pet little<br />\nviews? Moreover, you are scarcely respectful to your future lord and master.\"<br />\nThe girl started. \"Frank,\" she said suddenly, \"how long have we been engaged?<br />\nFour months it has been, has it not? And<br />\nwe are to be married in four weeks more.<br />\nDoes it ever occur to you that we are making rathed rapid work of it? I have sometimes thought that it might be better, after<br />\nall, if—\"<br />\n\"What might be better?\" He watched<br />\nher closely as her eyes fell to her left hand.<br />\n\"Oh, nothing;\" and he knew from the answer and the tone that coaxing would be<br />\nof no use.<br />\n\"Edith, do you see those two men in the<br />\nyellow trap just ahead? Well, the one in<br />\nthe gray clothes is Charlie Hanson, who sold<br />\nme this horse. I heard from a mutual acquaintance that he gave himself grand airs<br />\nafter the deal, because he had got the best<br />\nof the bargain. Now, I think I'm a pretty<br />\ngood judge of horses, and I'm willing to bet<br />\nthat this horse is worth the money I paid<br />\nfor her.\"<br />\n\"Naturally;\" said the girl, \"or you would<br />\nnot have paid it.\"<br />\nThe man did not heed the interruption,<br />\nand went on, \"Let's catch up to them. I<br /><br />\nwant to see what sort of a nag he's driving<br />\nto-day.\"<br />\nHe flicked the reins on the horse's back,<br />\nand the carriages came side by side. The<br />\ntwo men greeted each other coldly, and presently—after the three-cornered introduction<br />\nwas over—Frank threw out a feeler.<br />\n\"Charlie, this is a pretty good mare you<br />\nsold me. She's speedy at times. She showed<br />\n2.32 at the track last week. Is that one<br />\nyours?\" pointing to the other horse.<br />\n\"Yes,\" was the answer. \"I got her last<br />\nmonth, and she's rather fast. Suppose we<br />\ntry them together—say to the next milehouse.\"<br />\n\"Done,\" was the reply, and each whipped<br />\nup his horse.<br />\nSelfishness is a trait which manifests itself in a variety of ways. Some men it<br />\nmakes conceited. Others become lazy because of it. Still other men are drawn by<br />\nit to seek an eternal good time. To the third<br />\nclass belonged Frank Doane. He prided<br />\nhimself on his \"sporting instincts,\" which,<br />\nbeing examined, comprised solely a desire<br />\nfor pleasure at the expense of anything else;<br />\nand anything else might include his friends,<br />\nhis money, or, at present, the girl he was to<br />\nmarry. As the light buggy was flying down<br />\nthe road, almost abreast of the other team,<br />\nhe forgot Edith and everything except the<br />\nfact that he had been challenged to a race,<br />\nand must do his best to win it. He did not<br />\nallow the idea of danger to enter his head.<br />\nThe road was clear, he was an experienced<br />\ndriver, and there could be no danger. As<br />\nfor asking Edith's permission, it seemed entirely unnecessary.<br />\nHe laid the whip on heavily, until the<br />\ncarriage rocked like a row boat as it bounded<br />\nover stones and ruts. Yet the other horse<br />\nkept just a few yards ahead. Hanson kept<br />\na firm hold on the reins, and looked back<br />\nover his shoulder with a smile which drove<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nDoane to let his horse have full control of the<br />\nbit. The speed was frightful, and increased<br />\nevery second. The mile-house was passed<br />\nin no time. The slower horse, no longer<br />\nfeeling any curb, took matters entirely into<br />\nher own control, so that when a mounted<br />\npoliceman shouted a caution as the flying<br />\npair flashed by, Doane found it impossible<br />\nto check the mad pace of the mare, who was<br />\nnow almost winded and covered with foam.<br />\nHanson, however, had perfect control of his<br />\nhorse, and slowed down to a walk.<br />\nEdith had not made a sound. With hands<br />\nfast gripped to the seat, and with her face<br />\nset, she was like a statue, expecting every<br />\nmoment to be hurled from the buggy, but<br />\nshowing not a trace of her emotions in her<br />\nfeatures. She saw a speed-sign far down<br />\nthe road come nearer, and disappear in a<br />\nblur. Vehicles were drawn off to both sides<br />\nof the driveway, and she saw the frightened<br />\nfaces of the occupants and realized her danger. But danger did not occupy most of<br />\nher thoughts. She was wondering most at<br />\nthe man by her side. His hat had blown<br />\noff, his eyes were straining, his whole soul<br />\nabsorbed in his mad pleasure.<br />\nShe was<br />\nhaving his whole real self revealed to her.<br />\nIn the parlor, Frank Doane was the smoothest, most self-contained man to be found.<br />\nNow, he would not have heeded a pistol at<br />\nhis head, so entirely had he lost control of<br />\nhimself. This man was not the one she had<br />\nadmired for his steady hold on himself, for<br />\nhis thoughtfulness for women, and for his<br />\nbravery and gentleness. No; the creature<br />\nby her side was little better than one of the<br />\nhowlIng, maddened crowd she had once seen<br />\nat a race. And she was to marry him in<br />\na month. She shuddered at the thought.<br />\nBoth Frank and the horse had by this time<br />\ngotten their fill of racing; and as the horse<br />\nwas nearly run tired,. it slackened its speed.<br />\nThe girl pointed to a large automobile<br />\nabout two hundred yards distant, which was<br />\nrapidly approaching. As the space closed,<br />\nthe horse began to step sideways and to<br />\nshy; and the buggy was slewed around and<br />\nwent upon two wheels. It hung there for<br />\na few awful seconds, and then, as the terrified animal gave a final spring, it turned<br />\nover into the ditch, tearing loose the traces,<br /><br />\nand threw the man and woman into the<br />\nhedge beside the road. The horse continued<br />\nits flight. Neither person was much hurt,<br />\nand both rose. Edith with her silk skirt<br />\nin tatters, and Frank with a badly scratched<br />\nface. His apologies were profuse and pitiful. to hear. Miss Lawton received them<br />\nwith a perfectly calm face.<br />\n\"Let us get to the cars,\" was all she said,<br />\nand made her way through the crowd.<br />\nDoane made arrangements with Charlie Hanson, who had by this time overtaken them,<br />\nto bring the carriage home, and to look after<br />\nthe horse, which had been stopped a short<br />\ndistance down the road and was now being<br />\nled back. Frank had a great desire to lay<br />\nviolent hands on Hanson, who, with earnest<br />\ninquiries as to whether Miss Lawton was<br />\nhurt, and sincerest regrets that he had been<br />\nso foolish as to propose the race, was quick<br />\nto offer his services to get the horse and<br />\nbuggy home. Frank felt that -his position<br />\nwas very uncomfortable. He knew that, in<br />\nthe eyes of his fiancee, he had lowered himself irrevocably; and in the eyes of the<br />\ncrowd around him he had let a horse run<br />\naway and upset a woman, so that he was<br />\ndeserving of no pity. Hanson's horse had<br />\nbeaten his, and this was another sting. With<br />\na very full sense of having done a poor day's<br />\nwork, and feeling very small indeed, he accompanied Miss Lawton to the electric cars.<br />\nThe ride home was almost in silence. Both<br />\nhad learned a lesson, and were thinking over<br />\nwhat they had learned. When Miss Lawton's home was reached, she extended him<br />\nher hand, saying with a smile that nettled<br />\nhim, \"You will pardon me if I do not ask<br />\nyou to come in. I suppose I have enjoyed<br />\nthe drive. Good afternoon.\"<br />\nThe door closed in his face.<br />\nDoane called at her house that evening.<br />\nHer brother met him at the door.<br />\n\"Why, Frank, Edith left just a few minutes ago for her aunt's in Washington. No,<br />\nshe didn't seem to be hurt in the least. And,<br />\nby the way, she told me to give you this if<br />\nyou came to-night. She said you would understand.\" He handed him a small pasteboard box. It contained her engagement<br />\nring, and he understood.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n3<br /><br />\nThe Conference of The Association of American Universities.<br />\nNE of the most important events that<br />\nhave occurred recently at the University took place when the sixth<br />\nannual session of the Association of<br />\nAmerican Universities was held here.<br />\nduring the latter part of last week.<br />\nMany of the most distinguished figures in<br />\nthe colleges of the United States were present as delegates from their respective Universities. Six of the delegates were presidents of universities, and the others were<br />\nprofessors of wide renown in their own fields<br />\nof research and teaching.<br />\n. Tile conference began on Thursday of last<br />\nweek. The sessions, which were held in the<br />\nDonovan room, were not public, because the<br />\nsubjects under consideration were of great<br />\nimportance, and could be more thoroughly<br />\ndiscussed than if the public had been admitted to the meetings. After the first session the delegates were entertained at lunch<br />\nby the trustees and professors of this University. The tables were placed in McCoy Hall,<br />\nwhich was beautifully banked with palms.<br />\nIn the evening Mr. Theodore Marburg gave<br />\na reception for the delegates at his house on<br />\nMt. Vernon Place.<br />\nOn Friday morning the conference assembled in the Donovan room. Among the subjects discussed was that of the higher technical education and the instruction in graduate schools.<br />\nPresident Remsen believes<br />\nthat the length of time needed to prepare<br />\nfor and complete a modern professional<br />\ncourse is too great. In the first place, the<br />\nage of graduation from the leading colleges<br />\nin this country is becoming so high that students cannot begin their professional training until they are twenty-two or twentythree on the average. Then, too, the length<br />\nof the professional courses themselves is now<br />\nso great that some of the best years of a<br />\nman's life are taken up with preparatory<br />\nwork. President Remsen believes that in so<br />\nfar as it tends to prevent students from beginning their . professional or business life<br />\nuntil they are twenty-two or twenty-three,<br />\nthe present system of college training is seriously defective.<br />\nThe closing session of the conference was<br />\nheld on Saturday morning and at it papers<br />\nwere read on \"Opportunities for Higher Ed-<br /><br />\n0<br /><br />\nucation\" and \"Research in State Universities.\" President Van use of the University of Wisconsin said that he held that in<br />\nthe future the State Universities would be in<br />\na much stronger position with reference to<br />\nadvanced instructtion. A number of States,<br />\nhe said, are now granting large sums to their<br />\nuniversities for advanced instruction and research, and in the future State funds for such<br />\npurposes are sure to greatly increase in<br />\namount.<br />\nProfessor Page of the University of Virginia, gave an encouraging account of the<br />\nincrease in the resources of the Southern<br />\nState Universities. The people of the South,<br />\nhe said, favor strong support of such institutions.<br />\nA list of the delegates is as follows:<br />\nHarvard University—Dean James Barr<br />\nAmes and Prof. T. N. Carver.<br />\nYale University—President Arthur T.<br />\nHadley.<br />\nUniversity of Pennsylvania—Prof. J. H.<br />\nPenniman, Prof. J. C. Rolfe and Dean Clarence G. Child.<br />\nPrinceton University—Prof. W. M. Daniels, Prof. A. F. West and Prof. H. B. Fine.<br />\nColumbia University—Prof. Munroe Smith,<br />\nProf. W. H. Carpenter, Prof. henry M. Howe<br />\nand Mr. E. P. Keppel.<br />\nUniversity of Virginia—Prof. James Morris Page and President E. A. Alderman.<br />\nUniversity of Michigan—Prof. A. C.<br />\nMcLaughlin.<br />\nUniversity of Wisconsin — President<br />\nCharles R. Van Hise.<br />\nUniversity of California—President Benjamin I. Wheeler, Prof. Stringham and Prof.<br />\nLeuschner.<br />\nCornell University—Prof. Thomas F.<br />\nCrane.<br />\nCatholic University—Dr. Edward A. Pace<br />\nand Dr. Maurice Francis Egan.<br />\nClark University—President G. Stanley<br />\nHall.<br />\nLeland Stanford, Jr., University—Prof. A.<br />\nH. Suzzalo and Prof. Ellwood P. Cubberly.<br />\nUniversity of Chicago—President Harper<br />\nand Prof. Albion W. Small.<br />\nJohns Hopkins University — President<br />\nRemsen, Prof. Gildersleeve and Dr. William<br />\nH. Welch.<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br /><br />\nHeroines, Heroes and Villains in Modern Fiction.<br />\nMore than in price, more than in the manner of publication, more than in any particular connected plot, letter-press, or sale, has<br />\nthe novel of to-day changed from its predecessor of a generation ago, in the character<br />\nof its heroine. Our mothers and fathers<br />\nused to read in their novels of heroines of<br />\nthe fragile, clinging kind, who had \"willowy forms, and great, trustful eyes;\" heroines who could moralize ever so learnedly<br />\non almost any abstract subject, and reinforce<br />\ntheir opinions by numberless quotations from<br />\nclassic authors, yet who were content to be<br />\nguided, in all temporal matters, entirely by<br />\nmembers of the stronger sex; heroines who<br />\nfainted upon almost no provocation, wept<br />\nupon no provocation at all, and, in the last<br />\nchapter, generally accepted the hero's proposal of marriage by bursting into a flood<br />\nof glad tears, and fainting in his arms. The<br />\nhero, as befitted the Romeo of such a Juliet,<br />\nwas usually strong and brave, and \"full of<br />\na quiet dignity' —a veritable oak for such a<br />\ndrooping vine of a heroine to hold fast to.<br />\nThe modern heroine has got bravely over<br />\nall this. No sitting at home embroidering<br />\nsamplers, no poetic hours spent in painting<br />\nlandscapes, or in reading sentimental poetry,<br />\nfor her! She is an \"athletic girl,\" who plays<br />\ngolf and tennis, rides a bicycle, or manages<br />\nher, own automobile, and is, on the whole,<br />\nquite as well able to take care of herself, as<br />\nThe \"Gibson<br />\nany of her male friends.<br />\ngirl,\" the \"Christy girl,\" and half-a-dozen<br />\nother kinds of independent and very muscular girls, now hold the stage, from which<br />\ntheir elder sister, with her hoop-skirts and<br />\nvapors, has fled in dismay.<br />\nA corresponding change has taken place<br />\nin the hero. He must still be strong and<br />\nbrave, but principally in a physical sense.<br />\nHe must be a very paladin for dash and<br />\nvigor—equally ready to rescue a lady, shoot<br />\ndown a villain, or play the part of a king.<br />\nWhen he was at college, he was, of course,<br />\ncaptain of the 'varsity crew, or of the foot-<br /><br />\nball team! Of course, also, he had, and still<br />\nhas, an infinite contempt for books! The<br />\nvery first achievement of the hero of Richard<br />\nHarding Davis' latest novel, \"Captain Macklin,\" was to get himself expelled from college.<br />\nNor has the evolution of the villain been<br />\nless rapid or far-reaching than that of the<br />\nother principals in the story. No longer do<br />\nwe meet with the scheming Shylock, or the<br />\nloathsome Uriah Heep, any more than we<br />\nmeet with the womanly Portia, or the gentle<br />\nAgnes Wakefield. The crafty, serpent-like<br />\nkind of villain has given place to a villain<br />\nmoulded from much the same .knock-medown-and-drag-me-out sort of material as<br />\nthe hero is. The up-to-date villain glories<br />\nin making midnight attempts to abduct the<br />\nheroine, in attacking the hero with a band of<br />\ncut-throats, and in comporting himself generally in such a manner that the hero may<br />\nhave plenty of opportunity to show his mettle. Ile is equally as ready as the villain of<br />\nold, to lie, steal, murder, or do anything else<br />\nthat is evil; but he is, in addition, the possessor of a personality of the most dare-devil,<br />\nbrigand-like type—just as a villain should<br />\nbe in these strenuous times. He nearly always has to be killed in the last chapter, by<br />\nthe hero, in order to be gotten rid of.<br />\nIn the matter of personal appearance, heroines, heroes, And villains have all changed<br />\nless than in any other particular. Though now<br />\nstrong and buxom, the heroine is still the<br />\npossessor, in most cases, of a \"face which is<br />\na perfect oval,\" \"rose-bud lips,\" a \"silvery<br />\nvoice,\" and \"rebellious curls.\" The hero<br />\nis tall and broad-sohuldered, usually has<br />\ncurly hair, and, especially with women novelists, has the \"profile of a Greek god.\" Villains still have \"a cast in one eye,\" or are<br />\n\"hatchet-faced;\" but, on the whole, they<br />\nexhibit a far greater variety of types than<br />\neither the hero or heroine.<br />\nA Literary Critic.<br /><br />\n\"Oh, Shah!\" said the favorite wife of the<br />\nruler of Persia as he refused to buy her a<br />\nnew automobile.<br /><br />\n—Tiger.<br /><br />\nTHE NEWS-LETTER.<br /><br />\nTHE INTER-CLASS DEBATE.<br />\nNE of the many subjects of talk, among<br /><br />\nO<br /><br />\nthe little groups which gather in the<br />\ncorridors of McCoy Hall, is the coming inter-class debate. This will take place<br />\nduring the second week in March; but before<br />\nspeaking of the approaching debate, I would<br />\nlike to call attention to those that are past.<br />\nThe late Dr. Herbert B. Adams was the<br />\noriginator and first promoter of the interclass debates. Through his influence the<br />\nfirst was held in '98, and as the list of trophies testify, they have been continued yearly ever since. During this series each class<br />\nhas not obtained an equal share of the<br />\nhdnors, as the following table shows<br />\nYear of Debate.<br />\n1898<br />\n1899<br />\n1900<br />\n1901<br />\n1902<br />\n1903<br />\n1904<br /><br />\nWinning Class.<br />\n'98<br />\n'99<br />\n'01<br />\n'01<br />\n'03<br />\n'03<br />\n'05<br /><br />\nAnd moreover, the rewards have changed.<br />\nIn '98 the victors were presented with medals; in '99, as one of the successful debaters<br />\nsaid: \"There was a table full of books, a<br />\nbig stack for each fellow, more than he could<br />\nlug off at one time.\" From that time the<br />\ncustom of awarding books has been adhered<br />\nto; but the books are not presented until<br />\nsome time after the debate. By this arrangement the members of the winning team are<br />\nallowed to select what books they wish.<br />\nThis year much pleasure will be taken<br />\naway from the work by the absence of a feature of all past inter-class debates, namely,<br />\nDr. Guy Carleton Lee. The students of '05<br />\nand '06 will be the first to hold a debate<br />\nwithout the encouragement of his presence;<br />\nthough the memory of his energy, of his<br />\nstriking personality, and of one or two stinging remarks by which he pointed out our<br />\nmost glaring faults, will serve as a spur to<br />\nmake us put forth our best efforts. I know<br />\nhis absence is deeply regretted by both<br />\nclasses, and I, for one, would go a long way<br />\nto meet once more his kindly smile and<br />\ncheery greeting.<br /><br />\nBut despite Dr. Lee's absence, as the debates have always awakened a keen interest<br />\nin the past, there is no doubt that such will<br />\nbe the case in the present instance. Dr.<br />\nFrench has gained the respect and esteem of<br />\nboth classes by the manner in which he has<br />\nconducted the correspondence with Brown;<br />\nand aided by his efforts we will no doubt live<br />\nup to the high standard of excellence set by<br />\npast debates.<br />\nAs was the case last year, the same subject<br />\nhas been chosen which, later on, will be used<br />\nfor the debate with Brown. The subject is:<br />\n\"Resolved, that the economic and political interests of the United States demand the<br />\npermanent retention of the Philippine<br />\nIslands.\"<br />\nThe Seniors won the toss, and took the<br />\neast goal with the wind in their favor—I<br />\nmean they chose the negative side, the side<br />\nwhich the committee, composed of men from<br />\nboth classes, had previously decided upon as<br />\none Hopkins would take against Brown.<br />\nAmong the Senior candidates are Goldman, chairman of '05 class team, also chairman of the inter-collegiate committee;<br />\nCremen, secretary of '05 team; Stern, Bernstein, Zeigler, Straughn and Kohn.<br />\nAmong the Junior candidates are C. Smith,<br />\nchairman of '06 team; Singewald, secretary<br />\nof inter-collegiate committee; Menzel, Hammond, Blondheim, Griffith, Robinson,Brauns,<br />\nEdlavitch, Matthews, Shackelford, Dickey<br />\nand Ruth.<br />\nG. Mitchell Griffith, '06.<br /><br />\nJustice—Officer, what's the crime against<br />\nthe prisoner<br />\nPoliceman—He was caught stealing six<br />\nbottles of beer, your honor.<br />\nJustice—Discharged; you can't make a<br />\ncase out of six bottles.<br />\n—Tiger.<br />\nPastor ( to the convert)—Do you believe<br />\nin the laws of the church?<br />\n\"I do.\"<br />\nPastor (to the congregation)—Let us pray<br />\nfor this person.<br />\n—Yale Record.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br /><br />\nUbe 'Pews:col/Letter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br /><br />\nJANUARY 20, 1905.<br /><br />\nSubscription $1.50 per year.<br /><br />\n10 Cents a single copy.<br /><br />\nEditor in Chief,<br />\nTHOMAS OWINGS,<br />\nAssociate Editor in Chief,....-Outorm W. HAMMOND,<br />\nNews Editor,<br />\nH. FINDLAY FRENCH,<br />\n... THOMAS G. MACHEN,<br />\nAssistant News Editors.<br /><br />\n1905.<br />\n1906.<br />\n1906.<br />\n1906.<br /><br />\nW. R. STRAUGHN,<br />\nAthletic Editors,<br />\n{E. LELAND SHACKELFORD,<br />\nBusiness Manager,<br />\nG. WOLTERECK,<br />\nAssistant Business Manager,<br />\nCARLYLE BARTON,<br /><br />\n1905.<br />\n1906.<br />\n1905.<br />\n1906<br /><br />\nAddress all articles, communications,. etc., IO THOMAS<br />\nOWINGS, box 467, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\nG. WOLTERECK, box 677, J. H. U.<br /><br />\nEDITORIAL.<br />\nThe editorial staff of the \"Hullabaloo\"<br />\nare hard at work on the new book for this<br />\nyear, which promises to be a great success.<br />\nIn one thing especially it will, if the idea is<br />\nproperly supported, be an improvement on<br />\nits predecessors: there will be an attempt<br />\nto include in the book more material of interest to lower classmen, so that the book will<br />\nrepresent the whole University and not the<br />\nSenior Class alone. This result can only be<br />\ngained by the co-operation of the Junior and<br />\nFreshman classes, for of course it is very<br />\nhard for a Board composed wholly of Seniors<br />\nto discover and write up the various things<br />\nthat would most appeal to lower classmen.<br />\nThere has been a good deal of criticism of<br />\nthe \"Hullabaloo\" in recent years by Juniors<br />\nand Freshmen on the ground that it was almost exclusively a chronicle of the adventures, wit and glories of the Senior Class,<br />\nand yet the very men who criticised the book<br />\nwere the ones who might have helped to<br />\nmake it broader in scope. The editors of the<br />\n1905 \"Hullabaloo\" are anxious to receive<br />\ncontributions within the next two weeks—<br />\nsuch things as poems, stunts of various kinds<br />\nand drawings—from men in the Senior,<br />\nJunior and Freshman Classes. Poems may<br />\nbe on any subject, the funnier the better,<br />\nand of any length, although the kind of serialpoem that comes in sections is discouraged.<br /><br />\nThe drawings should be done in India ink<br />\non Bristol board about twice the size of<br />\nthe finished reproduction. The \"Hullabaloo\"<br />\nBoard is always glad to receive good<br />\npictures of girls, and also drawings for the<br />\ntitles of various subjects in the book. Even<br />\nif the contributors are not artists themselves,<br />\nalmost everyone knows one or more people<br />\nwho would be glad to do them some drawings for their year book if they were asked,<br />\nand therefore it is not a question of taking<br />\nany very great trouble about getting the<br />\npictures. Nevertheless, drawings are very<br />\nhard to obtain, not on account of the scarcity<br />\nof artists, but simply because the artists'<br />\nfriends are too lazy to ask for pictures. Of<br />\ncourse the \"Hullabaloo\" must of necessity<br />\nremain in large part a compilation of jokes<br />\nand \"stunts\" which are especially of interest<br />\nto the Seniors, but with a little trouble on the<br />\npart of every under-classman, it can be made<br />\nmuch more interesting both to themselves<br />\nand to their friends.<br />\nOn the evening of Saturday, January 21,<br />\nthe day after this issue is expected to come<br />\nfrom the press, the University will make its<br />\ndebut in a new field of athletics. On this<br />\nevening the recently organized basket ball<br />\nteam will begin its season with a game in<br />\nthe cage against the University of Maryland.<br />\nThe general enthusiasm basket ball has already awakened among the student-body<br />\nmakes it unnecessary for the NEWS-LETTER<br />\nto attempt to \"boom\" the new sport. Nevertheless, the paper can not refrain from wishing the team the success it so richly deserves,<br />\nand calling upon the students to give it their<br />\nunited support.<br />\nEvery successful athletic team requires<br />\nthree things: skillful players, money, and<br />\nWith the first requisite, as an<br />\nfriends.<br />\narticle on another page clearly shows, the<br />\nbasket ball team is bountifully supplied. To<br />\nprovide the second and third is at once the<br />\nduty and privilege of the students. Moreover, the first game in a season is always an<br />\noccasion upon which a large attendance of<br />\nfriendly rooters is peculiarly appropriate.<br />\nSuch an attendance shows the player that<br />\nhis hard work and his sacrifices preparatory<br />\nto making the team are appreciated, and that<br />\nhis fellow-students trust in his ability to<br /><br />\nTHE NEWS-LETTER.<br />\ndefend the good name of the Alma Mater;<br />\nhe is strengthened and plays a better game<br />\nthan he would otherwise be capable of. On<br />\nthe other hand, the memory of a cold reception at the opening game is apt to cling to a<br />\nteam and influence its work during the<br />\nwhole season. An additional and equally,<br />\npotent reason makes a large attendance Saturday night desirable. This is the fact that<br />\nthe management has pending arrangements<br />\nfor a number of games with strong out-oftown teams requiring large guarantees. Until evidence is secured that the attendance<br />\nduring the season will be large enough to<br />\ncover expenses, it would be folly for a team<br />\nwithout the financial backing of the Association to close the dates for these games.<br />\nUnless such evidence is given Saturday night<br />\nthe games will have to be played away from<br />\nhome.<br />\nIt is the object of the basket ball team to<br />\ngive its games social as well as athletic<br />\nstanding. In other colleges basket ball is<br />\na leading sport, and draws fashionable and<br />\ncultured audiences. Every precaution is being taken to put the contests here on the<br />\nhighest possible level. No one, in the opinion of the 1\\14w s-LvrTER, need hesitate to<br />\nbring a lady, and indeed, from present indications, the number present will be large.<br /><br />\nINTERSTATE BIBLE STUDY<br />\nINSTITUTE.<br />\nThe second annual Interstate Bible Study<br />\nInstitute, arranged as a means of promoting<br />\nBible study in the colleges of Maryland,<br />\nDelaware and the District of Columbia, was<br />\nsuccessfully held in Levering Hall, January<br />\n13-15. There were thirty-five delegates from<br />\nout-of-town, representing the Christian Associations of six different institutions. The<br />\nAssociations of Hopkins and the several medical schools in the city, furnished entertainment for the visitors.<br />\nThe program provided for inspirational addresses, and for conferences to determine<br />\nthe best methods of promoting Bible study,<br />\nespecially during the remainder of the college year. Friday evening, Dr. G. W. Ward,<br />\nof Western Maryland College, spoke on \"The<br />\nClaims of the Bible Upon College Men,\"<br /><br />\nand Saturday morning, Rev. W. F. Sheridan,<br />\npastor of Mt. Vernon Place M. E. Church,<br />\naddressed the delegates on \"The Benefit of<br />\nPersonal Bible Study.\" Sunday morning,<br />\nDr. Thomas Fell, president of St. John's<br />\nCollege, conducted a model Bible class. Mr.<br />\nR. H. Edwards, of New York, for three years<br />\nGeneral Secretary of the Yale Y. M. C. A.,<br />\nwas present Friday and Saturday, and gave<br />\nmany helpful suggestions. Other speakers<br />\nand leaders were: Messrs. W. H. Morriss,<br />\nGeneral Secretary for Baltimore; H. T. Waller, Inter-collegiate Secretary for Baltimore;<br />\nJ. M. Rice, Secretary B. &amp; 0. Y. M. C. A.;<br />\nG. L. Curry, president of the Association at<br />\nWestern Maryland College; and General<br />\nSecretary Addison.<br /><br />\nMR. WRIGHT LORIMER'S VISIT.<br />\nMr. Wright Lorimer, who is starring this<br />\nseason in the \"Shepherd King,\" which appeared at the Academy of Music last week,<br />\naddressed a large body of Hopkins students<br />\nin the Donovan Room, January 10th.<br />\nThe speaker was introduced by Dr. French<br />\nof the Dept. of Public Speaking. The subject<br />\nof his address was \"Literature as an Aid to<br />\nPublic Speaking.\" Though rather undersized and of an exceedingly high-strung temperament, Mr. Lorimer's personality is a<br />\nstriking one. His features are strong, and<br />\nhis rich voice, trained to the demands of the<br />\nstage, is supported by an earnestness that<br />\ncommands the attention of his hearers.<br />\nIn his address he tried to confine himself<br />\nto the subject in hand, which, however, was<br />\nan unfortunate one, for time and again his<br />\ntalk wandered off to the more pleasant fields<br />\nof his college life, and to his present task of<br />\nuplifting the stage. He spoke with feeling,<br />\nof the degeneracy which marks the American<br />\ntheatre, and expressed confidence that a reaction would come about. He appealed to<br />\nstudents especially, he said, to use their higher culture to cultivate in others a taste for<br />\na higher form of amusement, than that afforded by the present comic opera.<br />\nAt the close of his address, Mr. Lorimer<br />\nwas given a rousing \"Gee-Hee, Gee-Haa,\"<br />\nand seemed deeply moved by his reception.<br />\nHe is the son of a Methodist minister and is<br />\na graduate of the University of California.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n8<br /><br />\nBASKET BALL.<br />\nAlong with the general extension in athletics this year, the 'Varsity is to be represented also by a basket ball team. Captain<br />\nHolmes, who has worked energetically for<br />\nthis sport ever since the University opened,<br />\nhas been rewarded by a large number of<br />\nmen coming out for practice. These men,<br />\ntoo, are not mere amateurs at the game, but<br />\nknow the details thoroughly, and rank among<br />\nthe best athletes in the country.<br />\nCaptain Holmes himself is a noted basket<br />\nball player. Last year he was captain of the<br />\n\"Dixon\" team, of New Orleans, and by his<br />\nskill and persistency made the team one of<br />\nthe strongest in the State. Holmes is well<br />\nknown among the 'varsity boys because of<br />\nhis enthusiasm and his never-say-die spirit.<br />\nIt is this spirit which has made basket ball<br />\na factor in local sports. He canvassed the<br />\nmedical department and succeeded in getting out a number of \"stars,\" who, hitherto,<br />\nhad considered their time too valuable to be<br />\ndevoted to any form of athletics. These men,<br />\nwith Captain Holmes, promise to make the<br />\nnew sport popular at Hopkins.<br />\nProminent among these men are McClure,<br />\nHelmholtz, Houghton, Boyd, Strohbar, Cole,<br />\nWilliams, Taylor, Branham and Nichols.<br />\nMcClure was former captain of Ohio State<br />\nUniversity basket ball team, and is very<br />\nquick and accurate in his goal throwing.<br />\nHelmholtz is well known to the University<br />\nfollowers through his all around work in athletics. He and'Lyons, also a med., hold the<br />\ntennis championship in doubles of Maryland.<br />\nHe was formerly captain of the University of<br />\nWisconsin team. Houghton is a fourth year<br />\nmed. and is an old Hopkins football player.<br />\nHe was formerly captain of Ohio State Uni-<br /><br />\nversity basket ball squad. Boyd, of baseball<br />\nand football fame, is a \"star\" man from the<br />\nUniversity of Georgia. Strohbar is also a<br />\nvery good man. His goal throwing at times<br />\nborders on the sensational. Cole, Williams,<br />\nTaylor, Branham and Nichols are good players, but have not had the experience of the<br />\nex-captains.<br />\nThe first game will be this Saturday night<br />\n(January 21) in the cage. The University<br />\nof Maryland boys, who have taken up the<br />\nsport this year, will be our opponents. It is<br />\nhoped that the 'varsity boys will turn out<br />\nand give the team a cheer, for they deserve<br />\nit. If the team is financially successful, the<br />\nmanager promises us some rare treats in the<br />\nway of games with Cornell, Pennsylvania,<br />\nand other big teams.<br /><br />\nTHE TRACK TEAM OF 1905.<br />\nWith the fixing of February 11 for the<br />\nannual indoor track and field meet to be<br />\nheld in the \"cage,\" regular work has begun<br />\nin training. Capt. Hill has his men out regularly three and four times a week now in order to have them in proper shape on the night<br />\nof the eleventh of February. This will be<br />\nthe initial indoor meet of the season, and<br />\nin all probability it will be the only indoor<br />\nmeet of any prominence held in the city this<br />\nwinter. It was for a time hoped that the<br />\nspacious floor of the Fifth Regiment Armory<br />\nmight have been secured for the purpose of<br />\nholding this meet, but owing to the fact that<br />\nit is occupied by one of the leading business<br />\nfirms in the city its use was found to be<br />\nimpossible.<br />\nAlthough the \"cage\" does not afford so<br />\nlarge a field as does the armory, it will be<br />\na splendid place for holding the games. One<br /><br />\nTHE NEWS-LETTER.<br /><br />\nadvantage it has over the armory is that the<br />\ncompetitors may use spikes in the dirt floor.<br />\nThe track ought to be in good condition by<br />\nthe time of the meet, now that the curves are<br />\nbeing fixed up by new cinders being put on<br />\nthe banks. There seems to be only one drawback, and that is that the straightaway<br />\ndashes will be necessarily short. With this<br />\nexception, every other condition is favorable,<br />\nand all things point toward this meet being<br />\nthe most successful in the history of the<br />\nUniversity.<br />\nA special effort will be made to have representatives from many of the larger universities which have the reputation of developing fast teams. Besides the entries that<br />\nare always made by the Georgetown University and the University of Pennsylvania,<br />\nit is hoped that entries will be made by other<br />\ncolleges prominent in the athletic world. In<br />\naddition to these entries there will be the<br />\nusual number from the local clubs, \"prep\"<br />\nschools and colleges.<br />\nOne question which is giving a great deal<br />\nof trouble at present is deciding who the<br />\nrelay team will be that will be pitted against<br />\nHopkins in the coming meet. Several universities are trying for this place, foremost<br />\namong them being Pennsylvania. The last<br />\ntime Pennsylvania and Hopkins ran a relay<br />\nteam against one another Hopkins won. This<br />\nmakes \"Penn\" all the more anxious for such<br />\na race, and there is no doubt of its furnishing<br />\nfine sport. Another candidate in the field<br />\nis Georgetown. Of the two races between<br />\nthe Hopkins and Georgetown teams last season, each institution won one race. This<br />\ngoes to show that the two teams are about<br />\nevenly matched, and it seems that a third<br />\nmeeting is almost absolutely necessary in<br />\norder to decide the supremacy of the two<br />\nteams.<br />\nOther matters now before the track authorities are the considerations of dual track<br />\nmeets with the Haverford College and the<br />\nNaval Academy. Negotiations with the.<br />\nNaval Academy are about off because no<br />\nsuitable date can be fixed upon for holding<br />\nthe meet. It is also probable that the proposed meet with Haverford will not materialize because Haverford wishes it to be held<br />\non her own grounds, and the expenses accruing to such a trip would hardly justify<br />\nit. And so, all things being considered, it<br />\nseems that the dual meet with the University<br />\nof Virginia will be the only one Hopkins will<br />\nfigure in this year.<br /><br />\n9<br /><br />\nALUMNI NOTES.<br />\n'00—J. S. Moore, who took his bachelor of<br />\narts degree at the University in the class<br />\nof 1900, is studying philosophy in the Harvard Graduate School.<br />\n'02—Sidney Smith of Louisville, Ky., is<br />\nat the Harvard Law School.<br />\n'04—Frank Stollenwork, Jr., who graduated here last year, is now in the first year<br />\nof the Harvard Law School.<br />\n'96—St. George Sioussat is engaged in<br />\nwriting a \"Financial History of Tennessee,\"<br />\nto be a part of the Carnegie Financial History of the United States.<br />\n'81—Col. David T. Day of Washington, has<br />\nbeen appointed mining commissioner for the<br />\nLewis and Clark Fair at Portland, Oregon,<br />\nand will bring to Portland a large collection<br />\nof minerals displayed at St. Louis.<br />\nIra M. Remsen, President Remsen's son,<br />\nhas opened a studio in New York as a portrait painter. He has devoted much study,<br />\nboth at home and abroad, to this branch of<br />\nart.<br />\n'82—Richard Fuller Kimball, Assistant<br />\nStates' Attorney, Baltimore, died in Baltimore, January 1, 1905.<br />\n'96—Robert Lacy is taking a few months'<br />\nholiday in Cuba.<br />\nA LIMERICK.<br />\nSaid a husband you think I'm a St.<br />\nI will fool you a bit, for I a't.<br />\nNow please take a look,<br />\nWatch me wink at the cook.<br />\n* * * I I<br />\nNo, the black round his eye isn't pt.<br />\n—xchange.<br />\nTACT.<br />\nI went to a party with Janet,<br />\nAnd met with an awful mishap;<br />\nFor I awkwardly upset a cupful<br />\nOf chocolate into her lap.<br />\nBut Janet was cool—though it wasn't,<br />\nBut none is so tactful as she;<br />\nAnd smiling with perfect composure,<br />\nSaid sweetly—''The drinks are on me.\"<br />\n—Harvard Lampoon.<br />\nThere was an old lady named (?)<br />\nWho, alas! was most dreadfully leene.<br />\nIf a man was athletic<br />\nHis fate was pathetic,<br />\nAt the hands of this gentle squireene.<br />\nM. M. B.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nMy Rhyming Dictionary.<br />\nI am the proudest person that just ever you did see,<br />\nI wonder if you could but guess what Santa brought to me;<br />\nThough if you scan these verses, it will be unnecessary<br />\nTo tell you 'bout my fine new book—a rhyming dictionary.<br />\nBefore I had this lovely gift from dear old Santa Claus,<br />\nI used to have to pause and think, and think and think and pause;<br />\nBut now I copy down four rhymes from out this dictionary,<br />\nAnd just put anything before—as an auxiliary.<br />\nI do not have to search my brain to get the proper rhyme,<br />\nIt's easier to look it up, and saves a lot of time;<br />\nThe rhyme's the only thing that counts, the sense is secondary,<br />\nWhen I'm the proud possessor of a rhyming dictionary.<br />\nTo prove to you what I can do, I'll show my primal try,<br />\nOf course I get much better as each day goes flitting by;<br />\nBut the starter is the shortest that I ever had in stock,<br />\nThe latter ones are quite too long, they stretch a city block!<br />\nThough my rhyming's not innate,<br />\nYet I will not meditate,<br />\nThat I am a reprobate,<br />\nOf the highest of the arts;<br />\nThough I ought to educate,<br />\nInstigate and innovate,<br />\n(My, but I am doing great,<br />\nRhyming at an awful rate,)<br /><br />\nProcrastinate and stipulate,<br />\nCelebrate and calculate—<br />\nBut I'll really have to state,<br />\nThat they're more than ninety-eight<br />\nWhich can rhyme with prate and slate,<br />\nSo I better had abate,<br />\nLest relentless hand of Fate,<br />\nThrow the sharpest of her darts!<br /><br />\nOf course the sense is lacking, but that doesn't matter much,<br />\nIt is the rhyme we're after, not the writer's wordy touch;<br />\nThrow' learned logic to the dogs, for it is subsidiary,<br />\nIt doesn't matter 'bout the sense with such a dictionary.<br />\nBill Shakespeare should have had one when he wrote Lord Bacon's plays,<br />\nHe could have rhymed with fine effect in very many ways;<br />\nNow anyone can pass him with a poor extemporary,<br />\nOf course, provided that he has a rhyming dictionary.<br />\nAnd Milton, Pope, and Dryden would have surely made a hit,<br />\nHad they owned the dictionary, and had rightly followed it;<br />\nBut now to like their writings one must be an antiquary,<br />\nThey never had a chance to buy a rhyming dictionary.<br />\nI haven't got the slightest doubt that I can beat them all,<br />\nFor they are way, way out of date, 'tis I that have the call;<br />\nI will out-Shakespeare Milton—do every adversary,<br />\nSince I'm the proud possessor of a rhyming dictionary.<br />\n'06.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n11<br /><br />\nCHRISTMAS TRIP OF THE MUSICAL night. The clubs left Frederick on Saturday<br />\nmorning, arriving in Baltimore before noon;<br />\nCLUBS.<br />\nOn Tuesday, December 27, at an early<br />\nhour in the morning, the musical clubs<br />\nboarded the train at Camden Station. The<br />\nBaltimore and Ohio Railroad had provided<br />\na special car to accompany the clubs during.<br />\nthe entire trip, and in this way the inconveniences of travel were much lessened. The<br />\nforty-mile trip to Washington was covered<br />\nwith little incident.<br />\nAt Washington the<br />\ncar was coupled to another train; and in a<br />\nshort while the run was made to Harper's<br />\nFerry, and thence to Charlestown. In this<br />\ntown, the men were boarded at a girls' seminary, and certainly everyone was royally<br />\nentertained. Especial thanks and honor are<br />\ndue from all for the gastronomic treat so<br />\nkindly furnished by one ''inmate'' of the<br />\nseminary.<br />\nThe concert at Charlestown was very successful, and was received in a most appreciative manner. At eleven o'clock Wednesday morning the clubs proceeded on their<br />\njourney. At Weverton, where there was a<br />\nwait of two hours, the men amused themselves by sliding on the ice. The concert<br />\nat Winchester was perhaps not as well received as the one given at Charlestown, but<br />\nthe men had a pleasant time, and enjoyed<br />\na fine \"feed\" after the duties of the evening<br />\nwere over. The next town to be visited<br />\nwas Hagerstown. There some of the fellows<br />\namused themselves by advertising the concert in a way which one of the staid inhabitants said \"lowered the dignity of the University,\" but which, to say the least, was perfectly harmless. The concert, which was<br />\ngiven at the hotel, was probably the best of<br />\nthe trip, from the point of view of musical<br />\nexcellence.<br />\nOn Friday morning the men boarded the<br />\ntrain for Frederick, en route to which a stop<br />\nwas made at Weverton, and a game of hockey<br />\nwas enjoyed. The largest audience of the<br />\nfour attended the concert at Frederick,<br />\nwhere a dance was given to the<br />\nmen after the. entertainmentt. A supper was enjoyed by the clubs, after<br />\nthe dance, through the kindness of Dr.<br />\nWhittle, and the thanks of all are due him<br />\nfor this addition to the pleasures of the trip.<br />\nSome mild \"stunts\" were done by the<br />\nfreshmen before the men adjourned for the<br /><br />\nand thus a pleasant Christmas vacation was<br />\ncompleted.<br /><br />\nTHE TURNBULL AND HERTER<br />\nLECTURES.<br />\nThe Turnbull Lectures will be given this<br />\nyear by Dr. George E. Woodberry, lately professor of comparative literature at Columbia<br />\nUniversity. There will be eight lectures,<br />\nthe general subject being \"The Poteic Forms<br />\nof Life.\"<br />\nThe lectures will be given in McCoy Hall<br />\nas follows:<br />\nMonday, March 27—\"Illusion.\"<br />\nTuesday, March 28—\"The Poetic Form of<br />\nNature.\"<br />\nThursday, March 30—\"The Poetic Form<br />\nof Intellect.\"<br />\nFriday, March 31—\"The Poetic Form of<br />\nthe Emotions.\"<br />\nMonday, April 3—\"The Poetic Form of<br />\nthe Will.\"<br />\nTuesday, April 4—\"The Affirmation of<br />\nLife.\"<br />\nThursday, April 6—\"The Denial of Life.\"<br />\nFriday, April 7—\"Reality.\"<br />\nDr. Woodberry is a graduate of Harvard,<br />\nand was for three years professor of English<br />\nin the University of Nebraska. He served<br />\non the editorial staff of the \"Nation\" for a<br />\nyear, and from 1891 to 1903 was professor<br />\nof comparative literature at Columbia. He<br />\nis well known as a writer both in poetry and<br />\nprose, and has edited valuable editions of<br />\nthe works of a number of authors.<br />\nDr. Hans H. Meyer, professor of pharmacology in the University of Vienna, has accepted the invitation to deliver the second<br />\ncourse of Herter Lectures next October. The<br />\nfirst course was given last spring by Prof.<br />\nPaul Ehrlich, of Frankfort-on-the-Main.<br />\nProfessor Meyer ranks as one of the first<br />\npharmacologists of the day. About a year<br />\nago, in connection with Dr. Frederick Ransom, he made an important contribution to<br />\nthe theory of the action of the poison of<br />\ntetanus, or lock-jaw.<br />\nAbsent minded Professor—Gentlemen, I<br />\nhave no time to call the roll to-day. Those<br />\nwho are absent may simply hold up their<br />\nhands.<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br /><br />\nNotes From All the Colleges.<br />\nPrinceton offers a new degree, that of<br />\nBachelor of Letters, which is to be given to<br />\nstudents who enter college without Greek,<br />\nand who take no classical work in their<br />\ncourse.<br />\nProfessor Bailey, assistant professor of<br />\neconomics at Yale, is authority for the statement that the average student at Old Eli<br />\nspends $1,100 a year. Some spend only<br />\n$300 while others go as high as $3,000.<br /><br />\nPresident Butler and Professor Brander<br />\nMatthews, of Columbia, at a recent banquet<br />\nat the Quill Club, in New York, predicted<br />\nthat the universities of the future would be<br />\nin the largest cities. \"No one to-day,\"<br />\nsaid Brander Matthews, \"would think of<br />\nfounding a university at Ithaca, New Haven<br />\nor Princeton.\"<br /><br />\nYale's football receipts for 1904 were<br />\nabout $70,000. The main features of the<br />\ntotal were: Yale-Harvard game, total, about<br />\nYale's share, $31,000. Yale.<br />\n$62,000;<br />\nthat<br />\nbelieve<br />\npresidents<br />\nOnly three college<br />\ntotal, $44,000; Yale's share,<br />\ngame,<br />\nPrinceton<br />\ncollege<br />\nto<br />\nself-support is no hindrance<br />\ngame, total, $22,000;<br />\nYale-Columbia<br />\n$22,000.<br />\nis<br />\nwork<br />\nstudies; fifty report that outside<br />\nmaking a total of<br />\n$11,000,<br />\nshare,<br />\nYale's<br />\nsomewhat hampering, and but two consider<br />\nbig games of the<br />\nthree<br />\nthe<br />\nfor<br />\nabout $64,000<br />\nit seriously detrimental.<br />\nminor games<br />\nthe<br />\nfrom<br />\nyear. The receipts<br />\ntotal for the<br />\nthe<br />\nA three-thousand-mile trip during the were about $7,000, making<br />\nChristmas vacation was taken by the Yale season about $70,000. What the expenses<br />\nbasket ball team, breaking all records for were has not been footed up yet, but there<br />\nwinter sport in inter-collegiate organizations. will be a big surplus.<br />\nTwo hours' college credit is given to Michigan 's representatives in the inter-collegiate<br />\ndebates and oratorical contests. The wonder is, not that Michigan gives credit to her<br />\ndebaters, but that other universities have<br />\nnot long ago adopted the same plan. No<br />\ncourse in a college curriculum requires more<br />\nThe gift of $50,000 by Edward D. Adams, consistent intellectual labor than the debates.<br />\nin memory of his son, Ernest K. Adams, to Why this work should not be credited is<br />\nColumbia University for the foundation of a a puzzle to the average student.<br />\npsychical research fellowship was announced<br />\nOn the evening of December 10 the twelfth<br />\nat the meeting of the university trustees.<br />\nannual debate between Yale and Princeton<br />\neducawas held in Woolsey Hall. The subject for<br />\nRecent statistics show that college<br />\nthan<br />\ndebate was: \"Resolved, That it should be<br />\ntion is far more expensive in the East<br />\nthe policy of the United States not to hold<br />\nin the West.<br />\nterritory permanently unless with the purAndrew Carnegie has just given Prince- pose that it shall ultimately enjoy stateton $385,000 for the construction oS an arti- hood.\" Yale supported the affirmative, and<br />\nwon the debate.<br />\nficial lake to be called \"Princeton Lake.\"<br /><br />\nThe class of '84 of Amherst has offered<br />\n$10,000, to be used for the restoration of<br />\nCollege Hall, on condition that the trustees<br />\nThe gift of $10,000 is the<br />\nraise $5,000.<br />\nlargest any class has ever made to the institution.<br /><br />\n7\\t.<br /><br />\n\"A WMAG EQUIPPED ESTABLISHMENT'•<br />\nADDS TO OUR, FACILITIES FOR TAMORING<br /><br />\niAlm1?01\\si<br /><br />\nWe Have Polite Salesmen.<br />\nWe Have Expert Cutters.<br />\n421<br /><br />\nWe Have a Large Assortment of Materials.<br /><br />\nN. ik)wiwi.) •-s, I .<br />\nIiR\\,\\'‘',W,<br /><br />\nAT POPULAR PRICES.<br /><br />\nDOCW.N ttdOW Frorklitt<br /><br />\nkv,kyti, V.t( .<br /><br />\nk)pillor<br /><br />\n1 Ito 1%k%st(jk\\t iih kit $1.0o Per Poll',<br />\nnom..,nowat.offirmupprOmpm....rvoins.winnuawimero.ournrommammos<br /><br />\nCOLLEGE AND CLASS STATIONERY,<br />\nMENU AND BANQUET CARDS.<br /><br />\nWcyforth Az Sons,<br />\n...Tailors...<br />\n217-219 North PBC&amp; Street,<br />\nJ. U.1.11A)<br /><br />\nDOWNS.<br />\nSTATIONER AND ENGRAVER,<br /><br />\nBaltimore, WI.<br /><br />\nrt aft with C.4.1, ei 111 n<br /><br />\nihr ID NUNN<br /><br />\n2'29 NORTH ClIARLBS STREET<br /><br />\n(11t<br /><br />\nN I J NN &amp;<br /><br />\nCOM<br /><br />\nPA N Y ,<br /><br />\n--BOOKSELLERS Fl ND ST IA TiONEN S227<br /><br />\nNORTH HOWARD STREET, Between Lexington and Saratoga Streets, BALTIMORE, MD.<br />\nAll Telt Books used at the Johns Hopkins University promptly supplied. Full line of Stationery., Note Books,eta.<br />\nPAPER STAMPED WITH COLLEGE HEADING.<br />\n.1••••••••••••••••••••••a.<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nNew York to Bremen. London, Paris, Gibraltar, Naples., Genoa, etc.<br />\nBALTIMORE TO BREMEN DIRECT.<br /><br />\n119 S. Hanover St.<br /><br />\npartic. Wars a os)ly to<br /><br />\nKlio<br /><br />\nllooltritz<br /><br />\nA. SCHUMACHER &amp; CO., General Agents<br />\nMICROSCOPIC SUPPLIES.<br />\nDISSECTING CASES,<br /><br />\nSuccessor to Cummins.<br /><br />\nM1CROSCOPE.S,<br />\nRUBBER GLOVES,<br /><br />\nARTISTIC PHOTOGRAPHY<br /><br />\nTHE CHARLES WILLMS SURG. INST. CO.,<br /><br />\nBALTIMORE.<br />\n20 Wert Lexington Street,<br />\nSpecial Discount to Students.<br /><br />\n300 NORTH HOWARD STREET,<br /><br />\n3:[. H. PETTING,<br /><br />\nBOOKS! SECOND-'HTENDI<br />\nSchool, Medical and Miscellaneous,<br /><br />\nManufacturer of<br /><br />\nGreek Letter Fraternity Jewelry,<br />\n213 NORTH LIBERTY STREET,<br />\nBALTIMORE, MD.<br />\nPlasm call and examine our line before purchasing.<br /><br />\nBALTIMORE, MARYLAND.<br /><br />\nBought, Sold and Exchanged.<br /><br />\nPIPPEN'S BOOK STORE<br />\nNEAR THE UNIVERSITY.<br />\n605 N. EUTAW<br />\nBALTIMORE'S LAROEST OLD BOOK STORE.<br /><br />\nST.<br /><br />\nJ. W. IM03•01.0.1.<br /><br />\nENT<br /><br />\ntint<br />\nRook Store,<br /><br />\nJ. W. BREEDLOVE &amp; CO.<br />\nMERCHANT TAILORS<br />\nSTYLISH GARMENTS FOR GENTLEMEN.<br /><br />\nand HOWARD STS,<br /><br />\n116 WEST SARATOGA ST. NEAR HOTEL RENNERT<br /><br />\nText Books, Note Books, Students' Supplies.<br />\nBOOKS<br /><br />\nND STIN T1ONE<br />\nMiscellaneous Books<br />\nand Rare Editions.<br /><br />\nY<br /><br />\nBALTIMORE, MARYLAND.<br /><br />\nSMITH'S BOOK STORE,<br />\n805 N. HOWARD ST.,<br />\n3rd door above Madison St.<br /><br />\nWe have dies for the UNIVERSITY and MEDICAL SCHOOL.<br /><br />\nTHE EICHELBERGER 1300K CO.<br />\n308 Werth Charles Street.<br /><br />\nSCHOOL AND COLLEGE TEXT BOOKS<br />\nBOUGHT,SOLD AND EXCHANGED.<br /><br />\n10 West Saratoga Street.<br /><br />\nLEdYtiF4I-§<br />\nBetween<br /><br />\n6 and 9 P. M.<br /><br />\n11111111111•1111111111INIMMOMMI•MIIIMININIMMIIIMININIM<br /><br />\nSIM KM<br />\n13 West<br /><br />\nLexington St.<br />\nBALTIMORE, MD.<br /><br />\nono<br />\n&gt;&gt;r<br />\n0Z Xs'<br />\nZP<br />\nA<br />\nCA xi<br />\nin<br /><br />\nJohn S. Kerr<br />\nW. Parvis Rolph<br /><br />\nC. &amp; P. Phone<br /><br />\nKERR &amp; ROLPH<br />\nRaprosuling Arthur Johnson &amp; Co..<br />\nNew York City.<br /><br />\nSporting Goods<br />\nand<br /><br />\nAthletic Supplies<br />\n304 PARK AVENUE,<br />\nBALTIMORE, MD.<br /><br />\nLemmert<br />\nTHE COLLEGE<br />\nMAN'S<br />\nThose who don't<br />\nknow may wear<br />\nW<br />\nx,<br /><br />\nFOWNES GLOVES<br /><br />\nThere is nothing like or equal to<br />\na LEMMERT Suit for style<br />\nOr comfort.<br /><br />\nThose who do<br />\nknow are sure to.<br /><br />\nLEMLNIERT<br />\n19 W. SARATOGA STREET.<br /><br />\nBOOKBINDING<br />\nWe Bind Tastefully<br /><br />\n••••••••••••••••••••••••••••••••••••••<br />\n•<br />\n•<br />\n••<br />\n•<br />\nSpecimens Submitted with Pleasure.<br />\n*<br />\n•<br />\nS<br />\n•<br />\n*<br />\n•<br />\nRk./ZICK<br />\n*<br />\n•<br />\n•<br />\n•<br />\n609 N. EUTAW ST.,<br />\n•<br />\n•<br />\n••<br />\nTelephone. Mt. Vernon 3022.<br />\n•<br />\n•<br />\n•<br />\n•<br />\nJAMES CLARK, President.<br />\nC.HAREES S. MILLER, Cashier.<br />\n•<br />\n•<br />\nADVERTISI<br />\nFOR<br />\nNG<br />\nRATES<br />\nPAUL A, SEEGER. Vice Pte. EDWIN P. HAYDEN, Asst. Cashier.<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\nROUES<br />\necaQics 81101181<br />\n•<br /><br />\nBooks, Phamplets, Music, Etc.<br />\n9<br /><br />\nYLV<br /><br />\nIIINOMMINI11/11.0111.<br /><br />\nnot<br /><br />\nCapital,<br />\nSurplus and undivided profits, -<br /><br />\n$300,000.00<br />\n- $495,000.00<br /><br />\n44:<br />\n•<br />\n•<br />\ne<br /><br />\nSafe Deposit Vaults.<br />\nBoxes Rented. I•<br />\n•<br />\nCareful Attention to the interests of Depositors.<br />\nI<br />\nWe Invite You to Open an Account with Ifs.<br />\nI •<br /><br />\n•<br /><br />\nDOES ONE THING WELL<br />\nTHAT THING<br />\n6 tiood Shirts<br />\n$ 6.00<br />\n6 \"Special\" Full Dress<br />\n9.00<br />\n6 Extra<br />\n12.00<br />\nColored<br />\n6<br />\nShirts \"Special\"<br />\n10.50<br />\nFULL LINE MEN'S FURNISHINGS.<br />\nOur Small Store Expenses<br /><br />\nSTRATTON<br />\nSaves Von Money.<br /><br />\nShirt Making<br /><br />\nOPP. RENNERVS.<br /><br />\n—ALUMNI TO INSERT THEIR BUSINESS AND PROFESSIONAL CARDS<br />\nIN THE NEWS-LETTER.<br /><br />\nADDRESS<br /><br />\n•<br />\n0<br />\n•<br />\n•<br /><br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br /><br />\n•<br /><br />\n•<br />\n•<br />\n•<br /><br />\n•<br />\nTHE<br />\n5<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\nNEWS-LETTER,<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\ne<br />\n•<br />\n•<br />\n•<br />\n•<br /><br />\n226 N. LIBERTY<br /><br />\nWANTED<br /><br />\nIN THIS PAPER,<br /><br />\n•<br />\nJohns Hopkins University,<br />\n•<br />\n•<br />\ne<br />\n•<br />\n•<br />\nBALT'MORE.<br />\n*<br />\n•<br />\n••<br /><br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br /><br />\n•<br />\n•<br />\n•<br />\n41<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n••••••••••••••••••••••••••••••••••••••<br /><br />"}], "field_media_file": [{"target_id": 36285, "display": null, "description": null, "target_type": "file", "target_uuid": "dcd6be3a-e268-4324-ae6f-5278455a351d", "url": "http://digital.library.jhu.edu/system/files/2022-03/12260-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12260, "target_type": "node", "target_uuid": "399b020d-2abb-438a-9dae-95f805bf2dd9", "url": "/node/12260"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "abc8fcf3-dc33-48c0-8c0f-f691b2756197"}]}