{"mid": [{"value": 35645}], "uuid": [{"value": "cfe5501d-b34a-46cd-9169-47199f334a6f"}], "vid": [{"value": 35645}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:10:27+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12186-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:10:27+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:10:27+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol. VI, No. 3<br />\n<br />\nNovember 6,1901.<br />\n<br />\n\fJOHNS HOPKINS UNIVERSITY.<br />\n<br />\nThe Johns Hopkins Press.<br />\n<br />\neALTimORE, MO.<br />\nI.<br />\n<br />\n....11,101111111111111.110<br />\n<br />\nTiventreSixth Year.<br />\n<br />\nI)iioil<br />\nIh<br />\n<br />\nBeginning October It, 1901.<br />\n<br />\nIRA REMSEN.<br />\nWM. H. HOWELL.<br />\nEDW. H.(1 RIF FIN.<br />\n<br />\nflu' .11<br />\n<br />\no.I i !to<br />\n<br />\nINsrtzucTio‘i<br />\nFor (imamate Students:<br />\n(a) In Philosophy and the A rts. (('ourses for cantli<br />\ndatre for the degree of Ph. D.)<br />\n(b) lii Medieine. •(Cowie-s for candidates...for the degree of M. D.; cours's far physicians.)<br />\nFor Undergraduates:<br />\n(e) As4.qtudidetes for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLibraries of Baltimore.<br />\nU niversity..... ........<br />\nPeabody Institute.<br />\nPratt Library<br />\n<br />\n............ 100,000 volumes.<br />\n•,<br />\n135,01'0 yolune.s.<br />\n•<br />\n200.000 volumes.<br />\n<br />\nLaboratories.<br />\nChemistry,<br />\nP5hysi' a.<br />\nGeology'and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPhNrmacology,<br />\nPhysiologleal +item 1st ry,<br />\nMedleinv,<br />\n<br />\nlileit.et ors.<br />\n1 ti nem xen.<br />\n.1 use oh s...4rnes.<br />\n11,dil jam; II. (liark.<br />\n/3.ors•irs.<br />\nPraoh.'in I). :Irak.<br />\n1111.1(al<br />\n117/liata Jr. welch.<br />\n<br />\n..b.ht#„1. \"11,d.<br />\n<br />\nJohn .1. Abet.<br />\nWI/tiara 014IcrDirectors.<br />\nBasil L. Gildersleeve. '<br />\nKirby 14`; ±•;mith.<br />\nManner Bloomfield<br />\nPaul Haupt.<br />\nHenry IVood.'<br />\nA. Marshall- Eniott.<br />\nJames W. Bright.<br />\nM. Vincent.<br />\n- tT H. Hotkinder.<br />\nFrank Morley.<br />\nJoseph S. Ames,<br />\n<br />\nUndergraduafeS Courses<br />\n<br />\n(leading to B. A.)<br />\n<br />\nAmerican Journal of Mathernaties.<br />\nF. MOH LEY, Editor. Quarterly. 4th. Volume X XIV .<br />\nIn progress:' 1115 per volume.<br />\nII. American Chemical Journal. • • ,<br />\nI. R EMMEN, Editor. Monthly. 8vo. ,'Volume XXVI<br />\nIn progress. $5 per volume.' .<br />\nIII. American Journal of PhiliologY,<br />\nB. L. GILDERSLEEVE, E4ii0r. Quarterly. fivo.<br />\nVolume XXII in progress. `Iti per volume.<br />\nIV. studies from the Biological Laboratory. 8Yo.<br />\nVolume V complete. $5 per volume.<br />\nV. Studies in Historical and Political Science,<br />\n• Monthtv. 8vo. Series XIX in progress. $3 per<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of a dentifie and literary work<br />\nin progress in Baltimore. 4to. Vol. XX kit progress. $1 per year.<br />\nMonthly. 41o.<br />\nVII. John I itipkins Hospital<br />\nVolume XIT in progress. $1 per yeart<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume X<br />\nin irrogress. $5 per volume.<br />\nIX. contributions to Assyrielogy and Comparative<br />\nsemitie Philology,(Beitrage zur A ssyriologie,etc.)<br />\nVol. IV in progress.<br />\nX. memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nX<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVI in progress. $1.50 per volume.<br />\nXIL Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Bi-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nxurt. American Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 4t0., $5 per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\n• , WILLIAM B. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nI,. A. BAUER, Editor. Quertf.‘rly.<br />\n'avo. Volume VI in progress, $2.50 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nXVII. Anneal Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br />\n<br />\n(ironing.<br />\nI. Chngsipn I (tile \"Old College (ourse.\")<br />\n2. Mni Iteinatien I Physiee I,<br />\nikading up to.Kegineering.)<br />\n.<br />\n3. (*fitful (ell -H1014,0.1+1.<br />\n(ii'aqing ill/<br />\n4. (14..4)10/gival Itiolovieo I.<br />\n5. Le tin \\Tel latineil<br />\nPolitietp.<br />\nc.<br />\n((ci'tFiTpguiIt to IA(*)<br />\n7. mo Fern ebnetiag•e14...•<br />\n• , t<br />\nEditors.<br />\nSerial,Pubircritliins•<br />\nvrell e ,Ileriry„<br />\nM attic in,.ties:Ivor. N<br />\ni(ein,,C14..<br />\nCh, inkittri*(vel, XX V-I).<br />\nHavil L. (Ittglersleevog.<br />\nol. X X IL)<br />\nJ. M. Vincent<br />\nHistory.(vol. NIX•••)<br />\nt.<br />\nA, Marshall<br />\nModern Langira4iA(vol. XV I.)<br />\n14'1114am K. Brooks.<br />\nBiolefpy (vol. i V.<br />\nPaul Hanoi.<br />\nAss rioltars.(vol. TV.)<br />\nIT.<br />\nExperiment ,1 Medicine(vol. VI.)<br />\n,,•<br />\nProgrammes of the Courses offered to graduate stti&nitrite Philosophy and the Arts, and in the School of<br />\nMadieino, and also of the Undergraduate or Collegiate<br />\nColirsem, will be sent on applicatioh to the Regktrsr.<br />\n<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the 0141<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photograph of the Normal Solar Spectrum.<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. J. S. Bill<br />\nings, Editor. 116 pp. 4to. 16 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fee-simile edition. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MS with A ntile. gomena Epistles. Edited by I. H. Hall. $13.06.<br />\nBibliographik. Hopkinsiensis. part I. Philology. Parts<br />\nChemistry, Mineralogy and Geology. Parts<br />\nIV-V-V I.PhYsies, Astronomy and Mathematics.<br />\n• 8 Vi). R cents per part.<br />\nTull list of publications will be sent on application.<br />\nCommunications In respec`, to exchanges and remittances<br />\nakin Press, Baltimore. Md.<br />\nmag be sent to Johns<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VI.<br />\n<br />\nNOVEMBER 6, 1901.<br />\n<br />\nNo. 3.<br />\n<br />\nMETHOD IN READING.<br />\nS it possible to give a general answer, of any value, to the question, What<br />\nshall I read?<br />\nThe question is not well answered by prescribing a list of books. This<br />\ndoes not allow for individual tastes and for special circumstances, and for that<br />\nreason can hardly lead to any valuable result; \"Courses of reading\" are seldom<br />\nfollowed with profit. Nor is it enough to say simply that one should read what<br />\none finds interesting. This is true, but not the whole truth, for, out of the various things that may interest one, it is desirable to select the most important. Is<br />\nit possible to lay down any principles that may guide one in determining what,<br />\nat any given stage of intellectual progress, is most suitable to be read?<br />\nMost persons would probably agree that, to one who has general cultivation<br />\n.<br />\nIn view, history is of such fundamental importance that it should, especially at<br />\nfirst, form the staple of reading. The mind is interested in facts earlier and<br />\nmore easily than in abstract thoughts, and hence it is well to begin with history.<br />\nMoreover, many subjects cannot be understood without a competent historical<br />\nknowledge; no one can study art, literature, politics, philosophy intelligently,<br />\nunless he knows something of the development through which they have passed,<br />\nand the various conditons of society which, at different times have modified<br />\nthem. In studying history, one is preparing oneself for the study of many<br />\nthings. Further, the dispositions, intellectual and moral, which are cultivated<br />\nthrough historical studies are of highest value; \"histories make men wise.\"<br />\nDuring the earlier years of one's self-education, the endeavor should be to gain<br />\na competent knowledge of—at least—Greek, Roman, Mediaeval, English and<br />\nAmerican history. In such reading care must be taken not to attempt to force<br />\nthe memory to retain too much. The writing of abstracts is a valuable aid, and<br />\nfrequent and patient review is indispensable.<br />\nThe reading of imaginative literature should go on in connection with historical and biographical reading. One reason for combining th2 two is the<br />\nmental relief thus secured. Works of fiction are especially useful as recreation.<br />\nAfter prolonged and serious application, a good novel will restore tone and animation to the mind. Two things should be remembered in regard to novel<br />\nreading: first, that it ought to be kept in its place as recreation and not allowed<br />\nto usurp time needed for other purposes, and, second, that it should be confined<br />\nto books which are really worth one's while. Much time is wasted upon third<br />\nand fourth rate stories, which, if expended upon masterpieces, would yield far<br />\nmore pleasure, as well as vastly more profit.<br />\n<br />\n5<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nThe glory of our English literature is in its poetry. This \"feigned history\" is as important an element of our mental life as actual history. Lord<br />\nBacon well expresses the relation between the two. \"Because the acts or events<br />\nof true history have not that magnitude which satisfieth the mind of man, poesy<br />\nfeigneth acts and events greater and more heroical; because true history propoundeth the successes and issues of actions not so agreeable to the merits of<br />\nvirtue a nd vice, therefore poetry feigns them more just in retribution, and more<br />\naccording to revealed providence; because true history representeth acts and<br />\nevents more ordinary and less interchanged, therefore poesy endueth them with<br />\nmore rareness, and more unexpected and alternative variations.\" One should<br />\nbegin with objective and narrative poetry rather than with that which is analytic<br />\nand reflective. The early ballads, the Canterbury Tales, Shakspere's histories<br />\nand comedies, Goldsmith, Gray, Burns, Scott, Tennyson's Idyls of the Kings,<br />\nLongfellow, Whittier—such poetry is more suitable to an unformed taste and<br />\njudgment than that of which Wordsworth may be cited as an example. Such<br />\ncollections as the \"Golden Treasury of Songs and Lyrics\" are an excellent introduction to the study of poetry. At a later stage of one's growth, the profounder poen y becomes congenial; one learns to find pleasure in metaphysical<br />\nrefinements and over-subtleties, like those of Robert Browning, which at first<br />\nwould have been simply incomprehensible.<br />\nAfter a proper basis has been laid for it, what may be called philosophical<br />\nreading may be undertaken with profit. By this is meant works of theory and<br />\ncriticism, which attempt to do more than narrate and describe, which seek to<br />\nmake generalizations and to search into laws and causes. Every great series of<br />\nfacts, whether of nature or of man, is capable of being treated both historically<br />\nand philosophically, that is, in the way of simple statement and narration, and<br />\nalso with the design of accounting for the facts and getting at the truths and<br />\nlaws involved in them. When the latter mode of treatment is adopted, it is<br />\ncommon to use the word philosophy—as we speak of the \"philosophy of history,\" or the \"philosophy of art.\" This department of literature should evidently be reserved until a suitable amount of knowledge has been acquired, and<br />\nthe powers of reflection and speculation have been properly developed. One is<br />\nnot qualified to judge the merits of a theory, or a generalization, until one has<br />\nbecome familiar with the facts upon which it rests. The range of possible<br />\nreading under this head is, of course, indefinitely wide. A person interested in<br />\nnature will naturally pass from simple observation and experiment to the speculative and theoretical aspects of his subject. One familiar with history and literary events and personages will enjoy works of criticism and generalization,<br />\nwhich seek to establish principles of taste, to deduce laws of progress, to compare different eras of civilization. The mental and moral sciences fall under this<br />\ncategory, and also works of political, social,.and theological science. One comes<br />\nto studies of this kind at a great advantage, if the mind has been generously<br />\nequipped with facts, and the imagination has been trained by familiarity with the<br />\nmasters of fiction and poetry.<br />\nA threefold classification, such as has been suggested, may be of service to<br />\none who is trying to outline a plan of reading with reference, not to acquisition<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n3<br />\n<br />\nin a specific field, but to general culture. History, as affording a basis of fact;<br />\nimaginative literature, as helping to develop the ideal faculty; philosophy, in a<br />\nbroad sense, as coordinating and interpretating the phenomena of the world:—<br />\nthese are the three interests which need to be kept in view, and to be brought<br />\nE. H. G.<br />\ninto harmonious cooperation.<br />\n<br />\n. MEMORIAL EXERCISES TO DR. ROWLAND.<br />\nN Saturday, October 26th, the lecture room of the Johns Hopkins physical<br />\nlaboratory was filled by students and scholars, assembled to hear former<br />\nPresident Mendenhall of Worcester Polytechnic Institute deliver a eulogy<br />\non the late Prof. Henry A. Rowland. Among those present were Mrs. Rowland<br />\nand other members of the late Professor's family, Mrs. Huntington Williams,<br />\nDr. Carey T. Hutchinson of New York, and Dr. N. E. Dorsey of Washington,<br />\nwho were formerly connected with the Johns Hopkins department of physics;<br />\nDr. Wolfe of Washington; Dr. Stratton, the director of the National Bureau of<br />\nStandards, and Dr. Barker of Philadelphia. Former President Gilman had a<br />\nplace in the front row.<br />\nPresident Remsen said, as he introduced Dr. Mendenhall:<br />\n\"We have already given some expression to the thoughts and feelings Professor Rowland's death aroused in us. We were then, however, too much influenced by our new grief to look at his life work in the broadest way. Our expressions were rather those of personal emotions. We meant to hold a meeting<br />\nat which the fuller meaning of his life might be made clear to us. We are receding from him, and the increasing distance gives us clearer view. How great<br />\nhe was and in what way only a physicist like himself can tell us.\"<br />\nDr. Mendenhall was then introduced and commenced his address by a reference to Professor Rowland's originality.<br />\n\"Many of his contemporaries,' he said, \"excel him in the quantity of their<br />\nworks; very, very few of them equal him in its quality. The full value of his<br />\nlabors may be understood only in the great results to which its quality led other<br />\nworkers whom his example had stimulated. A complete estimate would demand<br />\nreference to nearly all physical investigation of the last quarter of the old century. Quality was his admiration. By this test we will judge his achievements.\"<br />\nWith a close knowledge of exact details Dr. Mendenhall then sketched the<br />\ndevelopment of Dr. Rowland's investigations from an early paper written as a<br />\njoke to the Scientific American at the age of 17. The latter part of the address<br />\nWas devoted to the personal side of the dead physicist. His characteristics, the<br />\nearly aptitudes and preferences of the boy, his perseverance and dexterity in applying them under difficulties, the boldness and directness by which he reached<br />\nhis later results, the severe candor with which he treated his own works and<br />\neverybody else's, his underlying kindness of heart, the full devotion with which<br />\nhe pursued his objects all were outlined in a manner that aroused the highest<br />\nadmiration of the audience.<br />\nAfter the address Dr. Remsen invited those present to go into one of the<br />\nnearby investigation rooms and look over the many inventions of the late<br />\nscientist.<br />\n<br />\n013<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nREPRODUCTION OF THE ATHARVA-VEDA.<br />\nROI-4'ESSOR Maurice Bloomfield is in possession of a newly-issued hook<br />\nwhich promises to throw much light on the manners and customs of our<br />\nAryan ancestors many hundreds of years ago. It is a photographic<br />\nreproduction, prepared by Professor Bloomfield and Professor Richard Garbe of<br />\nTubingen, of the oldest known manuscript of the Atharva-Veda, one of the<br />\nVedic or sacred books of the Aryan nations. The \"Atharva\" is the collection<br />\ngiving the charms, exorcisms, and incantations of the old religion. It tells<br />\nhow to secure a sweetheart, maintain a happy family, control sickness, and<br />\nsucceed in business; and it thus gives a most valuable glimpse into the life and<br />\ninstitutions of our oldest known progenitors.<br />\nThe bringing to light of this volume is due mainly to Professor Von Roth,<br />\nof Germany. He realized the insufficiency and corruption of the first edition of<br />\nthe Atharva; and it was by his energy that the present manuscript was discovered in Srinagar, Kashmir. Professor Roth left the manuscript at his death to<br />\nthe University of Tubingen.<br />\nThe manuscript contains about 275 pages of two sheets of birch hark each,<br />\nwritten in an indelible black ink, little faded in the 400 years since the manuscript was written. (The collection contained is, of course, many centuries<br />\nolder.) Professor Bloomfield hoped that in time a version replacing the native<br />\ncharacters by their English equivalents may be printed, followed by a translation of the text.<br />\n<br />\nT<br />\n<br />\nDR. GILDERSLEEVE AND THE MEMORIAL VOLUME.<br />\n<br />\nt<br />\n<br />\nHE widespread and deeply appreciative tributes of the press on the occasion<br />\nof Dr. Basil L. Gildersleeve's seventieth birthday, October 23, are examples of high praise where it is due. Dr. Gildersleeve has combined more<br />\nthan, perhaps, any other living American, the functions of the tremendously<br />\nerudite specialist, and of the broad minded man of letters. This idea of liberal<br />\nscholarship he has carried with him throughout his lengthy and many-sided<br />\ncareer.<br />\nDr. Basil Lanneau Gildersleeve was born in Charleston, S. C., October 23,<br />\n1831. He took his A. M. at Princeton in 1852, after studying at Charleston<br />\nand Washington Jefferson Colleges. In 1856, after several years at Berlin,<br />\nBonn, and Gottingen, he became Professor of Greek at the University of Virginia; and his connection there continued, with a break during his service in<br />\nthe Civil War, until the foundation of the Johns Hopkins University in 1876.<br />\nHonors have showered upon Dr. Gildersleeve for many years, the latest<br />\nbeing the degree of I.,. L. D. presented him by Yale University. But of all<br />\nthese recognitions, perhaps none has carried to him as much personal good-will<br />\nand esteem as will the Memorial Volume now under preparation by a number<br />\nof his former students.<br />\nThis volume will be entitled: \"Studies in Honor of Basil Lanneau Gildersleeve.\" It will contain some 400 pages, consisting of articles by thirty of his<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n5<br />\n<br />\nformer students at Virginia and Johns Hopkins; and these articles will constitute not only a tribute to Dr. Gildersleeve, but a valuable addition to Greek<br />\nphilology. Four hundred copies are to be printed by subscription. Dr. M. C.<br />\nSutphen, whose unfortunate death occurred this summer, had charge of the<br />\narrangements for the book. The present committee is composed of Dr. E. H.<br />\nSpieker, Dr.. Maurice Bloomfield, Dr. C. W. Emil Miller, Dr. Kirby F. Smith,<br />\nDr. Christopher Johnston, Dr. B. J. Vos, and Dr H. L. Wilson.<br />\nOn Dr. Gildersleeve's return from Yale, he was presented with a handsome<br />\ncathedral clock by the students of his department. The publication of the<br />\nMemorial Volume, however, will not take place until Christmas.<br />\nMEDAL FROM YALE.<br />\n<br />\nZ<br />\n<br />\nHE Johns Hopkins University last week received from Yale a beautiful<br />\nbronze medal, in commemoration of the late bicentennial celebration. In<br />\nspeaking of the gift President Remsen said that all the leading universities and colleges which were represented in the exercises had received a similar<br />\nmemorial. The medal was made by Tiffany & Co., N. Y. It is embedded in<br />\na dark leather case, about four inches square, lined with Yale blue silk and<br />\nplush. The medal itself is two inches in diameter, and is of the finest workmanship.<br />\nOn its face is the figure of a victorious Greek, returning in his war<br />\nchariot. In front of his restive steeds, a fair goddess waits to place on his brow<br />\nthe wreath of laurel, Above this scence are the Latin words \"Lux et Verztas.\"<br />\nOn the other side are two Grecian torches, between which, in raised letters, is<br />\nthe simple memorial inscription:<br />\nUniversitas Yalensis<br />\nA. D. MDCCCCI<br />\nConcelebtat<br />\nCollegium Yalense<br />\nA. D. MDCCI Conditum.<br />\nX PRESIDENT Gilman's address on the second day of the Yale Bicentennial Celebration treated of the relation of Yale to letters and science. In<br />\nc- onclusion, he described the spirit of Yale as \"living for others, not for<br />\none's self, the greatest happiness in the utmost service.\" Dr. Welch, professor<br />\nof pathology at the Medical School, also spoke,tracing the development of medical progress by Yale professors and graduates. On this occasion, President<br />\nRemsen, Dr. Osier, and Dr. Gildersleeve were honored with the degree of<br />\nL. L. D., which has already been conferred by Yale upon three other members<br />\nof the Faculty—ex-President Gilman, the late Dr. Rowland, and Dr. Welch.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\n<br />\nHOPKINS UNIVERSITY.<br />\nNOVEMBER 6, 1901.<br />\nSubscription $1 50 per year.<br />\n<br />\n10 Cents a single copy.<br />\nWILLIAM B. HILL, 1902,<br />\n. SOL STROUSE, 1902.<br />\n.<br />\nEDEN C. HILL, 1902.<br />\nROBERT S. LANIER, 1903.<br />\nW. S. BIRD, 1903.<br />\nJOHN A. SLE MONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1903.<br />\n<br />\n.<br />\n.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n<br />\n•<br />\n<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\nAddress all articles, communications, etc., to WILLIAM B. HILL, box 269, Johns Hopkins<br />\nUniversity, l'.altimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 183<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\nALL ROOTERS OUT.<br />\nN November 16th, the first game for the Maryland Inter-Collegiate foot<br />\nball championship will be played in Baltimore between Western Maryland College and Johns Hopkins. On our trophy-room wall is a space<br />\njust large enough for the championship banner; the team is going to try to cover<br />\nthat space. The team has worked hard and conscientiously, \"meds\" and<br />\nscrubs are out; but so far the rooting has been woefully weak. Weak rooting<br />\ndoes not help bring banners to Hopkins; good, strong rooting is a great<br />\nencouragement to the players. Every loyal Hopkins man will be on hand at<br />\nboth the Western Maryland and St. John's games to help the team struggle.<br />\nEvery Hopkins man who wants to be called true to his colors must realize that<br />\nhe is needed at the games. Everybody out, to demonstrate that the enthusiastic<br />\nspirit of the last two years is not dead, but dormant.<br />\n<br />\nO<br />\n<br />\nHE gymnasium building is the barometer indicating changes in the temperament, feelings, and conditions of Hopkins men. If trouble is brewing, the<br />\nfirst foam is generally seen in the gym -or cage; if victory is to be celebrated,<br />\nthe cage is the place where the first yell is given. The locker-room,the cage, the<br />\ngymnasium proper are so intimately associated with Hopkins life that the mere<br />\nmention generally brings up clear visions !of some of the most i pleasant<br />\nincidents of the short three years here. It is also intimately connected with<br />\nsome of the first impressions—which may not be so pleasant. All the idle<br />\nmoments at one's command are put in at the gym; and its just in this point that<br />\n<br />\nZ<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nthe weather indications are shown. If many men loaf around in citizen's garb,<br />\ninstead of donning undress suits; if they saunter around with pipe in mouth,<br />\nand hands in pocket, passing time and criticisms regardless of the value of<br />\neither; if their only occupation is to knock,—then something is wrong somewhere. The atmosphere or the people is at fault. That it is not the atmosphere is shown by the notable lack of loafing this year. Very few men come<br />\ninto the gym building now unless they go in for work. The apparatus upstairs<br />\nis being worked hard, the foot ball squad is fairly large, lacrosse and track men<br />\nare out, and altogether there is plenty of life all around. Where there is so<br />\nmuch scholastic activity as here, such a state of affairs in athletics is to be<br />\nhighly commended. The atmosphere is apparently healthy for a general<br />\ndevelopment.<br />\n<br />\n4 43T's strange I never see any class numerals on fellows over here.\" A<br />\nmedical student at Hopkins, who received his A. B. at a large Northern<br />\ncollege, was heard to give expression to these remarks a few days ago.<br />\nWhen the matter is thought over, it does seem strange that within the last few<br />\nyears the giving of numerals as athletic honors within the classes has been<br />\nabandoned. The practice must have been in vogue when the class of 1900 was<br />\nhere, for many men of that class were seen to wear the red 1901 in \"broad display on their manly chests,\" and on the jerseys of still older men is occasionally<br />\nseen the graduating year. Surely, a man who does good work for his class<br />\nought to receive recognition as well as the fellow who is lucky enough to make<br />\nthe 'Varsity. Where many men strive for few positions, the majority get left;<br />\nbut why should not the classes remember that it is this majority who bring<br />\nvictories on class day and rushes? Naughty-two has forgotten this. Think it<br />\nover, Juniors and Freshmen.<br />\n<br />\nSENIOR FEED.<br />\n<br />\nt<br />\n<br />\nHE first \"Feed\" of the Class of '02 is to be held at the Johns Hopkins<br />\nClub on the evening of the 16th, after the Western Maryland College<br />\ngame. Details may be learned from Ogle Marbury, '02. In this connection it is interesting to note a recent address of President Pritchett of the<br />\nBoston- \"Tech.,\" in which he strongly advocated just such \"stein and pipe\"<br />\ngatherings, in contrast to the formal dress banquet.<br />\nPresident Pritchett believes in the democratic system of entertainment<br />\nfound in German universities, where professors and students meet at the frequent \"vereins,\" discussing problems or enjoying more general conversation.<br />\nRich and poor alike gather in good fellowship, each man paying his own score<br />\nfor beer and tobacco. Thus, says Dr. Pritchett, much sympathetic intercourse<br />\nis made possible between the students and also the professors; and he hopes<br />\nthat his proposed inauguration of such meetings among college students in<br />\nBoston will cause a big improvement in college social life.<br />\nThese free and informal \"feeds\" are a move in the right direction, one<br />\nwhich must be taken up in turn by '03. Every Hopkins man will welcome a<br />\n<br />\n\fS.<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\n8<br />\n<br />\nchance to see more of his classmates, under such reasonable and cheerful<br />\nconditions;<br />\n\"For it's always fair weather,<br />\nWhen good fellows get together,<br />\nWith a stein on the table.<br />\nAnd a good song ringing clear.\"<br />\n<br />\nUNDERGRADUATE HAPPENINGS.<br />\n<br />\nt<br />\n<br />\nHE Class of 1902 has decided to present a large settee to the trophy-room.<br />\nIt is now being made, and will completely fill one of the corners.<br />\n<br />\nThe Junior Class officers are: President, H. W. Plaggemeyer; Vice-President, R. C. Hoffman, Jr.; Secretary, J. T. Smith; Treasurer, F. Hazlehurst, Jr.;<br />\nHistorian, R. S. Lanier; Poet, T. W. Glocker; Orator, J. B. G. Custis, Jr.;<br />\nJester, 5, C. Hopper; Sergeant-at-arms, J. A. Houghton; Captain of Class Foot<br />\nBall Team, F. C. Blauck; Manager, W. H. Matthai; Yell Committee: Lanier,<br />\nBamberger, Pagon, Sandrock and Bird; Flag Committee, Tootle, Baetjer and<br />\nHunley. The following men have been taken into the class organization: F.N.<br />\nIglehart, from '94; Royalle Williams, Lehigh; J. M. Combs, University of<br />\nCalifornia.<br />\nJ. S. Grasty has been elected by acclamation to the post of chief rooter,<br />\nand is endeavoring to instil into the minds of the Freshmen some slight knowledge of the Hopkins yells. Meetings for practice have been held in the cage,<br />\nand it is hoped that '04 will soon make some much-needed improvement in this<br />\ndirection. They need it.<br />\nThe first deba\"e in the Senate on the benefits of the late strike was not a<br />\nshining success. After much talking on both sides, the decision was awarded<br />\nto the Ministry's team, which upheld the capitalists' view. The Juniors debated the same question with the same result. The Senior debaters have already<br />\nbeen announced in the NEWS LETTER. The Juniors were: Plaggemeyer,<br />\nSmith, Tootle, affirmative; Strayer, Glocker, Blum, negative,<br />\nThe Freshman Class officers are as follows: President, E. D. Dickey; VicePresident, J. N. Numsen; Secretary, L. G. Wallis; Treasurer, J. R. B. Branch;<br />\nHistorian, R. S. Opie; Poet, R. S. Licking; Sergeant-at-arms, S. C. Erlanger.<br />\nThe class colors are black and red.<br />\nThe strength of the present Freshman Class is 48, as against 55 for last<br />\nyear. Noughty-three, however, has lost several men this fall, so that the<br />\nnumbers are not far from equal.<br />\nAn edict has been issued by the Musical Club's management, requiring all<br />\nprospective members of any club to deposit with the leader the sum of $3.00,<br />\nwhich is to be regarded as an advance payment of fines for absence and lateness<br />\nat rehearsals. These fines are at the rate of 50 cents for each rehearsal cut and<br />\none cent for every minute late. The money is to be refunded at the end of the<br />\nseason, less fines collected.<br />\n<br />\n\ft.<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\n9<br />\n<br />\nThe Glee Club is practising a new Hopkins song, words by W. B. Carver,<br />\nto the tune of \"Michael Roy.\" It is a lively marching song, and bids fair to<br />\nbe the success of the season.<br />\nA new scientific organization has been formed, by name the Society of the<br />\nDiamond. It was started by a group of biological students, who, finding themselves unable to see some required object in the laboratory, adjourned to procure aid. Subsequent meetings have been held with great benefit. This asso<br />\ndation, which is semi-secret in character, is open to scientific students only.<br />\n<br />\nUNIVERSITY NOTES.<br />\nN Thursday, Oct. 24, the marriage took place of Mr. Melvin Brandow, assistant librarian of the University, to Miss Ruth Boocock, of New Jersey.<br />\n<br />\nO<br />\n<br />\nDr. J. M. West, of this city, who took his degree at the Medical School last<br />\nJune, is about to start for Germany, where he will specialize at various leading<br />\ninstitutions in diseases of the throat.<br />\nDr. Percy L. Kay, recently called to a position in the Treasury Department<br />\nof Porto Rico, is the third Hopkins graduate from the history and economics<br />\ndepartment to hold a position at the Porto Rican Treasury. The other two are<br />\nDr. J. H. Hollander, who was treasurer of the island, and Dr. T. S. Adams,<br />\nwhose place Dr. Kay is taking.<br />\nDr. Francisco del Valle, and Dr. Francisco del Valle, Jr., who are attending<br />\ncourses in the department of history and economics, are graduates of the Institute of San Juan, Porto Rico; the former in 1867, the latter in 1894. In addition, Dr. del Valle is an M. D. of the College of Medicine, Cadiz, 1872, while his<br />\nson took his D. D. S. at the Baltimore College of Dental Surgery, and has also<br />\nstudied law at the University of Maryland.<br />\nJ. E. Routh, 1900, has been awarded the $250 prize offered by the Century<br />\nMagazine for the best essay written by a graduate of any American college or<br />\nuniversity. The title of the essay was \"Huxley as a Literary Man.\" Mr.<br />\nRouth is at present a graduate student in mathematics and physics.<br />\nA letter has been received from the Johns Hopkins Club of the Middle<br />\nWest, announcing that its second annual session and banquet will be held at<br />\nthe Hotel Baltimore, Kansas City, Mo., on Friday, November 29. Those finding it possible to attend will notify the secretary, Dr. Chas. Lee Smith, Liberty,<br />\nMo. The officers of the club, which numbers more than 60 members, are as<br />\nfollows: President, Dr. F. W. Blackmar, University of Kansas; secretary, Dr.<br />\nChas. Lee Smith, William Jewell College, Mo.; vice-presidents, Prof. J. C. Futrall, University of Arkansas; Dr. A. G. Leonard, of Iowa, and Dr. J. White,<br />\nUniversity of Nebraska, These officers constitute the Executive Committee.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nATHLETICS.<br />\nFOOT BALL SCHEDULE. ,14<br />\nNOVEMBER D.—Delaware College vs. J. H. U., at Wilmington.<br />\nNOVEMBER 16.—J. H. U. vs. -Western Maryland, at American League Park.<br />\nNOVEMBER 23.--J. H. U. vs. St. John's, at American League Park.<br />\nNOVEMBER 28.—(Thanksgiving Day), J. H. U. vs. U. of M.. at American 'League Park.<br />\n<br />\nGALLAUDET, 12—HOPKINS, 0.<br />\n<br />\nt<br />\n<br />\nHE result of our game with Gallaudet was no more than could be expected<br />\nwith the crippled team which represented Hopkins aturday before last.<br />\nBlanck could not be in the game on account of his lame foot. Hill was not<br />\nwith the team, and Stone was also unable to play. With these three men out of<br />\nthe game Hopkins did well to hold her silent opponents down to twelve points,<br />\nwhich she did very creditably.<br />\nSharretts kicked off, and Gallaudet was downed with the ball on her fiveyard line. Right at the start Gallaudet showed some superb team work, as her<br />\ninterference was well nigh invincible, and quickness in starting remarkable.<br />\nErickson made the first dash through left tackle, leaving thirty yards behind him<br />\nat the finish; and after an effective mass-play, added ten yards around right end.<br />\nBy alternating end plays with marvelous success, Gallaudet lanced the pigskin<br />\nin the coveted position after six minutes of play. Geilfuss kicked goal.<br />\nSharretts kicked off for Hopkins, and Andree advanced the oval to the fifteen yard line. After two long end runs by Erickson and Andree, Gallaudet<br />\nlost the ball for holding; but the Black and Blue were unsuccessful in their attempts at tackle through tackle, so Sayler punted, and by making a touchback<br />\nthe silent eleven returned the ball from their twenty five yard line Sharretts<br />\ncaught it and carried it twenty yards on the jump. Then Hopkins unfortunately<br />\nlost the oval on downs; and after good gains through guard and around the<br />\nends, Gallaudet tried a drop kick for goal, but failed and Hopkins downed the<br />\nball on her twenty yard line. The Black and Blue now being unable to tear off<br />\nmore than a yard or two of the required five, Sayler punted. Gallaudet was<br />\nforced to do likewise, soon after Sayler returned the kick; and the first half<br />\nended with the ball on Gallaudet's forty yard line.<br />\nGallaudet started the second half with a beautiful kick, and Hopkins<br />\ndowned the ball on her three yard line. Sayler immdiately punted. After a<br />\ncouple of good gains through tackle and end Gallaudet was penalized ten yards<br />\nfor holding, and soon after tried a drop kick. A touchback being made, Sayler<br />\nkicked from the twenty-five yard line, and the ball was downed iu the center of<br />\nthe field. Now with her excellent interference and speedy rushes through the<br />\nline and around the ends, Gallaudet soon had the ball behind the goal post.<br />\nGeilfuss again kicked goal.<br />\n<br />\n\f11<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nSharretts kicked off, and after a short gain of five yards the mutes lost the<br />\noval on downs. Hopkins, rather than do likewise, kicked. Thus the second<br />\nhalf ended with the ball in Gallaudet's possession on her fifty yard line.<br />\nAs was stated the Hopkins team was not its real self in this game. Besides<br />\nthe three men who were not in it at all, Whipple was knocked out right at the<br />\nstart. The Black and Blue did well in all their kicks and punts, but showed an<br />\nalarming tendency to tackle high, thus allowing their opponents to gain more<br />\nground than they should have. This is mainly on account of the practice in the<br />\nCage, where low tackling would probably produce disastrous results with such<br />\nnarrow space between the walls. Our fellows were at first rather ineffective at<br />\nbreaking the opposing interference, but in the second half they did better; and<br />\nthe line held together wonderfully well against superior weight. The rooting<br />\nof Gallaudet was in itself a feature of the game. Actions speak louder than<br />\nwords. The line up was as follows:<br />\nGALLAUDET.<br />\n<br />\nHOPKINS.<br />\n<br />\n1 e.<br />\nGillespie<br />\nWhipple, Straus......I.t.<br />\n1. g<br />\nErlanger<br />\nC.<br />\nCampbell<br />\nr. g.<br />\nYearly<br />\nr. t<br />\nFerris<br />\nr. e.<br />\nHoughton<br />\nq•<br />\nBernheim<br />\n1. h. b.<br />\nSharretts<br />\nr. h. b.<br />\nSayler<br />\nf. b. .<br />\nPlaggemeyer.<br />\n<br />\nGeilfuss<br />\nMcDonough<br />\nHewetson<br />\nWorley<br />\nLawrence<br />\nNeesam<br />\nEscherick<br />\nPhelps<br />\nErickson<br />\nA ndree<br />\nWaters<br />\n<br />\nReferee—Watson. Umpire—Edell.<br />\nTimers— Blanck and Rooson. Linesmen—Pearre and Strong.<br />\nTwenty minute halves.<br />\nHAVERFORD, 5; HOPKINS, 0<br />\nT would have done every rooter's heart good to have seen the great game<br />\nwhich Hopkins put up against Haverford College last Saturday. A pretty<br />\nindividual play in the shape of a goal from the field was the sole thing<br />\nBlack<br />\nwhich gives Haverford the right to say that she defeated Hopkins. The<br />\nend<br />\nand<br />\nplunges<br />\nline<br />\nthe<br />\nand<br />\ncontest,<br />\nand Blue were aggressive throughout the<br />\nvoice<br />\nhis<br />\nlose<br />\nto<br />\nrooter<br />\nevery<br />\ncaused<br />\nruns made by Sayler, Faris, and Blanck<br />\nbefore the end of the game. Hopkins kicked off at the start, and her line showed<br />\nwhat stuff was in it by forcing Haverford to punt after the second scrimmage.<br />\nTowards the end of the half, we rushed the ball down the field by fast, snappy<br />\nwork. The 5 yard line, then the 4, and then the 3 yard line was reached.<br />\nA touchdown seemed inevitable, and our little band of rooters nearly went wild<br />\nwith delight. It was then that we realized that our foe was not to be despised.<br />\nFaris,<br />\nLike a drowning man grasping at a straw, Haverford braced, and after<br />\n<br />\n3<br />\n<br />\n\f1Z<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nSayler, and Blanck smashed the line only to stick, the ball went over to Haverford on downs. The oval had been worked along to that point for a distance of<br />\n65 yards only through the greatest determination and effort by every man, and<br />\nthen to lose it when almost on the goal line—it did, indeed, seem mighty hard<br />\nluck. Haverford punted out of danger immediately, and a moment later the<br />\nfirst half ended.<br />\nAccording to a statement made by one of Haverford's men, she fully expected to pile up a score of about 25 points on \"Johnny Hopkins.\" They were<br />\nclearly outplayed in the first half, and only by a heroic effort at the last moment<br />\ndid they prevent Hopkins from scoring. To say that they were both surprised<br />\nand piqued would be stating the case very mildly.<br />\nIn the second half Haverford started in with a grand rush, but Hopkins<br />\ncontinued to be strictly in the game, and almost invariably the home team was<br />\nforced to punt for fear of losing the ball on downs. After twelve minutes play,<br />\nHaverford's end runs and line rushes seemed to be more effective, and the ball<br />\nwas advanced to Hopkins 15 yards, which was the nearest she ever got to our<br />\ngoal line. Then \"Johnny\" realized that something must be done, and in the<br />\nnext scrimmage Faris took a kindly hold on the back of the runner's jersey and<br />\nsnatched him back for just eight yards. The band of Haverford rooters, 250<br />\nstrong, sent up a deafening yell of encouragement to their team, and the little<br />\nhand of Hopkins enthusiasts, six strong, piped out a feeble \"Hullabaloo.\"<br />\nTheir voices were a little the worse for wear by that time. Captain Grant saw<br />\nplainly that he could never carry the ball over Hopkins' goal line, and he<br />\nordered the next best thing. Drinker dropped back to the 30 yard line, and a<br />\nmoment later received a pretty pass in just the proper place. The ball dropped,<br />\nand, as it touched the ground, his toe caught it, and between the posts she<br />\ntwirled, giving Haverford five points and the game. Hopkins never lost heart,<br />\nand a few minutes before the end of the half, she again had the ball on Haverford's 15 yard line. Another reverse of fortune came, however, and she lost the<br />\noval on downs.<br />\nIn such a battle royal it is difficult to ascribe special honors to any one man.<br />\nEvery player deserves a hearty slap on the back, and the exclamation, \"pretty<br />\nwork, great work, old man!\" Captain Gillespie was naturally disappointed<br />\nafter such a hard fight, hut both he and Coach Dickson agree in saying that the<br />\nteam played a truly great game. Next Saturday, Delaware College is to he<br />\nplayed at Wilmington. We are going up to win, and we want a big band of<br />\nrooters to see us do it. The teams played as follows:<br />\nHOPK INS.<br />\n<br />\nGilllespie (captain)<br />\nHill<br />\nGarwood<br />\nCampbell<br />\nYearley<br />\nBacon<br />\nHoughton<br />\nBernheim<br />\nFaris<br />\nSayler<br />\n<br />\nHAVP:RFORD.<br />\n<br />\n1. e.<br />\n1. t<br />\n1. g.<br />\nc<br />\nr, g<br />\nr t<br />\nr. e<br />\nj. b<br />\n1. h. b<br />\nr h h.<br />\n<br />\nHaviland, Scattergood<br />\nWorthington<br />\nSpiers<br />\nRoss<br />\nSimkin<br />\nBausman<br />\n(captain) Grant<br />\nPhillips<br />\nDrinker<br />\n..<br />\nThorne<br />\nJones<br />\nReferee—A. Scattergood, Haverford. Umpire—J. H. Gillender, U. of Pa.<br />\nLinesmen—Weil, J. H. U.; Perkins, Haverford<br />\nTimers—W. B. Hill, J. H. U., C. C. Morris, Haverford.<br />\nTime—Twenty and twenty-five minute halves.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\nLEC TURES.<br />\n<br />\nt<br />\n<br />\nHE courses of lectures in science and literature, designed primarily for pub<br />\nlic school teachers, began on Saturday of last week.<br />\n<br />\nORIENTAL SEMINARY,—Dr. Foote will give a course of lectures on the<br />\n\"Literature of the Old Testament,\" based on the English Bible. Dr. Haupt<br />\nwill deliver,the introductory lecture, on \"How we got our Bible,\" in the Dillman Room, Wednesday, at 5 o'clock.<br />\nThe lectures on Public Speaking, given by Mr. S. A. King, M. A., of the<br />\nUniversity of London, will be continued on November 6, 11, 15, and 18, at 5<br />\no'clock, in McCoy Hall. Mr. King's first lecture was given Monday.<br />\nOn Wednesday, the 6th, Dr. Jeffrey R. Brackett, president of the City Supervisors of Charities, will begin a course of lectures on \"The Development of<br />\nLegislation and Custom Touching Charity and Correction in the United States<br />\nand England.\" The lectures will be held in Levering Hall.<br />\nY. M. C. A. NOTES.<br />\nHE courses in Bible Study are in full progress. A class for graduate students meets every Saturday morning at 8.30 to consider special topics selected by the committee in charge, which consists of Mr. D. B. Easter, L.<br />\nG. Barret, F. H. Getman. Enrollment, 24. A course for Seniors in the \"Acts<br />\nand Epistles,\" led by Mr. J. Gresham Machen, meets at 1 P. M. Wednesdays,<br />\nand has an enrollment of 6. The Junior class is under the leadership of Mr.<br />\nHorace C. Gillespie, and numbers 7, meeting at firesent at 8.30 A. M., Wednesdays, to consider the same topics followed by the Seniors. This duplication of<br />\nthe courses results from the fact that there was no Junior Bible class last year.<br />\nThe Freshman Bible class is in two groups, on account of conflict of hours:<br />\none, led by C. K. Edmunds, meets Thursdays at 10 A. M.; the other, led by R.<br />\nS. Licking, meets Thursdays at noon. The enrollment in these two groups is<br />\n9, and Sharman's \"Life of Christ\" is used.<br />\nThe regular weekly devotional meeting on Tuesday, Oct. 28, was led by<br />\nMr. Don 0. Shelton, International Secretary, who gave a very stimulating Bible<br />\nreading in Phillipians.<br />\nMr. A. B. Williams, Jr.,(Yale), Intercollegiate Secretary for the East, addressed the meeting on Tuesday, Nov. 3, and was also present at a conference<br />\nof workers Tuesday night at the home of the General Secretary.<br />\nThe Mission Study class numbers 9, meeting every other Sunday afternoon<br />\nat 3.30. Under the direction of Dr. Ballagh, it is proving exceedingly interesting and helpful.<br />\nThe week beginning Sunday, November 10, will be observed in common<br />\nwith all religious bodies throughout the country as a \"Week of Prayer.\" There<br />\nwill be a meeting Sunday afternoon at 4.30, and every day during the week<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nthere will be short talks by members of the Faculty from 1-1.30. It is hoped<br />\nthat every man will avail himself of these privileges.<br />\nThe regular monthly meeting of the Executive Council will occur Tuesday.<br />\nNov. 12 at 5.30, in the Committee Room.<br />\nDr. E. C. Armstrong is conducting morning prayers this week.<br />\n<br />\nAMONG THE COLLEGES.<br />\nII 1:4, lacrosse team of City College of New York, which was beaten by Hopkins last year, is out for practice.<br />\n<br />\nZ<br />\n<br />\nThe number of students registered at Harvard this year is 4043.<br />\nMore young men are studying medicine than are studying law and theology<br />\ncombined.<br />\nPrinceton has recently been presented with $100,000 for the erection of a new<br />\ndormitory.<br />\nThe Freshman Class at Harvard numbers 553, and at Princeton the entering<br />\nclass has 400 members. In both of these institutions these numbers surpass all<br />\nprevious records.<br />\nAt the McMaster University games A. E. Haydon broke the Canadian Col<br />\nlege record for the pole vault by clearing 9 feet 11 inches.<br />\nThe oratorical cpntest for the Founder's medal at Vanderbilt University<br />\nwas won by a Chinaman His subject was: \"The Miracle of ' the Twentieth<br />\nCentury\"—the regeneration of China.<br />\nThe Athletic Association of the University of Colorado has constructed a<br />\nfine athletic field 684x242 feet, with a quarter mile track, a grand stand for one<br />\nthousand spectators, bath rooms for athletes—all at the foot of a beautiful<br />\nmountain.<br />\nThe University of Pennsylvania has taken the preliminary steps necessary<br />\nfor the erection of a new medical laboratory, which in point of completeness and<br />\nequipment, it is claimed, will be in advance of any similar building now in existence in this country or in Europe.<br />\n<br />\nFRESHMAN PRIMER.<br />\nAFTER EUGENE FIELD, WITH APOLOGIES.<br />\nLESSON V.<br />\nThis boy looks Worried. Worry really did strike him. He put a thick<br />\nCoat of White Paint on his Papa's new Patent Leather Slippers. That Worried<br />\nPapa, who Rid himself of the Worry by handing it to Willie. Wonder why<br />\nWillie eats his meals from the sideboard now? How excrutiatingly peculiar.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n15<br />\n<br />\nLESSON yr.<br />\n<br />\nSee the Parrot in his Cage, children! Isn't he just beautiful? Put your<br />\nlittle Fist into the Cage, Johnnie, and try to Pull a feather from his Tail. Don't<br />\nscream so frightfully, my Boy: Polly only wanted to Show his Teeth. There,<br />\nthere, stop crying, and I will give you a Chaw of Gum. When you have finished<br />\nchewing it, Send it to the Dog for a while, and then Susie will be glad to Chew<br />\nit for three Days. Now isn't that lovely?<br />\nEXCHANGES.<br />\nA few from the Cornell Wthow.<br />\nA QUERY.<br />\n<br />\nIf you and I—Yes, every man,<br />\nWere built upon the Darwin plan,<br />\nDo you suppose the Does would slight us,<br />\n'Cause we couldn't have appendicitis?<br />\nFor centuries old<br />\nThe wise guys have told<br />\nThat a bird in the hand is worth two in the bush,<br />\nBut all will agree, whom the truth has not missed<br />\nThat a thorn in the bush is worth two in the fist.<br />\n\"Well I'll be switched\" the engine said,<br />\nTo the head-light o'er the fender,<br />\n\"No wonder that coal's so gel darned soft,<br />\nWhen they bring it from the Tender.\"<br />\n'02.—These chestnuts are full of worms.\"<br />\n'03.—Yes, its a case where the early burred catches the worm.<br />\nFirst Old Grad.—When are you going to send your son up here?<br />\nSecond Old Grad.-0! not for some time yet,—there are some things to be<br />\nforgotten in this town before he comes.\"<br />\nMOODS.<br />\n<br />\nAs the dewdrops glisten and glint and glint,<br />\nIn the shafts of the light from the eastern hills,<br />\nAnd the air is laden with clover and mint,<br />\nWafted from fields where the mockbird<br />\nWhere the mockbird warbles and trills and trills,<br />\nMy heart is elate with the morn, and thrills<br />\nAll a-quiver with hope and joy without stint,<br />\nAs the dewdrops glisten and glisten and glint.<br />\nAs the long day lengthens and lingers and lasts,<br />\nAnd the parched earth throbs in the quivering heat,<br />\nAnd the breezes of morn change to withering blasts,<br />\nHurling columns of dust down the deserted street,<br />\nMy soul becomes weary with worry and work,<br />\nMy hands become weary; each duty I shirk.<br />\nAs the fireflies glitter and glimmer and glare,<br />\nIn the soft, sweet calm of the twilight air.<br />\nAnd the whippoorwill calls from its woodland lair,<br />\nSending its plaintiveness everywhere,<br />\nMy soul is freed from its burden of care,<br />\nAs the fireflies glitter and glitter and glare.<br />\n—Unit, of Minn. Magazine.<br />\n<br />\n\f16<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nA writer in the University of Minnesota Magazine in a philosophical mood,<br />\ngives us the following definition of what college spirit is not. In this is some<br />\ngood food for reflection; so we print it entire—without criticism.<br />\nMuch has been said about college spirit. To say exactly of what it consists is hard, but I am told by authorities that it does not consist:<br />\n1. In promiscuous yelling,—except when in the interest of the college<br />\nteam or organization.<br />\n2. In whistling the fool's march. This march must have taken its name<br />\nfrom the whistler.<br />\n3. In an over indulgence of the faculty of politics to the detriment of<br />\nathletics and other student enterprises,<br />\n4. In getting \"boozy\" and \"tearing things up.\"<br />\n5. In forever criticising faculty regulations and using no means but gas<br />\nand around-the-corner-mouthings to get them changed.<br />\n6. In talking always about the faults of the institution and never men tioning the good points. No college is perfect; if there were one such, Emerson, Hawthorne, Dana and Curtis would want to come to life so as to live in<br />\nthe new \"Brook-Farm\"—without the farm work.<br />\n7. In filling the heads of the Freshmen with nonsense about the peculiarities of the professors.<br />\n8. In being more loyal to a particular faction than to your alma mater.<br />\n9. In supporting society so called, dances and blind tigers, to the exclusion of athletics, literary societies and college publications. The amount spent<br />\nby one man at a single dance will pay dues in the Athletic Association and subscribe for all the publications.<br />\n<br />\n\fThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\nN. E. Cor. Charles and Fayette Sts-,<br />\n<br />\nPhone,C.& P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br />\n<br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nW. D. BOW EN, M. D., D. 0.,<br />\n<br />\nWedding Silver Nit:\"<br />\nIN GREAT VARIETY.<br />\n<br />\n.5* diENKIN8,<br />\n2te N. CHARLES BT.<br />\n<br />\nSilversmiths.<br />\n<br />\nhenderson's<br />\n<br />\n_<br />\n<br />\nesiC<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books. Note Books,<br />\nMadison & Howard Sts.<br />\napplies.<br />\n<br />\nAgent for Lincoln & Bennett and<br />\nWalter Barriard's London Hats.<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nSilk and Casalmere Hats. Or HOPKINS CAPS<br />\n<br />\ncusHING & COMPANY,<br />\n<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nII. R. EISENBRANDT SONS,<br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n201-203 N. CHARLES ST.<br />\nBALTIMORE, MD.<br />\nCharles T. Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nOtto H. Williams,<br />\nVice-President.<br />\nJ. E. Marshall, Asst, Cashier,<br />\n<br />\nFARMERS & MERCHANTS NAT'L. BANK,<br />\n<br />\nTO<br />\n<br />\nLIGHT AND LOM BARD STREETS,<br />\n<br />\nBoos.<br />\n<br />\nKeeps constantly on hand the Text Books used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\n<br />\nas follows: Samples submitted of<br />\nFrench Itrandy—no adulterants, no coloring,fine quality.<br />\nOporto Port—absolutely pure, of a perior quality.<br />\n.herrY-00<br />\n14<br />\ncoloring or adulterants. absolutely pure wine.<br />\nar.<br />\n.iciy:ld%.Vhiskiiy—<br />\nno Fusel oil, no caramel. strictly pure<br />\n<br />\nPEARRE E. CROWL COMPANY,<br />\nPUBLISHERS.<br />\n<br />\nBooliseliers and<br />\nStational,.<br />\n<br />\n34 W. BALTIMORE ST.<br />\nSCHOOL, Law MaDIOAL CLA••ICAL AND MiliCIILLANICOLA<br />\n<br />\nJORDAN<br />\nSTRBLER GO. migl,W°215VE.<br />\nReads<br />\n<br />\nFOR ADVERTISING SPACE IN THIS PAPER<br />\n<br />\nR<br />\n<br />\nUMBRELLAS, HATTERS, CANES; ETC.<br />\n<br />\nfor<br />\n<br />\nOlive 011—all tests show pure olive oil.<br />\nst41;01ndge.r Vinegar—natural cider vinegar, strictly pure and<br />\nSix Ground Spleen<br />\n-no adulteration, all strictly pure.<br />\n<br />\nJANIKS R. PA INK<br />\n<br />\nV1<br />\n/<br />\n47AR<br />\n<br />\nCertificate of Analysis from<br />\nPeofs. G. W. Lehman It Son,<br />\n<br />\nAPPLY<br />\n<br />\nH. WARMS,D.0.,<br />\nBeo'y. & Treas.<br />\n<br />\nTHKO. WARRICK.<br />\n<br />\nESTABLISHED 1079.<br />\n<br />\nJACOBI<br />\n<br />\nMARIA BUIE, D. 0.,<br />\nV.-Prest. & Asst. See'y.<br />\n<br />\nSouth and Lombard Sts., Baltimore.<br />\nCapital, $660,000<br />\nSurplus amd Profits $450,000.<br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended lii accordance with<br />\nbalances and business responsibility.<br />\nCOILECTIONS A SPECIAL I Y.<br />\nCORRESPONDENCE INVITED.<br />\n<br />\nNom GERMAN LLOYD S. S. CO.<br />\n<br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS. GIBRALTER,<br />\n<br />\nCABIN PASSAGE AT LOW RATES.<br />\n<br />\nNAPLES. GENOA, ETC.<br />\n<br />\n) A. SCHUMACHER &<br />\n(iPnoral A gouts.<br />\n<br />\nBALTIMORE TO BREMEN<br />\n<br />\nFor particulars apply to<br />\n<br />\nCO.,<br />\n<br />\nDIRECT.<br />\n<br />\n\fMANDOLIN. GUITAR AND BANJO Je<br />\ni<br />\n<br />\n41<br />\n<br />\n40.641r ,C111<br />\n<br />\nC. .T.<br />\nwho has made a life study of those nstruments. Mandolin Soloist of.National,reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br />\n<br />\nStBdiO, 331 N. Charles St.<br />\n<br />\nfigenithz Studio<br />\nSuccessor to Cummins<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\n<br />\nBaltimore<br />\n<br />\nSMITH'S\"11417T8`BZIcik.\"K<br />\nOLD<br />\nBOOK<br />\n8053N<br />\nr(i(1:<br />\n11007<br />\n0 frA<br />\noR<br />\nmD STREET<br />\n3rd<br />\nSTORE.<br />\nthe Itran3•Smith piano CO.<br />\n<br />\nSpecial Discount to Students<br />\n<br />\n109 and 111 North Charles Street.<br />\n<br />\nTHE BLAKE<br />\nCO<br />\n<br />\nHABERDASHERS,<br />\nE.thldiretsr,w<br />\nH<br />\nkw<br />\noszarr,y,<br />\nUnderwear,<br />\nEtc.<br />\n<br />\nSOLE AGENTS<br />\n<br />\nCbtcherino, igrabburp anb IllebOter<br />\n<br />\nON SALE THE J. H. U. PENNANTS,<br />\n<br />\nJ1 so 'pianos.<br />\n<br />\narid all other College Pentiailts<br />\n<br />\n203W. BALTIMORE ST. & 2 S. LIBERTY ST.<br />\nBALTIMORE, MD.<br />\nClitcn P. Paine<br />\nGordon P. Paine<br />\n<br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange<br />\nChicago Board of Trade<br />\n<br />\nCLINTON P. PAINE & CO.,<br />\nBANKERS ct BROKERS<br />\nPrivate Wires to<br />\n<br />\nNew York and Chicago<br />\n<br />\n217 E. German Street<br />\nBALTIMORE, MD.<br />\n<br />\nThe Chas. Willms SurRical Instrument Company<br />\nBENJ. A. NELSON, GEN'L MANAGER<br />\n<br />\nPhysicians,' Burgeons,' Hospital and Invalid Supplies.<br />\nPine Microscopes and Accessories.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\nBaltimore, Md.<br />\n<br />\nDrovers and Mechanics National Bank,<br />\nOF BALTIMORE, MD.<br />\nCapital StOCk, $300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br />\n<br />\n0. & P.'Phone 2322-2.<br />\n<br />\nBOOKS<br />\n<br />\nFactory Prices.<br />\n<br />\nOLD AND NEW<br />\n<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City<br />\nBooks Bought, Sold and Exchanged<br />\nWM. V. PIPPEN,<br />\n<br />\n605 N. Eutaw Street.<br />\n<br />\nJ. Wm. Middendorf,<br />\n<br />\nA. ii Rutherfoord.<br />\nF. Lentz.<br />\n<br />\nA. J. Robbins.<br />\n<br />\nJ. WM. MIDDENDORF & CO.<br />\nBankers &113rokers.<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nMembers<br />\nBaltimore Stock Exchange.<br />\n<br />\nBaltimore, Md,<br />\n<br />\nB. G. ElCHELBERGER,<br />\nBOOKS AND STATIONBRY<br />\nENGRAVING AND STAMPING.<br />\n31)t4<br />\n<br />\n-tix<br />\nr-leams<br />\nY. M. C. A. BUILDING,<br />\n<br />\nC. & P. and Md.'Phones.<br />\n<br />\nYOUR<br />\n'<br />\n<br />\nARE<br />\niiE Y()<br />\nEU<br />\nREBB<br />\nLI<br />\n,<br />\n)<br />\nVE<br />\nIA<br />\nNO<br />\nD<br />\nEYLS<br />\nTHAN BLIND.<br />\n<br />\n291 North Charles Street. (Masonic Temple.)<br />\n<br />\nEX/'MINING OPTICIRAS.<br />\nTHE NEWS LETTER<br />\n- -- is from the Pres; of<br />\n<br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\n<br />\nLight and Lombard Streets,<br />\n<br />\nBALTIMORE<br />\n<br />\nWe carry a fuilline of Students' Note Books and Stationery<br />\n<br />\nBoth 'Phones.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nJR'S.<br />\n<br />\nIt DOWNS<br />\n<br />\n229 N. Charles St.,<br />\n<br />\nTHINK IT OVER.<br />\n<br />\nSAYRE OPTICAL COMPANY,<br />\n<br />\n•<br />\n<br />\nctill. ON<br />\n<br />\nett..<br />\n<br />\nT<br />\n<br />\nMA•ONICI TEMPLE.<br />\n<br />\nFOR Class, Fraternity and College Stationery,<br />\nBanquet Cards, invitation, Diplomas,<br />\nPrograms, Visiting Cards, etc<br />\n<br />\nOur 50e J. ft. U. Blue and Black Nag Paper—now ready<br />\nThere is very little entertainment at home without a Plano<br />\n<br />\ncT<br />\niE<br />\nFF<br />\n/pIANo<br />\n<br />\nfire The Best.<br />\n<br />\ns<br />\n<br />\n9 N. Libertu St.<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol. VI, No. 3<br /><br />\nNovember 6,1901.<br /><br />\nJOHNS HOPKINS UNIVERSITY.<br /><br />\nThe Johns Hopkins Press.<br /><br />\neALTimORE, MO.<br />\nI.<br /><br />\n....11,101111111111111.110<br /><br />\nTiventreSixth Year.<br /><br />\nI)iioil<br />\nIh<br /><br />\nBeginning October It, 1901.<br /><br />\nIRA REMSEN.<br />\nWM. H. HOWELL.<br />\nEDW. H.(1 RIF FIN.<br /><br />\nflu' .11<br /><br />\no.I i !to<br /><br />\nINsrtzucTio‘i<br />\nFor (imamate Students:<br />\n(a) In Philosophy and the A rts. (('ourses for cantli<br />\ndatre for the degree of Ph. D.)<br />\n(b) lii Medieine. •(Cowie-s for candidates...for the degree of M. D.; cours's far physicians.)<br />\nFor Undergraduates:<br />\n(e) As4.qtudidetes for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLibraries of Baltimore.<br />\nU niversity..... ........<br />\nPeabody Institute.<br />\nPratt Library<br /><br />\n............ 100,000 volumes.<br />\n•,<br />\n135,01'0 yolune.s.<br />\n•<br />\n200.000 volumes.<br /><br />\nLaboratories.<br />\nChemistry,<br />\nP5hysi' a.<br />\nGeology'and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPhNrmacology,<br />\nPhysiologleal +item 1st ry,<br />\nMedleinv,<br /><br />\nlileit.et ors.<br />\n1 ti nem xen.<br />\n.1 use oh s...4rnes.<br />\n11,dil jam; II. (liark.<br />\n/3.ors•irs.<br />\nPraoh.'in I). :Irak.<br />\n1111.1(al<br />\n117/liata Jr. welch.<br /><br />\n..b.ht#„1. \"11,d.<br /><br />\nJohn .1. Abet.<br />\nWI/tiara 014IcrDirectors.<br />\nBasil L. Gildersleeve. '<br />\nKirby 14`; ±•;mith.<br />\nManner Bloomfield<br />\nPaul Haupt.<br />\nHenry IVood.'<br />\nA. Marshall- Eniott.<br />\nJames W. Bright.<br />\nM. Vincent.<br />\n- tT H. Hotkinder.<br />\nFrank Morley.<br />\nJoseph S. Ames,<br /><br />\nUndergraduafeS Courses<br /><br />\n(leading to B. A.)<br /><br />\nAmerican Journal of Mathernaties.<br />\nF. MOH LEY, Editor. Quarterly. 4th. Volume X XIV .<br />\nIn progress:' 1115 per volume.<br />\nII. American Chemical Journal. • • ,<br />\nI. R EMMEN, Editor. Monthly. 8vo. ,'Volume XXVI<br />\nIn progress. $5 per volume.' .<br />\nIII. American Journal of PhiliologY,<br />\nB. L. GILDERSLEEVE, E4ii0r. Quarterly. fivo.<br />\nVolume XXII in progress. `Iti per volume.<br />\nIV. studies from the Biological Laboratory. 8Yo.<br />\nVolume V complete. $5 per volume.<br />\nV. Studies in Historical and Political Science,<br />\n• Monthtv. 8vo. Series XIX in progress. $3 per<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of a dentifie and literary work<br />\nin progress in Baltimore. 4to. Vol. XX kit progress. $1 per year.<br />\nMonthly. 41o.<br />\nVII. John I itipkins Hospital<br />\nVolume XIT in progress. $1 per yeart<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume X<br />\nin irrogress. $5 per volume.<br />\nIX. contributions to Assyrielogy and Comparative<br />\nsemitie Philology,(Beitrage zur A ssyriologie,etc.)<br />\nVol. IV in progress.<br />\nX. memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nX<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVI in progress. $1.50 per volume.<br />\nXIL Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Bi-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nxurt. American Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 4t0., $5 per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\n• , WILLIAM B. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nI,. A. BAUER, Editor. Quertf.‘rly.<br />\n'avo. Volume VI in progress, $2.50 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nXVII. Anneal Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br /><br />\n(ironing.<br />\nI. Chngsipn I (tile \"Old College (ourse.\")<br />\n2. Mni Iteinatien I Physiee I,<br />\nikading up to.Kegineering.)<br />\n.<br />\n3. (*fitful (ell -H1014,0.1+1.<br />\n(ii'aqing ill/<br />\n4. (14..4)10/gival Itiolovieo I.<br />\n5. Le tin \\Tel latineil<br />\nPolitietp.<br />\nc.<br />\n((ci'tFiTpguiIt to IA(*)<br />\n7. mo Fern ebnetiag•e14...•<br />\n• , t<br />\nEditors.<br />\nSerial,Pubircritliins•<br />\nvrell e ,Ileriry„<br />\nM attic in,.ties:Ivor. N<br />\ni(ein,,C14..<br />\nCh, inkittri*(vel, XX V-I).<br />\nHavil L. (Ittglersleevog.<br />\nol. X X IL)<br />\nJ. M. Vincent<br />\nHistory.(vol. NIX•••)<br />\nt.<br />\nA, Marshall<br />\nModern Langira4iA(vol. XV I.)<br />\n14'1114am K. Brooks.<br />\nBiolefpy (vol. i V.<br />\nPaul Hanoi.<br />\nAss rioltars.(vol. TV.)<br />\nIT.<br />\nExperiment ,1 Medicine(vol. VI.)<br />\n,,•<br />\nProgrammes of the Courses offered to graduate stti&amp;nitrite Philosophy and the Arts, and in the School of<br />\nMadieino, and also of the Undergraduate or Collegiate<br />\nColirsem, will be sent on applicatioh to the Regktrsr.<br /><br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the 0141<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photograph of the Normal Solar Spectrum.<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. J. S. Bill<br />\nings, Editor. 116 pp. 4to. 16 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fee-simile edition. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MS with A ntile. gomena Epistles. Edited by I. H. Hall. $13.06.<br />\nBibliographik. Hopkinsiensis. part I. Philology. Parts<br />\nChemistry, Mineralogy and Geology. Parts<br />\nIV-V-V I.PhYsies, Astronomy and Mathematics.<br />\n• 8 Vi). R cents per part.<br />\nTull list of publications will be sent on application.<br />\nCommunications In respec`, to exchanges and remittances<br />\nakin Press, Baltimore. Md.<br />\nmag be sent to Johns<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br /><br />\nNOVEMBER 6, 1901.<br /><br />\nNo. 3.<br /><br />\nMETHOD IN READING.<br />\nS it possible to give a general answer, of any value, to the question, What<br />\nshall I read?<br />\nThe question is not well answered by prescribing a list of books. This<br />\ndoes not allow for individual tastes and for special circumstances, and for that<br />\nreason can hardly lead to any valuable result; \"Courses of reading\" are seldom<br />\nfollowed with profit. Nor is it enough to say simply that one should read what<br />\none finds interesting. This is true, but not the whole truth, for, out of the various things that may interest one, it is desirable to select the most important. Is<br />\nit possible to lay down any principles that may guide one in determining what,<br />\nat any given stage of intellectual progress, is most suitable to be read?<br />\nMost persons would probably agree that, to one who has general cultivation<br />\n.<br />\nIn view, history is of such fundamental importance that it should, especially at<br />\nfirst, form the staple of reading. The mind is interested in facts earlier and<br />\nmore easily than in abstract thoughts, and hence it is well to begin with history.<br />\nMoreover, many subjects cannot be understood without a competent historical<br />\nknowledge; no one can study art, literature, politics, philosophy intelligently,<br />\nunless he knows something of the development through which they have passed,<br />\nand the various conditons of society which, at different times have modified<br />\nthem. In studying history, one is preparing oneself for the study of many<br />\nthings. Further, the dispositions, intellectual and moral, which are cultivated<br />\nthrough historical studies are of highest value; \"histories make men wise.\"<br />\nDuring the earlier years of one's self-education, the endeavor should be to gain<br />\na competent knowledge of—at least—Greek, Roman, Mediaeval, English and<br />\nAmerican history. In such reading care must be taken not to attempt to force<br />\nthe memory to retain too much. The writing of abstracts is a valuable aid, and<br />\nfrequent and patient review is indispensable.<br />\nThe reading of imaginative literature should go on in connection with historical and biographical reading. One reason for combining th2 two is the<br />\nmental relief thus secured. Works of fiction are especially useful as recreation.<br />\nAfter prolonged and serious application, a good novel will restore tone and animation to the mind. Two things should be remembered in regard to novel<br />\nreading: first, that it ought to be kept in its place as recreation and not allowed<br />\nto usurp time needed for other purposes, and, second, that it should be confined<br />\nto books which are really worth one's while. Much time is wasted upon third<br />\nand fourth rate stories, which, if expended upon masterpieces, would yield far<br />\nmore pleasure, as well as vastly more profit.<br /><br />\n5<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nThe glory of our English literature is in its poetry. This \"feigned history\" is as important an element of our mental life as actual history. Lord<br />\nBacon well expresses the relation between the two. \"Because the acts or events<br />\nof true history have not that magnitude which satisfieth the mind of man, poesy<br />\nfeigneth acts and events greater and more heroical; because true history propoundeth the successes and issues of actions not so agreeable to the merits of<br />\nvirtue a nd vice, therefore poetry feigns them more just in retribution, and more<br />\naccording to revealed providence; because true history representeth acts and<br />\nevents more ordinary and less interchanged, therefore poesy endueth them with<br />\nmore rareness, and more unexpected and alternative variations.\" One should<br />\nbegin with objective and narrative poetry rather than with that which is analytic<br />\nand reflective. The early ballads, the Canterbury Tales, Shakspere's histories<br />\nand comedies, Goldsmith, Gray, Burns, Scott, Tennyson's Idyls of the Kings,<br />\nLongfellow, Whittier—such poetry is more suitable to an unformed taste and<br />\njudgment than that of which Wordsworth may be cited as an example. Such<br />\ncollections as the \"Golden Treasury of Songs and Lyrics\" are an excellent introduction to the study of poetry. At a later stage of one's growth, the profounder poen y becomes congenial; one learns to find pleasure in metaphysical<br />\nrefinements and over-subtleties, like those of Robert Browning, which at first<br />\nwould have been simply incomprehensible.<br />\nAfter a proper basis has been laid for it, what may be called philosophical<br />\nreading may be undertaken with profit. By this is meant works of theory and<br />\ncriticism, which attempt to do more than narrate and describe, which seek to<br />\nmake generalizations and to search into laws and causes. Every great series of<br />\nfacts, whether of nature or of man, is capable of being treated both historically<br />\nand philosophically, that is, in the way of simple statement and narration, and<br />\nalso with the design of accounting for the facts and getting at the truths and<br />\nlaws involved in them. When the latter mode of treatment is adopted, it is<br />\ncommon to use the word philosophy—as we speak of the \"philosophy of history,\" or the \"philosophy of art.\" This department of literature should evidently be reserved until a suitable amount of knowledge has been acquired, and<br />\nthe powers of reflection and speculation have been properly developed. One is<br />\nnot qualified to judge the merits of a theory, or a generalization, until one has<br />\nbecome familiar with the facts upon which it rests. The range of possible<br />\nreading under this head is, of course, indefinitely wide. A person interested in<br />\nnature will naturally pass from simple observation and experiment to the speculative and theoretical aspects of his subject. One familiar with history and literary events and personages will enjoy works of criticism and generalization,<br />\nwhich seek to establish principles of taste, to deduce laws of progress, to compare different eras of civilization. The mental and moral sciences fall under this<br />\ncategory, and also works of political, social,.and theological science. One comes<br />\nto studies of this kind at a great advantage, if the mind has been generously<br />\nequipped with facts, and the imagination has been trained by familiarity with the<br />\nmasters of fiction and poetry.<br />\nA threefold classification, such as has been suggested, may be of service to<br />\none who is trying to outline a plan of reading with reference, not to acquisition<br /><br />\nTHE NEWS—LETTER.<br /><br />\n3<br /><br />\nin a specific field, but to general culture. History, as affording a basis of fact;<br />\nimaginative literature, as helping to develop the ideal faculty; philosophy, in a<br />\nbroad sense, as coordinating and interpretating the phenomena of the world:—<br />\nthese are the three interests which need to be kept in view, and to be brought<br />\nE. H. G.<br />\ninto harmonious cooperation.<br /><br />\n. MEMORIAL EXERCISES TO DR. ROWLAND.<br />\nN Saturday, October 26th, the lecture room of the Johns Hopkins physical<br />\nlaboratory was filled by students and scholars, assembled to hear former<br />\nPresident Mendenhall of Worcester Polytechnic Institute deliver a eulogy<br />\non the late Prof. Henry A. Rowland. Among those present were Mrs. Rowland<br />\nand other members of the late Professor's family, Mrs. Huntington Williams,<br />\nDr. Carey T. Hutchinson of New York, and Dr. N. E. Dorsey of Washington,<br />\nwho were formerly connected with the Johns Hopkins department of physics;<br />\nDr. Wolfe of Washington; Dr. Stratton, the director of the National Bureau of<br />\nStandards, and Dr. Barker of Philadelphia. Former President Gilman had a<br />\nplace in the front row.<br />\nPresident Remsen said, as he introduced Dr. Mendenhall:<br />\n\"We have already given some expression to the thoughts and feelings Professor Rowland's death aroused in us. We were then, however, too much influenced by our new grief to look at his life work in the broadest way. Our expressions were rather those of personal emotions. We meant to hold a meeting<br />\nat which the fuller meaning of his life might be made clear to us. We are receding from him, and the increasing distance gives us clearer view. How great<br />\nhe was and in what way only a physicist like himself can tell us.\"<br />\nDr. Mendenhall was then introduced and commenced his address by a reference to Professor Rowland's originality.<br />\n\"Many of his contemporaries,' he said, \"excel him in the quantity of their<br />\nworks; very, very few of them equal him in its quality. The full value of his<br />\nlabors may be understood only in the great results to which its quality led other<br />\nworkers whom his example had stimulated. A complete estimate would demand<br />\nreference to nearly all physical investigation of the last quarter of the old century. Quality was his admiration. By this test we will judge his achievements.\"<br />\nWith a close knowledge of exact details Dr. Mendenhall then sketched the<br />\ndevelopment of Dr. Rowland's investigations from an early paper written as a<br />\njoke to the Scientific American at the age of 17. The latter part of the address<br />\nWas devoted to the personal side of the dead physicist. His characteristics, the<br />\nearly aptitudes and preferences of the boy, his perseverance and dexterity in applying them under difficulties, the boldness and directness by which he reached<br />\nhis later results, the severe candor with which he treated his own works and<br />\neverybody else's, his underlying kindness of heart, the full devotion with which<br />\nhe pursued his objects all were outlined in a manner that aroused the highest<br />\nadmiration of the audience.<br />\nAfter the address Dr. Remsen invited those present to go into one of the<br />\nnearby investigation rooms and look over the many inventions of the late<br />\nscientist.<br /><br />\n013<br /><br />\nTHE NEWS-LETTER.<br /><br />\nREPRODUCTION OF THE ATHARVA-VEDA.<br />\nROI-4'ESSOR Maurice Bloomfield is in possession of a newly-issued hook<br />\nwhich promises to throw much light on the manners and customs of our<br />\nAryan ancestors many hundreds of years ago. It is a photographic<br />\nreproduction, prepared by Professor Bloomfield and Professor Richard Garbe of<br />\nTubingen, of the oldest known manuscript of the Atharva-Veda, one of the<br />\nVedic or sacred books of the Aryan nations. The \"Atharva\" is the collection<br />\ngiving the charms, exorcisms, and incantations of the old religion. It tells<br />\nhow to secure a sweetheart, maintain a happy family, control sickness, and<br />\nsucceed in business; and it thus gives a most valuable glimpse into the life and<br />\ninstitutions of our oldest known progenitors.<br />\nThe bringing to light of this volume is due mainly to Professor Von Roth,<br />\nof Germany. He realized the insufficiency and corruption of the first edition of<br />\nthe Atharva; and it was by his energy that the present manuscript was discovered in Srinagar, Kashmir. Professor Roth left the manuscript at his death to<br />\nthe University of Tubingen.<br />\nThe manuscript contains about 275 pages of two sheets of birch hark each,<br />\nwritten in an indelible black ink, little faded in the 400 years since the manuscript was written. (The collection contained is, of course, many centuries<br />\nolder.) Professor Bloomfield hoped that in time a version replacing the native<br />\ncharacters by their English equivalents may be printed, followed by a translation of the text.<br /><br />\nT<br /><br />\nDR. GILDERSLEEVE AND THE MEMORIAL VOLUME.<br /><br />\nt<br /><br />\nHE widespread and deeply appreciative tributes of the press on the occasion<br />\nof Dr. Basil L. Gildersleeve's seventieth birthday, October 23, are examples of high praise where it is due. Dr. Gildersleeve has combined more<br />\nthan, perhaps, any other living American, the functions of the tremendously<br />\nerudite specialist, and of the broad minded man of letters. This idea of liberal<br />\nscholarship he has carried with him throughout his lengthy and many-sided<br />\ncareer.<br />\nDr. Basil Lanneau Gildersleeve was born in Charleston, S. C., October 23,<br />\n1831. He took his A. M. at Princeton in 1852, after studying at Charleston<br />\nand Washington Jefferson Colleges. In 1856, after several years at Berlin,<br />\nBonn, and Gottingen, he became Professor of Greek at the University of Virginia; and his connection there continued, with a break during his service in<br />\nthe Civil War, until the foundation of the Johns Hopkins University in 1876.<br />\nHonors have showered upon Dr. Gildersleeve for many years, the latest<br />\nbeing the degree of I.,. L. D. presented him by Yale University. But of all<br />\nthese recognitions, perhaps none has carried to him as much personal good-will<br />\nand esteem as will the Memorial Volume now under preparation by a number<br />\nof his former students.<br />\nThis volume will be entitled: \"Studies in Honor of Basil Lanneau Gildersleeve.\" It will contain some 400 pages, consisting of articles by thirty of his<br /><br />\nTHE NEWS—LETTER.<br /><br />\n5<br /><br />\nformer students at Virginia and Johns Hopkins; and these articles will constitute not only a tribute to Dr. Gildersleeve, but a valuable addition to Greek<br />\nphilology. Four hundred copies are to be printed by subscription. Dr. M. C.<br />\nSutphen, whose unfortunate death occurred this summer, had charge of the<br />\narrangements for the book. The present committee is composed of Dr. E. H.<br />\nSpieker, Dr.. Maurice Bloomfield, Dr. C. W. Emil Miller, Dr. Kirby F. Smith,<br />\nDr. Christopher Johnston, Dr. B. J. Vos, and Dr H. L. Wilson.<br />\nOn Dr. Gildersleeve's return from Yale, he was presented with a handsome<br />\ncathedral clock by the students of his department. The publication of the<br />\nMemorial Volume, however, will not take place until Christmas.<br />\nMEDAL FROM YALE.<br /><br />\nZ<br /><br />\nHE Johns Hopkins University last week received from Yale a beautiful<br />\nbronze medal, in commemoration of the late bicentennial celebration. In<br />\nspeaking of the gift President Remsen said that all the leading universities and colleges which were represented in the exercises had received a similar<br />\nmemorial. The medal was made by Tiffany &amp; Co., N. Y. It is embedded in<br />\na dark leather case, about four inches square, lined with Yale blue silk and<br />\nplush. The medal itself is two inches in diameter, and is of the finest workmanship.<br />\nOn its face is the figure of a victorious Greek, returning in his war<br />\nchariot. In front of his restive steeds, a fair goddess waits to place on his brow<br />\nthe wreath of laurel, Above this scence are the Latin words \"Lux et Verztas.\"<br />\nOn the other side are two Grecian torches, between which, in raised letters, is<br />\nthe simple memorial inscription:<br />\nUniversitas Yalensis<br />\nA. D. MDCCCCI<br />\nConcelebtat<br />\nCollegium Yalense<br />\nA. D. MDCCI Conditum.<br />\nX PRESIDENT Gilman's address on the second day of the Yale Bicentennial Celebration treated of the relation of Yale to letters and science. In<br />\nc- onclusion, he described the spirit of Yale as \"living for others, not for<br />\none's self, the greatest happiness in the utmost service.\" Dr. Welch, professor<br />\nof pathology at the Medical School, also spoke,tracing the development of medical progress by Yale professors and graduates. On this occasion, President<br />\nRemsen, Dr. Osier, and Dr. Gildersleeve were honored with the degree of<br />\nL. L. D., which has already been conferred by Yale upon three other members<br />\nof the Faculty—ex-President Gilman, the late Dr. Rowland, and Dr. Welch.<br /><br />\nTHE NEWS—LETTER.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br /><br />\nHOPKINS UNIVERSITY.<br />\nNOVEMBER 6, 1901.<br />\nSubscription $1 50 per year.<br /><br />\n10 Cents a single copy.<br />\nWILLIAM B. HILL, 1902,<br />\n. SOL STROUSE, 1902.<br />\n.<br />\nEDEN C. HILL, 1902.<br />\nROBERT S. LANIER, 1903.<br />\nW. S. BIRD, 1903.<br />\nJOHN A. SLE MONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1903.<br /><br />\n.<br />\n.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br /><br />\n•<br /><br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\nAddress all articles, communications, etc., to WILLIAM B. HILL, box 269, Johns Hopkins<br />\nUniversity, l'.altimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 183<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\nALL ROOTERS OUT.<br />\nN November 16th, the first game for the Maryland Inter-Collegiate foot<br />\nball championship will be played in Baltimore between Western Maryland College and Johns Hopkins. On our trophy-room wall is a space<br />\njust large enough for the championship banner; the team is going to try to cover<br />\nthat space. The team has worked hard and conscientiously, \"meds\" and<br />\nscrubs are out; but so far the rooting has been woefully weak. Weak rooting<br />\ndoes not help bring banners to Hopkins; good, strong rooting is a great<br />\nencouragement to the players. Every loyal Hopkins man will be on hand at<br />\nboth the Western Maryland and St. John's games to help the team struggle.<br />\nEvery Hopkins man who wants to be called true to his colors must realize that<br />\nhe is needed at the games. Everybody out, to demonstrate that the enthusiastic<br />\nspirit of the last two years is not dead, but dormant.<br /><br />\nO<br /><br />\nHE gymnasium building is the barometer indicating changes in the temperament, feelings, and conditions of Hopkins men. If trouble is brewing, the<br />\nfirst foam is generally seen in the gym -or cage; if victory is to be celebrated,<br />\nthe cage is the place where the first yell is given. The locker-room,the cage, the<br />\ngymnasium proper are so intimately associated with Hopkins life that the mere<br />\nmention generally brings up clear visions !of some of the most i pleasant<br />\nincidents of the short three years here. It is also intimately connected with<br />\nsome of the first impressions—which may not be so pleasant. All the idle<br />\nmoments at one's command are put in at the gym; and its just in this point that<br /><br />\nZ<br /><br />\nTHE NEWS-LETTER.<br />\nthe weather indications are shown. If many men loaf around in citizen's garb,<br />\ninstead of donning undress suits; if they saunter around with pipe in mouth,<br />\nand hands in pocket, passing time and criticisms regardless of the value of<br />\neither; if their only occupation is to knock,—then something is wrong somewhere. The atmosphere or the people is at fault. That it is not the atmosphere is shown by the notable lack of loafing this year. Very few men come<br />\ninto the gym building now unless they go in for work. The apparatus upstairs<br />\nis being worked hard, the foot ball squad is fairly large, lacrosse and track men<br />\nare out, and altogether there is plenty of life all around. Where there is so<br />\nmuch scholastic activity as here, such a state of affairs in athletics is to be<br />\nhighly commended. The atmosphere is apparently healthy for a general<br />\ndevelopment.<br /><br />\n4 43T's strange I never see any class numerals on fellows over here.\" A<br />\nmedical student at Hopkins, who received his A. B. at a large Northern<br />\ncollege, was heard to give expression to these remarks a few days ago.<br />\nWhen the matter is thought over, it does seem strange that within the last few<br />\nyears the giving of numerals as athletic honors within the classes has been<br />\nabandoned. The practice must have been in vogue when the class of 1900 was<br />\nhere, for many men of that class were seen to wear the red 1901 in \"broad display on their manly chests,\" and on the jerseys of still older men is occasionally<br />\nseen the graduating year. Surely, a man who does good work for his class<br />\nought to receive recognition as well as the fellow who is lucky enough to make<br />\nthe 'Varsity. Where many men strive for few positions, the majority get left;<br />\nbut why should not the classes remember that it is this majority who bring<br />\nvictories on class day and rushes? Naughty-two has forgotten this. Think it<br />\nover, Juniors and Freshmen.<br /><br />\nSENIOR FEED.<br /><br />\nt<br /><br />\nHE first \"Feed\" of the Class of '02 is to be held at the Johns Hopkins<br />\nClub on the evening of the 16th, after the Western Maryland College<br />\ngame. Details may be learned from Ogle Marbury, '02. In this connection it is interesting to note a recent address of President Pritchett of the<br />\nBoston- \"Tech.,\" in which he strongly advocated just such \"stein and pipe\"<br />\ngatherings, in contrast to the formal dress banquet.<br />\nPresident Pritchett believes in the democratic system of entertainment<br />\nfound in German universities, where professors and students meet at the frequent \"vereins,\" discussing problems or enjoying more general conversation.<br />\nRich and poor alike gather in good fellowship, each man paying his own score<br />\nfor beer and tobacco. Thus, says Dr. Pritchett, much sympathetic intercourse<br />\nis made possible between the students and also the professors; and he hopes<br />\nthat his proposed inauguration of such meetings among college students in<br />\nBoston will cause a big improvement in college social life.<br />\nThese free and informal \"feeds\" are a move in the right direction, one<br />\nwhich must be taken up in turn by '03. Every Hopkins man will welcome a<br /><br />\nS.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n8<br /><br />\nchance to see more of his classmates, under such reasonable and cheerful<br />\nconditions;<br />\n\"For it's always fair weather,<br />\nWhen good fellows get together,<br />\nWith a stein on the table.<br />\nAnd a good song ringing clear.\"<br /><br />\nUNDERGRADUATE HAPPENINGS.<br /><br />\nt<br /><br />\nHE Class of 1902 has decided to present a large settee to the trophy-room.<br />\nIt is now being made, and will completely fill one of the corners.<br /><br />\nThe Junior Class officers are: President, H. W. Plaggemeyer; Vice-President, R. C. Hoffman, Jr.; Secretary, J. T. Smith; Treasurer, F. Hazlehurst, Jr.;<br />\nHistorian, R. S. Lanier; Poet, T. W. Glocker; Orator, J. B. G. Custis, Jr.;<br />\nJester, 5, C. Hopper; Sergeant-at-arms, J. A. Houghton; Captain of Class Foot<br />\nBall Team, F. C. Blauck; Manager, W. H. Matthai; Yell Committee: Lanier,<br />\nBamberger, Pagon, Sandrock and Bird; Flag Committee, Tootle, Baetjer and<br />\nHunley. The following men have been taken into the class organization: F.N.<br />\nIglehart, from '94; Royalle Williams, Lehigh; J. M. Combs, University of<br />\nCalifornia.<br />\nJ. S. Grasty has been elected by acclamation to the post of chief rooter,<br />\nand is endeavoring to instil into the minds of the Freshmen some slight knowledge of the Hopkins yells. Meetings for practice have been held in the cage,<br />\nand it is hoped that '04 will soon make some much-needed improvement in this<br />\ndirection. They need it.<br />\nThe first deba\"e in the Senate on the benefits of the late strike was not a<br />\nshining success. After much talking on both sides, the decision was awarded<br />\nto the Ministry's team, which upheld the capitalists' view. The Juniors debated the same question with the same result. The Senior debaters have already<br />\nbeen announced in the NEWS LETTER. The Juniors were: Plaggemeyer,<br />\nSmith, Tootle, affirmative; Strayer, Glocker, Blum, negative,<br />\nThe Freshman Class officers are as follows: President, E. D. Dickey; VicePresident, J. N. Numsen; Secretary, L. G. Wallis; Treasurer, J. R. B. Branch;<br />\nHistorian, R. S. Opie; Poet, R. S. Licking; Sergeant-at-arms, S. C. Erlanger.<br />\nThe class colors are black and red.<br />\nThe strength of the present Freshman Class is 48, as against 55 for last<br />\nyear. Noughty-three, however, has lost several men this fall, so that the<br />\nnumbers are not far from equal.<br />\nAn edict has been issued by the Musical Club's management, requiring all<br />\nprospective members of any club to deposit with the leader the sum of $3.00,<br />\nwhich is to be regarded as an advance payment of fines for absence and lateness<br />\nat rehearsals. These fines are at the rate of 50 cents for each rehearsal cut and<br />\none cent for every minute late. The money is to be refunded at the end of the<br />\nseason, less fines collected.<br /><br />\nt.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n9<br /><br />\nThe Glee Club is practising a new Hopkins song, words by W. B. Carver,<br />\nto the tune of \"Michael Roy.\" It is a lively marching song, and bids fair to<br />\nbe the success of the season.<br />\nA new scientific organization has been formed, by name the Society of the<br />\nDiamond. It was started by a group of biological students, who, finding themselves unable to see some required object in the laboratory, adjourned to procure aid. Subsequent meetings have been held with great benefit. This asso<br />\ndation, which is semi-secret in character, is open to scientific students only.<br /><br />\nUNIVERSITY NOTES.<br />\nN Thursday, Oct. 24, the marriage took place of Mr. Melvin Brandow, assistant librarian of the University, to Miss Ruth Boocock, of New Jersey.<br /><br />\nO<br /><br />\nDr. J. M. West, of this city, who took his degree at the Medical School last<br />\nJune, is about to start for Germany, where he will specialize at various leading<br />\ninstitutions in diseases of the throat.<br />\nDr. Percy L. Kay, recently called to a position in the Treasury Department<br />\nof Porto Rico, is the third Hopkins graduate from the history and economics<br />\ndepartment to hold a position at the Porto Rican Treasury. The other two are<br />\nDr. J. H. Hollander, who was treasurer of the island, and Dr. T. S. Adams,<br />\nwhose place Dr. Kay is taking.<br />\nDr. Francisco del Valle, and Dr. Francisco del Valle, Jr., who are attending<br />\ncourses in the department of history and economics, are graduates of the Institute of San Juan, Porto Rico; the former in 1867, the latter in 1894. In addition, Dr. del Valle is an M. D. of the College of Medicine, Cadiz, 1872, while his<br />\nson took his D. D. S. at the Baltimore College of Dental Surgery, and has also<br />\nstudied law at the University of Maryland.<br />\nJ. E. Routh, 1900, has been awarded the $250 prize offered by the Century<br />\nMagazine for the best essay written by a graduate of any American college or<br />\nuniversity. The title of the essay was \"Huxley as a Literary Man.\" Mr.<br />\nRouth is at present a graduate student in mathematics and physics.<br />\nA letter has been received from the Johns Hopkins Club of the Middle<br />\nWest, announcing that its second annual session and banquet will be held at<br />\nthe Hotel Baltimore, Kansas City, Mo., on Friday, November 29. Those finding it possible to attend will notify the secretary, Dr. Chas. Lee Smith, Liberty,<br />\nMo. The officers of the club, which numbers more than 60 members, are as<br />\nfollows: President, Dr. F. W. Blackmar, University of Kansas; secretary, Dr.<br />\nChas. Lee Smith, William Jewell College, Mo.; vice-presidents, Prof. J. C. Futrall, University of Arkansas; Dr. A. G. Leonard, of Iowa, and Dr. J. White,<br />\nUniversity of Nebraska, These officers constitute the Executive Committee.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nATHLETICS.<br />\nFOOT BALL SCHEDULE. ,14<br />\nNOVEMBER D.—Delaware College vs. J. H. U., at Wilmington.<br />\nNOVEMBER 16.—J. H. U. vs. -Western Maryland, at American League Park.<br />\nNOVEMBER 23.--J. H. U. vs. St. John's, at American League Park.<br />\nNOVEMBER 28.—(Thanksgiving Day), J. H. U. vs. U. of M.. at American 'League Park.<br /><br />\nGALLAUDET, 12—HOPKINS, 0.<br /><br />\nt<br /><br />\nHE result of our game with Gallaudet was no more than could be expected<br />\nwith the crippled team which represented Hopkins aturday before last.<br />\nBlanck could not be in the game on account of his lame foot. Hill was not<br />\nwith the team, and Stone was also unable to play. With these three men out of<br />\nthe game Hopkins did well to hold her silent opponents down to twelve points,<br />\nwhich she did very creditably.<br />\nSharretts kicked off, and Gallaudet was downed with the ball on her fiveyard line. Right at the start Gallaudet showed some superb team work, as her<br />\ninterference was well nigh invincible, and quickness in starting remarkable.<br />\nErickson made the first dash through left tackle, leaving thirty yards behind him<br />\nat the finish; and after an effective mass-play, added ten yards around right end.<br />\nBy alternating end plays with marvelous success, Gallaudet lanced the pigskin<br />\nin the coveted position after six minutes of play. Geilfuss kicked goal.<br />\nSharretts kicked off for Hopkins, and Andree advanced the oval to the fifteen yard line. After two long end runs by Erickson and Andree, Gallaudet<br />\nlost the ball for holding; but the Black and Blue were unsuccessful in their attempts at tackle through tackle, so Sayler punted, and by making a touchback<br />\nthe silent eleven returned the ball from their twenty five yard line Sharretts<br />\ncaught it and carried it twenty yards on the jump. Then Hopkins unfortunately<br />\nlost the oval on downs; and after good gains through guard and around the<br />\nends, Gallaudet tried a drop kick for goal, but failed and Hopkins downed the<br />\nball on her twenty yard line. The Black and Blue now being unable to tear off<br />\nmore than a yard or two of the required five, Sayler punted. Gallaudet was<br />\nforced to do likewise, soon after Sayler returned the kick; and the first half<br />\nended with the ball on Gallaudet's forty yard line.<br />\nGallaudet started the second half with a beautiful kick, and Hopkins<br />\ndowned the ball on her three yard line. Sayler immdiately punted. After a<br />\ncouple of good gains through tackle and end Gallaudet was penalized ten yards<br />\nfor holding, and soon after tried a drop kick. A touchback being made, Sayler<br />\nkicked from the twenty-five yard line, and the ball was downed iu the center of<br />\nthe field. Now with her excellent interference and speedy rushes through the<br />\nline and around the ends, Gallaudet soon had the ball behind the goal post.<br />\nGeilfuss again kicked goal.<br /><br />\n11<br /><br />\nTHE NEWS-LETTER.<br /><br />\nSharretts kicked off, and after a short gain of five yards the mutes lost the<br />\noval on downs. Hopkins, rather than do likewise, kicked. Thus the second<br />\nhalf ended with the ball in Gallaudet's possession on her fifty yard line.<br />\nAs was stated the Hopkins team was not its real self in this game. Besides<br />\nthe three men who were not in it at all, Whipple was knocked out right at the<br />\nstart. The Black and Blue did well in all their kicks and punts, but showed an<br />\nalarming tendency to tackle high, thus allowing their opponents to gain more<br />\nground than they should have. This is mainly on account of the practice in the<br />\nCage, where low tackling would probably produce disastrous results with such<br />\nnarrow space between the walls. Our fellows were at first rather ineffective at<br />\nbreaking the opposing interference, but in the second half they did better; and<br />\nthe line held together wonderfully well against superior weight. The rooting<br />\nof Gallaudet was in itself a feature of the game. Actions speak louder than<br />\nwords. The line up was as follows:<br />\nGALLAUDET.<br /><br />\nHOPKINS.<br /><br />\n1 e.<br />\nGillespie<br />\nWhipple, Straus......I.t.<br />\n1. g<br />\nErlanger<br />\nC.<br />\nCampbell<br />\nr. g.<br />\nYearly<br />\nr. t<br />\nFerris<br />\nr. e.<br />\nHoughton<br />\nq•<br />\nBernheim<br />\n1. h. b.<br />\nSharretts<br />\nr. h. b.<br />\nSayler<br />\nf. b. .<br />\nPlaggemeyer.<br /><br />\nGeilfuss<br />\nMcDonough<br />\nHewetson<br />\nWorley<br />\nLawrence<br />\nNeesam<br />\nEscherick<br />\nPhelps<br />\nErickson<br />\nA ndree<br />\nWaters<br /><br />\nReferee—Watson. Umpire—Edell.<br />\nTimers— Blanck and Rooson. Linesmen—Pearre and Strong.<br />\nTwenty minute halves.<br />\nHAVERFORD, 5; HOPKINS, 0<br />\nT would have done every rooter's heart good to have seen the great game<br />\nwhich Hopkins put up against Haverford College last Saturday. A pretty<br />\nindividual play in the shape of a goal from the field was the sole thing<br />\nBlack<br />\nwhich gives Haverford the right to say that she defeated Hopkins. The<br />\nend<br />\nand<br />\nplunges<br />\nline<br />\nthe<br />\nand<br />\ncontest,<br />\nand Blue were aggressive throughout the<br />\nvoice<br />\nhis<br />\nlose<br />\nto<br />\nrooter<br />\nevery<br />\ncaused<br />\nruns made by Sayler, Faris, and Blanck<br />\nbefore the end of the game. Hopkins kicked off at the start, and her line showed<br />\nwhat stuff was in it by forcing Haverford to punt after the second scrimmage.<br />\nTowards the end of the half, we rushed the ball down the field by fast, snappy<br />\nwork. The 5 yard line, then the 4, and then the 3 yard line was reached.<br />\nA touchdown seemed inevitable, and our little band of rooters nearly went wild<br />\nwith delight. It was then that we realized that our foe was not to be despised.<br />\nFaris,<br />\nLike a drowning man grasping at a straw, Haverford braced, and after<br /><br />\n3<br /><br />\n1Z<br /><br />\nTHE NEWS—LETTER.<br /><br />\nSayler, and Blanck smashed the line only to stick, the ball went over to Haverford on downs. The oval had been worked along to that point for a distance of<br />\n65 yards only through the greatest determination and effort by every man, and<br />\nthen to lose it when almost on the goal line—it did, indeed, seem mighty hard<br />\nluck. Haverford punted out of danger immediately, and a moment later the<br />\nfirst half ended.<br />\nAccording to a statement made by one of Haverford's men, she fully expected to pile up a score of about 25 points on \"Johnny Hopkins.\" They were<br />\nclearly outplayed in the first half, and only by a heroic effort at the last moment<br />\ndid they prevent Hopkins from scoring. To say that they were both surprised<br />\nand piqued would be stating the case very mildly.<br />\nIn the second half Haverford started in with a grand rush, but Hopkins<br />\ncontinued to be strictly in the game, and almost invariably the home team was<br />\nforced to punt for fear of losing the ball on downs. After twelve minutes play,<br />\nHaverford's end runs and line rushes seemed to be more effective, and the ball<br />\nwas advanced to Hopkins 15 yards, which was the nearest she ever got to our<br />\ngoal line. Then \"Johnny\" realized that something must be done, and in the<br />\nnext scrimmage Faris took a kindly hold on the back of the runner's jersey and<br />\nsnatched him back for just eight yards. The band of Haverford rooters, 250<br />\nstrong, sent up a deafening yell of encouragement to their team, and the little<br />\nhand of Hopkins enthusiasts, six strong, piped out a feeble \"Hullabaloo.\"<br />\nTheir voices were a little the worse for wear by that time. Captain Grant saw<br />\nplainly that he could never carry the ball over Hopkins' goal line, and he<br />\nordered the next best thing. Drinker dropped back to the 30 yard line, and a<br />\nmoment later received a pretty pass in just the proper place. The ball dropped,<br />\nand, as it touched the ground, his toe caught it, and between the posts she<br />\ntwirled, giving Haverford five points and the game. Hopkins never lost heart,<br />\nand a few minutes before the end of the half, she again had the ball on Haverford's 15 yard line. Another reverse of fortune came, however, and she lost the<br />\noval on downs.<br />\nIn such a battle royal it is difficult to ascribe special honors to any one man.<br />\nEvery player deserves a hearty slap on the back, and the exclamation, \"pretty<br />\nwork, great work, old man!\" Captain Gillespie was naturally disappointed<br />\nafter such a hard fight, hut both he and Coach Dickson agree in saying that the<br />\nteam played a truly great game. Next Saturday, Delaware College is to he<br />\nplayed at Wilmington. We are going up to win, and we want a big band of<br />\nrooters to see us do it. The teams played as follows:<br />\nHOPK INS.<br /><br />\nGilllespie (captain)<br />\nHill<br />\nGarwood<br />\nCampbell<br />\nYearley<br />\nBacon<br />\nHoughton<br />\nBernheim<br />\nFaris<br />\nSayler<br /><br />\nHAVP:RFORD.<br /><br />\n1. e.<br />\n1. t<br />\n1. g.<br />\nc<br />\nr, g<br />\nr t<br />\nr. e<br />\nj. b<br />\n1. h. b<br />\nr h h.<br /><br />\nHaviland, Scattergood<br />\nWorthington<br />\nSpiers<br />\nRoss<br />\nSimkin<br />\nBausman<br />\n(captain) Grant<br />\nPhillips<br />\nDrinker<br />\n..<br />\nThorne<br />\nJones<br />\nReferee—A. Scattergood, Haverford. Umpire—J. H. Gillender, U. of Pa.<br />\nLinesmen—Weil, J. H. U.; Perkins, Haverford<br />\nTimers—W. B. Hill, J. H. U., C. C. Morris, Haverford.<br />\nTime—Twenty and twenty-five minute halves.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\nLEC TURES.<br /><br />\nt<br /><br />\nHE courses of lectures in science and literature, designed primarily for pub<br />\nlic school teachers, began on Saturday of last week.<br /><br />\nORIENTAL SEMINARY,—Dr. Foote will give a course of lectures on the<br />\n\"Literature of the Old Testament,\" based on the English Bible. Dr. Haupt<br />\nwill deliver,the introductory lecture, on \"How we got our Bible,\" in the Dillman Room, Wednesday, at 5 o'clock.<br />\nThe lectures on Public Speaking, given by Mr. S. A. King, M. A., of the<br />\nUniversity of London, will be continued on November 6, 11, 15, and 18, at 5<br />\no'clock, in McCoy Hall. Mr. King's first lecture was given Monday.<br />\nOn Wednesday, the 6th, Dr. Jeffrey R. Brackett, president of the City Supervisors of Charities, will begin a course of lectures on \"The Development of<br />\nLegislation and Custom Touching Charity and Correction in the United States<br />\nand England.\" The lectures will be held in Levering Hall.<br />\nY. M. C. A. NOTES.<br />\nHE courses in Bible Study are in full progress. A class for graduate students meets every Saturday morning at 8.30 to consider special topics selected by the committee in charge, which consists of Mr. D. B. Easter, L.<br />\nG. Barret, F. H. Getman. Enrollment, 24. A course for Seniors in the \"Acts<br />\nand Epistles,\" led by Mr. J. Gresham Machen, meets at 1 P. M. Wednesdays,<br />\nand has an enrollment of 6. The Junior class is under the leadership of Mr.<br />\nHorace C. Gillespie, and numbers 7, meeting at firesent at 8.30 A. M., Wednesdays, to consider the same topics followed by the Seniors. This duplication of<br />\nthe courses results from the fact that there was no Junior Bible class last year.<br />\nThe Freshman Bible class is in two groups, on account of conflict of hours:<br />\none, led by C. K. Edmunds, meets Thursdays at 10 A. M.; the other, led by R.<br />\nS. Licking, meets Thursdays at noon. The enrollment in these two groups is<br />\n9, and Sharman's \"Life of Christ\" is used.<br />\nThe regular weekly devotional meeting on Tuesday, Oct. 28, was led by<br />\nMr. Don 0. Shelton, International Secretary, who gave a very stimulating Bible<br />\nreading in Phillipians.<br />\nMr. A. B. Williams, Jr.,(Yale), Intercollegiate Secretary for the East, addressed the meeting on Tuesday, Nov. 3, and was also present at a conference<br />\nof workers Tuesday night at the home of the General Secretary.<br />\nThe Mission Study class numbers 9, meeting every other Sunday afternoon<br />\nat 3.30. Under the direction of Dr. Ballagh, it is proving exceedingly interesting and helpful.<br />\nThe week beginning Sunday, November 10, will be observed in common<br />\nwith all religious bodies throughout the country as a \"Week of Prayer.\" There<br />\nwill be a meeting Sunday afternoon at 4.30, and every day during the week<br /><br />\n14<br /><br />\nTHE NEWS—LETTER.<br /><br />\nthere will be short talks by members of the Faculty from 1-1.30. It is hoped<br />\nthat every man will avail himself of these privileges.<br />\nThe regular monthly meeting of the Executive Council will occur Tuesday.<br />\nNov. 12 at 5.30, in the Committee Room.<br />\nDr. E. C. Armstrong is conducting morning prayers this week.<br /><br />\nAMONG THE COLLEGES.<br />\nII 1:4, lacrosse team of City College of New York, which was beaten by Hopkins last year, is out for practice.<br /><br />\nZ<br /><br />\nThe number of students registered at Harvard this year is 4043.<br />\nMore young men are studying medicine than are studying law and theology<br />\ncombined.<br />\nPrinceton has recently been presented with $100,000 for the erection of a new<br />\ndormitory.<br />\nThe Freshman Class at Harvard numbers 553, and at Princeton the entering<br />\nclass has 400 members. In both of these institutions these numbers surpass all<br />\nprevious records.<br />\nAt the McMaster University games A. E. Haydon broke the Canadian Col<br />\nlege record for the pole vault by clearing 9 feet 11 inches.<br />\nThe oratorical cpntest for the Founder's medal at Vanderbilt University<br />\nwas won by a Chinaman His subject was: \"The Miracle of ' the Twentieth<br />\nCentury\"—the regeneration of China.<br />\nThe Athletic Association of the University of Colorado has constructed a<br />\nfine athletic field 684x242 feet, with a quarter mile track, a grand stand for one<br />\nthousand spectators, bath rooms for athletes—all at the foot of a beautiful<br />\nmountain.<br />\nThe University of Pennsylvania has taken the preliminary steps necessary<br />\nfor the erection of a new medical laboratory, which in point of completeness and<br />\nequipment, it is claimed, will be in advance of any similar building now in existence in this country or in Europe.<br /><br />\nFRESHMAN PRIMER.<br />\nAFTER EUGENE FIELD, WITH APOLOGIES.<br />\nLESSON V.<br />\nThis boy looks Worried. Worry really did strike him. He put a thick<br />\nCoat of White Paint on his Papa's new Patent Leather Slippers. That Worried<br />\nPapa, who Rid himself of the Worry by handing it to Willie. Wonder why<br />\nWillie eats his meals from the sideboard now? How excrutiatingly peculiar.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n15<br /><br />\nLESSON yr.<br /><br />\nSee the Parrot in his Cage, children! Isn't he just beautiful? Put your<br />\nlittle Fist into the Cage, Johnnie, and try to Pull a feather from his Tail. Don't<br />\nscream so frightfully, my Boy: Polly only wanted to Show his Teeth. There,<br />\nthere, stop crying, and I will give you a Chaw of Gum. When you have finished<br />\nchewing it, Send it to the Dog for a while, and then Susie will be glad to Chew<br />\nit for three Days. Now isn't that lovely?<br />\nEXCHANGES.<br />\nA few from the Cornell Wthow.<br />\nA QUERY.<br /><br />\nIf you and I—Yes, every man,<br />\nWere built upon the Darwin plan,<br />\nDo you suppose the Does would slight us,<br />\n'Cause we couldn't have appendicitis?<br />\nFor centuries old<br />\nThe wise guys have told<br />\nThat a bird in the hand is worth two in the bush,<br />\nBut all will agree, whom the truth has not missed<br />\nThat a thorn in the bush is worth two in the fist.<br />\n\"Well I'll be switched\" the engine said,<br />\nTo the head-light o'er the fender,<br />\n\"No wonder that coal's so gel darned soft,<br />\nWhen they bring it from the Tender.\"<br />\n'02.—These chestnuts are full of worms.\"<br />\n'03.—Yes, its a case where the early burred catches the worm.<br />\nFirst Old Grad.—When are you going to send your son up here?<br />\nSecond Old Grad.-0! not for some time yet,—there are some things to be<br />\nforgotten in this town before he comes.\"<br />\nMOODS.<br /><br />\nAs the dewdrops glisten and glint and glint,<br />\nIn the shafts of the light from the eastern hills,<br />\nAnd the air is laden with clover and mint,<br />\nWafted from fields where the mockbird<br />\nWhere the mockbird warbles and trills and trills,<br />\nMy heart is elate with the morn, and thrills<br />\nAll a-quiver with hope and joy without stint,<br />\nAs the dewdrops glisten and glisten and glint.<br />\nAs the long day lengthens and lingers and lasts,<br />\nAnd the parched earth throbs in the quivering heat,<br />\nAnd the breezes of morn change to withering blasts,<br />\nHurling columns of dust down the deserted street,<br />\nMy soul becomes weary with worry and work,<br />\nMy hands become weary; each duty I shirk.<br />\nAs the fireflies glitter and glimmer and glare,<br />\nIn the soft, sweet calm of the twilight air.<br />\nAnd the whippoorwill calls from its woodland lair,<br />\nSending its plaintiveness everywhere,<br />\nMy soul is freed from its burden of care,<br />\nAs the fireflies glitter and glitter and glare.<br />\n—Unit, of Minn. Magazine.<br /><br />\n16<br /><br />\nTHE NEWS-LETTER.<br /><br />\nA writer in the University of Minnesota Magazine in a philosophical mood,<br />\ngives us the following definition of what college spirit is not. In this is some<br />\ngood food for reflection; so we print it entire—without criticism.<br />\nMuch has been said about college spirit. To say exactly of what it consists is hard, but I am told by authorities that it does not consist:<br />\n1. In promiscuous yelling,—except when in the interest of the college<br />\nteam or organization.<br />\n2. In whistling the fool's march. This march must have taken its name<br />\nfrom the whistler.<br />\n3. In an over indulgence of the faculty of politics to the detriment of<br />\nathletics and other student enterprises,<br />\n4. In getting \"boozy\" and \"tearing things up.\"<br />\n5. In forever criticising faculty regulations and using no means but gas<br />\nand around-the-corner-mouthings to get them changed.<br />\n6. In talking always about the faults of the institution and never men tioning the good points. No college is perfect; if there were one such, Emerson, Hawthorne, Dana and Curtis would want to come to life so as to live in<br />\nthe new \"Brook-Farm\"—without the farm work.<br />\n7. In filling the heads of the Freshmen with nonsense about the peculiarities of the professors.<br />\n8. In being more loyal to a particular faction than to your alma mater.<br />\n9. In supporting society so called, dances and blind tigers, to the exclusion of athletics, literary societies and college publications. The amount spent<br />\nby one man at a single dance will pay dues in the Athletic Association and subscribe for all the publications.<br /><br />\nThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\nN. E. Cor. Charles and Fayette Sts-,<br /><br />\nPhone,C.&amp; P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br /><br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nW. D. BOW EN, M. D., D. 0.,<br /><br />\nWedding Silver Nit:\"<br />\nIN GREAT VARIETY.<br /><br />\n.5* diENKIN8,<br />\n2te N. CHARLES BT.<br /><br />\nSilversmiths.<br /><br />\nhenderson's<br /><br />\n_<br /><br />\nesiC<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books. Note Books,<br />\nMadison &amp; Howard Sts.<br />\napplies.<br /><br />\nAgent for Lincoln &amp; Bennett and<br />\nWalter Barriard's London Hats.<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nSilk and Casalmere Hats. Or HOPKINS CAPS<br /><br />\ncusHING &amp; COMPANY,<br /><br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nII. R. EISENBRANDT SONS,<br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n201-203 N. CHARLES ST.<br />\nBALTIMORE, MD.<br />\nCharles T. Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br /><br />\nBALTIMORE, MD.<br /><br />\nOtto H. Williams,<br />\nVice-President.<br />\nJ. E. Marshall, Asst, Cashier,<br /><br />\nFARMERS &amp; MERCHANTS NAT'L. BANK,<br /><br />\nTO<br /><br />\nLIGHT AND LOM BARD STREETS,<br /><br />\nBoos.<br /><br />\nKeeps constantly on hand the Text Books used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br /><br />\nas follows: Samples submitted of<br />\nFrench Itrandy—no adulterants, no coloring,fine quality.<br />\nOporto Port—absolutely pure, of a perior quality.<br />\n.herrY-00<br />\n14<br />\ncoloring or adulterants. absolutely pure wine.<br />\nar.<br />\n.iciy:ld%.Vhiskiiy—<br />\nno Fusel oil, no caramel. strictly pure<br /><br />\nPEARRE E. CROWL COMPANY,<br />\nPUBLISHERS.<br /><br />\nBooliseliers and<br />\nStational,.<br /><br />\n34 W. BALTIMORE ST.<br />\nSCHOOL, Law MaDIOAL CLA••ICAL AND MiliCIILLANICOLA<br /><br />\nJORDAN<br />\nSTRBLER GO. migl,W°215VE.<br />\nReads<br /><br />\nFOR ADVERTISING SPACE IN THIS PAPER<br /><br />\nR<br /><br />\nUMBRELLAS, HATTERS, CANES; ETC.<br /><br />\nfor<br /><br />\nOlive 011—all tests show pure olive oil.<br />\nst41;01ndge.r Vinegar—natural cider vinegar, strictly pure and<br />\nSix Ground Spleen<br />\n-no adulteration, all strictly pure.<br /><br />\nJANIKS R. PA INK<br /><br />\nV1<br />\n/<br />\n47AR<br /><br />\nCertificate of Analysis from<br />\nPeofs. G. W. Lehman It Son,<br /><br />\nAPPLY<br /><br />\nH. WARMS,D.0.,<br />\nBeo'y. &amp; Treas.<br /><br />\nTHKO. WARRICK.<br /><br />\nESTABLISHED 1079.<br /><br />\nJACOBI<br /><br />\nMARIA BUIE, D. 0.,<br />\nV.-Prest. &amp; Asst. See'y.<br /><br />\nSouth and Lombard Sts., Baltimore.<br />\nCapital, $660,000<br />\nSurplus amd Profits $450,000.<br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended lii accordance with<br />\nbalances and business responsibility.<br />\nCOILECTIONS A SPECIAL I Y.<br />\nCORRESPONDENCE INVITED.<br /><br />\nNom GERMAN LLOYD S. S. CO.<br /><br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS. GIBRALTER,<br /><br />\nCABIN PASSAGE AT LOW RATES.<br /><br />\nNAPLES. GENOA, ETC.<br /><br />\n) A. SCHUMACHER &amp;<br />\n(iPnoral A gouts.<br /><br />\nBALTIMORE TO BREMEN<br /><br />\nFor particulars apply to<br /><br />\nCO.,<br /><br />\nDIRECT.<br /><br />\nMANDOLIN. GUITAR AND BANJO Je<br />\ni<br /><br />\n41<br /><br />\n40.641r ,C111<br /><br />\nC. .T.<br />\nwho has made a life study of those nstruments. Mandolin Soloist of.National,reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br /><br />\nStBdiO, 331 N. Charles St.<br /><br />\nfigenithz Studio<br />\nSuccessor to Cummins<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br /><br />\nBaltimore<br /><br />\nSMITH'S\"11417T8`BZIcik.\"K<br />\nOLD<br />\nBOOK<br />\n8053N<br />\nr(i(1:<br />\n11007<br />\n0 frA<br />\noR<br />\nmD STREET<br />\n3rd<br />\nSTORE.<br />\nthe Itran3•Smith piano CO.<br /><br />\nSpecial Discount to Students<br /><br />\n109 and 111 North Charles Street.<br /><br />\nTHE BLAKE<br />\nCO<br /><br />\nHABERDASHERS,<br />\nE.thldiretsr,w<br />\nH<br />\nkw<br />\noszarr,y,<br />\nUnderwear,<br />\nEtc.<br /><br />\nSOLE AGENTS<br /><br />\nCbtcherino, igrabburp anb IllebOter<br /><br />\nON SALE THE J. H. U. PENNANTS,<br /><br />\nJ1 so 'pianos.<br /><br />\narid all other College Pentiailts<br /><br />\n203W. BALTIMORE ST. &amp; 2 S. LIBERTY ST.<br />\nBALTIMORE, MD.<br />\nClitcn P. Paine<br />\nGordon P. Paine<br /><br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange<br />\nChicago Board of Trade<br /><br />\nCLINTON P. PAINE &amp; CO.,<br />\nBANKERS ct BROKERS<br />\nPrivate Wires to<br /><br />\nNew York and Chicago<br /><br />\n217 E. German Street<br />\nBALTIMORE, MD.<br /><br />\nThe Chas. Willms SurRical Instrument Company<br />\nBENJ. A. NELSON, GEN'L MANAGER<br /><br />\nPhysicians,' Burgeons,' Hospital and Invalid Supplies.<br />\nPine Microscopes and Accessories.<br /><br />\n300 N. Howard St.,<br /><br />\nBaltimore, Md.<br /><br />\nDrovers and Mechanics National Bank,<br />\nOF BALTIMORE, MD.<br />\nCapital StOCk, $300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br /><br />\n0. &amp; P.'Phone 2322-2.<br /><br />\nBOOKS<br /><br />\nFactory Prices.<br /><br />\nOLD AND NEW<br /><br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City<br />\nBooks Bought, Sold and Exchanged<br />\nWM. V. PIPPEN,<br /><br />\n605 N. Eutaw Street.<br /><br />\nJ. Wm. Middendorf,<br /><br />\nA. ii Rutherfoord.<br />\nF. Lentz.<br /><br />\nA. J. Robbins.<br /><br />\nJ. WM. MIDDENDORF &amp; CO.<br />\nBankers &amp;113rokers.<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nMembers<br />\nBaltimore Stock Exchange.<br /><br />\nBaltimore, Md,<br /><br />\nB. G. ElCHELBERGER,<br />\nBOOKS AND STATIONBRY<br />\nENGRAVING AND STAMPING.<br />\n31)t4<br /><br />\n-tix<br />\nr-leams<br />\nY. M. C. A. BUILDING,<br /><br />\nC. &amp; P. and Md.'Phones.<br /><br />\nYOUR<br />\n'<br /><br />\nARE<br />\niiE Y()<br />\nEU<br />\nREBB<br />\nLI<br />\n,<br />\n)<br />\nVE<br />\nIA<br />\nNO<br />\nD<br />\nEYLS<br />\nTHAN BLIND.<br /><br />\n291 North Charles Street. (Masonic Temple.)<br /><br />\nEX/'MINING OPTICIRAS.<br />\nTHE NEWS LETTER<br />\n- -- is from the Pres; of<br /><br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br /><br />\nLight and Lombard Streets,<br /><br />\nBALTIMORE<br /><br />\nWe carry a fuilline of Students' Note Books and Stationery<br /><br />\nBoth 'Phones.<br /><br />\nBALTIMORE, MD.<br /><br />\nJR'S.<br /><br />\nIt DOWNS<br /><br />\n229 N. Charles St.,<br /><br />\nTHINK IT OVER.<br /><br />\nSAYRE OPTICAL COMPANY,<br /><br />\n•<br /><br />\nctill. ON<br /><br />\nett..<br /><br />\nT<br /><br />\nMA•ONICI TEMPLE.<br /><br />\nFOR Class, Fraternity and College Stationery,<br />\nBanquet Cards, invitation, Diplomas,<br />\nPrograms, Visiting Cards, etc<br /><br />\nOur 50e J. ft. U. Blue and Black Nag Paper—now ready<br />\nThere is very little entertainment at home without a Plano<br /><br />\ncT<br />\niE<br />\nFF<br />\n/pIANo<br /><br />\nfire The Best.<br /><br />\ns<br /><br />\n9 N. Libertu St.<br /><br />"}], "field_media_file": [{"target_id": 36203, "display": null, "description": null, "target_type": "file", "target_uuid": "f8fa9d17-03be-4ade-a3c6-df48743c1b00", "url": "http://digital.library.jhu.edu/system/files/2022-03/12186-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12186, "target_type": "node", "target_uuid": "a11c7f56-0ea5-4927-8c7c-808b83381d48", "url": "/node/12186"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "8c5de575-8272-4ce2-b1b9-5f63726ec593"}]}