{"mid": [{"value": 37587}], "uuid": [{"value": "7b72bbc7-44f2-4c73-ab9b-284a00908dbb"}], "vid": [{"value": 37587}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:35:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12155-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:35:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:35:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "PARKS IS ELECTED<br />\nHULLABALOO EDITOR<br />\nBanquet Held By Juniors A<br />\nSouthern<br />\nATTENDANCE IS SMALL<br />\nDean Berry And Hambleton<br />\nAre Present<br />\n• Once again we come to that time<br />\nof the year which is known as the<br />\nbanquet season. The Juniors formally opened the season last Thursday night, by holding their banquet<br />\nat the Southern Hotel. This occasion<br />\nwas quite different from the one<br />\nthat they held last year at the \"KitKat\". Due to its formality and<br />\ntameness (compared to the '29 banquet) it was called a \"gentleman's\"<br />\nbanquet.<br />\n<br />\nTENTATIVE SCHEDULE<br />\nFOR EXAMS APPEARS<br />\nA tentative examination<br />\nschedule appeared last week<br />\nand copies can be found<br />\nposted on all the bulletin<br />\nboards. All students are expected to examine these sheets<br />\nfor any conflicts which might<br />\nbe caused in their schedules<br />\nand to report these to the Registrar's Office.<br />\nThis must be done immediately so that the office will be<br />\nable to do away with all the<br />\nconflicts and issue a complete<br />\nand final schedule. It is expected that these will appear<br />\non the scene some time during<br />\nthe latter portion of this week.<br />\n<br />\nLIBERAL CLUB HEARS<br />\nSTEPHEN PODRABSZKY<br />\n<br />\nBanquet Is Success<br />\n<br />\nThe arrangements, which were<br />\nmade by Belmont Towbin and his<br />\nassistants, went off smoothly and the<br />\naffair, was termed a great success.<br />\nIt is true that the class didn't turn<br />\nout in as large numbers as had been<br />\nhoped for, but those present enjoyed the funny anecdotes and<br />\nstories told by Dave Kaukman, who<br />\nacted as toastmaster and the<br />\nspeeches of the other guests.<br />\nAmong the distinguished guests<br />\nwho were present were Dean Edward W. Berry and Waldo Hambleton, the coach of the Blue Jay<br />\ntrack team.<br />\n<br />\nPrice 5 Cents<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 6, 1930<br />\n<br />\nVOL. XXXIV, No. 48<br />\n<br />\nPost-War Hungary Is Subject<br />\nOf Talk<br />\nIS BUDAPEST U GRAD<br />\nCites Economic And Social<br />\nProblems Of Hungary<br />\n<br />\nONE PHILOSOPHY PROFESSOR SNARED;<br />\nSOPHOMORES MOOR FROSH TO POLE<br />\nThis isn't about spring. This<br />\ndoesn't tell how the grass of the C.<br />\nE. Building is greener than it was<br />\nlast year. This doesn't tell how the<br />\naustere Professor of Monotony<br />\nstops to smell a rose. This doesn't<br />\ntell how the dulcet tones of the<br />\ntower clock reberbrate in the swaying trees in back of the Y. M. C. A.<br />\nbuilding.<br />\n<br />\nbody who may have been somebody<br />\nbut who wasn't, placed a match box<br />\non a philosophy professor's pulpit.<br />\nThe philosophy professor saw the<br />\nmatch box. Although he knew that<br />\npremises sometimes aren't premises,<br />\nhe didn't know that match boxes<br />\nsometimes aren't match boxes.<br />\nSo he picked up the match box,<br />\nnot knowing that match boxes sometimes aren't match boxes. And surprisingly, the match box wasn't a<br />\nmatch box. It was something that<br />\nsnapped. It snapped the philosophy<br />\nprofessor's finger. Then he knew it<br />\nwas a match box that wasn't a match<br />\nbox. He was caught. But philosophy<br />\nprofessors don't like to be caught.<br />\nThey like to catch. So he picked out<br />\na premise that wasn't a premise—<br />\nand another hour of philosophy was<br />\n<br />\nNo, it is doubtful if it were good<br />\nto be in Hopkins now that spring is<br />\nhere. In fact the grass of the C. E.<br />\nBuilding isn't as green as it was last<br />\nyear. Nor do professors of Monotony stop to smell roses. Nor does<br />\nthe tower clock make anything except noise. And anything, behind<br />\nthe Y. M. C. A. building, whether<br />\nit be a group of swaying trees or<br />\nnot, cannot lay claims to the<br />\naesthetic.<br />\non its way.<br />\nThis tells how a college slicker<br />\nSophomores are devilish. They<br />\nsnared one philosophy professor. anticipated the banquet season. To<br />\nThis tells how some devilish sopho- anticipate the banquet season means<br />\nmores in a devilish mood made a to jostle a freshman. So some sophfreshman meditate for several hours omores jostled a freshman and a<br />\nwhile his hands were somewhat ocfreshman tried not to be jostled.<br />\ncupied with a chain. The chain, in<br />\n(as they say in<br />\ncidentally, embraced one of the ten- When all was still<br />\nthe story books) one freshman was<br />\nnis court light poles.<br />\nmoored to the light pole. Other<br />\nPhilosophy professors are profreshmen came. So did some men.<br />\nfessors who catch people. They<br />\nall the men<br />\ncatch them when they are unaware But all the frosh and<br />\nthat something doesn't mean some- couldn't untie the freshman again.<br />\nthing, but something else. They And so he stayed and stayed and<br />\ncatch them when a premise isn't a stayed.<br />\npremise but another kind of premise. This isn't or wasn't about spring<br />\nThey catch them frequently asleep. —give thanks.<br />\nProfessors of philosophy like to<br />\nN. D. W.<br />\ncatch but not be caught. So some-<br />\n<br />\nFRATERNITIES HOLD<br />\nBRIDGE TOURNAMENT<br />\nContinuing a policy which<br />\nwas started a few years ago<br />\nand which has become a custom among the Hopkins fraternities, an interfraternity<br />\nbridge tournament is now being held. The contest started<br />\nlast week and will continue<br />\nfor a few weeks more.<br />\nAs yet only a few of the<br />\ngames have been played. The<br />\nA. T. 0. contingent defeated<br />\nthe bridge fiends from the<br />\nKappa Sigma fraternity and<br />\nare scheduled next to meet the<br />\nD. U. players. The Alpha Mu<br />\nTau fraternity was defeated<br />\nby the Sigma Tau Deltas.<br />\n<br />\nJAYS TROUNCE<br />\nARMY TWELVE<br />\nSmooth Running Attack Scores<br />\n11-5 Victory Over Cadets<br />\nWATERS IS ARMY STAR<br />\nArmy Band Gives Concert Following Game<br />\n<br />\nFlashing an attack that functione<br />\nlike clock-work and a defense •that<br />\nproved to be almost impregnable,<br />\nthe Blue Jays, last Saturday, piled<br />\nup a total of 11 points against the<br />\nstrong Army twelve to win by a<br />\nscore of 11 to 5. The Cadets played<br />\na mighty fine game and kept stride<br />\nwith the Jays all during the first<br />\nhalf, scoring a goal for every one<br />\nmade by the Jays. It was almost a<br />\ntit for tat affair during the first part<br />\nof the game, but in the second hall<br />\nthe Hopkins twelve, in a whirlwirk<br />\nof attacks, scored six goals to<br />\nBlue Jays Show Marked Su- Army's one.<br />\nJays Score<br />\nperiority<br />\nHopkins got the face off and immediately started bombarding JohnHOPKINS SWEEPS SINGLES<br />\nny Waters, the Army goal tender,<br />\nArmy<br />\nGoldberg And Helmholtz Eas- but with no success at first.<br />\nsoon got possession of the ball and<br />\nily Take Double Victories<br />\nshifted to attack. However, they,<br />\nwere unsuccessful.<br />\ntoo,<br />\nThe Hopkins tennis team<br />\nin possession of. the ball<br />\nWhen<br />\nstretched its winning streak to three<br />\nagain, Jack Turnbull, after running<br />\nstraight Friday afternoon by de- around the goal and eluding three<br />\nfeating Delaware, 5 to 0. The Dela- defense men, put a hard shot past<br />\nware team was completely outclassed Waters. Army soon tied the score<br />\nin every match but the second dou- on a nice shot from Clark, the secbles, which was called because of ond attack.<br />\nThe Jays took the lead again when<br />\nrain. The weather was ideal during<br />\nPackard carried the ball down the<br />\nthe singles matches, but the wind middle, feinted a shot, but passed<br />\ngrew stronger toward the finish and instead to Dukehart on the crease<br />\n<br />\nHOPKINS MEN DEFEAT<br />\nDELAWARE NETMEN 5-0<br />\n<br />\nThe economic and social condition<br />\nof Hungary following the cataclysmic upheaval occasioned by the<br />\ngreat war was the topic of discussion, led by Stephen Podrabsz.ky, at<br />\nthe ineeting the Johns Hopkins Liberal Club held last Friday. Mr.<br />\nBerry Speaks<br />\nPodrabszky conducted the discusIn his speech, which was short sion capably, flavoring it continuand straight to the point, the Dean ally with the spice and idioms of his<br />\nInterfraternity Net<br />\nspoke of the pleasure he derived native tongue. He is a graduate of Nominations For S. C.<br />\nthe flurries of sand were a hindrance who flipped the ball into the net.<br />\nPlanned<br />\nTournaments<br />\nfrom being present and said he enThursday<br />\nMade<br />\nTo Be<br />\n'<br />\nWarren knotted the count again<br />\nto steady playing.<br />\nthe University of Budapest, in HunThe interfraternity tennis tourjoyed being among the young men<br />\nThis Thursday's assembly will<br />\nArmy on a pass from Lehrfeld.<br />\nfor<br />\nHerman Goldberg sent the Blue<br />\nof the Hungarian<br />\nand entering into their play with gary; as the head<br />\nbe short but the business to be nament will take place some time<br />\nGuild and Packard scored in close<br />\nthem. He related a few laughable Students Foreign Office he is the transacted will be very important. this week as soon as the details of team off to a good start when he succession to put the Jays two poinfs<br />\nincidents which set the gathering in representative of the Hungarian stu- All members of the four under- the match are arranged. This tour- defeated his opponent, love and love, in the lead. Not to be outdone,<br />\na general uproar of laughter.<br />\ndent body in the International Stu- graduate classes are urged to be nament is something new in cam- in a match lasting twenty-five min- Brady and O'Keefe scored, and tied<br />\nstarted last utes. Klund, Delaware No. 1, ral- the count again. On a pass from<br />\nHambleton Called On<br />\ndents' Conference. At present he is present. This meeting has been set pus activities. It was<br />\nCoach Hambleton said that when<br />\nsuccess and<br />\ngreat<br />\nyear and met with<br />\nwork in politi- aside for the express purpose of<br />\nlied in the first, fifth, ninth, and Turnbull, who was behind the goal<br />\nhe had been a student in the Uni- engaged in graduate<br />\nnominating men for the Presidency approval. Already it has initiated<br />\nTriplett scored Hopkins' fifth goal.<br />\nversity he had gone out for track. cal economy under the tutelage of of the Student Council for next a spirit of friendly sportsmanship tenth games to amass a total of The half ended with the score 5 to 4.<br />\nHe had always hoped to be a high Dr. Hollander at the Johns Hopkins year, an office which is highly into the midst of the fraternity seven points. Wifth these excepArmy's Last Threat<br />\njumper; but, due to the fact that he University; his chief interest lies in cherished and greatly sought for group.<br />\ntions, he was practically helpless.<br />\nIn the second half, Army came<br />\nhad not been built for such work, the study of monetary theories and by all men. The Presidency of the<br />\nThe pairs for the matches have<br />\nIt was only a question of time in out determined to tie the count.<br />\nhe was compelled to do the next<br />\nas<br />\nare<br />\nThey<br />\npicked.<br />\nbeen<br />\nalready<br />\nhighest<br />\nthe<br />\nproblems of international financial organization is one of<br />\nthe second singles, before Captain Darcy took a long shot which was<br />\nbest thing and took up the throwing<br />\nfollows:<br />\nscreened by the homes and scored<br />\nin<br />\nhold<br />\nhis<br />\noffices that a man can<br />\nrelations.<br />\nHelmholtz disposed of Captain Tayof weights. \"Now,\" h said, \"I<br />\nUpDelta<br />\nTau<br />\nvs.<br />\nAlpha<br />\nOmega<br />\nArmy's last goal. Then the fire<br />\nsenior year.<br />\nlor, of Delaware. The J. H. U. star<br />\nam back at the University in the<br />\nHungary was related to Austria<br />\nsilon.<br />\nworks of the game began. The Jays<br />\nPurnell Hall, the retiring- Presicapacity of a coach, trying to tell on a close personal basis immediateBeta Theta Pi vs. Alpha Mu Tau. quickly showed his class and won opened up a lightning speed attack<br />\nthe boys how to run.\"<br />\nKappa Alpha vs. Alpha Kappa 6-2, 6-4. The match was not as which kept the Cadet defense guessly preceding the war; the Prime dent, wishes to announce that this<br />\nThe banquet which started Minister of Hungary was strongly will be the only nomination held Phi.<br />\ning as to what would happen next.<br />\nclose as the score indicates.<br />\npromptly at 7.30 did not drag and disfavorable to war, and exerted Thursday. No delegates will be<br />\nAlpha Delta Phi vs. Delta Phi.<br />\nIn the remaining individual Six times during the second half,<br />\nwas over before 10. Outside of the every means in his power to avoid nominated for the A. A. Board as<br />\nPhi Gamma Delta vs. Omicron<br />\nthe ball found its way past Johnny<br />\nmatches, Gump defeated Pyle, and<br />\ndifferent speeches, there was no it. The great strain caused by the in previous years, due to the recent Kappa Omicron.<br />\nWaters and came to rest in the net<br />\nadded entertainment, like there had war on the population of Hungary change in the organization of this<br />\nSigma Phi Epsilon vs. Tau Al- Bandel defeated Moran. The last in back of him. Waters played a<br />\nbeen in years past.<br />\nwas the chief reason for the dissolu- body. This body, in the future, will pha Phi.<br />\nmentioned was brilliant in streaks, heroic game at goal and turned back<br />\nbe<br />\nand<br />\ncaptains<br />\nthe<br />\nof<br />\nup<br />\nmade<br />\nPhi Kappa Psi vs. Sigma Tau but lack of steadiness caused his many well-aimed shots which the<br />\nAt the banquet, the staff of the tion of the Hungarian Army follow1931 Hullabaloo was announced. ing the war. This dissolution, and managers of the different recog- Delta and Kappa Sigma.<br />\nundoing. Bandel did well in beat- Jay attack shot at him during their<br />\nThe winners of each Match will<br />\nThe election of these men had been other aftermaths of the war, affect- nized sports, thus giving every sport<br />\nbombardment of the Army goal in<br />\nequal representation on the board. play the others until by progressive ing him.<br />\nthe second half.<br />\nheld at 12.20 the day of the ban- ed the regime of the first president<br />\nGoldberg and Helmholtz easily<br />\nSpring Elections<br />\nelimination the winning team will<br />\nFrom start to finish, the game was<br />\nquet, in the Hullabaloo office. The of the Hungarian Republic, who,<br />\nvanquished Taylor and Pyle in the full of action and marked by the<br />\nAll the elections of representatives survive.<br />\nboard of control of this year's staff, finding it impossible to reorganize<br />\nlast completed match of the day. spectacular playing of both teams.<br />\nfor the first time in the history of effectively Hungary's political and from the four classes to the Student<br />\nBoth the Hopkins men played sound Even in the latter portion of the<br />\nthe Hullabaloo, had complete con- economic status, turned over the Council will be held this spring. In<br />\nThird Cotillion Is Held<br />\nHelmholtz playing an ex- game when it was evident that only<br />\ngames,<br />\nCommunists.<br />\nThe<br />\nthe<br />\nto<br />\ngovermnent<br />\npast<br />\nyears<br />\nalelections<br />\nhave<br />\nthese<br />\ntrol of the elections. In the past<br />\nAt the Southern Hotel ceptional net game. At this time<br />\nbefailed,<br />\nsoon<br />\nregime<br />\nCommunist<br />\nbeen<br />\nthe<br />\nways<br />\nfall,<br />\na miracle could save the Cadets from<br />\nheld over until<br />\nyears the elections have been made<br />\nIn honor of the Army lacrosse<br />\nthe wind was blowing in frequent defeat, they did not give up -in disby the vote of the class at their ban- cause of public sentiment and be- but beginning with this year, all<br />\nteam which played the Jays at gusts, and, coupled with the rain,<br />\npair, but kept fighting an uphill batquet. It, was felt that this method cause.of, the economic blockade im- elections to the Student Council will<br />\nHomewood last week, the Cotillion prevented the completion of the<br />\ntle until the final whistle ended the<br />\nwas not 4.good one since too much posed upon Hungary by other Euro- be made in the spring of the year.<br />\nBoard held its third Cotillion Dance<br />\nsecond doubles match. For Hop- game.<br />\npean nations immediately after the<br />\npolitics entered into the election.<br />\nof the year last Saturday night at<br />\nkins, Selabes and Sugar were putThe team that carried the Black<br />\nIn the,.election Townsend Parks war.<br />\nthe Southern Hotel in the main ting up a<br />\nstubborn fight.<br />\nand Blue to victory last Saturday,<br />\nwas elected Editor-in-Chief and R.<br />\nDebaters<br />\nLose<br />\nFreshmen<br />\nTrere are presented today, acballroom.<br />\nMiller was elected Business Man- cording to Mr.<br />\nTo City College Team Percy Glasco and his ten-piece<br />\nIn the feature event of the was the same one that played Mt<br />\nPodrabszky, several<br />\nWashington on the 12th of April,<br />\neger. The 'remainder of the board<br />\nThe Johns Hopkins University<br />\nproblems that have arisen out of the<br />\nPlantation Band furnished the music day, seventeen sophomores succeedwith<br />\none exception. Weitzel was<br />\nof cont'rol ..fOr. next year includes<br />\nsocial and economic status of Hun- Freshman Debating team lost an in- which was peppy and very incentive e din handcuffing one freshman to<br />\nplaying<br />\nsecond defense in place of<br />\nJohn Heinierling, Managing Editor;<br />\na pole. This led to a series of<br />\ngary. The first problem met with teresting contest to the Baltimore to dancing.<br />\nNess<br />\nwho<br />\nhas been unable to play<br />\nGus Burke, Advertising Manager; by Hungary<br />\nskirmishes which were amusing to<br />\nwas to provide for the City College team last Friday afterThe dance, which began at 9 and<br />\nfor the past three weeks due to the<br />\nJames Witherall and Daniel Miller officials who had been<br />\nThe<br />\nwas<br />\nthe<br />\nin<br />\nnoon.<br />\ncontest<br />\nheld<br />\nthe<br />\nonlookers,<br />\nbut<br />\nto<br />\ndetrimental<br />\ndismissed<br />\nlasted until 2, was very well atassistant Business Managers, and from the<br />\nthe morale of the players. In the fact that he is suffering from a fracterritories cut Off from latter institution.<br />\nall<br />\nand<br />\nfrom<br />\nangles,<br />\ntended,<br />\nviewed<br />\nRobert Kyle, art editor.<br />\nfuture, it would be More consid- tured rib and a sprained knee which<br />\nHungary after the war. A second<br />\nThe topic of debate was, \"Re- was a big success.<br />\nof the spectators to observe he received during the Mt. Washerate<br />\nThe Photographic Editor was not problem was the fight *against cur- sOlved, That the United States Shall<br />\nThe gray uniforms trimmed with<br />\nington game.<br />\nnamed by this year's Board of Con- rency inflation, the stabilization of Establish Diplomatic Relations with braid and brass buttons, added a greater silence while the matches<br />\nThe line-up follows:<br />\ntrol; he will be appointed by the the currency and of the budget; un- the Soviet Russia.\" The Hopkins touch of life to the dance, and af- are in progress.<br />\nHopkins<br />\nPos.<br />\n'Army<br />\nnew Board of Control at a later der the supervision of the League team, composed of Raymond Dunn, forded a pleasant change for the eye<br />\nThe summary of the match is as<br />\nFerini<br />\nWaters<br />\nof Nations and with the aid of a Haskill Milstone, and Leo Alpert, from the sombre tuxedos of the follows:<br />\ndate.<br />\nHall . . ....P. .. ..Richardson<br />\nother male dancers.<br />\n(Continued on Page 3, Column .3)<br />\n(Continued on Page 2, Column 4)<br />\n(Continued on Page 3, Column 4)<br />\n(Continued on Page 2, Columv 4)<br />\n(Continued on. Page 4,<br />\n'<br />\n<br />\n'<br />\n<br />\n;'•<br />\n<br />\nColumn 3)<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MAY 6, 1930<br />\n(Continued front Page 1, Column 2)<br />\n<br />\nTHEDIESHOPKINS111WKETTE<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWS<br />\n<br />\nFOUNDED 1897<br />\n<br />\n$2.00<br />\n<br />\niubscription<br />\n<br />\nEntered as second-class matter Oecember 3, 1909, at the Postoffice in Baltimore,<br />\nMd., under the Act of Congress November 3, 1879.<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins<br />\nUniversity.<br />\n<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nother communications to the EDITOR-IN-CHIEF.<br />\n<br />\nBelmont 8778<br />\n<br />\nTelephone<br />\n<br />\n\"The Alumni College idea is<br />\ngrowing throughout the country,\"<br />\nreports Lafayette. The idea, which<br />\nwas orignated last year at that institution, has received six new adherents, to wit: INIichigan, Columbia, and St. Stephen. The idea of<br />\nthe movement is, it is explained, is<br />\nto keep the alumni better informed<br />\nas to the progress being made by the<br />\ncollege. Thus it is contended, can<br />\nthe graduates be aroused to ,interest<br />\nin other collegiate things besides<br />\nfootball; and be of help in bettering<br />\ntheir alma mater.<br />\n<br />\nEDITORIAL DEPARTMENT<br />\n<br />\nEditor-in-Chief<br />\nGEORGE H. DOWELL, '31<br />\nManaging Editor<br />\nFRANK CONE, '31<br />\nAssistant Managing Editors<br />\nROWLAND McD. NESS,'32<br />\nSYLVAN LEBOW,'32<br />\nJunior Editors<br />\nRAYMOND DUNN, '33<br />\nDONALD PROCTOR, '33<br />\nHARRY GOODMAN, '33<br />\nDAVID DOLOWITZ, '33<br />\nJACK GREENFIELD<br />\n<br />\nNATHAN M. HARRIS,'32<br />\nHAROLD B YUDKIN, '32<br />\nFULTON GREUVER, '32<br />\nHERBERT FREIDBERG, '33<br />\nMARION GROVE, '33<br />\n<br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager<br />\nGus BURK, '31<br />\nCirculation- Manager<br />\nGEORGE W. LA MONT, '32<br />\n<br />\nAdvertising Manager<br />\nDAVID SYKES, '32<br />\n<br />\nOffice Manager<br />\nISADOR GUTMAN,'33<br />\nTHEODORE FLEISHMAN, '31<br />\nCHARLES NEY, '33<br />\n<br />\nWILBUR BLOOM, '33<br />\nMORTON ROME, '33<br />\n<br />\nFrom the same institution come<br />\nrumors of the settlement of international disarmament and tariff relations. For the past several days, a<br />\nmodel assembly of the League of<br />\nNations has been held there. Commissions discussed the two problems<br />\nof tariff and disarmament and submitted resolutions which bi dfair to<br />\nsettle these problems. Surely the<br />\nmillenium approaches.<br />\n<br />\nforeign loan, the problems were satisfactorily solved. A third problem presented itself in the \"balance<br />\nof trade\": Hungary found that<br />\nafter much of its territory had been<br />\nucts, a difficulty which soon caused<br />\nit could export, a fact which necessitated an outward flow of currency<br />\nfrom the Hungarian treasury. Hungary couldn't make up this negative<br />\nbalance of trade because of the difficulty of selling agricultural product, a difficulty which soon caused<br />\nHungary to experience the evils of<br />\nsurplus production. The crisis was<br />\nreached in 1928-29, when the surplus<br />\nproduction<br />\nof<br />\nHungary<br />\namounted to about 6,000,000 bushels of agricultural products. The<br />\nmain problem faced by Hungary<br />\n(and, in fact, by Europe) is the<br />\nelevation of the standard of living.<br />\nMr. Podrabszky expressed the hope<br />\nthat the common economic and social interests may bring about an<br />\neconomical combination of the<br />\nsmaller states of Europe, that will<br />\ncooperate in the utilization of productivity methods; it is this economic combination that will lead to a<br />\ngrowth of nationalistic feeling, and<br />\nwill make of Hungary (and of other<br />\ncountries) an independent, selfsupporting, self-sufficient state.<br />\n<br />\nMay 1, the George 'Washington<br />\nGlee Club, which won the national<br />\nintercollegiate glee club contest, was<br />\n(Continued from Page 1, Column 5)<br />\nhonored at a reception and dance<br />\nGoldberg defeated Klund 6-0, 6-0.<br />\ngiven by the faculty, trustees, and<br />\nHelmholtz defeated Taylor 62, 64.<br />\nstudents of the university.<br />\nGump defeated Pyle 6-0, 6-1.<br />\nBandel defeated Moran 6-4, 6-1.<br />\nStudents of George Washington<br />\nUniversity will soon be able to send<br />\nGoldberg and Helmholtz defeated<br />\nfree wireless messages to cities Taylor and Pyle 6-2, 6-4.<br />\nSugar-Selabes and Speakmanthroughout the east by courtesy of<br />\nMoran<br />\nmatch called because of rain.<br />\nthe college Radio Union, of which<br />\n<br />\nOf Special Interest To You.<br />\nThis little book presents a happy philosophy for the<br />\ncollege man—a dynamic message in keeping with Dr.<br />\nOsler's forceful ideas.<br />\n<br />\nA Way of Life<br />\nby Dr. William Osler<br />\n<br />\nThe famous address delivered by the Canadian doctor<br />\nto Yale students, Sunday evening, April 20, 1913.<br />\nTwo portraits enhance the value of the edition. One<br />\nis a copy of the Osler Memorial Hall portrait, the<br />\nother is a full length photograph of the doctor standing before the fireplace in his Baltimore study. The attractive blue cloth cover is stamped with the design of<br />\nthe famous Vernon medallion.<br />\nPRICE<br />\n<br />\n$1.00<br />\n<br />\nThousands of college and university people have<br />\nbought this book. You should own it, too!<br />\n<br />\n•<br />\n<br />\nTHE NORMAN REMINGTON CO.<br />\nTwo Book-and-Stationery Stores<br />\n347 and 1118 N. Charles St.<br />\n<br />\nA. H. FETTING<br />\nMANUFACTURING JEWELRY CO.<br />\nManufacturers<br />\n<br />\nGreek Letter Fraternity Jewelry<br />\n314 NORTH CHARLES STREET<br />\n<br />\nG. W. U. is the headquarters. The<br />\nProduced by the R. L. Polk Printing Company 1930 Clifton Ave., Baltimore, Md.<br />\nunion is making preparation to handle a large number of messages and<br />\nhas been engaged for the past month<br />\nin clearing up the wireless. \"traffic<br />\nsituation.\"<br />\n<br />\nEDITORIALS<br />\nFRESHMAN REGULATIONS<br />\nundergraduate<br />\n<br />\nfeeble protests of a small minority of the<br />\nAbody, the<br />\nfreshman regulations were practically abolished at Hopkins<br />\nMID<br />\n<br />\none year ago. Today it is apparent that the tide has changed. The<br />\npresent system meets nothing but criticism. Strange as it may seem it<br />\nis the freshman class that is complaining the most. The very ones who<br />\nwere supposedly to benefit from this change are not satisfied. The men<br />\nof the Class of 1933 claim that they do not know one another and<br />\nthat there is no class spirit.<br />\nThe movement was designed to make the freshman feel less out of<br />\nplace in his new surroundings. The result has been the exact opposite.<br />\nWhen regulations were in effect, the new men may have felt inferior<br />\nin the company of the upperclassmen, but they found many others in<br />\na similar position. This year, however, the strange freshmen seemed<br />\n. to themselves inferior to everyone. Not knowing which men were<br />\nmembers of their own class, they felt more out of place than ever.<br />\nThe protestations of certain upperclassmen to the effect that the<br />\nfreshman is not put in his place except by the enforcement of regula'dons is not to be considered so seriously. Only a small minority of<br />\nthe first year men need to be subjected to any such treatment as is<br />\nadvocated. The majority upon arriving at college are anything but<br />\ntoo conceited.<br />\nIn former years the class rush and athletic contests were a bright<br />\nspot in the undergraduate life. In the absence of any regulations these<br />\nwere .naturally dropped. A resumption of such activities would certainly be desirable. In the first place, too small a number of under• graduates take part in athletics of any sort at the present time. Secondly,<br />\nthe athletic coaches are given the opportunity to find varsity material<br />\nthat otherwise would never be discovered. Lastly, more class spirit is<br />\nmanifested on these occasions than at any other time during the year.<br />\nThe re-establishment of a regulation compelling all freshmen to<br />\nattend football games in the cheering section would be an aid to the<br />\n• athletic teams. The lack of cheering during the recent football season<br />\nmay be attributed to the eminently unsuccessful team. However, there<br />\nis no explanation for the puny cheering section that was on hand last<br />\nSaturday at the Army lacrosse game. That contest surely should have<br />\nbrought much applause from Hopkins undergraduates. However, the<br />\ncheering was so weak that the attempts were quite comical.<br />\nAnother regrettable feature of this reform is the passing of the old<br />\ncustom of speaking to everyone met on the campus. This tradition<br />\ncreated a friendly spirit that is much to be desired.<br />\nThe question as to what body should enforce freshman regulations<br />\nis rather complicated.. Regulation by the sophomore class is undesirable. The men who have successfully avoided paddling or other<br />\npunishments during their freshman year are invariably the ones who<br />\nmost ardently punish the incoming class. Furthermore the second year<br />\nmen are hardly unpredjudiced judges when holding paddles in their<br />\n• hands. This method of enforcement should only be adopted as a last<br />\nresource. Regulation by the Student Council would be advisable, but<br />\n• would require too great an addition of work for the members of that<br />\nbody. A more expedient solution would seem to be the election of a<br />\nspecial committee. Such a committee, consisting of three or four members elected from each of the three upper classes, could give more time<br />\nand effort to• the enforcement of regulations. Serious offenses could<br />\nbe brought to the attention of the Student Council while lesser misdemeanors could be punished by the committee. The undesirabilities<br />\nof regulation by the sophomore class could not thus exist.<br />\n<br />\nThe University of Maryland is<br />\ngoing to the dogs! In fact the situation is so bad that the office of U.<br />\nof M. dog catcher has been created.<br />\nNominations for the office will be<br />\nconsidered -at the next meeting of<br />\nthe Student Council. The winner<br />\nof this extremely desirable (?) position will be furnished by the university with all necessary equipment, including net and a Ford<br />\ntruck, and a uniform of Maryland<br />\ncolors, if desired. The reason given<br />\nfor the existence of this situation<br />\nwas that the local canines were<br />\ntreated too kindly at the barracks<br />\nand fraternity houses.<br />\nRutgers is the dryest of all the<br />\nuniversities covered by the college<br />\nprohibition poll, conducted by Pierre<br />\ns. du Pont., The Targum announces<br />\nLafayette is wettest, with 80 per<br />\ncent of its students drinking, while<br />\nPrinceton is a close second. Amherst, Assumption, Harvard and<br />\nYale are also well within the stronghold of the wets. The results of a<br />\npoll taken in Barnard College, Columbia University, show that only<br />\n55 of the 312 women questioned<br />\nare in favor of prohibition enforcement.<br />\nThe new uniforms adopted by<br />\nthe government for the R. 0. T. C.<br />\nhave caused a bit of comment in<br />\nthe various college papers. Among<br />\nother things, the lapels of the coats<br />\nwill be faced with blue and soft<br />\noverseas caps will be worn. If this<br />\nkeeps up, the army uniforms will<br />\nbecome more gaudy than those of<br />\nthe navy, if possible.<br />\n<br />\nThe telephone looks ahead<br />\nEven as you are putting through your daily<br />\ntelephone calls, groups of Bell Telephone experts are calculating your telephone needs for<br />\nfive years, ten years,twenty years from now.<br />\nIt is their work to discover from all available facts—not fancies—how each state, city<br />\nand community will probably grow. These<br />\nfacts are reduced to forecast charts, precisely<br />\nas an astronomer plots the course of a comet.<br />\n<br />\nBELL SYSTEM<br />\n<br />\nThe Dutch treat system of dates<br />\nreceived a K. 0. at Rutgers, as a<br />\nresult of a debate on the subject<br />\nheld there last week. The debate<br />\n\"Resolved: That all college dates<br />\nshould be Dutch treats\" was upheld<br />\nby the girls of the University. The<br />\n<br />\nmen took the negative side and won<br />\nby 57-21 decision of the audience.<br />\n<br />\nThus central offices are planned years before they are actually built. Underground<br />\nand overhead lines are laid out to fit future<br />\nas well as present needs. Expansior• of service is provided for.<br />\nBell System planners virtually live in the<br />\ncities of the future. They play a vital part in<br />\nproviding the best possible telephone service<br />\nfor the least possible cost.<br />\n<br />\na nation-wide system of inter-connecting telephones<br />\n<br />\n\"OUR<br />\n<br />\nPIONEERING<br />\n<br />\nWORK<br />\n<br />\nHAS<br />\n<br />\nJUST<br />\n<br />\nBEGUN\"<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MAY 6, 1930<br />\n(Continued from Page 1, Column 3)<br />\n<br />\nDORM DOINGS<br />\n<br />\nLEy.B.A.,,,N,Ks&Bi<br />\n<br />\n\"inuth\"tatien.,, It Ca<br />\n<br />\nEstablished 1832<br />\nPHILADELPHIA<br />\n<br />\nOfficial Makers of the Standard<br />\nJohns Hopkins Ring<br />\nPrices Upon Request<br />\n<br />\nOrders accepted at the<br />\nPost Office in the College<br />\n<br />\nMaeLarty's<br />\nPharmacy<br />\nEAST 41st St. and<br />\nOLD YORK ROAD<br />\n<br />\nWhitman's and<br />\nSchrafft's Chocolates<br />\nCigars, Cigarettes<br />\n<br />\nL. G. Balfour Co.<br />\nOfficial Fraternity Jeweler<br />\nHopkins Ring .<br />\nCal. 1564<br />\n<br />\n1109 Fidelity Bldg.<br />\n<br />\nhad the negative side while the<br />\nCollegians' team, composed of<br />\nKraus, Rosenbaum and Cohen took<br />\nthe affirmative.<br />\nThe debate was of unusual interest and the final decision was not<br />\nunanimous on the part of the judges.<br />\nThe Hopkins rebuttalist was particularly good while the first affirmative speaker was the outstanding<br />\nman on the Collegians' team.<br />\n<br />\nWith the continued rapid rise of almost an absolute science. Perhaps<br />\ntemperature of the mid-spring sea- the University will be shortly surson, the environs and immediate prised by being able to purchase a<br />\ndiscourse on the art of these enthusineighborhood of the Alumni Dormiastic chases published by some entory are displaying an enormous in- ergetic and accomplished student of<br />\ncrease in wild life of various and the Dormitory who is thoroughly<br />\nsundry forms; of course the con- familiar with the entertainment.<br />\nduct of the students being excluded<br />\nA bit over a week past, one of the<br />\nfrom the category. A brief while more ambitious inmates of the Hall,<br />\nThe judges were Mr. Eisenberg,<br />\nago a loving and deserving feline fired with the publicity received by<br />\nMr. Sparks, and Mr. Flowers.<br />\nmet a sudden and violent conclusion automobile mishaps of fellow stuupon the fatal hour of twelve one dents, determined not to be outdone.<br />\ndark and moonless Saturday eve- To accomplish this purpose, one year, did not return to the University but went to Yale. Naturally a<br />\nning. Some lamented the loss of the evening he piloted his chariot into<br />\nvacancy appeared in the staff this<br />\nbeast while others rejoiced at the<br />\nthe heart of the busy North Avenue year and it was felt better to create<br />\ntimely removal of the pet from the<br />\nthis board of editors to do the work,<br />\npremises, after all last rites had been district and parked his device at the<br />\nrather than elect another editor. Acadministered fully to the unhappy curl; with great quantities of gasothis board was created<br />\ncordingly<br />\nfrom the depths .of<br />\nanimal. Yet one ever-important line ensuing<br />\nthe engine. Thinking nothing of and George Gump was appointed to<br />\nfact was unanimously forgotten by<br />\nthis extremely usual occurence, he lead this board.<br />\nthe executioners; namely, that the<br />\nOther men who have been elected<br />\nseveral companions retreated to<br />\nbeast, according to tradition, pos- and<br />\nthe depths of the motion picture to the staff during the year are: to<br />\nsessed at least nine lives and their<br />\nfor an evening of entertain- the editorial staff: Katz, Verlin,<br />\nensuing surprise was great when palace<br />\nBut during his few hours' ab- Brook, and Cone; to the business<br />\nonly a few days past the cat paraded ment.<br />\nthe flow of petrol increased staff, I. Miller, Feldman, Greenwald<br />\nagain nonchallantly into the court of sence,<br />\nand spread a large Mattingly, Witherall, Schwartz<br />\nthe hall. It was •the same in its considerably<br />\nover the width of Gutman, Clark and Meidling; and<br />\nreincarnation as in its previous ex- blanket of fuel<br />\nchance pedes- to the art staff, Passagnio, Salabes,<br />\nistence, even down to its question- the broad street: A<br />\nowner was and Greene.<br />\nable tendencies, and is doubtlessly trian, thinking that the<br />\ninsurance and<br />\nthe identical quadruped in search of about to collect fire<br />\na few<br />\ncompany<br />\nthe<br />\nsave<br />\nto<br />\nwishing<br />\nREDUCED RATES<br />\nfurther adventure. This last desire<br />\ndepartment<br />\nis quite likely to be answered very pennies, called the fire<br />\nof<br />\noxidation<br />\nrapid<br />\nsoon as several of the diabolical resi- to prevent any<br />\n15 cents<br />\nthe proud posFIRST 1-4 MILE<br />\ndents were overheard plotting to the material. When<br />\nemerged from<br />\n5 cents<br />\ndetermine by experiment the possi- sessor of the vehicle<br />\nEACH SUCCEEDING 1-4 MILE<br />\ndishe<br />\nentertainment,<br />\nof<br />\nplace<br />\nhis<br />\nbilities of its third return to the<br />\n2, 3, 4, OR 5 PERSONS MAY<br />\ncovered the city giving his limousine<br />\nRIDE FOR THE PRICE<br />\nprecincts of the University.<br />\nOF ONE<br />\na thorough washing and absolutely<br />\nOther wild life is to be discovered without cost or obligation to him.<br />\nin the court by a close scrutiny and<br />\nHe at length succeeded in persuadcareful observation, the majority of<br />\nimthe prowlers being either rats or ing the authorities that he would<br />\nmice. However, as long as those mediately remove the menace if they<br />\nferocious animals remain without would cease activities at once. At<br />\nthe walls of the building, all are con- last accomplishing his desire, he<br />\ntent to let the feline take care of towed the mechanism to his dwellthem to the best of her ability. Other ing amidst the cheers and shouts of<br />\nless monstrous game inhabiting the the eager onlookers where immedidomocile of the denizens passes un- ate repairs were made. And so after<br />\nder the cognomen of moths and cen- many years the students of the hall<br />\ntipedes respectively. They cause no are at last on the path to fame and<br />\nconsiderable trouble and annoyance renown, and a few more similar hapto the roomers, and, as they are penings will put their name upon<br />\ncomparatively few, afford great the lips of each and every citizen<br />\nsport on rainy afternoons as well as of Baltimore.<br />\nS. T. B.<br />\nevenings. Indeed, the ethics of the<br />\nthrilling hunts have developed into<br />\n<br />\nSNAPPY<br />\n<br />\nTUXEDOS<br />\nTO<br />\n<br />\nRENT<br />\nVernon 3436<br />\n313 W. FRANKLIN STREET<br />\n<br />\nUSED<br />\n<br />\nAutomobiles<br />\n<br />\nTHE BA.CKUS MOTOR COMPANY<br />\n10-20 E. North Avenue<br />\nVernon 4300<br />\n<br />\nAfter the Army Dance—<br />\nDine With Music<br />\nmi BEI<br />\nJUST OPENED<br />\n<br />\nTYROL INN, Inc.<br />\n1123 North Charles Street<br />\nBALTIMORE, MD.<br />\n<br />\nItalian and American Cuisine<br />\n<br />\n• IF YOU \"MAJOR\" IN<br />\nTRANSPORTATION-One thing quickly becomes clear to students of transportation<br />\nproblems.<br />\nIt is the fact that in large cities the electric car lines with<br />\ntheir auxiliary coach and bus routes form the backbone of<br />\ntransportation.<br />\n<br />\nYELLOW CABS<br />\n<br />\nSULSKY<br />\n<br />\nFORD<br />\n<br />\nNEW<br />\n<br />\nIn this permanent and necessary public utility the problems<br />\nand principles involved are worth the notice and study of<br />\nevery young man interested in public service.<br />\nTHE UNITED RAILWAYS AND ELECTRIC CO.<br />\n<br />\nof Baltimore<br />\n<br />\nVERNON 1212<br />\n<br />\noetter brick burning<br />\nwith<br />\nOs<br />\n<br />\nIPES and pants are mascupline<br />\nprerogatives that defend<br />\nand us. Where else<br />\n<br />\nthemselves<br />\ncould men find sanctuary?<br />\nPipes,stout pipes, and packings<br />\nof good old Edgeworth—what perfect expression of man's inviolable<br />\nright of refuge with other men<br />\nbehind barriers of redolent smoke!<br />\nTobacco with the whiskers on,<br />\nthat's what man wants—good old<br />\nseasoned pipe-tobacco, the best<br />\nof the leaf, all blended and flavored and mellowed. .. Edgeworth, in short.<br />\nYou don't know Edgeworth?<br />\nThen no time must be lost. Buy<br />\n,Edgeworth or borrow it, or let us<br />\nsend you some.There below is even<br />\na coupon, a free ticket for your<br />\nfirst few pipefuls of the genuine.<br />\nSend us the coupon<br />\nand we'll send you<br />\nthe Edgeworth.<br />\nVV<br />\n<br />\nBanquet Season Opens<br />\nClass Hostilities<br />\n<br />\n••<br />\n•<br />\n411 ••<br />\n•<br />\n•<br />\n•<br />\n11_11,•<br />\n<br />\nthey shall<br />\nnot have our<br />\nPipes!<br />\n<br />\nThese Hotels offer superior<br />\naccommodations for your<br />\nnext visit to<br />\n<br />\n•<br />\n•<br />\n<br />\nWashington, D. C.<br />\nMARTINIQUE<br />\n16th St. at M, Northwest—<br />\nIdeal for motorists<br />\nSingle with bath $3.00 to $4.00<br />\nDouble with bath $5.00 to $6.00<br />\n<br />\nHAMILTON HOTEL<br />\n<br />\n•<br />\n•<br />\n•<br />\n<br />\n14th at K Street—<br />\nIn the Heart of the City<br />\nSingle with bath $3.00 to $5.00<br />\nDouble with bath $5.00 to $8.00<br />\n<br />\nCAIRO HOTEL<br />\nQue St. at 16th—<br />\nWashington's tallest building<br />\nSingle with bath $3.00 to $3.50<br />\nDouble with bath $4.00 to $6.00<br />\n<br />\nTickets for the Freshman Banquet have been on sale at the Barn<br />\nsince May 2, and they may still be<br />\nobtained up until May 6, upon application to Jack Turnbull, Bill<br />\nTriplett or Douglas Stone.<br />\n• The banquet season was opened<br />\nby the Junior Banquet, May 1.<br />\nand is now in full swing. Usual<br />\nhostilities are existent between the<br />\ntwo lower classes, each of which is<br />\nendeavoring to outsmart the other.<br />\nHowever, each class has agreed to<br />\nsuspend hostilities after six o'clock<br />\nof the evening of the other class's<br />\nbanquet, and neither will they endeavor to break up each other's banquets.<br />\n<br />\n(Continued from Page 1, Column 1)<br />\n<br />\nThe work done on this year's<br />\nHullabaloo was carried on by a<br />\nboard of Editors, composed of eight<br />\nmembers of the Senior Class. Paul<br />\nCordish who was elected last year<br />\nto the Editor-in-Chief's job for this<br />\n<br />\n1<br />\n<br />\nEdgeworth is a careful<br />\nblend of good tobaccos<br />\n—selected especially for<br />\npipe-smoking.Its quality<br />\nandflavorneverchange.<br />\nBuy Edgeworth an<br />\n—\"Ready Rubbed\" and \"Plug Slice\"15i pocket package to<br />\npound humidor tin.<br />\n<br />\nEdgeworth<br />\nSMOKING TOBACCO<br />\nLARUS & BRO. CO.<br />\n100 S. 22d St., Richmond, Va.<br />\nI'll try your Edgeworth. And I'll try<br />\nit in a good pipe.<br />\n<br />\nQ/1. thought of Today-The season's styles in neckwear are the key to a man's dress . . . tocy<br />\ngive that touch of personal effectiveness.<br />\nThe Store of Standard Values\"<br />\n<br />\nGas-fired kilns for burning brick and tile are<br />\nproving money-makers in more ways than one:<br />\nthe accurate controllability of gas heat insures uniformity of color; gas<br />\nmakes for fewer bats to be thrown away. And the speed of burning that<br />\ncomes with the<br />\n<br />\nuse<br />\n<br />\nof gas increases<br />\n<br />\nWrite for your free copy of \"Gas Heat\"<br />\nand<br />\n<br />\nsee<br />\n<br />\nwhat gas<br />\n<br />\nAMERICAN<br />\n<br />\nGAS<br />\n<br />\ncan<br />\n<br />\ndo for<br />\n<br />\nyou!<br />\n<br />\nASSOCIATION<br />\n<br />\nI Name<br />\n4 Street<br />\n<br />\nToventand State<br />\n.-41Tnw lot the .Edgeworth comet<br />\n<br />\nMcPHERSON'S<br />\n11 East Baltimore Street<br />\n<br />\n420 Lexington<br />\n<br />\nAvenue, New York<br />\n<br />\nproduction appreciably.<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 6, 1930<br />\n<br />\nZ G<br />\n$8.50<br />\nBrown Zug-G rain<br />\nA sturdy new shoe for young men with a generous measure<br />\nof style ... and priced to fit a Scotchman's purse.<br />\n<br />\nWYM<br />\n<br />\nill E. Baltimore<br />\n<br />\n19 E. Lexington<br />\n<br />\nSIMON ACKERMAN CLOTHES<br />\nReady To Wear<br />\n<br />\n, A. JACOBS & SONS<br />\nTAILORS<br />\nUNIFORMS AND EQUIPMENT<br />\n128 W. Fayette Street<br />\n<br />\nayne6A@EcTL<br />\nClothival...14cilivuicuahy(2,<br />\n315 NORTH CHARLES STREET<br />\nBALTIMORE... MARYLAND<br />\n<br />\nHOmewood 8040-8041<br />\nYour clothes will always have that neat appearance if you will let us do your<br />\nCLEANING, DYEING, PRESSING AND REPAIRING<br />\n\"One Trial Will Convince You\"<br />\n<br />\nPARISIAN TAILORING CO.<br />\n346 E. 33rd Street<br />\n<br />\nCorner University Parkway<br />\n<br />\n\"not a cough<br />\nin a carload\"<br />\n<br />\nJAY TWELVE DEFATS<br />\nHAVERFORD DEFEATS<br />\nHOPKINS TRACKSTERS POWERFUL ARMY TEAM<br />\nClose Meet Not Decided Until<br />\nLast Event<br />\n<br />\nSecond<br />\n<br />\nHalf R a 11 y Keeps<br />\nCadets Guessing<br />\n<br />\nYou must have a<br />\nLinen Suit<br />\nin pastel color<br />\n<br />\n(Continued from Page 1, Column 1)<br />\n<br />\nDespite the whole-hearted play Love . . . ....C.P. . . Zimmerman<br />\nof the Jay tracksters, Hopkins was Bernard ... ...F.D. . . ....Kenny<br />\n..S.D. . . ....Warren<br />\nfinally beaten by the score of 69 1/3 Weitzel<br />\n..T.D. . .. ..Lehrfeld<br />\nto 56 2/3 by the Haverford track Nickel . .<br />\nDarcy<br />\nteam at Haverford, Pa. Until the Packard<br />\nStone<br />\n.<br />\n.<br />\n.<br />\n....T.A.<br />\n.<br />\nO'Keefe<br />\n.<br />\nevent,<br />\nlast<br />\nthe discus throw, which<br />\nS.A.Clark<br />\nwas won by the Pennsy trackmen, Guild .<br />\nTurnbull<br />\n.<br />\n...F.A<br />\nKing<br />\nthe outcome of the meet was in<br />\nDukehart<br />\n.<br />\n.<br />\n.<br />\n.0.A.<br />\n..<br />\n.<br />\nMcBride<br />\ndoubt.<br />\nTriplett . . . ..I.H<br />\nBrady<br />\nResults:<br />\nScore<br />\nby<br />\nhalves:<br />\nHight Hurdles--Won by StafHopkins<br />\n5 6-11<br />\nford, Hopkins; second, Jones, HavArmy<br />\n4 1-5<br />\nerford; third, Zintl, Haverford.<br />\nTime, 16.4 seconds.<br />\nford ; third, Lung, Hopkins. Time,<br />\n100-yd. Dash—Won by Lockard 21.2 seconds.<br />\nHopkins; second, Rice, Hopkins;<br />\nHalf Mile—Won by R. Edgar,<br />\nthird, Link, Hopkins. Time, 10.4 Haverford; second, Ratsenbach,<br />\nseconds.<br />\nHaverford; third, Heywood, HopMile run—Won by Kelly, Hop- kins. Time, 2 minutes 7 seconds.<br />\nkins; second, C. Edgar, Taverford; Shotput—Won by Fields, Haverthird, Syres, Haverford. Time, 4 ford; second, Schramm, Ha.verford ;<br />\nminutes, 50 seconds.<br />\nthird, Kutcher, Hopkins. Distance,<br />\nOne-quarter Mile—First, Lung, 41 feet, 10 inches.<br />\nHopkins; second, Grenebeck, HopDiscus—Won by Fields, Haverkins; third, Reisner, Haverford. ford; second, Schramm, Haverford;<br />\nTime, 53.6 seconds.<br />\nThird, Burke, Hopkins. Distance,<br />\nTwo Miles—\\\\Ton by Shark, Hay- 114 feet, 9 3/4 inches.<br />\nTwo Miles—Won by Sherk, HavJavelin Throw—Won by Swan,<br />\nerford; second, C. Edgar, Haver- Haverford; second, Zuirk,<br />\nHopkins;<br />\nTime, 10 minutes, 32 seconds.<br />\nthird, Burke, Hopkins. Distance,<br />\nLow Hurdles—Won by Nasland, 163 feet, 10 inches.<br />\nHaverford; second, Stafford, Hop- High Jump—Won by Jones, Havkins; third, Scherd, Hopkins. Time, erford; second, Zuirk,<br />\nHopkins;<br />\n25.6 seconds.<br />\nthird, Brown, Haverford. Height,<br />\n220- Yards—Won by Lockard, 5 feet, 5 inches.<br />\nHopkins; second, Battey, HaverBroad Jump—Won by Ness,<br />\nHopkins; second, Wilson, Hopkins;<br />\nthird, Rice, Haverford. Distance,<br />\n21 feet 8 1/4 inches.<br />\nPole Vault—Won by Zuirk, Hopkins; second, Foley, Haverford;<br />\nScheed, Hopkins, tied.<br />\n<br />\nOur collection includes browns, blues,<br />\ngreens and gray-whites in all sizes<br />\n<br />\nHOCIISCHILD,KOHN<br />\n<br />\nDECORATIONS<br />\n<br />\nINTERIOR WOOD WORK<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\nShow Rooms<br />\n343 N. Charles Street<br />\n<br />\nFactory<br />\n600 S. Pulaski Street<br />\n<br />\nJ. H. FURST CO.<br />\n<br />\nWERGLEY'S<br />\n<br />\nPRINTERS OF<br />\n<br />\n2438 Charles St., North<br />\nLa Patisserie<br />\n<br />\nPhilological and Scientific<br />\nPublications<br />\n<br />\nSANDWICHES PAR EXCELLENCE<br />\n<br />\n23 S. HANOVER ST. BALTIMORE<br />\n<br />\nA \"High Mark)/<br />\nin Youthful Style<br />\n<br />\nThere is no comparison in High Standards<br />\n<br />\nSUITS $1.00—COATS $1.00<br />\n<br />\nKAYES'<br />\nCLEANERS and DYERS<br />\n32nd Street Cor. Abell<br />\n<br />\nCLOTHES<br />\n<br />\n3 Suits Sponged and Pressed $1.00<br />\nSuperior Work<br />\n<br />\n211-213 E. Baltimore St.<br />\n<br />\n• Lowest Prices<br />\n<br />\nPhone, Belmont 5816 and have our<br />\ndelivery car at your door<br />\n<br />\nBlow<br />\nthe Whistle<br />\n...::<br />\n::•••••?'•<br />\n•<br />\n<br />\n•<br />\n<br />\nC P. Lorillard Co.<br />\n<br />\nOLD GOLD cigarettes<br />\nin a<br />\n<br />\nstunning new velour<br />\n<br />\nDrink<br />\n<br />\nOCa<br />\n<br />\nbox<br />\n<br />\nDelicious and Refreshi<br />\n<br />\nuse<br />\n<br />\nfor the pa<br />\n<br />\nIf you could go to Paris... to clever French tabac<br />\nshops... you might find a cigarette box as smart as<br />\n<br />\nthat refreshes<br />\n<br />\nthis. Or maybe in Berlin... or Vienna. But now<br />\n<br />\nWhen you suffer from large and undiluted<br />\ndoses of your fellows. When the milk of<br />\nhuman kindness seems to sour. Blow the<br />\nwhistle for a minute's \"time out\" on your<br />\nown account, to pause and refresh yourself.<br />\n<br />\nOLD GOLD has caught the continental flair for pack-<br />\n<br />\naging ... dressed its familiar \"fifties\" package in<br />\n... and delivered it, for you,<br />\nthis golden velour paper.<br />\nto your nearest dealer's. It's a stunning box to keep<br />\non your study table...to pass to your friends..<br />\nor to take on trips. And it costs no more than<br />\n<br />\nIN--a---s—<br />\nGrantland<br />\n<br />\nRice<br />\nEamon.<br />\nSports Champion.'\",-Coca-Cola<br />\nOrchestra ...I-Every Wednesday<br />\n10:30to 11 pm.Eastern Daylight<br />\nSaving Time<br />\nCoast to<br />\nCoast NBC Network--'t.-<br />\n<br />\nIn other words, go into a huddle with a<br />\nglass or bottle of refreshing, delicious<br />\nCoca-Cola. It will make you captain of<br />\nyour soul again, ready to live—or die—<br />\nfor the dear old alma mater.<br />\nThe Coca-Cola Company, Atlanta, Ga.<br />\n<br />\nthe regular \"fifties\" tin. Now on sale everywhere.<br />\nIf dealer cannot supply,send 35ft to Old Gold, 119 W.40th St., New York<br />\n<br />\n9 MILLION A<br />\n<br />\nDAY—IT<br />\n<br />\nHAD<br />\n<br />\nTO<br />\n<br />\nBE<br />\n<br />\nGOOD<br />\n<br />\nTO<br />\n<br />\nGET<br />\n<br />\nWHERE<br />\n<br />\nIT<br />\n<br />\nIS<br />\n<br />\n\f", "format": "basic_html", "processed": "PARKS IS ELECTED<br />\nHULLABALOO EDITOR<br />\nBanquet Held By Juniors A<br />\nSouthern<br />\nATTENDANCE IS SMALL<br />\nDean Berry And Hambleton<br />\nAre Present<br />\n• Once again we come to that time<br />\nof the year which is known as the<br />\nbanquet season. The Juniors formally opened the season last Thursday night, by holding their banquet<br />\nat the Southern Hotel. This occasion<br />\nwas quite different from the one<br />\nthat they held last year at the \"KitKat\". Due to its formality and<br />\ntameness (compared to the '29 banquet) it was called a \"gentleman's\"<br />\nbanquet.<br /><br />\nTENTATIVE SCHEDULE<br />\nFOR EXAMS APPEARS<br />\nA tentative examination<br />\nschedule appeared last week<br />\nand copies can be found<br />\nposted on all the bulletin<br />\nboards. All students are expected to examine these sheets<br />\nfor any conflicts which might<br />\nbe caused in their schedules<br />\nand to report these to the Registrar's Office.<br />\nThis must be done immediately so that the office will be<br />\nable to do away with all the<br />\nconflicts and issue a complete<br />\nand final schedule. It is expected that these will appear<br />\non the scene some time during<br />\nthe latter portion of this week.<br /><br />\nLIBERAL CLUB HEARS<br />\nSTEPHEN PODRABSZKY<br /><br />\nBanquet Is Success<br /><br />\nThe arrangements, which were<br />\nmade by Belmont Towbin and his<br />\nassistants, went off smoothly and the<br />\naffair, was termed a great success.<br />\nIt is true that the class didn't turn<br />\nout in as large numbers as had been<br />\nhoped for, but those present enjoyed the funny anecdotes and<br />\nstories told by Dave Kaukman, who<br />\nacted as toastmaster and the<br />\nspeeches of the other guests.<br />\nAmong the distinguished guests<br />\nwho were present were Dean Edward W. Berry and Waldo Hambleton, the coach of the Blue Jay<br />\ntrack team.<br /><br />\nPrice 5 Cents<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 6, 1930<br /><br />\nVOL. XXXIV, No. 48<br /><br />\nPost-War Hungary Is Subject<br />\nOf Talk<br />\nIS BUDAPEST U GRAD<br />\nCites Economic And Social<br />\nProblems Of Hungary<br /><br />\nONE PHILOSOPHY PROFESSOR SNARED;<br />\nSOPHOMORES MOOR FROSH TO POLE<br />\nThis isn't about spring. This<br />\ndoesn't tell how the grass of the C.<br />\nE. Building is greener than it was<br />\nlast year. This doesn't tell how the<br />\naustere Professor of Monotony<br />\nstops to smell a rose. This doesn't<br />\ntell how the dulcet tones of the<br />\ntower clock reberbrate in the swaying trees in back of the Y. M. C. A.<br />\nbuilding.<br /><br />\nbody who may have been somebody<br />\nbut who wasn't, placed a match box<br />\non a philosophy professor's pulpit.<br />\nThe philosophy professor saw the<br />\nmatch box. Although he knew that<br />\npremises sometimes aren't premises,<br />\nhe didn't know that match boxes<br />\nsometimes aren't match boxes.<br />\nSo he picked up the match box,<br />\nnot knowing that match boxes sometimes aren't match boxes. And surprisingly, the match box wasn't a<br />\nmatch box. It was something that<br />\nsnapped. It snapped the philosophy<br />\nprofessor's finger. Then he knew it<br />\nwas a match box that wasn't a match<br />\nbox. He was caught. But philosophy<br />\nprofessors don't like to be caught.<br />\nThey like to catch. So he picked out<br />\na premise that wasn't a premise—<br />\nand another hour of philosophy was<br /><br />\nNo, it is doubtful if it were good<br />\nto be in Hopkins now that spring is<br />\nhere. In fact the grass of the C. E.<br />\nBuilding isn't as green as it was last<br />\nyear. Nor do professors of Monotony stop to smell roses. Nor does<br />\nthe tower clock make anything except noise. And anything, behind<br />\nthe Y. M. C. A. building, whether<br />\nit be a group of swaying trees or<br />\nnot, cannot lay claims to the<br />\naesthetic.<br />\non its way.<br />\nThis tells how a college slicker<br />\nSophomores are devilish. They<br />\nsnared one philosophy professor. anticipated the banquet season. To<br />\nThis tells how some devilish sopho- anticipate the banquet season means<br />\nmores in a devilish mood made a to jostle a freshman. So some sophfreshman meditate for several hours omores jostled a freshman and a<br />\nwhile his hands were somewhat ocfreshman tried not to be jostled.<br />\ncupied with a chain. The chain, in<br />\n(as they say in<br />\ncidentally, embraced one of the ten- When all was still<br />\nthe story books) one freshman was<br />\nnis court light poles.<br />\nmoored to the light pole. Other<br />\nPhilosophy professors are profreshmen came. So did some men.<br />\nfessors who catch people. They<br />\nall the men<br />\ncatch them when they are unaware But all the frosh and<br />\nthat something doesn't mean some- couldn't untie the freshman again.<br />\nthing, but something else. They And so he stayed and stayed and<br />\ncatch them when a premise isn't a stayed.<br />\npremise but another kind of premise. This isn't or wasn't about spring<br />\nThey catch them frequently asleep. —give thanks.<br />\nProfessors of philosophy like to<br />\nN. D. W.<br />\ncatch but not be caught. So some-<br /><br />\nFRATERNITIES HOLD<br />\nBRIDGE TOURNAMENT<br />\nContinuing a policy which<br />\nwas started a few years ago<br />\nand which has become a custom among the Hopkins fraternities, an interfraternity<br />\nbridge tournament is now being held. The contest started<br />\nlast week and will continue<br />\nfor a few weeks more.<br />\nAs yet only a few of the<br />\ngames have been played. The<br />\nA. T. 0. contingent defeated<br />\nthe bridge fiends from the<br />\nKappa Sigma fraternity and<br />\nare scheduled next to meet the<br />\nD. U. players. The Alpha Mu<br />\nTau fraternity was defeated<br />\nby the Sigma Tau Deltas.<br /><br />\nJAYS TROUNCE<br />\nARMY TWELVE<br />\nSmooth Running Attack Scores<br />\n11-5 Victory Over Cadets<br />\nWATERS IS ARMY STAR<br />\nArmy Band Gives Concert Following Game<br /><br />\nFlashing an attack that functione<br />\nlike clock-work and a defense •that<br />\nproved to be almost impregnable,<br />\nthe Blue Jays, last Saturday, piled<br />\nup a total of 11 points against the<br />\nstrong Army twelve to win by a<br />\nscore of 11 to 5. The Cadets played<br />\na mighty fine game and kept stride<br />\nwith the Jays all during the first<br />\nhalf, scoring a goal for every one<br />\nmade by the Jays. It was almost a<br />\ntit for tat affair during the first part<br />\nof the game, but in the second hall<br />\nthe Hopkins twelve, in a whirlwirk<br />\nof attacks, scored six goals to<br />\nBlue Jays Show Marked Su- Army's one.<br />\nJays Score<br />\nperiority<br />\nHopkins got the face off and immediately started bombarding JohnHOPKINS SWEEPS SINGLES<br />\nny Waters, the Army goal tender,<br />\nArmy<br />\nGoldberg And Helmholtz Eas- but with no success at first.<br />\nsoon got possession of the ball and<br />\nily Take Double Victories<br />\nshifted to attack. However, they,<br />\nwere unsuccessful.<br />\ntoo,<br />\nThe Hopkins tennis team<br />\nin possession of. the ball<br />\nWhen<br />\nstretched its winning streak to three<br />\nagain, Jack Turnbull, after running<br />\nstraight Friday afternoon by de- around the goal and eluding three<br />\nfeating Delaware, 5 to 0. The Dela- defense men, put a hard shot past<br />\nware team was completely outclassed Waters. Army soon tied the score<br />\nin every match but the second dou- on a nice shot from Clark, the secbles, which was called because of ond attack.<br />\nThe Jays took the lead again when<br />\nrain. The weather was ideal during<br />\nPackard carried the ball down the<br />\nthe singles matches, but the wind middle, feinted a shot, but passed<br />\ngrew stronger toward the finish and instead to Dukehart on the crease<br /><br />\nHOPKINS MEN DEFEAT<br />\nDELAWARE NETMEN 5-0<br /><br />\nThe economic and social condition<br />\nof Hungary following the cataclysmic upheaval occasioned by the<br />\ngreat war was the topic of discussion, led by Stephen Podrabsz.ky, at<br />\nthe ineeting the Johns Hopkins Liberal Club held last Friday. Mr.<br />\nBerry Speaks<br />\nPodrabszky conducted the discusIn his speech, which was short sion capably, flavoring it continuand straight to the point, the Dean ally with the spice and idioms of his<br />\nInterfraternity Net<br />\nspoke of the pleasure he derived native tongue. He is a graduate of Nominations For S. C.<br />\nthe flurries of sand were a hindrance who flipped the ball into the net.<br />\nPlanned<br />\nTournaments<br />\nfrom being present and said he enThursday<br />\nMade<br />\nTo Be<br />\n'<br />\nWarren knotted the count again<br />\nto steady playing.<br />\nthe University of Budapest, in HunThe interfraternity tennis tourjoyed being among the young men<br />\nThis Thursday's assembly will<br />\nArmy on a pass from Lehrfeld.<br />\nfor<br />\nHerman Goldberg sent the Blue<br />\nof the Hungarian<br />\nand entering into their play with gary; as the head<br />\nbe short but the business to be nament will take place some time<br />\nGuild and Packard scored in close<br />\nthem. He related a few laughable Students Foreign Office he is the transacted will be very important. this week as soon as the details of team off to a good start when he succession to put the Jays two poinfs<br />\nincidents which set the gathering in representative of the Hungarian stu- All members of the four under- the match are arranged. This tour- defeated his opponent, love and love, in the lead. Not to be outdone,<br />\na general uproar of laughter.<br />\ndent body in the International Stu- graduate classes are urged to be nament is something new in cam- in a match lasting twenty-five min- Brady and O'Keefe scored, and tied<br />\nstarted last utes. Klund, Delaware No. 1, ral- the count again. On a pass from<br />\nHambleton Called On<br />\ndents' Conference. At present he is present. This meeting has been set pus activities. It was<br />\nCoach Hambleton said that when<br />\nsuccess and<br />\ngreat<br />\nyear and met with<br />\nwork in politi- aside for the express purpose of<br />\nlied in the first, fifth, ninth, and Turnbull, who was behind the goal<br />\nhe had been a student in the Uni- engaged in graduate<br />\nnominating men for the Presidency approval. Already it has initiated<br />\nTriplett scored Hopkins' fifth goal.<br />\nversity he had gone out for track. cal economy under the tutelage of of the Student Council for next a spirit of friendly sportsmanship tenth games to amass a total of The half ended with the score 5 to 4.<br />\nHe had always hoped to be a high Dr. Hollander at the Johns Hopkins year, an office which is highly into the midst of the fraternity seven points. Wifth these excepArmy's Last Threat<br />\njumper; but, due to the fact that he University; his chief interest lies in cherished and greatly sought for group.<br />\ntions, he was practically helpless.<br />\nIn the second half, Army came<br />\nhad not been built for such work, the study of monetary theories and by all men. The Presidency of the<br />\nThe pairs for the matches have<br />\nIt was only a question of time in out determined to tie the count.<br />\nhe was compelled to do the next<br />\nas<br />\nare<br />\nThey<br />\npicked.<br />\nbeen<br />\nalready<br />\nhighest<br />\nthe<br />\nproblems of international financial organization is one of<br />\nthe second singles, before Captain Darcy took a long shot which was<br />\nbest thing and took up the throwing<br />\nfollows:<br />\nscreened by the homes and scored<br />\nin<br />\nhold<br />\nhis<br />\noffices that a man can<br />\nrelations.<br />\nHelmholtz disposed of Captain Tayof weights. \"Now,\" h said, \"I<br />\nUpDelta<br />\nTau<br />\nvs.<br />\nAlpha<br />\nOmega<br />\nArmy's last goal. Then the fire<br />\nsenior year.<br />\nlor, of Delaware. The J. H. U. star<br />\nam back at the University in the<br />\nHungary was related to Austria<br />\nsilon.<br />\nworks of the game began. The Jays<br />\nPurnell Hall, the retiring- Presicapacity of a coach, trying to tell on a close personal basis immediateBeta Theta Pi vs. Alpha Mu Tau. quickly showed his class and won opened up a lightning speed attack<br />\nthe boys how to run.\"<br />\nKappa Alpha vs. Alpha Kappa 6-2, 6-4. The match was not as which kept the Cadet defense guessly preceding the war; the Prime dent, wishes to announce that this<br />\nThe banquet which started Minister of Hungary was strongly will be the only nomination held Phi.<br />\ning as to what would happen next.<br />\nclose as the score indicates.<br />\npromptly at 7.30 did not drag and disfavorable to war, and exerted Thursday. No delegates will be<br />\nAlpha Delta Phi vs. Delta Phi.<br />\nIn the remaining individual Six times during the second half,<br />\nwas over before 10. Outside of the every means in his power to avoid nominated for the A. A. Board as<br />\nPhi Gamma Delta vs. Omicron<br />\nthe ball found its way past Johnny<br />\nmatches, Gump defeated Pyle, and<br />\ndifferent speeches, there was no it. The great strain caused by the in previous years, due to the recent Kappa Omicron.<br />\nWaters and came to rest in the net<br />\nadded entertainment, like there had war on the population of Hungary change in the organization of this<br />\nSigma Phi Epsilon vs. Tau Al- Bandel defeated Moran. The last in back of him. Waters played a<br />\nbeen in years past.<br />\nwas the chief reason for the dissolu- body. This body, in the future, will pha Phi.<br />\nmentioned was brilliant in streaks, heroic game at goal and turned back<br />\nbe<br />\nand<br />\ncaptains<br />\nthe<br />\nof<br />\nup<br />\nmade<br />\nPhi Kappa Psi vs. Sigma Tau but lack of steadiness caused his many well-aimed shots which the<br />\nAt the banquet, the staff of the tion of the Hungarian Army follow1931 Hullabaloo was announced. ing the war. This dissolution, and managers of the different recog- Delta and Kappa Sigma.<br />\nundoing. Bandel did well in beat- Jay attack shot at him during their<br />\nThe winners of each Match will<br />\nThe election of these men had been other aftermaths of the war, affect- nized sports, thus giving every sport<br />\nbombardment of the Army goal in<br />\nequal representation on the board. play the others until by progressive ing him.<br />\nthe second half.<br />\nheld at 12.20 the day of the ban- ed the regime of the first president<br />\nGoldberg and Helmholtz easily<br />\nSpring Elections<br />\nelimination the winning team will<br />\nFrom start to finish, the game was<br />\nquet, in the Hullabaloo office. The of the Hungarian Republic, who,<br />\nvanquished Taylor and Pyle in the full of action and marked by the<br />\nAll the elections of representatives survive.<br />\nboard of control of this year's staff, finding it impossible to reorganize<br />\nlast completed match of the day. spectacular playing of both teams.<br />\nfor the first time in the history of effectively Hungary's political and from the four classes to the Student<br />\nBoth the Hopkins men played sound Even in the latter portion of the<br />\nthe Hullabaloo, had complete con- economic status, turned over the Council will be held this spring. In<br />\nThird Cotillion Is Held<br />\nHelmholtz playing an ex- game when it was evident that only<br />\ngames,<br />\nCommunists.<br />\nThe<br />\nthe<br />\nto<br />\ngovermnent<br />\npast<br />\nyears<br />\nalelections<br />\nhave<br />\nthese<br />\ntrol of the elections. In the past<br />\nAt the Southern Hotel ceptional net game. At this time<br />\nbefailed,<br />\nsoon<br />\nregime<br />\nCommunist<br />\nbeen<br />\nthe<br />\nways<br />\nfall,<br />\na miracle could save the Cadets from<br />\nheld over until<br />\nyears the elections have been made<br />\nIn honor of the Army lacrosse<br />\nthe wind was blowing in frequent defeat, they did not give up -in disby the vote of the class at their ban- cause of public sentiment and be- but beginning with this year, all<br />\nteam which played the Jays at gusts, and, coupled with the rain,<br />\npair, but kept fighting an uphill batquet. It, was felt that this method cause.of, the economic blockade im- elections to the Student Council will<br />\nHomewood last week, the Cotillion prevented the completion of the<br />\ntle until the final whistle ended the<br />\nwas not 4.good one since too much posed upon Hungary by other Euro- be made in the spring of the year.<br />\nBoard held its third Cotillion Dance<br />\nsecond doubles match. For Hop- game.<br />\npean nations immediately after the<br />\npolitics entered into the election.<br />\nof the year last Saturday night at<br />\nkins, Selabes and Sugar were putThe team that carried the Black<br />\nIn the,.election Townsend Parks war.<br />\nthe Southern Hotel in the main ting up a<br />\nstubborn fight.<br />\nand Blue to victory last Saturday,<br />\nwas elected Editor-in-Chief and R.<br />\nDebaters<br />\nLose<br />\nFreshmen<br />\nTrere are presented today, acballroom.<br />\nMiller was elected Business Man- cording to Mr.<br />\nTo City College Team Percy Glasco and his ten-piece<br />\nIn the feature event of the was the same one that played Mt<br />\nPodrabszky, several<br />\nWashington on the 12th of April,<br />\neger. The 'remainder of the board<br />\nThe Johns Hopkins University<br />\nproblems that have arisen out of the<br />\nPlantation Band furnished the music day, seventeen sophomores succeedwith<br />\none exception. Weitzel was<br />\nof cont'rol ..fOr. next year includes<br />\nsocial and economic status of Hun- Freshman Debating team lost an in- which was peppy and very incentive e din handcuffing one freshman to<br />\nplaying<br />\nsecond defense in place of<br />\nJohn Heinierling, Managing Editor;<br />\na pole. This led to a series of<br />\ngary. The first problem met with teresting contest to the Baltimore to dancing.<br />\nNess<br />\nwho<br />\nhas been unable to play<br />\nGus Burke, Advertising Manager; by Hungary<br />\nskirmishes which were amusing to<br />\nwas to provide for the City College team last Friday afterThe dance, which began at 9 and<br />\nfor the past three weeks due to the<br />\nJames Witherall and Daniel Miller officials who had been<br />\nThe<br />\nwas<br />\nthe<br />\nin<br />\nnoon.<br />\ncontest<br />\nheld<br />\nthe<br />\nonlookers,<br />\nbut<br />\nto<br />\ndetrimental<br />\ndismissed<br />\nlasted until 2, was very well atassistant Business Managers, and from the<br />\nthe morale of the players. In the fact that he is suffering from a fracterritories cut Off from latter institution.<br />\nall<br />\nand<br />\nfrom<br />\nangles,<br />\ntended,<br />\nviewed<br />\nRobert Kyle, art editor.<br />\nfuture, it would be More consid- tured rib and a sprained knee which<br />\nHungary after the war. A second<br />\nThe topic of debate was, \"Re- was a big success.<br />\nof the spectators to observe he received during the Mt. Washerate<br />\nThe Photographic Editor was not problem was the fight *against cur- sOlved, That the United States Shall<br />\nThe gray uniforms trimmed with<br />\nington game.<br />\nnamed by this year's Board of Con- rency inflation, the stabilization of Establish Diplomatic Relations with braid and brass buttons, added a greater silence while the matches<br />\nThe line-up follows:<br />\ntrol; he will be appointed by the the currency and of the budget; un- the Soviet Russia.\" The Hopkins touch of life to the dance, and af- are in progress.<br />\nHopkins<br />\nPos.<br />\n'Army<br />\nnew Board of Control at a later der the supervision of the League team, composed of Raymond Dunn, forded a pleasant change for the eye<br />\nThe summary of the match is as<br />\nFerini<br />\nWaters<br />\nof Nations and with the aid of a Haskill Milstone, and Leo Alpert, from the sombre tuxedos of the follows:<br />\ndate.<br />\nHall . . ....P. .. ..Richardson<br />\nother male dancers.<br />\n(Continued on Page 3, Column .3)<br />\n(Continued on Page 2, Column 4)<br />\n(Continued on Page 3, Column 4)<br />\n(Continued on Page 2, Columv 4)<br />\n(Continued on. Page 4,<br />\n'<br /><br />\n'<br /><br />\n;'•<br /><br />\nColumn 3)<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 6, 1930<br />\n(Continued front Page 1, Column 2)<br /><br />\nTHEDIESHOPKINS111WKETTE<br /><br />\nINTERCOLLEGIATE<br />\nNEWS<br /><br />\nFOUNDED 1897<br /><br />\n$2.00<br /><br />\niubscription<br /><br />\nEntered as second-class matter Oecember 3, 1909, at the Postoffice in Baltimore,<br />\nMd., under the Act of Congress November 3, 1879.<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins<br />\nUniversity.<br /><br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nother communications to the EDITOR-IN-CHIEF.<br /><br />\nBelmont 8778<br /><br />\nTelephone<br /><br />\n\"The Alumni College idea is<br />\ngrowing throughout the country,\"<br />\nreports Lafayette. The idea, which<br />\nwas orignated last year at that institution, has received six new adherents, to wit: INIichigan, Columbia, and St. Stephen. The idea of<br />\nthe movement is, it is explained, is<br />\nto keep the alumni better informed<br />\nas to the progress being made by the<br />\ncollege. Thus it is contended, can<br />\nthe graduates be aroused to ,interest<br />\nin other collegiate things besides<br />\nfootball; and be of help in bettering<br />\ntheir alma mater.<br /><br />\nEDITORIAL DEPARTMENT<br /><br />\nEditor-in-Chief<br />\nGEORGE H. DOWELL, '31<br />\nManaging Editor<br />\nFRANK CONE, '31<br />\nAssistant Managing Editors<br />\nROWLAND McD. NESS,'32<br />\nSYLVAN LEBOW,'32<br />\nJunior Editors<br />\nRAYMOND DUNN, '33<br />\nDONALD PROCTOR, '33<br />\nHARRY GOODMAN, '33<br />\nDAVID DOLOWITZ, '33<br />\nJACK GREENFIELD<br /><br />\nNATHAN M. HARRIS,'32<br />\nHAROLD B YUDKIN, '32<br />\nFULTON GREUVER, '32<br />\nHERBERT FREIDBERG, '33<br />\nMARION GROVE, '33<br /><br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager<br />\nGus BURK, '31<br />\nCirculation- Manager<br />\nGEORGE W. LA MONT, '32<br /><br />\nAdvertising Manager<br />\nDAVID SYKES, '32<br /><br />\nOffice Manager<br />\nISADOR GUTMAN,'33<br />\nTHEODORE FLEISHMAN, '31<br />\nCHARLES NEY, '33<br /><br />\nWILBUR BLOOM, '33<br />\nMORTON ROME, '33<br /><br />\nFrom the same institution come<br />\nrumors of the settlement of international disarmament and tariff relations. For the past several days, a<br />\nmodel assembly of the League of<br />\nNations has been held there. Commissions discussed the two problems<br />\nof tariff and disarmament and submitted resolutions which bi dfair to<br />\nsettle these problems. Surely the<br />\nmillenium approaches.<br /><br />\nforeign loan, the problems were satisfactorily solved. A third problem presented itself in the \"balance<br />\nof trade\": Hungary found that<br />\nafter much of its territory had been<br />\nucts, a difficulty which soon caused<br />\nit could export, a fact which necessitated an outward flow of currency<br />\nfrom the Hungarian treasury. Hungary couldn't make up this negative<br />\nbalance of trade because of the difficulty of selling agricultural product, a difficulty which soon caused<br />\nHungary to experience the evils of<br />\nsurplus production. The crisis was<br />\nreached in 1928-29, when the surplus<br />\nproduction<br />\nof<br />\nHungary<br />\namounted to about 6,000,000 bushels of agricultural products. The<br />\nmain problem faced by Hungary<br />\n(and, in fact, by Europe) is the<br />\nelevation of the standard of living.<br />\nMr. Podrabszky expressed the hope<br />\nthat the common economic and social interests may bring about an<br />\neconomical combination of the<br />\nsmaller states of Europe, that will<br />\ncooperate in the utilization of productivity methods; it is this economic combination that will lead to a<br />\ngrowth of nationalistic feeling, and<br />\nwill make of Hungary (and of other<br />\ncountries) an independent, selfsupporting, self-sufficient state.<br /><br />\nMay 1, the George 'Washington<br />\nGlee Club, which won the national<br />\nintercollegiate glee club contest, was<br />\n(Continued from Page 1, Column 5)<br />\nhonored at a reception and dance<br />\nGoldberg defeated Klund 6-0, 6-0.<br />\ngiven by the faculty, trustees, and<br />\nHelmholtz defeated Taylor 62, 64.<br />\nstudents of the university.<br />\nGump defeated Pyle 6-0, 6-1.<br />\nBandel defeated Moran 6-4, 6-1.<br />\nStudents of George Washington<br />\nUniversity will soon be able to send<br />\nGoldberg and Helmholtz defeated<br />\nfree wireless messages to cities Taylor and Pyle 6-2, 6-4.<br />\nSugar-Selabes and Speakmanthroughout the east by courtesy of<br />\nMoran<br />\nmatch called because of rain.<br />\nthe college Radio Union, of which<br /><br />\nOf Special Interest To You.<br />\nThis little book presents a happy philosophy for the<br />\ncollege man—a dynamic message in keeping with Dr.<br />\nOsler's forceful ideas.<br /><br />\nA Way of Life<br />\nby Dr. William Osler<br /><br />\nThe famous address delivered by the Canadian doctor<br />\nto Yale students, Sunday evening, April 20, 1913.<br />\nTwo portraits enhance the value of the edition. One<br />\nis a copy of the Osler Memorial Hall portrait, the<br />\nother is a full length photograph of the doctor standing before the fireplace in his Baltimore study. The attractive blue cloth cover is stamped with the design of<br />\nthe famous Vernon medallion.<br />\nPRICE<br /><br />\n$1.00<br /><br />\nThousands of college and university people have<br />\nbought this book. You should own it, too!<br /><br />\n•<br /><br />\nTHE NORMAN REMINGTON CO.<br />\nTwo Book-and-Stationery Stores<br />\n347 and 1118 N. Charles St.<br /><br />\nA. H. FETTING<br />\nMANUFACTURING JEWELRY CO.<br />\nManufacturers<br /><br />\nGreek Letter Fraternity Jewelry<br />\n314 NORTH CHARLES STREET<br /><br />\nG. W. U. is the headquarters. The<br />\nProduced by the R. L. Polk Printing Company 1930 Clifton Ave., Baltimore, Md.<br />\nunion is making preparation to handle a large number of messages and<br />\nhas been engaged for the past month<br />\nin clearing up the wireless. \"traffic<br />\nsituation.\"<br /><br />\nEDITORIALS<br />\nFRESHMAN REGULATIONS<br />\nundergraduate<br /><br />\nfeeble protests of a small minority of the<br />\nAbody, the<br />\nfreshman regulations were practically abolished at Hopkins<br />\nMID<br /><br />\none year ago. Today it is apparent that the tide has changed. The<br />\npresent system meets nothing but criticism. Strange as it may seem it<br />\nis the freshman class that is complaining the most. The very ones who<br />\nwere supposedly to benefit from this change are not satisfied. The men<br />\nof the Class of 1933 claim that they do not know one another and<br />\nthat there is no class spirit.<br />\nThe movement was designed to make the freshman feel less out of<br />\nplace in his new surroundings. The result has been the exact opposite.<br />\nWhen regulations were in effect, the new men may have felt inferior<br />\nin the company of the upperclassmen, but they found many others in<br />\na similar position. This year, however, the strange freshmen seemed<br />\n. to themselves inferior to everyone. Not knowing which men were<br />\nmembers of their own class, they felt more out of place than ever.<br />\nThe protestations of certain upperclassmen to the effect that the<br />\nfreshman is not put in his place except by the enforcement of regula'dons is not to be considered so seriously. Only a small minority of<br />\nthe first year men need to be subjected to any such treatment as is<br />\nadvocated. The majority upon arriving at college are anything but<br />\ntoo conceited.<br />\nIn former years the class rush and athletic contests were a bright<br />\nspot in the undergraduate life. In the absence of any regulations these<br />\nwere .naturally dropped. A resumption of such activities would certainly be desirable. In the first place, too small a number of under• graduates take part in athletics of any sort at the present time. Secondly,<br />\nthe athletic coaches are given the opportunity to find varsity material<br />\nthat otherwise would never be discovered. Lastly, more class spirit is<br />\nmanifested on these occasions than at any other time during the year.<br />\nThe re-establishment of a regulation compelling all freshmen to<br />\nattend football games in the cheering section would be an aid to the<br />\n• athletic teams. The lack of cheering during the recent football season<br />\nmay be attributed to the eminently unsuccessful team. However, there<br />\nis no explanation for the puny cheering section that was on hand last<br />\nSaturday at the Army lacrosse game. That contest surely should have<br />\nbrought much applause from Hopkins undergraduates. However, the<br />\ncheering was so weak that the attempts were quite comical.<br />\nAnother regrettable feature of this reform is the passing of the old<br />\ncustom of speaking to everyone met on the campus. This tradition<br />\ncreated a friendly spirit that is much to be desired.<br />\nThe question as to what body should enforce freshman regulations<br />\nis rather complicated.. Regulation by the sophomore class is undesirable. The men who have successfully avoided paddling or other<br />\npunishments during their freshman year are invariably the ones who<br />\nmost ardently punish the incoming class. Furthermore the second year<br />\nmen are hardly unpredjudiced judges when holding paddles in their<br />\n• hands. This method of enforcement should only be adopted as a last<br />\nresource. Regulation by the Student Council would be advisable, but<br />\n• would require too great an addition of work for the members of that<br />\nbody. A more expedient solution would seem to be the election of a<br />\nspecial committee. Such a committee, consisting of three or four members elected from each of the three upper classes, could give more time<br />\nand effort to• the enforcement of regulations. Serious offenses could<br />\nbe brought to the attention of the Student Council while lesser misdemeanors could be punished by the committee. The undesirabilities<br />\nof regulation by the sophomore class could not thus exist.<br /><br />\nThe University of Maryland is<br />\ngoing to the dogs! In fact the situation is so bad that the office of U.<br />\nof M. dog catcher has been created.<br />\nNominations for the office will be<br />\nconsidered -at the next meeting of<br />\nthe Student Council. The winner<br />\nof this extremely desirable (?) position will be furnished by the university with all necessary equipment, including net and a Ford<br />\ntruck, and a uniform of Maryland<br />\ncolors, if desired. The reason given<br />\nfor the existence of this situation<br />\nwas that the local canines were<br />\ntreated too kindly at the barracks<br />\nand fraternity houses.<br />\nRutgers is the dryest of all the<br />\nuniversities covered by the college<br />\nprohibition poll, conducted by Pierre<br />\ns. du Pont., The Targum announces<br />\nLafayette is wettest, with 80 per<br />\ncent of its students drinking, while<br />\nPrinceton is a close second. Amherst, Assumption, Harvard and<br />\nYale are also well within the stronghold of the wets. The results of a<br />\npoll taken in Barnard College, Columbia University, show that only<br />\n55 of the 312 women questioned<br />\nare in favor of prohibition enforcement.<br />\nThe new uniforms adopted by<br />\nthe government for the R. 0. T. C.<br />\nhave caused a bit of comment in<br />\nthe various college papers. Among<br />\nother things, the lapels of the coats<br />\nwill be faced with blue and soft<br />\noverseas caps will be worn. If this<br />\nkeeps up, the army uniforms will<br />\nbecome more gaudy than those of<br />\nthe navy, if possible.<br /><br />\nThe telephone looks ahead<br />\nEven as you are putting through your daily<br />\ntelephone calls, groups of Bell Telephone experts are calculating your telephone needs for<br />\nfive years, ten years,twenty years from now.<br />\nIt is their work to discover from all available facts—not fancies—how each state, city<br />\nand community will probably grow. These<br />\nfacts are reduced to forecast charts, precisely<br />\nas an astronomer plots the course of a comet.<br /><br />\nBELL SYSTEM<br /><br />\nThe Dutch treat system of dates<br />\nreceived a K. 0. at Rutgers, as a<br />\nresult of a debate on the subject<br />\nheld there last week. The debate<br />\n\"Resolved: That all college dates<br />\nshould be Dutch treats\" was upheld<br />\nby the girls of the University. The<br /><br />\nmen took the negative side and won<br />\nby 57-21 decision of the audience.<br /><br />\nThus central offices are planned years before they are actually built. Underground<br />\nand overhead lines are laid out to fit future<br />\nas well as present needs. Expansior• of service is provided for.<br />\nBell System planners virtually live in the<br />\ncities of the future. They play a vital part in<br />\nproviding the best possible telephone service<br />\nfor the least possible cost.<br /><br />\na nation-wide system of inter-connecting telephones<br /><br />\n\"OUR<br /><br />\nPIONEERING<br /><br />\nWORK<br /><br />\nHAS<br /><br />\nJUST<br /><br />\nBEGUN\"<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 6, 1930<br />\n(Continued from Page 1, Column 3)<br /><br />\nDORM DOINGS<br /><br />\nLEy.B.A.,,,N,Ks&amp;Bi<br /><br />\n\"inuth\"tatien.,, It Ca<br /><br />\nEstablished 1832<br />\nPHILADELPHIA<br /><br />\nOfficial Makers of the Standard<br />\nJohns Hopkins Ring<br />\nPrices Upon Request<br /><br />\nOrders accepted at the<br />\nPost Office in the College<br /><br />\nMaeLarty's<br />\nPharmacy<br />\nEAST 41st St. and<br />\nOLD YORK ROAD<br /><br />\nWhitman's and<br />\nSchrafft's Chocolates<br />\nCigars, Cigarettes<br /><br />\nL. G. Balfour Co.<br />\nOfficial Fraternity Jeweler<br />\nHopkins Ring .<br />\nCal. 1564<br /><br />\n1109 Fidelity Bldg.<br /><br />\nhad the negative side while the<br />\nCollegians' team, composed of<br />\nKraus, Rosenbaum and Cohen took<br />\nthe affirmative.<br />\nThe debate was of unusual interest and the final decision was not<br />\nunanimous on the part of the judges.<br />\nThe Hopkins rebuttalist was particularly good while the first affirmative speaker was the outstanding<br />\nman on the Collegians' team.<br /><br />\nWith the continued rapid rise of almost an absolute science. Perhaps<br />\ntemperature of the mid-spring sea- the University will be shortly surson, the environs and immediate prised by being able to purchase a<br />\ndiscourse on the art of these enthusineighborhood of the Alumni Dormiastic chases published by some entory are displaying an enormous in- ergetic and accomplished student of<br />\ncrease in wild life of various and the Dormitory who is thoroughly<br />\nsundry forms; of course the con- familiar with the entertainment.<br />\nduct of the students being excluded<br />\nA bit over a week past, one of the<br />\nfrom the category. A brief while more ambitious inmates of the Hall,<br />\nThe judges were Mr. Eisenberg,<br />\nago a loving and deserving feline fired with the publicity received by<br />\nMr. Sparks, and Mr. Flowers.<br />\nmet a sudden and violent conclusion automobile mishaps of fellow stuupon the fatal hour of twelve one dents, determined not to be outdone.<br />\ndark and moonless Saturday eve- To accomplish this purpose, one year, did not return to the University but went to Yale. Naturally a<br />\nning. Some lamented the loss of the evening he piloted his chariot into<br />\nvacancy appeared in the staff this<br />\nbeast while others rejoiced at the<br />\nthe heart of the busy North Avenue year and it was felt better to create<br />\ntimely removal of the pet from the<br />\nthis board of editors to do the work,<br />\npremises, after all last rites had been district and parked his device at the<br />\nrather than elect another editor. Acadministered fully to the unhappy curl; with great quantities of gasothis board was created<br />\ncordingly<br />\nfrom the depths .of<br />\nanimal. Yet one ever-important line ensuing<br />\nthe engine. Thinking nothing of and George Gump was appointed to<br />\nfact was unanimously forgotten by<br />\nthis extremely usual occurence, he lead this board.<br />\nthe executioners; namely, that the<br />\nOther men who have been elected<br />\nseveral companions retreated to<br />\nbeast, according to tradition, pos- and<br />\nthe depths of the motion picture to the staff during the year are: to<br />\nsessed at least nine lives and their<br />\nfor an evening of entertain- the editorial staff: Katz, Verlin,<br />\nensuing surprise was great when palace<br />\nBut during his few hours' ab- Brook, and Cone; to the business<br />\nonly a few days past the cat paraded ment.<br />\nthe flow of petrol increased staff, I. Miller, Feldman, Greenwald<br />\nagain nonchallantly into the court of sence,<br />\nand spread a large Mattingly, Witherall, Schwartz<br />\nthe hall. It was •the same in its considerably<br />\nover the width of Gutman, Clark and Meidling; and<br />\nreincarnation as in its previous ex- blanket of fuel<br />\nchance pedes- to the art staff, Passagnio, Salabes,<br />\nistence, even down to its question- the broad street: A<br />\nowner was and Greene.<br />\nable tendencies, and is doubtlessly trian, thinking that the<br />\ninsurance and<br />\nthe identical quadruped in search of about to collect fire<br />\na few<br />\ncompany<br />\nthe<br />\nsave<br />\nto<br />\nwishing<br />\nREDUCED RATES<br />\nfurther adventure. This last desire<br />\ndepartment<br />\nis quite likely to be answered very pennies, called the fire<br />\nof<br />\noxidation<br />\nrapid<br />\nsoon as several of the diabolical resi- to prevent any<br />\n15 cents<br />\nthe proud posFIRST 1-4 MILE<br />\ndents were overheard plotting to the material. When<br />\nemerged from<br />\n5 cents<br />\ndetermine by experiment the possi- sessor of the vehicle<br />\nEACH SUCCEEDING 1-4 MILE<br />\ndishe<br />\nentertainment,<br />\nof<br />\nplace<br />\nhis<br />\nbilities of its third return to the<br />\n2, 3, 4, OR 5 PERSONS MAY<br />\ncovered the city giving his limousine<br />\nRIDE FOR THE PRICE<br />\nprecincts of the University.<br />\nOF ONE<br />\na thorough washing and absolutely<br />\nOther wild life is to be discovered without cost or obligation to him.<br />\nin the court by a close scrutiny and<br />\nHe at length succeeded in persuadcareful observation, the majority of<br />\nimthe prowlers being either rats or ing the authorities that he would<br />\nmice. However, as long as those mediately remove the menace if they<br />\nferocious animals remain without would cease activities at once. At<br />\nthe walls of the building, all are con- last accomplishing his desire, he<br />\ntent to let the feline take care of towed the mechanism to his dwellthem to the best of her ability. Other ing amidst the cheers and shouts of<br />\nless monstrous game inhabiting the the eager onlookers where immedidomocile of the denizens passes un- ate repairs were made. And so after<br />\nder the cognomen of moths and cen- many years the students of the hall<br />\ntipedes respectively. They cause no are at last on the path to fame and<br />\nconsiderable trouble and annoyance renown, and a few more similar hapto the roomers, and, as they are penings will put their name upon<br />\ncomparatively few, afford great the lips of each and every citizen<br />\nsport on rainy afternoons as well as of Baltimore.<br />\nS. T. B.<br />\nevenings. Indeed, the ethics of the<br />\nthrilling hunts have developed into<br /><br />\nSNAPPY<br /><br />\nTUXEDOS<br />\nTO<br /><br />\nRENT<br />\nVernon 3436<br />\n313 W. FRANKLIN STREET<br /><br />\nUSED<br /><br />\nAutomobiles<br /><br />\nTHE BA.CKUS MOTOR COMPANY<br />\n10-20 E. North Avenue<br />\nVernon 4300<br /><br />\nAfter the Army Dance—<br />\nDine With Music<br />\nmi BEI<br />\nJUST OPENED<br /><br />\nTYROL INN, Inc.<br />\n1123 North Charles Street<br />\nBALTIMORE, MD.<br /><br />\nItalian and American Cuisine<br /><br />\n• IF YOU \"MAJOR\" IN<br />\nTRANSPORTATION-One thing quickly becomes clear to students of transportation<br />\nproblems.<br />\nIt is the fact that in large cities the electric car lines with<br />\ntheir auxiliary coach and bus routes form the backbone of<br />\ntransportation.<br /><br />\nYELLOW CABS<br /><br />\nSULSKY<br /><br />\nFORD<br /><br />\nNEW<br /><br />\nIn this permanent and necessary public utility the problems<br />\nand principles involved are worth the notice and study of<br />\nevery young man interested in public service.<br />\nTHE UNITED RAILWAYS AND ELECTRIC CO.<br /><br />\nof Baltimore<br /><br />\nVERNON 1212<br /><br />\noetter brick burning<br />\nwith<br />\nOs<br /><br />\nIPES and pants are mascupline<br />\nprerogatives that defend<br />\nand us. Where else<br /><br />\nthemselves<br />\ncould men find sanctuary?<br />\nPipes,stout pipes, and packings<br />\nof good old Edgeworth—what perfect expression of man's inviolable<br />\nright of refuge with other men<br />\nbehind barriers of redolent smoke!<br />\nTobacco with the whiskers on,<br />\nthat's what man wants—good old<br />\nseasoned pipe-tobacco, the best<br />\nof the leaf, all blended and flavored and mellowed. .. Edgeworth, in short.<br />\nYou don't know Edgeworth?<br />\nThen no time must be lost. Buy<br />\n,Edgeworth or borrow it, or let us<br />\nsend you some.There below is even<br />\na coupon, a free ticket for your<br />\nfirst few pipefuls of the genuine.<br />\nSend us the coupon<br />\nand we'll send you<br />\nthe Edgeworth.<br />\nVV<br /><br />\nBanquet Season Opens<br />\nClass Hostilities<br /><br />\n••<br />\n•<br />\n411 ••<br />\n•<br />\n•<br />\n•<br />\n11_11,•<br /><br />\nthey shall<br />\nnot have our<br />\nPipes!<br /><br />\nThese Hotels offer superior<br />\naccommodations for your<br />\nnext visit to<br /><br />\n•<br />\n•<br /><br />\nWashington, D. C.<br />\nMARTINIQUE<br />\n16th St. at M, Northwest—<br />\nIdeal for motorists<br />\nSingle with bath $3.00 to $4.00<br />\nDouble with bath $5.00 to $6.00<br /><br />\nHAMILTON HOTEL<br /><br />\n•<br />\n•<br />\n•<br /><br />\n14th at K Street—<br />\nIn the Heart of the City<br />\nSingle with bath $3.00 to $5.00<br />\nDouble with bath $5.00 to $8.00<br /><br />\nCAIRO HOTEL<br />\nQue St. at 16th—<br />\nWashington's tallest building<br />\nSingle with bath $3.00 to $3.50<br />\nDouble with bath $4.00 to $6.00<br /><br />\nTickets for the Freshman Banquet have been on sale at the Barn<br />\nsince May 2, and they may still be<br />\nobtained up until May 6, upon application to Jack Turnbull, Bill<br />\nTriplett or Douglas Stone.<br />\n• The banquet season was opened<br />\nby the Junior Banquet, May 1.<br />\nand is now in full swing. Usual<br />\nhostilities are existent between the<br />\ntwo lower classes, each of which is<br />\nendeavoring to outsmart the other.<br />\nHowever, each class has agreed to<br />\nsuspend hostilities after six o'clock<br />\nof the evening of the other class's<br />\nbanquet, and neither will they endeavor to break up each other's banquets.<br /><br />\n(Continued from Page 1, Column 1)<br /><br />\nThe work done on this year's<br />\nHullabaloo was carried on by a<br />\nboard of Editors, composed of eight<br />\nmembers of the Senior Class. Paul<br />\nCordish who was elected last year<br />\nto the Editor-in-Chief's job for this<br /><br />\n1<br /><br />\nEdgeworth is a careful<br />\nblend of good tobaccos<br />\n—selected especially for<br />\npipe-smoking.Its quality<br />\nandflavorneverchange.<br />\nBuy Edgeworth an<br />\n—\"Ready Rubbed\" and \"Plug Slice\"15i pocket package to<br />\npound humidor tin.<br /><br />\nEdgeworth<br />\nSMOKING TOBACCO<br />\nLARUS &amp; BRO. CO.<br />\n100 S. 22d St., Richmond, Va.<br />\nI'll try your Edgeworth. And I'll try<br />\nit in a good pipe.<br /><br />\nQ/1. thought of Today-The season's styles in neckwear are the key to a man's dress . . . tocy<br />\ngive that touch of personal effectiveness.<br />\nThe Store of Standard Values\"<br /><br />\nGas-fired kilns for burning brick and tile are<br />\nproving money-makers in more ways than one:<br />\nthe accurate controllability of gas heat insures uniformity of color; gas<br />\nmakes for fewer bats to be thrown away. And the speed of burning that<br />\ncomes with the<br /><br />\nuse<br /><br />\nof gas increases<br /><br />\nWrite for your free copy of \"Gas Heat\"<br />\nand<br /><br />\nsee<br /><br />\nwhat gas<br /><br />\nAMERICAN<br /><br />\nGAS<br /><br />\ncan<br /><br />\ndo for<br /><br />\nyou!<br /><br />\nASSOCIATION<br /><br />\nI Name<br />\n4 Street<br /><br />\nToventand State<br />\n.-41Tnw lot the .Edgeworth comet<br /><br />\nMcPHERSON'S<br />\n11 East Baltimore Street<br /><br />\n420 Lexington<br /><br />\nAvenue, New York<br /><br />\nproduction appreciably.<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 6, 1930<br /><br />\nZ G<br />\n$8.50<br />\nBrown Zug-G rain<br />\nA sturdy new shoe for young men with a generous measure<br />\nof style ... and priced to fit a Scotchman's purse.<br /><br />\nWYM<br /><br />\nill E. Baltimore<br /><br />\n19 E. Lexington<br /><br />\nSIMON ACKERMAN CLOTHES<br />\nReady To Wear<br /><br />\n, A. JACOBS &amp; SONS<br />\nTAILORS<br />\nUNIFORMS AND EQUIPMENT<br />\n128 W. Fayette Street<br /><br />\nayne6A@EcTL<br />\nClothival...14cilivuicuahy(2,<br />\n315 NORTH CHARLES STREET<br />\nBALTIMORE... MARYLAND<br /><br />\nHOmewood 8040-8041<br />\nYour clothes will always have that neat appearance if you will let us do your<br />\nCLEANING, DYEING, PRESSING AND REPAIRING<br />\n\"One Trial Will Convince You\"<br /><br />\nPARISIAN TAILORING CO.<br />\n346 E. 33rd Street<br /><br />\nCorner University Parkway<br /><br />\n\"not a cough<br />\nin a carload\"<br /><br />\nJAY TWELVE DEFATS<br />\nHAVERFORD DEFEATS<br />\nHOPKINS TRACKSTERS POWERFUL ARMY TEAM<br />\nClose Meet Not Decided Until<br />\nLast Event<br /><br />\nSecond<br /><br />\nHalf R a 11 y Keeps<br />\nCadets Guessing<br /><br />\nYou must have a<br />\nLinen Suit<br />\nin pastel color<br /><br />\n(Continued from Page 1, Column 1)<br /><br />\nDespite the whole-hearted play Love . . . ....C.P. . . Zimmerman<br />\nof the Jay tracksters, Hopkins was Bernard ... ...F.D. . . ....Kenny<br />\n..S.D. . . ....Warren<br />\nfinally beaten by the score of 69 1/3 Weitzel<br />\n..T.D. . .. ..Lehrfeld<br />\nto 56 2/3 by the Haverford track Nickel . .<br />\nDarcy<br />\nteam at Haverford, Pa. Until the Packard<br />\nStone<br />\n.<br />\n.<br />\n.<br />\n....T.A.<br />\n.<br />\nO'Keefe<br />\n.<br />\nevent,<br />\nlast<br />\nthe discus throw, which<br />\nS.A.Clark<br />\nwas won by the Pennsy trackmen, Guild .<br />\nTurnbull<br />\n.<br />\n...F.A<br />\nKing<br />\nthe outcome of the meet was in<br />\nDukehart<br />\n.<br />\n.<br />\n.<br />\n.0.A.<br />\n..<br />\n.<br />\nMcBride<br />\ndoubt.<br />\nTriplett . . . ..I.H<br />\nBrady<br />\nResults:<br />\nScore<br />\nby<br />\nhalves:<br />\nHight Hurdles--Won by StafHopkins<br />\n5 6-11<br />\nford, Hopkins; second, Jones, HavArmy<br />\n4 1-5<br />\nerford; third, Zintl, Haverford.<br />\nTime, 16.4 seconds.<br />\nford ; third, Lung, Hopkins. Time,<br />\n100-yd. Dash—Won by Lockard 21.2 seconds.<br />\nHopkins; second, Rice, Hopkins;<br />\nHalf Mile—Won by R. Edgar,<br />\nthird, Link, Hopkins. Time, 10.4 Haverford; second, Ratsenbach,<br />\nseconds.<br />\nHaverford; third, Heywood, HopMile run—Won by Kelly, Hop- kins. Time, 2 minutes 7 seconds.<br />\nkins; second, C. Edgar, Taverford; Shotput—Won by Fields, Haverthird, Syres, Haverford. Time, 4 ford; second, Schramm, Ha.verford ;<br />\nminutes, 50 seconds.<br />\nthird, Kutcher, Hopkins. Distance,<br />\nOne-quarter Mile—First, Lung, 41 feet, 10 inches.<br />\nHopkins; second, Grenebeck, HopDiscus—Won by Fields, Haverkins; third, Reisner, Haverford. ford; second, Schramm, Haverford;<br />\nTime, 53.6 seconds.<br />\nThird, Burke, Hopkins. Distance,<br />\nTwo Miles—\\\\Ton by Shark, Hay- 114 feet, 9 3/4 inches.<br />\nTwo Miles—Won by Sherk, HavJavelin Throw—Won by Swan,<br />\nerford; second, C. Edgar, Haver- Haverford; second, Zuirk,<br />\nHopkins;<br />\nTime, 10 minutes, 32 seconds.<br />\nthird, Burke, Hopkins. Distance,<br />\nLow Hurdles—Won by Nasland, 163 feet, 10 inches.<br />\nHaverford; second, Stafford, Hop- High Jump—Won by Jones, Havkins; third, Scherd, Hopkins. Time, erford; second, Zuirk,<br />\nHopkins;<br />\n25.6 seconds.<br />\nthird, Brown, Haverford. Height,<br />\n220- Yards—Won by Lockard, 5 feet, 5 inches.<br />\nHopkins; second, Battey, HaverBroad Jump—Won by Ness,<br />\nHopkins; second, Wilson, Hopkins;<br />\nthird, Rice, Haverford. Distance,<br />\n21 feet 8 1/4 inches.<br />\nPole Vault—Won by Zuirk, Hopkins; second, Foley, Haverford;<br />\nScheed, Hopkins, tied.<br /><br />\nOur collection includes browns, blues,<br />\ngreens and gray-whites in all sizes<br /><br />\nHOCIISCHILD,KOHN<br /><br />\nDECORATIONS<br /><br />\nINTERIOR WOOD WORK<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\nShow Rooms<br />\n343 N. Charles Street<br /><br />\nFactory<br />\n600 S. Pulaski Street<br /><br />\nJ. H. FURST CO.<br /><br />\nWERGLEY'S<br /><br />\nPRINTERS OF<br /><br />\n2438 Charles St., North<br />\nLa Patisserie<br /><br />\nPhilological and Scientific<br />\nPublications<br /><br />\nSANDWICHES PAR EXCELLENCE<br /><br />\n23 S. HANOVER ST. BALTIMORE<br /><br />\nA \"High Mark)/<br />\nin Youthful Style<br /><br />\nThere is no comparison in High Standards<br /><br />\nSUITS $1.00—COATS $1.00<br /><br />\nKAYES'<br />\nCLEANERS and DYERS<br />\n32nd Street Cor. Abell<br /><br />\nCLOTHES<br /><br />\n3 Suits Sponged and Pressed $1.00<br />\nSuperior Work<br /><br />\n211-213 E. Baltimore St.<br /><br />\n• Lowest Prices<br /><br />\nPhone, Belmont 5816 and have our<br />\ndelivery car at your door<br /><br />\nBlow<br />\nthe Whistle<br />\n...::<br />\n::•••••?'•<br />\n•<br /><br />\n•<br /><br />\nC P. Lorillard Co.<br /><br />\nOLD GOLD cigarettes<br />\nin a<br /><br />\nstunning new velour<br /><br />\nDrink<br /><br />\nOCa<br /><br />\nbox<br /><br />\nDelicious and Refreshi<br /><br />\nuse<br /><br />\nfor the pa<br /><br />\nIf you could go to Paris... to clever French tabac<br />\nshops... you might find a cigarette box as smart as<br /><br />\nthat refreshes<br /><br />\nthis. Or maybe in Berlin... or Vienna. But now<br /><br />\nWhen you suffer from large and undiluted<br />\ndoses of your fellows. When the milk of<br />\nhuman kindness seems to sour. Blow the<br />\nwhistle for a minute's \"time out\" on your<br />\nown account, to pause and refresh yourself.<br /><br />\nOLD GOLD has caught the continental flair for pack-<br /><br />\naging ... dressed its familiar \"fifties\" package in<br />\n... and delivered it, for you,<br />\nthis golden velour paper.<br />\nto your nearest dealer's. It's a stunning box to keep<br />\non your study table...to pass to your friends..<br />\nor to take on trips. And it costs no more than<br /><br />\nIN--a---s—<br />\nGrantland<br /><br />\nRice<br />\nEamon.<br />\nSports Champion.'\",-Coca-Cola<br />\nOrchestra ...I-Every Wednesday<br />\n10:30to 11 pm.Eastern Daylight<br />\nSaving Time<br />\nCoast to<br />\nCoast NBC Network--'t.-<br /><br />\nIn other words, go into a huddle with a<br />\nglass or bottle of refreshing, delicious<br />\nCoca-Cola. It will make you captain of<br />\nyour soul again, ready to live—or die—<br />\nfor the dear old alma mater.<br />\nThe Coca-Cola Company, Atlanta, Ga.<br /><br />\nthe regular \"fifties\" tin. Now on sale everywhere.<br />\nIf dealer cannot supply,send 35ft to Old Gold, 119 W.40th St., New York<br /><br />\n9 MILLION A<br /><br />\nDAY—IT<br /><br />\nHAD<br /><br />\nTO<br /><br />\nBE<br /><br />\nGOOD<br /><br />\nTO<br /><br />\nGET<br /><br />\nWHERE<br /><br />\nIT<br /><br />\nIS<br /><br />"}], "field_media_file": [{"target_id": 38478, "display": null, "description": null, "target_type": "file", "target_uuid": "82c6f488-249c-4d44-aa55-1fcdc73f8c15", "url": "http://digital.library.jhu.edu/system/files/2022-03/12155-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12155, "target_type": "node", "target_uuid": "f6155565-394b-4fc2-8138-b582871c1c23", "url": "/node/12155"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "0ffc395b-47d0-4fdb-b89d-4701c3d68c79"}]}