{"mid": [{"value": 35603}], "uuid": [{"value": "a5afa1dd-f095-4b1f-95d0-fbac2eb4b0f2"}], "vid": [{"value": 35603}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:09:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12152-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:09:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:09:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "•Cbe news T. Letter. *<br />\nOctober 31, 1900.<br />\nDOWN AN ALPINE SLOPE.<br />\n<br />\nNo. 2.<br />\n<br />\ndown at the brake. The connection was perfect;<br />\nthe band drew tight over the drum; but the<br />\nOn our Strassenprofilkarte, a map that gives powerful brake had no more effect than a feather<br />\nrealistic pictures of the hills and mountains, the dropped on a wheel.<br />\npass that lay between us and Lucerne was only<br />\nIf I had known that the bell-boy who cleaned<br />\na quarter of an inch high with a gradual slope our wheel the night before had mistaken the<br />\nto the top, and Simplon and St. Bernard were unfamiliar mechanism for running-gear and had<br />\ngreat blotches of color. This disparity and the given it a liberal bath of oil,the strange behavior<br />\nsight of a stretch of the hard yellow road be- of the brake would have been less of a puzzle; it<br />\ntween the green hills persuaded Archie and would not, however, have been less terrifying.<br />\nArchie persuaded me, to scorn the railway with There was no braking with the foot, for the maits smoky tunnel and to follow the skyward chine, an English make, carried heavy mudroute on our tandem.<br />\nguards. No feet were nimble enough to catch<br />\nThe highway stretched at ease through little the spinning pedals now, and no muscles would<br />\nvalleys, wriggled like a climbing serpent over have been strong enough to check the momenknolls and spurs, and spread broad generous tum that grew as a fire spread in tinder. There<br />\ncurves on the mountain-side, leading us always was nothing to do but to wait and to wonder<br />\nupward until we stood perspiring and breathless what the end would be.<br />\non the summit. The shrill screech of a train as<br />\nMeanwhile the tandem tore down the winding<br />\nit left the tunnel came faintly up the mountain, road leaning far over at the turns until our<br />\nand presently we saw the tiny locomotive with bodies touched the leaves of road-side branches,<br />\na string of dumpy cars creep along a black line and lunging forward at a speed that made the<br />\nin the valley, and drag itself under the cover of wind roar in our ears. Great trees and ledges of<br />\ngroves of trees. A gleam of white walls and red rock flipped by in fleeting confusion. I found<br />\nroofs huddled together and a few wisps of noon- myself counting the red and white stripes of<br />\nday smoke showed us the village next on our Archie's shirt, and looking at the curly locks on<br />\nway toward the lakes, and beyond it the road his head bent low as he gave his strength to the<br />\nwas a narrow ribbon of shining drab.<br />\nsteering.<br />\nAt our feet the same highway was broad and<br />\nThe last turn had tried us to the utmost. I<br />\nsmooth, swinging in a wide safe curve down the knew that we could not make the next, and that<br />\nslope and out of view behind the trees. We the sharp bend must send us flying into the<br />\nshoved off and, trusting in a band-brake that woods like a stone loosed from a sling.<br />\nhad never yet failed us, coasted wide-open.<br />\nEven as I thought of the shock, it came; but<br />\nSlowly the heavy tandem gathered speed, leap- not as I expected. There was a sharp, quick<br />\ning eagerly forward as the road dipped at the snap, and I found myself plunged head first into<br />\nbend. The wind came rushing, chilled the per- the moist bed of a tiny stream with a whirling<br />\nspiration on our faces, and set the shirt-sleeves in my brain and a strange numbness setting the<br />\nfluttering on our arms. The chains began a fingers of my left hand a-tingle. Our tandem lay<br />\ncheerful hum, and we could feel the rhythmic in the middle of the dusty road, and the front<br />\nfling of the flying pedals grow faster and faster. wheel was slowly coming to a standstill, as if a<br />\nNow it was time to slow up, and I reached for passer-by had set it spinning. A little beyond<br />\nthe brake-grip and pressed a little. There was the wheel was Archie, lying face down and very<br />\nno response. I jammed it down hard, and for still.<br />\nWater from the stream revived him,and dazed<br />\nanswer the wheel shot forward around another<br />\npushed<br />\nus,<br />\nlooked<br />\nI<br />\nand trembling he struggled to his feet and tried<br />\ncurve as if some one had<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nto walk. At the first step he collapsed in my<br />\narms. A peasant,who had just rounded the turn<br />\nbelow us, offered his cart and drove slowly back<br />\ntoward the village with Archie, a bruised and<br />\nbattered passenger, nursing a badly sprained<br />\nankle.<br />\nThen I picked up the tandem. Pedals and<br />\nhandle-bars were gone from the left side as cut<br />\noff by giant shears, and the machine was otherwise uninjured. We had grazed a tall stone<br />\nmile-post that stood at the side of the road,<br />\ngrips and pedals had snapped like straw,and the<br />\nshock had flung us off to the right.<br />\nTwo rods below the road turned sharply, and<br />\nacross the wheel-tracks I saw a few feet of tufted<br />\ngrass, and then,—nothing but the distant hazy<br />\ngreen of the opposite side of the gorge. From<br />\nthe brink I looked far down into the tops of<br />\ntrees, and caught through an opening in the<br />\nfoliage the silver glitter of falling water that<br />\nmade no sound. If the friendly mile-post had<br />\nnot held out a rude hand to stop us in the nick<br />\nof time, our coast must have ended just here in a<br />\nwild plunge into the mountain-haze.<br />\nF.<br />\nsW<br />\n<br />\nWW<br />\n<br />\nODE TO BLACK AND BLUE.<br />\nI am a Hopkins man. You know my colors.<br />\nhurrah for glorious Black and Blue.<br />\nThe rooter across the gridiron holloas.<br />\n\"Know ye whence we these colors drew?\"<br />\nBlue is the merry sky<br />\nShining o'er our victory,<br />\nAnd Black is the dark o'er-arching night,<br />\nOn whose sable arch as stars shine bright,<br />\nThe H's of many a glorious fight.<br />\nOur enemies we smite so; so lively our hue,<br />\nThat they bear the reflection of the Black and the Blue.<br />\n1I--. 1901.<br />\nPlant patience in the garden of thy soul;<br />\nThe roots are bitter, but the fruits are sweet,<br />\nAnd when at last it stands, a tree complete,<br />\nBeneath its tender shade, the burning heat<br />\nAnd burden of the day shall lose control;<br />\nPlant patience in the garden of thy soul.<br />\nEx.<br />\nWWW<br />\n<br />\nA nice girl is not to be winked at.<br />\nHarvard Lampoon.<br />\n<br />\nWHAT IS COLLEGE SPIRIT?<br />\nEditor of the. News Letter: Concerning the<br />\ndiscussion of college spirit in your last issue, will<br />\nyou allow me the use of your columns for a<br />\npresentation of a definition of the words,forma-.<br />\nlated after the experience of several years at<br />\nHopkins? The humor of \"Freshman's\" remarks was apparent, but the sense was superficial. foolish and fallacious, \"College Spirit\"<br />\nin its true sense, stands for college fun and college worship. Standing for college fun it is the<br />\nemblem offree, independent minds enjoying the<br />\nfullest extent of straightforward, highmindecl<br />\npleasures; it is the incentive and producer of<br />\nthose enjoyments which college life offers, and<br />\nwhich no other branch of life affords. But<br />\nit is less emblematic of college fun than college<br />\nworship. It not merely requires the interest<br />\nof college at heart, and evidences of this interest; but also implies willingness for self sacrifice,<br />\nand readiness for the resolute denial of personal<br />\nadvantage if necessary to further the interests<br />\nof college.<br />\nFrom this abstract exposition of the term,<br />\nit is clearly seen that the pleasures of college life<br />\nare essentially of one's own making; that college spirit is entirely dependent on the individual efforts of the student; and that it is not a<br />\ntangible something floating around in the air<br />\nready to be gathered in by inactive young men.<br />\nThough the embryo is always present in the<br />\nvery atmosphere of a college, it requires to be<br />\nfostered by delicate attentions, and is not to be<br />\nseized without strenuous effort. Just as a man's<br />\nsuccess in life depends on his own exertions, so<br />\nthe pleasures derived from college spirit are entirely dependent on the attitude of the collegian;<br />\nfor college spirit, of all things, does not exist<br />\nof its own accord, but is made.<br />\nThe fact that a college is without dormitories<br />\nis by no means evidence final or conclusive<br />\nenough to establish a reputation for lack of<br />\nspirit. The pleasures of dormitory life are by no<br />\nmeans to be slighted, yet the lack of excitement<br />\nthus furnished is fundamentally only a superficial want, as the pleasures thus derived are<br />\nmainly superficial signs of college spirit, which<br />\nmay or may not indicate the deep-rooted pres-<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n41<br />\n'<br />\n<br />\nence of the true sentiment. The one great advantage of dormitory life is the promulgation of<br />\nassociation between man and man; advantages<br />\nwhich to a certain extent are lacking where the<br />\nstudents only work together fifteen hours per<br />\nweek. College spirit requires class spirit, and a<br />\nfraternal unity of feeling in the student body as<br />\na whole. Every man's motto at college should<br />\nbe: \"my college, my class, and then myself.\"<br />\nThe fundamental value of class contests lies in<br />\nthe spirit of oneness produced not only in each<br />\nclass but between the t No contestants. Class<br />\ncontests undeniably unite classes, and rrtake<br />\nmembers feel that they are a vital part of the<br />\nclass and of the institution; and this feeling<br />\nmust be established before any enjoyable demonstration of college spirit can be successfully<br />\nmade. A thoroughly organized class is thc best<br />\nnatural means of producing interest in other<br />\naffairs, as the immediate organization of Freshmen at Hopkins has year after year proved.<br />\nManifestations of college spirit should be made<br />\non every occasion. Here at Hopkins,the Football,<br />\nLaCrosse and Track and Field Teams are always<br />\nin need of men. If you are not heavy enough to<br />\nplay football, then unless you are totally unfit,<br />\nbecause of physical weakness, for any athletic<br />\nsport, at least make a hearty attempt for the<br />\nother teams. It is the plain duty of every man<br />\nto his alma mater: but of course only a small<br />\npercentage of the students enrolled at any college can make the athletic teams. The rest<br />\nshould make up the band of loyal supporters<br />\nwithout whom no team, however strong, can<br />\nachieve success. It is the experience of all ath_<br />\nletes that a band of enthusiastic \"rooters\" is<br />\nthe best incentive to good work. The record of<br />\nthe student body as\"rooters\"last year was far<br />\nmore creditable than ever before in the history<br />\nof dear old Tom Hopkins; they witnessed more<br />\ngames, and had a more systematic manner of<br />\ngiving vent to songs and yells than in former<br />\nyears. When the football team went up to<br />\nWestminster to contest with Western Maryland<br />\nCollege for the championship of the I. A. A. of<br />\nMd.,thanks to the efforts of the management to<br />\narouse interest and the liberal response of undergrads and graduate students, a party of about<br />\none hundred took the trip, and like a Roman<br />\n<br />\n3<br />\n<br />\ncentury swept everything, including the town<br />\nand the championship, before it, in its majestic<br />\ncourse of glory. I might mention two all-important facts here: that occasion was momentous<br />\nin its inauguration of united support of teams<br />\nby the students, and incidentally every member<br />\nof the party had a royal good time. There will<br />\nbe occasions this year for similar demonstrations. On Saturday, November 24th, Hopkins<br />\nplays St. John's College, at Annapolis, and it<br />\nwill require great efforts on our part to snatch victory from their strong team. Let the precedent<br />\nof 1899 be followed,let an even greater crowd accompany the team, so that such occasions shall<br />\nbe traditional in future years for the great outpouring of the people.<br />\nThere are other means besides athletics for<br />\nthe display of college spirit. You know all<br />\nabout the unexcelled record of the musical clubs<br />\nlast year. The NEWS LETTER and the Hullabaloo are both college institutitions that, though<br />\nby no means faultless, reflect credit on the<br />\nUniversity. Surely it is an evidence of college<br />\nspirit to contribute some article or articles to<br />\nthese noble examples of contemporaneous literature. The pleasure of writing for these representative Hopkins institutions should not be<br />\nleft entirely to the editors, who, as I have frequently seen in the columns of the NEWS LETTER, earnestly desire the active co-operation of<br />\nthe general student body. That you subscribe<br />\nI take as a matter of course.<br />\nI have said that colleges pint is college worship and college fun; but I should have said college worship and the fun derived from such worship. The religions of the ancients were filled<br />\nwith forms and ceremonials, but the true religions were deeper-rooted in the hearts of the people because they worshipped at a common shrine'<br />\nCollege fun is an essential of college life, but the<br />\ntrue spirit, which I have tried to make clear,<br />\nshould prompt all fun. The practice of such college spirit will produce infinite pleasure in college and in after life, present tangible enjoyments, and future recollections.<br />\nBut above all else,remember that college spirit<br />\nis dependent on you and you alone.<br />\nAN OLD COLLEGE STUDENT,.<br />\nB. O. K.<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\ntbe 14ewsaetter.<br />\n<br />\nPublished Fortnightly during the University Year<br />\nby the<br />\nStudents Of THE JOHNS HOPKINS UNIVERSITY.<br />\n<br />\nOCTOBER 31, 1900.<br />\nSubscription $1.50 per year.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\n.<br />\nAssistant Business Manager,<br />\n<br />\nio cents a single copy.<br />\nNORMAN BOYER, 1901.<br />\nJOHN M. BOOKER, 1901.<br />\nI J. GRESHAM MACHEN, 1901.<br />\nBEEN C. HILL, 1902.<br />\nSOL STROUSE, 1902.<br />\nWILLIAM B. HILL, 1902.<br />\nJOHN A. SLEMONS, 1902.<br />\n.<br />\nJOHN M. HANDEL, 1901.<br />\n. AUBREY PEARRE,JR., 1902.<br />\n.<br />\n<br />\nI<br />\n{<br />\n<br />\nAddress all articles, communications, etc., to NORMAN<br />\nBOYER,<br />\nbox 96,johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be<br />\nsent to<br />\nJOHN M. HANDEL, box 92,,j. H. U.; or box 398, Medical<br />\nSchool of<br />\nJohns Hopkins Hospital.<br />\n<br />\nThe NEWS-LETTER is much gratified at the<br />\ncordial way in which the first issue was received<br />\nby the student body. An enforced delay in the<br />\ndistribution of the issue called forth many inquiries as to the why and wherefore,which were very<br />\ngratifying to the staff, as showing that the paper<br />\nhas won the favor and confidence of the students.<br />\nThe year ending in June was the most prosperous and marked by the greatest progress of any<br />\nyear in the history of the paper. The kindly inter<br />\nest shown enables us to hope that the tone of<br />\nthe NEWS-LETTER may be continually improved,<br />\nand always be, as has been said, \"an honor to<br />\nthe students and a credit to the University.\"<br />\nLet all non-subscribers consider the suggestion,<br />\nfor there is a very simple way by which they can<br />\npromote this end.<br />\nor or or<br />\nActive, proselyting political clubs are a new<br />\nfeature of life at the University, hatched in the<br />\nstrenuous times of the national campaign. By<br />\nsome the organization of clubs by the followers<br />\nof the two rival parties is not regarded es an<br />\nunmixed blessing, but the election is only a few<br />\ndays distant, and we can stand it until then.<br />\nThe superfluous enthusiasm and any pugnacious<br />\ninclinations of the rival partisans will find a<br />\nsoothing antidote in the bosom of the third party<br />\norganization, the self-styled \"empty mug gang\"<br />\nwhose efforts for the \"advancement of morality\"<br />\n<br />\nshould be aided by all adherents of the G. G. G.<br />\nThe base suggestion has been made that the<br />\nNEWS-LETTER lend itself to the furtherance of<br />\none or the other of these partisan movements.<br />\nTo our correspondent let us say that while the<br />\neditorial pen has some distinct views on the desirability of annexing Highlandtown and extending the blessings of civilization and benevolent _<br />\nassimilation to the hoodlums of the 3rd ward,<br />\nyet no yellow journalism shall pollute our pages.<br />\n<br />\nIt is a sight for gods and men nowadays to see<br />\nthe Senate and House applaud a fine speech or a<br />\npopular election. No \"full mouthed roar\" now<br />\nascends to the vaulted roof to reverberate<br />\nthroughout the halls, but instead we have a gentle fluttering of kerchiefs, dainty kerchiefs, lace<br />\nedged kerchiefs, clean kerchiefs—and others,<br />\nwhich agitate the quiet air of the dignified bodies<br />\nno more than the falling of a feather. \"Ay, it<br />\ndoth amaze me\" to see to what ends are such<br />\nthings come. We shall soon be brought to the<br />\npass of cheering on our football and lacroSse<br />\nteams with such Chautauquan methods,and the<br />\ncrouching backs, turning, before hitting the line<br />\nfor ten yards, to see if their rooters are applauding, will be unable to tell whether the white<br />\nobjects in the grand stand signify people reading<br />\nnewspapers or students waving towels at them.<br />\nHorribile dictu!<br />\n<br />\n.A0<br />\nIt is conceded without any dissent that our<br />\n\"Chief Rooter\" is the right man in the right<br />\nplace. The rooting at Hopkins contests took on<br />\na new color when a regularly elected head was<br />\ngiven it two years ago, and the present incumbent has devoted all hisenergies to his task, with<br />\nthe result that the rooting has constituted one<br />\nof the chieffeatures of all our recent games. Let<br />\nus all give him our heartiest support.<br />\nA corner of thegrand stand crowded with men<br />\nshouting in unison college yells and impromptu<br />\nand witty stunts is in the highest degree effective.<br />\nTo be a good rooter may be as useful and as<br />\nhonorable as to be a good player. As a certain<br />\nlate Mr.Pope used to say. \"Act well your part;<br />\nthere all the honor lies.\"<br />\n<br />\n\f1<br />\n<br />\nTHE NEWS-LETTER.<br />\nPUBLIC LECTURES FOR 1900-1.<br />\nThe Johns Hopkins University has this year<br />\nplanned a more comprehensive course of public<br />\nlectures than has ever been provided in previous<br />\nyears. Both the time and the subjects for these<br />\nlectures have been chosen with great care and<br />\nattention to the needs of the various students.<br />\nOne great advantage in these lectures is the fact<br />\nthat no previous knowledge of the subject is assumed, and so all enter the courses unhandicap.<br />\nped.<br />\nThe courses which have been made ktiown in<br />\ndude a course in Maryland history, by Dr.<br />\nCharles W.Somerville, a graduate ofJohns Hopkins. His subjects are Maryland men of the<br />\nColonial period, including Francis Nicholson,<br />\nDaniel Dulany, John Hanson, John Eager<br />\nHoward, Luther Martin and Robert Goodloe<br />\nHarper.<br />\nThe second course will be delivered by Dr.S. E.<br />\nForman, and will be especially for teachers,<br />\ntaking up all lines of pedagogy. Dr.Guy Carleton<br />\nLee will give a course of six lectures on English<br />\nhistory. Dr. Frederick H. Sykes, a graduate of<br />\nJohns Hopkins, will lecture on Shakespeare.<br />\nA course in Latin will be given under Prof.<br />\nKirby F. Smith.<br />\nDr. Jeffrey R. Brackett,president of the Department of Charities of Baltimore, will give 10 lectures on problems of public charities and correction, with particular reference to conditions in<br />\nthe United States. Dr. J. S. Ames, professor of<br />\nphysics, will give a course of 20 lectures on<br />\nselected topics in physics,accompanied by demonstrations. Dr.Edward Renouf, will give a course<br />\nof 20 lectures on chemistry in daily life. Dr. 0.<br />\nL. Fassig, will give a course of 20 lectures on the<br />\nphenomena of the atmosphere. Dr.J. S.Johnson,<br />\nwill give a course of 20 lectures on the structure<br />\nand life history of mosses and ferns, each lecture<br />\nbeingfollowed by instruction in laboratory work.<br />\nThe first lecture of the series will be given on<br />\nFriday evening, November 2d, in McCoy Hall.<br />\nThe course on Maryland history is given by<br />\nthe generosity of the Maryland Society of Colonial Dames, who have presented the University<br />\nwith an endowment for that purpose.<br />\n<br />\n5<br />\n<br />\nIVIEMWARS FROM THE BIALOGIKILL<br />\nLABRITORY.<br />\nBy J. SCRUBBRUSII GARDINER.<br />\nFellow by courtesy in the Royal Society of Janitors.<br />\n<br />\nI. One of the first things that the new men<br />\nlearne is thet Biolergy aint no joke.<br />\nII. The departmint has more men than ever<br />\nbefore which is remarkabill, because the wurrk<br />\nis jess what it allus uster be.<br />\n/II. Green-fly (Apis Rosae) is found on rosebushes, accordin' to the authorities. A recint<br />\ninvistigater found thim in reasonabill numbers<br />\non the innermost of the four gartnints of which<br />\nthe vest is one.<br />\nIV. The Pollytix of the departmint is walking<br />\nthe tight rope. One day the talk was on Bryan,<br />\nand the nixt on McKinley,and each night I found<br />\na quarter under me door. Whativer happins,<br />\nI'm for free Silver.<br />\nV. I looked at a picture of Darwin the other<br />\nday and he wasn't so wonderful. Any lookin'<br />\nglass could a told him that story about the man<br />\nand the monkey.<br />\nVI. The latest 'Departmintal Ditty' is:<br />\nMyxonycetes<br />\nHowdy do,<br />\nBryozoa<br />\nJ. H. U.<br />\nVII. In a recint dissiction a fiver wasfound in<br />\nthe stomach of a dog-fish. Since then fifteen<br />\nmen has applied for admission to the major<br />\ncoarse.<br />\nVIII. In an .expiriment to find out whether a<br />\nbottil full of ether was insensitive to the influence<br />\nof a lighted match, it was proved that the use<br />\nof anisthitics can be ixtinded to inanimit objects,<br />\nbut that it can't be counted on.<br />\nIX. The reason why biolergists sing durin'<br />\nlabritory hours is one of the thesis subjicts for<br />\nthis year.<br />\nX. The sirvival of the fittist don't hold in<br />\nbiology. Thim that flunks survives around yer<br />\nlonger than any of them.<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS-LETTER.<br />\nFABLES FOR THE FOOLISH.<br />\nI.<br />\n<br />\nOnce on a time all the young animals, having<br />\nbecome versed in the flora and fauna of their<br />\nnative woods, said, one to another, let us now<br />\nlearn to reason, let us give ourselves over to the<br />\nstudy of logic. Straightway they repaired to a<br />\nlearned and benevolent griffin, who with the welfare of the young animals much at heart, was<br />\nmost pleased to impart the necessary instruction.<br />\nDaily they wended their way to his wood-seated<br />\nhaunt where they discussed many intricate propositions, made many intricate notes in their<br />\nbooks of guzzywee skin, and asked many unanswerable questions. At length one of the young<br />\nlogicians turned to his companion and said:<br />\n\"Tell me, I pray thee, what all this is about?\"<br />\n\"Verily,\" responded the bookerbus, \"I do not<br />\nknow.\"<br />\n\"Nor I,\" quoth the tom-tom.<br />\nWhereupon they all relapsed into attentive<br />\nsilence, with wise looks upon their faces, and<br />\nmuch confusion in their animal brains.<br />\nW<br />\n<br />\nIL<br />\nOn another occasion the animals,having great<br />\ndesire to become proficient in the art of public<br />\naddress, resolved themselves into an assembly<br />\nafter the manner of men, and secured as their<br />\ncensor a tetra-tongued animal from the bogs of<br />\nthe Rungleweed Rot. Now it happened that the<br />\nmost convenient place for assembly was in the<br />\nshade of the bingle tree, on the branches of which<br />\nthe birds of the rare were wont to sit and sing.<br />\n\"Truly,\" said the tetra-tongued censor from<br />\nthe bogs of the Rungleweed Rot, \"it is unbecoming that we disturb the singing of our<br />\nfair and feathered neighbors by untempered<br />\napplause. Let us devise then some new and<br />\nenlightened method. Instead of the growls of<br />\nthe saylerbus or the pawing of the pingwees,<br />\nhereafter we shall express our expression by the<br />\nwaving of pocket-handkerchiefs.\"<br />\nAll the animals having given assent to this<br />\nhappy suggestion,the proceedings were resumed<br />\nand the oration of the zingbutt.<br />\n\"Now,\"said the tetra-tongued censor from the<br />\nbogs of the Rungleweed Rot,upon the conclusion<br />\n<br />\nof the masterful oration of the Zingbutt, \"let us<br />\napplaud!\"<br />\nWhereupon, the animals, with one accord,<br />\nreaching for their handkerchiefs were amazed to<br />\nfind that they had no pockets, and there was so<br />\ngreat a silence that the birds of the rare ceased<br />\nin their singing to listen, and the heart of the<br />\nZingbutt was turned into punk.<br />\n<br />\nTHE WILLYBILL.<br />\nW<br />\n<br />\n\"COLLEGE SPIRITS\" AGAIN.<br />\nIt was with no intention of arousing a controversy or throwing fuel on the slumbering fire of<br />\nclass feeling that we printed \"A Freshman's'letter in our last issue, and we hope the authori'<br />\nties will duly note thisinteresting bit of information. But to have printed \"A Freshman's\"letter<br />\nand not give the world a letter we have received<br />\nsigned \"A Junior\" would knock a disastrous<br />\nhole in the NEWS-LETTER'S bulwark offair play.<br />\nLet the Junior then, take the floor.<br />\nMr. Editor: If you want to make \"Improvement the order of the age\" for your \"NEWS-LETTER,\" let me respectfully suggest that you hereafter exclude from your columns such correspondence as \"A Freshman.\" If there could be any<br />\nbetter argument for the necessity of some kind of<br />\nhazing I would like to see it. Oh, yes, Mr. Editor, the junior class will entertain the freshmen<br />\nat a feed and we will give them all gold medals<br />\nengraved \"For good conduct and perfect lessons,\"<br />\nand then the seniors will give them a dance, and<br />\nfinally the President will invite that verdant<br />\nclass to meet the Faculty for their mutual edification. The whole thing, Mr. Editor, is simply<br />\npreposterous. The freshman class ought to pass<br />\nresolutions disclaiming \"A Freshman's\" gaul as<br />\nrepresenting the spirit of his class. Don't give<br />\nus any more of this swash in the NEWS-LETTER.<br />\nYours truly,<br />\nA JUNIOR.<br />\nP. S.—\"A Freshman's\" English is about on a<br />\npar with his Latin. But homini est errare!<br />\nw w or<br />\nA typographical error in the last issue announces that a Freshman Scholarship has been<br />\nawarded to J. W. Beajan. The proper spelling<br />\nwas J. W. Bryan.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nvisilimitations of the game applied only to the<br />\n.<br />\nshame<br />\ntheir<br />\nting eleven. And they gloried in<br />\nd<br />\nscore<br />\nnians<br />\nVirgi<br />\nDuring the second half, the<br />\nThe final score of the Virginia game (40-0),<br />\ntheir<br />\nions<br />\nposit<br />\nal<br />\n. They put in sever<br />\ngives one the impression of a steady movement four times<br />\n, which is as strong as the 'Varsity,<br />\nscrub<br />\nfresh<br />\nat<br />\ntowards the Hopkins goal posts amounting<br />\nd the latter several tie games. Hoptimes to a continuous performance of almost having playe<br />\nthough evidently \"worn to a frazzle,\" hung<br />\nkaleidoscopic rapidity. For the first ten min- kins<br />\nin Lloyd's timekeepers saw that<br />\nutes this was not the case. During that time on until Capta<br />\nhter was beginning to pall on the specHopkins held the heavier Virginia eleven with the slaug<br />\ns, and that even the fresh Virginia scrub<br />\nspirit and determination. Then Virginia scored tator<br />\ning weary. Then they called time.<br />\nand the Black and Blue went up in the air—way, was grow<br />\nIf you<br />\nThere is one comfort about the game.<br />\nway up.<br />\nhave<br />\nmight<br />\nit<br />\nn,<br />\nnatio<br />\ng enough imagi<br />\nThe ascension was due to two causes, viz: the have a stron<br />\nworse.<br />\ngreenness ofthe Hopkinsline: the general suprem- been<br />\nising our eleven from an ultra amateurish<br />\nCritic<br />\nthe<br />\nof<br />\nacy in weight, training and experience<br />\npoint,I would say that Riggs and Meadows<br />\nVirginia team. Four times during the first part stand<br />\nour best game behind the line, and Hanof the first half did the Black and Blue get the played<br />\n(especially after he was hit in the mouth)<br />\nball almost on her goal line, and four times cock,<br />\nd the game on the line.<br />\nRiggs kicked to a place of safety. Then the and Humphreys, playe<br />\nsecond half and retired<br />\nthe<br />\nin<br />\nweight of the Virginia line, with its celebrated Meadows was hurt<br />\ndid well. Humphreys<br />\nwho<br />\ntackles, Walker and Lloyd, began to tell, and in favor of Sharretts,<br />\nat the sixth jolt reand<br />\ntimes<br />\nthree goals were scored in the last ten minutes was laid out five<br />\nrse. The ends<br />\nConve<br />\nof<br />\nfavor<br />\ntired unwillingly in<br />\nof the first half.<br />\npie who was<br />\nGilles<br />\nally<br />\nespeci<br />\nThe intermission was spent in much needed re- played brilliantly,<br />\nthan offenively<br />\ndefens<br />\nr<br />\nbette<br />\nd<br />\npairs and a severe but possibly just criticism of sick. Nelson playe<br />\nhalf, and<br />\nd<br />\nsecon<br />\nthe<br />\nin<br />\nthe officials. Captain Lloyd, of Virginia, who sively. He was hurt<br />\na strong<br />\nup<br />\nput<br />\nplace,<br />\nhis<br />\nhad evidently used up all his latent good man- Atkinson, who took<br />\n, game.<br />\nners and decency on previous visiting teams<br />\nn and<br />\nupon<br />\nmine<br />\ndeter<br />\nHopkins line up: Ends: Gillespie, Nelso<br />\ncould<br />\nipse,<br />\nhe,<br />\ns<br />\nsaid that unles<br />\ns:<br />\nGuard<br />\n.<br />\nBacon<br />\nand<br />\nnck<br />\n.Bla<br />\nthe umpire, the referee, the timekeepers, the line- Atkinson. Tackles:<br />\ne:<br />\nCentr<br />\nrse.<br />\nConve<br />\nand<br />\ns<br />\nhrey<br />\nmen, and the length of the halves; he wouldn't Whitman, Hump<br />\netts.<br />\nSharr<br />\nand<br />\nows<br />\nMead<br />\ner:<br />\nplay. These are merely his closing words. The Hancock. Quart<br />\nl Backs: Riggs, Bruton and McClintock.<br />\ngreat body of his speech is not worth the carefu<br />\nnecesediting and expurgation which would be<br />\nprivihis<br />\nthat<br />\ned<br />\nclaim<br />\nHe<br />\nn.<br />\ncatio<br />\nsary for publi<br />\n\"do<br />\nto<br />\nhim<br />\ned<br />\nallow<br />\nhost)<br />\na<br />\nas<br />\nlege (probably<br />\nCROSS COUNTRY RUN.<br />\nnia!<br />\nVirgi<br />\nfrom<br />\nthis<br />\nAnd<br />\ned.\"<br />\nleas<br />\nwhat he—p<br />\nbody<br />\nand<br />\nHis remarksso thoroughly impressed every<br />\nTwelve men, candidates for the Track<br />\nbor<br />\nneigh<br />\nhis<br />\nwith<br />\ndo<br />\nto<br />\nion<br />\nminat<br />\ndeter<br />\nand<br />\nnd<br />\nwith his<br />\nEngla<br />\nT.<br />\nJ.<br />\nby<br />\nd<br />\npanie<br />\nst, Field Team, accom<br />\nto<br />\nout<br />\nd<br />\nto the limit that Captain Sayler,after a prote<br />\nwalke<br />\n,<br />\nteam<br />\ns<br />\nyear'<br />\nlast<br />\nP. Wroth,Jr., of<br />\nunder<br />\ngame<br />\nthe<br />\nplay<br />\nto<br />\ned<br />\nallow<br />\nbe<br />\nwas glad to<br />\nes St. Avenue and Belvithe Electric Park via Charl<br />\nany terms. Captain Lloyd decided that<br />\nwitness Saturday's footto<br />\ntime<br />\nminutes. dere Avenue, in<br />\nhalves were to be twenty and fifteen<br />\nsix miles and a half,<br />\nnce,<br />\ndista<br />\nball game. The<br />\nthink<br />\ncan<br />\nyou<br />\ner<br />\nnumb<br />\nlarge<br />\nany<br />\nby<br />\nthis<br />\nMultiply<br />\nand a half. Those<br />\n. was covered in an hour<br />\ngame<br />\nthe<br />\nof<br />\ntime<br />\nl<br />\nactua<br />\nthe<br />\nget<br />\nwill<br />\nof and you<br />\nand Hayden,<br />\nforming the party were Randolph<br />\nin<br />\nCapta<br />\nthat<br />\ns,<br />\nthesi<br />\nparen<br />\nin<br />\nk,<br />\nremar<br />\nI might<br />\nThatcher,(Grad.); Baetup (Medicals); Barret and<br />\nlived<br />\nThey<br />\npart.<br />\nthe<br />\nd<br />\nlooke<br />\nals<br />\noffici<br />\nLloyd's<br />\nHopper, Adler,<br />\njer, Snowden, Plaggemeyer,<br />\nns.<br />\ntatio<br />\nexpec<br />\n's<br />\nLloyd<br />\nin<br />\nCapta<br />\nto<br />\neven<br />\nto our and<br />\nFreshman Class.<br />\nBryan, Smith and Libby of the<br />\nand<br />\nrules<br />\nthe<br />\nthat<br />\nple<br />\nprinci<br />\nthe<br />\non<br />\ned<br />\nThey work<br />\n<br />\nTHE VIRGINIA GAME.<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER<br />\n<br />\nBird. There are also Messrs. Tottle, from St'<br />\nl<br />\nJoseph's; Licking, from the Westchester Norma<br />\nThe new track and field team work began last School; Humerichouse and Blum.<br />\nCaptain Hoffman has revived the cross country<br />\nweek, and gradually the candidates are getting<br />\ninto shape. Director Mackdermott has insti- walks, the first of which was taken on last Sattuted a course of preliminary training and the urday afternoon. These walks are very benemen are all enthusiastic over the outlook, ficial and every member of the team should<br />\nnotwithstanding the severe losses of the team endeavor to go on one, whether it is convenient<br />\nfrom its membership of last year. Besides for him to do so or not.<br />\nwww<br />\nthose mentioned in the last issue of the NEWSLETTER thefollowing have returned and will work<br />\nLACROSSE OUTLOOK.<br />\nharder than ever for the success of \"Johnny'<br />\nThe plans of the management for the coming<br />\nHopkins: J. T. England, quarter-miler; G. B'<br />\nlacrosse<br />\nseason are slowly crystallizing. Mr.<br />\nScholl, jumper; Henry Becuwkes, sprinter; J. E.<br />\nByrne<br />\nis<br />\nbusy preparing his schedule of games<br />\nTyler, quarter-miler; Peregrine Wroth, half_<br />\nand<br />\nCaptain<br />\nTyler is taking out squads of men<br />\nmiler; L. G. Fishach, pole vaulter; F. H. Watto<br />\nDruid<br />\nHill<br />\nPark and is giving them practice<br />\nson, sprinter and quarter-miler; W. E. Hoffman<br />\nin<br />\ntipping<br />\nand<br />\nother light work.<br />\nW.<br />\nSimmons,<br />\n(now captain), quarter-miler ; W.<br />\nThe<br />\nnumber<br />\nof<br />\ngames to be played has not yet<br />\npole-vaulter; C. W. Young, vaulter and quarter_<br />\nbeen<br />\ndecided,<br />\nbut<br />\none thing is assured: there will<br />\nmiler, and H. Whitman, sprinter, quarter-miler<br />\nbe<br />\nno<br />\ngame<br />\nwith<br />\nStevens Institute this year.<br />\nholds<br />\nthe<br />\nand weight man. L. G. Fishach<br />\nThe<br />\nFaculty<br />\nhas<br />\ndecided<br />\nthis question.<br />\nrecord with the pole. Whitman, Hoffman and<br />\nNext<br />\nmonth<br />\nthe<br />\nInter-Collegiate<br />\nAssociation<br />\nEngland are tried runners.<br />\nwill<br />\nmeet<br />\nat<br />\nPhiladelphia<br />\nand<br />\nit<br />\nis<br />\nlikely that<br />\nof<br />\nCaptain<br />\nWoodruff<br />\nthe<br />\nteam<br />\nBesides the loss<br />\nStevens will be \"chucked\" and the University<br />\nheavy<br />\nlosses<br />\nas<br />\nfollows:<br />\nsustained<br />\nother<br />\nhas also<br />\nof Pennsylvania or Swarthmore, or perhaps<br />\nCapt. Howard Baetjer, whose high jump,5 feet<br />\nboth<br />\nwill probably fill the gap. All things point<br />\n11 inches, is the best ever made by a Marythat<br />\nway and a four club league will make<br />\nlander, Walter Carroll's, of Princeton, excepted;<br />\nthings<br />\nmuch more interesting than the old three<br />\nC. R. McInnes, who developed a quarter-mile<br />\nclub<br />\none.<br />\nspeed of 54 seconds; C. T. Harris, the big fellow<br />\nCoach Maddren positively states that he will<br />\nwho won nearly all of the Hopkins points with<br />\nnot<br />\nplay this year, and \"Mac\" has secured an<br />\nthe weights, and G. L. Radcliffe,the old quarter<br />\ninstructorship<br />\nin a Canadian college. So the<br />\nmiler. However, several gains have been made<br />\npositions<br />\nof<br />\ncover-point<br />\nand in-home as well as<br />\nby the team. Robert Garrett has returned to<br />\nthe<br />\nvacancy<br />\ncaused<br />\nby<br />\nFoster's<br />\ngraduation will<br />\nthe University and can be expected to win all the<br />\nhave<br />\nto<br />\nbe<br />\nfilled<br />\nby<br />\nnew<br />\nmen.<br />\nNearly all the<br />\nfirsts in the shot,hammer and discus events,and<br />\nother<br />\nmen<br />\nhave<br />\nreturned<br />\nand<br />\nSayler<br />\nwill also be<br />\nplaces in the broad and high jumps. Theodore<br />\nin<br />\ncondition<br />\nto<br />\nplay.<br />\nRiggs'return is almost providential in supplying<br />\nHowever, the outlook has been as \"blue\" as<br />\nsome substitute for Captain Woodruff. Many<br />\nthis<br />\nbefore and we may hope that the Black and<br />\ngains have also been made among the men who<br />\nBlue<br />\nwill land another championship banner this<br />\nrecently matriculated. Atkinson, of Marston's<br />\nyear.<br />\nschool, will be an addition to the sprinters, and<br />\nw w<br />\nE. L. Pessagno is one of the best broad jumpers<br />\nThe Freshman have elected R.Curzon Hoffman,<br />\nin the State. F. C. Blanck, of the West Branch Jr., manager, and A. B. Atkinson, Captain of<br />\nY. M. C. A., is also a valuable addition to the the class eleven.<br />\nwww<br />\njumpers. Among the Freshmen from whom a<br />\nOil<br />\nportraits<br />\nalways<br />\ndeveloped,<br />\nare<br />\nof<br />\nnearly<br />\nProfessors<br />\nRowland and Adams<br />\nis<br />\ntwo<br />\nwinner or<br />\nMessrs. Branch, Pagon, Hunley, Snowden, have been hung in the Physical lecture room and<br />\nBryan, Hopper, Marshall, Smith, Miller and in the main corridor of McCoy Hall,respectively.<br />\n<br />\nTRACK AND FIELD TEAM.<br />\n<br />\ni<br />\n<br />\n\f9<br />\n<br />\nTHE NEWS-LETTER.<br />\nATHLETIC COMMITTEE ELECTIONS.<br />\nAt an enthusiastic meeting of the Hopkins<br />\nAthletic Association held on Friday, the 26th, in<br />\nHopkins Hall, the following offiers were elected<br />\nto serve upon the athletic committee for the ensuing year:<br />\nProf. Renouf.<br />\nFaculty Delegate,<br />\nWm. Mackdermott.<br />\nPhysical lInstructor,<br />\nAlumnus<br />\nDelegate, Jas. Hodges,'86.<br />\nTheo. F. Riggs.<br />\nMedical School \"<br />\nR. F. Mulford.<br />\nGraduate<br />\nWm. Maddien.<br />\nPresident,<br />\nRobt. Garrett.<br />\nVice-President,<br />\nSecretary, Robt. Crane.<br />\nRecording<br />\nWm. B. Hill.<br />\nCorresponding \"<br />\nR. T. Abercrombie<br />\nTreasurer,<br />\nfHorace Whitman.<br />\nSenior Class Delegates: tAlfred W. Bruton.<br />\nfHorace Gillespie.<br />\nJunior \"<br />\nJoseph England.<br />\nA. B. Atkinson.<br />\nFreshman Class \"<br />\nThe constitution was amended to admit of the<br />\nelection of two secretaries instead of the usual<br />\none officer.<br />\nW ser<br />\n<br />\nJ. H. U.,6:P.& S.,0.<br />\nIn an interesting game, Saturday, at Electric<br />\nPark, Hopkins with a seriously weakened team,<br />\nsucceeeded in defeating the College of Physicians<br />\nand Surgeons to the tune of 6 to 0. Hopkins<br />\nwent into the game badly crippled, for not only<br />\nwas she short two backs, McClintock and<br />\nRiggs, quarter-back, Meadows,and centre, Hancock, but several of the players who did enter<br />\nthe game were below their usual form on acccount of injuries sustained. The doctors had<br />\ngotten together their eleven only the Saturday<br />\nbefore, and consequently the team was semewhat new at the game. Hence the weakness of<br />\none side counterbalanced that of the other. In<br />\nthe game Hopkins clearly outplayed the P.& S.,<br />\nour interference being far superior to theirs, and<br />\nour backs doing decidedly better work. Tyler,<br />\nalthough a man who has been out of the game,<br />\nmade several splendid end runs, while captain<br />\nSayler, although injured, made the \"star\" play<br />\n<br />\nii<br />\n<br />\nof the afternoon by running three-fourths the<br />\nlength of the field, going through the entire<br />\nP. & S. eleven and scoring the only touchdown<br />\nof the game. Butler, Hopkins old standby, went<br />\ninto the game for the first time this season, and<br />\nmade his presence felt by opening up the P. & S.<br />\nline for heavy gains. Whitman took Hancock's<br />\nposition at centre, and Morse replaced Meadows<br />\nat quarter. The doctors line outweighed the<br />\nBlack and Blue, but notwithstanding this difference in weight, our men held fairly well. Everybody was expecting to see Hopkins score in the<br />\nsecond half, but although on one or two occasions she carried the ball to within 10 or 12<br />\nyards of the P. & S. goal, for some reason or<br />\nother, another touchdown wasn't made,the ball<br />\nalways being lost on downs. The playing.<br />\nseemed to lack sufficient snap.<br />\nNext comes Western Maryland for the championship (Nov. 3) and before that date several<br />\nhard practices are needed.<br />\nThe line up is as followsP. & S.<br />\n<br />\nHOPKINS.<br />\n<br />\nPOSITION.<br />\n<br />\nGillespie,<br />\nButler,<br />\nBlanck,<br />\nWhitman,<br />\nYearley,<br />\nBacon,<br />\nNelson,<br />\nMorse,<br />\nTyler,<br />\nSayler,<br />\nBruton,<br />\n<br />\nSudler•<br />\nLeft end.<br />\nNichols.<br />\nLeft tackle,<br />\nE.E. McGinty<br />\nLeft Guard,<br />\nDixon.<br />\nCentre,<br />\nBell.<br />\nRight guard,<br />\nJ. A.1‘.4cGinty<br />\nRight tackle,<br />\nCampbell.<br />\nRight end,<br />\nQuarter,<br />\nJackson.<br />\nLeft half-back,<br />\nRight half-back, Cupp.<br />\nMcKay.<br />\nFull back,<br />\n<br />\nTouchdown—Sayler. Goal—Sayler. Score, J. H.<br />\nU., 6—P.& S., 0. Halves-20 and 15 minutes. Umpire—Conlin (P. & S.) Referee—Cosler U. H. Med.)<br />\nLinesmen—White and Contry. Timers—Mackdermott<br />\nand Samuels.<br />\nW<br />\n<br />\nWISDOM.<br />\nHe who knows not, and knows not he<br />\nKnows not,—he is a Freshman. Scorn him.<br />\nHe who knows not and knows he knows<br />\nNot,—he is a Sophomore. Pity him.<br />\nHe who knows and knows not he knows,—<br />\nHe is a Junior. Honor him.<br />\nHe who knows, and knows he knows,—<br />\nHe is a Senior. Reverence him.<br />\n<br />\nEx.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\nCLASS ELECTIONS.<br />\n<br />\nThe Senior Class after a spirited campaign,has<br />\nchosen its officers as follows: President, Horace<br />\nS. Whitman; Vice-President, J. Straith Briscoe;<br />\nSecretary, Olin Shreve; Treasurer, Robert B.<br />\nMorse. The other officers remain to be elected.<br />\nwww<br />\nThe officers of the Junior Class are Robert<br />\nTreat Crane, elected President for the second<br />\nsuccessive time;Robert E. Moore,Vice-President;<br />\nWilliam J. Sneeringer, Secretary; B. Swayne<br />\nPutts, Treasurer; Lewis J. White, Sergeant-atarms; Ross M. Diggs, Historian; Peregrine<br />\nWroth,Jr., Poet.<br />\nwww<br />\nThe Freshmen have elected: President, William<br />\nS. Bird; Vice-President, Wethered Lilly; Secretary, Joseph Smith, Jr.; Treasurer, William<br />\nSnowden; Sergeant-at-arms, Alexander Yearley,<br />\nJr.<br />\nThe Senate of the University has organized for<br />\nthe work of the year. The new officers are Harry<br />\nStephenson Byrne, President; J. Gresham<br />\nMachen, President pro tern.; Alfred W. Bruton,<br />\nSecretary; J. Abner Sayler,Jr.,Sergeant-at-arms.<br />\nwww<br />\nThe House of Representatives has chosen the<br />\nfollowing officers; John G. Campbell, Speaker;<br />\nWilliam Kirk, Speaker pro tern.; Peregrine<br />\nWroth, Secretary; Horace Gillespie,Sergeant-atarms.<br />\n<br />\nw<br />\nA CURIOSITY.<br />\nA very interesting fact was brought out in the<br />\nJunior Literature Class last week. In that part<br />\nof the prologue to Chaucer which speaks of \"A<br />\ngood Wyf was ther of bisyde Bathe\" there are to<br />\nbe found [L 487-8] the couplets:<br />\n\"She coude moche of wandring by the weye.<br />\nGat-tothed wasshe,soothly for to seye.\" This<br />\nphrase \"gat-tothed\" has for many years disturbed the minds of students of Chaucer.<br />\nSome have decided that this signifies lasciviousness; others thought that it possibly described her desire for travel. For in England and<br />\n<br />\nin Ireland it is believed that the country folk<br />\nsome years ago used to judge by the arrangement<br />\nof a child's teeth whether it should be a \"home<br />\nstayer\" or a traveller.<br />\nDr.Greene asked if any member of the class had<br />\never heard this saying, and although he had put<br />\nthis question to previous classes, this year is the<br />\nfirst time that any men have been found who<br />\nhad heard this expression. The men who heard<br />\nit before were: Lyman Murphy, Henry B. Law<br />\nand William B. Hill, who came across it while<br />\nrusticating in Hartford County, Md.<br />\nThe testimony of these men will gofar in clinching the argument that the \"good Wyf\" was a<br />\ntraveller and not a lascivious woman.<br />\nWWW<br />\n<br />\nTHE CIGARETTE BUSH.<br />\nWhin I git big I'm goin'<br />\nTo a country fur down South,<br />\nWhere I'll lay around all day<br />\nWith a cigarit in me mouth,<br />\nAn' puff like some ole chimny,<br />\nAn'fergit erbout me woes,<br />\nIn th' bright an' sunny land<br />\nWhere<br />\nTh'cigarit bush grows.<br />\nThere won't be none to break me up<br />\nWhin th' smoke curls round me head,<br />\nAn'I won't have ter chope th' stump<br />\nUntil it's limp an' dead;<br />\nThere'll be none to search me pockits,<br />\nNor to smell me reekin' close,<br />\nIn th' bright an' sunny land<br />\nWhere<br />\nTh'cigarit bush grows.<br />\n0 thim times is slow a-comin'<br />\nBut there comin' all th' same,<br />\nAn' it's Turkish Cross ter Richmonds<br />\nThet I'll be in the game;<br />\nWhin I'm old ernuff ter go away<br />\nAn' fergit me mortil throes,<br />\nIn th' bright an' sunny land<br />\nWhere<br />\nTh' cigarit bush grows.<br />\njOIIN C. CATON.<br />\n<br />\nww<br />\n\"Mr. Dooley on Commencement\" in the NEWSLETTER is excellent as an imitation and funny in<br />\nitself, which is more than Mr. Dooley, the original, always is himself.<br />\nThe Mt. Holyoke.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nANSWER TO \"A PLEA.\"<br />\nMr. Editor,<br />\nDear' Sir:—<br />\n<br />\n1I<br />\n<br />\ntions will be the Harvard Lampoon, Princeton<br />\nTiger, Cornell Widow, Pennsylvania Red and<br />\nBlue, Columbia Morningside, Yale Weekly, etc.<br />\nAlso the WOMAN'S COLLEGE KALENDS.<br />\nor or or<br />\n<br />\nIn \"A Plea,\" \"S.S.\" gives<br />\nCHESS CLUB.<br />\nus a very sensible statement, which, by the way<br />\ntouches upon the policy pursued by the Junior<br />\nThe Chess Club, which had such a prosperous<br />\nClass this year, viz: the election of lower 'classseason last winter, is in the midst of a tournamen into their body. Had \"S. S.\" investigated<br />\nment to decide upon the team which is to be<br />\nthe matter, he would have soon found that the<br />\npitted against the West Branch Y. M. C. A.,and<br />\nSub-Freshman are a distinct and separate class,<br />\nother clubs this year. The results up to date are:<br />\nhaving elected officers some time since. The<br />\nPERCENT.<br />\nWON.<br />\nLOST.<br />\nPLAYERS<br />\nwriter is evidently a Junior, for the fear lest his<br />\n800<br />\n8<br />\n2<br />\nV. Edgeworth Smith,<br />\nclass \"be opposed by 65 men\" would not come Lloyd P. Shippen,<br />\n750<br />\n7/<br />\n1<br />\n2<br />\n2/<br />\n1<br />\n2<br />\nto any other classman.<br />\n714<br />\n5<br />\n2<br />\nC. Markell, Jr.,<br />\n250<br />\n1<br />\n3<br />\nPermit me to inform him that the strength of L. S. Hutzler,<br />\n100<br />\n4/<br />\n1<br />\n2<br />\n17i<br />\nthe Freshman Class is 55 men, and that exactly J. G. Machen,<br />\n000<br />\nDapprich,<br />\n2<br />\n0<br />\n6 students compose the Sub-Freshman body. It F. R.<br />\n000<br />\n0<br />\n3<br />\nR. L. Ramsay,<br />\nis indeed \"a terrible calamity in college life\" to R. C. Sharretts,<br />\n000<br />\n3<br />\n0<br />\nbe without a class in the Senior year; but why T. W.Glocker,<br />\n000<br />\n0<br />\n0<br />\nhas the class of which \"S. S \"is a member, done<br />\nthis very thitig against which he warns the<br />\nFACULTY CHANFES.<br />\nFreshmen, when, as he says,\"it will bring great<br />\nharm to the fair name which our class contests<br />\nMany changes have taken place in the faculty<br />\nhave held, and will invoke irrevocable wrong of the University. Although several prominent<br />\nupon the individual members of both classes\"?<br />\nmen have resigned and gone to other colleges it<br />\nWill the Freshman not be perfectly justified in is generally believed that the faculty has not<br />\naccepting the aid of the Sub-Freshman in the been at all weakened, for the vacancies have<br />\nclass foot-ball game and cane rush, when 1902 been filled by men well known for their high<br />\nis assisted by men who, according to the college standing in the world of literature and science.<br />\nstatus, have no right to be among them?<br />\nThe following are among the most important<br />\n\"S. S. exhorts the Freshmen to respect the col- changes that have been made since last June:<br />\nlege traditions and their innate desire for fair<br />\nIN THE PHILOSOPHICAL FACULTY:<br />\nplay which his class has disregarded. \"Do as I<br />\nFrank Morley, M. A., D. Sc, recently Professor in<br />\nsay, but not ^ my class does,\" says he. 1903 Haverford College, to be Professor of Mathematics.<br />\nhas done so, but suggests that \"people in glass<br />\nHarry C. Jones, Ph. D., formerly Associate, now<br />\nhouses shouldn't throw stones.\"<br />\nAssociate Professor of Physical Chemistry.<br />\nFRESHMAN.<br />\nP. S. We Freshmen may be green, but such<br />\nJohn B. Whitehead, A. B., formerly Instructor, now<br />\nshams as the recent letter by\"A Freshman\" and Associate in Applied Electricity.<br />\n\"A Plea\" are easily seen through.<br />\nHarry L. Wilson, Ph. D., formerly Instructor, now<br />\nAssociate in Latin.<br />\ngr- ger<br />\n<br />\nEXCHANGE PLACE.<br />\nThe exchange department begs to announce<br />\nthat it will place its exchanges on the magazine<br />\ntable in Levering Hall, for the benefit of Hopkins<br />\nstudents. Among other leading college publica-<br />\n<br />\nJ. Eustace Shaw, Ph. D., formerly Fellow, now<br />\nInstructor in Italian.<br />\nEdward D. Durand, Ph. D., has been appointed<br />\nLecturer in American Finance.<br />\nWilliam F. Willoughby, A. B., has been appointed<br />\nLecturer in Social Economics.<br />\n<br />\n\fPAINE.<br />\nGORDON P. PAINE.<br />\n<br />\nMEMBERS OF<br />\nNEW YORK STOCK EXCHANGE<br />\nBALTIMORE STOCK EXCHANCI,<br />\nCHICAGO BOARD OF TRADE.<br />\n<br />\nCLINTON P.<br />\n<br />\nCALL 0\\<br />\n<br />\nJAS. H. DOWNS,<br />\n229 N. CHARLES ST.<br />\n<br />\nCLINTON P. PAINE & CO,<br />\nBANKERS<br />\n<br />\nAND<br />\n<br />\nBROKERS,<br />\n<br />\nMASONIC TEMPLE.<br />\n<br />\nIPOR Class, Fraternity and College Stationery, Banquet Cards,<br />\n<br />\n217 EAST GERMAN STREET,<br />\n<br />\nPRIVATE WIRES 70<br />\nNEW YORK AND CHICAGO.<br />\n<br />\nInvitations, Diplomas, Programs, Visiting Cards, etc.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nMORITZ MOSZKOWSKI,<br />\nThe distinguished musician, composer, pianist, and teacher, of<br />\nParis, writes as follows regarding the<br />\n<br />\nThe Chas, Willms Surgical Inst[ument Co,<br />\n<br />\nMASON & HAMLIN PIANOFORTE.<br />\n<br />\nBENJ. A. NELSON, GIEN'L MANAGER.<br />\n<br />\n\"It has a full, singing tone, and the action is most satisfactory.<br />\nTaken as a whole it is, I believe, an instrument of the very first<br />\nMoRrrz Moszitowsm.<br />\n(Signed)<br />\nrank.\"<br />\nC.<br />\n<br />\nH. Hildebrandt & Son, Sole Agts.<br />\n<br />\n321 N. Howard Street.<br />\n<br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br />\n300 N. HOWARD ST.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nDrovers St Mechanics National Bank of Baltimore.<br />\nCapital Stock $300,000.<br />\n<br />\nSurplus and Profits, $350,000.<br />\n<br />\nTRANSACTS A GENERAL BANKING BUSINESS.<br />\nSafe .2)(Pposie 91o,eas<br />\n<br />\nTames Clark, President.<br />\nLeopolrl Strange, Vice-President.<br />\n<br />\nA. H. FETTING,<br />\n14<br />\n<br />\nAND<br />\n<br />\n$%.7.6,0<br />\n<br />\nWpwarre.<br />\n<br />\n_ (\\ter<br />\nraver ,<br />\n<br />\nJ. I). Wheeler, Cashier.<br />\nChas. S. Miller, A ss't Cashier.<br />\n<br />\nPu lic)kers/i,<br />\n<br />\nMANUFACTURER OF<br />\n<br />\n5)/<br />\n<br />\nfireeR Doer Fraternity<br />\nJewelry.<br />\n<br />\n?I7 E.BALTa.<br />\nBALTIMORE, MD.<br />\n<br />\n16 ST. PAUL STREET.<br />\n<br />\nPLEASE CALL AND EXAMINE OUR LINE BEFORE PURCHASING<br />\n<br />\nLLOYD S. S. CO.<br />\nNORTH GERMAN<br />\n,r ,r<br />\n<br />\nNEW VOL& TO BREMEN,<br />\nLONDON, PARIS, GIBRALTAR,<br />\n<br />\nCABIN PASSAOE AT LOW RATES.<br />\n<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br />\n<br />\nA. SCHUMACHER & CO<br />\nGeneral Agents.<br />\n<br />\nFor particulars apply to<br />\n<br />\nDIRECT.<br />\n<br />\nAFR JO SURETY BONDS.<br />\n<br />\nKranz-Smith<br />\npiano Co.<br />\n<br />\nthe<br />\n<br />\nFidelity and Deposit Company of Maryland,<br />\n<br />\n109 and III North Charles Street.<br />\nSOLE AGENTS<br />\n<br />\nCbickering, Bradbury and Webster<br />\n<br />\nit* Pianos. *it<br />\nC. & P. Phone 2322-2.<br />\n<br />\nFactory Prices<br />\n<br />\nIBA1'TI.F.1\"I', HAYWARD (Se CO.<br />\n<br />\nFounders and Engineers, •<br />\nWorks, Pratt and Scott Sts.<br />\nOffice Calvert and German Sts.<br />\nManufacturers ofCast and Wrought Iron Work for Buildings.<br />\nStores, Railings, Balconies, Guards, Vaults and Area Lights, Iron,<br />\nZinc and Copper Sheet Metal Work, Hydraulic Passenger and Freight<br />\nElevator., Hot Water and Steam Heating Apparatus, Vertical and<br />\nHorizontal Tubular Boilers, Wrought Iron Tanks, Gas Holders, Purifiers, Condensers, etc. Columns, Plates, Girders, Beams and Beam<br />\nGirders, Wrought Iron Roof Framing and Road Bridges.<br />\nCHARLES AND LEXINGTON ST*.<br />\nBECOMES SURETY ON ALL CLASSES OF BONDS.<br />\nSAFETY DEPOSIT BOXES.<br />\n,<br />\n<br />\nEDWIN WARFIELD, Pres't.<br />\nist Vice-Pres't, H. Crawford Black.<br />\n2nd<br />\n\"<br />\nJos. R. Stonebraker.<br />\n3rd<br />\n\"<br />\nThos. A. Whelan.<br />\n<br />\nIT. E. BOSLER, Seey-Treas.<br />\nharry Nicodem<br />\nAss't See'y-Tretts<br />\n<br />\nBOOKS Old and<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks bought, sold and exchanged. . . .<br />\nW M. V. PIPPEN,<br />\n<br />\nEISENBRANDT'S<br />\nLeading Dealers in Baltimore in everything known in Music.<br />\nSole Agents for<br />\nMandolins, Guitars, Banjos<br />\nand Zithers.<br />\n4j1Ingelust Automatic Attachments for<br />\nPianos.<br />\nREGINA MUSIC BOXES.<br />\nGRAMOPHONES, ETc.<br />\n201-203 N. CHARLES STREET.<br />\n<br />\n\"Washburn\"<br />\n<br />\n605 N. Eutaw St.<br />\n<br />\n\fS7vVITH. DIXON St CO.<br />\n--i<br />\nji<br />\n(1.1SCt<br />\n<br />\n04 PAPER<br />\n<br />\n.p N.CHARLES 5!<br />\n<br />\nse4G.Fyip/04:<br />\nv.04,A,'•<br />\n29-31 8_ CHARLES ST_<br />\n<br />\nNEW YORK TO LONDON DIRECT.<br />\n<br />\nLAGER BEERS<br />\n<br />\nGlobe<br />\nBrewery<br />\n<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers<br />\nat reasonable rates.<br />\n<br />\nEioldbrau and Wumurger.<br />\nAbsolutely Pure and Wholesome.<br />\nNone better on American Market.<br />\n<br />\nATLANTIC TRANSPORT CO.<br />\n<br />\n1 BROADWAY,<br />\n<br />\n403-409 WATER ST.<br />\n<br />\nNEW YORK.<br />\n<br />\nBALTIMORE.<br />\n<br />\nJ. Wm. Middendorf,<br />\n<br />\nWm. 11. Oliver,<br />\n<br />\nWilson Keyser, Cashier.<br />\n<br />\nLawrence B. Kemp, President.<br />\n<br />\nGOrfiffiERCIFIL & FFIRII1ERS NOTIONfIL BANK,<br />\n<br />\nMIDDENDORF OLIVER & CO..<br />\n<br />\nBankers and Brokers,<br />\n<br />\nHOWARD<br />\n<br />\nAND<br />\n<br />\nSTREETS,<br />\n<br />\nGERMAN<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n205 EAST GEDZIVIA.N<br />\nMembers<br />\nBALTIMORE,<br />\nBaltimore Stock Exchange.<br />\n<br />\nMD.<br />\n<br />\nOffers to Depositors every facility which their Balances, Business<br />\nand Responsibility warrant.<br />\n<br />\n/10<br />\n<br />\n(Uedding Silver Triitdselsor<br />\nIN GREAT<br />\n<br />\nijAC0111<br />\n<br />\nSilversmiths.<br />\nHENDERSON'S ot<br />\n216 N. CHARLES ST.<br />\n<br />\n47<br />\n<br />\nZE<br />\n,<br />\n324 W. 1.3AL;TI1\\401<br />\nMANUFACTURERS OF<br />\n<br />\nGushing Companu,<br />\n<br />\nVVIHST<br />\n<br />\nCAPS.<br />\n<br />\nBOOKSELLERS...<br />\nSTATION ERS.<br />\n<br />\nversity,johns Hopkins Hospital' and The Woman's College of Balto.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nPRICES.<br />\n<br />\nllgenfritz<br />\nStudio.<br />\n<br />\nL.F.:X I rarrolv<br />\n<br />\nHELEN M. 1-10L,L,YDAY,<br />\n<br />\nand capital.<br />\n<br />\nStandard Organs.<br />\nPianos For Rent.<br />\n<br />\nTuning, Repairing<br />\nAccommodating terms.<br />\n<br />\nWrite for Illustrated Cata[logue.<br />\nCHAS. M. STIHPP.<br />\nD. C.<br />\nWashington,<br />\nW.,<br />\nN.<br />\n,<br />\nSt<br />\nnth<br />\n521<br />\nMd.<br />\nBaltimore,<br />\n9 N. Liberty St.,<br />\n<br />\nB. G. EICHELBERGER,<br />\nBOOKS AND STATIONERY,<br />\nENGRAVING AND STAMPING.<br />\nNo. 308 North. Clint-lee Street,<br />\n<br />\ns-ru.tit EX.<br />\n<br />\nSPECIAL DISCOUNT TO STUDENTS.<br />\n<br />\nYou get the benefit fo<br />\nall this labor,skill,brains<br />\n<br />\nFs<br />\nTIE<br />\nplANO<br />\n<br />\nShirts, Neckwear, Underwear,<br />\nHosiery, etc.<br />\n<br />\nSUCCESSOR TO CUMMINS<br />\n<br />\n20<br />\n<br />\n4q1b-Cib-HOF'KINS<br />\n<br />\nSilk and Cassimere Hats.<br />\n<br />\nHABERDASHERS,<br />\n<br />\n203 W. BALTIMORE AND 2 S. LIBERTY STREETS.<br />\n<br />\npbotographe<br />\n<br />\nHATTERS, 6. CANES, ETC.<br />\n<br />\nAgents for Lincoln & Bennett and Walter Barnard's London Hats.<br />\n<br />\nSCHOOL, Law, MEDICAL, CLASSICAL AND MISCELLANEOUS 500511.<br />\nKeeps constantly on hand the Text Books used Ill .johns Hopkins Uni-<br />\n<br />\nMADISON & HOWARD STS.<br />\n<br />\nHIGH GRADE GOODS—LOW<br />\n<br />\nPAINE.<br />\n<br />\n34 W. BALTIMORE STREET.<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE,<br />\n<br />\nTHE BLAKE CO<br />\n<br />\nR.<br />\n<br />\nWAHNE.',R 8c CO.<br />\nUMBRELLAS,<br />\n<br />\nVARIETY<br />\n<br />\na/UNKINS.<br />\n<br />\nTEXT BOOKS, NOTE BOOKS,<br />\nSTUDENT'S SUPPLIES.<br />\n<br />\n.JAMES<br />\n<br />\nTHEO. WARNER,<br />\n<br />\nESTABLISHED 1879.<br />\n<br />\nT. M. C.<br />\nC. & P. Telephone<br />\n<br />\nA.<br />\n<br />\nBUILDING,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n2351.<br />\n<br />\nBartholomay Brewery eo.<br />\nROCHESTER,N.Y.<br />\n<br />\n800 N. EtTIMAW S.F.<br />\nBALTIMORE. MD.<br />\n<br />\nNew and Second-Hand Books, Text Books, Note Books, Students'<br />\nRequisites, etc., etc.<br />\nBooks Bought, Sold, ;Ind Exchanged.<br />\n<br />\nIinheuser-Bnsch<br />\nBrewing Ass'n<br />\nSt. Louis, Mo.<br />\nBrew the Best Beers<br />\nin the World.<br />\n•ALTIMOPIE BRANCH:<br />\n<br />\nLOUIS ILLMER,<br />\nGen'l Agent and Mgr.<br />\n<br />\nC. eic. P. Telephone<br />\n2314.<br />\n<br />\nBARTHOLOMAY'S IS THE Bohemian<br />\n•ORIGINALAND FAMOUS ®<br />\n<br />\nBavarian<br />\nROCHESTER BEER Maerzen 13rfau<br />\nBALTIMORE<br />\n,,. • BRANCH,<br />\n2.27-239S.LENTRAL AVE<br />\nt.) C RO •<br />\n• MANAGER<br />\n<br />\nTRADE MARK.<br />\n<br />\nApollo<br />\n<br />\n•• •<br />\n<br />\nOffice and Depot, 227-2.39 5. Central Avenue.<br />\n<br />\nGEo. C. SUCRO, Sole Agent.<br />\nC. &<br />\n<br />\nTelephone 1060<br />\n<br />\ncTONEBRAKER BROS.,aq.<br />\n21 Z<br />\n<br />\nE. Baltimore St.<br />\n<br />\nHome Telephone 2060<br />\nVISITING CARDS<br />\nNEATLY ENGRAVED<br />\nSHORT NOTICE.<br />\n<br />\n\fFORD'S! Ir,THE THEATRE<br />\n<br />\nLEMMERT<br />\n<br />\nONE<br />\nWEEK.<br />\n<br />\nTAILOR<br />\n<br />\nNOV. 12,<br />\nONE<br />\nWEEK<br />\n<br />\nDRAPER<br />\n<br />\nOF BALTIMORE.,,rg<br />\n<br />\nDANIEL FROHMAN'S COMPANY,<br />\nIn Three Successes.<br />\nThe Leading Company of America.<br />\n<br />\nNOV. 5,<br />\n<br />\ngoo,<br />\n<br />\nKELCEY & SHANNON,<br />\nIn the Lyceum Theatre Comedy Success.<br />\n'My DAUGHTER IN LAW.\"<br />\n<br />\nGARMENTS AS PATTERNED BY<br />\nLEM M ERT ARE MADE TO FIT<br />\nTHE WEARER, PLEASE TH E<br />\nPUBLIC AND PRESENT THE MAN<br />\nAS PERFECTLY AS THE TAILOR<br />\nCAN ATTAIN TO.<br />\n<br />\ntNi§nkii1ZatiNiNitigikZZtateilleigitiBitititi?~faitiat<br />\ny<br />\nis the noblest part of your<br />\n<br />\nOUR HEAD, SIR<br />\n<br />\nLEMMERT,<br />\n14 E. FAYETTE STREET.<br />\n<br />\nMINOR'S,<br />\n<br />\n0<br />\n<br />\n216 NORTH<br />\n<br />\nP. S.<br />\n<br />\nWE CATER ESPECIALLY TO THE NEEDS OF<br />\nSTUDENTS.<br />\n<br />\ntiotizAPFEL<br />\n<br />\nBEizet<br />\n<br />\nImprove its appearbody.and comfort by wearfillee<br />\ning OUR HATS.<br />\n<br />\nEUTAW STREET,<br />\n<br />\nUP-TO-DATE,<br />\n<br />\notra<br />\n<br />\nONE PRICE.<br />\n<br />\nNzzzeamizzieeazzeeiteeeimeeeeitsitE<br />\nEMBERS OF THE MANDOLIN CLUB and all musically inclined IliwKiNs men who desire to purchase a<br />\nstringed instrument should visit the only manufacturers in Baltimore.<br />\nHOLZAPFEL & BEITEL, 306 PEARL ST.,<br />\n<br />\n*Mandolins*<br />\nGUITARS AND BANJOS.<br />\n<br />\nNEAR SARATOGA ST.<br />\nINSTRUMENTS TAKEN IN EXCHANGE.<br />\n<br />\nOPEN EVENINGS.<br />\n<br />\nLARGE STOCK AND INSTRUMENTS MADE TO ORDER.<br />\n<br />\nFor Advertising Space in<br />\nthis Paper apply to<br />\nSTONEBRAKER BROS.<br />\nPrinters, Engra.verx anD<br />\nPublisherx.,9(garegeg<br />\n217 E. BALTIMORE STREET,<br />\nC.6 P. Telephone 2547.<br />\n<br />\nBALTIMORE. MD.<br />\n<br />\n\f", "format": "basic_html", "processed": "•Cbe news T. Letter. *<br />\nOctober 31, 1900.<br />\nDOWN AN ALPINE SLOPE.<br /><br />\nNo. 2.<br /><br />\ndown at the brake. The connection was perfect;<br />\nthe band drew tight over the drum; but the<br />\nOn our Strassenprofilkarte, a map that gives powerful brake had no more effect than a feather<br />\nrealistic pictures of the hills and mountains, the dropped on a wheel.<br />\npass that lay between us and Lucerne was only<br />\nIf I had known that the bell-boy who cleaned<br />\na quarter of an inch high with a gradual slope our wheel the night before had mistaken the<br />\nto the top, and Simplon and St. Bernard were unfamiliar mechanism for running-gear and had<br />\ngreat blotches of color. This disparity and the given it a liberal bath of oil,the strange behavior<br />\nsight of a stretch of the hard yellow road be- of the brake would have been less of a puzzle; it<br />\ntween the green hills persuaded Archie and would not, however, have been less terrifying.<br />\nArchie persuaded me, to scorn the railway with There was no braking with the foot, for the maits smoky tunnel and to follow the skyward chine, an English make, carried heavy mudroute on our tandem.<br />\nguards. No feet were nimble enough to catch<br />\nThe highway stretched at ease through little the spinning pedals now, and no muscles would<br />\nvalleys, wriggled like a climbing serpent over have been strong enough to check the momenknolls and spurs, and spread broad generous tum that grew as a fire spread in tinder. There<br />\ncurves on the mountain-side, leading us always was nothing to do but to wait and to wonder<br />\nupward until we stood perspiring and breathless what the end would be.<br />\non the summit. The shrill screech of a train as<br />\nMeanwhile the tandem tore down the winding<br />\nit left the tunnel came faintly up the mountain, road leaning far over at the turns until our<br />\nand presently we saw the tiny locomotive with bodies touched the leaves of road-side branches,<br />\na string of dumpy cars creep along a black line and lunging forward at a speed that made the<br />\nin the valley, and drag itself under the cover of wind roar in our ears. Great trees and ledges of<br />\ngroves of trees. A gleam of white walls and red rock flipped by in fleeting confusion. I found<br />\nroofs huddled together and a few wisps of noon- myself counting the red and white stripes of<br />\nday smoke showed us the village next on our Archie's shirt, and looking at the curly locks on<br />\nway toward the lakes, and beyond it the road his head bent low as he gave his strength to the<br />\nwas a narrow ribbon of shining drab.<br />\nsteering.<br />\nAt our feet the same highway was broad and<br />\nThe last turn had tried us to the utmost. I<br />\nsmooth, swinging in a wide safe curve down the knew that we could not make the next, and that<br />\nslope and out of view behind the trees. We the sharp bend must send us flying into the<br />\nshoved off and, trusting in a band-brake that woods like a stone loosed from a sling.<br />\nhad never yet failed us, coasted wide-open.<br />\nEven as I thought of the shock, it came; but<br />\nSlowly the heavy tandem gathered speed, leap- not as I expected. There was a sharp, quick<br />\ning eagerly forward as the road dipped at the snap, and I found myself plunged head first into<br />\nbend. The wind came rushing, chilled the per- the moist bed of a tiny stream with a whirling<br />\nspiration on our faces, and set the shirt-sleeves in my brain and a strange numbness setting the<br />\nfluttering on our arms. The chains began a fingers of my left hand a-tingle. Our tandem lay<br />\ncheerful hum, and we could feel the rhythmic in the middle of the dusty road, and the front<br />\nfling of the flying pedals grow faster and faster. wheel was slowly coming to a standstill, as if a<br />\nNow it was time to slow up, and I reached for passer-by had set it spinning. A little beyond<br />\nthe brake-grip and pressed a little. There was the wheel was Archie, lying face down and very<br />\nno response. I jammed it down hard, and for still.<br />\nWater from the stream revived him,and dazed<br />\nanswer the wheel shot forward around another<br />\npushed<br />\nus,<br />\nlooked<br />\nI<br />\nand trembling he struggled to his feet and tried<br />\ncurve as if some one had<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nto walk. At the first step he collapsed in my<br />\narms. A peasant,who had just rounded the turn<br />\nbelow us, offered his cart and drove slowly back<br />\ntoward the village with Archie, a bruised and<br />\nbattered passenger, nursing a badly sprained<br />\nankle.<br />\nThen I picked up the tandem. Pedals and<br />\nhandle-bars were gone from the left side as cut<br />\noff by giant shears, and the machine was otherwise uninjured. We had grazed a tall stone<br />\nmile-post that stood at the side of the road,<br />\ngrips and pedals had snapped like straw,and the<br />\nshock had flung us off to the right.<br />\nTwo rods below the road turned sharply, and<br />\nacross the wheel-tracks I saw a few feet of tufted<br />\ngrass, and then,—nothing but the distant hazy<br />\ngreen of the opposite side of the gorge. From<br />\nthe brink I looked far down into the tops of<br />\ntrees, and caught through an opening in the<br />\nfoliage the silver glitter of falling water that<br />\nmade no sound. If the friendly mile-post had<br />\nnot held out a rude hand to stop us in the nick<br />\nof time, our coast must have ended just here in a<br />\nwild plunge into the mountain-haze.<br />\nF.<br />\nsW<br /><br />\nWW<br /><br />\nODE TO BLACK AND BLUE.<br />\nI am a Hopkins man. You know my colors.<br />\nhurrah for glorious Black and Blue.<br />\nThe rooter across the gridiron holloas.<br />\n\"Know ye whence we these colors drew?\"<br />\nBlue is the merry sky<br />\nShining o'er our victory,<br />\nAnd Black is the dark o'er-arching night,<br />\nOn whose sable arch as stars shine bright,<br />\nThe H's of many a glorious fight.<br />\nOur enemies we smite so; so lively our hue,<br />\nThat they bear the reflection of the Black and the Blue.<br />\n1I--. 1901.<br />\nPlant patience in the garden of thy soul;<br />\nThe roots are bitter, but the fruits are sweet,<br />\nAnd when at last it stands, a tree complete,<br />\nBeneath its tender shade, the burning heat<br />\nAnd burden of the day shall lose control;<br />\nPlant patience in the garden of thy soul.<br />\nEx.<br />\nWWW<br /><br />\nA nice girl is not to be winked at.<br />\nHarvard Lampoon.<br /><br />\nWHAT IS COLLEGE SPIRIT?<br />\nEditor of the. News Letter: Concerning the<br />\ndiscussion of college spirit in your last issue, will<br />\nyou allow me the use of your columns for a<br />\npresentation of a definition of the words,forma-.<br />\nlated after the experience of several years at<br />\nHopkins? The humor of \"Freshman's\" remarks was apparent, but the sense was superficial. foolish and fallacious, \"College Spirit\"<br />\nin its true sense, stands for college fun and college worship. Standing for college fun it is the<br />\nemblem offree, independent minds enjoying the<br />\nfullest extent of straightforward, highmindecl<br />\npleasures; it is the incentive and producer of<br />\nthose enjoyments which college life offers, and<br />\nwhich no other branch of life affords. But<br />\nit is less emblematic of college fun than college<br />\nworship. It not merely requires the interest<br />\nof college at heart, and evidences of this interest; but also implies willingness for self sacrifice,<br />\nand readiness for the resolute denial of personal<br />\nadvantage if necessary to further the interests<br />\nof college.<br />\nFrom this abstract exposition of the term,<br />\nit is clearly seen that the pleasures of college life<br />\nare essentially of one's own making; that college spirit is entirely dependent on the individual efforts of the student; and that it is not a<br />\ntangible something floating around in the air<br />\nready to be gathered in by inactive young men.<br />\nThough the embryo is always present in the<br />\nvery atmosphere of a college, it requires to be<br />\nfostered by delicate attentions, and is not to be<br />\nseized without strenuous effort. Just as a man's<br />\nsuccess in life depends on his own exertions, so<br />\nthe pleasures derived from college spirit are entirely dependent on the attitude of the collegian;<br />\nfor college spirit, of all things, does not exist<br />\nof its own accord, but is made.<br />\nThe fact that a college is without dormitories<br />\nis by no means evidence final or conclusive<br />\nenough to establish a reputation for lack of<br />\nspirit. The pleasures of dormitory life are by no<br />\nmeans to be slighted, yet the lack of excitement<br />\nthus furnished is fundamentally only a superficial want, as the pleasures thus derived are<br />\nmainly superficial signs of college spirit, which<br />\nmay or may not indicate the deep-rooted pres-<br /><br />\nTHE NEWS-LETTER.<br /><br />\n41<br />\n'<br /><br />\nence of the true sentiment. The one great advantage of dormitory life is the promulgation of<br />\nassociation between man and man; advantages<br />\nwhich to a certain extent are lacking where the<br />\nstudents only work together fifteen hours per<br />\nweek. College spirit requires class spirit, and a<br />\nfraternal unity of feeling in the student body as<br />\na whole. Every man's motto at college should<br />\nbe: \"my college, my class, and then myself.\"<br />\nThe fundamental value of class contests lies in<br />\nthe spirit of oneness produced not only in each<br />\nclass but between the t No contestants. Class<br />\ncontests undeniably unite classes, and rrtake<br />\nmembers feel that they are a vital part of the<br />\nclass and of the institution; and this feeling<br />\nmust be established before any enjoyable demonstration of college spirit can be successfully<br />\nmade. A thoroughly organized class is thc best<br />\nnatural means of producing interest in other<br />\naffairs, as the immediate organization of Freshmen at Hopkins has year after year proved.<br />\nManifestations of college spirit should be made<br />\non every occasion. Here at Hopkins,the Football,<br />\nLaCrosse and Track and Field Teams are always<br />\nin need of men. If you are not heavy enough to<br />\nplay football, then unless you are totally unfit,<br />\nbecause of physical weakness, for any athletic<br />\nsport, at least make a hearty attempt for the<br />\nother teams. It is the plain duty of every man<br />\nto his alma mater: but of course only a small<br />\npercentage of the students enrolled at any college can make the athletic teams. The rest<br />\nshould make up the band of loyal supporters<br />\nwithout whom no team, however strong, can<br />\nachieve success. It is the experience of all ath_<br />\nletes that a band of enthusiastic \"rooters\" is<br />\nthe best incentive to good work. The record of<br />\nthe student body as\"rooters\"last year was far<br />\nmore creditable than ever before in the history<br />\nof dear old Tom Hopkins; they witnessed more<br />\ngames, and had a more systematic manner of<br />\ngiving vent to songs and yells than in former<br />\nyears. When the football team went up to<br />\nWestminster to contest with Western Maryland<br />\nCollege for the championship of the I. A. A. of<br />\nMd.,thanks to the efforts of the management to<br />\narouse interest and the liberal response of undergrads and graduate students, a party of about<br />\none hundred took the trip, and like a Roman<br /><br />\n3<br /><br />\ncentury swept everything, including the town<br />\nand the championship, before it, in its majestic<br />\ncourse of glory. I might mention two all-important facts here: that occasion was momentous<br />\nin its inauguration of united support of teams<br />\nby the students, and incidentally every member<br />\nof the party had a royal good time. There will<br />\nbe occasions this year for similar demonstrations. On Saturday, November 24th, Hopkins<br />\nplays St. John's College, at Annapolis, and it<br />\nwill require great efforts on our part to snatch victory from their strong team. Let the precedent<br />\nof 1899 be followed,let an even greater crowd accompany the team, so that such occasions shall<br />\nbe traditional in future years for the great outpouring of the people.<br />\nThere are other means besides athletics for<br />\nthe display of college spirit. You know all<br />\nabout the unexcelled record of the musical clubs<br />\nlast year. The NEWS LETTER and the Hullabaloo are both college institutitions that, though<br />\nby no means faultless, reflect credit on the<br />\nUniversity. Surely it is an evidence of college<br />\nspirit to contribute some article or articles to<br />\nthese noble examples of contemporaneous literature. The pleasure of writing for these representative Hopkins institutions should not be<br />\nleft entirely to the editors, who, as I have frequently seen in the columns of the NEWS LETTER, earnestly desire the active co-operation of<br />\nthe general student body. That you subscribe<br />\nI take as a matter of course.<br />\nI have said that colleges pint is college worship and college fun; but I should have said college worship and the fun derived from such worship. The religions of the ancients were filled<br />\nwith forms and ceremonials, but the true religions were deeper-rooted in the hearts of the people because they worshipped at a common shrine'<br />\nCollege fun is an essential of college life, but the<br />\ntrue spirit, which I have tried to make clear,<br />\nshould prompt all fun. The practice of such college spirit will produce infinite pleasure in college and in after life, present tangible enjoyments, and future recollections.<br />\nBut above all else,remember that college spirit<br />\nis dependent on you and you alone.<br />\nAN OLD COLLEGE STUDENT,.<br />\nB. O. K.<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br />\ntbe 14ewsaetter.<br /><br />\nPublished Fortnightly during the University Year<br />\nby the<br />\nStudents Of THE JOHNS HOPKINS UNIVERSITY.<br /><br />\nOCTOBER 31, 1900.<br />\nSubscription $1.50 per year.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\n.<br />\nAssistant Business Manager,<br /><br />\nio cents a single copy.<br />\nNORMAN BOYER, 1901.<br />\nJOHN M. BOOKER, 1901.<br />\nI J. GRESHAM MACHEN, 1901.<br />\nBEEN C. HILL, 1902.<br />\nSOL STROUSE, 1902.<br />\nWILLIAM B. HILL, 1902.<br />\nJOHN A. SLEMONS, 1902.<br />\n.<br />\nJOHN M. HANDEL, 1901.<br />\n. AUBREY PEARRE,JR., 1902.<br />\n.<br /><br />\nI<br />\n{<br /><br />\nAddress all articles, communications, etc., to NORMAN<br />\nBOYER,<br />\nbox 96,johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be<br />\nsent to<br />\nJOHN M. HANDEL, box 92,,j. H. U.; or box 398, Medical<br />\nSchool of<br />\nJohns Hopkins Hospital.<br /><br />\nThe NEWS-LETTER is much gratified at the<br />\ncordial way in which the first issue was received<br />\nby the student body. An enforced delay in the<br />\ndistribution of the issue called forth many inquiries as to the why and wherefore,which were very<br />\ngratifying to the staff, as showing that the paper<br />\nhas won the favor and confidence of the students.<br />\nThe year ending in June was the most prosperous and marked by the greatest progress of any<br />\nyear in the history of the paper. The kindly inter<br />\nest shown enables us to hope that the tone of<br />\nthe NEWS-LETTER may be continually improved,<br />\nand always be, as has been said, \"an honor to<br />\nthe students and a credit to the University.\"<br />\nLet all non-subscribers consider the suggestion,<br />\nfor there is a very simple way by which they can<br />\npromote this end.<br />\nor or or<br />\nActive, proselyting political clubs are a new<br />\nfeature of life at the University, hatched in the<br />\nstrenuous times of the national campaign. By<br />\nsome the organization of clubs by the followers<br />\nof the two rival parties is not regarded es an<br />\nunmixed blessing, but the election is only a few<br />\ndays distant, and we can stand it until then.<br />\nThe superfluous enthusiasm and any pugnacious<br />\ninclinations of the rival partisans will find a<br />\nsoothing antidote in the bosom of the third party<br />\norganization, the self-styled \"empty mug gang\"<br />\nwhose efforts for the \"advancement of morality\"<br /><br />\nshould be aided by all adherents of the G. G. G.<br />\nThe base suggestion has been made that the<br />\nNEWS-LETTER lend itself to the furtherance of<br />\none or the other of these partisan movements.<br />\nTo our correspondent let us say that while the<br />\neditorial pen has some distinct views on the desirability of annexing Highlandtown and extending the blessings of civilization and benevolent _<br />\nassimilation to the hoodlums of the 3rd ward,<br />\nyet no yellow journalism shall pollute our pages.<br /><br />\nIt is a sight for gods and men nowadays to see<br />\nthe Senate and House applaud a fine speech or a<br />\npopular election. No \"full mouthed roar\" now<br />\nascends to the vaulted roof to reverberate<br />\nthroughout the halls, but instead we have a gentle fluttering of kerchiefs, dainty kerchiefs, lace<br />\nedged kerchiefs, clean kerchiefs—and others,<br />\nwhich agitate the quiet air of the dignified bodies<br />\nno more than the falling of a feather. \"Ay, it<br />\ndoth amaze me\" to see to what ends are such<br />\nthings come. We shall soon be brought to the<br />\npass of cheering on our football and lacroSse<br />\nteams with such Chautauquan methods,and the<br />\ncrouching backs, turning, before hitting the line<br />\nfor ten yards, to see if their rooters are applauding, will be unable to tell whether the white<br />\nobjects in the grand stand signify people reading<br />\nnewspapers or students waving towels at them.<br />\nHorribile dictu!<br /><br />\n.A0<br />\nIt is conceded without any dissent that our<br />\n\"Chief Rooter\" is the right man in the right<br />\nplace. The rooting at Hopkins contests took on<br />\na new color when a regularly elected head was<br />\ngiven it two years ago, and the present incumbent has devoted all hisenergies to his task, with<br />\nthe result that the rooting has constituted one<br />\nof the chieffeatures of all our recent games. Let<br />\nus all give him our heartiest support.<br />\nA corner of thegrand stand crowded with men<br />\nshouting in unison college yells and impromptu<br />\nand witty stunts is in the highest degree effective.<br />\nTo be a good rooter may be as useful and as<br />\nhonorable as to be a good player. As a certain<br />\nlate Mr.Pope used to say. \"Act well your part;<br />\nthere all the honor lies.\"<br /><br />\n1<br /><br />\nTHE NEWS-LETTER.<br />\nPUBLIC LECTURES FOR 1900-1.<br />\nThe Johns Hopkins University has this year<br />\nplanned a more comprehensive course of public<br />\nlectures than has ever been provided in previous<br />\nyears. Both the time and the subjects for these<br />\nlectures have been chosen with great care and<br />\nattention to the needs of the various students.<br />\nOne great advantage in these lectures is the fact<br />\nthat no previous knowledge of the subject is assumed, and so all enter the courses unhandicap.<br />\nped.<br />\nThe courses which have been made ktiown in<br />\ndude a course in Maryland history, by Dr.<br />\nCharles W.Somerville, a graduate ofJohns Hopkins. His subjects are Maryland men of the<br />\nColonial period, including Francis Nicholson,<br />\nDaniel Dulany, John Hanson, John Eager<br />\nHoward, Luther Martin and Robert Goodloe<br />\nHarper.<br />\nThe second course will be delivered by Dr.S. E.<br />\nForman, and will be especially for teachers,<br />\ntaking up all lines of pedagogy. Dr.Guy Carleton<br />\nLee will give a course of six lectures on English<br />\nhistory. Dr. Frederick H. Sykes, a graduate of<br />\nJohns Hopkins, will lecture on Shakespeare.<br />\nA course in Latin will be given under Prof.<br />\nKirby F. Smith.<br />\nDr. Jeffrey R. Brackett,president of the Department of Charities of Baltimore, will give 10 lectures on problems of public charities and correction, with particular reference to conditions in<br />\nthe United States. Dr. J. S. Ames, professor of<br />\nphysics, will give a course of 20 lectures on<br />\nselected topics in physics,accompanied by demonstrations. Dr.Edward Renouf, will give a course<br />\nof 20 lectures on chemistry in daily life. Dr. 0.<br />\nL. Fassig, will give a course of 20 lectures on the<br />\nphenomena of the atmosphere. Dr.J. S.Johnson,<br />\nwill give a course of 20 lectures on the structure<br />\nand life history of mosses and ferns, each lecture<br />\nbeingfollowed by instruction in laboratory work.<br />\nThe first lecture of the series will be given on<br />\nFriday evening, November 2d, in McCoy Hall.<br />\nThe course on Maryland history is given by<br />\nthe generosity of the Maryland Society of Colonial Dames, who have presented the University<br />\nwith an endowment for that purpose.<br /><br />\n5<br /><br />\nIVIEMWARS FROM THE BIALOGIKILL<br />\nLABRITORY.<br />\nBy J. SCRUBBRUSII GARDINER.<br />\nFellow by courtesy in the Royal Society of Janitors.<br /><br />\nI. One of the first things that the new men<br />\nlearne is thet Biolergy aint no joke.<br />\nII. The departmint has more men than ever<br />\nbefore which is remarkabill, because the wurrk<br />\nis jess what it allus uster be.<br />\n/II. Green-fly (Apis Rosae) is found on rosebushes, accordin' to the authorities. A recint<br />\ninvistigater found thim in reasonabill numbers<br />\non the innermost of the four gartnints of which<br />\nthe vest is one.<br />\nIV. The Pollytix of the departmint is walking<br />\nthe tight rope. One day the talk was on Bryan,<br />\nand the nixt on McKinley,and each night I found<br />\na quarter under me door. Whativer happins,<br />\nI'm for free Silver.<br />\nV. I looked at a picture of Darwin the other<br />\nday and he wasn't so wonderful. Any lookin'<br />\nglass could a told him that story about the man<br />\nand the monkey.<br />\nVI. The latest 'Departmintal Ditty' is:<br />\nMyxonycetes<br />\nHowdy do,<br />\nBryozoa<br />\nJ. H. U.<br />\nVII. In a recint dissiction a fiver wasfound in<br />\nthe stomach of a dog-fish. Since then fifteen<br />\nmen has applied for admission to the major<br />\ncoarse.<br />\nVIII. In an .expiriment to find out whether a<br />\nbottil full of ether was insensitive to the influence<br />\nof a lighted match, it was proved that the use<br />\nof anisthitics can be ixtinded to inanimit objects,<br />\nbut that it can't be counted on.<br />\nIX. The reason why biolergists sing durin'<br />\nlabritory hours is one of the thesis subjicts for<br />\nthis year.<br />\nX. The sirvival of the fittist don't hold in<br />\nbiology. Thim that flunks survives around yer<br />\nlonger than any of them.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nFABLES FOR THE FOOLISH.<br />\nI.<br /><br />\nOnce on a time all the young animals, having<br />\nbecome versed in the flora and fauna of their<br />\nnative woods, said, one to another, let us now<br />\nlearn to reason, let us give ourselves over to the<br />\nstudy of logic. Straightway they repaired to a<br />\nlearned and benevolent griffin, who with the welfare of the young animals much at heart, was<br />\nmost pleased to impart the necessary instruction.<br />\nDaily they wended their way to his wood-seated<br />\nhaunt where they discussed many intricate propositions, made many intricate notes in their<br />\nbooks of guzzywee skin, and asked many unanswerable questions. At length one of the young<br />\nlogicians turned to his companion and said:<br />\n\"Tell me, I pray thee, what all this is about?\"<br />\n\"Verily,\" responded the bookerbus, \"I do not<br />\nknow.\"<br />\n\"Nor I,\" quoth the tom-tom.<br />\nWhereupon they all relapsed into attentive<br />\nsilence, with wise looks upon their faces, and<br />\nmuch confusion in their animal brains.<br />\nW<br /><br />\nIL<br />\nOn another occasion the animals,having great<br />\ndesire to become proficient in the art of public<br />\naddress, resolved themselves into an assembly<br />\nafter the manner of men, and secured as their<br />\ncensor a tetra-tongued animal from the bogs of<br />\nthe Rungleweed Rot. Now it happened that the<br />\nmost convenient place for assembly was in the<br />\nshade of the bingle tree, on the branches of which<br />\nthe birds of the rare were wont to sit and sing.<br />\n\"Truly,\" said the tetra-tongued censor from<br />\nthe bogs of the Rungleweed Rot, \"it is unbecoming that we disturb the singing of our<br />\nfair and feathered neighbors by untempered<br />\napplause. Let us devise then some new and<br />\nenlightened method. Instead of the growls of<br />\nthe saylerbus or the pawing of the pingwees,<br />\nhereafter we shall express our expression by the<br />\nwaving of pocket-handkerchiefs.\"<br />\nAll the animals having given assent to this<br />\nhappy suggestion,the proceedings were resumed<br />\nand the oration of the zingbutt.<br />\n\"Now,\"said the tetra-tongued censor from the<br />\nbogs of the Rungleweed Rot,upon the conclusion<br /><br />\nof the masterful oration of the Zingbutt, \"let us<br />\napplaud!\"<br />\nWhereupon, the animals, with one accord,<br />\nreaching for their handkerchiefs were amazed to<br />\nfind that they had no pockets, and there was so<br />\ngreat a silence that the birds of the rare ceased<br />\nin their singing to listen, and the heart of the<br />\nZingbutt was turned into punk.<br /><br />\nTHE WILLYBILL.<br />\nW<br /><br />\n\"COLLEGE SPIRITS\" AGAIN.<br />\nIt was with no intention of arousing a controversy or throwing fuel on the slumbering fire of<br />\nclass feeling that we printed \"A Freshman's'letter in our last issue, and we hope the authori'<br />\nties will duly note thisinteresting bit of information. But to have printed \"A Freshman's\"letter<br />\nand not give the world a letter we have received<br />\nsigned \"A Junior\" would knock a disastrous<br />\nhole in the NEWS-LETTER'S bulwark offair play.<br />\nLet the Junior then, take the floor.<br />\nMr. Editor: If you want to make \"Improvement the order of the age\" for your \"NEWS-LETTER,\" let me respectfully suggest that you hereafter exclude from your columns such correspondence as \"A Freshman.\" If there could be any<br />\nbetter argument for the necessity of some kind of<br />\nhazing I would like to see it. Oh, yes, Mr. Editor, the junior class will entertain the freshmen<br />\nat a feed and we will give them all gold medals<br />\nengraved \"For good conduct and perfect lessons,\"<br />\nand then the seniors will give them a dance, and<br />\nfinally the President will invite that verdant<br />\nclass to meet the Faculty for their mutual edification. The whole thing, Mr. Editor, is simply<br />\npreposterous. The freshman class ought to pass<br />\nresolutions disclaiming \"A Freshman's\" gaul as<br />\nrepresenting the spirit of his class. Don't give<br />\nus any more of this swash in the NEWS-LETTER.<br />\nYours truly,<br />\nA JUNIOR.<br />\nP. S.—\"A Freshman's\" English is about on a<br />\npar with his Latin. But homini est errare!<br />\nw w or<br />\nA typographical error in the last issue announces that a Freshman Scholarship has been<br />\nawarded to J. W. Beajan. The proper spelling<br />\nwas J. W. Bryan.<br /><br />\nTHE NEWS-LETTER.<br />\nvisilimitations of the game applied only to the<br />\n.<br />\nshame<br />\ntheir<br />\nting eleven. And they gloried in<br />\nd<br />\nscore<br />\nnians<br />\nVirgi<br />\nDuring the second half, the<br />\nThe final score of the Virginia game (40-0),<br />\ntheir<br />\nions<br />\nposit<br />\nal<br />\n. They put in sever<br />\ngives one the impression of a steady movement four times<br />\n, which is as strong as the 'Varsity,<br />\nscrub<br />\nfresh<br />\nat<br />\ntowards the Hopkins goal posts amounting<br />\nd the latter several tie games. Hoptimes to a continuous performance of almost having playe<br />\nthough evidently \"worn to a frazzle,\" hung<br />\nkaleidoscopic rapidity. For the first ten min- kins<br />\nin Lloyd's timekeepers saw that<br />\nutes this was not the case. During that time on until Capta<br />\nhter was beginning to pall on the specHopkins held the heavier Virginia eleven with the slaug<br />\ns, and that even the fresh Virginia scrub<br />\nspirit and determination. Then Virginia scored tator<br />\ning weary. Then they called time.<br />\nand the Black and Blue went up in the air—way, was grow<br />\nIf you<br />\nThere is one comfort about the game.<br />\nway up.<br />\nhave<br />\nmight<br />\nit<br />\nn,<br />\nnatio<br />\ng enough imagi<br />\nThe ascension was due to two causes, viz: the have a stron<br />\nworse.<br />\ngreenness ofthe Hopkinsline: the general suprem- been<br />\nising our eleven from an ultra amateurish<br />\nCritic<br />\nthe<br />\nof<br />\nacy in weight, training and experience<br />\npoint,I would say that Riggs and Meadows<br />\nVirginia team. Four times during the first part stand<br />\nour best game behind the line, and Hanof the first half did the Black and Blue get the played<br />\n(especially after he was hit in the mouth)<br />\nball almost on her goal line, and four times cock,<br />\nd the game on the line.<br />\nRiggs kicked to a place of safety. Then the and Humphreys, playe<br />\nsecond half and retired<br />\nthe<br />\nin<br />\nweight of the Virginia line, with its celebrated Meadows was hurt<br />\ndid well. Humphreys<br />\nwho<br />\ntackles, Walker and Lloyd, began to tell, and in favor of Sharretts,<br />\nat the sixth jolt reand<br />\ntimes<br />\nthree goals were scored in the last ten minutes was laid out five<br />\nrse. The ends<br />\nConve<br />\nof<br />\nfavor<br />\ntired unwillingly in<br />\nof the first half.<br />\npie who was<br />\nGilles<br />\nally<br />\nespeci<br />\nThe intermission was spent in much needed re- played brilliantly,<br />\nthan offenively<br />\ndefens<br />\nr<br />\nbette<br />\nd<br />\npairs and a severe but possibly just criticism of sick. Nelson playe<br />\nhalf, and<br />\nd<br />\nsecon<br />\nthe<br />\nin<br />\nthe officials. Captain Lloyd, of Virginia, who sively. He was hurt<br />\na strong<br />\nup<br />\nput<br />\nplace,<br />\nhis<br />\nhad evidently used up all his latent good man- Atkinson, who took<br />\n, game.<br />\nners and decency on previous visiting teams<br />\nn and<br />\nupon<br />\nmine<br />\ndeter<br />\nHopkins line up: Ends: Gillespie, Nelso<br />\ncould<br />\nipse,<br />\nhe,<br />\ns<br />\nsaid that unles<br />\ns:<br />\nGuard<br />\n.<br />\nBacon<br />\nand<br />\nnck<br />\n.Bla<br />\nthe umpire, the referee, the timekeepers, the line- Atkinson. Tackles:<br />\ne:<br />\nCentr<br />\nrse.<br />\nConve<br />\nand<br />\ns<br />\nhrey<br />\nmen, and the length of the halves; he wouldn't Whitman, Hump<br />\netts.<br />\nSharr<br />\nand<br />\nows<br />\nMead<br />\ner:<br />\nplay. These are merely his closing words. The Hancock. Quart<br />\nl Backs: Riggs, Bruton and McClintock.<br />\ngreat body of his speech is not worth the carefu<br />\nnecesediting and expurgation which would be<br />\nprivihis<br />\nthat<br />\ned<br />\nclaim<br />\nHe<br />\nn.<br />\ncatio<br />\nsary for publi<br />\n\"do<br />\nto<br />\nhim<br />\ned<br />\nallow<br />\nhost)<br />\na<br />\nas<br />\nlege (probably<br />\nCROSS COUNTRY RUN.<br />\nnia!<br />\nVirgi<br />\nfrom<br />\nthis<br />\nAnd<br />\ned.\"<br />\nleas<br />\nwhat he—p<br />\nbody<br />\nand<br />\nHis remarksso thoroughly impressed every<br />\nTwelve men, candidates for the Track<br />\nbor<br />\nneigh<br />\nhis<br />\nwith<br />\ndo<br />\nto<br />\nion<br />\nminat<br />\ndeter<br />\nand<br />\nnd<br />\nwith his<br />\nEngla<br />\nT.<br />\nJ.<br />\nby<br />\nd<br />\npanie<br />\nst, Field Team, accom<br />\nto<br />\nout<br />\nd<br />\nto the limit that Captain Sayler,after a prote<br />\nwalke<br />\n,<br />\nteam<br />\ns<br />\nyear'<br />\nlast<br />\nP. Wroth,Jr., of<br />\nunder<br />\ngame<br />\nthe<br />\nplay<br />\nto<br />\ned<br />\nallow<br />\nbe<br />\nwas glad to<br />\nes St. Avenue and Belvithe Electric Park via Charl<br />\nany terms. Captain Lloyd decided that<br />\nwitness Saturday's footto<br />\ntime<br />\nminutes. dere Avenue, in<br />\nhalves were to be twenty and fifteen<br />\nsix miles and a half,<br />\nnce,<br />\ndista<br />\nball game. The<br />\nthink<br />\ncan<br />\nyou<br />\ner<br />\nnumb<br />\nlarge<br />\nany<br />\nby<br />\nthis<br />\nMultiply<br />\nand a half. Those<br />\n. was covered in an hour<br />\ngame<br />\nthe<br />\nof<br />\ntime<br />\nl<br />\nactua<br />\nthe<br />\nget<br />\nwill<br />\nof and you<br />\nand Hayden,<br />\nforming the party were Randolph<br />\nin<br />\nCapta<br />\nthat<br />\ns,<br />\nthesi<br />\nparen<br />\nin<br />\nk,<br />\nremar<br />\nI might<br />\nThatcher,(Grad.); Baetup (Medicals); Barret and<br />\nlived<br />\nThey<br />\npart.<br />\nthe<br />\nd<br />\nlooke<br />\nals<br />\noffici<br />\nLloyd's<br />\nHopper, Adler,<br />\njer, Snowden, Plaggemeyer,<br />\nns.<br />\ntatio<br />\nexpec<br />\n's<br />\nLloyd<br />\nin<br />\nCapta<br />\nto<br />\neven<br />\nto our and<br />\nFreshman Class.<br />\nBryan, Smith and Libby of the<br />\nand<br />\nrules<br />\nthe<br />\nthat<br />\nple<br />\nprinci<br />\nthe<br />\non<br />\ned<br />\nThey work<br /><br />\nTHE VIRGINIA GAME.<br /><br />\n8<br /><br />\nTHE NEWS-LETTER<br /><br />\nBird. There are also Messrs. Tottle, from St'<br />\nl<br />\nJoseph's; Licking, from the Westchester Norma<br />\nThe new track and field team work began last School; Humerichouse and Blum.<br />\nCaptain Hoffman has revived the cross country<br />\nweek, and gradually the candidates are getting<br />\ninto shape. Director Mackdermott has insti- walks, the first of which was taken on last Sattuted a course of preliminary training and the urday afternoon. These walks are very benemen are all enthusiastic over the outlook, ficial and every member of the team should<br />\nnotwithstanding the severe losses of the team endeavor to go on one, whether it is convenient<br />\nfrom its membership of last year. Besides for him to do so or not.<br />\nwww<br />\nthose mentioned in the last issue of the NEWSLETTER thefollowing have returned and will work<br />\nLACROSSE OUTLOOK.<br />\nharder than ever for the success of \"Johnny'<br />\nThe plans of the management for the coming<br />\nHopkins: J. T. England, quarter-miler; G. B'<br />\nlacrosse<br />\nseason are slowly crystallizing. Mr.<br />\nScholl, jumper; Henry Becuwkes, sprinter; J. E.<br />\nByrne<br />\nis<br />\nbusy preparing his schedule of games<br />\nTyler, quarter-miler; Peregrine Wroth, half_<br />\nand<br />\nCaptain<br />\nTyler is taking out squads of men<br />\nmiler; L. G. Fishach, pole vaulter; F. H. Watto<br />\nDruid<br />\nHill<br />\nPark and is giving them practice<br />\nson, sprinter and quarter-miler; W. E. Hoffman<br />\nin<br />\ntipping<br />\nand<br />\nother light work.<br />\nW.<br />\nSimmons,<br />\n(now captain), quarter-miler ; W.<br />\nThe<br />\nnumber<br />\nof<br />\ngames to be played has not yet<br />\npole-vaulter; C. W. Young, vaulter and quarter_<br />\nbeen<br />\ndecided,<br />\nbut<br />\none thing is assured: there will<br />\nmiler, and H. Whitman, sprinter, quarter-miler<br />\nbe<br />\nno<br />\ngame<br />\nwith<br />\nStevens Institute this year.<br />\nholds<br />\nthe<br />\nand weight man. L. G. Fishach<br />\nThe<br />\nFaculty<br />\nhas<br />\ndecided<br />\nthis question.<br />\nrecord with the pole. Whitman, Hoffman and<br />\nNext<br />\nmonth<br />\nthe<br />\nInter-Collegiate<br />\nAssociation<br />\nEngland are tried runners.<br />\nwill<br />\nmeet<br />\nat<br />\nPhiladelphia<br />\nand<br />\nit<br />\nis<br />\nlikely that<br />\nof<br />\nCaptain<br />\nWoodruff<br />\nthe<br />\nteam<br />\nBesides the loss<br />\nStevens will be \"chucked\" and the University<br />\nheavy<br />\nlosses<br />\nas<br />\nfollows:<br />\nsustained<br />\nother<br />\nhas also<br />\nof Pennsylvania or Swarthmore, or perhaps<br />\nCapt. Howard Baetjer, whose high jump,5 feet<br />\nboth<br />\nwill probably fill the gap. All things point<br />\n11 inches, is the best ever made by a Marythat<br />\nway and a four club league will make<br />\nlander, Walter Carroll's, of Princeton, excepted;<br />\nthings<br />\nmuch more interesting than the old three<br />\nC. R. McInnes, who developed a quarter-mile<br />\nclub<br />\none.<br />\nspeed of 54 seconds; C. T. Harris, the big fellow<br />\nCoach Maddren positively states that he will<br />\nwho won nearly all of the Hopkins points with<br />\nnot<br />\nplay this year, and \"Mac\" has secured an<br />\nthe weights, and G. L. Radcliffe,the old quarter<br />\ninstructorship<br />\nin a Canadian college. So the<br />\nmiler. However, several gains have been made<br />\npositions<br />\nof<br />\ncover-point<br />\nand in-home as well as<br />\nby the team. Robert Garrett has returned to<br />\nthe<br />\nvacancy<br />\ncaused<br />\nby<br />\nFoster's<br />\ngraduation will<br />\nthe University and can be expected to win all the<br />\nhave<br />\nto<br />\nbe<br />\nfilled<br />\nby<br />\nnew<br />\nmen.<br />\nNearly all the<br />\nfirsts in the shot,hammer and discus events,and<br />\nother<br />\nmen<br />\nhave<br />\nreturned<br />\nand<br />\nSayler<br />\nwill also be<br />\nplaces in the broad and high jumps. Theodore<br />\nin<br />\ncondition<br />\nto<br />\nplay.<br />\nRiggs'return is almost providential in supplying<br />\nHowever, the outlook has been as \"blue\" as<br />\nsome substitute for Captain Woodruff. Many<br />\nthis<br />\nbefore and we may hope that the Black and<br />\ngains have also been made among the men who<br />\nBlue<br />\nwill land another championship banner this<br />\nrecently matriculated. Atkinson, of Marston's<br />\nyear.<br />\nschool, will be an addition to the sprinters, and<br />\nw w<br />\nE. L. Pessagno is one of the best broad jumpers<br />\nThe Freshman have elected R.Curzon Hoffman,<br />\nin the State. F. C. Blanck, of the West Branch Jr., manager, and A. B. Atkinson, Captain of<br />\nY. M. C. A., is also a valuable addition to the the class eleven.<br />\nwww<br />\njumpers. Among the Freshmen from whom a<br />\nOil<br />\nportraits<br />\nalways<br />\ndeveloped,<br />\nare<br />\nof<br />\nnearly<br />\nProfessors<br />\nRowland and Adams<br />\nis<br />\ntwo<br />\nwinner or<br />\nMessrs. Branch, Pagon, Hunley, Snowden, have been hung in the Physical lecture room and<br />\nBryan, Hopper, Marshall, Smith, Miller and in the main corridor of McCoy Hall,respectively.<br /><br />\nTRACK AND FIELD TEAM.<br /><br />\ni<br /><br />\n9<br /><br />\nTHE NEWS-LETTER.<br />\nATHLETIC COMMITTEE ELECTIONS.<br />\nAt an enthusiastic meeting of the Hopkins<br />\nAthletic Association held on Friday, the 26th, in<br />\nHopkins Hall, the following offiers were elected<br />\nto serve upon the athletic committee for the ensuing year:<br />\nProf. Renouf.<br />\nFaculty Delegate,<br />\nWm. Mackdermott.<br />\nPhysical lInstructor,<br />\nAlumnus<br />\nDelegate, Jas. Hodges,'86.<br />\nTheo. F. Riggs.<br />\nMedical School \"<br />\nR. F. Mulford.<br />\nGraduate<br />\nWm. Maddien.<br />\nPresident,<br />\nRobt. Garrett.<br />\nVice-President,<br />\nSecretary, Robt. Crane.<br />\nRecording<br />\nWm. B. Hill.<br />\nCorresponding \"<br />\nR. T. Abercrombie<br />\nTreasurer,<br />\nfHorace Whitman.<br />\nSenior Class Delegates: tAlfred W. Bruton.<br />\nfHorace Gillespie.<br />\nJunior \"<br />\nJoseph England.<br />\nA. B. Atkinson.<br />\nFreshman Class \"<br />\nThe constitution was amended to admit of the<br />\nelection of two secretaries instead of the usual<br />\none officer.<br />\nW ser<br /><br />\nJ. H. U.,6:P.&amp; S.,0.<br />\nIn an interesting game, Saturday, at Electric<br />\nPark, Hopkins with a seriously weakened team,<br />\nsucceeeded in defeating the College of Physicians<br />\nand Surgeons to the tune of 6 to 0. Hopkins<br />\nwent into the game badly crippled, for not only<br />\nwas she short two backs, McClintock and<br />\nRiggs, quarter-back, Meadows,and centre, Hancock, but several of the players who did enter<br />\nthe game were below their usual form on acccount of injuries sustained. The doctors had<br />\ngotten together their eleven only the Saturday<br />\nbefore, and consequently the team was semewhat new at the game. Hence the weakness of<br />\none side counterbalanced that of the other. In<br />\nthe game Hopkins clearly outplayed the P.&amp; S.,<br />\nour interference being far superior to theirs, and<br />\nour backs doing decidedly better work. Tyler,<br />\nalthough a man who has been out of the game,<br />\nmade several splendid end runs, while captain<br />\nSayler, although injured, made the \"star\" play<br /><br />\nii<br /><br />\nof the afternoon by running three-fourths the<br />\nlength of the field, going through the entire<br />\nP. &amp; S. eleven and scoring the only touchdown<br />\nof the game. Butler, Hopkins old standby, went<br />\ninto the game for the first time this season, and<br />\nmade his presence felt by opening up the P. &amp; S.<br />\nline for heavy gains. Whitman took Hancock's<br />\nposition at centre, and Morse replaced Meadows<br />\nat quarter. The doctors line outweighed the<br />\nBlack and Blue, but notwithstanding this difference in weight, our men held fairly well. Everybody was expecting to see Hopkins score in the<br />\nsecond half, but although on one or two occasions she carried the ball to within 10 or 12<br />\nyards of the P. &amp; S. goal, for some reason or<br />\nother, another touchdown wasn't made,the ball<br />\nalways being lost on downs. The playing.<br />\nseemed to lack sufficient snap.<br />\nNext comes Western Maryland for the championship (Nov. 3) and before that date several<br />\nhard practices are needed.<br />\nThe line up is as followsP. &amp; S.<br /><br />\nHOPKINS.<br /><br />\nPOSITION.<br /><br />\nGillespie,<br />\nButler,<br />\nBlanck,<br />\nWhitman,<br />\nYearley,<br />\nBacon,<br />\nNelson,<br />\nMorse,<br />\nTyler,<br />\nSayler,<br />\nBruton,<br /><br />\nSudler•<br />\nLeft end.<br />\nNichols.<br />\nLeft tackle,<br />\nE.E. McGinty<br />\nLeft Guard,<br />\nDixon.<br />\nCentre,<br />\nBell.<br />\nRight guard,<br />\nJ. A.1‘.4cGinty<br />\nRight tackle,<br />\nCampbell.<br />\nRight end,<br />\nQuarter,<br />\nJackson.<br />\nLeft half-back,<br />\nRight half-back, Cupp.<br />\nMcKay.<br />\nFull back,<br /><br />\nTouchdown—Sayler. Goal—Sayler. Score, J. H.<br />\nU., 6—P.&amp; S., 0. Halves-20 and 15 minutes. Umpire—Conlin (P. &amp; S.) Referee—Cosler U. H. Med.)<br />\nLinesmen—White and Contry. Timers—Mackdermott<br />\nand Samuels.<br />\nW<br /><br />\nWISDOM.<br />\nHe who knows not, and knows not he<br />\nKnows not,—he is a Freshman. Scorn him.<br />\nHe who knows not and knows he knows<br />\nNot,—he is a Sophomore. Pity him.<br />\nHe who knows and knows not he knows,—<br />\nHe is a Junior. Honor him.<br />\nHe who knows, and knows he knows,—<br />\nHe is a Senior. Reverence him.<br /><br />\nEx.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br />\nCLASS ELECTIONS.<br /><br />\nThe Senior Class after a spirited campaign,has<br />\nchosen its officers as follows: President, Horace<br />\nS. Whitman; Vice-President, J. Straith Briscoe;<br />\nSecretary, Olin Shreve; Treasurer, Robert B.<br />\nMorse. The other officers remain to be elected.<br />\nwww<br />\nThe officers of the Junior Class are Robert<br />\nTreat Crane, elected President for the second<br />\nsuccessive time;Robert E. Moore,Vice-President;<br />\nWilliam J. Sneeringer, Secretary; B. Swayne<br />\nPutts, Treasurer; Lewis J. White, Sergeant-atarms; Ross M. Diggs, Historian; Peregrine<br />\nWroth,Jr., Poet.<br />\nwww<br />\nThe Freshmen have elected: President, William<br />\nS. Bird; Vice-President, Wethered Lilly; Secretary, Joseph Smith, Jr.; Treasurer, William<br />\nSnowden; Sergeant-at-arms, Alexander Yearley,<br />\nJr.<br />\nThe Senate of the University has organized for<br />\nthe work of the year. The new officers are Harry<br />\nStephenson Byrne, President; J. Gresham<br />\nMachen, President pro tern.; Alfred W. Bruton,<br />\nSecretary; J. Abner Sayler,Jr.,Sergeant-at-arms.<br />\nwww<br />\nThe House of Representatives has chosen the<br />\nfollowing officers; John G. Campbell, Speaker;<br />\nWilliam Kirk, Speaker pro tern.; Peregrine<br />\nWroth, Secretary; Horace Gillespie,Sergeant-atarms.<br /><br />\nw<br />\nA CURIOSITY.<br />\nA very interesting fact was brought out in the<br />\nJunior Literature Class last week. In that part<br />\nof the prologue to Chaucer which speaks of \"A<br />\ngood Wyf was ther of bisyde Bathe\" there are to<br />\nbe found [L 487-8] the couplets:<br />\n\"She coude moche of wandring by the weye.<br />\nGat-tothed wasshe,soothly for to seye.\" This<br />\nphrase \"gat-tothed\" has for many years disturbed the minds of students of Chaucer.<br />\nSome have decided that this signifies lasciviousness; others thought that it possibly described her desire for travel. For in England and<br /><br />\nin Ireland it is believed that the country folk<br />\nsome years ago used to judge by the arrangement<br />\nof a child's teeth whether it should be a \"home<br />\nstayer\" or a traveller.<br />\nDr.Greene asked if any member of the class had<br />\never heard this saying, and although he had put<br />\nthis question to previous classes, this year is the<br />\nfirst time that any men have been found who<br />\nhad heard this expression. The men who heard<br />\nit before were: Lyman Murphy, Henry B. Law<br />\nand William B. Hill, who came across it while<br />\nrusticating in Hartford County, Md.<br />\nThe testimony of these men will gofar in clinching the argument that the \"good Wyf\" was a<br />\ntraveller and not a lascivious woman.<br />\nWWW<br /><br />\nTHE CIGARETTE BUSH.<br />\nWhin I git big I'm goin'<br />\nTo a country fur down South,<br />\nWhere I'll lay around all day<br />\nWith a cigarit in me mouth,<br />\nAn' puff like some ole chimny,<br />\nAn'fergit erbout me woes,<br />\nIn th' bright an' sunny land<br />\nWhere<br />\nTh'cigarit bush grows.<br />\nThere won't be none to break me up<br />\nWhin th' smoke curls round me head,<br />\nAn'I won't have ter chope th' stump<br />\nUntil it's limp an' dead;<br />\nThere'll be none to search me pockits,<br />\nNor to smell me reekin' close,<br />\nIn th' bright an' sunny land<br />\nWhere<br />\nTh'cigarit bush grows.<br />\n0 thim times is slow a-comin'<br />\nBut there comin' all th' same,<br />\nAn' it's Turkish Cross ter Richmonds<br />\nThet I'll be in the game;<br />\nWhin I'm old ernuff ter go away<br />\nAn' fergit me mortil throes,<br />\nIn th' bright an' sunny land<br />\nWhere<br />\nTh' cigarit bush grows.<br />\njOIIN C. CATON.<br /><br />\nww<br />\n\"Mr. Dooley on Commencement\" in the NEWSLETTER is excellent as an imitation and funny in<br />\nitself, which is more than Mr. Dooley, the original, always is himself.<br />\nThe Mt. Holyoke.<br /><br />\nTHE NEWS-LETTER.<br />\nANSWER TO \"A PLEA.\"<br />\nMr. Editor,<br />\nDear' Sir:—<br /><br />\n1I<br /><br />\ntions will be the Harvard Lampoon, Princeton<br />\nTiger, Cornell Widow, Pennsylvania Red and<br />\nBlue, Columbia Morningside, Yale Weekly, etc.<br />\nAlso the WOMAN'S COLLEGE KALENDS.<br />\nor or or<br /><br />\nIn \"A Plea,\" \"S.S.\" gives<br />\nCHESS CLUB.<br />\nus a very sensible statement, which, by the way<br />\ntouches upon the policy pursued by the Junior<br />\nThe Chess Club, which had such a prosperous<br />\nClass this year, viz: the election of lower 'classseason last winter, is in the midst of a tournamen into their body. Had \"S. S.\" investigated<br />\nment to decide upon the team which is to be<br />\nthe matter, he would have soon found that the<br />\npitted against the West Branch Y. M. C. A.,and<br />\nSub-Freshman are a distinct and separate class,<br />\nother clubs this year. The results up to date are:<br />\nhaving elected officers some time since. The<br />\nPERCENT.<br />\nWON.<br />\nLOST.<br />\nPLAYERS<br />\nwriter is evidently a Junior, for the fear lest his<br />\n800<br />\n8<br />\n2<br />\nV. Edgeworth Smith,<br />\nclass \"be opposed by 65 men\" would not come Lloyd P. Shippen,<br />\n750<br />\n7/<br />\n1<br />\n2<br />\n2/<br />\n1<br />\n2<br />\nto any other classman.<br />\n714<br />\n5<br />\n2<br />\nC. Markell, Jr.,<br />\n250<br />\n1<br />\n3<br />\nPermit me to inform him that the strength of L. S. Hutzler,<br />\n100<br />\n4/<br />\n1<br />\n2<br />\n17i<br />\nthe Freshman Class is 55 men, and that exactly J. G. Machen,<br />\n000<br />\nDapprich,<br />\n2<br />\n0<br />\n6 students compose the Sub-Freshman body. It F. R.<br />\n000<br />\n0<br />\n3<br />\nR. L. Ramsay,<br />\nis indeed \"a terrible calamity in college life\" to R. C. Sharretts,<br />\n000<br />\n3<br />\n0<br />\nbe without a class in the Senior year; but why T. W.Glocker,<br />\n000<br />\n0<br />\n0<br />\nhas the class of which \"S. S \"is a member, done<br />\nthis very thitig against which he warns the<br />\nFACULTY CHANFES.<br />\nFreshmen, when, as he says,\"it will bring great<br />\nharm to the fair name which our class contests<br />\nMany changes have taken place in the faculty<br />\nhave held, and will invoke irrevocable wrong of the University. Although several prominent<br />\nupon the individual members of both classes\"?<br />\nmen have resigned and gone to other colleges it<br />\nWill the Freshman not be perfectly justified in is generally believed that the faculty has not<br />\naccepting the aid of the Sub-Freshman in the been at all weakened, for the vacancies have<br />\nclass foot-ball game and cane rush, when 1902 been filled by men well known for their high<br />\nis assisted by men who, according to the college standing in the world of literature and science.<br />\nstatus, have no right to be among them?<br />\nThe following are among the most important<br />\n\"S. S. exhorts the Freshmen to respect the col- changes that have been made since last June:<br />\nlege traditions and their innate desire for fair<br />\nIN THE PHILOSOPHICAL FACULTY:<br />\nplay which his class has disregarded. \"Do as I<br />\nFrank Morley, M. A., D. Sc, recently Professor in<br />\nsay, but not ^ my class does,\" says he. 1903 Haverford College, to be Professor of Mathematics.<br />\nhas done so, but suggests that \"people in glass<br />\nHarry C. Jones, Ph. D., formerly Associate, now<br />\nhouses shouldn't throw stones.\"<br />\nAssociate Professor of Physical Chemistry.<br />\nFRESHMAN.<br />\nP. S. We Freshmen may be green, but such<br />\nJohn B. Whitehead, A. B., formerly Instructor, now<br />\nshams as the recent letter by\"A Freshman\" and Associate in Applied Electricity.<br />\n\"A Plea\" are easily seen through.<br />\nHarry L. Wilson, Ph. D., formerly Instructor, now<br />\nAssociate in Latin.<br />\ngr- ger<br /><br />\nEXCHANGE PLACE.<br />\nThe exchange department begs to announce<br />\nthat it will place its exchanges on the magazine<br />\ntable in Levering Hall, for the benefit of Hopkins<br />\nstudents. Among other leading college publica-<br /><br />\nJ. Eustace Shaw, Ph. D., formerly Fellow, now<br />\nInstructor in Italian.<br />\nEdward D. Durand, Ph. D., has been appointed<br />\nLecturer in American Finance.<br />\nWilliam F. Willoughby, A. B., has been appointed<br />\nLecturer in Social Economics.<br /><br />\nPAINE.<br />\nGORDON P. PAINE.<br /><br />\nMEMBERS OF<br />\nNEW YORK STOCK EXCHANGE<br />\nBALTIMORE STOCK EXCHANCI,<br />\nCHICAGO BOARD OF TRADE.<br /><br />\nCLINTON P.<br /><br />\nCALL 0\\<br /><br />\nJAS. H. DOWNS,<br />\n229 N. CHARLES ST.<br /><br />\nCLINTON P. PAINE &amp; CO,<br />\nBANKERS<br /><br />\nAND<br /><br />\nBROKERS,<br /><br />\nMASONIC TEMPLE.<br /><br />\nIPOR Class, Fraternity and College Stationery, Banquet Cards,<br /><br />\n217 EAST GERMAN STREET,<br /><br />\nPRIVATE WIRES 70<br />\nNEW YORK AND CHICAGO.<br /><br />\nInvitations, Diplomas, Programs, Visiting Cards, etc.<br /><br />\nBALTIMORE, MD.<br /><br />\nMORITZ MOSZKOWSKI,<br />\nThe distinguished musician, composer, pianist, and teacher, of<br />\nParis, writes as follows regarding the<br /><br />\nThe Chas, Willms Surgical Inst[ument Co,<br /><br />\nMASON &amp; HAMLIN PIANOFORTE.<br /><br />\nBENJ. A. NELSON, GIEN'L MANAGER.<br /><br />\n\"It has a full, singing tone, and the action is most satisfactory.<br />\nTaken as a whole it is, I believe, an instrument of the very first<br />\nMoRrrz Moszitowsm.<br />\n(Signed)<br />\nrank.\"<br />\nC.<br /><br />\nH. Hildebrandt &amp; Son, Sole Agts.<br /><br />\n321 N. Howard Street.<br /><br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br />\n300 N. HOWARD ST.<br /><br />\nBALTIMORE, MD.<br /><br />\nDrovers St Mechanics National Bank of Baltimore.<br />\nCapital Stock $300,000.<br /><br />\nSurplus and Profits, $350,000.<br /><br />\nTRANSACTS A GENERAL BANKING BUSINESS.<br />\nSafe .2)(Pposie 91o,eas<br /><br />\nTames Clark, President.<br />\nLeopolrl Strange, Vice-President.<br /><br />\nA. H. FETTING,<br />\n14<br /><br />\nAND<br /><br />\n$%.7.6,0<br /><br />\nWpwarre.<br /><br />\n_ (\\ter<br />\nraver ,<br /><br />\nJ. I). Wheeler, Cashier.<br />\nChas. S. Miller, A ss't Cashier.<br /><br />\nPu lic)kers/i,<br /><br />\nMANUFACTURER OF<br /><br />\n5)/<br /><br />\nfireeR Doer Fraternity<br />\nJewelry.<br /><br />\n?I7 E.BALTa.<br />\nBALTIMORE, MD.<br /><br />\n16 ST. PAUL STREET.<br /><br />\nPLEASE CALL AND EXAMINE OUR LINE BEFORE PURCHASING<br /><br />\nLLOYD S. S. CO.<br />\nNORTH GERMAN<br />\n,r ,r<br /><br />\nNEW VOL&amp; TO BREMEN,<br />\nLONDON, PARIS, GIBRALTAR,<br /><br />\nCABIN PASSAOE AT LOW RATES.<br /><br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br /><br />\nA. SCHUMACHER &amp; CO<br />\nGeneral Agents.<br /><br />\nFor particulars apply to<br /><br />\nDIRECT.<br /><br />\nAFR JO SURETY BONDS.<br /><br />\nKranz-Smith<br />\npiano Co.<br /><br />\nthe<br /><br />\nFidelity and Deposit Company of Maryland,<br /><br />\n109 and III North Charles Street.<br />\nSOLE AGENTS<br /><br />\nCbickering, Bradbury and Webster<br /><br />\nit* Pianos. *it<br />\nC. &amp; P. Phone 2322-2.<br /><br />\nFactory Prices<br /><br />\nIBA1'TI.F.1\"I', HAYWARD (Se CO.<br /><br />\nFounders and Engineers, •<br />\nWorks, Pratt and Scott Sts.<br />\nOffice Calvert and German Sts.<br />\nManufacturers ofCast and Wrought Iron Work for Buildings.<br />\nStores, Railings, Balconies, Guards, Vaults and Area Lights, Iron,<br />\nZinc and Copper Sheet Metal Work, Hydraulic Passenger and Freight<br />\nElevator., Hot Water and Steam Heating Apparatus, Vertical and<br />\nHorizontal Tubular Boilers, Wrought Iron Tanks, Gas Holders, Purifiers, Condensers, etc. Columns, Plates, Girders, Beams and Beam<br />\nGirders, Wrought Iron Roof Framing and Road Bridges.<br />\nCHARLES AND LEXINGTON ST*.<br />\nBECOMES SURETY ON ALL CLASSES OF BONDS.<br />\nSAFETY DEPOSIT BOXES.<br />\n,<br /><br />\nEDWIN WARFIELD, Pres't.<br />\nist Vice-Pres't, H. Crawford Black.<br />\n2nd<br />\n\"<br />\nJos. R. Stonebraker.<br />\n3rd<br />\n\"<br />\nThos. A. Whelan.<br /><br />\nIT. E. BOSLER, Seey-Treas.<br />\nharry Nicodem<br />\nAss't See'y-Tretts<br /><br />\nBOOKS Old and<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks bought, sold and exchanged. . . .<br />\nW M. V. PIPPEN,<br /><br />\nEISENBRANDT'S<br />\nLeading Dealers in Baltimore in everything known in Music.<br />\nSole Agents for<br />\nMandolins, Guitars, Banjos<br />\nand Zithers.<br />\n4j1Ingelust Automatic Attachments for<br />\nPianos.<br />\nREGINA MUSIC BOXES.<br />\nGRAMOPHONES, ETc.<br />\n201-203 N. CHARLES STREET.<br /><br />\n\"Washburn\"<br /><br />\n605 N. Eutaw St.<br /><br />\nS7vVITH. DIXON St CO.<br />\n--i<br />\nji<br />\n(1.1SCt<br /><br />\n04 PAPER<br /><br />\n.p N.CHARLES 5!<br /><br />\nse4G.Fyip/04:<br />\nv.04,A,'•<br />\n29-31 8_ CHARLES ST_<br /><br />\nNEW YORK TO LONDON DIRECT.<br /><br />\nLAGER BEERS<br /><br />\nGlobe<br />\nBrewery<br /><br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers<br />\nat reasonable rates.<br /><br />\nEioldbrau and Wumurger.<br />\nAbsolutely Pure and Wholesome.<br />\nNone better on American Market.<br /><br />\nATLANTIC TRANSPORT CO.<br /><br />\n1 BROADWAY,<br /><br />\n403-409 WATER ST.<br /><br />\nNEW YORK.<br /><br />\nBALTIMORE.<br /><br />\nJ. Wm. Middendorf,<br /><br />\nWm. 11. Oliver,<br /><br />\nWilson Keyser, Cashier.<br /><br />\nLawrence B. Kemp, President.<br /><br />\nGOrfiffiERCIFIL &amp; FFIRII1ERS NOTIONfIL BANK,<br /><br />\nMIDDENDORF OLIVER &amp; CO..<br /><br />\nBankers and Brokers,<br /><br />\nHOWARD<br /><br />\nAND<br /><br />\nSTREETS,<br /><br />\nGERMAN<br /><br />\nBALTIMORE, MD.<br /><br />\n205 EAST GEDZIVIA.N<br />\nMembers<br />\nBALTIMORE,<br />\nBaltimore Stock Exchange.<br /><br />\nMD.<br /><br />\nOffers to Depositors every facility which their Balances, Business<br />\nand Responsibility warrant.<br /><br />\n/10<br /><br />\n(Uedding Silver Triitdselsor<br />\nIN GREAT<br /><br />\nijAC0111<br /><br />\nSilversmiths.<br />\nHENDERSON'S ot<br />\n216 N. CHARLES ST.<br /><br />\n47<br /><br />\nZE<br />\n,<br />\n324 W. 1.3AL;TI1\\401<br />\nMANUFACTURERS OF<br /><br />\nGushing Companu,<br /><br />\nVVIHST<br /><br />\nCAPS.<br /><br />\nBOOKSELLERS...<br />\nSTATION ERS.<br /><br />\nversity,johns Hopkins Hospital' and The Woman's College of Balto.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nPRICES.<br /><br />\nllgenfritz<br />\nStudio.<br /><br />\nL.F.:X I rarrolv<br /><br />\nHELEN M. 1-10L,L,YDAY,<br /><br />\nand capital.<br /><br />\nStandard Organs.<br />\nPianos For Rent.<br /><br />\nTuning, Repairing<br />\nAccommodating terms.<br /><br />\nWrite for Illustrated Cata[logue.<br />\nCHAS. M. STIHPP.<br />\nD. C.<br />\nWashington,<br />\nW.,<br />\nN.<br />\n,<br />\nSt<br />\nnth<br />\n521<br />\nMd.<br />\nBaltimore,<br />\n9 N. Liberty St.,<br /><br />\nB. G. EICHELBERGER,<br />\nBOOKS AND STATIONERY,<br />\nENGRAVING AND STAMPING.<br />\nNo. 308 North. Clint-lee Street,<br /><br />\ns-ru.tit EX.<br /><br />\nSPECIAL DISCOUNT TO STUDENTS.<br /><br />\nYou get the benefit fo<br />\nall this labor,skill,brains<br /><br />\nFs<br />\nTIE<br />\nplANO<br /><br />\nShirts, Neckwear, Underwear,<br />\nHosiery, etc.<br /><br />\nSUCCESSOR TO CUMMINS<br /><br />\n20<br /><br />\n4q1b-Cib-HOF'KINS<br /><br />\nSilk and Cassimere Hats.<br /><br />\nHABERDASHERS,<br /><br />\n203 W. BALTIMORE AND 2 S. LIBERTY STREETS.<br /><br />\npbotographe<br /><br />\nHATTERS, 6. CANES, ETC.<br /><br />\nAgents for Lincoln &amp; Bennett and Walter Barnard's London Hats.<br /><br />\nSCHOOL, Law, MEDICAL, CLASSICAL AND MISCELLANEOUS 500511.<br />\nKeeps constantly on hand the Text Books used Ill .johns Hopkins Uni-<br /><br />\nMADISON &amp; HOWARD STS.<br /><br />\nHIGH GRADE GOODS—LOW<br /><br />\nPAINE.<br /><br />\n34 W. BALTIMORE STREET.<br /><br />\nUNIVERSITY<br />\nBOOK STORE,<br /><br />\nTHE BLAKE CO<br /><br />\nR.<br /><br />\nWAHNE.',R 8c CO.<br />\nUMBRELLAS,<br /><br />\nVARIETY<br /><br />\na/UNKINS.<br /><br />\nTEXT BOOKS, NOTE BOOKS,<br />\nSTUDENT'S SUPPLIES.<br /><br />\n.JAMES<br /><br />\nTHEO. WARNER,<br /><br />\nESTABLISHED 1879.<br /><br />\nT. M. C.<br />\nC. &amp; P. Telephone<br /><br />\nA.<br /><br />\nBUILDING,<br /><br />\nBALTIMORE, MD.<br /><br />\n2351.<br /><br />\nBartholomay Brewery eo.<br />\nROCHESTER,N.Y.<br /><br />\n800 N. EtTIMAW S.F.<br />\nBALTIMORE. MD.<br /><br />\nNew and Second-Hand Books, Text Books, Note Books, Students'<br />\nRequisites, etc., etc.<br />\nBooks Bought, Sold, ;Ind Exchanged.<br /><br />\nIinheuser-Bnsch<br />\nBrewing Ass'n<br />\nSt. Louis, Mo.<br />\nBrew the Best Beers<br />\nin the World.<br />\n•ALTIMOPIE BRANCH:<br /><br />\nLOUIS ILLMER,<br />\nGen'l Agent and Mgr.<br /><br />\nC. eic. P. Telephone<br />\n2314.<br /><br />\nBARTHOLOMAY'S IS THE Bohemian<br />\n•ORIGINALAND FAMOUS ®<br /><br />\nBavarian<br />\nROCHESTER BEER Maerzen 13rfau<br />\nBALTIMORE<br />\n,,. • BRANCH,<br />\n2.27-239S.LENTRAL AVE<br />\nt.) C RO •<br />\n• MANAGER<br /><br />\nTRADE MARK.<br /><br />\nApollo<br /><br />\n•• •<br /><br />\nOffice and Depot, 227-2.39 5. Central Avenue.<br /><br />\nGEo. C. SUCRO, Sole Agent.<br />\nC. &amp;<br /><br />\nTelephone 1060<br /><br />\ncTONEBRAKER BROS.,aq.<br />\n21 Z<br /><br />\nE. Baltimore St.<br /><br />\nHome Telephone 2060<br />\nVISITING CARDS<br />\nNEATLY ENGRAVED<br />\nSHORT NOTICE.<br /><br />\nFORD'S! Ir,THE THEATRE<br /><br />\nLEMMERT<br /><br />\nONE<br />\nWEEK.<br /><br />\nTAILOR<br /><br />\nNOV. 12,<br />\nONE<br />\nWEEK<br /><br />\nDRAPER<br /><br />\nOF BALTIMORE.,,rg<br /><br />\nDANIEL FROHMAN'S COMPANY,<br />\nIn Three Successes.<br />\nThe Leading Company of America.<br /><br />\nNOV. 5,<br /><br />\ngoo,<br /><br />\nKELCEY &amp; SHANNON,<br />\nIn the Lyceum Theatre Comedy Success.<br />\n'My DAUGHTER IN LAW.\"<br /><br />\nGARMENTS AS PATTERNED BY<br />\nLEM M ERT ARE MADE TO FIT<br />\nTHE WEARER, PLEASE TH E<br />\nPUBLIC AND PRESENT THE MAN<br />\nAS PERFECTLY AS THE TAILOR<br />\nCAN ATTAIN TO.<br /><br />\ntNi§nkii1ZatiNiNitigikZZtateilleigitiBitititi?~faitiat<br />\ny<br />\nis the noblest part of your<br /><br />\nOUR HEAD, SIR<br /><br />\nLEMMERT,<br />\n14 E. FAYETTE STREET.<br /><br />\nMINOR'S,<br /><br />\n0<br /><br />\n216 NORTH<br /><br />\nP. S.<br /><br />\nWE CATER ESPECIALLY TO THE NEEDS OF<br />\nSTUDENTS.<br /><br />\ntiotizAPFEL<br /><br />\nBEizet<br /><br />\nImprove its appearbody.and comfort by wearfillee<br />\ning OUR HATS.<br /><br />\nEUTAW STREET,<br /><br />\nUP-TO-DATE,<br /><br />\notra<br /><br />\nONE PRICE.<br /><br />\nNzzzeamizzieeazzeeiteeeimeeeeitsitE<br />\nEMBERS OF THE MANDOLIN CLUB and all musically inclined IliwKiNs men who desire to purchase a<br />\nstringed instrument should visit the only manufacturers in Baltimore.<br />\nHOLZAPFEL &amp; BEITEL, 306 PEARL ST.,<br /><br />\n*Mandolins*<br />\nGUITARS AND BANJOS.<br /><br />\nNEAR SARATOGA ST.<br />\nINSTRUMENTS TAKEN IN EXCHANGE.<br /><br />\nOPEN EVENINGS.<br /><br />\nLARGE STOCK AND INSTRUMENTS MADE TO ORDER.<br /><br />\nFor Advertising Space in<br />\nthis Paper apply to<br />\nSTONEBRAKER BROS.<br />\nPrinters, Engra.verx anD<br />\nPublisherx.,9(garegeg<br />\n217 E. BALTIMORE STREET,<br />\nC.6 P. Telephone 2547.<br /><br />\nBALTIMORE. MD.<br /><br />"}], "field_media_file": [{"target_id": 36161, "display": null, "description": null, "target_type": "file", "target_uuid": "f6596e5c-3af3-4785-8d62-8bf50e18dff6", "url": "http://digital.library.jhu.edu/system/files/2022-03/12152-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12152, "target_type": "node", "target_uuid": "824016ba-8b40-4d0d-84e5-da3bcc0b9866", "url": "/node/12152"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "d3335f34-3da8-43d3-9b9c-909f2e173a28"}]}