{"mid": [{"value": 36841}], "uuid": [{"value": "717f6854-f3b5-4e6d-a06e-fa04e82f8f58"}], "vid": [{"value": 36841}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:54:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13056-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:54:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:54:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVII. No. 42<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nBALTIMORE, MD., MARCH 27, 1923<br />\n<br />\nPROMINENT CIVIL ENGINEER CROKER CHOSEN HEAD OF PRISSMAN'S TEAM LEADING<br />\nFRATERNITY FRESHMEN<br />\nSWINDELL CALLS ON TICKET<br />\nIN TICKET SALES. TURN<br />\nMUSICAL CLUB AT ANPEP<br />\nTHINGS<br />\nTO<br />\nADDRESSES A. S. C. E.<br />\nSELLERS<br />\nSHOW ABILITY AS ENIN $200<br />\nUP<br />\nELECTION<br />\nNUAL<br />\nTERTAINERS<br />\nRefers to Virginia Bridge as<br />\nThursday Assembly Turned Over Annual Greek Smoker Held.<br />\nSupper at Barn Precedes Selection Sales Rather Slow. ApproximateUnique Achievement. Large<br />\nto Discussion of Spring Sealy $1000 Worth Sold. Swarthof New Men<br />\nAudience Hears Talk<br />\nKeyes Urges Men for Inson Ticket Campaign<br />\nre Team Second<br />\nin<br />\nEffort<br />\nSale<br />\ncreased<br />\nAt<br />\nthe<br />\nwas<br />\nelected<br />\nmost important monthly<br />\nJohn H. Croker<br />\n\"Pop\" Swindell was present at<br />\nSince<br />\nthe<br />\nannouncement of the<br />\ninstrumental<br />\nsongs,<br />\nSpeeches,<br />\nmeeting of the year, held last president of the Musical Clubs on<br />\nthe assembly on Thursday to inthe<br />\nof<br />\nspring season tickopening<br />\nject a little pep in the Spring sea- selections, and refreshments were Tuesday, March 20, by the Hop- last Thursday evening at the<br />\nMr. Swindell at<br />\nby<br />\net<br />\ncampaign,<br />\nson ticket selling campaign, which the high lights of the Freshman kins student chapter of the Amer- Barn, when the entire oranization<br />\nthe assembly on Mif.A-ch 15, cmiiin consideration of the short time Smoker, which was given to the ican Society of Civil Engineers, joined in a supper, which was fola little over a $1,000 has been soremaining before the early games fraternity men by this year's Mr. P. J. Lang, Jr., Engineer of lowed by farewell speeches of this<br />\nlicited by the students at Johns<br />\non the schedule, has been lagging pledgees. The Barn was crowded Bridges on the Baltimore and<br />\nyear's officers and by the election Hopkins. Last Friday when the<br />\nbadly. With \"Pop\" leading the<br />\nOhio Railroad, addressed a large<br />\nto capacity with the representathe management .for 1923-24. \"News Letter\" went to press,<br />\nof<br />\ndiscussion, the objections of prosaudience on topics of vital interJohn<br />\nSherwood, the retiring University of Washington, with<br />\npective customers to buying the tives of Hopkins' thirteen frater- est to egineering men. Mr. Lang<br />\npresident,<br />\ncongratulated the men Prissman as its captain, was settickets, and suitable answers for nities when a quartet composed of is a graduate of the University of<br />\non the discipline of the club ting the pace. This team's sales<br />\nthese objections, were talked over. Abbott, Sherwood, Croker and Pennsylvania, and has been acthroughout the past season, and have amounted to $200. Next in<br />\nMr. Swindell was greatly disap- Rich appeared as the first number tively engaged in civil engineering<br />\nwent on to urge a system of line was Swarthmore, captained<br />\npointed because the students on the program. The singers work for several years. During<br />\n\"doubling<br />\nup\" by men who re by \"Joe\" Leopold, which team<br />\nthe first part of his lecture he<br />\nhave not been putting sufficient<br />\nwere followed by Dr. Van Orman,<br />\nsing and to play in has sold tickets to the amount of<br />\nboth<br />\nto<br />\nable<br />\nspoke on the \"Reconstruction of<br />\nenergy into this _ticket selling<br />\nwho spoke on the importance of the River Span Crossing the Alle- some one of the other clubs. The $194. Both of these teams are<br />\nbusiness.<br />\neffect of such a system would be made up of non-fraternity men.<br />\nThe plans mentioried at the pre- the men keeping up in their stud- gany River at Foxburg, Pa.\" The<br />\nto produce an organization at However, Dartmouth, with Colvious assembly were gone over ies. Fargo, Hambleton, Town- speaker illustrated his talk with<br />\nonce<br />\nsmaller and more mobile. lins captain, promises to give<br />\nagain, and additional hints were send and Milburn then gave some many interesting slides.<br />\nplenty of<br />\nalso expressed his sym- these two teams<br />\nSherwood<br />\nMr. Lang referred to the bridge<br />\ngiven. Mr. Swindell- asked the selections a la Hawaiian. Mr.<br />\nClose<br />\nbehind<br />\ntrouble.<br />\nDartmouth<br />\npathy with the plans of Dr. Goodfellows to tell whatever had hap- Keyes was next on the program; as a unique achievement in conand Mr. Turnbull, who de- comes University of North Danow<br />\ndifpened to them -while selling tick- he tried to impress on his audience struction work, in that several<br />\nsire for the Glee Club more se- kota, captained by Wasserman,<br />\nets that would be helpful to others. the necessity of making the spring ficult problems had to be solved<br />\nrious music, music that will stay who has realized sales to the<br />\nSeveral responded, and Hopkins, season ticket campaign a success. before and during its construction.<br />\nwith the men after they leave the amount of $115.<br />\na Freshman, told at considerable At the conclusion of his talk he He first explained the method of<br />\nTheir ultimate object, Next in line is Coady's team<br />\nuniversity.<br />\nlength of the treatment which he asked for guarantees from the va- placing the new span in position<br />\na department of mu- with $79, while closely pursuing<br />\nis<br />\ncourse,<br />\nof<br />\nand Buck Baldwin had received rious fraternities as to their sales. and removing the old one. The<br />\nthem is Cornell, Zollers captain,<br />\nat<br />\nHopkins.<br />\nJohns<br />\nsic<br />\nfrom the men they had visited. The average number pledged was supports of the old span were rewith $65. E. Kirwan, Harvard's<br />\nalso<br />\ncongratuDon<br />\nVanneman<br />\nThe stories of Hopkins and the about 100, which means a total moved, and the truss nearest the<br />\nhas reported $44, and<br />\ncaptain,<br />\nlated the men on their success<br />\nother fellows showed clearly that amount of 1,300 tickets to be sold. bridge locked to the new. It was<br />\nNew<br />\nYork<br />\nUniversity is credited<br />\nduring the year and sounded the<br />\nit is quite possible to dispose of The \"Ballad of Yukon Jake\" by then guyed and when the new<br />\nwith<br />\n$20.<br />\nwatchword for its activity under<br />\nService, was then recited by Nel- span could finally be put into pothe tickets.<br />\nMany of the teams have made<br />\nnew management—\"never to<br />\nthe<br />\nto<br />\nhitched<br />\nwas<br />\nfar<br />\ntruss<br />\nthe<br />\nsition<br />\nLack of work on the part fo the son Young, who was one of the<br />\nno<br />\nreports at all. Although many<br />\ngo backward, always forward.\"<br />\nundergraduates is the chief cause stars of the evening. The enter- the new. The whole operation ocof them have made a number of<br />\nelection.<br />\nthe<br />\non<br />\nwith<br />\nwent<br />\nHe<br />\nthen<br />\nis<br />\nwhich<br />\nhours,<br />\neight<br />\nabout<br />\ncupied<br />\nfor the poor returns from the tainment was concluded by a Jazz<br />\ntime was A list of nominees, proposed by sales, their captains have failed to<br />\nticket selling clmpaign. \"Pop\" Band with Sater, Grace, Barry, not fast work. Good<br />\nrunning the retiring officers, was read and inform Graduate Manager Norin<br />\nhowever,<br />\nSwindell and Johnny Sherwood Vanneman, Kelbaugh and Urner registered,<br />\nspans with but few exceptions, accept- man C. Keyes of their efforts.<br />\nthird<br />\nand<br />\nsecond<br />\nthe<br />\nurged the fellows to get together as its members. As encores Pow- each of<br />\nAt last Thursday's assembly,<br />\ned by the club. The nominations<br />\nfour weeks.<br />\nand put the thing across, di- ell sang and he and Sener gave an in<br />\nMr.<br />\nSwindell again talked on the<br />\nof<br />\nend<br />\nwest<br />\nwere as follows:<br />\nA toll gate at the<br />\nrectly for the benefit of Spring original parody of Gallagher and<br />\nseason ticket campaign,<br />\nspring<br />\nunrather<br />\nPresident, Croker (elected), Sathe bridge presented a<br />\nsports, and ultimately for the Shean, which suggested the adopalthough<br />\neveryone was full of<br />\nin<br />\nter; Manager, Thomas (elected),<br />\nusual problem to the engineers<br />\nbenefit of the Johns Hopkins Uni- tion of several new courses in the<br />\nat the conclusion of<br />\nenthusiasm<br />\nThe side nearest the Sater; Treasurer, Campbell (electcharge.<br />\ncurriculum of the University.<br />\nversity as a whole.<br />\nbridge interfered with putting the ed), Fargo; Secretary, Betz, Ur- the assembly, no material results<br />\nPresident Macaulay then anThe regular speaker for the ashave been noticed. At this meetnew span in place and it became ner, Sater (elected).<br />\nsembly was absent, and Johnny nounced the drawing of opponing there was an open discussion<br />\nmove the downto<br />\nthe<br />\nnecessary<br />\nthat<br />\nannounced<br />\nVanneman<br />\nSherwood had to play Horatius ents for the inter-fraternity basestream support.<br />\nposition of manager had been con- as to the best manner to go about<br />\nat the bridge to hold the assembly ball season, which will be as folbridge weighed 900 sidered open to competition and these sales, and many excellent<br />\nnew<br />\nThe<br />\nover until Mr. Swindell arrived. lows:<br />\ntons and cost over $125,000. Its that Thomas had been nominated plans of attack were brought out.<br />\nBeta Theta Pi—Phi Kappa Psi.<br />\nHe announced the holding of stubuilding occupied the undivided for the good, work which he had It is believed that these schemes<br />\nDelta Phi—Kappa Alpha.<br />\ndent affairs past, present, and fuattention of the inhabitants of the done toward the success of the should be of advantage to the<br />\nPhi Gamma Delta—Sigma Tau<br />\nture, and, having exhausted the<br />\nsmall town of Foxburg, which lies season's concerts. The Varsity students in their future attempts.<br />\nlist, led the singing of \"On the Delta.<br />\non its west side. This was amus- Seals cannot be awarded until Mr. Swindell believed that the<br />\nKappa Sigma—Pi Kappa Chi.<br />\nLine.\" Mr. Swindell came in<br />\ningly shown by Mr. Lang when he after the last concert, when the best time to approach prosafter the first few lines had been Delta Gamma Theta—Silver Artold of how one Sunday his wife old and new officers will confer pective customers was either in<br />\nsung and Sherwood retired, weak row.<br />\nwished to attend church but found and choose the men to be thus the afternoon after the lunch<br />\nand perspiring to a place on the<br />\nAlpha Delta Phi—Alpha Kappa all closed and everyone watching<br />\nhonored. The giving of the little hour or at night at the homes of<br />\nside lines.<br />\nPhi.<br />\nthe construction of the bridge.<br />\nlyres will depend upon the ,finan- the men of whom the tickets are<br />\nContinued on page 3, col. 4<br />\nOmicron Kappa Omicron drew<br />\nFor his second topic Mr. Lang cial condition of the club at that to be sold.<br />\na bye.<br />\nspoke on the Curtis Bay Coal Pier,<br />\nAt the Inter-fraternity Smoker<br />\nContinued on page 2 col. 5.<br />\nJohn Sherwood ended the for- the largest coaling pier in the<br />\nNEXT COTILLON APRIL 9<br />\non Wednesday night the various<br />\nan adThe next cotillon will be held mal part of the Smoker in<br />\nworld. This has a normal capacity<br />\nSCABBARD AND BLADE SO- fraternities present pledged to<br />\ninterbetter<br />\nurged<br />\nwhich<br />\ndress<br />\nMonday, April 9, at the Maryland<br />\nof 700,000 tons of coal in a month,<br />\nsell 1300 tickets. If these pledges<br />\nCIETY ELECTS NEW<br />\nCasualty Clubhouse. Music will fraternity relations. He deplored working 25 days of 16 hours each.<br />\nare carried out these sales alone<br />\nOFFICERS<br />\nbe furnished by Fiser's Orchestra. the prevalence of cliques, which, It can, however, reach a maximum<br />\nwould amount to $6,500, which<br />\nAt a recent meeting of \"I\"<br />\nW. C. Gardner, president of the he declared, received the spirit of capacity of 7,000 tons per hour, or<br />\nwould easily cover the $6,000<br />\nCo., Second Regiment \"ScabCotillon Board, has announced the university.<br />\ni,000,000 tons per month.<br />\ngoal which the Athletic Associathe milThe Freshman' served \"Doc\"<br />\nThe loaded cars move by gravi- bard and Blade,\" held in<br />\nthat tickets are now on sale. Due<br />\ntion is aiming at.<br />\nitary office at the close of the drill<br />\nto the fact that a number of ex- Adams' best, which just managed<br />\nContinued on page 4. col. 3<br />\nThe campaign closes on Wedhour, officers of the fraternity for<br />\npenses will have to be met this to meet the demands of the crowd.<br />\nnesday, March 28, at 4 P. M. All<br />\nUPTON SINCLAIR \"RAZZES\" the coming year were elected. tickets must be sold by this time.<br />\nweek, students are requested to<br />\n\"Scabbard and Blade\" officers<br />\nas<br />\nsoon<br />\nas<br />\nAMERICAN UNIVERSITY<br />\npurchase their tickets<br />\nPICTURES FOR HULLApossible.<br />\nUpton Sinclair's latest book, perform the same functions as the<br />\nBALOO TODAY<br />\nthe \"Goose Step,\" has created a officers of any society but they LACROSSE SQUAD BUCKLES<br />\nThe dance will start at 9 o'clock<br />\n109 M. E. Hall, 12.20 P. M.<br />\nDOWN TO WORK<br />\nfuror in collegiate circles. Press are given military titles.<br />\nand will run until 1. Favors for<br />\n\"H\" men<br />\nF.<br />\nH.<br />\nare:<br />\nofficers<br />\nretiring<br />\nThe<br />\nLed by 'Captain Murphy, the<br />\nJunior Class<br />\nnotices pertaining to the new book<br />\nthe ladies present will be gold penCaptain; G. V. B. Shriver, lacrosse team has, in the past<br />\nDavis,<br />\nClass<br />\nSenior<br />\nAmeriof<br />\n\"study<br />\na<br />\nas<br />\nit<br />\ndesignate<br />\ncils.<br />\nHomewood Field, 4 P. M.<br />\ncan education.\" It discusses who First Lieut.; G. M. Ruoff, Second week, put in its severest hours of<br />\nLacrosse<br />\nowns the colleges and why. Hop- Lieut.; H. A. IMacubbin, First practicing. Execeptionally good<br />\nAll season ticket returns<br />\nBaseball<br />\nGradof<br />\nkins received its share of ridicule. Sergt. The newly elected officers weather is drying out a very mudmust be in the hands<br />\nTennis<br />\nuate Manager Keyes by 4 P.<br />\nTrack<br />\nSo •far only reviewers' copies of are Captain, J. E. Mount; First dy field and rendering conditions<br />\nM. tomorrow.<br />\nSwimming<br />\n\"Goose Step\" have appeared, but Lieut., W. H. B. Howard; Sec- for practice more and more favor109 M. E. Hall, Wednesday<br />\nDr. Lovejoy, who is referred to by ond Lieut., R. Norwood; First able.<br />\nVarsity Seal Men<br />\ngThe next issue of the<br />\nThe coaching committee is very<br />\nMr. Sinclair in this work, will re- Sergt., F. E. Campbell. The new<br />\nFreshman Class<br />\nNews-Letter will appear Friduties<br />\ntheir<br />\nassume<br />\nmuch pleased with the squad's<br />\nview it for the News Letter as officers will<br />\nSophomore Class<br />\nday April 6th<br />\nContinued on page 2, col. 4<br />\nsoon as the book is placed on sale. at once.<br />\n••••••<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 27, 1923<br />\n<br />\n2<br />\n<br />\nJUNIOR PROM HELD LAST supposed to end at 1 A. M., was CROKER CHOSEN HEAD OF MUSICAL CLUB<br />\nFRIDAY NIGHT<br />\nnot over until 1:30 A. M., due<br />\nContinued from page I<br />\nWith Louis Fisher's orchestra to a unanimous demand for a<br />\nFOUNDED 1897.<br />\nplaying and many feet of the prolongation of the ceremonies. time. It is hoped that the present<br />\nshortage of $145 will be cleared<br />\ndancers keeping time, the Junior<br />\n$2.00<br />\nSubscription<br />\nProm was ushered in last Friday LACROSSE SQUAD BUCKLES DOWN up by the coming concerts.<br />\nCroker was called upon, and<br />\nTO WORK<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at night in the C. E. Hall. Louis<br />\nContinued from page I<br />\nemphasized work and co-operaBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nFisher himself was playing the<br />\n-piano and four of his men assist- work and advises the \"men com- tion as the essentials for the sucPublished semi-weekly from October to June by the students of Johns ed him.<br />\ning out for the team to get more cess of the club next year.<br />\nHopkins University.<br />\nSherwood announced that the<br />\nThe hall was colorfully decor- stickwork practice at odd moments<br />\nBusiness communications should be addressed to the BUSINESS MAN- ated as a result of the untiring ef- This was especially directed to the Dartmouth Glee Club would give<br />\nAGER,JOHNS HOPKINS UNIVERSITY; all articles and other communications forts of Isaac Hamburger. Many new men, who, the coaches de- its concert at the Maryland Casshould be sent to the MANAGING EDITOR.<br />\nof his sketches were of a futur- clare, must fill the gaps left by ualty on April 9th, and desired<br />\nten Hopkins men to act as usher.<br />\nistic<br />\ntype, while others were graduation this June.<br />\nHomewood 100<br />\nTelephone<br />\nquite ante-deluvian, such as 'Eve<br />\nThe men who are out for the These men were recruited from<br />\nand the Serpent', and another de- team and who have shown prom- the club. The concert will cost<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\n$1.50 all over the house, and will<br />\npicting a \"Modern Embrace.\" ise are listed below:<br />\nJOSEPH LEOPOLD, '24.<br />\nPHILIP W. 'HOWARD, '25.<br />\nbe followed by a dance in the ballOther drawings represented 'The<br />\nGoal—Routson, Love.<br />\nManaging Ectitor<br />\nroom.<br />\nIt was suggested that<br />\nDance, 'Vanity,' A Pair of GolfPoint — Bachman, Cromwell,<br />\nWILLIAM G. DEAN, JR., '24.<br />\nHopkins<br />\nmen wear a black and<br />\ners.'<br />\nAdvertising Manager<br />\nLevy.<br />\nAssistant Managing Editor<br />\nblue<br />\nribbon<br />\nin their lapel to offdances<br />\non<br />\nThere<br />\nwere<br />\nfourteen<br />\n1st<br />\nDefense—Cromwell,<br />\nZoller,<br />\nMARSH,<br />\n'24.<br />\nREESE<br />\nT.<br />\nFITZGERALD DUNNING, '24.<br />\nset the customary green of the<br />\nthe<br />\nprogram<br />\nand<br />\nfour<br />\nextras.<br />\nA<br />\nWatson,<br />\nBates.<br />\nAssociate Editor<br />\nshort intermission followed at the<br />\n2nd Defense—Benedict, Moore, Dartmouth delegation.<br />\nRANDOLPH NORWOOD, '24.<br />\nAssistant Business Managers<br />\nThe gathering was brought to a<br />\nend of the eighth dance, at which Zoller; Watson, Hess.<br />\nJunior Editors<br />\nclose<br />\nby the singing of the Unitime<br />\n'25.<br />\nrefreshments<br />\nwere<br />\nserved.<br />\nMILES<br />\nMARRIAN,<br />\nD.<br />\n3rd Defense—S. A. Middleton,<br />\nRICHARD C. TILGHMAN,'25.<br />\nG. DONALD GIESKE, '25.<br />\nJOHN W. PARSONS, '25.<br />\nThe committee presented each J. Slingluff, W. Passano, Vogel. versity Ode.<br />\nBENJAMIN T. ROME, '25.<br />\nJOHN C. -LEWIS, '24.<br />\nof the young ladies at the dance<br />\nCenter—Murphy, Summers<br />\nW. EDWARD THOMSEN, JR., '26.<br />\nJOHN T. DIXON,'24.<br />\nARTHUR L. NELSON, '26.<br />\na favor and a copy of the Prom<br />\n3rd Attack—Griffis, Parsons, several losses. Stick, a promising<br />\nA.<br />\nJ.<br />\nMcKAY,<br />\n'26.<br />\nERNEST A. STRATHMAN, '26.<br />\nNumber of the \"Black and Blue Coady, Ensor.<br />\ncandidate for center; Milburn, a<br />\nEUGENE A. TOVELL, '24.<br />\nHARRY W. MERCER, '26.<br />\nJay.\"<br />\n2d Attack—Huey, Coady, Mor- good goal keeper, and Brown, a<br />\nThe chaperones secured by the rill, Mills.<br />\nvaluable close attack man, were<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\ncommittee included Dr. and Mrs. 1st Attack—D. Turnbull, L. lost by this ogre in his raid on the<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. Goodnow, Dr. and Mrs. Latane, Baldwin, O'Connor.<br />\nFreshman class. The showing of<br />\nDr. and Mrs. Whitehead, Dr. and<br />\nOut Home—Almy, Sanderson. the Freshmen, who are striving<br />\nMrs. Gilpin, and Dr. and Mrs. In Home—McDaniel, Sander- for positions, gives evidence of fuBALTIMORE, MD., MARCH 27, 1923<br />\nture teams on a par with other<br />\nFrench.<br />\nson..<br />\nThe Prom, although it was<br />\nThe blacklist caused the squad Hopkins twelves.<br />\nWERE THEY?<br />\nFor over a week Hopkins' undergraduates have been selling<br />\nspring sport season tickets to alumni and friends of the institution<br />\nthroughout the city. They have been telling these men that Johns<br />\nHopkins was going to sell $6,000 worth of tickets. Many of the<br />\nbuyers shook their heads knowingly and said \"it couldn't be done.\"<br />\nThe Athletic Council, the Varsity Club and undergraduate<br />\nleaders have faith in the ability of the student body to raise the<br />\namount required to carry on spring sports. With but two more<br />\ndays to go the approximate proceeds amount to something over one<br />\nthousand dollars.<br />\nSome of the teams, however, may be holding back for a whirlwind finish. Many tickets can be sold in two days.<br />\nWill they be? Were the skeptics right?<br />\n<br />\nThe Johns<br />\n<br />\nHopkins News-Letter<br />\n<br />\nDANGER!<br />\nThe Cotillon Board is to be complimented for its endeavors<br />\nwhich have resulted in causing the Saturday afternoon tea-dances to<br />\nbecome established Hopkins institutions. Undergraduates and alumni, in increasing numbers, have found the Civil Engineering Hall a<br />\npleasant rendezvous where a few hours may be spent in a strictly<br />\nHopkins atmosphere with Hopkins spirit abounding.<br />\nCoincident with this rise in popularity, however, appears an element—a group of outsiders—which, if it cannot be termed undesirable, is certainly, alien to Hopkins spirit and Hopkins traditions.<br />\nThese individuals, regular patrons of dov9n-town tea-rooms and<br />\ndance floors, have found the nominal fee charged at Homewood attractive and have condescended to place the C. E. Hall on their<br />\nweekly calling list. In increasing numbers they are deserting their<br />\nformer haunts and the C. E. Hall is tending to become a public<br />\nrather than a Hopkins dance floor.<br />\nIf this tendency grows Hopkins men will soon find other places<br />\ntake<br />\ntheir girls on Saturday afternoon. It does not seem necesto<br />\nsary to entirely exclude outsiders. The affairs should be limited,<br />\nhowever, to Hopkins undergraduates, alumni and their friends by<br />\nplacing a restrictive admission charge on all others.<br />\nTALK HOPKINS<br />\n\"Johns Hopkins? Why, I thought that was a hospital?\"<br />\nUndergraduates of half a decade ago frequently heard this and<br />\nsimilar remarks. Hopkins was known for its excellent graduate<br />\nschools, but the nation was not aware of the fact that undergraduate activities existed.<br />\nIn recent years, however, there has been a marked change. No<br />\nmore is Johns Hopkins known only as a hospital. Its athletic teams<br />\nhave brought undergraduate activities before the nation's eyes, its<br />\nGlee Club, its publications and other student activities have helped<br />\nto advertise the University. The same high standards of scholarship have been maintained; activities have made rapid strides in<br />\nthe right direction.<br />\nThere is still, however, plenty of room for advertisement. The<br />\nspring holidays begin this week and a large proportion of the undergraduate body will leave Baltimore for other places, places where<br />\n•Hopkins is not so well known.<br />\nForget your, studies, if you wish, during the holidays. But<br />\ndon't forget Hopkins. Advertise it whenever and wherever you<br />\nobtain opportunity. Tell preparatory schckl boys and their fond<br />\nparents what a good old place it is.<br />\nTalk liopkins!<br />\n<br />\nMovie directors, please copy<br />\n<br />\nPublished in<br />\nthe interest ofElectrical Development by<br />\nan Institution that will<br />\nbe helped by whatever helps the<br />\nIndustry.<br />\n<br />\nIN fiction and the movies all college men naturally fall into two groups. Those who pass<br />\ntheir days and nights \"Rah! Rah!\"-ing and<br />\nsnake-dancing; and those who never appear<br />\nexcept with evening clothes—and cane.<br />\nThe man who works his way through college<br />\nsimply doesn't figure.<br />\nTaking care of a furnace, running a laundry,<br />\nwaiting on table, tutoring, covering for .a city<br />\npaper, working in shop or office in vacation—<br />\nall this may be lacking in romantic appeal, but<br />\nit is an essential part of the college picture.<br />\nAnd a valuable part. The whole college is<br />\nthe gainer for the earnestness of men who want<br />\ntheir education that hard.<br />\nValuable to the college, but even more to the<br />\nmen who travel this rough going. They learn<br />\nan important lesson in Applied Economics—<br />\nthe amount of sweat a ten dollar bill represents.<br />\nIf you are one of them you may sometimes<br />\nfeel that you are missing a good deal of worthwhile college life. If you are not, you may be<br />\nmissing a good deal, too.<br />\n<br />\nestem Electric a<br />\nSince 1869 makers and distributors ofelectrical equipmeitt<br />\n<br />\nNumber 27 of a series<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 27, 1923<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, But Shoulder the Responsibility.<br />\n<br />\nNeatly<br />\nCombed Hair<br />\n<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\n<br />\nInterest.<br />\n<br />\nUndergraduate Declares Professors Remarks Distasteful to<br />\nLoyal American Citizens<br />\n<br />\nREG. U.S. PAT. OFFICE<br />\n<br />\nNeatly combed in the morning—<br />\nbut what about three o'clock in the<br />\nafternoon?<br />\nFor wiry, unruly hair—for soft,<br />\nfluffy hair—for any kind of hair<br />\nthat won't stay combed all day use<br />\nStacomb—then your hair will stay<br />\ncombed just as you want it.<br />\nIdeal after washing your hair.<br />\nLeaves the hair soft and lustrous.<br />\nAsk your barber for a Stacornb<br />\nRub.<br />\nAt all druggists.<br />\n<br />\nf Cusiort Qualify.<br />\nN.Churls Street.<br />\nTOM LANDY,<br />\nManager<br />\n<br />\nBRANCH<br />\nAT THE BARN<br />\n<br />\nThe Flag, Banner & Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br />\n<br />\nORDERS RECEIVED FOR<br />\n<br />\nCOGGINS'<br />\nTransfer and Baggage Express<br />\nAUTOMOBILE SERVICE<br />\n<br />\nPHONE, HOMEWOOD 6886<br />\nTo The Mailbag:<br />\nMakes the Hair Stay Combed<br />\nShould an associate in political<br />\neconomy in the Johns Hopkins<br />\n1 W. University Parkway<br />\nmake remarks in the criticism of<br />\nOpposite J. H U. Athletic Field<br />\nnt<br />\nunpleasa<br />\nare<br />\nthat<br />\nhis country,<br />\nTHE LEFAX DATA SHEETS<br />\nfor J. H. U. BOYS<br />\nSTORE<br />\nDRUG<br />\nin<br />\nstudents<br />\nthose<br />\nto the ears of<br />\nLEFAX<br />\n2121<br />\nPHONE,<br />\nHOMEWOOD<br />\nbeen<br />\nnot<br />\nhave<br />\nhis courses, who<br />\nconvic337<br />\nG. A. Long, P. 0.<br />\nalready converted to his<br />\nHot Dinners, Sandwiches,<br />\ntions? To me such remarks are<br />\nBusiness Magazines and Technical Bulletins<br />\nCandies, Sodas, Cigarettes,<br />\ndecidedly distasteful. That the<br />\nPrinters of Philological and<br />\nScientific Works<br />\nSupreme Court of the United<br />\nTobacco, etc.<br />\nStates is a group of old men, born<br />\nR<br />\nST.<br />\nS.<br />\nHANOVE<br />\n23<br />\nELF<br />\nDRIVE IT YOURS<br />\nRENT A CAR!<br />\nAT THE BARN<br />\nbefore the Civil War; who allow<br />\nBaltimore, Md.<br />\ninfluto<br />\ns<br />\nreaction<br />\npersonal<br />\ntheir<br />\nHups & Dodges, 18c per Mile<br />\nFords, 12c per Mile<br />\nence their decisions, was one of<br />\nOPEN SUNDAYS<br />\nthe remarks made by the aboveIt Is Always The<br />\nmentioned associate in class this<br />\nrethis<br />\nof<br />\nUnvarying Quality of<br />\nDRIVE IT YOURSELF CO.<br />\nmorning. The cause<br />\nmark was a discussion of the conVernon 4049<br />\n1725 North Charles St.<br />\nduct of Eugene V. Debs, the SoCliff e)Catterie<br />\ncialist, who was sentenced to the<br />\nOne Block South of North Ave.<br />\n°AMES FL& OSCAR G.1-01f<br />\nAtlanta Penitentiary for making<br />\nOWN ERS<br />\na speech during the war, disloyal<br />\n41*<br />\n/<br />\n.4 r4/1<br />\nE•C<br />\n7'4413<br />\nThat Holds Users<br />\nto the country, that gives him a<br />\n29 Baltimore St., Etat<br />\nis<br />\ne<br />\neveryon<br />\nthat<br />\nSaying<br />\nhome.<br />\nOne Door West of LiglA St.<br />\nSHERWOOD BROTHERS, INC.<br />\nBOLE AGENTS FOR BALTIMORE<br />\nentitled to free speech and, thereBands<br />\ny<br />\nFor College Fraternit<br />\nfore, that Debs should not have<br />\n(Greek Letter Soetnties)<br />\nfore<br />\nassociat<br />\nbeen arrested, this<br />\ngot that during war, treasonable<br />\n<br />\nR.G.by & Company<br />\n<br />\nThe BARN<br />\nCAFETERIA<br />\n<br />\n3. H. Furst & Co.<br />\n<br />\nSCHOOL OF BIBLICAL<br />\nARCHAEOLOGY<br />\n<br />\nonment.<br />\nremarks are punishable by imprisFurther incensing some of his<br />\nTEN LECTURES IN FIVE DAYS<br />\nstudents by declaring that America should not have entered the<br />\nMonday, April 2nd to Friday, April 61li, 1923<br />\nlast war, this teacher went on to<br />\nshow that the war had accomplished nothing. If America had<br />\nnot entered the war, would more<br />\nhave been accomplished? I doubt<br />\nNORTH CHARLES ST. and GREENWAY<br />\nit. Then why make light of the<br />\nto<br />\nsea<br />\nthe<br />\nacross<br />\nmen who went<br />\nNorth of 34th Street<br />\nseek vengeance on those who had<br />\nBALTIMORE<br />\ncommitted atrocities, hardly believed possible of civilized human<br />\nTEACHER<br />\nbeings? And is there any reason<br />\nDR. M. G. KYLE„A.B., A.M., D.D., LL.D.<br />\nfor saying that the Unknown Soldier buried in Arlington Cemetery with the highest honors,<br />\nLECTURES<br />\nwould have been better off had he<br />\nMonday, April 2nd<br />\nlived? It seems to me that reon<br />\n4 P. M.—\"Primitive Man According to the Bible and the Temptati<br />\nmarks of the above sort are enThat Came to Him.\"<br />\ntirely uncalled for, and not par8 P. M.—\"The Latest and Greatest and Most Startling of All Discoveries,<br />\nAntedeluvian Revelation\" (illustrated).<br />\nloyal<br />\nof<br />\nliking<br />\nticularly to the<br />\ncitAmerican citizens and future<br />\n<br />\nIN UNIVERSITY BAPTIST CHURCH<br />\n<br />\nizens.<br />\nSincerely, P. H. S.<br />\nMarch 23, 1923.<br />\n<br />\nTuesday, April 3rd<br />\n4 P. M.—\"Bricks Without Straw at Pithom.\"<br />\n8 P. M.—\"The Civilization of Palestine in Patriarchal Times.\" (illustrated).<br />\nWednesday, April 4th<br />\n<br />\nSTUDENT COUNCIL NOTICE<br />\n4 P. M.—\"Exodus and the Wilderness Journey.\"<br />\nIn answer to the letter which<br />\n8 P. M.—\"The Doctrine of the Resurrection Which Israel Brought Out<br />\nof Egypt; and What Became of It.\" (illustrated).<br />\nsome<br />\nBag<br />\nMail<br />\nthe<br />\nin<br />\nd<br />\nappeare<br />\ntime ago, asking for undergradu- Thursday, April 5th<br />\nate admission to the Gilman Me4 P. M.—\"The Problem of the Pentateuch; a New Solution by Archaeological Facts and Methods.\"<br />\nmorial Room, the Student CounM.--\"Jerusalem from the Walls\" (illustrated).<br />\nof<br />\nP.<br />\n8<br />\nperiod<br />\na<br />\nfor<br />\ncil announces that,<br />\ntwo weeks, probably directly after<br />\nFriday, April 6th<br />\nthe Easter recess, the Senior<br />\n4 P. M.—\"Where the Archaelogist Finds God in the History of Israel.\"<br />\nShrine wil be thrown open to the<br />\n8 P. M.—\"The Art and Religion of Tutankhamen\" (illustrated).<br />\nmembers of the lower classes.<br />\nDr. Kyle is fresh from Egypt with the results of up-to-date archaeological<br />\nresearch on hand.<br />\n<br />\nFRESHMAN, NOTICE<br />\nDr. Kyle is the author of three great books on Archaeology:<br />\nWil( ) \"Moses and the Monuments\"<br />\nto<br />\npaid<br />\nAll dues should be<br />\n(2) \"The Decision Voice of the Monuments in Biblical Criticism.\"<br />\nber,<br />\ntreasure<br />\nloughby, the class<br />\n(3) \"The Problem of the Pentateuch; a New Solution by Archaeological Facts and Methods.\"<br />\nfore the beginning of the Easter<br />\nrecess. Those failing to pay by<br />\nfor admission, but an offering will be taken at each service to cover<br />\ntonic-row afternoon will probably No charge<br />\nexpenses.<br />\nbe fined $1.00 when they pay upon<br />\nTake the whole course, though any one of the lectures will be valuable.<br />\ntheir return to the University. The<br />\nents will be served in the Sunday School room of the Church at 5.30<br />\ndues are $2.50.<br />\n<br />\nRefreshm<br />\nto 6.30, at which time Dr. Kyle will answer questions.<br />\n<br />\nNow Biggs Gets to Class<br />\nOn Time!<br />\n<br />\nbe written about<br />\n<br />\ntale of adventure might<br />\njvtheexciting<br />\nhunting expeditions Biggs used to make after<br />\n<br />\nthe elusive cap of his old tube of shaving cream. For<br />\nmonths Biggs was late to class because he spent valuable<br />\nminutes scouring the corners of the bathroom for a cap<br />\nthat persisted in getting lost.<br />\nBut those troubles are over. For Biggs has started<br />\nusing Williams' Shaving Cream, which comes in a tube<br />\nwith a hinged cap that can't get lost. You see pictured<br />\nhere this cap which saves his time and patience and<br />\nwhich will do the same for you.<br />\nThe convenience of the Hinged Cap would alone<br />\nbe ample reason for your<br />\nNotice the hinged<br />\ncap. You can't<br />\nusing Williams'. But when<br />\nlose it—and the<br />\ntubehangs VP!<br />\nyou consider that in addition<br />\nWilliams' is good for your<br />\nskin, and is the most remarkable beard softener known,<br />\nthen it does seem that you<br />\nwould be missing a good deal<br />\nin getting along without it.<br />\nBuy a tube and see if it isn't<br />\nvastly better.<br />\n<br />\nms<br />\nia<br />\nll<br />\nWi<br />\nShaving Cream<br />\nSWINDELL CALLS ON TICKET SELL- smoker last Wednesday evening,<br />\nERS TO PEP THINGS UP<br />\nthe various chapters pledged them<br />\nContinued from page 1.<br />\n<br />\nThe Dartmouth Musical Club<br />\nwill hold a concert in the auditorium of the Maryland Casualty<br />\nBuilding on April 11. The Hopkins Musical Club will hold a concert at First M. E. Church on<br />\nApril 12. At the inter-fraternity<br />\n<br />\nselves to sell 1300 tickets.<br />\nIn accordance with the plan<br />\nannounced at the previous assembly by Dean Latane, the assembly was conducted by Sherwood,<br />\nPresident of the Student Council.<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 27, 1923<br />\n<br />\nSPEAKERS FOR RICHMOND<br />\nDEBATE CHOSEN BY<br />\nThe Medical Standard Book Co.<br />\nDR. FRENCH<br />\n(THE BOOK MART)<br />\nAdams Contestants Also Selected.<br />\nVarsity Seal Ruling May Be<br />\nComplete Stock of<br />\nChanged<br />\nMedical Books and College<br />\nRequisites<br />\nLast Wednesday, March 21, Dr.<br />\n1. Donald K. Vanneman,<br />\nImporters and Dealers in Fine Books<br />\nJno. C. French selected the followmanager baseball: \"I think<br />\ning students for the Hopkinswe have a fairly good chance<br />\n301 N. CHARLES ST.<br />\nfor a good team. Our only<br />\nRichmond debate: Messrs.'Charles<br />\nBaltimore, Md.<br />\ndrawback is our weak pitchC. G. Evans, William B. Gross and<br />\ning staff; the rest of the team<br />\nBernard J. Bamberger, as alteris going along in great<br />\nORTMAN<br />\nshape.\"<br />\nnate. Mr. Evans aided in the vic\"Queen Quality\" Home-made<br />\n2. Lieutenant Sherwood,<br />\nover the University of Marytory<br />\nChocolates<br />\nassistant professor of Mililand a few weeks ago, and was a<br />\nLuncheonette<br />\nIce Cream<br />\nIces<br />\ntary Science and Tactics:<br />\n227 N. Howard<br />\n518 N. Charles<br />\n\"They are excellent.\"<br />\npotent factor in the winning of his<br />\nDancing Every Afternoon at<br />\n3.<br />\nJohn<br />\nSherwood,<br />\npresiclass<br />\ndebate in the early part of the<br />\nCharles St.<br />\ndent of the Student Council:<br />\nyear; he will also represent Hop\"We have a good chance<br />\nkins<br />\nin the Triangular Debates<br />\nthis<br />\nyear.<br />\nAs soon as the<br />\nCollege and Fraternity Stationery<br />\nweather<br />\nwarms<br />\nup<br />\nenough<br />\nagainst Washington and Lee. Mr.<br />\nBanquet and Dance Cards, Invitations<br />\nfor practice, I think we'll find<br />\nGross helped the Sophomores win<br />\nJAS. H. DOWNS<br />\nthat we have a crackerjack<br />\nteam.\"<br />\ntheir debate, Mr. Bamberger comENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br />\n4. William Straus, gradpeted in the Adams Debate.<br />\nuate student: \"Well, we're<br />\nThe subject of the debate will<br />\ngoing to have a good track<br />\nTUTORING<br />\nbe the same as for the Triangular<br />\nteam.\"<br />\nMath., Physics, Latin<br />\n\"Resolved, That the<br />\nDebates,<br />\n5. Bernard<br />\nBamberger,<br />\nG. P. ST. CLAIR, '24<br />\nstudent: \"I hope we'll have a<br />\nUnited States should favor the<br />\nRoom 115, C. E. Bldg.<br />\ngood baseball team. I'm not<br />\ncancellation<br />\nof the Inter-Allied<br />\nsufficiently versed in the art<br />\nP. 0. Box 808<br />\ncondition that the<br />\ndebt<br />\nwar<br />\non<br />\nof baseball to do anything<br />\n518 N. CHARLES STREET,BALTIMORE<br />\nindemnity be Materially Rebut enjoy it. But my patriotic<br />\nHopkins spirit, joined to my<br />\nduced.\" Hopkins submitted the Telephone,<br />\nVernon 3442<br />\nOrchestra-Dancing<br />\nprophetic insight, makes me<br />\nSTAGMERS PHARMACY<br />\nquestion and<br />\nRichmond will<br />\nconfident that the baseball<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M.<br />\nchoose the sides.<br />\nseason will be a huge sucPRESCRIPTIONS<br />\nTABLE<br />\nD'HOTE<br />\nLawrence B. Fenneman, former<br />\ncess.\"<br />\nLUNCHEON<br />\n-60c<br />\nD1NNER-$1.00<br />\nPresident of the Debating CounDrugs<br />\nCigars<br />\nCandy<br />\nSUNDAY<br />\nDINNER-$1.25<br />\ncil, announces that at the last<br />\nMUSICAL CLUBS GIVE FINANmeeting<br />\nCouncil<br />\nthe<br />\nof<br />\nit<br />\nwas<br />\nde5308 York Road<br />\nCIAL REPORT<br />\ncided to recommend to. the StuBecause<br />\nthis<br />\nis<br />\na<br />\nmidseason<br />\nredent<br />\nActivities Council that the<br />\nBaltimore, Md.<br />\nport the Musical Clubs, according participation in at least two interto Manager Vanne<br />\n. man, feel cer- collegiate debates shall be necestain the deficit will be made up be- sary before a student shall receive<br />\nAt the Washington Monument<br />\nfore the end of the present year. a Varsity Seal. The President of<br />\nOscar Thomas Olson, D.D.<br />\nWe have purchased 122,000<br />\nTwo more concerts are scheduled. the Council automatically repair U. S. Army Munson last<br />\nMinister<br />\nceives the Seal.<br />\nshoes, sizes 51/2 to 12 which<br />\nThe night of Thursday, April. 12,<br />\nThursday,<br />\nLast<br />\nMarch<br />\n22,<br />\nDr.<br />\nwas the entire surplus stock<br />\nHopkins Students Are Invited to<br />\nhas been definitely decided upon John C. French and Mr. John<br />\nof one of the largest U. S.<br />\nE.<br />\nMake This Their Church Home<br />\nas the date for the concert to be Uhler selected the following stuGovernment shoe contractors.<br />\ngiven at First M. E. Church, St. dents for the Adams Contest in<br />\nThe Sunday afternoon -At Home\"<br />\nThis shoe is guaranteed one<br />\nPaul and 22nd Streets. The one to Oratory; Messrs. William B.<br />\nin the 'Blue and Grey Room\" from<br />\nhundred per cent. solid leathbe given at Frederick on the fol- Gross, George R. Conning, Eder, color dark tan, bellows<br />\nfive to seven, followed by the young<br />\ntongue, dirt and waterproof.<br />\nlowing night, April 13, is still ward P. Sylvester and Elmer L.<br />\npeople's service will appeal to you.<br />\nThe actual value of this shoe<br />\nMylander. An unusual numbei<br />\nYou<br />\nare invited.<br />\npending.<br />\nis $6.00. Owing to this treof contestants were present anC<br />\nSunday morning worship at 11 o'clockmendous buy we can offer<br />\nFINANCIAL REPORT<br />\nthe competition was keen.<br />\nSunday evening service at 8 o'clocksame to the public at $2.95.<br />\nThe Adams Medal is given anMarch 21, 1923<br />\nMusic by vested chorus-choir of soloists<br />\nSend correct size. Pay postman on<br />\nnually<br />\nto the best speaker in z<br />\ndelivery or send money order. If<br />\nRECEIPTS<br />\nALL SEATS FREE<br />\npublic contest participated in by<br />\nshoes are not as represented we Balance from 1921-22<br />\n... $123.25<br />\nwill cheerfully refund your money<br />\nmembers of the second year unReceived from Student<br />\npromptly upon request.<br />\ndergraduate class and members of<br />\nActivities Fees<br />\n235.31 the class in Public Speaking I.<br />\nDonations<br />\n150.00 This medal is given in the memSale of awards<br />\n40-00 ory of former Professor Herbert<br />\nof<br />\nSale<br />\nmusic<br />\n8.00 B. Adams.<br />\nTAILORS<br />\n296 Broadway, New York, N. Y.<br />\nFranklin High concert<br />\nUniforms and Liveries<br />\n44.75 PROMINENT CIVIL ENGINEER ADMcDonogh concert.<br />\n121.00<br />\nDRESSES A. S. C. E.<br />\n128 W. Fayette St., Near Liberty St.<br />\nPrinters of the<br />\nBelair Concert<br />\n118.25<br />\nContinued from page 1<br />\nBaltimore, Md.<br />\nJohns Hopkins News.Letter<br />\nMd. Casualty concert<br />\n584.00 ty from the yards to the pier. The<br />\ncar dumper, which has a maxiWestminster concert<br />\n75.00<br />\nmum of four 200,000-pound cars<br />\nper<br />\nhour, then dumps the coal. It<br />\nTotal<br />\n$1,499.81<br />\nis finally conveyed by a rubber<br />\nand individuality is offered here at prices that are not<br />\nEXPENDITURES<br />\nbelt five feet wide to the storage<br />\nand<br />\ncannot be underquoted by any house at any time.<br />\nAdvertising<br />\n$192.75 bin. Labor is saved in these oper11<br />\nBesides<br />\nthe reputation of an old-established firm<br />\nPrinting<br />\n102.25 ations by a modern trimmer, reis<br />\nback<br />\nof<br />\neach sale with a guarantee.<br />\nMusic<br />\n62.75 cently installed. The single maGeneral concert expense. 213.30 chine has eliminated the labor of<br />\nInstruments purchased<br />\n42.80 nearly 1,800 men. Motion pictures<br />\nFURNI7 URE<br />\nDECORATIONS<br />\nDirector's fees<br />\nDRAPERIES<br />\n75.00 furnished by the Baltimore and<br />\n343<br />\nNORTH<br />\nCHARLES STREET<br />\nHall rental (Md. Cas.)<br />\n200.00 Ohio Railroad made clear all the<br />\nAwards<br />\n110.25 operations at the pier.<br />\nMailing<br />\n1.98<br />\nThe meeting was attended by<br />\nMiscellaneous<br />\n1.50 nearly 60 people, the largest this<br />\nCollege Literature<br />\nyear. Besides the regular mem$1,002.62 bers of the chapter, several memTotal<br />\nLOMBARD and SOUTH STREETS<br />\nBalance<br />\n$479.19 bers of the faculty were present,<br />\nOUTSTANDING BILLS<br />\nas well as representatives from the<br />\nReformer-Young man do you Director's fees<br />\n$575m Baltimore and Ohio Railroad. The<br />\nrealize that you will never get any- Hullabaloo<br />\n40.00 officers are now endeavoring to sewhere by drinking?<br />\n10.00 cure speakers for the April meetMusic<br />\nStewed-Ain't it the truth? I've<br />\nings of the society. In all likelistarted home from this corner five<br />\n$625.00<br />\nTotal<br />\nhood, two meetings will be held<br />\ntimes already.-The Missippian.<br />\n$145.81 during the month.<br />\nDeficit ti\" date<br />\nTHE CAMPUS QUIZ<br />\n(A Hopkins Question Asked<br />\nof Five People)<br />\nWhat do you think of the<br />\nbaseball prospects for this<br />\nseason?<br />\n<br />\nAthletic-looking<br />\nspring clothes you<br />\nare sure to like<br />\n<br />\nREADY-FOR-SERVICE<br />\n$30 UPWARD<br />\n<br />\n211-213 E. BALTIMORE ST.<br />\n<br />\nCHANTILLY<br />\nRestaurant Francais<br />\n<br />\nMount Vernon Place Methodist Episcopal Church<br />\n<br />\nPUBLIC SALES<br />\n<br />\nNational Bay State<br />\nShoe Company<br />\n<br />\nA. JACOBS & SONS<br />\n<br />\nFURNITURE OF QUALITY<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nCorrect Furnishings for<br />\nthe College Man<br />\nHUTZLER OTHEM<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVII. No. 42<br /><br />\nPRICE 5 CENTS<br /><br />\nBALTIMORE, MD., MARCH 27, 1923<br /><br />\nPROMINENT CIVIL ENGINEER CROKER CHOSEN HEAD OF PRISSMAN'S TEAM LEADING<br />\nFRATERNITY FRESHMEN<br />\nSWINDELL CALLS ON TICKET<br />\nIN TICKET SALES. TURN<br />\nMUSICAL CLUB AT ANPEP<br />\nTHINGS<br />\nTO<br />\nADDRESSES A. S. C. E.<br />\nSELLERS<br />\nSHOW ABILITY AS ENIN $200<br />\nUP<br />\nELECTION<br />\nNUAL<br />\nTERTAINERS<br />\nRefers to Virginia Bridge as<br />\nThursday Assembly Turned Over Annual Greek Smoker Held.<br />\nSupper at Barn Precedes Selection Sales Rather Slow. ApproximateUnique Achievement. Large<br />\nto Discussion of Spring Sealy $1000 Worth Sold. Swarthof New Men<br />\nAudience Hears Talk<br />\nKeyes Urges Men for Inson Ticket Campaign<br />\nre Team Second<br />\nin<br />\nEffort<br />\nSale<br />\ncreased<br />\nAt<br />\nthe<br />\nwas<br />\nelected<br />\nmost important monthly<br />\nJohn H. Croker<br />\n\"Pop\" Swindell was present at<br />\nSince<br />\nthe<br />\nannouncement of the<br />\ninstrumental<br />\nsongs,<br />\nSpeeches,<br />\nmeeting of the year, held last president of the Musical Clubs on<br />\nthe assembly on Thursday to inthe<br />\nof<br />\nspring season tickopening<br />\nject a little pep in the Spring sea- selections, and refreshments were Tuesday, March 20, by the Hop- last Thursday evening at the<br />\nMr. Swindell at<br />\nby<br />\net<br />\ncampaign,<br />\nson ticket selling campaign, which the high lights of the Freshman kins student chapter of the Amer- Barn, when the entire oranization<br />\nthe assembly on Mif.A-ch 15, cmiiin consideration of the short time Smoker, which was given to the ican Society of Civil Engineers, joined in a supper, which was fola little over a $1,000 has been soremaining before the early games fraternity men by this year's Mr. P. J. Lang, Jr., Engineer of lowed by farewell speeches of this<br />\nlicited by the students at Johns<br />\non the schedule, has been lagging pledgees. The Barn was crowded Bridges on the Baltimore and<br />\nyear's officers and by the election Hopkins. Last Friday when the<br />\nbadly. With \"Pop\" leading the<br />\nOhio Railroad, addressed a large<br />\nto capacity with the representathe management .for 1923-24. \"News Letter\" went to press,<br />\nof<br />\ndiscussion, the objections of prosaudience on topics of vital interJohn<br />\nSherwood, the retiring University of Washington, with<br />\npective customers to buying the tives of Hopkins' thirteen frater- est to egineering men. Mr. Lang<br />\npresident,<br />\ncongratulated the men Prissman as its captain, was settickets, and suitable answers for nities when a quartet composed of is a graduate of the University of<br />\non the discipline of the club ting the pace. This team's sales<br />\nthese objections, were talked over. Abbott, Sherwood, Croker and Pennsylvania, and has been acthroughout the past season, and have amounted to $200. Next in<br />\nMr. Swindell was greatly disap- Rich appeared as the first number tively engaged in civil engineering<br />\nwent on to urge a system of line was Swarthmore, captained<br />\npointed because the students on the program. The singers work for several years. During<br />\n\"doubling<br />\nup\" by men who re by \"Joe\" Leopold, which team<br />\nthe first part of his lecture he<br />\nhave not been putting sufficient<br />\nwere followed by Dr. Van Orman,<br />\nsing and to play in has sold tickets to the amount of<br />\nboth<br />\nto<br />\nable<br />\nspoke on the \"Reconstruction of<br />\nenergy into this _ticket selling<br />\nwho spoke on the importance of the River Span Crossing the Alle- some one of the other clubs. The $194. Both of these teams are<br />\nbusiness.<br />\neffect of such a system would be made up of non-fraternity men.<br />\nThe plans mentioried at the pre- the men keeping up in their stud- gany River at Foxburg, Pa.\" The<br />\nto produce an organization at However, Dartmouth, with Colvious assembly were gone over ies. Fargo, Hambleton, Town- speaker illustrated his talk with<br />\nonce<br />\nsmaller and more mobile. lins captain, promises to give<br />\nagain, and additional hints were send and Milburn then gave some many interesting slides.<br />\nplenty of<br />\nalso expressed his sym- these two teams<br />\nSherwood<br />\nMr. Lang referred to the bridge<br />\ngiven. Mr. Swindell- asked the selections a la Hawaiian. Mr.<br />\nClose<br />\nbehind<br />\ntrouble.<br />\nDartmouth<br />\npathy with the plans of Dr. Goodfellows to tell whatever had hap- Keyes was next on the program; as a unique achievement in conand Mr. Turnbull, who de- comes University of North Danow<br />\ndifpened to them -while selling tick- he tried to impress on his audience struction work, in that several<br />\nsire for the Glee Club more se- kota, captained by Wasserman,<br />\nets that would be helpful to others. the necessity of making the spring ficult problems had to be solved<br />\nrious music, music that will stay who has realized sales to the<br />\nSeveral responded, and Hopkins, season ticket campaign a success. before and during its construction.<br />\nwith the men after they leave the amount of $115.<br />\na Freshman, told at considerable At the conclusion of his talk he He first explained the method of<br />\nTheir ultimate object, Next in line is Coady's team<br />\nuniversity.<br />\nlength of the treatment which he asked for guarantees from the va- placing the new span in position<br />\na department of mu- with $79, while closely pursuing<br />\nis<br />\ncourse,<br />\nof<br />\nand Buck Baldwin had received rious fraternities as to their sales. and removing the old one. The<br />\nthem is Cornell, Zollers captain,<br />\nat<br />\nHopkins.<br />\nJohns<br />\nsic<br />\nfrom the men they had visited. The average number pledged was supports of the old span were rewith $65. E. Kirwan, Harvard's<br />\nalso<br />\ncongratuDon<br />\nVanneman<br />\nThe stories of Hopkins and the about 100, which means a total moved, and the truss nearest the<br />\nhas reported $44, and<br />\ncaptain,<br />\nlated the men on their success<br />\nother fellows showed clearly that amount of 1,300 tickets to be sold. bridge locked to the new. It was<br />\nNew<br />\nYork<br />\nUniversity is credited<br />\nduring the year and sounded the<br />\nit is quite possible to dispose of The \"Ballad of Yukon Jake\" by then guyed and when the new<br />\nwith<br />\n$20.<br />\nwatchword for its activity under<br />\nService, was then recited by Nel- span could finally be put into pothe tickets.<br />\nMany of the teams have made<br />\nnew management—\"never to<br />\nthe<br />\nto<br />\nhitched<br />\nwas<br />\nfar<br />\ntruss<br />\nthe<br />\nsition<br />\nLack of work on the part fo the son Young, who was one of the<br />\nno<br />\nreports at all. Although many<br />\ngo backward, always forward.\"<br />\nundergraduates is the chief cause stars of the evening. The enter- the new. The whole operation ocof them have made a number of<br />\nelection.<br />\nthe<br />\non<br />\nwith<br />\nwent<br />\nHe<br />\nthen<br />\nis<br />\nwhich<br />\nhours,<br />\neight<br />\nabout<br />\ncupied<br />\nfor the poor returns from the tainment was concluded by a Jazz<br />\ntime was A list of nominees, proposed by sales, their captains have failed to<br />\nticket selling clmpaign. \"Pop\" Band with Sater, Grace, Barry, not fast work. Good<br />\nrunning the retiring officers, was read and inform Graduate Manager Norin<br />\nhowever,<br />\nSwindell and Johnny Sherwood Vanneman, Kelbaugh and Urner registered,<br />\nspans with but few exceptions, accept- man C. Keyes of their efforts.<br />\nthird<br />\nand<br />\nsecond<br />\nthe<br />\nurged the fellows to get together as its members. As encores Pow- each of<br />\nAt last Thursday's assembly,<br />\ned by the club. The nominations<br />\nfour weeks.<br />\nand put the thing across, di- ell sang and he and Sener gave an in<br />\nMr.<br />\nSwindell again talked on the<br />\nof<br />\nend<br />\nwest<br />\nwere as follows:<br />\nA toll gate at the<br />\nrectly for the benefit of Spring original parody of Gallagher and<br />\nseason ticket campaign,<br />\nspring<br />\nunrather<br />\nPresident, Croker (elected), Sathe bridge presented a<br />\nsports, and ultimately for the Shean, which suggested the adopalthough<br />\neveryone was full of<br />\nin<br />\nter; Manager, Thomas (elected),<br />\nusual problem to the engineers<br />\nbenefit of the Johns Hopkins Uni- tion of several new courses in the<br />\nat the conclusion of<br />\nenthusiasm<br />\nThe side nearest the Sater; Treasurer, Campbell (electcharge.<br />\ncurriculum of the University.<br />\nversity as a whole.<br />\nbridge interfered with putting the ed), Fargo; Secretary, Betz, Ur- the assembly, no material results<br />\nPresident Macaulay then anThe regular speaker for the ashave been noticed. At this meetnew span in place and it became ner, Sater (elected).<br />\nsembly was absent, and Johnny nounced the drawing of opponing there was an open discussion<br />\nmove the downto<br />\nthe<br />\nnecessary<br />\nthat<br />\nannounced<br />\nVanneman<br />\nSherwood had to play Horatius ents for the inter-fraternity basestream support.<br />\nposition of manager had been con- as to the best manner to go about<br />\nat the bridge to hold the assembly ball season, which will be as folbridge weighed 900 sidered open to competition and these sales, and many excellent<br />\nnew<br />\nThe<br />\nover until Mr. Swindell arrived. lows:<br />\ntons and cost over $125,000. Its that Thomas had been nominated plans of attack were brought out.<br />\nBeta Theta Pi—Phi Kappa Psi.<br />\nHe announced the holding of stubuilding occupied the undivided for the good, work which he had It is believed that these schemes<br />\nDelta Phi—Kappa Alpha.<br />\ndent affairs past, present, and fuattention of the inhabitants of the done toward the success of the should be of advantage to the<br />\nPhi Gamma Delta—Sigma Tau<br />\nture, and, having exhausted the<br />\nsmall town of Foxburg, which lies season's concerts. The Varsity students in their future attempts.<br />\nlist, led the singing of \"On the Delta.<br />\non its west side. This was amus- Seals cannot be awarded until Mr. Swindell believed that the<br />\nKappa Sigma—Pi Kappa Chi.<br />\nLine.\" Mr. Swindell came in<br />\ningly shown by Mr. Lang when he after the last concert, when the best time to approach prosafter the first few lines had been Delta Gamma Theta—Silver Artold of how one Sunday his wife old and new officers will confer pective customers was either in<br />\nsung and Sherwood retired, weak row.<br />\nwished to attend church but found and choose the men to be thus the afternoon after the lunch<br />\nand perspiring to a place on the<br />\nAlpha Delta Phi—Alpha Kappa all closed and everyone watching<br />\nhonored. The giving of the little hour or at night at the homes of<br />\nside lines.<br />\nPhi.<br />\nthe construction of the bridge.<br />\nlyres will depend upon the ,finan- the men of whom the tickets are<br />\nContinued on page 3, col. 4<br />\nOmicron Kappa Omicron drew<br />\nFor his second topic Mr. Lang cial condition of the club at that to be sold.<br />\na bye.<br />\nspoke on the Curtis Bay Coal Pier,<br />\nAt the Inter-fraternity Smoker<br />\nContinued on page 2 col. 5.<br />\nJohn Sherwood ended the for- the largest coaling pier in the<br />\nNEXT COTILLON APRIL 9<br />\non Wednesday night the various<br />\nan adThe next cotillon will be held mal part of the Smoker in<br />\nworld. This has a normal capacity<br />\nSCABBARD AND BLADE SO- fraternities present pledged to<br />\ninterbetter<br />\nurged<br />\nwhich<br />\ndress<br />\nMonday, April 9, at the Maryland<br />\nof 700,000 tons of coal in a month,<br />\nsell 1300 tickets. If these pledges<br />\nCIETY ELECTS NEW<br />\nCasualty Clubhouse. Music will fraternity relations. He deplored working 25 days of 16 hours each.<br />\nare carried out these sales alone<br />\nOFFICERS<br />\nbe furnished by Fiser's Orchestra. the prevalence of cliques, which, It can, however, reach a maximum<br />\nwould amount to $6,500, which<br />\nAt a recent meeting of \"I\"<br />\nW. C. Gardner, president of the he declared, received the spirit of capacity of 7,000 tons per hour, or<br />\nwould easily cover the $6,000<br />\nCo., Second Regiment \"ScabCotillon Board, has announced the university.<br />\ni,000,000 tons per month.<br />\ngoal which the Athletic Associathe milThe Freshman' served \"Doc\"<br />\nThe loaded cars move by gravi- bard and Blade,\" held in<br />\nthat tickets are now on sale. Due<br />\ntion is aiming at.<br />\nitary office at the close of the drill<br />\nto the fact that a number of ex- Adams' best, which just managed<br />\nContinued on page 4. col. 3<br />\nThe campaign closes on Wedhour, officers of the fraternity for<br />\npenses will have to be met this to meet the demands of the crowd.<br />\nnesday, March 28, at 4 P. M. All<br />\nUPTON SINCLAIR \"RAZZES\" the coming year were elected. tickets must be sold by this time.<br />\nweek, students are requested to<br />\n\"Scabbard and Blade\" officers<br />\nas<br />\nsoon<br />\nas<br />\nAMERICAN UNIVERSITY<br />\npurchase their tickets<br />\nPICTURES FOR HULLApossible.<br />\nUpton Sinclair's latest book, perform the same functions as the<br />\nBALOO TODAY<br />\nthe \"Goose Step,\" has created a officers of any society but they LACROSSE SQUAD BUCKLES<br />\nThe dance will start at 9 o'clock<br />\n109 M. E. Hall, 12.20 P. M.<br />\nDOWN TO WORK<br />\nfuror in collegiate circles. Press are given military titles.<br />\nand will run until 1. Favors for<br />\n\"H\" men<br />\nF.<br />\nH.<br />\nare:<br />\nofficers<br />\nretiring<br />\nThe<br />\nLed by 'Captain Murphy, the<br />\nJunior Class<br />\nnotices pertaining to the new book<br />\nthe ladies present will be gold penCaptain; G. V. B. Shriver, lacrosse team has, in the past<br />\nDavis,<br />\nClass<br />\nSenior<br />\nAmeriof<br />\n\"study<br />\na<br />\nas<br />\nit<br />\ndesignate<br />\ncils.<br />\nHomewood Field, 4 P. M.<br />\ncan education.\" It discusses who First Lieut.; G. M. Ruoff, Second week, put in its severest hours of<br />\nLacrosse<br />\nowns the colleges and why. Hop- Lieut.; H. A. IMacubbin, First practicing. Execeptionally good<br />\nAll season ticket returns<br />\nBaseball<br />\nGradof<br />\nkins received its share of ridicule. Sergt. The newly elected officers weather is drying out a very mudmust be in the hands<br />\nTennis<br />\nuate Manager Keyes by 4 P.<br />\nTrack<br />\nSo •far only reviewers' copies of are Captain, J. E. Mount; First dy field and rendering conditions<br />\nM. tomorrow.<br />\nSwimming<br />\n\"Goose Step\" have appeared, but Lieut., W. H. B. Howard; Sec- for practice more and more favor109 M. E. Hall, Wednesday<br />\nDr. Lovejoy, who is referred to by ond Lieut., R. Norwood; First able.<br />\nVarsity Seal Men<br />\ngThe next issue of the<br />\nThe coaching committee is very<br />\nMr. Sinclair in this work, will re- Sergt., F. E. Campbell. The new<br />\nFreshman Class<br />\nNews-Letter will appear Friduties<br />\ntheir<br />\nassume<br />\nmuch pleased with the squad's<br />\nview it for the News Letter as officers will<br />\nSophomore Class<br />\nday April 6th<br />\nContinued on page 2, col. 4<br />\nsoon as the book is placed on sale. at once.<br />\n••••••<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 27, 1923<br /><br />\n2<br /><br />\nJUNIOR PROM HELD LAST supposed to end at 1 A. M., was CROKER CHOSEN HEAD OF MUSICAL CLUB<br />\nFRIDAY NIGHT<br />\nnot over until 1:30 A. M., due<br />\nContinued from page I<br />\nWith Louis Fisher's orchestra to a unanimous demand for a<br />\nFOUNDED 1897.<br />\nplaying and many feet of the prolongation of the ceremonies. time. It is hoped that the present<br />\nshortage of $145 will be cleared<br />\ndancers keeping time, the Junior<br />\n$2.00<br />\nSubscription<br />\nProm was ushered in last Friday LACROSSE SQUAD BUCKLES DOWN up by the coming concerts.<br />\nCroker was called upon, and<br />\nTO WORK<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at night in the C. E. Hall. Louis<br />\nContinued from page I<br />\nemphasized work and co-operaBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nFisher himself was playing the<br />\n-piano and four of his men assist- work and advises the \"men com- tion as the essentials for the sucPublished semi-weekly from October to June by the students of Johns ed him.<br />\ning out for the team to get more cess of the club next year.<br />\nHopkins University.<br />\nSherwood announced that the<br />\nThe hall was colorfully decor- stickwork practice at odd moments<br />\nBusiness communications should be addressed to the BUSINESS MAN- ated as a result of the untiring ef- This was especially directed to the Dartmouth Glee Club would give<br />\nAGER,JOHNS HOPKINS UNIVERSITY; all articles and other communications forts of Isaac Hamburger. Many new men, who, the coaches de- its concert at the Maryland Casshould be sent to the MANAGING EDITOR.<br />\nof his sketches were of a futur- clare, must fill the gaps left by ualty on April 9th, and desired<br />\nten Hopkins men to act as usher.<br />\nistic<br />\ntype, while others were graduation this June.<br />\nHomewood 100<br />\nTelephone<br />\nquite ante-deluvian, such as 'Eve<br />\nThe men who are out for the These men were recruited from<br />\nand the Serpent', and another de- team and who have shown prom- the club. The concert will cost<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\n$1.50 all over the house, and will<br />\npicting a \"Modern Embrace.\" ise are listed below:<br />\nJOSEPH LEOPOLD, '24.<br />\nPHILIP W. 'HOWARD, '25.<br />\nbe followed by a dance in the ballOther drawings represented 'The<br />\nGoal—Routson, Love.<br />\nManaging Ectitor<br />\nroom.<br />\nIt was suggested that<br />\nDance, 'Vanity,' A Pair of GolfPoint — Bachman, Cromwell,<br />\nWILLIAM G. DEAN, JR., '24.<br />\nHopkins<br />\nmen wear a black and<br />\ners.'<br />\nAdvertising Manager<br />\nLevy.<br />\nAssistant Managing Editor<br />\nblue<br />\nribbon<br />\nin their lapel to offdances<br />\non<br />\nThere<br />\nwere<br />\nfourteen<br />\n1st<br />\nDefense—Cromwell,<br />\nZoller,<br />\nMARSH,<br />\n'24.<br />\nREESE<br />\nT.<br />\nFITZGERALD DUNNING, '24.<br />\nset the customary green of the<br />\nthe<br />\nprogram<br />\nand<br />\nfour<br />\nextras.<br />\nA<br />\nWatson,<br />\nBates.<br />\nAssociate Editor<br />\nshort intermission followed at the<br />\n2nd Defense—Benedict, Moore, Dartmouth delegation.<br />\nRANDOLPH NORWOOD, '24.<br />\nAssistant Business Managers<br />\nThe gathering was brought to a<br />\nend of the eighth dance, at which Zoller; Watson, Hess.<br />\nJunior Editors<br />\nclose<br />\nby the singing of the Unitime<br />\n'25.<br />\nrefreshments<br />\nwere<br />\nserved.<br />\nMILES<br />\nMARRIAN,<br />\nD.<br />\n3rd Defense—S. A. Middleton,<br />\nRICHARD C. TILGHMAN,'25.<br />\nG. DONALD GIESKE, '25.<br />\nJOHN W. PARSONS, '25.<br />\nThe committee presented each J. Slingluff, W. Passano, Vogel. versity Ode.<br />\nBENJAMIN T. ROME, '25.<br />\nJOHN C. -LEWIS, '24.<br />\nof the young ladies at the dance<br />\nCenter—Murphy, Summers<br />\nW. EDWARD THOMSEN, JR., '26.<br />\nJOHN T. DIXON,'24.<br />\nARTHUR L. NELSON, '26.<br />\na favor and a copy of the Prom<br />\n3rd Attack—Griffis, Parsons, several losses. Stick, a promising<br />\nA.<br />\nJ.<br />\nMcKAY,<br />\n'26.<br />\nERNEST A. STRATHMAN, '26.<br />\nNumber of the \"Black and Blue Coady, Ensor.<br />\ncandidate for center; Milburn, a<br />\nEUGENE A. TOVELL, '24.<br />\nHARRY W. MERCER, '26.<br />\nJay.\"<br />\n2d Attack—Huey, Coady, Mor- good goal keeper, and Brown, a<br />\nThe chaperones secured by the rill, Mills.<br />\nvaluable close attack man, were<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\ncommittee included Dr. and Mrs. 1st Attack—D. Turnbull, L. lost by this ogre in his raid on the<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. Goodnow, Dr. and Mrs. Latane, Baldwin, O'Connor.<br />\nFreshman class. The showing of<br />\nDr. and Mrs. Whitehead, Dr. and<br />\nOut Home—Almy, Sanderson. the Freshmen, who are striving<br />\nMrs. Gilpin, and Dr. and Mrs. In Home—McDaniel, Sander- for positions, gives evidence of fuBALTIMORE, MD., MARCH 27, 1923<br />\nture teams on a par with other<br />\nFrench.<br />\nson..<br />\nThe Prom, although it was<br />\nThe blacklist caused the squad Hopkins twelves.<br />\nWERE THEY?<br />\nFor over a week Hopkins' undergraduates have been selling<br />\nspring sport season tickets to alumni and friends of the institution<br />\nthroughout the city. They have been telling these men that Johns<br />\nHopkins was going to sell $6,000 worth of tickets. Many of the<br />\nbuyers shook their heads knowingly and said \"it couldn't be done.\"<br />\nThe Athletic Council, the Varsity Club and undergraduate<br />\nleaders have faith in the ability of the student body to raise the<br />\namount required to carry on spring sports. With but two more<br />\ndays to go the approximate proceeds amount to something over one<br />\nthousand dollars.<br />\nSome of the teams, however, may be holding back for a whirlwind finish. Many tickets can be sold in two days.<br />\nWill they be? Were the skeptics right?<br /><br />\nThe Johns<br /><br />\nHopkins News-Letter<br /><br />\nDANGER!<br />\nThe Cotillon Board is to be complimented for its endeavors<br />\nwhich have resulted in causing the Saturday afternoon tea-dances to<br />\nbecome established Hopkins institutions. Undergraduates and alumni, in increasing numbers, have found the Civil Engineering Hall a<br />\npleasant rendezvous where a few hours may be spent in a strictly<br />\nHopkins atmosphere with Hopkins spirit abounding.<br />\nCoincident with this rise in popularity, however, appears an element—a group of outsiders—which, if it cannot be termed undesirable, is certainly, alien to Hopkins spirit and Hopkins traditions.<br />\nThese individuals, regular patrons of dov9n-town tea-rooms and<br />\ndance floors, have found the nominal fee charged at Homewood attractive and have condescended to place the C. E. Hall on their<br />\nweekly calling list. In increasing numbers they are deserting their<br />\nformer haunts and the C. E. Hall is tending to become a public<br />\nrather than a Hopkins dance floor.<br />\nIf this tendency grows Hopkins men will soon find other places<br />\ntake<br />\ntheir girls on Saturday afternoon. It does not seem necesto<br />\nsary to entirely exclude outsiders. The affairs should be limited,<br />\nhowever, to Hopkins undergraduates, alumni and their friends by<br />\nplacing a restrictive admission charge on all others.<br />\nTALK HOPKINS<br />\n\"Johns Hopkins? Why, I thought that was a hospital?\"<br />\nUndergraduates of half a decade ago frequently heard this and<br />\nsimilar remarks. Hopkins was known for its excellent graduate<br />\nschools, but the nation was not aware of the fact that undergraduate activities existed.<br />\nIn recent years, however, there has been a marked change. No<br />\nmore is Johns Hopkins known only as a hospital. Its athletic teams<br />\nhave brought undergraduate activities before the nation's eyes, its<br />\nGlee Club, its publications and other student activities have helped<br />\nto advertise the University. The same high standards of scholarship have been maintained; activities have made rapid strides in<br />\nthe right direction.<br />\nThere is still, however, plenty of room for advertisement. The<br />\nspring holidays begin this week and a large proportion of the undergraduate body will leave Baltimore for other places, places where<br />\n•Hopkins is not so well known.<br />\nForget your, studies, if you wish, during the holidays. But<br />\ndon't forget Hopkins. Advertise it whenever and wherever you<br />\nobtain opportunity. Tell preparatory schckl boys and their fond<br />\nparents what a good old place it is.<br />\nTalk liopkins!<br /><br />\nMovie directors, please copy<br /><br />\nPublished in<br />\nthe interest ofElectrical Development by<br />\nan Institution that will<br />\nbe helped by whatever helps the<br />\nIndustry.<br /><br />\nIN fiction and the movies all college men naturally fall into two groups. Those who pass<br />\ntheir days and nights \"Rah! Rah!\"-ing and<br />\nsnake-dancing; and those who never appear<br />\nexcept with evening clothes—and cane.<br />\nThe man who works his way through college<br />\nsimply doesn't figure.<br />\nTaking care of a furnace, running a laundry,<br />\nwaiting on table, tutoring, covering for .a city<br />\npaper, working in shop or office in vacation—<br />\nall this may be lacking in romantic appeal, but<br />\nit is an essential part of the college picture.<br />\nAnd a valuable part. The whole college is<br />\nthe gainer for the earnestness of men who want<br />\ntheir education that hard.<br />\nValuable to the college, but even more to the<br />\nmen who travel this rough going. They learn<br />\nan important lesson in Applied Economics—<br />\nthe amount of sweat a ten dollar bill represents.<br />\nIf you are one of them you may sometimes<br />\nfeel that you are missing a good deal of worthwhile college life. If you are not, you may be<br />\nmissing a good deal, too.<br /><br />\nestem Electric a<br />\nSince 1869 makers and distributors ofelectrical equipmeitt<br /><br />\nNumber 27 of a series<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 27, 1923<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, But Shoulder the Responsibility.<br /><br />\nNeatly<br />\nCombed Hair<br /><br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br /><br />\nInterest.<br /><br />\nUndergraduate Declares Professors Remarks Distasteful to<br />\nLoyal American Citizens<br /><br />\nREG. U.S. PAT. OFFICE<br /><br />\nNeatly combed in the morning—<br />\nbut what about three o'clock in the<br />\nafternoon?<br />\nFor wiry, unruly hair—for soft,<br />\nfluffy hair—for any kind of hair<br />\nthat won't stay combed all day use<br />\nStacomb—then your hair will stay<br />\ncombed just as you want it.<br />\nIdeal after washing your hair.<br />\nLeaves the hair soft and lustrous.<br />\nAsk your barber for a Stacornb<br />\nRub.<br />\nAt all druggists.<br /><br />\nf Cusiort Qualify.<br />\nN.Churls Street.<br />\nTOM LANDY,<br />\nManager<br /><br />\nBRANCH<br />\nAT THE BARN<br /><br />\nThe Flag, Banner &amp; Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br /><br />\nORDERS RECEIVED FOR<br /><br />\nCOGGINS'<br />\nTransfer and Baggage Express<br />\nAUTOMOBILE SERVICE<br /><br />\nPHONE, HOMEWOOD 6886<br />\nTo The Mailbag:<br />\nMakes the Hair Stay Combed<br />\nShould an associate in political<br />\neconomy in the Johns Hopkins<br />\n1 W. University Parkway<br />\nmake remarks in the criticism of<br />\nOpposite J. H U. Athletic Field<br />\nnt<br />\nunpleasa<br />\nare<br />\nthat<br />\nhis country,<br />\nTHE LEFAX DATA SHEETS<br />\nfor J. H. U. BOYS<br />\nSTORE<br />\nDRUG<br />\nin<br />\nstudents<br />\nthose<br />\nto the ears of<br />\nLEFAX<br />\n2121<br />\nPHONE,<br />\nHOMEWOOD<br />\nbeen<br />\nnot<br />\nhave<br />\nhis courses, who<br />\nconvic337<br />\nG. A. Long, P. 0.<br />\nalready converted to his<br />\nHot Dinners, Sandwiches,<br />\ntions? To me such remarks are<br />\nBusiness Magazines and Technical Bulletins<br />\nCandies, Sodas, Cigarettes,<br />\ndecidedly distasteful. That the<br />\nPrinters of Philological and<br />\nScientific Works<br />\nSupreme Court of the United<br />\nTobacco, etc.<br />\nStates is a group of old men, born<br />\nR<br />\nST.<br />\nS.<br />\nHANOVE<br />\n23<br />\nELF<br />\nDRIVE IT YOURS<br />\nRENT A CAR!<br />\nAT THE BARN<br />\nbefore the Civil War; who allow<br />\nBaltimore, Md.<br />\ninfluto<br />\ns<br />\nreaction<br />\npersonal<br />\ntheir<br />\nHups &amp; Dodges, 18c per Mile<br />\nFords, 12c per Mile<br />\nence their decisions, was one of<br />\nOPEN SUNDAYS<br />\nthe remarks made by the aboveIt Is Always The<br />\nmentioned associate in class this<br />\nrethis<br />\nof<br />\nUnvarying Quality of<br />\nDRIVE IT YOURSELF CO.<br />\nmorning. The cause<br />\nmark was a discussion of the conVernon 4049<br />\n1725 North Charles St.<br />\nduct of Eugene V. Debs, the SoCliff e)Catterie<br />\ncialist, who was sentenced to the<br />\nOne Block South of North Ave.<br />\n°AMES FL&amp; OSCAR G.1-01f<br />\nAtlanta Penitentiary for making<br />\nOWN ERS<br />\na speech during the war, disloyal<br />\n41*<br />\n/<br />\n.4 r4/1<br />\nE•C<br />\n7'4413<br />\nThat Holds Users<br />\nto the country, that gives him a<br />\n29 Baltimore St., Etat<br />\nis<br />\ne<br />\neveryon<br />\nthat<br />\nSaying<br />\nhome.<br />\nOne Door West of LiglA St.<br />\nSHERWOOD BROTHERS, INC.<br />\nBOLE AGENTS FOR BALTIMORE<br />\nentitled to free speech and, thereBands<br />\ny<br />\nFor College Fraternit<br />\nfore, that Debs should not have<br />\n(Greek Letter Soetnties)<br />\nfore<br />\nassociat<br />\nbeen arrested, this<br />\ngot that during war, treasonable<br /><br />\nR.G.by &amp; Company<br /><br />\nThe BARN<br />\nCAFETERIA<br /><br />\n3. H. Furst &amp; Co.<br /><br />\nSCHOOL OF BIBLICAL<br />\nARCHAEOLOGY<br /><br />\nonment.<br />\nremarks are punishable by imprisFurther incensing some of his<br />\nTEN LECTURES IN FIVE DAYS<br />\nstudents by declaring that America should not have entered the<br />\nMonday, April 2nd to Friday, April 61li, 1923<br />\nlast war, this teacher went on to<br />\nshow that the war had accomplished nothing. If America had<br />\nnot entered the war, would more<br />\nhave been accomplished? I doubt<br />\nNORTH CHARLES ST. and GREENWAY<br />\nit. Then why make light of the<br />\nto<br />\nsea<br />\nthe<br />\nacross<br />\nmen who went<br />\nNorth of 34th Street<br />\nseek vengeance on those who had<br />\nBALTIMORE<br />\ncommitted atrocities, hardly believed possible of civilized human<br />\nTEACHER<br />\nbeings? And is there any reason<br />\nDR. M. G. KYLE„A.B., A.M., D.D., LL.D.<br />\nfor saying that the Unknown Soldier buried in Arlington Cemetery with the highest honors,<br />\nLECTURES<br />\nwould have been better off had he<br />\nMonday, April 2nd<br />\nlived? It seems to me that reon<br />\n4 P. M.—\"Primitive Man According to the Bible and the Temptati<br />\nmarks of the above sort are enThat Came to Him.\"<br />\ntirely uncalled for, and not par8 P. M.—\"The Latest and Greatest and Most Startling of All Discoveries,<br />\nAntedeluvian Revelation\" (illustrated).<br />\nloyal<br />\nof<br />\nliking<br />\nticularly to the<br />\ncitAmerican citizens and future<br /><br />\nIN UNIVERSITY BAPTIST CHURCH<br /><br />\nizens.<br />\nSincerely, P. H. S.<br />\nMarch 23, 1923.<br /><br />\nTuesday, April 3rd<br />\n4 P. M.—\"Bricks Without Straw at Pithom.\"<br />\n8 P. M.—\"The Civilization of Palestine in Patriarchal Times.\" (illustrated).<br />\nWednesday, April 4th<br /><br />\nSTUDENT COUNCIL NOTICE<br />\n4 P. M.—\"Exodus and the Wilderness Journey.\"<br />\nIn answer to the letter which<br />\n8 P. M.—\"The Doctrine of the Resurrection Which Israel Brought Out<br />\nof Egypt; and What Became of It.\" (illustrated).<br />\nsome<br />\nBag<br />\nMail<br />\nthe<br />\nin<br />\nd<br />\nappeare<br />\ntime ago, asking for undergradu- Thursday, April 5th<br />\nate admission to the Gilman Me4 P. M.—\"The Problem of the Pentateuch; a New Solution by Archaeological Facts and Methods.\"<br />\nmorial Room, the Student CounM.--\"Jerusalem from the Walls\" (illustrated).<br />\nof<br />\nP.<br />\n8<br />\nperiod<br />\na<br />\nfor<br />\ncil announces that,<br />\ntwo weeks, probably directly after<br />\nFriday, April 6th<br />\nthe Easter recess, the Senior<br />\n4 P. M.—\"Where the Archaelogist Finds God in the History of Israel.\"<br />\nShrine wil be thrown open to the<br />\n8 P. M.—\"The Art and Religion of Tutankhamen\" (illustrated).<br />\nmembers of the lower classes.<br />\nDr. Kyle is fresh from Egypt with the results of up-to-date archaeological<br />\nresearch on hand.<br /><br />\nFRESHMAN, NOTICE<br />\nDr. Kyle is the author of three great books on Archaeology:<br />\nWil( ) \"Moses and the Monuments\"<br />\nto<br />\npaid<br />\nAll dues should be<br />\n(2) \"The Decision Voice of the Monuments in Biblical Criticism.\"<br />\nber,<br />\ntreasure<br />\nloughby, the class<br />\n(3) \"The Problem of the Pentateuch; a New Solution by Archaeological Facts and Methods.\"<br />\nfore the beginning of the Easter<br />\nrecess. Those failing to pay by<br />\nfor admission, but an offering will be taken at each service to cover<br />\ntonic-row afternoon will probably No charge<br />\nexpenses.<br />\nbe fined $1.00 when they pay upon<br />\nTake the whole course, though any one of the lectures will be valuable.<br />\ntheir return to the University. The<br />\nents will be served in the Sunday School room of the Church at 5.30<br />\ndues are $2.50.<br /><br />\nRefreshm<br />\nto 6.30, at which time Dr. Kyle will answer questions.<br /><br />\nNow Biggs Gets to Class<br />\nOn Time!<br /><br />\nbe written about<br /><br />\ntale of adventure might<br />\njvtheexciting<br />\nhunting expeditions Biggs used to make after<br /><br />\nthe elusive cap of his old tube of shaving cream. For<br />\nmonths Biggs was late to class because he spent valuable<br />\nminutes scouring the corners of the bathroom for a cap<br />\nthat persisted in getting lost.<br />\nBut those troubles are over. For Biggs has started<br />\nusing Williams' Shaving Cream, which comes in a tube<br />\nwith a hinged cap that can't get lost. You see pictured<br />\nhere this cap which saves his time and patience and<br />\nwhich will do the same for you.<br />\nThe convenience of the Hinged Cap would alone<br />\nbe ample reason for your<br />\nNotice the hinged<br />\ncap. You can't<br />\nusing Williams'. But when<br />\nlose it—and the<br />\ntubehangs VP!<br />\nyou consider that in addition<br />\nWilliams' is good for your<br />\nskin, and is the most remarkable beard softener known,<br />\nthen it does seem that you<br />\nwould be missing a good deal<br />\nin getting along without it.<br />\nBuy a tube and see if it isn't<br />\nvastly better.<br /><br />\nms<br />\nia<br />\nll<br />\nWi<br />\nShaving Cream<br />\nSWINDELL CALLS ON TICKET SELL- smoker last Wednesday evening,<br />\nERS TO PEP THINGS UP<br />\nthe various chapters pledged them<br />\nContinued from page 1.<br /><br />\nThe Dartmouth Musical Club<br />\nwill hold a concert in the auditorium of the Maryland Casualty<br />\nBuilding on April 11. The Hopkins Musical Club will hold a concert at First M. E. Church on<br />\nApril 12. At the inter-fraternity<br /><br />\nselves to sell 1300 tickets.<br />\nIn accordance with the plan<br />\nannounced at the previous assembly by Dean Latane, the assembly was conducted by Sherwood,<br />\nPresident of the Student Council.<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 27, 1923<br /><br />\nSPEAKERS FOR RICHMOND<br />\nDEBATE CHOSEN BY<br />\nThe Medical Standard Book Co.<br />\nDR. FRENCH<br />\n(THE BOOK MART)<br />\nAdams Contestants Also Selected.<br />\nVarsity Seal Ruling May Be<br />\nComplete Stock of<br />\nChanged<br />\nMedical Books and College<br />\nRequisites<br />\nLast Wednesday, March 21, Dr.<br />\n1. Donald K. Vanneman,<br />\nImporters and Dealers in Fine Books<br />\nJno. C. French selected the followmanager baseball: \"I think<br />\ning students for the Hopkinswe have a fairly good chance<br />\n301 N. CHARLES ST.<br />\nfor a good team. Our only<br />\nRichmond debate: Messrs.'Charles<br />\nBaltimore, Md.<br />\ndrawback is our weak pitchC. G. Evans, William B. Gross and<br />\ning staff; the rest of the team<br />\nBernard J. Bamberger, as alteris going along in great<br />\nORTMAN<br />\nshape.\"<br />\nnate. Mr. Evans aided in the vic\"Queen Quality\" Home-made<br />\n2. Lieutenant Sherwood,<br />\nover the University of Marytory<br />\nChocolates<br />\nassistant professor of Mililand a few weeks ago, and was a<br />\nLuncheonette<br />\nIce Cream<br />\nIces<br />\ntary Science and Tactics:<br />\n227 N. Howard<br />\n518 N. Charles<br />\n\"They are excellent.\"<br />\npotent factor in the winning of his<br />\nDancing Every Afternoon at<br />\n3.<br />\nJohn<br />\nSherwood,<br />\npresiclass<br />\ndebate in the early part of the<br />\nCharles St.<br />\ndent of the Student Council:<br />\nyear; he will also represent Hop\"We have a good chance<br />\nkins<br />\nin the Triangular Debates<br />\nthis<br />\nyear.<br />\nAs soon as the<br />\nCollege and Fraternity Stationery<br />\nweather<br />\nwarms<br />\nup<br />\nenough<br />\nagainst Washington and Lee. Mr.<br />\nBanquet and Dance Cards, Invitations<br />\nfor practice, I think we'll find<br />\nGross helped the Sophomores win<br />\nJAS. H. DOWNS<br />\nthat we have a crackerjack<br />\nteam.\"<br />\ntheir debate, Mr. Bamberger comENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br />\n4. William Straus, gradpeted in the Adams Debate.<br />\nuate student: \"Well, we're<br />\nThe subject of the debate will<br />\ngoing to have a good track<br />\nTUTORING<br />\nbe the same as for the Triangular<br />\nteam.\"<br />\nMath., Physics, Latin<br />\n\"Resolved, That the<br />\nDebates,<br />\n5. Bernard<br />\nBamberger,<br />\nG. P. ST. CLAIR, '24<br />\nstudent: \"I hope we'll have a<br />\nUnited States should favor the<br />\nRoom 115, C. E. Bldg.<br />\ngood baseball team. I'm not<br />\ncancellation<br />\nof the Inter-Allied<br />\nsufficiently versed in the art<br />\nP. 0. Box 808<br />\ncondition that the<br />\ndebt<br />\nwar<br />\non<br />\nof baseball to do anything<br />\n518 N. CHARLES STREET,BALTIMORE<br />\nindemnity be Materially Rebut enjoy it. But my patriotic<br />\nHopkins spirit, joined to my<br />\nduced.\" Hopkins submitted the Telephone,<br />\nVernon 3442<br />\nOrchestra-Dancing<br />\nprophetic insight, makes me<br />\nSTAGMERS PHARMACY<br />\nquestion and<br />\nRichmond will<br />\nconfident that the baseball<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M.<br />\nchoose the sides.<br />\nseason will be a huge sucPRESCRIPTIONS<br />\nTABLE<br />\nD'HOTE<br />\nLawrence B. Fenneman, former<br />\ncess.\"<br />\nLUNCHEON<br />\n-60c<br />\nD1NNER-$1.00<br />\nPresident of the Debating CounDrugs<br />\nCigars<br />\nCandy<br />\nSUNDAY<br />\nDINNER-$1.25<br />\ncil, announces that at the last<br />\nMUSICAL CLUBS GIVE FINANmeeting<br />\nCouncil<br />\nthe<br />\nof<br />\nit<br />\nwas<br />\nde5308 York Road<br />\nCIAL REPORT<br />\ncided to recommend to. the StuBecause<br />\nthis<br />\nis<br />\na<br />\nmidseason<br />\nredent<br />\nActivities Council that the<br />\nBaltimore, Md.<br />\nport the Musical Clubs, according participation in at least two interto Manager Vanne<br />\n. man, feel cer- collegiate debates shall be necestain the deficit will be made up be- sary before a student shall receive<br />\nAt the Washington Monument<br />\nfore the end of the present year. a Varsity Seal. The President of<br />\nOscar Thomas Olson, D.D.<br />\nWe have purchased 122,000<br />\nTwo more concerts are scheduled. the Council automatically repair U. S. Army Munson last<br />\nMinister<br />\nceives the Seal.<br />\nshoes, sizes 51/2 to 12 which<br />\nThe night of Thursday, April. 12,<br />\nThursday,<br />\nLast<br />\nMarch<br />\n22,<br />\nDr.<br />\nwas the entire surplus stock<br />\nHopkins Students Are Invited to<br />\nhas been definitely decided upon John C. French and Mr. John<br />\nof one of the largest U. S.<br />\nE.<br />\nMake This Their Church Home<br />\nas the date for the concert to be Uhler selected the following stuGovernment shoe contractors.<br />\ngiven at First M. E. Church, St. dents for the Adams Contest in<br />\nThe Sunday afternoon -At Home\"<br />\nThis shoe is guaranteed one<br />\nPaul and 22nd Streets. The one to Oratory; Messrs. William B.<br />\nin the 'Blue and Grey Room\" from<br />\nhundred per cent. solid leathbe given at Frederick on the fol- Gross, George R. Conning, Eder, color dark tan, bellows<br />\nfive to seven, followed by the young<br />\ntongue, dirt and waterproof.<br />\nlowing night, April 13, is still ward P. Sylvester and Elmer L.<br />\npeople's service will appeal to you.<br />\nThe actual value of this shoe<br />\nMylander. An unusual numbei<br />\nYou<br />\nare invited.<br />\npending.<br />\nis $6.00. Owing to this treof contestants were present anC<br />\nSunday morning worship at 11 o'clockmendous buy we can offer<br />\nFINANCIAL REPORT<br />\nthe competition was keen.<br />\nSunday evening service at 8 o'clocksame to the public at $2.95.<br />\nThe Adams Medal is given anMarch 21, 1923<br />\nMusic by vested chorus-choir of soloists<br />\nSend correct size. Pay postman on<br />\nnually<br />\nto the best speaker in z<br />\ndelivery or send money order. If<br />\nRECEIPTS<br />\nALL SEATS FREE<br />\npublic contest participated in by<br />\nshoes are not as represented we Balance from 1921-22<br />\n... $123.25<br />\nwill cheerfully refund your money<br />\nmembers of the second year unReceived from Student<br />\npromptly upon request.<br />\ndergraduate class and members of<br />\nActivities Fees<br />\n235.31 the class in Public Speaking I.<br />\nDonations<br />\n150.00 This medal is given in the memSale of awards<br />\n40-00 ory of former Professor Herbert<br />\nof<br />\nSale<br />\nmusic<br />\n8.00 B. Adams.<br />\nTAILORS<br />\n296 Broadway, New York, N. Y.<br />\nFranklin High concert<br />\nUniforms and Liveries<br />\n44.75 PROMINENT CIVIL ENGINEER ADMcDonogh concert.<br />\n121.00<br />\nDRESSES A. S. C. E.<br />\n128 W. Fayette St., Near Liberty St.<br />\nPrinters of the<br />\nBelair Concert<br />\n118.25<br />\nContinued from page 1<br />\nBaltimore, Md.<br />\nJohns Hopkins News.Letter<br />\nMd. Casualty concert<br />\n584.00 ty from the yards to the pier. The<br />\ncar dumper, which has a maxiWestminster concert<br />\n75.00<br />\nmum of four 200,000-pound cars<br />\nper<br />\nhour, then dumps the coal. It<br />\nTotal<br />\n$1,499.81<br />\nis finally conveyed by a rubber<br />\nand individuality is offered here at prices that are not<br />\nEXPENDITURES<br />\nbelt five feet wide to the storage<br />\nand<br />\ncannot be underquoted by any house at any time.<br />\nAdvertising<br />\n$192.75 bin. Labor is saved in these oper11<br />\nBesides<br />\nthe reputation of an old-established firm<br />\nPrinting<br />\n102.25 ations by a modern trimmer, reis<br />\nback<br />\nof<br />\neach sale with a guarantee.<br />\nMusic<br />\n62.75 cently installed. The single maGeneral concert expense. 213.30 chine has eliminated the labor of<br />\nInstruments purchased<br />\n42.80 nearly 1,800 men. Motion pictures<br />\nFURNI7 URE<br />\nDECORATIONS<br />\nDirector's fees<br />\nDRAPERIES<br />\n75.00 furnished by the Baltimore and<br />\n343<br />\nNORTH<br />\nCHARLES STREET<br />\nHall rental (Md. Cas.)<br />\n200.00 Ohio Railroad made clear all the<br />\nAwards<br />\n110.25 operations at the pier.<br />\nMailing<br />\n1.98<br />\nThe meeting was attended by<br />\nMiscellaneous<br />\n1.50 nearly 60 people, the largest this<br />\nCollege Literature<br />\nyear. Besides the regular mem$1,002.62 bers of the chapter, several memTotal<br />\nLOMBARD and SOUTH STREETS<br />\nBalance<br />\n$479.19 bers of the faculty were present,<br />\nOUTSTANDING BILLS<br />\nas well as representatives from the<br />\nReformer-Young man do you Director's fees<br />\n$575m Baltimore and Ohio Railroad. The<br />\nrealize that you will never get any- Hullabaloo<br />\n40.00 officers are now endeavoring to sewhere by drinking?<br />\n10.00 cure speakers for the April meetMusic<br />\nStewed-Ain't it the truth? I've<br />\nings of the society. In all likelistarted home from this corner five<br />\n$625.00<br />\nTotal<br />\nhood, two meetings will be held<br />\ntimes already.-The Missippian.<br />\n$145.81 during the month.<br />\nDeficit ti\" date<br />\nTHE CAMPUS QUIZ<br />\n(A Hopkins Question Asked<br />\nof Five People)<br />\nWhat do you think of the<br />\nbaseball prospects for this<br />\nseason?<br /><br />\nAthletic-looking<br />\nspring clothes you<br />\nare sure to like<br /><br />\nREADY-FOR-SERVICE<br />\n$30 UPWARD<br /><br />\n211-213 E. BALTIMORE ST.<br /><br />\nCHANTILLY<br />\nRestaurant Francais<br /><br />\nMount Vernon Place Methodist Episcopal Church<br /><br />\nPUBLIC SALES<br /><br />\nNational Bay State<br />\nShoe Company<br /><br />\nA. JACOBS &amp; SONS<br /><br />\nFURNITURE OF QUALITY<br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nCorrect Furnishings for<br />\nthe College Man<br />\nHUTZLER OTHEM<br /><br />"}], "field_media_file": [{"target_id": 37731, "display": null, "description": null, "target_type": "file", "target_uuid": "e64df35d-33e7-4567-a28c-049d77681db3", "url": "http://digital.library.jhu.edu/system/files/2022-03/13056-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13056, "target_type": "node", "target_uuid": "5745fa52-9648-4d08-89f1-04ca48ea7aab", "url": "/node/13056"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "3c176890-c4a9-4a86-82ad-7783884ba909"}]}