{"mid": [{"value": 40296}], "uuid": [{"value": "d976e39c-56ad-4e60-ba47-df757cb9f138"}], "vid": [{"value": 40296}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T20:02:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "14343-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T20:02:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T20:02:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Gene-splitting, part one<br />\n<br />\nRecombinant DNA research starts to split ranks<br />\nBy ERIC GARLAND<br />\n\"In the name of improving human health, newer and<br />\nmore potent threats to human health are being developed<br />\nthrough the technology of artificial gene<br />\nimplanation.\"--Statement from Science for the People<br />\n\"During the past two years, much fiction has been<br />\nwritteen about \"recombinant DNA research.\" What<br />\nbegan as an act of responsibility by scientists, including a<br />\nnumber of those involved in the development of new<br />\ntechniques, has become the breeding ground for a horde<br />\nofpublicists -- most poorly informed, some well-meaning,<br />\nsome self-serving.\" -- Stanley Cohen, Science<br />\nAnother scientific storm has broken on the horizon. In<br />\nan era full of tussles over issues like nuclear energy.<br />\nchemical warfare, space programs and supersonic air<br />\ntransport, a new controversy has come out of the<br />\nlaboratory and started to break at local government<br />\nlevels, in the press, and on university grounds.<br />\nThis one is variously called \"recombinant DNA<br />\nresearch,\" \"gene- splicing,\" and \"genetic engineering.'<br />\nAll the terms refer to a basic concept of joining DNA<br />\nfragments -- the material that constitues genes an<br />\nprovides' the hereditary information for all life forms —of<br />\none organism to the genes of a carrier (such as a virus o<br />\nplasmid). This recombinant \"vector\" is then introduce(<br />\ninto the cells of another organism, where it may grow a:<br />\nan \"adopted\" gene. Current research mostly involves thl<br />\ntransfer of animal or plant genes to host bacteria cells.<br />\nBy using recombinant techniques, scientists lool<br />\nforward to tremendous benefits, while critics envisioi<br />\ndangerous scenarios. The debate, though, has a few<br />\nunusual features. The battlelines are not clearly drawn: a<br />\nnumber of leading biologists are strongly opposed to the<br />\ncurrent research, while others committed to<br />\nenvironmental safety in many areas welcome the new<br />\nOpportunities. And the guidelines and safeguards now in<br />\neffect for recombinant work came from within the<br />\nscientific community, before the research had begun in<br />\nearnest,<br />\nIn July 1973, at the Gordon Research Conference on<br />\nNucleic Acids, scientists recognized the potential hazards<br />\nof the new gene-splicing techniques and sent letters to<br />\nthe National Academy of Science, prompting the NAS to<br />\nset up a review committee and call for a moratorium on<br />\nexperiments pending investigation. An international<br />\nconference was also proposed, and in February 1975,<br />\n150 people gathered at the Asilomar Conference Center\"<br />\nin Pacific Grove, California, to discuss genetic<br />\nengineering and possible ways to deal with its risks.<br />\nThe report from Asilomar spurred a series of three<br />\nmeetings of the National Institutes of Health (NIH)<br />\nRecombinant Advisory Committee in 1975. The Director<br />\nof NIH, Donald Frederickson, then worked with his own<br />\nadvisory committee, going over specific guidelines drawn<br />\ntogether from the three separate meetings. Finally, in<br />\nJuly 1976, the NW issued its settled-on guidelines to<br />\nreplace the recommendations of the Asilomar<br />\nConference.<br />\nSo within three years, scientists had realized the risks<br />\nof their new research and had taken it upon themselves<br />\nto create a set of guidelines to regulate the work about to<br />\nbe done. This self-policing, before recombinant research<br />\nwent full ahead, is justly referred to as a foresightful act<br />\nof responsibility; ironically, it has also drawn the valid<br />\ncharge that \"the Committee authorized to write the<br />\nGuidelines consisted primarily of scientists interested in<br />\ndoing this research.\" That quote comes from Science for<br />\nthe People, a Boston-based group which includes some<br />\nprominent biology professors among its members. They<br />\nAn d other critics contend that the NIH Recombinant<br />\nAdvisory Committee -- with but one non-science advisor<br />\nrepresents a conflict of interest, asking the incendiaries<br />\nto put out the fire.<br />\nIn the introductiOn to the NIH guidelines,<br />\nFrederickson stated: \"Recombinant DNA research brings<br />\nto the fore certain problems in 'addressing the potential<br />\nimpact of basic science on society as a whole, including<br />\nthe manner of providing public participation in those<br />\nassessments,...lt is not surprising that scientists in other<br />\nfields and the general public have difficulty in<br />\nunderstanding advances in recombinant DNA research.<br />\nYet public awareness and understanding of this line of<br />\ninvestigation is vital.\" Last year, \"public participation\"<br />\nwas carried out in a heated manner in Cambridge. The<br />\nCity Council, after finding out about some planned<br />\nhigher-level risk experiments to be done at Harvard and<br />\nMIT, voted a \"good faith\" (since their action had no<br />\nforce of law) three-month moratorium on the reserach. A<br />\nreview board was established; last month, it gave the<br />\ngo-ahead to lower-level experiments.<br />\n<br />\nThe public hearings and council actions in Cambridge<br />\npolitical<br />\nbrought out dissension in faculty ranks,<br />\nopportunism on the part of some council members, and<br />\ncommunity backlash against the two schools. Dr. Robert<br />\nDot tin, a biology professor at Hopkins who had<br />\npreviously been at MIT, recalled that \"the experiments<br />\nwere frightening to some people. There were not<br />\nwell-regulated facilifies...I think that in Harvard's case<br />\nthere was reason to be concerned.\" He also noted that<br />\npeople around Harvard and MIT are \"concerned about<br />\nhow much input the public has. They feel the science is<br />\ntoo dangerous to be left to scientists alone.\"<br />\nOther cities where universities have proposed or are<br />\ndoing recombinant DNA research have taken action,<br />\nthough not on the level of the Cambridge moratorium.<br />\nReview committees in San Diego and Ann Arbor (the<br />\nlatter an in-university affair) made recommendations<br />\nabout research at the local universities; public hearings<br />\nand panels in Bloomington and Princeton brought out<br />\noften tense discussion on the recombinant work.<br />\nMeanwhile, two states (California and New York) are<br />\nmoving toward some sort of legislation to regulate the<br />\ngene- splicing research. As states ponder bills, it is<br />\nsignificant to note that the NIH guidelines are just that -guidelines, not regulations. Within the academic<br />\ncommunity, researchers are under heavy pressure to<br />\nfollow the guidelines, since they are usually funded by<br />\nthe NIH. And, as Dr. Robert Ballantine of the Hopkins<br />\nBiology Department explains, \"you can't get published<br />\nunless you've followed the guidelines. If there was a<br />\nquestion of perjury, your name as a scientist would be<br />\nmud...glory doesn't come from headlines in the New<br />\nYork Times. It comes with the publication of journal<br />\narticles.\"<br />\nIndustry, however, also has a stake in genetic<br />\nengineering. Currently, there are seven major<br />\npharmaceutical companies involved in recombiant<br />\nresearch; they are well aware of the ,N11-1 guidelines, but<br />\nonly have to accept them voluntarily. The corporations<br />\nare hesitant about any federally- adopted regulations<br />\nparallel to the guidelines that would require approval of<br />\nall research plans since disclosure would wreck patent<br />\nopportunities. At present, then, much secrecy surrounds<br />\nthe industry's research, as writers for the People's<br />\nBusiness Commission discovered after contacting<br />\ncompany representatives.<br />\nWhat they did find was an Interagency Committee set<br />\nup by then- President Ford last September, responsible<br />\n\"to review federal policy on the conduct of research<br />\ninvolving the creation of new life forms.\" This<br />\ncommittee, under the supervision of NIH, has many<br />\nmembers with backgrounds in industry, another possible<br />\nconflict- of-interest arrangement. As the PBC reported in<br />\nMother Jones magzine, \"a significant faction of the<br />\nInteragency Committee is urging that federal guidelines<br />\non recombinant DNA research be made voluntary and<br />\nthat the industry be left to police itself. In the unlikely<br />\nevent that the committee takes a tougher stance and<br />\nrecommends, for instance, the creation of a new<br />\nsuper-agency with enough money and muscle to closely<br />\n<br />\npolice all NDA research, look for the inductrv to resist.\"<br />\nThe committee's report, originally due in January, now<br />\nappears scheduled for March as the earliest release date.<br />\nWhether industry will follow the present NIH<br />\nguidelines -- which \"should be mandatory for anyone<br />\ndoing research,\" according to Dr. Eric Weinberg of the<br />\nBiology Department -- remains to be seen. A recent<br />\nScience article reports that industry spokesmen have<br />\nindicated a desire for some government agency to follow<br />\ntheir research, if only to get out of the \"fishbowl\" of<br />\nsuspicion they are now in.<br />\nIf an agency does come to have some responsibility for<br />\nindustry action (the NIH the most likely prospect),<br />\nhowever, it faces the problem the old Atomic Energy<br />\nCommission had: it would be charged with regulating an<br />\nindustry that it promoted at the same time. Viewing the<br />\nred tape the nuclear industry now encounters from AEC<br />\nspin-offs, the pharmaceuticai companies would certainly<br />\nfight any attempts at a purely regulatory body that could<br />\nseverely delay their research. The industry, after all, is<br />\ninvolved in a competitive situation and threats to patents<br />\nand the research behind those patents would not be<br />\ntaken lightly.<br />\nBesides academic and industry research, there remains<br />\nthe question of possible defense work in recombinant<br />\nDNA research. Some scientists have cited the effective<br />\nfailure of the Army to produce any controllable<br />\nbiological weapons when they engaged in that research as<br />\na reassuring sign. The new gene-splicing techniques,<br />\nhowever, would seem an unhealthy tool for defense and<br />\nintelligence workers to have, given the record of their<br />\nrecent practices.<br />\nReturning to the subject of the NIH guidelines: while<br />\nacademic researchers observe them, the following of the<br />\nregulations does not imply satisfaction. A straw poll<br />\ntaken by the Federation of AMerican Scientists found<br />\n;4% of the biologists and 32% of those in other fields<br />\nbelieved the guidelines to be \"probably insufficiently<br />\ncautious.\" At the same time, many scientists find them<br />\ntoo stringent; as Brown comments, \"I call it strict when<br />\nyou must work on a harmless bacteria under conditions<br />\nthat are more strict than those for disease- causing<br />\nbacteria.\"<br />\nWith increasing publicity about recombinant DNA<br />\nresearch -- especially information that can be strongly<br />\nbiased on one side or plainly wrong -- the controversy<br />\nseems to be heading toward more difficult regions, rather<br />\nthan smoothing out and passing over. Again from<br />\nFrderickson's introduction to the NIH guidelines, \"Public<br />\nresponsibility weighs heavily in this genetic research<br />\narea...the responsibility of the scientists involved is as<br />\ninescapable as is their opportunity to beneficially enrich<br />\nour understanding.\"<br />\n<br />\nNext week -- Reconzbinant DNA research at<br />\nHopkins;accounts of the benefits, risks,and<br />\nguidelines ofgene-splicing; and more.<br />\n<br />\n\fpage 2/news-letterifebruary 18, 1977<br />\n<br />\nAnderson's investigators talk:<br />\nBy MARC DUVOIS1N<br />\nHarvard Theologian Harvey<br />\nCox is fond of suggesting that the;<br />\nmedical and legal professions<br />\ndraw up strict ethical guidelines.<br />\nSuch an approach, however,<br />\nmight be better applied to the<br />\npractice of journalism, if<br />\nWednesday's address by two<br />\noperatives of the Jack<br />\nAnderson -Les Whitten news<br />\nempire is any indication.<br />\nJim Grady, a University of<br />\nMissouri journalism graduate, and<br />\nJulia Rose, a recent alumna of<br />\nHopkins' School for Advanced ,<br />\nInternational Relations, are two<br />\nof the dozen or so anonymous<br />\nsoot -gatherers who keep<br />\nAnderson's nationally syndicated<br />\n\"Washington Merry-Go-Roundfull of the stuff that brings<br />\nknaves to justice, titillates the<br />\nsuburban readerships, and<br />\noccasionally showers disrepute<br />\non those who least deserve it.<br />\nTo work for Anderson, both<br />\nagreed, is to be affiliated with a<br />\nrevered American institution.<br />\nDisgruntled<br />\ngovernment<br />\nfunctionaries with an axe to grind<br />\ncontact Anderson first. Calls<br />\nmade in Anderson's name are<br />\nalways returned. Even demigods<br />\nlike Brent Scowcroft and<br />\nLawrence Eagleburger accord<br />\nhim an honor the Kennedy staff<br />\nused to accord James<br />\nReston-Anderson is never put<br />\non hold.<br />\nStill, Anderson needs a<br />\nconstant supply of soot to spread<br />\nthroughout his syndicated<br />\ntelevision, radio and newspaper<br />\nreports, and Grady, Rose. and a<br />\nstaff of eight or nine other<br />\ninvestigators work to provide it.<br />\nGrady, whyse parenthetical claim<br />\nto fame is his novel, Three Days<br />\nof the Condor, opened his<br />\nremarks by trying to dispel the<br />\npopular image of an investigative<br />\nreporter as '4a mysterious,<br />\ndisheveled figure in a<br />\ntrench-coat.\" In the process, he<br />\nestablished a new one, albeit<br />\nunwittingly-that of the young,<br />\naggressive social mover, the<br />\n<br />\nwalking, breathing \"instinct for investigation. \"The truth is the<br />\nthe jugular\" brought to life by best defense,\" he said, noting<br />\nDustin Hoffman in All The that Anderson's office has never<br />\nPresident's Men.<br />\nlost any of the countless libel<br />\nAfter taking potshots at some suits filed against it every year.<br />\nstationary targets-to wit, the<br />\nRose, recently emerged from<br />\nNational Enquirer, New Jersey the halls of academe, said she<br />\nCongressman Henry Helstoski, finds Anderson's influence and<br />\nand Toni Snyder-Grady said authority a powerful weapon in<br />\nthat Anderson's staff employs investigating officeholders. \"Jack<br />\none basic criterion in deciding is like an institution,\" she<br />\nwhether to disclose potentially remarked. \"He attracts tips,<br />\nembarrassing information about a news, and sources. If I'm having<br />\npublic official. \"We try not to dig trouble getting someone to level<br />\nup personal peccadilloes unless with me, I ask Jack to call him<br />\nthey affect someone's work,- he up. That usually does the trick.\"<br />\nShe said that Anderson's office<br />\nexplained. \"If Congressman X is<br />\nhaving an affair with his secretary is run on a basis of mutual<br />\nand they're both working hard, trust-between the investigators<br />\nfine. If not, it's a story.and their sources as well as<br />\nHe revealed the depth of his between Anderson and his staff.<br />\ncompassion for those whose \"You learn about people, about<br />\nnames have been unjustly who you can trust, and who's<br />\nblackened by Anderson's column lying. And it's amazing how<br />\nby observing: \"Jack's human.- much Jack trusts us, how much<br />\nAsked to comment on one of he'll put himself on the line for<br />\nAnderson's most egregious errors, us.\"<br />\nhis erroneous report that Senator<br />\nFollowing a brief question and<br />\nThomas Eagletoni<br />\nhad a answer session, Grady resumed<br />\nclandestine drunk driving record the tone of his speech, calling<br />\nto match his mental health editorial writers \"gutless,\" most<br />\nproblems, Grady replied: \"Jack newspapers \"hopeless,\" and the<br />\napologized.\" When it was Baltimore Sun \"a paper I've seen<br />\nsuggested that this was small maybe twice and can't comment<br />\nsolace for Eagleton, who never on.\" Just as well.<br />\nrecovered from that accusation,<br />\nBut like anyone associated<br />\nGrady elaborated: \"Jack<br />\nwith the Washington<br />\napologized.\"<br />\nestablishment, Grady and Rose<br />\nCold-blooded or not, Grady<br />\nwere good for some gossip<br />\nhad some astute observations to<br />\ntidbits, one of which merits<br />\noffer about the condition of the<br />\ntranscription here. Last Fall,<br />\nAmerican press. Most papers, he<br />\nAnderson's staff began to hear<br />\nasserted, suffer from what he<br />\nstrange, unflattering rumors<br />\ncalled \"afghanistanism\"-the<br />\nabout then-Speaker of the House<br />\nwillingness to deplore corruption<br />\nCarl Albert. With Anderson's<br />\nabroad while winking at local<br />\nconsent, several of the<br />\niniquities. \"Most papers are<br />\ninvestigators oid some light<br />\nafraid to call the Mayor a crook, digging into Albert's newfound<br />\nusually because the publisher<br />\ndisrepute and ascertained that<br />\nplays golf with him,\". he said.<br />\nthe Speaker had developed a<br />\n\"I'm for calling the mayor a<br />\npeculiar work habit. Every<br />\ncrook if he is one.\"<br />\nmorning Albert would sit in his<br />\nGrady advised prospective<br />\noffice for three to four hours<br />\njournalists to eschew journalism<br />\ntalking and sipping Ginseng tea<br />\nschool-\"All they can do is teach<br />\nwith a young, nubile disciple of<br />\nyou the libel laws\"-and to<br />\nThe Reverend Sung Myung<br />\ndisregard the threat of suit by the<br />\nMoon. Albert responded<br />\nsubject of an ongoing<br />\nindignantly to the investigators'<br />\n<br />\nThis week-end at Hopkins<br />\nThis week-end at Hopkins will also include the showing of \"Reefer<br />\nMadness- and \"Assassin of Youth\", the classic anti-marijuana films<br />\nproduced in the mid-1930's. The movies will be screened at midnight on<br />\nFriday, February 18 and Saturday, February 19, in Shriver Hall. They<br />\nwill be followed by a showing of an assortment of cartoons. Admission<br />\nis $1 per person, and all proceeds will go to Maryland NORML,-a<br />\nnon-profit, all-volunteer, statewide organization working to reform the<br />\nstate's marijuana laws. For furiher information contact Lou Curran or<br />\nJulie Landau at 889-5376.<br />\n<br />\nV<br />\n<br />\nThey have flexible morals<br />\n<br />\nJim Grady and Julia Rose<br />\n<br />\nbaffled inquiries. His office was<br />\nhis own business, she didn't<br />\ndisturb him, and besides, he liked<br />\ntea.<br />\nThe story was there, but the<br />\nAnderson people couldn't decide<br />\nwhether to print it. Certainly it<br />\nseemed a slender charge on which<br />\nt,o impugn the integrity of a<br />\nrespected legislator. But then<br />\nAlbert's morning visitor was in a<br />\nposition to do some powerful<br />\nlobbying for her cause, was she<br />\nnOt? It was decided the story.<br />\nwould run.<br />\nThere was another obstacle,<br />\nhowever: Albert would not talk<br />\nat length to any of the Anderson<br />\nstaffers. Les Whitten went to see<br />\nAlbert with Grady and some<br />\nother investigators. Still no dice.<br />\nFinally, Anderson himself called<br />\nup Albert, feigned alarm, and<br />\npleaded with the Speaker to<br />\ndissipate the \"pernicious rumors\"<br />\nhovering over his respectability.<br />\nAlbert agreed to meet with<br />\nAnderson's people over lunch in<br />\nthe Congressional dining room.<br />\nQuite a meeting.<br />\nSo anxious was Albert to<br />\nimpress the reporters with his<br />\nfitness that he boasted of having<br />\nalmost overcome his only<br />\nphysical impairment-a mild<br />\n<br />\nThe Johns Hopkins University<br />\ncampus will host a public forum,<br />\nentitled \"Voices of American<br />\nIndian Resistanca,\" on Saturday,<br />\nFebruary 19 at 8:00 p.m. in the<br />\nGreat Hall of Levering. The<br />\nspeakers will include Jimmie<br />\nDurham [International Indian<br />\nTreaty Council, AIM], Pauline<br />\nHaines [International Indian<br />\nTreaty Council], Billie Tayac<br />\n[Tribal leader, piscataway Nation<br />\nin southern Md.], and Tim<br />\nCoulter [Lakota Treaty<br />\nCouncil]. Also featured in the<br />\nprograrp will be the Piscataway<br />\nDance Group. A donation of $2<br />\nis requested. Tickets may be<br />\npurchased at the door. For<br />\nfurther information call<br />\n435-7995 or 426-1273.<br />\n<br />\ndegeneration of the throat<br />\nmuscles which occasionally<br />\nimpeded swallowing. Doctors had<br />\nadvised him, Albert revealed, to<br />\ntry to speak while masticating his<br />\nfood, as such an exercise would<br />\nstrengthen the atrophied muscles.<br />\nThe reporters grinned wanly at<br />\none another. Albert would not be<br />\nput off, and insisted on<br />\ndemonstrating the level of<br />\nproficiency he had attained in<br />\nfollowing this advice. \"I will<br />\ncarry with me to my grave,\" said<br />\nGrady, \"the vision of Carl Albert<br />\nsinging 'Mary Had A Little Lamb'<br />\nwhile chewing a Delmonico<br />\nsteak.\" This behavior was<br />\nthought to indicate a lack of the<br />\nsort of judgement one expects<br />\nfrom the Speaker of the House,<br />\nthe nation's third in<br />\ncommand -so it too was<br />\ndescribed in the column.<br />\ncan't say whether the rest of<br />\nthe audience was as disturbed by<br />\nGrady's steely demeanor and<br />\nflexible moral standards as I was.<br />\nThe spectacle confirmed my<br />\nsuspicion that Richard Reeves of<br />\nthe late New York magazine is<br />\nthe only political reporter<br />\ncapable of combining perception,<br />\ndaring and a measure of<br />\ncompassion.<br />\n<br />\n\f.february 18, 1977/news-letter/page 3<br />\n<br />\nOut with the myths<br />\nBe a part of life:<br />\nConsumer education!<br />\nBy D.H. WARREN<br />\nMyths seem to be a by-product<br />\nof civilization. This might not be<br />\nso bad if the myth did not have<br />\nthe power to distort reality and a<br />\nperson's view of - his/herself, if<br />\nmyths were seen as the fairy<br />\ntales that they are.<br />\nOne myth most people seem<br />\nto accept is that senility is<br />\ninevitable, and therefore there is<br />\nlittle hope for the elderly.<br />\nMedical dictionaries, including<br />\nthose recently published, define<br />\nsenility as \"old age,<br />\nfeeblemindedness.\" The<br />\nimplication is that because there<br />\nis no escape from the natural<br />\nprocess of aging, everyone will<br />\nbecome senile. It certainly instills<br />\na fear of growing old.<br />\nResearch in the area of aging,<br />\nhowever, has shown that. there<br />\nare only two kinds of physical<br />\nsenility which are irrever sible.<br />\nThese are the chronic brain<br />\nsyndromes caused by<br />\ndeterioration of brain cells (senile<br />\npsychdsis), and the hardening of<br />\nthe arteries, cutting off the blood<br />\nsupply to the brain,<br />\n(arteriosclerotic). Problems such<br />\nas the decline of memory or a<br />\nfeeling of uselessnes„ often<br />\nlabeled \"senility,\" can be<br />\ncorrected through therapy.<br />\nAppearance of tither of the<br />\nchronic brain syndromes,<br />\nhowever, does not necessarily<br />\nmean that the person will<br />\nbecome senile. Extensive<br />\npost-mortems have revealed that<br />\npersons with brain damage were<br />\nnot always senile during their<br />\nlives, and thattthe reverse is often<br />\ntrue for persons who were senile,<br />\n(i.e., they showed no brain<br />\ndamage.)<br />\nDeterioration of all living<br />\nthings is, of course, inevitable.<br />\nSenility, on the other hand,<br />\ndefined as the total or parlial loss<br />\nof mental facUlties, affects only a<br />\nsmall proportion of the elderly.<br />\nThe secret seems to be in staying<br />\nactive and involved, for senility<br />\ncan probably be self-induced,just<br />\nas beliefs in other myths will<br />\nmake a person see him/herself in<br />\na certain way.<br />\nEducation<br />\nThe Maryland Department of<br />\nHealth and Mental Hygiene, in<br />\nconjunction with the Action In<br />\nMaturity (AIM) department of<br />\n<br />\nthe Greater Homewood<br />\nCommunity Corporation, has<br />\nbegun a pilot project to train five<br />\nsenior citizens as lecturers in<br />\nconsumer education, specifically<br />\nin the areas of health and home<br />\nsafety. The program, which.will<br />\nhold its final class next week, will<br />\nenable the graduates to go out<br />\ninto the community and talk to<br />\ngroups about the subject matter<br />\nthey have studied.<br />\nThe students in the class, all<br />\nelderly women, are called<br />\n\"facilitators\", because they are<br />\nnot really teachers but rather<br />\ndistributors of information and<br />\nguides to. other services<br />\nBeginning March 4, the<br />\nfacilitators will be lecturing on<br />\nsuch topics as prescription vE<br />\nover the counter drugs, health<br />\nfrauds, quacks, medical<br />\ninsurance, and mental attitudes<br />\ntoward illness.<br />\nThe program has two main<br />\ngoals: to show that senior<br />\n.citizens can be very effective as<br />\nicommunity leaders and resource<br />\npersons, and that there is an<br />\ninterest and, need in the<br />\ncommunity for health and<br />\nconsumer education. The Md.<br />\nDept. of Health and Mental<br />\nHygiene is looking forward to<br />\ninstituting the program<br />\nstate-wide, if the Baltimore city<br />\n\"guinea pig\" proves successful.<br />\n;he ladies involved in the<br />\nprogram reflect the attitude that<br />\nmyths do not have. to keep<br />\npeople down. They are ready to<br />\ngo out and help their<br />\ncommunity, to open up the eyes<br />\nof people who might say, \"I've<br />\nread all I need to know about<br />\nhealth and safety!\" The folks<br />\nfrom AIM hope to make the<br />\ncommunity healthier and safer.<br />\nThe lectures will be presented<br />\non Fridays at the Church of the<br />\nGuardian Angel (27th St. &<br />\nHuntingdon), March 4th, 11th,<br />\n18th and 25th at 12:30 p.m., and<br />\non Wednesdays at the Waverly<br />\nLibrary (33rd and Barclay<br />\nStreets), March 9th, 16th, 23rd<br />\nand 30th at 1:00 p.m. The<br />\nprograms are funded by the<br />\nBaltimore City Area on Aging.<br />\nThe more people that come, the<br />\nbetter they will like it. For<br />\nfurther information, interested<br />\npersons should call AIM at<br />\n889-7915.<br />\n<br />\nFanshen: politics and the arts<br />\n<br />\nrevolt in China. It .is more the<br />\nin-depth study and intuitive<br />\ninsight into the hearts and minds<br />\nof the Chinese people, and the<br />\ncomplex personal relationships<br />\nand power structures which arise<br />\nand prevail not only in China,<br />\nbut in many (other) societies as<br />\nwell.\"<br />\nThere is the hint, then, that<br />\npolitics is more than just<br />\nideology, armies, and revolt.<br />\nPolitics is evident throughout<br />\nhuman relationships: between<br />\nmen and women, teachers and<br />\nstudents, and bosses and workers.<br />\nFor politics is essentially a<br />\nquestion of power, of who does<br />\nwhat for whose benefit. This<br />\nidea, too, is foreign to the normal<br />\nconception which considers<br />\npolitics to be nothing beyond the<br />\nrough equivalent of<br />\n\"government.\" As Fanshen<br />\nshows, one of the most<br />\nimportant lessons of the Chinese<br />\nrevolution has been that politics<br />\nis everywhere.<br />\nSome of us may react to such<br />\nan assertion with disbelief,<br />\ndisagreement, or even -despair.<br />\nAfter all, does life have to be<br />\nserious all' the time? Can't we<br />\nenjoy some entertainment or our<br />\npersonal relationships without<br />\nalways having to worry about<br />\npolitics?<br />\nA certain amount of relaxation<br />\nand privacy is doubtless<br />\nnecessary for the enjoyment of a<br />\nhealthy life. But that is not<br />\nnecessarily inconsistent with an<br />\nEating Together Program: hot lunches at noon, weekdays. Church of the Guardian Angel, 27t 'St. & understanding and respect for the<br />\npolitical and social relationships<br />\nHuntingdon, reservations needed.<br />\nwhich help shape each of our<br />\nWalking group to Hopkins Noon Series: first Wed. of every month, meet in front of the Homewood Friends<br />\nlives. Fanshen illustrates this<br />\nCenter, 3107 N. Charles<br />\n.<br />\nFrench Impressionist Art Course: every Thurs. in March, 4 p.m., Second Presbyterian Church, St. Paul & point on two levels. First, within<br />\nthe play, it is demonstrated by<br />\nStratford Rd.<br />\nJohn Lombardi, Planning Project speaker: Thurs., March 3, 11:00 a.m., Homewood Friends Center, 3107 N. the Chinese peasants. As Boston<br />\nmagazine wrote, \"The play<br />\nCharles<br />\nemphasizes the human struggle to<br />\nDancing Class: Tues., March 8,11:30 a.m., Church of the Guardian Angel, 27th.St.& Huntingdon<br />\nAlan Christian speaking on \"Life and Death\": Wed., March 16, 10:30 a.m., Rotunda Theater, Rotunda understand what the revolution<br />\nmeans personally.\" Second, the<br />\nShopping Mall<br />\nArts & Crafts: Thurs., March 17,11:00 a.m., Homewood Friends Center, 3107 N. Charles<br />\n. audience will have the chance to<br />\nWomen in Literature Course: Tuesdays in April, lunch at noon, course begins at 12:30 p.m., Roland • enjoy a good, dramatic<br />\nproduction while simultaneously<br />\nEvergreen Center [Roland & 40th], taught by Beverly Gold, Community College of Bait.<br />\nBy MARK HERTSGAARD<br />\nMany of us believe that there<br />\nis an implicit contradiction.<br />\nbetween politics and the arts.<br />\nArtistic expression is viewed as<br />\nseparate and distinct from<br />\npolitical ideology or causes. \"Art<br />\nfor art's sake\" is the only<br />\nrationale necessary for the<br />\ncreation or admiration of a piece<br />\nof art.<br />\nThe Hopkins community will<br />\nhave the opportunity to<br />\nexperience a different perspective<br />\non this question this Sunday<br />\nevening, February 20, when the<br />\naward-winning production of<br />\nDavid Hare's Fanshen is<br />\npresented at 7:30 pm in Shriver<br />\nHall. This explicitly political play<br />\nis the story of the efforts of a<br />\nsmall, Chinese village (Long Bow)<br />\nto carry out the socialist<br />\nrevolution between 1945 and<br />\n1949. Fanshen was adapted from<br />\nWilliam Hinton's documentary<br />\nbook of the same name which,<br />\nby focusing on a single<br />\ncommunity, highlighted the<br />\nstruggle of the entire Chinese<br />\npeople to \"fanShen\" -- to stand<br />\nup, to throw off the landlord's<br />\nyoke and to create a new world.<br />\nAs Comment magazine said,<br />\n\"The play is, however, much<br />\nmore than an historic record of<br />\n<br />\nMore AIM programs<br />\n<br />\n'<br />\n<br />\nbeing exposed 'o serious political<br />\nand historical questions.<br />\nIn --fact, the Little Flags<br />\nTheatre Collective, which is<br />\npresenting the play, expressly<br />\ntries to blend a political message<br />\ninto .each of its productions.<br />\nAccording to Hanna Lessinger of<br />\nGuardian, the group \"can<br />\nproduce theatre which is at once<br />\nmoving, entertaining,<br />\n'professional' in its standards and<br />\npolitically committed,\" without<br />\nalienating the normal audience.<br />\nIn addition, Maxine Klein, the<br />\nplay's director, is nationally<br />\nknown for her abilities as a<br />\ndirector and playwright in<br />\ncombining vivid theatricality<br />\nwith political impact. In Boston<br />\nshe has been named \"Best<br />\nDirector of the Year\" for two<br />\nconsecutive years. Ms. Klein has<br />\nsaid that one goal of the<br />\nproduction is to convey to the<br />\naudience the idea that , \"People<br />\ncan change the course of their<br />\nlives.\"<br />\nAt first glance this may not<br />\nseem to be so astounding a<br />\nstatement. People's lives are<br />\nalways changing. We all grow<br />\nolder, pick up new interests,<br />\ndiscard old ones, and so on. But<br />\nin the context of Ms. Klein's<br />\nquote and of Fanshen, the notion<br />\nof changing people's lives implies<br />\nsomething much broader. It<br />\nimplies the extended meaning of<br />\nthe word fanshen - \"the creation<br />\nof a new productive base, new<br />\nsocial relationships, new forms of<br />\nself - government, new ways of<br />\nthinking ...\" In essence, then, it<br />\nimplies the complete<br />\ntransformation of the entire<br />\nsociety.<br />\nFanshen provides the Hopkins<br />\n.:ommunity with the rare chance<br />\no see good, entertaining,<br />\ndolitical theatre. It should prove<br />\nto be a worthwhile time for all.<br />\nTickets for the 7:30 pm<br />\nshowing this Sunday night are<br />\nS2.00 and may be purchased at<br />\nthe Union Desk.<br />\n<br />\n\fpage 4/news-letter/fehruary 18, 1977<br />\n<br />\nFilm review<br />\n<br />\nFellini's Casanova: The dreamlike images flow by<br />\nBy MIKE GIULIANO<br />\nItalian director Federico Fellini<br />\nwas not a happy man in August<br />\nof 1975. The negatives for the<br />\nfirst three weeks filming of his<br />\nfirst English language film,<br />\nCasanova, had been stolen along<br />\nwith a third of Pier Paolo<br />\nPasolini's \"Salo, or the 120 Days<br />\nof Sodom\" and Damiano<br />\nDamiani's \"A Genius, Two<br />\nAssociates and a Fool.\" Fellini<br />\nand his producer Alberto<br />\nGrimaldi estimated the value of<br />\nthe missing negatives to be in the<br />\nmillions. \"For me, the damage is<br />\nincalculable,\" Fellini told the<br />\npress. \"Not only would three<br />\nweeks of work be ruined if the<br />\nnegatives are not returned, but<br />\nthe entire planning of the film as<br />\nwell.\"_<br />\nThe undamaged negatives were<br />\nrecovered and production<br />\ncontinued. What, if anything,<br />\nhappened to his \"entire<br />\nplanning\"? The Casanova which<br />\npremiered last Friday at the<br />\nTowson theater is certainly not<br />\nlacking in visual brilliance—<br />\nindeed nearly every sequence is<br />\nbeautifully photographed, but<br />\nthe accompanying history of<br />\nGiacomo Casanova, though<br />\ncertainly not beautiful—and we<br />\nwouldn't expect it to be, isn't<br />\nbelievable either. The fault<br />\ndoesn't lie with actor Donald<br />\nSutherland so much as it does<br />\nwith director-screenwriter Fellini.<br />\nHe should've either strengthened<br />\nthe script, presented us with<br />\nempathetic characters and<br />\nsituations, or thrown the script<br />\naway and given us a succession of<br />\nstrikirg visual images.<br />\nFellini's rich pictures and<br />\nshallow plot are nearly<br />\nirresistable: one leans back, the<br />\ndreamlike images flow by, and,<br />\nenchanted with the sheer beauty<br />\none doesn't ask what it all means.<br />\nI can think of two possible<br />\ninterpretations. In the first we<br />\nhave a young Casanova, who<br />\nwhenever he is engaged in sexual<br />\ngymnastics is accompanied by a<br />\nmechanical, golden bird. The<br />\nconnection between the<br />\nmechanical movements of the<br />\nbird and the mechanical nature<br />\nof his own exploits is soor<br />\nobvious. His world is one with<br />\n\"undefined boundaries of<br />\namorous interest\" and he<br />\nmaintains a reputation<br />\nthroughout Europe for what<br />\nBurgess' Alex would call the old<br />\n\"in-out in -out.\" The sex is<br />\nfrenzied, often a contest, rarely<br />\nintimate. There are voyeurs,<br />\nconnoisseurs of the act, who<br />\nevaluate his performances.<br />\nNino Rota's music has a<br />\nmechanistic nature and contains<br />\nelements of the circus. It<br />\nenhances the image of Casanova<br />\nas a showman going through his<br />\nroutines. He performs, not just<br />\nfor his partner, but often for a<br />\ngroup. Sex for these people<br />\nseems to offer anything from<br />\npersonal physical satisfaction to<br />\nthe satisfaction of voyeuristic<br />\nimpulses, but tie idea that sex is<br />\nan expression of affection seems<br />\nforeign to them.<br />\n'Toward the end. an aged<br />\nCasanova. forsaken by Eros,<br />\ndecides to commit suicide rather<br />\n<br />\nthan live an impotent life. Ever<br />\nthe showman, he dresses in his<br />\nfinest clothes before walking into<br />\nthe Thames. He notices a giantess<br />\non shore, climbs out, and once<br />\nagain is immersed in an orgiastic<br />\nworld. He ends his days with a<br />\nmachine, a mechanical woman,<br />\nand when he makes love to her<br />\nwe conclude, naturally, that<br />\nlovemaking has become a rather<br />\ndesperate routine.<br />\nOn one level, the movie is no<br />\nmore that a succession of orgies<br />\nand Fellini is saying no more<br />\nthan that sexual license, while an<br />\nawful lot of fun, leads to no good<br />\nend. It's really the fantasy of a<br />\nCatholic schoolboy, an episodic<br />\nadventure in voyeurism on<br />\nFellini's part. Lascivious nuns,<br />\nthe erotic mysticism of the age,<br />\nand homosexual ballets are all<br />\nwonderfully naughty, and Fellini<br />\nallows us, vicariously, to share in<br />\nthe debauchery, giggle at these<br />\nextreme representations of our<br />\nown fantasies.<br />\nOur middle class repressions<br />\nare lifted, but a sense of guilt is<br />\ncatholic, because naughtiness,<br />\nhowever much fun it may by,<br />\nsimply isn't right. The old,<br />\nunhappy Casanova at the end of<br />\nthe film has gotten what he<br />\ndeserves. The audience has both<br />\nshared in his license and punished<br />\nhim for it. WI-r could be more<br />\nsimplistic and c, .1? Is Casanova<br />\nno more than a feast of<br />\nfireworks, spectacle and sex, a<br />\nsomewhat dreamy and classier<br />\nversion of the sort of escapist,<br />\nhedonis,.c and ultimately<br />\nmeaningless depravity which Ken<br />\nRussell continues to inflict upon<br />\nus?<br />\nAt times Fellini's Casanova<br />\nseems to be no more than Fellini<br />\nSatyrical set in the 18t1t century.<br />\n<br />\nCasanova does say: \"The prowess, but from the very<br />\nmanners of the Romans have not beginning he tells them about his<br />\nimproved since the days of prowess in engineering, literature<br />\nTrimalchio\" [a character in<br />\nand the occult. They don't reject<br />\nPe t ron iu s' Satyrical] Fellini his intellectual views so much as<br />\npresents us with suggestions as to they ignore them. When a body,<br />\nthe meaning of it all, but at the<br />\nnamely the Inquisition, does take<br />\nsame time he scorns any attempts<br />\nhis views seriously, Casanova is<br />\nwe might make to interpret these imprisoned.<br />\nvery suggestions. While a<br />\nCasanova's voice-over<br />\nhunchback is performing a<br />\nnarration to the film has the<br />\nhomosexual ballet one character same dry, ironic tone as in Barry<br />\nstates rather casually: \"You Lyndon [Are not both films<br />\nrealize it's symbolic.\" Symbolic extraordinary in a visual sense<br />\nof what? — the fact that Fellini's and deficient in plot<br />\nexcursions into his own personal construction?] Casanova's<br />\nfantasies are too cryptic for the<br />\nnarrative voice says that his<br />\nrest of us? Is it no more than an<br />\nescape from prison \"was favored<br />\nelaborate joke at our expense? of course by Fortune,\" but<br />\nWhen a girl plays a cello the<br />\nFortune usually seems to be<br />\ndubbing is awfully noticeable, it<br />\nworking against him. An escape<br />\nmust be intentional, but it seems from a Venice prison necessitates<br />\nto signify no more than that<br />\nan escape from \"Venice, my<br />\nFellini the artist is farting in the<br />\nbeloved city which I was being<br />\nfaces of his audience. It certainly<br />\nforced to abandon forever.\"<br />\ndoesn't make the movie any<br />\nDuring his travels through<br />\nmore creditable.<br />\nEurope, Casanova encounters his<br />\nI don't think audiences, as<br />\nbrother and his mother, but there<br />\nmuch as they enjoy sex and<br />\nis no love between them. He does<br />\nspectacle, will be satisfied with<br />\ncome to love a woman [I'm<br />\nFellini's versions of Petronius' happy and so afraid... I wish to<br />\nRome or Casanova's Europe, spend the rest of my life with<br />\nbecause audiences, once exposed<br />\nyou.\"], but another man gains<br />\nto such depravity, will — like the<br />\npower over her.<br />\ncharacters in Casanova -- demand<br />\nUnsuccessful in his attempts to<br />\nmore exotic forms of sex,<br />\nlove women and keep them, his<br />\nbody diseased and impotent, he<br />\nand they will never be<br />\nsatisfied, because depravity, walks into the Thames to join the<br />\nthough it stimulates and satiates souls of Horace, Dante, Petrarch<br />\nus, doesn't satisfy us.<br />\nand Ariosto. The giantess on<br />\nThat's one interpretation, one shore, a powerful and mysterious<br />\nin which the mechanical aspects woman, attracts him. Women<br />\nof sexuality were emphasized, send him into the river and bring<br />\nand the mind of Casanova wasn't him out of it. Love, for<br />\nmentioned at all. Another Casanova, is \"the sweetest of all<br />\npossible interpretation of deaths.\" Eros and Thanatos are<br />\nCasanova is dependent upon the once more brought together in a<br />\nfirst. The voyeurs, the audiences Venetian gentleman [Cf. with<br />\nwithin the film, appreciate<br />\nanother gentleman in Venice,<br />\nCasanova only for his sexual<br />\nMann's Aschenbach.] Ile can<br />\n<br />\nnever return to Venice, a city he<br />\nassociates with Descartes and<br />\nVoltaire.<br />\n\"I'm known all over Europe as<br />\na man of letters,\" Casanova<br />\nclaims, but all of the courts he<br />\nfrequents are debauched, and<br />\nthough the palaces are full of<br />\n.<br />\nworks of art, the people never<br />\nseem to notice that there are<br />\nRembrandts on the wall.<br />\nHe goes to bed with the<br />\nmechanical woman, but in this<br />\ninterpretation it is not symbolic<br />\nof the mechanical nature of his<br />\nlove. \"This machine was made by<br />\na poet,\" boasts Casanova of his<br />\nnew lover. \"Love, that is your<br />\nname,\" he tells her. Casanova<br />\nloves her as an artistic creation, a<br />\nthing of beauty. Or some such<br />\nnonsense.<br />\nHe ends his days as a librarian,<br />\n\"a position of considerable<br />\nimportance, in keeping with a<br />\nscholar and a man of letters,\" but<br />\nCasanova is not respected as a<br />\nscholar, is forced to eat with the<br />\nservants and soldiers. 'I am an<br />\nartist, I am an artist...You disgust<br />\nme,\" he curses them at dinner.<br />\nWhen he' appears in a fine<br />\ncostume to recite verses they<br />\nlaugh at the old man and he is<br />\nleft alone with - fantasies about<br />\nthe mechanical woman.<br />\nI can't conceive of any<br />\ninterpretation in which this „sex<br />\nmachine and frustrated scholar<br />\ncould be made to seem a<br />\n'creditable, character, Fellini's .<br />\npresence in every scene is too<br />\nstrong.<br />\nNaughty<br />\nFellini, once he got over his<br />\nAugust 1975 ,scare,. must have<br />\ngiggled a good deal on the set.<br />\nAfter all, Casanova is a naughty<br />\nfilm.<br />\n<br />\narts calendar<br />\nTheater<br />\nCenter Stage 700 N. Calvert Street, 332-0033. Lillian Hellman's \"Toys<br />\nin the Attic.\" Through March 6.<br />\n<br />\nDAR Constitution Hall 18th and D, N.W.(Georgetown) Al Stewart and<br />\nWendy Weidman on Feb. 26 at 8:30 pm.<br />\n<br />\nKennedy Center Opera House (Washington) \"Mark Twain Tonight\"<br />\nwith Hal Holbrook, through Feb. 19.<br />\n<br />\nThe Showboat Lounge 813 Ellsworth Dr, Silver Spring. 588-6226. Bill<br />\nEvans through the 20th.<br />\n<br />\nNational Theater 1321 E. St. (Washington) \"Bully,\" with James<br />\nWhitmore as Teddy Roosevelt. Through March 12. Call (302)872-0466<br />\nfor further information.<br />\n<br />\nBlues Alley 1073 Wisconsin Ave (Washington) 337-4141. Dizzy<br />\nGillespie, Feb. 21-26.<br />\n<br />\nKing of France Tavern Maryland Inn, Annapolis. 269-0990 from<br />\nArena Stage 6th St. and Maine Ave, SW (Washington) Lillian Hellman's Baltimore. Ethel Ennis.<br />\n\"The Autumn Garden.\" Through March 6. Call (202) 554-7890 for t<br />\nfurther information.<br />\nCenter Forum Old St. Paul's Church, Charles and Saratoga Streets.<br />\nString quartet performance at 12:30 pm and Lotus Band at noon on<br />\nTheater Project 45 W. Preston St. \"The Selection,\" an original work Feb. 22. Terry Snowdon plays music of Scott Joplin at noon on Feb.<br />\npresented by the Coda Theater Company and performed by Harvey 24.<br />\nLieberman. Through Feb. 20. Shows at 8 pm and 10 pm on Friday and<br />\nSaturday.<br />\nCathedral Concert Series 5300 N. Charles St. (Cathedral of Mary Our<br />\nQueen)Pianist Mary Stanton on Feb. 20 at 5:30 pm.<br />\nMechanic Theater Hopkins Plaza, 727-4103.\"A Chorus Line,\" through<br />\nFeb. 26. Coming on March 1 and playing through March 12 will be Liv The Cathedral Choir of the Mother AME Zion Church of New York<br />\nUllmann in Quintero's production of Eugene O'Neill's \"Anna Christie.\" presents a concert of black ,spirituals at 4 pm on Feb. 20 at the<br />\nArlington Presbyterian Church, 3215 W. Belvedere Ave. The 55<br />\nLeft Bank Jazz Society Famous BAllroom, 1717 N. Charles St., member choir will sing both traditional and contemporary<br />\n945-2266. Phil Woods Quintet on Feb. 20 at 5 pm. 55.50. 54.50.<br />\narrangements. Free.<br />\nConcerts •<br />\nPeabody Concert Singers- North Hall Peabody, Feb. 19<br />\nBaltimore Opera Lyric Theater, 120 W. Mount Royal Ave. Wagner's<br />\nat 8 pm.<br />\n\"The Flying Dutchman,\" Feb. 19 and 21, 8:15 pm.<br />\nPeabody Players Woodwind Quintet, Peabody Concert Hall, Feb.<br />\n23 at<br />\nnoon. Free.<br />\nBaltimore Symphony Orchestra Lyric Theater, Feb. 23 and 24, Zinman<br />\nof Rochester Philharmonic conducting Borodin's overture to \"Prince Civic Center Howard and<br />\nLexington. Dave Brubeck and Sons, tonight at<br />\nIgor,\" Prokofiefis Symphony Concerto for Cello and Orchestra with 8 pm. All seats $3. Charlie Pride<br />\ncomes in on Feb. 26 at 8 pm.<br />\nMihaly Virizlay, and Tchaikowsky's Symphony No. Four.<br />\nCellar Door in Washington, 34th and M Sts., presents<br />\nAndrew Gold<br />\nBaltimore Bach Marathon St. David's Church, 4700 Roland Avenue, through the 20th, Martin<br />\nMull and Steve Bishop on the 23rd and 24th,<br />\nFeb. 20 from 12:30 pm io 8 pm. Free admission.<br />\nPeter Allen Feb. 25-27. 337-3389.<br />\n<br />\n\f.febniary 18, 1977/news-letter/page.5<br />\n<br />\nAt Center Stage:<br />\nToys in the Attic<br />\nBy NED A. SOLOMON<br />\nAs the play unfolds the<br />\nSetting: A dilapidated house in individual characters discover<br />\nNew Orleans<br />\nthings about themselves they had<br />\nTinze: Summer [I believe Ms. ;kept hidden for years. I won't ruin<br />\nHellman wished it to be timeless] - it for you by revealing those<br />\nCharacters:<br />\nrevelations.<br />\nTwo old-maid sisters, Carrie and<br />\nCenter Stage suffers in the<br />\nAnna Berniers<br />\nsame way the Berniers sisters do:<br />\nTheir younger brother, Julian<br />\nit tends to perpetuate its<br />\nHis nymphette wife, Lilly<br />\nproblems. In every production I<br />\nHer strange mother, Albertine have seen this year there have<br />\nPrine<br />\nbeen some fine performances,<br />\nand a black man, Henry Simpson, unfortunately masked by some<br />\nmore than a servant to Albertine dreadful ones, which prevent the<br />\nConflict: Carrie, Anna and Lily<br />\nproductions from hitting their<br />\nall love Julian and want him to<br />\nmark.<br />\nsucceed, but when success finally<br />\nAnne Lynn [Carrie Berniers]<br />\ncomes they are frightened of does a commendable job as the<br />\nlosing him.<br />\nsister who has always loved<br />\nJulian, and portrays convincingly<br />\nToys in the Attic is a play the jealousy she feels for the<br />\nabout relationships, and how far other women who stand between<br />\nsome people will go to prove them. Lois Markle [Anna<br />\ntheir devotion and love. Anna Berniers] who gave the least<br />\nand Carrie Bernier are two convincing performance in, last<br />\nfixtures in a decrepit house, year's Old Thnes, fits the part<br />\nnothing more than the seedy well as far as her mannerisms go,<br />\nfurniture or the out-of-tune but her accent seems completely<br />\npiano. A feeling of status quo out of context in the New<br />\npermeates the hot summer air. Orleans setting. Ruby Holbrook<br />\nThey have dreams, but the was grandly enigmatic as<br />\ndreams are not really aspirations, Albertine Prine, but<br />\nthey are merely time-worn unfortunately some of her best<br />\nfantasies that are. best unfulfilled. scenes were played opposite<br />\nA day does not go by when a trip Walter Jones [Henry Simpson],<br />\nto Europe isn't discussed, or the who looked as if he'd only seen<br />\npossibility of selling the house; or the script five minutes prior to<br />\nthe possibility of Julian curtain. I have never seen a<br />\nbecoming a success. Lines like \"I performance more void of acting,<br />\n'always have\", \"it always was\", and this intrigues me when I am<br />\n\"it always has been\", are supposedly viewing<br />\nconstantly uttered as everything \"professional\" theatre. When<br />\nperpetuates itself. Above all they Henry leaves Albertine [do not<br />\nhave each other, and the love of a despair, I.ve spoiled nothing] in<br />\nbrother they have always taken the final reel the audience is truly<br />\nshocked, simply because there<br />\ncare of.<br />\n<br />\nBy DAVID SIEGMAN<br />\nLight begins to fill the tiny<br />\ndark stage and in a sudden burst<br />\n\\ of life, a man runs—no,<br />\ngallops—onto the stage. He<br />\ncontinues to gallop along the<br />\nouther edge 'of the stage, the<br />\nworn, creaky floor which is the<br />\nstage at .the Baltimore Theatre<br />\nProject. The stage is bare except<br />\nfor a ladder in the center.<br />\nThe man is wearing a Duron<br />\npainter's 'cap, a scarf around his<br />\nneck and mouth, gym shorts and<br />\nT-shirt, one tennis shoe, and one<br />\nfurry boot. Three young girls<br />\nsitting in the audience begin to<br />\ngiggle uncontrollably. Soon, their<br />\nheads will slowly turn, their eyes<br />\nkill meet, and their laughter will<br />\nsubside and be converted into<br />\none jolting three-way magnetic<br />\nshudder. For they will realize<br />\nthat the man on the stage is mad.<br />\nMadness as a means of artistic<br />\nconveyance is, in this<br />\np6rformance, deafening. The<br />\nviewer's perceptual faculties are<br />\nhypnotized and transfixed at one<br />\nraging, explosive focal point.<br />\nThat focal point, is Harvey<br />\nLiberman. His madness is<br />\nfrightening; it is as convincing as<br />\n<br />\nO'<br />\n<br />\nTOYS IN THE ATTIC will be playing at Center Stage, 700 N. Calvert St. through March 6.<br />\n<br />\nhas been no character motivation<br />\nto warrant it.<br />\nBeeson Carroll [Julian<br />\nBerniers] gives the most winning<br />\nperformance, playing the<br />\nprodigal brother like Robert<br />\nPreston played the Music Man.<br />\nHis expressions, mannerisms and<br />\nmovements are a pleasure to<br />\nwatch, and at all times he has<br />\ncomplete command of a very<br />\nlarge stage. Deborah Offner's<br />\n[Lily Berniers] performance is a<br />\ndifficult one to criticize. She had<br />\nsome captivating moments and<br />\nsome truly dead ones. With the<br />\nhelp o-f some expertdirection she<br />\nmight have portrayed a complete<br />\ncharacter and won the audience<br />\n<br />\nover.<br />\n<br />\n.the madness of \"Marat Sade,\" the uncontrollable<br />\nand as convincing as the madness fire—Lieberman. He floats in and<br />\nout of time:. in and out of<br />\nof an Elie Wicsel character. It is<br />\nthe madness of a tortured soul—a emotional states. First, his eyes<br />\nattack; white shiny opals<br />\ntortured Jewish soul.<br />\nHarvey Liberman is a young stretched wide, piercing, jabbing,<br />\nactor from New York. He is the judging. And then his limbs; steel<br />\nfire and the ash that envelop swords, flashing, searching. His<br />\nvoice is a constant cacophonous<br />\n\"The Selection,\" a one-man show<br />\nabout the Holocaust. Lieberman<br />\nwhine, like the sirens before the<br />\nfirst worked with Joel Benenson, air attack.<br />\nthe director of the show, in<br />\n1971. The two separated shortly<br />\nThe attack is a success.<br />\nthereafter, but were reunited in<br />\n1973, and with several other The audience is shamed, it is<br />\nartists formed Coda Theatre<br />\nCompany. \"The Selection\" is stunned, and it is pained.<br />\ntheir first piece and it is<br />\nunremitting in its ravishment and<br />\nprovocation of the human<br />\nWhen Lieberman finally stops<br />\ngalloping around the stage, he<br />\nconscience.<br />\nWork was begun on \"The sucks in the audience's stares and<br />\nSelection\" in April of 1976 as a we suck in his stare, and he asks,<br />\nreaction to the concentration in a sing-song, in a cackling<br />\ncamp butchery of World War II. German accent, \"Auschwitz?<br />\nBenenson and Lieberman explain Have you ever heard of<br />\nthat the piece is not intended to Auschwitz?\" And then he<br />\nillustrate the sadistic brutality of 'gallops, but the stage, like the<br />\nthe German camps, rather it is planet, is circular; there are no<br />\ntheir personal reaction to the exits, no escapes. The voice is<br />\nnightmare.<br />\nITTOst Painful. It is haunting.<br />\nSelection\"<br />\nis<br />\na<br />\nAnd finally, his whole body.<br />\nsuccessful<br />\n\"The<br />\nattack. There is no escape from attacks. Lieberman cringes in a<br />\n<br />\nBut the play lacked that<br />\nexpert direction'. Stan<br />\nWojewodski, Jr., who employed<br />\nsome very subtle effects in the<br />\nhighly successful She Stoops to<br />\nConquer, seems to go somewhat<br />\noverboard here, a direction one<br />\ncould 'see surfacing in Red Ryder.<br />\nOne of the most dramatic,<br />\nnoments in the play centers<br />\ntround a blood-stained Julian,<br />\nwho has just returned from a<br />\nfight. It is downright humorous<br />\nwhen Julian comes bouncing in,<br />\nnearly as energetic as the first<br />\ntime we meet him, but this time<br />\nwith the addition of about<br />\ntwenty-seven bloodied knife<br />\nwounds and several gashes across<br />\n.his face. The set, instead of being<br />\n<br />\n,<br />\ncorner and slowly, painfully',<br />\nremoves his absurd clothing. His<br />\nuniform is absurd as the uniform<br />\nof the concentration camp<br />\nprisoner, and the S.S. guard, and<br />\nall uniforms, are absurd. The<br />\nNazi craving for uniformity is<br />\nreduced to its senselesS'absurdity.<br />\nIt is clear that he is a dancer; a<br />\nmost of sculpted flesh. and<br />\nmuscle. The actor cringes, as if he<br />\nashamed„ of his body. He is<br />\nashamed of the body; the selfish<br />\nshell that smothers the soul. He<br />\nmakes me feel ashamed of the<br />\nbody.<br />\nWhen I am naked, I am at the<br />\nlowest Point of human<br />\ndegradation. I lie on the floor, a<br />\nlump of human\" being. Like a<br />\npiece of discarded clothing,<br />\ncompletely broken...<br />\nLieberman describes. In the end,<br />\nhis body is exhausted, \"insensible<br />\nto the seasons.\"<br />\nThe actor climbs the ladder<br />\nand beseeches God in Hebrew, in<br />\n'Yiddish , in German, and in<br />\nEnglish. He cries out poetry and<br />\nsongs; fragments of images and<br />\nphilosophy spew forth. He cries<br />\nto the God of all mankind, the<br />\nGod who is too often deaf to the<br />\n<br />\ndilapidated, appears to be a cave.<br />\nIn a black comedy this might be<br />\napproptiate, but it seems out of<br />\nplace here. The backdrop is as<br />\ntacky and distracting as it was in<br />\nRed Ryder, and the actors are<br />\nasked to perform some incredibly<br />\nstereotyped movements that I'm<br />\ncertain \"experienced\" actors are<br />\nfar beyond.<br />\nFascinating<br />\nIf you can see through the<br />\nlmateurish aspects of this<br />\nproduction, there is an excellent<br />\nplay underneath [with some very<br />\ngond acting], full of fascinating<br />\nr. velations concerning<br />\nrelationships and the human<br />\n<br />\nsupplications of the Jewish<br />\npeople. Then he stops. God<br />\ncannot hear his cries.<br />\nHe whispers, \"Shema Yisroel,<br />\nAdonai Elohanu, Adonai Echad.\"<br />\nThe actor, clad only in his<br />\nunderwear, looks up from the<br />\ntop rung of the ladder and asks,<br />\n\"How do you sit so quietly?\" He<br />\nis not talking to God now, he is<br />\ntalking to mankind. And<br />\nsuddenly, the audience must<br />\nrealize, that he is talking to<br />\nthem. The attack is a success.<br />\nThe audience is shamed, it is<br />\nstunned, and it is pained.i<br />\nThe Theatre Project is a<br />\nperforming arts<br />\n'community<br />\ncenter, offering free weekly<br />\nperformances by touring<br />\ncompanies in theatre, dance and<br />\nmusic, as well as community<br />\n'.:lasses and workshops.<br />\nPerformances are free and if<br />\nyou'd like to help keep it that<br />\nway, please donate after the<br />\nshow.<br />\nPerformances of \"The<br />\nSelection\" will be shown this<br />\nweekend on Friday at 8:00 and<br />\n10:00 p.m., on Saturday at 8:00<br />\nand 10:00 p.m., and on Sunday<br />\nat 8:00 p.m.<br />\n<br />\n\fpage 6/news-letter/fehruary 18, 1977<br />\n<br />\nJoachim bluncn_<br />\n<br />\nThe following is a transcript of an interview with the<br />\ndistinguished Georgia poet James Duckey, who<br />\nformerly held a chair in poetry at the University of<br />\nSouth Carolina. The interview was conducted by<br />\n\"Tomorrow\" show host Tom Unguent .<br />\nTom:<br />\nProfessor Duckey, you've been called the poet<br />\nlaureate of the new Caner administration. Do you<br />\naccept that title?<br />\nDuckey: Call me Jam, Tom. Please do. Yeah,<br />\nAh've known Jemmy Kotter one hail of a long tom<br />\nbut ah ain's show he have a lariat. Now ole Lendon<br />\nJawnson he had himsef a lariat but thet came with<br />\nbein' a Texan, ya know.<br />\nTom: HAH HAH HAH HAH But let me ask you<br />\nthis, sir. Your services have been in great demand<br />\nlately as an interpreter of the Southern experience,<br />\nas someone who understands the South, isn't that<br />\nright?<br />\nDuckey: Tom, ah don't have to 'tend to unstan'<br />\nthe South. Ah am the South.<br />\nTom: I once worked in Savannah at a 500-watt<br />\nradio , station and I confess I came to like fried<br />\nchicken.<br />\nDuckey: That's dayum big of you, Tom.<br />\nTom: But no the kind of fried chicken they sell<br />\nup North.<br />\nDuckey: Cose not. It ain't the real thang.<br />\nTom: What is the real thing?<br />\nDuckey: Ali lived in Etlanna long nuf to know<br />\nthat Co-Cola is the real thang. Tom, ah thank ef you<br />\n- penned me down ali'd prolly say the greatest Suthun<br />\nconchabutions to whir-uld culchuh is fried chicken<br />\nand Co-Cola. But they is more conchabutions<br />\nbesides that even. They is my novels and my<br />\npoultry, they is the Marshall Tucker Band and<br />\nCharlie Daniels, they is the cullud music rum<br />\nNarlinz...<br />\nTom: Let's not forget ham and red gravy. I really<br />\nlike that.<br />\nDuckey: Red-eye gravy. Yes, that's damn good of<br />\nyou,Tom, to minchun it.<br />\nTom: I never liked okra, though.<br />\nDuckey: You'll learn to lahk it. See, we Suthruns<br />\nis in what you might call the ascendancy rat now.<br />\nTom:. And I can't stand hog maws, collards. and<br />\nblackeye peas.<br />\nDuckey: Now ali'm wif ya they-uh. Thet's mosely<br />\nwhin cullud folks eat, idinit?<br />\nToni: We could talk about the delightful Southern<br />\ncuisine all night. Jim, but let's get on, to your poetry.<br />\nFirst of all, what is your definition of poetry?<br />\nDuckey: Don't have none. But Ah lahk whin<br />\nNashville poet John R. Sryg,ley once said bout<br />\npoultry. He said poultry is the elusive gift of clarity<br />\nfrom the gods.<br />\nTom: Does poetry have to rhyme, Jim? A lot of<br />\nour viewers might be concerned because your own<br />\npoetry - I should say the little I've read of it - I mean<br />\nit didn't have any rhyme scheme. you know?<br />\nDuckey: No. Tom, poultry don't hafta rahm. It's<br />\n<br />\nJames Duckey:<br />\nThe poet lariat<br />\nof the Kotter<br />\nAdministration<br />\njust gotta be profoundly insahtful. Tilers whut<br />\nmakes it poultry in the fust place. It's the quality of<br />\nthe insaht en the unique way it's exprayussed.<br />\nTom: Speaking of expression, Jim, I have to say<br />\nthat people from other parts of the country often<br />\nhave trouble taking Southerners seriously because of<br />\ntheir - well, to use your own words, their unique<br />\nquality of expression. Do you follow me?<br />\nDuckey: Assolutely, Torn. You mean Yankees<br />\nthank we stupid cose we all sound lahk kickuhs,<br />\neven ef we is Ph. D.'s.<br />\nTom: Yes, Jim, that's exactly what I.meant.<br />\nDuckey: It don't bother ine.<br />\nTorn: Well, that's good, Jim. I just wanted to get<br />\nthat out of the way so we could go on to your<br />\nfamous inaugural poem. I especially wanted you to<br />\nshare it with those of us who were unable to attend<br />\nthe inaugural gala.<br />\nDuckey: Be glad to. Goes sumfin lahk this...<br />\nNote: The following poem was written by Professor<br />\nDuckey for the inaugural of President Carter.<br />\nThe Strength of Tissue<br />\nBy James Duckey<br />\nForce-feed a small town always does.<br />\nGiven the goose.<br />\nWhat field-force can be,<br />\nMagnetizing the small civic lynchings over<br />\nA cross burning near home?<br />\nMen smile not like he does<br />\nTransfigured now, but we are around him around<br />\nhim -like the strength of solid blocs. The starry flag<br />\nfloats on<br />\nAbove him in office - Tell me, transition- voice,<br />\nWith all your inside dope,<br />\nwhat I can have<br />\nDear Lord of all the flies<br />\nwhat can you do for me?<br />\nTV-lights, image and orthicon, quiet and all-present<br />\nIn the homes of Men, tell me how to do it how<br />\nto campaign how to influence and win the source<br />\nOf the power he now has<br />\nlong as a month, and rising<br />\nWith the level of our expectations<br />\nAll us folks around, the hope of sleeping men<br />\nYou? I? What does it matter now? We have all be, a<br />\n<br />\nsaved<br />\nby a secret ballot. Now as I pack my knife<br />\nand you roam with me we know hunger<br />\nis close to the source of jobless men<br />\nSearching streets for fields of green<br />\nWe know the end is in sight we know we will be<br />\ncaught<br />\nTell me, freight- train,<br />\nnow that no one else is listening,<br />\nWhat did Thomas Wolfe see in you?<br />\nHunger, time, and the river:<br />\nI should have known<br />\nthe phrase lying on the brain<br />\nas in a pool of stagnant water as on a plate of grits<br />\nLord, let me shake off the past<br />\nWild words can always leap<br />\nFrom faded strength Everything comes down to<br />\nthat.<br />\nWords and nothing but grants. More honors, Jimmy<br />\nOf the renewing green. That is where we'd like you<br />\nto start:<br />\nWith important things. More kindness to us poets<br />\nwill do nothing less than save<br />\nevery no-counter<br />\nword-juggling<br />\nhand-biting<br />\nnight-crawling one of its<br />\nMy life depends on the word. I will take, what I<br />\ncan get.<br />\n(After the inaugural poem is read aloud, Toni<br />\nUnguent resumes his interview.)<br />\nTom: That was just beautiful, Jim. It certainly did<br />\nnot lack clarity. I think the President and all the<br />\nnation got the message loud and clear.<br />\nDuckey: Thank you, Tom.<br />\nTom: Now you are a novelist as well as a poet.<br />\nAre. you 'working on another novel at this time?<br />\nDuckey: Yes ah am. Mali fust novel was a great<br />\nsuck -sayiss and twined into a inajuli motion<br />\npick-shuli wif Butt Rinnalls. Ali hope the next one<br />\ntunns out as good. It.s called Redemption and it's<br />\nabout five middle-aged white Etlanna businessmen<br />\nwho feel the honor of their race has been hutt by<br />\nthe revelations of Alex Haley's book. So whut they<br />\ndo is challenge an enner-city' black high school<br />\nbasketball team to a game.<br />\nToni: What an interesting premise for a novel!<br />\nCan you tell us how it turns out?<br />\nDuckey: Ah cain't keep any secrets fum you,<br />\nTom. Three of the five die of massive hot attacks rat<br />\nthey-uh on the coat. Whut happens to the othuh two<br />\nis the suhproz inding.<br />\nToni: TBest of luck with the book, Jim. It's really<br />\nbeen a pleasure having you on the show. I'm only<br />\nsorry NBC was too cheap to hire an interpreter.<br />\nHAH HAH HAH Good night, and have a good<br />\ntomorrow.<br />\n<br />\n\ffebruary 18, 1977/news-letter/page 7<br />\n,<br />\n'•.\"4'.-0<br />\n'•WW..<br />\n•<br />\n. 4'W\"4W•'•411\".\".\"*\".\"•'•'<br />\n. ••-VWV***'•'•'•\"*\"<br />\n'<br />\nI<br />\n4<br />\nI<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br />\nI<br />\n4<br />\n4<br />\nI<br />\n4<br />\nI<br />\n4<br />\n4<br />\nI<br />\n4<br />\n.<br />\n4<br />\nI<br />\n4<br />\n4.<br />\nI<br />\n4<br />\n4<br />\n.<br />\nI<br />\n4<br />\n<br />\nPOETRY READING<br />\n<br />\nROBERT PENN WARREN<br />\n<br />\no<br />\n<br />\nWEDNESDAY, FEBRUARY 23 at 4:00 P.M.<br />\n<br />\n1<br />\nI<br />\nI<br />\n<br />\nl4<br />\n44<br />\n4<br />\n:4<br />\n<br />\n4<br />\nGarrett Room, Milton S. Eisenhower Library<br />\n<br />\no<br />\n1<br />\n<br />\n4<br />\n4<br />\n1<br />\n4<br />\n1<br />\n<br />\nThe Johns Hopkins University, Homewood Campus.lt<br />\n1<br />\n4<br />\n1<br />\n4<br />\n1<br />\n1<br />\n4.<br />\n4<br />\n<br />\no<br />\n1<br />\n<br />\n44<br />\n1.4<br />\nSponsored by the Department of English,<br />\nHumanities Center and the Writing Seminars<br />\n<br />\n1<br />\n<br />\n4<br />\n<br />\n4<br />\n4<br />\n1<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br />\n<br />\nOpen to the public without charge<br />\n<br />\n0.41.4046..410%<br />\n<br />\n4<br />\n4<br />\n4<br />\noft<br />\n<br />\nCommemoration Day.<br />\nExercises<br />\nin celebration of<br />\nthe One Hundred First<br />\nAnniversary of the<br />\nFounding of<br />\nThe Johns Hopkins<br />\nUniversity<br />\nTuesday February 22 3PM<br />\nShriver Hall Auditorium<br />\nHomewood Campus<br />\n<br />\n4<br />\n<br />\n44<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br />\n<br />\nL<br />\n<br />\nAll students are cordially<br />\ninvited to attend<br />\n<br />\nAddress by<br />\nRobert Penn Warren<br />\nNovelist<br />\nPoet<br />\n<br />\n..............<br />\n<br />\n0:00:STA<br />\n<br />\nig<br />\n<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•••<br />\n•<br />\n•<br />\n•<br />\n•<br />\n••<br />\n•<br />\n•<br />\n•<br />\n•<br />\n••<br />\n•<br />\n•<br />\n<br />\nA GOOD WAY<br />\nTO SPEND<br />\nA WEEKEND<br />\n<br />\n•<br />\n<br />\na<br />\n<br />\nProduced By: The U.S.—China People's Friendship Association, the JHU Women's Center,<br />\nthe Office of the Chaplain, the JHU Organization Against World<br />\nHunger, and the JHU Social<br />\nCommittee<br />\n<br />\n•<br />\n<br />\nLITTLE FLAGS THEATRE COLLECTIVE<br />\nBOSTON, MASSACHUSETTS<br />\n•<br />\n<br />\nPre5ents<br />\n<br />\nFANHEN<br />\nWritten by David Hare,<br />\n<br />\nAttention: College Students<br />\n<br />\nDireci-Exi by Maxine, kle,r<br />\n<br />\nA LIVING- PLAY ABOUT<br />\nTHE CHINESE REVOLUTION<br />\n41<br />\n\"<br />\n.<br />\n<br />\nCOME TO A SHABBATON.<br />\n<br />\nii<br />\n<br />\nFeb. 25-26 at Shaarei Zion<br />\n<br />\n$12 includes:<br />\nCatered meals<br />\nHousing<br />\nSpeakers On Feminism, the Holocaust<br />\nIsrael, & Anti-Semitism<br />\nEncounter Groups<br />\nSat. Nite Theatre Tickets<br />\nAnd A Midnight Concert<br />\n<br />\n•<br />\n<br />\n-g<br />\n<br />\n(SI<br />\n<br />\n-g<br />\n<br />\nAll<br />\n• mar<br />\n<br />\nFor More Information and Reservations<br />\nCall Seth at 542-4900 ext.137<br />\n<br />\n1.1<br />\n<br />\n1111 1111(1 ii.<br />\n'.i,IT)HI<br />\n<br />\npthri..1 O..<br />\nII.nr. I<br />\n.<br />\nt't 101 1,1 .1N1111,<br />\n<br />\n\"Im”,1kAnApOilni.“IntrInx<br />\n<br />\ntickets available at.<br />\nSunday,Feb.20, 1977,7:30 pm<br />\n_UNION DESK<br />\nShriver Hall Johns Hopkins U. JOHNS HOPKINS UNIVERSITY<br />\nADMISSION $2.00<br />\n<br />\n_31st STREET BOOKSTORE<br />\n31st ST. AT GREENMOUNT AVE<br />\n<br />\n\f1<br />\n<br />\nNEWS-LETTER Tail-Gunner Joe' needed more<br />\nvol. lxxxi, no. 33/friday, february 18, 1977/81st year<br />\neditor-in-chief<br />\nbusiness managers<br />\nmanaging editor<br />\nfeatures editor<br />\nsports editor<br />\ngraphics editor<br />\nphoto-production manager<br />\n<br />\nEric Garland<br />\nVanessa Evan,Carole Jaffe<br />\nDavid Hawk<br />\nJ D Considine<br />\nDavid Kraus<br />\nScott Marks<br />\nJennifer Bishop<br />\n<br />\nThe Jonns Hopkins News-Letter is published twice weekly, Tuesday<br />\narm<br />\nFriday, during the academic year. It is printed at Frank White's<br />\nvery own<br />\nCentaur Press out in Westminster. Editorial and business correspo<br />\nndence should<br />\nbe directed to Box 1230, The Johns Hopkins University,<br />\nBaltimore, Md.<br />\n21218. Telephone (3010) 338-7647. Business hours are<br />\nMonday and Thursday<br />\nafternoons. Hey hey hey,<br />\nDNA..<br />\n<br />\nhustle<br />\nLast week's conviction of Larry Flynt in a Columbus,<br />\nOhio court is another sign of the troubles the Suprem<br />\ne<br />\nCourt invited with its ruling on obscenity a few years<br />\nago.<br />\nFlynt was sentenced to seven to twenty-five years and fined<br />\n$1,000 for his actions as publisher of Hustler that led to the<br />\nmagazine finding its way into the hands of decent<br />\nColumbus citizens.<br />\nNow Hustler may have no more socially redeeming<br />\nfeatures than, say, the News-American, but the conviction<br />\nraises two disturbing points beyond the question of<br />\nobscenity. First, one of the charges against Flynt was<br />\nengaging in criminal conspiracy -- as publisher, he was<br />\nresponsible for the magazine's distribution -- and thus could<br />\nbe dragged into court from anywhere in the country. The<br />\nthreat of prosecuting any employee involved in<br />\na<br />\nnationally-distributed media offering (as happened<br />\nin<br />\nGeorgia with a bit .actor in Deep Throat) for the<br />\nlocal<br />\ncriminal activity is ludicrous, to say thc least.<br />\nThis goes along with the second problem, namely that<br />\nthe Supreme Court's decision to leave obscenity<br />\nto<br />\n\"community\" standards opened the door for<br />\nnarrow-minded case-hungry District Attorneys to haul in<br />\ntheir favorite objectionable person. Since community<br />\nstandards are just about whatqer the local DA decides<br />\nthem to be, the First Amendment is in for serious trouble<br />\nin<br />\nmany areas of the country.<br />\n<br />\nletters to the editor<br />\nTo the Editor:<br />\nI am writing in response to an<br />\nad placed in the Friday edition of<br />\nthe Johns Hopkins University<br />\nNews-Letter. I found this ad to<br />\nbe in extremely bad taste and<br />\noffensively sexist. If this<br />\nrepresents the attitude of the<br />\nBETA crowd perhaps it is best<br />\nthat they stay wherever they are<br />\nnow. I know that in the name of<br />\n\"freedom of the press\" we tend<br />\nto print anything requested,<br />\nhowever. I would hope that as<br />\nwomen in responsible positions<br />\n(and you do have such positions)<br />\nyou would lend some support to<br />\nelimination of sexist<br />\nadvertising by refusing such an<br />\nad.<br />\nI hope that in the future you<br />\nwill be a little more sensitive to<br />\nthat portion of your readers who<br />\naren't particularly interested in<br />\nhaving their bodies used as bait<br />\nfor encouraging others to have a<br />\ngood time.<br />\nLorinda Riddle<br />\nAdministrative Assist.<br />\nOffice of the Chaplain<br />\n<br />\nTo the Editorr:<br />\nThe February 11th printing of<br />\nthe News-Letter contained an<br />\nadvertisement for the \"Betas'<br />\nCome Back Ball.\" It is unclear<br />\nwhere they were corning back<br />\nfrom, my guess would be a<br />\ngigantic ego trip. This crude<br />\ndisplay of unaesthetic body<br />\nportrayal proved a mockery of<br />\nfemale existence. The News-letter<br />\ntotally disregarded the insult that<br />\nthis ad paid its female reader.<br />\nThe intent of the advertisement<br />\nmay have been to communicate a<br />\nparty of some sort but instead of<br />\nadvertising the uplift of spirits it<br />\ncapitalized on the uplift of the<br />\nfemale breast. Until women and<br />\nother minorities are treated With<br />\nthe respect they are deserving of<br />\nour society will not move<br />\nforward.<br />\nNancy McLernon<br />\nSchool of Public Health<br />\nTo the Editor:,<br />\nHow's this for a letter?<br />\nEgg Roll Norton<br />\n<br />\nBy STEPHEN SMITH<br />\n\"Tail-Gunner Joe,\" the recent<br />\ntelevision film, was a<br />\nmuch-needed introduction to, or<br />\nreminder of, the anti-Communist<br />\nhysteria that was at large in this<br />\ncountry in the early Cold War<br />\nperiod. The film addressed itself<br />\nto the question: Why wasn't<br />\nMcCarthy stopped? In answering<br />\nthat question, though, the film<br />\nemphasized peripheral points,<br />\nand ultimately offered them as a<br />\nreal explanation, and did not ask<br />\nthe broader, related, and more<br />\nimportant question of why the<br />\nentire national<br />\nEstablishment---government,<br />\nbusiness, education,<br />\netc.---undertook or at least<br />\ntolerated an anti-Communist<br />\ncrusade at that point in history.<br />\nThis film had much to<br />\nrecommend it. First, while<br />\n\"McCarthyism\" has become part<br />\nof our political vocabulary, far<br />\ntoo few people have more than a<br />\nvague idea of what it means, or<br />\nof how the word originated. This<br />\nfilm will help to correct that. It<br />\ngave several concrete examples of<br />\nlives ruined by McCarthy's<br />\ninvestigations and by the climate<br />\nsurrounding those investigations.<br />\nThe film suggested McCarthy's<br />\nmotivations and the source of his<br />\ninfluence by showing his<br />\nconnections with certain<br />\nbusinesses, with the Catholic<br />\nChurch, and with crypto-Fascist<br />\nelements in this country. The<br />\nmakers of this film did not duck<br />\ntouchy issues, such as how<br />\nMcCarthy was tolerated by two<br />\nPresidents of the United States,<br />\nand how he was greatly<br />\npublicized by an uncritical press.<br />\nIn \"Tail-Gunner Joe,\" though,<br />\nit almost appears as if McCarthy<br />\nwere alone in this crusade. One<br />\nwonders not why he wasn't<br />\nstopped, but how he ever got<br />\nstarted. The impression is given<br />\nthat every respectable person<br />\ndisapproved of McCarthy, though<br />\nthey may have lacked the<br />\ncourage to attack him: Truman,<br />\nEisenhower, and McCarthy's<br />\nfellow Senators. McCarthy, in<br />\nthis film, was a pathetic<br />\n<br />\nMacNelly<br />\n<br />\nfigure—none too bright,<br />\nalcoholic, unprincipled, corrupt,<br />\nand paranoid—and it is hard to<br />\nunderstand why any respectable<br />\nperson would support him.<br />\nThe blame for McCarthy's<br />\npower is implicitly placed, in an<br />\nearly scene, on the<br />\nsimple-minded citizens of<br />\nWisconsin, who chose him for the<br />\nSertate over an \"egg-headed<br />\nprofessor.\" The professors of our<br />\nnation apparently saw the danger<br />\nof McCarthy, as did the rich<br />\nlawyers (Welch) and the<br />\naristocratic Senators (Margaret<br />\nChase Smith.) One is left to think<br />\nthat despite this, McCarthy was<br />\nvery powerful.<br />\n<br />\nActually, Joe McCarthy was<br />\ntolerated, if not supported, by<br />\nthe Establishment in the United<br />\nStates. The film showed that he<br />\nwas friend and ally of Richard<br />\nNixon, the Kennedy family, and<br />\nthe Vice President of<br />\nGeorgetown University, among<br />\nothers. More indicative of the<br />\nbreadth of his support is that the<br />\nSenate, in 1953, gave him the<br />\nauthority and the money that he,<br />\nneeded to conduct his<br />\nwitch-hunts. It is important to<br />\nnote that the \"good guys\" in this<br />\nfilm were those who rationally<br />\nand deliberately attacked<br />\nCommunism, at home and<br />\nabroad, as opposed to those who,<br />\nlike McCarthy, attacked it<br />\nirrationally and over-zealously.<br />\n<br />\nThe former are exemplified by<br />\nthe Voice of America, the State<br />\nDepartment, the Army,, and<br />\nespecially' Messrs. Truman,<br />\nAcheson, and Marshall.<br />\n\"Tail-Gunner Joe\" implied that<br />\n\"rational\" anti-Communism was<br />\nthe opposite of McCarthyism.<br />\nActually, while the approaches<br />\nwere different, both were aimed<br />\nat similar goals and driven by<br />\nsimilar spirits.<br />\nThe film practically ignores<br />\nconcrete examples of \"rational\"<br />\nanti -Communism. The<br />\nEstablishment, led by Truman,<br />\net. al., backed Chiang Kai-shek<br />\nfrom 1945 to 1949 with the<br />\nlargest outlay of funds and<br />\nweapons for a foreign nation ever<br />\nmade in U.S. history. These men<br />\nengineered the Marshall Plan<br />\nwhich European labor unions<br />\nattacked as an anti-labor plan,<br />\nand Truman set up the Loyalty<br />\nReview Boards in this country<br />\nthat had as devestating an effect<br />\non dissent as did McCarthy's<br />\ninvestigations. \"Tail-Gunner Joe\"<br />\nhad little to say about this; it<br />\nmentioned the Loyalty Boards,<br />\nbut did not explain them to<br />\nthose (probably most) viewers<br />\nwho did not know what they<br />\nwere.<br />\nNeither did the film mention<br />\nthe history of \"respectable\"<br />\nanti-Communist repression in our<br />\nhistory—e.g.\" Haymarket Square,<br />\nthe Mitchell Palmer raids, the<br />\nimprisonment of Eugene Debs, or<br />\nthe executions of Sacco and<br />\nVanzetti. Anti-Communism was<br />\nthe cornerstone of both foreign<br />\nand domestic policy in the U.S.<br />\nin the post-World-War-II era, and<br />\nthese policies were in a tradition<br />\nof imperialism and repression<br />\nhanded down by generations of ,<br />\n\"respectable\" men who ruled<br />\nAmerica.<br />\n\"The McCarthy Era\" was an<br />\nextraordinery time, but it, was<br />\nalso part of that tradition.<br />\n\"Tail-Gunner Joe,\" by treating<br />\nboth McCarthy and McCarthyism<br />\nas aberrations, did not help us, as<br />\nmuch as it might have, to<br />\nunderstand the meaning of that<br />\nperiod.<br />\n<br />\n\fInjun Joe<br />\nversus<br />\n<br />\nThe saga of• the Magic Bus: Ridin'the Greyhound trails<br />\nBy RUSS SMITH<br />\n\"The Greyhound Ameripass offers you something no other kind of mass<br />\ntransportation can. No matter how inexpensive. Freedom and safety.\" --Greyhound<br />\npromo<br />\nI may be a first-rate sucker, but when I paid $139 for a special Christmas Ameripass<br />\nin_Denver last December, I had no reason to doubt the legitimacy'of the above blurb.<br />\nAnd for several days, from Denver to Cheyenne, Reno to San Francisco, I encountered<br />\nno real problems,just the usual sleeping discomfort and on the road boredom.<br />\nI had no idea.<br />\nMy troubles began in downtown Los Angeles, hours after I pulled into the<br />\nGreyhound station from Westwood, fresh from the premiere of \"A Star is Born.\" Worn<br />\ndown from twoweeks of travel, I'm burned out and lost, and can't stop talking.to<br />\nmyself. Greyhound jangle. My destination is Santa Fe, New Mexico, so I've got a few<br />\nhours to kill before takeoff, a few hours to spend in downtown L.A., an area which<br />\nseems like one continual bus station, the bum's bum locale. Spanish markets own the<br />\nstreets, where fresh and not so fresh meat and produce are sold, where open bars<br />\nalternate with tropical fruit juice stands. Poor folks are tromping in and out of the<br />\nmarkets, flashing nary a smile to the luckless pedestrians.<br />\nSoon I board Greyhound 731, head for the back three rows where smoking is<br />\npermitted, toss my pack on the seat next to me to discourage anyone from sitting there,<br />\nand settle down with the final edition of the Los Angeles Times. My eyes dart up to the<br />\nfront of the bus where a whole herd of passengers are getting on, and I realize my<br />\nchances for the extra seat are slim. The last person on the bus snags the seat in question,<br />\nand immediately pulls out the biggest walking radio you'd ever want to see, plays it real<br />\nloud. The smc king section is filled with young people ready to party down, everyone<br />\nlookin' for a sood time.<br />\nAnd so the Magic Bus takes off.<br />\nThe cast'of characters went like this:<br />\nAlbert—A nineteen year old geek from New York City who's rich off his old man's<br />\nchain of Supermarkets. Albert bragged on and on about the \"piece\" he carried with him,<br />\nabout the marijuana he smoked, the scotch he drank, and \"the fine tail\" he messed<br />\naround with in New York. Albert wasn't too much.<br />\ngypsy—A young woman in her late teens, Gypsy's a self-proclaimed hooker with a<br />\ntaste for weed, booze and strange men. Speaks in a white trash Albuquerque drawl while<br />\nmoving from seat to seat. An hour out of L.A., Gypsy had already made plans for a<br />\nMagic Bus orgy.<br />\nT.0—My original seatmate. A stud from Kansas City, heading to New York on a<br />\nsmack junket. Easy going, dripping with the \"we're all brothers\" jazz, but a likeable<br />\nsort.<br />\nhiul—(aka Injun Joe) A mean Mexican Indian, just two days out of a California<br />\nprison cell. A design of scabs and scars highlight his face.<br />\nClyde, Robert, Caesar and Taylor—Four young men all going to New York,fully into<br />\nthe party atmosphere,,a friendly bunch. When sober.<br />\nThrow in a creative Writing teacher from Stanford and an elderly chain smoking lady<br />\nand you've got the makings of a Magic Bus.<br />\nSo we're riding along, I'm trying to read the paper, while everyone else, save the<br />\nteacher and the old lady, are partying hard, passing beers, smoking joints in the crapper,<br />\nPlaying the static loud, getting together with some poker and handshakes all around.<br />\nYes, everyone was getting along jest fine.<br />\nGypsy was making the rounds, checking out each of the honchos, finally settling on .<br />\nT.C. and then sprawling on his lap, leaving me about half my seat. \"Listen turkey,<br />\nYou're gonna switch seats with me at the next stop so me and T.C. can spread out,<br />\nunderstand?\" Gypsy informs me with a bitchy leer. \"C'mon,\" I said, \"that's bUllshit,<br />\nI'm staying right here and y'all can move.\" Well, she didn't buy that, and started<br />\nPestering me no end, so I agreed to switch seats. She was pleased and promised to \"turn<br />\nme on to a beer.\" Hey, a real beer, I thought, and took a quick glance at the bottle of<br />\ntequila stashed in my coat.<br />\nI settle into my new lodgings, meet Paul, who yells back to Gypsy,\"Who's this jerk?\"<br />\nGypsy explains the situation and promises that he won't have to put up with me for too<br />\nlong. Greyhound, see America, I keep thinking.<br />\nAt the next stop, the partyers chipped in to buy about a dozen pints of Southern<br />\nComfort, bourbon, and cognac. Still brothers and sisters on this long ride together, they<br />\nswilled the cheap booze with gusto. Meanwhile, Paul tells me his prison story and then<br />\ntries to pawn off his watch, bracelet, toothbrush, anything to make a quick buck. I tell<br />\nhim if I had any money I wouldn't be traveling by Greyhound. He can't argue with that.<br />\nPaul's socking away the bourbon and beer, and spies my tequila, which leads him to<br />\nan immediate announcement: \"Hey, my cowboy friend has some tequila and he's gonna<br />\nshare it with everybody, right Jesse?\" I get a big cheer and then tell Paul no way. We<br />\nweren't too close after that, but I figured it'd still be cool.<br />\nMaybe an hour late- Paul spills some beer on his seat, looks around for something to<br />\n<br />\nwipe it up, and settles on the sweater resting on my shoulders. \"Hey, wait a minute<br />\nfriend, don't use my sweater,\" I protest. He yanks it back from me and says \"You do<br />\nwhat I say, motherfucker, or I'll kill you.\" I weakly replied, \"Hey, look, the sweater's<br />\nyours man, need anything else?\"<br />\nMeanwhile, things aren't going to well with the other celebrants. Albert's been<br />\ndismissed as a worthless clod, a few of the gang are puking up the cognac, and Gypsy's<br />\nwitchy laughs have turned into shrieks. She sets fire to Albert's Greyhound pillow,<br />\nAlbert complains, only to be bawled out by Gypsy's fire water lips. T.C. tells her to be<br />\ncool<br />\nThe bus driver rolls on.<br />\nNow, one of Paul's weaknesses was for little children, and right across from us were<br />\ntwo kiddies, marshalled by a terrified young woman who's trying to shake the Indian's<br />\nadvances. But she was especially upset by the language in the back, so Paul yells to the<br />\ncelebrants, \"All right, you motherfuckers, there's kids up here, so keep it decent.\" Well,<br />\nafter several of these admonishments, T.C., who's by now totally in his cups, decides<br />\nhe's had enough of this self-righteous Indian. He walks up to Paul, starts screaming like a<br />\nmadman, \"Who the hell do you think you are, motherfucker, telling me what to do<br />\nafter I've bought you whiskey and beer. All that brother jive, now you gonna shut up.\"<br />\nPaul sits down, tries to ignore the whole thing, but T.C. leaps on top of him, throwing<br />\nme against the window and my glasses to the front of the bus. I've got one hell of an<br />\nadrenalin buzz going at this point. They're scuffling for a few minutes, Robert and<br />\nTaylor have joined in, and then surprise, the bus driver pulls over to the side of the road.<br />\nT.C. hisses to Paul,\"I gotta gun cocksucker, and I'm gonna shoot your fuckin' head off,<br />\ndon't care if I do go to jail.\" I'm thinking hey this is great, guy's gotta gun, probably<br />\ntake a few others along with Paul.<br />\nBus driver comes back, gives a basic pep talk about behaving ourselves, and we're<br />\nriding again.<br />\nI'm scared silly now, getting ready to check out. Paul's muttering next to me, and<br />\nslowly draws out of his pocket a ten-inch knife decorated with the etching of a saint.<br />\n\"I'm gonna slice that nigger's throat to ribbons once we get to Phoenix, and I ain't<br />\ngonna get caught,\" Injun Joe rattles on. Terrific, I think, and sit up straight in my seat,<br />\nchain smoking, not letting my eyes close for a minute. Paul starts dozing, his head<br />\nlanding on my right shoulder. Now that's a move I wouldn't normally go for, but hey.<br />\nPaul,and I are pardners.<br />\nPanic in Arizona<br />\nThings had been quiet for about a half hour when Gypsy, decided that she and T.C.<br />\nweren't getting along anymore. She's more drunk than anyone, having thrown down<br />\nthree pints of Southern Comfort and one of cognac, and starts yelling at T.C., telling<br />\nhim what a dirty pimp he is, rotten lover, the whole works. Well, T.C., fresh from his<br />\nbout with Paul, was having none of this, and starts slapping Gypsy around, while she<br />\nscreams for,the whole bus and highway to hear. ,<br />\nBus driver lolls on.<br />\nGypsy escapes from T.C., tears up and down the bus aisle, punching anyone she can<br />\nsee in her drunken delerium--my fifth and sixth'head bruises came from this tirade--just<br />\npissing and moaning, finally arriving at the fateful words; \"You're all just a bunch of<br />\nslimy niggers, and I hate niggers!\"<br />\nThat wasn't the wisest move on Gypsy's part. Immediately, a half dozen sets of ears<br />\nperk up and Gypsy's trapped in a rumble, getting the stuffing kicked out of her, hair<br />\npulled this way and that, fingernails dug in black and white flesh. After pleas from<br />\npetrified passengers who are seeing a, disaster inpvie right before their,eyes, the bus<br />\ndriver pulls over again. Paul's awake with kniie-iti hand, T.C.'s reaching for his pistol,<br />\nand I'm clutching the rosaries in my pocket. We're stopped at the Arizona border where<br />\na sheriff comes aboard and drags off Gypsy to the local jail. After an hour, we're riding<br />\nagain, the whole bus in terror.<br />\nIt's now early in the morning and we're scheduled to make Phoenix in five hours,<br />\nPaul's last stop. So I've got hundreds of miles ahead of me, trying to get my mind off<br />\nthis predicament, but I can't, I'm just thinking about getting off the Magic Bus alive. I'm<br />\ncounting the miles on the dark highway, counting the miles, fully expecting the trip to<br />\nend in disaster.<br />\nBut oddly enough, we did get to Phoenix. I figure I'm a free man, at least if Paul<br />\nwould wake up. Ten minutes later, to my enormous relief, I see him in the station with<br />\nsuitcase in hand, so I know the ordeal is pretty much over. I saunter over to him and<br />\nglibly remark, \"Well, good luck, Paul, sure was nice to ride with you.\" \"Great,cowboy,<br />\nsure ya don't want to stop off in Phoenix with me for a couple days, I'll show you the<br />\ngood spots.\" \"Well Paul, I'd like .to, but I've gotta meet my brother, maybe next time.\"<br />\nThe rest of the trip to Santa Fe was a breeze. Most of the partyers were too crashed<br />\nout, sick, or plain scared to create any ruckus, so we just rode the Magic Bus on in. My<br />\nbrother met me at the dingy Greyhound station and handed me a beer as we waved<br />\ngoodbye to the Magic Bus. And that was the first moment of freedom and safety this<br />\ntattered cowboy extracted from Greyhound, Inc.<br />\n<br />\n\f••*••••411.•<br />\n<br />\n.page 10/news-letter/february 18, 1977<br />\n<br />\n...<br />\nWeekend Wonder Flix<br />\n<br />\n'<br />\n44111111111<br />\n.<br />\n.4111111111.<br />\n0<br />\n<br />\n1<br />\n<br />\n.<br />\n11111111. .411111.1110.<br />\n<br />\nSenior Class Film Series<br />\n<br />\npresents<br />\n<br />\n•<br />\n<br />\npresents<br />\n<br />\nWORkINCic<br />\nTO<br />\n'MAVEN<br />\nIASSCI\"S<br />\n<br />\nELIO PETRI'S<br />\n<br />\n11HE<br />\nCLASS<br />\nBIDES 11:1<br />\nHEA111/1EN<br />\nStarring GIAN MARIA VOLONTE<br />\nand MARIANGELA MELATO<br />\nFrom NEW UNE CINEMA<br />\n<br />\nBEST FILM, Cannes Film Festival<br />\n<br />\nI.<br />\n<br />\nELLIOTT KAMEN MC.71<br />\nA WA AJICHANDS RUA<br />\nAMES \"FAREIVE1.4 AO'LOVELY'<br />\nRQaWETAUTCNINA • CHARLOTTE EAMPLAY8 • AWNIMAM •STUN4 MK MAWS<br />\n,<br />\nsioac ANINONY ZERIE • NAM DEAN MUM tra.to'<br />\nRUCXNENEEN<br />\nleavaa Ofeirff DORASam.11111<br />\naeivei vo..:us ELLIOTT XAS7N£11 • MEW<br />\n1<br />\nAz c alawn=<br />\nCHANDLEN<br />\nWINOND<br />\nsf<br />\nwt..* p MAD ZELAG DOODMAN •'go<br />\n••••••<br />\n•••<br />\n•<br />\n• A.•-••<br />\n,<br />\n41i<br />\nDAVID santE•.44 aynapes,MUM 411 4IC MOON 15,-.<br />\n<br />\nintent<br />\n<br />\n\"VOLONTE IS FIRST-RATE!\"<br />\nCost/NEW YORK MAD<br />\n<br />\n\"BRILLIANTLY DIRECTED!\"<br />\nHerridge/NEW YORK POST<br />\n<br />\n\"ONE OF THE FUNNIEST<br />\nSEDUCTION SCENES EVER\"<br />\nStoop/AFTER DARK<br />\n<br />\n\"ELECTRICITY, VIGOR & PASSION!\"<br />\n<br />\nFRi. & SAT.<br />\n<br />\nFEb. 18 & 19<br />\n<br />\nWolf/CUE<br />\n<br />\nI<br />\n<br />\nAdmissioN $1.00<br />\n<br />\nShaffer 3<br />\n<br />\nSaturday, Feb.1 9<br />\n<br />\nTnvim,<br />\n<br />\n8:00& 10:00<br />\n5.75<br />\n<br />\nT4*-40-40-•4410-40-.1*-••-•-•4*-40-411*4<br />\n7:30 Pt 10:00 PM<br />\n<br />\n*•:•:••<br />\n<br />\nPLACE: SHRIVER HALL<br />\n<br />\nI ADMISSION: $1.00<br />\nNkk ScREwEd A3i1<br />\n<br />\n\"BREATHTAKING<br />\n...EXUBERANTLY FUNNY!<br />\nWatching All Screwed Up isto be witness<br />\nto a giant talent:<br />\nVincent Canby/ NEW YORK TIMES<br />\n<br />\nTHE INTERNATIONAL STUDENT'S ASSOC.<br />\nTHE GRAD CLUB THE JUNIOR CLASS<br />\n<br />\nINTERICION<br />\nDANIC<br />\n<br />\nBELLY<br />\nDANCER<br />\nARISTEA'<br />\n<br />\n\"A BRILLIANT MOVIE<br />\nthat must be seen several times!\"<br />\n<br />\nRex Reed<br />\n<br />\nGREEK<br />\nBAND<br />\n:<br />\n+GeRECIAN<br />\nODYSSEY<br />\n<br />\n\"UPROARIOUSLY<br />\nFUNNY<br />\nA strong<br />\n<br />\nentertaining,daring film from Wertmuller!\"<br />\nWilliam Wolf / CUE MAGAZINE<br />\n<br />\n\"INCREDIBLY FUNNY,\"<br />\nSan Francisco Chronicle<br />\n<br />\nBEER<br />\n<br />\nf5t LIGHT<br />\n50t DARK<br />\n40 te MICHELOB<br />\n<br />\nWINE<br />\n<br />\nLINA WERTMULLER'S<br />\n<br />\nALL SCREWED LIP<br />\nlii<br />\n<br />\nSENIORS<br />\n<br />\nNEW LINE CINEMA<br />\n<br />\nFriday, Feb. 1 8<br />\n<br />\nPG,<br />\n<br />\nSUN DAY<br />\nFEB. 20-th<br />\n<br />\n$1 es) Sfacien+<br />\n01-f9 Other<br />\n<br />\nFREE<br />\n945 -to I<br />\nMUNCH1E5<br />\nGLASS PAVILION-HOMEWOOD CAMPUS<br />\n\"YN5 HOPKINS UNIVERSITY<br />\n<br />\n\ffebruary 18, 1977/news-letter/page 11<br />\n<br />\nGodEREy's: 110T<br />\n<br />\nSTUFF<br />\n<br />\n-It's no secret that Godfrey's Steer and Beer on Greenrnount Avenue is high on this rag's list of fave rave<br />\nbars. Time and time again this streetside saloon has been applauded in these pages, and with good reason.<br />\nFrom the splintered wooden booths to the tacky wall decorations, from the cheap pizza to the thirty five<br />\ncent draft, Godfrey's can't be beat for an evening's entertainment. It's ticket to the Barroom Hall of Fame<br />\nwas printed years ago.<br />\nAlmost every day Godfrey's is packed with rambunctious patrons and thirsty down oa their luck roaders,<br />\na crew straight from the pages of the New York Daily News. Sure, the help is sometimes bitchy, but they<br />\ndon't mean any harm, it's just part of the wacky Godfrey's charm':<br />\nNo doubt about it, Godfrey's is the perennial shoe-in for bar of the week. But get there soon if you want<br />\nto catch some of the old magic, because rumor has it that<br />\nHOPKINS'<br />\n-will be purchasing Godfrey's in the near future in Order to quell the unmanageable crowds at the<br />\nRathskellar. It was also said that Godfrey's would be renamed Rathskellar East.<br />\n\"We found that it was impossible to snag a quick beer on Friday or Saturday night at the Rat,\"<br />\ncommented a middle range administration official.\" \"Godfrey's was dirt cheap and it filled our Rathskellar<br />\nexpansion requirements,\" he continued.<br />\nAccording to the recent scuttlebutt, plans are now underway for the construction of an underground<br />\nshuttle 'from Levering Hall to the basement of Godfrey's so that students don't have to contend with<br />\n\"Menacing city forces.\"<br />\n\"We don't think Hopkins students should have to consort with Baltimore's rabble if they don't want to,\"<br />\nexplained the confidential source.<br />\nHopkins police will provide the security for the tunnel operation. The shuttle will be limited to members<br />\nof the Hopkins Community.<br />\nDuring the '78-'79 school year, however, students will have to be content with the hourly bus service to<br />\nGodfrey's and back. The bus will be stationed at the back of Shriver Hall.<br />\nPre-meds will be banned from Rathskellar East. \"It'll still be Ilopkins property, but one step out of the<br />\nbar and whammo, you've got a slice of city life that no student ;hould be subjected to. At least until he<br />\ngraduates. Anyway, medical students are here to study.<br />\nREGULARS<br />\n-at Godfrey's are hoppin' mad about the rumored developments and are reportedly gearing up for a fight<br />\nwith the University. \"If Hopkins gets Godfrey's, next thing you know they'll be trying to corner the<br />\nGreenmount bar market. All for a bunch of snot-nosed students,\" snorted Willy Don Shannon, local lush<br />\nand lowlife.<br />\n.9 We wish the protestors a keg full of luck, dubious as their chances may be. As community leaders know,<br />\ntv,<br />\nthere's no stoppiif:the Hop.<br />\nz<br />\nSo go to Godfrey's while it's still a fine old neighborhood bar, and have a shot of bourbon and a draft for<br />\nthe old times. And why not send a letter of indignation to the moguls at Garland Hall?<br />\nIt's the decent thing to do.<br />\n—a. press<br />\n<br />\ndiAloqUE<br />\nBy J.D. CONSIDINE<br />\nPassing through the lobby, its<br />\ndead fluorescent light dissolving<br />\ninto the tinted glass sunlight<br />\nbeyond the doors. The ceiling<br />\nhums, quietly metallic against the<br />\nwet mumblings of the green-lit<br />\n, pebbled fountains. The<br />\nsuddenness of shoes, clisp soles<br />\nagainst the poured floors after<br />\nthe whisper of dense carpetted<br />\nopulence; steps out of alignment,<br />\narhythmic against the measured<br />\nSymmetry of tile and border. The<br />\ndull thud of two bodies leaning<br />\ninto the tinted plate-glass, the<br />\nWheeze of slow-turning metal,<br />\nthe whine of the cold street wind<br />\n<br />\ncome back and she'd ask me if I change. You alwayS. said you<br />\nsaw you, and of course I hadn't, loved me, but I was beginning to<br />\nso I'd go back to the library. I'd think love was little more than<br />\nalways find you sitting in a chair thought to you, thought like<br />\nsomewhere, reading a magazine your books and your paintings.<br />\nor a newspaper as if you were the And then when you bought that<br />\none waiting for me. But when we dog, when you showed that you<br />\nwent back to my room, you could feel, I hoped that maybe,<br />\nalways wanted to know how my just maybe...<br />\nwork was doing, what my classes<br />\n\"I don't know. Maybe it was<br />\nwere like, you listening like you just that the dog was more on<br />\nunderstood all about it. If I your level. God, I just never<br />\nhadn't met your friend, I never could figure...I loved you but<br />\nwould have known what you did. you only loved me like a<br />\nStill. I never felt as alone<br />\ntreasure, a painting or a book;<br />\nthen...\"<br />\nyou only loved me with your<br />\nLit ter cluttered stairs, the mind, like you thought I was<br />\nmuffled rumble of the trains above touching and feeling, like I<br />\nsliding low pitched through the could do it in my head. Damn it,<br />\nSlipping .into the staid control of steady drone of idling, I loved you, but you're just a<br />\ngas-warmed lobby air.<br />\nred-lighted engines, rising like the wall...\"<br />\n\"Anyway, it doesn't matter white steam from an unseen city.<br />\nHalf a dozen women in various<br />\nWhat I say because you're always In an instant the engines spring states of undress, a handful of<br />\noff somewhere else, thinking to life, a roar more of power-than<br />\nYour little thoughts.\" Her pace of motion, of vapor and tail<br />\nincreases. \"I don't even think lights and the airbrake wheeze of<br />\nYou're listening now. And you the transit bus. And still, beneath<br />\nvvonkr what the problem was. the visible clatter of the street,<br />\nJust shuffling along, the train below, more felt than<br />\nstoney-faced. I used to hope,just heard.<br />\nhope...oh, I don't know.\"<br />\n\"I suppose you're going to<br />\nHer reflection in the shop keep Ralph. I remember that<br />\nWindow falters, trying to speak. night when we passed the pet<br />\nJr bounces along, soundless past shop, and you stood there<br />\nthe silent outlooking mannequins smiling at him through the shop<br />\nto the brittle counterpoint of window. I didn't think much of<br />\nunseen shoes on the concrete it at the time. Remember how<br />\nWalk. A young boy running you always said \"hello\" to dogs<br />\nbetween cars accross the street is<br />\nand cats, sometimes even<br />\nby soot -scarred squirrels? Yet you never went<br />\nObliterated<br />\ngranite, only to reappear among into a pet shop. You always<br />\ndifferent mannequins in the same smiled at them, rubbed their<br />\nscene.<br />\nheads, but that was all—I thought<br />\n\"I remem'oer at school, how<br />\nyour interest in them was as<br />\nYou used to come over to visit transient as everything else in<br />\nWhen I wasn't there, and my your life. And then that night<br />\nroommate had you trooping off when you came home with him, I<br />\nto ,the library to find me. I'd thought maybe things might<br />\n<br />\nmovie stars, musicians and<br />\npoliticians hanging<br />\ncheek-to -cheek next to the<br />\ngrey-blurred newsprint murders<br />\nand crimes. The eyes staring out<br />\nunseeing, in expressions of<br />\ndeadened allure, bodies<br />\noutstretched like banner<br />\nheadlines, speaking in the dull<br />\nwhisper of an occasional breeze.<br />\n\"What is it you want out of<br />\nlife? I never could understand<br />\nthat. You always said you<br />\nwanted me, but you never said<br />\nwhy. I always felt like such an<br />\nobject, something to be gazed at,<br />\nlistened to. At first I thought it<br />\nwas wonderful, the way you<br />\n,adored me. I still do, but it isn't<br />\nenough. Why can't you try to<br />\ntouch me with something other<br />\nthan your mind? You're like a<br />\ncamera, only you never let me<br />\n<br />\nsee the pictures. What is it you<br />\nwant from me? What is it you<br />\nwant?\"<br />\nThe slowturning awkwardness<br />\nof the yellow door, of metal<br />\npried apart only to be released,<br />\ndull thudding against the rotting<br />\ngrease smeared carcass. The<br />\ndeepthroated rasp of its engine as<br />\nit, yellow-grey and sluggish as<br />\nbile, lurches into the slowly<br />\nyielding flow of metal, glass and<br />\nrubber, its yellow-backed<br />\nlettering disappearing into the<br />\ncold whitish fog, the dirty blue<br />\npuddles, and varishaped mottle<br />\nmoving into an oblivion of<br />\nhorizon, melting like the single<br />\nface in a backwindow blurred<br />\ninto obscurity before pulling<br />\nfrom sight,,finally dying into the<br />\nsolitary footsteps along the<br />\ntrash-strewn street.<br />\n<br />\n\fpage I2/news-letter/february 18t 1977<br />\n<br />\n•<br />\n•<br />\n•<br />\nrupt Dis<br />\n•<br />\n•<br />\ne<br />\nThi<br />\ns<br />\nis<br />\nyou<br />\nr<br />\n•<br />\n•<br />\n•<br />\n•<br />\nCommemoration<br />\ni CAMPUS NOTES space i<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n• Day Ceremonies<br />\n•<br />\n•<br />\nYo<br />\nu<br />\nsho<br />\n*<br />\nuld use it!! •<br />\nI<br />\ni<br />\n•<br />\n•<br />\ni<br />\n•<br />\n•I<br />\n•<br />\n•<br />\n•<br />\nr(t<br />\n•<br />\n•<br />\n•<br />\n••••••••••••.•••••••••••••••••.•••<br />\n••••••••••••••••••••••••••••••••••<br />\n<br />\ncK<br />\n<br />\n)<br />\n<br />\nfi<br />\n<br />\nIf anyone found a pair of green<br />\nand black ski mittens last Thurs.,<br />\nFebruary 10, I'd like to hear about<br />\nit. Call Joe at 467-4791. Reward..<br />\nThe Jewish Students Association is\\<br />\nsponsoring religious services on Friday<br />\nnight at 6:30 in the Kosher Dining<br />\nHall. Saturday afternoon services will<br />\nbe held at 5:00 in the KDH.<br />\nCelebrate Washington's birthday•<br />\nthe international way! Come to the<br />\nGreek dance festival on Sunday, Feb.<br />\n20, 9:15 p.m. in the glass pavillion.<br />\nThere will be professional belly dancer<br />\nand Greek band giving you a true<br />\nflavor distinct from that of a disco.<br />\nBrought to you by the International<br />\nStudents, Junior Class, and the Grad .<br />\nClub.<br />\nLost: Sr-51A calculator in Remson<br />\n101, Thursday Feb. 17. Please contact<br />\nEd at 366-5610.<br />\n<br />\nNorth-South relations: Frank Ortiz<br />\nof the U.S. State Department, former<br />\nhead of the U.S. Latin America Desk<br />\nand Chief U.S. Diplomat td Uruguay,<br />\nwill speak about U.S.—Latin American<br />\nrelations, Tuesday, Feb. 22 at 8:30<br />\np.m. in Maryland 226. Sponsored by<br />\nthe International Studies Forum. All<br />\ninterested persons are invited.<br />\nGet away from it all for a few<br />\nhours. Join us in a short hike (4-5<br />\nmiles) around scenic Lake Roland.<br />\nMeet in front of Levering, Saturday at<br />\n10:00 a.m. Bring lunch. Inquiries<br />\n889-3522 or 243-8667.<br />\nFor those interested; Spring Track<br />\nbegins Tuesday, Feb. 22 at 4:15 p.m<br />\nMeet at the Athletic Center.<br />\n<br />\n'Big Bucks comes to B-more.<br />\nBecome part of the world of bigtime<br />\ncollege golf and play for Johns<br />\nHopkins. Please attend a meeting<br />\nTuesday, Feb. 22 at 4:30 p.m. in the<br />\nAthletic Center. Classroom.<br />\nProfessor George Whitesides of the<br />\nMassachusetts Institute of Technology<br />\nwill present a colloquim, \"Enzymes<br />\nfor Large-Scale Organic Synthesis\" in<br />\nRemsen 221 on Tuesday, March 1 at<br />\n4:15 p.m. Open to the public and free<br />\nof charge.<br />\nMaryland NORML presents Reefer<br />\nMadness, a film about marijuana, on<br />\nFriday, Feb. 18 and Saturday, Feb. 19<br />\nin Shriver Hall. Admission is $1.00.<br />\n<br />\nThe JHU Historical Simulations<br />\nStudy in<br />\nSociety will be meeting on Sat., Feb.<br />\nGuadala<br />\njara, Mexico<br />\n19, at 10:30 a.m. in Md. 214.<br />\nThe<br />\nGUADALAJARA<br />\nSUMMER<br />\nSCHOOL, a fully accredited UNIVERSITY OF ARIZONA program, will offer<br />\nJuly 1 -August 12, anthropology, art,<br />\neconomics, bilingual education, folklore, history, political science, Spanish<br />\nlanguage and literature. Tuition and<br />\nfees, $220; board and room with<br />\nMexican family, $280. Write to<br />\nGUADALAJARA SUMMER SCHOOL,<br />\n1530 Gamma Apartments, University of<br />\nArizona, Tucson, Arizona 85721.<br />\nea.<br />\n<br />\nclassifieds,<br />\n<br />\nI<br />\n<br />\nP S31.1001.m<br />\nSTINKP<br />\n<br />\nfaa-ket,/-7<br />\n<br />\nOFFICE OF THE CHAPLAIN<br />\nPresents<br />\nthe<br />\n<br />\nSUNDAY<br />\nEXPERIENCE<br />\n\"TWO RIGHTS: ARABS AND .11:11'.(,\"<br />\nA Talk By<br />\nDR. HERTZEL FI5,IL11/1,1.<br />\nBakimore Zionist Federation Scholar-in-Residencc<br />\nSUNDAY,FEBRUARY 20, 11:00 A.M.<br />\nLISTENING-VIEWING ROOM<br />\nLEVERING HA LL<br />\n<br />\nSPANISH by experienced native<br />\nteachers - AU levels, all<br />\nales.<br />\n366-.2056.<br />\nVERY SINCERE MEDICAL<br />\nSTUDENT, Jewish, age 26, seeks a<br />\nsincere, well-educated, well-adjustedi<br />\nyoung woman of good character.<br />\nObject: friendship and<br />\ncompanionship possibly leading to<br />\nmarriage. Please reply to Box 5936,<br />\nPikesville, Maryland 21208.<br />\nEARN . EXTRA MONEY:<br />\nTelephone Sales from our Charles<br />\nVillage office. AM and PM shifts<br />\navailable: good telephone voice<br />\nnecessary. Call between 10:30 pm. 1:00 pm. 467-1772.<br />\nDIAMOND ENGAGEMENT &<br />\nWEDDING RINGS: Up to 50%<br />\ndiscount to students, faculty, &<br />\nstaff ( full or part-time ). Example,<br />\n1/4 ct. $75,1/2 ct. $250,1 ct. $695<br />\nby buying direct from leading<br />\ndiamond importer. For color<br />\ncatalog send $1 to SMA Diamond<br />\nImporters, Inc., Box 42, Fanwood,<br />\nN.J. 07023 ( indicate name of<br />\nschool )or call (212) 682-3390 for<br />\nlocation of showroom nearest you<br />\n<br />\n20TH CENTURY-FOX PRESENTS<br />\n<br />\nA RALPH BAKSHI FILM<br />\n<br />\n?UINTA'.GUIDANCE SUCSESTED 401<br />\n1,111111/4<br />\n<br />\nNOT II $11..t1<br />\n<br />\n,111.1.5<br />\n<br />\nr 1977 Twentteth Century-Fox<br />\n<br />\n=MEMCI<br />\nPHOTOGRAPHY-Learn the basics<br />\nof taking pictures and making them<br />\ninto printsor slides. Use your own<br />\nequipment or our professional<br />\nequipment. Individual or group<br />\ninstruction given. CALL 467-8407<br />\nAND ASK FOR MIKE'<br />\nFACULTY 1IOME FOR RENT.<br />\n14-month period. June 15, 1977 August 15, 1978. 5 bedrooms, nice<br />\nyard, adjacent to park. Fully<br />\nfurnished. Walking distance to<br />\nHomewood campus. $475 month.<br />\n338-7274 (eves. 243-2113)<br />\n<br />\nTHE ALL NEW HOME WOOD DELICATESSEN<br />\n3105 St. Paul St. 46 7-7882<br />\n<br />\n•<br />\n<br />\nHOME OF THE FAMOUS<br />\n\"HOT CORNED BEEF\"<br />\nWe cook'em all day & Western Fries<br />\nTHE BIGGEST AND BEST SANDWICHES — IN TOIV.V<br />\nDELICIOUS WESTERN FRIES<br />\nDELICIOUS FRIED CHICKEN<br />\nHOMEMADE SALADS<br />\nNATURAL FOOD DEPT'<br />\nSILBERS BAKERY DEPT.<br />\nNATURAL YOGURT & ICE CREAM BAR<br />\nPARTY TRAYS our SPECIALTY<br />\n<br />\n\ffeb.ruary 18, l977/news-letter/page 13<br />\n<br />\nv-A2r-Awo4r-gw_gw-gwitzrearAw-A<br />\nYour Campus-PrJde!<br />\nri NEW REVOLUTIONARY NEW<br />\nUNIQUE<br />\nHISTORIC— First University Campus Postcards<br />\nDifferent Superb Scenic-Views,<br />\nFrom Your Campus,On One Card<br />\nYOUR CAMPUS PRIDE GOES WORLDWIDE<br />\nThink! Think more often on your relatives &<br />\nfriends, drop them a line. They will admire &<br />\ntreasure your pride! Frame one for yourself!<br />\n<br />\nUNI-PRIDE CREATIVE POSTCARDS<br />\n<br />\n.k,..<br />\n1 4\",,•* -,I•<br />\n`.. t.'• ,,,,, 'Is\"<br />\n..:„..,,:,4.,:<br />\n1,.11,.:<br />\n„:<br />\n.:<br />\n... ,,..z. fn,,,,,..,,.<br />\n...:::.<br />\n.:-. .41, ts.*<br />\nj-.k1.....,<br />\n:<br />\n,:-—..;<br />\n<br />\nIre'<br />\n7<br />\n,<br />\n,,'''1.,•'I<br />\n<br />\n••<br />\n<br />\nI Catholic<br />\n<br />\n,<br />\n<br />\ne-r .••.0 - -.;,Zy 1<br />\n-..‹,..1\",-7,•..t1<br />\n--,..,.r,,'<br />\n4 •.,-,-.,ik•<br />\n,, .1 ...\\,,-;:-,..v<br />\n(<br />\n'<br />\n.:114.•'<br />\n(;<br />\n•1.r1,:-„...'.0.1.'-.'''<br />\n;,:.:<br />\n\"<br />\niact<br />\n;<br />\n...-1<br />\n::;1..:<br />\n.,,,.<br />\n..<br />\n,<br />\ni<br />\n.<br />\n,:<br />\n.<br />\n.<br />\n,.<br />\n•..<br />\n. 1....,<br />\ni''<br />\n• - •-•'i...,<br />\n.....::..t.....2<br />\n1<br />\n- ..<br />\n.t ,J.-„-?,,••,,••<br />\n.1•••C.i,<br />\n-; -!;,<br />\n,i-)..f-,..-.,.•=i<br />\n...<br />\n*•.c.;!c0<br />\n/ /I/ ,,k\" '••<br />\n''''.<br />\n'....kl.....'\".',.,- :,r,11••••-1),i..,.1:1.7‘‘,<br />\n'''''<br />\n.0\".....7<br />\nC.''.,'<br />\n,<br />\n,.:_\"<br />\ni•-•<br />\n\"<br />\n.<br />\n<br />\nCommunity<br />\non Cainpus<br />\n<br />\n7,...›,2•;.f:(4<br />\n‘'<br />\nC.(f..; :t::11•:.‘01re''''<br />\nr.f.c,.<br />\n<br />\n.t-c •., if .s., 4,<br />\ni<br />\n.•'<br />\n•- S.7'<br />\nu<br />\n.. .<br />\n2..<br />\n•'<br />\nI ..','<br />\n. ‘}.,Jr.<br />\n'<br />\n'<br />\nr Y A.'t *(.,',.,<br />\n, ',<br />\n•'<br />\n''<br />\n'<br />\n'I<br />\n..,<br />\n.<br />\n' ..-... t` 1 ,4 1.I.'•.<br />\n,,li k 4's • 'J''' t' '-•<br />\n\"•1/4,,-.0`4.i.\"'141.'<br />\n1 :' •'<br />\nt.=<br />\n'<br />\n'•'<br />\n..,<br />\n‘<br />\n,.'t,<br />\n•'•s<br />\n',S.,<br />\n'.•<br />\n,<br />\n_ A • .• I g•<br />\n'IL,;<br />\n,<br />\n,-\"r-,'\"<br />\nc•-;,„,<br />\n,<br />\n.<br />\n.<br />\n-• 4,,`, L.<br />\n,:<br />\nL.<br />\nv<br />\n.<br />\n(<br />\n,<br />\nJ<br />\n.<br />\n:::„........,<br />\nI,<br />\n-...r k .e‘.. 4 :t• r Y<br />\n,r• ... • • .•• - • 0 „ , r.,..<br />\n:‘1 i'., .<br />\nb S0 •• • .:•.<br />\n.•. ..1 tibi:-,.., t_ r ..:•.4<br />\n. .:,),..:.,••••'s s,<br />\n,<br />\n•s,t,d.•,,,.,,,7; I.<br />\n•,,,<br />\n- v‘!:••••\\.,...% .....$)•.-7'\",1-\"...,...\":z'.<br />\n,.• ,,,,,,..., .:.;•,....-Y: . r<br />\n<br />\n.• i„.4:—.1.<br />\n'<br />\n..•3• )— - •<br />\n<br />\nPENITENTIAL LITURGIES<br />\nSunday, February 20th<br />\n10:30 a.m. in Schaffer Hall, Room 3.<br />\n5:00 p.m. in Newman House, 2941-Charles<br />\n<br />\n‘<br />\n_c i,v'<br />\nf. t•-1<br />\n<br />\n.c...1 ;#,\",.•1+,<br />\n# .,::\".,'<br />\n<br />\n.•,..).,,•<br />\n„4,'?...•<br />\n;, II',1*.Pf<br />\n..' ..:;•.:.<br />\n:'.' '<br />\n.•''<br />\n<br />\n•‘.• 1:, ., 1<br />\nr.: 3<br />\nI.<br />\n<br />\nk.<br />\n<br />\nON SALE/AT YOUR UNIVERSITY BOOK-CENTER<br />\n<br />\n2r-par-A2r-g2r-ow-Awarr.2r-gw-g<br />\n...in.<br />\n<br />\n4<br />\n• ‘• -',\"<br />\n<br />\n.•• •<br />\n<br />\n;1.<br />\n<br />\n••••••••<br />\n<br />\nYou can spend anywhere from a summer, to a semester,<br />\nto a full year.. learning, experiencing, helping.<br />\n<br />\n4...<br />\n<br />\n•<br />\n<br />\nthilversitg SandyAch Shame aid Deli<br />\nAl Limp Crab Cakes<br />\nGeassiae Readier Carried Beet<br />\nDiliClog'Roast Beef<br />\nVitikais Baked Hasa<br />\nVarious Cold Cuts<br />\nCheese (S;wiss. Psovoione. Muenster)<br />\nKosher Hot Dor<br />\nCatalan<br />\nParty nays(lipickli order)<br />\nHzea<br />\nHowe Made Dame(Mem Odut)<br />\nIce Creme<br />\nSelect Guy Items<br />\nMau<br />\n<br />\nRICIITAUHANT 6 CAMAY 011T<br />\nPima 4674062<br />\nUNSVTY PAIRKWAY<br />\nAT UM PAUL.<br />\nPrl: 9:30 - 700<br />\nONIE APT&<br />\nUNIVONIIITY<br />\nLOOM<br />\n2:00<br />\n9:30<br />\nSat<br />\nClosed Sundays<br />\nFREE SODA Wall PilS Al) AND<br />\nPURCHASE OF Si.00<br />\n<br />\n.• .•<br />\n-3 ,T.V • 77 ,<br />\n<br />\nSummer programs include- ulpanim, archaeological digs,<br />\nkibbutz service, and science projects.<br />\n<br />\n'<br />\n\"<br />\n=•1,4'..\" '<br />\n,, • ,•.<br />\n•<br />\n<br />\nSix month or twelve month programs offer volunteer<br />\nwork in development towns and kibbutzim, study<br />\nat Israeli universities, and participation as<br />\na volunteer in your profession.<br />\n<br />\n_••'•<br />\n- ..,` • 'c<br />\n,•„ •t,<br />\n•:<br />\nJ •<br />\n<br />\n.4<br />\n49<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\n•:-<br />\n<br />\n..•as•-•44<br />\n<br />\n••<br />\n<br />\nIt's all available through AZYF where<br />\nwe offer 22 different programs.<br />\nThe price includes round trip airfare,<br />\nroom and board, tuition fees<br />\n(where applicable) and tours<br />\nof Israel.<br />\n<br />\n, .t:1\"•,<br />\n<br />\nCome to Israel, soon<br />\n<br />\n•<br />\n'<br />\n•<br />\n<br />\n'\"(..tt:•1<br />\n<br />\n‘•\".<br />\n<br />\nSOCIAL SECURITY ADMINISTRATION<br />\nFEDERAL SUMMER INTERN PROGRAM<br />\n1977<br />\nSocial Security will have a limited number of positions<br />\navailable this summer for qualified students. Hopkins may<br />\nonly nominate three students in each category listed below.<br />\nCategory No. 1, GS-4 level positions in this category are<br />\navailable to students entering their senior year in the fall of<br />\n1977, who will have completed their junior year by June,<br />\n1977. Qualifying majors for these positions are liberal arts,<br />\nmathematics, statistics and computer science. All positions<br />\nare located at SSA Headquarters in Baltimore, Md.<br />\nCategory No. 2, GS-5,7 and 9 level positions in this category<br />\nare available to students who will have will have completed<br />\nall requirements for a bachelor's degree by June, 1977, and<br />\nwho have applied for, or are currently enrolled in one of the<br />\nfollowing graduate programs--mathematics, statistics,<br />\ncomputer science, economics or one of the social sciences.<br />\nPositions are located in Baltimore, Maryland and Washington,<br />\nDC.<br />\nIn addition, applicants must meet the following general<br />\nrequirements: (a) be American citizens; (b) be bona-fide<br />\ncollege students who will be returning to school in the fall;<br />\nand (c) rank in the upper one-third of their graduate class for<br />\nCategory No. 2. Sons and daughters of Department of<br />\nHealth, Education, and Welfare employees are not eligible for<br />\nthe program. Positions are not available for students majoring<br />\nin chemistry, engineering, physics, biology.<br />\nAll interested students must see Sharon Baughan, Student<br />\nEmployment Officer, 125A Garland Hall before February 28,<br />\n1977.<br />\n<br />\nISRREL<br />\nIt's all<br />\nyour<br />\nIsrael Program Center/American Zionist Youth Foundation<br />\n515 Park Ave N Y, N Y 10022 (212) 751-6070<br />\n<br />\n'poi u uo<br />\n<br />\nBlirs<br />\n<br />\n:<br />\n<br />\nSend me further information on your programs to Israel<br />\nEJ High School [1 College<br />\nName<br />\nAddress<br />\nCity<br />\n<br />\nState<br />\n<br />\nSchool _<br />\n<br />\nZip<br />\nAge<br />\n<br />\nEMPLOYMENT INTERVIEWS AT THE PLACEMENT BUREAU<br />\nCareer of a life time?<br />\nJob of your dream?<br />\nCome see a recruiter-Join the capitalist team!<br />\nThe following organizations will be interviewing interested students at the Placement Bureau,<br />\nRoom 135 Garland Hall, during the coming weeks. Students nearing graduation who will be<br />\nseeking full-time, permanent employment are encouraged to come to the Placement Bureau to<br />\nschedule interviews and to obtain information about employment opportunities.<br />\n<br />\nTuesday, February 22<br />\nUpjohn<br />\nApplied Physics Lab.<br />\nWednewday, February 23<br />\nApplied Physics Lab.<br />\nThursday, February 24<br />\nGeneral Electric Company<br />\nHughes Aircraft Company<br />\n<br />\nFriday, February 25<br />\nNational Security Agency<br />\nTuesday, March 1<br />\nWestinghouse Electric Corp.<br />\nWednesday, March 2<br />\nInternational Business Machines<br />\nThursday, March 3<br />\nCity of Baltimore, Dept. of Educ.<br />\nExperiment in International<br />\nLiving<br />\n<br />\n\fpap 14/news,letter/february 18, 1977<br />\n<br />\nEUROPE<br />\n<br />\nwia<br />\n70<br />\n<br />\nWomen's basketball suffering from friction<br />\n<br />\nw\"Y<br />\nrr<br />\nI<br />\n/<br />\n2er:<br />\nan1<br />\nle<br />\n4<br />\nadvance !laymen! reguaexl<br />\n<br />\nBy DAVID KRAUS<br />\nWhen ,an<br />\nathletic team has strung together<br />\nseveral poor seasons, it is not<br />\nunnatural for friction to develop.<br />\nSuch a case is the Blue Jay<br />\nwomen's basketball team- a<br />\nsquad that has managed but one<br />\nwin in-the last three years and is<br />\n0-8 in the current campaign.<br />\nApparent dissatisfaction<br />\namong certain team members<br />\nsurfaced Tuesday evening in an<br />\narticle in The Evening Sun.<br />\nReporter Bob Ibach, writing a<br />\nstory on women's collegiate<br />\nsports in Maryland, attributed<br />\nseveral quotes to JHU basketball<br />\nco-captain Rita Chang- quotes<br />\nthat reflected dissatisfaction with<br />\nHopkins coach Pat Harris.<br />\nRita, however, was unhappy<br />\nthat her comments appeared in<br />\nthe method that they did and<br />\nfeels that Ibach misquoted her<br />\n\"I didri't appreciate my<br />\n<br />\nEOM:Travel Chargers<br />\n<br />\ncomment about the basketball<br />\ncoach being pulled out of<br />\ncontext and printed,\" the junior<br />\nfrom Hastings-on-Hudson, N.Y.<br />\nexplained. \"My point was to<br />\nexpress dissatisfaction with the<br />\nresponsiveness of the Athletic<br />\nDepartment to the women.s<br />\nbasketball team.\"<br />\nIbach disagreed.<br />\n\"No, I don't believe I did take<br />\nher statement out of context,\"<br />\nthe reporter commented.<br />\nHopkins Athletic Director Bob<br />\nScott regretted that the<br />\ncomments came out in print.<br />\n\"People have rights to make<br />\nopinions or judgements,\" the<br />\nformer lacrosse mentor noted,<br />\n\"it's just unfortunate that these<br />\ncomments were aired publicly.\"<br />\nScott disagreed that the<br />\nAthletic Department has been<br />\nunresponsive to the needs of the<br />\nteam.<br />\n-No one who is a member of<br />\n<br />\nthis current varsity team has been<br />\nto see me,\" he said. \"About ten<br />\ndays ago, however, someone who<br />\nis not a member of the team<br />\ncame to speak to me about the<br />\nwomen's basketball situation.\"<br />\nScott went on to say that this<br />\nwas the first such discussion he<br />\nhad had in the three years that<br />\nPat Harris had been the coach.<br />\nWhen asked about the article,<br />\nCoach Harris didn't \"care to<br />\nmake any comment.\"<br />\nDr. Joyce Hogan, the only<br />\nfull-time female instructor in the<br />\nJHU Physical Education<br />\nDepartment and a person whose<br />\nrecommendations Scott says he<br />\n\"relies heavily on\" when hiring<br />\nwomen's athletic coaches, was<br />\nnot surprised at Rita's comments.<br />\n\"Rita's said this to me several<br />\ntimes, including last year,\" Dr.<br />\nHogan explained. \"In any<br />\nendeavor, you will get people<br />\nwho disagree no matter what. In<br />\n<br />\naddition to complaints, I've<br />\nreceived positive features<br />\nattesting to Coach Harris'<br />\ncompetence and to the fact that<br />\nthe women enjoy playing for<br />\nher.\"<br />\nDorthea Cypher, a sophomore<br />\nmember of the team, voiced such<br />\npositive sentiments about the<br />\ncoach.<br />\n\"She's the best coach I've ever<br />\nhad, \" Dorthea claimed. \"She's<br />\nbeen an excellent teacher.\"<br />\nDespite the problems that her<br />\ncomments have caused, Rita is<br />\nhopeful that some good will<br />\ncome out of it.<br />\n\"I can only hope that my<br />\ncomments, now said and done<br />\nwith,\" she explained, \"will<br />\nfurther facillitate<br />\ncommunications between team<br />\nmembers, their coaches and the<br />\nAthletic department.\"<br />\nThat is something that only<br />\nthe future will be able to reveal<br />\n<br />\nThe<br />\nchallenge.<br />\nYour challenge is to discover words of<br />\nfour letters in this pentagon. Discover<br />\nthem by following the straight lines to<br />\nand from the letters,forming words as<br />\n<br />\nyou go.You may not use two of the same<br />\nletters in any one word.lf you can make<br />\n30 words or more, you've met the<br />\nchallenge.<br />\n<br />\nColl to!I free<br />\n6 to 9 0 m<br />\n<br />\n(800) 325-4867<br />\nor see your travel agent<br />\n<br />\nBUSINESS<br />\n<br />\n, WPOIATUNI,<br />\n<br />\nStuff Envelopes<br />\n<br />\nI<br />\n<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.226<br />\n102 Charles Street<br />\nBoston,Mass. 02114<br />\nJOHN GA- CII HO'.SHOP<br />\n<<br />\n<br />\nBA LT EMOR E'S LA H'<br />\nUSED<br />\n<br />\n.e.<br />\n<br />\naJTP. 3<br />\n3322 Greenmount Avenue<br />\n467-4344<br />\nUSED AND RARE<br />\nOLD AND OUT—OF- PR IN\"r<br />\n<br />\nBUS1NF'S' OPPORTUNffY<br />\n<br />\nStuff EnveloEs<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.3394<br />\n1 310 Franklin Street<br />\nBoston,Mass. 02110<br />\n<br />\n+yr<br />\nGoodoteam oe c<br />\nWiri‘tlii<br />\n<br />\nM<br />\n<br />\nWhen there's a challenge,<br />\nquality makes the difference.<br />\nWe hope you have some fun with the challenge.<br />\nThere's another challenge we'd like to offer you, too.<br />\nThe Pabst challenge:<br />\nWe welcome the chance to prove the quality of<br />\nour beer. We challengeyou to taste and compare<br />\nPabst Blue Ribbon to any other premium beer. You'll<br />\nlike Pabst better. Blue Ribbon quality means the best<br />\ntasting beer you can get. Since 1844 it always has.<br />\n<br />\nPABST. Since 1844.The quality has always come through.<br />\n019/<br />\n<br />\n•s v.\" s<br />\n<br />\ns<br />\n<br />\ns<br />\n<br />\nPABST E3Flf NANO COMPANY Molwaukee Ms Poona Fle.ghts III Newark NJ . los Angeles Calif<br />\nPabst Georgia<br />\n<br />\n• —\"<br />\n<br />\n•s<br />\n<br />\ns—\"<br />\n<br />\n.\"<br />\n<br />\n•<br />\n<br />\ns<br />\n<br />\n•_\" s. s<br />\n<br />\ns<br />\n<br />\ns<br />\n<br />\n-<br />\n<br />\n\ffebruary 18, 1977/news-letter/page 15<br />\n<br />\nSmoke 'em, Jays<br />\n<br />\nHoopsters drop two: Haverford, F&M get the buckets<br />\nBy ANDREW COHEN<br />\nIt's been a rough week so far<br />\nfor the Blue Jay varsity<br />\nbasketball.<br />\nMonday evening, Hopkins<br />\nproved to be formidable<br />\ncompetition for the number five<br />\nnationally rated basketball team<br />\nin Division III as they dropped a<br />\nClose one to the Franklin and<br />\nMarshall Diplomats, 80-73 in the<br />\nWhite Athletic Center,<br />\nJHU travelled to Haverford<br />\nWednesday night and lost an<br />\nimportant Mac division game as<br />\ntheir hosts won 83-75.<br />\nMonday night, the Diplomats<br />\nheld a twenty-five point<br />\nadvantage over the Jays in the<br />\nsecond half, but blew it when the<br />\nhome team led by John Finston,<br />\nAndy Scheinfeld, Dean Uhler,<br />\nKevin Kabat and Mike Phipps<br />\noutscored Franklin and Marshall<br />\n23 to 5 in an incredible six<br />\nminute surge that brought the<br />\nfighting Jays to within four<br />\nPoints of the lead.<br />\nThe game opened with the<br />\nJays giving the stronger team<br />\nquite a scare. The Diplomats<br />\ncontrolled the tip, taking the ball<br />\ndown court setting up for an<br />\noffensive play. F&M missed their<br />\nshot and Dan Kopcza was in<br />\nPosition for the rebound. Finston<br />\nmissed the Jays opening shot, but<br />\non the ensuing defensive play,<br />\nguard Scheinfeld forced a jump<br />\nby tying up a Diplomat offender.<br />\nAndy won the toss up, sending<br />\nthe ball to 6'8\" Uhler who hit on<br />\na beautiful five foot turnaround<br />\nJump shot for the 2-0 lead.<br />\nThe visiting opponents quickly<br />\n<br />\nInstant replay!<br />\n<br />\ntied the score off a fine passing<br />\nconnection from sophomores<br />\nKen Hopson and Mark Worley<br />\nwhich resulted in a driving layup.<br />\nUhler broke the tie by sinking a<br />\nfoul shot, but a short from<br />\nDiplomat forward John Boyer<br />\nput his team on top 4-3. The<br />\nscore seesawed back and forth<br />\nuntil consecutive buckets by<br />\n<br />\nUhler and guard Kabat gave the<br />\nJays a three point lead at the six<br />\nminute mark of the first half.<br />\nBut the lead did not last long<br />\nfor the Blue Jays. The Diplomat<br />\noffense took over outscoring the<br />\nJay offense 15-4 putting the tally<br />\nin their favor 23-15 halfway<br />\nthrough the twenty minute<br />\nperiod. The rest of the first half<br />\n<br />\nsaw the Diplomats catch fire,<br />\nhitting every shot in sight. Junior<br />\nDon Marsh and sophomore Bob<br />\nManaskie led the team in scoring<br />\nin the first half with 14 points<br />\nand 10 points, respectively. Uhler<br />\npoured in 13 points for the Jays,<br />\nbut they found themselves down<br />\n44-27 at the end of the first half.<br />\nThe Diplomats also<br />\noutrebounded the Jays 24-10.<br />\nThe second half saw F&M<br />\ncontinue to build up their lead<br />\nuntil they had a 60-35 advantage<br />\nwith fourteen minutes left in the<br />\ngame. From that point on the<br />\nJays chipped away bit by bit at<br />\nthe Diplomat lead.<br />\nApparently, F&M figured that<br />\nthe Blue Jays had given up on the<br />\ngame's outcome, so they replaced<br />\ntheir first string team with their<br />\nscrubs. But the Jays wouldn't<br />\nquit. Offensive surges led by<br />\nPhipps, Finston, and Scheinfeld<br />\nput the Jays to within four<br />\npoints of the Diplomats.<br />\nUnfortunately for the Jays, their<br />\nsurge was too little too late and<br />\nthe Jays went down to defeat<br />\n80-73.<br />\nThe contest against Haverford<br />\nwas a fairly even affair. Neither<br />\nteam could amass a substantial<br />\nlead through the first half and<br />\nthe Jays went into the locker<br />\nroom with a slim 43-42<br />\nadvantage.<br />\nHaverford, however, was able<br />\nto pull away in the second<br />\ntwenty minutes. Led by<br />\nBaltimore product Larry Keith's<br />\n27 points, the Pennsylvanians<br />\nwere able to claim the victory..<br />\nInterestingly, it was<br />\n<br />\nJay women's squash winning a good deal<br />\n<br />\nTANK MeNAMMIA<br />\n<br />\nOne of the most reccnt<br />\nadditions to the Blue Jay<br />\nintercollegiate sports program is<br />\nProving that it doesn't take very<br />\nlong to build a winning tradition.<br />\nThe Hopkins women's squash<br />\nteam, under the tutelage of<br />\nnational amateur squash<br />\nchampion Dr. Joyce Hogan, has<br />\nfashioned a dual meet record of<br />\nSi so far this season in only its<br />\nsecond year of competition.<br />\nIn last year's inaugural<br />\nCampaign, the squad had amassed<br />\na- fine 6-4 mark and was looking<br />\nfor eontinued success. However,<br />\ntheir hopes were dampened<br />\nearlier this year when Beth<br />\nLenowitz, last year's number one<br />\nPlayer, .was lost for the season<br />\ndue to an injury.<br />\nDespite this. blow, the team<br />\ncame on stronger than ever.<br />\nPaced by Joann Beckwith, Lisa<br />\nGottesfeld, Kate Foster and Barb<br />\n<br />\nduring the weekend of January<br />\nThomas (except for Foster, each<br />\nis in their first year of 28-30. At that round-robin<br />\ncompetition), the squad has tournament, the Jays placed 13th<br />\nin a field of 17. Hopkins returned<br />\nscored impressive victories over<br />\nto dual, meet competition on<br />\nan array of opponents. Rounding<br />\nout the squad are Marlene Tandy, February 4th when it hosted a<br />\nthree-way series with Franklin<br />\nNancy Tang, Debbie Weigel and<br />\nMarybeth Fasano.<br />\nand Marshall and George<br />\nEllett' meet is, composed of a<br />\nWashington. JHU downed F and<br />\nnumber of singles matches. Due. M 5-2 and GW 7-0 to run its<br />\nrecord to 4-0.<br />\nto the fact that the sport is still<br />\nOn February 5th, the squad<br />\nin its growing stages on the<br />\nintercollegiate level, there is no<br />\ntravelled to Charlottesville,<br />\nset amount of matches they will<br />\nVirginia to face the University of<br />\nplay when they contract to play<br />\nVirginia. There, the Jays nipped<br />\neach other.<br />\ntheir hosts 3-2 to maintain an<br />\nThe team opened its season on<br />\nlriblemished record.<br />\nDecember 3rd when it travelled<br />\nThe University of Pennsylvania<br />\nto Washington, D.C. to defeat<br />\npinned the only defeat on the<br />\nGeorge Washington 7-0. The<br />\nJays, downing JHU 5-1 in<br />\nfollowing, the team ran its record<br />\nPhiladelphia on February 10th.<br />\nto 2-0 with a 6-1 home victory<br />\nAt the Penn round robin<br />\nover Swarthmore.<br />\ntournament the following day,<br />\nThe next competition for ale<br />\nHopkins entered two teams with<br />\nteam was the Howe Cup at Yale<br />\nmixed results. The \"A\" squad<br />\n<br />\nYOU ON TRIAL. root NUI4?<br />\nFOR 121%0YALTY To TPE<br />\n5TATE um veg5ITY FooTBALL<br />\nPROGRAM ?<br />\n<br />\nuJAAT G17I Po WRONG 7<br />\nI'VE 50u61-1T 9,64WN<br />\n1iCKGT5 FOR 15YAU<br />\n<br />\nplaced fourth in a field of five,<br />\nwhile the \"B\" team finished<br />\nsecond out of seven participants.<br />\nDr. Hogan has been surprised<br />\nat the team's Success so far, but<br />\nsees the team members<br />\nwillingness to practice as a main<br />\nreason for the squad's excellent<br />\necord.<br />\n\"Practice really does make a<br />\ndifference,\" the Coach explained.<br />\n\"We're starting to play 'smart'<br />\nsquash, something we didn't do<br />\nlast year. We're doing more than<br />\njust trying to keep the ball in<br />\nplay.\"<br />\nDr. Hogan is looking to the<br />\nfuture with continued optimism.<br />\nThe team is composed mainly of<br />\nunderclassmen and, according to<br />\nthe coach, this squad \"will have<br />\nalot of productive years ahead.\"<br />\n<br />\nAMP L-P6T YEAP You<br />\nNO-4-101AJED FOUR TIM.e(7.<br />\nEMPTY 5EAT' LODI<<br />\n<br />\nTERRIBLE ON<br />\nNATIONAL TELevii0tv,<br />\nir<br />\nPa.<br />\ncouLP Avg<br />\nouRREaturnO\"<br />\nPeO&RAM<br />\n<br />\nHaverford's success at the foul<br />\nthrow line that proved to be the<br />\nBlue Jays' downfall. Both squads<br />\nshot an identical 33-63 from the<br />\nfloor, but the hosts hit on'17 of<br />\n26 foul shots while JHU was 9<br />\nfor 12 from the line.<br />\nThe Jays conclude their<br />\nregular season tonight as they<br />\ntravel to Chestertown, Maryland<br />\nto face Washington College. A<br />\nvictory is crucial if Hopkins is to<br />\nremain in the running for the<br />\nMAC championship.<br />\nA win tonight will give the<br />\nBlue Jays an MAC record of 6-4,<br />\n'tying the-in with Haverford for<br />\nsecond place in the division. It<br />\nwill be then be up to the MAC<br />\nGames committee to determine<br />\nwhich team should enter the<br />\nplayoffs or whether there should<br />\nbe a game to decide that issue.<br />\nThe men's junior varsity<br />\nbasketball team is also bringing<br />\nits season to a close. Monday<br />\nevening, the Junior Jays dropped<br />\na contest to their counterparts<br />\nfrom Franklin and Marshall,<br />\nbringing their seasonal record to<br />\n4-8.<br />\n'Key players for the JV squad<br />\nthis year have included Ken<br />\nSeusse, Bobby Weisner, John<br />\nDowning and Bob Kluttz, Jeff<br />\nEarle and Jim Fine. The squad<br />\nhopes to close its season on a<br />\nwinning note tonight when it<br />\ntravels to Washington College.<br />\n<br />\nshorts<br />\nThe Men's Varsity Wrestling<br />\nteam gained its first victory of<br />\nthe season last weekend when it<br />\ndowned Ursinus 35-18 as one end<br />\nof a four-way competition held<br />\nat Swarthmore College. The team<br />\ncloses out its season next<br />\nweekend when they travel to<br />\nElizabethtown, Pennsylvania to<br />\nparticipate in the MAC<br />\nchampionships meet.<br />\n<br />\nThe Women.'s varsity Fencing<br />\nTeam continues its season as it<br />\ntravels to Philadelphia tomorrow<br />\nafternoon to participate in a<br />\nfour-way meet at Temple<br />\nUniversity. In addition to facing<br />\ntheir hosts, the Lady Jays will<br />\nalso compete agains; the<br />\nUniversity of Pennsylvanih and<br />\nBrockport State College.<br />\nThe Men's varsity Fencing<br />\nTeam is sporting a 21-2 record<br />\nfollowing last week's 20-7<br />\ntrouncing of Haverford.<br />\n.1-omorrow, the Jays travel to<br />\nCollege Park to face Maryland<br />\nInd William and Mary. Victories<br />\nsiver both of these opponents<br />\nwould give the Jays a final record<br />\nof 23-2, the best in the team's<br />\nhistory.<br />\nThe Women's Varsity<br />\nSwimming Team closes out its<br />\nhome season tomorrow<br />\nafternoon with a meet- against<br />\nMAC rival Ursinus. Ursinus was<br />\nthe chief competition for the<br />\nJays at last year's MAC<br />\n'Thampionship meet and these<br />\nwo teams expect to battle it out<br />\ngain this year. The action begins<br />\n<br />\nat.2,;00.<br />\n<br />\n\fELisiGNE<br />\n<br />\npap, 14/news,letter/february 18, 1977<br />\n<br />\nWomen's basketball suffering from friction<br />\nBy DAVID KRAUS<br />\nWhen an<br />\nathletic team has strung together<br />\nseveral poor seasons, it is not<br />\nunnatural for friction to develop.<br />\nSuch a case is the Blue Jay<br />\nwomen's basketball team- a<br />\nsquad that has managed but one<br />\nwin in-the last three years and is<br />\n0-8 in the current campaign.<br />\nApparent dissatisfaction<br />\namong certain team members<br />\nsurfaced Tuesday evening in an<br />\narticle in The Evening Sun.<br />\nReporter Bob Ibach, writing a<br />\nstory on women's collegiate<br />\n-sports in Maryland, attributed<br />\nseveral quotes to JHU basketball<br />\nco-captain Rita Chang- quotes<br />\nthat reflected dissatisfaction with<br />\nHopkins coach Pat Harris.<br />\nRita, however, was unhappy<br />\nthat her comments appeared in<br />\nthe method that they did and<br />\nfeels that Ibach misquoted her.<br />\n\"I didn't appreciate my<br />\n<br />\ncomment about the basketball<br />\ncoach being pulled out of<br />\ncontext and printed,\" the junior<br />\nfrom Hastings-on-Hudson, N.Y.<br />\nexplained. \"My point was to<br />\nexpress dissatisfaction with the<br />\nresponsiveness of the Athletic<br />\nDepartment to the women.s<br />\nbasketball team.\"<br />\nIbach disagreed.<br />\n\"No, I don't believe I did take<br />\nher statement out of context,\"<br />\nthe reporter commented.<br />\nHopkins Athletic Director Bob<br />\nScott regretted that the<br />\ncomments came out in print.<br />\n\"People have rights to make<br />\nopinions or judgements,\" the<br />\nformer lacrosse mentor noted,<br />\n\"it's just unfortunate that these<br />\ncomments were aired publicly.\"<br />\nScott disagreed that the<br />\nAthletic Department has been<br />\nunresponsive to the needs of the<br />\nteam..<br />\n\"No one \" who is a member of<br />\n<br />\nthis current varsity team has been<br />\nto see me,\" he said. \"About ten<br />\ndays ago, however, someone who<br />\nis not a member of the team<br />\ncame to speak to me about the<br />\nwomen's basketball situation.\"<br />\nScott went on to say that this<br />\nwas the first such discussion he<br />\nhad had in the three years that<br />\nPat Harris had been the coach.<br />\nWhen asked about the article,<br />\nCoach Harris didn't \"care to<br />\nmake any comment.\"<br />\nDr. Joyce Hogan, the only<br />\nfull-time female instructor in the<br />\nJHU Physical Education<br />\nDepartment and a person whose<br />\nrecommendations Scott says lie<br />\n\"relies heavily on\" when hiring<br />\nwomen's athletic coaches, was<br />\nnot surprised at Rita's comments.<br />\n\"Rita's said this to me several<br />\ntimes, including last year,\" Dr.<br />\nHogan explained. \"In any<br />\nendeavor, you will get people<br />\nwho disagree no matter what. In<br />\n<br />\n\\<br />\n<br />\naddition to complaints, I've<br />\nreceived positive features<br />\nattesting to Coach Harris'<br />\ncompetence and to the fact that<br />\nthe women enjoy playing for<br />\nher.\"<br />\nDorthea Cypher, a sophomore<br />\nmember of the team, voiced such<br />\npositive sentiments about the<br />\ncoach.<br />\n\"She's the best coach I've ever<br />\nhad, \" Dorthea claimed. \"She's<br />\nbeen an excellent teacher.\"<br />\nDespite the problems that her<br />\ncomments have caused, Rita is<br />\nhopeful that some good will<br />\ncome out of it.<br />\n\"I can only hope that my<br />\ncomments, now said and done<br />\nwith,\" she explained, \"will<br />\nfurther facillitate<br />\ncommunications between team<br />\nmembers, their coaches and the<br />\nAthletic department.\"<br />\nThat is something that only<br />\nthe future will be able to reveal<br />\n<br />\n\"•••<br />\n<br />\nbOranC*<br />\n<br />\nCall toil free<br />\n6 to 9 p m<br />\n<br />\n(800) 325-4867<br />\nor see your travel agent<br />\n<br />\nathuTravel Charters<br />\nBUSINESS<br />\n<br />\niIPPOIITUNiTY<br />\n<br />\nStuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.226<br />\n102 Charles Street<br />\nBoston,Mass. 02114<br />\nJOHN GA-CH BO<br />\n<br />\nSHOP<br />\n<br />\nBALTIMORE'S LARGt•I<br />\nUSEij,BOOKT\"<br />\n<br />\n1<br />\n<br />\nr%11P<br />\n3322 Greenmount Avenue<br />\n467-4344<br />\nUSED AND RA- RE<br />\nOLD AND OUT—OF<br />\n<br />\nPRINT<br />\n<br />\n•••<br />\n<br />\nThe<br />\nchallenge.<br />\nYour challenge is to discover words of<br />\nfour letters in this pentagon. Discover<br />\nthem by following the straight lines to<br />\nand from the letters,forming words as<br />\n<br />\nle4n1/2errrg-d.<br />\n<br />\nBUSINF'SC OPPORTUNffY<br />\n<br />\nStuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.339A<br />\n310 Franklin Street<br />\nBoston,Mass. 02110<br />\n<br />\nyou go.You may not use two of the same<br />\nletters in any one word.lf you can make<br />\n30 words or more, you've met the<br />\nchallenge.<br />\n<br />\nyv-<br />\n<br />\nWhen there's a challenge,<br />\nquality makes the difference.<br />\nWe hope you have some fun with the challenge.<br />\nThere's another challenge we'd like to offer you, too.<br />\nThe Pabst challenge:<br />\nWe welcome the chance to prove the quality of<br />\nour beer. We challengeyou to taste and compare<br />\nPabst Blue Ribbon to any other premium beer. You'll<br />\nlike Pabst better. Blue Ribbon quality means the best<br />\ntasting beer you can get. Since 1844 it always has.<br />\n<br />\nPABST'. Since 1844.The quality has always come through.<br />\n0191/ PABST BRE- AfthiC)COMPANY Milwaukee NAs . Peoria Heights Ill Newark NJ . Los Angeles. Calif Pabst. Georgia<br />\n<br />\n\f", "format": "basic_html", "processed": "Gene-splitting, part one<br /><br />\nRecombinant DNA research starts to split ranks<br />\nBy ERIC GARLAND<br />\n\"In the name of improving human health, newer and<br />\nmore potent threats to human health are being developed<br />\nthrough the technology of artificial gene<br />\nimplanation.\"--Statement from Science for the People<br />\n\"During the past two years, much fiction has been<br />\nwritteen about \"recombinant DNA research.\" What<br />\nbegan as an act of responsibility by scientists, including a<br />\nnumber of those involved in the development of new<br />\ntechniques, has become the breeding ground for a horde<br />\nofpublicists -- most poorly informed, some well-meaning,<br />\nsome self-serving.\" -- Stanley Cohen, Science<br />\nAnother scientific storm has broken on the horizon. In<br />\nan era full of tussles over issues like nuclear energy.<br />\nchemical warfare, space programs and supersonic air<br />\ntransport, a new controversy has come out of the<br />\nlaboratory and started to break at local government<br />\nlevels, in the press, and on university grounds.<br />\nThis one is variously called \"recombinant DNA<br />\nresearch,\" \"gene- splicing,\" and \"genetic engineering.'<br />\nAll the terms refer to a basic concept of joining DNA<br />\nfragments -- the material that constitues genes an<br />\nprovides' the hereditary information for all life forms —of<br />\none organism to the genes of a carrier (such as a virus o<br />\nplasmid). This recombinant \"vector\" is then introduce(<br />\ninto the cells of another organism, where it may grow a:<br />\nan \"adopted\" gene. Current research mostly involves thl<br />\ntransfer of animal or plant genes to host bacteria cells.<br />\nBy using recombinant techniques, scientists lool<br />\nforward to tremendous benefits, while critics envisioi<br />\ndangerous scenarios. The debate, though, has a few<br />\nunusual features. The battlelines are not clearly drawn: a<br />\nnumber of leading biologists are strongly opposed to the<br />\ncurrent research, while others committed to<br />\nenvironmental safety in many areas welcome the new<br />\nOpportunities. And the guidelines and safeguards now in<br />\neffect for recombinant work came from within the<br />\nscientific community, before the research had begun in<br />\nearnest,<br />\nIn July 1973, at the Gordon Research Conference on<br />\nNucleic Acids, scientists recognized the potential hazards<br />\nof the new gene-splicing techniques and sent letters to<br />\nthe National Academy of Science, prompting the NAS to<br />\nset up a review committee and call for a moratorium on<br />\nexperiments pending investigation. An international<br />\nconference was also proposed, and in February 1975,<br />\n150 people gathered at the Asilomar Conference Center\"<br />\nin Pacific Grove, California, to discuss genetic<br />\nengineering and possible ways to deal with its risks.<br />\nThe report from Asilomar spurred a series of three<br />\nmeetings of the National Institutes of Health (NIH)<br />\nRecombinant Advisory Committee in 1975. The Director<br />\nof NIH, Donald Frederickson, then worked with his own<br />\nadvisory committee, going over specific guidelines drawn<br />\ntogether from the three separate meetings. Finally, in<br />\nJuly 1976, the NW issued its settled-on guidelines to<br />\nreplace the recommendations of the Asilomar<br />\nConference.<br />\nSo within three years, scientists had realized the risks<br />\nof their new research and had taken it upon themselves<br />\nto create a set of guidelines to regulate the work about to<br />\nbe done. This self-policing, before recombinant research<br />\nwent full ahead, is justly referred to as a foresightful act<br />\nof responsibility; ironically, it has also drawn the valid<br />\ncharge that \"the Committee authorized to write the<br />\nGuidelines consisted primarily of scientists interested in<br />\ndoing this research.\" That quote comes from Science for<br />\nthe People, a Boston-based group which includes some<br />\nprominent biology professors among its members. They<br />\nAn d other critics contend that the NIH Recombinant<br />\nAdvisory Committee -- with but one non-science advisor<br />\nrepresents a conflict of interest, asking the incendiaries<br />\nto put out the fire.<br />\nIn the introductiOn to the NIH guidelines,<br />\nFrederickson stated: \"Recombinant DNA research brings<br />\nto the fore certain problems in 'addressing the potential<br />\nimpact of basic science on society as a whole, including<br />\nthe manner of providing public participation in those<br />\nassessments,...lt is not surprising that scientists in other<br />\nfields and the general public have difficulty in<br />\nunderstanding advances in recombinant DNA research.<br />\nYet public awareness and understanding of this line of<br />\ninvestigation is vital.\" Last year, \"public participation\"<br />\nwas carried out in a heated manner in Cambridge. The<br />\nCity Council, after finding out about some planned<br />\nhigher-level risk experiments to be done at Harvard and<br />\nMIT, voted a \"good faith\" (since their action had no<br />\nforce of law) three-month moratorium on the reserach. A<br />\nreview board was established; last month, it gave the<br />\ngo-ahead to lower-level experiments.<br /><br />\nThe public hearings and council actions in Cambridge<br />\npolitical<br />\nbrought out dissension in faculty ranks,<br />\nopportunism on the part of some council members, and<br />\ncommunity backlash against the two schools. Dr. Robert<br />\nDot tin, a biology professor at Hopkins who had<br />\npreviously been at MIT, recalled that \"the experiments<br />\nwere frightening to some people. There were not<br />\nwell-regulated facilifies...I think that in Harvard's case<br />\nthere was reason to be concerned.\" He also noted that<br />\npeople around Harvard and MIT are \"concerned about<br />\nhow much input the public has. They feel the science is<br />\ntoo dangerous to be left to scientists alone.\"<br />\nOther cities where universities have proposed or are<br />\ndoing recombinant DNA research have taken action,<br />\nthough not on the level of the Cambridge moratorium.<br />\nReview committees in San Diego and Ann Arbor (the<br />\nlatter an in-university affair) made recommendations<br />\nabout research at the local universities; public hearings<br />\nand panels in Bloomington and Princeton brought out<br />\noften tense discussion on the recombinant work.<br />\nMeanwhile, two states (California and New York) are<br />\nmoving toward some sort of legislation to regulate the<br />\ngene- splicing research. As states ponder bills, it is<br />\nsignificant to note that the NIH guidelines are just that -guidelines, not regulations. Within the academic<br />\ncommunity, researchers are under heavy pressure to<br />\nfollow the guidelines, since they are usually funded by<br />\nthe NIH. And, as Dr. Robert Ballantine of the Hopkins<br />\nBiology Department explains, \"you can't get published<br />\nunless you've followed the guidelines. If there was a<br />\nquestion of perjury, your name as a scientist would be<br />\nmud...glory doesn't come from headlines in the New<br />\nYork Times. It comes with the publication of journal<br />\narticles.\"<br />\nIndustry, however, also has a stake in genetic<br />\nengineering. Currently, there are seven major<br />\npharmaceutical companies involved in recombiant<br />\nresearch; they are well aware of the ,N11-1 guidelines, but<br />\nonly have to accept them voluntarily. The corporations<br />\nare hesitant about any federally- adopted regulations<br />\nparallel to the guidelines that would require approval of<br />\nall research plans since disclosure would wreck patent<br />\nopportunities. At present, then, much secrecy surrounds<br />\nthe industry's research, as writers for the People's<br />\nBusiness Commission discovered after contacting<br />\ncompany representatives.<br />\nWhat they did find was an Interagency Committee set<br />\nup by then- President Ford last September, responsible<br />\n\"to review federal policy on the conduct of research<br />\ninvolving the creation of new life forms.\" This<br />\ncommittee, under the supervision of NIH, has many<br />\nmembers with backgrounds in industry, another possible<br />\nconflict- of-interest arrangement. As the PBC reported in<br />\nMother Jones magzine, \"a significant faction of the<br />\nInteragency Committee is urging that federal guidelines<br />\non recombinant DNA research be made voluntary and<br />\nthat the industry be left to police itself. In the unlikely<br />\nevent that the committee takes a tougher stance and<br />\nrecommends, for instance, the creation of a new<br />\nsuper-agency with enough money and muscle to closely<br /><br />\npolice all NDA research, look for the inductrv to resist.\"<br />\nThe committee's report, originally due in January, now<br />\nappears scheduled for March as the earliest release date.<br />\nWhether industry will follow the present NIH<br />\nguidelines -- which \"should be mandatory for anyone<br />\ndoing research,\" according to Dr. Eric Weinberg of the<br />\nBiology Department -- remains to be seen. A recent<br />\nScience article reports that industry spokesmen have<br />\nindicated a desire for some government agency to follow<br />\ntheir research, if only to get out of the \"fishbowl\" of<br />\nsuspicion they are now in.<br />\nIf an agency does come to have some responsibility for<br />\nindustry action (the NIH the most likely prospect),<br />\nhowever, it faces the problem the old Atomic Energy<br />\nCommission had: it would be charged with regulating an<br />\nindustry that it promoted at the same time. Viewing the<br />\nred tape the nuclear industry now encounters from AEC<br />\nspin-offs, the pharmaceuticai companies would certainly<br />\nfight any attempts at a purely regulatory body that could<br />\nseverely delay their research. The industry, after all, is<br />\ninvolved in a competitive situation and threats to patents<br />\nand the research behind those patents would not be<br />\ntaken lightly.<br />\nBesides academic and industry research, there remains<br />\nthe question of possible defense work in recombinant<br />\nDNA research. Some scientists have cited the effective<br />\nfailure of the Army to produce any controllable<br />\nbiological weapons when they engaged in that research as<br />\na reassuring sign. The new gene-splicing techniques,<br />\nhowever, would seem an unhealthy tool for defense and<br />\nintelligence workers to have, given the record of their<br />\nrecent practices.<br />\nReturning to the subject of the NIH guidelines: while<br />\nacademic researchers observe them, the following of the<br />\nregulations does not imply satisfaction. A straw poll<br />\ntaken by the Federation of AMerican Scientists found<br />\n;4% of the biologists and 32% of those in other fields<br />\nbelieved the guidelines to be \"probably insufficiently<br />\ncautious.\" At the same time, many scientists find them<br />\ntoo stringent; as Brown comments, \"I call it strict when<br />\nyou must work on a harmless bacteria under conditions<br />\nthat are more strict than those for disease- causing<br />\nbacteria.\"<br />\nWith increasing publicity about recombinant DNA<br />\nresearch -- especially information that can be strongly<br />\nbiased on one side or plainly wrong -- the controversy<br />\nseems to be heading toward more difficult regions, rather<br />\nthan smoothing out and passing over. Again from<br />\nFrderickson's introduction to the NIH guidelines, \"Public<br />\nresponsibility weighs heavily in this genetic research<br />\narea...the responsibility of the scientists involved is as<br />\ninescapable as is their opportunity to beneficially enrich<br />\nour understanding.\"<br /><br />\nNext week -- Reconzbinant DNA research at<br />\nHopkins;accounts of the benefits, risks,and<br />\nguidelines ofgene-splicing; and more.<br /><br />\npage 2/news-letterifebruary 18, 1977<br /><br />\nAnderson's investigators talk:<br />\nBy MARC DUVOIS1N<br />\nHarvard Theologian Harvey<br />\nCox is fond of suggesting that the;<br />\nmedical and legal professions<br />\ndraw up strict ethical guidelines.<br />\nSuch an approach, however,<br />\nmight be better applied to the<br />\npractice of journalism, if<br />\nWednesday's address by two<br />\noperatives of the Jack<br />\nAnderson -Les Whitten news<br />\nempire is any indication.<br />\nJim Grady, a University of<br />\nMissouri journalism graduate, and<br />\nJulia Rose, a recent alumna of<br />\nHopkins' School for Advanced ,<br />\nInternational Relations, are two<br />\nof the dozen or so anonymous<br />\nsoot -gatherers who keep<br />\nAnderson's nationally syndicated<br />\n\"Washington Merry-Go-Roundfull of the stuff that brings<br />\nknaves to justice, titillates the<br />\nsuburban readerships, and<br />\noccasionally showers disrepute<br />\non those who least deserve it.<br />\nTo work for Anderson, both<br />\nagreed, is to be affiliated with a<br />\nrevered American institution.<br />\nDisgruntled<br />\ngovernment<br />\nfunctionaries with an axe to grind<br />\ncontact Anderson first. Calls<br />\nmade in Anderson's name are<br />\nalways returned. Even demigods<br />\nlike Brent Scowcroft and<br />\nLawrence Eagleburger accord<br />\nhim an honor the Kennedy staff<br />\nused to accord James<br />\nReston-Anderson is never put<br />\non hold.<br />\nStill, Anderson needs a<br />\nconstant supply of soot to spread<br />\nthroughout his syndicated<br />\ntelevision, radio and newspaper<br />\nreports, and Grady, Rose. and a<br />\nstaff of eight or nine other<br />\ninvestigators work to provide it.<br />\nGrady, whyse parenthetical claim<br />\nto fame is his novel, Three Days<br />\nof the Condor, opened his<br />\nremarks by trying to dispel the<br />\npopular image of an investigative<br />\nreporter as '4a mysterious,<br />\ndisheveled figure in a<br />\ntrench-coat.\" In the process, he<br />\nestablished a new one, albeit<br />\nunwittingly-that of the young,<br />\naggressive social mover, the<br /><br />\nwalking, breathing \"instinct for investigation. \"The truth is the<br />\nthe jugular\" brought to life by best defense,\" he said, noting<br />\nDustin Hoffman in All The that Anderson's office has never<br />\nPresident's Men.<br />\nlost any of the countless libel<br />\nAfter taking potshots at some suits filed against it every year.<br />\nstationary targets-to wit, the<br />\nRose, recently emerged from<br />\nNational Enquirer, New Jersey the halls of academe, said she<br />\nCongressman Henry Helstoski, finds Anderson's influence and<br />\nand Toni Snyder-Grady said authority a powerful weapon in<br />\nthat Anderson's staff employs investigating officeholders. \"Jack<br />\none basic criterion in deciding is like an institution,\" she<br />\nwhether to disclose potentially remarked. \"He attracts tips,<br />\nembarrassing information about a news, and sources. If I'm having<br />\npublic official. \"We try not to dig trouble getting someone to level<br />\nup personal peccadilloes unless with me, I ask Jack to call him<br />\nthey affect someone's work,- he up. That usually does the trick.\"<br />\nShe said that Anderson's office<br />\nexplained. \"If Congressman X is<br />\nhaving an affair with his secretary is run on a basis of mutual<br />\nand they're both working hard, trust-between the investigators<br />\nfine. If not, it's a story.and their sources as well as<br />\nHe revealed the depth of his between Anderson and his staff.<br />\ncompassion for those whose \"You learn about people, about<br />\nnames have been unjustly who you can trust, and who's<br />\nblackened by Anderson's column lying. And it's amazing how<br />\nby observing: \"Jack's human.- much Jack trusts us, how much<br />\nAsked to comment on one of he'll put himself on the line for<br />\nAnderson's most egregious errors, us.\"<br />\nhis erroneous report that Senator<br />\nFollowing a brief question and<br />\nThomas Eagletoni<br />\nhad a answer session, Grady resumed<br />\nclandestine drunk driving record the tone of his speech, calling<br />\nto match his mental health editorial writers \"gutless,\" most<br />\nproblems, Grady replied: \"Jack newspapers \"hopeless,\" and the<br />\napologized.\" When it was Baltimore Sun \"a paper I've seen<br />\nsuggested that this was small maybe twice and can't comment<br />\nsolace for Eagleton, who never on.\" Just as well.<br />\nrecovered from that accusation,<br />\nBut like anyone associated<br />\nGrady elaborated: \"Jack<br />\nwith the Washington<br />\napologized.\"<br />\nestablishment, Grady and Rose<br />\nCold-blooded or not, Grady<br />\nwere good for some gossip<br />\nhad some astute observations to<br />\ntidbits, one of which merits<br />\noffer about the condition of the<br />\ntranscription here. Last Fall,<br />\nAmerican press. Most papers, he<br />\nAnderson's staff began to hear<br />\nasserted, suffer from what he<br />\nstrange, unflattering rumors<br />\ncalled \"afghanistanism\"-the<br />\nabout then-Speaker of the House<br />\nwillingness to deplore corruption<br />\nCarl Albert. With Anderson's<br />\nabroad while winking at local<br />\nconsent, several of the<br />\niniquities. \"Most papers are<br />\ninvestigators oid some light<br />\nafraid to call the Mayor a crook, digging into Albert's newfound<br />\nusually because the publisher<br />\ndisrepute and ascertained that<br />\nplays golf with him,\". he said.<br />\nthe Speaker had developed a<br />\n\"I'm for calling the mayor a<br />\npeculiar work habit. Every<br />\ncrook if he is one.\"<br />\nmorning Albert would sit in his<br />\nGrady advised prospective<br />\noffice for three to four hours<br />\njournalists to eschew journalism<br />\ntalking and sipping Ginseng tea<br />\nschool-\"All they can do is teach<br />\nwith a young, nubile disciple of<br />\nyou the libel laws\"-and to<br />\nThe Reverend Sung Myung<br />\ndisregard the threat of suit by the<br />\nMoon. Albert responded<br />\nsubject of an ongoing<br />\nindignantly to the investigators'<br /><br />\nThis week-end at Hopkins<br />\nThis week-end at Hopkins will also include the showing of \"Reefer<br />\nMadness- and \"Assassin of Youth\", the classic anti-marijuana films<br />\nproduced in the mid-1930's. The movies will be screened at midnight on<br />\nFriday, February 18 and Saturday, February 19, in Shriver Hall. They<br />\nwill be followed by a showing of an assortment of cartoons. Admission<br />\nis $1 per person, and all proceeds will go to Maryland NORML,-a<br />\nnon-profit, all-volunteer, statewide organization working to reform the<br />\nstate's marijuana laws. For furiher information contact Lou Curran or<br />\nJulie Landau at 889-5376.<br /><br />\nV<br /><br />\nThey have flexible morals<br /><br />\nJim Grady and Julia Rose<br /><br />\nbaffled inquiries. His office was<br />\nhis own business, she didn't<br />\ndisturb him, and besides, he liked<br />\ntea.<br />\nThe story was there, but the<br />\nAnderson people couldn't decide<br />\nwhether to print it. Certainly it<br />\nseemed a slender charge on which<br />\nt,o impugn the integrity of a<br />\nrespected legislator. But then<br />\nAlbert's morning visitor was in a<br />\nposition to do some powerful<br />\nlobbying for her cause, was she<br />\nnOt? It was decided the story.<br />\nwould run.<br />\nThere was another obstacle,<br />\nhowever: Albert would not talk<br />\nat length to any of the Anderson<br />\nstaffers. Les Whitten went to see<br />\nAlbert with Grady and some<br />\nother investigators. Still no dice.<br />\nFinally, Anderson himself called<br />\nup Albert, feigned alarm, and<br />\npleaded with the Speaker to<br />\ndissipate the \"pernicious rumors\"<br />\nhovering over his respectability.<br />\nAlbert agreed to meet with<br />\nAnderson's people over lunch in<br />\nthe Congressional dining room.<br />\nQuite a meeting.<br />\nSo anxious was Albert to<br />\nimpress the reporters with his<br />\nfitness that he boasted of having<br />\nalmost overcome his only<br />\nphysical impairment-a mild<br /><br />\nThe Johns Hopkins University<br />\ncampus will host a public forum,<br />\nentitled \"Voices of American<br />\nIndian Resistanca,\" on Saturday,<br />\nFebruary 19 at 8:00 p.m. in the<br />\nGreat Hall of Levering. The<br />\nspeakers will include Jimmie<br />\nDurham [International Indian<br />\nTreaty Council, AIM], Pauline<br />\nHaines [International Indian<br />\nTreaty Council], Billie Tayac<br />\n[Tribal leader, piscataway Nation<br />\nin southern Md.], and Tim<br />\nCoulter [Lakota Treaty<br />\nCouncil]. Also featured in the<br />\nprograrp will be the Piscataway<br />\nDance Group. A donation of $2<br />\nis requested. Tickets may be<br />\npurchased at the door. For<br />\nfurther information call<br />\n435-7995 or 426-1273.<br /><br />\ndegeneration of the throat<br />\nmuscles which occasionally<br />\nimpeded swallowing. Doctors had<br />\nadvised him, Albert revealed, to<br />\ntry to speak while masticating his<br />\nfood, as such an exercise would<br />\nstrengthen the atrophied muscles.<br />\nThe reporters grinned wanly at<br />\none another. Albert would not be<br />\nput off, and insisted on<br />\ndemonstrating the level of<br />\nproficiency he had attained in<br />\nfollowing this advice. \"I will<br />\ncarry with me to my grave,\" said<br />\nGrady, \"the vision of Carl Albert<br />\nsinging 'Mary Had A Little Lamb'<br />\nwhile chewing a Delmonico<br />\nsteak.\" This behavior was<br />\nthought to indicate a lack of the<br />\nsort of judgement one expects<br />\nfrom the Speaker of the House,<br />\nthe nation's third in<br />\ncommand -so it too was<br />\ndescribed in the column.<br />\ncan't say whether the rest of<br />\nthe audience was as disturbed by<br />\nGrady's steely demeanor and<br />\nflexible moral standards as I was.<br />\nThe spectacle confirmed my<br />\nsuspicion that Richard Reeves of<br />\nthe late New York magazine is<br />\nthe only political reporter<br />\ncapable of combining perception,<br />\ndaring and a measure of<br />\ncompassion.<br /><br />\n.february 18, 1977/news-letter/page 3<br /><br />\nOut with the myths<br />\nBe a part of life:<br />\nConsumer education!<br />\nBy D.H. WARREN<br />\nMyths seem to be a by-product<br />\nof civilization. This might not be<br />\nso bad if the myth did not have<br />\nthe power to distort reality and a<br />\nperson's view of - his/herself, if<br />\nmyths were seen as the fairy<br />\ntales that they are.<br />\nOne myth most people seem<br />\nto accept is that senility is<br />\ninevitable, and therefore there is<br />\nlittle hope for the elderly.<br />\nMedical dictionaries, including<br />\nthose recently published, define<br />\nsenility as \"old age,<br />\nfeeblemindedness.\" The<br />\nimplication is that because there<br />\nis no escape from the natural<br />\nprocess of aging, everyone will<br />\nbecome senile. It certainly instills<br />\na fear of growing old.<br />\nResearch in the area of aging,<br />\nhowever, has shown that. there<br />\nare only two kinds of physical<br />\nsenility which are irrever sible.<br />\nThese are the chronic brain<br />\nsyndromes caused by<br />\ndeterioration of brain cells (senile<br />\npsychdsis), and the hardening of<br />\nthe arteries, cutting off the blood<br />\nsupply to the brain,<br />\n(arteriosclerotic). Problems such<br />\nas the decline of memory or a<br />\nfeeling of uselessnes„ often<br />\nlabeled \"senility,\" can be<br />\ncorrected through therapy.<br />\nAppearance of tither of the<br />\nchronic brain syndromes,<br />\nhowever, does not necessarily<br />\nmean that the person will<br />\nbecome senile. Extensive<br />\npost-mortems have revealed that<br />\npersons with brain damage were<br />\nnot always senile during their<br />\nlives, and thattthe reverse is often<br />\ntrue for persons who were senile,<br />\n(i.e., they showed no brain<br />\ndamage.)<br />\nDeterioration of all living<br />\nthings is, of course, inevitable.<br />\nSenility, on the other hand,<br />\ndefined as the total or parlial loss<br />\nof mental facUlties, affects only a<br />\nsmall proportion of the elderly.<br />\nThe secret seems to be in staying<br />\nactive and involved, for senility<br />\ncan probably be self-induced,just<br />\nas beliefs in other myths will<br />\nmake a person see him/herself in<br />\na certain way.<br />\nEducation<br />\nThe Maryland Department of<br />\nHealth and Mental Hygiene, in<br />\nconjunction with the Action In<br />\nMaturity (AIM) department of<br /><br />\nthe Greater Homewood<br />\nCommunity Corporation, has<br />\nbegun a pilot project to train five<br />\nsenior citizens as lecturers in<br />\nconsumer education, specifically<br />\nin the areas of health and home<br />\nsafety. The program, which.will<br />\nhold its final class next week, will<br />\nenable the graduates to go out<br />\ninto the community and talk to<br />\ngroups about the subject matter<br />\nthey have studied.<br />\nThe students in the class, all<br />\nelderly women, are called<br />\n\"facilitators\", because they are<br />\nnot really teachers but rather<br />\ndistributors of information and<br />\nguides to. other services<br />\nBeginning March 4, the<br />\nfacilitators will be lecturing on<br />\nsuch topics as prescription vE<br />\nover the counter drugs, health<br />\nfrauds, quacks, medical<br />\ninsurance, and mental attitudes<br />\ntoward illness.<br />\nThe program has two main<br />\ngoals: to show that senior<br />\n.citizens can be very effective as<br />\nicommunity leaders and resource<br />\npersons, and that there is an<br />\ninterest and, need in the<br />\ncommunity for health and<br />\nconsumer education. The Md.<br />\nDept. of Health and Mental<br />\nHygiene is looking forward to<br />\ninstituting the program<br />\nstate-wide, if the Baltimore city<br />\n\"guinea pig\" proves successful.<br />\n;he ladies involved in the<br />\nprogram reflect the attitude that<br />\nmyths do not have. to keep<br />\npeople down. They are ready to<br />\ngo out and help their<br />\ncommunity, to open up the eyes<br />\nof people who might say, \"I've<br />\nread all I need to know about<br />\nhealth and safety!\" The folks<br />\nfrom AIM hope to make the<br />\ncommunity healthier and safer.<br />\nThe lectures will be presented<br />\non Fridays at the Church of the<br />\nGuardian Angel (27th St. &amp;<br />\nHuntingdon), March 4th, 11th,<br />\n18th and 25th at 12:30 p.m., and<br />\non Wednesdays at the Waverly<br />\nLibrary (33rd and Barclay<br />\nStreets), March 9th, 16th, 23rd<br />\nand 30th at 1:00 p.m. The<br />\nprograms are funded by the<br />\nBaltimore City Area on Aging.<br />\nThe more people that come, the<br />\nbetter they will like it. For<br />\nfurther information, interested<br />\npersons should call AIM at<br />\n889-7915.<br /><br />\nFanshen: politics and the arts<br /><br />\nrevolt in China. It .is more the<br />\nin-depth study and intuitive<br />\ninsight into the hearts and minds<br />\nof the Chinese people, and the<br />\ncomplex personal relationships<br />\nand power structures which arise<br />\nand prevail not only in China,<br />\nbut in many (other) societies as<br />\nwell.\"<br />\nThere is the hint, then, that<br />\npolitics is more than just<br />\nideology, armies, and revolt.<br />\nPolitics is evident throughout<br />\nhuman relationships: between<br />\nmen and women, teachers and<br />\nstudents, and bosses and workers.<br />\nFor politics is essentially a<br />\nquestion of power, of who does<br />\nwhat for whose benefit. This<br />\nidea, too, is foreign to the normal<br />\nconception which considers<br />\npolitics to be nothing beyond the<br />\nrough equivalent of<br />\n\"government.\" As Fanshen<br />\nshows, one of the most<br />\nimportant lessons of the Chinese<br />\nrevolution has been that politics<br />\nis everywhere.<br />\nSome of us may react to such<br />\nan assertion with disbelief,<br />\ndisagreement, or even -despair.<br />\nAfter all, does life have to be<br />\nserious all' the time? Can't we<br />\nenjoy some entertainment or our<br />\npersonal relationships without<br />\nalways having to worry about<br />\npolitics?<br />\nA certain amount of relaxation<br />\nand privacy is doubtless<br />\nnecessary for the enjoyment of a<br />\nhealthy life. But that is not<br />\nnecessarily inconsistent with an<br />\nEating Together Program: hot lunches at noon, weekdays. Church of the Guardian Angel, 27t 'St. &amp; understanding and respect for the<br />\npolitical and social relationships<br />\nHuntingdon, reservations needed.<br />\nwhich help shape each of our<br />\nWalking group to Hopkins Noon Series: first Wed. of every month, meet in front of the Homewood Friends<br />\nlives. Fanshen illustrates this<br />\nCenter, 3107 N. Charles<br />\n.<br />\nFrench Impressionist Art Course: every Thurs. in March, 4 p.m., Second Presbyterian Church, St. Paul &amp; point on two levels. First, within<br />\nthe play, it is demonstrated by<br />\nStratford Rd.<br />\nJohn Lombardi, Planning Project speaker: Thurs., March 3, 11:00 a.m., Homewood Friends Center, 3107 N. the Chinese peasants. As Boston<br />\nmagazine wrote, \"The play<br />\nCharles<br />\nemphasizes the human struggle to<br />\nDancing Class: Tues., March 8,11:30 a.m., Church of the Guardian Angel, 27th.St.&amp; Huntingdon<br />\nAlan Christian speaking on \"Life and Death\": Wed., March 16, 10:30 a.m., Rotunda Theater, Rotunda understand what the revolution<br />\nmeans personally.\" Second, the<br />\nShopping Mall<br />\nArts &amp; Crafts: Thurs., March 17,11:00 a.m., Homewood Friends Center, 3107 N. Charles<br />\n. audience will have the chance to<br />\nWomen in Literature Course: Tuesdays in April, lunch at noon, course begins at 12:30 p.m., Roland • enjoy a good, dramatic<br />\nproduction while simultaneously<br />\nEvergreen Center [Roland &amp; 40th], taught by Beverly Gold, Community College of Bait.<br />\nBy MARK HERTSGAARD<br />\nMany of us believe that there<br />\nis an implicit contradiction.<br />\nbetween politics and the arts.<br />\nArtistic expression is viewed as<br />\nseparate and distinct from<br />\npolitical ideology or causes. \"Art<br />\nfor art's sake\" is the only<br />\nrationale necessary for the<br />\ncreation or admiration of a piece<br />\nof art.<br />\nThe Hopkins community will<br />\nhave the opportunity to<br />\nexperience a different perspective<br />\non this question this Sunday<br />\nevening, February 20, when the<br />\naward-winning production of<br />\nDavid Hare's Fanshen is<br />\npresented at 7:30 pm in Shriver<br />\nHall. This explicitly political play<br />\nis the story of the efforts of a<br />\nsmall, Chinese village (Long Bow)<br />\nto carry out the socialist<br />\nrevolution between 1945 and<br />\n1949. Fanshen was adapted from<br />\nWilliam Hinton's documentary<br />\nbook of the same name which,<br />\nby focusing on a single<br />\ncommunity, highlighted the<br />\nstruggle of the entire Chinese<br />\npeople to \"fanShen\" -- to stand<br />\nup, to throw off the landlord's<br />\nyoke and to create a new world.<br />\nAs Comment magazine said,<br />\n\"The play is, however, much<br />\nmore than an historic record of<br /><br />\nMore AIM programs<br /><br />\n'<br /><br />\nbeing exposed 'o serious political<br />\nand historical questions.<br />\nIn --fact, the Little Flags<br />\nTheatre Collective, which is<br />\npresenting the play, expressly<br />\ntries to blend a political message<br />\ninto .each of its productions.<br />\nAccording to Hanna Lessinger of<br />\nGuardian, the group \"can<br />\nproduce theatre which is at once<br />\nmoving, entertaining,<br />\n'professional' in its standards and<br />\npolitically committed,\" without<br />\nalienating the normal audience.<br />\nIn addition, Maxine Klein, the<br />\nplay's director, is nationally<br />\nknown for her abilities as a<br />\ndirector and playwright in<br />\ncombining vivid theatricality<br />\nwith political impact. In Boston<br />\nshe has been named \"Best<br />\nDirector of the Year\" for two<br />\nconsecutive years. Ms. Klein has<br />\nsaid that one goal of the<br />\nproduction is to convey to the<br />\naudience the idea that , \"People<br />\ncan change the course of their<br />\nlives.\"<br />\nAt first glance this may not<br />\nseem to be so astounding a<br />\nstatement. People's lives are<br />\nalways changing. We all grow<br />\nolder, pick up new interests,<br />\ndiscard old ones, and so on. But<br />\nin the context of Ms. Klein's<br />\nquote and of Fanshen, the notion<br />\nof changing people's lives implies<br />\nsomething much broader. It<br />\nimplies the extended meaning of<br />\nthe word fanshen - \"the creation<br />\nof a new productive base, new<br />\nsocial relationships, new forms of<br />\nself - government, new ways of<br />\nthinking ...\" In essence, then, it<br />\nimplies the complete<br />\ntransformation of the entire<br />\nsociety.<br />\nFanshen provides the Hopkins<br />\n.:ommunity with the rare chance<br />\no see good, entertaining,<br />\ndolitical theatre. It should prove<br />\nto be a worthwhile time for all.<br />\nTickets for the 7:30 pm<br />\nshowing this Sunday night are<br />\nS2.00 and may be purchased at<br />\nthe Union Desk.<br /><br />\npage 4/news-letter/fehruary 18, 1977<br /><br />\nFilm review<br /><br />\nFellini's Casanova: The dreamlike images flow by<br />\nBy MIKE GIULIANO<br />\nItalian director Federico Fellini<br />\nwas not a happy man in August<br />\nof 1975. The negatives for the<br />\nfirst three weeks filming of his<br />\nfirst English language film,<br />\nCasanova, had been stolen along<br />\nwith a third of Pier Paolo<br />\nPasolini's \"Salo, or the 120 Days<br />\nof Sodom\" and Damiano<br />\nDamiani's \"A Genius, Two<br />\nAssociates and a Fool.\" Fellini<br />\nand his producer Alberto<br />\nGrimaldi estimated the value of<br />\nthe missing negatives to be in the<br />\nmillions. \"For me, the damage is<br />\nincalculable,\" Fellini told the<br />\npress. \"Not only would three<br />\nweeks of work be ruined if the<br />\nnegatives are not returned, but<br />\nthe entire planning of the film as<br />\nwell.\"_<br />\nThe undamaged negatives were<br />\nrecovered and production<br />\ncontinued. What, if anything,<br />\nhappened to his \"entire<br />\nplanning\"? The Casanova which<br />\npremiered last Friday at the<br />\nTowson theater is certainly not<br />\nlacking in visual brilliance—<br />\nindeed nearly every sequence is<br />\nbeautifully photographed, but<br />\nthe accompanying history of<br />\nGiacomo Casanova, though<br />\ncertainly not beautiful—and we<br />\nwouldn't expect it to be, isn't<br />\nbelievable either. The fault<br />\ndoesn't lie with actor Donald<br />\nSutherland so much as it does<br />\nwith director-screenwriter Fellini.<br />\nHe should've either strengthened<br />\nthe script, presented us with<br />\nempathetic characters and<br />\nsituations, or thrown the script<br />\naway and given us a succession of<br />\nstrikirg visual images.<br />\nFellini's rich pictures and<br />\nshallow plot are nearly<br />\nirresistable: one leans back, the<br />\ndreamlike images flow by, and,<br />\nenchanted with the sheer beauty<br />\none doesn't ask what it all means.<br />\nI can think of two possible<br />\ninterpretations. In the first we<br />\nhave a young Casanova, who<br />\nwhenever he is engaged in sexual<br />\ngymnastics is accompanied by a<br />\nmechanical, golden bird. The<br />\nconnection between the<br />\nmechanical movements of the<br />\nbird and the mechanical nature<br />\nof his own exploits is soor<br />\nobvious. His world is one with<br />\n\"undefined boundaries of<br />\namorous interest\" and he<br />\nmaintains a reputation<br />\nthroughout Europe for what<br />\nBurgess' Alex would call the old<br />\n\"in-out in -out.\" The sex is<br />\nfrenzied, often a contest, rarely<br />\nintimate. There are voyeurs,<br />\nconnoisseurs of the act, who<br />\nevaluate his performances.<br />\nNino Rota's music has a<br />\nmechanistic nature and contains<br />\nelements of the circus. It<br />\nenhances the image of Casanova<br />\nas a showman going through his<br />\nroutines. He performs, not just<br />\nfor his partner, but often for a<br />\ngroup. Sex for these people<br />\nseems to offer anything from<br />\npersonal physical satisfaction to<br />\nthe satisfaction of voyeuristic<br />\nimpulses, but tie idea that sex is<br />\nan expression of affection seems<br />\nforeign to them.<br />\n'Toward the end. an aged<br />\nCasanova. forsaken by Eros,<br />\ndecides to commit suicide rather<br /><br />\nthan live an impotent life. Ever<br />\nthe showman, he dresses in his<br />\nfinest clothes before walking into<br />\nthe Thames. He notices a giantess<br />\non shore, climbs out, and once<br />\nagain is immersed in an orgiastic<br />\nworld. He ends his days with a<br />\nmachine, a mechanical woman,<br />\nand when he makes love to her<br />\nwe conclude, naturally, that<br />\nlovemaking has become a rather<br />\ndesperate routine.<br />\nOn one level, the movie is no<br />\nmore that a succession of orgies<br />\nand Fellini is saying no more<br />\nthan that sexual license, while an<br />\nawful lot of fun, leads to no good<br />\nend. It's really the fantasy of a<br />\nCatholic schoolboy, an episodic<br />\nadventure in voyeurism on<br />\nFellini's part. Lascivious nuns,<br />\nthe erotic mysticism of the age,<br />\nand homosexual ballets are all<br />\nwonderfully naughty, and Fellini<br />\nallows us, vicariously, to share in<br />\nthe debauchery, giggle at these<br />\nextreme representations of our<br />\nown fantasies.<br />\nOur middle class repressions<br />\nare lifted, but a sense of guilt is<br />\ncatholic, because naughtiness,<br />\nhowever much fun it may by,<br />\nsimply isn't right. The old,<br />\nunhappy Casanova at the end of<br />\nthe film has gotten what he<br />\ndeserves. The audience has both<br />\nshared in his license and punished<br />\nhim for it. WI-r could be more<br />\nsimplistic and c, .1? Is Casanova<br />\nno more than a feast of<br />\nfireworks, spectacle and sex, a<br />\nsomewhat dreamy and classier<br />\nversion of the sort of escapist,<br />\nhedonis,.c and ultimately<br />\nmeaningless depravity which Ken<br />\nRussell continues to inflict upon<br />\nus?<br />\nAt times Fellini's Casanova<br />\nseems to be no more than Fellini<br />\nSatyrical set in the 18t1t century.<br /><br />\nCasanova does say: \"The prowess, but from the very<br />\nmanners of the Romans have not beginning he tells them about his<br />\nimproved since the days of prowess in engineering, literature<br />\nTrimalchio\" [a character in<br />\nand the occult. They don't reject<br />\nPe t ron iu s' Satyrical] Fellini his intellectual views so much as<br />\npresents us with suggestions as to they ignore them. When a body,<br />\nthe meaning of it all, but at the<br />\nnamely the Inquisition, does take<br />\nsame time he scorns any attempts<br />\nhis views seriously, Casanova is<br />\nwe might make to interpret these imprisoned.<br />\nvery suggestions. While a<br />\nCasanova's voice-over<br />\nhunchback is performing a<br />\nnarration to the film has the<br />\nhomosexual ballet one character same dry, ironic tone as in Barry<br />\nstates rather casually: \"You Lyndon [Are not both films<br />\nrealize it's symbolic.\" Symbolic extraordinary in a visual sense<br />\nof what? — the fact that Fellini's and deficient in plot<br />\nexcursions into his own personal construction?] Casanova's<br />\nfantasies are too cryptic for the<br />\nnarrative voice says that his<br />\nrest of us? Is it no more than an<br />\nescape from prison \"was favored<br />\nelaborate joke at our expense? of course by Fortune,\" but<br />\nWhen a girl plays a cello the<br />\nFortune usually seems to be<br />\ndubbing is awfully noticeable, it<br />\nworking against him. An escape<br />\nmust be intentional, but it seems from a Venice prison necessitates<br />\nto signify no more than that<br />\nan escape from \"Venice, my<br />\nFellini the artist is farting in the<br />\nbeloved city which I was being<br />\nfaces of his audience. It certainly<br />\nforced to abandon forever.\"<br />\ndoesn't make the movie any<br />\nDuring his travels through<br />\nmore creditable.<br />\nEurope, Casanova encounters his<br />\nI don't think audiences, as<br />\nbrother and his mother, but there<br />\nmuch as they enjoy sex and<br />\nis no love between them. He does<br />\nspectacle, will be satisfied with<br />\ncome to love a woman [I'm<br />\nFellini's versions of Petronius' happy and so afraid... I wish to<br />\nRome or Casanova's Europe, spend the rest of my life with<br />\nbecause audiences, once exposed<br />\nyou.\"], but another man gains<br />\nto such depravity, will — like the<br />\npower over her.<br />\ncharacters in Casanova -- demand<br />\nUnsuccessful in his attempts to<br />\nmore exotic forms of sex,<br />\nlove women and keep them, his<br />\nbody diseased and impotent, he<br />\nand they will never be<br />\nsatisfied, because depravity, walks into the Thames to join the<br />\nthough it stimulates and satiates souls of Horace, Dante, Petrarch<br />\nus, doesn't satisfy us.<br />\nand Ariosto. The giantess on<br />\nThat's one interpretation, one shore, a powerful and mysterious<br />\nin which the mechanical aspects woman, attracts him. Women<br />\nof sexuality were emphasized, send him into the river and bring<br />\nand the mind of Casanova wasn't him out of it. Love, for<br />\nmentioned at all. Another Casanova, is \"the sweetest of all<br />\npossible interpretation of deaths.\" Eros and Thanatos are<br />\nCasanova is dependent upon the once more brought together in a<br />\nfirst. The voyeurs, the audiences Venetian gentleman [Cf. with<br />\nwithin the film, appreciate<br />\nanother gentleman in Venice,<br />\nCasanova only for his sexual<br />\nMann's Aschenbach.] Ile can<br /><br />\nnever return to Venice, a city he<br />\nassociates with Descartes and<br />\nVoltaire.<br />\n\"I'm known all over Europe as<br />\na man of letters,\" Casanova<br />\nclaims, but all of the courts he<br />\nfrequents are debauched, and<br />\nthough the palaces are full of<br />\n.<br />\nworks of art, the people never<br />\nseem to notice that there are<br />\nRembrandts on the wall.<br />\nHe goes to bed with the<br />\nmechanical woman, but in this<br />\ninterpretation it is not symbolic<br />\nof the mechanical nature of his<br />\nlove. \"This machine was made by<br />\na poet,\" boasts Casanova of his<br />\nnew lover. \"Love, that is your<br />\nname,\" he tells her. Casanova<br />\nloves her as an artistic creation, a<br />\nthing of beauty. Or some such<br />\nnonsense.<br />\nHe ends his days as a librarian,<br />\n\"a position of considerable<br />\nimportance, in keeping with a<br />\nscholar and a man of letters,\" but<br />\nCasanova is not respected as a<br />\nscholar, is forced to eat with the<br />\nservants and soldiers. 'I am an<br />\nartist, I am an artist...You disgust<br />\nme,\" he curses them at dinner.<br />\nWhen he' appears in a fine<br />\ncostume to recite verses they<br />\nlaugh at the old man and he is<br />\nleft alone with - fantasies about<br />\nthe mechanical woman.<br />\nI can't conceive of any<br />\ninterpretation in which this „sex<br />\nmachine and frustrated scholar<br />\ncould be made to seem a<br />\n'creditable, character, Fellini's .<br />\npresence in every scene is too<br />\nstrong.<br />\nNaughty<br />\nFellini, once he got over his<br />\nAugust 1975 ,scare,. must have<br />\ngiggled a good deal on the set.<br />\nAfter all, Casanova is a naughty<br />\nfilm.<br /><br />\narts calendar<br />\nTheater<br />\nCenter Stage 700 N. Calvert Street, 332-0033. Lillian Hellman's \"Toys<br />\nin the Attic.\" Through March 6.<br /><br />\nDAR Constitution Hall 18th and D, N.W.(Georgetown) Al Stewart and<br />\nWendy Weidman on Feb. 26 at 8:30 pm.<br /><br />\nKennedy Center Opera House (Washington) \"Mark Twain Tonight\"<br />\nwith Hal Holbrook, through Feb. 19.<br /><br />\nThe Showboat Lounge 813 Ellsworth Dr, Silver Spring. 588-6226. Bill<br />\nEvans through the 20th.<br /><br />\nNational Theater 1321 E. St. (Washington) \"Bully,\" with James<br />\nWhitmore as Teddy Roosevelt. Through March 12. Call (302)872-0466<br />\nfor further information.<br /><br />\nBlues Alley 1073 Wisconsin Ave (Washington) 337-4141. Dizzy<br />\nGillespie, Feb. 21-26.<br /><br />\nKing of France Tavern Maryland Inn, Annapolis. 269-0990 from<br />\nArena Stage 6th St. and Maine Ave, SW (Washington) Lillian Hellman's Baltimore. Ethel Ennis.<br />\n\"The Autumn Garden.\" Through March 6. Call (202) 554-7890 for t<br />\nfurther information.<br />\nCenter Forum Old St. Paul's Church, Charles and Saratoga Streets.<br />\nString quartet performance at 12:30 pm and Lotus Band at noon on<br />\nTheater Project 45 W. Preston St. \"The Selection,\" an original work Feb. 22. Terry Snowdon plays music of Scott Joplin at noon on Feb.<br />\npresented by the Coda Theater Company and performed by Harvey 24.<br />\nLieberman. Through Feb. 20. Shows at 8 pm and 10 pm on Friday and<br />\nSaturday.<br />\nCathedral Concert Series 5300 N. Charles St. (Cathedral of Mary Our<br />\nQueen)Pianist Mary Stanton on Feb. 20 at 5:30 pm.<br />\nMechanic Theater Hopkins Plaza, 727-4103.\"A Chorus Line,\" through<br />\nFeb. 26. Coming on March 1 and playing through March 12 will be Liv The Cathedral Choir of the Mother AME Zion Church of New York<br />\nUllmann in Quintero's production of Eugene O'Neill's \"Anna Christie.\" presents a concert of black ,spirituals at 4 pm on Feb. 20 at the<br />\nArlington Presbyterian Church, 3215 W. Belvedere Ave. The 55<br />\nLeft Bank Jazz Society Famous BAllroom, 1717 N. Charles St., member choir will sing both traditional and contemporary<br />\n945-2266. Phil Woods Quintet on Feb. 20 at 5 pm. 55.50. 54.50.<br />\narrangements. Free.<br />\nConcerts •<br />\nPeabody Concert Singers- North Hall Peabody, Feb. 19<br />\nBaltimore Opera Lyric Theater, 120 W. Mount Royal Ave. Wagner's<br />\nat 8 pm.<br />\n\"The Flying Dutchman,\" Feb. 19 and 21, 8:15 pm.<br />\nPeabody Players Woodwind Quintet, Peabody Concert Hall, Feb.<br />\n23 at<br />\nnoon. Free.<br />\nBaltimore Symphony Orchestra Lyric Theater, Feb. 23 and 24, Zinman<br />\nof Rochester Philharmonic conducting Borodin's overture to \"Prince Civic Center Howard and<br />\nLexington. Dave Brubeck and Sons, tonight at<br />\nIgor,\" Prokofiefis Symphony Concerto for Cello and Orchestra with 8 pm. All seats $3. Charlie Pride<br />\ncomes in on Feb. 26 at 8 pm.<br />\nMihaly Virizlay, and Tchaikowsky's Symphony No. Four.<br />\nCellar Door in Washington, 34th and M Sts., presents<br />\nAndrew Gold<br />\nBaltimore Bach Marathon St. David's Church, 4700 Roland Avenue, through the 20th, Martin<br />\nMull and Steve Bishop on the 23rd and 24th,<br />\nFeb. 20 from 12:30 pm io 8 pm. Free admission.<br />\nPeter Allen Feb. 25-27. 337-3389.<br /><br />\n.febniary 18, 1977/news-letter/page.5<br /><br />\nAt Center Stage:<br />\nToys in the Attic<br />\nBy NED A. SOLOMON<br />\nAs the play unfolds the<br />\nSetting: A dilapidated house in individual characters discover<br />\nNew Orleans<br />\nthings about themselves they had<br />\nTinze: Summer [I believe Ms. ;kept hidden for years. I won't ruin<br />\nHellman wished it to be timeless] - it for you by revealing those<br />\nCharacters:<br />\nrevelations.<br />\nTwo old-maid sisters, Carrie and<br />\nCenter Stage suffers in the<br />\nAnna Berniers<br />\nsame way the Berniers sisters do:<br />\nTheir younger brother, Julian<br />\nit tends to perpetuate its<br />\nHis nymphette wife, Lilly<br />\nproblems. In every production I<br />\nHer strange mother, Albertine have seen this year there have<br />\nPrine<br />\nbeen some fine performances,<br />\nand a black man, Henry Simpson, unfortunately masked by some<br />\nmore than a servant to Albertine dreadful ones, which prevent the<br />\nConflict: Carrie, Anna and Lily<br />\nproductions from hitting their<br />\nall love Julian and want him to<br />\nmark.<br />\nsucceed, but when success finally<br />\nAnne Lynn [Carrie Berniers]<br />\ncomes they are frightened of does a commendable job as the<br />\nlosing him.<br />\nsister who has always loved<br />\nJulian, and portrays convincingly<br />\nToys in the Attic is a play the jealousy she feels for the<br />\nabout relationships, and how far other women who stand between<br />\nsome people will go to prove them. Lois Markle [Anna<br />\ntheir devotion and love. Anna Berniers] who gave the least<br />\nand Carrie Bernier are two convincing performance in, last<br />\nfixtures in a decrepit house, year's Old Thnes, fits the part<br />\nnothing more than the seedy well as far as her mannerisms go,<br />\nfurniture or the out-of-tune but her accent seems completely<br />\npiano. A feeling of status quo out of context in the New<br />\npermeates the hot summer air. Orleans setting. Ruby Holbrook<br />\nThey have dreams, but the was grandly enigmatic as<br />\ndreams are not really aspirations, Albertine Prine, but<br />\nthey are merely time-worn unfortunately some of her best<br />\nfantasies that are. best unfulfilled. scenes were played opposite<br />\nA day does not go by when a trip Walter Jones [Henry Simpson],<br />\nto Europe isn't discussed, or the who looked as if he'd only seen<br />\npossibility of selling the house; or the script five minutes prior to<br />\nthe possibility of Julian curtain. I have never seen a<br />\nbecoming a success. Lines like \"I performance more void of acting,<br />\n'always have\", \"it always was\", and this intrigues me when I am<br />\n\"it always has been\", are supposedly viewing<br />\nconstantly uttered as everything \"professional\" theatre. When<br />\nperpetuates itself. Above all they Henry leaves Albertine [do not<br />\nhave each other, and the love of a despair, I.ve spoiled nothing] in<br />\nbrother they have always taken the final reel the audience is truly<br />\nshocked, simply because there<br />\ncare of.<br /><br />\nBy DAVID SIEGMAN<br />\nLight begins to fill the tiny<br />\ndark stage and in a sudden burst<br />\n\\ of life, a man runs—no,<br />\ngallops—onto the stage. He<br />\ncontinues to gallop along the<br />\nouther edge 'of the stage, the<br />\nworn, creaky floor which is the<br />\nstage at .the Baltimore Theatre<br />\nProject. The stage is bare except<br />\nfor a ladder in the center.<br />\nThe man is wearing a Duron<br />\npainter's 'cap, a scarf around his<br />\nneck and mouth, gym shorts and<br />\nT-shirt, one tennis shoe, and one<br />\nfurry boot. Three young girls<br />\nsitting in the audience begin to<br />\ngiggle uncontrollably. Soon, their<br />\nheads will slowly turn, their eyes<br />\nkill meet, and their laughter will<br />\nsubside and be converted into<br />\none jolting three-way magnetic<br />\nshudder. For they will realize<br />\nthat the man on the stage is mad.<br />\nMadness as a means of artistic<br />\nconveyance is, in this<br />\np6rformance, deafening. The<br />\nviewer's perceptual faculties are<br />\nhypnotized and transfixed at one<br />\nraging, explosive focal point.<br />\nThat focal point, is Harvey<br />\nLiberman. His madness is<br />\nfrightening; it is as convincing as<br /><br />\nO'<br /><br />\nTOYS IN THE ATTIC will be playing at Center Stage, 700 N. Calvert St. through March 6.<br /><br />\nhas been no character motivation<br />\nto warrant it.<br />\nBeeson Carroll [Julian<br />\nBerniers] gives the most winning<br />\nperformance, playing the<br />\nprodigal brother like Robert<br />\nPreston played the Music Man.<br />\nHis expressions, mannerisms and<br />\nmovements are a pleasure to<br />\nwatch, and at all times he has<br />\ncomplete command of a very<br />\nlarge stage. Deborah Offner's<br />\n[Lily Berniers] performance is a<br />\ndifficult one to criticize. She had<br />\nsome captivating moments and<br />\nsome truly dead ones. With the<br />\nhelp o-f some expertdirection she<br />\nmight have portrayed a complete<br />\ncharacter and won the audience<br /><br />\nover.<br /><br />\n.the madness of \"Marat Sade,\" the uncontrollable<br />\nand as convincing as the madness fire—Lieberman. He floats in and<br />\nout of time:. in and out of<br />\nof an Elie Wicsel character. It is<br />\nthe madness of a tortured soul—a emotional states. First, his eyes<br />\nattack; white shiny opals<br />\ntortured Jewish soul.<br />\nHarvey Liberman is a young stretched wide, piercing, jabbing,<br />\nactor from New York. He is the judging. And then his limbs; steel<br />\nfire and the ash that envelop swords, flashing, searching. His<br />\nvoice is a constant cacophonous<br />\n\"The Selection,\" a one-man show<br />\nabout the Holocaust. Lieberman<br />\nwhine, like the sirens before the<br />\nfirst worked with Joel Benenson, air attack.<br />\nthe director of the show, in<br />\n1971. The two separated shortly<br />\nThe attack is a success.<br />\nthereafter, but were reunited in<br />\n1973, and with several other The audience is shamed, it is<br />\nartists formed Coda Theatre<br />\nCompany. \"The Selection\" is stunned, and it is pained.<br />\ntheir first piece and it is<br />\nunremitting in its ravishment and<br />\nprovocation of the human<br />\nWhen Lieberman finally stops<br />\ngalloping around the stage, he<br />\nconscience.<br />\nWork was begun on \"The sucks in the audience's stares and<br />\nSelection\" in April of 1976 as a we suck in his stare, and he asks,<br />\nreaction to the concentration in a sing-song, in a cackling<br />\ncamp butchery of World War II. German accent, \"Auschwitz?<br />\nBenenson and Lieberman explain Have you ever heard of<br />\nthat the piece is not intended to Auschwitz?\" And then he<br />\nillustrate the sadistic brutality of 'gallops, but the stage, like the<br />\nthe German camps, rather it is planet, is circular; there are no<br />\ntheir personal reaction to the exits, no escapes. The voice is<br />\nnightmare.<br />\nITTOst Painful. It is haunting.<br />\nSelection\"<br />\nis<br />\na<br />\nAnd finally, his whole body.<br />\nsuccessful<br />\n\"The<br />\nattack. There is no escape from attacks. Lieberman cringes in a<br /><br />\nBut the play lacked that<br />\nexpert direction'. Stan<br />\nWojewodski, Jr., who employed<br />\nsome very subtle effects in the<br />\nhighly successful She Stoops to<br />\nConquer, seems to go somewhat<br />\noverboard here, a direction one<br />\ncould 'see surfacing in Red Ryder.<br />\nOne of the most dramatic,<br />\nnoments in the play centers<br />\ntround a blood-stained Julian,<br />\nwho has just returned from a<br />\nfight. It is downright humorous<br />\nwhen Julian comes bouncing in,<br />\nnearly as energetic as the first<br />\ntime we meet him, but this time<br />\nwith the addition of about<br />\ntwenty-seven bloodied knife<br />\nwounds and several gashes across<br />\n.his face. The set, instead of being<br /><br />\n,<br />\ncorner and slowly, painfully',<br />\nremoves his absurd clothing. His<br />\nuniform is absurd as the uniform<br />\nof the concentration camp<br />\nprisoner, and the S.S. guard, and<br />\nall uniforms, are absurd. The<br />\nNazi craving for uniformity is<br />\nreduced to its senselesS'absurdity.<br />\nIt is clear that he is a dancer; a<br />\nmost of sculpted flesh. and<br />\nmuscle. The actor cringes, as if he<br />\nashamed„ of his body. He is<br />\nashamed of the body; the selfish<br />\nshell that smothers the soul. He<br />\nmakes me feel ashamed of the<br />\nbody.<br />\nWhen I am naked, I am at the<br />\nlowest Point of human<br />\ndegradation. I lie on the floor, a<br />\nlump of human\" being. Like a<br />\npiece of discarded clothing,<br />\ncompletely broken...<br />\nLieberman describes. In the end,<br />\nhis body is exhausted, \"insensible<br />\nto the seasons.\"<br />\nThe actor climbs the ladder<br />\nand beseeches God in Hebrew, in<br />\n'Yiddish , in German, and in<br />\nEnglish. He cries out poetry and<br />\nsongs; fragments of images and<br />\nphilosophy spew forth. He cries<br />\nto the God of all mankind, the<br />\nGod who is too often deaf to the<br /><br />\ndilapidated, appears to be a cave.<br />\nIn a black comedy this might be<br />\napproptiate, but it seems out of<br />\nplace here. The backdrop is as<br />\ntacky and distracting as it was in<br />\nRed Ryder, and the actors are<br />\nasked to perform some incredibly<br />\nstereotyped movements that I'm<br />\ncertain \"experienced\" actors are<br />\nfar beyond.<br />\nFascinating<br />\nIf you can see through the<br />\nlmateurish aspects of this<br />\nproduction, there is an excellent<br />\nplay underneath [with some very<br />\ngond acting], full of fascinating<br />\nr. velations concerning<br />\nrelationships and the human<br /><br />\nsupplications of the Jewish<br />\npeople. Then he stops. God<br />\ncannot hear his cries.<br />\nHe whispers, \"Shema Yisroel,<br />\nAdonai Elohanu, Adonai Echad.\"<br />\nThe actor, clad only in his<br />\nunderwear, looks up from the<br />\ntop rung of the ladder and asks,<br />\n\"How do you sit so quietly?\" He<br />\nis not talking to God now, he is<br />\ntalking to mankind. And<br />\nsuddenly, the audience must<br />\nrealize, that he is talking to<br />\nthem. The attack is a success.<br />\nThe audience is shamed, it is<br />\nstunned, and it is pained.i<br />\nThe Theatre Project is a<br />\nperforming arts<br />\n'community<br />\ncenter, offering free weekly<br />\nperformances by touring<br />\ncompanies in theatre, dance and<br />\nmusic, as well as community<br />\n'.:lasses and workshops.<br />\nPerformances are free and if<br />\nyou'd like to help keep it that<br />\nway, please donate after the<br />\nshow.<br />\nPerformances of \"The<br />\nSelection\" will be shown this<br />\nweekend on Friday at 8:00 and<br />\n10:00 p.m., on Saturday at 8:00<br />\nand 10:00 p.m., and on Sunday<br />\nat 8:00 p.m.<br /><br />\npage 6/news-letter/fehruary 18, 1977<br /><br />\nJoachim bluncn_<br /><br />\nThe following is a transcript of an interview with the<br />\ndistinguished Georgia poet James Duckey, who<br />\nformerly held a chair in poetry at the University of<br />\nSouth Carolina. The interview was conducted by<br />\n\"Tomorrow\" show host Tom Unguent .<br />\nTom:<br />\nProfessor Duckey, you've been called the poet<br />\nlaureate of the new Caner administration. Do you<br />\naccept that title?<br />\nDuckey: Call me Jam, Tom. Please do. Yeah,<br />\nAh've known Jemmy Kotter one hail of a long tom<br />\nbut ah ain's show he have a lariat. Now ole Lendon<br />\nJawnson he had himsef a lariat but thet came with<br />\nbein' a Texan, ya know.<br />\nTom: HAH HAH HAH HAH But let me ask you<br />\nthis, sir. Your services have been in great demand<br />\nlately as an interpreter of the Southern experience,<br />\nas someone who understands the South, isn't that<br />\nright?<br />\nDuckey: Tom, ah don't have to 'tend to unstan'<br />\nthe South. Ah am the South.<br />\nTom: I once worked in Savannah at a 500-watt<br />\nradio , station and I confess I came to like fried<br />\nchicken.<br />\nDuckey: That's dayum big of you, Tom.<br />\nTom: But no the kind of fried chicken they sell<br />\nup North.<br />\nDuckey: Cose not. It ain't the real thang.<br />\nTom: What is the real thing?<br />\nDuckey: Ali lived in Etlanna long nuf to know<br />\nthat Co-Cola is the real thang. Tom, ah thank ef you<br />\n- penned me down ali'd prolly say the greatest Suthun<br />\nconchabutions to whir-uld culchuh is fried chicken<br />\nand Co-Cola. But they is more conchabutions<br />\nbesides that even. They is my novels and my<br />\npoultry, they is the Marshall Tucker Band and<br />\nCharlie Daniels, they is the cullud music rum<br />\nNarlinz...<br />\nTom: Let's not forget ham and red gravy. I really<br />\nlike that.<br />\nDuckey: Red-eye gravy. Yes, that's damn good of<br />\nyou,Tom, to minchun it.<br />\nTom: I never liked okra, though.<br />\nDuckey: You'll learn to lahk it. See, we Suthruns<br />\nis in what you might call the ascendancy rat now.<br />\nTom:. And I can't stand hog maws, collards. and<br />\nblackeye peas.<br />\nDuckey: Now ali'm wif ya they-uh. Thet's mosely<br />\nwhin cullud folks eat, idinit?<br />\nToni: We could talk about the delightful Southern<br />\ncuisine all night. Jim, but let's get on, to your poetry.<br />\nFirst of all, what is your definition of poetry?<br />\nDuckey: Don't have none. But Ah lahk whin<br />\nNashville poet John R. Sryg,ley once said bout<br />\npoultry. He said poultry is the elusive gift of clarity<br />\nfrom the gods.<br />\nTom: Does poetry have to rhyme, Jim? A lot of<br />\nour viewers might be concerned because your own<br />\npoetry - I should say the little I've read of it - I mean<br />\nit didn't have any rhyme scheme. you know?<br />\nDuckey: No. Tom, poultry don't hafta rahm. It's<br /><br />\nJames Duckey:<br />\nThe poet lariat<br />\nof the Kotter<br />\nAdministration<br />\njust gotta be profoundly insahtful. Tilers whut<br />\nmakes it poultry in the fust place. It's the quality of<br />\nthe insaht en the unique way it's exprayussed.<br />\nTom: Speaking of expression, Jim, I have to say<br />\nthat people from other parts of the country often<br />\nhave trouble taking Southerners seriously because of<br />\ntheir - well, to use your own words, their unique<br />\nquality of expression. Do you follow me?<br />\nDuckey: Assolutely, Torn. You mean Yankees<br />\nthank we stupid cose we all sound lahk kickuhs,<br />\neven ef we is Ph. D.'s.<br />\nTom: Yes, Jim, that's exactly what I.meant.<br />\nDuckey: It don't bother ine.<br />\nTorn: Well, that's good, Jim. I just wanted to get<br />\nthat out of the way so we could go on to your<br />\nfamous inaugural poem. I especially wanted you to<br />\nshare it with those of us who were unable to attend<br />\nthe inaugural gala.<br />\nDuckey: Be glad to. Goes sumfin lahk this...<br />\nNote: The following poem was written by Professor<br />\nDuckey for the inaugural of President Carter.<br />\nThe Strength of Tissue<br />\nBy James Duckey<br />\nForce-feed a small town always does.<br />\nGiven the goose.<br />\nWhat field-force can be,<br />\nMagnetizing the small civic lynchings over<br />\nA cross burning near home?<br />\nMen smile not like he does<br />\nTransfigured now, but we are around him around<br />\nhim -like the strength of solid blocs. The starry flag<br />\nfloats on<br />\nAbove him in office - Tell me, transition- voice,<br />\nWith all your inside dope,<br />\nwhat I can have<br />\nDear Lord of all the flies<br />\nwhat can you do for me?<br />\nTV-lights, image and orthicon, quiet and all-present<br />\nIn the homes of Men, tell me how to do it how<br />\nto campaign how to influence and win the source<br />\nOf the power he now has<br />\nlong as a month, and rising<br />\nWith the level of our expectations<br />\nAll us folks around, the hope of sleeping men<br />\nYou? I? What does it matter now? We have all be, a<br /><br />\nsaved<br />\nby a secret ballot. Now as I pack my knife<br />\nand you roam with me we know hunger<br />\nis close to the source of jobless men<br />\nSearching streets for fields of green<br />\nWe know the end is in sight we know we will be<br />\ncaught<br />\nTell me, freight- train,<br />\nnow that no one else is listening,<br />\nWhat did Thomas Wolfe see in you?<br />\nHunger, time, and the river:<br />\nI should have known<br />\nthe phrase lying on the brain<br />\nas in a pool of stagnant water as on a plate of grits<br />\nLord, let me shake off the past<br />\nWild words can always leap<br />\nFrom faded strength Everything comes down to<br />\nthat.<br />\nWords and nothing but grants. More honors, Jimmy<br />\nOf the renewing green. That is where we'd like you<br />\nto start:<br />\nWith important things. More kindness to us poets<br />\nwill do nothing less than save<br />\nevery no-counter<br />\nword-juggling<br />\nhand-biting<br />\nnight-crawling one of its<br />\nMy life depends on the word. I will take, what I<br />\ncan get.<br />\n(After the inaugural poem is read aloud, Toni<br />\nUnguent resumes his interview.)<br />\nTom: That was just beautiful, Jim. It certainly did<br />\nnot lack clarity. I think the President and all the<br />\nnation got the message loud and clear.<br />\nDuckey: Thank you, Tom.<br />\nTom: Now you are a novelist as well as a poet.<br />\nAre. you 'working on another novel at this time?<br />\nDuckey: Yes ah am. Mali fust novel was a great<br />\nsuck -sayiss and twined into a inajuli motion<br />\npick-shuli wif Butt Rinnalls. Ali hope the next one<br />\ntunns out as good. It.s called Redemption and it's<br />\nabout five middle-aged white Etlanna businessmen<br />\nwho feel the honor of their race has been hutt by<br />\nthe revelations of Alex Haley's book. So whut they<br />\ndo is challenge an enner-city' black high school<br />\nbasketball team to a game.<br />\nToni: What an interesting premise for a novel!<br />\nCan you tell us how it turns out?<br />\nDuckey: Ah cain't keep any secrets fum you,<br />\nTom. Three of the five die of massive hot attacks rat<br />\nthey-uh on the coat. Whut happens to the othuh two<br />\nis the suhproz inding.<br />\nToni: TBest of luck with the book, Jim. It's really<br />\nbeen a pleasure having you on the show. I'm only<br />\nsorry NBC was too cheap to hire an interpreter.<br />\nHAH HAH HAH Good night, and have a good<br />\ntomorrow.<br /><br />\nfebruary 18, 1977/news-letter/page 7<br />\n,<br />\n'•.\"4'.-0<br />\n'•WW..<br />\n•<br />\n. 4'W\"4W•'•411\".\".\"*\".\"•'•'<br />\n. ••-VWV***'•'•'•\"*\"<br />\n'<br />\nI<br />\n4<br />\nI<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br />\nI<br />\n4<br />\n4<br />\nI<br />\n4<br />\nI<br />\n4<br />\n4<br />\nI<br />\n4<br />\n.<br />\n4<br />\nI<br />\n4<br />\n4.<br />\nI<br />\n4<br />\n4<br />\n.<br />\nI<br />\n4<br /><br />\nPOETRY READING<br /><br />\nROBERT PENN WARREN<br /><br />\no<br /><br />\nWEDNESDAY, FEBRUARY 23 at 4:00 P.M.<br /><br />\n1<br />\nI<br />\nI<br /><br />\nl4<br />\n44<br />\n4<br />\n:4<br /><br />\n4<br />\nGarrett Room, Milton S. Eisenhower Library<br /><br />\no<br />\n1<br /><br />\n4<br />\n4<br />\n1<br />\n4<br />\n1<br /><br />\nThe Johns Hopkins University, Homewood Campus.lt<br />\n1<br />\n4<br />\n1<br />\n4<br />\n1<br />\n1<br />\n4.<br />\n4<br /><br />\no<br />\n1<br /><br />\n44<br />\n1.4<br />\nSponsored by the Department of English,<br />\nHumanities Center and the Writing Seminars<br /><br />\n1<br /><br />\n4<br /><br />\n4<br />\n4<br />\n1<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br /><br />\nOpen to the public without charge<br /><br />\n0.41.4046..410%<br /><br />\n4<br />\n4<br />\n4<br />\noft<br /><br />\nCommemoration Day.<br />\nExercises<br />\nin celebration of<br />\nthe One Hundred First<br />\nAnniversary of the<br />\nFounding of<br />\nThe Johns Hopkins<br />\nUniversity<br />\nTuesday February 22 3PM<br />\nShriver Hall Auditorium<br />\nHomewood Campus<br /><br />\n4<br /><br />\n44<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br /><br />\nL<br /><br />\nAll students are cordially<br />\ninvited to attend<br /><br />\nAddress by<br />\nRobert Penn Warren<br />\nNovelist<br />\nPoet<br /><br />\n..............<br /><br />\n0:00:STA<br /><br />\nig<br /><br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•••<br />\n•<br />\n•<br />\n•<br />\n•<br />\n••<br />\n•<br />\n•<br />\n•<br />\n•<br />\n••<br />\n•<br />\n•<br /><br />\nA GOOD WAY<br />\nTO SPEND<br />\nA WEEKEND<br /><br />\n•<br /><br />\na<br /><br />\nProduced By: The U.S.—China People's Friendship Association, the JHU Women's Center,<br />\nthe Office of the Chaplain, the JHU Organization Against World<br />\nHunger, and the JHU Social<br />\nCommittee<br /><br />\n•<br /><br />\nLITTLE FLAGS THEATRE COLLECTIVE<br />\nBOSTON, MASSACHUSETTS<br />\n•<br /><br />\nPre5ents<br /><br />\nFANHEN<br />\nWritten by David Hare,<br /><br />\nAttention: College Students<br /><br />\nDireci-Exi by Maxine, kle,r<br /><br />\nA LIVING- PLAY ABOUT<br />\nTHE CHINESE REVOLUTION<br />\n41<br />\n\"<br />\n.<br /><br />\nCOME TO A SHABBATON.<br /><br />\nii<br /><br />\nFeb. 25-26 at Shaarei Zion<br /><br />\n$12 includes:<br />\nCatered meals<br />\nHousing<br />\nSpeakers On Feminism, the Holocaust<br />\nIsrael, &amp; Anti-Semitism<br />\nEncounter Groups<br />\nSat. Nite Theatre Tickets<br />\nAnd A Midnight Concert<br /><br />\n•<br /><br />\n-g<br /><br />\n(SI<br /><br />\n-g<br /><br />\nAll<br />\n• mar<br /><br />\nFor More Information and Reservations<br />\nCall Seth at 542-4900 ext.137<br /><br />\n1.1<br /><br />\n1111 1111(1 ii.<br />\n'.i,IT)HI<br /><br />\npthri..1 O..<br />\nII.nr. I<br />\n.<br />\nt't 101 1,1 .1N1111,<br /><br />\n\"Im”,1kAnApOilni.“IntrInx<br /><br />\ntickets available at.<br />\nSunday,Feb.20, 1977,7:30 pm<br />\n_UNION DESK<br />\nShriver Hall Johns Hopkins U. JOHNS HOPKINS UNIVERSITY<br />\nADMISSION $2.00<br /><br />\n_31st STREET BOOKSTORE<br />\n31st ST. AT GREENMOUNT AVE<br /><br />\n1<br /><br />\nNEWS-LETTER Tail-Gunner Joe' needed more<br />\nvol. lxxxi, no. 33/friday, february 18, 1977/81st year<br />\neditor-in-chief<br />\nbusiness managers<br />\nmanaging editor<br />\nfeatures editor<br />\nsports editor<br />\ngraphics editor<br />\nphoto-production manager<br /><br />\nEric Garland<br />\nVanessa Evan,Carole Jaffe<br />\nDavid Hawk<br />\nJ D Considine<br />\nDavid Kraus<br />\nScott Marks<br />\nJennifer Bishop<br /><br />\nThe Jonns Hopkins News-Letter is published twice weekly, Tuesday<br />\narm<br />\nFriday, during the academic year. It is printed at Frank White's<br />\nvery own<br />\nCentaur Press out in Westminster. Editorial and business correspo<br />\nndence should<br />\nbe directed to Box 1230, The Johns Hopkins University,<br />\nBaltimore, Md.<br />\n21218. Telephone (3010) 338-7647. Business hours are<br />\nMonday and Thursday<br />\nafternoons. Hey hey hey,<br />\nDNA..<br /><br />\nhustle<br />\nLast week's conviction of Larry Flynt in a Columbus,<br />\nOhio court is another sign of the troubles the Suprem<br />\ne<br />\nCourt invited with its ruling on obscenity a few years<br />\nago.<br />\nFlynt was sentenced to seven to twenty-five years and fined<br />\n$1,000 for his actions as publisher of Hustler that led to the<br />\nmagazine finding its way into the hands of decent<br />\nColumbus citizens.<br />\nNow Hustler may have no more socially redeeming<br />\nfeatures than, say, the News-American, but the conviction<br />\nraises two disturbing points beyond the question of<br />\nobscenity. First, one of the charges against Flynt was<br />\nengaging in criminal conspiracy -- as publisher, he was<br />\nresponsible for the magazine's distribution -- and thus could<br />\nbe dragged into court from anywhere in the country. The<br />\nthreat of prosecuting any employee involved in<br />\na<br />\nnationally-distributed media offering (as happened<br />\nin<br />\nGeorgia with a bit .actor in Deep Throat) for the<br />\nlocal<br />\ncriminal activity is ludicrous, to say thc least.<br />\nThis goes along with the second problem, namely that<br />\nthe Supreme Court's decision to leave obscenity<br />\nto<br />\n\"community\" standards opened the door for<br />\nnarrow-minded case-hungry District Attorneys to haul in<br />\ntheir favorite objectionable person. Since community<br />\nstandards are just about whatqer the local DA decides<br />\nthem to be, the First Amendment is in for serious trouble<br />\nin<br />\nmany areas of the country.<br /><br />\nletters to the editor<br />\nTo the Editor:<br />\nI am writing in response to an<br />\nad placed in the Friday edition of<br />\nthe Johns Hopkins University<br />\nNews-Letter. I found this ad to<br />\nbe in extremely bad taste and<br />\noffensively sexist. If this<br />\nrepresents the attitude of the<br />\nBETA crowd perhaps it is best<br />\nthat they stay wherever they are<br />\nnow. I know that in the name of<br />\n\"freedom of the press\" we tend<br />\nto print anything requested,<br />\nhowever. I would hope that as<br />\nwomen in responsible positions<br />\n(and you do have such positions)<br />\nyou would lend some support to<br />\nelimination of sexist<br />\nadvertising by refusing such an<br />\nad.<br />\nI hope that in the future you<br />\nwill be a little more sensitive to<br />\nthat portion of your readers who<br />\naren't particularly interested in<br />\nhaving their bodies used as bait<br />\nfor encouraging others to have a<br />\ngood time.<br />\nLorinda Riddle<br />\nAdministrative Assist.<br />\nOffice of the Chaplain<br /><br />\nTo the Editorr:<br />\nThe February 11th printing of<br />\nthe News-Letter contained an<br />\nadvertisement for the \"Betas'<br />\nCome Back Ball.\" It is unclear<br />\nwhere they were corning back<br />\nfrom, my guess would be a<br />\ngigantic ego trip. This crude<br />\ndisplay of unaesthetic body<br />\nportrayal proved a mockery of<br />\nfemale existence. The News-letter<br />\ntotally disregarded the insult that<br />\nthis ad paid its female reader.<br />\nThe intent of the advertisement<br />\nmay have been to communicate a<br />\nparty of some sort but instead of<br />\nadvertising the uplift of spirits it<br />\ncapitalized on the uplift of the<br />\nfemale breast. Until women and<br />\nother minorities are treated With<br />\nthe respect they are deserving of<br />\nour society will not move<br />\nforward.<br />\nNancy McLernon<br />\nSchool of Public Health<br />\nTo the Editor:,<br />\nHow's this for a letter?<br />\nEgg Roll Norton<br /><br />\nBy STEPHEN SMITH<br />\n\"Tail-Gunner Joe,\" the recent<br />\ntelevision film, was a<br />\nmuch-needed introduction to, or<br />\nreminder of, the anti-Communist<br />\nhysteria that was at large in this<br />\ncountry in the early Cold War<br />\nperiod. The film addressed itself<br />\nto the question: Why wasn't<br />\nMcCarthy stopped? In answering<br />\nthat question, though, the film<br />\nemphasized peripheral points,<br />\nand ultimately offered them as a<br />\nreal explanation, and did not ask<br />\nthe broader, related, and more<br />\nimportant question of why the<br />\nentire national<br />\nEstablishment---government,<br />\nbusiness, education,<br />\netc.---undertook or at least<br />\ntolerated an anti-Communist<br />\ncrusade at that point in history.<br />\nThis film had much to<br />\nrecommend it. First, while<br />\n\"McCarthyism\" has become part<br />\nof our political vocabulary, far<br />\ntoo few people have more than a<br />\nvague idea of what it means, or<br />\nof how the word originated. This<br />\nfilm will help to correct that. It<br />\ngave several concrete examples of<br />\nlives ruined by McCarthy's<br />\ninvestigations and by the climate<br />\nsurrounding those investigations.<br />\nThe film suggested McCarthy's<br />\nmotivations and the source of his<br />\ninfluence by showing his<br />\nconnections with certain<br />\nbusinesses, with the Catholic<br />\nChurch, and with crypto-Fascist<br />\nelements in this country. The<br />\nmakers of this film did not duck<br />\ntouchy issues, such as how<br />\nMcCarthy was tolerated by two<br />\nPresidents of the United States,<br />\nand how he was greatly<br />\npublicized by an uncritical press.<br />\nIn \"Tail-Gunner Joe,\" though,<br />\nit almost appears as if McCarthy<br />\nwere alone in this crusade. One<br />\nwonders not why he wasn't<br />\nstopped, but how he ever got<br />\nstarted. The impression is given<br />\nthat every respectable person<br />\ndisapproved of McCarthy, though<br />\nthey may have lacked the<br />\ncourage to attack him: Truman,<br />\nEisenhower, and McCarthy's<br />\nfellow Senators. McCarthy, in<br />\nthis film, was a pathetic<br /><br />\nMacNelly<br /><br />\nfigure—none too bright,<br />\nalcoholic, unprincipled, corrupt,<br />\nand paranoid—and it is hard to<br />\nunderstand why any respectable<br />\nperson would support him.<br />\nThe blame for McCarthy's<br />\npower is implicitly placed, in an<br />\nearly scene, on the<br />\nsimple-minded citizens of<br />\nWisconsin, who chose him for the<br />\nSertate over an \"egg-headed<br />\nprofessor.\" The professors of our<br />\nnation apparently saw the danger<br />\nof McCarthy, as did the rich<br />\nlawyers (Welch) and the<br />\naristocratic Senators (Margaret<br />\nChase Smith.) One is left to think<br />\nthat despite this, McCarthy was<br />\nvery powerful.<br /><br />\nActually, Joe McCarthy was<br />\ntolerated, if not supported, by<br />\nthe Establishment in the United<br />\nStates. The film showed that he<br />\nwas friend and ally of Richard<br />\nNixon, the Kennedy family, and<br />\nthe Vice President of<br />\nGeorgetown University, among<br />\nothers. More indicative of the<br />\nbreadth of his support is that the<br />\nSenate, in 1953, gave him the<br />\nauthority and the money that he,<br />\nneeded to conduct his<br />\nwitch-hunts. It is important to<br />\nnote that the \"good guys\" in this<br />\nfilm were those who rationally<br />\nand deliberately attacked<br />\nCommunism, at home and<br />\nabroad, as opposed to those who,<br />\nlike McCarthy, attacked it<br />\nirrationally and over-zealously.<br /><br />\nThe former are exemplified by<br />\nthe Voice of America, the State<br />\nDepartment, the Army,, and<br />\nespecially' Messrs. Truman,<br />\nAcheson, and Marshall.<br />\n\"Tail-Gunner Joe\" implied that<br />\n\"rational\" anti-Communism was<br />\nthe opposite of McCarthyism.<br />\nActually, while the approaches<br />\nwere different, both were aimed<br />\nat similar goals and driven by<br />\nsimilar spirits.<br />\nThe film practically ignores<br />\nconcrete examples of \"rational\"<br />\nanti -Communism. The<br />\nEstablishment, led by Truman,<br />\net. al., backed Chiang Kai-shek<br />\nfrom 1945 to 1949 with the<br />\nlargest outlay of funds and<br />\nweapons for a foreign nation ever<br />\nmade in U.S. history. These men<br />\nengineered the Marshall Plan<br />\nwhich European labor unions<br />\nattacked as an anti-labor plan,<br />\nand Truman set up the Loyalty<br />\nReview Boards in this country<br />\nthat had as devestating an effect<br />\non dissent as did McCarthy's<br />\ninvestigations. \"Tail-Gunner Joe\"<br />\nhad little to say about this; it<br />\nmentioned the Loyalty Boards,<br />\nbut did not explain them to<br />\nthose (probably most) viewers<br />\nwho did not know what they<br />\nwere.<br />\nNeither did the film mention<br />\nthe history of \"respectable\"<br />\nanti-Communist repression in our<br />\nhistory—e.g.\" Haymarket Square,<br />\nthe Mitchell Palmer raids, the<br />\nimprisonment of Eugene Debs, or<br />\nthe executions of Sacco and<br />\nVanzetti. Anti-Communism was<br />\nthe cornerstone of both foreign<br />\nand domestic policy in the U.S.<br />\nin the post-World-War-II era, and<br />\nthese policies were in a tradition<br />\nof imperialism and repression<br />\nhanded down by generations of ,<br />\n\"respectable\" men who ruled<br />\nAmerica.<br />\n\"The McCarthy Era\" was an<br />\nextraordinery time, but it, was<br />\nalso part of that tradition.<br />\n\"Tail-Gunner Joe,\" by treating<br />\nboth McCarthy and McCarthyism<br />\nas aberrations, did not help us, as<br />\nmuch as it might have, to<br />\nunderstand the meaning of that<br />\nperiod.<br /><br />\nInjun Joe<br />\nversus<br /><br />\nThe saga of• the Magic Bus: Ridin'the Greyhound trails<br />\nBy RUSS SMITH<br />\n\"The Greyhound Ameripass offers you something no other kind of mass<br />\ntransportation can. No matter how inexpensive. Freedom and safety.\" --Greyhound<br />\npromo<br />\nI may be a first-rate sucker, but when I paid $139 for a special Christmas Ameripass<br />\nin_Denver last December, I had no reason to doubt the legitimacy'of the above blurb.<br />\nAnd for several days, from Denver to Cheyenne, Reno to San Francisco, I encountered<br />\nno real problems,just the usual sleeping discomfort and on the road boredom.<br />\nI had no idea.<br />\nMy troubles began in downtown Los Angeles, hours after I pulled into the<br />\nGreyhound station from Westwood, fresh from the premiere of \"A Star is Born.\" Worn<br />\ndown from twoweeks of travel, I'm burned out and lost, and can't stop talking.to<br />\nmyself. Greyhound jangle. My destination is Santa Fe, New Mexico, so I've got a few<br />\nhours to kill before takeoff, a few hours to spend in downtown L.A., an area which<br />\nseems like one continual bus station, the bum's bum locale. Spanish markets own the<br />\nstreets, where fresh and not so fresh meat and produce are sold, where open bars<br />\nalternate with tropical fruit juice stands. Poor folks are tromping in and out of the<br />\nmarkets, flashing nary a smile to the luckless pedestrians.<br />\nSoon I board Greyhound 731, head for the back three rows where smoking is<br />\npermitted, toss my pack on the seat next to me to discourage anyone from sitting there,<br />\nand settle down with the final edition of the Los Angeles Times. My eyes dart up to the<br />\nfront of the bus where a whole herd of passengers are getting on, and I realize my<br />\nchances for the extra seat are slim. The last person on the bus snags the seat in question,<br />\nand immediately pulls out the biggest walking radio you'd ever want to see, plays it real<br />\nloud. The smc king section is filled with young people ready to party down, everyone<br />\nlookin' for a sood time.<br />\nAnd so the Magic Bus takes off.<br />\nThe cast'of characters went like this:<br />\nAlbert—A nineteen year old geek from New York City who's rich off his old man's<br />\nchain of Supermarkets. Albert bragged on and on about the \"piece\" he carried with him,<br />\nabout the marijuana he smoked, the scotch he drank, and \"the fine tail\" he messed<br />\naround with in New York. Albert wasn't too much.<br />\ngypsy—A young woman in her late teens, Gypsy's a self-proclaimed hooker with a<br />\ntaste for weed, booze and strange men. Speaks in a white trash Albuquerque drawl while<br />\nmoving from seat to seat. An hour out of L.A., Gypsy had already made plans for a<br />\nMagic Bus orgy.<br />\nT.0—My original seatmate. A stud from Kansas City, heading to New York on a<br />\nsmack junket. Easy going, dripping with the \"we're all brothers\" jazz, but a likeable<br />\nsort.<br />\nhiul—(aka Injun Joe) A mean Mexican Indian, just two days out of a California<br />\nprison cell. A design of scabs and scars highlight his face.<br />\nClyde, Robert, Caesar and Taylor—Four young men all going to New York,fully into<br />\nthe party atmosphere,,a friendly bunch. When sober.<br />\nThrow in a creative Writing teacher from Stanford and an elderly chain smoking lady<br />\nand you've got the makings of a Magic Bus.<br />\nSo we're riding along, I'm trying to read the paper, while everyone else, save the<br />\nteacher and the old lady, are partying hard, passing beers, smoking joints in the crapper,<br />\nPlaying the static loud, getting together with some poker and handshakes all around.<br />\nYes, everyone was getting along jest fine.<br />\nGypsy was making the rounds, checking out each of the honchos, finally settling on .<br />\nT.C. and then sprawling on his lap, leaving me about half my seat. \"Listen turkey,<br />\nYou're gonna switch seats with me at the next stop so me and T.C. can spread out,<br />\nunderstand?\" Gypsy informs me with a bitchy leer. \"C'mon,\" I said, \"that's bUllshit,<br />\nI'm staying right here and y'all can move.\" Well, she didn't buy that, and started<br />\nPestering me no end, so I agreed to switch seats. She was pleased and promised to \"turn<br />\nme on to a beer.\" Hey, a real beer, I thought, and took a quick glance at the bottle of<br />\ntequila stashed in my coat.<br />\nI settle into my new lodgings, meet Paul, who yells back to Gypsy,\"Who's this jerk?\"<br />\nGypsy explains the situation and promises that he won't have to put up with me for too<br />\nlong. Greyhound, see America, I keep thinking.<br />\nAt the next stop, the partyers chipped in to buy about a dozen pints of Southern<br />\nComfort, bourbon, and cognac. Still brothers and sisters on this long ride together, they<br />\nswilled the cheap booze with gusto. Meanwhile, Paul tells me his prison story and then<br />\ntries to pawn off his watch, bracelet, toothbrush, anything to make a quick buck. I tell<br />\nhim if I had any money I wouldn't be traveling by Greyhound. He can't argue with that.<br />\nPaul's socking away the bourbon and beer, and spies my tequila, which leads him to<br />\nan immediate announcement: \"Hey, my cowboy friend has some tequila and he's gonna<br />\nshare it with everybody, right Jesse?\" I get a big cheer and then tell Paul no way. We<br />\nweren't too close after that, but I figured it'd still be cool.<br />\nMaybe an hour late- Paul spills some beer on his seat, looks around for something to<br /><br />\nwipe it up, and settles on the sweater resting on my shoulders. \"Hey, wait a minute<br />\nfriend, don't use my sweater,\" I protest. He yanks it back from me and says \"You do<br />\nwhat I say, motherfucker, or I'll kill you.\" I weakly replied, \"Hey, look, the sweater's<br />\nyours man, need anything else?\"<br />\nMeanwhile, things aren't going to well with the other celebrants. Albert's been<br />\ndismissed as a worthless clod, a few of the gang are puking up the cognac, and Gypsy's<br />\nwitchy laughs have turned into shrieks. She sets fire to Albert's Greyhound pillow,<br />\nAlbert complains, only to be bawled out by Gypsy's fire water lips. T.C. tells her to be<br />\ncool<br />\nThe bus driver rolls on.<br />\nNow, one of Paul's weaknesses was for little children, and right across from us were<br />\ntwo kiddies, marshalled by a terrified young woman who's trying to shake the Indian's<br />\nadvances. But she was especially upset by the language in the back, so Paul yells to the<br />\ncelebrants, \"All right, you motherfuckers, there's kids up here, so keep it decent.\" Well,<br />\nafter several of these admonishments, T.C., who's by now totally in his cups, decides<br />\nhe's had enough of this self-righteous Indian. He walks up to Paul, starts screaming like a<br />\nmadman, \"Who the hell do you think you are, motherfucker, telling me what to do<br />\nafter I've bought you whiskey and beer. All that brother jive, now you gonna shut up.\"<br />\nPaul sits down, tries to ignore the whole thing, but T.C. leaps on top of him, throwing<br />\nme against the window and my glasses to the front of the bus. I've got one hell of an<br />\nadrenalin buzz going at this point. They're scuffling for a few minutes, Robert and<br />\nTaylor have joined in, and then surprise, the bus driver pulls over to the side of the road.<br />\nT.C. hisses to Paul,\"I gotta gun cocksucker, and I'm gonna shoot your fuckin' head off,<br />\ndon't care if I do go to jail.\" I'm thinking hey this is great, guy's gotta gun, probably<br />\ntake a few others along with Paul.<br />\nBus driver comes back, gives a basic pep talk about behaving ourselves, and we're<br />\nriding again.<br />\nI'm scared silly now, getting ready to check out. Paul's muttering next to me, and<br />\nslowly draws out of his pocket a ten-inch knife decorated with the etching of a saint.<br />\n\"I'm gonna slice that nigger's throat to ribbons once we get to Phoenix, and I ain't<br />\ngonna get caught,\" Injun Joe rattles on. Terrific, I think, and sit up straight in my seat,<br />\nchain smoking, not letting my eyes close for a minute. Paul starts dozing, his head<br />\nlanding on my right shoulder. Now that's a move I wouldn't normally go for, but hey.<br />\nPaul,and I are pardners.<br />\nPanic in Arizona<br />\nThings had been quiet for about a half hour when Gypsy, decided that she and T.C.<br />\nweren't getting along anymore. She's more drunk than anyone, having thrown down<br />\nthree pints of Southern Comfort and one of cognac, and starts yelling at T.C., telling<br />\nhim what a dirty pimp he is, rotten lover, the whole works. Well, T.C., fresh from his<br />\nbout with Paul, was having none of this, and starts slapping Gypsy around, while she<br />\nscreams for,the whole bus and highway to hear. ,<br />\nBus driver lolls on.<br />\nGypsy escapes from T.C., tears up and down the bus aisle, punching anyone she can<br />\nsee in her drunken delerium--my fifth and sixth'head bruises came from this tirade--just<br />\npissing and moaning, finally arriving at the fateful words; \"You're all just a bunch of<br />\nslimy niggers, and I hate niggers!\"<br />\nThat wasn't the wisest move on Gypsy's part. Immediately, a half dozen sets of ears<br />\nperk up and Gypsy's trapped in a rumble, getting the stuffing kicked out of her, hair<br />\npulled this way and that, fingernails dug in black and white flesh. After pleas from<br />\npetrified passengers who are seeing a, disaster inpvie right before their,eyes, the bus<br />\ndriver pulls over again. Paul's awake with kniie-iti hand, T.C.'s reaching for his pistol,<br />\nand I'm clutching the rosaries in my pocket. We're stopped at the Arizona border where<br />\na sheriff comes aboard and drags off Gypsy to the local jail. After an hour, we're riding<br />\nagain, the whole bus in terror.<br />\nIt's now early in the morning and we're scheduled to make Phoenix in five hours,<br />\nPaul's last stop. So I've got hundreds of miles ahead of me, trying to get my mind off<br />\nthis predicament, but I can't, I'm just thinking about getting off the Magic Bus alive. I'm<br />\ncounting the miles on the dark highway, counting the miles, fully expecting the trip to<br />\nend in disaster.<br />\nBut oddly enough, we did get to Phoenix. I figure I'm a free man, at least if Paul<br />\nwould wake up. Ten minutes later, to my enormous relief, I see him in the station with<br />\nsuitcase in hand, so I know the ordeal is pretty much over. I saunter over to him and<br />\nglibly remark, \"Well, good luck, Paul, sure was nice to ride with you.\" \"Great,cowboy,<br />\nsure ya don't want to stop off in Phoenix with me for a couple days, I'll show you the<br />\ngood spots.\" \"Well Paul, I'd like .to, but I've gotta meet my brother, maybe next time.\"<br />\nThe rest of the trip to Santa Fe was a breeze. Most of the partyers were too crashed<br />\nout, sick, or plain scared to create any ruckus, so we just rode the Magic Bus on in. My<br />\nbrother met me at the dingy Greyhound station and handed me a beer as we waved<br />\ngoodbye to the Magic Bus. And that was the first moment of freedom and safety this<br />\ntattered cowboy extracted from Greyhound, Inc.<br /><br />\n••*••••411.•<br /><br />\n.page 10/news-letter/february 18, 1977<br /><br />\n...<br />\nWeekend Wonder Flix<br /><br />\n'<br />\n44111111111<br />\n.<br />\n.4111111111.<br />\n0<br /><br />\n1<br /><br />\n.<br />\n11111111. .411111.1110.<br /><br />\nSenior Class Film Series<br /><br />\npresents<br /><br />\n•<br /><br />\npresents<br /><br />\nWORkINCic<br />\nTO<br />\n'MAVEN<br />\nIASSCI\"S<br /><br />\nELIO PETRI'S<br /><br />\n11HE<br />\nCLASS<br />\nBIDES 11:1<br />\nHEA111/1EN<br />\nStarring GIAN MARIA VOLONTE<br />\nand MARIANGELA MELATO<br />\nFrom NEW UNE CINEMA<br /><br />\nBEST FILM, Cannes Film Festival<br /><br />\nI.<br /><br />\nELLIOTT KAMEN MC.71<br />\nA WA AJICHANDS RUA<br />\nAMES \"FAREIVE1.4 AO'LOVELY'<br />\nRQaWETAUTCNINA • CHARLOTTE EAMPLAY8 • AWNIMAM •STUN4 MK MAWS<br />\n,<br />\nsioac ANINONY ZERIE • NAM DEAN MUM tra.to'<br />\nRUCXNENEEN<br />\nleavaa Ofeirff DORASam.11111<br />\naeivei vo..:us ELLIOTT XAS7N£11 • MEW<br />\n1<br />\nAz c alawn=<br />\nCHANDLEN<br />\nWINOND<br />\nsf<br />\nwt..* p MAD ZELAG DOODMAN •'go<br />\n••••••<br />\n•••<br />\n•<br />\n• A.•-••<br />\n,<br />\n41i<br />\nDAVID santE•.44 aynapes,MUM 411 4IC MOON 15,-.<br /><br />\nintent<br /><br />\n\"VOLONTE IS FIRST-RATE!\"<br />\nCost/NEW YORK MAD<br /><br />\n\"BRILLIANTLY DIRECTED!\"<br />\nHerridge/NEW YORK POST<br /><br />\n\"ONE OF THE FUNNIEST<br />\nSEDUCTION SCENES EVER\"<br />\nStoop/AFTER DARK<br /><br />\n\"ELECTRICITY, VIGOR &amp; PASSION!\"<br /><br />\nFRi. &amp; SAT.<br /><br />\nFEb. 18 &amp; 19<br /><br />\nWolf/CUE<br /><br />\nI<br /><br />\nAdmissioN $1.00<br /><br />\nShaffer 3<br /><br />\nSaturday, Feb.1 9<br /><br />\nTnvim,<br /><br />\n8:00&amp; 10:00<br />\n5.75<br /><br />\nT4*-40-40-•4410-40-.1*-••-•-•4*-40-411*4<br />\n7:30 Pt 10:00 PM<br /><br />\n*•:•:••<br /><br />\nPLACE: SHRIVER HALL<br /><br />\nI ADMISSION: $1.00<br />\nNkk ScREwEd A3i1<br /><br />\n\"BREATHTAKING<br />\n...EXUBERANTLY FUNNY!<br />\nWatching All Screwed Up isto be witness<br />\nto a giant talent:<br />\nVincent Canby/ NEW YORK TIMES<br /><br />\nTHE INTERNATIONAL STUDENT'S ASSOC.<br />\nTHE GRAD CLUB THE JUNIOR CLASS<br /><br />\nINTERICION<br />\nDANIC<br /><br />\nBELLY<br />\nDANCER<br />\nARISTEA'<br /><br />\n\"A BRILLIANT MOVIE<br />\nthat must be seen several times!\"<br /><br />\nRex Reed<br /><br />\nGREEK<br />\nBAND<br />\n:<br />\n+GeRECIAN<br />\nODYSSEY<br /><br />\n\"UPROARIOUSLY<br />\nFUNNY<br />\nA strong<br /><br />\nentertaining,daring film from Wertmuller!\"<br />\nWilliam Wolf / CUE MAGAZINE<br /><br />\n\"INCREDIBLY FUNNY,\"<br />\nSan Francisco Chronicle<br /><br />\nBEER<br /><br />\nf5t LIGHT<br />\n50t DARK<br />\n40 te MICHELOB<br /><br />\nWINE<br /><br />\nLINA WERTMULLER'S<br /><br />\nALL SCREWED LIP<br />\nlii<br /><br />\nSENIORS<br /><br />\nNEW LINE CINEMA<br /><br />\nFriday, Feb. 1 8<br /><br />\nPG,<br /><br />\nSUN DAY<br />\nFEB. 20-th<br /><br />\n$1 es) Sfacien+<br />\n01-f9 Other<br /><br />\nFREE<br />\n945 -to I<br />\nMUNCH1E5<br />\nGLASS PAVILION-HOMEWOOD CAMPUS<br />\n\"YN5 HOPKINS UNIVERSITY<br /><br />\nfebruary 18, 1977/news-letter/page 11<br /><br />\nGodEREy's: 110T<br /><br />\nSTUFF<br /><br />\n-It's no secret that Godfrey's Steer and Beer on Greenrnount Avenue is high on this rag's list of fave rave<br />\nbars. Time and time again this streetside saloon has been applauded in these pages, and with good reason.<br />\nFrom the splintered wooden booths to the tacky wall decorations, from the cheap pizza to the thirty five<br />\ncent draft, Godfrey's can't be beat for an evening's entertainment. It's ticket to the Barroom Hall of Fame<br />\nwas printed years ago.<br />\nAlmost every day Godfrey's is packed with rambunctious patrons and thirsty down oa their luck roaders,<br />\na crew straight from the pages of the New York Daily News. Sure, the help is sometimes bitchy, but they<br />\ndon't mean any harm, it's just part of the wacky Godfrey's charm':<br />\nNo doubt about it, Godfrey's is the perennial shoe-in for bar of the week. But get there soon if you want<br />\nto catch some of the old magic, because rumor has it that<br />\nHOPKINS'<br />\n-will be purchasing Godfrey's in the near future in Order to quell the unmanageable crowds at the<br />\nRathskellar. It was also said that Godfrey's would be renamed Rathskellar East.<br />\n\"We found that it was impossible to snag a quick beer on Friday or Saturday night at the Rat,\"<br />\ncommented a middle range administration official.\" \"Godfrey's was dirt cheap and it filled our Rathskellar<br />\nexpansion requirements,\" he continued.<br />\nAccording to the recent scuttlebutt, plans are now underway for the construction of an underground<br />\nshuttle 'from Levering Hall to the basement of Godfrey's so that students don't have to contend with<br />\n\"Menacing city forces.\"<br />\n\"We don't think Hopkins students should have to consort with Baltimore's rabble if they don't want to,\"<br />\nexplained the confidential source.<br />\nHopkins police will provide the security for the tunnel operation. The shuttle will be limited to members<br />\nof the Hopkins Community.<br />\nDuring the '78-'79 school year, however, students will have to be content with the hourly bus service to<br />\nGodfrey's and back. The bus will be stationed at the back of Shriver Hall.<br />\nPre-meds will be banned from Rathskellar East. \"It'll still be Ilopkins property, but one step out of the<br />\nbar and whammo, you've got a slice of city life that no student ;hould be subjected to. At least until he<br />\ngraduates. Anyway, medical students are here to study.<br />\nREGULARS<br />\n-at Godfrey's are hoppin' mad about the rumored developments and are reportedly gearing up for a fight<br />\nwith the University. \"If Hopkins gets Godfrey's, next thing you know they'll be trying to corner the<br />\nGreenmount bar market. All for a bunch of snot-nosed students,\" snorted Willy Don Shannon, local lush<br />\nand lowlife.<br />\n.9 We wish the protestors a keg full of luck, dubious as their chances may be. As community leaders know,<br />\ntv,<br />\nthere's no stoppiif:the Hop.<br />\nz<br />\nSo go to Godfrey's while it's still a fine old neighborhood bar, and have a shot of bourbon and a draft for<br />\nthe old times. And why not send a letter of indignation to the moguls at Garland Hall?<br />\nIt's the decent thing to do.<br />\n—a. press<br /><br />\ndiAloqUE<br />\nBy J.D. CONSIDINE<br />\nPassing through the lobby, its<br />\ndead fluorescent light dissolving<br />\ninto the tinted glass sunlight<br />\nbeyond the doors. The ceiling<br />\nhums, quietly metallic against the<br />\nwet mumblings of the green-lit<br />\n, pebbled fountains. The<br />\nsuddenness of shoes, clisp soles<br />\nagainst the poured floors after<br />\nthe whisper of dense carpetted<br />\nopulence; steps out of alignment,<br />\narhythmic against the measured<br />\nSymmetry of tile and border. The<br />\ndull thud of two bodies leaning<br />\ninto the tinted plate-glass, the<br />\nWheeze of slow-turning metal,<br />\nthe whine of the cold street wind<br /><br />\ncome back and she'd ask me if I change. You alwayS. said you<br />\nsaw you, and of course I hadn't, loved me, but I was beginning to<br />\nso I'd go back to the library. I'd think love was little more than<br />\nalways find you sitting in a chair thought to you, thought like<br />\nsomewhere, reading a magazine your books and your paintings.<br />\nor a newspaper as if you were the And then when you bought that<br />\none waiting for me. But when we dog, when you showed that you<br />\nwent back to my room, you could feel, I hoped that maybe,<br />\nalways wanted to know how my just maybe...<br />\nwork was doing, what my classes<br />\n\"I don't know. Maybe it was<br />\nwere like, you listening like you just that the dog was more on<br />\nunderstood all about it. If I your level. God, I just never<br />\nhadn't met your friend, I never could figure...I loved you but<br />\nwould have known what you did. you only loved me like a<br />\nStill. I never felt as alone<br />\ntreasure, a painting or a book;<br />\nthen...\"<br />\nyou only loved me with your<br />\nLit ter cluttered stairs, the mind, like you thought I was<br />\nmuffled rumble of the trains above touching and feeling, like I<br />\nsliding low pitched through the could do it in my head. Damn it,<br />\nSlipping .into the staid control of steady drone of idling, I loved you, but you're just a<br />\ngas-warmed lobby air.<br />\nred-lighted engines, rising like the wall...\"<br />\n\"Anyway, it doesn't matter white steam from an unseen city.<br />\nHalf a dozen women in various<br />\nWhat I say because you're always In an instant the engines spring states of undress, a handful of<br />\noff somewhere else, thinking to life, a roar more of power-than<br />\nYour little thoughts.\" Her pace of motion, of vapor and tail<br />\nincreases. \"I don't even think lights and the airbrake wheeze of<br />\nYou're listening now. And you the transit bus. And still, beneath<br />\nvvonkr what the problem was. the visible clatter of the street,<br />\nJust shuffling along, the train below, more felt than<br />\nstoney-faced. I used to hope,just heard.<br />\nhope...oh, I don't know.\"<br />\n\"I suppose you're going to<br />\nHer reflection in the shop keep Ralph. I remember that<br />\nWindow falters, trying to speak. night when we passed the pet<br />\nJr bounces along, soundless past shop, and you stood there<br />\nthe silent outlooking mannequins smiling at him through the shop<br />\nto the brittle counterpoint of window. I didn't think much of<br />\nunseen shoes on the concrete it at the time. Remember how<br />\nWalk. A young boy running you always said \"hello\" to dogs<br />\nbetween cars accross the street is<br />\nand cats, sometimes even<br />\nby soot -scarred squirrels? Yet you never went<br />\nObliterated<br />\ngranite, only to reappear among into a pet shop. You always<br />\ndifferent mannequins in the same smiled at them, rubbed their<br />\nscene.<br />\nheads, but that was all—I thought<br />\n\"I remem'oer at school, how<br />\nyour interest in them was as<br />\nYou used to come over to visit transient as everything else in<br />\nWhen I wasn't there, and my your life. And then that night<br />\nroommate had you trooping off when you came home with him, I<br />\nto ,the library to find me. I'd thought maybe things might<br /><br />\nmovie stars, musicians and<br />\npoliticians hanging<br />\ncheek-to -cheek next to the<br />\ngrey-blurred newsprint murders<br />\nand crimes. The eyes staring out<br />\nunseeing, in expressions of<br />\ndeadened allure, bodies<br />\noutstretched like banner<br />\nheadlines, speaking in the dull<br />\nwhisper of an occasional breeze.<br />\n\"What is it you want out of<br />\nlife? I never could understand<br />\nthat. You always said you<br />\nwanted me, but you never said<br />\nwhy. I always felt like such an<br />\nobject, something to be gazed at,<br />\nlistened to. At first I thought it<br />\nwas wonderful, the way you<br />\n,adored me. I still do, but it isn't<br />\nenough. Why can't you try to<br />\ntouch me with something other<br />\nthan your mind? You're like a<br />\ncamera, only you never let me<br /><br />\nsee the pictures. What is it you<br />\nwant from me? What is it you<br />\nwant?\"<br />\nThe slowturning awkwardness<br />\nof the yellow door, of metal<br />\npried apart only to be released,<br />\ndull thudding against the rotting<br />\ngrease smeared carcass. The<br />\ndeepthroated rasp of its engine as<br />\nit, yellow-grey and sluggish as<br />\nbile, lurches into the slowly<br />\nyielding flow of metal, glass and<br />\nrubber, its yellow-backed<br />\nlettering disappearing into the<br />\ncold whitish fog, the dirty blue<br />\npuddles, and varishaped mottle<br />\nmoving into an oblivion of<br />\nhorizon, melting like the single<br />\nface in a backwindow blurred<br />\ninto obscurity before pulling<br />\nfrom sight,,finally dying into the<br />\nsolitary footsteps along the<br />\ntrash-strewn street.<br /><br />\npage I2/news-letter/february 18t 1977<br /><br />\n•<br />\n•<br />\n•<br />\nrupt Dis<br />\n•<br />\n•<br />\ne<br />\nThi<br />\ns<br />\nis<br />\nyou<br />\nr<br />\n•<br />\n•<br />\n•<br />\n•<br />\nCommemoration<br />\ni CAMPUS NOTES space i<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n•<br />\n• Day Ceremonies<br />\n•<br />\n•<br />\nYo<br />\nu<br />\nsho<br />\n*<br />\nuld use it!! •<br />\nI<br />\ni<br />\n•<br />\n•<br />\ni<br />\n•<br />\n•I<br />\n•<br />\n•<br />\n•<br />\nr(t<br />\n•<br />\n•<br />\n•<br />\n••••••••••••.•••••••••••••••••.•••<br />\n••••••••••••••••••••••••••••••••••<br /><br />\ncK<br /><br />\n)<br /><br />\nfi<br /><br />\nIf anyone found a pair of green<br />\nand black ski mittens last Thurs.,<br />\nFebruary 10, I'd like to hear about<br />\nit. Call Joe at 467-4791. Reward..<br />\nThe Jewish Students Association is\\<br />\nsponsoring religious services on Friday<br />\nnight at 6:30 in the Kosher Dining<br />\nHall. Saturday afternoon services will<br />\nbe held at 5:00 in the KDH.<br />\nCelebrate Washington's birthday•<br />\nthe international way! Come to the<br />\nGreek dance festival on Sunday, Feb.<br />\n20, 9:15 p.m. in the glass pavillion.<br />\nThere will be professional belly dancer<br />\nand Greek band giving you a true<br />\nflavor distinct from that of a disco.<br />\nBrought to you by the International<br />\nStudents, Junior Class, and the Grad .<br />\nClub.<br />\nLost: Sr-51A calculator in Remson<br />\n101, Thursday Feb. 17. Please contact<br />\nEd at 366-5610.<br /><br />\nNorth-South relations: Frank Ortiz<br />\nof the U.S. State Department, former<br />\nhead of the U.S. Latin America Desk<br />\nand Chief U.S. Diplomat td Uruguay,<br />\nwill speak about U.S.—Latin American<br />\nrelations, Tuesday, Feb. 22 at 8:30<br />\np.m. in Maryland 226. Sponsored by<br />\nthe International Studies Forum. All<br />\ninterested persons are invited.<br />\nGet away from it all for a few<br />\nhours. Join us in a short hike (4-5<br />\nmiles) around scenic Lake Roland.<br />\nMeet in front of Levering, Saturday at<br />\n10:00 a.m. Bring lunch. Inquiries<br />\n889-3522 or 243-8667.<br />\nFor those interested; Spring Track<br />\nbegins Tuesday, Feb. 22 at 4:15 p.m<br />\nMeet at the Athletic Center.<br /><br />\n'Big Bucks comes to B-more.<br />\nBecome part of the world of bigtime<br />\ncollege golf and play for Johns<br />\nHopkins. Please attend a meeting<br />\nTuesday, Feb. 22 at 4:30 p.m. in the<br />\nAthletic Center. Classroom.<br />\nProfessor George Whitesides of the<br />\nMassachusetts Institute of Technology<br />\nwill present a colloquim, \"Enzymes<br />\nfor Large-Scale Organic Synthesis\" in<br />\nRemsen 221 on Tuesday, March 1 at<br />\n4:15 p.m. Open to the public and free<br />\nof charge.<br />\nMaryland NORML presents Reefer<br />\nMadness, a film about marijuana, on<br />\nFriday, Feb. 18 and Saturday, Feb. 19<br />\nin Shriver Hall. Admission is $1.00.<br /><br />\nThe JHU Historical Simulations<br />\nStudy in<br />\nSociety will be meeting on Sat., Feb.<br />\nGuadala<br />\njara, Mexico<br />\n19, at 10:30 a.m. in Md. 214.<br />\nThe<br />\nGUADALAJARA<br />\nSUMMER<br />\nSCHOOL, a fully accredited UNIVERSITY OF ARIZONA program, will offer<br />\nJuly 1 -August 12, anthropology, art,<br />\neconomics, bilingual education, folklore, history, political science, Spanish<br />\nlanguage and literature. Tuition and<br />\nfees, $220; board and room with<br />\nMexican family, $280. Write to<br />\nGUADALAJARA SUMMER SCHOOL,<br />\n1530 Gamma Apartments, University of<br />\nArizona, Tucson, Arizona 85721.<br />\nea.<br /><br />\nclassifieds,<br /><br />\nI<br /><br />\nP S31.1001.m<br />\nSTINKP<br /><br />\nfaa-ket,/-7<br /><br />\nOFFICE OF THE CHAPLAIN<br />\nPresents<br />\nthe<br /><br />\nSUNDAY<br />\nEXPERIENCE<br />\n\"TWO RIGHTS: ARABS AND .11:11'.(,\"<br />\nA Talk By<br />\nDR. HERTZEL FI5,IL11/1,1.<br />\nBakimore Zionist Federation Scholar-in-Residencc<br />\nSUNDAY,FEBRUARY 20, 11:00 A.M.<br />\nLISTENING-VIEWING ROOM<br />\nLEVERING HA LL<br /><br />\nSPANISH by experienced native<br />\nteachers - AU levels, all<br />\nales.<br />\n366-.2056.<br />\nVERY SINCERE MEDICAL<br />\nSTUDENT, Jewish, age 26, seeks a<br />\nsincere, well-educated, well-adjustedi<br />\nyoung woman of good character.<br />\nObject: friendship and<br />\ncompanionship possibly leading to<br />\nmarriage. Please reply to Box 5936,<br />\nPikesville, Maryland 21208.<br />\nEARN . EXTRA MONEY:<br />\nTelephone Sales from our Charles<br />\nVillage office. AM and PM shifts<br />\navailable: good telephone voice<br />\nnecessary. Call between 10:30 pm. 1:00 pm. 467-1772.<br />\nDIAMOND ENGAGEMENT &amp;<br />\nWEDDING RINGS: Up to 50%<br />\ndiscount to students, faculty, &amp;<br />\nstaff ( full or part-time ). Example,<br />\n1/4 ct. $75,1/2 ct. $250,1 ct. $695<br />\nby buying direct from leading<br />\ndiamond importer. For color<br />\ncatalog send $1 to SMA Diamond<br />\nImporters, Inc., Box 42, Fanwood,<br />\nN.J. 07023 ( indicate name of<br />\nschool )or call (212) 682-3390 for<br />\nlocation of showroom nearest you<br /><br />\n20TH CENTURY-FOX PRESENTS<br /><br />\nA RALPH BAKSHI FILM<br /><br />\n?UINTA'.GUIDANCE SUCSESTED 401<br />\n1,111111/4<br /><br />\nNOT II $11..t1<br /><br />\n,111.1.5<br /><br />\nr 1977 Twentteth Century-Fox<br /><br />\n=MEMCI<br />\nPHOTOGRAPHY-Learn the basics<br />\nof taking pictures and making them<br />\ninto printsor slides. Use your own<br />\nequipment or our professional<br />\nequipment. Individual or group<br />\ninstruction given. CALL 467-8407<br />\nAND ASK FOR MIKE'<br />\nFACULTY 1IOME FOR RENT.<br />\n14-month period. June 15, 1977 August 15, 1978. 5 bedrooms, nice<br />\nyard, adjacent to park. Fully<br />\nfurnished. Walking distance to<br />\nHomewood campus. $475 month.<br />\n338-7274 (eves. 243-2113)<br /><br />\nTHE ALL NEW HOME WOOD DELICATESSEN<br />\n3105 St. Paul St. 46 7-7882<br /><br />\n•<br /><br />\nHOME OF THE FAMOUS<br />\n\"HOT CORNED BEEF\"<br />\nWe cook'em all day &amp; Western Fries<br />\nTHE BIGGEST AND BEST SANDWICHES — IN TOIV.V<br />\nDELICIOUS WESTERN FRIES<br />\nDELICIOUS FRIED CHICKEN<br />\nHOMEMADE SALADS<br />\nNATURAL FOOD DEPT'<br />\nSILBERS BAKERY DEPT.<br />\nNATURAL YOGURT &amp; ICE CREAM BAR<br />\nPARTY TRAYS our SPECIALTY<br /><br />\nfeb.ruary 18, l977/news-letter/page 13<br /><br />\nv-A2r-Awo4r-gw_gw-gwitzrearAw-A<br />\nYour Campus-PrJde!<br />\nri NEW REVOLUTIONARY NEW<br />\nUNIQUE<br />\nHISTORIC— First University Campus Postcards<br />\nDifferent Superb Scenic-Views,<br />\nFrom Your Campus,On One Card<br />\nYOUR CAMPUS PRIDE GOES WORLDWIDE<br />\nThink! Think more often on your relatives &amp;<br />\nfriends, drop them a line. They will admire &amp;<br />\ntreasure your pride! Frame one for yourself!<br /><br />\nUNI-PRIDE CREATIVE POSTCARDS<br /><br />\n.k,..<br />\n1 4\",,•* -,I•<br />\n`.. t.'• ,,,,, 'Is\"<br />\n..:„..,,:,4.,:<br />\n1,.11,.:<br />\n„:<br />\n.:<br />\n... ,,..z. fn,,,,,..,,.<br />\n...:::.<br />\n.:-. .41, ts.*<br />\nj-.k1.....,<br />\n:<br />\n,:-—..;<br /><br />\nIre'<br />\n7<br />\n,<br />\n,,'''1.,•'I<br /><br />\n••<br /><br />\nI Catholic<br /><br />\n,<br /><br />\ne-r .••.0 - -.;,Zy 1<br />\n-..‹,..1\",-7,•..t1<br />\n--,..,.r,,'<br />\n4 •.,-,-.,ik•<br />\n,, .1 ...\\,,-;:-,..v<br />\n(<br />\n'<br />\n.:114.•'<br />\n(;<br />\n•1.r1,:-„...'.0.1.'-.'''<br />\n;,:.:<br />\n\"<br />\niact<br />\n;<br />\n...-1<br />\n::;1..:<br />\n.,,,.<br />\n..<br />\n,<br />\ni<br />\n.<br />\n,:<br />\n.<br />\n.<br />\n,.<br />\n•..<br />\n. 1....,<br />\ni''<br />\n• - •-•'i...,<br />\n.....::..t.....2<br />\n1<br />\n- ..<br />\n.t ,J.-„-?,,••,,••<br />\n.1•••C.i,<br />\n-; -!;,<br />\n,i-)..f-,..-.,.•=i<br />\n...<br />\n*•.c.;!c0<br />\n/ /I/ ,,k\" '••<br />\n''''.<br />\n'....kl.....'\".',.,- :,r,11••••-1),i..,.1:1.7‘‘,<br />\n'''''<br />\n.0\".....7<br />\nC.''.,'<br />\n,<br />\n,.:_\"<br />\ni•-•<br />\n\"<br />\n.<br /><br />\nCommunity<br />\non Cainpus<br /><br />\n7,...›,2•;.f:(4<br />\n‘'<br />\nC.(f..; :t::11•:.‘01re''''<br />\nr.f.c,.<br /><br />\n.t-c •., if .s., 4,<br />\ni<br />\n.•'<br />\n•- S.7'<br />\nu<br />\n.. .<br />\n2..<br />\n•'<br />\nI ..','<br />\n. ‘}.,Jr.<br />\n'<br />\n'<br />\nr Y A.'t *(.,',.,<br />\n, ',<br />\n•'<br />\n''<br />\n'<br />\n'I<br />\n..,<br />\n.<br />\n' ..-... t` 1 ,4 1.I.'•.<br />\n,,li k 4's • 'J''' t' '-•<br />\n\"•1/4,,-.0`4.i.\"'141.'<br />\n1 :' •'<br />\nt.=<br />\n'<br />\n'•'<br />\n..,<br />\n‘<br />\n,.'t,<br />\n•'•s<br />\n',S.,<br />\n'.•<br />\n,<br />\n_ A • .• I g•<br />\n'IL,;<br />\n,<br />\n,-\"r-,'\"<br />\nc•-;,„,<br />\n,<br />\n.<br />\n.<br />\n-• 4,,`, L.<br />\n,:<br />\nL.<br />\nv<br />\n.<br />\n(<br />\n,<br />\nJ<br />\n.<br />\n:::„........,<br />\nI,<br />\n-...r k .e‘.. 4 :t• r Y<br />\n,r• ... • • .•• - • 0 „ , r.,..<br />\n:‘1 i'., .<br />\nb S0 •• • .:•.<br />\n.•. ..1 tibi:-,.., t_ r ..:•.4<br />\n. .:,),..:.,••••'s s,<br />\n,<br />\n•s,t,d.•,,,.,,,7; I.<br />\n•,,,<br />\n- v‘!:••••\\.,...% .....$)•.-7'\",1-\"...,...\":z'.<br />\n,.• ,,,,,,..., .:.;•,....-Y: . r<br /><br />\n.• i„.4:—.1.<br />\n'<br />\n..•3• )— - •<br /><br />\nPENITENTIAL LITURGIES<br />\nSunday, February 20th<br />\n10:30 a.m. in Schaffer Hall, Room 3.<br />\n5:00 p.m. in Newman House, 2941-Charles<br /><br />\n‘<br />\n_c i,v'<br />\nf. t•-1<br /><br />\n.c...1 ;#,\",.•1+,<br />\n# .,::\".,'<br /><br />\n.•,..).,,•<br />\n„4,'?...•<br />\n;, II',1*.Pf<br />\n..' ..:;•.:.<br />\n:'.' '<br />\n.•''<br /><br />\n•‘.• 1:, ., 1<br />\nr.: 3<br />\nI.<br /><br />\nk.<br /><br />\nON SALE/AT YOUR UNIVERSITY BOOK-CENTER<br /><br />\n2r-par-A2r-g2r-ow-Awarr.2r-gw-g<br />\n...in.<br /><br />\n4<br />\n• ‘• -',\"<br /><br />\n.•• •<br /><br />\n;1.<br /><br />\n••••••••<br /><br />\nYou can spend anywhere from a summer, to a semester,<br />\nto a full year.. learning, experiencing, helping.<br /><br />\n4...<br /><br />\n•<br /><br />\nthilversitg SandyAch Shame aid Deli<br />\nAl Limp Crab Cakes<br />\nGeassiae Readier Carried Beet<br />\nDiliClog'Roast Beef<br />\nVitikais Baked Hasa<br />\nVarious Cold Cuts<br />\nCheese (S;wiss. Psovoione. Muenster)<br />\nKosher Hot Dor<br />\nCatalan<br />\nParty nays(lipickli order)<br />\nHzea<br />\nHowe Made Dame(Mem Odut)<br />\nIce Creme<br />\nSelect Guy Items<br />\nMau<br /><br />\nRICIITAUHANT 6 CAMAY 011T<br />\nPima 4674062<br />\nUNSVTY PAIRKWAY<br />\nAT UM PAUL.<br />\nPrl: 9:30 - 700<br />\nONIE APT&amp;<br />\nUNIVONIIITY<br />\nLOOM<br />\n2:00<br />\n9:30<br />\nSat<br />\nClosed Sundays<br />\nFREE SODA Wall PilS Al) AND<br />\nPURCHASE OF Si.00<br /><br />\n.• .•<br />\n-3 ,T.V • 77 ,<br /><br />\nSummer programs include- ulpanim, archaeological digs,<br />\nkibbutz service, and science projects.<br /><br />\n'<br />\n\"<br />\n=•1,4'..\" '<br />\n,, • ,•.<br />\n•<br /><br />\nSix month or twelve month programs offer volunteer<br />\nwork in development towns and kibbutzim, study<br />\nat Israeli universities, and participation as<br />\na volunteer in your profession.<br /><br />\n_••'•<br />\n- ..,` • 'c<br />\n,•„ •t,<br />\n•:<br />\nJ •<br /><br />\n.4<br />\n49<br /><br />\n•<br /><br />\n•<br /><br />\n•:-<br /><br />\n..•as•-•44<br /><br />\n••<br /><br />\nIt's all available through AZYF where<br />\nwe offer 22 different programs.<br />\nThe price includes round trip airfare,<br />\nroom and board, tuition fees<br />\n(where applicable) and tours<br />\nof Israel.<br /><br />\n, .t:1\"•,<br /><br />\nCome to Israel, soon<br /><br />\n•<br />\n'<br />\n•<br /><br />\n'\"(..tt:•1<br /><br />\n‘•\".<br /><br />\nSOCIAL SECURITY ADMINISTRATION<br />\nFEDERAL SUMMER INTERN PROGRAM<br />\n1977<br />\nSocial Security will have a limited number of positions<br />\navailable this summer for qualified students. Hopkins may<br />\nonly nominate three students in each category listed below.<br />\nCategory No. 1, GS-4 level positions in this category are<br />\navailable to students entering their senior year in the fall of<br />\n1977, who will have completed their junior year by June,<br />\n1977. Qualifying majors for these positions are liberal arts,<br />\nmathematics, statistics and computer science. All positions<br />\nare located at SSA Headquarters in Baltimore, Md.<br />\nCategory No. 2, GS-5,7 and 9 level positions in this category<br />\nare available to students who will have will have completed<br />\nall requirements for a bachelor's degree by June, 1977, and<br />\nwho have applied for, or are currently enrolled in one of the<br />\nfollowing graduate programs--mathematics, statistics,<br />\ncomputer science, economics or one of the social sciences.<br />\nPositions are located in Baltimore, Maryland and Washington,<br />\nDC.<br />\nIn addition, applicants must meet the following general<br />\nrequirements: (a) be American citizens; (b) be bona-fide<br />\ncollege students who will be returning to school in the fall;<br />\nand (c) rank in the upper one-third of their graduate class for<br />\nCategory No. 2. Sons and daughters of Department of<br />\nHealth, Education, and Welfare employees are not eligible for<br />\nthe program. Positions are not available for students majoring<br />\nin chemistry, engineering, physics, biology.<br />\nAll interested students must see Sharon Baughan, Student<br />\nEmployment Officer, 125A Garland Hall before February 28,<br />\n1977.<br /><br />\nISRREL<br />\nIt's all<br />\nyour<br />\nIsrael Program Center/American Zionist Youth Foundation<br />\n515 Park Ave N Y, N Y 10022 (212) 751-6070<br /><br />\n'poi u uo<br /><br />\nBlirs<br /><br />\n:<br /><br />\nSend me further information on your programs to Israel<br />\nEJ High School [1 College<br />\nName<br />\nAddress<br />\nCity<br /><br />\nState<br /><br />\nSchool _<br /><br />\nZip<br />\nAge<br /><br />\nEMPLOYMENT INTERVIEWS AT THE PLACEMENT BUREAU<br />\nCareer of a life time?<br />\nJob of your dream?<br />\nCome see a recruiter-Join the capitalist team!<br />\nThe following organizations will be interviewing interested students at the Placement Bureau,<br />\nRoom 135 Garland Hall, during the coming weeks. Students nearing graduation who will be<br />\nseeking full-time, permanent employment are encouraged to come to the Placement Bureau to<br />\nschedule interviews and to obtain information about employment opportunities.<br /><br />\nTuesday, February 22<br />\nUpjohn<br />\nApplied Physics Lab.<br />\nWednewday, February 23<br />\nApplied Physics Lab.<br />\nThursday, February 24<br />\nGeneral Electric Company<br />\nHughes Aircraft Company<br /><br />\nFriday, February 25<br />\nNational Security Agency<br />\nTuesday, March 1<br />\nWestinghouse Electric Corp.<br />\nWednesday, March 2<br />\nInternational Business Machines<br />\nThursday, March 3<br />\nCity of Baltimore, Dept. of Educ.<br />\nExperiment in International<br />\nLiving<br /><br />\npap 14/news,letter/february 18, 1977<br /><br />\nEUROPE<br /><br />\nwia<br />\n70<br /><br />\nWomen's basketball suffering from friction<br /><br />\nw\"Y<br />\nrr<br />\nI<br />\n/<br />\n2er:<br />\nan1<br />\nle<br />\n4<br />\nadvance !laymen! reguaexl<br /><br />\nBy DAVID KRAUS<br />\nWhen ,an<br />\nathletic team has strung together<br />\nseveral poor seasons, it is not<br />\nunnatural for friction to develop.<br />\nSuch a case is the Blue Jay<br />\nwomen's basketball team- a<br />\nsquad that has managed but one<br />\nwin in-the last three years and is<br />\n0-8 in the current campaign.<br />\nApparent dissatisfaction<br />\namong certain team members<br />\nsurfaced Tuesday evening in an<br />\narticle in The Evening Sun.<br />\nReporter Bob Ibach, writing a<br />\nstory on women's collegiate<br />\nsports in Maryland, attributed<br />\nseveral quotes to JHU basketball<br />\nco-captain Rita Chang- quotes<br />\nthat reflected dissatisfaction with<br />\nHopkins coach Pat Harris.<br />\nRita, however, was unhappy<br />\nthat her comments appeared in<br />\nthe method that they did and<br />\nfeels that Ibach misquoted her<br />\n\"I didri't appreciate my<br /><br />\nEOM:Travel Chargers<br /><br />\ncomment about the basketball<br />\ncoach being pulled out of<br />\ncontext and printed,\" the junior<br />\nfrom Hastings-on-Hudson, N.Y.<br />\nexplained. \"My point was to<br />\nexpress dissatisfaction with the<br />\nresponsiveness of the Athletic<br />\nDepartment to the women.s<br />\nbasketball team.\"<br />\nIbach disagreed.<br />\n\"No, I don't believe I did take<br />\nher statement out of context,\"<br />\nthe reporter commented.<br />\nHopkins Athletic Director Bob<br />\nScott regretted that the<br />\ncomments came out in print.<br />\n\"People have rights to make<br />\nopinions or judgements,\" the<br />\nformer lacrosse mentor noted,<br />\n\"it's just unfortunate that these<br />\ncomments were aired publicly.\"<br />\nScott disagreed that the<br />\nAthletic Department has been<br />\nunresponsive to the needs of the<br />\nteam.<br />\n-No one who is a member of<br /><br />\nthis current varsity team has been<br />\nto see me,\" he said. \"About ten<br />\ndays ago, however, someone who<br />\nis not a member of the team<br />\ncame to speak to me about the<br />\nwomen's basketball situation.\"<br />\nScott went on to say that this<br />\nwas the first such discussion he<br />\nhad had in the three years that<br />\nPat Harris had been the coach.<br />\nWhen asked about the article,<br />\nCoach Harris didn't \"care to<br />\nmake any comment.\"<br />\nDr. Joyce Hogan, the only<br />\nfull-time female instructor in the<br />\nJHU Physical Education<br />\nDepartment and a person whose<br />\nrecommendations Scott says he<br />\n\"relies heavily on\" when hiring<br />\nwomen's athletic coaches, was<br />\nnot surprised at Rita's comments.<br />\n\"Rita's said this to me several<br />\ntimes, including last year,\" Dr.<br />\nHogan explained. \"In any<br />\nendeavor, you will get people<br />\nwho disagree no matter what. In<br /><br />\naddition to complaints, I've<br />\nreceived positive features<br />\nattesting to Coach Harris'<br />\ncompetence and to the fact that<br />\nthe women enjoy playing for<br />\nher.\"<br />\nDorthea Cypher, a sophomore<br />\nmember of the team, voiced such<br />\npositive sentiments about the<br />\ncoach.<br />\n\"She's the best coach I've ever<br />\nhad, \" Dorthea claimed. \"She's<br />\nbeen an excellent teacher.\"<br />\nDespite the problems that her<br />\ncomments have caused, Rita is<br />\nhopeful that some good will<br />\ncome out of it.<br />\n\"I can only hope that my<br />\ncomments, now said and done<br />\nwith,\" she explained, \"will<br />\nfurther facillitate<br />\ncommunications between team<br />\nmembers, their coaches and the<br />\nAthletic department.\"<br />\nThat is something that only<br />\nthe future will be able to reveal<br /><br />\nThe<br />\nchallenge.<br />\nYour challenge is to discover words of<br />\nfour letters in this pentagon. Discover<br />\nthem by following the straight lines to<br />\nand from the letters,forming words as<br /><br />\nyou go.You may not use two of the same<br />\nletters in any one word.lf you can make<br />\n30 words or more, you've met the<br />\nchallenge.<br /><br />\nColl to!I free<br />\n6 to 9 0 m<br /><br />\n(800) 325-4867<br />\nor see your travel agent<br /><br />\nBUSINESS<br /><br />\n, WPOIATUNI,<br /><br />\nStuff Envelopes<br /><br />\nI<br /><br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.226<br />\n102 Charles Street<br />\nBoston,Mass. 02114<br />\nJOHN GA- CII HO'.SHOP<br />\n&lt;<br /><br />\nBA LT EMOR E'S LA H'<br />\nUSED<br /><br />\n.e.<br /><br />\naJTP. 3<br />\n3322 Greenmount Avenue<br />\n467-4344<br />\nUSED AND RARE<br />\nOLD AND OUT—OF- PR IN\"r<br /><br />\nBUS1NF'S' OPPORTUNffY<br /><br />\nStuff EnveloEs<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.3394<br />\n1 310 Franklin Street<br />\nBoston,Mass. 02110<br /><br />\n+yr<br />\nGoodoteam oe c<br />\nWiri‘tlii<br /><br />\nM<br /><br />\nWhen there's a challenge,<br />\nquality makes the difference.<br />\nWe hope you have some fun with the challenge.<br />\nThere's another challenge we'd like to offer you, too.<br />\nThe Pabst challenge:<br />\nWe welcome the chance to prove the quality of<br />\nour beer. We challengeyou to taste and compare<br />\nPabst Blue Ribbon to any other premium beer. You'll<br />\nlike Pabst better. Blue Ribbon quality means the best<br />\ntasting beer you can get. Since 1844 it always has.<br /><br />\nPABST. Since 1844.The quality has always come through.<br />\n019/<br /><br />\n•s v.\" s<br /><br />\ns<br /><br />\ns<br /><br />\nPABST E3Flf NANO COMPANY Molwaukee Ms Poona Fle.ghts III Newark NJ . los Angeles Calif<br />\nPabst Georgia<br /><br />\n• —\"<br /><br />\n•s<br /><br />\ns—\"<br /><br />\n.\"<br /><br />\n•<br /><br />\ns<br /><br />\n•_\" s. s<br /><br />\ns<br /><br />\ns<br /><br />\n-<br /><br />\nfebruary 18, 1977/news-letter/page 15<br /><br />\nSmoke 'em, Jays<br /><br />\nHoopsters drop two: Haverford, F&amp;M get the buckets<br />\nBy ANDREW COHEN<br />\nIt's been a rough week so far<br />\nfor the Blue Jay varsity<br />\nbasketball.<br />\nMonday evening, Hopkins<br />\nproved to be formidable<br />\ncompetition for the number five<br />\nnationally rated basketball team<br />\nin Division III as they dropped a<br />\nClose one to the Franklin and<br />\nMarshall Diplomats, 80-73 in the<br />\nWhite Athletic Center,<br />\nJHU travelled to Haverford<br />\nWednesday night and lost an<br />\nimportant Mac division game as<br />\ntheir hosts won 83-75.<br />\nMonday night, the Diplomats<br />\nheld a twenty-five point<br />\nadvantage over the Jays in the<br />\nsecond half, but blew it when the<br />\nhome team led by John Finston,<br />\nAndy Scheinfeld, Dean Uhler,<br />\nKevin Kabat and Mike Phipps<br />\noutscored Franklin and Marshall<br />\n23 to 5 in an incredible six<br />\nminute surge that brought the<br />\nfighting Jays to within four<br />\nPoints of the lead.<br />\nThe game opened with the<br />\nJays giving the stronger team<br />\nquite a scare. The Diplomats<br />\ncontrolled the tip, taking the ball<br />\ndown court setting up for an<br />\noffensive play. F&amp;M missed their<br />\nshot and Dan Kopcza was in<br />\nPosition for the rebound. Finston<br />\nmissed the Jays opening shot, but<br />\non the ensuing defensive play,<br />\nguard Scheinfeld forced a jump<br />\nby tying up a Diplomat offender.<br />\nAndy won the toss up, sending<br />\nthe ball to 6'8\" Uhler who hit on<br />\na beautiful five foot turnaround<br />\nJump shot for the 2-0 lead.<br />\nThe visiting opponents quickly<br /><br />\nInstant replay!<br /><br />\ntied the score off a fine passing<br />\nconnection from sophomores<br />\nKen Hopson and Mark Worley<br />\nwhich resulted in a driving layup.<br />\nUhler broke the tie by sinking a<br />\nfoul shot, but a short from<br />\nDiplomat forward John Boyer<br />\nput his team on top 4-3. The<br />\nscore seesawed back and forth<br />\nuntil consecutive buckets by<br /><br />\nUhler and guard Kabat gave the<br />\nJays a three point lead at the six<br />\nminute mark of the first half.<br />\nBut the lead did not last long<br />\nfor the Blue Jays. The Diplomat<br />\noffense took over outscoring the<br />\nJay offense 15-4 putting the tally<br />\nin their favor 23-15 halfway<br />\nthrough the twenty minute<br />\nperiod. The rest of the first half<br /><br />\nsaw the Diplomats catch fire,<br />\nhitting every shot in sight. Junior<br />\nDon Marsh and sophomore Bob<br />\nManaskie led the team in scoring<br />\nin the first half with 14 points<br />\nand 10 points, respectively. Uhler<br />\npoured in 13 points for the Jays,<br />\nbut they found themselves down<br />\n44-27 at the end of the first half.<br />\nThe Diplomats also<br />\noutrebounded the Jays 24-10.<br />\nThe second half saw F&amp;M<br />\ncontinue to build up their lead<br />\nuntil they had a 60-35 advantage<br />\nwith fourteen minutes left in the<br />\ngame. From that point on the<br />\nJays chipped away bit by bit at<br />\nthe Diplomat lead.<br />\nApparently, F&amp;M figured that<br />\nthe Blue Jays had given up on the<br />\ngame's outcome, so they replaced<br />\ntheir first string team with their<br />\nscrubs. But the Jays wouldn't<br />\nquit. Offensive surges led by<br />\nPhipps, Finston, and Scheinfeld<br />\nput the Jays to within four<br />\npoints of the Diplomats.<br />\nUnfortunately for the Jays, their<br />\nsurge was too little too late and<br />\nthe Jays went down to defeat<br />\n80-73.<br />\nThe contest against Haverford<br />\nwas a fairly even affair. Neither<br />\nteam could amass a substantial<br />\nlead through the first half and<br />\nthe Jays went into the locker<br />\nroom with a slim 43-42<br />\nadvantage.<br />\nHaverford, however, was able<br />\nto pull away in the second<br />\ntwenty minutes. Led by<br />\nBaltimore product Larry Keith's<br />\n27 points, the Pennsylvanians<br />\nwere able to claim the victory..<br />\nInterestingly, it was<br /><br />\nJay women's squash winning a good deal<br /><br />\nTANK MeNAMMIA<br /><br />\nOne of the most reccnt<br />\nadditions to the Blue Jay<br />\nintercollegiate sports program is<br />\nProving that it doesn't take very<br />\nlong to build a winning tradition.<br />\nThe Hopkins women's squash<br />\nteam, under the tutelage of<br />\nnational amateur squash<br />\nchampion Dr. Joyce Hogan, has<br />\nfashioned a dual meet record of<br />\nSi so far this season in only its<br />\nsecond year of competition.<br />\nIn last year's inaugural<br />\nCampaign, the squad had amassed<br />\na- fine 6-4 mark and was looking<br />\nfor eontinued success. However,<br />\ntheir hopes were dampened<br />\nearlier this year when Beth<br />\nLenowitz, last year's number one<br />\nPlayer, .was lost for the season<br />\ndue to an injury.<br />\nDespite this. blow, the team<br />\ncame on stronger than ever.<br />\nPaced by Joann Beckwith, Lisa<br />\nGottesfeld, Kate Foster and Barb<br /><br />\nduring the weekend of January<br />\nThomas (except for Foster, each<br />\nis in their first year of 28-30. At that round-robin<br />\ncompetition), the squad has tournament, the Jays placed 13th<br />\nin a field of 17. Hopkins returned<br />\nscored impressive victories over<br />\nto dual, meet competition on<br />\nan array of opponents. Rounding<br />\nout the squad are Marlene Tandy, February 4th when it hosted a<br />\nthree-way series with Franklin<br />\nNancy Tang, Debbie Weigel and<br />\nMarybeth Fasano.<br />\nand Marshall and George<br />\nEllett' meet is, composed of a<br />\nWashington. JHU downed F and<br />\nnumber of singles matches. Due. M 5-2 and GW 7-0 to run its<br />\nrecord to 4-0.<br />\nto the fact that the sport is still<br />\nOn February 5th, the squad<br />\nin its growing stages on the<br />\nintercollegiate level, there is no<br />\ntravelled to Charlottesville,<br />\nset amount of matches they will<br />\nVirginia to face the University of<br />\nplay when they contract to play<br />\nVirginia. There, the Jays nipped<br />\neach other.<br />\ntheir hosts 3-2 to maintain an<br />\nThe team opened its season on<br />\nlriblemished record.<br />\nDecember 3rd when it travelled<br />\nThe University of Pennsylvania<br />\nto Washington, D.C. to defeat<br />\npinned the only defeat on the<br />\nGeorge Washington 7-0. The<br />\nJays, downing JHU 5-1 in<br />\nfollowing, the team ran its record<br />\nPhiladelphia on February 10th.<br />\nto 2-0 with a 6-1 home victory<br />\nAt the Penn round robin<br />\nover Swarthmore.<br />\ntournament the following day,<br />\nThe next competition for ale<br />\nHopkins entered two teams with<br />\nteam was the Howe Cup at Yale<br />\nmixed results. The \"A\" squad<br /><br />\nYOU ON TRIAL. root NUI4?<br />\nFOR 121%0YALTY To TPE<br />\n5TATE um veg5ITY FooTBALL<br />\nPROGRAM ?<br /><br />\nuJAAT G17I Po WRONG 7<br />\nI'VE 50u61-1T 9,64WN<br />\n1iCKGT5 FOR 15YAU<br /><br />\nplaced fourth in a field of five,<br />\nwhile the \"B\" team finished<br />\nsecond out of seven participants.<br />\nDr. Hogan has been surprised<br />\nat the team's Success so far, but<br />\nsees the team members<br />\nwillingness to practice as a main<br />\nreason for the squad's excellent<br />\necord.<br />\n\"Practice really does make a<br />\ndifference,\" the Coach explained.<br />\n\"We're starting to play 'smart'<br />\nsquash, something we didn't do<br />\nlast year. We're doing more than<br />\njust trying to keep the ball in<br />\nplay.\"<br />\nDr. Hogan is looking to the<br />\nfuture with continued optimism.<br />\nThe team is composed mainly of<br />\nunderclassmen and, according to<br />\nthe coach, this squad \"will have<br />\nalot of productive years ahead.\"<br /><br />\nAMP L-P6T YEAP You<br />\nNO-4-101AJED FOUR TIM.e(7.<br />\nEMPTY 5EAT' LODI&lt;<br /><br />\nTERRIBLE ON<br />\nNATIONAL TELevii0tv,<br />\nir<br />\nPa.<br />\ncouLP Avg<br />\nouRREaturnO\"<br />\nPeO&amp;RAM<br /><br />\nHaverford's success at the foul<br />\nthrow line that proved to be the<br />\nBlue Jays' downfall. Both squads<br />\nshot an identical 33-63 from the<br />\nfloor, but the hosts hit on'17 of<br />\n26 foul shots while JHU was 9<br />\nfor 12 from the line.<br />\nThe Jays conclude their<br />\nregular season tonight as they<br />\ntravel to Chestertown, Maryland<br />\nto face Washington College. A<br />\nvictory is crucial if Hopkins is to<br />\nremain in the running for the<br />\nMAC championship.<br />\nA win tonight will give the<br />\nBlue Jays an MAC record of 6-4,<br />\n'tying the-in with Haverford for<br />\nsecond place in the division. It<br />\nwill be then be up to the MAC<br />\nGames committee to determine<br />\nwhich team should enter the<br />\nplayoffs or whether there should<br />\nbe a game to decide that issue.<br />\nThe men's junior varsity<br />\nbasketball team is also bringing<br />\nits season to a close. Monday<br />\nevening, the Junior Jays dropped<br />\na contest to their counterparts<br />\nfrom Franklin and Marshall,<br />\nbringing their seasonal record to<br />\n4-8.<br />\n'Key players for the JV squad<br />\nthis year have included Ken<br />\nSeusse, Bobby Weisner, John<br />\nDowning and Bob Kluttz, Jeff<br />\nEarle and Jim Fine. The squad<br />\nhopes to close its season on a<br />\nwinning note tonight when it<br />\ntravels to Washington College.<br /><br />\nshorts<br />\nThe Men's Varsity Wrestling<br />\nteam gained its first victory of<br />\nthe season last weekend when it<br />\ndowned Ursinus 35-18 as one end<br />\nof a four-way competition held<br />\nat Swarthmore College. The team<br />\ncloses out its season next<br />\nweekend when they travel to<br />\nElizabethtown, Pennsylvania to<br />\nparticipate in the MAC<br />\nchampionships meet.<br /><br />\nThe Women.'s varsity Fencing<br />\nTeam continues its season as it<br />\ntravels to Philadelphia tomorrow<br />\nafternoon to participate in a<br />\nfour-way meet at Temple<br />\nUniversity. In addition to facing<br />\ntheir hosts, the Lady Jays will<br />\nalso compete agains; the<br />\nUniversity of Pennsylvanih and<br />\nBrockport State College.<br />\nThe Men's varsity Fencing<br />\nTeam is sporting a 21-2 record<br />\nfollowing last week's 20-7<br />\ntrouncing of Haverford.<br />\n.1-omorrow, the Jays travel to<br />\nCollege Park to face Maryland<br />\nInd William and Mary. Victories<br />\nsiver both of these opponents<br />\nwould give the Jays a final record<br />\nof 23-2, the best in the team's<br />\nhistory.<br />\nThe Women's Varsity<br />\nSwimming Team closes out its<br />\nhome season tomorrow<br />\nafternoon with a meet- against<br />\nMAC rival Ursinus. Ursinus was<br />\nthe chief competition for the<br />\nJays at last year's MAC<br />\n'Thampionship meet and these<br />\nwo teams expect to battle it out<br />\ngain this year. The action begins<br /><br />\nat.2,;00.<br /><br />\nELisiGNE<br /><br />\npap, 14/news,letter/february 18, 1977<br /><br />\nWomen's basketball suffering from friction<br />\nBy DAVID KRAUS<br />\nWhen an<br />\nathletic team has strung together<br />\nseveral poor seasons, it is not<br />\nunnatural for friction to develop.<br />\nSuch a case is the Blue Jay<br />\nwomen's basketball team- a<br />\nsquad that has managed but one<br />\nwin in-the last three years and is<br />\n0-8 in the current campaign.<br />\nApparent dissatisfaction<br />\namong certain team members<br />\nsurfaced Tuesday evening in an<br />\narticle in The Evening Sun.<br />\nReporter Bob Ibach, writing a<br />\nstory on women's collegiate<br />\n-sports in Maryland, attributed<br />\nseveral quotes to JHU basketball<br />\nco-captain Rita Chang- quotes<br />\nthat reflected dissatisfaction with<br />\nHopkins coach Pat Harris.<br />\nRita, however, was unhappy<br />\nthat her comments appeared in<br />\nthe method that they did and<br />\nfeels that Ibach misquoted her.<br />\n\"I didn't appreciate my<br /><br />\ncomment about the basketball<br />\ncoach being pulled out of<br />\ncontext and printed,\" the junior<br />\nfrom Hastings-on-Hudson, N.Y.<br />\nexplained. \"My point was to<br />\nexpress dissatisfaction with the<br />\nresponsiveness of the Athletic<br />\nDepartment to the women.s<br />\nbasketball team.\"<br />\nIbach disagreed.<br />\n\"No, I don't believe I did take<br />\nher statement out of context,\"<br />\nthe reporter commented.<br />\nHopkins Athletic Director Bob<br />\nScott regretted that the<br />\ncomments came out in print.<br />\n\"People have rights to make<br />\nopinions or judgements,\" the<br />\nformer lacrosse mentor noted,<br />\n\"it's just unfortunate that these<br />\ncomments were aired publicly.\"<br />\nScott disagreed that the<br />\nAthletic Department has been<br />\nunresponsive to the needs of the<br />\nteam..<br />\n\"No one \" who is a member of<br /><br />\nthis current varsity team has been<br />\nto see me,\" he said. \"About ten<br />\ndays ago, however, someone who<br />\nis not a member of the team<br />\ncame to speak to me about the<br />\nwomen's basketball situation.\"<br />\nScott went on to say that this<br />\nwas the first such discussion he<br />\nhad had in the three years that<br />\nPat Harris had been the coach.<br />\nWhen asked about the article,<br />\nCoach Harris didn't \"care to<br />\nmake any comment.\"<br />\nDr. Joyce Hogan, the only<br />\nfull-time female instructor in the<br />\nJHU Physical Education<br />\nDepartment and a person whose<br />\nrecommendations Scott says lie<br />\n\"relies heavily on\" when hiring<br />\nwomen's athletic coaches, was<br />\nnot surprised at Rita's comments.<br />\n\"Rita's said this to me several<br />\ntimes, including last year,\" Dr.<br />\nHogan explained. \"In any<br />\nendeavor, you will get people<br />\nwho disagree no matter what. In<br /><br />\n\\<br /><br />\naddition to complaints, I've<br />\nreceived positive features<br />\nattesting to Coach Harris'<br />\ncompetence and to the fact that<br />\nthe women enjoy playing for<br />\nher.\"<br />\nDorthea Cypher, a sophomore<br />\nmember of the team, voiced such<br />\npositive sentiments about the<br />\ncoach.<br />\n\"She's the best coach I've ever<br />\nhad, \" Dorthea claimed. \"She's<br />\nbeen an excellent teacher.\"<br />\nDespite the problems that her<br />\ncomments have caused, Rita is<br />\nhopeful that some good will<br />\ncome out of it.<br />\n\"I can only hope that my<br />\ncomments, now said and done<br />\nwith,\" she explained, \"will<br />\nfurther facillitate<br />\ncommunications between team<br />\nmembers, their coaches and the<br />\nAthletic department.\"<br />\nThat is something that only<br />\nthe future will be able to reveal<br /><br />\n\"•••<br /><br />\nbOranC*<br /><br />\nCall toil free<br />\n6 to 9 p m<br /><br />\n(800) 325-4867<br />\nor see your travel agent<br /><br />\nathuTravel Charters<br />\nBUSINESS<br /><br />\niIPPOIITUNiTY<br /><br />\nStuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.226<br />\n102 Charles Street<br />\nBoston,Mass. 02114<br />\nJOHN GA-CH BO<br /><br />\nSHOP<br /><br />\nBALTIMORE'S LARGt•I<br />\nUSEij,BOOKT\"<br /><br />\n1<br /><br />\nr%11P<br />\n3322 Greenmount Avenue<br />\n467-4344<br />\nUSED AND RA- RE<br />\nOLD AND OUT—OF<br /><br />\nPRINT<br /><br />\n•••<br /><br />\nThe<br />\nchallenge.<br />\nYour challenge is to discover words of<br />\nfour letters in this pentagon. Discover<br />\nthem by following the straight lines to<br />\nand from the letters,forming words as<br /><br />\nle4n1/2errrg-d.<br /><br />\nBUSINF'SC OPPORTUNffY<br /><br />\nStuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.339A<br />\n310 Franklin Street<br />\nBoston,Mass. 02110<br /><br />\nyou go.You may not use two of the same<br />\nletters in any one word.lf you can make<br />\n30 words or more, you've met the<br />\nchallenge.<br /><br />\nyv-<br /><br />\nWhen there's a challenge,<br />\nquality makes the difference.<br />\nWe hope you have some fun with the challenge.<br />\nThere's another challenge we'd like to offer you, too.<br />\nThe Pabst challenge:<br />\nWe welcome the chance to prove the quality of<br />\nour beer. We challengeyou to taste and compare<br />\nPabst Blue Ribbon to any other premium beer. You'll<br />\nlike Pabst better. Blue Ribbon quality means the best<br />\ntasting beer you can get. Since 1844 it always has.<br /><br />\nPABST'. Since 1844.The quality has always come through.<br />\n0191/ PABST BRE- AfthiC)COMPANY Milwaukee NAs . Peoria Heights Ill Newark NJ . Los Angeles. Calif Pabst. Georgia<br /><br />"}], "field_media_file": [{"target_id": 41189, "display": null, "description": null, "target_type": "file", "target_uuid": "fd887425-1d7b-4838-b615-6e4be41c1332", "url": "http://digital.library.jhu.edu/system/files/2022-03/14343-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 14343, "target_type": "node", "target_uuid": "6fd2ccef-e451-4860-a4ae-60a5f7b919ee", "url": "/node/14343"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "44694033-11f8-4b34-afa3-6367ee97c6f2"}]}