{"mid": [{"value": 35686}], "uuid": [{"value": "35e8b8c9-d445-40af-a09c-b1fff438759d"}], "vid": [{"value": 35686}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12224-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol. VII, No. 4<br />\n<br />\nDecember 5, 1902<br />\n<br />\nTHE<br />\n<br />\nNEWS LETTER<br />\nEIP-1<br />\n<br />\nBEING<br />\n<br />\nTHE<br />\n<br />\nFOURTH NUMBER<br />\n<br />\nOP'<br />\n<br />\nVOLUME SEVEN<br />\n<br />\nPUBLISHED BY STUDENTS<br />\n<br />\nJOHNS HOPKINS UNIVERSITY<br />\n<br />\n\fTile Jotins Hopkins Universitil<br />\n<br />\nThe Johns Hopkins Press.<br />\n<br />\nBALTIMORE, MARYLAND.<br />\n1.<br />\n<br />\nTWENTY-SEVENTH YEAR.<br />\n<br />\n11.<br />\n<br />\nBeginning October 1, 1902.<br />\nPresident: Inn REM NEN. Dean of the Medical Faculty:<br />\nWILLIAM H. HOWELL. Dean of the College Faculty:<br />\nEewnitn H. flitrefere.<br />\n<br />\nFOR GRADUATE STUDENTS:<br />\n(a) In Philosophy and the Arta. (Courses for candidates for the degres of Ph. D.)<br />\n(b) In Medicine. (courses for candidates for the<br />\ndegree of M. D.; courses for physicians,)<br />\n<br />\nFOR UNDERGRADUATES:<br />\n(e) AS candidates for the degree of 11. A.<br />\n(d) As special students.<br />\n<br />\nLibraries.<br />\nUniversity,<br />\n105,000 volumes.<br />\nPeabody Institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br />\n<br />\nLaboratories.<br />\n<br />\nSeminaries.<br />\n(\"reek.<br />\nLatin.<br />\nSanskrit<br />\nSemitic.<br />\nGormau.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\nEconomics.<br />\nMathematics.<br />\nPhysics.<br />\n<br />\nVolume<br />\n<br />\n?American Chemical aournal.<br />\nI. It EMSE N. Editor. Monthly. 8vo.<br />\nXXVIII in progress. $5 per volume.<br />\n<br />\nVolume<br />\n<br />\n111. !American :lournal of Philology.<br />\nB. L. G I LDERSLEE E, Editor. Quarterly. 8vo.<br />\nVolume XXIII in progress. $3 per volume.<br />\n11D.<br />\n<br />\nStubies from the 23iological /aboratory.<br />\nVolume V complete. $6 per volume.<br />\n<br />\n8vo.<br />\n<br />\nW.5tubies in ?historical anti Political $cience.<br />\nMonthly. Svo. Series X X in progress.<br />\nvolume.<br />\n<br />\nInstruction.<br />\n<br />\nChemistry.<br />\nPhysics.<br />\n4 ieology and Mineralogy.<br />\nZoology<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br />\n<br />\nlimerican 3ournai of ebatbematice.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nXXV in progress. $5 per volume.<br />\n<br />\nDirectors.<br />\nIra Remelt.<br />\nJoseph 8. Amex.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin<br />\nMall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn .1. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oster.<br />\n<br />\nDirectors.<br />\nBasil L. Grildersleeve.<br />\nKirby<br />\nsmith,.<br />\nMaurlee Bloomfield.<br />\nPaul.Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott..<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nWI.aohne tophins 'University Circulars,<br />\nContaining reports of scientific and literary wo<br />\nin progress in Baltimore. 4to. Vol. XXII in<br />\nprogress. $1 per year.<br />\nWill. 3ohns lbophine 'ibospital eulletin. Monthly. 4th.<br />\nVolume XIII in progress. $1 per year.<br />\n11111. aobno lbophins lboopital 'Reports. 4to. Volume X<br />\npnigress. $5 per volume.<br />\n1X.<br />\n<br />\nContributions to liesyrtology ant) Comparative<br />\n%entitle Philology, (Beitrage zur Aseyriologie, etc.)<br />\nVol. IV complete.<br />\n<br />\nX.<br />\n<br />\nIleemoirs from the 161.oloeical laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br />\nIleobern laniguiee 'Rotes. ,?<br />\nA. M. E L1,1011', Editor. Monthly. 4to. Volume<br />\nXVII in progress. $1.50 per volume.<br />\n<br />\nX11. Journal of experimental<br />\nW. H. WELCH, Editor. Hi-monthly. livo. Volume<br />\nVI in progress. $5 per volume.<br />\nX111.!American 3ournal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly.41.o. $5 per<br />\nvolume.<br />\nX111). -Reports of finaryianb eeoloeica 93urney.<br />\nW I I, LIAM B.(7LA IRK, Editor.<br />\nD.Cerrestrial Magnetism anti litmospberic elec.<br />\ntricIty L. A. BA 11 Elt, ltditor. Quarterly. 8vo.<br />\nVolume Vii in progress. $2.50 per volume.<br />\nV101. !Unmet 'Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the Univers'<br />\nduring the past academic year.<br />\nATM annual'register.<br />\nGiving the list of officers and students,and stating<br />\nthe regulations, etc., of the University. Published at the close of the, academe year.<br />\n<br />\nUndergraduate Courses (leading to B. A.)<br />\n(Iron pm.<br />\nI. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\nChemical-Biological<br />\n(leading un to medicine).<br />\n4. Geological-Biologieal.<br />\n5. Latin-Mathematical.<br />\n0. Ilintorical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br />\n<br />\nSerial Publications.<br />\nAmerican Journal of NI athematic).(vol. XX V).<br />\nAmerican Chemical Journal (vol. XX VI II).<br />\nAmerican Journal of Philology (vol. XXII!).<br />\nStudies in Historical and Political Science (vol. XX).<br />\nModern Language Notes(vol. XVII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to Assyriology (vol. IV.<br />\nTerrestrial Magnetism (vol. VII).<br />\nn Extensity Circulars (vol. X X II).<br />\nProgrammes of the courses offered to graduate students In Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\neieirsee, will be sent, on appl IC11114)11 to 1)10 Regied rar.<br />\n<br />\nIn addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nlitowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simile edition. Edited by J. Bendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nItoproduetion In Phototype of Syriac MSS. with Antilegomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographic Hopkinsiensis. Part T. Philology. Parts<br />\nTI-Ill. Chemistry, Mineralogy and Geology. Parts<br />\nV-V-V1. Physics.A stroremy and Mathematics.<br />\nS vo. :10 cents per part.<br />\nfl full list of publications will be sent on application.<br />\n<br />\nCommunications in respect to exchanges and remittances<br />\nmay he bent to Johns flopkins Press, Baltimore, Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VII.<br />\n<br />\nDECEMBER 5, 1902.<br />\n<br />\nNo. 4.<br />\n<br />\nJOURNALISM FOR BEGINNERS.<br />\n<br />\n9<br />\n<br />\n44<br />\n<br />\nON'T do it,\" wrote a newspaper man in THE NEws-LETTER of November 20, to college Seniors who think they can win place as writers<br />\nby the path of the newspaper office. I read 'Charley\" Bump's name<br />\nunder that piece of advice with a little surprise. Knowing him for so good a<br />\nnewspaper man as he is, I might fairly have expected him to be even a little<br />\nenthusiastic on the other side. He feels toward his business, however, as many<br />\nof the men do who have come to know any part of it with any intimacy. The<br />\nnewspaper business isn't a good thing for anybody unless it is a good thing<br />\nThat's equally true of any other business,\" you reply And so it is. But<br />\nthe newspaper business is overcrowded with men who are misplaced in it as<br />\nmuch as second story men in the sanctuary. The sanctuary, indeed, is supplied with many excellent priests. Newspaper men of the first class, I believe,<br />\nare not nearly so common in the newspaper business.<br />\nA graduate student of Dr. Ames' department probably expressed the chief<br />\nreason for this a few nights ago. \"Ah,\" he said to me, \"but there's a glamor<br />\nabout a newspaper man's life!\" I've heard this so often that I'm beginning to<br />\nbelieve it. There is a tremendous \"glamor about the newspaper man's life.\"<br />\nMost of the 'glamor\" lies in the observer's eye. It doesn't do the newspaper<br />\nman any harm if he is sensible, but it may lead the observer to make a fool of<br />\nhimself. \"Glamor\" is just the whirlpool for the college fellow whose anchor<br />\nisn't out—sometimes it is strong enough to make one drag his anchor. A few<br />\nsuch craft are built for this sort of stress—they drive with the swirl to its<br />\nroughest place and its speed increases their momentum; they don't last their<br />\nfull span, hut while their timbers hold they win a jolly struggle with the<br />\nstorm as others go down about them. Some beat ground and escape the whirl—<br />\nafter learning enough seamanship to keep in the quiet water. Some are dis<br />\nmantled after a long fight and are thrown out without machinery or canvas<br />\ninto the open ocean—derelicts. In a limited prospect, I have seen fleets of all<br />\nthese three kinds of newspaper craft.<br />\nToo many of the unfit enter the newspaper business They know a reporter who says, \"Hello, Jack!\" to a Congressman, exchanges small talk with<br />\na bishop, confers confidentially with the marshal of police, fills free seats in<br />\ntheatres, enjoys the privilege of getting drenched under the walls of a burning<br />\nwarehouse, wades in Wood at every murder, gets mysterious communications<br />\nfrom bartenders and hackmen, drinks champagne occasionally and smokes<br />\nCigars for which he doesn't pay, and then calls on the president of a woman's<br />\ncollege. This is a first-class \"glamor\" outfit. Of course, coming one after the<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nother, the Congressman, the bishop, the marshal, the bartender, the blood and<br />\nfire and water and all the rest,—they have the diverting effect of novelties.<br />\nBut, then, the repetition of diversity is monotony itself. It is true that the reporter may make useful friends among those he meets. It is also true that<br />\nmost of the people he visits are not aggressively glad to see him unless they<br />\nwant something and, perhaps, have sent for him. With equal truth the report•<br />\nthing<br />\ner may make enemies—and he sometimes does. Here is an exasperating<br />\nhis<br />\nin<br />\nnot<br />\nhim,<br />\nto<br />\ncome<br />\nThey<br />\nincurs:<br />\nhe<br />\nenmities<br />\nabout a great many of the<br />\nsome<br />\nlike<br />\nlife,<br />\nnewspaper<br />\nof<br />\n\"glamor\"<br />\nThe<br />\nown fight, but in \"The Paper's.\"<br />\nother intangible things, dissipates rather easily. Beyond the \"glamor\" of it,<br />\nin the diversity of the reporter's side of it, there is as much bodily exhaustion<br />\nand brain-fag as elsewhere; very often a great deal more than elsewhere.<br />\nCharley Bump repeats several times that the young man's \"world-illumining volume\" will never be written if he remains a conscientious newspaper man.<br />\n\"Why, that fellow must be buggy,\" I heard a freshman say, \"everybody<br />\nknows that Dickens was a reporter.\" If this boy ever comes to read the brief<br />\nest of the obituary \"notices\" he will learn that reporters pass away with the<br />\nsame regularity as millionaires, and when he has read all the longest of \"the<br />\ngreatest of recent novels\" he will understand that hundreds of thousands of<br />\nnewspaper men died during the nineteenth century, but in all that time God<br />\nmade only one Dickens. All this, however, is where the \"glamor\" used to be—<br />\nin my eye. Never having coddled an ambition to \"illumine\" the \"world\"<br />\nby a \"volume,\" I feel no sting in not being able to do so. But I distrust the<br />\nnewspaper business on grounds both sentimental and commercial—not for<br />\neverybody, understand, but for myself and the majority who, I believe, are<br />\nlike me.<br />\nTo spend your life in telling what other people are doing seems an empty<br />\npursuit. Yet an army of conscientious and industrious newspaper workers are<br />\nbusy at it. Let them become deeply interested in the great movements, the<br />\nlarge causes, with which they deal, and they warp their chronicle If they<br />\ntake sides, someone claims they have done him an injustice—some of them<br />\nsometimes suffer for being thus unjust. Not every newspaper man can say to<br />\nhimself, \"this is my game and here goes for it.\" The personal feeling with<br />\nwhich a chemist watches the development of a discovery, a merchant the<br />\ngrowth of his business, or an engineer the fulfilment of his plans is not possible<br />\nfor the private in the newspaper army.<br />\nVery often—ever so often—the newspaper man is a spasmodic purveyor to<br />\na literary mince-pie of daily bake. \"Ah, hut the cook!\" you say,``The cook's<br />\nthe thing!\" And it's true. The cook is the editor or the publisher. Some.<br />\ntimes he's both. He inspects the citrons, the raisins and the meat, the lard<br />\nand the flour, throws out the specked, the rancid, the mouldy, and the taste<br />\nless, mixes the rest as he thinks they ought to go, rolls the pastry and meas<br />\nures in the mince meat, makes the pie, bakes it—and takes the profits of the<br />\nsale. The cook is the craft that weathered the whirlpool. These similes are<br />\nnot more mixed than the mince-meat in the pie. The real newspaper man be-<br />\n<br />\n\fTHE N EWS—LETTER.<br />\n<br />\n3<br />\n<br />\ncomes the cook, or at least, the meat-mixer or the pastry maker. A great many<br />\nSpecial qualities fit him for the post—and nearly always he is deeply penetrated by a conviction of the dignity of making mince pies. The real newspaper man really loves his calling, comes back to it every day with a freshened<br />\nmind to see the large things which he can make his own, starts movemen<br />\na<br />\nt or<br />\nenters a fight as one of the parties to it, will make The Paper's enemies his own<br />\non sight, will toil in all circumstances personall<br />\ny and impersonally to increase<br />\nits fame. He could no more be a great teacher, physician<br />\n, merchant, engineer, or<br />\nsomething else, perhaps, than any of these could be a first-class newspaper<br />\nman, but this doesn't worry him at all. There are large rewards and dignities<br />\nin the newspaper business, but most<br />\nof them are for real newspaper men. The<br />\nreturns which come to a man who is in such work but doesn't belong there<br />\nare unspeakably smaller than those which the same industry,<br />\nintelligence, and<br />\nfair purposes would win him in almost any other business. Many<br />\nof us in the<br />\nnewspaper business are not real newspaper men—many of us can compete no<br />\nbetter with those who are than a chicken can swim a duck across a mill-pond.<br />\nThe total of the qualities which distinguish a real newspape man<br />\nr<br />\nare easier to<br />\nsee and feel than to state. Those who have them will probably know<br />\nit. A<br />\ngrown man, if he ponders the thing, ought not to mistake \"glamor\" and<br />\n((<br />\ngraft\" for a real call to the newspaper business. Preach, teach, or sell snuff,<br />\nbe physicians or coffin-makers, engineers or anything<br />\nelse you are qualified to<br />\ndo well or to be properly. Dig the \"glamor\" out<br />\nof your eye and the \"graft\"<br />\nout of your soul whenever they afflict you. Think well unless you have<br />\na<br />\nmagazine of illusions to last a lifetime, or unless—\"Don't do it.\"<br />\n<br />\nMARSHALL BALLARD, '98.<br />\nTHE COLLEGE CONVENTION.<br />\nT the sixteenth annual convention of the Association of Colleges and Preparatory Schools of the Middle West and Maryland, held in this city<br />\nduring the Thanksgiving vacation, Dr. Remsen was elected president,<br />\nafter delivering the address of welcome. The delegates were the guests of<br />\nHopkins at the sessions, which were held in McCoy Hall, and at a lunch<br />\nserved in the Gymnasium.on Friday.<br />\nAn amusing feature of the exercises consisted of the anecdotes which were<br />\nrelated by some of the speakers As might be expected, they related mostly to<br />\nunusual answers on examination papers.<br />\n. Miss Salmon, of Vassar, told of a student who defined Mason and Dixon's<br />\nline as \"the boundary above which you can't sell corn whisky.\"<br />\nThe faculty delegate from Rutgers College gave the answer of a student<br />\ntaking an English examination, who had been asked to give examples of the<br />\nindicative, subjunctive, and imperative moods in English. He wrote: \"If I<br />\nanswer ten questions, I shall pass. If I answer eight questions, I may pass.<br />\nGod help me!\"<br />\nHe did not pass.<br />\n<br />\nQX<br />\n<br />\n\fTH E NEWS—LETTER.<br />\nALUMNI.<br />\nWilliam V. Willoughby, who last year succeeded Dr, Jacob H. Hollander<br />\nas Treasurer of Porto Rico, visited the University last week.<br />\nMorris C. James, who has been in California since graduating, has<br />\n'92<br />\nrecently been appointed instructor in Latin and Greek at the Berkeley High<br />\nSchool, Berkeley, California.<br />\nMr. Charles B. Clark is now in Cincinnati, being employed with the<br />\n'95<br />\nCincinnati, Cleveland and St. Louis Railroad.<br />\nDr. John Montgomery \\Vest is in Germany, at the University of Ber'96<br />\nlin, pursuing special studies in diseases of the throat.<br />\nDr. George L. P. Radcliffe, having resigned his position at the Balti'97<br />\nmore City College, has joined the Hopkins contingent in the law department of<br />\nthe University of Maryland.<br />\nZ. Marshall Ballard is again at the University as student. He has<br />\n'98<br />\nentered the graduate department of geology.<br />\n<br />\n'88<br />\n<br />\nF. Peyton Rous has been forced to suspend his work as a third-year<br />\nstudent at the Medical School in consequence of inoculation received during an<br />\n°pet ation. He has gone to Dallas, Texas, whence he will proceed to a ranch,<br />\nto live for a while in the open air. His class at the Medical School has presented him with a handsome saddle.<br />\nNorman Boyer has left New York for Durango, Mexico, where he will<br />\n'01<br />\ncontinue to 'write special articles for Success and other periodicals.<br />\n<br />\n'00<br />\n<br />\nMr. Frank D. Mower is studying medicine at the University of Virginia.<br />\nHe expects to enter the Medical School next year.<br />\nDr. Daniel A. Penick, Ph. D., '98 who was recently married in Arkansas,<br />\nhas been made associate professor of Greek at the University of Texas, where<br />\nhe received his bachelor's degree in 1891.<br />\nwas married to Miss Olivia Cottkling on<br />\nDr. Louis W. Ladd, M.<br />\nTuesday, November 25. Dr. and Mrs. Ladd will live in Cleveland, Ohio.<br />\nCharles W. Ottley, M. D., '99, is several times mentioned in the report of<br />\nPresident George Washburn, of Robert College, Constantinople, in which institution Dr. Ottley has recently become Professor of Biology, Director of the<br />\nGymnasium, and Physician of the College. President Washburn says: \"A<br />\nman of less energy and devotion would probably have gone away discouraged<br />\nat the end of the year. - - He had to create the place which he was called to<br />\nfill. - - We who have done this work in past years rejoice most in the coming<br />\nof Dr. Ottley.\"<br />\nMr. Frank I). Mower has left his graduate work at the University, and is<br />\nnow studying medicine at the University of Virginia.<br />\nDr. James W. Harry, fellow in history last year, visited friends at the<br />\nUniversity last week.<br />\n<br />\n\f'liIE 1\\1 EWS-LETTER<br />\n<br />\n5<br />\n<br />\nFOR THE UNDERGRADUATE.<br />\nN Tuesday night the Musical Clubs gave the second concert of the season<br />\nat St. Mary's Church, Roland Park. This, the second of the four trial<br />\nconceits before the Christmas trip, had to be given on a week day, since<br />\nFriday night, the first date, fell within the holidays. For this reason, several<br />\nof the players were absent, and the performance was thereby hampered. The<br />\nMandolin Club continued to play with the unanimity and dash with which it<br />\nbegan the season. J. A. Bryan. '03, the leader, has a large number of pieces in<br />\nthe repertory, and they are of better quality than usual, so it is probable that<br />\nthe Club this year will be a good one. The Glee and Banjo Clubs showed the<br />\nneed of more individual work. After the concert, the Rev. Mr. Dennis<br />\ngave an enjoyable entertainment to the men at the rectory.<br />\nThe next concert will be at Spring Grove, Catonsville, on Friday.<br />\n<br />\nO<br />\n<br />\nThe line-up at the Junior-Freshman game Saturday will probably be taken<br />\nfrom the following candidates:<br />\n'05<br />\n'04<br />\nBoyce,<br />\nBowie,<br />\nEnds<br />\nEmig, Strohbar<br />\nBaetjer.<br />\nW.<br />\nJackson,<br />\nDill,<br />\nRosenheim, Branham.<br />\nWroth, Campbell, Straughn.<br />\nTackles<br />\nRosenfeldt, Foster<br />\nMiller, Goldman.<br />\nGuards<br />\nErlanger, Butler,.<br />\nCrozier, Licking,<br />\nBanghart.<br />\nCenter<br />\nMuhley, Lewis,<br />\nHudgins.<br />\nQuarterback<br />\nDulaney, Le Cron,<br />\nGeiger, Branham.<br />\nStone.<br />\nFullback<br />\nPearre, Evans,<br />\nWayson,<br />\nChism, Super.<br />\nHalfbacks<br />\nEmz: , Strohbar,,<br />\nThe game will be called at 2.30, at American League Park, and will be<br />\nfollowed by a cane-rush The \"wise ones\" are predicting a score of 12-0 for<br />\n'04, but some are found who are willing to back their theory that the Freshmen<br />\nwill score.<br />\nAt the organization meeting of the Sub-Freshman Class the following officers were elected: President, H. H. Custis; vice-president, F. S Ehelen; secretary treasurer, V. M. Frey; historian, A. B. Crane.<br />\n<br />\nContributions to the 1903 HULLABALOO are solicited by the board of editors from men in every department of the University. Local hits and personalities are just as welcome as are more serious efforts in poetry and fiction.<br />\nEvery student in the institution can help to make the volume this year really<br />\nrepresentative of life at the J. H. U.<br />\n<br />\n\fTI I<br />\n<br />\nNEWS-LETTER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nDECEMBER 5, 1902.<br />\nSubscription $1.50 per year.<br />\nEditor in Chief, .<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n.<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\n10 Cents a single copy.<br />\n<br />\n.<br />\n<br />\nFORRET S. LAMER, 1903.<br />\nHARRY K. TOOTLE, 1003.<br />\nGEORGE A. FOSTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br />\nW. S. BIRD 1908.<br />\nHARRY BAETJER, 1903,<br />\n<br />\nAddress all articles, communications, etc., to ROBERT S. LANIER, box 374, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETJER,<br />\nJ H U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\nC<br />\n<br />\nHE letter following this column will be read with interest by all who desire<br />\na better attendance at the games played by Hopkins teams. The plan<br />\nproposed is similar to the course of the football management last fall,<br />\nwhich sold season tickets at a reduced rate. The writer does not state just how<br />\n\"The Powers that Be\" are to show their displeasure to delinquents; but it is<br />\ntrue indeed that a greater sense of obligation should prevail among the student<br />\nbody concerning attendance at 'Varsity games.<br />\n4 4ZIIE right kind of spirit\" is the best commentary on this year's football<br />\nteam, as it should be the best motto for all future teams. Probably<br />\nnever in the entire history of Hopkins' uphill athletic struggles did she<br />\nstart the football season with a more hopeless outlook. It is to the light and<br />\nmostly inexperienced men, who came out and worked in the face of all discouragement for the first three weeks, that we owe the creditable showing that<br />\nbegan with the Western Maryland game and was kept up for the rest of the<br />\nseason. There are two kinds of colleges where football succeeds: the big university whose previous athletic reputation serves to draw to her the stars of the<br />\nprep-school teams; and the small compact college, where an enthusiasm exists<br />\nwhich brings out to practice every man in the college who is physically sound,<br />\nwhether or not he is a football player by weight or inclination. Hopkins, by<br />\nher peculiar conditions, which deprive her of the services of the bulk of her<br />\ngraduate and medical students, and leave the burden of athletics upon an un-<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n7<br />\n<br />\n,<br />\ndergraduate body amounting to less than one-third of her total enrollment<br />\ncan<br />\nhonor<br />\nmust naturally fall under this second category. And her athletic<br />\nonly be maintained by the same pluck and enthusiasm which has snatched<br />\nvictory from despair this fall. \"Well done!\"<br />\nHE cheering and singing during the football season past has shown some<br />\ncurious features. In the first place, there has been unusual activity in<br />\nthe -writing of new songs and yells. Dozens of suggestions have been made<br />\nfor parodies on airs of the day, some of which have proved very taking, while<br />\nat one time it seemed as if every undergraduate was proposing a yell that he<br />\nhad written—or stolen. But, on the other hand, there have not been enough<br />\ncarry<br />\nrooters, except, strangely enough, at the one game played out of town, to<br />\nafof<br />\nstate<br />\nthis<br />\nfor<br />\nremedy<br />\nout successfully the wealth of ideas. A proposed<br />\nmaterial,<br />\nnew<br />\nof<br />\nsuggestion<br />\nfairs is found in another column. As regards the<br />\nit has been borne in upon the minds of those who were privileged to examine<br />\nthese late productions, that a little originality would give a great deal of help.<br />\nIt seems astonishing that among the hundreds of presumably fertile and ready<br />\nminds that feed so eagerly at the mental pastures offered by our University,<br />\nnot one can be found to suggest a combination of \"Rahs\" or other war-cries<br />\nthat will be at once novel and euphonious. It is just as astonishing that the<br />\nclub, or<br />\nproduction of catchy and suitable songs for the side lines, the glee<br />\na good<br />\nis<br />\nInterest<br />\nthe keg—party should average no more than one per annum.<br />\nthe<br />\nhalf<br />\nand<br />\nform<br />\nthe<br />\nthing; but the kind of interest that is satisfied at cribbing<br />\nkind<br />\nthe<br />\nis<br />\nas<br />\nsubstance of six yells used by other colleges is not as welcome<br />\nthat thinks out a little something on its own account. If the good work goes<br />\nadhere<br />\non, with the object always in mind that it is far from necessary to<br />\nhave a<br />\nwill<br />\nwe<br />\nstrictly to precedent in the composition of cheers and songs,<br />\naround.<br />\ncome<br />\nfine collection of \"novelties\" when the track and lacrosse seasons<br />\n<br />\nZ<br />\n<br />\nTo the -Editor of THE NEWS- LETTER:<br />\nDEAR SIR:—One does not know the healthful influence exerted upon a<br />\nteam when it hears itself cheered and urged on to victory by a large number of<br />\nvoices; one does not appreciate the fact that there is an increased ability to<br />\nplay when the effects of this cheering are felt. But as long as separate tickets<br />\nare sold for each football or lacrosse game, there will always .he someone who<br />\nwill find an excuse not to be present. This fact is recognized at other universities, such as Cornell, Pennsylvania, etc. The question may then arise, perhaps, in what way can this difficulty be overcome and obviated? To obtain a<br />\nsolution, nothing more is necessary than to take example from the practice of those universities mentioned above. There it is obligatory for every<br />\nmember of the university to purchase a book which contains tickets not only<br />\nfor every football game, but also for every other exhibition in any way connected with athletic sports. If any student refuses to purchase one of these<br />\nbooks, unless for the best of excuses, he is strongly made to feel the displeasure<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTE:R.<br />\n<br />\nof \"the powers that be.\" Under this method of procedure, there is a highly<br />\nsuccessful attendance at all games, for it is human nature that after a person<br />\nhas purchased a ticket of admittance to a game, he will make use of it, unless<br />\na very good reason prevents.<br />\nThis plan of issuing books cannot cause a slimmer attendance than we<br />\nhave had at some games, and, on the other hand, it is possible that it might be<br />\nproductive of much good. In view of this, the writer would like to propose<br />\nthat consideration of such a step be invited in THE NEWS-LETTER, so that the<br />\nviews of the student body at large may he obtained.<br />\nG. 13. R., '04.<br />\n<br />\n1111111111111111111111UU1111111111111111111111111111MIN11111111Mlimfillnwm111111111111111111111111111111111111MIIIi1111111111111111111111111011111111111<br />\n<br />\nisismaaPoimo.<br />\n<br />\n'<br />\n<br />\n81131111110111111111111111111111111W1111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111110111111111117311;1110<br />\n<br />\nT the annual meeting of the Friendly Inn Association, which took place<br />\nlast week, Dr. Remsen was elected president.<br />\nDr. Ira Remsen and Professor Jacob H. Hollander, of the University, have<br />\nbeen asked to respond to toasts at the annual banquet of the Alumni of the<br />\nCity College on December 9.<br />\nDr. Wm. Clark was elected secretary and treasurer of the recently organized Amherst College Alumni Association. There are a number of Amherst<br />\nmen at the University, all of whom are members of the society.<br />\nPresident Remsen was the guest of honor at the banquet held last week in<br />\nconnection with the celebration of the golden jubilee of Loyola College. Dr.<br />\nRemsen responded to the toast, \"The American College.\"<br />\nOn Monday, Noveml,er 24th, Prof. G. W. Ritchie, of the Yerkes Observatory and the University of Chicago, lectured before the Johns Hopkins Scientific<br />\nAssociation. The subject of the lecture was \"Recent Results in Astronomical<br />\nPhotography with the Large Instruments of the Yerkes Observatory.\"<br />\nJohn Murphy & Company, of this city, will shortly issue a volume entitled<br />\n\"The Lords Baltimore and the Maryland Palatinate,\" containing six historical<br />\nlectures delivered at the University last spring by Mr. Clayton C. Hall, of the<br />\nBaltimore bar.<br />\nDr. Jacob H. Hollander will deliver, at Hazazer's Hall on Sunday next, the<br />\nfirst of a series of lectures which have been arranged for by the Baltimore<br />\nTypographical Union No. 1 2. His subject will be \"Political Economy and<br />\nLabor.\"<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n9<br />\n<br />\nThe Economic Department of the University has undertaken the republication of a number of rare and valuable works on political economy.<br />\nThe series, under the editorial direction of Dr. Jacob H. Hollander, will be:<br />\n\"The Price of Gold,\" three letters contributed to the Morning Chronicle<br />\n(London) in August November, 1809, by David Ricardo.<br />\nAn Inquiry Into the Nature and Progress of Rent,\" by T. R. Malthus<br />\n(1815).<br />\n\"An. Essay on the Application of Capital to Land,\" with a discussion of<br />\nthe corn supply, by Sir Edward West (1815), fellow in University College,<br />\nOxford.<br />\n\"A Refutation of the Wage-Fund Theory of Modern Political Economy as<br />\nEnunciated by Mill and Fawcett,\" by Francis D Longe (1866).<br />\n\"A Collection of Latin Proverbs,\" a series of four articles, first published<br />\nIii the American \"Journal of Philology\" by the late Dr. Sutphen, has been<br />\nrecently published in book form. The book, which has been published as a<br />\ntribute by friends of Dr. Sutphen, contains his most important contributions to<br />\nthe branch of Latin Literature in which he was especially interested. Dr.<br />\nKirby F. Smith contributed the introduction, which contains a short sketch of<br />\nDr. Sutphen.<br />\n<br />\nY. M. C. A. NOTES.<br />\n<br />\nIt<br />\n<br />\nEV. FRANCIS E. CLARK, D. D., President of the United Society of<br />\nChristian Endeavor, spoke to a group of Mopkins men at the meeting<br />\non Tuesday, December 2nd.<br />\n<br />\nOn December 2-4, at Trenton, N. J., a conference of Y. M. C. A. leaders<br />\nof the Eastern States will meet to discuss the Foreign Work. John A. Addison,<br />\n'03, will-represent the Hopkins Association.<br />\nAn invitation has been received from Princeton, asking the Hopkins Association to send a representative to their celebration of the 25th Anniversary of<br />\nthe founding of the Student Y. M. C. A. movement of the United States and<br />\nCanada, which will be held on December 6th. Mr. C. W. Young will attend<br />\nfor the Medical School Association, and the General Secretary for ours.<br />\nMr. John R. Mott, College Secretary of the International Committee and<br />\nGeneral Secretary of the World's Christian Student Federation, will speak to<br />\nmen at Ford's Opera House, on Sunday, December 14th, at 3.30 o'clock. Mr.<br />\nMott is a man who is in touch with the colleges and universities of the whole<br />\nworld, having been around the world twice on such visits. He is a careful and<br />\nintense student of religious matters and should attract a large audience. All<br />\nHopkins men who are at all interested in the problem of a broad and right<br />\ndevelopment of life should try to hear him. He also speaks to men at the<br />\nHopkins Medical School on the evening of the 14th, at 7,30.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER<br />\n<br />\nMARYLAND, 5, HOPKINS, 0.<br />\nOPKINS has every reason to be proud of the football team which held the<br />\nUniversity of Maryland down to one touchdown on Thanksgiving day,<br />\nthe final score being 5-0. Twice, when the Black and Blue goal was in<br />\nimminent danger, the light line stood like a stone wall, and each time the ball<br />\nwas gained on downs,<br />\nThe University of Maryland kicked off to Strohbar, who advanced the ball<br />\n10 yards. Hopkins then rushed the doctors' line for 10 more yards, but the<br />\nball went to Maryland on downs. They steadily advanced, by end runs and<br />\nline plunges, until dangerously near the Hopkins go al. Encouraged by the<br />\n\"faithful,\" with their yell of \"Hold them, Hopkins!\" the team took a brace<br />\nand recovered the ball on downs.<br />\nDespite the fact that Maryland again obtained the ball on our 5.yard line,<br />\nwe again held the doctors for downs. Yearly and Kellum, especially, figured<br />\nin this splendid stand.<br />\nHopkins now did some grand-stand playing. The plunges by Blanck and<br />\nWilbur advanced the ball 20 yards. A minute later, Houghton made the star<br />\nplay of the game by a beautiful run of 45 yards around left end. Coffee was<br />\nthe only man between Houghton and the doctors' goal, and, for a minute,<br />\nvisions of a touchdown floated before the eyes of the Hopkins adherents.<br />\nMiller then went around right end for 8 yards, and Blanck was pushed<br />\nthrough the line several times until the ball was on Maryland's 4-yard line.<br />\nEverything seemed to be coming Hopkins way at this point, and the rooters<br />\nsang for a \"Touchdown, Touchdown,\" but an unlucky fumble lost the ball,<br />\nand it was punted out of danger.<br />\n.<br />\nHopkins kicked off in the second half. In spite of heroic efforts, we<br />\nwere unable to prevent Maryland from scoring a touchdown, since the left side<br />\nof our line was by no means impregnable. Several times the ball had been<br />\nbrought back by the referee after it had been taken across the Hopkins side<br />\nline, because Maryland had gone out of bounds, Griffin failed to kick goal.<br />\nA few minutes later, the game ended with the ball in Hopkins' possession<br />\nabout the middle of the field.<br />\nThe game was fiercely contested from beginning to end. Hopkins fought<br />\nfor every inch of the ground, and not until the middle of the second half could<br />\nthe doctors make any substantial gain by their heavier weight. The end runs<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n11<br />\n<br />\nby Houghton and Iseman set the rooters wild, and the line plunges of Blanck<br />\nand Wilbur were always effective. Blanck also did some fine tackling, getting<br />\nhis man almost everytime, and bearing the brunt of the defense work around<br />\nthe end.<br />\nThe line up was as follows:<br />\nJ. H U.<br />\nU. cnit MD.<br />\nHoughton<br />\nWinslow<br />\nr e.<br />\n.<br />\nGreene<br />\nGribble<br />\nr. t<br />\nYearley<br />\nr g..Mc<br />\n.<br />\n.......Cann<br />\nMarshall<br />\nBuck<br />\nc.<br />\nKellu m<br />\nMitchell (Capt.)<br />\n1 g<br />\n..<br />\nRosenfeld, Bacon.<br />\nScott<br />\n.1. t<br />\nCaulk<br />\nDaum, Brent<br />\n1 e.<br />\n.<br />\nStrohbar<br />\n....Coffee<br />\n.q. b<br />\nEisman.............„.................. ....r. h. b..........<br />\nMann<br />\nWilbur, Blatick (Capt.)<br />\nHenderson<br />\n1 h b<br />\nBlanck, Stone<br />\nGriffin<br />\nf b<br />\nReferee—Mr. E. A. Rich, Trinity. Umpire—Mr. Nat Poe, Princeton.<br />\nTimers —Iddins, Maryland Athletic Club; Woodward, University of Mary •<br />\nland. Linesmen—Tough, J. H. U.; Matthews, University of Maryland.<br />\nTime of Halves-25 and 20 minutes.<br />\n<br />\nHOPKINS, 17; MARYLAND AGRICULTURAL COLLEGE, 0.<br />\n<br />\nt<br />\n<br />\nHE game on Saturday, Nov. 22nd, was gratifying to all those who had the<br />\nwelfare of the team at heart. The Hopkins players immediately assumed<br />\nthe offensive and did not let up for a moment, showing the effects of good<br />\ntraining.<br />\nM. A. C. kicked off in the first half. The ball was downed back of the<br />\ngoal line and Hopkins punted out from the 25-yard line. The College backs<br />\nmade several futile attempts to break through our line, but soon lost the ball<br />\non downs.<br />\nSeveral fine end runs by Miller and line rushes by Blanck and Eistran<br />\nquickly placed the ball on the 3 yard line. But at this crucial point, a fumble<br />\nwas made, and M. A. C. secured the ball. For a short time, a revolving mass<br />\nPlay from end to tackle was successful, but we quickly \"caught on,\" and M. A.<br />\nC. was forced to kick after having lost 8 yards.<br />\nMiller, Green and Blanck rapidly brought the ball to within one foot of<br />\nthe line, and a slight push sent Eisman over for our first touchdown. Blanck<br />\nkicked goal, and after 16 minutes of play the score stood 6 to 0 in our favor.<br />\nM. A. C. kicked off, and the ball was downed on the 30-yard line. Miller<br />\nwent around right end for 15 yards. An exchange of fumbles left the ball<br />\nagain in our hands. Miller kicked, and the ball was stopped on the 35 yard<br />\nline. About this time the whistle blew, and the first half was over.<br />\n<br />\n\f12<br />\n<br />\nTHl NEWS—LETTER.<br />\n<br />\nIn the second half, Hopkins kicked off, and after a few minutes of play M.<br />\nA. C. was forced to punt. Miller went around the end for 15 yards, but we<br />\nlost the ball on a fumble. M. A. C. soon made a \"delayed fumble\" and the<br />\npig-skin was again ours. Then our boys buckled down to really serious work,<br />\nand Blanck was hustled across the line in short order for our second touchdown. He also kicked goal, making the score 12 to 0.<br />\nOur third touchdown was the result of a beautiful thirty-yard run by<br />\nMiller, who easily dodged several of the Aggies who attempted to tackle him.<br />\nBlanck failed at goal, leaving the score 17 to 0 The remaining few minutes of<br />\nthe game were spent in the middle of the field, and the whistle sounded with<br />\nthe advantage on neither side.<br />\nThe line-up was as follows:<br />\nM. A. C.<br />\n<br />\nCaulk<br />\nGreen<br />\nHutchins<br />\nMarshall}<br />\nRiley<br />\nYearley<br />\nRosenfeld<br />\nHoughton<br />\nHazelhurst<br />\nStrohbar<br />\nEisman<br />\nMiller<br />\nBlanck (Capt.)<br />\n<br />\n1 e.<br />\n1. t<br />\n1. g<br />\n<br />\nSmith (Capt.)<br />\nFesmyer<br />\nBradfield<br />\nMitchell<br />\n<br />\nr. g.<br />\nr t<br />\n<br />\nAlbritten<br />\nNaylor<br />\n<br />\nr e<br />\n<br />\nStoll<br />\n<br />\nq b<br />\nr. h b<br />\n1 h. b<br />\nf. h<br />\n<br />\nMatthews<br />\nGorner<br />\nDuganne<br />\nWatts<br />\n<br />\nTime—Twenty-five and twenty minute halves. Umpire—Mr D J.<br />\nMackey, M A. C Referee—Mr. Ernst Rich, Trinity College. Linesmen—<br />\nR. C. Hoffman, J. H. U., and Professor Bradford, M. A. C. Timers—W. E.<br />\nHoffman. J. H U., and Dr. H. M. Whitehurst.<br />\n<br />\nWITH THE RUNNERS.<br />\nURING the present week, regular track training has been temporarily suspended on account of the monopoly which the Junior and Freshmen<br />\nsquads are exercising on the cage. Next week work will be resumed<br />\nand kept up in mild form until the inter-class meet, which is being considered<br />\nfor some time during January. No definite arrangements have been made.<br />\nCaptain Hoffman has not even yet decided whether the events will be scratch<br />\nor handicap.<br />\nAt the first meeting of the track and field team, held in the trophy room,<br />\n36 candidates responded and the chances are that several more will be added to<br />\nthat number. With such a plentitude of material some gcod work is expected<br />\nduring the winter.<br />\n<br />\n9<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\nLACROSSE NEWS<br />\nH1-.., meeting of the Intercollegiate Lacrosse Association of the United<br />\nmost satisStates at Philadelphia last Saturday resulted in a manner<br />\nP. Straus<br />\nHenry<br />\nCaptain<br />\nfactory to the Johns Hopkins representatives.<br />\nand<br />\nmbie,<br />\nAbercro<br />\nT.<br />\nR.<br />\nwas elected president of the Association to succeed<br />\nthe<br />\nin<br />\nHopkins<br />\nand<br />\nore,<br />\nSwarthm<br />\nStevens Institute was allowed to join Lehigh,<br />\non<br />\nre<br />\nBaltimo<br />\nin<br />\nBlue<br />\nand<br />\nleague, upon condition that they play the Black<br />\nbe<br />\nto<br />\nusual<br />\nthan<br />\ngame<br />\nmore<br />\nApril 18. By this arrangement, there will be one<br />\nwon.<br />\nbe<br />\ncan<br />\nnship<br />\nchampio<br />\nPlayed in the intercollegiate league series before the<br />\nwill probably<br />\nBesides the league games with the other three teams, contests<br />\nmore than<br />\nis<br />\nIt<br />\nHobart.<br />\nhe arranged with Harvard, Columbia, Cornell and<br />\nts are<br />\nCrescen<br />\nThe<br />\ne.<br />\nlikely that three other games will be played in Baltimor<br />\nand<br />\ncloses,<br />\nseason<br />\nthe<br />\nbefore<br />\nexpected to appear at the American League Park<br />\nis<br />\nThere<br />\nassured.<br />\nlly<br />\npractica<br />\nanother game with the University of Toronto is<br />\nfrom<br />\naduates<br />\nundergr<br />\nof<br />\nalso soli e talk about a contest with an English team<br />\nSpring. Should all these<br />\nCambridge and Oxford, which is expected here in the<br />\nfor Hopkins.<br />\none<br />\ngames be arranged the season will be a memorable<br />\nHopkins game last<br />\nToronto<br />\nPresident Roosevelt was unable to attend the<br />\nto play the<br />\ndecided<br />\nwe<br />\nseason, hut promised to be on hand this year in case<br />\na recordassure<br />\nwould<br />\ne<br />\nCanadians. The presence of the nation's chief executiv<br />\nbreaking crowd at the game.<br />\nthe outIn regard to the prospects of a strong team for the coming season,<br />\nough,<br />\nback—T<br />\nis<br />\nlook is by no means gloomy. Almost the entire defense<br />\nSchool<br />\nMedical<br />\nthe<br />\nto<br />\nBlanck, E. Schmeisser, Straus,--and Briscoe may return<br />\nin the spring in time for lacrosse. Cm the attack, Bird, Putts, and Bernheim<br />\nof last year and the<br />\nremain, but several promising men are among the \"subs\"<br />\nr J. A. Addison<br />\nchances are that a strong twelve will be developed. Manage<br />\nhas not completed the schedule of games.<br />\nat the service of<br />\nAs s-oon as the class football game is over, the cage will be<br />\nwill begin regular<br />\nlacrosse and track and field men, and Captain Straus<br />\nPractice.<br />\n<br />\nZ<br />\n<br />\nof next year's footThomas S. Strohbar, 1904, has been elected captain<br />\nball team.<br />\nRECENT LECTURE.<br />\nd a lecture<br />\nROFESSOR ALCEE FORTIER, of Tulane University, delivere<br />\nLanTheir<br />\n,<br />\nHistory<br />\nTheir<br />\nin French on \"The Creoles of Louisiana:<br />\naudithe<br />\nIn<br />\n24.<br />\ner<br />\nNovemb<br />\nguage, and Their Literature\" on Monday,<br />\nseminaries and<br />\nwere a number of young ladies from the various<br />\nthere<br />\nence<br />\nschools in the city.<br />\n<br />\n(p<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS—LliTTER•<br />\nTHE HISTRIONIC HOPKINS HOST;<br />\nThe Shining Stars of the Select Society of Supernumeraries.<br />\nWhy is the stage so crowded? what means this stir at Ford's?<br />\nThe noble troops of Hopkins \"supes\" are brandishing their swords.<br />\nThere stands the gallant Treide, in tights of red arrayed,<br />\nHis hair so light is hid from sight beneath a helmet's shade;<br />\nFor never was a dago, in any land I ween,<br />\nWith hair like that beneath a hat by mortal man e'er seen.<br />\nBeside him stands Pat Riley prepared to do or die,<br />\nIn coat of mail he doth not quail nor backward turn his eye;<br />\nBut ever looks he toward the foe, while winds the battle horn,<br />\nA powder keg beside his leg he treats with noble scorn.*<br />\nBut had that keg been full of beer, and had that keg been ope,<br />\nHis eye would turn from foeman stern and he would 'gin to tope;<br />\nAnd so would all that Hopkins band who fought for Count aid home,<br />\nThey ne'er had stopped till they had dropped and nought was left<br />\nbut foam.<br />\nThere stands our chief, brave Hunley, the captain of the \"supes,\"<br />\nThe battle's nigh, his heart beats high as he reviews his troops.<br />\n0 wielder of the trenchant pen! say, is it not immense<br />\nTo tread the boards to-night at Ford's for paltry forty cents?<br />\nThere stands the tried tough Tootle, Missouri's favored son,<br />\nHe's brave to-night and he will fight until the battle's won.<br />\nBehold stout Wilton Snowden! A man of might is he,<br />\nThere is a charm keeps him from harm, now list what it might be:<br />\nHe is a doughty \"fusser,\" a winner with each belle,<br />\nA maiden's prayer breathed on the air to-night protects him well.<br />\nThese five compose that noble host, with Hopkins grads a few,<br />\nAnd well-nigh ten tried \"super\" men to whom the scene's not new.<br />\nAnd now the battle rages, and now the cry is raised,<br />\n\"Now once again, have at them, men, and all the saints be praised!\"<br />\nWhen Madam Duse turns on them and bids that no man fly<br />\nLike leaping fire her eyes inspire each man to do or die.<br />\n\"Verrucchio! Malatesta!\" Their throats they nearly split.<br />\n\"Victoria! Ha-ha! Ha-ha!\" Each thinks he makes a hit.<br />\nStout Treide grasps a hand-grenade as if he felt no fear,<br />\nHis aim is bad, he must be mad, the wall it does not clear;<br />\nYet it doth hit the battlement, and gracefully bound o'er,<br />\nAnd falling down inside the town kills fully half a score.<br />\nBill Hunley is beside himself, he rages at the foe,<br />\nFrom painted tower the arrows shower, shot from Bill's good cross-bow<br />\n.<br />\n\"A hit! a hit!\" he loudly cries, \"what say you to that now?\"<br />\nWith pride he's filled, his shot has killed a ruminating cow.<br />\nWhen youthful Snowden, gentle youth, was just about to shoot<br />\nHe did espy a maid close by who really was a beaut;<br />\nAnd so he let the tattle slide, and gave it no more thought,<br />\nBut for a kiss from that fair miss he valiantly fought.<br />\nIntrepid Tootle swears full loud amid the crackling flames<br />\nThe foe he'd rout without a doubt if he had Jesse James<br />\nAnd some few bad Missourians of that bold, bandit stamp<br />\nTo show the way to win the day within the dago camp.<br />\n<br />\n*Anachronism. Had it really been powder he would have done<br />\nas the ballad states.<br />\n<br />\n\fTHE NEWS-LETTER,<br />\n<br />\n15<br />\n<br />\nAnd what of Charlie Riley, whom we all know as Pat?<br />\nWhat thoughts sublime are keeping time beneath that pot iron hat?<br />\nHe firmly holds a hand-grenade and bravely lets it fly<br />\nWith mighty rage across the stage straight at the painted sky.<br />\nAnd was that then the end of it? Ah no! pray hear the rest,<br />\nIt was not spent till it had went against the prompter's breast,<br />\nAnd knocked his book from out his hand, his specs from off his nose,<br />\nAnd finished well when down it fell and crushed that worthy's toes.<br />\nNow is the battle ended, and now the victor's prize<br />\nIs due to those who wore the clothes of \"supes\" in lowly guise<br />\nNow hail them, all ye Hopkins men, hail them with glad accord,<br />\nWhile ye have slept these five have kept their watch with bow and sword,<br />\nNow hail them, all ye maidens fair, and crown their victor brows;<br />\n'03.<br />\nRight soon begin and ye may win a hero for a spouse.<br />\n<br />\nFABLES FOR THE FOOLISH.<br />\nIn Words of a Few Syllables.<br />\nIII. THE FABLE OF 'ME F001, AND HIS MONF.Y.<br />\nHERE was once a college youth who had a friend who knew a lot about the<br />\nlaws of chance. Only he called his system a \"sure thing.\" There was<br />\nnever a race or a ball game when he did not know which way the money<br />\nought to be placed. On the day of the great game, the college youth came up<br />\nto him and requested a few pointers on the result. He said that he was slightly<br />\nafraid to put up his money, as the other college had a good team. The man<br />\nwho knew a lot about the laws of chance looked wise but said nothing. The<br />\nother college had barrels of money and they began to lather the field with it,<br />\nfinally offering large odds for the purpose of catching the suckers whom a wise<br />\nlaw of nature provides for the people who know just what to do to a good thing.<br />\nThe college youth ran breathlessly over to the friend who knew a lot about<br />\nthe laws of chance and told him that the other fellows were offering odds of 3 to<br />\n1. He asked for advice. As he talked the odds jumped up to 5 to 1. The man<br />\nwho knew listened in silence. At last he realized that the college youth was<br />\ngoing to get reckless no matter what he said, so he proceeded to give a few bits<br />\nof oracular advice.<br />\n\"My friend,\" quoth he, \"a fool and his money are soon ifarted. I guess<br />\nyou had better place all you have on the result at the best odds that you can get.\"<br />\nThe young man went away joyfully and let them separate him from his roll.<br />\nThe next day he met the man who knew a lot about the laws of chance,<br />\nand his sorrowful countenance betrayed deep emotion.<br />\n\"Friend,\" he said, \"you have played me false. I asked you as a friend to<br />\ntell me how to place my money, and you told me that a fool and his money are<br />\nsoon parted. But instead of getting their money at big odds they have wiped<br />\nme off the map.\"<br />\n\"I did tell you that a fool and his money are soon parted,\" said the wise<br />\nguy, \"but you did not realize that you were the fool.\"<br />\nMORAL: This fable teaches freshmen that there are always two points of<br />\nview.<br />\n<br />\nC<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\nP4N.<br />\n<br />\nRNGES<br />\nOur Exchange Editor was shocked at receiving a copy of the McGill Outlook<br />\naddressed to `I NEWS LETTER, Johns Hopkins University, Baltimore,<br />\nOhio,\"<br />\nfrom which place it had been forwarded here. It is painful to think<br />\nthat the<br />\nreputation and location of the University are so little known in so near<br />\na coun<br />\ntry as Canada.<br />\nTwo from the HARVARD Lampoon:<br />\nHE(insinuatingly)—Have you a partner for the cotilion?<br />\nSHE (eagerly)—No, I haven't.<br />\nHE (brutally)—Neither have I. But I guess I'll dance stag.<br />\n\"The engagement is broken.\"<br />\n\"Ali! ring off?\"<br />\nPOOR YELLOW.<br />\n\"A drunken man is a pitiable object.\"<br />\n\"Yes; he can't tell had whiskey from good.\"—Michigan Inlander<br />\nWillie tried to tack the carpet,<br />\nWillie's thumb received a slam,<br />\nWhich made Willie very angry,<br />\nAnd he softly murmured—<br />\n\"Mother, mother, bring the liniment.\"—Columbirt .1e's1c).<br />\n<br />\nThe CORNELL Widow speaks:<br />\n\"That,\" said the loaf, pointing to the oven,<br />\nis where I was bred.\"<br />\nIN KENTUCKY.<br />\nWith all its faults I love the still.<br />\nA dillar, a dollar,<br />\nAn eight o'clock scholar,<br />\nWhat makes you rise so soon?<br />\n\"I need the hours,\" the Senior sighed,<br />\n\"To graduate in June.\"<br />\n<br />\n\fTHE chEAPEST PLACE<br />\nIN BALTIMORE FOR<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br />\n<br />\nH. S. WRIGHT & CO-,<br />\n704 MADISON AVE.<br />\n<br />\nC. & P.'Phone 3053-Y.A'S<br />\n<br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\nMathematical and Surveying Instruments,<br />\nDraughtsmen's and Engineer's Supplies._<br />\nN. W. Corner<br />\nLexington and Liberty Sts.<br />\n<br />\n1,.'sscr Co., of New Y<br />\n<br />\nAgent Or Kenffet<br />\n<br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\nB. G. EICHELBERGER,<br />\n308 N. Chartes Street.<br />\n<br />\nBALTIMORE, M<br />\n<br />\nHenderson's<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Books,<br />\nMadison<br />\nStudent's Supplies.<br />\n<br />\nFOR<br />\n<br />\nHoward Sts.<br />\n<br />\nADVERTISING SPACE IN THIS PAPER<br />\nAPPLY TO<br />\n<br />\ne.,e1<br />\n0<br />\n- 4.14!<br />\n1<br />\nLIGHT & LOPABAR<br />\n<br />\nPUBLISHERS.<br />\nC,OP LtAl<br />\n<br />\nriroun. e. asImtsr5.<br />\n<br />\n.100004<br />\n— r)<br />\n,<br />\n1.71A01-11:./AD,,<br />\n<br />\nM. 1VIEADE,<br />\n<br />\nOF 1.0N1/0N,<br />\n<br />\nEXPERT CLEANER AN[) DYER.<br />\n126 N. it'LAW<br />\n<br />\n(2nd and 3rd floors).<br />\n<br />\nTho most complete and 1111alern department for<br />\ncleaning, dyeing and altering flent's and Ladies,<br />\ngarments.<br />\nIt's time jour Winter Clothing was put in order.<br />\nnoes It need to be cleaned, dy,,ii, altered or rePaired? Are new 11nlitgs and velvet collars necessary?<br />\nNever mind what's the matter, we will tlx it up to<br />\nlook like new, and you won't have to pity very much<br />\neither. The Price List speaks for itself.<br />\n<br />\nM. BERNSTEIN & CO.<br />\n[.ON pox — A ra F.,a ICA N<br />\n<br />\n...TAILORS AND<br />\n<br />\nImpoRTERs...<br />\n<br />\nLOW PRICES AND FINE WORK.<br />\nWe make clothes that, tit well, look well and wear<br />\nwell, that's very important.<br />\nThe most fastidious Rum can tInd nothing to growl<br />\nabout our garments.<br />\nThe same attention is given to the man that is less<br />\nParticular, Its our way.<br />\nWe are prepared to show you a large line of tinPorted weolens, which does not cost any more than<br />\nthe domestic.<br />\n\"SEE US BEFORE BUYING\"<br />\n<br />\n126 NOIZTH 1:11TAW ST12IThT.<br />\n(Second door<br />\n<br />\nalt-we Joel Outman & (7o.)<br />\n<br />\nGENTLEMEN'S CLOTHING PRESSED BY<br />\nCoNTR ACT. $1.50 PER MONTH.<br />\nPRICES Fillt DRY CLEANINCI AND DY KENO<br />\n$1.00<br />\n.25<br />\nTrousers,<br />\n.50<br />\nCoats,<br />\n.25<br />\n..<br />\nVests,<br />\n...<br />\n1.00<br />\nOvercoats, .50, .75 and 1 00<br />\nBoys' Suits, according to size, .75<br />\nVelvet collars on overeoats,<br />\nRIIILINING. -A new lining will often make a garment which you have discarded good for another<br />\nseason's wear. A II altering and repairing done here<br />\nby skilled tailors.<br />\nDYEING.<br />\nGentlemen's Suits tit f humnd pressed,<br />\n1 50<br />\nOvercoats,<br />\n1.00, I.25 and 1.50<br />\nBoys' snits, according to size<br />\n<br />\ntientlernen's Su its cleaned and pressed<br />\n<br />\nCLOTHES MADE TO ORDER.<br />\nThe illustrhtions show how the clothes we make tit<br />\nand look—I be wear you'll learn about later.<br />\nThe light,overcoat Is an especially snappy garment.<br />\nThe sack suit is cut after the very newest pattern.<br />\nThe winter overcoat is as swagger as the dressiest<br />\nman could wish.<br />\nWe make all other proper styles, of course; dress,<br />\ncutaway, double-breasted, four-button sack and<br />\nNorfolk suits.<br />\nYou can now have II rat pick of our lirst pick of'<br />\ncloths.<br />\nPrices are low—we never learned to charge too<br />\nmuch. We would like to make your clothes.<br />\nLOWEST PRICES EVER KNOWN.<br />\nWe guarantee to give you latest style u.nd a perfect lit. Workmanship will be the best you oversaw.<br />\nYour money back if you are dissatisfied.<br />\n126 N. Eutaw St.<br />\nM. 131112NSTIAN & CO.<br />\nSEE OUR PRICE LIST FOR CLEANING. DYEING AND ALTERING.<br />\n<br />\n\fDrovers Sc Mechanics Nat'l Bank,<br />\n<br />\nSTIEFF PIANOS<br />\n<br />\nOF BALTIMORE, MD.<br />\nEI I 111.11.4'1' Al A T P.I/t IA 14144 Mo1 N FlY<br />\nA NI) 1EXPEIKIENCE ('AN HUN'.<br />\n<br />\nM ft. 1)}7, (IV<br />\n<br />\nSURPLUS AND PROFITS, $375,000.<br />\n<br />\nN. 1.,IIIEler Y. ST.<br />\n<br />\n41\"Transacts a General Baulking Business.<br />\n<br />\nBo0kSeilerS and<br />\ntat on ers.<br />\nW. BALTIMORE STRUT.<br />\n<br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LEHMAN & SON,<br />\nFOR<br />\n701 to '7011.<br />\nMADISON AVE,<br />\n<br />\n1)<br />\n<br />\nGUSHING ScGOMPANY<br />\n34<br />\n<br />\nCAPITAL STOCK, $300,000.<br />\n<br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nKeep constantly on hand the Text Books used<br />\nHi Johns Hopkins University and the Woman's<br />\n#<br />\n#<br />\nCollege of Baltimore.<br />\nSi ATIONBRY—For School, family, Office and Bank.<br />\n.<br />\n<br />\n-<br />\n<br />\nHaberdashers,<br />\nShirts, Neckwear,Underwear<br />\nM111111111111111111111111111111111111111111.1.1 Hosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\nim Sale The .1. II If. Pennants, and all other College<br />\n<br />\nTHOS.BLAKE CO<br />\n<br />\nJORDAN STABLER GO.<br />\n<br />\nSamples submitted of<br />\nReads as follows:<br />\nFrench Brandy—no adulterates, no coloring, line quality.<br />\nOporto l'ort—ahsolutely pure, oC superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong,<br />\nSix Ground Splees—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK,<br />\n<br />\nPennants.<br />\n<br />\nIlgenfritz Studio<br />\n<br />\n219 EAST BALTIMORE ST.<br />\nA H. FETTING,<br />\nMANUfACTURER<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n<br />\nOf<br />\n<br />\nOreell letter fraternitv jeweirr,<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\nlpicaec Call an? !Examine our line :16c1crc<br />\n<br />\npurcbaimmi.<br />\n<br />\n.114:NNIN(iS& 11()IZSPAT.<br />\nMERCH A NT TA I L.()104,<br />\n<br />\n2I<br />\n<br />\nSUCIIOSKOT [ii (fu inmins.<br />\n<br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nStudents.<br />\nSpecial 'Discount to<br />\n<br />\nc.& P. telephone 44.3 11.<br />\nLibraries arranged and put in<br />\norder without removal. sr sr<br />\n<br />\nRUZICKA<br />\n<br />\nt<br />\n<br />\nBookbinder,<br />\n<br />\nVV. FA YETT1.1 ST I? PI WE.<br />\n<br />\nBOOKS!!!<br />\nSECOND=HAND!!<br />\n,<br />\nSchool, Medical and Miscellaneous<br />\nExchanged.<br />\nBought, Sold and<br />\n<br />\nPIPPEN'S BOOK STORE,<br />\n605 N. EUTii•W ST.<br />\nNear the University.<br />\nBaltimore's Largnst Mil Book Store.<br />\n<br />\nI. H. U. Binder.<br />\n<br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE.<br />\n<br />\nTHEO. WARNER<br />\n<br />\nWARNER & CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln & Bennett and<br />\nWalter tiarnard's London Hats<br />\n1 471REET.<br />\n:124 VI.EsT 13 A 1.11`1 MORN ,<br />\nManufacturers of<br />\nS Caps<br />\ni<br />\nIA<br />\nHats.<br />\nCassimere<br />\nSilk awl<br />\n<br />\nNORTH GERMAN LLOYD S. S. 60.<br />\nGABIN PASSAGE AT LOW RATES.<br />\n<br />\nNem York to tSrenica, Loudon, Paris, Gibraltar, Nolcs, Omioa, etc.<br />\n<br />\nBALTIMORE TO BRE,MEN DIRECT.<br />\n<br />\nSGRUMAGRE,11 Sc GO., General Agents.<br />\n<br />\nFor particulars apply to<br />\n<br />\nISAAC H.<br />\n<br />\nTHE<br />\n<br />\nChas. Willms Surgical Instrument Co.<br />\n<br />\nJAS. MEIKLE,<br />\nJAS. R. RICHARDS, TREAS<br />\n<br />\nDIXON, P141 sr.<br />\n<br />\nVICE -PRIEST.<br />\n<br />\nSmith, Dixon Co.<br />\n<br />\nPHYSICIANS'. SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\nBaltimore, Md..<br />\n<br />\n29 - 31 S. Charles Street.<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol. VII, No. 4<br /><br />\nDecember 5, 1902<br /><br />\nTHE<br /><br />\nNEWS LETTER<br />\nEIP-1<br /><br />\nBEING<br /><br />\nTHE<br /><br />\nFOURTH NUMBER<br /><br />\nOP'<br /><br />\nVOLUME SEVEN<br /><br />\nPUBLISHED BY STUDENTS<br /><br />\nJOHNS HOPKINS UNIVERSITY<br /><br />\nTile Jotins Hopkins Universitil<br /><br />\nThe Johns Hopkins Press.<br /><br />\nBALTIMORE, MARYLAND.<br />\n1.<br /><br />\nTWENTY-SEVENTH YEAR.<br /><br />\n11.<br /><br />\nBeginning October 1, 1902.<br />\nPresident: Inn REM NEN. Dean of the Medical Faculty:<br />\nWILLIAM H. HOWELL. Dean of the College Faculty:<br />\nEewnitn H. flitrefere.<br /><br />\nFOR GRADUATE STUDENTS:<br />\n(a) In Philosophy and the Arta. (Courses for candidates for the degres of Ph. D.)<br />\n(b) In Medicine. (courses for candidates for the<br />\ndegree of M. D.; courses for physicians,)<br /><br />\nFOR UNDERGRADUATES:<br />\n(e) AS candidates for the degree of 11. A.<br />\n(d) As special students.<br /><br />\nLibraries.<br />\nUniversity,<br />\n105,000 volumes.<br />\nPeabody Institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br /><br />\nLaboratories.<br /><br />\nSeminaries.<br />\n(\"reek.<br />\nLatin.<br />\nSanskrit<br />\nSemitic.<br />\nGormau.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\nEconomics.<br />\nMathematics.<br />\nPhysics.<br /><br />\nVolume<br /><br />\n?American Chemical aournal.<br />\nI. It EMSE N. Editor. Monthly. 8vo.<br />\nXXVIII in progress. $5 per volume.<br /><br />\nVolume<br /><br />\n111. !American :lournal of Philology.<br />\nB. L. G I LDERSLEE E, Editor. Quarterly. 8vo.<br />\nVolume XXIII in progress. $3 per volume.<br />\n11D.<br /><br />\nStubies from the 23iological /aboratory.<br />\nVolume V complete. $6 per volume.<br /><br />\n8vo.<br /><br />\nW.5tubies in ?historical anti Political $cience.<br />\nMonthly. Svo. Series X X in progress.<br />\nvolume.<br /><br />\nInstruction.<br /><br />\nChemistry.<br />\nPhysics.<br />\n4 ieology and Mineralogy.<br />\nZoology<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br /><br />\nlimerican 3ournai of ebatbematice.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nXXV in progress. $5 per volume.<br /><br />\nDirectors.<br />\nIra Remelt.<br />\nJoseph 8. Amex.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin<br />\nMall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn .1. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oster.<br /><br />\nDirectors.<br />\nBasil L. Grildersleeve.<br />\nKirby<br />\nsmith,.<br />\nMaurlee Bloomfield.<br />\nPaul.Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott..<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nWI.aohne tophins 'University Circulars,<br />\nContaining reports of scientific and literary wo<br />\nin progress in Baltimore. 4to. Vol. XXII in<br />\nprogress. $1 per year.<br />\nWill. 3ohns lbophine 'ibospital eulletin. Monthly. 4th.<br />\nVolume XIII in progress. $1 per year.<br />\n11111. aobno lbophins lboopital 'Reports. 4to. Volume X<br />\npnigress. $5 per volume.<br />\n1X.<br /><br />\nContributions to liesyrtology ant) Comparative<br />\n%entitle Philology, (Beitrage zur Aseyriologie, etc.)<br />\nVol. IV complete.<br /><br />\nX.<br /><br />\nIleemoirs from the 161.oloeical laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br />\nIleobern laniguiee 'Rotes. ,?<br />\nA. M. E L1,1011', Editor. Monthly. 4to. Volume<br />\nXVII in progress. $1.50 per volume.<br /><br />\nX11. Journal of experimental<br />\nW. H. WELCH, Editor. Hi-monthly. livo. Volume<br />\nVI in progress. $5 per volume.<br />\nX111.!American 3ournal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly.41.o. $5 per<br />\nvolume.<br />\nX111). -Reports of finaryianb eeoloeica 93urney.<br />\nW I I, LIAM B.(7LA IRK, Editor.<br />\nD.Cerrestrial Magnetism anti litmospberic elec.<br />\ntricIty L. A. BA 11 Elt, ltditor. Quarterly. 8vo.<br />\nVolume Vii in progress. $2.50 per volume.<br />\nV101. !Unmet 'Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the Univers'<br />\nduring the past academic year.<br />\nATM annual'register.<br />\nGiving the list of officers and students,and stating<br />\nthe regulations, etc., of the University. Published at the close of the, academe year.<br /><br />\nUndergraduate Courses (leading to B. A.)<br />\n(Iron pm.<br />\nI. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\nChemical-Biological<br />\n(leading un to medicine).<br />\n4. Geological-Biologieal.<br />\n5. Latin-Mathematical.<br />\n0. Ilintorical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br /><br />\nSerial Publications.<br />\nAmerican Journal of NI athematic).(vol. XX V).<br />\nAmerican Chemical Journal (vol. XX VI II).<br />\nAmerican Journal of Philology (vol. XXII!).<br />\nStudies in Historical and Political Science (vol. XX).<br />\nModern Language Notes(vol. XVII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to Assyriology (vol. IV.<br />\nTerrestrial Magnetism (vol. VII).<br />\nn Extensity Circulars (vol. X X II).<br />\nProgrammes of the courses offered to graduate students In Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\neieirsee, will be sent, on appl IC11114)11 to 1)10 Regied rar.<br /><br />\nIn addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nlitowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simile edition. Edited by J. Bendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nItoproduetion In Phototype of Syriac MSS. with Antilegomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographic Hopkinsiensis. Part T. Philology. Parts<br />\nTI-Ill. Chemistry, Mineralogy and Geology. Parts<br />\nV-V-V1. Physics.A stroremy and Mathematics.<br />\nS vo. :10 cents per part.<br />\nfl full list of publications will be sent on application.<br /><br />\nCommunications in respect to exchanges and remittances<br />\nmay he bent to Johns flopkins Press, Baltimore, Md.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VII.<br /><br />\nDECEMBER 5, 1902.<br /><br />\nNo. 4.<br /><br />\nJOURNALISM FOR BEGINNERS.<br /><br />\n9<br /><br />\n44<br /><br />\nON'T do it,\" wrote a newspaper man in THE NEws-LETTER of November 20, to college Seniors who think they can win place as writers<br />\nby the path of the newspaper office. I read 'Charley\" Bump's name<br />\nunder that piece of advice with a little surprise. Knowing him for so good a<br />\nnewspaper man as he is, I might fairly have expected him to be even a little<br />\nenthusiastic on the other side. He feels toward his business, however, as many<br />\nof the men do who have come to know any part of it with any intimacy. The<br />\nnewspaper business isn't a good thing for anybody unless it is a good thing<br />\nThat's equally true of any other business,\" you reply And so it is. But<br />\nthe newspaper business is overcrowded with men who are misplaced in it as<br />\nmuch as second story men in the sanctuary. The sanctuary, indeed, is supplied with many excellent priests. Newspaper men of the first class, I believe,<br />\nare not nearly so common in the newspaper business.<br />\nA graduate student of Dr. Ames' department probably expressed the chief<br />\nreason for this a few nights ago. \"Ah,\" he said to me, \"but there's a glamor<br />\nabout a newspaper man's life!\" I've heard this so often that I'm beginning to<br />\nbelieve it. There is a tremendous \"glamor about the newspaper man's life.\"<br />\nMost of the 'glamor\" lies in the observer's eye. It doesn't do the newspaper<br />\nman any harm if he is sensible, but it may lead the observer to make a fool of<br />\nhimself. \"Glamor\" is just the whirlpool for the college fellow whose anchor<br />\nisn't out—sometimes it is strong enough to make one drag his anchor. A few<br />\nsuch craft are built for this sort of stress—they drive with the swirl to its<br />\nroughest place and its speed increases their momentum; they don't last their<br />\nfull span, hut while their timbers hold they win a jolly struggle with the<br />\nstorm as others go down about them. Some beat ground and escape the whirl—<br />\nafter learning enough seamanship to keep in the quiet water. Some are dis<br />\nmantled after a long fight and are thrown out without machinery or canvas<br />\ninto the open ocean—derelicts. In a limited prospect, I have seen fleets of all<br />\nthese three kinds of newspaper craft.<br />\nToo many of the unfit enter the newspaper business They know a reporter who says, \"Hello, Jack!\" to a Congressman, exchanges small talk with<br />\na bishop, confers confidentially with the marshal of police, fills free seats in<br />\ntheatres, enjoys the privilege of getting drenched under the walls of a burning<br />\nwarehouse, wades in Wood at every murder, gets mysterious communications<br />\nfrom bartenders and hackmen, drinks champagne occasionally and smokes<br />\nCigars for which he doesn't pay, and then calls on the president of a woman's<br />\ncollege. This is a first-class \"glamor\" outfit. Of course, coming one after the<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nother, the Congressman, the bishop, the marshal, the bartender, the blood and<br />\nfire and water and all the rest,—they have the diverting effect of novelties.<br />\nBut, then, the repetition of diversity is monotony itself. It is true that the reporter may make useful friends among those he meets. It is also true that<br />\nmost of the people he visits are not aggressively glad to see him unless they<br />\nwant something and, perhaps, have sent for him. With equal truth the report•<br />\nthing<br />\ner may make enemies—and he sometimes does. Here is an exasperating<br />\nhis<br />\nin<br />\nnot<br />\nhim,<br />\nto<br />\ncome<br />\nThey<br />\nincurs:<br />\nhe<br />\nenmities<br />\nabout a great many of the<br />\nsome<br />\nlike<br />\nlife,<br />\nnewspaper<br />\nof<br />\n\"glamor\"<br />\nThe<br />\nown fight, but in \"The Paper's.\"<br />\nother intangible things, dissipates rather easily. Beyond the \"glamor\" of it,<br />\nin the diversity of the reporter's side of it, there is as much bodily exhaustion<br />\nand brain-fag as elsewhere; very often a great deal more than elsewhere.<br />\nCharley Bump repeats several times that the young man's \"world-illumining volume\" will never be written if he remains a conscientious newspaper man.<br />\n\"Why, that fellow must be buggy,\" I heard a freshman say, \"everybody<br />\nknows that Dickens was a reporter.\" If this boy ever comes to read the brief<br />\nest of the obituary \"notices\" he will learn that reporters pass away with the<br />\nsame regularity as millionaires, and when he has read all the longest of \"the<br />\ngreatest of recent novels\" he will understand that hundreds of thousands of<br />\nnewspaper men died during the nineteenth century, but in all that time God<br />\nmade only one Dickens. All this, however, is where the \"glamor\" used to be—<br />\nin my eye. Never having coddled an ambition to \"illumine\" the \"world\"<br />\nby a \"volume,\" I feel no sting in not being able to do so. But I distrust the<br />\nnewspaper business on grounds both sentimental and commercial—not for<br />\neverybody, understand, but for myself and the majority who, I believe, are<br />\nlike me.<br />\nTo spend your life in telling what other people are doing seems an empty<br />\npursuit. Yet an army of conscientious and industrious newspaper workers are<br />\nbusy at it. Let them become deeply interested in the great movements, the<br />\nlarge causes, with which they deal, and they warp their chronicle If they<br />\ntake sides, someone claims they have done him an injustice—some of them<br />\nsometimes suffer for being thus unjust. Not every newspaper man can say to<br />\nhimself, \"this is my game and here goes for it.\" The personal feeling with<br />\nwhich a chemist watches the development of a discovery, a merchant the<br />\ngrowth of his business, or an engineer the fulfilment of his plans is not possible<br />\nfor the private in the newspaper army.<br />\nVery often—ever so often—the newspaper man is a spasmodic purveyor to<br />\na literary mince-pie of daily bake. \"Ah, hut the cook!\" you say,``The cook's<br />\nthe thing!\" And it's true. The cook is the editor or the publisher. Some.<br />\ntimes he's both. He inspects the citrons, the raisins and the meat, the lard<br />\nand the flour, throws out the specked, the rancid, the mouldy, and the taste<br />\nless, mixes the rest as he thinks they ought to go, rolls the pastry and meas<br />\nures in the mince meat, makes the pie, bakes it—and takes the profits of the<br />\nsale. The cook is the craft that weathered the whirlpool. These similes are<br />\nnot more mixed than the mince-meat in the pie. The real newspaper man be-<br /><br />\nTHE N EWS—LETTER.<br /><br />\n3<br /><br />\ncomes the cook, or at least, the meat-mixer or the pastry maker. A great many<br />\nSpecial qualities fit him for the post—and nearly always he is deeply penetrated by a conviction of the dignity of making mince pies. The real newspaper man really loves his calling, comes back to it every day with a freshened<br />\nmind to see the large things which he can make his own, starts movemen<br />\na<br />\nt or<br />\nenters a fight as one of the parties to it, will make The Paper's enemies his own<br />\non sight, will toil in all circumstances personall<br />\ny and impersonally to increase<br />\nits fame. He could no more be a great teacher, physician<br />\n, merchant, engineer, or<br />\nsomething else, perhaps, than any of these could be a first-class newspaper<br />\nman, but this doesn't worry him at all. There are large rewards and dignities<br />\nin the newspaper business, but most<br />\nof them are for real newspaper men. The<br />\nreturns which come to a man who is in such work but doesn't belong there<br />\nare unspeakably smaller than those which the same industry,<br />\nintelligence, and<br />\nfair purposes would win him in almost any other business. Many<br />\nof us in the<br />\nnewspaper business are not real newspaper men—many of us can compete no<br />\nbetter with those who are than a chicken can swim a duck across a mill-pond.<br />\nThe total of the qualities which distinguish a real newspape man<br />\nr<br />\nare easier to<br />\nsee and feel than to state. Those who have them will probably know<br />\nit. A<br />\ngrown man, if he ponders the thing, ought not to mistake \"glamor\" and<br />\n((<br />\ngraft\" for a real call to the newspaper business. Preach, teach, or sell snuff,<br />\nbe physicians or coffin-makers, engineers or anything<br />\nelse you are qualified to<br />\ndo well or to be properly. Dig the \"glamor\" out<br />\nof your eye and the \"graft\"<br />\nout of your soul whenever they afflict you. Think well unless you have<br />\na<br />\nmagazine of illusions to last a lifetime, or unless—\"Don't do it.\"<br /><br />\nMARSHALL BALLARD, '98.<br />\nTHE COLLEGE CONVENTION.<br />\nT the sixteenth annual convention of the Association of Colleges and Preparatory Schools of the Middle West and Maryland, held in this city<br />\nduring the Thanksgiving vacation, Dr. Remsen was elected president,<br />\nafter delivering the address of welcome. The delegates were the guests of<br />\nHopkins at the sessions, which were held in McCoy Hall, and at a lunch<br />\nserved in the Gymnasium.on Friday.<br />\nAn amusing feature of the exercises consisted of the anecdotes which were<br />\nrelated by some of the speakers As might be expected, they related mostly to<br />\nunusual answers on examination papers.<br />\n. Miss Salmon, of Vassar, told of a student who defined Mason and Dixon's<br />\nline as \"the boundary above which you can't sell corn whisky.\"<br />\nThe faculty delegate from Rutgers College gave the answer of a student<br />\ntaking an English examination, who had been asked to give examples of the<br />\nindicative, subjunctive, and imperative moods in English. He wrote: \"If I<br />\nanswer ten questions, I shall pass. If I answer eight questions, I may pass.<br />\nGod help me!\"<br />\nHe did not pass.<br /><br />\nQX<br /><br />\nTH E NEWS—LETTER.<br />\nALUMNI.<br />\nWilliam V. Willoughby, who last year succeeded Dr, Jacob H. Hollander<br />\nas Treasurer of Porto Rico, visited the University last week.<br />\nMorris C. James, who has been in California since graduating, has<br />\n'92<br />\nrecently been appointed instructor in Latin and Greek at the Berkeley High<br />\nSchool, Berkeley, California.<br />\nMr. Charles B. Clark is now in Cincinnati, being employed with the<br />\n'95<br />\nCincinnati, Cleveland and St. Louis Railroad.<br />\nDr. John Montgomery \\Vest is in Germany, at the University of Ber'96<br />\nlin, pursuing special studies in diseases of the throat.<br />\nDr. George L. P. Radcliffe, having resigned his position at the Balti'97<br />\nmore City College, has joined the Hopkins contingent in the law department of<br />\nthe University of Maryland.<br />\nZ. Marshall Ballard is again at the University as student. He has<br />\n'98<br />\nentered the graduate department of geology.<br /><br />\n'88<br /><br />\nF. Peyton Rous has been forced to suspend his work as a third-year<br />\nstudent at the Medical School in consequence of inoculation received during an<br />\n°pet ation. He has gone to Dallas, Texas, whence he will proceed to a ranch,<br />\nto live for a while in the open air. His class at the Medical School has presented him with a handsome saddle.<br />\nNorman Boyer has left New York for Durango, Mexico, where he will<br />\n'01<br />\ncontinue to 'write special articles for Success and other periodicals.<br /><br />\n'00<br /><br />\nMr. Frank D. Mower is studying medicine at the University of Virginia.<br />\nHe expects to enter the Medical School next year.<br />\nDr. Daniel A. Penick, Ph. D., '98 who was recently married in Arkansas,<br />\nhas been made associate professor of Greek at the University of Texas, where<br />\nhe received his bachelor's degree in 1891.<br />\nwas married to Miss Olivia Cottkling on<br />\nDr. Louis W. Ladd, M.<br />\nTuesday, November 25. Dr. and Mrs. Ladd will live in Cleveland, Ohio.<br />\nCharles W. Ottley, M. D., '99, is several times mentioned in the report of<br />\nPresident George Washburn, of Robert College, Constantinople, in which institution Dr. Ottley has recently become Professor of Biology, Director of the<br />\nGymnasium, and Physician of the College. President Washburn says: \"A<br />\nman of less energy and devotion would probably have gone away discouraged<br />\nat the end of the year. - - He had to create the place which he was called to<br />\nfill. - - We who have done this work in past years rejoice most in the coming<br />\nof Dr. Ottley.\"<br />\nMr. Frank I). Mower has left his graduate work at the University, and is<br />\nnow studying medicine at the University of Virginia.<br />\nDr. James W. Harry, fellow in history last year, visited friends at the<br />\nUniversity last week.<br /><br />\n'liIE 1\\1 EWS-LETTER<br /><br />\n5<br /><br />\nFOR THE UNDERGRADUATE.<br />\nN Tuesday night the Musical Clubs gave the second concert of the season<br />\nat St. Mary's Church, Roland Park. This, the second of the four trial<br />\nconceits before the Christmas trip, had to be given on a week day, since<br />\nFriday night, the first date, fell within the holidays. For this reason, several<br />\nof the players were absent, and the performance was thereby hampered. The<br />\nMandolin Club continued to play with the unanimity and dash with which it<br />\nbegan the season. J. A. Bryan. '03, the leader, has a large number of pieces in<br />\nthe repertory, and they are of better quality than usual, so it is probable that<br />\nthe Club this year will be a good one. The Glee and Banjo Clubs showed the<br />\nneed of more individual work. After the concert, the Rev. Mr. Dennis<br />\ngave an enjoyable entertainment to the men at the rectory.<br />\nThe next concert will be at Spring Grove, Catonsville, on Friday.<br /><br />\nO<br /><br />\nThe line-up at the Junior-Freshman game Saturday will probably be taken<br />\nfrom the following candidates:<br />\n'05<br />\n'04<br />\nBoyce,<br />\nBowie,<br />\nEnds<br />\nEmig, Strohbar<br />\nBaetjer.<br />\nW.<br />\nJackson,<br />\nDill,<br />\nRosenheim, Branham.<br />\nWroth, Campbell, Straughn.<br />\nTackles<br />\nRosenfeldt, Foster<br />\nMiller, Goldman.<br />\nGuards<br />\nErlanger, Butler,.<br />\nCrozier, Licking,<br />\nBanghart.<br />\nCenter<br />\nMuhley, Lewis,<br />\nHudgins.<br />\nQuarterback<br />\nDulaney, Le Cron,<br />\nGeiger, Branham.<br />\nStone.<br />\nFullback<br />\nPearre, Evans,<br />\nWayson,<br />\nChism, Super.<br />\nHalfbacks<br />\nEmz: , Strohbar,,<br />\nThe game will be called at 2.30, at American League Park, and will be<br />\nfollowed by a cane-rush The \"wise ones\" are predicting a score of 12-0 for<br />\n'04, but some are found who are willing to back their theory that the Freshmen<br />\nwill score.<br />\nAt the organization meeting of the Sub-Freshman Class the following officers were elected: President, H. H. Custis; vice-president, F. S Ehelen; secretary treasurer, V. M. Frey; historian, A. B. Crane.<br /><br />\nContributions to the 1903 HULLABALOO are solicited by the board of editors from men in every department of the University. Local hits and personalities are just as welcome as are more serious efforts in poetry and fiction.<br />\nEvery student in the institution can help to make the volume this year really<br />\nrepresentative of life at the J. H. U.<br /><br />\nTI I<br /><br />\nNEWS-LETTER.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br /><br />\nDECEMBER 5, 1902.<br />\nSubscription $1.50 per year.<br />\nEditor in Chief, .<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n.<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\n10 Cents a single copy.<br /><br />\n.<br /><br />\nFORRET S. LAMER, 1903.<br />\nHARRY K. TOOTLE, 1003.<br />\nGEORGE A. FOSTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br />\nW. S. BIRD 1908.<br />\nHARRY BAETJER, 1903,<br /><br />\nAddress all articles, communications, etc., to ROBERT S. LANIER, box 374, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETJER,<br />\nJ H U.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\nC<br /><br />\nHE letter following this column will be read with interest by all who desire<br />\na better attendance at the games played by Hopkins teams. The plan<br />\nproposed is similar to the course of the football management last fall,<br />\nwhich sold season tickets at a reduced rate. The writer does not state just how<br />\n\"The Powers that Be\" are to show their displeasure to delinquents; but it is<br />\ntrue indeed that a greater sense of obligation should prevail among the student<br />\nbody concerning attendance at 'Varsity games.<br />\n4 4ZIIE right kind of spirit\" is the best commentary on this year's football<br />\nteam, as it should be the best motto for all future teams. Probably<br />\nnever in the entire history of Hopkins' uphill athletic struggles did she<br />\nstart the football season with a more hopeless outlook. It is to the light and<br />\nmostly inexperienced men, who came out and worked in the face of all discouragement for the first three weeks, that we owe the creditable showing that<br />\nbegan with the Western Maryland game and was kept up for the rest of the<br />\nseason. There are two kinds of colleges where football succeeds: the big university whose previous athletic reputation serves to draw to her the stars of the<br />\nprep-school teams; and the small compact college, where an enthusiasm exists<br />\nwhich brings out to practice every man in the college who is physically sound,<br />\nwhether or not he is a football player by weight or inclination. Hopkins, by<br />\nher peculiar conditions, which deprive her of the services of the bulk of her<br />\ngraduate and medical students, and leave the burden of athletics upon an un-<br /><br />\nTHE NEWS—LETTER.<br /><br />\n7<br /><br />\n,<br />\ndergraduate body amounting to less than one-third of her total enrollment<br />\ncan<br />\nhonor<br />\nmust naturally fall under this second category. And her athletic<br />\nonly be maintained by the same pluck and enthusiasm which has snatched<br />\nvictory from despair this fall. \"Well done!\"<br />\nHE cheering and singing during the football season past has shown some<br />\ncurious features. In the first place, there has been unusual activity in<br />\nthe -writing of new songs and yells. Dozens of suggestions have been made<br />\nfor parodies on airs of the day, some of which have proved very taking, while<br />\nat one time it seemed as if every undergraduate was proposing a yell that he<br />\nhad written—or stolen. But, on the other hand, there have not been enough<br />\ncarry<br />\nrooters, except, strangely enough, at the one game played out of town, to<br />\nafof<br />\nstate<br />\nthis<br />\nfor<br />\nremedy<br />\nout successfully the wealth of ideas. A proposed<br />\nmaterial,<br />\nnew<br />\nof<br />\nsuggestion<br />\nfairs is found in another column. As regards the<br />\nit has been borne in upon the minds of those who were privileged to examine<br />\nthese late productions, that a little originality would give a great deal of help.<br />\nIt seems astonishing that among the hundreds of presumably fertile and ready<br />\nminds that feed so eagerly at the mental pastures offered by our University,<br />\nnot one can be found to suggest a combination of \"Rahs\" or other war-cries<br />\nthat will be at once novel and euphonious. It is just as astonishing that the<br />\nclub, or<br />\nproduction of catchy and suitable songs for the side lines, the glee<br />\na good<br />\nis<br />\nInterest<br />\nthe keg—party should average no more than one per annum.<br />\nthe<br />\nhalf<br />\nand<br />\nform<br />\nthe<br />\nthing; but the kind of interest that is satisfied at cribbing<br />\nkind<br />\nthe<br />\nis<br />\nas<br />\nsubstance of six yells used by other colleges is not as welcome<br />\nthat thinks out a little something on its own account. If the good work goes<br />\nadhere<br />\non, with the object always in mind that it is far from necessary to<br />\nhave a<br />\nwill<br />\nwe<br />\nstrictly to precedent in the composition of cheers and songs,<br />\naround.<br />\ncome<br />\nfine collection of \"novelties\" when the track and lacrosse seasons<br /><br />\nZ<br /><br />\nTo the -Editor of THE NEWS- LETTER:<br />\nDEAR SIR:—One does not know the healthful influence exerted upon a<br />\nteam when it hears itself cheered and urged on to victory by a large number of<br />\nvoices; one does not appreciate the fact that there is an increased ability to<br />\nplay when the effects of this cheering are felt. But as long as separate tickets<br />\nare sold for each football or lacrosse game, there will always .he someone who<br />\nwill find an excuse not to be present. This fact is recognized at other universities, such as Cornell, Pennsylvania, etc. The question may then arise, perhaps, in what way can this difficulty be overcome and obviated? To obtain a<br />\nsolution, nothing more is necessary than to take example from the practice of those universities mentioned above. There it is obligatory for every<br />\nmember of the university to purchase a book which contains tickets not only<br />\nfor every football game, but also for every other exhibition in any way connected with athletic sports. If any student refuses to purchase one of these<br />\nbooks, unless for the best of excuses, he is strongly made to feel the displeasure<br /><br />\n8<br /><br />\nTHE NEWS-LETTE:R.<br /><br />\nof \"the powers that be.\" Under this method of procedure, there is a highly<br />\nsuccessful attendance at all games, for it is human nature that after a person<br />\nhas purchased a ticket of admittance to a game, he will make use of it, unless<br />\na very good reason prevents.<br />\nThis plan of issuing books cannot cause a slimmer attendance than we<br />\nhave had at some games, and, on the other hand, it is possible that it might be<br />\nproductive of much good. In view of this, the writer would like to propose<br />\nthat consideration of such a step be invited in THE NEWS-LETTER, so that the<br />\nviews of the student body at large may he obtained.<br />\nG. 13. R., '04.<br /><br />\n1111111111111111111111UU1111111111111111111111111111MIN11111111Mlimfillnwm111111111111111111111111111111111111MIIIi1111111111111111111111111011111111111<br /><br />\nisismaaPoimo.<br /><br />\n'<br /><br />\n81131111110111111111111111111111111W1111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111110111111111117311;1110<br /><br />\nT the annual meeting of the Friendly Inn Association, which took place<br />\nlast week, Dr. Remsen was elected president.<br />\nDr. Ira Remsen and Professor Jacob H. Hollander, of the University, have<br />\nbeen asked to respond to toasts at the annual banquet of the Alumni of the<br />\nCity College on December 9.<br />\nDr. Wm. Clark was elected secretary and treasurer of the recently organized Amherst College Alumni Association. There are a number of Amherst<br />\nmen at the University, all of whom are members of the society.<br />\nPresident Remsen was the guest of honor at the banquet held last week in<br />\nconnection with the celebration of the golden jubilee of Loyola College. Dr.<br />\nRemsen responded to the toast, \"The American College.\"<br />\nOn Monday, Noveml,er 24th, Prof. G. W. Ritchie, of the Yerkes Observatory and the University of Chicago, lectured before the Johns Hopkins Scientific<br />\nAssociation. The subject of the lecture was \"Recent Results in Astronomical<br />\nPhotography with the Large Instruments of the Yerkes Observatory.\"<br />\nJohn Murphy &amp; Company, of this city, will shortly issue a volume entitled<br />\n\"The Lords Baltimore and the Maryland Palatinate,\" containing six historical<br />\nlectures delivered at the University last spring by Mr. Clayton C. Hall, of the<br />\nBaltimore bar.<br />\nDr. Jacob H. Hollander will deliver, at Hazazer's Hall on Sunday next, the<br />\nfirst of a series of lectures which have been arranged for by the Baltimore<br />\nTypographical Union No. 1 2. His subject will be \"Political Economy and<br />\nLabor.\"<br /><br />\nTHE NEWS-LETTER.<br /><br />\n9<br /><br />\nThe Economic Department of the University has undertaken the republication of a number of rare and valuable works on political economy.<br />\nThe series, under the editorial direction of Dr. Jacob H. Hollander, will be:<br />\n\"The Price of Gold,\" three letters contributed to the Morning Chronicle<br />\n(London) in August November, 1809, by David Ricardo.<br />\nAn Inquiry Into the Nature and Progress of Rent,\" by T. R. Malthus<br />\n(1815).<br />\n\"An. Essay on the Application of Capital to Land,\" with a discussion of<br />\nthe corn supply, by Sir Edward West (1815), fellow in University College,<br />\nOxford.<br />\n\"A Refutation of the Wage-Fund Theory of Modern Political Economy as<br />\nEnunciated by Mill and Fawcett,\" by Francis D Longe (1866).<br />\n\"A Collection of Latin Proverbs,\" a series of four articles, first published<br />\nIii the American \"Journal of Philology\" by the late Dr. Sutphen, has been<br />\nrecently published in book form. The book, which has been published as a<br />\ntribute by friends of Dr. Sutphen, contains his most important contributions to<br />\nthe branch of Latin Literature in which he was especially interested. Dr.<br />\nKirby F. Smith contributed the introduction, which contains a short sketch of<br />\nDr. Sutphen.<br /><br />\nY. M. C. A. NOTES.<br /><br />\nIt<br /><br />\nEV. FRANCIS E. CLARK, D. D., President of the United Society of<br />\nChristian Endeavor, spoke to a group of Mopkins men at the meeting<br />\non Tuesday, December 2nd.<br /><br />\nOn December 2-4, at Trenton, N. J., a conference of Y. M. C. A. leaders<br />\nof the Eastern States will meet to discuss the Foreign Work. John A. Addison,<br />\n'03, will-represent the Hopkins Association.<br />\nAn invitation has been received from Princeton, asking the Hopkins Association to send a representative to their celebration of the 25th Anniversary of<br />\nthe founding of the Student Y. M. C. A. movement of the United States and<br />\nCanada, which will be held on December 6th. Mr. C. W. Young will attend<br />\nfor the Medical School Association, and the General Secretary for ours.<br />\nMr. John R. Mott, College Secretary of the International Committee and<br />\nGeneral Secretary of the World's Christian Student Federation, will speak to<br />\nmen at Ford's Opera House, on Sunday, December 14th, at 3.30 o'clock. Mr.<br />\nMott is a man who is in touch with the colleges and universities of the whole<br />\nworld, having been around the world twice on such visits. He is a careful and<br />\nintense student of religious matters and should attract a large audience. All<br />\nHopkins men who are at all interested in the problem of a broad and right<br />\ndevelopment of life should try to hear him. He also speaks to men at the<br />\nHopkins Medical School on the evening of the 14th, at 7,30.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER<br /><br />\nMARYLAND, 5, HOPKINS, 0.<br />\nOPKINS has every reason to be proud of the football team which held the<br />\nUniversity of Maryland down to one touchdown on Thanksgiving day,<br />\nthe final score being 5-0. Twice, when the Black and Blue goal was in<br />\nimminent danger, the light line stood like a stone wall, and each time the ball<br />\nwas gained on downs,<br />\nThe University of Maryland kicked off to Strohbar, who advanced the ball<br />\n10 yards. Hopkins then rushed the doctors' line for 10 more yards, but the<br />\nball went to Maryland on downs. They steadily advanced, by end runs and<br />\nline plunges, until dangerously near the Hopkins go al. Encouraged by the<br />\n\"faithful,\" with their yell of \"Hold them, Hopkins!\" the team took a brace<br />\nand recovered the ball on downs.<br />\nDespite the fact that Maryland again obtained the ball on our 5.yard line,<br />\nwe again held the doctors for downs. Yearly and Kellum, especially, figured<br />\nin this splendid stand.<br />\nHopkins now did some grand-stand playing. The plunges by Blanck and<br />\nWilbur advanced the ball 20 yards. A minute later, Houghton made the star<br />\nplay of the game by a beautiful run of 45 yards around left end. Coffee was<br />\nthe only man between Houghton and the doctors' goal, and, for a minute,<br />\nvisions of a touchdown floated before the eyes of the Hopkins adherents.<br />\nMiller then went around right end for 8 yards, and Blanck was pushed<br />\nthrough the line several times until the ball was on Maryland's 4-yard line.<br />\nEverything seemed to be coming Hopkins way at this point, and the rooters<br />\nsang for a \"Touchdown, Touchdown,\" but an unlucky fumble lost the ball,<br />\nand it was punted out of danger.<br />\n.<br />\nHopkins kicked off in the second half. In spite of heroic efforts, we<br />\nwere unable to prevent Maryland from scoring a touchdown, since the left side<br />\nof our line was by no means impregnable. Several times the ball had been<br />\nbrought back by the referee after it had been taken across the Hopkins side<br />\nline, because Maryland had gone out of bounds, Griffin failed to kick goal.<br />\nA few minutes later, the game ended with the ball in Hopkins' possession<br />\nabout the middle of the field.<br />\nThe game was fiercely contested from beginning to end. Hopkins fought<br />\nfor every inch of the ground, and not until the middle of the second half could<br />\nthe doctors make any substantial gain by their heavier weight. The end runs<br /><br />\nTHE NEWS—LETTER.<br /><br />\n11<br /><br />\nby Houghton and Iseman set the rooters wild, and the line plunges of Blanck<br />\nand Wilbur were always effective. Blanck also did some fine tackling, getting<br />\nhis man almost everytime, and bearing the brunt of the defense work around<br />\nthe end.<br />\nThe line up was as follows:<br />\nJ. H U.<br />\nU. cnit MD.<br />\nHoughton<br />\nWinslow<br />\nr e.<br />\n.<br />\nGreene<br />\nGribble<br />\nr. t<br />\nYearley<br />\nr g..Mc<br />\n.<br />\n.......Cann<br />\nMarshall<br />\nBuck<br />\nc.<br />\nKellu m<br />\nMitchell (Capt.)<br />\n1 g<br />\n..<br />\nRosenfeld, Bacon.<br />\nScott<br />\n.1. t<br />\nCaulk<br />\nDaum, Brent<br />\n1 e.<br />\n.<br />\nStrohbar<br />\n....Coffee<br />\n.q. b<br />\nEisman.............„.................. ....r. h. b..........<br />\nMann<br />\nWilbur, Blatick (Capt.)<br />\nHenderson<br />\n1 h b<br />\nBlanck, Stone<br />\nGriffin<br />\nf b<br />\nReferee—Mr. E. A. Rich, Trinity. Umpire—Mr. Nat Poe, Princeton.<br />\nTimers —Iddins, Maryland Athletic Club; Woodward, University of Mary •<br />\nland. Linesmen—Tough, J. H. U.; Matthews, University of Maryland.<br />\nTime of Halves-25 and 20 minutes.<br /><br />\nHOPKINS, 17; MARYLAND AGRICULTURAL COLLEGE, 0.<br /><br />\nt<br /><br />\nHE game on Saturday, Nov. 22nd, was gratifying to all those who had the<br />\nwelfare of the team at heart. The Hopkins players immediately assumed<br />\nthe offensive and did not let up for a moment, showing the effects of good<br />\ntraining.<br />\nM. A. C. kicked off in the first half. The ball was downed back of the<br />\ngoal line and Hopkins punted out from the 25-yard line. The College backs<br />\nmade several futile attempts to break through our line, but soon lost the ball<br />\non downs.<br />\nSeveral fine end runs by Miller and line rushes by Blanck and Eistran<br />\nquickly placed the ball on the 3 yard line. But at this crucial point, a fumble<br />\nwas made, and M. A. C. secured the ball. For a short time, a revolving mass<br />\nPlay from end to tackle was successful, but we quickly \"caught on,\" and M. A.<br />\nC. was forced to kick after having lost 8 yards.<br />\nMiller, Green and Blanck rapidly brought the ball to within one foot of<br />\nthe line, and a slight push sent Eisman over for our first touchdown. Blanck<br />\nkicked goal, and after 16 minutes of play the score stood 6 to 0 in our favor.<br />\nM. A. C. kicked off, and the ball was downed on the 30-yard line. Miller<br />\nwent around right end for 15 yards. An exchange of fumbles left the ball<br />\nagain in our hands. Miller kicked, and the ball was stopped on the 35 yard<br />\nline. About this time the whistle blew, and the first half was over.<br /><br />\n12<br /><br />\nTHl NEWS—LETTER.<br /><br />\nIn the second half, Hopkins kicked off, and after a few minutes of play M.<br />\nA. C. was forced to punt. Miller went around the end for 15 yards, but we<br />\nlost the ball on a fumble. M. A. C. soon made a \"delayed fumble\" and the<br />\npig-skin was again ours. Then our boys buckled down to really serious work,<br />\nand Blanck was hustled across the line in short order for our second touchdown. He also kicked goal, making the score 12 to 0.<br />\nOur third touchdown was the result of a beautiful thirty-yard run by<br />\nMiller, who easily dodged several of the Aggies who attempted to tackle him.<br />\nBlanck failed at goal, leaving the score 17 to 0 The remaining few minutes of<br />\nthe game were spent in the middle of the field, and the whistle sounded with<br />\nthe advantage on neither side.<br />\nThe line-up was as follows:<br />\nM. A. C.<br /><br />\nCaulk<br />\nGreen<br />\nHutchins<br />\nMarshall}<br />\nRiley<br />\nYearley<br />\nRosenfeld<br />\nHoughton<br />\nHazelhurst<br />\nStrohbar<br />\nEisman<br />\nMiller<br />\nBlanck (Capt.)<br /><br />\n1 e.<br />\n1. t<br />\n1. g<br /><br />\nSmith (Capt.)<br />\nFesmyer<br />\nBradfield<br />\nMitchell<br /><br />\nr. g.<br />\nr t<br /><br />\nAlbritten<br />\nNaylor<br /><br />\nr e<br /><br />\nStoll<br /><br />\nq b<br />\nr. h b<br />\n1 h. b<br />\nf. h<br /><br />\nMatthews<br />\nGorner<br />\nDuganne<br />\nWatts<br /><br />\nTime—Twenty-five and twenty minute halves. Umpire—Mr D J.<br />\nMackey, M A. C Referee—Mr. Ernst Rich, Trinity College. Linesmen—<br />\nR. C. Hoffman, J. H. U., and Professor Bradford, M. A. C. Timers—W. E.<br />\nHoffman. J. H U., and Dr. H. M. Whitehurst.<br /><br />\nWITH THE RUNNERS.<br />\nURING the present week, regular track training has been temporarily suspended on account of the monopoly which the Junior and Freshmen<br />\nsquads are exercising on the cage. Next week work will be resumed<br />\nand kept up in mild form until the inter-class meet, which is being considered<br />\nfor some time during January. No definite arrangements have been made.<br />\nCaptain Hoffman has not even yet decided whether the events will be scratch<br />\nor handicap.<br />\nAt the first meeting of the track and field team, held in the trophy room,<br />\n36 candidates responded and the chances are that several more will be added to<br />\nthat number. With such a plentitude of material some gcod work is expected<br />\nduring the winter.<br /><br />\n9<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\nLACROSSE NEWS<br />\nH1-.., meeting of the Intercollegiate Lacrosse Association of the United<br />\nmost satisStates at Philadelphia last Saturday resulted in a manner<br />\nP. Straus<br />\nHenry<br />\nCaptain<br />\nfactory to the Johns Hopkins representatives.<br />\nand<br />\nmbie,<br />\nAbercro<br />\nT.<br />\nR.<br />\nwas elected president of the Association to succeed<br />\nthe<br />\nin<br />\nHopkins<br />\nand<br />\nore,<br />\nSwarthm<br />\nStevens Institute was allowed to join Lehigh,<br />\non<br />\nre<br />\nBaltimo<br />\nin<br />\nBlue<br />\nand<br />\nleague, upon condition that they play the Black<br />\nbe<br />\nto<br />\nusual<br />\nthan<br />\ngame<br />\nmore<br />\nApril 18. By this arrangement, there will be one<br />\nwon.<br />\nbe<br />\ncan<br />\nnship<br />\nchampio<br />\nPlayed in the intercollegiate league series before the<br />\nwill probably<br />\nBesides the league games with the other three teams, contests<br />\nmore than<br />\nis<br />\nIt<br />\nHobart.<br />\nhe arranged with Harvard, Columbia, Cornell and<br />\nts are<br />\nCrescen<br />\nThe<br />\ne.<br />\nlikely that three other games will be played in Baltimor<br />\nand<br />\ncloses,<br />\nseason<br />\nthe<br />\nbefore<br />\nexpected to appear at the American League Park<br />\nis<br />\nThere<br />\nassured.<br />\nlly<br />\npractica<br />\nanother game with the University of Toronto is<br />\nfrom<br />\naduates<br />\nundergr<br />\nof<br />\nalso soli e talk about a contest with an English team<br />\nSpring. Should all these<br />\nCambridge and Oxford, which is expected here in the<br />\nfor Hopkins.<br />\none<br />\ngames be arranged the season will be a memorable<br />\nHopkins game last<br />\nToronto<br />\nPresident Roosevelt was unable to attend the<br />\nto play the<br />\ndecided<br />\nwe<br />\nseason, hut promised to be on hand this year in case<br />\na recordassure<br />\nwould<br />\ne<br />\nCanadians. The presence of the nation's chief executiv<br />\nbreaking crowd at the game.<br />\nthe outIn regard to the prospects of a strong team for the coming season,<br />\nough,<br />\nback—T<br />\nis<br />\nlook is by no means gloomy. Almost the entire defense<br />\nSchool<br />\nMedical<br />\nthe<br />\nto<br />\nBlanck, E. Schmeisser, Straus,--and Briscoe may return<br />\nin the spring in time for lacrosse. Cm the attack, Bird, Putts, and Bernheim<br />\nof last year and the<br />\nremain, but several promising men are among the \"subs\"<br />\nr J. A. Addison<br />\nchances are that a strong twelve will be developed. Manage<br />\nhas not completed the schedule of games.<br />\nat the service of<br />\nAs s-oon as the class football game is over, the cage will be<br />\nwill begin regular<br />\nlacrosse and track and field men, and Captain Straus<br />\nPractice.<br /><br />\nZ<br /><br />\nof next year's footThomas S. Strohbar, 1904, has been elected captain<br />\nball team.<br />\nRECENT LECTURE.<br />\nd a lecture<br />\nROFESSOR ALCEE FORTIER, of Tulane University, delivere<br />\nLanTheir<br />\n,<br />\nHistory<br />\nTheir<br />\nin French on \"The Creoles of Louisiana:<br />\naudithe<br />\nIn<br />\n24.<br />\ner<br />\nNovemb<br />\nguage, and Their Literature\" on Monday,<br />\nseminaries and<br />\nwere a number of young ladies from the various<br />\nthere<br />\nence<br />\nschools in the city.<br /><br />\n(p<br /><br />\n14<br /><br />\nTHE NEWS—LliTTER•<br />\nTHE HISTRIONIC HOPKINS HOST;<br />\nThe Shining Stars of the Select Society of Supernumeraries.<br />\nWhy is the stage so crowded? what means this stir at Ford's?<br />\nThe noble troops of Hopkins \"supes\" are brandishing their swords.<br />\nThere stands the gallant Treide, in tights of red arrayed,<br />\nHis hair so light is hid from sight beneath a helmet's shade;<br />\nFor never was a dago, in any land I ween,<br />\nWith hair like that beneath a hat by mortal man e'er seen.<br />\nBeside him stands Pat Riley prepared to do or die,<br />\nIn coat of mail he doth not quail nor backward turn his eye;<br />\nBut ever looks he toward the foe, while winds the battle horn,<br />\nA powder keg beside his leg he treats with noble scorn.*<br />\nBut had that keg been full of beer, and had that keg been ope,<br />\nHis eye would turn from foeman stern and he would 'gin to tope;<br />\nAnd so would all that Hopkins band who fought for Count aid home,<br />\nThey ne'er had stopped till they had dropped and nought was left<br />\nbut foam.<br />\nThere stands our chief, brave Hunley, the captain of the \"supes,\"<br />\nThe battle's nigh, his heart beats high as he reviews his troops.<br />\n0 wielder of the trenchant pen! say, is it not immense<br />\nTo tread the boards to-night at Ford's for paltry forty cents?<br />\nThere stands the tried tough Tootle, Missouri's favored son,<br />\nHe's brave to-night and he will fight until the battle's won.<br />\nBehold stout Wilton Snowden! A man of might is he,<br />\nThere is a charm keeps him from harm, now list what it might be:<br />\nHe is a doughty \"fusser,\" a winner with each belle,<br />\nA maiden's prayer breathed on the air to-night protects him well.<br />\nThese five compose that noble host, with Hopkins grads a few,<br />\nAnd well-nigh ten tried \"super\" men to whom the scene's not new.<br />\nAnd now the battle rages, and now the cry is raised,<br />\n\"Now once again, have at them, men, and all the saints be praised!\"<br />\nWhen Madam Duse turns on them and bids that no man fly<br />\nLike leaping fire her eyes inspire each man to do or die.<br />\n\"Verrucchio! Malatesta!\" Their throats they nearly split.<br />\n\"Victoria! Ha-ha! Ha-ha!\" Each thinks he makes a hit.<br />\nStout Treide grasps a hand-grenade as if he felt no fear,<br />\nHis aim is bad, he must be mad, the wall it does not clear;<br />\nYet it doth hit the battlement, and gracefully bound o'er,<br />\nAnd falling down inside the town kills fully half a score.<br />\nBill Hunley is beside himself, he rages at the foe,<br />\nFrom painted tower the arrows shower, shot from Bill's good cross-bow<br />\n.<br />\n\"A hit! a hit!\" he loudly cries, \"what say you to that now?\"<br />\nWith pride he's filled, his shot has killed a ruminating cow.<br />\nWhen youthful Snowden, gentle youth, was just about to shoot<br />\nHe did espy a maid close by who really was a beaut;<br />\nAnd so he let the tattle slide, and gave it no more thought,<br />\nBut for a kiss from that fair miss he valiantly fought.<br />\nIntrepid Tootle swears full loud amid the crackling flames<br />\nThe foe he'd rout without a doubt if he had Jesse James<br />\nAnd some few bad Missourians of that bold, bandit stamp<br />\nTo show the way to win the day within the dago camp.<br /><br />\n*Anachronism. Had it really been powder he would have done<br />\nas the ballad states.<br /><br />\nTHE NEWS-LETTER,<br /><br />\n15<br /><br />\nAnd what of Charlie Riley, whom we all know as Pat?<br />\nWhat thoughts sublime are keeping time beneath that pot iron hat?<br />\nHe firmly holds a hand-grenade and bravely lets it fly<br />\nWith mighty rage across the stage straight at the painted sky.<br />\nAnd was that then the end of it? Ah no! pray hear the rest,<br />\nIt was not spent till it had went against the prompter's breast,<br />\nAnd knocked his book from out his hand, his specs from off his nose,<br />\nAnd finished well when down it fell and crushed that worthy's toes.<br />\nNow is the battle ended, and now the victor's prize<br />\nIs due to those who wore the clothes of \"supes\" in lowly guise<br />\nNow hail them, all ye Hopkins men, hail them with glad accord,<br />\nWhile ye have slept these five have kept their watch with bow and sword,<br />\nNow hail them, all ye maidens fair, and crown their victor brows;<br />\n'03.<br />\nRight soon begin and ye may win a hero for a spouse.<br /><br />\nFABLES FOR THE FOOLISH.<br />\nIn Words of a Few Syllables.<br />\nIII. THE FABLE OF 'ME F001, AND HIS MONF.Y.<br />\nHERE was once a college youth who had a friend who knew a lot about the<br />\nlaws of chance. Only he called his system a \"sure thing.\" There was<br />\nnever a race or a ball game when he did not know which way the money<br />\nought to be placed. On the day of the great game, the college youth came up<br />\nto him and requested a few pointers on the result. He said that he was slightly<br />\nafraid to put up his money, as the other college had a good team. The man<br />\nwho knew a lot about the laws of chance looked wise but said nothing. The<br />\nother college had barrels of money and they began to lather the field with it,<br />\nfinally offering large odds for the purpose of catching the suckers whom a wise<br />\nlaw of nature provides for the people who know just what to do to a good thing.<br />\nThe college youth ran breathlessly over to the friend who knew a lot about<br />\nthe laws of chance and told him that the other fellows were offering odds of 3 to<br />\n1. He asked for advice. As he talked the odds jumped up to 5 to 1. The man<br />\nwho knew listened in silence. At last he realized that the college youth was<br />\ngoing to get reckless no matter what he said, so he proceeded to give a few bits<br />\nof oracular advice.<br />\n\"My friend,\" quoth he, \"a fool and his money are soon ifarted. I guess<br />\nyou had better place all you have on the result at the best odds that you can get.\"<br />\nThe young man went away joyfully and let them separate him from his roll.<br />\nThe next day he met the man who knew a lot about the laws of chance,<br />\nand his sorrowful countenance betrayed deep emotion.<br />\n\"Friend,\" he said, \"you have played me false. I asked you as a friend to<br />\ntell me how to place my money, and you told me that a fool and his money are<br />\nsoon parted. But instead of getting their money at big odds they have wiped<br />\nme off the map.\"<br />\n\"I did tell you that a fool and his money are soon parted,\" said the wise<br />\nguy, \"but you did not realize that you were the fool.\"<br />\nMORAL: This fable teaches freshmen that there are always two points of<br />\nview.<br /><br />\nC<br /><br />\nTHE NEWS—LETTER.<br /><br />\nP4N.<br /><br />\nRNGES<br />\nOur Exchange Editor was shocked at receiving a copy of the McGill Outlook<br />\naddressed to `I NEWS LETTER, Johns Hopkins University, Baltimore,<br />\nOhio,\"<br />\nfrom which place it had been forwarded here. It is painful to think<br />\nthat the<br />\nreputation and location of the University are so little known in so near<br />\na coun<br />\ntry as Canada.<br />\nTwo from the HARVARD Lampoon:<br />\nHE(insinuatingly)—Have you a partner for the cotilion?<br />\nSHE (eagerly)—No, I haven't.<br />\nHE (brutally)—Neither have I. But I guess I'll dance stag.<br />\n\"The engagement is broken.\"<br />\n\"Ali! ring off?\"<br />\nPOOR YELLOW.<br />\n\"A drunken man is a pitiable object.\"<br />\n\"Yes; he can't tell had whiskey from good.\"—Michigan Inlander<br />\nWillie tried to tack the carpet,<br />\nWillie's thumb received a slam,<br />\nWhich made Willie very angry,<br />\nAnd he softly murmured—<br />\n\"Mother, mother, bring the liniment.\"—Columbirt .1e's1c).<br /><br />\nThe CORNELL Widow speaks:<br />\n\"That,\" said the loaf, pointing to the oven,<br />\nis where I was bred.\"<br />\nIN KENTUCKY.<br />\nWith all its faults I love the still.<br />\nA dillar, a dollar,<br />\nAn eight o'clock scholar,<br />\nWhat makes you rise so soon?<br />\n\"I need the hours,\" the Senior sighed,<br />\n\"To graduate in June.\"<br /><br />\nTHE chEAPEST PLACE<br />\nIN BALTIMORE FOR<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br /><br />\nH. S. WRIGHT &amp; CO-,<br />\n704 MADISON AVE.<br /><br />\nC. &amp; P.'Phone 3053-Y.A'S<br /><br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\nMathematical and Surveying Instruments,<br />\nDraughtsmen's and Engineer's Supplies._<br />\nN. W. Corner<br />\nLexington and Liberty Sts.<br /><br />\n1,.'sscr Co., of New Y<br /><br />\nAgent Or Kenffet<br /><br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\nB. G. EICHELBERGER,<br />\n308 N. Chartes Street.<br /><br />\nBALTIMORE, M<br /><br />\nHenderson's<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Books,<br />\nMadison<br />\nStudent's Supplies.<br /><br />\nFOR<br /><br />\nHoward Sts.<br /><br />\nADVERTISING SPACE IN THIS PAPER<br />\nAPPLY TO<br /><br />\ne.,e1<br />\n0<br />\n- 4.14!<br />\n1<br />\nLIGHT &amp; LOPABAR<br /><br />\nPUBLISHERS.<br />\nC,OP LtAl<br /><br />\nriroun. e. asImtsr5.<br /><br />\n.100004<br />\n— r)<br />\n,<br />\n1.71A01-11:./AD,,<br /><br />\nM. 1VIEADE,<br /><br />\nOF 1.0N1/0N,<br /><br />\nEXPERT CLEANER AN[) DYER.<br />\n126 N. it'LAW<br /><br />\n(2nd and 3rd floors).<br /><br />\nTho most complete and 1111alern department for<br />\ncleaning, dyeing and altering flent's and Ladies,<br />\ngarments.<br />\nIt's time jour Winter Clothing was put in order.<br />\nnoes It need to be cleaned, dy,,ii, altered or rePaired? Are new 11nlitgs and velvet collars necessary?<br />\nNever mind what's the matter, we will tlx it up to<br />\nlook like new, and you won't have to pity very much<br />\neither. The Price List speaks for itself.<br /><br />\nM. BERNSTEIN &amp; CO.<br />\n[.ON pox — A ra F.,a ICA N<br /><br />\n...TAILORS AND<br /><br />\nImpoRTERs...<br /><br />\nLOW PRICES AND FINE WORK.<br />\nWe make clothes that, tit well, look well and wear<br />\nwell, that's very important.<br />\nThe most fastidious Rum can tInd nothing to growl<br />\nabout our garments.<br />\nThe same attention is given to the man that is less<br />\nParticular, Its our way.<br />\nWe are prepared to show you a large line of tinPorted weolens, which does not cost any more than<br />\nthe domestic.<br />\n\"SEE US BEFORE BUYING\"<br /><br />\n126 NOIZTH 1:11TAW ST12IThT.<br />\n(Second door<br /><br />\nalt-we Joel Outman &amp; (7o.)<br /><br />\nGENTLEMEN'S CLOTHING PRESSED BY<br />\nCoNTR ACT. $1.50 PER MONTH.<br />\nPRICES Fillt DRY CLEANINCI AND DY KENO<br />\n$1.00<br />\n.25<br />\nTrousers,<br />\n.50<br />\nCoats,<br />\n.25<br />\n..<br />\nVests,<br />\n...<br />\n1.00<br />\nOvercoats, .50, .75 and 1 00<br />\nBoys' Suits, according to size, .75<br />\nVelvet collars on overeoats,<br />\nRIIILINING. -A new lining will often make a garment which you have discarded good for another<br />\nseason's wear. A II altering and repairing done here<br />\nby skilled tailors.<br />\nDYEING.<br />\nGentlemen's Suits tit f humnd pressed,<br />\n1 50<br />\nOvercoats,<br />\n1.00, I.25 and 1.50<br />\nBoys' snits, according to size<br /><br />\ntientlernen's Su its cleaned and pressed<br /><br />\nCLOTHES MADE TO ORDER.<br />\nThe illustrhtions show how the clothes we make tit<br />\nand look—I be wear you'll learn about later.<br />\nThe light,overcoat Is an especially snappy garment.<br />\nThe sack suit is cut after the very newest pattern.<br />\nThe winter overcoat is as swagger as the dressiest<br />\nman could wish.<br />\nWe make all other proper styles, of course; dress,<br />\ncutaway, double-breasted, four-button sack and<br />\nNorfolk suits.<br />\nYou can now have II rat pick of our lirst pick of'<br />\ncloths.<br />\nPrices are low—we never learned to charge too<br />\nmuch. We would like to make your clothes.<br />\nLOWEST PRICES EVER KNOWN.<br />\nWe guarantee to give you latest style u.nd a perfect lit. Workmanship will be the best you oversaw.<br />\nYour money back if you are dissatisfied.<br />\n126 N. Eutaw St.<br />\nM. 131112NSTIAN &amp; CO.<br />\nSEE OUR PRICE LIST FOR CLEANING. DYEING AND ALTERING.<br /><br />\nDrovers Sc Mechanics Nat'l Bank,<br /><br />\nSTIEFF PIANOS<br /><br />\nOF BALTIMORE, MD.<br />\nEI I 111.11.4'1' Al A T P.I/t IA 14144 Mo1 N FlY<br />\nA NI) 1EXPEIKIENCE ('AN HUN'.<br /><br />\nM ft. 1)}7, (IV<br /><br />\nSURPLUS AND PROFITS, $375,000.<br /><br />\nN. 1.,IIIEler Y. ST.<br /><br />\n41\"Transacts a General Baulking Business.<br /><br />\nBo0kSeilerS and<br />\ntat on ers.<br />\nW. BALTIMORE STRUT.<br /><br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LEHMAN &amp; SON,<br />\nFOR<br />\n701 to '7011.<br />\nMADISON AVE,<br /><br />\n1)<br /><br />\nGUSHING ScGOMPANY<br />\n34<br /><br />\nCAPITAL STOCK, $300,000.<br /><br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nKeep constantly on hand the Text Books used<br />\nHi Johns Hopkins University and the Woman's<br />\n#<br />\n#<br />\nCollege of Baltimore.<br />\nSi ATIONBRY—For School, family, Office and Bank.<br />\n.<br /><br />\n-<br /><br />\nHaberdashers,<br />\nShirts, Neckwear,Underwear<br />\nM111111111111111111111111111111111111111111.1.1 Hosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\nim Sale The .1. II If. Pennants, and all other College<br /><br />\nTHOS.BLAKE CO<br /><br />\nJORDAN STABLER GO.<br /><br />\nSamples submitted of<br />\nReads as follows:<br />\nFrench Brandy—no adulterates, no coloring, line quality.<br />\nOporto l'ort—ahsolutely pure, oC superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong,<br />\nSix Ground Splees—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK,<br /><br />\nPennants.<br /><br />\nIlgenfritz Studio<br /><br />\n219 EAST BALTIMORE ST.<br />\nA H. FETTING,<br />\nMANUfACTURER<br /><br />\nARTISTIC PHOTOGRAPHY<br /><br />\nOf<br /><br />\nOreell letter fraternitv jeweirr,<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\nlpicaec Call an? !Examine our line :16c1crc<br /><br />\npurcbaimmi.<br /><br />\n.114:NNIN(iS&amp; 11()IZSPAT.<br />\nMERCH A NT TA I L.()104,<br /><br />\n2I<br /><br />\nSUCIIOSKOT [ii (fu inmins.<br /><br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nStudents.<br />\nSpecial 'Discount to<br /><br />\nc.&amp; P. telephone 44.3 11.<br />\nLibraries arranged and put in<br />\norder without removal. sr sr<br /><br />\nRUZICKA<br /><br />\nt<br /><br />\nBookbinder,<br /><br />\nVV. FA YETT1.1 ST I? PI WE.<br /><br />\nBOOKS!!!<br />\nSECOND=HAND!!<br />\n,<br />\nSchool, Medical and Miscellaneous<br />\nExchanged.<br />\nBought, Sold and<br /><br />\nPIPPEN'S BOOK STORE,<br />\n605 N. EUTii•W ST.<br />\nNear the University.<br />\nBaltimore's Largnst Mil Book Store.<br /><br />\nI. H. U. Binder.<br /><br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE.<br /><br />\nTHEO. WARNER<br /><br />\nWARNER &amp; CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln &amp; Bennett and<br />\nWalter tiarnard's London Hats<br />\n1 471REET.<br />\n:124 VI.EsT 13 A 1.11`1 MORN ,<br />\nManufacturers of<br />\nS Caps<br />\ni<br />\nIA<br />\nHats.<br />\nCassimere<br />\nSilk awl<br /><br />\nNORTH GERMAN LLOYD S. S. 60.<br />\nGABIN PASSAGE AT LOW RATES.<br /><br />\nNem York to tSrenica, Loudon, Paris, Gibraltar, Nolcs, Omioa, etc.<br /><br />\nBALTIMORE TO BRE,MEN DIRECT.<br /><br />\nSGRUMAGRE,11 Sc GO., General Agents.<br /><br />\nFor particulars apply to<br /><br />\nISAAC H.<br /><br />\nTHE<br /><br />\nChas. Willms Surgical Instrument Co.<br /><br />\nJAS. MEIKLE,<br />\nJAS. R. RICHARDS, TREAS<br /><br />\nDIXON, P141 sr.<br /><br />\nVICE -PRIEST.<br /><br />\nSmith, Dixon Co.<br /><br />\nPHYSICIANS'. SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br /><br />\n300 N. Howard St.,<br /><br />\nBaltimore, Md..<br /><br />\n29 - 31 S. Charles Street.<br /><br />"}], "field_media_file": [{"target_id": 36244, "display": null, "description": null, "target_type": "file", "target_uuid": "7292c6d3-e5c8-491e-bed6-d6f766d1f6e3", "url": "http://digital.library.jhu.edu/system/files/2022-03/12224-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12224, "target_type": "node", "target_uuid": "6405ca18-3b06-4e07-986f-99ea64929d57", "url": "/node/12224"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "d968c36b-a40d-4a59-84a4-b6faa3f16f38"}]}