{"mid": [{"value": 36787}], "uuid": [{"value": "409156a5-c568-4cd8-b589-02ef4fc886fc"}], "vid": [{"value": 36787}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:53:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13029-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:53:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:53:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVII. No. 15<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nBALTIMORE, MD., NOVEMBER 21, 1922<br />\n<br />\n\"CASTLES IN THE AIR\" PRE- MANDOLIN CLUBS AND OR- CLOWNS AND BALLET TO BE<br />\nFEATURE OF ST. JOHN'S<br />\nCHESTRA REMAIN SEPSENTED AS BRICK DORMIARATE ORGANIZATIONS<br />\nGAME FESTIVITIES<br />\nTORIES AT THURSDAY<br />\nASSEMBLY<br />\nDirector for Mandolin Clubs Not Arrangement Being Perfected by<br />\nChairman Bill Myers. MamDr. 1.2.1.4s. and. Mr. Palmer Deliver Yet Decided Upon. Glee Club<br />\nmoth Parade Saturday<br />\nHolds<br />\nRehearsal<br />\nIrteresting Speeches on the<br />\n• Morning<br />\nDormitories Before Students<br />\nAfter a great deal of discussion<br />\nGroves' Toe Decides Hard-fought Contest. Hopkins Holds Four<br />\nA host of clowns, an exhibition<br />\nDr. Bliss, of the Committee on and indecision it has been finally<br />\nTimes on Fifteen-yard Line. Taylor Makes Long Run<br />\nDormitories, and Mr. Edward H. decided to conduct the Mandolin. of tight-rope walking, and a balBeef and the unerring toe of one Groves counted for victory last<br />\nPalmer, architect, presented many Club and the Orchestra as separate let, will be among the features prewhen, in one of the greatest battles ever staged on HomeSaturday<br />\norganizations.<br />\nthe<br />\nhalves<br />\nThis<br />\ndecision<br />\nsented<br />\nbetween<br />\nof<br />\nthe<br />\nSt.<br />\nhas<br />\ntheories<br />\nabout<br />\ninteresting- facts and<br />\nthe Johns Hopkins dormitories, one been hanging fire since the first of John's game on Saturday. Under wood Field, Maryland downed Hopkins by a score of 3 to 0.<br />\nOutweighed, but never outgamed, the Black and Blue gridders<br />\nof which is now in progress of con- the year, as there have been a great the capable directorship of William<br />\nmany<br />\nthe<br />\npersonnel<br />\nmembers<br />\nof<br />\nclub<br />\nin<br />\nfaMyers,<br />\nthe<br />\nand<br />\ndeO.<br />\ngiving an eye for an eye and a tooth for a tooth, fought and sweated<br />\nstruction. Dr. Bliss related the<br />\nvor<br />\nof<br />\ncombining<br />\nthe<br />\nMandolin<br />\nstunts<br />\nare<br />\nrounding<br />\ninto<br />\ntails<br />\nof<br />\nthe<br />\nPrinciples which had guided the<br />\nand no doubt swore to a certain extent, until in the closing minutes<br />\nClub<br />\nand<br />\nthe<br />\nOrchestra.<br />\nBoth<br />\nmethform.<br />\nof the final quarter, the overflowing stands were in a frenzy when<br />\ncommittee in planning the structrial,<br />\nand<br />\nture, and Mr. Palmer gave an inter- ods have been given a<br />\nA mammoth parade, including it seemed that the Hopkins men were about to tie or even better the<br />\nesting description of the building the leaders have decided that the the entire undergraduate body, three counters which were on the righ side of Maryland's ledger.<br />\nToward the close of the final<br />\nitself, and discussed the possible former method, the one that has alumni, band and floats will open<br />\nbeen in Use in former years, will the day's festivities. The proces- LACROSSE TEAM LOSES quarter, after having intercepted<br />\ncharges for rentals.<br />\na forward pass by Groves, WalkSERVICES OF COACH<br />\nsion will form at the City Hall<br />\nAt the time the Committee on be continued this year.<br />\nIt<br />\nhas<br />\nbeen<br />\ndefinitely<br />\nnot<br />\nyet<br />\ndeer Taylor advanced the ball 40<br />\nKNIPP<br />\nJOHNNY<br />\nPlaza<br />\nand<br />\nwill<br />\nmove<br />\nup<br />\nFayette<br />\nStudent Activities at Homewood<br />\nthe<br />\nto<br />\nwho<br />\nwill<br />\nconduct<br />\ncided<br />\nas<br />\nCathedral,<br />\nto<br />\nStreet<br />\nto<br />\nLiberty,<br />\nto<br />\nwas created, in 1910, -there was<br />\nFormer Star Forced to Relinquish yards, giving a wonderful exhiMacaulev,<br />\nof<br />\nMandolin<br />\nClub.<br />\nMr.<br />\nbition of broken field running and<br />\nHomewood.<br />\nMt. Royal, and then to<br />\nDuties. Changes Announced<br />\nmuch dissatisfaction with existing<br />\non<br />\nlessons<br />\nBaltimore,<br />\nwho<br />\ngives<br />\nusing all the tricks of dodging,<br />\nin Tentative Schedule<br />\nconditions of dormitory life in<br />\nLeading the parade will be the<br />\nwith<br />\nthe<br />\nmandolin<br />\nand<br />\nbanjo,<br />\nwas<br />\ntwisting,<br />\nside-stepping and stiff<br />\nAmerican colleges, began Dr. Bliss.<br />\nundergraduate band, which will<br />\nJohnny Knipp, who for the past<br />\nthe<br />\nclub<br />\nat<br />\nits<br />\nrehearsal<br />\nlast<br />\nnight,<br />\narming<br />\nat<br />\nhis command before he<br />\nThe system did not compare at all<br />\nprecede the upper-classmen, carry- two years has coached the laMonday,<br />\nNovember<br />\n20.<br />\nMr.<br />\nMacwas<br />\nforcedout of bounds. With<br />\nfavorably with that in use in Enging an enormous banner with the<br />\ncrosse team, will be unable to fill the goal line in sight, the Hopmusician,<br />\nauley<br />\nwell-known<br />\nis<br />\na<br />\nland; the home idea was lacking.<br />\ninscription, \"We Are Going to<br />\nthat position this year, according kins backs could not make ati.Sr<br />\nThe English college, on the whole, having played the banjo in various Beat St. John's.\"<br />\nfor<br />\ndance<br />\ncity<br />\norchestras<br />\nin,<br />\nthe<br />\nto information received by 0. D. impression on the Maryland line.<br />\nis better situated for the developThe freshmen will follow in line,<br />\nMusical<br />\nsome<br />\nyears.<br />\nThe<br />\nClub<br />\nis<br />\n\"Bonner called on Turnbull for<br />\nment of an excellent system of stueach man carrying a placard with Collins, Jr., manager of the latrying<br />\nto<br />\narrange<br />\nto<br />\nhave<br />\nhim<br />\nlead<br />\na<br />\nplacement kick from the 40dent living accommodations. In<br />\nan appropriate slogan. Various crosse team. Several prominent<br />\nMandolin<br />\nClub<br />\nthis<br />\nseason.<br />\nyard<br />\nline. The stands fairly<br />\nthe<br />\nconsidered<br />\nas<br />\nEngland, a college is<br />\nstunts will bring -up the -rear. Ac- men are in view at present, all of<br />\nhard<br />\nworking<br />\nThe<br />\nis<br />\ncracked<br />\nfrom the nervous strain.<br />\nGlee<br />\nClub<br />\na place where men live and are incording to authorities, there will whom are thoroughly competent<br />\nProfessor<br />\ndirection<br />\nof<br />\nunder<br />\nthe<br />\nIt<br />\nseemed<br />\nan age before the turf<br />\nstructed. American colleges are<br />\nbe no less than twenty beautiful<br />\nproduce a successful team. The was patted down to perfection and<br />\nto<br />\nof<br />\nin<br />\ndire<br />\nneed<br />\nis<br />\nBouchau,<br />\nbut<br />\nfounded in isolated districts, widechorus girls attired in up-to-date<br />\nly scattered, and thus have room first tenors. John Sherwood, pres- fashions. It is rumored that there name of the man selected will a satisfactory tee moulded. The<br />\nfor expansion. The English col- ident of the club, requests that all will be several Parisienne dancers probably be announced in the near spectators were by this time as<br />\nsing, or even think<br />\nnearly wild as sane people can be,<br />\nleges group themselves about an im- those who can<br />\nfuture.<br />\nin line.<br />\ntenor,<br />\ncome<br />\nout<br />\nthey<br />\ncan<br />\nsing,<br />\nfirst<br />\nfor<br />\nthey felt that the outcome of<br />\nportant center, and, as the space<br />\nArrangements have been made<br />\nThe tentative schedule for larehearsal<br />\non<br />\nthis<br />\none play would be responsiClub<br />\nto<br />\nthe<br />\nGlee<br />\nis limited, they can grow only to<br />\nfor an elaborate float, which will crosse announced same time ago<br />\nble<br />\nfor<br />\nthe final outcome of the<br />\nnight.<br />\nl'hursday<br />\na certain definite size. About a<br />\ndepict a king, representing Hop- has undergone several changes.<br />\ngame.<br />\nThe<br />\nball was snapped back,<br />\nyet<br />\nQuartet<br />\nhas<br />\nnot<br />\nThe Varsity<br />\nscore of colleges each constitute the<br />\nkins as State champions, standing<br />\nlines<br />\nthe<br />\ncrashed,<br />\nfollowing<br />\nis<br />\nthe<br />\ntentaBonner held the<br />\nlatest<br />\nThe<br />\nUniversities of Oxford and Cam- been picked, but some new quartet in a triumphant position, with his<br />\npigskin<br />\non<br />\nthe<br />\ntee<br />\nand Turnbull<br />\nthis<br />\nmusic has been purchased with<br />\nbridge.<br />\nheel on the chest of an humbled tive schedule released by Mankicked.<br />\nThe<br />\nball<br />\nsailed<br />\nthrough<br />\nIn the matter of dormitories, end in view.<br />\nSt. John's player. Two huges ne- ager Collins:<br />\nthe<br />\nair<br />\nfive<br />\nfeet<br />\nshort<br />\nof<br />\nthe<br />\nmark,<br />\nAbout sixty men were present groes will be in attendance to the<br />\nEnglish colleges possess many simApril 7—Alumni.<br />\nMaryland<br />\nhad<br />\ntime<br />\nfor<br />\nbut<br />\none<br />\nilarities. Usually, a gateway leads at the Glee Club rehearsal in the monarch.<br />\nApril 14—Princeton.<br />\nplay<br />\nbefore<br />\nthe<br />\nwhistle<br />\nblew, and<br />\nto a quadrangle surrounded by two- Barn last Thursday night. The<br />\nIncluded in the line of march<br />\nApril 21--Swarthmore (closed). the game which marked the refor<br />\nstory buildings, with many en- University Ode was gone over<br />\nwill be many machines filled with<br />\n28—Stevens (away) sumption of gridiron relations beApril<br />\ntrances. Each entrance gives admit- the first time this year and all of noise-making instruments and aptween the two schools passed<br />\n(closed).<br />\ntance to the accommodations for the other numbers were rehearsed. propriately decorated for the ocinto history.<br />\n5—Penn.<br />\nMay<br />\nfrom four to eight students. The The club has the \"Winter Song\" casion.<br />\nPrevious to this play Groves<br />\nMay 12—Navy.<br />\naverage suite consists of a bedroom, well in hand and it is expected to<br />\nhad<br />\nattempted another forward<br />\nliving- room and pantry. A chapel make a big hit. After the club reMay 19—<br />\nINITIATES<br />\nwhich<br />\nEPSILON<br />\nTaylor had intercepted and<br />\nDELTA<br />\nPI<br />\nand library form part of the build- hearsed, the quartette held a short<br />\nMay 26—Lehigh (away) closed.<br />\nMEN<br />\nadvanced<br />\nfor a short gain before<br />\nFIVE<br />\nings. The whole has a very home- practice, Mr. Bochau conducting.<br />\nJune 2—Mount Washington. he<br />\nwas<br />\ndowned.<br />\nThree desperate<br />\nDelta<br />\nPi<br />\nthe<br />\nAt a meeting of<br />\nManager Vanneman called attenlike atmosphere.<br />\nOn May 19 it is probable that onslaughts on the Maryland line<br />\nthe Epsilon held last Tuesday the_folThe conditions at Harvard sev- tion to the extra rehearsal in<br />\nthe team will play either Mary- netted seven yards and Turnbull<br />\nan- lowing men were initiated: D. K<br />\nalso<br />\nand<br />\ntonight<br />\nHall<br />\nC.<br />\nE.<br />\neral years ago were in direct conland or Syracuse. The interest in was forced to punt out of danger.<br />\nmaking Vanneman, advertising manager<br />\ntrast with this happy state of af- nounced that the number<br />\na Syracuse game should be espeThe. only score of the game<br />\nfairs. When Dr. Bliss was a stu- the trip to Reisterstown on the of the News-Letter; J. H. Huf- cially keen on account of the came in the early part of the secdent at Harvard, the dormitories night of the first recital will not fard, managing editor of the closeness of the score by which ond quarter when, as the result<br />\nwere used for sleeping only. The exceed forty, and the selection will<br />\nthey defeated Hopkins last year. of a determined advance down the<br />\nNews-Letter and on the business<br />\nmen ate outside of the college, or be made next Thursday night. The<br />\nThe Princeton and Navy games field by Maryland and of an equalstaff of the Hullabaloo; S. A. Mid- are also expected to draw large<br />\nin a large dining room, NiThere the trip will be made by bus.<br />\nly determined stand by Hopkins,<br />\ndleton, business manager of the crowds: the former because of the<br />\nservice was abominable. There was<br />\nat its 20-yard line, Groves was<br />\nlittle opportunity for the formation CLASS DUES DISCUSSED AT Hullabaloo; 0. D. Collins, busi- large Baltimore alumni body; the forced to fall back for a dropSENIOR MEETING<br />\nof friendships by choice. As a reness manager of the Black and Navy game because of the repu- kick from a difficult angle. His<br />\nsult, the average student made few<br />\nThe most important matter Blue Jay ;and F. Dunning, of the tation of the Navy team.<br />\ntoe proved trusty and he sent a<br />\nacquaintances throughout his col- brought up at the Senior Class<br />\nHopkins lost only a few men beautiful kick clearly between the<br />\n'editorial staff of the Black and<br />\nlege life, and, in one case, a man meeting held last Wednesday, Nobusiness staff from last year's team and conse- bars.<br />\nwent through Harvard without a vember 15, was the question of Blue Jay and the<br />\nquently this year's twelve should<br />\nThroughout the first quarter<br />\nsPeaking acquaintance with another class dues. President Cromwell of the News-Letter.<br />\nbe the strongest in years. Those the heavy Maryland team was<br />\nman in the school.<br />\nThis brings the active member- lost by graduatiori and other unable to make the slightest imopened the meeting by discussing<br />\nDr. Lowell's solution of the prob- the question and said that while ship of the. Johns Hopkins chap- cause are Turner, Parsons, Burn- pression on the Black and Blue.<br />\nlem was \"to shake the Freshmen no certain amount of dues could be ter up to fourteen, including, be- ham, Bauernschmidt and Calkins. Time after time the College Parktogether.\" Three dormitories were fixed this early in the year, the man- sides the men mentioned, .L. B. It is not yet known whether or ers were either stopped in their<br />\nbuilt for the Freshmen, who were ner of paying it should be in innot Bartow Griffiss, former cap- tracks or thrown for substantial<br />\nFenneman, president; P. Ives,<br />\nrequired to live in them. Rooms stallments.<br />\ntain of the team, who is pursuing losses. But beef and the Black<br />\ntreasurer; G. P. Fallon, B. J. graduate work at the 'University.<br />\nof all sizes and at all prices were<br />\nand Gold with the plunging McGeorge V. B. Shriver, treasurer<br />\nobtainable. The arrangement was of the class, announced that the Rich, J. F. Muller and J. Leopold. will be able- to play this year. Quade slowly but surely drove<br />\nsimilar to that of the English col- funds from last year's dues were •H. Robinson, a graduate student, Prospects for lacrosse • stars from the Johnnie Hops toward the<br />\nlege, except that the library and $10 short, and that the members Eli Frank, Jr., and F. F. Bram- this year's Freshman class are es- goal. It was in the shadow of<br />\nChapel were lacking. A resident in who had not yet paid last year'; ble, '21; are also members.<br />\npecially bright. A number of the their own goal posts, however,<br />\neach dormitory saw to it that the dues would pay them as an added<br />\nFreshmen have played lacrosse in that Captain Landy's men showed<br />\nThis recently established 'jourFreshmen were well mixed. No part of the dues this year. John<br />\nprep. sehool and it is . expected to the best advantage that nevermaking rap(prie was allowed to pick out a seat Sherwood said that it would be ad- nalistic fraternity is<br />\nthat several of these will strength- say - we - always - fight -yourLbest<br />\nat the table; seats were taken in the visable to spread the dues over the id progress and promises: to. do en the team greatly. The follow- Spirit. which is<br />\ncharacteristic of<br />\norder of entry. To further the entire year, as they May reach $50. much toward the improvement.of ing letter men from last year's this year's battling team. No less<br />\nthe college publications.<br />\nContinued on Page 3, Col. 3.<br />\nContinued on Page,4, col. 2<br />\nContinued on page 2, col..4<br />\nContinued on Page 4, col. 3<br />\n<br />\nBLACK AND BLUE HOLDS HEAVY<br />\nUNIVERSITY OF MARYLAND ELEVEN<br />\n10 SINGLE FIELD-GOAL<br />\n<br />\n•<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 21, 1922<br />\n<br />\n2<br />\n<br />\nR. 0. T. C. NOTES<br />\n\"Castles in Air\" Presented As<br />\nDR. THACH ADDRESSES<br />\nBrick Dormitories<br />\nSOCIAL SCIENCE CLUB<br />\nPresident Frank J. Goodnow and<br />\nContinued from page 1<br />\nLast Friday afternoon Dr.<br />\nMajor Enoch B. Garey representFOUNDED 1897.<br />\nThach, well known to every Hop- spirit of the movement, interdor- ed Hopkins last week at a confer$2.00<br />\nSubscription<br />\nkins man, addressed the Social -nitory athletics were inaugurated. ence in Washington, called by the<br />\nThe plan was remarkably successScience Club on the subject of<br />\nWar Department in connection<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nful.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n\"The Recent British Political CriThe Committee on Dormitories with the Reserve Officers' Training<br />\nthe<br />\ndeclared<br />\nthat<br />\nDr.<br />\nThach<br />\nsis.\"<br />\nJohn's<br />\nstudents<br />\nof<br />\n-nade<br />\nby<br />\nthe<br />\nuse of the experiences of oth- Corps work. Only the presidents<br />\nto<br />\nJune<br />\nOctober<br />\nfrom<br />\nsemi-weekly<br />\nPublished<br />\nHopkins University.<br />\ncause of the political upheaval ers. They desire that all four classes and commanders of the R. 0. T. C.<br />\nBusiness communications should be addressed to the BUSINESS MAN- just passed was a desire on the be represented in each dormitory, units of a few picked colleges were<br />\nAGER, JOHN HOPKINS UNIVERSITY: all articles and other communications<br />\npart of the British nastion to re- so that the older men can exert an asked to attend. The proceedings<br />\nshould be sent to the MANAGING EDITOR.<br />\ninfluence on the younger, as is the<br />\nturn to party normalcy, that is, to<br />\n100<br />\nHomewood<br />\n.- :ase in the English college.\"Dormi- of the conference have not yet been<br />\nTelephone<br />\nforego the unusual war condition tory spirit\" is to be<br />\nencouraged as divulged, beyond the fact that imparcoalition<br />\nand<br />\nreturn<br />\nto<br />\nof<br />\na<br />\nManager:<br />\nBusiness<br />\nsoon as the second building of the portant R. 0. T. C. problems were<br />\nEditor-in-Chief:<br />\nWILLIAM H. MOORE, JR., '23.<br />\n-Joup of four is completed. Self-. discussed. The conference lasted<br />\nliainentary party government.<br />\nGLOVER P. FALLON, '23.<br />\nManaging Editor:<br />\nDr. Thach began with *an ex- government to a great extent will from Thursday to Saturday, NoAdvertising Manager:<br />\nJ. HUDSON HUFFARD, '23.<br />\nplanation of the recent history of be permitted. The dormitories are vember 16th to 18th, inclusive.<br />\nDONALD K. VANNEMAN,'23.<br />\nto be for the exclusive use of the<br />\nAssistant Managing Editor:<br />\nLast year saw the beginning of<br />\nBritish political parties since beJOSEPH S. LEOPOLD, '24.<br />\noccupants and their guests, and are an engineering<br />\nCirculation Manager:<br />\nbranch of the R. O.<br />\nfore the war and traced their ten- not to serve as rest rooms<br />\nfor all T. C. at Hopkins. At the inspecPHILIP W. HOWARD, '25.<br />\nAssociate Editors:<br />\ndency up to the present day. The the students of the college. FraRIGNAL W. BALDWIN, JR., '23.<br />\ntion held in the spring the engiWILLIAM G. DEAN, JR., '24.<br />\nAssistant Business Managers: two chief parties before the war ternity men are<br />\nexpected to play neers constructed a bridge for the<br />\n'23.<br />\nHEARN,<br />\nBERNARD C.<br />\nJunior Editors:<br />\nwere the Conservatives and Lib- a prominent .part in the develop- approval of the inspectors.<br />\nFITZGERALD DUNNING, '24.<br />\nRANDOLPH NORWOOD, '24.<br />\nD. MILES MARRIAN, '25.<br />\nerals. At the outset of the war ment of student life in the<br />\nT. REESE MARSH, '24.<br />\nThe first work on the trenches<br />\nG. DONALD GIESKE, '25.<br />\nRICHARD C. TILGHMAN, '25.<br />\n\"dorms.\"<br />\nJ. D. SLAUGHTER, '23.<br />\nwas begun Thursday afternoon.<br />\nthe Liberals under Asquith were<br />\nJOHN W. PARSONS, '25.<br />\nJOHN C. LEWIS, JR., '23<br />\nFollowing this discussion of the They will be<br />\nBENJAMIN T. ROME, '25.<br />\ndug on the west side<br />\nJOHN T. DIXON, '24.<br />\nin control. Lloyd George was also theory of the<br />\nsubject by Dr. Bliss, of the woods south of<br />\nthe C. E.<br />\nin the cabinet as chancellor of the Mr. Palmer described the building.<br />\nBuilding, and will be short and of<br />\nexchequer. However, there was a He showed slides of the first and<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\ntype \"A.\" The object will be to<br />\n()Teat deal of dissatisfaction with second story floor plans, of typical<br />\nteach the proper construction of<br />\nAsquith's conduct of the war, es- rooms and suites, and an illustrathis type, and no effort will be<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. pecially in regard to high explo- tion of the completed building. He<br />\nmade to build the trenches from<br />\nsives and shrapnel. All in all, As- showed that Comfort, dignity, beauthe standpoint of layout. The<br />\nquith was not considered the prop- ty, convenience, and homelike aptrench will also be small, to secure<br />\nBALTIMORE, MD., NOVEMBER 21. 1922<br />\ner type of man for carrying on a pearance had been considered in<br />\ngood drainage. Type \"B\" trench<br />\nwar. So, under a general coalition, planning the structure. Some of<br />\nwill probably be built next year.<br />\nLloyd George was swept into the features of the building are: a<br />\nThe R. 0. T. C. is busily engaged<br />\npower. His desertion of Asquith large \"commons\" room, an efficient<br />\nOUTWEIGHED, BUT NOT OUTGAMED<br />\nin preparing for the big parade on<br />\nwas considerably frowned upon service system, fire proof construcDecember 2. While the review be\"'Outweighed, but not outgamed,\" we predicted, and those sentiand<br />\nhe was generally blamed for tion, and a wide selection of types<br />\nments'are ours still. 'We offer no alibi. None is needed. Maryland<br />\nfore President Goodnow was a sucearned the victory that she won last Saturday through a greater of- the breaking up of the Liberal of rooms. The four types of rooms cess, it showed that the men have<br />\nfensive strength, but Hopkins accomplished all, and .more, than that party.<br />\nand the estimated cost of rental for to get more accustomed to marchwas expected of it.<br />\nThus Lloyd George found him- each, not including board, is as foling if they want to make an espeThe student-body in the rooters' section appreciated the fact that self in a peculiar situation. The lows:<br />\ncially impressive showing.<br />\nthat<br />\nwas<br />\nabsolutely<br />\nthe<br />\nbest<br />\ngiving<br />\nwas<br />\nthe Black And Blue eleven<br />\ncause of the ruin of his own par- Single room (bedroom and<br />\nThe R. 0. T. C. was a big help<br />\nin it, and consequently stuck by it to the last, in its defeat-if it may ty, not accepted as leader of the<br />\nstudy bOth)'<br />\n$5.65 to the Athletic Association in hanreally be called such.<br />\nConservatives, he was a man with- Double study and separate<br />\nThose last-minute stands, in the shadow of the goal-posts, ,are<br />\n•<br />\ndling the crowd at the Maryland<br />\nout<br />\na party, supported by a coalibedrooms<br />\n6.60 game. The men will also assist in<br />\nindicative of the spirit that enabled our out-weighed team to stand the<br />\ntion. It was his tremendous suc- Single study and 'single bed\"gaff.\"<br />\nmanaging the crowd at the St.<br />\nThere is great consolation in the fact, however, that this game did cess in carrying on the war that room<br />\n8.30 John's game.<br />\nnot close the schedule. The chances, in the two games remaining, are gave him a very large personal Study, bedroom and private<br />\nAt present, the freshmen• are<br />\nabout.even and with the brand of fight exhibited Saturday continued. following. After his great victory<br />\nbath<br />\n10.00<br />\nlearning<br />\nhow to use the rifle.. This<br />\nmost<br />\nsuccessfully.<br />\nthe season should close<br />\nno one wished to be the first in a<br />\nFood will be supplied at cost.<br />\nis<br />\nslight<br />\ndeviation from the work<br />\na<br />\nAll guns on St. John's!<br />\nmovement to overthrow him. The building will cost $500,000<br />\nbut Major Garey<br />\nTherefore, he was able to main- complete, of which $270,000 was in the text-book,<br />\nget<br />\nthe<br />\nmen interested<br />\ntain his power for an unusually given by the Alumni. The balance is anxious to<br />\nTHE RUSHING AGREEMENT<br />\nteam..<br />\nin the rifle<br />\nAccording to the<br />\nlong time. That is why the 1918 is furnished by the Board of TrusMajor, there are some splendid<br />\nThe fact has been brought to the attention of the Interfraternity elections returned him to power, tees<br />\nform the endowment fund, with shots among the new men, but they<br />\nBoard that there have been violations of the Rushing Agreement by despite the fact that his platform the<br />\nstipulation that the return have to be developed.<br />\nsome of the newer fraternities upon the campus. Whether these in- of \"hank the Kaiser and make<br />\nfrom the investment should be the<br />\nfractions were the result of ignorance of the law or wilful neglect is Germany pay\" was ridiculous.<br />\nsame as that which could be obtainnot known. The Board, however, requests that the NEWS-LETTER call<br />\nHowever, the post-war condi- ed ordinarily. Mr. Palmer's estiattention through the editorial column to the importance of a thorough tions were different. Diplomatic<br />\nmates, therefore, are based on the<br />\nunderstanding of the regulations on the parts of both the fraternities failures and civil discord in- total<br />\namount supplied by the uniand the freshmen.<br />\ncreased opposition to Lloyd versity, and the amount needed to<br />\nIt is the duty of the latter to acquaint themselves with the frater- George, and precipitated his col- furnish an<br />\nadequate return on the<br />\nnity situation and the rules governing it. No matter how modest the lapse. His personal following endowment money.<br />\nfreshman may be, he should be prepared to obey those sections of the turned out to be very small and<br />\nVannernan announced that Hutzagreement concerning him.<br />\nthe results of the election placed ler would make arrangements for<br />\nThe most glaring \"don't\" upon the list is that of Section 2, Article him and his supporters fourth and all those who wish to<br />\ndrive autoI, which prohibits treating or entertaining a freshman by a fraternity last of the great British .parties. mobiles in the St.<br />\nJohn's ,game paman or the entering of a fraternity house by a first-year man before<br />\nThe effect of other various con- rade. He asked for support of the<br />\nDecember.13. The meaning of this section is clarified by a later ruling ditions brought the Labor party plans for the<br />\nHow Much Time<br />\ncelebration of the asof the Board which permits \"Dutch treat\" parties, not in the home of into prominence until now it is sault<br />\nand battery upon Maryland Do You Waste?<br />\na fraternity man. It also forbids the entertainment of a fraternity man the opposition party in Parlia- State. The<br />\nremaining time of a Sharpening wood penby a freshman.<br />\nment. This group now includes long assembly was devoted to \"pep- cils means loss of time<br />\nPrevious to the rushing season, fraternities may be freely discussed many old Conservatives also. ping<br />\nand effort.<br />\nup\" for the State game.<br />\nbetween the men, but no fraternity is permitted to bid (invite to join a<br />\nBonar Law's new administrafraternity), or intimate that they will bid, any first-year man. Bids tion probably will not make any<br />\nFRATERNITY NOTICE<br />\nare not permited until eight o'clock Wednesday morning, December 13. great changes in policy. The old<br />\nVarious methods are frequently resorted to to get around the regula- program will be continued in all<br />\nThe Sigma Tau Delta Fraternity<br />\ntions, the favorite channel being the girl route.<br />\nessential details. The one signifi- of Johns Hopkins University Ends all pencil sharpenDiscussing other fraternities is not illegal, but is merely a matter cant fact is that..the change -has<br />\nwishes to announce that they are ing- of taste. Actual \"panning\" of a fraternity directly or indirectly by an- brought about a change of party<br />\nCosts less to use than<br />\nmoving into their new location at wood<br />\nother fraternity is also a matter of taste.<br />\nmanagement rather than party<br />\npencils.<br />\nThe importance of a serious study of fraternity affairs by the new policy. With normalcy the key- 2905 St. Paul street. The frater- Uses double length leads,<br />\neach equal to a seven inch<br />\nmen on the campus cannot be emphasized too strongly. Fraternities word, the parties have returned nity also wishes to call to the at- wood pencil in writing<br />\nplay, probably, a greater part in the development of the college man to their former status and the tention of the student body the service. Guaranteed not to<br />\nclog at the point.<br />\nduring his four years than any other single element. Like marriage, it coalition has been dissolved.<br />\nfact that its name was, through The FEATHERWEIGHTis a permanent affair and may either make or break a man.<br />\nAfter Dr. Thach's very interhere-oflight weight<br />\nerror, omitted from the Hand- shown<br />\nAluminum 50c. Rolled<br />\nThe Rushing Agreement is printed in its entirety in the \"Y\" hand- esting talk there was an informal<br />\nSilver, $1.00.<br />\nbook, beginning page 25. The special rulings were published in the discussion of various subjects<br />\nSee this and the other Ingersoll models at your stationbrought up in the course of the<br />\nlast issue of the NEWS-LETTER.<br />\nery or co-operative store.<br />\naddress. It was announced that near future. After the return of<br />\nIngersoll<br />\nReillpoInt Co., Inc.<br />\na speaker of international promi- Dr. Lovejoy, about the first of the<br />\nWm.H.Ingersoll, Pres.<br />\nThe NEWS-LETTER takes pleasure in announcing the election of nence is being sought for a large year, other open meetings will be 461 Fourth Ave,New York City<br />\nopen meeting to be held in the held.<br />\nJohn T. Dixon, '24, to the position of Assistant Business Manager.<br />\n<br />\nThe Johns<br />\n<br />\nHopkins News-Letter<br />\n<br />\nIngersoll<br />\nRa4--tiP cii<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 21, 1922.<br />\n<br />\ntnd<br />\n'nt'erthe<br />\nion<br />\ning<br />\nnts<br />\n<br />\nC.<br />\nere<br />\nigs<br />\n!en<br />\nm!re<br />\n:ed<br />\nToof<br />\n<br />\na<br />\n<br />\ng-ihe<br />\n<br />\nLes<br />\n)n.<br />\nde<br />\nE.<br />\nof<br />\nto<br />\nof<br />\nbe<br />\n<br />\nhe<br />\nre<br />\nch<br />\n<br />\n1)<br />\n1<br />\n<br />\n11-<br />\n<br />\n1(1<br />\ntd<br />\nin<br />\n;t.<br />\n<br />\nNORTHWESTERN TEAM<br />\nASSOCIATION OF UNIVERSI- PLEDGE TO BE ASKED OF<br />\nINSURED<br />\nTHOSE ATTENDING FIRST<br />\nTY PROFESSORS MEETS<br />\nNorthwestern footentire<br />\nThe<br />\nCOTILLON<br />\nDr. Vincent Elected President<br />\ninsured against<br />\nbeen<br />\nhas<br />\nteam<br />\nball<br />\nCarvil Gardner, president of the<br />\nAt the autumn meeting of the<br />\ninjury by a blanket policy, Dan<br />\nlocal chapter of the American As- Cotillon Club, has made an an M.Evans, director of athletics, ansociation of University Professors nouncement to the student body in nounced Tuesday. Terms of the<br />\nwhich consists of nine Goucher reference to the first cotillon, to be policy, assure the University a<br />\nProfessors and 58 Hopkins pro- held at the Maryland Casualty fixed sum for every player infessors, John M. Vincent was Club House on December 8th. jured or taken ill during the footEvery man attending this affair ball season. They also provide a<br />\nelected president for this coming<br />\nwill be asked to pledge that he will 50 per cent. additional sum for<br />\nyear, and John C. French, secre- not take a drink after noon on the<br />\nevery player sent to the hospital.<br />\ntary. They succeed the retiring of- day of the dance. This system has Compensations already have been<br />\nficers, James W. Bright, presi- been introduced in other universi- received for five broken noses.<br />\ndent, and L. S. Hulburt, secretary. ties throughout the country, and<br />\n—The Cadet<br />\nthe<br />\nin<br />\nbeen<br />\nraising<br />\nsuccessful<br />\nhas<br />\nThis association has much inrepute of the dances in the various<br />\nfluence among the colleges and<br />\nServices Of<br />\nlocalitiies. John Sherwood, presi- Lacrosse Team Loses<br />\nuniversities throughout the Coun- dent<br />\nCoach<br />\nof the Student Council, ha-;<br />\nContinued from page 1.<br />\ntry. Its membership consists of assured the undergraduates that all<br />\nare out for the team:<br />\ntwelve<br />\nover four thousand college profes- the activities are behind the CotilBachman, Benedict,<br />\nZoller,<br />\nsors. All of these. men have had lon Club in the exacting of this<br />\nCapt. Murphy, RoutMcDaniel,<br />\nat least five year' experience in pledge.<br />\nCoady, Cromwell,<br />\nTurnbull,<br />\nson,<br />\ncollegiate instruction.<br />\nAnyone wishing a ticket for the Huey and Landy.<br />\nAmong the various subjects dis- first cotillon is asked to see GardManager 0. D. Collins especialcussed at the meeting was one ner immediately, as the supply is<br />\nrequests that those men who<br />\nly<br />\nwhich might be of particular in- limited.<br />\nout for fall lacrosse report<br />\nare<br />\nterest to the undergraduate stuearlier in the afternoon. On acdents.<br />\nProf. (in class)—Order! Order! count of early darkness little<br />\nThe local chapter in its report<br />\nStudent<br />\n(just awakening)—Ham work can be done if the men are<br />\nto the central association will inlate.<br />\nclude a plan by which, if it is and eggs.—The Lawrentian.<br />\nadopted by the association, an undergraduate who, in pursuing his<br />\nOWENS & HECKLINGER<br />\nregular studies, comes upon a<br />\nTAILORS<br />\nspecial topic in any course of<br />\nMAKERS OF COLLEGE CLOTHES<br />\nwhich he wishes to make a more<br />\nBALTIMORE, MD.<br />\n18 ST. PAUL ST.<br />\nthorough study, may do so. This<br />\nprivilege will be granted only<br />\nunder the condition that the student is well up in his studies and<br />\nis able to give this subject additional time without affecting his<br />\nregular work. For instance, it<br />\nwas suggested that one might<br />\nwish to make an extensive investigation of some special period of<br />\nhistory to which the course does<br />\nnot pay special attention. He may<br />\nOf heavy Scotch Grain Leather; black or<br />\ndo this extra work and take an<br />\nexamination on it. If he succeeds<br />\ntan; equipped with rubber heel: a colin passing he will receive one<br />\nlege shoe designed for real college men.<br />\ncredit toward graduation. This<br />\nspecal work as a rule will not cover over one semester.,During the<br />\nsecond semester the sttident may<br />\nstudy another topic and receive<br />\nanother credit. By this plan a man<br />\nAT CHARLES STREET<br />\nmay gain additional credits which<br />\nwill be of great assistance to him<br />\n216 NORTH<br />\nif he desires to complete his course<br />\nat the University in three years.<br />\n<br />\nA Hopkins<br />\nBroq ue $8<br />\n<br />\nSlesingers<br />\n<br />\nThe \"COLLEGIAN ,'<br />\nThe hat for the \"College Man\" who<br />\nc•-\"--% .<br />\ncreates his own style<br />\nWARNER Si, COMPANY<br />\n<br />\n'4up<br />\n<br />\n-5°<br />\n<br />\nHATTERS<br />\n222 W. BALTIMORE ST.<br />\n<br />\nONE is the -Rah Rah- hat and the Bulldog shoe.<br />\nCollege style today smacks of the same sober,<br />\nsensible style of the business world.<br />\nStein-Bloch and Goodman & Suss Clothes, tailored<br />\nin Rochester, exemplify that idea so well.<br />\nExclusively at—<br />\n<br />\nG<br />\n<br />\na-Jac/4<br />\n<br />\nY4ciori-<br />\n<br />\n(Y. M. B. 0. D.)<br />\nBaltimore & Hanover<br />\n<br />\n•<br />\n<br />\nCorrect Furnishings for<br />\nthe College Man<br />\nHUTZLER 131WIEM e<br />\n<br />\nThe Johns Hopkins University<br />\n<br />\nFORTY-SEVENTH YEAR OF INSTRUCTION 1922-1923<br />\n<br />\nINSTRUCTION<br />\nGRADUATE SCHOOL OF ARTS AND SCIENCES.<br />\nArts; Doctor of Philosophy.<br />\n<br />\nDegrees: Master of<br />\n<br />\nMEDICAL SCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nCOLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nENGINEERING. Degrees: Doctor of Engineering; MasOF<br />\nSCHOOL<br />\nter of Engineering; Bachelor of Engineering; Bachelor of Science in<br />\nChemistry.<br />\nSCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Public Health; Doctor of Science and Bachelor of Science in Hygiene; Certificate in Public Health.<br />\nSCHOOL OF BUSINESS ECONOMICS. Bachelor's Degree.<br />\nCOLLEGE COURSES FOR TEACHERS. Degree: Bachelor of Science.<br />\n<br />\nCIGARETTES<br />\n<br />\nSUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of<br />\nArts or of Science.<br />\nCOURSES IN SOCIAL ECONOMICS.<br />\nEVENING COURSES in Business Economics and for Technical Workers.<br />\n<br />\nJOHN HOPKINS PRESS PUBLICATIONS.<br />\n<br />\nnow<br />\n<br />\nBUILDINGS<br />\nGILMAN HALL—general library, class rooms, biology, administration.<br />\nMECHANICAL AND ELECTRICAL ENGINEERING—housing also Physics<br />\nand College Chemistry.<br />\nCIVIL ENGINEERING—housing also Geology.<br />\n<br />\nfor TWENTY<br />\n<br />\nPOWER HOUSE.<br />\nBOTANY AND PLANT PHYSIOLOGY—with Greenhouses and Botanical<br />\nGarden.<br />\n<br />\nand after all, what<br />\nother cigarette is so<br />\nhighly respected by<br />\nso many men?<br />\n<br />\nCHEMICAL LABORATORY—for graduate work.<br />\nPHYSIOLOGICAL BUILDING.<br />\nANATOMICAL LABORATORY.<br />\nHUNTERIAN LABORATORIES.<br />\nPATHOLOGICAL LABORATORY.<br />\nSCHOOL OF HYGIENE.<br />\nCARROLL MANSION—Johns Hopkins Club.<br />\nSTUDENT ACTIVITIES BUILDING.<br />\n<br />\nLet Fatima smokers<br />\ntell you<br />\n<br />\nALUMNI MEMORIAL DORMITORY.<br />\nLIGGETT & MYERS TOBACCO CO.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 21, 1922.<br />\n<br />\nANNOUNCEMENTS AT<br />\nFRESHMEN HOLD FOOTBALL<br />\nORGANIZATION MEETING<br />\nHOMEWOOD<br />\nThe Freshman class held its<br />\nWilliam N. McFaul, Jr., Class of<br />\ntie cffiettiraItzutbarb Pooh (girfootball organization meeting on '24, has been appointed foreign<br />\nHoliday Books<br />\nThursday, November 16, in 110 secretary for the students' branch<br />\nBeautiful Illustrated Gift Editions, C. E. Manager Keller called the<br />\nof the Young Men's Christian AsBiography, Travel, Fiction.<br />\nmeeting<br />\nwere<br />\ncandidates<br />\nand<br />\n18<br />\nsociation<br />\nat Hopkins.<br />\nChildren's Books<br />\nThe duties of Mr. McFaul's ofFountain Pens and Silver Pencils, present.<br />\nKeller explained the present sit- fice, which is a new one just estabMedical Books of All Publishers<br />\nuation to the men. The Sopho- lished at the university, will center<br />\nat<br />\nmores have organized a football primarily in the organization of<br />\n301 N. Charles St.<br />\nteam and are ready to play the foreign students at the university.<br />\nFreshmen some time in Decem- Since the dissolution of the Cosber. By order of Dr. Abercrombie mopolitan Club for foreign students<br />\nMANUFACTURING JEWELERS<br />\nthe members comprising the two two years ago, the association has<br />\nLancaster, Pa.<br />\nteams must have practiced for at been working upon a plan to pro-Class Rings, Pins, Fraternity Pins,<br />\nleast one month in some branch mote the interests of foreign stuCups, Medals, Etc.<br />\nStationery, Invitations, Programmes of athletic activity before the dents at Hopkins, and to help them<br />\n\"Makers of the Varsity Seals\"<br />\ngame can be played. Accordingly, become assimilated in the life of<br />\npractice was started immediately, the American college. The result<br />\nSTRATTON SHIRT MAKER<br />\n226 N. Liberty St.<br />\nthe first workout being held on was the establishment of Mr. Mc$3.00, $3.50 and $4.00 Friday afternoon on the lower<br />\nDress Shirts<br />\nFaul's office.<br />\n$3.25 and $4.25<br />\nNegligee<br />\n$5.25 and $6.25 field. Hereafter they will be held<br />\nImported Madras<br />\nThe Publicity Board has arTerms Cash, Less 10% 30 Days on regularly two or three times a<br />\nto send out to all of tilt:<br />\nranged<br />\nShirts<br />\nweek.<br />\nAlso a Full Line of Men's<br />\nprep schools this week copies of the<br />\nFurnishings<br />\nThe circumstances under which reply made to the article in the St.<br />\nthese men will have to train are John's Collegian, entitled \"The<br />\nFine Clothes<br />\nunfortunate. There are no foot- Hopkins Spirit.\" It was decided<br />\nA suit by Lemmert gives the final ball togs or shoes available about that the prep schools should know<br />\ntouch to the lasting satisfaction you the campus, all old clothes, headof the Hopkins attitude towards<br />\nderive from thoroly dependable<br />\ngears,<br />\netc.,<br />\nhaving<br />\nbeen<br />\ndisposed<br />\nthe matter.<br />\ncloths cut in authentic fashion—<br />\nwhether for every-day wear or more of a short time ago. As a result,<br />\nThe board is carrying on its goosl<br />\nfestive occasions.<br />\nthe candidates will be forced to work of distributing posters anpractice in togs or outfits fur- nouncing each game, of giving the<br />\nLEM MERT -r) at<br />\nnished by themselves.<br />\nresults of the various athletic con19 Fayette Street, East<br />\ntests, and making announcements<br />\nBusiness Suits<br />\nDress Clothes<br />\nDATE OF PUBLICATION OF NEXT of future games over the wireless<br />\nOvercoats<br />\nSport Togs<br />\n\"BLACK AND BLUE JAY\"<br />\nfrom the News' station, W-E-A-R.<br />\n<br />\nBANK WITH<br />\n<br />\nTHE BOOK MART<br />\n<br />\nSecurity Storage & Trust Co.<br />\nNORTH AVENUE at CHARLES STREET<br />\nASSETS OVER ONE MILLION DOLLARS<br />\nSAVINGS OR CHECKING ACCOUNTS<br />\nAS YOU WISH<br />\nHENRY S. KING, President<br />\n<br />\nJ. F. Apple Co.<br />\n<br />\nPOSTPONED<br />\n<br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br />\n<br />\nHOCHSCHILD,KOHN gc Co.<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nJ<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\n1.<br />\n<br />\nWinning More Friends<br />\nEvery Day Because They Know<br />\n<br />\nThe next issue of the Black and AUTHOR OF \"VERITAS VOS<br />\nBlue Jay, the \"Rushing Number,\"<br />\nLIBERABIT\" APPOINTED<br />\nwill not appear on December 1st, as<br />\nCHANCELLOR<br />\nit was previously announced. The<br />\n421 N. HOWARD ST.<br />\nRev. William Levering Devpaper's advertisers would like to<br />\nIs the One Perfect Motor Fuel.<br />\nHOSIERY<br />\nGLOVES<br />\nries, a native of Baltimore, who<br />\nzet some Christmas advertising in<br />\nAre You Satisfied?<br />\nwas graduated in 1888 as a bachone of the issues, but it would be<br />\nSHERWOOD BROTHERS, Lic.<br />\nelor of arts and in 1892 as a docEstablished 1873<br />\nimpossible to publish two numbers<br />\ntor of philosophy, and later purA.H.Fetting Man'fg Jewelry Co. before Christmas. Therefore, the sued his studies in the General<br />\nsecond issue will be out on DecemManufacturers<br />\nTheological Seminary, New York,<br />\nber 15th to accommodate the adverGreek Letter Fraternity Jewelry<br />\ngraduating in 1894, has recently<br />\n213 N. LIBERTY ST., Baltimore, Md. tisers.<br />\nbeen appointed chancellor of the<br />\nThe number already gives promMEN'S SHOES<br />\nProtestant Episcopal Cathedral of<br />\nise of being the best Black and Blue<br />\nOf the Better Class<br />\nSt. Alban, Washington,, D. C. Dr.<br />\nes-gt<br />\nJay published thus far. Many drawDevries had been for some years<br />\nings and literary contributions have<br />\na residentiary canon at St. Albeen received. The postponement<br />\nban's. His name is especially faof<br />\nthe date of issue makes it pos.0*<br />\nmiliar to alumni and students as<br />\nURNER BROTHERS<br />\nsible to carry the work still further.<br />\nthat of the author of the Univer111 E. BALTIMORE STREET<br />\nUndergraduates in general, and<br />\ny<br />\nBALTIMORE<br />\nie<br />\n/Catter<br />\n..<br />\n°Ike:<br />\nsity Ode entitled \"Veritas Vos<br />\nparticularly<br />\nengaged<br />\nwho<br />\nare<br />\nthose<br />\n5\\1G•1-OSCAR<br />\ntjA -- H.&<br />\nLiberabit.\"<br />\nin competition for positions on the<br />\nOWNERS<br />\ngame against such overwhelming<br />\nstaff, are urged to contribute to the<br />\n\"\"l'or.4<br />\nI'61b0<br />\nodds.<br />\nRIFLE<br />\nTEAM<br />\nMATCHES<br />\n29 Baltimore St., East<br />\nmagazine. Jokes on college fratcrOne Door West of LigIlt St.<br />\nFor Maryland, McQuade, who<br />\nARRANGED<br />\nnity life are preferred. All copy<br />\nSOLE AGENTS FOR BALTIMORE<br />\ndid<br />\nthe bulk of the work of his<br />\nPractice is now being held for<br />\nmust be submitted on or before NoFor College Fraternity Bands<br />\nplunging<br />\nand Groves who punted<br />\nthe Rifle Team. Manager Parks is<br />\n(Greek Letter Societies)<br />\nvember 13th.<br />\nand<br />\nwell<br />\nwhose dropkick spelled<br />\narranging a very attractive schedvictory<br />\nfor<br />\nthe : College Parkers,<br />\nA. S. M. E. ATTENDS MOVIES ule, matches having already been<br />\nSemler, who in past<br />\nshowed<br />\nwell.<br />\nschdeuled with Princeton, GeorgeA large number of the MechanPrinters of Philological and<br />\nyears<br />\na thorn in the side<br />\nhad<br />\nbeen<br />\ntown, Boston Tech and Syracuse.<br />\nical Engineering students, and also<br />\nScientific Works<br />\nand<br />\nBlue, was well<br />\nBlack<br />\nthe<br />\nof<br />\nIn the R. 0. T. C., Major Garey<br />\nsome Electrical Engineers, attend- is deviating from the work in the covered and with the exception<br />\n23 S. HANOVER ST.<br />\nLaltimore, Md.<br />\ned the movies recently given in the text-book and is showing the fresh- of one long run, didn't lOok so<br />\nCivil Engineering Hall. The pic- men how to shoot a rifle. By get- good.<br />\nBetween the halves \"toreador\"<br />\ntures showed in minute detail ting the new men interested in this<br />\nSARATOGA AT<br />\nBill Meyers, accompanied by a<br />\nmanner,<br />\ntalent<br />\nlatent<br />\nis<br />\nunearthed<br />\nevery step involved in the manuLIBERTY STS.<br />\nin men who never had any idea that galaxy of \"matadors\", \"picadors\"<br />\nfacture of the Cadillac motor. The<br />\nand \"cuspidors\", showed that his<br />\nthey were able to shoot.<br />\nLUNCHEON<br />\nfotir reels were very interesting<br />\ndeadly<br />\nline was still with him<br />\nTEA<br />\nfrom an engineering standpoint,<br />\nwhen<br />\nhe<br />\nsuccessfully slew the<br />\nBLACK AND BLUE HOLD U. OF M.<br />\nDINNER<br />\n\"bull.\"<br />\nand the American Society of MeTO LONE FIELD GOAL<br />\nSPECIAL PARTIES<br />\nThe lineup and summary:<br />\nContinuf,d from page 1<br />\nchanical Engineers, under whose<br />\n11.30 A. M.<br />\nthan four times inside the 10Score by periods:<br />\nauspices the pictures were shown,<br />\nuntil<br />\nMaryland<br />\nyard line did the Hopkins men Hopkins<br />\nMiddleton .....L.T...... . Nisbet<br />\nPLAZA 6987 are very much indebted to the Cad7.30 P. M.<br />\nhold Maryland for downs.<br />\nMagill<br />\nL E<br />\nYoung<br />\nillac people who loaned the films.<br />\nBromley<br />\nL G<br />\nThere was glory enough for al: Slow ik<br />\nCromwell . ..0<br />\nBailey<br />\nIt is hoped that other interesting in the battle and although no in- Walbert<br />\nR G<br />\nHough<br />\npictures can be secured on other dividual stars shone forh, Cap Landy (c).<br />\nR.T........ Burger<br />\nBranner<br />\nR E<br />\nRich<br />\nMt. Vernon 4999<br />\nmechanical work later on.<br />\ntam n Landy, outweighed at least Bonner<br />\nQ B<br />\nG-oves<br />\nL H<br />\nPugh<br />\n50 pounds, by the giant Nesbit. Taylor<br />\nRH<br />\nSemler<br />\nClass Dues Discussed at Senior showed a wonderful game in more Coady<br />\nTurnbull .. .F.B.<br />\nMcQuade<br />\nMeeting<br />\nthan holding his own with the Maryland<br />\nHopkins<br />\n.0 0 0 0-0<br />\nCommercial Photography<br />\nContinued from page 1<br />\nhuman tank. Middleton and<br />\nDropkick—Groves. Substitufons:<br />\nCircuit Photography<br />\nA motion was proposed and adopt- Schact, the ends, broke up play Hopkins—Schact for Middleton, MidSHIRTS<br />\n<br />\nNECKWEAR<br />\n<br />\n3<br />\n<br />\nDRAPERIES<br />\n<br />\nLefranc & Ault<br />\n<br />\n1<br />\n<br />\nYELLOW<br />\nCAB CO.<br />\n<br />\n1<br />\n<br />\nPHONE, VERNON 1212<br />\n<br />\nURNER'S<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nW.L. Mann<br />\n<br />\nFlash Lights<br />\nGroups<br />\n<br />\nViews ed that $5 per month would be col- after play, but as previously said,<br />\nEnlargements lected from each member until the there were no outstanding stars.<br />\nfirst of next year. A sample class It was the old one-for-all and allKODAK FINISHING<br />\npillow, which has lately been de- for-one spirit which enabled<br />\n325 N. Howard St.<br />\nsigned, was shown to the members. Hopkins to put up such a. brilliant<br />\n<br />\nd'eton for Schact, Schact for Coady<br />\n(Rich going to half and Schact to end).<br />\nMa ryland—Guervich for Groves, Bosley for Semler. Referee—Dwyer, Notre<br />\nDame. Umpire—Clinton, Yale. Field<br />\njudge—Farrier, Dartmouth. Head linesman—Collins, Dartmouth. Time of<br />\nquarters-15 minutes.<br />\n<br />\nThe Yellow Cab<br />\n<br />\n1:<br />\n<br />\nis not merely a trade name<br />\nfor a seivice, but is also the<br />\ndesignation of a certain type<br />\nof cab.<br />\n<br />\nStandardization<br />\nOf Our<br />\nEquipment<br />\nhas made it possible for us<br />\nto offer you the most mod-<br />\n<br />\nern Taxicab service in the<br />\ncountry at the following low<br />\nrates:<br />\n<br />\n1<br />\n<br />\n30c FIRST 1-3 MILE<br />\n10c Each Additional 1-3<br />\nMile or Fraction Thereof<br />\n<br />\n1<br />\n<br />\n20c for Each Additional<br />\nPassenger<br />\n<br />\nOver One for the Entire<br />\nTrip<br />\nShown on the Taximeter<br />\nUnder EXTRAS<br />\n<br />\n2<br />\n1<br />\n<br />\n1<br />\nMain Office and Garage<br />\n1123-1125-1127-1129<br />\nCATHEDRAL STREET<br />\n<br />\n1<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVII. No. 15<br /><br />\nPRICE 5 CENTS<br /><br />\nBALTIMORE, MD., NOVEMBER 21, 1922<br /><br />\n\"CASTLES IN THE AIR\" PRE- MANDOLIN CLUBS AND OR- CLOWNS AND BALLET TO BE<br />\nFEATURE OF ST. JOHN'S<br />\nCHESTRA REMAIN SEPSENTED AS BRICK DORMIARATE ORGANIZATIONS<br />\nGAME FESTIVITIES<br />\nTORIES AT THURSDAY<br />\nASSEMBLY<br />\nDirector for Mandolin Clubs Not Arrangement Being Perfected by<br />\nChairman Bill Myers. MamDr. 1.2.1.4s. and. Mr. Palmer Deliver Yet Decided Upon. Glee Club<br />\nmoth Parade Saturday<br />\nHolds<br />\nRehearsal<br />\nIrteresting Speeches on the<br />\n• Morning<br />\nDormitories Before Students<br />\nAfter a great deal of discussion<br />\nGroves' Toe Decides Hard-fought Contest. Hopkins Holds Four<br />\nA host of clowns, an exhibition<br />\nDr. Bliss, of the Committee on and indecision it has been finally<br />\nTimes on Fifteen-yard Line. Taylor Makes Long Run<br />\nDormitories, and Mr. Edward H. decided to conduct the Mandolin. of tight-rope walking, and a balBeef and the unerring toe of one Groves counted for victory last<br />\nPalmer, architect, presented many Club and the Orchestra as separate let, will be among the features prewhen, in one of the greatest battles ever staged on HomeSaturday<br />\norganizations.<br />\nthe<br />\nhalves<br />\nThis<br />\ndecision<br />\nsented<br />\nbetween<br />\nof<br />\nthe<br />\nSt.<br />\nhas<br />\ntheories<br />\nabout<br />\ninteresting- facts and<br />\nthe Johns Hopkins dormitories, one been hanging fire since the first of John's game on Saturday. Under wood Field, Maryland downed Hopkins by a score of 3 to 0.<br />\nOutweighed, but never outgamed, the Black and Blue gridders<br />\nof which is now in progress of con- the year, as there have been a great the capable directorship of William<br />\nmany<br />\nthe<br />\npersonnel<br />\nmembers<br />\nof<br />\nclub<br />\nin<br />\nfaMyers,<br />\nthe<br />\nand<br />\ndeO.<br />\ngiving an eye for an eye and a tooth for a tooth, fought and sweated<br />\nstruction. Dr. Bliss related the<br />\nvor<br />\nof<br />\ncombining<br />\nthe<br />\nMandolin<br />\nstunts<br />\nare<br />\nrounding<br />\ninto<br />\ntails<br />\nof<br />\nthe<br />\nPrinciples which had guided the<br />\nand no doubt swore to a certain extent, until in the closing minutes<br />\nClub<br />\nand<br />\nthe<br />\nOrchestra.<br />\nBoth<br />\nmethform.<br />\nof the final quarter, the overflowing stands were in a frenzy when<br />\ncommittee in planning the structrial,<br />\nand<br />\nture, and Mr. Palmer gave an inter- ods have been given a<br />\nA mammoth parade, including it seemed that the Hopkins men were about to tie or even better the<br />\nesting description of the building the leaders have decided that the the entire undergraduate body, three counters which were on the righ side of Maryland's ledger.<br />\nToward the close of the final<br />\nitself, and discussed the possible former method, the one that has alumni, band and floats will open<br />\nbeen in Use in former years, will the day's festivities. The proces- LACROSSE TEAM LOSES quarter, after having intercepted<br />\ncharges for rentals.<br />\na forward pass by Groves, WalkSERVICES OF COACH<br />\nsion will form at the City Hall<br />\nAt the time the Committee on be continued this year.<br />\nIt<br />\nhas<br />\nbeen<br />\ndefinitely<br />\nnot<br />\nyet<br />\ndeer Taylor advanced the ball 40<br />\nKNIPP<br />\nJOHNNY<br />\nPlaza<br />\nand<br />\nwill<br />\nmove<br />\nup<br />\nFayette<br />\nStudent Activities at Homewood<br />\nthe<br />\nto<br />\nwho<br />\nwill<br />\nconduct<br />\ncided<br />\nas<br />\nCathedral,<br />\nto<br />\nStreet<br />\nto<br />\nLiberty,<br />\nto<br />\nwas created, in 1910, -there was<br />\nFormer Star Forced to Relinquish yards, giving a wonderful exhiMacaulev,<br />\nof<br />\nMandolin<br />\nClub.<br />\nMr.<br />\nbition of broken field running and<br />\nHomewood.<br />\nMt. Royal, and then to<br />\nDuties. Changes Announced<br />\nmuch dissatisfaction with existing<br />\non<br />\nlessons<br />\nBaltimore,<br />\nwho<br />\ngives<br />\nusing all the tricks of dodging,<br />\nin Tentative Schedule<br />\nconditions of dormitory life in<br />\nLeading the parade will be the<br />\nwith<br />\nthe<br />\nmandolin<br />\nand<br />\nbanjo,<br />\nwas<br />\ntwisting,<br />\nside-stepping and stiff<br />\nAmerican colleges, began Dr. Bliss.<br />\nundergraduate band, which will<br />\nJohnny Knipp, who for the past<br />\nthe<br />\nclub<br />\nat<br />\nits<br />\nrehearsal<br />\nlast<br />\nnight,<br />\narming<br />\nat<br />\nhis command before he<br />\nThe system did not compare at all<br />\nprecede the upper-classmen, carry- two years has coached the laMonday,<br />\nNovember<br />\n20.<br />\nMr.<br />\nMacwas<br />\nforcedout of bounds. With<br />\nfavorably with that in use in Enging an enormous banner with the<br />\ncrosse team, will be unable to fill the goal line in sight, the Hopmusician,<br />\nauley<br />\nwell-known<br />\nis<br />\na<br />\nland; the home idea was lacking.<br />\ninscription, \"We Are Going to<br />\nthat position this year, according kins backs could not make ati.Sr<br />\nThe English college, on the whole, having played the banjo in various Beat St. John's.\"<br />\nfor<br />\ndance<br />\ncity<br />\norchestras<br />\nin,<br />\nthe<br />\nto information received by 0. D. impression on the Maryland line.<br />\nis better situated for the developThe freshmen will follow in line,<br />\nMusical<br />\nsome<br />\nyears.<br />\nThe<br />\nClub<br />\nis<br />\n\"Bonner called on Turnbull for<br />\nment of an excellent system of stueach man carrying a placard with Collins, Jr., manager of the latrying<br />\nto<br />\narrange<br />\nto<br />\nhave<br />\nhim<br />\nlead<br />\na<br />\nplacement kick from the 40dent living accommodations. In<br />\nan appropriate slogan. Various crosse team. Several prominent<br />\nMandolin<br />\nClub<br />\nthis<br />\nseason.<br />\nyard<br />\nline. The stands fairly<br />\nthe<br />\nconsidered<br />\nas<br />\nEngland, a college is<br />\nstunts will bring -up the -rear. Ac- men are in view at present, all of<br />\nhard<br />\nworking<br />\nThe<br />\nis<br />\ncracked<br />\nfrom the nervous strain.<br />\nGlee<br />\nClub<br />\na place where men live and are incording to authorities, there will whom are thoroughly competent<br />\nProfessor<br />\ndirection<br />\nof<br />\nunder<br />\nthe<br />\nIt<br />\nseemed<br />\nan age before the turf<br />\nstructed. American colleges are<br />\nbe no less than twenty beautiful<br />\nproduce a successful team. The was patted down to perfection and<br />\nto<br />\nof<br />\nin<br />\ndire<br />\nneed<br />\nis<br />\nBouchau,<br />\nbut<br />\nfounded in isolated districts, widechorus girls attired in up-to-date<br />\nly scattered, and thus have room first tenors. John Sherwood, pres- fashions. It is rumored that there name of the man selected will a satisfactory tee moulded. The<br />\nfor expansion. The English col- ident of the club, requests that all will be several Parisienne dancers probably be announced in the near spectators were by this time as<br />\nsing, or even think<br />\nnearly wild as sane people can be,<br />\nleges group themselves about an im- those who can<br />\nfuture.<br />\nin line.<br />\ntenor,<br />\ncome<br />\nout<br />\nthey<br />\ncan<br />\nsing,<br />\nfirst<br />\nfor<br />\nthey felt that the outcome of<br />\nportant center, and, as the space<br />\nArrangements have been made<br />\nThe tentative schedule for larehearsal<br />\non<br />\nthis<br />\none play would be responsiClub<br />\nto<br />\nthe<br />\nGlee<br />\nis limited, they can grow only to<br />\nfor an elaborate float, which will crosse announced same time ago<br />\nble<br />\nfor<br />\nthe final outcome of the<br />\nnight.<br />\nl'hursday<br />\na certain definite size. About a<br />\ndepict a king, representing Hop- has undergone several changes.<br />\ngame.<br />\nThe<br />\nball was snapped back,<br />\nyet<br />\nQuartet<br />\nhas<br />\nnot<br />\nThe Varsity<br />\nscore of colleges each constitute the<br />\nkins as State champions, standing<br />\nlines<br />\nthe<br />\ncrashed,<br />\nfollowing<br />\nis<br />\nthe<br />\ntentaBonner held the<br />\nlatest<br />\nThe<br />\nUniversities of Oxford and Cam- been picked, but some new quartet in a triumphant position, with his<br />\npigskin<br />\non<br />\nthe<br />\ntee<br />\nand Turnbull<br />\nthis<br />\nmusic has been purchased with<br />\nbridge.<br />\nheel on the chest of an humbled tive schedule released by Mankicked.<br />\nThe<br />\nball<br />\nsailed<br />\nthrough<br />\nIn the matter of dormitories, end in view.<br />\nSt. John's player. Two huges ne- ager Collins:<br />\nthe<br />\nair<br />\nfive<br />\nfeet<br />\nshort<br />\nof<br />\nthe<br />\nmark,<br />\nAbout sixty men were present groes will be in attendance to the<br />\nEnglish colleges possess many simApril 7—Alumni.<br />\nMaryland<br />\nhad<br />\ntime<br />\nfor<br />\nbut<br />\none<br />\nilarities. Usually, a gateway leads at the Glee Club rehearsal in the monarch.<br />\nApril 14—Princeton.<br />\nplay<br />\nbefore<br />\nthe<br />\nwhistle<br />\nblew, and<br />\nto a quadrangle surrounded by two- Barn last Thursday night. The<br />\nIncluded in the line of march<br />\nApril 21--Swarthmore (closed). the game which marked the refor<br />\nstory buildings, with many en- University Ode was gone over<br />\nwill be many machines filled with<br />\n28—Stevens (away) sumption of gridiron relations beApril<br />\ntrances. Each entrance gives admit- the first time this year and all of noise-making instruments and aptween the two schools passed<br />\n(closed).<br />\ntance to the accommodations for the other numbers were rehearsed. propriately decorated for the ocinto history.<br />\n5—Penn.<br />\nMay<br />\nfrom four to eight students. The The club has the \"Winter Song\" casion.<br />\nPrevious to this play Groves<br />\nMay 12—Navy.<br />\naverage suite consists of a bedroom, well in hand and it is expected to<br />\nhad<br />\nattempted another forward<br />\nliving- room and pantry. A chapel make a big hit. After the club reMay 19—<br />\nINITIATES<br />\nwhich<br />\nEPSILON<br />\nTaylor had intercepted and<br />\nDELTA<br />\nPI<br />\nand library form part of the build- hearsed, the quartette held a short<br />\nMay 26—Lehigh (away) closed.<br />\nMEN<br />\nadvanced<br />\nfor a short gain before<br />\nFIVE<br />\nings. The whole has a very home- practice, Mr. Bochau conducting.<br />\nJune 2—Mount Washington. he<br />\nwas<br />\ndowned.<br />\nThree desperate<br />\nDelta<br />\nPi<br />\nthe<br />\nAt a meeting of<br />\nManager Vanneman called attenlike atmosphere.<br />\nOn May 19 it is probable that onslaughts on the Maryland line<br />\nthe Epsilon held last Tuesday the_folThe conditions at Harvard sev- tion to the extra rehearsal in<br />\nthe team will play either Mary- netted seven yards and Turnbull<br />\nan- lowing men were initiated: D. K<br />\nalso<br />\nand<br />\ntonight<br />\nHall<br />\nC.<br />\nE.<br />\neral years ago were in direct conland or Syracuse. The interest in was forced to punt out of danger.<br />\nmaking Vanneman, advertising manager<br />\ntrast with this happy state of af- nounced that the number<br />\na Syracuse game should be espeThe. only score of the game<br />\nfairs. When Dr. Bliss was a stu- the trip to Reisterstown on the of the News-Letter; J. H. Huf- cially keen on account of the came in the early part of the secdent at Harvard, the dormitories night of the first recital will not fard, managing editor of the closeness of the score by which ond quarter when, as the result<br />\nwere used for sleeping only. The exceed forty, and the selection will<br />\nthey defeated Hopkins last year. of a determined advance down the<br />\nNews-Letter and on the business<br />\nmen ate outside of the college, or be made next Thursday night. The<br />\nThe Princeton and Navy games field by Maryland and of an equalstaff of the Hullabaloo; S. A. Mid- are also expected to draw large<br />\nin a large dining room, NiThere the trip will be made by bus.<br />\nly determined stand by Hopkins,<br />\ndleton, business manager of the crowds: the former because of the<br />\nservice was abominable. There was<br />\nat its 20-yard line, Groves was<br />\nlittle opportunity for the formation CLASS DUES DISCUSSED AT Hullabaloo; 0. D. Collins, busi- large Baltimore alumni body; the forced to fall back for a dropSENIOR MEETING<br />\nof friendships by choice. As a reness manager of the Black and Navy game because of the repu- kick from a difficult angle. His<br />\nsult, the average student made few<br />\nThe most important matter Blue Jay ;and F. Dunning, of the tation of the Navy team.<br />\ntoe proved trusty and he sent a<br />\nacquaintances throughout his col- brought up at the Senior Class<br />\nHopkins lost only a few men beautiful kick clearly between the<br />\n'editorial staff of the Black and<br />\nlege life, and, in one case, a man meeting held last Wednesday, Nobusiness staff from last year's team and conse- bars.<br />\nwent through Harvard without a vember 15, was the question of Blue Jay and the<br />\nquently this year's twelve should<br />\nThroughout the first quarter<br />\nsPeaking acquaintance with another class dues. President Cromwell of the News-Letter.<br />\nbe the strongest in years. Those the heavy Maryland team was<br />\nman in the school.<br />\nThis brings the active member- lost by graduatiori and other unable to make the slightest imopened the meeting by discussing<br />\nDr. Lowell's solution of the prob- the question and said that while ship of the. Johns Hopkins chap- cause are Turner, Parsons, Burn- pression on the Black and Blue.<br />\nlem was \"to shake the Freshmen no certain amount of dues could be ter up to fourteen, including, be- ham, Bauernschmidt and Calkins. Time after time the College Parktogether.\" Three dormitories were fixed this early in the year, the man- sides the men mentioned, .L. B. It is not yet known whether or ers were either stopped in their<br />\nbuilt for the Freshmen, who were ner of paying it should be in innot Bartow Griffiss, former cap- tracks or thrown for substantial<br />\nFenneman, president; P. Ives,<br />\nrequired to live in them. Rooms stallments.<br />\ntain of the team, who is pursuing losses. But beef and the Black<br />\ntreasurer; G. P. Fallon, B. J. graduate work at the 'University.<br />\nof all sizes and at all prices were<br />\nand Gold with the plunging McGeorge V. B. Shriver, treasurer<br />\nobtainable. The arrangement was of the class, announced that the Rich, J. F. Muller and J. Leopold. will be able- to play this year. Quade slowly but surely drove<br />\nsimilar to that of the English col- funds from last year's dues were •H. Robinson, a graduate student, Prospects for lacrosse • stars from the Johnnie Hops toward the<br />\nlege, except that the library and $10 short, and that the members Eli Frank, Jr., and F. F. Bram- this year's Freshman class are es- goal. It was in the shadow of<br />\nChapel were lacking. A resident in who had not yet paid last year'; ble, '21; are also members.<br />\npecially bright. A number of the their own goal posts, however,<br />\neach dormitory saw to it that the dues would pay them as an added<br />\nFreshmen have played lacrosse in that Captain Landy's men showed<br />\nThis recently established 'jourFreshmen were well mixed. No part of the dues this year. John<br />\nprep. sehool and it is . expected to the best advantage that nevermaking rap(prie was allowed to pick out a seat Sherwood said that it would be ad- nalistic fraternity is<br />\nthat several of these will strength- say - we - always - fight -yourLbest<br />\nat the table; seats were taken in the visable to spread the dues over the id progress and promises: to. do en the team greatly. The follow- Spirit. which is<br />\ncharacteristic of<br />\norder of entry. To further the entire year, as they May reach $50. much toward the improvement.of ing letter men from last year's this year's battling team. No less<br />\nthe college publications.<br />\nContinued on Page 3, Col. 3.<br />\nContinued on Page,4, col. 2<br />\nContinued on page 2, col..4<br />\nContinued on Page 4, col. 3<br /><br />\nBLACK AND BLUE HOLDS HEAVY<br />\nUNIVERSITY OF MARYLAND ELEVEN<br />\n10 SINGLE FIELD-GOAL<br /><br />\n•<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 21, 1922<br /><br />\n2<br /><br />\nR. 0. T. C. NOTES<br />\n\"Castles in Air\" Presented As<br />\nDR. THACH ADDRESSES<br />\nBrick Dormitories<br />\nSOCIAL SCIENCE CLUB<br />\nPresident Frank J. Goodnow and<br />\nContinued from page 1<br />\nLast Friday afternoon Dr.<br />\nMajor Enoch B. Garey representFOUNDED 1897.<br />\nThach, well known to every Hop- spirit of the movement, interdor- ed Hopkins last week at a confer$2.00<br />\nSubscription<br />\nkins man, addressed the Social -nitory athletics were inaugurated. ence in Washington, called by the<br />\nThe plan was remarkably successScience Club on the subject of<br />\nWar Department in connection<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nful.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n\"The Recent British Political CriThe Committee on Dormitories with the Reserve Officers' Training<br />\nthe<br />\ndeclared<br />\nthat<br />\nDr.<br />\nThach<br />\nsis.\"<br />\nJohn's<br />\nstudents<br />\nof<br />\n-nade<br />\nby<br />\nthe<br />\nuse of the experiences of oth- Corps work. Only the presidents<br />\nto<br />\nJune<br />\nOctober<br />\nfrom<br />\nsemi-weekly<br />\nPublished<br />\nHopkins University.<br />\ncause of the political upheaval ers. They desire that all four classes and commanders of the R. 0. T. C.<br />\nBusiness communications should be addressed to the BUSINESS MAN- just passed was a desire on the be represented in each dormitory, units of a few picked colleges were<br />\nAGER, JOHN HOPKINS UNIVERSITY: all articles and other communications<br />\npart of the British nastion to re- so that the older men can exert an asked to attend. The proceedings<br />\nshould be sent to the MANAGING EDITOR.<br />\ninfluence on the younger, as is the<br />\nturn to party normalcy, that is, to<br />\n100<br />\nHomewood<br />\n.- :ase in the English college.\"Dormi- of the conference have not yet been<br />\nTelephone<br />\nforego the unusual war condition tory spirit\" is to be<br />\nencouraged as divulged, beyond the fact that imparcoalition<br />\nand<br />\nreturn<br />\nto<br />\nof<br />\na<br />\nManager:<br />\nBusiness<br />\nsoon as the second building of the portant R. 0. T. C. problems were<br />\nEditor-in-Chief:<br />\nWILLIAM H. MOORE, JR., '23.<br />\n-Joup of four is completed. Self-. discussed. The conference lasted<br />\nliainentary party government.<br />\nGLOVER P. FALLON, '23.<br />\nManaging Editor:<br />\nDr. Thach began with *an ex- government to a great extent will from Thursday to Saturday, NoAdvertising Manager:<br />\nJ. HUDSON HUFFARD, '23.<br />\nplanation of the recent history of be permitted. The dormitories are vember 16th to 18th, inclusive.<br />\nDONALD K. VANNEMAN,'23.<br />\nto be for the exclusive use of the<br />\nAssistant Managing Editor:<br />\nLast year saw the beginning of<br />\nBritish political parties since beJOSEPH S. LEOPOLD, '24.<br />\noccupants and their guests, and are an engineering<br />\nCirculation Manager:<br />\nbranch of the R. O.<br />\nfore the war and traced their ten- not to serve as rest rooms<br />\nfor all T. C. at Hopkins. At the inspecPHILIP W. HOWARD, '25.<br />\nAssociate Editors:<br />\ndency up to the present day. The the students of the college. FraRIGNAL W. BALDWIN, JR., '23.<br />\ntion held in the spring the engiWILLIAM G. DEAN, JR., '24.<br />\nAssistant Business Managers: two chief parties before the war ternity men are<br />\nexpected to play neers constructed a bridge for the<br />\n'23.<br />\nHEARN,<br />\nBERNARD C.<br />\nJunior Editors:<br />\nwere the Conservatives and Lib- a prominent .part in the develop- approval of the inspectors.<br />\nFITZGERALD DUNNING, '24.<br />\nRANDOLPH NORWOOD, '24.<br />\nD. MILES MARRIAN, '25.<br />\nerals. At the outset of the war ment of student life in the<br />\nT. REESE MARSH, '24.<br />\nThe first work on the trenches<br />\nG. DONALD GIESKE, '25.<br />\nRICHARD C. TILGHMAN, '25.<br />\n\"dorms.\"<br />\nJ. D. SLAUGHTER, '23.<br />\nwas begun Thursday afternoon.<br />\nthe Liberals under Asquith were<br />\nJOHN W. PARSONS, '25.<br />\nJOHN C. LEWIS, JR., '23<br />\nFollowing this discussion of the They will be<br />\nBENJAMIN T. ROME, '25.<br />\ndug on the west side<br />\nJOHN T. DIXON, '24.<br />\nin control. Lloyd George was also theory of the<br />\nsubject by Dr. Bliss, of the woods south of<br />\nthe C. E.<br />\nin the cabinet as chancellor of the Mr. Palmer described the building.<br />\nBuilding, and will be short and of<br />\nexchequer. However, there was a He showed slides of the first and<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\ntype \"A.\" The object will be to<br />\n()Teat deal of dissatisfaction with second story floor plans, of typical<br />\nteach the proper construction of<br />\nAsquith's conduct of the war, es- rooms and suites, and an illustrathis type, and no effort will be<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. pecially in regard to high explo- tion of the completed building. He<br />\nmade to build the trenches from<br />\nsives and shrapnel. All in all, As- showed that Comfort, dignity, beauthe standpoint of layout. The<br />\nquith was not considered the prop- ty, convenience, and homelike aptrench will also be small, to secure<br />\nBALTIMORE, MD., NOVEMBER 21. 1922<br />\ner type of man for carrying on a pearance had been considered in<br />\ngood drainage. Type \"B\" trench<br />\nwar. So, under a general coalition, planning the structure. Some of<br />\nwill probably be built next year.<br />\nLloyd George was swept into the features of the building are: a<br />\nThe R. 0. T. C. is busily engaged<br />\npower. His desertion of Asquith large \"commons\" room, an efficient<br />\nOUTWEIGHED, BUT NOT OUTGAMED<br />\nin preparing for the big parade on<br />\nwas considerably frowned upon service system, fire proof construcDecember 2. While the review be\"'Outweighed, but not outgamed,\" we predicted, and those sentiand<br />\nhe was generally blamed for tion, and a wide selection of types<br />\nments'are ours still. 'We offer no alibi. None is needed. Maryland<br />\nfore President Goodnow was a sucearned the victory that she won last Saturday through a greater of- the breaking up of the Liberal of rooms. The four types of rooms cess, it showed that the men have<br />\nfensive strength, but Hopkins accomplished all, and .more, than that party.<br />\nand the estimated cost of rental for to get more accustomed to marchwas expected of it.<br />\nThus Lloyd George found him- each, not including board, is as foling if they want to make an espeThe student-body in the rooters' section appreciated the fact that self in a peculiar situation. The lows:<br />\ncially impressive showing.<br />\nthat<br />\nwas<br />\nabsolutely<br />\nthe<br />\nbest<br />\ngiving<br />\nwas<br />\nthe Black And Blue eleven<br />\ncause of the ruin of his own par- Single room (bedroom and<br />\nThe R. 0. T. C. was a big help<br />\nin it, and consequently stuck by it to the last, in its defeat-if it may ty, not accepted as leader of the<br />\nstudy bOth)'<br />\n$5.65 to the Athletic Association in hanreally be called such.<br />\nConservatives, he was a man with- Double study and separate<br />\nThose last-minute stands, in the shadow of the goal-posts, ,are<br />\n•<br />\ndling the crowd at the Maryland<br />\nout<br />\na party, supported by a coalibedrooms<br />\n6.60 game. The men will also assist in<br />\nindicative of the spirit that enabled our out-weighed team to stand the<br />\ntion. It was his tremendous suc- Single study and 'single bed\"gaff.\"<br />\nmanaging the crowd at the St.<br />\nThere is great consolation in the fact, however, that this game did cess in carrying on the war that room<br />\n8.30 John's game.<br />\nnot close the schedule. The chances, in the two games remaining, are gave him a very large personal Study, bedroom and private<br />\nAt present, the freshmen• are<br />\nabout.even and with the brand of fight exhibited Saturday continued. following. After his great victory<br />\nbath<br />\n10.00<br />\nlearning<br />\nhow to use the rifle.. This<br />\nmost<br />\nsuccessfully.<br />\nthe season should close<br />\nno one wished to be the first in a<br />\nFood will be supplied at cost.<br />\nis<br />\nslight<br />\ndeviation from the work<br />\na<br />\nAll guns on St. John's!<br />\nmovement to overthrow him. The building will cost $500,000<br />\nbut Major Garey<br />\nTherefore, he was able to main- complete, of which $270,000 was in the text-book,<br />\nget<br />\nthe<br />\nmen interested<br />\ntain his power for an unusually given by the Alumni. The balance is anxious to<br />\nTHE RUSHING AGREEMENT<br />\nteam..<br />\nin the rifle<br />\nAccording to the<br />\nlong time. That is why the 1918 is furnished by the Board of TrusMajor, there are some splendid<br />\nThe fact has been brought to the attention of the Interfraternity elections returned him to power, tees<br />\nform the endowment fund, with shots among the new men, but they<br />\nBoard that there have been violations of the Rushing Agreement by despite the fact that his platform the<br />\nstipulation that the return have to be developed.<br />\nsome of the newer fraternities upon the campus. Whether these in- of \"hank the Kaiser and make<br />\nfrom the investment should be the<br />\nfractions were the result of ignorance of the law or wilful neglect is Germany pay\" was ridiculous.<br />\nsame as that which could be obtainnot known. The Board, however, requests that the NEWS-LETTER call<br />\nHowever, the post-war condi- ed ordinarily. Mr. Palmer's estiattention through the editorial column to the importance of a thorough tions were different. Diplomatic<br />\nmates, therefore, are based on the<br />\nunderstanding of the regulations on the parts of both the fraternities failures and civil discord in- total<br />\namount supplied by the uniand the freshmen.<br />\ncreased opposition to Lloyd versity, and the amount needed to<br />\nIt is the duty of the latter to acquaint themselves with the frater- George, and precipitated his col- furnish an<br />\nadequate return on the<br />\nnity situation and the rules governing it. No matter how modest the lapse. His personal following endowment money.<br />\nfreshman may be, he should be prepared to obey those sections of the turned out to be very small and<br />\nVannernan announced that Hutzagreement concerning him.<br />\nthe results of the election placed ler would make arrangements for<br />\nThe most glaring \"don't\" upon the list is that of Section 2, Article him and his supporters fourth and all those who wish to<br />\ndrive autoI, which prohibits treating or entertaining a freshman by a fraternity last of the great British .parties. mobiles in the St.<br />\nJohn's ,game paman or the entering of a fraternity house by a first-year man before<br />\nThe effect of other various con- rade. He asked for support of the<br />\nDecember.13. The meaning of this section is clarified by a later ruling ditions brought the Labor party plans for the<br />\nHow Much Time<br />\ncelebration of the asof the Board which permits \"Dutch treat\" parties, not in the home of into prominence until now it is sault<br />\nand battery upon Maryland Do You Waste?<br />\na fraternity man. It also forbids the entertainment of a fraternity man the opposition party in Parlia- State. The<br />\nremaining time of a Sharpening wood penby a freshman.<br />\nment. This group now includes long assembly was devoted to \"pep- cils means loss of time<br />\nPrevious to the rushing season, fraternities may be freely discussed many old Conservatives also. ping<br />\nand effort.<br />\nup\" for the State game.<br />\nbetween the men, but no fraternity is permitted to bid (invite to join a<br />\nBonar Law's new administrafraternity), or intimate that they will bid, any first-year man. Bids tion probably will not make any<br />\nFRATERNITY NOTICE<br />\nare not permited until eight o'clock Wednesday morning, December 13. great changes in policy. The old<br />\nVarious methods are frequently resorted to to get around the regula- program will be continued in all<br />\nThe Sigma Tau Delta Fraternity<br />\ntions, the favorite channel being the girl route.<br />\nessential details. The one signifi- of Johns Hopkins University Ends all pencil sharpenDiscussing other fraternities is not illegal, but is merely a matter cant fact is that..the change -has<br />\nwishes to announce that they are ing- of taste. Actual \"panning\" of a fraternity directly or indirectly by an- brought about a change of party<br />\nCosts less to use than<br />\nmoving into their new location at wood<br />\nother fraternity is also a matter of taste.<br />\nmanagement rather than party<br />\npencils.<br />\nThe importance of a serious study of fraternity affairs by the new policy. With normalcy the key- 2905 St. Paul street. The frater- Uses double length leads,<br />\neach equal to a seven inch<br />\nmen on the campus cannot be emphasized too strongly. Fraternities word, the parties have returned nity also wishes to call to the at- wood pencil in writing<br />\nplay, probably, a greater part in the development of the college man to their former status and the tention of the student body the service. Guaranteed not to<br />\nclog at the point.<br />\nduring his four years than any other single element. Like marriage, it coalition has been dissolved.<br />\nfact that its name was, through The FEATHERWEIGHTis a permanent affair and may either make or break a man.<br />\nAfter Dr. Thach's very interhere-oflight weight<br />\nerror, omitted from the Hand- shown<br />\nAluminum 50c. Rolled<br />\nThe Rushing Agreement is printed in its entirety in the \"Y\" hand- esting talk there was an informal<br />\nSilver, $1.00.<br />\nbook, beginning page 25. The special rulings were published in the discussion of various subjects<br />\nSee this and the other Ingersoll models at your stationbrought up in the course of the<br />\nlast issue of the NEWS-LETTER.<br />\nery or co-operative store.<br />\naddress. It was announced that near future. After the return of<br />\nIngersoll<br />\nReillpoInt Co., Inc.<br />\na speaker of international promi- Dr. Lovejoy, about the first of the<br />\nWm.H.Ingersoll, Pres.<br />\nThe NEWS-LETTER takes pleasure in announcing the election of nence is being sought for a large year, other open meetings will be 461 Fourth Ave,New York City<br />\nopen meeting to be held in the held.<br />\nJohn T. Dixon, '24, to the position of Assistant Business Manager.<br /><br />\nThe Johns<br /><br />\nHopkins News-Letter<br /><br />\nIngersoll<br />\nRa4--tiP cii<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 21, 1922.<br /><br />\ntnd<br />\n'nt'erthe<br />\nion<br />\ning<br />\nnts<br /><br />\nC.<br />\nere<br />\nigs<br />\n!en<br />\nm!re<br />\n:ed<br />\nToof<br /><br />\na<br /><br />\ng-ihe<br /><br />\nLes<br />\n)n.<br />\nde<br />\nE.<br />\nof<br />\nto<br />\nof<br />\nbe<br /><br />\nhe<br />\nre<br />\nch<br /><br />\n1)<br />\n1<br /><br />\n11-<br /><br />\n1(1<br />\ntd<br />\nin<br />\n;t.<br /><br />\nNORTHWESTERN TEAM<br />\nASSOCIATION OF UNIVERSI- PLEDGE TO BE ASKED OF<br />\nINSURED<br />\nTHOSE ATTENDING FIRST<br />\nTY PROFESSORS MEETS<br />\nNorthwestern footentire<br />\nThe<br />\nCOTILLON<br />\nDr. Vincent Elected President<br />\ninsured against<br />\nbeen<br />\nhas<br />\nteam<br />\nball<br />\nCarvil Gardner, president of the<br />\nAt the autumn meeting of the<br />\ninjury by a blanket policy, Dan<br />\nlocal chapter of the American As- Cotillon Club, has made an an M.Evans, director of athletics, ansociation of University Professors nouncement to the student body in nounced Tuesday. Terms of the<br />\nwhich consists of nine Goucher reference to the first cotillon, to be policy, assure the University a<br />\nProfessors and 58 Hopkins pro- held at the Maryland Casualty fixed sum for every player infessors, John M. Vincent was Club House on December 8th. jured or taken ill during the footEvery man attending this affair ball season. They also provide a<br />\nelected president for this coming<br />\nwill be asked to pledge that he will 50 per cent. additional sum for<br />\nyear, and John C. French, secre- not take a drink after noon on the<br />\nevery player sent to the hospital.<br />\ntary. They succeed the retiring of- day of the dance. This system has Compensations already have been<br />\nficers, James W. Bright, presi- been introduced in other universi- received for five broken noses.<br />\ndent, and L. S. Hulburt, secretary. ties throughout the country, and<br />\n—The Cadet<br />\nthe<br />\nin<br />\nbeen<br />\nraising<br />\nsuccessful<br />\nhas<br />\nThis association has much inrepute of the dances in the various<br />\nfluence among the colleges and<br />\nServices Of<br />\nlocalitiies. John Sherwood, presi- Lacrosse Team Loses<br />\nuniversities throughout the Coun- dent<br />\nCoach<br />\nof the Student Council, ha-;<br />\nContinued from page 1.<br />\ntry. Its membership consists of assured the undergraduates that all<br />\nare out for the team:<br />\ntwelve<br />\nover four thousand college profes- the activities are behind the CotilBachman, Benedict,<br />\nZoller,<br />\nsors. All of these. men have had lon Club in the exacting of this<br />\nCapt. Murphy, RoutMcDaniel,<br />\nat least five year' experience in pledge.<br />\nCoady, Cromwell,<br />\nTurnbull,<br />\nson,<br />\ncollegiate instruction.<br />\nAnyone wishing a ticket for the Huey and Landy.<br />\nAmong the various subjects dis- first cotillon is asked to see GardManager 0. D. Collins especialcussed at the meeting was one ner immediately, as the supply is<br />\nrequests that those men who<br />\nly<br />\nwhich might be of particular in- limited.<br />\nout for fall lacrosse report<br />\nare<br />\nterest to the undergraduate stuearlier in the afternoon. On acdents.<br />\nProf. (in class)—Order! Order! count of early darkness little<br />\nThe local chapter in its report<br />\nStudent<br />\n(just awakening)—Ham work can be done if the men are<br />\nto the central association will inlate.<br />\nclude a plan by which, if it is and eggs.—The Lawrentian.<br />\nadopted by the association, an undergraduate who, in pursuing his<br />\nOWENS &amp; HECKLINGER<br />\nregular studies, comes upon a<br />\nTAILORS<br />\nspecial topic in any course of<br />\nMAKERS OF COLLEGE CLOTHES<br />\nwhich he wishes to make a more<br />\nBALTIMORE, MD.<br />\n18 ST. PAUL ST.<br />\nthorough study, may do so. This<br />\nprivilege will be granted only<br />\nunder the condition that the student is well up in his studies and<br />\nis able to give this subject additional time without affecting his<br />\nregular work. For instance, it<br />\nwas suggested that one might<br />\nwish to make an extensive investigation of some special period of<br />\nhistory to which the course does<br />\nnot pay special attention. He may<br />\nOf heavy Scotch Grain Leather; black or<br />\ndo this extra work and take an<br />\nexamination on it. If he succeeds<br />\ntan; equipped with rubber heel: a colin passing he will receive one<br />\nlege shoe designed for real college men.<br />\ncredit toward graduation. This<br />\nspecal work as a rule will not cover over one semester.,During the<br />\nsecond semester the sttident may<br />\nstudy another topic and receive<br />\nanother credit. By this plan a man<br />\nAT CHARLES STREET<br />\nmay gain additional credits which<br />\nwill be of great assistance to him<br />\n216 NORTH<br />\nif he desires to complete his course<br />\nat the University in three years.<br /><br />\nA Hopkins<br />\nBroq ue $8<br /><br />\nSlesingers<br /><br />\nThe \"COLLEGIAN ,'<br />\nThe hat for the \"College Man\" who<br />\nc•-\"--% .<br />\ncreates his own style<br />\nWARNER Si, COMPANY<br /><br />\n'4up<br /><br />\n-5°<br /><br />\nHATTERS<br />\n222 W. BALTIMORE ST.<br /><br />\nONE is the -Rah Rah- hat and the Bulldog shoe.<br />\nCollege style today smacks of the same sober,<br />\nsensible style of the business world.<br />\nStein-Bloch and Goodman &amp; Suss Clothes, tailored<br />\nin Rochester, exemplify that idea so well.<br />\nExclusively at—<br /><br />\nG<br /><br />\na-Jac/4<br /><br />\nY4ciori-<br /><br />\n(Y. M. B. 0. D.)<br />\nBaltimore &amp; Hanover<br /><br />\n•<br /><br />\nCorrect Furnishings for<br />\nthe College Man<br />\nHUTZLER 131WIEM e<br /><br />\nThe Johns Hopkins University<br /><br />\nFORTY-SEVENTH YEAR OF INSTRUCTION 1922-1923<br /><br />\nINSTRUCTION<br />\nGRADUATE SCHOOL OF ARTS AND SCIENCES.<br />\nArts; Doctor of Philosophy.<br /><br />\nDegrees: Master of<br /><br />\nMEDICAL SCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nCOLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nENGINEERING. Degrees: Doctor of Engineering; MasOF<br />\nSCHOOL<br />\nter of Engineering; Bachelor of Engineering; Bachelor of Science in<br />\nChemistry.<br />\nSCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Public Health; Doctor of Science and Bachelor of Science in Hygiene; Certificate in Public Health.<br />\nSCHOOL OF BUSINESS ECONOMICS. Bachelor's Degree.<br />\nCOLLEGE COURSES FOR TEACHERS. Degree: Bachelor of Science.<br /><br />\nCIGARETTES<br /><br />\nSUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of<br />\nArts or of Science.<br />\nCOURSES IN SOCIAL ECONOMICS.<br />\nEVENING COURSES in Business Economics and for Technical Workers.<br /><br />\nJOHN HOPKINS PRESS PUBLICATIONS.<br /><br />\nnow<br /><br />\nBUILDINGS<br />\nGILMAN HALL—general library, class rooms, biology, administration.<br />\nMECHANICAL AND ELECTRICAL ENGINEERING—housing also Physics<br />\nand College Chemistry.<br />\nCIVIL ENGINEERING—housing also Geology.<br /><br />\nfor TWENTY<br /><br />\nPOWER HOUSE.<br />\nBOTANY AND PLANT PHYSIOLOGY—with Greenhouses and Botanical<br />\nGarden.<br /><br />\nand after all, what<br />\nother cigarette is so<br />\nhighly respected by<br />\nso many men?<br /><br />\nCHEMICAL LABORATORY—for graduate work.<br />\nPHYSIOLOGICAL BUILDING.<br />\nANATOMICAL LABORATORY.<br />\nHUNTERIAN LABORATORIES.<br />\nPATHOLOGICAL LABORATORY.<br />\nSCHOOL OF HYGIENE.<br />\nCARROLL MANSION—Johns Hopkins Club.<br />\nSTUDENT ACTIVITIES BUILDING.<br /><br />\nLet Fatima smokers<br />\ntell you<br /><br />\nALUMNI MEMORIAL DORMITORY.<br />\nLIGGETT &amp; MYERS TOBACCO CO.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 21, 1922.<br /><br />\nANNOUNCEMENTS AT<br />\nFRESHMEN HOLD FOOTBALL<br />\nORGANIZATION MEETING<br />\nHOMEWOOD<br />\nThe Freshman class held its<br />\nWilliam N. McFaul, Jr., Class of<br />\ntie cffiettiraItzutbarb Pooh (girfootball organization meeting on '24, has been appointed foreign<br />\nHoliday Books<br />\nThursday, November 16, in 110 secretary for the students' branch<br />\nBeautiful Illustrated Gift Editions, C. E. Manager Keller called the<br />\nof the Young Men's Christian AsBiography, Travel, Fiction.<br />\nmeeting<br />\nwere<br />\ncandidates<br />\nand<br />\n18<br />\nsociation<br />\nat Hopkins.<br />\nChildren's Books<br />\nThe duties of Mr. McFaul's ofFountain Pens and Silver Pencils, present.<br />\nKeller explained the present sit- fice, which is a new one just estabMedical Books of All Publishers<br />\nuation to the men. The Sopho- lished at the university, will center<br />\nat<br />\nmores have organized a football primarily in the organization of<br />\n301 N. Charles St.<br />\nteam and are ready to play the foreign students at the university.<br />\nFreshmen some time in Decem- Since the dissolution of the Cosber. By order of Dr. Abercrombie mopolitan Club for foreign students<br />\nMANUFACTURING JEWELERS<br />\nthe members comprising the two two years ago, the association has<br />\nLancaster, Pa.<br />\nteams must have practiced for at been working upon a plan to pro-Class Rings, Pins, Fraternity Pins,<br />\nleast one month in some branch mote the interests of foreign stuCups, Medals, Etc.<br />\nStationery, Invitations, Programmes of athletic activity before the dents at Hopkins, and to help them<br />\n\"Makers of the Varsity Seals\"<br />\ngame can be played. Accordingly, become assimilated in the life of<br />\npractice was started immediately, the American college. The result<br />\nSTRATTON SHIRT MAKER<br />\n226 N. Liberty St.<br />\nthe first workout being held on was the establishment of Mr. Mc$3.00, $3.50 and $4.00 Friday afternoon on the lower<br />\nDress Shirts<br />\nFaul's office.<br />\n$3.25 and $4.25<br />\nNegligee<br />\n$5.25 and $6.25 field. Hereafter they will be held<br />\nImported Madras<br />\nThe Publicity Board has arTerms Cash, Less 10% 30 Days on regularly two or three times a<br />\nto send out to all of tilt:<br />\nranged<br />\nShirts<br />\nweek.<br />\nAlso a Full Line of Men's<br />\nprep schools this week copies of the<br />\nFurnishings<br />\nThe circumstances under which reply made to the article in the St.<br />\nthese men will have to train are John's Collegian, entitled \"The<br />\nFine Clothes<br />\nunfortunate. There are no foot- Hopkins Spirit.\" It was decided<br />\nA suit by Lemmert gives the final ball togs or shoes available about that the prep schools should know<br />\ntouch to the lasting satisfaction you the campus, all old clothes, headof the Hopkins attitude towards<br />\nderive from thoroly dependable<br />\ngears,<br />\netc.,<br />\nhaving<br />\nbeen<br />\ndisposed<br />\nthe matter.<br />\ncloths cut in authentic fashion—<br />\nwhether for every-day wear or more of a short time ago. As a result,<br />\nThe board is carrying on its goosl<br />\nfestive occasions.<br />\nthe candidates will be forced to work of distributing posters anpractice in togs or outfits fur- nouncing each game, of giving the<br />\nLEM MERT -r) at<br />\nnished by themselves.<br />\nresults of the various athletic con19 Fayette Street, East<br />\ntests, and making announcements<br />\nBusiness Suits<br />\nDress Clothes<br />\nDATE OF PUBLICATION OF NEXT of future games over the wireless<br />\nOvercoats<br />\nSport Togs<br />\n\"BLACK AND BLUE JAY\"<br />\nfrom the News' station, W-E-A-R.<br /><br />\nBANK WITH<br /><br />\nTHE BOOK MART<br /><br />\nSecurity Storage &amp; Trust Co.<br />\nNORTH AVENUE at CHARLES STREET<br />\nASSETS OVER ONE MILLION DOLLARS<br />\nSAVINGS OR CHECKING ACCOUNTS<br />\nAS YOU WISH<br />\nHENRY S. KING, President<br /><br />\nJ. F. Apple Co.<br /><br />\nPOSTPONED<br /><br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br /><br />\nHOCHSCHILD,KOHN gc Co.<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nJ<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\n1.<br /><br />\nWinning More Friends<br />\nEvery Day Because They Know<br /><br />\nThe next issue of the Black and AUTHOR OF \"VERITAS VOS<br />\nBlue Jay, the \"Rushing Number,\"<br />\nLIBERABIT\" APPOINTED<br />\nwill not appear on December 1st, as<br />\nCHANCELLOR<br />\nit was previously announced. The<br />\n421 N. HOWARD ST.<br />\nRev. William Levering Devpaper's advertisers would like to<br />\nIs the One Perfect Motor Fuel.<br />\nHOSIERY<br />\nGLOVES<br />\nries, a native of Baltimore, who<br />\nzet some Christmas advertising in<br />\nAre You Satisfied?<br />\nwas graduated in 1888 as a bachone of the issues, but it would be<br />\nSHERWOOD BROTHERS, Lic.<br />\nelor of arts and in 1892 as a docEstablished 1873<br />\nimpossible to publish two numbers<br />\ntor of philosophy, and later purA.H.Fetting Man'fg Jewelry Co. before Christmas. Therefore, the sued his studies in the General<br />\nsecond issue will be out on DecemManufacturers<br />\nTheological Seminary, New York,<br />\nber 15th to accommodate the adverGreek Letter Fraternity Jewelry<br />\ngraduating in 1894, has recently<br />\n213 N. LIBERTY ST., Baltimore, Md. tisers.<br />\nbeen appointed chancellor of the<br />\nThe number already gives promMEN'S SHOES<br />\nProtestant Episcopal Cathedral of<br />\nise of being the best Black and Blue<br />\nOf the Better Class<br />\nSt. Alban, Washington,, D. C. Dr.<br />\nes-gt<br />\nJay published thus far. Many drawDevries had been for some years<br />\nings and literary contributions have<br />\na residentiary canon at St. Albeen received. The postponement<br />\nban's. His name is especially faof<br />\nthe date of issue makes it pos.0*<br />\nmiliar to alumni and students as<br />\nURNER BROTHERS<br />\nsible to carry the work still further.<br />\nthat of the author of the Univer111 E. BALTIMORE STREET<br />\nUndergraduates in general, and<br />\ny<br />\nBALTIMORE<br />\nie<br />\n/Catter<br />\n..<br />\n°Ike:<br />\nsity Ode entitled \"Veritas Vos<br />\nparticularly<br />\nengaged<br />\nwho<br />\nare<br />\nthose<br />\n5\\1G•1-OSCAR<br />\ntjA -- H.&amp;<br />\nLiberabit.\"<br />\nin competition for positions on the<br />\nOWNERS<br />\ngame against such overwhelming<br />\nstaff, are urged to contribute to the<br />\n\"\"l'or.4<br />\nI'61b0<br />\nodds.<br />\nRIFLE<br />\nTEAM<br />\nMATCHES<br />\n29 Baltimore St., East<br />\nmagazine. Jokes on college fratcrOne Door West of LigIlt St.<br />\nFor Maryland, McQuade, who<br />\nARRANGED<br />\nnity life are preferred. All copy<br />\nSOLE AGENTS FOR BALTIMORE<br />\ndid<br />\nthe bulk of the work of his<br />\nPractice is now being held for<br />\nmust be submitted on or before NoFor College Fraternity Bands<br />\nplunging<br />\nand Groves who punted<br />\nthe Rifle Team. Manager Parks is<br />\n(Greek Letter Societies)<br />\nvember 13th.<br />\nand<br />\nwell<br />\nwhose dropkick spelled<br />\narranging a very attractive schedvictory<br />\nfor<br />\nthe : College Parkers,<br />\nA. S. M. E. ATTENDS MOVIES ule, matches having already been<br />\nSemler, who in past<br />\nshowed<br />\nwell.<br />\nschdeuled with Princeton, GeorgeA large number of the MechanPrinters of Philological and<br />\nyears<br />\na thorn in the side<br />\nhad<br />\nbeen<br />\ntown, Boston Tech and Syracuse.<br />\nical Engineering students, and also<br />\nScientific Works<br />\nand<br />\nBlue, was well<br />\nBlack<br />\nthe<br />\nof<br />\nIn the R. 0. T. C., Major Garey<br />\nsome Electrical Engineers, attend- is deviating from the work in the covered and with the exception<br />\n23 S. HANOVER ST.<br />\nLaltimore, Md.<br />\ned the movies recently given in the text-book and is showing the fresh- of one long run, didn't lOok so<br />\nCivil Engineering Hall. The pic- men how to shoot a rifle. By get- good.<br />\nBetween the halves \"toreador\"<br />\ntures showed in minute detail ting the new men interested in this<br />\nSARATOGA AT<br />\nBill Meyers, accompanied by a<br />\nmanner,<br />\ntalent<br />\nlatent<br />\nis<br />\nunearthed<br />\nevery step involved in the manuLIBERTY STS.<br />\nin men who never had any idea that galaxy of \"matadors\", \"picadors\"<br />\nfacture of the Cadillac motor. The<br />\nand \"cuspidors\", showed that his<br />\nthey were able to shoot.<br />\nLUNCHEON<br />\nfotir reels were very interesting<br />\ndeadly<br />\nline was still with him<br />\nTEA<br />\nfrom an engineering standpoint,<br />\nwhen<br />\nhe<br />\nsuccessfully slew the<br />\nBLACK AND BLUE HOLD U. OF M.<br />\nDINNER<br />\n\"bull.\"<br />\nand the American Society of MeTO LONE FIELD GOAL<br />\nSPECIAL PARTIES<br />\nThe lineup and summary:<br />\nContinuf,d from page 1<br />\nchanical Engineers, under whose<br />\n11.30 A. M.<br />\nthan four times inside the 10Score by periods:<br />\nauspices the pictures were shown,<br />\nuntil<br />\nMaryland<br />\nyard line did the Hopkins men Hopkins<br />\nMiddleton .....L.T...... . Nisbet<br />\nPLAZA 6987 are very much indebted to the Cad7.30 P. M.<br />\nhold Maryland for downs.<br />\nMagill<br />\nL E<br />\nYoung<br />\nillac people who loaned the films.<br />\nBromley<br />\nL G<br />\nThere was glory enough for al: Slow ik<br />\nCromwell . ..0<br />\nBailey<br />\nIt is hoped that other interesting in the battle and although no in- Walbert<br />\nR G<br />\nHough<br />\npictures can be secured on other dividual stars shone forh, Cap Landy (c).<br />\nR.T........ Burger<br />\nBranner<br />\nR E<br />\nRich<br />\nMt. Vernon 4999<br />\nmechanical work later on.<br />\ntam n Landy, outweighed at least Bonner<br />\nQ B<br />\nG-oves<br />\nL H<br />\nPugh<br />\n50 pounds, by the giant Nesbit. Taylor<br />\nRH<br />\nSemler<br />\nClass Dues Discussed at Senior showed a wonderful game in more Coady<br />\nTurnbull .. .F.B.<br />\nMcQuade<br />\nMeeting<br />\nthan holding his own with the Maryland<br />\nHopkins<br />\n.0 0 0 0-0<br />\nCommercial Photography<br />\nContinued from page 1<br />\nhuman tank. Middleton and<br />\nDropkick—Groves. Substitufons:<br />\nCircuit Photography<br />\nA motion was proposed and adopt- Schact, the ends, broke up play Hopkins—Schact for Middleton, MidSHIRTS<br /><br />\nNECKWEAR<br /><br />\n3<br /><br />\nDRAPERIES<br /><br />\nLefranc &amp; Ault<br /><br />\n1<br /><br />\nYELLOW<br />\nCAB CO.<br /><br />\n1<br /><br />\nPHONE, VERNON 1212<br /><br />\nURNER'S<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nW.L. Mann<br /><br />\nFlash Lights<br />\nGroups<br /><br />\nViews ed that $5 per month would be col- after play, but as previously said,<br />\nEnlargements lected from each member until the there were no outstanding stars.<br />\nfirst of next year. A sample class It was the old one-for-all and allKODAK FINISHING<br />\npillow, which has lately been de- for-one spirit which enabled<br />\n325 N. Howard St.<br />\nsigned, was shown to the members. Hopkins to put up such a. brilliant<br /><br />\nd'eton for Schact, Schact for Coady<br />\n(Rich going to half and Schact to end).<br />\nMa ryland—Guervich for Groves, Bosley for Semler. Referee—Dwyer, Notre<br />\nDame. Umpire—Clinton, Yale. Field<br />\njudge—Farrier, Dartmouth. Head linesman—Collins, Dartmouth. Time of<br />\nquarters-15 minutes.<br /><br />\nThe Yellow Cab<br /><br />\n1:<br /><br />\nis not merely a trade name<br />\nfor a seivice, but is also the<br />\ndesignation of a certain type<br />\nof cab.<br /><br />\nStandardization<br />\nOf Our<br />\nEquipment<br />\nhas made it possible for us<br />\nto offer you the most mod-<br /><br />\nern Taxicab service in the<br />\ncountry at the following low<br />\nrates:<br /><br />\n1<br /><br />\n30c FIRST 1-3 MILE<br />\n10c Each Additional 1-3<br />\nMile or Fraction Thereof<br /><br />\n1<br /><br />\n20c for Each Additional<br />\nPassenger<br /><br />\nOver One for the Entire<br />\nTrip<br />\nShown on the Taximeter<br />\nUnder EXTRAS<br /><br />\n2<br />\n1<br /><br />\n1<br />\nMain Office and Garage<br />\n1123-1125-1127-1129<br />\nCATHEDRAL STREET<br /><br />\n1<br /><br />"}], "field_media_file": [{"target_id": 37677, "display": null, "description": null, "target_type": "file", "target_uuid": "410c0b8e-a75b-44e3-89de-9fba20f5f1df", "url": "http://digital.library.jhu.edu/system/files/2022-03/13029-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13029, "target_type": "node", "target_uuid": "3ce7b019-5f51-4d16-86d6-cba11a2bbf8c", "url": "/node/13029"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "e73548a9-548d-4ebf-b3f0-98799d08f983"}]}