{"mid": [{"value": 36673}], "uuid": [{"value": "aa7b580e-e775-400a-b76d-da228c592adf"}], "vid": [{"value": 36673}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:51:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12971-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:51:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:51:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "0<br />\n5<br />\n5<br />\n<br />\nBALTIMORE, MD., DECEMBER 6, 1921<br />\n<br />\nVOL. XXVI. No. Ili /7<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nSOPHOMORES A, ND FRESH- FRESHMEN STARS MAKE E. E. JUNIORS ORGANIZE THREE HOPKINS ALL-STATE CONCRETE STADIUM FOR<br />\nHOPKINS CONSIDERED<br />\nMEN TO RETURN NEXT YEAR<br />\nRADIO CLUB<br />\nBOW WEDNESDAY NIGHT<br />\nMEN PREPARE FOR<br />\nProposed<br />\nStadium to Seat 40,000 PerBonner<br />\nMagill,<br />\nGraduate.<br />\nTotterdale<br />\nto<br />\n-Continental<br />\nEngage<br />\nin<br />\nTrans<br />\nDramatic Club's Bill of Short Plays Hope to<br />\nFOOTBALL GAME<br />\nsons. To Be Modeled After One<br />\nSophs Developing Team Work. Dance<br />\nto Be Held After Rush.<br />\n<br />\nVery Attractive.<br />\n<br />\nThe Johns Hopkins Dramatic<br />\nClub will put on its first production of the year Wednesday night<br />\nin its studio on the top floor ot<br />\nthe Barn. Only two plays will be<br />\npresented, \"A Death in Fever<br />\nFlat,\" a one-act tragedy by Cronyn, and \"A Roadhouse in Arden,\" by Philip Moeller.<br />\nThe plays are coming along<br />\nvery well in rehearsal and Mariano Badillo promises some unusual scenic effect particularly in<br />\nthe Moeller burlesque, \"A Roadhouse in Arden.\" He has also designed costumes which very effectively suggest the extraordinary atmosphere of the piece. The<br />\ntragedy,\"A Death in Fever Flat\"<br />\npresents a •real problem. It is a<br />\ntense, strident affair presenting<br />\ntechnical difficulties demanding<br />\nthe utmost skill from the actors.<br />\nSlatkin as \"Miss Immortality,\"<br />\nin \"A Roadhouse in Arden,\" and<br />\nWhite as \"Padie\" in \"A Death in<br />\nFever Flat,\" bid fair to live up to<br />\nthe greatest tradition of the club.<br />\nBoth make very attractive ladies,<br />\nbut \"Don\" Kirkley and \"Cleopatra FIamlet\" promises to be the<br />\nmost seductive thing this side of<br />\nthe Mohammedan heaven.<br />\nBuckheister and Hess have<br />\nheavy acting parts in the tragedy<br />\nand Hunter has to support most<br />\nof the comedy work in the burlesque.<br />\nHenry West and Eli Frank, Jr.,<br />\ncoached the plays.<br />\nThe curtain will slide at 815.<br />\n<br />\n- The Sophomore and Freshmen<br />\nteams are going through hard<br />\nPractices daily in preparation for<br />\nthe interclass game on Saturday.<br />\nThe Sophomores have been holding practice for over a week and<br />\ntheir team is beginning to round<br />\ninto form. The difficulty which<br />\nthe Sophomores must face is the<br />\nsame difficulty which has resulted so often heretofore in the defeat of a seemingly stronger team<br />\nby a materially weaker one on paper; the absence of teamwork.<br />\nStrenuous practices, however,<br />\nare erasing the rough spots and<br />\nthe second year team- is rapidly<br />\nrounding into condition. Many of<br />\nthe men who were out for the<br />\nVarsity are trying.for_ the team<br />\nand these meh are a big asset in<br />\nteaching some of their less experienced classmates some of the<br />\nfine points of the game.<br />\nThe Freshmen team has been<br />\nPracticing steadily and with each<br />\nPractice more improvement can<br />\nbe noticed. The Freshmen were<br />\nhandicapped this year by lack of<br />\ngames and were defeated in their<br />\nonly start by Severn School.<br />\nThey have shown a complete reversal of form since then, however, in several scrimmages with<br />\nlocal prep schools and the first<br />\nYear team now seems to be at the<br />\nCHRISTMAS COTILLON TO BE<br />\ntop of their form.<br />\nBRILLIANT AFFAIR<br />\nAt a meeting of the Cotillon<br />\nOn the line the Freshmen have<br />\nthree men who have displayed Board held on Thursday, Decemgood football throughout the sea- ber 1st, plans were made for the<br />\nson. Captain Summers at center Christmas Cotillon to be given on<br />\nhas shown himself to be a ca- December 21st, in the C. E. Hall.<br />\npable performer, as have Turnbull It was found necessary to make a<br />\nand Young from the Varsity change in the type of program as<br />\nSquad. Turnbull had a great deal the 0. D. K. Song Books, which<br />\nof experience in prep school and the Board intended to give as southe coaches consider him a prom- venir programs, will not be ready<br />\nising youngster.<br />\nfor publication until after ChristThe Sophomores, on the other mas. An order was accordingly<br />\nhand, have an extremely well bal- placed for a distinctive Hopkins<br />\nanced line. George Shriver at cen- souvenir program, which will be<br />\nter, Smallwood and John Shriver of more value than the ordinary<br />\nat guards and Meyer at end have dance card given at past cotillons.<br />\nall had experience under Coach A committee on decoration was alVan Orman. Hutzler and Raleigh so appointed, as it is planned to<br />\nat tackle, and Dunning at the have the hall festooned with disOther end are members of last tinctive Christmas decorations—<br />\nYear's Freshman team and are greens, holly, firs and mistletoe.<br />\nwell versed in the arts of the There. are to be eighteen dances<br />\ngam e.<br />\nwith supper served between the<br />\nThe backfields are more evenly ninth and tenth numbers, and as<br />\nmatched. In Merlees the first year Louis Fisher is to provide the mumen have an excellent punter as sic it is certain that the party will<br />\nwell as a man who can be relied be a success. The subscription is<br />\nupon for a substantial gain. Farb- to be $3.00 per couple and tickets,<br />\nman, Jones and Balsam are the which must be bought in advance<br />\nOther men who will probably start arid may be obtained from members<br />\nand they have shown excellent of the Board, starting this week.<br />\nform throughout the year.<br />\nIt has not been definitely de- GOV. RITCHIE FAILS TO APPEAR<br />\nAT ASSEMBLY<br />\ncided which men will compose<br />\nGovernor Ritchie, who was to<br />\nthe Sophomores' backfield, but it<br />\nWill probably be selected from speak at last week's assembly, was<br />\nMarchetti, Ellicott, Harwood, unable to attend, so Dean Latane,<br />\nafter announcing that for the next<br />\nLinbach and Ashton.<br />\nThe Sophs seem to have a two meetings interesting programs<br />\nSlight edge over the Frosh as to had been planned, and requesting<br />\nMaterial. Games cannot be played full attendance, dismissed the gathOn paper, however, and the supe- ering. Emil Smith announced the<br />\nrior teamwork of the Freshies will meeting on Friday of the Social<br />\nProbably succeed in causing a Science Club, to which young ladies<br />\nfrom Goucher had been invited.<br />\nContinued on page 3, co/. 3<br />\n<br />\nRelay Work.<br />\n<br />\nand Darley Have Two More<br />\nYears.<br />\n<br />\nat Princeton.<br />\n<br />\nThe possibility that a large conDuring the latter part of the<br />\ncrete<br />\nhorseshoe stadium, with a caNow that the battle is over and<br />\nmonth of November a group of<br />\npacity<br />\nfor 40,000 spectators, may<br />\nElectrical Engineering students we have only next year's season to<br />\nbe built at Homewood in the near<br />\ninterested in wireless telegraphy look forward to, the time seems future has been expressed by the<br />\nand kindred subjects and seeing ripe for a bit of biographical wan- officers of the Varsity Club and the<br />\nthat the University would be ben- dering. Just how many of our Homewood Company. A short<br />\nefited by increased activities along players will be back next year time ago the city officials, recogthese lines, met and arranged to (examination results not taken in nizing the need of the city for some<br />\nlarge arena to be used for athletic<br />\ninstitute an undergraduate radio consideration) \"how, where and<br />\ncontests and other great occasions,<br />\nclub. J. C. Hauf was elected the why\" they played previously and intimated that the Mt. Royal respresident and the charter mem- what other branches of athletics ervoir basin might be utilized for<br />\nbers of the newly founded club are they indulge in, few know.<br />\nthe location of a concrete bowl. The<br />\nFor<br />\npleasthis<br />\nreason<br />\nwe<br />\ntake<br />\nofficials of the Varsity Club heard<br />\nH.<br />\nVogel,<br />\nVanneman,<br />\nH.<br />\nD. K.<br />\npresent<br />\nin<br />\nthe<br />\npast,<br />\nure<br />\npresenting<br />\nof this move and realized that if<br />\nG. P. Fallon, C. Heusen, J. C.<br />\nany<br />\nsuch stadium is to be built<br />\nLewis, W. Weikel and G. C. Coo_ and future of each of the men<br />\nit<br />\nshould<br />\ncertainly be done by the<br />\nDr. Kouwenhoven has kindly con- taking part in games this year.<br />\ncity's only large university. They<br />\nThe first four men, whose lives<br />\nsented to assist the club in its<br />\naccordingly put forward a counwork and act as faculty repre- we will publish, are Capt. \"Bill\" ter project calling for a conTotterdale, Darley, Magill and crete stadium at Homewood, and<br />\nsentative.<br />\nThe club, which is simply Bonner, the \"all-Maryland\" selec- appointed a committee to look into<br />\nthe matter.<br />\nknown as The Radio Club, plans tion.<br />\nWilliam Grainger Totterdale, While it is admitted that the<br />\nto take an active part in national<br />\nproject is little more than a dream<br />\nradio activities and hopes to be- captain of our state champions, is<br />\nat<br />\nthe present time, some statistics<br />\ncomes one of the regular stations 21 years old and weighs 175<br />\non<br />\nthe size, cost and possible means<br />\nin transcontinental relay work. pounds covered, with mud. This is<br />\nraising money have been preof<br />\nThe station will be in entire his second year at Hopkins, he<br />\npared.<br />\nThe stadium would be in<br />\ncharge of the members of the club having spent two years at St.<br />\nform<br />\nof<br />\na gigantic horseshoe simand different groups will operate John's College, a school located<br />\nilar<br />\nto<br />\nthe<br />\none at Princeton, and it<br />\nthe instruments on certain nights somewhere on the Severn. He has<br />\nplayed in every game this season, would seat approximately 40,000<br />\nduring the week.<br />\nbut<br />\nthe first, at which date he was spectators. The closed part would<br />\nThe station, which is located in<br />\nout of luck. Altho be at the northwest end of the athacademically<br />\nthe M. E. Building, is exceptionalpresent<br />\nin Baltimore, letic field, while near the present<br />\nhe<br />\nlives<br />\nat<br />\nly well equipped with the most<br />\nBellefonte<br />\nAcad- main entrance to the field a large<br />\nat<br />\nprepped<br />\nhe<br />\nmodern, latest wireless apparatus.<br />\nThis<br />\nis<br />\nthe space would be reserved for the<br />\nPennsylvania.<br />\nemy,<br />\nThe transmitter is of a one-halt<br />\nUniversity gymnasium. In view of<br />\nhas<br />\n\"Bill\"<br />\nwhich<br />\nkw. quenched spark type with a second year in<br />\nthe fact that the stadium would<br />\ncensending range of 500 miles. The been selected all-Maryland<br />\naerials are stretched between the ter. His only other sport is tennis, pay for itself in a short time and<br />\nroof of thel I. E. Building and but due to the above mentioned the gymnasium would give no filuck he was unable to participate nancial returns, all money availthe powerhouse stack.<br />\nIt is hoped by the charter mem- last year. Mr. Totterdale reports able would be first used for the<br />\nbers that the club will become a that he will not be with us next stands. Such a stadium would cost<br />\nbetween $350,000 and $400,000. A<br />\npermanent institution and will in- year.<br />\nplan<br />\nfor raising this money which<br />\nGeorge Leslie Darley, our little<br />\ncrease to larger proportions in<br />\nthe future. At present. member- 145-pound quarterback, is not 20 has been formulated by the Varsity<br />\nship in the club is limited to Ju- years old and is in the first year of Club depends on the real interest<br />\nniors and Seniors only, but after a three-year engineering course. of Baltimoreans being behind the<br />\nthe activities have gotten well He is a Baltimorean and prepped project. If 20,000 people would<br />\nunder way the Sophomores and at Poly, where he played quarter- subscribe for one season ticket at<br />\nperhaps the Freshmen will be per- back for two years. He has played $10 for each of two years the $400,mitted to enter. Besides the prac- in every game this year. George's 000 would be raised and the statical work of the club, some time appearance at J. H. U. filled an dium paid for.<br />\nOther possible plans will be conwill be spent in carrying out origi- aching void on. the team and his<br />\nsidered<br />\nby the Varsity Club, chief<br />\nnal experiments. Under the gov- selection for the \"all-Maryland\"<br />\namong<br />\nwhich<br />\nis the location of the<br />\nernment license held by the sta- is proof of his ability at his posistands<br />\nin<br />\nthe<br />\nWyman Park bowl.<br />\ntion, any wave length desired may tion. He will return next year<br />\nIt<br />\nhas been reported that there is<br />\nbe employed in carrying out ex- and we hope the year after.<br />\nThe choice of James Isaac Bon- not enough space between the cinperimental work.<br />\nIn addition to the actual work ner for halfback on the mythical der track and University Parkway<br />\nin wireless telegraphy proper, the eleven meets the approval of all for the erection of such a stand,<br />\nclub plans to experiment with the Hopkins rooters. \"Buck\" is the and in this event another location<br />\nwireless telephone and other kin- speediest 145 pounds seen in togs must be found. Since the upper<br />\non Homewood Field for many a sections of the stadium would condred subjects.<br />\nday. He is 20 years old and is a sume a relatively large amount of<br />\nSophomore, his first year having the cost a suggestion has been made<br />\nMUSICAL CLUB ON THE ROAD<br />\nbeen spent at the University of that only a part large enough to<br />\nAt Big Springs High accommodate 20,000 be built and<br />\nof<br />\nTexas.<br />\ncomposed<br />\nMusical<br />\nClub,<br />\nThe<br />\nJazz<br />\nSchool where he prepped he the remainder added later.<br />\nthe Glee Club, Mandolin Club,<br />\nThe real need of such a stadium<br />\nOrchestra and the Hawiian Trio, played end and halfback. He was<br />\nSprings,<br />\nhas<br />\nbeen fully realized for some<br />\nwill journey this evening, Decem- born and bred in Big<br />\nber 6th, to Evergreen, where they where boys awake at the kick of a time and, with the view of taking<br />\nwill render their opening concert steer. He at present calls Texar- definite action, a committee comof the season. This concert is given kana home. He has participated in posed of Dr. Thomas R. Brown,<br />\nfor the benefit of the blind soldiers five games this season and will re- chairman; Dr. Ray Van Orman,<br />\nand Dr. Eveleth Bridgman has<br />\nat Evergreen. On Saturday, De- turn next year for nine more.<br />\nThomas P. Magill, the infant been appointed by the Varsity Club.<br />\ncember 10th, the club will give<br />\na concert at McDonough. The prodigy of the all-state collection, On Monday night a conference of<br />\nconcerts are to be followed by is 18. years old and weighs.165 this committee and a similar one<br />\na dance. All Hopkins men are cor- pounds. This is his first year at of the Homewood Club was held<br />\nHopkins where he hopes to re- and the action taken there will soon<br />\ndially invited to attend.<br />\nThe concert at Evergreen was to main four years. He is a graduate be divulged. In the meantime, Dr.<br />\nhave been held on November 28, of Baltimore City College where Van Orman is corresponding with<br />\nbut because of insufficient practice he played tackle for two years. other institutions with the view of<br />\nand because other minor arrange- He has played in every game this obtaining data and other informaments had not been made, it was season, remaining out of only a tion about different types of sta• diums.<br />\nContinued on page 2, col. 5<br />\nthought best to postpone it.<br />\n<br />\n\f2<br />\n<br />\nThe Johns<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 6, 1921<br />\n<br />\nHopkins News-Letter<br />\n<br />\nLECTURES<br />\n<br />\n1 . 1 \"PREACHERS' CLUB\" NOW \"CHRISSERVICE CLUB\"<br />\n<br />\nIII<br />\n<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\n<br />\nAt a recent meeting of the<br />\nPreachers' Club, the members de- A Column in Which the Correspondents<br />\nAre Allowed Latitude, But ShoulSubscription<br />\n$2.50 ZIONIST CLUB SECURES LECTURER cided to change the name of their<br />\nder the Responsibility.<br />\nJudge Jacob Moses, formerly<br />\ntheir<br />\nalthough<br />\nAll letters intended for publication<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at judge of the Juvenile Court, now organization,<br />\nmust be concise,'written in ink on<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nconstitution has been only slightly<br />\nregular letter size paper, on one side<br />\nchairman of the Maryland Labor changed from<br />\nonly.<br />\nthat of last year.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nNo attention will be paid to anonyArbitration Board, will address the<br />\nHopkins University.<br />\nThe purpose of the Christian Sermous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nSociety<br />\nJohns<br />\non<br />\nHopkins<br />\nZionist<br />\nBusiness communications should be addressed to the BUSINESS MANvice Club can best be stated by<br />\nprinted if request is made that they be<br />\nomitted.<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications Wednesday, December 7, 1921, at<br />\ncona<br />\nphrase<br />\nquoting<br />\nfrom<br />\ntheir<br />\nThe publication of a letter is not to<br />\nshould be sent to the MANAGING EDITOR.<br />\n.12.30, in the hall of the Mechanbe taken as an indorsement of its views<br />\nstitution: \"The purpose of the club<br />\nby<br />\nthe \"News-Letter,\" which invites the<br />\nTelephone<br />\nHomewood 100 ical Engineering Building. Judge<br />\nfreest discussion 'of matters of general<br />\nshall be to promote closer Christian<br />\nInterest.<br />\nMoses will be the first of a series association among its<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nmembers and<br />\nof<br />\nspeakers to address the Zionist to interest men in<br />\nH. DOUGLAS COTTON,'22.<br />\nFREDERICK W. LIPPS, '22.<br />\nChristian living REMEMBER MEDICO, \"MUSIC HATH<br />\nManaging Editor:<br />\nSociety this year. The coming of and definite life service.\"<br />\nITS CHARMS\"<br />\nTo carry<br />\nWILLIAM H. MOORE, JR., '23<br />\nCirculation Manager:<br />\nUniversity will<br />\nthe<br />\nMoses<br />\nJudge<br />\nto<br />\nTo<br />\nthe<br />\nEditor<br />\nof the News-Letter:<br />\nout the purpose of the club, the<br />\nAssociate Editors:<br />\nGLOVER P. FALLON, '23.<br />\nbe quite an event, and a large at- program committee arranges speakEDWARD G. HUEY, '22.<br />\nThe present year is already<br />\nELI FRANK, JR., '22.<br />\nAdvertising Manager:<br />\ntendance is expected. It is re- ers for<br />\nmeeting.<br />\neach<br />\nThe<br />\nnext<br />\nshowing<br />\nJunior Editors:<br />\nmanifestations which inDONALD K. VANNEMAN, '23.<br />\nquested that all who attend the meeting will be<br />\nCHARLES C. MARSURY, '22.<br />\nheld December 5th, dicate that it will not differ<br />\nfrom<br />\nJ. BRENTNALL POWELL, '23.<br />\nmeeting be in their seats by 12.30. at the home of<br />\nAssistant Business Managers:<br />\nMr. S. K. Wallace,<br />\nCRAIG E. TAYLOR, '24.<br />\nthe<br />\npreceding years in the amount<br />\nBERNARD C. HEARN, '23.<br />\nEverybody is welcome.<br />\nJ. HUDSON HUFFARD,'23<br />\ncorner of Walbrook Avenue and<br />\nJOHN C. LEWIS, '23.<br />\nJOSEPH S. LEOPOLD, '24.<br />\npleas,<br />\nof<br />\ndiscourses, appeals and<br />\nPoplar Grove Street. •The Rev.<br />\nDR. ROBINSON LECTURES<br />\nFITZGERALD DUNNING, '24.<br />\nDONALD H. KIRKLEY, '25.<br />\nRIGNAL W. BALDWIN,. JR., '23<br />\nDr. David M. Robinson deliv- Dr. McComb will address the mem- weekly harrangues on the timeered the opening lecture under the bers of the club. After the address worn subject of college spirit.<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nHoover Foundation of Roanoke a general discussion of topics will Must we again listen to athletic<br />\nCollege last Friday evening. His be led by Mr. Custer Cromwell.<br />\nmanagers, team captains and<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ntopc was \"Ancient Cities of Asia<br />\nThe meeting following Decemcoaches imploring us to come out<br />\nMinor.\" Dr. Robinson is widely ber 5th will be devoted to the study<br />\nfor<br />\nBALTIMORE, MD., DECEMBER 6, 1921<br />\nteams, attend games and be<br />\nknown as an authority on arch- of religious leaders during the<br />\npresent<br />\nat mass meetings and then<br />\naeology, and has made extensive Reformation. It will be the aim<br />\ncontributions to the subject, both of the speakers to criticise the re- witness now as before the failure<br />\nA STADIUM AT HOPKINS?<br />\nby explorations and in publications. 4-A--NEWS-LETTER<br />\nof these attempts. One need not<br />\nOnce again the question of a stadium for Baltimore, which the Through his excavation at Corinth formers, to call attention to their look far for the reason. Let us reNews-Letter suggested last spring, has been brought before the and Sardes and his acting as editor mistakes and take the good acts in call an<br />\nincident that occurred last<br />\npublic—this time in a more definite form than previously. Under the for \"Art and Archaeology,\" and their lives as examples of courage,<br />\nspring. The authorities reciuested<br />\nauspices of the city authorities, the municipal engineers are inspecting \"American Journal of Philology,\" truthfulness, etc.<br />\nDr. Easton, of Homewood Chap- Mr. Ralph Bowers to see what<br />\nthe Mount Royal Reservoir in order to determine whether the erec- and as president of the College Art<br />\ntion of a stadium in it is feasible. The plan of the city to provide Association of America. This lec- el (M. E. Church), 33rd Street, could be done on the question of<br />\na stadium for Baltimoreans is indeed praiseworthy, and, we believe ture, accompanied by illustrating near Charles, has given an oppor- organizing a band. Without any<br />\npractical. Baltimore, by virtue of its geographical situation is an ideal slides, has been given in many of tunity to the members of the club undue exhortation on the part of<br />\nto lead a meeting open especially Mr. Bowers there assembled at the<br />\nlocation for intersectional contests. On account of its proximity to the largest Eastern universities.<br />\nThe Hoover Foundation at Ro- for young people at his chapel ev- first rehearsal more men than<br />\nWashington, the Army and Navy games and other military contests<br />\nmight in all. probability be secured. The advantages which would be anoke College was established sev- ery Sunday afternoon at 4 P. M. were required. As a result of hard<br />\nderived by Baltimoreans from the scheduling of such contests are eral years ago by Col. A. Pearson The club has taken charge of these and consistent practice the band<br />\ninnumerable. Why, however, should the city authorities turn to Hoover,'01, of New York. All lec- meetings for the past three Sun- was in condition to play at the<br />\nthe Mt. Royal Reservoir or Clifton Park? Why should they not co- tures are a part of the community days. Refreshments are served af- games and proved a vital 'factor<br />\noperate with Hopkins and build their proposed new $350,000 stadium service of the college and are very ter the meetings. Hopkins stu- in our baseball victory over Navy.<br />\ndents are cordially invited to at- Why did men who had previously<br />\nat Homewood? To quote Dr. Bridgeman: \"The ground upon which popular with the public.<br />\nnever displayed any college spirit<br />\ntend.<br />\nthe stadium is to be built will have to be thoroughly drained. At<br />\nFIELD CLUB HOLDS MEETING<br />\ncome<br />\nout for the band? Above all,<br />\nHomewood a thorough system of draining pipes undermines the<br />\nQuoting<br />\nfrom<br />\nthe<br />\nconstitution:<br />\nOne of the most interesting lecwhole athletic field already and it is known as one of the best play- tures of the year was enjoyed by \"Active members must be bona why did the student body support<br />\ning fields in the country. Then the building of a track which takes the Field Club on Wednesday, No- fide students of J. H. U. All men the band by attending rehearsals.<br />\nabout a year to lay is an expensive proposition. In addition the field vember 30, at which Mr.. A. D. will be eligible for membership who whereas they rarely are present<br />\nat Homewood has been sodded. For all these reasons it would be Shaftesbury, one of our post grad- are proposed by the membership at football or baseball practice?<br />\nmuch cheaper to build a stadium there than any other place. There uate biology students addressed the committee.<br />\nProposed members Mr. Bowers succeeded and athletic leaders failed under apparently<br />\nHopand<br />\nJohns<br />\ncity<br />\nthe<br />\nbetween<br />\nco-operation<br />\nof<br />\nkinds<br />\nall<br />\nwould be<br />\nclub on \"The Habits of Bees.\" Mr. must be approved by two-thirds of<br />\nalmost<br />\nbuild<br />\nwilling<br />\nsimilar<br />\nto<br />\nwould<br />\nbe<br />\nconditions. The latter conWe<br />\ndo<br />\nthis.<br />\nkins if they desire to<br />\nShaftesbury is especially fitted for the members before being fully adtinually<br />\nutilize.\"<br />\nbeseeched us for help and<br />\nanything the city should desire to<br />\ngiving a talk of this type, as he mitted to the club.\" The officers<br />\nyet<br />\nfail<br />\nto even recognize their<br />\nare:<br />\nHow about it, City?<br />\nPresident,<br />\nP.<br />\nB.<br />\nStevens;<br />\nvicehas devoted extensive study and<br />\nhas had much practical experience president, S. K. Wallace; secre- classmates on the campus. Stutary C. P. Sylvester; treasurer, W. dents will never come out for<br />\nalong this line.<br />\nthing as a friendly salutation. We<br />\nThe talk was illustrated by many F. Wheeler.<br />\nWE WANT THE MINOR SPORTS<br />\nare tired of the type who go<br />\nNew<br />\nmembers<br />\nare:<br />\nG.<br />\nConning,<br />\ninteresting slides which represented<br />\nthrough four years of college amid<br />\nWe learn with regret that there is a possibility of the minor aspects of bee culture as it is car- G. Cobb.<br />\nThe old members • are: W. R. a small circle of friends and when<br />\nsports being discontinued through the winter. Such a course, we ried on in different parts of our<br />\nbelieve, would be unwise and should be adopted only as a last re- country. He contrasted modern im- Barnhart, G. C. Cromwell, H. M. the time arrives expect every man<br />\nP. Martin, J. D. Garrett, D. W. to respond to their appeals. Husort. We all know that better spirit has been displayed this fall by provements with the older methJustice, J. C. Lewis, W. A. Price, man nature revolts against such<br />\nthe undergraduates than ever before. We would not like to see this ods in the field. The life of the<br />\nundemocratic actions. The stuhoney bee was set forth in a fas- W. C. Roberts, 0. G. Robinson.<br />\nspirit die or even pass into a period of coma from which it would<br />\ndent body will only support leadcinating manner which held the in- sidering all operating conditions.<br />\ners who devote their efforts for<br />\nhave to be revived next spring. The discontinuance of basketball terest<br />\nof the audience. Many unThe items of location of stations, the<br />\nglorification of Hopkins and<br />\nwould probably bring about such a situation. Although money is familiar facts were told concerning<br />\nvariable loads, power input, rotary not for self ho.nor.<br />\nThat is why<br />\nexceedingly scarce on the campus we believe that the majority of the social organization and instincts converters, switchboards,<br />\netc., will Mr. Bowers and the band attained<br />\nthe students and at least those who patronized the games and informal of this interesting and important be very carefully discussed.<br />\nsuch a remarkable success. ColThis meeting will be an open leges as small<br />\ndances at the Armory last year, would be willing to subscribe to insect. The duties and care of the<br />\nas Hopkins have<br />\nqueen, the rearing of the larva from one, and the engineering faculty<br />\nminor-sport tickets, rather than see these sports dropped.<br />\nachieved enviable athletic records<br />\negg to adult, construction of the and student body are extending a<br />\nwithout employing professionals.<br />\ncomb, storing of honey, swarming cordial invitation to attend. A reLet us not forget the example<br />\nP. T. CLASS TAKING UP MANLY and inhabiting the hive, together<br />\nHOPKINS MEN LEAD ARMY<br />\ncord crowd is expected.<br />\nmade by the band, but continue<br />\nART<br />\nCHEERING<br />\nwith related instincts were discusto work in the same footsteps.<br />\nLong,<br />\nCaptain<br />\nof<br />\nthe<br />\nR.<br />\n0.<br />\nT.<br />\nC..<br />\nleaders,<br />\nsed<br />\ncheer<br />\nin connection with their biologstar<br />\nHopkins<br />\nSCIENTIFIC SOCIETY LECTURE<br />\nPhilip E. Rothman,<br />\nDr. E. A. Andrews, professor<br />\n\"Bill\" Engel and \"Don\" Vanne.- the sponsor of the plan to introduce ical significance.<br />\n*Class of 1925, J. H. U. Medical<br />\nMr. Shaftesbury emphasized the of zoology, at this university, will<br />\nman, not only led cheers for Army boxing in the physical training<br />\nSchool.<br />\nfact that bee keepers are not the deliver a- lecture today before the<br />\ncourses,<br />\nreports<br />\nthe<br />\nclass<br />\nas<br />\n\"carat<br />\nstyle<br />\nspectacular<br />\nusual<br />\ntheir<br />\nin<br />\nones who receive the greatest ben- Scientific Society. The subject of<br />\nthe big game Saturday, but they rying on.\" The handicap of teach- efiit from his industry, but the Dr. Andrews' lecture will be the<br />\nTHREE ALL-STARS TO RETURN<br />\ning<br />\neven<br />\nthe<br />\nrudiments<br />\nof<br />\nthe<br />\nmanpreparations<br />\nall<br />\nof<br />\ncharge<br />\nContinued from page 1<br />\nalso took<br />\nneighboring orchard owners derive \"Bottle Animalcule,\" a micro-organism which inhabits the waters portion of the Swarthmore game,<br />\nfor the rooting, which so surprised ly art without the proper equip- even greater profit.<br />\nment, including the almost necesof nearly all parts of the world and when the referee found that he<br />\nthe big crowd by its excellence.<br />\n\"RAILWAY SUB-STATIONS\" TOPIC ...rows in a form<br />\nsimilar to that had the best of a fight with his<br />\nsary<br />\ngloves,<br />\nis appreciated, but,<br />\nTO BE DISCUSSED AT ELECVanneman went down to Camp<br />\nof<br />\na<br />\nbottle.<br />\nThe<br />\nTRICAL<br />\nCLUB<br />\nmeeting<br />\nof the so- opponent.<br />\nMeade, Friday, where he put over nevertheless, there exists a \"will,\"<br />\nA very interesting talk will be ciety will be held at 4.15 in the<br />\nIt is with a great deal of satis500 men through their paces, and so the way is being provided. The delivered on Friday, December 2, large lecture room, Room 110, in faction that we<br />\nnotice that three<br />\n\"Bill\" Engel coached a like num- R. 0. T. C. staff has a way of gen- by Mr. Warren Viessman, upon the<br />\nMechanical<br />\nEngineering of our all-state selections will<br />\nber at Camp Holabird. In addi- erally accomplishing what it sets \"Railway Substations.\" The speak- Building. All members of the fac- have at least three more years at<br />\ntion to this, Engel adapted all their out to do and this fact would seem er will have a number of notes on ulty and students interested in J. H. U. They will be needed if<br />\nsongs and yells for them and plan- to be borne out in the progress of this topic, and from these he will this subject are invited to attend rumors concerning next year's<br />\nthe trial of the boxing course discuss converter substations, con- the lecture.<br />\nned all their demonstrations.<br />\nschedule are at all well founded.<br />\nFOUNDED 1897.<br />\n<br />\n40.1./111.1.,<br />\n<br />\na —<br />\n<br />\n•••01.1.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 6, 1921<br />\nMAILBAG CONTINUED<br />\n<br />\nA. A. BOARD HOLDS MEETING<br />\n<br />\nAt the last meeting of the A. A.<br />\nBoard, called to order by President Knecht at 12.20 in the athletic office of the barn on Monday, November 21, it was decided<br />\nto take definite action regarding<br />\nthe awarding of gold footballs to<br />\nthose Hopkins football men who<br />\nhelped to win the state championship. It has always been the<br />\ncustom in the past to award some<br />\nsuch emblem to the members of<br />\nstate championship teams and the<br />\n:ustom will be continued this year.<br />\nIt has not yet been determined<br />\nhow the emblem will be obtained.<br />\nThe footballs will either be donated by some philanthropically<br />\ninclined graduate or will be purchased with funds collected by<br />\npublic subscription of the student<br />\nbody. The men who will receive<br />\nthe emblems will be those who<br />\nparticipated in the St. John's<br />\ngame and also any who are awarded the \"H\" but still did not play<br />\nagainst St. John's.<br />\n<br />\nFRESH-SOPH FOOTBALL GAME<br />\nContinued from page 1<br />\n<br />\nORTMAN'S<br />\n<br />\nMt. Vernon 4999<br />\n<br />\ngreat deal of trouble for their tor- \"Queen Quality\" Home Made<br />\nChocolates<br />\nmentors.<br />\nVISIT OUR ICE CREAM PARLORS<br />\nThe committees in charge plan<br />\n518 N. CHARLES ST.<br />\nCommercial Photography<br />\nto make the day a memorable one<br />\nCircuit Photography<br />\nfor Fresh-Soph games. Letters<br />\nViews<br />\nFlash Lights<br />\nhave been sent to the prep schools<br />\nCharles and 22nd Sts.<br />\nEnlargements<br />\nGroups<br />\nthroughout the city, male, female Delicious Sodas and Sundaes<br />\nKODAK FINISHING<br />\nThe Best of Candies<br />\nthem<br />\ninviting<br />\nco-educational,<br />\nand<br />\n325 N. Howard St.<br />\nPrompt & Efficient Service<br />\nb attend the game,and it has been<br />\n<br />\nW.L. Mann<br />\n<br />\nTo the Editor News-Letter,<br />\nDear Sir:<br />\nThis year's Freshman Class inaugurated what may become in<br />\nthe course of time a permanent institution at Johns Hopkins—a<br />\nFreshman \"Pep\" Committee. The<br />\nmotives which prompted the appointment of such a committee<br />\nare commendable and the class<br />\ndefinitely decided to hold a dance<br />\ndeserves credit. The purpose of<br />\nin<br />\nthe C. E. Hall after the rush<br />\nthis body, however, seems idealis1 W. University Parkway<br />\nST. PAUL & 24th STS.<br />\nsimilar to those held heretofore by<br />\ntic and, so far, has proved imOpposite J. H. U. Athletic Field<br />\nC. D. Wolfe, Prop.<br />\nthe Cotillon Board, for which a<br />\npracticable. From time immemorial it has been the custom for the<br />\nfee of 50 cents will be charged to DELICIOUS SODAS & SUNDAES DRUG STORE for J. H. U. BOYS<br />\nMade With<br />\nSophomore class to see that the<br />\nPHONE, HOMEWOOD 2121<br />\ncover expenses. Admission to the<br />\nJersey Special Ice Cream<br />\nregulations imposed by the Stugame will be free and the public is<br />\n\"The Velvet Finish\"<br />\ndent Council were enforced and it<br />\ninvited. A large crowd is expected KODAKS CAMERAS SUPPLIES Buy an (H) Pipe made special<br />\nis always difficult to change custo be on hand and enjoy the game Whitman's Chocolates and Bon Bons<br />\ntoms.<br />\nfor the Boys<br />\nand ensuing rush.<br />\nThe first-year men can see that<br />\nthey, individually, adhere to regulations; to be responsible for<br />\ntheir fellow classmates, however,<br />\nYoung Men's Clothing<br />\nis an ideal which probably will<br />\nand Furnishings<br />\nnever be attained.<br />\nThere are means, however, by<br />\nThe various committees on se- Are made a special feature of<br />\nwhich the \"Pep\" Committee may lecting coaches for the teams rehere.<br />\nassist certain individuals, may aid ported their efforts, but as yet no<br />\ntheir class and may help mate- definite coaches for baseball, basrially the University as a whole. ketball, swimming or lacrosse Give us a call and let us become<br />\nEnglish Clothes Tailored in America<br />\nWe will quote an example of a have been appointed. The com- better acquainted for mutual<br />\nFOR SPORT, DRESS, SOCIETY<br />\nHABERDASHERY<br />\nFreshman who has been brought mittees are: Baseball, Sharretts<br />\nbenefit.<br />\nto the notice of the Sophomores<br />\nand Knecht; Basketball, Landy<br />\nHe—Where do you bathe?<br />\nORDERS RECEIVED FOR<br />\nupon several occasions. Up to the and Totterdale ; Swimming, MidWashington and Lee game he had dleton and Edwards; Lacrosse,<br />\nShe—In the spring.<br />\nCOGGINS'<br />\nnot attended a single contest at Bowers '20 and Griffiss '20.<br />\nHe—I didn't ask you when. I Transfer and Baggage Express<br />\nHomewood Field. When asked<br />\nCo Car:4.1011 WIth Jam.dicCrterg & Co.. Weto York.<br />\nasked you where.<br />\nAUTOMOBILE SERVICE<br />\nfor an explanation he told of<br />\nAfter allowing the question of<br />\nat<br />\nLexington<br />\nHoward<br />\n—Cornell Widow.<br />\nclasses on Saturday afternoon. disputed track letters to hang fire<br />\nPHONE, HOMEWOOD 2645-W<br />\nUpon investigation it was found for some time this year it was finthat his classes were strictly vol- ally decided that there would be<br />\nuntary and that they were over in no additions to the list of \"H's\"<br />\ntime for him to attend the games. awarded last spring. However, the<br />\nHOUSANDS of smokers have proved it—and now give the verdict<br />\nFor certain reasons, good rea- men in dispute were awarded the<br />\nto you — Of all the other tobaccos NATURE has produced—none<br />\nsons, he attended the Washington official \"H. A. A.,\" which almost<br />\nand Lee game but was discovered equals the \"H\" in difficulty to win<br />\ncan approach the finest varieties of pure Turkish for cigarettes—<br />\nin the thrilling fourth quarter and honor to the wearer. The final<br />\nNone has the delicious<br />\nstanding in the next section to list of men receiving the \"H. A.<br />\nthat reserved for rooters, with a A.\" in track for the season of 1920FLAVOR of the finest Turkish—<br />\nbored expression on his face. 21 are: Hearn, '23; Hutzler, '24;<br />\nNone gives the ENJOYSounds never crossed his lips.<br />\nCannon, H. E., '23; Hambleton,<br />\nMENT of the finest Turkish—<br />\nFor another good reason he '22; Calkins, '20; Milligan, '22;<br />\nand<br />\nsection<br />\n'24;<br />\nmoved to the rooting<br />\nVan Ness, '20; R. Norwood,<br />\nNone will SATISFY you as<br />\nfor other reasons equally as good V. H. Norwood, '20; R. G. Heinwill the finest Turkish—<br />\nhe was seen to open his mouth er, '20.<br />\nvolnow and then to emit a small<br />\nNone but the highest grade<br />\nnine of sound. Often he was seen<br />\nand personally selected<br />\nto applaud at the wrong time, but<br />\nBLACK AND BLUE JAY<br />\nTurkish tobaccos is used in<br />\nthat was only because he did not<br />\nyet<br />\nnot<br />\nhave<br />\nwho<br />\nmen<br />\nAny<br />\nFor that,<br />\nunderstand football.<br />\nMURAD.<br />\nhowever, he could be easily for- turned in a subscription for the<br />\nTo enjoy 100% pure Turkish<br />\ngiven. It is not a knowledge of Black and Blue Jay for their girls<br />\nat its VERY BEST—to reach<br />\nfootball that must be instilled ; it will certainly not hesitate after seeis Hopkins spirit that he needs—<br />\nthe PEAK of Cigarette Quality<br />\ning the \"Changing Times\" numthat he must have. And there are<br />\n—you have but to smoke<br />\nber that appeared last week. The<br />\nothers like him.<br />\nhas<br />\nMURAD—<br />\nThis type presents a difficult -irculation manager of the Jay<br />\ncopno<br />\nthat<br />\nthe<br />\noffice<br />\nwhich<br />\nproblem<br />\nthis<br />\nproblem—a<br />\ninformed<br />\nTry MURAD today and<br />\nSophomores have been unable to ies of the new issue have yet been<br />\nsolve.<br />\n\"Judge for<br />\nmailed to outside subscribers, and<br />\nmentioned<br />\nFreshman<br />\nThe<br />\nYourself—!\"<br />\n.r..1.4:14,4,t4-„,:;:zirizaA17.4.4:344a,Lanc.u..1.:4.7.5.4uvalcaram-wyrr.<br />\nis still plenty of time (if you<br />\nabove is utterly devoid of Hop- there<br />\natli<br />\nZ<br />\nsubVSPIZCHUITUSCUIM4VAK7142421,<br />\nkins spirit. Classes- are necessary act quick) to start your girl's<br />\n.<br />\nZaWSIAnaleZ*141:041CY.A<br />\nnumnew<br />\nto<br />\nsnappy<br />\nand this article is not written<br />\nscription with the,<br />\nadvocate cutting. But when St. ber. As the next edition will not<br />\nJohn's is playing at Homewood— appear unfil the middle of Janwell, it would be rather difficult to<br />\nuary, it is the last chance to turn<br />\nPersuade a Hopkins man with<br />\noutside subscriptions and have<br />\nSpirit to go to a class. Try and get in<br />\nthe recipients of your gifts derive<br />\nhim !<br />\nThe usual methods employed in the full benefits of the magazine.<br />\nremonstrating have failed utterly Subscriptions can be handed in at<br />\nin this case. This type regards the Jay's office in the Barn any<br />\nSophomores as monsters put on<br />\nday during dinner time, and to<br />\nearth to worry Freshmen and no<br />\nSingewald at any other<br />\namount of words, threats or en- Quentin<br />\ntreaties would carry the slightest time during the day.<br />\nWeight with them. The SophoMakastkellieigaier.6A<br />\n.41174471.04 and<br />\nE99pt.,(9.11,,,tivW<br />\nmores must appeal to the Freshold<br />\ngood,<br />\nlittle<br />\ncommand a<br />\ntheir<br />\nmen for help.<br />\nHere's where the Freshman Hopkins spirit. Here's a chance<br />\n\"Pep\" Committee enters. They are to help old Johnny Hopkins,<br />\nthe logical ones to seek the Fresh- Freshmen. Go to it!<br />\nmen belonging to above-illustratYours for Hopkins spirit,<br />\ned type, to speak to them and to<br />\nSophomore \"Pep\" Committee<br />\ninstill into them by any means at<br />\n<br />\nChelsea Pharmacy<br />\n<br />\nThe College Drug Store R. G. by & Company<br />\n<br />\nClothes f Cusioltt (Oluality.<br />\nCharles Street.<br />\n<br />\nSTEWART& 11.<br />\n<br />\nT<br />\n<br />\n20c<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 6. 1921<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\n<br />\nATHLETIC GOSSIP<br />\nAn organization meeting of lacrosse candidates will be held at<br />\n4.10 P. M. tomorrow in Room 110<br />\nin the Mechanical Engineering<br />\nBuilding.<br />\n<br />\nDISTINGUISHED GUESTS DINE IN<br />\nGILMAN HALL<br />\n<br />\nThe Home of<br />\n<br />\nOn account of the inability of<br />\nPresident<br />\nGoodnow to arrange PerComplete Stock of<br />\nMedical Books and College<br />\nsonally the reception of the guests<br />\nRequisites<br />\nat the dinner in Gilman Memorial<br />\nroom last Saturday, immediately<br />\nImporters and Dealers in Fine Books<br />\nThe interest of Hopkins stu- preceding the game between the<br />\n301 N. CHARLES ST.<br />\ndents in last Saturday's Army- Third Army Corps Area and the<br />\nBaltimore, Md.<br />\nMarine game was• somewhat Quantico Marines, the details of<br />\nslackened by the exaggerated entertaining the distinguished vis\"scare-head\" report in the \"Sun\" itors were left to Dr. Raney. Presof a bitterness of the Marine to- ident Goodnow attended the instalward the University. This most lation of Dr. David Kinley as presdestructive bit of publicity was en- ident of the University of Illinois.<br />\ntirely unfounded. A representative Dr. Kinley is a Hopkins man, and<br />\nof the News-Letter interviewed a since President Goodnow wished to<br />\nnumber of Marines and reported be present at his installation, he did<br />\nbeXatterie<br />\nM ES 1.1.5, OSCAR G.L.SNIY<br />\nthat they knew nothing of any un- not return to Baltimore until just<br />\npleasantness, previous to the before the buffet luncheon given<br />\noWNERS<br />\nabove publicity. As to the guaran- by the city authorities to the visit2'f71113Por4<br />\n29 Baltimore St., East<br />\ntee, it was offered voluntarily by ing celebrities, among whom were<br />\nOne Door West of Light St.<br />\nthe Marine authorities; as to the General Pershing, Secretary of<br />\nSOLE AGENTS FOR BALTIMORE<br />\nejection<br />\nof Marines at the St. War Weeks, and Secretary of<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\nJohn's game, there was not a sin- Navy Denby, and many members<br />\ngle uniformed man ejected or of the House and Senate. The FALL LACROSSE PRACTICE STARTS<br />\nThe Chas. Willms Surgical<br />\nThe Marines had the reading room was closed at 12<br />\ncharged.<br />\nInstrument Co.<br />\nLacrosse practice has started up<br />\nBaltimore,<br />\nMd.<br />\nof<br />\nthe field through a o'clock and the passage from GilST.,<br />\nfreedom<br />\nHOWARD<br />\nN.<br />\n300<br />\nSURGICAL INSTRUMENTS<br />\nsmall entrance of their own. The man Memorial room was banked again in full force, now that the<br />\nMEN'S SHOES<br />\nMicroscopes and Supplies,<br />\nreport was a most unfortunate with flowers. Fisher's Orchestra fraternity rushing season is over,<br />\nStethoscopes<br />\nOf the Better Class<br />\nBlood Lancets and damaging one. Hopkins was furnished the music for the occa- and practice will keep on as long<br />\nBlood Counters<br />\nnot only morally with \"the boys,\" .sion.<br />\nas the weather permits.<br />\nbut came out last Saturday and<br />\nPrinters of Philological and<br />\nrooted during the entire game in<br />\nMr. Hubbard will talk on the<br />\nIt is hoped that the new men will<br />\nURNER BROTHERS<br />\nScientific Works<br />\nwhich the \"devil-dogs\" downed \"Use of the Triaxial Diagram in<br />\n111<br />\nE. BALTIMORE STREET<br />\nattend<br />\nfall<br />\npractice<br />\nfaithfully.<br />\nThe<br />\n23 S. HANOVER ST.<br />\nthe Army team, 20-0.<br />\nBALTIMORE<br />\nSelecting and Proportioning Sand main essential in lacrosse is for a<br />\nBaltimore, Md.<br />\nin Asphalt Construction.\" Most of<br />\nLast Saturday morning another<br />\nman to learn to handle his stick,<br />\nMr. Hubbard's conclusions on this<br />\nCANE CLUB TAPPING<br />\ngrid battle took place on Strauss<br />\nimportant subject are his own and and when he gains this knowledge<br />\nField. The Electrical Engineers<br />\nThe Cane Club will have a tapare the results of much original the rest comes easily.<br />\ndowned the Mechanical Engineer<br />\nwork.<br />\nManager Collins requests all men ping on Friday, with a dance to<br />\n6-0. Rowland carried the ball over<br />\nThis is the second public meet- to be sure and take their physical follow in the evening. The same<br />\nthe line as Referee Jake Miller's<br />\ning arranged by the American So- examinations.<br />\nThey will not be unique ceremony as characterized<br />\nwhistle called the game to an end.<br />\nlast year's introduction of new<br />\nciety of Civil Engineers, the first<br />\nTurner, Strott and Milligan<br />\nallowed to play until they have<br />\nmembers will be observed. A meethaving been addressed by Bancroft<br />\nstarred for the M. E.'s, while<br />\nHill, a Hopkins man, now harbor passed the required grade and their ing was held on Wednesday to<br />\nSchutze, Rowland and Baugh17 E. Baltimore St.<br />\nengineer of Baltimore, who talked names will be dropped from the roll arrange the final details of the<br />\nmann earned the E. E.'s their victapping.<br />\nif they do not make the grade.<br />\non \"Harbors.\"<br />\ntory.<br />\n<br />\nThe Overcoat<br />\n<br />\nYouthful novelty o'coats, with<br />\nstylish raglan shoulders, roomy<br />\narmholes, of soft, warm materials<br />\nUnmatchahle values!<br />\n$35 and up<br />\n<br />\nCli<br />\n<br />\nCLOTHES<br />\n<br />\n211-213 E. Baltimore St.<br />\n<br />\nURNER'S<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br />\n<br />\nTEN YEARS AGO AT J. H. U.<br />\n<br />\nDecember 4, 1911<br />\nSophomores defeat Freshmen in ,<br />\ninterclass football game, 24-0.<br />\nClass rush called off by order of<br />\nDr. Abercrombie because there<br />\nweren't enough freshmen in condition.' Impromptu rush held in<br />\nwhich freshmen succeed in retaining most of the flag.<br />\nCotillon Board announces first<br />\ndance to be held on December 8.<br />\nThe program was given as follows:<br />\nSousa<br />\n1. Two Step<br />\n2. Waltz...Count of Luxemburg<br />\nCollege Literature<br />\n3. Varsoirenne.<br />\nLOMBARD and SOUTH STREETS<br />\n4. Two Step....The Loving Man<br />\nThe Siren<br />\n5. Waltz<br />\nThe Spring Maid<br />\n6. Waltz<br />\n7. Two Step0, You Beautiful Doll<br />\nTeach a Lesson in Style<br />\nRed Widow<br />\n8. Waltz<br />\nThey possess the \"dash\" that<br />\nRoll<br />\n.0ceanna<br />\n.....<br />\nTwo<br />\nStep.<br />\n9.<br />\nappeals to college men, toned<br />\ndown to distinctiveness. And<br />\nPink Lady<br />\n10. Waltz<br />\nwearing qualities that provoke<br />\n11. Waltz...The Balkan Princess<br />\nenthusiasm.<br />\nI Want a Girl<br />\n12. Two Step<br />\nN. HESS' SONS<br />\nBlue Danube<br />\n13. Waltz<br />\n8 E. BALTIMORE ST.<br />\nBoston<br />\nSpanish<br />\nEspana<br />\n14.<br />\n15. Two Step—<br />\nAlexander's Ragtime Band<br />\nAmoureuse<br />\n16. Waltz<br />\nWestern Maryland defeats HopMADE TO ORDER<br />\nkins, 6-0, in exciting football game.<br />\nAND<br />\n\"0 Tempora! 0 Mores.\"<br />\n<br />\nHere is the first attribute<br />\n<br />\nof a citizen of the world.<br />\nbooks can impart<br />\nit, yet it comes naturally with college training.<br />\nSuch easy familiarity<br />\nwith the good things of<br />\nlife leads naturally to<br />\nMelachrino,\"theonecigarette sold the world over\"<br />\nFew<br />\n<br />\nc;'-•<br />\n<br />\nHess Shoes<br />\n<br />\ns.<br />\n<br />\nLEMMERT<br />\nFINISHED CLOTHES<br />\nPLAZA BUILDING<br />\n<br />\nPREVOST HUBBARD TO TALK TO<br />\nCIVIL ENGINEERS<br />\n<br />\nThe second mOnthly public meeting of the Hopkins student chapter, A. S. C. E. will be held this<br />\nevening<br />\nat 8:15., on the third floor<br />\nSHOES<br />\nof the Civil Engineering Building.<br />\nIt will be addressed by Mr. PreUNIVERSITY MEN<br />\nvost Hubbard, chemical engineer of<br />\nAsphalt Association, who is<br />\nthe<br />\nFor Dress<br />\nFor Sport Wear<br />\nthe<br />\nleading<br />\nauthority in the counSmart Styles—Best Leathers<br />\ntry on asphalt construction, and<br />\nModerate Prices<br />\nwhose company occupies about the<br />\nsame position in the asphalt industry as does the U. S. Steel Company in the steel industry.<br />\n19 W. LEXINGTON ST.<br />\n19 and 21 EAST FAYETTE ST.<br />\n<br />\nWYMAN<br />\n<br />\n•<br />\n<br />\n•.<br />\n<br />\n• -.A*<br />\n\"<br />\n<br />\nRemember that Melachrino is a master <'<br />\nblend ofonlythefinestTurkishTobaccos<br />\nas originated by Miltiades Melachrino.<br />\nEgyptian cigarettes are simply those<br />\nthat originated in Egypt. But the tc<br />\nbacco is what you want to know about<br />\n—and if it's Melachrino — it's right<br />\n<br />\nelachrino<br />\n<br />\n\"The One Cigarette Sold the World Over\"<br />\n<br />\nTs,<br />\n<br />\n\f", "format": "basic_html", "processed": "0<br />\n5<br />\n5<br /><br />\nBALTIMORE, MD., DECEMBER 6, 1921<br /><br />\nVOL. XXVI. No. Ili /7<br /><br />\nPRICE 5 CENTS<br /><br />\nSOPHOMORES A, ND FRESH- FRESHMEN STARS MAKE E. E. JUNIORS ORGANIZE THREE HOPKINS ALL-STATE CONCRETE STADIUM FOR<br />\nHOPKINS CONSIDERED<br />\nMEN TO RETURN NEXT YEAR<br />\nRADIO CLUB<br />\nBOW WEDNESDAY NIGHT<br />\nMEN PREPARE FOR<br />\nProposed<br />\nStadium to Seat 40,000 PerBonner<br />\nMagill,<br />\nGraduate.<br />\nTotterdale<br />\nto<br />\n-Continental<br />\nEngage<br />\nin<br />\nTrans<br />\nDramatic Club's Bill of Short Plays Hope to<br />\nFOOTBALL GAME<br />\nsons. To Be Modeled After One<br />\nSophs Developing Team Work. Dance<br />\nto Be Held After Rush.<br /><br />\nVery Attractive.<br /><br />\nThe Johns Hopkins Dramatic<br />\nClub will put on its first production of the year Wednesday night<br />\nin its studio on the top floor ot<br />\nthe Barn. Only two plays will be<br />\npresented, \"A Death in Fever<br />\nFlat,\" a one-act tragedy by Cronyn, and \"A Roadhouse in Arden,\" by Philip Moeller.<br />\nThe plays are coming along<br />\nvery well in rehearsal and Mariano Badillo promises some unusual scenic effect particularly in<br />\nthe Moeller burlesque, \"A Roadhouse in Arden.\" He has also designed costumes which very effectively suggest the extraordinary atmosphere of the piece. The<br />\ntragedy,\"A Death in Fever Flat\"<br />\npresents a •real problem. It is a<br />\ntense, strident affair presenting<br />\ntechnical difficulties demanding<br />\nthe utmost skill from the actors.<br />\nSlatkin as \"Miss Immortality,\"<br />\nin \"A Roadhouse in Arden,\" and<br />\nWhite as \"Padie\" in \"A Death in<br />\nFever Flat,\" bid fair to live up to<br />\nthe greatest tradition of the club.<br />\nBoth make very attractive ladies,<br />\nbut \"Don\" Kirkley and \"Cleopatra FIamlet\" promises to be the<br />\nmost seductive thing this side of<br />\nthe Mohammedan heaven.<br />\nBuckheister and Hess have<br />\nheavy acting parts in the tragedy<br />\nand Hunter has to support most<br />\nof the comedy work in the burlesque.<br />\nHenry West and Eli Frank, Jr.,<br />\ncoached the plays.<br />\nThe curtain will slide at 815.<br /><br />\n- The Sophomore and Freshmen<br />\nteams are going through hard<br />\nPractices daily in preparation for<br />\nthe interclass game on Saturday.<br />\nThe Sophomores have been holding practice for over a week and<br />\ntheir team is beginning to round<br />\ninto form. The difficulty which<br />\nthe Sophomores must face is the<br />\nsame difficulty which has resulted so often heretofore in the defeat of a seemingly stronger team<br />\nby a materially weaker one on paper; the absence of teamwork.<br />\nStrenuous practices, however,<br />\nare erasing the rough spots and<br />\nthe second year team- is rapidly<br />\nrounding into condition. Many of<br />\nthe men who were out for the<br />\nVarsity are trying.for_ the team<br />\nand these meh are a big asset in<br />\nteaching some of their less experienced classmates some of the<br />\nfine points of the game.<br />\nThe Freshmen team has been<br />\nPracticing steadily and with each<br />\nPractice more improvement can<br />\nbe noticed. The Freshmen were<br />\nhandicapped this year by lack of<br />\ngames and were defeated in their<br />\nonly start by Severn School.<br />\nThey have shown a complete reversal of form since then, however, in several scrimmages with<br />\nlocal prep schools and the first<br />\nYear team now seems to be at the<br />\nCHRISTMAS COTILLON TO BE<br />\ntop of their form.<br />\nBRILLIANT AFFAIR<br />\nAt a meeting of the Cotillon<br />\nOn the line the Freshmen have<br />\nthree men who have displayed Board held on Thursday, Decemgood football throughout the sea- ber 1st, plans were made for the<br />\nson. Captain Summers at center Christmas Cotillon to be given on<br />\nhas shown himself to be a ca- December 21st, in the C. E. Hall.<br />\npable performer, as have Turnbull It was found necessary to make a<br />\nand Young from the Varsity change in the type of program as<br />\nSquad. Turnbull had a great deal the 0. D. K. Song Books, which<br />\nof experience in prep school and the Board intended to give as southe coaches consider him a prom- venir programs, will not be ready<br />\nising youngster.<br />\nfor publication until after ChristThe Sophomores, on the other mas. An order was accordingly<br />\nhand, have an extremely well bal- placed for a distinctive Hopkins<br />\nanced line. George Shriver at cen- souvenir program, which will be<br />\nter, Smallwood and John Shriver of more value than the ordinary<br />\nat guards and Meyer at end have dance card given at past cotillons.<br />\nall had experience under Coach A committee on decoration was alVan Orman. Hutzler and Raleigh so appointed, as it is planned to<br />\nat tackle, and Dunning at the have the hall festooned with disOther end are members of last tinctive Christmas decorations—<br />\nYear's Freshman team and are greens, holly, firs and mistletoe.<br />\nwell versed in the arts of the There. are to be eighteen dances<br />\ngam e.<br />\nwith supper served between the<br />\nThe backfields are more evenly ninth and tenth numbers, and as<br />\nmatched. In Merlees the first year Louis Fisher is to provide the mumen have an excellent punter as sic it is certain that the party will<br />\nwell as a man who can be relied be a success. The subscription is<br />\nupon for a substantial gain. Farb- to be $3.00 per couple and tickets,<br />\nman, Jones and Balsam are the which must be bought in advance<br />\nOther men who will probably start arid may be obtained from members<br />\nand they have shown excellent of the Board, starting this week.<br />\nform throughout the year.<br />\nIt has not been definitely de- GOV. RITCHIE FAILS TO APPEAR<br />\nAT ASSEMBLY<br />\ncided which men will compose<br />\nGovernor Ritchie, who was to<br />\nthe Sophomores' backfield, but it<br />\nWill probably be selected from speak at last week's assembly, was<br />\nMarchetti, Ellicott, Harwood, unable to attend, so Dean Latane,<br />\nafter announcing that for the next<br />\nLinbach and Ashton.<br />\nThe Sophs seem to have a two meetings interesting programs<br />\nSlight edge over the Frosh as to had been planned, and requesting<br />\nMaterial. Games cannot be played full attendance, dismissed the gathOn paper, however, and the supe- ering. Emil Smith announced the<br />\nrior teamwork of the Freshies will meeting on Friday of the Social<br />\nProbably succeed in causing a Science Club, to which young ladies<br />\nfrom Goucher had been invited.<br />\nContinued on page 3, co/. 3<br /><br />\nRelay Work.<br /><br />\nand Darley Have Two More<br />\nYears.<br /><br />\nat Princeton.<br /><br />\nThe possibility that a large conDuring the latter part of the<br />\ncrete<br />\nhorseshoe stadium, with a caNow that the battle is over and<br />\nmonth of November a group of<br />\npacity<br />\nfor 40,000 spectators, may<br />\nElectrical Engineering students we have only next year's season to<br />\nbe built at Homewood in the near<br />\ninterested in wireless telegraphy look forward to, the time seems future has been expressed by the<br />\nand kindred subjects and seeing ripe for a bit of biographical wan- officers of the Varsity Club and the<br />\nthat the University would be ben- dering. Just how many of our Homewood Company. A short<br />\nefited by increased activities along players will be back next year time ago the city officials, recogthese lines, met and arranged to (examination results not taken in nizing the need of the city for some<br />\nlarge arena to be used for athletic<br />\ninstitute an undergraduate radio consideration) \"how, where and<br />\ncontests and other great occasions,<br />\nclub. J. C. Hauf was elected the why\" they played previously and intimated that the Mt. Royal respresident and the charter mem- what other branches of athletics ervoir basin might be utilized for<br />\nbers of the newly founded club are they indulge in, few know.<br />\nthe location of a concrete bowl. The<br />\nFor<br />\npleasthis<br />\nreason<br />\nwe<br />\ntake<br />\nofficials of the Varsity Club heard<br />\nH.<br />\nVogel,<br />\nVanneman,<br />\nH.<br />\nD. K.<br />\npresent<br />\nin<br />\nthe<br />\npast,<br />\nure<br />\npresenting<br />\nof this move and realized that if<br />\nG. P. Fallon, C. Heusen, J. C.<br />\nany<br />\nsuch stadium is to be built<br />\nLewis, W. Weikel and G. C. Coo_ and future of each of the men<br />\nit<br />\nshould<br />\ncertainly be done by the<br />\nDr. Kouwenhoven has kindly con- taking part in games this year.<br />\ncity's only large university. They<br />\nThe first four men, whose lives<br />\nsented to assist the club in its<br />\naccordingly put forward a counwork and act as faculty repre- we will publish, are Capt. \"Bill\" ter project calling for a conTotterdale, Darley, Magill and crete stadium at Homewood, and<br />\nsentative.<br />\nThe club, which is simply Bonner, the \"all-Maryland\" selec- appointed a committee to look into<br />\nthe matter.<br />\nknown as The Radio Club, plans tion.<br />\nWilliam Grainger Totterdale, While it is admitted that the<br />\nto take an active part in national<br />\nproject is little more than a dream<br />\nradio activities and hopes to be- captain of our state champions, is<br />\nat<br />\nthe present time, some statistics<br />\ncomes one of the regular stations 21 years old and weighs 175<br />\non<br />\nthe size, cost and possible means<br />\nin transcontinental relay work. pounds covered, with mud. This is<br />\nraising money have been preof<br />\nThe station will be in entire his second year at Hopkins, he<br />\npared.<br />\nThe stadium would be in<br />\ncharge of the members of the club having spent two years at St.<br />\nform<br />\nof<br />\na gigantic horseshoe simand different groups will operate John's College, a school located<br />\nilar<br />\nto<br />\nthe<br />\none at Princeton, and it<br />\nthe instruments on certain nights somewhere on the Severn. He has<br />\nplayed in every game this season, would seat approximately 40,000<br />\nduring the week.<br />\nbut<br />\nthe first, at which date he was spectators. The closed part would<br />\nThe station, which is located in<br />\nout of luck. Altho be at the northwest end of the athacademically<br />\nthe M. E. Building, is exceptionalpresent<br />\nin Baltimore, letic field, while near the present<br />\nhe<br />\nlives<br />\nat<br />\nly well equipped with the most<br />\nBellefonte<br />\nAcad- main entrance to the field a large<br />\nat<br />\nprepped<br />\nhe<br />\nmodern, latest wireless apparatus.<br />\nThis<br />\nis<br />\nthe space would be reserved for the<br />\nPennsylvania.<br />\nemy,<br />\nThe transmitter is of a one-halt<br />\nUniversity gymnasium. In view of<br />\nhas<br />\n\"Bill\"<br />\nwhich<br />\nkw. quenched spark type with a second year in<br />\nthe fact that the stadium would<br />\ncensending range of 500 miles. The been selected all-Maryland<br />\naerials are stretched between the ter. His only other sport is tennis, pay for itself in a short time and<br />\nroof of thel I. E. Building and but due to the above mentioned the gymnasium would give no filuck he was unable to participate nancial returns, all money availthe powerhouse stack.<br />\nIt is hoped by the charter mem- last year. Mr. Totterdale reports able would be first used for the<br />\nbers that the club will become a that he will not be with us next stands. Such a stadium would cost<br />\nbetween $350,000 and $400,000. A<br />\npermanent institution and will in- year.<br />\nplan<br />\nfor raising this money which<br />\nGeorge Leslie Darley, our little<br />\ncrease to larger proportions in<br />\nthe future. At present. member- 145-pound quarterback, is not 20 has been formulated by the Varsity<br />\nship in the club is limited to Ju- years old and is in the first year of Club depends on the real interest<br />\nniors and Seniors only, but after a three-year engineering course. of Baltimoreans being behind the<br />\nthe activities have gotten well He is a Baltimorean and prepped project. If 20,000 people would<br />\nunder way the Sophomores and at Poly, where he played quarter- subscribe for one season ticket at<br />\nperhaps the Freshmen will be per- back for two years. He has played $10 for each of two years the $400,mitted to enter. Besides the prac- in every game this year. George's 000 would be raised and the statical work of the club, some time appearance at J. H. U. filled an dium paid for.<br />\nOther possible plans will be conwill be spent in carrying out origi- aching void on. the team and his<br />\nsidered<br />\nby the Varsity Club, chief<br />\nnal experiments. Under the gov- selection for the \"all-Maryland\"<br />\namong<br />\nwhich<br />\nis the location of the<br />\nernment license held by the sta- is proof of his ability at his posistands<br />\nin<br />\nthe<br />\nWyman Park bowl.<br />\ntion, any wave length desired may tion. He will return next year<br />\nIt<br />\nhas been reported that there is<br />\nbe employed in carrying out ex- and we hope the year after.<br />\nThe choice of James Isaac Bon- not enough space between the cinperimental work.<br />\nIn addition to the actual work ner for halfback on the mythical der track and University Parkway<br />\nin wireless telegraphy proper, the eleven meets the approval of all for the erection of such a stand,<br />\nclub plans to experiment with the Hopkins rooters. \"Buck\" is the and in this event another location<br />\nwireless telephone and other kin- speediest 145 pounds seen in togs must be found. Since the upper<br />\non Homewood Field for many a sections of the stadium would condred subjects.<br />\nday. He is 20 years old and is a sume a relatively large amount of<br />\nSophomore, his first year having the cost a suggestion has been made<br />\nMUSICAL CLUB ON THE ROAD<br />\nbeen spent at the University of that only a part large enough to<br />\nAt Big Springs High accommodate 20,000 be built and<br />\nof<br />\nTexas.<br />\ncomposed<br />\nMusical<br />\nClub,<br />\nThe<br />\nJazz<br />\nSchool where he prepped he the remainder added later.<br />\nthe Glee Club, Mandolin Club,<br />\nThe real need of such a stadium<br />\nOrchestra and the Hawiian Trio, played end and halfback. He was<br />\nSprings,<br />\nhas<br />\nbeen fully realized for some<br />\nwill journey this evening, Decem- born and bred in Big<br />\nber 6th, to Evergreen, where they where boys awake at the kick of a time and, with the view of taking<br />\nwill render their opening concert steer. He at present calls Texar- definite action, a committee comof the season. This concert is given kana home. He has participated in posed of Dr. Thomas R. Brown,<br />\nfor the benefit of the blind soldiers five games this season and will re- chairman; Dr. Ray Van Orman,<br />\nand Dr. Eveleth Bridgman has<br />\nat Evergreen. On Saturday, De- turn next year for nine more.<br />\nThomas P. Magill, the infant been appointed by the Varsity Club.<br />\ncember 10th, the club will give<br />\na concert at McDonough. The prodigy of the all-state collection, On Monday night a conference of<br />\nconcerts are to be followed by is 18. years old and weighs.165 this committee and a similar one<br />\na dance. All Hopkins men are cor- pounds. This is his first year at of the Homewood Club was held<br />\nHopkins where he hopes to re- and the action taken there will soon<br />\ndially invited to attend.<br />\nThe concert at Evergreen was to main four years. He is a graduate be divulged. In the meantime, Dr.<br />\nhave been held on November 28, of Baltimore City College where Van Orman is corresponding with<br />\nbut because of insufficient practice he played tackle for two years. other institutions with the view of<br />\nand because other minor arrange- He has played in every game this obtaining data and other informaments had not been made, it was season, remaining out of only a tion about different types of sta• diums.<br />\nContinued on page 2, col. 5<br />\nthought best to postpone it.<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 6, 1921<br /><br />\nHopkins News-Letter<br /><br />\nLECTURES<br /><br />\n1 . 1 \"PREACHERS' CLUB\" NOW \"CHRISSERVICE CLUB\"<br /><br />\nIII<br /><br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br /><br />\nAt a recent meeting of the<br />\nPreachers' Club, the members de- A Column in Which the Correspondents<br />\nAre Allowed Latitude, But ShoulSubscription<br />\n$2.50 ZIONIST CLUB SECURES LECTURER cided to change the name of their<br />\nder the Responsibility.<br />\nJudge Jacob Moses, formerly<br />\ntheir<br />\nalthough<br />\nAll letters intended for publication<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at judge of the Juvenile Court, now organization,<br />\nmust be concise,'written in ink on<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nconstitution has been only slightly<br />\nregular letter size paper, on one side<br />\nchairman of the Maryland Labor changed from<br />\nonly.<br />\nthat of last year.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nNo attention will be paid to anonyArbitration Board, will address the<br />\nHopkins University.<br />\nThe purpose of the Christian Sermous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nSociety<br />\nJohns<br />\non<br />\nHopkins<br />\nZionist<br />\nBusiness communications should be addressed to the BUSINESS MANvice Club can best be stated by<br />\nprinted if request is made that they be<br />\nomitted.<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications Wednesday, December 7, 1921, at<br />\ncona<br />\nphrase<br />\nquoting<br />\nfrom<br />\ntheir<br />\nThe publication of a letter is not to<br />\nshould be sent to the MANAGING EDITOR.<br />\n.12.30, in the hall of the Mechanbe taken as an indorsement of its views<br />\nstitution: \"The purpose of the club<br />\nby<br />\nthe \"News-Letter,\" which invites the<br />\nTelephone<br />\nHomewood 100 ical Engineering Building. Judge<br />\nfreest discussion 'of matters of general<br />\nshall be to promote closer Christian<br />\nInterest.<br />\nMoses will be the first of a series association among its<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nmembers and<br />\nof<br />\nspeakers to address the Zionist to interest men in<br />\nH. DOUGLAS COTTON,'22.<br />\nFREDERICK W. LIPPS, '22.<br />\nChristian living REMEMBER MEDICO, \"MUSIC HATH<br />\nManaging Editor:<br />\nSociety this year. The coming of and definite life service.\"<br />\nITS CHARMS\"<br />\nTo carry<br />\nWILLIAM H. MOORE, JR., '23<br />\nCirculation Manager:<br />\nUniversity will<br />\nthe<br />\nMoses<br />\nJudge<br />\nto<br />\nTo<br />\nthe<br />\nEditor<br />\nof the News-Letter:<br />\nout the purpose of the club, the<br />\nAssociate Editors:<br />\nGLOVER P. FALLON, '23.<br />\nbe quite an event, and a large at- program committee arranges speakEDWARD G. HUEY, '22.<br />\nThe present year is already<br />\nELI FRANK, JR., '22.<br />\nAdvertising Manager:<br />\ntendance is expected. It is re- ers for<br />\nmeeting.<br />\neach<br />\nThe<br />\nnext<br />\nshowing<br />\nJunior Editors:<br />\nmanifestations which inDONALD K. VANNEMAN, '23.<br />\nquested that all who attend the meeting will be<br />\nCHARLES C. MARSURY, '22.<br />\nheld December 5th, dicate that it will not differ<br />\nfrom<br />\nJ. BRENTNALL POWELL, '23.<br />\nmeeting be in their seats by 12.30. at the home of<br />\nAssistant Business Managers:<br />\nMr. S. K. Wallace,<br />\nCRAIG E. TAYLOR, '24.<br />\nthe<br />\npreceding years in the amount<br />\nBERNARD C. HEARN, '23.<br />\nEverybody is welcome.<br />\nJ. HUDSON HUFFARD,'23<br />\ncorner of Walbrook Avenue and<br />\nJOHN C. LEWIS, '23.<br />\nJOSEPH S. LEOPOLD, '24.<br />\npleas,<br />\nof<br />\ndiscourses, appeals and<br />\nPoplar Grove Street. •The Rev.<br />\nDR. ROBINSON LECTURES<br />\nFITZGERALD DUNNING, '24.<br />\nDONALD H. KIRKLEY, '25.<br />\nRIGNAL W. BALDWIN,. JR., '23<br />\nDr. David M. Robinson deliv- Dr. McComb will address the mem- weekly harrangues on the timeered the opening lecture under the bers of the club. After the address worn subject of college spirit.<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nHoover Foundation of Roanoke a general discussion of topics will Must we again listen to athletic<br />\nCollege last Friday evening. His be led by Mr. Custer Cromwell.<br />\nmanagers, team captains and<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ntopc was \"Ancient Cities of Asia<br />\nThe meeting following Decemcoaches imploring us to come out<br />\nMinor.\" Dr. Robinson is widely ber 5th will be devoted to the study<br />\nfor<br />\nBALTIMORE, MD., DECEMBER 6, 1921<br />\nteams, attend games and be<br />\nknown as an authority on arch- of religious leaders during the<br />\npresent<br />\nat mass meetings and then<br />\naeology, and has made extensive Reformation. It will be the aim<br />\ncontributions to the subject, both of the speakers to criticise the re- witness now as before the failure<br />\nA STADIUM AT HOPKINS?<br />\nby explorations and in publications. 4-A--NEWS-LETTER<br />\nof these attempts. One need not<br />\nOnce again the question of a stadium for Baltimore, which the Through his excavation at Corinth formers, to call attention to their look far for the reason. Let us reNews-Letter suggested last spring, has been brought before the and Sardes and his acting as editor mistakes and take the good acts in call an<br />\nincident that occurred last<br />\npublic—this time in a more definite form than previously. Under the for \"Art and Archaeology,\" and their lives as examples of courage,<br />\nspring. The authorities reciuested<br />\nauspices of the city authorities, the municipal engineers are inspecting \"American Journal of Philology,\" truthfulness, etc.<br />\nDr. Easton, of Homewood Chap- Mr. Ralph Bowers to see what<br />\nthe Mount Royal Reservoir in order to determine whether the erec- and as president of the College Art<br />\ntion of a stadium in it is feasible. The plan of the city to provide Association of America. This lec- el (M. E. Church), 33rd Street, could be done on the question of<br />\na stadium for Baltimoreans is indeed praiseworthy, and, we believe ture, accompanied by illustrating near Charles, has given an oppor- organizing a band. Without any<br />\npractical. Baltimore, by virtue of its geographical situation is an ideal slides, has been given in many of tunity to the members of the club undue exhortation on the part of<br />\nto lead a meeting open especially Mr. Bowers there assembled at the<br />\nlocation for intersectional contests. On account of its proximity to the largest Eastern universities.<br />\nThe Hoover Foundation at Ro- for young people at his chapel ev- first rehearsal more men than<br />\nWashington, the Army and Navy games and other military contests<br />\nmight in all. probability be secured. The advantages which would be anoke College was established sev- ery Sunday afternoon at 4 P. M. were required. As a result of hard<br />\nderived by Baltimoreans from the scheduling of such contests are eral years ago by Col. A. Pearson The club has taken charge of these and consistent practice the band<br />\ninnumerable. Why, however, should the city authorities turn to Hoover,'01, of New York. All lec- meetings for the past three Sun- was in condition to play at the<br />\nthe Mt. Royal Reservoir or Clifton Park? Why should they not co- tures are a part of the community days. Refreshments are served af- games and proved a vital 'factor<br />\noperate with Hopkins and build their proposed new $350,000 stadium service of the college and are very ter the meetings. Hopkins stu- in our baseball victory over Navy.<br />\ndents are cordially invited to at- Why did men who had previously<br />\nat Homewood? To quote Dr. Bridgeman: \"The ground upon which popular with the public.<br />\nnever displayed any college spirit<br />\ntend.<br />\nthe stadium is to be built will have to be thoroughly drained. At<br />\nFIELD CLUB HOLDS MEETING<br />\ncome<br />\nout for the band? Above all,<br />\nHomewood a thorough system of draining pipes undermines the<br />\nQuoting<br />\nfrom<br />\nthe<br />\nconstitution:<br />\nOne of the most interesting lecwhole athletic field already and it is known as one of the best play- tures of the year was enjoyed by \"Active members must be bona why did the student body support<br />\ning fields in the country. Then the building of a track which takes the Field Club on Wednesday, No- fide students of J. H. U. All men the band by attending rehearsals.<br />\nabout a year to lay is an expensive proposition. In addition the field vember 30, at which Mr.. A. D. will be eligible for membership who whereas they rarely are present<br />\nat Homewood has been sodded. For all these reasons it would be Shaftesbury, one of our post grad- are proposed by the membership at football or baseball practice?<br />\nmuch cheaper to build a stadium there than any other place. There uate biology students addressed the committee.<br />\nProposed members Mr. Bowers succeeded and athletic leaders failed under apparently<br />\nHopand<br />\nJohns<br />\ncity<br />\nthe<br />\nbetween<br />\nco-operation<br />\nof<br />\nkinds<br />\nall<br />\nwould be<br />\nclub on \"The Habits of Bees.\" Mr. must be approved by two-thirds of<br />\nalmost<br />\nbuild<br />\nwilling<br />\nsimilar<br />\nto<br />\nwould<br />\nbe<br />\nconditions. The latter conWe<br />\ndo<br />\nthis.<br />\nkins if they desire to<br />\nShaftesbury is especially fitted for the members before being fully adtinually<br />\nutilize.\"<br />\nbeseeched us for help and<br />\nanything the city should desire to<br />\ngiving a talk of this type, as he mitted to the club.\" The officers<br />\nyet<br />\nfail<br />\nto even recognize their<br />\nare:<br />\nHow about it, City?<br />\nPresident,<br />\nP.<br />\nB.<br />\nStevens;<br />\nvicehas devoted extensive study and<br />\nhas had much practical experience president, S. K. Wallace; secre- classmates on the campus. Stutary C. P. Sylvester; treasurer, W. dents will never come out for<br />\nalong this line.<br />\nthing as a friendly salutation. We<br />\nThe talk was illustrated by many F. Wheeler.<br />\nWE WANT THE MINOR SPORTS<br />\nare tired of the type who go<br />\nNew<br />\nmembers<br />\nare:<br />\nG.<br />\nConning,<br />\ninteresting slides which represented<br />\nthrough four years of college amid<br />\nWe learn with regret that there is a possibility of the minor aspects of bee culture as it is car- G. Cobb.<br />\nThe old members • are: W. R. a small circle of friends and when<br />\nsports being discontinued through the winter. Such a course, we ried on in different parts of our<br />\nbelieve, would be unwise and should be adopted only as a last re- country. He contrasted modern im- Barnhart, G. C. Cromwell, H. M. the time arrives expect every man<br />\nP. Martin, J. D. Garrett, D. W. to respond to their appeals. Husort. We all know that better spirit has been displayed this fall by provements with the older methJustice, J. C. Lewis, W. A. Price, man nature revolts against such<br />\nthe undergraduates than ever before. We would not like to see this ods in the field. The life of the<br />\nundemocratic actions. The stuhoney bee was set forth in a fas- W. C. Roberts, 0. G. Robinson.<br />\nspirit die or even pass into a period of coma from which it would<br />\ndent body will only support leadcinating manner which held the in- sidering all operating conditions.<br />\ners who devote their efforts for<br />\nhave to be revived next spring. The discontinuance of basketball terest<br />\nof the audience. Many unThe items of location of stations, the<br />\nglorification of Hopkins and<br />\nwould probably bring about such a situation. Although money is familiar facts were told concerning<br />\nvariable loads, power input, rotary not for self ho.nor.<br />\nThat is why<br />\nexceedingly scarce on the campus we believe that the majority of the social organization and instincts converters, switchboards,<br />\netc., will Mr. Bowers and the band attained<br />\nthe students and at least those who patronized the games and informal of this interesting and important be very carefully discussed.<br />\nsuch a remarkable success. ColThis meeting will be an open leges as small<br />\ndances at the Armory last year, would be willing to subscribe to insect. The duties and care of the<br />\nas Hopkins have<br />\nqueen, the rearing of the larva from one, and the engineering faculty<br />\nminor-sport tickets, rather than see these sports dropped.<br />\nachieved enviable athletic records<br />\negg to adult, construction of the and student body are extending a<br />\nwithout employing professionals.<br />\ncomb, storing of honey, swarming cordial invitation to attend. A reLet us not forget the example<br />\nP. T. CLASS TAKING UP MANLY and inhabiting the hive, together<br />\nHOPKINS MEN LEAD ARMY<br />\ncord crowd is expected.<br />\nmade by the band, but continue<br />\nART<br />\nCHEERING<br />\nwith related instincts were discusto work in the same footsteps.<br />\nLong,<br />\nCaptain<br />\nof<br />\nthe<br />\nR.<br />\n0.<br />\nT.<br />\nC..<br />\nleaders,<br />\nsed<br />\ncheer<br />\nin connection with their biologstar<br />\nHopkins<br />\nSCIENTIFIC SOCIETY LECTURE<br />\nPhilip E. Rothman,<br />\nDr. E. A. Andrews, professor<br />\n\"Bill\" Engel and \"Don\" Vanne.- the sponsor of the plan to introduce ical significance.<br />\n*Class of 1925, J. H. U. Medical<br />\nMr. Shaftesbury emphasized the of zoology, at this university, will<br />\nman, not only led cheers for Army boxing in the physical training<br />\nSchool.<br />\nfact that bee keepers are not the deliver a- lecture today before the<br />\ncourses,<br />\nreports<br />\nthe<br />\nclass<br />\nas<br />\n\"carat<br />\nstyle<br />\nspectacular<br />\nusual<br />\ntheir<br />\nin<br />\nones who receive the greatest ben- Scientific Society. The subject of<br />\nthe big game Saturday, but they rying on.\" The handicap of teach- efiit from his industry, but the Dr. Andrews' lecture will be the<br />\nTHREE ALL-STARS TO RETURN<br />\ning<br />\neven<br />\nthe<br />\nrudiments<br />\nof<br />\nthe<br />\nmanpreparations<br />\nall<br />\nof<br />\ncharge<br />\nContinued from page 1<br />\nalso took<br />\nneighboring orchard owners derive \"Bottle Animalcule,\" a micro-organism which inhabits the waters portion of the Swarthmore game,<br />\nfor the rooting, which so surprised ly art without the proper equip- even greater profit.<br />\nment, including the almost necesof nearly all parts of the world and when the referee found that he<br />\nthe big crowd by its excellence.<br />\n\"RAILWAY SUB-STATIONS\" TOPIC ...rows in a form<br />\nsimilar to that had the best of a fight with his<br />\nsary<br />\ngloves,<br />\nis appreciated, but,<br />\nTO BE DISCUSSED AT ELECVanneman went down to Camp<br />\nof<br />\na<br />\nbottle.<br />\nThe<br />\nTRICAL<br />\nCLUB<br />\nmeeting<br />\nof the so- opponent.<br />\nMeade, Friday, where he put over nevertheless, there exists a \"will,\"<br />\nA very interesting talk will be ciety will be held at 4.15 in the<br />\nIt is with a great deal of satis500 men through their paces, and so the way is being provided. The delivered on Friday, December 2, large lecture room, Room 110, in faction that we<br />\nnotice that three<br />\n\"Bill\" Engel coached a like num- R. 0. T. C. staff has a way of gen- by Mr. Warren Viessman, upon the<br />\nMechanical<br />\nEngineering of our all-state selections will<br />\nber at Camp Holabird. In addi- erally accomplishing what it sets \"Railway Substations.\" The speak- Building. All members of the fac- have at least three more years at<br />\ntion to this, Engel adapted all their out to do and this fact would seem er will have a number of notes on ulty and students interested in J. H. U. They will be needed if<br />\nsongs and yells for them and plan- to be borne out in the progress of this topic, and from these he will this subject are invited to attend rumors concerning next year's<br />\nthe trial of the boxing course discuss converter substations, con- the lecture.<br />\nned all their demonstrations.<br />\nschedule are at all well founded.<br />\nFOUNDED 1897.<br /><br />\n40.1./111.1.,<br /><br />\na —<br /><br />\n•••01.1.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 6, 1921<br />\nMAILBAG CONTINUED<br /><br />\nA. A. BOARD HOLDS MEETING<br /><br />\nAt the last meeting of the A. A.<br />\nBoard, called to order by President Knecht at 12.20 in the athletic office of the barn on Monday, November 21, it was decided<br />\nto take definite action regarding<br />\nthe awarding of gold footballs to<br />\nthose Hopkins football men who<br />\nhelped to win the state championship. It has always been the<br />\ncustom in the past to award some<br />\nsuch emblem to the members of<br />\nstate championship teams and the<br />\n:ustom will be continued this year.<br />\nIt has not yet been determined<br />\nhow the emblem will be obtained.<br />\nThe footballs will either be donated by some philanthropically<br />\ninclined graduate or will be purchased with funds collected by<br />\npublic subscription of the student<br />\nbody. The men who will receive<br />\nthe emblems will be those who<br />\nparticipated in the St. John's<br />\ngame and also any who are awarded the \"H\" but still did not play<br />\nagainst St. John's.<br /><br />\nFRESH-SOPH FOOTBALL GAME<br />\nContinued from page 1<br /><br />\nORTMAN'S<br /><br />\nMt. Vernon 4999<br /><br />\ngreat deal of trouble for their tor- \"Queen Quality\" Home Made<br />\nChocolates<br />\nmentors.<br />\nVISIT OUR ICE CREAM PARLORS<br />\nThe committees in charge plan<br />\n518 N. CHARLES ST.<br />\nCommercial Photography<br />\nto make the day a memorable one<br />\nCircuit Photography<br />\nfor Fresh-Soph games. Letters<br />\nViews<br />\nFlash Lights<br />\nhave been sent to the prep schools<br />\nCharles and 22nd Sts.<br />\nEnlargements<br />\nGroups<br />\nthroughout the city, male, female Delicious Sodas and Sundaes<br />\nKODAK FINISHING<br />\nThe Best of Candies<br />\nthem<br />\ninviting<br />\nco-educational,<br />\nand<br />\n325 N. Howard St.<br />\nPrompt &amp; Efficient Service<br />\nb attend the game,and it has been<br /><br />\nW.L. Mann<br /><br />\nTo the Editor News-Letter,<br />\nDear Sir:<br />\nThis year's Freshman Class inaugurated what may become in<br />\nthe course of time a permanent institution at Johns Hopkins—a<br />\nFreshman \"Pep\" Committee. The<br />\nmotives which prompted the appointment of such a committee<br />\nare commendable and the class<br />\ndefinitely decided to hold a dance<br />\ndeserves credit. The purpose of<br />\nin<br />\nthe C. E. Hall after the rush<br />\nthis body, however, seems idealis1 W. University Parkway<br />\nST. PAUL &amp; 24th STS.<br />\nsimilar to those held heretofore by<br />\ntic and, so far, has proved imOpposite J. H. U. Athletic Field<br />\nC. D. Wolfe, Prop.<br />\nthe Cotillon Board, for which a<br />\npracticable. From time immemorial it has been the custom for the<br />\nfee of 50 cents will be charged to DELICIOUS SODAS &amp; SUNDAES DRUG STORE for J. H. U. BOYS<br />\nMade With<br />\nSophomore class to see that the<br />\nPHONE, HOMEWOOD 2121<br />\ncover expenses. Admission to the<br />\nJersey Special Ice Cream<br />\nregulations imposed by the Stugame will be free and the public is<br />\n\"The Velvet Finish\"<br />\ndent Council were enforced and it<br />\ninvited. A large crowd is expected KODAKS CAMERAS SUPPLIES Buy an (H) Pipe made special<br />\nis always difficult to change custo be on hand and enjoy the game Whitman's Chocolates and Bon Bons<br />\ntoms.<br />\nfor the Boys<br />\nand ensuing rush.<br />\nThe first-year men can see that<br />\nthey, individually, adhere to regulations; to be responsible for<br />\ntheir fellow classmates, however,<br />\nYoung Men's Clothing<br />\nis an ideal which probably will<br />\nand Furnishings<br />\nnever be attained.<br />\nThere are means, however, by<br />\nThe various committees on se- Are made a special feature of<br />\nwhich the \"Pep\" Committee may lecting coaches for the teams rehere.<br />\nassist certain individuals, may aid ported their efforts, but as yet no<br />\ntheir class and may help mate- definite coaches for baseball, basrially the University as a whole. ketball, swimming or lacrosse Give us a call and let us become<br />\nEnglish Clothes Tailored in America<br />\nWe will quote an example of a have been appointed. The com- better acquainted for mutual<br />\nFOR SPORT, DRESS, SOCIETY<br />\nHABERDASHERY<br />\nFreshman who has been brought mittees are: Baseball, Sharretts<br />\nbenefit.<br />\nto the notice of the Sophomores<br />\nand Knecht; Basketball, Landy<br />\nHe—Where do you bathe?<br />\nORDERS RECEIVED FOR<br />\nupon several occasions. Up to the and Totterdale ; Swimming, MidWashington and Lee game he had dleton and Edwards; Lacrosse,<br />\nShe—In the spring.<br />\nCOGGINS'<br />\nnot attended a single contest at Bowers '20 and Griffiss '20.<br />\nHe—I didn't ask you when. I Transfer and Baggage Express<br />\nHomewood Field. When asked<br />\nCo Car:4.1011 WIth Jam.dicCrterg &amp; Co.. Weto York.<br />\nasked you where.<br />\nAUTOMOBILE SERVICE<br />\nfor an explanation he told of<br />\nAfter allowing the question of<br />\nat<br />\nLexington<br />\nHoward<br />\n—Cornell Widow.<br />\nclasses on Saturday afternoon. disputed track letters to hang fire<br />\nPHONE, HOMEWOOD 2645-W<br />\nUpon investigation it was found for some time this year it was finthat his classes were strictly vol- ally decided that there would be<br />\nuntary and that they were over in no additions to the list of \"H's\"<br />\ntime for him to attend the games. awarded last spring. However, the<br />\nHOUSANDS of smokers have proved it—and now give the verdict<br />\nFor certain reasons, good rea- men in dispute were awarded the<br />\nto you — Of all the other tobaccos NATURE has produced—none<br />\nsons, he attended the Washington official \"H. A. A.,\" which almost<br />\nand Lee game but was discovered equals the \"H\" in difficulty to win<br />\ncan approach the finest varieties of pure Turkish for cigarettes—<br />\nin the thrilling fourth quarter and honor to the wearer. The final<br />\nNone has the delicious<br />\nstanding in the next section to list of men receiving the \"H. A.<br />\nthat reserved for rooters, with a A.\" in track for the season of 1920FLAVOR of the finest Turkish—<br />\nbored expression on his face. 21 are: Hearn, '23; Hutzler, '24;<br />\nNone gives the ENJOYSounds never crossed his lips.<br />\nCannon, H. E., '23; Hambleton,<br />\nMENT of the finest Turkish—<br />\nFor another good reason he '22; Calkins, '20; Milligan, '22;<br />\nand<br />\nsection<br />\n'24;<br />\nmoved to the rooting<br />\nVan Ness, '20; R. Norwood,<br />\nNone will SATISFY you as<br />\nfor other reasons equally as good V. H. Norwood, '20; R. G. Heinwill the finest Turkish—<br />\nhe was seen to open his mouth er, '20.<br />\nvolnow and then to emit a small<br />\nNone but the highest grade<br />\nnine of sound. Often he was seen<br />\nand personally selected<br />\nto applaud at the wrong time, but<br />\nBLACK AND BLUE JAY<br />\nTurkish tobaccos is used in<br />\nthat was only because he did not<br />\nyet<br />\nnot<br />\nhave<br />\nwho<br />\nmen<br />\nAny<br />\nFor that,<br />\nunderstand football.<br />\nMURAD.<br />\nhowever, he could be easily for- turned in a subscription for the<br />\nTo enjoy 100% pure Turkish<br />\ngiven. It is not a knowledge of Black and Blue Jay for their girls<br />\nat its VERY BEST—to reach<br />\nfootball that must be instilled ; it will certainly not hesitate after seeis Hopkins spirit that he needs—<br />\nthe PEAK of Cigarette Quality<br />\ning the \"Changing Times\" numthat he must have. And there are<br />\n—you have but to smoke<br />\nber that appeared last week. The<br />\nothers like him.<br />\nhas<br />\nMURAD—<br />\nThis type presents a difficult -irculation manager of the Jay<br />\ncopno<br />\nthat<br />\nthe<br />\noffice<br />\nwhich<br />\nproblem<br />\nthis<br />\nproblem—a<br />\ninformed<br />\nTry MURAD today and<br />\nSophomores have been unable to ies of the new issue have yet been<br />\nsolve.<br />\n\"Judge for<br />\nmailed to outside subscribers, and<br />\nmentioned<br />\nFreshman<br />\nThe<br />\nYourself—!\"<br />\n.r..1.4:14,4,t4-„,:;:zirizaA17.4.4:344a,Lanc.u..1.:4.7.5.4uvalcaram-wyrr.<br />\nis still plenty of time (if you<br />\nabove is utterly devoid of Hop- there<br />\natli<br />\nZ<br />\nsubVSPIZCHUITUSCUIM4VAK7142421,<br />\nkins spirit. Classes- are necessary act quick) to start your girl's<br />\n.<br />\nZaWSIAnaleZ*141:041CY.A<br />\nnumnew<br />\nto<br />\nsnappy<br />\nand this article is not written<br />\nscription with the,<br />\nadvocate cutting. But when St. ber. As the next edition will not<br />\nJohn's is playing at Homewood— appear unfil the middle of Janwell, it would be rather difficult to<br />\nuary, it is the last chance to turn<br />\nPersuade a Hopkins man with<br />\noutside subscriptions and have<br />\nSpirit to go to a class. Try and get in<br />\nthe recipients of your gifts derive<br />\nhim !<br />\nThe usual methods employed in the full benefits of the magazine.<br />\nremonstrating have failed utterly Subscriptions can be handed in at<br />\nin this case. This type regards the Jay's office in the Barn any<br />\nSophomores as monsters put on<br />\nday during dinner time, and to<br />\nearth to worry Freshmen and no<br />\nSingewald at any other<br />\namount of words, threats or en- Quentin<br />\ntreaties would carry the slightest time during the day.<br />\nWeight with them. The SophoMakastkellieigaier.6A<br />\n.41174471.04 and<br />\nE99pt.,(9.11,,,tivW<br />\nmores must appeal to the Freshold<br />\ngood,<br />\nlittle<br />\ncommand a<br />\ntheir<br />\nmen for help.<br />\nHere's where the Freshman Hopkins spirit. Here's a chance<br />\n\"Pep\" Committee enters. They are to help old Johnny Hopkins,<br />\nthe logical ones to seek the Fresh- Freshmen. Go to it!<br />\nmen belonging to above-illustratYours for Hopkins spirit,<br />\ned type, to speak to them and to<br />\nSophomore \"Pep\" Committee<br />\ninstill into them by any means at<br /><br />\nChelsea Pharmacy<br /><br />\nThe College Drug Store R. G. by &amp; Company<br /><br />\nClothes f Cusioltt (Oluality.<br />\nCharles Street.<br /><br />\nSTEWART&amp; 11.<br /><br />\nT<br /><br />\n20c<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 6. 1921<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br /><br />\nATHLETIC GOSSIP<br />\nAn organization meeting of lacrosse candidates will be held at<br />\n4.10 P. M. tomorrow in Room 110<br />\nin the Mechanical Engineering<br />\nBuilding.<br /><br />\nDISTINGUISHED GUESTS DINE IN<br />\nGILMAN HALL<br /><br />\nThe Home of<br /><br />\nOn account of the inability of<br />\nPresident<br />\nGoodnow to arrange PerComplete Stock of<br />\nMedical Books and College<br />\nsonally the reception of the guests<br />\nRequisites<br />\nat the dinner in Gilman Memorial<br />\nroom last Saturday, immediately<br />\nImporters and Dealers in Fine Books<br />\nThe interest of Hopkins stu- preceding the game between the<br />\n301 N. CHARLES ST.<br />\ndents in last Saturday's Army- Third Army Corps Area and the<br />\nBaltimore, Md.<br />\nMarine game was• somewhat Quantico Marines, the details of<br />\nslackened by the exaggerated entertaining the distinguished vis\"scare-head\" report in the \"Sun\" itors were left to Dr. Raney. Presof a bitterness of the Marine to- ident Goodnow attended the instalward the University. This most lation of Dr. David Kinley as presdestructive bit of publicity was en- ident of the University of Illinois.<br />\ntirely unfounded. A representative Dr. Kinley is a Hopkins man, and<br />\nof the News-Letter interviewed a since President Goodnow wished to<br />\nnumber of Marines and reported be present at his installation, he did<br />\nbeXatterie<br />\nM ES 1.1.5, OSCAR G.L.SNIY<br />\nthat they knew nothing of any un- not return to Baltimore until just<br />\npleasantness, previous to the before the buffet luncheon given<br />\noWNERS<br />\nabove publicity. As to the guaran- by the city authorities to the visit2'f71113Por4<br />\n29 Baltimore St., East<br />\ntee, it was offered voluntarily by ing celebrities, among whom were<br />\nOne Door West of Light St.<br />\nthe Marine authorities; as to the General Pershing, Secretary of<br />\nSOLE AGENTS FOR BALTIMORE<br />\nejection<br />\nof Marines at the St. War Weeks, and Secretary of<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\nJohn's game, there was not a sin- Navy Denby, and many members<br />\ngle uniformed man ejected or of the House and Senate. The FALL LACROSSE PRACTICE STARTS<br />\nThe Chas. Willms Surgical<br />\nThe Marines had the reading room was closed at 12<br />\ncharged.<br />\nInstrument Co.<br />\nLacrosse practice has started up<br />\nBaltimore,<br />\nMd.<br />\nof<br />\nthe field through a o'clock and the passage from GilST.,<br />\nfreedom<br />\nHOWARD<br />\nN.<br />\n300<br />\nSURGICAL INSTRUMENTS<br />\nsmall entrance of their own. The man Memorial room was banked again in full force, now that the<br />\nMEN'S SHOES<br />\nMicroscopes and Supplies,<br />\nreport was a most unfortunate with flowers. Fisher's Orchestra fraternity rushing season is over,<br />\nStethoscopes<br />\nOf the Better Class<br />\nBlood Lancets and damaging one. Hopkins was furnished the music for the occa- and practice will keep on as long<br />\nBlood Counters<br />\nnot only morally with \"the boys,\" .sion.<br />\nas the weather permits.<br />\nbut came out last Saturday and<br />\nPrinters of Philological and<br />\nrooted during the entire game in<br />\nMr. Hubbard will talk on the<br />\nIt is hoped that the new men will<br />\nURNER BROTHERS<br />\nScientific Works<br />\nwhich the \"devil-dogs\" downed \"Use of the Triaxial Diagram in<br />\n111<br />\nE. BALTIMORE STREET<br />\nattend<br />\nfall<br />\npractice<br />\nfaithfully.<br />\nThe<br />\n23 S. HANOVER ST.<br />\nthe Army team, 20-0.<br />\nBALTIMORE<br />\nSelecting and Proportioning Sand main essential in lacrosse is for a<br />\nBaltimore, Md.<br />\nin Asphalt Construction.\" Most of<br />\nLast Saturday morning another<br />\nman to learn to handle his stick,<br />\nMr. Hubbard's conclusions on this<br />\nCANE CLUB TAPPING<br />\ngrid battle took place on Strauss<br />\nimportant subject are his own and and when he gains this knowledge<br />\nField. The Electrical Engineers<br />\nThe Cane Club will have a tapare the results of much original the rest comes easily.<br />\ndowned the Mechanical Engineer<br />\nwork.<br />\nManager Collins requests all men ping on Friday, with a dance to<br />\n6-0. Rowland carried the ball over<br />\nThis is the second public meet- to be sure and take their physical follow in the evening. The same<br />\nthe line as Referee Jake Miller's<br />\ning arranged by the American So- examinations.<br />\nThey will not be unique ceremony as characterized<br />\nwhistle called the game to an end.<br />\nlast year's introduction of new<br />\nciety of Civil Engineers, the first<br />\nTurner, Strott and Milligan<br />\nallowed to play until they have<br />\nmembers will be observed. A meethaving been addressed by Bancroft<br />\nstarred for the M. E.'s, while<br />\nHill, a Hopkins man, now harbor passed the required grade and their ing was held on Wednesday to<br />\nSchutze, Rowland and Baugh17 E. Baltimore St.<br />\nengineer of Baltimore, who talked names will be dropped from the roll arrange the final details of the<br />\nmann earned the E. E.'s their victapping.<br />\nif they do not make the grade.<br />\non \"Harbors.\"<br />\ntory.<br /><br />\nThe Overcoat<br /><br />\nYouthful novelty o'coats, with<br />\nstylish raglan shoulders, roomy<br />\narmholes, of soft, warm materials<br />\nUnmatchahle values!<br />\n$35 and up<br /><br />\nCli<br /><br />\nCLOTHES<br /><br />\n211-213 E. Baltimore St.<br /><br />\nURNER'S<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br /><br />\nTEN YEARS AGO AT J. H. U.<br /><br />\nDecember 4, 1911<br />\nSophomores defeat Freshmen in ,<br />\ninterclass football game, 24-0.<br />\nClass rush called off by order of<br />\nDr. Abercrombie because there<br />\nweren't enough freshmen in condition.' Impromptu rush held in<br />\nwhich freshmen succeed in retaining most of the flag.<br />\nCotillon Board announces first<br />\ndance to be held on December 8.<br />\nThe program was given as follows:<br />\nSousa<br />\n1. Two Step<br />\n2. Waltz...Count of Luxemburg<br />\nCollege Literature<br />\n3. Varsoirenne.<br />\nLOMBARD and SOUTH STREETS<br />\n4. Two Step....The Loving Man<br />\nThe Siren<br />\n5. Waltz<br />\nThe Spring Maid<br />\n6. Waltz<br />\n7. Two Step0, You Beautiful Doll<br />\nTeach a Lesson in Style<br />\nRed Widow<br />\n8. Waltz<br />\nThey possess the \"dash\" that<br />\nRoll<br />\n.0ceanna<br />\n.....<br />\nTwo<br />\nStep.<br />\n9.<br />\nappeals to college men, toned<br />\ndown to distinctiveness. And<br />\nPink Lady<br />\n10. Waltz<br />\nwearing qualities that provoke<br />\n11. Waltz...The Balkan Princess<br />\nenthusiasm.<br />\nI Want a Girl<br />\n12. Two Step<br />\nN. HESS' SONS<br />\nBlue Danube<br />\n13. Waltz<br />\n8 E. BALTIMORE ST.<br />\nBoston<br />\nSpanish<br />\nEspana<br />\n14.<br />\n15. Two Step—<br />\nAlexander's Ragtime Band<br />\nAmoureuse<br />\n16. Waltz<br />\nWestern Maryland defeats HopMADE TO ORDER<br />\nkins, 6-0, in exciting football game.<br />\nAND<br />\n\"0 Tempora! 0 Mores.\"<br /><br />\nHere is the first attribute<br /><br />\nof a citizen of the world.<br />\nbooks can impart<br />\nit, yet it comes naturally with college training.<br />\nSuch easy familiarity<br />\nwith the good things of<br />\nlife leads naturally to<br />\nMelachrino,\"theonecigarette sold the world over\"<br />\nFew<br /><br />\nc;'-•<br /><br />\nHess Shoes<br /><br />\ns.<br /><br />\nLEMMERT<br />\nFINISHED CLOTHES<br />\nPLAZA BUILDING<br /><br />\nPREVOST HUBBARD TO TALK TO<br />\nCIVIL ENGINEERS<br /><br />\nThe second mOnthly public meeting of the Hopkins student chapter, A. S. C. E. will be held this<br />\nevening<br />\nat 8:15., on the third floor<br />\nSHOES<br />\nof the Civil Engineering Building.<br />\nIt will be addressed by Mr. PreUNIVERSITY MEN<br />\nvost Hubbard, chemical engineer of<br />\nAsphalt Association, who is<br />\nthe<br />\nFor Dress<br />\nFor Sport Wear<br />\nthe<br />\nleading<br />\nauthority in the counSmart Styles—Best Leathers<br />\ntry on asphalt construction, and<br />\nModerate Prices<br />\nwhose company occupies about the<br />\nsame position in the asphalt industry as does the U. S. Steel Company in the steel industry.<br />\n19 W. LEXINGTON ST.<br />\n19 and 21 EAST FAYETTE ST.<br /><br />\nWYMAN<br /><br />\n•<br /><br />\n•.<br /><br />\n• -.A*<br />\n\"<br /><br />\nRemember that Melachrino is a master &lt;'<br />\nblend ofonlythefinestTurkishTobaccos<br />\nas originated by Miltiades Melachrino.<br />\nEgyptian cigarettes are simply those<br />\nthat originated in Egypt. But the tc<br />\nbacco is what you want to know about<br />\n—and if it's Melachrino — it's right<br /><br />\nelachrino<br /><br />\n\"The One Cigarette Sold the World Over\"<br /><br />\nTs,<br /><br />"}], "field_media_file": [{"target_id": 37563, "display": null, "description": null, "target_type": "file", "target_uuid": "364761e0-ad64-412c-ad9f-760795aa21f0", "url": "http://digital.library.jhu.edu/system/files/2022-03/12971-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12971, "target_type": "node", "target_uuid": "62795a78-0028-475a-8e52-4f44499ba21f", "url": "/node/12971"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "442b9be3-321c-4c12-b604-2ad54086ce0a"}]}