{"mid": [{"value": 40322}], "uuid": [{"value": "f6103f4f-82d3-436c-b11b-8e6fdc766a41"}], "vid": [{"value": 40322}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T20:03:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "14354-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T20:03:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T20:03:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Mademoiselle Pontalba<br />\nsays, \"There are two<br />\nreasons for the Mardi<br />\nGras: greed and<br />\ntackiness.\" Look around<br />\nyou. Don't you wonder<br />\nsometimes?<br />\n<br />\nC<br />\n<br />\nCan you spell the name of<br />\nthe New Orleans street<br />\nwhich is pronounced<br />\nCho-pi-too-lifs? Take ten<br />\nWRONG! The<br />\nseconds<br />\ncorrect answer is<br />\n\"Tchoupitoulas.\"<br />\n<br />\nil<br />\n<br />\n,<br />\n<br />\nThe<br />\n<br />\n411<br />\nseason of wildness was approaching and the shroud of worries clutching the city)<br />\nwould soon lift. Many outsiders.would join the revelry, outsiders who hoped that when the 1<br />\ndark curtain rose it would take their worries also. Mardi Gras was at hand and, for at least 1<br />\none day, problems were minute, the world joyful. For a day, the city would raise its headt<br />\nand roar, \"I am the city that Care forgot.\" The present era had brought many change5 to I<br />\nNew Orleans but to this one tradition the city clung with inhuman tenacity.<br />\nPreparations for the celebration were proceeding at a frantic pace in all quarters. Beads and)<br />\ntrinkets had been bought months before and packed away until they were to be thrown to II<br />\nThis mardi gras don't<br />\nthe maw of the crowds. Glittering floats were readied, marching bands practiced -- the cityci<br />\nforget to pay homage to<br />\nthrobbed with anticipation.<br />\n)the deity of nudity and<br />\nIn another, more sedate, section of town,, preparations were also being made.<br />\nfoolishness, The Ty. This<br />\nVery few knew of the small shop. It was in a largo, shrub-surrounded house, an ancient 1 god, like many others in<br />\nmansion. Long ago the house had fallen into a somnambulistic state as untrimmed iyy crept<br />\nthe absurdum family, is<br />\nover•its walls. One day the sleep would end and death would begin. Meanwhile, the mask<br />\ncentral to the celebration<br />\nof this holiday. Each year<br />\nshop checked the pulse.<br />\n)during the mardi gras<br />\nInside the shop the world looked the same. Through the window one could see across the‘11<br />\nresidents of the city of<br />\nlane to the amusement park. Once a haven for high laughter, now its rusty rides and I<br />\nNew Orleans honor The<br />\nrideshow booths remained silent. Unlike the giant across the lane, death had overtaken i Ty by running through the<br />\neasily here.<br />\ni town naked hours before<br />\nOutside the shop, ah, there was a different story. The window faces changed as newr the (lawn. The custom<br />\nmasks replaced the 'old. The emotions of the owners could be read plainly on the faces olh originated in 1873 when<br />\n1 Grand Duke Alexis of<br />\ncloth and glitter.<br />\nRussia, visiting the city to<br />\nThe life of the lane, which had once been mighty, now depended upon the shop. A few)replenish his oyster<br />\ntimes a week a footstep would intrude upon the silence and venture into the multi-visaged 1 supply, decided he needed<br />\nwindow. As he entered the shop the three owners would glance up as one, nod gently, and / the exercise. The Creoles,<br />\nbeing the perfect hosts<br />\nreturn to their work. Later, the customer would leave, never to return, for their products<br />\nthey<br />\nwere and alway have<br />\nlasted long.<br />\nbeen,<br />\ncould not refuse<br />\nThe owners were now bringing out their own old masks, readying themselves for the<br />\ntheir honored guest. The<br />\nmorrow. These masks, dust covered though they were, possessed a beauty born of<br />\nnatives had such a good<br />\npainstaking craftmanship. They were cleaned and layed out, to be worn the next day.<br />\ntime that they naturally<br />\nincorporated the run -Overnight, Fat Tuesday arrived in all its splendor. The three inside the shop glanced<br />\ncalled le vol des<br />\noutside and nodded approval. This was their day, the day the city threw off the modern<br />\ninsouciants<br />\n-- into their<br />\nworld and reverted to the superstitious days of old. They donned their costumes and<br />\nyearly party.<br />\n• stepped out into the madness.<br />\nAll day and all night the three walked the streets. Behind the masks, eyes examined each<br />\nface in the _crowd. One of the three would reach forward and touch the person being<br />\nstudied. Depending on which of the three touched, his thread of life could continue to spin<br />\nlong and prosperous, or it could be measured and.clipped. The three did their job with no<br />\nmalice, but only sad wisdom.<br />\nAsh Wednesday dawned and found the three returning to the shop. The costumes were<br />\nboxed and placed away in a dark niche on a backroom shelf.<br />\nThe three sat down and began weaving a new mask. Clotho spinning the thread, Lachesis<br />\nmeasuring, and Atropos cutting.<br />\n<br />\nri<br />\n<br />\n<L),<br />\n<br />\nw/es paro<br />\n<br />\nFair of beads, or siring, of<br />\nbeads?\" the Philosopher<br />\nasks.<br />\n<br />\n— aloft<br />\n00.110\"fteraI'Vlb<br />\n<br />\n'1'<br />\n<br />\nscenes by dale, placement by peter j.<br />\n<br />\nMardi Gras means many<br />\nthings: a party with<br />\nstrangers; a kiss from one<br />\nyou have never seen before<br />\nand will never see again; a<br />\nstomachful of new and<br />\nexotic food; a costume<br />\nthat makes you somebody<br />\nelse; a screaming that<br />\nnever ends; a never- ending<br />\nchorus of Dixieland.<br />\n<br />\n\fI 10<br />\n<br />\nt<br />\n<br />\nThis week's bar of the week isn't quite the one to stumble home from after the last round at 2, a.m.<br />\nIn fact, it happens to be a unique put-of-town spot‘about thirty miles away in Annapolis,so somebody<br />\nshould be in sufficient condition for the return drive.<br />\nThe Maryland Inn, an:ksurrounding attractions, justify a long trip to the state capital. Located off<br />\nChurch Circle on Main Street, the Inn actually has three separate facilities to choose from. One, the<br />\nTreaty of Paris, is strictly a restaurant; if you're interested in dining in Annapolis, you'd do better to go<br />\ndown Main Street to the Auberge de France (reservations needed— or over to State Circle and the<br />\nBarrister).<br />\nThe main feature of the Maryland Inn, however—the King of France Tavern—deserves an occasional.<br />\nvisit from Baltimore. As the only top-line jazz night club in the area, the King of France regularly<br />\nbrings in performers like Earl Hines, Charlie Byrd, and (sometimes) Dizzy Gillespie. With tables to the<br />\nimmediate front and left of the stage, plus the bararea , about a hundred people usually crowd the<br />\nTavern on weekends, all of them virtually ne,xt to the musicians. The small-club atmosphere is<br />\nintensified by the tradition of keeping quiet and listening during the show, a salutory practice broken<br />\nonly by drunken legislators and excessive Singapore Slingers.<br />\nCovercharge for the shows average four dollars, and they don't turn over the house on weekday and<br />\nSunday shows. The Tavern also operates a \"Jazz Club\" which offers various yearly membership rates<br />\nthat eliminate cover charges and allow a certain number of guests to shows.<br />\nAfter the show finished around midnight, with four solid hours of music behind, you can repair to the<br />\nother section of the Maryland Inn, the Drummer's Lot. A comfortable, candle-lit taproom, the Drummer's<br />\nLot is free of the touristes and plebes that infect the bars around the dock. It's a good place to have that<br />\nlast round in.<br />\n<br />\nril 11, 1111<br />\n<br />\nLooks like this hotel has seen better days, eh? Not a bad spot for<br />\na new subway station,right? Not on your life! This grand old<br />\nbuilding, after years of straddling the skids, is back in the pinks<br />\nthanks to the Marble Bar, which is in the hotel's basement. The<br />\nMarble Bar features nightly entertainment for a small cover -- $1.00<br />\nand an ambience copped straight from the wild and illegal twenties.<br />\nThe prices aren't too bad -- 75 cent a draft, $1.25 for an imported<br />\nbeer, the same for mixed drinks -- and the music is worth wore than<br />\nthe buck they charge.<br />\nThe most exciting group playing at the Congress Hotel is the<br />\ncrazy Loose Shoes Rhythm Band,formerly the fabulous Dog Tones,<br />\na set of characters that will jugband and reggae you into<br />\nslap-happy frenzy. Catch the band's act Monday nights in the<br />\nMarble Bar -- they'll be playing at Hopkins today at 2:00 -- and see<br />\nif they aren't the Lovin'Spoonful ten years on. You won't be sorry.<br />\n<br />\nRestaurants: Two local losers and a bici hit ick!<br />\nHorse of A Different Color Dept. -- Last year in these<br />\nRumor has it that Lenny \"Two-Punch\" Randle was to<br />\npages we enthusiastically recommended Sterling's Crab<br />\nhave been banished to the Texas Pit for a one-month<br />\nand Oyster House (410 West 29th St.) to those bent on<br />\nperiod following his workover of manager Frank<br />\nsampling the Chesapeake's finest wares. Sterling's seafood,<br />\nLucchesi. Kind hearts prevailed, however, and only fined<br />\nwe claimed, was in the same league as Enrico's pizza ir<br />\nhim $23,000.<br />\nManhattan or the Nash Brothers' hot pretzels in South<br />\nThe original Texas Pit, an infernal torture chamber<br />\nPhilly. Sadly enough, we can no longer stand by that<br />\nbeneath dusty San Antone streets, was<br />\nreview, for rarely, has this column encountered a<br />\nbanned by Teddy Roosevelt after Spanish-American War<br />\nrestaurant, fast-food joint, or corner stand which has<br />\natrocities. At 518 Ritchie Highway South in Glen Burnie,<br />\ntaken such a pronounced nosedive in quality.<br />\nthough, the treacherous spirit lives on in this country.<br />\nNeedless to say, prices have risen across the board,<br />\nthreatening'to punish miscreants like Randle and trap the<br />\nowing in large part to this season's scarcity of edible<br />\nunaware.<br />\nsealife. If this was the only drawback it wouldn't be so<br />\nOne scarcely realizes the heritage of the restaurant:<br />\nbad -- we've made it through price hikes before. But it's<br />\nonly a Texas Flag on the wall and early Matt Dillon decor<br />\nthe food that spells disaster for this former prince of crab<br />\nprovide a warning of its true ancestry: We innocently<br />\nshacks, and that (of course)is unforgivable.<br />\nsettled ourselves in after the waitress not only failed to<br />\nSterling's clam chowder, once crowded with taitalizing<br />\nsupply a round of Pearl beers, but even denied knowing of<br />\nclam bits and othet taste treats, is now bland and almost<br />\nthe infamous Southwestern swill. After a perusal of the<br />\nclear broth, save for the annoying scraps of potato<br />\nmenu, however, our worst suspicions were confirmed—a<br />\nhugging the bottom of the cup. The stuffed shrimp, while<br />\npersonal message from owner Bruce Prince on his<br />\nstill greasy as can be, has noticeably less crabmeat in it<br />\n\"Whaddya Mean All You Can Eat?\" philosophy, signaling<br />\nthan a year ago, as do the crabcakes. In fact, one wonders<br />\nthe gastronomic nightmare to come.<br />\nhow long Sterling's will be able to pawn off their<br />\nNo one dared undergo the \"All-You-Can-Eat\" ordeal,<br />\ncrabcakes as the real thing; perhaps crab flavored cakes<br />\n-c remembering the painfully grieved appearances of the<br />\nwould be a better term. The fried-clams were swimming in<br />\nMexican banditi who had suffered an equivalent fate.<br />\nsand the last time around, and, once again, more batter<br />\nInstead, we opted for the two-and-three meat<br />\nwas in evidence than seafood. The list of disappointments<br />\nkt, combination platters, which returned limp strips of beef,<br />\ngoes on and on.<br />\n\"bland ribs, sorry, sausage links, and a shameful chicken<br />\nStill present are the flaws that one used to overlook at<br />\nbreast. The accompanying barbeque sauce (no match for<br />\nSterling's: the long wait for take-out orders, the filthy<br />\nPick of the Week Three cheers and around on the Leon's tongue-tantalizing concoction) could not drown<br />\nappearance of the store (to. be truthful, some of us did house to the new management of the Gorsuch House out the misery of the entrees. Certainly not a cowboy<br />\nand still do get off on Sterling's ratty decor), and the (Gorsuch and Greenmount) for making their restaurant dinner by any standard, even Glen Burnie's. The house<br />\noften less than friendly service. The newest wrinkle in one of Waverly 'S hot spots. Greek food is now offered at drink, moreover, a \"Texas Sour,\" consisted of weak gin<br />\nSterling's- act is to offer ketchup instead of cocktail sauce the Gorsuch House — chunky Green salads go for $3.50 — overpowered by a repellent candied mixer.<br />\nfor a garnish. Now, we all know that Kraft's cocktail as,<br />\nas an improved listing of seafood and meats. The<br />\nTo order dessert would have been sheer masochism; we<br />\nsauce ain't exactly the Ritz, but once upon a time it was fat crabcakes are a bargain at $1,95, and a better Crab .quickly paid our tab and escaped from the restaurant's<br />\nbetter than nothing. On the other hand, what can you Imperial is hard tp find up this way. Give the Gorsuch clutches. For those unfortunate travelers of .Ritchie<br />\nexpect from such a nothing place as Sterling's?<br />\nHouse a shot, it's right in the neighborhood.<br />\nHighway--beware! The Texas Pit lives again!<br />\n<br />\n\fApril 22,1411<br />\n<br />\natc<br />\n<br />\niicws-Icttr<br />\n<br />\ndue on Pfeffer<br />\nThe Academic Council, it has been learned,<br />\nwill request an explanation for the<br />\nScience department's denial of<br />\nPolitical<br />\ntenure to Dr. Richard M. Pfeffer. In its meeting<br />\nWednesday, the Council voted to -ask department<br />\nchairman Robert Tucker to appear at the next<br />\nmeeting to present the department's reasons for the<br />\ndenial.<br />\nAfter the department had decided not to<br />\nrecommend him for promotion to full professor a<br />\nfew weeks ago, Pfeffer appealed to the Academic<br />\nCouncil to set up an ad-hoc committee to solicit<br />\noutside opinions regarding his professional standing.<br />\nAt the previous Wednesday meeting, the Council<br />\nhad discussed the matter, but took no formal<br />\naction.<br />\nIn the meantime, there has been widespread<br />\ncampus support for Pfeffer, especially among<br />\nundergraduates. A petition advocating that Pfeffer<br />\nremain at Hopkins received over 400 signatures this<br />\nweek, and Student Council, an ad-hoc support.<br />\ncommittee, and the Political Science graduate<br />\nktudents have written supportive letters. Various<br />\nfaculty members have also expressed their concern<br />\nover the department's decision.<br />\nThe Council's request for a departmental<br />\nexplanation is an unusual_ one, since in most tenure<br />\n<br />\ncases the Department's decision, if negative, is final.<br />\nThe wide interest Shown in Pfeffer's case apparently<br />\nhas moved the Council into taking such special<br />\naction. As council member William Huggins<br />\n(Mechanics and Material Sciences)commented,\"the<br />\nCouncil is very impressed with the responsible and.<br />\ncareful attitude everyone is taking on this. The<br />\nCouncil won't take any action until it has heard all<br />\nsides of the issue.\"'<br />\nJohn Chancellor, late of NBC Nightly News, has been appointed<br />\nPfeffer's appeal to the Council to set up an<br />\nprocess<br />\nnormal<br />\nthe<br />\nDirector of WBFF, Channel 45, Baltimore's Tele-Movie station.<br />\nin<br />\nNews<br />\ncommittee<br />\nfollows<br />\nad-hoc<br />\nfor tenure decisions: after a department has voted Chancellor replaces Michael Dalton, who has gotten misplaced<br />\nto recommend a member for promotion, the somewhere.<br />\n\"My ratings were slipping and NBC gave me an ultimatum,\"<br />\nAcademic Council then establishes the three-person<br />\n(from<br />\nletters<br />\noutside<br />\nsolicit<br />\nexplained to a surprised Shriver Hall audience Tuesday. As<br />\nto<br />\nCommittee<br />\nChancellor<br />\nad-hoc<br />\nscholars in the candidate's field) commenting on the Frank R. Kent Memorial Lecturer, Chancellor intoned that he had to<br />\nquality of the professor's work. The committee also \"either find another job or make my act more outrageous. But I<br />\nusually charges the department chairman with wagn't willing to become the next Howard Beall.\"<br />\nam a journalist, not an entertainer,\" Chancellor stated. \"And<br />\npresenting an evaluation of the professor's teaching.<br />\nAfter reviewing these, '• and other relevant being forced to prostitute my professional ethics just to stay on<br />\ndocuments and statements, the committee then national television is a state of affairs that I will not put up with,\" the<br />\nmakes its recommendation to the full Academic Emmy-award winning newscaster explained, ending his sentene- with<br />\nCouncil, which has ultimate responsibility for any a preposition. \"All things considered, I would rather be in Baltimore.\"<br />\ntenure decisions. The appeal by Pfeffer, then, comes<br />\nin view of the fact that he had no opportunity for<br />\noutside review after the department's initial decision<br />\nnot to promote him.<br />\n<br />\n...Proxmire resents<br />\n<br />\nnicknames,. Davidson struck<br />\nme as being a consummate<br />\npolitician, as man so slick it's a<br />\nwonder he didn't slide out of<br />\nhis chair. As the first bit of<br />\n,business Davidson requested<br />\nthat several hundred dollars be<br />\ntaken from the News-Letter<br />\nbudget and given to the<br />\nBarnstormers (coalition) and<br />\nthe classes) personal interest).<br />\nApologizing profusely for<br />\n\"unfamiliar with<br />\nbein<br />\nthese procedures\" (alas, he was<br />\nnot an actual representative,<br />\nbut a designate), Davidson<br />\ncarefully mixed clas chauvinism<br />\nand presumed anti-News-Letter<br />\nsentiment with an appeal for<br />\nthe Barnstormers (and who can<br />\nturn down the Barnstormers?).<br />\nA reasonable, if naive,<br />\nappeal. Unfortunately,<br />\nDavidson resorted to<br />\ngeneralizations about the N-L<br />\nwhich belied a lack of historical<br />\ncontext in N-L affairs (to say<br />\nnothing of the _workings of the<br />\npaper itself), but we shall<br />\nforgive him and move on.<br />\nSkipping to the end of this<br />\ntale, the SAC voted 32 to 8 in<br />\nfavor of keeping the<br />\nNews-Letter budget unchanged.<br />\nNo need to fear for the<br />\nBarnstormers, though; they got<br />\ntheir money, as the executive<br />\ncommittee allocated $300.<br />\nWhile we are on the subject<br />\nof arts groups, the Fine Arts<br />\n<br />\nIn a departure from traditional selection practices, the<br />\nHopkins chapter of Phi Beta Kappa has invited a<br />\nbroad-based group of 28 'undergraduates to join its<br />\npiestigious intellectual lonely hearts club. The inductees<br />\nwere selected on the basis of grade-point average, lacLof<br />\ncriminal record, and patrician nose.<br />\nThe induction ceremony will take place April 23<br />\n9:00 AM at La Porte Verte, an exclusive dining salon on<br />\nOld York Road. For the second year in a row, Dr. Roland<br />\nR ei gh tier, President Emeritus of Ilampden-Sydney<br />\nCollege in Virginia. will deliver his famous lecture<br />\n\"Beyond the Gutenberg Galaxy: Marshalling the Printed<br />\nWord- at the ceremony.<br />\nThe following Hopkins undergraduates have responded<br />\n<br />\n.<br />\nI<br />\n<br />\nChancellor resigns...<br />\n<br />\nStudent politics are a real drag<br />\nBy J.D. CONSIDINE<br />\nYou really wonder, after a<br />\nwhile, why it is that the politics<br />\nof student activities are so<br />\nimportant to some people. It<br />\nobviously isn't a reflection of<br />\ngeneral student interest, as most<br />\nelection results will plainly<br />\nindicate. It seems More likely<br />\nthat student politics exists<br />\nsolely for the use and<br />\nenjoyment of stadent<br />\npoliticians.<br />\nTake the SAC, for example.<br />\nThe SAC meets about twice<br />\nyearly, so it seems an unlikely<br />\nspawning ground for political<br />\npower plays. When they met<br />\nTuesday,it- was merely to vote<br />\non budget appropriations. Ron<br />\nBialek expected nothing less,<br />\nand not • much more, and most<br />\nmembers were hoping to get<br />\nthrough the meeting in as little<br />\ntime as possible.<br />\nAs these things go, however,<br />\none group generallywantsmore<br />\nmoney than it had been<br />\nofferred. In this case,it was the<br />\nBarnstormers; they needed the<br />\nmoney to run 'plays in<br />\n.ShriverHall, since it seemed that<br />\nthey would have no other<br />\nsuitable alternative hall. Fine.<br />\nBut where does the money<br />\ncome from?<br />\nIn steps \"Big Stu\" Davidson.<br />\nNow, personally, aside from the<br />\ngeneral aversion I have to<br />\npoliticians with folksy<br />\n<br />\n0<br />\n<br />\ncouncil asked for (and got) an,<br />\nextra two hundred dollars,<br />\nwhich was ,snatched from the<br />\nFlying Monkey appropriation.<br />\n(Just off the cuff, though, Ron<br />\nBialek felt that Flying Monkey<br />\ncould easily get an extra two<br />\nhundred from the Social<br />\nCommittee budget, of which<br />\nboth Flying Monkey and Fine<br />\nArts are subsidiaries).<br />\nOn the whole, those who<br />\ncame to the meeting with<br />\npurely budgetary concerns left<br />\nbasically satisfied, if somewhat<br />\nirritated by the length of the<br />\nmeeting. But the politicos left<br />\ngenerally disappointed. Sure,<br />\nthey had flexed their muscles,<br />\nbut the big prize had eluded<br />\nthem; they were unable to<br />\nprove their power to be<br />\nultimately greater than that of<br />\ntheir adversary. Just as well,<br />\nthough, since an appetite for<br />\npower is only made bigger by<br />\nsuccess.<br />\nAt least they can't cry that<br />\nthe News-Letter has ignored<br />\nthem. Some one once remarked<br />\nthat they disliked voting,<br />\nbecause \"it only seemed to<br />\nencourage them.\" The same can<br />\nbe held with regard to political<br />\nreporting. Still, if one wished to<br />\ndestroy the political credibility<br />\nof some of these clowns, all<br />\nthat would be necessary would<br />\nbe to print a verbatim transcript<br />\nof an SAC meeting.<br />\n<br />\nBy MIKE GIULIANO<br />\nWilliam Proxmire, a United States :senator since 1957 (when he<br />\nfilled the seat vacated by Joe McCarthy) is a powerful man in his<br />\nhome state of Wisconsin, continually reelected by huge majorities, and<br />\nin Congress, where he is chairman of the Banking, Housing and Urban<br />\nAffairs committee. Speaking here Tuesday night, Proxmire stated that<br />\nmany of his fellow Democrats are reluctant to'recognize the giantism<br />\nof the federal government. As an example of how rapidly our<br />\nbureaucracy is expanding, Proxmire cited the Department of Health,<br />\nEducation and Welfare, whose total budget has risen from 7 billion<br />\ndollars in 1965 go 56 billion dollars in 1977. \"We can't solve our<br />\nproblems simply by appropriating money,\" said Proxmire. \"There is a<br />\ncavalier disregard for the value of the dollar.\"<br />\nDisturbed by the squandering of tax money, Proxmire established<br />\nhis Golden Fleece Award, in 1975. The award bestows recognition on<br />\nthe most outraseous federal expenditures. Past recipients include the<br />\nNational Science Foundation, for spending $84,000 on an attempt to<br />\ndetermine \"Why People Fall in iLove\"; the FAA, for taking 75<br />\nmeasurements of airline stewardesses :at a cost of $57,000; and a<br />\n$103,000 study of whether sunfish that drink tequila are more<br />\naggressive than sunfish that drink gin. The Navy estimated that the<br />\ncost of furnishing the vice-presidential house would be $15,000, but<br />\nwhen it actually cost $500,000, Proxmire felt an award was merited.<br />\nThe mansion's resident, Nelson Rockefeller, was not pleased to receive<br />\nhis Golden Fleece Award, stormed into Proxmire's office and<br />\ncomplained: \"Bill, you shouldn't have given me the award. I don't<br />\neven live in that house.\"<br />\nAs the bureaucracy has grown, taxes have risen. The average citizen,<br />\naccording to Proxmire, paid 10% of his income in local,state and<br />\nnational taxes in 1930, 20% in 1940, and pays 37% at the present<br />\ntime. Almost every politician, Proxmire included, favors holding down<br />\nthe size of government and keeping taxes from rising, but few of them<br />\nare as specific as Proxmire about ways in which the government can<br />\neliminate in the military spending.<br />\n\"There's lots of fat we can eliminate in the military budget,\" said<br />\nProxmire. \"The B1 bomber is a turkey.\" The plane is too heavy and<br />\ncarries too light a payload. The original projected cost per plane was<br />\n$25 million, but now it is estimated that a single BI bomber would<br />\ncost $95 million. Proxmire is also disturbed by the size of the<br />\nPentagon bureaucracy: \"We have more civilians working for the<br />\ndefense.department than for all other agencies, other than the post<br />\nmilitary<br />\noffice, combined.\" He estimates that because of the<br />\nwill<br />\nbe a<br />\nDepartment<br />\nDefense<br />\nthe<br />\nin<br />\npromotion system everyone<br />\n2000.<br />\nyear<br />\nthe<br />\nby<br />\nadmiral<br />\nan<br />\nor<br />\ngeneral<br />\n<br />\nto their induction notices: Grant Abrams, M.R. Bongue,<br />\nRalph K. Davidson, Donald Dinegar, Dan Dunlap, Marc<br />\nDuvoisin, Vanessa Evan, Christopher Gray, Alan Hirsch,<br />\nWilliam Lattanfi, Dee Leaven, Alan Lustig,<br />\nMark Hertsgaard, Peter McGuire, II. Ian Nadjari, Sean<br />\nMacConsaidin, Andres Mora, Augusto Pinoehet. Louis'<br />\nReed, Leona 'd Alfred Schneider, Jeffrey Sharp, Ashraf<br />\nPahlavi, R,:r)ert P. Reiser. Tirnoth , Ridley, David<br />\nTannenblatt, Gary Windier, and Nicole White.<br />\n<br />\nMks lioard<br />\nflere's the case: Student X, as we shall refer to him/her,<br />\nfinds him/herself in a tight spot. A chemistry test and<br />\nhe/she doesn't know his/her electron-spin theory from a<br />\nhole in the ground. Failure, to a freshman/woman, will<br />\n<br />\nsurely nirge-Ned School all the more distant. And so. ler!<br />\njust peek over there for number 5...<br />\nWhammo! The long arm of law reaches out and nabs<br />\nStudent X. This poor soul, brought before a jury of<br />\nins/her peers (whom we shall respectively designate as<br />\nwas<br />\nJuror A. Juror B, Juror C. Juror D, arid<br />\non<br />\nan<br />\ncheating<br />\nof<br />\nI)<br />\none<br />\ncount<br />\nof<br />\nLund guilty<br />\nexamination in course, which shall be called atemisti1<br />\n3.2, taught by a Mr. John Gryder.<br />\nThe sentence: failure of the course. The Phoenix of tin.<br />\nmercy-killed Honor Commission, the Ethics Board, liaC<br />\nexercised its awful power of justice last week. Student 1\\<br />\nis now what !Inward K. Smith would call a \"deterrent<br />\nVeritas vos liberat.<br />\n<br />\nwho?<br />\n<br />\n\fpate 4<br />\n<br />\nucws-Icticr<br />\n<br />\nApril 11, 1411<br />\n<br />\nDoctor Money speaks, the whole wide world listens<br />\nResearcher proposes end to sex stereotyping<br />\nCalls for fairer method of competition<br />\nDr. John Money, professor of Medical Psychology and Pediatrics<br />\nat,<br />\nthe Johns Hopkins<br />\nHospital, is a world-renowned authority on<br />\nthe subject of sex. He is the author of several books, including Sex<br />\nErrors of the Body and Man and Woman and Boy and Girl. Money has<br />\nalso done notable work in developmental reading problems of children;<br />\nThe News-Letter sent staff member Rhona Lyons to interview Dr.<br />\nMoney -- here follows Part One of that discussion. Next week, in the<br />\nconclusion of the interview, political and social issues of national<br />\ninterest will be covered.<br />\nHow did you.become involved in problems of #<br />\ngender identity and sexual deviation?,<br />\nWhen I was a graduate student at Harvard,<br />\nthere was a case of intersex<br />\n(hertnaphroditism) presented to the small<br />\ngroup I was a member of. It was a case, as<br />\nI know today, of a fifteen year-old with<br />\nandrogen insensitivity. That meant that he had been born looking,like a girl, except<br />\nthat somebody found two lumps in the<br />\ngroin, decided they were testes and that<br />\nthis person without a penis would have to<br />\nbe raised up as a boy. That was some time<br />\nin the first year of life, when the parents<br />\nhad signed the birth certificate as a female.<br />\nThey were Oven some vague kind of<br />\nprognosis that nothing could be done at<br />\nthe moment, but it could be done when he<br />\ngot to be a teenager and started to go into<br />\npuberty. In retrospect, one can see that<br />\nthis was a case of extremely bad<br />\nmanagement. At puberty, he<br />\ngrew<br />\nbreasts instead of a male body shape. He<br />\nwas in the hospital to see if anything could<br />\nbe done for him. Thet remarkable thing about it was that in spite of the<br />\nhandicap of<br />\ngrowing up without a penis, and in spite of the, shall we call it, the insult of a body<br />\nthat<br />\ngrew in female dimensions at puberty, he was quite persuaded in his self-understanding<br />\nthat he was a boy, and he had the general outlook of a boy. Of course, he was<br />\nmortified<br />\nthat he had no penis, but he certainly didn't act or behave like a girl. I took that<br />\ncase as<br />\na starting point and used the information, the principles that it demonstrated<br />\nas a basis<br />\nfor a search of the literatu-re, medical and psychological, on hermaphroditism.<br />\nThat<br />\nculminated in a term paper which itself became the basis of my PhD dissertation, which<br />\nwas an extensive review of a century worth of medical literature and a detailed<br />\ncase<br />\nwork-up of ten cases of various different diagnostic types of hermaphroditism.<br />\nThe<br />\nperson that I worked closely with in getting those ten cases was Doctor Wilkins from<br />\nthe<br />\nPediatric Endocrine Clinic here at Johns Hopkins, which was the first one in the world,<br />\nand it happened also to be the world's leading center for birth defects of the sex organs<br />\nand the treatment of those children. I came down here for a visit to use the files and see<br />\nsome of the patients and that ended up in an arrangement being made a couple of<br />\nyears<br />\nlater that I would come down here to work. That was 1951.<br />\nHave you encountered much opposition to your work? Do you have trouble getting<br />\ngrunt money?<br />\nWell, back in those days nobody knew I existed, so I didn't get any opposition.<br />\nThe..<br />\nmore visibility one gets in anything to do with sex education or sex therapy or sex<br />\nresearch, then the more opposition develops. This happens to be a'very negative era, as<br />\neverybody knows, for all of science and research in the public mind. I do think that sex<br />\nresearch gets a little extra of that negative reaction. It makes a good whipping boy. For<br />\ninstance, there's a small, media magazine that was first published in 1933 under the<br />\nname Sexology. It was a very serious attempt on the part of the publisher, who,-by the<br />\nway, was the man who first brought out Sports Illustrated, and also the very first of the<br />\nscience fiction magazines and many others—it was a very serious attempt on his part to<br />\nprovide elementary sexual information for blue-collar people. He subsidized the<br />\nmagazine on the basis of his other ones. For more than an quarter of a century, it was<br />\nnot possible to sell that magazine by subscription through the Federal mail because it<br />\nhad sex on the cover and it was offensive to the Post Office to carry it. It had to be sold<br />\nat newsstands only, under the counter. As recently as this year, they finally decided to<br />\nchange its name. The new name is Together. The 'reason for that was that some news<br />\nvendors in polite places, like drugstores and department stores, still will not put a<br />\n. magazine on sale if it has sex on the cover, and it doesn't matter what the contents are,<br />\nit's just the word itself. Well that's a straw in the wind that indicates how strong the<br />\nsexual taboo still reigns in our society.<br />\nYou are often in the position of advising the parents of all infant with ambiguous<br />\ngenitalia ill regard to whic.h sex they will raise their child as. What factors enter into your<br />\ncounseling:'<br />\nPoint number one is that you never assign the baby to be reared in the sex that it will<br />\nbe<br />\ntotally incapable of rehabilitation in. You never rear a baby in the sex that it will not<br />\nbe able to function well in, especially in the sexual life of adulthood. So if the evidence<br />\nof<br />\nyour senses is that this baby has no penis., then you never expect it to be raised as a<br />\nboy<br />\nbecause there .is no technique for creating an adequate penis by surgery. It's been<br />\nattempted. especially for a boy or man who loses his penis. What it produces is better<br />\nthan nothing for him. but it still isn't a workable penis. It's okay for creating a bulge<br />\nin<br />\n<br />\nhis bathing suit. It may even be okay for passing me urine, but you never can get it so<br />\nthat it-will be erected enough or solid enough to go into the vagina in intercourse. Now<br />\nthe other way around, when you see a baby born with a penis it is quite possible,<br />\nalthough it's extremely rare, that there are no testicles but that baby could have two<br />\novaries inside and a uterus. Under those circumstances, surgery can be completely<br />\neffective and rehabilitative, and the person can grow up to have intercourse as a woman,<br />\nand have a pregnancy. So you need first of all to look at the evidence of your senses, as<br />\nto what can-be donewith the genitalia in corrective surgery. And second of all, you need<br />\nto have the diagnosis so that you actually know what it is you're working with, which<br />\ncondition, whether any other supportive treatment is necessary. The decisions that cause<br />\nthe biggest difficulty are those of babies who are chromosomally male and who have two<br />\ngonads that are actually testicular in structure rather than ovarian, even though its<br />\nusually defective testicular structure . People tend to look for the chromosomes, the<br />\nactual chromosome count as being the absolute standard. It isn't so. For example, it's<br />\nquite possible to have a genetic male, XY, with two testicles in the abdomen in a<br />\ncompletely normal female body.<br />\nAt what age to you involve the child in this decision? How much does he or she become<br />\ninvolved in the process?<br />\nYou have a pretty free hand up until<br />\nabout eighteen months of age. Eighteen<br />\nmonths is • not a fixed cut off point<br />\nbecause it's a little variable from one child<br />\nto another. For most children,however, it<br />\nis the age at 'which they begin to get<br />\nlanguage and they very rapidly get to<br />\nunderstand sex differences in language<br />\nbecause it's so essential a- part of our<br />\nlanguage as people classify as \"he\" or<br />\n\"she\", \"boy\" or .̀`girl\". So, it's at that<br />\nstage that children begin to pick up some<br />\nof the universal criteria of sex difference<br />\nas well as the linguistic ones...and sooner<br />\nor 'later, anatomy. You don't have a native<br />\nlanguage at eighteen months, but you do<br />\nhave one by four and a half, and in those<br />\nintervening years it's all been settled. So<br />\nby the same age you have differentiated<br />\nthe essential core of your gender identity,<br />\neither as male or female or somewhere in<br />\nbetween. So what it means is that the<br />\nolder a child becomes after eighteen<br />\nmonths the more you have -to respect the<br />\ndegree to which the gender identity has already differentiat<br />\ned when you begin to make a<br />\ndecision. Let's jump ahead and say I have a twelve-year old who<br />\ncomes in and gives me a<br />\nvery clear message that other people must have made a<br />\nmistake from birth onwards<br />\nbecause this child says, \"I just don't belong as a girl.\" I've had that<br />\nhappen—in 'a child<br />\nthat had two ovaries. I've also had the same diagnosis in another child who.said,\"They<br />\ntold me I was a boy but it's not working,so you better change me over to be a girl.\"<br />\nIn<br />\nboth of these families nobody had ever been certain if the child reallywaS supposed to<br />\nbe<br />\na boy or a girl. The case had been managed at the time .of birth in such a way<br />\nthat the parents were not given a clear directive. That<br />\ndoes happen still in modern<br />\nmedical practice.<br />\nThe Olympic. Committee, along with other sports organizations, decide on sex by use of<br />\nthe Barr body test (chromosomes). How do you feel about this? Can you suggest a .fairer<br />\nmethod?<br />\nTake your pants down and have a look.<br />\nDo you feel that's the only criteria?<br />\nNo, I think there's a proper answer to this dilemma. Instead of<br />\nhaving people compete<br />\non the basis of physique as they do only in wrestling and prize fighting,<br />\nthey should have<br />\nit for all the sports. After all, if you subdivide people for tennis<br />\nonly on thesbasis of<br />\nwhether they're men or women, you still don't allow a place for the very<br />\nsmall built<br />\nwon—n,or man, nor for the very large built one. In other words:this idea<br />\nof only men in<br />\none group and women in the other group has a hidden assumption<br />\nthat all the<br />\ncompetitors will be of average size,.and it doesn't allow for any of the variations and<br />\nextremes in body build in human beings. If we did make that allowance then it wouldn't<br />\nmatter whether somebody was reproductive as a male or as a female.<br />\nDo you feel this change will ever come about?<br />\nWell, you know people do get their gender identity built into them<br />\n-with the same depth<br />\nand intensity as their native language. You threaten any, even very superficial, part of it<br />\nand the threat is experienced as a threat to the entirety. When you talk about making<br />\nthe vocational role unisex, instead of stereotyping them as male or female, a great many<br />\npeople experience that as a threat which would include the idea that you're going to<br />\nmake their sex organs unisex as well. Well, the same thing happensiwith. regards to sports<br />\ncompetition. What you are doing is breaking the convention that men shouldn't<br />\ncompete with women. And then a whole lot of people feel that you are asking to get rid<br />\nof their sex organs for that sarane reason.<br />\nDo _vou feel there's any hope for the androgynous child, a child who is reared in an<br />\nenvironment that does not dictate sex roles?<br />\n•<br />\nWhether children can be reared like that will depend on whether social customs change.<br />\nRight now we code almost everything we can think of in terms of sex. We've even coded<br />\nnouns as to whether they're male nouns or female nouns, regardless of what they signify.<br />\nThere's a little of it left in the English language. The romance languages are full of it. So<br />\nwe're pretty obsessed with maximizing sex 'differences and introducing them everywhere<br />\nwe can. Well, we could have had several thousand years of history of maximizing the<br />\nsimilarities between the sexes, but we haven't. So, at the very minimum,it takes time to<br />\nchange.<br />\nYou have to begin somewhere. Are you going to begin with<br />\nthe old generation first, or with the new?. Are you going to rely on chance toget the<br />\nchange going or are you going to engineer it? That's a tough one.<br />\nto be continued next week.<br />\n<br />\n\fThe love story<br />\nthat will<br />\nscare the hell<br />\nout of you.<br />\n<br />\nthe<br />\nOBSESS/ON<br />\n<br />\nand a short by Baltimore flmmaker Rick Puller<br />\n<br />\nratc<br />\n<br />\nnews-letter<br />\n<br />\n- nal 12 1411<br />\n<br />\nCOLUMBIA PICTURES PRESENTS<br />\nA GEORGE LITTO PRODUCTION/A BRIAN DE PALMA FILM<br />\n<br />\nCLIFF ROBERTSON & GENEVIEVE BUJOLD IN OBSESSION<br />\n<br />\nFRI APRIL 22 SHRIVER<br />\nSAT APRIL 23 REMSEN 1<br />\n<br />\n7:30 & 10:00<br />\n<br />\nVNOFF-CAMPLIS<br />\n/ .i.NI LIVING<br />\nIV<br />\nAT<br />\n<br />\nG OUCHE<br />\n• SUBURBAN<br />\n• HOURLY<br />\n• FOOD<br />\n<br />\nCAMPUS LIVINEr<br />\nBUS SERVICE<br />\n<br />\nSERVICE<br />\n<br />\n• COED<br />\n• AVAILABLE: SEPTEMBER714/77<br />\nFOR FORTN-UEIR IINIRDIRIMATlleN/<br />\nCONTACT:<br />\n<br />\nBELVA SCOTT<br />\n<br />\n338-7f58 ?_1\"6-eN1PgsmcE<br />\n<br />\nVc<br />\njOLMAN NALL<br />\n<br />\nDON'T MI“ THE<br />\nqi(AND OFEN1<br />\n<br />\nI)A. KkPE<br />\n<br />\nOF THE<br />\nJ0HN4 HOPK1N6<br />\n4mNq FAIR<br />\n<br />\n11(1DAY, APRIL 22,<br />\n12=00 Now-- Gulag,<br />\n5TKEET mom 29v-03471<br />\n<br />\n\fSI<br />\n<br />\nincivs-Icttct<br />\nt-Lc frichv<br />\n<br />\neditor-in-chief<br />\nEric Garland<br />\nBusiness Managers<br />\nVanessa Evan<br />\nCarole Jaffe<br />\nmanaging editor<br />\nDavid Hawk<br />\nfeatures editors<br />\nJ.D. Considine<br />\nMike Giuliano<br />\nphoto editor<br />\nJennifer Bishop<br />\nsports editor<br />\nDavid Kraus<br />\ngraphocs editor<br />\nScott Marks<br />\nhigher consciousness<br />\nD.H. Warren<br />\ninterior decoration<br />\nRhona Lyons<br />\nnon-circulation editor<br />\nHowie<br />\nproduction<br />\nDale Horan<br />\n<br />\nbar editor<br />\nA. Press<br />\nfiction editor<br />\nG.M. Smith<br />\nthe man who fell to earth<br />\nJoe Rodrigue<br />\nforeign affairs desk<br />\nMark Hertsgaard<br />\nmardi gras editor<br />\nWes Pardue<br />\nwhat the fuck do you want editor<br />\nJoe Tate<br />\nwelcome home editor<br />\nClayton Buick<br />\nrepairs editor<br />\nDante Landucci<br />\ntimonium bureau<br />\nBiff Burns<br />\npimlico bureau<br />\nThe Man From New York<br />\n<br />\nFair Issue Production<br />\nAgitation Press<br />\n<br />\n\"The whole world is<br />\nseven hits behind.\"<br />\n<br />\nL<br />\n<br />\ntenuous<br />\nhe recent decision by the Political Science department<br />\nnot to recommend Ric Pfeffer for promotion exemplifies<br />\nsome of the worst features of this university, narrow<br />\nattitudes that have become all too common over the past<br />\nfew years.<br />\n•<br />\nIn Pfeffer's individual case, a person who has contributed<br />\nso much to Hopkins -- in teaching, in working with fellow<br />\nprofessors, in scrutinizing the administration, in making<br />\npeople aware -- denied tenure by his department and forced<br />\nto leave the University indicates a callously formal play of<br />\nacademic ritual. For the department's decision to stand (in<br />\nlight of the not unimportant fact, that no Marxist has ever<br />\nbeen tenured at Hopkins), without due process of review by<br />\nan Academic Council ad-hoc committee, would go down as<br />\nan officious disregard of an entire career.<br />\nOn the departmental level (fiefdoms which a prominent<br />\nprofessor has termed the \"intellectual slums\" of the<br />\nUniversity), the tenure process has become so rigid and<br />\nsecretive that, while the departments naturally maintain<br />\ntheir own ranks, special cases like Pfeffer are all too easily<br />\nlost within the Gilman corridors. The Academic Council, in<br />\nwanting to avoid what would amount to a slap in the<br />\nPolitical Science department's face, has taken a slow,<br />\ncareful approach to Pfeffer's appeal. That appeal should be<br />\ngranted, in that the denial of tenure means a denial of<br />\nOutside review by academic peers, and a seeming disinterest<br />\nin teaching and general contributions to Hopkins. While the<br />\nCouncil proceeds cautiously, taking some sideways steps,<br />\nthey should consider as one goal resolving Pfeffer's position<br />\nbefore the end of the term. That, at least, would show some<br />\nregard for the largest part of the University --undergraduates -- and for someone who is of tremendous<br />\nvalue to all parts.<br />\nTo the Editor:<br />\nUniversity administrators<br />\naround the country, President<br />\nMuller included, have recently<br />\ndecried the seeming failure of our<br />\neducational institutions to train<br />\nstudents to think critically, write<br />\neffectively, and communicate<br />\nclearly. In his recent essays in<br />\nJohns Hopkins alumni<br />\npublications, Dr. Muller has<br />\ncriticized his own institution for<br />\nthis same failure, noting that<br />\nthese basic goals of university<br />\neducation have somewhere been<br />\nlost in the scramble of students<br />\nfor professional certification and<br />\nin the pressure on faculty to<br />\ngenerate research and<br />\npublications.<br />\nNowhere is the urgency of this<br />\nissue more apparent than when a<br />\nsuperb teacher on the faculty is<br />\ndenied tenure and eliminated<br />\nfrom the University -- ostensibly<br />\nfor failure to meet those same<br />\n<br />\nWHAT0)IT,<br />\nLEONID?...<br />\nA LITTLE HEAVY<br />\nON THE APPLE<br />\nFE, RIGHT?<br />\n<br />\nprofessional standards that have<br />\nbeen blamed for the decline of<br />\neducation in our universities. The<br />\nrecent departmental decision not<br />\nto promote Professor Richard<br />\nPfeffer -- who was, during my<br />\nyears at Hopkins, a teacher of<br />\nunequaled skill and dedication -is a tragic example. Put quite<br />\nsimply, Professor Pfeffer is one<br />\nof the precious few faculty<br />\nmembers left on the Homewood<br />\ncampus who demands of students<br />\nthat they think critically and<br />\nwrite effectively -- and who is<br />\nwilling at the same time to<br />\nexpend effort to impart these<br />\ninvaluable skills.<br />\nIf the University is at all<br />\nserious about its commitment to<br />\nthe most basic goals of higher<br />\neducation, its Academic Council<br />\nwill seriously consider Professor<br />\nPfeffer's appeal to have this<br />\ndecision reviewed.<br />\nAndrew G. Walder<br />\n<br />\nBy G.M. SMITH<br />\n. dring the day Willy works in an office. At<br />\nnight he cooks a quick dinner, maybe reads a<br />\nmystery, maybe blots out on alcohol and<br />\ntelevision, then goes to bed. On weekends he loafs,<br />\nusually with Sally.<br />\nSally is married to a man who owns a chain of<br />\nconvenience stores. Sally's husband is always on<br />\nthe road. Often he sleeps in the back of one of his<br />\nstores. When he comes home,smelling like tobacco<br />\nand sour milk, he wants to make love and eat a<br />\nhome coked meal. Sally obliges him and spends<br />\nmost weekends with Willy.<br />\nOne weekend Sally talks about hobbies.<br />\nYou've got nothing but your job, she says to<br />\nWilly, and you've been bored with that for years.<br />\nYou don't have a wife, you don't have children,<br />\nyou don't have pets, you don't even have any<br />\nhouse plants. Think about that. You don't even<br />\nhave any house plants.<br />\nWhy are you telling me this? Willy asks. He's<br />\nsitting at the: kitchen table, cleaning his nails with<br />\nthe corner of a matchbook.<br />\nBecause you don't have anything, Sally says.<br />\nYou'll be 45 in June and already you look 50. Why<br />\ndon't you go out and get a hobby?<br />\nWhere do you get a hobby?<br />\nHow should I know? I've never needed a hobby,<br />\nI've got a husband. But you, you need a hobby.<br />\nThat's plain.<br />\nWilly looks for a hobby to please Sally. He reads the hobby books she brings him and decides he will<br />\ncollect something.<br />\nWhat? Sally asks.<br />\nWilly collects tequila bottles. Glass-blown<br />\ntequila bottles from Mexico. The craftsmanship is<br />\nadmirable. But his interest flags. The tequila gets in<br />\nthe way. Sally tells him he isn't kidding anybody.<br />\nWilly collects the Lew Archer mysteries of Ross<br />\nMacDonald. He collects the Travis McGee<br />\nmysteries of John D. MacDonald. He collects the<br />\nNero Wolfe mysteries of Rex Stout. Sally tells him<br />\nto look around for something else.<br />\nWilly collects newpaper clippings of victimless<br />\ncrimes like gambling and prostitution and<br />\nmarijuana busts.<br />\nSally decides Willy is through with collection.<br />\nShebrings more hobby books. Willy says he will<br />\nmake something. He will create. He makes a<br />\nweathervane for his chimney. Sally nods approval.<br />\nShe and Willy spend an entire Sunday afternoon in<br />\nbed.<br />\nWilly makes a second weathervane, one for<br />\nSally, but she won't accept it because she doesn't<br />\nknow what to tell her husband. This puts Willy off.<br />\nTo spite her he starts collecting tequila bottles<br />\nagain, arranging the empties artfully in a broom<br />\ncloset.<br />\nMore hobby books. Willy is getting plenty tired<br />\nof hobby books, but Sally borrows them from the<br />\npublic library, insists Willy read them.<br />\nWilly decides he will , do something. Something<br />\nactive. An action hobby.<br />\n<br />\nHe buys a pail e aric<br />\ngames. Willy never di<br />\nhas always felt che :out<br />\nkids threw dice.<br />\nWilly learns to ( He(<br />\nfavorite dice garlic. he<br />\npj<br />\nand Drown The Cat .dIt Ra<br />\nand<br />\nNail<br />\nStep On A<br />\nNow what are yo tng to<br />\nWilly drives to<br />\nshops until he finds 4tieof<br />\nthe air shiver when<br />\nhis<br />\ndrives home and th vay.<br />\nsta)<br />\nSally<br />\ngets chilly.<br />\nboil Ice in<br />\nWilly puts his<br />\n1` of<br />\na black and whit , )<br />\nHe .is in a pit. A b°<br />\nfollow.<br />\nHe buys a dart 130 ifed1rt<br />\nO<br />\nHe buys a W<br />\n<br />\n4/ ,<br />\n<br />\na<br />\nHe buys a harjk,<br />\n<br />\nplay \"Yankee<br />\n1<br />\nbecomes distraugle<br />\nf0<br />\ngS<br />\na<br />\ni,<br />\nns<br />\nbeneath her eyes•411..x..tell<br />\nplace. I'm really<br />\nThen Willy e0174T11,<br />\nunder his arm- ijeri;hns<br />\npractices for hours' t<br />\nstretches from otiche<br />\nSally gives uPo<br />\n'Is<br />\nWilly slips, wrencr<br />\nass.<br />\nWhat?<br />\n,i :„iyov<br />\nSally calls<br />\n,<br />\nwilly<br />\ntablecloth.<br />\nanesthetize<br />\n4:41:s\\V.h..<br />\n:<br />\ngAl with<br />\niltilY<br />\ndoa<br />\nroad<br />\nthenWi '<br />\nl Pt ertiShialsul l '13<br />\nweek. When he rik-e<br />\nhead. He bites<br />\nthrough a bad tootfr<br />\n<br />\n\f4<br />\n<br />\niretlff2TttiLtil-<br />\n<br />\nU<br />\n<br />\n441<br />\n,<br />\n<br />\nir otl'e and teaches himself dice<br />\nvet dice, as a youngster and<br />\ndie Out of adolescence. Other<br />\n<br />\nto<br />\n<br />\nHooligan, for awhile his<br />\nlearns to play Poison<br />\n01 ig and<br />\nDrop Dead and<br />\nit Raw. He gets bored.<br />\nyoU \"g<br />\nto do? Sally says.<br />\n0 t c'lY and<br />\nhaunts the pawn<br />\n11CIS lit of bone dice<br />\nthat make<br />\n[erl rttles them<br />\nin his hand. He<br />\nth I bis bone<br />\ndice. The house<br />\n<br />\nDe. 141 he<br />\n<br />\nSta)<br />\n<br />\nboO ce in a<br />\ndresser drawer with<br />\nte r. if)ofhis dead<br />\nadolescence.<br />\nbr' NIL More action hobbies<br />\n<br />\ntio 'nd tosses<br />\ndarts.<br />\nitillOfe and<br />\nthrows it at birds.<br />\n<br />\n'die:, a Hohner, and learns to<br />\nvI;h in 35 seconds. Sally<br />\nl'. e lifts<br />\nbags of skin from<br />\ntags<br />\ndo not snap back into<br />\nii<br />\nItells<br />\nherself.<br />\nk nie with a limbo record<br />\ntns to do<br />\nthe limbo and<br />\nllin<br />\n)<br />\n(<br />\nI uP a bamboo pole that<br />\n, e ,)-. the<br />\nkitchen to the other.<br />\nSile .111i ts on the kitchen floor.<br />\nIlk Is<br />\nback. Sally calls Willy an<br />\n<br />\n1<br />\n<br />\ni 1i<br />\n'101 ' v*Ping<br />\nto<br />\n.her mouth on the<br />\n' the liquor cabinet .to<br />\nIf'ilY<br />\n' t)!r calls Willy a liquonsh<br />\nici. ts. b.<br />\ni . isaPpears. Goes on the<br />\n01/ W<br />\n'<br />\n11Y sleeps in tequila for a<br />\nls sullen. He hangs his<br />\nOf his<br />\nhand. He sucks air<br />\n11.<br />\n<br />\n-444,44- -444•••-4,<br />\n4-4<br />\n,<br />\n<br />\n*<br />\n<br />\n** *<br />\nw44 44......•••••••<br />\n44444,<br />\n<br />\n4+,4<br />\n<br />\n* **<br />\nrdr<br />\ntaillSrah:*<br />\nJo<br />\nLa:W*6W<br />\n:=4\"11—<br />\n.441\"<br />\n.<br />\n\" *** \"-a.<br />\ntanittr\"t.....<br />\n*<br />\n•<br />\n<br />\n.4.44<br />\n•<br />\n•-444.<br />\n<br />\nttip<br />\n<br />\n****=SIM<br />\n<br />\n444,4.+4.4.4-1,4.44,44.44•44444444<br />\n'<br />\nV4i<br />\n<br />\n17\"4<br />\n.+-4••<br />\n<br />\n41=44+44<br />\n44411ett4<br />\n<br />\n444<br />\n.414-'1'<br />\n<br />\n44.<br />\n<br />\nfair fiction * fah<br />\nBy JOHN PERROTTA<br />\nindo pedaled along the viale looking at the<br />\nfat saffron sign<br />\nwhores. Overhead, a<br />\nblinked against the evening sky -- a gas station. He<br />\nturned and headed for the pump, rainwater<br />\nshooting from the brakeshoes as he slowed.<br />\n\"Ciao! Nando!\" The old attendant tightened the<br />\ngas cap on a Fiat Cinquecento. 'Climbing hills<br />\nagain?\"<br />\n\"'Walls' is more like it, Basaluzzi.\"<br />\n\"What about the little puttana on Via San<br />\nFelice?\"<br />\n\"Ah, she's gross.\" He rocked back and forth<br />\nover the handlebars of his bike.<br />\n'Sure, Nando. Sure she is. But don't worry,<br />\nthere's plenty around. Don't be so obvious, you're<br />\nlike a green kid! You got to have authority,<br />\nclaSs . . .\"<br />\nNando shrugged his shoulders, popping his head<br />\nforward and opening his-hands.<br />\n\"Maybe you need a two-seater, huh?\" Basaluzzi<br />\nsaid, wiping the drizzle off his forehead and<br />\nlaughing. A Volkswagen pulled in. \"Keep 'em<br />\ncrossed, hey? Your fingers, I mean.\"<br />\n\"Thanks, Basaluzzi. You check her oil when I get<br />\nher, va bene?\"<br />\nWhen the sky went dark he dOwnshifted, and<br />\nthe chain rasped the metal until it caught the larger<br />\nsprocket. Only at night would he dare ride so<br />\nslowly.<br />\nWhore number three. She acted like she had an<br />\nappointment with the mayor. Her eyes checked her<br />\nwatch, her purse, herfeet, up and down the viale,<br />\nwatch, purse, street — over and over.<br />\nHe sliced through a puddle, and water fanned<br />\nover the curb in oily rainbows. He stared at a<br />\nyoung girl wearing a chemise with the price tag still<br />\nattached. She threw a fist in her elbow and curled<br />\nup her arm.<br />\n\"Me ne frega!\" Nando yelled back. He smiled,<br />\npedaling under the wet light of the street lamps.<br />\nAhead three cars splashed their lights on the<br />\nbody of a woman. She had eyes like Perugina<br />\nchocolates, and protruding lips below a perfect<br />\npyramid nose. She wore a man's white dress shirt,<br />\ntight UFO jeans, and a shoulder purse. In her hand<br />\nwas a green-white-red umbrella.<br />\nNando, struck by her dress as well as her beauty,<br />\ndidn't see the Fiat ahead of him; the bike scraped<br />\nagainst the rear fender. He waddled over the bike,<br />\nhis face pink in the light of the oncoming cars.<br />\nThe whore giggled under her umbrella.<br />\nCircling around, he got back in line. A wet<br />\nwindow lowered, and out popped a mass of curly<br />\nhair. She stood by the car talking.<br />\n\"What am I,\" the driver shouted,\"millionario?\"<br />\nHe jack-rabbited into the traffic.<br />\nNando moved up, leaning over on his bike.<br />\n\"How much'?\"<br />\n'Three hundred thousand lire.\"<br />\n\"Quanto?\" he asked, amazed.<br />\n\"Three hundred thousand lire, and you need a<br />\ncar.\" She turned, leaving him to face the dome of<br />\n<br />\nher umbrella.<br />\n\"Cazzo!\" He walked around it, swinging a leg<br />\nover his bike. \"Get on!\"<br />\n\"Che? What do you think I am,a child? Via!\"<br />\n\"Uli, well, uh . ;what about a walk?\"<br />\n\"What do you mean,a walk?\"<br />\n\"How much,just to walk with me?\"<br />\n\"Fifteen thousand lire, no twenty thousand.\"<br />\nShe looked at him curiously, defiantly.<br />\nHe got off the bike, broke the back wheel and<br />\nstacked it with the front, locking both to the No<br />\nStanding sign. He handed her three bills. She closed<br />\nthe umbrella, creased the notes neatly and slipped<br />\nthem into her purse.<br />\n\"Pronto?\" she asked. \"Andiamo.\"<br />\nThey walked in silence for a few minutes, Nando<br />\ntwice reassuring himself that his pants were<br />\nbuttoned.<br />\n\"My feet hurt,\" she said. \"Let's go to the Piazza<br />\nMaggiore.\" She turned before he could answer.<br />\nUnder the porticos store owners in shop aprons<br />\npulled their doors down one third of the way. It<br />\nwas almost closing time. \"Are you Bolognese?\"<br />\n\"Yes,\" Nando said.<br />\n\"Where do you live?\"<br />\n\"Parents. How long have you been a, a<br />\n\"A whore? Oh,seventy-two years.\"<br />\nThey entered the piazza and sat on the steps of<br />\nSan Petronio, the unfinished façade to their backs.<br />\nMen with derbyish hats stood in groups, in circles,<br />\ntheir hands behind their backs.<br />\n\"I love it here,\" she said. \"Especially Neptune.\"<br />\n\"The fountain?\"<br />\n\"Yes.\"<br />\n\"Ornello did it, or was it DiCristofaro?\"<br />\n\"Ha! Stupid°, the artist wasn't even Italian. It<br />\nwas Jean de Bologne, the Flemish sculptor who<br />\ncame here to escape oppresion in his own<br />\ncountry.\"<br />\n\"He chose the wrong place,\" Nando said, trying<br />\nto sound sure of himself.<br />\n\"Of course, considering what the Medici was<br />\ndoing here in Emilia.\"<br />\n\"You studied art, I guess.\"<br />\n\"I study art, yes. What do you do?\"<br />\n\"Set constrution. In the Teatro Comunale.\"<br />\n\"I saw I ysistrata there last week -- have you<br />\nseen it?\"<br />\n\"No,\" he said. \"I'haven't had a ch—\"<br />\n\"Superbo! The Ragazzini translation is better, of<br />\ncourse, but I did meet Cinesias backstage. He took<br />\nme to dinner at Donatello's.\"<br />\n\"He . . he did? Tocco? What did you do for<br />\nhim?\"<br />\n\"Yes, he is so nice. And he has a charming wife,<br />\nBianca.\"<br />\n\"Opening nights I sell tickets,\" he said. \"Other<br />\nnights I ride around Bologna looking at your<br />\nfriends on the viale.\"<br />\n\"Do you talk with them?\"<br />\n\"They don't give me a chance. You're the first.\"<br />\n<br />\n\"Oh, yes? Let's get something to drink now.\"<br />\n\"Okay.\"<br />\nThe caffe was welliit, with floor-to-ceiling<br />\nwindows all around. They sat opposite each other.<br />\nWho'd ever drink with a whore, he thought.<br />\n\"What would you like?\"<br />\n\"Coffee.\"<br />\n\"Coffee?\"<br />\n\"Lots of sugar.\"<br />\nHe brought two espressos back to the table. A<br />\nyoung couple sat in the corner, their hands<br />\ntogether on the dark wood table, a finished puzzle.<br />\n\"Come ti chianti?\" she asked.<br />\n\"Nando. Nando Forli. E tu?\"<br />\n\"I'm Filomena Ingamba.\"<br />\n\"Ingamba?\" he asked, surprised. `,`Wasn't your<br />\nfather mayor?\"<br />\n\"Yes, how did you know?\"<br />\n\"How did I know?\" he asked incredulously.<br />\n\"Everyone knows! His picture's been all over the<br />\npapers, his name, everything! Yours too --- I've<br />\nseen your picture in II Resta di Carlino.\"<br />\n\"Only once or twice,\" she said.<br />\n'But what about his reputation'? What if<br />\nsomeone recognizes you? You'll ruin him!\"<br />\n\"Who'd expect to buy a night with the mayor's<br />\ndaughter?\"<br />\n\"Dios. bono! There you are in bed and you think<br />\nhe won't know you? Your face?\"<br />\n\".You worry too much; you're a child. How<br />\nmany times do you think a girl like me gets<br />\npropositioned? Huh? Ten times a day? Twenty?<br />\nAnd what do you think they want? In my father's<br />\noffice it was the same. I couldn't stand it. So now I<br />\ngive them what they gave me.\"<br />\nNando brought the coffee cup to his lips even<br />\nthough it was empty.\"How long?\" he asked.<br />\n\"Sixty nights, maybe more. I wait on the viale<br />\nfor an hour. I ask an absurdly high price. They<br />\ndon't argue, they drive away. I've never had a<br />\ncustomer in my life.\"<br />\n\"The girl who never gets picked up,\" he said.<br />\n\"Amazing.\"<br />\n\"You're the first, Nando. Congratulations. And<br />\ngood-bye.\" She walked out of the calft, leaving<br />\nNandi), the cup still at his lips.<br />\n\"Wiiit!\" he shouted, \"I haven't finished.\" Ile<br />\ndropped the cup and headed for the door.<br />\n\"11 conto, sipor,\" said the bar attendant.<br />\n\"Don't forget the bill.\"<br />\nNando fumbled in his wallet for some notes.<br />\nThe bus pulled away from the stop before he<br />\ncould reach it. She was standing in front beside the<br />\ndriver. He stood there for a moment. stunned.<br />\nThere were whores on the viale. Ile took his bike<br />\nfrom the No Standing sign and snapped it together.<br />\nRainwater iced the asphalt. Trees dripped. Ile<br />\nheard the constant hiss of small rubber tires<br />\nthrough water. Pedaling around the viale. past the<br />\ngas station where Basaluzzi worked, he noticed the<br />\nsaffron light was black.<br />\n<br />\n\ftrite S'<br />\n<br />\nApril 22, 1411<br />\n<br />\nncws-letter<br />\n<br />\nThe National Theatre Company Presents:<br />\n<br />\n\"Iiravos, laughter and people) filled th• hems* ail elm**<br />\nAnna KIssolgoff - The NW York Times<br />\n<br />\nThe Johns Hopkins<br />\nUniversity Band<br />\npresents its<br />\n<br />\nSpring Concert<br />\nSaturday<br />\nApril 23,1977 Sinn<br />\nShriver Auditorium<br />\nSHRIVER HALL<br />\nJOHNS HOPKINS UNIVERSITY<br />\nApril 24 — 8:00 p.m.<br />\nTickets<br />\n<br />\nStudents<br />\n<br />\nAdults<br />\n<br />\nFREE<br />\nADMISSION<br />\n<br />\nTickets on sale at Union Desk & at door<br />\nSponsored by the Un on Board<br />\n<br />\nCOURSE GUIDE SUPPLEMENT<br />\nDue to some problems in production these courses were not listed in the COURSE GUIDE<br />\nWe apologize to both students and faculty and look forward to continued support from<br />\nboth. Course Guide Editorial board.<br />\n<br />\n10.1 is a reprint.<br />\n80.371 was inadvertently listed as 10.371,<br />\n13.651 Reading in the Mishnah<br />\nDr. Rosenblatt<br />\n- Professor's statement: Readings in the Mishnah. The text of tractates<br />\nfrom the<br />\nOrders of Mo'ed, Nashim and Nezikin will be studied, noting content as well as linguistic<br />\nfeatures of Mishnaic Hebrew. To be continued in the spring.<br />\n13.653 I bn Ezra and Nachmanides<br />\nDr. Rosenblatt<br />\nProfessor's statement: I bn Ezra and Nachmanides. The commentaries of these two<br />\nmedieval exegetes on portions of Genesis and Exodus will be read and their distinctive<br />\ncharacteristics noted. To be continued in the spring by a study of other exegetes.<br />\n13.657 Jewish Philosophical Literature<br />\nDr. Rosenblatt<br />\nProfessor's statement: Jewish Philosophical Literature. The philosophical writings of<br />\nwill<br />\ng e9nnt e pB4F, tay 'tic'ePre'L<br />\nbcri srce2lti itnndoq iIELes,VcYr<br />\n'<br />\nrjr gUtPSh<br />\nq-Ya MCI)e<br />\naI8'NV(<br />\nMoses<br />\n)<br />\n)<br />\nMaimonides. The translations used will be the English as. ine !I as the Hebrew. Students able<br />\nto read Arabic will have an opportunity to employ the original Arabic texts;<br />\n20.328 Topics in Abnormal Psychology<br />\nDr. Strauss<br />\nProfessor's statement: This lecture-discussion course will concentrate on the study of<br />\ncognitive processes in psychotic states. Among the topics to be considered will be the<br />\nrelationship between thought processes and mood states, theories of paranoid thinking, and<br />\ninformation processing in schizophrenia. Because of the importnace of diagnostic concepts<br />\nin this area, the course will begin with an examination of contemporary conceptions of the<br />\nsymptomatology of schizophrenia and its differentiation from affective disorders and with<br />\nthe issue of the \"myth of mental illness\" or its cultural relativity. There will be a heavy<br />\nemphasis on contemporary experimental research, the discussion of which will be led by<br />\nstudents, in addition to a consideration of general theoretical positions and methodological<br />\ncomplexities in this area of research, which will be the subject of the professor's lectures.<br />\nThe course will meet two hours weekly. The first hour will be a lecture. During the<br />\nsecond hour readings related to the lecture/<br />\nbe discussed. Readings will be drawn from<br />\ntexts, monographs and current professional journals. There will be one examination and a<br />\npaper. Consent of the instructor is required before enrollment, which will be limited to 20<br />\nts<br />\nstuflen<br />\nhus the course might be succinctly described as one on the experimental psychology of<br />\npsychosis.<br />\n22.619 Seminar In Forms<br />\nDr. St. John<br />\nProfessor's statement: This course will consider a variety of poetic forms and<br />\nconventions. Weekly or bi-weekly writing assignments will be made. ix texts will be<br />\nrequired and occasional outside reading will be assigned. For graduate students in the<br />\nWriting Seminars.<br />\n<br />\n23.625 Seminar on D<br />\nDevelopmenttl<br />\nDr. Chase,Dr. Dunn<br />\n.<br />\nProfessor's statement: This course examines the emergence and consolidation of the<br />\ncapitalist world-economy with and eye to understanding the causal mechanisms underlying<br />\nits development. A research paper will be required.<br />\n24.1 and 24.2 Calculus Computing Lab<br />\nDr. Horn<br />\nProfessor's statement: These courses offer an opportunity to do numerical laboratory<br />\nexercises on topics chosen from the syllabi of Calculus 1 and 2. The University's timeshared<br />\ncomputing systems is used, but no previous programming or computing experience is<br />\nrequired. Concurrent registration in the corresponding calculus course (11.6 or 8; 11.7 or 91<br />\nis required, and enrollment is limited to 30 students.<br />\n245<br />\n3aeFn9u<br />\nf(Ide9.3geritimt Scienc 1<br />\ntvaluation<br />\necours concerns management technology ancPEfeng<br />\ntheory. The course was praised for applyin% decision theory and operations research to real<br />\nworld situations. As one student said, \"The best part of the course is the prof's real-world<br />\ncontact.\" The grade was based on homeword, quizzes and a choice of final or paper.<br />\n30.313 Eighteenth-Century Concepts of Heroism<br />\nDr. Wills<br />\nProfessor's statement: A study of the cult and iconography of Washington and Napoleon.<br />\nClass limited to 15. Professor Wills meets his seminar at home.<br />\n30.369 Criticism and the Audio-Visual Media<br />\nDrs. Macksey and Livingston<br />\nProfessor's statement: Workshop in writing critical responses to film and television.<br />\nAnalysis of rhetoric and values in student papers and selected reviews.. Readings in cinema<br />\ntheory. Screenings and guest speakers to include Leo Braudy, George Wilson, and Horace<br />\nNevvcomb.<br />\nThis is a seminar aimed at the development of critical habits of reading andvvn tin q. The<br />\nbasic equipment is a typewriter or steady hand. Paisley Livingston has studied film in Paris<br />\n(but speads English without the trace of an accent). Readings and discussions will try to<br />\nsynchronize with films being screened on the campus and commercially.<br />\n30,613 Methods in Literary Reading<br />\nDrs. Jacobs and Macksey<br />\nProfessor's statement: A course offered to first- year graduate students in literary studies<br />\n(Classics, English, German, Humanities Center, Romance Languages) as an introduction<br />\nboth to the faculty of those departments and to a variety of current theoretical approaches<br />\nthat may well be new to the incoming student. Since the seminar is intended as a<br />\ncomplement to other course work, written requirements will be kept to a minimum. Classes<br />\nwill combine lecture and discussion of brief texts (available in English), given each me k by<br />\na different faculty member.<br />\n30.621 Seminar in History of Ideas: The History of Psychology<br />\nDr. Mandelbaum<br />\nProfessor's statement: Historical analysis of some major movements in psychology in the<br />\n17th, 18th, and 19th centuries, with special attention to at least some of the following:<br />\nDescartes; Spinoza; theories of motivation in the 18th century; Associationism; hedonism<br />\nvs. hormic psychology in the 19th century. In so far as time permits; some tendencies in<br />\n20th-century psychology will be briefly examined.<br />\n<br />\n\fr<br />\n1<br />\n<br />\nApril 22, 147/<br />\n<br />\nnews-letter<br />\n<br />\nThe SAC and the<br />\nHomewood Community<br />\nwish to thank all the<br />\nfabulous people who help<br />\nmake the Fair happen.<br />\nTHANK YOU!<br />\n<br />\nPut your expensive eye<br />\nbehind our inexpensive System 35...and WOW<br />\nJust about any of the great photographs you see<br />\ncould have been taken with Vivitar System 3.5.<br />\nPlus one good eye. Vivitar System 35 is a most<br />\ninexpensive way to get serious about photography.<br />\nThe basic limitation is your own creativity and skill.<br />\nVivitar 220/SL 35mm camera Center-weighted<br />\nmatch needle metering system/Speeds from<br />\n1 / 1 000 to 1 second plus \"B\" for time exposure/Electronic flash sync at 1/125th<br />\nsecond/Universal thread mount 50mm<br />\nf1.8 lens/Built-in hot shoe/Self timer/<br />\nFilm -in-chamber Indicator/ASA Range<br />\n25-1600. Vivitar Automatic Electronic<br />\nFlash Up to 200 flashes from one single<br />\n<br />\nal)Ponde, & Best, Inc , 1977<br />\n<br />\n1.1<br />\n<br />\nVivitar System 35<br />\n<br />\n9 volt alkaline battery. Vivitar Automatic<br />\n135mm f2.8 lens Soper foca! ;enoth<br />\nfor portraits/About 2 times larger loan<br />\nnormal image Vivitar 2X Tele<br />\nDoubles the effect;vc- focal iength of<br />\n• lenses/Converts the 50mm lens to 1 0Ornrr<br />\nthe 135mm lens to 270m ,--, Viviiar.,Enduro<br />\nCase Carries te.c,ntire nystem corrfortably and securely while hikHng cycling,<br />\nskiing. etc. Find the nearest Vivitar dealer and<br />\nask for a demonstration.<br />\n<br />\nconverter<br />\n<br />\nMarketed In the U S A. ty Ponder & Best Inc<br />\nCorporate Offices 1630 Stewart Street, Santa Manna,<br />\nCA 90406 In Canada Vivitar Canada Ltd./Ltee<br />\n<br />\n\f'Ate 1C<br />\n<br />\napril 22, 14//<br />\n<br />\nincws-Ictter<br />\n<br />\n\"Anybody can make a bad record- ,<br />\nbut anybody can't make a good one.<br />\n<br />\n'ROBINSON<br />\n'<br />\nS GORSUCH HOUSE<br />\n<br />\noars<br />\nUniversity Sandwich Shame and Deft<br />\n<br />\nWith confidence<br />\noriginal study materials<br />\nsmall groups • tape center<br />\nsummer & compact courses<br />\nCALL<br />\n(202)<br />\n244-3010EDUCATIONAL<br />\nKM CENTER<br />\n<br />\nfEATURiNg...<br />\ngREEk & AMERICAN CUISINE<br />\n<br />\n4201 Connecticut Avenue, N.W.<br />\nWashington, D.C. 20008<br />\n<br />\nRENTAURANT & CARRY OUT<br />\n<br />\nCOME<br />\n<br />\nUNIVEIRSITY PARKWAY<br />\nAT ST.PAUL<br />\nLOOPY. L/141YORS(TY O<br />\n<br />\nGRE • GMAT • SAT<br />\n<br />\nNEwty-dECORATECI!<br />\nNEW MANAgEMFAT1<br />\n<br />\nAN Lamp Crab Cakes<br />\nGamine ICodeee Corned Bed<br />\nDelicious Rosa Beef<br />\nVirginia Baked Ham<br />\nVarious Cold Cats<br />\nCheese(Swim, Provolone. Meant.)<br />\nKoeha Hot Do.<br />\nCawing<br />\nParty Trays(special ordee)<br />\nPizza<br />\nHome Made Dared (Cheese Cake)<br />\nIce Cream<br />\nSelect Grocay Items<br />\nPlante<br />\n<br />\nPitaass 46742110<br />\nM • Pri: 9:30 - 700<br />\nSat 930 - 2.-00<br />\nClosed Sundays<br />\nFREE SODA<br />\n<br />\n--Jelly Roll Morton<br />\n<br />\n511 CORSUCh AVENUE 235-2744<br />\n<br />\n*<br />\n*<br />\n*<br />\n*<br />\n<br />\nAPTS.<br />\n<br />\nWITH THIS At) AND<br />\nPURCHASE OF $1.00<br />\n<br />\nIN<br />\n<br />\nANd<br />\n<br />\nTRY OUR<br />\n<br />\nFlaming shiskabob<br />\nGreek salad<br />\nPastitsio mousaka<br />\nBaklava<br />\n<br />\nBUSsNESS<br />\n<br />\nStuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nfrivelopes Dept. 339A<br />\n310 Franklin Street<br />\nBoston,Mass. 02110<br />\n<br />\n'Rooms available for private parties<br />\nI --- Banquets --- Catering ---<br />\n<br />\nMMINIM<br />\n<br />\nii<br />\n<br />\nYot__ArSAmpus-Pride!<br />\n<br />\nI<br />\n<br />\nI<br />\n<br />\nRE VOLL 7IONA R y<br />\nNEW<br />\nUNIQUE<br />\nHISTORIC— First University Campus Postcards<br />\n<br />\nNEW<br />\n<br />\nII p1<br />\nI<br />\n<br />\nDifferent Superb Scenic-Views.<br />\nFrom Your Campus. On One Card<br />\n<br />\nti<br />\n<br />\nCatholic<br />\nCommunity<br />\non Campus<br />\n<br />\nr<br />\n<br />\nYOUR CAMPUS PRIDE GOES WORLDWIDE<br />\n<br />\nt<br />\n<br />\nThink! Think more often on your relatives &<br />\nfriends.,drop them a line. They will admire &<br />\ntreasure your pride! Frame one for,yourself!<br />\n<br />\nUNI-PRIDE CREATIVE POSTCARDS<br />\n<br />\n.11111.+11...11111..111111..1111P<br />\n<br />\n4.<br />\n1<br />\n<br />\nJOHN GA(H BOOKSHOP<br />\nRA1 TIMORES LARGEST<br />\nED BOOKSTORE<br />\n<br />\nV<br />\n<br />\n\"THE A/L4RK OF THE CLOWN\"<br />\nA Film Liturgy<br />\nSunday, April 24th<br />\n10:30 a.m. in Shaffer, Room 3<br />\n5:00 p.m. in Newman House<br />\n2941 N. Charles.<br />\n<br />\n1<br />\n<br />\n3322 ,Greenmount Ave.<br />\n467-4344<br />\n(JS• ED AND RARE<br />\nOLD AND OUT—OF—PRINT I<br />\n<br />\nON SALE/AT YOUR UNIVERSITY BOOK-CENTER<br />\n<br />\n\"OM.'MM.<br />\n<br />\n• 41121IIVAIraralr/AlrarAKIIII'ArI'Ar/KgrAir/4/ArapArarAprA/2/%<br />\n<br />\nOrleans<br />\n<br />\nOPPOPTUNIT<br />\n<br />\n41.10.<br />\n---<br />\n<br />\n41.w 4111.3<br />\n<br />\nSenior Class Film Series<br />\npresents<br />\n<br />\nTHE<br />\n<br />\nADVENTURE OF<br />\n<br />\nSHEIRkLOCK HOLMES'<br />\nSMARTER BROTHER<br />\nA HICHARO A HOTHIJOUtfl PHUUUCIION<br />\n<br />\n—Dom DeLuise-Leo McKem<br />\nGene<br />\nWilder<br />\n. .<br />\n<br />\nMadeline<br />\nKahn<br />\n<br />\n••.*•<br />\n•••••••::<br />\nf•••••.<br />\n<br />\nFriday, Saturday,<br />\nand Sunday<br />\n<br />\nMarty<br />\nFeldman<br />\n<br />\nFri. April 22 5:30, 8:00 & 10:00<br />\nSat. April 23 3:30, 5:30,<br />\n8:00 & 10:00<br />\nSun. April 24 3:00 & 5:30<br />\nAdmissioN $1.00<br />\n<br />\nShaffer 3<br />\n•••••• ..:•:••<br />\n<br />\n••.....<br />\n<br />\n• •• • •<br />\n<br />\nSENIORS $.75<br />\n<br />\n\f11111 11, 1411<br />\ngimp 411MO. .111111. .1110110. .111111. 4111W 411111w<br />\n<br />\n44.11. .1•11. -.111110. .1111111.<br />\n<br />\n••■•■•• .1101.<br />\n<br />\nNONDENOMINATIONAL<br />\nOFFICE OF THE CHAPLAIN<br />\n<br />\nUE2173<br />\n<br />\n\"THE SUNDAY EXPERIENCE\"<br />\n<br />\n01:.>J0<br />\n<br />\n• presents<br />\n<br />\nAT<br />\n<br />\nA<br />\n<br />\nBALTIMORE*DETROIT*MINNEAPOLIS<br />\n<br />\n\"ARAB RIGHTS IN THE MIDDLE EAST CONFLICT-<br />\n<br />\nThe Dcpartment of Urban Affairs at Hunter College<br />\nof the City University of New York offers a two-year,<br />\n60-credit program leading to a MASTER OF URBAN<br />\nPLANNING dogree.<br />\nAction oriented, Hunter's program preppies with<br />\nsocial and economic problems end explores the<br />\nareas of housing, transportation, environmental and<br />\nhealth care planning.<br />\nJeldworR opportunities abound—In city and<br />\nsu-ourben planning agencies, in neighborhood<br />\ngroups, In community development orrjzinizationa.<br />\nRequirements are flexible and an able, diverse,<br />\n'and experienced faculty Is ready to add guidance<br />\nand direction to student goals.<br />\nExtensive financial aid is available. Current costs<br />\nare $750 a semester for City resdents and $1,000<br />\nfor non-City Residents, plus activity fees.<br />\nFor more Informa;ion and .adrnisslon applications<br />\nwrite: Director, Graduate Program in Urban PlanWrig, Hunter Cc.:Ilegc/C.U.N.Y., 790 Madison Aveme, New York, N.Y.la.:..)21 --(212;$10.5.591.<br />\n<br />\nTalk by<br />\n<br />\nREVEREND JOSEPH RYAN,SJ<br />\nFormerly with the Center fin- the Study of:<br />\nThe Modern Arab World, Beirut<br />\nSUNDAY, APRIL24, 11:00 AM<br />\nLISTENING - VIEWING ROOM<br />\n<br />\nLEVERING HALL<br />\n<br />\nALIYAH<br />\n<br />\nARC<br />\n<br />\nIf you have recently considered<br />\nmaking Israel your home or if the<br />\nidea has been germinating in the<br />\nback of your mind, contact the<br />\nIsrael Aliyah Center. Learn about<br />\nspecial benefits available to new<br />\nimmigrants, as well as facts about<br />\nemployment, professional<br />\nretraining, education, housing.<br />\netc. Ask about financial<br />\nassistance and special material<br />\ndesigned for students. If you are<br />\ninterested in Israel, Israel is<br />\n<br />\nEUROPEAN FLIGHTS<br />\nProvides the academic<br />\ncommunity with discount<br />\n<br />\ninterested in you.<br />\n<br />\nair travel arrangements.<br />\nIsrael Aliyah Center<br />\n2027 Massachusetts Ave., N.W.<br />\nWashington, D.C.20036<br />\n(202)387-8224<br />\n<br />\nLet us serve you.<br />\nSave 1.1. Be Flexible<br />\n<br />\nFor information, please send to the above address.<br />\n<br />\nCALL US LAST<br />\n<br />\nA-34<br />\n<br />\n_Age<br />\n<br />\nName<br />\nAddress<br />\n<br />\n__State<br />\n<br />\nCity<br />\n<br />\nToll Free 800-223-1722<br />\n1111104110•••••••••••••••••••••••04111<br />\n<br />\nONE WEEK AIR CHARTERS FROM<br />\nBALTIMORE/WASHINGTON INTERNATIONAL<br />\n<br />\nNIA<br />\nCALIFOR<br />\nFrom<br />\n$229 „.•<br />\n<br />\nZip<br />\n<br />\nUniversity<br />\n<br />\n(USD)<br />\n<br />\nUBS 1977<br />\n<br />\nCharter Tours<br />\nD.C. & Bah. Departures<br />\n1111111•11111E••11111111••1111111•11•1111111I1111111•11111111111<br />\nfrom<br />\n<br />\n-<br />\n<br />\nPer Person — Air Oifty<br />\n<br />\nNON-STOP VIA AMERICAN AIRLINES<br />\nDepartures July 8 & August 5<br />\nThe low price includes round trip jet transportation.<br />\nappropriate meals and drinks aloft and air taxes. Ideal<br />\nfor .the person who likes to go on his own or who will<br />\nstay with friends and relatives<br />\n<br />\nALSO AVAILABLE<br />\n<br />\nWe have special reduced hotel and rent-a-car rates so<br />\nthat you can- plan your own California vacation in any of<br />\nthirteen great California cities.<br />\n<br />\nESCORTED PACKAGE including<br />\n<br />\nSan Francisco,<br />\nMonterey and Los Angeles with deluxe accommodations,<br />\nbaggage transfers and handling, deluxe motor coach<br />\ntranspatation and sightseeing, full day at Disneyland and<br />\nround trip air transportation, $439Per Person, double occupancy. BURCH TRAVEL LTD<br />\n<br />\n3900 N. Charles St.- ' 467-3900<br />\n<br />\n(just up the street)<br />\n••••••••••••••••••••0000000011141<br />\n<br />\nLondo<br />\n<br />\n1. 2 & 3 week charters<br />\nMarch—Dec 30 Weekend<br />\nDepartures. via British<br />\nCaledonian Airways<br />\n<br />\n$<br />\nair only<br />\n<br />\nABC & TOO<br />\n<br />\n•••11•11111111•1111•11•1111111111••111111111•111111••115111<br />\nfrom<br />\nParadise island<br />\nHoliday Inn<br />\n<br />\n299<br />\n<br />\nBahamas<br />\n<br />\nJuly—Nov. • 299<br />\n$<br />\n'3\"<br />\nMar—Apr<br />\n17 weekend departures<br />\nall inclusive<br />\nAir, Hotel, Tax Piedmont Airlines<br />\n<br />\nOTC<br />\n<br />\n•••1111111/111111_111111••11111••111111111•••111111111••111•<br />\nAcapulco S315-9 depar- from<br />\ntoP src Fe1<br />\n66T4cet„<br />\n<br />\nexico<br />\n<br />\nM<br />\nOTC & ITC<br />\n<br />\n:;1,)ct $<br />\n-Z'4'7x.`c'<br />\n<br />\n315<br />\n<br />\nV anta S3WJauly 22-29<br />\nAir, Hotel, Tax American & United Airlines<br />\n<br />\nall inclusive<br />\n<br />\n11••••1111,111111111•211111111111111111111111•1111111111••11•11111<br />\nfrom<br />\n__ Waikiki Village '429<br />\n<br />\nilIm46e4<br />\naif'<br />\nffi ‘ag<br />\nn lnna a:<br />\nHawaii Ftlidiodaiiaw<br />\n<br />\nrom.,D499<br />\n<br />\n$345<br />\n<br />\nepartures<br />\n<br />\n& United Airlines<br />\n<br />\nAmerican<br />\nair only<br />\nABC &<br />\n•111•1111111•11111••••111•11111111111•11111ummans<br />\n<br />\nOTC<br />\n<br />\nIreland<br />\nPlease call<br />\n<br />\nPART TIME EMPLOYMEN<br />\nPPORTUNITY for Studer<br />\nroficient in Fortran comp<br />\nrogramming. Math/Stat. Backg•<br />\nConsid. a plus. Call 730-5128<br />\nwrite MASINC, 10221 Wincopr:<br />\nCircle Suite 216, Columbia, 5,1,<br />\n41044.<br />\n.Quality<br />\nk.....<br />\n<br />\nTyping 467-0342.<br />\n<br />\nANISH by experienced natty/.<br />\nt teachers - All levels. all &gee.<br />\nf 366-2056.<br />\nI EUROPE '77 No Frills Charters<br />\nGLOBAL TRAVEL, 521 Fitt<br />\nAte., N.Y.,N.Y..1 0 0 1<br />\n212-379-3532.<br />\n<br />\nBURCIli<br />\n<br />\nTwo students want to take care o<br />\nvacationer's home during th<br />\nsummer months Ca11:366-6286.<br />\n<br />\nTRAVEL LTD<br />\n<br />\nCarpenters-needed for rennovation<br />\nFree Room. Call 332-1110.<br />\n<br />\n467!-3900<br />\n<br />\nsee Room w/ semi-private bath ir<br />\nexchange for light housekeeping &<br />\ncouple evenings baby4tting. ithin<br />\n'five minutes drive. Call 332-1110.<br />\n_Female preferred.<br />\n<br />\nI<br />\n<br />\n\f*-<br />\n<br />\n<<br />\n<br />\n••••<br />\n<br />\ndavid porter<br />\n<br />\n\f", "format": "basic_html", "processed": "Mademoiselle Pontalba<br />\nsays, \"There are two<br />\nreasons for the Mardi<br />\nGras: greed and<br />\ntackiness.\" Look around<br />\nyou. Don't you wonder<br />\nsometimes?<br /><br />\nC<br /><br />\nCan you spell the name of<br />\nthe New Orleans street<br />\nwhich is pronounced<br />\nCho-pi-too-lifs? Take ten<br />\nWRONG! The<br />\nseconds<br />\ncorrect answer is<br />\n\"Tchoupitoulas.\"<br /><br />\nil<br /><br />\n,<br /><br />\nThe<br /><br />\n411<br />\nseason of wildness was approaching and the shroud of worries clutching the city)<br />\nwould soon lift. Many outsiders.would join the revelry, outsiders who hoped that when the 1<br />\ndark curtain rose it would take their worries also. Mardi Gras was at hand and, for at least 1<br />\none day, problems were minute, the world joyful. For a day, the city would raise its headt<br />\nand roar, \"I am the city that Care forgot.\" The present era had brought many change5 to I<br />\nNew Orleans but to this one tradition the city clung with inhuman tenacity.<br />\nPreparations for the celebration were proceeding at a frantic pace in all quarters. Beads and)<br />\ntrinkets had been bought months before and packed away until they were to be thrown to II<br />\nThis mardi gras don't<br />\nthe maw of the crowds. Glittering floats were readied, marching bands practiced -- the cityci<br />\nforget to pay homage to<br />\nthrobbed with anticipation.<br />\n)the deity of nudity and<br />\nIn another, more sedate, section of town,, preparations were also being made.<br />\nfoolishness, The Ty. This<br />\nVery few knew of the small shop. It was in a largo, shrub-surrounded house, an ancient 1 god, like many others in<br />\nmansion. Long ago the house had fallen into a somnambulistic state as untrimmed iyy crept<br />\nthe absurdum family, is<br />\nover•its walls. One day the sleep would end and death would begin. Meanwhile, the mask<br />\ncentral to the celebration<br />\nof this holiday. Each year<br />\nshop checked the pulse.<br />\n)during the mardi gras<br />\nInside the shop the world looked the same. Through the window one could see across the‘11<br />\nresidents of the city of<br />\nlane to the amusement park. Once a haven for high laughter, now its rusty rides and I<br />\nNew Orleans honor The<br />\nrideshow booths remained silent. Unlike the giant across the lane, death had overtaken i Ty by running through the<br />\neasily here.<br />\ni town naked hours before<br />\nOutside the shop, ah, there was a different story. The window faces changed as newr the (lawn. The custom<br />\nmasks replaced the 'old. The emotions of the owners could be read plainly on the faces olh originated in 1873 when<br />\n1 Grand Duke Alexis of<br />\ncloth and glitter.<br />\nRussia, visiting the city to<br />\nThe life of the lane, which had once been mighty, now depended upon the shop. A few)replenish his oyster<br />\ntimes a week a footstep would intrude upon the silence and venture into the multi-visaged 1 supply, decided he needed<br />\nwindow. As he entered the shop the three owners would glance up as one, nod gently, and / the exercise. The Creoles,<br />\nbeing the perfect hosts<br />\nreturn to their work. Later, the customer would leave, never to return, for their products<br />\nthey<br />\nwere and alway have<br />\nlasted long.<br />\nbeen,<br />\ncould not refuse<br />\nThe owners were now bringing out their own old masks, readying themselves for the<br />\ntheir honored guest. The<br />\nmorrow. These masks, dust covered though they were, possessed a beauty born of<br />\nnatives had such a good<br />\npainstaking craftmanship. They were cleaned and layed out, to be worn the next day.<br />\ntime that they naturally<br />\nincorporated the run -Overnight, Fat Tuesday arrived in all its splendor. The three inside the shop glanced<br />\ncalled le vol des<br />\noutside and nodded approval. This was their day, the day the city threw off the modern<br />\ninsouciants<br />\n-- into their<br />\nworld and reverted to the superstitious days of old. They donned their costumes and<br />\nyearly party.<br />\n• stepped out into the madness.<br />\nAll day and all night the three walked the streets. Behind the masks, eyes examined each<br />\nface in the _crowd. One of the three would reach forward and touch the person being<br />\nstudied. Depending on which of the three touched, his thread of life could continue to spin<br />\nlong and prosperous, or it could be measured and.clipped. The three did their job with no<br />\nmalice, but only sad wisdom.<br />\nAsh Wednesday dawned and found the three returning to the shop. The costumes were<br />\nboxed and placed away in a dark niche on a backroom shelf.<br />\nThe three sat down and began weaving a new mask. Clotho spinning the thread, Lachesis<br />\nmeasuring, and Atropos cutting.<br /><br />\nri<br /><br /><br />\nw/es paro<br /><br />\nFair of beads, or siring, of<br />\nbeads?\" the Philosopher<br />\nasks.<br /><br />\n— aloft<br />\n00.110\"fteraI'Vlb<br /><br />\n'1'<br /><br />\nscenes by dale, placement by peter j.<br /><br />\nMardi Gras means many<br />\nthings: a party with<br />\nstrangers; a kiss from one<br />\nyou have never seen before<br />\nand will never see again; a<br />\nstomachful of new and<br />\nexotic food; a costume<br />\nthat makes you somebody<br />\nelse; a screaming that<br />\nnever ends; a never- ending<br />\nchorus of Dixieland.<br /><br />\nI 10<br /><br />\nt<br /><br />\nThis week's bar of the week isn't quite the one to stumble home from after the last round at 2, a.m.<br />\nIn fact, it happens to be a unique put-of-town spot‘about thirty miles away in Annapolis,so somebody<br />\nshould be in sufficient condition for the return drive.<br />\nThe Maryland Inn, an:ksurrounding attractions, justify a long trip to the state capital. Located off<br />\nChurch Circle on Main Street, the Inn actually has three separate facilities to choose from. One, the<br />\nTreaty of Paris, is strictly a restaurant; if you're interested in dining in Annapolis, you'd do better to go<br />\ndown Main Street to the Auberge de France (reservations needed— or over to State Circle and the<br />\nBarrister).<br />\nThe main feature of the Maryland Inn, however—the King of France Tavern—deserves an occasional.<br />\nvisit from Baltimore. As the only top-line jazz night club in the area, the King of France regularly<br />\nbrings in performers like Earl Hines, Charlie Byrd, and (sometimes) Dizzy Gillespie. With tables to the<br />\nimmediate front and left of the stage, plus the bararea , about a hundred people usually crowd the<br />\nTavern on weekends, all of them virtually ne,xt to the musicians. The small-club atmosphere is<br />\nintensified by the tradition of keeping quiet and listening during the show, a salutory practice broken<br />\nonly by drunken legislators and excessive Singapore Slingers.<br />\nCovercharge for the shows average four dollars, and they don't turn over the house on weekday and<br />\nSunday shows. The Tavern also operates a \"Jazz Club\" which offers various yearly membership rates<br />\nthat eliminate cover charges and allow a certain number of guests to shows.<br />\nAfter the show finished around midnight, with four solid hours of music behind, you can repair to the<br />\nother section of the Maryland Inn, the Drummer's Lot. A comfortable, candle-lit taproom, the Drummer's<br />\nLot is free of the touristes and plebes that infect the bars around the dock. It's a good place to have that<br />\nlast round in.<br /><br />\nril 11, 1111<br /><br />\nLooks like this hotel has seen better days, eh? Not a bad spot for<br />\na new subway station,right? Not on your life! This grand old<br />\nbuilding, after years of straddling the skids, is back in the pinks<br />\nthanks to the Marble Bar, which is in the hotel's basement. The<br />\nMarble Bar features nightly entertainment for a small cover -- $1.00<br />\nand an ambience copped straight from the wild and illegal twenties.<br />\nThe prices aren't too bad -- 75 cent a draft, $1.25 for an imported<br />\nbeer, the same for mixed drinks -- and the music is worth wore than<br />\nthe buck they charge.<br />\nThe most exciting group playing at the Congress Hotel is the<br />\ncrazy Loose Shoes Rhythm Band,formerly the fabulous Dog Tones,<br />\na set of characters that will jugband and reggae you into<br />\nslap-happy frenzy. Catch the band's act Monday nights in the<br />\nMarble Bar -- they'll be playing at Hopkins today at 2:00 -- and see<br />\nif they aren't the Lovin'Spoonful ten years on. You won't be sorry.<br /><br />\nRestaurants: Two local losers and a bici hit ick!<br />\nHorse of A Different Color Dept. -- Last year in these<br />\nRumor has it that Lenny \"Two-Punch\" Randle was to<br />\npages we enthusiastically recommended Sterling's Crab<br />\nhave been banished to the Texas Pit for a one-month<br />\nand Oyster House (410 West 29th St.) to those bent on<br />\nperiod following his workover of manager Frank<br />\nsampling the Chesapeake's finest wares. Sterling's seafood,<br />\nLucchesi. Kind hearts prevailed, however, and only fined<br />\nwe claimed, was in the same league as Enrico's pizza ir<br />\nhim $23,000.<br />\nManhattan or the Nash Brothers' hot pretzels in South<br />\nThe original Texas Pit, an infernal torture chamber<br />\nPhilly. Sadly enough, we can no longer stand by that<br />\nbeneath dusty San Antone streets, was<br />\nreview, for rarely, has this column encountered a<br />\nbanned by Teddy Roosevelt after Spanish-American War<br />\nrestaurant, fast-food joint, or corner stand which has<br />\natrocities. At 518 Ritchie Highway South in Glen Burnie,<br />\ntaken such a pronounced nosedive in quality.<br />\nthough, the treacherous spirit lives on in this country.<br />\nNeedless to say, prices have risen across the board,<br />\nthreatening'to punish miscreants like Randle and trap the<br />\nowing in large part to this season's scarcity of edible<br />\nunaware.<br />\nsealife. If this was the only drawback it wouldn't be so<br />\nOne scarcely realizes the heritage of the restaurant:<br />\nbad -- we've made it through price hikes before. But it's<br />\nonly a Texas Flag on the wall and early Matt Dillon decor<br />\nthe food that spells disaster for this former prince of crab<br />\nprovide a warning of its true ancestry: We innocently<br />\nshacks, and that (of course)is unforgivable.<br />\nsettled ourselves in after the waitress not only failed to<br />\nSterling's clam chowder, once crowded with taitalizing<br />\nsupply a round of Pearl beers, but even denied knowing of<br />\nclam bits and othet taste treats, is now bland and almost<br />\nthe infamous Southwestern swill. After a perusal of the<br />\nclear broth, save for the annoying scraps of potato<br />\nmenu, however, our worst suspicions were confirmed—a<br />\nhugging the bottom of the cup. The stuffed shrimp, while<br />\npersonal message from owner Bruce Prince on his<br />\nstill greasy as can be, has noticeably less crabmeat in it<br />\n\"Whaddya Mean All You Can Eat?\" philosophy, signaling<br />\nthan a year ago, as do the crabcakes. In fact, one wonders<br />\nthe gastronomic nightmare to come.<br />\nhow long Sterling's will be able to pawn off their<br />\nNo one dared undergo the \"All-You-Can-Eat\" ordeal,<br />\ncrabcakes as the real thing; perhaps crab flavored cakes<br />\n-c remembering the painfully grieved appearances of the<br />\nwould be a better term. The fried-clams were swimming in<br />\nMexican banditi who had suffered an equivalent fate.<br />\nsand the last time around, and, once again, more batter<br />\nInstead, we opted for the two-and-three meat<br />\nwas in evidence than seafood. The list of disappointments<br />\nkt, combination platters, which returned limp strips of beef,<br />\ngoes on and on.<br />\n\"bland ribs, sorry, sausage links, and a shameful chicken<br />\nStill present are the flaws that one used to overlook at<br />\nbreast. The accompanying barbeque sauce (no match for<br />\nSterling's: the long wait for take-out orders, the filthy<br />\nPick of the Week Three cheers and around on the Leon's tongue-tantalizing concoction) could not drown<br />\nappearance of the store (to. be truthful, some of us did house to the new management of the Gorsuch House out the misery of the entrees. Certainly not a cowboy<br />\nand still do get off on Sterling's ratty decor), and the (Gorsuch and Greenmount) for making their restaurant dinner by any standard, even Glen Burnie's. The house<br />\noften less than friendly service. The newest wrinkle in one of Waverly 'S hot spots. Greek food is now offered at drink, moreover, a \"Texas Sour,\" consisted of weak gin<br />\nSterling's- act is to offer ketchup instead of cocktail sauce the Gorsuch House — chunky Green salads go for $3.50 — overpowered by a repellent candied mixer.<br />\nfor a garnish. Now, we all know that Kraft's cocktail as,<br />\nas an improved listing of seafood and meats. The<br />\nTo order dessert would have been sheer masochism; we<br />\nsauce ain't exactly the Ritz, but once upon a time it was fat crabcakes are a bargain at $1,95, and a better Crab .quickly paid our tab and escaped from the restaurant's<br />\nbetter than nothing. On the other hand, what can you Imperial is hard tp find up this way. Give the Gorsuch clutches. For those unfortunate travelers of .Ritchie<br />\nexpect from such a nothing place as Sterling's?<br />\nHouse a shot, it's right in the neighborhood.<br />\nHighway--beware! The Texas Pit lives again!<br /><br />\nApril 22,1411<br /><br />\natc<br /><br />\niicws-Icttr<br /><br />\ndue on Pfeffer<br />\nThe Academic Council, it has been learned,<br />\nwill request an explanation for the<br />\nScience department's denial of<br />\nPolitical<br />\ntenure to Dr. Richard M. Pfeffer. In its meeting<br />\nWednesday, the Council voted to -ask department<br />\nchairman Robert Tucker to appear at the next<br />\nmeeting to present the department's reasons for the<br />\ndenial.<br />\nAfter the department had decided not to<br />\nrecommend him for promotion to full professor a<br />\nfew weeks ago, Pfeffer appealed to the Academic<br />\nCouncil to set up an ad-hoc committee to solicit<br />\noutside opinions regarding his professional standing.<br />\nAt the previous Wednesday meeting, the Council<br />\nhad discussed the matter, but took no formal<br />\naction.<br />\nIn the meantime, there has been widespread<br />\ncampus support for Pfeffer, especially among<br />\nundergraduates. A petition advocating that Pfeffer<br />\nremain at Hopkins received over 400 signatures this<br />\nweek, and Student Council, an ad-hoc support.<br />\ncommittee, and the Political Science graduate<br />\nktudents have written supportive letters. Various<br />\nfaculty members have also expressed their concern<br />\nover the department's decision.<br />\nThe Council's request for a departmental<br />\nexplanation is an unusual_ one, since in most tenure<br /><br />\ncases the Department's decision, if negative, is final.<br />\nThe wide interest Shown in Pfeffer's case apparently<br />\nhas moved the Council into taking such special<br />\naction. As council member William Huggins<br />\n(Mechanics and Material Sciences)commented,\"the<br />\nCouncil is very impressed with the responsible and.<br />\ncareful attitude everyone is taking on this. The<br />\nCouncil won't take any action until it has heard all<br />\nsides of the issue.\"'<br />\nJohn Chancellor, late of NBC Nightly News, has been appointed<br />\nPfeffer's appeal to the Council to set up an<br />\nprocess<br />\nnormal<br />\nthe<br />\nDirector of WBFF, Channel 45, Baltimore's Tele-Movie station.<br />\nin<br />\nNews<br />\ncommittee<br />\nfollows<br />\nad-hoc<br />\nfor tenure decisions: after a department has voted Chancellor replaces Michael Dalton, who has gotten misplaced<br />\nto recommend a member for promotion, the somewhere.<br />\n\"My ratings were slipping and NBC gave me an ultimatum,\"<br />\nAcademic Council then establishes the three-person<br />\n(from<br />\nletters<br />\noutside<br />\nsolicit<br />\nexplained to a surprised Shriver Hall audience Tuesday. As<br />\nto<br />\nCommittee<br />\nChancellor<br />\nad-hoc<br />\nscholars in the candidate's field) commenting on the Frank R. Kent Memorial Lecturer, Chancellor intoned that he had to<br />\nquality of the professor's work. The committee also \"either find another job or make my act more outrageous. But I<br />\nusually charges the department chairman with wagn't willing to become the next Howard Beall.\"<br />\nam a journalist, not an entertainer,\" Chancellor stated. \"And<br />\npresenting an evaluation of the professor's teaching.<br />\nAfter reviewing these, '• and other relevant being forced to prostitute my professional ethics just to stay on<br />\ndocuments and statements, the committee then national television is a state of affairs that I will not put up with,\" the<br />\nmakes its recommendation to the full Academic Emmy-award winning newscaster explained, ending his sentene- with<br />\nCouncil, which has ultimate responsibility for any a preposition. \"All things considered, I would rather be in Baltimore.\"<br />\ntenure decisions. The appeal by Pfeffer, then, comes<br />\nin view of the fact that he had no opportunity for<br />\noutside review after the department's initial decision<br />\nnot to promote him.<br /><br />\n...Proxmire resents<br /><br />\nnicknames,. Davidson struck<br />\nme as being a consummate<br />\npolitician, as man so slick it's a<br />\nwonder he didn't slide out of<br />\nhis chair. As the first bit of<br />\n,business Davidson requested<br />\nthat several hundred dollars be<br />\ntaken from the News-Letter<br />\nbudget and given to the<br />\nBarnstormers (coalition) and<br />\nthe classes) personal interest).<br />\nApologizing profusely for<br />\n\"unfamiliar with<br />\nbein<br />\nthese procedures\" (alas, he was<br />\nnot an actual representative,<br />\nbut a designate), Davidson<br />\ncarefully mixed clas chauvinism<br />\nand presumed anti-News-Letter<br />\nsentiment with an appeal for<br />\nthe Barnstormers (and who can<br />\nturn down the Barnstormers?).<br />\nA reasonable, if naive,<br />\nappeal. Unfortunately,<br />\nDavidson resorted to<br />\ngeneralizations about the N-L<br />\nwhich belied a lack of historical<br />\ncontext in N-L affairs (to say<br />\nnothing of the _workings of the<br />\npaper itself), but we shall<br />\nforgive him and move on.<br />\nSkipping to the end of this<br />\ntale, the SAC voted 32 to 8 in<br />\nfavor of keeping the<br />\nNews-Letter budget unchanged.<br />\nNo need to fear for the<br />\nBarnstormers, though; they got<br />\ntheir money, as the executive<br />\ncommittee allocated $300.<br />\nWhile we are on the subject<br />\nof arts groups, the Fine Arts<br /><br />\nIn a departure from traditional selection practices, the<br />\nHopkins chapter of Phi Beta Kappa has invited a<br />\nbroad-based group of 28 'undergraduates to join its<br />\npiestigious intellectual lonely hearts club. The inductees<br />\nwere selected on the basis of grade-point average, lacLof<br />\ncriminal record, and patrician nose.<br />\nThe induction ceremony will take place April 23<br />\n9:00 AM at La Porte Verte, an exclusive dining salon on<br />\nOld York Road. For the second year in a row, Dr. Roland<br />\nR ei gh tier, President Emeritus of Ilampden-Sydney<br />\nCollege in Virginia. will deliver his famous lecture<br />\n\"Beyond the Gutenberg Galaxy: Marshalling the Printed<br />\nWord- at the ceremony.<br />\nThe following Hopkins undergraduates have responded<br /><br />\n.<br />\nI<br /><br />\nChancellor resigns...<br /><br />\nStudent politics are a real drag<br />\nBy J.D. CONSIDINE<br />\nYou really wonder, after a<br />\nwhile, why it is that the politics<br />\nof student activities are so<br />\nimportant to some people. It<br />\nobviously isn't a reflection of<br />\ngeneral student interest, as most<br />\nelection results will plainly<br />\nindicate. It seems More likely<br />\nthat student politics exists<br />\nsolely for the use and<br />\nenjoyment of stadent<br />\npoliticians.<br />\nTake the SAC, for example.<br />\nThe SAC meets about twice<br />\nyearly, so it seems an unlikely<br />\nspawning ground for political<br />\npower plays. When they met<br />\nTuesday,it- was merely to vote<br />\non budget appropriations. Ron<br />\nBialek expected nothing less,<br />\nand not • much more, and most<br />\nmembers were hoping to get<br />\nthrough the meeting in as little<br />\ntime as possible.<br />\nAs these things go, however,<br />\none group generallywantsmore<br />\nmoney than it had been<br />\nofferred. In this case,it was the<br />\nBarnstormers; they needed the<br />\nmoney to run 'plays in<br />\n.ShriverHall, since it seemed that<br />\nthey would have no other<br />\nsuitable alternative hall. Fine.<br />\nBut where does the money<br />\ncome from?<br />\nIn steps \"Big Stu\" Davidson.<br />\nNow, personally, aside from the<br />\ngeneral aversion I have to<br />\npoliticians with folksy<br /><br />\n0<br /><br />\ncouncil asked for (and got) an,<br />\nextra two hundred dollars,<br />\nwhich was ,snatched from the<br />\nFlying Monkey appropriation.<br />\n(Just off the cuff, though, Ron<br />\nBialek felt that Flying Monkey<br />\ncould easily get an extra two<br />\nhundred from the Social<br />\nCommittee budget, of which<br />\nboth Flying Monkey and Fine<br />\nArts are subsidiaries).<br />\nOn the whole, those who<br />\ncame to the meeting with<br />\npurely budgetary concerns left<br />\nbasically satisfied, if somewhat<br />\nirritated by the length of the<br />\nmeeting. But the politicos left<br />\ngenerally disappointed. Sure,<br />\nthey had flexed their muscles,<br />\nbut the big prize had eluded<br />\nthem; they were unable to<br />\nprove their power to be<br />\nultimately greater than that of<br />\ntheir adversary. Just as well,<br />\nthough, since an appetite for<br />\npower is only made bigger by<br />\nsuccess.<br />\nAt least they can't cry that<br />\nthe News-Letter has ignored<br />\nthem. Some one once remarked<br />\nthat they disliked voting,<br />\nbecause \"it only seemed to<br />\nencourage them.\" The same can<br />\nbe held with regard to political<br />\nreporting. Still, if one wished to<br />\ndestroy the political credibility<br />\nof some of these clowns, all<br />\nthat would be necessary would<br />\nbe to print a verbatim transcript<br />\nof an SAC meeting.<br /><br />\nBy MIKE GIULIANO<br />\nWilliam Proxmire, a United States :senator since 1957 (when he<br />\nfilled the seat vacated by Joe McCarthy) is a powerful man in his<br />\nhome state of Wisconsin, continually reelected by huge majorities, and<br />\nin Congress, where he is chairman of the Banking, Housing and Urban<br />\nAffairs committee. Speaking here Tuesday night, Proxmire stated that<br />\nmany of his fellow Democrats are reluctant to'recognize the giantism<br />\nof the federal government. As an example of how rapidly our<br />\nbureaucracy is expanding, Proxmire cited the Department of Health,<br />\nEducation and Welfare, whose total budget has risen from 7 billion<br />\ndollars in 1965 go 56 billion dollars in 1977. \"We can't solve our<br />\nproblems simply by appropriating money,\" said Proxmire. \"There is a<br />\ncavalier disregard for the value of the dollar.\"<br />\nDisturbed by the squandering of tax money, Proxmire established<br />\nhis Golden Fleece Award, in 1975. The award bestows recognition on<br />\nthe most outraseous federal expenditures. Past recipients include the<br />\nNational Science Foundation, for spending $84,000 on an attempt to<br />\ndetermine \"Why People Fall in iLove\"; the FAA, for taking 75<br />\nmeasurements of airline stewardesses :at a cost of $57,000; and a<br />\n$103,000 study of whether sunfish that drink tequila are more<br />\naggressive than sunfish that drink gin. The Navy estimated that the<br />\ncost of furnishing the vice-presidential house would be $15,000, but<br />\nwhen it actually cost $500,000, Proxmire felt an award was merited.<br />\nThe mansion's resident, Nelson Rockefeller, was not pleased to receive<br />\nhis Golden Fleece Award, stormed into Proxmire's office and<br />\ncomplained: \"Bill, you shouldn't have given me the award. I don't<br />\neven live in that house.\"<br />\nAs the bureaucracy has grown, taxes have risen. The average citizen,<br />\naccording to Proxmire, paid 10% of his income in local,state and<br />\nnational taxes in 1930, 20% in 1940, and pays 37% at the present<br />\ntime. Almost every politician, Proxmire included, favors holding down<br />\nthe size of government and keeping taxes from rising, but few of them<br />\nare as specific as Proxmire about ways in which the government can<br />\neliminate in the military spending.<br />\n\"There's lots of fat we can eliminate in the military budget,\" said<br />\nProxmire. \"The B1 bomber is a turkey.\" The plane is too heavy and<br />\ncarries too light a payload. The original projected cost per plane was<br />\n$25 million, but now it is estimated that a single BI bomber would<br />\ncost $95 million. Proxmire is also disturbed by the size of the<br />\nPentagon bureaucracy: \"We have more civilians working for the<br />\ndefense.department than for all other agencies, other than the post<br />\nmilitary<br />\noffice, combined.\" He estimates that because of the<br />\nwill<br />\nbe a<br />\nDepartment<br />\nDefense<br />\nthe<br />\nin<br />\npromotion system everyone<br />\n2000.<br />\nyear<br />\nthe<br />\nby<br />\nadmiral<br />\nan<br />\nor<br />\ngeneral<br /><br />\nto their induction notices: Grant Abrams, M.R. Bongue,<br />\nRalph K. Davidson, Donald Dinegar, Dan Dunlap, Marc<br />\nDuvoisin, Vanessa Evan, Christopher Gray, Alan Hirsch,<br />\nWilliam Lattanfi, Dee Leaven, Alan Lustig,<br />\nMark Hertsgaard, Peter McGuire, II. Ian Nadjari, Sean<br />\nMacConsaidin, Andres Mora, Augusto Pinoehet. Louis'<br />\nReed, Leona 'd Alfred Schneider, Jeffrey Sharp, Ashraf<br />\nPahlavi, R,:r)ert P. Reiser. Tirnoth , Ridley, David<br />\nTannenblatt, Gary Windier, and Nicole White.<br /><br />\nMks lioard<br />\nflere's the case: Student X, as we shall refer to him/her,<br />\nfinds him/herself in a tight spot. A chemistry test and<br />\nhe/she doesn't know his/her electron-spin theory from a<br />\nhole in the ground. Failure, to a freshman/woman, will<br /><br />\nsurely nirge-Ned School all the more distant. And so. ler!<br />\njust peek over there for number 5...<br />\nWhammo! The long arm of law reaches out and nabs<br />\nStudent X. This poor soul, brought before a jury of<br />\nins/her peers (whom we shall respectively designate as<br />\nwas<br />\nJuror A. Juror B, Juror C. Juror D, arid<br />\non<br />\nan<br />\ncheating<br />\nof<br />\nI)<br />\none<br />\ncount<br />\nof<br />\nLund guilty<br />\nexamination in course, which shall be called atemisti1<br />\n3.2, taught by a Mr. John Gryder.<br />\nThe sentence: failure of the course. The Phoenix of tin.<br />\nmercy-killed Honor Commission, the Ethics Board, liaC<br />\nexercised its awful power of justice last week. Student 1\\<br />\nis now what !Inward K. Smith would call a \"deterrent<br />\nVeritas vos liberat.<br /><br />\nwho?<br /><br />\npate 4<br /><br />\nucws-Icticr<br /><br />\nApril 11, 1411<br /><br />\nDoctor Money speaks, the whole wide world listens<br />\nResearcher proposes end to sex stereotyping<br />\nCalls for fairer method of competition<br />\nDr. John Money, professor of Medical Psychology and Pediatrics<br />\nat,<br />\nthe Johns Hopkins<br />\nHospital, is a world-renowned authority on<br />\nthe subject of sex. He is the author of several books, including Sex<br />\nErrors of the Body and Man and Woman and Boy and Girl. Money has<br />\nalso done notable work in developmental reading problems of children;<br />\nThe News-Letter sent staff member Rhona Lyons to interview Dr.<br />\nMoney -- here follows Part One of that discussion. Next week, in the<br />\nconclusion of the interview, political and social issues of national<br />\ninterest will be covered.<br />\nHow did you.become involved in problems of #<br />\ngender identity and sexual deviation?,<br />\nWhen I was a graduate student at Harvard,<br />\nthere was a case of intersex<br />\n(hertnaphroditism) presented to the small<br />\ngroup I was a member of. It was a case, as<br />\nI know today, of a fifteen year-old with<br />\nandrogen insensitivity. That meant that he had been born looking,like a girl, except<br />\nthat somebody found two lumps in the<br />\ngroin, decided they were testes and that<br />\nthis person without a penis would have to<br />\nbe raised up as a boy. That was some time<br />\nin the first year of life, when the parents<br />\nhad signed the birth certificate as a female.<br />\nThey were Oven some vague kind of<br />\nprognosis that nothing could be done at<br />\nthe moment, but it could be done when he<br />\ngot to be a teenager and started to go into<br />\npuberty. In retrospect, one can see that<br />\nthis was a case of extremely bad<br />\nmanagement. At puberty, he<br />\ngrew<br />\nbreasts instead of a male body shape. He<br />\nwas in the hospital to see if anything could<br />\nbe done for him. Thet remarkable thing about it was that in spite of the<br />\nhandicap of<br />\ngrowing up without a penis, and in spite of the, shall we call it, the insult of a body<br />\nthat<br />\ngrew in female dimensions at puberty, he was quite persuaded in his self-understanding<br />\nthat he was a boy, and he had the general outlook of a boy. Of course, he was<br />\nmortified<br />\nthat he had no penis, but he certainly didn't act or behave like a girl. I took that<br />\ncase as<br />\na starting point and used the information, the principles that it demonstrated<br />\nas a basis<br />\nfor a search of the literatu-re, medical and psychological, on hermaphroditism.<br />\nThat<br />\nculminated in a term paper which itself became the basis of my PhD dissertation, which<br />\nwas an extensive review of a century worth of medical literature and a detailed<br />\ncase<br />\nwork-up of ten cases of various different diagnostic types of hermaphroditism.<br />\nThe<br />\nperson that I worked closely with in getting those ten cases was Doctor Wilkins from<br />\nthe<br />\nPediatric Endocrine Clinic here at Johns Hopkins, which was the first one in the world,<br />\nand it happened also to be the world's leading center for birth defects of the sex organs<br />\nand the treatment of those children. I came down here for a visit to use the files and see<br />\nsome of the patients and that ended up in an arrangement being made a couple of<br />\nyears<br />\nlater that I would come down here to work. That was 1951.<br />\nHave you encountered much opposition to your work? Do you have trouble getting<br />\ngrunt money?<br />\nWell, back in those days nobody knew I existed, so I didn't get any opposition.<br />\nThe..<br />\nmore visibility one gets in anything to do with sex education or sex therapy or sex<br />\nresearch, then the more opposition develops. This happens to be a'very negative era, as<br />\neverybody knows, for all of science and research in the public mind. I do think that sex<br />\nresearch gets a little extra of that negative reaction. It makes a good whipping boy. For<br />\ninstance, there's a small, media magazine that was first published in 1933 under the<br />\nname Sexology. It was a very serious attempt on the part of the publisher, who,-by the<br />\nway, was the man who first brought out Sports Illustrated, and also the very first of the<br />\nscience fiction magazines and many others—it was a very serious attempt on his part to<br />\nprovide elementary sexual information for blue-collar people. He subsidized the<br />\nmagazine on the basis of his other ones. For more than an quarter of a century, it was<br />\nnot possible to sell that magazine by subscription through the Federal mail because it<br />\nhad sex on the cover and it was offensive to the Post Office to carry it. It had to be sold<br />\nat newsstands only, under the counter. As recently as this year, they finally decided to<br />\nchange its name. The new name is Together. The 'reason for that was that some news<br />\nvendors in polite places, like drugstores and department stores, still will not put a<br />\n. magazine on sale if it has sex on the cover, and it doesn't matter what the contents are,<br />\nit's just the word itself. Well that's a straw in the wind that indicates how strong the<br />\nsexual taboo still reigns in our society.<br />\nYou are often in the position of advising the parents of all infant with ambiguous<br />\ngenitalia ill regard to whic.h sex they will raise their child as. What factors enter into your<br />\ncounseling:'<br />\nPoint number one is that you never assign the baby to be reared in the sex that it will<br />\nbe<br />\ntotally incapable of rehabilitation in. You never rear a baby in the sex that it will not<br />\nbe able to function well in, especially in the sexual life of adulthood. So if the evidence<br />\nof<br />\nyour senses is that this baby has no penis., then you never expect it to be raised as a<br />\nboy<br />\nbecause there .is no technique for creating an adequate penis by surgery. It's been<br />\nattempted. especially for a boy or man who loses his penis. What it produces is better<br />\nthan nothing for him. but it still isn't a workable penis. It's okay for creating a bulge<br />\nin<br /><br />\nhis bathing suit. It may even be okay for passing me urine, but you never can get it so<br />\nthat it-will be erected enough or solid enough to go into the vagina in intercourse. Now<br />\nthe other way around, when you see a baby born with a penis it is quite possible,<br />\nalthough it's extremely rare, that there are no testicles but that baby could have two<br />\novaries inside and a uterus. Under those circumstances, surgery can be completely<br />\neffective and rehabilitative, and the person can grow up to have intercourse as a woman,<br />\nand have a pregnancy. So you need first of all to look at the evidence of your senses, as<br />\nto what can-be donewith the genitalia in corrective surgery. And second of all, you need<br />\nto have the diagnosis so that you actually know what it is you're working with, which<br />\ncondition, whether any other supportive treatment is necessary. The decisions that cause<br />\nthe biggest difficulty are those of babies who are chromosomally male and who have two<br />\ngonads that are actually testicular in structure rather than ovarian, even though its<br />\nusually defective testicular structure . People tend to look for the chromosomes, the<br />\nactual chromosome count as being the absolute standard. It isn't so. For example, it's<br />\nquite possible to have a genetic male, XY, with two testicles in the abdomen in a<br />\ncompletely normal female body.<br />\nAt what age to you involve the child in this decision? How much does he or she become<br />\ninvolved in the process?<br />\nYou have a pretty free hand up until<br />\nabout eighteen months of age. Eighteen<br />\nmonths is • not a fixed cut off point<br />\nbecause it's a little variable from one child<br />\nto another. For most children,however, it<br />\nis the age at 'which they begin to get<br />\nlanguage and they very rapidly get to<br />\nunderstand sex differences in language<br />\nbecause it's so essential a- part of our<br />\nlanguage as people classify as \"he\" or<br />\n\"she\", \"boy\" or .̀`girl\". So, it's at that<br />\nstage that children begin to pick up some<br />\nof the universal criteria of sex difference<br />\nas well as the linguistic ones...and sooner<br />\nor 'later, anatomy. You don't have a native<br />\nlanguage at eighteen months, but you do<br />\nhave one by four and a half, and in those<br />\nintervening years it's all been settled. So<br />\nby the same age you have differentiated<br />\nthe essential core of your gender identity,<br />\neither as male or female or somewhere in<br />\nbetween. So what it means is that the<br />\nolder a child becomes after eighteen<br />\nmonths the more you have -to respect the<br />\ndegree to which the gender identity has already differentiat<br />\ned when you begin to make a<br />\ndecision. Let's jump ahead and say I have a twelve-year old who<br />\ncomes in and gives me a<br />\nvery clear message that other people must have made a<br />\nmistake from birth onwards<br />\nbecause this child says, \"I just don't belong as a girl.\" I've had that<br />\nhappen—in 'a child<br />\nthat had two ovaries. I've also had the same diagnosis in another child who.said,\"They<br />\ntold me I was a boy but it's not working,so you better change me over to be a girl.\"<br />\nIn<br />\nboth of these families nobody had ever been certain if the child reallywaS supposed to<br />\nbe<br />\na boy or a girl. The case had been managed at the time .of birth in such a way<br />\nthat the parents were not given a clear directive. That<br />\ndoes happen still in modern<br />\nmedical practice.<br />\nThe Olympic. Committee, along with other sports organizations, decide on sex by use of<br />\nthe Barr body test (chromosomes). How do you feel about this? Can you suggest a .fairer<br />\nmethod?<br />\nTake your pants down and have a look.<br />\nDo you feel that's the only criteria?<br />\nNo, I think there's a proper answer to this dilemma. Instead of<br />\nhaving people compete<br />\non the basis of physique as they do only in wrestling and prize fighting,<br />\nthey should have<br />\nit for all the sports. After all, if you subdivide people for tennis<br />\nonly on thesbasis of<br />\nwhether they're men or women, you still don't allow a place for the very<br />\nsmall built<br />\nwon—n,or man, nor for the very large built one. In other words:this idea<br />\nof only men in<br />\none group and women in the other group has a hidden assumption<br />\nthat all the<br />\ncompetitors will be of average size,.and it doesn't allow for any of the variations and<br />\nextremes in body build in human beings. If we did make that allowance then it wouldn't<br />\nmatter whether somebody was reproductive as a male or as a female.<br />\nDo you feel this change will ever come about?<br />\nWell, you know people do get their gender identity built into them<br />\n-with the same depth<br />\nand intensity as their native language. You threaten any, even very superficial, part of it<br />\nand the threat is experienced as a threat to the entirety. When you talk about making<br />\nthe vocational role unisex, instead of stereotyping them as male or female, a great many<br />\npeople experience that as a threat which would include the idea that you're going to<br />\nmake their sex organs unisex as well. Well, the same thing happensiwith. regards to sports<br />\ncompetition. What you are doing is breaking the convention that men shouldn't<br />\ncompete with women. And then a whole lot of people feel that you are asking to get rid<br />\nof their sex organs for that sarane reason.<br />\nDo _vou feel there's any hope for the androgynous child, a child who is reared in an<br />\nenvironment that does not dictate sex roles?<br />\n•<br />\nWhether children can be reared like that will depend on whether social customs change.<br />\nRight now we code almost everything we can think of in terms of sex. We've even coded<br />\nnouns as to whether they're male nouns or female nouns, regardless of what they signify.<br />\nThere's a little of it left in the English language. The romance languages are full of it. So<br />\nwe're pretty obsessed with maximizing sex 'differences and introducing them everywhere<br />\nwe can. Well, we could have had several thousand years of history of maximizing the<br />\nsimilarities between the sexes, but we haven't. So, at the very minimum,it takes time to<br />\nchange.<br />\nYou have to begin somewhere. Are you going to begin with<br />\nthe old generation first, or with the new?. Are you going to rely on chance toget the<br />\nchange going or are you going to engineer it? That's a tough one.<br />\nto be continued next week.<br /><br />\nThe love story<br />\nthat will<br />\nscare the hell<br />\nout of you.<br /><br />\nthe<br />\nOBSESS/ON<br /><br />\nand a short by Baltimore flmmaker Rick Puller<br /><br />\nratc<br /><br />\nnews-letter<br /><br />\n- nal 12 1411<br /><br />\nCOLUMBIA PICTURES PRESENTS<br />\nA GEORGE LITTO PRODUCTION/A BRIAN DE PALMA FILM<br /><br />\nCLIFF ROBERTSON &amp; GENEVIEVE BUJOLD IN OBSESSION<br /><br />\nFRI APRIL 22 SHRIVER<br />\nSAT APRIL 23 REMSEN 1<br /><br />\n7:30 &amp; 10:00<br /><br />\nVNOFF-CAMPLIS<br />\n/ .i.NI LIVING<br />\nIV<br />\nAT<br /><br />\nG OUCHE<br />\n• SUBURBAN<br />\n• HOURLY<br />\n• FOOD<br /><br />\nCAMPUS LIVINEr<br />\nBUS SERVICE<br /><br />\nSERVICE<br /><br />\n• COED<br />\n• AVAILABLE: SEPTEMBER714/77<br />\nFOR FORTN-UEIR IINIRDIRIMATlleN/<br />\nCONTACT:<br /><br />\nBELVA SCOTT<br /><br />\n338-7f58 ?_1\"6-eN1PgsmcE<br /><br />\nVc<br />\njOLMAN NALL<br /><br />\nDON'T MI“ THE<br />\nqi(AND OFEN1<br /><br />\nI)A. KkPE<br /><br />\nOF THE<br />\nJ0HN4 HOPK1N6<br />\n4mNq FAIR<br /><br />\n11(1DAY, APRIL 22,<br />\n12=00 Now-- Gulag,<br />\n5TKEET mom 29v-03471<br /><br />\nSI<br /><br />\nincivs-Icttct<br />\nt-Lc frichv<br /><br />\neditor-in-chief<br />\nEric Garland<br />\nBusiness Managers<br />\nVanessa Evan<br />\nCarole Jaffe<br />\nmanaging editor<br />\nDavid Hawk<br />\nfeatures editors<br />\nJ.D. Considine<br />\nMike Giuliano<br />\nphoto editor<br />\nJennifer Bishop<br />\nsports editor<br />\nDavid Kraus<br />\ngraphocs editor<br />\nScott Marks<br />\nhigher consciousness<br />\nD.H. Warren<br />\ninterior decoration<br />\nRhona Lyons<br />\nnon-circulation editor<br />\nHowie<br />\nproduction<br />\nDale Horan<br /><br />\nbar editor<br />\nA. Press<br />\nfiction editor<br />\nG.M. Smith<br />\nthe man who fell to earth<br />\nJoe Rodrigue<br />\nforeign affairs desk<br />\nMark Hertsgaard<br />\nmardi gras editor<br />\nWes Pardue<br />\nwhat the fuck do you want editor<br />\nJoe Tate<br />\nwelcome home editor<br />\nClayton Buick<br />\nrepairs editor<br />\nDante Landucci<br />\ntimonium bureau<br />\nBiff Burns<br />\npimlico bureau<br />\nThe Man From New York<br /><br />\nFair Issue Production<br />\nAgitation Press<br /><br />\n\"The whole world is<br />\nseven hits behind.\"<br /><br />\nL<br /><br />\ntenuous<br />\nhe recent decision by the Political Science department<br />\nnot to recommend Ric Pfeffer for promotion exemplifies<br />\nsome of the worst features of this university, narrow<br />\nattitudes that have become all too common over the past<br />\nfew years.<br />\n•<br />\nIn Pfeffer's individual case, a person who has contributed<br />\nso much to Hopkins -- in teaching, in working with fellow<br />\nprofessors, in scrutinizing the administration, in making<br />\npeople aware -- denied tenure by his department and forced<br />\nto leave the University indicates a callously formal play of<br />\nacademic ritual. For the department's decision to stand (in<br />\nlight of the not unimportant fact, that no Marxist has ever<br />\nbeen tenured at Hopkins), without due process of review by<br />\nan Academic Council ad-hoc committee, would go down as<br />\nan officious disregard of an entire career.<br />\nOn the departmental level (fiefdoms which a prominent<br />\nprofessor has termed the \"intellectual slums\" of the<br />\nUniversity), the tenure process has become so rigid and<br />\nsecretive that, while the departments naturally maintain<br />\ntheir own ranks, special cases like Pfeffer are all too easily<br />\nlost within the Gilman corridors. The Academic Council, in<br />\nwanting to avoid what would amount to a slap in the<br />\nPolitical Science department's face, has taken a slow,<br />\ncareful approach to Pfeffer's appeal. That appeal should be<br />\ngranted, in that the denial of tenure means a denial of<br />\nOutside review by academic peers, and a seeming disinterest<br />\nin teaching and general contributions to Hopkins. While the<br />\nCouncil proceeds cautiously, taking some sideways steps,<br />\nthey should consider as one goal resolving Pfeffer's position<br />\nbefore the end of the term. That, at least, would show some<br />\nregard for the largest part of the University --undergraduates -- and for someone who is of tremendous<br />\nvalue to all parts.<br />\nTo the Editor:<br />\nUniversity administrators<br />\naround the country, President<br />\nMuller included, have recently<br />\ndecried the seeming failure of our<br />\neducational institutions to train<br />\nstudents to think critically, write<br />\neffectively, and communicate<br />\nclearly. In his recent essays in<br />\nJohns Hopkins alumni<br />\npublications, Dr. Muller has<br />\ncriticized his own institution for<br />\nthis same failure, noting that<br />\nthese basic goals of university<br />\neducation have somewhere been<br />\nlost in the scramble of students<br />\nfor professional certification and<br />\nin the pressure on faculty to<br />\ngenerate research and<br />\npublications.<br />\nNowhere is the urgency of this<br />\nissue more apparent than when a<br />\nsuperb teacher on the faculty is<br />\ndenied tenure and eliminated<br />\nfrom the University -- ostensibly<br />\nfor failure to meet those same<br /><br />\nWHAT0)IT,<br />\nLEONID?...<br />\nA LITTLE HEAVY<br />\nON THE APPLE<br />\nFE, RIGHT?<br /><br />\nprofessional standards that have<br />\nbeen blamed for the decline of<br />\neducation in our universities. The<br />\nrecent departmental decision not<br />\nto promote Professor Richard<br />\nPfeffer -- who was, during my<br />\nyears at Hopkins, a teacher of<br />\nunequaled skill and dedication -is a tragic example. Put quite<br />\nsimply, Professor Pfeffer is one<br />\nof the precious few faculty<br />\nmembers left on the Homewood<br />\ncampus who demands of students<br />\nthat they think critically and<br />\nwrite effectively -- and who is<br />\nwilling at the same time to<br />\nexpend effort to impart these<br />\ninvaluable skills.<br />\nIf the University is at all<br />\nserious about its commitment to<br />\nthe most basic goals of higher<br />\neducation, its Academic Council<br />\nwill seriously consider Professor<br />\nPfeffer's appeal to have this<br />\ndecision reviewed.<br />\nAndrew G. Walder<br /><br />\nBy G.M. SMITH<br />\n. dring the day Willy works in an office. At<br />\nnight he cooks a quick dinner, maybe reads a<br />\nmystery, maybe blots out on alcohol and<br />\ntelevision, then goes to bed. On weekends he loafs,<br />\nusually with Sally.<br />\nSally is married to a man who owns a chain of<br />\nconvenience stores. Sally's husband is always on<br />\nthe road. Often he sleeps in the back of one of his<br />\nstores. When he comes home,smelling like tobacco<br />\nand sour milk, he wants to make love and eat a<br />\nhome coked meal. Sally obliges him and spends<br />\nmost weekends with Willy.<br />\nOne weekend Sally talks about hobbies.<br />\nYou've got nothing but your job, she says to<br />\nWilly, and you've been bored with that for years.<br />\nYou don't have a wife, you don't have children,<br />\nyou don't have pets, you don't even have any<br />\nhouse plants. Think about that. You don't even<br />\nhave any house plants.<br />\nWhy are you telling me this? Willy asks. He's<br />\nsitting at the: kitchen table, cleaning his nails with<br />\nthe corner of a matchbook.<br />\nBecause you don't have anything, Sally says.<br />\nYou'll be 45 in June and already you look 50. Why<br />\ndon't you go out and get a hobby?<br />\nWhere do you get a hobby?<br />\nHow should I know? I've never needed a hobby,<br />\nI've got a husband. But you, you need a hobby.<br />\nThat's plain.<br />\nWilly looks for a hobby to please Sally. He reads the hobby books she brings him and decides he will<br />\ncollect something.<br />\nWhat? Sally asks.<br />\nWilly collects tequila bottles. Glass-blown<br />\ntequila bottles from Mexico. The craftsmanship is<br />\nadmirable. But his interest flags. The tequila gets in<br />\nthe way. Sally tells him he isn't kidding anybody.<br />\nWilly collects the Lew Archer mysteries of Ross<br />\nMacDonald. He collects the Travis McGee<br />\nmysteries of John D. MacDonald. He collects the<br />\nNero Wolfe mysteries of Rex Stout. Sally tells him<br />\nto look around for something else.<br />\nWilly collects newpaper clippings of victimless<br />\ncrimes like gambling and prostitution and<br />\nmarijuana busts.<br />\nSally decides Willy is through with collection.<br />\nShebrings more hobby books. Willy says he will<br />\nmake something. He will create. He makes a<br />\nweathervane for his chimney. Sally nods approval.<br />\nShe and Willy spend an entire Sunday afternoon in<br />\nbed.<br />\nWilly makes a second weathervane, one for<br />\nSally, but she won't accept it because she doesn't<br />\nknow what to tell her husband. This puts Willy off.<br />\nTo spite her he starts collecting tequila bottles<br />\nagain, arranging the empties artfully in a broom<br />\ncloset.<br />\nMore hobby books. Willy is getting plenty tired<br />\nof hobby books, but Sally borrows them from the<br />\npublic library, insists Willy read them.<br />\nWilly decides he will , do something. Something<br />\nactive. An action hobby.<br /><br />\nHe buys a pail e aric<br />\ngames. Willy never di<br />\nhas always felt che :out<br />\nkids threw dice.<br />\nWilly learns to ( He(<br />\nfavorite dice garlic. he<br />\npj<br />\nand Drown The Cat .dIt Ra<br />\nand<br />\nNail<br />\nStep On A<br />\nNow what are yo tng to<br />\nWilly drives to<br />\nshops until he finds 4tieof<br />\nthe air shiver when<br />\nhis<br />\ndrives home and th vay.<br />\nsta)<br />\nSally<br />\ngets chilly.<br />\nboil Ice in<br />\nWilly puts his<br />\n1` of<br />\na black and whit , )<br />\nHe .is in a pit. A b°<br />\nfollow.<br />\nHe buys a dart 130 ifed1rt<br />\nO<br />\nHe buys a W<br /><br />\n4/ ,<br /><br />\na<br />\nHe buys a harjk,<br /><br />\nplay \"Yankee<br />\n1<br />\nbecomes distraugle<br />\nf0<br />\ngS<br />\na<br />\ni,<br />\nns<br />\nbeneath her eyes•411..x..tell<br />\nplace. I'm really<br />\nThen Willy e0174T11,<br />\nunder his arm- ijeri;hns<br />\npractices for hours' t<br />\nstretches from otiche<br />\nSally gives uPo<br />\n'Is<br />\nWilly slips, wrencr<br />\nass.<br />\nWhat?<br />\n,i :„iyov<br />\nSally calls<br />\n,<br />\nwilly<br />\ntablecloth.<br />\nanesthetize<br />\n4:41:s\\V.h..<br />\n:<br />\ngAl with<br />\niltilY<br />\ndoa<br />\nroad<br />\nthenWi '<br />\nl Pt ertiShialsul l '13<br />\nweek. When he rik-e<br />\nhead. He bites<br />\nthrough a bad tootfr<br /><br />\n4<br /><br />\niretlff2TttiLtil-<br /><br />\nU<br /><br />\n441<br />\n,<br /><br />\nir otl'e and teaches himself dice<br />\nvet dice, as a youngster and<br />\ndie Out of adolescence. Other<br /><br />\nto<br /><br />\nHooligan, for awhile his<br />\nlearns to play Poison<br />\n01 ig and<br />\nDrop Dead and<br />\nit Raw. He gets bored.<br />\nyoU \"g<br />\nto do? Sally says.<br />\n0 t c'lY and<br />\nhaunts the pawn<br />\n11CIS lit of bone dice<br />\nthat make<br />\n[erl rttles them<br />\nin his hand. He<br />\nth I bis bone<br />\ndice. The house<br /><br />\nDe. 141 he<br /><br />\nSta)<br /><br />\nboO ce in a<br />\ndresser drawer with<br />\nte r. if)ofhis dead<br />\nadolescence.<br />\nbr' NIL More action hobbies<br /><br />\ntio 'nd tosses<br />\ndarts.<br />\nitillOfe and<br />\nthrows it at birds.<br /><br />\n'die:, a Hohner, and learns to<br />\nvI;h in 35 seconds. Sally<br />\nl'. e lifts<br />\nbags of skin from<br />\ntags<br />\ndo not snap back into<br />\nii<br />\nItells<br />\nherself.<br />\nk nie with a limbo record<br />\ntns to do<br />\nthe limbo and<br />\nllin<br />\n)<br />\n(<br />\nI uP a bamboo pole that<br />\n, e ,)-. the<br />\nkitchen to the other.<br />\nSile .111i ts on the kitchen floor.<br />\nIlk Is<br />\nback. Sally calls Willy an<br /><br />\n1<br /><br />\ni 1i<br />\n'101 ' v*Ping<br />\nto<br />\n.her mouth on the<br />\n' the liquor cabinet .to<br />\nIf'ilY<br />\n' t)!r calls Willy a liquonsh<br />\nici. ts. b.<br />\ni . isaPpears. Goes on the<br />\n01/ W<br />\n'<br />\n11Y sleeps in tequila for a<br />\nls sullen. He hangs his<br />\nOf his<br />\nhand. He sucks air<br />\n11.<br /><br />\n-444,44- -444•••-4,<br />\n4-4<br />\n,<br /><br />\n*<br /><br />\n** *<br />\nw44 44......•••••••<br />\n44444,<br /><br />\n4+,4<br /><br />\n* **<br />\nrdr<br />\ntaillSrah:*<br />\nJo<br />\nLa:W*6W<br />\n:=4\"11—<br />\n.441\"<br />\n.<br />\n\" *** \"-a.<br />\ntanittr\"t.....<br />\n*<br />\n•<br /><br />\n.4.44<br />\n•<br />\n•-444.<br /><br />\nttip<br /><br />\n****=SIM<br /><br />\n444,4.+4.4.4-1,4.44,44.44•44444444<br />\n'<br />\nV4i<br /><br />\n17\"4<br />\n.+-4••<br /><br />\n41=44+44<br />\n44411ett4<br /><br />\n444<br />\n.414-'1'<br /><br />\n44.<br /><br />\nfair fiction * fah<br />\nBy JOHN PERROTTA<br />\nindo pedaled along the viale looking at the<br />\nfat saffron sign<br />\nwhores. Overhead, a<br />\nblinked against the evening sky -- a gas station. He<br />\nturned and headed for the pump, rainwater<br />\nshooting from the brakeshoes as he slowed.<br />\n\"Ciao! Nando!\" The old attendant tightened the<br />\ngas cap on a Fiat Cinquecento. 'Climbing hills<br />\nagain?\"<br />\n\"'Walls' is more like it, Basaluzzi.\"<br />\n\"What about the little puttana on Via San<br />\nFelice?\"<br />\n\"Ah, she's gross.\" He rocked back and forth<br />\nover the handlebars of his bike.<br />\n'Sure, Nando. Sure she is. But don't worry,<br />\nthere's plenty around. Don't be so obvious, you're<br />\nlike a green kid! You got to have authority,<br />\nclaSs . . .\"<br />\nNando shrugged his shoulders, popping his head<br />\nforward and opening his-hands.<br />\n\"Maybe you need a two-seater, huh?\" Basaluzzi<br />\nsaid, wiping the drizzle off his forehead and<br />\nlaughing. A Volkswagen pulled in. \"Keep 'em<br />\ncrossed, hey? Your fingers, I mean.\"<br />\n\"Thanks, Basaluzzi. You check her oil when I get<br />\nher, va bene?\"<br />\nWhen the sky went dark he dOwnshifted, and<br />\nthe chain rasped the metal until it caught the larger<br />\nsprocket. Only at night would he dare ride so<br />\nslowly.<br />\nWhore number three. She acted like she had an<br />\nappointment with the mayor. Her eyes checked her<br />\nwatch, her purse, herfeet, up and down the viale,<br />\nwatch, purse, street — over and over.<br />\nHe sliced through a puddle, and water fanned<br />\nover the curb in oily rainbows. He stared at a<br />\nyoung girl wearing a chemise with the price tag still<br />\nattached. She threw a fist in her elbow and curled<br />\nup her arm.<br />\n\"Me ne frega!\" Nando yelled back. He smiled,<br />\npedaling under the wet light of the street lamps.<br />\nAhead three cars splashed their lights on the<br />\nbody of a woman. She had eyes like Perugina<br />\nchocolates, and protruding lips below a perfect<br />\npyramid nose. She wore a man's white dress shirt,<br />\ntight UFO jeans, and a shoulder purse. In her hand<br />\nwas a green-white-red umbrella.<br />\nNando, struck by her dress as well as her beauty,<br />\ndidn't see the Fiat ahead of him; the bike scraped<br />\nagainst the rear fender. He waddled over the bike,<br />\nhis face pink in the light of the oncoming cars.<br />\nThe whore giggled under her umbrella.<br />\nCircling around, he got back in line. A wet<br />\nwindow lowered, and out popped a mass of curly<br />\nhair. She stood by the car talking.<br />\n\"What am I,\" the driver shouted,\"millionario?\"<br />\nHe jack-rabbited into the traffic.<br />\nNando moved up, leaning over on his bike.<br />\n\"How much'?\"<br />\n'Three hundred thousand lire.\"<br />\n\"Quanto?\" he asked, amazed.<br />\n\"Three hundred thousand lire, and you need a<br />\ncar.\" She turned, leaving him to face the dome of<br /><br />\nher umbrella.<br />\n\"Cazzo!\" He walked around it, swinging a leg<br />\nover his bike. \"Get on!\"<br />\n\"Che? What do you think I am,a child? Via!\"<br />\n\"Uli, well, uh . ;what about a walk?\"<br />\n\"What do you mean,a walk?\"<br />\n\"How much,just to walk with me?\"<br />\n\"Fifteen thousand lire, no twenty thousand.\"<br />\nShe looked at him curiously, defiantly.<br />\nHe got off the bike, broke the back wheel and<br />\nstacked it with the front, locking both to the No<br />\nStanding sign. He handed her three bills. She closed<br />\nthe umbrella, creased the notes neatly and slipped<br />\nthem into her purse.<br />\n\"Pronto?\" she asked. \"Andiamo.\"<br />\nThey walked in silence for a few minutes, Nando<br />\ntwice reassuring himself that his pants were<br />\nbuttoned.<br />\n\"My feet hurt,\" she said. \"Let's go to the Piazza<br />\nMaggiore.\" She turned before he could answer.<br />\nUnder the porticos store owners in shop aprons<br />\npulled their doors down one third of the way. It<br />\nwas almost closing time. \"Are you Bolognese?\"<br />\n\"Yes,\" Nando said.<br />\n\"Where do you live?\"<br />\n\"Parents. How long have you been a, a<br />\n\"A whore? Oh,seventy-two years.\"<br />\nThey entered the piazza and sat on the steps of<br />\nSan Petronio, the unfinished façade to their backs.<br />\nMen with derbyish hats stood in groups, in circles,<br />\ntheir hands behind their backs.<br />\n\"I love it here,\" she said. \"Especially Neptune.\"<br />\n\"The fountain?\"<br />\n\"Yes.\"<br />\n\"Ornello did it, or was it DiCristofaro?\"<br />\n\"Ha! Stupid°, the artist wasn't even Italian. It<br />\nwas Jean de Bologne, the Flemish sculptor who<br />\ncame here to escape oppresion in his own<br />\ncountry.\"<br />\n\"He chose the wrong place,\" Nando said, trying<br />\nto sound sure of himself.<br />\n\"Of course, considering what the Medici was<br />\ndoing here in Emilia.\"<br />\n\"You studied art, I guess.\"<br />\n\"I study art, yes. What do you do?\"<br />\n\"Set constrution. In the Teatro Comunale.\"<br />\n\"I saw I ysistrata there last week -- have you<br />\nseen it?\"<br />\n\"No,\" he said. \"I'haven't had a ch—\"<br />\n\"Superbo! The Ragazzini translation is better, of<br />\ncourse, but I did meet Cinesias backstage. He took<br />\nme to dinner at Donatello's.\"<br />\n\"He . . he did? Tocco? What did you do for<br />\nhim?\"<br />\n\"Yes, he is so nice. And he has a charming wife,<br />\nBianca.\"<br />\n\"Opening nights I sell tickets,\" he said. \"Other<br />\nnights I ride around Bologna looking at your<br />\nfriends on the viale.\"<br />\n\"Do you talk with them?\"<br />\n\"They don't give me a chance. You're the first.\"<br /><br />\n\"Oh, yes? Let's get something to drink now.\"<br />\n\"Okay.\"<br />\nThe caffe was welliit, with floor-to-ceiling<br />\nwindows all around. They sat opposite each other.<br />\nWho'd ever drink with a whore, he thought.<br />\n\"What would you like?\"<br />\n\"Coffee.\"<br />\n\"Coffee?\"<br />\n\"Lots of sugar.\"<br />\nHe brought two espressos back to the table. A<br />\nyoung couple sat in the corner, their hands<br />\ntogether on the dark wood table, a finished puzzle.<br />\n\"Come ti chianti?\" she asked.<br />\n\"Nando. Nando Forli. E tu?\"<br />\n\"I'm Filomena Ingamba.\"<br />\n\"Ingamba?\" he asked, surprised. `,`Wasn't your<br />\nfather mayor?\"<br />\n\"Yes, how did you know?\"<br />\n\"How did I know?\" he asked incredulously.<br />\n\"Everyone knows! His picture's been all over the<br />\npapers, his name, everything! Yours too --- I've<br />\nseen your picture in II Resta di Carlino.\"<br />\n\"Only once or twice,\" she said.<br />\n'But what about his reputation'? What if<br />\nsomeone recognizes you? You'll ruin him!\"<br />\n\"Who'd expect to buy a night with the mayor's<br />\ndaughter?\"<br />\n\"Dios. bono! There you are in bed and you think<br />\nhe won't know you? Your face?\"<br />\n\".You worry too much; you're a child. How<br />\nmany times do you think a girl like me gets<br />\npropositioned? Huh? Ten times a day? Twenty?<br />\nAnd what do you think they want? In my father's<br />\noffice it was the same. I couldn't stand it. So now I<br />\ngive them what they gave me.\"<br />\nNando brought the coffee cup to his lips even<br />\nthough it was empty.\"How long?\" he asked.<br />\n\"Sixty nights, maybe more. I wait on the viale<br />\nfor an hour. I ask an absurdly high price. They<br />\ndon't argue, they drive away. I've never had a<br />\ncustomer in my life.\"<br />\n\"The girl who never gets picked up,\" he said.<br />\n\"Amazing.\"<br />\n\"You're the first, Nando. Congratulations. And<br />\ngood-bye.\" She walked out of the calft, leaving<br />\nNandi), the cup still at his lips.<br />\n\"Wiiit!\" he shouted, \"I haven't finished.\" Ile<br />\ndropped the cup and headed for the door.<br />\n\"11 conto, sipor,\" said the bar attendant.<br />\n\"Don't forget the bill.\"<br />\nNando fumbled in his wallet for some notes.<br />\nThe bus pulled away from the stop before he<br />\ncould reach it. She was standing in front beside the<br />\ndriver. He stood there for a moment. stunned.<br />\nThere were whores on the viale. Ile took his bike<br />\nfrom the No Standing sign and snapped it together.<br />\nRainwater iced the asphalt. Trees dripped. Ile<br />\nheard the constant hiss of small rubber tires<br />\nthrough water. Pedaling around the viale. past the<br />\ngas station where Basaluzzi worked, he noticed the<br />\nsaffron light was black.<br /><br />\ntrite S'<br /><br />\nApril 22, 1411<br /><br />\nncws-letter<br /><br />\nThe National Theatre Company Presents:<br /><br />\n\"Iiravos, laughter and people) filled th• hems* ail elm**<br />\nAnna KIssolgoff - The NW York Times<br /><br />\nThe Johns Hopkins<br />\nUniversity Band<br />\npresents its<br /><br />\nSpring Concert<br />\nSaturday<br />\nApril 23,1977 Sinn<br />\nShriver Auditorium<br />\nSHRIVER HALL<br />\nJOHNS HOPKINS UNIVERSITY<br />\nApril 24 — 8:00 p.m.<br />\nTickets<br /><br />\nStudents<br /><br />\nAdults<br /><br />\nFREE<br />\nADMISSION<br /><br />\nTickets on sale at Union Desk &amp; at door<br />\nSponsored by the Un on Board<br /><br />\nCOURSE GUIDE SUPPLEMENT<br />\nDue to some problems in production these courses were not listed in the COURSE GUIDE<br />\nWe apologize to both students and faculty and look forward to continued support from<br />\nboth. Course Guide Editorial board.<br /><br />\n10.1 is a reprint.<br />\n80.371 was inadvertently listed as 10.371,<br />\n13.651 Reading in the Mishnah<br />\nDr. Rosenblatt<br />\n- Professor's statement: Readings in the Mishnah. The text of tractates<br />\nfrom the<br />\nOrders of Mo'ed, Nashim and Nezikin will be studied, noting content as well as linguistic<br />\nfeatures of Mishnaic Hebrew. To be continued in the spring.<br />\n13.653 I bn Ezra and Nachmanides<br />\nDr. Rosenblatt<br />\nProfessor's statement: I bn Ezra and Nachmanides. The commentaries of these two<br />\nmedieval exegetes on portions of Genesis and Exodus will be read and their distinctive<br />\ncharacteristics noted. To be continued in the spring by a study of other exegetes.<br />\n13.657 Jewish Philosophical Literature<br />\nDr. Rosenblatt<br />\nProfessor's statement: Jewish Philosophical Literature. The philosophical writings of<br />\nwill<br />\ng e9nnt e pB4F, tay 'tic'ePre'L<br />\nbcri srce2lti itnndoq iIELes,VcYr<br />\n'<br />\nrjr gUtPSh<br />\nq-Ya MCI)e<br />\naI8'NV(<br />\nMoses<br />\n)<br />\n)<br />\nMaimonides. The translations used will be the English as. ine !I as the Hebrew. Students able<br />\nto read Arabic will have an opportunity to employ the original Arabic texts;<br />\n20.328 Topics in Abnormal Psychology<br />\nDr. Strauss<br />\nProfessor's statement: This lecture-discussion course will concentrate on the study of<br />\ncognitive processes in psychotic states. Among the topics to be considered will be the<br />\nrelationship between thought processes and mood states, theories of paranoid thinking, and<br />\ninformation processing in schizophrenia. Because of the importnace of diagnostic concepts<br />\nin this area, the course will begin with an examination of contemporary conceptions of the<br />\nsymptomatology of schizophrenia and its differentiation from affective disorders and with<br />\nthe issue of the \"myth of mental illness\" or its cultural relativity. There will be a heavy<br />\nemphasis on contemporary experimental research, the discussion of which will be led by<br />\nstudents, in addition to a consideration of general theoretical positions and methodological<br />\ncomplexities in this area of research, which will be the subject of the professor's lectures.<br />\nThe course will meet two hours weekly. The first hour will be a lecture. During the<br />\nsecond hour readings related to the lecture/<br />\nbe discussed. Readings will be drawn from<br />\ntexts, monographs and current professional journals. There will be one examination and a<br />\npaper. Consent of the instructor is required before enrollment, which will be limited to 20<br />\nts<br />\nstuflen<br />\nhus the course might be succinctly described as one on the experimental psychology of<br />\npsychosis.<br />\n22.619 Seminar In Forms<br />\nDr. St. John<br />\nProfessor's statement: This course will consider a variety of poetic forms and<br />\nconventions. Weekly or bi-weekly writing assignments will be made. ix texts will be<br />\nrequired and occasional outside reading will be assigned. For graduate students in the<br />\nWriting Seminars.<br /><br />\n23.625 Seminar on D<br />\nDevelopmenttl<br />\nDr. Chase,Dr. Dunn<br />\n.<br />\nProfessor's statement: This course examines the emergence and consolidation of the<br />\ncapitalist world-economy with and eye to understanding the causal mechanisms underlying<br />\nits development. A research paper will be required.<br />\n24.1 and 24.2 Calculus Computing Lab<br />\nDr. Horn<br />\nProfessor's statement: These courses offer an opportunity to do numerical laboratory<br />\nexercises on topics chosen from the syllabi of Calculus 1 and 2. The University's timeshared<br />\ncomputing systems is used, but no previous programming or computing experience is<br />\nrequired. Concurrent registration in the corresponding calculus course (11.6 or 8; 11.7 or 91<br />\nis required, and enrollment is limited to 30 students.<br />\n245<br />\n3aeFn9u<br />\nf(Ide9.3geritimt Scienc 1<br />\ntvaluation<br />\necours concerns management technology ancPEfeng<br />\ntheory. The course was praised for applyin% decision theory and operations research to real<br />\nworld situations. As one student said, \"The best part of the course is the prof's real-world<br />\ncontact.\" The grade was based on homeword, quizzes and a choice of final or paper.<br />\n30.313 Eighteenth-Century Concepts of Heroism<br />\nDr. Wills<br />\nProfessor's statement: A study of the cult and iconography of Washington and Napoleon.<br />\nClass limited to 15. Professor Wills meets his seminar at home.<br />\n30.369 Criticism and the Audio-Visual Media<br />\nDrs. Macksey and Livingston<br />\nProfessor's statement: Workshop in writing critical responses to film and television.<br />\nAnalysis of rhetoric and values in student papers and selected reviews.. Readings in cinema<br />\ntheory. Screenings and guest speakers to include Leo Braudy, George Wilson, and Horace<br />\nNevvcomb.<br />\nThis is a seminar aimed at the development of critical habits of reading andvvn tin q. The<br />\nbasic equipment is a typewriter or steady hand. Paisley Livingston has studied film in Paris<br />\n(but speads English without the trace of an accent). Readings and discussions will try to<br />\nsynchronize with films being screened on the campus and commercially.<br />\n30,613 Methods in Literary Reading<br />\nDrs. Jacobs and Macksey<br />\nProfessor's statement: A course offered to first- year graduate students in literary studies<br />\n(Classics, English, German, Humanities Center, Romance Languages) as an introduction<br />\nboth to the faculty of those departments and to a variety of current theoretical approaches<br />\nthat may well be new to the incoming student. Since the seminar is intended as a<br />\ncomplement to other course work, written requirements will be kept to a minimum. Classes<br />\nwill combine lecture and discussion of brief texts (available in English), given each me k by<br />\na different faculty member.<br />\n30.621 Seminar in History of Ideas: The History of Psychology<br />\nDr. Mandelbaum<br />\nProfessor's statement: Historical analysis of some major movements in psychology in the<br />\n17th, 18th, and 19th centuries, with special attention to at least some of the following:<br />\nDescartes; Spinoza; theories of motivation in the 18th century; Associationism; hedonism<br />\nvs. hormic psychology in the 19th century. In so far as time permits; some tendencies in<br />\n20th-century psychology will be briefly examined.<br /><br />\nr<br />\n1<br /><br />\nApril 22, 147/<br /><br />\nnews-letter<br /><br />\nThe SAC and the<br />\nHomewood Community<br />\nwish to thank all the<br />\nfabulous people who help<br />\nmake the Fair happen.<br />\nTHANK YOU!<br /><br />\nPut your expensive eye<br />\nbehind our inexpensive System 35...and WOW<br />\nJust about any of the great photographs you see<br />\ncould have been taken with Vivitar System 3.5.<br />\nPlus one good eye. Vivitar System 35 is a most<br />\ninexpensive way to get serious about photography.<br />\nThe basic limitation is your own creativity and skill.<br />\nVivitar 220/SL 35mm camera Center-weighted<br />\nmatch needle metering system/Speeds from<br />\n1 / 1 000 to 1 second plus \"B\" for time exposure/Electronic flash sync at 1/125th<br />\nsecond/Universal thread mount 50mm<br />\nf1.8 lens/Built-in hot shoe/Self timer/<br />\nFilm -in-chamber Indicator/ASA Range<br />\n25-1600. Vivitar Automatic Electronic<br />\nFlash Up to 200 flashes from one single<br /><br />\nal)Ponde, &amp; Best, Inc , 1977<br /><br />\n1.1<br /><br />\nVivitar System 35<br /><br />\n9 volt alkaline battery. Vivitar Automatic<br />\n135mm f2.8 lens Soper foca! ;enoth<br />\nfor portraits/About 2 times larger loan<br />\nnormal image Vivitar 2X Tele<br />\nDoubles the effect;vc- focal iength of<br />\n• lenses/Converts the 50mm lens to 1 0Ornrr<br />\nthe 135mm lens to 270m ,--, Viviiar.,Enduro<br />\nCase Carries te.c,ntire nystem corrfortably and securely while hikHng cycling,<br />\nskiing. etc. Find the nearest Vivitar dealer and<br />\nask for a demonstration.<br /><br />\nconverter<br /><br />\nMarketed In the U S A. ty Ponder &amp; Best Inc<br />\nCorporate Offices 1630 Stewart Street, Santa Manna,<br />\nCA 90406 In Canada Vivitar Canada Ltd./Ltee<br /><br />\n'Ate 1C<br /><br />\napril 22, 14//<br /><br />\nincws-Ictter<br /><br />\n\"Anybody can make a bad record- ,<br />\nbut anybody can't make a good one.<br /><br />\n'ROBINSON<br />\n'<br />\nS GORSUCH HOUSE<br /><br />\noars<br />\nUniversity Sandwich Shame and Deft<br /><br />\nWith confidence<br />\noriginal study materials<br />\nsmall groups • tape center<br />\nsummer &amp; compact courses<br />\nCALL<br />\n(202)<br />\n244-3010EDUCATIONAL<br />\nKM CENTER<br /><br />\nfEATURiNg...<br />\ngREEk &amp; AMERICAN CUISINE<br /><br />\n4201 Connecticut Avenue, N.W.<br />\nWashington, D.C. 20008<br /><br />\nRENTAURANT &amp; CARRY OUT<br /><br />\nCOME<br /><br />\nUNIVEIRSITY PARKWAY<br />\nAT ST.PAUL<br />\nLOOPY. L/141YORS(TY O<br /><br />\nGRE • GMAT • SAT<br /><br />\nNEwty-dECORATECI!<br />\nNEW MANAgEMFAT1<br /><br />\nAN Lamp Crab Cakes<br />\nGamine ICodeee Corned Bed<br />\nDelicious Rosa Beef<br />\nVirginia Baked Ham<br />\nVarious Cold Cats<br />\nCheese(Swim, Provolone. Meant.)<br />\nKoeha Hot Do.<br />\nCawing<br />\nParty Trays(special ordee)<br />\nPizza<br />\nHome Made Dared (Cheese Cake)<br />\nIce Cream<br />\nSelect Grocay Items<br />\nPlante<br /><br />\nPitaass 46742110<br />\nM • Pri: 9:30 - 700<br />\nSat 930 - 2.-00<br />\nClosed Sundays<br />\nFREE SODA<br /><br />\n--Jelly Roll Morton<br /><br />\n511 CORSUCh AVENUE 235-2744<br /><br />\n*<br />\n*<br />\n*<br />\n*<br /><br />\nAPTS.<br /><br />\nWITH THIS At) AND<br />\nPURCHASE OF $1.00<br /><br />\nIN<br /><br />\nANd<br /><br />\nTRY OUR<br /><br />\nFlaming shiskabob<br />\nGreek salad<br />\nPastitsio mousaka<br />\nBaklava<br /><br />\nBUSsNESS<br /><br />\nStuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nfrivelopes Dept. 339A<br />\n310 Franklin Street<br />\nBoston,Mass. 02110<br /><br />\n'Rooms available for private parties<br />\nI --- Banquets --- Catering ---<br /><br />\nMMINIM<br /><br />\nii<br /><br />\nYot__ArSAmpus-Pride!<br /><br />\nI<br /><br />\nI<br /><br />\nRE VOLL 7IONA R y<br />\nNEW<br />\nUNIQUE<br />\nHISTORIC— First University Campus Postcards<br /><br />\nNEW<br /><br />\nII p1<br />\nI<br /><br />\nDifferent Superb Scenic-Views.<br />\nFrom Your Campus. On One Card<br /><br />\nti<br /><br />\nCatholic<br />\nCommunity<br />\non Campus<br /><br />\nr<br /><br />\nYOUR CAMPUS PRIDE GOES WORLDWIDE<br /><br />\nt<br /><br />\nThink! Think more often on your relatives &amp;<br />\nfriends.,drop them a line. They will admire &amp;<br />\ntreasure your pride! Frame one for,yourself!<br /><br />\nUNI-PRIDE CREATIVE POSTCARDS<br /><br />\n.11111.+11...11111..111111..1111P<br /><br />\n4.<br />\n1<br /><br />\nJOHN GA(H BOOKSHOP<br />\nRA1 TIMORES LARGEST<br />\nED BOOKSTORE<br /><br />\nV<br /><br />\n\"THE A/L4RK OF THE CLOWN\"<br />\nA Film Liturgy<br />\nSunday, April 24th<br />\n10:30 a.m. in Shaffer, Room 3<br />\n5:00 p.m. in Newman House<br />\n2941 N. Charles.<br /><br />\n1<br /><br />\n3322 ,Greenmount Ave.<br />\n467-4344<br />\n(JS• ED AND RARE<br />\nOLD AND OUT—OF—PRINT I<br /><br />\nON SALE/AT YOUR UNIVERSITY BOOK-CENTER<br /><br />\n\"OM.'MM.<br /><br />\n• 41121IIVAIraralr/AlrarAKIIII'ArI'Ar/KgrAir/4/ArapArarAprA/2/%<br /><br />\nOrleans<br /><br />\nOPPOPTUNIT<br /><br />\n41.10.<br />\n---<br /><br />\n41.w 4111.3<br /><br />\nSenior Class Film Series<br />\npresents<br /><br />\nTHE<br /><br />\nADVENTURE OF<br /><br />\nSHEIRkLOCK HOLMES'<br />\nSMARTER BROTHER<br />\nA HICHARO A HOTHIJOUtfl PHUUUCIION<br /><br />\n—Dom DeLuise-Leo McKem<br />\nGene<br />\nWilder<br />\n. .<br /><br />\nMadeline<br />\nKahn<br /><br />\n••.*•<br />\n•••••••::<br />\nf•••••.<br /><br />\nFriday, Saturday,<br />\nand Sunday<br /><br />\nMarty<br />\nFeldman<br /><br />\nFri. April 22 5:30, 8:00 &amp; 10:00<br />\nSat. April 23 3:30, 5:30,<br />\n8:00 &amp; 10:00<br />\nSun. April 24 3:00 &amp; 5:30<br />\nAdmissioN $1.00<br /><br />\nShaffer 3<br />\n•••••• ..:•:••<br /><br />\n••.....<br /><br />\n• •• • •<br /><br />\nSENIORS $.75<br /><br />\n11111 11, 1411<br />\ngimp 411MO. .111111. .1110110. .111111. 4111W 411111w<br /><br />\n44.11. .1•11. -.111110. .1111111.<br /><br />\n••■•■•• .1101.<br /><br />\nNONDENOMINATIONAL<br />\nOFFICE OF THE CHAPLAIN<br /><br />\nUE2173<br /><br />\n\"THE SUNDAY EXPERIENCE\"<br /><br />\n01:.&gt;J0<br /><br />\n• presents<br /><br />\nAT<br /><br />\nA<br /><br />\nBALTIMORE*DETROIT*MINNEAPOLIS<br /><br />\n\"ARAB RIGHTS IN THE MIDDLE EAST CONFLICT-<br /><br />\nThe Dcpartment of Urban Affairs at Hunter College<br />\nof the City University of New York offers a two-year,<br />\n60-credit program leading to a MASTER OF URBAN<br />\nPLANNING dogree.<br />\nAction oriented, Hunter's program preppies with<br />\nsocial and economic problems end explores the<br />\nareas of housing, transportation, environmental and<br />\nhealth care planning.<br />\nJeldworR opportunities abound—In city and<br />\nsu-ourben planning agencies, in neighborhood<br />\ngroups, In community development orrjzinizationa.<br />\nRequirements are flexible and an able, diverse,<br />\n'and experienced faculty Is ready to add guidance<br />\nand direction to student goals.<br />\nExtensive financial aid is available. Current costs<br />\nare $750 a semester for City resdents and $1,000<br />\nfor non-City Residents, plus activity fees.<br />\nFor more Informa;ion and .adrnisslon applications<br />\nwrite: Director, Graduate Program in Urban PlanWrig, Hunter Cc.:Ilegc/C.U.N.Y., 790 Madison Aveme, New York, N.Y.la.:..)21 --(212;$10.5.591.<br /><br />\nTalk by<br /><br />\nREVEREND JOSEPH RYAN,SJ<br />\nFormerly with the Center fin- the Study of:<br />\nThe Modern Arab World, Beirut<br />\nSUNDAY, APRIL24, 11:00 AM<br />\nLISTENING - VIEWING ROOM<br /><br />\nLEVERING HALL<br /><br />\nALIYAH<br /><br />\nARC<br /><br />\nIf you have recently considered<br />\nmaking Israel your home or if the<br />\nidea has been germinating in the<br />\nback of your mind, contact the<br />\nIsrael Aliyah Center. Learn about<br />\nspecial benefits available to new<br />\nimmigrants, as well as facts about<br />\nemployment, professional<br />\nretraining, education, housing.<br />\netc. Ask about financial<br />\nassistance and special material<br />\ndesigned for students. If you are<br />\ninterested in Israel, Israel is<br /><br />\nEUROPEAN FLIGHTS<br />\nProvides the academic<br />\ncommunity with discount<br /><br />\ninterested in you.<br /><br />\nair travel arrangements.<br />\nIsrael Aliyah Center<br />\n2027 Massachusetts Ave., N.W.<br />\nWashington, D.C.20036<br />\n(202)387-8224<br /><br />\nLet us serve you.<br />\nSave 1.1. Be Flexible<br /><br />\nFor information, please send to the above address.<br /><br />\nCALL US LAST<br /><br />\nA-34<br /><br />\n_Age<br /><br />\nName<br />\nAddress<br /><br />\n__State<br /><br />\nCity<br /><br />\nToll Free 800-223-1722<br />\n1111104110•••••••••••••••••••••••04111<br /><br />\nONE WEEK AIR CHARTERS FROM<br />\nBALTIMORE/WASHINGTON INTERNATIONAL<br /><br />\nNIA<br />\nCALIFOR<br />\nFrom<br />\n$229 „.•<br /><br />\nZip<br /><br />\nUniversity<br /><br />\n(USD)<br /><br />\nUBS 1977<br /><br />\nCharter Tours<br />\nD.C. &amp; Bah. Departures<br />\n1111111•11111E••11111111••1111111•11•1111111I1111111•11111111111<br />\nfrom<br /><br />\n-<br /><br />\nPer Person — Air Oifty<br /><br />\nNON-STOP VIA AMERICAN AIRLINES<br />\nDepartures July 8 &amp; August 5<br />\nThe low price includes round trip jet transportation.<br />\nappropriate meals and drinks aloft and air taxes. Ideal<br />\nfor .the person who likes to go on his own or who will<br />\nstay with friends and relatives<br /><br />\nALSO AVAILABLE<br /><br />\nWe have special reduced hotel and rent-a-car rates so<br />\nthat you can- plan your own California vacation in any of<br />\nthirteen great California cities.<br /><br />\nESCORTED PACKAGE including<br /><br />\nSan Francisco,<br />\nMonterey and Los Angeles with deluxe accommodations,<br />\nbaggage transfers and handling, deluxe motor coach<br />\ntranspatation and sightseeing, full day at Disneyland and<br />\nround trip air transportation, $439Per Person, double occupancy. BURCH TRAVEL LTD<br /><br />\n3900 N. Charles St.- ' 467-3900<br /><br />\n(just up the street)<br />\n••••••••••••••••••••0000000011141<br /><br />\nLondo<br /><br />\n1. 2 &amp; 3 week charters<br />\nMarch—Dec 30 Weekend<br />\nDepartures. via British<br />\nCaledonian Airways<br /><br />\n$<br />\nair only<br /><br />\nABC &amp; TOO<br /><br />\n•••11•11111111•1111•11•1111111111••111111111•111111••115111<br />\nfrom<br />\nParadise island<br />\nHoliday Inn<br /><br />\n299<br /><br />\nBahamas<br /><br />\nJuly—Nov. • 299<br />\n$<br />\n'3\"<br />\nMar—Apr<br />\n17 weekend departures<br />\nall inclusive<br />\nAir, Hotel, Tax Piedmont Airlines<br /><br />\nOTC<br /><br />\n•••1111111/111111_111111••11111••111111111•••111111111••111•<br />\nAcapulco S315-9 depar- from<br />\ntoP src Fe1<br />\n66T4cet„<br /><br />\nexico<br /><br />\nM<br />\nOTC &amp; ITC<br /><br />\n:;1,)ct $<br />\n-Z'4'7x.`c'<br /><br />\n315<br /><br />\nV anta S3WJauly 22-29<br />\nAir, Hotel, Tax American &amp; United Airlines<br /><br />\nall inclusive<br /><br />\n11••••1111,111111111•211111111111111111111111•1111111111••11•11111<br />\nfrom<br />\n__ Waikiki Village '429<br /><br />\nilIm46e4<br />\naif'<br />\nffi ‘ag<br />\nn lnna a:<br />\nHawaii Ftlidiodaiiaw<br /><br />\nrom.,D499<br /><br />\n$345<br /><br />\nepartures<br /><br />\n&amp; United Airlines<br /><br />\nAmerican<br />\nair only<br />\nABC &amp;<br />\n•111•1111111•11111••••111•11111111111•11111ummans<br /><br />\nOTC<br /><br />\nIreland<br />\nPlease call<br /><br />\nPART TIME EMPLOYMEN<br />\nPPORTUNITY for Studer<br />\nroficient in Fortran comp<br />\nrogramming. Math/Stat. Backg•<br />\nConsid. a plus. Call 730-5128<br />\nwrite MASINC, 10221 Wincopr:<br />\nCircle Suite 216, Columbia, 5,1,<br />\n41044.<br />\n.Quality<br />\nk.....<br /><br />\nTyping 467-0342.<br /><br />\nANISH by experienced natty/.<br />\nt teachers - All levels. all &amp;gee.<br />\nf 366-2056.<br />\nI EUROPE '77 No Frills Charters<br />\nGLOBAL TRAVEL, 521 Fitt<br />\nAte., N.Y.,N.Y..1 0 0 1<br />\n212-379-3532.<br /><br />\nBURCIli<br /><br />\nTwo students want to take care o<br />\nvacationer's home during th<br />\nsummer months Ca11:366-6286.<br /><br />\nTRAVEL LTD<br /><br />\nCarpenters-needed for rennovation<br />\nFree Room. Call 332-1110.<br /><br />\n467!-3900<br /><br />\nsee Room w/ semi-private bath ir<br />\nexchange for light housekeeping &amp;<br />\ncouple evenings baby4tting. ithin<br />\n'five minutes drive. Call 332-1110.<br />\n_Female preferred.<br /><br />\nI<br /><br />\n*-<br /><br />\n&lt;<br /><br />\n••••<br /><br />\ndavid porter<br /><br />"}], "field_media_file": [{"target_id": 41216, "display": null, "description": null, "target_type": "file", "target_uuid": "07996dbe-3613-4521-873b-ddcdfe8d3c03", "url": "http://digital.library.jhu.edu/system/files/2022-03/14354-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 14354, "target_type": "node", "target_uuid": "7ba82076-3439-4d1f-8f1b-515b8bd6395c", "url": "/node/14354"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "aee4a616-dd8a-42c2-845b-27cf29f96282"}]}