{"mid": [{"value": 35672}], "uuid": [{"value": "803aff20-fc8f-4258-858c-80f576dada37"}], "vid": [{"value": 35672}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:01+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12212-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:01+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:01+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "r<br />\n<br />\n).<br />\n-<br />\n<br />\nY,<br />\n<br />\nP<br />\n<br />\n10<br />\n<br />\n\fJOHNS HOPKINS UNIVERSITY.<br />\n<br />\nThe Johns Hopkins Press!<br />\n<br />\n11111.Tiasont. PAO.<br />\nAmerican Journal of ifisthematies.<br />\nF. MORLEY. Editor. Quarterly. 4to. Volume XXIV<br />\nin progress. $6. per volume.<br />\nII American Chemical Journal.<br />\nI. REBORN, Editor. Monthly. 8vo. Volume XXYEI<br />\nin progress. $5. per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. SvO.<br />\nVolume XXIII in progress. $3. per volume.<br />\nIV. Studies from the Biological Laboratory.<br />\nVolume V complete. $5. per volume.<br />\nV. Studies in Historical and Political Selene..<br />\nMonthly 8vo. Series XX in progress. $11. Per<br />\nvolume<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol XXI in pra'<br />\nyear.<br />\ngross. $1.<br />\nperHospital Bulletin. Monthly 00<br />\n'<br />\nVII. John Hopkins<br />\nVolume XI in progress. $1. per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume X<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriolog7 and Comparative<br />\nSemitic Philology,(Beitrage zur Assyriologie. ctc.'<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. r1.50<br />\nper volume.<br />\nXI. Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. VolUl<br />\nXVII in progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Ili-monthly. 8vo. Volunle<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nHENRY M. HUED,Editor. Quarterly. 4to., $15 pet<br />\nvolume.<br />\nxtv. Reports of Maryland Geological Survey.<br />\nWI LLIAM II. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Else\"<br />\ntrinity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\nVolumoVIIin progress. 14.60 per voluble'<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of True'<br />\ntees, reviewing the operations of the Universiti<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, eta., of the University. Pufr'<br />\nlisked at the close of the academic year.<br />\n1.<br />\n<br />\nTwentutizth Year.<br />\n<br />\nBeginning October 1st, 1901.<br />\n<br />\nPresident,<br />\n.<br />\n.<br />\nDean of the Medical School,<br />\nDean of the College,<br />\n.<br />\n<br />\n.<br />\n<br />\nIRA REMSEN.<br />\nWM.H. HOWELL<br />\nEDW.H.GRIFFIN.<br />\n<br />\nINSTRUCTION<br />\nFor Gradnate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidatk s for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.;coursos for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLibraries of Baltimore.<br />\nUniversity<br />\n•• •<br />\nPeabody Institute<br />\nPratt Library<br />\n<br />\n100,000 volumes.<br />\n135,000 volumes.<br />\n200.000 volumes.<br />\n<br />\nLaboratories.<br />\nChore igtry,<br />\nPhysics,<br />\ncleology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nItoinance,<br />\nEnglish,<br />\n<br />\nDirectors.<br />\nIra Itemsen.<br />\nJoseph S. Ames.<br />\nWilliam 13. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin I'. Mall.<br />\nWilliam If.<br />\nWiifiam H. Welch.<br />\nJohn J. A het.<br />\nJohn J. Abel.<br />\nWilliam Osier.<br />\nDirectors,<br />\nBasil L. Gildersleeve.<br />\nKirby P. Smith.<br />\nMaurice Bloomfield<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W.Bright.<br />\nJ. M. Vincent.<br />\nJ. II. Hollander.<br />\nPrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nUndergraduates Courses (loading to B. A.)<br />\nGroups.<br />\nh<br />\n8.<br />\n4.<br />\n5.<br />\n6.<br />\nI.<br />\n<br />\nClassical(the \"Old College Course.\")<br />\nMathematical-Physical,<br />\n(leading up to Engineering.)<br />\nChemical-Biological.<br />\n(leading up to Medicine.)<br />\nGeological-Biological.<br />\nLatin Mathematical.<br />\nHistorical-Political.<br />\n(loading up to Law.)<br />\nModern Languages.<br />\n<br />\nEditors.<br />\nSerial Publications.<br />\nMathematics (vol. XXIV.)<br />\nFrank Morley.<br />\nIra ltemsen.<br />\nChemistry (vol. X X VII.)<br />\nBasil L. Gildersleeve.<br />\nPhilology<br />\nI.)<br />\nJ. M. Vincent.<br />\nHistory vol. XX.)<br />\nModern Anguages(vol. XVII.) A. Hairs/14U Elliott.<br />\nWilliam K. Brooks.<br />\nBiology (vol. IV.)<br />\nPaul Haupt.<br />\nAssyriology (vol. IV.)<br />\nExperimental Medicine (vol. VI.) W.H. Welch.<br />\n<br />\n(v.,.x.„<br />\n<br />\nProgrammes of the Courses offered to graduate Audents in Philosophy and the Arts, and in the School of<br />\nMedicine, and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br />\n<br />\nIn addition to the serials above named,copies maY<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospeetus on application.<br />\nRowland's Photograph of the Normal Solar SpectrUlTh<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. J. S. Billlogs, Editor. 118 pp. 4to. 58 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete facsimile edt<br />\ntion. Edited by J. Bendel Harris. 110 pp. 4t0.<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MSS. with /Wile'<br />\ngomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographia Hopkinsiensis. Part I. Philology. rat<br />\n11-111. Chemistry, Mineralogy and Geology. Per—<br />\n'<br />\nIV-V-V I.Physies, Astronomy and Mathematics<br />\n8 vo. 80 cents per part.<br />\nE full list of publications will be sent on application.<br />\n.<br />\nCommunications in respec`. to exchanges and remittanes<br />\nsnag be sent to Jolla* tiODIIIRS Press, Baltimore, Ed.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VI.<br />\n<br />\nMAY 7, 1902.<br />\n<br />\nNo. 15.<br />\n<br />\nAN IMPORTANT PART OF COLLEGE EDUCATION.<br />\nEARS ago I heard a story of a young man, who, upon being asked about<br />\nthe fare at his boarding house, answered, \"Oh! it is good enough, what<br />\nthere is of it!\" And then, in reply to the further question, \"What,<br />\ndon't they give you enough?\" said, \"0 yes, there is plenty of it, such as it is.\"<br />\nI have been puzzling myself, from time to time ever since, as to whether the<br />\nYoung man really meant anything or was merely trying to be considerate of his<br />\nlandlady. On the whole, I have not come to any deep seated conviction as to<br />\nWhether the boarding house was or was not above reproach. Perhaps in this<br />\ncase the young man was justified in giving an evasive answer; perhaps it was<br />\nas good a boarding house as he could afford and he did not wish to confess even<br />\nto himself that it was not all that he could desire; perhaps he thought it was<br />\nnone of the other fellow's business. But it seems to me that there is altogether<br />\ntoo much of this being non committal; we are too fond of silencing ourselves<br />\nand others with \"Well, it is not so had as it might be!\" We take matters too<br />\neasily and put up with things which we all agree to be, to say the least, unsatwe<br />\nisfactory, and we do this because we are indifferent or because we are afraid<br />\nour<br />\ndly<br />\nUndoubte<br />\nways.<br />\nmay make enemies or do ourselves harm in other<br />\nneglect of duty comes principally from these two sources, indifference, and the<br />\nfear of consequences. These two sins are far more common with older than<br />\nwith younger men. With the older ones they have become habits, and bad<br />\nhabits are the most deadening things on earth; the things to be most carefully<br />\nguarded against by young men.<br />\nDuring college days is given, to those who have the great privilege of going<br />\nto college, the opportunity of cultivating, under the most favorable conditions,<br />\ntheir enthusiasm, and of overcoming their cowardice. They are not ridiculed<br />\nfor their earnestness, and do not have any serious consequences to fear if they<br />\nCome out frankly with what they believe. Let them be enthusiastic and outspoken, for, while it is quite true that they are not yet ready to guide the affairs<br />\nof the nation, they are acquiring the power and forming traits of character which<br />\n<br />\nT<br />\n<br />\ne<br />\n<br />\nwill make them so.<br />\nThe value of the experience of college life is by no means restricted to the<br />\nknowledge of facts and that far more important thing, the training of the mind,<br />\nWhich makes it strong and fits it to undertake the problems which are sure to<br />\ncome up for solution. There is another element, which we all recognize, but<br />\nWhich is so near that we often overlook it; and this is the formation of character. In after life the struggle for supremacy, even for comfortable existence,<br />\nis so keen that even the best of men are in danger of being warped away from<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\ntheir inmost convictions. It is hard for men to see that what seems to be<br />\nagainst their interests, especially when it brings up the question of comfort for<br />\ntheir wives and children, may he right and ought to receive their support.<br />\nDuring college life, questions of the same kind, but of less serious import, are<br />\nconstantly arising; but there a man is not subjected to the same temptations as<br />\nwhen the happiness and welfare of all that is nearest and dearest to him seems<br />\nto be involved. It is easier for him to do what his conscience tells him is right;<br />\nhe gets into the habit of looking upon questions without reference to .himself;<br />\nhe sees the right and learns to choose it regardless of consequences, because the<br />\nconsequences are comparatively unimportant. And when he has learned to do<br />\nthis in matters pertaining to his life in college, he naturally and easily continues<br />\nthe same method in the larger questions which confront him when he gets older<br />\nand goes out into the real world. Unfortunate, indeed, is he who neglects to<br />\ntake advantage of this part of his college education. The young man who in<br />\ncollege descends to unworthy methods or who even looks with tolerance upon<br />\nanything which is unworthy—one who will say, as I have heard it said in<br />\nregard to some \"dirty work\" in a football game—\"0, its all right so long as<br />\nthe referee doesn't see it,\" or will tolerate a trainer who teaches tricks, just<br />\nbecause he is a good trainer; or who will resort to unfair means to get in or<br />\nkeep out of some society any man, that young man is not only throwing away<br />\na most important part of his education, but is abusing the years of his college<br />\nlife to form a character which will make him distrusted, not only by his betters,<br />\nhut also by others of his own kind. My own personal experience when in college, and the experience which has come from being thrown into close contact<br />\nwith college men and boys getting ready for college, teaches me that boys, and,<br />\nlater, college men, are the most enthusiastically upright and honest men of the<br />\nworld. I do not wish to be misunderstood in this statement. There are, of<br />\ncourse, hundreds and thousands more honest men in the world who are not college men than of those who are. But what I mean is, that one of the great<br />\nadvantages of college education is that it, from its very character, teaches<br />\nuprightness, and that a man who has had this training is likely to be far better<br />\nin a truly moral way than he, individually, would have been without it.<br />\nJust as an athlete, who has had the benefit of proper training, is a far better<br />\nathlete than he would have been without it. So is the man better for the training which he gets from his teachers and from the association with his college<br />\nmates.<br />\nOne thinks first, when speaking of college education, of the actual learning<br />\nand mental training there; nowadays, of the benefit which comes from physical<br />\ntraining and the participation in honest healthful sports. But, to my mind,<br />\nthe training in strict honesty, in real manliness, is second to none of these.<br />\nLet, then, all college men do with more thought what the mass of them have<br />\nbeen doing so well, more or less unconsciously, teach themselves and their<br />\nmates the value of unbounding honesty, of uncompromising adherence to principle and the abhorrence of all which tends towards even toleration of anything<br />\nnot absolutely worthy of a man and a gentleman.<br />\n\"Disco at sompor vioturus;<br />\nViva ut eras moriturus.\"<br />\n<br />\nW. S. MARSTON.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\nA HOTEL TRAGEDY!<br />\nPLAcn—Hotel Wyandotte, South Bethleham, Pa.<br />\nTIME-11 o'clock at night.<br />\nVoice from room at end of corridor on third floor—\"Look out, don't dare<br />\ndo that!\"<br />\nSecond voice—\"Yes I will, too!\" Swash! as though a brick had been<br />\nhurled against the door.<br />\nFirst voice—\"Stop, stop! Don't point that in my face!\"<br />\nDoor opens,--report of pistol.<br />\nFirst voice—'`O, my God! I'm shot!\" Silence.<br />\nSuch were the appalling cries which struck terror to the hearts of the<br />\nguests on the third floor of Hotel Wyandotte. Doors opened a few inches on<br />\nboth sides of corridors, as though the occupants feared that they, too, would<br />\nbe murdered, and one man alone allowed his excitement to carry him into the<br />\nhall where be began a hurried explanation to the hotel proprietor who appeared<br />\nat that moment. \"Yes, yes, right there at the end of the corridor! I heard a<br />\nloud commotion, evidently a drunken brawl, and then the pistol shot followed<br />\nby a cry of '0, my God!' Murder has been done. Summon the police at<br />\nonce!\"<br />\nit<br />\n\"Let us investigate first,\" hurridly exclaimed the proprietor; \"you say<br />\ncame from the end of the hall?\"<br />\n\"Yes, yes, I saw a white arm appear from the doorway, and then heard the<br />\nreport of the pist01,—and here's where the bullet went through the floor,\" he<br />\ncried, running ahead and pointing to a torn place in the carpet.<br />\nAll this time the members of the Johns Hopkins lacrosse team, occupying<br />\nseven rooms along the corridor were stuffing blankets down their throats to<br />\nkeep from roaring at the practical joke which they knew ''Ab\" and \"Sid\" had<br />\nus try<br />\nPerpetrated upon the innocent proprietor and guests of the hotel. \"Let<br />\nof the<br />\nthat<br />\nopposite<br />\ndoor<br />\nhere,\" said the proprietor, rapping fiercely on the<br />\nin<br />\nthe<br />\n\"Why<br />\nB.\"<br />\n\"Billy<br />\nand<br />\nmiscreants which contained \"Ping Ponger P.\"<br />\nfellows,\"<br />\nbed,<br />\nto<br />\ngo<br />\n\"Yes,<br />\nh-1 don't you fellows go to bed,\" sang out Billy.<br />\nsaid P—,\"we have a hard game to-morrow.\" \"Open up, open up!\" cried the<br />\ndoor<br />\nProprietor. \"What on earth's the trouble?' inquired Billy opening the<br />\nthe<br />\ndemanded<br />\nknow,\"<br />\nWith an innocent look. \"That's what I want to<br />\nproprietor.<br />\n\"Well, inquire on the other side,\" said Billy closing the door. \"I heard<br />\nsome noise over there.\"<br />\n\"Ab,\" upon hearing the hotel proprietor bang on his door: \"Get the h-1<br />\navvay from there,—you just woke me up, and I won't stand for much more!\"<br />\nI either!\" called out ''Sid.\"<br />\nBoth positively refused admittance, and the proprietor departed, only to<br />\nreturn shortly with a police.<br />\n\"Mr. Officer,\" he said upon persuading Billy to open up again, \"I want<br />\nYou to search this room for concealed weapons.\" P—: \"If he does without a<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nwritten search warrant, I'll sue you for if\" Little \"Bernie,\" Tough and<br />\n\"Aber,\" appearing in night robes: \"That's right, boys, make him get a search<br />\nwarrant.\"<br />\n\"That's a fact,\" broke in the police, taking a cigarette from his mouth,<br />\n\"we've got to have a search warrant.\"<br />\nAt this the proprietor nearly had a fit which did not prove a benefit, and<br />\nthey departed for the warrant.<br />\nAt this interesting point \"Bill\" Schmeisser rushed in, mad all over and<br />\nmade every man go to bed. He proceeded forthwith to go down and explain<br />\nall to the proprietor and there ended part of the howling good time which<br />\npassed during the visit of the lacrosse team to South Bethlehem, Pa.<br />\nOn the following morning the following article appeared among the \"Police Notes\" of \"The Globe:\"<br />\nMYSTERIOUS PISTOL SHOT.<br />\n<br />\nExcitement was caused last night, between 10 and 11 o'clock, by the report of firearms<br />\nin the corridor of a popular hotel in South Bethlehem. The order of events was as follows:<br />\nCommotion and loud talking; a pistol report; an exclamation, \"0 my God!\" silence;<br />\nappearance of hotel proprietor and police. The fracas was traced to a stranger who is here<br />\nfor some sports today. No arrest was made. Why? There was an arrest recently for<br />\nusing firearms on Broadway.<br />\n<br />\nNeedless to say, the lacrosse men were heroes to all the girls and terrors to<br />\nall the mothers in the hotel.<br />\n<br />\nBETWEEN CLASSES.<br />\n<br />\ne<br />\n<br />\nHE '02 \"Htillaboloo\" will appear in about two weeks, if the sanguine<br />\n<br />\nhopes of the editors are realized.<br />\nare hinted at.<br />\n<br />\nUnusually interesting leading features<br />\n<br />\nGeorge A. Foster, of the Freshman class, who was called to his home in<br />\nJohnstown, Pa., on account of the death of his father, Mr. Andrew Foster, has<br />\nreturned to the University.<br />\nThe '03 \"Hullaboloo\" board has decided upon $1.25 as the price of its<br />\nbook. Subscription agents will soon be on the trail.<br />\nThe Hulla'baloo Club is making arrangements to hold another \"smoker\"<br />\nbefore the close of the year. The gathering will be held in the Trophy room.<br />\nBy next fall the Board of Governors hopes to have permanent quarters in which<br />\nthe club will begin its career as \"The Senior Club.\"<br />\nAs was announced in a recent issue of the NRWS--,T ETTER, the \"senior week\"<br />\ncustom, which was founded by last year's class will be observed this year. The<br />\nprogramme for the week preceding commencement day consists of an excursion<br />\ndown the bay, several entertainments in the city, a senior \"Prom\" and \"Ivyplanting\" at Homewood. Two committees have been appointed, the one on<br />\narrangements consists of: H. B. Stone, S. Smith, P. Bernheim, J. C. Campbell, and I. R. Pells; the other consisting of T. C. Pinkerton, P. Bernheim,<br />\nR. S. Putts, and E. B. Beasley will see to the financial part.<br />\n<br />\n\fTHE<br />\n<br />\nNEws-LETTER.<br />\n<br />\n5<br />\n<br />\nTHE COLLECTED PHYSICAL PAPERS OF DR. ROWLAND.<br />\nThe Johns Hopkins Press has now in preparation a volume containing the<br />\nPhysical Papers of the late Dr. Henry A. Rowland. The book which will contain between six and seven hundred pages will contain Professor Rowland's<br />\narticles and memoirs on physical subjects, together with all his popular writinks and addresses, numbering sixty in all, as well as the memorial address of<br />\nProfessor Mendenhall, and a portrait of Dr. Rowland. The volume will be<br />\nissued under the editorial direction of a committee appointed for that purpose,<br />\nconsisting of President Remsen, Professor Welch, and Professor Ames.<br />\n<br />\nY. M. C. A. NOTES.<br />\nN illustrated talk on the Northfield Student Conference, with special<br />\nreference to the Hopkins' Camping Party, will be given in Levering<br />\nHall, Friday next, May 9, at 5 P. M. A number of excellent stereopticon views will be shown. All are invited.<br />\n<br />\n4<br />\n<br />\nThe 1902 Handbook is now in the press and will be more attractive than<br />\never.<br />\nThe Committee on Missions is soliciting funds toward the support of a<br />\ncollege man as secretary in a foreign field. J. A. Addison is chairman Give<br />\nhim your contribution.<br />\nThe Lawrence House, in which this Association is interested, will be the<br />\nbeneficiary of a joint concert in McCoy Hall, May 12, by the musical clubs of<br />\nthe Woman's College and Johns Hopkins University. Let every Hopkins<br />\nman do his duty in supporting this worthy effort.<br />\n<br />\nTO CHARLOTTE.<br />\nIn after years, when recollections dear<br />\nBring fresh again to Charlotte's mental view<br />\nEach form and face that once she met and knew,<br />\nTho' some more clear than others may appear;<br />\nWhen of those many, scattered far and near,<br />\nShe holds as dearest just a chosen few;<br />\nAnd chance acquaintance proves friend tried and true,<br />\nWhose heart's affeetion time nor place can veer;—<br />\n(Tho' then perhaps in some far distant land,)<br />\nMay I be one of that blest chosen band<br />\nWhose image rests in Charlotte's sweet \"mind's eye.\"—<br />\nOh may her joys increase each year anew!<br />\nMay she e'er prove herself as good and true<br />\nAs now, when this is closed with fond good-bye.<br />\nJ. A. A., '03.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of Tax Joaxs<br />\n<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nMAY 7, 1902.<br />\nSubscription $1 50 per year.<br />\nEditor in Chief<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\n10 Cents a single copy.<br />\n.<br />\n<br />\nROBERT S. LA.NIER, 1903<br />\n. HARRY K. TOOTLE, 1903.<br />\nSOLOMON BLUM, 1908<br />\nGEoRoR A. FOSTER, 1904.<br />\n( REQINALD S OPIE, 1904.<br />\nW. S. BIRD, 1903.<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1908.<br />\n<br />\nAddress all articles, communications, etc., to ROBERT S. LANIER, box 374, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483,<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n11,01.1•1=11•11MMIK<br />\n<br />\nHE BASEBALL TEAM plays Georgetown at American League Park this afternoon. This game is the first appearance of the team in Baltimore, and<br />\noffers also the first chance for Hopkins students to show a little material<br />\nappreciation of the ball-tossers, who both deserve and need a large amount of<br />\nsuch appreciation. For, in spite of its discouragements, obstacles, and reverses,<br />\nthe baseball team of 1902 is a matter of pride to its members, its friends, and the<br />\nUniversity. Its policy has been from the first to make dates with the best colleges available; it has stuck to this policy; and, above all, its officers and individual members have worked consistently and faithfully to develop the<br />\nmaterial at hand. But fortune has turned her face. The Princeton game, which<br />\nwas expected to put the management on a sound financial basis, fell on a rainy<br />\nday, and caused a heavy loss to the individual players, since the Athletic Association has delayed the recognition of the team in consideration of the sins of<br />\nsome of its predecessors. At the Maryland Agricultural College game, described on another page, the boys were out for a victory. The score was: M.<br />\nA. C., 3; Hopkins, 2. Although it is the policy of the NEWS-L-ETTER to stand<br />\naloof from athletic disagreements, we cannot ignore the complaints from many<br />\nsources that the Hopkins players were not treated with the courtesy which<br />\nshould be extended by home men to a visiting team. On the other hand, the<br />\nposition of Hopkins was within the definition of true sport. The Black and<br />\nBlue doesn't \"quit,\"—even under the provocation of a sorely trying game.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n7<br />\n<br />\nThe baseball team has played, it has played in hard luck, and it is not<br />\nWhining. Such conduct is called \"sportsmanship.\" Let us hope that every<br />\nlover of college sport in the University will recognize this fact, and will present<br />\nhimself this afternoon to cheer on the J. H. U. in an uphill game. Furthermore, there is a chance to see an exhibition of playing by Georgetown, perhaps<br />\nthe strongest college team in America. Let not a man be missing when the<br />\numpire calls \"Play ball!\"<br />\nHERE are two classes of students who never write for the NEWS-LETTER<br />\n—those who are afraid their efforts will not be accepted, and those who<br />\nare afraid that they will. These latter non.contributors feel that modesty<br />\nand good sense forbid their adding to the world's already large stock of poor<br />\nwriting. Such a spirit, although commendable in some points, is tremendously<br />\nall unObstructive to the best interests of the paper. After all, the blame for<br />\nthough<br />\nworthy matter in these pages falls to the lot of the editors,—unwilling<br />\nthey be; and it is only by a plentiful supply of \"copy\" in general, and of expressions of opinion on matters of interest, that the paper can be representative.<br />\nThis last applies likewise to the first class mentioned above—those who<br />\ngrudge the chalice of losing time in productions foredoomed to oblivion and the<br />\nwaste-basket. Such lack of spirit has often been belabored by the lash of criticism in these columns, and with some effect. An athletic analogy is applicable. The worker on a \"scrub\" team has little hope of appearing as an athletic hero; but his work does not go for nothing; he derives much personal<br />\nbenefit from the exercise, and he may finally succeed in getting a place. So<br />\nwith the individual student and the paper : you may not get a place, but you<br />\nare improving in a useful practice, you will certainly strike on something<br />\nthe<br />\navailable now and then, and you will be helping towards the ideal that<br />\nHOPJOHNS<br />\nTHE<br />\nOF<br />\nTS<br />\nSTUDEN<br />\n\"THE<br />\nby<br />\nis<br />\npublished<br />\nNEWS-LETTER<br />\nKINS UNIVERSITY.\"<br />\n<br />\nt<br />\n<br />\nHE ATHLETIC TEAMS sought laurels for the Black and Blue on the 26th<br />\nof last month. Only one—the Lacrosse—brought home the laurels; but<br />\nthey all could boast of clean sport and a good struggle.<br />\nThe lacrosse team keeps adding game after game to its long list of victories,<br />\nand indications seem to point to a season unmarred by a single defeat. The<br />\nsecret of success, aside from the traditions of the game which the players seem<br />\nbound to uphold, lies in the fact that each player, varsity and scrub, looks upon<br />\nhis work as a conscientious duty. Members of other teams could well afford to<br />\ntake lessons in this respect from the lacrosse men. Every day track team<br />\nmeet<br />\ncandidates are hard at work at Electric Park getting in trim for the large<br />\non the fourteenth of May. Hopkins stands an excellent chance to win a<br />\nmajority of the points, if the men will only come out and work. The Pennsylvania games have become athletic history, and Hopkins returns home with<br />\nmen<br />\nsecond place scored to her credit, resolved to do better next season. The<br />\nran the good race that was expected of them; and but for .a slight accident in<br />\ngetting one of the team started, the race would have closed with a more exciting<br />\nfinish. The base ball team is spoken of in another column.<br />\n<br />\nt<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nZ<br />\n<br />\nHU 1903 HULLABALOO is now under way; the measure of the success of its<br />\ncareer depends upon the students of the University, and especially the<br />\nundergraduates. The Board of Editors, no doubt, have sufficient confidence in themselves to undertake the writing of the whole book without assistance, but it is doubtful whether this would serve the best ends of the University.<br />\nFor the book is intended to be a reflection—as bright as possible—of college<br />\nlife at the J. H. U., and it can he this only with the co-operation of all those<br />\nconcerned in the said college life. Descriptions of facetious clubs, class episodes<br />\nnot called for in the curriculum, individual''grinds,\" and other localisms should<br />\nat once begin pouring in to the editor-in-chief, Box 374.<br />\n<br />\nHE LEADING ARTICLE of this issue needs no commendation, and no introduction beyond the name of its author. As a gentleman who has had<br />\nexceptional opportunities for observing the influence of the secondary<br />\nschool upon the college, and the problems that confront young college students,<br />\nno one could have more appreciative listeners than Mr. W. S. Marston when<br />\nhe speaks of \"An Important Part of College Education.\"<br />\n<br />\nTHE MUSICAL CLUBS.<br />\n<br />\nO<br />\n<br />\nN Friday of last week a concert was given by the Musical<br />\nClubs at Mount<br />\nWashington Casino. The entertainment to the Hopkins men<br />\nconsisted<br />\nof a supper and dance, both enjoyable, and several speeche<br />\ns by Mr.<br />\nLawrence B. Kemp, President of the Commercial and National<br />\nBank, which<br />\nwere also enjoyed to the full.<br />\nThe next concert is one at the Madison Avenue M. E. Church,<br />\non Friday<br />\nof this week. This is to be followed on Monday, the 12th,<br />\nby a joint concert<br />\nwith the Glee and Mandolin Clubs of the Women's College<br />\nin McCoy Hall, for<br />\nthe benefit of the Lawrence House. For several seasons, the<br />\nmanagement has<br />\nbeen endeavoring to secure this attractive date, and this is<br />\nits first success.<br />\nNone but the members of the Clubs are to be allowed behind<br />\nthe platform.<br />\n<br />\nTHE PHI BETA KAPPA REUNION.<br />\nThe annual reunion of the Maryland \"Alpha\" Chapter of<br />\nthe Phi Beta<br />\nKappa Society was held last Friday evening in the Donova<br />\nn Room. In the<br />\nafternoon, Prof. S. McKeen Cattell, of the chair of Moral<br />\nPhilosophy at<br />\nColumbia University, delivered the address. The subject<br />\nwas,\"The American<br />\nUniversity.\" In it he told of the work done by this Universi<br />\nty for the cause of<br />\nhigher education. The banquet was held in the evening.<br />\nThe Rooms were<br />\ndecorated with palms and the University colors. The tables<br />\nand menu cards<br />\nwere arranged in the shape of the \"key,\" which is the emblem<br />\nof the society.<br />\nThere were no set speeches, but impromptu addresses were<br />\ndelivered by Dr.<br />\nWilliam H. Howell, President Remsen, Prof. Cattell, and<br />\nothers.<br />\n<br />\n\f9<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\n1111111111111111111111111111111t11111141111111111011111111111111ffillflill 11111111011111111111111111111111111111111111111111111111111111111111110111111INSW<br />\n<br />\ngarb<br />\n<br />\n1<br />\n1111111111111111111111111,1'1111111111111111'11111111111111 III 111111111111111P111111111111111(1111111111111111111111111111111111111;1:,7t!'..4;libILI.<br />\n.<br />\n7011\"'.11'11111111111111111111111111111111111<br />\n<br />\nDr. Remsen was among those who went from Baltimore to attend the Educational Conference held at Athens, Ga.<br />\nAmong those who took a prominent part in the Eastern Public Education<br />\nAssociations' conference, held last week in Levering Hall, under the auspices<br />\nof the Arundell Club was Dr. Joseph S. Ames. Many other prominent educators were present. Various subjects in connection with schools and education in general were discussed.<br />\nDr. George B. Shattuck has returned from his trip to Florida and the<br />\nBahama Islands. He has brought back with him many interesting specimens<br />\nof the characteristic geological formations of those regions. On May 15th, he<br />\nwill visit the Dismal Swamp with his class in geology to study the fossil formations there.<br />\nSix members of the fourth year class of the Medical School have been appointed to positions in St. Luke's Hospital, New York, the German Hospital,<br />\nBrooklyn, and the Mount Sinai Hospital.<br />\nDr. Harry L. Wilson, of the Latin Department, has now in press the<br />\nedition of Juvenal's Satires on which he has been engaged for several years<br />\nPast. The book, which will contain about four hundred pages, is in the hands<br />\nof a New York publisher and may be expected to appear early in 1903.<br />\nOne of the most important recent appointments of llopkins men is that of<br />\nDr. W. B. Huff, at present an instructor in the physical department, as associate in physics at Bryn Mawr College. Dr. Huff, whose work will begin next<br />\nfall, will have charge of the major course in physics and part of the graduate<br />\nwork. It is worthy of note that Dr. Mackenzie, the professor of physics at<br />\nBryn Mawr, is also a Hopkins man.<br />\nDr. Huff graduated at the University of Wisconsin, and later received the<br />\ndegree of master of arts at the University of Chicago. He came to the Hopkins<br />\nin 1897, and was made doctor of philosophy in 1900. Dr. Huff has always<br />\nbeen very popular with the students, and, while a graduate student was a good<br />\nathlete.<br />\n\"How do we know Homer was poor?\"<br />\n\"He wrote in the Attic.\"—Yale Record.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\nRAISING MONEY FOR HOPKINS.<br />\n<br />\nT the meeting held last Friday to try to secure money enough i to complete<br />\nthe million dollar fund asked for, the committee was able to raise about<br />\nfifty thousand dollars. This leaves still about a quarter of a million<br />\ndollars to be secured. Encouraging speeches were made, and it is thought that<br />\nthe meeting will bear more fruit than was evidenced at the time. Did Baltimoreans understand the reputation and prestige which the Johns Honkins<br />\nUniversity gives to their city, there can not he a reasonable doubt but that the<br />\namount asked for would have been subscribed long ago several times over.<br />\nAlthough the University is sadly in need of funds to carry on its work, yet the<br />\nimpression which has gained ground of late years that the work of the University has been handicapped because of its straitened financial condition, is quite<br />\nerroneous. It was stated authoritatively at the meeting that neither the faculty<br />\nnor the scope of the laboratories had been impaired in any way by the University's financial difficulties.<br />\nAmong those who subscribed to new amounts or to increases in former<br />\ndonations were: Messrs. A. W. Machen, William Painter, John R. Bland, J.<br />\nW. Middendorf, Ernst Schmeisser, Louis Dohme, G. W. Gail, Hugh Bond, Jr.,<br />\nFrederick M. Colston, Harry Williams, Reuben Foster, W, H. Matthai, John<br />\nD. Howard, Dr. A. W. Halstead and Messrs. Strauss Brothers.<br />\n<br />\n4<br />\n<br />\nALUMNI<br />\n<br />\nNDREW HOOTON BLACKISTON, formerly a student at the University, is now practicing law in the office of Dexter, Osborn and Gillespie,<br />\nNew York City.<br />\n<br />\n4<br />\n<br />\nEdward Leary, '97, for some time connected with the James O'Neil Company, has risen to be its traveling manager.<br />\nMr. Andrew D. Jones, Jr., '99, sails this week for Europe, where he will<br />\nspend the summer.<br />\nThe engagement is announced of Miss Mary Hall Putnam, of New York,<br />\nto Mr. Ira Remsen, Jr., of the class of '97.<br />\nAn engagement of interest to all Hopkins men is that of Miss Mary<br />\nColston to Dr. John B. Whitehead, Jr., Associate in Applied Electricity.<br />\n<br />\nThe informal reunion of the class of 1900 which was held at the Hopkins<br />\nClub on the night of April 25th was a most successful affair. After a short<br />\nbusiness meeting the class adjourned to the banquet room. Mr. Noel Purcell<br />\nacted as toast-master, and those who were called upon to speak responded i<br />\nin<br />\n___<br />\ntheir most happy vein.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n11<br />\n<br />\nSCHEDULE OF ATHLETIC EVENTS.<br />\nLacrosse.<br />\nMAY<br />\n<br />\n10, Swarthmore at Baltimore.<br />\n<br />\nMAY<br />\nMAY<br />\n<br />\n7, Georgetown at Baltimore.<br />\n10, Western Maryland at Westminster.<br />\n<br />\nBaseball.<br />\n<br />\nTrack and Field.<br />\nMAY 14, J..H. U. Open Scratch Games at Elsetrio Park.<br />\n<br />\nBASE BALL.<br />\nM. A. C., 3. HOPKINS, 2.<br />\nHE game of April 26th, at College Park, which went on record as a victory<br />\n<br />\nt<br />\n<br />\nfor Maryland Agricultural College by a score of 3 to 2, was unsatisfactory<br />\nto both teams. That there were so many disputed points seemed to be<br />\ngenerally regretted. In the eighth inning, M. A. C. claimed to have scored a<br />\nman from third base before the third hand was put out by McKnight at second,<br />\nwho caught Mathews' fly and then came in to make an unassisted double play<br />\nby touching Smith while off his base. The run was not allowed by the umpire.<br />\nCampbell, first up for Hopkins in the ninth, singled to right field. Hand<br />\nfollowed with a beautiful three-bagger down the line back of first base, which<br />\nwas called foul after Campbell had run home and Hand himself reached third.<br />\nThe hit was unquestionably good, except in the judgment of the umpire. Hand<br />\ntried over again and made a good single to right which put Campbell on third.<br />\nFrom there he scored the tieing run (score 2 to 2) on Ogle's neat sacrifice, but<br />\non the play Hand, who had stolen second, was put out trying to reach home.<br />\nHad Hand's original hit been allowed more runs would have resulted and the<br />\nend perhaps been changed.<br />\nM. A. C. went to bat and succeeded in getting men on second and third<br />\nwith two hands out. The base lines were crowded by a mob of yelling students.<br />\nThe coacher by third base made a \"fake\" run to the plate, which, because of<br />\nthe disorder and confusion, drew a quick throw from Whipple. The ball went<br />\na little high and rolled some ten feet back of Campbell, who recovered it<br />\nSpeedily, but meantime the true base runner had come in with the so-called<br />\nwinning run. Thus, not by an honest manly effort, but by a very questionable<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nstrategem, the game was secured by M. A. C. No such trick would have been<br />\npossible if the spectators had been kept within proper bounds.<br />\nApart from these points of dispute, the contest was clean and fast. Both<br />\npitchers did good work. Although Whipple allowed seven hits, these were well<br />\nscattered and perfect support would have brought him an easy shut-out. Hopkins' errors were not glaring and ghastly, but just little slips that marred an<br />\notherwise excellent game. The team as a whole played with great credit, and<br />\nshowed vast improvement over previous performances. Moore was again a<br />\nconspicuous factor in the game. The small score was chiefly due to the failure<br />\nto hit pitcher Brown, who had very little speed, but, what served better, admirable control. For M. A. C. Captain Nichols at shortstop played the star game.<br />\nThe men lined up as follows:<br />\nMoore, s. s., Marine, c. f., McKnight, 1. f., Campbell, c., Hand, 2b., Ogle,<br />\n3b., Wright, r. f. Constantine, lb., Whipple, p.<br />\nDuring the past week the team has been out for batting and fielding<br />\npractice, and promises to play a consistently good game against Georgetown<br />\ntoday. No prediction is made as to the score, but Hopkins is expected to do all<br />\nthat it is capable of. Great disappointment was manifested when early in the<br />\nseason rain fell upon the day set for the game with Princeton. Manager Lazenby<br />\nhas sought to make amends by bringing over the great famous nine from the<br />\ngreat Georgetown University. The contest is expected to attract interest not<br />\nonly at Hopkins, but also throughout the city. Georgetown is perhaps the<br />\nstrongest college team in America.<br />\nOn saturday next, May 10th, Hopkins will go to Westminster to play the<br />\nlast game of the season with Western Maryland College. As this is also the<br />\nday of the lacrosse game with Swarthmore, the contest in Westminster will<br />\nlikely be played in the morning so that the base ball team may return to<br />\nBaltimore by afternoon. This arrangement will also permit any rooters who<br />\ndesire it to witness both games.<br />\nThe base ball team has experienced many set-backs during the season;<br />\nfirst, in having trouble to organize, and, then, in the prevalence of wet weather<br />\nand difficulty in securing practice grounds. Through it all the team has been<br />\nself- supporting, the men giving freely their time, money, and enthusiasm. The<br />\nresults of their sacrifice will be more apparent after the game with Western<br />\nMaryland It is hoped, however, that their record and efforts will deserve<br />\nrecognition by the Athletic Board.<br />\nHOPKINS 9, LEHIGH 1.<br />\n<br />\nt<br />\n<br />\nHE victory of our lacrosse team over Lehigh in the first of the championship games, on April 26, only adds stronger proof to the fact that our<br />\nprospects are exceptionally bright for another pennant on the walls of<br />\nthe trophy room. Lehigh played at home, and the team which Hopkins<br />\ndowned was one that could not possibly have been defeated by Hobart as it was<br />\nseveral weeks ago. Hopkins found them well trained, fairly well acquainted<br />\nwith team play, and rough antagonists throughout.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\nHopkins started off at a rapid pace, and when five, then ten, minutes passed<br />\nWithout scoring, it looked as though the game would be very close. Apparently<br />\nHopkins was using this time in sizing up her opponents, for after twelve minutes' play the first goal was scored, and the six which followed before the end<br />\nof the half seemed to come with comparative ease. With a score of 7 to 0 to<br />\nour credit, Captain Schmeisser very wisely decided that it would be of no particular advantage to pile up a humiliating score in the second half. The players did not lie down by any means, but the aggressive play of the latter part of<br />\nthe first half was not continued, and our defense was given abundant opportunities to demonstrate body checking, covering back, intercepting passes, and<br />\nnumerous other \"stunts,\" all of which they executed with the utmost dexterity.<br />\nCaptain Schmeisser (lid not think of being excited over so much defense work,<br />\nand, with the able assistance of \"Chick\" and Henry Straus, managed to break<br />\nup all sorts of grand-stand plays which emanated from Captain Lattig's fertile<br />\nbrain. Blanck and 'rough managed to make themselves as ubiquitous as newspaper men, and when the ball got through the entire defense, it generally took<br />\na sudden halt before Briscoe's keen eye. He made several remarkably clever<br />\nstops, and Lehigh would not have scored at all had he not been a little overconfident of stopping the very shot which managed to get through.<br />\nWith the exception of a little work now and then, the attack stood around<br />\nduring this time and enjoyed the fun. When Lehigh scored about the middle<br />\nof the half, a slight restlessness was observed, and the result was a goal for<br />\nHopkins within a minute. This, with one which was made at the beginning<br />\nof the half, brought the score up to 9 to 1 goals.<br />\nHopkins lined up as follows: Putts, in home; B. Bernheim, out home;<br />\nSayler, first attack; Bird, second attack; P. Bernheim, third attack; Abercrombie, center; Tough, third defense; Blanck, second defense; H. Straus, first<br />\ndefense; E. Schmeisser, cover point; W. Schmeisser,(Captain) point; Briscoe,<br />\ngoal.<br />\nTwo thirty minute halves were played, and the men seemed to stand the<br />\ntime extremely well. The team appears to be very well balanced, and with<br />\nhard, snappy work next Saturday afternoon, the championship should be ours.<br />\nEvery man out to cheer the men to victory!<br />\n<br />\n03' WINS AGAIN.<br />\nHE event in which we Hopkins men were most interested in at the Boys'<br />\nLatin School—Deichman's Dual meet, held last Friday at Electric Park,<br />\nwas the invitation relay race run by the freshman and junior classes.<br />\nThis was the last chance this year that freshman had to get some of the glory<br />\nthey had lost in former contests with the upper classinen and they put forth<br />\ntheir best material in this race. Passagno and Enrich started. They ran even<br />\nuP to about 80 yards of the quarter, when Passagno pulled ahead. Tootle increased the lead and left Rosenheim fully forty yards behind at the finish.<br />\nBranham gained perceptibly on Nelson, and Hoffman started off but twenty-<br />\n<br />\nt;<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nfive yards ahead of Le Cron, who held his own and Hoffman finished with the<br />\nlead with which he started. Time, 3-43i. Tootle and Hoffman ran in the fast<br />\ntime of 531 seconds.<br />\n<br />\nAMONG THE COLLEGES.<br />\nOR the Yale-Harvard debate, May 12, the question decided upon is:<br />\n\"Resolved, That the immigration of Chinese laborers to our insular<br />\npossessions should be prohibited by law.\"<br />\n<br />\n5<br />\n<br />\nStudents at the Ohio Wesleyan University are trying to get together enough<br />\nmen to form a glee club. This seems strange in a college so active in debating<br />\nand athletics.<br />\nThe current issue of the College Mercury, College of the City of New York,<br />\ncontains an excellent full page cut of this season's lacrosse team.<br />\nOn Mr. F. Hopkinson Smith's recent visit to Ogontz, he was neariy taken<br />\noff his feet by a crowd of autograph \"fiends,' who held him captive until his<br />\nsignature had been obtained.<br />\nSt. Mary's Chimes for April is devoted to Shakespeare and his plays. It<br />\nincludes interesting articles on Shakespeare's burial place, his contructive<br />\ngenius, his extant portraits, and his range of thought—the articles are enlivened by many excellent illustrations.<br />\nDuring the spring vacation the mining engineers of the tipper two classes<br />\nat Lafayette College went on an engineering trip through the western part of<br />\nthe State.<br />\nThe Yale Dramatic Association recently gave creditable performances of<br />\nSheridan's ``The Critic\" and Townely's \"High Life Below Stairs.\"<br />\nAt Princeton, amateur dramatics are taking the place of the musical clubs.<br />\nThe glee club this year took no trip, while the Triangle Club, the dramatic organization, has numerous engagements, including dates at Pittsburgh and New<br />\nYork. About 75 applicants are trying for the chorus alone.<br />\nSeldom does it happen that six different teams representing a university<br />\nare all successful on the same day; yet on April 19th Princeton's three baseball teams defeated their three opponents, the golf scored a victory, the Checker<br />\nClub defeated Yale, and Princeton scored the greatest number of points at its<br />\nannual handicap games.<br />\nDr. George B. Germann, registrar of Columbia University, has prepared a<br />\nnumber of tables of statistics showing the relative rank of the principal American Universities, on the basis of student enrollment, based on the registration<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n15<br />\n<br />\nof February 1st. The registration is as follows: Harvard, Columbia, Michigan, Chicago, California, Minnesota, Cornell, Wisconsin, Yale, Pennsylvania,<br />\nNorthwestern, Indiana, Nebraska, Missouri, Princeton. Leland Stanford, Jr.,<br />\nJohns Hopkins. Judged from the standpoint of enrollment in the undergraduate body, Harvard leads, followed by California, Cornell, Yale, Michigan, Minnesota, Wisconsin, Columbia, Nebraska, Princeton, Leland Stanford, Jr.,<br />\nChicago, Missouri, Pennsylvania, Northwestern, and Johns Hopkins.<br />\nNo higher praise of the quality of Hopkins work could be asked than this<br />\nacknowledgement of its stand among the fourteen great institutions of the<br />\ncountry, in spite of the totally disproportionate number of its students.<br />\nSometime ago the Missouri State University issued a bulletin giving facts<br />\nand figures about its growth during the past eleven years. It is gratifying to<br />\nnote that the Johns Hopkins University is well represented in the faculty.<br />\nNaturally the greatest number are graduates of the Missouri State University;<br />\nhaving a representation of 22 in the faculty. Harvard ranks recond with 15,<br />\nBerlin third with 10, and the Johns Hopkins fourth with 8.<br />\nThe University has an income of $420,655. The fees of students are small<br />\nsince the State aims to make education practically free.<br />\n<br />\nTHE ELUSIVE BUTTON.<br />\nBY A LOSER<br />\n<br />\nWhen a man goes off to college<br />\nHe will ne'er \"fly off the hooks\"<br />\nIf he gains one bit of knowledge<br />\nWhich is not set down in books:<br />\nThat the button, I infer,<br />\nIs a true barometer.<br />\nWhen one button has departed<br />\nHe's left home about a week.<br />\nTrouble now has fairly started<br />\nAnd we do not need to speak<br />\nOf their leaving one by one,<br />\nTill the poor man is undone.<br />\nThey can keep a man quite busy<br />\nWhen he lives away from home,<br />\nFor it really makes him dizzy<br />\nIf those buttons chance to roam;<br />\nIf those buttons chance to stray<br />\nIn an artless, aimless way.<br />\n<br />\nA<br />\n<br />\n\"Nothing doing\" he is crying<br />\nWhen his sad plight worst is felt.<br />\nWhat he cannot fix by tying<br />\nHe can hold up with a belt.<br />\nOne thing caution always dins---Safety lies in safety pins.<br />\n—'03.<br />\n<br />\n\f16<br />\n<br />\nTHE NEWSLETTER.<br />\n<br />\nDIFFERENT KINDS.<br />\nWhen first she tried the new dress on<br />\nThe fit was very ill;<br />\nYet it could not compare with pa's<br />\nWhen first he saw the bill.<br />\n<br />\nTEACHER—\"Willy, what does f-o-o-d spell?<br />\nWILLY—\"I dunno.\"<br />\nTEACHER—\" Why, Willie, think. What do you live on?\"<br />\nWILLY—\"Pa.\"—The Widow.<br />\n<br />\nCONCERNING CASH ACCOUNTS.<br />\nWhen I consider how my money's spent<br />\nBre half this term of school life, grown so dear,<br />\nAnd vainly try to think just where it went,<br />\nIt almost makes me wish I wasn't here.<br />\n—07ontz Mosaic.<br />\n<br />\nThree from the Harvard Lampoon.<br />\nINSTRUCTOR—In what respect did the fourteenth and nineteenth centuries<br />\nresemble each other?<br />\nDE GREES—The nineteenth century resembled the fourteenth in that both<br />\nwere a hundred years long.<br />\nTHE DAD—I trust you haven't contracted debts at college, my son.<br />\nTHE SON—They are scarcely contracted, father.<br />\nI know I must be wrong,<br />\nBut I cannot love ping-pong;<br />\nI cannot sing<br />\nIn praise of ping;<br />\nI have no song<br />\nFor pong.<br />\n<br />\n\fThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\nIsl. E. Cor. Charles and Fayette Sts.,<br />\n<br />\n'Phone, C. & P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br />\n<br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nW.D. BOWEN, M. D., D.0.,<br />\nProst. & Mgr.<br />\n<br />\nMing Silver N::\"<br />\nIN NpicAT vARICTY.<br />\n<br />\nJEZNICINI3.<br />\n214 N. CHARLEs ST.<br />\n<br />\nsiiversmitbs.<br />\n<br />\nlienderson's<br />\n<br />\n•'`<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\n<br />\nText.<br />\n..eeks, Note Books.<br />\n'tedent's Supplies.<br />\n<br />\nMadison&HowardSts.<br />\n<br />\nWAFEH & CC).<br />\nUMBRELLAS,<br />\n<br />\n824 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nSilk and Cassimere Hats. sr HOPKINS CAPS<br />\n<br />\nCUSN G & COMPANY,<br />\n<br />\n34 W. BALTIMORE ST.<br />\nKeeps constantly on hand the Text Books used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nH. R. E1SENBRANDT SONS,<br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n<br />\nGO.<br />\n<br />\n201-203 N.CHARLES ST.<br />\nBALTIMORE, MD.<br />\n<br />\ne<br />\n<br />\nNI-4round Spices—no adulteration, all strictly pure.<br />\n<br />\nr°11 ADVERTISING SPACE IN THIS PAPER<br />\nAPPLY TO<br />\n<br />\n. 1<br />\n0<br />\n<br />\nPEARRE E. GROWL COMPANY,<br />\nPUBLISHERS.<br />\nLIGHT AND LOMBARD STREETS<br />\nBALTIMORE, MD.<br />\n<br />\nCharles T.Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br />\n<br />\nOtto H. Williams,<br />\nVice-President.<br />\nJ. F.. Marshall, Most, Cashier.<br />\n<br />\nFARMERS & MERCHANTS NAT'L. BANK,<br />\nSouth and Lombard Sts., Baltimore.<br />\nSurplus and Profits $450.000.<br />\nCapital. $650,000<br />\nAccounts of Banks, Corporations, Firms anti Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br />\n<br />\n• NORM GERMAN LLOYD S. S. CO.<br />\n<br />\nCOLLECTIONS A SPECIALTY.<br />\n<br />\nCABIN PASSAGE AT LOW RATES.<br />\nFor particulars apply to<br />\n<br />\nt3ookseliers and<br />\nStationers.<br />\n<br />\nSCHOOL, LAW M EDICA L. CLASSICAL AND M ISCELL ANEOLIS BOONS<br />\n<br />\nfor<br />\n701 to 705<br />\nMADISON AVE.<br />\nifreachltardasnd<br />\nas follows: Samples submitted of<br />\n9—no adulterants, no coloring,fine quality.<br />\nstporto Port—absolutely pure, of superior quality.<br />\nrrY—no coloring or adulterants, absolutely pure wine.<br />\nirblikey—no Fusel oil, no caramel, strictly pure<br />\nl<br />\n:<br />\nanclY<br />\nOlive ..<br />\n.<br />\ncid<br />\n7.1—all tests show pure olive oil.<br />\n‘<br />\nlitron -r v inegar—natural cider vinegar, strictly pure anti<br />\n<br />\nHATTERS, CANES, ETC.<br />\n<br />\nAgent for Lincoln & Bennett and<br />\nWalter Barnard's London Bats.<br />\n<br />\nCertificate of Analysis from<br />\nPtofs. G. W. Lehman & Son,<br />\n<br />\n11°11DAN STA BLER<br />\n<br />\nJAINKS R. PAINK.<br />\n<br />\nTHRO. WARNEtk.<br />\n<br />\n• ESTABLISHED 1879.<br />\n<br />\n$.11Ae01131 411%<br />\n<br />\nH. MeMAINS, D.0.,<br />\nSeeiy. & Treas.<br />\n<br />\nMARIA BUIE, D. 0.,<br />\nV.-Prest. & Mist. See'y.<br />\n<br />\nA.SCHUMACHER & 00.,<br />\nGeneral Agents.<br />\n<br />\nCORRESPONDENCE INVITED<br />\n<br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS.GIBRALTER.<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br />\nDIRECT.<br />\n<br />\n\fA. D. SMITH Sr. SONS,<br />\nFormerly<br />\nLEVERING & SMITH,<br />\n104 WEST LEXINGTON STREET.<br />\nREADY TO WEAR HATS for hadieoi, Misses<br />\nand Children.<br />\n<br />\nIn the Latest Desfuns.<br />\nMEN'S HATS-Derbys and Soft Felts.<br />\n<br />\nCbtcheting, Iftratiburp ant) ITClebster<br />\n<br />\nSuccessor to Cummins<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\nWest Lexington St.<br />\n<br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br />\n<br />\nilgenfrilz &utile)<br />\n20<br />\n<br />\nthe Itran3:=Zmith<br />\npiano Co.<br />\n<br />\nBaltimore<br />\n<br />\nIs<br />\n<br />\n.5 'pianos. .5<br />\n<br />\nC. & P.'Phone 2322-2.<br />\n<br />\nFactory Price°.<br />\n<br />\nSpecial Discount to Students<br />\n<br />\nTHE BLAKE CO<br />\n<br />\nHABERDASHERS,<br />\nShirts, Neckwear,<br />\nUnderwear, Hosiery,<br />\nEtc.<br />\n<br />\nON SALE THE i. H. U. PENNANTS,<br />\nand all other College Pennants<br />\n<br />\n203 W. BALTIMORE ST. & 2 S. LIBERTY ST.<br />\nBALTIMORE, MD.<br />\nMember. of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange;<br />\nChicago Board of Trade ,<br />\n<br />\nClinton P. Paine<br />\nGordon P. Paine<br />\n<br />\nCLINTON P. PAINE & CO.,<br />\nBANKERS ca BROKERS<br />\n217 E. German Street<br />\n<br />\nPrivate Wires to<br />\nNew York and Chicago<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nThe Chas. Willms Surgical Instrument Company<br />\nDIN.?. A. NELSON, OEN'L MANAOEN<br />\n<br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Aooessories.<br />\n<br />\nBaltimore, Md.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\nDrovers and Mechanics National Bank,<br />\n:<br />\n\\fr<br />\n<br />\nOF BALTIMORE, MD.<br />\n<br />\nCapital Stock, $300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General<br />\n<br />\nBanking Business.<br />\n<br />\nYOUR EYES<br />\n<br />\nARE YOUR LIVING<br />\n<br />\nMI11.1.1.1.1.11111.11.1.4711111•11.1..61.10.11IINICIIIMMI<br />\n11,01.4111•1111•1<br />\nM<br />\n<br />\nBETTER BE DEAD<br />\n<br />\nTHAN BLIND.<br />\n<br />\nSMITH'S s\"421'T&Bginidg°<br />\nOLD<br />\nBOOK<br />\nSTORE<br />\n805 N. HOWARD STREET,<br />\n3rd door from Madison.<br />\n<br />\nBOOKS<br />\n<br />\n•<br />\n<br />\nOLD AND NEW<br />\n<br />\nThe oldest Old Book Store, and the larges<br />\nstock of Old and New Books in the city.<br />\nBooks Bought, Sold and Exchanged. •. • •<br />\nStreet.<br />\nWM. V.PIPPEN,<br />\n605 N. Eutaw<br />\nrci.<br />\nA. H Rntherfoo<br />\nF. Lentz.<br />\n<br />\n1, Wm. Middendorf,<br />\nA.J. Robbins.<br />\n<br />\nJ. WM, MIDDENDORF dr, CO.<br />\n!Bankers &IBrokers.<br />\nCONTINENTAL TRUST CO. BUILDING, mil,<br />\nMembers<br />\nBaltimore,<br />\nBaltimore Stock Exchange.<br />\n<br />\nB. G. EICHELBERGER,<br />\nROOKS AND STATIONISO'<br />\nENGRAVING AND STAMPING.<br />\ne'<br />\ncrtI<br />\n144c:•. 308<br />\nsews-1'urea 454t'<br />\nY. M. C. A. BUILDING.<br />\nC.& P. and Md.'Phones.<br />\n<br />\nCAll ON<br />\n<br />\nBALTIMORB, )034<br />\n-<br />\n<br />\nJitS. it DOWNS,<br />\n229 N. Gharle,s St.,<br />\n<br />\nTHINK IT OVER.<br />\n<br />\n1,<br />\n11.•ONIO temPLi•<br />\n<br />\nSAYRE OPTICAL COMPANY,<br />\n<br />\nStationeth<br />\nFOR Class, Fraternity and College Diploinfie,<br />\n<br />\n---1----'<br />\n<br />\n221 North Charles Street. (Masonic Temple.)<br />\nkXiirMINING<br />\n<br />\nOPTIGMNS.<br />\n<br />\nTHE NEWS LETTER<br />\nis from the Press of<br />\n<br />\nFEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nLight and Lombard Streets,<br />\n<br />\nrcadll•<br />\nOur 50e J. ft. U. Bine and Black Flay Paper—now<br />\n\"<br />\nThere is very little entertainment at home without a Pia<br />\n<br />\nTIEF<br />\n<br />\nBALTIMORE<br />\n<br />\nWe carry a lull line of .turiorits' Note Books and Stationery<br />\nBoth 'Phones.<br />\n<br />\nBanquet Cards, Invitations,<br />\nPrograms, Visiting Cards, etc. . • •'..<br />\n<br />\nSre The Best.<br />\n<br />\n9 N. LlbertU<br />\n<br />\n\f", "format": "basic_html", "processed": "r<br /><br />\n).<br />\n-<br /><br />\nY,<br /><br />\nP<br /><br />\n10<br /><br />\nJOHNS HOPKINS UNIVERSITY.<br /><br />\nThe Johns Hopkins Press!<br /><br />\n11111.Tiasont. PAO.<br />\nAmerican Journal of ifisthematies.<br />\nF. MORLEY. Editor. Quarterly. 4to. Volume XXIV<br />\nin progress. $6. per volume.<br />\nII American Chemical Journal.<br />\nI. REBORN, Editor. Monthly. 8vo. Volume XXYEI<br />\nin progress. $5. per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. SvO.<br />\nVolume XXIII in progress. $3. per volume.<br />\nIV. Studies from the Biological Laboratory.<br />\nVolume V complete. $5. per volume.<br />\nV. Studies in Historical and Political Selene..<br />\nMonthly 8vo. Series XX in progress. $11. Per<br />\nvolume<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol XXI in pra'<br />\nyear.<br />\ngross. $1.<br />\nperHospital Bulletin. Monthly 00<br />\n'<br />\nVII. John Hopkins<br />\nVolume XI in progress. $1. per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume X<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriolog7 and Comparative<br />\nSemitic Philology,(Beitrage zur Assyriologie. ctc.'<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. r1.50<br />\nper volume.<br />\nXI. Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. VolUl<br />\nXVII in progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Ili-monthly. 8vo. Volunle<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nHENRY M. HUED,Editor. Quarterly. 4to., $15 pet<br />\nvolume.<br />\nxtv. Reports of Maryland Geological Survey.<br />\nWI LLIAM II. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Else\"<br />\ntrinity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\nVolumoVIIin progress. 14.60 per voluble'<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of True'<br />\ntees, reviewing the operations of the Universiti<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, eta., of the University. Pufr'<br />\nlisked at the close of the academic year.<br />\n1.<br /><br />\nTwentutizth Year.<br /><br />\nBeginning October 1st, 1901.<br /><br />\nPresident,<br />\n.<br />\n.<br />\nDean of the Medical School,<br />\nDean of the College,<br />\n.<br /><br />\n.<br /><br />\nIRA REMSEN.<br />\nWM.H. HOWELL<br />\nEDW.H.GRIFFIN.<br /><br />\nINSTRUCTION<br />\nFor Gradnate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidatk s for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.;coursos for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLibraries of Baltimore.<br />\nUniversity<br />\n•• •<br />\nPeabody Institute<br />\nPratt Library<br /><br />\n100,000 volumes.<br />\n135,000 volumes.<br />\n200.000 volumes.<br /><br />\nLaboratories.<br />\nChore igtry,<br />\nPhysics,<br />\ncleology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nItoinance,<br />\nEnglish,<br /><br />\nDirectors.<br />\nIra Itemsen.<br />\nJoseph S. Ames.<br />\nWilliam 13. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin I'. Mall.<br />\nWilliam If.<br />\nWiifiam H. Welch.<br />\nJohn J. A het.<br />\nJohn J. Abel.<br />\nWilliam Osier.<br />\nDirectors,<br />\nBasil L. Gildersleeve.<br />\nKirby P. Smith.<br />\nMaurice Bloomfield<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W.Bright.<br />\nJ. M. Vincent.<br />\nJ. II. Hollander.<br />\nPrank Morley.<br />\nJoseph S. Ames.<br /><br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br /><br />\nUndergraduates Courses (loading to B. A.)<br />\nGroups.<br />\nh<br />\n8.<br />\n4.<br />\n5.<br />\n6.<br />\nI.<br /><br />\nClassical(the \"Old College Course.\")<br />\nMathematical-Physical,<br />\n(leading up to Engineering.)<br />\nChemical-Biological.<br />\n(leading up to Medicine.)<br />\nGeological-Biological.<br />\nLatin Mathematical.<br />\nHistorical-Political.<br />\n(loading up to Law.)<br />\nModern Languages.<br /><br />\nEditors.<br />\nSerial Publications.<br />\nMathematics (vol. XXIV.)<br />\nFrank Morley.<br />\nIra ltemsen.<br />\nChemistry (vol. X X VII.)<br />\nBasil L. Gildersleeve.<br />\nPhilology<br />\nI.)<br />\nJ. M. Vincent.<br />\nHistory vol. XX.)<br />\nModern Anguages(vol. XVII.) A. Hairs/14U Elliott.<br />\nWilliam K. Brooks.<br />\nBiology (vol. IV.)<br />\nPaul Haupt.<br />\nAssyriology (vol. IV.)<br />\nExperimental Medicine (vol. VI.) W.H. Welch.<br /><br />\n(v.,.x.„<br /><br />\nProgrammes of the Courses offered to graduate Audents in Philosophy and the Arts, and in the School of<br />\nMedicine, and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br /><br />\nIn addition to the serials above named,copies maY<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospeetus on application.<br />\nRowland's Photograph of the Normal Solar SpectrUlTh<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. J. S. Billlogs, Editor. 118 pp. 4to. 58 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete facsimile edt<br />\ntion. Edited by J. Bendel Harris. 110 pp. 4t0.<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MSS. with /Wile'<br />\ngomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographia Hopkinsiensis. Part I. Philology. rat<br />\n11-111. Chemistry, Mineralogy and Geology. Per—<br />\n'<br />\nIV-V-V I.Physies, Astronomy and Mathematics<br />\n8 vo. 80 cents per part.<br />\nE full list of publications will be sent on application.<br />\n.<br />\nCommunications in respec`. to exchanges and remittanes<br />\nsnag be sent to Jolla* tiODIIIRS Press, Baltimore, Ed.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br /><br />\nMAY 7, 1902.<br /><br />\nNo. 15.<br /><br />\nAN IMPORTANT PART OF COLLEGE EDUCATION.<br />\nEARS ago I heard a story of a young man, who, upon being asked about<br />\nthe fare at his boarding house, answered, \"Oh! it is good enough, what<br />\nthere is of it!\" And then, in reply to the further question, \"What,<br />\ndon't they give you enough?\" said, \"0 yes, there is plenty of it, such as it is.\"<br />\nI have been puzzling myself, from time to time ever since, as to whether the<br />\nYoung man really meant anything or was merely trying to be considerate of his<br />\nlandlady. On the whole, I have not come to any deep seated conviction as to<br />\nWhether the boarding house was or was not above reproach. Perhaps in this<br />\ncase the young man was justified in giving an evasive answer; perhaps it was<br />\nas good a boarding house as he could afford and he did not wish to confess even<br />\nto himself that it was not all that he could desire; perhaps he thought it was<br />\nnone of the other fellow's business. But it seems to me that there is altogether<br />\ntoo much of this being non committal; we are too fond of silencing ourselves<br />\nand others with \"Well, it is not so had as it might be!\" We take matters too<br />\neasily and put up with things which we all agree to be, to say the least, unsatwe<br />\nisfactory, and we do this because we are indifferent or because we are afraid<br />\nour<br />\ndly<br />\nUndoubte<br />\nways.<br />\nmay make enemies or do ourselves harm in other<br />\nneglect of duty comes principally from these two sources, indifference, and the<br />\nfear of consequences. These two sins are far more common with older than<br />\nwith younger men. With the older ones they have become habits, and bad<br />\nhabits are the most deadening things on earth; the things to be most carefully<br />\nguarded against by young men.<br />\nDuring college days is given, to those who have the great privilege of going<br />\nto college, the opportunity of cultivating, under the most favorable conditions,<br />\ntheir enthusiasm, and of overcoming their cowardice. They are not ridiculed<br />\nfor their earnestness, and do not have any serious consequences to fear if they<br />\nCome out frankly with what they believe. Let them be enthusiastic and outspoken, for, while it is quite true that they are not yet ready to guide the affairs<br />\nof the nation, they are acquiring the power and forming traits of character which<br /><br />\nT<br /><br />\ne<br /><br />\nwill make them so.<br />\nThe value of the experience of college life is by no means restricted to the<br />\nknowledge of facts and that far more important thing, the training of the mind,<br />\nWhich makes it strong and fits it to undertake the problems which are sure to<br />\ncome up for solution. There is another element, which we all recognize, but<br />\nWhich is so near that we often overlook it; and this is the formation of character. In after life the struggle for supremacy, even for comfortable existence,<br />\nis so keen that even the best of men are in danger of being warped away from<br /><br />\n2<br /><br />\nTHE NEWS—LETTER.<br /><br />\ntheir inmost convictions. It is hard for men to see that what seems to be<br />\nagainst their interests, especially when it brings up the question of comfort for<br />\ntheir wives and children, may he right and ought to receive their support.<br />\nDuring college life, questions of the same kind, but of less serious import, are<br />\nconstantly arising; but there a man is not subjected to the same temptations as<br />\nwhen the happiness and welfare of all that is nearest and dearest to him seems<br />\nto be involved. It is easier for him to do what his conscience tells him is right;<br />\nhe gets into the habit of looking upon questions without reference to .himself;<br />\nhe sees the right and learns to choose it regardless of consequences, because the<br />\nconsequences are comparatively unimportant. And when he has learned to do<br />\nthis in matters pertaining to his life in college, he naturally and easily continues<br />\nthe same method in the larger questions which confront him when he gets older<br />\nand goes out into the real world. Unfortunate, indeed, is he who neglects to<br />\ntake advantage of this part of his college education. The young man who in<br />\ncollege descends to unworthy methods or who even looks with tolerance upon<br />\nanything which is unworthy—one who will say, as I have heard it said in<br />\nregard to some \"dirty work\" in a football game—\"0, its all right so long as<br />\nthe referee doesn't see it,\" or will tolerate a trainer who teaches tricks, just<br />\nbecause he is a good trainer; or who will resort to unfair means to get in or<br />\nkeep out of some society any man, that young man is not only throwing away<br />\na most important part of his education, but is abusing the years of his college<br />\nlife to form a character which will make him distrusted, not only by his betters,<br />\nhut also by others of his own kind. My own personal experience when in college, and the experience which has come from being thrown into close contact<br />\nwith college men and boys getting ready for college, teaches me that boys, and,<br />\nlater, college men, are the most enthusiastically upright and honest men of the<br />\nworld. I do not wish to be misunderstood in this statement. There are, of<br />\ncourse, hundreds and thousands more honest men in the world who are not college men than of those who are. But what I mean is, that one of the great<br />\nadvantages of college education is that it, from its very character, teaches<br />\nuprightness, and that a man who has had this training is likely to be far better<br />\nin a truly moral way than he, individually, would have been without it.<br />\nJust as an athlete, who has had the benefit of proper training, is a far better<br />\nathlete than he would have been without it. So is the man better for the training which he gets from his teachers and from the association with his college<br />\nmates.<br />\nOne thinks first, when speaking of college education, of the actual learning<br />\nand mental training there; nowadays, of the benefit which comes from physical<br />\ntraining and the participation in honest healthful sports. But, to my mind,<br />\nthe training in strict honesty, in real manliness, is second to none of these.<br />\nLet, then, all college men do with more thought what the mass of them have<br />\nbeen doing so well, more or less unconsciously, teach themselves and their<br />\nmates the value of unbounding honesty, of uncompromising adherence to principle and the abhorrence of all which tends towards even toleration of anything<br />\nnot absolutely worthy of a man and a gentleman.<br />\n\"Disco at sompor vioturus;<br />\nViva ut eras moriturus.\"<br /><br />\nW. S. MARSTON.<br /><br />\nTHE NEWS—LETTER.<br />\nA HOTEL TRAGEDY!<br />\nPLAcn—Hotel Wyandotte, South Bethleham, Pa.<br />\nTIME-11 o'clock at night.<br />\nVoice from room at end of corridor on third floor—\"Look out, don't dare<br />\ndo that!\"<br />\nSecond voice—\"Yes I will, too!\" Swash! as though a brick had been<br />\nhurled against the door.<br />\nFirst voice—\"Stop, stop! Don't point that in my face!\"<br />\nDoor opens,--report of pistol.<br />\nFirst voice—'`O, my God! I'm shot!\" Silence.<br />\nSuch were the appalling cries which struck terror to the hearts of the<br />\nguests on the third floor of Hotel Wyandotte. Doors opened a few inches on<br />\nboth sides of corridors, as though the occupants feared that they, too, would<br />\nbe murdered, and one man alone allowed his excitement to carry him into the<br />\nhall where be began a hurried explanation to the hotel proprietor who appeared<br />\nat that moment. \"Yes, yes, right there at the end of the corridor! I heard a<br />\nloud commotion, evidently a drunken brawl, and then the pistol shot followed<br />\nby a cry of '0, my God!' Murder has been done. Summon the police at<br />\nonce!\"<br />\nit<br />\n\"Let us investigate first,\" hurridly exclaimed the proprietor; \"you say<br />\ncame from the end of the hall?\"<br />\n\"Yes, yes, I saw a white arm appear from the doorway, and then heard the<br />\nreport of the pist01,—and here's where the bullet went through the floor,\" he<br />\ncried, running ahead and pointing to a torn place in the carpet.<br />\nAll this time the members of the Johns Hopkins lacrosse team, occupying<br />\nseven rooms along the corridor were stuffing blankets down their throats to<br />\nkeep from roaring at the practical joke which they knew ''Ab\" and \"Sid\" had<br />\nus try<br />\nPerpetrated upon the innocent proprietor and guests of the hotel. \"Let<br />\nof the<br />\nthat<br />\nopposite<br />\ndoor<br />\nhere,\" said the proprietor, rapping fiercely on the<br />\nin<br />\nthe<br />\n\"Why<br />\nB.\"<br />\n\"Billy<br />\nand<br />\nmiscreants which contained \"Ping Ponger P.\"<br />\nfellows,\"<br />\nbed,<br />\nto<br />\ngo<br />\n\"Yes,<br />\nh-1 don't you fellows go to bed,\" sang out Billy.<br />\nsaid P—,\"we have a hard game to-morrow.\" \"Open up, open up!\" cried the<br />\ndoor<br />\nProprietor. \"What on earth's the trouble?' inquired Billy opening the<br />\nthe<br />\ndemanded<br />\nknow,\"<br />\nWith an innocent look. \"That's what I want to<br />\nproprietor.<br />\n\"Well, inquire on the other side,\" said Billy closing the door. \"I heard<br />\nsome noise over there.\"<br />\n\"Ab,\" upon hearing the hotel proprietor bang on his door: \"Get the h-1<br />\navvay from there,—you just woke me up, and I won't stand for much more!\"<br />\nI either!\" called out ''Sid.\"<br />\nBoth positively refused admittance, and the proprietor departed, only to<br />\nreturn shortly with a police.<br />\n\"Mr. Officer,\" he said upon persuading Billy to open up again, \"I want<br />\nYou to search this room for concealed weapons.\" P—: \"If he does without a<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br /><br />\nwritten search warrant, I'll sue you for if\" Little \"Bernie,\" Tough and<br />\n\"Aber,\" appearing in night robes: \"That's right, boys, make him get a search<br />\nwarrant.\"<br />\n\"That's a fact,\" broke in the police, taking a cigarette from his mouth,<br />\n\"we've got to have a search warrant.\"<br />\nAt this the proprietor nearly had a fit which did not prove a benefit, and<br />\nthey departed for the warrant.<br />\nAt this interesting point \"Bill\" Schmeisser rushed in, mad all over and<br />\nmade every man go to bed. He proceeded forthwith to go down and explain<br />\nall to the proprietor and there ended part of the howling good time which<br />\npassed during the visit of the lacrosse team to South Bethlehem, Pa.<br />\nOn the following morning the following article appeared among the \"Police Notes\" of \"The Globe:\"<br />\nMYSTERIOUS PISTOL SHOT.<br /><br />\nExcitement was caused last night, between 10 and 11 o'clock, by the report of firearms<br />\nin the corridor of a popular hotel in South Bethlehem. The order of events was as follows:<br />\nCommotion and loud talking; a pistol report; an exclamation, \"0 my God!\" silence;<br />\nappearance of hotel proprietor and police. The fracas was traced to a stranger who is here<br />\nfor some sports today. No arrest was made. Why? There was an arrest recently for<br />\nusing firearms on Broadway.<br /><br />\nNeedless to say, the lacrosse men were heroes to all the girls and terrors to<br />\nall the mothers in the hotel.<br /><br />\nBETWEEN CLASSES.<br /><br />\ne<br /><br />\nHE '02 \"Htillaboloo\" will appear in about two weeks, if the sanguine<br /><br />\nhopes of the editors are realized.<br />\nare hinted at.<br /><br />\nUnusually interesting leading features<br /><br />\nGeorge A. Foster, of the Freshman class, who was called to his home in<br />\nJohnstown, Pa., on account of the death of his father, Mr. Andrew Foster, has<br />\nreturned to the University.<br />\nThe '03 \"Hullaboloo\" board has decided upon $1.25 as the price of its<br />\nbook. Subscription agents will soon be on the trail.<br />\nThe Hulla'baloo Club is making arrangements to hold another \"smoker\"<br />\nbefore the close of the year. The gathering will be held in the Trophy room.<br />\nBy next fall the Board of Governors hopes to have permanent quarters in which<br />\nthe club will begin its career as \"The Senior Club.\"<br />\nAs was announced in a recent issue of the NRWS--,T ETTER, the \"senior week\"<br />\ncustom, which was founded by last year's class will be observed this year. The<br />\nprogramme for the week preceding commencement day consists of an excursion<br />\ndown the bay, several entertainments in the city, a senior \"Prom\" and \"Ivyplanting\" at Homewood. Two committees have been appointed, the one on<br />\narrangements consists of: H. B. Stone, S. Smith, P. Bernheim, J. C. Campbell, and I. R. Pells; the other consisting of T. C. Pinkerton, P. Bernheim,<br />\nR. S. Putts, and E. B. Beasley will see to the financial part.<br /><br />\nTHE<br /><br />\nNEws-LETTER.<br /><br />\n5<br /><br />\nTHE COLLECTED PHYSICAL PAPERS OF DR. ROWLAND.<br />\nThe Johns Hopkins Press has now in preparation a volume containing the<br />\nPhysical Papers of the late Dr. Henry A. Rowland. The book which will contain between six and seven hundred pages will contain Professor Rowland's<br />\narticles and memoirs on physical subjects, together with all his popular writinks and addresses, numbering sixty in all, as well as the memorial address of<br />\nProfessor Mendenhall, and a portrait of Dr. Rowland. The volume will be<br />\nissued under the editorial direction of a committee appointed for that purpose,<br />\nconsisting of President Remsen, Professor Welch, and Professor Ames.<br /><br />\nY. M. C. A. NOTES.<br />\nN illustrated talk on the Northfield Student Conference, with special<br />\nreference to the Hopkins' Camping Party, will be given in Levering<br />\nHall, Friday next, May 9, at 5 P. M. A number of excellent stereopticon views will be shown. All are invited.<br /><br />\n4<br /><br />\nThe 1902 Handbook is now in the press and will be more attractive than<br />\never.<br />\nThe Committee on Missions is soliciting funds toward the support of a<br />\ncollege man as secretary in a foreign field. J. A. Addison is chairman Give<br />\nhim your contribution.<br />\nThe Lawrence House, in which this Association is interested, will be the<br />\nbeneficiary of a joint concert in McCoy Hall, May 12, by the musical clubs of<br />\nthe Woman's College and Johns Hopkins University. Let every Hopkins<br />\nman do his duty in supporting this worthy effort.<br /><br />\nTO CHARLOTTE.<br />\nIn after years, when recollections dear<br />\nBring fresh again to Charlotte's mental view<br />\nEach form and face that once she met and knew,<br />\nTho' some more clear than others may appear;<br />\nWhen of those many, scattered far and near,<br />\nShe holds as dearest just a chosen few;<br />\nAnd chance acquaintance proves friend tried and true,<br />\nWhose heart's affeetion time nor place can veer;—<br />\n(Tho' then perhaps in some far distant land,)<br />\nMay I be one of that blest chosen band<br />\nWhose image rests in Charlotte's sweet \"mind's eye.\"—<br />\nOh may her joys increase each year anew!<br />\nMay she e'er prove herself as good and true<br />\nAs now, when this is closed with fond good-bye.<br />\nJ. A. A., '03.<br /><br />\nTHE NEWS—LETTER.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of Tax Joaxs<br /><br />\nHOPKINS UNIVERSITY.<br /><br />\nMAY 7, 1902.<br />\nSubscription $1 50 per year.<br />\nEditor in Chief<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\n10 Cents a single copy.<br />\n.<br /><br />\nROBERT S. LA.NIER, 1903<br />\n. HARRY K. TOOTLE, 1903.<br />\nSOLOMON BLUM, 1908<br />\nGEoRoR A. FOSTER, 1904.<br />\n( REQINALD S OPIE, 1904.<br />\nW. S. BIRD, 1903.<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1908.<br /><br />\nAddress all articles, communications, etc., to ROBERT S. LANIER, box 374, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483,<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n11,01.1•1=11•11MMIK<br /><br />\nHE BASEBALL TEAM plays Georgetown at American League Park this afternoon. This game is the first appearance of the team in Baltimore, and<br />\noffers also the first chance for Hopkins students to show a little material<br />\nappreciation of the ball-tossers, who both deserve and need a large amount of<br />\nsuch appreciation. For, in spite of its discouragements, obstacles, and reverses,<br />\nthe baseball team of 1902 is a matter of pride to its members, its friends, and the<br />\nUniversity. Its policy has been from the first to make dates with the best colleges available; it has stuck to this policy; and, above all, its officers and individual members have worked consistently and faithfully to develop the<br />\nmaterial at hand. But fortune has turned her face. The Princeton game, which<br />\nwas expected to put the management on a sound financial basis, fell on a rainy<br />\nday, and caused a heavy loss to the individual players, since the Athletic Association has delayed the recognition of the team in consideration of the sins of<br />\nsome of its predecessors. At the Maryland Agricultural College game, described on another page, the boys were out for a victory. The score was: M.<br />\nA. C., 3; Hopkins, 2. Although it is the policy of the NEWS-L-ETTER to stand<br />\naloof from athletic disagreements, we cannot ignore the complaints from many<br />\nsources that the Hopkins players were not treated with the courtesy which<br />\nshould be extended by home men to a visiting team. On the other hand, the<br />\nposition of Hopkins was within the definition of true sport. The Black and<br />\nBlue doesn't \"quit,\"—even under the provocation of a sorely trying game.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n7<br /><br />\nThe baseball team has played, it has played in hard luck, and it is not<br />\nWhining. Such conduct is called \"sportsmanship.\" Let us hope that every<br />\nlover of college sport in the University will recognize this fact, and will present<br />\nhimself this afternoon to cheer on the J. H. U. in an uphill game. Furthermore, there is a chance to see an exhibition of playing by Georgetown, perhaps<br />\nthe strongest college team in America. Let not a man be missing when the<br />\numpire calls \"Play ball!\"<br />\nHERE are two classes of students who never write for the NEWS-LETTER<br />\n—those who are afraid their efforts will not be accepted, and those who<br />\nare afraid that they will. These latter non.contributors feel that modesty<br />\nand good sense forbid their adding to the world's already large stock of poor<br />\nwriting. Such a spirit, although commendable in some points, is tremendously<br />\nall unObstructive to the best interests of the paper. After all, the blame for<br />\nthough<br />\nworthy matter in these pages falls to the lot of the editors,—unwilling<br />\nthey be; and it is only by a plentiful supply of \"copy\" in general, and of expressions of opinion on matters of interest, that the paper can be representative.<br />\nThis last applies likewise to the first class mentioned above—those who<br />\ngrudge the chalice of losing time in productions foredoomed to oblivion and the<br />\nwaste-basket. Such lack of spirit has often been belabored by the lash of criticism in these columns, and with some effect. An athletic analogy is applicable. The worker on a \"scrub\" team has little hope of appearing as an athletic hero; but his work does not go for nothing; he derives much personal<br />\nbenefit from the exercise, and he may finally succeed in getting a place. So<br />\nwith the individual student and the paper : you may not get a place, but you<br />\nare improving in a useful practice, you will certainly strike on something<br />\nthe<br />\navailable now and then, and you will be helping towards the ideal that<br />\nHOPJOHNS<br />\nTHE<br />\nOF<br />\nTS<br />\nSTUDEN<br />\n\"THE<br />\nby<br />\nis<br />\npublished<br />\nNEWS-LETTER<br />\nKINS UNIVERSITY.\"<br /><br />\nt<br /><br />\nHE ATHLETIC TEAMS sought laurels for the Black and Blue on the 26th<br />\nof last month. Only one—the Lacrosse—brought home the laurels; but<br />\nthey all could boast of clean sport and a good struggle.<br />\nThe lacrosse team keeps adding game after game to its long list of victories,<br />\nand indications seem to point to a season unmarred by a single defeat. The<br />\nsecret of success, aside from the traditions of the game which the players seem<br />\nbound to uphold, lies in the fact that each player, varsity and scrub, looks upon<br />\nhis work as a conscientious duty. Members of other teams could well afford to<br />\ntake lessons in this respect from the lacrosse men. Every day track team<br />\nmeet<br />\ncandidates are hard at work at Electric Park getting in trim for the large<br />\non the fourteenth of May. Hopkins stands an excellent chance to win a<br />\nmajority of the points, if the men will only come out and work. The Pennsylvania games have become athletic history, and Hopkins returns home with<br />\nmen<br />\nsecond place scored to her credit, resolved to do better next season. The<br />\nran the good race that was expected of them; and but for .a slight accident in<br />\ngetting one of the team started, the race would have closed with a more exciting<br />\nfinish. The base ball team is spoken of in another column.<br /><br />\nt<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nZ<br /><br />\nHU 1903 HULLABALOO is now under way; the measure of the success of its<br />\ncareer depends upon the students of the University, and especially the<br />\nundergraduates. The Board of Editors, no doubt, have sufficient confidence in themselves to undertake the writing of the whole book without assistance, but it is doubtful whether this would serve the best ends of the University.<br />\nFor the book is intended to be a reflection—as bright as possible—of college<br />\nlife at the J. H. U., and it can he this only with the co-operation of all those<br />\nconcerned in the said college life. Descriptions of facetious clubs, class episodes<br />\nnot called for in the curriculum, individual''grinds,\" and other localisms should<br />\nat once begin pouring in to the editor-in-chief, Box 374.<br /><br />\nHE LEADING ARTICLE of this issue needs no commendation, and no introduction beyond the name of its author. As a gentleman who has had<br />\nexceptional opportunities for observing the influence of the secondary<br />\nschool upon the college, and the problems that confront young college students,<br />\nno one could have more appreciative listeners than Mr. W. S. Marston when<br />\nhe speaks of \"An Important Part of College Education.\"<br /><br />\nTHE MUSICAL CLUBS.<br /><br />\nO<br /><br />\nN Friday of last week a concert was given by the Musical<br />\nClubs at Mount<br />\nWashington Casino. The entertainment to the Hopkins men<br />\nconsisted<br />\nof a supper and dance, both enjoyable, and several speeche<br />\ns by Mr.<br />\nLawrence B. Kemp, President of the Commercial and National<br />\nBank, which<br />\nwere also enjoyed to the full.<br />\nThe next concert is one at the Madison Avenue M. E. Church,<br />\non Friday<br />\nof this week. This is to be followed on Monday, the 12th,<br />\nby a joint concert<br />\nwith the Glee and Mandolin Clubs of the Women's College<br />\nin McCoy Hall, for<br />\nthe benefit of the Lawrence House. For several seasons, the<br />\nmanagement has<br />\nbeen endeavoring to secure this attractive date, and this is<br />\nits first success.<br />\nNone but the members of the Clubs are to be allowed behind<br />\nthe platform.<br /><br />\nTHE PHI BETA KAPPA REUNION.<br />\nThe annual reunion of the Maryland \"Alpha\" Chapter of<br />\nthe Phi Beta<br />\nKappa Society was held last Friday evening in the Donova<br />\nn Room. In the<br />\nafternoon, Prof. S. McKeen Cattell, of the chair of Moral<br />\nPhilosophy at<br />\nColumbia University, delivered the address. The subject<br />\nwas,\"The American<br />\nUniversity.\" In it he told of the work done by this Universi<br />\nty for the cause of<br />\nhigher education. The banquet was held in the evening.<br />\nThe Rooms were<br />\ndecorated with palms and the University colors. The tables<br />\nand menu cards<br />\nwere arranged in the shape of the \"key,\" which is the emblem<br />\nof the society.<br />\nThere were no set speeches, but impromptu addresses were<br />\ndelivered by Dr.<br />\nWilliam H. Howell, President Remsen, Prof. Cattell, and<br />\nothers.<br /><br />\n9<br /><br />\nTHE NEWS—LETTER.<br /><br />\n1111111111111111111111111111111t11111141111111111011111111111111ffillflill 11111111011111111111111111111111111111111111111111111111111111111111110111111INSW<br /><br />\ngarb<br /><br />\n1<br />\n1111111111111111111111111,1'1111111111111111'11111111111111 III 111111111111111P111111111111111(1111111111111111111111111111111111111;1:,7t!'..4;libILI.<br />\n.<br />\n7011\"'.11'11111111111111111111111111111111111<br /><br />\nDr. Remsen was among those who went from Baltimore to attend the Educational Conference held at Athens, Ga.<br />\nAmong those who took a prominent part in the Eastern Public Education<br />\nAssociations' conference, held last week in Levering Hall, under the auspices<br />\nof the Arundell Club was Dr. Joseph S. Ames. Many other prominent educators were present. Various subjects in connection with schools and education in general were discussed.<br />\nDr. George B. Shattuck has returned from his trip to Florida and the<br />\nBahama Islands. He has brought back with him many interesting specimens<br />\nof the characteristic geological formations of those regions. On May 15th, he<br />\nwill visit the Dismal Swamp with his class in geology to study the fossil formations there.<br />\nSix members of the fourth year class of the Medical School have been appointed to positions in St. Luke's Hospital, New York, the German Hospital,<br />\nBrooklyn, and the Mount Sinai Hospital.<br />\nDr. Harry L. Wilson, of the Latin Department, has now in press the<br />\nedition of Juvenal's Satires on which he has been engaged for several years<br />\nPast. The book, which will contain about four hundred pages, is in the hands<br />\nof a New York publisher and may be expected to appear early in 1903.<br />\nOne of the most important recent appointments of llopkins men is that of<br />\nDr. W. B. Huff, at present an instructor in the physical department, as associate in physics at Bryn Mawr College. Dr. Huff, whose work will begin next<br />\nfall, will have charge of the major course in physics and part of the graduate<br />\nwork. It is worthy of note that Dr. Mackenzie, the professor of physics at<br />\nBryn Mawr, is also a Hopkins man.<br />\nDr. Huff graduated at the University of Wisconsin, and later received the<br />\ndegree of master of arts at the University of Chicago. He came to the Hopkins<br />\nin 1897, and was made doctor of philosophy in 1900. Dr. Huff has always<br />\nbeen very popular with the students, and, while a graduate student was a good<br />\nathlete.<br />\n\"How do we know Homer was poor?\"<br />\n\"He wrote in the Attic.\"—Yale Record.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br />\nRAISING MONEY FOR HOPKINS.<br /><br />\nT the meeting held last Friday to try to secure money enough i to complete<br />\nthe million dollar fund asked for, the committee was able to raise about<br />\nfifty thousand dollars. This leaves still about a quarter of a million<br />\ndollars to be secured. Encouraging speeches were made, and it is thought that<br />\nthe meeting will bear more fruit than was evidenced at the time. Did Baltimoreans understand the reputation and prestige which the Johns Honkins<br />\nUniversity gives to their city, there can not he a reasonable doubt but that the<br />\namount asked for would have been subscribed long ago several times over.<br />\nAlthough the University is sadly in need of funds to carry on its work, yet the<br />\nimpression which has gained ground of late years that the work of the University has been handicapped because of its straitened financial condition, is quite<br />\nerroneous. It was stated authoritatively at the meeting that neither the faculty<br />\nnor the scope of the laboratories had been impaired in any way by the University's financial difficulties.<br />\nAmong those who subscribed to new amounts or to increases in former<br />\ndonations were: Messrs. A. W. Machen, William Painter, John R. Bland, J.<br />\nW. Middendorf, Ernst Schmeisser, Louis Dohme, G. W. Gail, Hugh Bond, Jr.,<br />\nFrederick M. Colston, Harry Williams, Reuben Foster, W, H. Matthai, John<br />\nD. Howard, Dr. A. W. Halstead and Messrs. Strauss Brothers.<br /><br />\n4<br /><br />\nALUMNI<br /><br />\nNDREW HOOTON BLACKISTON, formerly a student at the University, is now practicing law in the office of Dexter, Osborn and Gillespie,<br />\nNew York City.<br /><br />\n4<br /><br />\nEdward Leary, '97, for some time connected with the James O'Neil Company, has risen to be its traveling manager.<br />\nMr. Andrew D. Jones, Jr., '99, sails this week for Europe, where he will<br />\nspend the summer.<br />\nThe engagement is announced of Miss Mary Hall Putnam, of New York,<br />\nto Mr. Ira Remsen, Jr., of the class of '97.<br />\nAn engagement of interest to all Hopkins men is that of Miss Mary<br />\nColston to Dr. John B. Whitehead, Jr., Associate in Applied Electricity.<br /><br />\nThe informal reunion of the class of 1900 which was held at the Hopkins<br />\nClub on the night of April 25th was a most successful affair. After a short<br />\nbusiness meeting the class adjourned to the banquet room. Mr. Noel Purcell<br />\nacted as toast-master, and those who were called upon to speak responded i<br />\nin<br />\n___<br />\ntheir most happy vein.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n11<br /><br />\nSCHEDULE OF ATHLETIC EVENTS.<br />\nLacrosse.<br />\nMAY<br /><br />\n10, Swarthmore at Baltimore.<br /><br />\nMAY<br />\nMAY<br /><br />\n7, Georgetown at Baltimore.<br />\n10, Western Maryland at Westminster.<br /><br />\nBaseball.<br /><br />\nTrack and Field.<br />\nMAY 14, J..H. U. Open Scratch Games at Elsetrio Park.<br /><br />\nBASE BALL.<br />\nM. A. C., 3. HOPKINS, 2.<br />\nHE game of April 26th, at College Park, which went on record as a victory<br /><br />\nt<br /><br />\nfor Maryland Agricultural College by a score of 3 to 2, was unsatisfactory<br />\nto both teams. That there were so many disputed points seemed to be<br />\ngenerally regretted. In the eighth inning, M. A. C. claimed to have scored a<br />\nman from third base before the third hand was put out by McKnight at second,<br />\nwho caught Mathews' fly and then came in to make an unassisted double play<br />\nby touching Smith while off his base. The run was not allowed by the umpire.<br />\nCampbell, first up for Hopkins in the ninth, singled to right field. Hand<br />\nfollowed with a beautiful three-bagger down the line back of first base, which<br />\nwas called foul after Campbell had run home and Hand himself reached third.<br />\nThe hit was unquestionably good, except in the judgment of the umpire. Hand<br />\ntried over again and made a good single to right which put Campbell on third.<br />\nFrom there he scored the tieing run (score 2 to 2) on Ogle's neat sacrifice, but<br />\non the play Hand, who had stolen second, was put out trying to reach home.<br />\nHad Hand's original hit been allowed more runs would have resulted and the<br />\nend perhaps been changed.<br />\nM. A. C. went to bat and succeeded in getting men on second and third<br />\nwith two hands out. The base lines were crowded by a mob of yelling students.<br />\nThe coacher by third base made a \"fake\" run to the plate, which, because of<br />\nthe disorder and confusion, drew a quick throw from Whipple. The ball went<br />\na little high and rolled some ten feet back of Campbell, who recovered it<br />\nSpeedily, but meantime the true base runner had come in with the so-called<br />\nwinning run. Thus, not by an honest manly effort, but by a very questionable<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br /><br />\nstrategem, the game was secured by M. A. C. No such trick would have been<br />\npossible if the spectators had been kept within proper bounds.<br />\nApart from these points of dispute, the contest was clean and fast. Both<br />\npitchers did good work. Although Whipple allowed seven hits, these were well<br />\nscattered and perfect support would have brought him an easy shut-out. Hopkins' errors were not glaring and ghastly, but just little slips that marred an<br />\notherwise excellent game. The team as a whole played with great credit, and<br />\nshowed vast improvement over previous performances. Moore was again a<br />\nconspicuous factor in the game. The small score was chiefly due to the failure<br />\nto hit pitcher Brown, who had very little speed, but, what served better, admirable control. For M. A. C. Captain Nichols at shortstop played the star game.<br />\nThe men lined up as follows:<br />\nMoore, s. s., Marine, c. f., McKnight, 1. f., Campbell, c., Hand, 2b., Ogle,<br />\n3b., Wright, r. f. Constantine, lb., Whipple, p.<br />\nDuring the past week the team has been out for batting and fielding<br />\npractice, and promises to play a consistently good game against Georgetown<br />\ntoday. No prediction is made as to the score, but Hopkins is expected to do all<br />\nthat it is capable of. Great disappointment was manifested when early in the<br />\nseason rain fell upon the day set for the game with Princeton. Manager Lazenby<br />\nhas sought to make amends by bringing over the great famous nine from the<br />\ngreat Georgetown University. The contest is expected to attract interest not<br />\nonly at Hopkins, but also throughout the city. Georgetown is perhaps the<br />\nstrongest college team in America.<br />\nOn saturday next, May 10th, Hopkins will go to Westminster to play the<br />\nlast game of the season with Western Maryland College. As this is also the<br />\nday of the lacrosse game with Swarthmore, the contest in Westminster will<br />\nlikely be played in the morning so that the base ball team may return to<br />\nBaltimore by afternoon. This arrangement will also permit any rooters who<br />\ndesire it to witness both games.<br />\nThe base ball team has experienced many set-backs during the season;<br />\nfirst, in having trouble to organize, and, then, in the prevalence of wet weather<br />\nand difficulty in securing practice grounds. Through it all the team has been<br />\nself- supporting, the men giving freely their time, money, and enthusiasm. The<br />\nresults of their sacrifice will be more apparent after the game with Western<br />\nMaryland It is hoped, however, that their record and efforts will deserve<br />\nrecognition by the Athletic Board.<br />\nHOPKINS 9, LEHIGH 1.<br /><br />\nt<br /><br />\nHE victory of our lacrosse team over Lehigh in the first of the championship games, on April 26, only adds stronger proof to the fact that our<br />\nprospects are exceptionally bright for another pennant on the walls of<br />\nthe trophy room. Lehigh played at home, and the team which Hopkins<br />\ndowned was one that could not possibly have been defeated by Hobart as it was<br />\nseveral weeks ago. Hopkins found them well trained, fairly well acquainted<br />\nwith team play, and rough antagonists throughout.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\nHopkins started off at a rapid pace, and when five, then ten, minutes passed<br />\nWithout scoring, it looked as though the game would be very close. Apparently<br />\nHopkins was using this time in sizing up her opponents, for after twelve minutes' play the first goal was scored, and the six which followed before the end<br />\nof the half seemed to come with comparative ease. With a score of 7 to 0 to<br />\nour credit, Captain Schmeisser very wisely decided that it would be of no particular advantage to pile up a humiliating score in the second half. The players did not lie down by any means, but the aggressive play of the latter part of<br />\nthe first half was not continued, and our defense was given abundant opportunities to demonstrate body checking, covering back, intercepting passes, and<br />\nnumerous other \"stunts,\" all of which they executed with the utmost dexterity.<br />\nCaptain Schmeisser (lid not think of being excited over so much defense work,<br />\nand, with the able assistance of \"Chick\" and Henry Straus, managed to break<br />\nup all sorts of grand-stand plays which emanated from Captain Lattig's fertile<br />\nbrain. Blanck and 'rough managed to make themselves as ubiquitous as newspaper men, and when the ball got through the entire defense, it generally took<br />\na sudden halt before Briscoe's keen eye. He made several remarkably clever<br />\nstops, and Lehigh would not have scored at all had he not been a little overconfident of stopping the very shot which managed to get through.<br />\nWith the exception of a little work now and then, the attack stood around<br />\nduring this time and enjoyed the fun. When Lehigh scored about the middle<br />\nof the half, a slight restlessness was observed, and the result was a goal for<br />\nHopkins within a minute. This, with one which was made at the beginning<br />\nof the half, brought the score up to 9 to 1 goals.<br />\nHopkins lined up as follows: Putts, in home; B. Bernheim, out home;<br />\nSayler, first attack; Bird, second attack; P. Bernheim, third attack; Abercrombie, center; Tough, third defense; Blanck, second defense; H. Straus, first<br />\ndefense; E. Schmeisser, cover point; W. Schmeisser,(Captain) point; Briscoe,<br />\ngoal.<br />\nTwo thirty minute halves were played, and the men seemed to stand the<br />\ntime extremely well. The team appears to be very well balanced, and with<br />\nhard, snappy work next Saturday afternoon, the championship should be ours.<br />\nEvery man out to cheer the men to victory!<br /><br />\n03' WINS AGAIN.<br />\nHE event in which we Hopkins men were most interested in at the Boys'<br />\nLatin School—Deichman's Dual meet, held last Friday at Electric Park,<br />\nwas the invitation relay race run by the freshman and junior classes.<br />\nThis was the last chance this year that freshman had to get some of the glory<br />\nthey had lost in former contests with the upper classinen and they put forth<br />\ntheir best material in this race. Passagno and Enrich started. They ran even<br />\nuP to about 80 yards of the quarter, when Passagno pulled ahead. Tootle increased the lead and left Rosenheim fully forty yards behind at the finish.<br />\nBranham gained perceptibly on Nelson, and Hoffman started off but twenty-<br /><br />\nt;<br /><br />\n14<br /><br />\nTHE NEWS—LETTER.<br /><br />\nfive yards ahead of Le Cron, who held his own and Hoffman finished with the<br />\nlead with which he started. Time, 3-43i. Tootle and Hoffman ran in the fast<br />\ntime of 531 seconds.<br /><br />\nAMONG THE COLLEGES.<br />\nOR the Yale-Harvard debate, May 12, the question decided upon is:<br />\n\"Resolved, That the immigration of Chinese laborers to our insular<br />\npossessions should be prohibited by law.\"<br /><br />\n5<br /><br />\nStudents at the Ohio Wesleyan University are trying to get together enough<br />\nmen to form a glee club. This seems strange in a college so active in debating<br />\nand athletics.<br />\nThe current issue of the College Mercury, College of the City of New York,<br />\ncontains an excellent full page cut of this season's lacrosse team.<br />\nOn Mr. F. Hopkinson Smith's recent visit to Ogontz, he was neariy taken<br />\noff his feet by a crowd of autograph \"fiends,' who held him captive until his<br />\nsignature had been obtained.<br />\nSt. Mary's Chimes for April is devoted to Shakespeare and his plays. It<br />\nincludes interesting articles on Shakespeare's burial place, his contructive<br />\ngenius, his extant portraits, and his range of thought—the articles are enlivened by many excellent illustrations.<br />\nDuring the spring vacation the mining engineers of the tipper two classes<br />\nat Lafayette College went on an engineering trip through the western part of<br />\nthe State.<br />\nThe Yale Dramatic Association recently gave creditable performances of<br />\nSheridan's ``The Critic\" and Townely's \"High Life Below Stairs.\"<br />\nAt Princeton, amateur dramatics are taking the place of the musical clubs.<br />\nThe glee club this year took no trip, while the Triangle Club, the dramatic organization, has numerous engagements, including dates at Pittsburgh and New<br />\nYork. About 75 applicants are trying for the chorus alone.<br />\nSeldom does it happen that six different teams representing a university<br />\nare all successful on the same day; yet on April 19th Princeton's three baseball teams defeated their three opponents, the golf scored a victory, the Checker<br />\nClub defeated Yale, and Princeton scored the greatest number of points at its<br />\nannual handicap games.<br />\nDr. George B. Germann, registrar of Columbia University, has prepared a<br />\nnumber of tables of statistics showing the relative rank of the principal American Universities, on the basis of student enrollment, based on the registration<br /><br />\nTHE NEWS—LETTER.<br /><br />\n15<br /><br />\nof February 1st. The registration is as follows: Harvard, Columbia, Michigan, Chicago, California, Minnesota, Cornell, Wisconsin, Yale, Pennsylvania,<br />\nNorthwestern, Indiana, Nebraska, Missouri, Princeton. Leland Stanford, Jr.,<br />\nJohns Hopkins. Judged from the standpoint of enrollment in the undergraduate body, Harvard leads, followed by California, Cornell, Yale, Michigan, Minnesota, Wisconsin, Columbia, Nebraska, Princeton, Leland Stanford, Jr.,<br />\nChicago, Missouri, Pennsylvania, Northwestern, and Johns Hopkins.<br />\nNo higher praise of the quality of Hopkins work could be asked than this<br />\nacknowledgement of its stand among the fourteen great institutions of the<br />\ncountry, in spite of the totally disproportionate number of its students.<br />\nSometime ago the Missouri State University issued a bulletin giving facts<br />\nand figures about its growth during the past eleven years. It is gratifying to<br />\nnote that the Johns Hopkins University is well represented in the faculty.<br />\nNaturally the greatest number are graduates of the Missouri State University;<br />\nhaving a representation of 22 in the faculty. Harvard ranks recond with 15,<br />\nBerlin third with 10, and the Johns Hopkins fourth with 8.<br />\nThe University has an income of $420,655. The fees of students are small<br />\nsince the State aims to make education practically free.<br /><br />\nTHE ELUSIVE BUTTON.<br />\nBY A LOSER<br /><br />\nWhen a man goes off to college<br />\nHe will ne'er \"fly off the hooks\"<br />\nIf he gains one bit of knowledge<br />\nWhich is not set down in books:<br />\nThat the button, I infer,<br />\nIs a true barometer.<br />\nWhen one button has departed<br />\nHe's left home about a week.<br />\nTrouble now has fairly started<br />\nAnd we do not need to speak<br />\nOf their leaving one by one,<br />\nTill the poor man is undone.<br />\nThey can keep a man quite busy<br />\nWhen he lives away from home,<br />\nFor it really makes him dizzy<br />\nIf those buttons chance to roam;<br />\nIf those buttons chance to stray<br />\nIn an artless, aimless way.<br /><br />\nA<br /><br />\n\"Nothing doing\" he is crying<br />\nWhen his sad plight worst is felt.<br />\nWhat he cannot fix by tying<br />\nHe can hold up with a belt.<br />\nOne thing caution always dins---Safety lies in safety pins.<br />\n—'03.<br /><br />\n16<br /><br />\nTHE NEWSLETTER.<br /><br />\nDIFFERENT KINDS.<br />\nWhen first she tried the new dress on<br />\nThe fit was very ill;<br />\nYet it could not compare with pa's<br />\nWhen first he saw the bill.<br /><br />\nTEACHER—\"Willy, what does f-o-o-d spell?<br />\nWILLY—\"I dunno.\"<br />\nTEACHER—\" Why, Willie, think. What do you live on?\"<br />\nWILLY—\"Pa.\"—The Widow.<br /><br />\nCONCERNING CASH ACCOUNTS.<br />\nWhen I consider how my money's spent<br />\nBre half this term of school life, grown so dear,<br />\nAnd vainly try to think just where it went,<br />\nIt almost makes me wish I wasn't here.<br />\n—07ontz Mosaic.<br /><br />\nThree from the Harvard Lampoon.<br />\nINSTRUCTOR—In what respect did the fourteenth and nineteenth centuries<br />\nresemble each other?<br />\nDE GREES—The nineteenth century resembled the fourteenth in that both<br />\nwere a hundred years long.<br />\nTHE DAD—I trust you haven't contracted debts at college, my son.<br />\nTHE SON—They are scarcely contracted, father.<br />\nI know I must be wrong,<br />\nBut I cannot love ping-pong;<br />\nI cannot sing<br />\nIn praise of ping;<br />\nI have no song<br />\nFor pong.<br /><br />\nThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\nIsl. E. Cor. Charles and Fayette Sts.,<br /><br />\n'Phone, C. &amp; P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br /><br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nW.D. BOWEN, M. D., D.0.,<br />\nProst. &amp; Mgr.<br /><br />\nMing Silver N::\"<br />\nIN NpicAT vARICTY.<br /><br />\nJEZNICINI3.<br />\n214 N. CHARLEs ST.<br /><br />\nsiiversmitbs.<br /><br />\nlienderson's<br /><br />\n•'`<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br /><br />\nText.<br />\n..eeks, Note Books.<br />\n'tedent's Supplies.<br /><br />\nMadison&amp;HowardSts.<br /><br />\nWAFEH &amp; CC).<br />\nUMBRELLAS,<br /><br />\n824 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nSilk and Cassimere Hats. sr HOPKINS CAPS<br /><br />\nCUSN G &amp; COMPANY,<br /><br />\n34 W. BALTIMORE ST.<br />\nKeeps constantly on hand the Text Books used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nH. R. E1SENBRANDT SONS,<br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br /><br />\nGO.<br /><br />\n201-203 N.CHARLES ST.<br />\nBALTIMORE, MD.<br /><br />\ne<br /><br />\nNI-4round Spices—no adulteration, all strictly pure.<br /><br />\nr°11 ADVERTISING SPACE IN THIS PAPER<br />\nAPPLY TO<br /><br />\n. 1<br />\n0<br /><br />\nPEARRE E. GROWL COMPANY,<br />\nPUBLISHERS.<br />\nLIGHT AND LOMBARD STREETS<br />\nBALTIMORE, MD.<br /><br />\nCharles T.Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br /><br />\nOtto H. Williams,<br />\nVice-President.<br />\nJ. F.. Marshall, Most, Cashier.<br /><br />\nFARMERS &amp; MERCHANTS NAT'L. BANK,<br />\nSouth and Lombard Sts., Baltimore.<br />\nSurplus and Profits $450.000.<br />\nCapital. $650,000<br />\nAccounts of Banks, Corporations, Firms anti Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br /><br />\n• NORM GERMAN LLOYD S. S. CO.<br /><br />\nCOLLECTIONS A SPECIALTY.<br /><br />\nCABIN PASSAGE AT LOW RATES.<br />\nFor particulars apply to<br /><br />\nt3ookseliers and<br />\nStationers.<br /><br />\nSCHOOL, LAW M EDICA L. CLASSICAL AND M ISCELL ANEOLIS BOONS<br /><br />\nfor<br />\n701 to 705<br />\nMADISON AVE.<br />\nifreachltardasnd<br />\nas follows: Samples submitted of<br />\n9—no adulterants, no coloring,fine quality.<br />\nstporto Port—absolutely pure, of superior quality.<br />\nrrY—no coloring or adulterants, absolutely pure wine.<br />\nirblikey—no Fusel oil, no caramel, strictly pure<br />\nl<br />\n:<br />\nanclY<br />\nOlive ..<br />\n.<br />\ncid<br />\n7.1—all tests show pure olive oil.<br />\n‘<br />\nlitron -r v inegar—natural cider vinegar, strictly pure anti<br /><br />\nHATTERS, CANES, ETC.<br /><br />\nAgent for Lincoln &amp; Bennett and<br />\nWalter Barnard's London Bats.<br /><br />\nCertificate of Analysis from<br />\nPtofs. G. W. Lehman &amp; Son,<br /><br />\n11°11DAN STA BLER<br /><br />\nJAINKS R. PAINK.<br /><br />\nTHRO. WARNEtk.<br /><br />\n• ESTABLISHED 1879.<br /><br />\n$.11Ae01131 411%<br /><br />\nH. MeMAINS, D.0.,<br />\nSeeiy. &amp; Treas.<br /><br />\nMARIA BUIE, D. 0.,<br />\nV.-Prest. &amp; Mist. See'y.<br /><br />\nA.SCHUMACHER &amp; 00.,<br />\nGeneral Agents.<br /><br />\nCORRESPONDENCE INVITED<br /><br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS.GIBRALTER.<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br />\nDIRECT.<br /><br />\nA. D. SMITH Sr. SONS,<br />\nFormerly<br />\nLEVERING &amp; SMITH,<br />\n104 WEST LEXINGTON STREET.<br />\nREADY TO WEAR HATS for hadieoi, Misses<br />\nand Children.<br /><br />\nIn the Latest Desfuns.<br />\nMEN'S HATS-Derbys and Soft Felts.<br /><br />\nCbtcheting, Iftratiburp ant) ITClebster<br /><br />\nSuccessor to Cummins<br /><br />\nARTISTIC PHOTOGRAPHY<br />\nWest Lexington St.<br /><br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br /><br />\nilgenfrilz &amp;utile)<br />\n20<br /><br />\nthe Itran3:=Zmith<br />\npiano Co.<br /><br />\nBaltimore<br /><br />\nIs<br /><br />\n.5 'pianos. .5<br /><br />\nC. &amp; P.'Phone 2322-2.<br /><br />\nFactory Price°.<br /><br />\nSpecial Discount to Students<br /><br />\nTHE BLAKE CO<br /><br />\nHABERDASHERS,<br />\nShirts, Neckwear,<br />\nUnderwear, Hosiery,<br />\nEtc.<br /><br />\nON SALE THE i. H. U. PENNANTS,<br />\nand all other College Pennants<br /><br />\n203 W. BALTIMORE ST. &amp; 2 S. LIBERTY ST.<br />\nBALTIMORE, MD.<br />\nMember. of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange;<br />\nChicago Board of Trade ,<br /><br />\nClinton P. Paine<br />\nGordon P. Paine<br /><br />\nCLINTON P. PAINE &amp; CO.,<br />\nBANKERS ca BROKERS<br />\n217 E. German Street<br /><br />\nPrivate Wires to<br />\nNew York and Chicago<br /><br />\nBALTIMORE, MD.<br /><br />\nThe Chas. Willms Surgical Instrument Company<br />\nDIN.?. A. NELSON, OEN'L MANAOEN<br /><br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Aooessories.<br /><br />\nBaltimore, Md.<br /><br />\n300 N. Howard St.,<br /><br />\nDrovers and Mechanics National Bank,<br />\n:<br />\n\\fr<br /><br />\nOF BALTIMORE, MD.<br /><br />\nCapital Stock, $300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General<br /><br />\nBanking Business.<br /><br />\nYOUR EYES<br /><br />\nARE YOUR LIVING<br /><br />\nMI11.1.1.1.1.11111.11.1.4711111•11.1..61.10.11IINICIIIMMI<br />\n11,01.4111•1111•1<br />\nM<br /><br />\nBETTER BE DEAD<br /><br />\nTHAN BLIND.<br /><br />\nSMITH'S s\"421'T&amp;Bginidg°<br />\nOLD<br />\nBOOK<br />\nSTORE<br />\n805 N. HOWARD STREET,<br />\n3rd door from Madison.<br /><br />\nBOOKS<br /><br />\n•<br /><br />\nOLD AND NEW<br /><br />\nThe oldest Old Book Store, and the larges<br />\nstock of Old and New Books in the city.<br />\nBooks Bought, Sold and Exchanged. •. • •<br />\nStreet.<br />\nWM. V.PIPPEN,<br />\n605 N. Eutaw<br />\nrci.<br />\nA. H Rntherfoo<br />\nF. Lentz.<br /><br />\n1, Wm. Middendorf,<br />\nA.J. Robbins.<br /><br />\nJ. WM, MIDDENDORF dr, CO.<br />\n!Bankers &amp;IBrokers.<br />\nCONTINENTAL TRUST CO. BUILDING, mil,<br />\nMembers<br />\nBaltimore,<br />\nBaltimore Stock Exchange.<br /><br />\nB. G. EICHELBERGER,<br />\nROOKS AND STATIONISO'<br />\nENGRAVING AND STAMPING.<br />\ne'<br />\ncrtI<br />\n144c:•. 308<br />\nsews-1'urea 454t'<br />\nY. M. C. A. BUILDING.<br />\nC.&amp; P. and Md.'Phones.<br /><br />\nCAll ON<br /><br />\nBALTIMORB, )034<br />\n-<br /><br />\nJitS. it DOWNS,<br />\n229 N. Gharle,s St.,<br /><br />\nTHINK IT OVER.<br /><br />\n1,<br />\n11.•ONIO temPLi•<br /><br />\nSAYRE OPTICAL COMPANY,<br /><br />\nStationeth<br />\nFOR Class, Fraternity and College Diploinfie,<br /><br />\n---1----'<br /><br />\n221 North Charles Street. (Masonic Temple.)<br />\nkXiirMINING<br /><br />\nOPTIGMNS.<br /><br />\nTHE NEWS LETTER<br />\nis from the Press of<br /><br />\nFEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nLight and Lombard Streets,<br /><br />\nrcadll•<br />\nOur 50e J. ft. U. Bine and Black Flay Paper—now<br />\n\"<br />\nThere is very little entertainment at home without a Pia<br /><br />\nTIEF<br /><br />\nBALTIMORE<br /><br />\nWe carry a lull line of .turiorits' Note Books and Stationery<br />\nBoth 'Phones.<br /><br />\nBanquet Cards, Invitations,<br />\nPrograms, Visiting Cards, etc. . • •'..<br /><br />\nSre The Best.<br /><br />\n9 N. LlbertU<br /><br />"}], "field_media_file": [{"target_id": 36230, "display": null, "description": null, "target_type": "file", "target_uuid": "d036f6d3-4320-4a1f-aaea-61b569cf1594", "url": "http://digital.library.jhu.edu/system/files/2022-03/12212-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12212, "target_type": "node", "target_uuid": "d720071d-bc00-4038-9d4d-08560bd6768c", "url": "/node/12212"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "658b443c-5ab9-48d7-89d6-45ad06e9d954"}]}