{"mid": [{"value": 35534}], "uuid": [{"value": "cf04b3b2-c8fd-421e-b1d3-26f49b84cfbe"}], "vid": [{"value": 35534}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:08:08+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12090-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:08:08+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:08:08+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "OCTOBER 14th, 1897.<br />\n<br />\nVol. II.<br />\n<br />\nt<br />\n<br />\nNo. 1.<br />\n<br />\nt<br />\n<br />\n0<br />\n<br />\nSG;-<br />\n<br />\ntbe<br />\n4',C11/64:Citer<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\n4)q<br />\n<br />\n•<br />\n<br />\nPublished by Students of<br />\nPress of<br />\nGuggenheimer, Well & Co. ..11<br />\n<br />\net THE JOHNS HOPKINS<br />\n+ UNIVERSITY<br />\n<br />\n.... ISSUED<br />\n<br />\nBALTIMORE<br />\n<br />\nFORTNIGHTLY<br />\n<br />\n\fINtropolitan Sayings Bank of Baltimore<br />\nInterest 3W1 per cent, per annum.<br />\nJAMES J. RYAN, Treasurer.<br />\nC. C. Sititiviat, President.<br />\n<br />\nBALTIMORE, December ist, 1896.<br />\nThe undersigned, a committee of examination appointed by the managers of the Metropolitan Savings<br />\nBank of Baltimore to investigate the affairs of said corporation, and to make and publish a report of such investigation, respectfully submit the following:<br />\nAmount of funds on hafid December 1, 1805 ...........'145,870 06<br />\n1,457,261 46<br />\nReceived from depositors during past year<br />\nReceived dividends from stocks and bonds and interest<br />\n125,605 03<br />\nfrom loans<br />\n$3,728,738 35<br />\nTotal<br />\nFrom which deduct as follows:<br />\nAmount paid depositors during past years.. $1,503,704 70<br />\n20,206 05<br />\nState and City taxes and expenses<br />\n15,132 38<br />\nPremiums on stocks and bonds<br />\n81,539,134 :xi<br />\n$2,189,604 82<br />\n<br />\nLeaving funds December 1, 1896.<br />\n<br />\nThe funds are invested in loans on real estate, stocks<br />\nand bonds, in the opinion of the undersigned abundantly<br />\nsecured, and in the purchase of stocks and bonds of the<br />\nmost substantial character. The stocks and bonds purchased are all held below their market value, and none<br />\nabove their par value.<br />\nThere were open December 1, 1895, 4,145 accounts;<br />\nthere were opened during past year 799 accounts, and<br />\nclosed during same period 746 accounts, leaving open<br />\nDecember 1, 1896, 4,198 accounts.<br />\nCUMBERLAND DUGAN,<br />\nCommittee<br />\nDANIEL DONNELLY,<br />\nV. J. BROWN,<br />\nof<br />\nDirectors.<br />\nALBERT T. MYER,<br />\nF. K. MURPHY.<br />\nIn accordance with Article IV, of the By-laws, the<br />\ninvestments have been examined by a committee NOT<br />\nCONNECTED WITH THE MANAGEMENT OF<br />\nTHE CORPORATION, who thus characterize them—<br />\nthe 16ans and investments have been safely and judiciously made, and the securities held are ample.<br />\nCommittee<br />\nE. AUSTIN JENKINS,<br />\nB. F. NEWCOMER.<br />\nof NonALLAN McSHERRY,<br />\nDirectors.<br />\n<br />\nI<br />\n<br />\n1313DK3 OLD<br />\n<br />\nNEW<br />\n<br />\nThe oldest Old-Book Store, and the largest stock<br />\nof Old and New Books in the City. Books bought<br />\nand exchanged.<br />\n<br />\nTHE UNIveRsITT 5CHOOL FR Bois<br />\nW. 8, MARSTON, A. 13 and<br />\n<br />\nC. E.,<br />\n<br />\n710 and 712 Madison Ave.<br />\n<br />\nPrincipal.<br />\n<br />\nTHIS SCHOOL, prepare/1 boy. for admindon to the John, Hopkins or any U..iveralty or<br />\nScientific School. It Ilan fitted snore thac one hundred for the Join. Hopkins alone,<br />\nand neatly for Harvard!, Yale, Princeton, the Maeartchunette Iumtltute of Technology, the<br />\nTroy Polytechnic and otiter ooliege.i and Schdnile. In October. 1894-95, two of the five<br />\necholar4hipe coven at the Joime Hoi}klos 10 0111W MIA trloubit., were awArded to lta pope. It<br />\nban a goot laboratory and a well equipped gymnaaintn, which 1. under the charge of ao01.1`e<br />\ntent Inetructor. For further Information or for rataloguam, addreee the Principal, at Nti. 1011<br />\nN. Calvert Street.<br />\n<br />\nB. G. EICHELBERGER,<br />\n1-300K8 'RIND FINE STATiONIBRY,<br />\n308 N. CHARLES ST.<br />\nY. M. C.• BUILIMNO.<br />\n<br />\nBaltimore, Mcl.<br />\n<br />\n•MISL<br />\n<br />\nThe professors and students of the Johns Hopkins<br />\nUniversity will find it to their advantage to examine<br />\nstock and make purchases from the following old<br />\nestablished house, Jordan Stabler, importer, jobber<br />\nand retailer of staple and fancy groceries, 701,703 and<br />\n705 Madison avenue,cor. Eutaw st. Telephone 817.<br />\n<br />\nCushing & Company<br />\n<br />\nHI BOOKSELLERS<br />\n1<br />\nSTATIONERS<br />\n<br />\nAND<br />\n<br />\n34 WEST BALTIMORE STREET.<br />\nSCHOOL, LAW, MEDIOAL, AND CLASSICAL AND MISOKLLANEOUS BOOKS.<br />\nKeep oonatently on hand the Text Book used lu JccliicC Hopklua<br />\nBoepltal, and The WoMitnie College of Baltimore.<br />\n<br />\nuniversity, John,HoPirin.<br />\n<br />\nSTATIONERY.—For School, Faintly, °Slice and Bank.<br />\n<br />\nJohns Hopkins University.<br />\nPROGRAMMES FOR 1897-98.<br />\nThe Johns Hopkins University Circular containing announcements<br />\n. . of the Collegiate and Graduate courses offered for the academic year beginning October 1st, 1897, may be had on application to the Registrar of the Johns Hopkins University.<br />\n<br />\nTHE JOHNS HOPKINS MEDICAL SCHOOL.<br />\nThe announcements of the Johns Hopkins Medical School may also<br />\n. . be had on application to the Registrars.<br />\n<br />\nWM. V. PIPPEN,<br />\n327 NORTH CHARLES STREET.<br />\nResort for Students and Travelers.<br />\n<br />\nCosmopolitan Rendezvous. . . .<br />\n<br />\nPABST<br />\nRESTAURANT<br />\n<br />\nAND<br />\n<br />\n{---IvAiLy RSOPT,<br />\n<br />\nBurrET<br />\n<br />\nliss.....320 W. BIDDLE ST..<br />\nPACING<br />\n<br />\nEUTAW STRE`.CT,<br />\n<br />\nFINE CONCERTS IN OUR BEAUTIFUL GARDEN ALL SUMMER.<br />\n<br />\nAt SMITH'S BOOK EXCHANCE<br />\nyou can sell Text Books for Cash<br />\nor exchange them. A full line of<br />\nStudents Requisites always on hand.<br />\nCall,<br />\n805 N. HOWARD STREET,<br />\nTHREE DOORS ABOVE MADISON.<br />\n<br />\nYou Fairly Fly on<br />\n<br />\na<br />\n<br />\n_\"Keating<br />\nrand\"<br />\n<br />\nHENDERSON'S<br />\nUNIVERSITY<br />\nBOOK STORE<br />\n<br />\nText Books .<br />\n. Note Books .<br />\nStudents' Supplies<br />\n<br />\nMadison & Howard Sts.<br />\n<br />\nIt's the Wheel of Wheels, with its<br />\nDouble Roller Chain—\"that curve\"<br />\nand many other \"365 days ahead<br />\nof all others \"--advantages.<br />\nDIAMOND WHEEL CO., xxx N. Charles St.<br />\n<br />\nBaltimore Hardware Co., Baltimore & Greene Sts.-Branch.<br />\n<br />\n\ftbe 1Rewe:o1isetter.<br />\nVol. II.<br />\n<br />\nFortnightly<br />\n<br />\nNo.<br />\n<br />\nrequisite time for class exercises in forensics<br />\nwill be secured by the generous concession of<br />\nA COLLEGE CONGRESS.<br />\ncertain hours, in the second year, by the Department of English Literature and, in the<br />\nWith the opening of the present academic<br />\nyear, the hopes of many collegiate students will third year, by the Dean from his course in<br />\nbe realized in the institution of a College Con- philosophy. The meetings of the Senate and<br />\ngress under academic auspices, with required of the House will be held separately and alternately at fortnightly intervals — one body this<br />\npreliminary training in vocal culture.<br />\nAt various times in the history of the Uni- week, the other the next from October to<br />\nversity there have been courses in elocution Easter.<br />\nThe scheme of instruction in vocal culture<br />\nand earnest attempts on the part of the students, both graduate and undergraduate, to will embody some of the best methods of leadmaintain a Debating Society. Perhaps the ing instructors in the art of expression, and<br />\nmost successful experiment was the Hopkins will avoid antiquated practices that sought<br />\nHouse of Commons. But for one reason or only to attain temporary excellence in declamanother all these forensic attempts have failed. ation. It will aim at permanent results, nameThe debating societies have died out from lack ly, the acquisition of power to use the voice on<br />\nall occasions in a proper manner, whether in<br />\nof proper support.<br />\nIt is now proposed to establish, under the speaking or reading.<br />\nIn the projected course the work of the first<br />\nsanction of the college authorities and with<br />\nsome academic co-operation, an entirely new year will prove very important, for the princiorganization called the College Congress, a ples of the art of expression will be taught by<br />\nbicameral system to encourage parliamentary concrete examples. The instructor will cordebates and other forensic and literary exer- rect manifest defects in the student's style of<br />\ncises, for the special benefit of the two upper reading and speaking. Good articulation will<br />\nclasses. There will be, however, preliminary be cultivated, and the voice developed. Awktraining in vocal culture for first-year men, wardness and diffidence will be overcome as<br />\nwho, if duly qualified, will be admitted to the far as possible. In preliminary training chief<br />\nHouse at the beginning of the second year, stress will be laid upon the art of good readand pass on to' the College Senate the third ing, in which practice select passages will be<br />\nused from English and American orations and<br />\nyear.<br />\nThus there will be a continuous, progres- essays.<br />\nHaving learned something of the elements<br />\nsive system of training under academic authority and encouragement for at least three of elocution, the second-year man will be fitted<br />\nyears. Attendance will be required, as in the to begin the practice of the art of public speakcase of other college exercises, and reports of ing. Instruction in this art will extend<br />\nwork will be duly made and recorded. An through the second and third years of the colinstructor in vocal training and forensics will lege course. The class exercises will take the<br />\nbe put in charge of the required exercises in form of a College Congress in two distinct<br />\neach class, and he will be responsible for the houses.<br />\nThe College Senate and House of Repreregularity, decorum and efficiency of the<br />\nwork. The new system will not entail any sentatives will each have its own elected presiadditional burden upon undergraduates. The dent or speaker, its own sergeant-at-arms,<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nreading a n d recording clerks, with other<br />\nminor officials. Full power will be given the<br />\nofficers to perform their respective duties and<br />\nto conduct the usual business of the Congress.<br />\nCollege authority and co-operation will be<br />\nrepresented in each chamber by the instructor<br />\nin vocal culture and forensics, with the title of<br />\n\"Censor.\" He will perform the usual functions of the office and see that the proceedings<br />\nof both houses are carried on in accordance<br />\nwith parliamentary law. He will act as a kind<br />\nof judge or umpire in the conduct of the exercises.<br />\nThere will be obvious lines of demarcation<br />\nbetween the three grades of instruction. The<br />\nfirst is preliminary and pedagogical. The<br />\nsecond and third are forensic. The training<br />\nclass will meet in Levering or in McCoy Hall.<br />\nThe upper and lower house will meet in the<br />\nDonovan Room, which is most suitable for<br />\nthe literary character and forensic dignity of<br />\nthe proposed exercises. It will be a privilege<br />\nfor men at the end of their first year to be admitted to the lower house, and for men at the<br />\nend of their second year to graduate into the<br />\nSenate. There will be a certain law of liberty<br />\nin the proceedings of the College Congress.<br />\nThe members will manage their own affairs,<br />\nand at the same time be guided by old and established rules of procedure. In both houses<br />\nthe work will cover a wider field than mere debates. While parliamentary forms are maintained, opportunity will be found for short orations and certain literary exercises. The<br />\nwhole scheme is elastic and will reproduce<br />\nsome of the best features of the old-fashioned<br />\nlyceum or debating society.<br />\nBoth the Senate and the House will meet<br />\nin separate and private sessions, but will be<br />\nopen to University authorities. In order to<br />\nencourage student interest and to test the results of this forensic experiment, it has been<br />\ndecided to hold a joint public debate of the<br />\ntwo houses at some convenient time near the<br />\nEaster recess. A first and a second prize will<br />\nbe offered to the best speakers, as determined<br />\nby a committee to be appointed by the President of the University.<br />\n<br />\nA VOICE FROM OUTSIDE.<br />\nPublic sentiment in the University is apparently awakening from her strange, slumbrous indifference to the importance of some<br />\ntraining in elocution. By elocution is not<br />\nmeant the bombastic oratory which, under the<br />\nold regime, acquired the name of \"sophomoric\" because it was wont to bear an especial profusion of leaf and flower, at that stage<br />\nof the college course. Very different is the<br />\nfaculty of adequately giving expression to<br />\nthought, the training by which the mind may<br />\nbring forth out her treasures things new and<br />\nold for the benefit of the public.<br />\nIf a man have anything to say, surely it is<br />\nimportant that he should know how to express<br />\nhis ideas in good, intelligible English; surely<br />\nit is well that, by a clear voice, by correct intonation, by appropriate gestures, by every<br />\nlegitimate means, he should be trained to<br />\ncommunicate his thought in the most forcible<br />\nand effective way possible. A lecturer may<br />\nspeak on a subject of profound interest; he<br />\nmay be the greatest living authority on that<br />\nsubject ; yet little profit to have heard him, if<br />\nhis language be involved, his utterance indistinct, and no connecting chord thrill with the<br />\nmessage from his mind to his audience.<br />\nThe apathy which has hitherto enveloped<br />\nthis important subject at last begins to break<br />\naway. The excellent article which appeared<br />\nin THE NEWS-LETTER last June, from a distinguished professor, advises the organization<br />\nof a senate, which may afford the much-needed practice in public speaking.<br />\nThis is not the first evidence that the students of the Johns Hopkins University have<br />\nthemselves felt the need of some opportunity<br />\nfor training in the great art of giving vocal<br />\nexpression to thought. Some years ago a<br />\nsenate was successfully established, and several efforts have been made to start debating<br />\nsocieties. Those who were in the University<br />\nabout three years ago may remember the<br />\nTaney Debating Society, which some<br />\nthoughtful students inaugurated, but which<br />\nsoon, unhappily, perished of inanition.<br />\n<br />\n\f'<br />\n<br />\nTHE NEWS-LETTER.<br />\nThe failure of this and similar efforts has<br />\nbeen due, not altogether to lack of interest<br />\namong the students, but to the absence of cooperation by the faculty. This is suggested in<br />\nthe able article above referred to, and should<br />\nnot be overlooked.<br />\nBy judicious selection of leaders, wise<br />\nformation of plans and the kind and efficient<br />\nprotection and guidance of the powers that be,<br />\nlet us hope that before the class of '98 shall<br />\nhave received all the \"honors, rights and privileges\" to the degree of A. B. appertaining<br />\na senate may have been established on a firm<br />\nbasis. This senate the Twentieth Century may<br />\nmature into a time-honored institution that<br />\nshall furnish to the world not only \"full men,\"<br />\nbut \"ready men ;\" not only men who know<br />\nsomething, but men who have learned how to<br />\nexpress clearly and forcibly what they wish<br />\nothers to know.<br />\nA Friend of the University.<br />\nPROFESSOR WARREN IN ROME.<br />\nProfessor Minton Warren has resumed his<br />\npost as head of the Latin Department. He<br />\nwas in Rome from October r, 1896, to July r,<br />\n1897, as Director of the American School of<br />\nClassical Studies. This institution, founded in<br />\n1895, corresponds in its scope to the American<br />\nSchool of Classical Studies at Athens. The instruction at the school might be called an advanced laboratory course for classical students.<br />\nItaly is the huge laboratory, the working desks<br />\nbeing chiefly at Rome and at Pompeii. Etruscan and Roman art and architecture, inscriptions on temples, on monuments and coins,<br />\nearly Christian works of art hidden in catacombs—all these and many other things are<br />\nstudied at their very birthplace. Last year<br />\ntwelve students, all graduates, were in attendance. Two of them—Mr. Gordon Laing and<br />\nMr. Charles Hoeing — were Johns Hopkins<br />\nmen. Mr. Laing is now teaching Latin at<br />\nBryn-Mawr College. Professor Marquand, of<br />\nPrinceton, and several professors resident at<br />\nRome, were associated in the work with Professor Warren.<br />\n<br />\n3<br />\n<br />\nProfessor Warren had many interesting experiences during his stay abroad. He witnessed the wedding of the Prince of Naples<br />\nand Princess Helena ; saw His Holiness, the<br />\nPope, at the consistory, in which Satolli was<br />\nmade Cardinal, and he was present at the opening of the Italian Parliament. After July<br />\nProfessor Warren spent some time in studying<br />\nmanuscripts at various Italian libraries. He<br />\npassed through Switzerland, Paris and London, and arrived at Boston on September 21.<br />\nTHE CENTURY'S PRIZES FOR COLLEGE GRADUATES.<br />\nThe Century Magazine has offered to give,<br />\nduring four successive years, three prizes of<br />\n$250, open to persons who receive the degree<br />\nof Bachelor of Arts, in any college or university in the United States during the commencement seasons of 1897, 1898, 1899 and<br />\n'goo, for :<br />\n1. The best metrical writing.<br />\n2. The best essay in the field of biography,<br />\nhistory or literary criticism.<br />\n3. The best story, to be presented on or before June r of the year succeeding graduation.<br />\nFurther particulars are given in The Century for September.<br />\nTHE MEDICAL SCHOOL.<br />\nMr. Baer, a former graduate of the University, will make a report shortly before the medical faculty of the John Hopkins Hospital upon<br />\n\"The Ainhum Spontaneous Amputation of<br />\nthe Toe.\" The report gains interest from the<br />\nfact that it is only the fourth or fifth report of<br />\nphenomenon which has been made.<br />\nThe entering class at the Medical School<br />\nthis year is the largest on record. There were<br />\nabout io applicants, of whom 68, including<br />\nii women, have been admitted. Almost 25<br />\nper cent. of the class are graduates of Hopkins and men who have taken special courses<br />\nat the University in view of their medical<br />\ncourse. Yale also is represented by a very<br />\nlarge number of graduates.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n4<br />\n<br />\n1111111111111111=1=11111111.1.1.<br />\n<br />\ngtn<br />\n<br />\nVientorican.<br />\n<br />\nJAMES ELLIS HUMPHREY.<br />\nFRANKLIN STORY CONANT.<br />\nOn Sunday, October 3, at 3 P. M., a meeting to commemorate the deaths of Dr. Humphrey and Dr. Conant was held in Donovan<br />\nRoom. A great part of the faculty, especially<br />\nthe members from the Biological Department,<br />\nmany friends of the deceased, and students,<br />\nwere present. Three resolutions were passed:<br />\n\"1. Copies of the following minutes are to<br />\nbe sent to the trustees of Amherst College, to<br />\nthe trustees of the Johns Hopkins University,<br />\nto the Johns Hopkins University Circular, and<br />\nto the family of Professor Humphrey.<br />\n\"The faculty and students of the Johns<br />\nHopkins University have assembled with other<br />\nfriends to express their sorrow at the great loss<br />\nthey have sustained in the untimely death of<br />\ntheir colleague, teacher and friend, James Ellis<br />\nHumphrey, who died at his post in the courageous discharge of duties of unusual and difficult nature, a leader in the fore ranks of the<br />\narmy of natural sciences. They wish to make<br />\nan expression of the high esteem in which he<br />\nwas held as worker and teacher, and of the<br />\ncherished memory of a genial and valued<br />\nfriend.<br />\n\"In the course of his three years' service at<br />\nthis University Dr. Humphrey had succeeded<br />\nin steadily impressing his usefulness upon the<br />\ndepartment with which he was connected until<br />\nhe seemed to have become an almost essential<br />\nfactor in its successful conduct. More and<br />\nmore frequently both pupils and colleagues<br />\nlearned to draw on his well-ordered store of<br />\nknowledge and to trust his judgment, which<br />\nthey were ever proving to be sound and accurate. His endless patience and care as a<br />\nteacher gave assurance and encouragement to<br />\nhis pupils, who sought his advice confident of<br />\nready and willing response to their appeals. To<br />\nhim nothing was a trouble which promised to<br />\nbe helpful to members of his class. If pains-<br />\n<br />\ntaking be really akin to genius, he fell but little<br />\nshort of that distinction. Perhaps no one ever<br />\nexemplified better than he the beauty of orderliness. Nothing with which he had to do was<br />\nout of place or lost, whether of things tangible<br />\nor facts in memory. Books, papers, instruments, and his good store of knowledge<br />\nseemed ever to be at places of greatest convenience for his command. The promptness<br />\nwith which he would turn to a special pamphlet<br />\ncase and produce at request some long lost<br />\nmonograph would cause upon our faces a smile<br />\nof admiration—even though mixed with envy.<br />\nStill, it must be added, this exceeding orderliness was in no wise linked with a petty, narrow nature, which this quality often bespeaks.<br />\nFor Humphrey was large and liberal in all his<br />\nthoughts and dealings. In matters doctrinal<br />\nhe accepted that which was most evidently<br />\ntrue; in politics he had broken all hampering<br />\nties, and aimed to be governed by the principles which promised the greatest good. His<br />\nindustry had become a byword among his fellows. To be called as hard a worker as Humphrey was to enjoy enviable repute as a student. To overwork, indeed, and a consequent<br />\nlowered state of health, may probably be attributed the lamentable catastrophe of his<br />\ndeath. In spite of warnings, and against the<br />\nwishes of one whose pleasure and comfort were<br />\nalways of supremest moment to him, he went,<br />\nbecause the duty of going seemed too plain to<br />\nresist.<br />\n\"And then he fell—a loss to the University<br />\nwhich the memory of his character and example lightens but little ; a loss to his more intimate friends, which nothing but the hand of<br />\nunfeeling time will remove ; a bereavement to<br />\nthose yet nearer to him, upon whom we must<br />\nnot intrude.<br />\n\"2. Copies of the following resolution are<br />\nto be sent to the University Circular, to the<br />\nfaculty of Williams College and to the mother<br />\nof Dr. Conant:<br />\n\"We, the friends and companions and instructors of Franklin Story Conant, having<br />\nassembled to express the sorrow with which we<br />\nhave heard the sad news of his death, wish to<br />\nrecord our love and esteem for the generous,<br />\n<br />\n\flifirlfflefFreCrlimmiers.=<br />\n<br />\n-741-<br />\n<br />\nTHE NEWS-LETTER.<br />\nwarm-hearted friend, who in all the relations of<br />\nlife proved himself worthy of the utmost honor<br />\nand confidence.<br />\n\"We, who have worked at his side in our<br />\nlaboratories, recall his steadfast earnestness in<br />\nthe pursuit of knowledge, and the encouragement we have found in his bright example.<br />\nWe, who have been his instructors, remember<br />\nhim as one who bettered our instruction, and<br />\nenriched all that he undertook by sound and<br />\nvaluable observations and reflections.<br />\n\"We mourn the untimely loss of one who<br />\nhad shown such rich promise of a life full of<br />\nhonor and distinction and usefulness, but we<br />\nremember with pride that his end was worthy<br />\nof one who had given his life to the fearless<br />\npursuit of truth, to noble devotion to his fellowman and to generous self-sacrifice.<br />\n\"Let us prize the lesson of the noble life<br />\nand death of Franklin Story Conant.\"<br />\n3. It was resolved, that the following associations be requested each to elect a member<br />\nfor a committee of seven to devise and execute,<br />\nas soon as possible, some fitting, permanent<br />\nmemorial to Professor Humphrey and Dr.<br />\nConant:<br />\n1. The Young Men's Christian Association<br />\nof the Johns Hopkins University.<br />\n2. The Graduate Students' Association of the<br />\nJohns Hopkins University.<br />\n3. The Naturalist's Field Club of Baltimore.<br />\n4. The Botanical Club of the Maryland Academy of Arts and Sciences.<br />\n5. The intimate friends of Professor Humphrey who are now resident in Baltimore.<br />\n6. The members of the Jamaica Marine Laboratory.<br />\n7. The members of the Biological Laboratory of the Johns Hopkins University.<br />\n<br />\nRoland Watts, formerly in the Department<br />\nof Physics, has been appointed professor of<br />\nphysics at Western Maryland College, and<br />\nJ. F. Merrill has been appointed professor of<br />\nphysics in the University of Utah.<br />\n<br />\n5<br />\n<br />\nTHE SClENTlrIC DEPARTMENTS.<br />\nSeveral improvements were made in the<br />\nvarious scientific departments during the summer. The most noticeable is the establishment<br />\nof a new mechanical workshop in the basement of the physical laboratory. Various machine tools are at hand and a skilled machinist<br />\nis in charge. A lathe is soon to be installed.<br />\nIt will no longer be necessary to send away to<br />\nhave new apparatus made and old repaired,<br />\nbut all such work will be done in this new<br />\nshop. The advanced students are to receive<br />\ninstruction in instrument-making, etc., under<br />\nthe skilled mechanic.<br />\nThe storage-battery-room has been rearranged. More cells and a large new switchboard have been put in. The whole building<br />\nis being renovated.<br />\nThe current from these cells is some times<br />\nused in the chemical laboratory, as well as to<br />\nrun the various pieces of machinery put in<br />\nabout a year ago in the department of Dr.<br />\nMorse.<br />\nA manual of laboratory practice, by Dr.<br />\nAmes, covering the work of the minor course,<br />\nis now going through the press.<br />\nThe Naturalist's Field Club held a regular meeting on Tuesday, October 12, at 5<br />\nP. M., in the lecture-room of the biological<br />\nlaboratory. Anybody interested in natural<br />\nhistory can become a member of this club by<br />\napplying to the secretary, Mr. Waters. There<br />\nare no dues.<br />\nThe geological students took their first trip<br />\nof the season last Saturday. They visited the<br />\nregion of sedimentary formations along the<br />\nSevern River, especially at Round Bay and<br />\nthe bluffs opposite Annapolis.<br />\nMr. E. Emmet Reid, fellow in chemistry,<br />\nwas at work all summer in the basement of the<br />\nchemical laboratory making preparations to<br />\nbe used in his thesis work of the present term.<br />\n<br />\n\fTHE NEWS -LETTER.<br />\n<br />\n6<br />\n<br />\nzbe pews/Amer.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents Of THE JOHNS HOPKINS UNIVERSITY.<br />\nOCTOBER 14, 1897.<br />\n<br />\nSubscription $1.5o per year. 15 cents a single copy.<br />\n98.<br />\nEDGEWORTH SMITH,'<br />\nEditor in Chief,<br />\nAssistant Editor in Chief, - - ALBERT C. DIFFENBACH,'98.<br />\n.KIRBY F. SMITH.<br />\nConsulting Editors, - Prof<br />\nGeo. C. MORRISON, 290.<br />\nBOARD OF EDITORS.<br />\nW.A. MONTGOMERY, /. Graduates.<br />\n<br />\nC. N. EDMUNDS,<br />\nW.T. LONGCOPE,<br />\n'<br />\n98.<br />\nY. A. RIINOUF,<br />\nR. D. MILLER,<br />\n'<br />\n98.<br />\nJ. C. #RENCH,'99.<br />\n<br />\nMedical School.<br />\n<br />\n99.<br />\nBusiness Manager, - - R. H. Gamins,'<br />\nAddress all articles, communications, etc. to EDGEWORTH<br />\nSMITH, box 707, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications must be sent<br />\nto R. H. GRIMES, box 23N, J. H. U.;or box 398, Medical School<br />\nofJohns Hopkins Hospital,<br />\nTHE NEWS-LETTER starts upon its second<br />\nyear with the earnest hope that it may adequately fulfill its object the object, namely,<br />\nof recording the doings and the opinions of<br />\nthe students, graduate and undergraduate, of<br />\nthe University. This it proposes to do to the<br />\nbest of its ability ; and with a considerably<br />\nlarger staff of editors and more experience in<br />\npractical journalistic work, it may hope to<br />\navoid some of the errors, and supply some of<br />\nthe deficiencies apparent in the four numbers<br />\nissued last spring.<br />\nThe success of the paper, however, is<br />\nmainly dependent upon the hearty co-operation of the students themselves. They must<br />\nread the paper and write for it ; and incidently subscribe to it, too. For the lucre thereby<br />\nobtained is a very useful grease—\"filthy\"<br />\nthough it be—for lubricating the machinery of<br />\npublication.<br />\nIt is also to be hoped that the Medical<br />\nSchool may be induced to take some interest<br />\nin T H E NEWS-LETTER. However hardworked they may be, the reason they generally adduce for their non-interest in University matters, they can and should at least keep<br />\nthemselves informed, through THE NEWSLETTER, of the progress of events in their own<br />\nand the other departments of the University.<br />\n<br />\nThe past summer, which has been a season<br />\nof rest and recreation for most of our students,<br />\nand ingtructors has had a fatal ending for two<br />\nof them, whose scientific zeal kept them at<br />\ntheir work. Last June a party of students of<br />\nthis University, under the direction of Professor Humphrey of the Biological Department, left for Jamaica to carry on their work<br />\nin the Marine Laboratory there. Shortly before the return of the expedition Professor<br />\nHumphrey was smitten by the fever and died<br />\nwithin a few days. Mr. Clark, a member of<br />\nthe party, was also attacked, but recovered.<br />\nOn the way home Franklin Story Conant fell<br />\na victim to the same dread malady that had<br />\nstricken his two companions, and died a day<br />\nafter reaching Boston.<br />\nDrs. Humphrey and Conant were both<br />\nmen of marked ability in their line of work,<br />\nand were very popular with the men in their<br />\ndepartments.<br />\nDr. Humphrey had just been appointed<br />\nprofessor of<br />\n, and Dr. Conant<br />\nhad received the appointment to the Bruce fellowship for the coming year. Dr. Conant was<br />\none of the originators of THE NEWS-LETTER,<br />\nwhich will sadly miss the aid of his ready pen.<br />\nHe was a man of strong character, an earnest<br />\nworker in the Y. M. C. A. and in charitable<br />\ncircles, and of ready helpfulness to all who<br />\ncalled upon him for assistance.<br />\nA new spirit in athletics has invaded the<br />\nUniversity precincts, and there is enthusiasm<br />\nand practical effort to make unprecedented<br />\nprogress. The most conducive factor to this<br />\nstate of affairs, no doubt, is the cage and the<br />\nnew gymnasium. The personal work of several men is another cause, and the attendance<br />\nat practice of the football candidates has been<br />\nunusually significant of the determination of<br />\nthe men to hustle on the gridiron this fall for<br />\nthe Black and Blue.<br />\nMuch is to be expected from Johns Hopkins in athletics, for we are about to have unexcelled advantages for the development of<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nmen for the several teams. But unless the<br />\nstudents fulfill their end of the undertaking—<br />\nin other words, unless they train perseveringly—Hopkins will surely fall back to its old indifference and mediocrity. Indications are<br />\nthat this will not be the case, for a majority of<br />\nthe students, including the freshmen, have displayed more than ordinary interest in the<br />\nathletic outlook for the coming year.<br />\nThis will mark the beginning at Johns Hopkins of an era which, it is to be hoped, will last<br />\nindefinitely. A great many eyes are watching<br />\nthe progress of our two new buildings, and<br />\namong the colleges a cage is considered a<br />\ngreat Twentieth-Century institution, and this<br />\nopinion is formed largely by wonderful results of indoor practice during the winter. We<br />\ncannot afford to fall below the standard for<br />\neven the briefest period. Let every man use<br />\nhis ability and his influence to keep at the head<br />\nof college athletics in Maryland. That is the<br />\nproper place for Johns Hopkins.<br />\nTHE NEWS-LETTER appeared SO late in<br />\n'96-'97 that few of its friends hoped for substantial results from the efforts made even in<br />\nits initial number to advantage the student<br />\nbody which it represents.<br />\nYet friends, both lukewarm and sanguine,<br />\nare offering congratulations upon a forward<br />\nstep that can be traced directly to THE NEWSLETTER. In the issue of May 13 an editorial<br />\nvoiced the sentiment of the student body and<br />\nemphasized the able article by Guy Carleton<br />\nLee upon \"The Art of Expression.\"<br />\nMr. Lee outlined a plan for a college senate<br />\nor congress, and demonstrated the need of a<br />\nplace in the University curriculum for instruction in the art of expression.<br />\nTHE NEWS-LETTER is now able to announce the establishment of such a course,<br />\nand that, too, of a character leaving nothing<br />\nto be desired. It is believed that the results<br />\nof training in the art of expression will be of<br />\nincalculable benefit to all students—to none<br />\nmore than those who express a desire not to<br />\ntake the work. These men particularly need<br />\nthis instruction, if for no other reason than to<br />\n<br />\n7<br />\n<br />\novercome the diffident awkwardness that prevents them from demonstrating their highest<br />\nability.<br />\nBut what have the graduates done that they<br />\nhave no part in the plan outlined in another<br />\ncolumn? Have the graduates been hazing<br />\nfreshmen? Perhaps they do not need instruction in the art of expression — perhaps<br />\nnot<br />\nThose Hopkins men who are prominently<br />\nidentified with the Citizens' Union of 'Greater<br />\nNew York, which is supporting Seth Low<br />\nfor Mayor of that city, are Albert Shaw, editor<br />\nof the Review of Reviews; Dr. E. R. L. Gould<br />\nand W. H. Tolman. The Citizens' Union presented President Low for nomination with an<br />\nindorsement of 125,000 names.<br />\nTO<br />\n<br />\nTHE \"FLUNKED.\"<br />\n<br />\nThere were some young men who would enter<br />\nThis college—of learning the centre.<br />\nThey thought they were fit.<br />\nAnd so they were—nit!<br />\nSo they hied themselves homeward instanter.<br />\n<br />\nHERE.<br />\n<br />\nHERE.<br />\n<br />\nYou save money by subscribing to the<br />\n\"News-Letter.\"<br />\n$1.50 a Year (17 Numbers.)<br />\n<br />\n15c. a Single Copy.<br />\n<br />\nAddress<br />\n<br />\nROBERT H. GRIMES,<br />\nP.0. Box 238, J. H. U.<br />\n\" \" 398 Med. School.<br />\n<br />\nC. W. Prettyman, who held a fellowship in<br />\nGerman at this University last year, is now<br />\nassistant in German at the University of Pennsylvania.<br />\nW. J. Humphreys, who received his Ph. D.<br />\nat Hopkins in June, 1897, is assistant in physics at the University of Virginia.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n8<br />\n<br />\nATHLETICS.<br />\nCAGE AND<br />\n<br />\nGYMNASIUM.<br />\n<br />\nThe new gymnasium and cage which<br />\nMessrs. J. J. Walsh & Son are building for the<br />\nUniversity are now beginning to assume<br />\nshape, and the builders say that barring an unusual run of bad weather they will finish their<br />\nwork by the middle of December. The walls<br />\nare already up as far as the first floor, and the<br />\ngeneral outlines of the building begin to appear. The architects, Messrs. Baldwin & Pennington, seem to have used the space to the<br />\nbest advantage, and have given us a gymnasium not large, but splendidly arranged, and a<br />\ncage the largest and best in the country.<br />\nThe space, fronting 103 feet on Howard<br />\nstreet and running back 130 feet to Little Garden street, has been divided, giving a cage 130<br />\nx65 feet, and the gymnasium 130x35 feet.<br />\nThe cage, from which the students expect so<br />\nmuch for Hopkins athletics, will have walls 25<br />\nfeet high, will be covered by a trussed roof,<br />\nand lighted by electricity. The warm sunlight<br />\nwill be let in by twelve windows, 14x4 feet—<br />\nsix at each end—and by three skylights, each<br />\n10x40 feet. It is proposed to heat it by large<br />\nstoves placed in the corners. It will have a<br />\ndirt-clay floor, and around it a cinder runningtrack. Wire gratings will protect the windows,<br />\nand the walls will probably be padded to some<br />\nextent in the baseball season. The northern<br />\nwall, 25x128 feet, will have no windows, and<br />\nwill make a number of good handball courts.<br />\nFor lacrosse, baseball and football the cage is<br />\nexcellent.<br />\nThe remaining space, 35x130 feet, is occupied by the gymnasium proper, consisting of<br />\na basement 12 feet high, running its entire<br />\nlength a first story of the same length, and a<br />\nsecond story running 40 feet from Little Garden street. The basement will contain lavatory, engine, janitor's, bathing and lockerrooms. The bathroom will be 13 feet square<br />\nand will have two needle baths and six shower<br />\nbaths. The locker-room, 35x90 feet and 12<br />\n<br />\nfeet high, will be an ideal room for this purpose. It will have a cement floor, be lighted<br />\nby eighteen windows 4x5 feet, and when<br />\nequipped with 300 lockers of the most improved pattern will be a treat to the students,<br />\nwho, in this respect, have suffered badly heretofore.<br />\nAbove the locker-room the gymnasium hall,<br />\n35x90 feet, with side walls 20 feet high, is an<br />\nimprovement in many respects on t h e old<br />\nroom. It will be better lighted, drier and better heated. Eighteen windows—fifteen on the<br />\nside and three on Howard street—each 4x10<br />\nfeet, and two skylights, 8x2o feet, will make<br />\nthis room very bright and attractive. The fifteen windows on the side look into the cage,<br />\nand when an exhibition or games are given in<br />\nthe cage spectators can sit here and watch the<br />\ncontests below them.<br />\nOn the first floor a large room, 36x21 feet,<br />\nlooks out on Little Garden street. This was,<br />\non the suggestion of Dr. Crenshaw, set aside<br />\nas a room where students may spend some<br />\nleisure moments between recitations, may chat<br />\ntogether, fight over old battles again, smoke<br />\nand feel free from the restraints imposed upon<br />\nthem in the lecture halls. It is hoped and believed that this room will bring students closer<br />\ntogether and create more enthusiasm in athletics.<br />\nDirectly over this room are the Director's<br />\noffice and a large room 24x34 feet, where any<br />\nathletic meetings may be held, and in which<br />\ntrophies may be placed on exhibition. Five<br />\nwindows look from this into the gymnasium<br />\nhall, and spectators can watch from this point<br />\nthe classes exercising.<br />\nThe outward appearance also, especially on<br />\nHoward street, will be imposing, and the<br />\nwhole structure bids fair to be both useful and<br />\nornamental.<br />\nC. B. J.<br />\nThe Y. M. C. A. of this city has invited the<br />\nstudents of the University to make use of the<br />\nAssociation's gymnasium, at Charles and Saratoga streets, during the erection of the University gymnasium and cage.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nrOOTBALL.<br />\n<br />\n9<br />\n<br />\nbut he will not unlikely be a figure in some of<br />\nthe athletic games of the year. Scholl will also<br />\ngo to Georgetown to make an effort in some<br />\nof the jumps, and Mullen, Knapp and several<br />\nother sprinters will be called upon. They<br />\nhave just enough time to get into condition.<br />\n<br />\nIt is impossible at this early date to give any<br />\ndefinite news of the make-up and prospects<br />\nof the football team. During September Assistant Captain Armstrong,'97, in the absence<br />\nof Captain Hodges, put the men who were in<br />\nDr. G. M. Hartwell, for many years identiform through some light work twice a week.<br />\nSince the opening of the University active fied with athletics at John Hopkins and subwork has been kept up daily. Although the sequently superintendent of physical training<br />\nfirst game with Haverford on October 20 is in the Boston public schools, has been apbut a week off, Captain Hodges has not de- pointed Secretary of the new Department of<br />\ncided definitely how the men will line up. The Municipal Statistics in Boston.<br />\nteam will be light, although there are several<br />\nMr. George C. Morrison, '9o, Secretary of<br />\nheavy men who will probably make up the<br />\nteam. The men trying for the team are: Cen- the Athletic Association, which was organized<br />\ntre, Renouf, Breed; guards, Beale, Kennard, last spring by nearly all the colleges of this<br />\nHancock, Gminder, Haskell ; tackles, State, reports that so far only one (Gallaudet)<br />\nFrancis, Whitman, Armstrong; ends, Brady of the colleges concerned in the Association<br />\n(left guard on Lehigh), Mullen, C. Arm- has paid the deposit of $30 due on October i.<br />\nstrong, Charlton, Hammond, Reese; quarter,<br />\nDr. Crenshaw's temporary office, in which<br />\nRobinson, Mullen, Harwood; half and fullbacks, Hodges, Armstrong, Guggenheimer, he takes physical measurements, is next to the<br />\nPalmer, Arland. All these men have shown Assembly Hall and opposite Donovan Rooms<br />\nup well in practice, and the team which will be in McCoy Hall.<br />\nchosen this week for the opening fray will enWilliam Straus, '98, who played fullback<br />\ndeavor to give Haverford the same drubbing<br />\nas in '95. Coach Mackdermott is giving the on the team of '95-'96, will not be able to play<br />\ngreatest attention to the training of the men, this fall on account of a lame knee.<br />\nand Manager Harwood is filling up a good<br />\nThe number of new students on October 6.<br />\nschedule of games, and in spite of the disadvantge of not having the cage for practice are 1897, was 56 graduates, 68 medical students<br />\ndoing their best to make the present season a and 65 undergraduates. Total, 189. Of the<br />\nundergraduates, 25 are full matriculates.<br />\nseries of 'Varsity victories.<br />\n<br />\nTHE GEORGETOWN GAMES.<br />\nIt is probable that Hopkins will send several representatives to the Georgetown University games to be held at Georgetown on<br />\nNovember 6. Robert Garrett has indicated<br />\nhis willingness to enter some of the events if<br />\nthe athletes are sent, and the Princeton champion can no doubt be counted on to do something notable. He is in the Department of<br />\nHistory and Economics, and is too busy on<br />\nthat account to devote much time to sports,<br />\n<br />\nMr. Harry H. Muller, a member of the class<br />\nof '99, was the victim of a sad accident on July<br />\n5, 1897, which caused his death a few days<br />\nlater. It seems that Mr. Muller was working<br />\nin the hay field and was injured by a falling<br />\nbale of hay. He was only 17 years old, being<br />\none of the youngest members of his class. He<br />\nlived in the city and prepared for the University under Dr. E. Deichmann.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n10<br />\n<br />\nNEWS<br />\n<br />\nor<br />\n<br />\nA rORTNIGI-IT.<br />\n<br />\nPROF. FOSTER'S LECTURE.<br />\nSir Michael Foster, professor of physiology<br />\nat Cambridge University, England, and the<br />\nauthor of a number of standard text books, delivered a lecture in McCoy Hall Monday afternoon, at the invitation of the medical faculty of<br />\nthe University. There was a large audience<br />\npresent. On the platform with Professor Foster were President Gilman, and Drs. Osler,<br />\nWelch and Howell, of the Medical School.<br />\nPresident Gilman introduced the lecturer with<br />\na few well-chosen words.<br />\nProfessor Foster began by a comparison of<br />\nJohns Hopkins with 'Cambridge. Johns Hopkins, he said, had its future before it, and by<br />\nreason of its youth could branch out on the<br />\nlines of the latest modern improvements in the<br />\neducational system. Cambridge, on the other<br />\nhand, with the glamor of antiquity, had many<br />\nof the evils of age. It was, indeed, so fast<br />\nbound by its traditions as to render innovations extremely difficult.<br />\nOne of the greatest reforms lately carried<br />\nout at Cambridge was in the courses and examinations. The strict classical course formerly necessary for degree left the graduate<br />\nwell equipped with knowledge which would<br />\nbe of little use to him, but ignorant of many<br />\nsciences which might be of practical use. The<br />\npresent system of electives was a great change<br />\nfor the better.<br />\nThe system of examinations has also undergone radical changes from the early ages.<br />\nThe examination system has always been a<br />\nbarrier to progress. \"Improvements,\" it was<br />\nclaimed, \"might discourage the examination<br />\nsystem.\" Until at length it seemed a question<br />\nwhether the University existed for examinations, or examinations existed for the University.<br />\nThe latest advance, however, is a modern<br />\nrule which enables a student to enter Cambridge without taking a written examination,<br />\nprovided he satisfies the proper persons of his<br />\nfitness to do his work after entering. After<br />\n<br />\nentering he may pursue his studies and even<br />\ntake a degree without examination. He must,<br />\nhowever, be shown to have contributed something to knowledge.<br />\nOn Tuesday, October 13, President Gilman<br />\nlectured before the Historical Department<br />\nupon the new edition of De Tocqueville's<br />\nworks.<br />\nDe Tocqueville, a prominent French publicist of the earlier part of this century, was<br />\nsent to America by the French 'Government<br />\nto investigate the prison system. While in<br />\nAmerica he was entertained by the prominent<br />\nmen of the day and every opportunity afforded him to pursue his work. The result of this<br />\nvisit was his standard work, \"Democracy in<br />\nAmerica.\"<br />\nPresident Gilman was invited to write the<br />\nintroduction to the new edition, and accepted.<br />\nIt is an interesting fact in this connection that<br />\nDr. Gilman, after seeking for certain material<br />\nfor his work in the Boston Public Library, unsuccessfully, finally found it in the Johns<br />\nHopkins Library.<br />\nThe Graduate Students' Association gave its<br />\nfirst reception of a series last Friday night in<br />\nLevering Hall. Mr. C. E. Waters, President<br />\nof the Association, made a short talk of welcome, and then introduced Professor Ira<br />\nRemsen, who spoke of one or two results of<br />\nhis observation of student life at Johns Hopkins University since the University started.<br />\nHe said in effect that at the start there was<br />\ndifficulty in getting students far enough advanced to undertake the work that the faculty<br />\ndesired them to do ; but now students come<br />\ntoo well prepared—for they had been all over<br />\nthe work (so they say at least) which it is desired that they do here. He deplored the<br />\nshearing down of university work into the domain of the college.<br />\nDr. Remsen also said that he had read recently an article by a German who had been<br />\nprofessor in an American university, in which<br />\nthe writer characterized the American university students as \"uncomfortably industrious.\"<br />\n<br />\nJ<br />\n<br />\n\f-7<br />\n<br />\nTHE NEWS-LETTER.<br />\nAnd he said he thought there was a great deal<br />\nof truth in it.<br />\nMore new students were present than old.<br />\nA noticeable lack was that of the opposite sex.<br />\nAlthough several of the \"ladies of the faculty\"<br />\nwere present, many maids who had been expected from the Woman's College were absent because that institution would not let<br />\nthem come, but compelled them to attend a<br />\nreception given in their own honor at the First<br />\nM. E. Church.<br />\nHAZING.<br />\n<br />\nix<br />\n<br />\nWe are glad to notice that there seems to be<br />\na recent change in the undergraduate point<br />\nof view, as there have been no hostilities of<br />\nany kind this fall. If the class of 19oo preserves its decorum next spring, hazing will<br />\nprobably be abolished forever from the Johns<br />\nHopkins University.<br />\nMr. Oliver L. Fassig, of the United States<br />\nWeather Bureau, instructor in climatology in<br />\nthe University, will give a course of twelve<br />\nlectures on his subject on Mondays and Thursdays, beginning with October H. The lectures will be given at 9 A. M. in the main lecture-room of the Geological Laboratory. Although the course is of special interest to students in geology, medicine and physics, it is<br />\nopen to all members of the University.<br />\n<br />\nPresident Gilman and Dean Griffin addressed the class of'98 in Donovan Rooms on<br />\nFriday, October 1, at 12 o'clock. President<br />\nGilman encouraged the plan of forming a College Senate, and then spoke on the subject<br />\nof hazing. Both he and Dean Griffin asked<br />\nTwo books by Hopkins graduates have apthe '98 classmen to exert their influence to pre- peared during the summer. They are :\"Convent hazing. Their chief argument was plain temporary American Opinion of the French<br />\nand to the point, as it should be on a subject Revolution,\" by Charles Downer Hazen, Ph.<br />\nso easily proved to be injurious to the Univer- D., now professor of history in Smith College,<br />\nsity. The practice of hazing in itself is no and \"Differential Equations,\" by D. A. Murcrime ; in fact, it is simply regarded as fun, ray, Ph. D., instructor in mathematics in Corand enjoyed as such alike by hazers and hazed. nell.<br />\nThose outside of the University, though,<br />\nsee the affair in a different light. They hear<br />\nDr. George Lefevre has been made assistof men being maltreated by brute force, and ant in the Biological Department, taking the<br />\nby superior numbers, and necessarily consider place of Dr. Charles Sigerfoos, who has taken<br />\nthe process barbarous and unworthy of gen- a position at the University of Minnesota.<br />\ntlemen. Complaints come in to the authorities of the University ; bad rumors lower the<br />\nW. B. Saffold has resigned his fellowship in<br />\nreputation of the undergraduates, who rep- Johns Hopkins to accept the position of proresent a large contingent of the University fessor of Latin and Greek in the University Of<br />\nproper. Even the classmen know well Alabama.<br />\nenough that their fun is more liable to degenerate to cruelty and outrage than it is to stay<br />\nJ. D. Epes, formerly gradbate student in<br />\nwithin its \"proper\" limits.<br />\nEnglish at Hopkins and professor of English<br />\nFrom the students' point of view, more- at St. John's College, is now librarian at the<br />\nover, these incidents, and the feeling growing University of Nebraska.<br />\nout of them are most undesirable ; for this<br />\nsame class rivalry is one of the most potent<br />\nDr. F. Bonnotte, who was instructor in<br />\nfactors in undermining the strong 'Varsity French conversation, is now professor of<br />\nfeeling which is at the bottom of success in French and German at Western Maryland<br />\nathletics.<br />\nCollege.<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nY. M. C. A. NOTES.<br />\nThe annual reception which the University<br />\nY. M. C. A. gives to new students was held<br />\nthe evening of October 4 in Levering Hall.<br />\nThe room was well filled. Dr. Steiner, President of the Association, first introduced Dr.<br />\nJames Carey Thomas, who spoke briefly, expressing his sympathy with the motives of col,lege men,and urging them to watch for opportunities of helpfulness to each other. Mr.<br />\nJoshua Levering, President of the City Y. M.<br />\nC. A., said a few words in behalf of his brother,<br />\nthe founder of Levering Hall, and offered<br />\nHopkins athletes the use of the Y. M. C. A.<br />\ngymnasiums until the completion of their own<br />\nbuilding. President Gilman made a characteristic speech, in which he suggested to new<br />\nstudents some of the opportunities for general<br />\nculture to be found in and about Baltimore.<br />\nMr. Morris L. Barr, the new secretary, was<br />\npresent, and made announcements in regard to<br />\nthe year's work. Refreshments were served by<br />\nthe reception committee.<br />\nProf. Herbert B. Adams will lead a class in<br />\nthe study of the life of Christ. The sessions<br />\nwill be held in Professor Adams' room in McCoy Hall at9 o'clock every Saturday morning,<br />\nand are open to all University men.<br />\nMorning prayers are now led regularly by<br />\nDean Griffin in the chapel in Levering Hall<br />\nfrom 8:45 to 8:55 o'clock. Entrance is on<br />\nEutaw street, the door leading from McCoy<br />\nHall being closed until after the morning<br />\nservice.<br />\nPerhaps the most pleasant and comfortable<br />\nroom in all the University buildings is the<br />\nreading-room in Levering Hall. It is supplied<br />\nwith more than seventy papers and periodicals,<br />\nand is open to all members of the University<br />\nfrom 8:15 A. M. to 6:30 P. M.<br />\nSecretary Barr reports that a large number<br />\nof new students have joined the Association.<br />\n<br />\nALUMNI NOTES.<br />\nThe announcement is made of the marriage<br />\non October 20 at the Associate Reformed<br />\nChurch of Mr. Henry Clay McCdmas, Jr., '97,<br />\nto Miss Edith Rosalie Gates, daughter of Dr.<br />\nand Mrs. William H. Gates. Mr. McComas<br />\nwas class historian of '97, but did not make any<br />\nreference in his contribution to The Hullabaloo<br />\nto the wedding of a member of his class.<br />\nGordon Jennings Laing, Ph. D.,'96, is now<br />\nprofessor of Latin and Greek at Bryn-Mawr<br />\nCollege. He will also give during the year an<br />\nentirely new course in Roman archaeology.<br />\nR. E. Marine, A. B.,'96, is now instructor in<br />\nscience at the High School, Michigan City,<br />\nIndiana.<br />\nJ. W. Tupper, Ph. D., '93, is professor of<br />\nEnglish at the Western University, London,<br />\nOntario.<br />\nDr. Francis P. King, who took his degree<br />\nin geology last June, has returned from Yellowstone Park, where he spent the summer<br />\nunder the auspices of the United States Geological Survey.<br />\nMr. Arthur W. Machen, Jr., '96, who is<br />\nstudying law at Harvard, has been appointed<br />\nan editor of the Harvard Law Review.<br />\nHenry Plant Shuter, editor-in-chief of the<br />\n'97 Hullabaloo, has entered the New York Law<br />\nSchool. J. Hanson Thomas,'95, is also studying law in New York at Columbia University.<br />\nC. S. Guggenheimer, '97, has gone to the<br />\nNew York Law School.<br />\nJ. H. Bowman, proficient in electrical engineering last June, is now instructor in physics and chemistry in the High School at<br />\nTrinidad, Col.<br />\n<br />\n\fThe 6oy5' Lmtin SGhool<br />\n<br />\nEstablished 1880.<br />\n<br />\nTelephone Call 1822. -<br />\n<br />\nARTHUR F. LAWRENCE & CO.<br />\n<br />\n870 LINDEN AVENUE,<br />\nJ. A. DUNHAM, A. B., Mend Mrtster.<br />\n<br />\nLeading Dealers in<br />\n411,171Ficoaso<br />\n<br />\nThis school has a continuous history of over fifty years.<br />\nIt was reorganized under its present management<br />\nin 1894.<br />\n<br />\nCOAL and WOOD<br />\nCENTRAL OFFICE,<br />\n<br />\n6<br />\nY. M. C<br />\n<br />\nW. SARATOGA STREET,<br />\n<br />\nA. BUILDING,<br />\n<br />\nBALTIMORE,<br />\n<br />\nFINE CORRESPONDENCE ppiprons,.<br />\nLINEN, ANTIQUE<br />\n<br />\nFINISH, ALSO SATIN<br />\n<br />\nBy the Pound.. 25cts.<br />\nWith Envelopes. ot<br />\n<br />\nFINISH.<br />\n<br />\nBUT DON'T SPECULATE<br />\n<br />\nin futures when it comes to<br />\nClothes. Get the garments that appeal not only to your<br />\npocketbook, but to your eyesight and touch. A good<br />\nSuit is not necessarily loud, but it speaks for itself.<br />\n<br />\nPALL SUITS of strictly good material $15, 818 and $20.<br />\nYOU WOULDN'T BUY a pig in a poke. Of course not.<br />\n<br />\nThen don't buy a Suit until you have examined it thoroughly—every seam, button and buttonhole.<br />\nHAMBURGERS' GUARANTEED SUITS—Elegant<br />\nmaterial and workmanship—the best for $s5. iS and $20,<br />\nOUR CLOTHING IS GOOD CLOTHING. You can get<br />\n<br />\nClothing- for less money, but what you save in price<br />\nyou lose in material and workmanship. Where is the<br />\neconomy in that?<br />\n<br />\nGOOD SUITs as low as $7.50.<br />\niffIso and<br />\n<br />\nA fine assortment for<br />\n<br />\nBEWARE THE DAY OF SMALL THINGS.<br />\n<br />\nBest the market affords at a price you can afford.<br />\n<br />\nGet the<br />\n<br />\nHamburgers', Baltimore & Howard Sts.<br />\nCieo. L. Harrison,<br />\nPresident.<br />\n<br />\nGeo. P. Mordecai,<br />\nVice-President.<br />\n<br />\nArthur H. Ball,<br />\nSec'y and Treas.<br />\n<br />\nfor<br />\n<br />\n'WERNICKE SYSTErl<br />\nOF SECTIONAL<br />\nBOOKCASES.<br />\nThey grow at will. Call<br />\nand see them.<br />\n<br />\nin the<br />\ncountry for<br />\nthe money<br />\n<br />\nStore, 109 E. Baltimore Street.<br />\n<br />\n'At<br />\nIt May be Williams—who can tell?<br />\nIt may be Maister—Just as well!<br />\nIf 'tis t one, then 'tie the other—<br />\nAt any rate, 'tis one or Vother I<br />\nY. M. D. O. D.<br />\n<br />\nSTUDENTS' REQUISITES<br />\nCARD ENGRAVING,<br />\nLIBRARY FURNISHINGS.<br />\nSole Agents<br />\n<br />\nThe best<br />\nto be found<br />\nanywhere<br />\n<br />\nMD.<br />\n<br />\nBuy your CIGARS, CIGARETTES AND SMOKING TOBACCO from<br />\n<br />\nflEfILD & DELI:WIRY,<br />\nNORTH EUTAW ST., ...UCT<br />\nN<br />\nDOOR TO HOPKINS UNIVICROITY<br />\nWe carry a full line of Stationery,<br />\nalso New York and Baltimore Daily and Sunday Papers.<br />\n<br />\n639<br />\n<br />\nGIVE US A CALL.<br />\n<br />\nIF61(<br />\n<br />\nALL TH E *<br />\n<br />\ntat<br />\n(oR<br />\n(fY<br />\n<br />\nGOOD, NEW<br />\nNOVELS<br />\n<br />\n20% Discount On Coyright books to<br />\nJ. H. U. Students,<br />\nJOHNS 110.PICINS LINIVENSITY LINEN,<br />\n<br />\n100 Sheets Paper<br />\n49c,<br />\n100 Envelopes<br />\nNo. 8 Linen Note- • • 15c. per lb.<br />\nAzurine Note • • • 20c. \"<br />\nWM. J. C. DULANY COMPANY,<br />\n8 EAST BALTIMORE STREET.<br />\n<br />\nThe A.G. Alford Sporting Goods Co.<br />\n<br />\nFict9s<br />\n<br />\nSISCO BROS.<br />\n<br />\nFOOT-BALL AND HOCKEY SUPPLIES.<br />\n<br />\nnallitterS<br />\n<br />\n218 N. Charles Street,<br />\n<br />\nllacl9es<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n120 E. BALTIMORE STREET.<br />\nTelephone 2573.<br />\nBALTIMORE, MD.<br />\nR.3049h.YCI0<br />\n<br />\nSt_<br />\n<br />\nThe very latest<br />\nBicycle Gossip.<br />\nClub Gossip.<br />\nPolitical Gossip.<br />\nWoman's Gossip.<br />\n<br />\nWarwick and Maryland Bicyc I es,<br />\nAT $100 AND $50 RESPECTIVELY—ARE LEADERS.<br />\nYOU CANNOT GET MORE FOR YOUR MONEY ANY PLACE.<br />\nTHEY ARE STANDARDS.<br />\n<br />\nC. E. ilicGOWAN 1205 14th St., N.W.,Washington, D.C.<br />\n<br />\n\fBAKFHOLOVIAY BREWERY Co.<br />\n<br />\nJNO. HICINZERLINO•<br />\n<br />\nW. J. WICKHAM.<br />\n<br />\nHEINZERLING<br />\n& Ca<br />\n<br />\nROCHESTER, N. Y.<br />\n<br />\nOffice & Factory, 21-8-z22 W. Conway St.<br />\n<br />\nBohemian ot<br />\nBavarian eat<br />\nMaerzen<br />\nApollo ot tele<br />\n<br />\nOur<br />\n<br />\nSpecialties :<br />\n<br />\nCHALLENGE GINGER ALE<br />\nCLUB GINGER ALE<br />\nCHAMPAGNE CIDER (ExtraDry)<br />\nSPARKLING KOLAFRA .<br />\n'pHONE<br />\n<br />\n• • •<br />\n<br />\n04<br />\n<br />\nI 000—Telephone-2060<br />\n<br />\nBALTIMORE BRANCH:<br />\n<br />\nOffice and Depot, - 227-239 S. Central Ave.<br />\nGEO. C. SUCRO, MANAGER.<br />\n<br />\nSee The<br />\nTHE PRICE<br />\nIS<br />\n<br />\nC. F.flper<br />\n<br />\n$ 55.00<br />\n<br />\nBefore You Buy a Bicycle.<br />\n<br />\nbut the Quality is<br />\nequal to the best mad<br />\n<br />\nIN THEIR<br />\n<br />\nFIELD.<br />\nSend 4e. in stamps [actual cost of mailing] for our latest Illustrated<br />\nCatalogue. Seventh edition.<br />\nBaltimore, Md.<br />\nU. S. A.<br />\n<br />\nOUR GUARANTEE IS WORTH<br />\n<br />\nThe Chloriie of Silver Dry Cell Battery Co<br />\n<br />\nSOMETHING.<br />\n<br />\nCARLIN & FULTON,<br />\n`1<br />\n<br />\n•<br />\n<br />\n1011111111L.<br />\n,PHOTOGRAPHIC_.<br />\nP<br />\n4 DO<br />\n<br />\n1111155 r141KIIO1ll IIP. JOHICS,<br />\nr telkititiit,<br />\n<br />\n5<br />\n<br />\n309 WEST GERMAN STREET.<br />\n<br />\n,Es<br />\n'<br />\n<br />\nb* 10-<br />\n<br />\n304 WEST MADISON STREET, Cameras & Supplies.<br />\n<br />\nDeveloping<br />\n<br />\niD<br />\n<br />\nM ill<br />\n<br />\nes.te<br />\nand<br />\nPrinting.<br />\n<br />\nThe Chas. Willms Surgical Instrument Co.<br />\nMM.% A. NRLSON, atm.! MRI111g1r.<br />\nfa<br />\noo<br />\ncrac<br />\nMaan,<br />\ninct:<br />\n<br />\nTHE CUMMINS<br />\n<br />\nI BALTMORE.MD. 4<br />\n0t111-44et—AililiME-411Valial<br />\n<br />\nNEAR HOWARD.<br />\n<br />\nTERMS MODERATE.<br />\nRefer to MR. HAM, Registrar Jolt., Hopki1114<br />\n<br />\nand<br />\n<br />\nof no<br />\n<br />\nrINE 5JRViJc4L INSTINMENTS,<br />\n<br />\nPHOTO-STOCK CO,<br />\n<br />\nPhysicluns% Surgeons', Hospital and Invalid Supplies,<br />\nMastic Hosiery, Trusses, Rubber (Mods,eLe.<br />\n<br />\n106 N. Charles St.<br />\n<br />\n300 N. HOWARD ST., - BALTIMORE, MD.<br />\nTELEPHONE<br />\n<br />\n771.<br />\n<br />\nNEW YORK TO BREMEN, • • ••<br />\nNORTH GERMAN LLOYD S.S. CO.4\" LONDON,<br />\nPARIS, GIBRALTAR,<br />\nCABIN PASSACE AT LOW RATES.<br />\nETC.<br />\ngr NAPLES, GENOA,<br />\nTO BREMEN • •••<br />\nBALTIMORE<br />\nSCHUMACHER & CO.<br />\nA.<br />\nFor particulars apply to<br />\nDIRECT.<br />\nGeneral Agents.<br />\nrrq,<br />\n<br />\nThe Md.State Building Asso'n<br />\nOF BALTIMORE CITY.<br />\n<br />\nDirector*.<br />\n13ictorAmn C. STEINER,<br />\nWm. A. MARSHALL,<br />\nW. CALVIN CHESNUT,<br />\n<br />\nSIDNEY SHERWOOD,<br />\nOHO. STEWART BROWN,<br />\nEDWARD D. PRESTON,<br />\n<br />\nGieo. C. MORRIFION.<br />\n-------<br />\n<br />\nSix per cent. guaranteed.<br />\nSemi-Annual Dividends.<br />\nMoney Loaned on Mortgages.<br />\n<br />\nOffice, 609 Equitable Building.<br />\n<br />\nPEABODY FIRE INSURANCE CO.<br />\n()IIice 415 Water Street,[Second St.]<br />\nAdjoining Custom House on theWest<br />\n<br />\nShort Insurance for a Day<br />\n.. or Longer Period.<br />\n<br />\nTHOMAS I. CARRY, Pres.<br />\n<br />\nBOARD OF DIRECTORS,<br />\n<br />\nJesse Tyson,<br />\nFrancis White,<br />\nRichard Cromwell,<br />\nRiCkilliD B. POST, Secly.<br />\n<br />\nFord. C. Latrobe,<br />\nA. J. Illman,<br />\nWilliam Harvey,<br />\nJoshua G. Harvey,<br />\nJames W. Bates,<br />\nhenry James,<br />\nAndrew D. Jones. GRIPPITII YEELEMEYER, imit.Soo<br />\n<br />\n\f", "format": "basic_html", "processed": "OCTOBER 14th, 1897.<br /><br />\nVol. II.<br /><br />\nt<br /><br />\nNo. 1.<br /><br />\nt<br /><br />\n0<br /><br />\nSG;-<br /><br />\ntbe<br />\n4',C11/64:Citer<br /><br />\n•<br /><br />\n•<br /><br />\n4)q<br /><br />\n•<br /><br />\nPublished by Students of<br />\nPress of<br />\nGuggenheimer, Well &amp; Co. ..11<br /><br />\net THE JOHNS HOPKINS<br />\n+ UNIVERSITY<br /><br />\n.... ISSUED<br /><br />\nBALTIMORE<br /><br />\nFORTNIGHTLY<br /><br />\nINtropolitan Sayings Bank of Baltimore<br />\nInterest 3W1 per cent, per annum.<br />\nJAMES J. RYAN, Treasurer.<br />\nC. C. Sititiviat, President.<br /><br />\nBALTIMORE, December ist, 1896.<br />\nThe undersigned, a committee of examination appointed by the managers of the Metropolitan Savings<br />\nBank of Baltimore to investigate the affairs of said corporation, and to make and publish a report of such investigation, respectfully submit the following:<br />\nAmount of funds on hafid December 1, 1805 ...........'145,870 06<br />\n1,457,261 46<br />\nReceived from depositors during past year<br />\nReceived dividends from stocks and bonds and interest<br />\n125,605 03<br />\nfrom loans<br />\n$3,728,738 35<br />\nTotal<br />\nFrom which deduct as follows:<br />\nAmount paid depositors during past years.. $1,503,704 70<br />\n20,206 05<br />\nState and City taxes and expenses<br />\n15,132 38<br />\nPremiums on stocks and bonds<br />\n81,539,134 :xi<br />\n$2,189,604 82<br /><br />\nLeaving funds December 1, 1896.<br /><br />\nThe funds are invested in loans on real estate, stocks<br />\nand bonds, in the opinion of the undersigned abundantly<br />\nsecured, and in the purchase of stocks and bonds of the<br />\nmost substantial character. The stocks and bonds purchased are all held below their market value, and none<br />\nabove their par value.<br />\nThere were open December 1, 1895, 4,145 accounts;<br />\nthere were opened during past year 799 accounts, and<br />\nclosed during same period 746 accounts, leaving open<br />\nDecember 1, 1896, 4,198 accounts.<br />\nCUMBERLAND DUGAN,<br />\nCommittee<br />\nDANIEL DONNELLY,<br />\nV. J. BROWN,<br />\nof<br />\nDirectors.<br />\nALBERT T. MYER,<br />\nF. K. MURPHY.<br />\nIn accordance with Article IV, of the By-laws, the<br />\ninvestments have been examined by a committee NOT<br />\nCONNECTED WITH THE MANAGEMENT OF<br />\nTHE CORPORATION, who thus characterize them—<br />\nthe 16ans and investments have been safely and judiciously made, and the securities held are ample.<br />\nCommittee<br />\nE. AUSTIN JENKINS,<br />\nB. F. NEWCOMER.<br />\nof NonALLAN McSHERRY,<br />\nDirectors.<br /><br />\nI<br /><br />\n1313DK3 OLD<br /><br />\nNEW<br /><br />\nThe oldest Old-Book Store, and the largest stock<br />\nof Old and New Books in the City. Books bought<br />\nand exchanged.<br /><br />\nTHE UNIveRsITT 5CHOOL FR Bois<br />\nW. 8, MARSTON, A. 13 and<br /><br />\nC. E.,<br /><br />\n710 and 712 Madison Ave.<br /><br />\nPrincipal.<br /><br />\nTHIS SCHOOL, prepare/1 boy. for admindon to the John, Hopkins or any U..iveralty or<br />\nScientific School. It Ilan fitted snore thac one hundred for the Join. Hopkins alone,<br />\nand neatly for Harvard!, Yale, Princeton, the Maeartchunette Iumtltute of Technology, the<br />\nTroy Polytechnic and otiter ooliege.i and Schdnile. In October. 1894-95, two of the five<br />\necholar4hipe coven at the Joime Hoi}klos 10 0111W MIA trloubit., were awArded to lta pope. It<br />\nban a goot laboratory and a well equipped gymnaaintn, which 1. under the charge of ao01.1`e<br />\ntent Inetructor. For further Information or for rataloguam, addreee the Principal, at Nti. 1011<br />\nN. Calvert Street.<br /><br />\nB. G. EICHELBERGER,<br />\n1-300K8 'RIND FINE STATiONIBRY,<br />\n308 N. CHARLES ST.<br />\nY. M. C.• BUILIMNO.<br /><br />\nBaltimore, Mcl.<br /><br />\n•MISL<br /><br />\nThe professors and students of the Johns Hopkins<br />\nUniversity will find it to their advantage to examine<br />\nstock and make purchases from the following old<br />\nestablished house, Jordan Stabler, importer, jobber<br />\nand retailer of staple and fancy groceries, 701,703 and<br />\n705 Madison avenue,cor. Eutaw st. Telephone 817.<br /><br />\nCushing &amp; Company<br /><br />\nHI BOOKSELLERS<br />\n1<br />\nSTATIONERS<br /><br />\nAND<br /><br />\n34 WEST BALTIMORE STREET.<br />\nSCHOOL, LAW, MEDIOAL, AND CLASSICAL AND MISOKLLANEOUS BOOKS.<br />\nKeep oonatently on hand the Text Book used lu JccliicC Hopklua<br />\nBoepltal, and The WoMitnie College of Baltimore.<br /><br />\nuniversity, John,HoPirin.<br /><br />\nSTATIONERY.—For School, Faintly, °Slice and Bank.<br /><br />\nJohns Hopkins University.<br />\nPROGRAMMES FOR 1897-98.<br />\nThe Johns Hopkins University Circular containing announcements<br />\n. . of the Collegiate and Graduate courses offered for the academic year beginning October 1st, 1897, may be had on application to the Registrar of the Johns Hopkins University.<br /><br />\nTHE JOHNS HOPKINS MEDICAL SCHOOL.<br />\nThe announcements of the Johns Hopkins Medical School may also<br />\n. . be had on application to the Registrars.<br /><br />\nWM. V. PIPPEN,<br />\n327 NORTH CHARLES STREET.<br />\nResort for Students and Travelers.<br /><br />\nCosmopolitan Rendezvous. . . .<br /><br />\nPABST<br />\nRESTAURANT<br /><br />\nAND<br /><br />\n{---IvAiLy RSOPT,<br /><br />\nBurrET<br /><br />\nliss.....320 W. BIDDLE ST..<br />\nPACING<br /><br />\nEUTAW STRE`.CT,<br /><br />\nFINE CONCERTS IN OUR BEAUTIFUL GARDEN ALL SUMMER.<br /><br />\nAt SMITH'S BOOK EXCHANCE<br />\nyou can sell Text Books for Cash<br />\nor exchange them. A full line of<br />\nStudents Requisites always on hand.<br />\nCall,<br />\n805 N. HOWARD STREET,<br />\nTHREE DOORS ABOVE MADISON.<br /><br />\nYou Fairly Fly on<br /><br />\na<br /><br />\n_\"Keating<br />\nrand\"<br /><br />\nHENDERSON'S<br />\nUNIVERSITY<br />\nBOOK STORE<br /><br />\nText Books .<br />\n. Note Books .<br />\nStudents' Supplies<br /><br />\nMadison &amp; Howard Sts.<br /><br />\nIt's the Wheel of Wheels, with its<br />\nDouble Roller Chain—\"that curve\"<br />\nand many other \"365 days ahead<br />\nof all others \"--advantages.<br />\nDIAMOND WHEEL CO., xxx N. Charles St.<br /><br />\nBaltimore Hardware Co., Baltimore &amp; Greene Sts.-Branch.<br /><br />\ntbe 1Rewe:o1isetter.<br />\nVol. II.<br /><br />\nFortnightly<br /><br />\nNo.<br /><br />\nrequisite time for class exercises in forensics<br />\nwill be secured by the generous concession of<br />\nA COLLEGE CONGRESS.<br />\ncertain hours, in the second year, by the Department of English Literature and, in the<br />\nWith the opening of the present academic<br />\nyear, the hopes of many collegiate students will third year, by the Dean from his course in<br />\nbe realized in the institution of a College Con- philosophy. The meetings of the Senate and<br />\ngress under academic auspices, with required of the House will be held separately and alternately at fortnightly intervals — one body this<br />\npreliminary training in vocal culture.<br />\nAt various times in the history of the Uni- week, the other the next from October to<br />\nversity there have been courses in elocution Easter.<br />\nThe scheme of instruction in vocal culture<br />\nand earnest attempts on the part of the students, both graduate and undergraduate, to will embody some of the best methods of leadmaintain a Debating Society. Perhaps the ing instructors in the art of expression, and<br />\nmost successful experiment was the Hopkins will avoid antiquated practices that sought<br />\nHouse of Commons. But for one reason or only to attain temporary excellence in declamanother all these forensic attempts have failed. ation. It will aim at permanent results, nameThe debating societies have died out from lack ly, the acquisition of power to use the voice on<br />\nall occasions in a proper manner, whether in<br />\nof proper support.<br />\nIt is now proposed to establish, under the speaking or reading.<br />\nIn the projected course the work of the first<br />\nsanction of the college authorities and with<br />\nsome academic co-operation, an entirely new year will prove very important, for the princiorganization called the College Congress, a ples of the art of expression will be taught by<br />\nbicameral system to encourage parliamentary concrete examples. The instructor will cordebates and other forensic and literary exer- rect manifest defects in the student's style of<br />\ncises, for the special benefit of the two upper reading and speaking. Good articulation will<br />\nclasses. There will be, however, preliminary be cultivated, and the voice developed. Awktraining in vocal culture for first-year men, wardness and diffidence will be overcome as<br />\nwho, if duly qualified, will be admitted to the far as possible. In preliminary training chief<br />\nHouse at the beginning of the second year, stress will be laid upon the art of good readand pass on to' the College Senate the third ing, in which practice select passages will be<br />\nused from English and American orations and<br />\nyear.<br />\nThus there will be a continuous, progres- essays.<br />\nHaving learned something of the elements<br />\nsive system of training under academic authority and encouragement for at least three of elocution, the second-year man will be fitted<br />\nyears. Attendance will be required, as in the to begin the practice of the art of public speakcase of other college exercises, and reports of ing. Instruction in this art will extend<br />\nwork will be duly made and recorded. An through the second and third years of the colinstructor in vocal training and forensics will lege course. The class exercises will take the<br />\nbe put in charge of the required exercises in form of a College Congress in two distinct<br />\neach class, and he will be responsible for the houses.<br />\nThe College Senate and House of Repreregularity, decorum and efficiency of the<br />\nwork. The new system will not entail any sentatives will each have its own elected presiadditional burden upon undergraduates. The dent or speaker, its own sergeant-at-arms,<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nreading a n d recording clerks, with other<br />\nminor officials. Full power will be given the<br />\nofficers to perform their respective duties and<br />\nto conduct the usual business of the Congress.<br />\nCollege authority and co-operation will be<br />\nrepresented in each chamber by the instructor<br />\nin vocal culture and forensics, with the title of<br />\n\"Censor.\" He will perform the usual functions of the office and see that the proceedings<br />\nof both houses are carried on in accordance<br />\nwith parliamentary law. He will act as a kind<br />\nof judge or umpire in the conduct of the exercises.<br />\nThere will be obvious lines of demarcation<br />\nbetween the three grades of instruction. The<br />\nfirst is preliminary and pedagogical. The<br />\nsecond and third are forensic. The training<br />\nclass will meet in Levering or in McCoy Hall.<br />\nThe upper and lower house will meet in the<br />\nDonovan Room, which is most suitable for<br />\nthe literary character and forensic dignity of<br />\nthe proposed exercises. It will be a privilege<br />\nfor men at the end of their first year to be admitted to the lower house, and for men at the<br />\nend of their second year to graduate into the<br />\nSenate. There will be a certain law of liberty<br />\nin the proceedings of the College Congress.<br />\nThe members will manage their own affairs,<br />\nand at the same time be guided by old and established rules of procedure. In both houses<br />\nthe work will cover a wider field than mere debates. While parliamentary forms are maintained, opportunity will be found for short orations and certain literary exercises. The<br />\nwhole scheme is elastic and will reproduce<br />\nsome of the best features of the old-fashioned<br />\nlyceum or debating society.<br />\nBoth the Senate and the House will meet<br />\nin separate and private sessions, but will be<br />\nopen to University authorities. In order to<br />\nencourage student interest and to test the results of this forensic experiment, it has been<br />\ndecided to hold a joint public debate of the<br />\ntwo houses at some convenient time near the<br />\nEaster recess. A first and a second prize will<br />\nbe offered to the best speakers, as determined<br />\nby a committee to be appointed by the President of the University.<br /><br />\nA VOICE FROM OUTSIDE.<br />\nPublic sentiment in the University is apparently awakening from her strange, slumbrous indifference to the importance of some<br />\ntraining in elocution. By elocution is not<br />\nmeant the bombastic oratory which, under the<br />\nold regime, acquired the name of \"sophomoric\" because it was wont to bear an especial profusion of leaf and flower, at that stage<br />\nof the college course. Very different is the<br />\nfaculty of adequately giving expression to<br />\nthought, the training by which the mind may<br />\nbring forth out her treasures things new and<br />\nold for the benefit of the public.<br />\nIf a man have anything to say, surely it is<br />\nimportant that he should know how to express<br />\nhis ideas in good, intelligible English; surely<br />\nit is well that, by a clear voice, by correct intonation, by appropriate gestures, by every<br />\nlegitimate means, he should be trained to<br />\ncommunicate his thought in the most forcible<br />\nand effective way possible. A lecturer may<br />\nspeak on a subject of profound interest; he<br />\nmay be the greatest living authority on that<br />\nsubject ; yet little profit to have heard him, if<br />\nhis language be involved, his utterance indistinct, and no connecting chord thrill with the<br />\nmessage from his mind to his audience.<br />\nThe apathy which has hitherto enveloped<br />\nthis important subject at last begins to break<br />\naway. The excellent article which appeared<br />\nin THE NEWS-LETTER last June, from a distinguished professor, advises the organization<br />\nof a senate, which may afford the much-needed practice in public speaking.<br />\nThis is not the first evidence that the students of the Johns Hopkins University have<br />\nthemselves felt the need of some opportunity<br />\nfor training in the great art of giving vocal<br />\nexpression to thought. Some years ago a<br />\nsenate was successfully established, and several efforts have been made to start debating<br />\nsocieties. Those who were in the University<br />\nabout three years ago may remember the<br />\nTaney Debating Society, which some<br />\nthoughtful students inaugurated, but which<br />\nsoon, unhappily, perished of inanition.<br /><br />\n'<br /><br />\nTHE NEWS-LETTER.<br />\nThe failure of this and similar efforts has<br />\nbeen due, not altogether to lack of interest<br />\namong the students, but to the absence of cooperation by the faculty. This is suggested in<br />\nthe able article above referred to, and should<br />\nnot be overlooked.<br />\nBy judicious selection of leaders, wise<br />\nformation of plans and the kind and efficient<br />\nprotection and guidance of the powers that be,<br />\nlet us hope that before the class of '98 shall<br />\nhave received all the \"honors, rights and privileges\" to the degree of A. B. appertaining<br />\na senate may have been established on a firm<br />\nbasis. This senate the Twentieth Century may<br />\nmature into a time-honored institution that<br />\nshall furnish to the world not only \"full men,\"<br />\nbut \"ready men ;\" not only men who know<br />\nsomething, but men who have learned how to<br />\nexpress clearly and forcibly what they wish<br />\nothers to know.<br />\nA Friend of the University.<br />\nPROFESSOR WARREN IN ROME.<br />\nProfessor Minton Warren has resumed his<br />\npost as head of the Latin Department. He<br />\nwas in Rome from October r, 1896, to July r,<br />\n1897, as Director of the American School of<br />\nClassical Studies. This institution, founded in<br />\n1895, corresponds in its scope to the American<br />\nSchool of Classical Studies at Athens. The instruction at the school might be called an advanced laboratory course for classical students.<br />\nItaly is the huge laboratory, the working desks<br />\nbeing chiefly at Rome and at Pompeii. Etruscan and Roman art and architecture, inscriptions on temples, on monuments and coins,<br />\nearly Christian works of art hidden in catacombs—all these and many other things are<br />\nstudied at their very birthplace. Last year<br />\ntwelve students, all graduates, were in attendance. Two of them—Mr. Gordon Laing and<br />\nMr. Charles Hoeing — were Johns Hopkins<br />\nmen. Mr. Laing is now teaching Latin at<br />\nBryn-Mawr College. Professor Marquand, of<br />\nPrinceton, and several professors resident at<br />\nRome, were associated in the work with Professor Warren.<br /><br />\n3<br /><br />\nProfessor Warren had many interesting experiences during his stay abroad. He witnessed the wedding of the Prince of Naples<br />\nand Princess Helena ; saw His Holiness, the<br />\nPope, at the consistory, in which Satolli was<br />\nmade Cardinal, and he was present at the opening of the Italian Parliament. After July<br />\nProfessor Warren spent some time in studying<br />\nmanuscripts at various Italian libraries. He<br />\npassed through Switzerland, Paris and London, and arrived at Boston on September 21.<br />\nTHE CENTURY'S PRIZES FOR COLLEGE GRADUATES.<br />\nThe Century Magazine has offered to give,<br />\nduring four successive years, three prizes of<br />\n$250, open to persons who receive the degree<br />\nof Bachelor of Arts, in any college or university in the United States during the commencement seasons of 1897, 1898, 1899 and<br />\n'goo, for :<br />\n1. The best metrical writing.<br />\n2. The best essay in the field of biography,<br />\nhistory or literary criticism.<br />\n3. The best story, to be presented on or before June r of the year succeeding graduation.<br />\nFurther particulars are given in The Century for September.<br />\nTHE MEDICAL SCHOOL.<br />\nMr. Baer, a former graduate of the University, will make a report shortly before the medical faculty of the John Hopkins Hospital upon<br />\n\"The Ainhum Spontaneous Amputation of<br />\nthe Toe.\" The report gains interest from the<br />\nfact that it is only the fourth or fifth report of<br />\nphenomenon which has been made.<br />\nThe entering class at the Medical School<br />\nthis year is the largest on record. There were<br />\nabout io applicants, of whom 68, including<br />\nii women, have been admitted. Almost 25<br />\nper cent. of the class are graduates of Hopkins and men who have taken special courses<br />\nat the University in view of their medical<br />\ncourse. Yale also is represented by a very<br />\nlarge number of graduates.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n4<br /><br />\n1111111111111111=1=11111111.1.1.<br /><br />\ngtn<br /><br />\nVientorican.<br /><br />\nJAMES ELLIS HUMPHREY.<br />\nFRANKLIN STORY CONANT.<br />\nOn Sunday, October 3, at 3 P. M., a meeting to commemorate the deaths of Dr. Humphrey and Dr. Conant was held in Donovan<br />\nRoom. A great part of the faculty, especially<br />\nthe members from the Biological Department,<br />\nmany friends of the deceased, and students,<br />\nwere present. Three resolutions were passed:<br />\n\"1. Copies of the following minutes are to<br />\nbe sent to the trustees of Amherst College, to<br />\nthe trustees of the Johns Hopkins University,<br />\nto the Johns Hopkins University Circular, and<br />\nto the family of Professor Humphrey.<br />\n\"The faculty and students of the Johns<br />\nHopkins University have assembled with other<br />\nfriends to express their sorrow at the great loss<br />\nthey have sustained in the untimely death of<br />\ntheir colleague, teacher and friend, James Ellis<br />\nHumphrey, who died at his post in the courageous discharge of duties of unusual and difficult nature, a leader in the fore ranks of the<br />\narmy of natural sciences. They wish to make<br />\nan expression of the high esteem in which he<br />\nwas held as worker and teacher, and of the<br />\ncherished memory of a genial and valued<br />\nfriend.<br />\n\"In the course of his three years' service at<br />\nthis University Dr. Humphrey had succeeded<br />\nin steadily impressing his usefulness upon the<br />\ndepartment with which he was connected until<br />\nhe seemed to have become an almost essential<br />\nfactor in its successful conduct. More and<br />\nmore frequently both pupils and colleagues<br />\nlearned to draw on his well-ordered store of<br />\nknowledge and to trust his judgment, which<br />\nthey were ever proving to be sound and accurate. His endless patience and care as a<br />\nteacher gave assurance and encouragement to<br />\nhis pupils, who sought his advice confident of<br />\nready and willing response to their appeals. To<br />\nhim nothing was a trouble which promised to<br />\nbe helpful to members of his class. If pains-<br /><br />\ntaking be really akin to genius, he fell but little<br />\nshort of that distinction. Perhaps no one ever<br />\nexemplified better than he the beauty of orderliness. Nothing with which he had to do was<br />\nout of place or lost, whether of things tangible<br />\nor facts in memory. Books, papers, instruments, and his good store of knowledge<br />\nseemed ever to be at places of greatest convenience for his command. The promptness<br />\nwith which he would turn to a special pamphlet<br />\ncase and produce at request some long lost<br />\nmonograph would cause upon our faces a smile<br />\nof admiration—even though mixed with envy.<br />\nStill, it must be added, this exceeding orderliness was in no wise linked with a petty, narrow nature, which this quality often bespeaks.<br />\nFor Humphrey was large and liberal in all his<br />\nthoughts and dealings. In matters doctrinal<br />\nhe accepted that which was most evidently<br />\ntrue; in politics he had broken all hampering<br />\nties, and aimed to be governed by the principles which promised the greatest good. His<br />\nindustry had become a byword among his fellows. To be called as hard a worker as Humphrey was to enjoy enviable repute as a student. To overwork, indeed, and a consequent<br />\nlowered state of health, may probably be attributed the lamentable catastrophe of his<br />\ndeath. In spite of warnings, and against the<br />\nwishes of one whose pleasure and comfort were<br />\nalways of supremest moment to him, he went,<br />\nbecause the duty of going seemed too plain to<br />\nresist.<br />\n\"And then he fell—a loss to the University<br />\nwhich the memory of his character and example lightens but little ; a loss to his more intimate friends, which nothing but the hand of<br />\nunfeeling time will remove ; a bereavement to<br />\nthose yet nearer to him, upon whom we must<br />\nnot intrude.<br />\n\"2. Copies of the following resolution are<br />\nto be sent to the University Circular, to the<br />\nfaculty of Williams College and to the mother<br />\nof Dr. Conant:<br />\n\"We, the friends and companions and instructors of Franklin Story Conant, having<br />\nassembled to express the sorrow with which we<br />\nhave heard the sad news of his death, wish to<br />\nrecord our love and esteem for the generous,<br /><br />\nlifirlfflefFreCrlimmiers.=<br /><br />\n-741-<br /><br />\nTHE NEWS-LETTER.<br />\nwarm-hearted friend, who in all the relations of<br />\nlife proved himself worthy of the utmost honor<br />\nand confidence.<br />\n\"We, who have worked at his side in our<br />\nlaboratories, recall his steadfast earnestness in<br />\nthe pursuit of knowledge, and the encouragement we have found in his bright example.<br />\nWe, who have been his instructors, remember<br />\nhim as one who bettered our instruction, and<br />\nenriched all that he undertook by sound and<br />\nvaluable observations and reflections.<br />\n\"We mourn the untimely loss of one who<br />\nhad shown such rich promise of a life full of<br />\nhonor and distinction and usefulness, but we<br />\nremember with pride that his end was worthy<br />\nof one who had given his life to the fearless<br />\npursuit of truth, to noble devotion to his fellowman and to generous self-sacrifice.<br />\n\"Let us prize the lesson of the noble life<br />\nand death of Franklin Story Conant.\"<br />\n3. It was resolved, that the following associations be requested each to elect a member<br />\nfor a committee of seven to devise and execute,<br />\nas soon as possible, some fitting, permanent<br />\nmemorial to Professor Humphrey and Dr.<br />\nConant:<br />\n1. The Young Men's Christian Association<br />\nof the Johns Hopkins University.<br />\n2. The Graduate Students' Association of the<br />\nJohns Hopkins University.<br />\n3. The Naturalist's Field Club of Baltimore.<br />\n4. The Botanical Club of the Maryland Academy of Arts and Sciences.<br />\n5. The intimate friends of Professor Humphrey who are now resident in Baltimore.<br />\n6. The members of the Jamaica Marine Laboratory.<br />\n7. The members of the Biological Laboratory of the Johns Hopkins University.<br /><br />\nRoland Watts, formerly in the Department<br />\nof Physics, has been appointed professor of<br />\nphysics at Western Maryland College, and<br />\nJ. F. Merrill has been appointed professor of<br />\nphysics in the University of Utah.<br /><br />\n5<br /><br />\nTHE SClENTlrIC DEPARTMENTS.<br />\nSeveral improvements were made in the<br />\nvarious scientific departments during the summer. The most noticeable is the establishment<br />\nof a new mechanical workshop in the basement of the physical laboratory. Various machine tools are at hand and a skilled machinist<br />\nis in charge. A lathe is soon to be installed.<br />\nIt will no longer be necessary to send away to<br />\nhave new apparatus made and old repaired,<br />\nbut all such work will be done in this new<br />\nshop. The advanced students are to receive<br />\ninstruction in instrument-making, etc., under<br />\nthe skilled mechanic.<br />\nThe storage-battery-room has been rearranged. More cells and a large new switchboard have been put in. The whole building<br />\nis being renovated.<br />\nThe current from these cells is some times<br />\nused in the chemical laboratory, as well as to<br />\nrun the various pieces of machinery put in<br />\nabout a year ago in the department of Dr.<br />\nMorse.<br />\nA manual of laboratory practice, by Dr.<br />\nAmes, covering the work of the minor course,<br />\nis now going through the press.<br />\nThe Naturalist's Field Club held a regular meeting on Tuesday, October 12, at 5<br />\nP. M., in the lecture-room of the biological<br />\nlaboratory. Anybody interested in natural<br />\nhistory can become a member of this club by<br />\napplying to the secretary, Mr. Waters. There<br />\nare no dues.<br />\nThe geological students took their first trip<br />\nof the season last Saturday. They visited the<br />\nregion of sedimentary formations along the<br />\nSevern River, especially at Round Bay and<br />\nthe bluffs opposite Annapolis.<br />\nMr. E. Emmet Reid, fellow in chemistry,<br />\nwas at work all summer in the basement of the<br />\nchemical laboratory making preparations to<br />\nbe used in his thesis work of the present term.<br /><br />\nTHE NEWS -LETTER.<br /><br />\n6<br /><br />\nzbe pews/Amer.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents Of THE JOHNS HOPKINS UNIVERSITY.<br />\nOCTOBER 14, 1897.<br /><br />\nSubscription $1.5o per year. 15 cents a single copy.<br />\n98.<br />\nEDGEWORTH SMITH,'<br />\nEditor in Chief,<br />\nAssistant Editor in Chief, - - ALBERT C. DIFFENBACH,'98.<br />\n.KIRBY F. SMITH.<br />\nConsulting Editors, - Prof<br />\nGeo. C. MORRISON, 290.<br />\nBOARD OF EDITORS.<br />\nW.A. MONTGOMERY, /. Graduates.<br /><br />\nC. N. EDMUNDS,<br />\nW.T. LONGCOPE,<br />\n'<br />\n98.<br />\nY. A. RIINOUF,<br />\nR. D. MILLER,<br />\n'<br />\n98.<br />\nJ. C. #RENCH,'99.<br /><br />\nMedical School.<br /><br />\n99.<br />\nBusiness Manager, - - R. H. Gamins,'<br />\nAddress all articles, communications, etc. to EDGEWORTH<br />\nSMITH, box 707, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications must be sent<br />\nto R. H. GRIMES, box 23N, J. H. U.;or box 398, Medical School<br />\nofJohns Hopkins Hospital,<br />\nTHE NEWS-LETTER starts upon its second<br />\nyear with the earnest hope that it may adequately fulfill its object the object, namely,<br />\nof recording the doings and the opinions of<br />\nthe students, graduate and undergraduate, of<br />\nthe University. This it proposes to do to the<br />\nbest of its ability ; and with a considerably<br />\nlarger staff of editors and more experience in<br />\npractical journalistic work, it may hope to<br />\navoid some of the errors, and supply some of<br />\nthe deficiencies apparent in the four numbers<br />\nissued last spring.<br />\nThe success of the paper, however, is<br />\nmainly dependent upon the hearty co-operation of the students themselves. They must<br />\nread the paper and write for it ; and incidently subscribe to it, too. For the lucre thereby<br />\nobtained is a very useful grease—\"filthy\"<br />\nthough it be—for lubricating the machinery of<br />\npublication.<br />\nIt is also to be hoped that the Medical<br />\nSchool may be induced to take some interest<br />\nin T H E NEWS-LETTER. However hardworked they may be, the reason they generally adduce for their non-interest in University matters, they can and should at least keep<br />\nthemselves informed, through THE NEWSLETTER, of the progress of events in their own<br />\nand the other departments of the University.<br /><br />\nThe past summer, which has been a season<br />\nof rest and recreation for most of our students,<br />\nand ingtructors has had a fatal ending for two<br />\nof them, whose scientific zeal kept them at<br />\ntheir work. Last June a party of students of<br />\nthis University, under the direction of Professor Humphrey of the Biological Department, left for Jamaica to carry on their work<br />\nin the Marine Laboratory there. Shortly before the return of the expedition Professor<br />\nHumphrey was smitten by the fever and died<br />\nwithin a few days. Mr. Clark, a member of<br />\nthe party, was also attacked, but recovered.<br />\nOn the way home Franklin Story Conant fell<br />\na victim to the same dread malady that had<br />\nstricken his two companions, and died a day<br />\nafter reaching Boston.<br />\nDrs. Humphrey and Conant were both<br />\nmen of marked ability in their line of work,<br />\nand were very popular with the men in their<br />\ndepartments.<br />\nDr. Humphrey had just been appointed<br />\nprofessor of<br />\n, and Dr. Conant<br />\nhad received the appointment to the Bruce fellowship for the coming year. Dr. Conant was<br />\none of the originators of THE NEWS-LETTER,<br />\nwhich will sadly miss the aid of his ready pen.<br />\nHe was a man of strong character, an earnest<br />\nworker in the Y. M. C. A. and in charitable<br />\ncircles, and of ready helpfulness to all who<br />\ncalled upon him for assistance.<br />\nA new spirit in athletics has invaded the<br />\nUniversity precincts, and there is enthusiasm<br />\nand practical effort to make unprecedented<br />\nprogress. The most conducive factor to this<br />\nstate of affairs, no doubt, is the cage and the<br />\nnew gymnasium. The personal work of several men is another cause, and the attendance<br />\nat practice of the football candidates has been<br />\nunusually significant of the determination of<br />\nthe men to hustle on the gridiron this fall for<br />\nthe Black and Blue.<br />\nMuch is to be expected from Johns Hopkins in athletics, for we are about to have unexcelled advantages for the development of<br /><br />\nTHE NEWS-LETTER.<br />\nmen for the several teams. But unless the<br />\nstudents fulfill their end of the undertaking—<br />\nin other words, unless they train perseveringly—Hopkins will surely fall back to its old indifference and mediocrity. Indications are<br />\nthat this will not be the case, for a majority of<br />\nthe students, including the freshmen, have displayed more than ordinary interest in the<br />\nathletic outlook for the coming year.<br />\nThis will mark the beginning at Johns Hopkins of an era which, it is to be hoped, will last<br />\nindefinitely. A great many eyes are watching<br />\nthe progress of our two new buildings, and<br />\namong the colleges a cage is considered a<br />\ngreat Twentieth-Century institution, and this<br />\nopinion is formed largely by wonderful results of indoor practice during the winter. We<br />\ncannot afford to fall below the standard for<br />\neven the briefest period. Let every man use<br />\nhis ability and his influence to keep at the head<br />\nof college athletics in Maryland. That is the<br />\nproper place for Johns Hopkins.<br />\nTHE NEWS-LETTER appeared SO late in<br />\n'96-'97 that few of its friends hoped for substantial results from the efforts made even in<br />\nits initial number to advantage the student<br />\nbody which it represents.<br />\nYet friends, both lukewarm and sanguine,<br />\nare offering congratulations upon a forward<br />\nstep that can be traced directly to THE NEWSLETTER. In the issue of May 13 an editorial<br />\nvoiced the sentiment of the student body and<br />\nemphasized the able article by Guy Carleton<br />\nLee upon \"The Art of Expression.\"<br />\nMr. Lee outlined a plan for a college senate<br />\nor congress, and demonstrated the need of a<br />\nplace in the University curriculum for instruction in the art of expression.<br />\nTHE NEWS-LETTER is now able to announce the establishment of such a course,<br />\nand that, too, of a character leaving nothing<br />\nto be desired. It is believed that the results<br />\nof training in the art of expression will be of<br />\nincalculable benefit to all students—to none<br />\nmore than those who express a desire not to<br />\ntake the work. These men particularly need<br />\nthis instruction, if for no other reason than to<br /><br />\n7<br /><br />\novercome the diffident awkwardness that prevents them from demonstrating their highest<br />\nability.<br />\nBut what have the graduates done that they<br />\nhave no part in the plan outlined in another<br />\ncolumn? Have the graduates been hazing<br />\nfreshmen? Perhaps they do not need instruction in the art of expression — perhaps<br />\nnot<br />\nThose Hopkins men who are prominently<br />\nidentified with the Citizens' Union of 'Greater<br />\nNew York, which is supporting Seth Low<br />\nfor Mayor of that city, are Albert Shaw, editor<br />\nof the Review of Reviews; Dr. E. R. L. Gould<br />\nand W. H. Tolman. The Citizens' Union presented President Low for nomination with an<br />\nindorsement of 125,000 names.<br />\nTO<br /><br />\nTHE \"FLUNKED.\"<br /><br />\nThere were some young men who would enter<br />\nThis college—of learning the centre.<br />\nThey thought they were fit.<br />\nAnd so they were—nit!<br />\nSo they hied themselves homeward instanter.<br /><br />\nHERE.<br /><br />\nHERE.<br /><br />\nYou save money by subscribing to the<br />\n\"News-Letter.\"<br />\n$1.50 a Year (17 Numbers.)<br /><br />\n15c. a Single Copy.<br /><br />\nAddress<br /><br />\nROBERT H. GRIMES,<br />\nP.0. Box 238, J. H. U.<br />\n\" \" 398 Med. School.<br /><br />\nC. W. Prettyman, who held a fellowship in<br />\nGerman at this University last year, is now<br />\nassistant in German at the University of Pennsylvania.<br />\nW. J. Humphreys, who received his Ph. D.<br />\nat Hopkins in June, 1897, is assistant in physics at the University of Virginia.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n8<br /><br />\nATHLETICS.<br />\nCAGE AND<br /><br />\nGYMNASIUM.<br /><br />\nThe new gymnasium and cage which<br />\nMessrs. J. J. Walsh &amp; Son are building for the<br />\nUniversity are now beginning to assume<br />\nshape, and the builders say that barring an unusual run of bad weather they will finish their<br />\nwork by the middle of December. The walls<br />\nare already up as far as the first floor, and the<br />\ngeneral outlines of the building begin to appear. The architects, Messrs. Baldwin &amp; Pennington, seem to have used the space to the<br />\nbest advantage, and have given us a gymnasium not large, but splendidly arranged, and a<br />\ncage the largest and best in the country.<br />\nThe space, fronting 103 feet on Howard<br />\nstreet and running back 130 feet to Little Garden street, has been divided, giving a cage 130<br />\nx65 feet, and the gymnasium 130x35 feet.<br />\nThe cage, from which the students expect so<br />\nmuch for Hopkins athletics, will have walls 25<br />\nfeet high, will be covered by a trussed roof,<br />\nand lighted by electricity. The warm sunlight<br />\nwill be let in by twelve windows, 14x4 feet—<br />\nsix at each end—and by three skylights, each<br />\n10x40 feet. It is proposed to heat it by large<br />\nstoves placed in the corners. It will have a<br />\ndirt-clay floor, and around it a cinder runningtrack. Wire gratings will protect the windows,<br />\nand the walls will probably be padded to some<br />\nextent in the baseball season. The northern<br />\nwall, 25x128 feet, will have no windows, and<br />\nwill make a number of good handball courts.<br />\nFor lacrosse, baseball and football the cage is<br />\nexcellent.<br />\nThe remaining space, 35x130 feet, is occupied by the gymnasium proper, consisting of<br />\na basement 12 feet high, running its entire<br />\nlength a first story of the same length, and a<br />\nsecond story running 40 feet from Little Garden street. The basement will contain lavatory, engine, janitor's, bathing and lockerrooms. The bathroom will be 13 feet square<br />\nand will have two needle baths and six shower<br />\nbaths. The locker-room, 35x90 feet and 12<br /><br />\nfeet high, will be an ideal room for this purpose. It will have a cement floor, be lighted<br />\nby eighteen windows 4x5 feet, and when<br />\nequipped with 300 lockers of the most improved pattern will be a treat to the students,<br />\nwho, in this respect, have suffered badly heretofore.<br />\nAbove the locker-room the gymnasium hall,<br />\n35x90 feet, with side walls 20 feet high, is an<br />\nimprovement in many respects on t h e old<br />\nroom. It will be better lighted, drier and better heated. Eighteen windows—fifteen on the<br />\nside and three on Howard street—each 4x10<br />\nfeet, and two skylights, 8x2o feet, will make<br />\nthis room very bright and attractive. The fifteen windows on the side look into the cage,<br />\nand when an exhibition or games are given in<br />\nthe cage spectators can sit here and watch the<br />\ncontests below them.<br />\nOn the first floor a large room, 36x21 feet,<br />\nlooks out on Little Garden street. This was,<br />\non the suggestion of Dr. Crenshaw, set aside<br />\nas a room where students may spend some<br />\nleisure moments between recitations, may chat<br />\ntogether, fight over old battles again, smoke<br />\nand feel free from the restraints imposed upon<br />\nthem in the lecture halls. It is hoped and believed that this room will bring students closer<br />\ntogether and create more enthusiasm in athletics.<br />\nDirectly over this room are the Director's<br />\noffice and a large room 24x34 feet, where any<br />\nathletic meetings may be held, and in which<br />\ntrophies may be placed on exhibition. Five<br />\nwindows look from this into the gymnasium<br />\nhall, and spectators can watch from this point<br />\nthe classes exercising.<br />\nThe outward appearance also, especially on<br />\nHoward street, will be imposing, and the<br />\nwhole structure bids fair to be both useful and<br />\nornamental.<br />\nC. B. J.<br />\nThe Y. M. C. A. of this city has invited the<br />\nstudents of the University to make use of the<br />\nAssociation's gymnasium, at Charles and Saratoga streets, during the erection of the University gymnasium and cage.<br /><br />\nTHE NEWS-LETTER.<br /><br />\nrOOTBALL.<br /><br />\n9<br /><br />\nbut he will not unlikely be a figure in some of<br />\nthe athletic games of the year. Scholl will also<br />\ngo to Georgetown to make an effort in some<br />\nof the jumps, and Mullen, Knapp and several<br />\nother sprinters will be called upon. They<br />\nhave just enough time to get into condition.<br /><br />\nIt is impossible at this early date to give any<br />\ndefinite news of the make-up and prospects<br />\nof the football team. During September Assistant Captain Armstrong,'97, in the absence<br />\nof Captain Hodges, put the men who were in<br />\nDr. G. M. Hartwell, for many years identiform through some light work twice a week.<br />\nSince the opening of the University active fied with athletics at John Hopkins and subwork has been kept up daily. Although the sequently superintendent of physical training<br />\nfirst game with Haverford on October 20 is in the Boston public schools, has been apbut a week off, Captain Hodges has not de- pointed Secretary of the new Department of<br />\ncided definitely how the men will line up. The Municipal Statistics in Boston.<br />\nteam will be light, although there are several<br />\nMr. George C. Morrison, '9o, Secretary of<br />\nheavy men who will probably make up the<br />\nteam. The men trying for the team are: Cen- the Athletic Association, which was organized<br />\ntre, Renouf, Breed; guards, Beale, Kennard, last spring by nearly all the colleges of this<br />\nHancock, Gminder, Haskell ; tackles, State, reports that so far only one (Gallaudet)<br />\nFrancis, Whitman, Armstrong; ends, Brady of the colleges concerned in the Association<br />\n(left guard on Lehigh), Mullen, C. Arm- has paid the deposit of $30 due on October i.<br />\nstrong, Charlton, Hammond, Reese; quarter,<br />\nDr. Crenshaw's temporary office, in which<br />\nRobinson, Mullen, Harwood; half and fullbacks, Hodges, Armstrong, Guggenheimer, he takes physical measurements, is next to the<br />\nPalmer, Arland. All these men have shown Assembly Hall and opposite Donovan Rooms<br />\nup well in practice, and the team which will be in McCoy Hall.<br />\nchosen this week for the opening fray will enWilliam Straus, '98, who played fullback<br />\ndeavor to give Haverford the same drubbing<br />\nas in '95. Coach Mackdermott is giving the on the team of '95-'96, will not be able to play<br />\ngreatest attention to the training of the men, this fall on account of a lame knee.<br />\nand Manager Harwood is filling up a good<br />\nThe number of new students on October 6.<br />\nschedule of games, and in spite of the disadvantge of not having the cage for practice are 1897, was 56 graduates, 68 medical students<br />\ndoing their best to make the present season a and 65 undergraduates. Total, 189. Of the<br />\nundergraduates, 25 are full matriculates.<br />\nseries of 'Varsity victories.<br /><br />\nTHE GEORGETOWN GAMES.<br />\nIt is probable that Hopkins will send several representatives to the Georgetown University games to be held at Georgetown on<br />\nNovember 6. Robert Garrett has indicated<br />\nhis willingness to enter some of the events if<br />\nthe athletes are sent, and the Princeton champion can no doubt be counted on to do something notable. He is in the Department of<br />\nHistory and Economics, and is too busy on<br />\nthat account to devote much time to sports,<br /><br />\nMr. Harry H. Muller, a member of the class<br />\nof '99, was the victim of a sad accident on July<br />\n5, 1897, which caused his death a few days<br />\nlater. It seems that Mr. Muller was working<br />\nin the hay field and was injured by a falling<br />\nbale of hay. He was only 17 years old, being<br />\none of the youngest members of his class. He<br />\nlived in the city and prepared for the University under Dr. E. Deichmann.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n10<br /><br />\nNEWS<br /><br />\nor<br /><br />\nA rORTNIGI-IT.<br /><br />\nPROF. FOSTER'S LECTURE.<br />\nSir Michael Foster, professor of physiology<br />\nat Cambridge University, England, and the<br />\nauthor of a number of standard text books, delivered a lecture in McCoy Hall Monday afternoon, at the invitation of the medical faculty of<br />\nthe University. There was a large audience<br />\npresent. On the platform with Professor Foster were President Gilman, and Drs. Osler,<br />\nWelch and Howell, of the Medical School.<br />\nPresident Gilman introduced the lecturer with<br />\na few well-chosen words.<br />\nProfessor Foster began by a comparison of<br />\nJohns Hopkins with 'Cambridge. Johns Hopkins, he said, had its future before it, and by<br />\nreason of its youth could branch out on the<br />\nlines of the latest modern improvements in the<br />\neducational system. Cambridge, on the other<br />\nhand, with the glamor of antiquity, had many<br />\nof the evils of age. It was, indeed, so fast<br />\nbound by its traditions as to render innovations extremely difficult.<br />\nOne of the greatest reforms lately carried<br />\nout at Cambridge was in the courses and examinations. The strict classical course formerly necessary for degree left the graduate<br />\nwell equipped with knowledge which would<br />\nbe of little use to him, but ignorant of many<br />\nsciences which might be of practical use. The<br />\npresent system of electives was a great change<br />\nfor the better.<br />\nThe system of examinations has also undergone radical changes from the early ages.<br />\nThe examination system has always been a<br />\nbarrier to progress. \"Improvements,\" it was<br />\nclaimed, \"might discourage the examination<br />\nsystem.\" Until at length it seemed a question<br />\nwhether the University existed for examinations, or examinations existed for the University.<br />\nThe latest advance, however, is a modern<br />\nrule which enables a student to enter Cambridge without taking a written examination,<br />\nprovided he satisfies the proper persons of his<br />\nfitness to do his work after entering. After<br /><br />\nentering he may pursue his studies and even<br />\ntake a degree without examination. He must,<br />\nhowever, be shown to have contributed something to knowledge.<br />\nOn Tuesday, October 13, President Gilman<br />\nlectured before the Historical Department<br />\nupon the new edition of De Tocqueville's<br />\nworks.<br />\nDe Tocqueville, a prominent French publicist of the earlier part of this century, was<br />\nsent to America by the French 'Government<br />\nto investigate the prison system. While in<br />\nAmerica he was entertained by the prominent<br />\nmen of the day and every opportunity afforded him to pursue his work. The result of this<br />\nvisit was his standard work, \"Democracy in<br />\nAmerica.\"<br />\nPresident Gilman was invited to write the<br />\nintroduction to the new edition, and accepted.<br />\nIt is an interesting fact in this connection that<br />\nDr. Gilman, after seeking for certain material<br />\nfor his work in the Boston Public Library, unsuccessfully, finally found it in the Johns<br />\nHopkins Library.<br />\nThe Graduate Students' Association gave its<br />\nfirst reception of a series last Friday night in<br />\nLevering Hall. Mr. C. E. Waters, President<br />\nof the Association, made a short talk of welcome, and then introduced Professor Ira<br />\nRemsen, who spoke of one or two results of<br />\nhis observation of student life at Johns Hopkins University since the University started.<br />\nHe said in effect that at the start there was<br />\ndifficulty in getting students far enough advanced to undertake the work that the faculty<br />\ndesired them to do ; but now students come<br />\ntoo well prepared—for they had been all over<br />\nthe work (so they say at least) which it is desired that they do here. He deplored the<br />\nshearing down of university work into the domain of the college.<br />\nDr. Remsen also said that he had read recently an article by a German who had been<br />\nprofessor in an American university, in which<br />\nthe writer characterized the American university students as \"uncomfortably industrious.\"<br /><br />\nJ<br /><br />\n-7<br /><br />\nTHE NEWS-LETTER.<br />\nAnd he said he thought there was a great deal<br />\nof truth in it.<br />\nMore new students were present than old.<br />\nA noticeable lack was that of the opposite sex.<br />\nAlthough several of the \"ladies of the faculty\"<br />\nwere present, many maids who had been expected from the Woman's College were absent because that institution would not let<br />\nthem come, but compelled them to attend a<br />\nreception given in their own honor at the First<br />\nM. E. Church.<br />\nHAZING.<br /><br />\nix<br /><br />\nWe are glad to notice that there seems to be<br />\na recent change in the undergraduate point<br />\nof view, as there have been no hostilities of<br />\nany kind this fall. If the class of 19oo preserves its decorum next spring, hazing will<br />\nprobably be abolished forever from the Johns<br />\nHopkins University.<br />\nMr. Oliver L. Fassig, of the United States<br />\nWeather Bureau, instructor in climatology in<br />\nthe University, will give a course of twelve<br />\nlectures on his subject on Mondays and Thursdays, beginning with October H. The lectures will be given at 9 A. M. in the main lecture-room of the Geological Laboratory. Although the course is of special interest to students in geology, medicine and physics, it is<br />\nopen to all members of the University.<br /><br />\nPresident Gilman and Dean Griffin addressed the class of'98 in Donovan Rooms on<br />\nFriday, October 1, at 12 o'clock. President<br />\nGilman encouraged the plan of forming a College Senate, and then spoke on the subject<br />\nof hazing. Both he and Dean Griffin asked<br />\nTwo books by Hopkins graduates have apthe '98 classmen to exert their influence to pre- peared during the summer. They are :\"Convent hazing. Their chief argument was plain temporary American Opinion of the French<br />\nand to the point, as it should be on a subject Revolution,\" by Charles Downer Hazen, Ph.<br />\nso easily proved to be injurious to the Univer- D., now professor of history in Smith College,<br />\nsity. The practice of hazing in itself is no and \"Differential Equations,\" by D. A. Murcrime ; in fact, it is simply regarded as fun, ray, Ph. D., instructor in mathematics in Corand enjoyed as such alike by hazers and hazed. nell.<br />\nThose outside of the University, though,<br />\nsee the affair in a different light. They hear<br />\nDr. George Lefevre has been made assistof men being maltreated by brute force, and ant in the Biological Department, taking the<br />\nby superior numbers, and necessarily consider place of Dr. Charles Sigerfoos, who has taken<br />\nthe process barbarous and unworthy of gen- a position at the University of Minnesota.<br />\ntlemen. Complaints come in to the authorities of the University ; bad rumors lower the<br />\nW. B. Saffold has resigned his fellowship in<br />\nreputation of the undergraduates, who rep- Johns Hopkins to accept the position of proresent a large contingent of the University fessor of Latin and Greek in the University Of<br />\nproper. Even the classmen know well Alabama.<br />\nenough that their fun is more liable to degenerate to cruelty and outrage than it is to stay<br />\nJ. D. Epes, formerly gradbate student in<br />\nwithin its \"proper\" limits.<br />\nEnglish at Hopkins and professor of English<br />\nFrom the students' point of view, more- at St. John's College, is now librarian at the<br />\nover, these incidents, and the feeling growing University of Nebraska.<br />\nout of them are most undesirable ; for this<br />\nsame class rivalry is one of the most potent<br />\nDr. F. Bonnotte, who was instructor in<br />\nfactors in undermining the strong 'Varsity French conversation, is now professor of<br />\nfeeling which is at the bottom of success in French and German at Western Maryland<br />\nathletics.<br />\nCollege.<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br /><br />\nY. M. C. A. NOTES.<br />\nThe annual reception which the University<br />\nY. M. C. A. gives to new students was held<br />\nthe evening of October 4 in Levering Hall.<br />\nThe room was well filled. Dr. Steiner, President of the Association, first introduced Dr.<br />\nJames Carey Thomas, who spoke briefly, expressing his sympathy with the motives of col,lege men,and urging them to watch for opportunities of helpfulness to each other. Mr.<br />\nJoshua Levering, President of the City Y. M.<br />\nC. A., said a few words in behalf of his brother,<br />\nthe founder of Levering Hall, and offered<br />\nHopkins athletes the use of the Y. M. C. A.<br />\ngymnasiums until the completion of their own<br />\nbuilding. President Gilman made a characteristic speech, in which he suggested to new<br />\nstudents some of the opportunities for general<br />\nculture to be found in and about Baltimore.<br />\nMr. Morris L. Barr, the new secretary, was<br />\npresent, and made announcements in regard to<br />\nthe year's work. Refreshments were served by<br />\nthe reception committee.<br />\nProf. Herbert B. Adams will lead a class in<br />\nthe study of the life of Christ. The sessions<br />\nwill be held in Professor Adams' room in McCoy Hall at9 o'clock every Saturday morning,<br />\nand are open to all University men.<br />\nMorning prayers are now led regularly by<br />\nDean Griffin in the chapel in Levering Hall<br />\nfrom 8:45 to 8:55 o'clock. Entrance is on<br />\nEutaw street, the door leading from McCoy<br />\nHall being closed until after the morning<br />\nservice.<br />\nPerhaps the most pleasant and comfortable<br />\nroom in all the University buildings is the<br />\nreading-room in Levering Hall. It is supplied<br />\nwith more than seventy papers and periodicals,<br />\nand is open to all members of the University<br />\nfrom 8:15 A. M. to 6:30 P. M.<br />\nSecretary Barr reports that a large number<br />\nof new students have joined the Association.<br /><br />\nALUMNI NOTES.<br />\nThe announcement is made of the marriage<br />\non October 20 at the Associate Reformed<br />\nChurch of Mr. Henry Clay McCdmas, Jr., '97,<br />\nto Miss Edith Rosalie Gates, daughter of Dr.<br />\nand Mrs. William H. Gates. Mr. McComas<br />\nwas class historian of '97, but did not make any<br />\nreference in his contribution to The Hullabaloo<br />\nto the wedding of a member of his class.<br />\nGordon Jennings Laing, Ph. D.,'96, is now<br />\nprofessor of Latin and Greek at Bryn-Mawr<br />\nCollege. He will also give during the year an<br />\nentirely new course in Roman archaeology.<br />\nR. E. Marine, A. B.,'96, is now instructor in<br />\nscience at the High School, Michigan City,<br />\nIndiana.<br />\nJ. W. Tupper, Ph. D., '93, is professor of<br />\nEnglish at the Western University, London,<br />\nOntario.<br />\nDr. Francis P. King, who took his degree<br />\nin geology last June, has returned from Yellowstone Park, where he spent the summer<br />\nunder the auspices of the United States Geological Survey.<br />\nMr. Arthur W. Machen, Jr., '96, who is<br />\nstudying law at Harvard, has been appointed<br />\nan editor of the Harvard Law Review.<br />\nHenry Plant Shuter, editor-in-chief of the<br />\n'97 Hullabaloo, has entered the New York Law<br />\nSchool. J. Hanson Thomas,'95, is also studying law in New York at Columbia University.<br />\nC. S. Guggenheimer, '97, has gone to the<br />\nNew York Law School.<br />\nJ. H. Bowman, proficient in electrical engineering last June, is now instructor in physics and chemistry in the High School at<br />\nTrinidad, Col.<br /><br />\nThe 6oy5' Lmtin SGhool<br /><br />\nEstablished 1880.<br /><br />\nTelephone Call 1822. -<br /><br />\nARTHUR F. LAWRENCE &amp; CO.<br /><br />\n870 LINDEN AVENUE,<br />\nJ. A. DUNHAM, A. B., Mend Mrtster.<br /><br />\nLeading Dealers in<br />\n411,171Ficoaso<br /><br />\nThis school has a continuous history of over fifty years.<br />\nIt was reorganized under its present management<br />\nin 1894.<br /><br />\nCOAL and WOOD<br />\nCENTRAL OFFICE,<br /><br />\n6<br />\nY. M. C<br /><br />\nW. SARATOGA STREET,<br /><br />\nA. BUILDING,<br /><br />\nBALTIMORE,<br /><br />\nFINE CORRESPONDENCE ppiprons,.<br />\nLINEN, ANTIQUE<br /><br />\nFINISH, ALSO SATIN<br /><br />\nBy the Pound.. 25cts.<br />\nWith Envelopes. ot<br /><br />\nFINISH.<br /><br />\nBUT DON'T SPECULATE<br /><br />\nin futures when it comes to<br />\nClothes. Get the garments that appeal not only to your<br />\npocketbook, but to your eyesight and touch. A good<br />\nSuit is not necessarily loud, but it speaks for itself.<br /><br />\nPALL SUITS of strictly good material $15, 818 and $20.<br />\nYOU WOULDN'T BUY a pig in a poke. Of course not.<br /><br />\nThen don't buy a Suit until you have examined it thoroughly—every seam, button and buttonhole.<br />\nHAMBURGERS' GUARANTEED SUITS—Elegant<br />\nmaterial and workmanship—the best for $s5. iS and $20,<br />\nOUR CLOTHING IS GOOD CLOTHING. You can get<br /><br />\nClothing- for less money, but what you save in price<br />\nyou lose in material and workmanship. Where is the<br />\neconomy in that?<br /><br />\nGOOD SUITs as low as $7.50.<br />\niffIso and<br /><br />\nA fine assortment for<br /><br />\nBEWARE THE DAY OF SMALL THINGS.<br /><br />\nBest the market affords at a price you can afford.<br /><br />\nGet the<br /><br />\nHamburgers', Baltimore &amp; Howard Sts.<br />\nCieo. L. Harrison,<br />\nPresident.<br /><br />\nGeo. P. Mordecai,<br />\nVice-President.<br /><br />\nArthur H. Ball,<br />\nSec'y and Treas.<br /><br />\nfor<br /><br />\n'WERNICKE SYSTErl<br />\nOF SECTIONAL<br />\nBOOKCASES.<br />\nThey grow at will. Call<br />\nand see them.<br /><br />\nin the<br />\ncountry for<br />\nthe money<br /><br />\nStore, 109 E. Baltimore Street.<br /><br />\n'At<br />\nIt May be Williams—who can tell?<br />\nIt may be Maister—Just as well!<br />\nIf 'tis t one, then 'tie the other—<br />\nAt any rate, 'tis one or Vother I<br />\nY. M. D. O. D.<br /><br />\nSTUDENTS' REQUISITES<br />\nCARD ENGRAVING,<br />\nLIBRARY FURNISHINGS.<br />\nSole Agents<br /><br />\nThe best<br />\nto be found<br />\nanywhere<br /><br />\nMD.<br /><br />\nBuy your CIGARS, CIGARETTES AND SMOKING TOBACCO from<br /><br />\nflEfILD &amp; DELI:WIRY,<br />\nNORTH EUTAW ST., ...UCT<br />\nN<br />\nDOOR TO HOPKINS UNIVICROITY<br />\nWe carry a full line of Stationery,<br />\nalso New York and Baltimore Daily and Sunday Papers.<br /><br />\n639<br /><br />\nGIVE US A CALL.<br /><br />\nIF61(<br /><br />\nALL TH E *<br /><br />\ntat<br />\n(oR<br />\n(fY<br /><br />\nGOOD, NEW<br />\nNOVELS<br /><br />\n20% Discount On Coyright books to<br />\nJ. H. U. Students,<br />\nJOHNS 110.PICINS LINIVENSITY LINEN,<br /><br />\n100 Sheets Paper<br />\n49c,<br />\n100 Envelopes<br />\nNo. 8 Linen Note- • • 15c. per lb.<br />\nAzurine Note • • • 20c. \"<br />\nWM. J. C. DULANY COMPANY,<br />\n8 EAST BALTIMORE STREET.<br /><br />\nThe A.G. Alford Sporting Goods Co.<br /><br />\nFict9s<br /><br />\nSISCO BROS.<br /><br />\nFOOT-BALL AND HOCKEY SUPPLIES.<br /><br />\nnallitterS<br /><br />\n218 N. Charles Street,<br /><br />\nllacl9es<br /><br />\nBALTIMORE, MD.<br /><br />\n120 E. BALTIMORE STREET.<br />\nTelephone 2573.<br />\nBALTIMORE, MD.<br />\nR.3049h.YCI0<br /><br />\nSt_<br /><br />\nThe very latest<br />\nBicycle Gossip.<br />\nClub Gossip.<br />\nPolitical Gossip.<br />\nWoman's Gossip.<br /><br />\nWarwick and Maryland Bicyc I es,<br />\nAT $100 AND $50 RESPECTIVELY—ARE LEADERS.<br />\nYOU CANNOT GET MORE FOR YOUR MONEY ANY PLACE.<br />\nTHEY ARE STANDARDS.<br /><br />\nC. E. ilicGOWAN 1205 14th St., N.W.,Washington, D.C.<br /><br />\nBAKFHOLOVIAY BREWERY Co.<br /><br />\nJNO. HICINZERLINO•<br /><br />\nW. J. WICKHAM.<br /><br />\nHEINZERLING<br />\n&amp; Ca<br /><br />\nROCHESTER, N. Y.<br /><br />\nOffice &amp; Factory, 21-8-z22 W. Conway St.<br /><br />\nBohemian ot<br />\nBavarian eat<br />\nMaerzen<br />\nApollo ot tele<br /><br />\nOur<br /><br />\nSpecialties :<br /><br />\nCHALLENGE GINGER ALE<br />\nCLUB GINGER ALE<br />\nCHAMPAGNE CIDER (ExtraDry)<br />\nSPARKLING KOLAFRA .<br />\n'pHONE<br /><br />\n• • •<br /><br />\n04<br /><br />\nI 000—Telephone-2060<br /><br />\nBALTIMORE BRANCH:<br /><br />\nOffice and Depot, - 227-239 S. Central Ave.<br />\nGEO. C. SUCRO, MANAGER.<br /><br />\nSee The<br />\nTHE PRICE<br />\nIS<br /><br />\nC. F.flper<br /><br />\n$ 55.00<br /><br />\nBefore You Buy a Bicycle.<br /><br />\nbut the Quality is<br />\nequal to the best mad<br /><br />\nIN THEIR<br /><br />\nFIELD.<br />\nSend 4e. in stamps [actual cost of mailing] for our latest Illustrated<br />\nCatalogue. Seventh edition.<br />\nBaltimore, Md.<br />\nU. S. A.<br /><br />\nOUR GUARANTEE IS WORTH<br /><br />\nThe Chloriie of Silver Dry Cell Battery Co<br /><br />\nSOMETHING.<br /><br />\nCARLIN &amp; FULTON,<br />\n`1<br /><br />\n•<br /><br />\n1011111111L.<br />\n,PHOTOGRAPHIC_.<br />\nP<br />\n4 DO<br /><br />\n1111155 r141KIIO1ll IIP. JOHICS,<br />\nr telkititiit,<br /><br />\n5<br /><br />\n309 WEST GERMAN STREET.<br /><br />\n,Es<br />\n'<br /><br />\nb* 10-<br /><br />\n304 WEST MADISON STREET, Cameras &amp; Supplies.<br /><br />\nDeveloping<br /><br />\niD<br /><br />\nM ill<br /><br />\nes.te<br />\nand<br />\nPrinting.<br /><br />\nThe Chas. Willms Surgical Instrument Co.<br />\nMM.% A. NRLSON, atm.! MRI111g1r.<br />\nfa<br />\noo<br />\ncrac<br />\nMaan,<br />\ninct:<br /><br />\nTHE CUMMINS<br /><br />\nI BALTMORE.MD. 4<br />\n0t111-44et—AililiME-411Valial<br /><br />\nNEAR HOWARD.<br /><br />\nTERMS MODERATE.<br />\nRefer to MR. HAM, Registrar Jolt., Hopki1114<br /><br />\nand<br /><br />\nof no<br /><br />\nrINE 5JRViJc4L INSTINMENTS,<br /><br />\nPHOTO-STOCK CO,<br /><br />\nPhysicluns% Surgeons', Hospital and Invalid Supplies,<br />\nMastic Hosiery, Trusses, Rubber (Mods,eLe.<br /><br />\n106 N. Charles St.<br /><br />\n300 N. HOWARD ST., - BALTIMORE, MD.<br />\nTELEPHONE<br /><br />\n771.<br /><br />\nNEW YORK TO BREMEN, • • ••<br />\nNORTH GERMAN LLOYD S.S. CO.4\" LONDON,<br />\nPARIS, GIBRALTAR,<br />\nCABIN PASSACE AT LOW RATES.<br />\nETC.<br />\ngr NAPLES, GENOA,<br />\nTO BREMEN • •••<br />\nBALTIMORE<br />\nSCHUMACHER &amp; CO.<br />\nA.<br />\nFor particulars apply to<br />\nDIRECT.<br />\nGeneral Agents.<br />\nrrq,<br /><br />\nThe Md.State Building Asso'n<br />\nOF BALTIMORE CITY.<br /><br />\nDirector*.<br />\n13ictorAmn C. STEINER,<br />\nWm. A. MARSHALL,<br />\nW. CALVIN CHESNUT,<br /><br />\nSIDNEY SHERWOOD,<br />\nOHO. STEWART BROWN,<br />\nEDWARD D. PRESTON,<br /><br />\nGieo. C. MORRIFION.<br />\n-------<br /><br />\nSix per cent. guaranteed.<br />\nSemi-Annual Dividends.<br />\nMoney Loaned on Mortgages.<br /><br />\nOffice, 609 Equitable Building.<br /><br />\nPEABODY FIRE INSURANCE CO.<br />\n()IIice 415 Water Street,[Second St.]<br />\nAdjoining Custom House on theWest<br /><br />\nShort Insurance for a Day<br />\n.. or Longer Period.<br /><br />\nTHOMAS I. CARRY, Pres.<br /><br />\nBOARD OF DIRECTORS,<br /><br />\nJesse Tyson,<br />\nFrancis White,<br />\nRichard Cromwell,<br />\nRiCkilliD B. POST, Secly.<br /><br />\nFord. C. Latrobe,<br />\nA. J. Illman,<br />\nWilliam Harvey,<br />\nJoshua G. Harvey,<br />\nJames W. Bates,<br />\nhenry James,<br />\nAndrew D. Jones. GRIPPITII YEELEMEYER, imit.Soo<br /><br />"}], "field_media_file": [{"target_id": 36092, "display": null, "description": null, "target_type": "file", "target_uuid": "58cbaf4a-edc8-46f0-a7fc-359374a3daac", "url": "http://digital.library.jhu.edu/system/files/2022-03/12090-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12090, "target_type": "node", "target_uuid": "8adec7c6-2f19-4b5e-a04e-319601827a9e", "url": "/node/12090"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "3c2e4964-4b6a-4e7b-905d-f46ce21f0614"}]}