{"mid": [{"value": 38211}], "uuid": [{"value": "9fb2520d-68e5-4a48-a4bd-984fb37703c8"}], "vid": [{"value": 38211}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:50:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12778-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:50:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:50:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "MEM<br />\n<br />\n53<br />\n<br />\n11-<br />\n<br />\nIs,<br />\nor<br />\ned<br />\n<br />\nhe<br />\nrs.<br />\n11to<br />\nrs.<br />\nus<br />\n;id<br />\nhs<br />\n<br />\nAttend FreshmanSophomore Dance At Md.<br />\nCasualty, April 17!<br />\n<br />\nlhitpuilOopitins Nrtnoirttrr<br />\n<br />\nIS THERE<br />\n'A Moratorium On Truth'<br />\nSEE EDITORIAL ON PAGE 2<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 16, 1937<br />\n<br />\nVOL. XLI, No. 34<br />\n<br />\nDouble Feature<br />\nStars Lacrosse<br />\nAt Homewood<br />\nHopkins And U. of P. Will<br />\nPlay First; Followed By<br />\nMd.-Mt. Wash. Tilt<br />\nBLUE JAYS CONFIDENT<br />\nTwenty Of Nation's Best<br />\nWill Exhibit Wares In<br />\nSecond Session<br />\n<br />\nH. H. Lloyd Elected To<br />\nPresidency Of Y. M.C. A.<br />\n-—<br />\nHarold Huntley Lloyd, editor of<br />\nthe \"Y\" News, was elected president of the Hopkins Y for the ensuing year. Others elected were:<br />\nLawrence Hanawalt, vice-president.<br />\nCharles Swartz, vice-president.<br />\nBoyd Frey, treasurer.<br />\nHammond Brown, secretary.<br />\nHanawalt is chairman of the<br />\nSupper Club; Swartz is chairman<br />\nof the Speakers' Bureau; Frey is<br />\nchairman of Freshman Activities.<br />\n<br />\nGilman Hall Picked<br />\nAs War Strike Site<br />\n<br />\nPRICE 5 CEN'Ill<br />\n<br />\n'Dr. H. D. Lasswell Playshop Will Give Freshman-Sophomore Dance<br />\n1 Will Speak Today Musicale to Honor Substitutes<br />\nPeace-Plan<br />\nOn Propaganda Russ Poet-Author<br />\n<br />\nFor Hal-Week Program<br />\n<br />\nJames Schouler Lecture To Alexander Pushkin's Centennial Will Be Observed By<br />\nBe Given At Latrobe<br />\nDance Slated For Tonight<br />\nR.O.T.C. To Hold<br />\nCelebration Friday<br />\nHall<br />\nAt Maryland Casualty<br />\nBall At Levering Hall<br />\nClubhouse<br />\nWalter Lippmann Of New Dr. James Bunyan Of Page<br />\nThe Townsmen Orchestra will<br />\nSchool Is Included On<br />\nYork Herald-Tribune To<br />\nbe the musical struts of the R. 0. STARTS<br />\nAT NINE P. M.<br />\nT. C. Military Ball, coming Friday,<br />\nProgram As Speaker<br />\nSpeak Wednesday<br />\nApril 30, to the Hopkins. CulmiMiss Betty Facer, Of<br />\nOn Friday evening, April 16, the nating a month already full of<br />\nDr. Harold Dwight Lasswell, Asimportant<br />\nsocial<br />\nevents, the ball<br />\nRochester, Chosen Sponsociate Professor of Political Science Playshop, under the direction of Dr.<br />\nIs awaited with impatience and<br />\nat the University of Chicago, will N. B. Fagin, will observe<br />\nthe centen- interest.<br />\nsor Of Affair<br />\ngive the James Schouler Lecture at<br />\n<br />\nnial of the death of Alexander SergLevering Hall will be the scene<br />\nLatrobe Hall today at 5 p.m.<br />\nHe<br />\nBy J. MURRAY KEMPTON<br />\npoet, of the affair, which will start at<br />\nwill speak on the topic Propaganda yeevitch Pushkin, Russian<br />\nThe class struggle at the Hopkins<br />\nnational lacrosse attention this Satnine<br />\nand<br />\nhave<br />\nits<br />\ncurfew<br />\nat<br />\none.<br />\nnovelist, and playwright of the early<br />\nBattles in Modern World Politics.<br />\nNo sponsor has at yet been named Is no more. The bloody spring days,<br />\nurday afternoon when three of the Porch To Be Scene Of StuOn Wednesday, April 21, Mr. Wal- nineteenth century. The program is<br />\nfor the dance, but will be an- just two years ago, when brother<br />\nbest-developed squads in the counter Lippmann, special writer for the to include a short address by Dr.<br />\ndent Demonstration For<br />\nnounced next week. Admission by struggled against brother and<br />\ntry face-off, with Johns Hopkins<br />\nfranNew York Herald Tribune, will de- James Bunyan, of<br />\nthe Page School<br />\ninvitation by a member of the R. tic Freshman<br />\nPeace<br />\nmeeting the University of Pennsylmet strongarm Sopholiver a speech on the subject, The<br />\nof International Relationships, and 0. T. C., exclusively, will cost $1.25<br />\nvania and the Maryland Terrapins<br />\nmore at the brink of the Levering<br />\nRise of Personal Government in the<br />\na couple. Tickets may be bought<br />\nThe steps of Gilman Hall have<br />\nopposing the Mount Washington<br />\nStates.<br />\nMr. Lippmann's music by the great masters, inspired<br />\nUnited<br />\nHall<br />\npond, are gone with the horse<br />\nif invitation is given, at Levering<br />\nClub in a two-game stick festival. been selected as the site for the com- address is also under the sponsor- by the poetry of Pushkin. Dr. Fagin<br />\nand<br />\nbuggy.<br />\nHall,<br />\nThe home team is to take the field ing Student Strike Against War at ship of the James Schouler Lectures.<br />\nwill preside at the meeting.<br />\nInstead, not a stone's throw from<br />\nagainst the Quakers at approximateStudied<br />\nPropaganda<br />\n11 a.m. this Thursday. It will mark<br />\nThe musical portion of the evening<br />\nly 1:30 p.m., while •the night thrills<br />\nthe<br />\nscene of yester-year's epic conDr. Lasswell has made a special<br />\nthe second year that the strike has<br />\nis under the direction of Dr. Lubov<br />\nwill begin at 3:30.<br />\nflict, the Freshmen and the Sophostudy of propaganda and its political<br />\nThe Blue Jays do not expect much been held on this spot.<br />\nuses, and has written a number of Keefer, teacher of Musical History<br />\nmores, arrayed in their best, are to<br />\nIn addition, the committee in books on this subject. He is the in the Department of Education.<br />\nof a skirmish in their encounter with<br />\nmeet at ten tonight, in the Maryland<br />\nthe Pennsyl boys. For the past few charge of the meeting released yes- author of such books as Propaganda Artists to be heard will include Mrs.<br />\nCasualty<br />\nclubrooms, for the second<br />\nyears the Hopkins' tens have started terday a tentative<br />\nprogram of events. Technique in the World War, and has Anna Breit, soprano; Polyandros Koannual Frosh-Soph dance, as the culslowly. Like a phonograph, they<br />\nhelped<br />\nto<br />\ncompile<br />\nPropaganda<br />\nand<br />\nTentative speakers include members<br />\nrnianos, violinist; Stuart le Compte, Members Of Faculty And<br />\nfunction smoothly, but it seems as<br />\nmination of a spring \"love feast,\" in<br />\nPromotional Activities, which is an<br />\nof<br />\nthe<br />\nacademic<br />\nbaritone; and Dr. Keefer, pianJr.,<br />\nfaculty,<br />\nand repre- annotated bibliography prepared<br />\nthough no one is able to apply the<br />\nSociety Vouch For Pres- which Hell Week has been a droopunneedle to the rubberized disk until sentatives from labor and church der the supervision of the advisory ist. Final selections are not yet made<br />\ning shadow of its former lusty self.<br />\nident of A. S. U.<br />\nhalf of the spring strength has been groups. Students representing vari- committee on Pressure Groups and concerning the numbers, but a full<br />\nJohnson On Bandstand<br />\nexhausted.<br />\nous groups on the strike committee Propaganda of the Social Science Re- evening is promised.<br />\nBubby Johnson and his orchestra<br />\nA protest meeting concerning the<br />\nTwenty Champions<br />\nsearch Council. He has also written<br />\nare also slated to speak.<br />\nThe celebration will be held in La- rejection of Maurice Shils, chairman are slated to preside over the cereTwenty of the most adept 'crosseIn the meanwhile, the roster of the Psychopathology and Politics, and trobe<br />\nof the A. S. U. at the Hopkins, for monies. The committee, basing its<br />\n120, at 8.30.<br />\nmen in America feature the afterPolitics—Who Gets What, When,<br />\nadmission into Phi Beta Kappa, drew hopes on Mr. Johnson's reputation,<br />\ncommittee was swelled to thirteen<br />\nCourt Favorite<br />\nnoon's frolics in the Maryland-Mt.<br />\nHow?<br />\nan<br />\nattendance of 400 into Latrobe as well as the attraction of an<br />\nThe clubmen when the Barnstormer Club, campus<br />\nWashington joust.<br />\nAlexander Pushkin was born in last Friday at<br />\nWalter Lippmann, well known au1.00. The meeting amicable meeting between the lion<br />\nrated the championship in their di- theatrical group, last week announced thor and lecturer, is at the present 1799, and was a court favorite during was<br />\nintended as a request to the and the lamb, has set the admission<br />\nvision last spring, with the Terps oc- its intention of participating. Other time, a special feature writer for the<br />\nhis life, save for a brief period of honorary scholastic fraternity to re- at $1.25.<br />\ncupying the same niche in collegiate organizations now represented<br />\nMiss Betty Facer, daughter of Mr.<br />\nin- New York Herald Tribune, and many political exile, from which he was consider its action and elect the camendeavor. It goes without saying clude the Student Council, the<br />\npus liberal leader to membership.<br />\nand Mrs. Luke D. Facer, of Rochester,<br />\nDe- other newspapers. He was formerly<br />\nthat such individual luminaries as bating Council, the American Stu- editor of the old New York World, recalled through the pressure of his<br />\nThe speakers were: Donald Emer- N. Y., has been selected as sponsor<br />\nEffinger, Neilson, Lindsay, Yeager, dent Union, the Student Activities and associate editor of the magazine, wife at court. Friend of Czar Nichoson, undergraduate member-elect to of the dance. Miss Facer, a senior<br />\nand Hewitt of Maryland , and the Committee, Omicron Delta Kappa, The New Republic.<br />\nlas I, and first great poet of the Rus- the<br />\nsociety; Dr. Frederic C. Lane, at Notre Dame, will have as her<br />\nHillmen's Guild, the Turnbull Duo, Phi Sigma Delta, Phi Alpha,<br />\nPhi<br />\nPolitical Commentator<br />\nsian language, it is to him that the associate professor of history; Dr. escort, Harry M. Hopkins, chairman<br />\nBeeler, Steiber, and Stude will pro- Epsilon Pi, the NEWS-LETTER, the<br />\nMr. Lippmann has written many present Soviets turn as the national Albert E. Blumberg, instructor in of Hell Week.<br />\nvide sufficient tasty food for any la- Hullabaloo, the Young<br />\nMr. Johnson and his invaluable asCommunist books on American politics. Among spirit<br />\nof the Russians. His works in- philosophy; Stanley Rappeport, gradcrosse epicure.<br />\nLeague, and the Y. M. C. A.<br />\nsistants<br />\nseem to have set out to esthem are, A Preface to Politics, The clude many great poems,<br />\nuate<br />\nstudent<br />\nin<br />\npolitical<br />\neconomy;<br />\nwhich have<br />\nThe Red and Blue of Pennsylvania<br />\nMorris Shils, chairman of the Political Scene, Public Opinion, and<br />\nDr. Broadus Mitchell, associate pro- tablish something of a tradition of<br />\nbeen<br />\nset<br />\nto<br />\nmusic<br />\nby<br />\ngreatest<br />\nthe<br />\ncross sticks with Hopkins for the American Student Union, which is The Method of Freedom. He is also<br />\ntheir own. This year will mark the<br />\ncomposers of the past; Opera libret- fessor of political economy.<br />\nfirst time in four years on Saturday. among the organizations supporting a contributor to such magazines as<br />\nsecond occasion on which they have<br />\nToward<br />\ntos,<br />\nwhich<br />\nof<br />\nthe<br />\nthe<br />\nmost famous are<br />\nclose of the meeting,<br />\nThe Philadelphia athletes are big, the strike nationally, last Tuesday The Atlantic Monthly, Harpers, Vanlent their efforts to a Freshman-So\"Boris Goudenov,\" and \"Eugene Dr. William Gates, who studied at<br />\nrangy, and extremely fast.<br />\nissued a report of its progress else- ity Fair, and Foreign Affairs. At the<br />\nphomore dance.<br />\nLast year the<br />\nthe<br />\nHopkins \"when it was six years<br />\nOnegin,\" both part of the MetropoliHalstead and Righer, gridiron where. This year, according to re- present, Mr. Lippmann is writing a<br />\nhonors<br />\nwere shared by Rudy Killain<br />\ntan Opera Company's repertory; and old,\" unexpectedly rose from his<br />\nand His Kadets.<br />\nstars, man the point positions to port, will mark the largest demon- new book, Good Society, in which he<br />\nseveral novels--the best known being front-row seat and praised the \"spirit<br />\nform with Gisburne a veritable bulk stration in history, with more than a attempts to show the reasons for the<br />\nAesthetes Enthusiastic<br />\n\"Queen of Spades,\" theme of an oper- of the meeting in defending academic<br />\nThe<br />\nof defense. Their ability to close in million students slated to walk out decay of 19th Century Liberalism,<br />\naesthetes who are fitted to<br />\netta in light vein, by a later composer. freedom.\"<br />\npass an opinion on such matters are<br />\non dodging attackmen is still ques- of classes.<br />\nand the failure of Collectivist society.<br />\nDr. Stull Holt, Associate History<br />\nThe observation of the greatness<br />\n(Continued on Page 3, Col. 1)<br />\nnothing if not enthusiastic about Mr.<br />\nof Alexander Pushkin is lent addi- Professor, who was unable to attend,<br />\nJohnson's efforts. He is a specialist,<br />\ntional timeliness because of the trend had the following statement read<br />\nthey will tell you, in that particular<br />\nin the modern Soviet Union toward his from the platform: \"It seems to me<br />\nbrand of stomp rhythm usually<br />\nworks. Formerly, in the early days particularly unfortunate that those<br />\nlinked with the name of the eminent<br />\nof the revolution, he was regarded as who blackballed Mr. Shils did not<br />\nFletcher Henderson.<br />\nJohnson and<br />\nthe poet of the aristocracy, pampered explain the reasons why they reCo. have been carrying the Henderdarling of a dissolute court—but of jected the recommendation of the<br />\nDr. Norbert Wiener Will Speak On<br />\nson torch with such entire success<br />\nCarbohydrate Production In Plants Explained By Series Of late, despite this, the greatness and executive committee.<br />\nThe Subject Of \"RandomBy keeping that their<br />\nperegrinations on this misness\"<br />\nvigor of his works, have brought him silent they have made it possible for<br />\nChemical Energy Changes; New Theory<br />\nsion have led them over the entire<br />\ninto the fold of the approved poets. people to believe that Mr. Shils' views<br />\nSouth.<br />\nPublished In Physics Journal<br />\nDr. Norbert Wiener, professor of<br />\nHis contact with the Czar is mini- and his activities as president of the<br />\nmathematics at the Massachusetts<br />\nmized, and great stress laid upon the American Student Union determined<br />\nA new theory of photosynthesis has plants during photosynthesis in terms<br />\nInstitute of Technology, will deliver<br />\nexile for political reasons. And in- the vote.\"<br />\nanother in the series of Dohme Lec- ben put forward by Dr. James of the ordinary laws of Physics and deed, as the first great exponent of<br />\nFranck, Professor of Physics at the<br />\ntures next Friday at 4.00 P. M. in<br />\nChemistry without resort to unknown realism and sincerity in writing, he<br />\nSchedule Of Hullabaloo<br />\nJohns<br />\nHopkins University, and Proroom 1, Remsen Hall, on the subject,<br />\nbiologic forces. It presents the pro- set a model for Russian literature<br />\nfessor Karl F. Herzfeld of the Catho\"Randomness.\"<br />\nrise<br />\nwhich<br />\ngave<br />\nto<br />\ngreat<br />\nmen<br />\nPictures Announced Residents Engage Lecturer In Three<br />\nsuch<br />\nas<br />\nduction of sugar and starch as taking<br />\nlic University. It has just been pubHour Discussion Of Court<br />\nTolstoy<br />\nDostoyevski.<br />\nand<br />\nDr. Wiener, born in Columbia, Mislished in the April issue of the Jour- place in four successive chemical<br />\nRobert Austrian, editor-in-chief of<br />\nChange Proposal<br />\nHis works are entirely threaded<br />\nsouri, 43 years ago, was graduated<br />\nsteps<br />\neach<br />\nat<br />\nof<br />\nwhich<br />\na<br />\nsingle<br />\nquannal of Chemical Physics.<br />\nthe<br />\nHullabaloo,<br />\nyesterday<br />\nannounced<br />\n1910<br />\nin<br />\nwith<br />\nCollege<br />\ntradition<br />\na<br />\nwith<br />\nthe<br />\nTufts<br />\nof<br />\nRussia as he<br />\nfrom<br />\nBy describing the production of tum, or tiny pulse of light energy is<br />\nMr. Leon Sachs of the Economics<br />\nheard it in the folk-lore and songs of that all team and activity pictures<br />\nbaccalaureate degree. Studying at<br />\nsugars and starches in plants in absorbed per molecule. The choromust<br />\nbe<br />\ndepartment<br />\ntaken<br />\nat the Hopkins delivered<br />\nthis<br />\nweek.<br />\nThis<br />\nstate1910-1911<br />\nseason,<br />\nthe people. He has been referred to as<br />\nCornell during the<br />\nterms of a plausible series of chem- phyll captures the light quanta and<br />\nment followed a conference with the an address to Dorm<br />\nresidents,<br />\nChaucer<br />\nof<br />\nRussia,\"<br />\n\"the<br />\nfor<br />\nhe went to Harvard, where he re- ical<br />\nhis<br />\ngreat<br />\ntheir<br />\ntransfers<br />\nenergy<br />\nto the carbon<br />\nand energy changes, the new<br />\nwork in setting Russian as a language printers, in which it was decided to Wednesday night, and thus consticeived his Master's degree in 1912.<br />\ndioxide<br />\nwater.<br />\nand<br />\nA<br />\nplant<br />\nprotein<br />\ntheory provides another step toward<br />\ntuted \"one of the most successful and<br />\non a plane of its own. One hundred issue the book earlier than usual.<br />\nGoing abroad in 1913, he visited the<br />\nbetter understanding of this acts as catalyst for the intermediate<br />\n\"A schedule has been made up by instructive features of the series of<br />\nyears ago, at the age of thirty-eight,<br />\nCambridge University, where he re- process<br />\nreactions.<br />\nwhich is essential for the<br />\nPushkin fell on the field of honor, the photographer for next week. addresses sponsored by the Dormimained until 1915, and worked at continuance<br />\nExplains Plant Behavior<br />\nof plant and animal life.<br />\nterminating the career of the great- Should the manager of the activity tory Activities Committee,\" accordGottingen in 1914. From 1914 to<br />\nThe slow oxidation of all organic matOne of the phenomena of photofail to arrange for the picture, or ing to Bernard Pinck, chairman of<br />\nest<br />\nof the Russian authors.<br />\n1915, he held the Sheldon Traveling<br />\nter to furnish the energy for life de- synthesis which the theory explains<br />\nshould the team fail to appear, then that committee. Mr. Sachs spoke on<br />\nFellowship from Harvard.<br />\nmands constant supply of food in or- in a simple way is that of light \"satthe photograph of that activity will the proposal to change the make-up<br />\nReturning to America in 1915, Dr. ganic form, and ceaselessly burns uration.\" Under ordinary<br />\nlight in- Johnston Awards Announced absolutely<br />\nnot<br />\nappear<br />\nin<br />\nthe of the Supreme Court.<br />\nWiener became an assistant in phil- this organic food into carbon dioxide tensity and freely accessible supplies<br />\nHullabaloo,\" Austrian said.<br />\nMr. Sacks brought out in his talk<br />\nosophy at Harvard. The next year and water.<br />\nThe Johnston Scholarships for 1937<br />\nof water and carbon dioxides the prohaw difficult it was for certain issues<br />\nThe<br />\nschedule<br />\nis<br />\nas<br />\nfollows:<br />\nhe moved on to the University of<br />\nhave<br />\nLife<br />\nbeen<br />\nannounced, including two<br />\nProcess Vital For<br />\nduction of sugar becomes more rapid<br />\nbrought before the court to be defiMaine as an instructor in matheLacrosse—Wednesday, 4.30.<br />\nEventually, if there were no way as the intensity of light shining on renewals, and one new appointment—<br />\nnitely named either constitutional or<br />\nmatics. From 1917-1918 he was a of counteracting this process of com- the plant increases. But, when the that of 0. S. G. Schilling, in MatheTrack—Wednesday, 4.00.<br />\nunconstitutional, and that the pracstaff writer with the Encyclopaedia bustion, the organic matter of the intensity rises extremely high, the matics. The renewals were to Tze<br />\nCross Country—Wednesday, 4.30. tically sole feature<br />\ndetermining the<br />\nAmericana and later became a com- world would all be exhausted and rapidity of photosynthesis fails to Tuan Chen, in Zoology, and Dr. Cyrus<br />\nSwimming—Not definite.<br />\nacceptance or rejection of a law is<br />\nputer at the Aberdeen Proving life would perish. It is the unique respond to additional increases—as H. Gordon, in Oriental Seminary.<br />\nwhether or not the judges consider<br />\nWrestling—Tuesday, 4.45.<br />\nGround. In 1919, he became instruc- ability of green plants to reverse the If the plant were satisfied and refused These are post-doctoral grants, of the<br />\nthe law reasonable or not.<br />\nHe<br />\ntor in math at M. I. T., advancing oxidation process by combining the to produce further. This is explained value of $1,000, and are made only<br />\nRifle Club—Tuesday, 5.00.<br />\npointed out how it was impossible<br />\nto an assistant professorship in 1924 carbon dioxide of the air with water in the new theory, not by any mys- to scholars who have completed their<br />\nTennis—Wednesday, 4.00.<br />\nfor personal prejudice to be banned<br />\nand to an associate professorship in to form organic compounds. The terious biologic will, but by a ten- work for a Ph.D.<br />\nBaseball—Tuesday, 4.45.<br />\nfrom<br />\nthe judgments of the \"nine old<br />\n1929. In 1932 he was promoted to energy for combination is furnished dency for the intermediate products<br />\nThe renewal of the Fleishman FelGolf—Tuesday, 4.00.<br />\nmen.\" He showed how the court had<br />\nthe position he now holds.<br />\nby sunlight acting upon the green to redecompose under the stimulus lowship in Chemistry for 1937-38 was<br />\nIntra-Murals—Tuesday, 4.30. •<br />\nbeen \"packed\" m the past, showed<br />\nDr. Wiener is a member of the pigment chlorophyll within the plant of extremely high intensities of light. also announced this week.<br />\nThe<br />\nInter-Fraternity—Tuesday, 4.15.<br />\nwhy the president's plan could be<br />\nLondon Mathematical Society, Deut- cell.<br />\nA \"back-reaction,\" quite familiar to grant is $1,000 yearly, for the state<br />\nFencing—Wednesday, 4.45.<br />\nconstitutionally accepted, and dissche Mathematische Vereinigung, and<br />\nThe theory of Dr. Franck and Dr. chemists, is what balances and limits of Washington, by the Fleischman<br />\nSoccer--Tuesday, 5.00.<br />\nspelled many arguments against the<br />\nSociete Mathematique de France.<br />\nHerzfeld explains the behavior of food manufacture for the plant.<br />\nYeast Company.<br />\nHandball—Tuesday, 4.30.<br />\nnew Court plan.<br />\nHomewood will be the focus of<br />\n<br />\nSpeakers Protest<br />\nShils Rejection<br />\n<br />\nM I T Mathematician<br />\nIs Dohme Speaker<br />\n<br />\nFranck and Herzfeld Publish<br />\nNew Theory on Photosynthesis<br />\n<br />\nDormers Hear Sachs<br />\nDiscuss Court Plan<br />\n<br />\n\fHOMEWOOD, BALTIMORE, APRIL 16, 1937<br />\n<br />\n2<br />\n<br />\nZbe<br />\n<br />\n301)119<br />\n<br />\n340PkinS<br />\n<br />\nA.6<br />\n<br />\nletter<br />\n<br />\ntl<br />\n<br />\nttu<br />\n<br />\nSubscriptioo per year<br />\nBy Mail<br />\n<br />\n___<br />\n<br />\n$2.00<br />\n$2.50<br />\n<br />\nRemit subscription fees to Treasurer, Student Activities Council,<br />\nRenisen Hall, Postoffice, Johns Hopkins University.<br />\n<br />\nEntered as second class matter December 3, 1909, at the Postoffice<br />\nin Jealtunore, Md., under the Act of Congress, November 3, 1879.<br />\nPublished semi-weekly Irons October to June, except during examination and college holiday periods by undergraduates of the Johns<br />\nHopkins University.<br />\n<br />\nEDITORIAL STAFF<br />\nEditor-in-Chief<br />\n_-___._ ..____<br />\nStanley Finkel<br />\nManaging Editors<br />\nRoot .. _ _<br />\nBenjamin<br />\nKenipton,<br />\nMurray<br />\nJ.<br />\nSports Editor<br />\nBernard D. Pinck_____________....._______<br />\nAssistant Managing Editor<br />\nWethered Barroll, Jr.,<br />\nAssistant Sports Editor<br />\nHarold Zbeutlin<br />\n_ Columnist<br />\n___<br />\nPaul Berge<br />\nReporters— Max Iskowita, Nathaniel Finkelstein, Jewett Goldsmith,<br />\nHoward Reisenstein, Julian Adler, Carl Resin, Leonard Rubinger,<br />\nMorris Wessel, Arthur Katz, Martin Krieger, Lester Rosenthal,<br />\nMurray Kempton, Victor Victoroff, Charles Diggs, William Burford, J. C. Handelsman, Mal Boshnack, Arnold Glantz, Joe<br />\nSamovitz, Seymore Sacks, Trying Millberg, Milton Alperstein,<br />\nZenas Baum.<br />\nBUSINESS STAFF<br />\nWilliam B. Kempton<br />\nMelville Locker<br />\nWm. C. Erlanger<br />\nGerald Willen<br />\nHoward Linkoff<br />\nNathaniel Soifer<br />\n<br />\nBusiness<br />\nAssistant Business<br />\nAdvertising<br />\n—Circulation<br />\nOffice<br />\nCopy and Filing<br />\n<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\n<br />\n.....111KNTKO FOR NATIONAL ADVKNTIOINI3<br />\n<br />\nNational Advertising Service, Inc.<br />\nCollege Publishers Representative<br />\nNew YORK, N.Y.<br />\n420 PihkossoN AVE.<br />\nCNIC kG0<br />\nL51 ANOKLEN<br />\n<br />\n.<br />\nSAN FRANCISCO<br />\nGORTON<br />\nSKATTLK<br />\n•<br />\nPORTLANC<br />\n<br />\nMember Of The<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nFRIDAY, APRIL 16, 1937<br />\n<br />\nA Moratorium On Truth?<br />\nAccording to the sentiments expressed by one of the<br />\nstudents here and, from our observations shared by<br />\nmany others—the University should stop thinking—<br />\nat least for a while.<br />\nWhy? Because the Johns Hopkins is in the midst of<br />\na financial campaign and presumably those who are<br />\nexpected to contribute want to be sure that academic<br />\nfreedom is non-existent. Presumably they shell out only<br />\nso that the Hopkin's scholars think as they do. They<br />\ngive money, so some claim, to encourage only those<br />\ndiscoveries and ideas which support these donors.<br />\nBut this writer of the letter and his confreres do not<br />\ngo all the way in urging us to cease any analysis or<br />\ncriticism of the living out of the University's ideals in<br />\nsome quarters. They only say—it is all right to discuss<br />\neverything in order to ascertain the proper conclusions.<br />\nIt's all right to attack injustices. It's all right to defend<br />\ntree speech—but not now.<br />\nYes, be hypocritical, lay low; keep quiet now. Let all<br />\nattacks on campus freedom of thought and expression<br />\ngo by. Take it on the chin when injustices are committed. But only temporarily. Wait 'till we get enough<br />\nmoney to breath easier. Then we can think as we please<br />\nand seek the truth in the traditional Hopkins spirit.<br />\nThis attitude is not only founded on exaggerated<br />\nfears and false premises, but its ideas and implications<br />\nare what we can best call \"un-Hopkins.\" First of all<br />\nwe disavow any statements from us (and as far as we<br />\nknow from any other organization) to the effect that<br />\nthe administration is suppressing free speech—in general—or in these two specific cases.<br />\nThe letter writer and those who think like him have<br />\npeculiar—and erroneous --notions of what the University stands for. We \"beefers\" believe in the real tenets<br />\nof the Hopkins. We do not regard \"Veritas Vos Liberabit\" as a pet phrase to be slung about carelessly; we<br />\njealously guard this motto as the guiding spirit, the<br />\nliving ideal of the Hopkins. In fact, we want to make<br />\nsure that nothing interferes with the traditional academic freedom and liberal attitude --associated with our<br />\nUniversity since its founding.<br />\nFortunately, actual conditions tend to make us much<br />\nless pessimistic than this student. We can point to<br />\nwidespread protest that greeted the assertion by one<br />\nof our Board of Trustees last year that the reason<br />\nmoney was slow in being raised was the radical element at the Hopkins. It is obvious that their fears of<br />\na large radical section of our faculty or student body<br />\nare baseless.<br />\nThe fact of the matter is that the Hopkins possesses<br />\na rather conservative student body and still more conservative faculty. As the Supreme Court poll, and our<br />\nobservations, show, we possess students and faculty<br />\nmembers who are far from radical—but who are, for<br />\nthe most part, open-minded and tolerant of the views<br />\nof others.<br />\nWe have more confidence in the Hopkins; we possess<br />\nmore faith in the number of people who hold a similar<br />\nregard for the continuing of the Hopkins as the traditional home of academic freedom and liberal thought.<br />\nBecause, should this University ever abandon its<br />\ncharacteristic features and cease to live up to its<br />\nmotto—it ceases to exist as that institution of world<br />\n'renown. It ceases to be The Johns Hopkins University.<br />\nAnd if we do anything to undermine or change those<br />\nlong-standing traditions during this financial campaign,<br />\nwe will be obtaining money under false pretenses.<br />\n<br />\nDeserving Promotion<br />\nWe are pleased to announce the election of Murray<br />\nKempton and Ben Root to the positions of managing<br />\neditor. These two fellows have served for almost two<br />\nyears in steady service to the most active activity on<br />\nthe campus. In academic rain or shine, the pair contributed towards putting out the NEWS-LETTER regularly. They well deserve this promotion.<br />\nCongratulations, fellows, and lots of luck in your<br />\nnew positions!<br />\n<br />\nTwo Anniversaries<br />\n<br />\nLETTERS TO THE EDITOR<br />\n<br />\nThis month of April, 1937, marks the twentieth<br />\nTo the Editor of the NEWS-LETTER:<br />\nanniversary of the \"war to end war.\" That descriptive<br />\nDear Sir:<br />\nphrase seems so ironical today that it is seldom proIn the past week, we have been<br />\nnounced in anything but the spirit of sarcasm. The hearing a great deal of how the adsame unhappy fate has befallen its companion piece— - ministration is suppressing the freedom of speech here at Hopkins; the<br />\n\"the fight to make the world safe for democracy.\"<br />\ntwo classical examples being the reHow different is the picture twenty years after.<br />\nfusal of the administration to allow<br />\nEurope trembles today before dictators, who exult in Earl Browder to speak; and the other,<br />\nhaving saved their world from democracy, and who which has now cast Browder into the<br />\nexalt the military life as the national ideal. For the oblivion he deserves, the blackballcontinent, it may be said that the great world war ing of Maurice Shils from Phi Beta<br />\nKappa, in which the administration,<br />\nhas never ended, that the Spain of 1937 is only a new<br />\nit is hinted, was the pressure behind<br />\ntheatre for a constant struggle.<br />\nthe blackball. It is about time that<br />\nNo one in America really wants another war. Most someone called to the attention of<br />\nof us are heartily sorry about the last one. The sur- the A. S. U., and other \"beefers\" (if<br />\nvivors of the gallant band, which filibustered the war I may use the term), certain facts<br />\nwhich they have failed to take into<br />\nresolution twenty years ago and were universally cursed<br />\nconsideration; so that there will be<br />\nas \"pacificomaniacs\" for their pains, are now revered less slinging of their pet phrases—<br />\npatriarchs. The tragedy of 1917 served one good pur- \"freedom of speech,\" and \"Veritas<br />\npose; its very excesses have wrought a revolution in von liberabit.\"<br />\nThe fact that this is a privately<br />\nour approach to war.<br />\nendowed institution was brought<br />\nIn November, 1916, Woodrow Wilson was reelected<br />\nquite forcibly to our minds last year,<br />\npresident of the U.S. on the proud boasts\"he kept us out and those of us who don't spend so<br />\nof war.\" One month after his inauguration, Americans much time writing speeches, and<br />\nwere enlisting for the front while Robert La Follette have a chance to read a newspaper<br />\nand George Norris were reviled as traitors for their occasionally, know that institutions<br />\nsuch as ours have been hampered in<br />\nopposition to the war. The proponents of peace, whattheir work because of shrunken inever their capacity, are helpless in face of the war vestments. Last year the University<br />\nfever. To keep the peace, our only hope rests in eternal had a drive to raise money for running expenses, and at present is tryvigilance.<br />\nApril marks another anniversary--the fourth year ing to raise a permanent endowment<br />\nsince the inception of the National Student Strike fund.<br />\nNow the administration is behind<br />\nagainst War. In 1933, it was a daring venture sponeight ball, so to speak. It can<br />\nthe<br />\nsored by 25,000 students and two left-wing organizafree speech and close the Uniallow<br />\ntions. It came to the Hopkins in a barrage of rotten<br />\nversity, or it can take the other<br />\neggs.<br />\nalternative, which is even plain<br />\nNext Thursday at 11 A. M. the strike is to be held<br />\nenough for the A. S. U. to see. The<br />\nagain at the Hopkins, this time under the auspices<br />\nadministration is here to see that<br />\nof organizations ranging all the way from Omicron<br />\nthe University is kept open, and it<br />\nDelta Kappa to the American Student Union. The<br />\nis not their fault if they have to<br />\nstrike committee is a manifestation of the broadest<br />\nsuppress free speech because the peouniversity sentiment against war. The student body ple who are in the position to give<br />\nhas united to protest its constant threat.<br />\naid to this University financially have<br />\nAnd that is the way to keep the peace.<br />\nstrong objections to so-called liberal<br />\nideas. These people dislike the socalled liberals for reasons I cannot<br />\nattempt to analyze here, but the fact<br />\nWith the new elections and the advance in rank of remains that they will not endow<br />\ntwo men, the retiring managing editors—Jim Morrow money to universities who are not in<br />\nand Dave Caplan—end years of faithful service on the accord with their own ideas. As a<br />\nNEWS-LETTER. To them fell the sometimes thankless<br />\njob of late nights down at the printers' reading proofs.<br />\nWe have enjoyed working with these two fellows<br />\nand want to express our appreciation and thanks for<br />\ntheir activity on the campus paper. Perhaps only those<br />\nwho have worked steadily on a newspaper can fully<br />\nrealize the warm spirit of comradeship and friendship<br />\namong the co-workers on the staff.<br />\nIt is with a note of genuine regret that we bid<br />\ngood-bye to Jim and Dave.<br />\n<br />\nRegretful Goodbye<br />\n<br />\nresult, I am strongly in favor of any<br />\npolicy the administration takes,<br />\nwhether it be the curbing of such<br />\nfree speech upon this campus, as<br />\nwould antagonize supporters of our<br />\nUniversity, as long as the policy<br />\ntends to ward off any unwanted publicity which would tend to jeopardize<br />\ntnis University more than any restraint upon free speech. And I<br />\nthink that anyone who sincerely believes in our University will agree<br />\nwith me.<br />\nSo we ask you \"beefers,\" for your<br />\nown sake and ours, to please refrain<br />\nfrom \"beefing\" until you have left<br />\nthis University, and then you can buy<br />\na million soap boxes and give vent<br />\nto your emotions from morn till<br />\nnight. For then, you wouldn't be<br />\nharming us or the Hopkins.<br />\n<br />\nThe athletic revolution of the last decade left colleges and universities roughly segmented into two<br />\ncamps; the strong and proselyting, aiming for large<br />\ngate receipts; and, the weak and amateur, aiming for<br />\nwholesome competition and fun for all. The Hopkins<br />\nwithstood the juggernaut of professionalism that found<br />\nits way into too many of our institutions of learning,<br />\nincluding some of the most sanctimonious. It repelled<br />\nthe new; stuck fast to the old.<br />\nConsequently—and it is a sad reflection—it became<br />\nthe lot of the Hopkins student to explain to the uninitiated outsider the why and wherefore of the Hopkins<br />\nreputation. \"No,\" the Hopkins student had to say, \"we<br />\nhave given the world or, rather, the sports pages, no<br />\nGrange, Cagle, Thorpe; but, what of Welch, Kelly,<br />\nOsier, Holstead and Willoughby?\" But, to the uninitiated<br />\nthis was not, is not today an adequate reply.<br />\nSo we say this to the uninitiated, and only beause<br />\nthey are uninitiated: Watch our lacrosse team. It is<br />\ncomposed of Students come here to learn chemistry,<br />\nlanguage, etc. Yet, it vies with the best on even terms.<br />\nCome out tomorrow and watch these amateurs play the<br />\nUniversity of Pennsylvania. And watch a student body<br />\ngetting a lot of fun looking on as its class mates play<br />\nin their spare time—because they like to play.<br />\n<br />\nLet Justice Be Done<br />\nNo one who attended the meeting last Friday for discussion of the Shils question and heard the speakers'<br />\nopinions can entertain any doubts on two main points.<br />\nFirst, in the absence of any evidence against, and the<br />\nfull array of testimony for, the election of this student<br />\nto Phi Beta Kappa, one must contend that he deserves<br />\nand beyond all uncertainty should be awarded the key.<br />\nAnd secondly, that the method of choosing members is<br />\none which can potentially continue to allow such injustices as this to arise.<br />\nWe are happy to hear that a special meeting of Phi<br />\nBeta Kappa is to be held. We sincerely hope that justice will be done for this case and for the future,<br />\n<br />\nDear Sir:<br />\n<br />\nProcess-Aging<br />\nPrevents<br />\nTongue Bite<br />\n<br />\nEdgeworth Guarantees that ProcessAging Prevents Tongue Bite<br />\nNGUE BITE is the bane of<br />\nipe smokers.We guarantee that<br />\nEdgeworth will not bite the tongue.<br />\nThe use of the finest Burley tobaccos will not prevent tongue bite.<br />\nIt's the processing that does it. As<br />\nevery tobacco expert knows, pipe<br />\ntobacco can be rushed through the<br />\nplant and save big sums of money.<br />\nIt is pipe tobacco, but it is not<br />\nEdgeworth.<br />\nOur method is Process-Aging—a<br />\nprocess as vital as the aging of old<br />\nwines. There are twelve required<br />\nsteps, each under laboratory control.<br />\nIt takes 4 to 7 times as long as might<br />\nseem necessary. But in no other way<br />\ncan we guarantee that Edgeworth<br />\nwill not bite the tongue.<br />\nWe ask you to try it under our<br />\nmoney-back guarantee. If Edgeworth bites your tongue, return it<br />\nand get your money back. You<br />\ncan't lose.<br />\n<br />\nr<br />\n<br />\nl—Edgeworth Ready-Rubbed—a<br />\ncool, long-burning tobacco preferred by seasoned smokers.<br />\n2—Edgeworth Plug Slice—for the<br />\nsmoker who likes to crumble the<br />\ntobacco in his hands until it's just<br />\nright for him.<br />\n3—Edgeworth Jr.--the same tobacco also Process-Aged, but cut<br />\nfor a milder, more free-burning<br />\nsmoke.<br />\n<br />\nizzzet5iis<br />\n<br />\nIt happened in Salem,Mass., on Februrary 12, 1877. The<br />\nyoung reporter attended a demonstration of inventor Bell's<br />\nnew telephone — then \"talked\" his story to his paper in<br />\nBoston by telephone!<br />\nThough he didn't realize it, he was inaugurating a new<br />\nera in journalism. For today's newspapers could hardly exist<br />\nwithout the telephone.<br />\nGathering and spreading news with lightning speed is just<br />\none of the telephone's countless contributions to modern<br />\nlife. And 300,000 Bell System people strive constantly to<br />\nmake the service still better, still more useful.<br />\nWhy not telephone home oftener?<br />\nRates to most points are lowest after<br />\n7 P M. and all day Sunday.<br />\n<br />\nCo<br />\n<br />\nF'<br />\nEd<br />\n<br />\nOn behalf of the lacrosse team of<br />\nCity College of New York and my-<br />\n<br />\nNOTE: There are three kinds of<br />\nEdgeworth for you to choose from:<br />\n<br />\nBe There Tonight!<br />\n<br />\nThis combined dance is definitely an institution well<br />\nworth continuing. The affair tonight deserves your<br />\nsupport.<br />\n<br />\nApril 14, 1937.<br />\nTo the Editor of the NEWS-LETTER:<br />\n<br />\nself, I wish to thank you and your<br />\nschool publication for the fine tribute<br />\nyou paid our team, in the game they<br />\nSTANLEY ISAACSON.<br />\nplayed at Homewood field on Saturday, April 3, 1937 vs. Johns Hopkins<br />\nTo the Editor of the NEWS-'LET'TER:<br />\nU. in the edition of one your school<br />\nDear Sir:<br />\nLet us suppose that times are publications.<br />\ngood, I am prosperous, and I can<br />\nI consider it fine \"journalism,\" as<br />\nemploy two servants, whom we will well as real sportsmanship, it encourcall A and B. I have no cause to ages the weaker team to note that<br />\ncomplain of the work of either of their efforts have not gone unnoticed,<br />\nthem; perhaps A is a little more and also tends to create a genuine<br />\nenergetic and gets more done than B, public interest.<br />\nbut A turns out to be a communist.<br />\nOur boys certainly enjoyed playFrom the very nature of my posi- ing that game,<br />\nwhether or not they<br />\ntion in life, I disagree with his views,<br />\n(Continued on Page 3, Col. 2)<br />\nbut I feel that he has a perfect right<br />\nto think as he chooses; as a matter<br />\nof fact, being one of those individuals who allow their servants considerable liberty, I rather enjoy<br />\narguing with him.<br />\nHowever, as time goes on, it becomes evident that he is spreading<br />\nrumors about me. Later, he even<br />\ndares to tell my friends in my presence that I am trying to steal another man's wife, that I engage in<br />\nshady business practices, that I have<br />\nthreatened to fire him because of his<br />\npolitical views.<br />\nAre his accusations true? Only I<br />\nknow, and for obvious reasons I refrain from saying anything on the<br />\nsubject. Perhaps his accusations are<br />\nso vague that even I am not sure<br />\nwhether they are true or not.<br />\n<br />\nWatch Us Amateurs Play<br />\n<br />\nContinuing the annual affair instituted last year with<br />\nthe Soph Frosh dance, the present first-year and secondyear students are sublimating their Hell Week into a<br />\ncombined social affair.<br />\nLast year the dance was well-supported and the<br />\npioneer effort was declared a success from all angles.<br />\nThe two class worked together harmoniously and a<br />\nsizeable sum was earned for the respective class<br />\ntreasuries.<br />\n<br />\nHard times come. My friends begin to drop away one by one; my<br />\nbusiness clients go elsewhere for<br />\ntheir services, largely, I feel, because<br />\nof the stories that my servant A has<br />\nbroadcast around. I can no longer<br />\nafford more than one servant. A<br />\nworks as hard as ever and B is his<br />\nsame, quiet, docile, lazy self. 1 discharge A; have I violated the freedom<br />\nof speech?<br />\nJ. E. T.<br />\n<br />\nPlease accept 50t Gold Plated Collar-Pin<br />\nfor only 100 when you buy Edgeworth.<br />\nMerely send inside white wrapper from<br />\nany tin of Edgeworth with your name and<br />\naddress and 100 to Larus & Bro. Co.,<br />\nDept. 400, Richmond, Va.<br />\n<br />\nEDGEWORTH\"<br />\nEDGEWORTH<br />\nSywdeaff<br />\n<br />\ntioR<br />\nn<br />\n<br />\n:<br />\nthet<br />\nlsir<br />\n<br />\nOnly<br />\ngive:<br />\n<br />\ne<br />\np<br />\nalnd<br />\nn<br />\ni<br />\nTt<br />\ni<br />\n(<br />\nla<br />\ns<br />\nl<br />\n<br />\n:<br />\n9<br />\n:11<br />\n<br />\n1h<br />\nrnienfl<br />\n<br />\ne<br />\nW<br />\ne,a<br />\n0<br />\n:1<br />\n8<br />\nt9d_ ,<br />\nTh<br />\n<br />\ncopy<br />\n<br />\no<br />\nvf<br />\nestti<br />\n<br />\nCo<br />\nall ic<br />\n\"'crib<br />\nH. E<br />\nple a<br />\n<br />\nA<br />\nfavor<br />\nto de<br />\nare<br />\ndemi<br />\ninfor<br />\nsuch<br />\nadop<br />\n<br />\nHo<br />\ntor<br />\n<br />\nJ<br />\nAam<br />\nZI<br />\n:<br />\nat:e4<br />\nbecar<br />\nDoug<br />\n<br />\nLa<br />\nSal<br />\n<br />\n(0<br />\ntiona'<br />\nbe th<br />\nis cc<br />\nKessl<br />\nrespe<br />\nattac<br />\nthan<br />\nat inhand(<br />\nby N<br />\nfirst<br />\ndodgc<br />\nstart<br />\nman<br />\nthoug<br />\nMakE<br />\n<br />\nworti<br />\n<br />\nstead<br />\nJoh<br />\norigii<br />\nvoid<br />\nSwim<br />\nfrom<br />\nprotel<br />\nand<br />\nfling<br />\nthe F<br />\nfaceby IVI<br />\nbargi<br />\nform<br />\n<br />\nCost<br />\n<br />\nAn<br />\naide<br />\neosin,<br />\nApril<br />\nHall<br />\ndent<br />\nDal<br />\nMopo]<br />\n\"It w<br />\nto an<br />\nof sex<br />\n<br />\nirnana<br />\nthen<br />\nWere<br />\n<br />\nPany.'<br />\n<br />\nEVE<br />\nzneeti<br />\nWill b<br />\n<br />\n\fHOM.EWOOD, BALTIMORE, APRIL 16, 1937<br />\n<br />\n3<br />\n<br />\nNews-Letter is Dr.Corwin Presents J.H.U. Band Runs Raffle to Pay Medical Students 'Aint's the Nuts'<br />\nOn Delicate For 'Gorgeous' New Uniforms Gather at Hopkins Says Professor<br />\nDeclared Free Paper<br />\nScale He Developed Band Members Must Raise Money In Order To Keep For Convention<br />\nFrom Censoring Difficulties In Using SuperUniforms; Drawing May 10<br />\nDean Chesney Of Hopkins<br />\nFor Philco Radio<br />\n<br />\nCommittee At Convention<br />\nRates Hopkins Journal<br />\nAmong Least Censored<br />\n_<br />\nFINK EL REPRESENTS<br />\n<br />\nSensitive Scale Are Revealed<br />\nDr. Alsoph H. Corwin, Associate<br />\nin Chemistry, presented a paper before the Micro-Chemical Section of<br />\nthe American Chemical Society, last<br />\n<br />\nEditor - in - Chief Introduces<br />\nResolution To Provide Aid<br />\nFor Needy Students<br />\n<br />\nWednesday, on \"Balance Errors in<br />\n<br />\nRepresented at the spring convention of the Intercollegiate Newspaper<br />\nAssociation by Stanley Finkel, editor,<br />\nthe NEWS-LETTER was given an \"A\"<br />\nrating in regard to censorship by a<br />\ncommittee chosen for that selection.<br />\nOnly three other college papers were<br />\ngiven a similar position: the Swarthmore Phoenix, the Stevens Tech Stute<br />\nand the Elmira Octagon.<br />\n<br />\nsion of some of the difficulties inher-<br />\n<br />\nConference Protests Censorship<br />\nThe conference unanimously adopted a resolution protesting a \"dictatorial\" policy of the University of<br />\nPittsburgh in choosing an editor-inchief of the Pitt News. Direct censorship of the editorial and news columns of the Temple News was also<br />\n\"Deletion of student<br />\ncondemned.<br />\ncopy\" from the Susquehanna paper<br />\nWas also charged.<br />\nThe latter protests were a result<br />\nof the findings of a Censorship Investigation Committee, set up at the<br />\nLast-year's convention.<br />\nConditions at these universities,<br />\nall located in Pennsylvania, were deacribed in letters to be sent to George<br />\nH. Earle, Governor of the state. Temple and Pitt receive state aid.<br />\nFinkel Introduces Resolution<br />\nA resolution introduced by Finkel,<br />\nfavoring the granting of financial aid<br />\nto deserving and needy students, who<br />\nare \"outstanding in other than academic fields,\" and for disclosures of<br />\nInformation showing the value of<br />\nsuch assistance, was unanimously<br />\nadopted at a session.<br />\nHoward W. Emres, associate editor of the George Washington<br />\nHatchet, was elected president of the<br />\nAssociation for the coming year.<br />\nJames Donoghue of the Pitt News<br />\nbecame vice-president, and Mary<br />\nDouglas of Wilson College, secretary.<br />\n<br />\nLacrosse Attraction<br />\nSat. At Homewood<br />\n(Continued from Page 1, Col. 1)<br />\ntionable as the Hopkins game will<br />\nbe their first real test. The mid-field<br />\nis composed of Gordon, Nye, and<br />\nKessler, at the wings and center post<br />\nVeterans compose the<br />\nrespectively.<br />\nattack and these men will bear more<br />\nthan perfunctory watching. Panzer,<br />\nat in-home, throws a dangerous lefthanded shot, and is fed consistently<br />\nby Needle, at the other home. The<br />\nfirst attack is tricky Jack Dolman, a<br />\ndodger of known ability and a good<br />\nstart will put him by any defense<br />\nman and in a scoring position. Although the defense has its loopholes,<br />\nMaksik, the visiting net-tender is<br />\nWorthy of his keep, having played<br />\nsteadily since a frosh.<br />\nJohns Hopkins will open with its<br />\noriginal starting line-up, now devoid of any injuries. Naylor and<br />\nSwindell combine with Ghinger to<br />\nfrom the close-in defense with Kahl<br />\nprotecting the nets. Beeler, Himes,<br />\nand Yearley do the cross-country running at the mid-field stations, with<br />\nthe Hardy Hammer drawing for the<br />\nface-off. The line-up is completed<br />\nby Melvin, Kaufman, and Dukehart<br />\nbarging in to dent the cords on the<br />\nforward wall.<br />\n<br />\nMicro Analysis.\" Dr. Corwin has developed a super-sensitive balance for<br />\nthis work, and presented a discusent in weighing to one gamma, the<br />\none-millionth part of a gram, or about<br />\nthe weight of a fair-sized dust speck.<br />\nThe address opened with a presentation of the need for such refinement<br />\nin weights, when dealing with hormones, which at the present cost<br />\n<br />\nInterfering factors, such as the vibrations<br />\nabout $10,000,000 an ounce.<br />\n<br />\nof a passing train or auto, animal<br />\nheat from the human body, and other<br />\ncauses, such as dust, and humidity<br />\nvariations, which are more easily controlled, were discussed. To avoid the<br />\nunpleasant necessity of placing the<br />\nbalance in an hermetically-sealed<br />\nchamber, and observing only through<br />\na telescope, work has been done to<br />\nmake a balance sensitive, and yet<br />\nuseful.<br />\nIt was in connection with this that<br />\nthe discovery was made that a knifeedge of the hardest-known material,<br />\nsharpened so as to be invisible in the<br />\nfield of a powerful microscope as a<br />\nsurface, still showed wide variations,<br />\nwhich were found to be due to the<br />\ndeforming of the edge as the weight<br />\ncame upon it, much as an automobile<br />\ntire flexes under the weight of the<br />\ncar.<br />\nTherefore, since the bearings are<br />\nlifted from the knife-edges when the<br />\nbalance was idle, it .was found that<br />\nthis \"squashing\" resulted in a bouncing motion when the weight of the<br />\nbalance came on<br />\nbearing.<br />\nthe<br />\nElimination of this effect has greatly<br />\nimproved the precision with which<br />\nmeasurements may be made.<br />\nAn unusual side development of<br />\nthis work was the ability, by proper<br />\nmanipulation of the balance, to register the amount a diamond or sapphire<br />\nis compressed by the weight, say,<br />\nof a thin dime.<br />\n<br />\nLETTER TO<br />\nTHE EDITOR<br />\n(Continued from Page 2, Col. 6)<br />\nwon, as the conduct of the players<br />\nof both teams on the field spoke for<br />\nitself. I don't think that there was<br />\na single major penalty during the entire game, and very few others.<br />\nHoping that your season is a successful one, I am cordially,<br />\nLEON A. MILLER,<br />\nCoach of Lacrosse.<br />\n<br />\nTo look at them you'd never know<br />\nit, but 'neath every natty blue uniform that graces and colorfully exalts the J.H. U. Band above any other<br />\nbeat hearts that live in daily fear that<br />\nthose same uniforms may be taken<br />\naway from them! Verily they are<br />\nlike unto the farmer without the<br />\ndaughter to go to the city to work<br />\nher fingers to the bone for him, but<br />\nwith the mortgage.<br />\nLast month the R. 0. T. C., under<br />\nthe urgings of Conrad Gebelein, director of the Band, decided to set<br />\naside a goodly portion of sums delegated to them by the U. S. Government for the purpose of purchasing<br />\nlong-needed uniforms for the Band.<br />\nNot being used to doing things in<br />\na pusillanimous way, the persons who<br />\nwere put in charge of the choice of<br />\na suitable uniform to properly accent<br />\nand accentuate the dignity, the love<br />\nof luxurious drapery, and appreciation for the gaily-caparisoned, did<br />\nnot spare anything to realize their<br />\nideals.<br />\nThe results by this time are hisThe most Oriental-minded<br />\ntory.<br />\ndespot that ever decorated a seraglio<br />\nwith the Most Beautiful of the Fair,<br />\n<br />\nwould be delighted with the beauty<br />\nand elegance of the blue and gold<br />\n(with gold buttons!) of the new uniforms! But unlike the despot, whose<br />\ntaste in the better things in life—<br />\nlike band uniforms—can be gratified<br />\nby a mere wave of the hand, the band<br />\nhad to lay hard cash right on the<br />\nline. Now the boys have just two<br />\nthings to do, either raise the money<br />\nand keep the uniforms, or give them<br />\nback. They have decided to keep<br />\nthe uniforms.<br />\nTo do this they call on the members of the student body of the University for an inconsiderable donation to a raffle. On May 10, at 4<br />\no'clock, there will be a drawing for a<br />\nbrand-new Philco radio in Levering<br />\nHall. Each ticket costs ten cents,<br />\nand offers a chance that each should<br />\njump at—the opportunity of getting<br />\na ,radio for next to nothing.<br />\nBand member are carrying around<br />\nthe little books. If you haven't seen<br />\nthem as yet, come out of your cellar;<br />\nthey'll get to you eventually. . .. No,<br />\nwe do not have a dime to loan you.<br />\nWe haven't any dimes. One of the<br />\nband was in the office five minutes<br />\nago! . . . .<br />\n<br />\nCivils Hold Second University Accepts<br />\nAnnual Conference Grants and Library<br />\nThe Second Annual Conference of<br />\nthe Student Chapters of the American Society of Civil Engineers will<br />\nbe held here at Hopkins on Monday,<br />\nApril 19. The chapters participating<br />\nare those of the Catholic University<br />\nof America, the University of Maryland, the George Washington University, and the Johns Hopkins University.<br />\nThe conference will open Monday<br />\nmorning at 9.30 with registration in<br />\nLatrobe Hall. At 10 o'clock the visitors will be welcomed by President<br />\nIsaiah Bowman.<br />\nAfter President<br />\nBowman's speech of weltome, Dr.<br />\nErnst Cloos, eminent geologist, will<br />\nspeak on a subject of interest to the<br />\nassembled students.<br />\nAt 12 o'clock a buffet lunch will<br />\nbe served at the Faculty Club. After<br />\nthis, the students will make a series<br />\nof inspection trips. It has been arranged to inspect the Chevrolet assembly plant, the Bethlehem Steel<br />\nCo. plant at Sparrows Point, and the<br />\nnew 29th Street Bridge, a concrete<br />\nmonolithic arch, which is now in the<br />\nprocess of construction.<br />\n,Upon returning from the inspection trips the students will again<br />\nmake their way to the Faculty Club,<br />\nwhere a banquet will be held. Mr.<br />\nThomas F. Hubbard, a prominent<br />\nmember of the Engineering Faculty,<br />\nwill be toastmaster, and Dean of Engineering, E. R. Whitehead, will extend the welcome of the Hopkins<br />\nFaculty to the visitors.<br />\n<br />\n\"Kay, what'll<br />\nwe give 'em?\"<br />\n<br />\nAt a recent meeting of the Board<br />\nof Trustees of the Johns Hopkins<br />\nUniversity, gifts were accepted for<br />\nthe University from the Rockefeller<br />\nFoundation, the Carnegie Institute,<br />\nand Dr. Howard Kelly.<br />\nThe Medical School was the recipient of the largest of these. A<br />\n$45,000 grant from the Rockefeller<br />\nFoundation for two years, for the<br />\nsupport of Research in the Pavolovian and Psychobiological Laboratories of the Department of Psychiatry.<br />\nThe Carnegie grant, $10,000, also<br />\nfor two years, is for Endocrine Research, now under the direction of<br />\nDr. John J. Abel of the Medical<br />\nSchool. The Kelly gift, by Dr. Howard A. Kelly, of the Medical School,<br />\nand one of the four original doctors<br />\nof the organization, consists of 584<br />\nbound and unbound volumes on<br />\nAfrica exclusive of Egypt.<br />\n<br />\nMed. School Will Speak<br />\nTo Association<br />\nStudents from<br />\nmany<br />\nmedical<br />\nschools throughout the country wilt<br />\nconvene at the Johns Hopkins Medical<br />\nSchol this weekend in the fourth annual convention of the Association of<br />\nMedical Students.<br />\nThe first meeting will be a luncheon<br />\nat 12.30 tomorrow at the Welch Library, and Dr. Alan Chesney, Dean<br />\nof the Hopkins Medical School, and<br />\nDr. John P. Peters, Professor of Internal Medicine, Yale University Medical School, will speak.<br />\nPanel Discussion<br />\nThe second afternoon meeting at<br />\n2.30 P. M. will be a panel discussion<br />\non \"Problems of Curriculum,\" and<br />\n\"Requirments for Interneship.\" Dr.<br />\nJohn Wyckoff, Dean, New York University College of Medicine; Dr. W.<br />\nW. Oliver, Dean, Long Island College<br />\nof Medici,ne, and Dr. E. K. Marshall, Chairman of Curriculum Committee,<br />\nJohns<br />\nHopkins<br />\nMedical<br />\nSchool, will speak, and several students will also report.<br />\nAt 7.30 P. M., there will be a dinner<br />\nheld at Levering Hall, and a Forum<br />\non \"Medicine and Social Security\"<br />\nwill be held. Dr. Mary Van Kleeek,<br />\nRussel Sage Foundation, will speak<br />\non \"Economic Aspects of Social Security\"; Dr. James Warbasse, President of the Cooperative League of<br />\nAmerica, will speak on \"Social Security and Medical Care.\"<br />\nOn Sunday morning business sessions will be held, and Dr. Henry E.<br />\nSigerist, Director of the History of<br />\nMedicine Institute, will give the closing address.<br />\nThere is a $2 registration fee for<br />\nthe convention, and Pre Med Students in their last year are invited<br />\nto attend. Registration will be held<br />\ntoday at Levering Hall at the \"Y\"<br />\noffice.<br />\n<br />\nEARN<br />\n<br />\n$40 $75<br />\nA WEEK<br />\n<br />\n\"Music and Rhythm<br />\nHal, everybody<br />\nloves it!\"<br />\n<br />\nScabbard and Blade<br />\nPicks New Members<br />\nThe Scabbard and Blade, honorary<br />\nsociety of the Hopkins R. .0. T. C.,<br />\nhas announced that membership has<br />\nbeen awarded to eight new men. The<br />\nhonorary society, membership in<br />\nwhich distinguishes one for particular excellence in the R. 0. T. C.,<br />\nelected<br />\nJoseph<br />\nHanicka, Walter<br />\nRuggeberg, Charles Mewshaw, James<br />\nGriffin, James Alexander, William<br />\nKempton, William Kier, and William<br />\nStegmaier.<br />\n<br />\nBirely's Pharmacy<br />\nST. PAUL AT 33RD STREET<br />\nPrescriptions--School Supplies<br />\nSeudwiches<br />\nUnexcelled Fountain Service<br />\n<br />\n1<br />\n•.............••••••••••••••-•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••-•••••••••••••••••••••••••••••••••••-••••••••••••<br />\n<br />\nSTRIKE AGAINST GLOOM!<br />\nFOR A REAL PEACE MEETING<br />\nCOME TO<br />\n<br />\nSUMMER POSITIONS for STUDENTS<br />\n• You can use your<br />\neducational training<br />\nand earn extra money<br />\nthis summer. This unTO<br />\nusual opportunity for<br />\neducational extension<br />\nwork in the home is<br />\nextremely interesting.<br />\nMany students have been exceptionally<br />\nsuccessful and have found it the solution to their financial problem. Write<br />\nfor full details and proof of results at<br />\nonce.<br />\nTILE JOHN C. WINSTON COMPANY,<br />\nHome Extension Department,<br />\nPhiladelphia, Pa.<br />\nl012 Arch Street<br />\n<br />\nOnce again we have a defender of<br />\nthe use of the word \"ain't.\" This<br />\ntime it is the eminent Professor Harold H. Bender, who obtained his doctorate from this University and is at<br />\npresent chairman of the department<br />\nof Oriental Languages and Literature<br />\nof Princeton. He asserts that it is<br />\nperfectly respectable to say \"It ain't<br />\nso,\" whether disputing about the Supreme Court, the C. I. 0., or a lacrosse game.<br />\nDr. Bender is considered one of<br />\nthe world's best philologists and<br />\netymologists. In the course of thirtytwo years of word-sleuthing, one of<br />\nhis most interesting bits of detective<br />\nwork ( which, incidentally, is of especial interest to some of us), had<br />\nto do with man's early drinking customs and habits. This was a result<br />\nof tracking down the homely \"highball.\" He found, strangely enough,<br />\nthat throughout the centuries in IndiaEuropean countries, when dynasties<br />\nrose and fell, and thousands of words<br />\nmight be jettisoned, the name of the<br />\nfavorite intoxicating drink of the<br />\nprimitive tankard-wavers and elbowbenders remained unchanged.<br />\n<br />\nTHE<br />\nFRESHMAN - SOPHOMORE<br />\nMinnow ..•<br />\n<br />\nDANCE<br />\nTONIGHT—MARYLAND CASUALTY<br />\n<br />\nBUBBY JOHNSON'S MUSIC<br />\n9'TIL 1<br />\n<br />\n$1.25<br />\n<br />\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••............•••••••••••................................•••<br />\n<br />\nSay, Fellows—Here's Your Shoe!<br />\n$5.50<br />\n<br />\n,<br />\nHESS<br />\n<br />\nW<br />\n<br />\n137<br />\n<br />\nCosmopolitan Club Will<br />\nHear Illustrated Talk<br />\nAn illustrated talk entitled, \"Suicide Fleet,\" will be given before the<br />\nCosmopolitan Club this Saturday,<br />\nApril 17, at 8.30 P. M., in Levering<br />\nHall by Cnarles Bullen, vice-president of the club.<br />\nDan deLima, president of the Cosmopolitan Club, said of the discourse,<br />\n\"It will discuss the events leading up<br />\nto and the sinking of a German fleet<br />\nof seventy battleships which the Germans themselves sank.\" Eullen will<br />\nthen go on to explain how said ships<br />\nWere recovered by a British cornmany.\"<br />\nEveryone is invited to attend the<br />\nMeeting, after which refreshments<br />\nWill be served.<br />\n<br />\n-'1;*t<br />\n.<br />\n,<br />\na4.•<br />\n•<br />\n<br />\nAT ALL 3<br />\nHESS SHOPS<br />\n<br />\nofirtDciit, 0<br />\n\" 4°44<br />\n<br />\nALL<br />\nCOLUMBIA<br />\nSTATIONS<br />\n<br />\n•<br />\n•<br />\n•<br />\n•<br />\n<br />\n111-1<br />\n<br />\nGenuine \"Ruff-It\" Leather!<br />\nGrey, Brown and White!<br />\nHefty Crepe Rubber Sole!<br />\nSlick wing-tip! Tricky perforations!<br />\n<br />\nS<br />\n<br />\nSoles of Honor Since 1875<br />\n<br />\nTHE FIRST PRODUCT TO HOLD TWO NATIONAL RADIO AWAR.DS<br />\n<br />\n8 East Baltimore Street<br />\n312-14 Howard Street<br />\nCharles at 21st<br />\n<br />\n\fHOMEWOOD, BALTIMORE, APRIL 16, 1937<br />\n<br />\nJay Baseball<br />\nNine Defeated<br />\nBy Greyhounds<br />\n<br />\nFencing<br />\n<br />\nI Swarthmore Swamps Jay Track Squad<br />\nI<br />\nBy 97-28 Score At Media Saturday<br />\n<br />\nTennis<br />\n<br />\nJAY GOLFERS WIN<br />\nFIRST 1937 MATCH<br />\n<br />\nThe Johns Hopkins fencers lost the<br />\nThe Blue Jay Varsity Tennis Team,<br />\nThe Blue Jay golfers made a sucThe sharp piercing report of a crossed the finish line in that order.<br />\nThree Team Middle Atlantic chamwhich has been practicing regularly,<br />\nLankford showed excellent form in is gradually rounding into shape for cessful debut by defeating the Philapionship title to the University of pistol carried across the vast staMaryland. The Jays lost by the nar- dium; six runners leaped from their the 220-yard sprint. Pulling up from the current tennis campaign. The re- delphia College of Osteopathy<br />\nin •<br />\ncrouching positions, and the 1937 behind with a terrific last stretch cent poor weather conditions canrow<br />\nmargin of one point, 18 to 17.<br />\nAlperstein, Stevens And Hartke<br />\nteam match on April 13 .by the score<br />\ntrack season was officially under way. \"kick,' he banged past Spencer and celled the early season matches.<br />\nShow Excellence At Bat;<br />\nHopkins secured the first team<br />\nof 4-2. Bill Wagner, Bill Miller, Bob<br />\nLast Saturday, the Hopkins track- slammed home in good time.<br />\nLast year's record was six matches<br />\nCarper's 1st Game<br />\nchampionship by defeating St. Johns<br />\nDunning<br />\nand Holt Maulsby represters locked horns with the SwarthThe Jay entries in the high jump won with seven lost against strong<br />\n5-4, and Maryland 6-3. The ever demore Garnets; and when the final and pole vault couldn't compare with Intercollegiate competition. The 1937 sented the Johns Hopkins golfers.<br />\nThe Blue Jay baseball team lost its pendable Phil Small and Sherman<br />\ntallies had ben recorded, the Garnets the Garnet performers. In the run- Jay squad has hopes of bettering<br />\nThe club handlers played Swarthfirst league game last Monday to a starred in the final matches, Small stood ahead by the score<br />\nof 97-28.<br />\nning broad jump, Kephart captured the '36 record under the leadership<br />\nmore<br />\nwinning<br />\nof<br />\n6<br />\nSherman<br />\n7,<br />\nout<br />\nand<br />\nCollege at Rolling Green in<br />\n9-5.<br />\nof<br />\nscore<br />\na<br />\nnine<br />\nby<br />\nstrong Loyola<br />\nFrequent flurries of snow and tin- a third.<br />\nof Captain Robert Brown. The loss<br />\n4 out of 6.<br />\nPhiladelphia,<br />\nApril 14. They lost by<br />\naffair<br />\nwelcomed<br />\ncoldness proved a major<br />\nThe game was a seven-inning<br />\nSuperiority of the Maroons in the of last year's star and leader, Carl<br />\nJays Lose Epee, Sabre<br />\nthe<br />\nscore<br />\nof<br />\n4-2.<br />\nhandicap<br />\nto<br />\nboth<br />\nsquads.<br />\nThe<br />\ngreen<br />\nhalf<br />\nand<br />\nHopone<br />\nmile evidenced itself as Hartman, was a severe setback to<br />\nby mutual agreement, and the<br />\nThe Blue Jays, however, were not Jay battalion with hardly three full<br />\nrunners clad in maroon togs crossed J. H. U. hopes.<br />\nDunning and Miller won their<br />\nkins' rally in the seventh when it so fortunate in the epee and sabre<br />\nweeks of worthwhile practice definite- the finish line in 1, 2, 3 order in both<br />\nThe<br />\nfollows:<br />\nline-up<br />\nmatches<br />\nwhile Wagner, Maulsby,<br />\nscored three runs, showed that the matches. In the epee matches, Mary- ly exhibited<br />\nthat fact. With but one tests.<br />\nCaptain Bob Brown, first; Bill Dave Halle and Webster lost.<br />\nscore might have been different had land beat Hopkins 3 to 1, and St. letterman participating, Coach HamAnother Jay Triumph<br />\nLamble, second; Henry Kramer,<br />\nJohns defeated Hopkins 3 to 1. In bleton had more than the<br />\nthe game gone nine innings.<br />\nnormal<br />\nAnother Jay triumph came in the third; Jerry Branower, fourth; Bill<br />\nthe sabre matches, Hopkins defeatedshare of worries.<br />\nseverest trial of all, the two-mile race. Lamed, fifth; and Bob Radcliffe,<br />\nMilt Alperstein, Jay second baseSt. Johns 3 to 1, while Maryland. ran The inaugural event of the after- The<br />\nrace consisted of ten turns sixth.<br />\nman, led the Hopkins attack with over Hopkins 3 to 1.<br />\nnoon's festivities was the 440-yard around the complete track. For the<br />\nThe doubles teams have not been<br />\nthree hits, all of them singles, and<br />\nPhilip Small of Hopkins easily dash, when Lankford forged ahead first few laps, it was Scharpf and formed as yet. Nat<br />\nSoifer, a Junior,<br />\nJohnny Stevens displayed a flash of gained the Middle Atlantic Single around the first two turns. At the Driscoll digging<br />\nand staying in the and George Thaler, a Freshman, are<br />\npower with his triple in the sixth Foil Title by defeating Levine of third turn, Kirchlager of Swarthmore fore, and Purcell of Swarthmore was new additions to the squad.<br />\nMaryland 5-3. Levine placed second. coasted into the number one spot and about 20 yards behind.<br />\ninning.<br />\nAtwater of St. Johns won the indi- was never headed as he raced to the<br />\nAt the eighth lap it was still<br />\nHurls First Game<br />\nvidual<br />\nepee championship and Hei- finish line.<br />\nDesperatcly Lankford Driscoll in the number one position,<br />\nITPAYS TO GO TO THE<br />\nCarper, a converted outfielder,<br />\nman of Maryland won the individual strove to overtake the Garnet speed- with Scharpf only yards ahead of<br />\nthe<br />\nhurled his first game and showed sabre championship.<br />\nThere were ster, but all he could do was place a Swarthmore foe. Slowly the Swarthsome signs of promise, although he gold and silver medals awarded<br />\nfor second.<br />\nmore lad closed the gap and worked<br />\nwas a trifle wild. He pitched himself the individual championships.<br />\nNOW PLAY/N6-•<br />\nWithout a spirited<br />\nGarnets Take Shotput<br />\nInto second place. At the tape it was<br />\ninning<br />\nWhen<br />\ninto a hole in the first<br />\nMUNI../N H/S<br />\nMeanwhile the strong-armed lads Driscoll, Purcell, Scharpf in that<br />\nVince,<br />\nJoseph<br />\nOlymcoach<br />\nof<br />\n1936<br />\ntwo runs were scored and was<br />\nGREATEST AND/<br />\npic Team and coach of New York of both groups were testing their order.<br />\ntouched for six runs in the fifth<br />\nLATES<br />\nOLE./<br />\nStop in for a try-on.<br />\nUniversity College, officiated. An ex- prowess with the 16-pound shot. The<br />\ninning.<br />\nSchloss prices are within<br />\nhibition match was given by Coach heaves of Carlton, Steingrob, KerHopkins scored a run in the sebond<br />\nSOCCER NOTICE<br />\nyour means<br />\nPaul Kaiss and Joseph Vince in the stetter and Zheutlin couldn't match<br />\nInning when an error, a wild pitch, three-weapon foil, sabre and epee.<br />\nthose of the Philadelphia athletes. In<br />\nA picture of the Johns Hopkins<br />\nand a single by Alperstein enabled<br />\nElection for captain of the '38 sea- these opening two events, the Maroon<br />\nSoccer Team will be taken for the<br />\nSmith to get home. The Jay team son will be held in the near future and White piled up a strong lead.<br />\nrang the bell again in the fifth inning at the Barn.<br />\nThe Garnets swept the hurdles, Hullabaloo on Tuesday afternoon,<br />\nApril 20, at 4 o'clock at the Gym.<br />\nwhen Hartke, the Hopkins steady<br />\nhigh and low. In the latter, Pearson<br />\nshortstop, doubled, and Clisham drove<br />\nof Swarthmore ran an outstanding<br />\nhim in with a single to center field.<br />\nrace.<br />\nSOFTBALL<br />\nIn their half of the seventh the<br />\nCaptain Graziano gave the Jays<br />\nBlack and Blue team staged a threeIn the Interfraternity Softball their initial first place in the javelin.<br />\nEast Lexington St.<br />\nrun rally when Hartke and Zavert- League, Beta Theta Pi and Alpha The husky leader flung the spear 160<br />\n(no wh<br />\nGift)<br />\n• ON<br />\nS Ty? G<br />\nRubinpinch-hitter<br />\nand<br />\nwalked,<br />\nnick<br />\nTHE WORLD FAMOUS ORGANISTS<br />\nEpsilon Pi are leading Division A feet 1 inch.<br />\nger and Alperstein singled. However,<br />\nJewelers and Opticians<br />\nA4R..4~1 44RS.<br />\nAttention now turned towards the<br />\nwith two wins each, leaving Delta<br />\nthe rally was cut short when Carper<br />\n100-yard<br />\ndash.<br />\nGross of Swarthmore<br />\nUpsilon and Delta Phi on the botAT THE CONSOLES OF THE<br />\nfanned, and Romanofsky flied out to<br />\nshot out of the \"holes\" at top speed<br />\ntom with two losses.<br />\nPEN and PENCIL SETS<br />\nTWIN ELECTRIC ORGANS<br />\nJ. H. FURST CO.<br />\nleft field.<br />\nat<br />\nthe 40-yard was leading the<br />\nIn Division B, no team having and<br />\ngad. OTHER. BIG ACTS s<br />\nPrinters of<br />\nThis week-end the Hopkins nine<br />\nas yet played two games, S. P. E., pack. Baetjer began his power drive,<br />\nPHILOLOGICAL<br />\nand<br />\nwill travel to Philadelphia to encounBALT/NORES.,ONLY,DOWN<br />\nTau Alpha Phi, and Phi Eps are and at the 60-yard marker he was<br />\n3222 Greerunount Avenue<br />\nSCIENTIFIC PUBLICATIONS<br />\nter Drexel on Friday and Swarthmore<br />\nTOWN<br />\noutdistancing<br />\nDELUXE<br />\nSHOW<br />\nSTAGE<br />\nall.<br />\nGraziano<br />\ncame<br />\nup<br />\nleading with one win each.<br />\n12-20 Hopkins Place<br />\non Saturday.<br />\nfast to hold second position. They<br />\nBaltimore<br />\n<br />\nWHAT'S<br />\nSPRING<br />\n<br />\n11 tiiI7T3<br />\n<br />\nnew<br />\nSchloss Suit or Topcoat<br />\n<br />\nAS LOW AS $3,<br />\n<br />\nJos. Schloss<br />\n& Son<br />\n<br />\nKIBLER'S<br />\n<br />\n5<br />\n<br />\nJESSE CRAWFORD<br />\n<br />\n-,<br />\n•<br />\n<br />\n, Smokers always get more<br />\npleasure from a cigarette made of<br />\nthe right combination of our best<br />\nhome-grown tobaccos blended with<br />\nthe best aromatic Turkish.<br />\nThat's why Chesterfield tobaccos<br />\ncome from far and near.... aromatic<br />\ntobaccos from the Near East...sunripened tobaccos from our own<br />\nSouthland.<br />\nOur buyers pay the price and get the<br />\nbest tobaccos from all the leading<br />\nmarkets of the world to give men<br />\nand women the best things smoking<br />\ncan give them ... refreshing mildness, pleasing taste and aroma.<br />\n<br />\n..a &lanced Wendfthe<br />\nworldsfinest cigarette idaccos<br />\nCopyright 1937. Liccrrr & MYERS TOBACCO Co.<br />\n<br />\n\f", "format": "basic_html", "processed": "MEM<br /><br />\n53<br /><br />\n11-<br /><br />\nIs,<br />\nor<br />\ned<br /><br />\nhe<br />\nrs.<br />\n11to<br />\nrs.<br />\nus<br />\n;id<br />\nhs<br /><br />\nAttend FreshmanSophomore Dance At Md.<br />\nCasualty, April 17!<br /><br />\nlhitpuilOopitins Nrtnoirttrr<br /><br />\nIS THERE<br />\n'A Moratorium On Truth'<br />\nSEE EDITORIAL ON PAGE 2<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 16, 1937<br /><br />\nVOL. XLI, No. 34<br /><br />\nDouble Feature<br />\nStars Lacrosse<br />\nAt Homewood<br />\nHopkins And U. of P. Will<br />\nPlay First; Followed By<br />\nMd.-Mt. Wash. Tilt<br />\nBLUE JAYS CONFIDENT<br />\nTwenty Of Nation's Best<br />\nWill Exhibit Wares In<br />\nSecond Session<br /><br />\nH. H. Lloyd Elected To<br />\nPresidency Of Y. M.C. A.<br />\n-—<br />\nHarold Huntley Lloyd, editor of<br />\nthe \"Y\" News, was elected president of the Hopkins Y for the ensuing year. Others elected were:<br />\nLawrence Hanawalt, vice-president.<br />\nCharles Swartz, vice-president.<br />\nBoyd Frey, treasurer.<br />\nHammond Brown, secretary.<br />\nHanawalt is chairman of the<br />\nSupper Club; Swartz is chairman<br />\nof the Speakers' Bureau; Frey is<br />\nchairman of Freshman Activities.<br /><br />\nGilman Hall Picked<br />\nAs War Strike Site<br /><br />\nPRICE 5 CEN'Ill<br /><br />\n'Dr. H. D. Lasswell Playshop Will Give Freshman-Sophomore Dance<br />\n1 Will Speak Today Musicale to Honor Substitutes<br />\nPeace-Plan<br />\nOn Propaganda Russ Poet-Author<br /><br />\nFor Hal-Week Program<br /><br />\nJames Schouler Lecture To Alexander Pushkin's Centennial Will Be Observed By<br />\nBe Given At Latrobe<br />\nDance Slated For Tonight<br />\nR.O.T.C. To Hold<br />\nCelebration Friday<br />\nHall<br />\nAt Maryland Casualty<br />\nBall At Levering Hall<br />\nClubhouse<br />\nWalter Lippmann Of New Dr. James Bunyan Of Page<br />\nThe Townsmen Orchestra will<br />\nSchool Is Included On<br />\nYork Herald-Tribune To<br />\nbe the musical struts of the R. 0. STARTS<br />\nAT NINE P. M.<br />\nT. C. Military Ball, coming Friday,<br />\nProgram As Speaker<br />\nSpeak Wednesday<br />\nApril 30, to the Hopkins. CulmiMiss Betty Facer, Of<br />\nOn Friday evening, April 16, the nating a month already full of<br />\nDr. Harold Dwight Lasswell, Asimportant<br />\nsocial<br />\nevents, the ball<br />\nRochester, Chosen Sponsociate Professor of Political Science Playshop, under the direction of Dr.<br />\nIs awaited with impatience and<br />\nat the University of Chicago, will N. B. Fagin, will observe<br />\nthe centen- interest.<br />\nsor Of Affair<br />\ngive the James Schouler Lecture at<br /><br />\nnial of the death of Alexander SergLevering Hall will be the scene<br />\nLatrobe Hall today at 5 p.m.<br />\nHe<br />\nBy J. MURRAY KEMPTON<br />\npoet, of the affair, which will start at<br />\nwill speak on the topic Propaganda yeevitch Pushkin, Russian<br />\nThe class struggle at the Hopkins<br />\nnational lacrosse attention this Satnine<br />\nand<br />\nhave<br />\nits<br />\ncurfew<br />\nat<br />\none.<br />\nnovelist, and playwright of the early<br />\nBattles in Modern World Politics.<br />\nNo sponsor has at yet been named Is no more. The bloody spring days,<br />\nurday afternoon when three of the Porch To Be Scene Of StuOn Wednesday, April 21, Mr. Wal- nineteenth century. The program is<br />\nfor the dance, but will be an- just two years ago, when brother<br />\nbest-developed squads in the counter Lippmann, special writer for the to include a short address by Dr.<br />\ndent Demonstration For<br />\nnounced next week. Admission by struggled against brother and<br />\ntry face-off, with Johns Hopkins<br />\nfranNew York Herald Tribune, will de- James Bunyan, of<br />\nthe Page School<br />\ninvitation by a member of the R. tic Freshman<br />\nPeace<br />\nmeeting the University of Pennsylmet strongarm Sopholiver a speech on the subject, The<br />\nof International Relationships, and 0. T. C., exclusively, will cost $1.25<br />\nvania and the Maryland Terrapins<br />\nmore at the brink of the Levering<br />\nRise of Personal Government in the<br />\na couple. Tickets may be bought<br />\nThe steps of Gilman Hall have<br />\nopposing the Mount Washington<br />\nStates.<br />\nMr. Lippmann's music by the great masters, inspired<br />\nUnited<br />\nHall<br />\npond, are gone with the horse<br />\nif invitation is given, at Levering<br />\nClub in a two-game stick festival. been selected as the site for the com- address is also under the sponsor- by the poetry of Pushkin. Dr. Fagin<br />\nand<br />\nbuggy.<br />\nHall,<br />\nThe home team is to take the field ing Student Strike Against War at ship of the James Schouler Lectures.<br />\nwill preside at the meeting.<br />\nInstead, not a stone's throw from<br />\nagainst the Quakers at approximateStudied<br />\nPropaganda<br />\n11 a.m. this Thursday. It will mark<br />\nThe musical portion of the evening<br />\nly 1:30 p.m., while •the night thrills<br />\nthe<br />\nscene of yester-year's epic conDr. Lasswell has made a special<br />\nthe second year that the strike has<br />\nis under the direction of Dr. Lubov<br />\nwill begin at 3:30.<br />\nflict, the Freshmen and the Sophostudy of propaganda and its political<br />\nThe Blue Jays do not expect much been held on this spot.<br />\nuses, and has written a number of Keefer, teacher of Musical History<br />\nmores, arrayed in their best, are to<br />\nIn addition, the committee in books on this subject. He is the in the Department of Education.<br />\nof a skirmish in their encounter with<br />\nmeet at ten tonight, in the Maryland<br />\nthe Pennsyl boys. For the past few charge of the meeting released yes- author of such books as Propaganda Artists to be heard will include Mrs.<br />\nCasualty<br />\nclubrooms, for the second<br />\nyears the Hopkins' tens have started terday a tentative<br />\nprogram of events. Technique in the World War, and has Anna Breit, soprano; Polyandros Koannual Frosh-Soph dance, as the culslowly. Like a phonograph, they<br />\nhelped<br />\nto<br />\ncompile<br />\nPropaganda<br />\nand<br />\nTentative speakers include members<br />\nrnianos, violinist; Stuart le Compte, Members Of Faculty And<br />\nfunction smoothly, but it seems as<br />\nmination of a spring \"love feast,\" in<br />\nPromotional Activities, which is an<br />\nof<br />\nthe<br />\nacademic<br />\nbaritone; and Dr. Keefer, pianJr.,<br />\nfaculty,<br />\nand repre- annotated bibliography prepared<br />\nthough no one is able to apply the<br />\nSociety Vouch For Pres- which Hell Week has been a droopunneedle to the rubberized disk until sentatives from labor and church der the supervision of the advisory ist. Final selections are not yet made<br />\ning shadow of its former lusty self.<br />\nident of A. S. U.<br />\nhalf of the spring strength has been groups. Students representing vari- committee on Pressure Groups and concerning the numbers, but a full<br />\nJohnson On Bandstand<br />\nexhausted.<br />\nous groups on the strike committee Propaganda of the Social Science Re- evening is promised.<br />\nBubby Johnson and his orchestra<br />\nA protest meeting concerning the<br />\nTwenty Champions<br />\nsearch Council. He has also written<br />\nare also slated to speak.<br />\nThe celebration will be held in La- rejection of Maurice Shils, chairman are slated to preside over the cereTwenty of the most adept 'crosseIn the meanwhile, the roster of the Psychopathology and Politics, and trobe<br />\nof the A. S. U. at the Hopkins, for monies. The committee, basing its<br />\n120, at 8.30.<br />\nmen in America feature the afterPolitics—Who Gets What, When,<br />\nadmission into Phi Beta Kappa, drew hopes on Mr. Johnson's reputation,<br />\ncommittee was swelled to thirteen<br />\nCourt Favorite<br />\nnoon's frolics in the Maryland-Mt.<br />\nHow?<br />\nan<br />\nattendance of 400 into Latrobe as well as the attraction of an<br />\nThe clubmen when the Barnstormer Club, campus<br />\nWashington joust.<br />\nAlexander Pushkin was born in last Friday at<br />\nWalter Lippmann, well known au1.00. The meeting amicable meeting between the lion<br />\nrated the championship in their di- theatrical group, last week announced thor and lecturer, is at the present 1799, and was a court favorite during was<br />\nintended as a request to the and the lamb, has set the admission<br />\nvision last spring, with the Terps oc- its intention of participating. Other time, a special feature writer for the<br />\nhis life, save for a brief period of honorary scholastic fraternity to re- at $1.25.<br />\ncupying the same niche in collegiate organizations now represented<br />\nMiss Betty Facer, daughter of Mr.<br />\nin- New York Herald Tribune, and many political exile, from which he was consider its action and elect the camendeavor. It goes without saying clude the Student Council, the<br />\npus liberal leader to membership.<br />\nand Mrs. Luke D. Facer, of Rochester,<br />\nDe- other newspapers. He was formerly<br />\nthat such individual luminaries as bating Council, the American Stu- editor of the old New York World, recalled through the pressure of his<br />\nThe speakers were: Donald Emer- N. Y., has been selected as sponsor<br />\nEffinger, Neilson, Lindsay, Yeager, dent Union, the Student Activities and associate editor of the magazine, wife at court. Friend of Czar Nichoson, undergraduate member-elect to of the dance. Miss Facer, a senior<br />\nand Hewitt of Maryland , and the Committee, Omicron Delta Kappa, The New Republic.<br />\nlas I, and first great poet of the Rus- the<br />\nsociety; Dr. Frederic C. Lane, at Notre Dame, will have as her<br />\nHillmen's Guild, the Turnbull Duo, Phi Sigma Delta, Phi Alpha,<br />\nPhi<br />\nPolitical Commentator<br />\nsian language, it is to him that the associate professor of history; Dr. escort, Harry M. Hopkins, chairman<br />\nBeeler, Steiber, and Stude will pro- Epsilon Pi, the NEWS-LETTER, the<br />\nMr. Lippmann has written many present Soviets turn as the national Albert E. Blumberg, instructor in of Hell Week.<br />\nvide sufficient tasty food for any la- Hullabaloo, the Young<br />\nMr. Johnson and his invaluable asCommunist books on American politics. Among spirit<br />\nof the Russians. His works in- philosophy; Stanley Rappeport, gradcrosse epicure.<br />\nLeague, and the Y. M. C. A.<br />\nsistants<br />\nseem to have set out to esthem are, A Preface to Politics, The clude many great poems,<br />\nuate<br />\nstudent<br />\nin<br />\npolitical<br />\neconomy;<br />\nwhich have<br />\nThe Red and Blue of Pennsylvania<br />\nMorris Shils, chairman of the Political Scene, Public Opinion, and<br />\nDr. Broadus Mitchell, associate pro- tablish something of a tradition of<br />\nbeen<br />\nset<br />\nto<br />\nmusic<br />\nby<br />\ngreatest<br />\nthe<br />\ncross sticks with Hopkins for the American Student Union, which is The Method of Freedom. He is also<br />\ntheir own. This year will mark the<br />\ncomposers of the past; Opera libret- fessor of political economy.<br />\nfirst time in four years on Saturday. among the organizations supporting a contributor to such magazines as<br />\nsecond occasion on which they have<br />\nToward<br />\ntos,<br />\nwhich<br />\nof<br />\nthe<br />\nthe<br />\nmost famous are<br />\nclose of the meeting,<br />\nThe Philadelphia athletes are big, the strike nationally, last Tuesday The Atlantic Monthly, Harpers, Vanlent their efforts to a Freshman-So\"Boris Goudenov,\" and \"Eugene Dr. William Gates, who studied at<br />\nrangy, and extremely fast.<br />\nissued a report of its progress else- ity Fair, and Foreign Affairs. At the<br />\nphomore dance.<br />\nLast year the<br />\nthe<br />\nHopkins \"when it was six years<br />\nOnegin,\" both part of the MetropoliHalstead and Righer, gridiron where. This year, according to re- present, Mr. Lippmann is writing a<br />\nhonors<br />\nwere shared by Rudy Killain<br />\ntan Opera Company's repertory; and old,\" unexpectedly rose from his<br />\nand His Kadets.<br />\nstars, man the point positions to port, will mark the largest demon- new book, Good Society, in which he<br />\nseveral novels--the best known being front-row seat and praised the \"spirit<br />\nform with Gisburne a veritable bulk stration in history, with more than a attempts to show the reasons for the<br />\nAesthetes Enthusiastic<br />\n\"Queen of Spades,\" theme of an oper- of the meeting in defending academic<br />\nThe<br />\nof defense. Their ability to close in million students slated to walk out decay of 19th Century Liberalism,<br />\naesthetes who are fitted to<br />\netta in light vein, by a later composer. freedom.\"<br />\npass an opinion on such matters are<br />\non dodging attackmen is still ques- of classes.<br />\nand the failure of Collectivist society.<br />\nDr. Stull Holt, Associate History<br />\nThe observation of the greatness<br />\n(Continued on Page 3, Col. 1)<br />\nnothing if not enthusiastic about Mr.<br />\nof Alexander Pushkin is lent addi- Professor, who was unable to attend,<br />\nJohnson's efforts. He is a specialist,<br />\ntional timeliness because of the trend had the following statement read<br />\nthey will tell you, in that particular<br />\nin the modern Soviet Union toward his from the platform: \"It seems to me<br />\nbrand of stomp rhythm usually<br />\nworks. Formerly, in the early days particularly unfortunate that those<br />\nlinked with the name of the eminent<br />\nof the revolution, he was regarded as who blackballed Mr. Shils did not<br />\nFletcher Henderson.<br />\nJohnson and<br />\nthe poet of the aristocracy, pampered explain the reasons why they reCo. have been carrying the Henderdarling of a dissolute court—but of jected the recommendation of the<br />\nDr. Norbert Wiener Will Speak On<br />\nson torch with such entire success<br />\nCarbohydrate Production In Plants Explained By Series Of late, despite this, the greatness and executive committee.<br />\nThe Subject Of \"RandomBy keeping that their<br />\nperegrinations on this misness\"<br />\nvigor of his works, have brought him silent they have made it possible for<br />\nChemical Energy Changes; New Theory<br />\nsion have led them over the entire<br />\ninto the fold of the approved poets. people to believe that Mr. Shils' views<br />\nSouth.<br />\nPublished In Physics Journal<br />\nDr. Norbert Wiener, professor of<br />\nHis contact with the Czar is mini- and his activities as president of the<br />\nmathematics at the Massachusetts<br />\nmized, and great stress laid upon the American Student Union determined<br />\nA new theory of photosynthesis has plants during photosynthesis in terms<br />\nInstitute of Technology, will deliver<br />\nexile for political reasons. And in- the vote.\"<br />\nanother in the series of Dohme Lec- ben put forward by Dr. James of the ordinary laws of Physics and deed, as the first great exponent of<br />\nFranck, Professor of Physics at the<br />\ntures next Friday at 4.00 P. M. in<br />\nChemistry without resort to unknown realism and sincerity in writing, he<br />\nSchedule Of Hullabaloo<br />\nJohns<br />\nHopkins University, and Proroom 1, Remsen Hall, on the subject,<br />\nbiologic forces. It presents the pro- set a model for Russian literature<br />\nfessor Karl F. Herzfeld of the Catho\"Randomness.\"<br />\nrise<br />\nwhich<br />\ngave<br />\nto<br />\ngreat<br />\nmen<br />\nPictures Announced Residents Engage Lecturer In Three<br />\nsuch<br />\nas<br />\nduction of sugar and starch as taking<br />\nlic University. It has just been pubHour Discussion Of Court<br />\nTolstoy<br />\nDostoyevski.<br />\nand<br />\nDr. Wiener, born in Columbia, Mislished in the April issue of the Jour- place in four successive chemical<br />\nRobert Austrian, editor-in-chief of<br />\nChange Proposal<br />\nHis works are entirely threaded<br />\nsouri, 43 years ago, was graduated<br />\nsteps<br />\neach<br />\nat<br />\nof<br />\nwhich<br />\na<br />\nsingle<br />\nquannal of Chemical Physics.<br />\nthe<br />\nHullabaloo,<br />\nyesterday<br />\nannounced<br />\n1910<br />\nin<br />\nwith<br />\nCollege<br />\ntradition<br />\na<br />\nwith<br />\nthe<br />\nTufts<br />\nof<br />\nRussia as he<br />\nfrom<br />\nBy describing the production of tum, or tiny pulse of light energy is<br />\nMr. Leon Sachs of the Economics<br />\nheard it in the folk-lore and songs of that all team and activity pictures<br />\nbaccalaureate degree. Studying at<br />\nsugars and starches in plants in absorbed per molecule. The choromust<br />\nbe<br />\ndepartment<br />\ntaken<br />\nat the Hopkins delivered<br />\nthis<br />\nweek.<br />\nThis<br />\nstate1910-1911<br />\nseason,<br />\nthe people. He has been referred to as<br />\nCornell during the<br />\nterms of a plausible series of chem- phyll captures the light quanta and<br />\nment followed a conference with the an address to Dorm<br />\nresidents,<br />\nChaucer<br />\nof<br />\nRussia,\"<br />\n\"the<br />\nfor<br />\nhe went to Harvard, where he re- ical<br />\nhis<br />\ngreat<br />\ntheir<br />\ntransfers<br />\nenergy<br />\nto the carbon<br />\nand energy changes, the new<br />\nwork in setting Russian as a language printers, in which it was decided to Wednesday night, and thus consticeived his Master's degree in 1912.<br />\ndioxide<br />\nwater.<br />\nand<br />\nA<br />\nplant<br />\nprotein<br />\ntheory provides another step toward<br />\ntuted \"one of the most successful and<br />\non a plane of its own. One hundred issue the book earlier than usual.<br />\nGoing abroad in 1913, he visited the<br />\nbetter understanding of this acts as catalyst for the intermediate<br />\n\"A schedule has been made up by instructive features of the series of<br />\nyears ago, at the age of thirty-eight,<br />\nCambridge University, where he re- process<br />\nreactions.<br />\nwhich is essential for the<br />\nPushkin fell on the field of honor, the photographer for next week. addresses sponsored by the Dormimained until 1915, and worked at continuance<br />\nExplains Plant Behavior<br />\nof plant and animal life.<br />\nterminating the career of the great- Should the manager of the activity tory Activities Committee,\" accordGottingen in 1914. From 1914 to<br />\nThe slow oxidation of all organic matOne of the phenomena of photofail to arrange for the picture, or ing to Bernard Pinck, chairman of<br />\nest<br />\nof the Russian authors.<br />\n1915, he held the Sheldon Traveling<br />\nter to furnish the energy for life de- synthesis which the theory explains<br />\nshould the team fail to appear, then that committee. Mr. Sachs spoke on<br />\nFellowship from Harvard.<br />\nmands constant supply of food in or- in a simple way is that of light \"satthe photograph of that activity will the proposal to change the make-up<br />\nReturning to America in 1915, Dr. ganic form, and ceaselessly burns uration.\" Under ordinary<br />\nlight in- Johnston Awards Announced absolutely<br />\nnot<br />\nappear<br />\nin<br />\nthe of the Supreme Court.<br />\nWiener became an assistant in phil- this organic food into carbon dioxide tensity and freely accessible supplies<br />\nHullabaloo,\" Austrian said.<br />\nMr. Sacks brought out in his talk<br />\nosophy at Harvard. The next year and water.<br />\nThe Johnston Scholarships for 1937<br />\nof water and carbon dioxides the prohaw difficult it was for certain issues<br />\nThe<br />\nschedule<br />\nis<br />\nas<br />\nfollows:<br />\nhe moved on to the University of<br />\nhave<br />\nLife<br />\nbeen<br />\nannounced, including two<br />\nProcess Vital For<br />\nduction of sugar becomes more rapid<br />\nbrought before the court to be defiMaine as an instructor in matheLacrosse—Wednesday, 4.30.<br />\nEventually, if there were no way as the intensity of light shining on renewals, and one new appointment—<br />\nnitely named either constitutional or<br />\nmatics. From 1917-1918 he was a of counteracting this process of com- the plant increases. But, when the that of 0. S. G. Schilling, in MatheTrack—Wednesday, 4.00.<br />\nunconstitutional, and that the pracstaff writer with the Encyclopaedia bustion, the organic matter of the intensity rises extremely high, the matics. The renewals were to Tze<br />\nCross Country—Wednesday, 4.30. tically sole feature<br />\ndetermining the<br />\nAmericana and later became a com- world would all be exhausted and rapidity of photosynthesis fails to Tuan Chen, in Zoology, and Dr. Cyrus<br />\nSwimming—Not definite.<br />\nacceptance or rejection of a law is<br />\nputer at the Aberdeen Proving life would perish. It is the unique respond to additional increases—as H. Gordon, in Oriental Seminary.<br />\nwhether or not the judges consider<br />\nWrestling—Tuesday, 4.45.<br />\nGround. In 1919, he became instruc- ability of green plants to reverse the If the plant were satisfied and refused These are post-doctoral grants, of the<br />\nthe law reasonable or not.<br />\nHe<br />\ntor in math at M. I. T., advancing oxidation process by combining the to produce further. This is explained value of $1,000, and are made only<br />\nRifle Club—Tuesday, 5.00.<br />\npointed out how it was impossible<br />\nto an assistant professorship in 1924 carbon dioxide of the air with water in the new theory, not by any mys- to scholars who have completed their<br />\nTennis—Wednesday, 4.00.<br />\nfor personal prejudice to be banned<br />\nand to an associate professorship in to form organic compounds. The terious biologic will, but by a ten- work for a Ph.D.<br />\nBaseball—Tuesday, 4.45.<br />\nfrom<br />\nthe judgments of the \"nine old<br />\n1929. In 1932 he was promoted to energy for combination is furnished dency for the intermediate products<br />\nThe renewal of the Fleishman FelGolf—Tuesday, 4.00.<br />\nmen.\" He showed how the court had<br />\nthe position he now holds.<br />\nby sunlight acting upon the green to redecompose under the stimulus lowship in Chemistry for 1937-38 was<br />\nIntra-Murals—Tuesday, 4.30. •<br />\nbeen \"packed\" m the past, showed<br />\nDr. Wiener is a member of the pigment chlorophyll within the plant of extremely high intensities of light. also announced this week.<br />\nThe<br />\nInter-Fraternity—Tuesday, 4.15.<br />\nwhy the president's plan could be<br />\nLondon Mathematical Society, Deut- cell.<br />\nA \"back-reaction,\" quite familiar to grant is $1,000 yearly, for the state<br />\nFencing—Wednesday, 4.45.<br />\nconstitutionally accepted, and dissche Mathematische Vereinigung, and<br />\nThe theory of Dr. Franck and Dr. chemists, is what balances and limits of Washington, by the Fleischman<br />\nSoccer--Tuesday, 5.00.<br />\nspelled many arguments against the<br />\nSociete Mathematique de France.<br />\nHerzfeld explains the behavior of food manufacture for the plant.<br />\nYeast Company.<br />\nHandball—Tuesday, 4.30.<br />\nnew Court plan.<br />\nHomewood will be the focus of<br /><br />\nSpeakers Protest<br />\nShils Rejection<br /><br />\nM I T Mathematician<br />\nIs Dohme Speaker<br /><br />\nFranck and Herzfeld Publish<br />\nNew Theory on Photosynthesis<br /><br />\nDormers Hear Sachs<br />\nDiscuss Court Plan<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 16, 1937<br /><br />\n2<br /><br />\nZbe<br /><br />\n301)119<br /><br />\n340PkinS<br /><br />\nA.6<br /><br />\nletter<br /><br />\ntl<br /><br />\nttu<br /><br />\nSubscriptioo per year<br />\nBy Mail<br /><br />\n___<br /><br />\n$2.00<br />\n$2.50<br /><br />\nRemit subscription fees to Treasurer, Student Activities Council,<br />\nRenisen Hall, Postoffice, Johns Hopkins University.<br /><br />\nEntered as second class matter December 3, 1909, at the Postoffice<br />\nin Jealtunore, Md., under the Act of Congress, November 3, 1879.<br />\nPublished semi-weekly Irons October to June, except during examination and college holiday periods by undergraduates of the Johns<br />\nHopkins University.<br /><br />\nEDITORIAL STAFF<br />\nEditor-in-Chief<br />\n_-___._ ..____<br />\nStanley Finkel<br />\nManaging Editors<br />\nRoot .. _ _<br />\nBenjamin<br />\nKenipton,<br />\nMurray<br />\nJ.<br />\nSports Editor<br />\nBernard D. Pinck_____________....._______<br />\nAssistant Managing Editor<br />\nWethered Barroll, Jr.,<br />\nAssistant Sports Editor<br />\nHarold Zbeutlin<br />\n_ Columnist<br />\n___<br />\nPaul Berge<br />\nReporters— Max Iskowita, Nathaniel Finkelstein, Jewett Goldsmith,<br />\nHoward Reisenstein, Julian Adler, Carl Resin, Leonard Rubinger,<br />\nMorris Wessel, Arthur Katz, Martin Krieger, Lester Rosenthal,<br />\nMurray Kempton, Victor Victoroff, Charles Diggs, William Burford, J. C. Handelsman, Mal Boshnack, Arnold Glantz, Joe<br />\nSamovitz, Seymore Sacks, Trying Millberg, Milton Alperstein,<br />\nZenas Baum.<br />\nBUSINESS STAFF<br />\nWilliam B. Kempton<br />\nMelville Locker<br />\nWm. C. Erlanger<br />\nGerald Willen<br />\nHoward Linkoff<br />\nNathaniel Soifer<br /><br />\nBusiness<br />\nAssistant Business<br />\nAdvertising<br />\n—Circulation<br />\nOffice<br />\nCopy and Filing<br /><br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br /><br />\n.....111KNTKO FOR NATIONAL ADVKNTIOINI3<br /><br />\nNational Advertising Service, Inc.<br />\nCollege Publishers Representative<br />\nNew YORK, N.Y.<br />\n420 PihkossoN AVE.<br />\nCNIC kG0<br />\nL51 ANOKLEN<br /><br />\n.<br />\nSAN FRANCISCO<br />\nGORTON<br />\nSKATTLK<br />\n•<br />\nPORTLANC<br /><br />\nMember Of The<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nFRIDAY, APRIL 16, 1937<br /><br />\nA Moratorium On Truth?<br />\nAccording to the sentiments expressed by one of the<br />\nstudents here and, from our observations shared by<br />\nmany others—the University should stop thinking—<br />\nat least for a while.<br />\nWhy? Because the Johns Hopkins is in the midst of<br />\na financial campaign and presumably those who are<br />\nexpected to contribute want to be sure that academic<br />\nfreedom is non-existent. Presumably they shell out only<br />\nso that the Hopkin's scholars think as they do. They<br />\ngive money, so some claim, to encourage only those<br />\ndiscoveries and ideas which support these donors.<br />\nBut this writer of the letter and his confreres do not<br />\ngo all the way in urging us to cease any analysis or<br />\ncriticism of the living out of the University's ideals in<br />\nsome quarters. They only say—it is all right to discuss<br />\neverything in order to ascertain the proper conclusions.<br />\nIt's all right to attack injustices. It's all right to defend<br />\ntree speech—but not now.<br />\nYes, be hypocritical, lay low; keep quiet now. Let all<br />\nattacks on campus freedom of thought and expression<br />\ngo by. Take it on the chin when injustices are committed. But only temporarily. Wait 'till we get enough<br />\nmoney to breath easier. Then we can think as we please<br />\nand seek the truth in the traditional Hopkins spirit.<br />\nThis attitude is not only founded on exaggerated<br />\nfears and false premises, but its ideas and implications<br />\nare what we can best call \"un-Hopkins.\" First of all<br />\nwe disavow any statements from us (and as far as we<br />\nknow from any other organization) to the effect that<br />\nthe administration is suppressing free speech—in general—or in these two specific cases.<br />\nThe letter writer and those who think like him have<br />\npeculiar—and erroneous --notions of what the University stands for. We \"beefers\" believe in the real tenets<br />\nof the Hopkins. We do not regard \"Veritas Vos Liberabit\" as a pet phrase to be slung about carelessly; we<br />\njealously guard this motto as the guiding spirit, the<br />\nliving ideal of the Hopkins. In fact, we want to make<br />\nsure that nothing interferes with the traditional academic freedom and liberal attitude --associated with our<br />\nUniversity since its founding.<br />\nFortunately, actual conditions tend to make us much<br />\nless pessimistic than this student. We can point to<br />\nwidespread protest that greeted the assertion by one<br />\nof our Board of Trustees last year that the reason<br />\nmoney was slow in being raised was the radical element at the Hopkins. It is obvious that their fears of<br />\na large radical section of our faculty or student body<br />\nare baseless.<br />\nThe fact of the matter is that the Hopkins possesses<br />\na rather conservative student body and still more conservative faculty. As the Supreme Court poll, and our<br />\nobservations, show, we possess students and faculty<br />\nmembers who are far from radical—but who are, for<br />\nthe most part, open-minded and tolerant of the views<br />\nof others.<br />\nWe have more confidence in the Hopkins; we possess<br />\nmore faith in the number of people who hold a similar<br />\nregard for the continuing of the Hopkins as the traditional home of academic freedom and liberal thought.<br />\nBecause, should this University ever abandon its<br />\ncharacteristic features and cease to live up to its<br />\nmotto—it ceases to exist as that institution of world<br />\n'renown. It ceases to be The Johns Hopkins University.<br />\nAnd if we do anything to undermine or change those<br />\nlong-standing traditions during this financial campaign,<br />\nwe will be obtaining money under false pretenses.<br /><br />\nDeserving Promotion<br />\nWe are pleased to announce the election of Murray<br />\nKempton and Ben Root to the positions of managing<br />\neditor. These two fellows have served for almost two<br />\nyears in steady service to the most active activity on<br />\nthe campus. In academic rain or shine, the pair contributed towards putting out the NEWS-LETTER regularly. They well deserve this promotion.<br />\nCongratulations, fellows, and lots of luck in your<br />\nnew positions!<br /><br />\nTwo Anniversaries<br /><br />\nLETTERS TO THE EDITOR<br /><br />\nThis month of April, 1937, marks the twentieth<br />\nTo the Editor of the NEWS-LETTER:<br />\nanniversary of the \"war to end war.\" That descriptive<br />\nDear Sir:<br />\nphrase seems so ironical today that it is seldom proIn the past week, we have been<br />\nnounced in anything but the spirit of sarcasm. The hearing a great deal of how the adsame unhappy fate has befallen its companion piece— - ministration is suppressing the freedom of speech here at Hopkins; the<br />\n\"the fight to make the world safe for democracy.\"<br />\ntwo classical examples being the reHow different is the picture twenty years after.<br />\nfusal of the administration to allow<br />\nEurope trembles today before dictators, who exult in Earl Browder to speak; and the other,<br />\nhaving saved their world from democracy, and who which has now cast Browder into the<br />\nexalt the military life as the national ideal. For the oblivion he deserves, the blackballcontinent, it may be said that the great world war ing of Maurice Shils from Phi Beta<br />\nKappa, in which the administration,<br />\nhas never ended, that the Spain of 1937 is only a new<br />\nit is hinted, was the pressure behind<br />\ntheatre for a constant struggle.<br />\nthe blackball. It is about time that<br />\nNo one in America really wants another war. Most someone called to the attention of<br />\nof us are heartily sorry about the last one. The sur- the A. S. U., and other \"beefers\" (if<br />\nvivors of the gallant band, which filibustered the war I may use the term), certain facts<br />\nwhich they have failed to take into<br />\nresolution twenty years ago and were universally cursed<br />\nconsideration; so that there will be<br />\nas \"pacificomaniacs\" for their pains, are now revered less slinging of their pet phrases—<br />\npatriarchs. The tragedy of 1917 served one good pur- \"freedom of speech,\" and \"Veritas<br />\npose; its very excesses have wrought a revolution in von liberabit.\"<br />\nThe fact that this is a privately<br />\nour approach to war.<br />\nendowed institution was brought<br />\nIn November, 1916, Woodrow Wilson was reelected<br />\nquite forcibly to our minds last year,<br />\npresident of the U.S. on the proud boasts\"he kept us out and those of us who don't spend so<br />\nof war.\" One month after his inauguration, Americans much time writing speeches, and<br />\nwere enlisting for the front while Robert La Follette have a chance to read a newspaper<br />\nand George Norris were reviled as traitors for their occasionally, know that institutions<br />\nsuch as ours have been hampered in<br />\nopposition to the war. The proponents of peace, whattheir work because of shrunken inever their capacity, are helpless in face of the war vestments. Last year the University<br />\nfever. To keep the peace, our only hope rests in eternal had a drive to raise money for running expenses, and at present is tryvigilance.<br />\nApril marks another anniversary--the fourth year ing to raise a permanent endowment<br />\nsince the inception of the National Student Strike fund.<br />\nNow the administration is behind<br />\nagainst War. In 1933, it was a daring venture sponeight ball, so to speak. It can<br />\nthe<br />\nsored by 25,000 students and two left-wing organizafree speech and close the Uniallow<br />\ntions. It came to the Hopkins in a barrage of rotten<br />\nversity, or it can take the other<br />\neggs.<br />\nalternative, which is even plain<br />\nNext Thursday at 11 A. M. the strike is to be held<br />\nenough for the A. S. U. to see. The<br />\nagain at the Hopkins, this time under the auspices<br />\nadministration is here to see that<br />\nof organizations ranging all the way from Omicron<br />\nthe University is kept open, and it<br />\nDelta Kappa to the American Student Union. The<br />\nis not their fault if they have to<br />\nstrike committee is a manifestation of the broadest<br />\nsuppress free speech because the peouniversity sentiment against war. The student body ple who are in the position to give<br />\nhas united to protest its constant threat.<br />\naid to this University financially have<br />\nAnd that is the way to keep the peace.<br />\nstrong objections to so-called liberal<br />\nideas. These people dislike the socalled liberals for reasons I cannot<br />\nattempt to analyze here, but the fact<br />\nWith the new elections and the advance in rank of remains that they will not endow<br />\ntwo men, the retiring managing editors—Jim Morrow money to universities who are not in<br />\nand Dave Caplan—end years of faithful service on the accord with their own ideas. As a<br />\nNEWS-LETTER. To them fell the sometimes thankless<br />\njob of late nights down at the printers' reading proofs.<br />\nWe have enjoyed working with these two fellows<br />\nand want to express our appreciation and thanks for<br />\ntheir activity on the campus paper. Perhaps only those<br />\nwho have worked steadily on a newspaper can fully<br />\nrealize the warm spirit of comradeship and friendship<br />\namong the co-workers on the staff.<br />\nIt is with a note of genuine regret that we bid<br />\ngood-bye to Jim and Dave.<br /><br />\nRegretful Goodbye<br /><br />\nresult, I am strongly in favor of any<br />\npolicy the administration takes,<br />\nwhether it be the curbing of such<br />\nfree speech upon this campus, as<br />\nwould antagonize supporters of our<br />\nUniversity, as long as the policy<br />\ntends to ward off any unwanted publicity which would tend to jeopardize<br />\ntnis University more than any restraint upon free speech. And I<br />\nthink that anyone who sincerely believes in our University will agree<br />\nwith me.<br />\nSo we ask you \"beefers,\" for your<br />\nown sake and ours, to please refrain<br />\nfrom \"beefing\" until you have left<br />\nthis University, and then you can buy<br />\na million soap boxes and give vent<br />\nto your emotions from morn till<br />\nnight. For then, you wouldn't be<br />\nharming us or the Hopkins.<br /><br />\nThe athletic revolution of the last decade left colleges and universities roughly segmented into two<br />\ncamps; the strong and proselyting, aiming for large<br />\ngate receipts; and, the weak and amateur, aiming for<br />\nwholesome competition and fun for all. The Hopkins<br />\nwithstood the juggernaut of professionalism that found<br />\nits way into too many of our institutions of learning,<br />\nincluding some of the most sanctimonious. It repelled<br />\nthe new; stuck fast to the old.<br />\nConsequently—and it is a sad reflection—it became<br />\nthe lot of the Hopkins student to explain to the uninitiated outsider the why and wherefore of the Hopkins<br />\nreputation. \"No,\" the Hopkins student had to say, \"we<br />\nhave given the world or, rather, the sports pages, no<br />\nGrange, Cagle, Thorpe; but, what of Welch, Kelly,<br />\nOsier, Holstead and Willoughby?\" But, to the uninitiated<br />\nthis was not, is not today an adequate reply.<br />\nSo we say this to the uninitiated, and only beause<br />\nthey are uninitiated: Watch our lacrosse team. It is<br />\ncomposed of Students come here to learn chemistry,<br />\nlanguage, etc. Yet, it vies with the best on even terms.<br />\nCome out tomorrow and watch these amateurs play the<br />\nUniversity of Pennsylvania. And watch a student body<br />\ngetting a lot of fun looking on as its class mates play<br />\nin their spare time—because they like to play.<br /><br />\nLet Justice Be Done<br />\nNo one who attended the meeting last Friday for discussion of the Shils question and heard the speakers'<br />\nopinions can entertain any doubts on two main points.<br />\nFirst, in the absence of any evidence against, and the<br />\nfull array of testimony for, the election of this student<br />\nto Phi Beta Kappa, one must contend that he deserves<br />\nand beyond all uncertainty should be awarded the key.<br />\nAnd secondly, that the method of choosing members is<br />\none which can potentially continue to allow such injustices as this to arise.<br />\nWe are happy to hear that a special meeting of Phi<br />\nBeta Kappa is to be held. We sincerely hope that justice will be done for this case and for the future,<br /><br />\nDear Sir:<br /><br />\nProcess-Aging<br />\nPrevents<br />\nTongue Bite<br /><br />\nEdgeworth Guarantees that ProcessAging Prevents Tongue Bite<br />\nNGUE BITE is the bane of<br />\nipe smokers.We guarantee that<br />\nEdgeworth will not bite the tongue.<br />\nThe use of the finest Burley tobaccos will not prevent tongue bite.<br />\nIt's the processing that does it. As<br />\nevery tobacco expert knows, pipe<br />\ntobacco can be rushed through the<br />\nplant and save big sums of money.<br />\nIt is pipe tobacco, but it is not<br />\nEdgeworth.<br />\nOur method is Process-Aging—a<br />\nprocess as vital as the aging of old<br />\nwines. There are twelve required<br />\nsteps, each under laboratory control.<br />\nIt takes 4 to 7 times as long as might<br />\nseem necessary. But in no other way<br />\ncan we guarantee that Edgeworth<br />\nwill not bite the tongue.<br />\nWe ask you to try it under our<br />\nmoney-back guarantee. If Edgeworth bites your tongue, return it<br />\nand get your money back. You<br />\ncan't lose.<br /><br />\nr<br /><br />\nl—Edgeworth Ready-Rubbed—a<br />\ncool, long-burning tobacco preferred by seasoned smokers.<br />\n2—Edgeworth Plug Slice—for the<br />\nsmoker who likes to crumble the<br />\ntobacco in his hands until it's just<br />\nright for him.<br />\n3—Edgeworth Jr.--the same tobacco also Process-Aged, but cut<br />\nfor a milder, more free-burning<br />\nsmoke.<br /><br />\nizzzet5iis<br /><br />\nIt happened in Salem,Mass., on Februrary 12, 1877. The<br />\nyoung reporter attended a demonstration of inventor Bell's<br />\nnew telephone — then \"talked\" his story to his paper in<br />\nBoston by telephone!<br />\nThough he didn't realize it, he was inaugurating a new<br />\nera in journalism. For today's newspapers could hardly exist<br />\nwithout the telephone.<br />\nGathering and spreading news with lightning speed is just<br />\none of the telephone's countless contributions to modern<br />\nlife. And 300,000 Bell System people strive constantly to<br />\nmake the service still better, still more useful.<br />\nWhy not telephone home oftener?<br />\nRates to most points are lowest after<br />\n7 P M. and all day Sunday.<br /><br />\nCo<br /><br />\nF'<br />\nEd<br /><br />\nOn behalf of the lacrosse team of<br />\nCity College of New York and my-<br /><br />\nNOTE: There are three kinds of<br />\nEdgeworth for you to choose from:<br /><br />\nBe There Tonight!<br /><br />\nThis combined dance is definitely an institution well<br />\nworth continuing. The affair tonight deserves your<br />\nsupport.<br /><br />\nApril 14, 1937.<br />\nTo the Editor of the NEWS-LETTER:<br /><br />\nself, I wish to thank you and your<br />\nschool publication for the fine tribute<br />\nyou paid our team, in the game they<br />\nSTANLEY ISAACSON.<br />\nplayed at Homewood field on Saturday, April 3, 1937 vs. Johns Hopkins<br />\nTo the Editor of the NEWS-'LET'TER:<br />\nU. in the edition of one your school<br />\nDear Sir:<br />\nLet us suppose that times are publications.<br />\ngood, I am prosperous, and I can<br />\nI consider it fine \"journalism,\" as<br />\nemploy two servants, whom we will well as real sportsmanship, it encourcall A and B. I have no cause to ages the weaker team to note that<br />\ncomplain of the work of either of their efforts have not gone unnoticed,<br />\nthem; perhaps A is a little more and also tends to create a genuine<br />\nenergetic and gets more done than B, public interest.<br />\nbut A turns out to be a communist.<br />\nOur boys certainly enjoyed playFrom the very nature of my posi- ing that game,<br />\nwhether or not they<br />\ntion in life, I disagree with his views,<br />\n(Continued on Page 3, Col. 2)<br />\nbut I feel that he has a perfect right<br />\nto think as he chooses; as a matter<br />\nof fact, being one of those individuals who allow their servants considerable liberty, I rather enjoy<br />\narguing with him.<br />\nHowever, as time goes on, it becomes evident that he is spreading<br />\nrumors about me. Later, he even<br />\ndares to tell my friends in my presence that I am trying to steal another man's wife, that I engage in<br />\nshady business practices, that I have<br />\nthreatened to fire him because of his<br />\npolitical views.<br />\nAre his accusations true? Only I<br />\nknow, and for obvious reasons I refrain from saying anything on the<br />\nsubject. Perhaps his accusations are<br />\nso vague that even I am not sure<br />\nwhether they are true or not.<br /><br />\nWatch Us Amateurs Play<br /><br />\nContinuing the annual affair instituted last year with<br />\nthe Soph Frosh dance, the present first-year and secondyear students are sublimating their Hell Week into a<br />\ncombined social affair.<br />\nLast year the dance was well-supported and the<br />\npioneer effort was declared a success from all angles.<br />\nThe two class worked together harmoniously and a<br />\nsizeable sum was earned for the respective class<br />\ntreasuries.<br /><br />\nHard times come. My friends begin to drop away one by one; my<br />\nbusiness clients go elsewhere for<br />\ntheir services, largely, I feel, because<br />\nof the stories that my servant A has<br />\nbroadcast around. I can no longer<br />\nafford more than one servant. A<br />\nworks as hard as ever and B is his<br />\nsame, quiet, docile, lazy self. 1 discharge A; have I violated the freedom<br />\nof speech?<br />\nJ. E. T.<br /><br />\nPlease accept 50t Gold Plated Collar-Pin<br />\nfor only 100 when you buy Edgeworth.<br />\nMerely send inside white wrapper from<br />\nany tin of Edgeworth with your name and<br />\naddress and 100 to Larus &amp; Bro. Co.,<br />\nDept. 400, Richmond, Va.<br /><br />\nEDGEWORTH\"<br />\nEDGEWORTH<br />\nSywdeaff<br /><br />\ntioR<br />\nn<br /><br />\n:<br />\nthet<br />\nlsir<br /><br />\nOnly<br />\ngive:<br /><br />\ne<br />\np<br />\nalnd<br />\nn<br />\ni<br />\nTt<br />\ni<br />\n(<br />\nla<br />\ns<br />\nl<br /><br />\n:<br />\n9<br />\n:11<br /><br />\n1h<br />\nrnienfl<br /><br />\ne<br />\nW<br />\ne,a<br />\n0<br />\n:1<br />\n8<br />\nt9d_ ,<br />\nTh<br /><br />\ncopy<br /><br />\no<br />\nvf<br />\nestti<br /><br />\nCo<br />\nall ic<br />\n\"'crib<br />\nH. E<br />\nple a<br /><br />\nA<br />\nfavor<br />\nto de<br />\nare<br />\ndemi<br />\ninfor<br />\nsuch<br />\nadop<br /><br />\nHo<br />\ntor<br /><br />\nJ<br />\nAam<br />\nZI<br />\n:<br />\nat:e4<br />\nbecar<br />\nDoug<br /><br />\nLa<br />\nSal<br /><br />\n(0<br />\ntiona'<br />\nbe th<br />\nis cc<br />\nKessl<br />\nrespe<br />\nattac<br />\nthan<br />\nat inhand(<br />\nby N<br />\nfirst<br />\ndodgc<br />\nstart<br />\nman<br />\nthoug<br />\nMakE<br /><br />\nworti<br /><br />\nstead<br />\nJoh<br />\norigii<br />\nvoid<br />\nSwim<br />\nfrom<br />\nprotel<br />\nand<br />\nfling<br />\nthe F<br />\nfaceby IVI<br />\nbargi<br />\nform<br /><br />\nCost<br /><br />\nAn<br />\naide<br />\neosin,<br />\nApril<br />\nHall<br />\ndent<br />\nDal<br />\nMopo]<br />\n\"It w<br />\nto an<br />\nof sex<br /><br />\nirnana<br />\nthen<br />\nWere<br /><br />\nPany.'<br /><br />\nEVE<br />\nzneeti<br />\nWill b<br /><br />\nHOM.EWOOD, BALTIMORE, APRIL 16, 1937<br /><br />\n3<br /><br />\nNews-Letter is Dr.Corwin Presents J.H.U. Band Runs Raffle to Pay Medical Students 'Aint's the Nuts'<br />\nOn Delicate For 'Gorgeous' New Uniforms Gather at Hopkins Says Professor<br />\nDeclared Free Paper<br />\nScale He Developed Band Members Must Raise Money In Order To Keep For Convention<br />\nFrom Censoring Difficulties In Using SuperUniforms; Drawing May 10<br />\nDean Chesney Of Hopkins<br />\nFor Philco Radio<br /><br />\nCommittee At Convention<br />\nRates Hopkins Journal<br />\nAmong Least Censored<br />\n_<br />\nFINK EL REPRESENTS<br /><br />\nSensitive Scale Are Revealed<br />\nDr. Alsoph H. Corwin, Associate<br />\nin Chemistry, presented a paper before the Micro-Chemical Section of<br />\nthe American Chemical Society, last<br /><br />\nEditor - in - Chief Introduces<br />\nResolution To Provide Aid<br />\nFor Needy Students<br /><br />\nWednesday, on \"Balance Errors in<br /><br />\nRepresented at the spring convention of the Intercollegiate Newspaper<br />\nAssociation by Stanley Finkel, editor,<br />\nthe NEWS-LETTER was given an \"A\"<br />\nrating in regard to censorship by a<br />\ncommittee chosen for that selection.<br />\nOnly three other college papers were<br />\ngiven a similar position: the Swarthmore Phoenix, the Stevens Tech Stute<br />\nand the Elmira Octagon.<br /><br />\nsion of some of the difficulties inher-<br /><br />\nConference Protests Censorship<br />\nThe conference unanimously adopted a resolution protesting a \"dictatorial\" policy of the University of<br />\nPittsburgh in choosing an editor-inchief of the Pitt News. Direct censorship of the editorial and news columns of the Temple News was also<br />\n\"Deletion of student<br />\ncondemned.<br />\ncopy\" from the Susquehanna paper<br />\nWas also charged.<br />\nThe latter protests were a result<br />\nof the findings of a Censorship Investigation Committee, set up at the<br />\nLast-year's convention.<br />\nConditions at these universities,<br />\nall located in Pennsylvania, were deacribed in letters to be sent to George<br />\nH. Earle, Governor of the state. Temple and Pitt receive state aid.<br />\nFinkel Introduces Resolution<br />\nA resolution introduced by Finkel,<br />\nfavoring the granting of financial aid<br />\nto deserving and needy students, who<br />\nare \"outstanding in other than academic fields,\" and for disclosures of<br />\nInformation showing the value of<br />\nsuch assistance, was unanimously<br />\nadopted at a session.<br />\nHoward W. Emres, associate editor of the George Washington<br />\nHatchet, was elected president of the<br />\nAssociation for the coming year.<br />\nJames Donoghue of the Pitt News<br />\nbecame vice-president, and Mary<br />\nDouglas of Wilson College, secretary.<br /><br />\nLacrosse Attraction<br />\nSat. At Homewood<br />\n(Continued from Page 1, Col. 1)<br />\ntionable as the Hopkins game will<br />\nbe their first real test. The mid-field<br />\nis composed of Gordon, Nye, and<br />\nKessler, at the wings and center post<br />\nVeterans compose the<br />\nrespectively.<br />\nattack and these men will bear more<br />\nthan perfunctory watching. Panzer,<br />\nat in-home, throws a dangerous lefthanded shot, and is fed consistently<br />\nby Needle, at the other home. The<br />\nfirst attack is tricky Jack Dolman, a<br />\ndodger of known ability and a good<br />\nstart will put him by any defense<br />\nman and in a scoring position. Although the defense has its loopholes,<br />\nMaksik, the visiting net-tender is<br />\nWorthy of his keep, having played<br />\nsteadily since a frosh.<br />\nJohns Hopkins will open with its<br />\noriginal starting line-up, now devoid of any injuries. Naylor and<br />\nSwindell combine with Ghinger to<br />\nfrom the close-in defense with Kahl<br />\nprotecting the nets. Beeler, Himes,<br />\nand Yearley do the cross-country running at the mid-field stations, with<br />\nthe Hardy Hammer drawing for the<br />\nface-off. The line-up is completed<br />\nby Melvin, Kaufman, and Dukehart<br />\nbarging in to dent the cords on the<br />\nforward wall.<br /><br />\nMicro Analysis.\" Dr. Corwin has developed a super-sensitive balance for<br />\nthis work, and presented a discusent in weighing to one gamma, the<br />\none-millionth part of a gram, or about<br />\nthe weight of a fair-sized dust speck.<br />\nThe address opened with a presentation of the need for such refinement<br />\nin weights, when dealing with hormones, which at the present cost<br /><br />\nInterfering factors, such as the vibrations<br />\nabout $10,000,000 an ounce.<br /><br />\nof a passing train or auto, animal<br />\nheat from the human body, and other<br />\ncauses, such as dust, and humidity<br />\nvariations, which are more easily controlled, were discussed. To avoid the<br />\nunpleasant necessity of placing the<br />\nbalance in an hermetically-sealed<br />\nchamber, and observing only through<br />\na telescope, work has been done to<br />\nmake a balance sensitive, and yet<br />\nuseful.<br />\nIt was in connection with this that<br />\nthe discovery was made that a knifeedge of the hardest-known material,<br />\nsharpened so as to be invisible in the<br />\nfield of a powerful microscope as a<br />\nsurface, still showed wide variations,<br />\nwhich were found to be due to the<br />\ndeforming of the edge as the weight<br />\ncame upon it, much as an automobile<br />\ntire flexes under the weight of the<br />\ncar.<br />\nTherefore, since the bearings are<br />\nlifted from the knife-edges when the<br />\nbalance was idle, it .was found that<br />\nthis \"squashing\" resulted in a bouncing motion when the weight of the<br />\nbalance came on<br />\nbearing.<br />\nthe<br />\nElimination of this effect has greatly<br />\nimproved the precision with which<br />\nmeasurements may be made.<br />\nAn unusual side development of<br />\nthis work was the ability, by proper<br />\nmanipulation of the balance, to register the amount a diamond or sapphire<br />\nis compressed by the weight, say,<br />\nof a thin dime.<br /><br />\nLETTER TO<br />\nTHE EDITOR<br />\n(Continued from Page 2, Col. 6)<br />\nwon, as the conduct of the players<br />\nof both teams on the field spoke for<br />\nitself. I don't think that there was<br />\na single major penalty during the entire game, and very few others.<br />\nHoping that your season is a successful one, I am cordially,<br />\nLEON A. MILLER,<br />\nCoach of Lacrosse.<br /><br />\nTo look at them you'd never know<br />\nit, but 'neath every natty blue uniform that graces and colorfully exalts the J.H. U. Band above any other<br />\nbeat hearts that live in daily fear that<br />\nthose same uniforms may be taken<br />\naway from them! Verily they are<br />\nlike unto the farmer without the<br />\ndaughter to go to the city to work<br />\nher fingers to the bone for him, but<br />\nwith the mortgage.<br />\nLast month the R. 0. T. C., under<br />\nthe urgings of Conrad Gebelein, director of the Band, decided to set<br />\naside a goodly portion of sums delegated to them by the U. S. Government for the purpose of purchasing<br />\nlong-needed uniforms for the Band.<br />\nNot being used to doing things in<br />\na pusillanimous way, the persons who<br />\nwere put in charge of the choice of<br />\na suitable uniform to properly accent<br />\nand accentuate the dignity, the love<br />\nof luxurious drapery, and appreciation for the gaily-caparisoned, did<br />\nnot spare anything to realize their<br />\nideals.<br />\nThe results by this time are hisThe most Oriental-minded<br />\ntory.<br />\ndespot that ever decorated a seraglio<br />\nwith the Most Beautiful of the Fair,<br /><br />\nwould be delighted with the beauty<br />\nand elegance of the blue and gold<br />\n(with gold buttons!) of the new uniforms! But unlike the despot, whose<br />\ntaste in the better things in life—<br />\nlike band uniforms—can be gratified<br />\nby a mere wave of the hand, the band<br />\nhad to lay hard cash right on the<br />\nline. Now the boys have just two<br />\nthings to do, either raise the money<br />\nand keep the uniforms, or give them<br />\nback. They have decided to keep<br />\nthe uniforms.<br />\nTo do this they call on the members of the student body of the University for an inconsiderable donation to a raffle. On May 10, at 4<br />\no'clock, there will be a drawing for a<br />\nbrand-new Philco radio in Levering<br />\nHall. Each ticket costs ten cents,<br />\nand offers a chance that each should<br />\njump at—the opportunity of getting<br />\na ,radio for next to nothing.<br />\nBand member are carrying around<br />\nthe little books. If you haven't seen<br />\nthem as yet, come out of your cellar;<br />\nthey'll get to you eventually. . .. No,<br />\nwe do not have a dime to loan you.<br />\nWe haven't any dimes. One of the<br />\nband was in the office five minutes<br />\nago! . . . .<br /><br />\nCivils Hold Second University Accepts<br />\nAnnual Conference Grants and Library<br />\nThe Second Annual Conference of<br />\nthe Student Chapters of the American Society of Civil Engineers will<br />\nbe held here at Hopkins on Monday,<br />\nApril 19. The chapters participating<br />\nare those of the Catholic University<br />\nof America, the University of Maryland, the George Washington University, and the Johns Hopkins University.<br />\nThe conference will open Monday<br />\nmorning at 9.30 with registration in<br />\nLatrobe Hall. At 10 o'clock the visitors will be welcomed by President<br />\nIsaiah Bowman.<br />\nAfter President<br />\nBowman's speech of weltome, Dr.<br />\nErnst Cloos, eminent geologist, will<br />\nspeak on a subject of interest to the<br />\nassembled students.<br />\nAt 12 o'clock a buffet lunch will<br />\nbe served at the Faculty Club. After<br />\nthis, the students will make a series<br />\nof inspection trips. It has been arranged to inspect the Chevrolet assembly plant, the Bethlehem Steel<br />\nCo. plant at Sparrows Point, and the<br />\nnew 29th Street Bridge, a concrete<br />\nmonolithic arch, which is now in the<br />\nprocess of construction.<br />\n,Upon returning from the inspection trips the students will again<br />\nmake their way to the Faculty Club,<br />\nwhere a banquet will be held. Mr.<br />\nThomas F. Hubbard, a prominent<br />\nmember of the Engineering Faculty,<br />\nwill be toastmaster, and Dean of Engineering, E. R. Whitehead, will extend the welcome of the Hopkins<br />\nFaculty to the visitors.<br /><br />\n\"Kay, what'll<br />\nwe give 'em?\"<br /><br />\nAt a recent meeting of the Board<br />\nof Trustees of the Johns Hopkins<br />\nUniversity, gifts were accepted for<br />\nthe University from the Rockefeller<br />\nFoundation, the Carnegie Institute,<br />\nand Dr. Howard Kelly.<br />\nThe Medical School was the recipient of the largest of these. A<br />\n$45,000 grant from the Rockefeller<br />\nFoundation for two years, for the<br />\nsupport of Research in the Pavolovian and Psychobiological Laboratories of the Department of Psychiatry.<br />\nThe Carnegie grant, $10,000, also<br />\nfor two years, is for Endocrine Research, now under the direction of<br />\nDr. John J. Abel of the Medical<br />\nSchool. The Kelly gift, by Dr. Howard A. Kelly, of the Medical School,<br />\nand one of the four original doctors<br />\nof the organization, consists of 584<br />\nbound and unbound volumes on<br />\nAfrica exclusive of Egypt.<br /><br />\nMed. School Will Speak<br />\nTo Association<br />\nStudents from<br />\nmany<br />\nmedical<br />\nschools throughout the country wilt<br />\nconvene at the Johns Hopkins Medical<br />\nSchol this weekend in the fourth annual convention of the Association of<br />\nMedical Students.<br />\nThe first meeting will be a luncheon<br />\nat 12.30 tomorrow at the Welch Library, and Dr. Alan Chesney, Dean<br />\nof the Hopkins Medical School, and<br />\nDr. John P. Peters, Professor of Internal Medicine, Yale University Medical School, will speak.<br />\nPanel Discussion<br />\nThe second afternoon meeting at<br />\n2.30 P. M. will be a panel discussion<br />\non \"Problems of Curriculum,\" and<br />\n\"Requirments for Interneship.\" Dr.<br />\nJohn Wyckoff, Dean, New York University College of Medicine; Dr. W.<br />\nW. Oliver, Dean, Long Island College<br />\nof Medici,ne, and Dr. E. K. Marshall, Chairman of Curriculum Committee,<br />\nJohns<br />\nHopkins<br />\nMedical<br />\nSchool, will speak, and several students will also report.<br />\nAt 7.30 P. M., there will be a dinner<br />\nheld at Levering Hall, and a Forum<br />\non \"Medicine and Social Security\"<br />\nwill be held. Dr. Mary Van Kleeek,<br />\nRussel Sage Foundation, will speak<br />\non \"Economic Aspects of Social Security\"; Dr. James Warbasse, President of the Cooperative League of<br />\nAmerica, will speak on \"Social Security and Medical Care.\"<br />\nOn Sunday morning business sessions will be held, and Dr. Henry E.<br />\nSigerist, Director of the History of<br />\nMedicine Institute, will give the closing address.<br />\nThere is a $2 registration fee for<br />\nthe convention, and Pre Med Students in their last year are invited<br />\nto attend. Registration will be held<br />\ntoday at Levering Hall at the \"Y\"<br />\noffice.<br /><br />\nEARN<br /><br />\n$40 $75<br />\nA WEEK<br /><br />\n\"Music and Rhythm<br />\nHal, everybody<br />\nloves it!\"<br /><br />\nScabbard and Blade<br />\nPicks New Members<br />\nThe Scabbard and Blade, honorary<br />\nsociety of the Hopkins R. .0. T. C.,<br />\nhas announced that membership has<br />\nbeen awarded to eight new men. The<br />\nhonorary society, membership in<br />\nwhich distinguishes one for particular excellence in the R. 0. T. C.,<br />\nelected<br />\nJoseph<br />\nHanicka, Walter<br />\nRuggeberg, Charles Mewshaw, James<br />\nGriffin, James Alexander, William<br />\nKempton, William Kier, and William<br />\nStegmaier.<br /><br />\nBirely's Pharmacy<br />\nST. PAUL AT 33RD STREET<br />\nPrescriptions--School Supplies<br />\nSeudwiches<br />\nUnexcelled Fountain Service<br /><br />\n1<br />\n•.............••••••••••••••-•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••-•••••••••••••••••••••••••••••••••••-••••••••••••<br /><br />\nSTRIKE AGAINST GLOOM!<br />\nFOR A REAL PEACE MEETING<br />\nCOME TO<br /><br />\nSUMMER POSITIONS for STUDENTS<br />\n• You can use your<br />\neducational training<br />\nand earn extra money<br />\nthis summer. This unTO<br />\nusual opportunity for<br />\neducational extension<br />\nwork in the home is<br />\nextremely interesting.<br />\nMany students have been exceptionally<br />\nsuccessful and have found it the solution to their financial problem. Write<br />\nfor full details and proof of results at<br />\nonce.<br />\nTILE JOHN C. WINSTON COMPANY,<br />\nHome Extension Department,<br />\nPhiladelphia, Pa.<br />\nl012 Arch Street<br /><br />\nOnce again we have a defender of<br />\nthe use of the word \"ain't.\" This<br />\ntime it is the eminent Professor Harold H. Bender, who obtained his doctorate from this University and is at<br />\npresent chairman of the department<br />\nof Oriental Languages and Literature<br />\nof Princeton. He asserts that it is<br />\nperfectly respectable to say \"It ain't<br />\nso,\" whether disputing about the Supreme Court, the C. I. 0., or a lacrosse game.<br />\nDr. Bender is considered one of<br />\nthe world's best philologists and<br />\netymologists. In the course of thirtytwo years of word-sleuthing, one of<br />\nhis most interesting bits of detective<br />\nwork ( which, incidentally, is of especial interest to some of us), had<br />\nto do with man's early drinking customs and habits. This was a result<br />\nof tracking down the homely \"highball.\" He found, strangely enough,<br />\nthat throughout the centuries in IndiaEuropean countries, when dynasties<br />\nrose and fell, and thousands of words<br />\nmight be jettisoned, the name of the<br />\nfavorite intoxicating drink of the<br />\nprimitive tankard-wavers and elbowbenders remained unchanged.<br /><br />\nTHE<br />\nFRESHMAN - SOPHOMORE<br />\nMinnow ..•<br /><br />\nDANCE<br />\nTONIGHT—MARYLAND CASUALTY<br /><br />\nBUBBY JOHNSON'S MUSIC<br />\n9'TIL 1<br /><br />\n$1.25<br /><br />\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••............•••••••••••................................•••<br /><br />\nSay, Fellows—Here's Your Shoe!<br />\n$5.50<br /><br />\n,<br />\nHESS<br /><br />\nW<br /><br />\n137<br /><br />\nCosmopolitan Club Will<br />\nHear Illustrated Talk<br />\nAn illustrated talk entitled, \"Suicide Fleet,\" will be given before the<br />\nCosmopolitan Club this Saturday,<br />\nApril 17, at 8.30 P. M., in Levering<br />\nHall by Cnarles Bullen, vice-president of the club.<br />\nDan deLima, president of the Cosmopolitan Club, said of the discourse,<br />\n\"It will discuss the events leading up<br />\nto and the sinking of a German fleet<br />\nof seventy battleships which the Germans themselves sank.\" Eullen will<br />\nthen go on to explain how said ships<br />\nWere recovered by a British cornmany.\"<br />\nEveryone is invited to attend the<br />\nMeeting, after which refreshments<br />\nWill be served.<br /><br />\n-'1;*t<br />\n.<br />\n,<br />\na4.•<br />\n•<br /><br />\nAT ALL 3<br />\nHESS SHOPS<br /><br />\nofirtDciit, 0<br />\n\" 4°44<br /><br />\nALL<br />\nCOLUMBIA<br />\nSTATIONS<br /><br />\n•<br />\n•<br />\n•<br />\n•<br /><br />\n111-1<br /><br />\nGenuine \"Ruff-It\" Leather!<br />\nGrey, Brown and White!<br />\nHefty Crepe Rubber Sole!<br />\nSlick wing-tip! Tricky perforations!<br /><br />\nS<br /><br />\nSoles of Honor Since 1875<br /><br />\nTHE FIRST PRODUCT TO HOLD TWO NATIONAL RADIO AWAR.DS<br /><br />\n8 East Baltimore Street<br />\n312-14 Howard Street<br />\nCharles at 21st<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 16, 1937<br /><br />\nJay Baseball<br />\nNine Defeated<br />\nBy Greyhounds<br /><br />\nFencing<br /><br />\nI Swarthmore Swamps Jay Track Squad<br />\nI<br />\nBy 97-28 Score At Media Saturday<br /><br />\nTennis<br /><br />\nJAY GOLFERS WIN<br />\nFIRST 1937 MATCH<br /><br />\nThe Johns Hopkins fencers lost the<br />\nThe Blue Jay Varsity Tennis Team,<br />\nThe Blue Jay golfers made a sucThe sharp piercing report of a crossed the finish line in that order.<br />\nThree Team Middle Atlantic chamwhich has been practicing regularly,<br />\nLankford showed excellent form in is gradually rounding into shape for cessful debut by defeating the Philapionship title to the University of pistol carried across the vast staMaryland. The Jays lost by the nar- dium; six runners leaped from their the 220-yard sprint. Pulling up from the current tennis campaign. The re- delphia College of Osteopathy<br />\nin •<br />\ncrouching positions, and the 1937 behind with a terrific last stretch cent poor weather conditions canrow<br />\nmargin of one point, 18 to 17.<br />\nAlperstein, Stevens And Hartke<br />\nteam match on April 13 .by the score<br />\ntrack season was officially under way. \"kick,' he banged past Spencer and celled the early season matches.<br />\nShow Excellence At Bat;<br />\nHopkins secured the first team<br />\nof 4-2. Bill Wagner, Bill Miller, Bob<br />\nLast Saturday, the Hopkins track- slammed home in good time.<br />\nLast year's record was six matches<br />\nCarper's 1st Game<br />\nchampionship by defeating St. Johns<br />\nDunning<br />\nand Holt Maulsby represters locked horns with the SwarthThe Jay entries in the high jump won with seven lost against strong<br />\n5-4, and Maryland 6-3. The ever demore Garnets; and when the final and pole vault couldn't compare with Intercollegiate competition. The 1937 sented the Johns Hopkins golfers.<br />\nThe Blue Jay baseball team lost its pendable Phil Small and Sherman<br />\ntallies had ben recorded, the Garnets the Garnet performers. In the run- Jay squad has hopes of bettering<br />\nThe club handlers played Swarthfirst league game last Monday to a starred in the final matches, Small stood ahead by the score<br />\nof 97-28.<br />\nning broad jump, Kephart captured the '36 record under the leadership<br />\nmore<br />\nwinning<br />\nof<br />\n6<br />\nSherman<br />\n7,<br />\nout<br />\nand<br />\nCollege at Rolling Green in<br />\n9-5.<br />\nof<br />\nscore<br />\na<br />\nnine<br />\nby<br />\nstrong Loyola<br />\nFrequent flurries of snow and tin- a third.<br />\nof Captain Robert Brown. The loss<br />\n4 out of 6.<br />\nPhiladelphia,<br />\nApril 14. They lost by<br />\naffair<br />\nwelcomed<br />\ncoldness proved a major<br />\nThe game was a seven-inning<br />\nSuperiority of the Maroons in the of last year's star and leader, Carl<br />\nJays Lose Epee, Sabre<br />\nthe<br />\nscore<br />\nof<br />\n4-2.<br />\nhandicap<br />\nto<br />\nboth<br />\nsquads.<br />\nThe<br />\ngreen<br />\nhalf<br />\nand<br />\nHopone<br />\nmile evidenced itself as Hartman, was a severe setback to<br />\nby mutual agreement, and the<br />\nThe Blue Jays, however, were not Jay battalion with hardly three full<br />\nrunners clad in maroon togs crossed J. H. U. hopes.<br />\nDunning and Miller won their<br />\nkins' rally in the seventh when it so fortunate in the epee and sabre<br />\nweeks of worthwhile practice definite- the finish line in 1, 2, 3 order in both<br />\nThe<br />\nfollows:<br />\nline-up<br />\nmatches<br />\nwhile Wagner, Maulsby,<br />\nscored three runs, showed that the matches. In the epee matches, Mary- ly exhibited<br />\nthat fact. With but one tests.<br />\nCaptain Bob Brown, first; Bill Dave Halle and Webster lost.<br />\nscore might have been different had land beat Hopkins 3 to 1, and St. letterman participating, Coach HamAnother Jay Triumph<br />\nLamble, second; Henry Kramer,<br />\nJohns defeated Hopkins 3 to 1. In bleton had more than the<br />\nthe game gone nine innings.<br />\nnormal<br />\nAnother Jay triumph came in the third; Jerry Branower, fourth; Bill<br />\nthe sabre matches, Hopkins defeatedshare of worries.<br />\nseverest trial of all, the two-mile race. Lamed, fifth; and Bob Radcliffe,<br />\nMilt Alperstein, Jay second baseSt. Johns 3 to 1, while Maryland. ran The inaugural event of the after- The<br />\nrace consisted of ten turns sixth.<br />\nman, led the Hopkins attack with over Hopkins 3 to 1.<br />\nnoon's festivities was the 440-yard around the complete track. For the<br />\nThe doubles teams have not been<br />\nthree hits, all of them singles, and<br />\nPhilip Small of Hopkins easily dash, when Lankford forged ahead first few laps, it was Scharpf and formed as yet. Nat<br />\nSoifer, a Junior,<br />\nJohnny Stevens displayed a flash of gained the Middle Atlantic Single around the first two turns. At the Driscoll digging<br />\nand staying in the and George Thaler, a Freshman, are<br />\npower with his triple in the sixth Foil Title by defeating Levine of third turn, Kirchlager of Swarthmore fore, and Purcell of Swarthmore was new additions to the squad.<br />\nMaryland 5-3. Levine placed second. coasted into the number one spot and about 20 yards behind.<br />\ninning.<br />\nAtwater of St. Johns won the indi- was never headed as he raced to the<br />\nAt the eighth lap it was still<br />\nHurls First Game<br />\nvidual<br />\nepee championship and Hei- finish line.<br />\nDesperatcly Lankford Driscoll in the number one position,<br />\nITPAYS TO GO TO THE<br />\nCarper, a converted outfielder,<br />\nman of Maryland won the individual strove to overtake the Garnet speed- with Scharpf only yards ahead of<br />\nthe<br />\nhurled his first game and showed sabre championship.<br />\nThere were ster, but all he could do was place a Swarthmore foe. Slowly the Swarthsome signs of promise, although he gold and silver medals awarded<br />\nfor second.<br />\nmore lad closed the gap and worked<br />\nwas a trifle wild. He pitched himself the individual championships.<br />\nNOW PLAY/N6-•<br />\nWithout a spirited<br />\nGarnets Take Shotput<br />\nInto second place. At the tape it was<br />\ninning<br />\nWhen<br />\ninto a hole in the first<br />\nMUNI../N H/S<br />\nMeanwhile the strong-armed lads Driscoll, Purcell, Scharpf in that<br />\nVince,<br />\nJoseph<br />\nOlymcoach<br />\nof<br />\n1936<br />\ntwo runs were scored and was<br />\nGREATEST AND/<br />\npic Team and coach of New York of both groups were testing their order.<br />\ntouched for six runs in the fifth<br />\nLATES<br />\nOLE./<br />\nStop in for a try-on.<br />\nUniversity College, officiated. An ex- prowess with the 16-pound shot. The<br />\ninning.<br />\nSchloss prices are within<br />\nhibition match was given by Coach heaves of Carlton, Steingrob, KerHopkins scored a run in the sebond<br />\nSOCCER NOTICE<br />\nyour means<br />\nPaul Kaiss and Joseph Vince in the stetter and Zheutlin couldn't match<br />\nInning when an error, a wild pitch, three-weapon foil, sabre and epee.<br />\nthose of the Philadelphia athletes. In<br />\nA picture of the Johns Hopkins<br />\nand a single by Alperstein enabled<br />\nElection for captain of the '38 sea- these opening two events, the Maroon<br />\nSoccer Team will be taken for the<br />\nSmith to get home. The Jay team son will be held in the near future and White piled up a strong lead.<br />\nrang the bell again in the fifth inning at the Barn.<br />\nThe Garnets swept the hurdles, Hullabaloo on Tuesday afternoon,<br />\nApril 20, at 4 o'clock at the Gym.<br />\nwhen Hartke, the Hopkins steady<br />\nhigh and low. In the latter, Pearson<br />\nshortstop, doubled, and Clisham drove<br />\nof Swarthmore ran an outstanding<br />\nhim in with a single to center field.<br />\nrace.<br />\nSOFTBALL<br />\nIn their half of the seventh the<br />\nCaptain Graziano gave the Jays<br />\nBlack and Blue team staged a threeIn the Interfraternity Softball their initial first place in the javelin.<br />\nEast Lexington St.<br />\nrun rally when Hartke and Zavert- League, Beta Theta Pi and Alpha The husky leader flung the spear 160<br />\n(no wh<br />\nGift)<br />\n• ON<br />\nS Ty? G<br />\nRubinpinch-hitter<br />\nand<br />\nwalked,<br />\nnick<br />\nTHE WORLD FAMOUS ORGANISTS<br />\nEpsilon Pi are leading Division A feet 1 inch.<br />\nger and Alperstein singled. However,<br />\nJewelers and Opticians<br />\nA4R..4~1 44RS.<br />\nAttention now turned towards the<br />\nwith two wins each, leaving Delta<br />\nthe rally was cut short when Carper<br />\n100-yard<br />\ndash.<br />\nGross of Swarthmore<br />\nUpsilon and Delta Phi on the botAT THE CONSOLES OF THE<br />\nfanned, and Romanofsky flied out to<br />\nshot out of the \"holes\" at top speed<br />\ntom with two losses.<br />\nPEN and PENCIL SETS<br />\nTWIN ELECTRIC ORGANS<br />\nJ. H. FURST CO.<br />\nleft field.<br />\nat<br />\nthe 40-yard was leading the<br />\nIn Division B, no team having and<br />\ngad. OTHER. BIG ACTS s<br />\nPrinters of<br />\nThis week-end the Hopkins nine<br />\nas yet played two games, S. P. E., pack. Baetjer began his power drive,<br />\nPHILOLOGICAL<br />\nand<br />\nwill travel to Philadelphia to encounBALT/NORES.,ONLY,DOWN<br />\nTau Alpha Phi, and Phi Eps are and at the 60-yard marker he was<br />\n3222 Greerunount Avenue<br />\nSCIENTIFIC PUBLICATIONS<br />\nter Drexel on Friday and Swarthmore<br />\nTOWN<br />\noutdistancing<br />\nDELUXE<br />\nSHOW<br />\nSTAGE<br />\nall.<br />\nGraziano<br />\ncame<br />\nup<br />\nleading with one win each.<br />\n12-20 Hopkins Place<br />\non Saturday.<br />\nfast to hold second position. They<br />\nBaltimore<br /><br />\nWHAT'S<br />\nSPRING<br /><br />\n11 tiiI7T3<br /><br />\nnew<br />\nSchloss Suit or Topcoat<br /><br />\nAS LOW AS $3,<br /><br />\nJos. Schloss<br />\n&amp; Son<br /><br />\nKIBLER'S<br /><br />\n5<br /><br />\nJESSE CRAWFORD<br /><br />\n-,<br />\n•<br /><br />\n, Smokers always get more<br />\npleasure from a cigarette made of<br />\nthe right combination of our best<br />\nhome-grown tobaccos blended with<br />\nthe best aromatic Turkish.<br />\nThat's why Chesterfield tobaccos<br />\ncome from far and near.... aromatic<br />\ntobaccos from the Near East...sunripened tobaccos from our own<br />\nSouthland.<br />\nOur buyers pay the price and get the<br />\nbest tobaccos from all the leading<br />\nmarkets of the world to give men<br />\nand women the best things smoking<br />\ncan give them ... refreshing mildness, pleasing taste and aroma.<br /><br />\n..a &amp;lanced Wendfthe<br />\nworldsfinest cigarette idaccos<br />\nCopyright 1937. Liccrrr &amp; MYERS TOBACCO Co.<br /><br />"}], "field_media_file": [{"target_id": 39102, "display": null, "description": null, "target_type": "file", "target_uuid": "20443f9f-297a-4c40-af65-65f561904d46", "url": "http://digital.library.jhu.edu/system/files/2022-03/12778-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12778, "target_type": "node", "target_uuid": "489e313a-9601-457e-8add-622b30226492", "url": "/node/12778"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "f63da72e-cf4e-4aa7-8f55-10de9af8b45e"}]}