{"mid": [{"value": 36891}], "uuid": [{"value": "435bd6ce-454b-48a3-951a-374283a58186"}], "vid": [{"value": 36891}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:55:38+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13080-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:55:38+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:55:38+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVIII, No. 8<br />\n<br />\nTHE JOHNS IIOPKINS NEWS-LETTER, OCTOBER 30, 1923<br />\n<br />\nWARDLAW DR. J. WHITRIDGE WILLIAMS Y. M. C. A. LIST GIVES REL<br />\nCAPTAIN<br />\nRESIGNS AS DEAN OF<br />\nON<br />\nTALK<br />\nGIVES<br />\nMILES<br />\nLIGIOUS REGISTRATION<br />\nMEDICAL SCHOOL<br />\nLITERATURE AT ASOF HOPKINS STUDENTS<br />\nSEMBLY<br />\nFamous Professor to Head New Wom- Undergraduates are Catalogued Accorden's Clinic at Hopkins Hospital<br />\ning to Church Preference by Y<br />\nHopkins Graduate Discusses Two As'23<br />\nof<br />\nLiterature.<br />\nClass<br />\npects of<br />\nDr. John Whitridge Williams, Methodists outnumber students<br />\nto Hold Dance After St.<br />\nfor thirteen years Dean of the of any other faith at Johns HopJohns' Game<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHAVERFORD HOLDS BLACK<br />\nAND BLUE ELEVEN TO 9-0<br />\nSCORE IN CLOSE CONTEST<br />\n<br />\nMedical Faculty of Johns HopCaptain Wardlaw Miles, a Hop- kins University, has tendered his kins College, according to the reckins graduate, war hero, and pres- resignation from that position to ords of the Y. M. C. A. The church<br />\nent headmaster of the Gilman the Medical Faculty, in order to preference .summary compiled by Quakers Surprise Hopkins<br />\nTeam, Holding Them ScoreCountry School, delivered a very be free to take full charge of the the Y. M. C. A., according to the<br />\nless Until the Fourth Period<br />\ninteresting lecture on literature at new Women's Clinic, recently es- professions of religion made on Y.<br />\ntablished at the Hospital.. Dr. M. C. A. registration cards, proves<br />\nAfter battling through three quarters of the game without scoring<br />\nthe assembly last Thursday. AlWilliams' resignation was anHopkins eleven filially triumphed over Haverford in the closest<br />\nthe<br />\nvery interesting. No one of the<br />\nthough his subject was general, nounced last Friday.<br />\nthree religions that come first on contest which has been waged by the Black and Blue. The game<br />\nCaptain Miles selected his examples<br />\nThe Women's Clinic will be<br />\nwas scoreless until the fourth quarter when Turnbull kicked a field<br />\nentirely from English literature, completely organized within a the list greatly outnumbers the<br />\nfew weeks. The money for its other two. The 122 Methodists goal and Bonner edged around end for a touchdown. Haverford<br />\nespecially poetry.<br />\nCaptain establishment and maintenance are closely pursued by 119 Jews played a strong defensive game, although at times the Quakers<br />\nbegan<br />\n\"Literature,\"<br />\nMiles, \"lends itself to division into was given in 1919 by an anony- and 115 Episcopalians. It is note- stepped into a forward pass game that threatened the\"Hopkins goal.<br />\ntwo general classes: first, literature mous donor. It will be entirely worthy that there are, so many A crowd of four thousand people, including a great many women,<br />\nthat has to do with external life and under the supervision and direc- Episcopalians at Hopkins, for, as was on hand to witness the struggle, which was played at the unobvious things, the literature of ac- tion of Dr. Williams, and will be a rule, their number is propor- usual hour of eleven in the morning.<br />\nThe Hopkins team started the<br />\ntion, actualities; and facts; second, solely for the care and treatment tionately smaller in other colleges.<br />\nthe literature of escape from life. of women. Students at the Med- The reason for this large body ot CONSTRUCTION OF GIANT game with a rush, which seemed to<br />\nHYDRO-ELECTRIC PLANT overwhelm the visitors. As soon as<br />\nThe first kind has as its object ,ap- ical School, it was pointed out, Episcopalians is uncertain.<br />\nIN CALIFORNIA SHOWN<br />\nProach to life; the second, as its will now have a better opportuniThen there is a big drop to anthe local squad got possession of<br />\nty for advanced work, and a<br />\nBY MOVIE<br />\nname indicates,, escape from life.<br />\nother group of three religions. The<br />\nthe ball they made an advance up<br />\n\"The literature of approach is as chance to obtain, special knowl- Presbyterians lead this group with 'Frozen Credits\" Shown Last Wednesthe field to within twenty yards of<br />\nday to Engineering Juniors and<br />\ngood a name as we can find for the edge, in this line of endeavor.<br />\n65 students; then come the 58<br />\nSeniors<br />\nin<br />\nC.<br />\nE.<br />\nHall<br />\nWilliams<br />\nDr.<br />\nthe<br />\nsucceeded<br />\ngoal line, but the Pennsylvanians<br />\na<br />\ndisfirst class,\" said Captain Miles. \"All<br />\nCatholics and the 48 Lutherans.<br />\ntinguished<br />\nline<br />\nof<br />\nDeans:<br />\nDrs.<br />\nThrough<br />\nthe<br />\ncourtesy<br />\nthe<br />\nof<br />\nheld them tight and when Taylor<br />\nprimitive literature,\" he continued,<br />\nAs a great many of the Roman<br />\n\"comes under this head, and the Welsh, Osier and Howell. His Catholics of the city attend a Stone-Webster Construction Com- attempted a pass to Rich a Haverepics can well be included. In prim- own resignation has not been Catholic college, the number of pany, Inc., the Hopkins Engineer- ford man pulled the pigskin out of<br />\nitive times, battle, the struggle for formally accepted as yet, but it is Catholics is much smaller than it ing Department obtained the loan<br />\nthe air only to be tackled where he<br />\ne?cistence, bravery, and sex were of expected that it will be at the next would otherwise be. These 58<br />\nof an excellent movie entitled stood. Haverford kicked to Hopgreatest interest to men, and found meeting of the Medical Faculty. Catholics include four men who<br />\n\"Frozen<br />\nCredits,\" which depicted at kins, giving the home team another<br />\nA<br />\nnew Dean will be selected at<br />\nPlace in their literature. In other<br />\nprofess the religion of the Greek<br />\nWords, this is the literature of the the same time, and will assume Catholic Church. The students are some length the construction of the chance to score. This time Taylor's<br />\nrelation of man to man, and of man his duties as soon as Dr. Williams from Russia, where there is a Caribou Hydro-Electric Plant of passing and Yoeman's effeCtive<br />\nto society. 'Beowulf' and the 'An- has cleared up the work on hand, much•greater percentage of people the Great Westetn Power Com- gains through the line put<br />\nthe Black<br />\nglo-Saxon Chronicle' are early ex-- and is ready to take charge of the that have membership in this pany of California. This movie, and Blue again within striking diswhich was shown last Wednesday tance. Haverford held solidly and<br />\namples of this class. Scott's stirring clinic.<br />\nchurch.<br />\naccounts of battles come under this .Dr. Williams has had a brilNext in number are those who at 4:15 P. M. in the Auditorium the Homewood team was forced to<br />\nhead. The literature ol approach liant career, during the most part give no preference to any church. of the Civil Engineering Building, attempt a field goal. Turnbull was<br />\nto life was Shakespeare's forte also. of which he has been connected If the Baptists are omitted—the was seen by the juniors and seniors hurried in his kick, however,<br />\nand<br />\nIn \"King Henry IV,\" Hotspur's ac- in one way or another with Johns Baptists. have a membership of 26 of the mechanical, civil and electric- the ball sailed wide of<br />\nthe bars.<br />\ncount of why he failed to deliver Hopkins. He was born January —the students who do not belong al engineering departments. Prof. Immediately after the second<br />\nhis prisoners to a 'certain lord, neat, 26, 1866, in Baltimore, the de- to any religious organization or Alexander G. Christie, head of the quarter started Slowick was sent in<br />\ntrimly dressed'; and in 'Macbeth,' scendant of a long line of medical organism equal those of the remain- Mechanical Engineering Depart- to replace Carter at tackle. Durthe discussion of the 'voice' that ancestors: his father, grandfather ing religions together: There are 46 ment, explained the various steps ing this perior of the<br />\ngame both<br />\ntrouble's Macbeth after-the murder and great-grandfather having fol- men who Profess the religion of no shown in the movie.<br />\nteams opened up their aridl attacks,<br />\nof Duncan are examples of Shakes- lowed that profession in Baltimore church, while there are 50 men<br />\nThe movie began with an ani- which they continued until the final<br />\npeare's work in this field. Pope, since 1820. He graduated from who comprise those of the other mated cartoon showing the manner whistle blew. Hopkins' forward<br />\ntoo, was true to life,—the narrow, Johns Hopkins with an A. B. de- religions represented in the col- in which the moisture taken up by passing was more effective than<br />\nPetty, mean life of his day. Rud- gree in 1886; in 1888 he was lege. These men are distributed the sun from the Pacific Ocean is that of Haverford, though it was<br />\nYard Kipling was mentioned as the awarded the M. D. degree by the as follows: Ten Reformed Chris- carried eastward by the wind and not strong enough to place the ball<br />\ngreatest living exponent of this University of Maryland, and he tians, nine Methodists Protestant, deposited as snow on the Sierra over the goal line. On one occatype of poetry, and his `M'Andrew's studied in Germany during the while, as was shown before, there Nevada Mountains. During the sion the Black and Blue worked<br />\nHymn' was cited as an example. following year. In 1889 he re- are 122 Methodists Episcopal, summer the sun causes the snow the ball up to the one yard line only<br />\n\"This,\" concluded Captain Miles, turned to his native city and be- seven Brethren, six Congregation- to melt and form the raging moun- to be held there by the Haverford<br />\n\"is the literature of power, of pas- gan his long connection with alists, fOur Friends, four Disciples, tain streams., It is the power fur- team. The visitors' punter<br />\nwas unJohns Hopkins as a doctor and three Unitarians, three Christian nished by these \"frozen credits\"<br />\nsion, of actuality.\"<br />\nable to place the ball out of danger<br />\nThe literature of the escape from teacher.<br />\nScientists, two Evangelists, one that is used in the hydro-electric and Hopkins again worked the ball<br />\nThe Medical School opened in- Theosophist and one Universalist. plant to generate electric current. to within striking distance. Bonlife, too, includes works of great<br />\nThere is a total of 649 students The Caribou<br />\nHydro-Electric ner, who was substituted for YoeWriters of all ages. Shakespeare's 1893 and Dr. Williams was named<br />\nPlant, which is situated in the heart man, held the ball on the twentyHamlet\" is an excellent example assistant professor of obstetrics. enrolled in the college.<br />\nof the Sierra Nevada Mountains, five yard line, while Turnbull atof this class of literature. Keats' Six yeais later he was made proCHURCH PREFERENCT<br />\nproduces 60,000 electrical horse- tempted another unsuccessful place\"Ode to a Nightingale\" and Shel- fessor, and in 1911, upon the resSUMMARY<br />\nley's \"Ode to the West Wind\" ex- ignation of Dr. Howell, Dr.'Wil- Methodist<br />\npower.<br />\nBefore being led into the ment kick. Haverford immediate122<br />\nPelton<br />\nwater<br />\npress particularly well the desira- liams was named Dean of the Jewish<br />\nwheels, the water ly kicked back to Hopkins, but the<br />\n119<br />\nbility of escape 'from life; indeed, Medical Faculty, in which posi- Episcopal ,<br />\n115 passes through four miles of tun- quarter ended before they could get<br />\nShelley is considered by many pre- tion he has continued ever since Presbyterian<br />\n65 nels bored through solid rock and is again within striking distance.<br />\neminent in this field. \"It is a ques- with distinguished success.<br />\nCatholic (Greek and Roman) 58 impounded against a 'giant dam. Haverford received the ball from<br />\ntion,\" Captain Miles pointed out,<br />\nContinued on Page 3, col. 2<br />\n48 The steps in the construction of the the kick-off, running it back to the<br />\nLutherans<br />\n,‘•<br />\nJust what effects economic, social,<br />\n26 tunnels, the dam, and the power middle of the field. The Quakers<br />\nBaptists<br />\nand political conditions have here.\"<br />\n10 house itself, were shown in detail. were unable to make their distance,<br />\nReformed<br />\nThe speaker drew an analogy beMethodist Protestant<br />\n9 The construction of the plant however, and a poor punt gave<br />\ntween poetry and music as the<br />\n7 was in charge of Mr. E. K. Shut- Hopkins the ball in an advantagBrethren<br />\nmeans of which men avail themCongregationalists<br />\n6 tleton, the western manager of the eous position. Yoeman, who had<br />\nselves to get away from the world;<br />\nFriends<br />\n4 Stone-Wester Co., and a corps of gone back in the game in Bonner's<br />\nand mentioned Swinburne's \"Hes4 experienced engineers, all of whom place, was not able to make the<br />\nDisciples<br />\nperia\" to show how closely poetry<br />\nUnitarians<br />\n3 were shown in the movie.<br />\nheavy gains he had made in the<br />\nand music are related.. Music adChristian Science<br />\n5<br />\nBefore<br />\nfirst half, as the Quakers set up a<br />\nmittedly is more universal and has<br />\nEvangelical<br />\n2<br />\n\"stone-wall\" defense. Two beautia wider range of influence than<br />\nTheosophist<br />\nful passes, one by Taylor to TurnMeeting of News-Letter<br />\nPoetry, however. Humor is another<br />\nUniversalist<br />\n1<br />\nbull and the other by Maxwell to<br />\nBusiness Staff and candidates<br />\nIneans cif escape from the life about<br />\nNo preference given<br />\n46<br />\nRich, seemed to Make a touchdown<br />\ntoday at 12.20. All MUST<br />\ntts ; and humorous works such as<br />\ninevitable but the following .plays<br />\nbe present.<br />\n649<br />\nTotal registered<br />\nContinued on page 3, col. 2<br />\nContinued on page 4 col. 3<br />\n<br />\n11<br />\nDAYS<br />\n<br />\nSt. John'<br />\nGame<br />\n<br />\n\fTHE JOHNS HOPKINS NE WS - LETTER, OCTOBER 30, 1923<br />\n<br />\n2<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\n\"The chorus, which supports<br />\nforty-five voices, was selected<br />\nfrom approximately one hundred<br />\napplicants. The try-outs were -held<br />\nin the form of sextettes, and each<br />\n$2.00 applicant was required to know<br />\nand uphold his part.\"<br />\n<br />\nNews-Letter<br />\n<br />\nFOUNDED 1897.<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress., November 3, 1879.<br />\n<br />\nThe \"Kentucky Kernel\" thus<br />\ncomments on the forthcoming production of \"Martha\" by the music<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\ndepartment of the University of<br />\nKentucky. The entire score is to<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UiTIVERSITY ; all articles and other communications be presented.<br />\nshould be sent to the MANAGING EDITOR.<br />\nKentucky<br />\nWith<br />\npresenting<br />\ngrand opera successfully, we can't<br />\nHomewood 100<br />\nrelephone<br />\nunderstand the fond pessimists<br />\nwho fear the Barnstormers' allBusiness Manager<br />\nEditor-in-Chief<br />\nEIopkins musical comedy “won't<br />\nJOSEPH LEOPOLD, '24.<br />\nPHILIP W. HOWARD, '25.<br />\nget over.\"<br />\nManaging Editor<br />\nWILLIAM G. DEAN, JR., '24.<br />\n<br />\nAdvertising Manager<br />\nFITZGERALD DUNNING, '24.<br />\n<br />\nAssistant Managing Editor<br />\nT. REESE MARSH, '24.<br />\n<br />\nCirculation Manager<br />\n<br />\nAssociate Editors<br />\n<br />\nJOHN C. LEWIS, JR., '24.<br />\n<br />\nRICHARD C. TILGHMAN, '25.<br />\nJOHN W. PARSONS, '25.<br />\nBENJAMIN T. ROME, '25.<br />\n<br />\nAssistant Business Managers<br />\n<br />\nJunior Editors<br />\nV. EDWARD THOMSEN, JR., '26.<br />\nARTHUR L. NELSON, '26.<br />\nERNEST A. STRATHMAN, '26.<br />\nALGER G. Hiss, '26<br />\nEDWARD 0. MICHEL, '26.<br />\nCHARLES G. HUTZLER, '24.<br />\n<br />\nD. MILES MARRIAN, '25.<br />\nG. DONALD GIESKE, '25.<br />\nJOHN T. DIXON,'24.<br />\nA. J. MoKAY, '26.<br />\nC. EUGENE TOVELL, '24.<br />\nOTHO J. KELLER, III, '26<br />\nJ. JACKSON KIDD, '26<br />\n<br />\nAfter signing the new coupon<br />\nbook of the Athletic Association<br />\nwe felt as though engaged in a<br />\nlegal duel with the athletic authorities. On looking through it we<br />\nwere reminded of those delightful<br />\n\"Japanese paint books for the little tots,\" with pages covered by<br />\nwater color paint.<br />\n<br />\nThis column hereby announces<br />\na prize (to be decided upon later)<br />\nMember Southern Intercollegiate Newspaper Association<br />\nror the best plan to fasten these<br />\nbooks to purchaser so that they<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nwon't wear off. A ready market is<br />\nexpected for the article so devised.<br />\nCane Clubbers will be especially<br />\nBALTIMORE, MD., OCTOBER 30, 1923<br />\ngrateful to the inventor.<br />\nThe rules and regulations for<br />\nthe contest are one. Mr. Keyes<br />\nMAKING THE CAMPUS DRY<br />\nmust not be told of its existence.<br />\nThe Volstead Act has nearly succeeded in demonstrating the He may wrongly regard it. as an<br />\nveracity of the statement \"you can prove anything by figures.\" While attempt to make box office sales<br />\nProhibitionists by a lengthy array of statistics, show that crime and fall off.<br />\n*<br />\ndrunkenness are on the wane, disciples of Colonel Hill, with an<br />\nequally formidable array, prove conclusively that such disorders have<br />\nIt will be interesting to deterincreased materially since the ratification of the Eighteenth Amend- mine the efficacy of prayer when<br />\nment. As far as we can ascertain, however, no one has succeeded the \"Praying Colonels\" of Centre<br />\nin manipulating figures in such a way as to prove that drinking has meet the avowed, highly adverdecreased in the colleges. Literature on the subject agrees unani- tised, shameless atheists of Kenmously that college men imbibe at least as frequently as of yore and tucky this Saturday at Danville. It<br />\ntakes yards of prayers to strangle<br />\nit has been asserted that the only decrease that has been noted is in<br />\na wildcat, the official title of the<br />\nthe quality of the liquor.<br />\nKentucky players.<br />\nThe matter has grown so serious at Yale that the President of<br />\nthat University recently threatened the expulsion of anyone found<br />\nguilty of carrying liquor into college buildings. We fear that this<br />\nedict will not cause the Yale campus to dry up instantaneously. Custom officials will agree that John Barleycorn is a very elusive person.<br />\nAnd if Yale authorities do succeed in keeping liquor out of the dormitories, it will only be another case of Mohammed and the mountain.<br />\nAs the Volstead Act has failed to dry up the Union, so will any<br />\nrules or regulations fail to dry up the. colleges. The college man,<br />\nperhaps more than any other individual, resents any infringement of<br />\nliberty.<br />\nPerhaps this is the reason why no one has succeeded in proving<br />\nthat drinking has decreased on college campuses.<br />\n<br />\nTHE PUBLICITY BOARD<br />\nPublicity Boards and Press Clubs at many colleges are large<br />\nbodies with many and diverse duties. It is through these mediums<br />\nthat the colleges and universities at which the organizations are located, obtain the majority of their advertising in the local and outside press and in preparatory schools.<br />\nAt Hopkins the Publicity Board, through lack of sufficient financial support and the absence of co-operation, has an extremely limited scope. It is true that the Board is young, the work accomplished, however, is negligible compared to that of similar organizations in other colleges.<br />\n0. D. K. has already appointed a committee to investigate the<br />\nactivities of the Board. The A. A. Board, the Students' Activities<br />\nCouncil, and other organizations, should give the question consideration.<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\n1923. Union University. (New<br />\nPI DELTA EPSILON<br />\nIt is of interest to note that York).<br />\n1923. Lafayette College.<br />\nsince the establishment of a chap1923. Emory University.<br />\nter of Pi Delta Epsilon (Honorary<br />\nJournatistic Fraternity) at<br />\n1923. Wabash College.<br />\n1923. Carnegie Institute of<br />\nhigh in 1920, the follow.ing- chapTechnology.<br />\nters lave been installed:<br />\n19z1. Hamilton College (New<br />\nThe role of active chapters is<br />\nnow 37. The membership of Pi<br />\n1921. Swarthmore College.<br />\nDelta Epsilon is purely honorary<br />\n1921. University of Utah.<br />\nin the sense that achievement in<br />\n1922. Allegheny College<br />\njournalistic work is always an es'1922. University of Ariz,:<br />\nsential qualification, but the fra1922. Bowdoin College.<br />\nternity strives to maintain a so1922. Colorado<br />\nAgr -Atli L. ra I cial organization in all colleges<br />\nSchool.<br />\nand universities where it is estab192. Georgia Institute of Tech- lished.<br />\nnology.<br />\n-The Brown &-White.<br />\n19z2 George Washington University.<br />\nA quartet has just finished sing1922. Johns Hopkins Universi- ing \"Among the Sleepy Hills of<br />\nty.<br />\nIen-Ten-Tennessee.\"<br />\n1922. University of Minnesota. The hostess noticed one of her<br />\nguests weeping by himself. She<br />\n1922. Ohio State University.<br />\n1922. Stevens Institute of Tech- inquired sympathetically:<br />\n\"My dear man, are you a Tennology..<br />\nnessean?\"<br />\n1922. Vanderbilt University.<br />\n\"No, madam,.1 am a musician.\"<br />\n1922. Wesleyan University.<br />\n-Oklahoma Daily.<br />\n1922. Williams College.<br />\n<br />\nWa<br />\n<br />\n11<br />\nfan<br />\nand<br />\n<br />\nfro<br />\n<br />\nhis<br />\n<br />\nDe;<br />\n<br />\neati<br />\nof<br />\n<br />\nis<br />\nbre<br />\ntrii<br />\n<br />\ncor<br />\nEl(<br />\nha(<br />\nera<br />\n<br />\nN(<br />\nIan<br />\nsli<br />\n<br />\nBr<br />\nbo<br />\nco:<br />\nidl<br />\n<br />\nea<br />\n<br />\nRi<br />\n<br />\nEl<br />\ntri<br />\nits<br />\n<br />\n11(<br />\n<br />\nSi<br />\n1<br />\nti<br />\n<br />\n1 .0 one ever<br />\ngets tired of<br />\nMelachrinostheir unfailing<br />\nquality is a constantsatisfaction.<br />\n<br />\nti<br />\n<br />\nh,<br />\n<br />\nf(<br />\ne:<br />\n<br />\na<br />\n<br />\nT1<br />\n<br />\nORIGINAL<br />\n<br />\n11<br />\nNM ails wom-1111.1.8111•11<br />\n<br />\nMa<br />\n<br />\nMELACHRIN<br />\n\"The One Cigarette Sold the World Over\"<br />\n<br />\nConcerning art: we would<br />\nstrongly advise-at the risk of being misunderstood-having a few<br />\nclasses in the Botanical Gardens<br />\nbefore the tulip poplars shed their<br />\ntruly golden foliage.<br />\n<br />\n(STETSON<br />\n<br />\nt,<br />\n<br />\nt'<br />\n<br />\n*<br />\n<br />\nConcerning publicity: some universities are born famous, others<br />\nachieve fame, and still others have<br />\nfame thrust upon 'em-to paraphrase Shakespeare. The suddenness with which the formerly- obscure Centre College achieved<br />\nfame and, more important, a quadrupled enrollment, set all colleges<br />\nto encouraging McMillans to enter<br />\ntheir historic halls, for the football<br />\nseason at least. Many seats of<br />\nlearning had so propitious a start<br />\nas to be justly described as \"born<br />\nfamous,\" but few have this most<br />\nimportant gift \"thrust upon 'em.\"<br />\nThe interesting discussion started<br />\nby Professor Van Dyke as to the<br />\nauthenticity of many paintings<br />\nlong considered works of Rembrandt, has caused Rutgers to<br />\nstand forth in the glare of public<br />\nnotice.<br />\nOur publicity board might make<br />\nuse of the opportunity presented<br />\nby our faculty.<br />\n<br />\n• C.<br />\n<br />\n9<br />\n<br />\nHats<br />\nStyle and .Quality are the two essentials of<br />\na good hat, but it does not pay to buy one<br />\nwithout the other. All Stetsons have both.<br />\nSTYLED FOR, YOUNG MEN,<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS. LETTER, OC r*.BER 30, 1923<br />\n<br />\n;CNN'<br />\n<br />\n3<br />\n<br />\nC. P. STEINMETZ, ELECTRIC- CAPTAIN L. WARDLAW MILES EDITOR-IN-CHIEF MAKES AP- HARVARD BUSINESS SCHOOL<br />\nGIVES TALK ON LITERATURE<br />\nAL WIZARD,DIES SUDDENPOINTMENTS TO HULLAANNOUNCES A MIDYEAR<br />\n\" AT ASSEMBLY<br />\nBALOO<br />\nSTAFF<br />\nENTRANCE PLAN<br />\nLY IN SCHENECTADY<br />\nContinued from page 1<br />\nWas one of Greatest Contributors to \"Alice in Wonderland\" are popular<br />\nFitzgerald Dunning. editor-in- Three Hopkins Graduates Already RegModern Science<br />\nistered in School<br />\nchief<br />\nof the 1924 Hullabaloo, has<br />\nfor this reason. \"Humor,\" Captain<br />\nSteinmetz,<br />\nDr. Charles Proteus<br />\nOf distinct interest to seniors<br />\nMiles said, \"is the intellectually elected the editorial staff of the<br />\nfamous for his work in electriicty poor man's escape.\"<br />\nyear book. The selections are as who are graduating at Midyears is<br />\nand mathematics, died suddenly<br />\nStudents who jostle their way<br />\nIn commenting further on these follows: Managing Editor, Joseph the announcement of a Midyear Enfrom heart disease last Vriday at two classes of literature, the speak- Leopold; Associate Editors, John<br />\ntrance Plan just made by the Har- through the crowded halls of<br />\nhis home in Schenectady, N. Y.<br />\ner said one was not to be put above H. Croker, 'Thomas M. Jenifer, vard Graduate School of Business Western Reserve will find it .hard<br />\nDeath came while the \"wizard\" was the other; both serve their,purposes. John T. Martin, Charles G. Hutzto realize that less than a hundred<br />\neating his breakfast in the presence \"It is well to remember,\" he went ler, George Klinefelter, Hugh M. Administration.<br />\nyears ago there were only three<br />\nhave<br />\ntwo<br />\nyears<br />\na<br />\nfew<br />\nmen<br />\nFor<br />\nof the attending physicians.<br />\non, \"that there are two kinds of es- Smallwood, Herman. Chor, and<br />\nbeen<br />\npermitted<br />\nto<br />\nenter<br />\nin<br />\nFebrustudents enrolled in the college.<br />\nThe immediate cause of his death cape; the coward from the battle of Charles McLane ; Photographic<br />\nary. As a result of the experience Reserve is now in its ninety-eighth<br />\nIS thought to have been a physical<br />\nlife when he finds the going rough, Editors, William H. B. Howard<br />\nbreakdown hrought on by a recent and the escape of the brave man and Russell Passano; and Art Ed- with these students, the School is year of academic life, with. an ennow prepared to offer the same<br />\ntrip to the Pacific Coast.<br />\nfrom his dungeon to the battle. The itor, Isaac Hamburger, II.<br />\ncourses of study that are available rollment of nearly four thousand.<br />\nDr. Steinmetz, who was chief problem of life is to 'idealize your<br />\nBefore these men can officially<br />\n—Teaser.<br />\nconsulting engineer of the. General real and realize your ideal.' Writers act in their new capacity, their to those entering in September.<br />\n* * *<br />\nThe program of work has been<br />\nElectric Works, Schnectady, N. Y., of the first class of literature un- selection must be ratified by the<br />\nso<br />\nadjusted that students entering<br />\nHarvard University enters its<br />\nhad been connected with the Gendertake to idealize their real; writ- Senior class. This is the result of<br />\nat<br />\ntime<br />\nwill<br />\nto<br />\ncomplete<br />\nthat<br />\nbe<br />\nable<br />\neral Electric Company since 1892. ers of the second class, to realize<br />\n288th year. The largest freshman<br />\na motion passed last year to give the regular work for the degree of<br />\nThree years before he arrived in their ideal.\"<br />\nthe class a check upon the powers Master in Business Administration class of the institution has enrolled<br />\nNew York from Zurich, Switzerthis fall, numbering 930.—Teaser.<br />\nCaptain Miles disagreed with of the editor-in-chief.<br />\nin the usual two years, graduating<br />\nland, penniless and ,with ‘a very James Branch Cabell, whose whole<br />\nThree of the most prominent<br />\nDunning proposes to start work in February of the second year folSlight knowledge of English.<br />\nphilosophy, he said, is based on almost immediately so that the<br />\nstudents at Oxford are at present<br />\nlowing their entrance.<br />\nEducated in the University at make believe. Life, true enough, is<br />\nin this country for the purpose of<br />\nindividual<br />\nwrite-ups<br />\ncan<br />\nbe<br />\ndisapplisummer<br />\nDuring the past<br />\nBreslau, Germany,- where he was rough in spots, but not so rough<br />\nposed<br />\nof<br />\nand<br />\nthe<br />\nstaff<br />\ncan<br />\nturn<br />\ncations from 443 men for admis- debating at a number'of the most<br />\nborn April 9, 1865, Dr. Steintnetz that we cannot find in it work and<br />\ntheir<br />\nattention<br />\nto<br />\nwriting<br />\na<br />\nbigsion td the School in September important Eastern colleges. The<br />\nContinued his education at the Zur- a place for ourselves. At the same<br />\nger<br />\nand<br />\nbetter<br />\nbook:<br />\nAt<br />\na<br />\nmeetwere received. From • this number schedule includes appearances at<br />\nich Polytechnicium.<br />\ntime, the speaker conceded, few of ing held yesterday plans were<br />\nonly 332 could be finally accepted such schools as Yale, Harvard,<br />\nThis education enabled him to us are so contented with our lot<br />\ncussed<br />\ndefinite<br />\nbut no<br />\nmatters de- and enrolled. A comparison with Princeton, Columbia and Cornell.<br />\nObtain employment shortly after he that we not wish at times we could<br />\n—Vanderbilt Hustler.<br />\ncided. There is so much room for corresponding figures for last year<br />\ncaryie to the United States in the<br />\nget.away from it all. For that very originality and individuality in<br />\nof 302 applications received and 247<br />\n* *<br />\nmanufacturing establishment of reason the second type of literature<br />\nsuch<br />\na<br />\nbook,<br />\naccording<br />\nto<br />\nDunngrowing<br />\nthe<br />\nshows<br />\nmen<br />\nadmitted,<br />\nWhittle,<br />\npresident of<br />\nCharles<br />\nE.<br />\nRudolph Eicherneyer at Yonkers, exists.<br />\ning,<br />\nthat<br />\nevery<br />\nmember<br />\nof<br />\nthe<br />\ntraining<br />\ngiven<br />\nby<br />\ndemand<br />\nfor<br />\nthe<br />\nCollege,<br />\nin<br />\nKentucky, is<br />\nOgden<br />\nN. Y. A year after the General<br />\nCaptain Miles'addressed the asbut 23 years of age. The \"boy<br />\nElectric Company bought the Eicke- sembly on a similar topic last year, staff has an opportunity to show the School.<br />\nIt was in order to meet this in- president\" was 13 before he saw a<br />\nmeyer plant he was transferred to and the hearty applause he received his ability.<br />\ndemand for admission to railroad and at 19 he was a gradcreasing<br />\nits Schenectady plant, in which city<br />\nthen was repeated yesterday. A R. 0. T. C. TURNS DOWN OFFER TO<br />\ncourses<br />\nthat the recent announce- uate of Yale.—The Wild Cat.<br />\nits<br />\nhe has since made his home.<br />\n\"Hullabaloo for Miles,\" led by JenMARCH IN ARMY-FLEET<br />\nment was made.<br />\nAppointed president of the ifer, was given lustily by the audi***<br />\nPARADE<br />\nIt is expected that this. opporSchenectady Board of Education in ence.<br />\nCollege \"pay day\" is one of the<br />\nThe Military Department demon1912, he was elected president of \"Don\" Vanneman announced that strated its support of Hopkins ac- tunity will prove attractive to those biggest days at Hood College,<br />\nmen 'desirous of entering the School Maryland. It is a day set -aside<br />\nthe Common Council of Schenecthe Class of '23 would give a dance tivities recently when Captain Paul,<br />\nwho will .have completed the re- annually on which everyone pays<br />\ntady three years later. Connected'<br />\nat the Maryland Casualty. Club- acting head of the department,<br />\nfor their college degree<br />\nquirements<br />\nsocieties,<br />\nWith many large electrical<br />\nhis class and club dues and subhouse on Saturday, November 10, ,turned down the request of the<br />\nat M:dyear and who would, there- scriptions to the college publicahe Was given a degree of M. A. by<br />\nthe day of the St. John's game. The Third Corps area officials to have<br />\nFlarvard University and one of pro- dance will be held at night, and the the J. H. U. R. 0. T. C. unit march fore under the more usual pro- tions.—The Blue and Grey.<br />\ngram, lose at least five months befessor of electrical engineering and. subscription will be reasonable.<br />\n* * *<br />\nin the parade before the Army.07e beginning their professional<br />\nelectro-physics by Union College.<br />\n\"Randy\" Norwood announced Fleet game on November tenth.<br />\nYALE, in attempting to satisfy<br />\ncareer. It should also be of inter-The author of a number of stand- that contributions from the SophoThe local commandant stated in his est to those men who, having grad- a crying need in the teaching proard works on electriicty and mathemore and Freshman classes for the refusal that the Hopkins organizafession for men, and men of higher<br />\nmatics, he was a specialist in mag- fund to buy a gift for Mr. Thomas tion owed it to the university to uated in June and gone into busi calibre, is instituting four new<br />\nin.<br />\ntraining<br />\ntheir<br />\nnetics, the symbolic method of al- R. Ball, the retired Registrar, had Participate in the demonstrations ness, have found<br />\nwhose very title are a key<br />\ncourses<br />\nof<br />\nternating current calculations and amounted to $45.18; and that the preceding the game with St. John's adequate for an effective grasp<br />\ncommendable aim. \"The<br />\nto<br />\ntheir<br />\nbusiness conditions<br />\ntransient phenomena.<br />\nSenior and Junior classes would be on the same date. According to<br />\nGrowth<br />\nof Self,\" \"Human LearnThe following men from Johns<br />\nDr. Steinmetz was also noted for called upon to contribute. For the Captain Paul this is a great sacriing,\"<br />\n\"Human<br />\nDifferences\" and<br />\nfiropkins University are among the<br />\nIlls ability to think and write with benefit of the Freshmen, he anfice for him to make as the staff 3t1...cessful<br />\nEducation<br />\nand Teach\"College<br />\nappli.:ants now registered<br />\ngreat rapidity. He even. invented nounced that activities buttons of military instructors is anxious<br />\nfunction<br />\nof the<br />\ning,\" in which the<br />\nin the School!<br />\na very fast system of shorthand for would be given out at.the Barn as to'<br />\nshow the Army and Navy ofYear Main—F. I. Fona- college in American society, its<br />\n.econd<br />\n..his own use.<br />\nsoon as the lists of candidates for ficials who will be here that day as<br />\npurposes, its activities, incentive<br />\nn ff.<br />\nthe various actiVities are complete. well as the people of Baltimore, how<br />\nlearning and methods of teachto<br />\nCromwell<br />\nMen—M.<br />\nJ.<br />\nF.:rst<br />\nYear<br />\nHOW HE KNEW<br />\nGame tags must be worn on Mon- well trained the Hopkins men are.<br />\ning<br />\nwill be discussed.—The PolyTrew.<br />\nPartiss<br />\nand<br />\nClergyman—There was a stranday; Tuesday and Wednesday of<br />\nSome slight changes have been<br />\ntechnic<br />\nRegister.<br />\nger in church today.<br />\neach week. University rings can be made in the assignments of the of* *<br />\nTHE DECLINE OF THE<br />\nWife—What did he look like?<br />\nsecured from Kelso Morrill, Box ficers. Lieutenant Atwater will asPENNANT<br />\nClergyman—I did not see him.<br />\nCONNECTICUT<br />\nAGGIE has<br />\nNo. 523.<br />\nsist Captain Davis in the drill work<br />\nbut I found a dollar in the contrilater<br />\na<br />\ndramFitch,<br />\nClyde<br />\nradical<br />\nWhen<br />\nmade a series of<br />\nchanges<br />\nThe assembly ended with yell out on the field in order to perfect<br />\nbution box.—Philadelphia Bullesystem<br />\nthis<br />\nyear.<br />\nin<br />\nits<br />\n\"Cut\"<br />\nstanding,<br />\nswept<br />\nrecognized<br />\natist<br />\nof<br />\npractice.<br />\nthe quality of the drill to a degree<br />\ntin.<br />\nabsences<br />\nHereafter<br />\nabsolutely<br />\nno<br />\nheretofore unattained in the annals his room at Amherst free of penDR. J. WHITRIDGE WILLIAMS RE- of the unit. Both officers<br />\nexpress nants and painted around his wall will be excused for any reason. To<br />\nSIGNS AS DEAN OF MEDICAL<br />\nthemselves as greatly pleased with a border of roses, his over-rah-rah balance this, a bonus system alSCHOOL<br />\nlows additional credit for perfect<br />\nthe spirit and work of the upperContinued from page I<br />\ncontemporaries awake to the heresy attendance. No,further make-up<br />\nBesides his degree of Doctor of classmen and are counting heavily<br />\nwith a sneer and an icy shoulder. exams for incurred conditions will<br />\nMedicine, Dr. Williams holds on their continuance throughbut<br />\nbe offered.—The Polytechnic Regthose of Doctor of Laws and Sci- the year. This statement applies di- Now, thank the gods, collegians<br />\nister.<br />\nwith<br />\nin<br />\nEurope<br />\nspend<br />\nthe<br />\nsummers<br />\nence. He is a member of many rectly to the reception 'of the new<br />\n* * *<br />\ncameras and come home<br />\nhonorary societies, both American scheme evolved in which the cadet high-priced<br />\nUNIVERSITY<br />\nARD<br />\nHARV<br />\nand foreign, and has written sev- officers receive their instruction one to -embellish their walls with phoOF<br />\nUNIVERSITY<br />\nand old and the<br />\neral well-known text-books and week and give it to their men the tography of Alpine beauty<br />\ndiscussing<br />\nworld wonders. Even those whose PENNSYLVANIA are<br />\nmonographs. Dr. Williams' in- following week. purses have not bulged enough to the question as to which univerterest in constructive science and<br />\nallow<br />\na trans-Atlantic vagabonding sity should have the honor of holdpreventive medicine has always<br />\ncoin<br />\nenough for a Maxfield ing the American Olympic tryfind<br />\nbeen active, and in 1914 he was<br />\nParrish<br />\nat<br />\nleast. Because the day outs. Both colleges have excellent<br />\nelected President of the Associapennant<br />\nis over. And like- fields for the games an& it is a<br />\nof<br />\nthe<br />\ntion for the Prevention of Infant<br />\nthe bathing beauty hard question for the committee<br />\nof<br />\nwise<br />\nthe<br />\nday<br />\nMortality. He was long a memPrinters or<br />\nof raiment, upon to decide.—The Polytechnic Regscant<br />\nreclining,<br />\nber of the Municipal Charities<br />\npennant<br />\nlettering. It ister.<br />\ntops<br />\nof<br />\nthe<br />\nBoard of Supervisors, and helped<br />\nThe Johns Hopkins<br />\nusually takes until junior or senior<br />\nconstruct the present efficient sysBEFORE<br />\nyear for one to relegate his gapdy<br />\nFirst drunk (bumping into lamp<br />\nNEWS-LETTER<br />\ntem of city charities.<br />\nnotions of interior decoration to the post): \"Excuse me, sir.\" (bumpjunk heap; but before long it seems ing into water hydrant): \"Excuse<br />\nRUN WHERE?<br />\nDrip: Let's walk around the<br />\nlikely that even freshmen will learn me, little boy.\" (bumping into secCollege Literature<br />\ndrink.<br />\nand<br />\nget<br />\na<br />\ncorner<br />\nto be wary of the pennant as sim- ond lamp post and falling down):<br />\n•<br />\nDrap : Hell no, let's run!<br />\nplicity and good taste come into \"Well, I'll just sit here until the<br />\n1.0M 13ARD and SOUTH STREETS<br />\n—Jester.<br />\ntheir own.—From The Dartmouth. crowd pas-h-es.\"—Sabre.<br />\n<br />\nnter',11<br />\nCo lecrate<br />\n<br />\ni<br />\n<br />\nof<br />\n<br />\nis<br />\nPi<br />\nary<br />\n: in<br />\nesra-<br />\n<br />\n5<br />\n<br />\nSO-<br />\n<br />\ncres<br />\nab-<br />\n<br />\nn<br />\nof<br />\n<br />\nher<br />\n;he<br />\n<br />\nen-<br />\n<br />\nn.\"<br />\n<br />\n11<br />\n<br />\nDAYS<br />\n<br />\nST. JOHN'S<br />\nGAME<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 30, 1923<br />\n<br />\n4<br />\n<br />\nSANFORDS<br />\n1111K<br />\n<br />\nFOUNTAIN PEN INK<br />\n<br />\nFROSH SCORE FIRST VICINTERCLASS BASEBALL<br />\nTORY BY DOWNING GILGAME CALLED OFF<br />\nMAN'S SECOND TEAM<br />\nFrosh-Soph Game Only Contest to Be<br />\nGilman Scores a Safety. Grinsfelder<br />\nClever at Intercepting Forward<br />\n<br />\nWill Improve the Action<br />\nof Any<br />\nFountain<br />\nPen<br />\n<br />\nOpening the season with a victory, Hopkins freshmen trim-nil-led<br />\nover Gilman's second team, 7-2.<br />\nGilman's only score was made by a<br />\nsafety, and while they threatened<br />\nthe Frosh a few times, Hophins<br />\nALL<br />\nCOLORS<br />\nwon a decisive victory. The first<br />\nhalf was a ragged affair, but real<br />\nALL<br />\nfootball was evident in the last two<br />\nSIZES<br />\nquarters, and the Frosh then made<br />\n•<br />\nCoach Landy seem satisfied with<br />\n\"The Ink That Made<br />\nhis proteges.<br />\nAfter the kick-off, by Frank of<br />\nT/Re Fountain Pen Possible\"<br />\nHopkins, Gilman ran the ball back<br />\nonly five yards from their 25-yard<br />\nline, thus placing the ball on the<br />\n30-yard line. Then Gilman became<br />\nmenacing and. successively completed four first downs, at the end<br />\nof which the ball was on Hopkins'<br />\n5-yard line. It was here that the<br />\nFrosh line covered themselves with<br />\nglory, •for they held the Gilman<br />\nbacks for the fourth down .on the<br />\nLimited<br />\ntoe-yard line. The Frosh then<br />\nBARN CAFETERIA chOse to kick, but in so doing Grinsfelder hit the goal. posts, and the<br />\nball bounded back into Hopkins'<br />\nEgrIENIEsLCILItEtglilIXECJEICEICIECIEEDgatED coveted ground. It was then that<br />\nGilman made her only score, a safet-y. The rest of the half was a seesaw affair; neither team making<br />\nmany first downs.<br />\nHopkins kicked off again in the<br />\nsecond half, but soon recovered the<br />\nlivii11 0 M 01110<br />\nball on downs. Grinsfelder and<br />\n\"The King of Lubricants\" Brian made consistent gains by line<br />\nplunging, but the feature of this<br />\nSHERWOOD BROTHERS, INC.<br />\nhalf was Gough's end running: The<br />\nINIKEINEWCHEIHERCEIHEIRECIEHENELIE most exciting incident of the whole<br />\ngame was the interception of a Gilman pass by Grinsfelder, who<br />\nthroughout<br />\nthe whole game seemed<br />\nBoys, the place to get your<br />\nquite adept at that trick. He caught<br />\nmeals—and they are honthe ball with a clear field ahead of<br />\nest-to-goodness meals, well<br />\nhim, but had only run 30 yards<br />\ns er v e d, and reasonably<br />\nwhen he was downed on Gilman's<br />\npriced—is at<br />\n40-yard line. Through consistent<br />\nline plunging the ball was finally<br />\nPlaced on Gilman's 10-yard line. On<br />\nthe second down, Neuberger, who<br />\nwas substituted for Cone, pulled off<br />\na neat left-end run for the only<br />\ntouchdown of the game. Frank<br />\n1817 N. Charles St.<br />\nthen kicked goal. After this the<br />\n(Half Block below North Ave.)<br />\nFrosh held Gilman easily and never<br />\nagain were they menacing.<br />\nNicholas Brown, Mgr,<br />\nThough outplayed in the first<br />\nquarter, Hopkins came back with<br />\none of the strongest lines ever seen<br />\nfor a team of its class, and completely outplayed Gilman the rest<br />\nPrinters of Philological and<br />\nof the game. This victory has enScientific Works<br />\nthused Frosh followers who expect<br />\n23 S. HANOVER ST.<br />\ntheir team will lick the Sophomores<br />\nBaltimore, Md.<br />\nand a big turnout is expected to witness the game with Polytechnic's<br />\nSHIRTS<br />\nNECKWEAR<br />\nsecond team next week.<br />\nThe lineup follows:<br />\n<br />\nI<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\n<br />\n[bilEkT7 Ti<br />\n<br />\nThe St. REGIS<br />\nRESTAURANT<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nLeFranc & Ault<br />\n421 N. HOWARD ST.<br />\n<br />\nHOSIERY<br />\n<br />\nGLOVES<br />\n<br />\nThe Flag, Banner & Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nVernon 2355<br />\nR. H. Taylor<br />\n<br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBaltimore<br />\n<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n41 Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nStaged<br />\n<br />\nBecause of the unexpected cold<br />\nand rain during the last few weeks,<br />\nseveral of the interclass baseball<br />\ngames have been necessarily postponed. Now, as the weather is beFURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\ncoming more unsuited to baseball<br />\n343 NORTH CHARLES STREET<br />\nevery day, the remaining games are<br />\nto be called off, with one exception<br />\n—the Freshman-Sophomore clash.<br />\nIf the Freshmen should succeed in<br />\ndefeating their persecutors in baseball, they would need only to win<br />\nthe football game in order to make<br />\nthe Freshman regulations void.<br />\nThis to the Frosh would be a Godsend and is greatly to be desired<br />\nby them. But to the Sophs it would<br />\nbe bitter medicine and naturally<br />\nboth teams will do their best toward fulfilling the wish of each<br />\nclass. The Frosh-Sophomore baseball game should be worth seeing<br />\nTYPEWRITTEN exam,thesis, or theme has<br />\nand a side performance after the<br />\nmany advantages. It is easy to read, and<br />\ngame would be greatly relished by<br />\nmakes a good impression; it is usually<br />\nmost of the undergraduates. Of<br />\nand more accurate, and it saves time.<br />\nfluent<br />\nmore<br />\ncourse, the side performance would<br />\nPortable for all your writing.<br />\nRemington<br />\nUse<br />\na<br />\nbe a Frosh-Soph battle, either forThis sturdy, little machine is compact,convenmal or informal, and lasting until<br />\nient, and complete, with the regulation four-row<br />\nall the combatants .have been carkeyboard like the big machines, and other \"big<br />\nried from the field.<br />\nmachine\" features. It can be operated on your<br />\nThe league standing is as folif you wish, for it carries its table on its back.<br />\nlap,<br />\nlows:<br />\nPct.<br />\nW.<br />\nL.<br />\nPrice, complete with case, $60. Easy payment terms if desired<br />\nFrosh<br />\n2<br />\n0<br />\n1.000<br />\nSophs<br />\n1<br />\n0<br />\n1.000<br />\nJuniors<br />\n0<br />\n1<br />\n.000<br />\nSeniors<br />\n2<br />\n0<br />\n.000<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nA<br />\n<br />\nRemington<br />\n<br />\nHAVERFORD HOLDS BLACK AND<br />\nBLUE ELEVEN TO 9-0 SCORE<br />\nContinued from page 1<br />\n<br />\ndid not net sufficient gains to add<br />\nto the score.<br />\nThe fourth quarter was marked<br />\nby the same forward passing tactics that had fea.stured the period<br />\npreceding it. Haverford's passes<br />\nwere just as effective as Hopkins',<br />\nmaking the game look gloomy for<br />\nthe J. H. U. rooters. Toward the<br />\nend of the quarter Bonner was<br />\nagain sent into the game. A long<br />\npass from Taylor to Schacht placed<br />\nthe ball in a position from which<br />\nTurnbull was able to make the first<br />\ntally of the game, a field goal. Receiving the ball soon after Taylor<br />\nresorted again to the forward pass<br />\nroute. Maxwell received a long one<br />\nfrom Taylor, running it to the tenyard line. Maxwell's ankle gave<br />\nway as he was tackled, necessitating<br />\nhis withdrawal from the game. Bonner took the ball on the next play<br />\nand carried it across the line for<br />\nHopkins' only touchdown. Turnbull's try for point after the touchHOPKINS (7)<br />\nBlumberg down was unsuccessful.<br />\n<br />\nGILMAN (2)<br />\nLE<br />\nAlexander<br />\nL.T<br />\nR. Lowndes<br />\nSchlossberg<br />\nL.G.<br />\nThompson<br />\nMagnes<br />\nParr<br />\nC.<br />\nFrank<br />\nBell<br />\nStone<br />\nR G.<br />\nChapman<br />\nR.E.<br />\nNicolls<br />\nScarlet '<br />\nQ.B<br />\nGough<br />\nGrinsfelder<br />\nShaw<br />\nL.H<br />\nMarchamp<br />\nCone<br />\nR.r-I<br />\nA. Lowndes<br />\nBrian<br />\nF.B<br />\nSubstitutes: Hop kins — Newberger<br />\nfor Cone; Steinwa Id for Magnes and<br />\nBrown for Blumbe rg.<br />\n<br />\nTHE FIRST THOUGHT<br />\n\"Played golf this morning?\"<br />\nchirped Babble.<br />\n\"What did you go around in?\"<br />\nasked Yvonne.<br />\n\"A pink sweater and a green<br />\nsilk skirt.\"—Louisville CourierJournal.<br />\n<br />\nFURNITURE OF QUALITY '<br />\n<br />\nPortable<br />\nRemington Typewriter Co.<br />\n25 W. Fayette St.<br />\nBaltimore<br />\nM<br />\n<br />\n111111EMISIMERIZIEEMBIZE<br />\n<br />\nHYNSON, WESTCOTT and DUNNING<br />\nPRESCRIPTION DRUGGISTS<br />\nTWO STORES:<br />\n<br />\nEutaw Place and North Ave.<br />\n<br />\nCharles and Chase Sts.<br />\n<br />\nMadison 0405<br />\n<br />\nVernon 0890<br />\n<br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\nAt the<br />\n<br />\nWashington Monument<br />\nOscar<br />\n<br />\nMinister<br />\n<br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br />\nThe purpose and program of this<br />\nChurch will appeal to you. Look in<br />\non the Sunday afternoon -At Home\"<br />\nfrom five to seven.<br />\n<br />\n•<br />\n<br />\nLineup:<br />\nHAVERFORD (0)<br />\nHOPKINS '(9)<br />\nRhoads<br />\nLE<br />\nBerndt<br />\nSumwalt<br />\nLX<br />\nMagill<br />\nAlbert<br />\nWolbert<br />\nMiller<br />\nDay<br />\nHollingshead<br />\nBarton<br />\nR.<br />\nMiller<br />\nRX.<br />\nCarter<br />\nMontgomery<br />\nR.E.<br />\nRich<br />\nQ.B.Garrett<br />\nraylor<br />\nNolan<br />\nTurnbull<br />\nR.EI.<br />\nLamberti<br />\nYeoman<br />\nF.B.(capt.) Wilbur<br />\nMaxwell<br />\nScore by periods—<br />\nHopkins<br />\nHaverford<br />\n<br />\n0 0 0 9-9<br />\no 0 0 0-0<br />\n<br />\nSubstittitions—Johns Hopkins, Slowik for Carter, Bonner for Yeoman,<br />\nSchacht for 'Berndt, Carr for Day,<br />\nYeoman for Bonner, Day for Carr,<br />\nBonner for Yeoman, Cook for Maxwell; Haverford, Heilman for Garrett,<br />\nI owry for Nolan, Arnold for Lamhim.<br />\nStop<br />\nShe—Help! Police!<br />\nberti, Hollingsworth for Montgomery,<br />\nNolan for -Lowry, Lamberti for ArHe tried to flirt with me.<br />\nnold, Basselle for A. Miller. TouchCop — Calm yourself, lady, down—Bonner. Field goal—Turnbull<br />\nReferee—Carrier, Dartthere's plenty more.—The Poly- (placement).<br />\nmouth. Umnire—Clinton. Yale. Head<br />\ntechnic Register.<br />\nlinesman—Sigman, Lafayette.<br />\n<br />\nThomas Olson, D.D.<br />\n<br />\nSunday ,morning worship at 11 o'clock.<br />\nSunday evening service at 8 o'clock.<br />\nMusic by vested chorus—choir of soloists.<br />\n<br />\n\"At the heart of the City\"<br />\n<br />\nALL SEATS FREE<br />\n<br />\nRENT A CAR<br />\nDRIVE IT YOURSELF!<br />\nALL NEW, CLEAN CARS<br />\nFORDS, 12c PER MILE—DODGES OR HUPS, 18c PER MILE<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br />\n<br />\nDRIVE IT YOURSELF CO.<br />\n1725 N. CHARLES ST.<br />\n<br />\nVERNON 4049<br />\n<br />\nONE BLOCK SOUTH OF NORTH AVE.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVIII, No. 8<br /><br />\nTHE JOHNS IIOPKINS NEWS-LETTER, OCTOBER 30, 1923<br /><br />\nWARDLAW DR. J. WHITRIDGE WILLIAMS Y. M. C. A. LIST GIVES REL<br />\nCAPTAIN<br />\nRESIGNS AS DEAN OF<br />\nON<br />\nTALK<br />\nGIVES<br />\nMILES<br />\nLIGIOUS REGISTRATION<br />\nMEDICAL SCHOOL<br />\nLITERATURE AT ASOF HOPKINS STUDENTS<br />\nSEMBLY<br />\nFamous Professor to Head New Wom- Undergraduates are Catalogued Accorden's Clinic at Hopkins Hospital<br />\ning to Church Preference by Y<br />\nHopkins Graduate Discusses Two As'23<br />\nof<br />\nLiterature.<br />\nClass<br />\npects of<br />\nDr. John Whitridge Williams, Methodists outnumber students<br />\nto Hold Dance After St.<br />\nfor thirteen years Dean of the of any other faith at Johns HopJohns' Game<br /><br />\nPRICE 5 CENTS<br /><br />\nHAVERFORD HOLDS BLACK<br />\nAND BLUE ELEVEN TO 9-0<br />\nSCORE IN CLOSE CONTEST<br /><br />\nMedical Faculty of Johns HopCaptain Wardlaw Miles, a Hop- kins University, has tendered his kins College, according to the reckins graduate, war hero, and pres- resignation from that position to ords of the Y. M. C. A. The church<br />\nent headmaster of the Gilman the Medical Faculty, in order to preference .summary compiled by Quakers Surprise Hopkins<br />\nTeam, Holding Them ScoreCountry School, delivered a very be free to take full charge of the the Y. M. C. A., according to the<br />\nless Until the Fourth Period<br />\ninteresting lecture on literature at new Women's Clinic, recently es- professions of religion made on Y.<br />\ntablished at the Hospital.. Dr. M. C. A. registration cards, proves<br />\nAfter battling through three quarters of the game without scoring<br />\nthe assembly last Thursday. AlWilliams' resignation was anHopkins eleven filially triumphed over Haverford in the closest<br />\nthe<br />\nvery interesting. No one of the<br />\nthough his subject was general, nounced last Friday.<br />\nthree religions that come first on contest which has been waged by the Black and Blue. The game<br />\nCaptain Miles selected his examples<br />\nThe Women's Clinic will be<br />\nwas scoreless until the fourth quarter when Turnbull kicked a field<br />\nentirely from English literature, completely organized within a the list greatly outnumbers the<br />\nfew weeks. The money for its other two. The 122 Methodists goal and Bonner edged around end for a touchdown. Haverford<br />\nespecially poetry.<br />\nCaptain establishment and maintenance are closely pursued by 119 Jews played a strong defensive game, although at times the Quakers<br />\nbegan<br />\n\"Literature,\"<br />\nMiles, \"lends itself to division into was given in 1919 by an anony- and 115 Episcopalians. It is note- stepped into a forward pass game that threatened the\"Hopkins goal.<br />\ntwo general classes: first, literature mous donor. It will be entirely worthy that there are, so many A crowd of four thousand people, including a great many women,<br />\nthat has to do with external life and under the supervision and direc- Episcopalians at Hopkins, for, as was on hand to witness the struggle, which was played at the unobvious things, the literature of ac- tion of Dr. Williams, and will be a rule, their number is propor- usual hour of eleven in the morning.<br />\nThe Hopkins team started the<br />\ntion, actualities; and facts; second, solely for the care and treatment tionately smaller in other colleges.<br />\nthe literature of escape from life. of women. Students at the Med- The reason for this large body ot CONSTRUCTION OF GIANT game with a rush, which seemed to<br />\nHYDRO-ELECTRIC PLANT overwhelm the visitors. As soon as<br />\nThe first kind has as its object ,ap- ical School, it was pointed out, Episcopalians is uncertain.<br />\nIN CALIFORNIA SHOWN<br />\nProach to life; the second, as its will now have a better opportuniThen there is a big drop to anthe local squad got possession of<br />\nty for advanced work, and a<br />\nBY MOVIE<br />\nname indicates,, escape from life.<br />\nother group of three religions. The<br />\nthe ball they made an advance up<br />\n\"The literature of approach is as chance to obtain, special knowl- Presbyterians lead this group with 'Frozen Credits\" Shown Last Wednesthe field to within twenty yards of<br />\nday to Engineering Juniors and<br />\ngood a name as we can find for the edge, in this line of endeavor.<br />\n65 students; then come the 58<br />\nSeniors<br />\nin<br />\nC.<br />\nE.<br />\nHall<br />\nWilliams<br />\nDr.<br />\nthe<br />\nsucceeded<br />\ngoal line, but the Pennsylvanians<br />\na<br />\ndisfirst class,\" said Captain Miles. \"All<br />\nCatholics and the 48 Lutherans.<br />\ntinguished<br />\nline<br />\nof<br />\nDeans:<br />\nDrs.<br />\nThrough<br />\nthe<br />\ncourtesy<br />\nthe<br />\nof<br />\nheld them tight and when Taylor<br />\nprimitive literature,\" he continued,<br />\nAs a great many of the Roman<br />\n\"comes under this head, and the Welsh, Osier and Howell. His Catholics of the city attend a Stone-Webster Construction Com- attempted a pass to Rich a Haverepics can well be included. In prim- own resignation has not been Catholic college, the number of pany, Inc., the Hopkins Engineer- ford man pulled the pigskin out of<br />\nitive times, battle, the struggle for formally accepted as yet, but it is Catholics is much smaller than it ing Department obtained the loan<br />\nthe air only to be tackled where he<br />\ne?cistence, bravery, and sex were of expected that it will be at the next would otherwise be. These 58<br />\nof an excellent movie entitled stood. Haverford kicked to Hopgreatest interest to men, and found meeting of the Medical Faculty. Catholics include four men who<br />\n\"Frozen<br />\nCredits,\" which depicted at kins, giving the home team another<br />\nA<br />\nnew Dean will be selected at<br />\nPlace in their literature. In other<br />\nprofess the religion of the Greek<br />\nWords, this is the literature of the the same time, and will assume Catholic Church. The students are some length the construction of the chance to score. This time Taylor's<br />\nrelation of man to man, and of man his duties as soon as Dr. Williams from Russia, where there is a Caribou Hydro-Electric Plant of passing and Yoeman's effeCtive<br />\nto society. 'Beowulf' and the 'An- has cleared up the work on hand, much•greater percentage of people the Great Westetn Power Com- gains through the line put<br />\nthe Black<br />\nglo-Saxon Chronicle' are early ex-- and is ready to take charge of the that have membership in this pany of California. This movie, and Blue again within striking diswhich was shown last Wednesday tance. Haverford held solidly and<br />\namples of this class. Scott's stirring clinic.<br />\nchurch.<br />\naccounts of battles come under this .Dr. Williams has had a brilNext in number are those who at 4:15 P. M. in the Auditorium the Homewood team was forced to<br />\nhead. The literature ol approach liant career, during the most part give no preference to any church. of the Civil Engineering Building, attempt a field goal. Turnbull was<br />\nto life was Shakespeare's forte also. of which he has been connected If the Baptists are omitted—the was seen by the juniors and seniors hurried in his kick, however,<br />\nand<br />\nIn \"King Henry IV,\" Hotspur's ac- in one way or another with Johns Baptists. have a membership of 26 of the mechanical, civil and electric- the ball sailed wide of<br />\nthe bars.<br />\ncount of why he failed to deliver Hopkins. He was born January —the students who do not belong al engineering departments. Prof. Immediately after the second<br />\nhis prisoners to a 'certain lord, neat, 26, 1866, in Baltimore, the de- to any religious organization or Alexander G. Christie, head of the quarter started Slowick was sent in<br />\ntrimly dressed'; and in 'Macbeth,' scendant of a long line of medical organism equal those of the remain- Mechanical Engineering Depart- to replace Carter at tackle. Durthe discussion of the 'voice' that ancestors: his father, grandfather ing religions together: There are 46 ment, explained the various steps ing this perior of the<br />\ngame both<br />\ntrouble's Macbeth after-the murder and great-grandfather having fol- men who Profess the religion of no shown in the movie.<br />\nteams opened up their aridl attacks,<br />\nof Duncan are examples of Shakes- lowed that profession in Baltimore church, while there are 50 men<br />\nThe movie began with an ani- which they continued until the final<br />\npeare's work in this field. Pope, since 1820. He graduated from who comprise those of the other mated cartoon showing the manner whistle blew. Hopkins' forward<br />\ntoo, was true to life,—the narrow, Johns Hopkins with an A. B. de- religions represented in the col- in which the moisture taken up by passing was more effective than<br />\nPetty, mean life of his day. Rud- gree in 1886; in 1888 he was lege. These men are distributed the sun from the Pacific Ocean is that of Haverford, though it was<br />\nYard Kipling was mentioned as the awarded the M. D. degree by the as follows: Ten Reformed Chris- carried eastward by the wind and not strong enough to place the ball<br />\ngreatest living exponent of this University of Maryland, and he tians, nine Methodists Protestant, deposited as snow on the Sierra over the goal line. On one occatype of poetry, and his `M'Andrew's studied in Germany during the while, as was shown before, there Nevada Mountains. During the sion the Black and Blue worked<br />\nHymn' was cited as an example. following year. In 1889 he re- are 122 Methodists Episcopal, summer the sun causes the snow the ball up to the one yard line only<br />\n\"This,\" concluded Captain Miles, turned to his native city and be- seven Brethren, six Congregation- to melt and form the raging moun- to be held there by the Haverford<br />\n\"is the literature of power, of pas- gan his long connection with alists, fOur Friends, four Disciples, tain streams., It is the power fur- team. The visitors' punter<br />\nwas unJohns Hopkins as a doctor and three Unitarians, three Christian nished by these \"frozen credits\"<br />\nsion, of actuality.\"<br />\nable to place the ball out of danger<br />\nThe literature of the escape from teacher.<br />\nScientists, two Evangelists, one that is used in the hydro-electric and Hopkins again worked the ball<br />\nThe Medical School opened in- Theosophist and one Universalist. plant to generate electric current. to within striking distance. Bonlife, too, includes works of great<br />\nThere is a total of 649 students The Caribou<br />\nHydro-Electric ner, who was substituted for YoeWriters of all ages. Shakespeare's 1893 and Dr. Williams was named<br />\nPlant, which is situated in the heart man, held the ball on the twentyHamlet\" is an excellent example assistant professor of obstetrics. enrolled in the college.<br />\nof the Sierra Nevada Mountains, five yard line, while Turnbull atof this class of literature. Keats' Six yeais later he was made proCHURCH PREFERENCT<br />\nproduces 60,000 electrical horse- tempted another unsuccessful place\"Ode to a Nightingale\" and Shel- fessor, and in 1911, upon the resSUMMARY<br />\nley's \"Ode to the West Wind\" ex- ignation of Dr. Howell, Dr.'Wil- Methodist<br />\npower.<br />\nBefore being led into the ment kick. Haverford immediate122<br />\nPelton<br />\nwater<br />\npress particularly well the desira- liams was named Dean of the Jewish<br />\nwheels, the water ly kicked back to Hopkins, but the<br />\n119<br />\nbility of escape 'from life; indeed, Medical Faculty, in which posi- Episcopal ,<br />\n115 passes through four miles of tun- quarter ended before they could get<br />\nShelley is considered by many pre- tion he has continued ever since Presbyterian<br />\n65 nels bored through solid rock and is again within striking distance.<br />\neminent in this field. \"It is a ques- with distinguished success.<br />\nCatholic (Greek and Roman) 58 impounded against a 'giant dam. Haverford received the ball from<br />\ntion,\" Captain Miles pointed out,<br />\nContinued on Page 3, col. 2<br />\n48 The steps in the construction of the the kick-off, running it back to the<br />\nLutherans<br />\n,‘•<br />\nJust what effects economic, social,<br />\n26 tunnels, the dam, and the power middle of the field. The Quakers<br />\nBaptists<br />\nand political conditions have here.\"<br />\n10 house itself, were shown in detail. were unable to make their distance,<br />\nReformed<br />\nThe speaker drew an analogy beMethodist Protestant<br />\n9 The construction of the plant however, and a poor punt gave<br />\ntween poetry and music as the<br />\n7 was in charge of Mr. E. K. Shut- Hopkins the ball in an advantagBrethren<br />\nmeans of which men avail themCongregationalists<br />\n6 tleton, the western manager of the eous position. Yoeman, who had<br />\nselves to get away from the world;<br />\nFriends<br />\n4 Stone-Wester Co., and a corps of gone back in the game in Bonner's<br />\nand mentioned Swinburne's \"Hes4 experienced engineers, all of whom place, was not able to make the<br />\nDisciples<br />\nperia\" to show how closely poetry<br />\nUnitarians<br />\n3 were shown in the movie.<br />\nheavy gains he had made in the<br />\nand music are related.. Music adChristian Science<br />\n5<br />\nBefore<br />\nfirst half, as the Quakers set up a<br />\nmittedly is more universal and has<br />\nEvangelical<br />\n2<br />\n\"stone-wall\" defense. Two beautia wider range of influence than<br />\nTheosophist<br />\nful passes, one by Taylor to TurnMeeting of News-Letter<br />\nPoetry, however. Humor is another<br />\nUniversalist<br />\n1<br />\nbull and the other by Maxwell to<br />\nBusiness Staff and candidates<br />\nIneans cif escape from the life about<br />\nNo preference given<br />\n46<br />\nRich, seemed to Make a touchdown<br />\ntoday at 12.20. All MUST<br />\ntts ; and humorous works such as<br />\ninevitable but the following .plays<br />\nbe present.<br />\n649<br />\nTotal registered<br />\nContinued on page 3, col. 2<br />\nContinued on page 4 col. 3<br /><br />\n11<br />\nDAYS<br /><br />\nSt. John'<br />\nGame<br /><br />\nTHE JOHNS HOPKINS NE WS - LETTER, OCTOBER 30, 1923<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\n\"The chorus, which supports<br />\nforty-five voices, was selected<br />\nfrom approximately one hundred<br />\napplicants. The try-outs were -held<br />\nin the form of sextettes, and each<br />\n$2.00 applicant was required to know<br />\nand uphold his part.\"<br /><br />\nNews-Letter<br /><br />\nFOUNDED 1897.<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress., November 3, 1879.<br /><br />\nThe \"Kentucky Kernel\" thus<br />\ncomments on the forthcoming production of \"Martha\" by the music<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\ndepartment of the University of<br />\nKentucky. The entire score is to<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UiTIVERSITY ; all articles and other communications be presented.<br />\nshould be sent to the MANAGING EDITOR.<br />\nKentucky<br />\nWith<br />\npresenting<br />\ngrand opera successfully, we can't<br />\nHomewood 100<br />\nrelephone<br />\nunderstand the fond pessimists<br />\nwho fear the Barnstormers' allBusiness Manager<br />\nEditor-in-Chief<br />\nEIopkins musical comedy “won't<br />\nJOSEPH LEOPOLD, '24.<br />\nPHILIP W. HOWARD, '25.<br />\nget over.\"<br />\nManaging Editor<br />\nWILLIAM G. DEAN, JR., '24.<br /><br />\nAdvertising Manager<br />\nFITZGERALD DUNNING, '24.<br /><br />\nAssistant Managing Editor<br />\nT. REESE MARSH, '24.<br /><br />\nCirculation Manager<br /><br />\nAssociate Editors<br /><br />\nJOHN C. LEWIS, JR., '24.<br /><br />\nRICHARD C. TILGHMAN, '25.<br />\nJOHN W. PARSONS, '25.<br />\nBENJAMIN T. ROME, '25.<br /><br />\nAssistant Business Managers<br /><br />\nJunior Editors<br />\nV. EDWARD THOMSEN, JR., '26.<br />\nARTHUR L. NELSON, '26.<br />\nERNEST A. STRATHMAN, '26.<br />\nALGER G. Hiss, '26<br />\nEDWARD 0. MICHEL, '26.<br />\nCHARLES G. HUTZLER, '24.<br /><br />\nD. MILES MARRIAN, '25.<br />\nG. DONALD GIESKE, '25.<br />\nJOHN T. DIXON,'24.<br />\nA. J. MoKAY, '26.<br />\nC. EUGENE TOVELL, '24.<br />\nOTHO J. KELLER, III, '26<br />\nJ. JACKSON KIDD, '26<br /><br />\nAfter signing the new coupon<br />\nbook of the Athletic Association<br />\nwe felt as though engaged in a<br />\nlegal duel with the athletic authorities. On looking through it we<br />\nwere reminded of those delightful<br />\n\"Japanese paint books for the little tots,\" with pages covered by<br />\nwater color paint.<br /><br />\nThis column hereby announces<br />\na prize (to be decided upon later)<br />\nMember Southern Intercollegiate Newspaper Association<br />\nror the best plan to fasten these<br />\nbooks to purchaser so that they<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nwon't wear off. A ready market is<br />\nexpected for the article so devised.<br />\nCane Clubbers will be especially<br />\nBALTIMORE, MD., OCTOBER 30, 1923<br />\ngrateful to the inventor.<br />\nThe rules and regulations for<br />\nthe contest are one. Mr. Keyes<br />\nMAKING THE CAMPUS DRY<br />\nmust not be told of its existence.<br />\nThe Volstead Act has nearly succeeded in demonstrating the He may wrongly regard it. as an<br />\nveracity of the statement \"you can prove anything by figures.\" While attempt to make box office sales<br />\nProhibitionists by a lengthy array of statistics, show that crime and fall off.<br />\n*<br />\ndrunkenness are on the wane, disciples of Colonel Hill, with an<br />\nequally formidable array, prove conclusively that such disorders have<br />\nIt will be interesting to deterincreased materially since the ratification of the Eighteenth Amend- mine the efficacy of prayer when<br />\nment. As far as we can ascertain, however, no one has succeeded the \"Praying Colonels\" of Centre<br />\nin manipulating figures in such a way as to prove that drinking has meet the avowed, highly adverdecreased in the colleges. Literature on the subject agrees unani- tised, shameless atheists of Kenmously that college men imbibe at least as frequently as of yore and tucky this Saturday at Danville. It<br />\ntakes yards of prayers to strangle<br />\nit has been asserted that the only decrease that has been noted is in<br />\na wildcat, the official title of the<br />\nthe quality of the liquor.<br />\nKentucky players.<br />\nThe matter has grown so serious at Yale that the President of<br />\nthat University recently threatened the expulsion of anyone found<br />\nguilty of carrying liquor into college buildings. We fear that this<br />\nedict will not cause the Yale campus to dry up instantaneously. Custom officials will agree that John Barleycorn is a very elusive person.<br />\nAnd if Yale authorities do succeed in keeping liquor out of the dormitories, it will only be another case of Mohammed and the mountain.<br />\nAs the Volstead Act has failed to dry up the Union, so will any<br />\nrules or regulations fail to dry up the. colleges. The college man,<br />\nperhaps more than any other individual, resents any infringement of<br />\nliberty.<br />\nPerhaps this is the reason why no one has succeeded in proving<br />\nthat drinking has decreased on college campuses.<br /><br />\nTHE PUBLICITY BOARD<br />\nPublicity Boards and Press Clubs at many colleges are large<br />\nbodies with many and diverse duties. It is through these mediums<br />\nthat the colleges and universities at which the organizations are located, obtain the majority of their advertising in the local and outside press and in preparatory schools.<br />\nAt Hopkins the Publicity Board, through lack of sufficient financial support and the absence of co-operation, has an extremely limited scope. It is true that the Board is young, the work accomplished, however, is negligible compared to that of similar organizations in other colleges.<br />\n0. D. K. has already appointed a committee to investigate the<br />\nactivities of the Board. The A. A. Board, the Students' Activities<br />\nCouncil, and other organizations, should give the question consideration.<br /><br />\n*<br /><br />\n*<br /><br />\n1923. Union University. (New<br />\nPI DELTA EPSILON<br />\nIt is of interest to note that York).<br />\n1923. Lafayette College.<br />\nsince the establishment of a chap1923. Emory University.<br />\nter of Pi Delta Epsilon (Honorary<br />\nJournatistic Fraternity) at<br />\n1923. Wabash College.<br />\n1923. Carnegie Institute of<br />\nhigh in 1920, the follow.ing- chapTechnology.<br />\nters lave been installed:<br />\n19z1. Hamilton College (New<br />\nThe role of active chapters is<br />\nnow 37. The membership of Pi<br />\n1921. Swarthmore College.<br />\nDelta Epsilon is purely honorary<br />\n1921. University of Utah.<br />\nin the sense that achievement in<br />\n1922. Allegheny College<br />\njournalistic work is always an es'1922. University of Ariz,:<br />\nsential qualification, but the fra1922. Bowdoin College.<br />\nternity strives to maintain a so1922. Colorado<br />\nAgr -Atli L. ra I cial organization in all colleges<br />\nSchool.<br />\nand universities where it is estab192. Georgia Institute of Tech- lished.<br />\nnology.<br />\n-The Brown &amp;-White.<br />\n19z2 George Washington University.<br />\nA quartet has just finished sing1922. Johns Hopkins Universi- ing \"Among the Sleepy Hills of<br />\nty.<br />\nIen-Ten-Tennessee.\"<br />\n1922. University of Minnesota. The hostess noticed one of her<br />\nguests weeping by himself. She<br />\n1922. Ohio State University.<br />\n1922. Stevens Institute of Tech- inquired sympathetically:<br />\n\"My dear man, are you a Tennology..<br />\nnessean?\"<br />\n1922. Vanderbilt University.<br />\n\"No, madam,.1 am a musician.\"<br />\n1922. Wesleyan University.<br />\n-Oklahoma Daily.<br />\n1922. Williams College.<br /><br />\nWa<br /><br />\n11<br />\nfan<br />\nand<br /><br />\nfro<br /><br />\nhis<br /><br />\nDe;<br /><br />\neati<br />\nof<br /><br />\nis<br />\nbre<br />\ntrii<br /><br />\ncor<br />\nEl(<br />\nha(<br />\nera<br /><br />\nN(<br />\nIan<br />\nsli<br /><br />\nBr<br />\nbo<br />\nco:<br />\nidl<br /><br />\nea<br /><br />\nRi<br /><br />\nEl<br />\ntri<br />\nits<br /><br />\n11(<br /><br />\nSi<br />\n1<br />\nti<br /><br />\n1 .0 one ever<br />\ngets tired of<br />\nMelachrinostheir unfailing<br />\nquality is a constantsatisfaction.<br /><br />\nti<br /><br />\nh,<br /><br />\nf(<br />\ne:<br /><br />\na<br /><br />\nT1<br /><br />\nORIGINAL<br /><br />\n11<br />\nNM ails wom-1111.1.8111•11<br /><br />\nMa<br /><br />\nMELACHRIN<br />\n\"The One Cigarette Sold the World Over\"<br /><br />\nConcerning art: we would<br />\nstrongly advise-at the risk of being misunderstood-having a few<br />\nclasses in the Botanical Gardens<br />\nbefore the tulip poplars shed their<br />\ntruly golden foliage.<br /><br />\n(STETSON<br /><br />\nt,<br /><br />\nt'<br /><br />\n*<br /><br />\nConcerning publicity: some universities are born famous, others<br />\nachieve fame, and still others have<br />\nfame thrust upon 'em-to paraphrase Shakespeare. The suddenness with which the formerly- obscure Centre College achieved<br />\nfame and, more important, a quadrupled enrollment, set all colleges<br />\nto encouraging McMillans to enter<br />\ntheir historic halls, for the football<br />\nseason at least. Many seats of<br />\nlearning had so propitious a start<br />\nas to be justly described as \"born<br />\nfamous,\" but few have this most<br />\nimportant gift \"thrust upon 'em.\"<br />\nThe interesting discussion started<br />\nby Professor Van Dyke as to the<br />\nauthenticity of many paintings<br />\nlong considered works of Rembrandt, has caused Rutgers to<br />\nstand forth in the glare of public<br />\nnotice.<br />\nOur publicity board might make<br />\nuse of the opportunity presented<br />\nby our faculty.<br /><br />\n• C.<br /><br />\n9<br /><br />\nHats<br />\nStyle and .Quality are the two essentials of<br />\na good hat, but it does not pay to buy one<br />\nwithout the other. All Stetsons have both.<br />\nSTYLED FOR, YOUNG MEN,<br /><br />\nTHE JOHNS HOPKINS NEWS. LETTER, OC r*.BER 30, 1923<br /><br />\n;CNN'<br /><br />\n3<br /><br />\nC. P. STEINMETZ, ELECTRIC- CAPTAIN L. WARDLAW MILES EDITOR-IN-CHIEF MAKES AP- HARVARD BUSINESS SCHOOL<br />\nGIVES TALK ON LITERATURE<br />\nAL WIZARD,DIES SUDDENPOINTMENTS TO HULLAANNOUNCES A MIDYEAR<br />\n\" AT ASSEMBLY<br />\nBALOO<br />\nSTAFF<br />\nENTRANCE PLAN<br />\nLY IN SCHENECTADY<br />\nContinued from page 1<br />\nWas one of Greatest Contributors to \"Alice in Wonderland\" are popular<br />\nFitzgerald Dunning. editor-in- Three Hopkins Graduates Already RegModern Science<br />\nistered in School<br />\nchief<br />\nof the 1924 Hullabaloo, has<br />\nfor this reason. \"Humor,\" Captain<br />\nSteinmetz,<br />\nDr. Charles Proteus<br />\nOf distinct interest to seniors<br />\nMiles said, \"is the intellectually elected the editorial staff of the<br />\nfamous for his work in electriicty poor man's escape.\"<br />\nyear book. The selections are as who are graduating at Midyears is<br />\nand mathematics, died suddenly<br />\nStudents who jostle their way<br />\nIn commenting further on these follows: Managing Editor, Joseph the announcement of a Midyear Enfrom heart disease last Vriday at two classes of literature, the speak- Leopold; Associate Editors, John<br />\ntrance Plan just made by the Har- through the crowded halls of<br />\nhis home in Schenectady, N. Y.<br />\ner said one was not to be put above H. Croker, 'Thomas M. Jenifer, vard Graduate School of Business Western Reserve will find it .hard<br />\nDeath came while the \"wizard\" was the other; both serve their,purposes. John T. Martin, Charles G. Hutzto realize that less than a hundred<br />\neating his breakfast in the presence \"It is well to remember,\" he went ler, George Klinefelter, Hugh M. Administration.<br />\nyears ago there were only three<br />\nhave<br />\ntwo<br />\nyears<br />\na<br />\nfew<br />\nmen<br />\nFor<br />\nof the attending physicians.<br />\non, \"that there are two kinds of es- Smallwood, Herman. Chor, and<br />\nbeen<br />\npermitted<br />\nto<br />\nenter<br />\nin<br />\nFebrustudents enrolled in the college.<br />\nThe immediate cause of his death cape; the coward from the battle of Charles McLane ; Photographic<br />\nary. As a result of the experience Reserve is now in its ninety-eighth<br />\nIS thought to have been a physical<br />\nlife when he finds the going rough, Editors, William H. B. Howard<br />\nbreakdown hrought on by a recent and the escape of the brave man and Russell Passano; and Art Ed- with these students, the School is year of academic life, with. an ennow prepared to offer the same<br />\ntrip to the Pacific Coast.<br />\nfrom his dungeon to the battle. The itor, Isaac Hamburger, II.<br />\ncourses of study that are available rollment of nearly four thousand.<br />\nDr. Steinmetz, who was chief problem of life is to 'idealize your<br />\nBefore these men can officially<br />\n—Teaser.<br />\nconsulting engineer of the. General real and realize your ideal.' Writers act in their new capacity, their to those entering in September.<br />\n* * *<br />\nThe program of work has been<br />\nElectric Works, Schnectady, N. Y., of the first class of literature un- selection must be ratified by the<br />\nso<br />\nadjusted that students entering<br />\nHarvard University enters its<br />\nhad been connected with the Gendertake to idealize their real; writ- Senior class. This is the result of<br />\nat<br />\ntime<br />\nwill<br />\nto<br />\ncomplete<br />\nthat<br />\nbe<br />\nable<br />\neral Electric Company since 1892. ers of the second class, to realize<br />\n288th year. The largest freshman<br />\na motion passed last year to give the regular work for the degree of<br />\nThree years before he arrived in their ideal.\"<br />\nthe class a check upon the powers Master in Business Administration class of the institution has enrolled<br />\nNew York from Zurich, Switzerthis fall, numbering 930.—Teaser.<br />\nCaptain Miles disagreed with of the editor-in-chief.<br />\nin the usual two years, graduating<br />\nland, penniless and ,with ‘a very James Branch Cabell, whose whole<br />\nThree of the most prominent<br />\nDunning proposes to start work in February of the second year folSlight knowledge of English.<br />\nphilosophy, he said, is based on almost immediately so that the<br />\nstudents at Oxford are at present<br />\nlowing their entrance.<br />\nEducated in the University at make believe. Life, true enough, is<br />\nin this country for the purpose of<br />\nindividual<br />\nwrite-ups<br />\ncan<br />\nbe<br />\ndisapplisummer<br />\nDuring the past<br />\nBreslau, Germany,- where he was rough in spots, but not so rough<br />\nposed<br />\nof<br />\nand<br />\nthe<br />\nstaff<br />\ncan<br />\nturn<br />\ncations from 443 men for admis- debating at a number'of the most<br />\nborn April 9, 1865, Dr. Steintnetz that we cannot find in it work and<br />\ntheir<br />\nattention<br />\nto<br />\nwriting<br />\na<br />\nbigsion td the School in September important Eastern colleges. The<br />\nContinued his education at the Zur- a place for ourselves. At the same<br />\nger<br />\nand<br />\nbetter<br />\nbook:<br />\nAt<br />\na<br />\nmeetwere received. From • this number schedule includes appearances at<br />\nich Polytechnicium.<br />\ntime, the speaker conceded, few of ing held yesterday plans were<br />\nonly 332 could be finally accepted such schools as Yale, Harvard,<br />\nThis education enabled him to us are so contented with our lot<br />\ncussed<br />\ndefinite<br />\nbut no<br />\nmatters de- and enrolled. A comparison with Princeton, Columbia and Cornell.<br />\nObtain employment shortly after he that we not wish at times we could<br />\n—Vanderbilt Hustler.<br />\ncided. There is so much room for corresponding figures for last year<br />\ncaryie to the United States in the<br />\nget.away from it all. For that very originality and individuality in<br />\nof 302 applications received and 247<br />\n* *<br />\nmanufacturing establishment of reason the second type of literature<br />\nsuch<br />\na<br />\nbook,<br />\naccording<br />\nto<br />\nDunngrowing<br />\nthe<br />\nshows<br />\nmen<br />\nadmitted,<br />\nWhittle,<br />\npresident of<br />\nCharles<br />\nE.<br />\nRudolph Eicherneyer at Yonkers, exists.<br />\ning,<br />\nthat<br />\nevery<br />\nmember<br />\nof<br />\nthe<br />\ntraining<br />\ngiven<br />\nby<br />\ndemand<br />\nfor<br />\nthe<br />\nCollege,<br />\nin<br />\nKentucky, is<br />\nOgden<br />\nN. Y. A year after the General<br />\nCaptain Miles'addressed the asbut 23 years of age. The \"boy<br />\nElectric Company bought the Eicke- sembly on a similar topic last year, staff has an opportunity to show the School.<br />\nIt was in order to meet this in- president\" was 13 before he saw a<br />\nmeyer plant he was transferred to and the hearty applause he received his ability.<br />\ndemand for admission to railroad and at 19 he was a gradcreasing<br />\nits Schenectady plant, in which city<br />\nthen was repeated yesterday. A R. 0. T. C. TURNS DOWN OFFER TO<br />\ncourses<br />\nthat the recent announce- uate of Yale.—The Wild Cat.<br />\nits<br />\nhe has since made his home.<br />\n\"Hullabaloo for Miles,\" led by JenMARCH IN ARMY-FLEET<br />\nment was made.<br />\nAppointed president of the ifer, was given lustily by the audi***<br />\nPARADE<br />\nIt is expected that this. opporSchenectady Board of Education in ence.<br />\nCollege \"pay day\" is one of the<br />\nThe Military Department demon1912, he was elected president of \"Don\" Vanneman announced that strated its support of Hopkins ac- tunity will prove attractive to those biggest days at Hood College,<br />\nmen 'desirous of entering the School Maryland. It is a day set -aside<br />\nthe Common Council of Schenecthe Class of '23 would give a dance tivities recently when Captain Paul,<br />\nwho will .have completed the re- annually on which everyone pays<br />\ntady three years later. Connected'<br />\nat the Maryland Casualty. Club- acting head of the department,<br />\nfor their college degree<br />\nquirements<br />\nsocieties,<br />\nWith many large electrical<br />\nhis class and club dues and subhouse on Saturday, November 10, ,turned down the request of the<br />\nat M:dyear and who would, there- scriptions to the college publicahe Was given a degree of M. A. by<br />\nthe day of the St. John's game. The Third Corps area officials to have<br />\nFlarvard University and one of pro- dance will be held at night, and the the J. H. U. R. 0. T. C. unit march fore under the more usual pro- tions.—The Blue and Grey.<br />\ngram, lose at least five months befessor of electrical engineering and. subscription will be reasonable.<br />\n* * *<br />\nin the parade before the Army.07e beginning their professional<br />\nelectro-physics by Union College.<br />\n\"Randy\" Norwood announced Fleet game on November tenth.<br />\nYALE, in attempting to satisfy<br />\ncareer. It should also be of inter-The author of a number of stand- that contributions from the SophoThe local commandant stated in his est to those men who, having grad- a crying need in the teaching proard works on electriicty and mathemore and Freshman classes for the refusal that the Hopkins organizafession for men, and men of higher<br />\nmatics, he was a specialist in mag- fund to buy a gift for Mr. Thomas tion owed it to the university to uated in June and gone into busi calibre, is instituting four new<br />\nin.<br />\ntraining<br />\ntheir<br />\nnetics, the symbolic method of al- R. Ball, the retired Registrar, had Participate in the demonstrations ness, have found<br />\nwhose very title are a key<br />\ncourses<br />\nof<br />\nternating current calculations and amounted to $45.18; and that the preceding the game with St. John's adequate for an effective grasp<br />\ncommendable aim. \"The<br />\nto<br />\ntheir<br />\nbusiness conditions<br />\ntransient phenomena.<br />\nSenior and Junior classes would be on the same date. According to<br />\nGrowth<br />\nof Self,\" \"Human LearnThe following men from Johns<br />\nDr. Steinmetz was also noted for called upon to contribute. For the Captain Paul this is a great sacriing,\"<br />\n\"Human<br />\nDifferences\" and<br />\nfiropkins University are among the<br />\nIlls ability to think and write with benefit of the Freshmen, he anfice for him to make as the staff 3t1...cessful<br />\nEducation<br />\nand Teach\"College<br />\nappli.:ants now registered<br />\ngreat rapidity. He even. invented nounced that activities buttons of military instructors is anxious<br />\nfunction<br />\nof the<br />\ning,\" in which the<br />\nin the School!<br />\na very fast system of shorthand for would be given out at.the Barn as to'<br />\nshow the Army and Navy ofYear Main—F. I. Fona- college in American society, its<br />\n.econd<br />\n..his own use.<br />\nsoon as the lists of candidates for ficials who will be here that day as<br />\npurposes, its activities, incentive<br />\nn ff.<br />\nthe various actiVities are complete. well as the people of Baltimore, how<br />\nlearning and methods of teachto<br />\nCromwell<br />\nMen—M.<br />\nJ.<br />\nF.:rst<br />\nYear<br />\nHOW HE KNEW<br />\nGame tags must be worn on Mon- well trained the Hopkins men are.<br />\ning<br />\nwill be discussed.—The PolyTrew.<br />\nPartiss<br />\nand<br />\nClergyman—There was a stranday; Tuesday and Wednesday of<br />\nSome slight changes have been<br />\ntechnic<br />\nRegister.<br />\nger in church today.<br />\neach week. University rings can be made in the assignments of the of* *<br />\nTHE DECLINE OF THE<br />\nWife—What did he look like?<br />\nsecured from Kelso Morrill, Box ficers. Lieutenant Atwater will asPENNANT<br />\nClergyman—I did not see him.<br />\nCONNECTICUT<br />\nAGGIE has<br />\nNo. 523.<br />\nsist Captain Davis in the drill work<br />\nbut I found a dollar in the contrilater<br />\na<br />\ndramFitch,<br />\nClyde<br />\nradical<br />\nWhen<br />\nmade a series of<br />\nchanges<br />\nThe assembly ended with yell out on the field in order to perfect<br />\nbution box.—Philadelphia Bullesystem<br />\nthis<br />\nyear.<br />\nin<br />\nits<br />\n\"Cut\"<br />\nstanding,<br />\nswept<br />\nrecognized<br />\natist<br />\nof<br />\npractice.<br />\nthe quality of the drill to a degree<br />\ntin.<br />\nabsences<br />\nHereafter<br />\nabsolutely<br />\nno<br />\nheretofore unattained in the annals his room at Amherst free of penDR. J. WHITRIDGE WILLIAMS RE- of the unit. Both officers<br />\nexpress nants and painted around his wall will be excused for any reason. To<br />\nSIGNS AS DEAN OF MEDICAL<br />\nthemselves as greatly pleased with a border of roses, his over-rah-rah balance this, a bonus system alSCHOOL<br />\nlows additional credit for perfect<br />\nthe spirit and work of the upperContinued from page I<br />\ncontemporaries awake to the heresy attendance. No,further make-up<br />\nBesides his degree of Doctor of classmen and are counting heavily<br />\nwith a sneer and an icy shoulder. exams for incurred conditions will<br />\nMedicine, Dr. Williams holds on their continuance throughbut<br />\nbe offered.—The Polytechnic Regthose of Doctor of Laws and Sci- the year. This statement applies di- Now, thank the gods, collegians<br />\nister.<br />\nwith<br />\nin<br />\nEurope<br />\nspend<br />\nthe<br />\nsummers<br />\nence. He is a member of many rectly to the reception 'of the new<br />\n* * *<br />\ncameras and come home<br />\nhonorary societies, both American scheme evolved in which the cadet high-priced<br />\nUNIVERSITY<br />\nARD<br />\nHARV<br />\nand foreign, and has written sev- officers receive their instruction one to -embellish their walls with phoOF<br />\nUNIVERSITY<br />\nand old and the<br />\neral well-known text-books and week and give it to their men the tography of Alpine beauty<br />\ndiscussing<br />\nworld wonders. Even those whose PENNSYLVANIA are<br />\nmonographs. Dr. Williams' in- following week. purses have not bulged enough to the question as to which univerterest in constructive science and<br />\nallow<br />\na trans-Atlantic vagabonding sity should have the honor of holdpreventive medicine has always<br />\ncoin<br />\nenough for a Maxfield ing the American Olympic tryfind<br />\nbeen active, and in 1914 he was<br />\nParrish<br />\nat<br />\nleast. Because the day outs. Both colleges have excellent<br />\nelected President of the Associapennant<br />\nis over. And like- fields for the games an&amp; it is a<br />\nof<br />\nthe<br />\ntion for the Prevention of Infant<br />\nthe bathing beauty hard question for the committee<br />\nof<br />\nwise<br />\nthe<br />\nday<br />\nMortality. He was long a memPrinters or<br />\nof raiment, upon to decide.—The Polytechnic Regscant<br />\nreclining,<br />\nber of the Municipal Charities<br />\npennant<br />\nlettering. It ister.<br />\ntops<br />\nof<br />\nthe<br />\nBoard of Supervisors, and helped<br />\nThe Johns Hopkins<br />\nusually takes until junior or senior<br />\nconstruct the present efficient sysBEFORE<br />\nyear for one to relegate his gapdy<br />\nFirst drunk (bumping into lamp<br />\nNEWS-LETTER<br />\ntem of city charities.<br />\nnotions of interior decoration to the post): \"Excuse me, sir.\" (bumpjunk heap; but before long it seems ing into water hydrant): \"Excuse<br />\nRUN WHERE?<br />\nDrip: Let's walk around the<br />\nlikely that even freshmen will learn me, little boy.\" (bumping into secCollege Literature<br />\ndrink.<br />\nand<br />\nget<br />\na<br />\ncorner<br />\nto be wary of the pennant as sim- ond lamp post and falling down):<br />\n•<br />\nDrap : Hell no, let's run!<br />\nplicity and good taste come into \"Well, I'll just sit here until the<br />\n1.0M 13ARD and SOUTH STREETS<br />\n—Jester.<br />\ntheir own.—From The Dartmouth. crowd pas-h-es.\"—Sabre.<br /><br />\nnter',11<br />\nCo lecrate<br /><br />\ni<br /><br />\nof<br /><br />\nis<br />\nPi<br />\nary<br />\n: in<br />\nesra-<br /><br />\n5<br /><br />\nSO-<br /><br />\ncres<br />\nab-<br /><br />\nn<br />\nof<br /><br />\nher<br />\n;he<br /><br />\nen-<br /><br />\nn.\"<br /><br />\n11<br /><br />\nDAYS<br /><br />\nST. JOHN'S<br />\nGAME<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 30, 1923<br /><br />\n4<br /><br />\nSANFORDS<br />\n1111K<br /><br />\nFOUNTAIN PEN INK<br /><br />\nFROSH SCORE FIRST VICINTERCLASS BASEBALL<br />\nTORY BY DOWNING GILGAME CALLED OFF<br />\nMAN'S SECOND TEAM<br />\nFrosh-Soph Game Only Contest to Be<br />\nGilman Scores a Safety. Grinsfelder<br />\nClever at Intercepting Forward<br /><br />\nWill Improve the Action<br />\nof Any<br />\nFountain<br />\nPen<br /><br />\nOpening the season with a victory, Hopkins freshmen trim-nil-led<br />\nover Gilman's second team, 7-2.<br />\nGilman's only score was made by a<br />\nsafety, and while they threatened<br />\nthe Frosh a few times, Hophins<br />\nALL<br />\nCOLORS<br />\nwon a decisive victory. The first<br />\nhalf was a ragged affair, but real<br />\nALL<br />\nfootball was evident in the last two<br />\nSIZES<br />\nquarters, and the Frosh then made<br />\n•<br />\nCoach Landy seem satisfied with<br />\n\"The Ink That Made<br />\nhis proteges.<br />\nAfter the kick-off, by Frank of<br />\nT/Re Fountain Pen Possible\"<br />\nHopkins, Gilman ran the ball back<br />\nonly five yards from their 25-yard<br />\nline, thus placing the ball on the<br />\n30-yard line. Then Gilman became<br />\nmenacing and. successively completed four first downs, at the end<br />\nof which the ball was on Hopkins'<br />\n5-yard line. It was here that the<br />\nFrosh line covered themselves with<br />\nglory, •for they held the Gilman<br />\nbacks for the fourth down .on the<br />\nLimited<br />\ntoe-yard line. The Frosh then<br />\nBARN CAFETERIA chOse to kick, but in so doing Grinsfelder hit the goal. posts, and the<br />\nball bounded back into Hopkins'<br />\nEgrIENIEsLCILItEtglilIXECJEICEICIECIEEDgatED coveted ground. It was then that<br />\nGilman made her only score, a safet-y. The rest of the half was a seesaw affair; neither team making<br />\nmany first downs.<br />\nHopkins kicked off again in the<br />\nsecond half, but soon recovered the<br />\nlivii11 0 M 01110<br />\nball on downs. Grinsfelder and<br />\n\"The King of Lubricants\" Brian made consistent gains by line<br />\nplunging, but the feature of this<br />\nSHERWOOD BROTHERS, INC.<br />\nhalf was Gough's end running: The<br />\nINIKEINEWCHEIHERCEIHEIRECIEHENELIE most exciting incident of the whole<br />\ngame was the interception of a Gilman pass by Grinsfelder, who<br />\nthroughout<br />\nthe whole game seemed<br />\nBoys, the place to get your<br />\nquite adept at that trick. He caught<br />\nmeals—and they are honthe ball with a clear field ahead of<br />\nest-to-goodness meals, well<br />\nhim, but had only run 30 yards<br />\ns er v e d, and reasonably<br />\nwhen he was downed on Gilman's<br />\npriced—is at<br />\n40-yard line. Through consistent<br />\nline plunging the ball was finally<br />\nPlaced on Gilman's 10-yard line. On<br />\nthe second down, Neuberger, who<br />\nwas substituted for Cone, pulled off<br />\na neat left-end run for the only<br />\ntouchdown of the game. Frank<br />\n1817 N. Charles St.<br />\nthen kicked goal. After this the<br />\n(Half Block below North Ave.)<br />\nFrosh held Gilman easily and never<br />\nagain were they menacing.<br />\nNicholas Brown, Mgr,<br />\nThough outplayed in the first<br />\nquarter, Hopkins came back with<br />\none of the strongest lines ever seen<br />\nfor a team of its class, and completely outplayed Gilman the rest<br />\nPrinters of Philological and<br />\nof the game. This victory has enScientific Works<br />\nthused Frosh followers who expect<br />\n23 S. HANOVER ST.<br />\ntheir team will lick the Sophomores<br />\nBaltimore, Md.<br />\nand a big turnout is expected to witness the game with Polytechnic's<br />\nSHIRTS<br />\nNECKWEAR<br />\nsecond team next week.<br />\nThe lineup follows:<br /><br />\nI<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br /><br />\n[bilEkT7 Ti<br /><br />\nThe St. REGIS<br />\nRESTAURANT<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nLeFranc &amp; Ault<br />\n421 N. HOWARD ST.<br /><br />\nHOSIERY<br /><br />\nGLOVES<br /><br />\nThe Flag, Banner &amp; Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nVernon 2355<br />\nR. H. Taylor<br /><br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBaltimore<br /><br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n41 Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nStaged<br /><br />\nBecause of the unexpected cold<br />\nand rain during the last few weeks,<br />\nseveral of the interclass baseball<br />\ngames have been necessarily postponed. Now, as the weather is beFURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\ncoming more unsuited to baseball<br />\n343 NORTH CHARLES STREET<br />\nevery day, the remaining games are<br />\nto be called off, with one exception<br />\n—the Freshman-Sophomore clash.<br />\nIf the Freshmen should succeed in<br />\ndefeating their persecutors in baseball, they would need only to win<br />\nthe football game in order to make<br />\nthe Freshman regulations void.<br />\nThis to the Frosh would be a Godsend and is greatly to be desired<br />\nby them. But to the Sophs it would<br />\nbe bitter medicine and naturally<br />\nboth teams will do their best toward fulfilling the wish of each<br />\nclass. The Frosh-Sophomore baseball game should be worth seeing<br />\nTYPEWRITTEN exam,thesis, or theme has<br />\nand a side performance after the<br />\nmany advantages. It is easy to read, and<br />\ngame would be greatly relished by<br />\nmakes a good impression; it is usually<br />\nmost of the undergraduates. Of<br />\nand more accurate, and it saves time.<br />\nfluent<br />\nmore<br />\ncourse, the side performance would<br />\nPortable for all your writing.<br />\nRemington<br />\nUse<br />\na<br />\nbe a Frosh-Soph battle, either forThis sturdy, little machine is compact,convenmal or informal, and lasting until<br />\nient, and complete, with the regulation four-row<br />\nall the combatants .have been carkeyboard like the big machines, and other \"big<br />\nried from the field.<br />\nmachine\" features. It can be operated on your<br />\nThe league standing is as folif you wish, for it carries its table on its back.<br />\nlap,<br />\nlows:<br />\nPct.<br />\nW.<br />\nL.<br />\nPrice, complete with case, $60. Easy payment terms if desired<br />\nFrosh<br />\n2<br />\n0<br />\n1.000<br />\nSophs<br />\n1<br />\n0<br />\n1.000<br />\nJuniors<br />\n0<br />\n1<br />\n.000<br />\nSeniors<br />\n2<br />\n0<br />\n.000<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nA<br /><br />\nRemington<br /><br />\nHAVERFORD HOLDS BLACK AND<br />\nBLUE ELEVEN TO 9-0 SCORE<br />\nContinued from page 1<br /><br />\ndid not net sufficient gains to add<br />\nto the score.<br />\nThe fourth quarter was marked<br />\nby the same forward passing tactics that had fea.stured the period<br />\npreceding it. Haverford's passes<br />\nwere just as effective as Hopkins',<br />\nmaking the game look gloomy for<br />\nthe J. H. U. rooters. Toward the<br />\nend of the quarter Bonner was<br />\nagain sent into the game. A long<br />\npass from Taylor to Schacht placed<br />\nthe ball in a position from which<br />\nTurnbull was able to make the first<br />\ntally of the game, a field goal. Receiving the ball soon after Taylor<br />\nresorted again to the forward pass<br />\nroute. Maxwell received a long one<br />\nfrom Taylor, running it to the tenyard line. Maxwell's ankle gave<br />\nway as he was tackled, necessitating<br />\nhis withdrawal from the game. Bonner took the ball on the next play<br />\nand carried it across the line for<br />\nHopkins' only touchdown. Turnbull's try for point after the touchHOPKINS (7)<br />\nBlumberg down was unsuccessful.<br /><br />\nGILMAN (2)<br />\nLE<br />\nAlexander<br />\nL.T<br />\nR. Lowndes<br />\nSchlossberg<br />\nL.G.<br />\nThompson<br />\nMagnes<br />\nParr<br />\nC.<br />\nFrank<br />\nBell<br />\nStone<br />\nR G.<br />\nChapman<br />\nR.E.<br />\nNicolls<br />\nScarlet '<br />\nQ.B<br />\nGough<br />\nGrinsfelder<br />\nShaw<br />\nL.H<br />\nMarchamp<br />\nCone<br />\nR.r-I<br />\nA. Lowndes<br />\nBrian<br />\nF.B<br />\nSubstitutes: Hop kins — Newberger<br />\nfor Cone; Steinwa Id for Magnes and<br />\nBrown for Blumbe rg.<br /><br />\nTHE FIRST THOUGHT<br />\n\"Played golf this morning?\"<br />\nchirped Babble.<br />\n\"What did you go around in?\"<br />\nasked Yvonne.<br />\n\"A pink sweater and a green<br />\nsilk skirt.\"—Louisville CourierJournal.<br /><br />\nFURNITURE OF QUALITY '<br /><br />\nPortable<br />\nRemington Typewriter Co.<br />\n25 W. Fayette St.<br />\nBaltimore<br />\nM<br /><br />\n111111EMISIMERIZIEEMBIZE<br /><br />\nHYNSON, WESTCOTT and DUNNING<br />\nPRESCRIPTION DRUGGISTS<br />\nTWO STORES:<br /><br />\nEutaw Place and North Ave.<br /><br />\nCharles and Chase Sts.<br /><br />\nMadison 0405<br /><br />\nVernon 0890<br /><br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\nAt the<br /><br />\nWashington Monument<br />\nOscar<br /><br />\nMinister<br /><br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br />\nThe purpose and program of this<br />\nChurch will appeal to you. Look in<br />\non the Sunday afternoon -At Home\"<br />\nfrom five to seven.<br /><br />\n•<br /><br />\nLineup:<br />\nHAVERFORD (0)<br />\nHOPKINS '(9)<br />\nRhoads<br />\nLE<br />\nBerndt<br />\nSumwalt<br />\nLX<br />\nMagill<br />\nAlbert<br />\nWolbert<br />\nMiller<br />\nDay<br />\nHollingshead<br />\nBarton<br />\nR.<br />\nMiller<br />\nRX.<br />\nCarter<br />\nMontgomery<br />\nR.E.<br />\nRich<br />\nQ.B.Garrett<br />\nraylor<br />\nNolan<br />\nTurnbull<br />\nR.EI.<br />\nLamberti<br />\nYeoman<br />\nF.B.(capt.) Wilbur<br />\nMaxwell<br />\nScore by periods—<br />\nHopkins<br />\nHaverford<br /><br />\n0 0 0 9-9<br />\no 0 0 0-0<br /><br />\nSubstittitions—Johns Hopkins, Slowik for Carter, Bonner for Yeoman,<br />\nSchacht for 'Berndt, Carr for Day,<br />\nYeoman for Bonner, Day for Carr,<br />\nBonner for Yeoman, Cook for Maxwell; Haverford, Heilman for Garrett,<br />\nI owry for Nolan, Arnold for Lamhim.<br />\nStop<br />\nShe—Help! Police!<br />\nberti, Hollingsworth for Montgomery,<br />\nNolan for -Lowry, Lamberti for ArHe tried to flirt with me.<br />\nnold, Basselle for A. Miller. TouchCop — Calm yourself, lady, down—Bonner. Field goal—Turnbull<br />\nReferee—Carrier, Dartthere's plenty more.—The Poly- (placement).<br />\nmouth. Umnire—Clinton. Yale. Head<br />\ntechnic Register.<br />\nlinesman—Sigman, Lafayette.<br /><br />\nThomas Olson, D.D.<br /><br />\nSunday ,morning worship at 11 o'clock.<br />\nSunday evening service at 8 o'clock.<br />\nMusic by vested chorus—choir of soloists.<br /><br />\n\"At the heart of the City\"<br /><br />\nALL SEATS FREE<br /><br />\nRENT A CAR<br />\nDRIVE IT YOURSELF!<br />\nALL NEW, CLEAN CARS<br />\nFORDS, 12c PER MILE—DODGES OR HUPS, 18c PER MILE<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br /><br />\nDRIVE IT YOURSELF CO.<br />\n1725 N. CHARLES ST.<br /><br />\nVERNON 4049<br /><br />\nONE BLOCK SOUTH OF NORTH AVE.<br /><br />"}], "field_media_file": [{"target_id": 37781, "display": null, "description": null, "target_type": "file", "target_uuid": "5c250841-f732-433a-a5e3-f77269129e68", "url": "http://digital.library.jhu.edu/system/files/2022-03/13080-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13080, "target_type": "node", "target_uuid": "2f2f5605-4234-4f8a-bc92-8e1f307cfe69", "url": "/node/13080"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "086f99d4-4b5a-4a33-ae09-d55fb7bd35fb"}]}