{"mid": [{"value": 35709}], "uuid": [{"value": "8d2350eb-8fc2-4e64-8d46-6cfcd7811b1f"}], "vid": [{"value": 35709}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12242-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "April 23, 190<br />\n<br />\nVol. VII, No. 13<br />\n<br />\nTHE<br />\n/fl<br />\n<br />\nEWSehL14.1IER<br />\n<br />\nIt)<br />\n<br />\n7r•e`<br />\n<br />\nPUBLISHED BY STUDENTS<br />\nOF<br />\n<br />\nTHE<br />\n<br />\nJOHNS HOPKINS UNIVERSITY<br />\n<br />\n\fThe Johns Hopkins Press.<br />\n<br />\nThe Johns tioDkins Universitll<br />\nBALTIMORE, MARYLAND.<br />\nI.<br />\n<br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October i, 1903.<br />\nPresident: IRA 11.1.31HIEN. Dean of the Medical Faculty:<br />\nWILLIAM H. HowaLl.. Dean of the College Faculty:<br />\nEowsiio H. GRIFFIN.<br />\n<br />\nFOR GRADUATE STUDENTS:<br />\n<br />\nili ebonleal 3ournal.<br />\nlime ric<br />\nI. RE SEN, Editor. Monthly, avo. Volume<br />\nXX<br />\nin progress. $5 per volume.<br />\n111. limerican 3ournal of ip bllologp.<br />\nB. L.61 LDEItSLEEVE, Editor: Quarterly. ave.<br />\nVolume X XIII in progress. $3 per volume.<br />\n11II.<br />\n$tubics from the Ibiological laboratory.<br />\navo.<br />\nVolume V complete. $5 per volume.;<br />\n<br />\nVII.<br />\n<br />\n(a) In Philosophy and the Arta. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br />\n<br />\nFOR UNDERGRADUATES:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLaboratories.<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br />\n<br />\nDirectors.<br />\nIra Rem Mill.<br />\nJONeph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nProokl In 1'. Mall.<br />\nWilliam H. Howell.<br />\nWilliam 11. Welch.<br />\nJohn .1. Abel.<br />\nJohn J. Abel.<br />\nWilliam Osier.<br />\n<br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nIf istory.<br />\nEconomics.<br />\nMathematics.<br />\nPhysics.'<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Sin lilt.<br />\nMaurice Bloomfield.<br />\nPaul Ifaupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn 111*. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. times.<br />\n<br />\nUndergraduate Courses (leading to B. A).<br />\n()vow:.<br />\n1. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Blological<br />\n(leadirigumi In medicine).<br />\n(:eological-Blological.<br />\nLatin-Mathematical.<br />\n(;. II istorical-Political<br />\n(leading lip to law).<br />\n7. Modern Languages.<br />\n<br />\nSerial Publications.<br />\nA merielin Journal of Mathematics(vol XXV).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nA inexican Journal of Philology (vol. XXIII).<br />\nStudies in Historical and Political Science (vol. XXI).<br />\nModern Language Notes(vol. XVIII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. Y).<br />\nTerrestrial Magnetism (vol. VII).<br />\nUniversity Circulars(vol. XXII).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br />\n<br />\n%tables in lbistorical anb Political %dem.<br />\nMonthly. 8vo. Series XXI in progress. $3 per<br />\nvolume.<br />\n3ohne bophins University eirculare.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XXII in<br />\nprogress. $1 per year.<br />\n<br />\n11)11.<br />\n<br />\n3ohne lisophins<br />\n<br />\nIX.<br />\n<br />\nContributions to Itssvriologr an<br />\nComparative<br />\nSemitic Pbilologv, (lieitrage zur Assyriologie, etc.)<br />\nVol. IV complete.<br />\n<br />\nX.<br />\n<br />\nfISemoirs from tbe Iliologicai laboratorv.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br />\n<br />\n'hospital 'Bulletin. Monthly. 4to.<br />\nVolume XIV in progress $1 per year.<br />\n11/111. 3ohns lbophins \"'smite''Reports. 4to. Volume XI<br />\nin progress. $5 per volume.<br />\n<br />\nLibraries.<br />\nUniversity,<br />\n105,000 volumes.<br />\nPeabody Institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br />\n<br />\nVolume.<br />\n<br />\nill.<br />\n<br />\nIL<br />\n<br />\nInstruction.<br />\n<br />\nlimerican 3ournal of Mathematics.<br />\nF. M( i It LEY, Editor. Quarterly. 4to.<br />\nXX V in progress. $5 per volume.<br />\n<br />\nXl.<br />\n<br />\nMobern language 'Rotes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4t0. Volume<br />\nXVIII in progress. $1.50 per volume.<br />\nX11. 3ournal of Experimcntal•Mcbicine.<br />\nW. If. WELCH, Editor. Hi-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nX111. limerican 3ournal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly.4to. $5 per<br />\nvolume.<br />\nXIV. 'Reports of Marvlanb ecological Starner.<br />\nWILLIAM It. CLARK, Editor.<br />\nterrestrial Magnetism anb litmoopberic 'Elec.<br />\ntricitv. L. A. BAIT ER, Editor. Quarterly. 8vo.<br />\nVolume V11 in progress. $2.50 per volume.<br />\nIDA. Ennual eport.<br />\nPresented by the President, of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nNUM ltnnual'Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br />\nIV.<br />\n<br />\nIn addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n\"LW.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\n• Testament. Edited by l'rof. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins Hospital. .1. S. Billings, Editor. lie pp. 4to. 56 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fan-simile edition. Edited by J. Rendel Harris. 110 pp. 4to. 30<br />\nplates. $5.00.<br />\nReproduction in Phototype ,of Syriac MSS. with A ntilegomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographiti Hopkinsiensis. Part, I. Philology. Parts<br />\nChemistry, Mineralogy and Geology. Parts<br />\nI V-V-V I. Physics,Astronomy and Mathematics.<br />\n8 vo. :10 cents per part.<br />\nft full list of publications will be sent on application.<br />\n<br />\nCommunications in respect to exchanges and remittances<br />\nmay be sent to Johns fiopkins Press, Baltimore, Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VII.<br />\n<br />\nAPRIL 23, 1903.<br />\n<br />\nNo. 13.<br />\n<br />\nTHE PH. D. OCTOPUS.<br />\nA Reply to Professor James from the Point of View of the Octopus.<br />\nROFESSOR WILLIAM JAMES, in a recent number of the Harvard<br />\nMonthly, has criticized the worship of the public for the degree of Doctor<br />\nof Philosophy. It is, he says, a sort of \"mandarin disease\" hostile to our<br />\ndemocratic idea that it is the man and the man's ability that count. The criticism<br />\nis not new. Montaigue about three centuries ago, though he did not speak<br />\nspecifically of the doctor's degree, made essentially similar restrictions concerning<br />\nthe worship of perfunctory knowledge, while the dangers of any hard and fast<br />\nsystem have been pointed out by almost every philosopher who has wielded a pen<br />\nin behalf of education. Nevertheless the degree has survived, although it has<br />\nseveral times changed its significance.<br />\nOriginally Master, Professor, and Doctor were used interchangeably. It<br />\nwas not until sometime after the degrees in law, divinity, and medicine had<br />\nbecome established as signs of the completion of an adequate training in these<br />\nsubjects, that the conviction arose that it was as foolish and dangerous to leave<br />\nthe training of a teacher, as it was to leave that of a doctor, to the whims and<br />\nvagaries of an irregular education. While the one might prove a menace to his<br />\npatient's health, the other might become a sower of heresy. Consequently the<br />\nterms Master and Doctor were officialized as signs of an adequate training. In<br />\nAmerica to-day we are going through a similar evolution. Only the heresy<br />\nwhich we now fear is of another kind, the heresy of ignorance.<br />\nThe exceptional man will now, as always, be amenable to no system and will<br />\nreach his ends by exceptional ways. So far as he is concerned, Professor James's<br />\nstrictures are rational enough. But such men are rare, and the demand for<br />\nteachers has to-day. increased far beyond the supply of native genius. There<br />\nare about four hundred colleges in America. To expect to find in every one men<br />\nof high native ability is futile.<br />\nHow then shall the average teacher be selected. The college should, says<br />\nProfessor James, apply to his instructors for recommendations. This, so far as<br />\nthe teacher's learning is concerned, is a mere play on words. For the doctor's<br />\ndegree, as it is conferred on the usual graduate student, is for the most part only<br />\nan official recommendation of the adequacy of his knowledge in the subject which<br />\nhe is to teach. And the adequacy of his knowledge is the first of all considerations. Another man, says Professor James, may be more learned. Very true;<br />\nbut the only test by which one may know it is the examination. In Germany,<br />\nwhere this is recognized, the passing of the itaatsexamen is required of every<br />\nwould-be teacher; just as we require state examinations of physicians or lawyers.<br />\n<br />\n(p<br />\n<br />\n\f2<br />\n<br />\nTI II<br />\n<br />\nNEWS LETTER.<br />\n<br />\nIn America, for collegiate teachers, the only such examinations we have are those<br />\nfor the doctor's degree.<br />\nThere is, however, a second requisite for a teacher, high scientific or academic<br />\nideals. And these can in most cases be, for the average man, attained only where<br />\nhe is surrounded by them. As Professor Rowland once said:<br />\n\"He\" (the student) \"goes forth into the world, and the height to which he<br />\nrises has been influenced by the ideals which he has consciously or unconsciously<br />\nimbibed in his university. If the professors under whom he has studied have been<br />\nhigh in their profession, and have themselves had high ideals; if they have considered the advance of their particular subject their highest work in life, and are<br />\nthemselves honored for their intellect throughout the world,—the student is<br />\ndrawn toward that which is highest, and ever after in life has high ideals.\"<br />\nThis association with high ideals can, in the sphere of academic knowledge,<br />\nbe attained only within the walls of our large universities. The first requirements<br />\nthen for a teacher are that he shall spend some time in such circles and that he<br />\nshall be examined officially as to his knowledge. And this is just what a candidate<br />\nfor the doctor's degree does. And the fact that he has done this is all that is'meant<br />\nby the conferring of the degree. For the thesis is only another form of testing<br />\nhis knowledge and intellectual power. If then the candidate has complied with<br />\nthese conditions, the distinction, so far as the spirit and substance of his learning<br />\nis concerned, between recommendation by the word of his instructors and recommendation by an official degree is meaningless.<br />\nProfessor James, however, makes the point that the man should be a good<br />\nteacher. Apropos of which we may quote further from Professor Rowland:<br />\n\"But if the student is taught by what are sometimes called good teachers, and<br />\nteachers only, who know little more than the student, and who are often surpassed<br />\nand even despised by him, no one can doubt the lowered tone of his mind.\"<br />\nThis may be a little strong ; but it emphasizes the subordinate importance of<br />\nability to teach in and by itself. It must be admitted that. Professor James is<br />\npartially right on the point ; but the enduring • part of his argument, after the<br />\ncloak of anecdote and wit is stripped off, is simply this, that a teacher should<br />\nknow how to teach, a conclusion which seems scarcely new enough to be worthy<br />\nof so long and able a defense.<br />\nProfessor James, however, holds up to us several horrible examples, such as<br />\nthe colleges which advertise the degrees of their.faculty. as the \"brazen mercantile<br />\nfashion\" advertises soap or historical novels,, the colleges that advertise \"No<br />\nteachers here who are not doctors,- and the men who have taken degrees in one<br />\nsubject and then, on the strength of the degrees, taught something else. There<br />\nis only one reply to such arguments. As a rule these things do not exist; and<br />\nthe trotting them forth as flagrant examples of corruption is a sin as flagrant, in<br />\nits own way, as the sins these examples are to illustrate. It is a sin against the<br />\nancient principle of logic which forbids generalizing from exceptions, however<br />\nentertaining it may be.<br />\nProfessor James furthermore laments the damage done to the doctor's<br />\ndegree by making it a commercial necessity, instead of a free recognition of<br />\n<br />\n\fTHE NEWS LETTER. .<br />\n<br />\n3<br />\n<br />\nscholarly effort. Apart from the fact that the doctor's degree was to this extent<br />\na \"commercial necessity\" five hundred years ago, and that one could in consequence scarcely be said to make it such to-day, the fact that it is a commercial<br />\nnecessity is not one to occasion grief. We have the Ll. D. for ornament and honor,<br />\nand it is sufficient for the purpose. If then the Ph. D. be used as the sign of the<br />\ncompletion of a patient and self-sacrificing novitiate in knowledge, and as such<br />\nbe used as a recommendation, it is difficult to see exactly how this damages it.<br />\nThere is no doubt that the Ph. D. is in imminent danger at the hands of<br />\ninferior colleges, and the day may be at hand when it will mean nothing without<br />\nthe attachment of the name of the university which gives it, or perhaps the sanction of the new league of American universities. This will be necessary as a sort<br />\nof monetary valuation of the \"commercial necessity.\" The system must adapt<br />\nitself to these conditions. But its destruction would to-day mean academic<br />\nanarchy, and so we may leave the subject in amiably characterizing Professor<br />\nJames's article as a piece of academic anarchy<br />\nALUMNI NOTES.<br />\nAmong the alumni who spent the Easter holidays in Baltimore were: '97,<br />\nDr. Charles E. Lyon, of Princeton; '98, Rev. Alfred Dieffenbach, of Pittsburg;<br />\n'99, Robt. Harold Grimes, attorney for the Lawyers' Surety Co. of New York;<br />\n'00, Roger B. T. Anderson, who will be ordained at the General Theological<br />\nSeminary, New York, next month; John P. Hill, and John W. Griffin, of Harvard<br />\nLaw School; Jared Sparks Moore, graduate student of Harvard; '01, Horace<br />\nGillespie, who is now in the chemical works at Camden; Abner Saylor, of Harvard<br />\nLaw School; J. Gresham Machen, of Princeton Theological Seminary; Wm.<br />\nJames, University of Virginia Law School; '02, Sidney Smith and Aubrey Pearre,<br />\nof Harvard Law School, Professor E. A. Smith, Ph. D., 1900, of Allegheny<br />\nCollege.<br />\nDr. W. H. Maddren, Medical School,'01, will be married on May 4th, to Miss<br />\nHelen Louise Howard, of Brooklyn.<br />\nAndrew Reed Bird, '01, is now at Luxor, Egypt.<br />\nDr. John Huston Finley, who received his Ph. D. at the University in 1889,<br />\nhas been selected president of the College of the City of New York. Dr. Finley<br />\nwas made president of Knox College in 1892, and occupied that office for seven<br />\nyears. He then accepted an editorial position with Harper's Weekly, and later<br />\nwith McClure's Magazine. After leaving McClure's he held the chair of politics<br />\nat Princeton. Beside his work for Harper's and McClure's Dr. Finley was founder<br />\nand editor of the State Charities Record and The Charities Review.<br />\nDr. Wm. F. Smith, who received his degree of A. B. at the University in<br />\n1886, died in this city on April 14. He came to this city from Virginia, and took<br />\na three year scholarship at the University. While at the University Dr. Smith<br />\ntook a prominent part in athletics, and graduated honor man of his class. He<br />\nheld the chair of anatomy at the City Hospital, and was for a long time resident<br />\nphysician there.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n111 1111110111111111 111111111111111111191111<br />\n<br />\n111111 1111 111<br />\n<br />\n1111111111111111119111111i11111 1 111 1110 11111 1 1 111111111111111110<br />\n<br />\ndny<br />\n<br />\nObi pri.<br />\n<br />\ntriparl<br />\n<br />\nMg 111% Ia\".1111,<br />\n<br />\n•al•<br />\n<br />\nuIhI1IIII1VhIIlIlIlIIIIIIIIIlIIPLIlN 011111111111111111111111111111111111111111111111111111411111111011111111ININ1111111<br />\n<br />\nMessrs. Douglas L. Buffinn, lie L. Easter, and Chas. E. Matthews, of the<br />\nRomance department, and Eben R. Haley, of the English department, are a party<br />\nof University students who will leave New York on May 6 for the continent. They<br />\nwill sail on the Neckar of the North German Lloyd Line, lancing at Bremen,<br />\nat which place they will scatter. Messrs. Buffinn and Easter will spend the summer in Paris. Mr. Haley will travel through Germany and Italy, and later enter<br />\nthe University of Grenoble, where he will spend the summer, after which he will<br />\nenter the Romance department of the Hopkins. Mr. Matthews intends to spend<br />\nthe summer in Germany, chiefly in the Hartz Mountains, and then enter the Sorbonne to pursue his studies in Romance language for a year.<br />\nDr. B. R. Schenck has tendered his resignation to the trustees of the Johns<br />\nHopkins Hospital. He intends to practice in Detroit, Michigan. He was graduated in 1898, at the Hopkins Medical School. Dr. John A. Sampson, a graduate<br />\nof the class of 1899 will succeed him.<br />\nOn Wednesday Dr. Remsen delivered an address before the Conference for<br />\nEducation in the South which is now in session at Richmond.<br />\nProfessor Chas. R Neill, Ph. D, '97, who is now at the Catholic University<br />\nof America, and who was assistant recorder of the Coal Strike Commission, was<br />\npresent at the regular meeting of the Economic seminary on April 'A.<br />\nAt the annual convention of the American Oriental Society, which was held<br />\nin McCoy Hall the last three days of Easter week, Dr. Gilman was re-elected<br />\npresident, and Dr. Paul Haupt and Dr. Maurice Bloomfield were re-elected members of the Board of Directors. Scholars from all parts of the country were present, among whom were: Professor Jastrow, Ph. D., 1886, the Hebraist of the<br />\nUniversity of Pennsylvania, and Professor Lanham, Fellow, 1876, now Professor<br />\nof Sanscrit at Harvard. Papers were read by the following University men:<br />\nProfessor Haupt, Professor Bloomfield, Professor Johnston, Dr. Foote, Dr. Blake,<br />\nRev. Dr. Rosenau, Rev. Mr. McPherson, Rev. Mr. Oussani, Mr. Barrett, Mr. Ember, and Mr. Siple.<br />\nAt the annual meeting of the American Philosophical Society, held in Philadelphia, lately, ex-President Daniel C. Gilman delivered an address. Dr. William H. Welch, who was on the program for an address, was kept at home by sickness. The convention was of special interest to this University, because of the<br />\nelection to membership in the society of three Hopkins professors: Dr. Basil L.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n5<br />\n<br />\nGildersleeve, Dr. William H. Howell, and Dr. Harmon N. Morse. Among the<br />\nHopkins men at the convention were: Professors Haupt, Clark, Elliot and<br />\nBrooks. Mr. C. E. Brooks, of the Hopkins mathematical department, read a<br />\npaper before the society.<br />\n• Dr. Joseph S. Ames has made arrangements for the visit and lectures of Prof.<br />\nJ. J. Thompson, the great English physicist. Prof. Thompson will reach Baltimore early in June, and will deliver six or seven lectures just before the commencement on June 9. He will discuss his theory about the nature of arc and spark<br />\ndischarges.<br />\nDr. Duncan S. Johnson, professor of botany, and Mr. Olin Forest Shreve, a<br />\nstudent of the zoological and botanical department, have gone to Jamaica to do<br />\nspecial work of a botanical character. Upon arrival at jamica, they will join Mr.<br />\nW. R. M ason of the cryptogamic department, and Dr. I,. M .Underwood,'professor<br />\nof botany in Columbia University. It is expected that they will be absent about<br />\nsix weeks.<br />\nProf. E. W. Armstrong, of the Romance department, read a paper on<br />\nnicipal Art in Paris\" to the audience that had gathered in McCoy Hall, April 10,<br />\nto hear Mr. William A. Coffin, the art critic of New York, who was to speak on<br />\n\"Various Aspects of Municipal Art.\" Mr. Coffin was obliged to return to New<br />\nYork on account of sickness. Dr. Armstrong described the magnificent buildings<br />\nand the method of their erection in the capital city. The question of public places<br />\nfor the working classes was also discussed.<br />\nThe Freidenwald Co., of this city, have recently published \"Jewish Ceremonial<br />\nInstitutions and Customs,\" by Dr. Wm. Rosenau. The lectures on which the<br />\nmatter contained in the work is based were delivered before the Oriental Seminary of the University during the winter of 1901. Dr. Rosenau has dedicated his<br />\nwork to Mr. Henry Sonneborn, the founder of the Sonneborn collection of Jewish<br />\nCeremonial Objects.<br />\n- Dr. A. Marshall Elliott, director of Romance studies, gave on April 6, the first<br />\nof a series of weekly lectures on the Portugese language and literature.<br />\nA public meeting in the interest of the prevention of tuberculosis in Baltimore<br />\nwill be held Friday evening, April 24, at 8.30 o'clock, in McCoy Hall.<br />\nDr. William Osler and Dr. Henry Barton Jacobs constitute the committee of<br />\narrangements for the meeting.<br />\nThe March number of the \"Inland Printer,\" a magazine devoted to the interests of the printers' trade, contains a long editorial on the investigation into the<br />\nlabor conditions that is being carried on by the Economic department of the University. The article highly commends the work of the University and predicts<br />\nvaluable discoveries as a result of the department's work.<br />\nOn Tuesday afternoon, April 15, Prof. Jam R. S. Sterrett, of Cornell University, one of the leading archaeological explorers of this country, delivered an<br />\ninteresting lecture on \"The Troglodytes of Cappadocia, or Cave Dwellers of Asia<br />\nMinor,\" in McCoy Hall. The lecture was illustrated with views of the excavations he himself had taken while he was in those regions.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nAPRIL 23, 1903.<br />\nSubscription $1.50 per year.<br />\n<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n.<br />\n<br />\n10 Cents a single copy.<br />\n<br />\nGEORGE A. FOSTER, 1904.<br />\n. REGINALD S. OPIE, 1904.<br />\nH. V. MORSE, 1905.<br />\n<br />\nAssistant News Editors,<br />\n<br />\n5<br />\n<br />\nAthletic Editors,<br />\n<br />\ni J. NEWMAN NUMSEN, 1904.<br />\n<br />\nBusiness Manager,<br />\nA Raistant Business Manager,<br />\n<br />\nHARRY BAETJER, 1903.<br />\nRIGGIN BUCKLER, 1904.<br />\n<br />\nAddress all articles, communications, etc., to HARRY K. TOOTLE, box 637, Johns Hopkins Vniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BARTJER,<br />\nJ. H. U.; or box 398, Medical Department of the Johns Hopkins University.<br />\n<br />\nONSIDERING the adverse circumstances under which the lacrosse team<br />\nbegan the season the outlook is most encouraging. Saturday's overwhelming victory over Stevens, who came here with a record of four goals against<br />\nthe Crescents, has caused the rooters to feel most sanguine, and to predict that the<br />\ngame on the 25th with Lehigh will be a repetition of last year's victory. However, we must not be too hopeful, since Lehigh has been putting up a strong<br />\ngame, and may prove no easy proposition. On the following Saturday, May 2,<br />\nthe only out of town game will be played, that with Swarthmore. Last year<br />\nSwarthmore fell a victim to our superiorplaying, but this year the result is uncertain. Swarthmore will have the advantage of playing on her own grounds, and<br />\nwill strain every nerve to repeat her performance of two years ago. In order that<br />\nthe varsity may have every encouragement the management is especially desirous<br />\nof having a large crowd of rooters accompany the team. The attendance at the<br />\nhome games has been large and enthusiastic and there is every reason why a large<br />\nparty of Hopkins men should be at Swarthmore to cheer the team on to victory.<br />\nTo play on strange grounds is always trying to a team, so with a crowd of students<br />\nthere to make the \"Hullabaloos\" ring loud and clear our men will feel more at<br />\n<br />\nC<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n6<br />\n<br />\n7<br />\n<br />\nhome. From the present outlook there seems to be no doubt but that this game<br />\nwill decide whether or not we will again be \"Champions of the United States.\"<br />\nLast year we defeated Swarthmore, we want to defeat her again this year. It is<br />\nvery desirable that every student who is able should show his loyalty to the University, and his appreciation of the team's work by going to Swarthmore. Manager<br />\nAddison announces that reduced rates have been secured, and that a special car<br />\nwill be provided for the team and rooters, provided that a sufficient number of<br />\nthe latter go along.<br />\n<br />\nN article by Professor James in The Horvard Monthly has been quoted<br />\nrather freely by the daily press. He considers that the Ph. D. degree has<br />\nbeen degraded to the standard of a teacher's advertisement. As Hopkins<br />\nhas always stood forth as the leading upholder of this degree we have thought<br />\nit advisable to introduce as the leader of this issue a criticism of Professor<br />\nJames's views on the subject. We believe that the criticism as presented will<br />\nshare the approval of most Hopkins men. Any institution of value can only be<br />\nbenefited by the fire of its critics, and for this reason Professor James's article<br />\nis valuable. It has brought out the weakest points of the system and possibly<br />\nsuggested modifications, but it will not, we believe, serve to weaken the strong<br />\nhold which the better qualities of the system have given it upon the convictions of<br />\nAmerican educators.<br />\n<br />\n4<br />\n<br />\n(V ITH the last issue the representatives of the Senior class ceased their<br />\nconnection with THE Nms-LETTER, and the control of the paper<br />\npassed to the Junior and Freshman classes. M essrs. Tootle and Bird<br />\nare to be congratulated on their work as editors, for to them is largely due the<br />\nadvanced progress which the paper has made during the past year. As editor-inchief Mr. Tootle has given his time and attention to making THE Nitws-LWrTER<br />\nwhat it should be—a representative undergraduate publication. His work has<br />\nbeen characterized by the same thoroughness that has made him a leader in the<br />\nother departments . of University life — class, athletics, and debating. In the<br />\nvarious lines of literary work Mr. Tootle has shown ability of a high order, and<br />\npromise of a bright future. Mr. Bird has been on T tip: NEws-LEPTP,R since his<br />\nFreshman year, and has always taken an active interest in its welfare. His skill<br />\nas an athlete made him particularly well fitted for the position of athletic editor,<br />\nand his articles have been marked by technical insight and impartiality.<br />\nAs is natural on such occasions the new board feels a hesitation on assuming<br />\ncontrol, and this time especially so because the editorial staff is not complete.<br />\nThis is a misfortune that has existed since the beginning of the present academic<br />\nyear, and one that is not creditable to the lower classmen. THE NEWS-LETTER<br />\nis the student's publication and deserves their support, not only financial, but also<br />\nliterary. The editors have a broad field to cover, and in order to cover it well,<br />\nneed the sympathetic help of the students.<br />\n•<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS LETTER.<br />\n<br />\nN view of the recent publications in the daily press regarding the failure of the<br />\nUniversity of Pennsylvania lacrosse team to fulfill its date with Hopkins<br />\non April 4th, it seems well to the editors that the position of the University<br />\nin regard to the matter be plainly stated.<br />\nThe facts are doubtless known to all: The date was made in good faith<br />\nby the Hopkins management, duly advertised, and in spite of very threatening<br />\nweather early in the day several hundred people assembled to witness the opening<br />\ngame of the season. Their interest was rewarded by the statement, made at the<br />\ngrounds on the authority of a telegram received at one o'clock that Pennsylvania<br />\nwould not be down on account of rain in Philadelphia. The coaches hastily<br />\nassembled an \"All Baltimore\" team to play against the varsity, and pulled off a<br />\nvery creditable game considering the adverse circumstances.<br />\nBy just what mental process the management at Philadelphia reached their<br />\nconclusion has not yet been fully made clear. The contract included an ample<br />\nguarantee in case of rain, they were aware of the fact that the game had been<br />\nadvertised and also, probably, of the fact that Lacrosse may be played in the<br />\nrain. The only explanation forthcoming as to their somewhat peculiar method<br />\nof keeping dates was contained in the original message. Up to this time no<br />\napology, explanation, or offer to meet the actual financial loss to the Hopkins<br />\nmanagement, has been received.<br />\nSo much for the facts. Now as to the University's position in the matter.<br />\nThe Athlete Association feels that the reason advanced—Rain in Philadelphia—is<br />\nnot sufficient to justify the cancelling of a financial contract involving loss to the<br />\nother party. It feels that the Pennsylvania team showed lack of sportsmanlike<br />\ncourtesy in withdrawing at the eleventh hour on the ground named. And lastly<br />\nit feels that some apology is due to it for this rather unusual treatment, or at<br />\nleast an offer to share the loss incurred in the matter.<br />\nThe last letter received from the Pensylvania management, complaining<br />\nof the tone of the comments of the daily papers on the incident, hardly deserves<br />\nnotice in these columns. It is enough to say that neither the team, management<br />\nnor coaches are responsible for all statements appearing in the daily papers.<br />\n<br />\nj<br />\n<br />\nUNDERGRADUATE NOTES.<br />\nRalph 0. Fuerbringer, '04, has returned to the University after an absence of<br />\nalmost a month on account of sickness.<br />\nReginold S. Opie, '04, is now Hopkins' correspondent of The Intercollegiate<br />\nNews.<br />\nRobert S. Lanier, '03, spent the Easter vacation at Greenich, Conn., with his<br />\nbrother, Chas. D. Lanier, '88, who is now assistant editor of the Review of Reviews.<br />\nWhile away Mr. Lanier secured some very artistic drawings for the Hullabaloo.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n9<br />\n<br />\nThe Musical clubs will give a concert for the benefit of the Lawrence House<br />\nin McCoy Hall on the night of May 9.<br />\nG. P. Putman's Sons, of New York, have just published \"The American Republic and Its Government,\" and \"Political Parties and Party Problems,\" both by<br />\nDr. James A. Woodburn, Ph. D., 1890, who is now Professor of American History and Politics, at Indiana University.<br />\n<br />\nPROGRESS OF THE INTERCOLLEGIATE DEBATE.<br />\nORK on the intercollegiate debate has been progressing rapidly since<br />\nthe Easter holidays. Dr. Lee has selected Messrs. Plaggemeyer, Blum,<br />\nand Strayer to train with a view to representing Hopkins at the University of North Carolina on May 2. There will be two speakers, and, whether<br />\nor not the third man will be taken along as an alternate, depends largely upon<br />\nthe financial support offered by the student body. A committee has been appointed<br />\nto solicit contributions from the students and faculty.<br />\nAlthough there remain only a few more days for training, yet during that time<br />\nit is expected that all men interested in the work will exert themselves to help the<br />\nteam. The men are training every (lay and anyone who can furnish an argument<br />\nfor or against ship subsidies will be cordially welcomed by the team. If we are<br />\nto turn out a winning team, the whole undergraduate body must co-operate with<br />\nthe men who are to represent the University.<br />\nThose who are most interested in debating at Hopkins hope that we will be<br />\nvictorious in our contest with North Carolina this year, for then it will seem certain<br />\nthat we can turn out debaters strong enough to contest with the best teams in the<br />\ncountry. Next year it is ,expected that we can arrange for debates with one or<br />\ntwo of the large, northern universities in addition to the debate already scheduled<br />\nwith Carolina.<br />\n<br />\n14<br />\n<br />\nY. M. C. A. NOTES.<br />\nThe Annual Members' Reception was held on Saturday evening, the 18th, in<br />\nLevering Hall, in honor of the members of the Young Women's Christian Association of the Woman's College. A very enjoyable evening was spent with a large<br />\ncompany of the young ladies. No special program was arranged, except a talk<br />\nby Miss Robbins, of Lawrence House. Miss Robbins gave a very interesting description and discussion of the work done there, and 'every one was interested to<br />\nlearn of the success which has attended her first year of labor in that field. Mr.<br />\nC. K. Edmonds, as one of our Lawrence House directors, added a few words and<br />\nalso spoke of the summer conferences at Northfield and Silver Bay. Light<br />\nrefreshments were served.<br />\n<br />\n\fTHE NEWS LETTER.<br />\nDr. E. A. Hume, of Johns Hopkins Hospital, spoke at our Tuesday afternoon<br />\nmeeting on the 21st about Medical Work in India. Dr. Hume is preparing to<br />\ntake up this work in the near future.<br />\nOn May 5th the 5 o'clock meeting will be devoted to a discussion of interests<br />\nat the Northfield Conference and Camp. An interesting program will be prepared<br />\nand all men are invited to attend and catch a little of the enthusiasm of the men<br />\nwho have previously availed themselves of this opportunity. Features will be<br />\nannounced later.<br />\nJohn A. Addison leads Morning Prayers this week, and A. G. Murray next,<br />\nat 8.45.<br />\nA number of new and interesting books have recently been added to the Missionary Library and also a few on Christian Evidence which men are invited to<br />\nread..<br />\nTHE OWL AND THE BUG.<br />\nOnce said the microscopic bug to the idiopathic owl,<br />\nI can make you lord of the land and sea,<br />\nAnd king of the wheezy fowl—<br />\nThus spoke the subtle microbe to the over-easy owl.<br />\nThe idiopathic owl pooh-poohed the words of the ramping germ,<br />\n\"Do you think that I'm a frisky fool,<br />\nAn ass before my term ?\"<br />\nBut idiosyncric ideas through his head began to squirm.<br />\nThe 'cillus winked his nether eye, the owl he picked his teeth.<br />\n\"What are the terms,\" at last he said,<br />\n\"That you me this bequeath ?\"—<br />\n\"If I may travel through you, sir, you may win this wreath.\"<br />\nThe silly bird at once agreed, the raspy bug flew in,<br />\nHe took a chaw from here and there<br />\nAnd raised a joyous din,—<br />\nNext day died that foolisii owl, lamenting of his sin.<br />\nAnd now my story's done, you ask what is the moral here?<br />\nWhy should I talk of bugs and owls<br />\nAnd not of queens and beer?—<br />\nThe moral is, I hate to say, the poet's head is queer.<br />\nThe Maid—What makes you chew your moustache so, Reggie? Are you<br />\nfond of discouragement?<br />\nThe Thing—Discouragement—aw ?<br />\nThe Maid—Yes; feeling down in the mouth, you know.—Lampoon.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n11<br />\n<br />\nLACROSSE.<br />\nHopkins 8 -Hobart 1.<br />\nN a drizzling rain the Johns Hopkins lacrosse team opened the season on April<br />\n11, at Electric 1Park, by defeating the Hobart College team by 8 to 1. In<br />\nspite of the weather a number of enthusiasts were present to cheer the University team to victory.<br />\nConsidering the fact that this was the first game of the season, the team did<br />\nexcellent work. The slippery condition of the grounds caused many of our boys<br />\nto fall. This was not the case with Hobart, as they used rubber spikes, by the aid<br />\nof which the visitors easily outran the locals. In all the other points of the game<br />\nHopkins clearly outclassed her rival. Hopkins took the lead in the beginning. Matthai got the ball and passed it down the line to Rosenheim, who threw the first goal<br />\nin less than two minutes from the time the whistle blew. Not once in the entire<br />\ngame were our boys in danger of being headed off. It was only in the last five<br />\nminutes of the second half that Hobart scored her single point. Putts, Foster and<br />\nBird and Blanck did especially fine work. For new men Matthai, Dill and P.<br />\nStrauss showed up very well; but Dill lacks some of the points of the game which<br />\ncan only be acquired by experience. The line up was as follows:<br />\n- Hopkins—P. Straus, g. ; Schmeisser, p.; Blanck, c. p. ; H. Straus (captain),<br />\n1st d. ; Custis, 2d d. ; Tough, 3d d. ; Matthai, c. ; Bird, 3d a.; Foster, 2d a. ; Dill,<br />\n1st a. ; Rosenheim, o. h.; Putts, i. h.<br />\nHobart—Ellis, g.; Whitney, p. ; Atwater, c. p. ; Schuman, 1st d. ; McHenry,<br />\n2d d. ; Hollands, 3d. d.; Maddagan, c. ; Baugher, 3d a.; Giltrap, 2d a. ; Doup<br />\n(captain), 1st a.; Espy, 0. h. ; Frierson, i. h.<br />\n<br />\n3<br />\n<br />\nHopkins 13—Stevens 1.<br />\nN the first inter-collegiate lacrosse game, the Johns Hopkins team defeated the<br />\nstrong aggregation from Stevens Institute, on April 18, by 13 to 1. The reputation of the visitors and the expectation of a fast game brought out a large<br />\ncrowd to witness the contest.<br />\nIn spite of the crushing defeat which Hopkins administered her rival, the<br />\ngame was by no means devoid of interest, and the Northeners certainly played a<br />\nstronger game than Hobart did last week.<br />\n<br />\n3<br />\n<br />\n\f1.2<br />\n<br />\nTHE NEWS LETTER.<br />\n<br />\nMuch anxiety was felt as to the outcome in the early part of the game. Bennitt, of Stevens, got the ball at the start, and passed it rapidly up toward Hopkins'<br />\ngoal. For some time a fierce struggle was waged near the net, but the danger was<br />\nremoved when Captain Strauss threw the ball down the field. Several attempts<br />\nat goal were made by our boys, but all were unsuccessful until Bird passed the ball<br />\nto Putts, who threw the first goal, after two minutes and forty-five seconds of the<br />\ngame had been played. Forty seconds later Rosenheim threw the second goal.<br />\nDuring the next ten minutes, the ball sped from side to side. Johnson and<br />\nBillings made several attempts at goal for Stevens, as did Putts for Hopkins, but<br />\nthe good work of the goal keepers prevented scoring. After the third goal was<br />\nmade, three others followed in rapid succession.<br />\nIn the second half the superior endurance of the local boys was clearly seen.<br />\nThe visitors played fast and furious for a while, but were unable to keep it up.<br />\nSeveral times time was called owing to a man being laid up temporarily. After<br />\nten minutes of such playing, the Stevens men weakened considerably, and the<br />\n'Varsity had it easy from then on.<br />\nThe only scoring by the visitors was during- that ten minutes of fast playing.<br />\nThe ball went slowly from Stevens' goal toward Hopkins'. Roeser passed the<br />\nball to Johnson, who threw safely past P. Strauss.<br />\nFor the past two years Stevens has been excluded from the league on account<br />\nof alleged roughness, but it must be said to their credit that they put up a clean<br />\nbut fast game. They came with the intention and expectation of winning, but<br />\nthey did not let their desire cause them to use any undue roughness in attaining<br />\ntheir aim. That they did not win was because they were outclassed by Hopkins.<br />\nSome of the 'Varsity boys distinguished themselves on the field, hut the victory was due to the good work of the team as a whole. The old men, of course,<br />\ncould be relied upon to do their share of work, but some misgivings were felt as<br />\nto the ability of the new ones to put up such an article as is demanded if we are<br />\nto win the championship again this year. It must be said that the new men<br />\naccredited themselves with glory. Keep it up, boys, and old Johns Hopkins will<br />\nadd another championship banner to her already long list.<br />\n<br />\nTRACK TEAM.<br />\nSIDE from the Pennsylvania Relay Races, a fresh impetus has been giveil<br />\nto track and field work by the final success of the plans for a dual meet<br />\nbetween Johns Hopkins and the University of Virginia. After a long<br />\nperiod of doubt and uncertainty, but of fond hopes and expectations, definite<br />\narrangements have at last been made by which the track and field team of the<br />\nUniversity of Virginia will travel to Baltimore to •compete with the Hopkins<br />\nteam on Thursday, May 7th, either at Electric Park or at the Maryland Oval.<br />\nAs several weeks of correspondence between the managers of the respective<br />\nteams had been productive of no satisfactory results, on one fine day last week<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n13<br />\n<br />\n\"Mack\" took it into his head to journey down to Charlottesville, and returned<br />\nlater with the glad news that a two years agreement had been made, by which<br />\ngames are to be held here this year and at Charlottesville next year. The chief<br />\ncause of delay in making arrangements was that all dates desired by Hopkins conflicted with Virginia's baseball schedule, which had to be considered, as several<br />\nof the track men also play on the ball team. There is little doubt that the selection of suitable dates for future meets will be an easy matter.<br />\nIt is expected that this dual meet will sound the keynote for a great athletic<br />\nmovement through the South, which will be felt by many of its leading institutions.<br />\nThe programme will consist of 11 events, in each of which there will probably<br />\nbe only two or three contestants from each institution to start, although the number of entries will be unlimited. Only firsts and seconds will count in the scorings.<br />\nThe events are as follows: 100 yard dash. 220 yard dash. 440 yard run. 880<br />\nyard run. 1 mile run. 120 yard high hurdle. 220 yard low hurdle. Running<br />\nhigh jump. 16 pound shot put. Pole vault. Running broad jump.<br />\nIt is said that Virginia has 40 men trying for the meet, from which number<br />\nonly about 15 will be selected. Hopkins has about 20 men who are making special<br />\npreparations.<br />\nAs to the outcome of the games, it is at the present time a little too early to<br />\nprophesy with any degree of accuracy, but there is but little doubt that our men<br />\nwill conduct themselves in a manner fully calculated to reflect credit both upon<br />\nthemselves and their Alma Mater. As this meet marks the beginning of a new<br />\nventure, it is not too much to expect everyone to come and shout, in order to<br />\nassure the success of all such future games.<br />\n<br />\nINCE the Hopkins Armory games of a few weeks ago, when the tide of<br />\nathletic interest ran so high, there has been a sort of lull in track and field<br />\nwork, until some few days ago when the better seasoned men were again<br />\nput to hard training. This has since continued daily both in the cage and at<br />\nElectric Park, when the weather permitted. At present all is in preparation for<br />\nthe University of Pennsylvania Relay Races to be held on Saturday, April 25th, at<br />\nFranklin Field, Philadelphia. Unusual interest attaches to these races in that<br />\nPennsylvania has organized a special class in which Hopkins will compete for<br />\nthe \"Middle States Championship\" against such veterans as Bucknell, Pennsylvania State College, Lehigh, Westminster, University of Virginia; and Dickinson.<br />\nIn entering this class, our men fully realize that increased efforts will be expected<br />\nof them, but a victory, so much harder to gain, will be correspondingly more<br />\nvaluable. While they do not feel an abiding confidence in winning against such<br />\nformidable opponents, yet they are in no way displeased at the increased responsibilities of their advancement which has been so justly earned. From comparative records made in the last few years, although such records are valuable only<br />\nwith certain limitations, Bucknell and Penn State will probably be our most<br />\ndangerous opponents, but every candidate is possessed with a firm determination<br />\nto put forth the best that is within him, in order to make the most creditable<br />\n<br />\np<br />\n<br />\n1<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS LETTER.<br />\n<br />\nshowing possible. It is a case of winning a hard fought battle, or of dying in a<br />\ngood cause.<br />\nThe team has not been definitely picked at this time, but will certainly consist<br />\nof Joe England and Capt. Hoffman, the other two to be chosen from Freeze,<br />\nPassagno, Tootle, LeCron, and Stone, any one of whom may be fully expected<br />\nto do his duty at the proper time. As it is impossible for most of us to see these<br />\ngames, it is not too much to expect that all will be on hand with an extra amount<br />\nof enthusiasm for the meet with the University of Virginia.<br />\n<br />\nBASE BALL TEAM DISBANDS.<br />\n<br />\nFTER a brief existence of a few weeks, it has been ultimately decided to<br />\ndisband the baseball team. This decision was reathed only after a serious<br />\nconsideration of the circumstances that seemed to render such action necessary. Certain causes which had been operating since the beginning of the season, at last became of such a nature that disorganization seemed the most advisable<br />\ncourse to pursue. To this end all games scheduled have been cancelled. The<br />\ncauses referred to will probably occur to everyone at all familiar with the baseball<br />\nsituation. From the first the team has been surfeited with disappointments. Practice began encouragingly with a promising bunch of candidates, but this number<br />\nwas soon to be decreased by unforseen circumstances. Two men had attacks of<br />\nsickness that would have prevented them from playing again this season. Another man was compelled to withdraw on account of outside work, several others<br />\non account of studies, while three more were seriously handicapped by the pressure<br />\nbrought to bear upon them in other lines of athletics. Despite these drawbacks, a full team and several substitutes were left, but increasing studies of the<br />\nmedical men who form a majority of the team, rendered practice very inconvenient,<br />\nalthough it called for only one hour on two afternoons a week, which were<br />\nthe only times any number of the men'could be got together. In this limited<br />\ntime, results could not be assured that would justify the inconveniences suffered<br />\nin sparing the time for practice. The enthusiasm of the players was valueless<br />\nwhen unaccompanied by opportunity to practice. Furthermore, the lack of favorable interest, as well as the unabated discouragement of the Athletic Board<br />\nwas not calculated to add to the success of a team. There seems to be a prevailing prejudice against a Hopkins baseball team that cannot well be overcome<br />\nunder existing conditions. What the future of baseball at the Hopkins may be,<br />\nit is impossible at this time to say, but very certain it is that until suitable and<br />\nconvenient grounds can be procured for practice and playing, a movement to establish baseball again will labor under great difficulties.<br />\n<br />\ni4I<br />\n<br />\n\fTHE NEWS I,ETTER.<br />\nA THEATRE PARTY.<br />\n<br />\nThere were sixty tired Freshmen<br />\nWhen the Spring exams. were done,<br />\nPale from midnight toil and study,<br />\nTired of work was everyone;<br />\nSo they gathered in the basement<br />\nWhere a council was begun.<br />\n\"Lets go see the Little Princess,\"<br />\nOne proposed, the worst of all,<br />\n\"Let us view her elevation<br />\nAnd the wicked Minchin's fall;<br />\nOthers thought this 'most too wicked,<br />\nBut they followed after all.<br />\nThen they followed into the foyer<br />\nGazing around with childish eves<br />\nEyes of anxious expectation,<br />\nEyes of wonder and surprise,<br />\nEach one clasping fast an iron bank<br />\nWhere his cherished treasure lies.<br />\nThen they trooped up to the window<br />\nWhere the ticket man dispensed.<br />\nLittle slips of colored cardboard<br />\nFor the sum of fifty cents;<br />\nThere they asked for sixty tickets<br />\nAnd a smashing sound commenced.<br />\nAs,of banks that bursting open<br />\nFar and wide their contents pour,<br />\nAs of pennies rolling freely<br />\nFlying faster, more and more,<br />\nWhile the Freshmen scramble wildly<br />\nWith their sayings, on the floor.<br />\nWhen the others all had entered<br />\nTo the wondrous sights inside,<br />\nOne was found with but a nickel<br />\nAnd sat down and wildly cried,<br />\nStill some one (a generous senior)<br />\nChecked at last the briny tide.<br />\n<br />\n15<br />\n<br />\n\fTHE NEWS LETTER.<br />\nThere was sorrow 'mid the Freshmen,<br />\nSome were even moved to tears,<br />\nAt the sufferings of Sarah,<br />\nPitying her tender years<br />\nThey rejoiced a little later<br />\nAt the end of all their fears.<br />\nWhen they all came forth together<br />\nThey were captured by a throng<br />\nMade of nurses and policemen<br />\nAnd with execrations strong<br />\nOut of that forbidden building<br />\nThey were pushed and dragged along.<br />\n<br />\nThe sidewalk was not wide enough for two; moreover the street was dirty.<br />\n\"Brush by, coon,\" growled the ghost of the great John L.<br />\nThe shade of Darius of Persia waxed indignant. \"Have you no respect,\" he<br />\ndemanded, \"for my divine right?\"<br />\n\"How about my terrible left ?\" snapped the other. He swung to the jaw, and<br />\nwalked on.—Yalc Record.<br />\nDora—Did Jack say anything dove-like about me?<br />\nAlice—Yes, he said you were pigeon-toed.—Tiger.<br />\nPoliteness is the salt of life; you hate to have it rubbed into you when you are<br />\ncut up.—Tiger.<br />\nUpon a keg of dynamite,<br />\nLittle Georgia sought repose.<br />\nAnd slyly lit a cigarette.<br />\n\"My Little Georgia Rose.\"<br />\n—Widow.<br />\nTraveler (to hotel clerk): I want a room and a bath, please.<br />\nHotel Clerk: Well, I can give you a room, but I haven't time to give you<br />\nthe bath just now.—Ex.<br />\n<br />\n\fOPEN ALL NIGHT.<br />\n<br />\nWILLIAXSON<br />\n<br />\nWATTS,<br />\n<br />\nr.,3370rtio $tores,.,<br />\n'Baltimore and Eutaw Streets.<br />\n<br />\nHoward and Franklin Streets.<br />\n<br />\n/Drugs, jfancr (Boot's, Verfunierp,.Cotiet lirticIes, Cigars, Sam 'Mater.<br />\n<br />\nles<br />\n<br />\nTHE CHEAPEST PLACE<br />\nIN BALTIMORE FOR<br />\n<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Ooods, Olass Ware,<br />\nStudents' Sundries.<br />\n<br />\nH. S. WRIGHT & CO.,<br />\n704 MADISON AVE.<br />\nVvi-c<br />\n<br />\nC. &, I'. 'Phone 3350-Y.4711<br />\n<br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\nMathetnatical and Surveying Instruments,<br />\nDraughtsinen's and Engineers' Supplies_<br />\nN. W. Corner<br />\nLexington and Liberty Sts.<br />\n<br />\nliAl.,TiM01-211:, MD.<br />\n<br />\nAgent for Keuffel cf. .Esser Co., of New York.<br />\n<br />\n-\"A Pc.<br />\n<br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\n<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br />\n<br />\nHenderson's<br />\n<br />\n.A<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Hooks, —<br />\nMadison<br />\nStudents' Supplies.<br />\n<br />\n& Howard Sts.<br />\n<br />\nincorporated 18714.<br />\n<br />\n\"A's StfonA as the SteonAest.\"<br />\n<br />\nVIE FIDELITY MUTUFit LIFE INSUIVINGE<br />\nOF Pli•ILA.DELPI-VIA%<br />\nAN EXCELLENT OPPORTUNITY is offered Students and Teachers to write Insurance for THE<br />\nFIDELITY, either during vacation or permanently.<br />\nFor Agency In Maryland or West Virginia,<br />\n<br />\nAddress,<br />\nC. IMAIIA III, Manager<br />\n806 8 Merchants Bank Bldg., Baltimore, Md.<br />\n_<br />\n<br />\nFor Advertising Space in this Paper<br />\nAPPLY TO<br />\n<br />\n• 0,d(*IW<br />\nIeWe<br />\nt9,<br />\nST*.<br />\nLOMDAR<br />\ni,KINT<br />\n<br />\ntrIM cr.<br />\n<br />\n,<br />\n<br />\nPUBLISHERS.<br />\n<br />\ntoo<br />\n„!\"/A.\".47.677C3///1/(7',.4e.-tetro47<br />\n<br />\ne. NVI,111:7!, :BAL<br />\n<br />\nN ! CA,11 )011<br />\n,<br />\n<br />\n11117<br />\n<br />\nUNION<br />\nTHEOLOGICAL<br />\nSEMINARY<br />\n<br />\n7,,I.<br />\n<br />\nEquipped for<br />\nE<br />\nFF I:Scholarly<br />\nand Practical<br />\nwork, in the midst of the<br />\nChristian enterprises of a<br />\ngreat city,in close academic<br />\nrolations with Columbia and<br />\nNew York Universities, offers opportunities for the<br />\ndegrees of M. D., A. M. and<br />\nPh. 0,<br />\nOpen on equal terms to<br />\nstudents of all Christian<br />\nbodies.<br />\nSIXTY-1116AM YEAR<br />\n<br />\n700 Park Ave<br />\nNew York<br />\n<br />\nbegins September 23, 1903.<br />\nAddress the President of<br />\nthc Faculty, the<br />\n<br />\nRev. Charles C. Hall, D. D.<br />\n<br />\n\fSTIEFF PIANOS<br />\nMADE Or 'rim<br />\n<br />\nmawr MATERIALS MONEY<br />\n<br />\nAN!) EXPERIENCE CA N<br />\n<br />\nWwit1111401,1149.1<br />\n<br />\nCOM $300,000. Surplus and Uurlividerl Proll.s $400,000<br />\nDrovers & Mechanics Nat'l Bank,<br />\nOF BALTIMORE.<br />\n<br />\nIHJY.<br />\n<br />\nIli N. 14111E,ItTY ST.<br />\n<br />\nrs and<br />\nGUSHING &COMPANY'8Botaotkiselle<br />\noners.<br />\n<br />\n•Prest.<br />\n1. Strolls°,<br />\nEdw. P. Hayden, Ans't Cashier.<br />\n<br />\nJas. Clark, Prest<br />\nChas. S. Miller, Cashier.<br />\n<br />\nft General Banking Business Transacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom $3 per year and upward.<br />\n<br />\nAccounts Solicited.<br />\n<br />\n34 W. BfILTIMORE STREET.<br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nK eVp constantly on hand the Text, Hooks used<br />\nIII.)Ohlis Hopkins University and the Woman's<br />\nCollege of Balt imore.<br />\nSTATIONERY—Por School, Pamlly, Office and Bank.<br />\n<br />\nHaberdashers,<br />\nShirts, Nea1 wear,Underwear<br />\nIMIIIIIIIIIIMIIMIIIMME11.1111111111 Hosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\nOn Sale The J. II. U. Pennants, and nil other College<br />\n<br />\nTHOS.BLAKE CO<br />\nPennants.<br />\n<br />\n219 EAST BALTIMORE Si.<br />\nA. H. FETTING,<br />\nMANUFACTURER<br />\n<br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LEHMAN & SON,<br />\nFOR<br />\n<br />\nJORDAN STABLER GO.submitted of<br />\n<br />\nA711:1S11)<br />\nN7CIAIV<br />\nSamples<br />\nReads as follows:<br />\nFrench Brandy—no adulterants, no coloring,fine quality.<br />\nOporto Port —absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive 011—all tests show pure olive oil.<br />\nCider Vinegar.- natural cider vinegar, strictly pure and<br />\nstrong,<br />\nSix GrotimiSplees—no adlilteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br />\n<br />\nIlgenfritz Studio<br />\nSuccessor to Cummins.<br />\n<br />\nOF<br />\n<br />\nOren letter ffraternitp aewelrp,<br />\n14 A74 D 16 ST. PAUL STREET,<br />\n<br />\nBALTIMORE, MD.<br />\nIpleasc Call ant, Examine our ILine lacforc purchasing.<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial Discount to Students.<br />\nC. 3. V. telcpbonc 445 v.<br />\n<br />\nJENNINGS & HORSEY.<br />\nMERCHANT<br />\n<br />\nLibraries arranged and put in<br />\norder without removal. or if<br />\n<br />\nTAILoRsi.<br />\n<br />\ndget<br />\n<br />\nRUZICKA<br />\n<br />\n21 W. PAY ET•I'M ST/I/CET.<br />\n<br />\n=itz.t)a-<br />\n<br />\nBOOKS!!!<br />\nSECOND-HAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nExchanged.<br />\nBought, SIild and<br />\n<br />\nPIPPEN'S BOOK STORE,<br />\n605 IN. EUTFMAI ST.<br />\nNear the University.<br />\nBaltimore's largest Old Book Store.<br />\n<br />\nJ. H. U. Binder.<br />\n<br />\nBooginder,<br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE<br />\n<br />\nTHEO. WARNER.<br />\n<br />\nWARNER & CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln & Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 WEST BALTIMORE, STREET.<br />\n—<br />\nManufacturers of<br />\nSilk and Cassimere Hats. •••\"' Hopk<br />\n<br />\nins Caps<br />\n<br />\nLLOYD S. S. GO<br />\nNORTH GERMAN<br />\nCABIN l'f1SSf1Gl T LOW RATES.<br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBRLTIMORE TO BREMEN DIRECT.<br />\n<br />\nSCHUMAGtIE,R & GO., General Agents.<br />\n<br />\nPor particulars apply to<br />\n<br />\nISAAC H. DIXON, P<br />\nJAS. R<br />\n<br />\nTHE<br />\n<br />\nChas. Whims Surgical Instrument Co.<br />\n<br />\n.JAS. MEIKLIE, Vicc-PAEAT<br />\nRICHARDS, TREAS.<br />\n<br />\nSmith, Dixon Co.<br />\n<br />\nPH YSICI ANS'. SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\nBaltimore, Md.<br />\n<br />\n29 - 31 S. Charles Street.<br />\n<br />\nLI<br />\n<br />\n\f", "format": "basic_html", "processed": "April 23, 190<br /><br />\nVol. VII, No. 13<br /><br />\nTHE<br />\n/fl<br /><br />\nEWSehL14.1IER<br /><br />\nIt)<br /><br />\n7r•e`<br /><br />\nPUBLISHED BY STUDENTS<br />\nOF<br /><br />\nTHE<br /><br />\nJOHNS HOPKINS UNIVERSITY<br /><br />\nThe Johns Hopkins Press.<br /><br />\nThe Johns tioDkins Universitll<br />\nBALTIMORE, MARYLAND.<br />\nI.<br /><br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October i, 1903.<br />\nPresident: IRA 11.1.31HIEN. Dean of the Medical Faculty:<br />\nWILLIAM H. HowaLl.. Dean of the College Faculty:<br />\nEowsiio H. GRIFFIN.<br /><br />\nFOR GRADUATE STUDENTS:<br /><br />\nili ebonleal 3ournal.<br />\nlime ric<br />\nI. RE SEN, Editor. Monthly, avo. Volume<br />\nXX<br />\nin progress. $5 per volume.<br />\n111. limerican 3ournal of ip bllologp.<br />\nB. L.61 LDEItSLEEVE, Editor: Quarterly. ave.<br />\nVolume X XIII in progress. $3 per volume.<br />\n11II.<br />\n$tubics from the Ibiological laboratory.<br />\navo.<br />\nVolume V complete. $5 per volume.;<br /><br />\nVII.<br /><br />\n(a) In Philosophy and the Arta. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br /><br />\nFOR UNDERGRADUATES:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLaboratories.<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br /><br />\nDirectors.<br />\nIra Rem Mill.<br />\nJONeph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nProokl In 1'. Mall.<br />\nWilliam H. Howell.<br />\nWilliam 11. Welch.<br />\nJohn .1. Abel.<br />\nJohn J. Abel.<br />\nWilliam Osier.<br /><br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nIf istory.<br />\nEconomics.<br />\nMathematics.<br />\nPhysics.'<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Sin lilt.<br />\nMaurice Bloomfield.<br />\nPaul Ifaupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn 111*. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. times.<br /><br />\nUndergraduate Courses (leading to B. A).<br />\n()vow:.<br />\n1. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Blological<br />\n(leadirigumi In medicine).<br />\n(:eological-Blological.<br />\nLatin-Mathematical.<br />\n(;. II istorical-Political<br />\n(leading lip to law).<br />\n7. Modern Languages.<br /><br />\nSerial Publications.<br />\nA merielin Journal of Mathematics(vol XXV).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nA inexican Journal of Philology (vol. XXIII).<br />\nStudies in Historical and Political Science (vol. XXI).<br />\nModern Language Notes(vol. XVIII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. Y).<br />\nTerrestrial Magnetism (vol. VII).<br />\nUniversity Circulars(vol. XXII).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br /><br />\n%tables in lbistorical anb Political %dem.<br />\nMonthly. 8vo. Series XXI in progress. $3 per<br />\nvolume.<br />\n3ohne bophins University eirculare.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XXII in<br />\nprogress. $1 per year.<br /><br />\n11)11.<br /><br />\n3ohne lisophins<br /><br />\nIX.<br /><br />\nContributions to Itssvriologr an<br />\nComparative<br />\nSemitic Pbilologv, (lieitrage zur Assyriologie, etc.)<br />\nVol. IV complete.<br /><br />\nX.<br /><br />\nfISemoirs from tbe Iliologicai laboratorv.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br /><br />\n'hospital 'Bulletin. Monthly. 4to.<br />\nVolume XIV in progress $1 per year.<br />\n11/111. 3ohns lbophins \"'smite''Reports. 4to. Volume XI<br />\nin progress. $5 per volume.<br /><br />\nLibraries.<br />\nUniversity,<br />\n105,000 volumes.<br />\nPeabody Institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br /><br />\nVolume.<br /><br />\nill.<br /><br />\nIL<br /><br />\nInstruction.<br /><br />\nlimerican 3ournal of Mathematics.<br />\nF. M( i It LEY, Editor. Quarterly. 4to.<br />\nXX V in progress. $5 per volume.<br /><br />\nXl.<br /><br />\nMobern language 'Rotes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4t0. Volume<br />\nXVIII in progress. $1.50 per volume.<br />\nX11. 3ournal of Experimcntal•Mcbicine.<br />\nW. If. WELCH, Editor. Hi-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nX111. limerican 3ournal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly.4to. $5 per<br />\nvolume.<br />\nXIV. 'Reports of Marvlanb ecological Starner.<br />\nWILLIAM It. CLARK, Editor.<br />\nterrestrial Magnetism anb litmoopberic 'Elec.<br />\ntricitv. L. A. BAIT ER, Editor. Quarterly. 8vo.<br />\nVolume V11 in progress. $2.50 per volume.<br />\nIDA. Ennual eport.<br />\nPresented by the President, of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nNUM ltnnual'Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br />\nIV.<br /><br />\nIn addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n\"LW.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\n• Testament. Edited by l'rof. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins Hospital. .1. S. Billings, Editor. lie pp. 4to. 56 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fan-simile edition. Edited by J. Rendel Harris. 110 pp. 4to. 30<br />\nplates. $5.00.<br />\nReproduction in Phototype ,of Syriac MSS. with A ntilegomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographiti Hopkinsiensis. Part, I. Philology. Parts<br />\nChemistry, Mineralogy and Geology. Parts<br />\nI V-V-V I. Physics,Astronomy and Mathematics.<br />\n8 vo. :10 cents per part.<br />\nft full list of publications will be sent on application.<br /><br />\nCommunications in respect to exchanges and remittances<br />\nmay be sent to Johns fiopkins Press, Baltimore, Md.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VII.<br /><br />\nAPRIL 23, 1903.<br /><br />\nNo. 13.<br /><br />\nTHE PH. D. OCTOPUS.<br />\nA Reply to Professor James from the Point of View of the Octopus.<br />\nROFESSOR WILLIAM JAMES, in a recent number of the Harvard<br />\nMonthly, has criticized the worship of the public for the degree of Doctor<br />\nof Philosophy. It is, he says, a sort of \"mandarin disease\" hostile to our<br />\ndemocratic idea that it is the man and the man's ability that count. The criticism<br />\nis not new. Montaigue about three centuries ago, though he did not speak<br />\nspecifically of the doctor's degree, made essentially similar restrictions concerning<br />\nthe worship of perfunctory knowledge, while the dangers of any hard and fast<br />\nsystem have been pointed out by almost every philosopher who has wielded a pen<br />\nin behalf of education. Nevertheless the degree has survived, although it has<br />\nseveral times changed its significance.<br />\nOriginally Master, Professor, and Doctor were used interchangeably. It<br />\nwas not until sometime after the degrees in law, divinity, and medicine had<br />\nbecome established as signs of the completion of an adequate training in these<br />\nsubjects, that the conviction arose that it was as foolish and dangerous to leave<br />\nthe training of a teacher, as it was to leave that of a doctor, to the whims and<br />\nvagaries of an irregular education. While the one might prove a menace to his<br />\npatient's health, the other might become a sower of heresy. Consequently the<br />\nterms Master and Doctor were officialized as signs of an adequate training. In<br />\nAmerica to-day we are going through a similar evolution. Only the heresy<br />\nwhich we now fear is of another kind, the heresy of ignorance.<br />\nThe exceptional man will now, as always, be amenable to no system and will<br />\nreach his ends by exceptional ways. So far as he is concerned, Professor James's<br />\nstrictures are rational enough. But such men are rare, and the demand for<br />\nteachers has to-day. increased far beyond the supply of native genius. There<br />\nare about four hundred colleges in America. To expect to find in every one men<br />\nof high native ability is futile.<br />\nHow then shall the average teacher be selected. The college should, says<br />\nProfessor James, apply to his instructors for recommendations. This, so far as<br />\nthe teacher's learning is concerned, is a mere play on words. For the doctor's<br />\ndegree, as it is conferred on the usual graduate student, is for the most part only<br />\nan official recommendation of the adequacy of his knowledge in the subject which<br />\nhe is to teach. And the adequacy of his knowledge is the first of all considerations. Another man, says Professor James, may be more learned. Very true;<br />\nbut the only test by which one may know it is the examination. In Germany,<br />\nwhere this is recognized, the passing of the itaatsexamen is required of every<br />\nwould-be teacher; just as we require state examinations of physicians or lawyers.<br /><br />\n(p<br /><br />\n2<br /><br />\nTI II<br /><br />\nNEWS LETTER.<br /><br />\nIn America, for collegiate teachers, the only such examinations we have are those<br />\nfor the doctor's degree.<br />\nThere is, however, a second requisite for a teacher, high scientific or academic<br />\nideals. And these can in most cases be, for the average man, attained only where<br />\nhe is surrounded by them. As Professor Rowland once said:<br />\n\"He\" (the student) \"goes forth into the world, and the height to which he<br />\nrises has been influenced by the ideals which he has consciously or unconsciously<br />\nimbibed in his university. If the professors under whom he has studied have been<br />\nhigh in their profession, and have themselves had high ideals; if they have considered the advance of their particular subject their highest work in life, and are<br />\nthemselves honored for their intellect throughout the world,—the student is<br />\ndrawn toward that which is highest, and ever after in life has high ideals.\"<br />\nThis association with high ideals can, in the sphere of academic knowledge,<br />\nbe attained only within the walls of our large universities. The first requirements<br />\nthen for a teacher are that he shall spend some time in such circles and that he<br />\nshall be examined officially as to his knowledge. And this is just what a candidate<br />\nfor the doctor's degree does. And the fact that he has done this is all that is'meant<br />\nby the conferring of the degree. For the thesis is only another form of testing<br />\nhis knowledge and intellectual power. If then the candidate has complied with<br />\nthese conditions, the distinction, so far as the spirit and substance of his learning<br />\nis concerned, between recommendation by the word of his instructors and recommendation by an official degree is meaningless.<br />\nProfessor James, however, makes the point that the man should be a good<br />\nteacher. Apropos of which we may quote further from Professor Rowland:<br />\n\"But if the student is taught by what are sometimes called good teachers, and<br />\nteachers only, who know little more than the student, and who are often surpassed<br />\nand even despised by him, no one can doubt the lowered tone of his mind.\"<br />\nThis may be a little strong ; but it emphasizes the subordinate importance of<br />\nability to teach in and by itself. It must be admitted that. Professor James is<br />\npartially right on the point ; but the enduring • part of his argument, after the<br />\ncloak of anecdote and wit is stripped off, is simply this, that a teacher should<br />\nknow how to teach, a conclusion which seems scarcely new enough to be worthy<br />\nof so long and able a defense.<br />\nProfessor James, however, holds up to us several horrible examples, such as<br />\nthe colleges which advertise the degrees of their.faculty. as the \"brazen mercantile<br />\nfashion\" advertises soap or historical novels,, the colleges that advertise \"No<br />\nteachers here who are not doctors,- and the men who have taken degrees in one<br />\nsubject and then, on the strength of the degrees, taught something else. There<br />\nis only one reply to such arguments. As a rule these things do not exist; and<br />\nthe trotting them forth as flagrant examples of corruption is a sin as flagrant, in<br />\nits own way, as the sins these examples are to illustrate. It is a sin against the<br />\nancient principle of logic which forbids generalizing from exceptions, however<br />\nentertaining it may be.<br />\nProfessor James furthermore laments the damage done to the doctor's<br />\ndegree by making it a commercial necessity, instead of a free recognition of<br /><br />\nTHE NEWS LETTER. .<br /><br />\n3<br /><br />\nscholarly effort. Apart from the fact that the doctor's degree was to this extent<br />\na \"commercial necessity\" five hundred years ago, and that one could in consequence scarcely be said to make it such to-day, the fact that it is a commercial<br />\nnecessity is not one to occasion grief. We have the Ll. D. for ornament and honor,<br />\nand it is sufficient for the purpose. If then the Ph. D. be used as the sign of the<br />\ncompletion of a patient and self-sacrificing novitiate in knowledge, and as such<br />\nbe used as a recommendation, it is difficult to see exactly how this damages it.<br />\nThere is no doubt that the Ph. D. is in imminent danger at the hands of<br />\ninferior colleges, and the day may be at hand when it will mean nothing without<br />\nthe attachment of the name of the university which gives it, or perhaps the sanction of the new league of American universities. This will be necessary as a sort<br />\nof monetary valuation of the \"commercial necessity.\" The system must adapt<br />\nitself to these conditions. But its destruction would to-day mean academic<br />\nanarchy, and so we may leave the subject in amiably characterizing Professor<br />\nJames's article as a piece of academic anarchy<br />\nALUMNI NOTES.<br />\nAmong the alumni who spent the Easter holidays in Baltimore were: '97,<br />\nDr. Charles E. Lyon, of Princeton; '98, Rev. Alfred Dieffenbach, of Pittsburg;<br />\n'99, Robt. Harold Grimes, attorney for the Lawyers' Surety Co. of New York;<br />\n'00, Roger B. T. Anderson, who will be ordained at the General Theological<br />\nSeminary, New York, next month; John P. Hill, and John W. Griffin, of Harvard<br />\nLaw School; Jared Sparks Moore, graduate student of Harvard; '01, Horace<br />\nGillespie, who is now in the chemical works at Camden; Abner Saylor, of Harvard<br />\nLaw School; J. Gresham Machen, of Princeton Theological Seminary; Wm.<br />\nJames, University of Virginia Law School; '02, Sidney Smith and Aubrey Pearre,<br />\nof Harvard Law School, Professor E. A. Smith, Ph. D., 1900, of Allegheny<br />\nCollege.<br />\nDr. W. H. Maddren, Medical School,'01, will be married on May 4th, to Miss<br />\nHelen Louise Howard, of Brooklyn.<br />\nAndrew Reed Bird, '01, is now at Luxor, Egypt.<br />\nDr. John Huston Finley, who received his Ph. D. at the University in 1889,<br />\nhas been selected president of the College of the City of New York. Dr. Finley<br />\nwas made president of Knox College in 1892, and occupied that office for seven<br />\nyears. He then accepted an editorial position with Harper's Weekly, and later<br />\nwith McClure's Magazine. After leaving McClure's he held the chair of politics<br />\nat Princeton. Beside his work for Harper's and McClure's Dr. Finley was founder<br />\nand editor of the State Charities Record and The Charities Review.<br />\nDr. Wm. F. Smith, who received his degree of A. B. at the University in<br />\n1886, died in this city on April 14. He came to this city from Virginia, and took<br />\na three year scholarship at the University. While at the University Dr. Smith<br />\ntook a prominent part in athletics, and graduated honor man of his class. He<br />\nheld the chair of anatomy at the City Hospital, and was for a long time resident<br />\nphysician there.<br /><br />\nTHE NEWS LETTER.<br /><br />\n111 1111110111111111 111111111111111111191111<br /><br />\n111111 1111 111<br /><br />\n1111111111111111119111111i11111 1 111 1110 11111 1 1 111111111111111110<br /><br />\ndny<br /><br />\nObi pri.<br /><br />\ntriparl<br /><br />\nMg 111% Ia\".1111,<br /><br />\n•al•<br /><br />\nuIhI1IIII1VhIIlIlIlIIIIIIIIIlIIPLIlN 011111111111111111111111111111111111111111111111111111411111111011111111ININ1111111<br /><br />\nMessrs. Douglas L. Buffinn, lie L. Easter, and Chas. E. Matthews, of the<br />\nRomance department, and Eben R. Haley, of the English department, are a party<br />\nof University students who will leave New York on May 6 for the continent. They<br />\nwill sail on the Neckar of the North German Lloyd Line, lancing at Bremen,<br />\nat which place they will scatter. Messrs. Buffinn and Easter will spend the summer in Paris. Mr. Haley will travel through Germany and Italy, and later enter<br />\nthe University of Grenoble, where he will spend the summer, after which he will<br />\nenter the Romance department of the Hopkins. Mr. Matthews intends to spend<br />\nthe summer in Germany, chiefly in the Hartz Mountains, and then enter the Sorbonne to pursue his studies in Romance language for a year.<br />\nDr. B. R. Schenck has tendered his resignation to the trustees of the Johns<br />\nHopkins Hospital. He intends to practice in Detroit, Michigan. He was graduated in 1898, at the Hopkins Medical School. Dr. John A. Sampson, a graduate<br />\nof the class of 1899 will succeed him.<br />\nOn Wednesday Dr. Remsen delivered an address before the Conference for<br />\nEducation in the South which is now in session at Richmond.<br />\nProfessor Chas. R Neill, Ph. D, '97, who is now at the Catholic University<br />\nof America, and who was assistant recorder of the Coal Strike Commission, was<br />\npresent at the regular meeting of the Economic seminary on April 'A.<br />\nAt the annual convention of the American Oriental Society, which was held<br />\nin McCoy Hall the last three days of Easter week, Dr. Gilman was re-elected<br />\npresident, and Dr. Paul Haupt and Dr. Maurice Bloomfield were re-elected members of the Board of Directors. Scholars from all parts of the country were present, among whom were: Professor Jastrow, Ph. D., 1886, the Hebraist of the<br />\nUniversity of Pennsylvania, and Professor Lanham, Fellow, 1876, now Professor<br />\nof Sanscrit at Harvard. Papers were read by the following University men:<br />\nProfessor Haupt, Professor Bloomfield, Professor Johnston, Dr. Foote, Dr. Blake,<br />\nRev. Dr. Rosenau, Rev. Mr. McPherson, Rev. Mr. Oussani, Mr. Barrett, Mr. Ember, and Mr. Siple.<br />\nAt the annual meeting of the American Philosophical Society, held in Philadelphia, lately, ex-President Daniel C. Gilman delivered an address. Dr. William H. Welch, who was on the program for an address, was kept at home by sickness. The convention was of special interest to this University, because of the<br />\nelection to membership in the society of three Hopkins professors: Dr. Basil L.<br /><br />\nTHE NEWS LETTER.<br /><br />\n5<br /><br />\nGildersleeve, Dr. William H. Howell, and Dr. Harmon N. Morse. Among the<br />\nHopkins men at the convention were: Professors Haupt, Clark, Elliot and<br />\nBrooks. Mr. C. E. Brooks, of the Hopkins mathematical department, read a<br />\npaper before the society.<br />\n• Dr. Joseph S. Ames has made arrangements for the visit and lectures of Prof.<br />\nJ. J. Thompson, the great English physicist. Prof. Thompson will reach Baltimore early in June, and will deliver six or seven lectures just before the commencement on June 9. He will discuss his theory about the nature of arc and spark<br />\ndischarges.<br />\nDr. Duncan S. Johnson, professor of botany, and Mr. Olin Forest Shreve, a<br />\nstudent of the zoological and botanical department, have gone to Jamaica to do<br />\nspecial work of a botanical character. Upon arrival at jamica, they will join Mr.<br />\nW. R. M ason of the cryptogamic department, and Dr. I,. M .Underwood,'professor<br />\nof botany in Columbia University. It is expected that they will be absent about<br />\nsix weeks.<br />\nProf. E. W. Armstrong, of the Romance department, read a paper on<br />\nnicipal Art in Paris\" to the audience that had gathered in McCoy Hall, April 10,<br />\nto hear Mr. William A. Coffin, the art critic of New York, who was to speak on<br />\n\"Various Aspects of Municipal Art.\" Mr. Coffin was obliged to return to New<br />\nYork on account of sickness. Dr. Armstrong described the magnificent buildings<br />\nand the method of their erection in the capital city. The question of public places<br />\nfor the working classes was also discussed.<br />\nThe Freidenwald Co., of this city, have recently published \"Jewish Ceremonial<br />\nInstitutions and Customs,\" by Dr. Wm. Rosenau. The lectures on which the<br />\nmatter contained in the work is based were delivered before the Oriental Seminary of the University during the winter of 1901. Dr. Rosenau has dedicated his<br />\nwork to Mr. Henry Sonneborn, the founder of the Sonneborn collection of Jewish<br />\nCeremonial Objects.<br />\n- Dr. A. Marshall Elliott, director of Romance studies, gave on April 6, the first<br />\nof a series of weekly lectures on the Portugese language and literature.<br />\nA public meeting in the interest of the prevention of tuberculosis in Baltimore<br />\nwill be held Friday evening, April 24, at 8.30 o'clock, in McCoy Hall.<br />\nDr. William Osler and Dr. Henry Barton Jacobs constitute the committee of<br />\narrangements for the meeting.<br />\nThe March number of the \"Inland Printer,\" a magazine devoted to the interests of the printers' trade, contains a long editorial on the investigation into the<br />\nlabor conditions that is being carried on by the Economic department of the University. The article highly commends the work of the University and predicts<br />\nvaluable discoveries as a result of the department's work.<br />\nOn Tuesday afternoon, April 15, Prof. Jam R. S. Sterrett, of Cornell University, one of the leading archaeological explorers of this country, delivered an<br />\ninteresting lecture on \"The Troglodytes of Cappadocia, or Cave Dwellers of Asia<br />\nMinor,\" in McCoy Hall. The lecture was illustrated with views of the excavations he himself had taken while he was in those regions.<br /><br />\nTHE NEWS LETTER.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br /><br />\nAPRIL 23, 1903.<br />\nSubscription $1.50 per year.<br /><br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n.<br /><br />\n10 Cents a single copy.<br /><br />\nGEORGE A. FOSTER, 1904.<br />\n. REGINALD S. OPIE, 1904.<br />\nH. V. MORSE, 1905.<br /><br />\nAssistant News Editors,<br /><br />\n5<br /><br />\nAthletic Editors,<br /><br />\ni J. NEWMAN NUMSEN, 1904.<br /><br />\nBusiness Manager,<br />\nA Raistant Business Manager,<br /><br />\nHARRY BAETJER, 1903.<br />\nRIGGIN BUCKLER, 1904.<br /><br />\nAddress all articles, communications, etc., to HARRY K. TOOTLE, box 637, Johns Hopkins Vniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BARTJER,<br />\nJ. H. U.; or box 398, Medical Department of the Johns Hopkins University.<br /><br />\nONSIDERING the adverse circumstances under which the lacrosse team<br />\nbegan the season the outlook is most encouraging. Saturday's overwhelming victory over Stevens, who came here with a record of four goals against<br />\nthe Crescents, has caused the rooters to feel most sanguine, and to predict that the<br />\ngame on the 25th with Lehigh will be a repetition of last year's victory. However, we must not be too hopeful, since Lehigh has been putting up a strong<br />\ngame, and may prove no easy proposition. On the following Saturday, May 2,<br />\nthe only out of town game will be played, that with Swarthmore. Last year<br />\nSwarthmore fell a victim to our superiorplaying, but this year the result is uncertain. Swarthmore will have the advantage of playing on her own grounds, and<br />\nwill strain every nerve to repeat her performance of two years ago. In order that<br />\nthe varsity may have every encouragement the management is especially desirous<br />\nof having a large crowd of rooters accompany the team. The attendance at the<br />\nhome games has been large and enthusiastic and there is every reason why a large<br />\nparty of Hopkins men should be at Swarthmore to cheer the team on to victory.<br />\nTo play on strange grounds is always trying to a team, so with a crowd of students<br />\nthere to make the \"Hullabaloos\" ring loud and clear our men will feel more at<br /><br />\nC<br /><br />\nTHE NEWS LETTER.<br /><br />\n6<br /><br />\n7<br /><br />\nhome. From the present outlook there seems to be no doubt but that this game<br />\nwill decide whether or not we will again be \"Champions of the United States.\"<br />\nLast year we defeated Swarthmore, we want to defeat her again this year. It is<br />\nvery desirable that every student who is able should show his loyalty to the University, and his appreciation of the team's work by going to Swarthmore. Manager<br />\nAddison announces that reduced rates have been secured, and that a special car<br />\nwill be provided for the team and rooters, provided that a sufficient number of<br />\nthe latter go along.<br /><br />\nN article by Professor James in The Horvard Monthly has been quoted<br />\nrather freely by the daily press. He considers that the Ph. D. degree has<br />\nbeen degraded to the standard of a teacher's advertisement. As Hopkins<br />\nhas always stood forth as the leading upholder of this degree we have thought<br />\nit advisable to introduce as the leader of this issue a criticism of Professor<br />\nJames's views on the subject. We believe that the criticism as presented will<br />\nshare the approval of most Hopkins men. Any institution of value can only be<br />\nbenefited by the fire of its critics, and for this reason Professor James's article<br />\nis valuable. It has brought out the weakest points of the system and possibly<br />\nsuggested modifications, but it will not, we believe, serve to weaken the strong<br />\nhold which the better qualities of the system have given it upon the convictions of<br />\nAmerican educators.<br /><br />\n4<br /><br />\n(V ITH the last issue the representatives of the Senior class ceased their<br />\nconnection with THE Nms-LETTER, and the control of the paper<br />\npassed to the Junior and Freshman classes. M essrs. Tootle and Bird<br />\nare to be congratulated on their work as editors, for to them is largely due the<br />\nadvanced progress which the paper has made during the past year. As editor-inchief Mr. Tootle has given his time and attention to making THE Nitws-LWrTER<br />\nwhat it should be—a representative undergraduate publication. His work has<br />\nbeen characterized by the same thoroughness that has made him a leader in the<br />\nother departments . of University life — class, athletics, and debating. In the<br />\nvarious lines of literary work Mr. Tootle has shown ability of a high order, and<br />\npromise of a bright future. Mr. Bird has been on T tip: NEws-LEPTP,R since his<br />\nFreshman year, and has always taken an active interest in its welfare. His skill<br />\nas an athlete made him particularly well fitted for the position of athletic editor,<br />\nand his articles have been marked by technical insight and impartiality.<br />\nAs is natural on such occasions the new board feels a hesitation on assuming<br />\ncontrol, and this time especially so because the editorial staff is not complete.<br />\nThis is a misfortune that has existed since the beginning of the present academic<br />\nyear, and one that is not creditable to the lower classmen. THE NEWS-LETTER<br />\nis the student's publication and deserves their support, not only financial, but also<br />\nliterary. The editors have a broad field to cover, and in order to cover it well,<br />\nneed the sympathetic help of the students.<br />\n•<br /><br />\n8<br /><br />\nTHE NEWS LETTER.<br /><br />\nN view of the recent publications in the daily press regarding the failure of the<br />\nUniversity of Pennsylvania lacrosse team to fulfill its date with Hopkins<br />\non April 4th, it seems well to the editors that the position of the University<br />\nin regard to the matter be plainly stated.<br />\nThe facts are doubtless known to all: The date was made in good faith<br />\nby the Hopkins management, duly advertised, and in spite of very threatening<br />\nweather early in the day several hundred people assembled to witness the opening<br />\ngame of the season. Their interest was rewarded by the statement, made at the<br />\ngrounds on the authority of a telegram received at one o'clock that Pennsylvania<br />\nwould not be down on account of rain in Philadelphia. The coaches hastily<br />\nassembled an \"All Baltimore\" team to play against the varsity, and pulled off a<br />\nvery creditable game considering the adverse circumstances.<br />\nBy just what mental process the management at Philadelphia reached their<br />\nconclusion has not yet been fully made clear. The contract included an ample<br />\nguarantee in case of rain, they were aware of the fact that the game had been<br />\nadvertised and also, probably, of the fact that Lacrosse may be played in the<br />\nrain. The only explanation forthcoming as to their somewhat peculiar method<br />\nof keeping dates was contained in the original message. Up to this time no<br />\napology, explanation, or offer to meet the actual financial loss to the Hopkins<br />\nmanagement, has been received.<br />\nSo much for the facts. Now as to the University's position in the matter.<br />\nThe Athlete Association feels that the reason advanced—Rain in Philadelphia—is<br />\nnot sufficient to justify the cancelling of a financial contract involving loss to the<br />\nother party. It feels that the Pennsylvania team showed lack of sportsmanlike<br />\ncourtesy in withdrawing at the eleventh hour on the ground named. And lastly<br />\nit feels that some apology is due to it for this rather unusual treatment, or at<br />\nleast an offer to share the loss incurred in the matter.<br />\nThe last letter received from the Pensylvania management, complaining<br />\nof the tone of the comments of the daily papers on the incident, hardly deserves<br />\nnotice in these columns. It is enough to say that neither the team, management<br />\nnor coaches are responsible for all statements appearing in the daily papers.<br /><br />\nj<br /><br />\nUNDERGRADUATE NOTES.<br />\nRalph 0. Fuerbringer, '04, has returned to the University after an absence of<br />\nalmost a month on account of sickness.<br />\nReginold S. Opie, '04, is now Hopkins' correspondent of The Intercollegiate<br />\nNews.<br />\nRobert S. Lanier, '03, spent the Easter vacation at Greenich, Conn., with his<br />\nbrother, Chas. D. Lanier, '88, who is now assistant editor of the Review of Reviews.<br />\nWhile away Mr. Lanier secured some very artistic drawings for the Hullabaloo.<br /><br />\nTHE NEWS LETTER.<br /><br />\n9<br /><br />\nThe Musical clubs will give a concert for the benefit of the Lawrence House<br />\nin McCoy Hall on the night of May 9.<br />\nG. P. Putman's Sons, of New York, have just published \"The American Republic and Its Government,\" and \"Political Parties and Party Problems,\" both by<br />\nDr. James A. Woodburn, Ph. D., 1890, who is now Professor of American History and Politics, at Indiana University.<br /><br />\nPROGRESS OF THE INTERCOLLEGIATE DEBATE.<br />\nORK on the intercollegiate debate has been progressing rapidly since<br />\nthe Easter holidays. Dr. Lee has selected Messrs. Plaggemeyer, Blum,<br />\nand Strayer to train with a view to representing Hopkins at the University of North Carolina on May 2. There will be two speakers, and, whether<br />\nor not the third man will be taken along as an alternate, depends largely upon<br />\nthe financial support offered by the student body. A committee has been appointed<br />\nto solicit contributions from the students and faculty.<br />\nAlthough there remain only a few more days for training, yet during that time<br />\nit is expected that all men interested in the work will exert themselves to help the<br />\nteam. The men are training every (lay and anyone who can furnish an argument<br />\nfor or against ship subsidies will be cordially welcomed by the team. If we are<br />\nto turn out a winning team, the whole undergraduate body must co-operate with<br />\nthe men who are to represent the University.<br />\nThose who are most interested in debating at Hopkins hope that we will be<br />\nvictorious in our contest with North Carolina this year, for then it will seem certain<br />\nthat we can turn out debaters strong enough to contest with the best teams in the<br />\ncountry. Next year it is ,expected that we can arrange for debates with one or<br />\ntwo of the large, northern universities in addition to the debate already scheduled<br />\nwith Carolina.<br /><br />\n14<br /><br />\nY. M. C. A. NOTES.<br />\nThe Annual Members' Reception was held on Saturday evening, the 18th, in<br />\nLevering Hall, in honor of the members of the Young Women's Christian Association of the Woman's College. A very enjoyable evening was spent with a large<br />\ncompany of the young ladies. No special program was arranged, except a talk<br />\nby Miss Robbins, of Lawrence House. Miss Robbins gave a very interesting description and discussion of the work done there, and 'every one was interested to<br />\nlearn of the success which has attended her first year of labor in that field. Mr.<br />\nC. K. Edmonds, as one of our Lawrence House directors, added a few words and<br />\nalso spoke of the summer conferences at Northfield and Silver Bay. Light<br />\nrefreshments were served.<br /><br />\nTHE NEWS LETTER.<br />\nDr. E. A. Hume, of Johns Hopkins Hospital, spoke at our Tuesday afternoon<br />\nmeeting on the 21st about Medical Work in India. Dr. Hume is preparing to<br />\ntake up this work in the near future.<br />\nOn May 5th the 5 o'clock meeting will be devoted to a discussion of interests<br />\nat the Northfield Conference and Camp. An interesting program will be prepared<br />\nand all men are invited to attend and catch a little of the enthusiasm of the men<br />\nwho have previously availed themselves of this opportunity. Features will be<br />\nannounced later.<br />\nJohn A. Addison leads Morning Prayers this week, and A. G. Murray next,<br />\nat 8.45.<br />\nA number of new and interesting books have recently been added to the Missionary Library and also a few on Christian Evidence which men are invited to<br />\nread..<br />\nTHE OWL AND THE BUG.<br />\nOnce said the microscopic bug to the idiopathic owl,<br />\nI can make you lord of the land and sea,<br />\nAnd king of the wheezy fowl—<br />\nThus spoke the subtle microbe to the over-easy owl.<br />\nThe idiopathic owl pooh-poohed the words of the ramping germ,<br />\n\"Do you think that I'm a frisky fool,<br />\nAn ass before my term ?\"<br />\nBut idiosyncric ideas through his head began to squirm.<br />\nThe 'cillus winked his nether eye, the owl he picked his teeth.<br />\n\"What are the terms,\" at last he said,<br />\n\"That you me this bequeath ?\"—<br />\n\"If I may travel through you, sir, you may win this wreath.\"<br />\nThe silly bird at once agreed, the raspy bug flew in,<br />\nHe took a chaw from here and there<br />\nAnd raised a joyous din,—<br />\nNext day died that foolisii owl, lamenting of his sin.<br />\nAnd now my story's done, you ask what is the moral here?<br />\nWhy should I talk of bugs and owls<br />\nAnd not of queens and beer?—<br />\nThe moral is, I hate to say, the poet's head is queer.<br />\nThe Maid—What makes you chew your moustache so, Reggie? Are you<br />\nfond of discouragement?<br />\nThe Thing—Discouragement—aw ?<br />\nThe Maid—Yes; feeling down in the mouth, you know.—Lampoon.<br /><br />\nTHE NEWS LETTER.<br /><br />\n11<br /><br />\nLACROSSE.<br />\nHopkins 8 -Hobart 1.<br />\nN a drizzling rain the Johns Hopkins lacrosse team opened the season on April<br />\n11, at Electric 1Park, by defeating the Hobart College team by 8 to 1. In<br />\nspite of the weather a number of enthusiasts were present to cheer the University team to victory.<br />\nConsidering the fact that this was the first game of the season, the team did<br />\nexcellent work. The slippery condition of the grounds caused many of our boys<br />\nto fall. This was not the case with Hobart, as they used rubber spikes, by the aid<br />\nof which the visitors easily outran the locals. In all the other points of the game<br />\nHopkins clearly outclassed her rival. Hopkins took the lead in the beginning. Matthai got the ball and passed it down the line to Rosenheim, who threw the first goal<br />\nin less than two minutes from the time the whistle blew. Not once in the entire<br />\ngame were our boys in danger of being headed off. It was only in the last five<br />\nminutes of the second half that Hobart scored her single point. Putts, Foster and<br />\nBird and Blanck did especially fine work. For new men Matthai, Dill and P.<br />\nStrauss showed up very well; but Dill lacks some of the points of the game which<br />\ncan only be acquired by experience. The line up was as follows:<br />\n- Hopkins—P. Straus, g. ; Schmeisser, p.; Blanck, c. p. ; H. Straus (captain),<br />\n1st d. ; Custis, 2d d. ; Tough, 3d d. ; Matthai, c. ; Bird, 3d a.; Foster, 2d a. ; Dill,<br />\n1st a. ; Rosenheim, o. h.; Putts, i. h.<br />\nHobart—Ellis, g.; Whitney, p. ; Atwater, c. p. ; Schuman, 1st d. ; McHenry,<br />\n2d d. ; Hollands, 3d. d.; Maddagan, c. ; Baugher, 3d a.; Giltrap, 2d a. ; Doup<br />\n(captain), 1st a.; Espy, 0. h. ; Frierson, i. h.<br /><br />\n3<br /><br />\nHopkins 13—Stevens 1.<br />\nN the first inter-collegiate lacrosse game, the Johns Hopkins team defeated the<br />\nstrong aggregation from Stevens Institute, on April 18, by 13 to 1. The reputation of the visitors and the expectation of a fast game brought out a large<br />\ncrowd to witness the contest.<br />\nIn spite of the crushing defeat which Hopkins administered her rival, the<br />\ngame was by no means devoid of interest, and the Northeners certainly played a<br />\nstronger game than Hobart did last week.<br /><br />\n3<br /><br />\n1.2<br /><br />\nTHE NEWS LETTER.<br /><br />\nMuch anxiety was felt as to the outcome in the early part of the game. Bennitt, of Stevens, got the ball at the start, and passed it rapidly up toward Hopkins'<br />\ngoal. For some time a fierce struggle was waged near the net, but the danger was<br />\nremoved when Captain Strauss threw the ball down the field. Several attempts<br />\nat goal were made by our boys, but all were unsuccessful until Bird passed the ball<br />\nto Putts, who threw the first goal, after two minutes and forty-five seconds of the<br />\ngame had been played. Forty seconds later Rosenheim threw the second goal.<br />\nDuring the next ten minutes, the ball sped from side to side. Johnson and<br />\nBillings made several attempts at goal for Stevens, as did Putts for Hopkins, but<br />\nthe good work of the goal keepers prevented scoring. After the third goal was<br />\nmade, three others followed in rapid succession.<br />\nIn the second half the superior endurance of the local boys was clearly seen.<br />\nThe visitors played fast and furious for a while, but were unable to keep it up.<br />\nSeveral times time was called owing to a man being laid up temporarily. After<br />\nten minutes of such playing, the Stevens men weakened considerably, and the<br />\n'Varsity had it easy from then on.<br />\nThe only scoring by the visitors was during- that ten minutes of fast playing.<br />\nThe ball went slowly from Stevens' goal toward Hopkins'. Roeser passed the<br />\nball to Johnson, who threw safely past P. Strauss.<br />\nFor the past two years Stevens has been excluded from the league on account<br />\nof alleged roughness, but it must be said to their credit that they put up a clean<br />\nbut fast game. They came with the intention and expectation of winning, but<br />\nthey did not let their desire cause them to use any undue roughness in attaining<br />\ntheir aim. That they did not win was because they were outclassed by Hopkins.<br />\nSome of the 'Varsity boys distinguished themselves on the field, hut the victory was due to the good work of the team as a whole. The old men, of course,<br />\ncould be relied upon to do their share of work, but some misgivings were felt as<br />\nto the ability of the new ones to put up such an article as is demanded if we are<br />\nto win the championship again this year. It must be said that the new men<br />\naccredited themselves with glory. Keep it up, boys, and old Johns Hopkins will<br />\nadd another championship banner to her already long list.<br /><br />\nTRACK TEAM.<br />\nSIDE from the Pennsylvania Relay Races, a fresh impetus has been giveil<br />\nto track and field work by the final success of the plans for a dual meet<br />\nbetween Johns Hopkins and the University of Virginia. After a long<br />\nperiod of doubt and uncertainty, but of fond hopes and expectations, definite<br />\narrangements have at last been made by which the track and field team of the<br />\nUniversity of Virginia will travel to Baltimore to •compete with the Hopkins<br />\nteam on Thursday, May 7th, either at Electric Park or at the Maryland Oval.<br />\nAs several weeks of correspondence between the managers of the respective<br />\nteams had been productive of no satisfactory results, on one fine day last week<br /><br />\nTHE NEWS LETTER.<br /><br />\n13<br /><br />\n\"Mack\" took it into his head to journey down to Charlottesville, and returned<br />\nlater with the glad news that a two years agreement had been made, by which<br />\ngames are to be held here this year and at Charlottesville next year. The chief<br />\ncause of delay in making arrangements was that all dates desired by Hopkins conflicted with Virginia's baseball schedule, which had to be considered, as several<br />\nof the track men also play on the ball team. There is little doubt that the selection of suitable dates for future meets will be an easy matter.<br />\nIt is expected that this dual meet will sound the keynote for a great athletic<br />\nmovement through the South, which will be felt by many of its leading institutions.<br />\nThe programme will consist of 11 events, in each of which there will probably<br />\nbe only two or three contestants from each institution to start, although the number of entries will be unlimited. Only firsts and seconds will count in the scorings.<br />\nThe events are as follows: 100 yard dash. 220 yard dash. 440 yard run. 880<br />\nyard run. 1 mile run. 120 yard high hurdle. 220 yard low hurdle. Running<br />\nhigh jump. 16 pound shot put. Pole vault. Running broad jump.<br />\nIt is said that Virginia has 40 men trying for the meet, from which number<br />\nonly about 15 will be selected. Hopkins has about 20 men who are making special<br />\npreparations.<br />\nAs to the outcome of the games, it is at the present time a little too early to<br />\nprophesy with any degree of accuracy, but there is but little doubt that our men<br />\nwill conduct themselves in a manner fully calculated to reflect credit both upon<br />\nthemselves and their Alma Mater. As this meet marks the beginning of a new<br />\nventure, it is not too much to expect everyone to come and shout, in order to<br />\nassure the success of all such future games.<br /><br />\nINCE the Hopkins Armory games of a few weeks ago, when the tide of<br />\nathletic interest ran so high, there has been a sort of lull in track and field<br />\nwork, until some few days ago when the better seasoned men were again<br />\nput to hard training. This has since continued daily both in the cage and at<br />\nElectric Park, when the weather permitted. At present all is in preparation for<br />\nthe University of Pennsylvania Relay Races to be held on Saturday, April 25th, at<br />\nFranklin Field, Philadelphia. Unusual interest attaches to these races in that<br />\nPennsylvania has organized a special class in which Hopkins will compete for<br />\nthe \"Middle States Championship\" against such veterans as Bucknell, Pennsylvania State College, Lehigh, Westminster, University of Virginia; and Dickinson.<br />\nIn entering this class, our men fully realize that increased efforts will be expected<br />\nof them, but a victory, so much harder to gain, will be correspondingly more<br />\nvaluable. While they do not feel an abiding confidence in winning against such<br />\nformidable opponents, yet they are in no way displeased at the increased responsibilities of their advancement which has been so justly earned. From comparative records made in the last few years, although such records are valuable only<br />\nwith certain limitations, Bucknell and Penn State will probably be our most<br />\ndangerous opponents, but every candidate is possessed with a firm determination<br />\nto put forth the best that is within him, in order to make the most creditable<br /><br />\np<br /><br />\n1<br /><br />\n14<br /><br />\nTHE NEWS LETTER.<br /><br />\nshowing possible. It is a case of winning a hard fought battle, or of dying in a<br />\ngood cause.<br />\nThe team has not been definitely picked at this time, but will certainly consist<br />\nof Joe England and Capt. Hoffman, the other two to be chosen from Freeze,<br />\nPassagno, Tootle, LeCron, and Stone, any one of whom may be fully expected<br />\nto do his duty at the proper time. As it is impossible for most of us to see these<br />\ngames, it is not too much to expect that all will be on hand with an extra amount<br />\nof enthusiasm for the meet with the University of Virginia.<br /><br />\nBASE BALL TEAM DISBANDS.<br /><br />\nFTER a brief existence of a few weeks, it has been ultimately decided to<br />\ndisband the baseball team. This decision was reathed only after a serious<br />\nconsideration of the circumstances that seemed to render such action necessary. Certain causes which had been operating since the beginning of the season, at last became of such a nature that disorganization seemed the most advisable<br />\ncourse to pursue. To this end all games scheduled have been cancelled. The<br />\ncauses referred to will probably occur to everyone at all familiar with the baseball<br />\nsituation. From the first the team has been surfeited with disappointments. Practice began encouragingly with a promising bunch of candidates, but this number<br />\nwas soon to be decreased by unforseen circumstances. Two men had attacks of<br />\nsickness that would have prevented them from playing again this season. Another man was compelled to withdraw on account of outside work, several others<br />\non account of studies, while three more were seriously handicapped by the pressure<br />\nbrought to bear upon them in other lines of athletics. Despite these drawbacks, a full team and several substitutes were left, but increasing studies of the<br />\nmedical men who form a majority of the team, rendered practice very inconvenient,<br />\nalthough it called for only one hour on two afternoons a week, which were<br />\nthe only times any number of the men'could be got together. In this limited<br />\ntime, results could not be assured that would justify the inconveniences suffered<br />\nin sparing the time for practice. The enthusiasm of the players was valueless<br />\nwhen unaccompanied by opportunity to practice. Furthermore, the lack of favorable interest, as well as the unabated discouragement of the Athletic Board<br />\nwas not calculated to add to the success of a team. There seems to be a prevailing prejudice against a Hopkins baseball team that cannot well be overcome<br />\nunder existing conditions. What the future of baseball at the Hopkins may be,<br />\nit is impossible at this time to say, but very certain it is that until suitable and<br />\nconvenient grounds can be procured for practice and playing, a movement to establish baseball again will labor under great difficulties.<br /><br />\ni4I<br /><br />\nTHE NEWS I,ETTER.<br />\nA THEATRE PARTY.<br /><br />\nThere were sixty tired Freshmen<br />\nWhen the Spring exams. were done,<br />\nPale from midnight toil and study,<br />\nTired of work was everyone;<br />\nSo they gathered in the basement<br />\nWhere a council was begun.<br />\n\"Lets go see the Little Princess,\"<br />\nOne proposed, the worst of all,<br />\n\"Let us view her elevation<br />\nAnd the wicked Minchin's fall;<br />\nOthers thought this 'most too wicked,<br />\nBut they followed after all.<br />\nThen they followed into the foyer<br />\nGazing around with childish eves<br />\nEyes of anxious expectation,<br />\nEyes of wonder and surprise,<br />\nEach one clasping fast an iron bank<br />\nWhere his cherished treasure lies.<br />\nThen they trooped up to the window<br />\nWhere the ticket man dispensed.<br />\nLittle slips of colored cardboard<br />\nFor the sum of fifty cents;<br />\nThere they asked for sixty tickets<br />\nAnd a smashing sound commenced.<br />\nAs,of banks that bursting open<br />\nFar and wide their contents pour,<br />\nAs of pennies rolling freely<br />\nFlying faster, more and more,<br />\nWhile the Freshmen scramble wildly<br />\nWith their sayings, on the floor.<br />\nWhen the others all had entered<br />\nTo the wondrous sights inside,<br />\nOne was found with but a nickel<br />\nAnd sat down and wildly cried,<br />\nStill some one (a generous senior)<br />\nChecked at last the briny tide.<br /><br />\n15<br /><br />\nTHE NEWS LETTER.<br />\nThere was sorrow 'mid the Freshmen,<br />\nSome were even moved to tears,<br />\nAt the sufferings of Sarah,<br />\nPitying her tender years<br />\nThey rejoiced a little later<br />\nAt the end of all their fears.<br />\nWhen they all came forth together<br />\nThey were captured by a throng<br />\nMade of nurses and policemen<br />\nAnd with execrations strong<br />\nOut of that forbidden building<br />\nThey were pushed and dragged along.<br /><br />\nThe sidewalk was not wide enough for two; moreover the street was dirty.<br />\n\"Brush by, coon,\" growled the ghost of the great John L.<br />\nThe shade of Darius of Persia waxed indignant. \"Have you no respect,\" he<br />\ndemanded, \"for my divine right?\"<br />\n\"How about my terrible left ?\" snapped the other. He swung to the jaw, and<br />\nwalked on.—Yalc Record.<br />\nDora—Did Jack say anything dove-like about me?<br />\nAlice—Yes, he said you were pigeon-toed.—Tiger.<br />\nPoliteness is the salt of life; you hate to have it rubbed into you when you are<br />\ncut up.—Tiger.<br />\nUpon a keg of dynamite,<br />\nLittle Georgia sought repose.<br />\nAnd slyly lit a cigarette.<br />\n\"My Little Georgia Rose.\"<br />\n—Widow.<br />\nTraveler (to hotel clerk): I want a room and a bath, please.<br />\nHotel Clerk: Well, I can give you a room, but I haven't time to give you<br />\nthe bath just now.—Ex.<br /><br />\nOPEN ALL NIGHT.<br /><br />\nWILLIAXSON<br /><br />\nWATTS,<br /><br />\nr.,3370rtio $tores,.,<br />\n'Baltimore and Eutaw Streets.<br /><br />\nHoward and Franklin Streets.<br /><br />\n/Drugs, jfancr (Boot's, Verfunierp,.Cotiet lirticIes, Cigars, Sam 'Mater.<br /><br />\nles<br /><br />\nTHE CHEAPEST PLACE<br />\nIN BALTIMORE FOR<br /><br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Ooods, Olass Ware,<br />\nStudents' Sundries.<br /><br />\nH. S. WRIGHT &amp; CO.,<br />\n704 MADISON AVE.<br />\nVvi-c<br /><br />\nC. &amp;, I'. 'Phone 3350-Y.4711<br /><br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\nMathetnatical and Surveying Instruments,<br />\nDraughtsinen's and Engineers' Supplies_<br />\nN. W. Corner<br />\nLexington and Liberty Sts.<br /><br />\nliAl.,TiM01-211:, MD.<br /><br />\nAgent for Keuffel cf. .Esser Co., of New York.<br /><br />\n-\"A Pc.<br /><br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br /><br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br /><br />\nHenderson's<br /><br />\n.A<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Hooks, —<br />\nMadison<br />\nStudents' Supplies.<br /><br />\n&amp; Howard Sts.<br /><br />\nincorporated 18714.<br /><br />\n\"A's StfonA as the SteonAest.\"<br /><br />\nVIE FIDELITY MUTUFit LIFE INSUIVINGE<br />\nOF Pli•ILA.DELPI-VIA%<br />\nAN EXCELLENT OPPORTUNITY is offered Students and Teachers to write Insurance for THE<br />\nFIDELITY, either during vacation or permanently.<br />\nFor Agency In Maryland or West Virginia,<br /><br />\nAddress,<br />\nC. IMAIIA III, Manager<br />\n806 8 Merchants Bank Bldg., Baltimore, Md.<br />\n_<br /><br />\nFor Advertising Space in this Paper<br />\nAPPLY TO<br /><br />\n• 0,d(*IW<br />\nIeWe<br />\nt9,<br />\nST*.<br />\nLOMDAR<br />\ni,KINT<br /><br />\ntrIM cr.<br /><br />\n,<br /><br />\nPUBLISHERS.<br /><br />\ntoo<br />\n„!\"/A.\".47.677C3///1/(7',.4e.-tetro47<br /><br />\ne. NVI,111:7!, :BAL<br /><br />\nN ! CA,11 )011<br />\n,<br /><br />\n11117<br /><br />\nUNION<br />\nTHEOLOGICAL<br />\nSEMINARY<br /><br />\n7,,I.<br /><br />\nEquipped for<br />\nE<br />\nFF I:Scholarly<br />\nand Practical<br />\nwork, in the midst of the<br />\nChristian enterprises of a<br />\ngreat city,in close academic<br />\nrolations with Columbia and<br />\nNew York Universities, offers opportunities for the<br />\ndegrees of M. D., A. M. and<br />\nPh. 0,<br />\nOpen on equal terms to<br />\nstudents of all Christian<br />\nbodies.<br />\nSIXTY-1116AM YEAR<br /><br />\n700 Park Ave<br />\nNew York<br /><br />\nbegins September 23, 1903.<br />\nAddress the President of<br />\nthc Faculty, the<br /><br />\nRev. Charles C. Hall, D. D.<br /><br />\nSTIEFF PIANOS<br />\nMADE Or 'rim<br /><br />\nmawr MATERIALS MONEY<br /><br />\nAN!) EXPERIENCE CA N<br /><br />\nWwit1111401,1149.1<br /><br />\nCOM $300,000. Surplus and Uurlividerl Proll.s $400,000<br />\nDrovers &amp; Mechanics Nat'l Bank,<br />\nOF BALTIMORE.<br /><br />\nIHJY.<br /><br />\nIli N. 14111E,ItTY ST.<br /><br />\nrs and<br />\nGUSHING &amp;COMPANY'8Botaotkiselle<br />\noners.<br /><br />\n•Prest.<br />\n1. Strolls°,<br />\nEdw. P. Hayden, Ans't Cashier.<br /><br />\nJas. Clark, Prest<br />\nChas. S. Miller, Cashier.<br /><br />\nft General Banking Business Transacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom $3 per year and upward.<br /><br />\nAccounts Solicited.<br /><br />\n34 W. BfILTIMORE STREET.<br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nK eVp constantly on hand the Text, Hooks used<br />\nIII.)Ohlis Hopkins University and the Woman's<br />\nCollege of Balt imore.<br />\nSTATIONERY—Por School, Pamlly, Office and Bank.<br /><br />\nHaberdashers,<br />\nShirts, Nea1 wear,Underwear<br />\nIMIIIIIIIIIIMIIMIIIMME11.1111111111 Hosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\nOn Sale The J. II. U. Pennants, and nil other College<br /><br />\nTHOS.BLAKE CO<br />\nPennants.<br /><br />\n219 EAST BALTIMORE Si.<br />\nA. H. FETTING,<br />\nMANUFACTURER<br /><br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LEHMAN &amp; SON,<br />\nFOR<br /><br />\nJORDAN STABLER GO.submitted of<br /><br />\nA711:1S11)<br />\nN7CIAIV<br />\nSamples<br />\nReads as follows:<br />\nFrench Brandy—no adulterants, no coloring,fine quality.<br />\nOporto Port —absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive 011—all tests show pure olive oil.<br />\nCider Vinegar.- natural cider vinegar, strictly pure and<br />\nstrong,<br />\nSix GrotimiSplees—no adlilteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br /><br />\nIlgenfritz Studio<br />\nSuccessor to Cummins.<br /><br />\nOF<br /><br />\nOren letter ffraternitp aewelrp,<br />\n14 A74 D 16 ST. PAUL STREET,<br /><br />\nBALTIMORE, MD.<br />\nIpleasc Call ant, Examine our ILine lacforc purchasing.<br /><br />\nARTISTIC PHOTOGRAPHY<br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial Discount to Students.<br />\nC. 3. V. telcpbonc 445 v.<br /><br />\nJENNINGS &amp; HORSEY.<br />\nMERCHANT<br /><br />\nLibraries arranged and put in<br />\norder without removal. or if<br /><br />\nTAILoRsi.<br /><br />\ndget<br /><br />\nRUZICKA<br /><br />\n21 W. PAY ET•I'M ST/I/CET.<br /><br />\n=itz.t)a-<br /><br />\nBOOKS!!!<br />\nSECOND-HAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nExchanged.<br />\nBought, SIild and<br /><br />\nPIPPEN'S BOOK STORE,<br />\n605 IN. EUTFMAI ST.<br />\nNear the University.<br />\nBaltimore's largest Old Book Store.<br /><br />\nJ. H. U. Binder.<br /><br />\nBooginder,<br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE<br /><br />\nTHEO. WARNER.<br /><br />\nWARNER &amp; CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln &amp; Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 WEST BALTIMORE, STREET.<br />\n—<br />\nManufacturers of<br />\nSilk and Cassimere Hats. •••\"' Hopk<br /><br />\nins Caps<br /><br />\nLLOYD S. S. GO<br />\nNORTH GERMAN<br />\nCABIN l'f1SSf1Gl T LOW RATES.<br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBRLTIMORE TO BREMEN DIRECT.<br /><br />\nSCHUMAGtIE,R &amp; GO., General Agents.<br /><br />\nPor particulars apply to<br /><br />\nISAAC H. DIXON, P<br />\nJAS. R<br /><br />\nTHE<br /><br />\nChas. Whims Surgical Instrument Co.<br /><br />\n.JAS. MEIKLIE, Vicc-PAEAT<br />\nRICHARDS, TREAS.<br /><br />\nSmith, Dixon Co.<br /><br />\nPH YSICI ANS'. SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br /><br />\n300 N. Howard St.,<br /><br />\nBaltimore, Md.<br /><br />\n29 - 31 S. Charles Street.<br /><br />\nLI<br /><br />"}], "field_media_file": [{"target_id": 36268, "display": null, "description": null, "target_type": "file", "target_uuid": "2d916240-5ee2-406d-b9e3-abf1e8fa6908", "url": "http://digital.library.jhu.edu/system/files/2022-03/12242-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12242, "target_type": "node", "target_uuid": "e393193a-4bcd-44c3-a6ed-cce9dfdca5e4", "url": "/node/12242"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "3f3918bb-7c9f-483d-8e5f-c136f4975803"}]}