{"mid": [{"value": 39362}], "uuid": [{"value": "5824de51-8ad0-47d8-8557-dbe200b49351"}], "vid": [{"value": 39362}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T19:29:06+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13941-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T19:29:06+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T19:29:06+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Weekend Weather Watch:<br />\nYesterday's Snow<br />\nis Today's Slush<br />\n<br />\nVOL. LXXII, NO.9<br />\n<br />\n'Nnits IIrtter<br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND,DECEMBER 1, 1967<br />\n<br />\nOn The Inside:<br />\nThe Treasures of the<br />\nWalters revealed.<br />\nSee page 5.<br />\n72ND YEAR<br />\n<br />\nBermuda-Bound Graduate Student Sit-In Attack Planned For Dow<br />\nReneges on Pledge to Repay Theft<br />\nCIA Cancels<br />\nHop Interviews<br />\n<br />\nSpecial to the News-Letter<br />\nMr. Berthel said that negotiaA warrant was signed out in tions are being conducted with<br />\nBaltimore City Court Tuesday by Scribners for the return of the<br />\nthe Hopkins University for the ar- valuable material. \"They are being<br />\nrest of a graduate student in the most cooperative, but it may end<br />\neducation department, who alleg- up costing us a very considerable<br />\nThe Johns Hopkins University<br />\nedly stole $5,000 worth of rare sum of money to have our own<br />\nAd Hoc Committee Against Dow<br />\neighteenth century pamphlets from works returned,\" he said.<br />\nChemical Company voted Wednesthe Eisenhower library last year.<br />\nThe theft, the largest in library<br />\nday afternoon to stage an obstrucJohn Berthel, head librarian, history, is only one of many since<br />\ntive sit-in against the Dow recruiter<br />\nwho called the crime \"the most the library was moved from Gilscheduled to be on campus Monserious theft in the history of the man Hall. Mr. Berthel, however,<br />\nday, December 4,<br />\nHopkins library,\" said the robbery said that vandalism and stealing<br />\nA spokesman for the Commitoccurred sometime between Feb- have decreased since more guards<br />\ntee said that should the recruiter<br />\nruary and April, 1967.<br />\nand restrictions have been imposed<br />\nsucceed in entering the Placement<br />\nCharged in the theft was Mat- on student use of the library. DOW RECRUITERS trap harried Classics students into listening<br />\nOffice in Whitehead Hall,the group<br />\nto<br />\ntheir<br />\nusual Song and Dance routine.<br />\nthew R. Ryan, 38, of Bermuda,<br />\nwould switch to a non-obstructive<br />\nU.K., and until recently a resident<br />\nsit-in so that students wishing to<br />\nof the University's Greenway<br />\nbe interviewed by the recruiter<br />\nApartments.<br />\ncould do so unhindered. \"We are<br />\nAccording to Dr. John Walton,<br />\naiming our protest at Dow. not<br />\nBy DICK CRAMER<br />\nhead of the education department,<br />\nthe students or the University,\"<br />\nRyan was suspended from the deRecent student pushes for in- commented the spokesman.<br />\nOn November 29, the Maryland later with the six students' refusal creased freedom, bills of<br />\npartment about a month ago after<br />\nThe demonstration will begin<br />\nrights,<br />\nto remove themselves from the<br />\nDr. Walton learned of the theft. Court of Special Appeals will con- sidewalk once they were<br />\nand a greater voice in the formula- at 7:30 a.m. in front of Whitehead<br />\noutside.<br />\nRobert Strider, Dean of Graduate sider a constitutional challenge All of the six were members of the tion of university policy, have Hall. There will be a supporting<br />\nStudies, said that he had not learn- concerning six former Hopkins Johns Hopkins Chapter of<br />\nthe questioned the rules requiring picket line for those who do not<br />\nstudents, arrested and convicted<br />\ned of the suspension.<br />\nStudents for a Democratic Society. freshmen to live in the dormitor- wish to participate in the sit-in.<br />\nRyan, a third year doctoral last year on disorderly conduct<br />\nThe students' original convic- ies.<br />\nRobert Butler,Director of Hopcandidate, and a former Hopkins convictions.<br />\nIn a poll taken by the<br />\nDavid L. Harding, 22, Daniel A. tion was passed down by Judge I. chapter of the Students Hopkins kins Public Relations, stated that.<br />\nundergraduate, had served in the<br />\nFor DeSewell Lamdin, the present chief<br />\narmed forces, had worked as a Kline, 22, Donald A. BacheIler, judge of the Municipal Court<br />\nmocratic Society last spring, mem- \"We will not object to a peaceful<br />\nof<br />\nbookdealer in New York and had 20, Daniel Rudman, 22, Wayne R. Baltimore. The convictions were bers of the freshman class were demonstration but if normal functions are disrupted, we will take<br />\ntaught at Seton Hill College . Heinbach,21,and Allen B. Greene, upheld in a second trial on June asked their opinions on life in the<br />\nappropri<br />\nate actions.\"<br />\nThe robbery of the pamphlets 20,were arrested by Baltimore po- 6, 1966 by Judge J. Gilbert<br />\ndormitori<br />\nes. An overwhelming<br />\nPrewas discovered several months ago lice when they sat down and re- dergast and a jury in the Criminal 79% of those students replying<br />\nThe Ad-Hoc Committee on<br />\nby a library staff worker, and im- fused to move from the sidewalk Court of Baltimore. Each student stated that they found dormitory Campus Recruitm<br />\nent, a coalition<br />\nfront<br />\nin<br />\nrecruitin<br />\nof<br />\na<br />\nstation<br />\ng<br />\non<br />\nmediately Mr. Berthel wrote to<br />\nlife either restrictive or depressing. of SDS, Vietnam Committee<br />\nreceived<br />\nsixty<br />\na<br />\nday<br />\njail<br />\nsentence<br />\nand<br />\nGreenmount Avenue.<br />\nseveral magazines circulating<br />\nand a fifty dollar fine. Through- 67% felt that it would not have Union for Democracy at Hopkins<br />\nThe<br />\nevent<br />\nclimaxed<br />\nan<br />\nSDS<br />\namong bookdealers.<br />\nout,the appellants have contended hurt them academically to have forces, has sent a letter to Rogers<br />\nScribners,in New York,answer- sponsored demonstration held on that, \"We were arrested because lived off-campus. In addition, 59% demanding<br />\nthe cancellation of the<br />\ned the library's query, and said March 28, 1966, against the Viet- we expressed unpopular political felt that their social life suffered Dow<br />\nrecruiters scheduled appearThirty<br />\nwar.<br />\nnam<br />\ncollege<br />\nfifty<br />\nto<br />\nas a result of their living in the<br />\nthey had purchased most of the<br />\nviews.\"<br />\nance and requesting a debate with<br />\nstolen works from Ryan, a dealer and high school students picketed<br />\nIn the present appeal,the Mary- dorms.<br />\nUniversity officials on the issue of<br />\nentrance<br />\nof<br />\nthe<br />\nrecruitin<br />\nthe<br />\nceng<br />\nfrom whom they had purchased<br />\nland Court of Special Appeals, the<br />\nNo Action Taken<br />\nrecruitment on campus. Copies of<br />\nter with signs declaring \"Peace in second highest Court in the state,<br />\nbooks previously.<br />\nThe results of the poll were<br />\nthe letter were sent to President<br />\nAccording to Mr. Berthel, Ryan Vietnam,\" \"Johnson is Goldwater granted permission for the appel- made available<br />\nGordon, the president of Dow<br />\nto administration,<br />\nwas remembered for having often in Disguise,\" and \"Make Love, not lants to be represented as indi- but no<br />\naction was taken. Mr. Chemical, and the News-Letter.<br />\nbeen delinquent in returning books War.\"<br />\ngents, and therefore the case will Robert P. Bilgrave,<br />\nDirector of<br />\nThe six students mentioned be considered at State expense.<br />\nto the library on time.<br />\nThe Central Intelligence Agency<br />\nStudent<br />\nAffairs,<br />\nsaid<br />\nthat<br />\nthe poll has<br />\nabove<br />\nentered the center during<br />\nImmediately,administration ofRepresenting the students will was taken in the spring,<br />\ncancelled its recruitment interand<br />\nthat<br />\nficials talked with Ryan, who ad- the initial stages of the demonstra- be Fred E. Weisgal, a Baltimore atviews<br />\nscheduled for December I<br />\nthe results would have been submitted the theft and promised res- tion and attempted to persuade of- torney, and Anthony G. Amsteron the Hopkins campus.<br />\nstantially<br />\ndifferent<br />\nhad<br />\nthe<br />\nquestitution of the assorted Americana. ficials to place anti-war informa- dam, a professor of Criminal Law tions<br />\nMr. J. Lyon Rogers. Director<br />\nbeen<br />\nHowever, Ryan supposedly fled to tion beside the recruiting bro- at the University of Pennsylvania. semester asked during the first of the Placement Bureau located<br />\n.<br />\n\"The<br />\ndormitor<br />\nies, adBermuda last week and the Univer- chures. This resulted in them being Frank DeCosta Jr., an assistant atin Whitehead Hall, said the cancelsity was compelled to sign out the escorted from the premises by torney, is the States' Advocate in mittedly, are not an ideal situa- lations were due to a lack of intertion,\"<br />\nhe<br />\nsaid.<br />\nNevertheless, he<br />\nU.S. MarshaIls. The arrests ensued the case.<br />\nwarrant.<br />\nagrees with the policy of requiring viewees. Only two students, both<br />\nstudents to live in the dormitories doctoral candidates, had scheduled<br />\ninterviews.<br />\nfor their freshman year.<br />\n\"After seeing 18 classes come in<br />\nHe did not say whether the two<br />\nat<br />\nHopkins,<br />\ninterview<br />\nI<br />\nknow<br />\nees would be granted inthat<br />\nthere<br />\nis<br />\nBy BOB SLOAN<br />\nour natural wealth. Being a student<br />\nHe feels that Hopkins will make<br />\nEDITOR'S NOTE:This is the third at a university should be pointed a slow expansion of its depart- a transistion that is necessary.\" terviews at another time or another<br />\nOne of the conclusions arrived place. The CIA has also scheduled<br />\nand final article in this series.<br />\nout as being the most important ments. If there is a \"contrac<br />\ntion\" at in the poll was that the dormi- interviews for Thursday. January<br />\nthing<br />\nthat<br />\nthis<br />\ncountry<br />\nhas.'<br />\nHe it will be in the area of research: tories<br />\nThe drafting of graduate and<br />\ndecrease<br />\n11.<br />\nPotential graduate students poses continued, \"We can't go around equipment will not be purchased the student individuality within<br />\nThe Hopkins SDS threatened a<br />\nbody. Dr. Clinton<br />\na far more immediate threat to killing the progress the country and so forth. He repeated that the<br />\ndemonstr<br />\nDeSoto,<br />\nation against the CIA reassociate<br />\nprofessor<br />\nof<br />\nHopkins' expansion than the re- has made - - our graduate students, loss of graduate students to the Social Psycholo<br />\ncruiters unless the interviews were<br />\ngy,<br />\nfelt<br />\nthat<br />\na<br />\nnumpotential<br />\nour<br />\nscientists<br />\nand pro- draft will be a greater cause of reduction of government research<br />\nber of students, the \"loners,\" cancelled. In a letter to Rogers.<br />\nfessors.\"<br />\naid.<br />\nsearch contraction than a shortage should be allowed to live<br />\noff-cam- dated November 17. the SDS reDr. George E. Owen of the<br />\nOwen linked this crisis, one of funds.<br />\nquested a debate with the CIA repus.<br />\nPhysics Department, a faculty re- very similar in its effects to the<br />\nOwen is optimistic about the<br />\nHe also felt that the dormitory, cruiters in place of the interviews.<br />\npresentative on the Long Range financial one, to the future goals future of the school. He realizes or any communal atmosphere, forA conference was subsequently<br />\nPlanning Committee, said that, of Johns Hopkins. Both problems, that there are problems, in the al- ces people to conform to a certain held in the Placement office, atalthough there is concern over the he said, must be taken into consi- location of funds as well as else- extent. Mr. Bilgrave agreed with tended by Eduardo Joly and<br />\ncut-back of funds, the effects of deration when discussing the plan- where, but \"we have the potential this conclusion. \"Certainly,\"<br />\nhe Stephen Diamond, members of the<br />\nthe shortage of government assist- ed expansion of the university.<br />\nto do things right. Hopkins can set said, \"there are a few students SDS Steering Committee. Rogers.<br />\nance on Hopkins cannot, at preThe ultimate \"dream\" of the the image of what a university who would be happier living off- and Mr. Bilgrave, Director of'Stusent, be accurately forecast.<br />\nlong-range planners, one which should be like.\"<br />\ncampus- - but they are not harmed dent Affairs.<br />\nHowever,if the draft system re- Owen feels Hopkins has the potenIf students regret the shortages by having to live in the dormi. The Administration representamains as it now stands with col- tial, monetarily as well as educa- in the departments of the Univer- tories for one year.\"<br />\ntives denied the requests of the<br />\nlege seniors and first year graduate tionally to achieve, is to increase sity, their complaints are listened<br />\nAdministration opposition to<br />\nstudents being given top priority the faculty so as to have a closer to by faculty and .administration the abolishment of the require- SDS. whereupon the SDS representatives said that they would<br />\non 1-A lists, the resulting deple- student faculty relations<br />\nIn the future, Owens feels, their ment may stem from financial<br />\nhip.<br />\nfeel<br />\nfree to take any action they<br />\ntion ofgraduate school enrollment<br />\n\"Hopkins is unique,\" says opinions will be solicited by the concerns. Dean Shaffer said, last deemed appropri<br />\nate and necessary.<br />\nWill have an immediate and adverse Owen, \"in that it is highly<br />\nper- administration. The financial pro- year, that if the dormitories could<br />\nAdminist<br />\nThe<br />\nration officials<br />\neffect on the future plans of the sonalized, and can become even blems of a small<br />\nschool and the not be filled, there would doubt- stated that they respected the<br />\nUniversity.<br />\nmore so. Hopkins is probably the newer, more pressing problems of less be \"financial repercussions.\" right of students to take a stand<br />\nThe drafting (and possible kill- only school in the nation that can the draft, will create<br />\nreal problems This year, to fill the dorms, the against the CIA and would permit<br />\ning) of college educated men is, in afford this 'experiment' in person- for Hopkins,<br />\nbut it should be able university has allowed graduate an \"orderly- demonstration. but<br />\neffect,says Owen,\"depriving us of alization.\"<br />\nstudents to live in Vincent House.<br />\nto realize its \"dream.\"<br />\n<br />\nOutlook Bleak<br />\nFormer Students<br />\nChallenge Court For Dorm Changes<br />\n<br />\nDrafting of Grad Students Threatens Expansion<br />\n<br />\n(Continued on Page 6)<br />\n<br />\n\fHOMEWOOD, BALTIMORE, DECEMBER 1, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE TWO<br />\n<br />\nAdministration Reshuffles<br />\nAs Fund Discards, Deals<br />\n<br />\nI CAMPUS NOTES 1<br />\nPIKE'S PEAKS<br />\nBishop James Pike will speak at<br />\nHopkins on Sunday,December 10,<br />\nin Shriver Hall. He will deliver a<br />\nsermon \"Growth Through Encounter\" during an 11 a.m. Ecumenical<br />\nService. At 3 p.m., he will give an<br />\naddress on\"The Ethics of Dissent.\"<br />\nA MAN AND HIS SOUL<br />\nRudolf Serkin, pianist, will give<br />\nhis only concert in the Baltimore-<br />\n<br />\nTHESE FEW LINES MAY MAKE<br />\nLIKE QUIPS BUT SEE HARRY<br />\nLITTLE FOR THE BEST FOOD<br />\nTIPS.<br />\n<br />\nSubmarines • Pizza<br />\nSpaghetti • Chicken Dinners<br />\n<br />\nHARRY LITTLE<br />\nCARRY OUT SHOPS<br />\n<br />\n32nd Near Greenmount<br />\n25th Near Greenmount<br />\nYork Road & Regester Ave.<br />\n<br />\nJOE MENDELSON<br />\nBSChE, U. of Maryland,<br />\nis a plant engineer at<br />\nour Sparrows Point,<br />\nMd., Plant, biggest in the<br />\nworld. Only four years<br />\nout of college, Joe has<br />\nalready developed nearly<br />\n80 major engineering<br />\nprojects, some with<br />\nmulti-million-dollar price<br />\ntags, from basic planning<br />\nthrough engineering and<br />\nconstruction.<br />\n<br />\nGet High With a Little Help from<br />\nmy Friends. Contact, Ann Goldberg, Baltimore Symphony Orcestra, 727-7300.<br />\nHOLE SALE BAGELS<br />\nThe Jewish Student Associations of Hopkins and Towson<br />\nState are holding a bagels-and-lox<br />\nbreakfast, Sunday, at 10 a.m., in<br />\nthe Towson Student Center. Dr.<br />\nLouis Kaplan, noted Jewish educator will speak. Rides are available;<br />\ninterested parties should contact<br />\nDavid Blecker, 467-6952. Admission is free<br />\nA SIGH FOR CYBERNETICS<br />\nOBJECTIONS SUSTAINED<br />\nThe next Computer Seminar<br />\nOn Saturday, December 9, and will feature Russell A. Kirsch of<br />\nSaturday, December 16, the Col- the National Bureau of Standards,<br />\numbia University School of Law Monday, December 4, 4 p.m., in<br />\nwill sponsor its sixth annual Pre- the Auditorium of Shaffer Hall.<br />\nLaw Conference for undergraduate The talk will be on \"Experiences<br />\nupperclassmen. The Conference and Extrapolations from the Use<br />\nwill be held in New York, the of Large Time-Sharing Systems<br />\nSchool of Law on 116th Street Over Long Distances.\"<br />\nADVISE AND REPENT<br />\nand Amsterdam Avenue. Interested students should contact Bud<br />\nA fall advising period, similar<br />\nBozarth, Box 1111.<br />\nto the spring advising period, has<br />\nbeen set up. During December 6<br />\nFIRST SOLO FLIGHT<br />\nto December 20, all undergradErroll Garner will appear as uates are to consult with their faguest soloist with the Baltimore culty advisors on their second seSymphony Orchestra on Novem- mester programs. Programs are to<br />\nber 25. He will perform some of be completed and submitted for<br />\nhis own works and orchestrations advisor's approval prior to Christincluding, Misty, Dreamy and I mas Vacation.<br />\nWashington area on Friday, December 8, in the Lyric Theatre, at<br />\n8 p.m., as part of the Shriver Hail<br />\nSeries. The program will include<br />\nselections by Schubert, Beethoven,<br />\nand Brahms.<br />\nPOPPY SEEDS AND<br />\nFUNNY WEEDS<br />\nA Still-Life and Flowers exhibit<br />\nwill be presented in the Milton S.<br />\nEisenhower Library on December<br />\n1, 2, and 3, from 9 a.m. to 9 p.m.<br />\nIncluded in the exhibit will be<br />\nMarc Chagall, Georgia O'Keefe and<br />\nRaoul Dufy.<br />\n<br />\nHospital Del elopmem, Fund<br />\nPresillene Goes to Burns<br />\nDr. Gerald P. Burns, president<br />\nof the Independent College Funds<br />\nof America, Inc., has been named<br />\nvice president for development of<br />\nthe Johns Hopkins Hospital and<br />\nthe Johns Hopkins University and<br />\nwill be responsible for the fund<br />\nraising activities of both institutions.<br />\nThe announcement was made<br />\njointly by Dr. Russell A. Nelson,<br />\npresident of the Hospital, and Dr.<br />\nLincoln Gordon, president of the<br />\nUniversity. Dr. Burns will also become president of the Johns Hopkins institutions. University Trustee M. Jenkins Cromwell, who is<br />\nnow president, will become Chairman of the Board.<br />\nGrad of Boston U.<br />\nDr. Burns, 49, has been president for ten years of the Independent College Funds of America,<br />\nInc., as national fund-raising orgahization representing 39 state<br />\nassociations and more than SOO<br />\nprivate colleges.<br />\nA 1941 graduate of Boston<br />\nUniversity, Burns served five years<br />\nin the U.S. Army during World<br />\nWar II, rising from private to<br />\n(Continued on Page 7)<br />\n<br />\n\"Youth will make this one of the most<br />\npopular films ever produced. It will<br />\nquickly rank with that small number<br />\nof totally contemporary films that include The Beatles flicks, 'Morgan,'<br />\n'Blow Up' and a very few others.<br />\n\"Dylan expresses something very,very<br />\nimportant about the New Youth. Our<br />\nsons and daughters are beyond our<br />\ncommand, and Dylan offers us clues<br />\nas to why.<br />\n\"It is the most effective presentation<br />\nof the reality of contemporary youth<br />\nattitudes that I have ever seen. It is<br />\nalso one of the best, if not the very<br />\nbest, portrait of a performing artist<br />\nto be shown publicly.<br />\n\"It ought to be seen dozens of times!\"<br />\n<br />\noIk President's Assistant,<br />\nIn Join Carnegie Group<br />\nRonald A. Wolk, Special Assistto the President and Coordinator<br />\nof Planning of the Johns Hopkins<br />\nUniversity has been named as<br />\nAssistant Director of the Carnegie<br />\nCommission on the Future of<br />\nHigher Educations.<br />\nThe Commission, chaired and<br />\ndirected by Clark Kerr, was created last January by the Carnegie<br />\nFoundation for the advancement<br />\nof Teaching. Its aim is to make a<br />\ncomprehensive study of all the<br />\nphases of higher education in this<br />\ncountry and the complex elements<br />\nof society which affect higher<br />\neducation.<br />\nMr. Wolk has been at Hopkins<br />\nsince 1958. In 1963 he was named<br />\nSpecial Assistant to Hopkins' President Milton S. Eisenhower. Two<br />\nyears later he was elected Vice<br />\nPresident of the Johns Hopkins<br />\nFund. This organization, presently<br />\ndirected by Dr. Gerald Burns, controls the process of fund-raising<br />\nfor the University. Mr. Wolk was<br />\nlikewise appointed Coordinator of<br />\nUniversity Planning.<br />\nFor many years, Mr. Wolk has<br />\nbeen an active participant within<br />\nhis field. He was, for example, director and secretary of Editorial<br />\nProjects for Education, and publisher of The Chronicle of Higher<br />\nEducation,a bi-weekly newspaper.<br />\nHe has also participated in the<br />\nAmerican Association of Education and the American College<br />\nPublic Relations Associations.<br />\nLEON IS A YEAST<br />\nTERM PAPERS TYPED<br />\n592-6836<br />\n<br />\nELEPHANTS<br />\nnever forget<br />\n<br />\n— Ralph J. Gleason, San Francisco Chronicle<br />\n<br />\n(and you will<br />\nalways remember)<br />\nthe fabulous<br />\nvalues at<br />\n<br />\n/<br />\n<br />\nTHE<br />\n<br />\nMANAGEMENT<br />\nMINDED?<br />\n<br />\n•<br />\n<br />\nSAMPLE<br />\nSTORE<br />\n<br />\nCareer prospects are<br />\nbetter than ever at<br />\nBethlehem Steel. We need<br />\non-the-ball engineering,<br />\ntechnical, and liberal arts<br />\ngraduates for the 1968<br />\nLoop Course. Pick up a<br />\ncopy of our booklet at your<br />\nplacement office.<br />\n<br />\nEVERY<br />\nSPORTCOAT<br />\nIN STOCK<br />\nValues to $45.00<br />\n<br />\n44<br />\n<br />\n19 40<br />\n<br />\nAn Equal Opportunity<br />\nEmployer in the Plans for<br />\nProgress Program<br />\n<br />\nSartIPLE STORE<br />\n<br />\nBETHLEHEM<br />\nSTEEL<br />\n<br />\n3031 Greenmount Ave.<br />\nIn Waverly<br />\nOPEN EVERY EVENING<br />\n<br />\n• CHAK-11 • PAC • MOO ClUB<br />\n<br />\nBOB<br />\nDYLAN<br />\n<br />\nCHUNG'S<br />\nCARRY-OUT<br />\nFine Chinese ond<br />\n<br />\nAlit DON!LOOK BACK<br />\n<br />\nPolynesian Food<br />\nOpen Daily 11 A.'.4. 10 P.M.<br />\nFriday & Sat 11 AM.. 12 P.M.<br />\nSunday 1 P.M.. 11 P.M.<br />\n508 W. Cold<br />\n<br />\nSpring Woe<br />\n<br />\n889-3428<br />\n<br />\nA Film By D. A. Pennebaker<br />\nwith JOAN BAEZ<br />\n<br />\nPremiere Today.<br />\n<br />\nat 2,4,6,8,10<br />\n<br />\nNorth at Charles<br />\nNext-sy<br />\n<br />\nIDc)c)r<br />\n<br />\n1<br />\n<br />\nComplete Bachelor 1<br />\nService<br />\nFLUFF DRY & FOLD<br />\nSHIRTS—DRY CLEANING<br />\n<br />\nWaverly Laundromat<br />\n<br />\nVE 7 — 1956,<br />\n<br />\n3339 GRF;F:NMOUNT AVE.<br />\n<br />\nt rk ii 1;2:<br />\n<br />\n467-2123<br />\n<br />\n\fHOMEWOOD,BALTIMORE,DECEMBER 1, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\n\"What doesIBM offer a<br />\nPh.D?I'd say diversity.But<br />\njudge for yourself when<br />\nthey're here Dec.12th'<br />\n\"I think IBM's worth listening to because the advantages<br />\nthat attracted me are even stronger today.(This is Gary<br />\nKozak,Ph.D. in Analytical-Physical Chemistry,an IBM<br />\nDevelopment Chemist and Project Manager.)<br />\n\"At IBM you're constantly working with people doing<br />\nadvanced work in many different fields. That's a great asset<br />\nto any scientist because today's problems are often<br />\ninterdisciplinary. You can't solve them with one kind of<br />\nbackground. You need inputs from three or four different<br />\nkinds of people.<br />\n\"A good example is the solid logic technology used in<br />\nbuilding the IBM System/360. The EE tells you how many<br />\nconductors you'll have, where they go,and what should be<br />\nat the terminals. An ME designs fixturing and automatic<br />\nprocesses. A Polymer Chemist formulates insulators<br />\nand says how they should be used. The Metallurgist<br />\nspecifies alloy compositions. The Physicist decides how to<br />\noptimize a process for producing transistors and diodes.<br />\nAnd all these people have to talk with each other and<br />\nhelp each other.<br />\n\"It's a stimulating environment,and it keeps you technologically sharp. Of course, to do all this interfacing with<br />\nother disciplines, you need a free and informal atmosphere,<br />\nand IBM has it. It's a good place for a scientist to work.\"<br />\nThere's more to the IBM story than Gary has mentioned.<br />\nYou can get all the facts when we interview Ph.D.'s on<br />\ncampus. Make an appointment at your placement office,<br />\neven if you're headed for military service.<br />\nOr if you can't make a campus interview,send an outline<br />\nof your interests and educational background to<br />\nMr. L. H.Covert,IBM,Armonk,<br />\nL-7 L<br />\nN.Y. 10504. We're an equal<br />\nopportunity employer.<br />\nr 1r<br />\n<br />\n\fHOMEWOOD, BALTIMORE, DECEMBER 1, 1%7<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE FOLIR<br />\n<br />\n3nliuniiapkino<br />\nNtins-Etiter<br />\n<br />\nEDITORS-IN-CHIEF<br />\n<br />\nCorrespondence<br />\n<br />\nMACKSEY ON BANKRUPTCY<br />\nTo The Editors:<br />\nWhen God, Sex, and Politics<br />\nfail, there is always Money as a<br />\nprovocative topic for intramural<br />\nconversation. Bob Sloan's series<br />\nSuddenly the arch villan of the play has mellowed somewhat. We on \"Homewood in Financial Criare told that McNamara's passing will remove the final dove in the sis\" promises to rehearse much of<br />\nPentagon. Which, if true, we are ready for a Pandora's Box of policy our local monetary mythology and<br />\ndecisions on the course of the war in Viet-Nam.<br />\nperhaps stimulate some new ideas.<br />\nMcNamara has had a penchant for producing real lemons. Besides At all events, your reporter should<br />\nthe Edsel and the Viet-Nam war, he has also made the \"computer have no trouble in turning-on the<br />\nmind\" a virtue which future government officials will emulate. faculty, for too many of whom<br />\nThe only question left is who will step in where angels fear to<br />\nthe spectre of immanent academic<br />\ntread. Connolly and Anderson are most prominently mentioned.<br />\nbankruptcy seems to have replaced<br />\nBoth are Texans.<br />\nthat of the late Senator McCarthy<br />\nConnolly has a history of Life magazine articles on the Kennedy or of the excluded middle.<br />\nAssasination, whereas Anderson is a Republican and also an advocate<br />\nI did, however, want to unof former President Eisenhower's theory of a massive land invasion<br />\nscramble on reference in Mr.<br />\nof North Viet-Nam.<br />\nSloan's first article to what apClearly the outlook is bleak for any kind of rationality to return peared to be the Humanities Cento the Pentagon or the White House. Personal prestige has now been<br />\nter's typewriter rescue fund. The<br />\nelevated as the main objective of victory in Viet-Nam. Ballots not allusion was intended simply as a<br />\nbullets in 1968 will settle that question.<br />\ntrivial illustration of the multiple<br />\nIn passing one can only reflect that if either of the two Texans and usually unpredictable demands<br />\ntake the Defense post, it will look suspiciously as though it were a<br />\nmade every year on any descrepay-off for that darkly hinted Texas conspiracy in Dallas several tionary funds available to the adyears ago.<br />\nministration. Dean Kimball was<br />\nable to allocate a small sum this<br />\nterm to enable a plan for seminars<br />\norganized by members of an unThe State Attorney General is investigating certain discrep- dergraduate course; the seminars,<br />\nunder the general rubric \"the perancies in the books of the Morgan State food service and two<br />\nson of the maker,\" are designed<br />\nwholesale suppliers of institutional food.<br />\nIt appears that certain amounts were paid out and goods to allow the students concerned<br />\nwith the arts and the art of critiwere never recorded as having come in. It only shows that a lot<br />\ncism to invite a few distinguished<br />\nmore is rotten than just the food.<br />\nAt Hopkins it has been empirically proved that the food is artist and critics to Oarticiilate in<br />\ndiscussions about problems of inbad. It would also bear checking to see if all is kosher in the<br />\nthe period<br />\nfinancial department. The University budget and financial re- terpretation during<br />\nwhen<br />\nthe<br />\nformal<br />\nHumanities<br />\nSemicords are regularly checked by a Baltimore accounting firm,<br />\nnars<br />\nare<br />\nin<br />\nhibernation.<br />\nThe<br />\nmoney<br />\nrecords.<br />\nwere<br />\nMorgan's<br />\nfinancial<br />\nso<br />\nagain,<br />\nbut then<br />\nIt has not been proven to anybody's satisfaction why there which the Dean could divert to<br />\nis such an outrageous \"overhead\" for food services. Adminis- this experimental (and unbudgettration officials, especially in the Plant Manager's Office, have ed) project was severely limited by<br />\nsome of the other unexpected debeen consistently guarded as to financial records.<br />\nAccording to one faculty member of the Bookstore Com- mands which come to roost on a<br />\nmittee, the suggestion that students have access to financial re- Dean's desk, such as the replacecords weas refused because \"it would take some explaining.\" ment of the typewriters and other<br />\nEither because students aren't versed in the nuances of ac- office equipment stolen from Gilman Hall last month. The point is<br />\ncounting or because there is something else that needs<br />\nnot that the budget for the student<br />\nexplaining.<br />\nseminars will be garnished to ranWe strongly recommend that the financial records having<br />\nsom<br />\nthe typewriters, but that<br />\nto do with plant expenditures be examined closely to avoid<br />\nwhat happened at Morgan.<br />\nPeter J. Koper<br />\n<br />\nRoger C. Toll<br />\n<br />\nMr. Lyon Rogers<br />\nDirector, Placement Center<br />\nThe Johns Hopkins University<br />\nDear Sir:<br />\nThe Dow Chemical Company will be interviewing students for<br />\npermanent and summer employment on cwnpus December 4 and 5.<br />\nDow Chemical is engaged in the production of napalm, a cruel and<br />\ninhunian instrument of war. The napalm made by Dow is used by the<br />\nAmerican armed forces in their aggression against the people of<br />\nVietnam.<br />\nWe feel that the university has a duty to make a moraljudgement<br />\non recwitment and that the university community as a whole, and<br />\nnot the placement centre, should decide whether these recruiters are<br />\nto be allowed on campus. We demand the cancellation of the visit of<br />\nthe Dow recruiters and challenge you to a public debate on the issue<br />\nof on-campus recruiting.<br />\nIf no reply to this letter is received by noon Wednesday we will<br />\nfeel justified in taking direct action in this matter.<br />\nRespectli141'<br />\n<br />\nObit For Mac<br />\n<br />\nFooling With The Food<br />\n<br />\nAd Hoc Committe on Campus Recruitment<br />\nmore money would probably have where they feel the need is greatbeen available for an educational est by assuming some of the resproject had the larceny not ponsibility for academic \"developoccu red.<br />\nment\" (the polite word in the<br />\nThe limited resources for the trade for finding money).<br />\nseminars on interpretation, inciThe first of the seminars spondentally, stimulated some of the sored by the hermeneutical stustudents involved to explore the dents will be a visit by Monroe<br />\nfine art of scrounging. By identi- Beardsley of Swarthmore College<br />\nfying other administrative officers during December. Professor Beardwith descretionary budgets, they sley, a distinguished undergraduate<br />\nwere able to augment several of teacher, is the President of the<br />\nthe leanly financed seminars on a American Society for Aesthetics,<br />\n\"matching-funds\" basis. For one the author Aesthetics: Problems in<br />\nseminar, they may also be able to the Philosophy of Criticism and of<br />\nfind matching funds from other a comprehensive history of aesthetics published last year; he will<br />\ninstitutions in the area.<br />\nIn an economic environment address himself to some possible<br />\nwhere the University can hardly applications of recent analysis of<br />\nincrease further the price of its illocutionary acts by philosophers<br />\nproduct (tuitions) or call for a tax of language to the interpretation<br />\nsur-charge, some ingenuity at the of poetry. Other seminars, during<br />\nlocal level in combining small bud- January and February, will deal<br />\ngets or in discovering external sup- with topics such as the interpretaport for worthwhile projects can tive role of the director (\"From<br />\nrelieve somewhat the chronic need Text to Production\"), of the musito cut, compromise, and defer in- cian (\"From Score to Perfornovation in the academic program. mance\"), the shaping-up of a poem<br />\nWithin the limits imposed by their and the revision of a novel, \"unprimary jobs, the students and derstanding\" a painting, a buildfaculty can, in fact, help to supple- ing, and a film; the term will con(Continued on Page 7)<br />\nment existing funds in those areas<br />\n<br />\nRepublican Bias<br />\n<br />\nParticipatory Tyranny<br />\nDow Chemical comes to this campus this week to recruit employees. The S.D.S. hopes to stop it. The result is that the whole moral<br />\nand political legitimacy of protest is destroyed, and that participatory democracy becomes tyranny.<br />\nEveryone, ideally, should have their say. And everyone should<br />\nhave the freedom to choose. The Dow protestors have chosen to<br />\nabandon legitimate protest and to enter into quisling tyranny.<br />\n<br />\nThe Gold Rush. Circa 1967<br />\n11AVE A DREAM OF A<br />\nEOROPEAM OriJtotJ. LET'S<br />\nCALL. IT FRANCE<br />\n<br />\nGone With the Wind<br />\nBy KENNETH W. BOND<br />\nRepublican National Chairman<br />\nRay.Bliss was dead wrong when he<br />\nsaid the November 7 election results indicate \"that the upsurge in<br />\nRepublican strength which began<br />\nin 1966 is continuing.\" In reality,<br />\nit was a poor night for the GOP.<br />\nRepublican gains in New Jersey,<br />\nKentucky, and Hartford, Conn.<br />\nmust be deemed truly insignificant when considering the Democrats swept control of nine major<br />\nU.S. cities: San Francisco, San Diego, Gary,Cleveland, Toledo, New<br />\nHaven, Boston, Philadelphia, and<br />\nBaltimore.<br />\nHere at home, the humiliation<br />\nstemming from the mayorality<br />\nrace was not due to Arthur Sherwood's defeat, but because he was<br />\nliterally creamed. It was a foregone conclusion to everyone that<br />\nSherwood would lose; his campaign was admittedly an \"exercise in futility.\" But to think that<br />\nhe received less than 20 per cent<br />\nof the popular vote, coupled with<br />\nthe fact that Democrats uniformly<br />\ndefeated Republican (with one exception) in all six City Council<br />\ndistricts by overwhelming margins from 3-1 to 10-1, leads one to<br />\nask the question: \"What ever happened to the two-party system in<br />\nBaltimore?\" If it ever was, it surely is dead now.<br />\nThe factors which explain Baltimore's one party inanopoly begin<br />\nwith the Democrats' commanding,<br />\nfive to one voter registration margin. Baltimoreans are known to<br />\nhappily cross lines if the other<br />\n<br />\nparty presents a better man. Thus,<br />\nTheodore McKeldin and Spiro<br />\nAgnew have carried the day in recent elections. A more significant<br />\nfactor is evidenced by the continuous emmigration of the usually<br />\nRepublican middle and high income families, leaving the city<br />\nlimits inhabited by low-income<br />\npersons and minority groups - who<br />\nremain hypnotized by the New<br />\nDeal era and are, therefore, loyally<br />\nDemocratic.<br />\nMost important, one must consider the campaign itself. Political<br />\ntheory has it that the best way to<br />\nupset a one-party monopoly is for<br />\nthe out-party to sponsor extremely<br />\nattractive candidates. Again, McKeldin and Agnew are prime examples. In many ways Sherwood<br />\ncould have been attractive to the<br />\nvoters, but in fact he was not.<br />\nFirst,Sherwood received negligible<br />\nsupport from his own party. No<br />\none wants to back a loser; thus,<br />\nthere were no finances for a dynamic publicity campaign. In addition, there was no campaign organization, no volunteer corp ringing doorbells, no active \"youth<br />\nfor Sherwood.\"<br />\nSecond, there was Sherwood<br />\nhimself: a nice guy, and all that,<br />\nbut hardly the \"John Lindsay of<br />\nBaltimore\". He failed to motivate<br />\nand inspire his partisans the way<br />\nAgnew did in 1966. His public<br />\nimpression was many times that of<br />\nfrustrated and confused man not<br />\nsure at all of what he was supposed<br />\nto be doing. Thus, as the results<br />\nshow, he didn't instill much coot -<br />\n<br />\ndence in the voters.Yet, in priyate.<br />\nSherwood was no coward He<br />\nstood up against the war, accosted<br />\nthe Great Society for lack of federal revenues to rebuild his city,<br />\nand deplored the corruption embedded in his opposition.<br />\nFinally, there was Tommy<br />\nD'Alesandro III - - Baltimore's<br />\nMayor-elect. He pocketed the<br />\nmonopoly on everything: the magnetic name, billboards, bus signs,<br />\nT.V. - radio advertisement (\"The<br />\nAnswer is D'Alesandro<br />\n\"), and<br />\nthe votes: five of his to every one<br />\nof Sherwood's. He couldn't lose<br />\nshort of a national catastrophy.<br />\nThus, he aired no issues, presented<br />\nno alternatives, and made no rational appeals. He didn't have to;<br />\nhe won the mayorship in the Democratic primary.<br />\nThe tragedy of this election is<br />\nnot that the Republicans ought to<br />\nhave won. D'Alesandro probably<br />\nwon't do anything so terrible as<br />\nmight have required Sherwood to<br />\nsave Baltimoreans from it. The<br />\ntragedy is that there is no longer a<br />\nhealthy two-party system. D'Alesandro is accountable only to his<br />\nparty, not to Baltimore citizens.<br />\nSince there is no loyal opposition<br />\nto check his administration,<br />\nD'Alesandro is free to govern as he<br />\npleases. We can only hope that he<br />\nwill choose to do so in an efficient and responsible in<br />\nMeanwhile, the Republican party<br />\nhas been wiped out of Baltimore;<br />\nit is gone with the wind, When, or,<br />\nif, a viable GOP will return to challenge the city's inner machine is<br />\nanybody's guest.<br />\n<br />\n411<br />\n<br />\n\fHOMEWOOD,BALTIMORE,DECEMBER 1,1967<br />\n<br />\nPAGE FIVE<br />\n<br />\nNEWS-LETTER<br />\n<br />\nGolden Age Celebrated at Walters<br />\n<br />\n•<br />\nI.<br />\n<br />\nBy BILL SAKOWICH<br />\nWalters Art Gallery has seemingly developed into the sort of<br />\nestablishment which creates interest only for the member of the<br />\nBaltimore Chamber of Commerce<br />\nwho will mention it in a brochure<br />\nfor prospective residents, to prove<br />\nthat the city of monuments is a<br />\nculturally alive metropolis.<br />\nHaving its nativity from the<br />\nwealthy Walters' private collection,<br />\nthe museum is based in what used<br />\nto be the old family homestead.<br />\nThrough the museum's needs,however, chez Walters has become a<br />\ncurious conjugation of the Baroque and the Modern. Previously,<br />\nto set the tone for the ancient and<br />\nRenaissance works, the museum,<br />\nhad kept its setting appropriate<br />\nfor its ennumerable esoteric displays.<br />\nAvant Garde Jigsaw<br />\nYet a strange thing is happening to the gallery today. It is desperately attempting to change its<br />\nimage from a stodgy attic to a<br />\ngenuine museum and art gallery<br />\nwhere Albert Common can browse<br />\nthrough and soak up some crudi-<br />\n<br />\nii<br />\n<br />\n•••<br />\n<br />\ntion for his culturally deprived<br />\nsoul. For example, one may see a<br />\nrather stunning enamel from<br />\nFrance displayed in a neo-modern<br />\nchurch setting that looks strangely<br />\nlike a Hutzler's Christmas display,<br />\nor purchase a jugsaw puzzle of<br />\n\"Alexander the Great Enthroned<br />\nat Persepholis\" by Nizami, or<br />\nChristmas Cards with Renaissance<br />\npaintings on the front.<br />\nArtistic Crop Rotation<br />\nOne can definitely become frustrated working in an establishment<br />\nwith so much potential that lies<br />\nfallow. It can be said without<br />\nquestion that the Walters' Art gal-<br />\n<br />\nlery is the best<br />\nmuseum in the<br />\ncity, and one of<br />\nbest of its kind in<br />\nthe nation. It houses many originals, from Raphael to El Greco,<br />\n0has a striking collection of French<br />\nEnamels, and an<br />\nextensive display<br />\nof Ancient Greek<br />\nEgyptian<br />\nand<br />\nsculpture. On display in the museum is a jewelled<br />\nmarten's head that is a rare example of a fashionable artistic vogue<br />\nwhich appeared in Europe in the<br />\nFifteenth and sixteenth centuries.<br />\nWhat makes the situation even<br />\nmore frustrating is the fact that<br />\nthere is not enough room in the<br />\nmuseum to display the entire collection at one time, and so various<br />\nexhibits must be rotated from the<br />\nhalls to the basement.<br />\nHaven for Students<br />\nThe museum is a haven for all<br />\nart students who wish to supplement their education, and for the<br />\nlayman to become aware of the<br />\nartistic heritage of the ages; a heritage that is reincarnate on canvas.<br />\nWalters also presents concerts<br />\nfeaturing Peabody ensembles, at<br />\nwhich the audience is at liberty to<br />\npromenade about the premises to<br />\nenrich the appreciation of the<br />\nmusic.<br />\nAttendance Poor<br />\nBut on the main, attendance at<br />\nthese concerts is poor. The Gallery goes unnoticed or ignored by<br />\na greater part of the city. The<br />\nGallery is left to those few of the<br />\nupper class who wish to appreciate the \"finer things in life\", unruly, chattering children who are<br />\nthankful to escape the boredom of<br />\nthe classroom, or to the dull borgeosie who wish to escape the<br />\nstillness of a Sunday afternoon.<br />\nThe rest of the city is content to<br />\nworship at the tabernacle on Thirty-third street, or pick up their<br />\nculture packaged at a local cinema<br />\nor discotheque.<br />\n<br />\nYet Walters still waits patiently<br />\non Charles Street for those interested with its cycle of exhibits and<br />\nunattended Peabody Concerts. The<br />\npaint on the portrait of the found*<br />\n<br />\ner, William Walters, may be cracking around the forehead, but the<br />\ngallery is secure in the knowledge<br />\nthat the painting will be eventually<br />\nrestored.<br />\n***<br />\n<br />\nRUSH VIOLATION<br />\nPhi Kappa Psi fraternity was<br />\nfound guilty of a major rush<br />\nviolation by the IFC Judicial<br />\nBoard. Phi Psi was fined $200<br />\nfor holding an illegal \"dirty\"<br />\nparty with freshmen present.<br />\n<br />\nA Periclean Banzai<br />\nDr. Edward N. Lee, Associate Professor of Philosophy,<br />\nwill be the special guest at the<br />\nStudent-Faculty Coffee Hour<br />\non Thursday, December 7, at<br />\n4:00 p.m. in the Sherwood<br />\nRoom of Levering Hall.<br />\n<br />\nGet high with<br />\na little help from<br />\nyour friends.<br />\nYOU HAVE A FRIEND AT<br />\n<br />\nTHIE Eli:01111C: DIRCUIS*<br />\nT.qatcc<br />\n<br />\npuir.t PiTeirrM7NP A 1PhAYr5<br />\n<br />\nCAST YIlleCI. N.Y.C.<br />\n<br />\nNOTE: Represent the Electric Circus on<br />\nYour campus! Sell tickets and arrange<br />\nPrivate parties. Earn commissions! Call:<br />\n(212) 777-4466, or write: Ed Plum at the<br />\nabove address.<br />\n.im • ©<br />\n<br />\n1957 Electric Cloys of Neer York. Mc Pat. Perri<br />\nCoffee in the Think Tank.*<br />\n<br />\nSTAMP IT!<br />\nIT'S THE RAGE<br />\nREGULAR<br />\nMODEL<br />\nANY $<br />\n<br />\n3 LINE TEXT<br />\nThe finest INDESTRUCTIBLE METAL<br />\n1<br />\n2\" 2-.<br />\nPOCKET RUBBER STAMP. /<br />\nSend check or money order. Be<br />\nsure to include your Zip Code. No<br />\nPostage or handling charges. Add<br />\nsales tax.<br />\nPrompt shipment. Satisfaction Gust-limbed<br />\nTHII MOPP CO.<br />\nP. 0. lox 18623 Lef1011 Square Stalin<br />\nATLANTA, GA., 30326<br />\n<br />\n\"SroKELY CARikalcHAEL in Dar es<br />\nSalaam alter a couple of weeks<br />\nWith Ho Chi Minh across the<br />\nwater, accused Negro African lead \"s of failing to fight the fight.<br />\nC armichael urged them to get<br />\n4un5 (by killing the armed<br />\nPolicemen and soldiers) and<br />\ntart shooting. Africans, he said,<br />\nmust learn to hate and fight.' A few<br />\nr\"re declarations on that order,<br />\n'<br />\nI nd old Stoke<br />\nFor a free copy of<br />\nWm. F. Buckley's NA<br />\nbe up for a<br />\nTIONAL REVIEW,<br />\nN obel Peace<br />\nwrite: 150 E. 35 St.,<br />\nPrize....<br />\nN.Y., N.Y. 10016. Student rote: $3.89 for<br />\n18 issues.<br />\n<br />\nthe burn steer - leather boutique<br />\n(.)<br />\n224 w. read at tyson<br />\nlarEit3r4<br />\n.0) 194<br />\n<br />\n\fPAGE SIX<br />\n<br />\nHOMEWOOD,BALTIMORE, DECEMBER 1, 1967<br />\n<br />\nNEWS-LETTER<br />\nEx Rx Rx Ex Rx Ex Rx Rx<br />\n<br />\nAll Types of Subs<br />\nSnacks — Beer<br />\n<br />\nYOUR<br />\nPRESCRIPTION<br />\nDRUGSTORE<br />\n<br />\nOPEN TILL 1 :00<br />\n7 DAYS A WEEK<br />\n<br />\nB & M SUB SHOP<br />\n31st & GUILFORD<br />\n<br />\nSOS to Greet Dow as Council Ducks Issue<br />\n(Continued from Page 1)<br />\n<br />\nGREEN WAY<br />\nPHARMACY<br />\n34th & CHARLES<br />\nRx Rx Rx Rx Roc Rx<br />\n<br />\nreserved the right to take action if<br />\nany demonstration exceeded the<br />\nbounds of orderliness.<br />\nThe Administration has made<br />\nno mention of the SDS actions in<br />\nrespect to the CIA cancellation.<br />\nThe Student Council briefly<br />\ntook up the issue of controversial<br />\nrecruiters on campus Monday,<br />\nNovember 27. Ken Bond proposed<br />\nthat the Council take a stand de-<br />\n<br />\nTRW is success by association<br />\n<br />\nEugene Noth, MS<br />\nTracking & Analytical Simulation<br />\n<br />\nRonala Werner, Ph.D.<br />\nGuidance 6 Control<br />\n<br />\nAndre Blaufuss, BS<br />\nGuidance & Mission Simulation<br />\n<br />\nfending the right of students to<br />\nprotest Dow recruiters to the point<br />\nthat they do not interfere with<br />\nthose students seeking interviews<br />\nwith Dow.<br />\nIt was the sense of the Council<br />\nthat the proposal was ambiguous<br />\nand ireelevant. Greg Mertz offered<br />\na resolution condemning Dow for<br />\nits manufacture of napalm.<br />\nJed Luchow argued that such a<br />\ndecision had to be predicted by a<br />\nvote for or against the Vietnam<br />\nWar, and that the Council was<br />\nneither responsible for nor capable<br />\nof making moral judgements on<br />\nthe practices of business concerns.<br />\nBefore an opportunity was given to defend the motion, Luchow<br />\nmove that the meeting be adjourned,leaving the issue up in the<br />\nair. The vote to adjourn was 10-7.<br />\nJim Winship, Bill Betcher, Jack<br />\nKirk,Greg Mertz and Manuel Rodriguez were among those Council<br />\nmembers who felt the necessity<br />\nfor that body to handle the question immediately, and voted not<br />\nto adjourn.<br />\nThe Student Councils of several<br />\n-universities and colleges, among<br />\nthem Amherst, University of Pennsylvania, Brooklyn College and<br />\nOberlin, have taken strong stands<br />\nagainst on-campus recruitment by<br />\nthe military, the CIA, and DOW<br />\nand or against retribution taken by<br />\ntheir Administration against those<br />\nwho protested the recruiters.<br />\n<br />\nanwit.\"<br />\n411t:.*il%'::•.•<br />\n••••• ••<br />\nJames Austin, MS<br />\nSystems Analysis d Software<br />\n<br />\neildt<br />\nDon Bowyler, MS<br />\nElectronic Reconnaissance<br />\n<br />\n1<br />\n<br />\nJoseph Kawamura, Ph.D.<br />\nSpace Guidance<br />\n<br />\n• Favorite Rendes Wu<br />\nfor Hopkins Men<br />\n<br />\nJIMMY WU'S<br />\nNEW<br />\nCHINA INN<br />\nCborles Street below 25th<br />\nrtmlsty WU'S<br />\nCARRY OUT SHOP<br />\n1411 E. Cold Spring Lane<br />\n••••••ft<br />\n<br />\n,,G44611111111,„<br />\n„__<br />\nFloyd Thomas, Ph.D.<br />\nAdvanced Technology<br />\n<br />\nRoger Burnell, MS<br />\nTelecommunications<br />\n<br />\nJames Martin, MBA<br />\nMaterial<br />\n<br />\nLawrence Fink, BA<br />\nSub-Systems Programming<br />\n<br />\nFrom Los Angeles to Houston to Washington,from Space<br />\nSystems to Ocean Systems to Information Systems,<br />\nyoung people are making things happen at TRW.<br />\n<br />\nTake a look around any TRW 'location.<br />\nThe young faces outnumber the old by<br />\na good margin. The vast majority of<br />\nscientists and engineers you'll meet are<br />\nunder thirty, or forty at least. Why?<br />\nBecause we depend 041 young ideas,<br />\nnew ideas, fresh ideas. That's why we<br />\nneed you.<br />\nWhat kind of a place is TRW? Ask<br />\naround. Talk to your professors and<br />\nfaculty advisors, or your friends who are<br />\nalready working with TRW. Most of our<br />\nprofessional employees applied to TRW<br />\non the recommendation of friends.<br />\nHere are some of the disciplines where<br />\nnew graduates may find career opportunities at TRW:<br />\n<br />\nComputer Sciences/Analytical<br />\nResearch / Aerosciences / Information Systems / Digital Systems / Communications Systems/Reliability/<br />\nGuidance & Control / Sensor Systems<br />\n/ Microelectronics / Electric Power J<br />\nSpace Vehicle Design / Antenna Systems Design and Analysis / Mechanical Engineering / Product Assurance /<br />\nIntegration & Test / Systems Engineering / Circuit Design / Electronic Countermeasures & Electronic Intelligence<br />\nSystems<br />\nIf you'll be receiving your,.degree<br />\n(Ph.D., MS or BS) in Engineering or<br />\nScience this year, check with your<br />\nPlacement Director and talk with us<br />\n<br />\nwhile we're on campus. If you can't<br />\nmake it at that time and would like to<br />\nbe considered for openings in the Los<br />\nAngeles area, Houston or Washington,<br />\nsend your resume to:. W. D. Mclvers,<br />\nCollege Relations, TRW, One Space<br />\nPark, Redondo Beach, California 90278.<br />\n<br />\nAn Equal Opportunity Employer<br />\n<br />\nTRW<br />\n<br />\nTRW (formerly Thompson Rams Wooldridge) is 60,000 peopli. at 200 operations around the<br />\nworld who are applying advanced technology to space, defense, automotive, aircraft, electronics and<br />\n<br />\nindustrial markets,<br />\n<br />\nENGINEERS AND SCIENTISTS<br />\n<br />\nTRW CAMPUS INTERVIEWS<br />\nFriday, December 1, 1967<br />\nSEE YOUR PLACEMENT OFFICE<br />\n<br />\nART WILLIAMSON<br />\nBSME,U. of Maryland,<br />\nwas assigned to the<br />\nbig blooming mills at<br />\nour Sparrows Point, Md.,<br />\nPlant soon after joining<br />\nBethlehem's 1963<br />\nLoop Course. Art is<br />\nresponsible for training of<br />\npersonnel and start-up<br />\nof new facilities. He's also<br />\nliaison man between<br />\nthe mill and plant<br />\nengineering for a<br />\n$17-million improvement<br />\nprogram.<br />\nMANAGEMENT<br />\nMINDED?<br />\nCareer prospects are<br />\nbetter than ever at<br />\nBethlehem Steel. We need<br />\non-the-ball engineering,<br />\ntechnical, and liberal arts<br />\ngraduates for the 1968<br />\nLoop Course. Pick up a<br />\ncopy of our booklet at your<br />\nplacement office.<br />\nAn Equal Opportunity<br />\nEmployer in the Plans for<br />\nProgress Program<br />\n<br />\nBETHLEHEM<br />\nSTEEL 0ETH Htm<br />\nST EL<br />\n<br />\n—16<br />\n<br />\n\f11ON1EWOOD, BALTIMORE. DECEMBER 1,19o7<br />\n<br />\nNMS-LETTER<br />\n<br />\nBurns Instated<br />\nRoot ofPratAll<br />\nEvil<br />\nLibrary is, in turn, helping to<br />\nAs Fund Head elude with several symposia, in- traint and<br />\nfund students interested<br />\n2)<br />\n(('ontinued from Pag: 4)<br />\n<br />\n(Continued from l'age<br />\n<br />\nmajor. He , then attended Columbia University and earned his M.A.<br />\nand Doctor of Education degrees.<br />\nFrom 1948 to 1952 he served<br />\nas executive director of the American Camping Association in Chicago. Dr. Burns than became assistant to the vice chancellor at<br />\nNew York University from 1952<br />\nto 1955, followed by three years<br />\nyears as vice president of Reed<br />\nCollege in Portland, Oregon.<br />\nIn 1962 he earned a second<br />\ndoctoral degree from New York<br />\nUniversity. He is author of several<br />\nbooks, including: Program of the<br />\nModern Camp, Administrators in<br />\nHigher education, and Trustees in<br />\nHigher Education. His research interests have been mainly in the<br />\nfield of higher education administration.<br />\nStarts January 1<br />\nDr. Burns is a member of the<br />\nAmerican Academy of Social Sciences, the Association for the Advancement of Science, the Association of Higher Education, the<br />\nPublic Relations Society of America, Phi Epsilon Kappa and Phi<br />\nDelta Kappa.<br />\nlie has held summer and evening teaching positions at Columbia<br />\nUniversity, Northwestern, University of Colorado, New York University, Rutgers and the University<br />\nof Iowa.<br />\nHe has awarded an honorary<br />\ndegree from Alliance College in<br />\n1960 and received a Founders Day<br />\nAward from New York University in 1963.<br />\nDr. Burns will take up his Johns<br />\nHopkins duties full time around<br />\nJanuary 1.<br />\nGIRLS IN LIBRARY<br />\nThe University Library Committee has granted approval to<br />\nthe Student Council's proposal<br />\nthat each Hopkins student be<br />\npermitted to bring a guest into<br />\nthe Eisenhower Library during<br />\nthe evening hours, from 4:00<br />\np.m. until midnight, and on<br />\nweekends, from 8:00 a.m. until midnight.<br />\nThis decision is being initiated on a three month trial period. Unless there are serious<br />\nabuses, the ruling will become<br />\na permanent policy of the Library. Students will have to<br />\nsign their guests in and out.<br />\nSenior class President John Kirk<br />\nwas instrumental in obtaining<br />\nthe Committee's approval.<br />\n<br />\nCalling all<br />\n<br />\nCLOTHES<br />\nHORSES!<br />\ncheck the<br />\nquality and<br />\nvalue at<br />\nTHE<br />\n<br />\nSAMPLE<br />\nSTORE<br />\nEVERY SUIT<br />\nIN OUR STOCK<br />\nValues to<br />\n$65.00<br />\n<br />\ncluding discussions of \"the literature of the absurd- and of \"pornography and the Iiinits of art.- The<br />\nstudents planning the sessions hope<br />\nto open the seminars to any members of the community who have a<br />\nspecific interest in the topic under<br />\ndiscussion.<br />\nIf 1 may be allowed one last delinquent erratum. the statement in<br />\nan earlier issue that the Hopkins<br />\n\"administration- has never given<br />\nany support to the lively interest<br />\nin film study and film making on<br />\nthe campus is not entirely accurate.<br />\nAs in the case of the current seminar project, individual administrators have responded sympathetically to appeals from students engaged in film projects. For instance, two years ago Dean Shaffer<br />\nmanaged to find $400 somewhere<br />\nin the machinery so that a group<br />\nof students could complete a narrative film based on Kafka's \"Ein<br />\nBrudermord.\" The recent purchase<br />\nof a print of this film by the Enoch<br />\n<br />\nsupport current fihn projects<br />\n(which are also aided by a grant<br />\nfrom the SAC). Members of the<br />\nSocial Relations Department are<br />\nhelping to train and fund students<br />\ninterested in doing a documentary<br />\non simulation games. In the longer<br />\nperspective, however, most of the<br />\nstudents involved with film study<br />\nearly recognized that the sort of<br />\nmassive support necessary for a<br />\ncomprehensive film program (production funds, finishing studio.<br />\ncinematheque, library and \"readder\")could never claim a very high<br />\npriority on the allocation of general funds from the University's<br />\nbeleaguered budget. They saw that<br />\nsuch a program will need nnjor<br />\nsupport from new sources of funds<br />\noutside the academy. The same<br />\nstudents expended considerable<br />\ntime and ingenuity in identifying<br />\nsuch possible areas of support, in<br />\nresearch on technical and academic<br />\nneeds. and in articulating an ima(('ontinued on Page 8)<br />\n<br />\nReport<br />\nto your<br />\nlocal wing<br />\ncommander<br />\n<br />\nGRAEME CLARKE<br />\nTWA Campui Representative<br />\n<br />\nHe has command<br />\nof a 172-jet fleet and<br />\nthe whole world of<br />\nTWA. He's waiting<br />\nto set you up for an<br />\nadventure—any place<br />\nin the U.S., Europe, Asia or Africa.<br />\nIf you're shopping for facts and figures<br />\nor a 50/50 Club card, good for half fare<br />\ntravel in the U.S., he's the man to see.<br />\nYou know what they say about all work<br />\nand no play. So call Graeme at 666-0064<br />\nor 837-6200. And start packing.<br />\nP. S. Attention College Bands, Combos, Vocal Groups. Don't<br />\nforget the National Championships at the 1968 Intercollegiate<br />\nJazz Festival sponsored by TWA. For information write: IJF,<br />\nBox 246, Miami Beach, Florida 83139.<br />\n<br />\n*29<br />\nSAMPLE STORE<br />\n3031 Greenmount Ave.<br />\n<br />\nin Waverly<br />\nOPEN EVERY EVENING<br />\n<br />\nDMA IT • Ng • $1000) CIS<br />\n<br />\nWelcome<br />\nto the world of<br />\nTransWorld Airlines*<br />\n...the all-jet airline<br />\nOkrvice mark owned exclusively by Trans World Airlines, Inc.<br />\n<br />\nPAGE SEVEN<br />\nWe need your head in our<br />\nbusiness<br />\n<br />\nSt Paul Barber Shop<br />\n3120 St. Paul St.<br />\nACtOSS<br />\n<br />\nfrom EdMe s<br />\n<br />\nJOHN P. NUGENT, JR.<br />\nLife & Health<br />\nInsurance<br />\nCompare<br />\n<br />\n243-7961<br />\n<br />\n4'41 on earls mzithui.<br />\n(By the author of \"Rally Round the Flag,Boys!\",<br />\n\"Doke Gillis,\" etc.)<br />\n<br />\nFOOTBALL FOR SHUT-INS<br />\nAt next Saturday's football game while you are sitting<br />\nin your choice student's seat behind the end zone, won't<br />\nyou pause and give a thought to football's greatest and,<br />\nalas, most neglected name? I refer, of course, to Champert<br />\nSigafoos.<br />\nChampert Sigafoos (1714-1928) started life humbly on<br />\na farm near Thud, Kansas. His mother and father, both<br />\nnamed Walter, were bean-gleaners, and Champert became<br />\na bean-gleaner too. But he tired of the work and went to<br />\nMontana where he got a job with a logging firm. Here the<br />\nerstwhile bean-gleaner worked as a stump-thumper. After<br />\na month he went to North Dakota where he tended the<br />\nfurnace in a granary (wheat-heater). Then he drifted to<br />\nTexas where he tidied up oil fields (pipe-wiper). Then to<br />\nArLona where he strung dried fruit (fig-rigger). Then<br />\nto Kentucky where he fed horses at a breeding farm (oattoter). Then to Long Island where he dressed poultry<br />\n(duck-plucker). Then to Alaska where he drove a delivery<br />\nvan for a bakery (bread-sledder). Then to Minnesota<br />\nwhere he cut up frozen lakes (ice-slicer). Then to Nevada<br />\nwhere he determined the odds in a gambling house (dicepricer). Then to Milwaukee where he pasted camera<br />\nlenses together (Zeiss-splicer).<br />\nFinally he went to Omaha where he got a job in a tannery, beating pig hides until they were soft and supple<br />\n(hog-flogger). Here occurred the event that changed not<br />\nonly Champert's life, but all of ours.<br />\nNext door to Champert's hog-floggery was a mooring<br />\nmast for dirigibles. In flew a dirigible one day, piloted by<br />\na girl named Graffa von Zeppelin. Champert watched<br />\nGraffa descend from the dirigible, and his heart turned<br />\nover, and he knew love. Though Graffa's beauty was not<br />\nquite perfect—one of her legs was shorter than the other<br />\n(blimp-gimper)—she was nonetheless ravishing, what<br />\nwith her tawny hair and her eyes of Lake Louise blue and<br />\nher marvelously articulated haunches. Champert,smitten,<br />\nran quickly back to the hog-fioggery to plan the wooing.<br />\nTo begin with, naturally, he would give Graffa a present. This presented problems, for hog-flogging, as we all<br />\nknow, is a signally underpaid profession. Still, thought<br />\nChampert, if he had no money, there were two things he<br />\ndid have: ingenuity and pigskin.<br />\nSo he selected several high grade pelts and stitched<br />\nthem together and blew air into them and made for Graffa<br />\na perfectly darling little replica of a dirigible. \"She will<br />\nlove this,\" said he confidently to himself and proceeded to<br />\nmake ready to call on Graffa.<br />\nFirst, of course, he shaved with Personna Super Stainless Steel Blades. And wouldn't you? If you were looking<br />\nto impress a girl, if you wanted jowls as smooth as ivory,<br />\ndewlaps like damask,a chin strokable, cheeks fondlesome,<br />\nupper lip kissable, would you not use the blade that<br />\nwhisks away whiskers quickly and slickly, tuglessly and<br />\nnicklessly, scratchlessly and matchlessly? Would you not,<br />\nin short, choose Personna, available both in Injector style<br />\nand double-edge style? Of course you would.<br />\n<br />\nSo Champert, his face a study in epidermal elegance,<br />\nrushed next door with his little pigskin dirigible. But<br />\nGraffa, alas, had run off, alas, with a bush pilot who specialized in dropping limes to scurvy-ridden Eskimo villages (fruit-chuter).<br />\nChampert, enraged, started kicking his little pigskin<br />\nblimp all over the place. And who should walk by just<br />\nthen but Jim Thorpe, Knute Rockne, Walter Camp, and<br />\nPete Rozelle!<br />\nThey walked silently, heads down, four discouraged<br />\nmen. For weeks they had been trying to invent football,<br />\nbut they couldn't seem to find the right kind of ball. They<br />\ntried everything—hockey pucks, badminton birds, bowling<br />\nballs, quoits—but nothing worked. Now seeing Champert<br />\nkicking his pigskin spheroid, their faces lit up and as one<br />\nman they hollered \"Eureka!\" The rest is history.<br />\n* * *<br />\n©1967, Max Shulman<br />\nSpeaking of kicks, if you've got any about your present shave cream, try Burma-Shave, regular or menthol.<br />\n<br />\n\fHOMEWOOD,BALTIMORE, DECEMBER 1, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE EIGHT<br />\n<br />\nMacksey<br />\n(Continued from Page 7)<br />\n<br />\nginative experimental program.<br />\nThey received substantial advice<br />\nand encouragement from men in<br />\nthe profession as well as from Dr.<br />\nEisenhower and Mr. Walters of the<br />\nHopkins Fund. This sort of involvement by students, aided by<br />\nalumni and other professional contacts, could be an important contribution to any development program aimed at rescuing some of<br />\nthe academic poverty pockets<br />\nwhich Mr. Sloan has been visiting.<br />\n<br />\nNewspaper Slants Peabody's<br />\nAnalysis in Attack on Dems<br />\n<br />\nBy CHARLES WOOD<br />\nAn article written by Dr. Robert L. Peabody of the Political<br />\nScience Department,entitled \"Party Leadership Changes in the<br />\nHouse of Representatives\", caused<br />\na stir in Washington last week.<br />\nDr. Peabody's article, which<br />\nappeared in the American Political<br />\nScience Review, presented nonpartisan survey of Democratic and<br />\nDr. Richard Macksey Republican leadership in the House<br />\nsince.1955. According to Peabody,<br />\nFROSH B-BALL<br />\nthe Washington Post, in an editorial on Nov. 20, misused this article<br />\nThere will be a freshman<br />\nas the basis for an attack on Debasketball scrimmage against<br />\nmocratic leadership in general, and<br />\nthe University of Maryland,<br />\nHouse Speaker John McCormack<br />\nBaltimore County campus on<br />\nin particular.<br />\nMonday, Dec. 4, at 4:00 p.m.<br />\nThe Post editorial said that<br />\nthe Speaker McCormack \"is no<br />\nFRESHMAN LACROSSE<br />\nlonger in touch with the dynamic<br />\nThere will be an organiza- elements in his party in the House\"<br />\ntional meeting today at 4:30 and that his \"continuation in the<br />\np.m. in the Athletic Center Speakership is a symbol of the<br />\nacute hardening of the arteries<br />\nClassroom for all potential<br />\nfrom which the Congress in genfreshman lacrosse candidates.<br />\n4 eral is suffering\". According to the<br />\n<br />\nGridders Gain Championship;<br />\nReverse Long Losing Streak<br />\n<br />\nPost, Dr. Peabody explains Speaker McCormack's long tenure by<br />\nstating that it is due to the majority status of the Democrats.<br />\nHowever, Dr. Peabody states<br />\nthat he did not infer that Speaker<br />\nMcCormack's position was merely<br />\nan effect of Democratic majority,<br />\nbut also because of the method by<br />\nwhich the Democrats select their<br />\nleaders. While Dr. Peabody said<br />\nthat \"the longer the period of<br />\nmajority status, the more likely<br />\nthe majority party is to develop<br />\nestablished patterns ofsuccession,\"<br />\nhe did not say that this is peculiar<br />\nto the Democrats as the editorial<br />\nimplies.<br />\nThe Post editorial states that<br />\n\"the Republican changes were<br />\nbrought about, not by routine advancement up the leadership ladder, but by means of revolts within the party which led to vigorous<br />\ncontests,\" and advocates these \"revolts within the party\" as the best<br />\nway to solve leadership problems<br />\nin Congress.<br />\nDr. Peabody stated that this<br />\ncharacteristic stems from the fact<br />\nthat the GOP is \"more prone to<br />\nintra-party leadership changes<br />\nthrough contested means\", whereas the Democrats more often<br />\nchoose their leaders on the basis<br />\nof seniority. Dr. Peabody does not<br />\nsay that either method is good or<br />\nbad per se.<br />\nDr. Peabody did say that<br />\n\"House Republicans can take some<br />\nconsolation from one by-product<br />\nof overwhelming election defeats<br />\n- - it moves able younger members into position of high rank far<br />\nquick than any other means.\"<br />\n<br />\n10)<br />\nsuccess.<br />\nyear's<br />\nthis<br />\nin<br />\ntant factors<br />\nThe boys - especially the captains,<br />\nMark Perlmutter and Denny Ferrazzano seemed ready to shake off<br />\nthe tradition of losing and apathy<br />\naround here, and they did.\"<br />\nThe copious pre-game press<br />\ncoverage for the Hopkins-Western<br />\nMaryland clash of November 18, a<br />\ncontest of little practical concern<br />\nbut much symbolic importance,<br />\nseemed to center on a purported<br />\nduel between Joe Cowan and the<br />\nTerrors' ostensibly — rough defense; but, it was unsung soph<br />\nhalfback Weiss, who had been doing the team's heavy running all<br />\nyear, who finally moved into the<br />\nlimelight. Moving for 195 yeards on<br />\n30 carries including a 34 yard T.D.<br />\nrun, a performance that made him<br />\nthe Southern Division M.A.C.'s<br />\ntop rusher for the year, the 5-11,<br />\n190 pound setback was the key<br />\nfigure in Hopkins' hard-fought<br />\n13-6 win.<br />\nAfter somewhat dominating a<br />\nscoreless first half, the Jays went<br />\nahead 7-0 on Weiss's jaunt following a fumble recovery. After another Hopkins thrust was stopped inside the Terror ten yard line, the<br />\nWestminster club took off on a<br />\n96 yard T.D. drive, but its twopoint conversion try failed. The<br />\nHomewood squad then iced the<br />\nwin via a late scoring march capped by Mark Croft's short plunge.<br />\nThe triumph left Hopkins atop the<br />\nSouthern Division at 6-0; Western<br />\nMaryland and F&M were next at<br />\n3-2.<br />\nThe Western Maryland clash also marked the final Hopkins foot(Continued from Page<br />\n<br />\nOPEI<br />\n<br />\nEle l= =If I= =111 =M 11111 I= =I<br />\n<br />\n\" College Relations Director<br />\nI c/o Sheraton-Park Hotel, Washington, D.C. 20008<br />\n<br />\n\"Idon't have<br />\ntwo years'experience.<br />\nIhave oneyeartwice<br />\nSome people get experience<br />\nin a job.<br />\nOther people get older.<br />\nThere's a big difference. And<br />\nit all depends on where you<br />\nwork, and with whom you<br />\nwork. You can start some<br />\nplace that has all the proper<br />\nsystems engineering credentials — significant contracts,<br />\nmodern physical plant, and<br />\nthe usual fringe benefits —<br />\nand find yourself a couple of<br />\nyears later, just a couple of<br />\nyears behind.<br />\nOr, you can come to a place<br />\nlike MITRE and get experience. And grow. We have the<br />\ncredentials, of course.(We<br />\nhappen to think they're the<br />\nbest.) But we have something<br />\nmore. An attitude. We want<br />\nyou to get the best systems<br />\nexperience in the business.<br />\nWe want to share what we<br />\nknow with you, want you to<br />\nabsorb it as fast as you can.<br />\nThe quicker you grasp things,<br />\nthe quicker things get done.<br />\n<br />\nThe more experience you get,<br />\nthe faster you grow.<br />\nAnd that's to our mutual<br />\nbenefit.<br />\nHere's the kind of experience<br />\nyou get<br />\nMITRE is pioneering in the<br />\ndesign and engineering of<br />\ncomplex information, sensor,<br />\ncommand,control and communications systems for the<br />\nUnited States Government.<br />\nOur assignments include<br />\nprominent military electronic<br />\nsystems, as well as civilian<br />\nsystems for future national<br />\nair traffic control and high<br />\nspeed ground transportation.<br />\nWe'd like you to know more<br />\nabout MITRE<br />\nAbout what we do, how we<br />\nthink, and what it might be<br />\nlike to work with us. If you'd<br />\nlike to know more about us,<br />\nand have a degree (preferably<br />\nadvanced) in electronics,<br />\nmathematics or physics, we'd<br />\nlike to talk with you.<br />\n<br />\nINTERVIEWS WILL BE CONDUCTED<br />\nON CAMPUS DECEMBER 6, 1967<br />\nSIGN UP NOW AT THE PLACEMENT OFFICE.<br />\nOr write for more information: Mr. L.J. Glinos, College<br />\nRelations Coordinator, The MITRE Corporation, Box 208 CN8<br />\nCCO,Bedford, Massachusetts.<br />\nTHE<br />\n,<br />\nOf<br />\n<br />\n,<br />\n%MIL<br />\n<br />\nMITRE<br />\n<br />\nPlease send me<br />\n;a Sheraton Student<br />\nI.D.soIcan saveup<br />\nto20% on<br />\nSheraton rooms.<br />\n11 Name<br />\n▪ Addrem<br />\nReservations with the special low rate are confirmed in advance<br />\n<br />\n•<br />\n▪ (based on availability) for Fri., Sat., Sun. nights, plus ThanksI giving (Nov. 22-26), Christmas (Dec. 15-Jan. 1) and July I<br />\nI through Labor Day! Many Sheraton Hotels and Motor Inns offer I<br />\nstudent rates during other periods subject to availability at time<br />\nI of check-in and may be requested.<br />\n<br />\nSheratonHotels&MotorInns<br />\n<br />\ns 155 Sheraton Hotels & Motor Inns in Major Cities<br />\n=I =I 11= =I OM I= I= 4.11 =I I=<br />\nsow am 1.51<br />\n<br />\n111= =II I= =5<br />\n<br />\nJ<br />\n<br />\nball effort for eight seniors, a<br />\ngroup whose efforts Sotir praised.<br />\nThey include co-captains Perlmutter and Ferrazzano, safety and sub<br />\nquarterback Mike Shaw(\"the hardest hitter for his size we've got\"),<br />\nThomas, Komocki(\"who hung in<br />\non defense despite two knee injuries\"), Bachur (\"whose two field<br />\ngoals provided the margin in the<br />\nF&M game\"), Walt Sienkiewicz<br />\n(\"who improved steadily all<br />\nyear\"),and Scott Black.<br />\nWeiss and Cowan,with, respectively, 639 yards on 114 carries<br />\nand 463 yards on 57 tries for 5.6<br />\nand 8.1 means, provided the bulk<br />\nof the Jay ground totals. Also<br />\ncontributing were Will Scroggs<br />\n(17-83-4.9), Jeff Sienkiewica (3081-2.7), and Croft (23-71-3.1).<br />\nQuarterback Jim Feely (fourth in<br />\nSouthern Division in passing) completed 69 of 108 passes for 1264<br />\nyards (a school record) with five<br />\ninterceptions and twelve touchdowns, (another record). Cowan<br />\n(3-3 for 78 yards and a T.D.),<br />\nShaw (9-5-55 and 2 T.D.'s), and<br />\nSteve Clark(12-1-12 and one T.D.)<br />\nalso made aerial contributions.<br />\nCowan caught 27 passes for<br />\n599 yards and seven touchdowns<br />\n(a school record), Steve Latson 27<br />\nfor 458 and six scores, and Sienkiewicz eight for 128 yards. Cowan's punting average, kickoff return yardage (354), kickoff return touchdowns (two) total<br />\npoints, and touchdowns scored<br />\n(14) also set school records.<br />\nThe 1967 Baltimore Sun AllState Small College team included<br />\nthe following Hopkins players:<br />\nFirst Team (offense) End Steve<br />\nLatson, Guard Don Yablonowitz,<br />\nCenter Mark Perlmutter, and (as<br />\nmentioned) Cowan;(defense) Middle Guard Phil Schrodel; and<br />\nand (specialty) Cowan as Punter;<br />\nHonorable Mention: (Offense)<br />\nguard John Peck, Quarterback<br />\nFeely, and Halfback Weiss; (defense) Tackle Wit Holden, Linebacker Dennis Ferrazzano, and<br />\nSafety Will Scroggs.<br />\nThe team's Athletic Banquet,<br />\nwith Sun Sports Editor Bill Tanton as guest speaker, will be held<br />\non December 13. Four awards will<br />\nbe made: the Huddle Club Award<br />\nto the Hopkins player who has<br />\nmade the most outstanding contribution to football here in 1967;<br />\nthe Charles E. Aronhalt Memorial<br />\nTrophy to the team's outstanding<br />\nlineman (Aronhalt, recently killed<br />\nin South Vietnam, was captain of<br />\nthe 1963 team); the Senior Award<br />\nto the squad's outstanding senior;<br />\nand the Booster Club Unsung Hero<br />\nAward.<br />\n<br />\nThe Catholic Community<br />\nOn Campus<br />\nSUNDAY, DECEMBER 3rd<br />\n<br />\n10:30 A.M.<br />\n<br />\n'FOLK' MASS<br />\nFRIDAY, DECEMBER 8th<br />\n<br />\n12:00 Noon<br />\n<br />\nMASS FOR THE FEAST OF THE<br />\nIMMACULATE CONCEPTION<br />\n(A Holy Day of Obligation)<br />\n<br />\nCORPORATION<br />\n<br />\nAn Equal Opportunity Employer (Male & Female)<br />\nFormed in 1958 . . . pioneer in the design and development of command and<br />\ncontrol systems . . . MITRE serves as technical advisor and systems engineer<br />\nand<br />\nfor the Electronic Systems Division of the Air Force Systems Command<br />\nprovides technical assistance to the Federal Aviation Administration, the Department of Defense, the Department of Transportation and the National Aeronautics and Space Administration.<br />\n<br />\nThe above Masses will be in Levering Great Hall.<br />\nMass is also celebrated in NEWMAN HOUSE,<br />\n2941 N. Charles, Monday thru Friday.<br />\n<br />\n\fHOMEWOOD,BALTIMORE, DECEMBER 1, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE NINE<br />\n<br />\nNetniks Not Noteworthy<br />\n10)<br />\nThe probable starting lineup<br />\nfor tomorrow night's clash consists of captain Brian Berke, a 6-1<br />\njunior, and 5-8 senior Jim Calli as<br />\nguards, 6-3 senior Joe Carlton and<br />\nand 6-2 junior Bob Spence in the<br />\nforward spots, and 6-4 sophomore<br />\nRich Thielke at center, with 6-1<br />\nsenior and 5-4 junior guards Mike<br />\nSullivan and Hal Thorne and 6-5<br />\nand 6-4 soph forwards Jeff Thomas and Jim Novick likely to see<br />\nmuch action. Also available are<br />\n6-6 junior Wade Wright, 6-7 soph<br />\nBill Piotrowski, 6-2 soph Hugh<br />\nWilson, and 6-3 senior John Sweeney. Spence, out much of the preseason with a severed tendon in<br />\nhis finger is somewhat doubtful;<br />\nif he is unavailable, either Thomas<br />\nor Novick will fill in.<br />\n(Continued from Page<br />\n<br />\nAs implied above, Ciccarone's,<br />\npreviously-employed three-guard<br />\noffense, a standard here for two<br />\nyears, has now — mainly in an effort to get more board strength —<br />\nbeen replaced by a more conventional setup. In this two-guard<br />\nalignment, one of the big men<br />\n(usually Thielke, maybe Spence)<br />\nor on occasion a guard (Sullivan;<br />\nwhen in) will play a high post and<br />\nthe offense will often be initiated<br />\nby a pass thereto and more there<br />\nfrom.<br />\nOffensive Potential<br />\nAlthough the new setup has<br />\ncaused some problems of adjustment in the scrimmages, scoring<br />\ncapability is hardly one of the<br />\nteam's problems. In guards Calli<br />\n'(15.8 last year and 17.5 as a soph)<br />\nand Berke (17.8 and 41% from the<br />\nfield), Ciccarone has two of the<br />\nmore potent point-makers in the<br />\nM.A.C.,though the former slumped<br />\n<br />\nDICK FOWLER<br />\nBsmE, U. of California,<br />\njoined Bethlehem's<br />\n1964 Loop Course.<br />\nAssigned to the<br />\nmaintenance and<br />\nengineering departments<br />\nof our South San Francisco<br />\nPlant, Dick handles<br />\nassignments,,throughout<br />\nthe plant. A typical project<br />\nwas designing and<br />\nsupervising installation<br />\nof a complex hydraulic<br />\nmechanical transfer<br />\nSystem.<br />\nMANAGEMENT<br />\nMINDED?<br />\nCareer prospects are<br />\nbetter than ever at<br />\nBethlehem Steel. We need<br />\non-the-ball engineering,<br />\ntechnical, and liberal arts<br />\ngraduates for the 1968<br />\nLoop Course. Pick up a<br />\ncopy of our booklet at your<br />\nplacement office.<br />\nAn Equal Opportunity<br />\nEmployer in the Plans for<br />\nProgress Program<br />\n<br />\nBETHLEHEM<br />\nSTEEL<br />\n<br />\nbadly in field goal percentage for<br />\n'66-67 (40% to 33%). The baseline drives of Sullivan (8.6 and<br />\n32%), the chief backcourt reserve,<br />\nhave become staple fare for Jay<br />\ncage fans by now, but the 6-1<br />\nsenior's outside shooting has left<br />\nsomething to be desired. Thorne,<br />\nthe fourth guard, is not much of<br />\nan offensive threat.<br />\nAmong the big men, Spence<br />\n(10.6 and 50%, 17.5 for the last<br />\nhalf of last season) and Carlton<br />\n(7.7 and always over 40%)are ex-<br />\n<br />\ncellent shots, while Thielke (13.4<br />\nwith the frosh) is inconsistent<br />\nfrom the floor.<br />\n<br />\nTHE JOHNS HOPKINS UNIVERSITY<br />\n<br />\nThe group's defensive capabilities, though, are not nearly so well<br />\ndeveloped as its offensive capacity.<br />\nAmong the guards, Calli (though,<br />\ninconsistent), Sullivan, and Thorne<br />\nare above average defensively,<br />\nwhile Berke does much better at<br />\nthe other end of the court. On the<br />\nfront line, however, problems<br />\nabound.<br />\n<br />\nChristmas Concur<br />\n<br />\nGLEE CLUB<br />\n<br />\nSHRIVER HALL<br />\nDECEMBER 3,1967<br />\n8:30 O'CLOCK<br />\n<br />\nWho does he think he is,<br />\nPatrick Henry?<br />\n<br />\nYou'd better believe it.<br />\nIf only because he does. That's enough<br />\nFor his countrymen: belief in him<br />\nAnd in Liberty.<br />\nThe Spirit of'76... in '67<br />\nIt won't take him as long as it took us<br />\nTo be heard;<br />\nTo be listened to.<br />\nThe United Nations will see to that.<br />\nHis vote, as big as ours<br />\nOr Russia's or Holland's will see to that.<br />\nWhich was the whole idea in San Francisco<br />\nWasn't it?<br />\nYou,of all people, must believe it.<br />\nYou are our life insurance.<br />\n<br />\nPhoenix<br />\nMutual<br />\nLIFE INSURANCE COMPANY<br />\nHARTFORD<br />\n<br />\nCONNECTICUT<br />\n<br />\nADMISSION FREE<br />\n<br />\n\f***<br />\n<br />\nHOMEWOOD,BALTIMORE,DECEMBER 1, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE TEN<br />\n<br />\nNEWS<br />\n<br />\nSPORTS<br />\n<br />\nLETTER<br />\n<br />\n*<br />\n<br />\nWinning Grid Year Booters Lose Match Basketball Prospects<br />\nDickinson Devils; Approach The Blues<br />\nEnds Losing Habit Tochieve<br />\nWinningYear<br />\n<br />\nBy MIKE PHILLIPS<br />\nTriumphant over arch-rival Western Maryland in its season finale,<br />\nthe varsity football team - via possibly the most spectacular oneyear grid reversal in Hopkins grid<br />\nhistory - has finished the 1967<br />\ncampaign with a 6-1 mark, the<br />\nSouthern Division Middle Atlantic Converence title, numerous<br />\nnew school records, and an abundance of individual honors.<br />\nIn moving up from 1966's<br />\n0-6-2 card, the team broke a sixyear string of losing season (8-34-5<br />\ncumulatively during that stretch);<br />\nand came up with the best Homewood grid performance since the<br />\nglory days of 1959-60, when Hopkins squads coached by Wilson<br />\nFewster finished 7-1 and 5-2-1.<br />\nProbable causes of the rise are<br />\nnumerous.<br />\nFirst among the group's more<br />\ntangible assets as it entered the<br />\n1967 campaign was its returning<br />\ncrew of twelve lettermen, seven<br />\nconcentrated in the offensive line<br />\nand all bloodied and hardened by<br />\n1966's misfortunes. Of further<br />\nimportance was the equally-sized<br />\nupcoming sophomore group - most<br />\nimportantly, defensive tackles Jim<br />\nLotto and Ken Brown, halfback<br />\nPaul Weiss, offensive linemen Bill<br />\nNcrsesian and Mike Wilbanks, and<br />\nlinebacker-end Wil Rholfing —<br />\nfrom 1966's undefeated freshman<br />\ngroup.<br />\nNewcomers Shine<br />\nMore surprising -- and certainly<br />\nvital to Coach Alex Sotir's planned<br />\ntwo-platoon system — were the<br />\nperformances of a group of playrs absent for varying lengths of<br />\ntime from the grid wars. Chief<br />\nimong these were sometime-place<br />\nkicker Wes Bachur, defensive linemen Wit Holden and Brian Turner,<br />\ndefensive backs Dave Thomas and<br />\nCharlie Coker (all of whom had<br />\nnever played football at Hopkins),<br />\nand defensive end Dave Komocki.<br />\nSotir was especially pleased by the<br />\njobs done by Coker and Thomas,<br />\nstating that this twosome, despite<br />\ninexperience, \"were never beaten<br />\ndeep all year.\"<br />\nAlso on the list of extended<br />\nlayoffs, but perhaps deserving of<br />\n<br />\n\"Brandy\" Picked<br />\nAs New Trainer<br />\nMr. LeRoy Brandimore, an exNaval Corpsman has recently been<br />\nappointed by the Athletic Department as athletic trainer. Ile will<br />\nreplace the late Jimmy Benson<br />\nwho served for 41 years.<br />\nA Naval veteran of twenty-three<br />\nyears Mr. Brandimore will assume<br />\nhis duties on December 1 . Serving<br />\nas a Hospital Corpsman,First Class,<br />\nhe has made two tours 01 duty as<br />\nassistant trainer at the Naval Acadmy during a five- year period.<br />\nMr. Brandimore received extensive medical and administration<br />\nexperience during his Naval service,<br />\nwhich has included some action in<br />\nthe vicinity of Vietnam. The new<br />\ntrainer is forty-two years of age<br />\nand he resided in Arnold. Maryland.<br />\nMarshall Turner commented<br />\nthat he was pleased that Mr.<br />\nBrandmoie was able to come to<br />\nthe Hopkins. Turner stated that<br />\nBrandimore would definitely \"be<br />\nan asset\" to the athletic staff.<br />\n<br />\nJOE COWAN<br />\nhis own categorization, is wingback Joe Cowan, a recent Honorable Mention Little All-America<br />\nchoice in his first year of football<br />\nsince 1964. The 5-10, 175 pound<br />\njunior, probably Hopkins' top offensive threat all year, played a<br />\nvital role in at least four of the<br />\nJays' six wins, and in the process<br />\nbecame a Baltimore Sun First<br />\nTeam All-Maryland pick. He led<br />\nthe Southern Division of the Middle Atlantic Conference in scoring<br />\n(77 points, 89 for the season) and<br />\npunting (41.8 yards per kick),<br />\nwhile finishing fourth in that league in rushing and eighth in pass<br />\nreceiving.<br />\nFew Injuries<br />\nSotir, for his part, was more<br />\napt to stress the role that luck<br />\nplayed in 1967 Jay grid successes.<br />\n\"We were very fortunate injurywise this season,\" he related;\"since<br />\nmost of our key players went the<br />\nseason unhurt. It's a good thing<br />\nthey did,\" the varsity mentor continued, \"because there wasn't too<br />\nmuch depth behind them.\"<br />\n\"We were also lucky to get off<br />\nto a good start, and thus gain momentum we never lost. Our opening game with Franklin and Marshall (a 19-14 win in the final<br />\nminutes) could easily have been<br />\nlost, and if it had the whole season might have been different.\"<br />\n\"The team's attitude and motivation, though,\" he went on,<br />\n\"were probably the most impor(('ontinued on Page 8)<br />\n<br />\nBy BOB HYAMS<br />\nThe Hopkins Soccer team gained its first winning season since<br />\n1964 by posting an overall record<br />\nof 6-5 this year.<br />\nThe Jays lost their final match<br />\non Saturday, November 25 to<br />\nDickinson College by a score of<br />\n2-1. It completed a season which<br />\nwas highlighted by our beating<br />\nDrexel for the first time in 20<br />\nyears.<br />\nThe booters finished on a strong<br />\nnote, winning three out of their<br />\nopponents' total of 19. They outshot their opponents 235-166. A<br />\nteam is supposed to score on the<br />\naverage of one goal for every 10<br />\nshots.<br />\nIn the losing Dickinson game,<br />\nthe Jays scored in the first 20 seconds on a toss-in from out of<br />\nbounds. Kit Battenfeld headed the<br />\nball to Randy Miller who collected the goal. Also assisting on the<br />\nplay was Art Guerin.<br />\nDickinson tied the score at 1-1,<br />\nthree minutes later. There was no<br />\nfurther scoring until the final four<br />\nminutes in the last quarter when a<br />\ncorner kick resulted in a scramble<br />\nin front of the Jay goal, culminating in the winning Dickinson<br />\nscore. Dickinson completed its season with an 8-2-2 record.<br />\nNext year the team loses four<br />\nstarters via graduation: Wes Bachur, Kit Battenfeld, Peter Martindale, and John Sarney. There will<br />\nbe 13 returning lettermen with<br />\nsome good freshmen moving up to<br />\nthe varsity. Coach Barrette felt<br />\nthat the team would be stronger<br />\nnext year with the major scoring<br />\npunch coming from Dave Roberts,<br />\nKen Niman and Bernie Wenker.<br />\nCoach Barrette was pleased with<br />\nthe fine year-round effort. Pete<br />\nMartindale, who took over the<br />\ngoalie position from Mike Avery<br />\n(All-Conference last year) only<br />\ngave up 11 goals in eight games.<br />\nAlso deserving Kudos are sophomores Randy Miller and Rich Tobey and co-captains Wes Bachur<br />\nand John Sarney.<br />\n<br />\nAttempting to reassert itself<br />\nafter last year's disappointments,<br />\nthe varsity basketball team — virtually intact from 1966-67 but<br />\nsomewhat altered in style and<br />\nwith prospects best described as<br />\nambiguous — will open its current<br />\ncampaign by hosting Haverford<br />\ntomorrow at 8:30 p.m.<br />\nHead Coach Henry Ciccarone,<br />\nyet to field a winner in five tries<br />\n(the last Hopkins cage crew above<br />\n.500 played in the late 1940's),<br />\nrated Haverford as \"just about our<br />\nweakest opponent this year\" and<br />\nadded — accurately enough — that<br />\n\"If we don't beat them it could<br />\nmean a long season.\"<br />\n<br />\nCiccarone's moderate pessimism — a feeling shared by many<br />\nof the team's observers — would,<br />\nconsidering the return of six letterp.m and four starters, the presence of some good sophomore<br />\nprospects, and availibility of the<br />\nsize much lacking last season, appear groundless; but awareness of<br />\nthe course of the 1966-67 Jay<br />\ncampaign and so-so pre-season<br />\nscrimmage performances justify<br />\nhis concern.<br />\nOverconfidence<br />\n\"After all of iast year's overconfidence (Hopkins, picked for<br />\nbetter things by most, finished<br />\n7-5 in the Southern Division of the<br />\nMiddle Atlantic Conference and<br />\n8-9 overall), a little pessimism<br />\naround here won't hurt,\" opined<br />\nCiccarone. \"We didn't get very<br />\nmany breaks a year ago, but that<br />\nwas hardly the only reason we did<br />\nrelatively poorly: too many peo-<br />\n<br />\nple thought too many games were<br />\nwon before the season even started.<br />\nThe team has got to play its games<br />\none at a time.\"<br />\nThe cagers' scrimmage performances have hardly been such as<br />\nto dispel the above forebodings.<br />\nIn 95-86 and 74-65 wins over an<br />\nAlexandria (Va.) amateur team<br />\nand Southeastern University and<br />\n84-62, 80-75, and 75-49 losses to,<br />\nrespectively, Howard University,<br />\nBaltimore Junior College,and Morgan State College (Hopkins scrimmaged Baltimore University Wednesday night), the Jays — have<br />\nlooked effective only in spots,<br />\nalthough the latter three foes are<br />\nprobably superior to most of the<br />\nopposition they will see this year.<br />\n(Continued on Page 9)<br />\n<br />\nt1<br />\n<br />\nsa<br />\ngf<br />\n<br />\nPlayer Goals Assits Total Points<br />\nGuerin<br />\nBachur<br />\nRoberts<br />\nMiller<br />\n<br />\n4<br />\n4<br />\n1<br />\n0<br />\n<br />\n4<br />\n2<br />\n3<br />\n3<br />\n<br />\n8<br />\n6<br />\n4<br />\n3<br />\n<br />\nTHEATRE HOPKINS<br />\n1967-1968 Season<br />\nStudent Season Subscnptions still<br />\navailable 5 Productions For ;5.00<br />\n<br />\nTicket Office,Shriver Hall<br />\nThe Johns Hopkins University<br />\nBaltimore, Maryland 21218<br />\n(Single per play admission $2.25)<br />\nLast season more than 700 people were<br />\nturned away in a single week-end.<br />\nHopkins students, new and old, try:<br />\n<br />\nPecora's Restaurant<br />\nfor the finest Italian food in town<br />\n<br />\nIn the December issue of Cheetah, writer Rob Ross travels with<br />\nsmugglers as they make a run<br />\nfrom Tijuana to Southern California. It's a scary, nasty,fascinating<br />\nreport. And—Tom Nolan writes<br />\nabout the \"groupies\"--the girls<br />\nwho'll do anything for a star.<br />\nThere are also stories on campus movies, rock lyrics, \"uptight\" Washington, D.C. and part<br />\none of a three part look at the<br />\nunderground religions. This and<br />\nmuch more in<br />\n<br />\nefaN4<br />\nNow at your newsstands<br />\n(P.S. For an annual subscription to<br />\nCheetah, send $5.00 in check or<br />\nmoney order to Cheetah Magazine,<br />\n1790 Broadway, N.Y., N.Y. 10019.)<br />\n<br />\n3320 Greenmount Ave.<br />\nSPAGHETTI MEALS<br />\nPIZZA PIE A SPECIALTY<br />\n<br />\nCARRY OUT SERVICE<br />\nCALL 0139-3031<br />\n<br />\n%l<br />\n- o- v0,440-0Td-F_<br />\n<br />\ncic<br />\nhi<br />\nth<br />\n<br />\nlar<br />\ntb<br />\n<br />\ncal<br />\nHi<br />\n<br />\ndei<br />\n<br />\nPar<br />\nten<br />\non(<br />\nlog,<br />\nses.<br />\non<br />\n<br />\n0 1<br />\n<br />\nCic<br />\n<br />\ncolt<br />\ntint'<br />\nduie<br />\nFeu<br />\n<br />\n,,S9c<br />\n,<br />\nlok<br />\nreia t<br />\n<br />\n\f", "format": "basic_html", "processed": "Weekend Weather Watch:<br />\nYesterday's Snow<br />\nis Today's Slush<br /><br />\nVOL. LXXII, NO.9<br /><br />\n'Nnits IIrtter<br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND,DECEMBER 1, 1967<br /><br />\nOn The Inside:<br />\nThe Treasures of the<br />\nWalters revealed.<br />\nSee page 5.<br />\n72ND YEAR<br /><br />\nBermuda-Bound Graduate Student Sit-In Attack Planned For Dow<br />\nReneges on Pledge to Repay Theft<br />\nCIA Cancels<br />\nHop Interviews<br /><br />\nSpecial to the News-Letter<br />\nMr. Berthel said that negotiaA warrant was signed out in tions are being conducted with<br />\nBaltimore City Court Tuesday by Scribners for the return of the<br />\nthe Hopkins University for the ar- valuable material. \"They are being<br />\nrest of a graduate student in the most cooperative, but it may end<br />\neducation department, who alleg- up costing us a very considerable<br />\nThe Johns Hopkins University<br />\nedly stole $5,000 worth of rare sum of money to have our own<br />\nAd Hoc Committee Against Dow<br />\neighteenth century pamphlets from works returned,\" he said.<br />\nChemical Company voted Wednesthe Eisenhower library last year.<br />\nThe theft, the largest in library<br />\nday afternoon to stage an obstrucJohn Berthel, head librarian, history, is only one of many since<br />\ntive sit-in against the Dow recruiter<br />\nwho called the crime \"the most the library was moved from Gilscheduled to be on campus Monserious theft in the history of the man Hall. Mr. Berthel, however,<br />\nday, December 4,<br />\nHopkins library,\" said the robbery said that vandalism and stealing<br />\nA spokesman for the Commitoccurred sometime between Feb- have decreased since more guards<br />\ntee said that should the recruiter<br />\nruary and April, 1967.<br />\nand restrictions have been imposed<br />\nsucceed in entering the Placement<br />\nCharged in the theft was Mat- on student use of the library. DOW RECRUITERS trap harried Classics students into listening<br />\nOffice in Whitehead Hall,the group<br />\nto<br />\ntheir<br />\nusual Song and Dance routine.<br />\nthew R. Ryan, 38, of Bermuda,<br />\nwould switch to a non-obstructive<br />\nU.K., and until recently a resident<br />\nsit-in so that students wishing to<br />\nof the University's Greenway<br />\nbe interviewed by the recruiter<br />\nApartments.<br />\ncould do so unhindered. \"We are<br />\nAccording to Dr. John Walton,<br />\naiming our protest at Dow. not<br />\nBy DICK CRAMER<br />\nhead of the education department,<br />\nthe students or the University,\"<br />\nRyan was suspended from the deRecent student pushes for in- commented the spokesman.<br />\nOn November 29, the Maryland later with the six students' refusal creased freedom, bills of<br />\npartment about a month ago after<br />\nThe demonstration will begin<br />\nrights,<br />\nto remove themselves from the<br />\nDr. Walton learned of the theft. Court of Special Appeals will con- sidewalk once they were<br />\nand a greater voice in the formula- at 7:30 a.m. in front of Whitehead<br />\noutside.<br />\nRobert Strider, Dean of Graduate sider a constitutional challenge All of the six were members of the tion of university policy, have Hall. There will be a supporting<br />\nStudies, said that he had not learn- concerning six former Hopkins Johns Hopkins Chapter of<br />\nthe questioned the rules requiring picket line for those who do not<br />\nstudents, arrested and convicted<br />\ned of the suspension.<br />\nStudents for a Democratic Society. freshmen to live in the dormitor- wish to participate in the sit-in.<br />\nRyan, a third year doctoral last year on disorderly conduct<br />\nThe students' original convic- ies.<br />\nRobert Butler,Director of Hopcandidate, and a former Hopkins convictions.<br />\nIn a poll taken by the<br />\nDavid L. Harding, 22, Daniel A. tion was passed down by Judge I. chapter of the Students Hopkins kins Public Relations, stated that.<br />\nundergraduate, had served in the<br />\nFor DeSewell Lamdin, the present chief<br />\narmed forces, had worked as a Kline, 22, Donald A. BacheIler, judge of the Municipal Court<br />\nmocratic Society last spring, mem- \"We will not object to a peaceful<br />\nof<br />\nbookdealer in New York and had 20, Daniel Rudman, 22, Wayne R. Baltimore. The convictions were bers of the freshman class were demonstration but if normal functions are disrupted, we will take<br />\ntaught at Seton Hill College . Heinbach,21,and Allen B. Greene, upheld in a second trial on June asked their opinions on life in the<br />\nappropri<br />\nate actions.\"<br />\nThe robbery of the pamphlets 20,were arrested by Baltimore po- 6, 1966 by Judge J. Gilbert<br />\ndormitori<br />\nes. An overwhelming<br />\nPrewas discovered several months ago lice when they sat down and re- dergast and a jury in the Criminal 79% of those students replying<br />\nThe Ad-Hoc Committee on<br />\nby a library staff worker, and im- fused to move from the sidewalk Court of Baltimore. Each student stated that they found dormitory Campus Recruitm<br />\nent, a coalition<br />\nfront<br />\nin<br />\nrecruitin<br />\nof<br />\na<br />\nstation<br />\ng<br />\non<br />\nmediately Mr. Berthel wrote to<br />\nlife either restrictive or depressing. of SDS, Vietnam Committee<br />\nreceived<br />\nsixty<br />\na<br />\nday<br />\njail<br />\nsentence<br />\nand<br />\nGreenmount Avenue.<br />\nseveral magazines circulating<br />\nand a fifty dollar fine. Through- 67% felt that it would not have Union for Democracy at Hopkins<br />\nThe<br />\nevent<br />\nclimaxed<br />\nan<br />\nSDS<br />\namong bookdealers.<br />\nout,the appellants have contended hurt them academically to have forces, has sent a letter to Rogers<br />\nScribners,in New York,answer- sponsored demonstration held on that, \"We were arrested because lived off-campus. In addition, 59% demanding<br />\nthe cancellation of the<br />\ned the library's query, and said March 28, 1966, against the Viet- we expressed unpopular political felt that their social life suffered Dow<br />\nrecruiters scheduled appearThirty<br />\nwar.<br />\nnam<br />\ncollege<br />\nfifty<br />\nto<br />\nas a result of their living in the<br />\nthey had purchased most of the<br />\nviews.\"<br />\nance and requesting a debate with<br />\nstolen works from Ryan, a dealer and high school students picketed<br />\nIn the present appeal,the Mary- dorms.<br />\nUniversity officials on the issue of<br />\nentrance<br />\nof<br />\nthe<br />\nrecruitin<br />\nthe<br />\nceng<br />\nfrom whom they had purchased<br />\nland Court of Special Appeals, the<br />\nNo Action Taken<br />\nrecruitment on campus. Copies of<br />\nter with signs declaring \"Peace in second highest Court in the state,<br />\nbooks previously.<br />\nThe results of the poll were<br />\nthe letter were sent to President<br />\nAccording to Mr. Berthel, Ryan Vietnam,\" \"Johnson is Goldwater granted permission for the appel- made available<br />\nGordon, the president of Dow<br />\nto administration,<br />\nwas remembered for having often in Disguise,\" and \"Make Love, not lants to be represented as indi- but no<br />\naction was taken. Mr. Chemical, and the News-Letter.<br />\nbeen delinquent in returning books War.\"<br />\ngents, and therefore the case will Robert P. Bilgrave,<br />\nDirector of<br />\nThe six students mentioned be considered at State expense.<br />\nto the library on time.<br />\nThe Central Intelligence Agency<br />\nStudent<br />\nAffairs,<br />\nsaid<br />\nthat<br />\nthe poll has<br />\nabove<br />\nentered the center during<br />\nImmediately,administration ofRepresenting the students will was taken in the spring,<br />\ncancelled its recruitment interand<br />\nthat<br />\nficials talked with Ryan, who ad- the initial stages of the demonstra- be Fred E. Weisgal, a Baltimore atviews<br />\nscheduled for December I<br />\nthe results would have been submitted the theft and promised res- tion and attempted to persuade of- torney, and Anthony G. Amsteron the Hopkins campus.<br />\nstantially<br />\ndifferent<br />\nhad<br />\nthe<br />\nquestitution of the assorted Americana. ficials to place anti-war informa- dam, a professor of Criminal Law tions<br />\nMr. J. Lyon Rogers. Director<br />\nbeen<br />\nHowever, Ryan supposedly fled to tion beside the recruiting bro- at the University of Pennsylvania. semester asked during the first of the Placement Bureau located<br />\n.<br />\n\"The<br />\ndormitor<br />\nies, adBermuda last week and the Univer- chures. This resulted in them being Frank DeCosta Jr., an assistant atin Whitehead Hall, said the cancelsity was compelled to sign out the escorted from the premises by torney, is the States' Advocate in mittedly, are not an ideal situa- lations were due to a lack of intertion,\"<br />\nhe<br />\nsaid.<br />\nNevertheless, he<br />\nU.S. MarshaIls. The arrests ensued the case.<br />\nwarrant.<br />\nagrees with the policy of requiring viewees. Only two students, both<br />\nstudents to live in the dormitories doctoral candidates, had scheduled<br />\ninterviews.<br />\nfor their freshman year.<br />\n\"After seeing 18 classes come in<br />\nHe did not say whether the two<br />\nat<br />\nHopkins,<br />\ninterview<br />\nI<br />\nknow<br />\nees would be granted inthat<br />\nthere<br />\nis<br />\nBy BOB SLOAN<br />\nour natural wealth. Being a student<br />\nHe feels that Hopkins will make<br />\nEDITOR'S NOTE:This is the third at a university should be pointed a slow expansion of its depart- a transistion that is necessary.\" terviews at another time or another<br />\nOne of the conclusions arrived place. The CIA has also scheduled<br />\nand final article in this series.<br />\nout as being the most important ments. If there is a \"contrac<br />\ntion\" at in the poll was that the dormi- interviews for Thursday. January<br />\nthing<br />\nthat<br />\nthis<br />\ncountry<br />\nhas.'<br />\nHe it will be in the area of research: tories<br />\nThe drafting of graduate and<br />\ndecrease<br />\n11.<br />\nPotential graduate students poses continued, \"We can't go around equipment will not be purchased the student individuality within<br />\nThe Hopkins SDS threatened a<br />\nbody. Dr. Clinton<br />\na far more immediate threat to killing the progress the country and so forth. He repeated that the<br />\ndemonstr<br />\nDeSoto,<br />\nation against the CIA reassociate<br />\nprofessor<br />\nof<br />\nHopkins' expansion than the re- has made - - our graduate students, loss of graduate students to the Social Psycholo<br />\ncruiters unless the interviews were<br />\ngy,<br />\nfelt<br />\nthat<br />\na<br />\nnumpotential<br />\nour<br />\nscientists<br />\nand pro- draft will be a greater cause of reduction of government research<br />\nber of students, the \"loners,\" cancelled. In a letter to Rogers.<br />\nfessors.\"<br />\naid.<br />\nsearch contraction than a shortage should be allowed to live<br />\noff-cam- dated November 17. the SDS reDr. George E. Owen of the<br />\nOwen linked this crisis, one of funds.<br />\nquested a debate with the CIA repus.<br />\nPhysics Department, a faculty re- very similar in its effects to the<br />\nOwen is optimistic about the<br />\nHe also felt that the dormitory, cruiters in place of the interviews.<br />\npresentative on the Long Range financial one, to the future goals future of the school. He realizes or any communal atmosphere, forA conference was subsequently<br />\nPlanning Committee, said that, of Johns Hopkins. Both problems, that there are problems, in the al- ces people to conform to a certain held in the Placement office, atalthough there is concern over the he said, must be taken into consi- location of funds as well as else- extent. Mr. Bilgrave agreed with tended by Eduardo Joly and<br />\ncut-back of funds, the effects of deration when discussing the plan- where, but \"we have the potential this conclusion. \"Certainly,\"<br />\nhe Stephen Diamond, members of the<br />\nthe shortage of government assist- ed expansion of the university.<br />\nto do things right. Hopkins can set said, \"there are a few students SDS Steering Committee. Rogers.<br />\nance on Hopkins cannot, at preThe ultimate \"dream\" of the the image of what a university who would be happier living off- and Mr. Bilgrave, Director of'Stusent, be accurately forecast.<br />\nlong-range planners, one which should be like.\"<br />\ncampus- - but they are not harmed dent Affairs.<br />\nHowever,if the draft system re- Owen feels Hopkins has the potenIf students regret the shortages by having to live in the dormi. The Administration representamains as it now stands with col- tial, monetarily as well as educa- in the departments of the Univer- tories for one year.\"<br />\ntives denied the requests of the<br />\nlege seniors and first year graduate tionally to achieve, is to increase sity, their complaints are listened<br />\nAdministration opposition to<br />\nstudents being given top priority the faculty so as to have a closer to by faculty and .administration the abolishment of the require- SDS. whereupon the SDS representatives said that they would<br />\non 1-A lists, the resulting deple- student faculty relations<br />\nIn the future, Owens feels, their ment may stem from financial<br />\nhip.<br />\nfeel<br />\nfree to take any action they<br />\ntion ofgraduate school enrollment<br />\n\"Hopkins is unique,\" says opinions will be solicited by the concerns. Dean Shaffer said, last deemed appropri<br />\nate and necessary.<br />\nWill have an immediate and adverse Owen, \"in that it is highly<br />\nper- administration. The financial pro- year, that if the dormitories could<br />\nAdminist<br />\nThe<br />\nration officials<br />\neffect on the future plans of the sonalized, and can become even blems of a small<br />\nschool and the not be filled, there would doubt- stated that they respected the<br />\nUniversity.<br />\nmore so. Hopkins is probably the newer, more pressing problems of less be \"financial repercussions.\" right of students to take a stand<br />\nThe drafting (and possible kill- only school in the nation that can the draft, will create<br />\nreal problems This year, to fill the dorms, the against the CIA and would permit<br />\ning) of college educated men is, in afford this 'experiment' in person- for Hopkins,<br />\nbut it should be able university has allowed graduate an \"orderly- demonstration. but<br />\neffect,says Owen,\"depriving us of alization.\"<br />\nstudents to live in Vincent House.<br />\nto realize its \"dream.\"<br /><br />\nOutlook Bleak<br />\nFormer Students<br />\nChallenge Court For Dorm Changes<br /><br />\nDrafting of Grad Students Threatens Expansion<br /><br />\n(Continued on Page 6)<br /><br />\nHOMEWOOD, BALTIMORE, DECEMBER 1, 1967<br /><br />\nNEWS-LETTER<br /><br />\nPAGE TWO<br /><br />\nAdministration Reshuffles<br />\nAs Fund Discards, Deals<br /><br />\nI CAMPUS NOTES 1<br />\nPIKE'S PEAKS<br />\nBishop James Pike will speak at<br />\nHopkins on Sunday,December 10,<br />\nin Shriver Hall. He will deliver a<br />\nsermon \"Growth Through Encounter\" during an 11 a.m. Ecumenical<br />\nService. At 3 p.m., he will give an<br />\naddress on\"The Ethics of Dissent.\"<br />\nA MAN AND HIS SOUL<br />\nRudolf Serkin, pianist, will give<br />\nhis only concert in the Baltimore-<br /><br />\nTHESE FEW LINES MAY MAKE<br />\nLIKE QUIPS BUT SEE HARRY<br />\nLITTLE FOR THE BEST FOOD<br />\nTIPS.<br /><br />\nSubmarines • Pizza<br />\nSpaghetti • Chicken Dinners<br /><br />\nHARRY LITTLE<br />\nCARRY OUT SHOPS<br /><br />\n32nd Near Greenmount<br />\n25th Near Greenmount<br />\nYork Road &amp; Regester Ave.<br /><br />\nJOE MENDELSON<br />\nBSChE, U. of Maryland,<br />\nis a plant engineer at<br />\nour Sparrows Point,<br />\nMd., Plant, biggest in the<br />\nworld. Only four years<br />\nout of college, Joe has<br />\nalready developed nearly<br />\n80 major engineering<br />\nprojects, some with<br />\nmulti-million-dollar price<br />\ntags, from basic planning<br />\nthrough engineering and<br />\nconstruction.<br /><br />\nGet High With a Little Help from<br />\nmy Friends. Contact, Ann Goldberg, Baltimore Symphony Orcestra, 727-7300.<br />\nHOLE SALE BAGELS<br />\nThe Jewish Student Associations of Hopkins and Towson<br />\nState are holding a bagels-and-lox<br />\nbreakfast, Sunday, at 10 a.m., in<br />\nthe Towson Student Center. Dr.<br />\nLouis Kaplan, noted Jewish educator will speak. Rides are available;<br />\ninterested parties should contact<br />\nDavid Blecker, 467-6952. Admission is free<br />\nA SIGH FOR CYBERNETICS<br />\nOBJECTIONS SUSTAINED<br />\nThe next Computer Seminar<br />\nOn Saturday, December 9, and will feature Russell A. Kirsch of<br />\nSaturday, December 16, the Col- the National Bureau of Standards,<br />\numbia University School of Law Monday, December 4, 4 p.m., in<br />\nwill sponsor its sixth annual Pre- the Auditorium of Shaffer Hall.<br />\nLaw Conference for undergraduate The talk will be on \"Experiences<br />\nupperclassmen. The Conference and Extrapolations from the Use<br />\nwill be held in New York, the of Large Time-Sharing Systems<br />\nSchool of Law on 116th Street Over Long Distances.\"<br />\nADVISE AND REPENT<br />\nand Amsterdam Avenue. Interested students should contact Bud<br />\nA fall advising period, similar<br />\nBozarth, Box 1111.<br />\nto the spring advising period, has<br />\nbeen set up. During December 6<br />\nFIRST SOLO FLIGHT<br />\nto December 20, all undergradErroll Garner will appear as uates are to consult with their faguest soloist with the Baltimore culty advisors on their second seSymphony Orchestra on Novem- mester programs. Programs are to<br />\nber 25. He will perform some of be completed and submitted for<br />\nhis own works and orchestrations advisor's approval prior to Christincluding, Misty, Dreamy and I mas Vacation.<br />\nWashington area on Friday, December 8, in the Lyric Theatre, at<br />\n8 p.m., as part of the Shriver Hail<br />\nSeries. The program will include<br />\nselections by Schubert, Beethoven,<br />\nand Brahms.<br />\nPOPPY SEEDS AND<br />\nFUNNY WEEDS<br />\nA Still-Life and Flowers exhibit<br />\nwill be presented in the Milton S.<br />\nEisenhower Library on December<br />\n1, 2, and 3, from 9 a.m. to 9 p.m.<br />\nIncluded in the exhibit will be<br />\nMarc Chagall, Georgia O'Keefe and<br />\nRaoul Dufy.<br /><br />\nHospital Del elopmem, Fund<br />\nPresillene Goes to Burns<br />\nDr. Gerald P. Burns, president<br />\nof the Independent College Funds<br />\nof America, Inc., has been named<br />\nvice president for development of<br />\nthe Johns Hopkins Hospital and<br />\nthe Johns Hopkins University and<br />\nwill be responsible for the fund<br />\nraising activities of both institutions.<br />\nThe announcement was made<br />\njointly by Dr. Russell A. Nelson,<br />\npresident of the Hospital, and Dr.<br />\nLincoln Gordon, president of the<br />\nUniversity. Dr. Burns will also become president of the Johns Hopkins institutions. University Trustee M. Jenkins Cromwell, who is<br />\nnow president, will become Chairman of the Board.<br />\nGrad of Boston U.<br />\nDr. Burns, 49, has been president for ten years of the Independent College Funds of America,<br />\nInc., as national fund-raising orgahization representing 39 state<br />\nassociations and more than SOO<br />\nprivate colleges.<br />\nA 1941 graduate of Boston<br />\nUniversity, Burns served five years<br />\nin the U.S. Army during World<br />\nWar II, rising from private to<br />\n(Continued on Page 7)<br /><br />\n\"Youth will make this one of the most<br />\npopular films ever produced. It will<br />\nquickly rank with that small number<br />\nof totally contemporary films that include The Beatles flicks, 'Morgan,'<br />\n'Blow Up' and a very few others.<br />\n\"Dylan expresses something very,very<br />\nimportant about the New Youth. Our<br />\nsons and daughters are beyond our<br />\ncommand, and Dylan offers us clues<br />\nas to why.<br />\n\"It is the most effective presentation<br />\nof the reality of contemporary youth<br />\nattitudes that I have ever seen. It is<br />\nalso one of the best, if not the very<br />\nbest, portrait of a performing artist<br />\nto be shown publicly.<br />\n\"It ought to be seen dozens of times!\"<br /><br />\noIk President's Assistant,<br />\nIn Join Carnegie Group<br />\nRonald A. Wolk, Special Assistto the President and Coordinator<br />\nof Planning of the Johns Hopkins<br />\nUniversity has been named as<br />\nAssistant Director of the Carnegie<br />\nCommission on the Future of<br />\nHigher Educations.<br />\nThe Commission, chaired and<br />\ndirected by Clark Kerr, was created last January by the Carnegie<br />\nFoundation for the advancement<br />\nof Teaching. Its aim is to make a<br />\ncomprehensive study of all the<br />\nphases of higher education in this<br />\ncountry and the complex elements<br />\nof society which affect higher<br />\neducation.<br />\nMr. Wolk has been at Hopkins<br />\nsince 1958. In 1963 he was named<br />\nSpecial Assistant to Hopkins' President Milton S. Eisenhower. Two<br />\nyears later he was elected Vice<br />\nPresident of the Johns Hopkins<br />\nFund. This organization, presently<br />\ndirected by Dr. Gerald Burns, controls the process of fund-raising<br />\nfor the University. Mr. Wolk was<br />\nlikewise appointed Coordinator of<br />\nUniversity Planning.<br />\nFor many years, Mr. Wolk has<br />\nbeen an active participant within<br />\nhis field. He was, for example, director and secretary of Editorial<br />\nProjects for Education, and publisher of The Chronicle of Higher<br />\nEducation,a bi-weekly newspaper.<br />\nHe has also participated in the<br />\nAmerican Association of Education and the American College<br />\nPublic Relations Associations.<br />\nLEON IS A YEAST<br />\nTERM PAPERS TYPED<br />\n592-6836<br /><br />\nELEPHANTS<br />\nnever forget<br /><br />\n— Ralph J. Gleason, San Francisco Chronicle<br /><br />\n(and you will<br />\nalways remember)<br />\nthe fabulous<br />\nvalues at<br /><br />\n/<br /><br />\nTHE<br /><br />\nMANAGEMENT<br />\nMINDED?<br /><br />\n•<br /><br />\nSAMPLE<br />\nSTORE<br /><br />\nCareer prospects are<br />\nbetter than ever at<br />\nBethlehem Steel. We need<br />\non-the-ball engineering,<br />\ntechnical, and liberal arts<br />\ngraduates for the 1968<br />\nLoop Course. Pick up a<br />\ncopy of our booklet at your<br />\nplacement office.<br /><br />\nEVERY<br />\nSPORTCOAT<br />\nIN STOCK<br />\nValues to $45.00<br /><br />\n44<br /><br />\n19 40<br /><br />\nAn Equal Opportunity<br />\nEmployer in the Plans for<br />\nProgress Program<br /><br />\nSartIPLE STORE<br /><br />\nBETHLEHEM<br />\nSTEEL<br /><br />\n3031 Greenmount Ave.<br />\nIn Waverly<br />\nOPEN EVERY EVENING<br /><br />\n• CHAK-11 • PAC • MOO ClUB<br /><br />\nBOB<br />\nDYLAN<br /><br />\nCHUNG'S<br />\nCARRY-OUT<br />\nFine Chinese ond<br /><br />\nAlit DON!LOOK BACK<br /><br />\nPolynesian Food<br />\nOpen Daily 11 A.'.4. 10 P.M.<br />\nFriday &amp; Sat 11 AM.. 12 P.M.<br />\nSunday 1 P.M.. 11 P.M.<br />\n508 W. Cold<br /><br />\nSpring Woe<br /><br />\n889-3428<br /><br />\nA Film By D. A. Pennebaker<br />\nwith JOAN BAEZ<br /><br />\nPremiere Today.<br /><br />\nat 2,4,6,8,10<br /><br />\nNorth at Charles<br />\nNext-sy<br /><br />\nIDc)c)r<br /><br />\n1<br /><br />\nComplete Bachelor 1<br />\nService<br />\nFLUFF DRY &amp; FOLD<br />\nSHIRTS—DRY CLEANING<br /><br />\nWaverly Laundromat<br /><br />\nVE 7 — 1956,<br /><br />\n3339 GRF;F:NMOUNT AVE.<br /><br />\nt rk ii 1;2:<br /><br />\n467-2123<br /><br />\nHOMEWOOD,BALTIMORE,DECEMBER 1, 1967<br /><br />\nNEWS-LETTER<br /><br />\n\"What doesIBM offer a<br />\nPh.D?I'd say diversity.But<br />\njudge for yourself when<br />\nthey're here Dec.12th'<br />\n\"I think IBM's worth listening to because the advantages<br />\nthat attracted me are even stronger today.(This is Gary<br />\nKozak,Ph.D. in Analytical-Physical Chemistry,an IBM<br />\nDevelopment Chemist and Project Manager.)<br />\n\"At IBM you're constantly working with people doing<br />\nadvanced work in many different fields. That's a great asset<br />\nto any scientist because today's problems are often<br />\ninterdisciplinary. You can't solve them with one kind of<br />\nbackground. You need inputs from three or four different<br />\nkinds of people.<br />\n\"A good example is the solid logic technology used in<br />\nbuilding the IBM System/360. The EE tells you how many<br />\nconductors you'll have, where they go,and what should be<br />\nat the terminals. An ME designs fixturing and automatic<br />\nprocesses. A Polymer Chemist formulates insulators<br />\nand says how they should be used. The Metallurgist<br />\nspecifies alloy compositions. The Physicist decides how to<br />\noptimize a process for producing transistors and diodes.<br />\nAnd all these people have to talk with each other and<br />\nhelp each other.<br />\n\"It's a stimulating environment,and it keeps you technologically sharp. Of course, to do all this interfacing with<br />\nother disciplines, you need a free and informal atmosphere,<br />\nand IBM has it. It's a good place for a scientist to work.\"<br />\nThere's more to the IBM story than Gary has mentioned.<br />\nYou can get all the facts when we interview Ph.D.'s on<br />\ncampus. Make an appointment at your placement office,<br />\neven if you're headed for military service.<br />\nOr if you can't make a campus interview,send an outline<br />\nof your interests and educational background to<br />\nMr. L. H.Covert,IBM,Armonk,<br />\nL-7 L<br />\nN.Y. 10504. We're an equal<br />\nopportunity employer.<br />\nr 1r<br /><br />\nHOMEWOOD, BALTIMORE, DECEMBER 1, 1%7<br /><br />\nNEWS-LETTER<br /><br />\nPAGE FOLIR<br /><br />\n3nliuniiapkino<br />\nNtins-Etiter<br /><br />\nEDITORS-IN-CHIEF<br /><br />\nCorrespondence<br /><br />\nMACKSEY ON BANKRUPTCY<br />\nTo The Editors:<br />\nWhen God, Sex, and Politics<br />\nfail, there is always Money as a<br />\nprovocative topic for intramural<br />\nconversation. Bob Sloan's series<br />\nSuddenly the arch villan of the play has mellowed somewhat. We on \"Homewood in Financial Criare told that McNamara's passing will remove the final dove in the sis\" promises to rehearse much of<br />\nPentagon. Which, if true, we are ready for a Pandora's Box of policy our local monetary mythology and<br />\ndecisions on the course of the war in Viet-Nam.<br />\nperhaps stimulate some new ideas.<br />\nMcNamara has had a penchant for producing real lemons. Besides At all events, your reporter should<br />\nthe Edsel and the Viet-Nam war, he has also made the \"computer have no trouble in turning-on the<br />\nmind\" a virtue which future government officials will emulate. faculty, for too many of whom<br />\nThe only question left is who will step in where angels fear to<br />\nthe spectre of immanent academic<br />\ntread. Connolly and Anderson are most prominently mentioned.<br />\nbankruptcy seems to have replaced<br />\nBoth are Texans.<br />\nthat of the late Senator McCarthy<br />\nConnolly has a history of Life magazine articles on the Kennedy or of the excluded middle.<br />\nAssasination, whereas Anderson is a Republican and also an advocate<br />\nI did, however, want to unof former President Eisenhower's theory of a massive land invasion<br />\nscramble on reference in Mr.<br />\nof North Viet-Nam.<br />\nSloan's first article to what apClearly the outlook is bleak for any kind of rationality to return peared to be the Humanities Cento the Pentagon or the White House. Personal prestige has now been<br />\nter's typewriter rescue fund. The<br />\nelevated as the main objective of victory in Viet-Nam. Ballots not allusion was intended simply as a<br />\nbullets in 1968 will settle that question.<br />\ntrivial illustration of the multiple<br />\nIn passing one can only reflect that if either of the two Texans and usually unpredictable demands<br />\ntake the Defense post, it will look suspiciously as though it were a<br />\nmade every year on any descrepay-off for that darkly hinted Texas conspiracy in Dallas several tionary funds available to the adyears ago.<br />\nministration. Dean Kimball was<br />\nable to allocate a small sum this<br />\nterm to enable a plan for seminars<br />\norganized by members of an unThe State Attorney General is investigating certain discrep- dergraduate course; the seminars,<br />\nunder the general rubric \"the perancies in the books of the Morgan State food service and two<br />\nson of the maker,\" are designed<br />\nwholesale suppliers of institutional food.<br />\nIt appears that certain amounts were paid out and goods to allow the students concerned<br />\nwith the arts and the art of critiwere never recorded as having come in. It only shows that a lot<br />\ncism to invite a few distinguished<br />\nmore is rotten than just the food.<br />\nAt Hopkins it has been empirically proved that the food is artist and critics to Oarticiilate in<br />\ndiscussions about problems of inbad. It would also bear checking to see if all is kosher in the<br />\nthe period<br />\nfinancial department. The University budget and financial re- terpretation during<br />\nwhen<br />\nthe<br />\nformal<br />\nHumanities<br />\nSemicords are regularly checked by a Baltimore accounting firm,<br />\nnars<br />\nare<br />\nin<br />\nhibernation.<br />\nThe<br />\nmoney<br />\nrecords.<br />\nwere<br />\nMorgan's<br />\nfinancial<br />\nso<br />\nagain,<br />\nbut then<br />\nIt has not been proven to anybody's satisfaction why there which the Dean could divert to<br />\nis such an outrageous \"overhead\" for food services. Adminis- this experimental (and unbudgettration officials, especially in the Plant Manager's Office, have ed) project was severely limited by<br />\nsome of the other unexpected debeen consistently guarded as to financial records.<br />\nAccording to one faculty member of the Bookstore Com- mands which come to roost on a<br />\nmittee, the suggestion that students have access to financial re- Dean's desk, such as the replacecords weas refused because \"it would take some explaining.\" ment of the typewriters and other<br />\nEither because students aren't versed in the nuances of ac- office equipment stolen from Gilman Hall last month. The point is<br />\ncounting or because there is something else that needs<br />\nnot that the budget for the student<br />\nexplaining.<br />\nseminars will be garnished to ranWe strongly recommend that the financial records having<br />\nsom<br />\nthe typewriters, but that<br />\nto do with plant expenditures be examined closely to avoid<br />\nwhat happened at Morgan.<br />\nPeter J. Koper<br /><br />\nRoger C. Toll<br /><br />\nMr. Lyon Rogers<br />\nDirector, Placement Center<br />\nThe Johns Hopkins University<br />\nDear Sir:<br />\nThe Dow Chemical Company will be interviewing students for<br />\npermanent and summer employment on cwnpus December 4 and 5.<br />\nDow Chemical is engaged in the production of napalm, a cruel and<br />\ninhunian instrument of war. The napalm made by Dow is used by the<br />\nAmerican armed forces in their aggression against the people of<br />\nVietnam.<br />\nWe feel that the university has a duty to make a moraljudgement<br />\non recwitment and that the university community as a whole, and<br />\nnot the placement centre, should decide whether these recruiters are<br />\nto be allowed on campus. We demand the cancellation of the visit of<br />\nthe Dow recruiters and challenge you to a public debate on the issue<br />\nof on-campus recruiting.<br />\nIf no reply to this letter is received by noon Wednesday we will<br />\nfeel justified in taking direct action in this matter.<br />\nRespectli141'<br /><br />\nObit For Mac<br /><br />\nFooling With The Food<br /><br />\nAd Hoc Committe on Campus Recruitment<br />\nmore money would probably have where they feel the need is greatbeen available for an educational est by assuming some of the resproject had the larceny not ponsibility for academic \"developoccu red.<br />\nment\" (the polite word in the<br />\nThe limited resources for the trade for finding money).<br />\nseminars on interpretation, inciThe first of the seminars spondentally, stimulated some of the sored by the hermeneutical stustudents involved to explore the dents will be a visit by Monroe<br />\nfine art of scrounging. By identi- Beardsley of Swarthmore College<br />\nfying other administrative officers during December. Professor Beardwith descretionary budgets, they sley, a distinguished undergraduate<br />\nwere able to augment several of teacher, is the President of the<br />\nthe leanly financed seminars on a American Society for Aesthetics,<br />\n\"matching-funds\" basis. For one the author Aesthetics: Problems in<br />\nseminar, they may also be able to the Philosophy of Criticism and of<br />\nfind matching funds from other a comprehensive history of aesthetics published last year; he will<br />\ninstitutions in the area.<br />\nIn an economic environment address himself to some possible<br />\nwhere the University can hardly applications of recent analysis of<br />\nincrease further the price of its illocutionary acts by philosophers<br />\nproduct (tuitions) or call for a tax of language to the interpretation<br />\nsur-charge, some ingenuity at the of poetry. Other seminars, during<br />\nlocal level in combining small bud- January and February, will deal<br />\ngets or in discovering external sup- with topics such as the interpretaport for worthwhile projects can tive role of the director (\"From<br />\nrelieve somewhat the chronic need Text to Production\"), of the musito cut, compromise, and defer in- cian (\"From Score to Perfornovation in the academic program. mance\"), the shaping-up of a poem<br />\nWithin the limits imposed by their and the revision of a novel, \"unprimary jobs, the students and derstanding\" a painting, a buildfaculty can, in fact, help to supple- ing, and a film; the term will con(Continued on Page 7)<br />\nment existing funds in those areas<br /><br />\nRepublican Bias<br /><br />\nParticipatory Tyranny<br />\nDow Chemical comes to this campus this week to recruit employees. The S.D.S. hopes to stop it. The result is that the whole moral<br />\nand political legitimacy of protest is destroyed, and that participatory democracy becomes tyranny.<br />\nEveryone, ideally, should have their say. And everyone should<br />\nhave the freedom to choose. The Dow protestors have chosen to<br />\nabandon legitimate protest and to enter into quisling tyranny.<br /><br />\nThe Gold Rush. Circa 1967<br />\n11AVE A DREAM OF A<br />\nEOROPEAM OriJtotJ. LET'S<br />\nCALL. IT FRANCE<br /><br />\nGone With the Wind<br />\nBy KENNETH W. BOND<br />\nRepublican National Chairman<br />\nRay.Bliss was dead wrong when he<br />\nsaid the November 7 election results indicate \"that the upsurge in<br />\nRepublican strength which began<br />\nin 1966 is continuing.\" In reality,<br />\nit was a poor night for the GOP.<br />\nRepublican gains in New Jersey,<br />\nKentucky, and Hartford, Conn.<br />\nmust be deemed truly insignificant when considering the Democrats swept control of nine major<br />\nU.S. cities: San Francisco, San Diego, Gary,Cleveland, Toledo, New<br />\nHaven, Boston, Philadelphia, and<br />\nBaltimore.<br />\nHere at home, the humiliation<br />\nstemming from the mayorality<br />\nrace was not due to Arthur Sherwood's defeat, but because he was<br />\nliterally creamed. It was a foregone conclusion to everyone that<br />\nSherwood would lose; his campaign was admittedly an \"exercise in futility.\" But to think that<br />\nhe received less than 20 per cent<br />\nof the popular vote, coupled with<br />\nthe fact that Democrats uniformly<br />\ndefeated Republican (with one exception) in all six City Council<br />\ndistricts by overwhelming margins from 3-1 to 10-1, leads one to<br />\nask the question: \"What ever happened to the two-party system in<br />\nBaltimore?\" If it ever was, it surely is dead now.<br />\nThe factors which explain Baltimore's one party inanopoly begin<br />\nwith the Democrats' commanding,<br />\nfive to one voter registration margin. Baltimoreans are known to<br />\nhappily cross lines if the other<br /><br />\nparty presents a better man. Thus,<br />\nTheodore McKeldin and Spiro<br />\nAgnew have carried the day in recent elections. A more significant<br />\nfactor is evidenced by the continuous emmigration of the usually<br />\nRepublican middle and high income families, leaving the city<br />\nlimits inhabited by low-income<br />\npersons and minority groups - who<br />\nremain hypnotized by the New<br />\nDeal era and are, therefore, loyally<br />\nDemocratic.<br />\nMost important, one must consider the campaign itself. Political<br />\ntheory has it that the best way to<br />\nupset a one-party monopoly is for<br />\nthe out-party to sponsor extremely<br />\nattractive candidates. Again, McKeldin and Agnew are prime examples. In many ways Sherwood<br />\ncould have been attractive to the<br />\nvoters, but in fact he was not.<br />\nFirst,Sherwood received negligible<br />\nsupport from his own party. No<br />\none wants to back a loser; thus,<br />\nthere were no finances for a dynamic publicity campaign. In addition, there was no campaign organization, no volunteer corp ringing doorbells, no active \"youth<br />\nfor Sherwood.\"<br />\nSecond, there was Sherwood<br />\nhimself: a nice guy, and all that,<br />\nbut hardly the \"John Lindsay of<br />\nBaltimore\". He failed to motivate<br />\nand inspire his partisans the way<br />\nAgnew did in 1966. His public<br />\nimpression was many times that of<br />\nfrustrated and confused man not<br />\nsure at all of what he was supposed<br />\nto be doing. Thus, as the results<br />\nshow, he didn't instill much coot -<br /><br />\ndence in the voters.Yet, in priyate.<br />\nSherwood was no coward He<br />\nstood up against the war, accosted<br />\nthe Great Society for lack of federal revenues to rebuild his city,<br />\nand deplored the corruption embedded in his opposition.<br />\nFinally, there was Tommy<br />\nD'Alesandro III - - Baltimore's<br />\nMayor-elect. He pocketed the<br />\nmonopoly on everything: the magnetic name, billboards, bus signs,<br />\nT.V. - radio advertisement (\"The<br />\nAnswer is D'Alesandro<br />\n\"), and<br />\nthe votes: five of his to every one<br />\nof Sherwood's. He couldn't lose<br />\nshort of a national catastrophy.<br />\nThus, he aired no issues, presented<br />\nno alternatives, and made no rational appeals. He didn't have to;<br />\nhe won the mayorship in the Democratic primary.<br />\nThe tragedy of this election is<br />\nnot that the Republicans ought to<br />\nhave won. D'Alesandro probably<br />\nwon't do anything so terrible as<br />\nmight have required Sherwood to<br />\nsave Baltimoreans from it. The<br />\ntragedy is that there is no longer a<br />\nhealthy two-party system. D'Alesandro is accountable only to his<br />\nparty, not to Baltimore citizens.<br />\nSince there is no loyal opposition<br />\nto check his administration,<br />\nD'Alesandro is free to govern as he<br />\npleases. We can only hope that he<br />\nwill choose to do so in an efficient and responsible in<br />\nMeanwhile, the Republican party<br />\nhas been wiped out of Baltimore;<br />\nit is gone with the wind, When, or,<br />\nif, a viable GOP will return to challenge the city's inner machine is<br />\nanybody's guest.<br /><br />\n411<br /><br />\nHOMEWOOD,BALTIMORE,DECEMBER 1,1967<br /><br />\nPAGE FIVE<br /><br />\nNEWS-LETTER<br /><br />\nGolden Age Celebrated at Walters<br /><br />\n•<br />\nI.<br /><br />\nBy BILL SAKOWICH<br />\nWalters Art Gallery has seemingly developed into the sort of<br />\nestablishment which creates interest only for the member of the<br />\nBaltimore Chamber of Commerce<br />\nwho will mention it in a brochure<br />\nfor prospective residents, to prove<br />\nthat the city of monuments is a<br />\nculturally alive metropolis.<br />\nHaving its nativity from the<br />\nwealthy Walters' private collection,<br />\nthe museum is based in what used<br />\nto be the old family homestead.<br />\nThrough the museum's needs,however, chez Walters has become a<br />\ncurious conjugation of the Baroque and the Modern. Previously,<br />\nto set the tone for the ancient and<br />\nRenaissance works, the museum,<br />\nhad kept its setting appropriate<br />\nfor its ennumerable esoteric displays.<br />\nAvant Garde Jigsaw<br />\nYet a strange thing is happening to the gallery today. It is desperately attempting to change its<br />\nimage from a stodgy attic to a<br />\ngenuine museum and art gallery<br />\nwhere Albert Common can browse<br />\nthrough and soak up some crudi-<br /><br />\nii<br /><br />\n•••<br /><br />\ntion for his culturally deprived<br />\nsoul. For example, one may see a<br />\nrather stunning enamel from<br />\nFrance displayed in a neo-modern<br />\nchurch setting that looks strangely<br />\nlike a Hutzler's Christmas display,<br />\nor purchase a jugsaw puzzle of<br />\n\"Alexander the Great Enthroned<br />\nat Persepholis\" by Nizami, or<br />\nChristmas Cards with Renaissance<br />\npaintings on the front.<br />\nArtistic Crop Rotation<br />\nOne can definitely become frustrated working in an establishment<br />\nwith so much potential that lies<br />\nfallow. It can be said without<br />\nquestion that the Walters' Art gal-<br /><br />\nlery is the best<br />\nmuseum in the<br />\ncity, and one of<br />\nbest of its kind in<br />\nthe nation. It houses many originals, from Raphael to El Greco,<br />\n0has a striking collection of French<br />\nEnamels, and an<br />\nextensive display<br />\nof Ancient Greek<br />\nEgyptian<br />\nand<br />\nsculpture. On display in the museum is a jewelled<br />\nmarten's head that is a rare example of a fashionable artistic vogue<br />\nwhich appeared in Europe in the<br />\nFifteenth and sixteenth centuries.<br />\nWhat makes the situation even<br />\nmore frustrating is the fact that<br />\nthere is not enough room in the<br />\nmuseum to display the entire collection at one time, and so various<br />\nexhibits must be rotated from the<br />\nhalls to the basement.<br />\nHaven for Students<br />\nThe museum is a haven for all<br />\nart students who wish to supplement their education, and for the<br />\nlayman to become aware of the<br />\nartistic heritage of the ages; a heritage that is reincarnate on canvas.<br />\nWalters also presents concerts<br />\nfeaturing Peabody ensembles, at<br />\nwhich the audience is at liberty to<br />\npromenade about the premises to<br />\nenrich the appreciation of the<br />\nmusic.<br />\nAttendance Poor<br />\nBut on the main, attendance at<br />\nthese concerts is poor. The Gallery goes unnoticed or ignored by<br />\na greater part of the city. The<br />\nGallery is left to those few of the<br />\nupper class who wish to appreciate the \"finer things in life\", unruly, chattering children who are<br />\nthankful to escape the boredom of<br />\nthe classroom, or to the dull borgeosie who wish to escape the<br />\nstillness of a Sunday afternoon.<br />\nThe rest of the city is content to<br />\nworship at the tabernacle on Thirty-third street, or pick up their<br />\nculture packaged at a local cinema<br />\nor discotheque.<br /><br />\nYet Walters still waits patiently<br />\non Charles Street for those interested with its cycle of exhibits and<br />\nunattended Peabody Concerts. The<br />\npaint on the portrait of the found*<br /><br />\ner, William Walters, may be cracking around the forehead, but the<br />\ngallery is secure in the knowledge<br />\nthat the painting will be eventually<br />\nrestored.<br />\n***<br /><br />\nRUSH VIOLATION<br />\nPhi Kappa Psi fraternity was<br />\nfound guilty of a major rush<br />\nviolation by the IFC Judicial<br />\nBoard. Phi Psi was fined $200<br />\nfor holding an illegal \"dirty\"<br />\nparty with freshmen present.<br /><br />\nA Periclean Banzai<br />\nDr. Edward N. Lee, Associate Professor of Philosophy,<br />\nwill be the special guest at the<br />\nStudent-Faculty Coffee Hour<br />\non Thursday, December 7, at<br />\n4:00 p.m. in the Sherwood<br />\nRoom of Levering Hall.<br /><br />\nGet high with<br />\na little help from<br />\nyour friends.<br />\nYOU HAVE A FRIEND AT<br /><br />\nTHIE Eli:01111C: DIRCUIS*<br />\nT.qatcc<br /><br />\npuir.t PiTeirrM7NP A 1PhAYr5<br /><br />\nCAST YIlleCI. N.Y.C.<br /><br />\nNOTE: Represent the Electric Circus on<br />\nYour campus! Sell tickets and arrange<br />\nPrivate parties. Earn commissions! Call:<br />\n(212) 777-4466, or write: Ed Plum at the<br />\nabove address.<br />\n.im • ©<br /><br />\n1957 Electric Cloys of Neer York. Mc Pat. Perri<br />\nCoffee in the Think Tank.*<br /><br />\nSTAMP IT!<br />\nIT'S THE RAGE<br />\nREGULAR<br />\nMODEL<br />\nANY $<br /><br />\n3 LINE TEXT<br />\nThe finest INDESTRUCTIBLE METAL<br />\n1<br />\n2\" 2-.<br />\nPOCKET RUBBER STAMP. /<br />\nSend check or money order. Be<br />\nsure to include your Zip Code. No<br />\nPostage or handling charges. Add<br />\nsales tax.<br />\nPrompt shipment. Satisfaction Gust-limbed<br />\nTHII MOPP CO.<br />\nP. 0. lox 18623 Lef1011 Square Stalin<br />\nATLANTA, GA., 30326<br /><br />\n\"SroKELY CARikalcHAEL in Dar es<br />\nSalaam alter a couple of weeks<br />\nWith Ho Chi Minh across the<br />\nwater, accused Negro African lead \"s of failing to fight the fight.<br />\nC armichael urged them to get<br />\n4un5 (by killing the armed<br />\nPolicemen and soldiers) and<br />\ntart shooting. Africans, he said,<br />\nmust learn to hate and fight.' A few<br />\nr\"re declarations on that order,<br />\n'<br />\nI nd old Stoke<br />\nFor a free copy of<br />\nWm. F. Buckley's NA<br />\nbe up for a<br />\nTIONAL REVIEW,<br />\nN obel Peace<br />\nwrite: 150 E. 35 St.,<br />\nPrize....<br />\nN.Y., N.Y. 10016. Student rote: $3.89 for<br />\n18 issues.<br /><br />\nthe burn steer - leather boutique<br />\n(.)<br />\n224 w. read at tyson<br />\nlarEit3r4<br />\n.0) 194<br /><br />\nPAGE SIX<br /><br />\nHOMEWOOD,BALTIMORE, DECEMBER 1, 1967<br /><br />\nNEWS-LETTER<br />\nEx Rx Rx Ex Rx Ex Rx Rx<br /><br />\nAll Types of Subs<br />\nSnacks — Beer<br /><br />\nYOUR<br />\nPRESCRIPTION<br />\nDRUGSTORE<br /><br />\nOPEN TILL 1 :00<br />\n7 DAYS A WEEK<br /><br />\nB &amp; M SUB SHOP<br />\n31st &amp; GUILFORD<br /><br />\nSOS to Greet Dow as Council Ducks Issue<br />\n(Continued from Page 1)<br /><br />\nGREEN WAY<br />\nPHARMACY<br />\n34th &amp; CHARLES<br />\nRx Rx Rx Rx Roc Rx<br /><br />\nreserved the right to take action if<br />\nany demonstration exceeded the<br />\nbounds of orderliness.<br />\nThe Administration has made<br />\nno mention of the SDS actions in<br />\nrespect to the CIA cancellation.<br />\nThe Student Council briefly<br />\ntook up the issue of controversial<br />\nrecruiters on campus Monday,<br />\nNovember 27. Ken Bond proposed<br />\nthat the Council take a stand de-<br /><br />\nTRW is success by association<br /><br />\nEugene Noth, MS<br />\nTracking &amp; Analytical Simulation<br /><br />\nRonala Werner, Ph.D.<br />\nGuidance 6 Control<br /><br />\nAndre Blaufuss, BS<br />\nGuidance &amp; Mission Simulation<br /><br />\nfending the right of students to<br />\nprotest Dow recruiters to the point<br />\nthat they do not interfere with<br />\nthose students seeking interviews<br />\nwith Dow.<br />\nIt was the sense of the Council<br />\nthat the proposal was ambiguous<br />\nand ireelevant. Greg Mertz offered<br />\na resolution condemning Dow for<br />\nits manufacture of napalm.<br />\nJed Luchow argued that such a<br />\ndecision had to be predicted by a<br />\nvote for or against the Vietnam<br />\nWar, and that the Council was<br />\nneither responsible for nor capable<br />\nof making moral judgements on<br />\nthe practices of business concerns.<br />\nBefore an opportunity was given to defend the motion, Luchow<br />\nmove that the meeting be adjourned,leaving the issue up in the<br />\nair. The vote to adjourn was 10-7.<br />\nJim Winship, Bill Betcher, Jack<br />\nKirk,Greg Mertz and Manuel Rodriguez were among those Council<br />\nmembers who felt the necessity<br />\nfor that body to handle the question immediately, and voted not<br />\nto adjourn.<br />\nThe Student Councils of several<br />\n-universities and colleges, among<br />\nthem Amherst, University of Pennsylvania, Brooklyn College and<br />\nOberlin, have taken strong stands<br />\nagainst on-campus recruitment by<br />\nthe military, the CIA, and DOW<br />\nand or against retribution taken by<br />\ntheir Administration against those<br />\nwho protested the recruiters.<br /><br />\nanwit.\"<br />\n411t:.*il%'::•.•<br />\n••••• ••<br />\nJames Austin, MS<br />\nSystems Analysis d Software<br /><br />\neildt<br />\nDon Bowyler, MS<br />\nElectronic Reconnaissance<br /><br />\n1<br /><br />\nJoseph Kawamura, Ph.D.<br />\nSpace Guidance<br /><br />\n• Favorite Rendes Wu<br />\nfor Hopkins Men<br /><br />\nJIMMY WU'S<br />\nNEW<br />\nCHINA INN<br />\nCborles Street below 25th<br />\nrtmlsty WU'S<br />\nCARRY OUT SHOP<br />\n1411 E. Cold Spring Lane<br />\n••••••ft<br /><br />\n,,G44611111111,„<br />\n„__<br />\nFloyd Thomas, Ph.D.<br />\nAdvanced Technology<br /><br />\nRoger Burnell, MS<br />\nTelecommunications<br /><br />\nJames Martin, MBA<br />\nMaterial<br /><br />\nLawrence Fink, BA<br />\nSub-Systems Programming<br /><br />\nFrom Los Angeles to Houston to Washington,from Space<br />\nSystems to Ocean Systems to Information Systems,<br />\nyoung people are making things happen at TRW.<br /><br />\nTake a look around any TRW 'location.<br />\nThe young faces outnumber the old by<br />\na good margin. The vast majority of<br />\nscientists and engineers you'll meet are<br />\nunder thirty, or forty at least. Why?<br />\nBecause we depend 041 young ideas,<br />\nnew ideas, fresh ideas. That's why we<br />\nneed you.<br />\nWhat kind of a place is TRW? Ask<br />\naround. Talk to your professors and<br />\nfaculty advisors, or your friends who are<br />\nalready working with TRW. Most of our<br />\nprofessional employees applied to TRW<br />\non the recommendation of friends.<br />\nHere are some of the disciplines where<br />\nnew graduates may find career opportunities at TRW:<br /><br />\nComputer Sciences/Analytical<br />\nResearch / Aerosciences / Information Systems / Digital Systems / Communications Systems/Reliability/<br />\nGuidance &amp; Control / Sensor Systems<br />\n/ Microelectronics / Electric Power J<br />\nSpace Vehicle Design / Antenna Systems Design and Analysis / Mechanical Engineering / Product Assurance /<br />\nIntegration &amp; Test / Systems Engineering / Circuit Design / Electronic Countermeasures &amp; Electronic Intelligence<br />\nSystems<br />\nIf you'll be receiving your,.degree<br />\n(Ph.D., MS or BS) in Engineering or<br />\nScience this year, check with your<br />\nPlacement Director and talk with us<br /><br />\nwhile we're on campus. If you can't<br />\nmake it at that time and would like to<br />\nbe considered for openings in the Los<br />\nAngeles area, Houston or Washington,<br />\nsend your resume to:. W. D. Mclvers,<br />\nCollege Relations, TRW, One Space<br />\nPark, Redondo Beach, California 90278.<br /><br />\nAn Equal Opportunity Employer<br /><br />\nTRW<br /><br />\nTRW (formerly Thompson Rams Wooldridge) is 60,000 peopli. at 200 operations around the<br />\nworld who are applying advanced technology to space, defense, automotive, aircraft, electronics and<br /><br />\nindustrial markets,<br /><br />\nENGINEERS AND SCIENTISTS<br /><br />\nTRW CAMPUS INTERVIEWS<br />\nFriday, December 1, 1967<br />\nSEE YOUR PLACEMENT OFFICE<br /><br />\nART WILLIAMSON<br />\nBSME,U. of Maryland,<br />\nwas assigned to the<br />\nbig blooming mills at<br />\nour Sparrows Point, Md.,<br />\nPlant soon after joining<br />\nBethlehem's 1963<br />\nLoop Course. Art is<br />\nresponsible for training of<br />\npersonnel and start-up<br />\nof new facilities. He's also<br />\nliaison man between<br />\nthe mill and plant<br />\nengineering for a<br />\n$17-million improvement<br />\nprogram.<br />\nMANAGEMENT<br />\nMINDED?<br />\nCareer prospects are<br />\nbetter than ever at<br />\nBethlehem Steel. We need<br />\non-the-ball engineering,<br />\ntechnical, and liberal arts<br />\ngraduates for the 1968<br />\nLoop Course. Pick up a<br />\ncopy of our booklet at your<br />\nplacement office.<br />\nAn Equal Opportunity<br />\nEmployer in the Plans for<br />\nProgress Program<br /><br />\nBETHLEHEM<br />\nSTEEL 0ETH Htm<br />\nST EL<br /><br />\n—16<br /><br />\n11ON1EWOOD, BALTIMORE. DECEMBER 1,19o7<br /><br />\nNMS-LETTER<br /><br />\nBurns Instated<br />\nRoot ofPratAll<br />\nEvil<br />\nLibrary is, in turn, helping to<br />\nAs Fund Head elude with several symposia, in- traint and<br />\nfund students interested<br />\n2)<br />\n(('ontinued from Pag: 4)<br /><br />\n(Continued from l'age<br /><br />\nmajor. He , then attended Columbia University and earned his M.A.<br />\nand Doctor of Education degrees.<br />\nFrom 1948 to 1952 he served<br />\nas executive director of the American Camping Association in Chicago. Dr. Burns than became assistant to the vice chancellor at<br />\nNew York University from 1952<br />\nto 1955, followed by three years<br />\nyears as vice president of Reed<br />\nCollege in Portland, Oregon.<br />\nIn 1962 he earned a second<br />\ndoctoral degree from New York<br />\nUniversity. He is author of several<br />\nbooks, including: Program of the<br />\nModern Camp, Administrators in<br />\nHigher education, and Trustees in<br />\nHigher Education. His research interests have been mainly in the<br />\nfield of higher education administration.<br />\nStarts January 1<br />\nDr. Burns is a member of the<br />\nAmerican Academy of Social Sciences, the Association for the Advancement of Science, the Association of Higher Education, the<br />\nPublic Relations Society of America, Phi Epsilon Kappa and Phi<br />\nDelta Kappa.<br />\nlie has held summer and evening teaching positions at Columbia<br />\nUniversity, Northwestern, University of Colorado, New York University, Rutgers and the University<br />\nof Iowa.<br />\nHe has awarded an honorary<br />\ndegree from Alliance College in<br />\n1960 and received a Founders Day<br />\nAward from New York University in 1963.<br />\nDr. Burns will take up his Johns<br />\nHopkins duties full time around<br />\nJanuary 1.<br />\nGIRLS IN LIBRARY<br />\nThe University Library Committee has granted approval to<br />\nthe Student Council's proposal<br />\nthat each Hopkins student be<br />\npermitted to bring a guest into<br />\nthe Eisenhower Library during<br />\nthe evening hours, from 4:00<br />\np.m. until midnight, and on<br />\nweekends, from 8:00 a.m. until midnight.<br />\nThis decision is being initiated on a three month trial period. Unless there are serious<br />\nabuses, the ruling will become<br />\na permanent policy of the Library. Students will have to<br />\nsign their guests in and out.<br />\nSenior class President John Kirk<br />\nwas instrumental in obtaining<br />\nthe Committee's approval.<br /><br />\nCalling all<br /><br />\nCLOTHES<br />\nHORSES!<br />\ncheck the<br />\nquality and<br />\nvalue at<br />\nTHE<br /><br />\nSAMPLE<br />\nSTORE<br />\nEVERY SUIT<br />\nIN OUR STOCK<br />\nValues to<br />\n$65.00<br /><br />\ncluding discussions of \"the literature of the absurd- and of \"pornography and the Iiinits of art.- The<br />\nstudents planning the sessions hope<br />\nto open the seminars to any members of the community who have a<br />\nspecific interest in the topic under<br />\ndiscussion.<br />\nIf 1 may be allowed one last delinquent erratum. the statement in<br />\nan earlier issue that the Hopkins<br />\n\"administration- has never given<br />\nany support to the lively interest<br />\nin film study and film making on<br />\nthe campus is not entirely accurate.<br />\nAs in the case of the current seminar project, individual administrators have responded sympathetically to appeals from students engaged in film projects. For instance, two years ago Dean Shaffer<br />\nmanaged to find $400 somewhere<br />\nin the machinery so that a group<br />\nof students could complete a narrative film based on Kafka's \"Ein<br />\nBrudermord.\" The recent purchase<br />\nof a print of this film by the Enoch<br /><br />\nsupport current fihn projects<br />\n(which are also aided by a grant<br />\nfrom the SAC). Members of the<br />\nSocial Relations Department are<br />\nhelping to train and fund students<br />\ninterested in doing a documentary<br />\non simulation games. In the longer<br />\nperspective, however, most of the<br />\nstudents involved with film study<br />\nearly recognized that the sort of<br />\nmassive support necessary for a<br />\ncomprehensive film program (production funds, finishing studio.<br />\ncinematheque, library and \"readder\")could never claim a very high<br />\npriority on the allocation of general funds from the University's<br />\nbeleaguered budget. They saw that<br />\nsuch a program will need nnjor<br />\nsupport from new sources of funds<br />\noutside the academy. The same<br />\nstudents expended considerable<br />\ntime and ingenuity in identifying<br />\nsuch possible areas of support, in<br />\nresearch on technical and academic<br />\nneeds. and in articulating an ima(('ontinued on Page 8)<br /><br />\nReport<br />\nto your<br />\nlocal wing<br />\ncommander<br /><br />\nGRAEME CLARKE<br />\nTWA Campui Representative<br /><br />\nHe has command<br />\nof a 172-jet fleet and<br />\nthe whole world of<br />\nTWA. He's waiting<br />\nto set you up for an<br />\nadventure—any place<br />\nin the U.S., Europe, Asia or Africa.<br />\nIf you're shopping for facts and figures<br />\nor a 50/50 Club card, good for half fare<br />\ntravel in the U.S., he's the man to see.<br />\nYou know what they say about all work<br />\nand no play. So call Graeme at 666-0064<br />\nor 837-6200. And start packing.<br />\nP. S. Attention College Bands, Combos, Vocal Groups. Don't<br />\nforget the National Championships at the 1968 Intercollegiate<br />\nJazz Festival sponsored by TWA. For information write: IJF,<br />\nBox 246, Miami Beach, Florida 83139.<br /><br />\n*29<br />\nSAMPLE STORE<br />\n3031 Greenmount Ave.<br /><br />\nin Waverly<br />\nOPEN EVERY EVENING<br /><br />\nDMA IT • Ng • $1000) CIS<br /><br />\nWelcome<br />\nto the world of<br />\nTransWorld Airlines*<br />\n...the all-jet airline<br />\nOkrvice mark owned exclusively by Trans World Airlines, Inc.<br /><br />\nPAGE SEVEN<br />\nWe need your head in our<br />\nbusiness<br /><br />\nSt Paul Barber Shop<br />\n3120 St. Paul St.<br />\nACtOSS<br /><br />\nfrom EdMe s<br /><br />\nJOHN P. NUGENT, JR.<br />\nLife &amp; Health<br />\nInsurance<br />\nCompare<br /><br />\n243-7961<br /><br />\n4'41 on earls mzithui.<br />\n(By the author of \"Rally Round the Flag,Boys!\",<br />\n\"Doke Gillis,\" etc.)<br /><br />\nFOOTBALL FOR SHUT-INS<br />\nAt next Saturday's football game while you are sitting<br />\nin your choice student's seat behind the end zone, won't<br />\nyou pause and give a thought to football's greatest and,<br />\nalas, most neglected name? I refer, of course, to Champert<br />\nSigafoos.<br />\nChampert Sigafoos (1714-1928) started life humbly on<br />\na farm near Thud, Kansas. His mother and father, both<br />\nnamed Walter, were bean-gleaners, and Champert became<br />\na bean-gleaner too. But he tired of the work and went to<br />\nMontana where he got a job with a logging firm. Here the<br />\nerstwhile bean-gleaner worked as a stump-thumper. After<br />\na month he went to North Dakota where he tended the<br />\nfurnace in a granary (wheat-heater). Then he drifted to<br />\nTexas where he tidied up oil fields (pipe-wiper). Then to<br />\nArLona where he strung dried fruit (fig-rigger). Then<br />\nto Kentucky where he fed horses at a breeding farm (oattoter). Then to Long Island where he dressed poultry<br />\n(duck-plucker). Then to Alaska where he drove a delivery<br />\nvan for a bakery (bread-sledder). Then to Minnesota<br />\nwhere he cut up frozen lakes (ice-slicer). Then to Nevada<br />\nwhere he determined the odds in a gambling house (dicepricer). Then to Milwaukee where he pasted camera<br />\nlenses together (Zeiss-splicer).<br />\nFinally he went to Omaha where he got a job in a tannery, beating pig hides until they were soft and supple<br />\n(hog-flogger). Here occurred the event that changed not<br />\nonly Champert's life, but all of ours.<br />\nNext door to Champert's hog-floggery was a mooring<br />\nmast for dirigibles. In flew a dirigible one day, piloted by<br />\na girl named Graffa von Zeppelin. Champert watched<br />\nGraffa descend from the dirigible, and his heart turned<br />\nover, and he knew love. Though Graffa's beauty was not<br />\nquite perfect—one of her legs was shorter than the other<br />\n(blimp-gimper)—she was nonetheless ravishing, what<br />\nwith her tawny hair and her eyes of Lake Louise blue and<br />\nher marvelously articulated haunches. Champert,smitten,<br />\nran quickly back to the hog-fioggery to plan the wooing.<br />\nTo begin with, naturally, he would give Graffa a present. This presented problems, for hog-flogging, as we all<br />\nknow, is a signally underpaid profession. Still, thought<br />\nChampert, if he had no money, there were two things he<br />\ndid have: ingenuity and pigskin.<br />\nSo he selected several high grade pelts and stitched<br />\nthem together and blew air into them and made for Graffa<br />\na perfectly darling little replica of a dirigible. \"She will<br />\nlove this,\" said he confidently to himself and proceeded to<br />\nmake ready to call on Graffa.<br />\nFirst, of course, he shaved with Personna Super Stainless Steel Blades. And wouldn't you? If you were looking<br />\nto impress a girl, if you wanted jowls as smooth as ivory,<br />\ndewlaps like damask,a chin strokable, cheeks fondlesome,<br />\nupper lip kissable, would you not use the blade that<br />\nwhisks away whiskers quickly and slickly, tuglessly and<br />\nnicklessly, scratchlessly and matchlessly? Would you not,<br />\nin short, choose Personna, available both in Injector style<br />\nand double-edge style? Of course you would.<br /><br />\nSo Champert, his face a study in epidermal elegance,<br />\nrushed next door with his little pigskin dirigible. But<br />\nGraffa, alas, had run off, alas, with a bush pilot who specialized in dropping limes to scurvy-ridden Eskimo villages (fruit-chuter).<br />\nChampert, enraged, started kicking his little pigskin<br />\nblimp all over the place. And who should walk by just<br />\nthen but Jim Thorpe, Knute Rockne, Walter Camp, and<br />\nPete Rozelle!<br />\nThey walked silently, heads down, four discouraged<br />\nmen. For weeks they had been trying to invent football,<br />\nbut they couldn't seem to find the right kind of ball. They<br />\ntried everything—hockey pucks, badminton birds, bowling<br />\nballs, quoits—but nothing worked. Now seeing Champert<br />\nkicking his pigskin spheroid, their faces lit up and as one<br />\nman they hollered \"Eureka!\" The rest is history.<br />\n* * *<br />\n©1967, Max Shulman<br />\nSpeaking of kicks, if you've got any about your present shave cream, try Burma-Shave, regular or menthol.<br /><br />\nHOMEWOOD,BALTIMORE, DECEMBER 1, 1967<br /><br />\nNEWS-LETTER<br /><br />\nPAGE EIGHT<br /><br />\nMacksey<br />\n(Continued from Page 7)<br /><br />\nginative experimental program.<br />\nThey received substantial advice<br />\nand encouragement from men in<br />\nthe profession as well as from Dr.<br />\nEisenhower and Mr. Walters of the<br />\nHopkins Fund. This sort of involvement by students, aided by<br />\nalumni and other professional contacts, could be an important contribution to any development program aimed at rescuing some of<br />\nthe academic poverty pockets<br />\nwhich Mr. Sloan has been visiting.<br /><br />\nNewspaper Slants Peabody's<br />\nAnalysis in Attack on Dems<br /><br />\nBy CHARLES WOOD<br />\nAn article written by Dr. Robert L. Peabody of the Political<br />\nScience Department,entitled \"Party Leadership Changes in the<br />\nHouse of Representatives\", caused<br />\na stir in Washington last week.<br />\nDr. Peabody's article, which<br />\nappeared in the American Political<br />\nScience Review, presented nonpartisan survey of Democratic and<br />\nDr. Richard Macksey Republican leadership in the House<br />\nsince.1955. According to Peabody,<br />\nFROSH B-BALL<br />\nthe Washington Post, in an editorial on Nov. 20, misused this article<br />\nThere will be a freshman<br />\nas the basis for an attack on Debasketball scrimmage against<br />\nmocratic leadership in general, and<br />\nthe University of Maryland,<br />\nHouse Speaker John McCormack<br />\nBaltimore County campus on<br />\nin particular.<br />\nMonday, Dec. 4, at 4:00 p.m.<br />\nThe Post editorial said that<br />\nthe Speaker McCormack \"is no<br />\nFRESHMAN LACROSSE<br />\nlonger in touch with the dynamic<br />\nThere will be an organiza- elements in his party in the House\"<br />\ntional meeting today at 4:30 and that his \"continuation in the<br />\np.m. in the Athletic Center Speakership is a symbol of the<br />\nacute hardening of the arteries<br />\nClassroom for all potential<br />\nfrom which the Congress in genfreshman lacrosse candidates.<br />\n4 eral is suffering\". According to the<br /><br />\nGridders Gain Championship;<br />\nReverse Long Losing Streak<br /><br />\nPost, Dr. Peabody explains Speaker McCormack's long tenure by<br />\nstating that it is due to the majority status of the Democrats.<br />\nHowever, Dr. Peabody states<br />\nthat he did not infer that Speaker<br />\nMcCormack's position was merely<br />\nan effect of Democratic majority,<br />\nbut also because of the method by<br />\nwhich the Democrats select their<br />\nleaders. While Dr. Peabody said<br />\nthat \"the longer the period of<br />\nmajority status, the more likely<br />\nthe majority party is to develop<br />\nestablished patterns ofsuccession,\"<br />\nhe did not say that this is peculiar<br />\nto the Democrats as the editorial<br />\nimplies.<br />\nThe Post editorial states that<br />\n\"the Republican changes were<br />\nbrought about, not by routine advancement up the leadership ladder, but by means of revolts within the party which led to vigorous<br />\ncontests,\" and advocates these \"revolts within the party\" as the best<br />\nway to solve leadership problems<br />\nin Congress.<br />\nDr. Peabody stated that this<br />\ncharacteristic stems from the fact<br />\nthat the GOP is \"more prone to<br />\nintra-party leadership changes<br />\nthrough contested means\", whereas the Democrats more often<br />\nchoose their leaders on the basis<br />\nof seniority. Dr. Peabody does not<br />\nsay that either method is good or<br />\nbad per se.<br />\nDr. Peabody did say that<br />\n\"House Republicans can take some<br />\nconsolation from one by-product<br />\nof overwhelming election defeats<br />\n- - it moves able younger members into position of high rank far<br />\nquick than any other means.\"<br /><br />\n10)<br />\nsuccess.<br />\nyear's<br />\nthis<br />\nin<br />\ntant factors<br />\nThe boys - especially the captains,<br />\nMark Perlmutter and Denny Ferrazzano seemed ready to shake off<br />\nthe tradition of losing and apathy<br />\naround here, and they did.\"<br />\nThe copious pre-game press<br />\ncoverage for the Hopkins-Western<br />\nMaryland clash of November 18, a<br />\ncontest of little practical concern<br />\nbut much symbolic importance,<br />\nseemed to center on a purported<br />\nduel between Joe Cowan and the<br />\nTerrors' ostensibly — rough defense; but, it was unsung soph<br />\nhalfback Weiss, who had been doing the team's heavy running all<br />\nyear, who finally moved into the<br />\nlimelight. Moving for 195 yeards on<br />\n30 carries including a 34 yard T.D.<br />\nrun, a performance that made him<br />\nthe Southern Division M.A.C.'s<br />\ntop rusher for the year, the 5-11,<br />\n190 pound setback was the key<br />\nfigure in Hopkins' hard-fought<br />\n13-6 win.<br />\nAfter somewhat dominating a<br />\nscoreless first half, the Jays went<br />\nahead 7-0 on Weiss's jaunt following a fumble recovery. After another Hopkins thrust was stopped inside the Terror ten yard line, the<br />\nWestminster club took off on a<br />\n96 yard T.D. drive, but its twopoint conversion try failed. The<br />\nHomewood squad then iced the<br />\nwin via a late scoring march capped by Mark Croft's short plunge.<br />\nThe triumph left Hopkins atop the<br />\nSouthern Division at 6-0; Western<br />\nMaryland and F&amp;M were next at<br />\n3-2.<br />\nThe Western Maryland clash also marked the final Hopkins foot(Continued from Page<br /><br />\nOPEI<br /><br />\nEle l= =If I= =111 =M 11111 I= =I<br /><br />\n\" College Relations Director<br />\nI c/o Sheraton-Park Hotel, Washington, D.C. 20008<br /><br />\n\"Idon't have<br />\ntwo years'experience.<br />\nIhave oneyeartwice<br />\nSome people get experience<br />\nin a job.<br />\nOther people get older.<br />\nThere's a big difference. And<br />\nit all depends on where you<br />\nwork, and with whom you<br />\nwork. You can start some<br />\nplace that has all the proper<br />\nsystems engineering credentials — significant contracts,<br />\nmodern physical plant, and<br />\nthe usual fringe benefits —<br />\nand find yourself a couple of<br />\nyears later, just a couple of<br />\nyears behind.<br />\nOr, you can come to a place<br />\nlike MITRE and get experience. And grow. We have the<br />\ncredentials, of course.(We<br />\nhappen to think they're the<br />\nbest.) But we have something<br />\nmore. An attitude. We want<br />\nyou to get the best systems<br />\nexperience in the business.<br />\nWe want to share what we<br />\nknow with you, want you to<br />\nabsorb it as fast as you can.<br />\nThe quicker you grasp things,<br />\nthe quicker things get done.<br /><br />\nThe more experience you get,<br />\nthe faster you grow.<br />\nAnd that's to our mutual<br />\nbenefit.<br />\nHere's the kind of experience<br />\nyou get<br />\nMITRE is pioneering in the<br />\ndesign and engineering of<br />\ncomplex information, sensor,<br />\ncommand,control and communications systems for the<br />\nUnited States Government.<br />\nOur assignments include<br />\nprominent military electronic<br />\nsystems, as well as civilian<br />\nsystems for future national<br />\nair traffic control and high<br />\nspeed ground transportation.<br />\nWe'd like you to know more<br />\nabout MITRE<br />\nAbout what we do, how we<br />\nthink, and what it might be<br />\nlike to work with us. If you'd<br />\nlike to know more about us,<br />\nand have a degree (preferably<br />\nadvanced) in electronics,<br />\nmathematics or physics, we'd<br />\nlike to talk with you.<br /><br />\nINTERVIEWS WILL BE CONDUCTED<br />\nON CAMPUS DECEMBER 6, 1967<br />\nSIGN UP NOW AT THE PLACEMENT OFFICE.<br />\nOr write for more information: Mr. L.J. Glinos, College<br />\nRelations Coordinator, The MITRE Corporation, Box 208 CN8<br />\nCCO,Bedford, Massachusetts.<br />\nTHE<br />\n,<br />\nOf<br /><br />\n,<br />\n%MIL<br /><br />\nMITRE<br /><br />\nPlease send me<br />\n;a Sheraton Student<br />\nI.D.soIcan saveup<br />\nto20% on<br />\nSheraton rooms.<br />\n11 Name<br />\n▪ Addrem<br />\nReservations with the special low rate are confirmed in advance<br /><br />\n•<br />\n▪ (based on availability) for Fri., Sat., Sun. nights, plus ThanksI giving (Nov. 22-26), Christmas (Dec. 15-Jan. 1) and July I<br />\nI through Labor Day! Many Sheraton Hotels and Motor Inns offer I<br />\nstudent rates during other periods subject to availability at time<br />\nI of check-in and may be requested.<br /><br />\nSheratonHotels&amp;MotorInns<br /><br />\ns 155 Sheraton Hotels &amp; Motor Inns in Major Cities<br />\n=I =I 11= =I OM I= I= 4.11 =I I=<br />\nsow am 1.51<br /><br />\n111= =II I= =5<br /><br />\nJ<br /><br />\nball effort for eight seniors, a<br />\ngroup whose efforts Sotir praised.<br />\nThey include co-captains Perlmutter and Ferrazzano, safety and sub<br />\nquarterback Mike Shaw(\"the hardest hitter for his size we've got\"),<br />\nThomas, Komocki(\"who hung in<br />\non defense despite two knee injuries\"), Bachur (\"whose two field<br />\ngoals provided the margin in the<br />\nF&amp;M game\"), Walt Sienkiewicz<br />\n(\"who improved steadily all<br />\nyear\"),and Scott Black.<br />\nWeiss and Cowan,with, respectively, 639 yards on 114 carries<br />\nand 463 yards on 57 tries for 5.6<br />\nand 8.1 means, provided the bulk<br />\nof the Jay ground totals. Also<br />\ncontributing were Will Scroggs<br />\n(17-83-4.9), Jeff Sienkiewica (3081-2.7), and Croft (23-71-3.1).<br />\nQuarterback Jim Feely (fourth in<br />\nSouthern Division in passing) completed 69 of 108 passes for 1264<br />\nyards (a school record) with five<br />\ninterceptions and twelve touchdowns, (another record). Cowan<br />\n(3-3 for 78 yards and a T.D.),<br />\nShaw (9-5-55 and 2 T.D.'s), and<br />\nSteve Clark(12-1-12 and one T.D.)<br />\nalso made aerial contributions.<br />\nCowan caught 27 passes for<br />\n599 yards and seven touchdowns<br />\n(a school record), Steve Latson 27<br />\nfor 458 and six scores, and Sienkiewicz eight for 128 yards. Cowan's punting average, kickoff return yardage (354), kickoff return touchdowns (two) total<br />\npoints, and touchdowns scored<br />\n(14) also set school records.<br />\nThe 1967 Baltimore Sun AllState Small College team included<br />\nthe following Hopkins players:<br />\nFirst Team (offense) End Steve<br />\nLatson, Guard Don Yablonowitz,<br />\nCenter Mark Perlmutter, and (as<br />\nmentioned) Cowan;(defense) Middle Guard Phil Schrodel; and<br />\nand (specialty) Cowan as Punter;<br />\nHonorable Mention: (Offense)<br />\nguard John Peck, Quarterback<br />\nFeely, and Halfback Weiss; (defense) Tackle Wit Holden, Linebacker Dennis Ferrazzano, and<br />\nSafety Will Scroggs.<br />\nThe team's Athletic Banquet,<br />\nwith Sun Sports Editor Bill Tanton as guest speaker, will be held<br />\non December 13. Four awards will<br />\nbe made: the Huddle Club Award<br />\nto the Hopkins player who has<br />\nmade the most outstanding contribution to football here in 1967;<br />\nthe Charles E. Aronhalt Memorial<br />\nTrophy to the team's outstanding<br />\nlineman (Aronhalt, recently killed<br />\nin South Vietnam, was captain of<br />\nthe 1963 team); the Senior Award<br />\nto the squad's outstanding senior;<br />\nand the Booster Club Unsung Hero<br />\nAward.<br /><br />\nThe Catholic Community<br />\nOn Campus<br />\nSUNDAY, DECEMBER 3rd<br /><br />\n10:30 A.M.<br /><br />\n'FOLK' MASS<br />\nFRIDAY, DECEMBER 8th<br /><br />\n12:00 Noon<br /><br />\nMASS FOR THE FEAST OF THE<br />\nIMMACULATE CONCEPTION<br />\n(A Holy Day of Obligation)<br /><br />\nCORPORATION<br /><br />\nAn Equal Opportunity Employer (Male &amp; Female)<br />\nFormed in 1958 . . . pioneer in the design and development of command and<br />\ncontrol systems . . . MITRE serves as technical advisor and systems engineer<br />\nand<br />\nfor the Electronic Systems Division of the Air Force Systems Command<br />\nprovides technical assistance to the Federal Aviation Administration, the Department of Defense, the Department of Transportation and the National Aeronautics and Space Administration.<br /><br />\nThe above Masses will be in Levering Great Hall.<br />\nMass is also celebrated in NEWMAN HOUSE,<br />\n2941 N. Charles, Monday thru Friday.<br /><br />\nHOMEWOOD,BALTIMORE, DECEMBER 1, 1967<br /><br />\nNEWS-LETTER<br /><br />\nPAGE NINE<br /><br />\nNetniks Not Noteworthy<br />\n10)<br />\nThe probable starting lineup<br />\nfor tomorrow night's clash consists of captain Brian Berke, a 6-1<br />\njunior, and 5-8 senior Jim Calli as<br />\nguards, 6-3 senior Joe Carlton and<br />\nand 6-2 junior Bob Spence in the<br />\nforward spots, and 6-4 sophomore<br />\nRich Thielke at center, with 6-1<br />\nsenior and 5-4 junior guards Mike<br />\nSullivan and Hal Thorne and 6-5<br />\nand 6-4 soph forwards Jeff Thomas and Jim Novick likely to see<br />\nmuch action. Also available are<br />\n6-6 junior Wade Wright, 6-7 soph<br />\nBill Piotrowski, 6-2 soph Hugh<br />\nWilson, and 6-3 senior John Sweeney. Spence, out much of the preseason with a severed tendon in<br />\nhis finger is somewhat doubtful;<br />\nif he is unavailable, either Thomas<br />\nor Novick will fill in.<br />\n(Continued from Page<br /><br />\nAs implied above, Ciccarone's,<br />\npreviously-employed three-guard<br />\noffense, a standard here for two<br />\nyears, has now — mainly in an effort to get more board strength —<br />\nbeen replaced by a more conventional setup. In this two-guard<br />\nalignment, one of the big men<br />\n(usually Thielke, maybe Spence)<br />\nor on occasion a guard (Sullivan;<br />\nwhen in) will play a high post and<br />\nthe offense will often be initiated<br />\nby a pass thereto and more there<br />\nfrom.<br />\nOffensive Potential<br />\nAlthough the new setup has<br />\ncaused some problems of adjustment in the scrimmages, scoring<br />\ncapability is hardly one of the<br />\nteam's problems. In guards Calli<br />\n'(15.8 last year and 17.5 as a soph)<br />\nand Berke (17.8 and 41% from the<br />\nfield), Ciccarone has two of the<br />\nmore potent point-makers in the<br />\nM.A.C.,though the former slumped<br /><br />\nDICK FOWLER<br />\nBsmE, U. of California,<br />\njoined Bethlehem's<br />\n1964 Loop Course.<br />\nAssigned to the<br />\nmaintenance and<br />\nengineering departments<br />\nof our South San Francisco<br />\nPlant, Dick handles<br />\nassignments,,throughout<br />\nthe plant. A typical project<br />\nwas designing and<br />\nsupervising installation<br />\nof a complex hydraulic<br />\nmechanical transfer<br />\nSystem.<br />\nMANAGEMENT<br />\nMINDED?<br />\nCareer prospects are<br />\nbetter than ever at<br />\nBethlehem Steel. We need<br />\non-the-ball engineering,<br />\ntechnical, and liberal arts<br />\ngraduates for the 1968<br />\nLoop Course. Pick up a<br />\ncopy of our booklet at your<br />\nplacement office.<br />\nAn Equal Opportunity<br />\nEmployer in the Plans for<br />\nProgress Program<br /><br />\nBETHLEHEM<br />\nSTEEL<br /><br />\nbadly in field goal percentage for<br />\n'66-67 (40% to 33%). The baseline drives of Sullivan (8.6 and<br />\n32%), the chief backcourt reserve,<br />\nhave become staple fare for Jay<br />\ncage fans by now, but the 6-1<br />\nsenior's outside shooting has left<br />\nsomething to be desired. Thorne,<br />\nthe fourth guard, is not much of<br />\nan offensive threat.<br />\nAmong the big men, Spence<br />\n(10.6 and 50%, 17.5 for the last<br />\nhalf of last season) and Carlton<br />\n(7.7 and always over 40%)are ex-<br /><br />\ncellent shots, while Thielke (13.4<br />\nwith the frosh) is inconsistent<br />\nfrom the floor.<br /><br />\nTHE JOHNS HOPKINS UNIVERSITY<br /><br />\nThe group's defensive capabilities, though, are not nearly so well<br />\ndeveloped as its offensive capacity.<br />\nAmong the guards, Calli (though,<br />\ninconsistent), Sullivan, and Thorne<br />\nare above average defensively,<br />\nwhile Berke does much better at<br />\nthe other end of the court. On the<br />\nfront line, however, problems<br />\nabound.<br /><br />\nChristmas Concur<br /><br />\nGLEE CLUB<br /><br />\nSHRIVER HALL<br />\nDECEMBER 3,1967<br />\n8:30 O'CLOCK<br /><br />\nWho does he think he is,<br />\nPatrick Henry?<br /><br />\nYou'd better believe it.<br />\nIf only because he does. That's enough<br />\nFor his countrymen: belief in him<br />\nAnd in Liberty.<br />\nThe Spirit of'76... in '67<br />\nIt won't take him as long as it took us<br />\nTo be heard;<br />\nTo be listened to.<br />\nThe United Nations will see to that.<br />\nHis vote, as big as ours<br />\nOr Russia's or Holland's will see to that.<br />\nWhich was the whole idea in San Francisco<br />\nWasn't it?<br />\nYou,of all people, must believe it.<br />\nYou are our life insurance.<br /><br />\nPhoenix<br />\nMutual<br />\nLIFE INSURANCE COMPANY<br />\nHARTFORD<br /><br />\nCONNECTICUT<br /><br />\nADMISSION FREE<br /><br />\n***<br /><br />\nHOMEWOOD,BALTIMORE,DECEMBER 1, 1967<br /><br />\nNEWS-LETTER<br /><br />\nPAGE TEN<br /><br />\nNEWS<br /><br />\nSPORTS<br /><br />\nLETTER<br /><br />\n*<br /><br />\nWinning Grid Year Booters Lose Match Basketball Prospects<br />\nDickinson Devils; Approach The Blues<br />\nEnds Losing Habit Tochieve<br />\nWinningYear<br /><br />\nBy MIKE PHILLIPS<br />\nTriumphant over arch-rival Western Maryland in its season finale,<br />\nthe varsity football team - via possibly the most spectacular oneyear grid reversal in Hopkins grid<br />\nhistory - has finished the 1967<br />\ncampaign with a 6-1 mark, the<br />\nSouthern Division Middle Atlantic Converence title, numerous<br />\nnew school records, and an abundance of individual honors.<br />\nIn moving up from 1966's<br />\n0-6-2 card, the team broke a sixyear string of losing season (8-34-5<br />\ncumulatively during that stretch);<br />\nand came up with the best Homewood grid performance since the<br />\nglory days of 1959-60, when Hopkins squads coached by Wilson<br />\nFewster finished 7-1 and 5-2-1.<br />\nProbable causes of the rise are<br />\nnumerous.<br />\nFirst among the group's more<br />\ntangible assets as it entered the<br />\n1967 campaign was its returning<br />\ncrew of twelve lettermen, seven<br />\nconcentrated in the offensive line<br />\nand all bloodied and hardened by<br />\n1966's misfortunes. Of further<br />\nimportance was the equally-sized<br />\nupcoming sophomore group - most<br />\nimportantly, defensive tackles Jim<br />\nLotto and Ken Brown, halfback<br />\nPaul Weiss, offensive linemen Bill<br />\nNcrsesian and Mike Wilbanks, and<br />\nlinebacker-end Wil Rholfing —<br />\nfrom 1966's undefeated freshman<br />\ngroup.<br />\nNewcomers Shine<br />\nMore surprising -- and certainly<br />\nvital to Coach Alex Sotir's planned<br />\ntwo-platoon system — were the<br />\nperformances of a group of playrs absent for varying lengths of<br />\ntime from the grid wars. Chief<br />\nimong these were sometime-place<br />\nkicker Wes Bachur, defensive linemen Wit Holden and Brian Turner,<br />\ndefensive backs Dave Thomas and<br />\nCharlie Coker (all of whom had<br />\nnever played football at Hopkins),<br />\nand defensive end Dave Komocki.<br />\nSotir was especially pleased by the<br />\njobs done by Coker and Thomas,<br />\nstating that this twosome, despite<br />\ninexperience, \"were never beaten<br />\ndeep all year.\"<br />\nAlso on the list of extended<br />\nlayoffs, but perhaps deserving of<br /><br />\n\"Brandy\" Picked<br />\nAs New Trainer<br />\nMr. LeRoy Brandimore, an exNaval Corpsman has recently been<br />\nappointed by the Athletic Department as athletic trainer. Ile will<br />\nreplace the late Jimmy Benson<br />\nwho served for 41 years.<br />\nA Naval veteran of twenty-three<br />\nyears Mr. Brandimore will assume<br />\nhis duties on December 1 . Serving<br />\nas a Hospital Corpsman,First Class,<br />\nhe has made two tours 01 duty as<br />\nassistant trainer at the Naval Acadmy during a five- year period.<br />\nMr. Brandimore received extensive medical and administration<br />\nexperience during his Naval service,<br />\nwhich has included some action in<br />\nthe vicinity of Vietnam. The new<br />\ntrainer is forty-two years of age<br />\nand he resided in Arnold. Maryland.<br />\nMarshall Turner commented<br />\nthat he was pleased that Mr.<br />\nBrandmoie was able to come to<br />\nthe Hopkins. Turner stated that<br />\nBrandimore would definitely \"be<br />\nan asset\" to the athletic staff.<br /><br />\nJOE COWAN<br />\nhis own categorization, is wingback Joe Cowan, a recent Honorable Mention Little All-America<br />\nchoice in his first year of football<br />\nsince 1964. The 5-10, 175 pound<br />\njunior, probably Hopkins' top offensive threat all year, played a<br />\nvital role in at least four of the<br />\nJays' six wins, and in the process<br />\nbecame a Baltimore Sun First<br />\nTeam All-Maryland pick. He led<br />\nthe Southern Division of the Middle Atlantic Conference in scoring<br />\n(77 points, 89 for the season) and<br />\npunting (41.8 yards per kick),<br />\nwhile finishing fourth in that league in rushing and eighth in pass<br />\nreceiving.<br />\nFew Injuries<br />\nSotir, for his part, was more<br />\napt to stress the role that luck<br />\nplayed in 1967 Jay grid successes.<br />\n\"We were very fortunate injurywise this season,\" he related;\"since<br />\nmost of our key players went the<br />\nseason unhurt. It's a good thing<br />\nthey did,\" the varsity mentor continued, \"because there wasn't too<br />\nmuch depth behind them.\"<br />\n\"We were also lucky to get off<br />\nto a good start, and thus gain momentum we never lost. Our opening game with Franklin and Marshall (a 19-14 win in the final<br />\nminutes) could easily have been<br />\nlost, and if it had the whole season might have been different.\"<br />\n\"The team's attitude and motivation, though,\" he went on,<br />\n\"were probably the most impor(('ontinued on Page 8)<br /><br />\nBy BOB HYAMS<br />\nThe Hopkins Soccer team gained its first winning season since<br />\n1964 by posting an overall record<br />\nof 6-5 this year.<br />\nThe Jays lost their final match<br />\non Saturday, November 25 to<br />\nDickinson College by a score of<br />\n2-1. It completed a season which<br />\nwas highlighted by our beating<br />\nDrexel for the first time in 20<br />\nyears.<br />\nThe booters finished on a strong<br />\nnote, winning three out of their<br />\nopponents' total of 19. They outshot their opponents 235-166. A<br />\nteam is supposed to score on the<br />\naverage of one goal for every 10<br />\nshots.<br />\nIn the losing Dickinson game,<br />\nthe Jays scored in the first 20 seconds on a toss-in from out of<br />\nbounds. Kit Battenfeld headed the<br />\nball to Randy Miller who collected the goal. Also assisting on the<br />\nplay was Art Guerin.<br />\nDickinson tied the score at 1-1,<br />\nthree minutes later. There was no<br />\nfurther scoring until the final four<br />\nminutes in the last quarter when a<br />\ncorner kick resulted in a scramble<br />\nin front of the Jay goal, culminating in the winning Dickinson<br />\nscore. Dickinson completed its season with an 8-2-2 record.<br />\nNext year the team loses four<br />\nstarters via graduation: Wes Bachur, Kit Battenfeld, Peter Martindale, and John Sarney. There will<br />\nbe 13 returning lettermen with<br />\nsome good freshmen moving up to<br />\nthe varsity. Coach Barrette felt<br />\nthat the team would be stronger<br />\nnext year with the major scoring<br />\npunch coming from Dave Roberts,<br />\nKen Niman and Bernie Wenker.<br />\nCoach Barrette was pleased with<br />\nthe fine year-round effort. Pete<br />\nMartindale, who took over the<br />\ngoalie position from Mike Avery<br />\n(All-Conference last year) only<br />\ngave up 11 goals in eight games.<br />\nAlso deserving Kudos are sophomores Randy Miller and Rich Tobey and co-captains Wes Bachur<br />\nand John Sarney.<br /><br />\nAttempting to reassert itself<br />\nafter last year's disappointments,<br />\nthe varsity basketball team — virtually intact from 1966-67 but<br />\nsomewhat altered in style and<br />\nwith prospects best described as<br />\nambiguous — will open its current<br />\ncampaign by hosting Haverford<br />\ntomorrow at 8:30 p.m.<br />\nHead Coach Henry Ciccarone,<br />\nyet to field a winner in five tries<br />\n(the last Hopkins cage crew above<br />\n.500 played in the late 1940's),<br />\nrated Haverford as \"just about our<br />\nweakest opponent this year\" and<br />\nadded — accurately enough — that<br />\n\"If we don't beat them it could<br />\nmean a long season.\"<br /><br />\nCiccarone's moderate pessimism — a feeling shared by many<br />\nof the team's observers — would,<br />\nconsidering the return of six letterp.m and four starters, the presence of some good sophomore<br />\nprospects, and availibility of the<br />\nsize much lacking last season, appear groundless; but awareness of<br />\nthe course of the 1966-67 Jay<br />\ncampaign and so-so pre-season<br />\nscrimmage performances justify<br />\nhis concern.<br />\nOverconfidence<br />\n\"After all of iast year's overconfidence (Hopkins, picked for<br />\nbetter things by most, finished<br />\n7-5 in the Southern Division of the<br />\nMiddle Atlantic Conference and<br />\n8-9 overall), a little pessimism<br />\naround here won't hurt,\" opined<br />\nCiccarone. \"We didn't get very<br />\nmany breaks a year ago, but that<br />\nwas hardly the only reason we did<br />\nrelatively poorly: too many peo-<br /><br />\nple thought too many games were<br />\nwon before the season even started.<br />\nThe team has got to play its games<br />\none at a time.\"<br />\nThe cagers' scrimmage performances have hardly been such as<br />\nto dispel the above forebodings.<br />\nIn 95-86 and 74-65 wins over an<br />\nAlexandria (Va.) amateur team<br />\nand Southeastern University and<br />\n84-62, 80-75, and 75-49 losses to,<br />\nrespectively, Howard University,<br />\nBaltimore Junior College,and Morgan State College (Hopkins scrimmaged Baltimore University Wednesday night), the Jays — have<br />\nlooked effective only in spots,<br />\nalthough the latter three foes are<br />\nprobably superior to most of the<br />\nopposition they will see this year.<br />\n(Continued on Page 9)<br /><br />\nt1<br /><br />\nsa<br />\ngf<br /><br />\nPlayer Goals Assits Total Points<br />\nGuerin<br />\nBachur<br />\nRoberts<br />\nMiller<br /><br />\n4<br />\n4<br />\n1<br />\n0<br /><br />\n4<br />\n2<br />\n3<br />\n3<br /><br />\n8<br />\n6<br />\n4<br />\n3<br /><br />\nTHEATRE HOPKINS<br />\n1967-1968 Season<br />\nStudent Season Subscnptions still<br />\navailable 5 Productions For ;5.00<br /><br />\nTicket Office,Shriver Hall<br />\nThe Johns Hopkins University<br />\nBaltimore, Maryland 21218<br />\n(Single per play admission $2.25)<br />\nLast season more than 700 people were<br />\nturned away in a single week-end.<br />\nHopkins students, new and old, try:<br /><br />\nPecora's Restaurant<br />\nfor the finest Italian food in town<br /><br />\nIn the December issue of Cheetah, writer Rob Ross travels with<br />\nsmugglers as they make a run<br />\nfrom Tijuana to Southern California. It's a scary, nasty,fascinating<br />\nreport. And—Tom Nolan writes<br />\nabout the \"groupies\"--the girls<br />\nwho'll do anything for a star.<br />\nThere are also stories on campus movies, rock lyrics, \"uptight\" Washington, D.C. and part<br />\none of a three part look at the<br />\nunderground religions. This and<br />\nmuch more in<br /><br />\nefaN4<br />\nNow at your newsstands<br />\n(P.S. For an annual subscription to<br />\nCheetah, send $5.00 in check or<br />\nmoney order to Cheetah Magazine,<br />\n1790 Broadway, N.Y., N.Y. 10019.)<br /><br />\n3320 Greenmount Ave.<br />\nSPAGHETTI MEALS<br />\nPIZZA PIE A SPECIALTY<br /><br />\nCARRY OUT SERVICE<br />\nCALL 0139-3031<br /><br />\n%l<br />\n- o- v0,440-0Td-F_<br /><br />\ncic<br />\nhi<br />\nth<br /><br />\nlar<br />\ntb<br /><br />\ncal<br />\nHi<br /><br />\ndei<br /><br />\nPar<br />\nten<br />\non(<br />\nlog,<br />\nses.<br />\non<br /><br />\n0 1<br /><br />\nCic<br /><br />\ncolt<br />\ntint'<br />\nduie<br />\nFeu<br /><br />\n,,S9c<br />\n,<br />\nlok<br />\nreia t<br /><br />"}], "field_media_file": [{"target_id": 40254, "display": null, "description": null, "target_type": "file", "target_uuid": "8a12b692-4c2f-45e1-b2b7-97e5b0f5d698", "url": "http://digital.library.jhu.edu/system/files/2022-03/13941-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13941, "target_type": "node", "target_uuid": "15544b7a-e4fd-4bfc-8bb0-5820b1a84ed0", "url": "/node/13941"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "d44186a2-64a4-40e3-a19c-1b18b91730a8"}]}