{"mid": [{"value": 38187}], "uuid": [{"value": "8a0fbb57-6ae6-4866-b534-0e3ae406b530"}], "vid": [{"value": 38187}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:50:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12754-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:50:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:50:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Ice<br />\nler<br />\nne<br />\n2)<br />\nJand.<br />\ndner,<br />\n<br />\nFIRST EDITORIALS OF<br />\nNEW REGIME<br />\n—Page 2<br />\nVOL. XLI, NO 23<br />\n<br />\nHOMEWOOD, BALTIMORE, FEBRUARY 16, 1937<br />\n<br />\nStormers Elect<br />\nNine Candidates<br />\nTo Membership<br />\n<br />\nlmer,<br />\n<br />\nrime,<br />\n<br />\nMorrow Only Man Chosen<br />\nFor Acting Staff<br />\nBy Group<br />\n<br />\n[cher,<br />\n<br />\nEXACTING STANDARDS<br />\n<br />\nAner,<br />\nfary-<br />\n<br />\ndler,<br />\nland;<br />\nHopRad3.<br />\n<br />\n3Joilits•i*tpltius Nrius-Krttrr<br />\n<br />\nOfficers To Discuss Plans<br />\nFor A Second<br />\nProduction<br />\n<br />\nCALL FOR NEWSLETTER CANDIDATES<br />\nWEDS., 12.20<br />\n<br />\nHOME CONCERT<br />\nTICKETS<br />\nTickets for the Musical Club<br />\nConcert may now be obtained in<br />\nLevering Hall in exchange for the<br />\nS.A.C. ticket stub.<br />\nAdditional<br />\ntickets may be obtained at the<br />\nsame time for one dollar each.<br />\nThe Home Concert is scheduled<br />\nfor Friday, February 26, in the<br />\nMaryland Casualty Auditorium. A<br />\nfull program, to be printed next<br />\nweek in the NEWS-LETTER, arranged, with the Glee Club, Banjo<br />\nClub, Hawaiian Troupe, soloists,<br />\nquartet, and Blue Jay Orchestra<br />\nparticipating.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nFisk U. Professor Dues Discussion<br />\nTo Speak Tonight At Frosh Assembly<br />\nBefore Supper Club This Thursday<br />\nJanies Weldon Johnson New Budget System ConsidProminent As Author And<br />\nered; Plan To Take<br />\nRacial Leader<br />\nAction<br />\nTopic Is The Negro', The<br />\nFurther Assembles Planned;<br />\nTest Of Democracy<br />\nMusical Club On<br />\nIn America<br />\nFebruary 25<br />\n<br />\nFinkel Elected<br />\nTo Editorship<br />\n.01 Newspaper<br />\nNew Editor Has Served<br />\nOn News-Letter For<br />\nThree Years<br />\nSTARTS<br />\n<br />\nTHIS<br />\n<br />\nISSUE<br />\n<br />\nVaried Activities Include<br />\nMusical Club, 'Stormers<br />\nClass Committees<br />\n<br />\nDr. James Weldon Johnson, Professor of Creative Literature at Fisk<br />\nThe second assembly under the<br />\nUniversity, and former American newly tried scheme of voluntary<br />\natconsul to Venezuela and Nicaragua,<br />\ntendance will be devoted to a discusStanley M. Finkel was elected last<br />\nwill be the Supper Club Speaker toThe Barnstormers, dramatic society<br />\nFriday to serve for the corning year<br />\nnight at 6:00 at Levering Hall. His sion of freshman class dues this<br />\nof the Johns Hopkins University, held<br />\nas editor-in-chief of the NEWStopic will be \"Cultural Contribution Thursday, February 18 in Remsen 1.<br />\none of their periodic elections to the<br />\nLETTER. Finkel, a former associate<br />\nof the Negro to America.\" He will Attendance at the first of the new<br />\nvarious staffs of this organization,<br />\neditor, took over the post previously<br />\nspeak at the<br />\nWilson<br />\nMemorial type assemblies that of last week,<br />\nlast Friday, electing nine new memheld by William Diamond immediChurch, on the University Lecture was adjudged \"Fine\" by ershner<br />\nbers to the club.<br />\nately after the election. He had deseries at 8:15 on the subject \"The Cross, President of the Student CounAdditions to the Production Staff,<br />\nfeated Harold Zheutlin, assistant<br />\nNegro: The Test of Democracy in cil. The meeting place has not yet been<br />\nand the Business and Acting Staff,<br />\nsports editor, in the race for the<br />\nAmerica.\"<br />\ndecided.<br />\nwere made by the election. Qualeditorship.<br />\nDr. Johnson will be introduced at<br />\nThe discussion will be started by<br />\nifications, in<br />\nkeeping<br />\nwith<br />\nthe<br />\nFinkel, a Junior in the College of<br />\nthe Supper Club by H. Milton Wagner,<br />\nan explanation of the new dues budtraditionally exclusive element in the<br />\nArts and Sciences, takes office after<br />\n'12, President of Baltimore Urban<br />\nbasic principles of the group, were<br />\na period of three years service on the<br />\nLeague and member of the Levering get sytem by Hershner Cross. Advanquite stringent. Eligibility was limHall Board of Managers. Dr. Ivan E. tages of the new system as opposed to<br />\n—Courtesy News-Post paper, which began a week before he<br />\nited to those devotees who had proven<br />\nMISS MARY B. SHEPHERD<br />\nentered the University. His experience<br />\nMcDougle, Professor of Socioligy and the one now in operation will be<br />\ntheir enthusiasm for the carrying out<br />\nincludes terms as Junior, Associate<br />\nEconomics at Goucher will introduce stressed. It will be brought out that,<br />\nof the purposes of the 'Stormers, had<br />\nanu Assistant Managing Editor.<br />\nDr. Johnson at the Wilson Memorial<br />\nunder this new budget system, presgiven evidence of their ability as<br />\nThle greatest crowd to attend a Church.<br />\nDuring his high school and college<br />\nent freshmen need have no fear of<br />\neither administrators or actors, de- Hopkins public lecture in many years<br />\ncareers, the incoming editor has<br />\nBar Member<br />\npending on the office the individual<br />\nserved with four past NEWS-LETTER<br />\nProminent as an author and racial further added assessment in their<br />\nyesterday heard Dr. Salvador Madariwas trying out for; and except in unleader, Dr. Johnson has served for senior year, whereas, under the preschiefs, Stanley<br />\nBlumberg, Jesse<br />\nago, secretary of the disarmament<br />\nusual cases, no candidate was eligimany years as Secretary of the Na- ent system, there is every probability<br />\nBorden, Kenneth Zierler and William<br />\nble unless he had two or three years conference of the League of Nations, tional Association for the AdvanceDiamond. At Baltimore (...Ity College,<br />\nof additional taxation in their last<br />\nof active service as a background. denounce Fascism and Communism ment of Colored People. He is a gradhe was Editor of the Greenbag, senior<br />\nAn exception might be made for those as menaces to world peace. The for- uate of Atlanta University, and has year.<br />\nanual, and the weekly Collegian.<br />\nFurther Plans<br />\nwho had been particularly active for mer Spanish<br />\nFinkel is the fifth successive City<br />\nAmbassador to the received degrees at Columbia UniExplanations<br />\nwill be followed by<br />\na one year period. In all cases, howversity,<br />\nTalladega<br />\nCollege,<br />\nCollege graduate to win the editorship.<br />\nand HowUnited States discussed Spain and<br />\never, the aspirant to an office on the<br />\nard University. In 1906 he served as a discussion along the lines of an<br />\nAs a major in Psychology, he has<br />\nBarnstormers had to be approved by World Peace on a half hour's notice. United States Consul to Puerto Cab- open forum. When all discussion is<br />\nwon several scholastic honors during<br />\nat least three-quarters of the mem- He had thought he was to speak on an ello, Venezuela, and as Consul to Cor- at an end, a vote of the men present<br />\nMiss Mary Briscoe Shephard, a his period at the Hopkins. As a freshentirely unrelated topic.<br />\nbers of the club for consideration.<br />\ninto, Nicaragua, from 1909 to 1919. will be taken, and a conclusion ar- debutante<br />\nof a season ago, has been man he held the City College Alumni<br />\nEmphasizing his love for peace, Dr. He also is a member of the Florida<br />\nOne Actor Chosen<br />\nScholarship. In his sophomore and<br />\nrived at by this means.<br />\nchosen<br />\nas sponsor for the Second<br />\nMadariaga declared that the world Bar.<br />\nJames Morrow, senior, was the only<br />\njunior years have come to him reThe assembly was originally supDr. Johnson has been best known posed to be held in Latrobe Hall Cotillion to be held at the Lord Balti- spectively the Woodyear and Horman chosen to the Acting Staff. Mor- had achieved unity through the cinrow has been active in other extra- ema, expanding industry and a gen- for his work as Secretary of the Na- 120. However, that room will not be more Hotel next Monday night, ac- tense G. Moses awards. He holds, in<br />\ncurriciular activities including the erally better knowledge of itself than tional Association for the Advance- available for the assembly as it will cording to an announcement made addition to a trustee's grant, a post<br />\nment of Colored People, and for his be neede at that time for the instal- yesterday by<br />\nswimming team, the NEWS-LETTER, existed twenty years ago.<br />\nthe Cotillion Board. Miss as assistant in the Psychology De\"Countries are not self-different. own work in music. He collaborated lations of the exhibits for the Engithe Musical Club, quartette, DebatShepherd is the daughter of Mr. and partment.<br />\ning team Morrow has the further dis- France and Germany during the late with his brother in writing for the neering Show.<br />\nIn three years at the University,<br />\nMrs. F. Byrn Shepherd of 1414 Park<br />\nWhen arrangements are completed<br />\ntinction of being president of the war had an agreement to exchange light opera stage, and produced the<br />\nFinkel has also taken part in several<br />\nhonorary journalistic society, Pi articles each needed to carry on the English version of the libretto to the for obtaining another room for the Avenue.<br />\nextra-curricular activities. He is pubstruggle through the intermediary, grand opera \"Goyescas,\" which was meeting; the new meeting place will<br />\nWith the choice of a sponsor, the licity director for the Musical Club<br />\nDelta Epsilon.<br />\nSwitzerland.<br />\npresented in the Metropolitan Opera be announced on the various bulletin Cotillion Board,<br />\nFive men, outstanding for their<br />\nhaving completed its and the Barnstormers and holds a<br />\nHouse<br />\nin 1915.<br />\nboards.<br />\n\"I<br />\nbelieve<br />\nthat<br />\nthrough<br />\nonly<br />\npolitiwork, were chosen to the Production<br />\nfinal arrangements, this week settled place in the Glee Club. He is a former<br />\nAmong his writings are included<br />\nAn assembly has already been armember of the Hullabalo Staff. Last<br />\nStaff. The first, Arnold Glantz, jun- cal liberalism freed from graft and<br />\n\"The<br />\nAutobiography of An Ex-Col- ranged for the following week, Febru- down to the task of turning Hal Kemp spring he was tapped by Pi Delta<br />\ncorruption<br />\ncan<br />\nthe countries and peoEpior, is a member of the Pi Lambda Phi<br />\nored Man,\"\"The Book of American ary 25. The student Council has se- into a financial as well as harmonic silon, national honorary journalistic<br />\nfraternity and holds, as one of his ples of the world survive and make<br />\nNegro Spirituals,\" \"Second Book of cured the Musical Club for that date, asset to Commemmoration Day festiv- fraternity, and was elected<br />\nto serve<br />\nmany accomplishments, guitar-play- for peace. Communism and Fascism<br />\nSpirituals,\"<br />\nManhattan,\" and the Club will give its first pro- ities. If the change-box<br />\n\"Black<br />\nideoligies<br />\nare<br />\nmere<br />\nsacrifice<br />\nthat<br />\nthe<br />\ning. Maurice Lazarus, junior, is also a<br />\ncontinues its as its Treasurer. He is also Secretary<br />\n\"God's Trombones,\" and \"Along This gram of the year to Hopkins students<br />\nmember of Pi Lam, who merited a individual to the nation. Never was a<br />\nmerry jingle unabated throughout the of Phi Sigma Delta fraternity.<br />\nWay,\" (his autobiography).<br />\nat that time.<br />\ntime<br />\nexpression<br />\nimportant<br />\nmore<br />\nfor<br />\nFinkel has also been active in the<br />\nposition on the Production Staff. The<br />\nweek, the Board faces the happy prosaffairs of his class. During his first<br />\nthird Man picked was Joseph Sarno- of individualism and expression than<br />\npect of counting an overflow house at<br />\ntwo years he served as a member of<br />\nvitz, junior, who is, in addition to his today.\"<br />\n$3.50<br />\na head next Monday evening. the Freshman and Sophomore BanBarnstormers activities, a candidate<br />\nHal Kemp and his Orchestra, as we quet Committes. Last year he served<br />\nfor the NEWS-LETTER staff at the<br />\npresent time.<br />\nmay have intimated in earlier para- as publicity director for the joint<br />\nFreshman-Sophomore Dance.<br />\nDaniel Gidinski, junior, and Milton<br />\ngraphs, are promised and hoped for<br />\nHe was recently elected Secretary<br />\nSaul, junior, manager of the crosson the bandstand. And Mr. Kemp, acof the Junior Class.<br />\ncountry and track team, were elected.<br />\ncording to the Public Relations Department of Music Corporation of<br />\nOn the business staff, David Halle,<br />\n\"The material which we are workAmerica, is \"making history in the<br />\nsophomore, member of the basketball<br />\ndance world.\" The slightly prejudiced<br />\nSquad; William Mehling, sophomore, ing with now is the best that I have<br />\nof the varsity football squad, and ever seen in my ten years of associa- To the Editor of the NEWS-LETTER:<br />\nMr.<br />\nhas been assessed two opinion of the MCA's Charley MichRobert McShane were added to the tion with the Musical Club,\" stated<br />\nEarly in the year some writer for charges of $5.00 each represent- elsons as to Mr. Kemp's merits seems Chen, Johnston Scholar Receives<br />\nOsmar Steinwald, coach of the Glee the NEWS-LETTER affronted the resi- ing penalties for infractions of dor- to be generally current throughout<br />\nroll.<br />\nA. A. A. S. Grant<br />\nAt the meeting it was decided that Club. \"The spirit and cooperation of dents of B entry in the Dorm by mitory regulations entered into on the Hopkins. For he's certainly makDr. T. T. Chen, Johnston Scholar<br />\nthe officers of the Club, presided over the boys have made an enthusiastic characterizing that entry as \"tame.\"<br />\nJanuary 29, 1937, and Feb. 4, 1937, ing more than history for the Cotillion<br />\nin the Department of Zoology, reby Martin Levine, senior, would meet and active group of the campus' lar- Ever since then the chief end in life<br />\nby residents of B entry of the Al- Board's coffers.<br />\nsoon to discuss possibilities of a new gest organization.\"<br />\nfor said residents—at least a few of umni Memorial Hall Dormitory, in<br />\nAs a matter of fact, Mr. Kemp ceived a grant for research from the<br />\nelection and to consider arrangements<br />\nwhich Mr.<br />\nresides. These comes here with something more than American Association for the AdOs reported that he has heard from them -has seemed to be to redeem<br />\nfor a second Barnstormers production numerous authorities who have ob- themselves from that terrible insult. infractions took the form of general a baton, a prayer, and the good wishes vancement of Science, it was anfor the current year.<br />\nserved previous Musical Clubs that IIn pursuing this noble purpose they rough housing and the throwing of of the management. Max Kalish, the nounced in a current issue of Science.<br />\nThe grant, according to the Assothis year's group is one of the out- have had recourse to several forms of \"miscels\" to the endangerment of sculptor, is reported to have recently<br />\nstanding ones turned out at the Hop- \"hell-raising\": they have unwound persons and property. Residents of named him the world's outstanding ciation's announcement, is \"for rekins. The coach attributed this to the the fire-hose and turned water al over of the dormitory previously had bandmaster, and, as such, immortal- search on the physical basis of heredincreased interest in music, which he the entry; they have thrown electric<br />\nbeen notified that any group having ized him in bronze. For two years, ity in unicellular organisms. The besaid<br />\ngrowing<br />\nis<br />\nevery<br />\nrooms<br />\nyear.<br />\nin the vicinity of recurring the National Institute of Social havior of chromosomes in fission, enmilk-bottles<br />\naround<br />\nlight bulbs and<br />\nThe incoming February class of the<br />\ninfractions would be accountable. Dancing, representing 1,200 acade- domixis, and conjugation in paramenumbers;<br />\ngoodly<br />\nin<br />\nhave<br />\nthey<br />\neven<br />\nLarge<br />\nNumber<br />\nHopkins was announced by Miss Irene<br />\nis found guilty in the<br />\nmies in the United States, has des- cium in relation to problems of hered\"An unusually large number of men built miniature bon fires in the enry. If Mr.<br />\nDavis, registrar, to consist of fourteen<br />\nfuture<br />\nserious<br />\ndisturbcreating<br />\nof<br />\na<br />\nignated<br />\nKemp as the country's most ity and variation in Protozoa.\"<br />\nLast<br />\nall,<br />\neffort<br />\nfinal<br />\nof<br />\nin<br />\nachieve<br />\na<br />\nto<br />\nturned<br />\nout<br />\nyear<br />\nthis<br />\nand<br />\nsome vocal<br />\nMembers from Baltimore and one<br />\nPrevious to his work at Hopkins,<br />\nbreaking<br />\notherwise<br />\nregulapopular dance leader. And, to make<br />\nsections have been vastly improved,\" recognition they (or one of them) ance or<br />\nfrom Bayonne, New Jersey.<br />\nhe continued. \"We have several good dropped a plate-glass shalf from a tions, we will have to ask him to it practically unanimous, he ran Dr. Chen worked at Yale as a Bruce<br />\nOf these Freshmen six are in the<br />\nahead of the field in a poll of college scholar.He worked with protozoa there<br />\nselections for the Glee Club and these lavatory all the way down from the withdraw from the University.<br />\nCollege of Arts and Sciences, four in<br />\nmen, taken by \"Variety\"—a theatri- also, and studied particularly the<br />\ndifficult than usual. Our pro- third floor to the first. It cracked the<br />\n$5 And $10 Fines<br />\nthe School of Business Economics, and are mroe<br />\ncal<br />\ngram is usually varied, because we drinking fountain on the first floor as<br />\nmagazine, of somewhat dubious segregation of the nuclear material<br />\nThat is taken from the letter sent<br />\nfive in the School of Engineering.<br />\ntry to please a variety of audiences. it fell and was itself shattered into to the father of the present writer. curricular value by the way. Thus during reproduction. He received his<br />\nTabulated as to secondary schools,<br />\nThe pieces are of all types, and this many pieces on the floor. Here was Naturally we feel highly honored at has he received the triple accolade of PhD at the University of Pennsylsix are from Baltimore City College,<br />\nvania, and did his undergraduate<br />\nyear we have a well-rounded group of a ded which was to gain the B entry being assessed ten dollars: for no one Art, Industry, and Education.<br />\nfour from Forest Park High School<br />\nwork at Oberlin College.<br />\nsongs.<br />\nresident the recognition for which received a higher fine than that. Most<br />\nNor have the band's efforts been<br />\nand three from Baltimore Polytechnic<br />\nthey<br />\nlong<br />\nsought<br />\nhad<br />\nso<br />\nfaithand<br />\nin B entry got only fine dollar fines. limited to these fields. So prolific and<br />\n\"This year's Club is under excepInstitute, while one attended the colNEWS-LETTER TO MEET<br />\nfully,<br />\nHowever, our conscience will not be profiitable have been its recordings<br />\nlege \"Gimnasia Nordia\", Tel Aviv, tionally capable management, and<br />\nTODAY, 12.30<br />\nMagnificent<br />\nRecognition<br />\nthese offices are responsible for the<br />\nclear if we accept this honor without that the moguls of the Brunswick<br />\nPalestine.<br />\nSaid recogition came about a week protest, much as we appreciate it; Company reputedly go to bed each<br />\nefficient running of things. An excelAn important meeting of the<br />\nlent schedule of concerts have been ago and it was magnificent. It took for we do not deserve it, and heaven night with a prayer for the continued<br />\nNEWS-LETTER editorial staff will<br />\nmade; howeved, the Club should be the form of carbon coies of letters, forbid that we accept anything not presence of the Kemp signature at<br />\nbe held today at 12:30. ReorganiNYA Graduate and Undergraduate at its peak for the Home Concert on the originals of which had been sent rightfully ours. On the occasions re- the bottom of One of their contracts.<br />\nzation plans of importance to<br />\nStudents are to hand in their time re- Friday, February 26.<br />\nto the parents of the respeective per- ferred to in the letter we were in our Recent Brunswick products include<br />\neach member will be drafted.<br />\nPorts by Saturday, February 20 at 1<br />\n\"I Cannot urge the students too sons fortunate enough to receive this room trying to study or read, instead \"Good Night, My Love,\" \"You Don't<br />\nThe board of Editors will issue<br />\nla•<br />\nat the office of the Bureau of strongly to attend this presentation acknowledgement. Part of such a let- of bein gout in the hall-ways valiantly Love Right,\" \"One Never Knows,<br />\na call for new candidates to the<br />\nAppointments.<br />\n(Continued on Page 3, Col. 2)<br />\nand bring their parents and friends.\" ter follows:<br />\n(Continued on Page 3, Col. 2)<br />\nstaff Wednesday.<br />\n<br />\nMadariaga Scores<br />\nMenaces To World<br />\nPeace In Lecture<br />\nSpanish Envoy Says Fascism, Communism Are<br />\nThreat To Peace<br />\n<br />\nLevering Throng Hears Orator Plead For World<br />\nCitizenship<br />\n<br />\nMary B. Shepherd<br />\nChosen as Sponsor<br />\nFor 2nd Cotillion<br />\n<br />\nSponsor Of Affair Is Debutante Of Year<br />\nAgo<br />\n<br />\nDormitory Residents Disclaim<br />\nLauds<br />\n'Honors' Thrust Upon Them<br />\n<br />\nSteinwald<br />\nMusical Talent<br />\nIn '37 Organization Letter<br />\n<br />\nReceived From Dorm Correspondent Lists Alleged<br />\nEvents And Charges Of Alleged Damages; Claims<br />\nLetter, Fine Imposed<br />\n<br />\nIncoming February Class<br />\nConsists Of 15 Members<br />\n<br />\nNYI4 Time Reports Due<br />\n<br />\nHopkins Z000logist<br />\nGets Research Grant<br />\n<br />\n\fHOME'WOOD, BALTIMORE, FEBRUARY 16, 1937<br />\n<br />\n2<br />\n<br />\nbe 3obn5 JOopkin5<br />\nKett Cr,<br />\n<br />\nt<br />\n<br />\nor administration. We pledge ourselves to keep this arrangement intact; any attempt to disrupt it will be given<br />\ndue publicity in these columns.<br />\nWe want to make the NEWS-LETTER a student paper,<br />\nrun by students, and guarding jealously student welfare.<br />\nAny deviation from the path of our ideals and goals will<br />\nmake us responsible to the student body.<br />\n<br />\nKnowledge<br />\nIs<br />\nPower<br />\n<br />\n1RCL,IN'<br />\nTHE<br />\n<br />\nAM PUS<br />\nwith BOBBY HILDRETH<br />\n<br />\nLETTERS TO<br />\nTHE EDITOR<br />\nThe NEWS-LETTER welcomes views<br />\nand comments on any subject written<br />\nto the paper with the exception of<br />\nlibelous statements. All correspondence will be held in the strictest<br />\nconfidence; and, although a signed<br />\nname gives evidence of god faith,<br />\nnames will not be printed, if so requested. Please send letters to the<br />\neditor of the NEWS-LETTER at the<br />\nJohns Hopkins University.<br />\n<br />\nWe desire to present fair, impartial, and uncolored<br />\nStudents at the recent U. of M.<br />\nnews accounts on the allotted three pages. But on the<br />\nwere disappointed in the<br />\ndance<br />\nSubscription<br />\nHere begins a new column, which<br />\neditorial pages-one sanctum sanctorum-we will pretunes from Bob Crosby's orchesBy Mail<br />\nhope you will enjoy, but not take<br />\nwe<br />\ninquireager,<br />\nsent opinions and conclusions from \"lively,<br />\ntra To make up for this many<br />\nseriously. This week we present<br />\ntoo<br />\nActStudent<br />\nobtainphases<br />\nTreasurer,<br />\nand<br />\nfacts<br />\nall<br />\nthe<br />\nto<br />\nupon<br />\nfees<br />\nbased<br />\non<br />\ndance.<br />\nminds,<br />\nKemp<br />\ning\"<br />\nsubscripti<br />\nHal<br />\nour<br />\nRemit<br />\nwill attend<br />\nof definitions acquired from relist<br />\na<br />\nHop*<br />\nJohns<br />\n*<br />\n*<br />\nable of the situation or problem. We will not be dictivities Council, Renisen Hall, Postoffice,<br />\nin exam books.<br />\nsearch<br />\nor<br />\nindividual<br />\ngroup<br />\nsmall<br />\nby<br />\nany<br />\ndominated<br />\nGilman<br />\n.<br />\nin<br />\nor<br />\nto<br />\ntated<br />\nkins University<br />\nThe cutest things<br />\nDid you know:<br />\non the<br />\nwe will not be guided by anyone fraternity,<br />\npadlocks<br />\ninterest;<br />\nlittle<br />\nthe<br />\nare<br />\nHall<br />\nEntered as second class matter, December 3, 1936, at activity, or organization. Our decisions will be aimed<br />\n1. Acrimony, sometimes call holy, is<br />\nsmoking stands in the main enthe Postoffice in Baltimore, Md., under the Act of at intelligently and logically. When we take a stand it<br />\nanother name for marriage.<br />\nTo the Editor of the NEWS-LETTER.<br />\ntrance to the library. To swipe<br />\nCongress, November 3, 1879.<br />\n2. An adage is a thing to keep cuts Dear Sir:<br />\nshall be firm and determined; but we will not fear to alone it would be necessary to carry<br />\nin.<br />\nthe long bench with it. Honor<br />\nPublished semi-weekly from October to June, except ter or modify our views if the discovery of new facts<br />\nYour recent editorial concerning<br />\nbe<br />\n3. Ambiguity means having two<br />\nsystem and loose cigarette trays<br />\nduring examination and college holiday periods by under- or viewpoints forces such a change. We will not<br />\nscheduling of two major affairs,<br />\nthe<br />\nafraid to admit our mistakes, if it is proven that we<br />\nwives living at the same time.<br />\ndon't mix.<br />\ngraduates of the Johns Hopkins University.<br />\nthe Cotillion and the Musical Club<br />\n* * *<br />\nhave erred.<br />\n4. An appendix is a portion of a<br />\nEDITORIAL STAFF<br />\nhas<br />\nshe<br />\nThe laugh was on Pine, when<br />\nYes, we are aware that ideals are maintained with<br />\nbook for which nobody has yet Concert in the same week,<br />\nEditor-in-Chief<br />\nWilliam Diamond<br />\nmanagepoor<br />\nthe<br />\nlight<br />\nto<br />\ndate<br />\nbrought<br />\nmid-week<br />\nnoble<br />\nand<br />\nfine<br />\nis<br />\nthat<br />\nannual<br />\nis<br />\nher<br />\nthere<br />\nwhat<br />\nout<br />\nbut<br />\nfound<br />\nmuch difficulty;<br />\ndevised the use.<br />\nManaging Editors<br />\nJames Morrow, David Caplan<br />\nthat can be attained and kept without difficulty. But we was going to have his true love from 5. Average means something that ment on the part of certain campus<br />\nEditor<br />\nAssociate<br />\nStanley Finkel<br />\nleaders in setting dates for activities.<br />\ndedicate ourselves to those purposes and ideals. We are Philadelphia with him for the Home<br />\nhens lay eggs on.<br />\nSports Editor<br />\nBernard D. Pinck<br />\nAs an active member of the Musical<br />\nto stand trial a year hence for the decision as to Concert. Better luck, Kid, for the<br />\nready<br />\nA blizzard is the inside of a fowl. Club, I can definitely vouch for the<br />\n6.<br />\nAssistant Managing Editor<br />\nBenjamin Root<br />\nduring<br />\nMilitary Ball in April.<br />\nwhether we have lived up to our goals and policy<br />\n7. A buttress is a women who makes fact that the Concert had been sched*<br />\n*<br />\n*<br />\nArnold Glantz, Harold Zheutlin..Assistant Sports Editors the year.<br />\nEditor<br />\nbutter.<br />\nNews<br />\nWethered Barroll<br />\nuled for its present date several<br />\nErnie must be making up for<br />\n8. An epistle is the wife of an apos- months ago. The extremely unfair<br />\nReporters--Max Iskowitz, Nathaniel Finkelstein, Jewett<br />\nthe time he lost while studying<br />\ntle.<br />\nGoldsmith, Howard Reizenstein, Julian Adler, Carl<br />\nattitude on the part of the Cotillion<br />\nfor exams. Two dates in one<br />\n9. To germinate is to become a nat- Board in arranging the dance for the<br />\nRasin, Floyd Katske, Leonard Rubinger, Morris Wesin<br />\nis<br />\nlikewise<br />\n-LETTER<br />\nNEWS<br />\nHow<br />\nHopkins<br />\nthe<br />\ngirl.<br />\nof<br />\nsame<br />\nThe 'editor<br />\nweek with.the<br />\nuralized German.<br />\nsel, Arthur Katz, Martin Krieger, Lester Rosenthal, a situation perhaps peculiar to the Hopkins campus.<br />\nsame week is without most inconsiddid that happen, pal?<br />\n10. A goblet is a sailor's child.<br />\n*<br />\n*<br />\n*<br />\nSidney Baum, J. Murray Kempton.<br />\nhave<br />\nwho<br />\nfew<br />\nerarte. The Musical Club, by far<br />\nthose<br />\nstudents<br />\nof<br />\none<br />\nFortunately we are<br />\n11. A grass widow is the wife of a the largest and most widely repreis only three<br />\nand worked closely with four editors. So<br />\nunder<br />\nCotillion<br />\nthe<br />\nserved<br />\nthat<br />\nNow<br />\nvegetarian.<br />\nREPO..iiENTECI FCR NA f.,NAL. ADVERTISING EIT<br />\nsented organization on the campus,<br />\nour position may be still more individual in our cogni- days off; Allow rile to speak for those<br />\nletters M.D. signify \"menThe<br />\n12.<br />\nNational Advertising Service, Inc.<br />\nobligais thus very ungenerously subordinges,<br />\n,<br />\nAll<br />\ndisadvanta<br />\nadvantages<br />\ndancing.<br />\nlabor,<br />\nthe<br />\nthe<br />\nenjoy<br />\nof<br />\nto<br />\nzance<br />\nwho wish<br />\nCollege Publishers Representative<br />\ntally defficient.\"<br />\nNEW YORK. N.Y.<br />\nated to the Cotillion Board, a very<br />\n420 MADISON Ave.<br />\ntions, duties opportunities and temptations of the head drunks and stags, please stay off the<br />\n. SAN FRANCISCO<br />\n13. A monologue is a conversation be- small minority.<br />\nBOSTON<br />\n.<br />\nCHICAGO<br />\n.<br />\nmiddle.<br />\nnewspaper<br />\nthe<br />\nin<br />\nHopkins<br />\nof the<br />\ndance floor, especially<br />\nSEATTLE<br />\n•<br />\nPORTLANC<br />\nLos ANGELES<br />\ntween two people, such as husThis same general attitude of CotilWe know the frequent inadequacies of the staff, we There should be a corner for them<br />\nband and wife.<br />\nknow of the number of pre-medical students with full to go to and be entertained by-well, 12. A refugee keeps order at a foot lion Board priority seems to be reflected even into the pages of this<br />\nschedules and the number of apathetic, indolent students let's say--Hutch.<br />\nball game.<br />\n*<br />\n*<br />\nA survey of college newspapers and a comparison with with fool schedules, we know of ;he lack of a School<br />\ncampus paper. In the issue of Febru15. A skeleton is a man with his inthe metropolitan newspapers of today will serve to show of Journalism or of any journalistic training here. We<br />\nJan Garber and his orchestra<br />\nary the 91:11, a small, inconspicuous<br />\noff.<br />\noutside<br />\nhis<br />\nand<br />\nside out<br />\nthat there is a fundamental difference between them know the late hours at the printers, we know the grindent of the Home Concert<br />\nIn York, Pa., tomorrow night.<br />\nannouncem<br />\n16. S.O.S. is a musical term meaning<br />\nthat every real college publication should note. And it is ing noise of the presses as the editor endeavors to study.<br />\nAdmission ..$1.00 _plus _taxes.<br />\nJohns Hopkins University Muthe<br />\nof<br />\nsame only softer.<br />\nthat, for the most part, college newspapers are run by We are fully aware of the discouragements, of the printDance from 8-12. Coming: Mal<br />\nsical Clun was neatly tucked away on<br />\n17. Revolution is a form of governcolthe students, of the students, and for the students. The er mistakes, of the students uncritical derisions, of the<br />\nthe<br />\nHallett, Feb. 27. Watch<br />\nthe inside page in a single column. A<br />\nment abroad.<br />\nnews gathered and the editorials expressed are all in sight of NEWS-LETTERS contemptuously thrown in wasteumn for Information regarding<br />\nvery bold, in fact glaring, announce18. A vacuum is an empty space<br />\nWhat happens on the campus or what materially affects paper baskets. We are also cognizant of the joy of a<br />\nthe dance orchestras coming to<br />\nment of the Cotillion was effaciously<br />\nwhere the Pope liyes.<br />\nthe Quadrangle.<br />\npage,<br />\nfront<br />\nPa.<br />\npresented in four columns on the outYork,<br />\nan<br />\nattractive<br />\nthought-proviking editorial, of<br />\n19. Transparent means something<br />\n* k* •<br />\npage.<br />\nside<br />\nBeing close to the test tubes of the laboratories, the of a sincere compliment.<br />\nyou can see through, e.g. a key<br />\nTile jamboree in Annapolis this<br />\ninvestigations and researches, as well as the scholars<br />\nThe<br />\nreason for this attitude is not<br />\nWe recognize the opportunities of our position-of<br />\nhole.<br />\nthemselve, these papers are in an enviable position to making friends, of acquiring knowledge, of widening our past week end found two of\"our girls 20. An oboe is an American tramp. very evident. Certainly the Musical<br />\ngather fully and accurately news of a scientific and in- character. We also know the temptations to do the attending--one unbeknowns to the 21. A miracle is something that Club is more representative of stuit feel to have comtellectual advances.<br />\ndiametic opposite--of kissing everyone, of talking about other. How does<br />\nsomeone does that cannot be done. dent affairs since nearly one-eighth<br />\nfrom<br />\nas<br />\nFrom many angles a college newspaper is free. Usual- the weather, of yielding to the pressure of certain group, petition Hutch? - especially<br />\n22. An optimist is a man who looks of the student body are enrolled<br />\nyour Gracie Gillen.<br />\nly there are no worries about circulation; there are no of selfishly working for personal gain.<br />\nafter your eyes, a pessimist looks members. Perhaps the superiority<br />\n(?) of the Cotillion Board lies in the<br />\nadvertisers or private owners to dictate policy. In mpst<br />\nafter your feet.<br />\nAll these things we know. But we accept our position<br />\nfact that its membership is so careiscases there is little or no faculty supervision.<br />\nnext<br />\nthe<br />\nin<br />\nnowfor<br />\nsuch<br />\nof<br />\nall<br />\nThat's<br />\nwithout fear and with pride in the acceptance<br />\nbe a<br />\nsue we shall examine the Literature fully controlled, but this would<br />\nAn editor who seeks to imitate great metropolitan an honor and privilege.<br />\nof<br />\nion<br />\nexcuse.<br />\npour<br />\ninterpretat<br />\nthe<br />\nin<br />\nerror<br />\nserious<br />\nand Arts.<br />\ndailies is making a<br />\nB.H.<br />\nWhy should this attitude prevail?<br />\nhis duties. To a particular audience in a particular way,<br />\nCouldn't there be more cooperation<br />\na college newspaper fulfills its real functions.<br />\nThis week In regard to education:<br />\nTo the nine men honored by election into the BarnThe amount of money required to<br />\nThe oldest university still in exist- among campus activities instead of<br />\nBut what is undoubtedly more interesting from our<br />\nstormer Club, we extend our sincere congratulations. teach a pupil in the elementary ence is the University of Bologna, in so much throat-cutting? Shouldn't<br />\ntonewspaper<br />\ncollege<br />\nthe<br />\nof<br />\nn<br />\ncompariso<br />\na<br />\nis<br />\nviewpont<br />\nIn every case these new members represent two or more grades has been estimated at $37.12 Italy. Founded in the 11th century. the Student Activities Council with<br />\nday with the one of yesteryear.<br />\nyears of faithful and valuable service to Hopkins dram- for one year. For public high school Univiresity of Paris is next. Harvard its power and influence bring about<br />\npleasing<br />\nIn make-up, the type is more modern, more<br />\natics. Election was a fitting reward.<br />\nagreement and cooperation instead of<br />\nit is $145.25 per year.<br />\nis the oldest here.<br />\nto the eye, and perhaps more flashy. As a whole the<br />\nwith a minimum of fraconducted<br />\nwere<br />\nelections<br />\nThe<br />\ndiscord?<br />\nnext<br />\nfor<br />\ntopic<br />\nbe<br />\nthe<br />\nwill<br />\nis<br />\nEtiquette<br />\nThe smallest college in America<br />\nnews stories are written in a more journalistically maternity or group politics-in a manner which praised<br />\nAn Observer<br />\nB.H.<br />\nIt<br />\na.<br />\nof<br />\nn<br />\nPhiladelphi<br />\nweek.<br />\nexaminatio<br />\nin<br />\nan<br />\nCollege<br />\nall,<br />\nof<br />\nDropsie<br />\nture style. And most important<br />\nin their desire to set up<br />\nrs'<br />\nsincerity<br />\nBarnstorme<br />\nthe<br />\nis co-educational and has 23 students<br />\neditorials will show 'that problems involving not only<br />\nhigher standards for the organization. As long as this<br />\nand 6 teachers.<br />\nthe campus but the world, in so far as the students are<br />\nis kept up there will be fire and spirit in the enthusiasm<br />\nThe first normal school in the world<br />\ndirectly or indirectly affected, are treated. There is of workers on the production, acting and business staff.<br />\nwas established in Vermont.<br />\nno attempt to evade these huge, pressing questions.<br />\nCongratulations, Jim Morrow, Bud Mehling, Joe SamA foreigner is not allowed to enter<br />\nEditorials tackle these important issues openly and<br />\nDanny Gidinsky, Milt Saul, Dave Halle, Butch<br />\nowitch,<br />\nthe U. S. Military Academy at West<br />\ncourageously. Observe most of the college publications<br />\nMcShane, Maury Lazarus, Red Glantz. Why not show<br />\nPoint unless a special act of Congress<br />\ntoday, and you will notice intelligent and provocative<br />\nyou<br />\nare real Barnstormers by urging and supporting a<br />\nFrank<br />\nGlenn<br />\nthe<br />\nNYA,<br />\nprovides for the entrance. Same true<br />\nwar,<br />\non<br />\nopinions<br />\nand<br />\ncomments<br />\nsecond production this year?<br />\nfor Navy.<br />\ncase, the Jerome Davis case, and others.<br />\nHarvard College is a University.<br />\nAs Dr. J. Edgar Park, president of Wheaton Colliege,<br />\nA professional player may coach a<br />\npapers<br />\ncollege<br />\nthe<br />\ncompare<br />\nto<br />\nonly<br />\nhas said: \"One has<br />\nteam in any sport.<br />\ncollege<br />\nAnyone who has is acquainted with the responsibiliof the past with those of today to become convinced that<br />\nWest Point's establishment<br />\nSince<br />\nexact,<br />\nmore<br />\nsubtle,<br />\nbut<br />\nhelp<br />\nmore<br />\nties, duties, and work of an editor cannot<br />\nthe intellectual processes are<br />\nabout 55% of the entrants<br />\n1794,<br />\nin<br />\nmore thoroughgoing than yesterday. It is not merely feel a bit of sympathy if not appreciation for one who<br />\ngraduated.<br />\nbeen<br />\nhave<br />\nmind<br />\nthe<br />\n,<br />\nhas served in this capacity.<br />\na difference in fashion or method of expression<br />\ntotal gift toward the Johns<br />\nThe<br />\nthat<br />\nNow<br />\nbe.<br />\nto<br />\ngave<br />\nused<br />\nHe<br />\nr.<br />\nit<br />\nour<br />\nthan<br />\nwith<br />\ndeparting<br />\npredecesso<br />\nfeel<br />\ntoday<br />\nwe<br />\nmore<br />\nSo<br />\nis being used<br />\nHopkins University and the Medical<br />\nis a very dangerous thing to do. Just think of what this a lot for the NEWS-LETTER and deserves praise for his<br />\nwas more than $7,000,000.<br />\nSchool<br />\nover<br />\nall<br />\nthinking<br />\nthe<br />\ned<br />\nHe<br />\nhas<br />\npeople<br />\npaper.<br />\nnad<br />\nthis<br />\nadminister<br />\nwith<br />\nlong service<br />\ncountry would be if you<br />\nhas the largest endowHarvard<br />\nrunning of the paper for almost a year. That the<br />\nthe place .<br />\nU. S. Followed by Columthe<br />\nin<br />\nment<br />\ngood<br />\ncondition<br />\nin<br />\nand<br />\nPerhaps the most parallel counterpart is the cor- NEws-LETTER appeared regularly<br />\nand Leland StanChicago<br />\nYale,<br />\nbia,<br />\nWe will not pass judgment<br />\nresponding change in the attitude of the student to the is for the campus to judge.<br />\nJohns Hopkins,<br />\nCornell,<br />\nJr.,<br />\nford,<br />\njudge<br />\na drunken man cannot<br />\nproblems around him. Whereas formerly there were for the same reason that<br />\nCarnegie and Princeton.<br />\nwhiskey.<br />\norganizabut few individuals and perhaps still fewer<br />\nThe youngest student to enter an<br />\nBut Bill Diamond worked and served in what is pertions who were actively engaged in the discussion of and<br />\ncollege was Moses FinkelAmerican<br />\nThe<br />\ncampus.<br />\nof<br />\nthe<br />\nposition<br />\nactivity over current issues and questions, today the haps the most responsible<br />\n-hence won't run dry<br />\nN. Y., who entered<br />\nof<br />\nSyracuse,<br />\nstein<br />\nis grateful for his service and says: Goodbye and<br />\nstudent is alive to the currents of events to which he is staff<br />\nin classes or exams<br />\nthe<br />\nat<br />\nthe University of Syracuse<br />\nsubjected. He feels keenly important social, economic, good luck!<br />\nYes, thousands of students start<br />\n11.<br />\nof<br />\nage<br />\nto rate hier when they replace<br />\nand political issues. Group discussions on war, campus<br />\nEnglish universities give five to<br />\ntheir old 'blind-barrel\" pens with<br />\nRennaisthe<br />\nto<br />\nevidence<br />\ngive<br />\n-all<br />\nstrike, mass projects<br />\nsix months of the year to vacation.<br />\nthis new Parker Vacumatie.<br />\nsance.<br />\nThis is because it is people who<br />\nGallaudet College in Washington,<br />\nAs is obvious from the reading of a dormitory stuare capable of rating high who go<br />\nWe may be presenting an ideal picture of college dent's letter on the front page, a serious situation is ex- D. C., is said to be the only institution<br />\nfor this Pen in a big way, and benewspapers and college students; but we firmly believe istent in the living-place of over one hundred and fifty of higher education in the world<br />\ncause it is this kind of Pen-and<br />\nfrom our own observation and study, that there is plenty Hopkins students. However, remember it is but one which is devoted exclusively to the<br />\nonly this kind-that can bring out<br />\nthe best that is in them.<br />\nof evidence to support such a description.<br />\ntook<br />\ndeaf.<br />\nwho<br />\nside of the story. The University officials<br />\nIts Scratch-Proof Point of PlatiIt cost the U. S. government $10,alleged action against alleged damages have yet to exnum and Solid Gold writes like a<br />\n000 for four years to put a cadet thru<br />\nzephyr. Unlike pens that hide the<br />\nplain their procedure.<br />\nink within the barrel,this laminated<br />\nThis includes overhead<br />\nPoint.<br />\nWest<br />\ninvestigathorough<br />\na<br />\nER<br />\nis<br />\nThe<br />\nconducting<br />\nNEWS-LETT<br />\nPearl Beauty lets you SEE Days<br />\nThe situation of the newspaper on the Hopkins campus<br />\ntion and will take a more positive and active stand on expenses. The approximate cost of<br />\nAhead when it's running low. When<br />\navailable<br />\nown<br />\nour<br />\nuse<br />\nmust<br />\ntoo,<br />\nWe,<br />\none.<br />\npeculiar<br />\na<br />\nis<br />\nthis problem. Although journalistic principles obligated Just maintaining and education a<br />\nheld to the light it shows the ENin<br />\nthose<br />\n(besides<br />\nmaterials, analyze our own problems<br />\nTIRE Ink Supply-holds 102%<br />\nthe four years is $6,253.84.<br />\nfor<br />\ncadet<br />\na<br />\ndorfrom<br />\nence<br />\ncorrespond<br />\nfront-page<br />\nthe<br />\nus<br />\nto<br />\nprint<br />\nand<br />\nMore Ink than old-style.<br />\ncommon with all students), cover our own campus,<br />\nHarvard only allows 1,000 students<br />\nmitory residence, the lack of sufficient information comIt's the pen that received more<br />\nfollow our own traditions and ideals.<br />\nin its freshman classes.<br />\npels us to withhold comment until next issue.<br />\nthan any other TWO makes<br />\nvotes<br />\ninits<br />\nSince<br />\nThe Hopkins tradition is a liberal one.<br />\nof Pens COMBINED when 30 ColAlf<br />\nlege Papers asked 4,699 students<br />\nception, each succeeding generation of scholars, each<br />\nwas<br />\nIt<br />\nown?\"<br />\nyou<br />\ndo<br />\npen<br />\n\"Which<br />\nsucceeding staff of faculty members, each succeeding<br />\nawarded -by the All-America Board<br />\npresident-- all have voiced as the ideal of the University<br />\nof Football to 90 nominees for the<br />\nAll-America Team of 1936.<br />\nthe relentless, tireless search for ths truth: the living<br />\nGo at once to any good store sellout of our motto Veritas Vos Liberabit.<br />\ning pens and try this revolutionary<br />\na<br />\nare<br />\nwe<br />\n;<br />\nWell, we are a newspaper of that University<br />\ninvention. Identify the genuine<br />\nand<br />\nParker Vacumatic by this smart<br />\npublication which accepts in full the traditions<br />\nARROW Clip,-this holds this Pen<br />\nwayown<br />\nour<br />\nIn<br />\nown.<br />\nits<br />\nas<br />\nHopkins<br />\nthe<br />\nof<br />\nideals<br />\nand SAFE in the pocket. The<br />\nlow<br />\nthe<br />\naims<br />\nlofty<br />\nour<br />\nas<br />\njournalistically--we shall set up<br />\njJCUIVI1TIre:-)<br />\na)---17<br />\nParker Pen Co., Janesville, Wis.<br />\nGUARANTFEU FAErHANKALIY PiRRET,<br />\ngoals set up by our founder.<br />\nWrites<br />\nIt<br />\nAs<br />\nPen<br />\nYour<br />\nCleans<br />\n1,<br />\n,<br />\nfi,mos, $5)<br />\n3222<br />\nGet Parker Quick, the new quick-drying<br />\n750<br />\nWe find much of the University spirit of freedom reDissolves sediment left by pen-clogging<br />\nink.<br />\nr<br />\nill°<br />\nOur<br />\ninks. Makes your pen-a Parker or any<br />\nflected in the attitude towards the NEWS-LETTER.<br />\nother-work like a charm. 15c and 25c.<br />\nfaculty<br />\nof<br />\nn<br />\nsupervisio<br />\nany<br />\nfrom<br />\npaper is entirely free<br />\nper year<br />\n<br />\n$2.00<br />\n$2.50<br />\n<br />\nPlace Of The Hopkins Editor<br />\n<br />\nPlace Of The College Paper<br />\n<br />\nSPEAKING OF<br />\nEDUCATION<br />\n<br />\nA Deserved Honor<br />\n<br />\nTo Star in Your School Work<br />\n<br />\nBACK YOUR BRAINS WITH THE<br />\n<br />\nALL-STAR PEN<br />\n<br />\nSo Long, Bill<br />\n<br />\nIt Lets You SEE<br />\nWhen to Refill<br />\n<br />\nExplanation Needed<br />\n<br />\nj,021.<br />\n<br />\n/dee9)<br />\n<br />\nPlace Of The Hopkins Paper<br />\n<br />\n•<br />\n<br />\n-•••••••••<br />\n<br />\n•••••••••11..<br />\n<br />\n•<br />\n• 111..11.1.,11..<br />\n<br />\n.or<br />\n<br />\n*<br />\n<br />\ny<br />\n<br />\nKIBL ER'S<br />\n<br />\nJEWELERS and OPTICIANS<br />\n<br />\nar e.r<br />\n)<br />\n1<br />\n<br />\nPEN and PE] CIL SETS<br />\n<br />\nGreenmc unt Avenue<br />\n........<br />\n<br />\n:e<br />\n1.<br />\n<br />\nIII<br />\n<br />\nrAt<br />\n<br />\nOV,<br />\n<br />\n•••••••••<br />\n<br />\n•<br />\n<br />\n.50<br />\n<br />\n.1<br />\n<br />\ntiro<br />\nfin<br />\nnil<br />\nGr<br />\ngr<br />\nar<br />\nhex<br />\nLe<br />\nthi<br />\n<br />\nwi]<br />\nof<br />\nbo(<br />\n34<br />\nwa<br />\n<br />\nlea<br />\nane<br />\ntin<br />\nthe<br />\nCOL<br />\n<br />\nprc<br />\nthc<br />\nmum<br />\nTh:<br />\nflui<br />\nest<br />\nthe<br />\non(<br />\nact<br />\n<br />\nP0I<br />\n1'01J<br />\n<br />\n1101<br />\n<br />\n23<br />\nJa3<br />\nfac<br />\ndui<br />\n1<br />\nZh(<br />\nfro<br />\n<br />\nPoi<br />\nchi<br />\nrat<br />\nput<br />\nthe<br />\nea<br />\n<br />\npa:<br />\n<br />\nwe<br />\nsta<br />\ncul<br />\ngis<br />\nthe<br />\n<br />\n(the<br />\non<br />\nset<br />\nwa<br />\nthi<br />\n'Ph<br />\nthi<br />\nye.]<br />\nnei<br />\nI 8-<br />\n<br />\nSC(<br />\n<br />\nwe<br />\n<br />\ntrie<br />\nas<br />\nthe<br />\nSi(<br />\nco(<br />\nInc<br />\na<br />\nvir<br />\n<br />\n1M:<br />\n<br />\nen<br />\n<br />\nat<br />\ntir<br />\npe<br />\ninc<br />\nini<br />\nba<br />\nsti<br />\nth,<br />\n<br />\nth<br />\nba<br />\nph<br />\n<br />\nVII<br />\n<br />\nma<br />\nlet<br />\nba<br />\n<br />\na<br />\nth<br />\n<br />\nPC<br />\n<br />\nre<br />\nste<br />\nhc<br />\n<br />\nro<br />\n<br />\nWi<br />\n<br />\n\fHOMEWOOD, BALTI2vIORE, FEBRUARY 16, 1937<br />\n<br />\nHopkins Cagers THE BOX SCORE Swimmers Suffer First Defeat Sports Calendar Victory Streak<br />\nAt Hands of Lehigh Mermen<br />\nof Jay Gunners<br />\nTrounce Loyola<br />\nBrown And White Natators Capture Five Firsts; Weiner<br />\nAt Evergreen<br />\nBrought to End<br />\nTakes Backstroke; Radnor First In 440 Free-Style;<br />\nThe line-up:<br />\nHOPKINS<br />\nG.<br />\nSiegel, f.<br />\n2<br />\nMelvin, f.<br />\n6<br />\nCross, c.<br />\n1<br />\nRasin, g.<br />\n4<br />\nZheutlin, g.<br />\n4<br />\n<br />\nst<br />\n<br />\nCC<br />\n<br />\nRecord First Win In Three<br />\nSeasons Over Local<br />\nRival<br />\nTURBULENT<br />\n<br />\ng<br />\n<br />\nrs,<br />\nub<br />\n<br />\nas<br />\n;ens<br />\nes.<br />\nal<br />\nhe<br />\nal<br />\nir<br />\nOR<br />\n<br />\nhe<br />\nidar<br />\nreus,<br />\nin-<br />\n<br />\ntilrehis<br />\nruua<br />\nert<br />\nOH<br />\n<br />\nA<br />\ncesly<br />\nutnot<br />\ncal<br />\ntohtit<br />\nas<br />\n<br />\nthe<br />\nree a<br />\n<br />\n?<br />\ntion<br />\n. of<br />\n<br />\nan't<br />\nvith<br />\nout<br />\nof<br />\n<br />\nTotals<br />\n<br />\n75232-<br />\n<br />\nF.<br />\n9<br />\n6<br />\n3<br />\n3<br />\n5<br />\n<br />\nT.<br />\n11<br />\n17<br />\n4<br />\n11<br />\n10<br />\n<br />\n17 19-26<br />\nLOYOLA<br />\nG.<br />\nF.<br />\nKeech, f.<br />\n1 0- 0<br />\nDevin, f.<br />\n0 0- 1<br />\nKelly, f.<br />\n3 4- 8<br />\nCummings, c.<br />\n3 0- 2<br />\nWayson, g.<br />\n4 0- 0<br />\nBremer, g.<br />\n0 1- 1<br />\nCarney, g.<br />\n7 3- 3<br />\n<br />\nBATTLE<br />\n<br />\nJays Lead All The Way In<br />\nFree Scoring<br />\nTilt<br />\nBy ARTIE KATZ<br />\nThe Johns Hopkins hoopers turned<br />\nthe tables on Loyola College for the<br />\nfirst time in three years last Saturday<br />\nnight when they triumphed over the<br />\nGreyhounds by a 53-44 score at Evergreen. Although both aggregations<br />\nare mathematically out of the race for<br />\nhonors in the Maryland Collegiate<br />\nLeague, the affair represented more<br />\nthan the usual attempt of one team to<br />\nwin a basketball game at the expense<br />\nof another. Loyola has been the bugaboo of the Blue Jays since the 193334 hardwood season, and their defeat<br />\nwas thus doubly significant.<br />\nTake 7 Point Lead<br />\nThe Malloneemen took a 7 point<br />\nlead in the first three minutes of play,<br />\nand were never as much as tied<br />\nthroughout the contest. At one stage,<br />\nthe home team was behind by 1<br />\ncounter, at another by 14. The visitors<br />\nprovided the margin of victory in<br />\nthe first half, putting away 34<br />\nmarkers to the 21 by the Loyolans.<br />\nThis canto was unusually fast, rough,<br />\nhard on the players, but very interesting to the spectators who jammed<br />\nthe Evergreen gymnasium. The second inning was slower, but was characterized by vicious guarding, long<br />\npop-ups, and more than the ordinary<br />\nrough and tumble element. The Greyhounds forged ahead slightly, to score<br />\n23 points to the 19 netted by the<br />\nJays. A noteworthy feature was the<br />\nfact that 41 foul shots were taken<br />\nduring the game.<br />\nHopkins scored first with Harold<br />\nZheutlin tossing the sphere on a pass<br />\nfrom Bing Cross. Melvin added 5<br />\npoints, to set the total at 7-0. An exchange of long shots, and a shooting<br />\nrampage by Carney, All-State guard,<br />\nput the counters at 13-12. Hopkins<br />\nthen went to town, as it were, scoring<br />\neasily on quick breaks and excellent<br />\npass work. Melvin's overhead shots<br />\nwere particularly effective in this instance, as they are exceedingly difficult to guard against. Dimmy Traggis substituted for Mel shortly before<br />\nthe first half ended.<br />\nThe last period saw the attempt of<br />\na determined home team to both stem<br />\nthe Hopkins tide of shots, and do some<br />\non their own account, but the score<br />\nset-up in the first part of the game<br />\nwas too much of a handicap. It was at<br />\nthis point that the going went rough.<br />\nThere were six men on the court with<br />\nthree persoAals, all of whom were<br />\nvaluable men. Loyola hopes went high<br />\nnear the end of the battle, trailing by<br />\n48-40, but field goals by I:W.3in and<br />\n,Siegel put the game on ice. The final<br />\n<br />\nTotals<br />\n<br />\n18<br />\n<br />\n53<br />\nT.<br />\n2<br />\n0<br />\n10<br />\n8<br />\n1<br />\n17<br />\n<br />\n8-15 44<br />\n<br />\nJay Handball Team<br />\nTrims Virginia 6-0<br />\nMilberg, Pasternak, Alperstein, Finkelstein, Brilliant<br />\nAgainst Cavaliers<br />\nOn Friday night the Blue Jay handbailers handed the University of Virginia a six to nothing troucing in a<br />\nmatch held at the gym. The outstanding victory was that recorded by<br />\nRichard Pasternak who defeated his<br />\nopponent by the large scores of 15-2,<br />\n15-0. The closest match of the meet<br />\nwas that between Nat Finklestein<br />\nand Arty Nepoff, in which the ultimate victor was extended before winning 11-15, 15-11, 15-5.<br />\nIn other matches Iry Milberg downed Herb Linne 15-9, 15-13, Milt Alperstein defeated Fred Ferguson 15-10,<br />\n11-15, 15-3, and in the doubles Milberg<br />\nand Alperstein paired to beat Linne<br />\nand'Eckstein, and Alperstein and Pasternak combined to conquer Ferguson<br />\nand Nepoff.<br />\nThe summary:<br />\nSINGLES<br />\nIrving Milberg, Hopkins, defeated<br />\ndefeaed Linne and Eckstein, 15-9, 15Richard Pasternak, Hopkins, defeated I. Eckstein, 15-2, 15,0.<br />\nNat Finkelstein, Hopkins, defeated<br />\nArty Nepoff, 11-15, 15-11, 15-5.<br />\nMilt Alperstein, Hopkins, defeated<br />\ndefeated Ferguson and Nepoff, 15-3,<br />\nDOUBLES<br />\nMilberg and Alperstein, Hopkins,<br />\ndefeated Linne and Eckstein, 15,9, 153.<br />\nAlperstein and Pasternak, Hopkins,<br />\ndefeated Ferguson and Nenoff, 15,3,<br />\n15-8.<br />\n<br />\nThe only two Bluejay substitutions,<br />\nDimmy Traggis and the Chestertown<br />\nplayboy, Dicky Myra Green, showed<br />\nmentors Mallonee and Twardowicz<br />\nthat they can be used to plug the gap<br />\nwhen the Big Five starts to slow up.<br />\nAmong other things . . . Hopkins<br />\nJ.V. over that of the home team by a<br />\n14-10 score . . . Loyola scrubs didn't<br />\nscore in the second half ... In the varsity game . . . the quick breaks . . .<br />\nRasin to Siegel . . . Zheutlin to Cross<br />\n. . . Cross to Zheutlin . . the number<br />\nof fouls taken . . . Melvin's overhead<br />\nshots . . . Siegel to Cross to Melvin to<br />\nscore was 53-44.<br />\nZheutlin who scored on a fast getaway . . . Rasin's beautiful long shots<br />\nWorked As Unit<br />\nAny bouquets tossed at the Home- Harold Zheutlin's batting average for<br />\nwood five are to be shared equally by the evening, 4 field goals, of 7 atWein. In this game, they functioned tempted . . .<br />\nas a unit, each caring for his part of<br />\nthe work, and doing it well. Herby<br />\nSiegel showed his executive ability in<br />\ncoordinating the plays, getting the<br />\nmost from his teammates, and playing<br />\na swell all-around game. Norm Melvin, his high-scoring fellow forward,<br />\nrose to new heights in this role of<br />\ncrafty shot at all angles. Bing Cross,<br />\nat the pivot, showed he is almost entirely recovered from his injury in his<br />\nperformance at Evergreen. Getting<br />\nmore than his due of the taps, feeding continually, and always under the<br />\nbasket for rebounds, Bing demonstrated with a vengeance his value to<br />\n<br />\nBasketball-Johns Hopkins vs. Western Maryland College, Thursday,<br />\n8.30 at Homewood.<br />\n<br />\nstyle in which he tied the pool record<br />\n<br />\nSwimming-Johns Hopkins vs. University of Virginia, Friday, at Baltiniore.<br />\nWrestling-Johns Hopkins vs. Haverford College, Friday, at Haverford.<br />\nRichmond, Va. next Friday ev„ening,<br />\nJohns Hopkins vs. Ursinus College,<br />\nthe 19th.<br />\nSaturday, at Ursinus.<br />\nThe results:<br />\n1290-1284<br />\nFencing-Johns Hopkins vs. Army,<br />\n40-Yard Free Style-Won by Adam,<br />\nSaturday at West Point.<br />\nLehigh; second, Swenson, Lehigh;<br />\n. The Johns Hopkins marksmen went<br />\nthird, Scheer, Johns Hopkins. Time,<br />\ndown to defeat at the hands of the<br />\n19 1-5s.<br />\nWestern Maryland College rifle team<br />\n220-Yard Free Style- -Won by Washlast Saturday afternoon at the Westbaugh, Lehigh; second, Howe, Leminster team's range. The score was<br />\nhigh; third, Adler, Johns Hopkins.<br />\n<br />\nof 19 1-5 seconds.<br />\n<br />\nTime, 2m. 40s.<br />\n<br />\nJacobs Tops Divers<br />\nThe Blue Jay swimmers met their<br />\nfirst defeat of the season at the hands<br />\nof the Lehigh mermen last Saturday<br />\nevening in the Baltimore City College<br />\ntank, to the tune of 48 to 27. Five of<br />\nthe nine events were taken by Lehigh<br />\n-Adam captured two, the 100 yard<br />\nfree style and also the 40 yard free<br />\n<br />\nWestern Maryland Sharpshooters Top Jays By<br />\nCount<br />\n<br />\nSenior Mechanics<br />\nDown N.J.All-Stars<br />\n<br />\n1,290 to 1,284,<br />\n<br />\nThe New Jersey All-Stars went<br />\ndown to an unexpected defeat at the<br />\nhands of the Senior Mechanics by a<br />\nscore of 15-13 in a closely played<br />\n'baseketball game last Wednesday.<br />\nWiseman and Dickler of the Senior<br />\nJohns Hopkins, 63.5; second, Shoe- Mechanics led the scoring with a total<br />\nmaker, Lehigh, 62.6: third, Parson, of five points each with Stollberg of<br />\nLehigh, 61.7.<br />\nthe Senior Mechanics close behind<br />\n200-Yard Breastroke-Won by Ja- with four points.<br />\ncobi, Lehigh; second, Henning, LeIn the second game Wednesday afhigh; third, Blucher, Johns Hopkins. ternoon the Goldman A. C. flashed a<br />\nTime, 2m. 47 1-5s.<br />\npowerful attack to win by a score of<br />\n440-Yard Free Style--Won by Rad- 27-17. The outstanding players and<br />\nnor, Johns Hopkins; second, Washa- high scorers of the encounter were<br />\nbaugh, Lehigh; third, Adler, Johns Sonneborn and Jacobson of the GoldHopkins. Time, 6m. 3 4-5s.<br />\nman A. C. with each scoring four field<br />\n150-Yard<br />\nBackstroke-Won<br />\nby goals. For the opposing team, Nealey<br />\nWeiner, Johns Hopkins; second, Mc- was prominent, with a total of seven<br />\nMillan, Lehigh; third, Hooker, Lehigh. points.<br />\nTime, lm. 57 2-5s.<br />\nOn Thursday the Engineer \"A\"<br />\n100-Yard Free Style- Won by<br />\nteam defeated the Whirlwinds by a<br />\nAdam, Lehigh; second, Howe, Lehigh; score of 10-6. Holman, of the Engithird, Hill, Johns Hopkins. Time, 58 neer \"A\" led the scoring with a total<br />\n3-5s.<br />\nof six points. This game was a loosely<br />\n<br />\n240-Yard Medley Relay--Won by<br />\nWinning first places for Hopkins<br />\nLehigh (McMillan, Jacobi, Adam);<br />\nwere Captain Danny Weiner in the<br />\nsecond, Johns Hopkins (Weiner,<br />\nbackstroke, Zoel Radnor, in the 440 Blucher,<br />\nRadnor). Time, 2m. 40 3-5s.<br />\nyard free style, Harold Jacobs, diving,<br />\nFancy Diving-Won by Jacobs,<br />\nand the 320 yard relay team, comprised of Hill, Frey, Adler and Radnor.<br />\nThe<br />\n<br />\nunexpected<br />\n<br />\nstrength<br />\n<br />\nof the<br />\n<br />\nBrown and White visitors was mutually surprising to both the Hopkins<br />\nand Lehigh rooters. The score is in no<br />\nway indicative of the closeness of the<br />\nmeet, as first places were lost by the<br />\nsmallest of margins. Great credit is<br />\ndue to Jacobs, who came out in front<br />\nwith the diving honors, despite the<br />\nfact that he was confronted by some<br />\nof the keenest competition of the<br />\nseason.<br />\nU. Of Va. Next Opponent<br />\nThe next opponent of the Black and<br />\nBlue natators will be the University<br />\nof Virginia Who are to be met at<br />\n<br />\nJ.V.CourtmenRally<br />\nTo Defeat Loyola<br />\n<br />\n320-Yard Relay-Won by Johns<br />\nHopkins (Hill, Frey, Adler, Radnor);<br />\nsecond, Lehigh (Swenson, Henning,<br />\nPatterson, Knowland). Time, 3m. 14<br />\n4-5s.<br />\n<br />\nplayed affair with the passing a little<br />\nragged and field goals limited.<br />\nThe game between the Engineer<br />\n\"B\" team and the Newcomers was<br />\npostponed.<br />\n<br />\nThis defeat was the first the Blue<br />\nJay gunners suffered<br />\n<br />\nin<br />\n<br />\nthe four<br />\n<br />\nmeets scheduled so far this season;<br />\nwhile this win was the second for<br />\nthe Western Maryland Terrors.<br />\nGuild, of the Black and Blue array,<br />\nwas the outstanding performer of the<br />\nshooting meet with a total of 273 for<br />\nthe three events. Not far behind the<br />\nHopkins star, was Armacost of the<br />\nvictors with a total score of 271.<br />\nThe scores:<br />\nWESTERN MARYLAND<br />\nA rmacost<br />\n<br />\n99<br />\n<br />\n95<br />\n<br />\nMeyers<br />\n<br />\n77-271<br />\n<br />\n99<br />\n<br />\n83 83-265<br />\n<br />\nParker<br />\n<br />\n99<br />\n<br />\n85<br />\n<br />\n77-261<br />\n<br />\nHoffa<br />\n<br />\n91<br />\n<br />\n88<br />\n<br />\n71-250<br />\n<br />\nLurnan<br />\n<br />\n94<br />\n<br />\n85 64-243<br />\n<br />\nJOHNS HOPKINS<br />\nGuild<br />\n<br />\n98<br />\n<br />\nBrown<br />\n<br />\n97<br />\n<br />\n90<br />\n<br />\nLindenmayer<br />\n<br />\n95<br />\n<br />\n89<br />\n<br />\n70-254<br />\n<br />\nRossberg<br />\n<br />\n96<br />\n<br />\n82<br />\n<br />\n74--252<br />\n<br />\n.96<br />\n<br />\n87<br />\n<br />\n59-242<br />\n<br />\nLeber<br />\n<br />\n93 82-273<br />\n76-263<br />\n<br />\n•••••<br />\n<br />\nHold Evergreen Outfit Scoreless For -Entire<br />\nSecond Half<br />\nA rally in the second half plus an<br />\nalmost unbelievable bit of defensive<br />\nwork gave the Hopkins Jay Vee<br />\nquintet a 14-10 victory over the Loyola Jay Vees. For a complete half the<br />\nEvergreen agre,gation wa.s held without a single point, while the Homewood outfit garnered 8 counters and a<br />\nwin. Those who saw action for the<br />\nvictorious squad were Day, Reynolds,<br />\nStevens, Wetzler, Royster, Naylor,<br />\nWillen, Baum, Silberman, Kahl, and<br />\nBeeler.<br />\nThe line-up:<br />\nLOYOLA<br />\nG. F. T.<br />\nLoden, f.<br />\n0 0 0<br />\nLazzatti, f.<br />\n0 0 0<br />\nMalloy, f.<br />\n2 0 4<br />\nMantz, c.<br />\n0 3 3<br />\nKernan, g<br />\n0 0 0<br />\nKnell, g.<br />\n1 0 2<br />\n-Totals<br />\n3 4 10<br />\nHOPKINS<br />\nG. F. T.<br />\n.1 1 3<br />\nDay, f.<br />\nReynolds, f.<br />\n1 0 2<br />\nStevens, f.<br />\n1 0 2<br />\nWetzler, c.<br />\n1 0 2<br />\nRoyster, g.<br />\n_ 1 0 2<br />\n1 1 3<br />\nNaylor, g.<br />\nTotals<br />\nLoyola<br />\nHopkins<br />\n<br />\n6 2 14<br />\n10 0-10<br />\n6 8-14<br />\n<br />\n..../.......1.-.1••••••••••<br />\n,<br />\n•<br />\n,<br />\n••••••••••••••••,.............<br />\n•<br />\n<br />\nTHE MUSICAL CLUB<br />\npresents<br />\n<br />\nthe team.<br />\nCarl Rasin and Harold Zheutlin were<br />\nthe boys whose knowledge of basketball tactics and ability to score in<br />\npinches played so large a part in the<br />\nvictory. Their shots, few in number,<br />\nrang true well nigh every time they<br />\nlet fly at the basket. Zheutlin's underbasket shooting was sweet to watch,<br />\nhis passes were accurate, and he was<br />\na constant threat every time he held<br />\nthe ball. Rasin was all over the court,<br />\npopping in long ones ,following up on<br />\nrebounds. His defensive work again<br />\nstood him in good stead for All-State<br />\nhonors. He seemed to have an inexhaustable amount of energy in his<br />\nrompings about the floor, a fact that<br />\nworried his wearied man no little.<br />\n<br />\nThe ANNUAL HOME CONCERT<br />\n-IV,<br />\n.<br />\n.0\".<br />\n<br />\nMaryland Casualty<br />\n<br />\nI<br />\n<br />\nTalbott Motor Co.<br />\nINCORPORATED<br />\n<br />\nSales<br />\n<br />\nFEBRUARY 27<br />\n<br />\nFORD<br />\n<br />\nService<br />\n<br />\nRenewed And Guaranteed Used Cars<br />\n<br />\n3421-3429 Greenmount Avenue<br />\n<br />\nDancing Afterwards<br />\n<br />\nPhone, Chesapeake 5226<br />\n•<br />\n•<br />\n.0,11,11. 11.<br />\n<br />\n•••••<br />\n•<br />\n<br />\n\fHOME'WOOD, BALTIMORE,<br />\n<br />\n4<br />\n<br />\nFEBRUARY 16, 1937<br />\n<br />\nMann Champions Blue Jays Look Madariaga Scores<br />\nJ. H. U. Press Broadus Mitchell Seminar<br />\nTo Tour Europe In Summer A Free Puerto Rico To Third Place Menace To Peace<br />\nReports Works<br />\nEight Countries On Itinerary; Russia And Cooperative In Latrobe Speech<br />\nPublished in 36 Movements To Receive Larger Share Of Attention Bases Argument On Econo- In Md. League<br />\nIn Twelve Week Study<br />\n<br />\nRanked Tenth Among College Presses Of The<br />\nWorld<br />\n<br />\nAnyone in the habit of glancing at amine the \"coops\" in Denmark and<br />\nthe bulletin boards can not have Sweden and will subsequently learn<br />\n<br />\nfailed to notice an orange and black<br />\nposter announcing \"The Broadus<br />\nMitchell Seminar on Economic Life<br />\n37<br />\nin Europe.\" Reading further, one sees<br />\nthat the Seminar is a \"travel-study<br />\nproject\" to be held next summer in<br />\neight countries of Europe. A twelve<br />\n'weeks tour to investigate the actual<br />\npractice of cooperative movements of<br />\nAccording to custom, the Johns various kinds. It is open to all interested.<br />\nHopkins Press announces its total of<br />\nDr. Mitchell, Director of the Semipublishing activities for the past year<br />\nnar and associate professor of politi(1936) 'as compared with the score<br />\ncal economy at The Hopkins declared<br />\nfor other years at this time. It is as that more time would be devoted to<br />\nfollows:<br />\na study of Soviet Russia than of any<br />\nother country, and Leningrad, MosCloth or boards:<br />\n1931 1932 1933 1934 1935 1936 cow, Kharkov, and Kiev will be all<br />\n17 visited. Mrs. Mitchell will accompany<br />\n23<br />\n16<br />\n31<br />\n21<br />\n19<br />\nher husband.<br />\nPaper covers:<br />\nPlans for the itinerary are near<br />\n19<br />\n14<br />\n18<br />\n11<br />\n20<br />\n15<br />\ncompletion; England, Denmark, SwePamphlets:<br />\n1 den, Finland, Russia, Austria, Switz3<br />\n11<br />\n11<br />\nerland, and France are to be toured<br />\nTotal titles:<br />\nin the order named; and discussions<br />\n37<br />\n43<br />\n34<br />\n45<br />\n52<br />\n45<br />\nand interviews with thinkers and<br />\nseventy-nine<br />\nwere<br />\nthere<br />\nIn addition<br />\nleaders in fields affecting present<br />\njournals issued.<br />\nEuropean economics and politics are<br />\nThe Hopkins Press is tenth-ranking being arranged. In Toynbee Hall,<br />\namong the best college presses in the London, two lectures by members of<br />\nthe London Labor<br />\nworld. In 1936 it showed a loss from Parliament and<br />\nSchools are already planned. These<br />\nthe rating of 1935, but the difference<br />\nwill deal with Trade Unionism and<br />\nis negligible.<br />\nthe British Labor Movement, which,<br />\nPrimary among the forthcoming Dr. Mitchell declares, has progressed<br />\npublications is the attempt of George a great deal farther in England than<br />\nBoas to devise a critical vocabulary in this country.<br />\nfor the various arts. This is entitled<br />\nFor several days students will exA Primer for Critics and is exactly<br />\nwhat its name implies. The Primer<br />\nopens with a preliminary chapter on<br />\nthe confusions which beset criticism.<br />\nThis lays the basis for the conservative part of the work. The second<br />\npart deals with the evidence which is<br />\nneeded for establishing various critical judgements and the third with<br />\nthe different schools of criticism. In<br />\nconclusion there is a short section on<br />\nthe authority of criticism and its limitations. This particular volume should<br />\nappeal directly to both students of<br />\nliterature, the fine arts, and philosophy, and to lovers of an analytical<br />\nstudy of ideas. Its price is $2.00.<br />\nSecond only to the Primer in significance is the book Edmund Spenser<br />\nby Dorothy F. Atkinson, Ph.D. This<br />\nbook is a biographical supplement to<br />\nother important works about Spencer.<br />\nIt attempts to till a need for an annotated bibliography by gathering all<br />\nthe Spenserciana available into one<br />\nvolume, and it compiles and organizes material about Spenser hitherto<br />\nomitted in his bibliographies. The<br />\nbook will be of assistance and importance to students as well as those<br />\nwho direct research. It is an up-todate volume on Spenser, and sells for<br />\n<br />\nPUBLISHED<br />\n<br />\nTITLES<br />\n<br />\nBook By Boas Leads List Of<br />\nFuture Press<br />\nPublications<br />\n<br />\nfrom Finnish experts how the Slav<br />\ncountry<br />\n<br />\nSenator<br />\n<br />\nat<br />\n<br />\nLarge<br />\n<br />\nLuis<br />\n<br />\nMunoz-<br />\n<br />\nmeets its financial obliga- Mann Puerto Rico spoke in Latrobe<br />\n<br />\ntions to the United States. Fascism' Hall, Thursday, February 11 on \"InGerman Nationalism will be dependence for Puerto Rico.\" Senator Munoz-Marin is an author and a<br />\nstudied through interviews with parpolitical figure of great magnitude in<br />\ntisans and observers in Geneva and Puerto Rico.<br />\nin Vienna.<br />\nHimself an ardent supporter of<br />\nand<br />\n<br />\nDr. I. V. Solins, a Columbia gradu-<br />\n<br />\nfirst<br />\nSenator<br />\nindependence, the<br />\nate and former educational director brought out the economic necessities<br />\nof Intournist, a Russian travel agency, for such an action as the granting of<br />\nindependence. At present four sugar<br />\nheads Edutravel, Inc., which in concompanies with refineries in Baltijunction with Dr. Mitchell, is spon- more, Boston, and New York control<br />\nsoring the Seminar. Those sailing on -more than one half of the sugar crop<br />\nthe party will leave New York July and have their plantations on the<br />\n24 on the Britannia and return Sep- best land, owning 60% of the mills.<br />\nAll the wealth secured from the sugar<br />\ntember 11. Further information condoes not remain in Puerto Rico, but<br />\ncerning the class accomodations and goes to America, thus draining Puerexpense will be included in a leaflet to Rico of Millions of dollars yearly.<br />\nHe then brought out the plight of the<br />\nto be published soon by Edutravel.<br />\nworkers—many earning less than<br />\n$100 a year -and the dependence of<br />\nthe island on sugar. Independence, he<br />\nclaimed, would enable Puerto Rico to<br />\nraise other crops and allow the farmers to obtain better land and own<br />\n(Continued from Page 1, Col. 2)<br />\ntheir own mills collectively.<br />\nDoes One,\" \"An Apple A Day,\" \"With<br />\nThe spender brought out the fact<br />\nPlenty of Money and You,\" \"I Was that Puerto Rico, would have no army<br />\nSaying to The Moon,\" \"I've Got You and would have a peaceful governUnder My Skin,\" \"So Do I,\" and ment. He blamed the presence of armies as the cause of revolts in Latin<br />\n\"Pennies From Heaven.\" Vocals by<br />\nAmerican Republics. Puerto Rico has<br />\nSkinney Ennis, Saxey Dowell, and no military traditions to preserve,<br />\nBob Allen are tastefully interspersed which is not the case in such countries as Mexico and Venezuela.<br />\nthroughout the proceedings.<br />\n<br />\nMary B. Shepherd<br />\nSponsors Cotillion<br />\n<br />\n$3.00.<br />\n<br />\nDormitory Resident<br />\nDisclaims Honor Oa<br />\nTen Dollar Fine<br />\n<br />\nMt. St. Mary's Has Clinched<br />\nChampionship, Says<br />\nCorrespondent<br />\nMt. St. Mary's has definitely<br />\nclinched the Maryland Intercollegiate<br />\nLeague championship. But, in the<br />\nbattle for the various \"also-ran\" positions, there remains enough competitive spirit to make the rest of the<br />\nleague contests interesting.<br />\nHaving successfully met Loyola's<br />\nattempt to drop them into the cellar,<br />\nthe Blue Jay's now have their eyes<br />\npeeled on the third place held by<br />\nWestern Maryland. A victory over<br />\nthe Green Terrors will move the Hopkins up to this immediate goal, giving<br />\nthem also a very slight chance of<br />\ndisplacing Washington from their almost certain second-spot.<br />\nThe Blue Jay quintet will have its<br />\nopportunity Thursday evening when<br />\nWestminster sends its hopefuls to<br />\nHomewood to encounter the Jays for<br />\nthe second time this season. Earlier in<br />\nthe year, in a game at Westminster,<br />\nthe Terrors downed the Hopkins by a<br />\n45-40 count. the Jays' desire to avenge<br />\nthis defeat and the Terrors' hope of<br />\nmaintaining their league standing<br />\nshould result in a keenly contested<br />\nstruggle.<br />\nIn this second meeting of the two<br />\nteams the Homewood club will be favored. The difference between the two<br />\nsquads in their first engagement was<br />\nStan Benjamin. But Benjamin has<br />\nelected to leave school. This leaves<br />\nUvanni as the Terrors' leading threat.<br />\nIf he is bottled up there should be<br />\nnothing but clear sailing for the Jays.<br />\n<br />\nHIPPODROME M<br />\nBAL ThifORE, MD.<br />\n<br />\n• ON STAGE •<br />\n<br />\nCized 73Zande<br />\nBo-mbsIzellorAz/<br />\n<br />\n.<br />\n4;<br />\n<br />\nAMERICA'S 6REATEST<br />\nALL-GIRL<br />\n<br />\nORCHESTRA<br />\n/N PERSON<br />\nlIZL<br />\n<br />\nUTTON<br />\nabJLt<br />\n<br />\nME LODE ARS<br />\nki RHYTHMIC REVUE<br />\n30•BROADWAY STARS<br />\nn ON SCREEN<br />\n*v.<br />\n<br />\n.kge TRACY<br />\n\"CRIMINAL<br />\nLAWYER...\"<br />\nTHE NEW<br />\n<br />\nMARCH OF TIME<br />\n9<br />\n<br />\n........<br />\n<br />\nHere.'s aroma<br />\n01 yoil<br />\n...a picture of Chesterfield<br />\ntobacco just as it conies out of<br />\nthe 1000 - pound wooden hogsheads after ageingfor three years.<br />\n<br />\n(Continued from Page 1, Col. 3)<br />\nthrowing missels.\" Much the same<br />\ngoes for many of our fellow residents<br />\nin A and B entries; several were in<br />\nbed when it happened; others were<br />\nout on dates. One fellow was at his<br />\nhome in Massachusetts with his parents at the same time that he was<br />\nhere (according to the letter) engaged in \"general rough housing\";<br />\nthat boy's father must have had the<br />\nsurprise of his life when he found that<br />\nhis son is twins. Mr. Benjamin Jones,<br />\nproctor and custodian of the Dormitory, also received a ten dollar fine-or \"assessment\"; he, too, is reluctant<br />\nto accept the honor.<br />\nIn fact, all the residents who have<br />\nbeen thus honored—and they comprise roost of the inhabitants of A and<br />\nB (around $170 having already been<br />\nassessed) - are showing themselves<br />\nadmirably modest. We are not unappreciative, not by any means. Anybody who heard the demonstrations in<br />\nthe dining hall Friday at dinner<br />\nwhenever Mr. Sauperwein --he signed<br />\nthe letters --- was mentioned, knows<br />\nhow deeply we appreciate the sudden<br />\nrecognition which has come to us.<br />\nBut our mate sense of justice cries<br />\nout for the redistribution of this<br />\nweath of honors in a fairer way, even<br />\nthough it means that most of us will<br />\n<br />\nIf you could be there when these hundreds of hogsheads are opened up<br />\n... if you could see this mild ripe<br />\ntobacco, prime and ready to be made<br />\ninto Chesterfield Cigarettes ...see the<br />\ngolden color of the leaf... and get a<br />\nwhiff of that delightful aroma... you'd<br />\nsay ...<br />\n<br />\n\"Delicious ... makes me<br />\nthink offruit cake.\"<br />\n<br />\nMild, ripe home-grown and aromatic Turkish tobaccos...<br />\naged three years... make Chesterfield an outstanding<br />\ncigarette...give them a more pleasing taste and aroma.<br />\n<br />\nhave less of them.<br />\n—A Dormer<br />\n<br />\nmic Grounds; Sugar A<br />\nFactor<br />\n<br />\n(Continued from Page 1, Col. 2)<br />\nThe lecturer deplored the passing<br />\no fthe phrase, Liberal, even in the<br />\nUnited States. People are becoming<br />\nmore and more intolerant. To a person of progressive tendencies, if you<br />\nare shy of plunging headlong into<br />\nnew reforms, you are a Fascist. To<br />\na conservative, if you are tolerant of<br />\nthe New Deal, you are labeled a Communist. This, he declared, was a<br />\nsham, because it beclouded thle real<br />\nissues that face the world.<br />\nLn reference to Spain, Dr. Madariago declared he hated to talk of the<br />\nsituation in his homeland, where democracy ha dtaken on more or less<br />\npinkish shades to combat Fascism.\"<br />\n<br />\nCopyright 1937. Liccarr & MYERS TOBACCO CO,<br />\n<br />\nIA<br />\n<br />\n\f", "format": "basic_html", "processed": "Ice<br />\nler<br />\nne<br />\n2)<br />\nJand.<br />\ndner,<br /><br />\nFIRST EDITORIALS OF<br />\nNEW REGIME<br />\n—Page 2<br />\nVOL. XLI, NO 23<br /><br />\nHOMEWOOD, BALTIMORE, FEBRUARY 16, 1937<br /><br />\nStormers Elect<br />\nNine Candidates<br />\nTo Membership<br /><br />\nlmer,<br /><br />\nrime,<br /><br />\nMorrow Only Man Chosen<br />\nFor Acting Staff<br />\nBy Group<br /><br />\n[cher,<br /><br />\nEXACTING STANDARDS<br /><br />\nAner,<br />\nfary-<br /><br />\ndler,<br />\nland;<br />\nHopRad3.<br /><br />\n3Joilits•i*tpltius Nrius-Krttrr<br /><br />\nOfficers To Discuss Plans<br />\nFor A Second<br />\nProduction<br /><br />\nCALL FOR NEWSLETTER CANDIDATES<br />\nWEDS., 12.20<br /><br />\nHOME CONCERT<br />\nTICKETS<br />\nTickets for the Musical Club<br />\nConcert may now be obtained in<br />\nLevering Hall in exchange for the<br />\nS.A.C. ticket stub.<br />\nAdditional<br />\ntickets may be obtained at the<br />\nsame time for one dollar each.<br />\nThe Home Concert is scheduled<br />\nfor Friday, February 26, in the<br />\nMaryland Casualty Auditorium. A<br />\nfull program, to be printed next<br />\nweek in the NEWS-LETTER, arranged, with the Glee Club, Banjo<br />\nClub, Hawaiian Troupe, soloists,<br />\nquartet, and Blue Jay Orchestra<br />\nparticipating.<br /><br />\nPRICE 5 CENTS<br /><br />\nFisk U. Professor Dues Discussion<br />\nTo Speak Tonight At Frosh Assembly<br />\nBefore Supper Club This Thursday<br />\nJanies Weldon Johnson New Budget System ConsidProminent As Author And<br />\nered; Plan To Take<br />\nRacial Leader<br />\nAction<br />\nTopic Is The Negro', The<br />\nFurther Assembles Planned;<br />\nTest Of Democracy<br />\nMusical Club On<br />\nIn America<br />\nFebruary 25<br /><br />\nFinkel Elected<br />\nTo Editorship<br />\n.01 Newspaper<br />\nNew Editor Has Served<br />\nOn News-Letter For<br />\nThree Years<br />\nSTARTS<br /><br />\nTHIS<br /><br />\nISSUE<br /><br />\nVaried Activities Include<br />\nMusical Club, 'Stormers<br />\nClass Committees<br /><br />\nDr. James Weldon Johnson, Professor of Creative Literature at Fisk<br />\nThe second assembly under the<br />\nUniversity, and former American newly tried scheme of voluntary<br />\natconsul to Venezuela and Nicaragua,<br />\ntendance will be devoted to a discusStanley M. Finkel was elected last<br />\nwill be the Supper Club Speaker toThe Barnstormers, dramatic society<br />\nFriday to serve for the corning year<br />\nnight at 6:00 at Levering Hall. His sion of freshman class dues this<br />\nof the Johns Hopkins University, held<br />\nas editor-in-chief of the NEWStopic will be \"Cultural Contribution Thursday, February 18 in Remsen 1.<br />\none of their periodic elections to the<br />\nLETTER. Finkel, a former associate<br />\nof the Negro to America.\" He will Attendance at the first of the new<br />\nvarious staffs of this organization,<br />\neditor, took over the post previously<br />\nspeak at the<br />\nWilson<br />\nMemorial type assemblies that of last week,<br />\nlast Friday, electing nine new memheld by William Diamond immediChurch, on the University Lecture was adjudged \"Fine\" by ershner<br />\nbers to the club.<br />\nately after the election. He had deseries at 8:15 on the subject \"The Cross, President of the Student CounAdditions to the Production Staff,<br />\nfeated Harold Zheutlin, assistant<br />\nNegro: The Test of Democracy in cil. The meeting place has not yet been<br />\nand the Business and Acting Staff,<br />\nsports editor, in the race for the<br />\nAmerica.\"<br />\ndecided.<br />\nwere made by the election. Qualeditorship.<br />\nDr. Johnson will be introduced at<br />\nThe discussion will be started by<br />\nifications, in<br />\nkeeping<br />\nwith<br />\nthe<br />\nFinkel, a Junior in the College of<br />\nthe Supper Club by H. Milton Wagner,<br />\nan explanation of the new dues budtraditionally exclusive element in the<br />\nArts and Sciences, takes office after<br />\n'12, President of Baltimore Urban<br />\nbasic principles of the group, were<br />\na period of three years service on the<br />\nLeague and member of the Levering get sytem by Hershner Cross. Advanquite stringent. Eligibility was limHall Board of Managers. Dr. Ivan E. tages of the new system as opposed to<br />\n—Courtesy News-Post paper, which began a week before he<br />\nited to those devotees who had proven<br />\nMISS MARY B. SHEPHERD<br />\nentered the University. His experience<br />\nMcDougle, Professor of Socioligy and the one now in operation will be<br />\ntheir enthusiasm for the carrying out<br />\nincludes terms as Junior, Associate<br />\nEconomics at Goucher will introduce stressed. It will be brought out that,<br />\nof the purposes of the 'Stormers, had<br />\nanu Assistant Managing Editor.<br />\nDr. Johnson at the Wilson Memorial<br />\nunder this new budget system, presgiven evidence of their ability as<br />\nThle greatest crowd to attend a Church.<br />\nDuring his high school and college<br />\nent freshmen need have no fear of<br />\neither administrators or actors, de- Hopkins public lecture in many years<br />\ncareers, the incoming editor has<br />\nBar Member<br />\npending on the office the individual<br />\nserved with four past NEWS-LETTER<br />\nProminent as an author and racial further added assessment in their<br />\nyesterday heard Dr. Salvador Madariwas trying out for; and except in unleader, Dr. Johnson has served for senior year, whereas, under the preschiefs, Stanley<br />\nBlumberg, Jesse<br />\nago, secretary of the disarmament<br />\nusual cases, no candidate was eligimany years as Secretary of the Na- ent system, there is every probability<br />\nBorden, Kenneth Zierler and William<br />\nble unless he had two or three years conference of the League of Nations, tional Association for the AdvanceDiamond. At Baltimore (...Ity College,<br />\nof additional taxation in their last<br />\nof active service as a background. denounce Fascism and Communism ment of Colored People. He is a gradhe was Editor of the Greenbag, senior<br />\nAn exception might be made for those as menaces to world peace. The for- uate of Atlanta University, and has year.<br />\nanual, and the weekly Collegian.<br />\nFurther Plans<br />\nwho had been particularly active for mer Spanish<br />\nFinkel is the fifth successive City<br />\nAmbassador to the received degrees at Columbia UniExplanations<br />\nwill be followed by<br />\na one year period. In all cases, howversity,<br />\nTalladega<br />\nCollege,<br />\nCollege graduate to win the editorship.<br />\nand HowUnited States discussed Spain and<br />\never, the aspirant to an office on the<br />\nard University. In 1906 he served as a discussion along the lines of an<br />\nAs a major in Psychology, he has<br />\nBarnstormers had to be approved by World Peace on a half hour's notice. United States Consul to Puerto Cab- open forum. When all discussion is<br />\nwon several scholastic honors during<br />\nat least three-quarters of the mem- He had thought he was to speak on an ello, Venezuela, and as Consul to Cor- at an end, a vote of the men present<br />\nMiss Mary Briscoe Shephard, a his period at the Hopkins. As a freshentirely unrelated topic.<br />\nbers of the club for consideration.<br />\ninto, Nicaragua, from 1909 to 1919. will be taken, and a conclusion ar- debutante<br />\nof a season ago, has been man he held the City College Alumni<br />\nEmphasizing his love for peace, Dr. He also is a member of the Florida<br />\nOne Actor Chosen<br />\nScholarship. In his sophomore and<br />\nrived at by this means.<br />\nchosen<br />\nas sponsor for the Second<br />\nMadariaga declared that the world Bar.<br />\nJames Morrow, senior, was the only<br />\njunior years have come to him reThe assembly was originally supDr. Johnson has been best known posed to be held in Latrobe Hall Cotillion to be held at the Lord Balti- spectively the Woodyear and Horman chosen to the Acting Staff. Mor- had achieved unity through the cinrow has been active in other extra- ema, expanding industry and a gen- for his work as Secretary of the Na- 120. However, that room will not be more Hotel next Monday night, ac- tense G. Moses awards. He holds, in<br />\ncurriciular activities including the erally better knowledge of itself than tional Association for the Advance- available for the assembly as it will cording to an announcement made addition to a trustee's grant, a post<br />\nment of Colored People, and for his be neede at that time for the instal- yesterday by<br />\nswimming team, the NEWS-LETTER, existed twenty years ago.<br />\nthe Cotillion Board. Miss as assistant in the Psychology De\"Countries are not self-different. own work in music. He collaborated lations of the exhibits for the Engithe Musical Club, quartette, DebatShepherd is the daughter of Mr. and partment.<br />\ning team Morrow has the further dis- France and Germany during the late with his brother in writing for the neering Show.<br />\nIn three years at the University,<br />\nMrs. F. Byrn Shepherd of 1414 Park<br />\nWhen arrangements are completed<br />\ntinction of being president of the war had an agreement to exchange light opera stage, and produced the<br />\nFinkel has also taken part in several<br />\nhonorary journalistic society, Pi articles each needed to carry on the English version of the libretto to the for obtaining another room for the Avenue.<br />\nextra-curricular activities. He is pubstruggle through the intermediary, grand opera \"Goyescas,\" which was meeting; the new meeting place will<br />\nWith the choice of a sponsor, the licity director for the Musical Club<br />\nDelta Epsilon.<br />\nSwitzerland.<br />\npresented in the Metropolitan Opera be announced on the various bulletin Cotillion Board,<br />\nFive men, outstanding for their<br />\nhaving completed its and the Barnstormers and holds a<br />\nHouse<br />\nin 1915.<br />\nboards.<br />\n\"I<br />\nbelieve<br />\nthat<br />\nthrough<br />\nonly<br />\npolitiwork, were chosen to the Production<br />\nfinal arrangements, this week settled place in the Glee Club. He is a former<br />\nAmong his writings are included<br />\nAn assembly has already been armember of the Hullabalo Staff. Last<br />\nStaff. The first, Arnold Glantz, jun- cal liberalism freed from graft and<br />\n\"The<br />\nAutobiography of An Ex-Col- ranged for the following week, Febru- down to the task of turning Hal Kemp spring he was tapped by Pi Delta<br />\ncorruption<br />\ncan<br />\nthe countries and peoEpior, is a member of the Pi Lambda Phi<br />\nored Man,\"\"The Book of American ary 25. The student Council has se- into a financial as well as harmonic silon, national honorary journalistic<br />\nfraternity and holds, as one of his ples of the world survive and make<br />\nNegro Spirituals,\" \"Second Book of cured the Musical Club for that date, asset to Commemmoration Day festiv- fraternity, and was elected<br />\nto serve<br />\nmany accomplishments, guitar-play- for peace. Communism and Fascism<br />\nSpirituals,\"<br />\nManhattan,\" and the Club will give its first pro- ities. If the change-box<br />\n\"Black<br />\nideoligies<br />\nare<br />\nmere<br />\nsacrifice<br />\nthat<br />\nthe<br />\ning. Maurice Lazarus, junior, is also a<br />\ncontinues its as its Treasurer. He is also Secretary<br />\n\"God's Trombones,\" and \"Along This gram of the year to Hopkins students<br />\nmember of Pi Lam, who merited a individual to the nation. Never was a<br />\nmerry jingle unabated throughout the of Phi Sigma Delta fraternity.<br />\nWay,\" (his autobiography).<br />\nat that time.<br />\ntime<br />\nexpression<br />\nimportant<br />\nmore<br />\nfor<br />\nFinkel has also been active in the<br />\nposition on the Production Staff. The<br />\nweek, the Board faces the happy prosaffairs of his class. During his first<br />\nthird Man picked was Joseph Sarno- of individualism and expression than<br />\npect of counting an overflow house at<br />\ntwo years he served as a member of<br />\nvitz, junior, who is, in addition to his today.\"<br />\n$3.50<br />\na head next Monday evening. the Freshman and Sophomore BanBarnstormers activities, a candidate<br />\nHal Kemp and his Orchestra, as we quet Committes. Last year he served<br />\nfor the NEWS-LETTER staff at the<br />\npresent time.<br />\nmay have intimated in earlier para- as publicity director for the joint<br />\nFreshman-Sophomore Dance.<br />\nDaniel Gidinski, junior, and Milton<br />\ngraphs, are promised and hoped for<br />\nHe was recently elected Secretary<br />\nSaul, junior, manager of the crosson the bandstand. And Mr. Kemp, acof the Junior Class.<br />\ncountry and track team, were elected.<br />\ncording to the Public Relations Department of Music Corporation of<br />\nOn the business staff, David Halle,<br />\n\"The material which we are workAmerica, is \"making history in the<br />\nsophomore, member of the basketball<br />\ndance world.\" The slightly prejudiced<br />\nSquad; William Mehling, sophomore, ing with now is the best that I have<br />\nof the varsity football squad, and ever seen in my ten years of associa- To the Editor of the NEWS-LETTER:<br />\nMr.<br />\nhas been assessed two opinion of the MCA's Charley MichRobert McShane were added to the tion with the Musical Club,\" stated<br />\nEarly in the year some writer for charges of $5.00 each represent- elsons as to Mr. Kemp's merits seems Chen, Johnston Scholar Receives<br />\nOsmar Steinwald, coach of the Glee the NEWS-LETTER affronted the resi- ing penalties for infractions of dor- to be generally current throughout<br />\nroll.<br />\nA. A. A. S. Grant<br />\nAt the meeting it was decided that Club. \"The spirit and cooperation of dents of B entry in the Dorm by mitory regulations entered into on the Hopkins. For he's certainly makDr. T. T. Chen, Johnston Scholar<br />\nthe officers of the Club, presided over the boys have made an enthusiastic characterizing that entry as \"tame.\"<br />\nJanuary 29, 1937, and Feb. 4, 1937, ing more than history for the Cotillion<br />\nin the Department of Zoology, reby Martin Levine, senior, would meet and active group of the campus' lar- Ever since then the chief end in life<br />\nby residents of B entry of the Al- Board's coffers.<br />\nsoon to discuss possibilities of a new gest organization.\"<br />\nfor said residents—at least a few of umni Memorial Hall Dormitory, in<br />\nAs a matter of fact, Mr. Kemp ceived a grant for research from the<br />\nelection and to consider arrangements<br />\nwhich Mr.<br />\nresides. These comes here with something more than American Association for the AdOs reported that he has heard from them -has seemed to be to redeem<br />\nfor a second Barnstormers production numerous authorities who have ob- themselves from that terrible insult. infractions took the form of general a baton, a prayer, and the good wishes vancement of Science, it was anfor the current year.<br />\nserved previous Musical Clubs that IIn pursuing this noble purpose they rough housing and the throwing of of the management. Max Kalish, the nounced in a current issue of Science.<br />\nThe grant, according to the Assothis year's group is one of the out- have had recourse to several forms of \"miscels\" to the endangerment of sculptor, is reported to have recently<br />\nstanding ones turned out at the Hop- \"hell-raising\": they have unwound persons and property. Residents of named him the world's outstanding ciation's announcement, is \"for rekins. The coach attributed this to the the fire-hose and turned water al over of the dormitory previously had bandmaster, and, as such, immortal- search on the physical basis of heredincreased interest in music, which he the entry; they have thrown electric<br />\nbeen notified that any group having ized him in bronze. For two years, ity in unicellular organisms. The besaid<br />\ngrowing<br />\nis<br />\nevery<br />\nrooms<br />\nyear.<br />\nin the vicinity of recurring the National Institute of Social havior of chromosomes in fission, enmilk-bottles<br />\naround<br />\nlight bulbs and<br />\nThe incoming February class of the<br />\ninfractions would be accountable. Dancing, representing 1,200 acade- domixis, and conjugation in paramenumbers;<br />\ngoodly<br />\nin<br />\nhave<br />\nthey<br />\neven<br />\nLarge<br />\nNumber<br />\nHopkins was announced by Miss Irene<br />\nis found guilty in the<br />\nmies in the United States, has des- cium in relation to problems of hered\"An unusually large number of men built miniature bon fires in the enry. If Mr.<br />\nDavis, registrar, to consist of fourteen<br />\nfuture<br />\nserious<br />\ndisturbcreating<br />\nof<br />\na<br />\nignated<br />\nKemp as the country's most ity and variation in Protozoa.\"<br />\nLast<br />\nall,<br />\neffort<br />\nfinal<br />\nof<br />\nin<br />\nachieve<br />\na<br />\nto<br />\nturned<br />\nout<br />\nyear<br />\nthis<br />\nand<br />\nsome vocal<br />\nMembers from Baltimore and one<br />\nPrevious to his work at Hopkins,<br />\nbreaking<br />\notherwise<br />\nregulapopular dance leader. And, to make<br />\nsections have been vastly improved,\" recognition they (or one of them) ance or<br />\nfrom Bayonne, New Jersey.<br />\nhe continued. \"We have several good dropped a plate-glass shalf from a tions, we will have to ask him to it practically unanimous, he ran Dr. Chen worked at Yale as a Bruce<br />\nOf these Freshmen six are in the<br />\nahead of the field in a poll of college scholar.He worked with protozoa there<br />\nselections for the Glee Club and these lavatory all the way down from the withdraw from the University.<br />\nCollege of Arts and Sciences, four in<br />\nmen, taken by \"Variety\"—a theatri- also, and studied particularly the<br />\ndifficult than usual. Our pro- third floor to the first. It cracked the<br />\n$5 And $10 Fines<br />\nthe School of Business Economics, and are mroe<br />\ncal<br />\ngram is usually varied, because we drinking fountain on the first floor as<br />\nmagazine, of somewhat dubious segregation of the nuclear material<br />\nThat is taken from the letter sent<br />\nfive in the School of Engineering.<br />\ntry to please a variety of audiences. it fell and was itself shattered into to the father of the present writer. curricular value by the way. Thus during reproduction. He received his<br />\nTabulated as to secondary schools,<br />\nThe pieces are of all types, and this many pieces on the floor. Here was Naturally we feel highly honored at has he received the triple accolade of PhD at the University of Pennsylsix are from Baltimore City College,<br />\nvania, and did his undergraduate<br />\nyear we have a well-rounded group of a ded which was to gain the B entry being assessed ten dollars: for no one Art, Industry, and Education.<br />\nfour from Forest Park High School<br />\nwork at Oberlin College.<br />\nsongs.<br />\nresident the recognition for which received a higher fine than that. Most<br />\nNor have the band's efforts been<br />\nand three from Baltimore Polytechnic<br />\nthey<br />\nlong<br />\nsought<br />\nhad<br />\nso<br />\nfaithand<br />\nin B entry got only fine dollar fines. limited to these fields. So prolific and<br />\n\"This year's Club is under excepInstitute, while one attended the colNEWS-LETTER TO MEET<br />\nfully,<br />\nHowever, our conscience will not be profiitable have been its recordings<br />\nlege \"Gimnasia Nordia\", Tel Aviv, tionally capable management, and<br />\nTODAY, 12.30<br />\nMagnificent<br />\nRecognition<br />\nthese offices are responsible for the<br />\nclear if we accept this honor without that the moguls of the Brunswick<br />\nPalestine.<br />\nSaid recogition came about a week protest, much as we appreciate it; Company reputedly go to bed each<br />\nefficient running of things. An excelAn important meeting of the<br />\nlent schedule of concerts have been ago and it was magnificent. It took for we do not deserve it, and heaven night with a prayer for the continued<br />\nNEWS-LETTER editorial staff will<br />\nmade; howeved, the Club should be the form of carbon coies of letters, forbid that we accept anything not presence of the Kemp signature at<br />\nbe held today at 12:30. ReorganiNYA Graduate and Undergraduate at its peak for the Home Concert on the originals of which had been sent rightfully ours. On the occasions re- the bottom of One of their contracts.<br />\nzation plans of importance to<br />\nStudents are to hand in their time re- Friday, February 26.<br />\nto the parents of the respeective per- ferred to in the letter we were in our Recent Brunswick products include<br />\neach member will be drafted.<br />\nPorts by Saturday, February 20 at 1<br />\n\"I Cannot urge the students too sons fortunate enough to receive this room trying to study or read, instead \"Good Night, My Love,\" \"You Don't<br />\nThe board of Editors will issue<br />\nla•<br />\nat the office of the Bureau of strongly to attend this presentation acknowledgement. Part of such a let- of bein gout in the hall-ways valiantly Love Right,\" \"One Never Knows,<br />\na call for new candidates to the<br />\nAppointments.<br />\n(Continued on Page 3, Col. 2)<br />\nand bring their parents and friends.\" ter follows:<br />\n(Continued on Page 3, Col. 2)<br />\nstaff Wednesday.<br /><br />\nMadariaga Scores<br />\nMenaces To World<br />\nPeace In Lecture<br />\nSpanish Envoy Says Fascism, Communism Are<br />\nThreat To Peace<br /><br />\nLevering Throng Hears Orator Plead For World<br />\nCitizenship<br /><br />\nMary B. Shepherd<br />\nChosen as Sponsor<br />\nFor 2nd Cotillion<br /><br />\nSponsor Of Affair Is Debutante Of Year<br />\nAgo<br /><br />\nDormitory Residents Disclaim<br />\nLauds<br />\n'Honors' Thrust Upon Them<br /><br />\nSteinwald<br />\nMusical Talent<br />\nIn '37 Organization Letter<br /><br />\nReceived From Dorm Correspondent Lists Alleged<br />\nEvents And Charges Of Alleged Damages; Claims<br />\nLetter, Fine Imposed<br /><br />\nIncoming February Class<br />\nConsists Of 15 Members<br /><br />\nNYI4 Time Reports Due<br /><br />\nHopkins Z000logist<br />\nGets Research Grant<br /><br />\nHOME'WOOD, BALTIMORE, FEBRUARY 16, 1937<br /><br />\n2<br /><br />\nbe 3obn5 JOopkin5<br />\nKett Cr,<br /><br />\nt<br /><br />\nor administration. We pledge ourselves to keep this arrangement intact; any attempt to disrupt it will be given<br />\ndue publicity in these columns.<br />\nWe want to make the NEWS-LETTER a student paper,<br />\nrun by students, and guarding jealously student welfare.<br />\nAny deviation from the path of our ideals and goals will<br />\nmake us responsible to the student body.<br /><br />\nKnowledge<br />\nIs<br />\nPower<br /><br />\n1RCL,IN'<br />\nTHE<br /><br />\nAM PUS<br />\nwith BOBBY HILDRETH<br /><br />\nLETTERS TO<br />\nTHE EDITOR<br />\nThe NEWS-LETTER welcomes views<br />\nand comments on any subject written<br />\nto the paper with the exception of<br />\nlibelous statements. All correspondence will be held in the strictest<br />\nconfidence; and, although a signed<br />\nname gives evidence of god faith,<br />\nnames will not be printed, if so requested. Please send letters to the<br />\neditor of the NEWS-LETTER at the<br />\nJohns Hopkins University.<br /><br />\nWe desire to present fair, impartial, and uncolored<br />\nStudents at the recent U. of M.<br />\nnews accounts on the allotted three pages. But on the<br />\nwere disappointed in the<br />\ndance<br />\nSubscription<br />\nHere begins a new column, which<br />\neditorial pages-one sanctum sanctorum-we will pretunes from Bob Crosby's orchesBy Mail<br />\nhope you will enjoy, but not take<br />\nwe<br />\ninquireager,<br />\nsent opinions and conclusions from \"lively,<br />\ntra To make up for this many<br />\nseriously. This week we present<br />\ntoo<br />\nActStudent<br />\nobtainphases<br />\nTreasurer,<br />\nand<br />\nfacts<br />\nall<br />\nthe<br />\nto<br />\nupon<br />\nfees<br />\nbased<br />\non<br />\ndance.<br />\nminds,<br />\nKemp<br />\ning\"<br />\nsubscripti<br />\nHal<br />\nour<br />\nRemit<br />\nwill attend<br />\nof definitions acquired from relist<br />\na<br />\nHop*<br />\nJohns<br />\n*<br />\n*<br />\nable of the situation or problem. We will not be dictivities Council, Renisen Hall, Postoffice,<br />\nin exam books.<br />\nsearch<br />\nor<br />\nindividual<br />\ngroup<br />\nsmall<br />\nby<br />\nany<br />\ndominated<br />\nGilman<br />\n.<br />\nin<br />\nor<br />\nto<br />\ntated<br />\nkins University<br />\nThe cutest things<br />\nDid you know:<br />\non the<br />\nwe will not be guided by anyone fraternity,<br />\npadlocks<br />\ninterest;<br />\nlittle<br />\nthe<br />\nare<br />\nHall<br />\nEntered as second class matter, December 3, 1936, at activity, or organization. Our decisions will be aimed<br />\n1. Acrimony, sometimes call holy, is<br />\nsmoking stands in the main enthe Postoffice in Baltimore, Md., under the Act of at intelligently and logically. When we take a stand it<br />\nanother name for marriage.<br />\nTo the Editor of the NEWS-LETTER.<br />\ntrance to the library. To swipe<br />\nCongress, November 3, 1879.<br />\n2. An adage is a thing to keep cuts Dear Sir:<br />\nshall be firm and determined; but we will not fear to alone it would be necessary to carry<br />\nin.<br />\nthe long bench with it. Honor<br />\nPublished semi-weekly from October to June, except ter or modify our views if the discovery of new facts<br />\nYour recent editorial concerning<br />\nbe<br />\n3. Ambiguity means having two<br />\nsystem and loose cigarette trays<br />\nduring examination and college holiday periods by under- or viewpoints forces such a change. We will not<br />\nscheduling of two major affairs,<br />\nthe<br />\nafraid to admit our mistakes, if it is proven that we<br />\nwives living at the same time.<br />\ndon't mix.<br />\ngraduates of the Johns Hopkins University.<br />\nthe Cotillion and the Musical Club<br />\n* * *<br />\nhave erred.<br />\n4. An appendix is a portion of a<br />\nEDITORIAL STAFF<br />\nhas<br />\nshe<br />\nThe laugh was on Pine, when<br />\nYes, we are aware that ideals are maintained with<br />\nbook for which nobody has yet Concert in the same week,<br />\nEditor-in-Chief<br />\nWilliam Diamond<br />\nmanagepoor<br />\nthe<br />\nlight<br />\nto<br />\ndate<br />\nbrought<br />\nmid-week<br />\nnoble<br />\nand<br />\nfine<br />\nis<br />\nthat<br />\nannual<br />\nis<br />\nher<br />\nthere<br />\nwhat<br />\nout<br />\nbut<br />\nfound<br />\nmuch difficulty;<br />\ndevised the use.<br />\nManaging Editors<br />\nJames Morrow, David Caplan<br />\nthat can be attained and kept without difficulty. But we was going to have his true love from 5. Average means something that ment on the part of certain campus<br />\nEditor<br />\nAssociate<br />\nStanley Finkel<br />\nleaders in setting dates for activities.<br />\ndedicate ourselves to those purposes and ideals. We are Philadelphia with him for the Home<br />\nhens lay eggs on.<br />\nSports Editor<br />\nBernard D. Pinck<br />\nAs an active member of the Musical<br />\nto stand trial a year hence for the decision as to Concert. Better luck, Kid, for the<br />\nready<br />\nA blizzard is the inside of a fowl. Club, I can definitely vouch for the<br />\n6.<br />\nAssistant Managing Editor<br />\nBenjamin Root<br />\nduring<br />\nMilitary Ball in April.<br />\nwhether we have lived up to our goals and policy<br />\n7. A buttress is a women who makes fact that the Concert had been sched*<br />\n*<br />\n*<br />\nArnold Glantz, Harold Zheutlin..Assistant Sports Editors the year.<br />\nEditor<br />\nbutter.<br />\nNews<br />\nWethered Barroll<br />\nuled for its present date several<br />\nErnie must be making up for<br />\n8. An epistle is the wife of an apos- months ago. The extremely unfair<br />\nReporters--Max Iskowitz, Nathaniel Finkelstein, Jewett<br />\nthe time he lost while studying<br />\ntle.<br />\nGoldsmith, Howard Reizenstein, Julian Adler, Carl<br />\nattitude on the part of the Cotillion<br />\nfor exams. Two dates in one<br />\n9. To germinate is to become a nat- Board in arranging the dance for the<br />\nRasin, Floyd Katske, Leonard Rubinger, Morris Wesin<br />\nis<br />\nlikewise<br />\n-LETTER<br />\nNEWS<br />\nHow<br />\nHopkins<br />\nthe<br />\ngirl.<br />\nof<br />\nsame<br />\nThe 'editor<br />\nweek with.the<br />\nuralized German.<br />\nsel, Arthur Katz, Martin Krieger, Lester Rosenthal, a situation perhaps peculiar to the Hopkins campus.<br />\nsame week is without most inconsiddid that happen, pal?<br />\n10. A goblet is a sailor's child.<br />\n*<br />\n*<br />\n*<br />\nSidney Baum, J. Murray Kempton.<br />\nhave<br />\nwho<br />\nfew<br />\nerarte. The Musical Club, by far<br />\nthose<br />\nstudents<br />\nof<br />\none<br />\nFortunately we are<br />\n11. A grass widow is the wife of a the largest and most widely repreis only three<br />\nand worked closely with four editors. So<br />\nunder<br />\nCotillion<br />\nthe<br />\nserved<br />\nthat<br />\nNow<br />\nvegetarian.<br />\nREPO..iiENTECI FCR NA f.,NAL. ADVERTISING EIT<br />\nsented organization on the campus,<br />\nour position may be still more individual in our cogni- days off; Allow rile to speak for those<br />\nletters M.D. signify \"menThe<br />\n12.<br />\nNational Advertising Service, Inc.<br />\nobligais thus very ungenerously subordinges,<br />\n,<br />\nAll<br />\ndisadvanta<br />\nadvantages<br />\ndancing.<br />\nlabor,<br />\nthe<br />\nthe<br />\nenjoy<br />\nof<br />\nto<br />\nzance<br />\nwho wish<br />\nCollege Publishers Representative<br />\ntally defficient.\"<br />\nNEW YORK. N.Y.<br />\nated to the Cotillion Board, a very<br />\n420 MADISON Ave.<br />\ntions, duties opportunities and temptations of the head drunks and stags, please stay off the<br />\n. SAN FRANCISCO<br />\n13. A monologue is a conversation be- small minority.<br />\nBOSTON<br />\n.<br />\nCHICAGO<br />\n.<br />\nmiddle.<br />\nnewspaper<br />\nthe<br />\nin<br />\nHopkins<br />\nof the<br />\ndance floor, especially<br />\nSEATTLE<br />\n•<br />\nPORTLANC<br />\nLos ANGELES<br />\ntween two people, such as husThis same general attitude of CotilWe know the frequent inadequacies of the staff, we There should be a corner for them<br />\nband and wife.<br />\nknow of the number of pre-medical students with full to go to and be entertained by-well, 12. A refugee keeps order at a foot lion Board priority seems to be reflected even into the pages of this<br />\nschedules and the number of apathetic, indolent students let's say--Hutch.<br />\nball game.<br />\n*<br />\n*<br />\nA survey of college newspapers and a comparison with with fool schedules, we know of ;he lack of a School<br />\ncampus paper. In the issue of Febru15. A skeleton is a man with his inthe metropolitan newspapers of today will serve to show of Journalism or of any journalistic training here. We<br />\nJan Garber and his orchestra<br />\nary the 91:11, a small, inconspicuous<br />\noff.<br />\noutside<br />\nhis<br />\nand<br />\nside out<br />\nthat there is a fundamental difference between them know the late hours at the printers, we know the grindent of the Home Concert<br />\nIn York, Pa., tomorrow night.<br />\nannouncem<br />\n16. S.O.S. is a musical term meaning<br />\nthat every real college publication should note. And it is ing noise of the presses as the editor endeavors to study.<br />\nAdmission ..$1.00 _plus _taxes.<br />\nJohns Hopkins University Muthe<br />\nof<br />\nsame only softer.<br />\nthat, for the most part, college newspapers are run by We are fully aware of the discouragements, of the printDance from 8-12. Coming: Mal<br />\nsical Clun was neatly tucked away on<br />\n17. Revolution is a form of governcolthe students, of the students, and for the students. The er mistakes, of the students uncritical derisions, of the<br />\nthe<br />\nHallett, Feb. 27. Watch<br />\nthe inside page in a single column. A<br />\nment abroad.<br />\nnews gathered and the editorials expressed are all in sight of NEWS-LETTERS contemptuously thrown in wasteumn for Information regarding<br />\nvery bold, in fact glaring, announce18. A vacuum is an empty space<br />\nWhat happens on the campus or what materially affects paper baskets. We are also cognizant of the joy of a<br />\nthe dance orchestras coming to<br />\nment of the Cotillion was effaciously<br />\nwhere the Pope liyes.<br />\nthe Quadrangle.<br />\npage,<br />\nfront<br />\nPa.<br />\npresented in four columns on the outYork,<br />\nan<br />\nattractive<br />\nthought-proviking editorial, of<br />\n19. Transparent means something<br />\n* k* •<br />\npage.<br />\nside<br />\nBeing close to the test tubes of the laboratories, the of a sincere compliment.<br />\nyou can see through, e.g. a key<br />\nTile jamboree in Annapolis this<br />\ninvestigations and researches, as well as the scholars<br />\nThe<br />\nreason for this attitude is not<br />\nWe recognize the opportunities of our position-of<br />\nhole.<br />\nthemselve, these papers are in an enviable position to making friends, of acquiring knowledge, of widening our past week end found two of\"our girls 20. An oboe is an American tramp. very evident. Certainly the Musical<br />\ngather fully and accurately news of a scientific and in- character. We also know the temptations to do the attending--one unbeknowns to the 21. A miracle is something that Club is more representative of stuit feel to have comtellectual advances.<br />\ndiametic opposite--of kissing everyone, of talking about other. How does<br />\nsomeone does that cannot be done. dent affairs since nearly one-eighth<br />\nfrom<br />\nas<br />\nFrom many angles a college newspaper is free. Usual- the weather, of yielding to the pressure of certain group, petition Hutch? - especially<br />\n22. An optimist is a man who looks of the student body are enrolled<br />\nyour Gracie Gillen.<br />\nly there are no worries about circulation; there are no of selfishly working for personal gain.<br />\nafter your eyes, a pessimist looks members. Perhaps the superiority<br />\n(?) of the Cotillion Board lies in the<br />\nadvertisers or private owners to dictate policy. In mpst<br />\nafter your feet.<br />\nAll these things we know. But we accept our position<br />\nfact that its membership is so careiscases there is little or no faculty supervision.<br />\nnext<br />\nthe<br />\nin<br />\nnowfor<br />\nsuch<br />\nof<br />\nall<br />\nThat's<br />\nwithout fear and with pride in the acceptance<br />\nbe a<br />\nsue we shall examine the Literature fully controlled, but this would<br />\nAn editor who seeks to imitate great metropolitan an honor and privilege.<br />\nof<br />\nion<br />\nexcuse.<br />\npour<br />\ninterpretat<br />\nthe<br />\nin<br />\nerror<br />\nserious<br />\nand Arts.<br />\ndailies is making a<br />\nB.H.<br />\nWhy should this attitude prevail?<br />\nhis duties. To a particular audience in a particular way,<br />\nCouldn't there be more cooperation<br />\na college newspaper fulfills its real functions.<br />\nThis week In regard to education:<br />\nTo the nine men honored by election into the BarnThe amount of money required to<br />\nThe oldest university still in exist- among campus activities instead of<br />\nBut what is undoubtedly more interesting from our<br />\nstormer Club, we extend our sincere congratulations. teach a pupil in the elementary ence is the University of Bologna, in so much throat-cutting? Shouldn't<br />\ntonewspaper<br />\ncollege<br />\nthe<br />\nof<br />\nn<br />\ncompariso<br />\na<br />\nis<br />\nviewpont<br />\nIn every case these new members represent two or more grades has been estimated at $37.12 Italy. Founded in the 11th century. the Student Activities Council with<br />\nday with the one of yesteryear.<br />\nyears of faithful and valuable service to Hopkins dram- for one year. For public high school Univiresity of Paris is next. Harvard its power and influence bring about<br />\npleasing<br />\nIn make-up, the type is more modern, more<br />\natics. Election was a fitting reward.<br />\nagreement and cooperation instead of<br />\nit is $145.25 per year.<br />\nis the oldest here.<br />\nto the eye, and perhaps more flashy. As a whole the<br />\nwith a minimum of fraconducted<br />\nwere<br />\nelections<br />\nThe<br />\ndiscord?<br />\nnext<br />\nfor<br />\ntopic<br />\nbe<br />\nthe<br />\nwill<br />\nis<br />\nEtiquette<br />\nThe smallest college in America<br />\nnews stories are written in a more journalistically maternity or group politics-in a manner which praised<br />\nAn Observer<br />\nB.H.<br />\nIt<br />\na.<br />\nof<br />\nn<br />\nPhiladelphi<br />\nweek.<br />\nexaminatio<br />\nin<br />\nan<br />\nCollege<br />\nall,<br />\nof<br />\nDropsie<br />\nture style. And most important<br />\nin their desire to set up<br />\nrs'<br />\nsincerity<br />\nBarnstorme<br />\nthe<br />\nis co-educational and has 23 students<br />\neditorials will show 'that problems involving not only<br />\nhigher standards for the organization. As long as this<br />\nand 6 teachers.<br />\nthe campus but the world, in so far as the students are<br />\nis kept up there will be fire and spirit in the enthusiasm<br />\nThe first normal school in the world<br />\ndirectly or indirectly affected, are treated. There is of workers on the production, acting and business staff.<br />\nwas established in Vermont.<br />\nno attempt to evade these huge, pressing questions.<br />\nCongratulations, Jim Morrow, Bud Mehling, Joe SamA foreigner is not allowed to enter<br />\nEditorials tackle these important issues openly and<br />\nDanny Gidinsky, Milt Saul, Dave Halle, Butch<br />\nowitch,<br />\nthe U. S. Military Academy at West<br />\ncourageously. Observe most of the college publications<br />\nMcShane, Maury Lazarus, Red Glantz. Why not show<br />\nPoint unless a special act of Congress<br />\ntoday, and you will notice intelligent and provocative<br />\nyou<br />\nare real Barnstormers by urging and supporting a<br />\nFrank<br />\nGlenn<br />\nthe<br />\nNYA,<br />\nprovides for the entrance. Same true<br />\nwar,<br />\non<br />\nopinions<br />\nand<br />\ncomments<br />\nsecond production this year?<br />\nfor Navy.<br />\ncase, the Jerome Davis case, and others.<br />\nHarvard College is a University.<br />\nAs Dr. J. Edgar Park, president of Wheaton Colliege,<br />\nA professional player may coach a<br />\npapers<br />\ncollege<br />\nthe<br />\ncompare<br />\nto<br />\nonly<br />\nhas said: \"One has<br />\nteam in any sport.<br />\ncollege<br />\nAnyone who has is acquainted with the responsibiliof the past with those of today to become convinced that<br />\nWest Point's establishment<br />\nSince<br />\nexact,<br />\nmore<br />\nsubtle,<br />\nbut<br />\nhelp<br />\nmore<br />\nties, duties, and work of an editor cannot<br />\nthe intellectual processes are<br />\nabout 55% of the entrants<br />\n1794,<br />\nin<br />\nmore thoroughgoing than yesterday. It is not merely feel a bit of sympathy if not appreciation for one who<br />\ngraduated.<br />\nbeen<br />\nhave<br />\nmind<br />\nthe<br />\n,<br />\nhas served in this capacity.<br />\na difference in fashion or method of expression<br />\ntotal gift toward the Johns<br />\nThe<br />\nthat<br />\nNow<br />\nbe.<br />\nto<br />\ngave<br />\nused<br />\nHe<br />\nr.<br />\nit<br />\nour<br />\nthan<br />\nwith<br />\ndeparting<br />\npredecesso<br />\nfeel<br />\ntoday<br />\nwe<br />\nmore<br />\nSo<br />\nis being used<br />\nHopkins University and the Medical<br />\nis a very dangerous thing to do. Just think of what this a lot for the NEWS-LETTER and deserves praise for his<br />\nwas more than $7,000,000.<br />\nSchool<br />\nover<br />\nall<br />\nthinking<br />\nthe<br />\ned<br />\nHe<br />\nhas<br />\npeople<br />\npaper.<br />\nnad<br />\nthis<br />\nadminister<br />\nwith<br />\nlong service<br />\ncountry would be if you<br />\nhas the largest endowHarvard<br />\nrunning of the paper for almost a year. That the<br />\nthe place .<br />\nU. S. Followed by Columthe<br />\nin<br />\nment<br />\ngood<br />\ncondition<br />\nin<br />\nand<br />\nPerhaps the most parallel counterpart is the cor- NEws-LETTER appeared regularly<br />\nand Leland StanChicago<br />\nYale,<br />\nbia,<br />\nWe will not pass judgment<br />\nresponding change in the attitude of the student to the is for the campus to judge.<br />\nJohns Hopkins,<br />\nCornell,<br />\nJr.,<br />\nford,<br />\njudge<br />\na drunken man cannot<br />\nproblems around him. Whereas formerly there were for the same reason that<br />\nCarnegie and Princeton.<br />\nwhiskey.<br />\norganizabut few individuals and perhaps still fewer<br />\nThe youngest student to enter an<br />\nBut Bill Diamond worked and served in what is pertions who were actively engaged in the discussion of and<br />\ncollege was Moses FinkelAmerican<br />\nThe<br />\ncampus.<br />\nof<br />\nthe<br />\nposition<br />\nactivity over current issues and questions, today the haps the most responsible<br />\n-hence won't run dry<br />\nN. Y., who entered<br />\nof<br />\nSyracuse,<br />\nstein<br />\nis grateful for his service and says: Goodbye and<br />\nstudent is alive to the currents of events to which he is staff<br />\nin classes or exams<br />\nthe<br />\nat<br />\nthe University of Syracuse<br />\nsubjected. He feels keenly important social, economic, good luck!<br />\nYes, thousands of students start<br />\n11.<br />\nof<br />\nage<br />\nto rate hier when they replace<br />\nand political issues. Group discussions on war, campus<br />\nEnglish universities give five to<br />\ntheir old 'blind-barrel\" pens with<br />\nRennaisthe<br />\nto<br />\nevidence<br />\ngive<br />\n-all<br />\nstrike, mass projects<br />\nsix months of the year to vacation.<br />\nthis new Parker Vacumatie.<br />\nsance.<br />\nThis is because it is people who<br />\nGallaudet College in Washington,<br />\nAs is obvious from the reading of a dormitory stuare capable of rating high who go<br />\nWe may be presenting an ideal picture of college dent's letter on the front page, a serious situation is ex- D. C., is said to be the only institution<br />\nfor this Pen in a big way, and benewspapers and college students; but we firmly believe istent in the living-place of over one hundred and fifty of higher education in the world<br />\ncause it is this kind of Pen-and<br />\nfrom our own observation and study, that there is plenty Hopkins students. However, remember it is but one which is devoted exclusively to the<br />\nonly this kind-that can bring out<br />\nthe best that is in them.<br />\nof evidence to support such a description.<br />\ntook<br />\ndeaf.<br />\nwho<br />\nside of the story. The University officials<br />\nIts Scratch-Proof Point of PlatiIt cost the U. S. government $10,alleged action against alleged damages have yet to exnum and Solid Gold writes like a<br />\n000 for four years to put a cadet thru<br />\nzephyr. Unlike pens that hide the<br />\nplain their procedure.<br />\nink within the barrel,this laminated<br />\nThis includes overhead<br />\nPoint.<br />\nWest<br />\ninvestigathorough<br />\na<br />\nER<br />\nis<br />\nThe<br />\nconducting<br />\nNEWS-LETT<br />\nPearl Beauty lets you SEE Days<br />\nThe situation of the newspaper on the Hopkins campus<br />\ntion and will take a more positive and active stand on expenses. The approximate cost of<br />\nAhead when it's running low. When<br />\navailable<br />\nown<br />\nour<br />\nuse<br />\nmust<br />\ntoo,<br />\nWe,<br />\none.<br />\npeculiar<br />\na<br />\nis<br />\nthis problem. Although journalistic principles obligated Just maintaining and education a<br />\nheld to the light it shows the ENin<br />\nthose<br />\n(besides<br />\nmaterials, analyze our own problems<br />\nTIRE Ink Supply-holds 102%<br />\nthe four years is $6,253.84.<br />\nfor<br />\ncadet<br />\na<br />\ndorfrom<br />\nence<br />\ncorrespond<br />\nfront-page<br />\nthe<br />\nus<br />\nto<br />\nprint<br />\nand<br />\nMore Ink than old-style.<br />\ncommon with all students), cover our own campus,<br />\nHarvard only allows 1,000 students<br />\nmitory residence, the lack of sufficient information comIt's the pen that received more<br />\nfollow our own traditions and ideals.<br />\nin its freshman classes.<br />\npels us to withhold comment until next issue.<br />\nthan any other TWO makes<br />\nvotes<br />\ninits<br />\nSince<br />\nThe Hopkins tradition is a liberal one.<br />\nof Pens COMBINED when 30 ColAlf<br />\nlege Papers asked 4,699 students<br />\nception, each succeeding generation of scholars, each<br />\nwas<br />\nIt<br />\nown?\"<br />\nyou<br />\ndo<br />\npen<br />\n\"Which<br />\nsucceeding staff of faculty members, each succeeding<br />\nawarded -by the All-America Board<br />\npresident-- all have voiced as the ideal of the University<br />\nof Football to 90 nominees for the<br />\nAll-America Team of 1936.<br />\nthe relentless, tireless search for ths truth: the living<br />\nGo at once to any good store sellout of our motto Veritas Vos Liberabit.<br />\ning pens and try this revolutionary<br />\na<br />\nare<br />\nwe<br />\n;<br />\nWell, we are a newspaper of that University<br />\ninvention. Identify the genuine<br />\nand<br />\nParker Vacumatic by this smart<br />\npublication which accepts in full the traditions<br />\nARROW Clip,-this holds this Pen<br />\nwayown<br />\nour<br />\nIn<br />\nown.<br />\nits<br />\nas<br />\nHopkins<br />\nthe<br />\nof<br />\nideals<br />\nand SAFE in the pocket. The<br />\nlow<br />\nthe<br />\naims<br />\nlofty<br />\nour<br />\nas<br />\njournalistically--we shall set up<br />\njJCUIVI1TIre:-)<br />\na)---17<br />\nParker Pen Co., Janesville, Wis.<br />\nGUARANTFEU FAErHANKALIY PiRRET,<br />\ngoals set up by our founder.<br />\nWrites<br />\nIt<br />\nAs<br />\nPen<br />\nYour<br />\nCleans<br />\n1,<br />\n,<br />\nfi,mos, $5)<br />\n3222<br />\nGet Parker Quick, the new quick-drying<br />\n750<br />\nWe find much of the University spirit of freedom reDissolves sediment left by pen-clogging<br />\nink.<br />\nr<br />\nill°<br />\nOur<br />\ninks. Makes your pen-a Parker or any<br />\nflected in the attitude towards the NEWS-LETTER.<br />\nother-work like a charm. 15c and 25c.<br />\nfaculty<br />\nof<br />\nn<br />\nsupervisio<br />\nany<br />\nfrom<br />\npaper is entirely free<br />\nper year<br /><br />\n$2.00<br />\n$2.50<br /><br />\nPlace Of The Hopkins Editor<br /><br />\nPlace Of The College Paper<br /><br />\nSPEAKING OF<br />\nEDUCATION<br /><br />\nA Deserved Honor<br /><br />\nTo Star in Your School Work<br /><br />\nBACK YOUR BRAINS WITH THE<br /><br />\nALL-STAR PEN<br /><br />\nSo Long, Bill<br /><br />\nIt Lets You SEE<br />\nWhen to Refill<br /><br />\nExplanation Needed<br /><br />\nj,021.<br /><br />\n/dee9)<br /><br />\nPlace Of The Hopkins Paper<br /><br />\n•<br /><br />\n-•••••••••<br /><br />\n•••••••••11..<br /><br />\n•<br />\n• 111..11.1.,11..<br /><br />\n.or<br /><br />\n*<br /><br />\ny<br /><br />\nKIBL ER'S<br /><br />\nJEWELERS and OPTICIANS<br /><br />\nar e.r<br />\n)<br />\n1<br /><br />\nPEN and PE] CIL SETS<br /><br />\nGreenmc unt Avenue<br />\n........<br /><br />\n:e<br />\n1.<br /><br />\nIII<br /><br />\nrAt<br /><br />\nOV,<br /><br />\n•••••••••<br /><br />\n•<br /><br />\n.50<br /><br />\n.1<br /><br />\ntiro<br />\nfin<br />\nnil<br />\nGr<br />\ngr<br />\nar<br />\nhex<br />\nLe<br />\nthi<br /><br />\nwi]<br />\nof<br />\nbo(<br />\n34<br />\nwa<br /><br />\nlea<br />\nane<br />\ntin<br />\nthe<br />\nCOL<br /><br />\nprc<br />\nthc<br />\nmum<br />\nTh:<br />\nflui<br />\nest<br />\nthe<br />\non(<br />\nact<br /><br />\nP0I<br />\n1'01J<br /><br />\n1101<br /><br />\n23<br />\nJa3<br />\nfac<br />\ndui<br />\n1<br />\nZh(<br />\nfro<br /><br />\nPoi<br />\nchi<br />\nrat<br />\nput<br />\nthe<br />\nea<br /><br />\npa:<br /><br />\nwe<br />\nsta<br />\ncul<br />\ngis<br />\nthe<br /><br />\n(the<br />\non<br />\nset<br />\nwa<br />\nthi<br />\n'Ph<br />\nthi<br />\nye.]<br />\nnei<br />\nI 8-<br /><br />\nSC(<br /><br />\nwe<br /><br />\ntrie<br />\nas<br />\nthe<br />\nSi(<br />\nco(<br />\nInc<br />\na<br />\nvir<br /><br />\n1M:<br /><br />\nen<br /><br />\nat<br />\ntir<br />\npe<br />\ninc<br />\nini<br />\nba<br />\nsti<br />\nth,<br /><br />\nth<br />\nba<br />\nph<br /><br />\nVII<br /><br />\nma<br />\nlet<br />\nba<br /><br />\na<br />\nth<br /><br />\nPC<br /><br />\nre<br />\nste<br />\nhc<br /><br />\nro<br /><br />\nWi<br /><br />\nHOMEWOOD, BALTI2vIORE, FEBRUARY 16, 1937<br /><br />\nHopkins Cagers THE BOX SCORE Swimmers Suffer First Defeat Sports Calendar Victory Streak<br />\nAt Hands of Lehigh Mermen<br />\nof Jay Gunners<br />\nTrounce Loyola<br />\nBrown And White Natators Capture Five Firsts; Weiner<br />\nAt Evergreen<br />\nBrought to End<br />\nTakes Backstroke; Radnor First In 440 Free-Style;<br />\nThe line-up:<br />\nHOPKINS<br />\nG.<br />\nSiegel, f.<br />\n2<br />\nMelvin, f.<br />\n6<br />\nCross, c.<br />\n1<br />\nRasin, g.<br />\n4<br />\nZheutlin, g.<br />\n4<br /><br />\nst<br /><br />\nCC<br /><br />\nRecord First Win In Three<br />\nSeasons Over Local<br />\nRival<br />\nTURBULENT<br /><br />\ng<br /><br />\nrs,<br />\nub<br /><br />\nas<br />\n;ens<br />\nes.<br />\nal<br />\nhe<br />\nal<br />\nir<br />\nOR<br /><br />\nhe<br />\nidar<br />\nreus,<br />\nin-<br /><br />\ntilrehis<br />\nruua<br />\nert<br />\nOH<br /><br />\nA<br />\ncesly<br />\nutnot<br />\ncal<br />\ntohtit<br />\nas<br /><br />\nthe<br />\nree a<br /><br />\n?<br />\ntion<br />\n. of<br /><br />\nan't<br />\nvith<br />\nout<br />\nof<br /><br />\nTotals<br /><br />\n75232-<br /><br />\nF.<br />\n9<br />\n6<br />\n3<br />\n3<br />\n5<br /><br />\nT.<br />\n11<br />\n17<br />\n4<br />\n11<br />\n10<br /><br />\n17 19-26<br />\nLOYOLA<br />\nG.<br />\nF.<br />\nKeech, f.<br />\n1 0- 0<br />\nDevin, f.<br />\n0 0- 1<br />\nKelly, f.<br />\n3 4- 8<br />\nCummings, c.<br />\n3 0- 2<br />\nWayson, g.<br />\n4 0- 0<br />\nBremer, g.<br />\n0 1- 1<br />\nCarney, g.<br />\n7 3- 3<br /><br />\nBATTLE<br /><br />\nJays Lead All The Way In<br />\nFree Scoring<br />\nTilt<br />\nBy ARTIE KATZ<br />\nThe Johns Hopkins hoopers turned<br />\nthe tables on Loyola College for the<br />\nfirst time in three years last Saturday<br />\nnight when they triumphed over the<br />\nGreyhounds by a 53-44 score at Evergreen. Although both aggregations<br />\nare mathematically out of the race for<br />\nhonors in the Maryland Collegiate<br />\nLeague, the affair represented more<br />\nthan the usual attempt of one team to<br />\nwin a basketball game at the expense<br />\nof another. Loyola has been the bugaboo of the Blue Jays since the 193334 hardwood season, and their defeat<br />\nwas thus doubly significant.<br />\nTake 7 Point Lead<br />\nThe Malloneemen took a 7 point<br />\nlead in the first three minutes of play,<br />\nand were never as much as tied<br />\nthroughout the contest. At one stage,<br />\nthe home team was behind by 1<br />\ncounter, at another by 14. The visitors<br />\nprovided the margin of victory in<br />\nthe first half, putting away 34<br />\nmarkers to the 21 by the Loyolans.<br />\nThis canto was unusually fast, rough,<br />\nhard on the players, but very interesting to the spectators who jammed<br />\nthe Evergreen gymnasium. The second inning was slower, but was characterized by vicious guarding, long<br />\npop-ups, and more than the ordinary<br />\nrough and tumble element. The Greyhounds forged ahead slightly, to score<br />\n23 points to the 19 netted by the<br />\nJays. A noteworthy feature was the<br />\nfact that 41 foul shots were taken<br />\nduring the game.<br />\nHopkins scored first with Harold<br />\nZheutlin tossing the sphere on a pass<br />\nfrom Bing Cross. Melvin added 5<br />\npoints, to set the total at 7-0. An exchange of long shots, and a shooting<br />\nrampage by Carney, All-State guard,<br />\nput the counters at 13-12. Hopkins<br />\nthen went to town, as it were, scoring<br />\neasily on quick breaks and excellent<br />\npass work. Melvin's overhead shots<br />\nwere particularly effective in this instance, as they are exceedingly difficult to guard against. Dimmy Traggis substituted for Mel shortly before<br />\nthe first half ended.<br />\nThe last period saw the attempt of<br />\na determined home team to both stem<br />\nthe Hopkins tide of shots, and do some<br />\non their own account, but the score<br />\nset-up in the first part of the game<br />\nwas too much of a handicap. It was at<br />\nthis point that the going went rough.<br />\nThere were six men on the court with<br />\nthree persoAals, all of whom were<br />\nvaluable men. Loyola hopes went high<br />\nnear the end of the battle, trailing by<br />\n48-40, but field goals by I:W.3in and<br />\n,Siegel put the game on ice. The final<br /><br />\nTotals<br /><br />\n18<br /><br />\n53<br />\nT.<br />\n2<br />\n0<br />\n10<br />\n8<br />\n1<br />\n17<br /><br />\n8-15 44<br /><br />\nJay Handball Team<br />\nTrims Virginia 6-0<br />\nMilberg, Pasternak, Alperstein, Finkelstein, Brilliant<br />\nAgainst Cavaliers<br />\nOn Friday night the Blue Jay handbailers handed the University of Virginia a six to nothing troucing in a<br />\nmatch held at the gym. The outstanding victory was that recorded by<br />\nRichard Pasternak who defeated his<br />\nopponent by the large scores of 15-2,<br />\n15-0. The closest match of the meet<br />\nwas that between Nat Finklestein<br />\nand Arty Nepoff, in which the ultimate victor was extended before winning 11-15, 15-11, 15-5.<br />\nIn other matches Iry Milberg downed Herb Linne 15-9, 15-13, Milt Alperstein defeated Fred Ferguson 15-10,<br />\n11-15, 15-3, and in the doubles Milberg<br />\nand Alperstein paired to beat Linne<br />\nand'Eckstein, and Alperstein and Pasternak combined to conquer Ferguson<br />\nand Nepoff.<br />\nThe summary:<br />\nSINGLES<br />\nIrving Milberg, Hopkins, defeated<br />\ndefeaed Linne and Eckstein, 15-9, 15Richard Pasternak, Hopkins, defeated I. Eckstein, 15-2, 15,0.<br />\nNat Finkelstein, Hopkins, defeated<br />\nArty Nepoff, 11-15, 15-11, 15-5.<br />\nMilt Alperstein, Hopkins, defeated<br />\ndefeated Ferguson and Nepoff, 15-3,<br />\nDOUBLES<br />\nMilberg and Alperstein, Hopkins,<br />\ndefeated Linne and Eckstein, 15,9, 153.<br />\nAlperstein and Pasternak, Hopkins,<br />\ndefeated Ferguson and Nenoff, 15,3,<br />\n15-8.<br /><br />\nThe only two Bluejay substitutions,<br />\nDimmy Traggis and the Chestertown<br />\nplayboy, Dicky Myra Green, showed<br />\nmentors Mallonee and Twardowicz<br />\nthat they can be used to plug the gap<br />\nwhen the Big Five starts to slow up.<br />\nAmong other things . . . Hopkins<br />\nJ.V. over that of the home team by a<br />\n14-10 score . . . Loyola scrubs didn't<br />\nscore in the second half ... In the varsity game . . . the quick breaks . . .<br />\nRasin to Siegel . . . Zheutlin to Cross<br />\n. . . Cross to Zheutlin . . the number<br />\nof fouls taken . . . Melvin's overhead<br />\nshots . . . Siegel to Cross to Melvin to<br />\nscore was 53-44.<br />\nZheutlin who scored on a fast getaway . . . Rasin's beautiful long shots<br />\nWorked As Unit<br />\nAny bouquets tossed at the Home- Harold Zheutlin's batting average for<br />\nwood five are to be shared equally by the evening, 4 field goals, of 7 atWein. In this game, they functioned tempted . . .<br />\nas a unit, each caring for his part of<br />\nthe work, and doing it well. Herby<br />\nSiegel showed his executive ability in<br />\ncoordinating the plays, getting the<br />\nmost from his teammates, and playing<br />\na swell all-around game. Norm Melvin, his high-scoring fellow forward,<br />\nrose to new heights in this role of<br />\ncrafty shot at all angles. Bing Cross,<br />\nat the pivot, showed he is almost entirely recovered from his injury in his<br />\nperformance at Evergreen. Getting<br />\nmore than his due of the taps, feeding continually, and always under the<br />\nbasket for rebounds, Bing demonstrated with a vengeance his value to<br /><br />\nBasketball-Johns Hopkins vs. Western Maryland College, Thursday,<br />\n8.30 at Homewood.<br /><br />\nstyle in which he tied the pool record<br /><br />\nSwimming-Johns Hopkins vs. University of Virginia, Friday, at Baltiniore.<br />\nWrestling-Johns Hopkins vs. Haverford College, Friday, at Haverford.<br />\nRichmond, Va. next Friday ev„ening,<br />\nJohns Hopkins vs. Ursinus College,<br />\nthe 19th.<br />\nSaturday, at Ursinus.<br />\nThe results:<br />\n1290-1284<br />\nFencing-Johns Hopkins vs. Army,<br />\n40-Yard Free Style-Won by Adam,<br />\nSaturday at West Point.<br />\nLehigh; second, Swenson, Lehigh;<br />\n. The Johns Hopkins marksmen went<br />\nthird, Scheer, Johns Hopkins. Time,<br />\ndown to defeat at the hands of the<br />\n19 1-5s.<br />\nWestern Maryland College rifle team<br />\n220-Yard Free Style- -Won by Washlast Saturday afternoon at the Westbaugh, Lehigh; second, Howe, Leminster team's range. The score was<br />\nhigh; third, Adler, Johns Hopkins.<br /><br />\nof 19 1-5 seconds.<br /><br />\nTime, 2m. 40s.<br /><br />\nJacobs Tops Divers<br />\nThe Blue Jay swimmers met their<br />\nfirst defeat of the season at the hands<br />\nof the Lehigh mermen last Saturday<br />\nevening in the Baltimore City College<br />\ntank, to the tune of 48 to 27. Five of<br />\nthe nine events were taken by Lehigh<br />\n-Adam captured two, the 100 yard<br />\nfree style and also the 40 yard free<br /><br />\nWestern Maryland Sharpshooters Top Jays By<br />\nCount<br /><br />\nSenior Mechanics<br />\nDown N.J.All-Stars<br /><br />\n1,290 to 1,284,<br /><br />\nThe New Jersey All-Stars went<br />\ndown to an unexpected defeat at the<br />\nhands of the Senior Mechanics by a<br />\nscore of 15-13 in a closely played<br />\n'baseketball game last Wednesday.<br />\nWiseman and Dickler of the Senior<br />\nJohns Hopkins, 63.5; second, Shoe- Mechanics led the scoring with a total<br />\nmaker, Lehigh, 62.6: third, Parson, of five points each with Stollberg of<br />\nLehigh, 61.7.<br />\nthe Senior Mechanics close behind<br />\n200-Yard Breastroke-Won by Ja- with four points.<br />\ncobi, Lehigh; second, Henning, LeIn the second game Wednesday afhigh; third, Blucher, Johns Hopkins. ternoon the Goldman A. C. flashed a<br />\nTime, 2m. 47 1-5s.<br />\npowerful attack to win by a score of<br />\n440-Yard Free Style--Won by Rad- 27-17. The outstanding players and<br />\nnor, Johns Hopkins; second, Washa- high scorers of the encounter were<br />\nbaugh, Lehigh; third, Adler, Johns Sonneborn and Jacobson of the GoldHopkins. Time, 6m. 3 4-5s.<br />\nman A. C. with each scoring four field<br />\n150-Yard<br />\nBackstroke-Won<br />\nby goals. For the opposing team, Nealey<br />\nWeiner, Johns Hopkins; second, Mc- was prominent, with a total of seven<br />\nMillan, Lehigh; third, Hooker, Lehigh. points.<br />\nTime, lm. 57 2-5s.<br />\nOn Thursday the Engineer \"A\"<br />\n100-Yard Free Style- Won by<br />\nteam defeated the Whirlwinds by a<br />\nAdam, Lehigh; second, Howe, Lehigh; score of 10-6. Holman, of the Engithird, Hill, Johns Hopkins. Time, 58 neer \"A\" led the scoring with a total<br />\n3-5s.<br />\nof six points. This game was a loosely<br /><br />\n240-Yard Medley Relay--Won by<br />\nWinning first places for Hopkins<br />\nLehigh (McMillan, Jacobi, Adam);<br />\nwere Captain Danny Weiner in the<br />\nsecond, Johns Hopkins (Weiner,<br />\nbackstroke, Zoel Radnor, in the 440 Blucher,<br />\nRadnor). Time, 2m. 40 3-5s.<br />\nyard free style, Harold Jacobs, diving,<br />\nFancy Diving-Won by Jacobs,<br />\nand the 320 yard relay team, comprised of Hill, Frey, Adler and Radnor.<br />\nThe<br /><br />\nunexpected<br /><br />\nstrength<br /><br />\nof the<br /><br />\nBrown and White visitors was mutually surprising to both the Hopkins<br />\nand Lehigh rooters. The score is in no<br />\nway indicative of the closeness of the<br />\nmeet, as first places were lost by the<br />\nsmallest of margins. Great credit is<br />\ndue to Jacobs, who came out in front<br />\nwith the diving honors, despite the<br />\nfact that he was confronted by some<br />\nof the keenest competition of the<br />\nseason.<br />\nU. Of Va. Next Opponent<br />\nThe next opponent of the Black and<br />\nBlue natators will be the University<br />\nof Virginia Who are to be met at<br /><br />\nJ.V.CourtmenRally<br />\nTo Defeat Loyola<br /><br />\n320-Yard Relay-Won by Johns<br />\nHopkins (Hill, Frey, Adler, Radnor);<br />\nsecond, Lehigh (Swenson, Henning,<br />\nPatterson, Knowland). Time, 3m. 14<br />\n4-5s.<br /><br />\nplayed affair with the passing a little<br />\nragged and field goals limited.<br />\nThe game between the Engineer<br />\n\"B\" team and the Newcomers was<br />\npostponed.<br /><br />\nThis defeat was the first the Blue<br />\nJay gunners suffered<br /><br />\nin<br /><br />\nthe four<br /><br />\nmeets scheduled so far this season;<br />\nwhile this win was the second for<br />\nthe Western Maryland Terrors.<br />\nGuild, of the Black and Blue array,<br />\nwas the outstanding performer of the<br />\nshooting meet with a total of 273 for<br />\nthe three events. Not far behind the<br />\nHopkins star, was Armacost of the<br />\nvictors with a total score of 271.<br />\nThe scores:<br />\nWESTERN MARYLAND<br />\nA rmacost<br /><br />\n99<br /><br />\n95<br /><br />\nMeyers<br /><br />\n77-271<br /><br />\n99<br /><br />\n83 83-265<br /><br />\nParker<br /><br />\n99<br /><br />\n85<br /><br />\n77-261<br /><br />\nHoffa<br /><br />\n91<br /><br />\n88<br /><br />\n71-250<br /><br />\nLurnan<br /><br />\n94<br /><br />\n85 64-243<br /><br />\nJOHNS HOPKINS<br />\nGuild<br /><br />\n98<br /><br />\nBrown<br /><br />\n97<br /><br />\n90<br /><br />\nLindenmayer<br /><br />\n95<br /><br />\n89<br /><br />\n70-254<br /><br />\nRossberg<br /><br />\n96<br /><br />\n82<br /><br />\n74--252<br /><br />\n.96<br /><br />\n87<br /><br />\n59-242<br /><br />\nLeber<br /><br />\n93 82-273<br />\n76-263<br /><br />\n•••••<br /><br />\nHold Evergreen Outfit Scoreless For -Entire<br />\nSecond Half<br />\nA rally in the second half plus an<br />\nalmost unbelievable bit of defensive<br />\nwork gave the Hopkins Jay Vee<br />\nquintet a 14-10 victory over the Loyola Jay Vees. For a complete half the<br />\nEvergreen agre,gation wa.s held without a single point, while the Homewood outfit garnered 8 counters and a<br />\nwin. Those who saw action for the<br />\nvictorious squad were Day, Reynolds,<br />\nStevens, Wetzler, Royster, Naylor,<br />\nWillen, Baum, Silberman, Kahl, and<br />\nBeeler.<br />\nThe line-up:<br />\nLOYOLA<br />\nG. F. T.<br />\nLoden, f.<br />\n0 0 0<br />\nLazzatti, f.<br />\n0 0 0<br />\nMalloy, f.<br />\n2 0 4<br />\nMantz, c.<br />\n0 3 3<br />\nKernan, g<br />\n0 0 0<br />\nKnell, g.<br />\n1 0 2<br />\n-Totals<br />\n3 4 10<br />\nHOPKINS<br />\nG. F. T.<br />\n.1 1 3<br />\nDay, f.<br />\nReynolds, f.<br />\n1 0 2<br />\nStevens, f.<br />\n1 0 2<br />\nWetzler, c.<br />\n1 0 2<br />\nRoyster, g.<br />\n_ 1 0 2<br />\n1 1 3<br />\nNaylor, g.<br />\nTotals<br />\nLoyola<br />\nHopkins<br /><br />\n6 2 14<br />\n10 0-10<br />\n6 8-14<br /><br />\n..../.......1.-.1••••••••••<br />\n,<br />\n•<br />\n,<br />\n••••••••••••••••,.............<br />\n•<br /><br />\nTHE MUSICAL CLUB<br />\npresents<br /><br />\nthe team.<br />\nCarl Rasin and Harold Zheutlin were<br />\nthe boys whose knowledge of basketball tactics and ability to score in<br />\npinches played so large a part in the<br />\nvictory. Their shots, few in number,<br />\nrang true well nigh every time they<br />\nlet fly at the basket. Zheutlin's underbasket shooting was sweet to watch,<br />\nhis passes were accurate, and he was<br />\na constant threat every time he held<br />\nthe ball. Rasin was all over the court,<br />\npopping in long ones ,following up on<br />\nrebounds. His defensive work again<br />\nstood him in good stead for All-State<br />\nhonors. He seemed to have an inexhaustable amount of energy in his<br />\nrompings about the floor, a fact that<br />\nworried his wearied man no little.<br /><br />\nThe ANNUAL HOME CONCERT<br />\n-IV,<br />\n.<br />\n.0\".<br /><br />\nMaryland Casualty<br /><br />\nI<br /><br />\nTalbott Motor Co.<br />\nINCORPORATED<br /><br />\nSales<br /><br />\nFEBRUARY 27<br /><br />\nFORD<br /><br />\nService<br /><br />\nRenewed And Guaranteed Used Cars<br /><br />\n3421-3429 Greenmount Avenue<br /><br />\nDancing Afterwards<br /><br />\nPhone, Chesapeake 5226<br />\n•<br />\n•<br />\n.0,11,11. 11.<br /><br />\n•••••<br />\n•<br /><br />\nHOME'WOOD, BALTIMORE,<br /><br />\n4<br /><br />\nFEBRUARY 16, 1937<br /><br />\nMann Champions Blue Jays Look Madariaga Scores<br />\nJ. H. U. Press Broadus Mitchell Seminar<br />\nTo Tour Europe In Summer A Free Puerto Rico To Third Place Menace To Peace<br />\nReports Works<br />\nEight Countries On Itinerary; Russia And Cooperative In Latrobe Speech<br />\nPublished in 36 Movements To Receive Larger Share Of Attention Bases Argument On Econo- In Md. League<br />\nIn Twelve Week Study<br /><br />\nRanked Tenth Among College Presses Of The<br />\nWorld<br /><br />\nAnyone in the habit of glancing at amine the \"coops\" in Denmark and<br />\nthe bulletin boards can not have Sweden and will subsequently learn<br /><br />\nfailed to notice an orange and black<br />\nposter announcing \"The Broadus<br />\nMitchell Seminar on Economic Life<br />\n37<br />\nin Europe.\" Reading further, one sees<br />\nthat the Seminar is a \"travel-study<br />\nproject\" to be held next summer in<br />\neight countries of Europe. A twelve<br />\n'weeks tour to investigate the actual<br />\npractice of cooperative movements of<br />\nAccording to custom, the Johns various kinds. It is open to all interested.<br />\nHopkins Press announces its total of<br />\nDr. Mitchell, Director of the Semipublishing activities for the past year<br />\nnar and associate professor of politi(1936) 'as compared with the score<br />\ncal economy at The Hopkins declared<br />\nfor other years at this time. It is as that more time would be devoted to<br />\nfollows:<br />\na study of Soviet Russia than of any<br />\nother country, and Leningrad, MosCloth or boards:<br />\n1931 1932 1933 1934 1935 1936 cow, Kharkov, and Kiev will be all<br />\n17 visited. Mrs. Mitchell will accompany<br />\n23<br />\n16<br />\n31<br />\n21<br />\n19<br />\nher husband.<br />\nPaper covers:<br />\nPlans for the itinerary are near<br />\n19<br />\n14<br />\n18<br />\n11<br />\n20<br />\n15<br />\ncompletion; England, Denmark, SwePamphlets:<br />\n1 den, Finland, Russia, Austria, Switz3<br />\n11<br />\n11<br />\nerland, and France are to be toured<br />\nTotal titles:<br />\nin the order named; and discussions<br />\n37<br />\n43<br />\n34<br />\n45<br />\n52<br />\n45<br />\nand interviews with thinkers and<br />\nseventy-nine<br />\nwere<br />\nthere<br />\nIn addition<br />\nleaders in fields affecting present<br />\njournals issued.<br />\nEuropean economics and politics are<br />\nThe Hopkins Press is tenth-ranking being arranged. In Toynbee Hall,<br />\namong the best college presses in the London, two lectures by members of<br />\nthe London Labor<br />\nworld. In 1936 it showed a loss from Parliament and<br />\nSchools are already planned. These<br />\nthe rating of 1935, but the difference<br />\nwill deal with Trade Unionism and<br />\nis negligible.<br />\nthe British Labor Movement, which,<br />\nPrimary among the forthcoming Dr. Mitchell declares, has progressed<br />\npublications is the attempt of George a great deal farther in England than<br />\nBoas to devise a critical vocabulary in this country.<br />\nfor the various arts. This is entitled<br />\nFor several days students will exA Primer for Critics and is exactly<br />\nwhat its name implies. The Primer<br />\nopens with a preliminary chapter on<br />\nthe confusions which beset criticism.<br />\nThis lays the basis for the conservative part of the work. The second<br />\npart deals with the evidence which is<br />\nneeded for establishing various critical judgements and the third with<br />\nthe different schools of criticism. In<br />\nconclusion there is a short section on<br />\nthe authority of criticism and its limitations. This particular volume should<br />\nappeal directly to both students of<br />\nliterature, the fine arts, and philosophy, and to lovers of an analytical<br />\nstudy of ideas. Its price is $2.00.<br />\nSecond only to the Primer in significance is the book Edmund Spenser<br />\nby Dorothy F. Atkinson, Ph.D. This<br />\nbook is a biographical supplement to<br />\nother important works about Spencer.<br />\nIt attempts to till a need for an annotated bibliography by gathering all<br />\nthe Spenserciana available into one<br />\nvolume, and it compiles and organizes material about Spenser hitherto<br />\nomitted in his bibliographies. The<br />\nbook will be of assistance and importance to students as well as those<br />\nwho direct research. It is an up-todate volume on Spenser, and sells for<br /><br />\nPUBLISHED<br /><br />\nTITLES<br /><br />\nBook By Boas Leads List Of<br />\nFuture Press<br />\nPublications<br /><br />\nfrom Finnish experts how the Slav<br />\ncountry<br /><br />\nSenator<br /><br />\nat<br /><br />\nLarge<br /><br />\nLuis<br /><br />\nMunoz-<br /><br />\nmeets its financial obliga- Mann Puerto Rico spoke in Latrobe<br /><br />\ntions to the United States. Fascism' Hall, Thursday, February 11 on \"InGerman Nationalism will be dependence for Puerto Rico.\" Senator Munoz-Marin is an author and a<br />\nstudied through interviews with parpolitical figure of great magnitude in<br />\ntisans and observers in Geneva and Puerto Rico.<br />\nin Vienna.<br />\nHimself an ardent supporter of<br />\nand<br /><br />\nDr. I. V. Solins, a Columbia gradu-<br /><br />\nfirst<br />\nSenator<br />\nindependence, the<br />\nate and former educational director brought out the economic necessities<br />\nof Intournist, a Russian travel agency, for such an action as the granting of<br />\nindependence. At present four sugar<br />\nheads Edutravel, Inc., which in concompanies with refineries in Baltijunction with Dr. Mitchell, is spon- more, Boston, and New York control<br />\nsoring the Seminar. Those sailing on -more than one half of the sugar crop<br />\nthe party will leave New York July and have their plantations on the<br />\n24 on the Britannia and return Sep- best land, owning 60% of the mills.<br />\nAll the wealth secured from the sugar<br />\ntember 11. Further information condoes not remain in Puerto Rico, but<br />\ncerning the class accomodations and goes to America, thus draining Puerexpense will be included in a leaflet to Rico of Millions of dollars yearly.<br />\nHe then brought out the plight of the<br />\nto be published soon by Edutravel.<br />\nworkers—many earning less than<br />\n$100 a year -and the dependence of<br />\nthe island on sugar. Independence, he<br />\nclaimed, would enable Puerto Rico to<br />\nraise other crops and allow the farmers to obtain better land and own<br />\n(Continued from Page 1, Col. 2)<br />\ntheir own mills collectively.<br />\nDoes One,\" \"An Apple A Day,\" \"With<br />\nThe spender brought out the fact<br />\nPlenty of Money and You,\" \"I Was that Puerto Rico, would have no army<br />\nSaying to The Moon,\" \"I've Got You and would have a peaceful governUnder My Skin,\" \"So Do I,\" and ment. He blamed the presence of armies as the cause of revolts in Latin<br />\n\"Pennies From Heaven.\" Vocals by<br />\nAmerican Republics. Puerto Rico has<br />\nSkinney Ennis, Saxey Dowell, and no military traditions to preserve,<br />\nBob Allen are tastefully interspersed which is not the case in such countries as Mexico and Venezuela.<br />\nthroughout the proceedings.<br /><br />\nMary B. Shepherd<br />\nSponsors Cotillion<br /><br />\n$3.00.<br /><br />\nDormitory Resident<br />\nDisclaims Honor Oa<br />\nTen Dollar Fine<br /><br />\nMt. St. Mary's Has Clinched<br />\nChampionship, Says<br />\nCorrespondent<br />\nMt. St. Mary's has definitely<br />\nclinched the Maryland Intercollegiate<br />\nLeague championship. But, in the<br />\nbattle for the various \"also-ran\" positions, there remains enough competitive spirit to make the rest of the<br />\nleague contests interesting.<br />\nHaving successfully met Loyola's<br />\nattempt to drop them into the cellar,<br />\nthe Blue Jay's now have their eyes<br />\npeeled on the third place held by<br />\nWestern Maryland. A victory over<br />\nthe Green Terrors will move the Hopkins up to this immediate goal, giving<br />\nthem also a very slight chance of<br />\ndisplacing Washington from their almost certain second-spot.<br />\nThe Blue Jay quintet will have its<br />\nopportunity Thursday evening when<br />\nWestminster sends its hopefuls to<br />\nHomewood to encounter the Jays for<br />\nthe second time this season. Earlier in<br />\nthe year, in a game at Westminster,<br />\nthe Terrors downed the Hopkins by a<br />\n45-40 count. the Jays' desire to avenge<br />\nthis defeat and the Terrors' hope of<br />\nmaintaining their league standing<br />\nshould result in a keenly contested<br />\nstruggle.<br />\nIn this second meeting of the two<br />\nteams the Homewood club will be favored. The difference between the two<br />\nsquads in their first engagement was<br />\nStan Benjamin. But Benjamin has<br />\nelected to leave school. This leaves<br />\nUvanni as the Terrors' leading threat.<br />\nIf he is bottled up there should be<br />\nnothing but clear sailing for the Jays.<br /><br />\nHIPPODROME M<br />\nBAL ThifORE, MD.<br /><br />\n• ON STAGE •<br /><br />\nCized 73Zande<br />\nBo-mbsIzellorAz/<br /><br />\n.<br />\n4;<br /><br />\nAMERICA'S 6REATEST<br />\nALL-GIRL<br /><br />\nORCHESTRA<br />\n/N PERSON<br />\nlIZL<br /><br />\nUTTON<br />\nabJLt<br /><br />\nME LODE ARS<br />\nki RHYTHMIC REVUE<br />\n30•BROADWAY STARS<br />\nn ON SCREEN<br />\n*v.<br /><br />\n.kge TRACY<br />\n\"CRIMINAL<br />\nLAWYER...\"<br />\nTHE NEW<br /><br />\nMARCH OF TIME<br />\n9<br /><br />\n........<br /><br />\nHere.'s aroma<br />\n01 yoil<br />\n...a picture of Chesterfield<br />\ntobacco just as it conies out of<br />\nthe 1000 - pound wooden hogsheads after ageingfor three years.<br /><br />\n(Continued from Page 1, Col. 3)<br />\nthrowing missels.\" Much the same<br />\ngoes for many of our fellow residents<br />\nin A and B entries; several were in<br />\nbed when it happened; others were<br />\nout on dates. One fellow was at his<br />\nhome in Massachusetts with his parents at the same time that he was<br />\nhere (according to the letter) engaged in \"general rough housing\";<br />\nthat boy's father must have had the<br />\nsurprise of his life when he found that<br />\nhis son is twins. Mr. Benjamin Jones,<br />\nproctor and custodian of the Dormitory, also received a ten dollar fine-or \"assessment\"; he, too, is reluctant<br />\nto accept the honor.<br />\nIn fact, all the residents who have<br />\nbeen thus honored—and they comprise roost of the inhabitants of A and<br />\nB (around $170 having already been<br />\nassessed) - are showing themselves<br />\nadmirably modest. We are not unappreciative, not by any means. Anybody who heard the demonstrations in<br />\nthe dining hall Friday at dinner<br />\nwhenever Mr. Sauperwein --he signed<br />\nthe letters --- was mentioned, knows<br />\nhow deeply we appreciate the sudden<br />\nrecognition which has come to us.<br />\nBut our mate sense of justice cries<br />\nout for the redistribution of this<br />\nweath of honors in a fairer way, even<br />\nthough it means that most of us will<br /><br />\nIf you could be there when these hundreds of hogsheads are opened up<br />\n... if you could see this mild ripe<br />\ntobacco, prime and ready to be made<br />\ninto Chesterfield Cigarettes ...see the<br />\ngolden color of the leaf... and get a<br />\nwhiff of that delightful aroma... you'd<br />\nsay ...<br /><br />\n\"Delicious ... makes me<br />\nthink offruit cake.\"<br /><br />\nMild, ripe home-grown and aromatic Turkish tobaccos...<br />\naged three years... make Chesterfield an outstanding<br />\ncigarette...give them a more pleasing taste and aroma.<br /><br />\nhave less of them.<br />\n—A Dormer<br /><br />\nmic Grounds; Sugar A<br />\nFactor<br /><br />\n(Continued from Page 1, Col. 2)<br />\nThe lecturer deplored the passing<br />\no fthe phrase, Liberal, even in the<br />\nUnited States. People are becoming<br />\nmore and more intolerant. To a person of progressive tendencies, if you<br />\nare shy of plunging headlong into<br />\nnew reforms, you are a Fascist. To<br />\na conservative, if you are tolerant of<br />\nthe New Deal, you are labeled a Communist. This, he declared, was a<br />\nsham, because it beclouded thle real<br />\nissues that face the world.<br />\nLn reference to Spain, Dr. Madariago declared he hated to talk of the<br />\nsituation in his homeland, where democracy ha dtaken on more or less<br />\npinkish shades to combat Fascism.\"<br /><br />\nCopyright 1937. Liccarr &amp; MYERS TOBACCO CO,<br /><br />\nIA<br /><br />"}], "field_media_file": [{"target_id": 39078, "display": null, "description": null, "target_type": "file", "target_uuid": "be58d418-6aa1-418b-b219-dfe46663b0cf", "url": "http://digital.library.jhu.edu/system/files/2022-03/12754-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12754, "target_type": "node", "target_uuid": "4796983c-3002-449b-84c5-5b2f9e33f9e4", "url": "/node/12754"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "15ef6f35-b5c8-4eb4-b985-0a068da73a48"}]}