{"mid": [{"value": 35848}], "uuid": [{"value": "05b53d99-3d50-40aa-9b06-bac65d0720cf"}], "vid": [{"value": 35848}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:14:39+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12372-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:14:39+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:14:39+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "FORCNIIMIVEZMIIIM<br />\n<br />\n`2140.0R<br />\n<br />\nTHE•JOHNS•HOPKINS-UNIVERSITY<br />\nBALTIMORE<br />\n<br />\n\fThe Johns Hopkins University.<br />\nBALTIMORE, MD.<br />\n<br />\nThirty-Third Year.<br />\n<br />\nThe Johns Hopkins Press.<br />\nI.<br />\n<br />\nBeginning October 1, 1908.<br />\n11.<br />\n<br />\nIRA REMSEN, President.<br />\nEDWARD H. GRIFFIN,<br />\n;Dean of the College Faculty.<br />\nWILLIAM H. HOWELL,<br />\nDean of the Medical Faculty.<br />\n<br />\nIII.<br />\n<br />\nINSTRUCTION.<br />\nIV.<br />\n<br />\nFor Graduate Students:<br />\nIn Philosophy and the Arts. (Courses for<br />\ncandidates for the degrees of Ph. D.,and A.M.)<br />\nIn Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br />\n<br />\n(a)<br />\n(b)<br />\n<br />\nV.<br />\nVI.<br />\n<br />\nFor Undergraduates:<br />\n(c)<br />\n(d)<br />\n<br />\nAs candidates for the degree of B. A.<br />\nAs special students.<br />\n<br />\nVII.<br />\n<br />\nVIII.<br />\n<br />\nLibraries.<br />\n136,00o volumes<br />\n164,000 volumes<br />\n260,000 volumes<br />\n<br />\nUniversity<br />\nPeabody Institute.<br />\nPratt Library.<br />\nLaboratories.<br />\n<br />\nDirectors.<br />\n<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nBotany<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nExperimental Psychology.<br />\n<br />\nIra Remsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nD. S. Johnson<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nJohn B. Watson<br />\n<br />\nSeminaries.<br />\n<br />\nDirectors.<br />\n<br />\nIX.<br />\nX.<br />\n<br />\nXI.<br />\n<br />\nX11.<br />\n<br />\nX111.<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\nHistory.<br />\nPolitical Economy.<br />\nPolitical Science.<br />\nPhilosophy.<br />\nMathematics.<br />\nPhysics.<br />\n<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn Al. Vincent.<br />\nC iW. Andrews.<br />\nI-I. Hollander.<br />\nW. W. Willoughby.<br />\nJ. Mark Baldwin.<br />\nFrank Morley.<br />\nJoseph 6. Ames.<br />\n<br />\nUndergraduate Courses (leading to B. A.)<br />\n.<br />\n2.<br />\n3.<br />\n4.<br />\n5.<br />\n<br />\nGROUPS.<br />\nAncient Languages.<br />\nModern Languages.<br />\nHistory and Political Economy.<br />\nMathematics and Physics.<br />\nChemistry, Biology and Geology.<br />\nSerial Publications.<br />\n<br />\nAmerican Journal of Mathematics (vol. XXX).<br />\nAmerican Chemical Journal (vol. XL).<br />\nAmerical Journal of Philology (vol. XXIX).<br />\nStudies in Historical and Political Science (vol. XXVI).<br />\nModern Language Notes (vol. XXIII).<br />\nMemoirs from the Biological Laboratory (vol. VI).<br />\nContributions to Assyriology (vol. VI).<br />\nTerrestrial Magnetism (vol. XIII).<br />\nUniversity Circular (vol. XXVII).<br />\nProgrammes of the courses offered ito graduate students<br />\nin Philosophy and the Arts and in Medicine, and also of<br />\nthe undergraduate courses, may be obtained on application<br />\nto the Registrar.<br />\n<br />\nXIV.<br />\n<br />\nXV.<br />\n<br />\nXVI.<br />\n<br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume<br />\nXXX in progress. $5 per volume. (Foreign<br />\npostage 50 cents).<br />\nAmerican Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume<br />\nXL in progress. $s per volume. (Foreign<br />\npostage 50 cents).<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo.<br />\nVolume XXIX in progress. $3 per volume.<br />\n(Foreign postage 50 cents).<br />\nStudies in Historical and Political Science.<br />\nMonthly. 8vo. Series XXVI in progress. $3 per<br />\nvolume. (Foreign postage 50 cents).<br />\nJohns Hopkins University Circular.<br />\n8vo. Volume XXVII in progress. $1 per year.<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4to.<br />\nVolume XIX in progress. $2 per year. (Foreign<br />\npostage so cents).<br />\nJohns Hopkins Hospital Reports. 4to. Volume<br />\nXV in progress. f5 per volume. (Foreign postage 50 cents).<br />\nContributions to Assyriology and Semitic Philology (Beitrage zur Assyriologie, etc.) PAUL<br />\nHAUP f and FRIEDRICH DELITZSCH, Editors. Volume VI in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume VI in progress.<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXXIII in progress. $1.50 per volume. (Foreign<br />\npostage 25 cents).<br />\nAmerican Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 8vo. $5<br />\nper volume.<br />\nTerrestrial Magnetism and Atmospheric Electricity. L. A. BAUER, Editor. Quarterly. 8vo.<br />\nVolume XIII in progress. $2.50 per volume.<br />\n(Foreign postage 25 cents).<br />\nReprint of Economic Tracts.<br />\nJ. H. HOLLANDER, Editor. First Series and<br />\nSecond Series, $5. Third Series in progress, $1.<br />\nAnnual Report.<br />\nPresented by the President to the Board of Trustees,<br />\nreviewing the operations of the University during<br />\nthe past academic year.<br />\nAnnual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published<br />\nat the close of the academic year.<br />\nReports of the Maryland Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\n<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\nThe Critical Edition of the Hebrew Text of the Old Testament. Edited by Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum. ro<br />\nplates. $25.<br />\nSelections from the Early Scottish Poets. By William<br />\nHand Browne. 240 pages. $1.25.<br />\nStudies in Honor of Professor Gildersleeve. 527 pages,<br />\noctavo. $6.<br />\nThe Taill of Rauf Coilyear. Edited by William Hand<br />\nBrowne. 164 pages. $1.<br />\nPoe= de Fernan Goncalez. Edited by C. Carroll Marden.<br />\n282 pages. $2.50.<br />\nBaltimore Lectures on Molecular Dynamics and the Wave<br />\nTheory of Light. By Lord Kelvin. 716 pages. $4.50.<br />\nThe Oyster. By W. K. Brooks. 226 pages. $1.<br />\nEcclesiastes: A New Metrical Translation. By Paul Haupt.<br />\n50 pages. 50 cents.<br />\nThe Book of Nahum: A New Metrical Translation. By<br />\nPaul Haupt. 53 pages. 50 cents.<br />\nAncient Sinope. By David M. Robinson. 112 pages. $r.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances<br />\nmay be sent to the Johns Hopkins Press Baltimore, Md.<br />\n<br />\n\f4<br />\n<br />\n\f1irNriu,9-iCrtirr.<br />\nDECEMBER 18, 1908.<br />\n<br />\nVOL. XIII.<br />\nSubscriptions, $r.5o per year.<br />\n<br />\nPublished Fortnightly by the Undergraduates.<br />\n<br />\nBOARD<br />\n<br />\nOF<br />\n<br />\nNo. 5<br />\nlo Cents per copy<br />\n<br />\nEDITORS.<br />\n<br />\nFranklin B. Pedrick, 1909, Editor-in-Chief.<br />\nWalter V. Johnson, 1909, Athletic Editor.<br />\nGeorge W. Corner, 3d, 1909, Ass't Editor-in-Chief.<br />\nHertel<br />\nP. Makel, 1911, Business Manager.<br />\nNews<br />\nEditor.<br />\nJ. Hamilton Owens, 19o9,<br />\nE.<br />\nD.<br />\nMartin,<br />\n1911, Ass't News Editors.<br />\n1910<br />\nand<br />\nAlan C. Woods, i9to; G. Ross Veazey,<br />\nAddress all articles, communications, etc., to Franklin B. Pedrick, Box 486, Johns Hopkins University,<br />\nBaltimore, Md.<br />\nSubscriptions and business<br />\nUniversity, Baltimore, Md.<br />\n<br />\ncommunications should be sent to H. P. Makel, Johns Hopkins<br />\n<br />\nEDITORIAL.<br />\n1..1,•----<br />\n<br />\nT is with much regret that we call attention to the fact that there has<br />\nbeen a great breach of class etiquette. This year the Sophomore Class<br />\n•<br />\nhas beert holding its meetings in the Trophy Room. Now,the Trophy<br />\ntt<br />\nZr\" :s<br />\nRoom has heretofore been the sacred property of the upper classes.<br />\nIt<br />\nf:. i:<br />\n31<br />\nit<br />\nIt is a lounging room for the Seniors and Juniors only. Aside from<br />\n11,,•,:. ::<br />\ng<br />\nthis, it is the privilege of the athletic teams, of the musical clubs and<br />\nof the Cotillon Club to hold its meetings in the Trophy Room; but<br />\n• n n g n_ I: n n n n g n —<br />\nthis privilege never has and never will be extended to the under<br />\nclasses. We know of no other organization besides those mentioned<br />\nA 129V„.<br />\nthat has the right to monopolize the Trophy Room. We do not know<br />\nwhether the fault lies with the Senior Class or with the Sophomore Class. It may be that the<br />\nSophomore President does not know that it is entirely contrary to custom for either of the<br />\nunder classes—Sophomore and Freshman—to hOld class meetings in the Trophy Room. Now<br />\nthat he has been enlightened upon the subject, we hope that neither he nor any of the other underclassmen will break this Unwritten Law. We feel that this word will be sufficient, and hope<br />\nthat it will not be necessary for the Senior Class to take any steps in the matter.<br />\ne<br />\n<br />\n.<br />\n.<br />\n34 11<br />\n-v--ig<br />\n<br />\n_0_<br />\n101,--1304 E have received an arti.:le in regard to the proposed Inter-Fraternity<br />\n'1---P,011<br />\n•4,\\i<br />\nTreaty, but, since it was not signed, we have not published it. If the<br />\nwrigrrinnfrry .<br />\nauthor is willing to sign his name to it, we shall be very glad to publish<br />\nr 1 it in our next issue ; otherwise, we shall have to decline to do so. The<br />\ngrAr<br />\n1r •<br />\n-•<br />\nThe NEWS-LETTER takes this opportunity to say that the Board of Ed•<br />\nitors, as a whole, is not promoting the scheme for this Inter-Fraternity<br />\nV<br />\n✓<br />\nTreaty. It has probably been noticed that we have published two let\". rrwitifsrywrsters by two of our editors, one for and one against the Treaty, which<br />\ncolumn. The Treaty, as it was published, was<br />\now v virwv,17... - was proposed in our<br />\ncompiled not by the entire Board of Editors, but by Mr. Veazey, one of<br />\nour Assistant News Editors. We stated that. we should gladly publish all letters, either for or<br />\nagainst the proposed Treaty, unless, of course, they should take up too much of our columns.<br />\nThese letters should, however, be signed by the author.<br />\n<br />\nk<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nrf. -<br />\n<br />\n-1_,z6:4 21 x<br />\n<br />\nHE organizers of the Haresfoot Club, as the new dramatic society is to be called, chose a particularly happy moment to launch their<br />\ng T: g g g g g g TS<br />\nu<br />\nventure. The Paint and Powder Club, which in previous years has out2/<br />\ng<br />\ng<br />\nshone, and deservedly, all other local organizations of a similar character,<br />\n• It<br />\ng<br />\nhas decided to forego a production this year. There is no good reason<br />\nIt<br />\nwhy the support of the prominent people of the city should not be given<br />\nn<br />\nn<br />\nto the new organization instead; its members are fairly well known and<br />\n• nnnunungis<br />\nits constitution provides for an equal distribution of its earnings between<br />\ng<br />\nIt i<br />\n•<br />\nthe Homewood Building Fund and some worthy lo,cal charity. There<br />\n31, 31z<br />\nhas been a need for an association of this kind at the University for a<br />\nlong time. The man to whom athletics do not appeal, and who can't sing, has had heretofore<br />\nno outlet for his superfluous energy. Here is a place where he can at least try to shine. Let's<br />\nhope he does.<br />\n:Aqi g<br />\nn O'g<br />\nx<br />\n<br />\n0,<br />\n<br />\n:I. ,<br />\n<br />\nHE appreciation shown on the part of the public for. Dr. Henderson's recent lectures has clearly demonstrated the interest in historical subjects<br />\namong both scholars and the laity. Dr. Henderson's feeling for the sub.6„.<br />\n.v<br />\nv *k, ject, his personal magnetism and the clearness of his thoughts have all<br />\nv •<br />\ntended to arouse this interest. His lectures are over, but there are yet<br />\nkv<br />\nv<br />\nvast fields in history of absorbing interest, both to the public and the<br />\nv 4-v<br />\nlo<br />\nstudents.<br />\n• vrirv*vv**<br />\nAt a recent meeting of the Senior. Class of the University the sub4._ wi<br />\nriti 4, ject was discussed and resolutions were adopted requesting Dr. Chas.<br />\n,<br />\nOF 1FZ<br />\nM. Andrews, professor of history of the University, to deliver a series<br />\nof public lectures upon some subjects of historical interest, to be chosen by himself. Those<br />\nof the University who have had the opportunity of taking a course under Dr. Andrews know<br />\nwhat a pleasure his lectures are. His ability as a lecturer is widely known, and a series of lectures delivered by him upon any subject he might select would meet with instantaneous response by the public. We have been selfish enough in the past to keep Dr. Andrews' lectures<br />\nall to ourselves, and to the few adventurous spirits who may happen to drop in among the students, but now there is a broader field, and we can only hope that Dr. Andrews will see his<br />\nway clear to respond to the request of the Senior Class with a series of public lectures.<br />\nnr—O-Iv vg-r<br />\n„,,,,. zlir vvyvylir .<br />\n<br />\n•-•<br />\n<br />\n'• IF<br />\nVIF<br />\n<br />\ny<br />\ny 4,.<br />\n*<br />\n<br />\nAs announced a month ago, TIIE NEWS-LETTER Board has decided to award a prize for<br />\nthe best design for a new cover for the paper. The time limit is now up, but we have decided to extend it until Monday, January 4th, as only a few designs have been handed in. The<br />\nconditions of the contest will be found in the second number previous to this.<br />\n<br />\nThe Board of THE NEWS-LETTER takes great pleasure in announcing the election to the<br />\nstaff of Mr. Nathan Williams Haynes, 1912. Mr. Haynes will take the position of Assistant Athletic Editor. Mr. Haynes is the first member of the Freshman Class to be elected to an office on<br />\nTHE NEWS-LETTER, but we expect to elect one more Freshman this year.<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nvolumes which found a speedy and a fitting<br />\nend in the fish markets and grocery shops of<br />\nancient Rome. And as it has been, so it doubtWILFRED P. MUSTARD.<br />\nless shall be. You will be tempted by the adOne of the great temptations of life is the vertising of the publishers, and by the convertemptation to waste our time, and one of the sation of your friends, to turn at once to the<br />\nmost persistent forms of this temptation comes popular book of the month or of the season.<br />\nto us in the shape of trivial books and papers But even the great book of the year should<br />\nand magazines. To be sure, a large part of not be allowed to interrupt a man if it finds<br />\nour population desires nothing better, is not ca- him seriously engaged with some standard<br />\npable of appreciating anything better; but I am volume. If it is a good book, it can afford to<br />\nspeaking to a privileged class. And yet even wait its turn, and it may be available a little<br />\nmen who have been trained to know the good later. If it is not available a little later, you<br />\nare constantly exposed to what is cheap and will not have lost much by waiting.<br />\nvulgar and superficial. And even when we<br />\nAnd not only should you feel that your first<br />\ntry to read something better, our efforts are duty is to the great standard books, but your<br />\napt to be very brief and desultory and irregu- reading should be done according to some defilar. But why waste our time on purely trivial nite plan and system. Don't skip about from<br />\nand ephemeral stuff, when the great books of one subject or one department to another, but.<br />\nthe world stand about us waiting to be read? follow some definite course in one subject or<br />\nThe blessing of the printing-press is not an one department at a time. If a man is interunmixed blessing—has never been an unmixed ested in history—and every scholar should be<br />\nblessing—and when I see the kind of stuff that interested in history—let him take one period<br />\nfloods our news stands and book stores, and or one people at a time, and read the great<br />\neven our libraries, I sometimes think of old Sir books on his subject. I mean such books—to<br />\nThomas Browne and of his wish, \"that there speak only of Roman history—as Mommsen<br />\nwere a general synod—not to unite the incom- and Merivale and Gibbon. If a man cares for<br />\npatible difference of religion, but for the ben- epic poetry, let him read some of the great<br />\nefit of learning, to reduce it as it lay at first, in epics of the world—Homer, for example, and<br />\na few and solid authors, and to condemn to the Virgil, and Dante, and Milton—read them confire those swarms and millions of rhapsodies, tinuously, if possible, and in long stretches,<br />\nbegotten only to distract and abuse the weaker not a few lines or a few books at a time. We<br />\njudgments of scholars, and to maintain the all believe that \"Paradise Lost\" is one of the<br />\ntrade and mystery of typographers.\"<br />\ngreat poems of our language; but how few of<br />\nI receive circular announcements almost us ever read the poem from beginning to end,<br />\nevery week that some unknown or unimportant and try to see its purpose as a whole. And<br />\nperson has written quite the strongest thing he how few of us ever take the time to read<br />\nhas yet produced, or that someone has written through one of Milton's great classical models,<br />\nwhat promises to be the book of the year. Per- which are, after all, the best, if not the only,<br />\nhaps he has; I always hope he has. But why explanation of his methods and of his art. And<br />\nshould the scholar rush off to examine the as it is with history and with epic poetry, so<br />\nclaims of every blatant publisher who caters to with every other subject and every other dethe tastes of the multitude? And why should partment, for the only way to gain command<br />\nhe neglect the great books of his race for sake of any important subject, to get a proper idea<br />\nof some book which counts in advance on only of any single department, is by systematic<br />\na few months, or a few weeks, of life? Mac- study.<br />\nAnd I hope I shall not be suspected of proaulay was once moved to moralize on the wellpuffed novels which served to hold the pastry fessional bias in the matter if I add that most<br />\nor line the trunks of the following year. And subjects should be studied historically, and that<br />\nlong before Macaulay wrote his sentence about in almost every case it is well to begin with the<br />\nthe trunk-makers and pastry-cooks of London, ancient authors and the ancient models. The<br />\nCatullus and Horace had spoken of similar study of ancient history is necessary to the tinTHE SYSTEMATIC READING OF THE<br />\nBEST BOOKS.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nderstanding of modern institutions and modern<br />\nlife: the study of Greek philosophy is the best<br />\npreparation for the study of our modern systems, and some knowledge of Greek and Roman literature is necessary for the full appreciation cf much of our highest English poetry.<br />\nFor the art and culture of ancient Greece are<br />\nstill among the richest parts of our inheritance.<br />\nAnd, as Mr. Lowell once said on a notable occasion, \"The garners of Sicily are empty now,<br />\nbut the bees from all climes still fetch honey<br />\nfrom the tiny garden plot of Theocritus. On<br />\na map of the world you may cover Judea with<br />\nyour thumb, Athens with a finger tip, and<br />\nneither of them figures in the Prices-Current;<br />\nbut they still lord it in the thought and action<br />\nof every civilized man.\"<br />\n<br />\nTHE PITIFUL COMPLAINT OF THE<br />\nPOOR HOPKINS STUDENT.<br />\n1.<br />\nLast Saturday night at eleven o'clock<br />\nI looked in my purse—and, oh! what a shock!<br />\nNot a nickel I found to pay my car-fare<br />\n(At seven o'clock five dollars was there).<br />\nI searched, but in vain, and one word I spoke—<br />\n\"Broke\"<br />\n<br />\nChances in raffles I'd bought, six or seven;<br />\nThe girls crowded round me, I thought it was<br />\nheaven;<br />\nBut rallies cost money, I learnt to my cost;<br />\nDeparted five dollars—gone—thrown away—<br />\nlost!<br />\nBut one word I have, and oft be it spoke—<br />\n\"Broke !\"<br />\n<br />\nNo Christmas for me, and no gifts to my<br />\nfriends;<br />\nThank goodness, it's over now—everything<br />\nends—<br />\nThe Cosmovilla is only a thing of the past,<br />\nBut my busted condition a long time will last.<br />\nFor many a month I'll continue to croak:<br />\n\"Broke !\"<br />\nS. C. C., who has suffered.<br />\n<br />\n5<br />\n<br />\nLIFE IN MUNICH.<br />\nMr. H. J. Hughes, 'oS, who, since graduation, has been studying at Munich, wrote the<br />\nfollowing letter to his parents, little thinking<br />\nthat it would ever be published in the NEWSLETTER. A member of the University, however, was present when it was received, and<br />\nrequested that he be allowed to publish it in<br />\nTHE NEWS-LETTER.<br />\nDEAR FOLKS:<br />\nThe University is now in full swing. I have<br />\njust come from paying my 68M. tuition fee,<br />\nand I suppose that is the first step toward<br />\nmaking me a full-fledged student. The work<br />\nis still hard. I mean, to understand the teachers. Many parts of the lectures are now lost<br />\non me, yet I hope that, as I become acquainted<br />\nwith the professors' style of talking and my<br />\nvocabulary grows, this difficulty will be overcome. I decided to give up one of the courses<br />\nI wanted to take. At least, to postpone it until<br />\nnext semester. You see, everything here goes<br />\nby semesters. The University closes about<br />\nMarch 15 for a month. All the courses end<br />\nthen. When they are resumed again in April,<br />\nit is as if the University were starting anew.<br />\nThe German student never stays at one university for his four years' work. He goes to<br />\nat least four different ones. Here a semester,<br />\nthere a semester, usually remaining four terms<br />\nat that university from which he wishes his degree. There are no examinations—you simply<br />\nstudy for four years, and at the end of that<br />\nPeriod take a final examination, which, if<br />\npassed, makes you a doctor of medicine, or<br />\nwhatever other branch you may have passed.<br />\nAs it is, I have 17 hours of lectures, three each<br />\nday and two on Saturday. The course I<br />\ndropped was an excellent one, given by one of<br />\nthe foremost men in Germany, Dr. Brentano.<br />\nThe courses I am taking will, I believe, prepare me in German for the real work next<br />\nyear. As I have to do my reading with a dictionary, it goes slowly, especially as the subjects contain many words one never meets in<br />\nordinary reading.<br />\nThe praiseworthy characteristic of the University, and of all German universities, in fact,<br />\nis that the student is not placed under an instructor with little experience in teaching. The<br />\nmen here are, as a general rule, old men. Each<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nman has made a name for himself by his research work, his works published and his record at the university from which he was called<br />\nto fill the chair at Munich. The man who<br />\ngives the general world history is private advisor to the Prince Regent of Bavaria. One<br />\nof George's (George Abel, 'o8) professors is<br />\nthe most celebrated man in the world in physics, Dr. Roentgen. And so it goes, each man<br />\na \"star,\" an authority in himself, whose books<br />\nare well known in university circles. That<br />\nseems to be the road to fame--the publication<br />\nof books.<br />\nAs forlorn and dreary looking as is the old<br />\npart of the University, just so wonderfully<br />\nbeautiful is the new. I really seem to be wandering in a palace in fairy land, when I recollect it is only a university, and not a kingly<br />\npalace. The halls are immense and wide, with<br />\nmosaic floors. The staircases and doorways<br />\nare of beautiful Circassian marble. Over all<br />\nare exquisite mosaics, beautiful fountains and<br />\nelectric light brackets of beaten iron. At the<br />\nbottom of the main staircase is an immense<br />\nopen space, softly lighted from the dome<br />\nabove. The main hall seats 1,200 people. It<br />\nis in brown and white, with a wonderful skylight of stained glass and heavy mahogany<br />\ndoor with a gold pattern. In the class rooms<br />\nare hardwood floors, soft cream-colored curtains with green borders, and one sees everywhere in the corridors and rooms excellent<br />\ntaste in the selection of the furnishings. The<br />\ndoors are of frosted glass with wood pattern.<br />\nThey have any number of rooms seating 200,<br />\nthe seats being arranged as in a theatre. Never<br />\ndid I imagine a university could be so lavishly<br />\nbuilt.<br />\n(To be continued.)<br />\n<br />\nSAMMY'S \"SCOOP.\"<br />\ncraziest looking little chap in<br />\nthe<br />\nwas<br />\nHe<br />\nthe world; pug-nosed, red-headed, freckledface, and about as big as a minute, when he<br />\ngot his job as night-boy on the Daily Blab.<br />\nHe was, however, always cheerful and willing, and his funny little face wore \"a smile<br />\nthat won't come off.\" His queer looks, droll<br />\nsayings and everlasting good nature made him<br />\na prime favorite and we all forgot how \"unbeautiful\" he was. Before he had been in<br />\n<br />\nthe office a week he wormed his way into<br />\neveryone's heart from old \"Pop Fitch,\" the<br />\nManaging Editor, down to the telegraph<br />\noperators. He was an encyclopedia of crime<br />\nand sport and the boys soon learned to use<br />\nhim as a reference book on these subjects. He<br />\ncould tell you as much about any murderer or<br />\nconfidence game, baseball player or racehorse as you would find in an hour's hunt<br />\nanywhere else. He had a vocabulary of<br />\noriginal and selected slang that would turn<br />\nBilly Baxter in his grave and drive \"The<br />\nChorus Lady\" to drink, could they have<br />\nheard him. Each day the Giants were \"at<br />\nhome\" he would be there, for working at<br />\nnight gave him the afternoons free unless he<br />\nslept, but sleep with ball game on. His<br />\nquaint descriptions of plays that won and lost<br />\ngames up at the Polo Grounds, his scalding<br />\ncriticisms of the players, his slangy similies<br />\ncrept into the Blab so often that the paper be-<br />\n<br />\ncame famous for its -basball news and Alf<br />\nMacy, who was doing that stuff those days,<br />\nwon a reputation as a wit.<br />\nFor three years Sammy worked in the<br />\neditorial rooms, carrying copy, going out for<br />\nthe men's midnight lunches, and doing other<br />\nodd jobs. Then there happened one of those<br />\nunexpected things, which are always bobbing<br />\nup in a newspaper office and which make<br />\njournalism the most fascinating game in the<br />\nworld. The Typographical Union gave a<br />\npicnic and that evening only about half our<br />\npressmen and stereotypers reported; the rest<br />\nwere recovering from the entertainment. The<br />\nforeman of the press-room found his force so<br />\nshort that unless he could get a couple of men<br />\nsomewhere he would not be able to run the<br />\npresses. He went up to the composing-room,<br />\nbut there they needed all their men on the<br />\nlinotype machines. Then he came to the<br />\neditorial-rooms.<br />\n\"There's Sammy. Will he do?\" was the<br />\nanswer he received.<br />\n\"He'll do,\" said the foreman and so Sammy<br />\nwent down stairs for the first time,<br />\nThe three years Sammy had worked for The<br />\nBlab had made a great change in the boy. In<br />\nspite of the hard night hours he had grown<br />\nlike a weed, and if he was not handsome—<br />\nwell you could look at him without laughing:<br />\na metamorphosis that was little short of a<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n7<br />\n<br />\nmiracle. However great his physical trans- an' go an' snitch. He'll show up tomorrow,<br />\nformation had been, he had not changed but what can one kid do?\"<br />\nmentally. He was still the good-natured,<br />\nWhile the others were washing up, Sammy<br />\nwilling Sammy who doted on murders and slipped out and went home, thinking all the<br />\nbaseball. He was a high favorite in the edi- while what one kid could do to beat the<br />\ntorial rooms and the next night there was stereotypers at their own game. The dramuch talking when it was announced that he matic instinct was strong in this little redwas to stay down stairs, and some of us even headed chap, and he knew that the more senwent down to the press room to try to per- sational his rescue, the greater his reward.<br />\nsuade him to return. He only laughed and Finally he hit upon a scheme that was both<br />\nsaid he was going to try it for a while.<br />\nsure of success and dramatic enough for his<br />\nHe tried it and liked it and stayed in the morbid tastes. He had heard that the union<br />\npress room. By dint of hard labor he worked had played the striking stereotypers false and<br />\nhis way from 'fly boy\" to assistant pressman, that they had been around to the office asking<br />\nand what he did not know about a press was to be taken back. This was the inspiration<br />\nnot worth knowing. The same qualities of Sammy's plan. When he got home he<br />\nwhich made him so popular with editors and left a note on the kitchen table asking his<br />\nreporters stood him in good stead among the mother to call him at noon and went off to<br />\nbig ink-stained pressmen. Moreover his capa- bed to sleep, as if strikes were the last thing<br />\nbility for hard work, which had never been in the world. All the afternoon he intertested upstairs, now began to show itself, and viewed the old stereotypers. To each he exthis with his natural quickness made him one plained that the new men were going out and<br />\nof the best men on the presses.<br />\ntold them to meet him that night and he<br />\nSuddenly, another of those unexpected would guarantee their jobs.<br />\nthings happened. The Blab was running an<br />\nopen non-union shop, but the union, by<br />\npromises of rewards and new jobs, got the<br />\nstereotypers to join their ranks. Accordingly,<br />\none fine evening not a man of the stereotyping<br />\ndepartment came to work. By a series of<br />\nmake-shifts and unheard of changes the office<br />\nscraped together enough men and one of the<br />\npressmen, who had done some stereotyping,<br />\nshowed them how and we got out a paper, a<br />\nvery rocky paper, and minus two editions, but<br />\nnevertheless a paper. One of the men taken<br />\nfrom the presses to help make the stereotyping<br />\nforce was Sammy, and next day when they<br />\ngot some more stereotypers he again changed<br />\nhis job, for he stayed in that department.<br />\nSammy had been with the stereotypers<br />\nabout a month and learned to \"shave\" and<br />\n\"clean up\" plates, when one day he was<br />\nstanding behind the open door of his locker<br />\nand heard the foreman say to one of his men:<br />\n\"So you don't think it's no use to try<br />\nSammy.\"<br />\n\"Naw,\" answered the other, \"he's strong<br />\nfor the paper, and I'm sure you can't get<br />\nhim to come out with us. If we sound him,<br />\nhe's just wise enough to tumble to the game<br />\n<br />\nThat evening the night door clerk was<br />\nthunderstruck to see Sammy walking at the<br />\nhead of the old stereotyping force. They got<br />\nout the paper, and it was not short a single<br />\ncopy. Sammy had his pay doubled, and he<br />\ndeserved it, as the press-room foreman said,<br />\n\"We couldn't have even gotten out one of<br />\nthose rocky, no-mail edition papers.\"<br />\nAll this was three years ago, and Sammy<br />\nis now foreman of the stereotyping department, and if some day word is passed round<br />\nthe office that there is a new manager of the<br />\nmechanical departments, most of us will be<br />\nwilling to bet pretty high stakes that his<br />\nname is Sammy, or rather, Mr. Samuel<br />\nMorgan.<br />\nH.<br />\n<br />\nAnd thus the humblest of the learned throng<br />\nGains deepest knowledge of this earth of<br />\nours:<br />\nThe pilgrims on the path most lone and long<br />\nShall reach the coolest shade and sweetest<br />\nflowers;<br />\nAnd he who out of weakness is made strong<br />\nHath leagued himself with the eternal<br />\npowers.—REGINALD A. BECKETT.<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nTHE HARESFOOT CLUB.<br />\n<br />\nLACROSSE.<br />\nEditor News Letter—<br />\nNo article has as yet appeared in THE<br />\nNEWS-LETTER concerning lacrosse. It is most<br />\nnatural that this spring sport should be kept in<br />\nthe background during the football season, but<br />\nnow that our gridiron warriors have completed<br />\ntheir glorious and most successful season, the<br />\ntime has come when we should look forward<br />\nto achieving fresh laurels for Hopkins.<br />\nThere are a number of men in this University who desire to become athletes, but who<br />\nmodestly imagine they lack the talent. It is to<br />\nsuch men that lacrosse offers a salvation. Diligent practice, coupled with a little coaching,<br />\nmakes the expert. There is no excess training<br />\nrequired nor any particular response; only<br />\nsteady work and a willing spirit.<br />\nIt seems to be the general opinion of the<br />\nfellows that there are but very few positions<br />\non the team open this year. Such a report is<br />\nunfounded and wholly false. The veterans at<br />\nthe Medical School are very uncertain in attendance, and at best cannot in any sense be<br />\nrelied upon to fill their positions next spring.<br />\nJust recently one was taken seriously ill with<br />\ntyphoid, while another is to leave for Europe in<br />\nApril, thus incapacitating two of our best men.<br />\nThe loss of these, together with the absence of<br />\nMeyers, Blanck, Armstrong, k. Williams and<br />\nMathias, who have left the University, will<br />\nmake it necessary to develop material for the<br />\ncoming season.<br />\nThe squad has already been called out, and<br />\nis hard at work to establish a new record by<br />\nwinning the fourth consecutive inter-collegiate<br />\nchampionship of the United States.<br />\nBesides, there is coming the series of class<br />\ngames. So beware, Sophomores and Freshmen! Look to your laurels. Buy a stick—get<br />\nbusy—talk and play lacrosse.<br />\n<br />\nCAPTAIN H. S. FRANK.<br />\n<br />\nOn Monday night, December 7, a meeting<br />\nof the Dramatic Club was held. A constitution was adopted and the following officers<br />\nwere elected:<br />\nPresident—Mr. Hamilton Owens, 19o9.<br />\nVice-President—Mr. Alan C. Woods, 1910.<br />\nTreasurer—Mr. W. Howard Michael, 1909.<br />\nSecretary—A Ir. Benjamin Weems, 1909.<br />\nStage Manager—Mr. Williams Haynes,<br />\n<br />\n1912.<br />\nThese, with Messrs. Stollenwerck and Pedrick, make up the executative committee. It<br />\nwas decided to call the club \"The Haresfoot<br />\nClub.\"<br />\nPlans were discussed and it was decided to<br />\npresent some farce, to be chosen by the executative committee, next February. A more definite announcement, plans, dates and trips will<br />\nbe made later. Membership is subject to election by the executative committee, of which<br />\nMr. Woods is chairman and Mr. Weems secretary.<br />\n<br />\nTHE FOOTBALL BLOWOUT.<br />\nThe football blowout, held in the Cage on<br />\nSaturday night, December 12, proved to be enjoyable in a slap-stick sort of way to the undergraduates, who were present almost to a<br />\nman.<br />\nBesides speeches by Dr. Renouf, who presented the \"H's,\" and Captain Stockton and<br />\nManager Bally, and the usual tug of war, there<br />\nwas a boxing match between Lawton and<br />\nBeehler, both '12. Neither men knew much<br />\nabout the game, but they made up in speed<br />\nwhat they lacked in science, and for the two<br />\nrounds they went they mixed things up some.<br />\nThe musical end was attended to by three<br />\n-gentlemen of culloh,\" who, backed up by a<br />\nbanjo and a guitar, succeeded in stirring up the<br />\nechoes in the cage by means of their powerful<br />\nlungs. \"Mistah Thomas,\" one of the three,<br />\nwas undoubtedly some pumpkins in the buck<br />\ndancing line.<br />\nThe .feed that followed was up to the standard set by the rest of the show, and one of the<br />\nFreshmen was heard to say after the lights<br />\nhad been put out that he had eaten \"four<br />\nblocks:'<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n9<br />\n<br />\naibUfSNMI<br />\nHOPKINS INDOOR MEET.<br />\n<br />\nA<br />\n<br />\nThe track team management has again secured the use of the Fifth Regiment Armory<br />\nfor an indoor athletic meet. This event, which<br />\nbrings to Baltimore the best college track and<br />\nfield men of any meet held here, will be held<br />\nSaturday evening, January 3oth. Some exceptional relay races will be run, for, according<br />\nto our usual custom, we will have a mile race<br />\nwith the University of Virginia, and invitations have been sent to Princeton and Columbia<br />\nto run teams in the four-mile event, where<br />\nHopkins will also be represented.<br />\nManagers Stewart, Wolfe and Glanzer are<br />\nworking hard for the success of this meet,<br />\nwhich will be run, as all Hopkins track meets,<br />\nin a business-like way, with no long \"stage<br />\nwaits\" to tire the spectators and with ideal conditions for the contestants. As usual, a Games<br />\nCommittee will be appointed to assist in this<br />\nwork.<br />\nThe program includes open-to-all events in<br />\nthe too and 220-yard dashes, 44o, 88o, and mile<br />\nruns, the high and broad jumps, and the pole<br />\nvault. There will also be a 100-yard dash and<br />\n440-yard run, open to schoolboys, and a 220<br />\nfor midgets. Relay races will be held to suit<br />\nthe entries that will be made.<br />\nInvitations to enter in these games have<br />\nbeen sent out to more than a hundred and fifty<br />\ncolleges, schools and athletic clubs, and a long<br />\n<br />\nlist of star entries is assured. The games have<br />\nalways proved to be one of Hopkins' star athletic attractions, and those to be held this<br />\nseason to promise to even outshine its brilliant<br />\npredecessors.<br />\nHopkins is to be represented in the to-mile<br />\nrun that is to be held in Washington on New<br />\nYear's Day, Griffith, Bryer, Reeside, Russell,<br />\nWolfe and Stocket having entered. These are<br />\nthe men who won the Cross-Country Club's<br />\nbanner this fall, and their prospects are excellent for capturing the event in the Capital.<br />\n<br />\nFRESHMAN-SOPHOMORE GAME.<br />\nA single goal from placement, kicked by<br />\nMcCabe, the Sophomore halfback, won the inter-class football game for the second-year<br />\nmen. Contrary to the expectations of everyone, the Freshmen played a fast, plucky game;<br />\nin fact, most thought that they outplayed the<br />\nupper classmen. Fulton and Beehler, the<br />\nFreshman halfbacks, repeatedly tore up the<br />\nheavier line of their opponents, and, had there<br />\nbeen a few more minutes to play, would have<br />\nscored a touchdown, for when the whistle blew<br />\nfor the end of the game the Freshmen held the<br />\nball for first down within the Sophomores' toyard line. The cane rush proved easy meat<br />\nfor the Freshies. They picked fast, wiry men<br />\nto represent them, and these, getting the jump<br />\non the Sophs at the start, fairly covered the<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n10<br />\n<br />\ncane with their hands.<br />\nlows:<br />\nSophomores.<br />\nBurgan<br />\ni<br />\nDoetsch<br />\ni<br />\nMcCabe<br />\ni<br />\nElliott<br />\ni<br />\nLinden<br />\n2<br />\nMorrison<br />\ni<br />\nTotal.<br />\n<br />\nThe lineup was as fol-<br />\n<br />\nFreshmen.<br />\nFulton<br />\nTilghman<br />\nLawton<br />\nBryan<br />\nPackard<br />\nHaynes<br />\nEaster<br />\n7 Lee<br />\nRogers<br />\n<br />\nthe balcony, and, led by \"Dutch Breyer,\" by a<br />\nrousing hullabaloo showed that it was exclusively Hopkins night.<br />\n<br />\n2<br />\n<br />\n2<br />\n<br />\n2<br />\n<br />\n2<br />\n<br />\nTotal<br />\n13<br />\nPresident of Sophomores, Harry Burgan ;<br />\npresident of Freshmen, Jack Fulton.<br />\nThe teams lined up for the football game as<br />\nfollows:<br />\nSophomores.<br />\nFreshmen.<br />\nLE<br />\nPaulus<br />\nBosley<br />\n. an. .L.T..... Wm. Tilghmat.<br />\nChas. Tilghm<br />\nLG<br />\nH. Sonneborn<br />\nSchmeisser<br />\nR. Glanzer<br />\nPackard<br />\nLinden, Doetsch....R.G.......Ellis, Haynes<br />\nRT<br />\nLawton<br />\nSalzer<br />\nRE<br />\nBryan<br />\nWaters (c)<br />\nQB<br />\nAble<br />\nWolfe<br />\nL<br />\nH<br />\nFulton<br />\nStollenwerck<br />\nBeehler<br />\nRH<br />\nMcCabe<br />\nMakel<br />\nHuck<br />\nFB<br />\nGoal from field—McCabe.<br />\n<br />\nCOTILLON CLUB DANCE.<br />\nThe first of the Cotillon Club dances was<br />\nheld on Friday night, December 4, 1908, in McCoy Hall. The dance started promptly at 9,<br />\nand the last dance was whirled away as the 12<br />\no'clock bell rang.<br />\nIn spite of the rain, which had lasted all the<br />\nafternoon up until 8 in the evening, the dance<br />\nwas very well attended. There were about<br />\n75 couples present, and 25 or 30 stags. It was<br />\na great source of satisfaction to the Board of<br />\nGovernors to see so many of the chaperons<br />\npresent. Among these were Dr. and Mrs.<br />\nLorraine Hulburt, Dr. and Mrs. Henry Wood,<br />\nDr. and Mrs. Ronald T. Abercrombie, Dr. and<br />\nMrs. Murray P. Brush, Mrs. Hall Harris, Jr.,<br />\nand Mrs. Paul Haupt. Those there are to be<br />\ncongratulated, and we hope to see more at the<br />\nnext dance, which very likely will be held<br />\nsometime in February.<br />\nThe floor was cleaner than usual, and well<br />\nwaxed, so that green Freshmen could slip, slide<br />\nand bump into sedate upper classmen and professors to their heart's content. The music<br />\nwas divine; \"ravishing,\" as one learned Senior<br />\nexpressed it, and, although the orchestra might<br />\nhave given more encores in the after-supper<br />\ndances, and made them a little longer, the general sentiment is that Emerich and his choice<br />\norchestra could have done no better. The only<br />\nfault to be found with any of the arrangements<br />\nis that the caterer might have made better<br />\narrangements. True that the salad was hot,<br />\nbut the ice-cream was cold—when it was not<br />\non hot plates. Perhaps it would not be unwise<br />\nfor the Board to change caterers and see if another would not be more satisfactory.<br />\nHowever, the general opinion of those who<br />\ncame to see what the dances are like is that<br />\nthey are most assuredly coming to both the<br />\nothers.<br />\n<br />\nHOPKINS NIGHT.<br />\nHopkins night, which was held at Ford's<br />\nOpera House on December IIth, proved to be<br />\na howling success. The theater was tastefully<br />\ndecorated with Hopkins colors and class banners, and there was a large and appreciative<br />\naudience present. The play itself, \"The Girl<br />\nQuestion,\" was certainly suited to the occasion,<br />\nas it represented a topic that everyone present<br />\nwas deeply interested in, especially those who<br />\ndid not go to \"stay.\"<br />\nFar more interesting, however, was the spirit<br />\nshown, not only by the students, but by the<br />\nalumni. It showed that the reunion held in NoHopkins men have long been pleased with the<br />\nvember had brought the alumni and the stu- lii excellence of the furnishings to be found in the<br />\ndents together to a closer fellowship than they<br />\nMen's Store at ::<br />\nhave ever before enjoyed.<br />\nPractically every undergraduate was present. Between the acts everyone assembled in<br />\n210-218 NORTH HOWARD ST.<br />\n<br />\nHUTZLEK BUM IC<br />\n<br />\n\fTHE NEWS-Lli 1 rER.<br />\n<br />\n...c.<br />\n<br />\n11<br />\n<br />\n................<br />\n.............................. . ... ...................... .................................<br />\n..... ............ . . ......... ..........* .* :***..... ....' *<br />\n<br />\n.....................................<br />\n<br />\n......................<br />\n<br />\n.. ..............<br />\n...........................................................<br />\n<br />\n........ .*................... * ........ ........<br />\n..<br />\n<br />\nWhen a college man discovers something really<br />\ngood, the \"word\" soon<br />\npasses around the<br />\ncampus, until<br />\neverybody<br />\nknows.<br />\nFatima Turkish Cigarettes<br />\nare a striking<br />\nexample of this.<br />\nIf you will smoke a<br />\npackage you will be<br />\ngreatly pleased with<br />\n\"Fatimas.'<br />\n•••••...<br />\n<br />\n20 for 15c<br />\n<br />\n. ..<br />\n...... ................. ........................... ....... .....................<br />\n...........<br />\n.. .<br />\n............... .. ..... .................<br />\n.............<br />\n..,.....<br />\n.\".........<br />\n............<br />\n.....<br />\n.<br />\n.................<br />\n<br />\n...... .....<br />\n<br />\n..................<br />\n<br />\n..<br />\n<br />\n........ .<br />\n<br />\n..........<br />\n... ............<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nUNIVERSITY NOTES.<br />\nThe memorial meeting in honor of Professor<br />\nBrooks was held in the Donovan room on Sunday, December 6th. A large audience was<br />\npresent, and addresses were made by several<br />\nmembers of the faculty. A very interesting<br />\naccount of Dr. Brooks' life and work, by Associate Professor Ethan A. Andrews, will be<br />\nfound in the last number of Science.<br />\nAt a recent meeting of the Freshman Class<br />\nGerhard Schmeisser was elected captain of the<br />\nFreshman lacrosse team. Captain Schmeisser<br />\nis a brother of \"Bill\" and Harry, both former<br />\nstars on the \"'varsity.\" There is a great deal<br />\nof good material in the Freshman Class, and<br />\nhe hopes to develop a team that will give the<br />\nSophomores a hard rub.<br />\n<br />\nSHIRT<br />\nOn and off like a coat.<br />\nIn fast colors and exclusive styles. $1.50 up.<br />\nCLUETT,PEABODY & CO., Makers<br />\n<br />\nETcliO:(1:15<br />\n311 N.CHARLES ST<br />\n<br />\n0<br />\n.107)401tE<br />\nfi<br />\n..:17:cA/<br />\n<br />\nThe undergraduate matriculation was held<br />\non December loth. Appropriate addresses<br />\nwere made by President Remsen, Dean Griffin,<br />\nDr. M. P. Brush and Dr. Buchner. Sixty-one<br />\nreceived their certificates.<br />\nDr. Ernest Flagg Henderson on December<br />\n15th gave a lecture on \"Regime of Robespierre,\" the last of his series of lectures on the<br />\nFrench Revolution. These lectures have been<br />\nexceedingly interesting and instructive, and<br />\nhave been greatly appreciated by everyone who<br />\nhas attended them.<br />\n<br />\nSocial Etiquette with College<br />\nMen is an essential, therefore your<br />\nVisiting Cards and Stamped Stationery as well as your Gifts<br />\nshould be correct. LYCE1T, the<br />\nSociety Stationer, is at 317 N.<br />\nCharles Street, and can give you<br />\nall of these at reasonable prices.<br />\n<br />\nChocolates<br />\n<br />\n?<br />\nt Bonbons<br />\n<br />\n18 and 20 E. Baltimore St., Baltimore, Md.<br />\n<br />\nLEFRANC & AULT<br />\nSell a GUARANTEED GOAT SKIN GLOVE<br />\nat $1.00 and $1.50 Per Pair<br />\nAT THE<br />\n<br />\nSHIRT SHOP, 421 North Howard Street<br />\nMr. Holun Yokayama gave a very delightful<br />\naddress on Japan on December 14th.<br />\nThe day after the Sophomore-Freshman<br />\nfootball game several Freshmen, released to a<br />\ncertain extent from their former state of bondage, appeared in the basement smoking huge<br />\npipes with very long stems.<br />\nThe Christmas examinations will begin tomorrow. Horrible dictu.<br />\nProfessor C. M. Andrews, of the History<br />\nDepartment, was elected president of the Trinity College (Hartford, Conn.) Alumni Association of Baltimore at a recent meeting, held at<br />\nthe Hopkins Club.<br />\n<br />\n2 DOORS BELOW FRANKLIN<br />\n<br />\nPC<br />\nCONFECTIONER AND CATERER<br />\n701 West North Avenue<br />\nHORLICK'S MALTED MILK<br />\nORIGINAL AND ONLY GENUINE<br />\n<br />\nPure, rich milk, with the extract of malted grains,<br />\nreduced to powder form. A delicious, nourishing<br />\nfood-drink is made in a moment by merely stirring<br />\nin water. Invigorating, upbuilding, and sustaining<br />\nfor the student, lecturer, athlete, traveler, for all<br />\nages. In powder form, also in Lunch Tablet form<br />\nwith chocolate. Samples free. Always ask for<br />\n\"Horlick's\" :<br />\n:<br />\n:<br />\n:<br />\n:<br />\n.<br />\n.<br />\nHORLICK'S MALTED MILK COMPANY<br />\nRacine, Wisconsin<br />\n<br />\n\fSecond-Hand School and College Text Books<br />\nBOUGHT and SOLD AT<br />\n<br />\nSMITH'S BOOK<br />\n<br />\n830<br />\n,d<br />\n5 dN<br />\no.<br />\norHao<br />\nbw<br />\novaer,<br />\nd<br />\nma<br />\nSdtir<br />\nse<br />\noe<br />\nnt<br />\nSTORE,<br />\n<br />\nSTUDENT'S STATIONERY<br />\n<br />\nChas. E. Smith & Co.<br />\n...flotteto...<br />\nIQ*<br />\n<br />\n0:Pilic<br />\n<br />\n121 N. Liberty Street,<br />\n<br />\nBaltimore<br />\n<br />\nWM. J. MILLER<br />\nFINE JEWELRY, DIAMONDS AND WATCHES<br />\n<br />\n%<br />\n4,<br />\nT\"F<br />\n<br />\nAt<br />\n<br />\nAr4V4<br />\n<br />\nCII<br />\nCDD ANY.<br />\n<br />\nEngravings<br />\n<br />\nfor the Printer. Merchant &Manufacturer<br />\nF!tyette Streets<br />\n<br />\nC01 I los,<br />\n<br />\nrAiruf 1EP MD.<br />\n<br />\n28 East Baltimore Street<br />\nManufacturer of College Seals and Pins, College Shields<br />\nin Bronze for Wall Decoration<br />\n<br />\nPRINTING<br />\n<br />\nCt011 •<br />\n1ParTyld4cD-<br />\n<br />\n/<br />\n<br />\nr,<br />\nC POST CARO<br />\nmEE<br />\nCUTS<br />\n6\"714<br />\n\"<br />\nMmr<br />\n/Vo<br />\n\"cii\"<br />\nv aty?<br />\n'\"D;w7roGR4ptis\\<br />\n--'<br />\n<br />\nENGRAVING<br />\n<br />\nNUNN & COMPANY<br />\nBOOKSELLERS and STATIONERS<br />\n<br />\nME BEST<br />\n<br />\nOLL GE ANNUAL<br />\n<br />\nCUTS ARE<br />\n<br />\n\\In It III<br />\n<br />\nCarry a complete line of School Books and College<br />\nText Books, Miscellaneous Books, Fine Stationery,<br />\nand Students' Supplies of Every Description, together with a large assortment of<br />\n<br />\nWATERMAN'S IDEAL FOUNTAIN PENS<br />\n535 North Howard Street<br />\nBINDING<br />\n<br />\nSTATIONERY<br />\n<br />\nFOSNOT and WILLIAMS CO,<br />\nPRINTERS<br />\n<br />\nWatermark's<br />\n• Ideal tt<br />\nFountctin;<br />\nPen<br />\nI<br />\nEndorsed<br />\n<br />\n5 1 4-1 6 WEST FRANKLIN STREET<br />\nThe News-Letter, a product of our plant<br />\n<br />\nILGENFRITZ STUDIO<br />\nSuccessor to CUMMINS<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n319 North Charles Street<br />\nBALTIMORE<br />\nSpecial Discount to Students<br />\n<br />\n\"llESSONIAN<br />\n<br />\n99<br />\n<br />\n9<br />\n<br />\nA Smart Shoe for college men<br />\nwith a touch of newness that<br />\nyou'll like.<br />\n<br />\n,<br />\nTO BE OBTAINED ONLY AT<br />\n<br />\nbg,-<br />\n<br />\n(<br />\n<br />\nthe Millions<br />\nNow using them the world over<br />\n<br />\nN. HESS' SONS,8 East Baltimore Street<br />\nBOOKS! SECOND-HAND!<br />\nSchool, Medical and Miscellaneous, Bought, Sold and Exchanged<br />\n<br />\nFOR SALE<br />\nEVERYWHERE<br />\n<br />\nPIPPEN'S BOOK STORE<br />\n605 NORTH EUTAW ST.,<br />\n<br />\nNear the University<br />\n<br />\nBALTITIORE'S LAROEST OLD BOOK STORE<br />\n<br />\nNEW YORK CLOTHING HOUSE<br />\nSIS C() it 11,C0S.<br />\nFLAGS<br />\n<br />\n„at<br />\n<br />\nBANNERS<br />\n<br />\n13 WEST LEXINGTON STREET,<br />\n<br />\n•<br />\n<br />\n,)8<br />\n-<br />\n<br />\nBADGES<br />\nBALTIMORE, MD<br />\n<br />\nSMART _A\"1\"lrInE<br />\nReady-to-Wear and Made to Order<br />\nSole Agents for the Everwear Hose—guaranteed 6 months<br />\n102-104 BALTIMORE STREET, EAST<br />\n<br />\nOPPOSITE LIGHT STREET<br />\n<br />\nWhen making your purchases, kindly remember our advertisers<br />\n<br />\n\fHOPKINS--LEMMERT<br />\nBOTH STAND ON A HIGH PLANE<br />\nSTUDENTS WEARING LEMMERT<br />\nCLOTHES SET THE PACE OF<br />\nWELL-DRESSED MEN<br />\n::<br />\nOUR PRICES ARE REASONABLE<br />\nENOUGH TO PLEASE YOU :: :•<br />\n<br />\nIt's a<br />\n<br />\nFOWNES<br />\n<br />\nLEIVIMERT<br />\n<br />\nThat's all you need to know I<br />\nabout a<br />\n<br />\n10 E. FAYETTE .STREET<br />\nA.•<br />\n<br />\nGLOVE<br />\n<br />\nrrIN<br />\n.<br />\nM anufacturer of<br />\n<br />\nGreek Letter Fraternity Jewelery<br />\n213 NORTH LIBERTY STREET<br />\nPlease call and examine our line before purchasing<br />\n<br />\n\"COLLAR HUG\" CLOTHES<br />\n<br />\nThe Quality Shop<br />\n116 E. BALTIMORE STREET<br />\n<br />\nBALTIMORE<br />\n<br />\nWe have a new line of hand colored HOPKINS POSTERS<br />\nwhich are beauties.<br />\n<br />\nHOTEL CUMBERLAND<br />\n<br />\nCome in and look at our Holiday Goods. Everything for<br />\nthe College man's room.<br />\n<br />\nINEw<br />\n<br />\nHoward Novelty Company<br />\n<br />\nS. W. Corner BROADWAY AND 54th STREET<br />\n<br />\n323 N. Howard Street<br />\n<br />\nNear 50th Street Subway Station and 53rd Street<br />\n<br />\nLIMN<br />\n111M11<br />\n<br />\nMINITEKS<br />\n<br />\n-Ar<br />\n<br />\n,<br />\nOW:<br />\nOw- ---<br />\n<br />\nKept by a<br />\nCollege Man<br />\n<br />\nIdeal Location<br />\nNear Theatres<br />\nShops and<br />\nCentral Park<br />\n<br />\nWEBSTER'S<br />\n<br />\nINTERNATIONAL<br />\n<br />\nGRAND PRIZE WORLD'SE411t,StLouis<br />\n<br />\nDICTIONARY<br />\n<br />\nRECENTLY ADDED,25,000 NEW WORDS & PHRASES<br />\n<br />\nHeadquarters<br />\nfor College<br />\nMen<br />\n<br />\nNew, Modern<br />\nand<br />\nAbsolutely<br />\nFireproof<br />\n<br />\nNew Gazetteer of the World 2380 Quarto Pages New Biographical Dictionary<br />\n1:ditor in Chief, W.T. HARRIS,<br />\n1.S. C ,u.. of Education.<br />\nChief.)notice FULLER. U. M. Mupreme ('mart, ti:\"s: I regard the<br />\nInternational as of the utmost ,alue In accuracy of definition, and hair fount it in all<br />\nrespects complete and thorough,<br />\n.<br />\n--<br />\n<br />\nAlso. Webster s Collegiate Dictionary<br />\n<br />\nLatest and Largest Abridgment of the International. Two Editions. ©<br />\nFREE,\"Dictionary Wrinkles.\" Also illustrated pamphlets.<br />\n<br />\nG. G C. MERRIAM CO.. Springfield. Mass..<br />\nGET THE BEST<br />\n-x•<br />\n<br />\nPURNELL ART CO.<br />\n224 NORTH HOWARD SIRE!'\"<br />\nIMPORTERS AND DEALERS<br />\n<br />\nSpecial Terms<br />\nfor College<br />\nTeams<br />\n<br />\nAll Outside<br />\nRooms<br />\n<br />\nTRANSIENT RATES (with BATH), $2.50 and up<br />\nSEND FOR<br />\n<br />\nFINE ARTS<br />\nPictures Framed Correctly and Promptly at Moderate Prices<br />\nfr<br />\n<br />\nMost, Attractive Hotel in<br />\nNew York<br />\n<br />\nvs\" rnh ea.lacs.<br />\n<br />\nBOOKLET<br />\n<br />\nHARRY P. STIMSON<br />\n<br />\nR. J. BINGHAM<br />\n<br />\nFormerly with Hotel Imperial<br />\n<br />\nFormerly with Hotel Woodward<br />\n<br />\n\f", "format": "basic_html", "processed": "FORCNIIMIVEZMIIIM<br /><br />\n`2140.0R<br /><br />\nTHE•JOHNS•HOPKINS-UNIVERSITY<br />\nBALTIMORE<br /><br />\nThe Johns Hopkins University.<br />\nBALTIMORE, MD.<br /><br />\nThirty-Third Year.<br /><br />\nThe Johns Hopkins Press.<br />\nI.<br /><br />\nBeginning October 1, 1908.<br />\n11.<br /><br />\nIRA REMSEN, President.<br />\nEDWARD H. GRIFFIN,<br />\n;Dean of the College Faculty.<br />\nWILLIAM H. HOWELL,<br />\nDean of the Medical Faculty.<br /><br />\nIII.<br /><br />\nINSTRUCTION.<br />\nIV.<br /><br />\nFor Graduate Students:<br />\nIn Philosophy and the Arts. (Courses for<br />\ncandidates for the degrees of Ph. D.,and A.M.)<br />\nIn Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br /><br />\n(a)<br />\n(b)<br /><br />\nV.<br />\nVI.<br /><br />\nFor Undergraduates:<br />\n(c)<br />\n(d)<br /><br />\nAs candidates for the degree of B. A.<br />\nAs special students.<br /><br />\nVII.<br /><br />\nVIII.<br /><br />\nLibraries.<br />\n136,00o volumes<br />\n164,000 volumes<br />\n260,000 volumes<br /><br />\nUniversity<br />\nPeabody Institute.<br />\nPratt Library.<br />\nLaboratories.<br /><br />\nDirectors.<br /><br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nBotany<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nExperimental Psychology.<br /><br />\nIra Remsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nD. S. Johnson<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nJohn B. Watson<br /><br />\nSeminaries.<br /><br />\nDirectors.<br /><br />\nIX.<br />\nX.<br /><br />\nXI.<br /><br />\nX11.<br /><br />\nX111.<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\nHistory.<br />\nPolitical Economy.<br />\nPolitical Science.<br />\nPhilosophy.<br />\nMathematics.<br />\nPhysics.<br /><br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn Al. Vincent.<br />\nC iW. Andrews.<br />\nI-I. Hollander.<br />\nW. W. Willoughby.<br />\nJ. Mark Baldwin.<br />\nFrank Morley.<br />\nJoseph 6. Ames.<br /><br />\nUndergraduate Courses (leading to B. A.)<br />\n.<br />\n2.<br />\n3.<br />\n4.<br />\n5.<br /><br />\nGROUPS.<br />\nAncient Languages.<br />\nModern Languages.<br />\nHistory and Political Economy.<br />\nMathematics and Physics.<br />\nChemistry, Biology and Geology.<br />\nSerial Publications.<br /><br />\nAmerican Journal of Mathematics (vol. XXX).<br />\nAmerican Chemical Journal (vol. XL).<br />\nAmerical Journal of Philology (vol. XXIX).<br />\nStudies in Historical and Political Science (vol. XXVI).<br />\nModern Language Notes (vol. XXIII).<br />\nMemoirs from the Biological Laboratory (vol. VI).<br />\nContributions to Assyriology (vol. VI).<br />\nTerrestrial Magnetism (vol. XIII).<br />\nUniversity Circular (vol. XXVII).<br />\nProgrammes of the courses offered ito graduate students<br />\nin Philosophy and the Arts and in Medicine, and also of<br />\nthe undergraduate courses, may be obtained on application<br />\nto the Registrar.<br /><br />\nXIV.<br /><br />\nXV.<br /><br />\nXVI.<br /><br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume<br />\nXXX in progress. $5 per volume. (Foreign<br />\npostage 50 cents).<br />\nAmerican Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume<br />\nXL in progress. $s per volume. (Foreign<br />\npostage 50 cents).<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo.<br />\nVolume XXIX in progress. $3 per volume.<br />\n(Foreign postage 50 cents).<br />\nStudies in Historical and Political Science.<br />\nMonthly. 8vo. Series XXVI in progress. $3 per<br />\nvolume. (Foreign postage 50 cents).<br />\nJohns Hopkins University Circular.<br />\n8vo. Volume XXVII in progress. $1 per year.<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4to.<br />\nVolume XIX in progress. $2 per year. (Foreign<br />\npostage so cents).<br />\nJohns Hopkins Hospital Reports. 4to. Volume<br />\nXV in progress. f5 per volume. (Foreign postage 50 cents).<br />\nContributions to Assyriology and Semitic Philology (Beitrage zur Assyriologie, etc.) PAUL<br />\nHAUP f and FRIEDRICH DELITZSCH, Editors. Volume VI in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume VI in progress.<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXXIII in progress. $1.50 per volume. (Foreign<br />\npostage 25 cents).<br />\nAmerican Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 8vo. $5<br />\nper volume.<br />\nTerrestrial Magnetism and Atmospheric Electricity. L. A. BAUER, Editor. Quarterly. 8vo.<br />\nVolume XIII in progress. $2.50 per volume.<br />\n(Foreign postage 25 cents).<br />\nReprint of Economic Tracts.<br />\nJ. H. HOLLANDER, Editor. First Series and<br />\nSecond Series, $5. Third Series in progress, $1.<br />\nAnnual Report.<br />\nPresented by the President to the Board of Trustees,<br />\nreviewing the operations of the University during<br />\nthe past academic year.<br />\nAnnual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published<br />\nat the close of the academic year.<br />\nReports of the Maryland Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br /><br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\nThe Critical Edition of the Hebrew Text of the Old Testament. Edited by Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum. ro<br />\nplates. $25.<br />\nSelections from the Early Scottish Poets. By William<br />\nHand Browne. 240 pages. $1.25.<br />\nStudies in Honor of Professor Gildersleeve. 527 pages,<br />\noctavo. $6.<br />\nThe Taill of Rauf Coilyear. Edited by William Hand<br />\nBrowne. 164 pages. $1.<br />\nPoe= de Fernan Goncalez. Edited by C. Carroll Marden.<br />\n282 pages. $2.50.<br />\nBaltimore Lectures on Molecular Dynamics and the Wave<br />\nTheory of Light. By Lord Kelvin. 716 pages. $4.50.<br />\nThe Oyster. By W. K. Brooks. 226 pages. $1.<br />\nEcclesiastes: A New Metrical Translation. By Paul Haupt.<br />\n50 pages. 50 cents.<br />\nThe Book of Nahum: A New Metrical Translation. By<br />\nPaul Haupt. 53 pages. 50 cents.<br />\nAncient Sinope. By David M. Robinson. 112 pages. $r.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances<br />\nmay be sent to the Johns Hopkins Press Baltimore, Md.<br /><br />\n4<br /><br />\n1irNriu,9-iCrtirr.<br />\nDECEMBER 18, 1908.<br /><br />\nVOL. XIII.<br />\nSubscriptions, $r.5o per year.<br /><br />\nPublished Fortnightly by the Undergraduates.<br /><br />\nBOARD<br /><br />\nOF<br /><br />\nNo. 5<br />\nlo Cents per copy<br /><br />\nEDITORS.<br /><br />\nFranklin B. Pedrick, 1909, Editor-in-Chief.<br />\nWalter V. Johnson, 1909, Athletic Editor.<br />\nGeorge W. Corner, 3d, 1909, Ass't Editor-in-Chief.<br />\nHertel<br />\nP. Makel, 1911, Business Manager.<br />\nNews<br />\nEditor.<br />\nJ. Hamilton Owens, 19o9,<br />\nE.<br />\nD.<br />\nMartin,<br />\n1911, Ass't News Editors.<br />\n1910<br />\nand<br />\nAlan C. Woods, i9to; G. Ross Veazey,<br />\nAddress all articles, communications, etc., to Franklin B. Pedrick, Box 486, Johns Hopkins University,<br />\nBaltimore, Md.<br />\nSubscriptions and business<br />\nUniversity, Baltimore, Md.<br /><br />\ncommunications should be sent to H. P. Makel, Johns Hopkins<br /><br />\nEDITORIAL.<br />\n1..1,•----<br /><br />\nT is with much regret that we call attention to the fact that there has<br />\nbeen a great breach of class etiquette. This year the Sophomore Class<br />\n•<br />\nhas beert holding its meetings in the Trophy Room. Now,the Trophy<br />\ntt<br />\nZr\" :s<br />\nRoom has heretofore been the sacred property of the upper classes.<br />\nIt<br />\nf:. i:<br />\n31<br />\nit<br />\nIt is a lounging room for the Seniors and Juniors only. Aside from<br />\n11,,•,:. ::<br />\ng<br />\nthis, it is the privilege of the athletic teams, of the musical clubs and<br />\nof the Cotillon Club to hold its meetings in the Trophy Room; but<br />\n• n n g n_ I: n n n n g n —<br />\nthis privilege never has and never will be extended to the under<br />\nclasses. We know of no other organization besides those mentioned<br />\nA 129V„.<br />\nthat has the right to monopolize the Trophy Room. We do not know<br />\nwhether the fault lies with the Senior Class or with the Sophomore Class. It may be that the<br />\nSophomore President does not know that it is entirely contrary to custom for either of the<br />\nunder classes—Sophomore and Freshman—to hOld class meetings in the Trophy Room. Now<br />\nthat he has been enlightened upon the subject, we hope that neither he nor any of the other underclassmen will break this Unwritten Law. We feel that this word will be sufficient, and hope<br />\nthat it will not be necessary for the Senior Class to take any steps in the matter.<br />\ne<br /><br />\n.<br />\n.<br />\n34 11<br />\n-v--ig<br /><br />\n_0_<br />\n101,--1304 E have received an arti.:le in regard to the proposed Inter-Fraternity<br />\n'1---P,011<br />\n•4,\\i<br />\nTreaty, but, since it was not signed, we have not published it. If the<br />\nwrigrrinnfrry .<br />\nauthor is willing to sign his name to it, we shall be very glad to publish<br />\nr 1 it in our next issue ; otherwise, we shall have to decline to do so. The<br />\ngrAr<br />\n1r •<br />\n-•<br />\nThe NEWS-LETTER takes this opportunity to say that the Board of Ed•<br />\nitors, as a whole, is not promoting the scheme for this Inter-Fraternity<br />\nV<br />\n✓<br />\nTreaty. It has probably been noticed that we have published two let\". rrwitifsrywrsters by two of our editors, one for and one against the Treaty, which<br />\ncolumn. The Treaty, as it was published, was<br />\now v virwv,17... - was proposed in our<br />\ncompiled not by the entire Board of Editors, but by Mr. Veazey, one of<br />\nour Assistant News Editors. We stated that. we should gladly publish all letters, either for or<br />\nagainst the proposed Treaty, unless, of course, they should take up too much of our columns.<br />\nThese letters should, however, be signed by the author.<br /><br />\nk<br /><br />\nTHE NEWS-LETTER.<br /><br />\nrf. -<br /><br />\n-1_,z6:4 21 x<br /><br />\nHE organizers of the Haresfoot Club, as the new dramatic society is to be called, chose a particularly happy moment to launch their<br />\ng T: g g g g g g TS<br />\nu<br />\nventure. The Paint and Powder Club, which in previous years has out2/<br />\ng<br />\ng<br />\nshone, and deservedly, all other local organizations of a similar character,<br />\n• It<br />\ng<br />\nhas decided to forego a production this year. There is no good reason<br />\nIt<br />\nwhy the support of the prominent people of the city should not be given<br />\nn<br />\nn<br />\nto the new organization instead; its members are fairly well known and<br />\n• nnnunungis<br />\nits constitution provides for an equal distribution of its earnings between<br />\ng<br />\nIt i<br />\n•<br />\nthe Homewood Building Fund and some worthy lo,cal charity. There<br />\n31, 31z<br />\nhas been a need for an association of this kind at the University for a<br />\nlong time. The man to whom athletics do not appeal, and who can't sing, has had heretofore<br />\nno outlet for his superfluous energy. Here is a place where he can at least try to shine. Let's<br />\nhope he does.<br />\n:Aqi g<br />\nn O'g<br />\nx<br /><br />\n0,<br /><br />\n:I. ,<br /><br />\nHE appreciation shown on the part of the public for. Dr. Henderson's recent lectures has clearly demonstrated the interest in historical subjects<br />\namong both scholars and the laity. Dr. Henderson's feeling for the sub.6„.<br />\n.v<br />\nv *k, ject, his personal magnetism and the clearness of his thoughts have all<br />\nv •<br />\ntended to arouse this interest. His lectures are over, but there are yet<br />\nkv<br />\nv<br />\nvast fields in history of absorbing interest, both to the public and the<br />\nv 4-v<br />\nlo<br />\nstudents.<br />\n• vrirv*vv**<br />\nAt a recent meeting of the Senior. Class of the University the sub4._ wi<br />\nriti 4, ject was discussed and resolutions were adopted requesting Dr. Chas.<br />\n,<br />\nOF 1FZ<br />\nM. Andrews, professor of history of the University, to deliver a series<br />\nof public lectures upon some subjects of historical interest, to be chosen by himself. Those<br />\nof the University who have had the opportunity of taking a course under Dr. Andrews know<br />\nwhat a pleasure his lectures are. His ability as a lecturer is widely known, and a series of lectures delivered by him upon any subject he might select would meet with instantaneous response by the public. We have been selfish enough in the past to keep Dr. Andrews' lectures<br />\nall to ourselves, and to the few adventurous spirits who may happen to drop in among the students, but now there is a broader field, and we can only hope that Dr. Andrews will see his<br />\nway clear to respond to the request of the Senior Class with a series of public lectures.<br />\nnr—O-Iv vg-r<br />\n„,,,,. zlir vvyvylir .<br /><br />\n•-•<br /><br />\n'• IF<br />\nVIF<br /><br />\ny<br />\ny 4,.<br />\n*<br /><br />\nAs announced a month ago, TIIE NEWS-LETTER Board has decided to award a prize for<br />\nthe best design for a new cover for the paper. The time limit is now up, but we have decided to extend it until Monday, January 4th, as only a few designs have been handed in. The<br />\nconditions of the contest will be found in the second number previous to this.<br /><br />\nThe Board of THE NEWS-LETTER takes great pleasure in announcing the election to the<br />\nstaff of Mr. Nathan Williams Haynes, 1912. Mr. Haynes will take the position of Assistant Athletic Editor. Mr. Haynes is the first member of the Freshman Class to be elected to an office on<br />\nTHE NEWS-LETTER, but we expect to elect one more Freshman this year.<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br /><br />\nvolumes which found a speedy and a fitting<br />\nend in the fish markets and grocery shops of<br />\nancient Rome. And as it has been, so it doubtWILFRED P. MUSTARD.<br />\nless shall be. You will be tempted by the adOne of the great temptations of life is the vertising of the publishers, and by the convertemptation to waste our time, and one of the sation of your friends, to turn at once to the<br />\nmost persistent forms of this temptation comes popular book of the month or of the season.<br />\nto us in the shape of trivial books and papers But even the great book of the year should<br />\nand magazines. To be sure, a large part of not be allowed to interrupt a man if it finds<br />\nour population desires nothing better, is not ca- him seriously engaged with some standard<br />\npable of appreciating anything better; but I am volume. If it is a good book, it can afford to<br />\nspeaking to a privileged class. And yet even wait its turn, and it may be available a little<br />\nmen who have been trained to know the good later. If it is not available a little later, you<br />\nare constantly exposed to what is cheap and will not have lost much by waiting.<br />\nvulgar and superficial. And even when we<br />\nAnd not only should you feel that your first<br />\ntry to read something better, our efforts are duty is to the great standard books, but your<br />\napt to be very brief and desultory and irregu- reading should be done according to some defilar. But why waste our time on purely trivial nite plan and system. Don't skip about from<br />\nand ephemeral stuff, when the great books of one subject or one department to another, but.<br />\nthe world stand about us waiting to be read? follow some definite course in one subject or<br />\nThe blessing of the printing-press is not an one department at a time. If a man is interunmixed blessing—has never been an unmixed ested in history—and every scholar should be<br />\nblessing—and when I see the kind of stuff that interested in history—let him take one period<br />\nfloods our news stands and book stores, and or one people at a time, and read the great<br />\neven our libraries, I sometimes think of old Sir books on his subject. I mean such books—to<br />\nThomas Browne and of his wish, \"that there speak only of Roman history—as Mommsen<br />\nwere a general synod—not to unite the incom- and Merivale and Gibbon. If a man cares for<br />\npatible difference of religion, but for the ben- epic poetry, let him read some of the great<br />\nefit of learning, to reduce it as it lay at first, in epics of the world—Homer, for example, and<br />\na few and solid authors, and to condemn to the Virgil, and Dante, and Milton—read them confire those swarms and millions of rhapsodies, tinuously, if possible, and in long stretches,<br />\nbegotten only to distract and abuse the weaker not a few lines or a few books at a time. We<br />\njudgments of scholars, and to maintain the all believe that \"Paradise Lost\" is one of the<br />\ntrade and mystery of typographers.\"<br />\ngreat poems of our language; but how few of<br />\nI receive circular announcements almost us ever read the poem from beginning to end,<br />\nevery week that some unknown or unimportant and try to see its purpose as a whole. And<br />\nperson has written quite the strongest thing he how few of us ever take the time to read<br />\nhas yet produced, or that someone has written through one of Milton's great classical models,<br />\nwhat promises to be the book of the year. Per- which are, after all, the best, if not the only,<br />\nhaps he has; I always hope he has. But why explanation of his methods and of his art. And<br />\nshould the scholar rush off to examine the as it is with history and with epic poetry, so<br />\nclaims of every blatant publisher who caters to with every other subject and every other dethe tastes of the multitude? And why should partment, for the only way to gain command<br />\nhe neglect the great books of his race for sake of any important subject, to get a proper idea<br />\nof some book which counts in advance on only of any single department, is by systematic<br />\na few months, or a few weeks, of life? Mac- study.<br />\nAnd I hope I shall not be suspected of proaulay was once moved to moralize on the wellpuffed novels which served to hold the pastry fessional bias in the matter if I add that most<br />\nor line the trunks of the following year. And subjects should be studied historically, and that<br />\nlong before Macaulay wrote his sentence about in almost every case it is well to begin with the<br />\nthe trunk-makers and pastry-cooks of London, ancient authors and the ancient models. The<br />\nCatullus and Horace had spoken of similar study of ancient history is necessary to the tinTHE SYSTEMATIC READING OF THE<br />\nBEST BOOKS.<br /><br />\nTHE NEWS-LETTER.<br /><br />\nderstanding of modern institutions and modern<br />\nlife: the study of Greek philosophy is the best<br />\npreparation for the study of our modern systems, and some knowledge of Greek and Roman literature is necessary for the full appreciation cf much of our highest English poetry.<br />\nFor the art and culture of ancient Greece are<br />\nstill among the richest parts of our inheritance.<br />\nAnd, as Mr. Lowell once said on a notable occasion, \"The garners of Sicily are empty now,<br />\nbut the bees from all climes still fetch honey<br />\nfrom the tiny garden plot of Theocritus. On<br />\na map of the world you may cover Judea with<br />\nyour thumb, Athens with a finger tip, and<br />\nneither of them figures in the Prices-Current;<br />\nbut they still lord it in the thought and action<br />\nof every civilized man.\"<br /><br />\nTHE PITIFUL COMPLAINT OF THE<br />\nPOOR HOPKINS STUDENT.<br />\n1.<br />\nLast Saturday night at eleven o'clock<br />\nI looked in my purse—and, oh! what a shock!<br />\nNot a nickel I found to pay my car-fare<br />\n(At seven o'clock five dollars was there).<br />\nI searched, but in vain, and one word I spoke—<br />\n\"Broke\"<br /><br />\nChances in raffles I'd bought, six or seven;<br />\nThe girls crowded round me, I thought it was<br />\nheaven;<br />\nBut rallies cost money, I learnt to my cost;<br />\nDeparted five dollars—gone—thrown away—<br />\nlost!<br />\nBut one word I have, and oft be it spoke—<br />\n\"Broke !\"<br /><br />\nNo Christmas for me, and no gifts to my<br />\nfriends;<br />\nThank goodness, it's over now—everything<br />\nends—<br />\nThe Cosmovilla is only a thing of the past,<br />\nBut my busted condition a long time will last.<br />\nFor many a month I'll continue to croak:<br />\n\"Broke !\"<br />\nS. C. C., who has suffered.<br /><br />\n5<br /><br />\nLIFE IN MUNICH.<br />\nMr. H. J. Hughes, 'oS, who, since graduation, has been studying at Munich, wrote the<br />\nfollowing letter to his parents, little thinking<br />\nthat it would ever be published in the NEWSLETTER. A member of the University, however, was present when it was received, and<br />\nrequested that he be allowed to publish it in<br />\nTHE NEWS-LETTER.<br />\nDEAR FOLKS:<br />\nThe University is now in full swing. I have<br />\njust come from paying my 68M. tuition fee,<br />\nand I suppose that is the first step toward<br />\nmaking me a full-fledged student. The work<br />\nis still hard. I mean, to understand the teachers. Many parts of the lectures are now lost<br />\non me, yet I hope that, as I become acquainted<br />\nwith the professors' style of talking and my<br />\nvocabulary grows, this difficulty will be overcome. I decided to give up one of the courses<br />\nI wanted to take. At least, to postpone it until<br />\nnext semester. You see, everything here goes<br />\nby semesters. The University closes about<br />\nMarch 15 for a month. All the courses end<br />\nthen. When they are resumed again in April,<br />\nit is as if the University were starting anew.<br />\nThe German student never stays at one university for his four years' work. He goes to<br />\nat least four different ones. Here a semester,<br />\nthere a semester, usually remaining four terms<br />\nat that university from which he wishes his degree. There are no examinations—you simply<br />\nstudy for four years, and at the end of that<br />\nPeriod take a final examination, which, if<br />\npassed, makes you a doctor of medicine, or<br />\nwhatever other branch you may have passed.<br />\nAs it is, I have 17 hours of lectures, three each<br />\nday and two on Saturday. The course I<br />\ndropped was an excellent one, given by one of<br />\nthe foremost men in Germany, Dr. Brentano.<br />\nThe courses I am taking will, I believe, prepare me in German for the real work next<br />\nyear. As I have to do my reading with a dictionary, it goes slowly, especially as the subjects contain many words one never meets in<br />\nordinary reading.<br />\nThe praiseworthy characteristic of the University, and of all German universities, in fact,<br />\nis that the student is not placed under an instructor with little experience in teaching. The<br />\nmen here are, as a general rule, old men. Each<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br /><br />\nman has made a name for himself by his research work, his works published and his record at the university from which he was called<br />\nto fill the chair at Munich. The man who<br />\ngives the general world history is private advisor to the Prince Regent of Bavaria. One<br />\nof George's (George Abel, 'o8) professors is<br />\nthe most celebrated man in the world in physics, Dr. Roentgen. And so it goes, each man<br />\na \"star,\" an authority in himself, whose books<br />\nare well known in university circles. That<br />\nseems to be the road to fame--the publication<br />\nof books.<br />\nAs forlorn and dreary looking as is the old<br />\npart of the University, just so wonderfully<br />\nbeautiful is the new. I really seem to be wandering in a palace in fairy land, when I recollect it is only a university, and not a kingly<br />\npalace. The halls are immense and wide, with<br />\nmosaic floors. The staircases and doorways<br />\nare of beautiful Circassian marble. Over all<br />\nare exquisite mosaics, beautiful fountains and<br />\nelectric light brackets of beaten iron. At the<br />\nbottom of the main staircase is an immense<br />\nopen space, softly lighted from the dome<br />\nabove. The main hall seats 1,200 people. It<br />\nis in brown and white, with a wonderful skylight of stained glass and heavy mahogany<br />\ndoor with a gold pattern. In the class rooms<br />\nare hardwood floors, soft cream-colored curtains with green borders, and one sees everywhere in the corridors and rooms excellent<br />\ntaste in the selection of the furnishings. The<br />\ndoors are of frosted glass with wood pattern.<br />\nThey have any number of rooms seating 200,<br />\nthe seats being arranged as in a theatre. Never<br />\ndid I imagine a university could be so lavishly<br />\nbuilt.<br />\n(To be continued.)<br /><br />\nSAMMY'S \"SCOOP.\"<br />\ncraziest looking little chap in<br />\nthe<br />\nwas<br />\nHe<br />\nthe world; pug-nosed, red-headed, freckledface, and about as big as a minute, when he<br />\ngot his job as night-boy on the Daily Blab.<br />\nHe was, however, always cheerful and willing, and his funny little face wore \"a smile<br />\nthat won't come off.\" His queer looks, droll<br />\nsayings and everlasting good nature made him<br />\na prime favorite and we all forgot how \"unbeautiful\" he was. Before he had been in<br /><br />\nthe office a week he wormed his way into<br />\neveryone's heart from old \"Pop Fitch,\" the<br />\nManaging Editor, down to the telegraph<br />\noperators. He was an encyclopedia of crime<br />\nand sport and the boys soon learned to use<br />\nhim as a reference book on these subjects. He<br />\ncould tell you as much about any murderer or<br />\nconfidence game, baseball player or racehorse as you would find in an hour's hunt<br />\nanywhere else. He had a vocabulary of<br />\noriginal and selected slang that would turn<br />\nBilly Baxter in his grave and drive \"The<br />\nChorus Lady\" to drink, could they have<br />\nheard him. Each day the Giants were \"at<br />\nhome\" he would be there, for working at<br />\nnight gave him the afternoons free unless he<br />\nslept, but sleep with ball game on. His<br />\nquaint descriptions of plays that won and lost<br />\ngames up at the Polo Grounds, his scalding<br />\ncriticisms of the players, his slangy similies<br />\ncrept into the Blab so often that the paper be-<br /><br />\ncame famous for its -basball news and Alf<br />\nMacy, who was doing that stuff those days,<br />\nwon a reputation as a wit.<br />\nFor three years Sammy worked in the<br />\neditorial rooms, carrying copy, going out for<br />\nthe men's midnight lunches, and doing other<br />\nodd jobs. Then there happened one of those<br />\nunexpected things, which are always bobbing<br />\nup in a newspaper office and which make<br />\njournalism the most fascinating game in the<br />\nworld. The Typographical Union gave a<br />\npicnic and that evening only about half our<br />\npressmen and stereotypers reported; the rest<br />\nwere recovering from the entertainment. The<br />\nforeman of the press-room found his force so<br />\nshort that unless he could get a couple of men<br />\nsomewhere he would not be able to run the<br />\npresses. He went up to the composing-room,<br />\nbut there they needed all their men on the<br />\nlinotype machines. Then he came to the<br />\neditorial-rooms.<br />\n\"There's Sammy. Will he do?\" was the<br />\nanswer he received.<br />\n\"He'll do,\" said the foreman and so Sammy<br />\nwent down stairs for the first time,<br />\nThe three years Sammy had worked for The<br />\nBlab had made a great change in the boy. In<br />\nspite of the hard night hours he had grown<br />\nlike a weed, and if he was not handsome—<br />\nwell you could look at him without laughing:<br />\na metamorphosis that was little short of a<br /><br />\nTHE NEWS-LETTER.<br /><br />\n7<br /><br />\nmiracle. However great his physical trans- an' go an' snitch. He'll show up tomorrow,<br />\nformation had been, he had not changed but what can one kid do?\"<br />\nmentally. He was still the good-natured,<br />\nWhile the others were washing up, Sammy<br />\nwilling Sammy who doted on murders and slipped out and went home, thinking all the<br />\nbaseball. He was a high favorite in the edi- while what one kid could do to beat the<br />\ntorial rooms and the next night there was stereotypers at their own game. The dramuch talking when it was announced that he matic instinct was strong in this little redwas to stay down stairs, and some of us even headed chap, and he knew that the more senwent down to the press room to try to per- sational his rescue, the greater his reward.<br />\nsuade him to return. He only laughed and Finally he hit upon a scheme that was both<br />\nsaid he was going to try it for a while.<br />\nsure of success and dramatic enough for his<br />\nHe tried it and liked it and stayed in the morbid tastes. He had heard that the union<br />\npress room. By dint of hard labor he worked had played the striking stereotypers false and<br />\nhis way from 'fly boy\" to assistant pressman, that they had been around to the office asking<br />\nand what he did not know about a press was to be taken back. This was the inspiration<br />\nnot worth knowing. The same qualities of Sammy's plan. When he got home he<br />\nwhich made him so popular with editors and left a note on the kitchen table asking his<br />\nreporters stood him in good stead among the mother to call him at noon and went off to<br />\nbig ink-stained pressmen. Moreover his capa- bed to sleep, as if strikes were the last thing<br />\nbility for hard work, which had never been in the world. All the afternoon he intertested upstairs, now began to show itself, and viewed the old stereotypers. To each he exthis with his natural quickness made him one plained that the new men were going out and<br />\nof the best men on the presses.<br />\ntold them to meet him that night and he<br />\nSuddenly, another of those unexpected would guarantee their jobs.<br />\nthings happened. The Blab was running an<br />\nopen non-union shop, but the union, by<br />\npromises of rewards and new jobs, got the<br />\nstereotypers to join their ranks. Accordingly,<br />\none fine evening not a man of the stereotyping<br />\ndepartment came to work. By a series of<br />\nmake-shifts and unheard of changes the office<br />\nscraped together enough men and one of the<br />\npressmen, who had done some stereotyping,<br />\nshowed them how and we got out a paper, a<br />\nvery rocky paper, and minus two editions, but<br />\nnevertheless a paper. One of the men taken<br />\nfrom the presses to help make the stereotyping<br />\nforce was Sammy, and next day when they<br />\ngot some more stereotypers he again changed<br />\nhis job, for he stayed in that department.<br />\nSammy had been with the stereotypers<br />\nabout a month and learned to \"shave\" and<br />\n\"clean up\" plates, when one day he was<br />\nstanding behind the open door of his locker<br />\nand heard the foreman say to one of his men:<br />\n\"So you don't think it's no use to try<br />\nSammy.\"<br />\n\"Naw,\" answered the other, \"he's strong<br />\nfor the paper, and I'm sure you can't get<br />\nhim to come out with us. If we sound him,<br />\nhe's just wise enough to tumble to the game<br /><br />\nThat evening the night door clerk was<br />\nthunderstruck to see Sammy walking at the<br />\nhead of the old stereotyping force. They got<br />\nout the paper, and it was not short a single<br />\ncopy. Sammy had his pay doubled, and he<br />\ndeserved it, as the press-room foreman said,<br />\n\"We couldn't have even gotten out one of<br />\nthose rocky, no-mail edition papers.\"<br />\nAll this was three years ago, and Sammy<br />\nis now foreman of the stereotyping department, and if some day word is passed round<br />\nthe office that there is a new manager of the<br />\nmechanical departments, most of us will be<br />\nwilling to bet pretty high stakes that his<br />\nname is Sammy, or rather, Mr. Samuel<br />\nMorgan.<br />\nH.<br /><br />\nAnd thus the humblest of the learned throng<br />\nGains deepest knowledge of this earth of<br />\nours:<br />\nThe pilgrims on the path most lone and long<br />\nShall reach the coolest shade and sweetest<br />\nflowers;<br />\nAnd he who out of weakness is made strong<br />\nHath leagued himself with the eternal<br />\npowers.—REGINALD A. BECKETT.<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nTHE HARESFOOT CLUB.<br /><br />\nLACROSSE.<br />\nEditor News Letter—<br />\nNo article has as yet appeared in THE<br />\nNEWS-LETTER concerning lacrosse. It is most<br />\nnatural that this spring sport should be kept in<br />\nthe background during the football season, but<br />\nnow that our gridiron warriors have completed<br />\ntheir glorious and most successful season, the<br />\ntime has come when we should look forward<br />\nto achieving fresh laurels for Hopkins.<br />\nThere are a number of men in this University who desire to become athletes, but who<br />\nmodestly imagine they lack the talent. It is to<br />\nsuch men that lacrosse offers a salvation. Diligent practice, coupled with a little coaching,<br />\nmakes the expert. There is no excess training<br />\nrequired nor any particular response; only<br />\nsteady work and a willing spirit.<br />\nIt seems to be the general opinion of the<br />\nfellows that there are but very few positions<br />\non the team open this year. Such a report is<br />\nunfounded and wholly false. The veterans at<br />\nthe Medical School are very uncertain in attendance, and at best cannot in any sense be<br />\nrelied upon to fill their positions next spring.<br />\nJust recently one was taken seriously ill with<br />\ntyphoid, while another is to leave for Europe in<br />\nApril, thus incapacitating two of our best men.<br />\nThe loss of these, together with the absence of<br />\nMeyers, Blanck, Armstrong, k. Williams and<br />\nMathias, who have left the University, will<br />\nmake it necessary to develop material for the<br />\ncoming season.<br />\nThe squad has already been called out, and<br />\nis hard at work to establish a new record by<br />\nwinning the fourth consecutive inter-collegiate<br />\nchampionship of the United States.<br />\nBesides, there is coming the series of class<br />\ngames. So beware, Sophomores and Freshmen! Look to your laurels. Buy a stick—get<br />\nbusy—talk and play lacrosse.<br /><br />\nCAPTAIN H. S. FRANK.<br /><br />\nOn Monday night, December 7, a meeting<br />\nof the Dramatic Club was held. A constitution was adopted and the following officers<br />\nwere elected:<br />\nPresident—Mr. Hamilton Owens, 19o9.<br />\nVice-President—Mr. Alan C. Woods, 1910.<br />\nTreasurer—Mr. W. Howard Michael, 1909.<br />\nSecretary—A Ir. Benjamin Weems, 1909.<br />\nStage Manager—Mr. Williams Haynes,<br /><br />\n1912.<br />\nThese, with Messrs. Stollenwerck and Pedrick, make up the executative committee. It<br />\nwas decided to call the club \"The Haresfoot<br />\nClub.\"<br />\nPlans were discussed and it was decided to<br />\npresent some farce, to be chosen by the executative committee, next February. A more definite announcement, plans, dates and trips will<br />\nbe made later. Membership is subject to election by the executative committee, of which<br />\nMr. Woods is chairman and Mr. Weems secretary.<br /><br />\nTHE FOOTBALL BLOWOUT.<br />\nThe football blowout, held in the Cage on<br />\nSaturday night, December 12, proved to be enjoyable in a slap-stick sort of way to the undergraduates, who were present almost to a<br />\nman.<br />\nBesides speeches by Dr. Renouf, who presented the \"H's,\" and Captain Stockton and<br />\nManager Bally, and the usual tug of war, there<br />\nwas a boxing match between Lawton and<br />\nBeehler, both '12. Neither men knew much<br />\nabout the game, but they made up in speed<br />\nwhat they lacked in science, and for the two<br />\nrounds they went they mixed things up some.<br />\nThe musical end was attended to by three<br />\n-gentlemen of culloh,\" who, backed up by a<br />\nbanjo and a guitar, succeeded in stirring up the<br />\nechoes in the cage by means of their powerful<br />\nlungs. \"Mistah Thomas,\" one of the three,<br />\nwas undoubtedly some pumpkins in the buck<br />\ndancing line.<br />\nThe .feed that followed was up to the standard set by the rest of the show, and one of the<br />\nFreshmen was heard to say after the lights<br />\nhad been put out that he had eaten \"four<br />\nblocks:'<br /><br />\nTHE NEWS-LETTER.<br /><br />\n9<br /><br />\naibUfSNMI<br />\nHOPKINS INDOOR MEET.<br /><br />\nA<br /><br />\nThe track team management has again secured the use of the Fifth Regiment Armory<br />\nfor an indoor athletic meet. This event, which<br />\nbrings to Baltimore the best college track and<br />\nfield men of any meet held here, will be held<br />\nSaturday evening, January 3oth. Some exceptional relay races will be run, for, according<br />\nto our usual custom, we will have a mile race<br />\nwith the University of Virginia, and invitations have been sent to Princeton and Columbia<br />\nto run teams in the four-mile event, where<br />\nHopkins will also be represented.<br />\nManagers Stewart, Wolfe and Glanzer are<br />\nworking hard for the success of this meet,<br />\nwhich will be run, as all Hopkins track meets,<br />\nin a business-like way, with no long \"stage<br />\nwaits\" to tire the spectators and with ideal conditions for the contestants. As usual, a Games<br />\nCommittee will be appointed to assist in this<br />\nwork.<br />\nThe program includes open-to-all events in<br />\nthe too and 220-yard dashes, 44o, 88o, and mile<br />\nruns, the high and broad jumps, and the pole<br />\nvault. There will also be a 100-yard dash and<br />\n440-yard run, open to schoolboys, and a 220<br />\nfor midgets. Relay races will be held to suit<br />\nthe entries that will be made.<br />\nInvitations to enter in these games have<br />\nbeen sent out to more than a hundred and fifty<br />\ncolleges, schools and athletic clubs, and a long<br /><br />\nlist of star entries is assured. The games have<br />\nalways proved to be one of Hopkins' star athletic attractions, and those to be held this<br />\nseason to promise to even outshine its brilliant<br />\npredecessors.<br />\nHopkins is to be represented in the to-mile<br />\nrun that is to be held in Washington on New<br />\nYear's Day, Griffith, Bryer, Reeside, Russell,<br />\nWolfe and Stocket having entered. These are<br />\nthe men who won the Cross-Country Club's<br />\nbanner this fall, and their prospects are excellent for capturing the event in the Capital.<br /><br />\nFRESHMAN-SOPHOMORE GAME.<br />\nA single goal from placement, kicked by<br />\nMcCabe, the Sophomore halfback, won the inter-class football game for the second-year<br />\nmen. Contrary to the expectations of everyone, the Freshmen played a fast, plucky game;<br />\nin fact, most thought that they outplayed the<br />\nupper classmen. Fulton and Beehler, the<br />\nFreshman halfbacks, repeatedly tore up the<br />\nheavier line of their opponents, and, had there<br />\nbeen a few more minutes to play, would have<br />\nscored a touchdown, for when the whistle blew<br />\nfor the end of the game the Freshmen held the<br />\nball for first down within the Sophomores' toyard line. The cane rush proved easy meat<br />\nfor the Freshies. They picked fast, wiry men<br />\nto represent them, and these, getting the jump<br />\non the Sophs at the start, fairly covered the<br /><br />\nTHE NEWS-LETTER.<br /><br />\n10<br /><br />\ncane with their hands.<br />\nlows:<br />\nSophomores.<br />\nBurgan<br />\ni<br />\nDoetsch<br />\ni<br />\nMcCabe<br />\ni<br />\nElliott<br />\ni<br />\nLinden<br />\n2<br />\nMorrison<br />\ni<br />\nTotal.<br /><br />\nThe lineup was as fol-<br /><br />\nFreshmen.<br />\nFulton<br />\nTilghman<br />\nLawton<br />\nBryan<br />\nPackard<br />\nHaynes<br />\nEaster<br />\n7 Lee<br />\nRogers<br /><br />\nthe balcony, and, led by \"Dutch Breyer,\" by a<br />\nrousing hullabaloo showed that it was exclusively Hopkins night.<br /><br />\n2<br /><br />\n2<br /><br />\n2<br /><br />\n2<br /><br />\nTotal<br />\n13<br />\nPresident of Sophomores, Harry Burgan ;<br />\npresident of Freshmen, Jack Fulton.<br />\nThe teams lined up for the football game as<br />\nfollows:<br />\nSophomores.<br />\nFreshmen.<br />\nLE<br />\nPaulus<br />\nBosley<br />\n. an. .L.T..... Wm. Tilghmat.<br />\nChas. Tilghm<br />\nLG<br />\nH. Sonneborn<br />\nSchmeisser<br />\nR. Glanzer<br />\nPackard<br />\nLinden, Doetsch....R.G.......Ellis, Haynes<br />\nRT<br />\nLawton<br />\nSalzer<br />\nRE<br />\nBryan<br />\nWaters (c)<br />\nQB<br />\nAble<br />\nWolfe<br />\nL<br />\nH<br />\nFulton<br />\nStollenwerck<br />\nBeehler<br />\nRH<br />\nMcCabe<br />\nMakel<br />\nHuck<br />\nFB<br />\nGoal from field—McCabe.<br /><br />\nCOTILLON CLUB DANCE.<br />\nThe first of the Cotillon Club dances was<br />\nheld on Friday night, December 4, 1908, in McCoy Hall. The dance started promptly at 9,<br />\nand the last dance was whirled away as the 12<br />\no'clock bell rang.<br />\nIn spite of the rain, which had lasted all the<br />\nafternoon up until 8 in the evening, the dance<br />\nwas very well attended. There were about<br />\n75 couples present, and 25 or 30 stags. It was<br />\na great source of satisfaction to the Board of<br />\nGovernors to see so many of the chaperons<br />\npresent. Among these were Dr. and Mrs.<br />\nLorraine Hulburt, Dr. and Mrs. Henry Wood,<br />\nDr. and Mrs. Ronald T. Abercrombie, Dr. and<br />\nMrs. Murray P. Brush, Mrs. Hall Harris, Jr.,<br />\nand Mrs. Paul Haupt. Those there are to be<br />\ncongratulated, and we hope to see more at the<br />\nnext dance, which very likely will be held<br />\nsometime in February.<br />\nThe floor was cleaner than usual, and well<br />\nwaxed, so that green Freshmen could slip, slide<br />\nand bump into sedate upper classmen and professors to their heart's content. The music<br />\nwas divine; \"ravishing,\" as one learned Senior<br />\nexpressed it, and, although the orchestra might<br />\nhave given more encores in the after-supper<br />\ndances, and made them a little longer, the general sentiment is that Emerich and his choice<br />\norchestra could have done no better. The only<br />\nfault to be found with any of the arrangements<br />\nis that the caterer might have made better<br />\narrangements. True that the salad was hot,<br />\nbut the ice-cream was cold—when it was not<br />\non hot plates. Perhaps it would not be unwise<br />\nfor the Board to change caterers and see if another would not be more satisfactory.<br />\nHowever, the general opinion of those who<br />\ncame to see what the dances are like is that<br />\nthey are most assuredly coming to both the<br />\nothers.<br /><br />\nHOPKINS NIGHT.<br />\nHopkins night, which was held at Ford's<br />\nOpera House on December IIth, proved to be<br />\na howling success. The theater was tastefully<br />\ndecorated with Hopkins colors and class banners, and there was a large and appreciative<br />\naudience present. The play itself, \"The Girl<br />\nQuestion,\" was certainly suited to the occasion,<br />\nas it represented a topic that everyone present<br />\nwas deeply interested in, especially those who<br />\ndid not go to \"stay.\"<br />\nFar more interesting, however, was the spirit<br />\nshown, not only by the students, but by the<br />\nalumni. It showed that the reunion held in NoHopkins men have long been pleased with the<br />\nvember had brought the alumni and the stu- lii excellence of the furnishings to be found in the<br />\ndents together to a closer fellowship than they<br />\nMen's Store at ::<br />\nhave ever before enjoyed.<br />\nPractically every undergraduate was present. Between the acts everyone assembled in<br />\n210-218 NORTH HOWARD ST.<br /><br />\nHUTZLEK BUM IC<br /><br />\nTHE NEWS-Lli 1 rER.<br /><br />\n...c.<br /><br />\n11<br /><br />\n................<br />\n.............................. . ... ...................... .................................<br />\n..... ............ . . ......... ..........* .* :***..... ....' *<br /><br />\n.....................................<br /><br />\n......................<br /><br />\n.. ..............<br />\n...........................................................<br /><br />\n........ .*................... * ........ ........<br />\n..<br /><br />\nWhen a college man discovers something really<br />\ngood, the \"word\" soon<br />\npasses around the<br />\ncampus, until<br />\neverybody<br />\nknows.<br />\nFatima Turkish Cigarettes<br />\nare a striking<br />\nexample of this.<br />\nIf you will smoke a<br />\npackage you will be<br />\ngreatly pleased with<br />\n\"Fatimas.'<br />\n•••••...<br /><br />\n20 for 15c<br /><br />\n. ..<br />\n...... ................. ........................... ....... .....................<br />\n...........<br />\n.. .<br />\n............... .. ..... .................<br />\n.............<br />\n..,.....<br />\n.\".........<br />\n............<br />\n.....<br />\n.<br />\n.................<br /><br />\n...... .....<br /><br />\n..................<br /><br />\n..<br /><br />\n........ .<br /><br />\n..........<br />\n... ............<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br /><br />\nUNIVERSITY NOTES.<br />\nThe memorial meeting in honor of Professor<br />\nBrooks was held in the Donovan room on Sunday, December 6th. A large audience was<br />\npresent, and addresses were made by several<br />\nmembers of the faculty. A very interesting<br />\naccount of Dr. Brooks' life and work, by Associate Professor Ethan A. Andrews, will be<br />\nfound in the last number of Science.<br />\nAt a recent meeting of the Freshman Class<br />\nGerhard Schmeisser was elected captain of the<br />\nFreshman lacrosse team. Captain Schmeisser<br />\nis a brother of \"Bill\" and Harry, both former<br />\nstars on the \"'varsity.\" There is a great deal<br />\nof good material in the Freshman Class, and<br />\nhe hopes to develop a team that will give the<br />\nSophomores a hard rub.<br /><br />\nSHIRT<br />\nOn and off like a coat.<br />\nIn fast colors and exclusive styles. $1.50 up.<br />\nCLUETT,PEABODY &amp; CO., Makers<br /><br />\nETcliO:(1:15<br />\n311 N.CHARLES ST<br /><br />\n0<br />\n.107)401tE<br />\nfi<br />\n..:17:cA/<br /><br />\nThe undergraduate matriculation was held<br />\non December loth. Appropriate addresses<br />\nwere made by President Remsen, Dean Griffin,<br />\nDr. M. P. Brush and Dr. Buchner. Sixty-one<br />\nreceived their certificates.<br />\nDr. Ernest Flagg Henderson on December<br />\n15th gave a lecture on \"Regime of Robespierre,\" the last of his series of lectures on the<br />\nFrench Revolution. These lectures have been<br />\nexceedingly interesting and instructive, and<br />\nhave been greatly appreciated by everyone who<br />\nhas attended them.<br /><br />\nSocial Etiquette with College<br />\nMen is an essential, therefore your<br />\nVisiting Cards and Stamped Stationery as well as your Gifts<br />\nshould be correct. LYCE1T, the<br />\nSociety Stationer, is at 317 N.<br />\nCharles Street, and can give you<br />\nall of these at reasonable prices.<br /><br />\nChocolates<br /><br />\n?<br />\nt Bonbons<br /><br />\n18 and 20 E. Baltimore St., Baltimore, Md.<br /><br />\nLEFRANC &amp; AULT<br />\nSell a GUARANTEED GOAT SKIN GLOVE<br />\nat $1.00 and $1.50 Per Pair<br />\nAT THE<br /><br />\nSHIRT SHOP, 421 North Howard Street<br />\nMr. Holun Yokayama gave a very delightful<br />\naddress on Japan on December 14th.<br />\nThe day after the Sophomore-Freshman<br />\nfootball game several Freshmen, released to a<br />\ncertain extent from their former state of bondage, appeared in the basement smoking huge<br />\npipes with very long stems.<br />\nThe Christmas examinations will begin tomorrow. Horrible dictu.<br />\nProfessor C. M. Andrews, of the History<br />\nDepartment, was elected president of the Trinity College (Hartford, Conn.) Alumni Association of Baltimore at a recent meeting, held at<br />\nthe Hopkins Club.<br /><br />\n2 DOORS BELOW FRANKLIN<br /><br />\nPC<br />\nCONFECTIONER AND CATERER<br />\n701 West North Avenue<br />\nHORLICK'S MALTED MILK<br />\nORIGINAL AND ONLY GENUINE<br /><br />\nPure, rich milk, with the extract of malted grains,<br />\nreduced to powder form. A delicious, nourishing<br />\nfood-drink is made in a moment by merely stirring<br />\nin water. Invigorating, upbuilding, and sustaining<br />\nfor the student, lecturer, athlete, traveler, for all<br />\nages. In powder form, also in Lunch Tablet form<br />\nwith chocolate. Samples free. Always ask for<br />\n\"Horlick's\" :<br />\n:<br />\n:<br />\n:<br />\n:<br />\n.<br />\n.<br />\nHORLICK'S MALTED MILK COMPANY<br />\nRacine, Wisconsin<br /><br />\nSecond-Hand School and College Text Books<br />\nBOUGHT and SOLD AT<br /><br />\nSMITH'S BOOK<br /><br />\n830<br />\n,d<br />\n5 dN<br />\no.<br />\norHao<br />\nbw<br />\novaer,<br />\nd<br />\nma<br />\nSdtir<br />\nse<br />\noe<br />\nnt<br />\nSTORE,<br /><br />\nSTUDENT'S STATIONERY<br /><br />\nChas. E. Smith &amp; Co.<br />\n...flotteto...<br />\nIQ*<br /><br />\n0:Pilic<br /><br />\n121 N. Liberty Street,<br /><br />\nBaltimore<br /><br />\nWM. J. MILLER<br />\nFINE JEWELRY, DIAMONDS AND WATCHES<br /><br />\n%<br />\n4,<br />\nT\"F<br /><br />\nAt<br /><br />\nAr4V4<br /><br />\nCII<br />\nCDD ANY.<br /><br />\nEngravings<br /><br />\nfor the Printer. Merchant &amp;Manufacturer<br />\nF!tyette Streets<br /><br />\nC01 I los,<br /><br />\nrAiruf 1EP MD.<br /><br />\n28 East Baltimore Street<br />\nManufacturer of College Seals and Pins, College Shields<br />\nin Bronze for Wall Decoration<br /><br />\nPRINTING<br /><br />\nCt011 •<br />\n1ParTyld4cD-<br /><br />\n/<br /><br />\nr,<br />\nC POST CARO<br />\nmEE<br />\nCUTS<br />\n6\"714<br />\n\"<br />\nMmr<br />\n/Vo<br />\n\"cii\"<br />\nv aty?<br />\n'\"D;w7roGR4ptis\\<br />\n--'<br /><br />\nENGRAVING<br /><br />\nNUNN &amp; COMPANY<br />\nBOOKSELLERS and STATIONERS<br /><br />\nME BEST<br /><br />\nOLL GE ANNUAL<br /><br />\nCUTS ARE<br /><br />\n\\In It III<br /><br />\nCarry a complete line of School Books and College<br />\nText Books, Miscellaneous Books, Fine Stationery,<br />\nand Students' Supplies of Every Description, together with a large assortment of<br /><br />\nWATERMAN'S IDEAL FOUNTAIN PENS<br />\n535 North Howard Street<br />\nBINDING<br /><br />\nSTATIONERY<br /><br />\nFOSNOT and WILLIAMS CO,<br />\nPRINTERS<br /><br />\nWatermark's<br />\n• Ideal tt<br />\nFountctin;<br />\nPen<br />\nI<br />\nEndorsed<br /><br />\n5 1 4-1 6 WEST FRANKLIN STREET<br />\nThe News-Letter, a product of our plant<br /><br />\nILGENFRITZ STUDIO<br />\nSuccessor to CUMMINS<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n319 North Charles Street<br />\nBALTIMORE<br />\nSpecial Discount to Students<br /><br />\n\"llESSONIAN<br /><br />\n99<br /><br />\n9<br /><br />\nA Smart Shoe for college men<br />\nwith a touch of newness that<br />\nyou'll like.<br /><br />\n,<br />\nTO BE OBTAINED ONLY AT<br /><br />\nbg,-<br /><br />\n(<br /><br />\nthe Millions<br />\nNow using them the world over<br /><br />\nN. HESS' SONS,8 East Baltimore Street<br />\nBOOKS! SECOND-HAND!<br />\nSchool, Medical and Miscellaneous, Bought, Sold and Exchanged<br /><br />\nFOR SALE<br />\nEVERYWHERE<br /><br />\nPIPPEN'S BOOK STORE<br />\n605 NORTH EUTAW ST.,<br /><br />\nNear the University<br /><br />\nBALTITIORE'S LAROEST OLD BOOK STORE<br /><br />\nNEW YORK CLOTHING HOUSE<br />\nSIS C() it 11,C0S.<br />\nFLAGS<br /><br />\n„at<br /><br />\nBANNERS<br /><br />\n13 WEST LEXINGTON STREET,<br /><br />\n•<br /><br />\n,)8<br />\n-<br /><br />\nBADGES<br />\nBALTIMORE, MD<br /><br />\nSMART _A\"1\"lrInE<br />\nReady-to-Wear and Made to Order<br />\nSole Agents for the Everwear Hose—guaranteed 6 months<br />\n102-104 BALTIMORE STREET, EAST<br /><br />\nOPPOSITE LIGHT STREET<br /><br />\nWhen making your purchases, kindly remember our advertisers<br /><br />\nHOPKINS--LEMMERT<br />\nBOTH STAND ON A HIGH PLANE<br />\nSTUDENTS WEARING LEMMERT<br />\nCLOTHES SET THE PACE OF<br />\nWELL-DRESSED MEN<br />\n::<br />\nOUR PRICES ARE REASONABLE<br />\nENOUGH TO PLEASE YOU :: :•<br /><br />\nIt's a<br /><br />\nFOWNES<br /><br />\nLEIVIMERT<br /><br />\nThat's all you need to know I<br />\nabout a<br /><br />\n10 E. FAYETTE .STREET<br />\nA.•<br /><br />\nGLOVE<br /><br />\nrrIN<br />\n.<br />\nM anufacturer of<br /><br />\nGreek Letter Fraternity Jewelery<br />\n213 NORTH LIBERTY STREET<br />\nPlease call and examine our line before purchasing<br /><br />\n\"COLLAR HUG\" CLOTHES<br /><br />\nThe Quality Shop<br />\n116 E. BALTIMORE STREET<br /><br />\nBALTIMORE<br /><br />\nWe have a new line of hand colored HOPKINS POSTERS<br />\nwhich are beauties.<br /><br />\nHOTEL CUMBERLAND<br /><br />\nCome in and look at our Holiday Goods. Everything for<br />\nthe College man's room.<br /><br />\nINEw<br /><br />\nHoward Novelty Company<br /><br />\nS. W. Corner BROADWAY AND 54th STREET<br /><br />\n323 N. Howard Street<br /><br />\nNear 50th Street Subway Station and 53rd Street<br /><br />\nLIMN<br />\n111M11<br /><br />\nMINITEKS<br /><br />\n-Ar<br /><br />\n,<br />\nOW:<br />\nOw- ---<br /><br />\nKept by a<br />\nCollege Man<br /><br />\nIdeal Location<br />\nNear Theatres<br />\nShops and<br />\nCentral Park<br /><br />\nWEBSTER'S<br /><br />\nINTERNATIONAL<br /><br />\nGRAND PRIZE WORLD'SE411t,StLouis<br /><br />\nDICTIONARY<br /><br />\nRECENTLY ADDED,25,000 NEW WORDS &amp; PHRASES<br /><br />\nHeadquarters<br />\nfor College<br />\nMen<br /><br />\nNew, Modern<br />\nand<br />\nAbsolutely<br />\nFireproof<br /><br />\nNew Gazetteer of the World 2380 Quarto Pages New Biographical Dictionary<br />\n1:ditor in Chief, W.T. HARRIS,<br />\n1.S. C ,u.. of Education.<br />\nChief.)notice FULLER. U. M. Mupreme ('mart, ti:\"s: I regard the<br />\nInternational as of the utmost ,alue In accuracy of definition, and hair fount it in all<br />\nrespects complete and thorough,<br />\n.<br />\n--<br /><br />\nAlso. Webster s Collegiate Dictionary<br /><br />\nLatest and Largest Abridgment of the International. Two Editions. ©<br />\nFREE,\"Dictionary Wrinkles.\" Also illustrated pamphlets.<br /><br />\nG. G C. MERRIAM CO.. Springfield. Mass..<br />\nGET THE BEST<br />\n-x•<br /><br />\nPURNELL ART CO.<br />\n224 NORTH HOWARD SIRE!'\"<br />\nIMPORTERS AND DEALERS<br /><br />\nSpecial Terms<br />\nfor College<br />\nTeams<br /><br />\nAll Outside<br />\nRooms<br /><br />\nTRANSIENT RATES (with BATH), $2.50 and up<br />\nSEND FOR<br /><br />\nFINE ARTS<br />\nPictures Framed Correctly and Promptly at Moderate Prices<br />\nfr<br /><br />\nMost, Attractive Hotel in<br />\nNew York<br /><br />\nvs\" rnh ea.lacs.<br /><br />\nBOOKLET<br /><br />\nHARRY P. STIMSON<br /><br />\nR. J. BINGHAM<br /><br />\nFormerly with Hotel Imperial<br /><br />\nFormerly with Hotel Woodward<br /><br />"}], "field_media_file": [{"target_id": 36409, "display": null, "description": null, "target_type": "file", "target_uuid": "418011ef-bf42-46a1-8f17-c1a1ea3fc584", "url": "http://digital.library.jhu.edu/system/files/2022-03/12372-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12372, "target_type": "node", "target_uuid": "7c447696-9cc2-42af-bb4a-d0b2099135e5", "url": "/node/12372"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "b9bf5985-912f-44ba-80af-d6aa9b65e6d0"}]}