{"mid": [{"value": 36915}], "uuid": [{"value": "5ecc3690-91c3-4793-b4b7-5e3bbee9f642"}], "vid": [{"value": 36915}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:56:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13092-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:56:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:56:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVIII, No. 20<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 14, 1923<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nMAGAZINE SAYS HOPKINS FELLOWSHIPS IN BELGIUM FIFTEENTH ANNUAL INTER- STUDENT FELLOWSHIP DIN- EIGHT LAST YEAR'S VARMEN SWINDLED INTO<br />\nOPEN FOR HOPKINS<br />\nNER TO BE HELD NEXT<br />\nSITY MEN MAY BE IN LAFRATERNITY CONFERBOGUS T. N. E.<br />\nSENIORS<br />\nTUESDAY EVENING<br />\nCROSSE LINEUP<br />\nENCE HELD<br />\nAttempting to Become Regular College C. R. B. Educational Foundation Will Conference of Locals Also Held at Hotel Dr. J. J. Coale to Speak to Students at Squad Practicing Regularly at HomeFraternity by Eliminating ClanAward Six Fellowships<br />\nSecond Dinner Called by PopPennsylvania, New York<br />\nwood Field<br />\ndestine *Groups<br />\nular<br />\nDemand<br />\nDr. John H. Latane, dean of the<br />\nWhen<br />\nThe fifteenth<br />\nthe Hopkins<br />\n<br />\nNational InterfraLacrosse<br />\nOn the evening of Tuesday, De- team lines up against<br />\nCollege of Arts and Sciences, has ternity Conference was held at the<br />\ntheir Alumni<br />\nreceived an announcement from the<br />\nHotel Pennsylvania in New York cember 18, at 6 o'clock, the second opponents for the first game of the<br />\nC. R. B. Educational Foundation,<br />\nNovember 30 and December 1. Student Fellowship Dinner of the 1924 lacrosse season, it is probable<br />\nInc., 42 Broadway, New York City, on<br />\nyear will be held at the Friends that four<br />\nalumni will still be playthat a number of American grad- The Conference discussed many<br />\nMeeting<br />\nHouse, under the auspices ing on the university<br />\nsubjects<br />\nof<br />\nvital<br />\ninterest<br />\nto<br />\nfraterteam. Bachuate fellowships for study in Belof the Hopkins \"Y.\"<br />\nman, last year's point, is back at<br />\ngium during the academic year nities and heard reports by repreThe attractive feature of the din1924-1925 will be awarded by sentatives of the different fraterner<br />\nwill be an address by Dr. J. J. the university doing graduate work;<br />\nnities from all parts of the counApril 1, 1924.<br />\nRoutson, Benedict and Middleton<br />\ntry. For the first time in its history, Coale, of the Presbyterian FederaA total of six fellowships will be<br />\ntion of Churches of Baltimore. The will also return in February, acawarded in a wide variety of sub- the Conference urged expansion of subject<br />\nof the address Will be some- cording to what appears to be more<br />\njects, including all those generally fraternities—both by the granting thing<br />\npertaining to sociology, since than three years and would be eliTheta Nu Epsilon has been<br />\ntaken by both academic and engi- of more chapters by existing na- it is<br />\nthat'<br />\nfield that Dr. Coale has gible for the team. Captain Turntionals, and by the formation of<br />\nstrongly opposed by the Interfrater- neering<br />\nundergraduates.<br />\ndevoted<br />\nmajor<br />\nemphasis in his bull, Barton, Almy and McDaniel<br />\nnew nationals. Due to the great<br />\nnity Board for years on college<br />\nFive Requirements<br />\nstudies,<br />\nand<br />\nhe<br />\nknows<br />\nsocial prob- are last year regulars who are back<br />\nincrease in the number of men in<br />\ncampuses, since its organization, To<br />\nat college this year. With eight of<br />\nbe eligible a candidate must college since the war many local lems as few men do.<br />\nmembers and methods have been se- (1) be an American citizen; (2)<br />\nlast<br />\nyear's varsity and a squad numThe<br />\nfirst<br />\nFellowship<br />\nDinner<br />\nwas<br />\nfraternities have grown up—many<br />\ncret, it has been charged. General have a thorough speaking and read- of<br />\nbering<br />\nfifty men, the lacrosse team<br />\nheld<br />\nlast<br />\nmonth,<br />\nand<br />\nit was very<br />\nwhich are deserving of a national<br />\nwell attended. The men were so is in better shape than was expected<br />\nprinciples of the fraternity have ing knowledge of French; (3) be charter.<br />\nenthusiastic that they voted unani- last year.<br />\nbrought denunciation from heads of a graduate, at time of application,<br />\n85 Locals Represented<br />\nbefore<br />\nor<br />\nThe team is working out three<br />\nSeptember,<br />\n1924,<br />\nmously to hold .similar dinners<br />\nof a colnational fraternity organizations.<br />\nThe chairman of the Committee<br />\nlege or professional school of recafternoons<br />\na week with \"Father<br />\nmonthly. A committee was apThe attempt being made now is to<br />\nognized standing in the United on Expansion of the Conference is- pointed to take charge of making Bill\" Schmeisser, Tommy Troxell,<br />\nmake a general fraternity by reorStates; (4) have definite plans for sued invitations to locals all over the necessary arrangements and of and Henry Baker. They will conganizing, being the purpose of the<br />\nhis proposed study in Belgium; and the country to send representatives securing the speakers. The com- tinue this practice throughout the<br />\nrecent meeting in New York.<br />\nto New York for a conference of<br />\n(5) be in good health.<br />\nmittee expresses much gratification winter unless the weather gets too<br />\nA report of the committee on<br />\nlocal<br />\nfraternities to be held at the<br />\nfellowship<br />\nEach<br />\ncarries<br />\nat having secured Dr. Coale for the cold. These three men will relina<br />\n\"Organizations Antagonistic tc,<br />\nstipend of 15,000 francs, plus tui- same time as the National Confer- meeting this month.<br />\nquish their coaching duties when. a<br />\nFraternities,\" of which Dean Clark<br />\ntion fees, and first class traveling ence. In response to this invitation<br />\ncoach<br />\nis appointed. It is thought<br />\nOwing<br />\nto<br />\nthe<br />\nlack<br />\nof a chapel<br />\nis chairman, was submitted.<br />\nexpenses from the residence or uni- representatives from eighty-five lo- and a \"Y\" building, the Y. M. C. that either Eddie Stuart or Alec<br />\nAt the meeting of the chairman<br />\nversity of the holder in the United cal fraternities met. These men A. at Hopkins is hampered in its Wolfe will undertake this job.<br />\nand national officers of the organStates, to and from the university came from almost every section of vital services to the Hopkins stuThere is a lot of material for<br />\nization it was agreed that charters<br />\nthe country. There was a reprein Belgium.<br />\ndents at Homewood. But the Fel- every position. The most promwould be granted only to petitionAmerican fellows will be required sentative from Maine, one from lowship Group, which has been ising candidates are: Goal—Love,<br />\ning groups with faculty endorseto report in Brussels by October 1, Florida, one .from Texas, one from heartily endorsed and supported by Routson and Cone; point—Bachment, not to allow use of. the or1924, and to reside in Belgium for Montana, and from practically ev- the students themselves, is a great man., and Post; cover point—Barganization's name except to chapat least eight months. Fellows may ery other state in the country.<br />\nachievement for this year. The ton, Milburn and Hess; first deters lawfully organized, to suspend<br />\nThe primary object of this Con- group is not closed, but is open to fense—Bates<br />\nchoose the Belgian university or<br />\nand Townsend; secchapters that do not live up to the<br />\ntechnical school which they wish to ference of Locals is not, as many all students. All the students wish- ond defense—Taylor and Watson;<br />\nideals of the organization, and elimattend, and in special cases may en- persons think, to form a national ing to attend the dinner next Tues- third defense—Benedict and Porinate as soon as possible dual memfraternity with a chapter in each of day, are requested to drop into the ter; center—Middle<br />\nroll at more than one university.<br />\nton, Summers,<br />\nberships.<br />\nthe<br />\ninstitutions represented at the \"Y\" office and sign for reservation. Di Paula and<br />\nHopkins seniors, who desire apSteck<br />\n;<br />\nthird attack—<br />\nRaps Kappa Beta Phi<br />\nplication blanks and further infor- Conference. The main purpose of<br />\nThe dinner will begin promptly Baldwin, Parsons and Robinson;<br />\n\"Kappa Beta Phi is,\" said Dean mation, can obtain same by address- the Conference was to urge the loat 6 P. M. and will end about an second attack—AIorrill and AaronClark, \"growing tremendously, and ing the Fellowship Committee, C. cals to try to become national, and<br />\nhour later.<br />\nson; first attack—Captain Turnis perhaps a greater menace, if pos- R. B. Educational Foundation,<br />\nInc., to discuss matters of importance to<br />\nbull; out home—Almy and O'Consible, to scholarship than -Theta Nu 42 Broadway, New York, N. Y.<br />\nfraternities. The committee on ex- FIRST COTILLON HELD LAST or ; in home—McDanie<br />\nl,. SanderEpsilon has been. The Ku Klux<br />\npansion of the National Conference FRIDAY. HOPKINS FOOT- son, Brown and<br />\nStick. Other men<br />\nKlan, whatever may be said for or LECTURE ANNOUNCED BY is composed of men who know as<br />\nBALL MEN GUESTS OF<br />\nwho look promising are Ackelitys<br />\nagainst it, is gaining a foothold in<br />\nmuch<br />\nabout<br />\nfraternities<br />\nas<br />\nany<br />\nother<br />\nREGISTRAR<br />\nHONOR<br />\nand Mills. Wolbert and Bonner of<br />\nour colleges, both North and South,<br />\nHopkins students interested in men in the country, and their exThe first of the three cotillons the football team are coming out for<br />\nand is entitled to some consideraperienced opinions are of great<br />\ngiven yearly by the Hopkins Cotil- the team and their presence ought<br />\nArchaeology will have a chance to<br />\ntion by this conference.\"<br />\nvalue to fraternity men.<br />\nlon Club was held Friday night at to strengthen the squad considerEight chapters suspended since hear an authority on the subject.<br />\nMany of the locals represented at<br />\nably.<br />\nthe war because they did not func- Mr. Dempster, Registrar, an- the Conference were already peti- the Maryland Casualty Club House.<br />\nAt the meeting of the Intercolletion in accordance with the policy nounced last Tuesday that Mr. A. tioning a national fraternity, but for The guests of honor were the Hop- giate<br />\nLacrosse League tomorrow at<br />\nof the grand council, were located J. B. Wace will give an illustrated the benefit of those who were not a kins men who actually participated New York, the<br />\nschedule will be<br />\nat the following schools: Universi- lecture on \"Ancient Greece: A resolution was adopted declaring in the Hopkins-Maryland football completed.<br />\nManager Perkins has<br />\nty of Arkansas, Purdue University,<br />\nwritten several times io the Naval<br />\nStudy in Archaeological Recon- the Conference to be in favor of game on Thanksgiving Day.<br />\nOhio State College, Northwestern struction\"<br />\nThe dance lasted from 9 until 12 Academy for a game in Baltimore.<br />\non the afternoon of the formation of one or more naUniversity, Colgate<br />\nUniversity, Thursday, December<br />\n20. The Civil tional fraternities by members of o'clock and refreshments were His letters have been unanswered,<br />\nUniversity of Maine, University of Engineering<br />\nHall, where the lec- the Conference of Local Frater- served at about 11:30. As is usual- but arrangements probably will be<br />\nChicago, and James Milliken Uni- ture will<br />\nly the case at Hopkins festivities, made for this game at the meeting<br />\nbe held, should be well nities.<br />\nversity. The list of_ schools sus- filled,<br />\nNew National Formed<br />\nthe music was furnished by the ever tomorrow..<br />\nfor Mr. Wace is exceptionpended previous to this report are:<br />\nIn<br />\nresponse.<br />\nto<br />\nthis<br />\nresolution,<br />\npopular orchestra of Louis Fisher. Gordon Post, a youth measuring<br />\nally well fitted to talk on the subColumbia University, Union Uni- ject.<br />\nrepresentatives of some of the lo- The exceptional music and the good six feet five inches from head to<br />\nversity, University of Texas, UniMr. Wace was born in England cal fraternities got together and dance floor combined to enchant the feet, and with arms to match, is<br />\nversity of California, Rutgers Col- iii<br />\n1879 and received his university founded a new national fraternity devotees of .Terpsichore. The dec- on the squad. With the aid of an<br />\nlege, University of West Virginia,<br />\ntraining at Carnbridge. He then with thirteen chapters. The name orations and refreshments were up extra large stick, Post is expected<br />\nSt. Lawrence University, Brown<br />\nstudied at the British Schools a of this new fraternity in (I) K H. to the usual Hopkins standard, and to be able to intercept everything<br />\nUniversity, Kenyon College, Case<br />\nboth Athens and Rome. Since 1914 Since a national fraternity must be the size of the crowd was \"just near him. He threatens to give the<br />\nSchool of Applied Science, Westveteran Bachman a fight for his job<br />\nhe has been director of the British at least fifteen years old before be- right.\" ,<br />\nern Reserve Medical College, Noring<br />\nadmitted<br />\nto<br />\nnational<br />\nthe<br />\nconat<br />\npoint.<br />\nThis<br />\ncotillon<br />\nthe<br />\ninnovation<br />\nsaw<br />\nArchaeology<br />\nSchool of<br />\nat Athens.<br />\nwich University, and Massachusetts<br />\nference<br />\nthis<br />\nnew<br />\nnational<br />\nwill<br />\nstill<br />\nSchmeisser<br />\nwhat<br />\nof<br />\nmay develop into a custom:<br />\nwill plan his style of<br />\nSome of his most important publiInstitute of Technology.<br />\ncations are: \"A Catalog of the be a member of the Local's Con- two favors were given to each cou- game this year along slightly difA recent issue of \"Keys,\" the Sparta<br />\nMuseum,\" \"Prehistoric ference. This is the first time in ple, a bill folder for the escort as ferent lines from those of last year.<br />\nJournal of T. N. E., gives the name Thessaly,\" and \"The Nomads of the history of fraternities that a well as a vanity card case for the He plans a faster and more agresof Johns Hopkins University as the Balkans.\"<br />\n\"grown up\" national has ever been girl. Each .favor bore a university sive team and will consequently<br />\nhaving an organization which has<br />\nformed. However, with the expeti- seal.<br />\nneed and use a great many substiswindled students into a bogus T.<br />\nence and co-operation of men who<br />\nThe patrons were selected from tutes. A job like center will probN. E. Inquiry at the registrar's ofknow so much about fraternities, the faculty. They included: Dr. ably he filled by three men in a<br />\nfice revealed that a letter had been<br />\nthe movement is almost certain to and Mrs. J. Elliot Gilpin, Dr. and single game on account of the neMeeting of Hullabalo Ediaddressed to them a month ago from<br />\nbe a success.<br />\ntorial Staff at Phi Gamma<br />\nMrs. John B. Whitehead, D. and cessity of speed. No center on the<br />\nnational officers of the organization<br />\nThe conference for Local Frater- Mrs. Broadus Mitchell, and Major squad could have the endurance to<br />\nDelta House tonight at 8.00.<br />\nContinued on page 4 col. 2<br />\nContinued on pair,4 col. 3<br />\nand Mrs. Gregory Hoisington.<br />\nContinued on Page 3, col. 2<br />\nTwenty chapters of Theta Nu<br />\nEpsilon have been suspended in the<br />\npast few years according to a report by its Grand Secretary to Dean<br />\nThomas Arkle Clark, at the Interfraternity Conference held in New<br />\nYork recently. Eight chapters have<br />\nbeen suspended because they did<br />\nnot function in accordance with the<br />\npolicy df the grand council.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 14, 1923<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins<br />\n<br />\nNews-Letter<br />\n<br />\nFOUNDED 1897<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nTelephone<br />\n<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\n<br />\nriroe— VT\".144,—<br />\n7(.617.:4-4<br />\nto\\<br />\n<br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, But Shoulder the Responsibility<br />\n<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an' indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\n4#<br />\ni<br />\nr A1<br />\nA:<br />\n<br />\nPHILIP W. HOWARD, '25<br />\n<br />\nri:•7`<br />\n<br />\nA CHANGE IN POLICY?<br />\n<br />\nSir: I would suggest to you a<br />\n<br />\nWhy Young Men Should<br />\nConsider Insurance Selling<br />\n71-,0<br />\n<br />\nHomewood 100 To the Editor of<br />\nBusiness Manager<br />\n<br />\n.311 6-Ana<br />\n<br />\nSeven Reasons for Life Insurance Career<br />\n<br />\nTHE NEWS-LETTER:<br />\nEditor-in-Chief<br />\nJOSEPH LEOPOLD, '24<br />\n<br />\n\"<br />\n<br />\n;<br />\n14:<br />\n‘iret9C14i<br />\n<br />\nLIFE INSURANCE is founded on the<br />\nhighest ideals.<br />\nIt is capable of yielding a good income and<br />\nthe satisfaction of accomplishment.<br />\nIt offers opportunities for real leadership.<br />\nIt brings,insurance salesmen in close association with big business and big business<br />\nmen.<br />\nIt requires education in business methods,<br />\nlaw and finance.<br />\nIt is a field for workers, not shirkers.<br />\nIt is an alluring and practical calling for men<br />\nof dynamic energy.<br />\n<br />\ntd<br />\nF41<br />\n<br />\npkti<br />\ng4,1<br />\n4p1<br />\n<br />\nr<br />\n:ti!<br />\n<br />\npolicy which is very old to THE<br />\nNEWS-LETTER, but which has not<br />\nrfil<br />\nEditor<br />\nAssistant Managing<br />\nbeen used recently in your columns.<br />\nT. REESE MARsH, '24<br />\nCirculation Manager<br />\nThat policy is to print some \"speAssociate Editors<br />\nJOHN C. LEWIS, JR., '24<br />\ncial<br />\narticles\" of literary interest in<br />\nRICHARD C. TILGHMAN, '25<br />\nPARSONS,<br />\n'25<br />\nW.<br />\nJOHN<br />\nthe form of poetry, short stories,<br />\nPY4<br />\nAssistant Business Managers<br />\nBENJAMIN T. ROME,'25<br />\nkfi)<br />\nin<br />\nmagazirie<br />\narticles<br />\nexpositions<br />\nand<br />\ntiW<br />\nD. MILES MARRIAN,'25<br />\nJunior Editors<br />\nG. DONALD GIESKE,'25<br />\ngeneral.<br />\nARTHUR L. NELSON, '26<br />\n‘74<br />\nJOHN T. DIXON, '24<br />\n;(6),<br />\nERNEST A. STRATHMAN, '26<br />\nm<br />\nthat<br />\na<br />\nwell-established<br />\nfact<br />\nIt<br />\nis<br />\nrffMcKAY,<br />\n'26<br />\nA.<br />\nJ.<br />\nALGER G. HIM,'26<br />\nF<br />\nLIFE INSURANCE COMPANY<br />\nEDWARD 0. MICHEL, '26<br />\nC. EUGENE TOVELL, '24<br />\nHopkins has need of a literary magBOSTON. MASSACHUSETTS<br />\nOF<br />\nCHARLES G. HUTZLER, '24<br />\n041<br />\nOTHO J. KELLFR, III, '26<br />\nazine. It was decided last year—<br />\nJAMES YOUNG, '25<br />\nSixty-one years in business. Now insuring One Billion<br />\nKIDD,<br />\n'26<br />\nJACKSON<br />\nJ.<br />\nHENRY R. TURNBULL, '26<br />\nHundred Million dollars in policies on 3,250,000 lives<br />\nSeven<br />\nthe<br />\ndecision<br />\nand<br />\nshould<br />\nhold<br />\ngood<br />\nT. STRAN SUMMERS, '25<br />\nIQ<br />\nHAROLD S. GOODWIN, '26<br />\nfor several years—that the campus<br />\n111-4irs7V‘er 'r:VefitV.<br />\nti(G•17-......\"-tZZn.r0\"7.<br />\n4<br />\n1!..<br />\nMember Southern Intercollegiate Newspaper Association<br />\ncould not support another publication at the present time. Why,there<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md. —<br />\nfore, could not THE NEWS-LETTER COLLEGE BALL TO BE GIVEN FIELD CLUB TO ELECT OFFICERS ON MONDAY<br />\nCHRISTMAS NIGHT AT<br />\nrelieve the situation by publishing<br />\nBUFFALO, N. Y.<br />\nOfficers will be elected Monday,<br />\nfrom time to time articles of literOUR FOOTBALL SCHEDULE •<br />\ncharintercollegiate<br />\nball<br />\nof<br />\nA<br />\nDecember<br />\n17, for the Naturalists'<br />\nary interest?<br />\nAccording to the plans of.the athletic authorities, Hopkins will,<br />\nI would like to quote from a acter will be held on Christmas Field Club, according to informafrom year to year, as the quantity and quality of material increases,<br />\nnight, December 25th in the new tion given out this week by Dr. E.<br />\ndrop the smaller colleges from its football schedule and substitute similar letter to this one written to<br />\nHotel Statler, Buffalo, N. Y. It A. Andrews, of the Biology Deinstitutions of greater prowess and renown. The News-Letter the editor of THE NEWS-LETTER On<br />\nstrongly commends this move. There is nothing to be gained by January 16, 1915, and 'signed will be given under the auspices partment.<br />\nA president and secretary will be<br />\ndefeating Backwater College 21-0, while if this college should hap- \"Septimus,\" showing proof of the of Scalp and Blade, a society<br />\nattitude<br />\nof<br />\nthe<br />\nelected<br />\nto succeed Bruce Lineburg<br />\n1914-1915<br />\nNEWSHopkins'<br />\nscore,<br />\nlow<br />\nto<br />\na<br />\nBlue<br />\nBlack<br />\nand<br />\npen to defeat or hold the<br />\nunique among college organizaLETTER<br />\nstaff<br />\non<br />\nthis<br />\nmatter.<br />\nand<br />\nThe<br />\nEverett<br />\nMayers, who are doing<br />\nas<br />\na<br />\nresults<br />\npublicity<br />\nunfavorable<br />\nmuch<br />\nrecord suffers severely and<br />\ntions. The members of each of<br />\nquotation<br />\nfollows:<br />\nwork<br />\nfor<br />\na<br />\ndoctor's degree, which<br />\nconsequence.<br />\nits twenty chapters are picked requires their entire<br />\ntime. The plan<br />\n\"I understand that it is the polWhen Hopkins scheduled Cornell two weeks before the Mary- icy, and the wise<br />\nfrom<br />\nthe<br />\nmen<br />\nfrom<br />\nBuffalo<br />\natis<br />\nto<br />\nelect<br />\na<br />\ngraduate<br />\nstudent and<br />\npolicy, of THE<br />\nland game, in 1923, sport writers and fans predicted that a crippled<br />\ntending<br />\nthat<br />\nschool.<br />\nThere<br />\nis<br />\na<br />\none<br />\nofficer<br />\nfrom<br />\nthe<br />\nstudent<br />\nbody.<br />\nNEWS-LETTER not to enter the field<br />\nteam would be forced to battle for the State Championship. History of magazine<br />\nThe<br />\nNaturalist<br />\nField<br />\nClub<br />\nis<br />\ninarticles definitely; that controlling chapter in Buffalo<br />\nshows that not a man was injured in the game at Ithaca.<br />\nterested<br />\nin<br />\nstudying<br />\nplants and aniTHE NEWS-LETTER iS a publication composed of men who were memAnd it is a matter of history, too, that casualties seldom result devoted expressly to the printing of bers of Scalp and Blade when un- mals around Baltimore and the<br />\nstudy of birds. One of the club's<br />\nagainst a team, no matter how large or powerful it may be, that matters of college interest and of dergraduates.<br />\nbiggest features on its program of<br />\nplays hard, clean football. It is mostly the \"neck-twisting\" and real news value. In every policy,<br />\nFounded in 1893 at Cornell interesting promotional work is<br />\n\"kneeing\" of the smaller teams that causes the side lines to be popu- however, there is room for exceptions, and the exceptions which have University where there are al- building a $1,500 bird bath in the<br />\nlated with regulars.<br />\nso far been printed in THE NEWS- ways many men from Buffalo, Botanical Gardens.<br />\nHopkins cannot eliminate the so-called \"easy games\" in one year.<br />\nLETTER are notable enough them- Scalp and Blade has now spread<br />\nWe hope, however, that in the near future these contests may be<br />\nselves to form a part of THE NEWS- to the following colleges and uni- DORMITORY GET-TOGETHER<br />\nreduced to a minimum.<br />\nLETTER policy.<br />\nPLANNED BEFORE<br />\nversities in the order named:<br />\n\"The articles on Sidney Lanier<br />\nHOLIDAYS<br />\nMichigan, Pennsylvania, Renssewhich brought about this entire disJust before all the men of the<br />\nTHE CULTURED COLLEGIAN<br />\ncussion were published in the issue laer, Colgate, Hobart, Carnegie Dormitory leave for the holidays,<br />\nBranded with a great variety of ignominious appellations rang- of October 26. Dr. Greene's essay Tech, Massachusetts Institute of the House Committee plans to run<br />\ning from \"dissolute schoolboys\" to \"spiritless dupes,\" the American has followed about two months af- Technology, University of Illi- off a combination smoker and encollege men of today are subjected to numerous and concentrated terwards. If articles such as these nois, Williams, Dartmouth, Roch- tertainment. There will be several<br />\nattacks from educators and reformers throughout the country. The are indeed to be published every ester, Union, Harvard, Yale, novelty acts on the program, as well<br />\nUniversity, according to these authorities, has been relegated to the two months, at the end of the year Princeton, Syracuse, Lehigh, Co- as an interesting short talk on travel.<br />\nstatus of a country club the knowledge obtained from a college a collection of five or six articles lumbia and the University of Several musical numbers will encourse is of negligible value in life; and there is nothing, except per- have been formed—articles which, Buffalo.<br />\nliven the party: Smokes will be<br />\nhaps an exaggerated sense of pleasure, to distinguish the college if the standard set so far is main- The College Ball, now an an- passed around and a congenial time<br />\ntained, will be infinitely better than nual event in Buffalo society has is expected. The smoker will act<br />\ngraduate from the rank and file of the world.<br />\nthe average run of magazine arti- filled a long felt want. In earlier as a sort of last get-together before<br />\nThe college man, and the modern university, however, have their<br />\ncles.<br />\nyears there has been no Christmas the Dormitory is deserted.<br />\ndefenders who speak in vague terms of \"the broadening of view\"<br />\n\"Thus, it seems to me, THE function in Buffalo given by coland the \"culture\" to be obtained from higher education. Despite the<br />\nNEWS-LETTER has achieved a re- lege men for college men and<br />\nTHE SPORTING VIEW<br />\nhowls of protest that might arise in opposition to their views, a colmarkable compromise. Without in their friends that was large<br />\n(From London Punch)<br />\nlege course undoubtedly exerts a broadening influence. When we<br />\nthe least injuring its news value, it enough to attract thru its reunion<br />\narrive at the word \"culture,\" however, we stop and shudder. Is the<br />\nchronic<br />\nA<br />\nangler who has recenthas published two features which feature. The overflowing ataverage undergraduate a seeker after culture. We would like to dely purchased his first motor-car is<br />\nhave served to keep awake under- tendance at every annual College<br />\nfend him, but we fear that he does not aim at \"the training . .<br />\nnow telling people that he ran into<br />\ngraduate interest in purely literary Ball given has proved the demand<br />\nand refinement of the mind . . . and taste.\" There are mep<br />\na fine specimen of a pedestrian, but,<br />\nwork. If the occasional publication for a holiday function of this kind<br />\nat Hopkins who would attend a performance of a famous symphony<br />\nalthough he played it very tactfully,<br />\nof such articles' is to be continued open to all.<br />\norchestra in preference to the Scandals of '27. There are underit eventually got away.<br />\n(and there seems to be every rea- The Buffalo<br />\nCommittee in<br />\ngraduates who would prefer classical works to the sensational novels<br />\nson to suppose that this publication charge of the Ball is as follows:<br />\nof some of our modern authors. From observation, however, we<br />\nis to be continued). Hopkins will Weston M. Carroll, Pennsylvan- THE SEVEN AGES OF WOMEN<br />\nwould say that these men, if not greatly outnumbered, are at least<br />\n(From Banter)<br />\nhave a weekly paper which will con- ia,'17, General Chairman; Harvey<br />\nin the minority.<br />\ntain the best elements of the college Bierma, Pennsylvania, '17, ChairSafety pins.<br />\nWe feel that the college graduate posseses certain distinct advan- magazine and which will still main- man in Charge of Tickets and CaWhip pins.<br />\ntages over other men. There is much that is obtained from a college tain its value as a weekly recorder tering; Chas. K. Bassett, Cornell, Hair pins.<br />\ncareer that cannot be narrated in words nor calculated in dollars and of incidents in which the Univer- '14; Chairman of Publicity and<br />\nFrat. pins.<br />\ncents. The university student, however, has many opportunities to sity's men are interested.\"<br />\nInformation; Russell Paris, MichDiamond pins.<br />\nobtain that intangible asset, culture, that marks a truly educated man,<br />\nYours sincerely,<br />\nigan, '23, Chairman Floor ComClothes pins.<br />\nand seldom takes advantage of them to the fullest degree.<br />\nRolling pins.<br />\n•<br />\nSEPTIM US II. mittee.<br />\nManaging Editor<br />\nWILLIAM G. DEAN, JR., '24<br />\n<br />\nAdvertising Manager<br />\nFITZGERALD DUNNING, '24<br />\n<br />\nrele<br />\n<br />\nt,<br />\n<br />\nrtP.,<br />\nrfrz<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 14, 1923<br />\n<br />\n3<br />\n<br />\nHISTORY CLASS ADDRESSED TWO MORE HOPKINS MEN a member of the Dramatic Club<br />\nBoys, the place to get your<br />\nGET EVENING SUN MEDAL and on graduation went into theBY MR. BLANCHARD. TELLS<br />\nmeals—and they are honFOR ATHLETIC PROWESS atrical work. He secured a posiOF ENGLISH LABOR<br />\nest-to-goodness<br />\nmeals, well<br />\nthe<br />\nProctor<br />\nPlayers<br />\nand<br />\ntion<br />\nwith<br />\nSince the an<br />\nthat<br />\n.Mr. Blanchard, the well-known<br />\nthem<br />\nin<br />\nhas<br />\nplaying<br />\nwith<br />\nbeen<br />\nserve d, and reasonably<br />\nlabor leader, a man high in the Louis Clark had been awarded the<br />\ncouncils of the labor movement, Evening Sun medal, two other Elizabeth ever since. Among Joe's<br />\npriced—is at<br />\nand an authority on labor topics, Hopkins men have gained this sig- experiences is one o,f a humorous<br />\naddressed Dr. Mitchell's class in nal distinction in amateur athletics nature. He was taking a part of a<br />\nEconomic History last Wednes- —\"Doug\" Turnbull and Verne courtier—all dolled up in tights<br />\nOf course you know that<br />\nBooth. Of the total of eight med- and a feather on his cap. He drew<br />\nday.<br />\nThe Barn is handling orders<br />\nMr. Blanchard has just returned als. awarded this season, Hopkins his sword, accidentally pulled and<br />\nfor our clothes again this<br />\nfrom a trip to England, where he got three, leaving the other five to untied the string holding up his<br />\nyear.<br />\n1817 N. Charles St.<br />\nsat at the convention of the Eng- be distributed among five different tights and had to withdraw from<br />\nThe plan worked to<br />\n(Half Block below North Ave.)<br />\nthe stage, embarrassed, with the<br />\nlish Labor Party, last June. He colleges, schools and clubs.<br />\nmutual advantage last seaguffawing<br />\nof<br />\nthe<br />\naudience<br />\nin<br />\nhis<br />\ndescribed clearly the situation that<br />\nVerne Booth received the honor<br />\nson,<br />\nand we're mighty glad<br />\nears.<br />\nmay bring about the elevation of for his five achievements in long<br />\nNicholas Brown, Mgr.<br />\nto<br />\ncontinue<br />\nthe relationRamsay McDonald to the Prime distance running. In the entire<br />\nship.<br />\nMinister's post. If McDonald season of 1923, Booth has only<br />\nReady-to-wear Suits<br />\n$30 up<br />\n'GERHARD & REED CO.<br />\naccepted the government, this be- been distanced once in a race, at<br />\nLIBERTY ST.<br />\nReady-to-wear O'Coats . $35 up<br />\ning contingent on Baldwin's fail- the Penn relays, when laboring<br />\nTAILORS<br />\nAT SARATOGA<br />\nure to maintain a majority in the under the handicap of a severe<br />\n110 N. EUTAW STREET<br />\n211-213 E. Baltimore St.<br />\nHouse of Commons, when Parlia- cold, he finished third in the Inter2nd Floor<br />\nLUNCHEON<br />\nment convenes January 8, he will national Two-mile Championship.<br />\nTEA<br />\nbe the first labor leader to nave His record includes: National ColDINNER The Flag, Banner & Pennant Shop<br />\nimportant<br />\nreached the head of any<br />\nlegiate Two-mile Championship,<br />\ngovernment of the world..<br />\nSouth Atlantic Two-mile, Middle<br />\nROBBIN'S STYLE BUILT HATS<br />\n(Successors to Sisco Brothers)<br />\nMcDonald will probably accept States Cross Country Champion- 11.30 A.<br />\nSPECIACPARTIES<br />\n'<br />\n-. Flags, Banners, Pennants, Arm Bands,<br />\nFOR YOUNG MEN<br />\nEmblems, Silk Banners for Schools,<br />\nthe King's invitation, only to give ship, and National Cross Country<br />\nuntil<br />\nSocieties and Fraternities<br />\n7.30<br />\nP.<br />\nM.<br />\nPLAZA 6987<br />\nEngland an idea of what a Labor Championship. In this year he has<br />\n302 PARK AVE., BALTIMORE, MD.<br />\n122 W. BALTIMORE ST.<br />\ngovernment would be .like and of set several Hopkins and sectional<br />\nVernon 2355<br />\nR. H. Taylor<br />\nwhom it would be composed. Af- records. H4 also defeated the<br />\nter this he would introduce one of famed Joie Ray in a special mile<br />\nthe Labor Party's pet measures, race at the Georgetown games last<br />\nmeet defeat in Commons,and pre- winter. For his fine record Booth<br />\ncipitate a new general election. was awarded the Evening Sun<br />\nThe Conservatives would probably medal.<br />\ngo in in this case; but Labor ex- \"Doug\" Turnbull was the only<br />\npects to gain more on such an elec- Hopkins man to be given a medal<br />\ntion than its present number of for atheltics other than track. He<br />\nseats.<br />\nwas an All-Maryland backfield<br />\nAfter this outline of the present man for the past two football seasituation, Mr. Blanchard intro- sons and he led the country in<br />\nduced the subject of the Co-opera- place kicking this season, six of his<br />\ntive Movements. While this move- boots crossing the bar. In lacrosse<br />\nment is not controlled by the La- he has always played well; makbor Party, it is closely allied to it ing the All-American - first attack<br />\nby virtue of the personnel of the in 1922, and being picked for Allmovement. A great system of Maryland both seasons. Turnbull<br />\nchain 'stores has been built up, is captain of this year's team. The<br />\neach stockholder Waving one vote, Sun awarded him a medal fo4<br />\nand therewith a right to deal in these athletic activities. Clarke,<br />\nthese shops. With it has come an Booth and Turnbull are the presexchange house, a banking system, ent Hopkins holders of the award.<br />\nand Special Awards of $25.00 Each<br />\nco-operative building and other cooperative enterprises. Mr. Blan- EIGHT LAST YEAR'S VARSITY MEN<br />\nMAY BE IN LACROSSE LINEUP<br />\nchard called this one of the strikTo be eligible for one of these<br />\nASH prizes—totaling $1,500<br />\nContinued from page 1<br />\ning developments of English comcash prizes, you must be a college<br />\n—will be awarded for the best<br />\nlast a full game under this new<br />\nmerce.<br />\nstudent.<br />\nadvertisements written for college<br />\nFrom this stake the Labor Party style of game. The reason for the<br />\npublications by college students<br />\nAll advertisements must be rehopes to develop, through the use change is that the team will be light<br />\non the world-famous cereal proceived<br />\non or before January 15,<br />\nof the ballot, national ownership and the use of speed will keep it<br />\nducts, Grape-Nuts, Post ,Toasties<br />\n1924,<br />\nand<br />\nawards will be made<br />\nand direction of mines, railroads on the offensive. A fast, aggressive<br />\nand Posts's Bran Flakes.<br />\nFebruary<br />\n15,<br />\n1924.<br />\nand other basic industries. This is team is the prospect for 1924.<br />\nFour grand prizes, the first<br />\nenterprise,<br />\na distinctly Socialistic<br />\nAsk the business manager of<br />\n$200.00; the second $125.00; the<br />\nJOE MORAN<br />\nand is characteristic of the party,<br />\nNews-Letter or write us for infor$75.00; and the fourth $50.00<br />\nthird<br />\nJoe Moran, '23, paid a visit to<br />\nwhich is chiefly composed of Right<br />\nmation about the contest, and litfor the best advertisements rehis<br />\nalma mater the other day. He<br />\nWing Socialists. This is in diserature describing the products,<br />\nceived from all colleges, and special<br />\ntinct opposition to American La- came down from Elizabeth, N. J.,<br />\nright away. See if you can't write<br />\nprizes of $25.00 each for the best<br />\nbor, where Socialism is denounced where he is acting in a stock comthe best ad in your college, and<br />\nadvertisement received from each<br />\npany, with a collection of mash<br />\nas a rule.<br />\ntop the entire field as well.<br />\ncollege.<br />\nThe attitude in England toward notes, telegrams, and newspaper<br />\nLabor projects is very tolerant. clippings which proved to us that<br />\nIntercollegiate Ad-Writing Contest Department<br />\nThe upper classes say that, al- he has been extremely successful<br />\nand<br />\nhas<br />\nPostum Cereal Company, Inc.<br />\nmade many conquests.<br />\nthough they are distinctly opposed<br />\nBattle Creek, Michigan.<br />\nJoe<br />\nshowed great ability while<br />\nto the ideas of the Labor Party,<br />\n<br />\nThe St. REGIS<br />\nRESTAURANT<br />\n<br />\n$1,500.0<br />\n<br />\nin cash prizes<br />\n<br />\n1st Prize<br />\n2nd Prize<br />\n3rd Prize<br />\n4th Prize<br />\n<br />\n_<br />\n<br />\n$200.00<br />\n125.00<br />\n75.00<br />\n50.00<br />\n<br />\nC<br />\n<br />\nthey are willing to abide by the decision of the majority as expressed<br />\nby the ballot. This is a distinct<br />\nContradiction to American ideas,<br />\naccording to Mr. Blanchard, for<br />\nhere we denounce, and are intolerant to a high degree, to all new<br />\nideas.<br />\nAfter the conclusion of his address, Mr. Blanchard took ten<br />\nminutes for questions, and answered all the queries of the class.<br />\nitchell has promised to bring<br />\nOther men of prominence to addrees the class whenever possible.<br />\nHEE HAW<br />\n(Front the Epitome)<br />\nProf.: \"So You said I was a<br />\nlearned jackass, did you<br />\nFrosh:• \"No, sir; I merely remarked that von were a burro of<br />\ninformation.\"'<br />\n<br />\nfiexlieztalezecie\"<br />\n<br />\njAYI,OR<br />\n-Q_<br />\n<br />\n• -9<br />\n\"<br />\n<br />\nHurrah for Hopkins football team! Hurrah for Hopkins' coach! The<br />\nbest ever! Bringing new and well-deserved laurels to the University<br />\nwe all love. Baltimore is proud of you—and the applause is both<br />\nhearty and genuine.<br />\nPrinters of<br />\n<br />\nThe Johns Hopkins<br />\nNEWS-LETTER<br />\nCollege Literature<br />\nT,0 M BARD<br />\n<br />\nand<br />\n<br />\nSOUTH<br />\n<br />\nSTREETS<br />\n<br />\nWhen you have a moment to spare, slip over to The Barn<br />\nand ask Buck Bonner to show you the new models in<br />\nHess Shoes—they also are -some class.-<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 14, 1923<br />\n<br />\nIMPORTANT NOTICE<br />\nThere will be a rehearsal for the Barnstormers' musical<br />\ncomedy tonight at 7.30 P. M., at the Barn.<br />\nAll candidates for the cast, specialties Or the chorus<br />\nshould be present.<br />\n<br />\nFor real Fountain Pen Satisfaction<br />\nUse<br />\n<br />\n\"The Ink That Made<br />\nThe Fountain Pen Possible\"<br />\n<br />\nSANFORDS<br />\nFOUNTAIN PEN INK<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\n<br />\nENGINEERING STUDENTS<br />\nMAKE MUD PIES<br />\nVisitors in the Materials Testing<br />\nLaboratory are surprised to find<br />\nyoung men, with their sleeves rolled<br />\nup, playing with little piles of mud,<br />\nrolling balls of the same material in<br />\ntheir hands, and pressing it into little brass forms. Upon closer investigation, one finds that these<br />\nyoung men, who are engineering<br />\nupperclassmen, are not engaged in<br />\nthe Childish sport of making \"mud<br />\npies\" merely to while the time away,<br />\nbut are engaged in scientific research. The seeming \"piles of mud\"<br />\nare cements mixed in varying proportions, and the molds are the<br />\nstandard cement briquette forms<br />\nfor the tension test as . approved by<br />\nthe American Society of Testing<br />\nMaterials. This laboratory work is<br />\npart of the course in materials of<br />\nengineering, and is conducted by<br />\n1\\Ir. Frank W. Kouwenhouven,<br />\nhimself a research worker of some<br />\nrenown.<br />\n<br />\nINTELLIGENCE TEST<br />\nSince everybody is trying his<br />\nhand at intelligence tests, we respectfully submit this masterpiece. Correct solutions to the<br />\nproblems entitle you to membership in the Phi. B. K.<br />\n<br />\nURNER'S<br />\n<br />\nCOTILLON CLUB<br />\nDANCE<br />\nSaturday Night at 8:30<br />\nat the C. E. Fall<br />\nAdmission<br />\n<br />\n- - $1.00<br />\n<br />\nMEN'S SHOES<br />\n<br />\nN<br />\n<br />\nWhy was Canal Street named<br />\nafter the Panama Canal? Or<br />\nwasn't it? (Answer either a or<br />\nb).<br />\nDoes 2 plus 2 equal 5? If it<br />\ndoes, do not answer the. question,<br />\n<br />\nLeFrane 8z Ault<br />\n<br />\nGLOVES<br />\n<br />\nO one smokes<br />\nMelachrinos<br />\nwithout liking them<br />\n—for their quality<br />\ninstantly wins appreciation.<br />\n<br />\nfor it?<br />\n<br />\nLi- „,,,,..,,,,,<br />\n,,KOIIIK'ILL-14<br />\n<br />\nHOSIERY<br />\n<br />\nA<br />\n<br />\nWhat is Archimedes principle?<br />\nDoes he get compound interest<br />\n<br />\nbut if it doesn't, ask your math.<br />\nLimited<br />\nteacher the answer.<br />\nWhich of the 57 Varieties is<br />\nBARN CAFETERIA<br />\nEinstein's Theory of Relativity?<br />\nIs it preserved or pickled?<br />\nORDERS RECEIVED FOR<br />\nAre the following quotations<br />\ntaken from the Odyssey, or the<br />\nCOGGIN'S'<br />\nAeneid?<br />\nTransfer & Baggage Express<br />\nI. Ask Dad, he knows.<br />\nAUTOMOBILE SERVICE<br />\nMAGAZINE SAYS HOPKINS MEN<br />\n2. Children cry for it.<br />\nPHONE, HOMEWOOD 6886<br />\nSWINDLED INTO BOGUS<br />\nT. N. E.<br />\n3. The more you eat, the more<br />\niglEEgOtiflalEggEEILINAgg153041=1EGIE:MCIEI<br />\nContinued from page 1<br />\nyou want.—Hunter College Bulasking if there were any T. N. E. letin.<br />\nmembers at Johns Hopkins. R. N.<br />\nDempster, registrar, says that he re- FIFTEENTH ANNUAL INTERFRATERNITY CONFERENCE HELD<br />\nplied he knew of none and was unmaknow<br />\nfamiliar with the group<br />\nContinued front page 1<br />\ning efforts to become a regular col- nities adopted a constitution, elect\"The King of Lubricants\" lege fraternity, and to clear its rolls ed officers, and accepted a permaof clandestine groups.<br />\nnent organization. It will meet anlisted<br />\njournal<br />\nalso<br />\nofficial<br />\nThe<br />\nnually at the same time and place<br />\nSHERWOOD BROTHERS, INC.<br />\nAmherst, Alabama, Bucknell, Den- as the National Conference. Any<br />\n'glECIURNNEEDIREENNNEHEIMEMEME3<br />\nison, Pittsburgh, Washington and local which is a member of the<br />\nJefferson<br />\nand 'Williams as schools Conference ceases to be a member<br />\nSHIRTS<br />\nNECKWEAR<br />\nwhere students had been swindled when it is granted a charter from<br />\ninto an unauthorized chapter.<br />\na national fraternity.<br />\n421 N. HOWARD ST.<br />\n<br />\nA<br />\n<br />\nORIGINAL<br />\n<br />\nMELACI-IRINO<br />\n\"The One Cigarette Sold the World Over\"<br />\n<br />\nIle<br />\n<br />\nHub<br />\n<br />\nBaltimore's Great<br />\nMen's Store<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n(I Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nThere was also a meeting of the<br />\nrepresentatives of the Interfraternity Boards of the various colleges<br />\nand universities. Dan Klein represented the Hopkins Interfraternity<br />\nFURNITURE<br />\nBoard. Rushing agreements and<br />\nvarious interfraternity relations<br />\nwere' discussed at this meeting.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nOf the Better Class<br />\n<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\nDRAPERIES<br />\n<br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\n<br />\nURNER BROTHERS<br />\nI I I E. BALTIMORE STREET<br />\nBaltimore<br />\n<br />\nAt the<br />\n<br />\n,fue<br />\n<br />\nWashington Monument<br />\nOscar Thomas Olson, D.D.<br />\nMinister<br />\n<br />\notonodasvitol...\"1\"...,<br />\ntOir<br />\n01Ala<br />\n<br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br />\nThe purpose and program of th's<br />\nChurch will appeal to you. Look in<br />\non the Sunday afternoon \"At Home\"<br />\nfrom five to seven.<br />\n<br />\nSAVRVY(<br />\n<br />\nSunday morning worship at 11 o'clock.<br />\nYou'd be surprised at what<br />\nhe knows! He didn't learn<br />\nit all in a book, either. For<br />\ninstance—his clothes are<br />\ndreams and his grooming an<br />\ninspiration.<br />\nHe gets that finely turned-out<br />\nhead from \"Vaseline\"HairTonic.<br />\nIt smooths and grooms the hair.<br />\nAt all drug stores and student<br />\nbarber shops.<br />\n<br />\nSunday evening service at 8 o'clock.<br />\nMusic by vested chorus—choir of soloists.<br />\n<br />\n\"At the heart of the City\"<br />\n<br />\nSTETSON0cP<br />\n<br />\nEvery \"Vaseline\"Product is<br />\nrecommended everywhere<br />\nbecause of its absolute purity and effectiveness.<br />\n<br />\nVaseline<br />\nHAIR TONIC<br />\n<br />\nBats<br />\nThe new Stetson line includes a wide range of<br />\nsmart styles specially designed for young men<br />\n—all with the \"Stetson\" stamp of quality.<br />\n<br />\nSTYLED<br />\n<br />\nCR 'YOUNG MEN<br />\n<br />\nALL SEATS FREE<br />\n<br />\nRENT A CAR<br />\nDRIVE IT YOURSELF!<br />\nALL NEW. CLEAN CAR<br />\nFORDS, 12c PER MILE—DODGES OR HUPS, 18c PER MILE<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br />\n<br />\nDRIVE IT YOURSELF CO.<br />\n1725 N. CHARLES ST.<br />\n<br />\nVERNON 4049<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVIII, No. 20<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 14, 1923<br /><br />\nPRICE 5 CENTS<br /><br />\nMAGAZINE SAYS HOPKINS FELLOWSHIPS IN BELGIUM FIFTEENTH ANNUAL INTER- STUDENT FELLOWSHIP DIN- EIGHT LAST YEAR'S VARMEN SWINDLED INTO<br />\nOPEN FOR HOPKINS<br />\nNER TO BE HELD NEXT<br />\nSITY MEN MAY BE IN LAFRATERNITY CONFERBOGUS T. N. E.<br />\nSENIORS<br />\nTUESDAY EVENING<br />\nCROSSE LINEUP<br />\nENCE HELD<br />\nAttempting to Become Regular College C. R. B. Educational Foundation Will Conference of Locals Also Held at Hotel Dr. J. J. Coale to Speak to Students at Squad Practicing Regularly at HomeFraternity by Eliminating ClanAward Six Fellowships<br />\nSecond Dinner Called by PopPennsylvania, New York<br />\nwood Field<br />\ndestine *Groups<br />\nular<br />\nDemand<br />\nDr. John H. Latane, dean of the<br />\nWhen<br />\nThe fifteenth<br />\nthe Hopkins<br /><br />\nNational InterfraLacrosse<br />\nOn the evening of Tuesday, De- team lines up against<br />\nCollege of Arts and Sciences, has ternity Conference was held at the<br />\ntheir Alumni<br />\nreceived an announcement from the<br />\nHotel Pennsylvania in New York cember 18, at 6 o'clock, the second opponents for the first game of the<br />\nC. R. B. Educational Foundation,<br />\nNovember 30 and December 1. Student Fellowship Dinner of the 1924 lacrosse season, it is probable<br />\nInc., 42 Broadway, New York City, on<br />\nyear will be held at the Friends that four<br />\nalumni will still be playthat a number of American grad- The Conference discussed many<br />\nMeeting<br />\nHouse, under the auspices ing on the university<br />\nsubjects<br />\nof<br />\nvital<br />\ninterest<br />\nto<br />\nfraterteam. Bachuate fellowships for study in Belof the Hopkins \"Y.\"<br />\nman, last year's point, is back at<br />\ngium during the academic year nities and heard reports by repreThe attractive feature of the din1924-1925 will be awarded by sentatives of the different fraterner<br />\nwill be an address by Dr. J. J. the university doing graduate work;<br />\nnities from all parts of the counApril 1, 1924.<br />\nRoutson, Benedict and Middleton<br />\ntry. For the first time in its history, Coale, of the Presbyterian FederaA total of six fellowships will be<br />\ntion of Churches of Baltimore. The will also return in February, acawarded in a wide variety of sub- the Conference urged expansion of subject<br />\nof the address Will be some- cording to what appears to be more<br />\njects, including all those generally fraternities—both by the granting thing<br />\npertaining to sociology, since than three years and would be eliTheta Nu Epsilon has been<br />\ntaken by both academic and engi- of more chapters by existing na- it is<br />\nthat'<br />\nfield that Dr. Coale has gible for the team. Captain Turntionals, and by the formation of<br />\nstrongly opposed by the Interfrater- neering<br />\nundergraduates.<br />\ndevoted<br />\nmajor<br />\nemphasis in his bull, Barton, Almy and McDaniel<br />\nnew nationals. Due to the great<br />\nnity Board for years on college<br />\nFive Requirements<br />\nstudies,<br />\nand<br />\nhe<br />\nknows<br />\nsocial prob- are last year regulars who are back<br />\nincrease in the number of men in<br />\ncampuses, since its organization, To<br />\nat college this year. With eight of<br />\nbe eligible a candidate must college since the war many local lems as few men do.<br />\nmembers and methods have been se- (1) be an American citizen; (2)<br />\nlast<br />\nyear's varsity and a squad numThe<br />\nfirst<br />\nFellowship<br />\nDinner<br />\nwas<br />\nfraternities have grown up—many<br />\ncret, it has been charged. General have a thorough speaking and read- of<br />\nbering<br />\nfifty men, the lacrosse team<br />\nheld<br />\nlast<br />\nmonth,<br />\nand<br />\nit was very<br />\nwhich are deserving of a national<br />\nwell attended. The men were so is in better shape than was expected<br />\nprinciples of the fraternity have ing knowledge of French; (3) be charter.<br />\nenthusiastic that they voted unani- last year.<br />\nbrought denunciation from heads of a graduate, at time of application,<br />\n85 Locals Represented<br />\nbefore<br />\nor<br />\nThe team is working out three<br />\nSeptember,<br />\n1924,<br />\nmously to hold .similar dinners<br />\nof a colnational fraternity organizations.<br />\nThe chairman of the Committee<br />\nlege or professional school of recafternoons<br />\na week with \"Father<br />\nmonthly. A committee was apThe attempt being made now is to<br />\nognized standing in the United on Expansion of the Conference is- pointed to take charge of making Bill\" Schmeisser, Tommy Troxell,<br />\nmake a general fraternity by reorStates; (4) have definite plans for sued invitations to locals all over the necessary arrangements and of and Henry Baker. They will conganizing, being the purpose of the<br />\nhis proposed study in Belgium; and the country to send representatives securing the speakers. The com- tinue this practice throughout the<br />\nrecent meeting in New York.<br />\nto New York for a conference of<br />\n(5) be in good health.<br />\nmittee expresses much gratification winter unless the weather gets too<br />\nA report of the committee on<br />\nlocal<br />\nfraternities to be held at the<br />\nfellowship<br />\nEach<br />\ncarries<br />\nat having secured Dr. Coale for the cold. These three men will relina<br />\n\"Organizations Antagonistic tc,<br />\nstipend of 15,000 francs, plus tui- same time as the National Confer- meeting this month.<br />\nquish their coaching duties when. a<br />\nFraternities,\" of which Dean Clark<br />\ntion fees, and first class traveling ence. In response to this invitation<br />\ncoach<br />\nis appointed. It is thought<br />\nOwing<br />\nto<br />\nthe<br />\nlack<br />\nof a chapel<br />\nis chairman, was submitted.<br />\nexpenses from the residence or uni- representatives from eighty-five lo- and a \"Y\" building, the Y. M. C. that either Eddie Stuart or Alec<br />\nAt the meeting of the chairman<br />\nversity of the holder in the United cal fraternities met. These men A. at Hopkins is hampered in its Wolfe will undertake this job.<br />\nand national officers of the organStates, to and from the university came from almost every section of vital services to the Hopkins stuThere is a lot of material for<br />\nization it was agreed that charters<br />\nthe country. There was a reprein Belgium.<br />\ndents at Homewood. But the Fel- every position. The most promwould be granted only to petitionAmerican fellows will be required sentative from Maine, one from lowship Group, which has been ising candidates are: Goal—Love,<br />\ning groups with faculty endorseto report in Brussels by October 1, Florida, one .from Texas, one from heartily endorsed and supported by Routson and Cone; point—Bachment, not to allow use of. the or1924, and to reside in Belgium for Montana, and from practically ev- the students themselves, is a great man., and Post; cover point—Barganization's name except to chapat least eight months. Fellows may ery other state in the country.<br />\nachievement for this year. The ton, Milburn and Hess; first deters lawfully organized, to suspend<br />\nThe primary object of this Con- group is not closed, but is open to fense—Bates<br />\nchoose the Belgian university or<br />\nand Townsend; secchapters that do not live up to the<br />\ntechnical school which they wish to ference of Locals is not, as many all students. All the students wish- ond defense—Taylor and Watson;<br />\nideals of the organization, and elimattend, and in special cases may en- persons think, to form a national ing to attend the dinner next Tues- third defense—Benedict and Porinate as soon as possible dual memfraternity with a chapter in each of day, are requested to drop into the ter; center—Middle<br />\nroll at more than one university.<br />\nton, Summers,<br />\nberships.<br />\nthe<br />\ninstitutions represented at the \"Y\" office and sign for reservation. Di Paula and<br />\nHopkins seniors, who desire apSteck<br />\n;<br />\nthird attack—<br />\nRaps Kappa Beta Phi<br />\nplication blanks and further infor- Conference. The main purpose of<br />\nThe dinner will begin promptly Baldwin, Parsons and Robinson;<br />\n\"Kappa Beta Phi is,\" said Dean mation, can obtain same by address- the Conference was to urge the loat 6 P. M. and will end about an second attack—AIorrill and AaronClark, \"growing tremendously, and ing the Fellowship Committee, C. cals to try to become national, and<br />\nhour later.<br />\nson; first attack—Captain Turnis perhaps a greater menace, if pos- R. B. Educational Foundation,<br />\nInc., to discuss matters of importance to<br />\nbull; out home—Almy and O'Consible, to scholarship than -Theta Nu 42 Broadway, New York, N. Y.<br />\nfraternities. The committee on ex- FIRST COTILLON HELD LAST or ; in home—McDanie<br />\nl,. SanderEpsilon has been. The Ku Klux<br />\npansion of the National Conference FRIDAY. HOPKINS FOOT- son, Brown and<br />\nStick. Other men<br />\nKlan, whatever may be said for or LECTURE ANNOUNCED BY is composed of men who know as<br />\nBALL MEN GUESTS OF<br />\nwho look promising are Ackelitys<br />\nagainst it, is gaining a foothold in<br />\nmuch<br />\nabout<br />\nfraternities<br />\nas<br />\nany<br />\nother<br />\nREGISTRAR<br />\nHONOR<br />\nand Mills. Wolbert and Bonner of<br />\nour colleges, both North and South,<br />\nHopkins students interested in men in the country, and their exThe first of the three cotillons the football team are coming out for<br />\nand is entitled to some consideraperienced opinions are of great<br />\ngiven yearly by the Hopkins Cotil- the team and their presence ought<br />\nArchaeology will have a chance to<br />\ntion by this conference.\"<br />\nvalue to fraternity men.<br />\nlon Club was held Friday night at to strengthen the squad considerEight chapters suspended since hear an authority on the subject.<br />\nMany of the locals represented at<br />\nably.<br />\nthe war because they did not func- Mr. Dempster, Registrar, an- the Conference were already peti- the Maryland Casualty Club House.<br />\nAt the meeting of the Intercolletion in accordance with the policy nounced last Tuesday that Mr. A. tioning a national fraternity, but for The guests of honor were the Hop- giate<br />\nLacrosse League tomorrow at<br />\nof the grand council, were located J. B. Wace will give an illustrated the benefit of those who were not a kins men who actually participated New York, the<br />\nschedule will be<br />\nat the following schools: Universi- lecture on \"Ancient Greece: A resolution was adopted declaring in the Hopkins-Maryland football completed.<br />\nManager Perkins has<br />\nty of Arkansas, Purdue University,<br />\nwritten several times io the Naval<br />\nStudy in Archaeological Recon- the Conference to be in favor of game on Thanksgiving Day.<br />\nOhio State College, Northwestern struction\"<br />\nThe dance lasted from 9 until 12 Academy for a game in Baltimore.<br />\non the afternoon of the formation of one or more naUniversity, Colgate<br />\nUniversity, Thursday, December<br />\n20. The Civil tional fraternities by members of o'clock and refreshments were His letters have been unanswered,<br />\nUniversity of Maine, University of Engineering<br />\nHall, where the lec- the Conference of Local Frater- served at about 11:30. As is usual- but arrangements probably will be<br />\nChicago, and James Milliken Uni- ture will<br />\nly the case at Hopkins festivities, made for this game at the meeting<br />\nbe held, should be well nities.<br />\nversity. The list of_ schools sus- filled,<br />\nNew National Formed<br />\nthe music was furnished by the ever tomorrow..<br />\nfor Mr. Wace is exceptionpended previous to this report are:<br />\nIn<br />\nresponse.<br />\nto<br />\nthis<br />\nresolution,<br />\npopular orchestra of Louis Fisher. Gordon Post, a youth measuring<br />\nally well fitted to talk on the subColumbia University, Union Uni- ject.<br />\nrepresentatives of some of the lo- The exceptional music and the good six feet five inches from head to<br />\nversity, University of Texas, UniMr. Wace was born in England cal fraternities got together and dance floor combined to enchant the feet, and with arms to match, is<br />\nversity of California, Rutgers Col- iii<br />\n1879 and received his university founded a new national fraternity devotees of .Terpsichore. The dec- on the squad. With the aid of an<br />\nlege, University of West Virginia,<br />\ntraining at Carnbridge. He then with thirteen chapters. The name orations and refreshments were up extra large stick, Post is expected<br />\nSt. Lawrence University, Brown<br />\nstudied at the British Schools a of this new fraternity in (I) K H. to the usual Hopkins standard, and to be able to intercept everything<br />\nUniversity, Kenyon College, Case<br />\nboth Athens and Rome. Since 1914 Since a national fraternity must be the size of the crowd was \"just near him. He threatens to give the<br />\nSchool of Applied Science, Westveteran Bachman a fight for his job<br />\nhe has been director of the British at least fifteen years old before be- right.\" ,<br />\nern Reserve Medical College, Noring<br />\nadmitted<br />\nto<br />\nnational<br />\nthe<br />\nconat<br />\npoint.<br />\nThis<br />\ncotillon<br />\nthe<br />\ninnovation<br />\nsaw<br />\nArchaeology<br />\nSchool of<br />\nat Athens.<br />\nwich University, and Massachusetts<br />\nference<br />\nthis<br />\nnew<br />\nnational<br />\nwill<br />\nstill<br />\nSchmeisser<br />\nwhat<br />\nof<br />\nmay develop into a custom:<br />\nwill plan his style of<br />\nSome of his most important publiInstitute of Technology.<br />\ncations are: \"A Catalog of the be a member of the Local's Con- two favors were given to each cou- game this year along slightly difA recent issue of \"Keys,\" the Sparta<br />\nMuseum,\" \"Prehistoric ference. This is the first time in ple, a bill folder for the escort as ferent lines from those of last year.<br />\nJournal of T. N. E., gives the name Thessaly,\" and \"The Nomads of the history of fraternities that a well as a vanity card case for the He plans a faster and more agresof Johns Hopkins University as the Balkans.\"<br />\n\"grown up\" national has ever been girl. Each .favor bore a university sive team and will consequently<br />\nhaving an organization which has<br />\nformed. However, with the expeti- seal.<br />\nneed and use a great many substiswindled students into a bogus T.<br />\nence and co-operation of men who<br />\nThe patrons were selected from tutes. A job like center will probN. E. Inquiry at the registrar's ofknow so much about fraternities, the faculty. They included: Dr. ably he filled by three men in a<br />\nfice revealed that a letter had been<br />\nthe movement is almost certain to and Mrs. J. Elliot Gilpin, Dr. and single game on account of the neMeeting of Hullabalo Ediaddressed to them a month ago from<br />\nbe a success.<br />\ntorial Staff at Phi Gamma<br />\nMrs. John B. Whitehead, D. and cessity of speed. No center on the<br />\nnational officers of the organization<br />\nThe conference for Local Frater- Mrs. Broadus Mitchell, and Major squad could have the endurance to<br />\nDelta House tonight at 8.00.<br />\nContinued on page 4 col. 2<br />\nContinued on pair,4 col. 3<br />\nand Mrs. Gregory Hoisington.<br />\nContinued on Page 3, col. 2<br />\nTwenty chapters of Theta Nu<br />\nEpsilon have been suspended in the<br />\npast few years according to a report by its Grand Secretary to Dean<br />\nThomas Arkle Clark, at the Interfraternity Conference held in New<br />\nYork recently. Eight chapters have<br />\nbeen suspended because they did<br />\nnot function in accordance with the<br />\npolicy df the grand council.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 14, 1923<br /><br />\n2<br /><br />\nThe Johns Hopkins<br /><br />\nNews-Letter<br /><br />\nFOUNDED 1897<br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nTelephone<br /><br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br /><br />\nriroe— VT\".144,—<br />\n7(.617.:4-4<br />\nto\\<br /><br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, But Shoulder the Responsibility<br /><br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an' indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\n4#<br />\ni<br />\nr A1<br />\nA:<br /><br />\nPHILIP W. HOWARD, '25<br /><br />\nri:•7`<br /><br />\nA CHANGE IN POLICY?<br /><br />\nSir: I would suggest to you a<br /><br />\nWhy Young Men Should<br />\nConsider Insurance Selling<br />\n71-,0<br /><br />\nHomewood 100 To the Editor of<br />\nBusiness Manager<br /><br />\n.311 6-Ana<br /><br />\nSeven Reasons for Life Insurance Career<br /><br />\nTHE NEWS-LETTER:<br />\nEditor-in-Chief<br />\nJOSEPH LEOPOLD, '24<br /><br />\n\"<br /><br />\n;<br />\n14:<br />\n‘iret9C14i<br /><br />\nLIFE INSURANCE is founded on the<br />\nhighest ideals.<br />\nIt is capable of yielding a good income and<br />\nthe satisfaction of accomplishment.<br />\nIt offers opportunities for real leadership.<br />\nIt brings,insurance salesmen in close association with big business and big business<br />\nmen.<br />\nIt requires education in business methods,<br />\nlaw and finance.<br />\nIt is a field for workers, not shirkers.<br />\nIt is an alluring and practical calling for men<br />\nof dynamic energy.<br /><br />\ntd<br />\nF41<br /><br />\npkti<br />\ng4,1<br />\n4p1<br /><br />\nr<br />\n:ti!<br /><br />\npolicy which is very old to THE<br />\nNEWS-LETTER, but which has not<br />\nrfil<br />\nEditor<br />\nAssistant Managing<br />\nbeen used recently in your columns.<br />\nT. REESE MARsH, '24<br />\nCirculation Manager<br />\nThat policy is to print some \"speAssociate Editors<br />\nJOHN C. LEWIS, JR., '24<br />\ncial<br />\narticles\" of literary interest in<br />\nRICHARD C. TILGHMAN, '25<br />\nPARSONS,<br />\n'25<br />\nW.<br />\nJOHN<br />\nthe form of poetry, short stories,<br />\nPY4<br />\nAssistant Business Managers<br />\nBENJAMIN T. ROME,'25<br />\nkfi)<br />\nin<br />\nmagazirie<br />\narticles<br />\nexpositions<br />\nand<br />\ntiW<br />\nD. MILES MARRIAN,'25<br />\nJunior Editors<br />\nG. DONALD GIESKE,'25<br />\ngeneral.<br />\nARTHUR L. NELSON, '26<br />\n‘74<br />\nJOHN T. DIXON, '24<br />\n;(6),<br />\nERNEST A. STRATHMAN, '26<br />\nm<br />\nthat<br />\na<br />\nwell-established<br />\nfact<br />\nIt<br />\nis<br />\nrffMcKAY,<br />\n'26<br />\nA.<br />\nJ.<br />\nALGER G. HIM,'26<br />\nF<br />\nLIFE INSURANCE COMPANY<br />\nEDWARD 0. MICHEL, '26<br />\nC. EUGENE TOVELL, '24<br />\nHopkins has need of a literary magBOSTON. MASSACHUSETTS<br />\nOF<br />\nCHARLES G. HUTZLER, '24<br />\n041<br />\nOTHO J. KELLFR, III, '26<br />\nazine. It was decided last year—<br />\nJAMES YOUNG, '25<br />\nSixty-one years in business. Now insuring One Billion<br />\nKIDD,<br />\n'26<br />\nJACKSON<br />\nJ.<br />\nHENRY R. TURNBULL, '26<br />\nHundred Million dollars in policies on 3,250,000 lives<br />\nSeven<br />\nthe<br />\ndecision<br />\nand<br />\nshould<br />\nhold<br />\ngood<br />\nT. STRAN SUMMERS, '25<br />\nIQ<br />\nHAROLD S. GOODWIN, '26<br />\nfor several years—that the campus<br />\n111-4irs7V‘er 'r:VefitV.<br />\nti(G•17-......\"-tZZn.r0\"7.<br />\n4<br />\n1!..<br />\nMember Southern Intercollegiate Newspaper Association<br />\ncould not support another publication at the present time. Why,there<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md. —<br />\nfore, could not THE NEWS-LETTER COLLEGE BALL TO BE GIVEN FIELD CLUB TO ELECT OFFICERS ON MONDAY<br />\nCHRISTMAS NIGHT AT<br />\nrelieve the situation by publishing<br />\nBUFFALO, N. Y.<br />\nOfficers will be elected Monday,<br />\nfrom time to time articles of literOUR FOOTBALL SCHEDULE •<br />\ncharintercollegiate<br />\nball<br />\nof<br />\nA<br />\nDecember<br />\n17, for the Naturalists'<br />\nary interest?<br />\nAccording to the plans of.the athletic authorities, Hopkins will,<br />\nI would like to quote from a acter will be held on Christmas Field Club, according to informafrom year to year, as the quantity and quality of material increases,<br />\nnight, December 25th in the new tion given out this week by Dr. E.<br />\ndrop the smaller colleges from its football schedule and substitute similar letter to this one written to<br />\nHotel Statler, Buffalo, N. Y. It A. Andrews, of the Biology Deinstitutions of greater prowess and renown. The News-Letter the editor of THE NEWS-LETTER On<br />\nstrongly commends this move. There is nothing to be gained by January 16, 1915, and 'signed will be given under the auspices partment.<br />\nA president and secretary will be<br />\ndefeating Backwater College 21-0, while if this college should hap- \"Septimus,\" showing proof of the of Scalp and Blade, a society<br />\nattitude<br />\nof<br />\nthe<br />\nelected<br />\nto succeed Bruce Lineburg<br />\n1914-1915<br />\nNEWSHopkins'<br />\nscore,<br />\nlow<br />\nto<br />\na<br />\nBlue<br />\nBlack<br />\nand<br />\npen to defeat or hold the<br />\nunique among college organizaLETTER<br />\nstaff<br />\non<br />\nthis<br />\nmatter.<br />\nand<br />\nThe<br />\nEverett<br />\nMayers, who are doing<br />\nas<br />\na<br />\nresults<br />\npublicity<br />\nunfavorable<br />\nmuch<br />\nrecord suffers severely and<br />\ntions. The members of each of<br />\nquotation<br />\nfollows:<br />\nwork<br />\nfor<br />\na<br />\ndoctor's degree, which<br />\nconsequence.<br />\nits twenty chapters are picked requires their entire<br />\ntime. The plan<br />\n\"I understand that it is the polWhen Hopkins scheduled Cornell two weeks before the Mary- icy, and the wise<br />\nfrom<br />\nthe<br />\nmen<br />\nfrom<br />\nBuffalo<br />\natis<br />\nto<br />\nelect<br />\na<br />\ngraduate<br />\nstudent and<br />\npolicy, of THE<br />\nland game, in 1923, sport writers and fans predicted that a crippled<br />\ntending<br />\nthat<br />\nschool.<br />\nThere<br />\nis<br />\na<br />\none<br />\nofficer<br />\nfrom<br />\nthe<br />\nstudent<br />\nbody.<br />\nNEWS-LETTER not to enter the field<br />\nteam would be forced to battle for the State Championship. History of magazine<br />\nThe<br />\nNaturalist<br />\nField<br />\nClub<br />\nis<br />\ninarticles definitely; that controlling chapter in Buffalo<br />\nshows that not a man was injured in the game at Ithaca.<br />\nterested<br />\nin<br />\nstudying<br />\nplants and aniTHE NEWS-LETTER iS a publication composed of men who were memAnd it is a matter of history, too, that casualties seldom result devoted expressly to the printing of bers of Scalp and Blade when un- mals around Baltimore and the<br />\nstudy of birds. One of the club's<br />\nagainst a team, no matter how large or powerful it may be, that matters of college interest and of dergraduates.<br />\nbiggest features on its program of<br />\nplays hard, clean football. It is mostly the \"neck-twisting\" and real news value. In every policy,<br />\nFounded in 1893 at Cornell interesting promotional work is<br />\n\"kneeing\" of the smaller teams that causes the side lines to be popu- however, there is room for exceptions, and the exceptions which have University where there are al- building a $1,500 bird bath in the<br />\nlated with regulars.<br />\nso far been printed in THE NEWS- ways many men from Buffalo, Botanical Gardens.<br />\nHopkins cannot eliminate the so-called \"easy games\" in one year.<br />\nLETTER are notable enough them- Scalp and Blade has now spread<br />\nWe hope, however, that in the near future these contests may be<br />\nselves to form a part of THE NEWS- to the following colleges and uni- DORMITORY GET-TOGETHER<br />\nreduced to a minimum.<br />\nLETTER policy.<br />\nPLANNED BEFORE<br />\nversities in the order named:<br />\n\"The articles on Sidney Lanier<br />\nHOLIDAYS<br />\nMichigan, Pennsylvania, Renssewhich brought about this entire disJust before all the men of the<br />\nTHE CULTURED COLLEGIAN<br />\ncussion were published in the issue laer, Colgate, Hobart, Carnegie Dormitory leave for the holidays,<br />\nBranded with a great variety of ignominious appellations rang- of October 26. Dr. Greene's essay Tech, Massachusetts Institute of the House Committee plans to run<br />\ning from \"dissolute schoolboys\" to \"spiritless dupes,\" the American has followed about two months af- Technology, University of Illi- off a combination smoker and encollege men of today are subjected to numerous and concentrated terwards. If articles such as these nois, Williams, Dartmouth, Roch- tertainment. There will be several<br />\nattacks from educators and reformers throughout the country. The are indeed to be published every ester, Union, Harvard, Yale, novelty acts on the program, as well<br />\nUniversity, according to these authorities, has been relegated to the two months, at the end of the year Princeton, Syracuse, Lehigh, Co- as an interesting short talk on travel.<br />\nstatus of a country club the knowledge obtained from a college a collection of five or six articles lumbia and the University of Several musical numbers will encourse is of negligible value in life; and there is nothing, except per- have been formed—articles which, Buffalo.<br />\nliven the party: Smokes will be<br />\nhaps an exaggerated sense of pleasure, to distinguish the college if the standard set so far is main- The College Ball, now an an- passed around and a congenial time<br />\ntained, will be infinitely better than nual event in Buffalo society has is expected. The smoker will act<br />\ngraduate from the rank and file of the world.<br />\nthe average run of magazine arti- filled a long felt want. In earlier as a sort of last get-together before<br />\nThe college man, and the modern university, however, have their<br />\ncles.<br />\nyears there has been no Christmas the Dormitory is deserted.<br />\ndefenders who speak in vague terms of \"the broadening of view\"<br />\n\"Thus, it seems to me, THE function in Buffalo given by coland the \"culture\" to be obtained from higher education. Despite the<br />\nNEWS-LETTER has achieved a re- lege men for college men and<br />\nTHE SPORTING VIEW<br />\nhowls of protest that might arise in opposition to their views, a colmarkable compromise. Without in their friends that was large<br />\n(From London Punch)<br />\nlege course undoubtedly exerts a broadening influence. When we<br />\nthe least injuring its news value, it enough to attract thru its reunion<br />\narrive at the word \"culture,\" however, we stop and shudder. Is the<br />\nchronic<br />\nA<br />\nangler who has recenthas published two features which feature. The overflowing ataverage undergraduate a seeker after culture. We would like to dely purchased his first motor-car is<br />\nhave served to keep awake under- tendance at every annual College<br />\nfend him, but we fear that he does not aim at \"the training . .<br />\nnow telling people that he ran into<br />\ngraduate interest in purely literary Ball given has proved the demand<br />\nand refinement of the mind . . . and taste.\" There are mep<br />\na fine specimen of a pedestrian, but,<br />\nwork. If the occasional publication for a holiday function of this kind<br />\nat Hopkins who would attend a performance of a famous symphony<br />\nalthough he played it very tactfully,<br />\nof such articles' is to be continued open to all.<br />\norchestra in preference to the Scandals of '27. There are underit eventually got away.<br />\n(and there seems to be every rea- The Buffalo<br />\nCommittee in<br />\ngraduates who would prefer classical works to the sensational novels<br />\nson to suppose that this publication charge of the Ball is as follows:<br />\nof some of our modern authors. From observation, however, we<br />\nis to be continued). Hopkins will Weston M. Carroll, Pennsylvan- THE SEVEN AGES OF WOMEN<br />\nwould say that these men, if not greatly outnumbered, are at least<br />\n(From Banter)<br />\nhave a weekly paper which will con- ia,'17, General Chairman; Harvey<br />\nin the minority.<br />\ntain the best elements of the college Bierma, Pennsylvania, '17, ChairSafety pins.<br />\nWe feel that the college graduate posseses certain distinct advan- magazine and which will still main- man in Charge of Tickets and CaWhip pins.<br />\ntages over other men. There is much that is obtained from a college tain its value as a weekly recorder tering; Chas. K. Bassett, Cornell, Hair pins.<br />\ncareer that cannot be narrated in words nor calculated in dollars and of incidents in which the Univer- '14; Chairman of Publicity and<br />\nFrat. pins.<br />\ncents. The university student, however, has many opportunities to sity's men are interested.\"<br />\nInformation; Russell Paris, MichDiamond pins.<br />\nobtain that intangible asset, culture, that marks a truly educated man,<br />\nYours sincerely,<br />\nigan, '23, Chairman Floor ComClothes pins.<br />\nand seldom takes advantage of them to the fullest degree.<br />\nRolling pins.<br />\n•<br />\nSEPTIM US II. mittee.<br />\nManaging Editor<br />\nWILLIAM G. DEAN, JR., '24<br /><br />\nAdvertising Manager<br />\nFITZGERALD DUNNING, '24<br /><br />\nrele<br /><br />\nt,<br /><br />\nrtP.,<br />\nrfrz<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 14, 1923<br /><br />\n3<br /><br />\nHISTORY CLASS ADDRESSED TWO MORE HOPKINS MEN a member of the Dramatic Club<br />\nBoys, the place to get your<br />\nGET EVENING SUN MEDAL and on graduation went into theBY MR. BLANCHARD. TELLS<br />\nmeals—and they are honFOR ATHLETIC PROWESS atrical work. He secured a posiOF ENGLISH LABOR<br />\nest-to-goodness<br />\nmeals, well<br />\nthe<br />\nProctor<br />\nPlayers<br />\nand<br />\ntion<br />\nwith<br />\nSince the an<br />\nthat<br />\n.Mr. Blanchard, the well-known<br />\nthem<br />\nin<br />\nhas<br />\nplaying<br />\nwith<br />\nbeen<br />\nserve d, and reasonably<br />\nlabor leader, a man high in the Louis Clark had been awarded the<br />\ncouncils of the labor movement, Evening Sun medal, two other Elizabeth ever since. Among Joe's<br />\npriced—is at<br />\nand an authority on labor topics, Hopkins men have gained this sig- experiences is one o,f a humorous<br />\naddressed Dr. Mitchell's class in nal distinction in amateur athletics nature. He was taking a part of a<br />\nEconomic History last Wednes- —\"Doug\" Turnbull and Verne courtier—all dolled up in tights<br />\nOf course you know that<br />\nBooth. Of the total of eight med- and a feather on his cap. He drew<br />\nday.<br />\nThe Barn is handling orders<br />\nMr. Blanchard has just returned als. awarded this season, Hopkins his sword, accidentally pulled and<br />\nfor our clothes again this<br />\nfrom a trip to England, where he got three, leaving the other five to untied the string holding up his<br />\nyear.<br />\n1817 N. Charles St.<br />\nsat at the convention of the Eng- be distributed among five different tights and had to withdraw from<br />\nThe plan worked to<br />\n(Half Block below North Ave.)<br />\nthe stage, embarrassed, with the<br />\nlish Labor Party, last June. He colleges, schools and clubs.<br />\nmutual advantage last seaguffawing<br />\nof<br />\nthe<br />\naudience<br />\nin<br />\nhis<br />\ndescribed clearly the situation that<br />\nVerne Booth received the honor<br />\nson,<br />\nand we're mighty glad<br />\nears.<br />\nmay bring about the elevation of for his five achievements in long<br />\nNicholas Brown, Mgr.<br />\nto<br />\ncontinue<br />\nthe relationRamsay McDonald to the Prime distance running. In the entire<br />\nship.<br />\nMinister's post. If McDonald season of 1923, Booth has only<br />\nReady-to-wear Suits<br />\n$30 up<br />\n'GERHARD &amp; REED CO.<br />\naccepted the government, this be- been distanced once in a race, at<br />\nLIBERTY ST.<br />\nReady-to-wear O'Coats . $35 up<br />\ning contingent on Baldwin's fail- the Penn relays, when laboring<br />\nTAILORS<br />\nAT SARATOGA<br />\nure to maintain a majority in the under the handicap of a severe<br />\n110 N. EUTAW STREET<br />\n211-213 E. Baltimore St.<br />\nHouse of Commons, when Parlia- cold, he finished third in the Inter2nd Floor<br />\nLUNCHEON<br />\nment convenes January 8, he will national Two-mile Championship.<br />\nTEA<br />\nbe the first labor leader to nave His record includes: National ColDINNER The Flag, Banner &amp; Pennant Shop<br />\nimportant<br />\nreached the head of any<br />\nlegiate Two-mile Championship,<br />\ngovernment of the world..<br />\nSouth Atlantic Two-mile, Middle<br />\nROBBIN'S STYLE BUILT HATS<br />\n(Successors to Sisco Brothers)<br />\nMcDonald will probably accept States Cross Country Champion- 11.30 A.<br />\nSPECIACPARTIES<br />\n'<br />\n-. Flags, Banners, Pennants, Arm Bands,<br />\nFOR YOUNG MEN<br />\nEmblems, Silk Banners for Schools,<br />\nthe King's invitation, only to give ship, and National Cross Country<br />\nuntil<br />\nSocieties and Fraternities<br />\n7.30<br />\nP.<br />\nM.<br />\nPLAZA 6987<br />\nEngland an idea of what a Labor Championship. In this year he has<br />\n302 PARK AVE., BALTIMORE, MD.<br />\n122 W. BALTIMORE ST.<br />\ngovernment would be .like and of set several Hopkins and sectional<br />\nVernon 2355<br />\nR. H. Taylor<br />\nwhom it would be composed. Af- records. H4 also defeated the<br />\nter this he would introduce one of famed Joie Ray in a special mile<br />\nthe Labor Party's pet measures, race at the Georgetown games last<br />\nmeet defeat in Commons,and pre- winter. For his fine record Booth<br />\ncipitate a new general election. was awarded the Evening Sun<br />\nThe Conservatives would probably medal.<br />\ngo in in this case; but Labor ex- \"Doug\" Turnbull was the only<br />\npects to gain more on such an elec- Hopkins man to be given a medal<br />\ntion than its present number of for atheltics other than track. He<br />\nseats.<br />\nwas an All-Maryland backfield<br />\nAfter this outline of the present man for the past two football seasituation, Mr. Blanchard intro- sons and he led the country in<br />\nduced the subject of the Co-opera- place kicking this season, six of his<br />\ntive Movements. While this move- boots crossing the bar. In lacrosse<br />\nment is not controlled by the La- he has always played well; makbor Party, it is closely allied to it ing the All-American - first attack<br />\nby virtue of the personnel of the in 1922, and being picked for Allmovement. A great system of Maryland both seasons. Turnbull<br />\nchain 'stores has been built up, is captain of this year's team. The<br />\neach stockholder Waving one vote, Sun awarded him a medal fo4<br />\nand therewith a right to deal in these athletic activities. Clarke,<br />\nthese shops. With it has come an Booth and Turnbull are the presexchange house, a banking system, ent Hopkins holders of the award.<br />\nand Special Awards of $25.00 Each<br />\nco-operative building and other cooperative enterprises. Mr. Blan- EIGHT LAST YEAR'S VARSITY MEN<br />\nMAY BE IN LACROSSE LINEUP<br />\nchard called this one of the strikTo be eligible for one of these<br />\nASH prizes—totaling $1,500<br />\nContinued from page 1<br />\ning developments of English comcash prizes, you must be a college<br />\n—will be awarded for the best<br />\nlast a full game under this new<br />\nmerce.<br />\nstudent.<br />\nadvertisements written for college<br />\nFrom this stake the Labor Party style of game. The reason for the<br />\npublications by college students<br />\nAll advertisements must be rehopes to develop, through the use change is that the team will be light<br />\non the world-famous cereal proceived<br />\non or before January 15,<br />\nof the ballot, national ownership and the use of speed will keep it<br />\nducts, Grape-Nuts, Post ,Toasties<br />\n1924,<br />\nand<br />\nawards will be made<br />\nand direction of mines, railroads on the offensive. A fast, aggressive<br />\nand Posts's Bran Flakes.<br />\nFebruary<br />\n15,<br />\n1924.<br />\nand other basic industries. This is team is the prospect for 1924.<br />\nFour grand prizes, the first<br />\nenterprise,<br />\na distinctly Socialistic<br />\nAsk the business manager of<br />\n$200.00; the second $125.00; the<br />\nJOE MORAN<br />\nand is characteristic of the party,<br />\nNews-Letter or write us for infor$75.00; and the fourth $50.00<br />\nthird<br />\nJoe Moran, '23, paid a visit to<br />\nwhich is chiefly composed of Right<br />\nmation about the contest, and litfor the best advertisements rehis<br />\nalma mater the other day. He<br />\nWing Socialists. This is in diserature describing the products,<br />\nceived from all colleges, and special<br />\ntinct opposition to American La- came down from Elizabeth, N. J.,<br />\nright away. See if you can't write<br />\nprizes of $25.00 each for the best<br />\nbor, where Socialism is denounced where he is acting in a stock comthe best ad in your college, and<br />\nadvertisement received from each<br />\npany, with a collection of mash<br />\nas a rule.<br />\ntop the entire field as well.<br />\ncollege.<br />\nThe attitude in England toward notes, telegrams, and newspaper<br />\nLabor projects is very tolerant. clippings which proved to us that<br />\nIntercollegiate Ad-Writing Contest Department<br />\nThe upper classes say that, al- he has been extremely successful<br />\nand<br />\nhas<br />\nPostum Cereal Company, Inc.<br />\nmade many conquests.<br />\nthough they are distinctly opposed<br />\nBattle Creek, Michigan.<br />\nJoe<br />\nshowed great ability while<br />\nto the ideas of the Labor Party,<br /><br />\nThe St. REGIS<br />\nRESTAURANT<br /><br />\n$1,500.0<br /><br />\nin cash prizes<br /><br />\n1st Prize<br />\n2nd Prize<br />\n3rd Prize<br />\n4th Prize<br /><br />\n_<br /><br />\n$200.00<br />\n125.00<br />\n75.00<br />\n50.00<br /><br />\nC<br /><br />\nthey are willing to abide by the decision of the majority as expressed<br />\nby the ballot. This is a distinct<br />\nContradiction to American ideas,<br />\naccording to Mr. Blanchard, for<br />\nhere we denounce, and are intolerant to a high degree, to all new<br />\nideas.<br />\nAfter the conclusion of his address, Mr. Blanchard took ten<br />\nminutes for questions, and answered all the queries of the class.<br />\nitchell has promised to bring<br />\nOther men of prominence to addrees the class whenever possible.<br />\nHEE HAW<br />\n(Front the Epitome)<br />\nProf.: \"So You said I was a<br />\nlearned jackass, did you<br />\nFrosh:• \"No, sir; I merely remarked that von were a burro of<br />\ninformation.\"'<br /><br />\nfiexlieztalezecie\"<br /><br />\njAYI,OR<br />\n-Q_<br /><br />\n• -9<br />\n\"<br /><br />\nHurrah for Hopkins football team! Hurrah for Hopkins' coach! The<br />\nbest ever! Bringing new and well-deserved laurels to the University<br />\nwe all love. Baltimore is proud of you—and the applause is both<br />\nhearty and genuine.<br />\nPrinters of<br /><br />\nThe Johns Hopkins<br />\nNEWS-LETTER<br />\nCollege Literature<br />\nT,0 M BARD<br /><br />\nand<br /><br />\nSOUTH<br /><br />\nSTREETS<br /><br />\nWhen you have a moment to spare, slip over to The Barn<br />\nand ask Buck Bonner to show you the new models in<br />\nHess Shoes—they also are -some class.-<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 14, 1923<br /><br />\nIMPORTANT NOTICE<br />\nThere will be a rehearsal for the Barnstormers' musical<br />\ncomedy tonight at 7.30 P. M., at the Barn.<br />\nAll candidates for the cast, specialties Or the chorus<br />\nshould be present.<br /><br />\nFor real Fountain Pen Satisfaction<br />\nUse<br /><br />\n\"The Ink That Made<br />\nThe Fountain Pen Possible\"<br /><br />\nSANFORDS<br />\nFOUNTAIN PEN INK<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br /><br />\nENGINEERING STUDENTS<br />\nMAKE MUD PIES<br />\nVisitors in the Materials Testing<br />\nLaboratory are surprised to find<br />\nyoung men, with their sleeves rolled<br />\nup, playing with little piles of mud,<br />\nrolling balls of the same material in<br />\ntheir hands, and pressing it into little brass forms. Upon closer investigation, one finds that these<br />\nyoung men, who are engineering<br />\nupperclassmen, are not engaged in<br />\nthe Childish sport of making \"mud<br />\npies\" merely to while the time away,<br />\nbut are engaged in scientific research. The seeming \"piles of mud\"<br />\nare cements mixed in varying proportions, and the molds are the<br />\nstandard cement briquette forms<br />\nfor the tension test as . approved by<br />\nthe American Society of Testing<br />\nMaterials. This laboratory work is<br />\npart of the course in materials of<br />\nengineering, and is conducted by<br />\n1\\Ir. Frank W. Kouwenhouven,<br />\nhimself a research worker of some<br />\nrenown.<br /><br />\nINTELLIGENCE TEST<br />\nSince everybody is trying his<br />\nhand at intelligence tests, we respectfully submit this masterpiece. Correct solutions to the<br />\nproblems entitle you to membership in the Phi. B. K.<br /><br />\nURNER'S<br /><br />\nCOTILLON CLUB<br />\nDANCE<br />\nSaturday Night at 8:30<br />\nat the C. E. Fall<br />\nAdmission<br /><br />\n- - $1.00<br /><br />\nMEN'S SHOES<br /><br />\nN<br /><br />\nWhy was Canal Street named<br />\nafter the Panama Canal? Or<br />\nwasn't it? (Answer either a or<br />\nb).<br />\nDoes 2 plus 2 equal 5? If it<br />\ndoes, do not answer the. question,<br /><br />\nLeFrane 8z Ault<br /><br />\nGLOVES<br /><br />\nO one smokes<br />\nMelachrinos<br />\nwithout liking them<br />\n—for their quality<br />\ninstantly wins appreciation.<br /><br />\nfor it?<br /><br />\nLi- „,,,,..,,,,,<br />\n,,KOIIIK'ILL-14<br /><br />\nHOSIERY<br /><br />\nA<br /><br />\nWhat is Archimedes principle?<br />\nDoes he get compound interest<br /><br />\nbut if it doesn't, ask your math.<br />\nLimited<br />\nteacher the answer.<br />\nWhich of the 57 Varieties is<br />\nBARN CAFETERIA<br />\nEinstein's Theory of Relativity?<br />\nIs it preserved or pickled?<br />\nORDERS RECEIVED FOR<br />\nAre the following quotations<br />\ntaken from the Odyssey, or the<br />\nCOGGIN'S'<br />\nAeneid?<br />\nTransfer &amp; Baggage Express<br />\nI. Ask Dad, he knows.<br />\nAUTOMOBILE SERVICE<br />\nMAGAZINE SAYS HOPKINS MEN<br />\n2. Children cry for it.<br />\nPHONE, HOMEWOOD 6886<br />\nSWINDLED INTO BOGUS<br />\nT. N. E.<br />\n3. The more you eat, the more<br />\niglEEgOtiflalEggEEILINAgg153041=1EGIE:MCIEI<br />\nContinued from page 1<br />\nyou want.—Hunter College Bulasking if there were any T. N. E. letin.<br />\nmembers at Johns Hopkins. R. N.<br />\nDempster, registrar, says that he re- FIFTEENTH ANNUAL INTERFRATERNITY CONFERENCE HELD<br />\nplied he knew of none and was unmaknow<br />\nfamiliar with the group<br />\nContinued front page 1<br />\ning efforts to become a regular col- nities adopted a constitution, elect\"The King of Lubricants\" lege fraternity, and to clear its rolls ed officers, and accepted a permaof clandestine groups.<br />\nnent organization. It will meet anlisted<br />\njournal<br />\nalso<br />\nofficial<br />\nThe<br />\nnually at the same time and place<br />\nSHERWOOD BROTHERS, INC.<br />\nAmherst, Alabama, Bucknell, Den- as the National Conference. Any<br />\n'glECIURNNEEDIREENNNEHEIMEMEME3<br />\nison, Pittsburgh, Washington and local which is a member of the<br />\nJefferson<br />\nand 'Williams as schools Conference ceases to be a member<br />\nSHIRTS<br />\nNECKWEAR<br />\nwhere students had been swindled when it is granted a charter from<br />\ninto an unauthorized chapter.<br />\na national fraternity.<br />\n421 N. HOWARD ST.<br /><br />\nA<br /><br />\nORIGINAL<br /><br />\nMELACI-IRINO<br />\n\"The One Cigarette Sold the World Over\"<br /><br />\nIle<br /><br />\nHub<br /><br />\nBaltimore's Great<br />\nMen's Store<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n(I Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nThere was also a meeting of the<br />\nrepresentatives of the Interfraternity Boards of the various colleges<br />\nand universities. Dan Klein represented the Hopkins Interfraternity<br />\nFURNITURE<br />\nBoard. Rushing agreements and<br />\nvarious interfraternity relations<br />\nwere' discussed at this meeting.<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nOf the Better Class<br /><br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\nDRAPERIES<br /><br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br /><br />\nURNER BROTHERS<br />\nI I I E. BALTIMORE STREET<br />\nBaltimore<br /><br />\nAt the<br /><br />\n,fue<br /><br />\nWashington Monument<br />\nOscar Thomas Olson, D.D.<br />\nMinister<br /><br />\notonodasvitol...\"1\"...,<br />\ntOir<br />\n01Ala<br /><br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br />\nThe purpose and program of th's<br />\nChurch will appeal to you. Look in<br />\non the Sunday afternoon \"At Home\"<br />\nfrom five to seven.<br /><br />\nSAVRVY(<br /><br />\nSunday morning worship at 11 o'clock.<br />\nYou'd be surprised at what<br />\nhe knows! He didn't learn<br />\nit all in a book, either. For<br />\ninstance—his clothes are<br />\ndreams and his grooming an<br />\ninspiration.<br />\nHe gets that finely turned-out<br />\nhead from \"Vaseline\"HairTonic.<br />\nIt smooths and grooms the hair.<br />\nAt all drug stores and student<br />\nbarber shops.<br /><br />\nSunday evening service at 8 o'clock.<br />\nMusic by vested chorus—choir of soloists.<br /><br />\n\"At the heart of the City\"<br /><br />\nSTETSON0cP<br /><br />\nEvery \"Vaseline\"Product is<br />\nrecommended everywhere<br />\nbecause of its absolute purity and effectiveness.<br /><br />\nVaseline<br />\nHAIR TONIC<br /><br />\nBats<br />\nThe new Stetson line includes a wide range of<br />\nsmart styles specially designed for young men<br />\n—all with the \"Stetson\" stamp of quality.<br /><br />\nSTYLED<br /><br />\nCR 'YOUNG MEN<br /><br />\nALL SEATS FREE<br /><br />\nRENT A CAR<br />\nDRIVE IT YOURSELF!<br />\nALL NEW. CLEAN CAR<br />\nFORDS, 12c PER MILE—DODGES OR HUPS, 18c PER MILE<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br /><br />\nDRIVE IT YOURSELF CO.<br />\n1725 N. CHARLES ST.<br /><br />\nVERNON 4049<br /><br />"}], "field_media_file": [{"target_id": 37805, "display": null, "description": null, "target_type": "file", "target_uuid": "77b8f8f4-d4f8-48b1-bbef-cce7e3f32a76", "url": "http://digital.library.jhu.edu/system/files/2022-03/13092-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13092, "target_type": "node", "target_uuid": "7830872e-70ea-4bc6-ae0a-fe1f186ab6c0", "url": "/node/13092"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "186714eb-9206-4cde-ba64-56ec03d8aab2"}]}