{"mid": [{"value": 36723}], "uuid": [{"value": "27491147-5498-4491-9f64-b46e2f224487"}], "vid": [{"value": 36723}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:52:29+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12996-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:52:29+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:52:29+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVI. No 42<br />\nTICKET SALE CAMPAIGN<br />\nNEARING THE LAST<br />\nLAP<br />\n<br />\nBALTIMORE, MD., MARCH 28, 1922<br />\nNINE PREPARING FOR INI- SWISS CITIZEN SPEAKS ON<br />\nTIAL GAME WITH DICK\"GENEVA AS AN INTERNATIONAL CENTER\"<br />\nINSON<br />\n<br />\nTeam Race Tightens. Georgetown New Material Showing Up Well. Game M. Fatio of Geneva, Delivers Interesting Address, Illustrated by LanWith Brown Being Arranged<br />\nTakes Lead With Lafayette and<br />\ntern Slides, at Assembly.<br />\nfor June 21.<br />\nDarthmouth Close Behind.<br />\n<br />\nrly<br />\nch<br />\nor<br />\n<br />\ntain<br />\n<br />\nrle<br />\n<br />\n(1'(1<br />\n<br />\n21%<br />\n<br />\n\"St<br />\n<br />\nis1S<br />\n<br />\ns.<br />\n<br />\nry<br />\n<br />\nill<br />\n<br />\ner<br />\n<br />\nDRAMATIC CLUB PRESENTS<br />\n\"IF I WERE KING\"<br />\nOpening Night of McCarthy Drama Pleases Large<br />\nand Enthusiastic House. Ballet Novel Feature.<br />\n<br />\nMr. Guillaume Fatio, a citizen of<br />\nWith the worst part of a severe<br />\nwinter a thing of the past and signs Geneva, Switzerland, spoke on<br />\nPlaying before a well-filled<br />\nof spring daily becoming more evi- \"Geneva as an international center\" INDOOR TRACK SEASON house, the Dramatic Club last<br />\ndent, the baseball candidates have at last Thursday's Assembly. Mr.<br />\nCLOSES WITH SPRING<br />\nnight presented Justin McCarSCHEDULES NEAR<br />\nbuckled down to hard work in prep- Fatio used a set of lantern slides.<br />\nthy's drama, \"If I Were King.\"<br />\naration for the difficult schedule depicting /many of the interesting Past Performances of Track Team Con- When the curtain rose at 8.30 P.<br />\nsistent and Creditable. Bright Prosconfronting them, Coach Arm- and beautiful scenes around his napects for Spring Season.<br />\nM. there were but few vacant<br />\nAs the indoor track season seats remaining in the rear of the<br />\nstrong realizes that the first game tive city to illustrate his lecture.<br />\n\"Switzerland is in the center of closes and the minions of the<br />\nwith Dickinson College on April 1<br />\nspacious Lyric Theater. The auis but four days off and is putting Western Europe,\" declared M. Fa- white resin path turn their attendience came prepared for the usual<br />\nhis charges through daily practices, tio, \"at the point where three great<br />\ntion to the cinder track, it is fit- amateur performance, but before<br />\nwith the result that the nine is languages, German, French and<br />\nthat those interested in this the play had progressed far,<br />\nshowing signs of rounding into a Italian, meet.\" He went on to ex- ting<br />\nplain that these languages are not sport engage in a short period of hearty applause and many calls<br />\nsmooth-running machine.<br />\nbrought<br />\ninto a common tongue in retrospection. The indoor track for encores, indicated that the<br />\nSeveral capable men of last year's<br />\nSwitzerland,<br />\nbut each is spoken season just past has been in many<br />\nnine were lost to the team and<br />\nmonths of preparation for the prothere<br />\nin the district nearest the ways the most successful in the<br />\nCoach Armstrong has found some<br />\nduction<br />\nhad not been in vain.<br />\ndifficulty in filling the vacancies. country where that language is annals of the University. The men<br />\nIt may be said that the cast,<br />\nThe position of catcher, left vacant spoken. The Lake of Geneva dihave<br />\nindividuals<br />\nthe<br />\nteam<br />\nas<br />\nof<br />\nwhich<br />\nwas coached by Walter B.<br />\nby the withdrawal of Bill Wood, vides the little country in the Alps<br />\nhas been an especial source of wor- into two distinct sections, between showed far more than the accus- Swindell, came through the opensible for three-fourths of the sales. ry on the part of the coach. In the which lies Geneva. The section tomed enthusiasm and pep during ing night faultlessly and the audiAs a result of large returns by last week, however, Fred Rich, north of the lake has a climate sim- the indoor season, and better ence was liberal with demonstrailar to the mountainous parts of coaching and training facilities<br />\nseveral teams during the last right fielder on last year's nine, has<br />\ntions of their approval.<br />\nbe- Germany; that on the south side a have been provided. Hopkins<br />\nWeek the relative standing was been moved in to the position<br />\nThe character of Francois Viihind the bat, and is showing signs climate like the Mediterranean<br />\nmen have participated in ion, the poet-jailbird, the man<br />\ntrack<br />\nchanged considerably. Georgeof developing into a capable re- countries. The lake is very beautown, captained by 0. D. Collins, ceiver. Holland, a substitute catch- tiful; lined with fine old chateaux, three of the most important in- whose desire to be king is gratiemulating her recent performance er at Virginia last year, is trying bedecked with myriads of the old- door meets of the athletic world fied, was taken by Peirce Brawat the Fifth Regiment, forged to for the team and will make a strong fashioned barks that are used to and have succeeded repeatedly in ner. Brawner grasped his difficult<br />\nthe front with $165. Lafayette, led bid for the position. Herb Reif- carry stone from the mountains to breaking the tape.<br />\nlines and entered into the spirit of<br />\nby John Marchant, which had held schneider has been moved to third the builders tin the city.<br />\nAfter a long period of stren- his role with a finesse seldom seen<br />\nThe City of Geneva, according to<br />\nthe lead since the start, was to cover the place left vacant by<br />\nuous training a mile relay team in an amateur performer. W. H.<br />\nforced into a tie for second at \"Mike\" Strouse, who is on the M. Fatio, is very old. There are<br />\ncomposed<br />\nof Thompson, Nor- Moore, Jr., played the part ot<br />\n$150 with Cotts Coady's Dart- blacklist. Several promising men many old buildings in Geneva, inLouis XI., King of France, in an<br />\nmouth team. The latter team are staging a desperate battle to cluding the town hall, built in the wood, Skinner and Edwards was<br />\nadmirable<br />\nmanner.<br />\nmade a great spurt during the capture \"Herb's\" old position at thirteenth century, and containing chosen to represent Hopkins at<br />\nTaylor White and Joe Moran<br />\nweek, increasing its total by $78 short, among whom is \"Ben\" all the city records from that time. the several meets. The first perheld down the principal female<br />\nin three days. M. I. T. and Cor- Thomas, substitute outfielder last The history of Switzerland is di- formance of this quartet was at<br />\nroles. Both made excellent \"womnell were close behind the leaders season. \"Buck\" Grace is again ca- vided into four great epochs: The<br />\nthe Wilco A. A. indoor games en,\" and it is said that it was difWith $140 and $130 respectively. vorting around second and is dis- Roman occupation, 58 B. C.-450 held in New York City on Februficult to convince several of the<br />\nA. D.; the Burgundian occupation,<br />\nOthers which ranked high were playing all his last year's form.<br />\nary 18. Here the Hopkins indoor audience that the Dramatic Club<br />\nPittsburg, $110; Maryland, $100; It is undecided whether \"Andy\" from 450 until the tenth century;<br />\nrecord for the mile was broken by had not gone outside of the UniOregon,$70; Johns IrOpkins,$60; Knecht, who held down the hurling the rule of the Bishop of Geneva,<br />\na margin of more than two sec- versity for female assistance.<br />\nHoly Cross,$47; Navy,$45; Penn duties the latter part of last sea- from the tenth century until the fifonds. New York University and Their voices carried well, which<br />\nState, $35, and Syracuse, $30. In son, will resume his former posi- teenth, and the republic, which is Bowdoin<br />\nCollege were nosed out is unusual in male impersonators<br />\nthe state championship race Mary- tion at the initial sack or will again now existant. Geneva, declares M. by the Black and Blue in the recof the weaker sex. A member of<br />\nland still held the lead by a good toe the slab. Clayton, who former- Fatio, was the crossing ground<br />\nord time of 3.32 2-5.<br />\nthe student body asserts that he<br />\nmargin.<br />\nly pitched for Western Maryland, from the Protestant countries to<br />\nThe following week, on Febru- saw an elderly gentleman remonThe expectation that returns is, at present, the most promising Rome during the Reformation. ary<br />\n25, the same team duplicated strated by his spouse for using<br />\nWould start coming in faster to- of the new candidates for pitching For this reason much fighting took its previous performance by handopera glasses on White.<br />\nward the end of the campaign duties, although several others are place between the Calvinists and<br />\nily winning the South Atlantic<br />\nThe ballet, led by Clarence AdWas somewhat fulfilled. Competi- showing good form.<br />\nCatholics on Swiss soil, necessitat- Mile Relay event from University ams, drew more than its share of<br />\ntion for first place has practically<br />\nSharretts, last year's captain and ing the building of walls around the of Virginia and Washington and applause. The troupe, clad in dainbeen narrowed down to a half- cleanup man, is again demonstrat- city of Geneva to protect its citiLee. This meet was a great suc- ty costumes, delighted the audidozen teams and these are natur- ing his slugging propensities and is zens from the marauding armies.<br />\ncess from all angles, and upheld ence by their mastery of many<br />\nally working harder than others covering a lot of ground in the out- In1909 these walls were converted the traditions of the Annual Johns<br />\ndifficult steps, and. it was only<br />\nContinued on Page 3, Col. 2<br />\nfield. \"Chunky\" Wells, who took into a monument to the Calvinist Hopkins-Fifth Regiment games. after several encores that they<br />\nhis turn at cavorting in right gar- leaders, who are represented, along In this meet the Hopkins distance were reluctantly allowed to withNOTICES<br />\nden last year, and several able new with accounts of their principal medley relay team composed of draw.<br />\nmen, are fighting for the other po- work, on the white marble which<br />\nDorcus, Sauerville and<br />\nThe less important characters<br />\nMeeting of News-Letter<br />\nthe old Booth ran its initial race and easi.- of the drama had not been negface<br />\nof<br />\nembellishes<br />\nthe<br />\nsitions.<br />\nHayter,<br />\nhard-hitHarry<br />\n12.20<br />\ntoday,<br />\nEditorial Board<br />\ncenter fielder of last year's nine, walls. Among the leaders whose ly downed the flyers of Carnegie lected by Mr. Swindell and the<br />\nAssembly<br />\nThursday's<br />\nwho is now in the second year statues are on this great monument, Tech. The individual perform- cast, down to the pages, showed<br />\nWright<br />\nances of the other members of the the results of months of training<br />\nMedical School, will again take his is Roger Williams.<br />\nMrs. Victoria Hewitt<br />\nThe world's first public school track team were extremely cred- and practice.<br />\nplace in the outer defense. In fact,<br />\nnoted traveler and lecturer,<br />\nwill speak on \"Alaska, the<br />\nAfter the curtain had fallen<br />\nthe outfield promises to be the was founded in 1569 in Geneva by itable, and Verne Booth sent a<br />\nCalvin. It is still in existance, genuine thrill up the spines of the upon the last act and the memWonderland,\" assisted by a<br />\nstrongest in years.<br />\nlarge collection of beautiful<br />\nManager \"Ted\" Huey has ar- using the same building in which spectators when he pushed Con- bers of the cast had been apcolored slides.<br />\nranged a difficult schedule, which the great reformer inspected the nolly of Georgetown to the limit plauded and reapplauded, a _large<br />\nin the mile, and finished scarcely part of the audience repaired to<br />\nincludes some of the strongest school boys 500 years ago.<br />\nTONIGHT 8.15<br />\nAusIn<br />\n1859<br />\nthe<br />\nFrench<br />\nand<br />\na hair behind him.<br />\nthe Little Lyric where a dance<br />\nand<br />\nSouth,<br />\namong<br />\nEast<br />\nteams of the<br />\nSecond Night of<br />\nItaly.<br />\nfought<br />\na<br />\nin<br />\ntrians<br />\ngreat<br />\nbattle<br />\nappearance<br />\nThe<br />\nlast<br />\nof<br />\nthe<br />\nteam<br />\nwas held, which lasted until well<br />\nCornell,<br />\nPittsburgh,<br />\nthe<br />\nwhich are<br />\nDramatic Club's Production<br />\nA<br />\nbe<br />\na<br />\nSwiss<br />\ncitizen<br />\nhappened<br />\nto<br />\nindoors<br />\nwas<br />\nat<br />\nthe<br />\nGeorgetown<br />\nafter midnight. The music was<br />\n\"Orioles\", Syracuse, William and<br />\n\"IF I WERE KING\"<br />\nspectator of this battle and he was games held at Convention Hall, furnished by the University Jazz<br />\nMary and V. M. I.<br />\nTickets at Military Office<br />\nWhat might be termed the goals especially impressed with the Washington, on March 3. The Orchestra.<br />\nTonight the Dramatic Club will<br />\nof the season are the games with neglect shown toward the wounded varsity mile relay team finished<br />\nTOMORROW AT 4.30<br />\nexup<br />\nits<br />\nseason<br />\nwithout<br />\na<br />\ndefeat<br />\nbook<br />\nin<br />\npresent<br />\na second edition of the<br />\nthe<br />\nfield.<br />\nHe<br />\nwrote<br />\na<br />\nMay<br />\non<br />\nNavy<br />\nMaryland<br />\nand<br />\nState<br />\nin the C. E. Auditorium,<br />\nquartette<br />\nfrom<br />\nLehigh<br />\nwhen<br />\nthe<br />\nwounded<br />\nthe<br />\nplight<br />\nof<br />\nthose<br />\nproduction.<br />\ntolling<br />\nThe tickets for this<br />\nrivalry<br />\nThe<br />\nrespectively.<br />\n10,<br />\nand<br />\n6<br />\nProf. Durant Drake, Profesdowned<br />\nUniversity<br />\nwas<br />\ndecisively<br />\nthe<br />\nRed<br />\nafterward<br />\nperformance<br />\nwar<br />\nand<br />\nsoon<br />\nare in the hands of<br />\nin<br />\nis<br />\nand<br />\n•<br />\nState<br />\nHopkins<br />\nbetween<br />\nsor of Philosophy, at Vassar<br />\nrace.<br />\nThe<br />\nrewell<br />\nexecuted<br />\nthe<br />\nin<br />\na<br />\nstarted.<br />\nThe<br />\nRed<br />\nMilitary<br />\nmovement<br />\nOffice and Major<br />\nCross<br />\nresumpkeener than ever since the<br />\nCollege, will speak under the<br />\ncomposed<br />\nof<br />\nteam<br />\nserve<br />\nrelay<br />\nGarey<br />\nreports<br />\norganized<br />\nin<br />\ndefinitely<br />\nCross<br />\nwas<br />\nthat<br />\nthe house will<br />\ntion of athletic relations and.\"Curauspices of the Social Science<br />\nSomerville<br />\nand<br />\nwell<br />\nBonner,<br />\nSkinner,<br />\nbe<br />\ngeneral<br />\nconvenfilled.<br />\n1912<br />\nthe<br />\nA<br />\nIn<br />\n1864.<br />\ndance<br />\nwill likeley\" Byrd and his cohorts will leave<br />\nClub. His subject will be<br />\nover<br />\nvictory<br />\nscored<br />\na<br />\nwise<br />\nalso<br />\nbe<br />\nheld<br />\nDorcus<br />\nthe<br />\nRed<br />\nCross<br />\nwas<br />\nafter<br />\nof<br />\nheld<br />\nin<br />\nthis<br />\ntion<br />\nperformno stone unturned to defeat the<br />\n\"What is Americanism?\"<br />\nance.<br />\nContinued on Page 2,col. 3<br />\nContinued on page 3, col. 2<br />\nContinued on page 2, col 4<br />\nWith two-thirds of the fifteenday Ticket Sale Campaign a matter of the past on last Friday the<br />\ntotal value of tickets sold was<br />\nstill under the $2,000 mark. The<br />\nreturns for the first ten days totaled only slightly over $1,700 as<br />\ncompared with the $10,000 quota<br />\nfor that time. Tfte expectation<br />\nthat the teams with few or no sales<br />\nduring the first week would buckle<br />\ndown to real work later on, failed<br />\nto materialize. By the analysis of<br />\nreturns up to last Friday it was<br />\nseen that any success that the<br />\ncampaign might have would be<br />\ndue directly to the ten or more<br />\nteams that have really, put forth<br />\ntheir best efforts and are respon-<br />\n<br />\n)le<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 28, 1922<br />\n<br />\n2<br />\n<br />\nThe Johns<br />\n<br />\nHopkins News-Letter<br />\nFOUNDED 1897.<br />\n<br />\n$2.50<br />\n<br />\nSubscription<br />\n<br />\nHOPKINS TAKES NINTH<br />\nPLACE IN R. 0. T. C.<br />\nRIFLE MATCH<br />\n<br />\nVARSITY AND NON-VARSITY<br />\nMEN TO COMPETE IN INTER-CLASS TRACK MEET<br />\n<br />\nResults in Sixth Stage of N. R. A. Contest Will Be Held on April 7th.<br />\nMatch Announced. Government to<br />\nMany Events Open to Class<br />\n0<br />\n043:8:1E020E0KE03C€030303000302032=873C8:6Cf0<br />\nProvide New Rifles.<br />\nAthletes.<br />\n<br />\nteam took<br />\n<br />\nThe Hopkins rifle<br />\nThe Inter-class Track Meet,<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\n1879.<br />\nNovember<br />\n3,<br />\nwhich<br />\nwas originally scheduled for<br />\nCongress,<br />\nBaltimore, Md., under Act of<br />\nninth place in the Third Corps<br />\nApril 8, will be held<br />\n<br />\nPublished semi-weekly from October to June by the students of Johns Area Intercollegiate Gallery Rifle<br />\nHopkins University.<br />\nMatch with a score of 82.35. First April 7.<br />\n<br />\nFriday,<br />\n<br />\nThis meet will be very similar to<br />\n<br />\nBusiness communications should be addressed to the BUSINESS MAN- place went to Penn State's first that which was<br />\nheld last year with<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications team, which scored 93.43. Second<br />\nthe exception that, for the purpose<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\n<br />\nTelephone<br />\n<br />\nBusiness Manager:<br />\nGLOVER P. FALLON, '23.<br />\n<br />\nEditor-in-Chief:<br />\nWILLIAM H. MOORE, JR., '23<br />\nManaging Editor:<br />\nJ. HUDSON HUFFARD,'23<br />\nAssistant Managing Editor:<br />\nJOSEPH S. LEOPOLD, '24.<br />\n<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\n<br />\nAssociate Editors:<br />\nRIGNAL W. BALDWIN, JR., '23<br />\n<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN,'23.<br />\nFITZGERALD DUNNING, '24.<br />\nPHILIP W. HOWARD, '25.<br />\nMILES D. MARRIAN, '25.<br />\nG. DONALD GIESKE, '25.<br />\nD. H. STEVENSON, JR., '25.<br />\n<br />\nJunior Editors:<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br />\nG. COCHRAN Dous, '23.<br />\nT. CLYDE ROUTSON, '23.<br />\nR. C. TILGHMAN,'25.<br />\n<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nBALTIMORE, MD., MARCH 28, 1922<br />\nAS TO SPORTS PUBLICITY, AMATEUR AND PROFESSIONAL<br />\nThere was instituted, last fall, among the daily papers of a number of our largest cities, a most commendable movement, concerning<br />\nthe free publicity given professional sports.<br />\nFrom force of habit, rather than from necessity, the newspapers<br />\nhave become the free advertising slaves of professional sport promoters. Whereas, the scarcity of readable news has, on a number of<br />\noccasions, forced a wide use of this sort of material, custom is primarily responsible for the misuse of so much space.<br />\nIt was pointed out in a local daily, several months ago, that<br />\ncustom had forced the press to reserve a regular amount of space<br />\nfor the free advertising of the motor industry, the stage, etc.<br />\nSome of the bolder leaders of the above-mentioned movement<br />\nhave broken free from the yoke and have declared themselves as<br />\nagainst widespread free-advertising for other than amateur affairs.<br />\nInasmuch as the publishers are directly dependent upon their<br />\npaid advertisers, it is, of course, impossible to ward off entirely the<br />\nattack hurled by the publicity agents of the various promoters.<br />\nIt does seem, though, rather an unbalanced sort of publicity<br />\nthat devotes from one to three pages in a single edition to the promotion of monied sports. Its only possible excuse is that \"it advertises<br />\nthe city.\"<br />\nWe rather agree with the revolutionary editors who have cast<br />\noff the shackles, that the reading public would require but a single<br />\nseason to be educated into being enthusiastic followers of amateur<br />\nsport, either of the sand-lot or collegiate variety.<br />\nIn pushing non-professional sports, the press would not only<br />\nsucceed just as well in advertising the city, hut would give a great<br />\nboost to a system that is serving, in a large measure, to make America's manhood physically better off.<br />\nA single column per issue should be a sufficient news item on any<br />\nprofessional sport. The press has the power of turning the \"fan's\"<br />\ndollar into a hopper providing the already overpaid professional with<br />\nmore cash or of turning it into a machine designed to produce strong,<br />\nclean American citizens.<br />\nWhile there's life, there's hope, so there's a bare chance that<br />\neven the press may learn a thing or two in time.<br />\n•<br />\n<br />\nSUPPORT THE SPRING SCHEDULE<br />\nSaturday marks the opening of a spring sport schedule which<br />\npromises to be the best in years. Much depends upon solid student<br />\nsupport, if this schedule is to be a success. Last fall the enthusiasm<br />\nof the undergraduate body helped carry a good football team to the<br />\nstate gridiron championship. That same spirit of hearty support<br />\nand co-operation can overcome any difficulties which may appear this<br />\nspring. This loyal strain is not a thing new at Hopkins, but has<br />\nlately become active in manifold ways. Every class and each individual will prove equal to the occasion. The spring schedule will<br />\nbe a success.<br />\n<br />\nThe Season Ticket Sale Runs<br />\nto April 1st.<br />\nJUST FOUR MORE DAYS TO SELL YOUR NINE<br />\n<br />\nEverybody Hustle—Make it a Hot Finish<br />\n<br />\nce:oxe:inececocexecoxo:8:6:6:6:extoo<br />\n(Eke Ortextizorisr<br />\nHi<br />\n<br />\nplace went to the University of<br />\nMaryland, with the following colelges scoring in the mentioned order:<br />\nDrexel Institute, third; Penn<br />\nState, second team, fourth; Gettysburg, fifth; U. of H. Freshmen<br />\nteam, sixth, and Lehigh, seventh.<br />\nOur friendly enemy, St. John's,<br />\nwon fifteenth place. The teams<br />\nfired in standing, kneeling, sitting<br />\nand prone positions. In this match<br />\nHopkins made 3294 out of a possible 4,000.<br />\nThe low standard of shooting<br />\non the part of the Black and Blue<br />\nsharpshooters is due to the fact<br />\nthat the men were required to use<br />\nthe regulation rifles issued by the<br />\ngovernment. These were so badly<br />\nworn that accurate shooting was<br />\nimpossible. The R. 0. T. C. office<br />\nreported the matter to the government and the rifles, after being inspected, were condemned.<br />\nWithin a short while new rifles<br />\nwill be shipped. If our team had<br />\nhad the new rifles during the<br />\nmatch, the Military Department<br />\nis confident that the final score<br />\nwould have been much higher.<br />\nIn a dual match with the University of Maryland, which came<br />\nout second in the Corps Area<br />\nmatch the Hopkins team, using<br />\nthe new range rifles, won by a<br />\nmargin of forty points. In a match<br />\nwith Gettysburg, Hopkins snowed<br />\ntheir opponents under. The Black<br />\nand Blue has also defeated a number of other teams in dual matches<br />\nthat outranked us in the Corps<br />\nArea match.<br />\nThe final score of the sixth<br />\nstage of the Intercollegiate Rifle<br />\nAssociation match has been announced. In the prone position<br />\nthe Black and Blue shooters score<br />\nin the following manner:<br />\n99<br />\nSteck<br />\n98<br />\nL'Allemand<br />\n99<br />\nSherwood<br />\n100<br />\nWilgis<br />\nThe results in the standing position were not so high because<br />\nthe Hopkins men are not accustomed to firing in that position.<br />\nThe results of the entire match<br />\nwill not be announced until the<br />\nmiddle of April.<br />\nINDOOR TRACK SEASON CLOSES<br />\nContinued from Page 1<br />\n<br />\nMaryland State and George<br />\nWashington University. The men<br />\nin the open events performed in a<br />\nmanner which showed that the<br />\nprospects for a well balanced team<br />\nduring the spring season were exceptionally good.<br />\nThe board track on Straus Field<br />\nhas now been taken up and the<br />\ncinder path encircling the diamond is rapidly being put into<br />\nexcellent condition. With the already proven material left from<br />\nthe indoor season shaping up, and<br />\nwith many new and promising<br />\ncandidates out for all positions,<br />\nthe team is eagerly looking forward to what it is hoped will turn<br />\nout to be the best and most successful track season ever undertaken.<br />\n<br />\nof creating more competition in the<br />\nvarious classes, varsity men will<br />\ncompete among themselves and<br />\nnon-varsity men will be put in a<br />\nseparate class. This arrangement<br />\nwill do away with the idea that it<br />\nis useless for a non-varsity man to<br />\nenter any event because a \"sure bet\"<br />\nhas been entered. In order to balance the scores, varsity men will<br />\nbe awarded 3, 2 and 1 points for<br />\nfirst, second and third places, respectively, and non-varsity men<br />\nwill be awarded 5, 3 and 1 points.<br />\nAll points will be summed up for<br />\nthe various classes and the winning<br />\nclass will be awarded a banner.<br />\nAll class presidents will appoint<br />\nmen to take charge of the various<br />\nclass teams, organize them and get<br />\nthe members into first-class condition.<br />\nEnthusiasm should run high as<br />\nrivalry between the classes is very<br />\nkeen. A large number of entries<br />\nis expected, as this meet is one of<br />\nthe principal means of uncovering<br />\nnew material, some of the present<br />\nmembers of the varsity team having been discovered through this<br />\nmedium.<br />\nRegular track practice starts this<br />\nweek and will continue straight<br />\nthrough the entire spring season.<br />\nThe track men will practice regularly on Monday, Wednesday and<br />\nFriday and the field men on Tuesday and Thursday.<br />\nThere will be no handicaps in the<br />\nInter-Class Meet. There will be<br />\ntwo sections to each event, the nonvarsity men running first and then<br />\nthe varsity men. Following is the<br />\nlist of events and the order in<br />\nwhich they will be held:<br />\n100-yard dash, 1-mile run, broad<br />\njump, 120-yard high hurdles, javelin throw, 440-yard dash, pole<br />\n'ault, 220-yard dash,220-yard hurdles, discus throw, 880-yard run,<br />\nhigh jump, 2-mile run, shot put.<br />\nNINE PREPARING FOR INITIAL<br />\nGAME<br />\n<br />\nContinued from page 1<br />\n<br />\nBlack and Blue. Navy, still smarting from the 3-0 defeat administered at Homewood last spring, is<br />\nout for revenge and this game<br />\npromises to be one of the most hotly contested of the season.<br />\nNegotiations are being carried<br />\non at the present time by which<br />\nBrown University and Hopkins<br />\nmay meet in a baseball game on the<br />\n21st of June. Previous to this<br />\ntime, an attempt had been made to<br />\narrange a game between the two<br />\nuniversities earlier in the season,<br />\nbut the managers could not come<br />\nto terms so everything was called<br />\noff.<br />\nThe present negotiations came as<br />\na result of a letter from Brown, asking for a game with Hopkins at<br />\nProvidence on June 21. This is<br />\nthe Commencement Day game for<br />\nBrown and is probably the biggest<br />\none of the season. The Hopkins<br />\nteam will very likely make the trip,<br />\nalthough the University closes on<br />\nthe twentieth. The question of the<br />\namount of the guarantee is the only<br />\nthing that is now holding up the<br />\nsigning of the contracts.<br />\n<br />\nBeing the aesthetic ravings of a<br />\ngroup of Freshmen in the English<br />\nComposition Course.<br />\nSAY IT WITH FLOWERS<br />\n<br />\nRoses are red,<br />\nSoiled lilies. are gray,<br />\nMay loves Willie,<br />\nWillie loves May.<br />\nDaisies are white,<br />\nViolets are blue,<br />\nMay becomes angry,<br />\nWillie does, too.<br />\nTree leaves are green,<br />\nCarnations are pink,<br />\nWe'd finish this tale<br />\nBut we've run out of ink.<br />\nA man named Leander H. Leyden,<br />\nIn the village of Hickville abidin',<br />\nFell in love with young Betty,<br />\nA maid very pretty,<br />\nAnd asked that he do her providin'.<br />\nPa told him with cold-hearted<br />\ncandor,<br />\nThat he'd never be able to land<br />\nher;<br />\nBut they met on the sly,<br />\nWrote Pa a good-bye,<br />\nAnd a ring did our young friend<br />\nLe(h)ander. .<br />\nThis act, of course, raised papa's<br />\ndander;<br />\nHe sent right away to command<br />\nher<br />\nTo return to her home,<br />\nOr he swore he would roam,<br />\nTill he got his revenge on Le-and'er.<br />\nFor the benefit of those who<br />\ndoubt the power of the influence<br />\nwhich the News-Letter has over<br />\nthe lives of the students at Hopkins, we cite the following incident: A class in mathematics had<br />\nwaited the prescribed amount of<br />\ntime for their instructor. They<br />\nwere reluctant to leave, however.<br />\nThey were deeply interested in<br />\ntheir work, and nothing less than<br />\ndynamite could, have shattered<br />\ntheir heroic resolution to wait. At<br />\nthis critical moment, however,<br />\nsomeone produced a copy of the<br />\nNews-Letter. Across the top, in<br />\nblack, glaring letters over the announcement of the beginning of<br />\nthe ticket 'sale, appeared the<br />\nwords, \"Let's go.\" For those patiently waiting young men it appeared like the handwriting on the<br />\nwall. They went.<br />\ni4—spring is<br />\nhere,\" said the<br />\nwatchman, pointing to its place<br />\nin the works.<br />\n<br />\nHE WAS USED TO IT<br />\n<br />\nA little boy was standing with<br />\na number of other persons watching some carpenters at work.<br />\nEverything went all right until<br />\none of the carpenters hit his<br />\nthumb with a hammer. He immediately uttered many imprecations<br />\nupon all hammers in general and<br />\nthis one in particular. One of the<br />\nmen in the group said to the little boy: \"It would be better for<br />\nyou to go away from here.\"<br />\nThe little boy nonchalantly replied: \"Oh, that's all right. I'm a<br />\ncaddie.\"<br />\nThe authorities should get a geologist to solve the Stone case.<br />\n<br />\nrs<br />\n<br />\nI)1<br />\n<br />\nsa<br />\n<br />\ntoi<br />\nC.<br />\npi(<br />\nH<br />\nic<br />\n<br />\nle(<br />\nFr<br />\n111<br />\nis<br />\nfe:<br />\nhe<br />\nOs<br />\n<br />\nat<br />\nat<br />\ng•a<br />\nth(<br />\nof<br />\n<br />\nler<br />\nof<br />\n<br />\n'vi<br />\nha<br />\nlie<br />\ncli<br />\n<br />\n\f1_<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 28, 1922<br />\nHULLABALOO PHOTOS<br />\nTHIS WEEK<br />\nWednesday, March 29<br />\n12.30—Freshman Class<br />\nSophomore Class.<br />\nFriday12.30—Junior Class.<br />\nSenior Class.<br />\n\"H\" Men.<br />\n4.00—Omicron Delta Kappa.<br />\n4.15—Baseball Team.<br />\nLacrosse Team.<br />\nTennis Team.<br />\nTrack Team.<br />\n<br />\nNOTED LECTURER TO SPEAK<br />\nUNDER AUSPICES OF SOCIAL<br />\nSCIENCE CLUB<br />\n<br />\nELECTION AT THE LAST SOPHOMORE CLASS MEETING<br />\n<br />\nAt the Sophomore Class meeting<br />\nin the M. E. Hall last Thursday,<br />\nMount defeated Norwood in the<br />\nelection for Class Representative to<br />\nthe Student Council. The election<br />\nwas closely contested by both parties, Mount winning out by a small<br />\nmajority. It was moved and passed<br />\nthat the election be made unanimous. Mount will take the place of<br />\n\"Ted\" Morrison, who recently<br />\nwithdrew from the University.<br />\n<br />\n3<br />\n<br />\nLunches, Cigars<br />\nCigarettes<br />\nCandy, Soda and<br />\nPipes and Fountain Pens<br />\nAt the Barn<br />\nE. E. Adams<br />\n<br />\nAre You Planning A<br />\nVACATION ABROAD?<br />\nIf So, Call on<br />\n<br />\nA. SCHUMACHER & CO.<br />\nPASSENGER<br />\nAGENTS<br />\nfor all<br />\nTrans-Atlantic Lines<br />\n<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br />\n<br />\nCharles & Redwood Sts.<br />\n<br />\nJAS. H. DOWNS<br />\nENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br />\n<br />\nCUNARD - ANCHOR<br />\nSHIRTS<br />\n<br />\nSWISS CITIZEN SPEAKS ON GENEVA<br />\nContinued from Page 1<br />\n<br />\nWashington, where it was decided<br />\nthat that organization should look<br />\nfor and establish communication<br />\nbetween prisoners of war and those<br />\ndear to them. During the recent<br />\nwar the Red Cross at Geneva located and helped nearly five million<br />\ncaptured men.<br />\nBesides the Red Cross there are<br />\nmany other international organizations with headquarters at Geneva.<br />\nAccording to M. Fatio, negotiations<br />\nbetween nations have been held at<br />\nGeneva nearly every year since the<br />\nfirst international arbitration council met there in 1871 to settle the<br />\ndispute between the United States<br />\nand England. By far the greatest<br />\ninternational conference to meet in<br />\nGeneva is the League of Nations,<br />\nwhich meets there yearlw and keeps<br />\nan executive council there throughout the year.<br />\n<br />\nDr. Durant Drake, professor of<br />\nPhilosophy and education at Vassar College, will deliver an address<br />\ntomorrow afternoon at 4:30 in the<br />\nC. E. auditorium, under the auspices of the Social Science Club.<br />\nHis subject will be \"What Is Americanism ?\"<br />\nDr. Drake is quite a prominent<br />\nlecturer, having traveled through<br />\nFrance and England, -. where he<br />\nniade talks on various subjects. He<br />\nis also prominent as a college professor. He has, during his career,<br />\nheld the chair of professor of philosophy, of education, and of theology, at the University of Illinois,<br />\nat Wesleyan University, and<br />\nat ,Vassar College. He has also<br />\ngained considerable fame as an author. He has written \"Problems<br />\nof Things in Themselves,\" \"Problems of Conduct,\" and \"Problems<br />\nof Religion.\"<br />\nCAMPAIGN NEARS<br />\nThe lecture tomorrow afternoon TICKET SALE<br />\nTHE LAST LAP<br />\nwill not be the first that Dr. Drake<br />\nContinued from Page 1<br />\nhas made in Baltimore, as last week<br />\nare<br />\nout of the running. The<br />\nwhich<br />\nhe spoke on theology at a Baltimore<br />\nlatter are spurred on somewhat<br />\nchurch.<br />\nby their desire to escape the ignominy of the theoretical \"booby\"<br />\nAIN'T IT THE TRUTH?<br />\nprize and with these two motives<br />\nNow that the radiophone has<br />\ncome into existence, it should soon as well as loyalty to johns Hopbe possible for suffering students kins pushing the teams, a great<br />\nto take their eight-thirty lectures rush of sales can be forecasted<br />\nfor the last few days.<br />\nat home in bed.<br />\n<br />\nYou can tell a<br />\nsenior,but you<br />\ncannot tell<br />\nhim much.<br />\nHe's wise already, for he<br />\nbuys his shoes<br />\nat—<br />\n<br />\nNECKWEAR<br />\n<br />\nLefranc & Ault<br />\n421 N. HOWARD ST.<br />\n<br />\nHOSIERY<br />\n<br />\nGLOVES<br />\n<br />\nOn Charles Street<br />\n216 North<br />\n<br />\n•••<br />\n<br />\nWe are establishing a new standard in<br />\n<br />\nUnexcelled Passenger Services<br />\n<br />\nYoung Men's Suits at $29.50<br />\n<br />\nFrom<br />\nNew York, Boston, Montreal<br />\nTo<br />\nLiverpool, London, Glasgow,<br />\nSouthampton,Cherbourg,Hamburg<br />\n<br />\nStyles for every taste.<br />\nBaltimore's Best Store<br />\n<br />\nCunard & Anchor Steam Ship Lines<br />\n<br />\nHOCHSCHILD.KOHN 8c CO.<br />\n<br />\n107 E. Baltimore St. Balto., Md.<br />\nTelephone, Plaza 1522<br />\n<br />\nElkridge Farms Dairy<br />\nSTRICTLY FRESH MILK<br />\nProduced, Pasteurized and Bottled<br />\nin Howard County<br />\nCLARK BROS.<br />\n<br />\nEllicott City 23I-R<br />\n<br />\nSTRATTON<br />\n<br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\nDress Shirts<br />\n$3.00, $3.50 and $4.00<br />\nExpert Cleaners and Dyers<br />\nNegligee<br />\n$3.25 and $4.25<br />\nImported Madras<br />\n$5.25 and $6.25<br />\nTerms Cash, Less 10% 30 Days on<br />\nSpecial Rates to Hopkins Men<br />\nShirts<br />\nAlso a Full Line of Men's<br />\n211 E. 25th St.<br />\nHomewood 5205-W<br />\nFurnishings<br />\n<br />\nLIBERTY<br />\n<br />\n..1.111.11.191..........\"11,<br />\n<br />\n_<br />\n<br />\nCHAS. E. HERRING<br />\nEstablished 1873<br />\n<br />\nA.H.Fetting Man'fg Jewelry Co.<br />\n<br />\nYour Caterer at Hopkins Dances<br />\nMeet Your Friends in my<br />\n<br />\nMURAD<br />\n<br />\nBalcony—Soda Booths<br />\nManufacturers<br />\nGreek Letter Fraternity Jewelry<br />\nS. E. Cor. Maryland and North Ayes.<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nDANCING<br />\nMUSIC<br />\n<br />\nTHE TURKISH CIGARETTE<br />\n<br />\nEvery day MURADS are held<br />\nhigher in the estimation of the men<br />\nwho smoke them.<br />\n<br />\nIn Our Men's Section<br />\nYou will at all times find the newest<br />\nand most fashionable Neckwear, Shirts,<br />\nCollars and other Furnishings necessary<br />\nto a college man's wardrobe.<br />\n<br />\nThey are the standard of Taste.<br />\nThey never disappoint—never<br />\nfail—never change—<br />\n<br />\nHUTZLER 1310-1Elt Cs;<br />\nASRIKISWCA_GARETT ^el=<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nti<br />\n<br />\nFOR T<br />\nwar.<br />\nESPECI:WS<br />\nER1EVA C<br />\nARE'MADE<br />\nEXP<br />\nAND<br />\nG<br />\n1tA<br />\nAT<br />\nmscRINO OF tOGVA &A ADE, .,:as•4141,4,<br />\nSMOKER<br />\nCIGARETTES/<br />\nUct4k151.1<br />\n<br />\nime,\\Ae100xcevto<br />\ne<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n<br />\n.r.deas<br />\niiiiiiiiiiiiii<br />\n<br />\nDRAPERIES<br />\n<br />\nThey are 100% pure Turkish tobacco—ofthe finest varieties grown.<br />\nYou are proud to smoke them<br />\nin any company—on any occasion.<br />\nThey are the largest selling highgrade cigarette in the world.<br />\nThe cigarette smokers ofAmerica<br />\nDO prefer Quality to Quantity.<br />\n<br />\n343 NORTH CHARLES STREET<br />\n<br />\n\"Judge for Yourself—!\"<br />\n<br />\nIf an Accident Occurs<br />\n<br />\n411)))1)))i)))))) »li1JJ)lilii<br />\n<br />\nAnd Medicines and Dressings are required or other Real<br />\nPharmaceutical Service is Needed<br />\nTHINK OF<br />\n<br />\nHynson, Westcott and Dunning<br />\nTWO STORES:<br />\nEutaw Place and North Ave.<br />\nCharles and Franklin Sts.<br />\nMt. Vernon 890<br />\nMadison 405<br />\n<br />\nOs<br />\n<br />\nMalaYithegfidgatigift#<br />\na'wirgibiil4n0019~<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 28, 1922<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\n<br />\nPROF. GREGORY SPEAKS AT<br />\nA. S. C. E. MEETING<br />\n<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\n<br />\nMrs. Victoria Hewitt Wright will<br />\nHopkins Professor Gives Valuable Ad- A Column in Which the Correspondents<br />\nThe Y. M. C. A. is planning to<br />\nvice to Engineering<br />\nAre Allowed Latitude, But Shouldeliver a lecture on \"Alaska, the<br />\nStudents.<br />\nder the Responsibility.<br />\nsend at least fifty college men, 21<br />\n<br />\nAt the monthly meeting and<br />\nsmoker of the Hopkins branch of<br />\nImporters and Dealers in Fine Books<br />\nthe American Society of Civil En301 N. CHARLES ST.<br />\ngineers held last Tuesday night,<br />\nBaltimore, Md.<br />\nProfessor John Herbert Gregory,<br />\nhead of the Department of Civil<br />\nEngineering, spoke on 'Things a<br />\nYoung Engineer Should Know.\"<br />\nProf. Gregory has been actively<br />\nengaged in the field of sanitary<br />\n41r<br />\n.<br />\nengineering for the last twentye<br />\natterie) seven years, and so is well quali-es H.5, OSCAR G.LEVY<br />\nfied to advise young engineers. In<br />\nOWNERS<br />\nhis talk he told many interesting<br />\nil‘c<br />\n'<br />\n•C4 r'lfs<br />\nEast<br />\nSt.,<br />\nBaltimore<br />\n29<br />\nand delightful personal experiOne Door West of Light St.<br />\nences. The substance of his ad-<br />\n<br />\nalb<br />\n<br />\nFIFTY MEN WANTED TO VISIT EU- AT NEXT THURSDAY'S ASSEMBLY<br />\nROPE UNDER EXPERT LEADERAt next Thursday's Assembly,<br />\nSHIP<br />\n<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\n<br />\nAn letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\nIS ROMANCE DEAD?<br />\n<br />\nDoes the spirit that prompted<br />\nSir Walter to spread out his cloak<br />\nexist at Hopkins? Goucher wants<br />\nto know.<br />\n<br />\nyears of age, preferably Juniors, to<br />\nEurope next summer to study political and economic conditions of Europe. They will study from the<br />\npoint of view of Christian internationalism, the needs of European<br />\nstudents, that they may serve next<br />\nyear the cause of the Student Relief, if it is necessary.<br />\nEach man will bear his own expenses, which will be from $500 to<br />\n$700. Applications will be made<br />\nthrough the local student \"Y\" to<br />\nthe State Field Student Y. M. C. A.<br />\nThe program will demand special studies before going to New<br />\nYork and special training while en<br />\nroute on the sea. The trip will<br />\nprove to be a most interesting and<br />\ninstructive one.<br />\n<br />\nWonder Land.\"<br />\nThe story of Alaska is one of the<br />\nepics of American history and yet<br />\nthe tale of this land of romance remans, in a large degree, untold.<br />\nThe period of Alaska's proper development is at its dawn. Railroads,<br />\nhowever, are being constructed,<br />\nbridges are being built, and the second epoch of its civilization is at<br />\nhand.<br />\nEvery thinking American should<br />\nunderstand its resources, its problems, and its needs. Mrs. Hewitt,<br />\nwho has traveled and explored the<br />\nterritory from end to end, has a<br />\nwonderful collection of beautiful<br />\ncolored slides, many of which have<br />\nbeen painted by well-known artists.<br />\nAlaska, according to Mrs. Hewitt, would develop astoundingly under a broad governmental policy.<br />\n\"The world,\" she says, \"is crying<br />\nfor raw materials, gold, silver, copper, forest products, fish from the<br />\nsea, agricultural products—and<br />\nAlaska has them all in abundance.\"<br />\nMrs. Hewitt is a well-known and<br />\nentertaining speaker, and has<br />\nspoken before the New York Historical Society and other prominent<br />\norganizations.<br />\n<br />\nEditor-in-Chief, NEWS-LETTER.<br />\nDear Sir: Some time, back in<br />\nBOLE AGENTS FOR BALTIMORE<br />\nthe<br />\ndim distant past (we never<br />\nFor College Fraternity Bands<br />\ndress is as follows:<br />\nwere very good when it came to<br />\n(Greek Letter Societies)<br />\n\"After graduation, a young endates), one Sir Walter Raleigh<br />\ngineer should try to get an inside<br />\nspread<br />\nout a perfectly good-looking<br />\nThe Chas. Willing Surgical<br />\njob in an office rather than one in<br />\ncloak directly over a mud puddle.<br />\nInstrument Co.<br />\nthe field. Many young men want<br />\nso that a lovely lady, who chanced der Club performance some night<br />\n100 N. HOWARD ST., Baltimore, Md.<br />\nto get into the field, but this is a<br />\nSURGICAL INSTRUMENTS<br />\nto be Queen of England, could walk during Easter week, aren't you?<br />\nMicroscopes and Supplies,<br />\nmistaken idea. It is best to get,<br />\nover dry shod. Would the young Quite a few Hopkins alumni are<br />\nStethoscopes<br />\nBlood Lancets first, an insight into the manner \"gallants\" of today do as much for<br />\nBlood Counters<br />\nmembers of the club. Mr. George<br />\nin which engineering projects are<br />\ntheir ladies? Of course, they have Gillet and Mr. Jack Fulton, '12, are<br />\nplanned in the designing rooms.<br />\nan advantage because their coats on the Board of Governors. And<br />\nTherefore, a student should learn<br />\ncan<br />\ngo to the dry cleaners and come \"Doug\" Coulter, '21, is to play one<br />\nto do a good job of draughting<br />\nback<br />\ngood as new—and, for only of the important parts. They will<br />\nand lettering. In the office it is a<br />\nPrinters of Philological and<br />\ntwo<br />\ndollars!<br />\nNow, we ask you! appreciate the interest and the supgood plan to do quick and efficient<br />\nScientific Works<br />\nHow<br />\nmany<br />\nHopkins<br />\nmen will port of the men now in college.<br />\nwork. One should learn to use the<br />\n23 S. HANOVER ST.<br />\nspread<br />\nout<br />\ntheir<br />\ncoats<br />\nfor<br />\nsome And all we ask is, that you get your<br />\nSOUNDS IRISH<br />\nslide rule, the adding machine,<br />\nBaltimore, Md.<br />\nGoucher<br />\nEverygirls<br />\nto<br />\nwalk<br />\nover?<br />\ntickets for the night when fifteen<br />\nThe editor-in-chief of the Mcthe multiplying machine, the<br />\nThatcher calculating machine and body? Fine! But, we're not going Goucher girls have arranged for a Gill Daily, the official publication<br />\nto ask you to really do it—we'd just benefit performance—the Wednes- of McGill University of Montreal<br />\nother labor-saving appliances.<br />\nlike you to invest the $2.00 that it day night of Easter week. Tickets and the only college daily in CanAfter having been in an office<br />\nwould take to have the coat cleaned. will be on sale today in Gilman Hall ada, is J. L. O'Brien. His associate<br />\nfor a while, it is good to get out<br />\nso that, figuratively speaking, we —so bring your two dollars and as managing editor, is H. O'Haon construction work. Here the<br />\ncan walk over a rather large pud- spread out that coat.<br />\ngan. If we didn't know, we would<br />\nyoung engineer should learn the<br />\ndle,—and<br />\nnot<br />\nget<br />\nour<br />\nfeet<br />\nwet.<br />\nYou<br />\nYours,<br />\nsay<br />\nMcGill University was in<br />\npoint of view of the workingman,<br />\nall are going to the Paint and PowGOU<br />\nC<br />\nER,<br />\n'22.<br />\nfor it is only by doing this that<br />\none may get the best out of' his<br />\nmen. In the field, one should take<br />\nnotes methodically. For this pur17 E. Baltimore St.<br />\npose it is best to use standard<br />\nlcttcr-size paper in a Manila paper folder. Notes should be taken<br />\nPrinters of the<br />\nin black ink, so that, if desired,<br />\nblue prints may be taken from it.<br />\nJohns Hopkins News-Letter<br />\nWhen on another engineer's job<br />\nit is best to jot down notes on<br />\nsmall pieces of paper. Abroad the<br />\nengineers are rather sensitive and<br />\nobject to anyone's taking notes.<br />\nTherefore, in this case, one should<br />\nwear stiff cuffs and make notes on<br />\nthese. After being rewritten, the<br />\nnotes should be filed away.<br />\nThe engineer should keep upto-date by reading engineering periodicals. He should read not only<br />\nEN you get out into the medical world, you'll find<br />\nthe articles about his particular<br />\nyoung<br />\ndoctors are judged by something more than<br />\nline, but also a little besides. He<br />\ndiagnostic ability and knowledge of their subject. The atshould also read the special mumosphere of success plays its part—the evidence that you<br />\nnicipal reports and the governhave\"arrived.\" And among the little details that indicate<br />\nCollege Literature<br />\nsuccess, there's the habit of preferring<br />\nment reports that come out anLOMBARD and SOUTH STREETS<br />\nnually. \"The Proceedings of the<br />\nAmerican Society of Engineers\"<br />\nare also valuable.<br />\nSHOES<br />\nBefore doing anything an enor<br />\ngineer should (1) stop and conUNIVERSITY MEN<br />\nsider what he is going to do, and,<br />\nFor Dress<br />\nFor Sport Wear (2) see if what he is about to do<br />\nSmart Styles—Best Leathers agrees with what has been done,<br />\nModerate Price::<br />\nwhat is being done, and what will<br />\nbe done.<br />\nRemember that Melachrino is a masterblend<br />\nof the finest Turkish Tobaccos as originated<br />\nThis address was extremely inby Miltiades Melachrino.Egyptian cigarettes<br />\nteresting and was thoroughly en19 W. LEXINGTON ST.<br />\nare simply those that originated in Egypt.<br />\nBut the tobacco is what you want to know<br />\n1\"›<br />\njoyed by the many members who<br />\nabout— and if it's Melachrino— it's right.<br />\nwere present. This society is a<br />\nstudent branch of the American<br />\nSociety of Civil Engineers, an or\"College\" isn't labeled<br />\nhaving over 15,000<br />\nganization<br />\non our clothes, but<br />\nHopkins branch<br />\nThe<br />\nmembers.<br />\nthe college spirit is<br />\nobtains prominent engineers to<br />\nthere never-the-less in<br />\nspeak at its monthly meetings on<br />\nevery line.<br />\nnontechnical subjects connected<br />\nwith civil engineering. Another<br />\npurpose of these meetings is to<br />\naccustom the students to the manBaltimore and Hanover<br />\nner in which engineering meetings<br />\nare conducted.<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n<br />\nIn Medicine<br />\n<br />\nelachrino<br />\n<br />\n\"The One Cigarette Sold the World Over\"<br />\n<br />\nWYMAN<br />\n<br />\nIsaac Hamburger and Sons<br />\n<br />\nth<br />\nrn<br />\nIn<br />\nSi<br />\naf<br />\nin<br />\nin<br />\n<br />\nai<br />\ncl<br />\ndz<br />\nat<br />\nit<br />\nA<br />\n<br />\nSc<br />\nrc<br />\nal<br />\n<br />\n$1<br />\nth<br />\n<br />\nhz<br />\nfo<br />\n<br />\nflz<br />\n<br />\ntipz<br />\nI.<br />\nat<br />\nth<br />\ncax<br />\n<br />\n$4<br />\n<br />\nOt<br />\n<br />\nar<br />\nsa<br />\ngr<br />\n<br />\n10<br />\nSt;<br />\nte<br />\nat<br />\n<br />\nPc<br />\nth<br />\nra<br />\n<br />\nad<br />\n<br />\nsa<br />\nga<br />\nsv<br />\n<br />\nC(<br />\nof<br />\nUs<br />\n<br />\nas<br />\nar<br />\nac<br />\nfli<br />\n<br />\nPa<br />\nde<br />\nno<br />\n<br />\nde<br />\nti<br />\nin<br />\n<br />\nso<br />\nab<br />\nfr.;<br />\nho<br />\n<br />\nat<br />\nCI<br />\nth,<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVI. No 42<br />\nTICKET SALE CAMPAIGN<br />\nNEARING THE LAST<br />\nLAP<br /><br />\nBALTIMORE, MD., MARCH 28, 1922<br />\nNINE PREPARING FOR INI- SWISS CITIZEN SPEAKS ON<br />\nTIAL GAME WITH DICK\"GENEVA AS AN INTERNATIONAL CENTER\"<br />\nINSON<br /><br />\nTeam Race Tightens. Georgetown New Material Showing Up Well. Game M. Fatio of Geneva, Delivers Interesting Address, Illustrated by LanWith Brown Being Arranged<br />\nTakes Lead With Lafayette and<br />\ntern Slides, at Assembly.<br />\nfor June 21.<br />\nDarthmouth Close Behind.<br /><br />\nrly<br />\nch<br />\nor<br /><br />\ntain<br /><br />\nrle<br /><br />\n(1'(1<br /><br />\n21%<br /><br />\n\"St<br /><br />\nis1S<br /><br />\ns.<br /><br />\nry<br /><br />\nill<br /><br />\ner<br /><br />\nDRAMATIC CLUB PRESENTS<br />\n\"IF I WERE KING\"<br />\nOpening Night of McCarthy Drama Pleases Large<br />\nand Enthusiastic House. Ballet Novel Feature.<br /><br />\nMr. Guillaume Fatio, a citizen of<br />\nWith the worst part of a severe<br />\nwinter a thing of the past and signs Geneva, Switzerland, spoke on<br />\nPlaying before a well-filled<br />\nof spring daily becoming more evi- \"Geneva as an international center\" INDOOR TRACK SEASON house, the Dramatic Club last<br />\ndent, the baseball candidates have at last Thursday's Assembly. Mr.<br />\nCLOSES WITH SPRING<br />\nnight presented Justin McCarSCHEDULES NEAR<br />\nbuckled down to hard work in prep- Fatio used a set of lantern slides.<br />\nthy's drama, \"If I Were King.\"<br />\naration for the difficult schedule depicting /many of the interesting Past Performances of Track Team Con- When the curtain rose at 8.30 P.<br />\nsistent and Creditable. Bright Prosconfronting them, Coach Arm- and beautiful scenes around his napects for Spring Season.<br />\nM. there were but few vacant<br />\nAs the indoor track season seats remaining in the rear of the<br />\nstrong realizes that the first game tive city to illustrate his lecture.<br />\n\"Switzerland is in the center of closes and the minions of the<br />\nwith Dickinson College on April 1<br />\nspacious Lyric Theater. The auis but four days off and is putting Western Europe,\" declared M. Fa- white resin path turn their attendience came prepared for the usual<br />\nhis charges through daily practices, tio, \"at the point where three great<br />\ntion to the cinder track, it is fit- amateur performance, but before<br />\nwith the result that the nine is languages, German, French and<br />\nthat those interested in this the play had progressed far,<br />\nshowing signs of rounding into a Italian, meet.\" He went on to ex- ting<br />\nplain that these languages are not sport engage in a short period of hearty applause and many calls<br />\nsmooth-running machine.<br />\nbrought<br />\ninto a common tongue in retrospection. The indoor track for encores, indicated that the<br />\nSeveral capable men of last year's<br />\nSwitzerland,<br />\nbut each is spoken season just past has been in many<br />\nnine were lost to the team and<br />\nmonths of preparation for the prothere<br />\nin the district nearest the ways the most successful in the<br />\nCoach Armstrong has found some<br />\nduction<br />\nhad not been in vain.<br />\ndifficulty in filling the vacancies. country where that language is annals of the University. The men<br />\nIt may be said that the cast,<br />\nThe position of catcher, left vacant spoken. The Lake of Geneva dihave<br />\nindividuals<br />\nthe<br />\nteam<br />\nas<br />\nof<br />\nwhich<br />\nwas coached by Walter B.<br />\nby the withdrawal of Bill Wood, vides the little country in the Alps<br />\nhas been an especial source of wor- into two distinct sections, between showed far more than the accus- Swindell, came through the opensible for three-fourths of the sales. ry on the part of the coach. In the which lies Geneva. The section tomed enthusiasm and pep during ing night faultlessly and the audiAs a result of large returns by last week, however, Fred Rich, north of the lake has a climate sim- the indoor season, and better ence was liberal with demonstrailar to the mountainous parts of coaching and training facilities<br />\nseveral teams during the last right fielder on last year's nine, has<br />\ntions of their approval.<br />\nbe- Germany; that on the south side a have been provided. Hopkins<br />\nWeek the relative standing was been moved in to the position<br />\nThe character of Francois Viihind the bat, and is showing signs climate like the Mediterranean<br />\nmen have participated in ion, the poet-jailbird, the man<br />\ntrack<br />\nchanged considerably. Georgeof developing into a capable re- countries. The lake is very beautown, captained by 0. D. Collins, ceiver. Holland, a substitute catch- tiful; lined with fine old chateaux, three of the most important in- whose desire to be king is gratiemulating her recent performance er at Virginia last year, is trying bedecked with myriads of the old- door meets of the athletic world fied, was taken by Peirce Brawat the Fifth Regiment, forged to for the team and will make a strong fashioned barks that are used to and have succeeded repeatedly in ner. Brawner grasped his difficult<br />\nthe front with $165. Lafayette, led bid for the position. Herb Reif- carry stone from the mountains to breaking the tape.<br />\nlines and entered into the spirit of<br />\nby John Marchant, which had held schneider has been moved to third the builders tin the city.<br />\nAfter a long period of stren- his role with a finesse seldom seen<br />\nThe City of Geneva, according to<br />\nthe lead since the start, was to cover the place left vacant by<br />\nuous training a mile relay team in an amateur performer. W. H.<br />\nforced into a tie for second at \"Mike\" Strouse, who is on the M. Fatio, is very old. There are<br />\ncomposed<br />\nof Thompson, Nor- Moore, Jr., played the part ot<br />\n$150 with Cotts Coady's Dart- blacklist. Several promising men many old buildings in Geneva, inLouis XI., King of France, in an<br />\nmouth team. The latter team are staging a desperate battle to cluding the town hall, built in the wood, Skinner and Edwards was<br />\nadmirable<br />\nmanner.<br />\nmade a great spurt during the capture \"Herb's\" old position at thirteenth century, and containing chosen to represent Hopkins at<br />\nTaylor White and Joe Moran<br />\nweek, increasing its total by $78 short, among whom is \"Ben\" all the city records from that time. the several meets. The first perheld down the principal female<br />\nin three days. M. I. T. and Cor- Thomas, substitute outfielder last The history of Switzerland is di- formance of this quartet was at<br />\nroles. Both made excellent \"womnell were close behind the leaders season. \"Buck\" Grace is again ca- vided into four great epochs: The<br />\nthe Wilco A. A. indoor games en,\" and it is said that it was difWith $140 and $130 respectively. vorting around second and is dis- Roman occupation, 58 B. C.-450 held in New York City on Februficult to convince several of the<br />\nA. D.; the Burgundian occupation,<br />\nOthers which ranked high were playing all his last year's form.<br />\nary 18. Here the Hopkins indoor audience that the Dramatic Club<br />\nPittsburg, $110; Maryland, $100; It is undecided whether \"Andy\" from 450 until the tenth century;<br />\nrecord for the mile was broken by had not gone outside of the UniOregon,$70; Johns IrOpkins,$60; Knecht, who held down the hurling the rule of the Bishop of Geneva,<br />\na margin of more than two sec- versity for female assistance.<br />\nHoly Cross,$47; Navy,$45; Penn duties the latter part of last sea- from the tenth century until the fifonds. New York University and Their voices carried well, which<br />\nState, $35, and Syracuse, $30. In son, will resume his former posi- teenth, and the republic, which is Bowdoin<br />\nCollege were nosed out is unusual in male impersonators<br />\nthe state championship race Mary- tion at the initial sack or will again now existant. Geneva, declares M. by the Black and Blue in the recof the weaker sex. A member of<br />\nland still held the lead by a good toe the slab. Clayton, who former- Fatio, was the crossing ground<br />\nord time of 3.32 2-5.<br />\nthe student body asserts that he<br />\nmargin.<br />\nly pitched for Western Maryland, from the Protestant countries to<br />\nThe following week, on Febru- saw an elderly gentleman remonThe expectation that returns is, at present, the most promising Rome during the Reformation. ary<br />\n25, the same team duplicated strated by his spouse for using<br />\nWould start coming in faster to- of the new candidates for pitching For this reason much fighting took its previous performance by handopera glasses on White.<br />\nward the end of the campaign duties, although several others are place between the Calvinists and<br />\nily winning the South Atlantic<br />\nThe ballet, led by Clarence AdWas somewhat fulfilled. Competi- showing good form.<br />\nCatholics on Swiss soil, necessitat- Mile Relay event from University ams, drew more than its share of<br />\ntion for first place has practically<br />\nSharretts, last year's captain and ing the building of walls around the of Virginia and Washington and applause. The troupe, clad in dainbeen narrowed down to a half- cleanup man, is again demonstrat- city of Geneva to protect its citiLee. This meet was a great suc- ty costumes, delighted the audidozen teams and these are natur- ing his slugging propensities and is zens from the marauding armies.<br />\ncess from all angles, and upheld ence by their mastery of many<br />\nally working harder than others covering a lot of ground in the out- In1909 these walls were converted the traditions of the Annual Johns<br />\ndifficult steps, and. it was only<br />\nContinued on Page 3, Col. 2<br />\nfield. \"Chunky\" Wells, who took into a monument to the Calvinist Hopkins-Fifth Regiment games. after several encores that they<br />\nhis turn at cavorting in right gar- leaders, who are represented, along In this meet the Hopkins distance were reluctantly allowed to withNOTICES<br />\nden last year, and several able new with accounts of their principal medley relay team composed of draw.<br />\nmen, are fighting for the other po- work, on the white marble which<br />\nDorcus, Sauerville and<br />\nThe less important characters<br />\nMeeting of News-Letter<br />\nthe old Booth ran its initial race and easi.- of the drama had not been negface<br />\nof<br />\nembellishes<br />\nthe<br />\nsitions.<br />\nHayter,<br />\nhard-hitHarry<br />\n12.20<br />\ntoday,<br />\nEditorial Board<br />\ncenter fielder of last year's nine, walls. Among the leaders whose ly downed the flyers of Carnegie lected by Mr. Swindell and the<br />\nAssembly<br />\nThursday's<br />\nwho is now in the second year statues are on this great monument, Tech. The individual perform- cast, down to the pages, showed<br />\nWright<br />\nances of the other members of the the results of months of training<br />\nMedical School, will again take his is Roger Williams.<br />\nMrs. Victoria Hewitt<br />\nThe world's first public school track team were extremely cred- and practice.<br />\nplace in the outer defense. In fact,<br />\nnoted traveler and lecturer,<br />\nwill speak on \"Alaska, the<br />\nAfter the curtain had fallen<br />\nthe outfield promises to be the was founded in 1569 in Geneva by itable, and Verne Booth sent a<br />\nCalvin. It is still in existance, genuine thrill up the spines of the upon the last act and the memWonderland,\" assisted by a<br />\nstrongest in years.<br />\nlarge collection of beautiful<br />\nManager \"Ted\" Huey has ar- using the same building in which spectators when he pushed Con- bers of the cast had been apcolored slides.<br />\nranged a difficult schedule, which the great reformer inspected the nolly of Georgetown to the limit plauded and reapplauded, a _large<br />\nin the mile, and finished scarcely part of the audience repaired to<br />\nincludes some of the strongest school boys 500 years ago.<br />\nTONIGHT 8.15<br />\nAusIn<br />\n1859<br />\nthe<br />\nFrench<br />\nand<br />\na hair behind him.<br />\nthe Little Lyric where a dance<br />\nand<br />\nSouth,<br />\namong<br />\nEast<br />\nteams of the<br />\nSecond Night of<br />\nItaly.<br />\nfought<br />\na<br />\nin<br />\ntrians<br />\ngreat<br />\nbattle<br />\nappearance<br />\nThe<br />\nlast<br />\nof<br />\nthe<br />\nteam<br />\nwas held, which lasted until well<br />\nCornell,<br />\nPittsburgh,<br />\nthe<br />\nwhich are<br />\nDramatic Club's Production<br />\nA<br />\nbe<br />\na<br />\nSwiss<br />\ncitizen<br />\nhappened<br />\nto<br />\nindoors<br />\nwas<br />\nat<br />\nthe<br />\nGeorgetown<br />\nafter midnight. The music was<br />\n\"Orioles\", Syracuse, William and<br />\n\"IF I WERE KING\"<br />\nspectator of this battle and he was games held at Convention Hall, furnished by the University Jazz<br />\nMary and V. M. I.<br />\nTickets at Military Office<br />\nWhat might be termed the goals especially impressed with the Washington, on March 3. The Orchestra.<br />\nTonight the Dramatic Club will<br />\nof the season are the games with neglect shown toward the wounded varsity mile relay team finished<br />\nTOMORROW AT 4.30<br />\nexup<br />\nits<br />\nseason<br />\nwithout<br />\na<br />\ndefeat<br />\nbook<br />\nin<br />\npresent<br />\na second edition of the<br />\nthe<br />\nfield.<br />\nHe<br />\nwrote<br />\na<br />\nMay<br />\non<br />\nNavy<br />\nMaryland<br />\nand<br />\nState<br />\nin the C. E. Auditorium,<br />\nquartette<br />\nfrom<br />\nLehigh<br />\nwhen<br />\nthe<br />\nwounded<br />\nthe<br />\nplight<br />\nof<br />\nthose<br />\nproduction.<br />\ntolling<br />\nThe tickets for this<br />\nrivalry<br />\nThe<br />\nrespectively.<br />\n10,<br />\nand<br />\n6<br />\nProf. Durant Drake, Profesdowned<br />\nUniversity<br />\nwas<br />\ndecisively<br />\nthe<br />\nRed<br />\nafterward<br />\nperformance<br />\nwar<br />\nand<br />\nsoon<br />\nare in the hands of<br />\nin<br />\nis<br />\nand<br />\n•<br />\nState<br />\nHopkins<br />\nbetween<br />\nsor of Philosophy, at Vassar<br />\nrace.<br />\nThe<br />\nrewell<br />\nexecuted<br />\nthe<br />\nin<br />\na<br />\nstarted.<br />\nThe<br />\nRed<br />\nMilitary<br />\nmovement<br />\nOffice and Major<br />\nCross<br />\nresumpkeener than ever since the<br />\nCollege, will speak under the<br />\ncomposed<br />\nof<br />\nteam<br />\nserve<br />\nrelay<br />\nGarey<br />\nreports<br />\norganized<br />\nin<br />\ndefinitely<br />\nCross<br />\nwas<br />\nthat<br />\nthe house will<br />\ntion of athletic relations and.\"Curauspices of the Social Science<br />\nSomerville<br />\nand<br />\nwell<br />\nBonner,<br />\nSkinner,<br />\nbe<br />\ngeneral<br />\nconvenfilled.<br />\n1912<br />\nthe<br />\nA<br />\nIn<br />\n1864.<br />\ndance<br />\nwill likeley\" Byrd and his cohorts will leave<br />\nClub. His subject will be<br />\nover<br />\nvictory<br />\nscored<br />\na<br />\nwise<br />\nalso<br />\nbe<br />\nheld<br />\nDorcus<br />\nthe<br />\nRed<br />\nCross<br />\nwas<br />\nafter<br />\nof<br />\nheld<br />\nin<br />\nthis<br />\ntion<br />\nperformno stone unturned to defeat the<br />\n\"What is Americanism?\"<br />\nance.<br />\nContinued on Page 2,col. 3<br />\nContinued on page 3, col. 2<br />\nContinued on page 2, col 4<br />\nWith two-thirds of the fifteenday Ticket Sale Campaign a matter of the past on last Friday the<br />\ntotal value of tickets sold was<br />\nstill under the $2,000 mark. The<br />\nreturns for the first ten days totaled only slightly over $1,700 as<br />\ncompared with the $10,000 quota<br />\nfor that time. Tfte expectation<br />\nthat the teams with few or no sales<br />\nduring the first week would buckle<br />\ndown to real work later on, failed<br />\nto materialize. By the analysis of<br />\nreturns up to last Friday it was<br />\nseen that any success that the<br />\ncampaign might have would be<br />\ndue directly to the ten or more<br />\nteams that have really, put forth<br />\ntheir best efforts and are respon-<br /><br />\n)le<br /><br />\nPRICE 5 CENTS<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 28, 1922<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nHopkins News-Letter<br />\nFOUNDED 1897.<br /><br />\n$2.50<br /><br />\nSubscription<br /><br />\nHOPKINS TAKES NINTH<br />\nPLACE IN R. 0. T. C.<br />\nRIFLE MATCH<br /><br />\nVARSITY AND NON-VARSITY<br />\nMEN TO COMPETE IN INTER-CLASS TRACK MEET<br /><br />\nResults in Sixth Stage of N. R. A. Contest Will Be Held on April 7th.<br />\nMatch Announced. Government to<br />\nMany Events Open to Class<br />\n0<br />\n043:8:1E020E0KE03C€030303000302032=873C8:6Cf0<br />\nProvide New Rifles.<br />\nAthletes.<br /><br />\nteam took<br /><br />\nThe Hopkins rifle<br />\nThe Inter-class Track Meet,<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\n1879.<br />\nNovember<br />\n3,<br />\nwhich<br />\nwas originally scheduled for<br />\nCongress,<br />\nBaltimore, Md., under Act of<br />\nninth place in the Third Corps<br />\nApril 8, will be held<br /><br />\nPublished semi-weekly from October to June by the students of Johns Area Intercollegiate Gallery Rifle<br />\nHopkins University.<br />\nMatch with a score of 82.35. First April 7.<br /><br />\nFriday,<br /><br />\nThis meet will be very similar to<br /><br />\nBusiness communications should be addressed to the BUSINESS MAN- place went to Penn State's first that which was<br />\nheld last year with<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications team, which scored 93.43. Second<br />\nthe exception that, for the purpose<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br /><br />\nTelephone<br /><br />\nBusiness Manager:<br />\nGLOVER P. FALLON, '23.<br /><br />\nEditor-in-Chief:<br />\nWILLIAM H. MOORE, JR., '23<br />\nManaging Editor:<br />\nJ. HUDSON HUFFARD,'23<br />\nAssistant Managing Editor:<br />\nJOSEPH S. LEOPOLD, '24.<br /><br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br /><br />\nAssociate Editors:<br />\nRIGNAL W. BALDWIN, JR., '23<br /><br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN,'23.<br />\nFITZGERALD DUNNING, '24.<br />\nPHILIP W. HOWARD, '25.<br />\nMILES D. MARRIAN, '25.<br />\nG. DONALD GIESKE, '25.<br />\nD. H. STEVENSON, JR., '25.<br /><br />\nJunior Editors:<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br />\nG. COCHRAN Dous, '23.<br />\nT. CLYDE ROUTSON, '23.<br />\nR. C. TILGHMAN,'25.<br /><br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nBALTIMORE, MD., MARCH 28, 1922<br />\nAS TO SPORTS PUBLICITY, AMATEUR AND PROFESSIONAL<br />\nThere was instituted, last fall, among the daily papers of a number of our largest cities, a most commendable movement, concerning<br />\nthe free publicity given professional sports.<br />\nFrom force of habit, rather than from necessity, the newspapers<br />\nhave become the free advertising slaves of professional sport promoters. Whereas, the scarcity of readable news has, on a number of<br />\noccasions, forced a wide use of this sort of material, custom is primarily responsible for the misuse of so much space.<br />\nIt was pointed out in a local daily, several months ago, that<br />\ncustom had forced the press to reserve a regular amount of space<br />\nfor the free advertising of the motor industry, the stage, etc.<br />\nSome of the bolder leaders of the above-mentioned movement<br />\nhave broken free from the yoke and have declared themselves as<br />\nagainst widespread free-advertising for other than amateur affairs.<br />\nInasmuch as the publishers are directly dependent upon their<br />\npaid advertisers, it is, of course, impossible to ward off entirely the<br />\nattack hurled by the publicity agents of the various promoters.<br />\nIt does seem, though, rather an unbalanced sort of publicity<br />\nthat devotes from one to three pages in a single edition to the promotion of monied sports. Its only possible excuse is that \"it advertises<br />\nthe city.\"<br />\nWe rather agree with the revolutionary editors who have cast<br />\noff the shackles, that the reading public would require but a single<br />\nseason to be educated into being enthusiastic followers of amateur<br />\nsport, either of the sand-lot or collegiate variety.<br />\nIn pushing non-professional sports, the press would not only<br />\nsucceed just as well in advertising the city, hut would give a great<br />\nboost to a system that is serving, in a large measure, to make America's manhood physically better off.<br />\nA single column per issue should be a sufficient news item on any<br />\nprofessional sport. The press has the power of turning the \"fan's\"<br />\ndollar into a hopper providing the already overpaid professional with<br />\nmore cash or of turning it into a machine designed to produce strong,<br />\nclean American citizens.<br />\nWhile there's life, there's hope, so there's a bare chance that<br />\neven the press may learn a thing or two in time.<br />\n•<br /><br />\nSUPPORT THE SPRING SCHEDULE<br />\nSaturday marks the opening of a spring sport schedule which<br />\npromises to be the best in years. Much depends upon solid student<br />\nsupport, if this schedule is to be a success. Last fall the enthusiasm<br />\nof the undergraduate body helped carry a good football team to the<br />\nstate gridiron championship. That same spirit of hearty support<br />\nand co-operation can overcome any difficulties which may appear this<br />\nspring. This loyal strain is not a thing new at Hopkins, but has<br />\nlately become active in manifold ways. Every class and each individual will prove equal to the occasion. The spring schedule will<br />\nbe a success.<br /><br />\nThe Season Ticket Sale Runs<br />\nto April 1st.<br />\nJUST FOUR MORE DAYS TO SELL YOUR NINE<br /><br />\nEverybody Hustle—Make it a Hot Finish<br /><br />\nce:oxe:inececocexecoxo:8:6:6:6:extoo<br />\n(Eke Ortextizorisr<br />\nHi<br /><br />\nplace went to the University of<br />\nMaryland, with the following colelges scoring in the mentioned order:<br />\nDrexel Institute, third; Penn<br />\nState, second team, fourth; Gettysburg, fifth; U. of H. Freshmen<br />\nteam, sixth, and Lehigh, seventh.<br />\nOur friendly enemy, St. John's,<br />\nwon fifteenth place. The teams<br />\nfired in standing, kneeling, sitting<br />\nand prone positions. In this match<br />\nHopkins made 3294 out of a possible 4,000.<br />\nThe low standard of shooting<br />\non the part of the Black and Blue<br />\nsharpshooters is due to the fact<br />\nthat the men were required to use<br />\nthe regulation rifles issued by the<br />\ngovernment. These were so badly<br />\nworn that accurate shooting was<br />\nimpossible. The R. 0. T. C. office<br />\nreported the matter to the government and the rifles, after being inspected, were condemned.<br />\nWithin a short while new rifles<br />\nwill be shipped. If our team had<br />\nhad the new rifles during the<br />\nmatch, the Military Department<br />\nis confident that the final score<br />\nwould have been much higher.<br />\nIn a dual match with the University of Maryland, which came<br />\nout second in the Corps Area<br />\nmatch the Hopkins team, using<br />\nthe new range rifles, won by a<br />\nmargin of forty points. In a match<br />\nwith Gettysburg, Hopkins snowed<br />\ntheir opponents under. The Black<br />\nand Blue has also defeated a number of other teams in dual matches<br />\nthat outranked us in the Corps<br />\nArea match.<br />\nThe final score of the sixth<br />\nstage of the Intercollegiate Rifle<br />\nAssociation match has been announced. In the prone position<br />\nthe Black and Blue shooters score<br />\nin the following manner:<br />\n99<br />\nSteck<br />\n98<br />\nL'Allemand<br />\n99<br />\nSherwood<br />\n100<br />\nWilgis<br />\nThe results in the standing position were not so high because<br />\nthe Hopkins men are not accustomed to firing in that position.<br />\nThe results of the entire match<br />\nwill not be announced until the<br />\nmiddle of April.<br />\nINDOOR TRACK SEASON CLOSES<br />\nContinued from Page 1<br /><br />\nMaryland State and George<br />\nWashington University. The men<br />\nin the open events performed in a<br />\nmanner which showed that the<br />\nprospects for a well balanced team<br />\nduring the spring season were exceptionally good.<br />\nThe board track on Straus Field<br />\nhas now been taken up and the<br />\ncinder path encircling the diamond is rapidly being put into<br />\nexcellent condition. With the already proven material left from<br />\nthe indoor season shaping up, and<br />\nwith many new and promising<br />\ncandidates out for all positions,<br />\nthe team is eagerly looking forward to what it is hoped will turn<br />\nout to be the best and most successful track season ever undertaken.<br /><br />\nof creating more competition in the<br />\nvarious classes, varsity men will<br />\ncompete among themselves and<br />\nnon-varsity men will be put in a<br />\nseparate class. This arrangement<br />\nwill do away with the idea that it<br />\nis useless for a non-varsity man to<br />\nenter any event because a \"sure bet\"<br />\nhas been entered. In order to balance the scores, varsity men will<br />\nbe awarded 3, 2 and 1 points for<br />\nfirst, second and third places, respectively, and non-varsity men<br />\nwill be awarded 5, 3 and 1 points.<br />\nAll points will be summed up for<br />\nthe various classes and the winning<br />\nclass will be awarded a banner.<br />\nAll class presidents will appoint<br />\nmen to take charge of the various<br />\nclass teams, organize them and get<br />\nthe members into first-class condition.<br />\nEnthusiasm should run high as<br />\nrivalry between the classes is very<br />\nkeen. A large number of entries<br />\nis expected, as this meet is one of<br />\nthe principal means of uncovering<br />\nnew material, some of the present<br />\nmembers of the varsity team having been discovered through this<br />\nmedium.<br />\nRegular track practice starts this<br />\nweek and will continue straight<br />\nthrough the entire spring season.<br />\nThe track men will practice regularly on Monday, Wednesday and<br />\nFriday and the field men on Tuesday and Thursday.<br />\nThere will be no handicaps in the<br />\nInter-Class Meet. There will be<br />\ntwo sections to each event, the nonvarsity men running first and then<br />\nthe varsity men. Following is the<br />\nlist of events and the order in<br />\nwhich they will be held:<br />\n100-yard dash, 1-mile run, broad<br />\njump, 120-yard high hurdles, javelin throw, 440-yard dash, pole<br />\n'ault, 220-yard dash,220-yard hurdles, discus throw, 880-yard run,<br />\nhigh jump, 2-mile run, shot put.<br />\nNINE PREPARING FOR INITIAL<br />\nGAME<br /><br />\nContinued from page 1<br /><br />\nBlack and Blue. Navy, still smarting from the 3-0 defeat administered at Homewood last spring, is<br />\nout for revenge and this game<br />\npromises to be one of the most hotly contested of the season.<br />\nNegotiations are being carried<br />\non at the present time by which<br />\nBrown University and Hopkins<br />\nmay meet in a baseball game on the<br />\n21st of June. Previous to this<br />\ntime, an attempt had been made to<br />\narrange a game between the two<br />\nuniversities earlier in the season,<br />\nbut the managers could not come<br />\nto terms so everything was called<br />\noff.<br />\nThe present negotiations came as<br />\na result of a letter from Brown, asking for a game with Hopkins at<br />\nProvidence on June 21. This is<br />\nthe Commencement Day game for<br />\nBrown and is probably the biggest<br />\none of the season. The Hopkins<br />\nteam will very likely make the trip,<br />\nalthough the University closes on<br />\nthe twentieth. The question of the<br />\namount of the guarantee is the only<br />\nthing that is now holding up the<br />\nsigning of the contracts.<br /><br />\nBeing the aesthetic ravings of a<br />\ngroup of Freshmen in the English<br />\nComposition Course.<br />\nSAY IT WITH FLOWERS<br /><br />\nRoses are red,<br />\nSoiled lilies. are gray,<br />\nMay loves Willie,<br />\nWillie loves May.<br />\nDaisies are white,<br />\nViolets are blue,<br />\nMay becomes angry,<br />\nWillie does, too.<br />\nTree leaves are green,<br />\nCarnations are pink,<br />\nWe'd finish this tale<br />\nBut we've run out of ink.<br />\nA man named Leander H. Leyden,<br />\nIn the village of Hickville abidin',<br />\nFell in love with young Betty,<br />\nA maid very pretty,<br />\nAnd asked that he do her providin'.<br />\nPa told him with cold-hearted<br />\ncandor,<br />\nThat he'd never be able to land<br />\nher;<br />\nBut they met on the sly,<br />\nWrote Pa a good-bye,<br />\nAnd a ring did our young friend<br />\nLe(h)ander. .<br />\nThis act, of course, raised papa's<br />\ndander;<br />\nHe sent right away to command<br />\nher<br />\nTo return to her home,<br />\nOr he swore he would roam,<br />\nTill he got his revenge on Le-and'er.<br />\nFor the benefit of those who<br />\ndoubt the power of the influence<br />\nwhich the News-Letter has over<br />\nthe lives of the students at Hopkins, we cite the following incident: A class in mathematics had<br />\nwaited the prescribed amount of<br />\ntime for their instructor. They<br />\nwere reluctant to leave, however.<br />\nThey were deeply interested in<br />\ntheir work, and nothing less than<br />\ndynamite could, have shattered<br />\ntheir heroic resolution to wait. At<br />\nthis critical moment, however,<br />\nsomeone produced a copy of the<br />\nNews-Letter. Across the top, in<br />\nblack, glaring letters over the announcement of the beginning of<br />\nthe ticket 'sale, appeared the<br />\nwords, \"Let's go.\" For those patiently waiting young men it appeared like the handwriting on the<br />\nwall. They went.<br />\ni4—spring is<br />\nhere,\" said the<br />\nwatchman, pointing to its place<br />\nin the works.<br /><br />\nHE WAS USED TO IT<br /><br />\nA little boy was standing with<br />\na number of other persons watching some carpenters at work.<br />\nEverything went all right until<br />\none of the carpenters hit his<br />\nthumb with a hammer. He immediately uttered many imprecations<br />\nupon all hammers in general and<br />\nthis one in particular. One of the<br />\nmen in the group said to the little boy: \"It would be better for<br />\nyou to go away from here.\"<br />\nThe little boy nonchalantly replied: \"Oh, that's all right. I'm a<br />\ncaddie.\"<br />\nThe authorities should get a geologist to solve the Stone case.<br /><br />\nrs<br /><br />\nI)1<br /><br />\nsa<br /><br />\ntoi<br />\nC.<br />\npi(<br />\nH<br />\nic<br /><br />\nle(<br />\nFr<br />\n111<br />\nis<br />\nfe:<br />\nhe<br />\nOs<br /><br />\nat<br />\nat<br />\ng•a<br />\nth(<br />\nof<br /><br />\nler<br />\nof<br /><br />\n'vi<br />\nha<br />\nlie<br />\ncli<br /><br />\n1_<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 28, 1922<br />\nHULLABALOO PHOTOS<br />\nTHIS WEEK<br />\nWednesday, March 29<br />\n12.30—Freshman Class<br />\nSophomore Class.<br />\nFriday12.30—Junior Class.<br />\nSenior Class.<br />\n\"H\" Men.<br />\n4.00—Omicron Delta Kappa.<br />\n4.15—Baseball Team.<br />\nLacrosse Team.<br />\nTennis Team.<br />\nTrack Team.<br /><br />\nNOTED LECTURER TO SPEAK<br />\nUNDER AUSPICES OF SOCIAL<br />\nSCIENCE CLUB<br /><br />\nELECTION AT THE LAST SOPHOMORE CLASS MEETING<br /><br />\nAt the Sophomore Class meeting<br />\nin the M. E. Hall last Thursday,<br />\nMount defeated Norwood in the<br />\nelection for Class Representative to<br />\nthe Student Council. The election<br />\nwas closely contested by both parties, Mount winning out by a small<br />\nmajority. It was moved and passed<br />\nthat the election be made unanimous. Mount will take the place of<br />\n\"Ted\" Morrison, who recently<br />\nwithdrew from the University.<br /><br />\n3<br /><br />\nLunches, Cigars<br />\nCigarettes<br />\nCandy, Soda and<br />\nPipes and Fountain Pens<br />\nAt the Barn<br />\nE. E. Adams<br /><br />\nAre You Planning A<br />\nVACATION ABROAD?<br />\nIf So, Call on<br /><br />\nA. SCHUMACHER &amp; CO.<br />\nPASSENGER<br />\nAGENTS<br />\nfor all<br />\nTrans-Atlantic Lines<br /><br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br /><br />\nCharles &amp; Redwood Sts.<br /><br />\nJAS. H. DOWNS<br />\nENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br /><br />\nCUNARD - ANCHOR<br />\nSHIRTS<br /><br />\nSWISS CITIZEN SPEAKS ON GENEVA<br />\nContinued from Page 1<br /><br />\nWashington, where it was decided<br />\nthat that organization should look<br />\nfor and establish communication<br />\nbetween prisoners of war and those<br />\ndear to them. During the recent<br />\nwar the Red Cross at Geneva located and helped nearly five million<br />\ncaptured men.<br />\nBesides the Red Cross there are<br />\nmany other international organizations with headquarters at Geneva.<br />\nAccording to M. Fatio, negotiations<br />\nbetween nations have been held at<br />\nGeneva nearly every year since the<br />\nfirst international arbitration council met there in 1871 to settle the<br />\ndispute between the United States<br />\nand England. By far the greatest<br />\ninternational conference to meet in<br />\nGeneva is the League of Nations,<br />\nwhich meets there yearlw and keeps<br />\nan executive council there throughout the year.<br /><br />\nDr. Durant Drake, professor of<br />\nPhilosophy and education at Vassar College, will deliver an address<br />\ntomorrow afternoon at 4:30 in the<br />\nC. E. auditorium, under the auspices of the Social Science Club.<br />\nHis subject will be \"What Is Americanism ?\"<br />\nDr. Drake is quite a prominent<br />\nlecturer, having traveled through<br />\nFrance and England, -. where he<br />\nniade talks on various subjects. He<br />\nis also prominent as a college professor. He has, during his career,<br />\nheld the chair of professor of philosophy, of education, and of theology, at the University of Illinois,<br />\nat Wesleyan University, and<br />\nat ,Vassar College. He has also<br />\ngained considerable fame as an author. He has written \"Problems<br />\nof Things in Themselves,\" \"Problems of Conduct,\" and \"Problems<br />\nof Religion.\"<br />\nCAMPAIGN NEARS<br />\nThe lecture tomorrow afternoon TICKET SALE<br />\nTHE LAST LAP<br />\nwill not be the first that Dr. Drake<br />\nContinued from Page 1<br />\nhas made in Baltimore, as last week<br />\nare<br />\nout of the running. The<br />\nwhich<br />\nhe spoke on theology at a Baltimore<br />\nlatter are spurred on somewhat<br />\nchurch.<br />\nby their desire to escape the ignominy of the theoretical \"booby\"<br />\nAIN'T IT THE TRUTH?<br />\nprize and with these two motives<br />\nNow that the radiophone has<br />\ncome into existence, it should soon as well as loyalty to johns Hopbe possible for suffering students kins pushing the teams, a great<br />\nto take their eight-thirty lectures rush of sales can be forecasted<br />\nfor the last few days.<br />\nat home in bed.<br /><br />\nYou can tell a<br />\nsenior,but you<br />\ncannot tell<br />\nhim much.<br />\nHe's wise already, for he<br />\nbuys his shoes<br />\nat—<br /><br />\nNECKWEAR<br /><br />\nLefranc &amp; Ault<br />\n421 N. HOWARD ST.<br /><br />\nHOSIERY<br /><br />\nGLOVES<br /><br />\nOn Charles Street<br />\n216 North<br /><br />\n•••<br /><br />\nWe are establishing a new standard in<br /><br />\nUnexcelled Passenger Services<br /><br />\nYoung Men's Suits at $29.50<br /><br />\nFrom<br />\nNew York, Boston, Montreal<br />\nTo<br />\nLiverpool, London, Glasgow,<br />\nSouthampton,Cherbourg,Hamburg<br /><br />\nStyles for every taste.<br />\nBaltimore's Best Store<br /><br />\nCunard &amp; Anchor Steam Ship Lines<br /><br />\nHOCHSCHILD.KOHN 8c CO.<br /><br />\n107 E. Baltimore St. Balto., Md.<br />\nTelephone, Plaza 1522<br /><br />\nElkridge Farms Dairy<br />\nSTRICTLY FRESH MILK<br />\nProduced, Pasteurized and Bottled<br />\nin Howard County<br />\nCLARK BROS.<br /><br />\nEllicott City 23I-R<br /><br />\nSTRATTON<br /><br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\nDress Shirts<br />\n$3.00, $3.50 and $4.00<br />\nExpert Cleaners and Dyers<br />\nNegligee<br />\n$3.25 and $4.25<br />\nImported Madras<br />\n$5.25 and $6.25<br />\nTerms Cash, Less 10% 30 Days on<br />\nSpecial Rates to Hopkins Men<br />\nShirts<br />\nAlso a Full Line of Men's<br />\n211 E. 25th St.<br />\nHomewood 5205-W<br />\nFurnishings<br /><br />\nLIBERTY<br /><br />\n..1.111.11.191..........\"11,<br /><br />\n_<br /><br />\nCHAS. E. HERRING<br />\nEstablished 1873<br /><br />\nA.H.Fetting Man'fg Jewelry Co.<br /><br />\nYour Caterer at Hopkins Dances<br />\nMeet Your Friends in my<br /><br />\nMURAD<br /><br />\nBalcony—Soda Booths<br />\nManufacturers<br />\nGreek Letter Fraternity Jewelry<br />\nS. E. Cor. Maryland and North Ayes.<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nDANCING<br />\nMUSIC<br /><br />\nTHE TURKISH CIGARETTE<br /><br />\nEvery day MURADS are held<br />\nhigher in the estimation of the men<br />\nwho smoke them.<br /><br />\nIn Our Men's Section<br />\nYou will at all times find the newest<br />\nand most fashionable Neckwear, Shirts,<br />\nCollars and other Furnishings necessary<br />\nto a college man's wardrobe.<br /><br />\nThey are the standard of Taste.<br />\nThey never disappoint—never<br />\nfail—never change—<br /><br />\nHUTZLER 1310-1Elt Cs;<br />\nASRIKISWCA_GARETT ^el=<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nti<br /><br />\nFOR T<br />\nwar.<br />\nESPECI:WS<br />\nER1EVA C<br />\nARE'MADE<br />\nEXP<br />\nAND<br />\nG<br />\n1tA<br />\nAT<br />\nmscRINO OF tOGVA &amp;A ADE, .,:as•4141,4,<br />\nSMOKER<br />\nCIGARETTES/<br />\nUct4k151.1<br /><br />\nime,\\Ae100xcevto<br />\ne<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br /><br />\n.r.deas<br />\niiiiiiiiiiiiii<br /><br />\nDRAPERIES<br /><br />\nThey are 100% pure Turkish tobacco—ofthe finest varieties grown.<br />\nYou are proud to smoke them<br />\nin any company—on any occasion.<br />\nThey are the largest selling highgrade cigarette in the world.<br />\nThe cigarette smokers ofAmerica<br />\nDO prefer Quality to Quantity.<br /><br />\n343 NORTH CHARLES STREET<br /><br />\n\"Judge for Yourself—!\"<br /><br />\nIf an Accident Occurs<br /><br />\n411)))1)))i)))))) »li1JJ)lilii<br /><br />\nAnd Medicines and Dressings are required or other Real<br />\nPharmaceutical Service is Needed<br />\nTHINK OF<br /><br />\nHynson, Westcott and Dunning<br />\nTWO STORES:<br />\nEutaw Place and North Ave.<br />\nCharles and Franklin Sts.<br />\nMt. Vernon 890<br />\nMadison 405<br /><br />\nOs<br /><br />\nMalaYithegfidgatigift#<br />\na'wirgibiil4n0019~<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 28, 1922<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br /><br />\nPROF. GREGORY SPEAKS AT<br />\nA. S. C. E. MEETING<br /><br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br /><br />\nMrs. Victoria Hewitt Wright will<br />\nHopkins Professor Gives Valuable Ad- A Column in Which the Correspondents<br />\nThe Y. M. C. A. is planning to<br />\nvice to Engineering<br />\nAre Allowed Latitude, But Shouldeliver a lecture on \"Alaska, the<br />\nStudents.<br />\nder the Responsibility.<br />\nsend at least fifty college men, 21<br /><br />\nAt the monthly meeting and<br />\nsmoker of the Hopkins branch of<br />\nImporters and Dealers in Fine Books<br />\nthe American Society of Civil En301 N. CHARLES ST.<br />\ngineers held last Tuesday night,<br />\nBaltimore, Md.<br />\nProfessor John Herbert Gregory,<br />\nhead of the Department of Civil<br />\nEngineering, spoke on 'Things a<br />\nYoung Engineer Should Know.\"<br />\nProf. Gregory has been actively<br />\nengaged in the field of sanitary<br />\n41r<br />\n.<br />\nengineering for the last twentye<br />\natterie) seven years, and so is well quali-es H.5, OSCAR G.LEVY<br />\nfied to advise young engineers. In<br />\nOWNERS<br />\nhis talk he told many interesting<br />\nil‘c<br />\n'<br />\n•C4 r'lfs<br />\nEast<br />\nSt.,<br />\nBaltimore<br />\n29<br />\nand delightful personal experiOne Door West of Light St.<br />\nences. The substance of his ad-<br /><br />\nalb<br /><br />\nFIFTY MEN WANTED TO VISIT EU- AT NEXT THURSDAY'S ASSEMBLY<br />\nROPE UNDER EXPERT LEADERAt next Thursday's Assembly,<br />\nSHIP<br /><br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br /><br />\nAn letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nIS ROMANCE DEAD?<br /><br />\nDoes the spirit that prompted<br />\nSir Walter to spread out his cloak<br />\nexist at Hopkins? Goucher wants<br />\nto know.<br /><br />\nyears of age, preferably Juniors, to<br />\nEurope next summer to study political and economic conditions of Europe. They will study from the<br />\npoint of view of Christian internationalism, the needs of European<br />\nstudents, that they may serve next<br />\nyear the cause of the Student Relief, if it is necessary.<br />\nEach man will bear his own expenses, which will be from $500 to<br />\n$700. Applications will be made<br />\nthrough the local student \"Y\" to<br />\nthe State Field Student Y. M. C. A.<br />\nThe program will demand special studies before going to New<br />\nYork and special training while en<br />\nroute on the sea. The trip will<br />\nprove to be a most interesting and<br />\ninstructive one.<br /><br />\nWonder Land.\"<br />\nThe story of Alaska is one of the<br />\nepics of American history and yet<br />\nthe tale of this land of romance remans, in a large degree, untold.<br />\nThe period of Alaska's proper development is at its dawn. Railroads,<br />\nhowever, are being constructed,<br />\nbridges are being built, and the second epoch of its civilization is at<br />\nhand.<br />\nEvery thinking American should<br />\nunderstand its resources, its problems, and its needs. Mrs. Hewitt,<br />\nwho has traveled and explored the<br />\nterritory from end to end, has a<br />\nwonderful collection of beautiful<br />\ncolored slides, many of which have<br />\nbeen painted by well-known artists.<br />\nAlaska, according to Mrs. Hewitt, would develop astoundingly under a broad governmental policy.<br />\n\"The world,\" she says, \"is crying<br />\nfor raw materials, gold, silver, copper, forest products, fish from the<br />\nsea, agricultural products—and<br />\nAlaska has them all in abundance.\"<br />\nMrs. Hewitt is a well-known and<br />\nentertaining speaker, and has<br />\nspoken before the New York Historical Society and other prominent<br />\norganizations.<br /><br />\nEditor-in-Chief, NEWS-LETTER.<br />\nDear Sir: Some time, back in<br />\nBOLE AGENTS FOR BALTIMORE<br />\nthe<br />\ndim distant past (we never<br />\nFor College Fraternity Bands<br />\ndress is as follows:<br />\nwere very good when it came to<br />\n(Greek Letter Societies)<br />\n\"After graduation, a young endates), one Sir Walter Raleigh<br />\ngineer should try to get an inside<br />\nspread<br />\nout a perfectly good-looking<br />\nThe Chas. Willing Surgical<br />\njob in an office rather than one in<br />\ncloak directly over a mud puddle.<br />\nInstrument Co.<br />\nthe field. Many young men want<br />\nso that a lovely lady, who chanced der Club performance some night<br />\n100 N. HOWARD ST., Baltimore, Md.<br />\nto get into the field, but this is a<br />\nSURGICAL INSTRUMENTS<br />\nto be Queen of England, could walk during Easter week, aren't you?<br />\nMicroscopes and Supplies,<br />\nmistaken idea. It is best to get,<br />\nover dry shod. Would the young Quite a few Hopkins alumni are<br />\nStethoscopes<br />\nBlood Lancets first, an insight into the manner \"gallants\" of today do as much for<br />\nBlood Counters<br />\nmembers of the club. Mr. George<br />\nin which engineering projects are<br />\ntheir ladies? Of course, they have Gillet and Mr. Jack Fulton, '12, are<br />\nplanned in the designing rooms.<br />\nan advantage because their coats on the Board of Governors. And<br />\nTherefore, a student should learn<br />\ncan<br />\ngo to the dry cleaners and come \"Doug\" Coulter, '21, is to play one<br />\nto do a good job of draughting<br />\nback<br />\ngood as new—and, for only of the important parts. They will<br />\nand lettering. In the office it is a<br />\nPrinters of Philological and<br />\ntwo<br />\ndollars!<br />\nNow, we ask you! appreciate the interest and the supgood plan to do quick and efficient<br />\nScientific Works<br />\nHow<br />\nmany<br />\nHopkins<br />\nmen will port of the men now in college.<br />\nwork. One should learn to use the<br />\n23 S. HANOVER ST.<br />\nspread<br />\nout<br />\ntheir<br />\ncoats<br />\nfor<br />\nsome And all we ask is, that you get your<br />\nSOUNDS IRISH<br />\nslide rule, the adding machine,<br />\nBaltimore, Md.<br />\nGoucher<br />\nEverygirls<br />\nto<br />\nwalk<br />\nover?<br />\ntickets for the night when fifteen<br />\nThe editor-in-chief of the Mcthe multiplying machine, the<br />\nThatcher calculating machine and body? Fine! But, we're not going Goucher girls have arranged for a Gill Daily, the official publication<br />\nto ask you to really do it—we'd just benefit performance—the Wednes- of McGill University of Montreal<br />\nother labor-saving appliances.<br />\nlike you to invest the $2.00 that it day night of Easter week. Tickets and the only college daily in CanAfter having been in an office<br />\nwould take to have the coat cleaned. will be on sale today in Gilman Hall ada, is J. L. O'Brien. His associate<br />\nfor a while, it is good to get out<br />\nso that, figuratively speaking, we —so bring your two dollars and as managing editor, is H. O'Haon construction work. Here the<br />\ncan walk over a rather large pud- spread out that coat.<br />\ngan. If we didn't know, we would<br />\nyoung engineer should learn the<br />\ndle,—and<br />\nnot<br />\nget<br />\nour<br />\nfeet<br />\nwet.<br />\nYou<br />\nYours,<br />\nsay<br />\nMcGill University was in<br />\npoint of view of the workingman,<br />\nall are going to the Paint and PowGOU<br />\nC<br />\nER,<br />\n'22.<br />\nfor it is only by doing this that<br />\none may get the best out of' his<br />\nmen. In the field, one should take<br />\nnotes methodically. For this pur17 E. Baltimore St.<br />\npose it is best to use standard<br />\nlcttcr-size paper in a Manila paper folder. Notes should be taken<br />\nPrinters of the<br />\nin black ink, so that, if desired,<br />\nblue prints may be taken from it.<br />\nJohns Hopkins News-Letter<br />\nWhen on another engineer's job<br />\nit is best to jot down notes on<br />\nsmall pieces of paper. Abroad the<br />\nengineers are rather sensitive and<br />\nobject to anyone's taking notes.<br />\nTherefore, in this case, one should<br />\nwear stiff cuffs and make notes on<br />\nthese. After being rewritten, the<br />\nnotes should be filed away.<br />\nThe engineer should keep upto-date by reading engineering periodicals. He should read not only<br />\nEN you get out into the medical world, you'll find<br />\nthe articles about his particular<br />\nyoung<br />\ndoctors are judged by something more than<br />\nline, but also a little besides. He<br />\ndiagnostic ability and knowledge of their subject. The atshould also read the special mumosphere of success plays its part—the evidence that you<br />\nnicipal reports and the governhave\"arrived.\" And among the little details that indicate<br />\nCollege Literature<br />\nsuccess, there's the habit of preferring<br />\nment reports that come out anLOMBARD and SOUTH STREETS<br />\nnually. \"The Proceedings of the<br />\nAmerican Society of Engineers\"<br />\nare also valuable.<br />\nSHOES<br />\nBefore doing anything an enor<br />\ngineer should (1) stop and conUNIVERSITY MEN<br />\nsider what he is going to do, and,<br />\nFor Dress<br />\nFor Sport Wear (2) see if what he is about to do<br />\nSmart Styles—Best Leathers agrees with what has been done,<br />\nModerate Price::<br />\nwhat is being done, and what will<br />\nbe done.<br />\nRemember that Melachrino is a masterblend<br />\nof the finest Turkish Tobaccos as originated<br />\nThis address was extremely inby Miltiades Melachrino.Egyptian cigarettes<br />\nteresting and was thoroughly en19 W. LEXINGTON ST.<br />\nare simply those that originated in Egypt.<br />\nBut the tobacco is what you want to know<br />\n1\"›<br />\njoyed by the many members who<br />\nabout— and if it's Melachrino— it's right.<br />\nwere present. This society is a<br />\nstudent branch of the American<br />\nSociety of Civil Engineers, an or\"College\" isn't labeled<br />\nhaving over 15,000<br />\nganization<br />\non our clothes, but<br />\nHopkins branch<br />\nThe<br />\nmembers.<br />\nthe college spirit is<br />\nobtains prominent engineers to<br />\nthere never-the-less in<br />\nspeak at its monthly meetings on<br />\nevery line.<br />\nnontechnical subjects connected<br />\nwith civil engineering. Another<br />\npurpose of these meetings is to<br />\naccustom the students to the manBaltimore and Hanover<br />\nner in which engineering meetings<br />\nare conducted.<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br /><br />\nIn Medicine<br /><br />\nelachrino<br /><br />\n\"The One Cigarette Sold the World Over\"<br /><br />\nWYMAN<br /><br />\nIsaac Hamburger and Sons<br /><br />\nth<br />\nrn<br />\nIn<br />\nSi<br />\naf<br />\nin<br />\nin<br /><br />\nai<br />\ncl<br />\ndz<br />\nat<br />\nit<br />\nA<br /><br />\nSc<br />\nrc<br />\nal<br /><br />\n$1<br />\nth<br /><br />\nhz<br />\nfo<br /><br />\nflz<br /><br />\ntipz<br />\nI.<br />\nat<br />\nth<br />\ncax<br /><br />\n$4<br /><br />\nOt<br /><br />\nar<br />\nsa<br />\ngr<br /><br />\n10<br />\nSt;<br />\nte<br />\nat<br /><br />\nPc<br />\nth<br />\nra<br /><br />\nad<br /><br />\nsa<br />\nga<br />\nsv<br /><br />\nC(<br />\nof<br />\nUs<br /><br />\nas<br />\nar<br />\nac<br />\nfli<br /><br />\nPa<br />\nde<br />\nno<br /><br />\nde<br />\nti<br />\nin<br /><br />\nso<br />\nab<br />\nfr.;<br />\nho<br /><br />\nat<br />\nCI<br />\nth,<br /><br />"}], "field_media_file": [{"target_id": 37613, "display": null, "description": null, "target_type": "file", "target_uuid": "b13d5dec-73e5-42ae-88c8-90ce8c2971bb", "url": "http://digital.library.jhu.edu/system/files/2022-03/12996-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12996, "target_type": "node", "target_uuid": "7bf0a5cd-f4d0-425e-b0e4-703dbc0914ba", "url": "/node/12996"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "9485a4ea-bf8d-4fea-8d30-d00d9178e405"}]}