{"mid": [{"value": 36851}], "uuid": [{"value": "16e4d59b-49ee-4d78-8040-7c96e93f4aed"}], "vid": [{"value": 36851}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:54:54+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13061-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:54:54+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:54:54+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVII. No. 47<br />\n<br />\n1<br />\n<br />\nBALTIMORE, MD., APRIL 20, 1923<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nJOHNS HOPKINS ORCHESTRA HOPKINS-SWARTHMORE AT THREE-RING CIRCUS LATEST FRESHMAN TENNIS TEAM COMBINED MUSICAL CLUBS<br />\nGIVES PERFORMANCE<br />\nADDED FEATURE OF<br />\nHOMEWOOD SATURDAY<br />\nCONCLUDE MOST SUCORGANIZED WITH FONIN TRACK MEET<br />\nAT PEABODY<br />\nJUNE WEEK<br />\nCESSFUL YEAR<br />\nDA AS CAPTAIN<br />\nEdwin Grasse, Blind Composer- Booth and Clarke in Good Shape Clowns, Soubrettes, Etc., Wanted Matches Will Be Arranged With Messrs. Bochau and McCauley<br />\nfor Show. Admission of One<br />\nViolinist and Organist, the Sofor First Meet of the<br />\nContribute Much by Their<br />\nVarious Prep Schools in ViCent to Be Charged<br />\nloist at Concert<br />\nDirection of Club<br />\ncinity of Baltimore<br />\nSeason<br />\nThe<br />\nlatest<br />\nWhen<br />\nthe Musical Club presentEdwin<br />\nAt<br />\nthe<br />\nWith<br />\nNext Saturday the track team<br />\nGrasse, the blind<br />\nattraction to be added<br />\norganization meeting of<br />\ned<br />\nits<br />\nlast<br />\nconcert at the First<br />\ncomposer-violinist and organist, as engages Swarthmore in the first to the June Week program is a the Freshman tennis team, held in<br />\nsoloist, the Johns Hopkins orches- outdoor meet of the season at three-ring circus to be held on the Mechanical Engineering Build- Methodist Episcopal Church on<br />\nThursday night, April 12, the club<br />\ntra gave one of its most success- Homewood Field. With a well- Straus Field on the evening of Sat- ing last Monday, April 16, Leonbrought to an end the most sucful performances on Tuesday, balanced team, Hopkins perhaps urday, June 9.<br />\nard Stulman, former City College cessful season ever enjoyed by this<br />\nThe committee hopes to make tennis captain, was elected mana- organization. The work throughApril 3, in the Peabody Concert has the edge on Swarthmore, yet<br />\nHall for the benefit of the Peabody the competition promises to be this event the most entertaining ger. The meeting brought out out the year was carried out on a<br />\nScholarship Fund.<br />\nkeen. Booth, entered in the mile feature of the week. Only Hopkins fifteen candidates, .the majority larger scale than had ever been atMr. W. G. Owst, a graduate of and two mile, should come out a men will be eligible to participate. of whom have had considerable tempted at Hopkins in former<br />\nyears and the success was very<br />\nStuttgart Conservatory and of winner in both of his events. His Vanneman is working on the de- prep school experience,<br />\ngratifying<br />\nto those who had been<br />\nCambridge University, comment- faithful training and this spring's tails and lining up the men who<br />\nBernard T. Fonda, whose activi- untiring in their efforts to make<br />\nare to take part. He has issued a<br />\ned on the concert in the Baltimore indoor performances have allowed<br />\ncall for 150 men to engage in va- ties made possible the team's or- this year paramount in the history<br />\nSun of Wednesday morning as fol- him to demonstrate his ability and rious novelty acts. All<br />\ntypes are g-anization, was unanimously elect- of the Musical Club at the Univerlows:<br />\nprove that he ranks among the wanted. Clowns, soubrettes, ani- ed temporary captain. It was sug- sity.<br />\nDuring the year there were six<br />\nThe main impressions which the best of collegiate runners. The mal imitators, bareback riders, gested that no captain -be selected<br />\nconcert made upon the hearer were public, too, are keenly interested prima donnas and snake charmers at this meeting because the can- concerts presented. The first of<br />\nare in the greatest demand. All didates were mainly unfamiliar these was held at Franklin High<br />\nthe steady growth of the orches- in his performances.<br />\nstudents possessing histrionic abil- with the other's playing ability. School. The newly organized Glee<br />\ntra's capabilities and—its increasing<br />\nClarke, in the 100 and 200 yards,<br />\nity should see him at once and ar- Fonda had previously been nomi- Club made its first appearance at<br />\nvalue as a factor in the local musiis also making his mark, and range to put on a stunt.<br />\nnated as manager, but declined, this time under the leadership of<br />\ncal world. Mr. Charles H. Bochau,<br />\nSwarthmore's men will have to<br />\nfeeling<br />\nthat a man more familiar Mr. Bochau. This opening concert,<br />\nAdmission to the circus will be<br />\nthe conductor, has done remarkaextend themselves to test his met- denied to all except those who de- with tennis conditions in Balti- likewise, marked the first appearbly good wd\"rk with the players<br />\ntle. A number of freshmen are posit with the cashier the modest more should be elected.<br />\nance of the saxaphone sextette,<br />\nunder his conFrol, who are for the<br />\ntrying for the team and several sum of one cent. The committee<br />\nThe<br />\nnew<br />\nteam<br />\nwill<br />\nstart<br />\npracwhich throughout the season was<br />\nmost part amateurs. He has inhave given evidence of latent abil- wants to keep the price low so that tice in a few days. After the season a feature of the program.<br />\nspired them with enthusiasm and<br />\nity which these early meets may it will be within<br />\nThe next concert took place at<br />\nthe reach of every gets under way the Freshmen will<br />\ninstilled into them the principles<br />\nwhole, the result student and professor at Hopkins. challenge the Varsity team to a McDonogh. The Club was continuncover.<br />\nthe<br />\nOn<br />\nof ensemble illy' ing, the chief feaof training so far has been very It is hoped that everyone connect- clash on the University courts.<br />\nually improving and at this conture of which is that each player<br />\nencouraging and the future looks ed with the university will have<br />\nManager Stulman was advised cert the Mandolin Club performmust regard himself or herself as<br />\nbright with the present material, sufficient means to attend this to arrange a tentative schedule ances were put on a higher level<br />\na unit in the organization and not<br />\nIf Swarthmore has Asphulnd event, as it will be educational as with the various Maryland prep by the acquisition of Mr. G. H.<br />\nas a soloist. The result of these<br />\nthem from last year, the out- well as entertaining.<br />\nwith<br />\nschool teams. It is expected that McCauley, as director. Mr. Mcefforts was particularly noticeable<br />\nlook of field events is rather dark<br />\nBurlesques will be presented on this will include Poly, City, Cauley not only acted as director<br />\nin the precision of attack, in the<br />\nfor Hopkins. Last year this man the principal foibles and crazes of Friends, Marston's and Dunham's. but also played banjo solos. Clardynamic shading and in the attentook firsts in the javelin, shot put of the day. Of special interest will Eight or more matches will be se- ence Adams gave an exhibition of<br />\ntion paid to the conductor's every<br />\nand hurdles and second, in the dis- be a hitherto unprodueed bur- cured for the Freshmen if they can his terpsichorean skill and ‘(Tas<br />\ngesture. the volume cf tone, and,<br />\ncus. Hambleton is Hopkins man. lesque on the long distance danc- be arranged.<br />\nroundly applauded. Dal Kirwan,<br />\nin most cases, the tone quality<br />\nAaronson was so unfortunate as ing contests by picked talent of the<br />\nPractice will be held on Wed- as usual, amused everyone with<br />\nwere excellent.<br />\nto tear a muscle and may not be university. Stockings and shoes nesday and Friday of each week, his line of \"Foolishment.\" After<br />\nThat the orchestral body was<br />\nable to compete, thus greatly will be changed while dancing, al- These days were chosen after the concert the world-renowned<br />\ncapable of giving such a praiseweakening the Hopkins team.<br />\ncohol rubs administered, and a some discussion, Monday and<br />\nContinued on page 2, col. 3<br />\nworthy presentation of two moveAaronson, Clark-100.<br />\ndoctor<br />\nand nurse will be in close Thursday being eliminated, bements of Mendelssohn's \"Hymn of<br />\nClark, Gilliece-220.<br />\ncause a majority of the men had SOPHOMORES MEET BEHIND<br />\nattendance.<br />\nPraise\" Symphony,---as, was given,<br />\nSauerwein, Gilliece-440.<br />\nCLOSED DOORS FOR<br />\nNegotiations are now under way R. 0. T. C. drill on these days.<br />\nspeaks volumes for its growing<br />\nWasson-880.<br />\nSommerville,<br />\nThe<br />\nStulcandidates<br />\nincluded<br />\nFEAST<br />\nPREPARATIONS<br />\nwith the United Railways and<br />\npowers. The string sections were<br />\nSommerville—Mile.<br />\nBooth,<br />\nDecorations and All Plans for ToElectric Company to have Mary<br />\nexceptionally effective, and made<br />\nHolsopper, Wasson-2-Mile.<br />\nnight's Prom Have Been<br />\nAnn, its prize elephant, on display.<br />\nan excellent showing in the two<br />\nConning-120 High A canvass of the Italian section of PENNSYLVANIA<br />\nSERENADCompleted<br />\n\"Elegaic Melodies,\" by Grieg, Maxwell,<br />\nERS TO PLAY AT DANCE<br />\nthe city will be made to secure the<br />\nplaying them with much good mu- Hurdles.<br />\nWith doors tightly closed and<br />\nMaxwell, Hearn-220 Low,<br />\nON APRIL 28<br />\nservices of all the reputable peasical feeling, emphasizing the<br />\ncarefully guarded, and with a reAaronson—High jump. nut vendors that can be found in Will<br />\nProctor,<br />\nGive Idea of Type of Music sultant air of impenetrable myscharacteristic phrases peculiar to<br />\nAaronson — Broad order to provide the desired circus<br />\nProctor,<br />\nto Be Furnished for<br />\nthe composer and generally pretery drifting around in the gloomy<br />\njump.<br />\natmosphere.<br />\nJune Week<br />\nsenting the conductor's reading of<br />\nmain corridor of the M. & E.<br />\nAaronson, Anderson — Pole<br />\nArrangements have been made<br />\nThe Pennsylvania Serenaders, Building, a meeting was held by<br />\nthe works in an artistic manner.<br />\nvault,<br />\nwith the Athletic Office for the the nationally-known orchestra the Sophomore Class last Monday<br />\nThe soloist, Edwin Grasse, apHambleton, Ziv—Shot put.<br />\nuse of the temporary bleachers for that will furnish the music for in rbom 109 of the aforesaid edipeared in his triple capacity of vioHambleton, Ziv—Discus.<br />\nthe spectators. Two stages will be June Week, has been secured to fice. Although most of the details<br />\nlinist, composer and organist. As<br />\nAaronson, Clark—Javelin,<br />\nerected in the center with a ring in play at the tea dance in the C. E. of the meeting were kept shrouded<br />\nviolinist he played Bruch's Confront<br />\nand two more rings on the Building on Saturday, April 28.<br />\ncerto in G minor.<br />\nin deepest secrecy, rumor hath it<br />\nSWARTHHOPKINS<br />\nAND<br />\nside.<br />\nPerformances will be conThis orchestra will be in town that the members of the august<br />\nMr. Grasse is an unusually giftMORE TO PLAY LAducted simultaneously in all places the night before to play at Goucher class of '25 are laying plans for<br />\ned musician, whose works places<br />\nTOMORROW<br />\nCROSSE<br />\nsufficient room for ac- College and the Cotillon Board their annual feast. It is an absoproviding<br />\nhim practically in the class of<br />\nletof<br />\nchiefly<br />\nteam<br />\ncomposed<br />\nA<br />\ntion.<br />\nsigned it up to show the type of lute impossibility to get any Sophgenius. When one considers his<br />\nThe main show will begin music that will be on hand for the omore to admit that such is the<br />\nhandicap of total blindness, his ter men will represent Swarthmore<br />\ntechnical finish on the violin is College in their annual lacrosse promptly at 8 o'clock and continue June Week dances. Most of the case—probably the members of<br />\nphenomenal. His unerring intona- contest with Hopkins tomorrow at until 10.30. At that time the spec- musicians comprising the orches- the clan have sworn a solemn and<br />\ntion, his facility, even in rapid pas- Homewood Field. The Quakers tators will repair to the C. E. tra are from the region around awful oath not to divulge a thing<br />\nsages, together with his strong lost but a few of the members of Building, where dancing will be Lancaster, Pa., but they have —but still the rumor persists, and<br />\nspent the past winter playing at is a warning to all Freshmen to<br />\nemotional interpretation, made his last year's strong team, so the held.<br />\nAny suggestions or offers of various social centers in the South. beware.<br />\nperformance of the Concerto one Black and Blue stickmen, most of<br />\nof consuming interest. In a word, whom played last year, will meet services should be made to Vanne- Just recently they completed an<br />\nAlthough most of the actual<br />\nengagement at the St. Charles Ho- proceedings of the meeting were<br />\nit was the playing of a great artist. former rivals. The playing power man at once.<br />\ntel, New Orleans, where they per- kept carefully concealed, it was<br />\nThe closing number, \"Wedding of the Swarthmore team is unformed during the Mardi Gras.<br />\nMarch,\" for orchestra and organ, known as they have not met any<br />\nlearned that Mr. Rolon, who is ratSophomore Prom tonight<br />\nby Edwin Grasse, with the com- other teams this year.<br />\nThe lacrosse team will be away ed as a special student at the Uniin C. E. Hall at 9 o'clock.<br />\nThe Black and Blue lineup will<br />\nfrom home on that day, but there versity, has been admitted to<br />\nposer at the organ, introduced the<br />\n$2 Stags<br />\nCouple<br />\nper<br />\n$3<br />\nthe<br />\nin<br />\nprobably<br />\nas<br />\nbe<br />\nthe<br />\nsame<br />\nwill be two baseball games at membership in the Sophomore<br />\nviolin soloist in his other two caHomewood. The first will be be- Class. It was also learned that<br />\npacities. The composition, written Alumni game. The coaching comHopkins-Swarthmore Laat the instigation of Edwin L. mittee has been devoting its time<br />\ntween<br />\nthe Hopkins varsity and plans for the Sophomore Prom,<br />\ncrosse and Track tomorrow.<br />\nWestern Maryland, starting at 2 which will be held tonight, have<br />\nTurnbull, the president of the in the past few weeks to developo'clock. Imediately following this been practically completed. The<br />\nJohns Hopkins Musical Associa- ing teamwork and trick plays.<br />\nJunior Banquet tomorrow<br />\nthere will be a contest between decorations for the C. E. Hall,<br />\ntion, is a strong, virile piece of Aside from Doug Tprnbull's<br />\n8 P. M., Hotel Emerson.<br />\nWest Virginia and the University whete the danee.will be held, have<br />\nwritinf, and from a melodic and thumb, which is still giving him<br />\nGet tickets from Deavours,<br />\nMaryland. The dance will start been prepared by Gump. . Music<br />\nof<br />\nharmonic standpoint is a work that trouble, the team is in perfect conGardner, Barton and Leopold.<br />\n, dition.<br />\nat 4.30 and will stop at 7 o'clock. will be furnished by Tula.<br />\nContinued on Page 3, col. 4<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 20, 1923<br />\n<br />\n2<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\nCombined Musical Clubs Meet<br />\nSuccess<br />\n<br />\nMARYLAND<br />\n<br />\nContinued from page 1<br />\n<br />\nWEEK OF APRIL 23rd, 1923<br />\n<br />\nFoulard<br />\nTies<br />\n<br />\nFOUNDED 1897.<br />\n<br />\nBlue Jay Six furnished the music<br />\nRUTH ROYE<br />\nOF SYNCOPATION<br />\nCOMEDIENNE<br />\nfor a dance.<br />\n$2.00<br />\nMason & Shaw<br />\nSubscription<br />\nThe next concert was given at<br />\n\"ALL FOR A GIRLIE\"<br />\nthe Armory at Belair about the By NEVILLE FLEESON and AL VON<br />\nTILZER<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nmiddle of February. A feature of<br />\nBaltimore, 111d., under Act of Congress, November 3, 1879.<br />\nJ. FRANCIS DOOLEY &<br />\nthe evening was an act, given by<br />\nCORINNE SALES<br />\nJohns<br />\nJoe Moran and Dal Kirwan, which<br />\nPublished semi-weekly from October to June by the students of<br />\nYou're not in style these days<br />\nHopkins University.<br />\nappeared on the program as an<br />\nBert Hughes & Co.<br />\nunless you're wearing a fouBasketball a Bicycle<br />\n\"Impersonation of Joe Cook,\" by<br />\nBusiness communications should be addressed to the BUSINESS MANlard tie. A style,—starting on<br />\nDONALD KERR &<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications Joe Moran. Another addition was<br />\nEFFIE WESTON<br />\nshould be sent to the MANAGING EDITOR.<br />\nthe campus,—has swept the<br />\nan octette composed of Moehle<br />\nTHE FLIP AND THE FLAPPER<br />\nVirdin<br />\ntenors;<br />\nfirst<br />\nBurges,<br />\nand<br />\ncountry.<br />\nHomewood 100<br />\nTelephone<br />\nand Maccubbin, second tenors; Milla Reuter & William Reuter<br />\nBright colors,—unusual deWatson and Mercer, first bass, and<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nCO.<br />\nTOUR<br />\nLA<br />\n&<br />\nCHASE<br />\nsigns,—individuality in patCroker and • Sherwood, second<br />\nJOSEPH LEOPOLD, '24.<br />\nIN \"AROUND TILE CORNER\"<br />\n'25.<br />\nHOWARD,<br />\nPHILIP W.<br />\nBy Paul Gerard Smith<br />\ntern and in shade.<br />\nbass.<br />\nManaging Editor<br />\nFABLES<br />\nFILM<br />\nAESOP'S<br />\nThe annual home concert of the<br />\nTOPICS OF THE DAY<br />\nWILLIAM G. DEAN, JR., '24.<br />\nAnd they are only $1. We are<br />\nMusical Clubs was held<br />\nManager<br />\nCombined<br />\nAdvertising<br />\nSensation<br />\nLatest<br />\nEurope's<br />\nEditor<br />\nManaging<br />\nAssistant<br />\nshowing what is probably the<br />\nbefore a crowded house at the<br />\nSARAFAN<br />\nT. REESE MARSH, '24.<br />\nFITZGERALD DUNNING, '24.<br />\nselecTypical Scenes of Old and New largest and most tasteful<br />\nMaryland Casualty Auditorium on Types andRussia<br />\nin Five Scenes<br />\nAssociate Editor<br />\ntown.<br />\nin<br />\ntion of foulards<br />\nWednesday evening, February 21<br />\nRANDOLPH NORWOOD, '24.<br />\nAssistant Business Managers<br />\nAll divisions of the organization new standard for Homewood conJunior Editors<br />\nwere included in the concert, the certs.<br />\nD. MILES MARRIAN, '25.<br />\nTwo Stores make it<br />\nRICHARD C. TILGHMAN, '25.<br />\n'25.<br />\nThe two final concerts, one held<br />\nGIESKE,<br />\nDONALD<br />\nG.<br />\nClub, composed of 35 memGlee<br />\n'25.<br />\nJOHN W. PARSONS,<br />\nJOHN C. LEWIS, '24.<br />\nBENJAMIN T. ROME, '25.<br />\ntwice as easyfor you<br />\nbers, under the direction of Mr. at Westminster and the other at<br />\nW. EDWARD THOMSEN, JR., '26.<br />\nJOHN T. DIXON,'24.<br />\nMethodist<br />\nFirst<br />\nthe<br />\nat<br />\nBaltimore,<br />\n23<br />\nof<br />\nClub,<br />\nMandolin<br />\nthe<br />\n;<br />\nBochau<br />\nARTHUR L. NELSON, '26.<br />\nto be well dressed!<br />\nA. J. McKAY, '26.<br />\nERNEST A. STRATHMAN, '26.<br />\npieces, directed by Mr. McCauley; Episcopal Church, were both com'24.<br />\nTOVELL,<br />\nA.<br />\nEUGENE<br />\nHARRY W. MERCER, '26.<br />\nthe Quartet, the Blue Jay Six and plete succeses and similar to the<br />\nAssociation.<br />\nNewspaper<br />\nthe Saxaphone Quartet. Solo num- former concerts in their program.<br />\nMember of Southern Intercollegiate<br />\nCAHN'S<br />\nbers were presented by Joe Moran, John H. Croker has been elected<br />\nClubs for<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. Dal Kirwan, Clarence Adams, president of the Musical<br />\n116 East<br />\nofficers<br />\nBaltimore and<br />\nother<br />\nThe<br />\n1923-24.<br />\nyear<br />\nthe<br />\nSater,<br />\nWaldo Hambleton, Maurice<br />\nLiberty Streets Baltimore St_<br />\nare<br />\nThomas,<br />\nyear<br />\ncoming<br />\nthe<br />\nfor<br />\nMcCauley.<br />\nand Mr. George H.<br />\nBALTIMORE, MD., APRIL 20, 1923<br />\nThis concert by its breadth and manager; Campbell, treasurer, and<br />\nquality of entertainment set a Sater, secretary.<br />\n<br />\n5<br />\n<br />\nUAL1TY<br />\n<br />\nHOP<br />\n<br />\nORGANIZED ALUMNI BODIES<br />\nWithin the past two months the Triangle Club of Princeton, the<br />\nDartmouth Musical Club and the Harvard Hasty Pudding Club have<br />\nappeared before the Baltimore public during the course of a tour<br />\nwhich included, in its itinerary, the largest cities of the East and<br />\nSouth.<br />\nTo those interested in Hopkins activities the question naturally<br />\narises: \"Why can't the Hopkins Dramatic Club and Musical Clubs<br />\nundertake such tours?\" One need not seek long before he discovers<br />\nthe answer to this query. Hopkins organizations cannot attempt an<br />\nextended tour because outside of the city of Baltimore the institution<br />\nhas no organized alumni support.<br />\n<br />\nCake Eater<br />\n<br />\nAnd alumni support is essential in an undertaking of this kind.<br />\nA hall must be procured, widespread publicity must be obtained,<br />\ntickets must be sold and hundreds of other incidentals, which only an<br />\ninterested body can take care of, must be attended to.<br />\n<br />\n—model of1900<br />\n<br />\nThere are divers other ways in which active alumni bodies, organized in the larger cities, could serve their Alma Mater. They could<br />\nmake possible longer trips for the athletic teams, they could \"tall:<br />\nHopkins\" to desirable preparatory material in their district and could<br />\nadvertise the University in numerous ways. In fact, there is no limit<br />\nto the aid which organized and enthusiastic groups of graduates could<br />\nrender to Hopkins.<br />\nIf June Week does nothing except to bring a large number of<br />\nalumni back to Hopkins and instil in them permanent enthusiasm<br />\nwhich will result in the formation of such bodies, the occasion will<br />\nbe a distinct success.<br />\nGO TO IT!<br />\nWhile the great world without goes on unconcernedly with its<br />\nwork, unaware that great and important events are pending, an undercurrent of excitement pervades the Hopkins campus. Frequent secret<br />\nmeetings are held at which doors and windows are zealously policed<br />\nto prevent intrusion. Undergraduates gather in select groups, put<br />\ntheir heads together in whispered conversation and appear to be<br />\ndiscussing problems of enormous significance. An air of secrecy, of<br />\nmystery, of restrained expectancy, permeates the atmosphere.<br />\nSuch behavior naturally elicits doubts and misgivings from the<br />\nunitiated. To the undergraduate, however, these symptoms merely<br />\nappear as an indication that banquet season, famed in Hopkins traditions, is about to open. While the apparently dignified Seniors and<br />\nJuniors look on with ill-concealed jealousy, the Freshmen and Sophomores formulate carefully guarded plans in which the terms \"kidnapping,\" \"class officers\" and \"suburbs\" figure to a great extent.<br />\nGo to it, men! Class banquets constitute one of Hopkins' most<br />\nvalued traditions. You will retain memories of accompanying events<br />\nlong after Calculus and Greek, Physics and History have departed<br />\nfrom even the sub-conscious mind. Remember, however, to temper<br />\nyour enthusiasm with a certain amount of caution. Faculty members<br />\nand city authorities do not view these matters with the same eyes as<br />\ndo undergraduates.<br />\nWe are not advocating violence, but—again—go to it!<br />\n<br />\nPublished in<br />\nthe interest of Electrical Development by<br />\nan Institution that will<br />\nbe helped by whatever helps the<br />\nIndustry.<br />\n<br />\nHe was called dude and dandy<br />\nthen, but you recognize the type.<br />\nHe majored in haberdashery and<br />\ntook his degree with honors in<br />\nsoxology.<br />\nAs if that were not enough, he<br />\nevolved some variations on the cake<br />\nwalk which made them stare.<br />\nHe even found time to develop a<br />\nremarkable proficiency on the tandem<br />\nbicycle, and on Saturday nights he<br />\nwas good enough to bring pleasure<br />\ninto Another's life by wheeling away<br />\nto the \"Ten-Twent-Thirt.\"<br />\nTo crowd all this into four short<br />\nyears would seem enough for any.<br />\nmortal. Yet in spite of his attainments there are times, in after life,<br />\nwhen our hero wonders.<br />\nThe glory of his waistcoats has<br />\nlong since faded, while his books are<br />\nstill fresh and clean. Did he perchance<br />\nput too much thought into the selection of his hats and too little in what<br />\nwent under them?<br />\n<br />\nstern Electric Co<br />\nSince 1869 makers and distributors ofelectrical equipment<br />\n<br />\nNumber 28 of a series<br />\n<br />\nffr<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 20, 1923<br />\n<br />\n3<br />\n<br />\nOPPORTUNITIES FOR ENGI- TRIPLE PLAY FEATURES ANAPPOINTMENT NOTES<br />\nNUAL BASEBALL CLASSIC<br />\nNEERING WORK ANThe Bureau of Appointments anAT HOMEW000<br />\nNOUNCED BY BUREAU<br />\nnounces the following vacancies in<br />\nThe annual baseball game of the<br />\nThat opportunities for engicolleges:<br />\nGamma Alpha Graduate Fraternity<br />\nneering work are steadily increas- was won by the \"Gammas\" from<br />\nIn a university in the Southwest,<br />\ninstructor<br />\nin Spanish at $1,800 a<br />\ning is gathered from recent bulle- the \"Alphas\" by a score of 14 to 9.<br />\ntins issued by the employment The \"Gammas\" consist of the men year.<br />\nWARNER & COMPANY<br />\nIn a denominational college in<br />\nbureau of the American Society of who are to receive the doctor's deHATTERS<br />\nOhio, heads of the department of<br />\nthe Automotive Engineers, Inc., gree in June; the rest of the memRomance<br />\n222<br />\nW.<br />\nLanguages,<br />\nat<br />\nBALTIMORE ST.<br />\n$2,800.<br />\nbers compose the \"Alphas.\"<br />\nlocated in New York City. SituaIn a state university in the NorthThe game was , featured by a<br />\ntions are offered in all sections of<br />\ntriple play by Secrist, two circus west, assistant professor of Engthe country, and include many of catches by Graves, a home run with lish, at $2,500, and instructor in<br />\ninterest to both graduates of en- two on bases by Mosson, and the English and Public Speaking, at<br />\ngineering colleges and undergrad- umpiring of Turner. In the sev- $1,600 to $1,900.<br />\nYou collegians who stroll along the campus will<br />\nbe among the first to sense the coming of Spring.<br />\nuates interested in summer work. enth inning, Pitcher \"Willie\" Wen- In a college for women in New<br />\nsel,<br />\nDoesn't<br />\nof<br />\nthat suggest something to you in the<br />\nthe<br />\n\"Gammas,\" claims to Jersey, an assistant professor of<br />\nA prominent automotive commatter<br />\nof<br />\nclothes?<br />\nhave<br />\nestablished what is undoubt- Spanish and French.<br />\npany in Ohio desires a research<br />\nGo<br />\nin<br />\nfor<br />\nStein-Bloch and Goodman and Suss<br />\nedly a world's record by striking out In a College in Pennsylvania, man<br />\nengineer on sheet metal work and<br />\nSuits<br />\nif<br />\nyou<br />\nwant to know college style at its best.<br />\na man on only two pitched balls.<br />\nas professor of French, at $2,500.<br />\ndies for stamping.<br />\nHis count, however, differs by<br />\nIn a denominational college in<br />\nA concern in New York City one from that of the official scoreVirginia,<br />\nman as head of departwants a young mechanical drafts- keeper. At the beginning of the<br />\nment<br />\nof<br />\nEnglish.<br />\nman with some shop experience ninth, with the score<br />\n14 to 3, UmSecondary school positions are<br />\nto do drafting and work in the pire Turner decided to call<br />\nnone of<br />\navailable as follows:<br />\nlaboratory. The salary is $30-$40<br />\n(Y. M. B. 0. D.)<br />\nthe \"Alpha\" players out until their<br />\nper week.<br />\nIn Alleghany County, Maryland,<br />\nscore had reached 10. Pitcher<br />\nBaltimore and Hanover<br />\nThere is an excellent opportuni- Wensel again disagreed with the of- teacher of history and science<br />\nty in California for an assistant ficial scorekeeper, claiming that the (chemistry), $1,500-$1,800.<br />\nin a metallurgical laboratory. The \"Alphas\" had made 10 runs when<br />\nIn a private school for boys in<br />\napplicant must be a technical the official score only showed nine. Maryland, masters in science and<br />\ngraduate with experit.nce in mak- Except for the last inning, the in English.<br />\nMN IIIIIIII III III III 111IN IIIIIIN 1111 IIIIN IIII<br />\ning analysis of alloy steels. The fielding of the Gammas featured<br />\nIn a private school for boys in<br />\nstarting salary- is $125 per month. the game. For the losers,<br />\nthe catch- Rhode Island, master in mathematA company in Ohio is interested ing and batting of Jones was worthy ics and nature study at a good salin obtaining a salesman for indus- of note.<br />\nary.<br />\ntrial bearings work, covering sale<br />\nThe score by innings is:<br />\nSummer work is to be had by<br />\nHE selling of commodities is fundamental in<br />\nof product to industries outside<br />\nR. H.E. college men in various forms of<br />\nevery business, and selling life insurance afthe automotive field, where anti- Gammasfords the maximum of satisfaction and resalesmanship. No applications have<br />\nfriction bearings are adaptable.<br />\nmuneration. For the life insurance salesman<br />\n0 0 2 2 3 1 6 0 x-14 20 1 been received for students in the<br />\nis a business builder and finds innumerable ways to<br />\nA man is wanted by a firm in Alphassummer to work for a salary. The<br />\nserve the community and make himself indispensable<br />\nOhio who is able to combine the<br />\n1 1 0 0 0 1 0 0 6— 9 8 3 following articles may be sold at<br />\nin the conduct of modern affairs.<br />\nqualities of an implement designBatteries: Gammas, Wensel and liberal commissions:<br />\nThe life insurance salesman is not only a business builder<br />\nbut he is in business for himself, creating a competence perer and factory manager.<br />\nWhitesell. Alphas, Raschen and<br />\nRubber grips for golf clubs and<br />\nmanent and continuous. It is the best paid work for those<br />\nA company in Cleveland ex- Jones.<br />\nwho are ambitious and willing to work, and who have the<br />\ntennis racquets.<br />\ncharacter and stamina necessary to stamp their individuality<br />\npects soon to require the services<br />\nA one-volume dictionary of facts. III<br />\nupon the business and on their community.<br />\nof a man who can qualify as chief SWARTHMORE'S SYSTEM OF Waxed paper and parchment.<br />\nThe traditions and practices of the JOHN HANCOCK are such<br />\nSELECTIVE ADMISSION<br />\ninspector in the manufacture of<br />\nthat the college graduate can take a peculiar pride in representOne<br />\nof<br />\nthe<br />\nlarge<br />\nencyclopedias<br />\nIS ADOPTED BY VASSAR —<br />\ning this company. You are liable to remain in the business<br />\nmachine tools.<br />\n(twenty volumes).<br />\nyou enter on leaving college. Before making a definite deciStudents<br />\nWill<br />\nEnter<br />\non<br />\nBasis<br />\nof<br />\n'.<br />\nTwo or three aeronautical<br />\nsion inquire into life insurance as a career. Write,\"Agency<br />\nShirts, draperies and similar artiMerit and Not Priority of<br />\nDepartment.\"<br />\n111<br />\ndraftsmen are wanted immediateApplication<br />\ncles.<br />\nly by a company in Long Island.<br />\nIn view of the fact that SwarthSculpture for school decoration. il<br />\nAn engineer inspector is de- more College inaugurated the sys111<br />\nBibles.<br />\nsired for permanent work in a tem of selective admissicn upon<br />\nThe Pictorial Review and other<br />\n1111<br />\nsuburb of New York City. Two or the basis of scholastic record and periodicals.<br />\n111<br />\nAL<br />\nthree years' experience on inspec- personal qualities (requiring perSeniors who want business posi- 111<br />\nLIFE<br />\nCOMPANY<br />\nINSURANCE<br />\ntion of materials is prerequisite. sonal interviews) in the fall of tions should consult<br />\nOF BOSTON. MASSACHUSETTS<br />\nthe Bureau<br />\nIll<br />\nA firm in Chicago has an open- 1921 there is special interest in the about<br />\nLargest Fiduciary Institution in New England<br />\nopenings in a large departpreferably<br />\nman,<br />\nyoung<br />\nfor<br />\na<br />\ning<br />\ninclosed article which recently ap- ment store, with the telephone com- a.<br />\na graduate in mechanical engi- peared in the Philadelphia Record.<br />\npany and with other corporations.<br />\nneering to fill the position of ap- \"Vassar College has decided to<br />\nprentice, lubrication engineer.<br />\nupset a custom which has been in<br />\nUndergraduates who desire de- vogue there, and at many other Fonda Elected Captain Freshman<br />\nTennis Team<br />\ntailed information on any of women's academies and colleges,<br />\nContinued from page I<br />\nthese situations should apply to for a long time. It has often been<br />\nWeek of April 23<br />\nman,<br />\nBlock,<br />\nSonneborn, Stick and<br />\nof<br />\nService,<br />\nS. A. E. Employment<br />\nFOUNTAIN PEN INK<br />\nsaid of certain fashionable schools<br />\nthe Society of Automotive Engi- that future students are matric- Caplan, former City College playA. H. WOODS<br />\ners; Grieb and Scheinman, from<br />\nThe Ink That Made<br />\nneers, Inc., at 29 West 39th St., ulated almost as soon as horn;<br />\nat Polytechnic; Fonda, of the EpisAnnounces<br />\nThe Fountain Pen Possible'<br />\nNew York City.<br />\nleast the new girl-baby's name is copal High School of<br />\nPennsylvaHELEN MACKELLER<br />\nAll<br />\nAll<br />\nput down on the waiting list even<br />\nSizes<br />\nColors<br />\nMECHANICAL ENGINEERS SO- before the christening robes are nia, and Love, from the Boys<br />\nin<br />\nLatin School.<br />\nCIETY DISCUSSES NEW<br />\nbought. So far as Vassar is conAs a result of the present warm<br />\nAUTOMOBILE FUEL<br />\ncerned, all this is to be changed weather, interclass.tennis matches<br />\nThe regular monthly meeting in and after 1929. Admission then<br />\nare beginning to be arranged. The<br />\nof the Baltimore section of the will be entirely on a basis of mer- most recent of<br />\nthese occurred last<br />\nSadortt lIi<br />\nAmerican Society of Mechanical it rather than one of priority of Monday,<br />\nRIUNTAINPENINK<br />\nwhen a team composed<br />\nSY<br />\nEnthe<br />\nat<br />\nheld<br />\nEngineers was<br />\napplication. This announcement of civil engineering juniors chalBLUE biLff<br />\nRedand<br />\ngineers' Club, Light<br />\nhas just been made by the com- lenged the team of the civil engi11111<br />\nwood streets, last Wednesday, mittee on admission, and the ac- neering sophomores. The match<br />\nA Drama by Kate Jordan<br />\nApril 11. Because of the timely tion is a result of the decision of will probably be held during the<br />\ninterest in the subject, the eve- the Board of Trustees to limit latter part of this month.<br />\nBased on the French of<br />\nning was devoted to a discussion Vassar to 1150 students. The<br />\nCharles Mere<br />\nof \"Blended Fuels for Automo- plan will doubtless be followed by G. W. HOBBS TO SPEAK TO<br />\nBeginning Monday, April 23<br />\nbile Engines.\" Unusual interest many other institutions of higher CHRISTIAN SERVICE CLUB<br />\ndiscussion<br />\nby<br />\nthe<br />\nto<br />\nadded<br />\nwas<br />\nlearning for women.\"<br />\nDAVID BELASCO'S<br />\nMr. G. Warfield Hobbs, editor<br />\nthe attendance of several repre—The Phoenix. of the Sunday Sun, will be the Johns Hopkins Orchestra Gives<br />\nSPARKLING COMEDY<br />\nsentatives of manufacturers of<br />\nPerformance at Peabody<br />\nprincipal speaker at the meeting of<br />\nsuch fuels, who gaVe their views<br />\nContinued from page 1<br />\nthe Christian Service Club to be<br />\nTUDOR AND STUART<br />\non the subject.<br />\nheld next Tuesday evening at 8 commands immediate attention. It<br />\nCLUB<br />\nThe next meeting of the society<br />\no'clock. The subject of his address is spontaneous in invention and<br />\nwill be addressed by Mr. George<br />\nProfessor Basil L. Gilderdecidedly original in conception.<br />\nhas not yet been announced.<br />\nA. Orrok, one of the foremost<br />\nsleeve has been made on honImmediately following the ad- The \"March\" received a splendid<br />\nAvery Hopwood's Greatest<br />\norary member, and Professor<br />\nmechanical engineers of the day.<br />\ndress the annual election of offi- presentation, the organ part addTriumph<br />\non<br />\nWilfred P. Mustard, an acThis meeting will be held<br />\ncers will be held. The meeting ing • brilliancy and diversity of<br />\ntive member, of the Tudor<br />\nNights, Best Seats, $1.00<br />\nMonday, April 30. Further anwill take place at the home of Mr. color. Hearty and well-merited<br />\nand Stuart Club.<br />\nnouncement of this will be made<br />\nHenry M. Davidson, 2009 Mary- applause greeted the composer at<br />\nWed. Mat., 25c, 50c, 75c<br />\nlater.<br />\nland avenue.<br />\nthe end of the concert.<br />\n<br />\nThe \"COLLEGIAN\"<br />\n<br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br />\n<br />\n'4\"<br />\n.up<br />\n<br />\nelaaclianducia% Y4r)#- 4-<br />\n<br />\n'Business'Building<br />\n<br />\nT<br />\n<br />\nIII<br />\nil<br />\n111<br />\nIIII<br />\n<br />\n11111111111111101111111111111111M111111111•111111•111<br />\n<br />\nAUDITORIUM<br />\n<br />\nSANFORD'S<br />\n<br />\nTHE<br />\nMASKED<br />\nWOMAN<br />\n<br />\nAcademy of Music<br />\n<br />\n\"THE GOLD<br />\nDIGGERS\"<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 20, 1923<br />\n<br />\n4<br />\n<br />\nFORTY HOPKINS SCHOLAR- HOPKINS DEBATERS CLASH<br />\nWITH UNIVERSITY OF<br />\nSHIPS AND VARIOUS<br />\nCo.<br />\nBook<br />\nRICHMOND<br />\nStandard<br />\nThe Medical<br />\nFELLOWSHIPS GIVEN<br />\nCancellation of Inter-Allied War<br />\nand individuality is offered here at prices that are not<br />\n(THE BOOK MART)<br />\nForty Hopkins scholarships for<br />\nDebt to Be Subject of Interand cannot be underquoted by any house at any time.<br />\ncollegiate Debate<br />\nstudents from the Southern States<br />\nComplete Stock of<br />\nBesides the reputation of an old-established firm<br />\nTomorrow evening, April 21,<br />\nand Maryland as well as the Johns• Medical Books and College<br />\nis back of each sale with a guarantee.<br />\nRequisites<br />\nton Scholarships, and the follow- the Hopkins debaters will clash<br />\nImporters and Dealers in Fine Books ing Fellowships: Edmund Law with the forensic representatives<br />\nof the University of Richmond on FURNITURE<br />\n- DRAPERIES<br />\nDECORATIONS<br />\nRogers, Adam T. Bruce, Charles<br />\n301 N. CHARLES ST.<br />\ncampus. l'he subject<br />\nlatter's<br />\nthe<br />\nS<br />\nSTREET<br />\nCHARLE<br />\n343 NORTH<br />\nA. W. Voegeler and William S.<br />\nwill be, \"Resolved, That the<br />\nBaltimore, Md.<br />\nRayner. The recipients of these<br />\nUnited States should cancel the<br />\nhonors are as follows:<br />\nInter-Allied War Debt.\" Hopkins<br />\nJohnston Scholarships—G. Y.<br />\nwill uphold the negative. Two<br />\nRainich, Mathematics; G. H. Tayteams, debating on a simHopkins<br />\nlor, Latin; A. Weinstein, Zoology.<br />\nearlier in the season,<br />\nilar<br />\nsubject<br />\nEdmund Law Rogers FellowThe Greetings of a Fine Store<br />\nUniversity of North<br />\nthe<br />\nto<br />\nlost<br />\nship—T. R. S. Broughton, Latin.<br />\nCarolina and Washington and Lee<br />\nAdam T. Bruce Fellowships—<br />\nTo the Students of a Fine University<br />\ny.<br />\nUniversit<br />\nbeXatterie)<br />\n4el<br />\nr‘ilf<br />\nJ. P. V issZoology;<br />\n,<br />\nLineburg<br />\nB.<br />\nJANA<br />\n—IES H.& OSCAR G.{-,'\" The Hopkins representatives<br />\ncher, Zoology<br />\nONA/N ER<br />\nwill take the trip to Richwho<br />\nNiC<br />\n.2'<br />\nCharles A. W. Voegeler Fellow1411:t.<br />\nare Charles C. G. Evans and<br />\na4<br />\nC<br />\nmond<br />\n•<br />\n1<br />\n1\"1<br />\n3<br />\n:<br />\n4t41i<br />\nship—E. J. Suber, Archaeology.<br />\nHOCHSCHILD,KOHN 8c CO.<br />\nGross. The Richmond<br />\nEast<br />\nWilliam<br />\nSt.,<br />\ne<br />\n29 Baltimor<br />\nRayner Fellowship—<br />\nS.<br />\nWilliam<br />\nJ. Hillis Miller and WarOne Door West of LigIA St.<br />\nSemitic Lan- men are<br />\nSOLE AGENTS FOR BALTIMORE S. B. Finesinger,<br />\nKeith.<br />\nren G.<br />\nFor College Fraternity Bands<br />\nguages<br />\nThe judges will be chosen from<br />\n(Greek Letter Sooksties)<br />\nHopkins Scholarships (for stuamong the following men; Dr. j.<br />\ndents from the Southern States<br />\nR. Fisher, Randolph-Macon Coland Maryland)—W. H. Bell, Rolege, Ashland, Va.; Judge FeidelPrinters of Philological and<br />\nmance; F. H. Brickwedde, Physsohn, William and Mary College;<br />\nScientific Works<br />\nics; C. W. Buchheister, Greek;<br />\nE. H. Gwarthney, of William and<br />\n23 S. HANOVER ST.<br />\nMargaret M. Carey, English; R.<br />\nMary Faculty; Hon. Wyndham<br />\nBaltimore, Md.<br />\nE. L. Collins, Geology; R. G.<br />\nMeredith, Richmond, Va.; Hon.<br />\nCook, Chemistry; F. Diehl, PhiloGeorge Bryan, Richmond, and<br />\nsARATOGA AT<br />\nsophy; R. M. Dorcus, Psychology;<br />\n518 N. CHARLES STREET,BALTIMORE<br />\nRabbi Calish, Richmond, Va.<br />\nEmily<br />\ny;<br />\nChemistr<br />\n,<br />\nDrinkard<br />\nD.<br />\nLIBERTY STS. R.<br />\nOrchestra—Dancing<br />\nTelephone, Vernon 3442<br />\nQuinbi<br />\nW. Emmart, Zoology; A. Fedder,<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M.<br />\nEconomics; C. D. Gregory, Math- LECTURES ON ENGINEERING<br />\nLUNCHEON<br />\nTABLE D'HOTE<br />\nematics; T. H. Hazelhurst, ChemPRACTICE<br />\nInn<br />\nTEA<br />\nDINNER—$1.00<br />\n0c<br />\nON-6<br />\nLUNCHE<br />\nEsther J Hawkes, EducaThe Engineering Department of<br />\nDINNER istry;<br />\nSUNDAY DINNER—$1.25<br />\ntion; J. W. Hopkins, Mathemat- the University has secured three<br />\ncs;<br />\nEconomi<br />\nprominent engineers who will lecSPECIAL PARTIES ics; Mary C. Howard,<br />\nW. L. Hyden, Chemistry; A. C. ture to the students on Engineering<br />\n11.30 A. M.<br />\nuntil<br />\nLangeluttig, Jr., Political Science; Practice.<br />\nPLAZA 6987<br />\n7.30 P. M.<br />\nB. S. Levin, Economics; Marie L. It is intended that the lectures<br />\nLinthicum, English; Grace Lubin, shall deal with the practical phases<br />\nChemistry ; 0. W. Lusby, Chemis- of engineering problems. They will<br />\nFine Clothes<br />\ntry; W. C. Mallaleiu, History; discuss daily working methods of<br />\nA snit by Lemmert gives the final Olga Marx, German; C. D. Ma- design, construction, and operation,<br />\nYOU WILL FIND OUR STOCK OF STANDARD MAKE SE1S<br />\ntouch to the lasting satiisfaction you<br />\nthews, Semitics ; Winnie McGlan- rather than describe new and strikAND APPARATUS WILL MEET YOUR EVERY NEED<br />\nderive from thoroly dependable<br />\ncloths cut in authentic fashion— nery,, Geology ; Mary W. McGe, ing applications.<br />\nCOMPLETE VACUUM TUBE RECEIVERS, $39.95 UP<br />\nwhether for every-day wear or more<br />\nhee, Archaeology; G. S. Mitchell, \"Power Development—Past and<br />\nfestive occasions.<br />\nEconomics; H. A. Noble, Geolo- Future,\" will be the theme of Mr.<br />\nat<br />\nERT<br />\ngy; F. J. Rich, Chemistry; Lula George A. Orroch on Monday,<br />\nLEMM<br />\n1724 N. CHARLES ST.<br />\nM. Richardson, Romance; H. A. April 30. Mr. Orroch is consulting<br />\n19 Fayette Street, East<br />\nF.<br />\n10 Minutes from Hopkins<br />\nVernon 3055<br />\nDress Clothes Robinson, Mathematics; L.<br />\nengineer in New York city.<br />\nBusiness Suits<br />\nd,<br />\nSingewal<br />\nD.<br />\nQ.<br />\nHistory;<br />\nSheffey,<br />\nSport Togs<br />\nThese lectures will be held in<br />\nOvercoats<br />\nGeology; R. C. Smith, Philoso- Room 110, Mechanical and Elecphy; G. W. Spicer, Political Sci- trical Engineering Building at 4.10<br />\nence; J. C. Thompson, Jr., Chem- P. M.<br />\nistry; .C. N. Warfield, Physics;<br />\nRENT A CAR!<br />\nScience;<br />\nPolitical<br />\nWatkins,<br />\nD.<br />\nR.<br />\nMANUFACTURING JEWELERS<br />\nDRIVE IT YOURSELF<br />\nMovie Director (to applicant for<br />\nD. P. Weld, Chemistry.<br />\nLancaster, Pa.<br />\nFords, 12c per Mile<br />\nHups and Dodges, 18c per Mile<br />\na position)—\"Can you swim, my<br />\nClass Rings, Pins, Fraternity Pins,<br />\nCups, Medals, Etc.<br />\nJunior Banquet Tomorrow Night dear?\"<br />\nStationery, Invitations, Programmes<br />\nDRIVE IT YOURSELF CO.<br />\nThe annual banquet of the<br />\nSeals\"<br />\nVarsity<br />\nBeauty—\"Certainly not! I'm apthe<br />\n\"Makers of<br />\nJunior Class will be held tomorrow plying for a position as a bathing<br />\nVERNON 4049<br />\n1725 N. CHARLES ST.<br />\nnight at Hotel Emerson, at 8 beauty, not a fish.\"<br />\n181r3<br />\ned<br />\nEstablish<br />\n(One block South of North Ave.)<br />\no'clock. C. P. Coady will be toastA.H.Fetting Man'fg Jewelry Co. master.<br />\nOPEN ON SUNDAY<br />\nyou know Poe's<br />\nThe committee in charge has ar- Soph—\"Do<br />\nManufacturers<br />\nranged an attractive program for Raven ?\"<br />\nGreek Letter Fraternity Jewelry<br />\nthe entertainment of those pres- Frosh—\" No; what's the matter<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nwith him?\"<br />\nent.<br />\n<br />\nFURNITURE OF QUALITY<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nJ. H. Furst 8,r Co.<br />\n<br />\n•CHANTILLY<br />\nRestaurant Francais<br />\n<br />\nRADIO SUPPLY CO.<br />\n<br />\nJ. F. Apple Co.<br />\n<br />\nW.L. Mann<br />\nCommercial Photography<br />\nCircuit Photography<br />\nViews<br />\nFlash Lights<br />\nments<br />\nEnlarge<br />\nGroups<br />\nKODAK FINISHING<br />\n325 N. Howard St.<br />\nMt. Vernon 4999<br />\n<br />\nSHIRTS<br />\n<br />\nNECKWEAR<br />\n<br />\nLefranc & Ault<br />\n<br />\nCertainly Does Keep<br />\nYour Engine Perfect<br />\n<br />\nA Hopkins<br />\nBroq ue $8<br />\nOf heavy Scotch Grain Leather; black or<br />\ntan; equipped with rubber heel:—a college shoe designed for real college men.<br />\n<br />\n421 N. HOWARD ST.<br />\n<br />\nHOSIERY<br />\n<br />\n-The King of Lubricants\"<br />\nSHERWOOD BROTHERS, INC.<br />\n<br />\nURNER'S<br />\nMEN'S SHOES<br />\n<br />\nGLOVES<br />\n<br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\n$3.25 and $4.26<br />\nNegligee<br />\n$5.25 and $6.26<br />\nImported Madras<br />\nTerms Cash, Less 10% 30 Days on<br />\nShirts<br />\nAlso a Full Line of Men's<br />\nFurnishings<br />\n<br />\nSTRATTON<br />\n<br />\nHOME OEILS<br />\n<br />\nSlesingers<br />\nAT CHARLES STREET<br />\n216 NORTH<br />\n<br />\nOf the Better Class<br />\n<br />\nURNER BROTHERS<br />\nIII E. BALTIMORE STREET<br />\nBALTIMORE<br />\n<br />\nPUBLIC SALES<br />\nWe have purchased 122,000<br />\npair U. S. Army Munson last<br />\nshoes, sizes 51/2 to 12 which<br />\nwas the entire surplus stock<br />\nof one of the largest U. S.<br />\nGovernment shoe contractors.<br />\nThis shoe is guaranteed one<br />\nhundred per cent, solid leather, color dark tan, bellows<br />\ntongue, dirt and waterproof.<br />\nThe actual value of this shoe<br />\nis $6.00. Owing to this tremendous buy we can offer<br />\nsame to the public at $2.95.<br />\nSend correct size. Pay postman on<br />\ndelivery or send money order. If<br />\nshoes are not as represented we<br />\nwill cheerfully refund your money<br />\npromptly upon request.<br />\n<br />\nNational Bay State<br />\nShoe Company<br />\n296 Broadway, New York, N. Y.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVII. No. 47<br /><br />\n1<br /><br />\nBALTIMORE, MD., APRIL 20, 1923<br /><br />\nPRICE 5 CENTS<br /><br />\nJOHNS HOPKINS ORCHESTRA HOPKINS-SWARTHMORE AT THREE-RING CIRCUS LATEST FRESHMAN TENNIS TEAM COMBINED MUSICAL CLUBS<br />\nGIVES PERFORMANCE<br />\nADDED FEATURE OF<br />\nHOMEWOOD SATURDAY<br />\nCONCLUDE MOST SUCORGANIZED WITH FONIN TRACK MEET<br />\nAT PEABODY<br />\nJUNE WEEK<br />\nCESSFUL YEAR<br />\nDA AS CAPTAIN<br />\nEdwin Grasse, Blind Composer- Booth and Clarke in Good Shape Clowns, Soubrettes, Etc., Wanted Matches Will Be Arranged With Messrs. Bochau and McCauley<br />\nfor Show. Admission of One<br />\nViolinist and Organist, the Sofor First Meet of the<br />\nContribute Much by Their<br />\nVarious Prep Schools in ViCent to Be Charged<br />\nloist at Concert<br />\nDirection of Club<br />\ncinity of Baltimore<br />\nSeason<br />\nThe<br />\nlatest<br />\nWhen<br />\nthe Musical Club presentEdwin<br />\nAt<br />\nthe<br />\nWith<br />\nNext Saturday the track team<br />\nGrasse, the blind<br />\nattraction to be added<br />\norganization meeting of<br />\ned<br />\nits<br />\nlast<br />\nconcert at the First<br />\ncomposer-violinist and organist, as engages Swarthmore in the first to the June Week program is a the Freshman tennis team, held in<br />\nsoloist, the Johns Hopkins orches- outdoor meet of the season at three-ring circus to be held on the Mechanical Engineering Build- Methodist Episcopal Church on<br />\nThursday night, April 12, the club<br />\ntra gave one of its most success- Homewood Field. With a well- Straus Field on the evening of Sat- ing last Monday, April 16, Leonbrought to an end the most sucful performances on Tuesday, balanced team, Hopkins perhaps urday, June 9.<br />\nard Stulman, former City College cessful season ever enjoyed by this<br />\nThe committee hopes to make tennis captain, was elected mana- organization. The work throughApril 3, in the Peabody Concert has the edge on Swarthmore, yet<br />\nHall for the benefit of the Peabody the competition promises to be this event the most entertaining ger. The meeting brought out out the year was carried out on a<br />\nScholarship Fund.<br />\nkeen. Booth, entered in the mile feature of the week. Only Hopkins fifteen candidates, .the majority larger scale than had ever been atMr. W. G. Owst, a graduate of and two mile, should come out a men will be eligible to participate. of whom have had considerable tempted at Hopkins in former<br />\nyears and the success was very<br />\nStuttgart Conservatory and of winner in both of his events. His Vanneman is working on the de- prep school experience,<br />\ngratifying<br />\nto those who had been<br />\nCambridge University, comment- faithful training and this spring's tails and lining up the men who<br />\nBernard T. Fonda, whose activi- untiring in their efforts to make<br />\nare to take part. He has issued a<br />\ned on the concert in the Baltimore indoor performances have allowed<br />\ncall for 150 men to engage in va- ties made possible the team's or- this year paramount in the history<br />\nSun of Wednesday morning as fol- him to demonstrate his ability and rious novelty acts. All<br />\ntypes are g-anization, was unanimously elect- of the Musical Club at the Univerlows:<br />\nprove that he ranks among the wanted. Clowns, soubrettes, ani- ed temporary captain. It was sug- sity.<br />\nDuring the year there were six<br />\nThe main impressions which the best of collegiate runners. The mal imitators, bareback riders, gested that no captain -be selected<br />\nconcert made upon the hearer were public, too, are keenly interested prima donnas and snake charmers at this meeting because the can- concerts presented. The first of<br />\nare in the greatest demand. All didates were mainly unfamiliar these was held at Franklin High<br />\nthe steady growth of the orches- in his performances.<br />\nstudents possessing histrionic abil- with the other's playing ability. School. The newly organized Glee<br />\ntra's capabilities and—its increasing<br />\nClarke, in the 100 and 200 yards,<br />\nity should see him at once and ar- Fonda had previously been nomi- Club made its first appearance at<br />\nvalue as a factor in the local musiis also making his mark, and range to put on a stunt.<br />\nnated as manager, but declined, this time under the leadership of<br />\ncal world. Mr. Charles H. Bochau,<br />\nSwarthmore's men will have to<br />\nfeeling<br />\nthat a man more familiar Mr. Bochau. This opening concert,<br />\nAdmission to the circus will be<br />\nthe conductor, has done remarkaextend themselves to test his met- denied to all except those who de- with tennis conditions in Balti- likewise, marked the first appearbly good wd\"rk with the players<br />\ntle. A number of freshmen are posit with the cashier the modest more should be elected.<br />\nance of the saxaphone sextette,<br />\nunder his conFrol, who are for the<br />\ntrying for the team and several sum of one cent. The committee<br />\nThe<br />\nnew<br />\nteam<br />\nwill<br />\nstart<br />\npracwhich throughout the season was<br />\nmost part amateurs. He has inhave given evidence of latent abil- wants to keep the price low so that tice in a few days. After the season a feature of the program.<br />\nspired them with enthusiasm and<br />\nity which these early meets may it will be within<br />\nThe next concert took place at<br />\nthe reach of every gets under way the Freshmen will<br />\ninstilled into them the principles<br />\nwhole, the result student and professor at Hopkins. challenge the Varsity team to a McDonogh. The Club was continuncover.<br />\nthe<br />\nOn<br />\nof ensemble illy' ing, the chief feaof training so far has been very It is hoped that everyone connect- clash on the University courts.<br />\nually improving and at this conture of which is that each player<br />\nencouraging and the future looks ed with the university will have<br />\nManager Stulman was advised cert the Mandolin Club performmust regard himself or herself as<br />\nbright with the present material, sufficient means to attend this to arrange a tentative schedule ances were put on a higher level<br />\na unit in the organization and not<br />\nIf Swarthmore has Asphulnd event, as it will be educational as with the various Maryland prep by the acquisition of Mr. G. H.<br />\nas a soloist. The result of these<br />\nthem from last year, the out- well as entertaining.<br />\nwith<br />\nschool teams. It is expected that McCauley, as director. Mr. Mcefforts was particularly noticeable<br />\nlook of field events is rather dark<br />\nBurlesques will be presented on this will include Poly, City, Cauley not only acted as director<br />\nin the precision of attack, in the<br />\nfor Hopkins. Last year this man the principal foibles and crazes of Friends, Marston's and Dunham's. but also played banjo solos. Clardynamic shading and in the attentook firsts in the javelin, shot put of the day. Of special interest will Eight or more matches will be se- ence Adams gave an exhibition of<br />\ntion paid to the conductor's every<br />\nand hurdles and second, in the dis- be a hitherto unprodueed bur- cured for the Freshmen if they can his terpsichorean skill and ‘(Tas<br />\ngesture. the volume cf tone, and,<br />\ncus. Hambleton is Hopkins man. lesque on the long distance danc- be arranged.<br />\nroundly applauded. Dal Kirwan,<br />\nin most cases, the tone quality<br />\nAaronson was so unfortunate as ing contests by picked talent of the<br />\nPractice will be held on Wed- as usual, amused everyone with<br />\nwere excellent.<br />\nto tear a muscle and may not be university. Stockings and shoes nesday and Friday of each week, his line of \"Foolishment.\" After<br />\nThat the orchestral body was<br />\nable to compete, thus greatly will be changed while dancing, al- These days were chosen after the concert the world-renowned<br />\ncapable of giving such a praiseweakening the Hopkins team.<br />\ncohol rubs administered, and a some discussion, Monday and<br />\nContinued on page 2, col. 3<br />\nworthy presentation of two moveAaronson, Clark-100.<br />\ndoctor<br />\nand nurse will be in close Thursday being eliminated, bements of Mendelssohn's \"Hymn of<br />\nClark, Gilliece-220.<br />\ncause a majority of the men had SOPHOMORES MEET BEHIND<br />\nattendance.<br />\nPraise\" Symphony,---as, was given,<br />\nSauerwein, Gilliece-440.<br />\nCLOSED DOORS FOR<br />\nNegotiations are now under way R. 0. T. C. drill on these days.<br />\nspeaks volumes for its growing<br />\nWasson-880.<br />\nSommerville,<br />\nThe<br />\nStulcandidates<br />\nincluded<br />\nFEAST<br />\nPREPARATIONS<br />\nwith the United Railways and<br />\npowers. The string sections were<br />\nSommerville—Mile.<br />\nBooth,<br />\nDecorations and All Plans for ToElectric Company to have Mary<br />\nexceptionally effective, and made<br />\nHolsopper, Wasson-2-Mile.<br />\nnight's Prom Have Been<br />\nAnn, its prize elephant, on display.<br />\nan excellent showing in the two<br />\nConning-120 High A canvass of the Italian section of PENNSYLVANIA<br />\nSERENADCompleted<br />\n\"Elegaic Melodies,\" by Grieg, Maxwell,<br />\nERS TO PLAY AT DANCE<br />\nthe city will be made to secure the<br />\nplaying them with much good mu- Hurdles.<br />\nWith doors tightly closed and<br />\nMaxwell, Hearn-220 Low,<br />\nON APRIL 28<br />\nservices of all the reputable peasical feeling, emphasizing the<br />\ncarefully guarded, and with a reAaronson—High jump. nut vendors that can be found in Will<br />\nProctor,<br />\nGive Idea of Type of Music sultant air of impenetrable myscharacteristic phrases peculiar to<br />\nAaronson — Broad order to provide the desired circus<br />\nProctor,<br />\nto Be Furnished for<br />\nthe composer and generally pretery drifting around in the gloomy<br />\njump.<br />\natmosphere.<br />\nJune Week<br />\nsenting the conductor's reading of<br />\nmain corridor of the M. &amp; E.<br />\nAaronson, Anderson — Pole<br />\nArrangements have been made<br />\nThe Pennsylvania Serenaders, Building, a meeting was held by<br />\nthe works in an artistic manner.<br />\nvault,<br />\nwith the Athletic Office for the the nationally-known orchestra the Sophomore Class last Monday<br />\nThe soloist, Edwin Grasse, apHambleton, Ziv—Shot put.<br />\nuse of the temporary bleachers for that will furnish the music for in rbom 109 of the aforesaid edipeared in his triple capacity of vioHambleton, Ziv—Discus.<br />\nthe spectators. Two stages will be June Week, has been secured to fice. Although most of the details<br />\nlinist, composer and organist. As<br />\nAaronson, Clark—Javelin,<br />\nerected in the center with a ring in play at the tea dance in the C. E. of the meeting were kept shrouded<br />\nviolinist he played Bruch's Confront<br />\nand two more rings on the Building on Saturday, April 28.<br />\ncerto in G minor.<br />\nin deepest secrecy, rumor hath it<br />\nSWARTHHOPKINS<br />\nAND<br />\nside.<br />\nPerformances will be conThis orchestra will be in town that the members of the august<br />\nMr. Grasse is an unusually giftMORE TO PLAY LAducted simultaneously in all places the night before to play at Goucher class of '25 are laying plans for<br />\ned musician, whose works places<br />\nTOMORROW<br />\nCROSSE<br />\nsufficient room for ac- College and the Cotillon Board their annual feast. It is an absoproviding<br />\nhim practically in the class of<br />\nletof<br />\nchiefly<br />\nteam<br />\ncomposed<br />\nA<br />\ntion.<br />\nsigned it up to show the type of lute impossibility to get any Sophgenius. When one considers his<br />\nThe main show will begin music that will be on hand for the omore to admit that such is the<br />\nhandicap of total blindness, his ter men will represent Swarthmore<br />\ntechnical finish on the violin is College in their annual lacrosse promptly at 8 o'clock and continue June Week dances. Most of the case—probably the members of<br />\nphenomenal. His unerring intona- contest with Hopkins tomorrow at until 10.30. At that time the spec- musicians comprising the orches- the clan have sworn a solemn and<br />\ntion, his facility, even in rapid pas- Homewood Field. The Quakers tators will repair to the C. E. tra are from the region around awful oath not to divulge a thing<br />\nsages, together with his strong lost but a few of the members of Building, where dancing will be Lancaster, Pa., but they have —but still the rumor persists, and<br />\nspent the past winter playing at is a warning to all Freshmen to<br />\nemotional interpretation, made his last year's strong team, so the held.<br />\nAny suggestions or offers of various social centers in the South. beware.<br />\nperformance of the Concerto one Black and Blue stickmen, most of<br />\nof consuming interest. In a word, whom played last year, will meet services should be made to Vanne- Just recently they completed an<br />\nAlthough most of the actual<br />\nengagement at the St. Charles Ho- proceedings of the meeting were<br />\nit was the playing of a great artist. former rivals. The playing power man at once.<br />\ntel, New Orleans, where they per- kept carefully concealed, it was<br />\nThe closing number, \"Wedding of the Swarthmore team is unformed during the Mardi Gras.<br />\nMarch,\" for orchestra and organ, known as they have not met any<br />\nlearned that Mr. Rolon, who is ratSophomore Prom tonight<br />\nby Edwin Grasse, with the com- other teams this year.<br />\nThe lacrosse team will be away ed as a special student at the Uniin C. E. Hall at 9 o'clock.<br />\nThe Black and Blue lineup will<br />\nfrom home on that day, but there versity, has been admitted to<br />\nposer at the organ, introduced the<br />\n$2 Stags<br />\nCouple<br />\nper<br />\n$3<br />\nthe<br />\nin<br />\nprobably<br />\nas<br />\nbe<br />\nthe<br />\nsame<br />\nwill be two baseball games at membership in the Sophomore<br />\nviolin soloist in his other two caHomewood. The first will be be- Class. It was also learned that<br />\npacities. The composition, written Alumni game. The coaching comHopkins-Swarthmore Laat the instigation of Edwin L. mittee has been devoting its time<br />\ntween<br />\nthe Hopkins varsity and plans for the Sophomore Prom,<br />\ncrosse and Track tomorrow.<br />\nWestern Maryland, starting at 2 which will be held tonight, have<br />\nTurnbull, the president of the in the past few weeks to developo'clock. Imediately following this been practically completed. The<br />\nJohns Hopkins Musical Associa- ing teamwork and trick plays.<br />\nJunior Banquet tomorrow<br />\nthere will be a contest between decorations for the C. E. Hall,<br />\ntion, is a strong, virile piece of Aside from Doug Tprnbull's<br />\n8 P. M., Hotel Emerson.<br />\nWest Virginia and the University whete the danee.will be held, have<br />\nwritinf, and from a melodic and thumb, which is still giving him<br />\nGet tickets from Deavours,<br />\nMaryland. The dance will start been prepared by Gump. . Music<br />\nof<br />\nharmonic standpoint is a work that trouble, the team is in perfect conGardner, Barton and Leopold.<br />\n, dition.<br />\nat 4.30 and will stop at 7 o'clock. will be furnished by Tula.<br />\nContinued on Page 3, col. 4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 20, 1923<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\nCombined Musical Clubs Meet<br />\nSuccess<br /><br />\nMARYLAND<br /><br />\nContinued from page 1<br /><br />\nWEEK OF APRIL 23rd, 1923<br /><br />\nFoulard<br />\nTies<br /><br />\nFOUNDED 1897.<br /><br />\nBlue Jay Six furnished the music<br />\nRUTH ROYE<br />\nOF SYNCOPATION<br />\nCOMEDIENNE<br />\nfor a dance.<br />\n$2.00<br />\nMason &amp; Shaw<br />\nSubscription<br />\nThe next concert was given at<br />\n\"ALL FOR A GIRLIE\"<br />\nthe Armory at Belair about the By NEVILLE FLEESON and AL VON<br />\nTILZER<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nmiddle of February. A feature of<br />\nBaltimore, 111d., under Act of Congress, November 3, 1879.<br />\nJ. FRANCIS DOOLEY &amp;<br />\nthe evening was an act, given by<br />\nCORINNE SALES<br />\nJohns<br />\nJoe Moran and Dal Kirwan, which<br />\nPublished semi-weekly from October to June by the students of<br />\nYou're not in style these days<br />\nHopkins University.<br />\nappeared on the program as an<br />\nBert Hughes &amp; Co.<br />\nunless you're wearing a fouBasketball a Bicycle<br />\n\"Impersonation of Joe Cook,\" by<br />\nBusiness communications should be addressed to the BUSINESS MANlard tie. A style,—starting on<br />\nDONALD KERR &amp;<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications Joe Moran. Another addition was<br />\nEFFIE WESTON<br />\nshould be sent to the MANAGING EDITOR.<br />\nthe campus,—has swept the<br />\nan octette composed of Moehle<br />\nTHE FLIP AND THE FLAPPER<br />\nVirdin<br />\ntenors;<br />\nfirst<br />\nBurges,<br />\nand<br />\ncountry.<br />\nHomewood 100<br />\nTelephone<br />\nand Maccubbin, second tenors; Milla Reuter &amp; William Reuter<br />\nBright colors,—unusual deWatson and Mercer, first bass, and<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nCO.<br />\nTOUR<br />\nLA<br />\n&amp;<br />\nCHASE<br />\nsigns,—individuality in patCroker and • Sherwood, second<br />\nJOSEPH LEOPOLD, '24.<br />\nIN \"AROUND TILE CORNER\"<br />\n'25.<br />\nHOWARD,<br />\nPHILIP W.<br />\nBy Paul Gerard Smith<br />\ntern and in shade.<br />\nbass.<br />\nManaging Editor<br />\nFABLES<br />\nFILM<br />\nAESOP'S<br />\nThe annual home concert of the<br />\nTOPICS OF THE DAY<br />\nWILLIAM G. DEAN, JR., '24.<br />\nAnd they are only $1. We are<br />\nMusical Clubs was held<br />\nManager<br />\nCombined<br />\nAdvertising<br />\nSensation<br />\nLatest<br />\nEurope's<br />\nEditor<br />\nManaging<br />\nAssistant<br />\nshowing what is probably the<br />\nbefore a crowded house at the<br />\nSARAFAN<br />\nT. REESE MARSH, '24.<br />\nFITZGERALD DUNNING, '24.<br />\nselecTypical Scenes of Old and New largest and most tasteful<br />\nMaryland Casualty Auditorium on Types andRussia<br />\nin Five Scenes<br />\nAssociate Editor<br />\ntown.<br />\nin<br />\ntion of foulards<br />\nWednesday evening, February 21<br />\nRANDOLPH NORWOOD, '24.<br />\nAssistant Business Managers<br />\nAll divisions of the organization new standard for Homewood conJunior Editors<br />\nwere included in the concert, the certs.<br />\nD. MILES MARRIAN, '25.<br />\nTwo Stores make it<br />\nRICHARD C. TILGHMAN, '25.<br />\n'25.<br />\nThe two final concerts, one held<br />\nGIESKE,<br />\nDONALD<br />\nG.<br />\nClub, composed of 35 memGlee<br />\n'25.<br />\nJOHN W. PARSONS,<br />\nJOHN C. LEWIS, '24.<br />\nBENJAMIN T. ROME, '25.<br />\ntwice as easyfor you<br />\nbers, under the direction of Mr. at Westminster and the other at<br />\nW. EDWARD THOMSEN, JR., '26.<br />\nJOHN T. DIXON,'24.<br />\nMethodist<br />\nFirst<br />\nthe<br />\nat<br />\nBaltimore,<br />\n23<br />\nof<br />\nClub,<br />\nMandolin<br />\nthe<br />\n;<br />\nBochau<br />\nARTHUR L. NELSON, '26.<br />\nto be well dressed!<br />\nA. J. McKAY, '26.<br />\nERNEST A. STRATHMAN, '26.<br />\npieces, directed by Mr. McCauley; Episcopal Church, were both com'24.<br />\nTOVELL,<br />\nA.<br />\nEUGENE<br />\nHARRY W. MERCER, '26.<br />\nthe Quartet, the Blue Jay Six and plete succeses and similar to the<br />\nAssociation.<br />\nNewspaper<br />\nthe Saxaphone Quartet. Solo num- former concerts in their program.<br />\nMember of Southern Intercollegiate<br />\nCAHN'S<br />\nbers were presented by Joe Moran, John H. Croker has been elected<br />\nClubs for<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. Dal Kirwan, Clarence Adams, president of the Musical<br />\n116 East<br />\nofficers<br />\nBaltimore and<br />\nother<br />\nThe<br />\n1923-24.<br />\nyear<br />\nthe<br />\nSater,<br />\nWaldo Hambleton, Maurice<br />\nLiberty Streets Baltimore St_<br />\nare<br />\nThomas,<br />\nyear<br />\ncoming<br />\nthe<br />\nfor<br />\nMcCauley.<br />\nand Mr. George H.<br />\nBALTIMORE, MD., APRIL 20, 1923<br />\nThis concert by its breadth and manager; Campbell, treasurer, and<br />\nquality of entertainment set a Sater, secretary.<br /><br />\n5<br /><br />\nUAL1TY<br /><br />\nHOP<br /><br />\nORGANIZED ALUMNI BODIES<br />\nWithin the past two months the Triangle Club of Princeton, the<br />\nDartmouth Musical Club and the Harvard Hasty Pudding Club have<br />\nappeared before the Baltimore public during the course of a tour<br />\nwhich included, in its itinerary, the largest cities of the East and<br />\nSouth.<br />\nTo those interested in Hopkins activities the question naturally<br />\narises: \"Why can't the Hopkins Dramatic Club and Musical Clubs<br />\nundertake such tours?\" One need not seek long before he discovers<br />\nthe answer to this query. Hopkins organizations cannot attempt an<br />\nextended tour because outside of the city of Baltimore the institution<br />\nhas no organized alumni support.<br /><br />\nCake Eater<br /><br />\nAnd alumni support is essential in an undertaking of this kind.<br />\nA hall must be procured, widespread publicity must be obtained,<br />\ntickets must be sold and hundreds of other incidentals, which only an<br />\ninterested body can take care of, must be attended to.<br /><br />\n—model of1900<br /><br />\nThere are divers other ways in which active alumni bodies, organized in the larger cities, could serve their Alma Mater. They could<br />\nmake possible longer trips for the athletic teams, they could \"tall:<br />\nHopkins\" to desirable preparatory material in their district and could<br />\nadvertise the University in numerous ways. In fact, there is no limit<br />\nto the aid which organized and enthusiastic groups of graduates could<br />\nrender to Hopkins.<br />\nIf June Week does nothing except to bring a large number of<br />\nalumni back to Hopkins and instil in them permanent enthusiasm<br />\nwhich will result in the formation of such bodies, the occasion will<br />\nbe a distinct success.<br />\nGO TO IT!<br />\nWhile the great world without goes on unconcernedly with its<br />\nwork, unaware that great and important events are pending, an undercurrent of excitement pervades the Hopkins campus. Frequent secret<br />\nmeetings are held at which doors and windows are zealously policed<br />\nto prevent intrusion. Undergraduates gather in select groups, put<br />\ntheir heads together in whispered conversation and appear to be<br />\ndiscussing problems of enormous significance. An air of secrecy, of<br />\nmystery, of restrained expectancy, permeates the atmosphere.<br />\nSuch behavior naturally elicits doubts and misgivings from the<br />\nunitiated. To the undergraduate, however, these symptoms merely<br />\nappear as an indication that banquet season, famed in Hopkins traditions, is about to open. While the apparently dignified Seniors and<br />\nJuniors look on with ill-concealed jealousy, the Freshmen and Sophomores formulate carefully guarded plans in which the terms \"kidnapping,\" \"class officers\" and \"suburbs\" figure to a great extent.<br />\nGo to it, men! Class banquets constitute one of Hopkins' most<br />\nvalued traditions. You will retain memories of accompanying events<br />\nlong after Calculus and Greek, Physics and History have departed<br />\nfrom even the sub-conscious mind. Remember, however, to temper<br />\nyour enthusiasm with a certain amount of caution. Faculty members<br />\nand city authorities do not view these matters with the same eyes as<br />\ndo undergraduates.<br />\nWe are not advocating violence, but—again—go to it!<br /><br />\nPublished in<br />\nthe interest of Electrical Development by<br />\nan Institution that will<br />\nbe helped by whatever helps the<br />\nIndustry.<br /><br />\nHe was called dude and dandy<br />\nthen, but you recognize the type.<br />\nHe majored in haberdashery and<br />\ntook his degree with honors in<br />\nsoxology.<br />\nAs if that were not enough, he<br />\nevolved some variations on the cake<br />\nwalk which made them stare.<br />\nHe even found time to develop a<br />\nremarkable proficiency on the tandem<br />\nbicycle, and on Saturday nights he<br />\nwas good enough to bring pleasure<br />\ninto Another's life by wheeling away<br />\nto the \"Ten-Twent-Thirt.\"<br />\nTo crowd all this into four short<br />\nyears would seem enough for any.<br />\nmortal. Yet in spite of his attainments there are times, in after life,<br />\nwhen our hero wonders.<br />\nThe glory of his waistcoats has<br />\nlong since faded, while his books are<br />\nstill fresh and clean. Did he perchance<br />\nput too much thought into the selection of his hats and too little in what<br />\nwent under them?<br /><br />\nstern Electric Co<br />\nSince 1869 makers and distributors ofelectrical equipment<br /><br />\nNumber 28 of a series<br /><br />\nffr<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 20, 1923<br /><br />\n3<br /><br />\nOPPORTUNITIES FOR ENGI- TRIPLE PLAY FEATURES ANAPPOINTMENT NOTES<br />\nNUAL BASEBALL CLASSIC<br />\nNEERING WORK ANThe Bureau of Appointments anAT HOMEW000<br />\nNOUNCED BY BUREAU<br />\nnounces the following vacancies in<br />\nThe annual baseball game of the<br />\nThat opportunities for engicolleges:<br />\nGamma Alpha Graduate Fraternity<br />\nneering work are steadily increas- was won by the \"Gammas\" from<br />\nIn a university in the Southwest,<br />\ninstructor<br />\nin Spanish at $1,800 a<br />\ning is gathered from recent bulle- the \"Alphas\" by a score of 14 to 9.<br />\ntins issued by the employment The \"Gammas\" consist of the men year.<br />\nWARNER &amp; COMPANY<br />\nIn a denominational college in<br />\nbureau of the American Society of who are to receive the doctor's deHATTERS<br />\nOhio, heads of the department of<br />\nthe Automotive Engineers, Inc., gree in June; the rest of the memRomance<br />\n222<br />\nW.<br />\nLanguages,<br />\nat<br />\nBALTIMORE ST.<br />\n$2,800.<br />\nbers compose the \"Alphas.\"<br />\nlocated in New York City. SituaIn a state university in the NorthThe game was , featured by a<br />\ntions are offered in all sections of<br />\ntriple play by Secrist, two circus west, assistant professor of Engthe country, and include many of catches by Graves, a home run with lish, at $2,500, and instructor in<br />\ninterest to both graduates of en- two on bases by Mosson, and the English and Public Speaking, at<br />\ngineering colleges and undergrad- umpiring of Turner. In the sev- $1,600 to $1,900.<br />\nYou collegians who stroll along the campus will<br />\nbe among the first to sense the coming of Spring.<br />\nuates interested in summer work. enth inning, Pitcher \"Willie\" Wen- In a college for women in New<br />\nsel,<br />\nDoesn't<br />\nof<br />\nthat suggest something to you in the<br />\nthe<br />\n\"Gammas,\" claims to Jersey, an assistant professor of<br />\nA prominent automotive commatter<br />\nof<br />\nclothes?<br />\nhave<br />\nestablished what is undoubt- Spanish and French.<br />\npany in Ohio desires a research<br />\nGo<br />\nin<br />\nfor<br />\nStein-Bloch and Goodman and Suss<br />\nedly a world's record by striking out In a College in Pennsylvania, man<br />\nengineer on sheet metal work and<br />\nSuits<br />\nif<br />\nyou<br />\nwant to know college style at its best.<br />\na man on only two pitched balls.<br />\nas professor of French, at $2,500.<br />\ndies for stamping.<br />\nHis count, however, differs by<br />\nIn a denominational college in<br />\nA concern in New York City one from that of the official scoreVirginia,<br />\nman as head of departwants a young mechanical drafts- keeper. At the beginning of the<br />\nment<br />\nof<br />\nEnglish.<br />\nman with some shop experience ninth, with the score<br />\n14 to 3, UmSecondary school positions are<br />\nto do drafting and work in the pire Turner decided to call<br />\nnone of<br />\navailable as follows:<br />\nlaboratory. The salary is $30-$40<br />\n(Y. M. B. 0. D.)<br />\nthe \"Alpha\" players out until their<br />\nper week.<br />\nIn Alleghany County, Maryland,<br />\nscore had reached 10. Pitcher<br />\nBaltimore and Hanover<br />\nThere is an excellent opportuni- Wensel again disagreed with the of- teacher of history and science<br />\nty in California for an assistant ficial scorekeeper, claiming that the (chemistry), $1,500-$1,800.<br />\nin a metallurgical laboratory. The \"Alphas\" had made 10 runs when<br />\nIn a private school for boys in<br />\napplicant must be a technical the official score only showed nine. Maryland, masters in science and<br />\ngraduate with experit.nce in mak- Except for the last inning, the in English.<br />\nMN IIIIIIII III III III 111IN IIIIIIN 1111 IIIIN IIII<br />\ning analysis of alloy steels. The fielding of the Gammas featured<br />\nIn a private school for boys in<br />\nstarting salary- is $125 per month. the game. For the losers,<br />\nthe catch- Rhode Island, master in mathematA company in Ohio is interested ing and batting of Jones was worthy ics and nature study at a good salin obtaining a salesman for indus- of note.<br />\nary.<br />\ntrial bearings work, covering sale<br />\nThe score by innings is:<br />\nSummer work is to be had by<br />\nHE selling of commodities is fundamental in<br />\nof product to industries outside<br />\nR. H.E. college men in various forms of<br />\nevery business, and selling life insurance afthe automotive field, where anti- Gammasfords the maximum of satisfaction and resalesmanship. No applications have<br />\nfriction bearings are adaptable.<br />\nmuneration. For the life insurance salesman<br />\n0 0 2 2 3 1 6 0 x-14 20 1 been received for students in the<br />\nis a business builder and finds innumerable ways to<br />\nA man is wanted by a firm in Alphassummer to work for a salary. The<br />\nserve the community and make himself indispensable<br />\nOhio who is able to combine the<br />\n1 1 0 0 0 1 0 0 6— 9 8 3 following articles may be sold at<br />\nin the conduct of modern affairs.<br />\nqualities of an implement designBatteries: Gammas, Wensel and liberal commissions:<br />\nThe life insurance salesman is not only a business builder<br />\nbut he is in business for himself, creating a competence perer and factory manager.<br />\nWhitesell. Alphas, Raschen and<br />\nRubber grips for golf clubs and<br />\nmanent and continuous. It is the best paid work for those<br />\nA company in Cleveland ex- Jones.<br />\nwho are ambitious and willing to work, and who have the<br />\ntennis racquets.<br />\ncharacter and stamina necessary to stamp their individuality<br />\npects soon to require the services<br />\nA one-volume dictionary of facts. III<br />\nupon the business and on their community.<br />\nof a man who can qualify as chief SWARTHMORE'S SYSTEM OF Waxed paper and parchment.<br />\nThe traditions and practices of the JOHN HANCOCK are such<br />\nSELECTIVE ADMISSION<br />\ninspector in the manufacture of<br />\nthat the college graduate can take a peculiar pride in representOne<br />\nof<br />\nthe<br />\nlarge<br />\nencyclopedias<br />\nIS ADOPTED BY VASSAR —<br />\ning this company. You are liable to remain in the business<br />\nmachine tools.<br />\n(twenty volumes).<br />\nyou enter on leaving college. Before making a definite deciStudents<br />\nWill<br />\nEnter<br />\non<br />\nBasis<br />\nof<br />\n'.<br />\nTwo or three aeronautical<br />\nsion inquire into life insurance as a career. Write,\"Agency<br />\nShirts, draperies and similar artiMerit and Not Priority of<br />\nDepartment.\"<br />\n111<br />\ndraftsmen are wanted immediateApplication<br />\ncles.<br />\nly by a company in Long Island.<br />\nIn view of the fact that SwarthSculpture for school decoration. il<br />\nAn engineer inspector is de- more College inaugurated the sys111<br />\nBibles.<br />\nsired for permanent work in a tem of selective admissicn upon<br />\nThe Pictorial Review and other<br />\n1111<br />\nsuburb of New York City. Two or the basis of scholastic record and periodicals.<br />\n111<br />\nAL<br />\nthree years' experience on inspec- personal qualities (requiring perSeniors who want business posi- 111<br />\nLIFE<br />\nCOMPANY<br />\nINSURANCE<br />\ntion of materials is prerequisite. sonal interviews) in the fall of tions should consult<br />\nOF BOSTON. MASSACHUSETTS<br />\nthe Bureau<br />\nIll<br />\nA firm in Chicago has an open- 1921 there is special interest in the about<br />\nLargest Fiduciary Institution in New England<br />\nopenings in a large departpreferably<br />\nman,<br />\nyoung<br />\nfor<br />\na<br />\ning<br />\ninclosed article which recently ap- ment store, with the telephone com- a.<br />\na graduate in mechanical engi- peared in the Philadelphia Record.<br />\npany and with other corporations.<br />\nneering to fill the position of ap- \"Vassar College has decided to<br />\nprentice, lubrication engineer.<br />\nupset a custom which has been in<br />\nUndergraduates who desire de- vogue there, and at many other Fonda Elected Captain Freshman<br />\nTennis Team<br />\ntailed information on any of women's academies and colleges,<br />\nContinued from page I<br />\nthese situations should apply to for a long time. It has often been<br />\nWeek of April 23<br />\nman,<br />\nBlock,<br />\nSonneborn, Stick and<br />\nof<br />\nService,<br />\nS. A. E. Employment<br />\nFOUNTAIN PEN INK<br />\nsaid of certain fashionable schools<br />\nthe Society of Automotive Engi- that future students are matric- Caplan, former City College playA. H. WOODS<br />\ners; Grieb and Scheinman, from<br />\nThe Ink That Made<br />\nneers, Inc., at 29 West 39th St., ulated almost as soon as horn;<br />\nat Polytechnic; Fonda, of the EpisAnnounces<br />\nThe Fountain Pen Possible'<br />\nNew York City.<br />\nleast the new girl-baby's name is copal High School of<br />\nPennsylvaHELEN MACKELLER<br />\nAll<br />\nAll<br />\nput down on the waiting list even<br />\nSizes<br />\nColors<br />\nMECHANICAL ENGINEERS SO- before the christening robes are nia, and Love, from the Boys<br />\nin<br />\nLatin School.<br />\nCIETY DISCUSSES NEW<br />\nbought. So far as Vassar is conAs a result of the present warm<br />\nAUTOMOBILE FUEL<br />\ncerned, all this is to be changed weather, interclass.tennis matches<br />\nThe regular monthly meeting in and after 1929. Admission then<br />\nare beginning to be arranged. The<br />\nof the Baltimore section of the will be entirely on a basis of mer- most recent of<br />\nthese occurred last<br />\nSadortt lIi<br />\nAmerican Society of Mechanical it rather than one of priority of Monday,<br />\nRIUNTAINPENINK<br />\nwhen a team composed<br />\nSY<br />\nEnthe<br />\nat<br />\nheld<br />\nEngineers was<br />\napplication. This announcement of civil engineering juniors chalBLUE biLff<br />\nRedand<br />\ngineers' Club, Light<br />\nhas just been made by the com- lenged the team of the civil engi11111<br />\nwood streets, last Wednesday, mittee on admission, and the ac- neering sophomores. The match<br />\nA Drama by Kate Jordan<br />\nApril 11. Because of the timely tion is a result of the decision of will probably be held during the<br />\ninterest in the subject, the eve- the Board of Trustees to limit latter part of this month.<br />\nBased on the French of<br />\nning was devoted to a discussion Vassar to 1150 students. The<br />\nCharles Mere<br />\nof \"Blended Fuels for Automo- plan will doubtless be followed by G. W. HOBBS TO SPEAK TO<br />\nBeginning Monday, April 23<br />\nbile Engines.\" Unusual interest many other institutions of higher CHRISTIAN SERVICE CLUB<br />\ndiscussion<br />\nby<br />\nthe<br />\nto<br />\nadded<br />\nwas<br />\nlearning for women.\"<br />\nDAVID BELASCO'S<br />\nMr. G. Warfield Hobbs, editor<br />\nthe attendance of several repre—The Phoenix. of the Sunday Sun, will be the Johns Hopkins Orchestra Gives<br />\nSPARKLING COMEDY<br />\nsentatives of manufacturers of<br />\nPerformance at Peabody<br />\nprincipal speaker at the meeting of<br />\nsuch fuels, who gaVe their views<br />\nContinued from page 1<br />\nthe Christian Service Club to be<br />\nTUDOR AND STUART<br />\non the subject.<br />\nheld next Tuesday evening at 8 commands immediate attention. It<br />\nCLUB<br />\nThe next meeting of the society<br />\no'clock. The subject of his address is spontaneous in invention and<br />\nwill be addressed by Mr. George<br />\nProfessor Basil L. Gilderdecidedly original in conception.<br />\nhas not yet been announced.<br />\nA. Orrok, one of the foremost<br />\nsleeve has been made on honImmediately following the ad- The \"March\" received a splendid<br />\nAvery Hopwood's Greatest<br />\norary member, and Professor<br />\nmechanical engineers of the day.<br />\ndress the annual election of offi- presentation, the organ part addTriumph<br />\non<br />\nWilfred P. Mustard, an acThis meeting will be held<br />\ncers will be held. The meeting ing • brilliancy and diversity of<br />\ntive member, of the Tudor<br />\nNights, Best Seats, $1.00<br />\nMonday, April 30. Further anwill take place at the home of Mr. color. Hearty and well-merited<br />\nand Stuart Club.<br />\nnouncement of this will be made<br />\nHenry M. Davidson, 2009 Mary- applause greeted the composer at<br />\nWed. Mat., 25c, 50c, 75c<br />\nlater.<br />\nland avenue.<br />\nthe end of the concert.<br /><br />\nThe \"COLLEGIAN\"<br /><br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br /><br />\n'4\"<br />\n.up<br /><br />\nelaaclianducia% Y4r)#- 4-<br /><br />\n'Business'Building<br /><br />\nT<br /><br />\nIII<br />\nil<br />\n111<br />\nIIII<br /><br />\n11111111111111101111111111111111M111111111•111111•111<br /><br />\nAUDITORIUM<br /><br />\nSANFORD'S<br /><br />\nTHE<br />\nMASKED<br />\nWOMAN<br /><br />\nAcademy of Music<br /><br />\n\"THE GOLD<br />\nDIGGERS\"<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 20, 1923<br /><br />\n4<br /><br />\nFORTY HOPKINS SCHOLAR- HOPKINS DEBATERS CLASH<br />\nWITH UNIVERSITY OF<br />\nSHIPS AND VARIOUS<br />\nCo.<br />\nBook<br />\nRICHMOND<br />\nStandard<br />\nThe Medical<br />\nFELLOWSHIPS GIVEN<br />\nCancellation of Inter-Allied War<br />\nand individuality is offered here at prices that are not<br />\n(THE BOOK MART)<br />\nForty Hopkins scholarships for<br />\nDebt to Be Subject of Interand cannot be underquoted by any house at any time.<br />\ncollegiate Debate<br />\nstudents from the Southern States<br />\nComplete Stock of<br />\nBesides the reputation of an old-established firm<br />\nTomorrow evening, April 21,<br />\nand Maryland as well as the Johns• Medical Books and College<br />\nis back of each sale with a guarantee.<br />\nRequisites<br />\nton Scholarships, and the follow- the Hopkins debaters will clash<br />\nImporters and Dealers in Fine Books ing Fellowships: Edmund Law with the forensic representatives<br />\nof the University of Richmond on FURNITURE<br />\n- DRAPERIES<br />\nDECORATIONS<br />\nRogers, Adam T. Bruce, Charles<br />\n301 N. CHARLES ST.<br />\ncampus. l'he subject<br />\nlatter's<br />\nthe<br />\nS<br />\nSTREET<br />\nCHARLE<br />\n343 NORTH<br />\nA. W. Voegeler and William S.<br />\nwill be, \"Resolved, That the<br />\nBaltimore, Md.<br />\nRayner. The recipients of these<br />\nUnited States should cancel the<br />\nhonors are as follows:<br />\nInter-Allied War Debt.\" Hopkins<br />\nJohnston Scholarships—G. Y.<br />\nwill uphold the negative. Two<br />\nRainich, Mathematics; G. H. Tayteams, debating on a simHopkins<br />\nlor, Latin; A. Weinstein, Zoology.<br />\nearlier in the season,<br />\nilar<br />\nsubject<br />\nEdmund Law Rogers FellowThe Greetings of a Fine Store<br />\nUniversity of North<br />\nthe<br />\nto<br />\nlost<br />\nship—T. R. S. Broughton, Latin.<br />\nCarolina and Washington and Lee<br />\nAdam T. Bruce Fellowships—<br />\nTo the Students of a Fine University<br />\ny.<br />\nUniversit<br />\nbeXatterie)<br />\n4el<br />\nr‘ilf<br />\nJ. P. V issZoology;<br />\n,<br />\nLineburg<br />\nB.<br />\nJANA<br />\n—IES H.&amp; OSCAR G.{-,'\" The Hopkins representatives<br />\ncher, Zoology<br />\nONA/N ER<br />\nwill take the trip to Richwho<br />\nNiC<br />\n.2'<br />\nCharles A. W. Voegeler Fellow1411:t.<br />\nare Charles C. G. Evans and<br />\na4<br />\nC<br />\nmond<br />\n•<br />\n1<br />\n1\"1<br />\n3<br />\n:<br />\n4t41i<br />\nship—E. J. Suber, Archaeology.<br />\nHOCHSCHILD,KOHN 8c CO.<br />\nGross. The Richmond<br />\nEast<br />\nWilliam<br />\nSt.,<br />\ne<br />\n29 Baltimor<br />\nRayner Fellowship—<br />\nS.<br />\nWilliam<br />\nJ. Hillis Miller and WarOne Door West of LigIA St.<br />\nSemitic Lan- men are<br />\nSOLE AGENTS FOR BALTIMORE S. B. Finesinger,<br />\nKeith.<br />\nren G.<br />\nFor College Fraternity Bands<br />\nguages<br />\nThe judges will be chosen from<br />\n(Greek Letter Sooksties)<br />\nHopkins Scholarships (for stuamong the following men; Dr. j.<br />\ndents from the Southern States<br />\nR. Fisher, Randolph-Macon Coland Maryland)—W. H. Bell, Rolege, Ashland, Va.; Judge FeidelPrinters of Philological and<br />\nmance; F. H. Brickwedde, Physsohn, William and Mary College;<br />\nScientific Works<br />\nics; C. W. Buchheister, Greek;<br />\nE. H. Gwarthney, of William and<br />\n23 S. HANOVER ST.<br />\nMargaret M. Carey, English; R.<br />\nMary Faculty; Hon. Wyndham<br />\nBaltimore, Md.<br />\nE. L. Collins, Geology; R. G.<br />\nMeredith, Richmond, Va.; Hon.<br />\nCook, Chemistry; F. Diehl, PhiloGeorge Bryan, Richmond, and<br />\nsARATOGA AT<br />\nsophy; R. M. Dorcus, Psychology;<br />\n518 N. CHARLES STREET,BALTIMORE<br />\nRabbi Calish, Richmond, Va.<br />\nEmily<br />\ny;<br />\nChemistr<br />\n,<br />\nDrinkard<br />\nD.<br />\nLIBERTY STS. R.<br />\nOrchestra—Dancing<br />\nTelephone, Vernon 3442<br />\nQuinbi<br />\nW. Emmart, Zoology; A. Fedder,<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M.<br />\nEconomics; C. D. Gregory, Math- LECTURES ON ENGINEERING<br />\nLUNCHEON<br />\nTABLE D'HOTE<br />\nematics; T. H. Hazelhurst, ChemPRACTICE<br />\nInn<br />\nTEA<br />\nDINNER—$1.00<br />\n0c<br />\nON-6<br />\nLUNCHE<br />\nEsther J Hawkes, EducaThe Engineering Department of<br />\nDINNER istry;<br />\nSUNDAY DINNER—$1.25<br />\ntion; J. W. Hopkins, Mathemat- the University has secured three<br />\ncs;<br />\nEconomi<br />\nprominent engineers who will lecSPECIAL PARTIES ics; Mary C. Howard,<br />\nW. L. Hyden, Chemistry; A. C. ture to the students on Engineering<br />\n11.30 A. M.<br />\nuntil<br />\nLangeluttig, Jr., Political Science; Practice.<br />\nPLAZA 6987<br />\n7.30 P. M.<br />\nB. S. Levin, Economics; Marie L. It is intended that the lectures<br />\nLinthicum, English; Grace Lubin, shall deal with the practical phases<br />\nChemistry ; 0. W. Lusby, Chemis- of engineering problems. They will<br />\nFine Clothes<br />\ntry; W. C. Mallaleiu, History; discuss daily working methods of<br />\nA snit by Lemmert gives the final Olga Marx, German; C. D. Ma- design, construction, and operation,<br />\nYOU WILL FIND OUR STOCK OF STANDARD MAKE SE1S<br />\ntouch to the lasting satiisfaction you<br />\nthews, Semitics ; Winnie McGlan- rather than describe new and strikAND APPARATUS WILL MEET YOUR EVERY NEED<br />\nderive from thoroly dependable<br />\ncloths cut in authentic fashion— nery,, Geology ; Mary W. McGe, ing applications.<br />\nCOMPLETE VACUUM TUBE RECEIVERS, $39.95 UP<br />\nwhether for every-day wear or more<br />\nhee, Archaeology; G. S. Mitchell, \"Power Development—Past and<br />\nfestive occasions.<br />\nEconomics; H. A. Noble, Geolo- Future,\" will be the theme of Mr.<br />\nat<br />\nERT<br />\ngy; F. J. Rich, Chemistry; Lula George A. Orroch on Monday,<br />\nLEMM<br />\n1724 N. CHARLES ST.<br />\nM. Richardson, Romance; H. A. April 30. Mr. Orroch is consulting<br />\n19 Fayette Street, East<br />\nF.<br />\n10 Minutes from Hopkins<br />\nVernon 3055<br />\nDress Clothes Robinson, Mathematics; L.<br />\nengineer in New York city.<br />\nBusiness Suits<br />\nd,<br />\nSingewal<br />\nD.<br />\nQ.<br />\nHistory;<br />\nSheffey,<br />\nSport Togs<br />\nThese lectures will be held in<br />\nOvercoats<br />\nGeology; R. C. Smith, Philoso- Room 110, Mechanical and Elecphy; G. W. Spicer, Political Sci- trical Engineering Building at 4.10<br />\nence; J. C. Thompson, Jr., Chem- P. M.<br />\nistry; .C. N. Warfield, Physics;<br />\nRENT A CAR!<br />\nScience;<br />\nPolitical<br />\nWatkins,<br />\nD.<br />\nR.<br />\nMANUFACTURING JEWELERS<br />\nDRIVE IT YOURSELF<br />\nMovie Director (to applicant for<br />\nD. P. Weld, Chemistry.<br />\nLancaster, Pa.<br />\nFords, 12c per Mile<br />\nHups and Dodges, 18c per Mile<br />\na position)—\"Can you swim, my<br />\nClass Rings, Pins, Fraternity Pins,<br />\nCups, Medals, Etc.<br />\nJunior Banquet Tomorrow Night dear?\"<br />\nStationery, Invitations, Programmes<br />\nDRIVE IT YOURSELF CO.<br />\nThe annual banquet of the<br />\nSeals\"<br />\nVarsity<br />\nBeauty—\"Certainly not! I'm apthe<br />\n\"Makers of<br />\nJunior Class will be held tomorrow plying for a position as a bathing<br />\nVERNON 4049<br />\n1725 N. CHARLES ST.<br />\nnight at Hotel Emerson, at 8 beauty, not a fish.\"<br />\n181r3<br />\ned<br />\nEstablish<br />\n(One block South of North Ave.)<br />\no'clock. C. P. Coady will be toastA.H.Fetting Man'fg Jewelry Co. master.<br />\nOPEN ON SUNDAY<br />\nyou know Poe's<br />\nThe committee in charge has ar- Soph—\"Do<br />\nManufacturers<br />\nranged an attractive program for Raven ?\"<br />\nGreek Letter Fraternity Jewelry<br />\nthe entertainment of those pres- Frosh—\" No; what's the matter<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nwith him?\"<br />\nent.<br /><br />\nFURNITURE OF QUALITY<br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nJ. H. Furst 8,r Co.<br /><br />\n•CHANTILLY<br />\nRestaurant Francais<br /><br />\nRADIO SUPPLY CO.<br /><br />\nJ. F. Apple Co.<br /><br />\nW.L. Mann<br />\nCommercial Photography<br />\nCircuit Photography<br />\nViews<br />\nFlash Lights<br />\nments<br />\nEnlarge<br />\nGroups<br />\nKODAK FINISHING<br />\n325 N. Howard St.<br />\nMt. Vernon 4999<br /><br />\nSHIRTS<br /><br />\nNECKWEAR<br /><br />\nLefranc &amp; Ault<br /><br />\nCertainly Does Keep<br />\nYour Engine Perfect<br /><br />\nA Hopkins<br />\nBroq ue $8<br />\nOf heavy Scotch Grain Leather; black or<br />\ntan; equipped with rubber heel:—a college shoe designed for real college men.<br /><br />\n421 N. HOWARD ST.<br /><br />\nHOSIERY<br /><br />\n-The King of Lubricants\"<br />\nSHERWOOD BROTHERS, INC.<br /><br />\nURNER'S<br />\nMEN'S SHOES<br /><br />\nGLOVES<br /><br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\n$3.25 and $4.26<br />\nNegligee<br />\n$5.25 and $6.26<br />\nImported Madras<br />\nTerms Cash, Less 10% 30 Days on<br />\nShirts<br />\nAlso a Full Line of Men's<br />\nFurnishings<br /><br />\nSTRATTON<br /><br />\nHOME OEILS<br /><br />\nSlesingers<br />\nAT CHARLES STREET<br />\n216 NORTH<br /><br />\nOf the Better Class<br /><br />\nURNER BROTHERS<br />\nIII E. BALTIMORE STREET<br />\nBALTIMORE<br /><br />\nPUBLIC SALES<br />\nWe have purchased 122,000<br />\npair U. S. Army Munson last<br />\nshoes, sizes 51/2 to 12 which<br />\nwas the entire surplus stock<br />\nof one of the largest U. S.<br />\nGovernment shoe contractors.<br />\nThis shoe is guaranteed one<br />\nhundred per cent, solid leather, color dark tan, bellows<br />\ntongue, dirt and waterproof.<br />\nThe actual value of this shoe<br />\nis $6.00. Owing to this tremendous buy we can offer<br />\nsame to the public at $2.95.<br />\nSend correct size. Pay postman on<br />\ndelivery or send money order. If<br />\nshoes are not as represented we<br />\nwill cheerfully refund your money<br />\npromptly upon request.<br /><br />\nNational Bay State<br />\nShoe Company<br />\n296 Broadway, New York, N. Y.<br /><br />"}], "field_media_file": [{"target_id": 37741, "display": null, "description": null, "target_type": "file", "target_uuid": "c3e04499-9e5a-4402-9ba9-afde429ae2d9", "url": "http://digital.library.jhu.edu/system/files/2022-03/13061-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13061, "target_type": "node", "target_uuid": "ea4a9d4b-6d83-4630-a4c5-9c77515a613f", "url": "/node/13061"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "f6295b9b-3e09-4b34-b736-2ad13b3ca10b"}]}