{"mid": [{"value": 36665}], "uuid": [{"value": "3f30dbb3-f3e9-4f89-9141-ce65c260af15"}], "vid": [{"value": 36665}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:51:22+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12967-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:51:22+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:51:22+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVI. No. 13<br />\n<br />\nBALTIMORE, MD., NOVEMBER 15, 1921<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\n-:- BEAT ST. JOHNS!-:CROSS-COUNTRY TEAM ENTERS INITIAL MEET<br />\n<br />\nBASKETBALL SCHEDULE<br />\nSOON TO BE APPROVED<br />\n<br />\nBut Four J. H. U. Runners Entered.<br />\nBooth Declared Ineligible.<br />\n<br />\nCoach for Team to Be Selected.<br />\n<br />\nDR. ALPHONSO SMITH ADDRESSES STUDENT<br />\nASSEMBLY<br />\n<br />\nHOPKINS LOSES TO<br />\nSWARTHMORE,7 to 0<br />\n<br />\nAccording to the latest advices Those \"Elements of American LiteraThe Johns Hopkins Cross- from the Athletic Board the ture Which Make the Greatest Im- TEAM PLAYS SPLENDID GAME IN SPITE OF MUDDY FIELD.<br />\npression on Europeans\" is Topic.<br />\nCountry team took its initial crack Homewood Company has pracSCORE COMES IN SECOND QUARTER AS RESULT OF<br />\nONSIDE KICK. CALKINS AND BONNER STAR FOR<br />\nat the sport last Saturday when tically decided to go through with \"Those Elements of American<br />\nBLACK AND BLUE. WESTERMAN INJURED.<br />\nWhich<br />\nLiterature<br />\nMake<br />\nthe<br />\nfive men, with Manager Fortney, the basketball chedule this year.<br />\nImpression<br />\nGreatest<br />\non<br />\nEuOn a field ankle deep in mud and water Hopkins went down to<br />\nmade the trip to Easton, Pa., to Although no final action will be<br />\nenter the Middle Atlantic States taken for several weeks the Ath- ropeans,\" was the topic on which defeat before Swarthmore on Saturday by the score of 7 to O.<br />\nIntercollegiate Athletic Associa- letic Board at its next meeting, Dr. ..Nlphonso Smith, head of the Swarthmore got one break in the second quarter and that break<br />\ntion Cross-country Championship which will be held November 21, English Department at the United was enough to win the game, although for the greater part of the<br />\nrace.<br />\nwill take up the matter of appoint- States Naval Academy, addressed time Hopkins outplayed the Garnet eleven.<br />\nEarly in the game the fight became a punting contest between<br />\nThe host, Lafayette College, ing a coach and a call for candi- the student body at the Assemlost the championship for the first dates will be issued as soon as this bly last Thursday. Dr. Smith, Calkins and Asplundh with Calkins having the edge throughout. In<br />\ntime since 1915, her representa- is done. There is a great deal of who was introduced by Dean La- the first quarter several kicks were exchanged and then Swarthtives being outclassed by athletes good material at the University tane as one of the few men who<br />\nmore threatened the Hopkins goal<br />\nfrom both Rutgers and Bucknell. this year and a winning team came in close contact with the for- PROPOSED TO ADMIT BAND due to a fumble and a pretty forTO VARSITY SEAL<br />\nRutgers won the race with a total should be turned out. With Ow- mer Kaiser and still refused to be<br />\nward pass, Asplundh to White.<br />\nCOUNCIL<br />\nof 42 points, while Bucknell was ings, Bauernschmidt, of the un- hypnotized by him, is a Johns<br />\nWith the ball on their three-yard<br />\nVote of All Varsity Seal Holders<br />\nsecond, with 43; Lafayette third, dergraduate school, and Keye, Hopkins alumnus. He was forline Landy and Totterdale threw<br />\nNecessary.<br />\nwith 45, and Lehigh fourth, with Wilson and Saunders, of the merly the Edgar Allen Poe proGeiger for a ten-yard loss, causfessor<br />\nof<br />\nEnglish<br />\nat<br />\nUniversithe<br />\n80.<br />\nTo<br />\ncomply with the constitu- ing him to fumble. Yarnall recovMedical School, the new coach<br />\nHopkins entered but four men: will have a nucleus to start with ty of Virginia and just prior to the tion of the Student Activities ered. Swarthmore then failed on a<br />\nSommerville, Edwards, Milligan at the beginning of the season, al- Nvar he was the Roosevelt profes- Council it is necessary that each pass and the ball went to Hopand Fenton, Booth having been though the places held by all sor of English at the University of holder of the Varsity Seal now in kins on downs. The Black and<br />\ndeclared ineligible at the last mo- these men last year will be hotly Berlin, a position which gave hini the University give his vote on Blue immediately took the ball<br />\nment. Bob Crawford, of Lafay- contested for by members of last every opportunity of learning the the proposal now before the Coun- nit of danger and the period ended<br />\nette, who barely beat Booth last year's Freshman team, and the attitude of Europeans toward cil, to admit the band to member- with the Black and Blue having<br />\nyear after the latter had suffered new men at the University this American literature.<br />\nship on the Council. Secretary the decided advantage, both on<br />\nThe portrayal of Indian charac- Lipps will, therefore, see such ground gaining and kicking.<br />\na bad tumble, was individual point year.<br />\nwinner. Booth had hoped to get<br />\nThe schedule is not complete ter, the short story, the humor and Varsity Seal wearer to ascertain<br />\nIn the second period the Hopanother chance against Crawford as yet, but in its present form the idealism of American writers his vote, and so it is important kins line was weakened due to<br />\nand although declared ineligible, calls for games with Navy, Get- created the greatest impression on that. these men be. cognizant of Westerman being forced<br />\nout of<br />\nhe entered the race and finished tysburg, Rutgers, Bucknell, Dick- European critics, according to Dr. the details of the band's proposed the game with an injured<br />\nback and<br />\nfirst, falling seven seconds short inson, Swarthmore, Virginia, St. Smith.<br />\nrecognition.<br />\nMagill's ejection for allowing WilThe portrayal of the customs<br />\nof the record for the distance, John's and St. Francis of BrookA committee from the Council lis of Swarthmore to slug him.<br />\nwhich was five and one-quarter lyn. Other teams of this calibre and life of th!:.. American Indian is has carefully surveyed the mat- Nevertheless, Hopkins was ripmiles over a hilly course.<br />\nare also being scheduled and the particularly appealing to foreign- ter, especially as it relates to the ping through the Garnet line for<br />\nSommerville, Deitrick of Rut- management hopes to have sev- ers.<br />\nother musical organizations on gain after gain and forcing Asi<br />\n\"This<br />\nne<br />\nw<br />\nand<br />\noriginal type,\" the campus,and has recommended plundh to kick every time<br />\ngers and Hendrickson of Bucknell eral other attractive games to anSwarthhe said, \"gave America a literary that the following plan be adopt- more<br />\nnounce in the near future.<br />\nContinued on page, 4 col. 2<br />\nhad the ball. Then it was<br />\nstanding in all lands.\" So vividly ed. It is thought by members of that<br />\nSwarthmore scored. The<br />\nhas the American Indian been por- the Council that it will satisfac- Hopkins<br />\nline had held and Astrayed by James Fennimore Coop- torily settle the question of the plundh kicked.<br />\nYarnall was outer especially, that many Eu- band's representation. This plan side at the<br />\ntime and, he tore down<br />\nropeans believe that rural Ameri- as slightly amended and approved the field, falling<br />\non the ball as<br />\ncans still go to church with a rifle by the Student Activities Council Bonner watched<br />\nit roll outside. It<br />\nUSHERS PREPARED TO HANDLE RECORD CROWD. WORK on the shoulder. Cooper and Poe is as follows:<br />\nwas Swarthmore's ball on our<br />\nare probably the most widely read<br />\n1. The Glee Club, the Instru- five-yard line. From there<br />\nON SPECIAL STANDS STARTED. ODDS GIVEN<br />\nGeorges<br />\nof all American writers and so mental Club and the Jazz Band, following<br />\nFOR A ST. JOHN'S VICTORY<br />\nperfect interference,<br />\nwell are Poe's works known that together with other special con- took the<br />\nball over for the only<br />\nProbably the greatest football duced a machine designed to flatone German woman said she cert numbers, shall retain their score of<br />\nthe<br />\ngame.<br />\nfrenzy of years has been worked ten our opponents flatter than<br />\nUp over the coming annual St. they have ever been flattened be- thought that Annabelle Lee was present organization, their presThe second half was played althe greatest American woman.<br />\nent representation on the Student<br />\nJohn's-Hopkins football game. fore.<br />\nmost entirely in midfield, with<br />\nThe American Short Story is a Activities Council and their presNot only is the competition<br />\nHopkins having the better of the<br />\nOne of the local papers picks phrase known all over<br />\nEurope and ent quota of Varsity Seals.<br />\nmarked by the usual traditional the boys from the Severn to<br />\nargument, both in ground gaining<br />\nis probably the only type of lit2. The Undergraduate Orchesrivalry, but for the first time in emerge the winner by a 28-7 score.<br />\nand kicking, except in the final<br />\nerature in which Americans excel!. tra and the Band shall form a sepYears the state championship is at To the mind of anyone who has<br />\nminutes, when Swarthmore let go<br />\nWhile we have not produced great arate organization, each having<br />\nstake. Ever since the defeat of really followed the two teams, this<br />\na powerful offensive which<br />\nnovels or essays, we have many one representative on the Student<br />\nMaryland State by the Annapolis sounds like wild speculation. Such<br />\nweakened as the whistle ended the<br />\nmen who have written short Activities Council, the number of<br />\ncollege, the Hopkins and St. a prediction would serve to indigame.<br />\nstories of the highest type. Speak- Varsity Seals to be awarded each<br />\nJohn's teams, the rooters of the cate that the writer believes that<br />\nFor Hopkins, Calkins and Boning of the short story, Dr. Smith year being decided by the Student<br />\ntwo institutions and the public at the Black and Blue will be as badner<br />\nstarred in the backfield, while<br />\nsaid :<br />\nActivities Council.<br />\nlarge have waited with great ex- ly outclassed as they were against<br />\nthe<br />\nwhole line played their usual<br />\nThe Council hopes that all VarPectancy for the battle of Novem- Georgetown last year, when a 28- \"Washington Irving legendized<br />\nsteady<br />\ngame. Calkins' kicking, esit, Hawthorne allegorized it, Poe sity Seal members will think careber 19.<br />\n7 score resulted.<br />\npecially,<br />\nwas beautiful; one of his<br />\nstandardized it, Bret Harte local- fully about the matter and vote<br />\nBoth teams have made brilliant<br />\nboots<br />\ngoing<br />\nfor 65 yards. For<br />\nThe scribe who arrived at this ized it,<br />\nJoel Chandler Harris folk- for a measure that gives a deservrecords for the season, but had great conclusion would lead<br />\nSwarthmore,<br />\nAsplundh's kicking<br />\none to lorized it and 0. Henry socialized ing student activity adequate recthey not, the past would have believe that St. John's<br />\nkept them always in the running,<br />\nwill score it.\"<br />\nognition.<br />\nbeen a closed affair and victory in four touchdowns against us<br />\nwhile Geiger and Yarnall's dashes<br />\nby<br />\nthe annual clash would have been<br />\nEdgar Allen Poe is looked<br />\nthrough the line and around the<br />\n(rood football and that we stand a<br />\nupon as the founder of the Ameri- SOPHOMORE CLASS APPOINTS PEP ends were<br />\nthe final goal of each.<br />\nhard to stop.<br />\nchance to score a single marker<br />\nCOMMITTEE<br />\nOdds on the game have shifted by an intercepted pass, a break, or can short story. He claimed that<br />\nThe lineup:<br />\nthe previous ways of approaching<br />\nAt a meeting of the Sophomore<br />\nfrom one side to the other. Every<br />\na long run by one of our speedy<br />\na story were wrong and that the Class held last Thursday in the JOHNS HOPKINS<br />\nSWARTHMORE<br />\ngathering place in Maryland for backs.<br />\nwriter should think only of the ef- M. E. Hall, President Callard ap- Middleton<br />\nLE<br />\nthe past few weeks has been a<br />\nJackson<br />\nSt. John's can bring all the fect he desires to produce on the pointed a \"pep\" committee, con- Westerman ....L.T........ Wilcox<br />\nPari-mutuel\" and at each place<br />\nMagill<br />\nL G<br />\nWillis<br />\nthe odds have been different. Each Tickeys, Cashells, Yox's, Browns' reader and make everything he sisting of seven men, whose duty Totterdale (c) C<br />\nCornell<br />\nLandy<br />\nR<br />\nG<br />\nKnauer<br />\nSide seems equally confident. The and Downs' that they can muster writes point to this effect. To for- will be to instill \"pep\" in the Knecht<br />\nR T<br />\nDudley<br />\nup,<br />\nbut<br />\nit<br />\nimprobable<br />\nmost<br />\nis<br />\nthat<br />\neigners<br />\nSophomore<br />\nthese<br />\nClass<br />\nwith<br />\ndeal<br />\nand<br />\nRich<br />\nto<br />\nstories'<br />\nteach<br />\ncasual observer would declare that<br />\nR E<br />\nmore<br />\nOgden<br />\nDarley<br />\nQ B<br />\nGeiges (c)<br />\nabout the United States than do those members of the Freshman<br />\nan \"irresistible force\" was about they will beat 'Hopkins 28-7.<br />\nMarken<br />\nL H<br />\nWhite<br />\nContinued on page 4, col. 3<br />\nto move an \"immovable object.\"<br />\nBonner .. ...R.H.<br />\nBetween now and Saturday pep histories and they are particularYarnall<br />\nCalkins<br />\nF B<br />\nAs lundh<br />\nThere is no doubt that Coach Pat demonstrations will be very much ly well liked because of their<br />\nRowland for Magill. Swarthmore—ShoeSCORE<br />\nBY<br />\nquick<br />\nbeginning and ending.<br />\nPERIODS<br />\nKrebs will bring to Baltimore one in evidence, as a bolster of courmaker for Willis, Baxter for Ogden,<br />\n0 7 0 0-7<br />\nof the best teams ever to repre- age to Van Orman and the eleven, The warm, clean, wholesome Earp for White. Referee—Dr. W. C. Swarthmore<br />\nO'Brien, Central High, Philadelphia. Johns Hopkins..<br />\n0 0 0 0-0<br />\nsent St. John's, but it is also true who, like Pershing, eagerly await American humor is another thing Umpire—F. R. Gillinder, Penns7lvania.<br />\nTouchdowns—Geiges. Goal from<br />\nlinesman—A.<br />\nHead<br />\nTyler,<br />\nPrinceton.<br />\nC.<br />\ntouchdown—Yarnall.<br />\nthat Coach Van Orman has pro- \"Der Tag.\"<br />\nContinued on page 4, col. 2<br />\nSubstitutions:<br />\nTime of periods-10 minutes.<br />\n<br />\nAll Indications Point to St. Johns<br />\nGame as Closest Battle Ever<br />\nStaged Between the Two Colleges<br />\n<br />\nJohns Hopkins—Barton for Westerman,<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 15, 1921<br />\n<br />\n2<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\nFOUNDED 1897.<br />\n<br />\n$2.50<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\n<br />\nTelephone<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22,<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\nAssociate Editors:<br />\nEDWARD G. HUEY, '22.<br />\nELI F.ANK, JR., '22.<br />\nJunior Editors:<br />\nCHARLES C. MARBURY, '22.<br />\nLAWRENCE B. FENNEMAN, '23.<br />\nJ. BRENTNALL POWELL, '23.<br />\nCRAIG E. TAYLOR, '24.<br />\nJ. HUDSON HUFFARD, '23<br />\nJOSEPH S. LEIPOLD, '24.<br />\nDONALD H. KIRKLEY, '25.<br />\n<br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN,'23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br />\n<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South<br />\n<br />\nSts., Baltimore, Md.<br />\n<br />\nBALTIMORE, MD., NOVEMBER 15, 1921<br />\nTHE FUTURE OF THE ASSEMBLIES<br />\n<br />\nINTERFRATERNITY BOARD<br />\n<br />\nDR. AARONSON AIDS FOOTBALL<br />\n<br />\nQUESTIONS PLEDGEES<br />\n<br />\nSQUAD<br />\n<br />\nThe Interfraternity Board held<br />\na meeting last Monday for the<br />\npurpose of questioning each of the<br />\nnew pledgees of the respective fraternities in regard to violations of<br />\nthe \"rushing\" agreement. Each<br />\nfraternity brought its pledgees before the board which asked each<br />\none separately whether or not any<br />\nviolations had been committed to<br />\nhis knowledge. All of those questioned declared that they knew<br />\nAlnothing of any violation.<br />\npledgees<br />\nof<br />\nthe<br />\nwere<br />\nthough a few<br />\nabsent, it is believed that when<br />\nthese appear at the next meeting<br />\nof the board on Monday their answer will show that the agreement<br />\nhas been kept by all parties.<br />\nAt the same meeting of the<br />\nboard the averages for each fraternity were handed in for the<br />\npurpose of ascertaining the frat<br />\nwhich will receive the cup to be<br />\npresented for highest scholastic<br />\nstanding. Announcement of the<br />\nwinner will be made shortly.<br />\n<br />\nThe lighting effect on Straus'<br />\nField for the after-dark practices<br />\nhas been greatly improved by the<br />\naddition of two arc lights on the<br />\nwest side of the field. The necessity for these lights has long been<br />\nfelt, but the \"powers that he\" at<br />\nHopkins had delayed installing<br />\nthis necessary illumination because of the expense involved.<br />\nAn old Hopkins alumnus in the<br />\nperson of Dr. M. W. Aaronson,<br />\n1706 Eutaw Place, came to the<br />\nrescue and offered to defray the<br />\nexpenses of the installation of the<br />\nlights. His offer was accepted and<br />\nthe improvement, which is very<br />\nnoticeable, has excited the gratitude of the entire squad.<br />\n<br />\nTeachers!<br />\nUY or rent Corona<br />\nB<br />\ntypewriter on easy<br />\npayments. Carry it to<br />\na<br />\n<br />\nschool every day in its<br />\nneat case. Make extra<br />\nmoney writing articles or<br />\ndoing typing for others!<br />\nCalltoday at the nearest<br />\nCorona store—or telephone for a demonstration at your home.<br />\nM. W. LUCY & CO.<br />\n118 W. Fayette St.<br />\nWeighs GM lbs.<br />\nFolds and fits<br />\nin a neat carrying case.<br />\nSRA with<br />\ngow case<br />\n<br />\nCoRONA<br />\nThe Personal Writing Machine<br />\n<br />\nOur -prep- room on the<br />\nthird floor specializes in<br />\n<br />\nASSISTANT DIRECTOR OF HOSPITAL APPOINTED<br />\n<br />\nThe selection of Dr. Alphonso Smith as the speaker at the last<br />\nThe appointment of Dr. Walter<br />\nAssembly was a most fortunate one. Dr. Smith is an excellent J. Craig to the position of assistspeaker and his talk was instructive, interesting and, what is most ant director of the Johns Hopkins<br />\nessential, short.<br />\nHospital has been announced by<br />\nDr. Winford Smith, director of the<br />\nThe Student Assemblies, as we understand them, are primarily<br />\nhospital. Dr. Craig will succeed<br />\nfor the development of student life and spirit, and they have been Dr. Karl Van Norman, who remost successful in this direction. Long-winded, monotonous speeches signed some time ago.<br />\nby boring speakers will destroy this spirit and cut the attendance.<br />\nDr. Craig is a native of Albany,<br />\nAt the same time, meetings devoted entirely to student announce- N. Y. He is a graduate of the Yale<br />\nMedical School, 1920 class.<br />\nments, if too frequent, would become equally tiresome.<br />\n<br />\nclothes for young men.<br />\n<br />\niRe<br />\n<br />\nHub<br />\n<br />\nBaltimore. Charles and Fayette<br />\n<br />\nThe future of the Assemblies lies in obtaining interesting speakers, like Dr. Smith, who are capable of holding their audience and<br />\nknow when to stop.<br />\n<br />\nSOFT PEDAL,THERE!<br />\nTowards the close of this week there will be inaugurated by Hopkins men a series of parades, bonfires, stunts, etc., by which the participants will endeavor to inform the city of Baltimore—and St.<br />\nJohn's—that there is a Hopkins-St. John's game at Homewood Saturday.<br />\n\"Pep\" is the watchword;\"pep\" is desired. With this \"pep\", however, should be mingled a certain amount of moderation, of selfrestraint. It should be remembered at all times that the parade and<br />\nbonfire are Hopkins activities, the participants Hopkins men, and that<br />\nthe University will be judged by our actions on these occasions.<br />\n<br />\nMURAD<br />\nTHE TURKISH CIGARETTE<br />\n<br />\nDO YOU REMEMBER?<br />\nDo you remember the lump in your throat when the first regiment entrained for France? Do you remember the thrill of victory<br />\nwhen that regiment came marching home to the tune of martial<br />\nbands, to the plaudits of cheering throngs? Perhaps you joined step<br />\nwith them. Perhaps you too had been across. At any rate, you saw<br />\nand welcomed them.<br />\nBut, do you remember those who could not keep step with the<br />\nmarching hundreds, those who rode in motor cars—because somewhere on a foreign battlefield wounds were received which made it<br />\nimpossible for the heroes, though stout of heart, to join that triumphant procession?<br />\nAnd do you remember the files of marching women who came<br />\nhome after the Armistice was signed, the brave, heroic ones, who in<br />\nfield and base hospitals nursed back to life wounded ones of the<br />\nArgonne, of Verdun, and of Chateau Thierry ?<br />\nIf you do remember you cannot forget that it is YOUR duty<br />\nNOW to think first of those who formed the first line of defense. It<br />\nyour privilege to see that those men who could not march, who<br />\ncan not even now be fitted into the old vocations, be made strong<br />\nenough to work once more and be trained into new pursuits. It is<br />\nalso your privilege to keep intact the army of nurses that the recovery<br />\nof the disabled men may be as rapid as possible.<br />\nThe American Red Cross is helping point the way to this readjustment of the lives of the wounded soldiers, sailors and marines.<br />\nThe Fifth Annual Roll Call—November 11 to 24—is the means by<br />\nwhich you can help. The membership fee is $1. Your subscription is<br />\nneeded.—From the \"Trinity Tripod.\"<br />\n<br />\nzci<br />\n—r=1.1<br />\n<br />\nII..<br />\nGIGNWENT<br />\nISRICISII.<br />\n‘4<br />\nESPECAM.1:4 FaR<br />\n<br />\n..<br />\n-...<br />\nS<br />\n<br />\nEXPER1ENC waseei<br />\nARE'MADE<br />\ni<br />\nMSCRWMAAIttAG MAD<br />\nADE<br />\n1-11GIA Gcl<br />\nlei%<br />\nOF<br />\nCIGARECTES--StADKER<br />\n1)14105ti<br />\n\"V<br />\n<br />\n1.S<br />\n/<br />\n1..1,<br />\n-- ,11\"<br />\n\"Me:blendln. / ipoy<br />\nacatkow,<br />\nis<br />\n<br />\n• Every day MURADS are held<br />\nhigher in the estimation of the men<br />\nwho smoke them.<br />\nThey are the standard of Taste.<br />\nThey never disappoint—never<br />\nfail—never change—<br />\nThey are 100% pure Turkish tobacco—ofthe finest varieties grown.<br />\nYou are proud to smoke them<br />\nin any company—on any occasion.<br />\nThey are the largest selling highgrade cigarette in the world.<br />\nThe cigarette smokers ofAmerica<br />\nDO prefer Quality to Quantity.<br />\n\"Judge for Yourself—!\"<br />\n<br />\n20<br />\n<br />\nvefi<br />\n<br />\nl<br />\n<br />\nMalesehe<br />\nandEoluin<br />\n<br />\n,<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 15, 1921<br />\nDRAMATIC CLUB REHEARSING<br />\nONE-ACT PLAYS<br />\n<br />\nThe three one-act plays to be<br />\nproduced by the Dramatic Club<br />\nearly in December are now under<br />\nrehearsal. The casts which were<br />\nannounced in a former issue of the<br />\nNews-Letter are<br />\nparticularly<br />\neager to make these plays a success, as upon their success or failure depends their collegiate dramatic future.<br />\nGilson Engel, president of the<br />\nDramatic Club, has appointed Eli<br />\nFrank, Jr., chairman of the committee in charge of the plays. He<br />\nwill be assisted by Henry West,<br />\nWho will coach Philip Moeller's<br />\nPlay, \"A Roadhouse in Arden,\"<br />\nand \"Joe\" Moran, who will coach<br />\nhis own play. Moran has yet to<br />\nchoose the cast for his play, but<br />\nhe intends to do this shortly.<br />\nFrank will coach the tragedy,\"A<br />\nDeath in Fever Flat\" himself.<br />\nThe scenery will be designed<br />\nUnder the direction of Mariano<br />\nBacilli°. The plays are especially<br />\nwell adapted to being produced<br />\nin the Bohemian atmosphere the<br />\nclub has created in their studio.<br />\nThe style of the scenery will be<br />\nmodern.<br />\n<br />\nORTMAN'S<br />\n<br />\nNOON-DAY BIBLE CLASSES START<br />\n<br />\nThe first fleeting of the Bible<br />\nClass held last Wednesday was<br />\n\"Queen Quality\" Home Made<br />\nattended by a fairly large crowd.<br />\nChocolates<br />\nFrom the opening remarks of the<br />\nVISIT OUR ICE CREAM PARLORS<br />\n518 N. CHARLES ST.<br />\nleader, the Rev. F. C. Reynolds,<br />\nYoung Men's Clothing<br />\nthe course promises to be interesting. He selected as the subject<br />\nand Furnishings<br />\nfor the course a study of the book<br />\nof Genesis in the light of modern Are made a special feature of<br />\nCharles and 22nd Sts.<br />\nscience and invention, with parDelicious Sodas and Sundaes<br />\nhere.<br />\nticular stress upon its relation to<br />\nThe Best of Candies<br />\nour modern moral and social life.<br />\nPrompt & Efficient Service<br />\nGive us a call and let us become<br />\nDr. Reynolds expressed a wish<br />\nbetter acquainted for mutual<br />\nthat the discussions be informal<br />\nbenefit.<br />\nand that everyone feel free to ask<br />\nany questions regarding religious<br />\nST. PAUL & 24th STS.<br />\nlife. Consequently, it is planned<br />\nC. D. Wolfe, Prop.<br />\nto make the meetings in the naCannection W tin Jam.UcCrters & Co..Nein roa,<br />\nDELICIOUS SODAS & SUNDAES<br />\nture of an \"open forum.\" Every<br />\nMade With<br />\nHoward at Lexington<br />\nstudent will find it well worth<br />\nJersey Special Ice Cream<br />\nwhile to attend this class which<br />\n\"The Velvet Finish\"<br />\nmeets every Wednesday during<br />\nKODAKS CAMERAS SUPPLIES<br />\nthe noon hour in room 110, M. E.<br />\nWhitman's<br />\n<br />\nChelsea Pharmacy<br />\n<br />\nThe College Drug Store<br />\n<br />\nSIEWART8CO.<br />\n<br />\n3<br />\nMt. Vernon 4999<br />\n<br />\nW.L. Mann<br />\nCommercial Photography<br />\nCircuit Photography<br />\nFlash Lights<br />\nViews<br />\nGroups<br />\nEnlargements<br />\nKODAK FINISHING<br />\n325 N. Howard St.<br />\n<br />\nR.G. by & Company<br />\n1 W. University Parkway<br />\nOpposite J. H. U. Athletic Field<br />\n<br />\nDRUG STORE for J. H. U. BOYS<br />\nPHONE, HOMEWOOD 2121<br />\n<br />\nBuy an (H) Pipe made special<br />\nfor the Boys<br />\n<br />\nChocolates and Bon Bons<br />\n<br />\nPREACHERS' CLUB SELECTS<br />\nOFFICERS FOR YEAR<br />\n<br />\nIn November, 1920, a group of<br />\nFreshmen got together and<br />\nformed an association afterwards<br />\nknown as the \"Preachers' Club.\"<br />\nThey were assisted in their organization by Pierce Hays, then<br />\nY1 M. C. A. secretary. Their primary object in forming the organization was to bring to the attention of the University authorities the need of such courses as<br />\nNew Testament Study and Hebrew, for clerical students and<br />\nministers who could devote a few<br />\nhours a day to this purpose.<br />\nIn the last part of the year it<br />\nWas definitely decided to carry on<br />\nthis organization. A constitution<br />\nWas drawn up and adopted. According to this constitution, the<br />\nPurpose of the club is to promote<br />\nfriendship and to interest all students in religious life work.<br />\nMeetings are to be held every<br />\nsecond and last Monday of each<br />\nmonth. If possible, a prominent<br />\nSpeaker will be secured for the<br />\nfirst meeting of each month. The<br />\nsecond meeting will be given over<br />\nto discussion of the talk of the previous week.<br />\nThe officers for this year are:<br />\nPresident, Paul Stevens; vicepresident, Kendig Wallace; secretary, Paul Silvester ; treasurer,<br />\nWheeler.<br />\nA meeting will be held this<br />\nMonday night. The Rev. Dr. William S. Hammond will give a talk<br />\nOn \"John Wesley and His Place<br />\nAmong the Great Christians.\"<br />\n<br />\nJ. H. U. BRANCH OF A. S. M. E.<br />\nMEETS<br />\n<br />\nThe Johns Hopkins Student<br />\n13ranch of the American Society<br />\nof Mechanical Engineers held a<br />\nbusiness meeting at 12.30 P. M.<br />\nNovember 9.<br />\nThe question of purchasing a<br />\ndie from which membership pins<br />\nWould be made for succeeding as<br />\nWell as present, members of this<br />\n°rganization was discussed and<br />\nthe plan adopted.<br />\nArrangements are now under<br />\nWay to secure several speakers,<br />\nWho have had practical engineering experience, to address this society branch during the coming<br />\nYear.<br />\n<br />\nShallenberger's Meter-1888<br />\n<br />\nSingle-Phase Meter-1921<br />\n<br />\nOliver B.Shallenberger<br />\nT IS ONE THING to produce a new idea<br />\nI that is simply of theoretical interest. It is<br />\nanother to make the new idea into a commercial success.<br />\n<br />\nI<br />\n<br />\nThis is the story of Oliver B. Shallenberger,<br />\nand how in 1888 he discovered the principle<br />\nthat led him to invent the watt-hour meter,<br />\nthe familiar little device that makes practicable<br />\nthe commercial distribution of alternating current, which means 95% of all the electricity<br />\nthat is distributed.<br />\nShallenberger, who resigned a Naval commission to take up his work with Westinghouse,<br />\nmade his discovery while experimenting with<br />\na newly devised alternating current arc lamp.<br />\nHis attention was attracted by the behavior of<br />\na small spring which had fallen upon the main<br />\nmagnet of the lamp, into such a position that<br />\nthe forces proceeding from both the magnet<br />\ncoil and the extended soft iron core affected it.<br />\nAnd the simple little thing that he noticed was<br />\nmerely that the spring was slowly rotating! But<br />\nto the intelligently curious observer, that was<br />\n• enough.<br />\nFurther experiments having satisfied him that<br />\nthe action was caused by alternating electric<br />\n<br />\ncurrents, he set to work, encouraged by his<br />\nknowledge of Westinghouse policies, to make<br />\npractical the newly found principle. Three weeks<br />\nof almost uninterrupted toil, and he had produced the first practical alternating current<br />\nmeter of the induction type—the universal type<br />\nof the present time.<br />\nThus for the first time the measurement of the<br />\nquantity of alternating current passing through<br />\na line was made commercially practicable and<br />\nits distribution became possible from an economic<br />\nas well as an engineering point of view. In fact,<br />\nthe whole structure of our great power systems<br />\ndepends upon the accurate measurement, by<br />\nmillions of such meters, of the electricity used<br />\nin the homes and industries of the nation. So<br />\nwell was Shallenberger's work done, and so<br />\ncomplete was his conception of the possibilities<br />\nof his discovery, that for more than thirty years<br />\nhis fundamental idea has been in use in many<br />\nand various forms.<br />\nThe encouragement which Westinghouse has<br />\nalways given to new ideas, and the judgment<br />\nwith which they have been evaluated, are<br />\nnowhere better exemplified than in this story of<br />\nthe alternating current meter.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LET TER, NOVEMBER 15, 1921<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n<br />\nFRESHMEN SHOW IMPROVEMENT<br />\nIN SCRIMMAGE WITH POLY<br />\n<br />\nSOPHOMORE CLASS APPOINTS<br />\nPEP COMMI1 TEE<br />\n<br />\nThe Home of<br />\n<br />\n(THE BOOK MART)<br />\n<br />\nContinued from page 1, col. 4<br />\nAfter the trouncing received at<br />\nSaturday<br />\nlast<br />\nSevern<br />\nhands<br />\nof<br />\nthe<br />\nClass who insist upcil dbcying<br />\nComplete Stock of<br />\nMedical Books and College<br />\nthe Freshman football team set- regulations. The President told<br />\nRequisites<br />\ntled down to a week of hard work. the class that every Sophomore<br />\nCoach \"Herb\" Armstrong attrib- was a member of this commitImporters and Dealers in Fine Books<br />\nuted his charges' defeat to the fact tee and urged that they should<br />\n301 N. CHARLES ST.<br />\nthat they had had no practice in not let the entire burden of the<br />\nBaltimore, Md.<br />\ndefensive work.<br />\nwork rest upon the seven chosen<br />\nPoly was brought to Home- men.<br />\nwood last Monday for a hard<br />\nThe class was told not to use<br />\nscrimmage and great improve- any of the methods objected to<br />\nment was shown by the Freshmen, —when the Dean is around. The<br />\nboth on the offensive and defen- nomination of the Sophomores to<br />\nsive. On several occasions the fill vacancies on the Hullabaloo<br />\nfirst-year men piled through the Staff was postponed until the next<br />\nCtibeXatterie) Poly line for great gains and at meeting.<br />\n4tIZS H.& OSCAR G.1011.<br />\nother times their own line was<br />\nEvery Sophomore who sees a<br />\nOWNERS<br />\npractically impregnable.<br />\nFreshman disobeying regulations<br />\n0ir\"414<br />\n'1741)E*1<br />\n-Wednesday's downpour pre- is urged to turn the name of said<br />\n29 Baltimore St., East<br />\nvented a strenuous practice, but Freshman and his offense or ofOne Door West of Light St.<br />\nstiff workouts were indulged in fenses into P. 0. Box 347.<br />\nSOLE AGENTS FOR BALTIMORE<br />\non Thursday and Friday. It is<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\nhoped that several more games<br />\nSIGMA CHI BETA<br />\nwill be scheduled before the close<br />\nThe Chas. Willms Surgical<br />\nThe Sigma Chi Beta Honorary<br />\nof the season.<br />\nInstrument Co.<br />\nFraternity which recently gave a<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nMEN'S SHOES<br />\nG. E. PLUMB TO ADDRESS SOCIAL very successful and commendable<br />\nSURGICAL INSTRUMENTS<br />\nLIBERTY ST. at SARATOGA<br />\nSCIENCE CLUB<br />\nOf the Better Class<br />\nMicroscopes and Supplies,<br />\n(Opposite Hotel Rennert)<br />\nafter-game dance is an honorary<br />\nStethoscopes<br />\nThe Social Science Club anBlood Lancets<br />\nBlood Counters<br />\nLUNCHEON—:—DINNER<br />\nnounces that Mr. Glenn E. Plumb, fraternity composed entirely of<br />\n11:30 until 7:30<br />\nof the Plumb Plan League, is to uppperclassmen, chosen from the<br />\nBANQUETS<br />\nSMOKERS<br />\nDANCES<br />\nlecture on Wednesday, November several fraternities on the campus<br />\nURNER BROTHERS<br />\nPrinters of Philological and<br />\nBy Arrangement<br />\n16, at 4.15 P. M., in the C. E. because of their positions as lead111 E. BALTIMORE STREET<br />\nScientific Works<br />\nBALTIMORE<br />\nTelephone St. Paul 6987<br />\nBuilding. The lecture is to be on ers in<br />\n23 S. HANOVER ST.<br />\nsome of the activities or in<br />\nBaltimore, Md.<br />\n\"Industrial<br />\nDemocracy.\" Mr.<br />\nathletics. Its object is to promote<br />\nPlumb will be remembered as the<br />\nDo you know how best to provide<br />\nORDERS RECEIVED FOR<br />\nauthor of the Plumb Plan of op- social relations and to bring about<br />\nan income for your old age?<br />\nCOGGINS'<br />\neration when the question of re- closer fellowship among the variConsult with<br />\nturning the railroads to private ous fraternities. Its president is Transfer and Baggage Express<br />\nW. W. WALKER<br />\nowners arose.<br />\nAUTOMOBILE SERVICE<br />\nWilliam G. Totterdale, and its<br />\n909 Calvert Bldg. St. Paul 2581<br />\nsecretary, Norvell E. Miller, Jr. PHONE, HOMEWOOD 2645-W<br />\nCROSS COUNTRY TEAM ENTERS<br />\nThe fraternity is formulating<br />\nINITIAL MEET<br />\nContinued from page I<br />\nplans for future social events<br />\nstaged a battle for ninth place,<br />\nwhich as yet cannot be announced.<br />\n\"Summy\" finally winning out.<br />\n<br />\nThe Overcoat<br />\n<br />\nYouthful novelty o'coats, with<br />\nstylish raglan shoulders, roomy<br />\narmholes, of soft, warm materials<br />\nUnmatchable values!<br />\n$35 and up<br />\n<br />\nCLOTHES<br />\n<br />\n211-213 E. Baltimore St.<br />\n<br />\nURNER'S<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br />\n<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br />\n<br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS<br />\n<br />\nHess Shoes<br />\n<br />\nAT §7)JOENS<br />\n<br />\nSummary:<br />\nCrawford, Lafayette, 37.34; Powell,<br />\nRutgers, 38.07; Robbins, Rutgers,<br />\n38.30; Jones, Bucknell, 38.34; Schmidt,<br />\nBucknell, 38.43; Tracey, Lafayette,<br />\n39.29; Harper, Lafayette, 39.29; Davis, Bucknell, 39.38; Sommerville, Johns<br />\nHopkins, 39.42; Deitrick, Rutgers,<br />\n39.42; Hendrickson, Bucknell, 39.42;<br />\nKemper, Lafayette, 39.53; Erb, Lehigh,<br />\n39.55; Lanning, Rutgers, 39.56; Romoser, Lehigh, 40.24; Marr, Rutgers,<br />\n40.40; Sizerman, Bucknell, 40.42; Wagner, Bucknell, 40.43; Edwards, Johns<br />\nHopkins,( 41.47; Sigmund, Lehigh,<br />\n41.45; Wright, Rutgers, 41.46; J. Gerlack, Lehigh, 41.58; Porter, Lehigh,<br />\n42.02; Underwood, Lehigh, 42.04; Milligan, Johns Hopkins, 42.08; Hevner,<br />\n3ucknell, 42.30.<br />\nTeam scores:<br />\nRutgers .... 2 3 9 13 15-42<br />\nBucknell ... 4 5 8 10 16-43<br />\nLafayette .. 1 6 7 11 20-45<br />\nLehigh . .. 12 14 17 18 19-80<br />\n<br />\ntmosphere—<br />\nThe subtle something that<br />\nmakes your college different<br />\nfrom any other, and dearer<br />\nto you,than all the rest combined. In cigarettes, it's the<br />\nsignal success that makes so<br />\nmanycollege men ofdiscrimination prefer Melachrino,<br />\nthe one cigarette sold the<br />\nworld over.<br />\n<br />\nDR. ALPHONSO SMITH ADDRESSES<br />\nSTUDENT ASSEMBLY<br />\nContinued from page 1, col. 3<br />\n<br />\nthat appeals to Europeans. From<br />\nthe time of Benjamin Franklin<br />\nTeach a Lesson in Style<br />\ndown to 0. Henry there has alThey possess the \"dash\" that<br />\nways been some great humorist<br />\nappeals to college men, toned<br />\nin<br />\nthe United States. One of the<br />\ndown to distinctiveness. And<br />\nwearing qualities that provoke<br />\nbest examples of this is seen in a<br />\nenthusiasm.<br />\nstory about a German editor who<br />\nN. HESS' SONS<br />\nwas preparing Mark Twain's<br />\nworks<br />\nfor Gcrthan use. The<br />\n8 E. BALTIMORE ST.<br />\nphrase—low—quartered shoes is<br />\nused in Huckleberry Finn and the<br />\nGerman editor, thinking this a<br />\nmisprint, devoted a half page footnote to his explanation. Low-waMADE TO ORDER<br />\nter was the term which was inAND<br />\ntended, he said, for what could be<br />\nmore natural for people living on<br />\nFINISHED CLOTHES<br />\nthe Mississippi River to use high<br />\nPLAZA BUILDING<br />\nwater shoes in time of flood and<br />\nlow water shoes in normal times.<br />\n19 and 21 EAST FAYETTE ST.<br />\nMark Twain, although he had a<br />\nchance<br />\nto do it, allowed this to<br />\nSHOES<br />\npass for sheer delight of humor.<br />\nfir<br />\nThe last great thing that charUNIVERSITY MEN<br />\nacterizes American literature is its<br />\nFor Sport Wear idealism and better still, by LaFor Dress<br />\nnier's poem on the Havershams.<br />\nSmart Styles—Best Leathers<br />\nThe former poem represents a<br />\nModerate Prices<br />\nselfish and the latter an unselfis..<br />\nidealism which Dr. Smith believes<br />\nbetter represents the American<br />\nspirit.<br />\n19 W. LEXINGTON ST.<br />\n<br />\nVer,<br />\n.<br />\n<br />\n\"<br />\n<br />\nLEMMERT<br />\n<br />\nWYMAN<br />\n<br />\n5<br />\n<br />\nZaw'<br />\n<br />\nRemember that Melachrino is a master<br />\nblend of the finest Turkish Tobaccos<br />\nas originated by Miltiades Melachrino.<br />\nEgyptian cigarettes are simply those<br />\nthat originated in Egypt. But the tobacco is what you want to know about<br />\n—and if it's Melachrino — it's right<br />\n<br />\nelachrino<br />\n<br />\n\" The Cigarette Elect of All Nations\"<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVI. No. 13<br /><br />\nBALTIMORE, MD., NOVEMBER 15, 1921<br /><br />\nPRICE 5 CENTS<br /><br />\n-:- BEAT ST. JOHNS!-:CROSS-COUNTRY TEAM ENTERS INITIAL MEET<br /><br />\nBASKETBALL SCHEDULE<br />\nSOON TO BE APPROVED<br /><br />\nBut Four J. H. U. Runners Entered.<br />\nBooth Declared Ineligible.<br /><br />\nCoach for Team to Be Selected.<br /><br />\nDR. ALPHONSO SMITH ADDRESSES STUDENT<br />\nASSEMBLY<br /><br />\nHOPKINS LOSES TO<br />\nSWARTHMORE,7 to 0<br /><br />\nAccording to the latest advices Those \"Elements of American LiteraThe Johns Hopkins Cross- from the Athletic Board the ture Which Make the Greatest Im- TEAM PLAYS SPLENDID GAME IN SPITE OF MUDDY FIELD.<br />\npression on Europeans\" is Topic.<br />\nCountry team took its initial crack Homewood Company has pracSCORE COMES IN SECOND QUARTER AS RESULT OF<br />\nONSIDE KICK. CALKINS AND BONNER STAR FOR<br />\nat the sport last Saturday when tically decided to go through with \"Those Elements of American<br />\nBLACK AND BLUE. WESTERMAN INJURED.<br />\nWhich<br />\nLiterature<br />\nMake<br />\nthe<br />\nfive men, with Manager Fortney, the basketball chedule this year.<br />\nImpression<br />\nGreatest<br />\non<br />\nEuOn a field ankle deep in mud and water Hopkins went down to<br />\nmade the trip to Easton, Pa., to Although no final action will be<br />\nenter the Middle Atlantic States taken for several weeks the Ath- ropeans,\" was the topic on which defeat before Swarthmore on Saturday by the score of 7 to O.<br />\nIntercollegiate Athletic Associa- letic Board at its next meeting, Dr. ..Nlphonso Smith, head of the Swarthmore got one break in the second quarter and that break<br />\ntion Cross-country Championship which will be held November 21, English Department at the United was enough to win the game, although for the greater part of the<br />\nrace.<br />\nwill take up the matter of appoint- States Naval Academy, addressed time Hopkins outplayed the Garnet eleven.<br />\nEarly in the game the fight became a punting contest between<br />\nThe host, Lafayette College, ing a coach and a call for candi- the student body at the Assemlost the championship for the first dates will be issued as soon as this bly last Thursday. Dr. Smith, Calkins and Asplundh with Calkins having the edge throughout. In<br />\ntime since 1915, her representa- is done. There is a great deal of who was introduced by Dean La- the first quarter several kicks were exchanged and then Swarthtives being outclassed by athletes good material at the University tane as one of the few men who<br />\nmore threatened the Hopkins goal<br />\nfrom both Rutgers and Bucknell. this year and a winning team came in close contact with the for- PROPOSED TO ADMIT BAND due to a fumble and a pretty forTO VARSITY SEAL<br />\nRutgers won the race with a total should be turned out. With Ow- mer Kaiser and still refused to be<br />\nward pass, Asplundh to White.<br />\nCOUNCIL<br />\nof 42 points, while Bucknell was ings, Bauernschmidt, of the un- hypnotized by him, is a Johns<br />\nWith the ball on their three-yard<br />\nVote of All Varsity Seal Holders<br />\nsecond, with 43; Lafayette third, dergraduate school, and Keye, Hopkins alumnus. He was forline Landy and Totterdale threw<br />\nNecessary.<br />\nwith 45, and Lehigh fourth, with Wilson and Saunders, of the merly the Edgar Allen Poe proGeiger for a ten-yard loss, causfessor<br />\nof<br />\nEnglish<br />\nat<br />\nUniversithe<br />\n80.<br />\nTo<br />\ncomply with the constitu- ing him to fumble. Yarnall recovMedical School, the new coach<br />\nHopkins entered but four men: will have a nucleus to start with ty of Virginia and just prior to the tion of the Student Activities ered. Swarthmore then failed on a<br />\nSommerville, Edwards, Milligan at the beginning of the season, al- Nvar he was the Roosevelt profes- Council it is necessary that each pass and the ball went to Hopand Fenton, Booth having been though the places held by all sor of English at the University of holder of the Varsity Seal now in kins on downs. The Black and<br />\ndeclared ineligible at the last mo- these men last year will be hotly Berlin, a position which gave hini the University give his vote on Blue immediately took the ball<br />\nment. Bob Crawford, of Lafay- contested for by members of last every opportunity of learning the the proposal now before the Coun- nit of danger and the period ended<br />\nette, who barely beat Booth last year's Freshman team, and the attitude of Europeans toward cil, to admit the band to member- with the Black and Blue having<br />\nyear after the latter had suffered new men at the University this American literature.<br />\nship on the Council. Secretary the decided advantage, both on<br />\nThe portrayal of Indian charac- Lipps will, therefore, see such ground gaining and kicking.<br />\na bad tumble, was individual point year.<br />\nwinner. Booth had hoped to get<br />\nThe schedule is not complete ter, the short story, the humor and Varsity Seal wearer to ascertain<br />\nIn the second period the Hopanother chance against Crawford as yet, but in its present form the idealism of American writers his vote, and so it is important kins line was weakened due to<br />\nand although declared ineligible, calls for games with Navy, Get- created the greatest impression on that. these men be. cognizant of Westerman being forced<br />\nout of<br />\nhe entered the race and finished tysburg, Rutgers, Bucknell, Dick- European critics, according to Dr. the details of the band's proposed the game with an injured<br />\nback and<br />\nfirst, falling seven seconds short inson, Swarthmore, Virginia, St. Smith.<br />\nrecognition.<br />\nMagill's ejection for allowing WilThe portrayal of the customs<br />\nof the record for the distance, John's and St. Francis of BrookA committee from the Council lis of Swarthmore to slug him.<br />\nwhich was five and one-quarter lyn. Other teams of this calibre and life of th!:.. American Indian is has carefully surveyed the mat- Nevertheless, Hopkins was ripmiles over a hilly course.<br />\nare also being scheduled and the particularly appealing to foreign- ter, especially as it relates to the ping through the Garnet line for<br />\nSommerville, Deitrick of Rut- management hopes to have sev- ers.<br />\nother musical organizations on gain after gain and forcing Asi<br />\n\"This<br />\nne<br />\nw<br />\nand<br />\noriginal type,\" the campus,and has recommended plundh to kick every time<br />\ngers and Hendrickson of Bucknell eral other attractive games to anSwarthhe said, \"gave America a literary that the following plan be adopt- more<br />\nnounce in the near future.<br />\nContinued on page, 4 col. 2<br />\nhad the ball. Then it was<br />\nstanding in all lands.\" So vividly ed. It is thought by members of that<br />\nSwarthmore scored. The<br />\nhas the American Indian been por- the Council that it will satisfac- Hopkins<br />\nline had held and Astrayed by James Fennimore Coop- torily settle the question of the plundh kicked.<br />\nYarnall was outer especially, that many Eu- band's representation. This plan side at the<br />\ntime and, he tore down<br />\nropeans believe that rural Ameri- as slightly amended and approved the field, falling<br />\non the ball as<br />\ncans still go to church with a rifle by the Student Activities Council Bonner watched<br />\nit roll outside. It<br />\nUSHERS PREPARED TO HANDLE RECORD CROWD. WORK on the shoulder. Cooper and Poe is as follows:<br />\nwas Swarthmore's ball on our<br />\nare probably the most widely read<br />\n1. The Glee Club, the Instru- five-yard line. From there<br />\nON SPECIAL STANDS STARTED. ODDS GIVEN<br />\nGeorges<br />\nof all American writers and so mental Club and the Jazz Band, following<br />\nFOR A ST. JOHN'S VICTORY<br />\nperfect interference,<br />\nwell are Poe's works known that together with other special con- took the<br />\nball over for the only<br />\nProbably the greatest football duced a machine designed to flatone German woman said she cert numbers, shall retain their score of<br />\nthe<br />\ngame.<br />\nfrenzy of years has been worked ten our opponents flatter than<br />\nUp over the coming annual St. they have ever been flattened be- thought that Annabelle Lee was present organization, their presThe second half was played althe greatest American woman.<br />\nent representation on the Student<br />\nJohn's-Hopkins football game. fore.<br />\nmost entirely in midfield, with<br />\nThe American Short Story is a Activities Council and their presNot only is the competition<br />\nHopkins having the better of the<br />\nOne of the local papers picks phrase known all over<br />\nEurope and ent quota of Varsity Seals.<br />\nmarked by the usual traditional the boys from the Severn to<br />\nargument, both in ground gaining<br />\nis probably the only type of lit2. The Undergraduate Orchesrivalry, but for the first time in emerge the winner by a 28-7 score.<br />\nand kicking, except in the final<br />\nerature in which Americans excel!. tra and the Band shall form a sepYears the state championship is at To the mind of anyone who has<br />\nminutes, when Swarthmore let go<br />\nWhile we have not produced great arate organization, each having<br />\nstake. Ever since the defeat of really followed the two teams, this<br />\na powerful offensive which<br />\nnovels or essays, we have many one representative on the Student<br />\nMaryland State by the Annapolis sounds like wild speculation. Such<br />\nweakened as the whistle ended the<br />\nmen who have written short Activities Council, the number of<br />\ncollege, the Hopkins and St. a prediction would serve to indigame.<br />\nstories of the highest type. Speak- Varsity Seals to be awarded each<br />\nJohn's teams, the rooters of the cate that the writer believes that<br />\nFor Hopkins, Calkins and Boning of the short story, Dr. Smith year being decided by the Student<br />\ntwo institutions and the public at the Black and Blue will be as badner<br />\nstarred in the backfield, while<br />\nsaid :<br />\nActivities Council.<br />\nlarge have waited with great ex- ly outclassed as they were against<br />\nthe<br />\nwhole line played their usual<br />\nThe Council hopes that all VarPectancy for the battle of Novem- Georgetown last year, when a 28- \"Washington Irving legendized<br />\nsteady<br />\ngame. Calkins' kicking, esit, Hawthorne allegorized it, Poe sity Seal members will think careber 19.<br />\n7 score resulted.<br />\npecially,<br />\nwas beautiful; one of his<br />\nstandardized it, Bret Harte local- fully about the matter and vote<br />\nBoth teams have made brilliant<br />\nboots<br />\ngoing<br />\nfor 65 yards. For<br />\nThe scribe who arrived at this ized it,<br />\nJoel Chandler Harris folk- for a measure that gives a deservrecords for the season, but had great conclusion would lead<br />\nSwarthmore,<br />\nAsplundh's kicking<br />\none to lorized it and 0. Henry socialized ing student activity adequate recthey not, the past would have believe that St. John's<br />\nkept them always in the running,<br />\nwill score it.\"<br />\nognition.<br />\nbeen a closed affair and victory in four touchdowns against us<br />\nwhile Geiger and Yarnall's dashes<br />\nby<br />\nthe annual clash would have been<br />\nEdgar Allen Poe is looked<br />\nthrough the line and around the<br />\n(rood football and that we stand a<br />\nupon as the founder of the Ameri- SOPHOMORE CLASS APPOINTS PEP ends were<br />\nthe final goal of each.<br />\nhard to stop.<br />\nchance to score a single marker<br />\nCOMMITTEE<br />\nOdds on the game have shifted by an intercepted pass, a break, or can short story. He claimed that<br />\nThe lineup:<br />\nthe previous ways of approaching<br />\nAt a meeting of the Sophomore<br />\nfrom one side to the other. Every<br />\na long run by one of our speedy<br />\na story were wrong and that the Class held last Thursday in the JOHNS HOPKINS<br />\nSWARTHMORE<br />\ngathering place in Maryland for backs.<br />\nwriter should think only of the ef- M. E. Hall, President Callard ap- Middleton<br />\nLE<br />\nthe past few weeks has been a<br />\nJackson<br />\nSt. John's can bring all the fect he desires to produce on the pointed a \"pep\" committee, con- Westerman ....L.T........ Wilcox<br />\nPari-mutuel\" and at each place<br />\nMagill<br />\nL G<br />\nWillis<br />\nthe odds have been different. Each Tickeys, Cashells, Yox's, Browns' reader and make everything he sisting of seven men, whose duty Totterdale (c) C<br />\nCornell<br />\nLandy<br />\nR<br />\nG<br />\nKnauer<br />\nSide seems equally confident. The and Downs' that they can muster writes point to this effect. To for- will be to instill \"pep\" in the Knecht<br />\nR T<br />\nDudley<br />\nup,<br />\nbut<br />\nit<br />\nimprobable<br />\nmost<br />\nis<br />\nthat<br />\neigners<br />\nSophomore<br />\nthese<br />\nClass<br />\nwith<br />\ndeal<br />\nand<br />\nRich<br />\nto<br />\nstories'<br />\nteach<br />\ncasual observer would declare that<br />\nR E<br />\nmore<br />\nOgden<br />\nDarley<br />\nQ B<br />\nGeiges (c)<br />\nabout the United States than do those members of the Freshman<br />\nan \"irresistible force\" was about they will beat 'Hopkins 28-7.<br />\nMarken<br />\nL H<br />\nWhite<br />\nContinued on page 4, col. 3<br />\nto move an \"immovable object.\"<br />\nBonner .. ...R.H.<br />\nBetween now and Saturday pep histories and they are particularYarnall<br />\nCalkins<br />\nF B<br />\nAs lundh<br />\nThere is no doubt that Coach Pat demonstrations will be very much ly well liked because of their<br />\nRowland for Magill. Swarthmore—ShoeSCORE<br />\nBY<br />\nquick<br />\nbeginning and ending.<br />\nPERIODS<br />\nKrebs will bring to Baltimore one in evidence, as a bolster of courmaker for Willis, Baxter for Ogden,<br />\n0 7 0 0-7<br />\nof the best teams ever to repre- age to Van Orman and the eleven, The warm, clean, wholesome Earp for White. Referee—Dr. W. C. Swarthmore<br />\nO'Brien, Central High, Philadelphia. Johns Hopkins..<br />\n0 0 0 0-0<br />\nsent St. John's, but it is also true who, like Pershing, eagerly await American humor is another thing Umpire—F. R. Gillinder, Penns7lvania.<br />\nTouchdowns—Geiges. Goal from<br />\nlinesman—A.<br />\nHead<br />\nTyler,<br />\nPrinceton.<br />\nC.<br />\ntouchdown—Yarnall.<br />\nthat Coach Van Orman has pro- \"Der Tag.\"<br />\nContinued on page 4, col. 2<br />\nSubstitutions:<br />\nTime of periods-10 minutes.<br /><br />\nAll Indications Point to St. Johns<br />\nGame as Closest Battle Ever<br />\nStaged Between the Two Colleges<br /><br />\nJohns Hopkins—Barton for Westerman,<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 15, 1921<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\nFOUNDED 1897.<br /><br />\n$2.50<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br /><br />\nTelephone<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22,<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\nAssociate Editors:<br />\nEDWARD G. HUEY, '22.<br />\nELI F.ANK, JR., '22.<br />\nJunior Editors:<br />\nCHARLES C. MARBURY, '22.<br />\nLAWRENCE B. FENNEMAN, '23.<br />\nJ. BRENTNALL POWELL, '23.<br />\nCRAIG E. TAYLOR, '24.<br />\nJ. HUDSON HUFFARD, '23<br />\nJOSEPH S. LEIPOLD, '24.<br />\nDONALD H. KIRKLEY, '25.<br /><br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN,'23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br /><br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South<br /><br />\nSts., Baltimore, Md.<br /><br />\nBALTIMORE, MD., NOVEMBER 15, 1921<br />\nTHE FUTURE OF THE ASSEMBLIES<br /><br />\nINTERFRATERNITY BOARD<br /><br />\nDR. AARONSON AIDS FOOTBALL<br /><br />\nQUESTIONS PLEDGEES<br /><br />\nSQUAD<br /><br />\nThe Interfraternity Board held<br />\na meeting last Monday for the<br />\npurpose of questioning each of the<br />\nnew pledgees of the respective fraternities in regard to violations of<br />\nthe \"rushing\" agreement. Each<br />\nfraternity brought its pledgees before the board which asked each<br />\none separately whether or not any<br />\nviolations had been committed to<br />\nhis knowledge. All of those questioned declared that they knew<br />\nAlnothing of any violation.<br />\npledgees<br />\nof<br />\nthe<br />\nwere<br />\nthough a few<br />\nabsent, it is believed that when<br />\nthese appear at the next meeting<br />\nof the board on Monday their answer will show that the agreement<br />\nhas been kept by all parties.<br />\nAt the same meeting of the<br />\nboard the averages for each fraternity were handed in for the<br />\npurpose of ascertaining the frat<br />\nwhich will receive the cup to be<br />\npresented for highest scholastic<br />\nstanding. Announcement of the<br />\nwinner will be made shortly.<br /><br />\nThe lighting effect on Straus'<br />\nField for the after-dark practices<br />\nhas been greatly improved by the<br />\naddition of two arc lights on the<br />\nwest side of the field. The necessity for these lights has long been<br />\nfelt, but the \"powers that he\" at<br />\nHopkins had delayed installing<br />\nthis necessary illumination because of the expense involved.<br />\nAn old Hopkins alumnus in the<br />\nperson of Dr. M. W. Aaronson,<br />\n1706 Eutaw Place, came to the<br />\nrescue and offered to defray the<br />\nexpenses of the installation of the<br />\nlights. His offer was accepted and<br />\nthe improvement, which is very<br />\nnoticeable, has excited the gratitude of the entire squad.<br /><br />\nTeachers!<br />\nUY or rent Corona<br />\nB<br />\ntypewriter on easy<br />\npayments. Carry it to<br />\na<br /><br />\nschool every day in its<br />\nneat case. Make extra<br />\nmoney writing articles or<br />\ndoing typing for others!<br />\nCalltoday at the nearest<br />\nCorona store—or telephone for a demonstration at your home.<br />\nM. W. LUCY &amp; CO.<br />\n118 W. Fayette St.<br />\nWeighs GM lbs.<br />\nFolds and fits<br />\nin a neat carrying case.<br />\nSRA with<br />\ngow case<br /><br />\nCoRONA<br />\nThe Personal Writing Machine<br /><br />\nOur -prep- room on the<br />\nthird floor specializes in<br /><br />\nASSISTANT DIRECTOR OF HOSPITAL APPOINTED<br /><br />\nThe selection of Dr. Alphonso Smith as the speaker at the last<br />\nThe appointment of Dr. Walter<br />\nAssembly was a most fortunate one. Dr. Smith is an excellent J. Craig to the position of assistspeaker and his talk was instructive, interesting and, what is most ant director of the Johns Hopkins<br />\nessential, short.<br />\nHospital has been announced by<br />\nDr. Winford Smith, director of the<br />\nThe Student Assemblies, as we understand them, are primarily<br />\nhospital. Dr. Craig will succeed<br />\nfor the development of student life and spirit, and they have been Dr. Karl Van Norman, who remost successful in this direction. Long-winded, monotonous speeches signed some time ago.<br />\nby boring speakers will destroy this spirit and cut the attendance.<br />\nDr. Craig is a native of Albany,<br />\nAt the same time, meetings devoted entirely to student announce- N. Y. He is a graduate of the Yale<br />\nMedical School, 1920 class.<br />\nments, if too frequent, would become equally tiresome.<br /><br />\nclothes for young men.<br /><br />\niRe<br /><br />\nHub<br /><br />\nBaltimore. Charles and Fayette<br /><br />\nThe future of the Assemblies lies in obtaining interesting speakers, like Dr. Smith, who are capable of holding their audience and<br />\nknow when to stop.<br /><br />\nSOFT PEDAL,THERE!<br />\nTowards the close of this week there will be inaugurated by Hopkins men a series of parades, bonfires, stunts, etc., by which the participants will endeavor to inform the city of Baltimore—and St.<br />\nJohn's—that there is a Hopkins-St. John's game at Homewood Saturday.<br />\n\"Pep\" is the watchword;\"pep\" is desired. With this \"pep\", however, should be mingled a certain amount of moderation, of selfrestraint. It should be remembered at all times that the parade and<br />\nbonfire are Hopkins activities, the participants Hopkins men, and that<br />\nthe University will be judged by our actions on these occasions.<br /><br />\nMURAD<br />\nTHE TURKISH CIGARETTE<br /><br />\nDO YOU REMEMBER?<br />\nDo you remember the lump in your throat when the first regiment entrained for France? Do you remember the thrill of victory<br />\nwhen that regiment came marching home to the tune of martial<br />\nbands, to the plaudits of cheering throngs? Perhaps you joined step<br />\nwith them. Perhaps you too had been across. At any rate, you saw<br />\nand welcomed them.<br />\nBut, do you remember those who could not keep step with the<br />\nmarching hundreds, those who rode in motor cars—because somewhere on a foreign battlefield wounds were received which made it<br />\nimpossible for the heroes, though stout of heart, to join that triumphant procession?<br />\nAnd do you remember the files of marching women who came<br />\nhome after the Armistice was signed, the brave, heroic ones, who in<br />\nfield and base hospitals nursed back to life wounded ones of the<br />\nArgonne, of Verdun, and of Chateau Thierry ?<br />\nIf you do remember you cannot forget that it is YOUR duty<br />\nNOW to think first of those who formed the first line of defense. It<br />\nyour privilege to see that those men who could not march, who<br />\ncan not even now be fitted into the old vocations, be made strong<br />\nenough to work once more and be trained into new pursuits. It is<br />\nalso your privilege to keep intact the army of nurses that the recovery<br />\nof the disabled men may be as rapid as possible.<br />\nThe American Red Cross is helping point the way to this readjustment of the lives of the wounded soldiers, sailors and marines.<br />\nThe Fifth Annual Roll Call—November 11 to 24—is the means by<br />\nwhich you can help. The membership fee is $1. Your subscription is<br />\nneeded.—From the \"Trinity Tripod.\"<br /><br />\nzci<br />\n—r=1.1<br /><br />\nII..<br />\nGIGNWENT<br />\nISRICISII.<br />\n‘4<br />\nESPECAM.1:4 FaR<br /><br />\n..<br />\n-...<br />\nS<br /><br />\nEXPER1ENC waseei<br />\nARE'MADE<br />\ni<br />\nMSCRWMAAIttAG MAD<br />\nADE<br />\n1-11GIA Gcl<br />\nlei%<br />\nOF<br />\nCIGARECTES--StADKER<br />\n1)14105ti<br />\n\"V<br /><br />\n1.S<br />\n/<br />\n1..1,<br />\n-- ,11\"<br />\n\"Me:blendln. / ipoy<br />\nacatkow,<br />\nis<br /><br />\n• Every day MURADS are held<br />\nhigher in the estimation of the men<br />\nwho smoke them.<br />\nThey are the standard of Taste.<br />\nThey never disappoint—never<br />\nfail—never change—<br />\nThey are 100% pure Turkish tobacco—ofthe finest varieties grown.<br />\nYou are proud to smoke them<br />\nin any company—on any occasion.<br />\nThey are the largest selling highgrade cigarette in the world.<br />\nThe cigarette smokers ofAmerica<br />\nDO prefer Quality to Quantity.<br />\n\"Judge for Yourself—!\"<br /><br />\n20<br /><br />\nvefi<br /><br />\nl<br /><br />\nMalesehe<br />\nandEoluin<br /><br />\n,<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 15, 1921<br />\nDRAMATIC CLUB REHEARSING<br />\nONE-ACT PLAYS<br /><br />\nThe three one-act plays to be<br />\nproduced by the Dramatic Club<br />\nearly in December are now under<br />\nrehearsal. The casts which were<br />\nannounced in a former issue of the<br />\nNews-Letter are<br />\nparticularly<br />\neager to make these plays a success, as upon their success or failure depends their collegiate dramatic future.<br />\nGilson Engel, president of the<br />\nDramatic Club, has appointed Eli<br />\nFrank, Jr., chairman of the committee in charge of the plays. He<br />\nwill be assisted by Henry West,<br />\nWho will coach Philip Moeller's<br />\nPlay, \"A Roadhouse in Arden,\"<br />\nand \"Joe\" Moran, who will coach<br />\nhis own play. Moran has yet to<br />\nchoose the cast for his play, but<br />\nhe intends to do this shortly.<br />\nFrank will coach the tragedy,\"A<br />\nDeath in Fever Flat\" himself.<br />\nThe scenery will be designed<br />\nUnder the direction of Mariano<br />\nBacilli°. The plays are especially<br />\nwell adapted to being produced<br />\nin the Bohemian atmosphere the<br />\nclub has created in their studio.<br />\nThe style of the scenery will be<br />\nmodern.<br /><br />\nORTMAN'S<br /><br />\nNOON-DAY BIBLE CLASSES START<br /><br />\nThe first fleeting of the Bible<br />\nClass held last Wednesday was<br />\n\"Queen Quality\" Home Made<br />\nattended by a fairly large crowd.<br />\nChocolates<br />\nFrom the opening remarks of the<br />\nVISIT OUR ICE CREAM PARLORS<br />\n518 N. CHARLES ST.<br />\nleader, the Rev. F. C. Reynolds,<br />\nYoung Men's Clothing<br />\nthe course promises to be interesting. He selected as the subject<br />\nand Furnishings<br />\nfor the course a study of the book<br />\nof Genesis in the light of modern Are made a special feature of<br />\nCharles and 22nd Sts.<br />\nscience and invention, with parDelicious Sodas and Sundaes<br />\nhere.<br />\nticular stress upon its relation to<br />\nThe Best of Candies<br />\nour modern moral and social life.<br />\nPrompt &amp; Efficient Service<br />\nGive us a call and let us become<br />\nDr. Reynolds expressed a wish<br />\nbetter acquainted for mutual<br />\nthat the discussions be informal<br />\nbenefit.<br />\nand that everyone feel free to ask<br />\nany questions regarding religious<br />\nST. PAUL &amp; 24th STS.<br />\nlife. Consequently, it is planned<br />\nC. D. Wolfe, Prop.<br />\nto make the meetings in the naCannection W tin Jam.UcCrters &amp; Co..Nein roa,<br />\nDELICIOUS SODAS &amp; SUNDAES<br />\nture of an \"open forum.\" Every<br />\nMade With<br />\nHoward at Lexington<br />\nstudent will find it well worth<br />\nJersey Special Ice Cream<br />\nwhile to attend this class which<br />\n\"The Velvet Finish\"<br />\nmeets every Wednesday during<br />\nKODAKS CAMERAS SUPPLIES<br />\nthe noon hour in room 110, M. E.<br />\nWhitman's<br /><br />\nChelsea Pharmacy<br /><br />\nThe College Drug Store<br /><br />\nSIEWART8CO.<br /><br />\n3<br />\nMt. Vernon 4999<br /><br />\nW.L. Mann<br />\nCommercial Photography<br />\nCircuit Photography<br />\nFlash Lights<br />\nViews<br />\nGroups<br />\nEnlargements<br />\nKODAK FINISHING<br />\n325 N. Howard St.<br /><br />\nR.G. by &amp; Company<br />\n1 W. University Parkway<br />\nOpposite J. H. U. Athletic Field<br /><br />\nDRUG STORE for J. H. U. BOYS<br />\nPHONE, HOMEWOOD 2121<br /><br />\nBuy an (H) Pipe made special<br />\nfor the Boys<br /><br />\nChocolates and Bon Bons<br /><br />\nPREACHERS' CLUB SELECTS<br />\nOFFICERS FOR YEAR<br /><br />\nIn November, 1920, a group of<br />\nFreshmen got together and<br />\nformed an association afterwards<br />\nknown as the \"Preachers' Club.\"<br />\nThey were assisted in their organization by Pierce Hays, then<br />\nY1 M. C. A. secretary. Their primary object in forming the organization was to bring to the attention of the University authorities the need of such courses as<br />\nNew Testament Study and Hebrew, for clerical students and<br />\nministers who could devote a few<br />\nhours a day to this purpose.<br />\nIn the last part of the year it<br />\nWas definitely decided to carry on<br />\nthis organization. A constitution<br />\nWas drawn up and adopted. According to this constitution, the<br />\nPurpose of the club is to promote<br />\nfriendship and to interest all students in religious life work.<br />\nMeetings are to be held every<br />\nsecond and last Monday of each<br />\nmonth. If possible, a prominent<br />\nSpeaker will be secured for the<br />\nfirst meeting of each month. The<br />\nsecond meeting will be given over<br />\nto discussion of the talk of the previous week.<br />\nThe officers for this year are:<br />\nPresident, Paul Stevens; vicepresident, Kendig Wallace; secretary, Paul Silvester ; treasurer,<br />\nWheeler.<br />\nA meeting will be held this<br />\nMonday night. The Rev. Dr. William S. Hammond will give a talk<br />\nOn \"John Wesley and His Place<br />\nAmong the Great Christians.\"<br /><br />\nJ. H. U. BRANCH OF A. S. M. E.<br />\nMEETS<br /><br />\nThe Johns Hopkins Student<br />\n13ranch of the American Society<br />\nof Mechanical Engineers held a<br />\nbusiness meeting at 12.30 P. M.<br />\nNovember 9.<br />\nThe question of purchasing a<br />\ndie from which membership pins<br />\nWould be made for succeeding as<br />\nWell as present, members of this<br />\n°rganization was discussed and<br />\nthe plan adopted.<br />\nArrangements are now under<br />\nWay to secure several speakers,<br />\nWho have had practical engineering experience, to address this society branch during the coming<br />\nYear.<br /><br />\nShallenberger's Meter-1888<br /><br />\nSingle-Phase Meter-1921<br /><br />\nOliver B.Shallenberger<br />\nT IS ONE THING to produce a new idea<br />\nI that is simply of theoretical interest. It is<br />\nanother to make the new idea into a commercial success.<br /><br />\nI<br /><br />\nThis is the story of Oliver B. Shallenberger,<br />\nand how in 1888 he discovered the principle<br />\nthat led him to invent the watt-hour meter,<br />\nthe familiar little device that makes practicable<br />\nthe commercial distribution of alternating current, which means 95% of all the electricity<br />\nthat is distributed.<br />\nShallenberger, who resigned a Naval commission to take up his work with Westinghouse,<br />\nmade his discovery while experimenting with<br />\na newly devised alternating current arc lamp.<br />\nHis attention was attracted by the behavior of<br />\na small spring which had fallen upon the main<br />\nmagnet of the lamp, into such a position that<br />\nthe forces proceeding from both the magnet<br />\ncoil and the extended soft iron core affected it.<br />\nAnd the simple little thing that he noticed was<br />\nmerely that the spring was slowly rotating! But<br />\nto the intelligently curious observer, that was<br />\n• enough.<br />\nFurther experiments having satisfied him that<br />\nthe action was caused by alternating electric<br /><br />\ncurrents, he set to work, encouraged by his<br />\nknowledge of Westinghouse policies, to make<br />\npractical the newly found principle. Three weeks<br />\nof almost uninterrupted toil, and he had produced the first practical alternating current<br />\nmeter of the induction type—the universal type<br />\nof the present time.<br />\nThus for the first time the measurement of the<br />\nquantity of alternating current passing through<br />\na line was made commercially practicable and<br />\nits distribution became possible from an economic<br />\nas well as an engineering point of view. In fact,<br />\nthe whole structure of our great power systems<br />\ndepends upon the accurate measurement, by<br />\nmillions of such meters, of the electricity used<br />\nin the homes and industries of the nation. So<br />\nwell was Shallenberger's work done, and so<br />\ncomplete was his conception of the possibilities<br />\nof his discovery, that for more than thirty years<br />\nhis fundamental idea has been in use in many<br />\nand various forms.<br />\nThe encouragement which Westinghouse has<br />\nalways given to new ideas, and the judgment<br />\nwith which they have been evaluated, are<br />\nnowhere better exemplified than in this story of<br />\nthe alternating current meter.<br /><br />\nTHE JOHNS HOPKINS NEWS-LET TER, NOVEMBER 15, 1921<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br /><br />\nFRESHMEN SHOW IMPROVEMENT<br />\nIN SCRIMMAGE WITH POLY<br /><br />\nSOPHOMORE CLASS APPOINTS<br />\nPEP COMMI1 TEE<br /><br />\nThe Home of<br /><br />\n(THE BOOK MART)<br /><br />\nContinued from page 1, col. 4<br />\nAfter the trouncing received at<br />\nSaturday<br />\nlast<br />\nSevern<br />\nhands<br />\nof<br />\nthe<br />\nClass who insist upcil dbcying<br />\nComplete Stock of<br />\nMedical Books and College<br />\nthe Freshman football team set- regulations. The President told<br />\nRequisites<br />\ntled down to a week of hard work. the class that every Sophomore<br />\nCoach \"Herb\" Armstrong attrib- was a member of this commitImporters and Dealers in Fine Books<br />\nuted his charges' defeat to the fact tee and urged that they should<br />\n301 N. CHARLES ST.<br />\nthat they had had no practice in not let the entire burden of the<br />\nBaltimore, Md.<br />\ndefensive work.<br />\nwork rest upon the seven chosen<br />\nPoly was brought to Home- men.<br />\nwood last Monday for a hard<br />\nThe class was told not to use<br />\nscrimmage and great improve- any of the methods objected to<br />\nment was shown by the Freshmen, —when the Dean is around. The<br />\nboth on the offensive and defen- nomination of the Sophomores to<br />\nsive. On several occasions the fill vacancies on the Hullabaloo<br />\nfirst-year men piled through the Staff was postponed until the next<br />\nCtibeXatterie) Poly line for great gains and at meeting.<br />\n4tIZS H.&amp; OSCAR G.1011.<br />\nother times their own line was<br />\nEvery Sophomore who sees a<br />\nOWNERS<br />\npractically impregnable.<br />\nFreshman disobeying regulations<br />\n0ir\"414<br />\n'1741)E*1<br />\n-Wednesday's downpour pre- is urged to turn the name of said<br />\n29 Baltimore St., East<br />\nvented a strenuous practice, but Freshman and his offense or ofOne Door West of Light St.<br />\nstiff workouts were indulged in fenses into P. 0. Box 347.<br />\nSOLE AGENTS FOR BALTIMORE<br />\non Thursday and Friday. It is<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\nhoped that several more games<br />\nSIGMA CHI BETA<br />\nwill be scheduled before the close<br />\nThe Chas. Willms Surgical<br />\nThe Sigma Chi Beta Honorary<br />\nof the season.<br />\nInstrument Co.<br />\nFraternity which recently gave a<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nMEN'S SHOES<br />\nG. E. PLUMB TO ADDRESS SOCIAL very successful and commendable<br />\nSURGICAL INSTRUMENTS<br />\nLIBERTY ST. at SARATOGA<br />\nSCIENCE CLUB<br />\nOf the Better Class<br />\nMicroscopes and Supplies,<br />\n(Opposite Hotel Rennert)<br />\nafter-game dance is an honorary<br />\nStethoscopes<br />\nThe Social Science Club anBlood Lancets<br />\nBlood Counters<br />\nLUNCHEON—:—DINNER<br />\nnounces that Mr. Glenn E. Plumb, fraternity composed entirely of<br />\n11:30 until 7:30<br />\nof the Plumb Plan League, is to uppperclassmen, chosen from the<br />\nBANQUETS<br />\nSMOKERS<br />\nDANCES<br />\nlecture on Wednesday, November several fraternities on the campus<br />\nURNER BROTHERS<br />\nPrinters of Philological and<br />\nBy Arrangement<br />\n16, at 4.15 P. M., in the C. E. because of their positions as lead111 E. BALTIMORE STREET<br />\nScientific Works<br />\nBALTIMORE<br />\nTelephone St. Paul 6987<br />\nBuilding. The lecture is to be on ers in<br />\n23 S. HANOVER ST.<br />\nsome of the activities or in<br />\nBaltimore, Md.<br />\n\"Industrial<br />\nDemocracy.\" Mr.<br />\nathletics. Its object is to promote<br />\nPlumb will be remembered as the<br />\nDo you know how best to provide<br />\nORDERS RECEIVED FOR<br />\nauthor of the Plumb Plan of op- social relations and to bring about<br />\nan income for your old age?<br />\nCOGGINS'<br />\neration when the question of re- closer fellowship among the variConsult with<br />\nturning the railroads to private ous fraternities. Its president is Transfer and Baggage Express<br />\nW. W. WALKER<br />\nowners arose.<br />\nAUTOMOBILE SERVICE<br />\nWilliam G. Totterdale, and its<br />\n909 Calvert Bldg. St. Paul 2581<br />\nsecretary, Norvell E. Miller, Jr. PHONE, HOMEWOOD 2645-W<br />\nCROSS COUNTRY TEAM ENTERS<br />\nThe fraternity is formulating<br />\nINITIAL MEET<br />\nContinued from page I<br />\nplans for future social events<br />\nstaged a battle for ninth place,<br />\nwhich as yet cannot be announced.<br />\n\"Summy\" finally winning out.<br /><br />\nThe Overcoat<br /><br />\nYouthful novelty o'coats, with<br />\nstylish raglan shoulders, roomy<br />\narmholes, of soft, warm materials<br />\nUnmatchable values!<br />\n$35 and up<br /><br />\nCLOTHES<br /><br />\n211-213 E. Baltimore St.<br /><br />\nURNER'S<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br /><br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br /><br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS<br /><br />\nHess Shoes<br /><br />\nAT §7)JOENS<br /><br />\nSummary:<br />\nCrawford, Lafayette, 37.34; Powell,<br />\nRutgers, 38.07; Robbins, Rutgers,<br />\n38.30; Jones, Bucknell, 38.34; Schmidt,<br />\nBucknell, 38.43; Tracey, Lafayette,<br />\n39.29; Harper, Lafayette, 39.29; Davis, Bucknell, 39.38; Sommerville, Johns<br />\nHopkins, 39.42; Deitrick, Rutgers,<br />\n39.42; Hendrickson, Bucknell, 39.42;<br />\nKemper, Lafayette, 39.53; Erb, Lehigh,<br />\n39.55; Lanning, Rutgers, 39.56; Romoser, Lehigh, 40.24; Marr, Rutgers,<br />\n40.40; Sizerman, Bucknell, 40.42; Wagner, Bucknell, 40.43; Edwards, Johns<br />\nHopkins,( 41.47; Sigmund, Lehigh,<br />\n41.45; Wright, Rutgers, 41.46; J. Gerlack, Lehigh, 41.58; Porter, Lehigh,<br />\n42.02; Underwood, Lehigh, 42.04; Milligan, Johns Hopkins, 42.08; Hevner,<br />\n3ucknell, 42.30.<br />\nTeam scores:<br />\nRutgers .... 2 3 9 13 15-42<br />\nBucknell ... 4 5 8 10 16-43<br />\nLafayette .. 1 6 7 11 20-45<br />\nLehigh . .. 12 14 17 18 19-80<br /><br />\ntmosphere—<br />\nThe subtle something that<br />\nmakes your college different<br />\nfrom any other, and dearer<br />\nto you,than all the rest combined. In cigarettes, it's the<br />\nsignal success that makes so<br />\nmanycollege men ofdiscrimination prefer Melachrino,<br />\nthe one cigarette sold the<br />\nworld over.<br /><br />\nDR. ALPHONSO SMITH ADDRESSES<br />\nSTUDENT ASSEMBLY<br />\nContinued from page 1, col. 3<br /><br />\nthat appeals to Europeans. From<br />\nthe time of Benjamin Franklin<br />\nTeach a Lesson in Style<br />\ndown to 0. Henry there has alThey possess the \"dash\" that<br />\nways been some great humorist<br />\nappeals to college men, toned<br />\nin<br />\nthe United States. One of the<br />\ndown to distinctiveness. And<br />\nwearing qualities that provoke<br />\nbest examples of this is seen in a<br />\nenthusiasm.<br />\nstory about a German editor who<br />\nN. HESS' SONS<br />\nwas preparing Mark Twain's<br />\nworks<br />\nfor Gcrthan use. The<br />\n8 E. BALTIMORE ST.<br />\nphrase—low—quartered shoes is<br />\nused in Huckleberry Finn and the<br />\nGerman editor, thinking this a<br />\nmisprint, devoted a half page footnote to his explanation. Low-waMADE TO ORDER<br />\nter was the term which was inAND<br />\ntended, he said, for what could be<br />\nmore natural for people living on<br />\nFINISHED CLOTHES<br />\nthe Mississippi River to use high<br />\nPLAZA BUILDING<br />\nwater shoes in time of flood and<br />\nlow water shoes in normal times.<br />\n19 and 21 EAST FAYETTE ST.<br />\nMark Twain, although he had a<br />\nchance<br />\nto do it, allowed this to<br />\nSHOES<br />\npass for sheer delight of humor.<br />\nfir<br />\nThe last great thing that charUNIVERSITY MEN<br />\nacterizes American literature is its<br />\nFor Sport Wear idealism and better still, by LaFor Dress<br />\nnier's poem on the Havershams.<br />\nSmart Styles—Best Leathers<br />\nThe former poem represents a<br />\nModerate Prices<br />\nselfish and the latter an unselfis..<br />\nidealism which Dr. Smith believes<br />\nbetter represents the American<br />\nspirit.<br />\n19 W. LEXINGTON ST.<br /><br />\nVer,<br />\n.<br /><br />\n\"<br /><br />\nLEMMERT<br /><br />\nWYMAN<br /><br />\n5<br /><br />\nZaw'<br /><br />\nRemember that Melachrino is a master<br />\nblend of the finest Turkish Tobaccos<br />\nas originated by Miltiades Melachrino.<br />\nEgyptian cigarettes are simply those<br />\nthat originated in Egypt. But the tobacco is what you want to know about<br />\n—and if it's Melachrino — it's right<br /><br />\nelachrino<br /><br />\n\" The Cigarette Elect of All Nations\"<br /><br />"}], "field_media_file": [{"target_id": 37555, "display": null, "description": null, "target_type": "file", "target_uuid": "f1a83c44-cd35-4f80-8695-7ff1a1cb0e10", "url": "http://digital.library.jhu.edu/system/files/2022-03/12967-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12967, "target_type": "node", "target_uuid": "5fcded06-4953-4294-a093-ae07dbb01c41", "url": "/node/12967"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "ecd02a26-e0e8-417a-a1ee-e54bad2025c7"}]}