{"mid": [{"value": 37521}], "uuid": [{"value": "04a5dbea-4e41-416f-8ec8-1a51b86be3b9"}], "vid": [{"value": 37521}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:34:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13373-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:34:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:34:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "LIDEIMSHMISPEWSEUTER<br />\nVol. XXXII!, No. 47<br />\n<br />\nJAY TWELVE TO MEET<br />\nRANDOLPH-MACON<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., APRIL 26, 1929<br />\n<br />\nCONSOLATION JAY TO<br />\nAPPEAR BY MAY 10<br />\nBy May 10, the next Black<br />\nand Blue Jay will appear on<br />\nthe campus. It will be known<br />\nas the Consolation Number,<br />\nand the'cover design will be<br />\ndone by Quirck. Last copy<br />\nfor the issue was received yesterday. This will be the last<br />\nnumber before the annual June<br />\nWeek -Number, which is the<br />\nlast issue for the year.<br />\n<br />\nBABY-FACED FRESHMAN TRIES<br />\nTO QUALIFY AS MANHOOD MODEL<br />\n<br />\nPHILOSOPHY FACULTY<br />\nCATALOGUE OUT SOON<br />\nAccording to an announcement made at the Registrar's<br />\noffice today, the catalogue of<br />\nthe Faculty of Philosophy will<br />\nappear for distribution on<br />\nMonday at that office. About<br />\nMay first, the catalogue of the<br />\nCollege of Arts and Sciences<br />\nwill be ready for distribution.<br />\nShortly after that, anyone who<br />\ndesires a catalogue of the<br />\nSchool of Business Administration may obtain one at<br />\nRoom 19, Remsen Hall. It is<br />\nexpected that the college's<br />\nplans for the future undergraduate school will be restated in these catalogues.<br />\n<br />\nHOPKINS TENNIS TEAM<br />\nDEFEATS GETTYSBURG<br />\n<br />\nOE%<br />\n<br />\nACTIVITIES COUNCIL<br />\nADOPTS NEW RULING<br />\n<br />\nfinally stealthily sought the solace of his<br />\nhave<br />\nAdvertisements<br />\nproven their worth. In fact, many ancient Ford, and drove quickly<br />\nPublications, Musical Club, BarnImprovement in Attack Essential<br />\nof them enter into this plot. It down Charles Street. It seemed<br />\nstormers Affected<br />\nto Jays<br />\nseems that a very naive freshman en- amazing to notice the stream of cars,<br />\nDISCUSSED<br />\nSEALS<br />\nVICTORY EXPECTED<br />\ntered Hopkins last fall, bearing the bearing Hopkins' stickers, all bound<br />\nNumber of Awards to<br />\nstigma of having been voted most initfie- same direction. Reaching his<br />\nSoutherners Furnish Only Easy<br />\nBe Limited<br />\nSpot on Schedule<br />\nbeautiful boy in his graduating sec- destination, our hero entered a<br />\nor*...a.ry school class. Now this youth seemingly massive building, into<br />\nFive campus activities are drasRandolph-Macon's lacrosse team<br />\nimmediately began his collegiate which a number of his classmates<br />\ntically affected by a ruling which the<br />\nshould not prove a second stumbling<br />\ncareer by reading \"College Humor.\" were also bound.<br />\nStudent Activities Council passed at<br />\nblock in the path of the Jay outfit<br />\nHe thought it \"uncanny\" to become<br />\nA few minutes later, a door opena meeting last Tuesday. Acting on<br />\nwhen they•meet tomorrow. So far<br />\ninitiated into a fraternity—coeds ed—and ür hero was precipitated<br />\na recommendation originally sugthis year the Virginian team has not<br />\nwere \"irresistible,\" and, of course, into the street.<br />\ngested by Omicron Delta Kappa,<br />\nshowed a very great amount of<br />\nit was \"simply marvelous\" to fall<br />\nhonorary activities fraternity, the<br />\nDon't be alarmed, gentle readers,<br />\npower`and after last Saturday's deasleep in class.<br />\nCouncil agreed to limit the number<br />\n'twas only our four-foot-eleven<br />\nfeat the Jay team should be out to<br />\nAnd then our hero, took a course baby-faced Freshman—who answerof important positions which any<br />\nwin with an added amount of deter'-;<br />\nin .Psycbology—and accordingly ed the following advertisement:<br />\nFirst Official Statement Is<br />\none man may hold in non-athletic<br />\nmination.<br />\nMade by Chairman<br />\ntook.up the Uillegiate fad uf cigaractivities.<br />\n\"Wanted—Model (male) at the<br />\nCome.back Qualities<br />\nhe<br />\nOf<br />\ncourse,<br />\nette<br />\nsmoking.<br />\nAlthough a number of prices for<br />\nLimit Jobs<br />\nMaryland Institute, to pose for porThe defeat at the hands of the<br />\nJune Week have appeared, the first' searched far and wide for that trait of 'Manhood,' daily, 1-4 P. M.,'<br />\nThe positions affected are the EdCadet team was a very great disap- and only authentic<br />\nand<br />\ncarload\"<br />\nthe<br />\nin<br />\nsecond<br />\nstatement on the \"cough<br />\nitor-in-Chief and Business ManaMay 6-24. Fifty cenfs per hour.\"<br />\npoitment to Jay fans and has caused question has just<br />\nbeen released by he \"reached for sweets\" instead of<br />\ngerships of the NEws-LErrta, Hulindeed<br />\nwas<br />\nhero<br />\nour<br />\nIncidentally<br />\na feeling of apprehensiveness be- Chairman John<br />\nEldridge. He is waiting for \"satisfaction.\" But—<br />\nlabaloo, Black and Blue Jay and the<br />\nsurprised to notice among the cancause of the showing made by the particularly<br />\nTakes Seventh Straight Win<br />\nanxious to clear up all Then, desiring to test the slogans<br />\nPresidency of the Musical Club. No<br />\nby 5-2 Score<br />\ndidates for this coveted position a<br />\npreSaturday<br />\ntwelve<br />\nthe<br />\nSt. John's<br />\nuncertainty in this regard, and. of sundry soap manufacturers, he<br />\none man may hold more than one<br />\nwell-known chemistry-laboratory asvious. Tomorrow's game will give wants the student body, both<br />\nOn Tuesday, the Johns Hopkins<br />\nseniors started to beautify his exterior fea- sistant, and an instructor in the hisof the above named positions durHopkins rooters a chance to judge and<br />\ntennis team was victorious in its ing the same year. In addition the<br />\nunderclassmen, to understand tures. After a semester of search<br />\nthe come-back qualities of the 1929 that these figures are official and he gained that original schoolboy tory department—both of whom are<br />\nnoted for their Victorian physiog- match with Gettysburg. Achieving Presidency of the Musical Club and<br />\nsquad; after a defeat by a worthy final, and that all previous state- complexion and was proud of it.<br />\nits seventh straight victory of the Barnstormers may not be held by<br />\nopponent will the green Jay team ments are to be disregarded.<br />\nEntering the Barn, suddenly, one nomies.<br />\nprobably, when this painting re- current season, the Jay netmen de- the same man.<br />\nstage a come-back or will it go down<br />\nday last week, he gazed at the bulThe ruling will, however, not go<br />\nThe price schedule as announced<br />\nthe line? Tomorrow will answer<br />\nletin board and something like this poses in our neighboring Art Mu- feated the Pennsylvanians, 5-2.<br />\ninto effect until June 1, 1929. All<br />\nby Eldridge is as follows:<br />\nupon<br />\ngaze<br />\nto<br />\nable<br />\nbe<br />\nwill<br />\nseum—we<br />\nthat question for Hopkins fans.<br />\nhere's<br />\n\"Whoopee!<br />\nlips,<br />\nescaped his<br />\nHood Wins<br />\nelections for the coming year will<br />\nFor Seniors:<br />\nThe Quakers took the lead when<br />\nmy chance—now I'll be a big shot the features of some Hopkins<br />\nThe game with Army showed a Banquet ticket<br />\nhave been held by that time so that<br />\n$3.00<br />\n\"Bravodaccio.\"<br />\nhe<br />\non the campus.\" Accordingly,<br />\nHood, first man for the visitors, de- officers for 1929-30 will not be afvery great lack of coordination on<br />\n5.Q0<br />\nJune Week ticket<br />\nthe attack, a coordination which has<br />\nfeated Irons in a three set match. fected by this ruling. It will go<br />\nBanquet and June Week<br />\nHopkins Liberals<br />\nnot been lacking in the daily scrimIrons, who lost but one other match into actual operation in the'elections<br />\n5.00 I terfraternity Tennis<br />\nticket<br />\nnuges. The coaching staff has been For Underclassmen:<br />\nPetition Gov. Young this season, found stern opposition next spring.<br />\nTournament Announced<br />\ntoiling all week on the attack and<br />\n15.00 Four men from each fraternity<br />\nA discussion of the Mooney-Bil- in Hood. The Jay racqueter had<br />\nJune Week Ticket<br />\nFavored by 0. D. K.<br />\n'promises to give some results to- For Alumni:<br />\nThe Council has adopted this rulthefilInterfraternity lings case was held at a meeting of difficulty in getting started and could<br />\non<br />\nrepresented<br />\nmorrow.<br />\n12.00<br />\nJune Week ticket<br />\ning in an effort to prevent one man's<br />\nBoard will compose teams to com- the Liberal Club last Monday. Fol- win but three games in the first set.<br />\nSoft Spot<br />\nThe underclassmen and hlumni<br />\nholding a number of important poled<br />\nwas<br />\nwhich<br />\ndiscussion,<br />\nthe<br />\nIt was a well fought and very much<br />\nRandolph-Macon presents thr 'tickets do not include the banquet, pete in a tennis tournament to be lowing<br />\nsitions at the same time ,to the detrionly soft spot on the Jays' 1929 which is an exclusively senior func- sponsored by the board, it was de- by Mr. Teper, a resolution was prOlonged second set that Irons won ment of his scholastic work and the<br />\nschedule; the following three gals tion. No tickets are transferable. cided at the meeting of the board passed. asking for the petitioning of 14-12. This, was to do him little organizations which he heads. For<br />\nwith Rutgers, St. John's, and Maryheld Monday, Four singles and the'governor of California for the good, however, since Hood came some time 0. D. X. has favored<br />\nSenior Ball<br />\nland will, to. put it mildly, be very<br />\nIn case anyone should think that two doubles will always be played, pardon of the two men.<br />\nback and took the third set 6-3. such a step and it is in response to<br />\nstiff. There is little doubt wIr will the prices indicated above are exorthe teams The resolution reads as follows: Hood, who was junior doubles this recommendation that the Counof<br />\nmember<br />\neach<br />\nthat<br />\nso<br />\n-`-win the game—the interesting thing bitant, Eldridge has prepared the<br />\ncil has passed the new provision. In<br />\nWhereas, in the year 1916, champion in Pennsylvania in 1926 order that the measure may receive<br />\nis how much the form of the Jay following itemized account of the ex- must play twice. The object of this<br />\nis to, prevent any sin- Thomas Mooney and Warren K. and who is one of the high ranking official sanction of the organizations<br />\nteam has improved.<br />\npenses involved in the Senior Ball. arrangement<br />\nOnce again the coming game will He feels confident that an investiga- gle star's dominating the play. No Billings were convicted in Califor- players in Philadelphia was deemed involved, the Council has asked that<br />\ngive an opportunity to gauge the rel- tion\" of this list will convince anyone varsitj, men or alumni will be eli- nia of murder on testimony since by the spectators at Tuesday's match each of the five activities affected<br />\nwith<br />\nto<br />\native merits of the St. John's team that the prices asked are really quite gible for the teams.<br />\nshown to have been perjured, and to be the best man to have played amend its Constitution agree<br />\nand the Blue Jay team. Randolph- reasonable, especially in view of the Charles Hoffman drew tigi the<br />\non the Homewood courts this year. the requirements of the new ruling.<br />\nthe<br />\njudge,<br />\nthe<br />\nalthough<br />\nWhereas,<br />\nThe present heads of these activities<br />\nMacon was \"easy-pickings\" for the amount and quality of the entertainGoldberg made the first score for have signified their intention of putschedule of play and presented it prosecuting attorney and the surJohnnies and the score was entirely ment received-1n return.<br />\nto the .board in session yesterday.:1 viving members of the jury have the locals when he defeated Lauer ting such an amendment in their reone-sided des'pite the fact that in the<br />\nThe list follows:<br />\nsecond half most of the St. John's Hall<br />\n$350.00 These Thursday meetings are neces- since expressed their belief in the in straight sets. Although Goldberg spective constitutions.<br />\nVarsity Seals<br />\n350.00 sary in addition to the regular Mon- innocence of the two men, they are has been playing consistently good<br />\n-ccond team was in the contest.<br />\nFavors<br />\nThe matter of indiscriminate dis550.00 day sessions to enable the board.to still in jail;<br />\ntennis throughout the season, t<br />\nCampbell Good<br />\nFood<br />\n250.00 put through its annual rushing<br />\nthe year in tribution of Varsity Seals was again<br />\nThe.gap left by Johnny Lang at Music<br />\nTherefore. Be It Resolved, that was the first match of<br />\ndiscussed at some length. In the<br />\ncenter is becoming to be no longer<br />\nagreement before examinations the Johns Hopkins Liberal Club ex- which he defeated his opponent in<br />\npast the Council has frequently<br />\n$1500.00<br />\na sore spot on the team. in the conTotal<br />\nstraight sets. Following Goldberg's<br />\nclaim the time of the students.<br />\npress its belief in the innocence of<br />\nmade an effort to limit the number<br />\nsiderations of the coaches. Campman for HopIt will be seen that if one hundred<br />\nMooney and Billings and request lead, Helmholtz, third<br />\nof Seals which it gives, to those who<br />\nbell in the. first game of the season seniors bought tickets for June<br />\nsets,<br />\nin<br />\nstraight<br />\nKoch<br />\nGovernor C. C. Young of Califor- kins,,,defeated<br />\nreally deserve the award.'the Counsuffered, to some extent, a lack of ;Week the cost per couple for this Joseph Colvin Gets<br />\ncil agreed that Seals were to be<br />\nnia, in the name of justice to order allowing him only two games.<br />\nexperience, which only actual parti- one affair would be $15.00. AcGeneva<br />\nto<br />\nScholarship<br />\ntheir-immediate release; and<br />\ngiven only to Juniors with three<br />\nWins Singles<br />\ncipation in games will give him: cording to the chairman, \"Where<br />\nJoseph Colvin, a senior, has been<br />\nCaptain Brockman followed suit years of service to their credit, and<br />\nBe It Further Resolved, that a<br />\nHowever, his stickwork and elusive- the money comes from for the rest<br />\nawarded a scholarship by the Stu- copy of this resolution be sent to and took two successive sets from to Seniors. In exceptional cases and<br />\nness is becoming more excellent as of June Week is the worry of the<br />\ndents' International Union, an or- Governor Young.<br />\nAumiller. Warfield completed the upon the recommendation of the acthe season advances. '<br />\ncommittee.\" ganization with headquarters in New<br />\nmatches for the afternoon by tivities heads involved. Seniors who<br />\nsingles<br />\nReduction<br />\nLikewise others of the less expeYork. The scholarship entitles him<br />\nthe<br />\nof<br />\nfrom Burtes in two straight have had only two years of service<br />\nwinning<br />\nconsideration<br />\nrienced of Coach Van Orman's If, after. a<br />\nstudy in Geneva, Switzerland, Margaret Rogers Is<br />\nsets. Tuesday's match was the first to their credit may be give Varsity<br />\nthink the prices to.<br />\nSepto<br />\ncharges are rounding into form. figures, seniors gill<br />\nI5<br />\nJuly<br />\nfrom<br />\nContest<br />\nsummer,<br />\nWinner of<br />\none Warfield played in since April Seals. The Council ha.s taken this<br />\ncan be effected this<br />\nThese- men are expected to show up to steep, ii reduction<br />\ntember 7. The Assembly of the<br />\nMargaret Rogers of Forest Park<br />\nstep in an effort to prevent the<br />\ncurtailing the provisions for en- League of Nations opens during High School is the winner of the 9. Because of illness, Warfield had<br />\nwell in the contest with the Southnot played since the Villanova wholesale awarding of Seals.<br />\nwill, in such case,<br />\nThey<br />\ntertainment.<br />\ngained<br />\nconfidence<br />\nerners, and the<br />\ntime. Study will be under the poster contest conducted by the Jun- match.<br />\nPayment<br />\nto do away with this<br />\nMadariaga of ior Dance Committee. Syllvian Rufrom this struggle should be to great doubtless be willing<br />\nArgument arose as to paying for<br />\nat the direction of Senor de<br />\nbreakfast<br />\nand<br />\nthe<br />\nof<br />\ndoubles<br />\nfavors<br />\none<br />\nwon<br />\nHopkins<br />\nwhich<br />\nthe<br />\nadvantage in the hard games<br />\n2 Oxford University, a member of do and Esther Dowell are winners<br />\nthe Seals. In the past the Council<br />\nSenior Ball and have it stop at the Advisory Committee of the of second and third places, respec- the first going to the victors.<br />\nare to follow.<br />\nand the Activities have shared equalEldridge ex5,<br />\nof<br />\ninstead<br />\nM.,<br />\nA.<br />\ntively. Honorable mention was Summary:<br />\ncom- Union,<br />\nAmong these are Dukehart and<br />\nly in the cost. A proposal was made<br />\nplained. \"The object of the<br />\nHood, Gettysburg, defeated Irons that the activities pay the entire<br />\nNess, prep school stars. Each is<br />\ncarry Earlier in the year Dr. Goodnow given to posters entered by Tom<br />\nto<br />\n\"is<br />\nclear,<br />\nmakes<br />\nhe<br />\nmittee,\"<br />\nMarie<br />\nMedford,<br />\nWarren<br />\nBeck,<br />\nla6-3.<br />\n6-3,<br />\n12-14,<br />\namount. The Council, however, felt<br />\nbecoming at homeS on the college<br />\nsenior class.\" appointed Colvin delegate from<br />\nout the wishes of the<br />\nLuechese, Leona Schroeder, Mar- Goldberg, Johns Hopkins, defeat- that if this were done, the Council<br />\ncrosse field and the strides which<br />\nwill be Johns Hopkins to the Conference<br />\nservice<br />\nBaccalaureate<br />\nCassell,<br />\nCharlotte<br />\nMusgrave,<br />\ngaret<br />\nThe<br />\neach one is making predicts good<br />\ned Lauer 6-3, 6-2.<br />\nwould lose control over the giving<br />\nEpis- on International Relations in New<br />\nand Eleanor Franklin. The prizes<br />\nheld in Emmanuel Protestant<br />\nthings in future contests.<br />\nHelmholtz, Johns Hopkins, de- of Seals.<br />\nCathe- York, held under auspices of the<br />\nand<br />\nRichm?nd<br />\nChurch,<br />\nare five, three, and two dollars, re- feated Koch 6-1, 6-1.<br />\ncopal<br />\nUnion.<br />\nIt was then suggested that the acPractice<br />\n-Streets. The rector, Dr. Hugh<br />\nspectively, to first, second, and third<br />\nThe entire squad has been work- dral<br />\ntivities pay more than 50 per cent<br />\nsermon.<br />\ndeJohns<br />\nHopkins,<br />\nBrockman,<br />\nthe<br />\ndeliver<br />\nwill<br />\nplaces, and complimentary tickets to<br />\ning hard during the past week. The Birckhead,<br />\nof the cost. Action on this measure<br />\ngown, Lanier Memorial Fund<br />\nfeated Aumiller 6-2, 6-2.<br />\nseniors, clad in cap and<br />\neach of the honorable mentions.<br />\nattack, especially, has been showing The<br />\nin<br />\nchoir<br />\nthe<br />\nWarfield, Johns Hopkins, defeat- was delayed until the budget for<br />\nprecede<br />\nwill<br />\nusual,<br />\nwho<br />\nGift<br />\nanyone<br />\nto<br />\nopen<br />\nLarge<br />\nwas<br />\ncontest<br />\nReceives<br />\nThe<br />\nis<br />\nas<br />\nstaff<br />\n4 improvement and the coaching<br />\nnext year is drawn up. Mr. Myers,<br />\nreserved<br />\ned Burtis 6-3, 6-3.<br />\nprocession and occupy seats<br />\nAn anonymous donor bas given wished to compete. The winning<br />\ntreasurer of the Council, contended<br />\nexpects to have a smotth working<br />\nthem.<br />\nadvertising<br />\nin<br />\nused<br />\nbe<br />\nto<br />\nDoubles:<br />\nposter<br />\nis<br />\nfor<br />\nLanier<br />\nthe<br />\nto<br />\ndollars<br />\none thousand<br />\nthat the dollar which the Council<br />\nteam on the field tomorrow.<br />\nJay will Memorial Fund.<br />\nthe Junior \"Hell Party\" at LehHood and Lauer, Gettysburg, deeceives out of the ten dollar<br />\nThe last issue of the Blue<br />\nproThis is especially true, since as<br />\nWeek<br />\n4.<br />\nMay<br />\non<br />\nHal!<br />\nJune<br />\nman's<br />\n6<br />\nfeated Irons and Goldberg, 8-6,<br />\nstudent pays is not salfee<br />\nagain be used as<br />\nThe Library now has a valuable<br />\ndepractice increases, the men are<br />\nbe<br />\nwill<br />\nissue<br />\nBrockman and Gump. Hopkins, cient to meet<br />\nigeszcs.whdn May<br />\ngram. The whole<br />\ncollection of Lanier memorabilia, ' Music will be furnished by Bob<br />\nweek,<br />\nworking noticeably well together.<br />\nthe<br />\nof<br />\nto the activities<br />\nincluding first editions, manuscripts Iula's orchestra. The affair is a defeated Aumiller and Stock 6-0, arise. He proposed to es<br />\ncover.<br />\nThe style of each man is altering to voted<br />\ndistinctive<br />\nwill carry a<br />\ncostume one and the motif is \"Hell.\" 6-1.<br />\ncoisoased CPIS haf 1. COMM<br />\nbooks.<br />\nfit more closely the style of the other and it<br />\nbtst year. and autographed<br />\nThe idea was originated<br />\nmembers M the team.<br />\n<br />\nELDRIDGE ANNOUNCES<br />\nPRICES FOR JUNE WEEK<br />\n<br />\n-<br />\n<br />\nPrice 5 Casts<br />\n<br />\n\fAPRIL<br />\nTHE JOHNS HOPKINS NEWS-LETTER,<br />\n<br />\n2<br />\n<br />\n1101)101011MMERLIBERAL CONFERENCE SEEKS<br />\nLASTING ORGANIZATION<br />\nFOUNDED 1897<br />\n<br />\nSubscription<br />\n<br />\n$2.00<br />\n<br />\nPostoffice in<br />\nEntered as second-class matter December 3, 1909, at the<br />\nBaltimore. Md., under Act of Congress November 3, 1879.<br />\nof Johns<br />\nPublished serni-weekty from October to June by the students<br />\nHopkins University.<br />\nMANAGER,<br />\nBusiness communications should be addressed to the Busirmss<br />\nto the MANAGING<br />\nJohns Hopkins University. All articles should be sent<br />\nIEF.<br />\nEDITOR-IN-CH<br />\nEDITOR; other communications to the<br />\n<br />\n26, 1929<br />\n<br />\nMen who want<br />\n<br />\nAfter the Dance<br />\n<br />\nSummer Work<br />\n<br />\nCommittee Proposed to Represent All Md., D. C. Clubs<br />\nThe Liberal Club Conference<br />\n:which was held here by' the Johns<br />\nHopkins and Goucher liberal clubs<br />\nlast -week has aroused much interest, both pro and con, in the scholastic and political circles of Maryland<br />\nand the District of Columbia.<br />\n<br />\nSee page 131 in the May<br />\n?le<br />\nAmerican 2\\<br />\n<br />\nL. Q. BALFOUR CO<br />\nFTaternit)<br />\nThe pnrpose of the conference<br />\njru.elry. Fate's, N,:e:nes<br />\nUniversity 0100 was to establish some means of uniTelephone<br />\nHOPKINS RINGS<br />\nfying the scattered liberals and lib1109 Fidelity Bldg.<br />\ncolleges of this secthe<br />\nin<br />\nclubs<br />\neral<br />\nEDITORIAL DEPARTMENT<br />\nPhone CAlvert 1564<br />\ntion of the country. There is in exf<br />\nhie<br />\nEditor-in-C<br />\nistence for the purpose a League for IrlIr1r11141191rIll.1191.<br />\nr11 10.11<br />\nGEoack E. BANKS, JR., '29<br />\nIndustrial Democracy, but it was<br />\nEditor<br />\nManaging<br />\nAssistant<br />\n\"<br />\nManaging Edito4felt \"that this is not sufficient as<br />\nGEORGE GUM?, 30<br />\nPHILIP W. Naas, '29<br />\nis a ,national organization and (l<br />\nAssociate Editors<br />\nnot bring the various clubs into suf'$0<br />\nBAIRD,<br />\nS.<br />\nROBERT<br />\nWIL11121 H. Derma, '29<br />\nficient intimacy.\" As a solution to<br />\nColumnist<br />\nthe problem a resolution was passed<br />\nSTEPHEN E. FITZGERALD, '31<br />\nwhich provides for the appointment<br />\nof a committee in which every libBUSINESS DEPARTMENT<br />\nSI:. Paul, Minn.<br />\neral club in Maryland and the DisBusiness Manager<br />\nJune 1, 1927<br />\ntrict of Columbia 'Will be represeni- Larus Se Bro. Co.<br />\nIIARRY 0. SCHLOSS, JR., '29<br />\nVa.<br />\nCiroulAtion Manager<br />\ned. by one • member. This commit- Richmond,<br />\nAdvertising Manager<br />\nGentlemen:<br />\nJ. ROBERT MYERS, '29<br />\ntee will be known as a conference<br />\nAbout five years ago, after trying<br />\nGEORGE M. GLAZIER, '29<br />\nout many different styles of pipes<br />\nAdvertising Staff<br />\ncommittee and will serve as the from<br />\nOffice Staff<br />\nthe Missouri meerschaum to thr<br />\nAlvin H. Blum,-'30<br />\nTheodore A. Fleishman.<br />\nthrough which closer con- genuine meerschaum, including', the<br />\nchannel<br />\n'31<br />\nBurke..<br />\nGus<br />\nRandolph Rothchild. '31<br />\nstyle made popular by<br />\nupside-down<br />\nGeorge S. Robertson, '31<br />\nnections shall be made.<br />\nJohn A. ismieson. '31<br />\nVice-President Dawes, and experiSidney Rafe', '31<br />\nLyle F. Gulley, '30<br />\njust about all the towith<br />\nmenting<br />\nClubs<br />\nNew<br />\n•<br />\n12<br />\nSykes,<br />\nDavid S.<br />\nHenry V. Saunders, '32<br />\nbaccos then on the market except<br />\nFurthermore, the conference Edgeworth,I finally decided that pipeLombard and South Streets,<br />\nserved as a stimulating force for the smoking was not fororme.<br />\nProduced by The Read-Taylor Company,<br />\nFor the last year so I noticed the<br />\nBaltimore, Md.<br />\ndevelopment of old and new liberal boys around the office ,here using<br />\nto the exclusion of all<br />\nEdgeworth<br />\ncamporganizations of the various<br />\nother tobaccos and evidently getting<br />\nuses represented. Connected pri- real pleasure from their pipes.<br />\nIn April of this year I wasin Canada<br />\nmarily with this result were the dison a business trip and decided to take<br />\ncussion groups which were led by another' whirl at pipe-smoking. So I<br />\ngood share of my savings<br />\nchairmen from Princeton. Yale. invested aand<br />\na few' cents additional<br />\nin a pipe<br />\nGeorge Washington, Goucher and for a can of Edgeworth.<br />\n'Prom then on I have been figuraHopkins. Outstanding are St.<br />\ntively kicking myself around the block<br />\nJohn's, Morgan College, and the about once each day when I think of<br />\nA FINAL RECAPITULATION<br />\nthe five lean years I put in trying to<br />\nis<br />\nit<br />\nexwhere<br />\nAmericaii.Univeisity,<br />\nof<br />\nget along without a pipe. However, I<br />\nITH this issue of the NEW -LErtER, the senior membersthe<br />\nthat the clubs will be formed am trying to make up for lost time<br />\npected<br />\non<br />\nlabors<br />\njournalistic<br />\nfrom<br />\nreti<br />\ngraciously<br />\nthe staff<br />\nand am sieteeding quite well. ,W1-*<br />\ntheir collegiate<br />\nbefore the end of the year, •Ac- I<br />\nfailed to try Edgeworth long ago wEl<br />\nHomewood campus ,and dedica the remainder of<br />\ntheir bachelor<br />\ncording to the delegate's from have to go down in history as an<br />\nexistence to the more serious p.siness of acquiring<br />\nquestion. But now that I<br />\nunsolved<br />\n,<br />\nGeorge Washington, the club, which have found<br />\ndegrees.<br />\n/<br />\nit, the years ahead look<br />\njournal<br />\nthis<br />\nof<br />\nwanbeen<br />\nhave<br />\nrin-Chief<br />\nto<br />\nme.<br />\nto<br />\nseemed<br />\nEdi<br />\nformerly<br />\nrosy<br />\noutgoing<br />\nthe<br />\ntime,<br />\nto<br />\nFrom time<br />\nUniversity<br />\nand<br />\nVery truly•yours,<br />\ning, has received the needed Stimhas advocated the following list of campss reforms<br />\nBen Bayer<br />\nacquainted<br />\npolicies. In order that the less diligent readers may be<br />\nulus towards putting it once more<br />\nimpormore<br />\nthe<br />\npresent<br />\nherewith<br />\nwith these Utopian proposals, we<br />\nupon their feet. Plans are being<br />\ntant ones in tabulated form:<br />\nmade for delegates from the Hop1. • An annual panhellenic dance, sponsored by the InterfraterExtra High Grade<br />\nrelakins Liberal Club to be sent to these<br />\nnity Board, to assist in the establishing of more amicable<br />\ncolleges to aid them. in their fountions among the various Greek letter societies at Homewood.<br />\ninexperienced<br />\ndation work.<br />\n2. Complete abolition of the practice of allowing<br />\ns.<br />\ngraduate students to grade the quiz papers of undergraduate<br />\nOpposition<br />\nfor the<br />\n3. The universal support of alumni and undergraduates<br />\nThe plans for the -organization ,•: maIALNALisaiaLa.n.am<br />\nerection of a new cage on the Homewood campus.<br />\nrepresentatives<br />\nliberal clubs are opposed by tit,<br />\n4. The election of Athletic Association Board<br />\nstudent<br />\ndeans of Washington and Western<br />\nby the individual classes rather than by the entire<br />\nbody. .<br />\nMaryland College, but heartily sup-,<br />\nby<br />\nh outlawing of \"mud slinging\" during rushing season<br />\n5.e<br />\nby the • president of St:<br />\nported<br />\nfratervarious<br />\nthe<br />\ncans of a gentlemen's agreement among<br />\nJohn's. Dr. J. F. Williams of<br />\n•<br />\nities.the BarnWashington College said that he was<br />\n6. The occupation of the old Homewood Playshop by staging<br />\nnot aware of any such club being<br />\nstormers Club as a theatre for the rehearsing and<br />\nyear.<br />\nof one act plays during the course of the collegiate<br />\nestablished there. - \"If one should<br />\nthe<br />\nfor<br />\nmethod<br />\ndefinite<br />\n—1. Either the adoption of a clear-cut,<br />\nbe organized,\" Dr. Jones declared. I<br />\ncorn'<br />\ntheir<br />\nelse<br />\nor<br />\nregulations<br />\nfreshman<br />\nenforcement of the<br />\n\"it Would only be organized by per- I<br />\nplete- abolition.<br />\nstudies<br />\n8. Participation in both student activities and academic with<br />\nmission of the faculty or a commit- I<br />\nwithout allowing extra curricular work to interfere<br />\ntee of ,the faculty. I do not think<br />\nscholastic effort. ,. ,<br />\nrather<br />\n9. The election of tam managers by vote of the players<br />\nthat we would countenance<br />\nthan by that of the A. A. Board.<br />\nWestern Maryland<br />\nInter;<br />\n10. The adoption of a three-week rushing season by the<br />\n.<br />\nIn reply t, Dcan Miller', argufraternity Board.<br />\nprements in opposition to a liberal club<br />\n11. An organized effort, sponsored by university students, to<br />\nvent the misrepreSentation of American college life in mobeing formed at West.elittrvlUnd,<br />\ntion pictures and popular magazines.<br />\ntop, Mr.. J. Seidman, chairman (if the<br />\n12. More careful and general use of the' University Calendar<br />\navoid conflicting dates.<br />\nconference program committee, Inc<br />\n13. The abandoning of Gilman Hall Tunnel as an automobile<br />\nto the'absence of the President, Mr.<br />\nspeedwiy.<br />\nCoe, made the following statement<br />\n14. Complete disapproval'of the present tendency towards com----mercialized intercollegiate football.<br />\nin behalf of the Johns Hopkins •Libpresentation<br />\nthe<br />\nfollowing<br />\nIS. A road tour by the Barnstormers<br />\neral Club: \"Dean Miller Of Western<br />\n.<br />\nTheatre.<br />\nLyric<br />\nthe<br />\nat<br />\nplay<br />\nannual<br />\nof their<br />\nMaryland has failed to understand<br />\n16: The establishing of a lost Aid _found bureau for the recovery of articles lost in class,rooms'and on the campus.<br />\nis meant by a liberal' -student.<br />\nwhat<br />\nborthe<br />\nin<br />\nSystem<br />\n17. A more rigid observance of the Honor<br />\nWe mean a student who takes an<br />\nrowing of books from the library reserve shelves.<br />\n18. The naming of the new physics building in honor of Dr.<br />\nintelligent interest in the discussion<br />\nHenry Augustus Rowland, world famous physicist.ad al, of social, economic, and political<br />\nmember of the original Hopkins faculty.<br />\nproblems. He has confused this<br />\n19. Continuance of the traditional interfraternity baseball<br />\ntournament.<br />\nwith the collegiate type of student,<br />\n20. Election of the Editor-in-Chief of the Hullabaloo and the<br />\nthe sort who wears \"wide trousers,<br />\nbusiness managerby the vote of the staff members of the<br />\nemblems, and open shirt fronts.\"<br />\nyear book.<br />\n<br />\nPipe Smoker<br />\nHas a \"Kick\"<br />\nAll His Own<br />\n<br />\nEDITORIAL COMMENT-<br />\n<br />\nerr<br />\n<br />\nKEGIcS<br />\n<br />\n1815-17 North Charles St.<br />\n<br />\nUnique and beautiful jewels and minor decors,<br />\nModerately priced.<br />\nCreators ad importers of antique jewelry, precious<br />\nand semi-precious. stones; and art objects.<br />\n<br />\nCARL SCHON, NC.<br />\n109 W. Saratoga St.<br />\n<br />\nSmart Collegians Are Wearing.<br />\nTHE TRENCH COAT, $12.50<br />\nA lightweight, putty-colored, waterproofed coat that has plenty of<br />\ndash'and swagger. Trimmed with leather buttons'and buckles.<br />\nThe newest thing out<br />\nSecond Floor<br />\n<br />\nSTEWART&CO<br />\n<br />\nTHE GIANT<br />\nPOWER FUEL<br />\n<br />\nESSO<br />\n<br />\nNEW LIFE<br />\nFOR MOTOR<br />\n<br />\n-STANDARD\" MOTOR OIL<br />\nThe Measure of Oil Value<br />\nSTANDARD OIL<br />\n<br />\nCOMPANY OF N.<br />\n<br />\nW<br />\n<br />\nEdgeworth<br />\n<br />\nSmoking Tobacco<br />\n<br />\nGeorge<br />\nPr HE NEWS•LETTER regrets to announce the resignations ofas<br />\nBusiE. Banks, Jr., as Editor-in-Chief: Harry 0. Schloss, Jr.,<br />\nH.<br />\nness Manager; Philip W. Ness, as Managing Editor; Wilmerand<br />\nDriver, as Associate Editor; Leonard B. Nolley, E. Foster Dowell<br />\nAdver<br />\nas<br />\nIrving K. Gordon, as Junior Editors; George M. Glazier,<br />\ntising Manager; and J. Robert Myers, as Circulation Managers.<br />\nof<br />\nThe NEws-LErrEa takes pleasure in announcing the election<br />\nas ManGeorge Gump,'30, as Editor-in-Chief; Robert S. Baird, '30,<br />\nas<br />\naging Editor; Richard G. Hunt, '31, and George H. Dowell. '31,<br />\nAssistant Managing Editors; Gus Burke, '31, as Business Manager;<br />\nAlvin H. Blum,<br />\nGeorge S. Robertson, '31, as Advertising Manager;<br />\nCirculation Man'30, as Office Manager, and Lyle F. Gulley, '30, as<br />\nage:.<br />\n<br />\nMajor Carey of St. John's College takes an entirely different attitude from the two deans.<br />\n\"There was a club of the kind<br />\nhere two or three years ago,\" he<br />\nsaid, \"but it seems to have died out.<br />\nHowever, I should welcome one<br />\nhere. It would be a good thing to<br />\nhave a liberal and a conservative<br />\nclub side by side on the campus.<br />\nHere we should like 11 PIres of<br />\nthought to be discussed.\"<br />\n<br />\nRIDE THE STREET CARS<br />\nTHE MOST ECONOMICAL<br />\nMEANS OF TRANSPORTATION<br />\n<br />\nUNITED RAILWAYS & ELECTRIC cO.<br />\nOF BALTIMORE<br />\n<br />\nr Drink ,<br />\n<br />\nDelicious and Refreshing<br />\n<br />\n17RIT<br />\n<br />\nFAME An<br />\nRIAThl<br />\n<br />\nOF COURSE IT'S NO<br />\nFAIR. PLAYING THE<br />\nPROCTOR AND SPYING<br />\nOUT SUCH A DELICATE<br />\nSITUATION AS THIS.<br />\nBUT THEN, WE'RE<br />\nNO PROCTOR.<br />\nAND WE CAN<br />\nRESIST ANYTHING<br />\nBUT TEMPTATION.<br />\n<br />\nAll of which goes to prove (if<br />\nwe may be excused for saying so)<br />\nthat the pause that refreshes is the<br />\nsancft temptation which millions<br />\never succumbed to. And to these<br />\nsame millions the pause that refreshes has come to mean an icecold Coca.Cola. Its tingling<br />\ndelicioustesteand cool alter-sense'<br />\nof refreshment have proved that<br />\na hole minute is long enough for<br />\na big rest any time.<br />\nThe C.oca•Cola Co.. Atlanta, Ca<br />\n<br />\nYOU CAN'T BEAT THE<br />\nPAUSE THAT REFRESHES<br />\nI -1<br />\n<br />\nPI A ID<br />\n<br />\nGOOD<br />\n<br />\nTO<br />\n<br />\nGET<br />\n<br />\nWHERE<br />\n<br />\nIT_I 5<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 26, 1929<br />\n<br />\n\"Y\" Installs New<br />\nOfficers at Banquet<br />\n<br />\n- THE MAIL BAG<br />\n<br />\nZUG<br />\n<br />\nAt its annual installation of officers last Tuesday night, the following officers and members were preThe Editor of the NEWS-LETTER:<br />\nsented: Edwin Lockard, President;<br />\nDear Sir:<br />\nWilliam Purnell Hall, Jr., R. E.<br />\nNow that the elections for next Romoser, Freshman Work; Walter<br />\nyear's Jay are close at hand, I trust Frey, Jr., Ronald B. Levy, Supper<br />\nthe members of that staff Will bear Club; John Mount,'Llewellyn Stanin mind the praise which that mas- ton, Speaker's Bureau; Kenneth<br />\nter politician, Ghent, so generously Sharretts, Membership; Harold<br />\nbestowed on George Gettemueller at Bloom, Pemberton Johnson, John<br />\nthe Junior Banquet. Though Ghent Stange, Forest Ibsen, Publications;<br />\nand Gettemueller are opposing each John Cockran, Assembly Speaker;<br />\notherIor the job, Mr. Ghent, if he Wendell Gray, Library; Donald<br />\nis honest with himself, will retire Herrera, Conferences; George Dowfrom the competition, for, according ell, Friendly Relations; William Olto his own statements, his opponent sen, Social Committee; M. Spauldgot over half the Hullabaloo ads ing, Graduate Work;.Maurice<br />\nsingle handed, so surely he will be Pearce, Boys' Work.<br />\nable to do wonders on the Jay.<br />\nThe Church Cooperation and<br />\nOf course, Mr. Ghent's motives Dormitory Work departments as<br />\nin speaking for Gettemueller for the xet remain unfilled. The ceremony<br />\nat the Friends Meeting<br />\nHullabaloo job were entirely altru- was held<br />\nistic. He had no idea of eliminat- House. Grafton Hersperger acted<br />\ning Gettermueller from the Jay as toastmaster.<br />\nbusiness managership by having him<br />\nelected to the Hullabaloo. If Ghent<br />\nNEW COUNCIL RULING<br />\nContInued from Page 1, Column 6<br />\nthought his opponent such a splendid salesman and organizer two Varsity Seal Fund with any surplus<br />\nweeks ago, surely he will not change that may be left.<br />\nnow. Politics, I am sure, are beNext Meeting<br />\nAt the next meeting Seals will be<br />\nneath him. I confidently expect him<br />\nJuniors and Seniors.<br />\nto<br />\nawarded<br />\nthat<br />\nbanquet<br />\nto announce at the Jay<br />\nhe has refused the nomination in They will be given out during June<br />\nWeek.<br />\nfavor o his opponent.<br />\nAppropriations for next year will<br />\nyours,<br />\ntruly<br />\nVery<br />\nbe, drawn up next month when all<br />\nPaul W. Spear.<br />\nneW activities officers are elected.<br />\n<br />\nr<br />\n<br />\n$8.50<br />\nBrown Zug-Grain<br />\nors,<br />\n<br />\njoss<br />\n<br />\nA sturdy new shoe for young men with a<br />\ngenerous measure of style. . . and priced to<br />\nfit a Scotchman's purse.<br />\n<br />\n111 E. Baltimore<br />\n<br />\n19 E. Lexington<br />\n<br />\nSAMUEL KIRK & SON, INC.<br />\nFounded<br />\n<br />\n1815<br />\n<br />\n- 421 North Charles St.<br />\n<br />\nBaltimore, Md.<br />\n<br />\nWrist Watches for Men<br />\nGOLD JEWELRY<br />\nDIAMONDS<br />\nSILVERWARE<br />\n<br />\n_<br />\nTYPEWRITERS/.ALL<br />\n<br />\nCORONA<br />\n<br />\nROYAL<br />\n<br />\nMAKES<br />\n<br />\neM. W. LUCY & CO.<br />\n<br />\nHomewood Field<br />\nALL NEW<br />\n<br />\nOpen<br />\n<br />\nUNDERWOOD<br />\n<br />\nG/LLEr & Co.<br />\nsA,p(E- A,s<br />\nREDWOOD WM<br />\n.<br />\nLIGHT<br />\nBALTIMORE, MD.<br />\nTekpAano Calvert 2805<br />\n<br />\nWASHINGTONno.<br />\n<br />\nmyKKKKSHTIWILD114<br />\n<br />\nA<br />\n<br />\n,<br />\nIlk<br />\n<br />\nAt Your Service 24 Hours a Day<br />\n<br />\nJYCayflower<br />\n<br />\nCab Co.<br />\n<br />\nINCORPORATED<br />\n<br />\n1 718 N. Charles Street<br />\n<br />\n20c FIRST HALF-MILE<br />\n10c each additional Half-Mile<br />\nor fraction thereof<br />\nThe above rate applies for I to 4 passengers<br />\n<br />\nCOMPARE!<br />\nStand at<br />\n<br />\nPublications<br />\n<br />\nEvenings<br />\n<br />\nHomewood Field<br />\n<br />\nAT<br />\n<br />\n913 N. Charles<br />\n<br />\nHAMMOND<br />\n<br />\nW<br />\n<br />\nYELLOW CAB STANDS<br />\n<br />\nTelephone CAlvert 5902<br />\n<br />\nOldest and Largest Corona Dealers in State<br />\n<br />\n,<br />\n<br />\nHETHER you have $100 or $100,000 to invest,<br />\nwe are interested in helping you to invest it<br />\nsafely and profitably.<br />\nGILLET 6' COMPANY has helped thousands of individuals, banks, insurance companies and other institutions<br />\nto secure, sound investments for their funds and we will<br />\nbe glad to submit definite recommendations most suitable<br />\nto your own individual requirements.<br />\nThe executives of GILLET Es' COMPANY are men of<br />\nlong experience in the investment field and are capable of<br />\ngiving sound advice on the important question of investing your money satisfactorily.<br />\nWe cordially invite you to visit our offices and discuss<br />\nyour investment problems with us, or, we shall be glad to<br />\nhave one of our representatives call on you at your convenience.<br />\n<br />\nVErnon 4090<br />\n<br />\nPeabor Book Shop<br />\n<br />\n104 WEST FAYETTE STREE'T,<br />\n<br />\n-<br />\n<br />\n$100 or $100,000<br />\n<br />\nMORE POLITICS<br />\n<br />\n.3<br />\n1<br />\n<br />\nLess 10%<br />\n<br />\n35th and St. Paul Street,:<br />\n31st and St. Paul Streets<br />\nSafe and Efficient Service<br />\nNo Charge for Extra Passengers<br />\n<br />\nHOmewood 8040-8041<br />\nYour clothes will always have that neat appearance it you will let us do your<br />\nCLEANING, DYEING, PRESSING AND REPAIRING<br />\n\"One Trial Will Convince You<br />\n<br />\nPARISIAN TAILORING CO.<br />\n346 E. 33Rp STREET<br />\nCorner University Parkway<br />\n<br />\n'PHONE<br />\n<br />\nVERNON 1212<br />\nFOR A<br />\n<br />\nWells: Outline of History, MusD, ($2.$0),<br />\n$1.00.<br />\nWells, H. G.: Ti,.- World of William (Jilt.<br />\nsold ($1.00), $2.75.<br />\n<br />\nYELLOW CAB<br />\n<br />\nThe MAY Co.<br />\nand<br />\n<br />\nGood<br />\n<br />\n4 Modern, Store.,<br />\n<br />\nH SHOPS<br />\n<br />\nG SAND<br />\n<br />\nFor Modern,<br />\nYoung Men,<br />\n<br />\nSTREET<br />\n<br />\n20e EAST B<br />\n(Open Ay<br />\n<br />\nMORE<br />\n<br />\nWhen<br />\n<br />\nBetter Used Cars Are Sold<br />\nWeill Will Sell Them<br />\nHopkins Students have a selection<br />\nof practically all standard<br />\nmakes and models<br />\n$100 to $1,000<br />\n<br />\nTHE NEILL BUICK COMPANY<br />\nNew<br />\n<br />\n1400<br />\nFIgnat,'<br />\n<br />\nSales & Service<br />\n<br />\nTOO West 26th Street<br />\n<br />\n9<br />\no<br />\n<br />\nand<br />\n<br />\nUsed<br />\n<br />\nCar Departments<br />\n<br />\nMount Royal 6' Maryland Avenues<br />\n107 Mount Royal Ave.<br />\n<br />\n, CA thoziAht of Today-The season's styles in neckwear are the key to a man's<br />\ndress ... they give that touch of personal effectiveness.<br />\n\"<br />\n\"The Store of Standard Values<br />\n<br />\nNcPHERSON'S<br />\nEstablished 1862<br />\n11 East BaltimoreStreet<br />\nNOVELTIES<br />\n<br />\nFAVORS<br />\n<br />\nGIFTS<br />\n<br />\nTHE PARTY SHOP<br />\n215 WEST SARATOGA STREET<br />\nAnything for a party or a dance, with 10% discount for<br />\nJ. H. U. Students<br />\nFUEL<br />\nTHE WONDER MOTOR<br />\n<br />\nGoods,<br />\nFor Sweaters, Trench Coats, Slickers, Sporting<br />\nhead<br />\nArmy Uniforms and Supplies, also Aviation Outfits,<br />\nthe<br />\nyour airship and land at<br />\nOUTING SUPPLY CORPORATION<br />\n21<br />\n<br />\nYou Shall<br />\nSOT Pass!<br />\nE--)C<br />\n<br />\nSHOES AND HABERDASHERY FOR LOUNGE.<br />\n<br />\nJ. H. FURST CO.<br />\nTHE NEW.<br />\nHOLLYWOOD SHIRT<br />\n?<br />\nHollywood's latest creation! Bli,<br />\nOrange and Blue are the co ors.<br />\n<br />\n3C<br />\n<br />\n3(<br />\n<br />\nspace without knowing<br />\nNo \"Personality\"i'shall pass this<br />\nto his personal<br />\ntailored<br />\nclothes<br />\nhis<br />\nthat here he can have<br />\ncollege style<br />\nfamous<br />\nrequirements • • • by nationally<br />\nbecause he buys here<br />\nsaving,<br />\nmighty<br />\nauthorities • • • at a<br />\nmiddleman's profits added.<br />\nfrom the Tailor Direct, with no<br />\n<br />\ncivIANNIE (BERG<br />\n\"The Old Boy Himself\"<br />\nNORTH F<br />\n<br />\nMARYLAND<br />\n<br />\n538<br />\n<br />\nPRINTERS OF<br />\n<br />\nPhilological and Scientific<br />\nPublications<br />\n23 S. HANOVER ST.<br />\n<br />\nN. Calvert St.<br />\n<br />\nMen and women who are planning<br />\nto teach in secondary schools or<br />\ncolleges should write or call. We<br />\nhave placed many Hopkins gradsTHE<br />\n<br />\nBALTIMORE TEACHERS'<br />\nAGENCY<br />\n402 3 Title Annex Bldg.<br />\n<br />\nTHE SPORT SHOP<br />\nSPORTING GOODS<br />\nFishing Tackle<br />\n<br />\nFamous'.<br />\n<br />\n11111,sers<br />\n<br />\nMEN<br />\nCLOTHES FOR COLLEGE<br />\n<br />\n4 N. Howard St.<br />\n<br />\noo d<br />\nandFl&r:r<br />\n<br />\nPAINTS and VARNISHES<br />\n<br />\nED IN YOUR TOWN ON DATE GIVEN BELOW.<br />\nYOU ARE CORDIALLY INVITED TO ATTEND<br />\n<br />\nAt<br />\nTEACHERS WAN:UZI<br />\n<br />\nbody<br />\n<br />\nKnown<br />\n<br />\nSPORTS AND CAMPUS USAGE WILL BE EXHIBIT-<br />\n<br />\nBALTIMORE<br />\n<br />\nAVES.<br />\n<br />\nALBERT W. RHINE, INC.<br />\n<br />\n-Nationally<br />\n<br />\nTHE CURRENT STYLES IN c•corak.s. HATS,<br />\n<br />\nNorth Liberty Street<br />\n<br />\nwasact.-<br />\n<br />\nTennis Equipment<br />\nKenneth Allen Golf Clubs<br />\n<br />\n421 33rd St. at Grcenmount<br />\n3122 West North Avenue<br />\n<br />\nSTUDENT BOOK STORE<br />\n1818 E. Monument St.<br />\nToday<br />\nHarry Schien, Rep.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 26, 1929<br />\n<br />\n4<br />\n<br />\nHullabaloo to Hare<br />\n_New Features<br />\n<br />\nDr. _4. Sommerfeld<br />\nExplains Theory<br />\n<br />\nJONES<br />\n<br />\nt,<br />\n<br />\nSPRING CLEARANCE<br />\n<br />\nVol<br />\n<br />\nThe theory of metallic conduction<br />\nReconditioned cAutomobiles<br />\nwas explained by its famous discoye'<br />\nN-,. 1467-Chevrolet Coach '27<br />\n95<br />\nCoup,<br />\nthe<br />\nof<br />\nlsSS4Huc.,00bile<br />\nSommerfeld<br />\nN.<br />\nArnold<br />\nerer. Dr.<br />\nNo. 1460-Chevrolet 1926 Landau... evrolet Sedan<br />\nNC.. 1272<br />\nNo. 1449-Chevrolet 1928 Sedan....<br />\n8Sedan<br />\nTherrolet<br />\nNo. 1451-Chevrolet 1927 Coupe.... 2ito<br />\nUniversity of Munich, in two lec- N 12'2<br />\nNo. 1455-Chevrolet 1927 Coach.:..<br />\n263<br />\n'so-Chevrolet11125 Sedan<br />\nNo. 1468-Chevrolet 1928 Coupe.... 450<br />\n305<br />\ntures before the physics department NN- I•,.214--chevrolet 1927 Coach<br />\nNo. 1326-Chevrolet 1927 Sedan.... 400<br />\n.43-Chevrolet<br />\nN<br />\n1327-Chevrolet 1928 Cabriolet. 525<br />\nNo.<br />\n1r4feil<br />\nof this University on Tuesday and<br />\nNo. 1332-Chevrolet 1927 Coupe.... 375<br />\n115<br />\n.10-4Ford 1926<br />\nNo. 1339-Chevrolet 1928 Coach.- . 445<br />\n3451<br />\n1:•7<br />\nSomDr.<br />\n1387-hevrolet 1928 Coach...'. 465<br />\nweek.<br />\nthis<br />\nof<br />\nNo.<br />\nWednesday<br />\nThis year's book is going to have<br />\nNo. 1430-4'hevrolet 1928 Coach..,. 395<br />\n7<br />\n12<br />\n• 1<br />\n117<br />\nNo. 1368-Chevrolet 1926 Coupe.... 265<br />\n250<br />\nlppet Coach 33<br />\nevrolet 1926 Coetch.... 265<br />\nseveral new leatives about it which merfeld. whose work on this subject No. 1482<br />\n1401-Ch<br />\nNo.<br />\n1415-Chevrolet Touring<br />\nNo. 1358-Chevrolet 1926 Sedan....<br />\n100<br />\nall others, connected<br />\n1402-Chevrolet Touring<br />\nhai'e inot been seen bel'ore in the has dominated<br />\nJohns Hopkins Hullabaloo. A spe- the theory of „metallic conduction<br />\nAsk for the number you want to see<br />\ncial feature section by Ben Kolb has with the quantum idea and devoted<br />\nSoutheast Corner<br />\nbeen worked up and entered into the i his Wednesday lecture to the discusAND McMECHEN STREET<br />\nAVENUE<br />\nMT. ROYAL<br />\nmaterial of the book. It is consid- sion Lof the adaption of wave-me7<br />\nchaniCs.<br />\nered to be of such quality that in the<br />\n<br />\nLast Tuesday the editorial board<br />\nof the Hullabaloo finished checking<br />\nthe copy for the 1929 Hullabaloo<br />\n'and sent it to the publisher. Already<br />\nsome of the proofs had come back<br />\nand had been checked by the board.<br />\n<br />\nTHE<br />\nSON'S<br />\nSHINE<br />\nIs much in :evidence these days; when Hopkin's sons are<br />\nlolling on the campus, around the Barn and where not.<br />\nLook well to your soles—shabby shoes tell their own story.<br />\nNew ones, from $6.50 up, are waiting here for You.<br />\n<br />\nN. HESS' SONS<br />\n8 EAST BALTIMORE ST<br />\n<br />\nCA Reliable Tip<br />\n,ConcerninA<br />\nYOUNG MEN'S SPRING SUITS<br />\nIn the daily race of business and pleasure, a suit from the Hutzler<br />\nYoung Men's Shop will give you a substantial lead right at the start.<br />\n<br />\n.29.50 to $59.50<br />\n$<br />\nTHIRD FLOOR, NORTH BUILDING<br />\n<br />\nHUTZLER 13FOTI[1I<br />\nHoward, Saratoga and Clay Streets<br />\nTekphone CAlvert 1234<br />\n<br />\nfuture, the section of the year book<br />\nis 'expected to expand, and become<br />\nan essential of the Hullabaloo.<br />\nThe layout of the individual pages<br />\nof the various sections has been<br />\nchanged so that the reading matter,<br />\ninterspersed between the multitude<br />\nof photographs. will be easily read<br />\nand will give the pages better centering. The individual ,pictures of<br />\nthe seniors and the write-ups are being arranged with the activities at<br />\nthe foot of the page to give a better<br />\nlooking page, and to improve the<br />\ngeneral appearance of that section.<br />\nThe fraternity section is improved<br />\nby rearrangement of the write-ups<br />\nand by reproducing the pins and<br />\nseals by photographs.<br />\nAnother feature of the book is a<br />\nsection of true-to-life colored pictures of the various places of interest on the campus.<br />\nPhone. VErnon 1860<br />\n-What Ia Impossible to Others Is<br />\nPossible to Us\"<br />\n<br />\nTHE RELIABLE WEAVING CO<br />\n<br />\nMoth Holes. Burns, 'Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nRaltimore. Md.<br />\n<br />\nDr. Sommerfeld has been honored with degrees from the Universities of Gottingen. Berlin. Vienna.<br />\nUpsala, Madrid. Leningrad, and the<br />\nRoyal Society Of London.<br />\n<br />\noil<br />\n<br />\nDi<br />\nA<br />\n<br />\norle<br />\nespe<br />\nness<br />\ntail<br />\nly<br />\nof t<br />\nnexl<br />\n<br />\nYOUR EARNING POWER<br />\n—deserves,protection<br />\nCARL S. LAUSCH,'28<br />\nConnecticut. Mutual Life Insurance. Company<br />\n<br />\n'<br />\nCOMPLETE'<br />\n<br />\n........ .....<br />\n.-D<br />\nV<br />\ncrlie E<br />\nR EAD-<br />\n<br />\nEst.<br />\n<br />\n502 First National Bank Building<br />\n<br />\nPLaza 2581-2 ;<br />\n<br />\npa,<br />\n<br />\nretiz<br />\nask,:<br />\n<br />\nA new range of<br />\nsuit/Jigs especially<br />\nfor college men - -<br />\n<br />\nT AYLOR<br />\nCo.<br />\ntsp.<br />\nArl Dark<br />\n<br />\nnexI<br />\n<br />\nThe<br />\nwill<br />\nThu<br />\n<br />\nTailored to Measure<br />\n<br />\nTW.T.Phi<br />\neagraM1147<br />\ntaboo,<br />\n<br />\nfor<br />\nCon<br />\nIngt<br />\nund<br />\n<br />\n1846<br />\n<br />\n•<br />\n<br />\nFoldizq<br />\n<br />\n1602.1603<br />\n<br />\n5tsdukg<br />\n<br />\n1602 • tic*<br />\n<br />\nthe<br />\nalso<br />\nfor'<br />\nnine<br />\nwell<br />\nmed<br />\n<br />\ns4°<br />\n<br />\n1261<br />\n<br />\nP 5 X<br />\n<br />\n=/•`,<br />\n'SERVICE4<br />\n<br />\nArLIIHES<br />\n<br />\nA<br />\nlily<br />\nD. 1<br />\nStic<br />\nat t<br />\niniti<br />\nthe<br />\nnot<br />\n<br />\n211-213 E. BALTIMORE ST.<br />\n<br />\nProducers of \"The News-Letter\"<br />\n<br />\nhfUrn•Bushw--\"'<br />\n<br />\nhe cAnkle-gashioned(Word<br />\nIt's a safe bet that any man will feel<br />\nbetter dressed and look better dressm-Bligh Oxfords. They're<br />\ned in Nirt—<br />\nAnkle-Fashionecl=no gapping at the<br />\nankle, no slipping at the heel.<br />\nTug<br />\n<br />\nUALITY aHop<br />\nCollar Hug Clothes<br />\nBaltimore aalliberirStmen<br />\n<br />\nThe<br />\nBranigan<br />\nStyle No. 3505<br />\n<br />\nAfter all's said and done,<br />\nthe pleasure you get in<br />\nsmoking is what counts<br />\n<br />\nrep<br />\nlay<br />\n<br />\ntool<br />\n<br />\ndell<br />\n<br />\nNI°<br />\n<br />\nCla<br />\n11<br />\nI he<br />\n<br />\nCAMEL<br />\n<br />\nsin]<br />\nteal<br />\nlilt<br />\n<br />\nyea<br />\ntint<br />\n<br />\nCIGARETTES<br />\n<br />\nren<br />\n,1)1.<br />\n<br />\nc(it<br />\n<br />\nStop Wondering<br />\nWhen the other car shoots<br />\naway out in front, when the<br />\nlight turns green--stop wondering. Make your next<br />\nstop at the AMOCOGAS pump.<br />\n<br />\n(-Cr<br />\n<br />\nfill<br />\ncep<br />\n<br />\nWHY CAMELS ARE THE BETTER CIGARETTE<br />\nCamels are made of the choicest tobaccos grown.<br />\n<br />\nin<br />\n<br />\nThe Camel blend of Domestic and Turkish<br />\ntobaccos has never been equaled.<br />\nCamels are mild and mellow.<br />\nThey do not tire the taste.<br />\nThey leave no cigaretty after-taste.<br />\nCamels have a delightful fragrance that is<br />\npleasing to everyone.<br />\n<br />\nim<br />\nye;<br />\n40,<br />\nOva<br />\nph<br />\nCvi<br />\nop:<br />\nter<br />\nof<br />\n<br />\n6.<br />\n<br />\nce(<br />\n<br />\n.<br />\n<br />\n-<br />\n<br />\n.<br />\n<br />\n\f", "format": "basic_html", "processed": "LIDEIMSHMISPEWSEUTER<br />\nVol. XXXII!, No. 47<br /><br />\nJAY TWELVE TO MEET<br />\nRANDOLPH-MACON<br /><br />\nHOMEWOOD, BALTIMORE, MD., APRIL 26, 1929<br /><br />\nCONSOLATION JAY TO<br />\nAPPEAR BY MAY 10<br />\nBy May 10, the next Black<br />\nand Blue Jay will appear on<br />\nthe campus. It will be known<br />\nas the Consolation Number,<br />\nand the'cover design will be<br />\ndone by Quirck. Last copy<br />\nfor the issue was received yesterday. This will be the last<br />\nnumber before the annual June<br />\nWeek -Number, which is the<br />\nlast issue for the year.<br /><br />\nBABY-FACED FRESHMAN TRIES<br />\nTO QUALIFY AS MANHOOD MODEL<br /><br />\nPHILOSOPHY FACULTY<br />\nCATALOGUE OUT SOON<br />\nAccording to an announcement made at the Registrar's<br />\noffice today, the catalogue of<br />\nthe Faculty of Philosophy will<br />\nappear for distribution on<br />\nMonday at that office. About<br />\nMay first, the catalogue of the<br />\nCollege of Arts and Sciences<br />\nwill be ready for distribution.<br />\nShortly after that, anyone who<br />\ndesires a catalogue of the<br />\nSchool of Business Administration may obtain one at<br />\nRoom 19, Remsen Hall. It is<br />\nexpected that the college's<br />\nplans for the future undergraduate school will be restated in these catalogues.<br /><br />\nHOPKINS TENNIS TEAM<br />\nDEFEATS GETTYSBURG<br /><br />\nOE%<br /><br />\nACTIVITIES COUNCIL<br />\nADOPTS NEW RULING<br /><br />\nfinally stealthily sought the solace of his<br />\nhave<br />\nAdvertisements<br />\nproven their worth. In fact, many ancient Ford, and drove quickly<br />\nPublications, Musical Club, BarnImprovement in Attack Essential<br />\nof them enter into this plot. It down Charles Street. It seemed<br />\nstormers Affected<br />\nto Jays<br />\nseems that a very naive freshman en- amazing to notice the stream of cars,<br />\nDISCUSSED<br />\nSEALS<br />\nVICTORY EXPECTED<br />\ntered Hopkins last fall, bearing the bearing Hopkins' stickers, all bound<br />\nNumber of Awards to<br />\nstigma of having been voted most initfie- same direction. Reaching his<br />\nSoutherners Furnish Only Easy<br />\nBe Limited<br />\nSpot on Schedule<br />\nbeautiful boy in his graduating sec- destination, our hero entered a<br />\nor*...a.ry school class. Now this youth seemingly massive building, into<br />\nFive campus activities are drasRandolph-Macon's lacrosse team<br />\nimmediately began his collegiate which a number of his classmates<br />\ntically affected by a ruling which the<br />\nshould not prove a second stumbling<br />\ncareer by reading \"College Humor.\" were also bound.<br />\nStudent Activities Council passed at<br />\nblock in the path of the Jay outfit<br />\nHe thought it \"uncanny\" to become<br />\nA few minutes later, a door opena meeting last Tuesday. Acting on<br />\nwhen they•meet tomorrow. So far<br />\ninitiated into a fraternity—coeds ed—and ür hero was precipitated<br />\na recommendation originally sugthis year the Virginian team has not<br />\nwere \"irresistible,\" and, of course, into the street.<br />\ngested by Omicron Delta Kappa,<br />\nshowed a very great amount of<br />\nit was \"simply marvelous\" to fall<br />\nhonorary activities fraternity, the<br />\nDon't be alarmed, gentle readers,<br />\npower`and after last Saturday's deasleep in class.<br />\nCouncil agreed to limit the number<br />\n'twas only our four-foot-eleven<br />\nfeat the Jay team should be out to<br />\nAnd then our hero, took a course baby-faced Freshman—who answerof important positions which any<br />\nwin with an added amount of deter'-;<br />\nin .Psycbology—and accordingly ed the following advertisement:<br />\nFirst Official Statement Is<br />\none man may hold in non-athletic<br />\nmination.<br />\nMade by Chairman<br />\ntook.up the Uillegiate fad uf cigaractivities.<br />\n\"Wanted—Model (male) at the<br />\nCome.back Qualities<br />\nhe<br />\nOf<br />\ncourse,<br />\nette<br />\nsmoking.<br />\nAlthough a number of prices for<br />\nLimit Jobs<br />\nMaryland Institute, to pose for porThe defeat at the hands of the<br />\nJune Week have appeared, the first' searched far and wide for that trait of 'Manhood,' daily, 1-4 P. M.,'<br />\nThe positions affected are the EdCadet team was a very great disap- and only authentic<br />\nand<br />\ncarload\"<br />\nthe<br />\nin<br />\nsecond<br />\nstatement on the \"cough<br />\nitor-in-Chief and Business ManaMay 6-24. Fifty cenfs per hour.\"<br />\npoitment to Jay fans and has caused question has just<br />\nbeen released by he \"reached for sweets\" instead of<br />\ngerships of the NEws-LErrta, Hulindeed<br />\nwas<br />\nhero<br />\nour<br />\nIncidentally<br />\na feeling of apprehensiveness be- Chairman John<br />\nEldridge. He is waiting for \"satisfaction.\" But—<br />\nlabaloo, Black and Blue Jay and the<br />\nsurprised to notice among the cancause of the showing made by the particularly<br />\nTakes Seventh Straight Win<br />\nanxious to clear up all Then, desiring to test the slogans<br />\nPresidency of the Musical Club. No<br />\nby 5-2 Score<br />\ndidates for this coveted position a<br />\npreSaturday<br />\ntwelve<br />\nthe<br />\nSt. John's<br />\nuncertainty in this regard, and. of sundry soap manufacturers, he<br />\none man may hold more than one<br />\nwell-known chemistry-laboratory asvious. Tomorrow's game will give wants the student body, both<br />\nOn Tuesday, the Johns Hopkins<br />\nseniors started to beautify his exterior fea- sistant, and an instructor in the hisof the above named positions durHopkins rooters a chance to judge and<br />\ntennis team was victorious in its ing the same year. In addition the<br />\nunderclassmen, to understand tures. After a semester of search<br />\nthe come-back qualities of the 1929 that these figures are official and he gained that original schoolboy tory department—both of whom are<br />\nnoted for their Victorian physiog- match with Gettysburg. Achieving Presidency of the Musical Club and<br />\nsquad; after a defeat by a worthy final, and that all previous state- complexion and was proud of it.<br />\nits seventh straight victory of the Barnstormers may not be held by<br />\nopponent will the green Jay team ments are to be disregarded.<br />\nEntering the Barn, suddenly, one nomies.<br />\nprobably, when this painting re- current season, the Jay netmen de- the same man.<br />\nstage a come-back or will it go down<br />\nday last week, he gazed at the bulThe ruling will, however, not go<br />\nThe price schedule as announced<br />\nthe line? Tomorrow will answer<br />\nletin board and something like this poses in our neighboring Art Mu- feated the Pennsylvanians, 5-2.<br />\ninto effect until June 1, 1929. All<br />\nby Eldridge is as follows:<br />\nupon<br />\ngaze<br />\nto<br />\nable<br />\nbe<br />\nwill<br />\nseum—we<br />\nthat question for Hopkins fans.<br />\nhere's<br />\n\"Whoopee!<br />\nlips,<br />\nescaped his<br />\nHood Wins<br />\nelections for the coming year will<br />\nFor Seniors:<br />\nThe Quakers took the lead when<br />\nmy chance—now I'll be a big shot the features of some Hopkins<br />\nThe game with Army showed a Banquet ticket<br />\nhave been held by that time so that<br />\n$3.00<br />\n\"Bravodaccio.\"<br />\nhe<br />\non the campus.\" Accordingly,<br />\nHood, first man for the visitors, de- officers for 1929-30 will not be afvery great lack of coordination on<br />\n5.Q0<br />\nJune Week ticket<br />\nthe attack, a coordination which has<br />\nfeated Irons in a three set match. fected by this ruling. It will go<br />\nBanquet and June Week<br />\nHopkins Liberals<br />\nnot been lacking in the daily scrimIrons, who lost but one other match into actual operation in the'elections<br />\n5.00 I terfraternity Tennis<br />\nticket<br />\nnuges. The coaching staff has been For Underclassmen:<br />\nPetition Gov. Young this season, found stern opposition next spring.<br />\nTournament Announced<br />\ntoiling all week on the attack and<br />\n15.00 Four men from each fraternity<br />\nA discussion of the Mooney-Bil- in Hood. The Jay racqueter had<br />\nJune Week Ticket<br />\nFavored by 0. D. K.<br />\n'promises to give some results to- For Alumni:<br />\nThe Council has adopted this rulthefilInterfraternity lings case was held at a meeting of difficulty in getting started and could<br />\non<br />\nrepresented<br />\nmorrow.<br />\n12.00<br />\nJune Week ticket<br />\ning in an effort to prevent one man's<br />\nBoard will compose teams to com- the Liberal Club last Monday. Fol- win but three games in the first set.<br />\nSoft Spot<br />\nThe underclassmen and hlumni<br />\nholding a number of important poled<br />\nwas<br />\nwhich<br />\ndiscussion,<br />\nthe<br />\nIt was a well fought and very much<br />\nRandolph-Macon presents thr 'tickets do not include the banquet, pete in a tennis tournament to be lowing<br />\nsitions at the same time ,to the detrionly soft spot on the Jays' 1929 which is an exclusively senior func- sponsored by the board, it was de- by Mr. Teper, a resolution was prOlonged second set that Irons won ment of his scholastic work and the<br />\nschedule; the following three gals tion. No tickets are transferable. cided at the meeting of the board passed. asking for the petitioning of 14-12. This, was to do him little organizations which he heads. For<br />\nwith Rutgers, St. John's, and Maryheld Monday, Four singles and the'governor of California for the good, however, since Hood came some time 0. D. X. has favored<br />\nSenior Ball<br />\nland will, to. put it mildly, be very<br />\nIn case anyone should think that two doubles will always be played, pardon of the two men.<br />\nback and took the third set 6-3. such a step and it is in response to<br />\nstiff. There is little doubt wIr will the prices indicated above are exorthe teams The resolution reads as follows: Hood, who was junior doubles this recommendation that the Counof<br />\nmember<br />\neach<br />\nthat<br />\nso<br />\n-`-win the game—the interesting thing bitant, Eldridge has prepared the<br />\ncil has passed the new provision. In<br />\nWhereas, in the year 1916, champion in Pennsylvania in 1926 order that the measure may receive<br />\nis how much the form of the Jay following itemized account of the ex- must play twice. The object of this<br />\nis to, prevent any sin- Thomas Mooney and Warren K. and who is one of the high ranking official sanction of the organizations<br />\nteam has improved.<br />\npenses involved in the Senior Ball. arrangement<br />\nOnce again the coming game will He feels confident that an investiga- gle star's dominating the play. No Billings were convicted in Califor- players in Philadelphia was deemed involved, the Council has asked that<br />\ngive an opportunity to gauge the rel- tion\" of this list will convince anyone varsitj, men or alumni will be eli- nia of murder on testimony since by the spectators at Tuesday's match each of the five activities affected<br />\nwith<br />\nto<br />\native merits of the St. John's team that the prices asked are really quite gible for the teams.<br />\nshown to have been perjured, and to be the best man to have played amend its Constitution agree<br />\nand the Blue Jay team. Randolph- reasonable, especially in view of the Charles Hoffman drew tigi the<br />\non the Homewood courts this year. the requirements of the new ruling.<br />\nthe<br />\njudge,<br />\nthe<br />\nalthough<br />\nWhereas,<br />\nThe present heads of these activities<br />\nMacon was \"easy-pickings\" for the amount and quality of the entertainGoldberg made the first score for have signified their intention of putschedule of play and presented it prosecuting attorney and the surJohnnies and the score was entirely ment received-1n return.<br />\nto the .board in session yesterday.:1 viving members of the jury have the locals when he defeated Lauer ting such an amendment in their reone-sided des'pite the fact that in the<br />\nThe list follows:<br />\nsecond half most of the St. John's Hall<br />\n$350.00 These Thursday meetings are neces- since expressed their belief in the in straight sets. Although Goldberg spective constitutions.<br />\nVarsity Seals<br />\n350.00 sary in addition to the regular Mon- innocence of the two men, they are has been playing consistently good<br />\n-ccond team was in the contest.<br />\nFavors<br />\nThe matter of indiscriminate dis550.00 day sessions to enable the board.to still in jail;<br />\ntennis throughout the season, t<br />\nCampbell Good<br />\nFood<br />\n250.00 put through its annual rushing<br />\nthe year in tribution of Varsity Seals was again<br />\nThe.gap left by Johnny Lang at Music<br />\nTherefore. Be It Resolved, that was the first match of<br />\ndiscussed at some length. In the<br />\ncenter is becoming to be no longer<br />\nagreement before examinations the Johns Hopkins Liberal Club ex- which he defeated his opponent in<br />\npast the Council has frequently<br />\n$1500.00<br />\na sore spot on the team. in the conTotal<br />\nstraight sets. Following Goldberg's<br />\nclaim the time of the students.<br />\npress its belief in the innocence of<br />\nmade an effort to limit the number<br />\nsiderations of the coaches. Campman for HopIt will be seen that if one hundred<br />\nMooney and Billings and request lead, Helmholtz, third<br />\nof Seals which it gives, to those who<br />\nbell in the. first game of the season seniors bought tickets for June<br />\nsets,<br />\nin<br />\nstraight<br />\nKoch<br />\nGovernor C. C. Young of Califor- kins,,,defeated<br />\nreally deserve the award.'the Counsuffered, to some extent, a lack of ;Week the cost per couple for this Joseph Colvin Gets<br />\ncil agreed that Seals were to be<br />\nnia, in the name of justice to order allowing him only two games.<br />\nexperience, which only actual parti- one affair would be $15.00. AcGeneva<br />\nto<br />\nScholarship<br />\ntheir-immediate release; and<br />\ngiven only to Juniors with three<br />\nWins Singles<br />\ncipation in games will give him: cording to the chairman, \"Where<br />\nJoseph Colvin, a senior, has been<br />\nCaptain Brockman followed suit years of service to their credit, and<br />\nBe It Further Resolved, that a<br />\nHowever, his stickwork and elusive- the money comes from for the rest<br />\nawarded a scholarship by the Stu- copy of this resolution be sent to and took two successive sets from to Seniors. In exceptional cases and<br />\nness is becoming more excellent as of June Week is the worry of the<br />\ndents' International Union, an or- Governor Young.<br />\nAumiller. Warfield completed the upon the recommendation of the acthe season advances. '<br />\ncommittee.\" ganization with headquarters in New<br />\nmatches for the afternoon by tivities heads involved. Seniors who<br />\nsingles<br />\nReduction<br />\nLikewise others of the less expeYork. The scholarship entitles him<br />\nthe<br />\nof<br />\nfrom Burtes in two straight have had only two years of service<br />\nwinning<br />\nconsideration<br />\nrienced of Coach Van Orman's If, after. a<br />\nstudy in Geneva, Switzerland, Margaret Rogers Is<br />\nsets. Tuesday's match was the first to their credit may be give Varsity<br />\nthink the prices to.<br />\nSepto<br />\ncharges are rounding into form. figures, seniors gill<br />\nI5<br />\nJuly<br />\nfrom<br />\nContest<br />\nsummer,<br />\nWinner of<br />\none Warfield played in since April Seals. The Council ha.s taken this<br />\ncan be effected this<br />\nThese- men are expected to show up to steep, ii reduction<br />\ntember 7. The Assembly of the<br />\nMargaret Rogers of Forest Park<br />\nstep in an effort to prevent the<br />\ncurtailing the provisions for en- League of Nations opens during High School is the winner of the 9. Because of illness, Warfield had<br />\nwell in the contest with the Southnot played since the Villanova wholesale awarding of Seals.<br />\nwill, in such case,<br />\nThey<br />\ntertainment.<br />\ngained<br />\nconfidence<br />\nerners, and the<br />\ntime. Study will be under the poster contest conducted by the Jun- match.<br />\nPayment<br />\nto do away with this<br />\nMadariaga of ior Dance Committee. Syllvian Rufrom this struggle should be to great doubtless be willing<br />\nArgument arose as to paying for<br />\nat the direction of Senor de<br />\nbreakfast<br />\nand<br />\nthe<br />\nof<br />\ndoubles<br />\nfavors<br />\none<br />\nwon<br />\nHopkins<br />\nwhich<br />\nthe<br />\nadvantage in the hard games<br />\n2 Oxford University, a member of do and Esther Dowell are winners<br />\nthe Seals. In the past the Council<br />\nSenior Ball and have it stop at the Advisory Committee of the of second and third places, respec- the first going to the victors.<br />\nare to follow.<br />\nand the Activities have shared equalEldridge ex5,<br />\nof<br />\ninstead<br />\nM.,<br />\nA.<br />\ntively. Honorable mention was Summary:<br />\ncom- Union,<br />\nAmong these are Dukehart and<br />\nly in the cost. A proposal was made<br />\nplained. \"The object of the<br />\nHood, Gettysburg, defeated Irons that the activities pay the entire<br />\nNess, prep school stars. Each is<br />\ncarry Earlier in the year Dr. Goodnow given to posters entered by Tom<br />\nto<br />\n\"is<br />\nclear,<br />\nmakes<br />\nhe<br />\nmittee,\"<br />\nMarie<br />\nMedford,<br />\nWarren<br />\nBeck,<br />\nla6-3.<br />\n6-3,<br />\n12-14,<br />\namount. The Council, however, felt<br />\nbecoming at homeS on the college<br />\nsenior class.\" appointed Colvin delegate from<br />\nout the wishes of the<br />\nLuechese, Leona Schroeder, Mar- Goldberg, Johns Hopkins, defeat- that if this were done, the Council<br />\ncrosse field and the strides which<br />\nwill be Johns Hopkins to the Conference<br />\nservice<br />\nBaccalaureate<br />\nCassell,<br />\nCharlotte<br />\nMusgrave,<br />\ngaret<br />\nThe<br />\neach one is making predicts good<br />\ned Lauer 6-3, 6-2.<br />\nwould lose control over the giving<br />\nEpis- on International Relations in New<br />\nand Eleanor Franklin. The prizes<br />\nheld in Emmanuel Protestant<br />\nthings in future contests.<br />\nHelmholtz, Johns Hopkins, de- of Seals.<br />\nCathe- York, held under auspices of the<br />\nand<br />\nRichm?nd<br />\nChurch,<br />\nare five, three, and two dollars, re- feated Koch 6-1, 6-1.<br />\ncopal<br />\nUnion.<br />\nIt was then suggested that the acPractice<br />\n-Streets. The rector, Dr. Hugh<br />\nspectively, to first, second, and third<br />\nThe entire squad has been work- dral<br />\ntivities pay more than 50 per cent<br />\nsermon.<br />\ndeJohns<br />\nHopkins,<br />\nBrockman,<br />\nthe<br />\ndeliver<br />\nwill<br />\nplaces, and complimentary tickets to<br />\ning hard during the past week. The Birckhead,<br />\nof the cost. Action on this measure<br />\ngown, Lanier Memorial Fund<br />\nfeated Aumiller 6-2, 6-2.<br />\nseniors, clad in cap and<br />\neach of the honorable mentions.<br />\nattack, especially, has been showing The<br />\nin<br />\nchoir<br />\nthe<br />\nWarfield, Johns Hopkins, defeat- was delayed until the budget for<br />\nprecede<br />\nwill<br />\nusual,<br />\nwho<br />\nGift<br />\nanyone<br />\nto<br />\nopen<br />\nLarge<br />\nwas<br />\ncontest<br />\nReceives<br />\nThe<br />\nis<br />\nas<br />\nstaff<br />\n4 improvement and the coaching<br />\nnext year is drawn up. Mr. Myers,<br />\nreserved<br />\ned Burtis 6-3, 6-3.<br />\nprocession and occupy seats<br />\nAn anonymous donor bas given wished to compete. The winning<br />\ntreasurer of the Council, contended<br />\nexpects to have a smotth working<br />\nthem.<br />\nadvertising<br />\nin<br />\nused<br />\nbe<br />\nto<br />\nDoubles:<br />\nposter<br />\nis<br />\nfor<br />\nLanier<br />\nthe<br />\nto<br />\ndollars<br />\none thousand<br />\nthat the dollar which the Council<br />\nteam on the field tomorrow.<br />\nJay will Memorial Fund.<br />\nthe Junior \"Hell Party\" at LehHood and Lauer, Gettysburg, deeceives out of the ten dollar<br />\nThe last issue of the Blue<br />\nproThis is especially true, since as<br />\nWeek<br />\n4.<br />\nMay<br />\non<br />\nHal!<br />\nJune<br />\nman's<br />\n6<br />\nfeated Irons and Goldberg, 8-6,<br />\nstudent pays is not salfee<br />\nagain be used as<br />\nThe Library now has a valuable<br />\ndepractice increases, the men are<br />\nbe<br />\nwill<br />\nissue<br />\nBrockman and Gump. Hopkins, cient to meet<br />\nigeszcs.whdn May<br />\ngram. The whole<br />\ncollection of Lanier memorabilia, ' Music will be furnished by Bob<br />\nweek,<br />\nworking noticeably well together.<br />\nthe<br />\nof<br />\nto the activities<br />\nincluding first editions, manuscripts Iula's orchestra. The affair is a defeated Aumiller and Stock 6-0, arise. He proposed to es<br />\ncover.<br />\nThe style of each man is altering to voted<br />\ndistinctive<br />\nwill carry a<br />\ncostume one and the motif is \"Hell.\" 6-1.<br />\ncoisoased CPIS haf 1. COMM<br />\nbooks.<br />\nfit more closely the style of the other and it<br />\nbtst year. and autographed<br />\nThe idea was originated<br />\nmembers M the team.<br /><br />\nELDRIDGE ANNOUNCES<br />\nPRICES FOR JUNE WEEK<br /><br />\n-<br /><br />\nPrice 5 Casts<br /><br />\nAPRIL<br />\nTHE JOHNS HOPKINS NEWS-LETTER,<br /><br />\n2<br /><br />\n1101)101011MMERLIBERAL CONFERENCE SEEKS<br />\nLASTING ORGANIZATION<br />\nFOUNDED 1897<br /><br />\nSubscription<br /><br />\n$2.00<br /><br />\nPostoffice in<br />\nEntered as second-class matter December 3, 1909, at the<br />\nBaltimore. Md., under Act of Congress November 3, 1879.<br />\nof Johns<br />\nPublished serni-weekty from October to June by the students<br />\nHopkins University.<br />\nMANAGER,<br />\nBusiness communications should be addressed to the Busirmss<br />\nto the MANAGING<br />\nJohns Hopkins University. All articles should be sent<br />\nIEF.<br />\nEDITOR-IN-CH<br />\nEDITOR; other communications to the<br /><br />\n26, 1929<br /><br />\nMen who want<br /><br />\nAfter the Dance<br /><br />\nSummer Work<br /><br />\nCommittee Proposed to Represent All Md., D. C. Clubs<br />\nThe Liberal Club Conference<br />\n:which was held here by' the Johns<br />\nHopkins and Goucher liberal clubs<br />\nlast -week has aroused much interest, both pro and con, in the scholastic and political circles of Maryland<br />\nand the District of Columbia.<br /><br />\nSee page 131 in the May<br />\n?le<br />\nAmerican 2\\<br /><br />\nL. Q. BALFOUR CO<br />\nFTaternit)<br />\nThe pnrpose of the conference<br />\njru.elry. Fate's, N,:e:nes<br />\nUniversity 0100 was to establish some means of uniTelephone<br />\nHOPKINS RINGS<br />\nfying the scattered liberals and lib1109 Fidelity Bldg.<br />\ncolleges of this secthe<br />\nin<br />\nclubs<br />\neral<br />\nEDITORIAL DEPARTMENT<br />\nPhone CAlvert 1564<br />\ntion of the country. There is in exf<br />\nhie<br />\nEditor-in-C<br />\nistence for the purpose a League for IrlIr1r11141191rIll.1191.<br />\nr11 10.11<br />\nGEoack E. BANKS, JR., '29<br />\nIndustrial Democracy, but it was<br />\nEditor<br />\nManaging<br />\nAssistant<br />\n\"<br />\nManaging Edito4felt \"that this is not sufficient as<br />\nGEORGE GUM?, 30<br />\nPHILIP W. Naas, '29<br />\nis a ,national organization and (l<br />\nAssociate Editors<br />\nnot bring the various clubs into suf'$0<br />\nBAIRD,<br />\nS.<br />\nROBERT<br />\nWIL11121 H. Derma, '29<br />\nficient intimacy.\" As a solution to<br />\nColumnist<br />\nthe problem a resolution was passed<br />\nSTEPHEN E. FITZGERALD, '31<br />\nwhich provides for the appointment<br />\nof a committee in which every libBUSINESS DEPARTMENT<br />\nSI:. Paul, Minn.<br />\neral club in Maryland and the DisBusiness Manager<br />\nJune 1, 1927<br />\ntrict of Columbia 'Will be represeni- Larus Se Bro. Co.<br />\nIIARRY 0. SCHLOSS, JR., '29<br />\nVa.<br />\nCiroulAtion Manager<br />\ned. by one • member. This commit- Richmond,<br />\nAdvertising Manager<br />\nGentlemen:<br />\nJ. ROBERT MYERS, '29<br />\ntee will be known as a conference<br />\nAbout five years ago, after trying<br />\nGEORGE M. GLAZIER, '29<br />\nout many different styles of pipes<br />\nAdvertising Staff<br />\ncommittee and will serve as the from<br />\nOffice Staff<br />\nthe Missouri meerschaum to thr<br />\nAlvin H. Blum,-'30<br />\nTheodore A. Fleishman.<br />\nthrough which closer con- genuine meerschaum, including', the<br />\nchannel<br />\n'31<br />\nBurke..<br />\nGus<br />\nRandolph Rothchild. '31<br />\nstyle made popular by<br />\nupside-down<br />\nGeorge S. Robertson, '31<br />\nnections shall be made.<br />\nJohn A. ismieson. '31<br />\nVice-President Dawes, and experiSidney Rafe', '31<br />\nLyle F. Gulley, '30<br />\njust about all the towith<br />\nmenting<br />\nClubs<br />\nNew<br />\n•<br />\n12<br />\nSykes,<br />\nDavid S.<br />\nHenry V. Saunders, '32<br />\nbaccos then on the market except<br />\nFurthermore, the conference Edgeworth,I finally decided that pipeLombard and South Streets,<br />\nserved as a stimulating force for the smoking was not fororme.<br />\nProduced by The Read-Taylor Company,<br />\nFor the last year so I noticed the<br />\nBaltimore, Md.<br />\ndevelopment of old and new liberal boys around the office ,here using<br />\nto the exclusion of all<br />\nEdgeworth<br />\ncamporganizations of the various<br />\nother tobaccos and evidently getting<br />\nuses represented. Connected pri- real pleasure from their pipes.<br />\nIn April of this year I wasin Canada<br />\nmarily with this result were the dison a business trip and decided to take<br />\ncussion groups which were led by another' whirl at pipe-smoking. So I<br />\ngood share of my savings<br />\nchairmen from Princeton. Yale. invested aand<br />\na few' cents additional<br />\nin a pipe<br />\nGeorge Washington, Goucher and for a can of Edgeworth.<br />\n'Prom then on I have been figuraHopkins. Outstanding are St.<br />\ntively kicking myself around the block<br />\nJohn's, Morgan College, and the about once each day when I think of<br />\nA FINAL RECAPITULATION<br />\nthe five lean years I put in trying to<br />\nis<br />\nit<br />\nexwhere<br />\nAmericaii.Univeisity,<br />\nof<br />\nget along without a pipe. However, I<br />\nITH this issue of the NEW -LErtER, the senior membersthe<br />\nthat the clubs will be formed am trying to make up for lost time<br />\npected<br />\non<br />\nlabors<br />\njournalistic<br />\nfrom<br />\nreti<br />\ngraciously<br />\nthe staff<br />\nand am sieteeding quite well. ,W1-*<br />\ntheir collegiate<br />\nbefore the end of the year, •Ac- I<br />\nfailed to try Edgeworth long ago wEl<br />\nHomewood campus ,and dedica the remainder of<br />\ntheir bachelor<br />\ncording to the delegate's from have to go down in history as an<br />\nexistence to the more serious p.siness of acquiring<br />\nquestion. But now that I<br />\nunsolved<br />\n,<br />\nGeorge Washington, the club, which have found<br />\ndegrees.<br />\n/<br />\nit, the years ahead look<br />\njournal<br />\nthis<br />\nof<br />\nwanbeen<br />\nhave<br />\nrin-Chief<br />\nto<br />\nme.<br />\nto<br />\nseemed<br />\nEdi<br />\nformerly<br />\nrosy<br />\noutgoing<br />\nthe<br />\ntime,<br />\nto<br />\nFrom time<br />\nUniversity<br />\nand<br />\nVery truly•yours,<br />\ning, has received the needed Stimhas advocated the following list of campss reforms<br />\nBen Bayer<br />\nacquainted<br />\npolicies. In order that the less diligent readers may be<br />\nulus towards putting it once more<br />\nimpormore<br />\nthe<br />\npresent<br />\nherewith<br />\nwith these Utopian proposals, we<br />\nupon their feet. Plans are being<br />\ntant ones in tabulated form:<br />\nmade for delegates from the Hop1. • An annual panhellenic dance, sponsored by the InterfraterExtra High Grade<br />\nrelakins Liberal Club to be sent to these<br />\nnity Board, to assist in the establishing of more amicable<br />\ncolleges to aid them. in their fountions among the various Greek letter societies at Homewood.<br />\ninexperienced<br />\ndation work.<br />\n2. Complete abolition of the practice of allowing<br />\ns.<br />\ngraduate students to grade the quiz papers of undergraduate<br />\nOpposition<br />\nfor the<br />\n3. The universal support of alumni and undergraduates<br />\nThe plans for the -organization ,•: maIALNALisaiaLa.n.am<br />\nerection of a new cage on the Homewood campus.<br />\nrepresentatives<br />\nliberal clubs are opposed by tit,<br />\n4. The election of Athletic Association Board<br />\nstudent<br />\ndeans of Washington and Western<br />\nby the individual classes rather than by the entire<br />\nbody. .<br />\nMaryland College, but heartily sup-,<br />\nby<br />\nh outlawing of \"mud slinging\" during rushing season<br />\n5.e<br />\nby the • president of St:<br />\nported<br />\nfratervarious<br />\nthe<br />\ncans of a gentlemen's agreement among<br />\nJohn's. Dr. J. F. Williams of<br />\n•<br />\nities.the BarnWashington College said that he was<br />\n6. The occupation of the old Homewood Playshop by staging<br />\nnot aware of any such club being<br />\nstormers Club as a theatre for the rehearsing and<br />\nyear.<br />\nof one act plays during the course of the collegiate<br />\nestablished there. - \"If one should<br />\nthe<br />\nfor<br />\nmethod<br />\ndefinite<br />\n—1. Either the adoption of a clear-cut,<br />\nbe organized,\" Dr. Jones declared. I<br />\ncorn'<br />\ntheir<br />\nelse<br />\nor<br />\nregulations<br />\nfreshman<br />\nenforcement of the<br />\n\"it Would only be organized by per- I<br />\nplete- abolition.<br />\nstudies<br />\n8. Participation in both student activities and academic with<br />\nmission of the faculty or a commit- I<br />\nwithout allowing extra curricular work to interfere<br />\ntee of ,the faculty. I do not think<br />\nscholastic effort. ,. ,<br />\nrather<br />\n9. The election of tam managers by vote of the players<br />\nthat we would countenance<br />\nthan by that of the A. A. Board.<br />\nWestern Maryland<br />\nInter;<br />\n10. The adoption of a three-week rushing season by the<br />\n.<br />\nIn reply t, Dcan Miller', argufraternity Board.<br />\nprements in opposition to a liberal club<br />\n11. An organized effort, sponsored by university students, to<br />\nvent the misrepreSentation of American college life in mobeing formed at West.elittrvlUnd,<br />\ntion pictures and popular magazines.<br />\ntop, Mr.. J. Seidman, chairman (if the<br />\n12. More careful and general use of the' University Calendar<br />\navoid conflicting dates.<br />\nconference program committee, Inc<br />\n13. The abandoning of Gilman Hall Tunnel as an automobile<br />\nto the'absence of the President, Mr.<br />\nspeedwiy.<br />\nCoe, made the following statement<br />\n14. Complete disapproval'of the present tendency towards com----mercialized intercollegiate football.<br />\nin behalf of the Johns Hopkins •Libpresentation<br />\nthe<br />\nfollowing<br />\nIS. A road tour by the Barnstormers<br />\neral Club: \"Dean Miller Of Western<br />\n.<br />\nTheatre.<br />\nLyric<br />\nthe<br />\nat<br />\nplay<br />\nannual<br />\nof their<br />\nMaryland has failed to understand<br />\n16: The establishing of a lost Aid _found bureau for the recovery of articles lost in class,rooms'and on the campus.<br />\nis meant by a liberal' -student.<br />\nwhat<br />\nborthe<br />\nin<br />\nSystem<br />\n17. A more rigid observance of the Honor<br />\nWe mean a student who takes an<br />\nrowing of books from the library reserve shelves.<br />\n18. The naming of the new physics building in honor of Dr.<br />\nintelligent interest in the discussion<br />\nHenry Augustus Rowland, world famous physicist.ad al, of social, economic, and political<br />\nmember of the original Hopkins faculty.<br />\nproblems. He has confused this<br />\n19. Continuance of the traditional interfraternity baseball<br />\ntournament.<br />\nwith the collegiate type of student,<br />\n20. Election of the Editor-in-Chief of the Hullabaloo and the<br />\nthe sort who wears \"wide trousers,<br />\nbusiness managerby the vote of the staff members of the<br />\nemblems, and open shirt fronts.\"<br />\nyear book.<br /><br />\nPipe Smoker<br />\nHas a \"Kick\"<br />\nAll His Own<br /><br />\nEDITORIAL COMMENT-<br /><br />\nerr<br /><br />\nKEGIcS<br /><br />\n1815-17 North Charles St.<br /><br />\nUnique and beautiful jewels and minor decors,<br />\nModerately priced.<br />\nCreators ad importers of antique jewelry, precious<br />\nand semi-precious. stones; and art objects.<br /><br />\nCARL SCHON, NC.<br />\n109 W. Saratoga St.<br /><br />\nSmart Collegians Are Wearing.<br />\nTHE TRENCH COAT, $12.50<br />\nA lightweight, putty-colored, waterproofed coat that has plenty of<br />\ndash'and swagger. Trimmed with leather buttons'and buckles.<br />\nThe newest thing out<br />\nSecond Floor<br /><br />\nSTEWART&amp;CO<br /><br />\nTHE GIANT<br />\nPOWER FUEL<br /><br />\nESSO<br /><br />\nNEW LIFE<br />\nFOR MOTOR<br /><br />\n-STANDARD\" MOTOR OIL<br />\nThe Measure of Oil Value<br />\nSTANDARD OIL<br /><br />\nCOMPANY OF N.<br /><br />\nW<br /><br />\nEdgeworth<br /><br />\nSmoking Tobacco<br /><br />\nGeorge<br />\nPr HE NEWS•LETTER regrets to announce the resignations ofas<br />\nBusiE. Banks, Jr., as Editor-in-Chief: Harry 0. Schloss, Jr.,<br />\nH.<br />\nness Manager; Philip W. Ness, as Managing Editor; Wilmerand<br />\nDriver, as Associate Editor; Leonard B. Nolley, E. Foster Dowell<br />\nAdver<br />\nas<br />\nIrving K. Gordon, as Junior Editors; George M. Glazier,<br />\ntising Manager; and J. Robert Myers, as Circulation Managers.<br />\nof<br />\nThe NEws-LErrEa takes pleasure in announcing the election<br />\nas ManGeorge Gump,'30, as Editor-in-Chief; Robert S. Baird, '30,<br />\nas<br />\naging Editor; Richard G. Hunt, '31, and George H. Dowell. '31,<br />\nAssistant Managing Editors; Gus Burke, '31, as Business Manager;<br />\nAlvin H. Blum,<br />\nGeorge S. Robertson, '31, as Advertising Manager;<br />\nCirculation Man'30, as Office Manager, and Lyle F. Gulley, '30, as<br />\nage:.<br /><br />\nMajor Carey of St. John's College takes an entirely different attitude from the two deans.<br />\n\"There was a club of the kind<br />\nhere two or three years ago,\" he<br />\nsaid, \"but it seems to have died out.<br />\nHowever, I should welcome one<br />\nhere. It would be a good thing to<br />\nhave a liberal and a conservative<br />\nclub side by side on the campus.<br />\nHere we should like 11 PIres of<br />\nthought to be discussed.\"<br /><br />\nRIDE THE STREET CARS<br />\nTHE MOST ECONOMICAL<br />\nMEANS OF TRANSPORTATION<br /><br />\nUNITED RAILWAYS &amp; ELECTRIC cO.<br />\nOF BALTIMORE<br /><br />\nr Drink ,<br /><br />\nDelicious and Refreshing<br /><br />\n17RIT<br /><br />\nFAME An<br />\nRIAThl<br /><br />\nOF COURSE IT'S NO<br />\nFAIR. PLAYING THE<br />\nPROCTOR AND SPYING<br />\nOUT SUCH A DELICATE<br />\nSITUATION AS THIS.<br />\nBUT THEN, WE'RE<br />\nNO PROCTOR.<br />\nAND WE CAN<br />\nRESIST ANYTHING<br />\nBUT TEMPTATION.<br /><br />\nAll of which goes to prove (if<br />\nwe may be excused for saying so)<br />\nthat the pause that refreshes is the<br />\nsancft temptation which millions<br />\never succumbed to. And to these<br />\nsame millions the pause that refreshes has come to mean an icecold Coca.Cola. Its tingling<br />\ndelicioustesteand cool alter-sense'<br />\nof refreshment have proved that<br />\na hole minute is long enough for<br />\na big rest any time.<br />\nThe C.oca•Cola Co.. Atlanta, Ca<br /><br />\nYOU CAN'T BEAT THE<br />\nPAUSE THAT REFRESHES<br />\nI -1<br /><br />\nPI A ID<br /><br />\nGOOD<br /><br />\nTO<br /><br />\nGET<br /><br />\nWHERE<br /><br />\nIT_I 5<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 26, 1929<br /><br />\n\"Y\" Installs New<br />\nOfficers at Banquet<br /><br />\n- THE MAIL BAG<br /><br />\nZUG<br /><br />\nAt its annual installation of officers last Tuesday night, the following officers and members were preThe Editor of the NEWS-LETTER:<br />\nsented: Edwin Lockard, President;<br />\nDear Sir:<br />\nWilliam Purnell Hall, Jr., R. E.<br />\nNow that the elections for next Romoser, Freshman Work; Walter<br />\nyear's Jay are close at hand, I trust Frey, Jr., Ronald B. Levy, Supper<br />\nthe members of that staff Will bear Club; John Mount,'Llewellyn Stanin mind the praise which that mas- ton, Speaker's Bureau; Kenneth<br />\nter politician, Ghent, so generously Sharretts, Membership; Harold<br />\nbestowed on George Gettemueller at Bloom, Pemberton Johnson, John<br />\nthe Junior Banquet. Though Ghent Stange, Forest Ibsen, Publications;<br />\nand Gettemueller are opposing each John Cockran, Assembly Speaker;<br />\notherIor the job, Mr. Ghent, if he Wendell Gray, Library; Donald<br />\nis honest with himself, will retire Herrera, Conferences; George Dowfrom the competition, for, according ell, Friendly Relations; William Olto his own statements, his opponent sen, Social Committee; M. Spauldgot over half the Hullabaloo ads ing, Graduate Work;.Maurice<br />\nsingle handed, so surely he will be Pearce, Boys' Work.<br />\nable to do wonders on the Jay.<br />\nThe Church Cooperation and<br />\nOf course, Mr. Ghent's motives Dormitory Work departments as<br />\nin speaking for Gettemueller for the xet remain unfilled. The ceremony<br />\nat the Friends Meeting<br />\nHullabaloo job were entirely altru- was held<br />\nistic. He had no idea of eliminat- House. Grafton Hersperger acted<br />\ning Gettermueller from the Jay as toastmaster.<br />\nbusiness managership by having him<br />\nelected to the Hullabaloo. If Ghent<br />\nNEW COUNCIL RULING<br />\nContInued from Page 1, Column 6<br />\nthought his opponent such a splendid salesman and organizer two Varsity Seal Fund with any surplus<br />\nweeks ago, surely he will not change that may be left.<br />\nnow. Politics, I am sure, are beNext Meeting<br />\nAt the next meeting Seals will be<br />\nneath him. I confidently expect him<br />\nJuniors and Seniors.<br />\nto<br />\nawarded<br />\nthat<br />\nbanquet<br />\nto announce at the Jay<br />\nhe has refused the nomination in They will be given out during June<br />\nWeek.<br />\nfavor o his opponent.<br />\nAppropriations for next year will<br />\nyours,<br />\ntruly<br />\nVery<br />\nbe, drawn up next month when all<br />\nPaul W. Spear.<br />\nneW activities officers are elected.<br /><br />\nr<br /><br />\n$8.50<br />\nBrown Zug-Grain<br />\nors,<br /><br />\njoss<br /><br />\nA sturdy new shoe for young men with a<br />\ngenerous measure of style. . . and priced to<br />\nfit a Scotchman's purse.<br /><br />\n111 E. Baltimore<br /><br />\n19 E. Lexington<br /><br />\nSAMUEL KIRK &amp; SON, INC.<br />\nFounded<br /><br />\n1815<br /><br />\n- 421 North Charles St.<br /><br />\nBaltimore, Md.<br /><br />\nWrist Watches for Men<br />\nGOLD JEWELRY<br />\nDIAMONDS<br />\nSILVERWARE<br /><br />\n_<br />\nTYPEWRITERS/.ALL<br /><br />\nCORONA<br /><br />\nROYAL<br /><br />\nMAKES<br /><br />\neM. W. LUCY &amp; CO.<br /><br />\nHomewood Field<br />\nALL NEW<br /><br />\nOpen<br /><br />\nUNDERWOOD<br /><br />\nG/LLEr &amp; Co.<br />\nsA,p(E- A,s<br />\nREDWOOD WM<br />\n.<br />\nLIGHT<br />\nBALTIMORE, MD.<br />\nTekpAano Calvert 2805<br /><br />\nWASHINGTONno.<br /><br />\nmyKKKKSHTIWILD114<br /><br />\nA<br /><br />\n,<br />\nIlk<br /><br />\nAt Your Service 24 Hours a Day<br /><br />\nJYCayflower<br /><br />\nCab Co.<br /><br />\nINCORPORATED<br /><br />\n1 718 N. Charles Street<br /><br />\n20c FIRST HALF-MILE<br />\n10c each additional Half-Mile<br />\nor fraction thereof<br />\nThe above rate applies for I to 4 passengers<br /><br />\nCOMPARE!<br />\nStand at<br /><br />\nPublications<br /><br />\nEvenings<br /><br />\nHomewood Field<br /><br />\nAT<br /><br />\n913 N. Charles<br /><br />\nHAMMOND<br /><br />\nW<br /><br />\nYELLOW CAB STANDS<br /><br />\nTelephone CAlvert 5902<br /><br />\nOldest and Largest Corona Dealers in State<br /><br />\n,<br /><br />\nHETHER you have $100 or $100,000 to invest,<br />\nwe are interested in helping you to invest it<br />\nsafely and profitably.<br />\nGILLET 6' COMPANY has helped thousands of individuals, banks, insurance companies and other institutions<br />\nto secure, sound investments for their funds and we will<br />\nbe glad to submit definite recommendations most suitable<br />\nto your own individual requirements.<br />\nThe executives of GILLET Es' COMPANY are men of<br />\nlong experience in the investment field and are capable of<br />\ngiving sound advice on the important question of investing your money satisfactorily.<br />\nWe cordially invite you to visit our offices and discuss<br />\nyour investment problems with us, or, we shall be glad to<br />\nhave one of our representatives call on you at your convenience.<br /><br />\nVErnon 4090<br /><br />\nPeabor Book Shop<br /><br />\n104 WEST FAYETTE STREE'T,<br /><br />\n-<br /><br />\n$100 or $100,000<br /><br />\nMORE POLITICS<br /><br />\n.3<br />\n1<br /><br />\nLess 10%<br /><br />\n35th and St. Paul Street,:<br />\n31st and St. Paul Streets<br />\nSafe and Efficient Service<br />\nNo Charge for Extra Passengers<br /><br />\nHOmewood 8040-8041<br />\nYour clothes will always have that neat appearance it you will let us do your<br />\nCLEANING, DYEING, PRESSING AND REPAIRING<br />\n\"One Trial Will Convince You<br /><br />\nPARISIAN TAILORING CO.<br />\n346 E. 33Rp STREET<br />\nCorner University Parkway<br /><br />\n'PHONE<br /><br />\nVERNON 1212<br />\nFOR A<br /><br />\nWells: Outline of History, MusD, ($2.$0),<br />\n$1.00.<br />\nWells, H. G.: Ti,.- World of William (Jilt.<br />\nsold ($1.00), $2.75.<br /><br />\nYELLOW CAB<br /><br />\nThe MAY Co.<br />\nand<br /><br />\nGood<br /><br />\n4 Modern, Store.,<br /><br />\nH SHOPS<br /><br />\nG SAND<br /><br />\nFor Modern,<br />\nYoung Men,<br /><br />\nSTREET<br /><br />\n20e EAST B<br />\n(Open Ay<br /><br />\nMORE<br /><br />\nWhen<br /><br />\nBetter Used Cars Are Sold<br />\nWeill Will Sell Them<br />\nHopkins Students have a selection<br />\nof practically all standard<br />\nmakes and models<br />\n$100 to $1,000<br /><br />\nTHE NEILL BUICK COMPANY<br />\nNew<br /><br />\n1400<br />\nFIgnat,'<br /><br />\nSales &amp; Service<br /><br />\nTOO West 26th Street<br /><br />\n9<br />\no<br /><br />\nand<br /><br />\nUsed<br /><br />\nCar Departments<br /><br />\nMount Royal 6' Maryland Avenues<br />\n107 Mount Royal Ave.<br /><br />\n, CA thoziAht of Today-The season's styles in neckwear are the key to a man's<br />\ndress ... they give that touch of personal effectiveness.<br />\n\"<br />\n\"The Store of Standard Values<br /><br />\nNcPHERSON'S<br />\nEstablished 1862<br />\n11 East BaltimoreStreet<br />\nNOVELTIES<br /><br />\nFAVORS<br /><br />\nGIFTS<br /><br />\nTHE PARTY SHOP<br />\n215 WEST SARATOGA STREET<br />\nAnything for a party or a dance, with 10% discount for<br />\nJ. H. U. Students<br />\nFUEL<br />\nTHE WONDER MOTOR<br /><br />\nGoods,<br />\nFor Sweaters, Trench Coats, Slickers, Sporting<br />\nhead<br />\nArmy Uniforms and Supplies, also Aviation Outfits,<br />\nthe<br />\nyour airship and land at<br />\nOUTING SUPPLY CORPORATION<br />\n21<br /><br />\nYou Shall<br />\nSOT Pass!<br />\nE--)C<br /><br />\nSHOES AND HABERDASHERY FOR LOUNGE.<br /><br />\nJ. H. FURST CO.<br />\nTHE NEW.<br />\nHOLLYWOOD SHIRT<br />\n?<br />\nHollywood's latest creation! Bli,<br />\nOrange and Blue are the co ors.<br /><br />\n3C<br /><br />\n3(<br /><br />\nspace without knowing<br />\nNo \"Personality\"i'shall pass this<br />\nto his personal<br />\ntailored<br />\nclothes<br />\nhis<br />\nthat here he can have<br />\ncollege style<br />\nfamous<br />\nrequirements • • • by nationally<br />\nbecause he buys here<br />\nsaving,<br />\nmighty<br />\nauthorities • • • at a<br />\nmiddleman's profits added.<br />\nfrom the Tailor Direct, with no<br /><br />\ncivIANNIE (BERG<br />\n\"The Old Boy Himself\"<br />\nNORTH F<br /><br />\nMARYLAND<br /><br />\n538<br /><br />\nPRINTERS OF<br /><br />\nPhilological and Scientific<br />\nPublications<br />\n23 S. HANOVER ST.<br /><br />\nN. Calvert St.<br /><br />\nMen and women who are planning<br />\nto teach in secondary schools or<br />\ncolleges should write or call. We<br />\nhave placed many Hopkins gradsTHE<br /><br />\nBALTIMORE TEACHERS'<br />\nAGENCY<br />\n402 3 Title Annex Bldg.<br /><br />\nTHE SPORT SHOP<br />\nSPORTING GOODS<br />\nFishing Tackle<br /><br />\nFamous'.<br /><br />\n11111,sers<br /><br />\nMEN<br />\nCLOTHES FOR COLLEGE<br /><br />\n4 N. Howard St.<br /><br />\noo d<br />\nandFl&amp;r:r<br /><br />\nPAINTS and VARNISHES<br /><br />\nED IN YOUR TOWN ON DATE GIVEN BELOW.<br />\nYOU ARE CORDIALLY INVITED TO ATTEND<br /><br />\nAt<br />\nTEACHERS WAN:UZI<br /><br />\nbody<br /><br />\nKnown<br /><br />\nSPORTS AND CAMPUS USAGE WILL BE EXHIBIT-<br /><br />\nBALTIMORE<br /><br />\nAVES.<br /><br />\nALBERT W. RHINE, INC.<br /><br />\n-Nationally<br /><br />\nTHE CURRENT STYLES IN c•corak.s. HATS,<br /><br />\nNorth Liberty Street<br /><br />\nwasact.-<br /><br />\nTennis Equipment<br />\nKenneth Allen Golf Clubs<br /><br />\n421 33rd St. at Grcenmount<br />\n3122 West North Avenue<br /><br />\nSTUDENT BOOK STORE<br />\n1818 E. Monument St.<br />\nToday<br />\nHarry Schien, Rep.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 26, 1929<br /><br />\n4<br /><br />\nHullabaloo to Hare<br />\n_New Features<br /><br />\nDr. _4. Sommerfeld<br />\nExplains Theory<br /><br />\nJONES<br /><br />\nt,<br /><br />\nSPRING CLEARANCE<br /><br />\nVol<br /><br />\nThe theory of metallic conduction<br />\nReconditioned cAutomobiles<br />\nwas explained by its famous discoye'<br />\nN-,. 1467-Chevrolet Coach '27<br />\n95<br />\nCoup,<br />\nthe<br />\nof<br />\nlsSS4Huc.,00bile<br />\nSommerfeld<br />\nN.<br />\nArnold<br />\nerer. Dr.<br />\nNo. 1460-Chevrolet 1926 Landau... evrolet Sedan<br />\nNC.. 1272<br />\nNo. 1449-Chevrolet 1928 Sedan....<br />\n8Sedan<br />\nTherrolet<br />\nNo. 1451-Chevrolet 1927 Coupe.... 2ito<br />\nUniversity of Munich, in two lec- N 12'2<br />\nNo. 1455-Chevrolet 1927 Coach.:..<br />\n263<br />\n'so-Chevrolet11125 Sedan<br />\nNo. 1468-Chevrolet 1928 Coupe.... 450<br />\n305<br />\ntures before the physics department NN- I•,.214--chevrolet 1927 Coach<br />\nNo. 1326-Chevrolet 1927 Sedan.... 400<br />\n.43-Chevrolet<br />\nN<br />\n1327-Chevrolet 1928 Cabriolet. 525<br />\nNo.<br />\n1r4feil<br />\nof this University on Tuesday and<br />\nNo. 1332-Chevrolet 1927 Coupe.... 375<br />\n115<br />\n.10-4Ford 1926<br />\nNo. 1339-Chevrolet 1928 Coach.- . 445<br />\n3451<br />\n1:•7<br />\nSomDr.<br />\n1387-hevrolet 1928 Coach...'. 465<br />\nweek.<br />\nthis<br />\nof<br />\nNo.<br />\nWednesday<br />\nThis year's book is going to have<br />\nNo. 1430-4'hevrolet 1928 Coach..,. 395<br />\n7<br />\n12<br />\n• 1<br />\n117<br />\nNo. 1368-Chevrolet 1926 Coupe.... 265<br />\n250<br />\nlppet Coach 33<br />\nevrolet 1926 Coetch.... 265<br />\nseveral new leatives about it which merfeld. whose work on this subject No. 1482<br />\n1401-Ch<br />\nNo.<br />\n1415-Chevrolet Touring<br />\nNo. 1358-Chevrolet 1926 Sedan....<br />\n100<br />\nall others, connected<br />\n1402-Chevrolet Touring<br />\nhai'e inot been seen bel'ore in the has dominated<br />\nJohns Hopkins Hullabaloo. A spe- the theory of „metallic conduction<br />\nAsk for the number you want to see<br />\ncial feature section by Ben Kolb has with the quantum idea and devoted<br />\nSoutheast Corner<br />\nbeen worked up and entered into the i his Wednesday lecture to the discusAND McMECHEN STREET<br />\nAVENUE<br />\nMT. ROYAL<br />\nmaterial of the book. It is consid- sion Lof the adaption of wave-me7<br />\nchaniCs.<br />\nered to be of such quality that in the<br /><br />\nLast Tuesday the editorial board<br />\nof the Hullabaloo finished checking<br />\nthe copy for the 1929 Hullabaloo<br />\n'and sent it to the publisher. Already<br />\nsome of the proofs had come back<br />\nand had been checked by the board.<br /><br />\nTHE<br />\nSON'S<br />\nSHINE<br />\nIs much in :evidence these days; when Hopkin's sons are<br />\nlolling on the campus, around the Barn and where not.<br />\nLook well to your soles—shabby shoes tell their own story.<br />\nNew ones, from $6.50 up, are waiting here for You.<br /><br />\nN. HESS' SONS<br />\n8 EAST BALTIMORE ST<br /><br />\nCA Reliable Tip<br />\n,ConcerninA<br />\nYOUNG MEN'S SPRING SUITS<br />\nIn the daily race of business and pleasure, a suit from the Hutzler<br />\nYoung Men's Shop will give you a substantial lead right at the start.<br /><br />\n.29.50 to $59.50<br />\n$<br />\nTHIRD FLOOR, NORTH BUILDING<br /><br />\nHUTZLER 13FOTI[1I<br />\nHoward, Saratoga and Clay Streets<br />\nTekphone CAlvert 1234<br /><br />\nfuture, the section of the year book<br />\nis 'expected to expand, and become<br />\nan essential of the Hullabaloo.<br />\nThe layout of the individual pages<br />\nof the various sections has been<br />\nchanged so that the reading matter,<br />\ninterspersed between the multitude<br />\nof photographs. will be easily read<br />\nand will give the pages better centering. The individual ,pictures of<br />\nthe seniors and the write-ups are being arranged with the activities at<br />\nthe foot of the page to give a better<br />\nlooking page, and to improve the<br />\ngeneral appearance of that section.<br />\nThe fraternity section is improved<br />\nby rearrangement of the write-ups<br />\nand by reproducing the pins and<br />\nseals by photographs.<br />\nAnother feature of the book is a<br />\nsection of true-to-life colored pictures of the various places of interest on the campus.<br />\nPhone. VErnon 1860<br />\n-What Ia Impossible to Others Is<br />\nPossible to Us\"<br /><br />\nTHE RELIABLE WEAVING CO<br /><br />\nMoth Holes. Burns, 'Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nRaltimore. Md.<br /><br />\nDr. Sommerfeld has been honored with degrees from the Universities of Gottingen. Berlin. Vienna.<br />\nUpsala, Madrid. Leningrad, and the<br />\nRoyal Society Of London.<br /><br />\noil<br /><br />\nDi<br />\nA<br /><br />\norle<br />\nespe<br />\nness<br />\ntail<br />\nly<br />\nof t<br />\nnexl<br /><br />\nYOUR EARNING POWER<br />\n—deserves,protection<br />\nCARL S. LAUSCH,'28<br />\nConnecticut. Mutual Life Insurance. Company<br /><br />\n'<br />\nCOMPLETE'<br /><br />\n........ .....<br />\n.-D<br />\nV<br />\ncrlie E<br />\nR EAD-<br /><br />\nEst.<br /><br />\n502 First National Bank Building<br /><br />\nPLaza 2581-2 ;<br /><br />\npa,<br /><br />\nretiz<br />\nask,:<br /><br />\nA new range of<br />\nsuit/Jigs especially<br />\nfor college men - -<br /><br />\nT AYLOR<br />\nCo.<br />\ntsp.<br />\nArl Dark<br /><br />\nnexI<br /><br />\nThe<br />\nwill<br />\nThu<br /><br />\nTailored to Measure<br /><br />\nTW.T.Phi<br />\neagraM1147<br />\ntaboo,<br /><br />\nfor<br />\nCon<br />\nIngt<br />\nund<br /><br />\n1846<br /><br />\n•<br /><br />\nFoldizq<br /><br />\n1602.1603<br /><br />\n5tsdukg<br /><br />\n1602 • tic*<br /><br />\nthe<br />\nalso<br />\nfor'<br />\nnine<br />\nwell<br />\nmed<br /><br />\ns4°<br /><br />\n1261<br /><br />\nP 5 X<br /><br />\n=/•`,<br />\n'SERVICE4<br /><br />\nArLIIHES<br /><br />\nA<br />\nlily<br />\nD. 1<br />\nStic<br />\nat t<br />\niniti<br />\nthe<br />\nnot<br /><br />\n211-213 E. BALTIMORE ST.<br /><br />\nProducers of \"The News-Letter\"<br /><br />\nhfUrn•Bushw--\"'<br /><br />\nhe cAnkle-gashioned(Word<br />\nIt's a safe bet that any man will feel<br />\nbetter dressed and look better dressm-Bligh Oxfords. They're<br />\ned in Nirt—<br />\nAnkle-Fashionecl=no gapping at the<br />\nankle, no slipping at the heel.<br />\nTug<br /><br />\nUALITY aHop<br />\nCollar Hug Clothes<br />\nBaltimore aalliberirStmen<br /><br />\nThe<br />\nBranigan<br />\nStyle No. 3505<br /><br />\nAfter all's said and done,<br />\nthe pleasure you get in<br />\nsmoking is what counts<br /><br />\nrep<br />\nlay<br /><br />\ntool<br /><br />\ndell<br /><br />\nNI°<br /><br />\nCla<br />\n11<br />\nI he<br /><br />\nCAMEL<br /><br />\nsin]<br />\nteal<br />\nlilt<br /><br />\nyea<br />\ntint<br /><br />\nCIGARETTES<br /><br />\nren<br />\n,1)1.<br /><br />\nc(it<br /><br />\nStop Wondering<br />\nWhen the other car shoots<br />\naway out in front, when the<br />\nlight turns green--stop wondering. Make your next<br />\nstop at the AMOCOGAS pump.<br /><br />\n(-Cr<br /><br />\nfill<br />\ncep<br /><br />\nWHY CAMELS ARE THE BETTER CIGARETTE<br />\nCamels are made of the choicest tobaccos grown.<br /><br />\nin<br /><br />\nThe Camel blend of Domestic and Turkish<br />\ntobaccos has never been equaled.<br />\nCamels are mild and mellow.<br />\nThey do not tire the taste.<br />\nThey leave no cigaretty after-taste.<br />\nCamels have a delightful fragrance that is<br />\npleasing to everyone.<br /><br />\nim<br />\nye;<br />\n40,<br />\nOva<br />\nph<br />\nCvi<br />\nop:<br />\nter<br />\nof<br /><br />\n6.<br /><br />\nce(<br /><br />\n.<br /><br />\n-<br /><br />\n.<br /><br />"}], "field_media_file": [{"target_id": 38412, "display": null, "description": null, "target_type": "file", "target_uuid": "58a9a7f8-0c66-4520-8dbd-cab35214dede", "url": "http://digital.library.jhu.edu/system/files/2022-03/13373-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13373, "target_type": "node", "target_uuid": "cb3cfe94-07ba-4de2-9c4d-e3034ed20931", "url": "/node/13373"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "2f1efeab-c5e8-4275-9a40-7a0c07364411"}]}