{"mid": [{"value": 37355}], "uuid": [{"value": "7ff041a4-a981-4236-8ab5-875693b17b3b"}], "vid": [{"value": 37355}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T17:04:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13312-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T17:04:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T17:04:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXXII, No. 42<br />\n<br />\nGARFIELD ADDRESSES<br />\nTHURSDAY ASSEMBLY<br />\nWas Founder and Erector of.<br />\nInstitute of Politics<br />\nATTACKS U. S. ATTITUDE<br />\nDeclares Isolation No<br />\nLonger Possible<br />\n\"During the past seven years<br />\nsince we have been conducting the<br />\nrnstitute of Politics at Williamstown,\" said Dr. Garfield in his talk<br />\nat the 'assembly Thursday, \"many<br />\ninteresting people and subjects have<br />\ncome before us.\" Dr. Garfield is<br />\nthe founder and erector of this institution and it was his purpose<br />\nThursday to give some idea of the<br />\nthings and forces behind- political<br />\nphenomena of today.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., MARCH 20, 1928<br />\n<br />\nBLACK AND BLUE JAY<br />\nTO DINE APRIL 14<br />\nMembers of the Black and<br />\nBlue Jay editorial and business staffs will gather at the<br />\nSouthern Hotel on the night<br />\nof April fourteenth for their<br />\nannual banquet.<br />\nAccording to Leonard Dalsemer, business manager of<br />\nthe Jay, this date is permanent<br />\nbut the location is not as yet<br />\ndefinite. Election of men to<br />\nthe Board of Control for the<br />\nensuing year will be held at<br />\nthis time.<br />\n<br />\nLarge Number Out<br />\nFor Lacrosse Squad<br />\n<br />\nMEMORIALS PLACED<br />\nIN ENGINEERING HALL<br />\nP. G. Turnbull and W. King<br />\nAre Honored<br />\nIn fulfillment of the request of<br />\nMrs. Frances L. Turnbull, and the<br />\nwill of the late Mrs. Rebecca Lanier King, memorials have been<br />\nplaced in the Civil Engineering<br />\nLecture Hall.<br />\nAbove the entrance at the northern side of the hall is the Turnbull<br />\nmemorial, which consists of a<br />\nbronze plate imbedded in a gray<br />\nstone foundation. The inscription<br />\non the plate is as follows:<br />\n<br />\nSHARRETTS TO HEAD<br />\nNEW GREEK BOARD<br />\nDonald Sharretts, Phi Gamma Delta, was elected president, and Steward L. Smith,<br />\nDelta Phi, secretary-treasurer<br />\nof the 1928-29 Interfraternity<br />\nBoard at the regular meeting<br />\nof the board held yesterday in<br />\nthe M. E. Building.<br />\n<br />\nJOHN DESCH TO PLAY<br />\nAGAIN FOR `STORMERS<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nUNIVERSITY CHANGES<br />\n1928 CURRICULUM<br />\nChanges in Political Science,<br />\nEconomy and French<br />\nGRADES DECIDE CREDITS<br />\nFrench 2 and 3 to be Given<br />\nin Alternate Years.<br />\n<br />\nChanges have been made in the<br />\ncurriculum for next year in Political<br />\nEconomy, Political Science, and<br />\nStar of Former Years<br />\nFrench. Dr. Ames explained that<br />\nTo Return to Stage<br />\nthis<br />\nis due to a desire to increase the<br />\nTo Cherish thre Memory of Their Son,<br />\nvariety<br />\nof courses offered to the<br />\nPERCY GR,EME TURNBULL .<br />\nThe cast of the Barnstormers'<br />\nBorn May 28th, 1878—Died February<br />\nstudent.<br />\nmaterial<br />\nboost<br />\nlast<br />\nwas<br />\ngiven<br />\na<br />\n12th, 1887.<br />\nLAWRENCE AND FRANCES L. TURNBULL Thursday evening when John EdFour undergraduate courses will<br />\nFounded the Lectureship on Poetry in win Desch, former Barnstormer<br />\nbe<br />\ngiven in Political Economy. EleThis University, May 28th, 1887.<br />\nintention of<br />\nHis Passionate Love of Beauty Sug- star, announced his<br />\ncoming out for the play. Desch, ments of Economics will be given<br />\ngested This Memorial of His<br />\nBrief Aspiring Life.<br />\nwho is taking several courses at three hours weekly throughout the<br />\nThe will stipulated that this tab- the University this year, has been year by Dr. Mitchell and Dr. Evans<br />\nlet be placed in the room in which assisting in the coaching of the<br />\nin three sections, all at eight-thirty.<br />\nlectures are usually given and it female roles thus far, and, accordalso required, as has been . an- ingly, will be able to step into his First-year students are not eligible<br />\nnounced•before,\"that in each course part with little difficulty. He will to this course. The class in statisof lectures delivered there should play the part of \"Mary Bur- tics will be taught by Dr. Evans at<br />\nbe an explicit and reverent recog- roughs,\" the younger sister of the eleven thirty during the first three<br />\nnition of God as the infinite source \"Champion.\"<br />\ndays of the week. Mathematics 1<br />\nof all Love and Truth and Beauty,<br />\nDesch, who entered Hopkins or 01 is the prerequisites. Political<br />\nand an earnest and'sincere affirmain the fall of 1922, played the fe- Economy 3 and 4, or Money Banktion of the Holiness of Beauty and<br />\nmale lead as a freshman, and was ing, Exchange, and Economic Histhe principle that all true and enone of the two men who ever have<br />\nduring art must be permeated with<br />\ntory will be given in the School of<br />\nbeen elected to the Barnstormer<br />\nthe purest morality.\"<br />\nclub in his freshman year. In his Business Economics. Students for<br />\nPortrait Displayed<br />\nthree subsequent years at Hop- the A. B. degree who have comkins,<br />\nDesch played the female pleted 1 and 2 will be admitted on<br />\nPlaced simultaneously with this<br />\nsince his graduation, in the approval of the instructor. This<br />\nleads,<br />\nand<br />\nplacard was the portrait of the late<br />\nrendered invaluable<br />\n1926,<br />\nhe<br />\nhas<br />\nMr. Wallace King. The portrait,<br />\nwill only be given to those students<br />\nwhich is located above the south assistance in coaching the female who have shown their interest and<br />\nentrance to the hall, is displayed impersonaters in the several Barnability in the subject.<br />\naccording to the requests of the stormer productions.<br />\n<br />\nWith seventy men out for berths,<br />\nthe Hopkins lacrosse squad is waging a bitter battle for positions, according to Dr. Ray Van Orman,<br />\nhead coach of athletics.<br />\nBesides those remaining from<br />\nCommunication Easier<br />\nlast year's twelve, are many men<br />\nEveryone is moving forward to who are showing up much better<br />\nmeet inevitably the problems of the than they did last year. Among<br />\nworld. Each has to do his share. these men are Egan, Herpsberger<br />\nWashington wisely talked against and Sharretts, who have been used<br />\nentangling America in foreign, alli- on the attack and were substitutes<br />\nances. But, in Washington's day on last year's championship team.<br />\ncommunication was difficult and we The new men doing good work<br />\nwere really out of touch with other are also football men; namely,<br />\nnations. Today, however, all is Lyons and Caplan. The former,<br />\nchanged. With communications ad- especially, is doing some remarkvancing so steadily, the world is able work, proving to be well<br />\never being - made smaller. Peoples adapted to the sport.<br />\nare coming closer and closer.<br />\nThose trying for the center posiThe result of this cutting down tion that are outstanding are Housof distance is that the radius of ton and Nichols.<br />\nNichols was on<br />\nour dealings is widening with our the squad last year and was used<br />\nincreased knowledge of others. as a wing defense.<br />\nThis broadening has continued unThe defense positions for this<br />\ntil the United States is the center of<br />\nyear's squad are being contested by<br />\nPower today. The great question<br />\nnow is what shall we do with this several good men, according to the<br />\ncoach. Covell, who was used as a<br />\nWorld which is becoming so small.<br />\ncenter last year, is showing up well will of his .widow, the late Mrs. Desch made his Hopkins debut<br />\nin \"The Purple Mask\" in 1928. In<br />\nConfucius' Idea<br />\non the wing defense. Piet, out for Rebecca Lanier King.<br />\n\"The<br />\nGalloper,\" presented in 1924,<br />\nAt the same time, Mrs. King beConfucius saw the history of a while last year, is also giving his<br />\nplayed opposite Gordon<br />\nDesch<br />\nmankind unrolled before him as a opponents on the defense a hard queathed $50,000 to establish two<br />\nmale lead. In 1925 he<br />\nPost,<br />\nthe<br />\nscroll; saw the people pass-from one fight for a berth. Others men- lecture funds. Further, Mrs. King's<br />\nthe<br />\nfemale lead opposite<br />\nplayed<br />\nwill<br />\nstipulated<br />\nthat<br />\none-half<br />\nof<br />\nthe<br />\nstage of barbarism to another until tioned as performing well are Powin \"The Tailor<br />\nI.<br />\nEvans<br />\nRodgers,<br />\nbe<br />\nresidue<br />\nof<br />\nher<br />\nestate<br />\nused<br />\nto<br />\nesthey reached a state of semi-tran- ell, Strader, Hall, Keating, KaufMade Man,\" and in his senior year<br />\ntablish<br />\na<br />\nstudent<br />\nloan<br />\nfund.<br />\nman<br />\nand<br />\nSchwartz.<br />\nquillity. Today each nation is arfemale lead opposite<br />\nGoalies are also well represented, The money offered in these be- he played the<br />\nrayed against the others—whether<br />\nMajesty Bunker<br />\n\"His<br />\nHiss<br />\nin<br />\nAlger<br />\nit is in peace time competition or Frank Cone and Browley doing quests was derived by Mrs.. King<br />\nBean.\"<br />\nfrom<br />\nher<br />\nhusband's<br />\nestate.<br />\nwar. It was Confucius' idea that good work. Armstrong and TaMr. King died nearly twenty<br />\nat some time in the future this ban, freshmen, are doing well, also,<br />\nWorld would reach a permanent but need more experience in the years ago, and was known as the<br />\ndeveloper of Elderslie, a Mount John Eldridge Elected<br />\ntranquillity, and Dr. Garfield is of Indian game.<br />\nthe opinion that we are on the verge<br />\nA group of about twenty fresh- Washington suburb.<br />\nBasketball Manager<br />\nIn connection with these memoof such an ideal condition at present. men are appearing at practice and<br />\nAt a meeting of the Athletic AsIf we were to bring to bear all the doing good work in the scrim- rials it may be said that these are<br />\nsociation<br />\nlast Tuesday night, John<br />\nripe intelligence of mankind to con- mages. To give them further op- the first decorations of any sort in<br />\nEldridge<br />\nwas elected manager for<br />\nvert this power of the world into portunity for development, plans the C. E. Hall. The tendency to<br />\nyear,<br />\nafter a close race with<br />\nnext<br />\nare<br />\nbeing<br />\nour servant, we might accomplish<br />\nmade to get games with decorate the walls of the University<br />\nprep schools.<br />\nis just beginning to be noticed here. Johnny Norris. It was decided not<br />\nthis.<br />\nto elect junior managers until next<br />\nLord Bryce Here<br />\nyear. In spite of the fact that the<br />\nSTORM CLOUD SUCCESSFULLY CLEARS<br />\nLord James Bryce on coming to<br />\ncompetition for manager will be<br />\nUPPER BARN OF CARD-SHARKS open until the senior year. As<br />\nAnierica gave us our trouble in one<br />\nA very dark cloud descended on of the year. Despite his Scotch there are only two junior managers<br />\nsentence, \"the one great failure in<br />\nAmerican democracy is municipal the Barn in the midst of the snow nature, the president of the Debat- left for next year, there will be a<br />\ngovernment.\" He came again to storm Friday afternoon. Entering ing Council was forced to give his big opening for candidates.<br />\nAmerica in order to go to Williams- from the \"Y\" office, where they last cent. Many of the regular<br />\nThe question as to whether bastown: In eight lectures there he failed to get any material support, Barn hounds were forced to walk ketball will be continued at the<br />\nPresented his far-reaching views on due to the Levering Hall drive, two home due to their supreme gener- university in the future will be dethe subject- of democracy. One of representatives of the Afro-Ameri- osity to the worthy cause.<br />\ncided at the regular meeting of the<br />\nLord Bryce's ideas'was that a State can orphan asylum came into the<br />\nOthers argued in vain, as had Athletic Council this week. The<br />\ncould not.be cut up as a map with Barn in an effort to solicit funds. Gardner; that such institutions Athletic Council consists of the<br />\nThey knew riot where they came! either were supported by the Com- President of the University, the<br />\nscissors: The geography of the country, At first it was thought another munity Fund or were not worth Dean, several of the alumni, Presthe customs- of the people, their his- salesman had. entered and the card supporting. HoweVer, the elo- ident of the Student Council, and<br />\ntory—all of these' have to be con- games continued in peace. Just as quence of the dark representatives the President of the Athletic Assosidered before boundaries may be a hand reached out to sweep up the overcame all obstacles. The largest ciation. It is very probable that<br />\nChanged.<br />\nprofits of the play, a dark hand de- donation was made by \"Doc\" basketball will be continued in view<br />\nSaroumi, one of the.. Japanese scended upon them.. The true pur- Adams. However, it is believed of the very• successful season this<br />\ngentlemen at .Williamstown, said, pose of the visit was disclosed. that there was a method in his year. In spite of the fact that the<br />\n'Ares, east is east'and west is west; After a short sermon on gambling madness. He saw that all his trade team did not have any home gym<br />\nbut the world is getting so small and. other vices ot college boys, a would soon be in no condition to and was greatly inconvenienced in<br />\nthat they soon shall meet.\" This collection was taken. Norman buy their,daily ice cream cone and practicing and playing games, it<br />\nWas the Japanese feeling until the Gardiner, supreme upholder of elo- in a supreme effort to save the do- completed a very satisfactory seaimmigration change in 1925. Since quence on the campus, was driven nations for himself he attempted son, winning half of its games<br />\nthen the expressions of a few into a corner. After a heated argu- to rid the Barn of the well-meaning against some of the best teams in<br />\nment Hopkins lost its first debate Collectors.<br />\nthe East.<br />\n(Continued on Page 6, Column 2)<br />\n<br />\nThe Political Science department<br />\noffers two regular courses without<br />\nprerequisites and to Juniors and<br />\nSeniors only, a choice of four reading courses. The regular courses<br />\nare worth four credits if the student<br />\nmerely earns a passing grade and<br />\nsix if his work justifies it. Two<br />\nhours a week will be given to lectures and tests offer the equivalent<br />\nof a third hour in private reading.<br />\nDr. Hart will conduct all these<br />\nPolitical Science 1 will<br />\nclasses.<br />\ndeal with foreign governments. The<br />\nhour is eight-thirty on Thursdays<br />\nEspecial attention<br />\nand Fridays.<br />\nwill be given to the English cabinet<br />\nsystem. France, Germany, Switzerland, Russia, Italy and Japan will<br />\nalso be studied. This course is<br />\nwhat was formerly the/first half<br />\nof the Political Science 1. Political Science 2 will cover American government and politics. Twothirds of the course will be devoted<br />\nto the national government and the<br />\nremaining time a brief study Of<br />\nState, county and municipal government. Monday and Tuesday at<br />\nnine thirty is the time of the class.<br />\nThe reading course, in addition to<br />\nbeing open only to Juniors and Seniors who have taken 1 and 2, requires a grade of eight or over their<br />\nprevious courses and special permission of the dean, adviser and'instructor. Only one such course may<br />\nbe taken per session and each will<br />\ncount for three credits. The subjects approved are: Political Parties<br />\nand Public Opinion, Municipal Gov(Continued from page 1, column 5)<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 20, 1928<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News -Letter<br />\n<br />\nYES AND NO<br />\n<br />\nFOUNDED 1897<br />\n<br />\nSubscription<br />\n<br />\n$2.00<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\n<br />\nGirls.—Everywhere I go, every<br />\nboy I see, no matter what I do—<br />\ngirls. On the trolley car going to<br />\nclass in the morning a fraternity<br />\nbrother raves about the girl he<br />\nwas with last night. Another<br />\nbrother's greeting is: \"Who was<br />\nthe girl I saw yesterday?\" At<br />\nlunch it's the girl someone is taking to the House dance. Girls!<br />\nI go home talking about girls; the<br />\nhall session about the fireplace,<br />\nwith its modern substitute for<br />\ncrackling logs, of our colonial forbears, turns immediately to girls.<br />\n. Damn the girls!<br />\nGirls<br />\n<br />\nout platitude. But art in the<br />\nnether limbs that female thrust<br />\nforth for the open-mouthed stare<br />\nof my more or less moronic brethren? Beautiful? Shapely? Art!<br />\nThe very word when used thus is<br />\nblasphemy, sacrilege.<br />\n<br />\nSheer silk stockings that do or<br />\ndo not disappear under too short<br />\nskirts. We once could tell the apBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nproach of the \"fabled fair\" by the<br />\nHopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nswish of her skirts. To me they<br />\nother communications to the EDITOR-IN-CHIEF.<br />\nseemed to connote dignity, selfrespect, respect for the wearer<br />\nUniversity 0100<br />\nTelephone<br />\nand her position in society. And<br />\nnow—semi-skirts that strive vainto reach the knee. Let him who<br />\nly<br />\nBut should I verbally desecrate<br />\nEDITORIAL DEPARTMENT<br />\nwoman<br />\nthe fairer sex so hastily, without stated that the knee of a<br />\nEditor-in-Chief<br />\nis<br />\nstocking<br />\na<br />\nunder<br />\nwrinkled<br />\nGEORGE E. BANKS, JR., '29<br />\nmeditation, or reminiscing over<br />\nsuch<br />\nis<br />\nIt<br />\nforth.<br />\nstand<br />\nbeautiful<br />\nevenings spent—pleasant evenings<br />\nAssistant Managing Editor<br />\nManaging Editor<br />\nbrightened by—? But again I as he that would fall into ecstasies<br />\nGEORGE GUMP, '30<br />\nPHILIP W. NESS, '29<br />\nover the pulchritude of some of<br />\nsay—damn the girls.<br />\nour Simian ancestors or over the<br />\nColumnist<br />\nAlluring curves, unnaturally lovely shapeliness of a stick of<br />\nDONALD Hiss, '29<br />\nbrilliant, carmine lips, teeth flash- kindling wood or a block of granAssociate Editors<br />\ning in inane smiles, silly prattle— ite. Thank the gods that men<br />\nRICHARD H. WOOD, '29<br />\nWILMER H. DRIVER, '29<br />\neverywhere I go there are girls, have discovered the wisdom of<br />\ngirls. Either about them or, even concealing their lanky, hair-covJunior Editors<br />\nE. FOSTER DOWELL, '29<br />\nLEONARD B. NOLLEY, '29<br />\nworse, they themselves—Lord, ered, bone-protruding lower limbs<br />\nRICARD G. HUNT, '31<br />\nROBERT S. BAIRD, '30<br />\nHARWOOD F. MULLIKAN, JR., '31<br />\nW. PURNELL HALL, JR., '30<br />\nHow<br />\nI hate them;<br />\nIRVING K. GORDON, '29<br />\nROBERT F. SKUTCH, JR., '30<br />\nunder the sheltering folds of their<br />\nSTEWART L. SMITH, '30<br />\nI go to class tonight—one of trousers. Would that a similar<br />\nthe courses in the Teachers? Col- glimmer of light make its way<br />\nBUSINESS DEPARTMENT<br />\nlege. I ride out suffering from through the tightly fitting hats of<br />\nBusiness Manager<br />\nthe endless gushing of some sis- our modern women! But that is<br />\nHARRY 0. Scimoss, '29<br />\nter. Oh, God! Will Al always in- too much to expect and I must<br />\nCirculation Manager<br />\nAdvertising Manager<br />\non picking them up? Half continue to suffer in silence.<br />\nsist<br />\nJ. ROBERT MYERS, '29<br />\nGEORGE M. GLAZIER, '29<br />\nthe class is female—school teachEven my solitary strolls are not<br />\ners who hope to keep a firmer free from this affliction. BeAssistant Business Managers<br />\ngrip on their jobs by saying they knickered pieces of femininity flout<br />\nWILLIAM RAFFEL, '30<br />\nDONALD C. WEILLER, '28<br />\n•<br />\nALVIN BLUM,'30<br />\nA. H. MORTON, '30<br />\ngo to Hopkins. Flappers—Lord by, bulging in the most inconGus BURKE, '31<br />\nJOHN LOTZ, '30<br />\ndeliver me from all such evils— gruous of places. Ye gods! What<br />\nStaff Photographer<br />\nwhispering to each other, regard- could be more horrible?<br />\nWALTER D. SCHEIDT, '30<br />\nless of the old pedagogue up<br />\nAnd what melody in those<br />\nfront. No one listening to what names—Marie, Genevieve, Eleais really an interesting lecture. nor! What pleasant associations<br />\nPrinted by Fleet-McGinley, Inc., 8th floor, Candler Building, Baltimore, Md.<br />\nEducation! Hopkins! Bosh!<br />\nthey summon up! How I love<br />\nAnd still girls. The feminine them, everyone—their every acsex. To some of my effervescent tion, their every word!<br />\nbrethren the words connote<br />\nAnd more girls. The solitude<br />\nbeauty, charm, long lashes shad- and peaceful quiet of my room is<br />\ning deep pools of blue, bewitching broken by the raucous clang of<br />\nAnd some miss on<br />\nsmiles, evenings in Paradise. To the telephone.<br />\nof the paper with a considerable<br />\nthe other end of the wire asks—<br />\nTHIS JOB OF<br />\namount of trepidation. The saying me—paint, powder and lipstick; Bang! Merely the receiver back<br />\nBEING EDITOR<br />\nto the effect that the head which too black eyelashes covering too on the hook. Damn all girls, and<br />\nLTHOUGH our predecessors wears the crown lies uneasily, holds alluring eyes; silly, wide-mouthed those who call fraternity houses<br />\nmost fervently.<br />\nhave willfully neglected to sing true for typewriter pounding editors smiles; evenings of torture.<br />\n* * *<br />\nas<br />\nas<br />\nmonarchs.<br />\nwielding<br />\nscepter<br />\nwell<br />\nthe traditional \"swan song,\" it seems<br />\nSince early childhood I have<br />\nI'm lonesome tonight—in no<br />\nonly meet and proper that we should Or to use the more uncouth jargon prided myself on my taste for the mood for studying and just a bit<br />\njob<br />\nmost<br />\ncertainly<br />\nis<br />\n'of<br />\nthe<br />\nMoronia,<br />\nacknowledge the rich bequest that<br />\nartistic. To me \"Art for arts' blue. The telephone—Yes, Ann,<br />\nthey have left behind. During the no bed of roses.\"<br />\nA. G.<br />\nsake\" is more than a mere worn- in a half hour.<br />\npast regime, the paper undoubtedly<br />\nhas shown development both in the<br />\nCHANGES IN CURRICULUM until 1929-1930. French 3 on Roquality of the editorial work and in<br />\nmanticism and Realism will be<br />\n(Continued on page 2, column 3.)<br />\nthe efficiency of the business staff. It<br />\ngiven next year by Dr. Shanks at<br />\nThe French department provides the same hour as French 2, with<br />\nhas grown from four pages to six and THE RETURN<br />\nOF<br />\nTHE<br />\nPRODIGAL<br />\nfour courses, two of which will be the same prerequisites, and is also<br />\neight. The number of agate lines of<br />\ngiven in alternate years. French 2 worth six credits. French 4 is<br />\nwith<br />\nincreased<br />\nhas<br />\nadvertising matter<br />\nQ TUDENTS will be pleasantly suramount<br />\nthe<br />\nin<br />\nwill be given four hours throughout limited to students who have coma proportionate growth<br />\nk-)prised to read elsewhere in this<br />\nyear and will cover modern pleted 2 or 3 or the equivalent, and<br />\nsenithe<br />\noutgoing<br />\nof news articles. The<br />\nissue that J. Edwin Desch, a member short stories, plays, composition, posses the necessary ability to read<br />\nThey<br />\nwell.<br />\nors have done their work<br />\nof the Class of 1926, will have a part and conversation. French 2 will be French at sight. It is a supervised<br />\nhave laid down a foundation for fuin the forthcoming production of the a survey course in French literature reading course dealing with modern<br />\nture development, which is based on<br />\nBarnstormers' Club.<br />\nconducted by Dr. Shanks and Mr. French critics, thinkers, and poets,<br />\nthe soundest journalistic principles.<br />\nDesch is, without question, the best Thomas in two sections at ten thirty Two or more books per month will<br />\nTo the incoming board of control is<br />\nof the first half of the week. French be read and four points credit given.<br />\nassigned the difficult task of continu- female impersonator ever to have<br />\nthe course<br />\nbeen det.reloped under the guiding 1 or its equivalent is necessary for Dr. Shanks will conduct<br />\ning this high standard of work.<br />\non<br />\nTuesdays<br />\nthirty<br />\neleven<br />\nentrance. This course is being given at<br />\nOur job of editor involves us in the hand of \"Pop\" Swindell. Those who this year and will not be given again throughout the year.<br />\nunenviable task of keeping the ma- saw the club's production of \"The<br />\nchinery running smoothly. There is Tailor-Made Man\" will recall his exalways the duty of constructing edi- cellent work in the role of Tanya.<br />\nSTARTING MONDAY EVENING, MARCH 19th<br />\nin<br />\nLikewise,<br />\nBunker<br />\n\"His<br />\nMajesty<br />\nEdwin H. Knopf and Willian P. Farnsworth<br />\ntorials which must be at least, in part,<br />\nhis<br />\nBean,\"<br />\nacting<br />\nin<br />\nthe<br />\nhave the honor to present<br />\nof<br />\nMarie<br />\npart<br />\nreadable. Irate professors, who have<br />\nW. SOMERSET MAUGHAM'S<br />\nwas<br />\nBreede<br />\none<br />\nof<br />\nthe<br />\noutstanding<br />\nbeen misquoted by naive freshmen<br />\nInteanational Comedy Success<br />\nreporters, must be calmed as diplomat- performances of the show.<br />\n\"THE CONSTANT WIFE\"<br />\nAt the present time Desch is takNot only will next Monday evening's performance be the first showing<br />\nically as possible. Staff members<br />\ning graduate courses at the Univercomedy in Baltimore, but it will be the first presentation by any<br />\nthis<br />\nof<br />\nsimistricken by spring fever or some<br />\nresident company in the United States of Mr. Maugham's most successful<br />\nsity and thus is eligible to participate<br />\neffort. Therefore, it is with pardonable pride that Messrs. Knopf and<br />\nlar malady must continually be disin this year's production. His work<br />\nFarnsworth make this announcement to the Baltimore public. There will<br />\nsuaded from taking a couple of weeks should prove a big factor in aiding<br />\nbe no adtance in prices and tickets are now on sale at the box office from<br />\n50 cents to $1.50.<br />\nof unauthorized vacation.<br />\nthe Barnstormers to score another<br />\nAUDITORIUM THEATRE<br />\nThus we take over the management dramatic success.<br />\n<br />\nTHEATRE<br />\nTHE LITTLE<br />\nST. NEAR FRANKLIN<br />\n<br />\nN. HOWARD<br />\nMotion Picture Guild Presents:<br />\n\"ALL FOR A WOMAN\" at<br />\n<br />\n1.45-3.45-6.00-8.00-10.00 P. M.<br />\nUFA'S MASTER PRODUCTION<br />\nft<br />\n<br />\n\"All for a Woman<br />\nwith<br />\n<br />\nEMIL JANNINGS<br />\nand<br />\n<br />\nWERNER KRAUS<br />\nin the stellar roles of<br />\nDanton and Robespierre<br />\nNone can forget the force of<br />\nmob-passion that leaps from this<br />\nmammoth production; nor the<br />\nart — indescribable pantomime —<br />\nof Europe's greatest artists.<br />\nMovies in the Making<br />\n\"Ballet Mecanique\"<br />\nImportant Devlopment in the march<br />\nof the movies.<br />\n<br />\nCharlie Chaplin in a<br />\nSad Old Drama of 1917<br />\n\"The Pawn Shop\"<br />\nLITTLE THEATRE ORCHESTRA<br />\n<br />\n-- ALBEE<br />\nKEITH<br />\nGARDEN THEATRE<br />\nNEW<br />\n<br />\nCONTINUOUS FROM 11.30 TO 11<br />\nWEEK OF MARCH 19th<br />\n<br />\nBELLE BAKER<br />\nThe Incomparable<br />\n<br />\nCHARLES WITHERS<br />\nin \"WITHERS OPRY\"<br />\nand<br />\n<br />\nOther Wonderful Acts<br />\n.ar<br />\n<br />\nPHONES: HOMEWOOD 7806<br />\nHOMEWOOD 7807<br />\n<br />\nPhone Us—We Deliver<br />\n<br />\nR.M.BIRELY,Phar.D.<br />\nPrescription Pharmacist<br />\nSODA<br />\n<br />\n-<br />\n<br />\nCANDY<br />\n<br />\n-<br />\n<br />\nCIGARS<br />\n<br />\nCor. St. Paul and 33rd Sts.<br />\nBALTIMORE, MD.<br />\nvs•<br />\n<br />\nE. E. ADAMS<br />\nBARN CAFETERIA<br />\n<br />\nEDITORIAL COMMENT<br />\n<br />\nA<br />\n<br />\nSwitches Back<br />\nto Favorite<br />\nTobacco<br />\nPeoria,<br />\nAug. 26, 1926<br />\nMessrs. Larus & Bro. Co.<br />\nRichmond, Va.<br />\nDear Sirs:<br />\nJunta confession and an appreciation.<br />\n<br />\nA number of years ago I was a user<br />\nof your Edgeworth smoking tobacco.<br />\nButlike some others, perhaps,I wasled<br />\nby alluring advertisements to changeA few days ago I went into a drug<br />\nstore to get some tobacco, and on the<br />\n<br />\ncase wasthe familiar can of Fdgeworth•<br />\nI bought it and since then I have enjoyed old-time comfort.<br />\nSo my confession is that I made a<br />\nmistake in changing to other brands,<br />\nand my appreciation is such that Edgeworth will be my Smoke Pal while life<br />\nlasts, which may not be long, for I<br />\nhave passed my \"three score years and<br />\nten.\"<br />\nVery truly yours,<br />\n<br />\n(signed) E. P. Fishburn<br />\n<br />\nEdgeworth<br />\nExtra High Grade<br />\n<br />\nSmoking Tobacco<br />\nPkimmimokommannal<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 20, 1928<br />\n<br />\nMORAL HOLIDAYS<br />\nBy<br />\n<br />\nSUMNER L. STOCKTON<br />\nto state a mild form, some may<br />\nfeel holiday enough in a kiss,<br />\nothers in a necking party, and so<br />\nforth. It is easy to see, then, just<br />\nhow methods and types are governed by personal feelings and<br />\nopinions, and how these in turn<br />\nare controlled by the strictness of<br />\none's own moral code, so that the<br />\ngreater strictness yields the milder holiday, and the greater laxity<br />\nyields the greater freedom.<br />\nAs to the conditions for moral<br />\nholidays, there are three—time,<br />\ncircumstances, a n d inclination.<br />\nMost people have the time, which<br />\nbrings forth the danger of having<br />\ntoo much time—how well it is<br />\nNow, these holidays seem to that two other conditions are<br />\nresult directly and primarily from necessary! Circumstances are exa reaction against the bonds of tremely difficult to arrange, if<br />\nconvention and environment; they are to be arranged; somethey are the overflowings of de- times the circumstances are<br />\nsires too much suppressed. brought about very accidentally,<br />\nWere these desires n o t sup- and it is often that a much better<br />\npressed, however, we would be time is had under chance and unin the state first mentioned; expected circumstances. Usually,<br />\nthat is, a holiday would be free- however, a moral holiday is indom from immorality. But as to dulged away from home, and the<br />\nthis condition, it is both disgust- more removed the place the beting and repulsive, and wholly in- ter, for then there is less opportucompatible with a civilization nity for detection. If enough care<br />\nWhich provides (as best it can) is taken the circumstances may be<br />\nfor the general welfare of human- made ideal, except for perhaps<br />\nity. Also, the second condition, those minute details, which deif it could possibly exist univer- pend on astronomical, geographsally, would be undesirable; not ical and physical conditions;<br />\nthat it is harmful, for it seems to sometimes it is advisable to delay<br />\nbe the goal of social progress, but a moral holiday when better cirbecause it lends no color to life. cumstances are expected. The inPerhaps we can compare it to the clination seems to be always with<br />\nlife of work without any play; us, or, at least, periodically it<br />\nan analogy which by its very comes to us, but there is no surer<br />\ncrudeness apprehends the bore- way to decrease the inclination<br />\ndom and monotony arising from than by overindulgence; a point<br />\na lack of somewhat shady variety. of satiety is often reached by proBe seriously moral, but just play- miscuousness and indiscrimination, to say nothing of the danfully immoral.<br />\nSupposing, then, that moral gers arising from detection. And<br />\nholidays are both natural and de- usually the success of a moral<br />\nsirable: how and when should holiday depends on the existence<br />\nthey be indulged? This question of all three conditions for two perembodies more of personal opin- sons mutually.<br />\nIt is, finally, important to alion than any set regulations, for<br />\nno one can definitely set down a ways observe two specific details:<br />\nrule whereby others may be the frequency of holidays and the<br />\nguided in their excursions. There secrecy attached to their occurare, however, general tendencies rence. In order to keep from<br />\nWhich exemplify sbmewhat the being satiated with immorality, to<br />\nvarious methods and types of keep from becoming too bestial,<br />\nholidaying. Suppose that a man and to keep alive self-respect, it<br />\nhas strong, innate tendencies for is necessary to put a limit on the<br />\nliquor, but must necessarily con- number of excursions. Knowing<br />\ntrol them; this man will sometime that they are practically inevitable, we can say, the fewer the<br />\nYield to his desire, become ex- better.<br />\nAnd secrecy is the very<br />\nceedingly intoxicated, and then keynote of moral holidays; it is<br />\nreturn quietly and submissively the very essence of passing ento his normal self, carrying with joyment and later pleasant recolhini shady but pleasant recollec- lection. With apologies to Donne<br />\ntions of his experience. Or the de- for the misapplication of a verse<br />\nof his poetry, the following is<br />\nsire may be gambling, and (if too<br />\nquoted:<br />\ngreat a financial loss is not sus- If I have done a braver thing<br />\ntained) the same process of in- Than all the worthies did,<br />\ndulgence and reinstatement will Then from it thence a braver<br />\nsprings<br />\noccur. Likewise, there are other<br />\nWhich<br />\nis to keep that hid.<br />\nsecret vices which ever so often<br />\nFor a man is not only obnoxrequire exercise. But there is ious, but he<br />\nalso puts himself in<br />\none in particular that is so no- the way of danger when he boasts<br />\nticeable because of its universal of his achievements, especially in<br />\nappeal—in the terms of Freud, it the field of moral holidays. If<br />\niS the sex desire. No one is quite you must have a moral holiday,<br />\nmake sure of the conditions, deimmune from its attacks, and yet<br />\nscend to immorality, have as<br />\nfreedom from the strict moral pleasant a time as<br />\npossible,<br />\nstandards of sex relations has and then return, covering 'your<br />\nsuch varied forms. For instance, actions with secrecy.<br />\n<br />\nThere are those among us who<br />\ntack morals, and can therefore<br />\nhave no moral holiday; to them<br />\na holiday is a rising from immorality; there are also those among<br />\nus who are forever strict in their<br />\nmoral codes, and never descend<br />\nto a shadow of immorality; they<br />\ndeprive themselves of a holiday;<br />\nbut by far the greater part of humanity is comprised of those who<br />\nare somewhat strict, morally<br />\nSpeaking, but who are not infallible. It is this latter group which<br />\ngives rise to the deviations from<br />\nthe dictates of purity—excursions<br />\ninto the realms of the immoral—<br />\nwhich we call moral holidays.<br />\n<br />\nNOTICES<br />\nThe annual Spring Competition for the editorial<br />\nstaff of the News Letter<br />\nwill start Friday. Candidates for editorial positions should report at the<br />\noffice Friday at 12.30 P.<br />\nM. By faithful work, it<br />\nis possible for applicants<br />\nto make the regular editorial staff before the end<br />\nof the present semester.<br />\nThere will be a meeting<br />\nof the News Letter editorial staff at the Barn today<br />\nat 12.30 P. M. The business staff will hold a meeting tomorrow at the News<br />\nLetter office.<br />\nFreshman class meeting<br />\ntoday at 12.20 P. M.in the<br />\nC. E. Hall.<br />\nSenior class will meet<br />\ntoday at 12.20 P. M.in the<br />\nC. E. Building.<br />\nMeeting of the Blue Jay<br />\nbusiness staff at 12.20 P.<br />\nM., Thursday.<br />\nCandidates not appearing at this<br />\nmeeting will not be considered eligible for the<br />\nstaff.<br />\n<br />\nVANDERBILT HOTEL<br />\ntTit ()ark, Avenue)<br />\n\"<br />\nc7hirty(fourth c.StrtvEwoas<br />\nC2innou7lcei_9<br />\n<br />\ndunday &ening eoncerti_<br />\nin the DULA 7.0.3.21Aca<br />\nDISTINGUISHED ARTISTS<br />\nDINER-DE-LUXE— $3.00 PER PERSON<br />\n<br />\nIn Addition<br />\non Tuesday, Wednesday,Thursday,<br />\nFriday and Saturday Evenings we<br />\nare having<br />\n<br />\nDinner Dances<br />\nin the Della Robbia Room. Dancing from 7.00 to 12:00 including<br />\nDinner at $3.50 per cover.<br />\nMusic by the Della Robbia Orchestra. Evening<br />\nDress required.<br />\n<br />\nSTAY ON THE FAIRWAY;<br />\nSTICK TO'CAMELS!<br />\nSOMEWHERE between your collar-button and the bottom of your plus-fours<br />\nthere's a smoke-spot—seeking \"fill-fullment.\" The vast majority of jobbies<br />\nwho feel that in'ard hankerin' have discovered what to do about it. They<br />\npull a cool cloud of joy away down into it—and slowly exhale fragrant<br />\nCamel smoke.<br />\nTobacco science has produced in Camel a superb blend of the choicest,<br />\nTurkish and Domestic tobaccos. Just revel once in the delicious, quivering<br />\naroma of a cloud of Camel smoke. We'll bet a caddie to a left-handed<br />\nniblick you'll never get off that fairway!<br />\n1928 R. J. REYNOLDS TOBACCO COMPANY, Winston•Salem, N. C.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 20, 1928<br />\n<br />\nTHE MAIL BAG<br />\nWHAT! MORE OF THIS?<br />\n<br />\nENGLISH LIT.0<br />\n<br />\nTo the Editor of the NEWS-LETTER: To the Editor of the NEWS-LETTER:<br />\nDear Sir:<br />\nAlthough much has been said on<br />\nthe subject, and \"many hasty remarks have been made on hearsay,\"<br />\nit seems that one point remains that<br />\nis yet entirely unsettled with respect to the proposed Levering<br />\nHall.<br />\nThe subscription blank reads, as<br />\nnearly as I can remember,<br />\n\"I hereby subscribe the following<br />\namount of money for the erection<br />\nand furnishing of a building for<br />\nstudent use on the Johns Hopkins<br />\nUniversity Campus; this I agree<br />\nwith other such subscribers, and<br />\nwith the Young Men's Christian<br />\nAssociation of Baltimore.\"<br />\nThis is not verbatum, but the exact meaning and words are present<br />\nwith no deviation from the regular<br />\nsubscription blank. I admit a reliance on memory, but I challenge<br />\ncomparison between this a.nd the<br />\nactual blank.<br />\nWith the blank as a basis the<br />\nfollowing analogy, I believe, will<br />\nshow clearly an objection:<br />\nSuppose I go to my fraternity<br />\nand say, \"You are unable to build<br />\na new house, and a new one is<br />\nneeded. I will build it for you.\" I<br />\nmake a subscription blank that<br />\nreads, \"I hereby subscribe the following amount of money for the<br />\nerection and furnishing of a building for the use of the Psi Beta<br />\nKappa Fraternity; this I agree with<br />\nother such subscribers, and with<br />\nMr. Blah.\". (Mr. Blah is myself.)<br />\nWill the reader please notice the<br />\nsimilarity with the Y. M. C. A.<br />\nblank?<br />\n<br />\nDear Sir: Harksk! Woes dat?<br />\nMethinks I heareth the dull thud of<br />\nfalling glass. By my horse! I kneweth that yon asses wouldst be struck<br />\nby one (1) cobbblestone ere they<br />\nliveth long in such an abode—imagine, Lucy, calling that pile of<br />\ncrystal a house!!<br />\nHow now, Boxley, old tripe!<br />\nWhat! Receivest thou not information about the squabbling of the<br />\nrabble in regard to the weekly massmeetings in the Civil Science rooms?<br />\nWell, Well, attend!<br />\nSir Blandi has been in receipt of<br />\nintimations penned by several of the<br />\ncellar champions and their running<br />\nmates--the Sophomores—that their<br />\nsubscriptions to chairs on the assembly floor will automatically cease<br />\nshould the Head Councilor of Students continue to provide sad and<br />\ndull orators, or what is slightly<br />\nworse—no silver-tongued 0 chaps at<br />\nall. Dost thou bend thy reverend<br />\near to my effort, dear Boxley? Eh?<br />\nGood!<br />\n<br />\nThe spectators soon lost all interest in the game—the majority of<br />\nthose present being Hoof and<br />\nMouthers—and, besides, the pitcher<br />\nhad gone up into the air and things<br />\nwere over their heads. Once when<br />\nthe boy on the mound threatened to<br />\nstrike out the side with a joke, the<br />\nRhythem of the Itch slowed down<br />\nto a walk, but when said yoke was<br />\nnot forthcoming, the sound of the<br />\ncoxswain urging an increase in<br />\nstroke, rumbled over all other noise.<br />\nAs the acousticons in the foremost<br />\npews were out of order, everybody<br />\nhad to vaguely agree with the announcer that it was a top-hole performance, and—\"that's the kind of<br />\nan assembly we ought to have every<br />\nweek—you know, a pip speaker like<br />\nthat guy, what I mean!\"<br />\nOh! I say, Boxley, you've often<br />\npromised to tell me that scandal<br />\nabout the iceman and the virgin<br />\ncook, now's<br />\n•<br />\nPax vobiscum,<br />\nLAMBERT B. BEEUWKES.<br />\n<br />\nCarl J. Doederlein<br />\n•<br />\n<br />\nAnd, Mr. Reader, please notice<br />\nalso that when a \"sucker\" signs my<br />\nblank, he is not giving, nor has he<br />\nany intentions of giving this money<br />\nto Mr. Blah (me).<br />\nAnd likewise, the unfortunate<br />\ngentleman that signs the Y. M. C.<br />\nA. blank may have no intentions of<br />\nTwo deliveries—one a slow ball,<br />\ngiving the money to the Johns Hopto the new Y. M. 0C. A.<br />\nrelating<br />\nkins Y. M. C. A., much less the<br />\nbuilding, and the other a fast ball,<br />\nBaltimore Y. M. C. A.<br />\nTherefore, as long as such a which threw tawbayta pie into the<br />\nclause exists in the contract be- ears and mouths of the home fans—<br />\ntween the Y. M. C. A. and the preceded the main bout on the card<br />\nUniversity, namely, that if, after a —an illustrated oral treatise on<br />\ncertain period, the University does \"Ship Lighters That Air.\" And<br />\nnot wish the Y. M. C. A. to remain<br />\nsay, Boxley, would you believe it,<br />\non the Hopkins campus, she must<br />\ninning the<br />\npay back that amount of money col- that prior to this third<br />\nlected for the building by the \"Y;\" fans were silent. No-o, sex probas long as such a clause exists, / lems—domestic or foreign—didn't<br />\nobject, and many others object.<br />\nkeep them in order—the pitchers<br />\nFor this money is collected in just brought out their Indian signs.<br />\nour name! Just as, in the example, (No,I didn't think the Indians were<br />\nMr. Blah collected in the name of<br />\nsign painters, either, until I saw the<br />\nthe members of the Psi Beta Kappa Fraternity, just.as his name ap- telltale evidence.)<br />\npears only on the contract as the ' It was not long, however, after<br />\ncollector, so the \"Y\" appears on the Honorable Sir Walt Peggin'<br />\nthe actual blank. If you still do not<br />\nwalked up the steps to the mound<br />\nsee the point, read both blanks<br />\nthat the members of the Hoof and<br />\nagain.<br />\nThis is a well-founded objection; Mouth Disease Fraternity swung<br />\nit is no hasty remark. You may into action. Their mascot wondered<br />\nsay that it is only a technical objec- why the sharp edges of the chairs<br />\ntion, but as long as there is ever a and footrests were so thoughtfully<br />\npossibility of the Y. M. C. A. profit- worked out, if a definite purpose<br />\ning to the tune of a sum approachhad not been in mind. One of the<br />\ning $175,000, there will be an objection, unless our name is not the brothers volunteered the information that the reason for this was<br />\nbasis of the collection.<br />\nbecause the chairman of<br />\nprobably<br />\nThe blank, as it reads at present,<br />\nhighits<br />\nin<br />\na<br />\nis<br />\nmisrepresentation<br />\nthe last National Seven Year Itchest form, and inasmuch as it is a ers and Anti-Old Gold Smokers<br />\nmisrepresentation, I protest and ob- Convention, held just recently in<br />\nject to the whole campaign.<br />\nPooh Pooh, Wis., had designed this<br />\nYours for a student building,<br />\nto be the official chair of the organiMR. BLAH. zation.<br />\n<br />\nT<br />\n<br />\nS<br />\n<br />\nConvenient and Economical<br />\nTRANSPORTATION<br />\n<br />\nTHE STREET<br />\n<br />\nCARS<br />\nInterior Wood Work<br />\n<br />\nDecorations<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\nFactory<br />\n600 S. Pulaski Street<br />\n<br />\nShow Rooms<br />\n343 N. Charles Street<br />\n<br />\nTHE GIANT<br />\nPOWER FUEL<br />\n<br />\nE S S0<br />\n<br />\nNEW LIFE<br />\nFOR MOTORS<br />\n<br />\n\"STANDARD\" MOTOR OIL<br />\nThe Measure of Oil Value<br />\n<br />\nDIAMONDS<br />\n<br />\nMfrs. of Fraternity Goods of All Kinds<br />\nPARK BANK BUILDING<br />\n504<br />\ninwere<br />\nbrethren<br />\nThe<br />\n<br />\nSo on.<br />\nformed that two days past the<br />\nMarch new moon a renowned<br />\nknight, well known for his industry in the aeronautical world,<br />\nwould grace the platform of the<br />\nassembly hall. Downtrodden firstclssmen announced informally<br />\nthat their presence in the rooms<br />\nwould be noted. The college was<br />\ncaptured by General Riot plus Colonel Storm. Despite the presence<br />\nof these two worthies, the day arrived, and with it the sun, not a<br />\nMinute behind its scheduled appear,<br />\nance. The captives took occasion to<br />\nlock-step into the immense hall, taking advantage of the major beat accented by the drums of a hidden<br />\norchestra and the concealed machine<br />\nguns (provided to give a home atmosphere to visiting students from<br />\nHonest Bill Thompson's territory).<br />\n<br />\n0<br />\n<br />\nM<br />\n<br />\nSTANDARD OIL COMPANY OF N. J.<br />\n<br />\n(Lexington at Liberty Ste.)<br />\n<br />\nWhere<br />\n\"good enough\"<br />\nisn't<br />\nHE \"sax\" wails. The brass blares. The<br />\nT<br />\ndrum's deep voice speaks. Yet all is perfect<br />\nharmony—when every player puts his best into<br />\nhis part.<br />\nAnd the same is true in industry.<br />\nAt Western Electric the making of telephone<br />\nequipment for the Bell System is based on constant improvement in the harmonious interweaving of pure science, manufacturing and economics.<br />\nHere,chemist,physicist,electrical and mechanical engineer work together. Purchase engineer<br />\nand laboratory research engineer develop new<br />\nstandards of purchasing. Traffic engineer and<br />\nmerchandising executive improve upon the<br />\nmethods of distribution.<br />\nNor has the end of all improvement been<br />\nreached. Every adventure in harmony paves the<br />\nway for another, perhaps greater.<br />\n<br />\nes/tern Electric<br />\n<br />\nSINCE<br />\n<br />\n1882 MANUFACTURERS FOR THE BELL SYSTEM<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 20, 1928<br />\nPhone, CAI. 1380<br />\n<br />\n5<br />\n<br />\nHome—HO. 2095-J<br />\n<br />\nFRANCES T. BANNON<br />\nSuccessor to HARBAUGH & BANNON<br />\n<br />\nNEW<br />\n<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\n(Room 28)<br />\nStenographic Dictation, Copying,<br />\nMultigraphing, Mimeographing<br />\nBaltimore, Md.<br />\n<br />\nFORDS<br />\n<br />\nUSED<br />\n<br />\nThe City of Happiness Is in the State of Mind<br />\nSee FORDYCE CAMPBELL - AETNAIZER<br />\n<br />\nCHARLES B. HINES '27 Un. 0447<br />\n<br />\n9th Floor Citizens Nat'l Bank Bldg. Plaza 1062<br />\nLIFE - ACCIDENT - HEALTH - AUTO - LIABILITY -<br />\n<br />\nThe Backus Motor Co. Ver.4300<br />\n10 E. NORTH AVENUE<br />\n<br />\ng<br />\njE<br />\nli<br />\n<br />\ne<br />\n<br />\nL<br />\n<br />\n1<br />\n<br />\n\"One of the leading tobacconists in<br />\nBaltimore says:\"<br />\n\"The rapid growth in the popularity of OLD<br />\nGOLD Cigarettes among the students is remarkable. Never in my experience have I seen a new<br />\ncigarette catch on so quickly with the boys on<br />\nthe campus.\"<br />\n<br />\nE. E. ADAMS<br />\n\"The Barn\"<br />\n<br />\nJohns Hopkins University<br />\n<br />\n•!•:•:•:•:•:•:•2,<br />\n•••••••:•!•!•:•••<br />\n<br />\n\"<br />\n<br />\n•<br />\n<br />\nY'Affe4'<br />\n'<br />\n<br />\nFor a most refreshing change:<br />\n\"Follow your friends and<br />\nswitch to this smoother<br />\nand better cigarette\"<br />\n0 P.Lorillard Co., Est. 1760<br />\n<br />\nf:1<br />\n<br />\nFIRE<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 20, 1928<br />\n<br />\n6<br />\n<br />\nBy CAROSSEL.<br />\nWith the recognition of lacrosse<br />\nby the international czars of sport,<br />\nthe Olympics Committee, the stick<br />\ngame has been given a great stimulus everywhere, and begins to assume the importance in the world<br />\nof athletics due to a game requiring the utmost in physical and mental ability. After many conferences<br />\nand their attendant lengthy discussions the Olympic lacrosse committee decided to send the championship team as a whole instead of an<br />\nall-star team to Amsterdam in June.<br />\nAs a result of this decision all eyes<br />\nare focused on the Hopkins twelve<br />\nas one of the principal contenders<br />\nfor the 1928 lacrosse crown.<br />\n<br />\nFAREWELL ADDRESS OF<br />\nREMSEN GIVEN HOPKINS<br />\nrecently<br />\n<br />\nPhi Beta Kappa Gives<br />\nLibrary Donation<br />\n<br />\nON THE CREASE<br />\n<br />\nPhi Beta Kappa has<br />\ndonate dfifty dollars to the library<br />\nhere. This sum is for the purchase of new books for the current literature shelf, and only recent books of current interest are<br />\nto be bought. Dr. French, the<br />\nlibrarian, hopes that this donation will lead to many more, for<br />\nthe Hopkins library is not very<br />\nwell equipped with current literature. The Phi Beta Kappa<br />\nSociety has inaugurated a worthy<br />\nmovement.<br />\nAlready four books have been<br />\nH. M.<br />\npurchased. They are:<br />\nReach,\"<br />\n\"Galion's<br />\nTomlinson's<br />\nMark Sullivan's \"Our Times,\"<br />\nHuddleston's \"Gentleman Johnny Burgoyne,\" and Robinson's<br />\n\"Roan Stallion.\" Other books are<br />\nto be purchased soon.<br />\n<br />\nou Jo get More<br />\nMilea5e fro<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nThis point will go hard with the<br />\nweaker teams and defeat one of the<br />\nmajor plans of the Intercollegiate<br />\nAssociation decided upon early in<br />\nthe winter, namely, that of not running up large scores on weak opponents. With every game an Olympic tryout, it is quite natural that<br />\nevery team will try to run scores as<br />\nhigh as possible in every game.<br />\n<br />\nMILES OFSMILES<br />\n<br />\nBETHOLIN-E<br />\nTHE<br />\n\"<br />\n<br />\nPresent<br />\n<br />\n\"THE CHAMPION\"<br />\n<br />\nUniversity Presented Book<br />\nof Former President<br />\n<br />\nMr. Robert F. Skutch, Baltimore<br />\nantique dealer, has presented the<br />\nUniversity with a portfolio containing the farewell address of Dr.<br />\nRemsen. The folio was purchased<br />\nlast year at the auction of Dr. Remsen's effects. That the University<br />\nshould come into possession of this<br />\nspeech is most fortunate, as the<br />\nworld is just beginning to recognize the true value of the work done<br />\nby this great chemist. Mr. Skutch<br />\nis the father of Robert F. Skutch,<br />\nJr., who is a student here.<br />\n* * *<br />\nDr. Goodnow has officially accepted the gift from Mr. Skutch,<br />\nFor the past two years the United<br />\nwhose letter presenting it, is printed<br />\nStates Intercollegiate Lacrosse Asin full below.<br />\nsociation has seen fit to bestow stick GARFIELD AT ASSEMBLY<br />\nMarch 1, 1928.<br />\nlaurels on the Jay twelve. For the<br />\nGoodnow,<br />\nJ.<br />\nFrank<br />\nDr.<br />\n(Continued From Page 1, Column 1)<br />\ncoming season ten of last year's<br />\nJohns Hopkins University,<br />\nveterans will be back in the blue American politicians have made the<br />\nBaltimore, Md.<br />\nuniform—Finn,Leibensperger, Mal- Japanese feel that America thinks<br />\nMy dear Dr. Goodnow: I<br />\nlonee, Roy, Dotterweich, Boynton, herself too good to have Orientals<br />\nrecently learned of the redediLang, Farinholt, Biddison and Lo- here. It is mistakes like these<br />\ncation of the Chemistry Buildgan. The greatest handicap in last which cause friction between two<br />\ning, as \"Remsen Hall\" and the<br />\nseason's hard schedule proved to countries.<br />\nburial therein of the ashes of<br />\nAt the University of Hawaii all<br />\nbe the lack of strong reserve matethe late Dr. Remsen.<br />\nrial. With more than thirty prom- races mix and it is here that they<br />\nAt the dispersal of the efising candidates to develop, Coaches learn to understand each other.<br />\nfects of Dr. Remsen last year<br />\nI purchased the \"Farewell<br />\nSchmeisser, Van Orman and Dar- One finds, also, that the high post<br />\nOrion<br />\ndown<br />\nlook<br />\nold<br />\nwe<br />\nof<br />\nwhich<br />\nhost<br />\nthe<br />\nto<br />\nfrom<br />\nin<br />\nAddress\" presented to him by<br />\naddition<br />\nley,<br />\nhis colleagues on the occasion<br />\nstars who are to be seen daily watch- entals is met by an equally tall<br />\nof his retirement from the<br />\ning practice, this handicap is prac- pedestal of theirs.<br />\npresidency. In the back of the<br />\nIt is discussion in this kind of<br />\ntically overcome.<br />\nadvances<br />\nthat<br />\n\"Address\" are the signatures<br />\nfriendly atmosphere<br />\n* * *<br />\nof the donors.<br />\nthe world. Behind the legislature,<br />\ngroups<br />\ninformal<br />\nI am sending you the portthese<br />\nare<br />\nit,<br />\nhelping<br />\nThe football team has turned out<br />\nthinkthe<br />\nwith this letter. Should<br />\nfolio<br />\nIt's<br />\n.<br />\nWilliamstown<br />\nat<br />\nIndian<br />\nthe<br />\nup<br />\nen masse to take<br />\nnot<br />\nis<br />\nfind it worthy<br />\nthe<br />\nUniversity<br />\nspeaker<br />\n'<br />\nthe<br />\nin<br />\nwhich<br />\ning<br />\nhowever,<br />\npositions,<br />\nDefense<br />\ngame.<br />\nwill be much<br />\nI<br />\nresolutions<br />\nacceptance,<br />\nof<br />\npass<br />\nhave proved to be much more popu- called upon to<br />\nbeen able to<br />\nhave<br />\nto<br />\nintelpleased<br />\nbest<br />\nthe<br />\nforward<br />\nputs<br />\nlar than the attack, even with a hard which<br />\nto the<br />\naddition<br />\nthis<br />\ncontribute<br />\nefforts.<br />\nlectual<br />\nworking linesman. Evidently they<br />\ndear<br />\nour<br />\nof<br />\none<br />\nof<br />\nmemory<br />\nGeis<br />\nmen<br />\nat<br />\nof<br />\nbody<br />\na<br />\nSuch<br />\ngivof<br />\ncan appreciate the prospect<br />\n\"old-timers.\"<br />\ning someone else the wood instead neva.<br />\nWith best wishes,<br />\nMany people think the United<br />\nof receiving the legs.<br />\nYours,<br />\nthe<br />\nenter<br />\nto<br />\nready<br />\nisn't<br />\nStates<br />\n* * *<br />\nROBERT F. SKUTCH.<br />\nLeague of Nations; but it is Dr.<br />\nthe time is<br />\nDal Strader, captain-elect of the Garfield's opinion that<br />\nbefore.<br />\never<br />\nthan<br />\nripe<br />\nmore<br />\n'28 football team, is highly enjoying<br />\nThe reason for so much dissatis- Catalog Is Issued<br />\nhis job of wing defense. Despite<br />\nof Versailles<br />\nthe fact that the Indian game is en- faction with the treaty<br />\nFor Summer School<br />\n7<br />\nalley<br />\nHOPKINS—G<br />\ntirely new to him, he seems to get<br />\nThe catalog for the Summer<br />\nis that when this treaty was drawn<br />\nhis man every time.<br />\nto be given in 1928 has<br />\nCourses<br />\nit.<br />\npolish<br />\nto<br />\ntime<br />\nno<br />\nwas<br />\nthere<br />\nup<br />\nDave Kaufman, hard-working<br />\nThis is the eighteenth<br />\nissued.<br />\nbeen<br />\nto be slipped<br />\nfootball linesman and basketball Some questions had<br />\nCourses, which<br />\nSummer<br />\nthe<br />\nof<br />\nle<br />\nyear<br />\nundesirab<br />\nsome<br />\nguard, also backbone of the Red through and<br />\nJune 25,<br />\nMonday,<br />\non<br />\nbegin<br />\nwill<br />\nqueslarge<br />\nwhile<br />\nby,<br />\ngo<br />\nlet<br />\nEagles for the past four years, suf- clauses<br />\nuntil Friday, August<br />\ncontinue<br />\nbe<br />\nand<br />\nto<br />\ntable<br />\nthe<br />\non<br />\nplaced<br />\nwere<br />\ntions<br />\nfered a serious injury in his first<br />\nThe result of this 3. Dr. Edward F. Buchner is<br />\nscrimmage last Friday, which will voted on later.<br />\nthe treaty is quite again Director of the Summer<br />\nprobably keep him out of the game hurry was that<br />\nCourses. Among the eminent inmixed.<br />\nfor the rest of the season.<br />\nin the courses this year<br />\nof<br />\nstructors<br />\ndevice<br />\nthe<br />\nfor<br />\nbeen<br />\nnot<br />\nit<br />\nHad<br />\n* * *<br />\nthe Court of the League of Na- are Dr. E. Raymond Turner, Protions this mix would have ended in fessor of Modern European HisHouston, also a linesman, and<br />\nthe wreck of the treaty. It was tory; Dr. H. Carrington Lancaster,<br />\nCaplan and Bobby Lyons, backfield<br />\ndue solely to this Court, proposed Professor of French Literature;<br />\nplayers, are showing up well on the<br />\nand assiduously adhered to by Dr. Rheinhart P. Cowles, Associattack. Houston's long training for<br />\nWilson, that the treaty was saved. ate Professor of Zoology; Dr.<br />\nend runs and long forward passes<br />\nmen at Geneva are representa- Broadus Mitchell, Associate ProThe<br />\nis serving him well for his work at<br />\nof their several nations and fessor in Political Economy; Dr.<br />\ntives<br />\ncenter. Caplan and Lyons are putform a continuous body to settle all John B. Musselman, Associate Proting their experience at broken field<br />\nquestions on the table and to rectify fessor in Mathematics; Dr. Robert<br />\nrunning to good advantage in the<br />\nall undesirable clauses in the treaty. B. Roulston, Associate Professor<br />\nclose attack positions.<br />\nTheir purpose is to maintain the of German; Dr. John E. Uhler, In* * *<br />\nstructor in English; and Dr. David<br />\npeace of the world.<br />\navailall<br />\nto<br />\nsent<br />\n(Continued on page 7, Column 2)<br />\n4)<br />\nIn a long letter<br />\n(Continued on Page 7, Column<br />\nable college and club teams Satur<br />\nday by Charles Ornstein, president,<br />\nand Caspari, Wylie, secretary of<br />\nthe Olympic lacrosse committee, the<br />\nmethods of choosing the championship team to go to Amsterdam was<br />\ncarefully explained. First, and most<br />\nimportant, every game played during the season is to be considered<br />\nas an Olympic tryout.<br />\n*<br />\n<br />\nTHE BARNSTORMERS<br />\n<br />\nWONDER MOTOR FUEL:'<br />\n<br />\nLYRIC THEATRE<br />\nFriday, March 23 — Saturday, March 24<br />\n<br />\nWhether you wear a<br />\nhatjauntily,or whether<br />\nyou wear a hat soberly<br />\nand sedately, Stetson<br />\noffers you a choice for<br />\nyour every mood and<br />\nfancy.<br />\nEight to<br />\nForty Dollars<br />\n<br />\n•<br />\n<br />\nSTETSIN HATS<br />\newforyoulyncen<br />\n<br />\nCLOTHES<br />\nIteady-nsad•<br />\nAnd Cut to Order<br />\nESTABLISHED ENGLISH UNIVERSITY<br />\nSTYLES, TAILORED OVER YOUTHFUL<br />\nCHARTS SOLELY FOR DISTINGUISHED<br />\nSERVICE IN THE UNITED STATES.<br />\n<br />\n.. ,<br />\n<br />\nCharter howe<br />\nSuits $40,$45,$50 Topcoats<br />\n<br />\nimb<br />\n<br />\nBY SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br />\n<br />\nThar-ter<br />\nOF BALTIMORE<br />\n<br />\nThe character of the suits and<br />\ntopcoats tailored by Charter House<br />\nwill earn your most sincere liking.<br />\n<br />\n/he<br />\n<br />\nRub<br />\n<br />\nBALTIMORE<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 20, 1928<br />\nGARFIELD AT ASSEMBLY<br />\n<br />\nSUMMER COURSE CATALOG<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWS<br />\n4t-<br />\n<br />\n\"What the college boy needs,<br />\nWill Rogers, the stage celebrity, is<br />\nquoted in a recent issue of a Greek<br />\nletter fraternity magazine as saying, \"is narrower pants and broader<br />\nmind.\" How about the college<br />\ngirl?<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nIn a recent editorial the editor<br />\nof the \"Cornell Daily Sun\" violently<br />\ndenounces what he terms the -ridiculous action of the student council<br />\nat that institution for refusing to<br />\npermit publication of the minutes<br />\nof its business meetings, on the<br />\ngrounds that they are nobody's<br />\nbusiness. The fiery-hearted writer<br />\nreminds the council that they are<br />\nelected by the undergraduates and<br />\nare directly responsible to them, so<br />\nwhy attempt to keep them in ignorance of their own affairs which<br />\nwould at least only serve to confirm their opinions that the council<br />\ndoes nothing.<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nAt an Inter-fraternity Conference held last February it was<br />\nfinally agreed to abolish hell week<br />\nfor fraternities at Penn State.<br />\nForty-one national fraternities and<br />\nthirteen locals agreed in arriving at<br />\nthis decision.<br />\n*<br />\n<br />\n*<br />\n<br />\n(Continued from page 6, Column 3)<br />\n<br />\nE. Weglein, Associate Professor in<br />\nEducation. Education is being<br />\nespecially stressed during this session, 39 courses being given, in this<br />\nsubject, 39 courses being given in<br />\nthis subject.<br />\nThe Alumni Memorial Hall, as<br />\nformerly announced, will be opened<br />\nfor the students in the Summer<br />\nCourses. Sections A, B, C, and E<br />\nare reserved for women.<br />\n<br />\nHave You Voted<br />\nin the<br />\n<br />\nNews-Letter<br />\nPresidential Election<br />\nPolls close Saturday<br />\nnoon<br />\n<br />\nA<br />\n<br />\n(Continued from Page 6, Column 2)<br />\n<br />\nYELLOW CAB STAND<br />\n\"But in the last ten years there<br />\nAT<br />\nhas been only political malice and<br />\nHOMEWOOD FIELD<br />\nhatred on all sides. It will be only<br />\nmisunderwhen we brush this<br />\nNo Charge for Extra Passengers<br />\nstanding and hatred to one side and<br />\n'PHONE<br />\nget to the question with the same<br />\nVERNON 1212<br />\nspirit as Wilson's that we shall<br />\nhave peace. And the only method<br />\nFOR A<br />\nadequate to obtain this peace and<br />\nYELLOW CAB<br />\npreserve it is the League of Nations.\"<br />\n<br />\n\"I Always Have Luckies\"<br />\nsays Betty Compson,<br />\nMotion Picture Star<br />\n\"The strain of constant posing before a<br />\ncamera is sometimes great. A few puffs<br />\nfrom a good cigarette is the quickest relief.<br />\nI always have Luckies on the set. They<br />\nsoothe without the slightest throat irritation.\"<br />\nor-eni<br />\n<br />\n*<br />\n<br />\nRumbles of protest and complaint<br />\nare steadily being heard from a<br />\nnumber of colleges against so-called<br />\ncollege pictures which have lately<br />\nbeen flooding the motion picture industry, and falaciously picturing<br />\naspects of college life to agree with<br />\ntheir popular conception. Two<br />\nhundred a,nd fifty Princeton sophomores recently signed a petition requesting a true dramatization of<br />\ncollege life or a complete relinquishment of the practice.<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nRather curious and unusual information was recently published by<br />\nthe student publication of the University of Kansas concerning cheating by the undergraduates. According to replies from a questionnaire<br />\nwhich was submitted to the students,<br />\nthree of them cheat for everyone<br />\nthat refuses to do so. Over 300<br />\nconfess that they give or receive<br />\nassistance occasionally, while 110 replied to a negative; 4 men cheat<br />\nregularly, while little over 100 state<br />\nthat it is unjustifiable; 25 have<br />\ngreater, and 50 less respect of the<br />\nstudent who refuses to crib regardless of the faults of the system;<br />\nmore than 100 think cheating permissible \"when questions are catch<br />\nquestions and the professor plays<br />\nthe part of a watchdog.\"<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nA rather unusual honor system<br />\nhas recently been adopted by Southwestern College in direct accord<br />\nwith the modern trend toward<br />\nhigher learning. Every student registering in what is termed an Honor<br />\nCourse will be exempt from one<br />\ncourse every semester to follow out<br />\nhis independent work and will consequently be excused from all examinations.<br />\n*<br />\n<br />\n*<br />\n<br />\nThe Cream of<br />\ntheTobacco Crop<br />\n<br />\n*<br />\n<br />\nSince 1916, at Wisconsin, the<br />\nMen's Student Senate has been the<br />\nsupreme arbiter in student affairs.<br />\nIn October the members voted to<br />\ndisband, after deciding that their<br />\nactual powers were too few and of<br />\ntoo little importance. Self-government will now be meted out by five<br />\nadministrative boards. Centralization will be brought about by the<br />\nunion of the chairmen of these<br />\nbodies only in the supervision of<br />\nstudent elections. Otherwise there<br />\nWill be no central board of control.<br />\n<br />\n„<br />\n<br />\n66<br />\n<br />\nt's toasted\"<br />\nNo Throat Irritation-No Cough.<br />\n<br />\n01928, The American Tobacco Co., Inc.<br />\n<br />\n\"Unquestionably Lucky<br />\nStrike Cigarettes are 100%<br />\nquality as this fact is proven<br />\nby their increasing popu•<br />\nlarity. Only the best tobac•<br />\nco,`The Cream ofthe Crop'<br />\ngoes into Lucky Strike Cigarettes. I buy only the<br />\nbest tobacco for Lucky<br />\nStrike Cigarettes.\"<br />\n<br />\naa<br />\nTobacco Buyer<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 20, 1928<br />\n<br />\nHOOVER TIES SMITH<br />\nIN STUDENT VOTES<br />\n<br />\nTennis Squad Has<br />\nFirst Work-Out<br />\n<br />\nWHENCE CHEN, Importer<br />\n(A JOHNS HOPKINS STUDENT)<br />\n<br />\nDemand<br />\n<br />\nTen candidates for the Hopkins 9 W. CENTRE,ST.(at N. Charles)<br />\nGiftsfrom China, all kinds<br />\ntennis team had their first work15% off for Hopkins men and friends<br />\nCandidates for Presidency<br />\nout of the season last Tuesday at<br />\nTotal 43 Votes Each<br />\nthe Fifth Regiment Armory. The<br />\nnumber of aspirants was disapRainy weather and threatening pointing, but many more are exThe NORMAN-REMINGTON CO.<br />\nskies seem to have turned campus pected as soon as the outdoot<br />\nSTORE. 347 N.CHARLES ST.<br />\nMAIN<br />\nminds toward flood control and courts are opened.<br />\n1217 N. Charles St<br />\nBargain,<br />\nBranch<br />\nconsequently to Hoover, who has<br />\nThe object of the indoor pracprofited by the adverse elements tices is to limber up the men and<br />\nto overtake Governor Smith in enable Captain Proctor and Manthe straw vote being conducted agerr. Polan to get a line on the canby the NEWS—LETTER.<br />\ndidates before the southern trip,<br />\nPossibly the same wetness which the team will take during<br />\nwhich benefited Hoover worked the Easter holidays.<br />\nthe opposite results in the case of<br />\nCaptain Proctor was the only<br />\nSmith, whom voters may have veteran who attended the practice<br />\nconsidered wet enough already. Tuesday, Craig, Gould and Gump,<br />\nFree Staters continue to ballot members of last year's freshman<br />\nfor their Governor, but not heav- team, reported; and Ed Wyatt and<br />\nily enough to bring him above<br />\nDan Leonard were also on hand.<br />\nthird place.<br />\nSeveral promising freshmen comVice-President Dawes has at<br />\nnumber to turn out.<br />\nlast secured a lone adherent at pleted the<br />\nEd Devereux, who played numHopkins, and Walsh has also sucof<br />\nnumber<br />\nA<br />\nscoring.<br />\nceeded in<br />\nber one man on the freshman team<br />\nothers have failed to find any last year and Stephen Fitzgerald,<br />\nbackers on the local campus.<br />\nwho made an enviable reputation<br />\nLatest results are shown bein prep school ranks, failed to atlow:<br />\ntend practice, but they are expected<br />\nRepublicans.<br />\nDemocrats.<br />\n43 Hoover..... 43 to report in the near future.<br />\nSmith<br />\nThe condition of the men and<br />\n32 Lowden.... 10<br />\nRitchie<br />\nReed.........3 Willis...... 4 the class of tennis displayed were<br />\n1 better than expected. An interestWalsh ......... 1 Dawes<br />\ning doubles match was played beSaturday,<br />\nPolls will close<br />\ntween Proctor and Wyatt, on the<br />\nNuAs'• —4<br />\n426,<br />\nMarch 24, at noon.<br />\n8 million a day —IT HAD<br />\none side, and Leonard and Gump,<br />\non the other.<br />\n<br />\nBOOKS<br />\n<br />\nThe Original<br />\nSPECIAL MOTOR FUEL<br />\n<br />\njAMOCO-GA,S(<br />\n<br />\n\"Halloo your name,to<br />\nthe reverberate hills,<br />\nand make the babbling<br />\ngossip of the air cry out\"<br />\nThe Bard of Avon gave much<br />\ngood advice. And this piece certainly has been followed by<br />\nCoca-Cola:<br />\nThe drink you read about. And<br />\nthe little red sign brightens the<br />\nstreets and corners of cities and<br />\ntowns everywhere, its name more<br />\nfamiliar than the names of the<br />\nstreets themselves.<br />\nThe Coca-Cola Compacy, Ar:actc, G.<br />\n<br />\nTO<br />\n<br />\nDr. Beardsley To Speak<br />\nAt Next Assembly<br />\nDr. \\V. A. Beardsley, who will<br />\nbe the speaker at the assembly<br />\nthis Thursday, has announced a<br />\ntopic of particular interest. The<br />\nsubject is \"What is Real Literature?\" The recent discussions in<br />\nthe NEWS—LETTER, and around the<br />\ncampus in generaL on the subject<br />\nof literature courses and examinations have stimulated unusual<br />\ninterest in this subject, and Dr.<br />\nBeardsley has kindly consented<br />\nto express his views'in this regard.<br />\nDr. Beardsley, who received his<br />\nA. B. from Yale, was awarded his<br />\nDoctor's degree in romance languages after several years. Of<br />\nstudy at Columbia University. In<br />\n1921 he was appointed'head of the<br />\nromance language department at<br />\nGoucher College, and he has held<br />\nthis position since that. time.<br />\nJoseph G. Blandi, president of<br />\nthe student council, announces<br />\nthat there will be a roll call of<br />\nmembers of the two lower classes,<br />\nand that those who exceed the<br />\nspecified allowance of cuts will<br />\nbe severely dealt with by the<br />\nauthorities.<br />\n<br />\nFOR ONE TTI-IING-THEY'RE MILD;<br />\nAND WHAT'S MORE _THEYSATISFY!<br />\n<br />\nNew Faces Are Seen<br />\nIn Remsen Offices<br />\nNew faces have taken the place<br />\nof old familiar ones-in the .office of<br />\nthe President and Provost. Due,<br />\nrespectively, to illness and the call<br />\nof matrimony, Miss •Saile Ellender<br />\nand Miss Mildred Leedy are not<br />\noccupying their accustomed desks<br />\nin Remsen Hall. Miss Ellender,<br />\npopular secretary to the Dean, has<br />\nbeen suffering from a nervous<br />\nbreakdown for some time, but is<br />\nexpected back shortly.<br />\nMiss Leed3,, left the University<br />\nlast Saturday to enter upon the turbulent sea of matrimony. She has<br />\nbeen in the president's office' for<br />\nnearly four. years. Miss Carrie<br />\nLoss, formerly in the registrar's<br />\noffice, is taking her place. Miss<br />\nLavareHajs- taking'Miss Ellender's<br />\nplace temporarily.<br />\n<br />\nMILD enough for anyone's taste,<br />\nmilder in fact than most cigarettes<br />\nand yet,they do what you've always<br />\nwanted a cigarette to do—<br />\nTHEY SATISFY!<br />\n<br />\nCii ESTERIFI ELI)<br />\nCIGARETTES<br />\n<br />\nLIGGETT & WEBB TOBACCO CO.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXXII, No. 42<br /><br />\nGARFIELD ADDRESSES<br />\nTHURSDAY ASSEMBLY<br />\nWas Founder and Erector of.<br />\nInstitute of Politics<br />\nATTACKS U. S. ATTITUDE<br />\nDeclares Isolation No<br />\nLonger Possible<br />\n\"During the past seven years<br />\nsince we have been conducting the<br />\nrnstitute of Politics at Williamstown,\" said Dr. Garfield in his talk<br />\nat the 'assembly Thursday, \"many<br />\ninteresting people and subjects have<br />\ncome before us.\" Dr. Garfield is<br />\nthe founder and erector of this institution and it was his purpose<br />\nThursday to give some idea of the<br />\nthings and forces behind- political<br />\nphenomena of today.<br /><br />\nHOMEWOOD, BALTIMORE, MD., MARCH 20, 1928<br /><br />\nBLACK AND BLUE JAY<br />\nTO DINE APRIL 14<br />\nMembers of the Black and<br />\nBlue Jay editorial and business staffs will gather at the<br />\nSouthern Hotel on the night<br />\nof April fourteenth for their<br />\nannual banquet.<br />\nAccording to Leonard Dalsemer, business manager of<br />\nthe Jay, this date is permanent<br />\nbut the location is not as yet<br />\ndefinite. Election of men to<br />\nthe Board of Control for the<br />\nensuing year will be held at<br />\nthis time.<br /><br />\nLarge Number Out<br />\nFor Lacrosse Squad<br /><br />\nMEMORIALS PLACED<br />\nIN ENGINEERING HALL<br />\nP. G. Turnbull and W. King<br />\nAre Honored<br />\nIn fulfillment of the request of<br />\nMrs. Frances L. Turnbull, and the<br />\nwill of the late Mrs. Rebecca Lanier King, memorials have been<br />\nplaced in the Civil Engineering<br />\nLecture Hall.<br />\nAbove the entrance at the northern side of the hall is the Turnbull<br />\nmemorial, which consists of a<br />\nbronze plate imbedded in a gray<br />\nstone foundation. The inscription<br />\non the plate is as follows:<br /><br />\nSHARRETTS TO HEAD<br />\nNEW GREEK BOARD<br />\nDonald Sharretts, Phi Gamma Delta, was elected president, and Steward L. Smith,<br />\nDelta Phi, secretary-treasurer<br />\nof the 1928-29 Interfraternity<br />\nBoard at the regular meeting<br />\nof the board held yesterday in<br />\nthe M. E. Building.<br /><br />\nJOHN DESCH TO PLAY<br />\nAGAIN FOR `STORMERS<br /><br />\nPRICE 5 CENTS<br /><br />\nUNIVERSITY CHANGES<br />\n1928 CURRICULUM<br />\nChanges in Political Science,<br />\nEconomy and French<br />\nGRADES DECIDE CREDITS<br />\nFrench 2 and 3 to be Given<br />\nin Alternate Years.<br /><br />\nChanges have been made in the<br />\ncurriculum for next year in Political<br />\nEconomy, Political Science, and<br />\nStar of Former Years<br />\nFrench. Dr. Ames explained that<br />\nTo Return to Stage<br />\nthis<br />\nis due to a desire to increase the<br />\nTo Cherish thre Memory of Their Son,<br />\nvariety<br />\nof courses offered to the<br />\nPERCY GR,EME TURNBULL .<br />\nThe cast of the Barnstormers'<br />\nBorn May 28th, 1878—Died February<br />\nstudent.<br />\nmaterial<br />\nboost<br />\nlast<br />\nwas<br />\ngiven<br />\na<br />\n12th, 1887.<br />\nLAWRENCE AND FRANCES L. TURNBULL Thursday evening when John EdFour undergraduate courses will<br />\nFounded the Lectureship on Poetry in win Desch, former Barnstormer<br />\nbe<br />\ngiven in Political Economy. EleThis University, May 28th, 1887.<br />\nintention of<br />\nHis Passionate Love of Beauty Sug- star, announced his<br />\ncoming out for the play. Desch, ments of Economics will be given<br />\ngested This Memorial of His<br />\nBrief Aspiring Life.<br />\nwho is taking several courses at three hours weekly throughout the<br />\nThe will stipulated that this tab- the University this year, has been year by Dr. Mitchell and Dr. Evans<br />\nlet be placed in the room in which assisting in the coaching of the<br />\nin three sections, all at eight-thirty.<br />\nlectures are usually given and it female roles thus far, and, accordalso required, as has been . an- ingly, will be able to step into his First-year students are not eligible<br />\nnounced•before,\"that in each course part with little difficulty. He will to this course. The class in statisof lectures delivered there should play the part of \"Mary Bur- tics will be taught by Dr. Evans at<br />\nbe an explicit and reverent recog- roughs,\" the younger sister of the eleven thirty during the first three<br />\nnition of God as the infinite source \"Champion.\"<br />\ndays of the week. Mathematics 1<br />\nof all Love and Truth and Beauty,<br />\nDesch, who entered Hopkins or 01 is the prerequisites. Political<br />\nand an earnest and'sincere affirmain the fall of 1922, played the fe- Economy 3 and 4, or Money Banktion of the Holiness of Beauty and<br />\nmale lead as a freshman, and was ing, Exchange, and Economic Histhe principle that all true and enone of the two men who ever have<br />\nduring art must be permeated with<br />\ntory will be given in the School of<br />\nbeen elected to the Barnstormer<br />\nthe purest morality.\"<br />\nclub in his freshman year. In his Business Economics. Students for<br />\nPortrait Displayed<br />\nthree subsequent years at Hop- the A. B. degree who have comkins,<br />\nDesch played the female pleted 1 and 2 will be admitted on<br />\nPlaced simultaneously with this<br />\nsince his graduation, in the approval of the instructor. This<br />\nleads,<br />\nand<br />\nplacard was the portrait of the late<br />\nrendered invaluable<br />\n1926,<br />\nhe<br />\nhas<br />\nMr. Wallace King. The portrait,<br />\nwill only be given to those students<br />\nwhich is located above the south assistance in coaching the female who have shown their interest and<br />\nentrance to the hall, is displayed impersonaters in the several Barnability in the subject.<br />\naccording to the requests of the stormer productions.<br /><br />\nWith seventy men out for berths,<br />\nthe Hopkins lacrosse squad is waging a bitter battle for positions, according to Dr. Ray Van Orman,<br />\nhead coach of athletics.<br />\nBesides those remaining from<br />\nCommunication Easier<br />\nlast year's twelve, are many men<br />\nEveryone is moving forward to who are showing up much better<br />\nmeet inevitably the problems of the than they did last year. Among<br />\nworld. Each has to do his share. these men are Egan, Herpsberger<br />\nWashington wisely talked against and Sharretts, who have been used<br />\nentangling America in foreign, alli- on the attack and were substitutes<br />\nances. But, in Washington's day on last year's championship team.<br />\ncommunication was difficult and we The new men doing good work<br />\nwere really out of touch with other are also football men; namely,<br />\nnations. Today, however, all is Lyons and Caplan. The former,<br />\nchanged. With communications ad- especially, is doing some remarkvancing so steadily, the world is able work, proving to be well<br />\never being - made smaller. Peoples adapted to the sport.<br />\nare coming closer and closer.<br />\nThose trying for the center posiThe result of this cutting down tion that are outstanding are Housof distance is that the radius of ton and Nichols.<br />\nNichols was on<br />\nour dealings is widening with our the squad last year and was used<br />\nincreased knowledge of others. as a wing defense.<br />\nThis broadening has continued unThe defense positions for this<br />\ntil the United States is the center of<br />\nyear's squad are being contested by<br />\nPower today. The great question<br />\nnow is what shall we do with this several good men, according to the<br />\ncoach. Covell, who was used as a<br />\nWorld which is becoming so small.<br />\ncenter last year, is showing up well will of his .widow, the late Mrs. Desch made his Hopkins debut<br />\nin \"The Purple Mask\" in 1928. In<br />\nConfucius' Idea<br />\non the wing defense. Piet, out for Rebecca Lanier King.<br />\n\"The<br />\nGalloper,\" presented in 1924,<br />\nAt the same time, Mrs. King beConfucius saw the history of a while last year, is also giving his<br />\nplayed opposite Gordon<br />\nDesch<br />\nmankind unrolled before him as a opponents on the defense a hard queathed $50,000 to establish two<br />\nmale lead. In 1925 he<br />\nPost,<br />\nthe<br />\nscroll; saw the people pass-from one fight for a berth. Others men- lecture funds. Further, Mrs. King's<br />\nthe<br />\nfemale lead opposite<br />\nplayed<br />\nwill<br />\nstipulated<br />\nthat<br />\none-half<br />\nof<br />\nthe<br />\nstage of barbarism to another until tioned as performing well are Powin \"The Tailor<br />\nI.<br />\nEvans<br />\nRodgers,<br />\nbe<br />\nresidue<br />\nof<br />\nher<br />\nestate<br />\nused<br />\nto<br />\nesthey reached a state of semi-tran- ell, Strader, Hall, Keating, KaufMade Man,\" and in his senior year<br />\ntablish<br />\na<br />\nstudent<br />\nloan<br />\nfund.<br />\nman<br />\nand<br />\nSchwartz.<br />\nquillity. Today each nation is arfemale lead opposite<br />\nGoalies are also well represented, The money offered in these be- he played the<br />\nrayed against the others—whether<br />\nMajesty Bunker<br />\n\"His<br />\nHiss<br />\nin<br />\nAlger<br />\nit is in peace time competition or Frank Cone and Browley doing quests was derived by Mrs.. King<br />\nBean.\"<br />\nfrom<br />\nher<br />\nhusband's<br />\nestate.<br />\nwar. It was Confucius' idea that good work. Armstrong and TaMr. King died nearly twenty<br />\nat some time in the future this ban, freshmen, are doing well, also,<br />\nWorld would reach a permanent but need more experience in the years ago, and was known as the<br />\ndeveloper of Elderslie, a Mount John Eldridge Elected<br />\ntranquillity, and Dr. Garfield is of Indian game.<br />\nthe opinion that we are on the verge<br />\nA group of about twenty fresh- Washington suburb.<br />\nBasketball Manager<br />\nIn connection with these memoof such an ideal condition at present. men are appearing at practice and<br />\nAt a meeting of the Athletic AsIf we were to bring to bear all the doing good work in the scrim- rials it may be said that these are<br />\nsociation<br />\nlast Tuesday night, John<br />\nripe intelligence of mankind to con- mages. To give them further op- the first decorations of any sort in<br />\nEldridge<br />\nwas elected manager for<br />\nvert this power of the world into portunity for development, plans the C. E. Hall. The tendency to<br />\nyear,<br />\nafter a close race with<br />\nnext<br />\nare<br />\nbeing<br />\nour servant, we might accomplish<br />\nmade to get games with decorate the walls of the University<br />\nprep schools.<br />\nis just beginning to be noticed here. Johnny Norris. It was decided not<br />\nthis.<br />\nto elect junior managers until next<br />\nLord Bryce Here<br />\nyear. In spite of the fact that the<br />\nSTORM CLOUD SUCCESSFULLY CLEARS<br />\nLord James Bryce on coming to<br />\ncompetition for manager will be<br />\nUPPER BARN OF CARD-SHARKS open until the senior year. As<br />\nAnierica gave us our trouble in one<br />\nA very dark cloud descended on of the year. Despite his Scotch there are only two junior managers<br />\nsentence, \"the one great failure in<br />\nAmerican democracy is municipal the Barn in the midst of the snow nature, the president of the Debat- left for next year, there will be a<br />\ngovernment.\" He came again to storm Friday afternoon. Entering ing Council was forced to give his big opening for candidates.<br />\nAmerica in order to go to Williams- from the \"Y\" office, where they last cent. Many of the regular<br />\nThe question as to whether bastown: In eight lectures there he failed to get any material support, Barn hounds were forced to walk ketball will be continued at the<br />\nPresented his far-reaching views on due to the Levering Hall drive, two home due to their supreme gener- university in the future will be dethe subject- of democracy. One of representatives of the Afro-Ameri- osity to the worthy cause.<br />\ncided at the regular meeting of the<br />\nLord Bryce's ideas'was that a State can orphan asylum came into the<br />\nOthers argued in vain, as had Athletic Council this week. The<br />\ncould not.be cut up as a map with Barn in an effort to solicit funds. Gardner; that such institutions Athletic Council consists of the<br />\nThey knew riot where they came! either were supported by the Com- President of the University, the<br />\nscissors: The geography of the country, At first it was thought another munity Fund or were not worth Dean, several of the alumni, Presthe customs- of the people, their his- salesman had. entered and the card supporting. HoweVer, the elo- ident of the Student Council, and<br />\ntory—all of these' have to be con- games continued in peace. Just as quence of the dark representatives the President of the Athletic Assosidered before boundaries may be a hand reached out to sweep up the overcame all obstacles. The largest ciation. It is very probable that<br />\nChanged.<br />\nprofits of the play, a dark hand de- donation was made by \"Doc\" basketball will be continued in view<br />\nSaroumi, one of the.. Japanese scended upon them.. The true pur- Adams. However, it is believed of the very• successful season this<br />\ngentlemen at .Williamstown, said, pose of the visit was disclosed. that there was a method in his year. In spite of the fact that the<br />\n'Ares, east is east'and west is west; After a short sermon on gambling madness. He saw that all his trade team did not have any home gym<br />\nbut the world is getting so small and. other vices ot college boys, a would soon be in no condition to and was greatly inconvenienced in<br />\nthat they soon shall meet.\" This collection was taken. Norman buy their,daily ice cream cone and practicing and playing games, it<br />\nWas the Japanese feeling until the Gardiner, supreme upholder of elo- in a supreme effort to save the do- completed a very satisfactory seaimmigration change in 1925. Since quence on the campus, was driven nations for himself he attempted son, winning half of its games<br />\nthen the expressions of a few into a corner. After a heated argu- to rid the Barn of the well-meaning against some of the best teams in<br />\nment Hopkins lost its first debate Collectors.<br />\nthe East.<br />\n(Continued on Page 6, Column 2)<br /><br />\nThe Political Science department<br />\noffers two regular courses without<br />\nprerequisites and to Juniors and<br />\nSeniors only, a choice of four reading courses. The regular courses<br />\nare worth four credits if the student<br />\nmerely earns a passing grade and<br />\nsix if his work justifies it. Two<br />\nhours a week will be given to lectures and tests offer the equivalent<br />\nof a third hour in private reading.<br />\nDr. Hart will conduct all these<br />\nPolitical Science 1 will<br />\nclasses.<br />\ndeal with foreign governments. The<br />\nhour is eight-thirty on Thursdays<br />\nEspecial attention<br />\nand Fridays.<br />\nwill be given to the English cabinet<br />\nsystem. France, Germany, Switzerland, Russia, Italy and Japan will<br />\nalso be studied. This course is<br />\nwhat was formerly the/first half<br />\nof the Political Science 1. Political Science 2 will cover American government and politics. Twothirds of the course will be devoted<br />\nto the national government and the<br />\nremaining time a brief study Of<br />\nState, county and municipal government. Monday and Tuesday at<br />\nnine thirty is the time of the class.<br />\nThe reading course, in addition to<br />\nbeing open only to Juniors and Seniors who have taken 1 and 2, requires a grade of eight or over their<br />\nprevious courses and special permission of the dean, adviser and'instructor. Only one such course may<br />\nbe taken per session and each will<br />\ncount for three credits. The subjects approved are: Political Parties<br />\nand Public Opinion, Municipal Gov(Continued from page 1, column 5)<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 20, 1928<br /><br />\n2<br /><br />\nThe Johns Hopkins News -Letter<br /><br />\nYES AND NO<br /><br />\nFOUNDED 1897<br /><br />\nSubscription<br /><br />\n$2.00<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br /><br />\nGirls.—Everywhere I go, every<br />\nboy I see, no matter what I do—<br />\ngirls. On the trolley car going to<br />\nclass in the morning a fraternity<br />\nbrother raves about the girl he<br />\nwas with last night. Another<br />\nbrother's greeting is: \"Who was<br />\nthe girl I saw yesterday?\" At<br />\nlunch it's the girl someone is taking to the House dance. Girls!<br />\nI go home talking about girls; the<br />\nhall session about the fireplace,<br />\nwith its modern substitute for<br />\ncrackling logs, of our colonial forbears, turns immediately to girls.<br />\n. Damn the girls!<br />\nGirls<br /><br />\nout platitude. But art in the<br />\nnether limbs that female thrust<br />\nforth for the open-mouthed stare<br />\nof my more or less moronic brethren? Beautiful? Shapely? Art!<br />\nThe very word when used thus is<br />\nblasphemy, sacrilege.<br /><br />\nSheer silk stockings that do or<br />\ndo not disappear under too short<br />\nskirts. We once could tell the apBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nproach of the \"fabled fair\" by the<br />\nHopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nswish of her skirts. To me they<br />\nother communications to the EDITOR-IN-CHIEF.<br />\nseemed to connote dignity, selfrespect, respect for the wearer<br />\nUniversity 0100<br />\nTelephone<br />\nand her position in society. And<br />\nnow—semi-skirts that strive vainto reach the knee. Let him who<br />\nly<br />\nBut should I verbally desecrate<br />\nEDITORIAL DEPARTMENT<br />\nwoman<br />\nthe fairer sex so hastily, without stated that the knee of a<br />\nEditor-in-Chief<br />\nis<br />\nstocking<br />\na<br />\nunder<br />\nwrinkled<br />\nGEORGE E. BANKS, JR., '29<br />\nmeditation, or reminiscing over<br />\nsuch<br />\nis<br />\nIt<br />\nforth.<br />\nstand<br />\nbeautiful<br />\nevenings spent—pleasant evenings<br />\nAssistant Managing Editor<br />\nManaging Editor<br />\nbrightened by—? But again I as he that would fall into ecstasies<br />\nGEORGE GUMP, '30<br />\nPHILIP W. NESS, '29<br />\nover the pulchritude of some of<br />\nsay—damn the girls.<br />\nour Simian ancestors or over the<br />\nColumnist<br />\nAlluring curves, unnaturally lovely shapeliness of a stick of<br />\nDONALD Hiss, '29<br />\nbrilliant, carmine lips, teeth flash- kindling wood or a block of granAssociate Editors<br />\ning in inane smiles, silly prattle— ite. Thank the gods that men<br />\nRICHARD H. WOOD, '29<br />\nWILMER H. DRIVER, '29<br />\neverywhere I go there are girls, have discovered the wisdom of<br />\ngirls. Either about them or, even concealing their lanky, hair-covJunior Editors<br />\nE. FOSTER DOWELL, '29<br />\nLEONARD B. NOLLEY, '29<br />\nworse, they themselves—Lord, ered, bone-protruding lower limbs<br />\nRICARD G. HUNT, '31<br />\nROBERT S. BAIRD, '30<br />\nHARWOOD F. MULLIKAN, JR., '31<br />\nW. PURNELL HALL, JR., '30<br />\nHow<br />\nI hate them;<br />\nIRVING K. GORDON, '29<br />\nROBERT F. SKUTCH, JR., '30<br />\nunder the sheltering folds of their<br />\nSTEWART L. SMITH, '30<br />\nI go to class tonight—one of trousers. Would that a similar<br />\nthe courses in the Teachers? Col- glimmer of light make its way<br />\nBUSINESS DEPARTMENT<br />\nlege. I ride out suffering from through the tightly fitting hats of<br />\nBusiness Manager<br />\nthe endless gushing of some sis- our modern women! But that is<br />\nHARRY 0. Scimoss, '29<br />\nter. Oh, God! Will Al always in- too much to expect and I must<br />\nCirculation Manager<br />\nAdvertising Manager<br />\non picking them up? Half continue to suffer in silence.<br />\nsist<br />\nJ. ROBERT MYERS, '29<br />\nGEORGE M. GLAZIER, '29<br />\nthe class is female—school teachEven my solitary strolls are not<br />\ners who hope to keep a firmer free from this affliction. BeAssistant Business Managers<br />\ngrip on their jobs by saying they knickered pieces of femininity flout<br />\nWILLIAM RAFFEL, '30<br />\nDONALD C. WEILLER, '28<br />\n•<br />\nALVIN BLUM,'30<br />\nA. H. MORTON, '30<br />\ngo to Hopkins. Flappers—Lord by, bulging in the most inconGus BURKE, '31<br />\nJOHN LOTZ, '30<br />\ndeliver me from all such evils— gruous of places. Ye gods! What<br />\nStaff Photographer<br />\nwhispering to each other, regard- could be more horrible?<br />\nWALTER D. SCHEIDT, '30<br />\nless of the old pedagogue up<br />\nAnd what melody in those<br />\nfront. No one listening to what names—Marie, Genevieve, Eleais really an interesting lecture. nor! What pleasant associations<br />\nPrinted by Fleet-McGinley, Inc., 8th floor, Candler Building, Baltimore, Md.<br />\nEducation! Hopkins! Bosh!<br />\nthey summon up! How I love<br />\nAnd still girls. The feminine them, everyone—their every acsex. To some of my effervescent tion, their every word!<br />\nbrethren the words connote<br />\nAnd more girls. The solitude<br />\nbeauty, charm, long lashes shad- and peaceful quiet of my room is<br />\ning deep pools of blue, bewitching broken by the raucous clang of<br />\nAnd some miss on<br />\nsmiles, evenings in Paradise. To the telephone.<br />\nof the paper with a considerable<br />\nthe other end of the wire asks—<br />\nTHIS JOB OF<br />\namount of trepidation. The saying me—paint, powder and lipstick; Bang! Merely the receiver back<br />\nBEING EDITOR<br />\nto the effect that the head which too black eyelashes covering too on the hook. Damn all girls, and<br />\nLTHOUGH our predecessors wears the crown lies uneasily, holds alluring eyes; silly, wide-mouthed those who call fraternity houses<br />\nmost fervently.<br />\nhave willfully neglected to sing true for typewriter pounding editors smiles; evenings of torture.<br />\n* * *<br />\nas<br />\nas<br />\nmonarchs.<br />\nwielding<br />\nscepter<br />\nwell<br />\nthe traditional \"swan song,\" it seems<br />\nSince early childhood I have<br />\nI'm lonesome tonight—in no<br />\nonly meet and proper that we should Or to use the more uncouth jargon prided myself on my taste for the mood for studying and just a bit<br />\njob<br />\nmost<br />\ncertainly<br />\nis<br />\n'of<br />\nthe<br />\nMoronia,<br />\nacknowledge the rich bequest that<br />\nartistic. To me \"Art for arts' blue. The telephone—Yes, Ann,<br />\nthey have left behind. During the no bed of roses.\"<br />\nA. G.<br />\nsake\" is more than a mere worn- in a half hour.<br />\npast regime, the paper undoubtedly<br />\nhas shown development both in the<br />\nCHANGES IN CURRICULUM until 1929-1930. French 3 on Roquality of the editorial work and in<br />\nmanticism and Realism will be<br />\n(Continued on page 2, column 3.)<br />\nthe efficiency of the business staff. It<br />\ngiven next year by Dr. Shanks at<br />\nThe French department provides the same hour as French 2, with<br />\nhas grown from four pages to six and THE RETURN<br />\nOF<br />\nTHE<br />\nPRODIGAL<br />\nfour courses, two of which will be the same prerequisites, and is also<br />\neight. The number of agate lines of<br />\ngiven in alternate years. French 2 worth six credits. French 4 is<br />\nwith<br />\nincreased<br />\nhas<br />\nadvertising matter<br />\nQ TUDENTS will be pleasantly suramount<br />\nthe<br />\nin<br />\nwill be given four hours throughout limited to students who have coma proportionate growth<br />\nk-)prised to read elsewhere in this<br />\nyear and will cover modern pleted 2 or 3 or the equivalent, and<br />\nsenithe<br />\noutgoing<br />\nof news articles. The<br />\nissue that J. Edwin Desch, a member short stories, plays, composition, posses the necessary ability to read<br />\nThey<br />\nwell.<br />\nors have done their work<br />\nof the Class of 1926, will have a part and conversation. French 2 will be French at sight. It is a supervised<br />\nhave laid down a foundation for fuin the forthcoming production of the a survey course in French literature reading course dealing with modern<br />\nture development, which is based on<br />\nBarnstormers' Club.<br />\nconducted by Dr. Shanks and Mr. French critics, thinkers, and poets,<br />\nthe soundest journalistic principles.<br />\nDesch is, without question, the best Thomas in two sections at ten thirty Two or more books per month will<br />\nTo the incoming board of control is<br />\nof the first half of the week. French be read and four points credit given.<br />\nassigned the difficult task of continu- female impersonator ever to have<br />\nthe course<br />\nbeen det.reloped under the guiding 1 or its equivalent is necessary for Dr. Shanks will conduct<br />\ning this high standard of work.<br />\non<br />\nTuesdays<br />\nthirty<br />\neleven<br />\nentrance. This course is being given at<br />\nOur job of editor involves us in the hand of \"Pop\" Swindell. Those who this year and will not be given again throughout the year.<br />\nunenviable task of keeping the ma- saw the club's production of \"The<br />\nchinery running smoothly. There is Tailor-Made Man\" will recall his exalways the duty of constructing edi- cellent work in the role of Tanya.<br />\nSTARTING MONDAY EVENING, MARCH 19th<br />\nin<br />\nLikewise,<br />\nBunker<br />\n\"His<br />\nMajesty<br />\nEdwin H. Knopf and Willian P. Farnsworth<br />\ntorials which must be at least, in part,<br />\nhis<br />\nBean,\"<br />\nacting<br />\nin<br />\nthe<br />\nhave the honor to present<br />\nof<br />\nMarie<br />\npart<br />\nreadable. Irate professors, who have<br />\nW. SOMERSET MAUGHAM'S<br />\nwas<br />\nBreede<br />\none<br />\nof<br />\nthe<br />\noutstanding<br />\nbeen misquoted by naive freshmen<br />\nInteanational Comedy Success<br />\nreporters, must be calmed as diplomat- performances of the show.<br />\n\"THE CONSTANT WIFE\"<br />\nAt the present time Desch is takNot only will next Monday evening's performance be the first showing<br />\nically as possible. Staff members<br />\ning graduate courses at the Univercomedy in Baltimore, but it will be the first presentation by any<br />\nthis<br />\nof<br />\nsimistricken by spring fever or some<br />\nresident company in the United States of Mr. Maugham's most successful<br />\nsity and thus is eligible to participate<br />\neffort. Therefore, it is with pardonable pride that Messrs. Knopf and<br />\nlar malady must continually be disin this year's production. His work<br />\nFarnsworth make this announcement to the Baltimore public. There will<br />\nsuaded from taking a couple of weeks should prove a big factor in aiding<br />\nbe no adtance in prices and tickets are now on sale at the box office from<br />\n50 cents to $1.50.<br />\nof unauthorized vacation.<br />\nthe Barnstormers to score another<br />\nAUDITORIUM THEATRE<br />\nThus we take over the management dramatic success.<br /><br />\nTHEATRE<br />\nTHE LITTLE<br />\nST. NEAR FRANKLIN<br /><br />\nN. HOWARD<br />\nMotion Picture Guild Presents:<br />\n\"ALL FOR A WOMAN\" at<br /><br />\n1.45-3.45-6.00-8.00-10.00 P. M.<br />\nUFA'S MASTER PRODUCTION<br />\nft<br /><br />\n\"All for a Woman<br />\nwith<br /><br />\nEMIL JANNINGS<br />\nand<br /><br />\nWERNER KRAUS<br />\nin the stellar roles of<br />\nDanton and Robespierre<br />\nNone can forget the force of<br />\nmob-passion that leaps from this<br />\nmammoth production; nor the<br />\nart — indescribable pantomime —<br />\nof Europe's greatest artists.<br />\nMovies in the Making<br />\n\"Ballet Mecanique\"<br />\nImportant Devlopment in the march<br />\nof the movies.<br /><br />\nCharlie Chaplin in a<br />\nSad Old Drama of 1917<br />\n\"The Pawn Shop\"<br />\nLITTLE THEATRE ORCHESTRA<br /><br />\n-- ALBEE<br />\nKEITH<br />\nGARDEN THEATRE<br />\nNEW<br /><br />\nCONTINUOUS FROM 11.30 TO 11<br />\nWEEK OF MARCH 19th<br /><br />\nBELLE BAKER<br />\nThe Incomparable<br /><br />\nCHARLES WITHERS<br />\nin \"WITHERS OPRY\"<br />\nand<br /><br />\nOther Wonderful Acts<br />\n.ar<br /><br />\nPHONES: HOMEWOOD 7806<br />\nHOMEWOOD 7807<br /><br />\nPhone Us—We Deliver<br /><br />\nR.M.BIRELY,Phar.D.<br />\nPrescription Pharmacist<br />\nSODA<br /><br />\n-<br /><br />\nCANDY<br /><br />\n-<br /><br />\nCIGARS<br /><br />\nCor. St. Paul and 33rd Sts.<br />\nBALTIMORE, MD.<br />\nvs•<br /><br />\nE. E. ADAMS<br />\nBARN CAFETERIA<br /><br />\nEDITORIAL COMMENT<br /><br />\nA<br /><br />\nSwitches Back<br />\nto Favorite<br />\nTobacco<br />\nPeoria,<br />\nAug. 26, 1926<br />\nMessrs. Larus &amp; Bro. Co.<br />\nRichmond, Va.<br />\nDear Sirs:<br />\nJunta confession and an appreciation.<br /><br />\nA number of years ago I was a user<br />\nof your Edgeworth smoking tobacco.<br />\nButlike some others, perhaps,I wasled<br />\nby alluring advertisements to changeA few days ago I went into a drug<br />\nstore to get some tobacco, and on the<br /><br />\ncase wasthe familiar can of Fdgeworth•<br />\nI bought it and since then I have enjoyed old-time comfort.<br />\nSo my confession is that I made a<br />\nmistake in changing to other brands,<br />\nand my appreciation is such that Edgeworth will be my Smoke Pal while life<br />\nlasts, which may not be long, for I<br />\nhave passed my \"three score years and<br />\nten.\"<br />\nVery truly yours,<br /><br />\n(signed) E. P. Fishburn<br /><br />\nEdgeworth<br />\nExtra High Grade<br /><br />\nSmoking Tobacco<br />\nPkimmimokommannal<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 20, 1928<br /><br />\nMORAL HOLIDAYS<br />\nBy<br /><br />\nSUMNER L. STOCKTON<br />\nto state a mild form, some may<br />\nfeel holiday enough in a kiss,<br />\nothers in a necking party, and so<br />\nforth. It is easy to see, then, just<br />\nhow methods and types are governed by personal feelings and<br />\nopinions, and how these in turn<br />\nare controlled by the strictness of<br />\none's own moral code, so that the<br />\ngreater strictness yields the milder holiday, and the greater laxity<br />\nyields the greater freedom.<br />\nAs to the conditions for moral<br />\nholidays, there are three—time,<br />\ncircumstances, a n d inclination.<br />\nMost people have the time, which<br />\nbrings forth the danger of having<br />\ntoo much time—how well it is<br />\nNow, these holidays seem to that two other conditions are<br />\nresult directly and primarily from necessary! Circumstances are exa reaction against the bonds of tremely difficult to arrange, if<br />\nconvention and environment; they are to be arranged; somethey are the overflowings of de- times the circumstances are<br />\nsires too much suppressed. brought about very accidentally,<br />\nWere these desires n o t sup- and it is often that a much better<br />\npressed, however, we would be time is had under chance and unin the state first mentioned; expected circumstances. Usually,<br />\nthat is, a holiday would be free- however, a moral holiday is indom from immorality. But as to dulged away from home, and the<br />\nthis condition, it is both disgust- more removed the place the beting and repulsive, and wholly in- ter, for then there is less opportucompatible with a civilization nity for detection. If enough care<br />\nWhich provides (as best it can) is taken the circumstances may be<br />\nfor the general welfare of human- made ideal, except for perhaps<br />\nity. Also, the second condition, those minute details, which deif it could possibly exist univer- pend on astronomical, geographsally, would be undesirable; not ical and physical conditions;<br />\nthat it is harmful, for it seems to sometimes it is advisable to delay<br />\nbe the goal of social progress, but a moral holiday when better cirbecause it lends no color to life. cumstances are expected. The inPerhaps we can compare it to the clination seems to be always with<br />\nlife of work without any play; us, or, at least, periodically it<br />\nan analogy which by its very comes to us, but there is no surer<br />\ncrudeness apprehends the bore- way to decrease the inclination<br />\ndom and monotony arising from than by overindulgence; a point<br />\na lack of somewhat shady variety. of satiety is often reached by proBe seriously moral, but just play- miscuousness and indiscrimination, to say nothing of the danfully immoral.<br />\nSupposing, then, that moral gers arising from detection. And<br />\nholidays are both natural and de- usually the success of a moral<br />\nsirable: how and when should holiday depends on the existence<br />\nthey be indulged? This question of all three conditions for two perembodies more of personal opin- sons mutually.<br />\nIt is, finally, important to alion than any set regulations, for<br />\nno one can definitely set down a ways observe two specific details:<br />\nrule whereby others may be the frequency of holidays and the<br />\nguided in their excursions. There secrecy attached to their occurare, however, general tendencies rence. In order to keep from<br />\nWhich exemplify sbmewhat the being satiated with immorality, to<br />\nvarious methods and types of keep from becoming too bestial,<br />\nholidaying. Suppose that a man and to keep alive self-respect, it<br />\nhas strong, innate tendencies for is necessary to put a limit on the<br />\nliquor, but must necessarily con- number of excursions. Knowing<br />\ntrol them; this man will sometime that they are practically inevitable, we can say, the fewer the<br />\nYield to his desire, become ex- better.<br />\nAnd secrecy is the very<br />\nceedingly intoxicated, and then keynote of moral holidays; it is<br />\nreturn quietly and submissively the very essence of passing ento his normal self, carrying with joyment and later pleasant recolhini shady but pleasant recollec- lection. With apologies to Donne<br />\ntions of his experience. Or the de- for the misapplication of a verse<br />\nof his poetry, the following is<br />\nsire may be gambling, and (if too<br />\nquoted:<br />\ngreat a financial loss is not sus- If I have done a braver thing<br />\ntained) the same process of in- Than all the worthies did,<br />\ndulgence and reinstatement will Then from it thence a braver<br />\nsprings<br />\noccur. Likewise, there are other<br />\nWhich<br />\nis to keep that hid.<br />\nsecret vices which ever so often<br />\nFor a man is not only obnoxrequire exercise. But there is ious, but he<br />\nalso puts himself in<br />\none in particular that is so no- the way of danger when he boasts<br />\nticeable because of its universal of his achievements, especially in<br />\nappeal—in the terms of Freud, it the field of moral holidays. If<br />\niS the sex desire. No one is quite you must have a moral holiday,<br />\nmake sure of the conditions, deimmune from its attacks, and yet<br />\nscend to immorality, have as<br />\nfreedom from the strict moral pleasant a time as<br />\npossible,<br />\nstandards of sex relations has and then return, covering 'your<br />\nsuch varied forms. For instance, actions with secrecy.<br /><br />\nThere are those among us who<br />\ntack morals, and can therefore<br />\nhave no moral holiday; to them<br />\na holiday is a rising from immorality; there are also those among<br />\nus who are forever strict in their<br />\nmoral codes, and never descend<br />\nto a shadow of immorality; they<br />\ndeprive themselves of a holiday;<br />\nbut by far the greater part of humanity is comprised of those who<br />\nare somewhat strict, morally<br />\nSpeaking, but who are not infallible. It is this latter group which<br />\ngives rise to the deviations from<br />\nthe dictates of purity—excursions<br />\ninto the realms of the immoral—<br />\nwhich we call moral holidays.<br /><br />\nNOTICES<br />\nThe annual Spring Competition for the editorial<br />\nstaff of the News Letter<br />\nwill start Friday. Candidates for editorial positions should report at the<br />\noffice Friday at 12.30 P.<br />\nM. By faithful work, it<br />\nis possible for applicants<br />\nto make the regular editorial staff before the end<br />\nof the present semester.<br />\nThere will be a meeting<br />\nof the News Letter editorial staff at the Barn today<br />\nat 12.30 P. M. The business staff will hold a meeting tomorrow at the News<br />\nLetter office.<br />\nFreshman class meeting<br />\ntoday at 12.20 P. M.in the<br />\nC. E. Hall.<br />\nSenior class will meet<br />\ntoday at 12.20 P. M.in the<br />\nC. E. Building.<br />\nMeeting of the Blue Jay<br />\nbusiness staff at 12.20 P.<br />\nM., Thursday.<br />\nCandidates not appearing at this<br />\nmeeting will not be considered eligible for the<br />\nstaff.<br /><br />\nVANDERBILT HOTEL<br />\ntTit ()ark, Avenue)<br />\n\"<br />\nc7hirty(fourth c.StrtvEwoas<br />\nC2innou7lcei_9<br /><br />\ndunday &amp;ening eoncerti_<br />\nin the DULA 7.0.3.21Aca<br />\nDISTINGUISHED ARTISTS<br />\nDINER-DE-LUXE— $3.00 PER PERSON<br /><br />\nIn Addition<br />\non Tuesday, Wednesday,Thursday,<br />\nFriday and Saturday Evenings we<br />\nare having<br /><br />\nDinner Dances<br />\nin the Della Robbia Room. Dancing from 7.00 to 12:00 including<br />\nDinner at $3.50 per cover.<br />\nMusic by the Della Robbia Orchestra. Evening<br />\nDress required.<br /><br />\nSTAY ON THE FAIRWAY;<br />\nSTICK TO'CAMELS!<br />\nSOMEWHERE between your collar-button and the bottom of your plus-fours<br />\nthere's a smoke-spot—seeking \"fill-fullment.\" The vast majority of jobbies<br />\nwho feel that in'ard hankerin' have discovered what to do about it. They<br />\npull a cool cloud of joy away down into it—and slowly exhale fragrant<br />\nCamel smoke.<br />\nTobacco science has produced in Camel a superb blend of the choicest,<br />\nTurkish and Domestic tobaccos. Just revel once in the delicious, quivering<br />\naroma of a cloud of Camel smoke. We'll bet a caddie to a left-handed<br />\nniblick you'll never get off that fairway!<br />\n1928 R. J. REYNOLDS TOBACCO COMPANY, Winston•Salem, N. C.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 20, 1928<br /><br />\nTHE MAIL BAG<br />\nWHAT! MORE OF THIS?<br /><br />\nENGLISH LIT.0<br /><br />\nTo the Editor of the NEWS-LETTER: To the Editor of the NEWS-LETTER:<br />\nDear Sir:<br />\nAlthough much has been said on<br />\nthe subject, and \"many hasty remarks have been made on hearsay,\"<br />\nit seems that one point remains that<br />\nis yet entirely unsettled with respect to the proposed Levering<br />\nHall.<br />\nThe subscription blank reads, as<br />\nnearly as I can remember,<br />\n\"I hereby subscribe the following<br />\namount of money for the erection<br />\nand furnishing of a building for<br />\nstudent use on the Johns Hopkins<br />\nUniversity Campus; this I agree<br />\nwith other such subscribers, and<br />\nwith the Young Men's Christian<br />\nAssociation of Baltimore.\"<br />\nThis is not verbatum, but the exact meaning and words are present<br />\nwith no deviation from the regular<br />\nsubscription blank. I admit a reliance on memory, but I challenge<br />\ncomparison between this a.nd the<br />\nactual blank.<br />\nWith the blank as a basis the<br />\nfollowing analogy, I believe, will<br />\nshow clearly an objection:<br />\nSuppose I go to my fraternity<br />\nand say, \"You are unable to build<br />\na new house, and a new one is<br />\nneeded. I will build it for you.\" I<br />\nmake a subscription blank that<br />\nreads, \"I hereby subscribe the following amount of money for the<br />\nerection and furnishing of a building for the use of the Psi Beta<br />\nKappa Fraternity; this I agree with<br />\nother such subscribers, and with<br />\nMr. Blah.\". (Mr. Blah is myself.)<br />\nWill the reader please notice the<br />\nsimilarity with the Y. M. C. A.<br />\nblank?<br /><br />\nDear Sir: Harksk! Woes dat?<br />\nMethinks I heareth the dull thud of<br />\nfalling glass. By my horse! I kneweth that yon asses wouldst be struck<br />\nby one (1) cobbblestone ere they<br />\nliveth long in such an abode—imagine, Lucy, calling that pile of<br />\ncrystal a house!!<br />\nHow now, Boxley, old tripe!<br />\nWhat! Receivest thou not information about the squabbling of the<br />\nrabble in regard to the weekly massmeetings in the Civil Science rooms?<br />\nWell, Well, attend!<br />\nSir Blandi has been in receipt of<br />\nintimations penned by several of the<br />\ncellar champions and their running<br />\nmates--the Sophomores—that their<br />\nsubscriptions to chairs on the assembly floor will automatically cease<br />\nshould the Head Councilor of Students continue to provide sad and<br />\ndull orators, or what is slightly<br />\nworse—no silver-tongued 0 chaps at<br />\nall. Dost thou bend thy reverend<br />\near to my effort, dear Boxley? Eh?<br />\nGood!<br /><br />\nThe spectators soon lost all interest in the game—the majority of<br />\nthose present being Hoof and<br />\nMouthers—and, besides, the pitcher<br />\nhad gone up into the air and things<br />\nwere over their heads. Once when<br />\nthe boy on the mound threatened to<br />\nstrike out the side with a joke, the<br />\nRhythem of the Itch slowed down<br />\nto a walk, but when said yoke was<br />\nnot forthcoming, the sound of the<br />\ncoxswain urging an increase in<br />\nstroke, rumbled over all other noise.<br />\nAs the acousticons in the foremost<br />\npews were out of order, everybody<br />\nhad to vaguely agree with the announcer that it was a top-hole performance, and—\"that's the kind of<br />\nan assembly we ought to have every<br />\nweek—you know, a pip speaker like<br />\nthat guy, what I mean!\"<br />\nOh! I say, Boxley, you've often<br />\npromised to tell me that scandal<br />\nabout the iceman and the virgin<br />\ncook, now's<br />\n•<br />\nPax vobiscum,<br />\nLAMBERT B. BEEUWKES.<br /><br />\nCarl J. Doederlein<br />\n•<br /><br />\nAnd, Mr. Reader, please notice<br />\nalso that when a \"sucker\" signs my<br />\nblank, he is not giving, nor has he<br />\nany intentions of giving this money<br />\nto Mr. Blah (me).<br />\nAnd likewise, the unfortunate<br />\ngentleman that signs the Y. M. C.<br />\nA. blank may have no intentions of<br />\nTwo deliveries—one a slow ball,<br />\ngiving the money to the Johns Hopto the new Y. M. 0C. A.<br />\nrelating<br />\nkins Y. M. C. A., much less the<br />\nbuilding, and the other a fast ball,<br />\nBaltimore Y. M. C. A.<br />\nTherefore, as long as such a which threw tawbayta pie into the<br />\nclause exists in the contract be- ears and mouths of the home fans—<br />\ntween the Y. M. C. A. and the preceded the main bout on the card<br />\nUniversity, namely, that if, after a —an illustrated oral treatise on<br />\ncertain period, the University does \"Ship Lighters That Air.\" And<br />\nnot wish the Y. M. C. A. to remain<br />\nsay, Boxley, would you believe it,<br />\non the Hopkins campus, she must<br />\ninning the<br />\npay back that amount of money col- that prior to this third<br />\nlected for the building by the \"Y;\" fans were silent. No-o, sex probas long as such a clause exists, / lems—domestic or foreign—didn't<br />\nobject, and many others object.<br />\nkeep them in order—the pitchers<br />\nFor this money is collected in just brought out their Indian signs.<br />\nour name! Just as, in the example, (No,I didn't think the Indians were<br />\nMr. Blah collected in the name of<br />\nsign painters, either, until I saw the<br />\nthe members of the Psi Beta Kappa Fraternity, just.as his name ap- telltale evidence.)<br />\npears only on the contract as the ' It was not long, however, after<br />\ncollector, so the \"Y\" appears on the Honorable Sir Walt Peggin'<br />\nthe actual blank. If you still do not<br />\nwalked up the steps to the mound<br />\nsee the point, read both blanks<br />\nthat the members of the Hoof and<br />\nagain.<br />\nThis is a well-founded objection; Mouth Disease Fraternity swung<br />\nit is no hasty remark. You may into action. Their mascot wondered<br />\nsay that it is only a technical objec- why the sharp edges of the chairs<br />\ntion, but as long as there is ever a and footrests were so thoughtfully<br />\npossibility of the Y. M. C. A. profit- worked out, if a definite purpose<br />\ning to the tune of a sum approachhad not been in mind. One of the<br />\ning $175,000, there will be an objection, unless our name is not the brothers volunteered the information that the reason for this was<br />\nbasis of the collection.<br />\nbecause the chairman of<br />\nprobably<br />\nThe blank, as it reads at present,<br />\nhighits<br />\nin<br />\na<br />\nis<br />\nmisrepresentation<br />\nthe last National Seven Year Itchest form, and inasmuch as it is a ers and Anti-Old Gold Smokers<br />\nmisrepresentation, I protest and ob- Convention, held just recently in<br />\nject to the whole campaign.<br />\nPooh Pooh, Wis., had designed this<br />\nYours for a student building,<br />\nto be the official chair of the organiMR. BLAH. zation.<br /><br />\nT<br /><br />\nS<br /><br />\nConvenient and Economical<br />\nTRANSPORTATION<br /><br />\nTHE STREET<br /><br />\nCARS<br />\nInterior Wood Work<br /><br />\nDecorations<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\nFactory<br />\n600 S. Pulaski Street<br /><br />\nShow Rooms<br />\n343 N. Charles Street<br /><br />\nTHE GIANT<br />\nPOWER FUEL<br /><br />\nE S S0<br /><br />\nNEW LIFE<br />\nFOR MOTORS<br /><br />\n\"STANDARD\" MOTOR OIL<br />\nThe Measure of Oil Value<br /><br />\nDIAMONDS<br /><br />\nMfrs. of Fraternity Goods of All Kinds<br />\nPARK BANK BUILDING<br />\n504<br />\ninwere<br />\nbrethren<br />\nThe<br /><br />\nSo on.<br />\nformed that two days past the<br />\nMarch new moon a renowned<br />\nknight, well known for his industry in the aeronautical world,<br />\nwould grace the platform of the<br />\nassembly hall. Downtrodden firstclssmen announced informally<br />\nthat their presence in the rooms<br />\nwould be noted. The college was<br />\ncaptured by General Riot plus Colonel Storm. Despite the presence<br />\nof these two worthies, the day arrived, and with it the sun, not a<br />\nMinute behind its scheduled appear,<br />\nance. The captives took occasion to<br />\nlock-step into the immense hall, taking advantage of the major beat accented by the drums of a hidden<br />\norchestra and the concealed machine<br />\nguns (provided to give a home atmosphere to visiting students from<br />\nHonest Bill Thompson's territory).<br /><br />\n0<br /><br />\nM<br /><br />\nSTANDARD OIL COMPANY OF N. J.<br /><br />\n(Lexington at Liberty Ste.)<br /><br />\nWhere<br />\n\"good enough\"<br />\nisn't<br />\nHE \"sax\" wails. The brass blares. The<br />\nT<br />\ndrum's deep voice speaks. Yet all is perfect<br />\nharmony—when every player puts his best into<br />\nhis part.<br />\nAnd the same is true in industry.<br />\nAt Western Electric the making of telephone<br />\nequipment for the Bell System is based on constant improvement in the harmonious interweaving of pure science, manufacturing and economics.<br />\nHere,chemist,physicist,electrical and mechanical engineer work together. Purchase engineer<br />\nand laboratory research engineer develop new<br />\nstandards of purchasing. Traffic engineer and<br />\nmerchandising executive improve upon the<br />\nmethods of distribution.<br />\nNor has the end of all improvement been<br />\nreached. Every adventure in harmony paves the<br />\nway for another, perhaps greater.<br /><br />\nes/tern Electric<br /><br />\nSINCE<br /><br />\n1882 MANUFACTURERS FOR THE BELL SYSTEM<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 20, 1928<br />\nPhone, CAI. 1380<br /><br />\n5<br /><br />\nHome—HO. 2095-J<br /><br />\nFRANCES T. BANNON<br />\nSuccessor to HARBAUGH &amp; BANNON<br /><br />\nNEW<br /><br />\n2 E. LEXINGTON ST., Cor. Charles<br />\n(Room 28)<br />\nStenographic Dictation, Copying,<br />\nMultigraphing, Mimeographing<br />\nBaltimore, Md.<br /><br />\nFORDS<br /><br />\nUSED<br /><br />\nThe City of Happiness Is in the State of Mind<br />\nSee FORDYCE CAMPBELL - AETNAIZER<br /><br />\nCHARLES B. HINES '27 Un. 0447<br /><br />\n9th Floor Citizens Nat'l Bank Bldg. Plaza 1062<br />\nLIFE - ACCIDENT - HEALTH - AUTO - LIABILITY -<br /><br />\nThe Backus Motor Co. Ver.4300<br />\n10 E. NORTH AVENUE<br /><br />\ng<br />\njE<br />\nli<br /><br />\ne<br /><br />\nL<br /><br />\n1<br /><br />\n\"One of the leading tobacconists in<br />\nBaltimore says:\"<br />\n\"The rapid growth in the popularity of OLD<br />\nGOLD Cigarettes among the students is remarkable. Never in my experience have I seen a new<br />\ncigarette catch on so quickly with the boys on<br />\nthe campus.\"<br /><br />\nE. E. ADAMS<br />\n\"The Barn\"<br /><br />\nJohns Hopkins University<br /><br />\n•!•:•:•:•:•:•:•2,<br />\n•••••••:•!•!•:•••<br /><br />\n\"<br /><br />\n•<br /><br />\nY'Affe4'<br />\n'<br /><br />\nFor a most refreshing change:<br />\n\"Follow your friends and<br />\nswitch to this smoother<br />\nand better cigarette\"<br />\n0 P.Lorillard Co., Est. 1760<br /><br />\nf:1<br /><br />\nFIRE<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 20, 1928<br /><br />\n6<br /><br />\nBy CAROSSEL.<br />\nWith the recognition of lacrosse<br />\nby the international czars of sport,<br />\nthe Olympics Committee, the stick<br />\ngame has been given a great stimulus everywhere, and begins to assume the importance in the world<br />\nof athletics due to a game requiring the utmost in physical and mental ability. After many conferences<br />\nand their attendant lengthy discussions the Olympic lacrosse committee decided to send the championship team as a whole instead of an<br />\nall-star team to Amsterdam in June.<br />\nAs a result of this decision all eyes<br />\nare focused on the Hopkins twelve<br />\nas one of the principal contenders<br />\nfor the 1928 lacrosse crown.<br /><br />\nFAREWELL ADDRESS OF<br />\nREMSEN GIVEN HOPKINS<br />\nrecently<br /><br />\nPhi Beta Kappa Gives<br />\nLibrary Donation<br /><br />\nON THE CREASE<br /><br />\nPhi Beta Kappa has<br />\ndonate dfifty dollars to the library<br />\nhere. This sum is for the purchase of new books for the current literature shelf, and only recent books of current interest are<br />\nto be bought. Dr. French, the<br />\nlibrarian, hopes that this donation will lead to many more, for<br />\nthe Hopkins library is not very<br />\nwell equipped with current literature. The Phi Beta Kappa<br />\nSociety has inaugurated a worthy<br />\nmovement.<br />\nAlready four books have been<br />\nH. M.<br />\npurchased. They are:<br />\nReach,\"<br />\n\"Galion's<br />\nTomlinson's<br />\nMark Sullivan's \"Our Times,\"<br />\nHuddleston's \"Gentleman Johnny Burgoyne,\" and Robinson's<br />\n\"Roan Stallion.\" Other books are<br />\nto be purchased soon.<br /><br />\nou Jo get More<br />\nMilea5e fro<br /><br />\n*<br /><br />\n*<br /><br />\nThis point will go hard with the<br />\nweaker teams and defeat one of the<br />\nmajor plans of the Intercollegiate<br />\nAssociation decided upon early in<br />\nthe winter, namely, that of not running up large scores on weak opponents. With every game an Olympic tryout, it is quite natural that<br />\nevery team will try to run scores as<br />\nhigh as possible in every game.<br /><br />\nMILES OFSMILES<br /><br />\nBETHOLIN-E<br />\nTHE<br />\n\"<br /><br />\nPresent<br /><br />\n\"THE CHAMPION\"<br /><br />\nUniversity Presented Book<br />\nof Former President<br /><br />\nMr. Robert F. Skutch, Baltimore<br />\nantique dealer, has presented the<br />\nUniversity with a portfolio containing the farewell address of Dr.<br />\nRemsen. The folio was purchased<br />\nlast year at the auction of Dr. Remsen's effects. That the University<br />\nshould come into possession of this<br />\nspeech is most fortunate, as the<br />\nworld is just beginning to recognize the true value of the work done<br />\nby this great chemist. Mr. Skutch<br />\nis the father of Robert F. Skutch,<br />\nJr., who is a student here.<br />\n* * *<br />\nDr. Goodnow has officially accepted the gift from Mr. Skutch,<br />\nFor the past two years the United<br />\nwhose letter presenting it, is printed<br />\nStates Intercollegiate Lacrosse Asin full below.<br />\nsociation has seen fit to bestow stick GARFIELD AT ASSEMBLY<br />\nMarch 1, 1928.<br />\nlaurels on the Jay twelve. For the<br />\nGoodnow,<br />\nJ.<br />\nFrank<br />\nDr.<br />\n(Continued From Page 1, Column 1)<br />\ncoming season ten of last year's<br />\nJohns Hopkins University,<br />\nveterans will be back in the blue American politicians have made the<br />\nBaltimore, Md.<br />\nuniform—Finn,Leibensperger, Mal- Japanese feel that America thinks<br />\nMy dear Dr. Goodnow: I<br />\nlonee, Roy, Dotterweich, Boynton, herself too good to have Orientals<br />\nrecently learned of the redediLang, Farinholt, Biddison and Lo- here. It is mistakes like these<br />\ncation of the Chemistry Buildgan. The greatest handicap in last which cause friction between two<br />\ning, as \"Remsen Hall\" and the<br />\nseason's hard schedule proved to countries.<br />\nburial therein of the ashes of<br />\nAt the University of Hawaii all<br />\nbe the lack of strong reserve matethe late Dr. Remsen.<br />\nrial. With more than thirty prom- races mix and it is here that they<br />\nAt the dispersal of the efising candidates to develop, Coaches learn to understand each other.<br />\nfects of Dr. Remsen last year<br />\nI purchased the \"Farewell<br />\nSchmeisser, Van Orman and Dar- One finds, also, that the high post<br />\nOrion<br />\ndown<br />\nlook<br />\nold<br />\nwe<br />\nof<br />\nwhich<br />\nhost<br />\nthe<br />\nto<br />\nfrom<br />\nin<br />\nAddress\" presented to him by<br />\naddition<br />\nley,<br />\nhis colleagues on the occasion<br />\nstars who are to be seen daily watch- entals is met by an equally tall<br />\nof his retirement from the<br />\ning practice, this handicap is prac- pedestal of theirs.<br />\npresidency. In the back of the<br />\nIt is discussion in this kind of<br />\ntically overcome.<br />\nadvances<br />\nthat<br />\n\"Address\" are the signatures<br />\nfriendly atmosphere<br />\n* * *<br />\nof the donors.<br />\nthe world. Behind the legislature,<br />\ngroups<br />\ninformal<br />\nI am sending you the portthese<br />\nare<br />\nit,<br />\nhelping<br />\nThe football team has turned out<br />\nthinkthe<br />\nwith this letter. Should<br />\nfolio<br />\nIt's<br />\n.<br />\nWilliamstown<br />\nat<br />\nIndian<br />\nthe<br />\nup<br />\nen masse to take<br />\nnot<br />\nis<br />\nfind it worthy<br />\nthe<br />\nUniversity<br />\nspeaker<br />\n'<br />\nthe<br />\nin<br />\nwhich<br />\ning<br />\nhowever,<br />\npositions,<br />\nDefense<br />\ngame.<br />\nwill be much<br />\nI<br />\nresolutions<br />\nacceptance,<br />\nof<br />\npass<br />\nhave proved to be much more popu- called upon to<br />\nbeen able to<br />\nhave<br />\nto<br />\nintelpleased<br />\nbest<br />\nthe<br />\nforward<br />\nputs<br />\nlar than the attack, even with a hard which<br />\nto the<br />\naddition<br />\nthis<br />\ncontribute<br />\nefforts.<br />\nlectual<br />\nworking linesman. Evidently they<br />\ndear<br />\nour<br />\nof<br />\none<br />\nof<br />\nmemory<br />\nGeis<br />\nmen<br />\nat<br />\nof<br />\nbody<br />\na<br />\nSuch<br />\ngivof<br />\ncan appreciate the prospect<br />\n\"old-timers.\"<br />\ning someone else the wood instead neva.<br />\nWith best wishes,<br />\nMany people think the United<br />\nof receiving the legs.<br />\nYours,<br />\nthe<br />\nenter<br />\nto<br />\nready<br />\nisn't<br />\nStates<br />\n* * *<br />\nROBERT F. SKUTCH.<br />\nLeague of Nations; but it is Dr.<br />\nthe time is<br />\nDal Strader, captain-elect of the Garfield's opinion that<br />\nbefore.<br />\never<br />\nthan<br />\nripe<br />\nmore<br />\n'28 football team, is highly enjoying<br />\nThe reason for so much dissatis- Catalog Is Issued<br />\nhis job of wing defense. Despite<br />\nof Versailles<br />\nthe fact that the Indian game is en- faction with the treaty<br />\nFor Summer School<br />\n7<br />\nalley<br />\nHOPKINS—G<br />\ntirely new to him, he seems to get<br />\nThe catalog for the Summer<br />\nis that when this treaty was drawn<br />\nhis man every time.<br />\nto be given in 1928 has<br />\nCourses<br />\nit.<br />\npolish<br />\nto<br />\ntime<br />\nno<br />\nwas<br />\nthere<br />\nup<br />\nDave Kaufman, hard-working<br />\nThis is the eighteenth<br />\nissued.<br />\nbeen<br />\nto be slipped<br />\nfootball linesman and basketball Some questions had<br />\nCourses, which<br />\nSummer<br />\nthe<br />\nof<br />\nle<br />\nyear<br />\nundesirab<br />\nsome<br />\nguard, also backbone of the Red through and<br />\nJune 25,<br />\nMonday,<br />\non<br />\nbegin<br />\nwill<br />\nqueslarge<br />\nwhile<br />\nby,<br />\ngo<br />\nlet<br />\nEagles for the past four years, suf- clauses<br />\nuntil Friday, August<br />\ncontinue<br />\nbe<br />\nand<br />\nto<br />\ntable<br />\nthe<br />\non<br />\nplaced<br />\nwere<br />\ntions<br />\nfered a serious injury in his first<br />\nThe result of this 3. Dr. Edward F. Buchner is<br />\nscrimmage last Friday, which will voted on later.<br />\nthe treaty is quite again Director of the Summer<br />\nprobably keep him out of the game hurry was that<br />\nCourses. Among the eminent inmixed.<br />\nfor the rest of the season.<br />\nin the courses this year<br />\nof<br />\nstructors<br />\ndevice<br />\nthe<br />\nfor<br />\nbeen<br />\nnot<br />\nit<br />\nHad<br />\n* * *<br />\nthe Court of the League of Na- are Dr. E. Raymond Turner, Protions this mix would have ended in fessor of Modern European HisHouston, also a linesman, and<br />\nthe wreck of the treaty. It was tory; Dr. H. Carrington Lancaster,<br />\nCaplan and Bobby Lyons, backfield<br />\ndue solely to this Court, proposed Professor of French Literature;<br />\nplayers, are showing up well on the<br />\nand assiduously adhered to by Dr. Rheinhart P. Cowles, Associattack. Houston's long training for<br />\nWilson, that the treaty was saved. ate Professor of Zoology; Dr.<br />\nend runs and long forward passes<br />\nmen at Geneva are representa- Broadus Mitchell, Associate ProThe<br />\nis serving him well for his work at<br />\nof their several nations and fessor in Political Economy; Dr.<br />\ntives<br />\ncenter. Caplan and Lyons are putform a continuous body to settle all John B. Musselman, Associate Proting their experience at broken field<br />\nquestions on the table and to rectify fessor in Mathematics; Dr. Robert<br />\nrunning to good advantage in the<br />\nall undesirable clauses in the treaty. B. Roulston, Associate Professor<br />\nclose attack positions.<br />\nTheir purpose is to maintain the of German; Dr. John E. Uhler, In* * *<br />\nstructor in English; and Dr. David<br />\npeace of the world.<br />\navailall<br />\nto<br />\nsent<br />\n(Continued on page 7, Column 2)<br />\n4)<br />\nIn a long letter<br />\n(Continued on Page 7, Column<br />\nable college and club teams Satur<br />\nday by Charles Ornstein, president,<br />\nand Caspari, Wylie, secretary of<br />\nthe Olympic lacrosse committee, the<br />\nmethods of choosing the championship team to go to Amsterdam was<br />\ncarefully explained. First, and most<br />\nimportant, every game played during the season is to be considered<br />\nas an Olympic tryout.<br />\n*<br /><br />\nTHE BARNSTORMERS<br /><br />\nWONDER MOTOR FUEL:'<br /><br />\nLYRIC THEATRE<br />\nFriday, March 23 — Saturday, March 24<br /><br />\nWhether you wear a<br />\nhatjauntily,or whether<br />\nyou wear a hat soberly<br />\nand sedately, Stetson<br />\noffers you a choice for<br />\nyour every mood and<br />\nfancy.<br />\nEight to<br />\nForty Dollars<br /><br />\n•<br /><br />\nSTETSIN HATS<br />\newforyoulyncen<br /><br />\nCLOTHES<br />\nIteady-nsad•<br />\nAnd Cut to Order<br />\nESTABLISHED ENGLISH UNIVERSITY<br />\nSTYLES, TAILORED OVER YOUTHFUL<br />\nCHARTS SOLELY FOR DISTINGUISHED<br />\nSERVICE IN THE UNITED STATES.<br /><br />\n.. ,<br /><br />\nCharter howe<br />\nSuits $40,$45,$50 Topcoats<br /><br />\nimb<br /><br />\nBY SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br /><br />\nThar-ter<br />\nOF BALTIMORE<br /><br />\nThe character of the suits and<br />\ntopcoats tailored by Charter House<br />\nwill earn your most sincere liking.<br /><br />\n/he<br /><br />\nRub<br /><br />\nBALTIMORE<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 20, 1928<br />\nGARFIELD AT ASSEMBLY<br /><br />\nSUMMER COURSE CATALOG<br /><br />\nINTERCOLLEGIATE<br />\nNEWS<br />\n4t-<br /><br />\n\"What the college boy needs,<br />\nWill Rogers, the stage celebrity, is<br />\nquoted in a recent issue of a Greek<br />\nletter fraternity magazine as saying, \"is narrower pants and broader<br />\nmind.\" How about the college<br />\ngirl?<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nIn a recent editorial the editor<br />\nof the \"Cornell Daily Sun\" violently<br />\ndenounces what he terms the -ridiculous action of the student council<br />\nat that institution for refusing to<br />\npermit publication of the minutes<br />\nof its business meetings, on the<br />\ngrounds that they are nobody's<br />\nbusiness. The fiery-hearted writer<br />\nreminds the council that they are<br />\nelected by the undergraduates and<br />\nare directly responsible to them, so<br />\nwhy attempt to keep them in ignorance of their own affairs which<br />\nwould at least only serve to confirm their opinions that the council<br />\ndoes nothing.<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nAt an Inter-fraternity Conference held last February it was<br />\nfinally agreed to abolish hell week<br />\nfor fraternities at Penn State.<br />\nForty-one national fraternities and<br />\nthirteen locals agreed in arriving at<br />\nthis decision.<br />\n*<br /><br />\n*<br /><br />\n(Continued from page 6, Column 3)<br /><br />\nE. Weglein, Associate Professor in<br />\nEducation. Education is being<br />\nespecially stressed during this session, 39 courses being given, in this<br />\nsubject, 39 courses being given in<br />\nthis subject.<br />\nThe Alumni Memorial Hall, as<br />\nformerly announced, will be opened<br />\nfor the students in the Summer<br />\nCourses. Sections A, B, C, and E<br />\nare reserved for women.<br /><br />\nHave You Voted<br />\nin the<br /><br />\nNews-Letter<br />\nPresidential Election<br />\nPolls close Saturday<br />\nnoon<br /><br />\nA<br /><br />\n(Continued from Page 6, Column 2)<br /><br />\nYELLOW CAB STAND<br />\n\"But in the last ten years there<br />\nAT<br />\nhas been only political malice and<br />\nHOMEWOOD FIELD<br />\nhatred on all sides. It will be only<br />\nmisunderwhen we brush this<br />\nNo Charge for Extra Passengers<br />\nstanding and hatred to one side and<br />\n'PHONE<br />\nget to the question with the same<br />\nVERNON 1212<br />\nspirit as Wilson's that we shall<br />\nhave peace. And the only method<br />\nFOR A<br />\nadequate to obtain this peace and<br />\nYELLOW CAB<br />\npreserve it is the League of Nations.\"<br /><br />\n\"I Always Have Luckies\"<br />\nsays Betty Compson,<br />\nMotion Picture Star<br />\n\"The strain of constant posing before a<br />\ncamera is sometimes great. A few puffs<br />\nfrom a good cigarette is the quickest relief.<br />\nI always have Luckies on the set. They<br />\nsoothe without the slightest throat irritation.\"<br />\nor-eni<br /><br />\n*<br /><br />\nRumbles of protest and complaint<br />\nare steadily being heard from a<br />\nnumber of colleges against so-called<br />\ncollege pictures which have lately<br />\nbeen flooding the motion picture industry, and falaciously picturing<br />\naspects of college life to agree with<br />\ntheir popular conception. Two<br />\nhundred a,nd fifty Princeton sophomores recently signed a petition requesting a true dramatization of<br />\ncollege life or a complete relinquishment of the practice.<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nRather curious and unusual information was recently published by<br />\nthe student publication of the University of Kansas concerning cheating by the undergraduates. According to replies from a questionnaire<br />\nwhich was submitted to the students,<br />\nthree of them cheat for everyone<br />\nthat refuses to do so. Over 300<br />\nconfess that they give or receive<br />\nassistance occasionally, while 110 replied to a negative; 4 men cheat<br />\nregularly, while little over 100 state<br />\nthat it is unjustifiable; 25 have<br />\ngreater, and 50 less respect of the<br />\nstudent who refuses to crib regardless of the faults of the system;<br />\nmore than 100 think cheating permissible \"when questions are catch<br />\nquestions and the professor plays<br />\nthe part of a watchdog.\"<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nA rather unusual honor system<br />\nhas recently been adopted by Southwestern College in direct accord<br />\nwith the modern trend toward<br />\nhigher learning. Every student registering in what is termed an Honor<br />\nCourse will be exempt from one<br />\ncourse every semester to follow out<br />\nhis independent work and will consequently be excused from all examinations.<br />\n*<br /><br />\n*<br /><br />\nThe Cream of<br />\ntheTobacco Crop<br /><br />\n*<br /><br />\nSince 1916, at Wisconsin, the<br />\nMen's Student Senate has been the<br />\nsupreme arbiter in student affairs.<br />\nIn October the members voted to<br />\ndisband, after deciding that their<br />\nactual powers were too few and of<br />\ntoo little importance. Self-government will now be meted out by five<br />\nadministrative boards. Centralization will be brought about by the<br />\nunion of the chairmen of these<br />\nbodies only in the supervision of<br />\nstudent elections. Otherwise there<br />\nWill be no central board of control.<br /><br />\n„<br /><br />\n66<br /><br />\nt's toasted\"<br />\nNo Throat Irritation-No Cough.<br /><br />\n01928, The American Tobacco Co., Inc.<br /><br />\n\"Unquestionably Lucky<br />\nStrike Cigarettes are 100%<br />\nquality as this fact is proven<br />\nby their increasing popu•<br />\nlarity. Only the best tobac•<br />\nco,`The Cream ofthe Crop'<br />\ngoes into Lucky Strike Cigarettes. I buy only the<br />\nbest tobacco for Lucky<br />\nStrike Cigarettes.\"<br /><br />\naa<br />\nTobacco Buyer<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 20, 1928<br /><br />\nHOOVER TIES SMITH<br />\nIN STUDENT VOTES<br /><br />\nTennis Squad Has<br />\nFirst Work-Out<br /><br />\nWHENCE CHEN, Importer<br />\n(A JOHNS HOPKINS STUDENT)<br /><br />\nDemand<br /><br />\nTen candidates for the Hopkins 9 W. CENTRE,ST.(at N. Charles)<br />\nGiftsfrom China, all kinds<br />\ntennis team had their first work15% off for Hopkins men and friends<br />\nCandidates for Presidency<br />\nout of the season last Tuesday at<br />\nTotal 43 Votes Each<br />\nthe Fifth Regiment Armory. The<br />\nnumber of aspirants was disapRainy weather and threatening pointing, but many more are exThe NORMAN-REMINGTON CO.<br />\nskies seem to have turned campus pected as soon as the outdoot<br />\nSTORE. 347 N.CHARLES ST.<br />\nMAIN<br />\nminds toward flood control and courts are opened.<br />\n1217 N. Charles St<br />\nBargain,<br />\nBranch<br />\nconsequently to Hoover, who has<br />\nThe object of the indoor pracprofited by the adverse elements tices is to limber up the men and<br />\nto overtake Governor Smith in enable Captain Proctor and Manthe straw vote being conducted agerr. Polan to get a line on the canby the NEWS—LETTER.<br />\ndidates before the southern trip,<br />\nPossibly the same wetness which the team will take during<br />\nwhich benefited Hoover worked the Easter holidays.<br />\nthe opposite results in the case of<br />\nCaptain Proctor was the only<br />\nSmith, whom voters may have veteran who attended the practice<br />\nconsidered wet enough already. Tuesday, Craig, Gould and Gump,<br />\nFree Staters continue to ballot members of last year's freshman<br />\nfor their Governor, but not heav- team, reported; and Ed Wyatt and<br />\nily enough to bring him above<br />\nDan Leonard were also on hand.<br />\nthird place.<br />\nSeveral promising freshmen comVice-President Dawes has at<br />\nnumber to turn out.<br />\nlast secured a lone adherent at pleted the<br />\nEd Devereux, who played numHopkins, and Walsh has also sucof<br />\nnumber<br />\nA<br />\nscoring.<br />\nceeded in<br />\nber one man on the freshman team<br />\nothers have failed to find any last year and Stephen Fitzgerald,<br />\nbackers on the local campus.<br />\nwho made an enviable reputation<br />\nLatest results are shown bein prep school ranks, failed to atlow:<br />\ntend practice, but they are expected<br />\nRepublicans.<br />\nDemocrats.<br />\n43 Hoover..... 43 to report in the near future.<br />\nSmith<br />\nThe condition of the men and<br />\n32 Lowden.... 10<br />\nRitchie<br />\nReed.........3 Willis...... 4 the class of tennis displayed were<br />\n1 better than expected. An interestWalsh ......... 1 Dawes<br />\ning doubles match was played beSaturday,<br />\nPolls will close<br />\ntween Proctor and Wyatt, on the<br />\nNuAs'• —4<br />\n426,<br />\nMarch 24, at noon.<br />\n8 million a day —IT HAD<br />\none side, and Leonard and Gump,<br />\non the other.<br /><br />\nBOOKS<br /><br />\nThe Original<br />\nSPECIAL MOTOR FUEL<br /><br />\njAMOCO-GA,S(<br /><br />\n\"Halloo your name,to<br />\nthe reverberate hills,<br />\nand make the babbling<br />\ngossip of the air cry out\"<br />\nThe Bard of Avon gave much<br />\ngood advice. And this piece certainly has been followed by<br />\nCoca-Cola:<br />\nThe drink you read about. And<br />\nthe little red sign brightens the<br />\nstreets and corners of cities and<br />\ntowns everywhere, its name more<br />\nfamiliar than the names of the<br />\nstreets themselves.<br />\nThe Coca-Cola Compacy, Ar:actc, G.<br /><br />\nTO<br /><br />\nDr. Beardsley To Speak<br />\nAt Next Assembly<br />\nDr. \\V. A. Beardsley, who will<br />\nbe the speaker at the assembly<br />\nthis Thursday, has announced a<br />\ntopic of particular interest. The<br />\nsubject is \"What is Real Literature?\" The recent discussions in<br />\nthe NEWS—LETTER, and around the<br />\ncampus in generaL on the subject<br />\nof literature courses and examinations have stimulated unusual<br />\ninterest in this subject, and Dr.<br />\nBeardsley has kindly consented<br />\nto express his views'in this regard.<br />\nDr. Beardsley, who received his<br />\nA. B. from Yale, was awarded his<br />\nDoctor's degree in romance languages after several years. Of<br />\nstudy at Columbia University. In<br />\n1921 he was appointed'head of the<br />\nromance language department at<br />\nGoucher College, and he has held<br />\nthis position since that. time.<br />\nJoseph G. Blandi, president of<br />\nthe student council, announces<br />\nthat there will be a roll call of<br />\nmembers of the two lower classes,<br />\nand that those who exceed the<br />\nspecified allowance of cuts will<br />\nbe severely dealt with by the<br />\nauthorities.<br /><br />\nFOR ONE TTI-IING-THEY'RE MILD;<br />\nAND WHAT'S MORE _THEYSATISFY!<br /><br />\nNew Faces Are Seen<br />\nIn Remsen Offices<br />\nNew faces have taken the place<br />\nof old familiar ones-in the .office of<br />\nthe President and Provost. Due,<br />\nrespectively, to illness and the call<br />\nof matrimony, Miss •Saile Ellender<br />\nand Miss Mildred Leedy are not<br />\noccupying their accustomed desks<br />\nin Remsen Hall. Miss Ellender,<br />\npopular secretary to the Dean, has<br />\nbeen suffering from a nervous<br />\nbreakdown for some time, but is<br />\nexpected back shortly.<br />\nMiss Leed3,, left the University<br />\nlast Saturday to enter upon the turbulent sea of matrimony. She has<br />\nbeen in the president's office' for<br />\nnearly four. years. Miss Carrie<br />\nLoss, formerly in the registrar's<br />\noffice, is taking her place. Miss<br />\nLavareHajs- taking'Miss Ellender's<br />\nplace temporarily.<br /><br />\nMILD enough for anyone's taste,<br />\nmilder in fact than most cigarettes<br />\nand yet,they do what you've always<br />\nwanted a cigarette to do—<br />\nTHEY SATISFY!<br /><br />\nCii ESTERIFI ELI)<br />\nCIGARETTES<br /><br />\nLIGGETT &amp; WEBB TOBACCO CO.<br /><br />"}], "field_media_file": [{"target_id": 38245, "display": null, "description": null, "target_type": "file", "target_uuid": "af42681f-1591-4725-8fab-887213924308", "url": "http://digital.library.jhu.edu/system/files/2022-03/13312-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13312, "target_type": "node", "target_uuid": "b572f79d-2487-4c4b-82e7-9d99e68c5891", "url": "/node/13312"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "02ed33a5-36b4-4d41-810e-3f0c455cbde0"}]}