{"mid": [{"value": 36831}], "uuid": [{"value": "b05468d7-ef2a-42e8-b686-99e5b8302f73"}], "vid": [{"value": 36831}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:54:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13051-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:54:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:54:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "C----3P LIT57c-7---d<br />\n1_11 IL-1<br />\n.1<br />\nt 1 711<br />\nI ,<br />\n<br />\n... E........... _1<br />\n<br />\nVOL. XXVII. No. 37<br />\n<br />\nBALTIMORE, MD., MARCH 9, 1923<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nFORTY-THREE MEN REPORT BLACK AND BLUE JAY RE- SWIMMING TEAM TO PARDRAMATIC CLUB HOLDS FINAL REHEARSALS FOR<br />\nPORTED ON FIRM FINANTICIPATE IN CHAMPIONAT BASEBALL ORGANI\"THE PURPLE MASK\"<br />\nCIAL BASIS<br />\nSHIPS TOMORROW<br />\nZATION MEETING<br />\nMystery Drama to Be Presented Monday and Tuesday. HopFive Regulars from Last Year on Business Manager Reports at the Hopkins to Make Strong Bid for<br />\nkins Orchestra to Furnish Music<br />\nMonthly Dinner. Dunning<br />\nHonors. Welsh Expected to<br />\nHand. Coach McNeal Must<br />\nChosen Editor-in-Chief<br />\nCapture Dashes<br />\nFind Pitcher<br />\nmonthly<br />\nof<br />\nThe<br />\nthe<br />\nfirst<br />\ndinners<br />\nCAST<br />\nThe<br />\norganization<br />\nHopkins<br />\nswimming team<br />\nbaseball<br />\nAt the<br />\nMajolin<br />\nR Passano<br />\nmeeting held last Tuesday, March of the combined Black and Blue Jay leaves tomorrow morning for<br />\nLaurette de Chateaubriand<br />\nJ. A. Moran<br />\n6, forty-three candidates for the staffs took place Monday, March Swarthmore, Pennsylvania, to parValentine Boudet<br />\nA Hiss<br />\nCap ain Lavernais<br />\nC C. Evans<br />\nsquad and six assistant managers 5, at the Barn. At this time the ticipate in the Eastern Collegiate<br />\nFouche<br />\nF J Rich<br />\nreported to Coach McNeal. The Business Manager made an encour- Charnpionship.s. Included among<br />\nW. H. Moore, Jr.<br />\nBrisquet<br />\nmeeting was conducted by Manager aging report as to the financial stat- the other teams which will comH Smallwood<br />\nArmand de Treviere<br />\nSergeant of Gendarme<br />\nG Hess<br />\n. 7anneman, who explained that the us of the magazine. At the begin- pete are Rutgers, Lehigh and<br />\nSachs<br />\nP<br />\nBrochard<br />\nAbbe<br />\nofficial baseball schedule is being ning of the scholastic year 1922-23 Swarthmore.<br />\nK Morrill<br />\nLkutenant Roche<br />\nwithheld by the Athletic Associa- the Jay had a deficit of $400, which<br />\nC G. Hutzler<br />\nBernard<br />\nThe Hopkins swimmers hold vistion, to be released- at the opening was paid up with part of the money<br />\nH English<br />\nAnais<br />\nMme.<br />\ntories over Swarthmore and LeJ. Desch<br />\nSabine<br />\nof the spring drive for season tick- allowed the publication by the StuC R. Kennedy<br />\nBaron Vivonne<br />\nets. The schedule will contain sev- dents' Activities Fee. The outstand- high, although they have sucH Hensel<br />\nViscount de Morsanne<br />\nenteen games including six trips. • ing bills at present amount to ap- cumbed to Rutgers. The local merSergeant of Hussars<br />\nR Towsend or Webster<br />\nUpon the arrival of. Coaches Van proximately $180, and the receipts men are determined to wipe out<br />\nGate Keeper<br />\nJ. Slaughter<br />\nOrman and McNeal, the new base- for advertisments and circulation their recent defeat at the hands of<br />\nDuke de Chateaubriand<br />\nJ. Sherwood<br />\nJacqueline Brothers ......E. Z. Aaronson, H. Texas Barton<br />\nball coach was introduced to the will amount to approximately $450. the lads from New Brunswick.<br />\nC Adams<br />\nDancer<br />\nmen. He made a short address, From this report, the Black and<br />\nThe Hopkins natators this year.<br />\nHensel, J. Webster,<br />\nH<br />\nGendarmes<br />\nsaying that he was going to put all Blue Jay, according to the Business<br />\nR. Griffith, B. Hood, J. Parsons, G. Hess<br />\nhis effort into turning out an ef- Manager, is oh a sound financial have lowered several of the local<br />\nfective team. It was a talk full of basis, and might look. to the future records. Howard's plunge of 69<br />\nWith rehearsals scheduled for<br />\nencourag-ernent to everyone.<br />\nwith greater possibilities of suc- feet 6 inches in the pool at Lehigh LACROSSE COACHING COMevery available moment today, SatOf the forty-three men who re- cess.<br />\nsurpasses the former record by four<br />\nMITTEE APPROVED BY<br />\nported five are regulars from last<br />\nurday and Sunday, the Dramatic<br />\nThe matter of an adequate con- feet; Howard also traversed the 60A. A. BOARD<br />\nyear's team. They are Captain stitution for the publication was<br />\nfoot distance at the B. A. C. in the Board Considers Limitation of Club is putting on finishing touches<br />\nGrace, Thomas,.A4errick, Rich and discussed. It was decided that a<br />\nfor its annual production, \"The<br />\nComplimentaries. Swimming<br />\nHayter, while Marrian and Hol- committee should be appointed to remarkable time of 20 3-5 seconds,<br />\nPurple Mask,\" to be held at the<br />\nRecords Approved<br />\nland were first substitutes. The draw up a new constitution, which establishing another record. Welsh<br />\nSchmeisser,<br />\nTommy<br />\n\"Bill\"<br />\nTrox- Lyric Theatre next Monday and<br />\nother men and their positions are as should correct all the weaknesses swam the 50-yard dash in 24 3-5<br />\nel and Reaney Wolfe are the mem- Tuesday evenings, March 12th and<br />\nfollows:<br />\nthat appear in the old one. The seconds, and the 100-yard swim in<br />\nbers of the larcosse coaching com- 13th.<br />\nGundry,<br />\nPitchers—Schact, Ellis,<br />\nold constitution was amended to the 58 3-5 seconds, lowering the record<br />\ni\\Ianahan, Braun, Lutz, Riggs, Dra- effect that at this meeting the edi- of 1 minute 1 second established by mittee which was approved by the \"The Purple Mask,\" in which<br />\nAthletic Board last Monday night.<br />\nper.<br />\ntor-in-chief and the business man- H. A. Rowland in 1920. Dunning<br />\nThe<br />\nBoard discussed at this meet- Leo Dietrichstein starred for a<br />\nCatchers — Limbach, Osendorf, ager were elected by the combined has negotiated the 100-yard breast<br />\ning many important measures number of years on the legitimate<br />\nOates, Logan, Cook, Bortner.<br />\nstaffs. As the constitution stood stroke in 1.18 2-5, and 200-yard<br />\nInfielders—Bald, Reimer, Thom- the editorial and art staffs elected breast stroke in 3.05. Buhrer, which have been hanging fire all stage, is a mystery-drama laid in<br />\nwinter. A motion to limit the issu- the turbulent times following the<br />\nsen, Maccubbin, Wasserman, Balls, the - editorf, while the Bus- Coady, Lord and Welsh have set<br />\nof complimentary tickets was French<br />\nance<br />\nBushey, Brager, Calhoun, Ziz, iness Staff elected the Business up a new time in the 160-yard reRevolution. It depicts the<br />\nbrouglit<br />\nbefore the board. This<br />\nSeitz, Snyder, Buchner, Moss, Mor- Manager.<br />\nlay.<br />\nstruggles and rivalry existing at<br />\nquestion will be decided by the<br />\nrison, Hutzler, Easton, Hubner, Votes of thanks were given to<br />\nThe Hopkins contingent is ex- members<br />\nof the various teams at a that time between the aristocracy<br />\nJackson, Merrick.<br />\nthe various resigning. seniors, pected to have an excellent chance<br />\nmeeting<br />\nto be held on Tuesday af- and the citizenry. \"The Purple<br />\nOutfielders — Webster, Crook, whose constant work has placed the to garner a large proportion of<br />\nthe ternoon. A new form of the A. A. Mask,\" containing a<br />\ncast of approxDannettell, Marrian.<br />\nBlack and Blue Jay in the promi- points in the meet. Welsh is looked<br />\nBoard's constitution with several imately twenty-five characters, has<br />\nAssistant Managers — Dean, nent position it holds among col- upon as a sure winner in<br />\nthe 50- minor revisions was presented for<br />\nHunter, Gluck, Clark, Turnbull, lege publications. The men who yard and 100-yard dashes.<br />\nbeen coached by Mr. Walter B.<br />\nHe has approval.<br />\nWolf, Sansbury, Schmidt, Martin, resigned are L. Fenneman, Paul L. been victorious against<br />\nSwindell,<br />\na Hopkins alumnus. The<br />\nall of the<br />\nThe coaching committee which<br />\nHolls, Harp, Ningard, Jones, Sha- Ives, G. E. Hardy, Jr., P. C. Wil- competing colleges in<br />\nthese events. is now effective is different from production is presented in five acts,<br />\npiro, Long, McKay .<br />\nliams, 0. D. Collins, Howard HenThe relay team holds victories<br />\nthat which has been coaching the the fifth of which lasts but ten minA big hole was knocked in the sel, G. P. Fallon, L. A. Kelley, over Lehigh and Swarthmore<br />\nand team so far this winter. The change utes.<br />\npitching staff by graduation and John Slaughter, S. Rich, S. A. Mid- was nosed out by<br />\ninches in the Rut- in the committee is in the substituThe leading role, that of Armand<br />\nCoach McNeal will • have trouble dleton and J. M. Zoeller.<br />\ngers meet. If Dunning is feeling<br />\nde<br />\nTreviere, is played by Hugh<br />\ntion of Wolfe for Henry Baker as<br />\nfilling up the vacancies. If a suitFitzgerald Dunning was unani- fit he should make Potts, of RutSmallwood,<br />\nwho will be rememcoach of the defense players. The<br />\nable place can be secured battery mously elected editor-in-chief for gers,<br />\nstep lively to win, as Dunbered<br />\nas<br />\nRene<br />\nde Montigny, in<br />\nlacrosse squad is well organized<br />\npractice will start immediately, and the year 1923-1924, and Joseph Le- ning's time of<br />\n1.18 2-5 is better now and, although the bad weather last year's production, \"If I Were<br />\nthe whole squad will get under way opold was unanimously re-elected than<br />\nany time made by Potts so far<br />\nKing.\" W. H. Moore, Jr., last<br />\nbusiness manager. McDaniel was this year. There should be a stiff of the past week has hindered the year's Louis XIV, as Brisquet; R.<br />\nContinued on page 2, col. 3<br />\nelected managing editor; Dudley battle waged between Von Stanley, outdoor practice, the men have been Passano, as Majolin ; and C. C. G.<br />\nCotton, art editor; W. G. Packard. of Rutgers, and Howard, of Hop- held together by black-board dem- Evans, as Captain Lavernais, fill<br />\nNOTICE<br />\ncirculation manager, and Donald- kins, in the plunge. Howard de- onstrations.<br />\nThe graduate manager of athlet- other important roles.<br />\nson, advertising manager. Paul feated this man in the Rutgers meet<br />\nMeeting of entire NewsThe principal female part is<br />\nIves, the retiring editor-in-chief but is expected to have more diffi- ics warned the board of the loss taken by Joseph A. Moran, wellLetter Staff Tuesday at<br />\nContinued on page 4, col. 3<br />\npresided at the meeting.<br />\n12.20. Election of next<br />\nculty in the 75-foot pool at Swarthknown to all interested in Hopkins<br />\nnew<br />\nstaff<br />\nThe<br />\nwill<br />\ntake up their more.<br />\nyear's Board of Control.<br />\ndramatics. Moran has taken imduties beginning with the next isNOTICE TO SENIORS<br />\nGeibel, of Rutgers, is conceded<br />\nportant roles for the last three<br />\nsue of the Black and Blue Jay.<br />\nAll lacrosse equipment<br />\nto be the best man in the 220-yard<br />\nAt the recent meeting of the years and his ability as a female<br />\nwhich has been issued will<br />\nswim; likewise he will be hard to Studer-its' Activities, Council per- impersonator is familiar to all.<br />\nMARSH<br />\nbe collected from those men<br />\nELECTED<br />\nPRESI- defeat in the back stroke. This mission was granted the Hullabaloo Moran's characterization of Hughwho are not regularly atDENT OF Y. M. C. A.<br />\nman was instrumental in Rutgers' Board to reimburse seniors who ob- ette de Hamel in \"If I Were King\"<br />\ntending practice.<br />\nThe regular yearly elections of triumph over Hopkins both this tain advertisements for this issue, won him praise from reliable critthe Y. M. C. A. were held Mon- year and last. He is considered in the way of a discount on their ics. In \"The Purple Mask\" Moran<br />\nCandy will be sold at\"The<br />\nday in the M. E. Building. Upon one of the best swimmers in the class dues. In case the class dues will be Laurette de Chateaubriand.<br />\nPurple Mask\" for the benefit<br />\ndetermining the number of votes to East and his performances will be have been paid this reimbursement<br />\nOther. female parts will be taken<br />\nof June Week. Contributions,<br />\neither reject or elect the men of- watched with interest. One of the will be in the form of a rebate. by Alger Hiss, as Valentine Bouwrapped in packages of five,<br />\nfered by the nominating committee, features of the meet should be the Twenty per cent of the amount of det; J. Desch, as Sabine; and Hugh<br />\nshould be turned in to Tom<br />\nall received a large margin of \"ac- diving of Galbraith, of Rutgers, the advertisements obtained will be English, as Madame<br />\nAnais.<br />\nLandy at the Barn or at the<br />\ncepting votes.\"<br />\nwho finished second to Armstrong, so credited by the Hullabaloo<br />\nFeatures<br />\nof<br />\nthe<br />\nperformances<br />\nLyric.<br />\nThe new officers consisting of T. of Penn, in last year's Intercolle- Board.<br />\nwill be a tumbling act by JacqueReese Marsh, president; Paul Syl- giate Championships.<br />\nThis is to apply to seniors only line Brothers, including H. Texas<br />\nCoblIon Board Dance Satvester,<br />\nvice-president;<br />\nKarl<br />\nMiller,<br />\nfurther. shall not apply to Barton and E. Z. Aaronson, and<br />\n'and,<br />\nurday afternoon, 4.30, C. E.<br />\nsecretary;<br />\nRandolph<br />\nNorwood,<br />\nanyone<br />\nnow on the staff or to any- a series of dances presented by<br />\nHall.<br />\ntreasurer, will assume the duties of<br />\none who is or has been out for the Clarence Adams, leader of last<br />\nThe Annual Triangular<br />\noffice at the next cabinet dinner, to<br />\nstaff. Contracts for advertisements year's famous ballet. Both of these<br />\nTickets for \"The Purple<br />\nannounced in- the<br />\nDebate<br />\nbe held next Wednesday.<br />\nmust be in the hands of the Board features have been inserted to add<br />\nMalik\" on sale at the Barn,<br />\nNews-Letter for March 17th<br />\nThe election of committee chairthe Lyric and Military Ofon or before March 24th. Con- a college atmosphere to the producwill be held on March 24th.<br />\nmen will take place the early part<br />\nfice.<br />\ntract blanks and rates may be ob- tion.<br />\nof next week.<br />\ntained from J. D. Slaughter.<br />\nContinued on page 2, col. 5<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 9, 1923<br />\n<br />\n2<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\nFOUNDED 1897.<br />\n<br />\nNews-Letter<br />\n<br />\nSCABBARD AND BLADE MILITARY SOCIETY ADMITS<br />\nNEW MEMBERS<br />\nSociety Will Occupy Boxes at Dramatic Club Performance. Dinner Held at Hopkins Club<br />\n<br />\nTOLEDO TO HOLD COURSE<br />\nIN SCOUT WORK<br />\nThe Sociology Department at<br />\nToledo University sponsors classes<br />\nin girls' leadership. There are<br />\nnow forty-two colleges and universities in the United States that<br />\nhave adopted the plan. Though no<br />\ncredit is to be given the course will<br />\nextend from March 5 to March 17.<br />\nIt will consist of ten meetings of<br />\nof an hour and a half each, which<br />\nwill be conducted as far as is possible as a Girl Scout Troop with<br />\nspecial emphasis upon problems of<br />\nleadership and troop management<br />\nand demonstrations by local Girl<br />\nScout Troops.<br />\n<br />\nDr. Ralph U. O. Magoffin, associate professor of<br />\nGreek and Roman history,<br />\nwas elected president of St.<br />\nJohn's College at a meeting<br />\nof the board of governors of<br />\nthat institution held early<br />\nthis week.<br />\nDr. Magoffin, who is a<br />\nwell-known and popular figure on the Hopkins campus,<br />\nsucceeds Dr. Thomas Fell,<br />\nwho retires after 37 years as<br />\npresident. Dr. Magoffin will<br />\nprobably assume his duties<br />\nat the beginning of the next<br />\ncollegiate year.<br />\n<br />\nLast Monday afternoon the supply room was the scene of the spring<br />\n$2.00<br />\nSubscription<br />\ninitiation of the newly elected members of the Scabbard and Blade SoEntered as second-class matter December 3, 1909, at the Postoffice at ciety. Six commissioned officers<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nof the R. 0. T. C., all members of<br />\nthe Junior Class, were admitted to<br />\nPublished semi-weekly from October to June by the students of Johns memberhsip. The officers were the<br />\nHopkins University.<br />\nfollowing: Capt. H. B. Howard,<br />\nCapt. F. E. Campbell, leader of the<br />\nBusiness communications should be addressed to the BUSINESS MAN- band; Capt. C. R. Kennady, Second<br />\nAGER,JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nLieutenants G. V. B. Shriver, H. E.<br />\nshould be sent to the MANAGING EDITOR.<br />\nWilgis and R. Norwood.<br />\nDRAMATIC CLUB HOLDS THE<br />\nAfter the initiation, dinner was<br />\nFINAL REHEARSALS<br />\n100<br />\nHomewood<br />\n•<br />\nTelephone<br />\nserved at the Hopkins Club, at R. 0. T. C. LOWERS REContinued from page 1<br />\nwhich the regular Army officers of QUIRED GRADE FOR EXThe first night of the performEMPTION FROM EXAMS<br />\nBusiness Manager:<br />\nthe unit were present. The dinner<br />\nEditor-in-Chief:<br />\nance will be turned over to the R.<br />\nWILLIAM H. MOORE, JR., '23.<br />\nwas followed by a regular meeting,<br />\nAfter the complete reorganizaGLOVER P. FALLON, '23.<br />\n0. T. C. and tickets for this perduring the course of which it was tion of officers in the R. 0. T. C. formance may be obtained from the<br />\nManaging Editor:<br />\nAdvertising Manager:<br />\nJ. HUDSON HUFFARD, '23.<br />\ndecided that the Society would re- last week, the Military Department Military Office. Tickets for the secDONALD K. VANNEMAN,'23.<br />\nserve boxes on Monday night,<br />\nAssistant Managing Editor:<br />\nhas made other drastic changes in ond night may be obtained at the<br />\nCirculation,Manager:<br />\nJOSEPH S. LEOPOLI. '24.<br />\nMarch 12, at the R. 0. T. C. beneLyric or from members of the club<br />\nPHILIP W. HOWARD, '25.<br />\nfit performance of \"The Purple the regulations. The most imporAssociate Editors<br />\nthe Barn.<br />\nat<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nMask.\" As many members of the portant of these is the reduction<br />\nManagers:<br />\nBusiness<br />\nAssistant<br />\nJohns Hopkins Orchestra,<br />\nThe<br />\nWILLIAM G. DEAN, JR., '24.<br />\nFraternity as are able to be pres- from 85 to 75 of the grade neces- under the direction of Mr.• BOchau,<br />\nRANDOLPH NORWOOD, '24.<br />\nBERNARD C. HEARN, '23.<br />\nT. REESE MARSH, '24.<br />\nent will attend the performance in sary for exemption from the final<br />\nFITZGERALD DUNNING, '24.<br />\nwill perform both evenings. Dress<br />\nuniform and occupy the boxes.<br />\nD. MILES MARRIAN, '25.<br />\nJunior Editors:<br />\nwill be held Sunday from<br />\nrehearsal<br />\nexamination. This step was taken<br />\nRICHARD C. TILGHMAN, '25.<br />\nG. DONALD GIESKE, '25.<br />\nMany alumni of the Society and<br />\n9 A. M. to 5 P. M. at the Lyric.<br />\nJOHN W. PARSONS, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nregular Army officers will be in- after the Military Department reBENJAMIN T. ROME, '25.<br />\nThe picture for the Hullaboloo will<br />\nJOHN C. LEWIS, JR., '23<br />\nW. EDWARD THOMSEN, '26.<br />\nvited to attend with the cadet offi- alized that 8.5 was a grade too high<br />\nDIXON,<br />\nT.<br />\n'24.<br />\nJOHN<br />\nbe taken some time during that day.<br />\nJ. ARTHUR NELSON, JR., '26.<br />\ncers. It was also resolved at the to expect from the majority of the<br />\nERNEST A. STRATHMAN, '26.<br />\nA. J. McKAY, '26.<br />\nmeeting to push the sale of seats men, as evidenced by the fact that<br />\nat the Lyric for Monday night, so only a very few were exempt from<br />\nthat this week, the Unit may go the mid-year examination.<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nAnother important step is the<br />\nover the top in fine form and set<br />\nabolition<br />\nof make-up drills for abthe band and rifle team upon their<br />\nPrinted by The Read-Taylor Co., Lo mbard and South Sts., Baltimore, Md. respective financial feet.<br />\nsences: Formerly a man with an<br />\nThe Scabbard and Blade Soci- excused absence had a chance to<br />\nety is a national organization main- make it up and get full credit for<br />\ntaining chapters (or companies) in it; a man with an unexcused abBALTIMORE, MD., MARCH 9, 1923<br />\nmany colleges throughout the coun- sence was alse given a chance to<br />\ntry where the standards of the Mil- make it up, but only received halfitary Department are sufficiently credit for it. The new -regulation<br />\nhigh. The Hopkins Company is provides that excused absences do<br />\nTHE PLAY'S THE THING<br />\nknown as I Co. of the Second Reg- not have to be made up; and that<br />\nYou'd be surprised at what<br />\nhe knows! He didn't learn<br />\niment. The insignia of the organi- unexcused absences cannot be made<br />\nit all in a book, either. For<br />\nLives there a man so different from the rest of us that he does not zation, which is a red and blue bar up, and no credit will be given for<br />\ninstance-his clothes are<br />\ndreams and his grooming an<br />\nbelieve himself an actor under the skin? All the world is indeed a upon which five silver stars are af- such drills missed.<br />\ninspiration.<br />\nThe results of the ticket selling<br />\nis worn on the left breast of<br />\nHe gets that finely turned-out<br />\nstage with all of us the actors; some of us possessing more imagination, fixed<br />\nhead from\"Vaseline\"HairTonic.<br />\nfor<br />\nthe production of \"The Purple<br />\nthe military blouse. The total enIt smooths and grooms the hair.<br />\nsome of us less. Imagination and self-confidence make mere man an rollment of the national body is now Mask\" for the R. 0. T. C. benefit<br />\nAt all drug stores and student<br />\nbarber shops.<br />\nfully<br />\ndetermined.<br />\nclose to 2,500, and the society is have not yet been<br />\nactor in the sense that the word is used today.<br />\nEvery \"Vaseline\"Product is<br />\nrecommended everywhere<br />\ngrowing with rapid strides. Mem- The Military Department is confibecause of its absolute purity and effectiveness.<br />\nWhat better place to learn the art of acting than at college, where bership is limited to cadet officers. dent, however, that the production<br />\ntime, the Hopkins will be successful from a financial<br />\n'the drama is studied and where imagination and self-confidence are de- At the present<br />\nCompany has a personnel of about standpoint. Candy is to be sold on<br />\nveloped. It is only reasonable to believe that talent, given the benefit twenty undergraduates.<br />\nboth show nights for the benefit<br />\nof June Week, and members of the<br />\nof college training, should prove that much the better for it. To be<br />\nFACULTY NOTES<br />\nR. 0. T. C. have been requested to<br />\nsure the college dramatist lacks experience but he should make up in<br />\nAmong the honors recently won get whatever donations -of candy<br />\nChesew eugh ivWs.Co<br />\nby members of the faculty is Pro(consolidated)<br />\nother ways for his lack in this.<br />\nthey can.<br />\nfessor Vincent's election as a FelThe players of the JOHNS HOPKINS DRAMATIC CLUB low of the Loyal Historical Society<br />\nof London.<br />\nhave been educated to their play, \"THE PURPLE MASK,\" by Mr.<br />\nForty-three Men Report for<br />\nSwindell, who does not believe in a mere memorizing of lines. As a<br />\nBaseball<br />\nconsequence, this production falls in a class by itself-not professional,<br />\nContinued from page 1.<br />\n<br />\nSOPHISTICATED<br />\n<br />\nasehne<br />\nREG. U.S. PAT.0,,<br />\n<br />\nHAiR TONIC<br />\n<br />\nbut well above the amateur.<br />\n<br />\nas soon as the weather permits.<br />\nThe infield will have to be built<br />\nAside from the art of the playei-s, the play itself is a superior bit of up about \"Buck\" Grace and \"Ben\"<br />\nwriting. As gripping as \"The Bat\"; as colorful as \"When Knighthood Thomas, the only survivors of last<br />\nyear's regulars. Merrick of past<br />\nWas in Flower\"; as mysterious as \"Unknown Purple\"; and as magseason's nine, will be a likely man<br />\nnificent as \"If I Were King,\" the club's offering, \"The Purple Mask,\" for a position in the inner defense.<br />\nThe outfield promises to be the<br />\nis an ideal piece for the University dramatists.<br />\nbest in years. Rich and Hayter are<br />\nThe play, somewhat less poetic than that of last year, is even more both letter men, and Marrian, who<br />\nsubstituted last year, shows possiinteresting and has been timed so that the conclusion of the fifth act will<br />\nbilities in making his place in the<br />\npermit the dancing, which will follow in the Little Lyric, to begin at trio.<br />\nManager Vanneman wishes to<br />\neleven-fifteen. If this aim is accomplished, the main objection to amabring to the attention of an canditeur theatricals will be overcome.<br />\ndates for assistant managers, as<br />\nwell as for the squad, that it is abUpon the financial success of Tuesday night's performance depends<br />\nsolutely essential that they secure<br />\n,the possibility of musical comedy next year. The profits of this per- their physical measurement cards<br />\nformance are turned into the coffers of the Student Activities Council, from Dr. Abercrombie before they<br />\ncan be officially counted on the baseto the credit of the Dramatic Club.<br />\nball roll. He wishes particularly<br />\nto remind Juniors and Seniors that<br />\nThere are very few who miss the annual production. It is only<br />\nthis order applies to them as well as<br />\nhoped that the support will be as good as in the past.<br />\nto the lower classmen.<br />\n<br />\nIIIIIIIIIIIIIIII•111IIIIIIIIIIIIIIIIIIIIIIIIIIIIII<br />\nIII<br />\nI'<br />\n\"Best Paid Hard Work in the World\" a<br />\nII<br />\nII<br />\nsalesman described<br />\ns the way a JoHN<br />\nHANCOCK<br />\n<br />\nIl<br />\na<br />\nIII<br />\nII<br />\nMi<br />\nII<br />\nil<br />\n111<br />\nII<br />\nIII<br />\na<br />\n111<br />\nII<br />\n111<br />\nIl<br />\n01<br />\n1111<br />\n<br />\nhis work. He is a college graduate and in five<br />\nyears has put himself at the very top of his<br />\nbusiness.<br />\nHe never yet has called upon a prospect without<br />\na previous appointment. The best life insurance<br />\nsalesmen today work on that plan, making it a business of dignity, such as any worthy and ambitious<br />\ncollege graduate can find satisfying to his mental<br />\nneeds, and highly remunerative as well.<br />\nThe man above quoted is the John Hancock's<br />\nyoungest general agent. This shows what college<br />\ngraduates of the right type can do in this business,<br />\nhow they can build up earning power and at the<br />\nsame time provide for an accumulated competence<br />\nfor the years to come.<br />\nGraduation is a vital period in your life and you<br />\nare liable to hold to the business you start in. It<br />\nwould be well before making a definite decision to<br />\ninquire into life insurance as a career. Address,<br />\n\"Agency Department.\"<br />\n<br />\nII<br />\nII<br />\nli<br />\nII<br />\n1111<br />\nIII<br />\nII<br />\n111<br />\n1111<br />\nIII<br />\nIII<br />\na<br />\n111<br />\nIII<br />\nIl<br />\nIll<br />\nIII<br />\nillik<br />\nl<br />\nII<br />\nCOMPANY<br />\nLI FE INSURANCEI<br />\nM<br />\n<br />\n1111<br />\n<br />\nIII<br />\nI.<br />\n<br />\nOF<br />\n<br />\nT<br />\n<br />\nA L<br />\n<br />\nBOSTON. MASSACHUSETTS<br />\n<br />\nLargest Fiduciary Institution in New England<br />\n<br />\nIII<br />\n<br />\n1111<br />\n<br />\nIIIIIIMMIIIIIIIIIIIIIIIIIIIIIIIIIIIEIIII<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 9, 1923<br />\n<br />\n3<br />\n<br />\nHOPKINS RIFLE TEAM DE- DR. COALE ADDRESSES THE in the British team, and already<br />\nCHRISTIAN SERVICE CLUB many are asking in what shape the<br />\nFEATED BY UNIVERSITY<br />\nOF IOWA<br />\n\"The Opportunities for Members American colleges are to meet this<br />\nWesterners Win by Twenty-seven of the Christian Service Club\" was new athletic invasion of our shores.<br />\nPoints. Last Stage of Intercol- the subject of a talk delivered by It is, thus, reassuring to be told<br />\nthat the East has at least three<br />\nlegiates Completed<br />\nDr. J. J. Coale, secretary for the teams—namely, those from<br />\nYale,<br />\nThe University of Iowa defeated Federation<br />\nof<br />\nPresbyterian Georgetown and Cornell—that will<br />\nWARNER & COMPANY<br />\nthe Johns Hopkins University in a<br />\nChurches, before the club at a re- give valiant battle to the English<br />\nHATTERS<br />\nrifle match during the week ending<br />\ncent meeting.<br />\nrunners. The West is still to be<br />\n222 W. BALTIMORE ST.<br />\nMarch 2, the score was Iowa, 1703;<br />\n\"In the religion of today,\" Dr. heard from, but indications are that<br />\nHopkins, 1676. All four positions<br />\nCoale<br />\nbegan, \"we must make no Chicago, Kansas and other Westwere used, with five shots from<br />\nintellectual compromise with truth. ern colleges will also have fast quarThe individual<br />\neach position.<br />\nThings must be seen as they are; tettes to put into this important<br />\nscores were as follows:<br />\nfacts must be faced. At the pres- event.<br />\nYou collegians who stroll along the campus will<br />\nJohns Hopkins University<br />\ntime, man is oppressing man.<br />\nbe<br />\nent<br />\namong the first to sense the coming of Spring.<br />\nThough<br />\nthe<br />\nInternational irace<br />\nG. M. Ruoff—Prone 47, sitting<br />\nWar, that devastating plague, will be the big feature of the<br />\nDoesn't<br />\nthat suggest something to you in the<br />\ncom49, kneeling 49, standing 38. Total<br />\nmatter of clothes?<br />\ndrives men from the truth, and ing Carnival, the meeting<br />\npromises<br />\n183.<br />\nGo in for Stein-Bloch and Goodman and Suss<br />\nmakes them little better than the in other respects to be up<br />\nto a highJ. E. Mount—Prone 50, sitting<br />\nSuits<br />\nif you want to know college style at its best.<br />\nmost savage of wild animals. Even er standard than ever<br />\nbefore. The<br />\n47, kneeling 45, standing 39. Total<br />\nwars between labor and capital are indoor season which is now<br />\nat its<br />\n181.<br />\ndespicable, and yet they are ever height has already<br />\nshown that the<br />\nH. E. Wilgis—Prone 47, sitting<br />\nwith us.\"<br />\nAmerican colleges are in for the<br />\n46, kneeling 45, standing 37. Total<br />\nDeploring this state of affairs, most brilliant track and<br />\nfield sea175.<br />\nDr. Coale asked if the church had son in their history. Wonderful<br />\nsit45,<br />\nThiessen—Prone<br />\nE.<br />\nA.<br />\n(Y. M. B. 0. D.)<br />\nfailed. The church has told what records are being made in<br />\nall the<br />\nting 39, kneeling 45,. standing 41.<br />\nought to be done, •but has it fol- events. For instance, last<br />\nweek,<br />\nTotal 170.<br />\nBaltimore and Hanover<br />\nlowed out its own teachings?<br />\nCharles<br />\nPaddock,<br />\nof<br />\nthe<br />\nUniversity<br />\nW. M. Rowland—Prone 50, sit- The solution of the problem of<br />\nting 42, kneeling=42= standing 35. discord, strife and trouble is, ac- of Southern California, ran the 100<br />\nyards in 94-5 seconds, wonderful<br />\nTotal 169.<br />\ncording to Dr. Coale, love. It is<br />\nJ. A. Cochran—Prone 46, sitting up' to us--to tell and show people time for so early in the season.<br />\n•48; kneeling 36, standing 38. Total how to love each other. When we \"Boots\" Lever, of Pennsylvania,<br />\nwas beaten only a foot by Murchi168.<br />\nsay that the Germans must be dealt<br />\nR. E. Parks—Prone 49, sitting with by means of bayonets, we cast son, of the Illinois, A. C., at 60<br />\n46, kneeling 43, standings 27. Total aside our doctrine of love. A man yards, in a new world record time<br />\nof 6 1-5 seconds. Brown, of Dart165.<br />\nwho wants to go into the ministry<br />\nF. T. Bates—Prone 47, sitting and teach this doctrine, ought not mouth, recently cleared 6 feet 5 1-4<br />\n44, kneeling 46, standing 27. Total to go if he does not have an over- inches, a new indoor high jump<br />\nrecord. A dozen men have gotten<br />\n164.<br />\nwhelming love for humanity in his<br />\nover 12 feet 4 inches or better in<br />\n49,<br />\nsitWilliams—Prone<br />\nF. E.<br />\nheart. Therefore, Dr. Coale conthe<br />\npole vault, the most notable per- American Journal of Mathematics. Edited by Frank Morley, A. Cohen, Asting 43, kneeling 42, standing 26. cluded, the solution of the oppressistant Editor, with co-operation of Charlotte A. Scott, A. B. Coble, and<br />\nformance<br />\nbeing that of Owen, of<br />\nTotal 160.<br />\nother mathematicians. Quarterly. 8vo. Volume XLV in progress. $6<br />\nsion and strife which is so wideper volume. (Foreign postage fifty cents.)<br />\nJ. D. Virdin—Prone 48, sitting spread today is the opportunity to Pennsylvania, who cleared 12 feet<br />\n45, kneeling 36, standing 12. Total those who are going into the min- 7 inches recently. Seven or eight American Journal of Philology. Edited by C. W.E.<br />\nMiller, with the co-operamen have put the shot better than<br />\ntion of M. Bloomfield, H. Collitz, T. Frank, W. P. Mustard, D. M. Robin141.<br />\nistry.<br />\nson. Quarterly. 8vo. Volume XLIV in progress. $5 per volume.<br />\n42 feet, while Meyers, of Rutgers,<br />\nGrand total 1676.<br />\nAt the next meeting of the club,<br />\n(Foreign postage, fifty cents.)<br />\nrecently defeated Thompson, forUniversity of Iowa<br />\nDr. Craig Stewart, of Illinois, who<br />\nJournal of Psychiatry. E. N. Brush, J. M. Mosher, C. K. Clarke,<br />\nParker—Prone 49, sitting 48,_ is preaching at Old._St._Paul's_Epis-. merly of Dartmouth, in a 70-yard American<br />\nC. M. Campbell and A. M. Barrett, Editors. Quarterly. 8vo. Volume<br />\nkneeling 49, standing 45. Total 11. copal Church during the Lenten hurdle -race in new record time.<br />\nII in progress. $5 per volume. (Foreign postage, fifty cents.)<br />\nDawson-Prone 47, sitting 48, season, will make an address. Dr. Hellfrich, of Penn State, came with- Beitrage<br />\nzur Assyriologie und semitischen Sprachwissenschaft. Paul Haupt<br />\nkneeling 44, standing 42. Total 181. Stewart has accepted the invitation in 2-5 seconds of the world's 600and Friedrich Delitzsch, Editors. Volume X in progress.<br />\nZeiner—Prone 48, sitting 47, to address the club on Tuesday, yard record at the Millrose games,<br />\nHesperia. Hermann Collitz, Henry Wood and James W. Bright, Editors.<br />\nkneeling 45, standing 40. Total 180. March 13. As this is the date of and on the same evening Connolly<br />\nSeventeen numbers have appeared.<br />\nBunker—Prone 50, sitting 44, the Dramatic Club production, Dr. of Georgetown, made new world's<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4vo. Volume XXXIV in progkneeling 43, standing-41. Total 178. Stewart will be asked to change the figures at two-thirds of a mile. Tayress. $4 per year. (Foreign postage, fifty cents.)<br />\nKoeberle—Prone 49, sitting 48, night to Thursday, March 15. If lor of Princeton, Woodring of<br />\nJohns Hopkins Hospital Reports. 8vo. Volume XXI in progress. $5 per<br />\nkneeling 37, standing 43. Total 177. he is unable to do so, the club will Syracuse, the Olympic 200-metre<br />\nvolume. (Foreign postage, fifty cents.)<br />\nRuppel—Prone 49, sitting 47, have its meeting, as scheduled, on champion; Koppisch of Columbia,<br />\nJohns Hopkins University Circular, including the Presidents' Report, Annual<br />\nand Baker of Virginia, have all'<br />\nkneeling 41, standing 37. Total 174. March 13.<br />\nRegister and Medical Department Catalogue. Seven times a year. 8vo.<br />\n$1 per year.<br />\ndone close to 50 seconds indoors<br />\nEdwards—Prone 46, sitting 48,<br />\nfor the quarter mile. Brilliant per- Johns Hopkins University Studies in<br />\nkneeling 40, standing 39. Total 173.<br />\nEducation. E. F. Buchner, Editor. 8vo.<br />\nPENN. RELAY CARNIVAL AN formances<br />\nSeven numbers have appeared.<br />\nhave been seen all over<br />\nHalbasch—Prone 49, sitting 41,<br />\nINTERNATIONAL EVENT<br />\nthe country, but especially in the Johns Hopkins University Studies in Geology.<br />\nkneeling 42, standing 31. Total 163.<br />\nE. B. Mathews, Editor. 8vo.<br />\nAGAIN<br />\nEast and Middle West. All of the<br />\nFour numbers have appeared.<br />\nOlson—Prone 47, sitting 43,<br />\nkneeling 31, standing 34. Total 155. Oxford University, England, Will above men will be seen at Pennsyl- Johns Hopkins University Studies in Historical and Political Science. Under<br />\nRun in Two-mile Relay. 400<br />\nvania's Relay Carnival. In addithe direction of the Departments of History, Political Economy and PolitiTreboar—Prone 33, sitting 30,<br />\ncal Science. Monthly. 8vo. Volume XLI in progress. $5 per volume.<br />\nInstitutions Entered<br />\ntion, the relay racing has been up<br />\nkneeling 41, standing 27. Total 131.<br />\nThe Twenty-ninth Annual Relay to a very high standard, so that new Modern Language Notes. J. W. Bright, Editor-in-Chief, G. Gruenbaum, W.<br />\nGrand total 1703.<br />\nKurrelmeyer and H. C. Lancaster. Eight times yearly. 8vo. Volume<br />\nCarnival under the auspices records may be expected in more<br />\nRace<br />\nDuring the same week in which<br />\nXXXVIII in progress. $5 per volume. (Foreign postage, fifty cents.)<br />\nPennsylvania<br />\nof<br />\nthe<br />\nUniversity<br />\nof<br />\nthan<br />\none<br />\nof<br />\nthe<br />\nCollege<br />\nrelay<br />\nchamIowa was met, the fourth and last<br />\nof Economic Tracts. J. H. Hollander, Editor. Fourth series in progstage of the intercollegiates was will be held this year on Friday and pionships that will be run, as usual, Reprint<br />\nress. $2.00.<br />\n28th.<br />\nThis<br />\nSaturday,<br />\nApril<br />\n27th<br />\nand<br />\nin<br />\nconnection with Pennsylvania's<br />\ncompleted. The unofficial results<br />\nReports of the Maryland Geological Survey. Edited by E. B. Mathews.<br />\ngreat Carnival, which is now ac- classic.<br />\nwere as follows: angreatest<br />\nknowledged<br />\nto<br />\nbe<br />\nthe<br />\nJ. E. Mount—Prone 99, sitting<br />\nThough the date of the meet is Terrestial Magnetism and Atmospheric Electricity. L. A. Bauer, Editor.<br />\nQuarterly. 8vo. Vol. XXVIII in progress. $3.50 per volume. (Foreign<br />\nnual track and field meeting held practically two months off,<br />\n'95. Total 194.<br />\nthere<br />\npostage, 25 cents.)<br />\nworld<br />\nannually,<br />\nG. M. Ruoff—Prone 98, sitting any place in the<br />\nare already close to 400 institutions<br />\nwill again have international impor- entered, so that last year's<br />\n92. Total 190.<br />\nrecord<br />\nR. E. Parks—Prone 97, sitting tance. This is due to the fact that list of 425 is sure to be exceeded.<br />\nOxford University, England,.will These include already over<br />\n93. Total 190.<br />\n80 col- The Eclogues of Baptista<br />\nMantuanus. By W. P. Mustard, 156 pp. $1.50.<br />\na two-mile team to compete in leges drawn from the<br />\nsend<br />\nW. M. Rowland—Prone 95, sitentire United<br />\nthe American college two-mile re- States. The Carnival will thus be The Piscatory Eclogues of Jacopo Sannazaro. By W.P. Mustard. 94 pp. $1.25.<br />\nting 95. Total 190.<br />\nchampionship. This will be very finer<br />\nlay<br />\nH. E. Wilgis—Prone 95, sitting<br />\nthan ever and of the most rep- The Eclogues of Faustus Andrelinus and Joannes Arnolletus. By W.P. Mustard. 123 pp. $1.50.<br />\nwelcome<br />\nand interesting news to resentative character.<br />\n94. Total 189.<br />\nPennsylpresent<br />\nin<br />\nwere<br />\nWest<br />\nFlorida Controversy, 1798-1813. By I. J. Cox. 702 pp. $3.<br />\nthousands<br />\nwho<br />\nthe<br />\nGrand Total 953.<br />\nvanie's new stadium seats over 40,from<br />\nfour-mile<br />\nwhen<br />\na<br />\nteam<br />\n1914<br />\nThis week the same team that<br />\n000, but with such a wonderful ar- An Outline of Psychobiology. By Knight Dunlap. 145 pp. 84 cuts. $2.50.<br />\nshot against Iowa is meeting Car- Oxford was here and in 1920, when ray of teams and individual athletes, The Life and Stories of the Jaina Savior Pargvanatha. By M. Bloomfield.<br />\n256 pp. $3.00.<br />\nnegie Tech in a match from the a combined Oxford-Cambridge two it is already predicted that it will<br />\nProne and standing positions, ten mile team appeared on Franklin be filled to the gates to do honor to American Citizenship and Economic Welfare. By J. H. Hollander. 132 pp.$1.25.<br />\nshots from each position. At the Field. The 1914 race wis the most the flower of America's college and Martial, the Epigrammist and Other Essays. By K. F. Smith. Edited by<br />\nW. P. Mustard. 180 pp. $2.<br />\nsame time, the University of Wash- sensational race that has ever been school athletes and the visitors from<br />\nAn Economic History of Rome to the End of the Republic. By Tenney Frank.<br />\nington is furnishing the opposition seen in this country as Oxford won Oxford.<br />\n310 pp. $2.50.<br />\nin a match from all four positions, by a hair. The 1920 race produced<br />\nPublic Health and Insurance: American Addresses. By Sir Arthur Newsa new two-mile relay record, though<br />\nfive shots from each position.<br />\nholme.284 pp. $2.50.<br />\nIrate Diner—\"Waiter! Here's a<br />\nthis record was effaced .from the<br />\nChina at the Conference. By W. W. Willoughby. 435 pp. $3.00.<br />\nneedle in my soup!\"<br />\nWht was the girl that went in- books last season by the wonderful<br />\nTables of V1—r2 and 1—r2 for use in Partial Correlation and in Trigonometry.<br />\nWaiter (ex-printer)— \"TypoBy J. R. Miner. 50 pp. $1.50.<br />\nto the bank and asked for a check- team which the University of Pennproduced.<br />\nVector<br />\nAnalysis and the Theory of Relativity. By F. D. Murnaghan. 136 pp.<br />\nsylvania<br />\nthen<br />\ngraphical<br />\nerror,<br />\nsir;<br />\nit<br />\nshould<br />\nbe<br />\nbook for a lady that folds up in<br />\n$2.75.<br />\nthe middle?—Green Gander.<br />\nThe keenest interest will be taken noodle.\"—Cougar's Paw.<br />\nA complete list of publications sent on request.<br />\n<br />\nThe \"COLLEGIAN\"<br />\n<br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br />\n<br />\n$A<br />\n.50<br />\nup<br />\n<br />\nThe Johns Hopkins Press<br />\nof Baltimore<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 9, 1923<br />\n<br />\n4<br />\n<br />\nPENN CONSIDERS SEPARATE CHANCE FOR SERVICE IN<br />\nU. S. COAST GUARD_<br />\nCOLLEGE FOR WOMEN<br />\nThe recent co-ed question at The United States Coast Guard<br />\nPRESCRIPTION DRUGGISTS<br />\n(THE BOOK MART)<br />\nTWO STORES:<br />\nHopkins has found an echo on the will hold a competitive examination<br />\nComplete Stock of<br />\ncadet<br />\nof<br />\nfor<br />\nengineers<br />\nappointment<br />\nEutaw Place and North Ave.<br />\nSts.<br />\nChase<br />\nand<br />\nCharles<br />\ncampus of the University of PennMedical Books and College<br />\ncommencing April 16th, 1923. This<br />\nMadison 0405<br />\nVernon 0890<br />\nRequisites<br />\nsylvania. There the question is not<br />\nis an exceptional opportunity for<br />\nImporters and Dealers in Fine Books one of \"to admit or not to admit\" young men of the right calibre to<br />\nbut concerns the proposed estab- complete their education at Govern301 N. CHARLES ST.<br />\nMore Mileage<br />\nlishment of a separate college for ment expense and to become comBaltimore, Md.<br />\nMore Power<br />\nwomen, as mentioned by Provost missioned officers in the United<br />\nMEN'S<br />\nmilSHOES<br />\nthe<br />\nof<br />\none<br />\nGuard,<br />\nCoast<br />\nStates<br />\nPenniman in an address to the alum4<br />\nOf the Better Class<br />\nni. A decided variance of opinion itary services of the United States,<br />\nt-tt<br />\nafloat<br />\nservice<br />\nprevails among the female students in which is offered<br />\nand ashore.<br />\nof the university.<br />\nCadet Engineers are trained to<br />\nThe attitude of the women stu•<br />\nGuarantees Both!<br />\nengineer officers, and the<br />\nbecome<br />\nURNER BROTHERS<br />\ndents is interesting. One group<br />\nare 20<br />\n111 E. BALTIMORE STREET<br />\ndeplores outright the proposed sep- age limits for appointment<br />\nSHERWOOD BROTHERS, INC.<br />\nBALTIMORE<br />\nare<br />\nengineers<br />\nCadet<br />\nyears.<br />\n25<br />\nto<br />\narate college. Quoting Pope, \"The<br />\n711171111111IFITIFIFFE11:71::\"E\"E\"EVES<br />\nII11711111\"2Coast<br />\nH.& OSCAR G<br />\nstudy of man is man,\" and they, trained and educated at the<br />\nOWNERS<br />\nLondon,<br />\ntherefore, reason that knowledge of Guard Academy at New<br />\n2'141•Ca414,b#<br />\ntaken<br />\nare<br />\nsummer<br />\neach<br />\nand<br />\nConn.,<br />\none's future life partner can only<br />\n29 Baltimore St., East<br />\nCacruise.<br />\npractice<br />\nextended<br />\nan<br />\non<br />\nbe obtained by attending classes<br />\nOne Door West of Light St.<br />\nsame<br />\nthe<br />\npay<br />\nreceive<br />\nengineers<br />\ndet<br />\nBOLE AGENTS FOR BALTIMORE with him. On the other hand, the<br />\nand individuality is offered here at prices that are not<br />\nin<br />\nmidshipmen<br />\nas<br />\nallowances<br />\nand<br />\nFor College Fraternity Bands<br />\nother more studious-minded facand cannot be underquoted by any house at any time.<br />\none<br />\n(Greek Letter Societies)<br />\nannum<br />\nand<br />\nper<br />\ntion agree that it will be advan- the Navy ($780<br />\nBesides the reputation of an old-established firm<br />\nII<br />\ntageous to segregate the girls, as ration per day).<br />\nof each sale with a guarantee.<br />\nback<br />\nis<br />\ngraduaupon<br />\nA cadet engineer,<br />\nit would lend to more uninterrupttion, after one year at the Academy,<br />\ned study.<br />\nPrinters of Philological and<br />\nan ensign (engiThe male students, however, are is commissioned<br />\niDECORATIONS<br />\nDRAPERIES<br />\nFURNI7 URE<br />\nScientific Works<br />\nofficers of<br />\nCommissioned<br />\nneering).<br />\nfaof<br />\nattitude<br />\ntheir<br />\nunanimous<br />\nin<br />\nNORTH<br />\nCHARLES<br />\nSTREET<br />\n343<br />\n23 S. HANOVER ST.<br />\nCoast Guard rank with officers<br />\nvoring the change. In one breath the<br />\nBaltimore, Md.<br />\nArmy, Navy, and Marine<br />\nthe<br />\nin<br />\nthey are elated, delighted, pleased,<br />\nreceive corresponding<br />\nand<br />\nCorps,<br />\noverjoyed, and exultant. They say<br />\ngrade for<br />\nallowances,<br />\nand<br />\npay<br />\nthat Penn was originally intended<br />\ngrade.<br />\nto be a man's college and that the<br />\nCadet engineer candidates who<br />\nThe Greetings of a Fine Store<br />\npresence of the girls is so distractevidence that<br />\nsatisfactory<br />\npresent<br />\ning that their averages will undoubtcompleted a course in<br />\nTo the Students of a Fine University<br />\nedly be higher after the distracting they have<br />\nengineering at an engimechanical<br />\nelements are removed.<br />\nneering school will be required to<br />\nOn the other hand, the women<br />\nan examination in History,<br />\nstudents declare the men are mere- pass<br />\nSOMETHING NEW<br />\nand General Information.<br />\nMUSIC<br />\nHOCHSCHILDROHN<br />\nly jealous. \"When we sit in classes English<br />\nwho<br />\nengineer<br />\ncadet<br />\nfor<br />\nCandidates<br />\nBeginning March 5<br />\nwith them and hear them fail.daily,<br />\nEvery Afternoon Except Saturday<br />\nhave not completed a course in meFrom 2 until 4 o'clock<br />\nthey are no longer able to 'lord it'<br />\nengineering at an engineerchanical<br />\nDancing after 3 o'clock<br />\nover us, and prate about their su11.30 A. M. to 7.30 P. M.<br />\nshould present certifischool<br />\ning<br />\nSARATOGA & LIBERTY<br />\nperior intelligence. But it appears<br />\nshowing the extent of the<br />\ncates<br />\nthat the women, divided, will fall,<br />\ncourses of study pursued by them<br />\nwhile the jealous men, united, will<br />\nthe following subjects, in which<br />\nin<br />\nFine Clothes<br />\nonce more walk the halls of a colwill be examined: mathematthey<br />\nA suit by Lemmert gives the final lege that is to all intents and purics,<br />\nphysics, applied mechanics,<br />\ntouch to the lasting satisfaction you poses a man's.\"<br />\nderive from thoroly dependable<br />\nsteam engineering, electricity, his518 N. CHARLES STREET,BALTIMORE<br />\ncloths cut in authentic fashion—<br />\nwhether for every-day wear or more SOPHOMORES HOLD NOMI- tory, English, and general informafestive occasions.<br />\nOrchestra—Dancing<br />\ngeneral adapta- Telephone, Vernon 3442<br />\nNATIONS FOR TREASURER tion. A mark for<br />\nto<br />\napplicants<br />\nbility will be assigned<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M.<br />\nat<br />\nLEMMERT<br />\nAt a meeting of the Sophomore<br />\nfor cadet engineer. The examinaTABLE<br />\nD'HOTE<br />\nClass, held Wednesday, George<br />\n19 Fayette Street, East<br />\ntion is strictly competitive.<br />\nLUNCHEON-60c<br />\nD1NNER—$1.00<br />\nDress Clothes Klinefelter was elected treasurer to<br />\nBusiness Suits<br />\nExaminations will be held at BosSUNDAY DINNER—$1.25<br />\nreplace Bill Towney, who was<br />\nSport Togs<br />\nOvercoats<br />\nton, New London, New York, Philforced to withdraw from the Uniadelphia, Washington, Norfolk, Saversity.<br />\nvannah, Buffalo, Detroit, Chicago,<br />\nAt a previous meeting, in addiFort Stanton, San Francisco, SeatMANUFACTURING JEWELERS<br />\ntion to the nominations for this oftle, should sufficient applicants be<br />\nLancaster, Pa.<br />\nfice, various business was transactClass Rings, Pins, Fraternity Pins,<br />\ndesignated at these cities to warCups, Medals, Etc.<br />\ned. Earl Donaldson, chairman of the<br />\nholding such examination, and YOU WILL FIND OUR STOCK OF STANDARD MAKE SETS<br />\nrant<br />\nStationery, Invitations, Programmes<br />\nSophomore Dance Committee, re\"Makers of the Varsity Seals\"<br />\nsuch other places as may be desigAND APPARATUS WILL MEET YOUR EVERY NEED<br />\nported the progress of the comnated.<br />\nCOMPLETE VACUUM TUBE RECEIVERS, $39.95 UP<br />\nmittee in preparation for the<br />\nThe opportunity this year is parSophomore dance, which will be<br />\nticularly favorable, as there are an<br />\nheld Friday, April 20, in the C.<br />\nunusually large number of vacanCommercial Photography<br />\nE. Hall. It was announced that<br />\n1724 N. CHARLES ST.<br />\nAll existing vacancies will be<br />\ncies.<br />\nCircuit Photography<br />\nthe party would be formal and<br />\n10 Minutes from Hopkins<br />\nSuccess- Vernon 3055<br />\nViews that the well-known Blue Jay Six filled this year if possible.<br />\nFlash Lights<br />\ncandidates will report at the<br />\nful<br />\nGroups<br />\nEnlargements had been engaged to furnish muSHOES<br />\nAcademy about three weeks after<br />\nsic.<br />\nKODAK FINISHING<br />\nfor<br />\nthe close of the examination.<br />\nD. P. Cotton, chairman of the<br />\n325 N. Howard St.<br />\nFor further particulars, write to<br />\nMEN<br />\nUNIVERSITY<br />\nring committee, reported to the<br />\nMt. Vernon 4999<br />\nCommandant, U. S. Coast<br />\nThe<br />\nclass that the committee was at<br />\nFor Sport Wear<br />\nFor Dress<br />\nGuard, Washington, D. C.—The<br />\npresent waiting for more designs.<br />\nSmart Styles—Best Leathers<br />\nSHIRTS<br />\n4/<br />\nNECKWEAR He also requested the class to de- Lehigh Brown and White.<br />\n41<br />\nOver<br />\none<br />\nhundred<br />\nyears<br />\nPrice:<br />\nModerate<br />\n4/<br />\ncide on a general price limit for<br />\nof<br />\ndesigning<br />\nand<br />\ncreating 41<br />\nCommittee<br />\nCoaching<br />\nLacrosse<br />\nthe ring. After much discussion<br />\n0<br />\n421 N. HOWARD ST.<br />\n<, Silverware assures the purApproved by A. A. Board '<br />\nit was decided to have about $18<br />\nchaser of Kirk pieces in<br />\nHOSIERY<br />\nGLOVES as the limit, although final deciContinued from page 1<br />\nsilver absolute certainty of<br />\n19 W. LEXINGTON ST.<br />\nreceipts due to the large<br />\ngate<br />\nin<br />\n'superiority.<br />\nsion as to exact price and design<br />\n9<br />\n0<br />\nwill be left to the committee. per cent, of complimentary tickets.<br />\nSTRATTON SHIRT MAKER<br />\n41<br />\nThis commitwinter.<br />\nall<br />\nstitution<br />\n226 N. Liberty St.<br />\nof<br />\nmost<br />\nKeyes,<br />\nMr.<br />\nto<br />\nAccording<br />\nO'Connor, Sophomore class<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\ntee has found that the old constitu$3.25 and $4.25 representative on the Student those who use complimentaries for<br />\nNegligee<br />\n.$5.25 and $6.25 Council, reported to the class the admission to the games would come tion serves the purposes of the<br />\nImported Madras<br />\nTerms Cash, Less 10% 30 Days on<br />\ncases which<br />\nproceedings of that organization. any way, and by giving them free board, except in several<br />\nShirts<br />\n0<br />\nchanges 41<br />\nThese<br />\ncorrected.<br />\nbeen<br />\nhave<br />\ntickets the Athletic Association<br />\nAlso a Full Line of Men's<br />\nFurnishings<br />\nNewbride—Did you get seats for misses the money which would be will be put before the student body 4<br />\nBaltimore, Md.<br />\n4<br />\ngained by their purchase of tickets. for ratification in a few days.<br />\nthe theatre, dearie?<br />\nEstablished 1873<br />\nthe<br />\nwhich<br />\n0<br />\n4<br />\nbusiness<br />\nAmong other<br />\nA change in the eligibility rules<br />\nHim—Yes, love; I got the fortyOldest Silversmiths in America<br />\n4<br />\nthe<br />\nfor Varsity teams is included in the A. A. Board attended to was<br />\nA.11. Fetting Man'fg Jewelry Co. third row.<br />\n4<br />\nEstablished in 1 8 1 7<br />\nconstitution of the A. A. adoption of several swimming recrevised<br />\nNewbride—Oh, I'm so glad! The<br />\nManufacturers<br />\n0<br />\n41<br />\nshow won't bother us a bit back Board. A committee has been at ords which have been established<br />\nGreek Letter Fraternity Jewelry<br />\n1<br />\nwinter.<br />\nthis<br />\nconthe<br />\nin<br />\nchanges<br />\nthe<br />\n:--:--: work on<br />\nt<br />\nthere.—Washington Dirge.<br />\n<br />\nThe Medical Standard Book Co.<br />\n<br />\nfiynson, Westcott and Dunning<br />\n<br />\nURNER'S<br />\n<br />\n.4<br />\n<br />\ncibe+.2titeri .e)<br />\nm,<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nJOHN C. KNIPP 8z SONS<br />\n<br />\n8c,Co.<br />\n<br />\nCHANTILLY<br />\nRestaurant Francais<br />\n<br />\nJ. F. Apple Co.<br />\n<br />\nW.L. Mann<br />\n<br />\nRADI<br />\n<br />\nRADIO SUPPLY CO.<br />\n<br />\nQuality<br />\n<br />\nLefranc & Ault<br />\n<br />\nWYMAN<br />\n<br />\nsc Samuel Kirk;<br />\nand Son Co.<br />\n<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\n<br />\n\f", "format": "basic_html", "processed": "C----3P LIT57c-7---d<br />\n1_11 IL-1<br />\n.1<br />\nt 1 711<br />\nI ,<br /><br />\n... E........... _1<br /><br />\nVOL. XXVII. No. 37<br /><br />\nBALTIMORE, MD., MARCH 9, 1923<br /><br />\nPRICE 5 CENTS<br /><br />\nFORTY-THREE MEN REPORT BLACK AND BLUE JAY RE- SWIMMING TEAM TO PARDRAMATIC CLUB HOLDS FINAL REHEARSALS FOR<br />\nPORTED ON FIRM FINANTICIPATE IN CHAMPIONAT BASEBALL ORGANI\"THE PURPLE MASK\"<br />\nCIAL BASIS<br />\nSHIPS TOMORROW<br />\nZATION MEETING<br />\nMystery Drama to Be Presented Monday and Tuesday. HopFive Regulars from Last Year on Business Manager Reports at the Hopkins to Make Strong Bid for<br />\nkins Orchestra to Furnish Music<br />\nMonthly Dinner. Dunning<br />\nHonors. Welsh Expected to<br />\nHand. Coach McNeal Must<br />\nChosen Editor-in-Chief<br />\nCapture Dashes<br />\nFind Pitcher<br />\nmonthly<br />\nof<br />\nThe<br />\nthe<br />\nfirst<br />\ndinners<br />\nCAST<br />\nThe<br />\norganization<br />\nHopkins<br />\nswimming team<br />\nbaseball<br />\nAt the<br />\nMajolin<br />\nR Passano<br />\nmeeting held last Tuesday, March of the combined Black and Blue Jay leaves tomorrow morning for<br />\nLaurette de Chateaubriand<br />\nJ. A. Moran<br />\n6, forty-three candidates for the staffs took place Monday, March Swarthmore, Pennsylvania, to parValentine Boudet<br />\nA Hiss<br />\nCap ain Lavernais<br />\nC C. Evans<br />\nsquad and six assistant managers 5, at the Barn. At this time the ticipate in the Eastern Collegiate<br />\nFouche<br />\nF J Rich<br />\nreported to Coach McNeal. The Business Manager made an encour- Charnpionship.s. Included among<br />\nW. H. Moore, Jr.<br />\nBrisquet<br />\nmeeting was conducted by Manager aging report as to the financial stat- the other teams which will comH Smallwood<br />\nArmand de Treviere<br />\nSergeant of Gendarme<br />\nG Hess<br />\n. 7anneman, who explained that the us of the magazine. At the begin- pete are Rutgers, Lehigh and<br />\nSachs<br />\nP<br />\nBrochard<br />\nAbbe<br />\nofficial baseball schedule is being ning of the scholastic year 1922-23 Swarthmore.<br />\nK Morrill<br />\nLkutenant Roche<br />\nwithheld by the Athletic Associa- the Jay had a deficit of $400, which<br />\nC G. Hutzler<br />\nBernard<br />\nThe Hopkins swimmers hold vistion, to be released- at the opening was paid up with part of the money<br />\nH English<br />\nAnais<br />\nMme.<br />\ntories over Swarthmore and LeJ. Desch<br />\nSabine<br />\nof the spring drive for season tick- allowed the publication by the StuC R. Kennedy<br />\nBaron Vivonne<br />\nets. The schedule will contain sev- dents' Activities Fee. The outstand- high, although they have sucH Hensel<br />\nViscount de Morsanne<br />\nenteen games including six trips. • ing bills at present amount to ap- cumbed to Rutgers. The local merSergeant of Hussars<br />\nR Towsend or Webster<br />\nUpon the arrival of. Coaches Van proximately $180, and the receipts men are determined to wipe out<br />\nGate Keeper<br />\nJ. Slaughter<br />\nOrman and McNeal, the new base- for advertisments and circulation their recent defeat at the hands of<br />\nDuke de Chateaubriand<br />\nJ. Sherwood<br />\nJacqueline Brothers ......E. Z. Aaronson, H. Texas Barton<br />\nball coach was introduced to the will amount to approximately $450. the lads from New Brunswick.<br />\nC Adams<br />\nDancer<br />\nmen. He made a short address, From this report, the Black and<br />\nThe Hopkins natators this year.<br />\nHensel, J. Webster,<br />\nH<br />\nGendarmes<br />\nsaying that he was going to put all Blue Jay, according to the Business<br />\nR. Griffith, B. Hood, J. Parsons, G. Hess<br />\nhis effort into turning out an ef- Manager, is oh a sound financial have lowered several of the local<br />\nfective team. It was a talk full of basis, and might look. to the future records. Howard's plunge of 69<br />\nWith rehearsals scheduled for<br />\nencourag-ernent to everyone.<br />\nwith greater possibilities of suc- feet 6 inches in the pool at Lehigh LACROSSE COACHING COMevery available moment today, SatOf the forty-three men who re- cess.<br />\nsurpasses the former record by four<br />\nMITTEE APPROVED BY<br />\nported five are regulars from last<br />\nurday and Sunday, the Dramatic<br />\nThe matter of an adequate con- feet; Howard also traversed the 60A. A. BOARD<br />\nyear's team. They are Captain stitution for the publication was<br />\nfoot distance at the B. A. C. in the Board Considers Limitation of Club is putting on finishing touches<br />\nGrace, Thomas,.A4errick, Rich and discussed. It was decided that a<br />\nfor its annual production, \"The<br />\nComplimentaries. Swimming<br />\nHayter, while Marrian and Hol- committee should be appointed to remarkable time of 20 3-5 seconds,<br />\nPurple Mask,\" to be held at the<br />\nRecords Approved<br />\nland were first substitutes. The draw up a new constitution, which establishing another record. Welsh<br />\nSchmeisser,<br />\nTommy<br />\n\"Bill\"<br />\nTrox- Lyric Theatre next Monday and<br />\nother men and their positions are as should correct all the weaknesses swam the 50-yard dash in 24 3-5<br />\nel and Reaney Wolfe are the mem- Tuesday evenings, March 12th and<br />\nfollows:<br />\nthat appear in the old one. The seconds, and the 100-yard swim in<br />\nbers of the larcosse coaching com- 13th.<br />\nGundry,<br />\nPitchers—Schact, Ellis,<br />\nold constitution was amended to the 58 3-5 seconds, lowering the record<br />\ni\\Ianahan, Braun, Lutz, Riggs, Dra- effect that at this meeting the edi- of 1 minute 1 second established by mittee which was approved by the \"The Purple Mask,\" in which<br />\nAthletic Board last Monday night.<br />\nper.<br />\ntor-in-chief and the business man- H. A. Rowland in 1920. Dunning<br />\nThe<br />\nBoard discussed at this meet- Leo Dietrichstein starred for a<br />\nCatchers — Limbach, Osendorf, ager were elected by the combined has negotiated the 100-yard breast<br />\ning many important measures number of years on the legitimate<br />\nOates, Logan, Cook, Bortner.<br />\nstaffs. As the constitution stood stroke in 1.18 2-5, and 200-yard<br />\nInfielders—Bald, Reimer, Thom- the editorial and art staffs elected breast stroke in 3.05. Buhrer, which have been hanging fire all stage, is a mystery-drama laid in<br />\nwinter. A motion to limit the issu- the turbulent times following the<br />\nsen, Maccubbin, Wasserman, Balls, the - editorf, while the Bus- Coady, Lord and Welsh have set<br />\nof complimentary tickets was French<br />\nance<br />\nBushey, Brager, Calhoun, Ziz, iness Staff elected the Business up a new time in the 160-yard reRevolution. It depicts the<br />\nbrouglit<br />\nbefore the board. This<br />\nSeitz, Snyder, Buchner, Moss, Mor- Manager.<br />\nlay.<br />\nstruggles and rivalry existing at<br />\nquestion will be decided by the<br />\nrison, Hutzler, Easton, Hubner, Votes of thanks were given to<br />\nThe Hopkins contingent is ex- members<br />\nof the various teams at a that time between the aristocracy<br />\nJackson, Merrick.<br />\nthe various resigning. seniors, pected to have an excellent chance<br />\nmeeting<br />\nto be held on Tuesday af- and the citizenry. \"The Purple<br />\nOutfielders — Webster, Crook, whose constant work has placed the to garner a large proportion of<br />\nthe ternoon. A new form of the A. A. Mask,\" containing a<br />\ncast of approxDannettell, Marrian.<br />\nBlack and Blue Jay in the promi- points in the meet. Welsh is looked<br />\nBoard's constitution with several imately twenty-five characters, has<br />\nAssistant Managers — Dean, nent position it holds among col- upon as a sure winner in<br />\nthe 50- minor revisions was presented for<br />\nHunter, Gluck, Clark, Turnbull, lege publications. The men who yard and 100-yard dashes.<br />\nbeen coached by Mr. Walter B.<br />\nHe has approval.<br />\nWolf, Sansbury, Schmidt, Martin, resigned are L. Fenneman, Paul L. been victorious against<br />\nSwindell,<br />\na Hopkins alumnus. The<br />\nall of the<br />\nThe coaching committee which<br />\nHolls, Harp, Ningard, Jones, Sha- Ives, G. E. Hardy, Jr., P. C. Wil- competing colleges in<br />\nthese events. is now effective is different from production is presented in five acts,<br />\npiro, Long, McKay .<br />\nliams, 0. D. Collins, Howard HenThe relay team holds victories<br />\nthat which has been coaching the the fifth of which lasts but ten minA big hole was knocked in the sel, G. P. Fallon, L. A. Kelley, over Lehigh and Swarthmore<br />\nand team so far this winter. The change utes.<br />\npitching staff by graduation and John Slaughter, S. Rich, S. A. Mid- was nosed out by<br />\ninches in the Rut- in the committee is in the substituThe leading role, that of Armand<br />\nCoach McNeal will • have trouble dleton and J. M. Zoeller.<br />\ngers meet. If Dunning is feeling<br />\nde<br />\nTreviere, is played by Hugh<br />\ntion of Wolfe for Henry Baker as<br />\nfilling up the vacancies. If a suitFitzgerald Dunning was unani- fit he should make Potts, of RutSmallwood,<br />\nwho will be rememcoach of the defense players. The<br />\nable place can be secured battery mously elected editor-in-chief for gers,<br />\nstep lively to win, as Dunbered<br />\nas<br />\nRene<br />\nde Montigny, in<br />\nlacrosse squad is well organized<br />\npractice will start immediately, and the year 1923-1924, and Joseph Le- ning's time of<br />\n1.18 2-5 is better now and, although the bad weather last year's production, \"If I Were<br />\nthe whole squad will get under way opold was unanimously re-elected than<br />\nany time made by Potts so far<br />\nKing.\" W. H. Moore, Jr., last<br />\nbusiness manager. McDaniel was this year. There should be a stiff of the past week has hindered the year's Louis XIV, as Brisquet; R.<br />\nContinued on page 2, col. 3<br />\nelected managing editor; Dudley battle waged between Von Stanley, outdoor practice, the men have been Passano, as Majolin ; and C. C. G.<br />\nCotton, art editor; W. G. Packard. of Rutgers, and Howard, of Hop- held together by black-board dem- Evans, as Captain Lavernais, fill<br />\nNOTICE<br />\ncirculation manager, and Donald- kins, in the plunge. Howard de- onstrations.<br />\nThe graduate manager of athlet- other important roles.<br />\nson, advertising manager. Paul feated this man in the Rutgers meet<br />\nMeeting of entire NewsThe principal female part is<br />\nIves, the retiring editor-in-chief but is expected to have more diffi- ics warned the board of the loss taken by Joseph A. Moran, wellLetter Staff Tuesday at<br />\nContinued on page 4, col. 3<br />\npresided at the meeting.<br />\n12.20. Election of next<br />\nculty in the 75-foot pool at Swarthknown to all interested in Hopkins<br />\nnew<br />\nstaff<br />\nThe<br />\nwill<br />\ntake up their more.<br />\nyear's Board of Control.<br />\ndramatics. Moran has taken imduties beginning with the next isNOTICE TO SENIORS<br />\nGeibel, of Rutgers, is conceded<br />\nportant roles for the last three<br />\nsue of the Black and Blue Jay.<br />\nAll lacrosse equipment<br />\nto be the best man in the 220-yard<br />\nAt the recent meeting of the years and his ability as a female<br />\nwhich has been issued will<br />\nswim; likewise he will be hard to Studer-its' Activities, Council per- impersonator is familiar to all.<br />\nMARSH<br />\nbe collected from those men<br />\nELECTED<br />\nPRESI- defeat in the back stroke. This mission was granted the Hullabaloo Moran's characterization of Hughwho are not regularly atDENT OF Y. M. C. A.<br />\nman was instrumental in Rutgers' Board to reimburse seniors who ob- ette de Hamel in \"If I Were King\"<br />\ntending practice.<br />\nThe regular yearly elections of triumph over Hopkins both this tain advertisements for this issue, won him praise from reliable critthe Y. M. C. A. were held Mon- year and last. He is considered in the way of a discount on their ics. In \"The Purple Mask\" Moran<br />\nCandy will be sold at\"The<br />\nday in the M. E. Building. Upon one of the best swimmers in the class dues. In case the class dues will be Laurette de Chateaubriand.<br />\nPurple Mask\" for the benefit<br />\ndetermining the number of votes to East and his performances will be have been paid this reimbursement<br />\nOther. female parts will be taken<br />\nof June Week. Contributions,<br />\neither reject or elect the men of- watched with interest. One of the will be in the form of a rebate. by Alger Hiss, as Valentine Bouwrapped in packages of five,<br />\nfered by the nominating committee, features of the meet should be the Twenty per cent of the amount of det; J. Desch, as Sabine; and Hugh<br />\nshould be turned in to Tom<br />\nall received a large margin of \"ac- diving of Galbraith, of Rutgers, the advertisements obtained will be English, as Madame<br />\nAnais.<br />\nLandy at the Barn or at the<br />\ncepting votes.\"<br />\nwho finished second to Armstrong, so credited by the Hullabaloo<br />\nFeatures<br />\nof<br />\nthe<br />\nperformances<br />\nLyric.<br />\nThe new officers consisting of T. of Penn, in last year's Intercolle- Board.<br />\nwill be a tumbling act by JacqueReese Marsh, president; Paul Syl- giate Championships.<br />\nThis is to apply to seniors only line Brothers, including H. Texas<br />\nCoblIon Board Dance Satvester,<br />\nvice-president;<br />\nKarl<br />\nMiller,<br />\nfurther. shall not apply to Barton and E. Z. Aaronson, and<br />\n'and,<br />\nurday afternoon, 4.30, C. E.<br />\nsecretary;<br />\nRandolph<br />\nNorwood,<br />\nanyone<br />\nnow on the staff or to any- a series of dances presented by<br />\nHall.<br />\ntreasurer, will assume the duties of<br />\none who is or has been out for the Clarence Adams, leader of last<br />\nThe Annual Triangular<br />\noffice at the next cabinet dinner, to<br />\nstaff. Contracts for advertisements year's famous ballet. Both of these<br />\nTickets for \"The Purple<br />\nannounced in- the<br />\nDebate<br />\nbe held next Wednesday.<br />\nmust be in the hands of the Board features have been inserted to add<br />\nMalik\" on sale at the Barn,<br />\nNews-Letter for March 17th<br />\nThe election of committee chairthe Lyric and Military Ofon or before March 24th. Con- a college atmosphere to the producwill be held on March 24th.<br />\nmen will take place the early part<br />\nfice.<br />\ntract blanks and rates may be ob- tion.<br />\nof next week.<br />\ntained from J. D. Slaughter.<br />\nContinued on page 2, col. 5<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 9, 1923<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nHopkins<br />\nFOUNDED 1897.<br /><br />\nNews-Letter<br /><br />\nSCABBARD AND BLADE MILITARY SOCIETY ADMITS<br />\nNEW MEMBERS<br />\nSociety Will Occupy Boxes at Dramatic Club Performance. Dinner Held at Hopkins Club<br /><br />\nTOLEDO TO HOLD COURSE<br />\nIN SCOUT WORK<br />\nThe Sociology Department at<br />\nToledo University sponsors classes<br />\nin girls' leadership. There are<br />\nnow forty-two colleges and universities in the United States that<br />\nhave adopted the plan. Though no<br />\ncredit is to be given the course will<br />\nextend from March 5 to March 17.<br />\nIt will consist of ten meetings of<br />\nof an hour and a half each, which<br />\nwill be conducted as far as is possible as a Girl Scout Troop with<br />\nspecial emphasis upon problems of<br />\nleadership and troop management<br />\nand demonstrations by local Girl<br />\nScout Troops.<br /><br />\nDr. Ralph U. O. Magoffin, associate professor of<br />\nGreek and Roman history,<br />\nwas elected president of St.<br />\nJohn's College at a meeting<br />\nof the board of governors of<br />\nthat institution held early<br />\nthis week.<br />\nDr. Magoffin, who is a<br />\nwell-known and popular figure on the Hopkins campus,<br />\nsucceeds Dr. Thomas Fell,<br />\nwho retires after 37 years as<br />\npresident. Dr. Magoffin will<br />\nprobably assume his duties<br />\nat the beginning of the next<br />\ncollegiate year.<br /><br />\nLast Monday afternoon the supply room was the scene of the spring<br />\n$2.00<br />\nSubscription<br />\ninitiation of the newly elected members of the Scabbard and Blade SoEntered as second-class matter December 3, 1909, at the Postoffice at ciety. Six commissioned officers<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nof the R. 0. T. C., all members of<br />\nthe Junior Class, were admitted to<br />\nPublished semi-weekly from October to June by the students of Johns memberhsip. The officers were the<br />\nHopkins University.<br />\nfollowing: Capt. H. B. Howard,<br />\nCapt. F. E. Campbell, leader of the<br />\nBusiness communications should be addressed to the BUSINESS MAN- band; Capt. C. R. Kennady, Second<br />\nAGER,JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nLieutenants G. V. B. Shriver, H. E.<br />\nshould be sent to the MANAGING EDITOR.<br />\nWilgis and R. Norwood.<br />\nDRAMATIC CLUB HOLDS THE<br />\nAfter the initiation, dinner was<br />\nFINAL REHEARSALS<br />\n100<br />\nHomewood<br />\n•<br />\nTelephone<br />\nserved at the Hopkins Club, at R. 0. T. C. LOWERS REContinued from page 1<br />\nwhich the regular Army officers of QUIRED GRADE FOR EXThe first night of the performEMPTION FROM EXAMS<br />\nBusiness Manager:<br />\nthe unit were present. The dinner<br />\nEditor-in-Chief:<br />\nance will be turned over to the R.<br />\nWILLIAM H. MOORE, JR., '23.<br />\nwas followed by a regular meeting,<br />\nAfter the complete reorganizaGLOVER P. FALLON, '23.<br />\n0. T. C. and tickets for this perduring the course of which it was tion of officers in the R. 0. T. C. formance may be obtained from the<br />\nManaging Editor:<br />\nAdvertising Manager:<br />\nJ. HUDSON HUFFARD, '23.<br />\ndecided that the Society would re- last week, the Military Department Military Office. Tickets for the secDONALD K. VANNEMAN,'23.<br />\nserve boxes on Monday night,<br />\nAssistant Managing Editor:<br />\nhas made other drastic changes in ond night may be obtained at the<br />\nCirculation,Manager:<br />\nJOSEPH S. LEOPOLI. '24.<br />\nMarch 12, at the R. 0. T. C. beneLyric or from members of the club<br />\nPHILIP W. HOWARD, '25.<br />\nfit performance of \"The Purple the regulations. The most imporAssociate Editors<br />\nthe Barn.<br />\nat<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nMask.\" As many members of the portant of these is the reduction<br />\nManagers:<br />\nBusiness<br />\nAssistant<br />\nJohns Hopkins Orchestra,<br />\nThe<br />\nWILLIAM G. DEAN, JR., '24.<br />\nFraternity as are able to be pres- from 85 to 75 of the grade neces- under the direction of Mr.• BOchau,<br />\nRANDOLPH NORWOOD, '24.<br />\nBERNARD C. HEARN, '23.<br />\nT. REESE MARSH, '24.<br />\nent will attend the performance in sary for exemption from the final<br />\nFITZGERALD DUNNING, '24.<br />\nwill perform both evenings. Dress<br />\nuniform and occupy the boxes.<br />\nD. MILES MARRIAN, '25.<br />\nJunior Editors:<br />\nwill be held Sunday from<br />\nrehearsal<br />\nexamination. This step was taken<br />\nRICHARD C. TILGHMAN, '25.<br />\nG. DONALD GIESKE, '25.<br />\nMany alumni of the Society and<br />\n9 A. M. to 5 P. M. at the Lyric.<br />\nJOHN W. PARSONS, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nregular Army officers will be in- after the Military Department reBENJAMIN T. ROME, '25.<br />\nThe picture for the Hullaboloo will<br />\nJOHN C. LEWIS, JR., '23<br />\nW. EDWARD THOMSEN, '26.<br />\nvited to attend with the cadet offi- alized that 8.5 was a grade too high<br />\nDIXON,<br />\nT.<br />\n'24.<br />\nJOHN<br />\nbe taken some time during that day.<br />\nJ. ARTHUR NELSON, JR., '26.<br />\ncers. It was also resolved at the to expect from the majority of the<br />\nERNEST A. STRATHMAN, '26.<br />\nA. J. McKAY, '26.<br />\nmeeting to push the sale of seats men, as evidenced by the fact that<br />\nat the Lyric for Monday night, so only a very few were exempt from<br />\nthat this week, the Unit may go the mid-year examination.<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nAnother important step is the<br />\nover the top in fine form and set<br />\nabolition<br />\nof make-up drills for abthe band and rifle team upon their<br />\nPrinted by The Read-Taylor Co., Lo mbard and South Sts., Baltimore, Md. respective financial feet.<br />\nsences: Formerly a man with an<br />\nThe Scabbard and Blade Soci- excused absence had a chance to<br />\nety is a national organization main- make it up and get full credit for<br />\ntaining chapters (or companies) in it; a man with an unexcused abBALTIMORE, MD., MARCH 9, 1923<br />\nmany colleges throughout the coun- sence was alse given a chance to<br />\ntry where the standards of the Mil- make it up, but only received halfitary Department are sufficiently credit for it. The new -regulation<br />\nhigh. The Hopkins Company is provides that excused absences do<br />\nTHE PLAY'S THE THING<br />\nknown as I Co. of the Second Reg- not have to be made up; and that<br />\nYou'd be surprised at what<br />\nhe knows! He didn't learn<br />\niment. The insignia of the organi- unexcused absences cannot be made<br />\nit all in a book, either. For<br />\nLives there a man so different from the rest of us that he does not zation, which is a red and blue bar up, and no credit will be given for<br />\ninstance-his clothes are<br />\ndreams and his grooming an<br />\nbelieve himself an actor under the skin? All the world is indeed a upon which five silver stars are af- such drills missed.<br />\ninspiration.<br />\nThe results of the ticket selling<br />\nis worn on the left breast of<br />\nHe gets that finely turned-out<br />\nstage with all of us the actors; some of us possessing more imagination, fixed<br />\nhead from\"Vaseline\"HairTonic.<br />\nfor<br />\nthe production of \"The Purple<br />\nthe military blouse. The total enIt smooths and grooms the hair.<br />\nsome of us less. Imagination and self-confidence make mere man an rollment of the national body is now Mask\" for the R. 0. T. C. benefit<br />\nAt all drug stores and student<br />\nbarber shops.<br />\nfully<br />\ndetermined.<br />\nclose to 2,500, and the society is have not yet been<br />\nactor in the sense that the word is used today.<br />\nEvery \"Vaseline\"Product is<br />\nrecommended everywhere<br />\ngrowing with rapid strides. Mem- The Military Department is confibecause of its absolute purity and effectiveness.<br />\nWhat better place to learn the art of acting than at college, where bership is limited to cadet officers. dent, however, that the production<br />\ntime, the Hopkins will be successful from a financial<br />\n'the drama is studied and where imagination and self-confidence are de- At the present<br />\nCompany has a personnel of about standpoint. Candy is to be sold on<br />\nveloped. It is only reasonable to believe that talent, given the benefit twenty undergraduates.<br />\nboth show nights for the benefit<br />\nof June Week, and members of the<br />\nof college training, should prove that much the better for it. To be<br />\nFACULTY NOTES<br />\nR. 0. T. C. have been requested to<br />\nsure the college dramatist lacks experience but he should make up in<br />\nAmong the honors recently won get whatever donations -of candy<br />\nChesew eugh ivWs.Co<br />\nby members of the faculty is Pro(consolidated)<br />\nother ways for his lack in this.<br />\nthey can.<br />\nfessor Vincent's election as a FelThe players of the JOHNS HOPKINS DRAMATIC CLUB low of the Loyal Historical Society<br />\nof London.<br />\nhave been educated to their play, \"THE PURPLE MASK,\" by Mr.<br />\nForty-three Men Report for<br />\nSwindell, who does not believe in a mere memorizing of lines. As a<br />\nBaseball<br />\nconsequence, this production falls in a class by itself-not professional,<br />\nContinued from page 1.<br /><br />\nSOPHISTICATED<br /><br />\nasehne<br />\nREG. U.S. PAT.0,,<br /><br />\nHAiR TONIC<br /><br />\nbut well above the amateur.<br /><br />\nas soon as the weather permits.<br />\nThe infield will have to be built<br />\nAside from the art of the playei-s, the play itself is a superior bit of up about \"Buck\" Grace and \"Ben\"<br />\nwriting. As gripping as \"The Bat\"; as colorful as \"When Knighthood Thomas, the only survivors of last<br />\nyear's regulars. Merrick of past<br />\nWas in Flower\"; as mysterious as \"Unknown Purple\"; and as magseason's nine, will be a likely man<br />\nnificent as \"If I Were King,\" the club's offering, \"The Purple Mask,\" for a position in the inner defense.<br />\nThe outfield promises to be the<br />\nis an ideal piece for the University dramatists.<br />\nbest in years. Rich and Hayter are<br />\nThe play, somewhat less poetic than that of last year, is even more both letter men, and Marrian, who<br />\nsubstituted last year, shows possiinteresting and has been timed so that the conclusion of the fifth act will<br />\nbilities in making his place in the<br />\npermit the dancing, which will follow in the Little Lyric, to begin at trio.<br />\nManager Vanneman wishes to<br />\neleven-fifteen. If this aim is accomplished, the main objection to amabring to the attention of an canditeur theatricals will be overcome.<br />\ndates for assistant managers, as<br />\nwell as for the squad, that it is abUpon the financial success of Tuesday night's performance depends<br />\nsolutely essential that they secure<br />\n,the possibility of musical comedy next year. The profits of this per- their physical measurement cards<br />\nformance are turned into the coffers of the Student Activities Council, from Dr. Abercrombie before they<br />\ncan be officially counted on the baseto the credit of the Dramatic Club.<br />\nball roll. He wishes particularly<br />\nto remind Juniors and Seniors that<br />\nThere are very few who miss the annual production. It is only<br />\nthis order applies to them as well as<br />\nhoped that the support will be as good as in the past.<br />\nto the lower classmen.<br /><br />\nIIIIIIIIIIIIIIII•111IIIIIIIIIIIIIIIIIIIIIIIIIIIIII<br />\nIII<br />\nI'<br />\n\"Best Paid Hard Work in the World\" a<br />\nII<br />\nII<br />\nsalesman described<br />\ns the way a JoHN<br />\nHANCOCK<br /><br />\nIl<br />\na<br />\nIII<br />\nII<br />\nMi<br />\nII<br />\nil<br />\n111<br />\nII<br />\nIII<br />\na<br />\n111<br />\nII<br />\n111<br />\nIl<br />\n01<br />\n1111<br /><br />\nhis work. He is a college graduate and in five<br />\nyears has put himself at the very top of his<br />\nbusiness.<br />\nHe never yet has called upon a prospect without<br />\na previous appointment. The best life insurance<br />\nsalesmen today work on that plan, making it a business of dignity, such as any worthy and ambitious<br />\ncollege graduate can find satisfying to his mental<br />\nneeds, and highly remunerative as well.<br />\nThe man above quoted is the John Hancock's<br />\nyoungest general agent. This shows what college<br />\ngraduates of the right type can do in this business,<br />\nhow they can build up earning power and at the<br />\nsame time provide for an accumulated competence<br />\nfor the years to come.<br />\nGraduation is a vital period in your life and you<br />\nare liable to hold to the business you start in. It<br />\nwould be well before making a definite decision to<br />\ninquire into life insurance as a career. Address,<br />\n\"Agency Department.\"<br /><br />\nII<br />\nII<br />\nli<br />\nII<br />\n1111<br />\nIII<br />\nII<br />\n111<br />\n1111<br />\nIII<br />\nIII<br />\na<br />\n111<br />\nIII<br />\nIl<br />\nIll<br />\nIII<br />\nillik<br />\nl<br />\nII<br />\nCOMPANY<br />\nLI FE INSURANCEI<br />\nM<br /><br />\n1111<br /><br />\nIII<br />\nI.<br /><br />\nOF<br /><br />\nT<br /><br />\nA L<br /><br />\nBOSTON. MASSACHUSETTS<br /><br />\nLargest Fiduciary Institution in New England<br /><br />\nIII<br /><br />\n1111<br /><br />\nIIIIIIMMIIIIIIIIIIIIIIIIIIIIIIIIIIIEIIII<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 9, 1923<br /><br />\n3<br /><br />\nHOPKINS RIFLE TEAM DE- DR. COALE ADDRESSES THE in the British team, and already<br />\nCHRISTIAN SERVICE CLUB many are asking in what shape the<br />\nFEATED BY UNIVERSITY<br />\nOF IOWA<br />\n\"The Opportunities for Members American colleges are to meet this<br />\nWesterners Win by Twenty-seven of the Christian Service Club\" was new athletic invasion of our shores.<br />\nPoints. Last Stage of Intercol- the subject of a talk delivered by It is, thus, reassuring to be told<br />\nthat the East has at least three<br />\nlegiates Completed<br />\nDr. J. J. Coale, secretary for the teams—namely, those from<br />\nYale,<br />\nThe University of Iowa defeated Federation<br />\nof<br />\nPresbyterian Georgetown and Cornell—that will<br />\nWARNER &amp; COMPANY<br />\nthe Johns Hopkins University in a<br />\nChurches, before the club at a re- give valiant battle to the English<br />\nHATTERS<br />\nrifle match during the week ending<br />\ncent meeting.<br />\nrunners. The West is still to be<br />\n222 W. BALTIMORE ST.<br />\nMarch 2, the score was Iowa, 1703;<br />\n\"In the religion of today,\" Dr. heard from, but indications are that<br />\nHopkins, 1676. All four positions<br />\nCoale<br />\nbegan, \"we must make no Chicago, Kansas and other Westwere used, with five shots from<br />\nintellectual compromise with truth. ern colleges will also have fast quarThe individual<br />\neach position.<br />\nThings must be seen as they are; tettes to put into this important<br />\nscores were as follows:<br />\nfacts must be faced. At the pres- event.<br />\nYou collegians who stroll along the campus will<br />\nJohns Hopkins University<br />\ntime, man is oppressing man.<br />\nbe<br />\nent<br />\namong the first to sense the coming of Spring.<br />\nThough<br />\nthe<br />\nInternational irace<br />\nG. M. Ruoff—Prone 47, sitting<br />\nWar, that devastating plague, will be the big feature of the<br />\nDoesn't<br />\nthat suggest something to you in the<br />\ncom49, kneeling 49, standing 38. Total<br />\nmatter of clothes?<br />\ndrives men from the truth, and ing Carnival, the meeting<br />\npromises<br />\n183.<br />\nGo in for Stein-Bloch and Goodman and Suss<br />\nmakes them little better than the in other respects to be up<br />\nto a highJ. E. Mount—Prone 50, sitting<br />\nSuits<br />\nif you want to know college style at its best.<br />\nmost savage of wild animals. Even er standard than ever<br />\nbefore. The<br />\n47, kneeling 45, standing 39. Total<br />\nwars between labor and capital are indoor season which is now<br />\nat its<br />\n181.<br />\ndespicable, and yet they are ever height has already<br />\nshown that the<br />\nH. E. Wilgis—Prone 47, sitting<br />\nwith us.\"<br />\nAmerican colleges are in for the<br />\n46, kneeling 45, standing 37. Total<br />\nDeploring this state of affairs, most brilliant track and<br />\nfield sea175.<br />\nDr. Coale asked if the church had son in their history. Wonderful<br />\nsit45,<br />\nThiessen—Prone<br />\nE.<br />\nA.<br />\n(Y. M. B. 0. D.)<br />\nfailed. The church has told what records are being made in<br />\nall the<br />\nting 39, kneeling 45,. standing 41.<br />\nought to be done, •but has it fol- events. For instance, last<br />\nweek,<br />\nTotal 170.<br />\nBaltimore and Hanover<br />\nlowed out its own teachings?<br />\nCharles<br />\nPaddock,<br />\nof<br />\nthe<br />\nUniversity<br />\nW. M. Rowland—Prone 50, sit- The solution of the problem of<br />\nting 42, kneeling=42= standing 35. discord, strife and trouble is, ac- of Southern California, ran the 100<br />\nyards in 94-5 seconds, wonderful<br />\nTotal 169.<br />\ncording to Dr. Coale, love. It is<br />\nJ. A. Cochran—Prone 46, sitting up' to us--to tell and show people time for so early in the season.<br />\n•48; kneeling 36, standing 38. Total how to love each other. When we \"Boots\" Lever, of Pennsylvania,<br />\nwas beaten only a foot by Murchi168.<br />\nsay that the Germans must be dealt<br />\nR. E. Parks—Prone 49, sitting with by means of bayonets, we cast son, of the Illinois, A. C., at 60<br />\n46, kneeling 43, standings 27. Total aside our doctrine of love. A man yards, in a new world record time<br />\nof 6 1-5 seconds. Brown, of Dart165.<br />\nwho wants to go into the ministry<br />\nF. T. Bates—Prone 47, sitting and teach this doctrine, ought not mouth, recently cleared 6 feet 5 1-4<br />\n44, kneeling 46, standing 27. Total to go if he does not have an over- inches, a new indoor high jump<br />\nrecord. A dozen men have gotten<br />\n164.<br />\nwhelming love for humanity in his<br />\nover 12 feet 4 inches or better in<br />\n49,<br />\nsitWilliams—Prone<br />\nF. E.<br />\nheart. Therefore, Dr. Coale conthe<br />\npole vault, the most notable per- American Journal of Mathematics. Edited by Frank Morley, A. Cohen, Asting 43, kneeling 42, standing 26. cluded, the solution of the oppressistant Editor, with co-operation of Charlotte A. Scott, A. B. Coble, and<br />\nformance<br />\nbeing that of Owen, of<br />\nTotal 160.<br />\nother mathematicians. Quarterly. 8vo. Volume XLV in progress. $6<br />\nsion and strife which is so wideper volume. (Foreign postage fifty cents.)<br />\nJ. D. Virdin—Prone 48, sitting spread today is the opportunity to Pennsylvania, who cleared 12 feet<br />\n45, kneeling 36, standing 12. Total those who are going into the min- 7 inches recently. Seven or eight American Journal of Philology. Edited by C. W.E.<br />\nMiller, with the co-operamen have put the shot better than<br />\ntion of M. Bloomfield, H. Collitz, T. Frank, W. P. Mustard, D. M. Robin141.<br />\nistry.<br />\nson. Quarterly. 8vo. Volume XLIV in progress. $5 per volume.<br />\n42 feet, while Meyers, of Rutgers,<br />\nGrand total 1676.<br />\nAt the next meeting of the club,<br />\n(Foreign postage, fifty cents.)<br />\nrecently defeated Thompson, forUniversity of Iowa<br />\nDr. Craig Stewart, of Illinois, who<br />\nJournal of Psychiatry. E. N. Brush, J. M. Mosher, C. K. Clarke,<br />\nParker—Prone 49, sitting 48,_ is preaching at Old._St._Paul's_Epis-. merly of Dartmouth, in a 70-yard American<br />\nC. M. Campbell and A. M. Barrett, Editors. Quarterly. 8vo. Volume<br />\nkneeling 49, standing 45. Total 11. copal Church during the Lenten hurdle -race in new record time.<br />\nII in progress. $5 per volume. (Foreign postage, fifty cents.)<br />\nDawson-Prone 47, sitting 48, season, will make an address. Dr. Hellfrich, of Penn State, came with- Beitrage<br />\nzur Assyriologie und semitischen Sprachwissenschaft. Paul Haupt<br />\nkneeling 44, standing 42. Total 181. Stewart has accepted the invitation in 2-5 seconds of the world's 600and Friedrich Delitzsch, Editors. Volume X in progress.<br />\nZeiner—Prone 48, sitting 47, to address the club on Tuesday, yard record at the Millrose games,<br />\nHesperia. Hermann Collitz, Henry Wood and James W. Bright, Editors.<br />\nkneeling 45, standing 40. Total 180. March 13. As this is the date of and on the same evening Connolly<br />\nSeventeen numbers have appeared.<br />\nBunker—Prone 50, sitting 44, the Dramatic Club production, Dr. of Georgetown, made new world's<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4vo. Volume XXXIV in progkneeling 43, standing-41. Total 178. Stewart will be asked to change the figures at two-thirds of a mile. Tayress. $4 per year. (Foreign postage, fifty cents.)<br />\nKoeberle—Prone 49, sitting 48, night to Thursday, March 15. If lor of Princeton, Woodring of<br />\nJohns Hopkins Hospital Reports. 8vo. Volume XXI in progress. $5 per<br />\nkneeling 37, standing 43. Total 177. he is unable to do so, the club will Syracuse, the Olympic 200-metre<br />\nvolume. (Foreign postage, fifty cents.)<br />\nRuppel—Prone 49, sitting 47, have its meeting, as scheduled, on champion; Koppisch of Columbia,<br />\nJohns Hopkins University Circular, including the Presidents' Report, Annual<br />\nand Baker of Virginia, have all'<br />\nkneeling 41, standing 37. Total 174. March 13.<br />\nRegister and Medical Department Catalogue. Seven times a year. 8vo.<br />\n$1 per year.<br />\ndone close to 50 seconds indoors<br />\nEdwards—Prone 46, sitting 48,<br />\nfor the quarter mile. Brilliant per- Johns Hopkins University Studies in<br />\nkneeling 40, standing 39. Total 173.<br />\nEducation. E. F. Buchner, Editor. 8vo.<br />\nPENN. RELAY CARNIVAL AN formances<br />\nSeven numbers have appeared.<br />\nhave been seen all over<br />\nHalbasch—Prone 49, sitting 41,<br />\nINTERNATIONAL EVENT<br />\nthe country, but especially in the Johns Hopkins University Studies in Geology.<br />\nkneeling 42, standing 31. Total 163.<br />\nE. B. Mathews, Editor. 8vo.<br />\nAGAIN<br />\nEast and Middle West. All of the<br />\nFour numbers have appeared.<br />\nOlson—Prone 47, sitting 43,<br />\nkneeling 31, standing 34. Total 155. Oxford University, England, Will above men will be seen at Pennsyl- Johns Hopkins University Studies in Historical and Political Science. Under<br />\nRun in Two-mile Relay. 400<br />\nvania's Relay Carnival. In addithe direction of the Departments of History, Political Economy and PolitiTreboar—Prone 33, sitting 30,<br />\ncal Science. Monthly. 8vo. Volume XLI in progress. $5 per volume.<br />\nInstitutions Entered<br />\ntion, the relay racing has been up<br />\nkneeling 41, standing 27. Total 131.<br />\nThe Twenty-ninth Annual Relay to a very high standard, so that new Modern Language Notes. J. W. Bright, Editor-in-Chief, G. Gruenbaum, W.<br />\nGrand total 1703.<br />\nKurrelmeyer and H. C. Lancaster. Eight times yearly. 8vo. Volume<br />\nCarnival under the auspices records may be expected in more<br />\nRace<br />\nDuring the same week in which<br />\nXXXVIII in progress. $5 per volume. (Foreign postage, fifty cents.)<br />\nPennsylvania<br />\nof<br />\nthe<br />\nUniversity<br />\nof<br />\nthan<br />\none<br />\nof<br />\nthe<br />\nCollege<br />\nrelay<br />\nchamIowa was met, the fourth and last<br />\nof Economic Tracts. J. H. Hollander, Editor. Fourth series in progstage of the intercollegiates was will be held this year on Friday and pionships that will be run, as usual, Reprint<br />\nress. $2.00.<br />\n28th.<br />\nThis<br />\nSaturday,<br />\nApril<br />\n27th<br />\nand<br />\nin<br />\nconnection with Pennsylvania's<br />\ncompleted. The unofficial results<br />\nReports of the Maryland Geological Survey. Edited by E. B. Mathews.<br />\ngreat Carnival, which is now ac- classic.<br />\nwere as follows: angreatest<br />\nknowledged<br />\nto<br />\nbe<br />\nthe<br />\nJ. E. Mount—Prone 99, sitting<br />\nThough the date of the meet is Terrestial Magnetism and Atmospheric Electricity. L. A. Bauer, Editor.<br />\nQuarterly. 8vo. Vol. XXVIII in progress. $3.50 per volume. (Foreign<br />\nnual track and field meeting held practically two months off,<br />\n'95. Total 194.<br />\nthere<br />\npostage, 25 cents.)<br />\nworld<br />\nannually,<br />\nG. M. Ruoff—Prone 98, sitting any place in the<br />\nare already close to 400 institutions<br />\nwill again have international impor- entered, so that last year's<br />\n92. Total 190.<br />\nrecord<br />\nR. E. Parks—Prone 97, sitting tance. This is due to the fact that list of 425 is sure to be exceeded.<br />\nOxford University, England,.will These include already over<br />\n93. Total 190.<br />\n80 col- The Eclogues of Baptista<br />\nMantuanus. By W. P. Mustard, 156 pp. $1.50.<br />\na two-mile team to compete in leges drawn from the<br />\nsend<br />\nW. M. Rowland—Prone 95, sitentire United<br />\nthe American college two-mile re- States. The Carnival will thus be The Piscatory Eclogues of Jacopo Sannazaro. By W.P. Mustard. 94 pp. $1.25.<br />\nting 95. Total 190.<br />\nchampionship. This will be very finer<br />\nlay<br />\nH. E. Wilgis—Prone 95, sitting<br />\nthan ever and of the most rep- The Eclogues of Faustus Andrelinus and Joannes Arnolletus. By W.P. Mustard. 123 pp. $1.50.<br />\nwelcome<br />\nand interesting news to resentative character.<br />\n94. Total 189.<br />\nPennsylpresent<br />\nin<br />\nwere<br />\nWest<br />\nFlorida Controversy, 1798-1813. By I. J. Cox. 702 pp. $3.<br />\nthousands<br />\nwho<br />\nthe<br />\nGrand Total 953.<br />\nvanie's new stadium seats over 40,from<br />\nfour-mile<br />\nwhen<br />\na<br />\nteam<br />\n1914<br />\nThis week the same team that<br />\n000, but with such a wonderful ar- An Outline of Psychobiology. By Knight Dunlap. 145 pp. 84 cuts. $2.50.<br />\nshot against Iowa is meeting Car- Oxford was here and in 1920, when ray of teams and individual athletes, The Life and Stories of the Jaina Savior Pargvanatha. By M. Bloomfield.<br />\n256 pp. $3.00.<br />\nnegie Tech in a match from the a combined Oxford-Cambridge two it is already predicted that it will<br />\nProne and standing positions, ten mile team appeared on Franklin be filled to the gates to do honor to American Citizenship and Economic Welfare. By J. H. Hollander. 132 pp.$1.25.<br />\nshots from each position. At the Field. The 1914 race wis the most the flower of America's college and Martial, the Epigrammist and Other Essays. By K. F. Smith. Edited by<br />\nW. P. Mustard. 180 pp. $2.<br />\nsame time, the University of Wash- sensational race that has ever been school athletes and the visitors from<br />\nAn Economic History of Rome to the End of the Republic. By Tenney Frank.<br />\nington is furnishing the opposition seen in this country as Oxford won Oxford.<br />\n310 pp. $2.50.<br />\nin a match from all four positions, by a hair. The 1920 race produced<br />\nPublic Health and Insurance: American Addresses. By Sir Arthur Newsa new two-mile relay record, though<br />\nfive shots from each position.<br />\nholme.284 pp. $2.50.<br />\nIrate Diner—\"Waiter! Here's a<br />\nthis record was effaced .from the<br />\nChina at the Conference. By W. W. Willoughby. 435 pp. $3.00.<br />\nneedle in my soup!\"<br />\nWht was the girl that went in- books last season by the wonderful<br />\nTables of V1—r2 and 1—r2 for use in Partial Correlation and in Trigonometry.<br />\nWaiter (ex-printer)— \"TypoBy J. R. Miner. 50 pp. $1.50.<br />\nto the bank and asked for a check- team which the University of Pennproduced.<br />\nVector<br />\nAnalysis and the Theory of Relativity. By F. D. Murnaghan. 136 pp.<br />\nsylvania<br />\nthen<br />\ngraphical<br />\nerror,<br />\nsir;<br />\nit<br />\nshould<br />\nbe<br />\nbook for a lady that folds up in<br />\n$2.75.<br />\nthe middle?—Green Gander.<br />\nThe keenest interest will be taken noodle.\"—Cougar's Paw.<br />\nA complete list of publications sent on request.<br /><br />\nThe \"COLLEGIAN\"<br /><br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br /><br />\n$A<br />\n.50<br />\nup<br /><br />\nThe Johns Hopkins Press<br />\nof Baltimore<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 9, 1923<br /><br />\n4<br /><br />\nPENN CONSIDERS SEPARATE CHANCE FOR SERVICE IN<br />\nU. S. COAST GUARD_<br />\nCOLLEGE FOR WOMEN<br />\nThe recent co-ed question at The United States Coast Guard<br />\nPRESCRIPTION DRUGGISTS<br />\n(THE BOOK MART)<br />\nTWO STORES:<br />\nHopkins has found an echo on the will hold a competitive examination<br />\nComplete Stock of<br />\ncadet<br />\nof<br />\nfor<br />\nengineers<br />\nappointment<br />\nEutaw Place and North Ave.<br />\nSts.<br />\nChase<br />\nand<br />\nCharles<br />\ncampus of the University of PennMedical Books and College<br />\ncommencing April 16th, 1923. This<br />\nMadison 0405<br />\nVernon 0890<br />\nRequisites<br />\nsylvania. There the question is not<br />\nis an exceptional opportunity for<br />\nImporters and Dealers in Fine Books one of \"to admit or not to admit\" young men of the right calibre to<br />\nbut concerns the proposed estab- complete their education at Govern301 N. CHARLES ST.<br />\nMore Mileage<br />\nlishment of a separate college for ment expense and to become comBaltimore, Md.<br />\nMore Power<br />\nwomen, as mentioned by Provost missioned officers in the United<br />\nMEN'S<br />\nmilSHOES<br />\nthe<br />\nof<br />\none<br />\nGuard,<br />\nCoast<br />\nStates<br />\nPenniman in an address to the alum4<br />\nOf the Better Class<br />\nni. A decided variance of opinion itary services of the United States,<br />\nt-tt<br />\nafloat<br />\nservice<br />\nprevails among the female students in which is offered<br />\nand ashore.<br />\nof the university.<br />\nCadet Engineers are trained to<br />\nThe attitude of the women stu•<br />\nGuarantees Both!<br />\nengineer officers, and the<br />\nbecome<br />\nURNER BROTHERS<br />\ndents is interesting. One group<br />\nare 20<br />\n111 E. BALTIMORE STREET<br />\ndeplores outright the proposed sep- age limits for appointment<br />\nSHERWOOD BROTHERS, INC.<br />\nBALTIMORE<br />\nare<br />\nengineers<br />\nCadet<br />\nyears.<br />\n25<br />\nto<br />\narate college. Quoting Pope, \"The<br />\n711171111111IFITIFIFFE11:71::\"E\"E\"EVES<br />\nII11711111\"2Coast<br />\nH.&amp; OSCAR G<br />\nstudy of man is man,\" and they, trained and educated at the<br />\nOWNERS<br />\nLondon,<br />\ntherefore, reason that knowledge of Guard Academy at New<br />\n2'141•Ca414,b#<br />\ntaken<br />\nare<br />\nsummer<br />\neach<br />\nand<br />\nConn.,<br />\none's future life partner can only<br />\n29 Baltimore St., East<br />\nCacruise.<br />\npractice<br />\nextended<br />\nan<br />\non<br />\nbe obtained by attending classes<br />\nOne Door West of Light St.<br />\nsame<br />\nthe<br />\npay<br />\nreceive<br />\nengineers<br />\ndet<br />\nBOLE AGENTS FOR BALTIMORE with him. On the other hand, the<br />\nand individuality is offered here at prices that are not<br />\nin<br />\nmidshipmen<br />\nas<br />\nallowances<br />\nand<br />\nFor College Fraternity Bands<br />\nother more studious-minded facand cannot be underquoted by any house at any time.<br />\none<br />\n(Greek Letter Societies)<br />\nannum<br />\nand<br />\nper<br />\ntion agree that it will be advan- the Navy ($780<br />\nBesides the reputation of an old-established firm<br />\nII<br />\ntageous to segregate the girls, as ration per day).<br />\nof each sale with a guarantee.<br />\nback<br />\nis<br />\ngraduaupon<br />\nA cadet engineer,<br />\nit would lend to more uninterrupttion, after one year at the Academy,<br />\ned study.<br />\nPrinters of Philological and<br />\nan ensign (engiThe male students, however, are is commissioned<br />\niDECORATIONS<br />\nDRAPERIES<br />\nFURNI7 URE<br />\nScientific Works<br />\nofficers of<br />\nCommissioned<br />\nneering).<br />\nfaof<br />\nattitude<br />\ntheir<br />\nunanimous<br />\nin<br />\nNORTH<br />\nCHARLES<br />\nSTREET<br />\n343<br />\n23 S. HANOVER ST.<br />\nCoast Guard rank with officers<br />\nvoring the change. In one breath the<br />\nBaltimore, Md.<br />\nArmy, Navy, and Marine<br />\nthe<br />\nin<br />\nthey are elated, delighted, pleased,<br />\nreceive corresponding<br />\nand<br />\nCorps,<br />\noverjoyed, and exultant. They say<br />\ngrade for<br />\nallowances,<br />\nand<br />\npay<br />\nthat Penn was originally intended<br />\ngrade.<br />\nto be a man's college and that the<br />\nCadet engineer candidates who<br />\nThe Greetings of a Fine Store<br />\npresence of the girls is so distractevidence that<br />\nsatisfactory<br />\npresent<br />\ning that their averages will undoubtcompleted a course in<br />\nTo the Students of a Fine University<br />\nedly be higher after the distracting they have<br />\nengineering at an engimechanical<br />\nelements are removed.<br />\nneering school will be required to<br />\nOn the other hand, the women<br />\nan examination in History,<br />\nstudents declare the men are mere- pass<br />\nSOMETHING NEW<br />\nand General Information.<br />\nMUSIC<br />\nHOCHSCHILDROHN<br />\nly jealous. \"When we sit in classes English<br />\nwho<br />\nengineer<br />\ncadet<br />\nfor<br />\nCandidates<br />\nBeginning March 5<br />\nwith them and hear them fail.daily,<br />\nEvery Afternoon Except Saturday<br />\nhave not completed a course in meFrom 2 until 4 o'clock<br />\nthey are no longer able to 'lord it'<br />\nengineering at an engineerchanical<br />\nDancing after 3 o'clock<br />\nover us, and prate about their su11.30 A. M. to 7.30 P. M.<br />\nshould present certifischool<br />\ning<br />\nSARATOGA &amp; LIBERTY<br />\nperior intelligence. But it appears<br />\nshowing the extent of the<br />\ncates<br />\nthat the women, divided, will fall,<br />\ncourses of study pursued by them<br />\nwhile the jealous men, united, will<br />\nthe following subjects, in which<br />\nin<br />\nFine Clothes<br />\nonce more walk the halls of a colwill be examined: mathematthey<br />\nA suit by Lemmert gives the final lege that is to all intents and purics,<br />\nphysics, applied mechanics,<br />\ntouch to the lasting satisfaction you poses a man's.\"<br />\nderive from thoroly dependable<br />\nsteam engineering, electricity, his518 N. CHARLES STREET,BALTIMORE<br />\ncloths cut in authentic fashion—<br />\nwhether for every-day wear or more SOPHOMORES HOLD NOMI- tory, English, and general informafestive occasions.<br />\nOrchestra—Dancing<br />\ngeneral adapta- Telephone, Vernon 3442<br />\nNATIONS FOR TREASURER tion. A mark for<br />\nto<br />\napplicants<br />\nbility will be assigned<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M.<br />\nat<br />\nLEMMERT<br />\nAt a meeting of the Sophomore<br />\nfor cadet engineer. The examinaTABLE<br />\nD'HOTE<br />\nClass, held Wednesday, George<br />\n19 Fayette Street, East<br />\ntion is strictly competitive.<br />\nLUNCHEON-60c<br />\nD1NNER—$1.00<br />\nDress Clothes Klinefelter was elected treasurer to<br />\nBusiness Suits<br />\nExaminations will be held at BosSUNDAY DINNER—$1.25<br />\nreplace Bill Towney, who was<br />\nSport Togs<br />\nOvercoats<br />\nton, New London, New York, Philforced to withdraw from the Uniadelphia, Washington, Norfolk, Saversity.<br />\nvannah, Buffalo, Detroit, Chicago,<br />\nAt a previous meeting, in addiFort Stanton, San Francisco, SeatMANUFACTURING JEWELERS<br />\ntion to the nominations for this oftle, should sufficient applicants be<br />\nLancaster, Pa.<br />\nfice, various business was transactClass Rings, Pins, Fraternity Pins,<br />\ndesignated at these cities to warCups, Medals, Etc.<br />\ned. Earl Donaldson, chairman of the<br />\nholding such examination, and YOU WILL FIND OUR STOCK OF STANDARD MAKE SETS<br />\nrant<br />\nStationery, Invitations, Programmes<br />\nSophomore Dance Committee, re\"Makers of the Varsity Seals\"<br />\nsuch other places as may be desigAND APPARATUS WILL MEET YOUR EVERY NEED<br />\nported the progress of the comnated.<br />\nCOMPLETE VACUUM TUBE RECEIVERS, $39.95 UP<br />\nmittee in preparation for the<br />\nThe opportunity this year is parSophomore dance, which will be<br />\nticularly favorable, as there are an<br />\nheld Friday, April 20, in the C.<br />\nunusually large number of vacanCommercial Photography<br />\nE. Hall. It was announced that<br />\n1724 N. CHARLES ST.<br />\nAll existing vacancies will be<br />\ncies.<br />\nCircuit Photography<br />\nthe party would be formal and<br />\n10 Minutes from Hopkins<br />\nSuccess- Vernon 3055<br />\nViews that the well-known Blue Jay Six filled this year if possible.<br />\nFlash Lights<br />\ncandidates will report at the<br />\nful<br />\nGroups<br />\nEnlargements had been engaged to furnish muSHOES<br />\nAcademy about three weeks after<br />\nsic.<br />\nKODAK FINISHING<br />\nfor<br />\nthe close of the examination.<br />\nD. P. Cotton, chairman of the<br />\n325 N. Howard St.<br />\nFor further particulars, write to<br />\nMEN<br />\nUNIVERSITY<br />\nring committee, reported to the<br />\nMt. Vernon 4999<br />\nCommandant, U. S. Coast<br />\nThe<br />\nclass that the committee was at<br />\nFor Sport Wear<br />\nFor Dress<br />\nGuard, Washington, D. C.—The<br />\npresent waiting for more designs.<br />\nSmart Styles—Best Leathers<br />\nSHIRTS<br />\n4/<br />\nNECKWEAR He also requested the class to de- Lehigh Brown and White.<br />\n41<br />\nOver<br />\none<br />\nhundred<br />\nyears<br />\nPrice:<br />\nModerate<br />\n4/<br />\ncide on a general price limit for<br />\nof<br />\ndesigning<br />\nand<br />\ncreating 41<br />\nCommittee<br />\nCoaching<br />\nLacrosse<br />\nthe ring. After much discussion<br />\n0<br />\n421 N. HOWARD ST.<br />\n&lt;, Silverware assures the purApproved by A. A. Board '<br />\nit was decided to have about $18<br />\nchaser of Kirk pieces in<br />\nHOSIERY<br />\nGLOVES as the limit, although final deciContinued from page 1<br />\nsilver absolute certainty of<br />\n19 W. LEXINGTON ST.<br />\nreceipts due to the large<br />\ngate<br />\nin<br />\n'superiority.<br />\nsion as to exact price and design<br />\n9<br />\n0<br />\nwill be left to the committee. per cent, of complimentary tickets.<br />\nSTRATTON SHIRT MAKER<br />\n41<br />\nThis commitwinter.<br />\nall<br />\nstitution<br />\n226 N. Liberty St.<br />\nof<br />\nmost<br />\nKeyes,<br />\nMr.<br />\nto<br />\nAccording<br />\nO'Connor, Sophomore class<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\ntee has found that the old constitu$3.25 and $4.25 representative on the Student those who use complimentaries for<br />\nNegligee<br />\n.$5.25 and $6.25 Council, reported to the class the admission to the games would come tion serves the purposes of the<br />\nImported Madras<br />\nTerms Cash, Less 10% 30 Days on<br />\ncases which<br />\nproceedings of that organization. any way, and by giving them free board, except in several<br />\nShirts<br />\n0<br />\nchanges 41<br />\nThese<br />\ncorrected.<br />\nbeen<br />\nhave<br />\ntickets the Athletic Association<br />\nAlso a Full Line of Men's<br />\nFurnishings<br />\nNewbride—Did you get seats for misses the money which would be will be put before the student body 4<br />\nBaltimore, Md.<br />\n4<br />\ngained by their purchase of tickets. for ratification in a few days.<br />\nthe theatre, dearie?<br />\nEstablished 1873<br />\nthe<br />\nwhich<br />\n0<br />\n4<br />\nbusiness<br />\nAmong other<br />\nA change in the eligibility rules<br />\nHim—Yes, love; I got the fortyOldest Silversmiths in America<br />\n4<br />\nthe<br />\nfor Varsity teams is included in the A. A. Board attended to was<br />\nA.11. Fetting Man'fg Jewelry Co. third row.<br />\n4<br />\nEstablished in 1 8 1 7<br />\nconstitution of the A. A. adoption of several swimming recrevised<br />\nNewbride—Oh, I'm so glad! The<br />\nManufacturers<br />\n0<br />\n41<br />\nshow won't bother us a bit back Board. A committee has been at ords which have been established<br />\nGreek Letter Fraternity Jewelry<br />\n1<br />\nwinter.<br />\nthis<br />\nconthe<br />\nin<br />\nchanges<br />\nthe<br />\n:--:--: work on<br />\nt<br />\nthere.—Washington Dirge.<br /><br />\nThe Medical Standard Book Co.<br /><br />\nfiynson, Westcott and Dunning<br /><br />\nURNER'S<br /><br />\n.4<br /><br />\ncibe+.2titeri .e)<br />\nm,<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nJOHN C. KNIPP 8z SONS<br /><br />\n8c,Co.<br /><br />\nCHANTILLY<br />\nRestaurant Francais<br /><br />\nJ. F. Apple Co.<br /><br />\nW.L. Mann<br /><br />\nRADI<br /><br />\nRADIO SUPPLY CO.<br /><br />\nQuality<br /><br />\nLefranc &amp; Ault<br /><br />\nWYMAN<br /><br />\nsc Samuel Kirk;<br />\nand Son Co.<br /><br />\n213 N. LIBERTY ST., Baltimore, Md.<br /><br />"}], "field_media_file": [{"target_id": 37721, "display": null, "description": null, "target_type": "file", "target_uuid": "6eb8a04f-67d6-4df5-a77e-e7a8580ac5e3", "url": "http://digital.library.jhu.edu/system/files/2022-03/13051-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13051, "target_type": "node", "target_uuid": "2f9a2c3b-c448-420c-8226-124b6d12d5bc", "url": "/node/13051"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "38844f8b-a29f-469a-b12c-62780398f167"}]}