{"mid": [{"value": 38151}], "uuid": [{"value": "b814a018-5868-4990-8cbb-db78f6dd4674"}], "vid": [{"value": 38151}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:49:11+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12718-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:49:11+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:49:11+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nni<br />\n<br />\nXtiffttri Tfinpkins Dirtus-Erttrr<br />\n<br />\nWIN A PRIZE!<br />\nENTER FOOTBALL<br />\nCONTEST<br />\n<br />\n•r<br />\n<br />\ntz<br />\n<br />\nVOLUME XLI, No. 8<br />\n<br />\nee<br />\na-<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 27, 1936<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nTwo Fraternities Fined As 88 Frosh Are.Pledged<br />\nSeniors Show<br />\nLittle Interest<br />\nIn Nominations<br />\n,Pinck For Treasurer, Jaffe<br />\nFor Secretary, Only Nominations Made<br />\n<br />\nNominations Open<br />\nElection Schedule To Be Unchanged By Yesterday's<br />\nSurprising Events<br />\nAt six o'clock yesterday, supposedly<br />\nafter the nominations for officers of<br />\nthe senior class had been closed, it<br />\nW2.s found that the seniors had not<br />\nbeen interested enough in the elections to make any nominations for<br />\neither president, vice-president, or<br />\nsergeant-at-arms. One nomination of<br />\nBernard Pinck for treasurer and another for Leonard Jaffe as secretary<br />\nwere the only ones received by Hershner Cross, president of the Student<br />\nCouncil.<br />\nAnother attempt will be made tomorrow to allow the seniors a chance<br />\nto nominate officers. They will be allowed until six o'clock today. The remainder of the election schedule will<br />\nbe unchanged, however. There will be<br />\na primary election tomorrow and the<br />\nfinals on Friday.<br />\n<br />\nI<br />\n<br />\n1<br />\n<br />\nLevering Cafeteria To<br />\nCelebrate Hallowe'en<br />\nThe Levering Hall Cafeteria is<br />\nto celebrate Hallowe'en with special<br />\ndecorations, special luncheons, and<br />\na free meal contest. The contest is<br />\nto see how many words can be built<br />\nout of the word \"ANTITHESIS.\"<br />\nThe only rule is that no letter can<br />\nbe used more times in one word<br />\nthan it appears in the original<br />\nword. The contest closes next Tuesday noon. First prize will be one<br />\nweek's free lunches at the cafeteria and second prize three days of<br />\nfree lunch.<br />\nThe cafeteria is to be decorated<br />\nin typical Hallowe'en style, with<br />\norange and black streamers, and<br />\njack o' lanterns. Friday noon there<br />\nwill be a special treat for all customers; a surprise addition to the<br />\nregular luncheon.<br />\n<br />\nPrizes Offered<br />\nTo Close Guessers<br />\nOn Football Game<br />\nFive Best Guessers On<br />\nRandolph Macon Contest Will Win<br />\nCigar Board Sponsoring Contest To Stimulate Interest<br />\nIn Cigar Smoking<br />\nA new kind of guessing contest on<br />\nfootoall scores makes its appearance<br />\nhere Saturday. To the person guessing<br />\n<br />\nIt is expected that a natural result<br />\nclosest to the score of the Hopkinsof yesterday's fiasco will be the nomRandolph-Macon game, to be played<br />\nination of an exceedingly large group<br />\nat Homewood, October 31, will go<br />\nof candidates today, each candidate<br />\nprizes ranging from the $10.00 first<br />\nproceeding on the assumption that his<br />\nprize to the fifth—a box of twentycompetition will be none too keen.<br />\nfive cigars. The contest is sponsored<br />\nThe nominations were made under<br />\nby the Cigar Progress Board, to proa new system inaugurated this year<br />\nmote student interest in cigar-smokby the student council. Each candiing among the colleges of the country.<br />\ndate tor office was required to write<br />\nAll students of Hopkins are eligible,<br />\ndown the office desired with his own<br />\nincluding ladies. The blanks are to<br />\nname together with the endorsing<br />\nbe distributed with the NEWS-LETTER,<br />\nsignature of 10 members of his class<br />\nmust be filled out and returned not<br />\nand<br />\nand to hand this in to Box 1248. These<br />\nthan noon on the day of the<br />\nlater<br />\nSignature are required in order to<br />\nwuattt as nominees only those with game.<br />\nsonie support.<br />\nTo avoid confusion, in case the con_<br />\nTomorrow the primary elections<br />\ntest should end in a tie for first, the<br />\nWill be held to eliminate all but two<br />\nscore by quarters is to be filled in on<br />\nof the candidates for each office. The<br />\nthe<br />\nblanks, and a tie will be decided<br />\nlist of candidates will be placed<br />\nin the post office boxes of the on the basis of the best agreement<br />\nclass members. The ballots are of the quarterly score. After the<br />\nto be filled out, signed, and put in the blanks have been filled out, they are<br />\nto be put in one of the two boxes<br />\n'Azulot box which will be located in the<br />\nPost office. The box will be open only which will be provided for the purpose<br />\n0,:.t..wen 11.30 and 1.30 and from 4 to —one near the Post Office, and the<br />\n5. Each voter must have his name other in the Soda Fountain.<br />\nThe Cigar Progress Board, comChecked off the list by the man in<br />\nposed of representatives from the varicharge of the box before depositing his<br />\n. ous large cigar manufacturers of the<br />\nballot.<br />\ncountry, is sponsoring this and simThe final election will take place<br />\ncontests, \"to stimulate student<br />\nOn 141riday, October 30, and will be con- ilar<br />\ninterest<br />\nin cigar smoking, the dignity<br />\nducted under the same rules as the<br />\nit lends, and the real enjoyment dePrimary.<br />\nAn integral part of the student rived from it. It is hoped that every<br />\nstudent will avail himself of the opporcouncil's new election system is the<br />\ntunity offered by this contest, to win<br />\neligibility of all members of a class<br />\nto vote in the election. Last year when a valuable prize.\" The board repretne system was first tried out, all the sents one of America's largest industries, and has been conducting a serclasses but one, the present Senior<br />\nies of similar contests on the camclass, were allowed to vote in this<br />\npuses of other college over the coun_<br />\nmanner. Previously only those memtry, with continued success and enbers of a closa who had paid dues<br />\njoyment to the participants.<br />\nwere eligible to cast a vote. This reCommenting on the contest, a promsulted in elections which were far<br />\ninent Senior stated, \"Heretofore<br />\nfront representative. When last year's<br />\nthere has been a certain stigma atjunior class cast a total of 32 votes<br />\ntached to the smoking of cigars by<br />\nTi last year's election, it was realized<br />\ncollege students. It is my hope in<br />\nby the student council that a change<br />\nview of the enjoyment derived from<br />\nwas necessary. The result of the uncut<br />\ntobacco, that this sort of coneoancil's work is shown this year.<br />\ntest will relieve that stigma and stimThe present officers of the senior<br />\nulate interest in cigar smoking.<br />\nclass who were elected in the manner<br />\n- scribed above are Edward Donnelly, president, Holt Maulsby, chair- \"Victory Dance\" Success;<br />\nman of the Student Activities CornCotillion Plans Another<br />\nInittee, vice-president, Vernon Grove,<br />\nsecretary, James Bradford, treasurer,<br />\nThe \"Victory Dance,\" held last Satand Paul TJmbarger, sergeant-at-arms. urday night after the Haverford footThus far none of these have as yet ball game, was a complete financial<br />\nbeen nominated. Whether this indi- success, announced Dave Erck of the<br />\neatees that this group is not as strong Cotillion Board.<br />\nas it was last year or that its memThe Board will attempt to repeat its<br />\nbers have been merely guilty of negli- success with another \"Victory Dance\"<br />\ngence in not having their names turned to be held on Saturday, November 14,<br />\nin is a question which will be answered after the football game with American<br />\ntoday,<br />\nUniversity.<br />\n<br />\nEngineering School Faculty<br />\nRecallFirstDaysAtHomewood<br />\nDean Kouwenhoven And Professor Christie Tell<br />\nOf Foundation Of Engineering School<br />\nTwenty-Five Years Ago<br />\nBy BENJAMIN ROOT<br />\nThe Engineering School will have<br />\npassed an important milestone in its<br />\nhistory when it celebrates its twentyfifth anniversary this February.<br />\nThe NEWS-LETTER has sent this reporter to interview several members<br />\nof the faculty of this school who have<br />\nbeen serving during most of this period and to uncover sonic of the interesting facts of its early history.<br />\n<br />\nInterfrat Board<br />\nFines Delta Phi,<br />\nKappa Alpha<br />\n<br />\nFreshman Commission<br />\nTo Appoint Officers<br />\nThe Freshman Commission will<br />\nelect officers at its regular meeting at 6:00 tonight, in the Faculty<br />\nDining Room, Levering Hall. At<br />\nthe meeting held last week, a<br />\nnominating committee made up of<br />\nLaurie Dickson, Jefferson Hamilton, Robert Flagle, W. Dean Short,<br />\nand Frank X. McGovern was<br />\nelected. At the meeting tonight<br />\nplans will be made for the activities of the year.<br />\nThis organization is made up of<br />\nmembers of the Freshman class<br />\nchosen by the YMCA as representatives of the Class. Their purpose<br />\nis to discuss the problems of the<br />\nclass as a group.<br />\n<br />\nPresident of the University took place<br />\nat Homewood. In the fall of that year<br />\ninstruction was begun there in both<br />\nthe Engineering School and the College of Arts and Sciences, although<br />\nnone of the buildings on the campus<br />\nhad been fully completed at that time.<br />\nStudents who chronically complain<br />\nabout the uncomfortable seats in lecture halls and the temperature, be it<br />\nhot or cold, should be abashed when<br />\nthey consider the conditions faced by<br />\nthe intrepid students in those days<br />\nover twenty years ago. The first<br />\nbuilding with a heating system was<br />\nMaryland Hall, yet even this was not<br />\ncompletely installed until December.<br />\nThus the first half of the winter was<br />\nspent in buildings which offered practically no contrast to the chill winds<br />\noutside. In Gilman this condition<br />\nlasted throughout most of the winter. Jay Eleven Earns First VicRoads Poor<br />\ntory Of Season By<br />\nThe roads, as Dean Kouwenhoven<br />\n10-2 Count<br />\nand Professor Christie emphatically<br />\nasserted, were \"deep seas of mud<br />\nthrough which it was almost fool- ,Graziani Scores Lone Touchhardy for any vehicle to attempt to<br />\ndown; Baetjer Boots 22<br />\ntravel.\" Unloaded trucks were often<br />\nYard Field-Goal<br />\nstuck in the mud so deeply that it required extremely strenuous efforts<br />\nThe Blue Jays finally hit their scorto extricate them. Block and tackle<br />\ning pace against Haverford's redwere placed at strategic points along<br />\nthe roads, and a team of horses was clad eleven Saturday at Homewood,<br />\n<br />\nKappa Sigma Leads Pack<br />\nWith 14 Pledges As<br />\nRushing Ends<br />\n<br />\nK.A's. Next With 10<br />\nFraternities Pledge Total<br />\nOf Eighty-Eight<br />\nMen<br />\n<br />\nAt a meeting held yesterday, the<br />\nInterfraternity Board voted to fine<br />\ntwo fraternities, Kappa Alpha and<br />\nDelta Phi, which had violated the<br />\nrushing agreement. This incident culminated a rushing season which ended<br />\nSunday at three o'clock as eightyeighty freshmen were pledged.<br />\nKappa Alpha, fined $50, was said<br />\nto have been guilty of renting a house<br />\nat the shore and entertaining several<br />\nfreshmen there. This is a direct violation of the rule which states that<br />\nfreshmen must not be entertained out<br />\nOriginal Staff<br />\nof town. The Delta Phi fraternity was<br />\nCarl Thomas, now in Pasadena,<br />\nfined<br />\n$15 because one of its members<br />\nCalifornia, John Boswell Whitehead,<br />\nbroke the \"silent period\" on Sunday<br />\nProfessor of Electrical Engineering<br />\nmorning when he had a lengthy talk<br />\nand Dean of the Engineering Faculty,<br />\nwith one of the prospective pledges.<br />\nMyrick Whiting Pullen, Associate in<br />\nWhile it is expected that both fratCivil Engineering, and Professor<br />\nernities will pay their fines without<br />\nTilden now at Yale formed the original<br />\nundue struggle, it is a part of the rushteaching staff. This eminent group<br />\ning agreement that a fraternity which<br />\nwas augmented shortly afterward<br />\nkept busy aiding in rescuing mired triumphing by a 10-2 count. In this, does not<br />\naccept the decision of the<br />\nby the appointment of William B.<br />\ntrucks and wagons.<br />\ntheir first victory of the season, the board may find its case in the hands<br />\nKouwenhoven, Professor of Electrical<br />\nBoth Dr. Kouwenhoven and Pro- Blue<br />\nteam gained more yardage than of the student council which is backed<br />\nEngineering and Assistant Dean of<br />\nfessor Christie chuckled reminiscently<br />\nthe Engineering Faculty, and of Alexthey had in their two previous grid- by the Hopkins administration.<br />\nas they told some of the tales of those<br />\nThis year's happenings are quite<br />\nander G. Christie, Professor of Mechearly days. The former told the story iron engagements.<br />\nsimilar to those which occurred last<br />\nanical Engineering,<br />\nThe<br />\nHopkins<br />\ncontrolled the ball<br />\nof the rats, of which there were, it<br />\nyear. The only difference is that the<br />\nFinancially the foundation of the seemed, as many as in the unhappy and directed the course of the battle<br />\nInterfraternity Board, with its inschool was made possible by the pas- town of Hamelin. One of the favorite<br />\nthroughout, with the exception of a creased power, will now be able to<br />\nsage of an Act of the General Assem- sports of the students was rat chasing.<br />\nshort Haverford rally in the second enforce its decisions. Thus it is exbly of the State of Maryland in its Every once in a while, the students<br />\npected that in the future violations<br />\nsession of 1912. The Act provided a would leave classes and gather to- period. All the scoring took place durwill become all the rarer.<br />\nliberal appropriation for the erection gether to chase rats. They found it ing the first half. Coach Mallonee had<br />\nLast year the Phi Gamma Delta<br />\nof buildings and the purchase of equip- extremely amusing to place these rats his reserves playing most of the final<br />\nfraternity was condemned by the<br />\nment, and a continual annual appro- in the cars of the various faculty memquarter and a large part of the third. board for its actions during rushing<br />\npriation to the University. In con- bers.<br />\nseason. However, the Board had absoGraziano Scores<br />\nformity with this act the University<br />\nDean Kouwenhoven told about that<br />\nlutely no power at that time and the<br />\nCaptain<br />\ncarried<br />\nGraziano<br />\nthe<br />\npigoffers each year a number of scholar- faculty member who became very<br />\nfact that the violators were unpunships granting free tuition to resi- wroth when he found two rats whose skin over the enemy goal line, scoring<br />\nished almost succeeded in causing its<br />\ndents of the State of Maryland.<br />\nodor would have convinced anyone from tne 3-yard line midway in the destruction. The<br />\nreorganization efInauguration At Homewood<br />\nthat it had not recently been initial stanza. Baetjer converted by fected during the past winter<br />\nhas reOn May 22, 1915, the inauguration slaughtered. To combat this playful placement, with Kahl holding<br />\nthe ball. sulted in the formation of a newer and<br />\nof Professor Frank J. GOO:1110W as<br />\n(Continued on Page 3, Col. 3)<br />\nBaetjer also accounted for the Jays' stronger Board, as seen yesterday.<br />\nThe Kappa Sigma fraternity, with<br />\nfinal tally, kicking a field goal from<br />\na total of fourteen freshmen pledged,<br />\nthe Haverford 22-yard marker early<br />\nled the list of fraternities. They were<br />\nin the second period.<br />\nfollowed by the Kappa Alphas with ten<br />\nHaverford's two points came when pledges. The list of pledges to the<br />\nCarrol broke through to nail Buck in fraternities follows:<br />\nSigma Phi Epsilon: Frank Toobey,<br />\nthe end-zone after the latter, set to<br />\nTudor And Stuart To Hear Impressed By Lack Of En- bout the ball out of danger, had re- Charles Miller, Oscar Martinet, Jack<br />\nHuggins, Bill Prira, Arthur Belcher,<br />\ncouragement, He Changes ceived a poor pass from center.<br />\nDr. Hudson On Life<br />\nJerry Carleton, Robert McClean.<br />\nPenalty Prevents Tally<br />\nHis Tune<br />\nOf Sidney<br />\nBeta Theta Pi: Howard Hemming,<br />\nThe Hopkins was deprived of a<br />\n(Continued on Page 3, Col. 1)<br />\n•<br />\nThe Tudor and Stuart Literary Club<br />\nIt was at the Hopkins vs. Haver- second touchdown at the end of the<br />\nfirst<br />\nsession by the infliction of a 15offers its second function of the cur- ford football game. A freshman was<br />\nyard penalty. Graziano crashed off<br />\nrent season in the form of a smoker<br />\nsitting in the stands and School Spirit tackle from his opponents' 25-yard<br />\nat which Dr. Hoyt H. Hudson will<br />\non his face in full glory. \"We line and fought his way through the<br />\nshone<br />\naddress the group on Friday, October<br />\n30, at the clubroom in Gilman Hall. want a touchdown! We want a touch- entire Haverford secondary for an apDr. Hudson, chairman of the English down! We want a touchdown!\" he parent six points. But one of the Jay National Field Secretary Addresses<br />\nStudent Group At Meeting<br />\nDepartment at Princeton University, cried, but none around him blended linesmen was guilty of holding.<br />\nThe Jays were harassed by penalties,<br />\nFriday<br />\nhas unearthed an early manuscript<br />\nIl<br />\ntheir voices with his raucous but ar_<br />\nfrom start to finish. The final score<br />\nLife of Sir Philip Sidney, English Rendent yells. He alone cheered. He alone did not nearly indicate the superiority<br />\nMaurice Shils, of the Senior Class,<br />\naissance writer, which will be the subto desire a touchdown. Again of the Hopkins line and backfield over was elected Chairman of the Ameriseemed<br />\nject of his lecture Friday evening,. The<br />\nTudor and Stuart group opened its and again he raised his voice in cheer, the visitors'. The fact that the home can Student Union for the ensuing<br />\nseason on Tuesday, October 20, with but at each try, the silence surround- team rolled up eleven first downs year, at a meeting held last Friday.<br />\nThe following other officers were<br />\nan organization meeting and tea. ing him caused his voice to die, and bears this out.<br />\nTo start the game, Haverford kicked elected:<br />\nMembers of the English Journal Club his spirit to shrink within ham. He<br />\nJoseph Matcher....Seey-Treasurer<br />\nwere guests, after the holding of their wanted to yell \"for dear old Johnny off, and runs by Kahl and Graziano<br />\nMerel Harmel<br />\nEd. Director<br />\nfirst meeting. Mrs. Hazleton Spencer Hopkins on the side of the line,\" and put the ball on the Pennsylvanians'<br />\nHarold Jacobs<br />\nCor. Secretary<br />\nhe wanted to show that \"there is 12-yard line. Here a 15-yard penalty<br />\npoured.<br />\nSidney Levi<br />\nStud. Ad. Man.<br />\nThe club has not as yet planned any naught like the yell of a Freebie,\" but for tripping set the Jays back too far,<br />\nWilliam Hollister, Field Secretary<br />\nfurther programs for meetings, but the lack of support around him em- and Haverford took the ball on downs.<br />\nis seeking a speaker for its traditional barrassed him, and caused his voice Derr booted the ball for Haverford, of the ASU met with the group and<br />\ndinner-lecture in January. Last year to crack. \"We want a touchdown! We only to have three Hopkins huskies discussed plans for the year. The<br />\nMajor Bonamy Dobree of England was want a touchdown! We want a touch- charge through to block the kick. group voted to affiliate the Hopkins<br />\nEarly in the second quarter, the branch of the ASU with the Baltiguest lecturer. The speaker at these down!\" he cried painfully in a last efTudor and Stuart functions is always fort to bolster up the spirit of his Hopkins advanced the ball to Haver- more Council of The American Youth<br />\na noted authority on some branch of neighbors, but again he was defeated. ford's 10-yard marker. But yardage Congress. This organization, made up<br />\nEnglish study.<br />\nHis head bowed, his face fell, his body losses forced Baetjer to attempt a of several hundred youth organizaMembership Exclusive<br />\nslumped— but suddenly he straight- field goal from the 22-yard line. The tions including the ASU, the YMCA<br />\nMembership in this organization is ened up, and his face glowed. He was ball sailed directly between the goal and YWCA, is part of a national orvery select, its charter providing for not to be trod under by the multitude. posts and the score was 10-0. But ganization fighting for passage of the<br />\na maximum of eight men from the School Spirit was to live on if only shortly after Taylor had punted to American Youth Act, which provides<br />\njunior and eight men from the senior within himself. He filled his lungs, the Jay 1-yard line, a bad pass from for an extension and a permanent setclass, or a total of sixteen undergrad- opened his mouth, and his voice rang center caused Buck, playing full-back up of the National Youth Administrauate members. At present, there are out firm and clear, \"I want a touch- for the Hopkins, to be dropped in the tion.<br />\nThe next meeting of the ASU will<br />\napproximately one-hundred members, downlI want a touchdown! I want a end-zone for a Haverford safety.<br />\nThe second half brought a more even be held Thursday, October 29th at<br />\nof which 45 are in Johns Hopkins, and touchdown!\"<br />\n(Continued on Page 4, Col. 1)<br />\n11.30, in Levering Hall.<br />\n(Continued on Page 3, Col. 3)<br />\nHopkins won the football game.<br />\nThe Engineering School was founded<br />\nin 1912 when the University had not<br />\nas yet moved to its new residence at<br />\nHomewood. The entering class started<br />\nwith a record enrollment of three<br />\nstudents, Abel Wolman, J. Gorsuch,<br />\nand J. M. Lednum, all of whom are<br />\nwell-known in engineering circles<br />\ntoday. This small group formed the<br />\nfirst graduating class, its commencement taking place in 1915, the first<br />\nyear of the University's residence at<br />\nHomewood.<br />\n<br />\nHopkins Shows<br />\nPower In Win<br />\nOver Haverford<br />\n<br />\nPrinceton Scholar Cheering Freshman<br />\nTo Speak Here Shows School Spirit<br />\n<br />\nMauriceShilsChosen<br />\nASU Chairman Here<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MD., OCTOBER 27, 1936<br />\n<br />\n2<br />\n<br />\nObe Yobns Thopkins<br />\n<br />\nPeun5<br />\n<br />\nletter<br />\n<br />\nSubscription pet year<br />\nBy Slat! ......<br />\n<br />\nVAR/<br />\n<br />\nRemit subscription tees tu Treasurer, Student<br />\nActivities Council, Renisen Hall, Postothee, Johns<br />\nHopkins U niversity.<br />\nEntered as second class matter December .3,<br />\n1909, at the Postunice in Baltimore, add., under<br />\nthe Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June,<br />\nexcept during examination and college holiday<br />\nperiods by undergraduates of the Johns Hopkins<br />\nUniversity.<br />\nEDITORIAL STAFF<br />\nWilliam Diamond<br />\nEditor-in-Chief<br />\nStanley Finkel<br />\nAssociate Editor<br />\nJames Morrow, David Caplan_...Managing Editors<br />\nBernard D. Pinck<br />\nSports Editor<br />\nAssistant Managing Editor<br />\n-Benjamin Root<br />\nArnold Glantz, Harold Zheutlin<br />\nAssistant Spurts Editors<br />\nIsadore Gertnian, Wethered Barron<br />\nNews Editors<br />\nReporters --Max lskowitz, Nathaniel Finkelstein,<br />\nJewett Goldsmith, Howard Reizenstein, Julian Adler, Carl Basin, Floyd Katske,<br />\nLeonard Rubinger, Morris Wessel, Arthur<br />\nKatz, Martin Krieger, Lester Rosenthal,<br />\nSidney Baum.<br />\nBUSINESS STAFF<br />\nWilliam B. Ketripton<br />\nBusiness Manager<br />\nMelville Locker_ Assistant Business Manager<br />\nWm. C. Erlanger.<br />\nAdvertising Manager<br />\nGerald Willen<br />\n. __Circulation Manager<br />\nHoward Linkoff<br />\nOffice Manager<br />\nCopy and Filing Manager<br />\nNathaniel Soifer....<br />\n<br />\nf936<br />\n<br />\nMember<br />\n<br />\n1977<br />\n<br />\nAssociated Cotteetiaie Press<br />\nDistributors 40<br />\n<br />\nColle6icdeDi6est<br />\nREPRESENTLD<br />\n<br />\nFOR<br />\n<br />\nNATIONAL ADVERTISING<br />\n<br />\nST<br />\n<br />\nNational Advertising Service, Inc.<br />\nCollege Publishers Representative<br />\nNEW YORK. N.Y.<br />\n420 MADISON AvE.<br />\nSAN FRANCISCO<br />\nCHICAGO<br />\nBOSTON<br />\nLos ANGELIS - PORTLAND<br />\n<br />\nCoincidence?<br />\nSeveral days ago a group of students representing various universities in the vicinity of Baltimore sent<br />\na telegram to Governor Landon asking for a brief interview in which to<br />\n\"express their views on the necessity<br />\nJr an adequate peace proposal for<br />\noie United States.\"<br />\nThe following morning Mr. Landon, through the press, announced<br />\nthat he would be unable to include<br />\nBaltimore in his campaign itinerary.<br />\nCan there possibly be a coincidence<br />\nbetween these two events? Certainly<br />\nthe students who signed the telegram had no desire to frighten Governor Landon away.<br />\n<br />\nOnce, Only Once<br />\nThe Barnstormers have cleared<br />\ndecks for action! The entire group<br />\nhas beconie filled with an enthusiasm<br />\n..aat doesn't often find its way into<br />\nan undergraduate group.<br />\nWhat with a new coach, competent,<br />\nenthusiastic, and fresh from several<br />\ndramatic successes, and with a play<br />\nthat held Broadway enthralled for an<br />\nalmost record time, it is no little wonder that the Barnstormers are getLing to work hammer and tongs.<br />\nIt is not often that a college group<br />\nhas the opportunity to see a play of<br />\nthe calibre of Once in a Lifetime; but<br />\nit is really once in a lifetime that a<br />\ncollege student has the opportunity<br />\nof participating in a spectacle of such<br />\nunusual porportions.<br />\n<br />\nand the underclassmen, too, have a<br />\nstrong political machine to buck. That<br />\nmachine must be destroyed at the<br />\npulls during the coming weeks.<br />\nThe attitude of the majority of a<br />\nclass is generally one of apathy towards elections. The result is that<br />\nwe find an underground honeycomb<br />\nat politicians grasping the opportunity<br />\nto elect their private men, usually<br />\nundergraduates of no experience or<br />\nability in positions of leadership, and<br />\nof shady character, to say the least.<br />\nhis the till Ly oi every man in the class,<br />\noeiore voting to investigate the record<br />\noh each of the candidates for office<br />\nand to vote honestly and conscientiously on that basis.<br />\nOne of the most efficient methods<br />\nof eliminating the effects of politics<br />\nis by a one hundred percent turnout at<br />\n...lie polls. Fortunately the Students<br />\ne;ouncil, last year, took the lead in<br />\nuirection and announced that<br />\nevery member of the class will be<br />\n-6,01e to vote, whether or not he has<br />\npaid his class dues.<br />\nIn every election the bogey of fraceruity inevitably creeps up to befog<br />\nthe atmosphere. A word on that score<br />\nshould suffice. We are faced with<br />\ntwo problems here: that of underemphasizing the fraternity influence<br />\nand that of overemphasizing it. It<br />\nmust not be believed that the fraternity man is ipso facto incompetent or<br />\ncrooked. On the other hand we must<br />\nslot forget that the fraternity can be<br />\nused, in fact too often is used, as a<br />\nnie•hurn through which to crystallize<br />\nCampus opinion; it has become an<br />\nagent which, when pushed to its<br />\nlogical extreme, can exert an all too<br />\npowerful influence in freezing undergraduate opinion into a set mold.<br />\nThe position occupied by the officers of the Senior Class, both as representatives of the Class and in their<br />\nrelations to the University Administration, is far too important for any<br />\nhit-or-miss policy of voting. It is incunibent upon every member of the<br />\nSenior Class to vote for the man whom<br />\nhe thinks beat fitted for the post, a<br />\nman of high character, efficiency,<br />\nand ability; a man of unquestionable<br />\nhonesty and financial wisdom; a man<br />\nwith experience in both extra-curricular and class activities and with a<br />\ngenuine interest in the welfare of his<br />\nclass.<br />\nThe presidency of the Senior Class<br />\nIs no place for a vote-buyer or for a<br />\nslick politician. There is nothing that<br />\ncan be more detrimental to the morale<br />\nof a College, nothing which can violate to a greater extent Hopkin's trao.tional honor system. Every undergraduate in the University, in the<br />\nweeks of elections, must do everything<br />\nhe can to eradicate these undesirable<br />\npolitical blocs, to smash anything<br />\nwhich tends to hinder an honest, fair<br />\nclean election.<br />\n<br />\nTHE<br />\n<br />\nAMPUS<br />\n<br />\n1<br />\n<br />\nFla.- -( ACP) --- \"Take tion of the school. Miami has no funds<br />\nthat end out, Doc. What's the matter for library books, supplies, general<br />\nequipment, repairs, and wages for stuwith you?\" These are typical shouts<br />\ndent assistants and ground workers.<br />\nthat will soon be issuing from the<br />\nW. P. Roudebush, secretary of the<br />\nintramural field when the faculty university's board of trustees, states<br />\nleague at the University of Florida that the school hasn't the authority<br />\nto incur expenses on credit and that<br />\nswings into action.<br />\nit<br />\nwill have to struggle along without<br />\nProfessors M. D. Anderson, Dr. A.<br />\nthese services and supplies at present.<br />\nClark, Frazier Rogers, Phil Constans,<br />\n\"It will paralyze the operating and<br />\nand Ben Salt, advocates of including educational activities of the universeveral sports besides football, pre- sity,\" he said.<br />\nGainesville,<br />\n<br />\nAt last another of our college ambitions has been realized---that tall,<br />\nattractive girl in the biology department actually spoke to us.<br />\nIt happened in the cafeteria when<br />\nwe were just getting up from a table.<br />\nInis young lady in question (Linotypist, please don't set up \"question- dict a great season for their athletic<br />\nable lady.\") bumped into us, and were<br />\nbrethren.<br />\nBethlehem, Pa,. (ACP). According<br />\nwe thrilled when she spoke to us, sayNew York, N.Y. (ACP) When to claims made by Dr. Edgar S. Furing, \"I'm so sorry, excuse me.\"<br />\n* * •<br />\nPrinceton swamped the Harvard foot- niss, dean of the Graduate School of<br />\nYale University, hostility to higher edcall team last November by the score<br />\nCAFE COMPETITOR<br />\nas shown by attempts to supucation,<br />\nSpeaking of the cafe, we have in- of 35 to 0, Tiger fans—except Mr. W.<br />\npress intellectual freedom, is indirectly<br />\nvestigated a great potential competi- A. G. Le Boutillier—were completely<br />\nthe responsibility of the university ittor right here on the campus. Accord- happy.<br />\nself.<br />\nMr. Le Boutillier, class of 1910, had<br />\ning to Morty Schapiro, who has been<br />\nDean Furniss holds the university<br />\nliving on these foods for several days, noticed another thing other than the<br />\nthis diet makes you healthy-- -and scoreboard. After the game he said: responsible for the prevailing oppos_<br />\nof<br />\n\"Harvard's band was a knockout. sition to higher education because<br />\nwealthy.<br />\nto instill the tolerant attiThis place is the Botanical Garden And ours—well, everybody agreed it its failure<br />\nthe ability for real thought<br />\nbehind Gilman Hall where all the was terrible. Some of the fellows just tude and<br />\ngraduates, many of whom are<br />\nits<br />\nin<br />\nsome<br />\nand<br />\nhorns,<br />\nbe<br />\nto<br />\nare<br />\nthrough<br />\nfound.<br />\nwind<br />\nhere<br />\nblew<br />\nplants mentioned<br />\nnow leaders of most of the movements<br />\nFor the vegetarians there is grow- were there just to see the game. And<br />\nsuppression.<br />\nfor<br />\ning corn, sweet potatoes, cabbage, the uniforms were bad—nothing but<br />\n\"Heresy-hunting associations are<br />\npeas, cauliflower, squash, and aspar- an ordinary black sweater and a<br />\nsupported by those who have passed<br />\nagus. For those who like dressing crazy-looking orange hat.\"<br />\nthrough our institutions of higher<br />\nWilliam<br />\nDr.<br />\n(ACP)<br />\ncleeka,<br />\nendives,<br />\nN.Y.<br />\nGeneva,<br />\n(the an-ti-nudists?)<br />\nspanish oysters, cucumbers, and let- Alfred Eddy,.president of Hobart and learning. Demand for the regulation<br />\nWilliam Smith Colleges, rocked the of the intellectual life of the univertuce can be discovered here.<br />\nIf you like your foods highly spiced world of education, when he announc- sity comes chiefly from its own grador flavored, peppermint, vanilla, suger ed a four-year course in responsible uates.\"<br />\n<br />\ncoop is right at home, for she h<br />\nbeen a \"printer's devil\" ever since d<br />\nI<br />\nwas 12 years old.<br />\n<br />\nTHE COLLEGIATE REVIEW<br />\n(By Associated Collegiate Press)<br />\nThe conduct course now being<br />\nfered at the University of West VI<br />\nginia is not intended to teach self-co<br />\ntrol. It has been designed to show st<br />\ndents the \"hows\" of studying, makir<br />\na budget, and spending leisure time<br />\n<br />\nCharles S. Hendershot, a law st<br />\ndent at Ohio State University, expeC<br />\nto live in a sixteen-foot trailer wi<br />\nhis wife and dog for the next till\"<br />\nyears.<br />\nIndiana University students drip<br />\nthe cleanest milk in that state, sal<br />\nDoctor Clarence E. Mary,of the Cher<br />\nistry department, who tests milk fro:<br />\neach of the 31 Bloomington dairl(<br />\nevery month.<br />\n<br />\nFagi<br />\n<br />\nRe<br />\nDes I<br />\n<br />\nAbs<br />\n<br />\nClaude A. Watson, candidate for 01 dents<br />\nvice presidency of the Prohibitio storm<br />\nticket and a former student at Alni the •<br />\nCollege, will speak in the collei .<br />\ngathe<br />\nchapel there later this month.<br />\nPresident Roosevelt has proclaimi the o<br />\nthe week beginning November 9 1 Lions<br />\nAmerican Education Week.<br />\nera. .<br />\nSan Jose State College is now sen‘<br />\ning out life-time passes to graduatit Levin,<br />\nwho while students, proved their nig Fagin<br />\nquality in the field of sports.<br />\npl<br />\nHenry Ford the second, grandsoi the<br />\nf<br />\nof the automobile manufacturer,<br />\ns<br />\nBarns<br />\nnow a freshman at Yale.<br />\nconti<br />\nThe registrar at the University c differ Oklahoma proved statistically ths organ<br />\nstudents with the thinnest wallet the B:<br />\nget the most \"A's\" when two stat those<br />\nlegislators complained that the $ it sh<br />\n\"flunking fee\" is a hardship on pod Plays<br />\nstudents.<br />\nlikes<br />\nActivities of Associated Student will iii„<br />\nof the University of California lae he is<br />\nyear showed a net profit of $159,872..0:<br />\nThe First Catholic college in tt<br />\nUnited States was opened in 1677 13 o<br />\ner i<br />\nNewton, Maryland.<br />\nCourses in playing house, swingin) :to<br />\nII<br />\nwn<br />\n:in<br />\nstorm<br />\nclimbing, riding kiddie - cars, an invite<br />\nblockbuilciing are offered in the unl<br />\ninte'<br />\ns<br />\nversity of New Mexico's emergenc: after<br />\nnursery class this fall.<br />\nForty_one states and 17 countrie of Li<br />\ntt<br />\n,<br />\nare represented among the students o fy.n<br />\n1 g•<br />\nLouisiana State University.<br />\nested<br />\nAn alarming shortage of room an the<br />\nboard jobs may cause 200 students 0 Some<br />\nthte University of Wisconsin to witl s<br />\nruoird<br />\ntv<br />\ne<br />\nbd;<br />\nuee<br />\ndraw from school.<br />\nFifty University<br />\npto<br />\npolfayrrohloecdkoey7Tbe<br />\nhave signed u<br />\nt<br />\nseason will end on November 24, whe those<br />\nthe two best intramural teams wi<br />\nwish<br />\nmeet in the \"Army-Navy\" game.<br />\nrehea<br />\n\"0<br />\nQUOTABLE QUOTES<br />\nplays<br />\n<br />\nThe universities have been too<br />\ncitizenship as a requirement for a<br />\nbachelor's degree in his institutions. absorbed with their task af training<br />\nBefore an inauguration day audi- students to discharge adequately the<br />\nence of 2,000 persons, including rep- function of education \"of liberating<br />\nresentatives of more than 150 col- their minds and increasing the scope<br />\nthinking.\"<br />\nleges and universities and the judi- and penetration of their<br />\nthe vothat<br />\nbelieves<br />\nFurniss<br />\nDean<br />\nPresident<br />\nState,<br />\nYork<br />\nciary of New<br />\ncation function of the university<br />\nEddy said:<br />\naway from it.<br />\n\"We believe that the worth of the should not be taken<br />\nare oblearning<br />\nhigher<br />\nof<br />\nInstitutions<br />\nstate in the long run is the worth of<br />\nto serve society. A future polthe individuals composing it; that ir- ligated<br />\nthat should be adopted by schools<br />\nresponsible citizens cannot hope to icy<br />\nis the teaching of proper appreciation<br />\nthat<br />\ngovernment;<br />\nresponsible<br />\nset up a<br />\nof the spirit of learning.<br />\ndishonest individuals cannot expect<br />\n\"Delight in and tolerance for<br />\nExcerpt from the Brown Daily Herald<br />\nhonest public finance; that jingoistic<br />\nand bellicose peoples cannot operate a thought cannot be imparted by exhorThere are a dozen days left until<br />\npacific League of Nations; and that tation,\" he maintains. \"They must be<br />\nelection. A dozen days more in which<br />\naloof, fastidious seholars will not acquired in the classroom as a byLne American people will be lulled<br />\nturn into alumni impassioned for so- product of study.\"<br />\n\"It should be the task of every uniinto a kind of coma by the loud voices<br />\ncial justice.\"<br />\n\"The theory that a liberal education versity from this time forward to<br />\nof the politicans. For the campaign is<br />\ngrowing hotter, the speakers more<br />\nwill make a citizen responsible auto- make the study of every subject in its<br />\nis attractive but untrue. curriculum, even the most specialized<br />\nmatically<br />\nvociferous and more inaccurate. An<br />\nexperi_<br />\nThe truth is that a student is infected and technical, an educational<br />\nillustration of this is seen in the Reliberates<br />\nand<br />\nenlightens<br />\nwhich<br />\nence<br />\ncampus,<br />\nhis<br />\nof<br />\nenthusiasms<br />\nby the<br />\npublican National Committee's report<br />\nFrom one of our departmental ofTraining and education can<br />\nthat it so far figures its radio expenses fices conies the following conversation whatever they may be. Football, sci- the mind.<br />\nin any department<br />\ntogether<br />\nfused<br />\n,be<br />\nat between $50,000 and $75,000 per from a young lady and a grad student ence, literature, or art claim his inof a place in an institution of<br />\nworthy<br />\nMain<br />\nwhere<br />\nbut<br />\nlong;<br />\nlife<br />\nhis<br />\nterest<br />\nweek<br />\nweek, and that during the last<br />\n(masculine).<br />\nstreet and the town hall are treated higher learning.\"<br />\nof the campaign plans to spend $100,She: \"Hello, how are you?\"<br />\n(By Associated Collegiate Press)<br />\ning.<br />\nas beneath the scholar's contempt,<br />\n000 on radio programs alone. A like<br />\nHe (bright): \"Oh, about the same.\"<br />\n\"In public affairs, as in private deal<br />\nbeha<br />\nthe alumnus is ,not unnaturally, equallarge amount is being spent by the<br />\nBloomington, Ind. (ACP). Six years ings, the inescapable essential to civ<br />\nShe: \"Why, what's the matter with<br />\nmore<br />\nto<br />\ncontempt<br />\nthat<br />\ncarry<br />\nto<br />\nprone<br />\nly<br />\nDemocratic party in its radio cam- you.?\"<br />\na devil!<br />\nilized living is respect for the opinion, 7; an<br />\nthe grave.\"<br />\npaign.<br />\n* * *<br />\nThat isn't the title of a book. It's and sensibilities of others. If it is no<br />\nhe is<br />\nacof<br />\nfavor<br />\nin<br />\nDeclaring himself<br />\n$100,000 worth of political enterjust a segment-sentence description dominant in the domestic affairs o<br />\nBOTANY COURSE NEEDED<br />\nTh<br />\nevery<br />\nand<br />\nathletics<br />\nof<br />\npromotions<br />\ntive<br />\ntainment is very costly for the Reof the kind of life Mary Ann Wyn- a people it will be absent from their in<br />\nwill<br />\nWe wish that the Hopkins would<br />\ncamboth<br />\npublican party. If it were really good require a course in botany in view other form of activity on<br />\nkoop, freshman at Indiana Univer- ternational relations, and peace ant<br />\neight<br />\nentertainment the public would not of the tendency of the politicians to puses, Dr. Eddy said:<br />\nsity, has been living for the last half- prosperity will suffer.\" Dr. Harold IN<br />\nnotion<br />\nthe<br />\nat<br />\npuzzled<br />\nbeen<br />\nhave<br />\n'I<br />\nmind so much. But if the public turns associate flowers with candidates, esdozen years.<br />\nDodds, presient of Princeton Univer<br />\nto Democratic programs it can find pecially Landon and the sunflower. sometimes expressed that enthusiasm<br />\nBefore coming to college, she did sity, offers all Americans a timely sul;<br />\nno better entertainment or any bet- Someone who is a strong Roosevelt for football is hostile to the intedlec- all kinds of odd jabs around the of- gestions.<br />\nthe<br />\nter thought. We are approaching the follower happened to wear a yellow tual life, as though the lethargy of<br />\nfices of the Lebanon, Indiana, Daily<br />\n\"Already we have a great man)<br />\nif lethargy<br />\ndisappear<br />\nwould<br />\nclassroom<br />\nReporter, where her father serves as freshmen students who are quite un<br />\nfourteenth round of this fifteen round chrysanthemum was acccused no less<br />\nthe<br />\ncould somehow be enforced in<br />\ncity editor.<br />\nbout of the two major parties. The than 50 times of being a Landonite.<br />\nfitted for college work. They are here<br />\ngymnasium. I fail to see how exuber• • •<br />\nslugging is wild, the purposes conin many cases, merely because 11<br />\nEven<br />\nshe<br />\nthe<br />\nthough<br />\nis<br />\ncoed<br />\nfirst<br />\nance in athletics, dramatics, or social<br />\ntuned. It is the blood gutted fourSpeaking of flowers we wonder<br />\never to enroll in the linotype operating seems to be the thing to do and be<br />\nactivity.\"<br />\ntenth round When the fighters' senses why \"Hutch.\" was sent those two life inhibits intellectual<br />\nclass, conducted in the printing shop cause, without thought, they go wheri<br />\nare reeling. For the speakers of both large Dahlias. She claimed tht when<br />\nof the university press, Miss Wyn- their friends are going.\"<br />\nClar<br />\nUniverMiami<br />\nOxford, 0. (ACP).<br />\nparties, both on the air and in the she wore then only 1/<br />\n1 2 inches of her<br />\nHall<br />\noperating on a lean budget<br />\nis<br />\nsity<br />\npress, appear to have grown tired of evening gown showed.<br />\nstro<br />\nthese days. As the result of Governor<br />\n* * •<br />\nthe very sound of their own voices.<br />\nMartin L. Davey's veto of appropriaThey are inded slugging wild and<br />\nAnd, speaking of \"Hutch,\" the presMoo<br />\ntions amounting to $76,900 for 14<br />\nmaking little attempt to ride the ent head of the D. 0.(Women's Club)<br />\nsans<br />\nfuncefficient<br />\nthe<br />\nfor<br />\nnecessary<br />\nitems<br />\npunches.<br />\nreports that a scavenger hunt is in<br />\nFra<br />\nThose voters who have not yet de- the offing. We hope that they can colHat<br />\nThrills for the play originate in the<br />\ncided upon their choice for president lect some material for this column.<br />\ni<<br />\nlove triangle of the Rajah's son (an<br />\n• • •<br />\nwill find little real guidance in these<br />\nHar<br />\nclerk Carter;<br />\nlast few days of the battle. Through<br />\nFrom the University of Southern 'Oxfordian); the British<br />\nHer<br />\nWhen Carter<br />\nwife;<br />\noriental<br />\nhis<br />\nand<br />\nthe haze of mud slinging, of jumbled California comes news that Jeanne de<br />\nera<br />\nfacts and misstatements by preju- Lawney (Ca. Jeane) is doing all right takes to rum running and is caught<br />\nton<br />\ndiced presses and speakers, they will by her ex-alma meter. She is still and sentenced to death by the Rajah.<br />\nClu<br />\nIS:<br />\nDO<br />\nTO<br />\nlast<br />\nNEED<br />\nALL YOU<br />\nat the<br />\nhave difficulty in finding the pearl of reading the NEWS- LETTER and sends The Rajah pardons Carter<br />\npeople<br />\n1. Guess the final score of this Saturday's<br />\ntruth which will make them say: \"He her best regards to her Hopkins minute, but his son incites the<br />\nbig game.<br />\nregardless, as<br />\nEnglishman<br />\nthe<br />\nkill<br />\nto<br />\nIS the man for President of the United friends.<br />\nJar<br />\nDrop Your Entry in<br />\n2. Check your cigar shape preference.<br />\nmarry<br />\nwill<br />\nwife<br />\nCarter's<br />\nhe thinks<br />\n* *<br />\n3. In event of ties, those guessing score<br />\n'States.\" Let them turn off the radio<br />\nDi(<br />\nAny Ballot Box in the<br />\nBut now it is<br />\nby quarters will decide winners.<br />\nand read a few articles from monthly<br />\nContinuing at the Little Theater this him when thus released.<br />\nRic<br />\nPost Office or in the<br />\nPRIZES<br />\nmind, and this<br />\nher<br />\nchange<br />\nto<br />\nturn<br />\nher<br />\nwith<br />\nWest\"<br />\nMeets<br />\n\"East<br />\nthe<br />\nof<br />\nnature<br />\ntrue<br />\nis<br />\nGru<br />\nperiodicals on the<br />\nweek<br />\nSoda Fountain or Mail<br />\nFIRST-410.00<br />\ndeath at the<br />\ncampaign. Then let them turn out the George Arliss, Godfrey Teazle, and saves Carter from sudden<br />\nto Cigar Progress<br />\nSECOND—$5.00<br />\norientals.<br />\nhowling<br />\nof<br />\nmob<br />\na<br />\nof<br />\nhands<br />\nBallard Berkeley.<br />\nAghts and quietly go to sleep.<br />\nTHIRD—Box of 50 ten cent Cigars<br />\nBoard<br />\nConclusions to be derived from this<br />\nFOURTH—Box of 25 ten cent Cigars<br />\nFIFTH—Box of 25 two for fifteen cent<br />\nLittle presentation are that Arliss Is<br />\nCigars<br />\nstill Arliss, withal one of the finer<br />\nCIGAR PROGRESS BOARD<br />\nactors of the day, that British produc200 Fifth Avenue, New York<br />\ntion has still not acquired the Hollywood knack of making the best of the<br />\nFor he who is partial to the quaint constantly subjected to the cajoleries plot by injecting subtleties; and that<br />\nK.1<br />\nobviousness which characterizes the of the powers' ambassadors, each seek.. most of the finer English talent who<br />\nCII<br />\nBritish film, a pleasant enough even- ing to entice him in to a profitable could have made the best of some exco<br />\ning can be spent at the Little Theater, treaty with itself at the expense of cellent supporting roles, are either in<br />\nE(<br />\nSCORE BY QUARTERS<br />\nHollywood or on the English stage.<br />\nwhere George Arliss' newest portrayal the other.<br />\nManifesting the same diplomatic<br />\nShorts comprising the rest of the<br />\nof his usual sly, amiable statesman is<br />\nFourth<br />\nThird<br />\nFirst<br />\nSecond<br />\nFinal<br />\nMy Guess<br />\n-ability showed in every Arliss states- program at the Little include an abplaying.<br />\nCt<br />\nHopkins<br />\nJohns<br />\nEast Meets West, a film of excellent man portrait including Rothschild, stract interpretation of \"Evening<br />\npossibilities not attained by the British Wellington, and Voltaire, the wily Ra- Star\" from Tannhauser in photograRand.-Macon<br />\nproducers, has its setting in Rungay, jah of Rungay outwits the mere pol- phy, and a pictorial description of a<br />\n.11<br />\nMY CIGAR PREFERENCE<br />\na quaint oriental independancy lying ished and experienced tactics of the Hawaiian feast with Hula embellishV{<br />\nPerfecto<br />\nI<br />\n[<br />\nI l Panatella<br />\nsandwiched between the territorial ac- aggressor nations, \"satisfying\" their ments. These are characteristic of the<br />\nfier<br />\nA<br />\nDinner<br />\n1<br />\n1<br />\n[I Corona<br />\nI I Queen<br />\nquisitions of two major aggressive desires with treaties of non-aggres- Little program which never fails to<br />\na<br />\nas<br />\ndivertisement<br />\nName.<br />\nnovel<br />\nleast<br />\nfree<br />\nat<br />\nbe<br />\ncountry<br />\nMr.<br />\nand<br />\nhis<br />\nJapan.<br />\nsion,<br />\nkeeping<br />\npowers, Great Britain and<br />\nArliss' role is that of the somewhat from the ravages of the white man change from the larger picture houses<br />\nAddress<br />\nwith a more commercial atmosphere.<br />\nancient ruler of this territory who is and modernity.<br />\n<br />\nThe Barnstormers are probably in<br />\nneed of men: in addition to a busiOctober<br />\n1936<br />\n27,<br />\nTuesday,<br />\nness staff and production staff, which<br />\nincidentally will have about ten sets<br />\nco build, they have a cast of about 50<br />\nactors to fill. Every student who has<br />\nOpen season for politics and nefari- the least bit of talent in any of these<br />\nous political deals has now hit the ileitis should sign up at the Barn<br />\nimmediately. Once in a Lifetime is a<br />\ncampus. Senior Elections are on!<br />\nman's job----but when it's finished, it's<br />\nNo one can deny the truth, no<br />\nbeautiful to behold.<br />\nmatter how bitter it is. The Seniors,<br />\n<br />\nSeniors Elect--<br />\n<br />\nI RCLI N'<br />\n<br />\nINTERCOLLEGIATES<br />\n<br />\n5<br />\n,R<br />\n<br />\nI<br />\n<br />\nBallyhoo And Hooey<br />\n<br />\ncane, sugar beet, and pepper are<br />\namong those which comprise the semore<br />\nwith<br />\npeople<br />\nlection. For<br />\nsubstantial tastes wheat, barley, and<br />\nrye can be secured. And nut-s are found<br />\nin other places than you had known<br />\nright in this Garden.<br />\nFor dessert there is a variety of<br />\nfruits----pears, peaches, plums, pineapples, bananas, and apples.<br />\nAtter such a mixture you could even<br />\nobtain castor oil here--for the proper<br />\ningredients are in this veritable paradise.<br />\nf3esides, for you smokers there is<br />\ntobacco growing. If clothes make<br />\nthe man, then the flax, cotton, and<br />\nsilkseed here ought to mature many<br />\nof our students.<br />\nThe Thanksgiving Cotillion is not<br />\nfar off so were advising future corsage-senders to investigate the assorted flowers to be found in the<br />\nhothouse---it has orchids too!<br />\n<br />\nIn<br />\nFi<br />\nAl<br />\n<br />\nWhat's Your Guess?<br />\n<br />\nCIGAR PROGRESS BOARD<br />\nFootball Guessing Contest<br />\n<br />\nGeorge Arliss Portrays Wily<br />\nOriental At Little Theatre<br />\n<br />\nAIMI.1.1111•1MN.,<br />\n<br />\n\f3<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 27, 1936<br />\n<br />\nsince 450SeeThespian \"Tameness\" Of Dorm Freshmen<br />\nIllustrated By Activities<br />\nRally Thursday;<br />\nWith Electric Culbs, Cake Fights,<br />\npirit High Glass Fight Water<br />\nFights, Mark Tame<br />\nshe h<br />\n<br />\nVIEW<br />\nPress)<br />\n<br />\nbeing<br />\nt vicS<br />\n<br />\nself-co<br />\nhow st<br />\n, makir Fagin<br />\nre timE<br />\nlaw st<br />\n, expec<br />\nher WY<br />\nxt thil<br />\nits drii<br />\nate, sa;<br />\ne Cher<br />\nrilk fro<br />\n<br />\nAnd Desch Speak;<br />\nVets Present Skit; 1936<br />\nTryouts Held<br />\n<br />\nRehearsal Tonight<br />\nDesch Comments On Presence Of Promising<br />\nMaterial For Play<br />\nAbout one hundred and fifty students turned out for the annual Barn-<br />\n<br />\ne for<br />\nh.ibitio<br />\nstormer rally last Thursday night at<br />\nat Alm<br />\nthe Playshop. After welcoming the<br />\ncollei<br />\ngathering, Marty Levine, president of<br />\nclaine the organization, described the tradier 9<br />\n<br />\ntions and objectives of the Barnstormers. A short skit, entitled \"The Goat\"<br />\n<br />\nsen<br />\nwas then presented, following which<br />\nduat<br />\nLevine introduced Dr. N. Bryllion<br />\neir hi<br />\nFagin, director of the Playshop.<br />\nDr. Fagin expressed the desire that<br />\nrandsci the<br />\nfriendly relations between the<br />\nurer,<br />\nBarnstormers and the Playshop should<br />\ncontinue, and went on to explain the<br />\nrsity #<br />\ndifference between the two thespian<br />\nly the<br />\norganizations. \"The main purpose of<br />\nwallet<br />\nthe Barnstormers is to provide fun for<br />\no stat<br />\nthose who participate, and that is as<br />\nthe $ it<br />\nshould be,\" said Dr. Fagin, \"The<br />\nn poo<br />\nPlaysliop needs workers. Anyone who<br />\nlikes work connected with dramatics<br />\nudent Will<br />\nhave fun with us, in the sense that<br />\nia lae he<br />\nis working.\"<br />\n,872.0:<br />\nMr. John Desch, the Barnstormer's<br />\nin ti' new<br />\ncoach, was next introduced. He<br />\n1677<br />\nformally announced the selection of<br />\n\"Once in a Lifetime\" as the first Barnfingin1<br />\nstormer production of the season, and<br />\nrs, ae<br />\ninvited all those present to attend the<br />\nie uni<br />\nfirst tryouts at the Barn immediately<br />\nrgenc: after<br />\nthe rally.<br />\nLate in the evening Mr. Desch spoke<br />\nuntrie of<br />\nthe tryouts: \"They were very gratients 0<br />\nfying. Those present seemed as interested as though they were attending<br />\nthe premiere of some great play.<br />\nents<br />\nSome very fine acting material is in<br />\n3 Wit.111<br />\nevidence, and I don't expect much<br />\ntrouble in casting the play.\" \"Be asWOM<br />\nsured, however,\" continued Mr. Desch,<br />\nV's<br />\n\"That no part is definitely cast, and<br />\nwh<br />\nthose who have not tried out and who<br />\nwish to do so, may attend the next<br />\nrehearsal.\"<br />\n\"Once in a Lifetime\" is one of three<br />\nplays which Mr. Desch is now directess)<br />\ning. The others are: \"The Bishop Mise deal<br />\nbehaves,\" to be presented at Baltito civ<br />\nmore City College on November 6 and<br />\nAnio0 7; and<br />\n\"Invitation to a Murder,\" which<br />\nIs no<br />\nhe is directing for the Drama Guild.<br />\nLirs 6<br />\nThe next Barnstormer rehearsal<br />\nsir in<br />\nwill be held at the Barn tonight at<br />\ne ant eight-thirty.<br />\n)1d W<br />\nniver<br />\n6<br />\ny sug<br />\n<br />\nsigl<br />\nw<br />\n<br />\nman)<br />\n:e WI<br />\nhere<br />\nse<br />\nid be<br />\nwheri<br />\n<br />\nInterfrat Board<br />\nFines Delta Phi<br />\nAnd Kappa Alpha<br />\n(Continued from Page 1, Col. 6)<br />\nClarence Eldeskin, John Kibbee, John<br />\nHall, Robert Molloy, Herbert Armstrong, James Coady.<br />\nDelta Phi: Arthur Lankford, James<br />\nMoore, Richard Green, Ferdinand Pas.<br />\nsano, Donald Peck, Edward Thomas,<br />\nFrank Orrick, Carrington Williams,<br />\nHarvey Coulson.<br />\nKappa Sigma: Elmer Almquist,<br />\nHarry Brayshaw, Frank Butt, John<br />\nHerbst, Robert Hoopes, Milton Hutchcraft, Frank McGovern, James Norton, Charles Ritterhoff, Fred Six,<br />\nCharles Spoerer, Jack Stout, Charles<br />\nWiggins, Joseph Vavertnick.<br />\nPhi Kappa Psi: Berkeley Selmann,<br />\nJames Triplett, Robert Brown, Laurie<br />\nDickson, Robert Webster, Dean Short,<br />\nRichard Bradley, Harry Gosley, Fred<br />\nGreen.<br />\nAlpha Delta Phi: Andrew Young,<br />\nHugh O'Donovan, Edward Whitman.<br />\nKappa Alpha: Charles Allen, William<br />\nWhiteLock, Jefferson Hamilton, Frank<br />\nKohlhobb, John Halbig, William JanneY, Charles Rice, Roland St. Onge,<br />\nWilliam Wesson, Charles Kanady.<br />\nAlpha Chi Rho (formerly Omicron<br />\nKappa Omicron): Victor Ghent,<br />\nGeorge Thaler, George Dukas, Roscoe Insley, James Ahearn, Boyd Wylie,<br />\nEdwin Lowthion, Henry Leber.<br />\nDelta Upsilon: Turner Davis, John<br />\nGraham, Vincent Roach, Benjamin<br />\nCourtright, Thomas Dowers, Oscar<br />\nKerstetten, Robert Peck.<br />\nPhi Gamma Delta: Theodore Frui,<br />\nJames Winn, Seth Linthicum, Jesse<br />\nWilliams, William Kenney.<br />\nTau Alpha Phi: Thomas Brown,<br />\nThomas Schrieber, Howard Harr, Hubert Zeigler, Frank Taylor, Wilbur<br />\nSpicer, John Gray, John Lil.<br />\n<br />\nYear At Dorms<br />\nThat the freshman in the dorms<br />\nwere a \"tame bunch\" was the statement, published in the NEWS-LETTER,<br />\nof a self-professed \"veteran of many<br />\npranks.\" B entree, always the \"hot<br />\nspot\" of the dorms, evidently resents<br />\nthat remark Following is a record of<br />\ntheir accomplishments to date, and<br />\nwhether or not they are evidence of<br />\nthe \"tameness\" of the present freshmen may be decided upon by the<br />\nreader.<br />\nA glass fight in which electric fight<br />\nbulbs were used as missiles has been<br />\nheld. No serious injury was reported,<br />\nbut the caution money reserve of<br />\nsome has been greatly reduced.<br />\nA cake fight was held in which all<br />\nuneaten pastries sent by loving mothers to their \"tame\" sons were hurled<br />\nabout and splattered on the walls.<br />\nWater fights which have the effect<br />\nof making B entree one big puddle<br />\nare of ordinary occurance.<br />\nt<br />\nTwo crap games which lasted from<br />\napproximately ten in the evening until<br />\nsve the next morning were held. Practically all participants attended eightiiity classes the next morning.<br />\n<br />\nA stench bomb of such extraordinary strength that it made B entree<br />\npractically uninhabitable for three<br />\ndays was placed in a freshman's room<br />\nby a party who is, as yet, unkown.<br />\nOne man was rushed to the hospital for an emergency when his head<br />\nwas split open in a bit of innocent<br />\nhorseplay.<br />\nPing pong, a gentle parlor game,<br />\nwas transformed into a deathly serious struggle when one freshman lost<br />\n$150 in a series of games with<br />\nanother man. The loser of the ping<br />\npong match won back his money the<br />\nsame evening by staking another $150<br />\non one roll of the dace.<br />\nOne freshman was fed inethyline<br />\nblue along with a slice of blueberry<br />\npie. Methyline blue has a startling<br />\nbiological effect. The victimized B<br />\nentryite spent four hours in the library searching for information on<br />\nthe disease which he believed he had.<br />\nThat is the record of B entree, and,<br />\nas one B entryite put, it, \"Yeah, I<br />\nguess we have been pretty slow! But<br />\ngive us time to get settled; then we'll<br />\nbust this town wide open!\"<br />\n<br />\nUniversity Speaker EngineeringFaculty<br />\nDischarged At Yale Tell Of Early Days<br />\nConditions<br />\nAt<br />\nJerome Davis Asked To pescribe<br />\nHomewood Twenty<br />\nLeave After Twelve Years<br />\nYears Ago<br />\nTeaching<br />\nOf<br />\n(Continued from Page 1, Col. 3, 4)<br />\nDr. Jerome K. Davis, associate professor of practical philanthropy, Yale custom of the students, the members<br />\nof the faculty found it necessary to<br />\nDivinity School, and the next speaker<br />\nlock their cars, and have continued to<br />\nat the \"Y\" Supper Club at Hopkins, do so until this very day.<br />\nhas been asked to leave Yale UniversiThe Barn, present home of the<br />\nty at the end of this academic year, Barnstormers, now working there on<br />\nafter twelve years with that institu- their first play to be given this year,<br />\nwas then in reality a barn, with cows,<br />\ntion.<br />\nhorses, and all the other fixings, esDr. Davis, an outspoken critic of<br />\npecially a huge manure pile outside.<br />\nfinancial domination of education, has<br />\nDr. Christie recalled the days of<br />\ncharged that his dismissal from the<br />\nparticipation of the United States in<br />\nUniversity is a direct result of his adthe World War. The Hopkins campus,<br />\nherence to Liberal opinions.<br />\nwas then the seat of a training camp<br />\nHis ouster threatens to precipitate<br />\nwhich was run with all the military<br />\na bitter split throughout the univerregulations. It was necessary at that<br />\nsity, with the student council of the<br />\ntime to know the password in order<br />\nDivinity School already on record in<br />\nto be permitted to enter the camp.<br />\nProfessor Davis' behalf. The council<br />\nOne member of the faculty, ignorant<br />\nissued a statement charging that the<br />\nof the magic word, was put in the<br />\naction of the Yale corporation \"constiguardhouse for the night upon returnacademic<br />\nfreedom\".<br />\nmenace<br />\nto<br />\na<br />\ntutes<br />\ning to the campus. Although he was<br />\nSince he has been at Yale, Dr. Davis<br />\nreleased the next morning it was<br />\nhas been a leader of liberal thought,<br />\nfound rather difficult to soothe his<br />\nespecially among Sociological groups.<br />\nruffled feelings.<br />\nThe reason given for his dismissal<br />\nwas that lack of funds made retrenchment necessary, and that his teaching<br />\nwas not up to the Yale standard. It<br />\nis rumored, however, that his liberal<br />\nand semi-radical tendencies are partly<br />\nresponsible. It is also rumored that<br />\nDr. Charles A. Beard, leading historian and sociologist in this country, :Tudor And Stuart To Hear<br />\nis heading a committee which plans<br />\nDr. Hudson On Life<br />\nto make a thorough investigation of<br />\nOf Sidney<br />\nthe entire affair.<br />\nBefore coming to Yale in 1924, Dr.<br />\n(Continued from Page 1, Col. 3)<br />\nDavis, who received his Ph.D. at Col14 are undergraduates. There is thus<br />\numbia in 1922 and who also graduated<br />\nfrom the Union Theological Seminary, an opening for two new undergradwas secretary to Dr. Wilfred Gren- uate members. President of the Tudor<br />\nfell, director of the Grenfell Mission at and Stuart club is at present Dr. WarLabrador. He came to Yale from Dart- field T. Longcope, Physician_in-chief<br />\nmouth College, where he held the po- at the Johns Hopkins Hospital, who<br />\nsition of Assistant professor. At Yale<br />\nwas elected to this post last May.<br />\nhe held the Gilbert L. Stark chair of<br />\nThe Tudor and Stuart Club of the<br />\npractical philanthropy.<br />\nDuring the summers of 1926, 1927, Johns Hopkins University was found,<br />\nand 1932, he traveled in Russia, inves- ed in 1918 by an endowment of Sir<br />\ntigating conditions there. From 1931- William and Lady Osier for the pur1935, he was Chairman of the Connecpose of forming a literary club as a<br />\nticut Committee on Jails, and in 1933,<br />\nhe was Chairman of the Connecticut memorial to their son who fell in the<br />\nWorld War and as a gift to the UniCommittee on News Constitution.<br />\nHe is co-author with Harry Elmer versity. The club room and library in<br />\nBarnes of Readings in Sociology and Gilman Hall were fitted up by Mrs.<br />\nauthor of The Russian Immigrant,<br />\nRobert Brewster, a friend of Dr. Osier.<br />\nLabor Speaks for Itself in Religion,<br />\nThe New Russia, and several other The club now meets on an average of<br />\n<br />\nPrinceton Scholar<br />\nTo Speak Here<br />\n<br />\nLetters To The<br />\nEditor<br />\n<br />\n:-: BOOK REVIEWS :-:<br />\n<br />\nFar Forest by Francis Brett<br />\nYoung. $2.50.<br />\nStudents'<br />\nObjects<br />\nTo<br />\nCorrespondent<br />\nA<br />\nFar Forest is set in that part of<br />\nDisregard Of The \"Principles<br />\nmiddle England which is near WorOf Honesty.\"<br />\ncestershire and is watered by the<br />\nTo the Editor of THE NEWS-LETTER: river Severn, the country which Brett<br />\nDear Sir:<br />\nYoung knows and depicts so well.<br />\nA very disheartening experience has<br />\nAt 14, Jenny Hadley was shipped to<br />\nbefallen me. On Monday, October 19, I<br />\nWerewood,<br />\na tangled, beautifully<br />\nparked a car within one of the allotted<br />\nparking spaces in an authorized park- wooded part of the countryside, after<br />\ning area on the campus. During my her mother's casual desertion of the<br />\nabsence from the car it became dam- family,<br />\nwhere Jenny meets and comes<br />\naged. From the nature of the damage<br />\nto worship her older cousin David<br />\nit appears that it was caused by inexpert or inept maneuvering of another Wilden. When David seems to have<br />\ncar into or from a neighboring parking space. I am willing to admit Clot<br />\nthe infliction of damage probably was<br />\naccidental, but I submit that the fail_<br />\nure of the driver of the car causing<br />\nthe damage to make himself known<br />\nor to offer apologies or reparation is<br />\nmost disappointing. A card or note<br />\nleft attached to the damaged car<br />\nwould have sufficed.<br />\nHad I parked in an area frequented<br />\nby persons of low moral stamina I<br />\nshould have expected such an occurrence. At the Johns Hopkins University such a happening is unthinkable,<br />\nyet it actually took place. Having observed the satisfactory working of our<br />\nHonor System among our students,<br />\nI was shocked by this example of<br />\napparently dishonorable behavior. I<br />\nhope that it was a visitor to the Hopkins and not a regular member of our<br />\nUniversity who undermined my concept of the prevailing standard of<br />\nhonor.<br />\nMy object in writing this is to call<br />\nattention to a manner in which disregard for principles of honesty in<br />\neveryday affairs may work to tarnish<br />\nthe cherished product of years of<br />\nupright conduct by a vast majority of<br />\nuniversity people.<br />\nSincerely,<br />\nP. M. Reeve<br />\n<br />\nIn Re: 'Sciara'<br />\n.L.'4) the Editor Of THE NEWS-LETTER:<br />\nSir<br />\nI would like to take this opportunity<br />\nto clear up a few points which may<br />\nhave arisen from my article about<br />\nSciara, appearing in last Tuesday's<br />\nNEWS-LETTER.<br />\nBy stating that Sciara disobeyed the<br />\nMendelian Laws, I did not mean to<br />\nimply that Sciara disproved these<br />\nlaws of inheritance. The fundamental<br />\ninheritance mechanism (i e., chromosomes and genes) responsible for<br />\nMendelian heredity in organisms in<br />\ngeneral, is present in Sciara. It is the<br />\noperation and segregation of these<br />\nchromosomes which is different, and<br />\nthe ratios of inherited factors are<br />\ntherefore different. It is the fact that<br />\nSciara has that typical fundamental<br />\nhereditary system and yet the system<br />\noperates in a manner so different from<br />\nthat in the ordinary organism, which<br />\nmakes it especially important for research. By studying these differences<br />\nand abnormal actions, additional light<br />\nis thrown on the nature of the fundamental mechanism responsible for<br />\nMendelian inheritance.<br />\nMorris A. Wessel<br />\nTo the Editor of the NEWS-LETTEa,<br />\nDear Sir:<br />\nI wish to aid in the clarification of<br />\na lot of palaver concerning the machinations of certain dark, bloody bodies<br />\nknown as fraternities, and their relation to so-called class politics. The<br />\ncharge has been that fraternities have<br />\nmanaged the affairs of the Senior<br />\nclass long enough. The originators of<br />\nthe charge have therefore organized<br />\namong themselves, and by the simple<br />\nprocess of dealing in votes and securing backings, even of certain fraternities, at a cost, are now ready to<br />\npush their candidate over next Friday<br />\nwith a huge boughten majority.<br />\nThese persons are those who for<br />\nfour years have had no interest in the<br />\nclass at all, and have left it entirely<br />\nto fraternity men to manage their<br />\naffairs. Now they suddenly become<br />\n<br />\nforgotten her, and she has an idyllic<br />\nfour-day love affair with handsome<br />\nCharlie Potter, who goes to the African war leaving her with a child and<br />\nalone, she is cast out completely to<br />\nfend for herself and her child.<br />\nBrett Young tells her story with<br />\ncompetence and a flowing and often<br />\nbeautiful style. The part of England<br />\nthat he loves comes through the pages<br />\nwith its bleak harshness, or, and more<br />\noften, with its haunting, changing<br />\nbeauty, rather like a quiet rural idyll.<br />\nThose who know Brett Young through<br />\nThe Dark Tower, The Red Lakes, and<br />\nhis other works, will not be disappointed in Far Forest.<br />\nThree Worlds. By Carl Van<br />\nDoren. $3.00.<br />\nHere we have the process whereby<br />\na village-bred lad in Illinois became<br />\nin succession a teacher, a journalist<br />\nand a writer-editor, shining splendidly<br />\nIn each. But this book is more than the<br />\nstory of Carl Van Doren's boyh000d,<br />\nyouth, and manhood; it is the three<br />\nworlds, the Pre-War World of America's happy isolation from the turmoils of Europe, the Post-War exhilaration of horrors lived through or<br />\nescaped, and the sobering years of<br />\nthe Depression. It is the story not only<br />\nof himself but of his family, of his<br />\nfather who placed faith in the fertile<br />\nsoil of Illinois and bought more and<br />\nmore of it on credit, never dreaming<br />\nthat the rise of land values would<br />\nterminate and collapse, of his poet<br />\nbrother, Mark, and of his own precocious and talented children.<br />\nThere is no man known to this relower who has Carl Van Doren's capacity to inspire one with faith in<br />\nself and in that confidence which<br />\nmakes one feel that one's own work<br />\nis important. Two geniuses, among so<br />\nmany of lesser talent, looked to Carl<br />\nVan Doren for encouragement and<br />\nunderstanding--ElinorWylie and Sinclair Lewis—and he gave them. both<br />\nso much that it is touching to read<br />\nof their reliance upon him in the letters to him embodied in these miemoirs.<br />\nHis autobiography has something of<br />\nthe temper of the greatest of all autobiographies—that series of disconnected memoirs set down by Montaigne, wherein that great spirit dared<br />\nto be honest and candid with himself.<br />\nconscious of their inferiority in the<br />\nmatter and decide to throw out, by<br />\nmethods they have condemned, those<br />\nwho are experienced and who, in view<br />\nof previous service, deserve to run the<br />\nelEiss this next year.<br />\nA 4th Year Onlooker<br />\n<br />\nWhiteoak Forest. By Maza de la<br />\nRoche. $2.50.<br />\nEveryone who has known the<br />\nWhiteoak clan through the earlier<br />\nJalna books will certainly want to<br />\nread the lively chronicle of their latest doings. But even for a reader<br />\nhitherto unacquainted with this magnificent family, Whiteoak Harvest is<br />\na rich and lusty tale, complete in itself. All Jalna fans will find this book<br />\nas satisfactory as any—indeed, it is<br />\nvery nearly the best of the lot.<br />\nMa.zo de la Roche handles her many<br />\ncharacters and their multiple activities so skillfully that each retains his<br />\nown strongly individual characteristics. There is the story of Finch and<br />\niiis too-possessive wife, there is Uncle<br />\nErnest's belated love affair, there are<br />\nClara Lebraux and her daughter,<br />\neiaketield with his amazing self-importance which he takes into a monastery, and the mortgage which hangs<br />\nover them all—plenty of dramatic material. All these are really surplots,<br />\nhowever, less important than the<br />\ncrisis in the life of Jalna's master,<br />\nRonny Whiteoak. Remy is one of the<br />\nmost compelling and attractive figures in recent fiction. Most women<br />\nwill not understand how his coldly<br />\nself-centered wife Alayne could possibly leave him, though to be sure she<br />\n,had a good reason. Their differences<br />\nare satisfactorily settled in the final<br />\nchapters, but let us hope this won't<br />\nmean the end of the Jalna book. No,<br />\nas long as there is a Whiteoak left<br />\nalive there will be exciting and important things going on at Jalna.<br />\nGod in a Rolls-Royce. By John<br />\nHoshor. $2.60.<br />\nHere is the whole colorful and extraordinary story of Father Divine,<br />\nthe Negro Messiah whose cult in New<br />\nYork City embraces a growing number of Negro—as well as white—disciples. The account of his rise from<br />\nobscure and nebulous Georgia beginnings to What, in the eyes of his<br />\nflock, amounts to godhead; of the<br />\nformulation of his creed; of his stormy<br />\npassages with the law and his mysterious financial operations, is an<br />\namazing human document, at once<br />\nhumorous, fantastic, and tragic.<br />\nE. P. Dutton and Company recently published a new one dollar edition of A. A. Milne's Red House Mystery.<br />\nThe Red House Mystery has been<br />\nacclaimed by critics as one of the finest, most fascinating mystery stories<br />\nof all time. That verdict is still held<br />\nby mystery connoisseurs.<br />\nAntony Gillingham, humorous and<br />\nastute observer of life, arrives at the<br />\nmanor house of a quiet uneventful<br />\nEnglish village just as the fatal shot<br />\nis fired and thus finds himself involved<br />\nin a mystery that requires all his ingenuity to solve.<br />\nWhat makes Mr. Milne's first excursion into the field of murder an unusual book is its conclusion and denouement which will certainly prove<br />\nto be a surprise to even the most experienced detective story reader.<br />\n<br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br />\n<br />\nHOCHSCHILD, KOHN Elk Co.<br />\n<br />\nbooks along similar lines. He is one once every three weeks.<br />\nof the editors ofThe Journal of Social<br />\nForces, and an editorial contributor<br />\nInternational Group<br />\nof The Christian Science Monitor.<br />\n<br />\nTo<br />\nHold First Meeting<br />\n<br />\nFagin Asks Dramatists To<br />\nSubmit New Plays<br />\n<br />\nfieroftedrit<br />\n<br />\nThe International Relations Group<br />\nwill hold its organization meeting for<br />\nthis year in Remsen Hall, Room 1,<br />\n<br />\nIn an announcement made yesterday, Dr. N. Bryllion Fagin, director<br />\nof the Playshop, asked that all Hopkins students interested in pla,3rwriting should hand in to him as soon as<br />\npossible one of their own original<br />\nworks.<br />\nEach year in April the Playshop<br />\npresents one original drama. As very<br />\nfew entries have been received thus<br />\nfar, anyone is welcome to try.<br />\n<br />\nThursday at 11.30 a.m., announced<br />\nEdward Suarez-Murias, president.<br />\nThis group, organized last year under the direction of Dr. Frederick<br />\nLane of the History Department, discussed important international events<br />\nof the year. At the last meeting, Dr.<br />\nLane and Dr. Leon Sachs spoke.<br />\nMembership in this group is open<br />\nto all interested students.<br />\n<br />\nT Is•<br />\nhoney In<br />\nthe briar<br />\nkeeps the pips<br />\nsweet.<br />\nlik.High-•fficiency<br />\nCondenser cleans,purifies<br />\nsmoke.Traps moisture. NoclogOng.No trouble.Prove it you raisin<br />\n<br />\nAt Your Dealers<br />\n<br />\nimportant shirts in a<br />\ncollege man's wardrobe<br />\n<br />\n2.50<br />\nThese new \"Tweedline\" Manhattan shirts are being worn by<br />\nCollege men throughout the country.<br />\nDuke of Kent in design, (with button down collars), they come<br />\nin blue, green, tan, rose, and gray with contrasting chalk stripes.<br />\nSizes 14 to 17.<br />\nMEN'S SHOP, FIRST FLOOR<br />\n<br />\n\f4<br />\n<br />\nHOMEWOOD, BALTIMORE,<br />\n<br />\nSpirited Play<br />\nFeatures Touch<br />\nFootball Games<br />\nWell Organized Program Of<br />\nGrid Games Runs Along<br />\nSmoothly<br />\n<br />\nMany Close Contests<br />\nCardiacs, Sr. Gas Civils, N.J.<br />\nAll-Stars, Seven J's<br />\nRecord Victories<br />\nThe first two weeks of intramural<br />\ntouch football were marked by five<br />\nsnappy games and one massacre of the<br />\nrespective class teams. Play is now<br />\nrapidly getting better organized and<br />\ngoing off much more smoothly. The<br />\nsecond week of play saw only one<br />\nforfeit, that on the part of the Drizzle<br />\nPuss Hotshots to the New Jersey AllStars on Friday, October 26th.<br />\nAll-Stars Win<br />\nThe New Jersey All-Stars slaughtered the Trojans in what was probably the most scientific playing yet<br />\nexhibited in the league, on Friday,<br />\nOctober 16th. The All-Stars unleashed<br />\nan aerial attack in the form of a<br />\nbarrage of passes which left their opponents bewildered. A surprising number connected. Wall's interception<br />\nof the Trojans' passes and excellent<br />\nsprinting for touchdowns had no little<br />\nto do with leaving the opposition in<br />\na fog. High scorers for the New Jersey septet were Wall and Margolis<br />\nwith three touchdowns apiece, and<br />\nRubinger a close second with two.<br />\nThe Trojans scored their lone two<br />\npoints on a safety, bringing the final<br />\nscore to 48-2, with the Stars on the<br />\nlong end.<br />\n<br />\nINTERFRAT<br />\nS. P. E<br />\nPhi PEA '<br />\nT. A. Phi<br />\nKappa Sig<br />\n<br />\nWon<br />\n5<br />\n5<br />\n2<br />\n0<br />\n<br />\nLost<br />\n1<br />\n1<br />\n4<br />\n6<br />\n<br />\nTied<br />\n0<br />\n0<br />\n0<br />\n0<br />\n<br />\nSoccer Team Defeats Terps<br />\nOn Tally In Closing Minutes<br />\nThe Blue Jay Soccer team defeated<br />\nthe University of Maryland team 2-1,<br />\nat Homewood Saturday by a fastscoring play in the last few minutes<br />\nif the closing period.<br />\n<br />\nThe Cardiacs crushed the Meteors<br />\n18-6 on October 14. Stevens and Bishop<br />\nran up the score between them to<br />\n18, Enders making the six. The Sr.<br />\nGas Civils likewise beat the Tigers<br />\n30-0 on the 14th. Wisema.n, Diver,<br />\nReinaldi, and Grave scored.<br />\n<br />\nbacks Clisham and Bernheim who<br />\nboth turned in excellent performances.<br />\n<br />\nSport Schedule<br />\nINTERCOLLEGIATE<br />\nFootball—Johns Hopkins vs. Randolph - Macon,<br />\nSaturday,<br />\nat<br />\nHomewood.<br />\nSoccer--Johns Hopkins vs. State<br />\nTeachers, Tuesday, at Towson.<br />\nCross-Cotmtry—Johns Hopkins vs.<br />\n'Swarthmore,<br />\nSaturday,<br />\nat<br />\nSwarthmore.<br />\nTuesday—Pi Lamibda Phi vs. Tau<br />\nAlpha Omega; Alpha Epsilon Pi<br />\nvs. Tau Alpha Phi.<br />\nWednesday--Delta Phi vs. Beta<br />\nPhi Psi.<br />\nTheta Pi; Sigma Phi Epsilon vs.<br />\nThursday —Phi Sigma Delta vs.<br />\nPhi Epsilon vs. Phi Psi.<br />\nThursday—Phi Sigma Delta vs. Phi<br />\nEpsilon Pi; Phi Alpha vs. Kappa<br />\nAlpha.<br />\n<br />\nThe final whistle closed the game<br />\nwith the Collegk Parkens frustated<br />\nefforts to score leaving the Hopkins<br />\nPhi Sigs<br />\nThe Terrapins opened the attack in booters with their second successive<br />\nAlpha Dens<br />\nthe first period of the game with a victory of the season.<br />\nA. T. O.<br />\nseries of passes which yielded the ColPhi Alpha ...<br />\nHartke Stars<br />\nlege Parkers a tally when Morris,<br />\nThe honors of the game go to<br />\nplaying outside right, dented the HopP. Lam<br />\nHartke, playing center half for the<br />\nkins net on a direct corner kick.<br />\nD. U.<br />\nJays and to Yeager who held down the<br />\nThe Jays returned in the second right half position for the University<br />\nT A. O. .....<br />\nperiod playing harder than ever and Maryland booters. Both men, receivPhi Gams<br />\nseveral times came within scoring ed laudible comments for their excelposition of the visitors net. Linthi- lent performances.<br />\nO. K. O. . .<br />\ncum substitute at inside right for<br />\nBeta<br />\nThe line up:<br />\nHahn, drove in a beautiful boot for<br />\nK. A.<br />\nHopkins<br />\nU. of Maryland<br />\nthe tying tally as the second period<br />\nPhi Eps<br />\nHartman<br />\nLowitz<br />\nG.<br />\nFriday-Kappa Sigma vs. Delta<br />\ncame to a close. This kick covering<br />\nCltsham<br />\nF<br />\nL<br />\nScharf<br />\nUpsilon; Omicron Delta Omicron<br />\nevery bit of twenty yards proved to<br />\nBernheim<br />\nCorbin<br />\nRF<br />\nvs. Alpha Delta Phi.<br />\nbe the most spectacular boot of the<br />\nPhillips<br />\nL.H<br />\nSpringer<br />\ngame.<br />\nGough<br />\nR<br />\nH<br />\nYaeger<br />\nTargia Scores<br />\nHartke<br />\nC.H.<br />\nHobbs<br />\nTargin got the ball from a scrimMace<br />\n0L<br />\nArcher<br />\nmage in the goal mouth and taking<br />\nPrice<br />\n.0 R<br />\nMorris<br />\nA good sized turnout characterized a first-time shot whipped the bail into<br />\nTargin<br />\n1.14<br />\nNezbed:<br />\nthe fall lacrosse practice sessions held the net putting the Jays in a one<br />\nHahn<br />\nI.<br />\nR<br />\n.<br />\nHomewood field last Saturday was<br />\nBrokamp<br />\nlast week under the guidance of point lead.<br />\nBriggs<br />\nas much like a three ring circus as<br />\nStracham<br />\nCF<br />\nThe Terrapins then attacked strongCoach Kelso Morrill in preparation<br />\nSubstitutes for Hopkins: Linthi- anything could be, what with a crossly, getting three corners in quick<br />\nfor the Spring season. The men repsuccession, but all were cleared well cum, Bradshaw, Whitelock, and Kep- country meet, a soccer game, and a<br />\nfootball game going on all at once!<br />\nresenting last year's varsity, bolster- by Hartman with the aid of full- hart.<br />\n* • *<br />\ned by a group of hopeful freshman,<br />\nWon Lost Tied<br />\n6<br />\n0<br />\n0<br />\n4<br />\n2<br />\n0<br />\n1<br />\n4<br />\n1<br />\n5<br />\n1<br />\n0<br />\nWon Lost Tied<br />\n5<br />\n0<br />\n1<br />\n2<br />\n1<br />\n3<br />\n1<br />\n4<br />\n1<br />\n1<br />\n4<br />\n1<br />\nWon Lost Tied<br />\n4<br />\no<br />\n2<br />\n3<br />\n1<br />\n2<br />\n3<br />\n3<br />\n0<br />\n0<br />\n6<br />\n0<br />\n<br />\nLacrossemen Hold<br />\nPractice Sessions<br />\n<br />\nare progressing rapidly.<br />\nCoach Morrill ran the squad<br />\nthrough a gruelling half hour of<br />\nscrimage in the new box lacrosse<br />\ncage on the lower field after warming them up with a vigorous work-out<br />\nagainst the wall. Those members of<br />\nlast year's varsity squad engaging<br />\nin the tuning-up activities were -Naylor, Girrgher, Melvin, Wrenshaw,<br />\nHines, Katz, Gu.sack, Rosenthal, and<br />\nmany promising freshman among<br />\nwhom were Triplett, Enders and<br />\nBrown.<br />\n<br />\nSidelines<br />\n<br />\nPopow was in the Haverford backfled almost as much as the loser's own<br />\nbacks. It looked as though the visitors were rather annoyed at his acThe results of the Saturday's games tions. Nice going, Popow.<br />\n* * *<br />\nproVed quite disastrous to the future<br />\nThe Scarlet and Black invaders<br />\nopponents of the Blue Jay eleven.<br />\nOnly St. Johns escaped the same cate- gained more ground by virtue of pengory which faced Randolph-Macon, alties than by their own plays.<br />\n• * *<br />\nSwarthmore, and American U., by not<br />\n'being scheduled to play.<br />\nBaetjer's place kicking is a thing<br />\nDelaware<br />\n19 Ran.-Macon<br />\n6 of beauty and pleasure to watch, proDickinson<br />\n55 Swarthmore .... 0 vided, of course, you're a Hopkins<br />\nCoast Guard ..14 American U<br />\n7 fan.<br />\n<br />\nFuture Grid Opponents<br />\nHandball Entry Deadline<br />\nFare Badly Over Weekend<br />\nScheduled For October 26<br />\nApplications for entrance into the<br />\nfall handball tournament will not be<br />\naccepted after October 28, 1936. Men<br />\nwho have not as yet applied may do<br />\nso by dropping a note into P.O. Box<br />\n333. Informal handball practice takes<br />\nplace in the gym every Monday from<br />\n4 P.M. to 6 P.M.<br />\n<br />\nIn their first encounter of the season, the JOhns Hopkins cross-country<br />\nsquad was swamped by a strong Lehigh aggregation. The visitors had<br />\nfour of their men in a tie for first<br />\nplace to triump by a 19-36 count.<br />\nCapt. Sholtes of Hopkins got away<br />\nfast and held the lead for the first<br />\nmile but then the Lehigh quartet<br />\nforged to the front and were never<br />\nheaded thereafter. Hildebrandt, Hurst,<br />\nTompkins, and Sigley, the visitor's<br />\naces, broke the tape hand in hand,<br />\nrunning well within their best efforta. The winning time of 21 minutes, 43 seconds, was still faster than<br />\nthe beat performance ever made by a<br />\nJay representative.<br />\nBehind Sholtes in fifth place were<br />\nBrown, Driscoll, and Lyman, all of<br />\n'Hopkins, finishing in that order.<br />\nScharpf, Warminsky, and Johnson<br />\nwere the other Hopkins varsity men<br />\nto finish.<br />\nAlthough the ability of the Maroon<br />\nmen overshadowed the Black and<br />\nBlue's performance, it is still true that<br />\nCoach Hambleton had a well-balanced<br />\nsquad in action. Their times compare<br />\nfavorably with those made by Hopkins<br />\nin top shape and with several weeks<br />\nmore of conditioning, the Blue Jays<br />\nwill present a formidable outfit.<br />\n<br />\nrLight Smoke!<br />\n<br />\nFEATURE<br />\nA GREATprotection!<br />\n—throat<br />\nyourself hoarse —<br />\nYou can yell<br />\nhoarse I<br />\nsmoke yourself<br />\nwon't<br />\nyou<br />\nsmoke, are<br />\nlie<br />\na<br />\nFor Luckies,<br />\nyour guard<br />\n\"Toasted.\" This is<br />\nSo reach<br />\nirritation.<br />\nagainst throat<br />\nlie smoke!<br />\na<br />\n.<br />\n.<br />\nLucky<br />\nfor a<br />\n<br />\nfs a<br />\n<br />\nYour Throat Kept<br />\n<br />\nClear for Action!<br />\nSmoke round after round of Luckies, and<br />\nyour throat keeps clear, your voice keeps<br />\nclear. For Luckies are a light smoke! It is<br />\nonly Luckies that give your throat the protection offered by \"Toasting.\" So make<br />\nyour choice a light smoke and then smoke<br />\nround after round and they'll still taste<br />\ngood — your mouth will taste clean. For<br />\nLuckies are a light smoke — made from<br />\nchoice center leaves... the top price leaves<br />\n... of the \"Cream of the Crop\" tobaccos!<br />\n* *<br />\n<br />\nHaverford<br />\n...... Carroll<br />\nWilliams<br />\nReagan<br />\nRamsey<br />\nChilds<br />\nBalderston<br />\nMorian<br />\nBeeler<br />\nPrescott<br />\nDerr<br />\nAmbler<br />\n<br />\n0 2 0 0- 2<br />\nHaverford<br />\n7 3 0 0-10<br />\nHopkins<br />\nScoring — Johns Hopkins, touchdown, Graziano. Extra point, Baetjer,<br />\nplacement, with Kahl holding the ball.<br />\nField goal, Baetjer, Haverford—<br />\nSafety. Substitutions—Hopkins Bradford, Brown, Buck, Davies, Traggis,<br />\nL. Willer', Zavertnik, Green Kilbourne<br />\nMehling, Rickard, Rostov, Rudo,<br />\nKerstette. Haverford: Beausset, Balderston, Slaase, Watkins, Jackson,<br />\nHolzer, Taylor, Greenwood. Referee—<br />\nPaul Wilkinson. Umpire- - Jack Ogden. Head linesman----Harrry Goddard.<br />\nAgain Kahl and Graziano collaborated<br />\nin running the ball to the enemy<br />\n1-yard line. From here Graziano<br />\nplunged over for the first score and<br />\nBaetjer converted.<br />\n<br />\nCaptain Sholtes, Brown,<br />\nDriscoll, Lyman Score<br />\nFor Hopkins<br />\n<br />\negi<br />\n<br />\nKahl and Graziano were the stars<br />\nof the victorious team's backfield.<br />\nPopow, Hopkins, Mehling, and Day<br />\nwere the bolsterers of the line. Of<br />\ncourse, Baetjer's toe was a very powerful weapon, but it did not overshadow his defensive play. Vickers,<br />\ntoo comes in for a bit of praise.<br />\nThe line-up:<br />\n<br />\nL.T.<br />\nL.G<br />\nC.<br />\nR.G<br />\nR.T<br />\nR.E<br />\nQ.B.<br />\nL.H<br />\nRH<br />\nF.B<br />\n<br />\nFour Brown And White<br />\nHarriers Cross Line<br />\nIn Deadlock<br />\n<br />\nVis<br />\nBa<br />\n<br />\nBc<br />\nJay<br />\n<br />\nTI<br />\nwill<br />\nafter<br />\nrepr<br />\nUSU<br />\n<br />\nlist<br />\nothe<br />\nJohn<br />\nover<br />\nfron<br />\nTiwill<br />\nof t<br />\n<br />\ntwee<br />\non<br />\nkins<br />\npros<br />\n<br />\n(Cont. from page 1, col. 5)<br />\nbattle, and the game ended without<br />\nfurther scoring; but not before the<br />\nBlue reserves had threatened to score.<br />\n<br />\nBaetjer<br />\nPopow<br />\nDay<br />\nRoyster<br />\nHopkins<br />\nEllis<br />\nVickers<br />\nGraziano<br />\nWard<br />\nKahl<br />\nVincenti<br />\n<br />\nV()<br />\n<br />\nCon<br />\n<br />\nHopkins Shows<br />\nPower In Win<br />\nOver Haverford<br />\n<br />\nHopkins<br />\n<br />\nHill And Dalers<br />\nDrop First Meet<br />\nTo Lehigh Team<br />\n<br />\n•<br />\n<br />\nSeven J's Split<br />\nThe Seven J's likewise left the Civil<br />\njuniors rather badly battered after<br />\na shellacking to the merry tune of<br />\n42-6, on October 13. Beeler, Chesley,<br />\nSnodgrass, and Bowersox tallied for<br />\nthe J's, while Pecora of the Juniors<br />\nmade their lone touchdown. In their<br />\nnext contest on the 20th, however, the<br />\nJ's were held to a scoreless tie by the<br />\nSoph Engineers. These same Soph<br />\nEngineers had, on the 13th, lost to the<br />\nVictors, 18-0, Dukhart and Hughes<br />\nrunning up the score.<br />\n<br />\nOCTOBER 27, 1936<br />\n<br />\nNEWS RASH! * *<br />\n<br />\nBuo.<br />\nlow<br />\n<br />\nbeii<br />\n<br />\ncleat<br />\n<br />\nRai<br />\nro un<br />\nPain<br />\n<br />\nfullb<br />\nthe r<br />\n<br />\nWah<br />\npass<br />\nbadh<br />\nthe :<br />\nWel(<br />\nawal<br />\nsee<br />\nSalt<br />\nrads<br />\nbeen<br />\nthe<br />\nT1<br />\nDan<br />\nBoo]<br />\n195<br />\nis u<br />\nocca<br />\nto t<br />\npunt<br />\n200<br />\ninto<br />\nprot<br />\nHe]<br />\nishir<br />\nwho<br />\nthro<br />\nfens<br />\nvete<br />\nget<br />\nT1<br />\naver<br />\n<br />\n25 Winners in One Week<br />\nForget to Sign Their Names<br />\n<br />\n(1944,7„,<br />\n‘<br />\n21<br />\n/<br />\n41<br />\n<br />\nMany people,in their hurry to mail<br />\nin their entries in Your Lucky Strike<br />\n\"Sweepstakes,\" have forgotten to<br />\nsign their names.In one week alone<br />\n25 winners did not receive their<br />\nprizes because we didn't know to<br />\nwhom to send them.<br />\nHave you entered yet? Have you<br />\nwon your delicious Lucky Strikes?<br />\nThere's music on the air. Tune in<br />\n\"Your Hit Parade\"--Wednesday<br />\nand Saturday evenings.Listen,judge<br />\nand compare the tunes -then try<br />\nYour Lucky Strike \"Sweepstakes.\"<br />\nAnd don't forget to sign your name.<br />\nAnd if you're not already smoking<br />\nLuckies, buy a pack today. Maybe<br />\nyou've been missing something.<br />\n<br />\nbe t<br />\narm(<br />\n<br />\nAUS<br />\n<br />\nPut<br />\nby<br />\ntria<br />\ncoo/<br />\nthe<br />\nthe<br />\nof t<br />\ning<br />\n<br />\nishil<br />\nthat<br />\nand<br />\ngrer<br />\n<br />\ntern<br />\nis<br />\nse<br />\n<br />\nOF RICH, RIPE-BODIED<br />\n9<br />\nf<br />\nTOBACCO<br />\n— \"IT'S TOASTED\"<br />\nCopyright 1906, The Arneriran Totnamo Company<br />\n<br />\nthe<br />\nann<br />\nthis<br />\n<br />\n\f", "format": "basic_html", "processed": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nni<br /><br />\nXtiffttri Tfinpkins Dirtus-Erttrr<br /><br />\nWIN A PRIZE!<br />\nENTER FOOTBALL<br />\nCONTEST<br /><br />\n•r<br /><br />\ntz<br /><br />\nVOLUME XLI, No. 8<br /><br />\nee<br />\na-<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 27, 1936<br /><br />\nPRICE 5 CENTS<br /><br />\nTwo Fraternities Fined As 88 Frosh Are.Pledged<br />\nSeniors Show<br />\nLittle Interest<br />\nIn Nominations<br />\n,Pinck For Treasurer, Jaffe<br />\nFor Secretary, Only Nominations Made<br /><br />\nNominations Open<br />\nElection Schedule To Be Unchanged By Yesterday's<br />\nSurprising Events<br />\nAt six o'clock yesterday, supposedly<br />\nafter the nominations for officers of<br />\nthe senior class had been closed, it<br />\nW2.s found that the seniors had not<br />\nbeen interested enough in the elections to make any nominations for<br />\neither president, vice-president, or<br />\nsergeant-at-arms. One nomination of<br />\nBernard Pinck for treasurer and another for Leonard Jaffe as secretary<br />\nwere the only ones received by Hershner Cross, president of the Student<br />\nCouncil.<br />\nAnother attempt will be made tomorrow to allow the seniors a chance<br />\nto nominate officers. They will be allowed until six o'clock today. The remainder of the election schedule will<br />\nbe unchanged, however. There will be<br />\na primary election tomorrow and the<br />\nfinals on Friday.<br /><br />\nI<br /><br />\n1<br /><br />\nLevering Cafeteria To<br />\nCelebrate Hallowe'en<br />\nThe Levering Hall Cafeteria is<br />\nto celebrate Hallowe'en with special<br />\ndecorations, special luncheons, and<br />\na free meal contest. The contest is<br />\nto see how many words can be built<br />\nout of the word \"ANTITHESIS.\"<br />\nThe only rule is that no letter can<br />\nbe used more times in one word<br />\nthan it appears in the original<br />\nword. The contest closes next Tuesday noon. First prize will be one<br />\nweek's free lunches at the cafeteria and second prize three days of<br />\nfree lunch.<br />\nThe cafeteria is to be decorated<br />\nin typical Hallowe'en style, with<br />\norange and black streamers, and<br />\njack o' lanterns. Friday noon there<br />\nwill be a special treat for all customers; a surprise addition to the<br />\nregular luncheon.<br /><br />\nPrizes Offered<br />\nTo Close Guessers<br />\nOn Football Game<br />\nFive Best Guessers On<br />\nRandolph Macon Contest Will Win<br />\nCigar Board Sponsoring Contest To Stimulate Interest<br />\nIn Cigar Smoking<br />\nA new kind of guessing contest on<br />\nfootoall scores makes its appearance<br />\nhere Saturday. To the person guessing<br /><br />\nIt is expected that a natural result<br />\nclosest to the score of the Hopkinsof yesterday's fiasco will be the nomRandolph-Macon game, to be played<br />\nination of an exceedingly large group<br />\nat Homewood, October 31, will go<br />\nof candidates today, each candidate<br />\nprizes ranging from the $10.00 first<br />\nproceeding on the assumption that his<br />\nprize to the fifth—a box of twentycompetition will be none too keen.<br />\nfive cigars. The contest is sponsored<br />\nThe nominations were made under<br />\nby the Cigar Progress Board, to proa new system inaugurated this year<br />\nmote student interest in cigar-smokby the student council. Each candiing among the colleges of the country.<br />\ndate tor office was required to write<br />\nAll students of Hopkins are eligible,<br />\ndown the office desired with his own<br />\nincluding ladies. The blanks are to<br />\nname together with the endorsing<br />\nbe distributed with the NEWS-LETTER,<br />\nsignature of 10 members of his class<br />\nmust be filled out and returned not<br />\nand<br />\nand to hand this in to Box 1248. These<br />\nthan noon on the day of the<br />\nlater<br />\nSignature are required in order to<br />\nwuattt as nominees only those with game.<br />\nsonie support.<br />\nTo avoid confusion, in case the con_<br />\nTomorrow the primary elections<br />\ntest should end in a tie for first, the<br />\nWill be held to eliminate all but two<br />\nscore by quarters is to be filled in on<br />\nof the candidates for each office. The<br />\nthe<br />\nblanks, and a tie will be decided<br />\nlist of candidates will be placed<br />\nin the post office boxes of the on the basis of the best agreement<br />\nclass members. The ballots are of the quarterly score. After the<br />\nto be filled out, signed, and put in the blanks have been filled out, they are<br />\nto be put in one of the two boxes<br />\n'Azulot box which will be located in the<br />\nPost office. The box will be open only which will be provided for the purpose<br />\n0,:.t..wen 11.30 and 1.30 and from 4 to —one near the Post Office, and the<br />\n5. Each voter must have his name other in the Soda Fountain.<br />\nThe Cigar Progress Board, comChecked off the list by the man in<br />\nposed of representatives from the varicharge of the box before depositing his<br />\n. ous large cigar manufacturers of the<br />\nballot.<br />\ncountry, is sponsoring this and simThe final election will take place<br />\ncontests, \"to stimulate student<br />\nOn 141riday, October 30, and will be con- ilar<br />\ninterest<br />\nin cigar smoking, the dignity<br />\nducted under the same rules as the<br />\nit lends, and the real enjoyment dePrimary.<br />\nAn integral part of the student rived from it. It is hoped that every<br />\nstudent will avail himself of the opporcouncil's new election system is the<br />\ntunity offered by this contest, to win<br />\neligibility of all members of a class<br />\nto vote in the election. Last year when a valuable prize.\" The board repretne system was first tried out, all the sents one of America's largest industries, and has been conducting a serclasses but one, the present Senior<br />\nies of similar contests on the camclass, were allowed to vote in this<br />\npuses of other college over the coun_<br />\nmanner. Previously only those memtry, with continued success and enbers of a closa who had paid dues<br />\njoyment to the participants.<br />\nwere eligible to cast a vote. This reCommenting on the contest, a promsulted in elections which were far<br />\ninent Senior stated, \"Heretofore<br />\nfront representative. When last year's<br />\nthere has been a certain stigma atjunior class cast a total of 32 votes<br />\ntached to the smoking of cigars by<br />\nTi last year's election, it was realized<br />\ncollege students. It is my hope in<br />\nby the student council that a change<br />\nview of the enjoyment derived from<br />\nwas necessary. The result of the uncut<br />\ntobacco, that this sort of coneoancil's work is shown this year.<br />\ntest will relieve that stigma and stimThe present officers of the senior<br />\nulate interest in cigar smoking.<br />\nclass who were elected in the manner<br />\n- scribed above are Edward Donnelly, president, Holt Maulsby, chair- \"Victory Dance\" Success;<br />\nman of the Student Activities CornCotillion Plans Another<br />\nInittee, vice-president, Vernon Grove,<br />\nsecretary, James Bradford, treasurer,<br />\nThe \"Victory Dance,\" held last Satand Paul TJmbarger, sergeant-at-arms. urday night after the Haverford footThus far none of these have as yet ball game, was a complete financial<br />\nbeen nominated. Whether this indi- success, announced Dave Erck of the<br />\neatees that this group is not as strong Cotillion Board.<br />\nas it was last year or that its memThe Board will attempt to repeat its<br />\nbers have been merely guilty of negli- success with another \"Victory Dance\"<br />\ngence in not having their names turned to be held on Saturday, November 14,<br />\nin is a question which will be answered after the football game with American<br />\ntoday,<br />\nUniversity.<br /><br />\nEngineering School Faculty<br />\nRecallFirstDaysAtHomewood<br />\nDean Kouwenhoven And Professor Christie Tell<br />\nOf Foundation Of Engineering School<br />\nTwenty-Five Years Ago<br />\nBy BENJAMIN ROOT<br />\nThe Engineering School will have<br />\npassed an important milestone in its<br />\nhistory when it celebrates its twentyfifth anniversary this February.<br />\nThe NEWS-LETTER has sent this reporter to interview several members<br />\nof the faculty of this school who have<br />\nbeen serving during most of this period and to uncover sonic of the interesting facts of its early history.<br /><br />\nInterfrat Board<br />\nFines Delta Phi,<br />\nKappa Alpha<br /><br />\nFreshman Commission<br />\nTo Appoint Officers<br />\nThe Freshman Commission will<br />\nelect officers at its regular meeting at 6:00 tonight, in the Faculty<br />\nDining Room, Levering Hall. At<br />\nthe meeting held last week, a<br />\nnominating committee made up of<br />\nLaurie Dickson, Jefferson Hamilton, Robert Flagle, W. Dean Short,<br />\nand Frank X. McGovern was<br />\nelected. At the meeting tonight<br />\nplans will be made for the activities of the year.<br />\nThis organization is made up of<br />\nmembers of the Freshman class<br />\nchosen by the YMCA as representatives of the Class. Their purpose<br />\nis to discuss the problems of the<br />\nclass as a group.<br /><br />\nPresident of the University took place<br />\nat Homewood. In the fall of that year<br />\ninstruction was begun there in both<br />\nthe Engineering School and the College of Arts and Sciences, although<br />\nnone of the buildings on the campus<br />\nhad been fully completed at that time.<br />\nStudents who chronically complain<br />\nabout the uncomfortable seats in lecture halls and the temperature, be it<br />\nhot or cold, should be abashed when<br />\nthey consider the conditions faced by<br />\nthe intrepid students in those days<br />\nover twenty years ago. The first<br />\nbuilding with a heating system was<br />\nMaryland Hall, yet even this was not<br />\ncompletely installed until December.<br />\nThus the first half of the winter was<br />\nspent in buildings which offered practically no contrast to the chill winds<br />\noutside. In Gilman this condition<br />\nlasted throughout most of the winter. Jay Eleven Earns First VicRoads Poor<br />\ntory Of Season By<br />\nThe roads, as Dean Kouwenhoven<br />\n10-2 Count<br />\nand Professor Christie emphatically<br />\nasserted, were \"deep seas of mud<br />\nthrough which it was almost fool- ,Graziani Scores Lone Touchhardy for any vehicle to attempt to<br />\ndown; Baetjer Boots 22<br />\ntravel.\" Unloaded trucks were often<br />\nYard Field-Goal<br />\nstuck in the mud so deeply that it required extremely strenuous efforts<br />\nThe Blue Jays finally hit their scorto extricate them. Block and tackle<br />\ning pace against Haverford's redwere placed at strategic points along<br />\nthe roads, and a team of horses was clad eleven Saturday at Homewood,<br /><br />\nKappa Sigma Leads Pack<br />\nWith 14 Pledges As<br />\nRushing Ends<br /><br />\nK.A's. Next With 10<br />\nFraternities Pledge Total<br />\nOf Eighty-Eight<br />\nMen<br /><br />\nAt a meeting held yesterday, the<br />\nInterfraternity Board voted to fine<br />\ntwo fraternities, Kappa Alpha and<br />\nDelta Phi, which had violated the<br />\nrushing agreement. This incident culminated a rushing season which ended<br />\nSunday at three o'clock as eightyeighty freshmen were pledged.<br />\nKappa Alpha, fined $50, was said<br />\nto have been guilty of renting a house<br />\nat the shore and entertaining several<br />\nfreshmen there. This is a direct violation of the rule which states that<br />\nfreshmen must not be entertained out<br />\nOriginal Staff<br />\nof town. The Delta Phi fraternity was<br />\nCarl Thomas, now in Pasadena,<br />\nfined<br />\n$15 because one of its members<br />\nCalifornia, John Boswell Whitehead,<br />\nbroke the \"silent period\" on Sunday<br />\nProfessor of Electrical Engineering<br />\nmorning when he had a lengthy talk<br />\nand Dean of the Engineering Faculty,<br />\nwith one of the prospective pledges.<br />\nMyrick Whiting Pullen, Associate in<br />\nWhile it is expected that both fratCivil Engineering, and Professor<br />\nernities will pay their fines without<br />\nTilden now at Yale formed the original<br />\nundue struggle, it is a part of the rushteaching staff. This eminent group<br />\ning agreement that a fraternity which<br />\nwas augmented shortly afterward<br />\nkept busy aiding in rescuing mired triumphing by a 10-2 count. In this, does not<br />\naccept the decision of the<br />\nby the appointment of William B.<br />\ntrucks and wagons.<br />\ntheir first victory of the season, the board may find its case in the hands<br />\nKouwenhoven, Professor of Electrical<br />\nBoth Dr. Kouwenhoven and Pro- Blue<br />\nteam gained more yardage than of the student council which is backed<br />\nEngineering and Assistant Dean of<br />\nfessor Christie chuckled reminiscently<br />\nthe Engineering Faculty, and of Alexthey had in their two previous grid- by the Hopkins administration.<br />\nas they told some of the tales of those<br />\nThis year's happenings are quite<br />\nander G. Christie, Professor of Mechearly days. The former told the story iron engagements.<br />\nsimilar to those which occurred last<br />\nanical Engineering,<br />\nThe<br />\nHopkins<br />\ncontrolled the ball<br />\nof the rats, of which there were, it<br />\nyear. The only difference is that the<br />\nFinancially the foundation of the seemed, as many as in the unhappy and directed the course of the battle<br />\nInterfraternity Board, with its inschool was made possible by the pas- town of Hamelin. One of the favorite<br />\nthroughout, with the exception of a creased power, will now be able to<br />\nsage of an Act of the General Assem- sports of the students was rat chasing.<br />\nshort Haverford rally in the second enforce its decisions. Thus it is exbly of the State of Maryland in its Every once in a while, the students<br />\npected that in the future violations<br />\nsession of 1912. The Act provided a would leave classes and gather to- period. All the scoring took place durwill become all the rarer.<br />\nliberal appropriation for the erection gether to chase rats. They found it ing the first half. Coach Mallonee had<br />\nLast year the Phi Gamma Delta<br />\nof buildings and the purchase of equip- extremely amusing to place these rats his reserves playing most of the final<br />\nfraternity was condemned by the<br />\nment, and a continual annual appro- in the cars of the various faculty memquarter and a large part of the third. board for its actions during rushing<br />\npriation to the University. In con- bers.<br />\nseason. However, the Board had absoGraziano Scores<br />\nformity with this act the University<br />\nDean Kouwenhoven told about that<br />\nlutely no power at that time and the<br />\nCaptain<br />\ncarried<br />\nGraziano<br />\nthe<br />\npigoffers each year a number of scholar- faculty member who became very<br />\nfact that the violators were unpunships granting free tuition to resi- wroth when he found two rats whose skin over the enemy goal line, scoring<br />\nished almost succeeded in causing its<br />\ndents of the State of Maryland.<br />\nodor would have convinced anyone from tne 3-yard line midway in the destruction. The<br />\nreorganization efInauguration At Homewood<br />\nthat it had not recently been initial stanza. Baetjer converted by fected during the past winter<br />\nhas reOn May 22, 1915, the inauguration slaughtered. To combat this playful placement, with Kahl holding<br />\nthe ball. sulted in the formation of a newer and<br />\nof Professor Frank J. GOO:1110W as<br />\n(Continued on Page 3, Col. 3)<br />\nBaetjer also accounted for the Jays' stronger Board, as seen yesterday.<br />\nThe Kappa Sigma fraternity, with<br />\nfinal tally, kicking a field goal from<br />\na total of fourteen freshmen pledged,<br />\nthe Haverford 22-yard marker early<br />\nled the list of fraternities. They were<br />\nin the second period.<br />\nfollowed by the Kappa Alphas with ten<br />\nHaverford's two points came when pledges. The list of pledges to the<br />\nCarrol broke through to nail Buck in fraternities follows:<br />\nSigma Phi Epsilon: Frank Toobey,<br />\nthe end-zone after the latter, set to<br />\nTudor And Stuart To Hear Impressed By Lack Of En- bout the ball out of danger, had re- Charles Miller, Oscar Martinet, Jack<br />\nHuggins, Bill Prira, Arthur Belcher,<br />\ncouragement, He Changes ceived a poor pass from center.<br />\nDr. Hudson On Life<br />\nJerry Carleton, Robert McClean.<br />\nPenalty Prevents Tally<br />\nHis Tune<br />\nOf Sidney<br />\nBeta Theta Pi: Howard Hemming,<br />\nThe Hopkins was deprived of a<br />\n(Continued on Page 3, Col. 1)<br />\n•<br />\nThe Tudor and Stuart Literary Club<br />\nIt was at the Hopkins vs. Haver- second touchdown at the end of the<br />\nfirst<br />\nsession by the infliction of a 15offers its second function of the cur- ford football game. A freshman was<br />\nyard penalty. Graziano crashed off<br />\nrent season in the form of a smoker<br />\nsitting in the stands and School Spirit tackle from his opponents' 25-yard<br />\nat which Dr. Hoyt H. Hudson will<br />\non his face in full glory. \"We line and fought his way through the<br />\nshone<br />\naddress the group on Friday, October<br />\n30, at the clubroom in Gilman Hall. want a touchdown! We want a touch- entire Haverford secondary for an apDr. Hudson, chairman of the English down! We want a touchdown!\" he parent six points. But one of the Jay National Field Secretary Addresses<br />\nStudent Group At Meeting<br />\nDepartment at Princeton University, cried, but none around him blended linesmen was guilty of holding.<br />\nThe Jays were harassed by penalties,<br />\nFriday<br />\nhas unearthed an early manuscript<br />\nIl<br />\ntheir voices with his raucous but ar_<br />\nfrom start to finish. The final score<br />\nLife of Sir Philip Sidney, English Rendent yells. He alone cheered. He alone did not nearly indicate the superiority<br />\nMaurice Shils, of the Senior Class,<br />\naissance writer, which will be the subto desire a touchdown. Again of the Hopkins line and backfield over was elected Chairman of the Ameriseemed<br />\nject of his lecture Friday evening,. The<br />\nTudor and Stuart group opened its and again he raised his voice in cheer, the visitors'. The fact that the home can Student Union for the ensuing<br />\nseason on Tuesday, October 20, with but at each try, the silence surround- team rolled up eleven first downs year, at a meeting held last Friday.<br />\nThe following other officers were<br />\nan organization meeting and tea. ing him caused his voice to die, and bears this out.<br />\nTo start the game, Haverford kicked elected:<br />\nMembers of the English Journal Club his spirit to shrink within ham. He<br />\nJoseph Matcher....Seey-Treasurer<br />\nwere guests, after the holding of their wanted to yell \"for dear old Johnny off, and runs by Kahl and Graziano<br />\nMerel Harmel<br />\nEd. Director<br />\nfirst meeting. Mrs. Hazleton Spencer Hopkins on the side of the line,\" and put the ball on the Pennsylvanians'<br />\nHarold Jacobs<br />\nCor. Secretary<br />\nhe wanted to show that \"there is 12-yard line. Here a 15-yard penalty<br />\npoured.<br />\nSidney Levi<br />\nStud. Ad. Man.<br />\nThe club has not as yet planned any naught like the yell of a Freebie,\" but for tripping set the Jays back too far,<br />\nWilliam Hollister, Field Secretary<br />\nfurther programs for meetings, but the lack of support around him em- and Haverford took the ball on downs.<br />\nis seeking a speaker for its traditional barrassed him, and caused his voice Derr booted the ball for Haverford, of the ASU met with the group and<br />\ndinner-lecture in January. Last year to crack. \"We want a touchdown! We only to have three Hopkins huskies discussed plans for the year. The<br />\nMajor Bonamy Dobree of England was want a touchdown! We want a touch- charge through to block the kick. group voted to affiliate the Hopkins<br />\nEarly in the second quarter, the branch of the ASU with the Baltiguest lecturer. The speaker at these down!\" he cried painfully in a last efTudor and Stuart functions is always fort to bolster up the spirit of his Hopkins advanced the ball to Haver- more Council of The American Youth<br />\na noted authority on some branch of neighbors, but again he was defeated. ford's 10-yard marker. But yardage Congress. This organization, made up<br />\nEnglish study.<br />\nHis head bowed, his face fell, his body losses forced Baetjer to attempt a of several hundred youth organizaMembership Exclusive<br />\nslumped— but suddenly he straight- field goal from the 22-yard line. The tions including the ASU, the YMCA<br />\nMembership in this organization is ened up, and his face glowed. He was ball sailed directly between the goal and YWCA, is part of a national orvery select, its charter providing for not to be trod under by the multitude. posts and the score was 10-0. But ganization fighting for passage of the<br />\na maximum of eight men from the School Spirit was to live on if only shortly after Taylor had punted to American Youth Act, which provides<br />\njunior and eight men from the senior within himself. He filled his lungs, the Jay 1-yard line, a bad pass from for an extension and a permanent setclass, or a total of sixteen undergrad- opened his mouth, and his voice rang center caused Buck, playing full-back up of the National Youth Administrauate members. At present, there are out firm and clear, \"I want a touch- for the Hopkins, to be dropped in the tion.<br />\nThe next meeting of the ASU will<br />\napproximately one-hundred members, downlI want a touchdown! I want a end-zone for a Haverford safety.<br />\nThe second half brought a more even be held Thursday, October 29th at<br />\nof which 45 are in Johns Hopkins, and touchdown!\"<br />\n(Continued on Page 4, Col. 1)<br />\n11.30, in Levering Hall.<br />\n(Continued on Page 3, Col. 3)<br />\nHopkins won the football game.<br />\nThe Engineering School was founded<br />\nin 1912 when the University had not<br />\nas yet moved to its new residence at<br />\nHomewood. The entering class started<br />\nwith a record enrollment of three<br />\nstudents, Abel Wolman, J. Gorsuch,<br />\nand J. M. Lednum, all of whom are<br />\nwell-known in engineering circles<br />\ntoday. This small group formed the<br />\nfirst graduating class, its commencement taking place in 1915, the first<br />\nyear of the University's residence at<br />\nHomewood.<br /><br />\nHopkins Shows<br />\nPower In Win<br />\nOver Haverford<br /><br />\nPrinceton Scholar Cheering Freshman<br />\nTo Speak Here Shows School Spirit<br /><br />\nMauriceShilsChosen<br />\nASU Chairman Here<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 27, 1936<br /><br />\n2<br /><br />\nObe Yobns Thopkins<br /><br />\nPeun5<br /><br />\nletter<br /><br />\nSubscription pet year<br />\nBy Slat! ......<br /><br />\nVAR/<br /><br />\nRemit subscription tees tu Treasurer, Student<br />\nActivities Council, Renisen Hall, Postothee, Johns<br />\nHopkins U niversity.<br />\nEntered as second class matter December .3,<br />\n1909, at the Postunice in Baltimore, add., under<br />\nthe Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June,<br />\nexcept during examination and college holiday<br />\nperiods by undergraduates of the Johns Hopkins<br />\nUniversity.<br />\nEDITORIAL STAFF<br />\nWilliam Diamond<br />\nEditor-in-Chief<br />\nStanley Finkel<br />\nAssociate Editor<br />\nJames Morrow, David Caplan_...Managing Editors<br />\nBernard D. Pinck<br />\nSports Editor<br />\nAssistant Managing Editor<br />\n-Benjamin Root<br />\nArnold Glantz, Harold Zheutlin<br />\nAssistant Spurts Editors<br />\nIsadore Gertnian, Wethered Barron<br />\nNews Editors<br />\nReporters --Max lskowitz, Nathaniel Finkelstein,<br />\nJewett Goldsmith, Howard Reizenstein, Julian Adler, Carl Basin, Floyd Katske,<br />\nLeonard Rubinger, Morris Wessel, Arthur<br />\nKatz, Martin Krieger, Lester Rosenthal,<br />\nSidney Baum.<br />\nBUSINESS STAFF<br />\nWilliam B. Ketripton<br />\nBusiness Manager<br />\nMelville Locker_ Assistant Business Manager<br />\nWm. C. Erlanger.<br />\nAdvertising Manager<br />\nGerald Willen<br />\n. __Circulation Manager<br />\nHoward Linkoff<br />\nOffice Manager<br />\nCopy and Filing Manager<br />\nNathaniel Soifer....<br /><br />\nf936<br /><br />\nMember<br /><br />\n1977<br /><br />\nAssociated Cotteetiaie Press<br />\nDistributors 40<br /><br />\nColle6icdeDi6est<br />\nREPRESENTLD<br /><br />\nFOR<br /><br />\nNATIONAL ADVERTISING<br /><br />\nST<br /><br />\nNational Advertising Service, Inc.<br />\nCollege Publishers Representative<br />\nNEW YORK. N.Y.<br />\n420 MADISON AvE.<br />\nSAN FRANCISCO<br />\nCHICAGO<br />\nBOSTON<br />\nLos ANGELIS - PORTLAND<br /><br />\nCoincidence?<br />\nSeveral days ago a group of students representing various universities in the vicinity of Baltimore sent<br />\na telegram to Governor Landon asking for a brief interview in which to<br />\n\"express their views on the necessity<br />\nJr an adequate peace proposal for<br />\noie United States.\"<br />\nThe following morning Mr. Landon, through the press, announced<br />\nthat he would be unable to include<br />\nBaltimore in his campaign itinerary.<br />\nCan there possibly be a coincidence<br />\nbetween these two events? Certainly<br />\nthe students who signed the telegram had no desire to frighten Governor Landon away.<br /><br />\nOnce, Only Once<br />\nThe Barnstormers have cleared<br />\ndecks for action! The entire group<br />\nhas beconie filled with an enthusiasm<br />\n..aat doesn't often find its way into<br />\nan undergraduate group.<br />\nWhat with a new coach, competent,<br />\nenthusiastic, and fresh from several<br />\ndramatic successes, and with a play<br />\nthat held Broadway enthralled for an<br />\nalmost record time, it is no little wonder that the Barnstormers are getLing to work hammer and tongs.<br />\nIt is not often that a college group<br />\nhas the opportunity to see a play of<br />\nthe calibre of Once in a Lifetime; but<br />\nit is really once in a lifetime that a<br />\ncollege student has the opportunity<br />\nof participating in a spectacle of such<br />\nunusual porportions.<br /><br />\nand the underclassmen, too, have a<br />\nstrong political machine to buck. That<br />\nmachine must be destroyed at the<br />\npulls during the coming weeks.<br />\nThe attitude of the majority of a<br />\nclass is generally one of apathy towards elections. The result is that<br />\nwe find an underground honeycomb<br />\nat politicians grasping the opportunity<br />\nto elect their private men, usually<br />\nundergraduates of no experience or<br />\nability in positions of leadership, and<br />\nof shady character, to say the least.<br />\nhis the till Ly oi every man in the class,<br />\noeiore voting to investigate the record<br />\noh each of the candidates for office<br />\nand to vote honestly and conscientiously on that basis.<br />\nOne of the most efficient methods<br />\nof eliminating the effects of politics<br />\nis by a one hundred percent turnout at<br />\n...lie polls. Fortunately the Students<br />\ne;ouncil, last year, took the lead in<br />\nuirection and announced that<br />\nevery member of the class will be<br />\n-6,01e to vote, whether or not he has<br />\npaid his class dues.<br />\nIn every election the bogey of fraceruity inevitably creeps up to befog<br />\nthe atmosphere. A word on that score<br />\nshould suffice. We are faced with<br />\ntwo problems here: that of underemphasizing the fraternity influence<br />\nand that of overemphasizing it. It<br />\nmust not be believed that the fraternity man is ipso facto incompetent or<br />\ncrooked. On the other hand we must<br />\nslot forget that the fraternity can be<br />\nused, in fact too often is used, as a<br />\nnie•hurn through which to crystallize<br />\nCampus opinion; it has become an<br />\nagent which, when pushed to its<br />\nlogical extreme, can exert an all too<br />\npowerful influence in freezing undergraduate opinion into a set mold.<br />\nThe position occupied by the officers of the Senior Class, both as representatives of the Class and in their<br />\nrelations to the University Administration, is far too important for any<br />\nhit-or-miss policy of voting. It is incunibent upon every member of the<br />\nSenior Class to vote for the man whom<br />\nhe thinks beat fitted for the post, a<br />\nman of high character, efficiency,<br />\nand ability; a man of unquestionable<br />\nhonesty and financial wisdom; a man<br />\nwith experience in both extra-curricular and class activities and with a<br />\ngenuine interest in the welfare of his<br />\nclass.<br />\nThe presidency of the Senior Class<br />\nIs no place for a vote-buyer or for a<br />\nslick politician. There is nothing that<br />\ncan be more detrimental to the morale<br />\nof a College, nothing which can violate to a greater extent Hopkin's trao.tional honor system. Every undergraduate in the University, in the<br />\nweeks of elections, must do everything<br />\nhe can to eradicate these undesirable<br />\npolitical blocs, to smash anything<br />\nwhich tends to hinder an honest, fair<br />\nclean election.<br /><br />\nTHE<br /><br />\nAMPUS<br /><br />\n1<br /><br />\nFla.- -( ACP) --- \"Take tion of the school. Miami has no funds<br />\nthat end out, Doc. What's the matter for library books, supplies, general<br />\nequipment, repairs, and wages for stuwith you?\" These are typical shouts<br />\ndent assistants and ground workers.<br />\nthat will soon be issuing from the<br />\nW. P. Roudebush, secretary of the<br />\nintramural field when the faculty university's board of trustees, states<br />\nleague at the University of Florida that the school hasn't the authority<br />\nto incur expenses on credit and that<br />\nswings into action.<br />\nit<br />\nwill have to struggle along without<br />\nProfessors M. D. Anderson, Dr. A.<br />\nthese services and supplies at present.<br />\nClark, Frazier Rogers, Phil Constans,<br />\n\"It will paralyze the operating and<br />\nand Ben Salt, advocates of including educational activities of the universeveral sports besides football, pre- sity,\" he said.<br />\nGainesville,<br /><br />\nAt last another of our college ambitions has been realized---that tall,<br />\nattractive girl in the biology department actually spoke to us.<br />\nIt happened in the cafeteria when<br />\nwe were just getting up from a table.<br />\nInis young lady in question (Linotypist, please don't set up \"question- dict a great season for their athletic<br />\nable lady.\") bumped into us, and were<br />\nbrethren.<br />\nBethlehem, Pa,. (ACP). According<br />\nwe thrilled when she spoke to us, sayNew York, N.Y. (ACP) When to claims made by Dr. Edgar S. Furing, \"I'm so sorry, excuse me.\"<br />\n* * •<br />\nPrinceton swamped the Harvard foot- niss, dean of the Graduate School of<br />\nYale University, hostility to higher edcall team last November by the score<br />\nCAFE COMPETITOR<br />\nas shown by attempts to supucation,<br />\nSpeaking of the cafe, we have in- of 35 to 0, Tiger fans—except Mr. W.<br />\npress intellectual freedom, is indirectly<br />\nvestigated a great potential competi- A. G. Le Boutillier—were completely<br />\nthe responsibility of the university ittor right here on the campus. Accord- happy.<br />\nself.<br />\nMr. Le Boutillier, class of 1910, had<br />\ning to Morty Schapiro, who has been<br />\nDean Furniss holds the university<br />\nliving on these foods for several days, noticed another thing other than the<br />\nthis diet makes you healthy-- -and scoreboard. After the game he said: responsible for the prevailing oppos_<br />\nof<br />\n\"Harvard's band was a knockout. sition to higher education because<br />\nwealthy.<br />\nto instill the tolerant attiThis place is the Botanical Garden And ours—well, everybody agreed it its failure<br />\nthe ability for real thought<br />\nbehind Gilman Hall where all the was terrible. Some of the fellows just tude and<br />\ngraduates, many of whom are<br />\nits<br />\nin<br />\nsome<br />\nand<br />\nhorns,<br />\nbe<br />\nto<br />\nare<br />\nthrough<br />\nfound.<br />\nwind<br />\nhere<br />\nblew<br />\nplants mentioned<br />\nnow leaders of most of the movements<br />\nFor the vegetarians there is grow- were there just to see the game. And<br />\nsuppression.<br />\nfor<br />\ning corn, sweet potatoes, cabbage, the uniforms were bad—nothing but<br />\n\"Heresy-hunting associations are<br />\npeas, cauliflower, squash, and aspar- an ordinary black sweater and a<br />\nsupported by those who have passed<br />\nagus. For those who like dressing crazy-looking orange hat.\"<br />\nthrough our institutions of higher<br />\nWilliam<br />\nDr.<br />\n(ACP)<br />\ncleeka,<br />\nendives,<br />\nN.Y.<br />\nGeneva,<br />\n(the an-ti-nudists?)<br />\nspanish oysters, cucumbers, and let- Alfred Eddy,.president of Hobart and learning. Demand for the regulation<br />\nWilliam Smith Colleges, rocked the of the intellectual life of the univertuce can be discovered here.<br />\nIf you like your foods highly spiced world of education, when he announc- sity comes chiefly from its own grador flavored, peppermint, vanilla, suger ed a four-year course in responsible uates.\"<br /><br />\ncoop is right at home, for she h<br />\nbeen a \"printer's devil\" ever since d<br />\nI<br />\nwas 12 years old.<br /><br />\nTHE COLLEGIATE REVIEW<br />\n(By Associated Collegiate Press)<br />\nThe conduct course now being<br />\nfered at the University of West VI<br />\nginia is not intended to teach self-co<br />\ntrol. It has been designed to show st<br />\ndents the \"hows\" of studying, makir<br />\na budget, and spending leisure time<br /><br />\nCharles S. Hendershot, a law st<br />\ndent at Ohio State University, expeC<br />\nto live in a sixteen-foot trailer wi<br />\nhis wife and dog for the next till\"<br />\nyears.<br />\nIndiana University students drip<br />\nthe cleanest milk in that state, sal<br />\nDoctor Clarence E. Mary,of the Cher<br />\nistry department, who tests milk fro:<br />\neach of the 31 Bloomington dairl(<br />\nevery month.<br /><br />\nFagi<br /><br />\nRe<br />\nDes I<br /><br />\nAbs<br /><br />\nClaude A. Watson, candidate for 01 dents<br />\nvice presidency of the Prohibitio storm<br />\nticket and a former student at Alni the •<br />\nCollege, will speak in the collei .<br />\ngathe<br />\nchapel there later this month.<br />\nPresident Roosevelt has proclaimi the o<br />\nthe week beginning November 9 1 Lions<br />\nAmerican Education Week.<br />\nera. .<br />\nSan Jose State College is now sen‘<br />\ning out life-time passes to graduatit Levin,<br />\nwho while students, proved their nig Fagin<br />\nquality in the field of sports.<br />\npl<br />\nHenry Ford the second, grandsoi the<br />\nf<br />\nof the automobile manufacturer,<br />\ns<br />\nBarns<br />\nnow a freshman at Yale.<br />\nconti<br />\nThe registrar at the University c differ Oklahoma proved statistically ths organ<br />\nstudents with the thinnest wallet the B:<br />\nget the most \"A's\" when two stat those<br />\nlegislators complained that the $ it sh<br />\n\"flunking fee\" is a hardship on pod Plays<br />\nstudents.<br />\nlikes<br />\nActivities of Associated Student will iii„<br />\nof the University of California lae he is<br />\nyear showed a net profit of $159,872..0:<br />\nThe First Catholic college in tt<br />\nUnited States was opened in 1677 13 o<br />\ner i<br />\nNewton, Maryland.<br />\nCourses in playing house, swingin) :to<br />\nII<br />\nwn<br />\n:in<br />\nstorm<br />\nclimbing, riding kiddie - cars, an invite<br />\nblockbuilciing are offered in the unl<br />\ninte'<br />\ns<br />\nversity of New Mexico's emergenc: after<br />\nnursery class this fall.<br />\nForty_one states and 17 countrie of Li<br />\ntt<br />\n,<br />\nare represented among the students o fy.n<br />\n1 g•<br />\nLouisiana State University.<br />\nested<br />\nAn alarming shortage of room an the<br />\nboard jobs may cause 200 students 0 Some<br />\nthte University of Wisconsin to witl s<br />\nruoird<br />\ntv<br />\ne<br />\nbd;<br />\nuee<br />\ndraw from school.<br />\nFifty University<br />\npto<br />\npolfayrrohloecdkoey7Tbe<br />\nhave signed u<br />\nt<br />\nseason will end on November 24, whe those<br />\nthe two best intramural teams wi<br />\nwish<br />\nmeet in the \"Army-Navy\" game.<br />\nrehea<br />\n\"0<br />\nQUOTABLE QUOTES<br />\nplays<br /><br />\nThe universities have been too<br />\ncitizenship as a requirement for a<br />\nbachelor's degree in his institutions. absorbed with their task af training<br />\nBefore an inauguration day audi- students to discharge adequately the<br />\nence of 2,000 persons, including rep- function of education \"of liberating<br />\nresentatives of more than 150 col- their minds and increasing the scope<br />\nthinking.\"<br />\nleges and universities and the judi- and penetration of their<br />\nthe vothat<br />\nbelieves<br />\nFurniss<br />\nDean<br />\nPresident<br />\nState,<br />\nYork<br />\nciary of New<br />\ncation function of the university<br />\nEddy said:<br />\naway from it.<br />\n\"We believe that the worth of the should not be taken<br />\nare oblearning<br />\nhigher<br />\nof<br />\nInstitutions<br />\nstate in the long run is the worth of<br />\nto serve society. A future polthe individuals composing it; that ir- ligated<br />\nthat should be adopted by schools<br />\nresponsible citizens cannot hope to icy<br />\nis the teaching of proper appreciation<br />\nthat<br />\ngovernment;<br />\nresponsible<br />\nset up a<br />\nof the spirit of learning.<br />\ndishonest individuals cannot expect<br />\n\"Delight in and tolerance for<br />\nExcerpt from the Brown Daily Herald<br />\nhonest public finance; that jingoistic<br />\nand bellicose peoples cannot operate a thought cannot be imparted by exhorThere are a dozen days left until<br />\npacific League of Nations; and that tation,\" he maintains. \"They must be<br />\nelection. A dozen days more in which<br />\naloof, fastidious seholars will not acquired in the classroom as a byLne American people will be lulled<br />\nturn into alumni impassioned for so- product of study.\"<br />\n\"It should be the task of every uniinto a kind of coma by the loud voices<br />\ncial justice.\"<br />\n\"The theory that a liberal education versity from this time forward to<br />\nof the politicans. For the campaign is<br />\ngrowing hotter, the speakers more<br />\nwill make a citizen responsible auto- make the study of every subject in its<br />\nis attractive but untrue. curriculum, even the most specialized<br />\nmatically<br />\nvociferous and more inaccurate. An<br />\nexperi_<br />\nThe truth is that a student is infected and technical, an educational<br />\nillustration of this is seen in the Reliberates<br />\nand<br />\nenlightens<br />\nwhich<br />\nence<br />\ncampus,<br />\nhis<br />\nof<br />\nenthusiasms<br />\nby the<br />\npublican National Committee's report<br />\nFrom one of our departmental ofTraining and education can<br />\nthat it so far figures its radio expenses fices conies the following conversation whatever they may be. Football, sci- the mind.<br />\nin any department<br />\ntogether<br />\nfused<br />\n,be<br />\nat between $50,000 and $75,000 per from a young lady and a grad student ence, literature, or art claim his inof a place in an institution of<br />\nworthy<br />\nMain<br />\nwhere<br />\nbut<br />\nlong;<br />\nlife<br />\nhis<br />\nterest<br />\nweek<br />\nweek, and that during the last<br />\n(masculine).<br />\nstreet and the town hall are treated higher learning.\"<br />\nof the campaign plans to spend $100,She: \"Hello, how are you?\"<br />\n(By Associated Collegiate Press)<br />\ning.<br />\nas beneath the scholar's contempt,<br />\n000 on radio programs alone. A like<br />\nHe (bright): \"Oh, about the same.\"<br />\n\"In public affairs, as in private deal<br />\nbeha<br />\nthe alumnus is ,not unnaturally, equallarge amount is being spent by the<br />\nBloomington, Ind. (ACP). Six years ings, the inescapable essential to civ<br />\nShe: \"Why, what's the matter with<br />\nmore<br />\nto<br />\ncontempt<br />\nthat<br />\ncarry<br />\nto<br />\nprone<br />\nly<br />\nDemocratic party in its radio cam- you.?\"<br />\na devil!<br />\nilized living is respect for the opinion, 7; an<br />\nthe grave.\"<br />\npaign.<br />\n* * *<br />\nThat isn't the title of a book. It's and sensibilities of others. If it is no<br />\nhe is<br />\nacof<br />\nfavor<br />\nin<br />\nDeclaring himself<br />\n$100,000 worth of political enterjust a segment-sentence description dominant in the domestic affairs o<br />\nBOTANY COURSE NEEDED<br />\nTh<br />\nevery<br />\nand<br />\nathletics<br />\nof<br />\npromotions<br />\ntive<br />\ntainment is very costly for the Reof the kind of life Mary Ann Wyn- a people it will be absent from their in<br />\nwill<br />\nWe wish that the Hopkins would<br />\ncamboth<br />\npublican party. If it were really good require a course in botany in view other form of activity on<br />\nkoop, freshman at Indiana Univer- ternational relations, and peace ant<br />\neight<br />\nentertainment the public would not of the tendency of the politicians to puses, Dr. Eddy said:<br />\nsity, has been living for the last half- prosperity will suffer.\" Dr. Harold IN<br />\nnotion<br />\nthe<br />\nat<br />\npuzzled<br />\nbeen<br />\nhave<br />\n'I<br />\nmind so much. But if the public turns associate flowers with candidates, esdozen years.<br />\nDodds, presient of Princeton Univer<br />\nto Democratic programs it can find pecially Landon and the sunflower. sometimes expressed that enthusiasm<br />\nBefore coming to college, she did sity, offers all Americans a timely sul;<br />\nno better entertainment or any bet- Someone who is a strong Roosevelt for football is hostile to the intedlec- all kinds of odd jabs around the of- gestions.<br />\nthe<br />\nter thought. We are approaching the follower happened to wear a yellow tual life, as though the lethargy of<br />\nfices of the Lebanon, Indiana, Daily<br />\n\"Already we have a great man)<br />\nif lethargy<br />\ndisappear<br />\nwould<br />\nclassroom<br />\nReporter, where her father serves as freshmen students who are quite un<br />\nfourteenth round of this fifteen round chrysanthemum was acccused no less<br />\nthe<br />\ncould somehow be enforced in<br />\ncity editor.<br />\nbout of the two major parties. The than 50 times of being a Landonite.<br />\nfitted for college work. They are here<br />\ngymnasium. I fail to see how exuber• • •<br />\nslugging is wild, the purposes conin many cases, merely because 11<br />\nEven<br />\nshe<br />\nthe<br />\nthough<br />\nis<br />\ncoed<br />\nfirst<br />\nance in athletics, dramatics, or social<br />\ntuned. It is the blood gutted fourSpeaking of flowers we wonder<br />\never to enroll in the linotype operating seems to be the thing to do and be<br />\nactivity.\"<br />\ntenth round When the fighters' senses why \"Hutch.\" was sent those two life inhibits intellectual<br />\nclass, conducted in the printing shop cause, without thought, they go wheri<br />\nare reeling. For the speakers of both large Dahlias. She claimed tht when<br />\nof the university press, Miss Wyn- their friends are going.\"<br />\nClar<br />\nUniverMiami<br />\nOxford, 0. (ACP).<br />\nparties, both on the air and in the she wore then only 1/<br />\n1 2 inches of her<br />\nHall<br />\noperating on a lean budget<br />\nis<br />\nsity<br />\npress, appear to have grown tired of evening gown showed.<br />\nstro<br />\nthese days. As the result of Governor<br />\n* * •<br />\nthe very sound of their own voices.<br />\nMartin L. Davey's veto of appropriaThey are inded slugging wild and<br />\nAnd, speaking of \"Hutch,\" the presMoo<br />\ntions amounting to $76,900 for 14<br />\nmaking little attempt to ride the ent head of the D. 0.(Women's Club)<br />\nsans<br />\nfuncefficient<br />\nthe<br />\nfor<br />\nnecessary<br />\nitems<br />\npunches.<br />\nreports that a scavenger hunt is in<br />\nFra<br />\nThose voters who have not yet de- the offing. We hope that they can colHat<br />\nThrills for the play originate in the<br />\ncided upon their choice for president lect some material for this column.<br />\ni&lt;<br />\nlove triangle of the Rajah's son (an<br />\n• • •<br />\nwill find little real guidance in these<br />\nHar<br />\nclerk Carter;<br />\nlast few days of the battle. Through<br />\nFrom the University of Southern 'Oxfordian); the British<br />\nHer<br />\nWhen Carter<br />\nwife;<br />\noriental<br />\nhis<br />\nand<br />\nthe haze of mud slinging, of jumbled California comes news that Jeanne de<br />\nera<br />\nfacts and misstatements by preju- Lawney (Ca. Jeane) is doing all right takes to rum running and is caught<br />\nton<br />\ndiced presses and speakers, they will by her ex-alma meter. She is still and sentenced to death by the Rajah.<br />\nClu<br />\nIS:<br />\nDO<br />\nTO<br />\nlast<br />\nNEED<br />\nALL YOU<br />\nat the<br />\nhave difficulty in finding the pearl of reading the NEWS- LETTER and sends The Rajah pardons Carter<br />\npeople<br />\n1. Guess the final score of this Saturday's<br />\ntruth which will make them say: \"He her best regards to her Hopkins minute, but his son incites the<br />\nbig game.<br />\nregardless, as<br />\nEnglishman<br />\nthe<br />\nkill<br />\nto<br />\nIS the man for President of the United friends.<br />\nJar<br />\nDrop Your Entry in<br />\n2. Check your cigar shape preference.<br />\nmarry<br />\nwill<br />\nwife<br />\nCarter's<br />\nhe thinks<br />\n* *<br />\n3. In event of ties, those guessing score<br />\n'States.\" Let them turn off the radio<br />\nDi(<br />\nAny Ballot Box in the<br />\nBut now it is<br />\nby quarters will decide winners.<br />\nand read a few articles from monthly<br />\nContinuing at the Little Theater this him when thus released.<br />\nRic<br />\nPost Office or in the<br />\nPRIZES<br />\nmind, and this<br />\nher<br />\nchange<br />\nto<br />\nturn<br />\nher<br />\nwith<br />\nWest\"<br />\nMeets<br />\n\"East<br />\nthe<br />\nof<br />\nnature<br />\ntrue<br />\nis<br />\nGru<br />\nperiodicals on the<br />\nweek<br />\nSoda Fountain or Mail<br />\nFIRST-410.00<br />\ndeath at the<br />\ncampaign. Then let them turn out the George Arliss, Godfrey Teazle, and saves Carter from sudden<br />\nto Cigar Progress<br />\nSECOND—$5.00<br />\norientals.<br />\nhowling<br />\nof<br />\nmob<br />\na<br />\nof<br />\nhands<br />\nBallard Berkeley.<br />\nAghts and quietly go to sleep.<br />\nTHIRD—Box of 50 ten cent Cigars<br />\nBoard<br />\nConclusions to be derived from this<br />\nFOURTH—Box of 25 ten cent Cigars<br />\nFIFTH—Box of 25 two for fifteen cent<br />\nLittle presentation are that Arliss Is<br />\nCigars<br />\nstill Arliss, withal one of the finer<br />\nCIGAR PROGRESS BOARD<br />\nactors of the day, that British produc200 Fifth Avenue, New York<br />\ntion has still not acquired the Hollywood knack of making the best of the<br />\nFor he who is partial to the quaint constantly subjected to the cajoleries plot by injecting subtleties; and that<br />\nK.1<br />\nobviousness which characterizes the of the powers' ambassadors, each seek.. most of the finer English talent who<br />\nCII<br />\nBritish film, a pleasant enough even- ing to entice him in to a profitable could have made the best of some exco<br />\ning can be spent at the Little Theater, treaty with itself at the expense of cellent supporting roles, are either in<br />\nE(<br />\nSCORE BY QUARTERS<br />\nHollywood or on the English stage.<br />\nwhere George Arliss' newest portrayal the other.<br />\nManifesting the same diplomatic<br />\nShorts comprising the rest of the<br />\nof his usual sly, amiable statesman is<br />\nFourth<br />\nThird<br />\nFirst<br />\nSecond<br />\nFinal<br />\nMy Guess<br />\n-ability showed in every Arliss states- program at the Little include an abplaying.<br />\nCt<br />\nHopkins<br />\nJohns<br />\nEast Meets West, a film of excellent man portrait including Rothschild, stract interpretation of \"Evening<br />\npossibilities not attained by the British Wellington, and Voltaire, the wily Ra- Star\" from Tannhauser in photograRand.-Macon<br />\nproducers, has its setting in Rungay, jah of Rungay outwits the mere pol- phy, and a pictorial description of a<br />\n.11<br />\nMY CIGAR PREFERENCE<br />\na quaint oriental independancy lying ished and experienced tactics of the Hawaiian feast with Hula embellishV{<br />\nPerfecto<br />\nI<br />\n[<br />\nI l Panatella<br />\nsandwiched between the territorial ac- aggressor nations, \"satisfying\" their ments. These are characteristic of the<br />\nfier<br />\nA<br />\nDinner<br />\n1<br />\n1<br />\n[I Corona<br />\nI I Queen<br />\nquisitions of two major aggressive desires with treaties of non-aggres- Little program which never fails to<br />\na<br />\nas<br />\ndivertisement<br />\nName.<br />\nnovel<br />\nleast<br />\nfree<br />\nat<br />\nbe<br />\ncountry<br />\nMr.<br />\nand<br />\nhis<br />\nJapan.<br />\nsion,<br />\nkeeping<br />\npowers, Great Britain and<br />\nArliss' role is that of the somewhat from the ravages of the white man change from the larger picture houses<br />\nAddress<br />\nwith a more commercial atmosphere.<br />\nancient ruler of this territory who is and modernity.<br /><br />\nThe Barnstormers are probably in<br />\nneed of men: in addition to a busiOctober<br />\n1936<br />\n27,<br />\nTuesday,<br />\nness staff and production staff, which<br />\nincidentally will have about ten sets<br />\nco build, they have a cast of about 50<br />\nactors to fill. Every student who has<br />\nOpen season for politics and nefari- the least bit of talent in any of these<br />\nous political deals has now hit the ileitis should sign up at the Barn<br />\nimmediately. Once in a Lifetime is a<br />\ncampus. Senior Elections are on!<br />\nman's job----but when it's finished, it's<br />\nNo one can deny the truth, no<br />\nbeautiful to behold.<br />\nmatter how bitter it is. The Seniors,<br /><br />\nSeniors Elect--<br /><br />\nI RCLI N'<br /><br />\nINTERCOLLEGIATES<br /><br />\n5<br />\n,R<br /><br />\nI<br /><br />\nBallyhoo And Hooey<br /><br />\ncane, sugar beet, and pepper are<br />\namong those which comprise the semore<br />\nwith<br />\npeople<br />\nlection. For<br />\nsubstantial tastes wheat, barley, and<br />\nrye can be secured. And nut-s are found<br />\nin other places than you had known<br />\nright in this Garden.<br />\nFor dessert there is a variety of<br />\nfruits----pears, peaches, plums, pineapples, bananas, and apples.<br />\nAtter such a mixture you could even<br />\nobtain castor oil here--for the proper<br />\ningredients are in this veritable paradise.<br />\nf3esides, for you smokers there is<br />\ntobacco growing. If clothes make<br />\nthe man, then the flax, cotton, and<br />\nsilkseed here ought to mature many<br />\nof our students.<br />\nThe Thanksgiving Cotillion is not<br />\nfar off so were advising future corsage-senders to investigate the assorted flowers to be found in the<br />\nhothouse---it has orchids too!<br /><br />\nIn<br />\nFi<br />\nAl<br /><br />\nWhat's Your Guess?<br /><br />\nCIGAR PROGRESS BOARD<br />\nFootball Guessing Contest<br /><br />\nGeorge Arliss Portrays Wily<br />\nOriental At Little Theatre<br /><br />\nAIMI.1.1111•1MN.,<br /><br />\n3<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 27, 1936<br /><br />\nsince 450SeeThespian \"Tameness\" Of Dorm Freshmen<br />\nIllustrated By Activities<br />\nRally Thursday;<br />\nWith Electric Culbs, Cake Fights,<br />\npirit High Glass Fight Water<br />\nFights, Mark Tame<br />\nshe h<br /><br />\nVIEW<br />\nPress)<br /><br />\nbeing<br />\nt vicS<br /><br />\nself-co<br />\nhow st<br />\n, makir Fagin<br />\nre timE<br />\nlaw st<br />\n, expec<br />\nher WY<br />\nxt thil<br />\nits drii<br />\nate, sa;<br />\ne Cher<br />\nrilk fro<br /><br />\nAnd Desch Speak;<br />\nVets Present Skit; 1936<br />\nTryouts Held<br /><br />\nRehearsal Tonight<br />\nDesch Comments On Presence Of Promising<br />\nMaterial For Play<br />\nAbout one hundred and fifty students turned out for the annual Barn-<br /><br />\ne for<br />\nh.ibitio<br />\nstormer rally last Thursday night at<br />\nat Alm<br />\nthe Playshop. After welcoming the<br />\ncollei<br />\ngathering, Marty Levine, president of<br />\nclaine the organization, described the tradier 9<br /><br />\ntions and objectives of the Barnstormers. A short skit, entitled \"The Goat\"<br /><br />\nsen<br />\nwas then presented, following which<br />\nduat<br />\nLevine introduced Dr. N. Bryllion<br />\neir hi<br />\nFagin, director of the Playshop.<br />\nDr. Fagin expressed the desire that<br />\nrandsci the<br />\nfriendly relations between the<br />\nurer,<br />\nBarnstormers and the Playshop should<br />\ncontinue, and went on to explain the<br />\nrsity #<br />\ndifference between the two thespian<br />\nly the<br />\norganizations. \"The main purpose of<br />\nwallet<br />\nthe Barnstormers is to provide fun for<br />\no stat<br />\nthose who participate, and that is as<br />\nthe $ it<br />\nshould be,\" said Dr. Fagin, \"The<br />\nn poo<br />\nPlaysliop needs workers. Anyone who<br />\nlikes work connected with dramatics<br />\nudent Will<br />\nhave fun with us, in the sense that<br />\nia lae he<br />\nis working.\"<br />\n,872.0:<br />\nMr. John Desch, the Barnstormer's<br />\nin ti' new<br />\ncoach, was next introduced. He<br />\n1677<br />\nformally announced the selection of<br />\n\"Once in a Lifetime\" as the first Barnfingin1<br />\nstormer production of the season, and<br />\nrs, ae<br />\ninvited all those present to attend the<br />\nie uni<br />\nfirst tryouts at the Barn immediately<br />\nrgenc: after<br />\nthe rally.<br />\nLate in the evening Mr. Desch spoke<br />\nuntrie of<br />\nthe tryouts: \"They were very gratients 0<br />\nfying. Those present seemed as interested as though they were attending<br />\nthe premiere of some great play.<br />\nents<br />\nSome very fine acting material is in<br />\n3 Wit.111<br />\nevidence, and I don't expect much<br />\ntrouble in casting the play.\" \"Be asWOM<br />\nsured, however,\" continued Mr. Desch,<br />\nV's<br />\n\"That no part is definitely cast, and<br />\nwh<br />\nthose who have not tried out and who<br />\nwish to do so, may attend the next<br />\nrehearsal.\"<br />\n\"Once in a Lifetime\" is one of three<br />\nplays which Mr. Desch is now directess)<br />\ning. The others are: \"The Bishop Mise deal<br />\nbehaves,\" to be presented at Baltito civ<br />\nmore City College on November 6 and<br />\nAnio0 7; and<br />\n\"Invitation to a Murder,\" which<br />\nIs no<br />\nhe is directing for the Drama Guild.<br />\nLirs 6<br />\nThe next Barnstormer rehearsal<br />\nsir in<br />\nwill be held at the Barn tonight at<br />\ne ant eight-thirty.<br />\n)1d W<br />\nniver<br />\n6<br />\ny sug<br /><br />\nsigl<br />\nw<br /><br />\nman)<br />\n:e WI<br />\nhere<br />\nse<br />\nid be<br />\nwheri<br /><br />\nInterfrat Board<br />\nFines Delta Phi<br />\nAnd Kappa Alpha<br />\n(Continued from Page 1, Col. 6)<br />\nClarence Eldeskin, John Kibbee, John<br />\nHall, Robert Molloy, Herbert Armstrong, James Coady.<br />\nDelta Phi: Arthur Lankford, James<br />\nMoore, Richard Green, Ferdinand Pas.<br />\nsano, Donald Peck, Edward Thomas,<br />\nFrank Orrick, Carrington Williams,<br />\nHarvey Coulson.<br />\nKappa Sigma: Elmer Almquist,<br />\nHarry Brayshaw, Frank Butt, John<br />\nHerbst, Robert Hoopes, Milton Hutchcraft, Frank McGovern, James Norton, Charles Ritterhoff, Fred Six,<br />\nCharles Spoerer, Jack Stout, Charles<br />\nWiggins, Joseph Vavertnick.<br />\nPhi Kappa Psi: Berkeley Selmann,<br />\nJames Triplett, Robert Brown, Laurie<br />\nDickson, Robert Webster, Dean Short,<br />\nRichard Bradley, Harry Gosley, Fred<br />\nGreen.<br />\nAlpha Delta Phi: Andrew Young,<br />\nHugh O'Donovan, Edward Whitman.<br />\nKappa Alpha: Charles Allen, William<br />\nWhiteLock, Jefferson Hamilton, Frank<br />\nKohlhobb, John Halbig, William JanneY, Charles Rice, Roland St. Onge,<br />\nWilliam Wesson, Charles Kanady.<br />\nAlpha Chi Rho (formerly Omicron<br />\nKappa Omicron): Victor Ghent,<br />\nGeorge Thaler, George Dukas, Roscoe Insley, James Ahearn, Boyd Wylie,<br />\nEdwin Lowthion, Henry Leber.<br />\nDelta Upsilon: Turner Davis, John<br />\nGraham, Vincent Roach, Benjamin<br />\nCourtright, Thomas Dowers, Oscar<br />\nKerstetten, Robert Peck.<br />\nPhi Gamma Delta: Theodore Frui,<br />\nJames Winn, Seth Linthicum, Jesse<br />\nWilliams, William Kenney.<br />\nTau Alpha Phi: Thomas Brown,<br />\nThomas Schrieber, Howard Harr, Hubert Zeigler, Frank Taylor, Wilbur<br />\nSpicer, John Gray, John Lil.<br /><br />\nYear At Dorms<br />\nThat the freshman in the dorms<br />\nwere a \"tame bunch\" was the statement, published in the NEWS-LETTER,<br />\nof a self-professed \"veteran of many<br />\npranks.\" B entree, always the \"hot<br />\nspot\" of the dorms, evidently resents<br />\nthat remark Following is a record of<br />\ntheir accomplishments to date, and<br />\nwhether or not they are evidence of<br />\nthe \"tameness\" of the present freshmen may be decided upon by the<br />\nreader.<br />\nA glass fight in which electric fight<br />\nbulbs were used as missiles has been<br />\nheld. No serious injury was reported,<br />\nbut the caution money reserve of<br />\nsome has been greatly reduced.<br />\nA cake fight was held in which all<br />\nuneaten pastries sent by loving mothers to their \"tame\" sons were hurled<br />\nabout and splattered on the walls.<br />\nWater fights which have the effect<br />\nof making B entree one big puddle<br />\nare of ordinary occurance.<br />\nt<br />\nTwo crap games which lasted from<br />\napproximately ten in the evening until<br />\nsve the next morning were held. Practically all participants attended eightiiity classes the next morning.<br /><br />\nA stench bomb of such extraordinary strength that it made B entree<br />\npractically uninhabitable for three<br />\ndays was placed in a freshman's room<br />\nby a party who is, as yet, unkown.<br />\nOne man was rushed to the hospital for an emergency when his head<br />\nwas split open in a bit of innocent<br />\nhorseplay.<br />\nPing pong, a gentle parlor game,<br />\nwas transformed into a deathly serious struggle when one freshman lost<br />\n$150 in a series of games with<br />\nanother man. The loser of the ping<br />\npong match won back his money the<br />\nsame evening by staking another $150<br />\non one roll of the dace.<br />\nOne freshman was fed inethyline<br />\nblue along with a slice of blueberry<br />\npie. Methyline blue has a startling<br />\nbiological effect. The victimized B<br />\nentryite spent four hours in the library searching for information on<br />\nthe disease which he believed he had.<br />\nThat is the record of B entree, and,<br />\nas one B entryite put, it, \"Yeah, I<br />\nguess we have been pretty slow! But<br />\ngive us time to get settled; then we'll<br />\nbust this town wide open!\"<br /><br />\nUniversity Speaker EngineeringFaculty<br />\nDischarged At Yale Tell Of Early Days<br />\nConditions<br />\nAt<br />\nJerome Davis Asked To pescribe<br />\nHomewood Twenty<br />\nLeave After Twelve Years<br />\nYears Ago<br />\nTeaching<br />\nOf<br />\n(Continued from Page 1, Col. 3, 4)<br />\nDr. Jerome K. Davis, associate professor of practical philanthropy, Yale custom of the students, the members<br />\nof the faculty found it necessary to<br />\nDivinity School, and the next speaker<br />\nlock their cars, and have continued to<br />\nat the \"Y\" Supper Club at Hopkins, do so until this very day.<br />\nhas been asked to leave Yale UniversiThe Barn, present home of the<br />\nty at the end of this academic year, Barnstormers, now working there on<br />\nafter twelve years with that institu- their first play to be given this year,<br />\nwas then in reality a barn, with cows,<br />\ntion.<br />\nhorses, and all the other fixings, esDr. Davis, an outspoken critic of<br />\npecially a huge manure pile outside.<br />\nfinancial domination of education, has<br />\nDr. Christie recalled the days of<br />\ncharged that his dismissal from the<br />\nparticipation of the United States in<br />\nUniversity is a direct result of his adthe World War. The Hopkins campus,<br />\nherence to Liberal opinions.<br />\nwas then the seat of a training camp<br />\nHis ouster threatens to precipitate<br />\nwhich was run with all the military<br />\na bitter split throughout the univerregulations. It was necessary at that<br />\nsity, with the student council of the<br />\ntime to know the password in order<br />\nDivinity School already on record in<br />\nto be permitted to enter the camp.<br />\nProfessor Davis' behalf. The council<br />\nOne member of the faculty, ignorant<br />\nissued a statement charging that the<br />\nof the magic word, was put in the<br />\naction of the Yale corporation \"constiguardhouse for the night upon returnacademic<br />\nfreedom\".<br />\nmenace<br />\nto<br />\na<br />\ntutes<br />\ning to the campus. Although he was<br />\nSince he has been at Yale, Dr. Davis<br />\nreleased the next morning it was<br />\nhas been a leader of liberal thought,<br />\nfound rather difficult to soothe his<br />\nespecially among Sociological groups.<br />\nruffled feelings.<br />\nThe reason given for his dismissal<br />\nwas that lack of funds made retrenchment necessary, and that his teaching<br />\nwas not up to the Yale standard. It<br />\nis rumored, however, that his liberal<br />\nand semi-radical tendencies are partly<br />\nresponsible. It is also rumored that<br />\nDr. Charles A. Beard, leading historian and sociologist in this country, :Tudor And Stuart To Hear<br />\nis heading a committee which plans<br />\nDr. Hudson On Life<br />\nto make a thorough investigation of<br />\nOf Sidney<br />\nthe entire affair.<br />\nBefore coming to Yale in 1924, Dr.<br />\n(Continued from Page 1, Col. 3)<br />\nDavis, who received his Ph.D. at Col14 are undergraduates. There is thus<br />\numbia in 1922 and who also graduated<br />\nfrom the Union Theological Seminary, an opening for two new undergradwas secretary to Dr. Wilfred Gren- uate members. President of the Tudor<br />\nfell, director of the Grenfell Mission at and Stuart club is at present Dr. WarLabrador. He came to Yale from Dart- field T. Longcope, Physician_in-chief<br />\nmouth College, where he held the po- at the Johns Hopkins Hospital, who<br />\nsition of Assistant professor. At Yale<br />\nwas elected to this post last May.<br />\nhe held the Gilbert L. Stark chair of<br />\nThe Tudor and Stuart Club of the<br />\npractical philanthropy.<br />\nDuring the summers of 1926, 1927, Johns Hopkins University was found,<br />\nand 1932, he traveled in Russia, inves- ed in 1918 by an endowment of Sir<br />\ntigating conditions there. From 1931- William and Lady Osier for the pur1935, he was Chairman of the Connecpose of forming a literary club as a<br />\nticut Committee on Jails, and in 1933,<br />\nhe was Chairman of the Connecticut memorial to their son who fell in the<br />\nWorld War and as a gift to the UniCommittee on News Constitution.<br />\nHe is co-author with Harry Elmer versity. The club room and library in<br />\nBarnes of Readings in Sociology and Gilman Hall were fitted up by Mrs.<br />\nauthor of The Russian Immigrant,<br />\nRobert Brewster, a friend of Dr. Osier.<br />\nLabor Speaks for Itself in Religion,<br />\nThe New Russia, and several other The club now meets on an average of<br /><br />\nPrinceton Scholar<br />\nTo Speak Here<br /><br />\nLetters To The<br />\nEditor<br /><br />\n:-: BOOK REVIEWS :-:<br /><br />\nFar Forest by Francis Brett<br />\nYoung. $2.50.<br />\nStudents'<br />\nObjects<br />\nTo<br />\nCorrespondent<br />\nA<br />\nFar Forest is set in that part of<br />\nDisregard Of The \"Principles<br />\nmiddle England which is near WorOf Honesty.\"<br />\ncestershire and is watered by the<br />\nTo the Editor of THE NEWS-LETTER: river Severn, the country which Brett<br />\nDear Sir:<br />\nYoung knows and depicts so well.<br />\nA very disheartening experience has<br />\nAt 14, Jenny Hadley was shipped to<br />\nbefallen me. On Monday, October 19, I<br />\nWerewood,<br />\na tangled, beautifully<br />\nparked a car within one of the allotted<br />\nparking spaces in an authorized park- wooded part of the countryside, after<br />\ning area on the campus. During my her mother's casual desertion of the<br />\nabsence from the car it became dam- family,<br />\nwhere Jenny meets and comes<br />\naged. From the nature of the damage<br />\nto worship her older cousin David<br />\nit appears that it was caused by inexpert or inept maneuvering of another Wilden. When David seems to have<br />\ncar into or from a neighboring parking space. I am willing to admit Clot<br />\nthe infliction of damage probably was<br />\naccidental, but I submit that the fail_<br />\nure of the driver of the car causing<br />\nthe damage to make himself known<br />\nor to offer apologies or reparation is<br />\nmost disappointing. A card or note<br />\nleft attached to the damaged car<br />\nwould have sufficed.<br />\nHad I parked in an area frequented<br />\nby persons of low moral stamina I<br />\nshould have expected such an occurrence. At the Johns Hopkins University such a happening is unthinkable,<br />\nyet it actually took place. Having observed the satisfactory working of our<br />\nHonor System among our students,<br />\nI was shocked by this example of<br />\napparently dishonorable behavior. I<br />\nhope that it was a visitor to the Hopkins and not a regular member of our<br />\nUniversity who undermined my concept of the prevailing standard of<br />\nhonor.<br />\nMy object in writing this is to call<br />\nattention to a manner in which disregard for principles of honesty in<br />\neveryday affairs may work to tarnish<br />\nthe cherished product of years of<br />\nupright conduct by a vast majority of<br />\nuniversity people.<br />\nSincerely,<br />\nP. M. Reeve<br /><br />\nIn Re: 'Sciara'<br />\n.L.'4) the Editor Of THE NEWS-LETTER:<br />\nSir<br />\nI would like to take this opportunity<br />\nto clear up a few points which may<br />\nhave arisen from my article about<br />\nSciara, appearing in last Tuesday's<br />\nNEWS-LETTER.<br />\nBy stating that Sciara disobeyed the<br />\nMendelian Laws, I did not mean to<br />\nimply that Sciara disproved these<br />\nlaws of inheritance. The fundamental<br />\ninheritance mechanism (i e., chromosomes and genes) responsible for<br />\nMendelian heredity in organisms in<br />\ngeneral, is present in Sciara. It is the<br />\noperation and segregation of these<br />\nchromosomes which is different, and<br />\nthe ratios of inherited factors are<br />\ntherefore different. It is the fact that<br />\nSciara has that typical fundamental<br />\nhereditary system and yet the system<br />\noperates in a manner so different from<br />\nthat in the ordinary organism, which<br />\nmakes it especially important for research. By studying these differences<br />\nand abnormal actions, additional light<br />\nis thrown on the nature of the fundamental mechanism responsible for<br />\nMendelian inheritance.<br />\nMorris A. Wessel<br />\nTo the Editor of the NEWS-LETTEa,<br />\nDear Sir:<br />\nI wish to aid in the clarification of<br />\na lot of palaver concerning the machinations of certain dark, bloody bodies<br />\nknown as fraternities, and their relation to so-called class politics. The<br />\ncharge has been that fraternities have<br />\nmanaged the affairs of the Senior<br />\nclass long enough. The originators of<br />\nthe charge have therefore organized<br />\namong themselves, and by the simple<br />\nprocess of dealing in votes and securing backings, even of certain fraternities, at a cost, are now ready to<br />\npush their candidate over next Friday<br />\nwith a huge boughten majority.<br />\nThese persons are those who for<br />\nfour years have had no interest in the<br />\nclass at all, and have left it entirely<br />\nto fraternity men to manage their<br />\naffairs. Now they suddenly become<br /><br />\nforgotten her, and she has an idyllic<br />\nfour-day love affair with handsome<br />\nCharlie Potter, who goes to the African war leaving her with a child and<br />\nalone, she is cast out completely to<br />\nfend for herself and her child.<br />\nBrett Young tells her story with<br />\ncompetence and a flowing and often<br />\nbeautiful style. The part of England<br />\nthat he loves comes through the pages<br />\nwith its bleak harshness, or, and more<br />\noften, with its haunting, changing<br />\nbeauty, rather like a quiet rural idyll.<br />\nThose who know Brett Young through<br />\nThe Dark Tower, The Red Lakes, and<br />\nhis other works, will not be disappointed in Far Forest.<br />\nThree Worlds. By Carl Van<br />\nDoren. $3.00.<br />\nHere we have the process whereby<br />\na village-bred lad in Illinois became<br />\nin succession a teacher, a journalist<br />\nand a writer-editor, shining splendidly<br />\nIn each. But this book is more than the<br />\nstory of Carl Van Doren's boyh000d,<br />\nyouth, and manhood; it is the three<br />\nworlds, the Pre-War World of America's happy isolation from the turmoils of Europe, the Post-War exhilaration of horrors lived through or<br />\nescaped, and the sobering years of<br />\nthe Depression. It is the story not only<br />\nof himself but of his family, of his<br />\nfather who placed faith in the fertile<br />\nsoil of Illinois and bought more and<br />\nmore of it on credit, never dreaming<br />\nthat the rise of land values would<br />\nterminate and collapse, of his poet<br />\nbrother, Mark, and of his own precocious and talented children.<br />\nThere is no man known to this relower who has Carl Van Doren's capacity to inspire one with faith in<br />\nself and in that confidence which<br />\nmakes one feel that one's own work<br />\nis important. Two geniuses, among so<br />\nmany of lesser talent, looked to Carl<br />\nVan Doren for encouragement and<br />\nunderstanding--ElinorWylie and Sinclair Lewis—and he gave them. both<br />\nso much that it is touching to read<br />\nof their reliance upon him in the letters to him embodied in these miemoirs.<br />\nHis autobiography has something of<br />\nthe temper of the greatest of all autobiographies—that series of disconnected memoirs set down by Montaigne, wherein that great spirit dared<br />\nto be honest and candid with himself.<br />\nconscious of their inferiority in the<br />\nmatter and decide to throw out, by<br />\nmethods they have condemned, those<br />\nwho are experienced and who, in view<br />\nof previous service, deserve to run the<br />\nelEiss this next year.<br />\nA 4th Year Onlooker<br /><br />\nWhiteoak Forest. By Maza de la<br />\nRoche. $2.50.<br />\nEveryone who has known the<br />\nWhiteoak clan through the earlier<br />\nJalna books will certainly want to<br />\nread the lively chronicle of their latest doings. But even for a reader<br />\nhitherto unacquainted with this magnificent family, Whiteoak Harvest is<br />\na rich and lusty tale, complete in itself. All Jalna fans will find this book<br />\nas satisfactory as any—indeed, it is<br />\nvery nearly the best of the lot.<br />\nMa.zo de la Roche handles her many<br />\ncharacters and their multiple activities so skillfully that each retains his<br />\nown strongly individual characteristics. There is the story of Finch and<br />\niiis too-possessive wife, there is Uncle<br />\nErnest's belated love affair, there are<br />\nClara Lebraux and her daughter,<br />\neiaketield with his amazing self-importance which he takes into a monastery, and the mortgage which hangs<br />\nover them all—plenty of dramatic material. All these are really surplots,<br />\nhowever, less important than the<br />\ncrisis in the life of Jalna's master,<br />\nRonny Whiteoak. Remy is one of the<br />\nmost compelling and attractive figures in recent fiction. Most women<br />\nwill not understand how his coldly<br />\nself-centered wife Alayne could possibly leave him, though to be sure she<br />\n,had a good reason. Their differences<br />\nare satisfactorily settled in the final<br />\nchapters, but let us hope this won't<br />\nmean the end of the Jalna book. No,<br />\nas long as there is a Whiteoak left<br />\nalive there will be exciting and important things going on at Jalna.<br />\nGod in a Rolls-Royce. By John<br />\nHoshor. $2.60.<br />\nHere is the whole colorful and extraordinary story of Father Divine,<br />\nthe Negro Messiah whose cult in New<br />\nYork City embraces a growing number of Negro—as well as white—disciples. The account of his rise from<br />\nobscure and nebulous Georgia beginnings to What, in the eyes of his<br />\nflock, amounts to godhead; of the<br />\nformulation of his creed; of his stormy<br />\npassages with the law and his mysterious financial operations, is an<br />\namazing human document, at once<br />\nhumorous, fantastic, and tragic.<br />\nE. P. Dutton and Company recently published a new one dollar edition of A. A. Milne's Red House Mystery.<br />\nThe Red House Mystery has been<br />\nacclaimed by critics as one of the finest, most fascinating mystery stories<br />\nof all time. That verdict is still held<br />\nby mystery connoisseurs.<br />\nAntony Gillingham, humorous and<br />\nastute observer of life, arrives at the<br />\nmanor house of a quiet uneventful<br />\nEnglish village just as the fatal shot<br />\nis fired and thus finds himself involved<br />\nin a mystery that requires all his ingenuity to solve.<br />\nWhat makes Mr. Milne's first excursion into the field of murder an unusual book is its conclusion and denouement which will certainly prove<br />\nto be a surprise to even the most experienced detective story reader.<br /><br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br /><br />\nHOCHSCHILD, KOHN Elk Co.<br /><br />\nbooks along similar lines. He is one once every three weeks.<br />\nof the editors ofThe Journal of Social<br />\nForces, and an editorial contributor<br />\nInternational Group<br />\nof The Christian Science Monitor.<br /><br />\nTo<br />\nHold First Meeting<br /><br />\nFagin Asks Dramatists To<br />\nSubmit New Plays<br /><br />\nfieroftedrit<br /><br />\nThe International Relations Group<br />\nwill hold its organization meeting for<br />\nthis year in Remsen Hall, Room 1,<br /><br />\nIn an announcement made yesterday, Dr. N. Bryllion Fagin, director<br />\nof the Playshop, asked that all Hopkins students interested in pla,3rwriting should hand in to him as soon as<br />\npossible one of their own original<br />\nworks.<br />\nEach year in April the Playshop<br />\npresents one original drama. As very<br />\nfew entries have been received thus<br />\nfar, anyone is welcome to try.<br /><br />\nThursday at 11.30 a.m., announced<br />\nEdward Suarez-Murias, president.<br />\nThis group, organized last year under the direction of Dr. Frederick<br />\nLane of the History Department, discussed important international events<br />\nof the year. At the last meeting, Dr.<br />\nLane and Dr. Leon Sachs spoke.<br />\nMembership in this group is open<br />\nto all interested students.<br /><br />\nT Is•<br />\nhoney In<br />\nthe briar<br />\nkeeps the pips<br />\nsweet.<br />\nlik.High-•fficiency<br />\nCondenser cleans,purifies<br />\nsmoke.Traps moisture. NoclogOng.No trouble.Prove it you raisin<br /><br />\nAt Your Dealers<br /><br />\nimportant shirts in a<br />\ncollege man's wardrobe<br /><br />\n2.50<br />\nThese new \"Tweedline\" Manhattan shirts are being worn by<br />\nCollege men throughout the country.<br />\nDuke of Kent in design, (with button down collars), they come<br />\nin blue, green, tan, rose, and gray with contrasting chalk stripes.<br />\nSizes 14 to 17.<br />\nMEN'S SHOP, FIRST FLOOR<br /><br />\n4<br /><br />\nHOMEWOOD, BALTIMORE,<br /><br />\nSpirited Play<br />\nFeatures Touch<br />\nFootball Games<br />\nWell Organized Program Of<br />\nGrid Games Runs Along<br />\nSmoothly<br /><br />\nMany Close Contests<br />\nCardiacs, Sr. Gas Civils, N.J.<br />\nAll-Stars, Seven J's<br />\nRecord Victories<br />\nThe first two weeks of intramural<br />\ntouch football were marked by five<br />\nsnappy games and one massacre of the<br />\nrespective class teams. Play is now<br />\nrapidly getting better organized and<br />\ngoing off much more smoothly. The<br />\nsecond week of play saw only one<br />\nforfeit, that on the part of the Drizzle<br />\nPuss Hotshots to the New Jersey AllStars on Friday, October 26th.<br />\nAll-Stars Win<br />\nThe New Jersey All-Stars slaughtered the Trojans in what was probably the most scientific playing yet<br />\nexhibited in the league, on Friday,<br />\nOctober 16th. The All-Stars unleashed<br />\nan aerial attack in the form of a<br />\nbarrage of passes which left their opponents bewildered. A surprising number connected. Wall's interception<br />\nof the Trojans' passes and excellent<br />\nsprinting for touchdowns had no little<br />\nto do with leaving the opposition in<br />\na fog. High scorers for the New Jersey septet were Wall and Margolis<br />\nwith three touchdowns apiece, and<br />\nRubinger a close second with two.<br />\nThe Trojans scored their lone two<br />\npoints on a safety, bringing the final<br />\nscore to 48-2, with the Stars on the<br />\nlong end.<br /><br />\nINTERFRAT<br />\nS. P. E<br />\nPhi PEA '<br />\nT. A. Phi<br />\nKappa Sig<br /><br />\nWon<br />\n5<br />\n5<br />\n2<br />\n0<br /><br />\nLost<br />\n1<br />\n1<br />\n4<br />\n6<br /><br />\nTied<br />\n0<br />\n0<br />\n0<br />\n0<br /><br />\nSoccer Team Defeats Terps<br />\nOn Tally In Closing Minutes<br />\nThe Blue Jay Soccer team defeated<br />\nthe University of Maryland team 2-1,<br />\nat Homewood Saturday by a fastscoring play in the last few minutes<br />\nif the closing period.<br /><br />\nThe Cardiacs crushed the Meteors<br />\n18-6 on October 14. Stevens and Bishop<br />\nran up the score between them to<br />\n18, Enders making the six. The Sr.<br />\nGas Civils likewise beat the Tigers<br />\n30-0 on the 14th. Wisema.n, Diver,<br />\nReinaldi, and Grave scored.<br /><br />\nbacks Clisham and Bernheim who<br />\nboth turned in excellent performances.<br /><br />\nSport Schedule<br />\nINTERCOLLEGIATE<br />\nFootball—Johns Hopkins vs. Randolph - Macon,<br />\nSaturday,<br />\nat<br />\nHomewood.<br />\nSoccer--Johns Hopkins vs. State<br />\nTeachers, Tuesday, at Towson.<br />\nCross-Cotmtry—Johns Hopkins vs.<br />\n'Swarthmore,<br />\nSaturday,<br />\nat<br />\nSwarthmore.<br />\nTuesday—Pi Lamibda Phi vs. Tau<br />\nAlpha Omega; Alpha Epsilon Pi<br />\nvs. Tau Alpha Phi.<br />\nWednesday--Delta Phi vs. Beta<br />\nPhi Psi.<br />\nTheta Pi; Sigma Phi Epsilon vs.<br />\nThursday —Phi Sigma Delta vs.<br />\nPhi Epsilon vs. Phi Psi.<br />\nThursday—Phi Sigma Delta vs. Phi<br />\nEpsilon Pi; Phi Alpha vs. Kappa<br />\nAlpha.<br /><br />\nThe final whistle closed the game<br />\nwith the Collegk Parkens frustated<br />\nefforts to score leaving the Hopkins<br />\nPhi Sigs<br />\nThe Terrapins opened the attack in booters with their second successive<br />\nAlpha Dens<br />\nthe first period of the game with a victory of the season.<br />\nA. T. O.<br />\nseries of passes which yielded the ColPhi Alpha ...<br />\nHartke Stars<br />\nlege Parkers a tally when Morris,<br />\nThe honors of the game go to<br />\nplaying outside right, dented the HopP. Lam<br />\nHartke, playing center half for the<br />\nkins net on a direct corner kick.<br />\nD. U.<br />\nJays and to Yeager who held down the<br />\nThe Jays returned in the second right half position for the University<br />\nT A. O. .....<br />\nperiod playing harder than ever and Maryland booters. Both men, receivPhi Gams<br />\nseveral times came within scoring ed laudible comments for their excelposition of the visitors net. Linthi- lent performances.<br />\nO. K. O. . .<br />\ncum substitute at inside right for<br />\nBeta<br />\nThe line up:<br />\nHahn, drove in a beautiful boot for<br />\nK. A.<br />\nHopkins<br />\nU. of Maryland<br />\nthe tying tally as the second period<br />\nPhi Eps<br />\nHartman<br />\nLowitz<br />\nG.<br />\nFriday-Kappa Sigma vs. Delta<br />\ncame to a close. This kick covering<br />\nCltsham<br />\nF<br />\nL<br />\nScharf<br />\nUpsilon; Omicron Delta Omicron<br />\nevery bit of twenty yards proved to<br />\nBernheim<br />\nCorbin<br />\nRF<br />\nvs. Alpha Delta Phi.<br />\nbe the most spectacular boot of the<br />\nPhillips<br />\nL.H<br />\nSpringer<br />\ngame.<br />\nGough<br />\nR<br />\nH<br />\nYaeger<br />\nTargia Scores<br />\nHartke<br />\nC.H.<br />\nHobbs<br />\nTargin got the ball from a scrimMace<br />\n0L<br />\nArcher<br />\nmage in the goal mouth and taking<br />\nPrice<br />\n.0 R<br />\nMorris<br />\nA good sized turnout characterized a first-time shot whipped the bail into<br />\nTargin<br />\n1.14<br />\nNezbed:<br />\nthe fall lacrosse practice sessions held the net putting the Jays in a one<br />\nHahn<br />\nI.<br />\nR<br />\n.<br />\nHomewood field last Saturday was<br />\nBrokamp<br />\nlast week under the guidance of point lead.<br />\nBriggs<br />\nas much like a three ring circus as<br />\nStracham<br />\nCF<br />\nThe Terrapins then attacked strongCoach Kelso Morrill in preparation<br />\nSubstitutes for Hopkins: Linthi- anything could be, what with a crossly, getting three corners in quick<br />\nfor the Spring season. The men repsuccession, but all were cleared well cum, Bradshaw, Whitelock, and Kep- country meet, a soccer game, and a<br />\nfootball game going on all at once!<br />\nresenting last year's varsity, bolster- by Hartman with the aid of full- hart.<br />\n* • *<br />\ned by a group of hopeful freshman,<br />\nWon Lost Tied<br />\n6<br />\n0<br />\n0<br />\n4<br />\n2<br />\n0<br />\n1<br />\n4<br />\n1<br />\n5<br />\n1<br />\n0<br />\nWon Lost Tied<br />\n5<br />\n0<br />\n1<br />\n2<br />\n1<br />\n3<br />\n1<br />\n4<br />\n1<br />\n1<br />\n4<br />\n1<br />\nWon Lost Tied<br />\n4<br />\no<br />\n2<br />\n3<br />\n1<br />\n2<br />\n3<br />\n3<br />\n0<br />\n0<br />\n6<br />\n0<br /><br />\nLacrossemen Hold<br />\nPractice Sessions<br /><br />\nare progressing rapidly.<br />\nCoach Morrill ran the squad<br />\nthrough a gruelling half hour of<br />\nscrimage in the new box lacrosse<br />\ncage on the lower field after warming them up with a vigorous work-out<br />\nagainst the wall. Those members of<br />\nlast year's varsity squad engaging<br />\nin the tuning-up activities were -Naylor, Girrgher, Melvin, Wrenshaw,<br />\nHines, Katz, Gu.sack, Rosenthal, and<br />\nmany promising freshman among<br />\nwhom were Triplett, Enders and<br />\nBrown.<br /><br />\nSidelines<br /><br />\nPopow was in the Haverford backfled almost as much as the loser's own<br />\nbacks. It looked as though the visitors were rather annoyed at his acThe results of the Saturday's games tions. Nice going, Popow.<br />\n* * *<br />\nproVed quite disastrous to the future<br />\nThe Scarlet and Black invaders<br />\nopponents of the Blue Jay eleven.<br />\nOnly St. Johns escaped the same cate- gained more ground by virtue of pengory which faced Randolph-Macon, alties than by their own plays.<br />\n• * *<br />\nSwarthmore, and American U., by not<br />\n'being scheduled to play.<br />\nBaetjer's place kicking is a thing<br />\nDelaware<br />\n19 Ran.-Macon<br />\n6 of beauty and pleasure to watch, proDickinson<br />\n55 Swarthmore .... 0 vided, of course, you're a Hopkins<br />\nCoast Guard ..14 American U<br />\n7 fan.<br /><br />\nFuture Grid Opponents<br />\nHandball Entry Deadline<br />\nFare Badly Over Weekend<br />\nScheduled For October 26<br />\nApplications for entrance into the<br />\nfall handball tournament will not be<br />\naccepted after October 28, 1936. Men<br />\nwho have not as yet applied may do<br />\nso by dropping a note into P.O. Box<br />\n333. Informal handball practice takes<br />\nplace in the gym every Monday from<br />\n4 P.M. to 6 P.M.<br /><br />\nIn their first encounter of the season, the JOhns Hopkins cross-country<br />\nsquad was swamped by a strong Lehigh aggregation. The visitors had<br />\nfour of their men in a tie for first<br />\nplace to triump by a 19-36 count.<br />\nCapt. Sholtes of Hopkins got away<br />\nfast and held the lead for the first<br />\nmile but then the Lehigh quartet<br />\nforged to the front and were never<br />\nheaded thereafter. Hildebrandt, Hurst,<br />\nTompkins, and Sigley, the visitor's<br />\naces, broke the tape hand in hand,<br />\nrunning well within their best efforta. The winning time of 21 minutes, 43 seconds, was still faster than<br />\nthe beat performance ever made by a<br />\nJay representative.<br />\nBehind Sholtes in fifth place were<br />\nBrown, Driscoll, and Lyman, all of<br />\n'Hopkins, finishing in that order.<br />\nScharpf, Warminsky, and Johnson<br />\nwere the other Hopkins varsity men<br />\nto finish.<br />\nAlthough the ability of the Maroon<br />\nmen overshadowed the Black and<br />\nBlue's performance, it is still true that<br />\nCoach Hambleton had a well-balanced<br />\nsquad in action. Their times compare<br />\nfavorably with those made by Hopkins<br />\nin top shape and with several weeks<br />\nmore of conditioning, the Blue Jays<br />\nwill present a formidable outfit.<br /><br />\nrLight Smoke!<br /><br />\nFEATURE<br />\nA GREATprotection!<br />\n—throat<br />\nyourself hoarse —<br />\nYou can yell<br />\nhoarse I<br />\nsmoke yourself<br />\nwon't<br />\nyou<br />\nsmoke, are<br />\nlie<br />\na<br />\nFor Luckies,<br />\nyour guard<br />\n\"Toasted.\" This is<br />\nSo reach<br />\nirritation.<br />\nagainst throat<br />\nlie smoke!<br />\na<br />\n.<br />\n.<br />\nLucky<br />\nfor a<br /><br />\nfs a<br /><br />\nYour Throat Kept<br /><br />\nClear for Action!<br />\nSmoke round after round of Luckies, and<br />\nyour throat keeps clear, your voice keeps<br />\nclear. For Luckies are a light smoke! It is<br />\nonly Luckies that give your throat the protection offered by \"Toasting.\" So make<br />\nyour choice a light smoke and then smoke<br />\nround after round and they'll still taste<br />\ngood — your mouth will taste clean. For<br />\nLuckies are a light smoke — made from<br />\nchoice center leaves... the top price leaves<br />\n... of the \"Cream of the Crop\" tobaccos!<br />\n* *<br /><br />\nHaverford<br />\n...... Carroll<br />\nWilliams<br />\nReagan<br />\nRamsey<br />\nChilds<br />\nBalderston<br />\nMorian<br />\nBeeler<br />\nPrescott<br />\nDerr<br />\nAmbler<br /><br />\n0 2 0 0- 2<br />\nHaverford<br />\n7 3 0 0-10<br />\nHopkins<br />\nScoring — Johns Hopkins, touchdown, Graziano. Extra point, Baetjer,<br />\nplacement, with Kahl holding the ball.<br />\nField goal, Baetjer, Haverford—<br />\nSafety. Substitutions—Hopkins Bradford, Brown, Buck, Davies, Traggis,<br />\nL. Willer', Zavertnik, Green Kilbourne<br />\nMehling, Rickard, Rostov, Rudo,<br />\nKerstette. Haverford: Beausset, Balderston, Slaase, Watkins, Jackson,<br />\nHolzer, Taylor, Greenwood. Referee—<br />\nPaul Wilkinson. Umpire- - Jack Ogden. Head linesman----Harrry Goddard.<br />\nAgain Kahl and Graziano collaborated<br />\nin running the ball to the enemy<br />\n1-yard line. From here Graziano<br />\nplunged over for the first score and<br />\nBaetjer converted.<br /><br />\nCaptain Sholtes, Brown,<br />\nDriscoll, Lyman Score<br />\nFor Hopkins<br /><br />\negi<br /><br />\nKahl and Graziano were the stars<br />\nof the victorious team's backfield.<br />\nPopow, Hopkins, Mehling, and Day<br />\nwere the bolsterers of the line. Of<br />\ncourse, Baetjer's toe was a very powerful weapon, but it did not overshadow his defensive play. Vickers,<br />\ntoo comes in for a bit of praise.<br />\nThe line-up:<br /><br />\nL.T.<br />\nL.G<br />\nC.<br />\nR.G<br />\nR.T<br />\nR.E<br />\nQ.B.<br />\nL.H<br />\nRH<br />\nF.B<br /><br />\nFour Brown And White<br />\nHarriers Cross Line<br />\nIn Deadlock<br /><br />\nVis<br />\nBa<br /><br />\nBc<br />\nJay<br /><br />\nTI<br />\nwill<br />\nafter<br />\nrepr<br />\nUSU<br /><br />\nlist<br />\nothe<br />\nJohn<br />\nover<br />\nfron<br />\nTiwill<br />\nof t<br /><br />\ntwee<br />\non<br />\nkins<br />\npros<br /><br />\n(Cont. from page 1, col. 5)<br />\nbattle, and the game ended without<br />\nfurther scoring; but not before the<br />\nBlue reserves had threatened to score.<br /><br />\nBaetjer<br />\nPopow<br />\nDay<br />\nRoyster<br />\nHopkins<br />\nEllis<br />\nVickers<br />\nGraziano<br />\nWard<br />\nKahl<br />\nVincenti<br /><br />\nV()<br /><br />\nCon<br /><br />\nHopkins Shows<br />\nPower In Win<br />\nOver Haverford<br /><br />\nHopkins<br /><br />\nHill And Dalers<br />\nDrop First Meet<br />\nTo Lehigh Team<br /><br />\n•<br /><br />\nSeven J's Split<br />\nThe Seven J's likewise left the Civil<br />\njuniors rather badly battered after<br />\na shellacking to the merry tune of<br />\n42-6, on October 13. Beeler, Chesley,<br />\nSnodgrass, and Bowersox tallied for<br />\nthe J's, while Pecora of the Juniors<br />\nmade their lone touchdown. In their<br />\nnext contest on the 20th, however, the<br />\nJ's were held to a scoreless tie by the<br />\nSoph Engineers. These same Soph<br />\nEngineers had, on the 13th, lost to the<br />\nVictors, 18-0, Dukhart and Hughes<br />\nrunning up the score.<br /><br />\nOCTOBER 27, 1936<br /><br />\nNEWS RASH! * *<br /><br />\nBuo.<br />\nlow<br /><br />\nbeii<br /><br />\ncleat<br /><br />\nRai<br />\nro un<br />\nPain<br /><br />\nfullb<br />\nthe r<br /><br />\nWah<br />\npass<br />\nbadh<br />\nthe :<br />\nWel(<br />\nawal<br />\nsee<br />\nSalt<br />\nrads<br />\nbeen<br />\nthe<br />\nT1<br />\nDan<br />\nBoo]<br />\n195<br />\nis u<br />\nocca<br />\nto t<br />\npunt<br />\n200<br />\ninto<br />\nprot<br />\nHe]<br />\nishir<br />\nwho<br />\nthro<br />\nfens<br />\nvete<br />\nget<br />\nT1<br />\naver<br /><br />\n25 Winners in One Week<br />\nForget to Sign Their Names<br /><br />\n(1944,7„,<br />\n‘<br />\n21<br />\n/<br />\n41<br /><br />\nMany people,in their hurry to mail<br />\nin their entries in Your Lucky Strike<br />\n\"Sweepstakes,\" have forgotten to<br />\nsign their names.In one week alone<br />\n25 winners did not receive their<br />\nprizes because we didn't know to<br />\nwhom to send them.<br />\nHave you entered yet? Have you<br />\nwon your delicious Lucky Strikes?<br />\nThere's music on the air. Tune in<br />\n\"Your Hit Parade\"--Wednesday<br />\nand Saturday evenings.Listen,judge<br />\nand compare the tunes -then try<br />\nYour Lucky Strike \"Sweepstakes.\"<br />\nAnd don't forget to sign your name.<br />\nAnd if you're not already smoking<br />\nLuckies, buy a pack today. Maybe<br />\nyou've been missing something.<br /><br />\nbe t<br />\narm(<br /><br />\nAUS<br /><br />\nPut<br />\nby<br />\ntria<br />\ncoo/<br />\nthe<br />\nthe<br />\nof t<br />\ning<br /><br />\nishil<br />\nthat<br />\nand<br />\ngrer<br /><br />\ntern<br />\nis<br />\nse<br /><br />\nOF RICH, RIPE-BODIED<br />\n9<br />\nf<br />\nTOBACCO<br />\n— \"IT'S TOASTED\"<br />\nCopyright 1906, The Arneriran Totnamo Company<br /><br />\nthe<br />\nann<br />\nthis<br /><br />"}], "field_media_file": [{"target_id": 39042, "display": null, "description": null, "target_type": "file", "target_uuid": "4540be83-298a-4600-bd1d-b0791d1f3aa1", "url": "http://digital.library.jhu.edu/system/files/2022-03/12718-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12718, "target_type": "node", "target_uuid": "232e1bd3-e211-47ec-9e36-2baaa44b70a9", "url": "/node/12718"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "fef9fd8a-9d59-4a06-82c6-f90773565c2d"}]}