{"mid": [{"value": 36933}], "uuid": [{"value": "ab67a1bf-ffc4-44a3-975f-c929451d052d"}], "vid": [{"value": 36933}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:56:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13155-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:56:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:56:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVIII, No 29<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., JANUARY 25, 1924<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nVARSITY TO ENTER RELAY DIVERSITY IN SELECTION OF RIFLE TEAM WINS SECOND MUSICAL<br />\nCLUB WILL PRE- HOPKINS<br />\nSWIMMERS<br />\nTO<br />\nTEAM IN.THE MILROSE<br />\nPOSITIONS BY 1923 ENPLACE AT E. I. R. A.<br />\nSENT CONCERT AT FREDMEET BROWN AT PROVIINDOOR GAMES<br />\nGINEERING GRADS<br />\nMEET AT NEW YORK<br />\nERICK ON FEB. 16<br />\nDENCE TOMORROW NIGHT<br />\n<br />\nBooth, Norwood, Dorcus and Clarke General Electric Company Gives Jobs to Six Shooters Make Trip.<br />\nM. I. T. Entire Club Will Perform at Winches- Eight Men to Make the Trip. Hopkins<br />\nProbably Will Represent UniSeven Men. Only One Man in<br />\nTakes First Place<br />\nter Hall. Publicity Board to Help<br />\nHopes for a Victory. Brown Has<br />\nversity at Meet<br />\nTeachers' Field<br />\nWith Advertising<br />\nStrong Aggregation<br />\nLater reports from New<br />\n<br />\nJohns Hopkins has been invited<br />\nto send a medley relay team to the<br />\nMilrose games in New York City,<br />\nJanuary 30. The relay race will be<br />\none of the feature events of the<br />\nnight. Syracuse has already signified their intention to send a team<br />\nto compete, and Georgetown is considering the trip. Other well-known<br />\nuniversities may enter, but the race<br />\nwill be limited to a comparatively<br />\nsmall number of participants.<br />\n<br />\nAlthough the men who obtained<br />\nOn Saturday, February 16th,<br />\nWhen Hopkins meets Brown<br />\nYork City indicate that<br />\nGeorge Washington won the<br />\ntheir Bachelor of Engineering dethe Musical Club will present a con- University at Providence on Satmatch, with a score of 1867,<br />\ngree from the Johns Hopkins Encert at Winchester Hall, Frederick. urday, January 26, it will oppose<br />\nand Columbia came second.<br />\ngineering School last June comA complete tabulation has<br />\nThis concert will be the first Hop- one of the foremost swimming<br />\nnot been made, but with<br />\nposed a relatively small group,<br />\nkins undergraduate affair held for teams in the East. Brown, this<br />\nthese scores Hopkins takes<br />\nnumbering less than 40, their diyear, aspires for the intercollegiate<br />\nmany years in Frederick.<br />\nfourth place.<br />\nversity in selection of positions for<br />\nEarly in the fall many attempts crown, and likewise, has an exceltheir future work is as great as if<br />\nJohns Hopkins' rifle team car- were made to obtain a guarantee lent opportunity of obtaining it.<br />\nried off second place in the first for a concert in Frederick<br />\ntheir numbers, were far larger.<br />\nthrough :The boys from Providence have<br />\ndivision<br />\nof the shoot at New York Hood<br />\nNot all the graduates, however,<br />\nCollege and the public been successful in all of their dual<br />\nwho were given their diplomas at City last Saturday in the Eastern schools as a benefit for their<br />\nSends Championship Team<br />\nathlet- meets so far this year.<br />\nIntercollegiate Rifle Association<br />\nThe Hopkins Medley Team won the last commencement as yet<br />\nHopkins, on the other hand, is<br />\nmeet held at the Seventy-first Reg- ics. Finally it was decided to give<br />\nthe indoor championship of Anier- have seen fit to embark on their<br />\nexpected<br />\nto turn out one of the best<br />\na concert entirely under the Club's<br />\niment Armory.<br />\nica at the Johns Hopkins-Fifth life's work. One former student<br />\nThe Blue Jay team defeated New own management, since no guaran- combinations that has represented<br />\nRegiment Meet last year, in a close in the department of Electrical<br />\nYork University, Georgestown and tee could be realized. This scheme Homewood in quite a number of<br />\ncontest with Navy and Pittsburgh. Engineering is at present taking a<br />\nNorwich. M. I. T., of Boston, re- is<br />\ncarried out by many other col- years. That Hopkins has the punch<br />\nLast year's team was composed of motorcycle tour across the conticeived first place in the afternoon<br />\nlege clubs in giving concerts at was demonstrated when the Blue<br />\nBooth, Norwood, Dorcus and Aar- nent. After visting the principal<br />\nshoots with a score of 1806, while<br />\nJays handily defeated Swarthmore<br />\nonson. This year's team will prob- points of interest in the West, he<br />\nthe Jays got 1754. A second divi- Frederick, such as Gettysburg,<br />\nlast week by the score of 47 to 24.<br />\nably be the saline except that Clarke expects to return to Maryland via<br />\nsion shot at night and scores at Western Maryland, and the UniThe Quakers succeeded in winning<br />\nwill run the 220 in place of Aaron- the Panama Canal. Another man<br />\nthat shoot have not been received, versity of Maryland. Accordingly<br />\nonly one first place, the fancy dive.<br />\nson. Dorcus will run the quarter, from the same department has<br />\nand under the circumstances Hop- Winchester Hall, one of the downIt is regretted that Hopkins will<br />\nNorwood the half, and Booth the chosen for the field of his, endeavkins men do not know whether they town<br />\nnot<br />\nbuildings<br />\nenter the meet with its full<br />\nof<br />\nHood<br />\nCollege.<br />\nmile.<br />\nors the Near East, doing recon- still<br />\nhave second place, since there<br />\nAt present the team appears to struction work for the Society of<br />\nhas been rented for the affair and strength, due to the inability of<br />\nis a possibility that some other<br />\nWelch, star dash man, to compete.<br />\nbe in good shape. Booth is sure in Friends.<br />\nschool shooting in the second di- all plans for the concert have been<br />\nStevens, Bahlke, Calhoun and<br />\nthe mile, and Clarke will not be reSeven Men at Schenectady<br />\nvision might have entered a higher made.<br />\nSauerwein<br />\nplaced in the 220-yard dash. The<br />\nperforming for Hopkins<br />\nSeven men are now affiliated<br />\nNew Features on Program<br />\nContinued on page 4 col. 3<br />\nfor the first time performed very<br />\nother two places are being closely with the General Electric ComAbout sixty or seventy men, well against<br />\ncontested, for between Dorcus and pany in its plants at Schenectady,<br />\nSwarthmore. Stevens<br />\nBROWN HAS WIN OVER<br />\ncomposing the Glee Club, Banjo won the back stroke, Bahlke<br />\nNorwood, Heyn and Proctor. The N. Y., and this city, thus forming<br />\nwon<br />\nLEHIGH<br />\nClub, Novelty Clubs and the Blue the 220-yard swim and also swam<br />\nactual makeup of the team will de- the largest single group with any<br />\n\"Davy\" Jones and his Brown veton the relay team. Sauerwein<br />\npend on the condition of the men. one company. One graduate<br />\nis erans have one of the strongest ag- Jay Six, will make the trip. All<br />\nswam<br />\non the relay 'and Calhoun<br />\nGeorgetown Expected to Contest<br />\nbranches of the Club will start imconnected with a large steam tur- gregations in<br />\ncollegiate circles. In<br />\nplaced second in the fancy dive.<br />\nHopkins appears to be the pick bine plant in Wisconsin, while<br />\nanmediately after the examinations to<br />\nBrown wishes to eliminate the<br />\nof the East in Medley Relays. other is working for a similar firm a recent meet with Lehigh the<br />\nBrunonians captured every first work on new numbers for the con- plunge and<br />\nGeorgetown is the only close com- in Pennsylvania.<br />\nsubstitute another event<br />\nplace except the fancy diving, the cert. Many new features will ap- to be selected<br />\npetitor. If the 'Washington instiby Hopkins. This<br />\nThree members of last year's<br />\ntution enters a team the race will doing field work for the Baltimore identical trick performed by Hop- pear on the program at Frederick: would further injure the swimming<br />\nkins' natators last week at Swarthbe extremely close. Hopkins prob- and Ohio<br />\nRalph Townsend will give a nov- capacity of the team and it is<br />\nRailroad, having their more.<br />\nably has superiority in the 220, with location mainly in West<br />\nelty act; Wilson Shaffer will doubted if the Black and Blue<br />\nVirginia.<br />\nComparativ<br />\ne<br />\ntimes,<br />\na<br />\nbit<br />\ncoaches will agree to this proposisafer<br />\nClarke, and in the mile, with Verne In the Baltimore machine shops of<br />\ndance in connection with the nummeans<br />\nof<br />\nprediction<br />\nthan<br />\ncompartion. The lineup:<br />\nBooth; the Hilltoppers are usually the same company two mechanical<br />\nWell provided with material in the engineering graduates are at pres- ative scores in football, give ber of the Blue Jay Six; Cookman<br />\n200-yard<br />\nRelay — Sauerwein,<br />\nBrown an edge over Hopkins to- Boyd will give a xylophone solo; Dunning, Bahlke<br />\ntwo middle distances.<br />\nand Lord.<br />\nent performing testing work on<br />\nmorrow night.<br />\nScherr a saxophone solo; Light a<br />\nThis meet will serve as a prelim- materials of engineering.<br />\nFancy Diving— Calhoun and<br />\nAgainst Lehigh, Captain Jones violin solo; Sater a piano selection, Stone.<br />\ninary event for the Johns HopkinsEnter Governmental Service<br />\nwon the fifty and century events in<br />\nFifth Regiment Meet. At this time<br />\n50-yard Dash—Lord and SauerSeveral men have entered state the fast times of 24.2 and 55.2. and Hambleton will probably rena feature race between Hopkins and<br />\nwein.<br />\nand governmental work. Two of Lord, Hopkins' double winner, was der a guitar solo:<br />\nOther well-known teams, similar to<br />\nPlunge—Howard and Hamblethese became surveyors with State caught in 27.1 and 58.2 for the<br />\nThe Publicity Board is working<br />\nthat of last year, will be arranged.<br />\nton.<br />\nThe winner will again be. recog- Transit Commisioners. Another same distance in the Swarthmore in connection with the Club's man150-yard Backstroke — Stevens<br />\nis doing investigating work for meet.<br />\nager in properly advertising the and Hambleton.<br />\nnized as the Collegiate Champion<br />\nthe sanitary department of the<br />\nColes, of Brown, made a mark concert. Articles and pictures are<br />\nof America.<br />\n220-yard Swim—Bahlke.<br />\nUnited States.<br />\nof<br />\n1.11 1-5 in the 100 yard backCoach Le Cato and five men will<br />\n200-ya<br />\nrd Breast Stroke—Dunbeing placed in the Frederick paOther electrical engineering stroke in defeating Travis, of Lemake the trip to the Milrose games.<br />\nning<br />\nand<br />\nStevens.<br />\ngraduates have specialized in the high. Don Stevens, on the other pers. Posters and pictures of the<br />\n100-yard<br />\nDash — Lord<br />\nand<br />\nFLIVVERS PREDOMINATE ON telephone field and are employed hand took 1.27 to negotiate this Club will be placed in conspicuous Bahlke.<br />\nby the great telephone and tele- distance when he finished in front places throughout Frederick. A<br />\nCOLDEST DAY<br />\ngraph<br />\nsystems of the country. At of Stabler, Swarthmore.<br />\nnumber of the most prominent peoOn the coldest day of the year<br />\nFRESHMAN SMOKER ON<br />\nleast<br />\none<br />\nhave<br />\nman<br />\nappears<br />\nthe<br />\nto<br />\nMetzger, in his last start, swam ple of Frederick have been asked<br />\nWith the mercury playing hide and<br />\nFEBRUARY 15<br />\nseek with zero, Henry Ford's much potential prospect of great wealth, the 220 in 2.42, three seconds bet- to act as patronesses in order to inA<br />\nFreshman<br />\nSmoker is planned<br />\nPraised and much ridiculed product as he is actively engaged in the ter than Bahlke's time against the sure proper social backing of the for February 15. This date<br />\nwas<br />\nentertainment. The Glee Club is<br />\nknown universally as the \"flivver,\" \"oil game.\" A meter concern in Quaker team.<br />\nannounced<br />\nby<br />\nPresident<br />\nNiner<br />\nlast<br />\nPredominated on the Homewood Cleveland claims one graduate, The relay should be close with planning to broadcast over radio Thursday at a short class meeting.<br />\nCampus according to a census of while onother is engaged in elec- Brown holding a four second ad- station W EAR a few of its best Definite details have not been artrical testing for the Western vantage.<br />\nhits during the week before the<br />\nParked cars taken at lunch hour.<br />\nranged, but it is thought that the<br />\nElectric<br />\nCompany<br />\nin<br />\nChicago.<br />\nconcert.<br />\nCaptain<br />\nDunning,<br />\nof Hopkins,<br />\nHow many \"flivvers\" failed to<br />\ncost will be about a dollar and a<br />\nshould score a win over Reynolds<br />\nOnly One Teacher<br />\nHome Concert February 21<br />\nstart or how many of the Detroit<br />\nquarter a person. Niner urged all<br />\nprides were stranded on the road<br />\nThe teaching profession appears and Maitland, of Brown, in the<br />\nAs this is the last concert to be who have any talent to help in the<br />\nIs not known, but it is certain that to have been less popular than was breast stroke.<br />\nheld before the annual home con- entertainment, and all others to supat the zero hour of a zero day there formerly the case, but one man<br />\ncert at the Maryland Casualty Club port with their presence, for the<br />\nWere twelve Fords parked at vari- having cast his lot in this field. He<br />\nHouse on February 21st, every ef- smoker is the first event of that naSWIMMING MEET<br />\nous parts of the campus. The is at present an instructor in the<br />\nfort is being made to insure the ture which the class has attempted.<br />\nTickets for J. H. U. vs. CathBuick and the Chevrolet vied for engineering department of a large<br />\nsuccess of this entertainment, so<br />\nOne of the main features of the<br />\nolic U. Swimming Meet on<br />\nsecond honors, four of each being Eastern university. Several men<br />\nthat the Club may enjoy a good rep- smoker will be the awarding of<br />\nFeb. 9 at B. A. C., now on<br />\nhave, however, remained at Hoptabulated.<br />\nutation at its big finale. It is numerals to the class football team,<br />\nsale at A. A. Office, PostofTwelve other makes were listed, kins for further research in their<br />\nhoped that a number of students and the presentation of a gift to<br />\nfice, at Buck Bonner's, or<br />\neach make having but one repre- professions. Two electrical engiwill make the trip to Frederick Coach Landy. Landy gave the<br />\nfrom members of the swimsentative. They were: Chandler, neers are at present enrolled in the<br />\nwith the Club. Those wishing to do team a lot of his time last fall, and<br />\nrn;ng team.<br />\n1)odge, Briscoe, Maxwell, Essex, graduate department, while an<br />\nso may receive special bus rates by a committee consisting of Stone,<br />\nman has chosen research<br />\nMarmon, Hudson, Westcott, Chalgetting in communication with Meredith and Levy is hard at work<br />\nAdmission $1.00 for sinnlers, Davis, Studebaker, and Jor- work in physics for his post-grad\"Mike\" Tilghman, manager of the selecting a suitable token expressive<br />\ngle ticket; $1.50 a couple.<br />\ndan.<br />\nuate work.<br />\nClub.<br />\nof the gratitude of the class.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS - LETTER, JANUARY 25, 1924<br />\n<br />\n2<br />\n<br />\nELECTRICAL<br />\nCLUB<br />\nDIS- engineering departments into closCUSSES FEATURES OF<br />\ner union and to bring the Hopkins<br />\nEngineering School before the<br />\nCIRCUIT BREAKERS<br />\neyes of the public.<br />\nClinton White Addresses Club at<br />\nFOUNDED 1897<br />\nRegular Meeting<br />\nNothing further will be done in<br />\nA lengthy discussion on the the- arranging for the Engineering<br />\n$2.00<br />\nSubscription<br />\nory and operation of hand-operat- Show until after the examinations.<br />\nIn the meantime, however, all<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at ed and magnetic circuit-breakers<br />\nengineering<br />\nstudents have been<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nwas the feature of the Electrical<br />\nthink<br />\nup stunts that can<br />\nto<br />\nasked<br />\nClub meeting held last Friday evebe used in the show.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nning. Clinton W. White, a senior<br />\nHopkins University.<br />\nAt the next Electrical Club<br />\nin the Electrical Engineering meeting, which will be held imBusiness communications should be addressed to the BUSINESS MAN- School, gave a long talk on the mediately after the examinations,<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications subject, illustrating it with nuthe final arrangements will be anshould be sent to the MANAGING EDITOR.<br />\nmerous lantern slides. Much at- nounced and the stunts will be astention was devoted to the meth- signed to particular members.<br />\nTelephone<br />\nHomewood 100 ods of testing the various oil-immersed circuit breakers. The new<br />\nThe new chauffeur was extrememagnetic release safety switches<br />\nEditor-in-Chief<br />\nBusiness Manager<br />\nIn fact, his mistress<br />\nreticent.<br />\nJOSEPH LEOPOLD, '24<br />\nPHILIP W. HOWARD, '25<br />\nadopted by the Baltimore Consolibashful.<br />\nthought<br />\nhim<br />\ndated Gas, Electric, Light and<br />\nManaging Editor<br />\ntell me your last<br />\nAdvertising<br />\nManager<br />\nyou<br />\n\"Won't<br />\nWILLIAM G. DEAN, JR., '24<br />\nPower Company were also disA. J. MCKAY,'26<br />\nname,<br />\nJohn?\"<br />\ncussed at length.<br />\nAssistant Managing Editor<br />\n\"No'm; just call me John.\"<br />\nElectrical Display Planned<br />\nT. REESE MARSH, '24<br />\nCirculation Manager<br />\nFollowing this, Clinton C. Rec- \"Well, may I know what your<br />\nJOHN C. LEWIS, JR., '24<br />\nAssociate Editors<br />\ntor announced the plans of the so- last name is?\"<br />\nRICHARD C. TILGHMAN, '25<br />\nAssistant Business Managers<br />\nJOHN W. PARSONS,'25<br />\nciety for an electrical show to be \"No'm; you'd better not.\"<br />\nBENJAMIN T. ROME,'25<br />\nD. MILES MARRIAN,'25<br />\nheld .some time in March. This \"I insist upon calling you by<br />\nCHARLES G. HUTZLER, '24<br />\nG. DONALD GIESKE,'25<br />\nwhich has the backing of your last name!\"<br />\nshow,<br />\nJOHN T. DIXON,'24<br />\nJunior Editors<br />\nentire<br />\nengineering faculty, is \"All right, then. Call me Darthe<br />\nEUGENE<br />\nTOVELL,'24<br />\nC.<br />\nARTHUR L. NELSON, '26<br />\nERNEST A. STRATHMAN, '26<br />\nOTHO J. KELLER, III, '26<br />\nexpected to establish new tradi- ling.\"—Co/unins.<br />\nALGER G. HISS, '26<br />\nJ. JACKSON KIDD, '26<br />\ntions for the Hopkins EngineerEDWARD 0. MICHEL, '26<br />\nT. STRAN SUMMERS, '25<br />\nJAMES YOUNG, '25<br />\ning School. The publicity which<br />\nSuitor—Mr. Perkins, I have<br />\nHEYWARD E. BOYCE, JR., '27<br />\nHENRY R. TURNBULL, '26<br />\nthis display is certain to attract courted<br />\nHAROLD S. GOODWIN, '26<br />\nyour daughter for fifteen<br />\nwill, however, benefit not only the<br />\nyears.<br />\nEngineering Departments but also<br />\nPerkins—Well, what do you<br />\nMember Southern Intercollegiate Newspaper Association<br />\nthe entire school.<br />\nwant?<br />\nA committee composed of memSuitor—To marry her.<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nbers of all the engineering dePerkins—Well, I'll be damn. I<br />\npartments, has worked up a num- thought<br />\nyou wanted a pension or<br />\nber of stunts for the show. It con- something.—Puppet.<br />\nHOMEWOOD, BALTIMORE, MD., JANUARY 25, 1924<br />\nsists of J. V. Alfrend, chairman;<br />\nEdward Shower and Ferdinand<br />\nHamburger, of the Electrical DeAn army surgeon was examining<br />\npartment; William North Crout, a cow-puncher recruit.<br />\nOUR HONOR SYSTEM<br />\nof the Civil Engineering Depart- \"Ever had any accidents?\"<br />\nWe are surprised at the number of editorials that are appearing<br />\nment, and J. Edward Mount, of<br />\nin undergraduate publications of other colleges urging the student<br />\nthe Mechanical Engineering De- \"What's that bandage on your<br />\nbody to unite in placing the Honor Code on a working basis and \"to partment.<br />\nhand?\"<br />\nreduce cheating in examinations to a minimum.\" The thought of<br />\nAt numerous colleges engineer- \"Rattlesnake bite.\"<br />\nmaking such an apeal has never occurred to us. Johns Hopkins ing shows of similar nature are \"Dont you call that an accident?\"<br />\nseems to be somewhat unique in the fact that it has an Honor System held during the festivities preced- \"Naw ; the dam' thing did it on<br />\ning graduation. In fact, in some purpose.\"—Yale Record.<br />\nestablished \"on a working basis,\" and we feel that any request to<br />\nschools the engineering show and<br />\n\"reduce cheating in examinations to a minimum\" would be misplaced.<br />\nthe other functions attendant upon<br />\nConstable—Eighteen years old,<br />\nTo state that \"the Honor System at Johns Hopkins has estab- it are as important as the June<br />\neh?<br />\n'Pears to me ye look mighty<br />\nWeek<br />\nactivities<br />\nat<br />\nHopkins.<br />\nare<br />\nlished for itself a unique and enviable record\" is putting the case<br />\nThe Electrical Clubs' show, how- young fer yer age, mister.<br />\nmildly. Few are the undergraduates who have seen any evidence<br />\never, is being arranged not to com- \"Yes, sir. If you please, sir, I've<br />\nof \"cribbing\" during their college course. The matter of honor has<br />\npete with June Week but only to always taken the best of care of<br />\nbeen placed in the hands of the undergraduate body and the under- bring the members of the various myself.\"—Life.<br />\ngraduate body has responded nobly. The Honor System assumes<br />\nthat every man is a gentleman; the students have proved, beyond a<br />\nshadow of a doubt, that every Hopkins man is a gentleman.<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\nWe are proud of our Honor System, and we are proud of Hopkins. This is not meant, however, to be merely an euolgy. Its purpose is to inform members of the Freshman Class, who are taking<br />\nHopkins examinations for the first time, that the Honor System is not<br />\nonly a name but an established fact. We are certain that the Class<br />\nof 1927 will enter into the spirit of the \"Code\" and will be as proud<br />\nof it as we are.<br />\nWe have always said that the time-honored greeting should<br />\nchanged to \"A Merry Christmas and Happy Mid-Years.\"<br />\n<br />\nbe<br />\n<br />\nTHE SWIMMERS<br />\nThe swimming team, along with other minor sport organizations,<br />\nis laboring under enormous difficulties. The financial support given<br />\nby the athletic budget is insufficient; the team is practicing without<br />\nthe services of a coach; lack of a pool at Homewood necessitates<br />\nirregular practice hours; the already limited squad is constantly<br />\nthreatened by a malignant and unmerciful black list.<br />\nIn spite of the obvious difficulties, the team opened its season<br />\nlast week with a victory, defeating the Swarthmore mermen by a<br />\ndecisive margin. A difficult schedule is still ahead of' the Hopkins<br />\nmen but we are assured of a good showing.<br />\nThe members of the swimming team are to be commended for<br />\ntheir efforts and for their spirit. An excelent way of showing our<br />\nappreciation is by supporting the home meets.<br />\nThe News-Letter wishes to announce the election of Mr. Charles<br />\nG. Hutzler, '24, to the position of associate editor.<br />\n<br />\nFr,<br />\nDamon—<br />\n\"What was the matter<br />\nwith Professor Henry this<br />\nmorning? I've never seen<br />\nhim so peeved. He seemed<br />\nto be boiling over.\"<br />\n<br />\nPyThias—<br />\n\"Boiling over is good. He<br />\nwas. Didn't you notice<br />\nwhy? The old boy had mislaid his Eldorado pencil.\"<br />\n<br />\nriIDvEZIX....<br />\nolg<br />\nirirt<br />\n' 0<br />\nI:AOHAU<br />\n\"the masterdrawingpencil\"<br />\n17 leads—all dealers<br />\n<br />\nMAJOR RIELY GIVES LECTURE ON HYGIENE AND<br />\nSANITATION TO<br />\nR. O.T. C.<br />\nThe Department of Military<br />\nScience has inaugurated a new<br />\npolicy in the lectures being given<br />\non Hygiene and Sanitation. Last<br />\nMonday, Major Charles Riely,<br />\ncommander of the R. 0. T. C. at<br />\nthe Medical School lectured on<br />\nthese topics to the Sophomore and<br />\nSenior members of the unit. In<br />\nformer years the officers of the<br />\nstaff conducted classes on these<br />\nsubjects, but the department has<br />\ndecided that experts only should<br />\nteach them, so Major Riely was<br />\nsecured to give the lectures.<br />\nMajor Riely spoke on the general aspects of Military Hygiene<br />\nand Sanitation. This was followed<br />\nby a practical demonstration of<br />\nFirst Aid work by the Major and<br />\ntwo Medical Corps assistants.<br />\nVarious splints, bandages and<br />\nother First Aid Devices were put<br />\nupon one of the men until he resembled a mummy. Demonstration of the Medical Corps field kit<br />\nMajor<br />\nand stretchers followed.<br />\nRiely concluded with a short discourse on snake bites, at the request of Lieutenant Sherwood.<br />\nMajor Riely will conduct a practical exercise today, at which students will be given an opportunity<br />\nto practice bandage work and the<br />\nmethods of resuscitation. The lectures are supplemented by talks<br />\non the same subjects by Lieutenant Sherwood.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 25, 1924<br />\nDR. PAUL PELIOT TO SPEAK<br />\nON HISTORY OF RELIGIONS NEXT MONTH<br />\n<br />\n3<br />\n<br />\nMORE ABOUT \"DRINKING IN<br />\nTHE COLLEGES\"<br />\n(From New York Times)<br />\nFrench Professor on Tour of American<br />\nEver since the Volstead act deUniversities. Famous for Archaeofined the Eighteenth Amendment,<br />\nlogical Work in Orient<br />\nthe college authorities have been<br />\nDuring February, on the fifth,<br />\nseventh, twelfth, and fourteenth,<br />\nin a quandary what to do about it.<br />\n13 SOUTH ST.<br />\nDr. Paul Peliot, professor of ChiNaturally it is difficult to obtain<br />\nnese civilization at the College of<br />\nHopkins swimmers scored a vic- precise data regarding the extent<br />\nOrganized l864<br />\nFrance, will speak here on the his- tory over<br />\nJohn J. Nelligan, President<br />\nSwarthmore last Satur- to which the act is violated in the<br />\ntory of religions.<br />\nday, when they emerged winner in colleges, but information from<br />\nProfessor Pelliot, who is making<br />\na tour of the eastern and mid-west- all but one event. Stevens, Bahlke Harvard, Princeton and Yale, toThe Greetings of a Fine Store<br />\nern parts of the United States un- and Calhoun are new talent who gether with reports from other<br />\nder the auspices of the American performed well in the meet. Lord seats of learning, indicates that the<br />\nTo the Students of a Fine University<br />\nCommittee for Lectures on History won individual honors when he effect seems to have been to drive<br />\nmany students from the comparaof Religions, will deliver six ad- came through in<br />\nthe 50 and 100tive<br />\nmoderation of the last decade.<br />\ndresses at Columbia and, besides<br />\nyard dashes. He also swam on the<br />\nPrior<br />\nto the Volstead act the<br />\nJohns Hopkins, will lecture at Lowwinning relay team.<br />\ncolleges<br />\nhad their own code reell Institute, Yale, Oberlin, Univer*<br />\ngarding<br />\n*<br />\n*<br />\ndrink.<br />\nIt was forbidden<br />\nsities of Pennsylvania, Michigan,<br />\nto<br />\nbring<br />\nintoxicants<br />\ninto univerFrank J. Sullivan, coach of the<br />\nIllinois and Wisconsin.<br />\nsity<br />\nDrunkenness,<br />\nbuildings.<br />\nif<br />\nDr. Peliot comes to America at Princeton swimming team, is spona time when interest in archaeolog- soring a movement to hold a Na- public, was \"conduct unbecoming<br />\nical research has reached its high- tional Collegiate Swimming Meet. a scholar and a gentleman.\" Moreest degree, and also at a period The meet would be held under the over, the man who was publicly<br />\n.WW:Corneravelie and gutaw Sts.<br />\nwhen Central Asia is becoming of auspices of the N. C. S. A., it was intoxicated lost caste with his felows.<br />\nThey<br />\nmade<br />\na<br />\nnice<br />\ndistincdecided<br />\nby<br />\nthe<br />\nN.<br />\nC.<br />\nA. A. at their<br />\never increasing importance, even<br />\n-Where Wholesale and Retail Districts Meet'.<br />\nbeginning to rival Egypt in this recent meeting in Atlanta. The tion between the celebration of<br />\nmeet this year will probably be football victories, club elections<br />\nfield.<br />\nheld at Columbia on April 5. The and the like, and real addiction to<br />\nWorked in Turkistan<br />\ndrink. This state of affairs was<br />\nThe scene of Dr. Peliot's most N. C. S. A. is trying to gain recculmination of fifty years of<br />\nthe<br />\nimportant work was in Chinese ognition of the meet by the AmerCollege and Fraternity Stationery<br />\ngrowing<br />\nmoderation. The old days<br />\nTurkestan, where the extremely ican Olympic Association so that<br />\nBanquet and Dance Cards, Invitations<br />\nerh<br />\nwhen the few men were drunkards<br />\narid climate and the ever advanc- it may act in the future as an ofJAS. H. DOWNS<br />\n11<br />\nN. HOWARD ST.<br />\nand the many teetotalers were<br />\ning desert have preserved a vast ficial trial for the American OlymENGRAVER<br />\nAgents for All Leading Makes<br />\nPRINTER STATIONER<br />\nyielding to an almost European<br />\namount of ancient manuscripts and pic team.<br />\nof Instruments<br />\n229 N. CHARLES ST.<br />\n* * *<br />\npractice.<br />\narticles suitable for study when<br />\nCREDIT CHEERFULLY<br />\nThe Intercollegiate Basketball In 1919 drinking rather than<br />\nunearthed.<br />\nA. JACOBS & SONS<br />\nLeague is well under way. Each drunkenness became the social ofThe famous archaeologist was<br />\nTailors<br />\nof the six teams—Columbia, Yale, fense. The result was a rapid<br />\nbrought to America by the Amerswing<br />\nback<br />\nfrom<br />\nthe<br />\nattitude<br />\nthat<br />\nCornell, Dartmouth, Pennsylvania,<br />\nUniforms and Liveries<br />\nican committee for lectures on the<br />\nand Princeton—have lost one man might drink, but owed re128<br />\nW. FAYETTE ST.<br />\nhistory of religions, of which ProNear Liberty St.<br />\nBaltimore, Md.<br />\ngame. Columbia has won two and spect for his fellows in the matter<br />\nfessor Richard Gottheil, head of<br />\nconduct,<br />\nof<br />\nboyish<br />\nto<br />\nthe<br />\npoint<br />\nof<br />\nall the other teams have won one<br />\nthe Oriental department at Columview that intoxication was a joke,<br />\nexcept<br />\nPrinceton,<br />\nwho<br />\nonly<br />\nhas<br />\nLIBERTY ST.<br />\nbia University, is president, and<br />\nplayed one game to date. The com- not on one's self, but on the law.<br />\nDr. Lucius C. Porter, head of the<br />\nAT SARATOGA<br />\npetition this year is exceptionally The sense of personal responsibildepartment of Chinese at the same<br />\nclose, and any team may win the ity was miraculously shifted from<br />\nLUNCHEON<br />\nuniversity is secretary.<br />\nchampionship, which Yale won last the individual to the law, and the<br />\nTEA<br />\nSix Lectures at Columbia<br />\nyear. Princeton plays two games result has been occasional deDINNER<br />\nThe longest series of addresses this week, meeting Yale at Prince- bauches in the universities.<br />\n29 E. BALTIMORE ST.<br />\ndelivered by Dr. Peliot will be at ton and Cornell at Ithaca. These<br />\nNo college president can stand<br />\nAgents for JOHN B. STETSON HATS 11.30 A. M.<br />\nSPECIAL PARTIES<br />\nColumbia University, where he are the only league games sched- by and allow his students to acand FRATERNITY BANDS<br />\nuntil<br />\nwill give six lectures in the month uled this week.<br />\ncustom themselves to excess, but<br />\n7.30 P. M<br />\nPLAZA 6987<br />\nof February. In April he will parwhat action can he take? At<br />\n* * *<br />\nticipate in the annual meeting of<br />\nPrinceton, Harvard and -Yale,<br />\nthe American Oriental Society at In the Missouri Conference, where drinking has perhaps deColumbia, and during the same Washington and Kansas are tied clined, drunkenness has apparentmonth he will give a special series for the lead, neither having beep ly increased. Yet what drinking is<br />\nof talks before the Columbia de- defeated. Other conference quints done is done under cover. At Harhave lost at least two games. In<br />\npartment of Chinese.<br />\nvard the authorities bestir themthe Big Ten basketball race, WisThe setting of most of the adselves to action—invariably expulconsin and Michigan are tied,<br />\ndresses delivered by the famous<br />\nsion — when an undergraduate<br />\nneither having lost a game.<br />\narchaeologist at Hopkins will be<br />\nawakens in the morning to find his<br />\n* * *<br />\nTurkestan, where Dr. Peliot has<br />\nname in the papers. The test is<br />\npenetrated far inland in his search<br />\nJoie Ray, Chicago taxicab driver, avoidance of publicity.<br />\nfor human history. The lecture won the mile run in the Fordham<br />\nAt Yale, the sitation is slightly<br />\nwill be public and will not require games last Saturday night. In the complicated. President Angell atcards of admission. The French same meet Bob McAllister, the tempted to make the Student<br />\nprofessor will probably display an \"flying cop,\" equalled his own Council take up the problem of<br />\nelaborate assortment of slides, world's record for 120 yards in- undergraduate drinking, but his<br />\nHE Remington Portable Typewriter carWhich he has accumulated during doors in a heat, but collapsed and manoeuvre met with unfortunate<br />\nhis archaeological research work in could not enter the finals.<br />\nresults. In addressing the freshries its table on its back. You can use it<br />\nmany sections of the Orient.<br />\nman class he announced that exanywhere—at any time.<br />\n* * *<br />\nSubject New to Hopkins<br />\npulsion would follow the detection<br />\nIt is a complete typewriter with four-row<br />\nThe Hopkins Medley Relay<br />\nof any violation of the rule forbidThe subject of Prof. Peliot's lecTeam will run in New York on<br />\nkeyboard—just<br />\nlike the big machines. Also<br />\nding liquor in university buildings,<br />\ntures is a novel one at this UniverJanuary 30 at the Milrose games.<br />\nother<br />\nuseful<br />\nmany<br />\nfeatures of the office typeand incidentally of the Volstead<br />\nsity. There is no record at the<br />\nBooth and Clarke are a combinalaw. This decision utterance puts<br />\nRegistrar's Office of any course in<br />\nwriter. Yet it is small, compact, and fits in a<br />\ntion that will be hard to beat, no<br />\nthe issue clearly and no future ofComparative Religion, the History<br />\ncase only four inches high.<br />\nmatter who the other members of<br />\nfender will have just cause for<br />\nof Religion, or similar courses.<br />\nthe relay will be. Dorcus and NorPrice,complete with case,$60<br />\ncomplaint. Indeed, it would seem<br />\nHeretofore Philosophy and Ethics<br />\nwood will probably be selected by<br />\nthat the only way in which the colCourses have given students their<br />\npayment terms ifdesired<br />\nEasy<br />\nCoach Jimmy Le Cato.<br />\nonly opportunity for such knowllegiate public can be wooed from<br />\n* * *<br />\nedge. It is believed, therefore, that<br />\nviolating an unpopular ordinance<br />\nmany students will take advantage<br />\nWhere will the Army-Navy foot- will be by unhesitating use of<br />\nof this chance to hear a renowned ball tilt be staged next fall? This power, even at the cost of tradischolar's treatment of this topic. is a question which is still unset- tions of personal liberty.<br />\ntled. New York will not be the<br />\nRook—I would like to try out scene of the service conflict. That ment stadium is doomed, we underfor the dramatic society here on the much is definitely known. Rumor stand, and the Clarke Griffith stadiRemington Typewriter Co.<br />\ncampus.<br />\nhas it that Philadelphia and Wash- um (American League Baseball<br />\nSoph--Have you had any experi- ington are being considered. Wash- Park) is unsuitable. Maybe Bal25 W. Fayette St.<br />\nence?<br />\nington probably won't get the game timore will still be considered and<br />\nBaltimore<br />\nRook—Oh, my yes, I had my leg because of the lack of a suitable get the preference over Philadelin a cast once.—Orange Owl.<br />\nstadium. The proposed govern- phia.<br />\n<br />\nMID-WINTER<br />\nSPORTING<br />\nBUNK<br />\n<br />\nSafe Deposit & Trust Co.<br />\nOF BALTIMORE<br />\n<br />\nHOCHSCHILD,KOHN 8c Co.<br />\n<br />\nre\"<br />\n<br />\nry<br />\n<br />\nst<br />\n<br />\nat<br />\n)n<br />\nid<br />\nfn<br />\n[le<br />\nse<br />\nas<br />\nid<br />\nas<br />\n<br />\nIC<br />\n<br />\nof<br />\nid<br />\n:s.<br />\nid<br />\nut<br />\nea:it<br />\n)r<br />\nse-<br />\n<br />\nc-<br />\n<br />\n:y<br />\nle<br />\nccs<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\n<br />\nA.<br />\n<br />\nURDWISE<br />\n134LTIMORE'S HUSTCAL INSTRUMENT m3U5E<br />\n<br />\nUse It<br />\nAnywhere!<br />\n<br />\nT<br />\n<br />\nRemington<br />\nPortable<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 25, 1924<br />\nSCHEDULE OF UNDERGRAD-<br />\n<br />\nFebruary 4<br />\n<br />\nSHIRT MAKER<br />\nUATE EXAMINATIONS,<br />\n226 N. Liberty St.<br />\nDress Shirts...$3.00, $3.50 and $4.00<br />\nJAN.28 to FEB.5<br />\n$3.30 and $4.40<br />\nNegligee<br />\nThere will be one session a day<br />\n$5.50 and $6.60<br />\nImported Madras<br />\nTerms Cash, Less 10% 30 days on Shirts (except where indicated), beginAlso a Full Line of Men's<br />\nning at 9 A. M. The time allotted<br />\nFurnishings<br />\n<br />\nSTRATTON<br />\n<br />\nALWAYS USE A<br />\n<br />\nYELLOW CAB<br />\nOR PHONE<br />\n<br />\nVERNON 1212<br />\nHAIL THEM ANYWHERE<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\nLimited<br />\n<br />\nBARN CAFETERIA<br />\nORDERS RECEIVED FOR<br />\n<br />\nCOGGINS'<br />\nTransfer & Baggage Express<br />\nAUTOMOBILE SERVICE<br />\nPHONE, HOMEWOOD 6886<br />\n<br />\nEdv. Elect. and<br />\nMagnetism<br />\nM. E. 201<br />\nBiology 3 (Zoology) G. 113<br />\nChemistry 2<br />\nC. E. 120<br />\nFrench Elements<br />\n(M. T. 8:30 sec.)<br />\nG. 312<br />\nFrench 1 (Prof.<br />\nLancaster)<br />\nG. 112<br />\nis as follows: in a three or four- French<br />\n1 (Mr. Beall) G. 311<br />\nhour course, three hours; in a two- French 1 (Mr. Ware) G. 314<br />\nFrench 1 (Dr. Van<br />\nhour course, two hours.<br />\nRoosbroeck)<br />\nG. 205<br />\nFrench 4<br />\nG. 310<br />\nGerman Elements<br />\nJanuary 28<br />\n(M. T. 8:30 sec.)<br />\nMain Lib. N.<br />\nEnglish Lit. 6<br />\nMain Lib. N. Math. 4<br />\nG. 2<br />\nBiology 1<br />\nG. 112<br />\nMath. 6<br />\nG. 8<br />\nElectrical Neasts<br />\nM. E. 104<br />\nMain Lib. S.<br />\nPolitical Econ. 13<br />\nFrench 1B (M. T.<br />\nRailroad Engineer.<br />\nC. E. 307<br />\nW. 11:30 sec.)<br />\nG. 312<br />\nSurveying (all sec.)<br />\nC. E. 210<br />\nGeology 2<br />\nC. E. 5<br />\nTheory of Structures C. E. 115<br />\nGerman El (M. T.<br />\nW. 11:30 sec.)<br />\nMain Lib. S.<br />\nFebruary 5<br />\nGerman 1<br />\nG. 313<br />\nHistory 4<br />\nG. 310<br />\nBiology 2<br />\nG. 11<br />\nItalian El<br />\nMain Lib. N. English Comp. 2<br />\nG. 313<br />\nLatin 1 (Livy)<br />\nG. 108<br />\n,Ierman El (W. Th.<br />\nMaterials of Eng.<br />\nF. 8:30 sec.)<br />\nMain Lib. N.<br />\n(both sec.)<br />\nM. E. 109-110 Greek El.<br />\nMain Lib. S.<br />\nMath. 2 (Prof. Cohen) G. 8<br />\nHebrew El.<br />\nG. 100<br />\nMath. 2 (Prof.<br />\nHistory 2<br />\nG. 112<br />\nHulburt)<br />\nG. 2<br />\nPolitical Econ. 1<br />\nMath. 2 (Dr. Nelson) G. 100<br />\n(Prof. Weyforth)<br />\nM. E. 110<br />\nMath. 1B (Prof.<br />\nPolitical Econ. 1<br />\nMurnaghan)<br />\nM. E. 217<br />\n(Dr. Mitchell\"<br />\nG. 312<br />\nMath. 1B (Mr. Moore) M. E. 202<br />\nPolitical Econ. 1<br />\nMath. 01B (Mr.<br />\n(Mr. Gillies)<br />\nG. 314<br />\nPatterson)<br />\nM. E. 114<br />\nPolitical Science 1<br />\nG. 311<br />\nPhysics 2<br />\nM. E. 204<br />\nPhilosophy 2<br />\nG. 113<br />\nPolitical Science 4<br />\nRIFLE TEAM WINS SECOND PLACE<br />\nG. 314<br />\nPsychology 1<br />\nG. 311<br />\nAT E. I. R. A. MEET<br />\nSan. Engineering<br />\nC. E. 307<br />\nContinued from page 1<br />\nSpanish Elements<br />\n(Dr. Williams)<br />\nG. 205<br />\nscore than that established in the<br />\nJanuary 29<br />\nChemistry 1B<br />\n<br />\nThe Flag, Banner & Pennant Shop Elements of E. E.<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br />\n<br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBaltimore<br />\n<br />\nFrench 2<br />\nEnglish Lit. 1<br />\nEnglish Lit. 7<br />\nGeology 3<br />\nGerman 4<br />\nGreek 4<br />\nHistory 5<br />\nMath. 1A (Dr.<br />\nMusselman)<br />\nMath. 1A (Mr.<br />\nLinker)<br />\nMath. 01 (Dr. Nelson)<br />\nPhilosophy 1<br />\nPolitical Econ. 12<br />\nPolitical Econ. 8<br />\nPower Plant Calc.<br />\n<br />\nM. E. 109<br />\nM. E. 110<br />\nG. 312<br />\nG. 112<br />\nMain Lib. N.<br />\nC. E. 202<br />\nG. 310<br />\nMain Lib. S.<br />\nG. 311<br />\nG. 2<br />\n<br />\nG. 8<br />\nG. 100<br />\nG. 113<br />\nG. 314<br />\nG. 313<br />\n(Drafting<br />\nRooms)<br />\nReinforced Concrete<br />\nC. E. 307<br />\nAfternoon (2-4 P. M.)<br />\nGreek Lit.<br />\nG. 108<br />\nJanuary 30<br />\n<br />\nA. C. Theory<br />\n(Prof. Lee)<br />\nM. E. 201<br />\nApplied Mechanics<br />\nEstablished 1873<br />\nM. E. 109-110<br />\n(all sections)<br />\nAccounting 1<br />\nG. 314<br />\nA. H. FETTING MAN'FG<br />\nBiology 3 (Botany)<br />\nG. 112<br />\nJEWELRY CO.<br />\nFrench 3<br />\nMain Lib.<br />\nManufacturers<br />\nFrench 5<br />\nG. 311<br />\nGreek Letter Fraternity Jewelry<br />\nGreek Intermediate<br />\nG. 100<br />\nC. E. 105<br />\n213 N. LIBERTY ST., Baltimore, Md. Geology 4<br />\nHeat Trans.<br />\nM. E. 117<br />\nHeat Engines (all<br />\nsections)<br />\n:i4,v,iv4,0iTilrrlizi,NiF-41Hh4101i144.0.0.0:4,1K14}1014,1101011410I11<br />\nC. E. 120<br />\nLatin 2<br />\nG. 113<br />\nPublic Speaking 2<br />\nG. 312<br />\nPsychology 2<br />\nMain Lib. N.<br />\nAfternoon (2-5 P. M.)<br />\nSpanish 2<br />\nMain Lib. N.<br />\nLatin 2<br />\nMain Lib. S.<br />\n<br />\nS.<br />\n<br />\niNOTOM OEM<br />\nThe King of Lubricants\"<br />\nSHERWOOD BROTHERS, INC.<br />\n(KEENKEN<br />\n<br />\nFu FitElEfetlieleateee;eeoioD qi•:4<br />\n<br />\nBoys, the place to get your<br />\nmeals—and they are honest-to-goodness meals, well<br />\nserve d, and reasonably<br />\npriced—is at<br />\n<br />\nThe St. REGIS<br />\nRESTAURANT<br />\n1817 N. Charles St.<br />\n(Half Block below North Ave.)<br />\n<br />\nNicholas Brown, Mgr.<br />\n<br />\nFor<br />\nGENERAL<br />\nUSE<br />\n<br />\nFor<br />\nFOUNTAIN<br />\nPENS<br />\nManufactured by<br />\n<br />\nWIGHT & HUMPHRIES<br />\n<br />\nFebruary 1<br />\nA. C. Theory<br />\n(Mr. Lampe)<br />\nChemistry 1A<br />\nElectric Railways<br />\nEnglish Lit. 2<br />\nFreshman Introductory<br />\nGeology 1<br />\nGerman 5<br />\nHistory 1<br />\nLatin (Cicero &<br />\nVirgil)<br />\nMath. 3 (M. T.<br />\n9:30 sec.)<br />\nPolitical Science 2<br />\nPsychology 3<br />\nSpanish El. (Mr.<br />\nNoble)<br />\nSpanish 1<br />\nStructural Engineer.<br />\n<br />\nM. E. 104<br />\nC. E. 120<br />\nM. E. 201<br />\nG. 314<br />\nG. 113<br />\nC. E. 5<br />\nMain Lib. N.<br />\nG. 305<br />\nG. 108<br />\nG. 2<br />\nG. 311<br />\nG. 312<br />\n<br />\nMilitary Science<br />\n1st year basic<br />\n2d year basic<br />\n1st year adv.<br />\n2d year adv.<br />\nDynamics of Mech.<br />\n<br />\nC. E. 120<br />\nS. Loft<br />\nN. Loft<br />\nM. E. 120<br />\n<br />\nPRMTERS<br />\n<br />\nBiniYE.us<br />\n<br />\nColiele Literature<br />\n<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\naexfteztoVitecie-<br />\n<br />\nA CLARK ALUMNUS OFFERS<br />\nINFORMATION<br />\nTo the Editor of the Johns Hopkins News-Letter:<br />\n<br />\nStrange!<br />\n<br />\nVaseline<br />\n.S. PAT<br />\n<br />\nHAIR TONIC<br />\n<br />\nMfg.Co.<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n41 Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n:<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nDECORATIONS<br />\n<br />\nFURNITURE<br />\n<br />\nThe famous detective arrived at<br />\nthe scene of the crime.<br />\n\"Heavens,\" he said, \"this is more<br />\nserious than I thought. This window has been broken on both sides.\"<br />\n—Co/unts<br />\n<br />\nDRAPERIES<br />\n<br />\n343 NORTH CHARLES STREET<br />\n<br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\nCo-Ed—You know, I didn't ac-<br />\n<br />\ncept Claude the first time he proposed.<br />\nFriend—I guess you didn't. You<br />\nweren't there.—Whirlwind.<br />\n<br />\nAt the<br />\n<br />\nWashington Monument<br />\nOscar Thomas Olson, D.D.<br />\n<br />\nMinister<br />\n1—I hear your town is strong<br />\nfor the Ku Klux.<br />\n2—Well, I should say! Even the<br />\nrain comes down in sheets.—Texas<br />\nRanger.<br />\n<br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br />\nThe purpose and program of th:s<br />\nChurch will appeal to you. Look in<br />\non the Sunday afternoon -At Home<br />\nfrom five to seven.<br />\n<br />\nMain Lib. S.<br />\nCapt.—Boys, the boat is sinking.<br />\nMain Lib. N.<br />\nIs<br />\nthere any one here who knows<br />\nC. E. 307<br />\n<br />\nFebruary 2<br />\n<br />\nETIGRAUERS<br />\n<br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, But Shoulder the Responsibility<br />\n<br />\nThe profound ignorance of certain Hopkins students, who take<br />\nPrinters of<br />\nit upon themselves to desseminate<br />\ncrhe Johns Hopkins<br />\nknowledge to their fellow students<br />\nNE1DS,-LETTER<br />\nis appalling. I suppose they never<br />\nheard of the university which<br />\n\"closely linked with Hopkins LOMBARD and SOUTH STREETS<br />\nshares nation-wide repute as grad<br />\nuate schools.\"<br />\nNeither is the flattery given to<br />\nPresident Atwood by calling him<br />\nDr. Clarke called for, as in the preafternoon.<br />\nvious paragraph President GoodIndividual Scoring of Team<br />\nnow was quoted as saying that<br />\nIndividual scores are as follows:<br />\nPresident<br />\nAtwood was the leading<br />\nSteck, 356; Wilgis, 351; Rowland,<br />\n354; Tasche, 355; and Kaufman, geographer of modern times.<br />\nFor the benefit of these individ338. Edward Mount went with the<br />\nuals<br />\nI would like to say that the<br />\nmen as manager. The team was<br />\nspeaker<br />\nat the assembly on Januaccompanied by Capt. Davis and<br />\nIt's a queer one, a puzzler—and<br />\nary<br />\n17th<br />\nwas President Wallace<br />\nLieut. William I. Sherwood.<br />\nyet it's true! He has found<br />\nsomething which gives him<br />\nThe Homewood team won over W. Atwood, of Clark University,<br />\npleasure, and the most incorrigWest Virginia last week, 3582 to Worcester, Massachusetts.<br />\nible pessimist must admit it's<br />\nbeneficial.<br />\n3171. A shoot with Ohio State was<br />\nA CLARK ALUMNUS.<br />\n\"Vaseline\" Hair Tonic is the reason<br />\nheld last week, but the Buckeye's<br />\nfor this unique experience. It's the<br />\nclassiest hair dressing ever, gives<br />\nteam did not shoot because of unIt is said that an absent-minded<br />\nsnap and polish to the head. And—<br />\nit helps the scalp.<br />\nexpected circumstances and their professor in the university once<br />\nAt all drug stores and student<br />\nscore will be received Saturday of poured syrup down his back and<br />\nbarber shops.<br />\nEvery \"Vaseline\" product is recthis week, it is thought by Capt. scratched the pancake.—Augwan.<br />\nommended everywhere because of<br />\nits absolute purity and effectiveness.<br />\nW. S. Paul, rifle team coach.<br />\nTwo positions will be fired with<br />\nFather—Great heavens, son, how<br />\nMaine University this week—prone you do look!<br />\nSon—Yes, father, I fell in a mud<br />\nand standing. De Pauw University, Greencastle, Ind., cancelled puddle.<br />\ntheir match because of impending<br />\nFather—What! And with your<br />\nnew pants on, too?<br />\nexaminations.<br />\nChesebroutjh<br />\nSon—Yes, father, I didn't have<br />\njc_9111,Vidate_LIL<br />\nWife (finding husband drunk)— time to take them off.—Whirlwind.<br />\nJohn, this is the last straw.<br />\nHusband — Thass awright,<br />\nm'dear ; I never use 'em. Jesh give<br />\nme the bottle.—Chaparral.<br />\n<br />\n\"How's the boy getting along at<br />\nJanuary 31<br />\ncollege, Si?\"<br />\nChemistry 3<br />\nM. E. 114<br />\n\"Fine! He's taken up swimming<br />\nEnglish Comp. 1<br />\nMain Lib.<br />\nN. & S. now. In his last letter he says he<br />\nEnglish Lit. 5<br />\nG. 311<br />\nspends all his time at Kelly pool.\"<br />\nGerman 2<br />\nG. 305<br />\n—Witt.<br />\nGreek 1<br />\nG. 100<br />\nHebrew (2d year)<br />\nG. 312<br />\nHighway Engineering C. E. 307<br />\nMath. 3 (M. T.<br />\nW. 10:30 sec.)<br />\nG. 8<br />\nPhysics 1 A-R<br />\nC. E. 120<br />\nPhysics 1 S-Z<br />\nM. E. 109<br />\nPolitical Econ. 2<br />\nG. 314<br />\nPolitical Econ. 4<br />\nG. 313<br />\nAfternoon (2-4 P. M.)<br />\nPublic Speaking<br />\nMain Lib. N.<br />\n<br />\nTHE NEWS-LETTER<br />\nMAILBAG<br />\n<br />\nhow to pray?<br />\nParson (eagerly)-1 do.<br />\nCapt.—All right, you pray; the<br />\nrest of us will put on life belts.<br />\nThere's one shy.—Penn Punch<br />\nBowl.<br />\n<br />\nSunday morning worship at 11 o'clock.<br />\nSunday evening service at 8 o'clock.<br />\nMusic by vested chorus—choir of soloists.<br />\n\"At the heart of the City\"<br />\n<br />\nALL SEATS FREE<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVIII, No 29<br /><br />\nHOMEWOOD, BALTIMORE, MD., JANUARY 25, 1924<br /><br />\nPRICE 5 CENTS<br /><br />\nVARSITY TO ENTER RELAY DIVERSITY IN SELECTION OF RIFLE TEAM WINS SECOND MUSICAL<br />\nCLUB WILL PRE- HOPKINS<br />\nSWIMMERS<br />\nTO<br />\nTEAM IN.THE MILROSE<br />\nPOSITIONS BY 1923 ENPLACE AT E. I. R. A.<br />\nSENT CONCERT AT FREDMEET BROWN AT PROVIINDOOR GAMES<br />\nGINEERING GRADS<br />\nMEET AT NEW YORK<br />\nERICK ON FEB. 16<br />\nDENCE TOMORROW NIGHT<br /><br />\nBooth, Norwood, Dorcus and Clarke General Electric Company Gives Jobs to Six Shooters Make Trip.<br />\nM. I. T. Entire Club Will Perform at Winches- Eight Men to Make the Trip. Hopkins<br />\nProbably Will Represent UniSeven Men. Only One Man in<br />\nTakes First Place<br />\nter Hall. Publicity Board to Help<br />\nHopes for a Victory. Brown Has<br />\nversity at Meet<br />\nTeachers' Field<br />\nWith Advertising<br />\nStrong Aggregation<br />\nLater reports from New<br /><br />\nJohns Hopkins has been invited<br />\nto send a medley relay team to the<br />\nMilrose games in New York City,<br />\nJanuary 30. The relay race will be<br />\none of the feature events of the<br />\nnight. Syracuse has already signified their intention to send a team<br />\nto compete, and Georgetown is considering the trip. Other well-known<br />\nuniversities may enter, but the race<br />\nwill be limited to a comparatively<br />\nsmall number of participants.<br /><br />\nAlthough the men who obtained<br />\nOn Saturday, February 16th,<br />\nWhen Hopkins meets Brown<br />\nYork City indicate that<br />\nGeorge Washington won the<br />\ntheir Bachelor of Engineering dethe Musical Club will present a con- University at Providence on Satmatch, with a score of 1867,<br />\ngree from the Johns Hopkins Encert at Winchester Hall, Frederick. urday, January 26, it will oppose<br />\nand Columbia came second.<br />\ngineering School last June comA complete tabulation has<br />\nThis concert will be the first Hop- one of the foremost swimming<br />\nnot been made, but with<br />\nposed a relatively small group,<br />\nkins undergraduate affair held for teams in the East. Brown, this<br />\nthese scores Hopkins takes<br />\nnumbering less than 40, their diyear, aspires for the intercollegiate<br />\nmany years in Frederick.<br />\nfourth place.<br />\nversity in selection of positions for<br />\nEarly in the fall many attempts crown, and likewise, has an exceltheir future work is as great as if<br />\nJohns Hopkins' rifle team car- were made to obtain a guarantee lent opportunity of obtaining it.<br />\nried off second place in the first for a concert in Frederick<br />\ntheir numbers, were far larger.<br />\nthrough :The boys from Providence have<br />\ndivision<br />\nof the shoot at New York Hood<br />\nNot all the graduates, however,<br />\nCollege and the public been successful in all of their dual<br />\nwho were given their diplomas at City last Saturday in the Eastern schools as a benefit for their<br />\nSends Championship Team<br />\nathlet- meets so far this year.<br />\nIntercollegiate Rifle Association<br />\nThe Hopkins Medley Team won the last commencement as yet<br />\nHopkins, on the other hand, is<br />\nmeet held at the Seventy-first Reg- ics. Finally it was decided to give<br />\nthe indoor championship of Anier- have seen fit to embark on their<br />\nexpected<br />\nto turn out one of the best<br />\na concert entirely under the Club's<br />\niment Armory.<br />\nica at the Johns Hopkins-Fifth life's work. One former student<br />\nThe Blue Jay team defeated New own management, since no guaran- combinations that has represented<br />\nRegiment Meet last year, in a close in the department of Electrical<br />\nYork University, Georgestown and tee could be realized. This scheme Homewood in quite a number of<br />\ncontest with Navy and Pittsburgh. Engineering is at present taking a<br />\nNorwich. M. I. T., of Boston, re- is<br />\ncarried out by many other col- years. That Hopkins has the punch<br />\nLast year's team was composed of motorcycle tour across the conticeived first place in the afternoon<br />\nlege clubs in giving concerts at was demonstrated when the Blue<br />\nBooth, Norwood, Dorcus and Aar- nent. After visting the principal<br />\nshoots with a score of 1806, while<br />\nJays handily defeated Swarthmore<br />\nonson. This year's team will prob- points of interest in the West, he<br />\nthe Jays got 1754. A second divi- Frederick, such as Gettysburg,<br />\nlast week by the score of 47 to 24.<br />\nably be the saline except that Clarke expects to return to Maryland via<br />\nsion shot at night and scores at Western Maryland, and the UniThe Quakers succeeded in winning<br />\nwill run the 220 in place of Aaron- the Panama Canal. Another man<br />\nthat shoot have not been received, versity of Maryland. Accordingly<br />\nonly one first place, the fancy dive.<br />\nson. Dorcus will run the quarter, from the same department has<br />\nand under the circumstances Hop- Winchester Hall, one of the downIt is regretted that Hopkins will<br />\nNorwood the half, and Booth the chosen for the field of his, endeavkins men do not know whether they town<br />\nnot<br />\nbuildings<br />\nenter the meet with its full<br />\nof<br />\nHood<br />\nCollege.<br />\nmile.<br />\nors the Near East, doing recon- still<br />\nhave second place, since there<br />\nAt present the team appears to struction work for the Society of<br />\nhas been rented for the affair and strength, due to the inability of<br />\nis a possibility that some other<br />\nWelch, star dash man, to compete.<br />\nbe in good shape. Booth is sure in Friends.<br />\nschool shooting in the second di- all plans for the concert have been<br />\nStevens, Bahlke, Calhoun and<br />\nthe mile, and Clarke will not be reSeven Men at Schenectady<br />\nvision might have entered a higher made.<br />\nSauerwein<br />\nplaced in the 220-yard dash. The<br />\nperforming for Hopkins<br />\nSeven men are now affiliated<br />\nNew Features on Program<br />\nContinued on page 4 col. 3<br />\nfor the first time performed very<br />\nother two places are being closely with the General Electric ComAbout sixty or seventy men, well against<br />\ncontested, for between Dorcus and pany in its plants at Schenectady,<br />\nSwarthmore. Stevens<br />\nBROWN HAS WIN OVER<br />\ncomposing the Glee Club, Banjo won the back stroke, Bahlke<br />\nNorwood, Heyn and Proctor. The N. Y., and this city, thus forming<br />\nwon<br />\nLEHIGH<br />\nClub, Novelty Clubs and the Blue the 220-yard swim and also swam<br />\nactual makeup of the team will de- the largest single group with any<br />\n\"Davy\" Jones and his Brown veton the relay team. Sauerwein<br />\npend on the condition of the men. one company. One graduate<br />\nis erans have one of the strongest ag- Jay Six, will make the trip. All<br />\nswam<br />\non the relay 'and Calhoun<br />\nGeorgetown Expected to Contest<br />\nbranches of the Club will start imconnected with a large steam tur- gregations in<br />\ncollegiate circles. In<br />\nplaced second in the fancy dive.<br />\nHopkins appears to be the pick bine plant in Wisconsin, while<br />\nanmediately after the examinations to<br />\nBrown wishes to eliminate the<br />\nof the East in Medley Relays. other is working for a similar firm a recent meet with Lehigh the<br />\nBrunonians captured every first work on new numbers for the con- plunge and<br />\nGeorgetown is the only close com- in Pennsylvania.<br />\nsubstitute another event<br />\nplace except the fancy diving, the cert. Many new features will ap- to be selected<br />\npetitor. If the 'Washington instiby Hopkins. This<br />\nThree members of last year's<br />\ntution enters a team the race will doing field work for the Baltimore identical trick performed by Hop- pear on the program at Frederick: would further injure the swimming<br />\nkins' natators last week at Swarthbe extremely close. Hopkins prob- and Ohio<br />\nRalph Townsend will give a nov- capacity of the team and it is<br />\nRailroad, having their more.<br />\nably has superiority in the 220, with location mainly in West<br />\nelty act; Wilson Shaffer will doubted if the Black and Blue<br />\nVirginia.<br />\nComparativ<br />\ne<br />\ntimes,<br />\na<br />\nbit<br />\ncoaches will agree to this proposisafer<br />\nClarke, and in the mile, with Verne In the Baltimore machine shops of<br />\ndance in connection with the nummeans<br />\nof<br />\nprediction<br />\nthan<br />\ncompartion. The lineup:<br />\nBooth; the Hilltoppers are usually the same company two mechanical<br />\nWell provided with material in the engineering graduates are at pres- ative scores in football, give ber of the Blue Jay Six; Cookman<br />\n200-yard<br />\nRelay — Sauerwein,<br />\nBrown an edge over Hopkins to- Boyd will give a xylophone solo; Dunning, Bahlke<br />\ntwo middle distances.<br />\nand Lord.<br />\nent performing testing work on<br />\nmorrow night.<br />\nScherr a saxophone solo; Light a<br />\nThis meet will serve as a prelim- materials of engineering.<br />\nFancy Diving— Calhoun and<br />\nAgainst Lehigh, Captain Jones violin solo; Sater a piano selection, Stone.<br />\ninary event for the Johns HopkinsEnter Governmental Service<br />\nwon the fifty and century events in<br />\nFifth Regiment Meet. At this time<br />\n50-yard Dash—Lord and SauerSeveral men have entered state the fast times of 24.2 and 55.2. and Hambleton will probably rena feature race between Hopkins and<br />\nwein.<br />\nand governmental work. Two of Lord, Hopkins' double winner, was der a guitar solo:<br />\nOther well-known teams, similar to<br />\nPlunge—Howard and Hamblethese became surveyors with State caught in 27.1 and 58.2 for the<br />\nThe Publicity Board is working<br />\nthat of last year, will be arranged.<br />\nton.<br />\nThe winner will again be. recog- Transit Commisioners. Another same distance in the Swarthmore in connection with the Club's man150-yard Backstroke — Stevens<br />\nis doing investigating work for meet.<br />\nager in properly advertising the and Hambleton.<br />\nnized as the Collegiate Champion<br />\nthe sanitary department of the<br />\nColes, of Brown, made a mark concert. Articles and pictures are<br />\nof America.<br />\n220-yard Swim—Bahlke.<br />\nUnited States.<br />\nof<br />\n1.11 1-5 in the 100 yard backCoach Le Cato and five men will<br />\n200-ya<br />\nrd Breast Stroke—Dunbeing placed in the Frederick paOther electrical engineering stroke in defeating Travis, of Lemake the trip to the Milrose games.<br />\nning<br />\nand<br />\nStevens.<br />\ngraduates have specialized in the high. Don Stevens, on the other pers. Posters and pictures of the<br />\n100-yard<br />\nDash — Lord<br />\nand<br />\nFLIVVERS PREDOMINATE ON telephone field and are employed hand took 1.27 to negotiate this Club will be placed in conspicuous Bahlke.<br />\nby the great telephone and tele- distance when he finished in front places throughout Frederick. A<br />\nCOLDEST DAY<br />\ngraph<br />\nsystems of the country. At of Stabler, Swarthmore.<br />\nnumber of the most prominent peoOn the coldest day of the year<br />\nFRESHMAN SMOKER ON<br />\nleast<br />\none<br />\nhave<br />\nman<br />\nappears<br />\nthe<br />\nto<br />\nMetzger, in his last start, swam ple of Frederick have been asked<br />\nWith the mercury playing hide and<br />\nFEBRUARY 15<br />\nseek with zero, Henry Ford's much potential prospect of great wealth, the 220 in 2.42, three seconds bet- to act as patronesses in order to inA<br />\nFreshman<br />\nSmoker is planned<br />\nPraised and much ridiculed product as he is actively engaged in the ter than Bahlke's time against the sure proper social backing of the for February 15. This date<br />\nwas<br />\nentertainment. The Glee Club is<br />\nknown universally as the \"flivver,\" \"oil game.\" A meter concern in Quaker team.<br />\nannounced<br />\nby<br />\nPresident<br />\nNiner<br />\nlast<br />\nPredominated on the Homewood Cleveland claims one graduate, The relay should be close with planning to broadcast over radio Thursday at a short class meeting.<br />\nCampus according to a census of while onother is engaged in elec- Brown holding a four second ad- station W EAR a few of its best Definite details have not been artrical testing for the Western vantage.<br />\nhits during the week before the<br />\nParked cars taken at lunch hour.<br />\nranged, but it is thought that the<br />\nElectric<br />\nCompany<br />\nin<br />\nChicago.<br />\nconcert.<br />\nCaptain<br />\nDunning,<br />\nof Hopkins,<br />\nHow many \"flivvers\" failed to<br />\ncost will be about a dollar and a<br />\nshould score a win over Reynolds<br />\nOnly One Teacher<br />\nHome Concert February 21<br />\nstart or how many of the Detroit<br />\nquarter a person. Niner urged all<br />\nprides were stranded on the road<br />\nThe teaching profession appears and Maitland, of Brown, in the<br />\nAs this is the last concert to be who have any talent to help in the<br />\nIs not known, but it is certain that to have been less popular than was breast stroke.<br />\nheld before the annual home con- entertainment, and all others to supat the zero hour of a zero day there formerly the case, but one man<br />\ncert at the Maryland Casualty Club port with their presence, for the<br />\nWere twelve Fords parked at vari- having cast his lot in this field. He<br />\nHouse on February 21st, every ef- smoker is the first event of that naSWIMMING MEET<br />\nous parts of the campus. The is at present an instructor in the<br />\nfort is being made to insure the ture which the class has attempted.<br />\nTickets for J. H. U. vs. CathBuick and the Chevrolet vied for engineering department of a large<br />\nsuccess of this entertainment, so<br />\nOne of the main features of the<br />\nolic U. Swimming Meet on<br />\nsecond honors, four of each being Eastern university. Several men<br />\nthat the Club may enjoy a good rep- smoker will be the awarding of<br />\nFeb. 9 at B. A. C., now on<br />\nhave, however, remained at Hoptabulated.<br />\nutation at its big finale. It is numerals to the class football team,<br />\nsale at A. A. Office, PostofTwelve other makes were listed, kins for further research in their<br />\nhoped that a number of students and the presentation of a gift to<br />\nfice, at Buck Bonner's, or<br />\neach make having but one repre- professions. Two electrical engiwill make the trip to Frederick Coach Landy. Landy gave the<br />\nfrom members of the swimsentative. They were: Chandler, neers are at present enrolled in the<br />\nwith the Club. Those wishing to do team a lot of his time last fall, and<br />\nrn;ng team.<br />\n1)odge, Briscoe, Maxwell, Essex, graduate department, while an<br />\nso may receive special bus rates by a committee consisting of Stone,<br />\nman has chosen research<br />\nMarmon, Hudson, Westcott, Chalgetting in communication with Meredith and Levy is hard at work<br />\nAdmission $1.00 for sinnlers, Davis, Studebaker, and Jor- work in physics for his post-grad\"Mike\" Tilghman, manager of the selecting a suitable token expressive<br />\ngle ticket; $1.50 a couple.<br />\ndan.<br />\nuate work.<br />\nClub.<br />\nof the gratitude of the class.<br /><br />\nTHE JOHNS HOPKINS NEWS - LETTER, JANUARY 25, 1924<br /><br />\n2<br /><br />\nELECTRICAL<br />\nCLUB<br />\nDIS- engineering departments into closCUSSES FEATURES OF<br />\ner union and to bring the Hopkins<br />\nEngineering School before the<br />\nCIRCUIT BREAKERS<br />\neyes of the public.<br />\nClinton White Addresses Club at<br />\nFOUNDED 1897<br />\nRegular Meeting<br />\nNothing further will be done in<br />\nA lengthy discussion on the the- arranging for the Engineering<br />\n$2.00<br />\nSubscription<br />\nory and operation of hand-operat- Show until after the examinations.<br />\nIn the meantime, however, all<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at ed and magnetic circuit-breakers<br />\nengineering<br />\nstudents have been<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nwas the feature of the Electrical<br />\nthink<br />\nup stunts that can<br />\nto<br />\nasked<br />\nClub meeting held last Friday evebe used in the show.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nning. Clinton W. White, a senior<br />\nHopkins University.<br />\nAt the next Electrical Club<br />\nin the Electrical Engineering meeting, which will be held imBusiness communications should be addressed to the BUSINESS MAN- School, gave a long talk on the mediately after the examinations,<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications subject, illustrating it with nuthe final arrangements will be anshould be sent to the MANAGING EDITOR.<br />\nmerous lantern slides. Much at- nounced and the stunts will be astention was devoted to the meth- signed to particular members.<br />\nTelephone<br />\nHomewood 100 ods of testing the various oil-immersed circuit breakers. The new<br />\nThe new chauffeur was extrememagnetic release safety switches<br />\nEditor-in-Chief<br />\nBusiness Manager<br />\nIn fact, his mistress<br />\nreticent.<br />\nJOSEPH LEOPOLD, '24<br />\nPHILIP W. HOWARD, '25<br />\nadopted by the Baltimore Consolibashful.<br />\nthought<br />\nhim<br />\ndated Gas, Electric, Light and<br />\nManaging Editor<br />\ntell me your last<br />\nAdvertising<br />\nManager<br />\nyou<br />\n\"Won't<br />\nWILLIAM G. DEAN, JR., '24<br />\nPower Company were also disA. J. MCKAY,'26<br />\nname,<br />\nJohn?\"<br />\ncussed at length.<br />\nAssistant Managing Editor<br />\n\"No'm; just call me John.\"<br />\nElectrical Display Planned<br />\nT. REESE MARSH, '24<br />\nCirculation Manager<br />\nFollowing this, Clinton C. Rec- \"Well, may I know what your<br />\nJOHN C. LEWIS, JR., '24<br />\nAssociate Editors<br />\ntor announced the plans of the so- last name is?\"<br />\nRICHARD C. TILGHMAN, '25<br />\nAssistant Business Managers<br />\nJOHN W. PARSONS,'25<br />\nciety for an electrical show to be \"No'm; you'd better not.\"<br />\nBENJAMIN T. ROME,'25<br />\nD. MILES MARRIAN,'25<br />\nheld .some time in March. This \"I insist upon calling you by<br />\nCHARLES G. HUTZLER, '24<br />\nG. DONALD GIESKE,'25<br />\nwhich has the backing of your last name!\"<br />\nshow,<br />\nJOHN T. DIXON,'24<br />\nJunior Editors<br />\nentire<br />\nengineering faculty, is \"All right, then. Call me Darthe<br />\nEUGENE<br />\nTOVELL,'24<br />\nC.<br />\nARTHUR L. NELSON, '26<br />\nERNEST A. STRATHMAN, '26<br />\nOTHO J. KELLER, III, '26<br />\nexpected to establish new tradi- ling.\"—Co/unins.<br />\nALGER G. HISS, '26<br />\nJ. JACKSON KIDD, '26<br />\ntions for the Hopkins EngineerEDWARD 0. MICHEL, '26<br />\nT. STRAN SUMMERS, '25<br />\nJAMES YOUNG, '25<br />\ning School. The publicity which<br />\nSuitor—Mr. Perkins, I have<br />\nHEYWARD E. BOYCE, JR., '27<br />\nHENRY R. TURNBULL, '26<br />\nthis display is certain to attract courted<br />\nHAROLD S. GOODWIN, '26<br />\nyour daughter for fifteen<br />\nwill, however, benefit not only the<br />\nyears.<br />\nEngineering Departments but also<br />\nPerkins—Well, what do you<br />\nMember Southern Intercollegiate Newspaper Association<br />\nthe entire school.<br />\nwant?<br />\nA committee composed of memSuitor—To marry her.<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nbers of all the engineering dePerkins—Well, I'll be damn. I<br />\npartments, has worked up a num- thought<br />\nyou wanted a pension or<br />\nber of stunts for the show. It con- something.—Puppet.<br />\nHOMEWOOD, BALTIMORE, MD., JANUARY 25, 1924<br />\nsists of J. V. Alfrend, chairman;<br />\nEdward Shower and Ferdinand<br />\nHamburger, of the Electrical DeAn army surgeon was examining<br />\npartment; William North Crout, a cow-puncher recruit.<br />\nOUR HONOR SYSTEM<br />\nof the Civil Engineering Depart- \"Ever had any accidents?\"<br />\nWe are surprised at the number of editorials that are appearing<br />\nment, and J. Edward Mount, of<br />\nin undergraduate publications of other colleges urging the student<br />\nthe Mechanical Engineering De- \"What's that bandage on your<br />\nbody to unite in placing the Honor Code on a working basis and \"to partment.<br />\nhand?\"<br />\nreduce cheating in examinations to a minimum.\" The thought of<br />\nAt numerous colleges engineer- \"Rattlesnake bite.\"<br />\nmaking such an apeal has never occurred to us. Johns Hopkins ing shows of similar nature are \"Dont you call that an accident?\"<br />\nseems to be somewhat unique in the fact that it has an Honor System held during the festivities preced- \"Naw ; the dam' thing did it on<br />\ning graduation. In fact, in some purpose.\"—Yale Record.<br />\nestablished \"on a working basis,\" and we feel that any request to<br />\nschools the engineering show and<br />\n\"reduce cheating in examinations to a minimum\" would be misplaced.<br />\nthe other functions attendant upon<br />\nConstable—Eighteen years old,<br />\nTo state that \"the Honor System at Johns Hopkins has estab- it are as important as the June<br />\neh?<br />\n'Pears to me ye look mighty<br />\nWeek<br />\nactivities<br />\nat<br />\nHopkins.<br />\nare<br />\nlished for itself a unique and enviable record\" is putting the case<br />\nThe Electrical Clubs' show, how- young fer yer age, mister.<br />\nmildly. Few are the undergraduates who have seen any evidence<br />\never, is being arranged not to com- \"Yes, sir. If you please, sir, I've<br />\nof \"cribbing\" during their college course. The matter of honor has<br />\npete with June Week but only to always taken the best of care of<br />\nbeen placed in the hands of the undergraduate body and the under- bring the members of the various myself.\"—Life.<br />\ngraduate body has responded nobly. The Honor System assumes<br />\nthat every man is a gentleman; the students have proved, beyond a<br />\nshadow of a doubt, that every Hopkins man is a gentleman.<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\nWe are proud of our Honor System, and we are proud of Hopkins. This is not meant, however, to be merely an euolgy. Its purpose is to inform members of the Freshman Class, who are taking<br />\nHopkins examinations for the first time, that the Honor System is not<br />\nonly a name but an established fact. We are certain that the Class<br />\nof 1927 will enter into the spirit of the \"Code\" and will be as proud<br />\nof it as we are.<br />\nWe have always said that the time-honored greeting should<br />\nchanged to \"A Merry Christmas and Happy Mid-Years.\"<br /><br />\nbe<br /><br />\nTHE SWIMMERS<br />\nThe swimming team, along with other minor sport organizations,<br />\nis laboring under enormous difficulties. The financial support given<br />\nby the athletic budget is insufficient; the team is practicing without<br />\nthe services of a coach; lack of a pool at Homewood necessitates<br />\nirregular practice hours; the already limited squad is constantly<br />\nthreatened by a malignant and unmerciful black list.<br />\nIn spite of the obvious difficulties, the team opened its season<br />\nlast week with a victory, defeating the Swarthmore mermen by a<br />\ndecisive margin. A difficult schedule is still ahead of' the Hopkins<br />\nmen but we are assured of a good showing.<br />\nThe members of the swimming team are to be commended for<br />\ntheir efforts and for their spirit. An excelent way of showing our<br />\nappreciation is by supporting the home meets.<br />\nThe News-Letter wishes to announce the election of Mr. Charles<br />\nG. Hutzler, '24, to the position of associate editor.<br /><br />\nFr,<br />\nDamon—<br />\n\"What was the matter<br />\nwith Professor Henry this<br />\nmorning? I've never seen<br />\nhim so peeved. He seemed<br />\nto be boiling over.\"<br /><br />\nPyThias—<br />\n\"Boiling over is good. He<br />\nwas. Didn't you notice<br />\nwhy? The old boy had mislaid his Eldorado pencil.\"<br /><br />\nriIDvEZIX....<br />\nolg<br />\nirirt<br />\n' 0<br />\nI:AOHAU<br />\n\"the masterdrawingpencil\"<br />\n17 leads—all dealers<br /><br />\nMAJOR RIELY GIVES LECTURE ON HYGIENE AND<br />\nSANITATION TO<br />\nR. O.T. C.<br />\nThe Department of Military<br />\nScience has inaugurated a new<br />\npolicy in the lectures being given<br />\non Hygiene and Sanitation. Last<br />\nMonday, Major Charles Riely,<br />\ncommander of the R. 0. T. C. at<br />\nthe Medical School lectured on<br />\nthese topics to the Sophomore and<br />\nSenior members of the unit. In<br />\nformer years the officers of the<br />\nstaff conducted classes on these<br />\nsubjects, but the department has<br />\ndecided that experts only should<br />\nteach them, so Major Riely was<br />\nsecured to give the lectures.<br />\nMajor Riely spoke on the general aspects of Military Hygiene<br />\nand Sanitation. This was followed<br />\nby a practical demonstration of<br />\nFirst Aid work by the Major and<br />\ntwo Medical Corps assistants.<br />\nVarious splints, bandages and<br />\nother First Aid Devices were put<br />\nupon one of the men until he resembled a mummy. Demonstration of the Medical Corps field kit<br />\nMajor<br />\nand stretchers followed.<br />\nRiely concluded with a short discourse on snake bites, at the request of Lieutenant Sherwood.<br />\nMajor Riely will conduct a practical exercise today, at which students will be given an opportunity<br />\nto practice bandage work and the<br />\nmethods of resuscitation. The lectures are supplemented by talks<br />\non the same subjects by Lieutenant Sherwood.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 25, 1924<br />\nDR. PAUL PELIOT TO SPEAK<br />\nON HISTORY OF RELIGIONS NEXT MONTH<br /><br />\n3<br /><br />\nMORE ABOUT \"DRINKING IN<br />\nTHE COLLEGES\"<br />\n(From New York Times)<br />\nFrench Professor on Tour of American<br />\nEver since the Volstead act deUniversities. Famous for Archaeofined the Eighteenth Amendment,<br />\nlogical Work in Orient<br />\nthe college authorities have been<br />\nDuring February, on the fifth,<br />\nseventh, twelfth, and fourteenth,<br />\nin a quandary what to do about it.<br />\n13 SOUTH ST.<br />\nDr. Paul Peliot, professor of ChiNaturally it is difficult to obtain<br />\nnese civilization at the College of<br />\nHopkins swimmers scored a vic- precise data regarding the extent<br />\nOrganized l864<br />\nFrance, will speak here on the his- tory over<br />\nJohn J. Nelligan, President<br />\nSwarthmore last Satur- to which the act is violated in the<br />\ntory of religions.<br />\nday, when they emerged winner in colleges, but information from<br />\nProfessor Pelliot, who is making<br />\na tour of the eastern and mid-west- all but one event. Stevens, Bahlke Harvard, Princeton and Yale, toThe Greetings of a Fine Store<br />\nern parts of the United States un- and Calhoun are new talent who gether with reports from other<br />\nder the auspices of the American performed well in the meet. Lord seats of learning, indicates that the<br />\nTo the Students of a Fine University<br />\nCommittee for Lectures on History won individual honors when he effect seems to have been to drive<br />\nmany students from the comparaof Religions, will deliver six ad- came through in<br />\nthe 50 and 100tive<br />\nmoderation of the last decade.<br />\ndresses at Columbia and, besides<br />\nyard dashes. He also swam on the<br />\nPrior<br />\nto the Volstead act the<br />\nJohns Hopkins, will lecture at Lowwinning relay team.<br />\ncolleges<br />\nhad their own code reell Institute, Yale, Oberlin, Univer*<br />\ngarding<br />\n*<br />\n*<br />\ndrink.<br />\nIt was forbidden<br />\nsities of Pennsylvania, Michigan,<br />\nto<br />\nbring<br />\nintoxicants<br />\ninto univerFrank J. Sullivan, coach of the<br />\nIllinois and Wisconsin.<br />\nsity<br />\nDrunkenness,<br />\nbuildings.<br />\nif<br />\nDr. Peliot comes to America at Princeton swimming team, is spona time when interest in archaeolog- soring a movement to hold a Na- public, was \"conduct unbecoming<br />\nical research has reached its high- tional Collegiate Swimming Meet. a scholar and a gentleman.\" Moreest degree, and also at a period The meet would be held under the over, the man who was publicly<br />\n.WW:Corneravelie and gutaw Sts.<br />\nwhen Central Asia is becoming of auspices of the N. C. S. A., it was intoxicated lost caste with his felows.<br />\nThey<br />\nmade<br />\na<br />\nnice<br />\ndistincdecided<br />\nby<br />\nthe<br />\nN.<br />\nC.<br />\nA. A. at their<br />\never increasing importance, even<br />\n-Where Wholesale and Retail Districts Meet'.<br />\nbeginning to rival Egypt in this recent meeting in Atlanta. The tion between the celebration of<br />\nmeet this year will probably be football victories, club elections<br />\nfield.<br />\nheld at Columbia on April 5. The and the like, and real addiction to<br />\nWorked in Turkistan<br />\ndrink. This state of affairs was<br />\nThe scene of Dr. Peliot's most N. C. S. A. is trying to gain recculmination of fifty years of<br />\nthe<br />\nimportant work was in Chinese ognition of the meet by the AmerCollege and Fraternity Stationery<br />\ngrowing<br />\nmoderation. The old days<br />\nTurkestan, where the extremely ican Olympic Association so that<br />\nBanquet and Dance Cards, Invitations<br />\nerh<br />\nwhen the few men were drunkards<br />\narid climate and the ever advanc- it may act in the future as an ofJAS. H. DOWNS<br />\n11<br />\nN. HOWARD ST.<br />\nand the many teetotalers were<br />\ning desert have preserved a vast ficial trial for the American OlymENGRAVER<br />\nAgents for All Leading Makes<br />\nPRINTER STATIONER<br />\nyielding to an almost European<br />\namount of ancient manuscripts and pic team.<br />\nof Instruments<br />\n229 N. CHARLES ST.<br />\n* * *<br />\npractice.<br />\narticles suitable for study when<br />\nCREDIT CHEERFULLY<br />\nThe Intercollegiate Basketball In 1919 drinking rather than<br />\nunearthed.<br />\nA. JACOBS &amp; SONS<br />\nLeague is well under way. Each drunkenness became the social ofThe famous archaeologist was<br />\nTailors<br />\nof the six teams—Columbia, Yale, fense. The result was a rapid<br />\nbrought to America by the Amerswing<br />\nback<br />\nfrom<br />\nthe<br />\nattitude<br />\nthat<br />\nCornell, Dartmouth, Pennsylvania,<br />\nUniforms and Liveries<br />\nican committee for lectures on the<br />\nand Princeton—have lost one man might drink, but owed re128<br />\nW. FAYETTE ST.<br />\nhistory of religions, of which ProNear Liberty St.<br />\nBaltimore, Md.<br />\ngame. Columbia has won two and spect for his fellows in the matter<br />\nfessor Richard Gottheil, head of<br />\nconduct,<br />\nof<br />\nboyish<br />\nto<br />\nthe<br />\npoint<br />\nof<br />\nall the other teams have won one<br />\nthe Oriental department at Columview that intoxication was a joke,<br />\nexcept<br />\nPrinceton,<br />\nwho<br />\nonly<br />\nhas<br />\nLIBERTY ST.<br />\nbia University, is president, and<br />\nplayed one game to date. The com- not on one's self, but on the law.<br />\nDr. Lucius C. Porter, head of the<br />\nAT SARATOGA<br />\npetition this year is exceptionally The sense of personal responsibildepartment of Chinese at the same<br />\nclose, and any team may win the ity was miraculously shifted from<br />\nLUNCHEON<br />\nuniversity is secretary.<br />\nchampionship, which Yale won last the individual to the law, and the<br />\nTEA<br />\nSix Lectures at Columbia<br />\nyear. Princeton plays two games result has been occasional deDINNER<br />\nThe longest series of addresses this week, meeting Yale at Prince- bauches in the universities.<br />\n29 E. BALTIMORE ST.<br />\ndelivered by Dr. Peliot will be at ton and Cornell at Ithaca. These<br />\nNo college president can stand<br />\nAgents for JOHN B. STETSON HATS 11.30 A. M.<br />\nSPECIAL PARTIES<br />\nColumbia University, where he are the only league games sched- by and allow his students to acand FRATERNITY BANDS<br />\nuntil<br />\nwill give six lectures in the month uled this week.<br />\ncustom themselves to excess, but<br />\n7.30 P. M<br />\nPLAZA 6987<br />\nof February. In April he will parwhat action can he take? At<br />\n* * *<br />\nticipate in the annual meeting of<br />\nPrinceton, Harvard and -Yale,<br />\nthe American Oriental Society at In the Missouri Conference, where drinking has perhaps deColumbia, and during the same Washington and Kansas are tied clined, drunkenness has apparentmonth he will give a special series for the lead, neither having beep ly increased. Yet what drinking is<br />\nof talks before the Columbia de- defeated. Other conference quints done is done under cover. At Harhave lost at least two games. In<br />\npartment of Chinese.<br />\nvard the authorities bestir themthe Big Ten basketball race, WisThe setting of most of the adselves to action—invariably expulconsin and Michigan are tied,<br />\ndresses delivered by the famous<br />\nsion — when an undergraduate<br />\nneither having lost a game.<br />\narchaeologist at Hopkins will be<br />\nawakens in the morning to find his<br />\n* * *<br />\nTurkestan, where Dr. Peliot has<br />\nname in the papers. The test is<br />\npenetrated far inland in his search<br />\nJoie Ray, Chicago taxicab driver, avoidance of publicity.<br />\nfor human history. The lecture won the mile run in the Fordham<br />\nAt Yale, the sitation is slightly<br />\nwill be public and will not require games last Saturday night. In the complicated. President Angell atcards of admission. The French same meet Bob McAllister, the tempted to make the Student<br />\nprofessor will probably display an \"flying cop,\" equalled his own Council take up the problem of<br />\nelaborate assortment of slides, world's record for 120 yards in- undergraduate drinking, but his<br />\nHE Remington Portable Typewriter carWhich he has accumulated during doors in a heat, but collapsed and manoeuvre met with unfortunate<br />\nhis archaeological research work in could not enter the finals.<br />\nresults. In addressing the freshries its table on its back. You can use it<br />\nmany sections of the Orient.<br />\nman class he announced that exanywhere—at any time.<br />\n* * *<br />\nSubject New to Hopkins<br />\npulsion would follow the detection<br />\nIt is a complete typewriter with four-row<br />\nThe Hopkins Medley Relay<br />\nof any violation of the rule forbidThe subject of Prof. Peliot's lecTeam will run in New York on<br />\nkeyboard—just<br />\nlike the big machines. Also<br />\nding liquor in university buildings,<br />\ntures is a novel one at this UniverJanuary 30 at the Milrose games.<br />\nother<br />\nuseful<br />\nmany<br />\nfeatures of the office typeand incidentally of the Volstead<br />\nsity. There is no record at the<br />\nBooth and Clarke are a combinalaw. This decision utterance puts<br />\nRegistrar's Office of any course in<br />\nwriter. Yet it is small, compact, and fits in a<br />\ntion that will be hard to beat, no<br />\nthe issue clearly and no future ofComparative Religion, the History<br />\ncase only four inches high.<br />\nmatter who the other members of<br />\nfender will have just cause for<br />\nof Religion, or similar courses.<br />\nthe relay will be. Dorcus and NorPrice,complete with case,$60<br />\ncomplaint. Indeed, it would seem<br />\nHeretofore Philosophy and Ethics<br />\nwood will probably be selected by<br />\nthat the only way in which the colCourses have given students their<br />\npayment terms ifdesired<br />\nEasy<br />\nCoach Jimmy Le Cato.<br />\nonly opportunity for such knowllegiate public can be wooed from<br />\n* * *<br />\nedge. It is believed, therefore, that<br />\nviolating an unpopular ordinance<br />\nmany students will take advantage<br />\nWhere will the Army-Navy foot- will be by unhesitating use of<br />\nof this chance to hear a renowned ball tilt be staged next fall? This power, even at the cost of tradischolar's treatment of this topic. is a question which is still unset- tions of personal liberty.<br />\ntled. New York will not be the<br />\nRook—I would like to try out scene of the service conflict. That ment stadium is doomed, we underfor the dramatic society here on the much is definitely known. Rumor stand, and the Clarke Griffith stadiRemington Typewriter Co.<br />\ncampus.<br />\nhas it that Philadelphia and Wash- um (American League Baseball<br />\nSoph--Have you had any experi- ington are being considered. Wash- Park) is unsuitable. Maybe Bal25 W. Fayette St.<br />\nence?<br />\nington probably won't get the game timore will still be considered and<br />\nBaltimore<br />\nRook—Oh, my yes, I had my leg because of the lack of a suitable get the preference over Philadelin a cast once.—Orange Owl.<br />\nstadium. The proposed govern- phia.<br /><br />\nMID-WINTER<br />\nSPORTING<br />\nBUNK<br /><br />\nSafe Deposit &amp; Trust Co.<br />\nOF BALTIMORE<br /><br />\nHOCHSCHILD,KOHN 8c Co.<br /><br />\nre\"<br /><br />\nry<br /><br />\nst<br /><br />\nat<br />\n)n<br />\nid<br />\nfn<br />\n[le<br />\nse<br />\nas<br />\nid<br />\nas<br /><br />\nIC<br /><br />\nof<br />\nid<br />\n:s.<br />\nid<br />\nut<br />\nea:it<br />\n)r<br />\nse-<br /><br />\nc-<br /><br />\n:y<br />\nle<br />\nccs<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br /><br />\nA.<br /><br />\nURDWISE<br />\n134LTIMORE'S HUSTCAL INSTRUMENT m3U5E<br /><br />\nUse It<br />\nAnywhere!<br /><br />\nT<br /><br />\nRemington<br />\nPortable<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 25, 1924<br />\nSCHEDULE OF UNDERGRAD-<br /><br />\nFebruary 4<br /><br />\nSHIRT MAKER<br />\nUATE EXAMINATIONS,<br />\n226 N. Liberty St.<br />\nDress Shirts...$3.00, $3.50 and $4.00<br />\nJAN.28 to FEB.5<br />\n$3.30 and $4.40<br />\nNegligee<br />\nThere will be one session a day<br />\n$5.50 and $6.60<br />\nImported Madras<br />\nTerms Cash, Less 10% 30 days on Shirts (except where indicated), beginAlso a Full Line of Men's<br />\nning at 9 A. M. The time allotted<br />\nFurnishings<br /><br />\nSTRATTON<br /><br />\nALWAYS USE A<br /><br />\nYELLOW CAB<br />\nOR PHONE<br /><br />\nVERNON 1212<br />\nHAIL THEM ANYWHERE<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\nLimited<br /><br />\nBARN CAFETERIA<br />\nORDERS RECEIVED FOR<br /><br />\nCOGGINS'<br />\nTransfer &amp; Baggage Express<br />\nAUTOMOBILE SERVICE<br />\nPHONE, HOMEWOOD 6886<br /><br />\nEdv. Elect. and<br />\nMagnetism<br />\nM. E. 201<br />\nBiology 3 (Zoology) G. 113<br />\nChemistry 2<br />\nC. E. 120<br />\nFrench Elements<br />\n(M. T. 8:30 sec.)<br />\nG. 312<br />\nFrench 1 (Prof.<br />\nLancaster)<br />\nG. 112<br />\nis as follows: in a three or four- French<br />\n1 (Mr. Beall) G. 311<br />\nhour course, three hours; in a two- French 1 (Mr. Ware) G. 314<br />\nFrench 1 (Dr. Van<br />\nhour course, two hours.<br />\nRoosbroeck)<br />\nG. 205<br />\nFrench 4<br />\nG. 310<br />\nGerman Elements<br />\nJanuary 28<br />\n(M. T. 8:30 sec.)<br />\nMain Lib. N.<br />\nEnglish Lit. 6<br />\nMain Lib. N. Math. 4<br />\nG. 2<br />\nBiology 1<br />\nG. 112<br />\nMath. 6<br />\nG. 8<br />\nElectrical Neasts<br />\nM. E. 104<br />\nMain Lib. S.<br />\nPolitical Econ. 13<br />\nFrench 1B (M. T.<br />\nRailroad Engineer.<br />\nC. E. 307<br />\nW. 11:30 sec.)<br />\nG. 312<br />\nSurveying (all sec.)<br />\nC. E. 210<br />\nGeology 2<br />\nC. E. 5<br />\nTheory of Structures C. E. 115<br />\nGerman El (M. T.<br />\nW. 11:30 sec.)<br />\nMain Lib. S.<br />\nFebruary 5<br />\nGerman 1<br />\nG. 313<br />\nHistory 4<br />\nG. 310<br />\nBiology 2<br />\nG. 11<br />\nItalian El<br />\nMain Lib. N. English Comp. 2<br />\nG. 313<br />\nLatin 1 (Livy)<br />\nG. 108<br />\n,Ierman El (W. Th.<br />\nMaterials of Eng.<br />\nF. 8:30 sec.)<br />\nMain Lib. N.<br />\n(both sec.)<br />\nM. E. 109-110 Greek El.<br />\nMain Lib. S.<br />\nMath. 2 (Prof. Cohen) G. 8<br />\nHebrew El.<br />\nG. 100<br />\nMath. 2 (Prof.<br />\nHistory 2<br />\nG. 112<br />\nHulburt)<br />\nG. 2<br />\nPolitical Econ. 1<br />\nMath. 2 (Dr. Nelson) G. 100<br />\n(Prof. Weyforth)<br />\nM. E. 110<br />\nMath. 1B (Prof.<br />\nPolitical Econ. 1<br />\nMurnaghan)<br />\nM. E. 217<br />\n(Dr. Mitchell\"<br />\nG. 312<br />\nMath. 1B (Mr. Moore) M. E. 202<br />\nPolitical Econ. 1<br />\nMath. 01B (Mr.<br />\n(Mr. Gillies)<br />\nG. 314<br />\nPatterson)<br />\nM. E. 114<br />\nPolitical Science 1<br />\nG. 311<br />\nPhysics 2<br />\nM. E. 204<br />\nPhilosophy 2<br />\nG. 113<br />\nPolitical Science 4<br />\nRIFLE TEAM WINS SECOND PLACE<br />\nG. 314<br />\nPsychology 1<br />\nG. 311<br />\nAT E. I. R. A. MEET<br />\nSan. Engineering<br />\nC. E. 307<br />\nContinued from page 1<br />\nSpanish Elements<br />\n(Dr. Williams)<br />\nG. 205<br />\nscore than that established in the<br />\nJanuary 29<br />\nChemistry 1B<br /><br />\nThe Flag, Banner &amp; Pennant Shop Elements of E. E.<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br /><br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBaltimore<br /><br />\nFrench 2<br />\nEnglish Lit. 1<br />\nEnglish Lit. 7<br />\nGeology 3<br />\nGerman 4<br />\nGreek 4<br />\nHistory 5<br />\nMath. 1A (Dr.<br />\nMusselman)<br />\nMath. 1A (Mr.<br />\nLinker)<br />\nMath. 01 (Dr. Nelson)<br />\nPhilosophy 1<br />\nPolitical Econ. 12<br />\nPolitical Econ. 8<br />\nPower Plant Calc.<br /><br />\nM. E. 109<br />\nM. E. 110<br />\nG. 312<br />\nG. 112<br />\nMain Lib. N.<br />\nC. E. 202<br />\nG. 310<br />\nMain Lib. S.<br />\nG. 311<br />\nG. 2<br /><br />\nG. 8<br />\nG. 100<br />\nG. 113<br />\nG. 314<br />\nG. 313<br />\n(Drafting<br />\nRooms)<br />\nReinforced Concrete<br />\nC. E. 307<br />\nAfternoon (2-4 P. M.)<br />\nGreek Lit.<br />\nG. 108<br />\nJanuary 30<br /><br />\nA. C. Theory<br />\n(Prof. Lee)<br />\nM. E. 201<br />\nApplied Mechanics<br />\nEstablished 1873<br />\nM. E. 109-110<br />\n(all sections)<br />\nAccounting 1<br />\nG. 314<br />\nA. H. FETTING MAN'FG<br />\nBiology 3 (Botany)<br />\nG. 112<br />\nJEWELRY CO.<br />\nFrench 3<br />\nMain Lib.<br />\nManufacturers<br />\nFrench 5<br />\nG. 311<br />\nGreek Letter Fraternity Jewelry<br />\nGreek Intermediate<br />\nG. 100<br />\nC. E. 105<br />\n213 N. LIBERTY ST., Baltimore, Md. Geology 4<br />\nHeat Trans.<br />\nM. E. 117<br />\nHeat Engines (all<br />\nsections)<br />\n:i4,v,iv4,0iTilrrlizi,NiF-41Hh4101i144.0.0.0:4,1K14}1014,1101011410I11<br />\nC. E. 120<br />\nLatin 2<br />\nG. 113<br />\nPublic Speaking 2<br />\nG. 312<br />\nPsychology 2<br />\nMain Lib. N.<br />\nAfternoon (2-5 P. M.)<br />\nSpanish 2<br />\nMain Lib. N.<br />\nLatin 2<br />\nMain Lib. S.<br /><br />\nS.<br /><br />\niNOTOM OEM<br />\nThe King of Lubricants\"<br />\nSHERWOOD BROTHERS, INC.<br />\n(KEENKEN<br /><br />\nFu FitElEfetlieleateee;eeoioD qi•:4<br /><br />\nBoys, the place to get your<br />\nmeals—and they are honest-to-goodness meals, well<br />\nserve d, and reasonably<br />\npriced—is at<br /><br />\nThe St. REGIS<br />\nRESTAURANT<br />\n1817 N. Charles St.<br />\n(Half Block below North Ave.)<br /><br />\nNicholas Brown, Mgr.<br /><br />\nFor<br />\nGENERAL<br />\nUSE<br /><br />\nFor<br />\nFOUNTAIN<br />\nPENS<br />\nManufactured by<br /><br />\nWIGHT &amp; HUMPHRIES<br /><br />\nFebruary 1<br />\nA. C. Theory<br />\n(Mr. Lampe)<br />\nChemistry 1A<br />\nElectric Railways<br />\nEnglish Lit. 2<br />\nFreshman Introductory<br />\nGeology 1<br />\nGerman 5<br />\nHistory 1<br />\nLatin (Cicero &amp;<br />\nVirgil)<br />\nMath. 3 (M. T.<br />\n9:30 sec.)<br />\nPolitical Science 2<br />\nPsychology 3<br />\nSpanish El. (Mr.<br />\nNoble)<br />\nSpanish 1<br />\nStructural Engineer.<br /><br />\nM. E. 104<br />\nC. E. 120<br />\nM. E. 201<br />\nG. 314<br />\nG. 113<br />\nC. E. 5<br />\nMain Lib. N.<br />\nG. 305<br />\nG. 108<br />\nG. 2<br />\nG. 311<br />\nG. 312<br /><br />\nMilitary Science<br />\n1st year basic<br />\n2d year basic<br />\n1st year adv.<br />\n2d year adv.<br />\nDynamics of Mech.<br /><br />\nC. E. 120<br />\nS. Loft<br />\nN. Loft<br />\nM. E. 120<br /><br />\nPRMTERS<br /><br />\nBiniYE.us<br /><br />\nColiele Literature<br /><br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\naexfteztoVitecie-<br /><br />\nA CLARK ALUMNUS OFFERS<br />\nINFORMATION<br />\nTo the Editor of the Johns Hopkins News-Letter:<br /><br />\nStrange!<br /><br />\nVaseline<br />\n.S. PAT<br /><br />\nHAIR TONIC<br /><br />\nMfg.Co.<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n41 Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n:<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nDECORATIONS<br /><br />\nFURNITURE<br /><br />\nThe famous detective arrived at<br />\nthe scene of the crime.<br />\n\"Heavens,\" he said, \"this is more<br />\nserious than I thought. This window has been broken on both sides.\"<br />\n—Co/unts<br /><br />\nDRAPERIES<br /><br />\n343 NORTH CHARLES STREET<br /><br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\nCo-Ed—You know, I didn't ac-<br /><br />\ncept Claude the first time he proposed.<br />\nFriend—I guess you didn't. You<br />\nweren't there.—Whirlwind.<br /><br />\nAt the<br /><br />\nWashington Monument<br />\nOscar Thomas Olson, D.D.<br /><br />\nMinister<br />\n1—I hear your town is strong<br />\nfor the Ku Klux.<br />\n2—Well, I should say! Even the<br />\nrain comes down in sheets.—Texas<br />\nRanger.<br /><br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br />\nThe purpose and program of th:s<br />\nChurch will appeal to you. Look in<br />\non the Sunday afternoon -At Home<br />\nfrom five to seven.<br /><br />\nMain Lib. S.<br />\nCapt.—Boys, the boat is sinking.<br />\nMain Lib. N.<br />\nIs<br />\nthere any one here who knows<br />\nC. E. 307<br /><br />\nFebruary 2<br /><br />\nETIGRAUERS<br /><br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, But Shoulder the Responsibility<br /><br />\nThe profound ignorance of certain Hopkins students, who take<br />\nPrinters of<br />\nit upon themselves to desseminate<br />\ncrhe Johns Hopkins<br />\nknowledge to their fellow students<br />\nNE1DS,-LETTER<br />\nis appalling. I suppose they never<br />\nheard of the university which<br />\n\"closely linked with Hopkins LOMBARD and SOUTH STREETS<br />\nshares nation-wide repute as grad<br />\nuate schools.\"<br />\nNeither is the flattery given to<br />\nPresident Atwood by calling him<br />\nDr. Clarke called for, as in the preafternoon.<br />\nvious paragraph President GoodIndividual Scoring of Team<br />\nnow was quoted as saying that<br />\nIndividual scores are as follows:<br />\nPresident<br />\nAtwood was the leading<br />\nSteck, 356; Wilgis, 351; Rowland,<br />\n354; Tasche, 355; and Kaufman, geographer of modern times.<br />\nFor the benefit of these individ338. Edward Mount went with the<br />\nuals<br />\nI would like to say that the<br />\nmen as manager. The team was<br />\nspeaker<br />\nat the assembly on Januaccompanied by Capt. Davis and<br />\nIt's a queer one, a puzzler—and<br />\nary<br />\n17th<br />\nwas President Wallace<br />\nLieut. William I. Sherwood.<br />\nyet it's true! He has found<br />\nsomething which gives him<br />\nThe Homewood team won over W. Atwood, of Clark University,<br />\npleasure, and the most incorrigWest Virginia last week, 3582 to Worcester, Massachusetts.<br />\nible pessimist must admit it's<br />\nbeneficial.<br />\n3171. A shoot with Ohio State was<br />\nA CLARK ALUMNUS.<br />\n\"Vaseline\" Hair Tonic is the reason<br />\nheld last week, but the Buckeye's<br />\nfor this unique experience. It's the<br />\nclassiest hair dressing ever, gives<br />\nteam did not shoot because of unIt is said that an absent-minded<br />\nsnap and polish to the head. And—<br />\nit helps the scalp.<br />\nexpected circumstances and their professor in the university once<br />\nAt all drug stores and student<br />\nscore will be received Saturday of poured syrup down his back and<br />\nbarber shops.<br />\nEvery \"Vaseline\" product is recthis week, it is thought by Capt. scratched the pancake.—Augwan.<br />\nommended everywhere because of<br />\nits absolute purity and effectiveness.<br />\nW. S. Paul, rifle team coach.<br />\nTwo positions will be fired with<br />\nFather—Great heavens, son, how<br />\nMaine University this week—prone you do look!<br />\nSon—Yes, father, I fell in a mud<br />\nand standing. De Pauw University, Greencastle, Ind., cancelled puddle.<br />\ntheir match because of impending<br />\nFather—What! And with your<br />\nnew pants on, too?<br />\nexaminations.<br />\nChesebroutjh<br />\nSon—Yes, father, I didn't have<br />\njc_9111,Vidate_LIL<br />\nWife (finding husband drunk)— time to take them off.—Whirlwind.<br />\nJohn, this is the last straw.<br />\nHusband — Thass awright,<br />\nm'dear ; I never use 'em. Jesh give<br />\nme the bottle.—Chaparral.<br /><br />\n\"How's the boy getting along at<br />\nJanuary 31<br />\ncollege, Si?\"<br />\nChemistry 3<br />\nM. E. 114<br />\n\"Fine! He's taken up swimming<br />\nEnglish Comp. 1<br />\nMain Lib.<br />\nN. &amp; S. now. In his last letter he says he<br />\nEnglish Lit. 5<br />\nG. 311<br />\nspends all his time at Kelly pool.\"<br />\nGerman 2<br />\nG. 305<br />\n—Witt.<br />\nGreek 1<br />\nG. 100<br />\nHebrew (2d year)<br />\nG. 312<br />\nHighway Engineering C. E. 307<br />\nMath. 3 (M. T.<br />\nW. 10:30 sec.)<br />\nG. 8<br />\nPhysics 1 A-R<br />\nC. E. 120<br />\nPhysics 1 S-Z<br />\nM. E. 109<br />\nPolitical Econ. 2<br />\nG. 314<br />\nPolitical Econ. 4<br />\nG. 313<br />\nAfternoon (2-4 P. M.)<br />\nPublic Speaking<br />\nMain Lib. N.<br /><br />\nTHE NEWS-LETTER<br />\nMAILBAG<br /><br />\nhow to pray?<br />\nParson (eagerly)-1 do.<br />\nCapt.—All right, you pray; the<br />\nrest of us will put on life belts.<br />\nThere's one shy.—Penn Punch<br />\nBowl.<br /><br />\nSunday morning worship at 11 o'clock.<br />\nSunday evening service at 8 o'clock.<br />\nMusic by vested chorus—choir of soloists.<br />\n\"At the heart of the City\"<br /><br />\nALL SEATS FREE<br /><br />"}], "field_media_file": [{"target_id": 37823, "display": null, "description": null, "target_type": "file", "target_uuid": "3976c7cb-daee-4f6a-a0be-1b292e2f4a6d", "url": "http://digital.library.jhu.edu/system/files/2022-03/13155-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13155, "target_type": "node", "target_uuid": "b52e18c2-45b9-475f-825a-7cd6b8782b8a", "url": "/node/13155"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "be4a4941-0f6f-4cb1-bfa8-830fc3468cb6"}]}