{"mid": [{"value": 39316}], "uuid": [{"value": "23e1afdf-3d85-40b2-ac2b-cec0272b5656"}], "vid": [{"value": 39316}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T19:27:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13918-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T19:27:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T19:27:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "*<br />\nEXTRA<br />\nVOL. LXXI, NO. 13<br />\n<br />\nNang<br />\n<br />\nEXTRA<br />\n1471.ittrr<br />\n<br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND, JANUARY 19, 1967<br />\n<br />\n71ST YEAR<br />\n<br />\n41 11. PICKS GORDON<br />\nRusk Assistant<br />\nNew President<br />\nLincoln Gordon, assistant secretary of state for InterAmerican affairs, has been elected ninth president of<br />\nthe Johns Hopkins. He succeeds Milton S. Eisenhower<br />\nwho has been president since 1956.<br />\nAnnouncement of Dr. Gordon's election was made by<br />\nRobert D. H. Harvey, vice-chairman of the University's<br />\nBoard of Trustees, at a news conference called immediately following a special meeting of the 36-member<br />\nBoard of Trustees.<br />\nA simultaneous announcement of Dr. Gordon's resignation from his State Department post was made by<br />\nthe White House.<br />\nDr. Gordon, who is 53 years old, will take office on<br />\nJuly 1, 1967, with formal inauguration at a later date.<br />\nThe new Hopkins president, a political economist and<br />\nforeign affairs expert, is a Harvard graduate, Rhodes<br />\nScholar, Phi Beta Kappa, and holder of a Doctor of<br />\nPhilosophy degree from Oxford University in England.<br />\nHe occupied a prestigious professorial chair at Harvard<br />\nfor a number of years, and served in Washington with<br />\nvarious agencies during and since World War II. He<br />\nwas a major participant in the formulation of the<br />\nMarshall Plan for European Recovery and later the<br />\nAlliance for Progress with Latin America, is the author<br />\nof several books, and was Ambassador to Brazil for four<br />\nand one half years.<br />\nDr. Eisenhower announced last April his desire to<br />\nretire on June 30, 1967, and since that time the Board<br />\nof Trustees has been actively engaged in the search for<br />\nhis successor.<br />\nIn a prepared statement, Mr. Garland said: \"It is my<br />\ngreat pleasure to announce publicly that the Board of<br />\nTrustees has unanimously elected Lincoln Gordon to be<br />\nLINCOLN GORDON<br />\nthe ninth president of Johns Hopkins. After long and<br />\nserious deliberation, the Board came to the clear decision he was the one man who had the precise talents<br />\nwe felt were necessary to lead Johns Hopkins at this<br />\ncritical point in its history and to carry on the extraordinary pace of progress set by Milton Eisenhower.<br />\n\"Dr. Gordon is an outstanding scholar of demonstrated accomplishment who himself Jas served as a<br />\nsenior professor at one of our most distinguished sister<br />\nBy DAVID SCHNEIDERMAN<br />\ntime the Trustees had a long list of names (approxi- institutions; he is a superbly skilled administrator with<br />\nmately 150). which had to be reduced to a workable a rich and varied background, so vital in running the<br />\nThe announcement of Lincoln Gordon as the ninth<br />\nnumber. Mr. Garland mentioned that the Trustees were affairs of a modern, complex university; and he is an<br />\nPresident of the Hopkins culminates a search that<br />\nnot working on a strict time table, but it was necessary articulate, dedicated man who has devoted his life to the<br />\nbegan last April when Milton S. Eisenhower informed<br />\nto make the final decision far enough in advance in service of mankind and the pursuit of knowledge.\"<br />\nthe Board of Trustees that he would retire on June 30,<br />\nThe new Hopkins president was born in New York<br />\norder to facilitate the change in administration. By<br />\n1967. The process of selection was entirely in the hands<br />\nearly October (when the full Board of Trustees meets) City on September 10, 1913. He attended Harvard Uniof the Trustees and they immediately made preparaversity where he earned the A.B. degree summa cum<br />\nthe list had been reduced to 21 candidates.<br />\ntions for a wide-ranging study of the situation.<br />\nThe list of 21 was given to a faculty committee that laude in 1933, then was named a Rhodes Scholar and<br />\nA small committee of trustees was appointed to act was asked to confidentially<br />\nevaluate the 21 names. studied at Oxford University in England. He received<br />\nas a screening committee for possible candidates and in<br />\nAmong the members of the committee were the heads from Oxford a Doctor of Philosophy degree in 1936.<br />\nthe end to make a recommendation to the Trustees. of the departments<br />\nDr. Gordon is the author, co-author, or editor of eight<br />\nof the University. By the end of<br />\nThe screening committee was headed by U.S. Circuit<br />\nthe year, the Trustees were considering about a half books: The Public Corporation in Great Britain (1938);<br />\nCourt Judge Harrison L. Winter. The first job of the<br />\nGovernment and the American Economy (1941, revised<br />\ndozen candidates for the job.<br />\ncommittee was to find out what type of man Hopkins<br />\n1948); Fuel and Power in Industrial Location and Naneeds at this time in its history. According to Charles<br />\nIdeal Man<br />\ntional Policy (1942); Representation of the U.S. Abroad<br />\nS. Garland, Chairman of the Board of Trustees, \"It was<br />\nWhen asked to describe the ideal man for the job (1956, revised 1964); United States Manufacturing Inseveral months before we even talked about individMr. Garland said, smiling,\"another Milton Eisenhower.\" vestment in Brazil (1961); A New Deal for Latin<br />\nuals.\" The general categories considered were age, He added that hopefully the right man would be be- America<br />\n(1963); Intefnational Stability and Progress:<br />\nbackground, maturity, personality and maturity. Mr. tween 48-55 year old and willing to spend 10, 12 or 15 U.S.<br />\nInterests and Instruments (1957); and Foreign<br />\nGarland emphasized that these were not str;ngent reyears at the job. Also, he should be a scholar, adminis- Trade Policy, House Ways and Means Committee (1957).<br />\nquirements, every category had a degree of rie>.1*.ility. trator, first-rate fund raiser and ail effective public<br />\nDr. Gordon has been a trustee of the World Peace<br />\nSpecific Individuals<br />\nrelations man. But Mr.'Garland said, \"A compromise Foundation, the Center for International Economic<br />\nAfter reaching a general agreement on the type of<br />\nmay be necessary since the man I am describing would Growth vnd the Longy School of Music. He is a fellow<br />\nman desired, the Trustees for the first time began to<br />\nhave to be almost a superman.\"<br />\nof the American Academy of Arts and Sciences and a<br />\nconsider specific 'individuals. Faculty members, trustees,<br />\nBy January, the Trustees were still in the process of member of the American Economics Association, the<br />\nfoundation leaders and government leaders were asked<br />\nselecting the next President of Hopkins. At this time, Council on Foreign Relations, and the Royal Economic<br />\nfor suggestions. Among the people .consulted were: a small number of candidates were approached con- Society.<br />\nJohn Gardner, Secretary of Health, Education and Wel- cerning the job. When the decision was finally made<br />\nHe was married to the former Allison Wright on<br />\nfare, officials of the Ford, Rockefeller and .Carnegie and the Trustees voted, Lincoln Gordon was appointed<br />\nJune 25, 1937, and the couple has four children, Anne<br />\nFoundations and Juan Tripp of Pan A merican. At this<br />\nPresident of The Johns Hopkins University.<br />\n26, Robert W. 25, Hugh B. 21, and Amy A. 17.<br />\n<br />\nTrustees SearchforPresident;<br />\nWanted 'A notherEisenhower'<br />\n<br />\n\fHOMEWOOD, BALTIMORE, JANUARY 19, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE TWO<br />\n<br />\n'Growth'Byword of Eisenhower's<br />\nTen Years at the Hopkins<br />\nThe following is a review of the highlights of Hopkins<br />\nhistory during Milton S. Eisenhower's ten years as<br />\nUniversity president.<br />\nBy MARSHALL PAUL<br />\n<br />\nTimes survey of U.S. grad schools. It still made headlines, however, when Milton Eisenhower, with Walter<br />\nReuther and Mrs. Franklin D. Roosevelt negotiated the<br />\nexchange of 500 American tractors for 1,214 Cuban<br />\nprisoners. A little while later, construction began on<br />\nthe Homewood campus's Carnegie Institute embryology<br />\nlab, and Dwight Eisenhower joined the Board of<br />\nTrustees.<br />\nThe fall of 1961 featured the Hopkins Poetry Festival<br />\nand four Pulitzer Prize winners—Robert Lowell, Theodore Roethke, Peter Vierock, and Richard Wilbur. During that school year thirty acres of Wyman Park were<br />\nacquired from Baltimore City, work began on Barton<br />\nHall, and Norman Thomas lectured.<br />\n<br />\nMilton S. Eisenhower stepped into the University<br />\npresidency as a time when one third of the undergraduate population was protesting that it would transfer if the annual tuition were raised to $1,000.<br />\nThe year was 1957. In his installment address in<br />\nFebruary Eisenhower declared that Hopkins must<br />\nstrengthen its faculty, increase salaries, improve facilities, and attract better students. Almost immediately<br />\nafterward, the University Biophysics Department was<br />\nLattimore Leaves<br />\nwilled $5 million. In September the new president announced that the school needed $73 million for expanThe University's income hit a record $77 million in<br />\nsion. One of the first responses was a $750,000 Ford 1962. That year controversial Far East expert Owen<br />\nFoundation grant to start a Department of Social Sci- Lattimore announced he was leaving Hopkins; plans<br />\nences. Another response was the Ad Club of Baltimore's were revealed for a new Oceanography Building and an<br />\nnaming Eisenhower as its \"Man of the Year.\"<br />\nannex to Remsen ; and the school completed its plans<br />\nHopkins stayed in the headlines in the spring of 1958 for a five-year International Relations program. Bewhen both Prime Minister Harold MacMillan and Presi- tween September 1963 and June 1964 other steps were<br />\ndent Dwight David Eisenhower agreed to speak at the taken in Eisenhower's expansion program. The UniverUniversity commencement exercises, and Political sity purchased the Greenway Apartments and began<br />\neconomy professor Clarence Long won a seat in Con- construction of the Newton White Athletic Center and<br />\ngress.<br />\nthe then unnamed Research Library. Meanwhile, EisenIncome Goes Up<br />\nhower's presence helped attract such notable speakers<br />\nBetween September 1958 and June 1959 Eisenhower as Nelson Rockefeller, and Richard Nixon.<br />\nIn October of 1964 Lyndon Johnson addressed a crowd<br />\nrevealed that the University's income was up ten per<br />\ncent to $40 million; Jenkins Hall expansion began; and of nearly 10,000 in the Gilman quadrangle. He returned<br />\nJames S. Coleman arrived to head the new Department again in the spring to speak in Shriver Hall. During the<br />\ninterval Senators Wayne Morris and William Fullbright<br />\nof Social Relations. Hopkins also tied for its third<br />\nand Rev. Martin Luther King stood before Hopkins<br />\nstraight National Intercollegiate lacrosse title. After a<br />\nsummer tour of the Soviet Union with Richard Nixon, audiences. Even bigger news, however, was the compleEisenhower returned in September of 1959 to accept a tion of plans for Hopkins' $4.5 million Humanities Pro$3 million Ford grant for the expansion of the Univer- gram for graduate and post-grad research.<br />\nThe University's statistically best freshman class<br />\nsity's SAIS program. Hopkins also attracted widespread publicity that year when the Gilman Hall clock ever arrived on campus in September of 1966; Theater<br />\ntower was painted by pranksters like a Mickey Mouse Hopkins was launched; and Fredric C. Lane, former<br />\nPresident of the American Historical Society, retired as<br />\nwatch.'<br />\nIn September of the next year the University was head of the University's History Department. In May<br />\nstunned to find itself out of the top ten in a New York Eisenhower announced his retirement.<br />\n<br />\n4,<br />\n<br />\nDR. MILTON EISENHOWER<br />\n<br />\nGilman Opened<br />\nHopkins As 1st<br />\nU.S. University<br />\n<br />\nHopkins Presidency Highlighted<br />\nBy DENNIS ESTIS<br />\nDevotion to the continual development of educational<br />\nexcellence has been the primary mark of the eight individuals who have occupied the office of president of<br />\nthe Johns Hopkins University.<br />\nFrom the first president, Daniel Coit Gilman, to the<br />\ncurrent executive, Dr. Milton Eisenhower, the occupants<br />\nof that office have maintained programs of progress,<br />\ninnovation, and excellence which have taken precedence<br />\nover all the other concerns of the nation's first true<br />\nUniversity.<br />\nRemsen Succeeds Gilman<br />\nThe successor proved to be a choice between two of<br />\nthe First President's appointments, Rensen or Gildersleeve. The Board of Trustees chose the younger of the<br />\ntwo outstanding men and Dr. Remsen became Hopkins'<br />\nsecond president.<br />\nDr. Remsen was responsible for the difficult task of<br />\ntransferring the school from downtown Baltimore to<br />\nthe Homewood campus. He never really liked being<br />\npresident, preferring to work in his laboratory. In<br />\n1913, ill health forced him into retirement, and the<br />\nBoard of Trustees were once again faced with the difficult task of finding a replacement.<br />\nFrank Johnson Goodnow, a member of the Columbia<br />\nUniversity Faculty and former constitutional advisor to<br />\nYuan Shih-Kai, President of the Republic of China, was<br />\nappointed the third president.<br />\nGoodnow<br />\nAmherst as an underattended<br />\nGoodnow, who had<br />\ngraduate, received his law degree from Columbia in<br />\n1882, and began teaching there two years later as<br />\nProfessor of administrative law. Coming to Hopkins in<br />\n1914, Goodnow started a tradition among Hopkins presidents of initiating certain long range \"plans\" for betterment of the University. He put forward the \"Goodnow<br />\nPlan\" in 1925 aiming to make certain changes in the<br />\nbasic educational policy here.<br />\nAmes<br />\nOnce again it became necessary to choose a new president. Joseph Sweetman Ames, a Hopkins undergrad,<br />\ngraduate student, and professor, was named to the position. After receiving his Ph.D. in 1890, Ames was soon<br />\nappointed Professor of Physics and in 1901, chief director of the Physics Laboratory.<br />\nA noted author in the field of physics, he was selected<br />\nDean of the College Faculty, serving from 1924-29, and<br />\n<br />\nProvost in 1926. As president, Dr. Ames attempted to<br />\ninstitute the Goodnow Plan, but met a similar fate as<br />\nhis predecessor.<br />\nHe was responsible to doing away with commercialization in Hopkins athletic programs. Retiring in the<br />\nmiddle of the 1930's, Ames was appointed President<br />\nemeritus.<br />\nBowman<br />\nIsaiah Bowman, Director of the American Geographical Society of New York since 1915 was chosen as the<br />\nUniversity's Fifth President. Graduating from Harvard<br />\nin 1905, Bowman obtained his Ph.D. from Yale in 1909<br />\nremaining there to teach for six years.<br />\nDr. Bowman served during a period of relative calm<br />\nand stationary educational policies at the University.<br />\nAfter serving through the end of the depression and<br />\nthe war years, Dr. Bowman retired in 1948 and died two<br />\nyears later in January, 1950.<br />\nBronk<br />\nDetlev Wulf Bronk became the next in the line of<br />\nexcellent scholars and educators to assume the position<br />\nof president. Bronk, a graduate of Swarthmore College,<br />\nhad obtained his Ph.D. in Physics from the University<br />\nof Pennsylvania. He served as an instructor in that<br />\nfield until he was appointed to a full professorship at<br />\nSwarthmore in 1928. In 1927, he had become Dean of<br />\nmen at that school. For the next twenty years, Bronk<br />\nwas Professor of Biophysics and Director of the Eldridge Reeves Johnson Research Foundation at the University of Pennsylvania. During the war years, he was<br />\nchairman of the National Research Council.<br />\nThe primary achievement of Dr. Bronk during his<br />\nfive years as President was the institution of a new<br />\nacademic plan appropriately entitled the \"Bronk Plan.\"<br />\nIt was basically an attempt to break down the barriers<br />\nbetween the graduate and undergraduate students, and<br />\na crossing over of academic disciplines.<br />\nReed from Retirement<br />\nBronk's sudden retirement in 1953 to accept the position of President of the Rockefeller Institute for Medical<br />\nResearch caused a frantic search for a replacement.<br />\nLowell J. Reed, past Vice President of Hopkins and<br />\nretired himself, reluctantly accepted the position until<br />\na new man could be obtained.<br />\nIn 1956, he retired for the last time, being replaced by<br />\nthe President of Penn State and the brother of the then<br />\nPresident of the U.S., Dr. Milton Eisenhower.<br />\n<br />\nIn the Spring of 1874 Daniel Colt Gilman was an<br />\naccomplished scholar, a world renowned educator, and<br />\nquite secure in his position as President of the University of California. At the same time, the Johns Hopkins<br />\nUniversity, an idea first conceived by a reticent Baltimore merchant and later given direction by a determined Board of Trustees, was searching for a president.<br />\nBut in December of that same year Gilman accepted<br />\nthe challenge of a new idea in American education and<br />\ncame to Baltimore as the first President of the new<br />\nUniversity.<br />\nPursuit of Truth<br />\nIn his formal acceptance letter to the Board, a work<br />\nnow considered a cornerstone for intellectual freedom,<br />\nhe wrote:<br />\n\"The Institution we are about to organize would not<br />\nbe worthy the name of a University, if it were to be<br />\ndevoted to any other purpose than the discovery and<br />\npromulgation of the truth; and it would be ignoble in<br />\nthe extreme if the resources which have been given by<br />\nthe Fopnder without restrictions should be limited to<br />\nthe maintenance of ecclesiastical differences or perverted to the promotion of political strife.<br />\n\"As the spirit of the University should be that of<br />\nintellectual freedom in the pursuit and of broadest<br />\ncharity toward those from whom we differ in opinion<br />\nit is certain that sectarian and partisan preferences<br />\nshould have no control in the selection of teachers, and<br />\nshould not be apparent in their official work.<br />\n\"We should hope that the faculty soon to be chosen<br />\nwill be so catholic in spirit; so learned as to what has<br />\nbeen discovered and so keen to explore new fields of<br />\nresearch; so skillful as teachers; so cooperative as<br />\nbuilders; and so comprehensive in the specialties to<br />\nwhich they are devoted, that pupils will flock to their<br />\ninstruction ... from the remotest parts of the land.\"<br />\nFound A University<br />\nTo Gilman the concept of a university meant many<br />\nthings. He had long admired 'the European, especially<br />\nGerman, school system; he was aware that in order for<br />\nan educational system to be complete there must exist<br />\nsome place where new research and intellectual pursuits<br />\ncould be carried on free from external demands.<br />\nNever the less, Gilman had no intention of establishing a \"German\" university of America. He realized that<br />\na true university should not supplement society for the<br />\nscholar but should actually complement it. In fact it<br />\nwas for this reason that Gilman finally decided to make<br />\nHopkins an undergraduate and not just graduate institution; he felt his University owed too much to Baltimore to allow it \"to send its young men elsewhere for<br />\ncollege training.\"<br />\nSearch for Faculty<br />\nGilman's first problem was to find a competent<br />\nfaculty to staff his school. His first stroke of luck<br />\noccurred when he met Henry Rowland, a virtually unknown physics instructor at Rensselaer. He was immediately impressed with Rowland's insight and ability<br />\nand offered him a position teaching and doing research<br />\nat Hopkins. Rowland, soon Professor of Physics, accepted, and his revolutionary methods in optical and<br />\nspectroscopic methods helped give Hopkins a worldwide reputation in experimental physics.<br />\nIn a short time President Gilman had assembled a<br />\ndistinguished, if small, faculty consisting of Basil<br />\nGildersleeve, professor of Greek and considered the<br />\n\"greatest American Hellenist,\" Ira Remsen, professor<br />\nof chemistry and later the second President of the University, J. J. Sylvester, professor of mathematics, H.<br />\nNewell Martin, professor of biology, and Charles D.<br />\nMorris, professor of Latin and Greek.<br />\n<br />\nlb<br />\n<br />\n\f", "format": "basic_html", "processed": "*<br />\nEXTRA<br />\nVOL. LXXI, NO. 13<br /><br />\nNang<br /><br />\nEXTRA<br />\n1471.ittrr<br /><br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND, JANUARY 19, 1967<br /><br />\n71ST YEAR<br /><br />\n41 11. PICKS GORDON<br />\nRusk Assistant<br />\nNew President<br />\nLincoln Gordon, assistant secretary of state for InterAmerican affairs, has been elected ninth president of<br />\nthe Johns Hopkins. He succeeds Milton S. Eisenhower<br />\nwho has been president since 1956.<br />\nAnnouncement of Dr. Gordon's election was made by<br />\nRobert D. H. Harvey, vice-chairman of the University's<br />\nBoard of Trustees, at a news conference called immediately following a special meeting of the 36-member<br />\nBoard of Trustees.<br />\nA simultaneous announcement of Dr. Gordon's resignation from his State Department post was made by<br />\nthe White House.<br />\nDr. Gordon, who is 53 years old, will take office on<br />\nJuly 1, 1967, with formal inauguration at a later date.<br />\nThe new Hopkins president, a political economist and<br />\nforeign affairs expert, is a Harvard graduate, Rhodes<br />\nScholar, Phi Beta Kappa, and holder of a Doctor of<br />\nPhilosophy degree from Oxford University in England.<br />\nHe occupied a prestigious professorial chair at Harvard<br />\nfor a number of years, and served in Washington with<br />\nvarious agencies during and since World War II. He<br />\nwas a major participant in the formulation of the<br />\nMarshall Plan for European Recovery and later the<br />\nAlliance for Progress with Latin America, is the author<br />\nof several books, and was Ambassador to Brazil for four<br />\nand one half years.<br />\nDr. Eisenhower announced last April his desire to<br />\nretire on June 30, 1967, and since that time the Board<br />\nof Trustees has been actively engaged in the search for<br />\nhis successor.<br />\nIn a prepared statement, Mr. Garland said: \"It is my<br />\ngreat pleasure to announce publicly that the Board of<br />\nTrustees has unanimously elected Lincoln Gordon to be<br />\nLINCOLN GORDON<br />\nthe ninth president of Johns Hopkins. After long and<br />\nserious deliberation, the Board came to the clear decision he was the one man who had the precise talents<br />\nwe felt were necessary to lead Johns Hopkins at this<br />\ncritical point in its history and to carry on the extraordinary pace of progress set by Milton Eisenhower.<br />\n\"Dr. Gordon is an outstanding scholar of demonstrated accomplishment who himself Jas served as a<br />\nsenior professor at one of our most distinguished sister<br />\nBy DAVID SCHNEIDERMAN<br />\ntime the Trustees had a long list of names (approxi- institutions; he is a superbly skilled administrator with<br />\nmately 150). which had to be reduced to a workable a rich and varied background, so vital in running the<br />\nThe announcement of Lincoln Gordon as the ninth<br />\nnumber. Mr. Garland mentioned that the Trustees were affairs of a modern, complex university; and he is an<br />\nPresident of the Hopkins culminates a search that<br />\nnot working on a strict time table, but it was necessary articulate, dedicated man who has devoted his life to the<br />\nbegan last April when Milton S. Eisenhower informed<br />\nto make the final decision far enough in advance in service of mankind and the pursuit of knowledge.\"<br />\nthe Board of Trustees that he would retire on June 30,<br />\nThe new Hopkins president was born in New York<br />\norder to facilitate the change in administration. By<br />\n1967. The process of selection was entirely in the hands<br />\nearly October (when the full Board of Trustees meets) City on September 10, 1913. He attended Harvard Uniof the Trustees and they immediately made preparaversity where he earned the A.B. degree summa cum<br />\nthe list had been reduced to 21 candidates.<br />\ntions for a wide-ranging study of the situation.<br />\nThe list of 21 was given to a faculty committee that laude in 1933, then was named a Rhodes Scholar and<br />\nA small committee of trustees was appointed to act was asked to confidentially<br />\nevaluate the 21 names. studied at Oxford University in England. He received<br />\nas a screening committee for possible candidates and in<br />\nAmong the members of the committee were the heads from Oxford a Doctor of Philosophy degree in 1936.<br />\nthe end to make a recommendation to the Trustees. of the departments<br />\nDr. Gordon is the author, co-author, or editor of eight<br />\nof the University. By the end of<br />\nThe screening committee was headed by U.S. Circuit<br />\nthe year, the Trustees were considering about a half books: The Public Corporation in Great Britain (1938);<br />\nCourt Judge Harrison L. Winter. The first job of the<br />\nGovernment and the American Economy (1941, revised<br />\ndozen candidates for the job.<br />\ncommittee was to find out what type of man Hopkins<br />\n1948); Fuel and Power in Industrial Location and Naneeds at this time in its history. According to Charles<br />\nIdeal Man<br />\ntional Policy (1942); Representation of the U.S. Abroad<br />\nS. Garland, Chairman of the Board of Trustees, \"It was<br />\nWhen asked to describe the ideal man for the job (1956, revised 1964); United States Manufacturing Inseveral months before we even talked about individMr. Garland said, smiling,\"another Milton Eisenhower.\" vestment in Brazil (1961); A New Deal for Latin<br />\nuals.\" The general categories considered were age, He added that hopefully the right man would be be- America<br />\n(1963); Intefnational Stability and Progress:<br />\nbackground, maturity, personality and maturity. Mr. tween 48-55 year old and willing to spend 10, 12 or 15 U.S.<br />\nInterests and Instruments (1957); and Foreign<br />\nGarland emphasized that these were not str;ngent reyears at the job. Also, he should be a scholar, adminis- Trade Policy, House Ways and Means Committee (1957).<br />\nquirements, every category had a degree of rie&gt;.1*.ility. trator, first-rate fund raiser and ail effective public<br />\nDr. Gordon has been a trustee of the World Peace<br />\nSpecific Individuals<br />\nrelations man. But Mr.'Garland said, \"A compromise Foundation, the Center for International Economic<br />\nAfter reaching a general agreement on the type of<br />\nmay be necessary since the man I am describing would Growth vnd the Longy School of Music. He is a fellow<br />\nman desired, the Trustees for the first time began to<br />\nhave to be almost a superman.\"<br />\nof the American Academy of Arts and Sciences and a<br />\nconsider specific 'individuals. Faculty members, trustees,<br />\nBy January, the Trustees were still in the process of member of the American Economics Association, the<br />\nfoundation leaders and government leaders were asked<br />\nselecting the next President of Hopkins. At this time, Council on Foreign Relations, and the Royal Economic<br />\nfor suggestions. Among the people .consulted were: a small number of candidates were approached con- Society.<br />\nJohn Gardner, Secretary of Health, Education and Wel- cerning the job. When the decision was finally made<br />\nHe was married to the former Allison Wright on<br />\nfare, officials of the Ford, Rockefeller and .Carnegie and the Trustees voted, Lincoln Gordon was appointed<br />\nJune 25, 1937, and the couple has four children, Anne<br />\nFoundations and Juan Tripp of Pan A merican. At this<br />\nPresident of The Johns Hopkins University.<br />\n26, Robert W. 25, Hugh B. 21, and Amy A. 17.<br /><br />\nTrustees SearchforPresident;<br />\nWanted 'A notherEisenhower'<br /><br />\nHOMEWOOD, BALTIMORE, JANUARY 19, 1967<br /><br />\nNEWS-LETTER<br /><br />\nPAGE TWO<br /><br />\n'Growth'Byword of Eisenhower's<br />\nTen Years at the Hopkins<br />\nThe following is a review of the highlights of Hopkins<br />\nhistory during Milton S. Eisenhower's ten years as<br />\nUniversity president.<br />\nBy MARSHALL PAUL<br /><br />\nTimes survey of U.S. grad schools. It still made headlines, however, when Milton Eisenhower, with Walter<br />\nReuther and Mrs. Franklin D. Roosevelt negotiated the<br />\nexchange of 500 American tractors for 1,214 Cuban<br />\nprisoners. A little while later, construction began on<br />\nthe Homewood campus's Carnegie Institute embryology<br />\nlab, and Dwight Eisenhower joined the Board of<br />\nTrustees.<br />\nThe fall of 1961 featured the Hopkins Poetry Festival<br />\nand four Pulitzer Prize winners—Robert Lowell, Theodore Roethke, Peter Vierock, and Richard Wilbur. During that school year thirty acres of Wyman Park were<br />\nacquired from Baltimore City, work began on Barton<br />\nHall, and Norman Thomas lectured.<br /><br />\nMilton S. Eisenhower stepped into the University<br />\npresidency as a time when one third of the undergraduate population was protesting that it would transfer if the annual tuition were raised to $1,000.<br />\nThe year was 1957. In his installment address in<br />\nFebruary Eisenhower declared that Hopkins must<br />\nstrengthen its faculty, increase salaries, improve facilities, and attract better students. Almost immediately<br />\nafterward, the University Biophysics Department was<br />\nLattimore Leaves<br />\nwilled $5 million. In September the new president announced that the school needed $73 million for expanThe University's income hit a record $77 million in<br />\nsion. One of the first responses was a $750,000 Ford 1962. That year controversial Far East expert Owen<br />\nFoundation grant to start a Department of Social Sci- Lattimore announced he was leaving Hopkins; plans<br />\nences. Another response was the Ad Club of Baltimore's were revealed for a new Oceanography Building and an<br />\nnaming Eisenhower as its \"Man of the Year.\"<br />\nannex to Remsen ; and the school completed its plans<br />\nHopkins stayed in the headlines in the spring of 1958 for a five-year International Relations program. Bewhen both Prime Minister Harold MacMillan and Presi- tween September 1963 and June 1964 other steps were<br />\ndent Dwight David Eisenhower agreed to speak at the taken in Eisenhower's expansion program. The UniverUniversity commencement exercises, and Political sity purchased the Greenway Apartments and began<br />\neconomy professor Clarence Long won a seat in Con- construction of the Newton White Athletic Center and<br />\ngress.<br />\nthe then unnamed Research Library. Meanwhile, EisenIncome Goes Up<br />\nhower's presence helped attract such notable speakers<br />\nBetween September 1958 and June 1959 Eisenhower as Nelson Rockefeller, and Richard Nixon.<br />\nIn October of 1964 Lyndon Johnson addressed a crowd<br />\nrevealed that the University's income was up ten per<br />\ncent to $40 million; Jenkins Hall expansion began; and of nearly 10,000 in the Gilman quadrangle. He returned<br />\nJames S. Coleman arrived to head the new Department again in the spring to speak in Shriver Hall. During the<br />\ninterval Senators Wayne Morris and William Fullbright<br />\nof Social Relations. Hopkins also tied for its third<br />\nand Rev. Martin Luther King stood before Hopkins<br />\nstraight National Intercollegiate lacrosse title. After a<br />\nsummer tour of the Soviet Union with Richard Nixon, audiences. Even bigger news, however, was the compleEisenhower returned in September of 1959 to accept a tion of plans for Hopkins' $4.5 million Humanities Pro$3 million Ford grant for the expansion of the Univer- gram for graduate and post-grad research.<br />\nThe University's statistically best freshman class<br />\nsity's SAIS program. Hopkins also attracted widespread publicity that year when the Gilman Hall clock ever arrived on campus in September of 1966; Theater<br />\ntower was painted by pranksters like a Mickey Mouse Hopkins was launched; and Fredric C. Lane, former<br />\nPresident of the American Historical Society, retired as<br />\nwatch.'<br />\nIn September of the next year the University was head of the University's History Department. In May<br />\nstunned to find itself out of the top ten in a New York Eisenhower announced his retirement.<br /><br />\n4,<br /><br />\nDR. MILTON EISENHOWER<br /><br />\nGilman Opened<br />\nHopkins As 1st<br />\nU.S. University<br /><br />\nHopkins Presidency Highlighted<br />\nBy DENNIS ESTIS<br />\nDevotion to the continual development of educational<br />\nexcellence has been the primary mark of the eight individuals who have occupied the office of president of<br />\nthe Johns Hopkins University.<br />\nFrom the first president, Daniel Coit Gilman, to the<br />\ncurrent executive, Dr. Milton Eisenhower, the occupants<br />\nof that office have maintained programs of progress,<br />\ninnovation, and excellence which have taken precedence<br />\nover all the other concerns of the nation's first true<br />\nUniversity.<br />\nRemsen Succeeds Gilman<br />\nThe successor proved to be a choice between two of<br />\nthe First President's appointments, Rensen or Gildersleeve. The Board of Trustees chose the younger of the<br />\ntwo outstanding men and Dr. Remsen became Hopkins'<br />\nsecond president.<br />\nDr. Remsen was responsible for the difficult task of<br />\ntransferring the school from downtown Baltimore to<br />\nthe Homewood campus. He never really liked being<br />\npresident, preferring to work in his laboratory. In<br />\n1913, ill health forced him into retirement, and the<br />\nBoard of Trustees were once again faced with the difficult task of finding a replacement.<br />\nFrank Johnson Goodnow, a member of the Columbia<br />\nUniversity Faculty and former constitutional advisor to<br />\nYuan Shih-Kai, President of the Republic of China, was<br />\nappointed the third president.<br />\nGoodnow<br />\nAmherst as an underattended<br />\nGoodnow, who had<br />\ngraduate, received his law degree from Columbia in<br />\n1882, and began teaching there two years later as<br />\nProfessor of administrative law. Coming to Hopkins in<br />\n1914, Goodnow started a tradition among Hopkins presidents of initiating certain long range \"plans\" for betterment of the University. He put forward the \"Goodnow<br />\nPlan\" in 1925 aiming to make certain changes in the<br />\nbasic educational policy here.<br />\nAmes<br />\nOnce again it became necessary to choose a new president. Joseph Sweetman Ames, a Hopkins undergrad,<br />\ngraduate student, and professor, was named to the position. After receiving his Ph.D. in 1890, Ames was soon<br />\nappointed Professor of Physics and in 1901, chief director of the Physics Laboratory.<br />\nA noted author in the field of physics, he was selected<br />\nDean of the College Faculty, serving from 1924-29, and<br /><br />\nProvost in 1926. As president, Dr. Ames attempted to<br />\ninstitute the Goodnow Plan, but met a similar fate as<br />\nhis predecessor.<br />\nHe was responsible to doing away with commercialization in Hopkins athletic programs. Retiring in the<br />\nmiddle of the 1930's, Ames was appointed President<br />\nemeritus.<br />\nBowman<br />\nIsaiah Bowman, Director of the American Geographical Society of New York since 1915 was chosen as the<br />\nUniversity's Fifth President. Graduating from Harvard<br />\nin 1905, Bowman obtained his Ph.D. from Yale in 1909<br />\nremaining there to teach for six years.<br />\nDr. Bowman served during a period of relative calm<br />\nand stationary educational policies at the University.<br />\nAfter serving through the end of the depression and<br />\nthe war years, Dr. Bowman retired in 1948 and died two<br />\nyears later in January, 1950.<br />\nBronk<br />\nDetlev Wulf Bronk became the next in the line of<br />\nexcellent scholars and educators to assume the position<br />\nof president. Bronk, a graduate of Swarthmore College,<br />\nhad obtained his Ph.D. in Physics from the University<br />\nof Pennsylvania. He served as an instructor in that<br />\nfield until he was appointed to a full professorship at<br />\nSwarthmore in 1928. In 1927, he had become Dean of<br />\nmen at that school. For the next twenty years, Bronk<br />\nwas Professor of Biophysics and Director of the Eldridge Reeves Johnson Research Foundation at the University of Pennsylvania. During the war years, he was<br />\nchairman of the National Research Council.<br />\nThe primary achievement of Dr. Bronk during his<br />\nfive years as President was the institution of a new<br />\nacademic plan appropriately entitled the \"Bronk Plan.\"<br />\nIt was basically an attempt to break down the barriers<br />\nbetween the graduate and undergraduate students, and<br />\na crossing over of academic disciplines.<br />\nReed from Retirement<br />\nBronk's sudden retirement in 1953 to accept the position of President of the Rockefeller Institute for Medical<br />\nResearch caused a frantic search for a replacement.<br />\nLowell J. Reed, past Vice President of Hopkins and<br />\nretired himself, reluctantly accepted the position until<br />\na new man could be obtained.<br />\nIn 1956, he retired for the last time, being replaced by<br />\nthe President of Penn State and the brother of the then<br />\nPresident of the U.S., Dr. Milton Eisenhower.<br /><br />\nIn the Spring of 1874 Daniel Colt Gilman was an<br />\naccomplished scholar, a world renowned educator, and<br />\nquite secure in his position as President of the University of California. At the same time, the Johns Hopkins<br />\nUniversity, an idea first conceived by a reticent Baltimore merchant and later given direction by a determined Board of Trustees, was searching for a president.<br />\nBut in December of that same year Gilman accepted<br />\nthe challenge of a new idea in American education and<br />\ncame to Baltimore as the first President of the new<br />\nUniversity.<br />\nPursuit of Truth<br />\nIn his formal acceptance letter to the Board, a work<br />\nnow considered a cornerstone for intellectual freedom,<br />\nhe wrote:<br />\n\"The Institution we are about to organize would not<br />\nbe worthy the name of a University, if it were to be<br />\ndevoted to any other purpose than the discovery and<br />\npromulgation of the truth; and it would be ignoble in<br />\nthe extreme if the resources which have been given by<br />\nthe Fopnder without restrictions should be limited to<br />\nthe maintenance of ecclesiastical differences or perverted to the promotion of political strife.<br />\n\"As the spirit of the University should be that of<br />\nintellectual freedom in the pursuit and of broadest<br />\ncharity toward those from whom we differ in opinion<br />\nit is certain that sectarian and partisan preferences<br />\nshould have no control in the selection of teachers, and<br />\nshould not be apparent in their official work.<br />\n\"We should hope that the faculty soon to be chosen<br />\nwill be so catholic in spirit; so learned as to what has<br />\nbeen discovered and so keen to explore new fields of<br />\nresearch; so skillful as teachers; so cooperative as<br />\nbuilders; and so comprehensive in the specialties to<br />\nwhich they are devoted, that pupils will flock to their<br />\ninstruction ... from the remotest parts of the land.\"<br />\nFound A University<br />\nTo Gilman the concept of a university meant many<br />\nthings. He had long admired 'the European, especially<br />\nGerman, school system; he was aware that in order for<br />\nan educational system to be complete there must exist<br />\nsome place where new research and intellectual pursuits<br />\ncould be carried on free from external demands.<br />\nNever the less, Gilman had no intention of establishing a \"German\" university of America. He realized that<br />\na true university should not supplement society for the<br />\nscholar but should actually complement it. In fact it<br />\nwas for this reason that Gilman finally decided to make<br />\nHopkins an undergraduate and not just graduate institution; he felt his University owed too much to Baltimore to allow it \"to send its young men elsewhere for<br />\ncollege training.\"<br />\nSearch for Faculty<br />\nGilman's first problem was to find a competent<br />\nfaculty to staff his school. His first stroke of luck<br />\noccurred when he met Henry Rowland, a virtually unknown physics instructor at Rensselaer. He was immediately impressed with Rowland's insight and ability<br />\nand offered him a position teaching and doing research<br />\nat Hopkins. Rowland, soon Professor of Physics, accepted, and his revolutionary methods in optical and<br />\nspectroscopic methods helped give Hopkins a worldwide reputation in experimental physics.<br />\nIn a short time President Gilman had assembled a<br />\ndistinguished, if small, faculty consisting of Basil<br />\nGildersleeve, professor of Greek and considered the<br />\n\"greatest American Hellenist,\" Ira Remsen, professor<br />\nof chemistry and later the second President of the University, J. J. Sylvester, professor of mathematics, H.<br />\nNewell Martin, professor of biology, and Charles D.<br />\nMorris, professor of Latin and Greek.<br /><br />\nlb<br /><br />"}], "field_media_file": [{"target_id": 40208, "display": null, "description": null, "target_type": "file", "target_uuid": "33af71e0-43ba-49e3-ae7d-c68b93c4d6ea", "url": "http://digital.library.jhu.edu/system/files/2022-03/13918-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13918, "target_type": "node", "target_uuid": "291ddc3d-598d-4bf8-81bb-2d62472a9c05", "url": "/node/13918"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "7e21e50d-3077-4859-b5ae-24484e75fc54"}]}